[
  {
    "id": "44480223",
    "title": "Get the location of the ISS using DNS",
    "url": "https://shkspr.mobi/blog/2025/07/get-the-location-of-the-iss-using-dns/",
    "summary": "This article details a quirky project using DNS LOC records to track the approximate location of the International Space Station (ISS). The author leverages the experimental DNS LOC record type, defined in RFC 1876, to store the latitude, longitude, and altitude of the ISS.\n\nThe project utilizes the N2YO API, which provides ISS positional data in JSON format. The author then converts this data, specifically latitude/longitude from decimal to degrees, minutes, and seconds, and altitude from km to meters to fit the LOC record format.\n\nThe updated location is stored in a LOC record for the domain `where-is-the-iss.dedyn.io`, which can be queried using the `dig` command on Linux and macOS. The author uses the deSEC DNS provider because they have an API that permits the updating of LOC records. Initial records are created with a POST request, and then updates are sent with a PATCH request. The Time To Live (TTL) is set to 900 seconds, with updates occurring every 15 minutes to stay within API limits.\n\nThe article highlights the unconventional use of DNS beyond typical domain name resolution, demonstrating its capability to store other types of data. The author also suggests the potential for using DNS TXT records as a means to distribute static or infrequently updated data. The project serves as a proof-of-concept for the diverse applications of DNS technology.\n",
    "chinese_title": "使用 DNS 获取国际空间站位置",
    "chinese_summary": "本文详细介绍了一个奇特的项目，该项目使用 DNS LOC 记录来追踪国际空间站 (ISS) 的大致位置。作者利用 RFC 1876 中定义的实验性 DNS LOC 记录类型来存储国际空间站的纬度、经度和海拔。\n\n该项目使用 N2YO API，该 API 提供 JSON 格式的国际空间站位置数据。然后，作者转换这些数据，特别是将纬度/经度从十进制转换为度、分、秒，并将海拔从千米转换为米，以适应 LOC 记录格式。\n\n更新后的位置存储在域名 `where-is-the-iss.dedyn.io` 的 LOC 记录中，可以使用 Linux 和 macOS 上的 `dig` 命令查询。作者使用 deSEC DNS 提供商，因为他们拥有允许更新 LOC 记录的 API。初始记录通过 POST 请求创建，然后通过 PATCH 请求发送更新。生存时间 (TTL) 设置为 900 秒，每 15 分钟更新一次，以保持在 API 限制范围内。\n\n本文重点介绍了 DNS 在典型域名解析之外的非常规用途，展示了它存储其他类型数据的能力。作者还建议可以使用 DNS TXT 记录作为分发静态或不经常更新的数据的一种手段。该项目作为 DNS 技术多种应用的概念验证。"
  },
  {
    "id": "44481464",
    "title": "Functions Are Vectors (2023)",
    "url": "https://thenumb.at/Functions-are-Vectors/",
    "summary": "This article argues that functions can be viewed as infinite-dimensional vectors, allowing the application of linear algebra to various problems. It begins by highlighting the abstract nature of vector spaces and how vectors, typically seen as lists of numbers, can be generalized to include entities like complex numbers, graph cycles, and magic squares. The author then explores extending this concept to functions, initially with countably infinite indices and then with uncountably infinite indices, mapping real numbers to values. This leads to the realization that a function *is* a vector in this context.\n\nThe article then formalizes this concept by outlining a functional vector space, using real functions from ℝ to ℝ, and defining scalar multiplication and vector addition for functions. Proofs are provided to demonstrate that these definitions satisfy the necessary vector space axioms.\n\nThe author further connects this to the standard basis, extending the idea of coordinate axes to functions that are 1 at a specific index and 0 elsewhere. Finally, the article introduces linear operators, analogous to matrices, and shows how these operators can transform functions. Differentiation, a linear operation, is used as an example in the subspace of polynomials, showcasing how differentiation acts as a linear transformation.\n",
    "chinese_title": "函数是向量 (2023)",
    "chinese_summary": "本文论证了函数可以被视为无限维向量，从而可以将线性代数应用于各种问题。文章首先强调了向量空间的抽象本质，以及向量如何从通常被视为数字列表的形式，推广到包含诸如复数、图循环和幻方等实体。然后，作者探讨了将这一概念扩展到函数，最初是可数无限个索引，然后是不可数无限个索引，将实数映射到值。这使得人们意识到，在这种背景下，函数*就是*一个向量。\n\n文章随后通过概述一个函数向量空间来形式化这一概念，使用从ℝ到ℝ的实函数，并为函数定义标量乘法和向量加法。文章提供了证明，以表明这些定义满足必要的向量空间公理。\n\n作者进一步将此与标准基联系起来，将坐标轴的思想扩展到在特定索引处为1，在其他地方为0的函数。最后，文章介绍了线性算子，类似于矩阵，并展示了这些算子如何变换函数。微分作为一种线性运算，被用作多项式子空间的一个例子，展示了微分如何作为线性变换起作用。"
  },
  {
    "id": "44481441",
    "title": "Hannah Cairo has solved the Mizohata-Takeuchi conjecture",
    "url": "https://english.elpais.com/science-tech/2025-07-01/a-17-year-old-teen-refutes-a-mathematical-conjecture-proposed-40-years-ago.html",
    "summary": "This article details how 17-year-old Hannah Cairo, a high school student from the Bahamas taking classes at UC Berkeley, solved the decades-old Mizohata-Takeuchi conjecture in harmonic analysis. The conjecture, if proven true, would have validated several other important results in the field. However, Cairo found a counterexample using fractals after realizing why proving the conjecture was so difficult. She convinced her professor, Ruixiang Zhang, of her solution.\n\nThe Mizohata-Takeuchi conjecture falls within harmonic analysis, which breaks down complex functions into simpler components like sinusoidal functions. This field is used in applications like audio/video compression and telecommunications. Cairo explained that harmonic analysis essentially builds everything from waves, and Fourier restriction theory studies what can be built with limited wave sets. The conjecture focused on shapes made of lines resulting from specific wave usage.\n\nCairo presented her findings at the 12th International Congress on Harmonic Analysis and Partial Differential Equations in El Escorial, Spain. She enjoys teaching and public speaking, and will begin her Ph.D. at the University of Maryland under Zhang's supervision, where she also hopes to start her own math group. Her journey began with exploring advanced math textbooks independently and participating in the Berkeley Math Circle summer camp.\n",
    "chinese_title": "汉娜·开罗解决了溝畑-竹内猜想。",
    "chinese_summary": "本文详细介绍了来自巴哈马的 17 岁高中生 Hannah Cairo，在加州大学伯克利分校学习期间，如何解决了调和分析领域几十年来的 Mizohata-Takeuchi 猜想。如果该猜想被证实为真，将验证该领域中其他几个重要的结果。然而，Cairo 在意识到证明该猜想的难度后，利用分形找到了一个反例。她使她的教授张瑞祥信服了她的解决方案。\n\nMizohata-Takeuchi 猜想属于调和分析范畴，该分析将复杂的函数分解为更简单的成分，例如正弦函数。这个领域被应用于音频/视频压缩和电信等领域。Cairo 解释说，调和分析本质上是用波构建一切，而傅里叶限制理论研究的是用有限的波集可以构建什么。该猜想的重点是使用特定波所产生的由线条构成的形状。\n\nCairo 在西班牙埃尔埃斯科里亚尔举行的第 12 届调和分析和偏微分方程国际大会上展示了她的发现。她喜欢教学和公开演讲，并将在张瑞祥的指导下，在马里兰大学开始她的博士学位，她也希望在那里建立自己的数学小组。她的旅程始于独立探索高级数学教科书和参加伯克利数学圈夏令营。"
  },
  {
    "id": "44478861",
    "title": "Overthinking GIS (2024)",
    "url": "https://scottsexton.co/post/overthinking_gis/",
    "summary": "This blog post, titled \"Overthinking GIS,\" details the author's quest to define and calculate a qualitative usability metric for land, specifically \"not too steep to build on,\" using publicly available GIS data. Frustrated that existing GIS tools didn't directly provide this metric, the author decided to derive it from USGS elevation data.\n\nThe author downloads high-resolution DEM (Digital Elevation Model) data and uses the Laplacian operator from OpenCV to calculate the second-order derivative of the elevation data. This highlights the rate of change of slope, effectively mimicking the information conveyed by topographic lines (close lines = steep, far apart = flat).\n\nTo quantify usability, the author implements a sliding window approach, calculating the average Laplacian value within each window. A threshold based on known \"steep\" and \"flat\" areas is applied, resulting in a binary \"usability\" map (steep = 0.75, flat = 0).\n\nThe author acknowledges that the process is overly complex and essentially achieves a downsampling of the Laplacian data. They speculate that blurring the Laplacian directly might produce similar results more efficiently. Despite this realization, they see value in the flexibility of their approach for future parameter adjustments. The post concludes by presenting the \"Usability Equation\" and hinting at improvements in a subsequent post.\n",
    "chinese_title": "GIS过度思考 (2024)",
    "chinese_summary": "过度思考GIS：作者尝试定义和计算土地可用性指标，具体指“坡度不宜建筑”，利用公开GIS数据。因现有GIS工具未能直接提供此指标，作者决定从美国地质调查局(USGS)高程数据中推导得出。\n\n作者下载了高分辨率数字高程模型(DEM)数据，并使用OpenCV的拉普拉斯算子计算高程数据的二阶导数，突显坡度变化率，有效模拟地形线所传达的信息（密集线=陡峭，疏散线=平坦）。\n\n为了量化可用性，作者采用滑动窗口方法，计算每个窗口内的平均拉普拉斯值。基于已知“陡峭”和“平坦”区域设置阈值，生成二元“可用性”地图（陡峭=0.75，平坦=0）。\n\n作者承认该过程过于复杂，本质上是对拉普拉斯数据进行降采样。他们推测直接模糊拉普拉斯数据可能会更有效地产生类似结果。尽管意识到这一点，他们仍然看到其方法的灵活性对于未来参数调整的价值。文章最后提出了“可用性公式”，并暗示将在后续文章中进行改进。"
  },
  {
    "id": "44482301",
    "title": "Metriport (YC S22) is hiring engineers to improve healthcare data exchange",
    "url": "https://www.ycombinator.com/companies/metriport/jobs/Rn2Je8M-software-engineer",
    "summary": "Metriport (YC S22), an open-source platform for healthcare data intelligence, is hiring a Software Engineer to improve healthcare data exchange. They help healthcare organizations access, analyze, and exchange patient data in real-time, integrating with major US healthcare IT systems and tapping into data for 300M+ individuals.\n\nThey are looking for an entrepreneurial-minded, experienced (6+ years), full-stack \"generalist\" engineer located in the San Francisco Bay Area who can build scalable systems, take ownership, and prioritize delivering value. Healthcare experience is a plus but not required.\n\nThe role involves driving projects end-to-end, writing design docs, reviewing PRs, and participating in planning sessions and a daily stand-up. Example projects include using LLMs for medical data transformation and building an OpenSearch cluster for patient medical history searches.\n\nMetriport offers a competitive salary ($125K - $250K), equity (0.10% - 0.50%), full benefits, a 401(k) with matching, flexible work arrangements, and unlimited PTO. Their tech stack includes Node.js, React, PostgreSQL, DynamoDB, HAPI FHIR, and AWS.\n\nThe interview process includes an initial call, a take-home coding challenge, a technical and cultural interview, and an on-site meeting with the founders. Metriport emphasizes a tight-knit, high-performing, and engineering-heavy team with a flat structure and high autonomy. They are a well-funded, multi-million ARR company with 80+ customers.\n",
    "chinese_title": "Metriport (YC S22) 正在招聘工程师，以改善医疗保健数据交换。",
    "chinese_summary": "Metriport (YC S22)，一个医疗数据智能开源平台，正在招聘软件工程师，以改进医疗数据交换。他们帮助医疗机构实时访问、分析和交换患者数据，与美国主要的医疗IT系统集成，并利用超过3亿人的数据。\n\n他们正在寻找一位具有创业精神、经验丰富（6年以上）、全栈“通才”工程师，位于旧金山湾区，能够构建可扩展的系统，承担责任，并优先交付价值。 医疗保健经验者优先，但非必需。\n\n该职位包括端到端地驱动项目，编写设计文档，审查PR，并参与计划会议和每日站会。 示例项目包括使用LLM进行医疗数据转换，以及构建用于患者病史搜索的OpenSearch集群。\n\nMetriport提供具有竞争力的薪资（12.5万至25万美元），股权（0.10%至0.50%），全额福利，带匹配的401(k)计划，灵活的工作安排以及无限制的PTO。 他们的技术栈包括Node.js、React、PostgreSQL、DynamoDB、HAPI FHIR和AWS。\n\n面试流程包括初步电话沟通、居家编程挑战、技术和文化面试，以及与创始人进行现场会面。 Metriport强调紧密的、高性能的、以工程为主的团队，具有扁平的结构和高度的自主性。 他们是一家资金充足、年经常性收入达数百万美元的公司，拥有80多家客户。"
  },
  {
    "id": "44476297",
    "title": "Hidden interface controls that affect usability",
    "url": "https://interactions.acm.org/archive/view/july-august-2025/stop-hiding-my-controls-hidden-interface-controls-are-affecting-usability",
    "summary": "This article, \"Stop Hiding My Controls: Hidden Interface Controls Are Affecting Usability\" by Philip Kortum, argues that modern interfaces are increasingly relying on \"hidden controls,\" requiring users to possess specific knowledge (\"knowledge in the head\") to perform even basic tasks, a regression from the user-friendly \"knowledge in the world\" principle championed by early graphical user interfaces with drop-down menus.\n\nThe author illustrates this with examples like the iPhone's hidden flashlight control, car features locked behind arcane button combinations, and Apple CarPlay's navigation interface where essential functions are hidden until a specific area of the screen is touched. Temporal controls, requiring actions like pressing and holding a button, further exacerbate the problem. Even professionals are affected, with statisticians reverting to command-line interfaces due to the perceived decline in usability of menu-driven statistical software.\n\nKortum attributes this trend to the proliferation of features and the desire for aesthetically minimalist designs, arguing that it's easier for designers to overcode existing controls or hide them altogether than to create visible, persistent controls for all states. He contrasts this with mission-critical systems that prioritize visible and persistent controls for immediate access.\n\nThe author concludes by advocating for a return to discoverable interfaces where users can easily understand and access a system's functions without prior knowledge. The goal should be usability for everyone, not just those who discover hidden features through external sources.\n",
    "chinese_title": "影响可用性的隐藏界面控件",
    "chinese_summary": "Philip Kortum 的文章《别再隐藏我的控件：隐藏式界面控件正在影响可用性》认为，现代界面越来越依赖于“隐藏式控件”，要求用户具备特定的知识（“头脑中的知识”）才能执行基本的任务，这是一种倒退，背离了早期图形用户界面中下拉菜单所倡导的、用户友好的“世界中的知识”原则。\n\n作者用 iPhone 隐藏的闪光灯控制、隐藏在神秘按钮组合后的汽车功能以及 Apple CarPlay 的导航界面（其中基本功能被隐藏，直到触摸屏幕特定区域）等例子来说明这一点。需要按住按钮等操作的时间控制进一步加剧了这个问题。即使是专业人士也受到了影响，统计学家由于认为菜单驱动的统计软件的可用性下降，而转而使用命令行界面。\n\nKortum 将这种趋势归因于功能的激增和对美学极简设计的渴望，他认为，对于设计师来说，过度编码现有控件或完全隐藏它们，比为所有状态创建可见的、持久的控件更容易。他将此与任务关键型系统进行对比，后者优先考虑可见且持久的控件以便立即访问。\n\n作者最后倡导回归到可发现的界面，用户无需事先了解即可轻松理解和访问系统的功能。目标应该是为每个人提供可用性，而不仅仅是那些通过外部来源发现隐藏功能的人。"
  },
  {
    "id": "44473135",
    "title": "Local-first software (2019)",
    "url": "https://www.inkandswitch.com/essay/local-first/",
    "summary": "This article advocates for \"local-first software,\" a paradigm shift in application design that prioritizes local data storage and ownership while retaining the benefits of cloud-based collaboration. The author argues that while cloud apps offer seamless collaboration and accessibility, they compromise user ownership and control over their data, leaving them vulnerable to service outages, shutdowns, and changes in pricing or features.\n\nLocal-first software aims to combine the advantages of both \"old-fashioned\" local apps and cloud apps by keeping the primary data copy on the user's device. This enables:\n\n*   **Speed and Responsiveness:** Eliminates delays caused by server round-trips, offering near-instantaneous feedback.\n*   **Cross-Device Synchronization:** Uses background synchronization to keep data consistent across multiple devices.\n*   **Offline Functionality:** Allows users to work uninterrupted even without an internet connection.\n*   **Seamless Collaboration:** Supports real-time collaboration comparable to cloud apps through technologies like Conflict-free Replicated Data Types (CRDTs).\n*   **Data Longevity:** Ensures long-term accessibility of data by storing both data and the software required to use it locally.\n*   **Enhanced Security and Privacy:** Reduces the risk of data breaches by minimizing centralized data storage.\n\nThe article outlines seven ideals for local-first software, promoting a future where users have full ownership and control over their data without sacrificing the convenience and collaborative power of modern applications.\n",
    "chinese_title": "本地优先软件 (2019)",
    "chinese_summary": "本文倡导“本地优先软件”，这是一种应用设计范式的转变，它优先考虑本地数据存储和所有权，同时保留基于云的协作的优势。作者认为，虽然云应用提供了无缝协作和可访问性，但它们牺牲了用户对其数据的所有权和控制权，使用户容易受到服务中断、关闭以及定价或功能变更的影响。\n\n本地优先软件旨在通过将主要数据副本保存在用户设备上，结合“老式”本地应用和云应用的优点。 这使得：\n\n*   **速度和响应性：** 消除服务器往返造成的延迟，提供近乎即时的反馈。\n*   **跨设备同步：** 使用后台同步来保持数据在多个设备上的一致性。\n*   **离线功能：** 即使没有互联网连接，也允许用户不间断地工作。\n*   **无缝协作：** 通过无冲突复制数据类型（CRDT）等技术，支持与云应用相当的实时协作。\n*   **数据长期性：** 通过在本地存储数据和使用数据所需的软件，确保数据的长期可访问性。\n*   **增强的安全性和隐私：** 通过最小化集中式数据存储来降低数据泄露的风险。\n\n本文概述了本地优先软件的七个理想，倡导一个用户拥有对其数据的完全所有权和控制权，同时又不牺牲现代应用的便利性和协作能力的未来。"
  },
  {
    "id": "44476716",
    "title": "Serving 200M requests per day with a CGI-bin",
    "url": "https://simonwillison.net/2025/Jul/5/cgi-bin-performance/",
    "summary": "This article discusses the surprising viability of using CGI (Common Gateway Interface) for handling web requests in 2025, despite its perceived inefficiency in the late 1990s. Jake Gold tested a Go + SQLite CGI program on a 16-thread AMD 3700X and found it capable of serving over 200 million requests per day (2400+ requests per second).\n\nThe author reflects on how CGI, which starts a new process for each request, was quickly deemed inefficient back in the day, leading to the development of technologies like PHP and FastCGI. However, the significant advancements in hardware, particularly CPU speeds and core counts, combined with the use of faster languages like Go and Rust, make CGI a more viable option. He points out that CGI programs excel at utilizing multiple CPU cores due to their process-based architecture.\n\nThe author emphasizes that he's not necessarily advocating for widespread adoption of CGI, but rather highlighting that it's no longer as impractical as it once was. The article suggests revisiting older technologies with modern tools and hardware, and recognizing that performance bottlenecks of the past might not be relevant anymore.\n",
    "chinese_title": "使用CGI-bin每天处理2亿次请求",
    "chinese_summary": "尽管在 20 世纪 90 年代末人们普遍认为 CGI（通用网关接口）效率低下，但本文探讨了在 2025 年使用 CGI 处理 Web 请求的令人惊讶的可行性。Jake Gold 在 16 线程 AMD 3700X 上测试了一个 Go + SQLite CGI 程序，发现它每天能够处理超过 2 亿个请求（每秒 2400 多个请求）。\n\n作者回顾了 CGI 如何因为每个请求启动一个新进程而被迅速认为效率低下，从而导致了 PHP 和 FastCGI 等技术的发展。 然而，硬件方面的显著进步，特别是 CPU 速度和核心数量的增加，再加上使用像 Go 和 Rust 这样更快的语言，使得 CGI 成为一个更可行的选择。 他指出，由于 CGI 程序基于进程的架构，因此擅长利用多个 CPU 核心。\n\n作者强调，他并不一定提倡广泛采用 CGI，而是强调它不再像过去那样不切实际。 本文建议使用现代工具和硬件重新审视旧技术，并认识到过去的性能瓶颈可能不再具有相关性。"
  },
  {
    "id": "44481135",
    "title": "Toys/Lag: Jerk Monitor",
    "url": "https://nothing.pcarrier.com/posts/lag/",
    "summary": "The author, sensitive to latency since upgrading to a 240 Hz monitor, noticed delays after switching USB ports for their wireless mouse dongle. Unable to find existing tools to analyze these subtle delays, they created a custom tool, accessible at found.as/l, called a \"Jerk Monitor.\" This tool measures the latency between browser-rendered frames and reported pointer movements, also detailing pointer event batching and offsets. To enable high-precision timers for the tool, the author added specific Cross-Origin headers to their xmit.toml configuration. The tool confirmed the observed latency issue with the USB port, prompting the author to avoid it. Furthermore, they discovered a benefit from their mouse's 8 kHz polling rate, as even with high DPI and fast mouse movements, some frames would otherwise miss pointer updates. In essence, the author built a tool to quantify and address subtle latency issues impacting their computing experience.\n",
    "chinese_title": "玩具/延迟：抖动监控器",
    "chinese_summary": "作者升级到240 Hz显示器后对延迟非常敏感，在更换无线鼠标接收器USB端口后，注意到了延迟。由于找不到现有工具来分析这些细微的延迟，他们创建了一个自定义工具，地址为 found.as/l，名为“Jerk Monitor”。该工具测量浏览器渲染帧和报告的指针移动之间的延迟，并详细说明了指针事件批处理和偏移。为了为该工具启用高精度计时器，作者在其 xmit.toml 配置中添加了特定的跨域标头。该工具证实了观察到的 USB 端口延迟问题，促使作者避免使用该端口。此外，他们还发现了鼠标 8 kHz 轮询率的好处，因为即使在高 DPI 和快速鼠标移动的情况下，某些帧也可能会错过指针更新。本质上，作者构建了一个工具来量化和解决影响其计算体验的细微延迟问题。"
  },
  {
    "id": "44481066",
    "title": "Reinforcement Learning from Human Feedback (RLHF) in Notebooks",
    "url": "https://github.com/ash80/RLHF_in_notebooks",
    "summary": "This repository provides a practical implementation of Reinforcement Learning from Human Feedback (RLHF) using notebooks, mirroring the approach detailed in a YouTube video. RLHF aligns large language models (LLMs) with human preferences through a three-step process: Supervised Fine-Tuning (SFT), Reward Model Training, and Reinforcement Learning via Proximal Policy Optimisation (PPO).\n\nThe implementation focuses on fine-tuning GPT-2 to generate sentences expressing positive sentiment using the stanfordnlp/sst2 dataset of movie reviews. The process involves three notebooks:\n\n1.  **1-SFT.ipynb:** Fine-tunes GPT-2 on the dataset to generate similar sentences. The resulting model is saved as the SFT model.\n2.  **2-RM Training.ipynb:** Creates a Reward Model by adding a reward head to GPT-2. This model is trained to predict the sentiment (positive/negative) of sentences.\n3.  **3-RLHF.ipynb:** Implements PPO to optimize the SFT model, encouraging it to generate sentences that receive high rewards (positive sentiment scores) from the Reward Model.\n\nTo get started, users need a Hugging Face Access Token and can set it up either locally as an environment variable or in Google Colab Secrets. The notebooks should be run sequentially to achieve the desired outcome of GPT-2 generating positive sentiment sentences.\n",
    "chinese_title": "在Notebook中使用人类反馈强化学习",
    "chinese_summary": "本仓库提供了一个使用notebook实现的基于人类反馈的强化学习(RLHF)的实践方案，与YouTube视频中详述的方法相呼应。RLHF通过三个步骤将大型语言模型(LLMs)与人类偏好对齐：监督式微调(SFT)、奖励模型训练，以及通过近端策略优化(PPO)进行强化学习。\n\n该实现专注于微调GPT-2，使其使用stanfordnlp/sst2电影评论数据集生成表达积极情感的句子。 该过程涉及三个notebook:\n\n1.  **1-SFT.ipynb:** 在数据集上微调GPT-2以生成相似的句子。 生成的模型将保存为SFT模型。\n2.  **2-RM Training.ipynb:** 通过向GPT-2添加奖励头来创建奖励模型。 该模型经过训练以预测句子的情感（正面/负面）。\n3.  **3-RLHF.ipynb:** 实施PPO以优化SFT模型，鼓励其生成从奖励模型获得高奖励（积极情感得分）的句子。\n\n要开始使用，用户需要一个Hugging Face访问令牌，并且可以在本地将其设置为环境变量，或在Google Colab Secrets中设置。 应按顺序运行notebook，以实现GPT-2生成积极情感句子的预期结果。"
  },
  {
    "id": "44453038",
    "title": "Take Two: Eshell",
    "url": "http://yummymelon.com/devnull/take-two-eshell.html",
    "summary": "Charles Choi's \"Take Two: Eshell\" discusses his evolving relationship with Eshell in Emacs. Initially unimpressed, he now finds it an integral part of his workflow, though not as a direct shell replacement. He's shifted from using command-line tools for tasks like file management and SCM to Emacs modes like Dired and Magit.\n\nChoi argues Eshell's true power unlocks with Elisp knowledge, transforming it into an Elisp REPL that can also function as a shell. This allows users to combine shell commands with Elisp functions, facilitating powerful, improvised workflows. He contrasts this with more cumbersome shell syntax.\n\nA key advantage is Eshell's ability to integrate with Emacs buffers, treating them as primary data types rather than just files. He highlights how Eshell replaces common shell workflows with Emacs equivalents (e.g., using Dired for file management, Magit for SCM). He also discusses using `grep` with pipes, cautioning against its indiscriminate use on large files and advocating for redirection to buffers instead of files. He points out that you cannot pipe output to Elisp functions currently, though that may change.\n\nUltimately, Choi views Eshell as a prompt for Elisp/Emacs functionality, offering a \"shell-like\" experience for command-line utilities. He recommends learning Elisp to fully utilize Eshell's potential and emphasizes it's not a drop-in terminal replacement. He suggests using a dedicated terminal emulator for full terminal emulation.\n",
    "chinese_title": "再来一次：Eshell",
    "chinese_summary": "Charles Choi的“再谈Eshell”探讨了他与Emacs中Eshell关系的演变。起初他并未留下深刻印象，但现在发现它是工作流程中不可或缺的一部分，虽然不是直接的Shell替代品。他已经从使用命令行工具进行文件管理和SCM等任务转变为使用Dired和Magit等Emacs模式。\n\nChoi认为，Eshell真正的力量在于掌握Elisp知识，将其转变为一个Elisp REPL，同时也可以作为Shell运行。这允许用户将Shell命令与Elisp函数结合使用，从而促进强大且即兴的工作流程。他将此与更繁琐的Shell语法进行了对比。\n\n一个关键优势是Eshell能够与Emacs缓冲区集成，将它们视为主要数据类型，而不仅仅是文件。他强调Eshell如何用Emacs等效工具（例如，使用Dired进行文件管理，Magit进行SCM）取代常见的Shell工作流程。他还讨论了将`grep`与管道一起使用，警告不要不加选择地在大型文件上使用它，并提倡重定向到缓冲区而不是文件。他指出，目前您无法将输出通过管道传输到Elisp函数，但这可能会改变。\n\n最终，Choi将Eshell视为Elisp/Emacs功能的提示符，为命令行实用程序提供“类似Shell”的体验。他建议学习Elisp以充分利用Eshell的潜力，并强调它不是一个直接替换终端的工具。他建议使用专用终端模拟器进行完全的终端模拟。"
  },
  {
    "id": "44481286",
    "title": "Building a Mac app with Claude code",
    "url": "https://www.indragie.com/blog/i-shipped-a-macos-app-built-entirely-by-claude-code",
    "summary": "This article details the author's experience building a macOS application, \"Context,\" almost entirely with the assistance of Anthropic's Claude Code, a terminal-based IDE focused on agentic development. The author contrasts Claude Code with previous experiences using Copilot and other AI-powered coding tools, emphasizing Claude Code's ability to handle more complex tasks autonomously.\n\nClaude Code excels at understanding existing code, generating new code and tests, iterating based on compiler and test failures, and even fixing bugs based on screenshots or console logs. While Claude Code is competent in Swift up to version 5.5, it truly shines with SwiftUI, allowing the author to build a usable, well-designed UI.\n\nThe author highlights key strategies for maximizing Claude Code's effectiveness, emphasizing \"context engineering\" over traditional prompt engineering. He introduces the concept of \"priming\" the agent by feeding it relevant documentation and source code. Detailed specifications are crucial for guiding the model, and prompting it to \"ultrathink\" and develop a plan before implementation helps improve output quality.\n\nSetting up feedback loops for building and testing is essential for Claude Code to iterate and improve its code. The author concludes that Claude Code dramatically accelerates development, enabling him to ship side projects again and hints at the future of IDEs being centered around this type of interaction.\n",
    "chinese_title": "用Claude代码构建Mac应用",
    "chinese_summary": "本文详细介绍了作者在Anthropic的Claude Code（一个专注于自主开发的基于终端的IDE）的帮助下，几乎完全使用该工具构建macOS应用程序“Context”的经验。作者将Claude Code与之前使用Copilot和其他AI驱动的编码工具的经验进行了对比，强调了Claude Code自主处理更复杂任务的能力。\n\nClaude Code擅长理解现有代码、生成新代码和测试、基于编译器和测试失败进行迭代，甚至可以根据屏幕截图或控制台日志修复错误。虽然Claude Code在Swift 5.5版本之前表现良好，但在SwiftUI方面表现出色，使作者能够构建一个可用且设计良好的用户界面。\n\n作者强调了最大化Claude Code效率的关键策略，强调了“上下文工程”而不是传统的提示工程。他介绍了通过向代理提供相关文档和源代码来“启动”代理的概念。详细的规范对于引导模型至关重要，并且提示它在实施之前进行“超思考”并制定计划有助于提高输出质量。\n\n建立用于构建和测试的反馈循环对于Claude Code迭代和改进其代码至关重要。作者总结说，Claude Code极大地加速了开发，使他能够再次发布副项目，并暗示了未来的IDE将以这种类型的交互为中心。"
  },
  {
    "id": "44474759",
    "title": "Eastern Baltic cod grow much smaller than they did due to overfishing",
    "url": "https://www.smithsonianmag.com/smart-news/these-cod-have-been-shrinking-dramatically-for-decades-now-scientists-say-theyve-solved-the-mystery-180986920/",
    "summary": "Overfishing in the eastern Baltic Sea has caused a dramatic decrease in the size of cod, driven by evolutionary changes to the fish's genetic makeup. A recent study published in Science Advances revealed that decades of relentless fishing, particularly of larger fish, has altered the cod population's gene pool, predisposing them to remain small.\n\nHistorically, Baltic cod grew over three feet long. However, by 2019, their size had been halved, and their weight drastically reduced. While environmental factors like pollution and temperature changes could contribute, researchers found that overfishing was the primary driver, leading to genetic variants associated with larger size becoming less common.\n\nScientists analyzed otoliths and DNA from cod harvested between 1996 and 2019, revealing a clear correlation between overfishing and a decline in genes linked to faster growth. This evolutionary shift, driven by \"human harvesting,\" has potentially lasting consequences. The loss of genetic diversity makes it harder for cod to adapt to future environmental changes, and recovery may be slow or impossible.\n\nThe study emphasizes the speed at which human activities can drive evolution and highlights the importance of monitoring not just the numbers of a species, but also its genetic composition.\n",
    "chinese_title": "过度捕捞导致东波罗的海鳕鱼的体型比以往小得多。",
    "chinese_summary": "东波罗的海过度捕捞导致鳕鱼体型急剧缩小，原因是鱼类基因构成的进化改变。一项发表在《科学进展》上的最新研究表明，数十年来无情的捕捞，特别是对大型鱼类的捕捞，改变了鳕鱼种群的基因库，使其更容易保持较小体型。\n\n历史上，波罗的海鳕鱼可以长到三英尺多长。然而，到2019年，它们的体型减半，体重也大幅下降。虽然污染和温度变化等环境因素可能会产生影响，但研究人员发现，过度捕捞是主要驱动因素，导致与较大体型相关的基因变异变得不那么常见。\n\n科学家分析了1996年至2019年捕捞的鳕鱼的耳石和DNA，揭示了过度捕捞与和更快生长相关的基因减少之间存在明显的相关性。这种由“人类捕捞”驱动的进化转变可能产生持久的影响。遗传多样性的丧失使得鳕鱼更难适应未来的环境变化，恢复可能缓慢甚至不可能。\n\n该研究强调了人类活动驱动进化的速度，并强调了不仅要监测物种的数量，还要监测其基因构成的重要性。"
  },
  {
    "id": "44476115",
    "title": "What a Hacker Stole from Me",
    "url": "https://mynoise.net/blog.php",
    "summary": "This blog post from myNoise founder Stéphane details a recent attempted cyberattack where someone tried to overwhelm the server by repeatedly downloading sound files. Stéphane reflects on the inherent imbalance between creation and destruction, and how acts of vandalism can be particularly disheartening, especially after a recent health incident. He connects this experience to a broader melancholy about the state of the world and the ease with which things can be destroyed compared to the effort required to build them. He shares a heartwarming anecdote about rescuing a pigeon, illustrating his commitment to positive actions despite the potential for negativity.\n\nWhile the hacker didn't bring the server down, they stole Stéphane's time and energy, diverting him from creating new sounds. Despite this, Stéphane reaffirms his commitment to continuing to build positive things like planting trees, making sounds, helping animals, and offering myNoise as a sanctuary. He expresses his hope that those who choose to build will ultimately outnumber those who choose to destroy.\n\nThe blog also includes updates about the successful migration of myNoise to a new private server, highlighting the exceptional support from Yudhish at One.com. Stéphane also touches on his trip to the US, and the new sonic retreat which inspired new sounds, with plans to integrate sounds from Victoria Falls, and promotes joining the email newsletter and using RSS. Finally, he discusses leaving social media.\n",
    "chinese_title": "黑客从我这里偷了什么",
    "chinese_summary": "myNoise创始人Stéphane的这篇博文详述了最近一次网络攻击未遂事件，有人试图通过重复下载声音文件来压垮服务器。Stéphane反思了创造与破坏之间固有的不平衡，以及破坏行为的令人沮丧，尤其是在最近一次健康事件之后。他将这次经历与对世界现状更广泛的忧郁联系起来，并感叹摧毁事物是如此容易，而建设却需要付出巨大的努力。他分享了一则关于拯救鸽子的暖心轶事，展示了他尽管存在潜在的消极因素，仍致力于积极行动的决心。\n\n虽然黑客没有搞垮服务器，但他们偷走了Stéphane的时间和精力，让他无法创作新的声音。尽管如此，Stéphane重申了他将继续建设积极事物的决心，例如植树、制作声音、帮助动物以及将myNoise作为一个避难所。他表达了希望选择建设的人最终会超过选择破坏的人。\n\n该博客还包括关于myNoise成功迁移到新的私有服务器的更新，强调了来自One.com的Yudhish的杰出支持。Stéphane还谈到了他的美国之行，以及激发新声音灵感的新音景静修，计划整合来自维多利亚瀑布的声音，并鼓励读者订阅电子邮件新闻和使用RSS。最后，他讨论了离开社交媒体。"
  },
  {
    "id": "44477768",
    "title": "July 5, 1687: When Newton explained why you don't float away",
    "url": "https://multiverseemployeehandbook.com/blog/when-newton-explained-why-you-dont-float-away/",
    "summary": "On July 5, 1687, Isaac Newton published his groundbreaking \"Philosophiæ Naturalis Principia Mathematica,\" explaining the laws of motion and universal gravitation. This work revolutionized our understanding of the universe, clarifying why objects stay grounded, planets orbit, and we don't float into space.\n\nThe publication almost didn't happen due to the Royal Society's financial constraints after funding a costly book on fish. Edmund Halley, famous for the comet, stepped in and personally funded the printing.\n\nNewton's laws have been instrumental in numerous applications, from building bridges to plotting planetary orbits and are still used by NASA to launch rockets. His work provided a framework for understanding how objects behave, large or small, giving us a predictable and stable universe.\n\nThe article celebrates the 337th anniversary of this pivotal moment in science, acknowledging Newton's lasting impact. It also promotes \"The Multiverse Employee Handbook\" podcast, which aims to make Newtonian physics accessible and entertaining.\n",
    "chinese_title": "1687年7月5日：牛顿解释了你为何不会漂浮",
    "chinese_summary": "1687年7月5日，艾萨克·牛顿发表了他开创性的《自然哲学的数学原理》，阐释了运动定律和万有引力定律。这项著作彻底革新了我们对宇宙的理解，阐明了物体为何保持在地面上、行星为何绕轨道运行以及我们为何不会漂浮到太空中。\n\n由于皇家学会资助了一本耗资巨大的鱼类书籍后，资金拮据，这本书的出版几乎未能成行。因彗星而闻名的埃德蒙·哈雷介入并亲自资助了印刷。\n\n牛顿定律在无数应用中发挥了重要作用，从建造桥梁到绘制行星轨道，美国国家航空航天局 (NASA) 至今仍在用它来发射火箭。他的工作为我们理解物体（无论大小）的行为提供了一个框架，为我们提供了一个可预测且稳定的宇宙。\n\n本文庆祝这一科学史上关键时刻的337周年，并肯定了牛顿的持久影响。它还推广了旨在使牛顿物理学易于理解且有趣的“多元宇宙员工手册”播客。"
  },
  {
    "id": "44467383",
    "title": "How to get started with Old English poetry",
    "url": "https://www.deadlanguagesociety.com/p/old-english-poetry",
    "summary": "Colin Gorrie's article, \"How to Get Started with Old English Poetry,\" encourages readers to explore the lesser-known 90% of Old English poetry beyond *Beowulf*. While *Beowulf* is famous, it's long, obscure, and subject to scholarly debate, making it a challenging entry point. Gorrie argues that the diverse corpus of Old English poetry, written between AD 700 and 1066 and primarily preserved in four manuscripts, offers easier and equally rewarding experiences.\n\nHe highlights four genres beyond heroic poetry: elegiac (meditations on loss), riddles (often featuring talking objects), wisdom poems (akin to Proverbs), and religious poems (Christian themes within a Germanic context). Gorrie introduces five specific poems as accessible starting points: *The Battle of Maldon* (heroic), *The Wanderer* (elegiac), *Exeter Book Riddles* (riddles), *Dream of the Rood* (religious), and *Deor* (wisdom). For each, he provides a brief description, a compelling excerpt, and recommendations for readily available translations, both free online (Ophelia Hostetter) and in print (Craig Williamson's *The Complete Old English Poems*). Gorrie emphasizes the freshness and vitality of Old English poetry, which avoids the later medieval Continental European influences (rhyme, sonnets, iambic pentameter). The article serves as an invitation to discover a captivating world of exiles, courageous generals, and enchanted objects, readily accessible through translation. He also mentions a Beowulf book club for those wanting a deeper dive.\n",
    "chinese_title": "如何开始学习古英语诗歌",
    "chinese_summary": "科林·戈里的文章《如何入门古英语诗歌》鼓励读者探索除《贝奥武甫》之外，鲜为人知的90%的古英语诗歌。《贝奥武甫》虽有名，但篇幅长、晦涩难懂，且充满学术争论，使其成为一个具有挑战性的入门点。戈里认为，公元700至1066年间创作、主要保存在四份手稿中的古英语诗歌，提供了更容易且同样有价值的体验。\n\n他强调了英雄诗歌之外的四种体裁：哀歌（对失去的冥想）、谜语（通常以会说话的物体为特色）、智慧诗（类似于箴言）和宗教诗（日耳曼语境下的基督教主题）。戈里介绍了五首特定的诗歌，作为易于理解的起点：《马尔顿战役》（英雄）、《漫游者》（哀歌）、《埃克塞特书谜语》（谜语）、《十字架之梦》（宗教）和《迪奥尔》（智慧）。对于每一首诗，他都提供了简要描述、引人入胜的节选，以及对容易获得的翻译的推荐，包括免费在线版（奥菲莉亚·霍斯特特）和印刷版（克雷格·威廉姆森的《古英语诗全集》）。戈里强调了古英语诗歌的新鲜和活力，它避免了后来的中世纪欧洲大陆的影响（韵律、十四行诗、抑扬格五音步）。这篇文章邀请读者去发现一个迷人的世界，那里有流亡者、勇敢的将军和被施了魔法的物体，通过翻译可以很容易地进入这个世界。他还提到一个贝奥武甫读书俱乐部，为那些想要更深入研究的人准备。"
  },
  {
    "id": "44481244",
    "title": "Show HN: Pixel Art Generator Using Genetic Algorithm",
    "url": "https://github.com/Yutarop/ga-pixel-art",
    "summary": "This Show HN post presents a pixel art generator implemented using a genetic algorithm. The program evolves pixel art to approximate a target image, generating an animated GIF of the evolutionary process.\n\nThe algorithm works by representing each pixel in a 100x100 image as a chromosome containing binary genes for red, green, and blue color channels. The algorithm iteratively improves the image quality through selection (tournament selection), crossover, and mutation, attempting to match the target image. Key parameters include a population size of 6, 50 iterations (generations), a mutation rate of 0.05, a crossover rate of 0.8, and a gene length of 8 bits per color channel. The algorithm also uses elitism to preserve the best individuals across generations.\n\nTo run the program, users need the `image`, `rand`, and `gif` crates in their `Cargo.toml` dependencies. A target image named \"target.png\" should be placed in the project directory before running `cargo run`. The program outputs the final evolved image as \"result.png\", the animated evolution process as \"result.gif\", and a copy of the target image used as \"target_sample.png\".\n",
    "chinese_title": "利用遗传算法的像素画生成器",
    "chinese_summary": "此Show HN帖子展示了一个使用遗传算法实现的像素艺术生成器。该程序通过进化像素艺术来逼近目标图像，并生成进化过程的动画GIF。\n\n该算法将100x100图像中的每个像素表示为一个染色体，该染色体包含红色、绿色和蓝色通道的二进制基因。该算法通过选择（锦标赛选择）、交叉和变异迭代地提高图像质量，试图匹配目标图像。关键参数包括：种群大小为6，迭代次数（代数）为50，变异率为0.05，交叉率为0.8，每个颜色通道的基因长度为8位。该算法还使用精英主义来保留每一代中最好的个体。\n\n要运行该程序，用户需要在`Cargo.toml`依赖项中添加`image`、`rand`和`gif` crates。在运行`cargo run`之前，应将名为“target.png”的目标图像放置在项目目录中。该程序将最终进化的图像输出为“result.png”，动画进化过程输出为“result.gif”，并将用作“target_sample.png”的目标图像副本输出。"
  },
  {
    "id": "44481235",
    "title": "Claude Code Pro Limit? Hack It While You Sleep",
    "url": "https://github.com/terryso/claude-auto-resume",
    "summary": "This article introduces `claude-auto-resume`, a shell script utility designed to automate the resumption of Claude CLI tasks when usage limits are reached. It allows users to avoid manual intervention and continue working seamlessly.\n\nThe script automatically detects Claude's usage restrictions by executing `claude -p 'check'`, parses the output for limit-related messages with timestamps, calculates the required wait time, and displays a countdown. Once the limit is lifted, it automatically resumes the previous session or starts a new one, using either `claude --dangerously-skip-permissions -p \"<custom-prompt>\"` or `claude -c --dangerously-skip-permissions -p \"<custom-prompt>\"`.\n\nInstallation methods include using a Makefile (recommended), manual copying with permission changes, or direct execution. Usage examples cover starting new sessions with custom prompts, continuing previous conversations, and displaying help information.\n\nThe script requires Claude CLI installation and standard Unix tools. Error handling is built-in, providing specific exit codes for different failure scenarios. The project structure includes the main script, Makefile, documentation, and a README.md file. Contributions are welcomed through forking the repository, creating feature branches, and submitting pull requests. The project is licensed under the MIT License.  The script's functionality is dependent on the output format of the Claude CLI and may require updates if that format changes.\n",
    "chinese_title": "克劳德代码Pro限制？趁你睡觉时破解它",
    "chinese_summary": "本文介绍`claude-auto-resume`，这是一个shell脚本实用工具，旨在自动化恢复因达到使用限制而中断的Claude CLI任务。它允许用户避免手动干预，并无缝地继续工作。\n\n该脚本通过执行`claude -p 'check'`自动检测Claude的使用限制，解析带有时间戳的限制相关消息，计算所需的等待时间，并显示倒计时。一旦限制解除，它会自动恢复之前的会话或启动新的会话，使用`claude --dangerously-skip-permissions -p \"<custom-prompt>\"`或`claude -c --dangerously-skip-permissions -p \"<custom-prompt>\"`。\n\n安装方法包括使用Makefile（推荐）、手动复制并更改权限，或直接执行。用法示例涵盖使用自定义提示启动新会话、继续之前的对话以及显示帮助信息。\n\n该脚本需要安装Claude CLI和标准Unix工具。内置错误处理机制，为不同的故障情况提供特定的退出代码。项目结构包括主脚本、Makefile、文档和README.md文件。欢迎通过fork代码库、创建功能分支和提交pull request的方式进行贡献。该项目采用MIT许可证。该脚本的功能依赖于Claude CLI的输出格式，如果该格式发生变化，可能需要更新。"
  },
  {
    "id": "44475537",
    "title": "How to Network as an Introvert",
    "url": "https://aginfer.bearblog.dev/how-to-network-as-an-introvert/",
    "summary": "This article provides a networking guide specifically tailored for introverts, emphasizing strategies that leverage their natural strengths. The author stresses the importance of preparation before an event to minimize anxiety: eat beforehand, wear a \"Whatzit\" to invite conversation, scan the news for current events, and use a six-point checklist to structure the evening.\n\nUpon entering a room, the focus shifts to non-verbal communication: pausing to assess the room, maintaining open body language, and employing a \"delayed warmth\" smile to project confidence. Conversation starters should move beyond typical small talk, prompting genuine engagement. Instead of asking \"What do you do?\", ask \"How do you spend most of your time?\".\n\nDuring conversations, active listening and remembering small details are crucial. The author suggests echoing someone's words (\"Solar hardware?\") to encourage them to elaborate. When appropriate, share commonalities but with a slight delay to make it feel more insightful. For hosts, offer specific compliments and small acts of service.\n\nExiting an event is as important as entering. Say goodbye intentionally using memorable adjectives. Within 24 hours, follow up with anyone you connected with, sharing something related to your conversation. Note important details for future reference and check in again after three weeks to solidify the connection. The key takeaway: effective networking for introverts is about being present, listening attentively, and leaving a lasting, genuine impression, rather than forcing extroverted behaviors.\n",
    "chinese_title": "内向者如何建立人脉",
    "chinese_summary": "本文提供了一份专为内向者量身定制的人脉拓展指南，强调利用他们自身优势的策略。作者强调活动前做好准备以尽量减少焦虑的重要性：事先吃饭，佩戴一个“话题引发物”来吸引对话，浏览新闻了解时事，并使用六点清单来规划当晚的活动。\n\n进入房间后，重点转移到非语言沟通：停顿一下评估房间情况，保持开放的肢体语言，并运用“延迟温暖”的微笑来展现自信。话题的开端应该超越典型的小范围闲聊，从而激发真诚的参与。与其问“你是做什么的？”，不如问“你大部分时间都在做什么？”。\n\n在对话过程中，积极倾听和记住小细节至关重要。作者建议重复对方的话（“太阳能硬件？”）来鼓励他们详细说明。在适当的时候，分享共同点，但稍微延迟一下，使其感觉更有洞察力。对于主人，提供具体的赞美和小的服务行为。\n\n离开活动和进入一样重要。有意识地用令人难忘的形容词说再见。在24小时内，与你联系过的任何人进行跟进，分享与你谈话相关的内容。记录重要的细节以供将来参考，并在三周后再次联系以巩固关系。 关键要点：内向者有效的人脉拓展在于保持专注，专注倾听，并留下持久而真诚的印象，而不是强迫自己表现出外向的行为。"
  },
  {
    "id": "44458532",
    "title": "Development of a transputer ISA board",
    "url": "https://nanochess.org/transputer_board.html",
    "summary": "This article details the author's journey of developing a transputer ISA board to run legacy software from the 1990s. Driven by curiosity and nostalgia after creating a transputer emulator in Javascript, the author decided to build a physical board compatible with the Inmos B004 using readily available TRAM boards.\n\nThe initial approach involved designing a schematic with TTL circuits, acquiring an ISA prototyping board, and hand-wiring the components. This resulted in a functional but noisy board with an embarrassing backwards assembly mistake.\n\nTo improve the design, the author embraced KiCAD and created a schematic and PCB layout. This process involved learning KiCAD, designing custom footprints, and overcoming challenges with the autorouter. Multiple revisions of the board were created, each addressing errors in the design like incorrect power line widths and footprint misconfigurations.\n\nDespite several iterations and mistakes, including short circuits and incorrect component placement, the author eventually achieved a fully functional transputer ISA board. This board successfully ran the author's original Pascal compiler, ray tracer, and even the Inmos Occam compiler, after correcting an inverted error flag issue.\n\nThe final board design, including schematics and Gerber files, are available on GitHub. The author also offers assembled and tested boards for sale, excluding the TRAM and C011 chip. The article highlights the author's journey from software emulation to hardware creation, showcasing both the challenges and the joys of retro-engineering.\n",
    "chinese_title": "晶体管处理器指令集架构板的开发",
    "chinese_summary": "本文详细介绍了作者开发Transputer ISA板卡以运行20世纪90年代遗留软件的历程。在用Javascript创建了一个Transputer模拟器之后，出于好奇和怀旧，作者决定使用现成的TRAM板来构建一个与Inmos B004兼容的物理板。\n\n最初的方法包括设计带有TTL电路的原理图，购买ISA原型板，以及手工布线组件。这产生了一个功能性但嘈杂的板卡，并伴随着一个令人尴尬的反向组装错误。\n\n为了改进设计，作者采用了KiCAD，并创建了原理图和PCB布局。这个过程包括学习KiCAD、设计自定义封装以及克服自动布线器的挑战。创建了多个版本的板卡，每个版本都解决了设计中的错误，如错误的电源线宽度和封装错误配置。\n\n尽管经历了多次迭代和错误，包括短路和错误的组件放置，作者最终成功实现了一个完全功能的Transputer ISA板卡。在纠正了一个反转的错误标志问题后，该板卡成功运行了作者最初的Pascal编译器、光线追踪器，甚至Inmos Occam编译器。\n\n最终的板卡设计，包括原理图和Gerber文件，可在GitHub上找到。作者还提供组装和测试过的板卡出售，但不包括TRAM和C011芯片。本文突出了作者从软件仿真到硬件创建的旅程，展示了复古工程的挑战和乐趣。"
  },
  {
    "id": "44480667",
    "title": "Two and a Half Years in GameDev",
    "url": "https://smyachenkov.com/posts/two-and-half-years-in-gamedev/",
    "summary": "This article reflects on the author's two and a half years working in the GameDev industry, contrasting it with their prior experience in traditional enterprise development. A key takeaway is the pervasive passion for games within the industry, where employees actively engage with new releases and industry news, unlike many other sectors. While it's possible to work in GameDev without being a hardcore gamer, the author notes it can lead to feeling out of sync.\n\nThe article also emphasizes the importance of creativity in GameDev, where art permeates all aspects of the workplace, potentially making individuals with purely technical backgrounds feel out of place. The author illustrates this with an anecdote about a presentation using UML diagrams, which contrasted starkly with the creative, meme-filled presentations of others. Successful, high-paying artistic careers are possible, though advancement often requires a shift to management, potentially diminishing creative involvement.\n\nA significant challenge within GameDev is the discrepancy between the industry's economic maturity and its internal culture. While the industry has grown substantially, teams often resist adopting established practices for large-scale project management. The author suggests that this can lead to creative frustration, as individuals may find their scope limited within a specific game's established style. This frustration can ultimately drive people to smaller studios or independent projects where they have more creative freedom. The author concludes that while GameDev has matured in some ways, it still retains a unique culture and perspective that distinguishes it from more traditional industries.\n",
    "chinese_title": "游戏开发两年半",
    "chinese_summary": "游戏开发行业两年半工作反思：热情、创意与文化冲突"
  },
  {
    "id": "44478279",
    "title": "The force-feeding of AI features on an unwilling public",
    "url": "https://www.honest-broker.com/p/the-force-feeding-of-ai-on-an-unwilling",
    "summary": "Ted Gioia's article \"The Force-Feeding of AI on an Unwilling Public\" argues that AI is being aggressively pushed onto consumers who largely don't want it, characterizing it as a form of \"tyranny\" rather than innovation. He cites personal experiences with Microsoft Copilot and Google's AI-integrated search results as examples of unwanted and unavoidable AI features.\n\nGioia highlights that only a small percentage of people are willing to pay for AI services, leading companies to bundle it with essential products like software and search engines. This allows them to mask potential losses associated with AI and artificially inflate its perceived value. He argues this tactic avoids direct consumer choice and forces users to accept AI integration.\n\nHe uses the analogy of a restaurant forcing customers to pay for and accept granite rocks for dessert to illustrate how companies are adding AI without consumer consent. Gioia criticizes the lack of choice in various aspects of daily life, from customer service to online retailers, and predicts a future where AI replaces human interaction in crucial areas like healthcare and law.\n\nThe article advocates for laws promoting transparency, opt-in options, and liability regarding AI, suggesting voter initiatives and class-action suits as potential solutions. Finally, Gioia dismisses the argument that the US must embrace AI to outpace China, stating that it is a misguided race to an undesirable outcome.\n",
    "chinese_title": "强行推广不受欢迎的AI功能",
    "chinese_summary": "泰德·乔亚的文章《强行喂食不情愿的公众AI》认为，人工智能正被积极地推向那些大多并不需要的消费者，并将其描述为一种“暴政”而非创新。他引用了自己使用微软Copilot和谷歌的AI集成搜索结果的个人经历，作为不想要且无法避免的AI功能的例子。\n\n乔亚强调，只有一小部分人愿意为AI服务付费，导致公司将其与软件和搜索引擎等基本产品捆绑销售。这使他们能够掩盖与AI相关的潜在损失，并人为地夸大其感知价值。他认为这种策略避免了直接的消费者选择，并迫使用户接受AI集成。\n\n他用一家餐厅强迫顾客付费并接受花岗岩石头作为甜点的例子来说明，公司如何在未经消费者同意的情况下添加AI。乔亚批评了日常生活的各个方面缺乏选择，从客户服务到在线零售商，并预测了AI将在医疗保健和法律等关键领域取代人际互动的未来。\n\n这篇文章倡导制定法律，以促进AI的透明度、选择加入选项和责任，并建议将选民倡议和集体诉讼作为潜在的解决方案。最后，乔亚驳斥了美国必须拥抱AI才能超越中国的说法，认为这是一场误入歧途的竞赛，通往一个令人不悦的结果。"
  },
  {
    "id": "44473400",
    "title": "macOS Icon History",
    "url": "https://basicappleguy.com/basicappleblog/macos-icon-history",
    "summary": "BasicAppleGuy has created a collection documenting the evolution of macOS system icons, spurred by the dramatic \"Liquid Glass\" UI redesign introduced in macOS 26. This new design features softer, shinier, glassier icons with more rounded rectangles and enforces containment within the icon boundary.\n\nThe project, being rolled out on social media, aims to chronicle changes over the years. The article details update history, including specific icons added on various dates in June and July 2025.\n\nCurrently, the collection includes icons for:\n\n*   System Preferences/Settings\n*   Folders\n*   Stickies\n*   Notes\n*   Messages\n*   Calculator\n*   Game Center\n*   Dictionary\n*   App Store\n*   Maps\n*   Podcasts\n*   Photo Booth\n*   Chess\n*   Reminders\n*   Apple Books\n\nThe author emphasizes that beta icons will not be included due to their often temporary design variations. The collection will continue to be updated throughout the summer.\n",
    "chinese_title": "macOS 图标历史",
    "chinese_summary": "BasicAppleGuy创建了一个文档集，记录了macOS系统图标的演变历程，其灵感源于macOS 26中引入的引人注目的“液态玻璃”UI重新设计。这种新设计以更柔和、更闪亮、更具玻璃质感的图标为特色，矩形边角更圆润，并强制图标内容包含在边界内。\n\n该项目正在社交媒体上推出，旨在记录多年来的变化。文章详细介绍了更新历史，包括2025年6月和7月在不同日期添加的特定图标。\n\n目前，该文档集包含以下图标：\n\n*   系统偏好设置/设置\n*   文件夹\n*   便笺\n*   备忘录\n*   信息\n*   计算器\n*   Game Center\n*   词典\n*   App Store\n*   地图\n*   播客\n*   Photo Booth\n*   国际象棋\n*   提醒事项\n*   Apple Books\n\n作者强调，由于测试版图标的设计经常是暂时的，因此不会包含在内。该文档集将在整个夏季持续更新。"
  },
  {
    "id": "44482051",
    "title": "Huawei cloned Qwen and DeepSeek models, claimed as own",
    "url": "https://dilemmaworks.substack.com/p/whistleblower-huawei-cloned-and-renamed",
    "summary": "The Dilemma Works article alleges that Huawei has cloned and rebranded large language models (LLMs) Qwen (from Alibaba) and DeepSeek, presenting them as their own proprietary models. The article is based on whistleblower claims and documentation, suggesting that Huawei directly copied model weights and architectures, then simply renamed the models.\n\nSpecifically, the article claims that Huawei's Pangu models are, in reality, heavily based on or outright copies of Qwen and DeepSeek. The core accusation is that Huawei did not develop these models independently, as they claim, but instead utilized existing, open-source or commercially available LLMs and deceptively presented them as their own innovation.\n\nThe article highlights the ethical and potential legal implications of such actions, pointing to potential copyright infringement, misrepresentation of technological capabilities, and unfair competitive advantages gained by falsely claiming original development. The whistleblower's information purportedly includes technical details that support the claims of cloning, although the specifics are not detailed in the summary itself beyond mentioning the copied model weights and architectures.\n\nThe article paints Huawei as engaging in deceptive practices to bolster its AI capabilities and market position, raising serious questions about the authenticity of its technological advancements in the LLM space.\n",
    "chinese_title": "华为克隆Qwen和DeepSeek模型，声称是自主研发。",
    "chinese_summary": "困境作品文章指控华为克隆并重新包装了阿里巴巴的Qwen和DeepSeek大型语言模型（LLM），将其作为其自有专有模型展示。 该文章基于举报人声明和文档，表明华为直接复制了模型权重和架构，然后简单地重命名了这些模型。\n\n具体来说，该文章声称华为的盘古模型实际上是大量基于或完全复制了Qwen和DeepSeek。 核心指控是华为并未像其声称的那样独立开发这些模型，而是利用了现有的开源或商业可用的LLM，并欺骗性地将其作为自己的创新成果展示。\n\n该文章强调了此类行为的道德和潜在法律影响，指出可能存在版权侵权、技术能力虚假陈述，以及通过虚假声称原创开发而获得的不公平竞争优势。 据称，举报人的信息包括支持克隆指控的技术细节，尽管除了提及复制的模型权重和架构之外，摘要本身并未详细说明具体细节。\n\n该文章将华为描绘成从事欺骗性行为以增强其人工智能能力和市场地位，从而对华为在LLM领域的技术进步的真实性提出了严重质疑。"
  },
  {
    "id": "44472992",
    "title": "Europe's first geostationary sounder satellite is launched",
    "url": "https://www.eumetsat.int/europes-first-geostationary-sounder-satellite-launched",
    "summary": "The European Space Agency (ESA) and EUMETSAT have successfully launched Meteosat Third Generation Sounder 1 (MTG-S1), Europe's first geostationary sounder satellite. This launch marks a significant step in bolstering Europe's resilience to extreme weather events. MTG-S1 will provide high-frequency atmospheric data, including temperature, humidity, and trace gases, enabling more accurate and timely weather warnings, thus protecting lives and infrastructure.\n\nThe satellite's Infrared Sounder will scan thermal infrared wavelengths to create vertical profiles of atmospheric conditions, vital for detecting developing convective weather. Paired with data from MTG's imaging satellites, it will offer a comprehensive view of storm lifecycles, enhancing short-range forecasts and improving weather models. The satellite also carries the Copernicus Sentinel-4 instrument, which will monitor pollutants and aerosols to improve air quality forecasts and support public health and environmental policies.\n\nOfficials from EUMETSAT, ESA, and the European Commission emphasized the importance of this mission in mitigating the impacts of climate change, improving emergency response, and strengthening environmental monitoring across Europe. MTG-S1 is part of the Meteosat Third Generation program and is now in its Launch and Early Operations Phase, moving towards its geostationary orbital position.\n",
    "chinese_title": "欧洲首颗地球静止轨道探测卫星发射",
    "chinese_summary": "欧洲空间局（ESA）和欧洲气象卫星组织（EUMETSAT）已成功发射第三代气象卫星探测器1号（MTG-S1），这是欧洲首颗地球静止轨道探测卫星。此次发射标志着欧洲在增强应对极端天气事件能力方面迈出了重要一步。MTG-S1将提供高频大气数据，包括温度、湿度和微量气体，从而实现更准确、更及时的天气预警，进而保护生命和基础设施。\n\n该卫星的红外探测器将扫描热红外波长，以创建大气状况的垂直剖面图，这对于探测正在发展的对流天气至关重要。与MTG成像卫星的数据相结合，它将提供风暴生命周期的全面视图，从而增强短期预报并改进天气模型。该卫星还搭载了哥白尼哨兵-4号仪器，该仪器将监测污染物和气溶胶，以改善空气质量预报并支持公共卫生和环境政策。\n\n欧洲气象卫星组织、欧洲空间局和欧盟委员会的官员强调了这项任务在减轻气候变化影响、改善应急响应以及加强整个欧洲的环境监测方面的重要性。MTG-S1是第三代气象卫星计划的一部分，目前正处于发射和早期运行阶段，并正在向其地球静止轨道位置移动。"
  },
  {
    "id": "44451532",
    "title": "Can we test it? Yes, was can [video]",
    "url": "https://www.youtube.com/watch?v=MqC3tudPH6w",
    "summary": "This YouTube video likely titled \"Can we test it? Yes, we can\" seems to be related to testing new features on the YouTube platform. The content, while limited, consists of standard YouTube legal and information links found in the footer of YouTube pages or videos. These links point to resources about:\n\n*   **News Copyright:** Information on copyright policies, particularly in the context of news content on YouTube.\n*   **Contact Us:** Methods to reach YouTube support or relevant departments.\n*   **Creators:** Resources and information for content creators on YouTube.\n*   **Advertising:** Information for advertisers on the platform.\n*   **Developers:** Resources for developers interacting with the YouTube API.\n*   **Terms:** YouTube's terms of service.\n*   **Privacy:** YouTube's privacy policy.\n*   **Safety:** Information related to platform safety and security.\n*   **How YouTube Works:** An explanation of YouTube's algorithms and operational principles.\n*   **Test New Features:** Highlights the user may be participating in a test of new YouTube functionalities.\n*   **NFL Sunday Ticket:** References the NFL Sunday Ticket, owned by Google LLC. This indicates a potential connection to sports-related content or features.\n*   **Google LLC:** Indicates that YouTube is owned by Google LLC.\n",
    "chinese_title": "我们可以测试吗？是的，我们可以 [视频]",
    "chinese_summary": "这个YouTube视频，标题可能为“我们可以测试吗？是的，我们可以”，似乎与在YouTube平台上测试新功能有关。 虽然内容有限，但包括在YouTube页面或视频页脚中常见的标准YouTube法律和信息链接。 这些链接指向以下资源：\n\n*   **新闻版权：** 关于版权政策的信息，尤其是在YouTube上新闻内容方面的政策。\n*   **联系我们：** 联系YouTube支持或相关部门的方式。\n*   **创作者：** 为YouTube内容创作者提供的资源和信息。\n*   **广告：** 为平台上的广告商提供的信息。\n*   **开发者：** 为与YouTube API交互的开发者提供的资源。\n*   **条款：** YouTube的服务条款。\n*   **隐私：** YouTube的隐私政策。\n*   **安全：** 与平台安全和保障相关的信息。\n*   **YouTube运作方式：** 对YouTube算法和运营原则的解释。\n*   **测试新功能：** 强调用户可能正在参与测试YouTube的新功能。\n*   **NFL Sunday Ticket：** 提及Google LLC拥有的NFL Sunday Ticket。 这表明可能与体育相关的内容或功能有关。\n*   **Google LLC：** 表明YouTube归Google LLC所有。"
  },
  {
    "id": "44445091",
    "title": "Show HN: I made Logic gates using CSS if() function",
    "url": "https://yongsk0066.github.io/css_if_logic_gate/",
    "summary": "This \"Show HN\" post presents a creative implementation of logic gates using CSS's `if()` function. The author demonstrates how to build fundamental logic gates like AND, OR, NOT, and XOR, along with their negated counterparts, NAND and NOR, entirely in CSS.\n\nBeyond basic gates, the project includes more complex examples like a binary converter, a 7-segment display controlled by CSS math, a half adder, a full adder, and multiplexers (MUX). The half adder and full adder implementations showcase how CSS can perform bitwise arithmetic, calculating both the sum and carry bits.\n\nThe multiplexer examples (2:1 and 4:1) illustrate how CSS can be used to select between multiple inputs based on select lines, effectively emulating a key component in digital circuits. The 4:1 multiplexer is particularly interesting as it demonstrates a more complex logic function built upon the basic gates defined earlier.\n\nThe core technique relies on CSS custom properties and the `if()` function to simulate conditional logic.  Input values are passed as CSS variables (e.g., `--a`, `--b`, `--cin`, `--s0`, `--s1`, `--i0`, `--i1`, etc.), and the `if()` function evaluates these variables to determine the output value, which is then assigned to another custom property named `--value`.  This approach allows for creating visually interactive logic circuits purely within a stylesheet. The post highlights the potential of CSS to go beyond styling and venture into functional programming territories.\n",
    "chinese_title": "Show HN: 我用 CSS if() 函数实现了逻辑门",
    "chinese_summary": "使用 CSS `if()` 函数实现的逻辑门电路创意实践。\"Show HN\" 展示了作者如何完全使用 CSS 构建诸如 AND、OR、NOT 和 XOR 等基本逻辑门及其对应的 NAND 和 NOR 否定逻辑门。\n\n除了基本逻辑门，该项目还包括更复杂的示例，例如二进制转换器、由 CSS 数学控制的 7 段显示器、半加器、全加器和多路复用器 (MUX)。半加器和全加器的实现展示了 CSS 如何执行按位算术，计算总和位和进位位。\n\n多路复用器示例（2:1 和 4:1）说明了如何使用 CSS 根据选择线在多个输入之间进行选择，从而有效地模拟数字电路中的关键组件。4:1 多路复用器尤其有趣，因为它演示了基于先前定义的基本逻辑门构建的更复杂的逻辑功能。\n\n核心技术依赖于 CSS 自定义属性和 `if()` 函数来模拟条件逻辑。输入值作为 CSS 变量传递（例如，`--a`、`--b`、`--cin`、`--s0`、`--s1`、`--i0`、`--i1` 等），`if()` 函数评估这些变量以确定输出值，然后将其分配给另一个名为 `--value` 的自定义属性。这种方法允许仅在样式表中创建视觉上交互的逻辑电路。 这篇文章突出了 CSS 超越样式并进入函数式编程领域的潜力。"
  },
  {
    "id": "44448802",
    "title": "ClojureScript from First Principles [video]",
    "url": "https://www.youtube.com/watch?v=An-ImWVppNQ",
    "summary": "The provided \"article\" is a YouTube title, \"ClojureScript from First Principles [video],\" accompanied by standard YouTube footer information like copyright notices, advertising links, and privacy policies.  The title indicates the existence of a video that aims to teach ClojureScript, presumably starting with fundamental concepts.  The YouTube footer information is irrelevant to the core topic of the video itself, which is learning ClojureScript.  Therefore, the only relevant takeaway is that the video is an educational resource designed to introduce ClojureScript to learners, likely targeting beginners due to the \"First Principles\" designation. It suggests the video breaks down the language into its core components for easier understanding.\n",
    "chinese_title": "ClojureScript 从原理入门 [视频]",
    "chinese_summary": "ClojureScript从第一性原理 [视频]"
  },
  {
    "id": "44445462",
    "title": "On latency, measurement, and optimization in algorithmic trading systems",
    "url": "https://www.architect.co/posts/how-fast-is-it-really",
    "summary": "This article delves into the complexities of measuring and optimizing latency in algorithmic trading systems (ATS), a critical concern in high-frequency trading (HFT). It argues that accurate latency measurement is challenging due to overhead introduced by measurement tools themselves (Heisenberg-esque dilemma).\n\nThe article illustrates the issue with a pseudocode example of an ATS responding to market trades and initially suggesting the use of `datetime.now()` for timing. It then highlights the pitfalls of this approach, including its slowness, potential bias due to measuring all trades instead of just those resulting in orders, and failure to account for the full critical path. The article suggests using `time.perf_counter_ns()` as an improvement.\n\nIt emphasizes that the complete latency profile includes network I/O, parsing, and protocol conversions, which are often overlooked but can constitute a significant portion of the total latency. The article presents two methods for more accurately capturing latency: one using NIC hardware timestamps, and another involving a simulated exchange and ATS for controlled testing. The simulated exchange method, although comprehensive, also measures the simulator's own latency. The article suggests subtracting the latency measured using a simple \"ping/pong\" simulation to approach the true latency of the ATS. Finally, the article mentions a more advanced approach involving packet replication and parsing using specialized network hardware for precise timestamping.\n",
    "chinese_title": "算法交易系统中延迟、测量与优化",
    "chinese_summary": "本文深入探讨了算法交易系统（ATS）中延迟测量和优化的复杂性，这是高频交易（HFT）中的一个关键问题。文章认为，由于测量工具本身引入的开销（类似于海森堡不确定性原理），准确的延迟测量具有挑战性。\n\n文章通过一个ATS响应市场交易的伪代码示例来说明这个问题，并最初建议使用`datetime.now()`进行计时。随后，文章强调了这种方法的缺陷，包括其速度慢、由于测量所有交易而不仅仅是导致订单的交易而产生的潜在偏差，以及未能考虑完整的关键路径。文章建议使用`time.perf_counter_ns()`作为一种改进。\n\n文章强调，完整的延迟剖析包括网络I/O、解析和协议转换，这些通常被忽略，但可能构成总延迟的很大一部分。文章提出了两种更准确地捕获延迟的方法：一种是使用网卡硬件时间戳，另一种是涉及模拟交易所和ATS进行受控测试。虽然模拟交易所的方法很全面，但也会测量模拟器自身的延迟。文章建议减去使用简单的“ping/pong”模拟测量的延迟，以接近ATS的真实延迟。最后，文章提到了一种更高级的方法，涉及使用专门的网络硬件进行数据包复制和解析，以实现精确的时间戳。"
  },
  {
    "id": "44473888",
    "title": "Speeding up PostgreSQL dump/restore snapshots",
    "url": "https://xata.io/blog/behind-the-scenes-speeding-up-pgstream-snapshots-for-postgresql",
    "summary": "This article details how the pgstream team significantly improved the snapshot performance of their open-source CDC tool for PostgreSQL, pgstream. The original implementation of pgstream's snapshot feature, which involves capturing the schema, restoring it, reading data, and writing data, proved to be slower than the native `pg_dump/pg_restore` tools.\n\nThe team identified the write path as the bottleneck, particularly when handling bulk data loads. They focused on optimizing the write process for snapshots, implementing and benchmarking different insertion methods. Binary `COPY FROM` proved to be the fastest.\n\nFurther optimizations involved deferring index and constraint creation until after the data load, mirroring the behavior of `pg_dump/pg_restore`. This eliminated the overhead of updating indexes during inserts, resulting in pgstream performing faster than `pg_dump/pg_restore` on complex schemas.\n\nFinally, the team improved the automatic batch configuration by specifying data size per batch instead of the number of rows, leading to more predictable memory usage and performance across different table shapes. Benchmarks using datasets like IMDB and MusicBrainz confirmed the significant performance gains achieved through these targeted improvements.\n",
    "chinese_title": "加速PostgreSQL数据库转储/恢复快照",
    "chinese_summary": "pgstream团队如何显著提升PostgreSQL CDC工具快照性能：pgstream的优化之路"
  },
  {
    "id": "44475453",
    "title": "Optimizing Tool Selection for LLM Workflows with Differentiable Programming",
    "url": "https://viksit.substack.com/p/optimizing-tool-selection-for-llm",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "利用可微编程优化LLM工作流的工具选择",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "44454300",
    "title": "The Mystery of People Who Speak Languages",
    "url": "https://www.newyorker.com/magazine/2018/09/03/the-mystery-of-people-who-speak-dozens-of-languages",
    "summary": "The article explores the phenomenon of hyperpolyglots - people fluent in eleven or more languages - through the lens of linguist Luis Miguel Rojas-Berscia. It examines the fascination surrounding these individuals, comparing them to other \"superlative\" achievers who redefine human potential.\n\nThe piece traces the historical and cultural context of multilingualism, noting its prevalence in many parts of the world and contrasting it with the relative monolingualism of some Western societies, particularly the US. It highlights the existence of a thriving online community of language enthusiasts, exemplified by figures like Richard Simcott, who organizes the annual Polyglot Conference.\n\nThe article delves into potential characteristics and motivations of hyperpolyglots, noting an overrepresentation of LGBTQ+ individuals and those on the autism spectrum within the community. It also touches upon the challenges of defining \"fluency\" and the sensitivities surrounding claims of language mastery.\n\nUltimately, the article aims to unravel the \"mystery\" of these remarkable individuals, moving beyond simple numerical assessments of languages spoken and exploring the underlying passions, motivations, and socio-cultural contexts that drive their linguistic pursuits. It also references Michael Erard's more scientific and in depth research into the topic.\n",
    "chinese_title": "会说语言的人的秘密",
    "chinese_summary": "本文通过语言学家路易斯·米格尔·罗哈斯-贝尔西亚的视角，探讨了精通十一门或以上语言的“超多语者”现象。文章考察了人们对这些个体的迷恋，并将他们与其他重新定义人类潜能的“超级”成就者进行比较。\n\n文章追溯了多语现象的历史和文化背景，指出其在世界许多地方的普遍性，并将其与一些西方社会（特别是美国）相对的单语现象进行了对比。文章强调了一个蓬勃发展的语言爱好者在线社区的存在，以理查德·西姆科特等人物为例，他组织了年度多语者大会。\n\n文章深入探讨了超多语者的潜在特征和动机，指出 LGBTQ+ 群体和自闭症谱系人士在社区中的比例过高。文章还涉及定义“流利”的挑战以及围绕语言掌握声明的敏感性。\n\n最终，文章旨在揭开这些杰出个体的“谜团”，超越对所说语言的简单数字评估，探索驱动他们语言追求的潜在热情、动机和社会文化背景。文章还参考了迈克尔·埃拉德对该主题更科学、更深入的研究。"
  },
  {
    "id": "44475634",
    "title": "Techno-feudalism and the rise of AGI: A future without economic rights?",
    "url": "https://arxiv.org/abs/2503.14283",
    "summary": "This arXiv submission (2503.14283) by Pascal Stiefenhofer, titled \"Techno-Feudalism and the Rise of AGI: A Future Without Economic Rights?\", argues that the advent of Artificial General Intelligence (AGI) represents a fundamental disruption to existing economic and political systems. Unlike previous technological advancements, AGI functions as both labor and capital, generating economic value while simultaneously concentrating power within those who control the infrastructure.\n\nThe author contends that this shift, if unaddressed, will exacerbate inequality, erode democratic agency, and lead to a state of \"techno-feudalism.\" The traditional Social Contract, predicated on human labor as the basis for economic participation, is becoming obsolete. The paper emphasizes the urgency of renegotiating the economic framework to ensure equitable distribution of AGI-driven prosperity.\n\nStiefenhofer advocates for proactive interventions, including:\n\n*   **Universal AI Dividends:** Distributing the wealth generated by AGI directly to the population.\n*   **Progressive Taxation:** Implementing tax policies that redistribute the benefits of AGI-driven productivity.\n*   **Decentralized Governance:** Establishing decentralized systems to prevent the concentration of power over AGI.\n\nThe paper underscores that immediate action is crucial to prevent intelligence itself from becoming the most exclusive form of capital, leading to mass economic disenfranchisement. The paper consists of 28 pages and includes 21 figures.\n",
    "chinese_title": "技术封建主义与通用人工智能的崛起：一个没有经济权利的未来？",
    "chinese_summary": "Pascal Stiefenhofer 的 arXiv 论文 (2503.14283) 题为“技术封建主义与通用人工智能的崛起：一个没有经济权利的未来？”，认为通用人工智能 (AGI) 的出现代表着对现有经济和政治体系的根本性颠覆。与以往的技术进步不同，AGI 既充当劳动力又充当资本，在创造经济价值的同时，也将权力集中在控制基础设施的人手中。\n\n作者认为，如果不加以解决，这种转变将加剧不平等，削弱民主机构，并导致“技术封建主义”状态。 传统的社会契约以人类劳动为经济参与的基础，正变得过时。 该论文强调了重新谈判经济框架的紧迫性，以确保公平分配 AGI 驱动的繁荣。\n\nStiefenhofer 倡导积极干预，包括：\n\n*   **全民人工智能红利：** 将 AGI 产生的财富直接分配给民众。\n*   **累进税制：** 实施税收政策，重新分配 AGI 驱动的生产力带来的好处。\n*   **去中心化治理：** 建立去中心化的系统，以防止对 AGI 的权力集中。\n\n该论文强调，立即采取行动至关重要，以防止智能本身成为最独特的资本形式，从而导致大规模的经济剥夺。 该论文共 28 页，包含 21 个图表。"
  },
  {
    "id": "44449970",
    "title": "The War on the Walkman",
    "url": "https://newsletter.pessimistsarchive.org/p/the-forgotten-war-on-the-walkman",
    "summary": "This article from the Pessimists Archive Newsletter recounts the initial backlash against the Sony Walkman in the late 1970s and early 1980s. Despite the device's current nostalgic appeal, its introduction was met with criticism from various corners. Some critics, like Allan Bloom, saw it as a symbol of growing individualism and societal disconnect, while others, like John Zerzan, considered it a form of social withdrawal.\n\nConcerns extended to public safety, with fears that headphone use impaired drivers, cyclists, and pedestrians, leading to numerous states proposing or enacting restrictions on headphone use, particularly while driving or cycling. The New Jersey township of Woodbridge even banned walking across the street while wearing headphones, punishable by a fine and potential jail time.\n\nOscar Gross, a retiree, staged an act of civil disobedience by deliberately crossing the street with headphones, resulting in a citation. Although he was prepared to go to jail to challenge the law, he was only fined, a decision that disappointed him. He initially planned to take the case to the Supreme Court but abandoned it after a fatal accident involving headphones.\n\nThe article highlights how new technologies often face resistance and that nostalgia tends to erase the initial skepticism and negativity they encounter. It draws a parallel with contemporary concerns about smartphones and their impact on youth, noting similar debates surrounding pagers in the past.\n",
    "chinese_title": "随身听之战",
    "chinese_summary": "这篇来自“悲观主义者档案”通讯的文章回顾了 20 世纪 70 年代末和 80 年代初索尼 Walkman 面世之初受到的强烈抵制。尽管该设备现在具有怀旧吸引力，但其推出却受到了来自各个方面的批评。一些批评家，如艾伦·布鲁姆，认为它是日益增长的个人主义和社会脱节的象征，而另一些批评家，如约翰·泽赞，则认为它是一种社会退缩的形式。\n\n人们的担忧扩展到公共安全，担心使用耳机损害了司机、骑自行车的人和行人的安全，导致许多州提议或颁布了对耳机使用的限制，尤其是在驾驶或骑自行车时。新泽西州伍德布里奇镇甚至禁止佩戴耳机过马路，违者将被处以罚款和可能的监禁。\n\n退休人士奥斯卡·格罗斯故意佩戴耳机过马路，以示公民不服从，结果被开罚单。尽管他准备入狱以挑战这项法律，但他只被罚款，这让他感到失望。他最初计划将此案提交最高法院，但在发生一起涉及耳机的致命事故后放弃了。\n\n这篇文章强调了新技术往往面临阻力，怀旧往往会抹去人们最初的怀疑和负面情绪。它将智能手机及其对青年人的影响与当代的担忧进行了比较，并指出过去也曾围绕着寻呼机展开过类似的辩论。"
  },
  {
    "id": "44477331",
    "title": "Volvo delivers 5,000th electric semi",
    "url": "https://electrek.co/2025/06/29/volvo-delivers-5000th-electric-semi-with-little-fanfare-sending-a-big-message/",
    "summary": "This Electrek article highlights Volvo Trucks' quiet success in the electric semi-truck market, contrasting it with the more publicized, but less prolific, Tesla Semi. By June 2025, Volvo had delivered its 5,000th electric semi, a significant milestone achieved since its first electric semi in 2019. These trucks have collectively logged over 100 million miles in commercial operation across 50+ countries, contributing to reduced emissions and noise pollution.\n\nVolvo's President Roger Alm emphasizes the practical and sustainable benefits that are encouraging transport companies to adopt and expand their electric fleets. The article positions Volvo as a leader, particularly in Europe, where they hold a substantial 47% market share in the heavy electric truck segment. In the US and Canada, their market share was a respectable 40% in 2024.\n\nThe article also includes a speculative comment from a reader that points out a potential design flaw in the Tesla Semi, particularly regarding axle weight distribution. Despite Tesla's past successes in disrupting industries, the author suggests catching up to Volvo may prove difficult given Volvo's head start, production delays with Tesla, and price increases. Ultimately, the author posits that regardless of which company \"wins,\" the growth and adoption of electric vehicles benefits everyone.\n",
    "chinese_title": "沃尔沃交付第5000辆电动半挂卡车",
    "chinese_summary": "这篇Electrek文章重点介绍了沃尔沃卡车在电动半挂卡车市场取得的静悄悄的成功，并将其与宣传更多但产量较少的特斯拉Semi形成了对比。截至2025年6月，沃尔沃已交付了其第5000辆电动半挂卡车，这是自2019年推出首款电动半挂卡车以来取得的重大里程碑。这些卡车已在50多个国家的商业运营中累计行驶超过1亿英里，为减少排放和噪音污染做出了贡献。\n\n沃尔沃总裁罗杰·阿尔姆强调了实际和可持续的效益，这些效益正在鼓励运输公司采用和扩大其电动车队。这篇文章将沃尔沃定位为领导者，尤其是在欧洲，他们在重型电动卡车领域占据了47%的巨大市场份额。在美国和加拿大，他们在2024年的市场份额也达到了可观的40%。\n\n这篇文章还包含一位读者的推测性评论，指出特斯拉Semi可能存在设计缺陷，尤其是在车轴重量分配方面。尽管特斯拉过去在颠覆行业方面取得了成功，但作者认为，鉴于沃尔沃的先发优势、特斯拉的生产延误以及价格上涨，追赶沃尔沃可能证明是困难的。最终，作者认为，无论哪家公司“获胜”，电动汽车的增长和普及都将使每个人受益。"
  },
  {
    "id": "44477601",
    "title": "Colombia seizes first unmanned narco-submarine with Starlink antenna",
    "url": "https://www.france24.com/en/americas/20250702-colombia-narco-submarine-starlink",
    "summary": "Colombia seized its first unmanned narco-submarine designed to transport drugs. The submarine was found in a rural area of the southwestern department of Nariño, a region heavily impacted by drug trafficking. Authorities believe it was intended for transporting narcotics to Central America.\n\nA key detail highlighting the sophistication of the operation is the presence of a Starlink antenna. This suggests the drug traffickers were aiming for reliable, high-speed internet communication, likely for remote control and navigation of the vessel, potentially allowing them to operate the submarine from a distance or track its progress in real-time.\n\nThe Colombian navy, involved in the seizure, considers this a significant blow to drug trafficking organizations. While unmanned narco-subs have been rumored and even depicted in fictional accounts, this marks the first confirmed seizure by Colombian authorities. The find highlights the evolving tactics and technological advancements employed by drug cartels in their attempts to smuggle drugs. The authorities are currently investigating the submarine's capabilities and the individuals involved in its construction and planned operation.\n",
    "chinese_title": "哥伦比亚查获首艘配备星链天线的无人毒品潜艇",
    "chinese_summary": "哥伦比亚缴获首艘无人毒品潜艇，该潜艇被设计用于运输毒品。潜艇在西南部纳里尼奥省的一个乡村地区被发现，该地区受毒品贩运影响严重。当局认为它计划用于向中美洲运输毒品。\n\n行动精密的关键细节是星链天线的存在。这表明毒品贩运者旨在实现可靠、高速的互联网通信，很可能用于远程控制和导航该船只，可能使他们能够远距离操作潜艇或实时跟踪其进度。\n\n参与此次缉获行动的哥伦比亚海军认为，这是对贩毒集团的重大打击。虽然无人毒品潜艇的传闻甚至在虚构故事中有所描述，但这是哥伦比亚当局首次确认缴获。此次发现突显了贩毒集团在走私毒品时所采用的不断演变的战术和技术进步。当局目前正在调查该潜艇的性能以及参与其建造和计划行动的个人。"
  },
  {
    "id": "44447797",
    "title": "Atomic \"Bomb\" Ring from KiX, 1947 (2020)",
    "url": "https://toytales.ca/atomic-bomb-ring-from-kix-1947/",
    "summary": "This article discusses the Atomic \"Bomb\" Ring, a popular cereal premium offered by KiX in 1947 for 15 cents and a cereal box top. Marketed as a scientific sensation, the ring reflected the public's fascination with atomic energy. The ring, also known as the Lone Ranger Atomic Bomb Ring, featured a gold-colored band, a warhead containing a removable red tailfin (used for secret messages), and a spinthariscope.\n\nThe spinthariscope, accessed by removing the tailfin, was the key atomic feature. When viewed in the dark, the plastic lens revealed flashes of light, or scintillations, caused by the interaction of radioisotopes. The ring contained trace amounts of Polonium-210, a radioactive material that interacted with a zinc sulfide screen.\n\nDespite the use of radioactive material, advertisements assured consumers of its safety. The article points out that such a toy wouldn't be acceptable today. Due to Polonium-210's short half-life of 140 days, any existing rings no longer produce visible scintillations. The article concludes with a disclosure about earning a commission from purchases made through the eBay link.\n",
    "chinese_title": "KiX原子弹戒指，1947 (2020)",
    "chinese_summary": "本文探讨了原子“弹”戒指，这是 KiX 在 1947 年提供的一款流行的谷物赠品，价格为 15 美分和一个谷物盒顶。这款戒指被宣传为一种科学轰动，反映了公众对原子能的迷恋。这款戒指，也被称为“孤胆骑侠原子弹戒指”，具有金色表带、包含可拆卸红色尾翼的弹头（用于秘密消息）以及闪烁镜。\n\n闪烁镜通过移除尾翼才能使用，是关键的原子特征。在黑暗中观察时，塑料镜头会显示出闪光或闪烁，这是由放射性同位素相互作用引起的。该戒指含有痕量的钋-210，一种与硫化锌屏幕相互作用的放射性物质。\n\n尽管使用了放射性物质，但广告向消费者保证其安全性。文章指出，如今这样的玩具是无法接受的。由于钋-210 的半衰期很短，只有 140 天，因此现有的任何戒指都不会再产生可见的闪烁。文章最后披露了通过 eBay 链接进行的购买将获得佣金。"
  },
  {
    "id": "44478115",
    "title": "Are we the baddies?",
    "url": "https://geohot.github.io//blog/jekyll/update/2025/07/05/are-we-the-baddies.html",
    "summary": "This piece expresses deep disillusionment with the manipulative tactics employed by tech companies and modern capitalism. The author critiques practices like Hinge's boost system, Uber's algorithm, and the pervasive use of \"nudges\" that subtly extract more value from users at every interaction. They argue that these practices create a \"middleman\" exploiting individuals and warping normal social interactions.\n\nThe author dismisses the hope that market forces will correct this, suggesting that companies are adept at preempting consumer backlash through AI-driven adjustments to maintain customer engagement. They believe opting out is futile due to the pressure to maximize engagement and the \"Red Queen's race\" of competitive business.\n\nFurthermore, the author questions the efficacy of democracy in curbing these algorithmic powers, likening the voting process to the disconnect between Uber fares and driver pay. They contemplate drastic solutions like financial collapse or even war, doubting whether even catastrophic events will eradicate the underlying mentality of manipulative exploitation.\n\nThe core argument is that advertising, price discrimination, and the use of data to manipulate at scale are fundamentally wrong and unsustainable. The author sees modern capitalism as a form of \"wireheading,\" conditioning consumers to consume relentlessly, driven by algorithms designed to maximize profit above all else.\n",
    "chinese_title": "我们是坏人吗？",
    "chinese_summary": "本文深刻表达了对科技公司和现代资本主义所使用的操纵手段的极度失望。作者批判了Hinge的推广系统、Uber的算法以及普遍使用的“助推”等做法，这些做法在每次互动中都会巧妙地从用户那里榨取更多价值。他们认为，这些做法创造了一个“中间人”，剥削个人并扭曲正常的社会互动。\n\n作者否定了市场力量会纠正这一现象的希望，认为公司善于通过人工智能驱动的调整来先发制人地应对消费者的强烈反对，以维持客户的参与度。他们认为，由于最大化参与度的压力和竞争性商业的“红皇后赛跑”，退出是徒劳的。\n\n此外，作者质疑民主制度在遏制这些算法权力方面的有效性，将投票过程比作Uber车费与司机收入之间的脱节。他们考虑了金融崩溃甚至战争等激烈的解决方案，怀疑即使是灾难性事件也能消除操纵剥削的潜在心态。\n\n核心论点是，广告、价格歧视以及利用数据进行大规模操纵从根本上是错误且不可持续的。作者将现代资本主义视为一种“脑电刺激”，它通过算法使消费者不断消费，而这些算法的设计目标是最大化利润，高于一切。"
  },
  {
    "id": "44459583",
    "title": "Serial SPI RAM Emulation on Raspberry Pi Pico RP2040 MCU",
    "url": "https://github.com/MichaelBell/spi-ram-emu",
    "summary": "This project emulates a serial SPI RAM (like a 23LC512) on a Raspberry Pi Pico's RP2040, allowing the Pico to act as a RAM device accessible via SPI. It implements READ (0x03), WRITE (0x02), and FAST READ (0x0B) commands in sequential mode. The maximum SPI clock speed depends on the operation and system clock, with aligned READ operations achieving higher speeds.\n\nIntegration involves copying files into your project or using a submodule, configuring pins, DMA channels, and PIO state machines (SMs), and starting the simulation with `setup_simulated_sram()`. A custom memory map is required.\n\nThe implementation leverages PIO and DMA for timing-critical operations, dedicating core1 to RAM simulation. The PIOs handle data input and output, while core1 manages command processing, address manipulation, and transaction termination based on the CS signal. Core1 resides in scratch RAM for consistent execution timing.\n\nREAD commands are optimized by prepending a fixed memory location to the received address and using DMA to trigger the write PIO. WRITE commands combine address bits on core1 and use DMA to transfer data from the read PIO to memory. FAST READ commands are implemented by patching the write PIO program for delay cycles and reconfiguring DMA.\n\nLimitations include an uncharacterized minimum CS high time and lack of support for aborting operations before data transfer begins. The project effectively utilizes RP2040's PIO and DMA capabilities to emulate SPI RAM functionality, offering a practical solution for memory expansion or replacement in embedded systems.\n",
    "chinese_title": "在 Raspberry Pi Pico RP2040 MCU 上模拟串行 SPI RAM",
    "chinese_summary": "此项目在树莓派 Pico 的 RP2040 上模拟一个串行 SPI RAM (例如 23LC512)，使 Pico 可以充当可通过 SPI 访问的 RAM 设备。 它以顺序模式实现 READ (0x03)、WRITE (0x02) 和 FAST READ (0x0B) 命令。 最大 SPI 时钟速度取决于操作和系统时钟，对齐的 READ 操作可实现更高的速度。\n\n集成包括将文件复制到您的项目或使用子模块，配置引脚、DMA 通道和 PIO 状态机 (SM)，并使用 `setup_simulated_sram()` 启动模拟。 需要自定义内存映射。\n\n该实现利用 PIO 和 DMA 进行时间关键型操作，将 core1 专用于 RAM 模拟。 PIO 处理数据输入和输出，而 core1 管理命令处理、地址操作和基于 CS 信号的事务终止。 Core1 驻留在 scratch RAM 中，以实现一致的执行时间。\n\nREAD 命令通过在接收到的地址前添加固定的内存位置并使用 DMA 触发写入 PIO 来进行优化。 WRITE 命令组合了 core1 上的地址位，并使用 DMA 将数据从读取 PIO 传输到内存。 FAST READ 命令通过修补写入 PIO 程序以获得延迟周期并重新配置 DMA 来实现。\n\n限制包括未表征的最小 CS 高电平时间和不支持在数据传输开始前中止操作。 该项目有效地利用 RP2040 的 PIO 和 DMA 功能来模拟 SPI RAM 功能，为嵌入式系统中的内存扩展或替换提供了一种实用的解决方案。"
  },
  {
    "id": "44447233",
    "title": "Show HN: a community for collaborating on sideprojects",
    "url": "https://relentlessly.no/",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "Show HN: 一个协作开发副项目的社区",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "44477500",
    "title": "Injection Rejection (2006)",
    "url": "https://thedailywtf.com/articles/Injection_Rejection",
    "summary": "Based solely on the provided title and content snippet, it's impossible to provide a comprehensive summary of the article \"Injection Rejection (2006).\"  The snippet only shows:\n\n*   **Title:** Injection Rejection (2006) - Suggests the article likely deals with the topic of injection, possibly in a technical context given the other keywords.  \"Rejection\" suggests some form of failure, prevention, or vulnerability related to this injection.\n*   **Content Categories:** A list of categories where the article might be found or that are related to the website hosting it:\n    *   **feature articles:** Indicates it's a significant piece.\n    *   **codesod (presumably \"Code SOD\"):** Suggests it might relate to software development or system administration. SOD could stand for System Out of Disarray, hinting at troubleshooting or problem-solving.\n    *   **error'd:**  Implying it deals with errors or bug finding.\n    *   **forums:** Indicates an interactive community aspect.\n    *   **other articles/random article:** Navigation elements.\n\n**Possible interpretations (without the full article):**\n\nGiven the title and associated categories, \"Injection Rejection\" could potentially be about:\n\n*   **Software Security:**  Discussing vulnerabilities related to injection attacks (like SQL injection) and methods to prevent or \"reject\" them. It might detail common injection flaws, defense strategies (input validation, output encoding, etc.), and security best practices.\n*   **Debugging/Error Handling:** Describing the rejection or failure of a particular injection technique in a specific coding environment or system. It could focus on troubleshooting steps to resolve injection-related errors.\n*   **Medical Context (Less Likely Given the Other Keywords):** A less likely interpretation is a medical article on organ transplant rejection after injection of medications or therapies, though the surrounding terms suggest a technical focus.\n\nTo accurately summarize the article, access to its full text is required.\n",
    "chinese_title": "注射拒绝 (2006)",
    "chinese_summary": "仅凭提供的标题和内容片段，无法对文章“Injection Rejection (2006)”进行全面总结。片段仅显示：\n\n*   **标题：** Injection Rejection (2006) - 表明该文章可能涉及注入主题，考虑到其他关键词，可能是在技术背景下。\"Rejection\" 暗示与此注入相关的某种形式的失败、预防或漏洞。\n*   **内容分类：** 文章可能被发现的或与托管它的网站相关的类别列表：\n    *   **feature articles：** 表明这是一篇重要的文章。\n    *   **codesod（可能指 \"Code SOD\"）：** 暗示它可能与软件开发或系统管理有关。 SOD 可能代表 System Out of Disarray，暗示故障排除或问题解决。\n    *   **error'd：** 暗示它处理错误或错误查找。\n    *   **forums：** 表明具有交互式社区方面。\n    *   **other articles/random article：** 导航元素。\n\n**可能的解释（在没有完整文章的情况下）：**\n\n鉴于标题和相关类别，“Injection Rejection”可能与以下内容有关：\n\n*   **软件安全：** 讨论与注入攻击（如 SQL 注入）相关的漏洞以及预防或“拒绝”它们的方法。它可能详细介绍常见的注入缺陷、防御策略（输入验证、输出编码等）和安全最佳实践。\n*   **调试/错误处理：** 描述特定编码环境或系统中特定注入技术的拒绝或失败。它可能侧重于解决与注入相关的错误的故障排除步骤。\n*   **医疗背景（鉴于其他关键词可能性较小）：** 一种可能性较小的解释是，关于注射药物或治疗后器官移植排斥反应的医学文章，尽管周围的术语表明了技术重点。\n\n要准确总结文章，需要访问其全文。"
  },
  {
    "id": "44458890",
    "title": "Wind Knitting Factory",
    "url": "https://www.merelkarhof.nl/work/wind-knitting-factory",
    "summary": "\"Wind Knitting Factory\" by Merel Karhof describes a wind-powered knitting machine attached to a building's facade. The machine uses wind energy to knit a long scarf, with the knitting speed varying depending on wind strength. The scarf descends along the building until it reaches a window, where it's drawn inside to continue growing in length. Periodically, the knitted material is \"harvested\" and transformed into scarves. Each scarf is labeled with the date and time the wind contributed to its creation. The installation acts as a mobile factory demonstrating a production process fueled by urban wind, operating in the space between public and private. The project aims to visualize the potential of urban wind as a resource. The artist's other projects include, but are not limited to, \"Airfoil Table\", \"Wind Knitted Scarves\", \"ShadeVolume\", and \"Energy Harvesters.\"\n",
    "chinese_title": "风编织厂",
    "chinese_summary": "梅雷尔·卡尔霍夫的“风力针织工厂”描述了一台连接在建筑物外立面的风力驱动针织机。该机器利用风能编织一条长长的围巾，编织速度随风力强度而变化。围巾沿着建筑物下降，直到到达窗户，在那里被拉入室内继续增长。定期地，针织材料会被“收获”并转化为围巾。每条围巾都标有风力为其创作做出贡献的日期和时间。该装置作为一个移动工厂，展示了一个由城市风力驱动的生产过程，在公共和私人空间之间运作。该项目旨在将城市风力的潜力可视化为一种资源。艺术家的其他项目包括但不限于“翼型桌”、“风力针织围巾”、“阴影体量”和“能量收集器”。"
  },
  {
    "id": "44472024",
    "title": "What 'Project Hail Mary' teaches us about the PlanetScale vs. Neon debate",
    "url": "https://blog.alexoglou.com/posts/database-decisions/",
    "summary": "The article \"What 'Project Hail Mary' teaches us about the PlanetScale vs. Neon debate\" addresses the online contention, primarily on X/Twitter, regarding the performance of Neon compared to PlanetScale, particularly stemming from comments by PlanetScale's CEO.\n\nThe author draws a parallel to a passage from the novel \"Project Hail Mary\" where characters discuss a breeding database system that prioritizes scalability over efficiency. The core argument is that, just like in distributed system design, there are inherent trade-offs and no universally optimal solution.\n\nThe author contends that both PlanetScale and Neon have their own strengths and are suitable for different use cases. The article acknowledges the allure of negativity and drama online but urges engineers to recognize the value in both solutions and avoid the pursuit of a single, perfect database system. The key takeaway is that scalability and efficiency are often at odds, and choosing the right solution depends on specific project needs.\n",
    "chinese_title": "《火星救援》教会我们关于PlanetScale与Neon之争的什么",
    "chinese_summary": "《“火星救援2：玛丽计划”揭示的PlanetScale与Neon之争》一文探讨了主要在X/Twitter上关于Neon性能与PlanetScale相比的在线争论，特别是源于PlanetScale CEO的评论。\n\n作者将此比作小说《火星救援2：玛丽计划》中的一段情节，其中人物讨论了一个优先考虑可扩展性而非效率的繁殖数据库系统。核心论点是，就像在分布式系统设计中一样，存在固有的权衡，没有普遍最佳的解决方案。\n\n作者认为PlanetScale和Neon都有各自的优势，适用于不同的用例。文章承认了在线负面情绪和戏剧的吸引力，但敦促工程师们认识到两种解决方案的价值，避免追求单一、完美的数据库系统。关键在于，可扩展性和效率常常相互矛盾，选择正确的解决方案取决于具体的项目需求。"
  },
  {
    "id": "44480363",
    "title": "The most otherworldly, mysterious forms of lightning on Earth",
    "url": "https://www.nationalgeographic.com/science/article/lightning-sprites-transient-luminous-events-thunderstorms",
    "summary": "This article explores Transient Luminous Events (TLEs), mysterious light displays occurring high above thunderstorms, including red sprites, jets, and ghosts. Unlike conventional lightning, these events are fleeting, silent, and occur in the upper atmosphere, connecting weather, space, and electricity.\n\nResearchers and amateur photographers, like Angel An and Shuchang Dong, are working together to understand these phenomena, capturing images and videos. An and Dong's capture of 105 red sprites on the Tibetan Plateau significantly contributed to the understanding of TLEs.\n\nNASA's \"Spritacular\" project, led by Burcu Kosar, is creating a crowdsourced database of TLEs, relying on citizen scientists to submit images and analyze data collected from the ground and the International Space Station. This comprehensive database aims to identify patterns and trends in TLE occurrences and study rarer types like jets and ghosts.\n\nThe study of TLEs also extends beyond Earth. Data suggests similar events occur on Jupiter. Understanding TLEs may also help track the effects of climate change, as rising temperatures are expected to impact thunderstorm intensity and lightning activity, potentially affecting TLE occurrences. Scientists believe that studying these events can provide insights into both the upper atmosphere and the storms we experience on Earth.\n",
    "chinese_title": "地球上最离奇、神秘的闪电形态",
    "chinese_summary": "本文探讨瞬态发光现象 (TLEs)，一种发生在雷暴云之上的神秘光显示，包括红色精灵、喷流和鬼魅。与传统闪电不同，这些现象转瞬即逝、无声无息，且发生在更高的大气层中，将天气、太空和电力联系起来。\n\n像Angel An和董书畅这样的研究人员和业余摄影师正在合作了解这些现象，捕捉图像和视频。An和董在青藏高原上捕捉到的105个红色精灵，对理解TLEs做出了重大贡献。\n\n由Burcu Kosar领导的NASA“Spritacular”项目正在创建一个TLEs的众包数据库，依靠公民科学家提交图像并分析从地面和国际空间站收集的数据。这个全面的数据库旨在识别TLEs发生中的模式和趋势，并研究更罕见的类型，如喷流和鬼魅。\n\n对TLEs的研究也延伸到地球之外。数据显示，类似的事件也发生在木星上。了解TLEs也可能有助于追踪气候变化的影响，因为气温上升预计会影响雷暴强度和闪电活动，从而可能影响TLEs的发生。科学家们认为，研究这些事件可以深入了解高层大气和我们在地球上经历的暴风雨。"
  },
  {
    "id": "44444673",
    "title": "Haskell, Reverse Polish Notation, and Parsing",
    "url": "https://mattwills.bearblog.dev/haskell-postfix/",
    "summary": "This blog post chronicles the author's journey into Haskell, sparked by a friend's suggestion and a networking conversation about Reverse Polish Notation (RPN). Initially comfortable with imperative languages like Python and C, the author found Haskell's functional paradigm a significant mental shift, embracing immutability, recursion, and mathematical abstraction.\n\nThe author highlights key Haskell concepts like recursive types (defining natural numbers), lambda functions, and curried functions. They then illustrate the elegance of functional programming by implementing merge sort, showcasing Haskell's conciseness and clarity.\n\nThe post then delves into RPN, explaining its stack-based evaluation model and its relevance in early calculators. After an initial, limited RPN evaluator, the author sought advice from Graham Hutton, whose solution inspired the author to build a more robust parser. This led to exploring monads, starting with the `Maybe` type for error handling.\n\nThe author then introduces the `Parser` type in Haskell, demonstrating how monads facilitate parser composition. The post explains how the bind operator `>>=` chains parsers, handling state management and error handling automatically. They showcase practical examples like `item` (reading a single character) and `sat` (conditional character parsing), illustrating how monads enable clean and composable parser code. The post concludes emphasizing the power of monadic parsing to build complex parsers from simple building blocks.\n",
    "chinese_title": "Haskell、逆波兰表示法与解析",
    "chinese_summary": "这篇博文记录了作者受朋友建议和一次关于逆波兰表示法 (RPN) 的网络对话的启发，开始学习 Haskell 的历程。作者最初习惯于 Python 和 C 等命令式语言，但发现 Haskell 的函数式范式是一种重要的思维转变，需要接受不变性、递归和数学抽象。\n\n作者重点介绍了 Haskell 的关键概念，如递归类型（定义自然数）、lambda 函数和柯里化函数。然后，他们通过实现归并排序来展示函数式编程的优雅之处，突显 Haskell 的简洁性和清晰度。\n\n博文随后深入探讨了 RPN，解释了其基于堆栈的求值模型及其在早期计算器中的相关性。在最初实现了一个有限的 RPN 求值器之后，作者向 Graham Hutton 寻求建议，他的解决方案启发作者构建了一个更健壮的解析器。这促使作者探索 monad，首先是用于错误处理的 `Maybe` 类型。\n\n作者随后介绍了 Haskell 中的 `Parser` 类型，展示了 monad 如何促进解析器的组合。博文解释了 bind 运算符 `>>=` 如何链接解析器，自动处理状态管理和错误处理。他们展示了实际示例，如 `item`（读取单个字符）和 `sat`（条件字符解析），说明了 monad 如何实现干净且可组合的解析器代码。博文最后强调了 monadic 解析的强大功能，可以从简单的构建块构建复杂的解析器。"
  },
  {
    "id": "44467912",
    "title": "Being too ambitious is a clever form of self-sabotage",
    "url": "https://maalvika.substack.com/p/being-too-ambitious-is-a-clever-form",
    "summary": "Here's a summary of the article \"Being too ambitious is a clever form of self-sabotage\" based on its title and likely content, assuming it explores the potential downsides of excessive ambition:\n\nThe article likely argues that while ambition is generally seen as positive, *excessive* ambition can paradoxically lead to self-sabotage. It suggests that setting overly ambitious goals can create overwhelming pressure, anxiety, and fear of failure. This can manifest as procrastination, burnout, or a general feeling of being stuck, ultimately hindering progress towards any goals at all.\n\nThe author probably points out that individuals with overly ambitious goals may become fixated on the distant, idealized outcome, neglecting the smaller, achievable steps needed to reach it. This can lead to feeling inadequate and discouraged, as the gap between the current reality and the imagined future seems too vast.\n\nFurthermore, the article might explore how perfectionism, often intertwined with high ambition, contributes to self-sabotage. The fear of not meeting impossibly high standards can paralyze individuals, preventing them from starting or completing tasks. They might also become overly critical of their own efforts, undermining their confidence and motivation.\n\nFinally, the piece likely concludes by advocating for a more balanced approach to ambition, emphasizing the importance of setting realistic goals, celebrating small wins, and focusing on the process rather than solely on the outcome. It probably encourages readers to cultivate self-compassion and prioritize well-being alongside their aspirations. The core message is that sustainable progress stems from a mindful and measured approach to ambition, rather than a relentless and overwhelming pursuit of unattainable ideals.\n",
    "chinese_title": "过于雄心勃勃是一种聪明的自我破坏形式。",
    "chinese_summary": "以下是文章“过度雄心是一种巧妙的自我破坏形式”的摘要，基于其标题和可能的内容，假设它探讨了过度雄心的潜在弊端：\n\n文章可能认为，虽然雄心通常被认为是积极的，但 *过度* 的雄心壮志反而会导致自我破坏。它认为，设定过于雄心勃勃的目标会产生巨大的压力、焦虑和对失败的恐惧。这可能会表现为拖延、倦怠或普遍的受困感，最终阻碍了朝着任何目标前进的步伐。\n\n作者可能指出，拥有过于雄心勃勃的目标的个人可能会过于关注遥远、理想化的结果，而忽略了实现目标所需的较小、可实现的步骤。这可能会导致感到不足和气馁，因为当前的现实与想象中的未来之间的差距似乎太大了。\n\n此外，文章可能探讨了完美主义（通常与高度的雄心壮志交织在一起）如何导致自我破坏。害怕达不到高不可攀的标准会使个人瘫痪，阻止他们开始或完成任务。他们也可能对自己所做的努力过于挑剔，从而削弱他们的信心和动力。\n\n最后，这篇文章可能以倡导一种更平衡的雄心方式作为结尾，强调设定现实目标、庆祝小胜利以及专注于过程而非仅仅关注结果的重要性。它可能鼓励读者培养自我同情心，并在追求愿望的同时优先考虑福祉。核心信息是，可持续的进步源于对雄心的专注和适度的态度，而不是对无法实现的理想的无情和压倒性的追求。"
  },
  {
    "id": "44471150",
    "title": "Gecode is an open source C++ toolkit for developing constraint-based systems (2019)",
    "url": "https://www.gecode.org/",
    "summary": "Gecode is an open-source C++ toolkit designed for building constraint-based systems and applications. It provides a high-performance constraint solver that is both modular and extensible, allowing seamless integration with other systems and the creation of custom constraints, branching strategies, search engines, and variable domains.\n\nGecode boasts a comprehensive feature set, including constraints for integers, Booleans, sets, and floats, a C++ modeling layer, advanced branching heuristics, a variety of search engines (parallel, interactive, restarts), automatic symmetry breaking, no-good learning, and MiniZinc support.\n\nThe toolkit excels in efficiency, achieving excellent runtime performance and memory usage. This is evidenced by its dominance in the MiniZinc Challenges from 2008 to 2012, where it won all gold medals across all categories.\n\nGecode is well-documented, offering a comprehensive tutorial and complete reference documentation to guide users through modeling and programming tasks. Distributed under the MIT license, Gecode is free software, with all parts, including source code, available for download.\n\nIts C++ implementation ensures portability, allowing compilation with modern compilers and operation on a wide range of machines. Gecode also supports parallel search, leveraging multi-core processors for enhanced performance. Rigorous testing, with over 50,000 test cases and near-100% coverage, guarantees its reliability.\n",
    "chinese_title": "Gecode是一个用于开发基于约束系统的开源C++工具包 (2019)",
    "chinese_summary": "Gecode是一款开源C++工具包，专为构建基于约束的系统和应用程序而设计。它提供了一个高性能的约束求解器，该求解器具有模块化和可扩展性，允许与其他系统无缝集成，并创建自定义的约束、分支策略、搜索引擎和变量域。\n\nGecode拥有一套全面的功能，包括整数、布尔值、集合和浮点数的约束、C++建模层、高级分支启发式、各种搜索引擎（并行、交互式、重启）、自动对称性打破、no-good学习和MiniZinc支持。\n\n该工具包在效率方面表现出色，实现了卓越的运行时性能和内存使用。 这体现在它在2008年至2012年的MiniZinc挑战赛中的统治地位，它赢得了所有类别的所有金牌。\n\nGecode具有完善的文档，提供全面的教程和完整的参考文档，以指导用户完成建模和编程任务。 Gecode在MIT许可下分发，是免费软件，所有部分（包括源代码）均可下载。\n\n它的C++实现确保了可移植性，允许使用现代编译器进行编译，并在各种机器上运行。 Gecode还支持并行搜索，利用多核处理器来增强性能。 经过严格的测试，拥有超过50,000个测试用例和接近100％的覆盖率，从而保证了其可靠性。"
  },
  {
    "id": "44478083",
    "title": "Game publishers respond to Stop Killing Games claim it curtails developer choice",
    "url": "https://www.pcgamer.com/gaming-industry/european-game-publisher-group-responds-to-stop-killing-games-claims-these-proposals-would-curtail-developer-choice/",
    "summary": "This article discusses the conflict between the \"Stop Killing Games\" movement and game publishers, specifically Video Games Europe, regarding the discontinuation of online game services. The Stop Killing Games movement, now a European Citizens' Initiative, challenges the legality of publishers shutting down games that players have purchased, rendering them unplayable. They advocate for game preservation and argue that players are effectively losing a product they paid for.\n\nVideo Games Europe counters that discontinuing online services is a complex decision driven by commercial viability. They argue that maintaining servers and offering private alternatives can be prohibitively expensive, especially for online-only games. They also raise concerns about legal liabilities related to user data security, illegal content, and content moderation on private servers, which they handle on their official servers. They contend that the movement's proposals would curtail developer choice, making the creation of online-only games financially unsustainable.\n\nWhile the Stop Killing Games movement has gained significant traction, amassing over a million signatures for their EU petition, any resulting policy changes would likely only apply within the EU (and potentially the UK), leaving publishers free to shut down games in other regions. The article highlights the core disagreement: players view game purchases as owning a product, while publishers consider it a license to access a service.\n",
    "chinese_title": "游戏发行商回应“停止扼杀游戏”的主张，称其限制了开发者的选择。",
    "chinese_summary": "本文探讨了“停止扼杀游戏”运动与游戏发行商，特别是欧洲电子游戏协会（Video Games Europe），之间关于停止在线游戏服务的冲突。“停止扼杀游戏”运动现已成为一项欧洲公民倡议，它质疑发行商关闭玩家已购买的游戏（使其无法玩）的合法性。他们提倡游戏保存，并认为玩家实际上正在失去他们付费购买的产品。\n\n欧洲电子游戏协会反驳说，停止在线服务是一个复杂的决定，由商业可行性驱动。他们认为，维护服务器和提供私人替代方案的成本可能高得令人望而却步，尤其是对于纯在线游戏而言。他们还对与用户数据安全、非法内容以及私人服务器上的内容审核相关的法律责任表示担忧，而这些问题他们在其官方服务器上处理。他们认为，该运动的提议将限制开发者的选择，使纯在线游戏的创作在财务上不可持续。\n\n虽然“停止扼杀游戏”运动获得了显著的关注，为其欧盟请愿书积累了超过一百万个签名，但任何由此产生的政策变化可能只会适用于欧盟（以及可能的英国），从而让发行商可以自由地在其他地区关闭游戏。本文强调了核心分歧：玩家将购买游戏视为拥有产品，而发行商则将其视为访问服务的许可。"
  },
  {
    "id": "44440968",
    "title": "X-Clacks-Overhead",
    "url": "https://xclacksoverhead.org/home/about",
    "summary": "The \"X-Clacks-Overhead\" is a non-standard HTTP header inspired by Terry Pratchett's Discworld series, specifically the \"Clacks\" semaphore system. In the books, Clacks inventor Robert Dearheart encoded his deceased son's name, \"GNU John Dearheart,\" into the system's operational signals to perpetually preserve his memory. The \"GNU\" code ensured the message was passed on, not logged, and returned at the end of the line, symbolizing the enduring nature of remembrance.\n\nFollowing Pratchett's death, Discworld fans on Reddit created the X-Clacks-Overhead header to honor him similarly. Web authors can include this header in their server responses, transmitting a silent commemoration like \"GNU Terry Pratchett\" without affecting website functionality. It's detectable only by analyzing HTTP headers.\n\nNotable websites like Mozilla.org, Debian.org, XML.com, and The Register use the header to commemorate Terry Pratchett and others, such as Lester Haines. The provided links offer further information about GNU Terry Pratchett, Terry Pratchett himself, the Discworld series, the Clacks, and the Subreddit discussions that led to the header's creation. The site also informs users about its use of cookies for functionality and personalized content.\n",
    "chinese_title": "X-向导致意",
    "chinese_summary": "\"X-Clacks-Overhead\"是一个非标准的HTTP头部，灵感来源于特里·普拉切特的碟形世界系列，特别是“克拉克斯”信号系统。在书中，克拉克斯的发明者罗伯特·迪尔哈特将他已故儿子的名字“GNU John Dearheart”编码到系统的操作信号中，以永久保存他的记忆。“GNU”代码确保消息被传递下去，而不是被记录，并在行尾返回，象征着记忆的持久性。\n\n在普拉切特去世后，Reddit上的碟形世界粉丝们创建了X-Clacks-Overhead头部，以同样的方式纪念他。网站作者可以在其服务器响应中包含此头部，传递类似“GNU Terry Pratchett”的无声纪念，而不会影响网站功能。只有通过分析HTTP头部才能检测到它。\n\nMozilla.org、Debian.org、XML.com和The Register等著名网站使用该头部来纪念特里·普拉切特和其他人，如莱斯特·海恩斯。提供的链接提供了关于GNU Terry Pratchett、特里·普拉切特本人、碟形世界系列、克拉克斯以及导致头部创建的Subreddit讨论的更多信息。该网站还告知用户其使用cookies来实现功能和个性化内容。"
  },
  {
    "id": "44451160",
    "title": "Four integers are enough to write a Snake Game",
    "url": "https://www.andreinc.net/2022/05/01/4-integers-are-enough-to-write-a-snake-game",
    "summary": "This article presents a minimalist implementation of the Snake game in C, constrained to using only four integer variables: `map`, `vars`, `shape`, and `i`. The goal is to demonstrate a twisted exercise in code minimalism rather than elegant code.\n\n*   `map` (uint32\\_t) stores the game board (4x8 grid), with bits representing snake body segments.\n*   `vars` (uint32\\_t) packs various game states: head position (`hpos`), tail position (`tpos`), snake length (`len`), apple position (`apos`), and direction (`chdir`). Macros are extensively used to access and modify these bitfields.\n*   `shape` (uint64\\_t) acts as a direction queue, storing the movement directions for each snake segment. Two bits per direction allows for up to 32 directions.\n*   `i` (int8\\_t) acts as a looping counter.\n\nThe article details the macros used to manipulate bits within these integers, including `s_set`, `s_get`, `s_hpos_set` etc. The game loop uses `curses` library for screen rendering and keyboard input. The `move_snake` function updates the snake's position and manages apple consumption, while `check_*` functions prevent the snake from going out of bounds or crashing into itself.\n\nThe author acknowledges the code's obfuscated nature and uses the article as a demonstration of bit manipulation and squeezing data into limited memory. Full source code is available on GitHub.\n",
    "chinese_title": "四个整数就足以编写贪吃蛇游戏。",
    "chinese_summary": "本文介绍了一个用 C 语言实现的极简版贪吃蛇游戏，其限制在于仅使用四个整型变量：`map`、`vars`、`shape` 和 `i`。目标是展示一种扭曲的代码极简主义实践，而非优雅的代码。\n\n*   `map` (uint32_t) 存储游戏棋盘（4x8 网格），用位来表示蛇身节。\n*   `vars` (uint32_t) 打包了各种游戏状态：蛇头位置 (`hpos`)、蛇尾位置 (`tpos`)、蛇长 (`len`)、苹果位置 (`apos`) 和方向 (`chdir`)。大量使用宏来访问和修改这些位域。\n*   `shape` (uint64_t) 充当方向队列，存储每个蛇身节的移动方向。每个方向用两位表示，最多可存储 32 个方向。\n*   `i` (int8_t) 用作循环计数器。\n\n文章详细介绍了用于操作这些整数中的位的宏，包括 `s_set`、`s_get`、`s_hpos_set` 等。游戏循环使用 `curses` 库进行屏幕渲染和键盘输入。`move_snake` 函数更新蛇的位置并管理苹果的消耗，而 `check_*` 函数则防止蛇越界或撞到自身。\n\n作者承认代码的混淆性，并将本文用作演示位操作和将数据压缩到有限内存中的示例。完整的源代码可在 GitHub 上找到。"
  },
  {
    "id": "44471896",
    "title": "QSBS Limits Raised",
    "url": "https://www.mintz.com/insights-center/viewpoints/2906/2025-06-25-qsbs-benefits-expanded-under-senate-finance-proposal",
    "summary": "This article discusses proposed changes to Section 1202 of the Internal Revenue Code, concerning Qualified Small Business Stock (QSBS) as part of the Senate Finance Committee's version of the \"One Big Beautiful Bill Act.\"\n\nCurrently, QSBS allows non-corporate founders and investors to exclude up to 100% of the gain from selling QSBS, limited to the greater of $10 million or 10 times the stock's basis, provided the stock is held for over five years, acquired directly from the corporation, the company's gross assets are under $50 million, and the company meets active business requirements.\n\nThe Senate Finance proposal introduces three main changes:\n\n1.  **Tiered-Gain Exclusion:** Offers partial gain exclusion for shorter holding periods: 50% for 3+ years, 75% for 4+ years, and 100% for 5+ years.\n2.  **Increased Per-Issuer Cap:** Raises the gain exclusion cap to $15 million, adjusted for inflation starting in 2027.\n3.  **Increase in Aggregate Gross Assets Threshold:** Increases the company-level gross asset threshold to $75 million, adjusted for inflation starting in 2027.\n\nThese changes, if enacted, would apply to stock issued or acquired on or after the enactment date. Investments made prior to enactment would remain subject to the existing $10 million cap.\n\nThe authors suggest these changes offer more flexibility for founders and investors, allowing for earlier exit opportunities with partial gain exclusion. Companies nearing the $50 million asset threshold may consider delaying financing rounds until the legislation's fate is clearer. The authors view the proposed changes as a positive step for startups and the emerging company ecosystem.\n",
    "chinese_title": "QSBS限额提高",
    "chinese_summary": "本文探讨了参议院财政委员会“一个宏伟法案”版本中，针对《国内税收法》第1202条关于合格小企业股票(QSBS)的拟议修改。\n\n目前，QSBS允许非公司创始人及投资者免除出售QSBS高达100%的收益，但需满足以下限制：收益不得超过1000万美元或股票成本的10倍，取两者中较高者；股票持有时间超过五年；直接从公司获得；公司总资产低于5000万美元；且公司符合积极经营业务的要求。\n\n参议院财政委员会的提案引入了三个主要变更：\n\n1.  **分级收益排除：** 为较短的持有期提供部分收益排除：持有3年以上为50%，持有4年以上为75%，持有5年以上为100%。\n2.  **提高单发行人上限：** 将收益排除上限提高至1500万美元，并从2027年开始根据通货膨胀进行调整。\n3.  **提高总资产阈值：** 将公司层面的总资产阈值提高至7500万美元，并从2027年开始根据通货膨胀进行调整。\n\n如果这些变更获得通过，将适用于生效日或之后发行或获得的股票。在生效日期之前进行的投资仍将受到现有1000万美元上限的约束。\n\n作者认为，这些变更为创始人及投资者提供了更大的灵活性，允许更早的退出机会并享受部分收益排除。接近5000万美元资产阈值的公司可能会考虑推迟融资，直到该立法的命运更加明朗。作者认为拟议的变更对初创企业和新兴公司生态系统而言是积极的一步。"
  },
  {
    "id": "44457549",
    "title": "Why the simplest desktop agent abstraction wins",
    "url": "https://www.bytebot.ai/blog/designing-bytebot-why-the-simplest-desktop-agent-abstraction-wins",
    "summary": "This article argues for a simplified approach to building AI desktop agents by focusing on the most universal interface: keyboard, mouse, and screen. Bytebot, the author's solution, is built on this principle.\n\nThe article contrasts this approach with traditional methods that rely on APIs and direct tool integrations, which the author found to be brittle, limited, and ultimately unsustainable due to the rapid advancements in LLMs. They cite \"The Bitter Lesson,\" emphasizing that the most significant AI gains come from scaling simple methods with compute power, rather than building complex specialized systems.\n\nBytebot's \"remote worker\" abstraction allows agents to interact with any application designed for human use, eliminating the need for custom integrations and making the agent more robust and future-proof. It addresses the \"no-man's land\" of tasks that fall between APIs and internal logic, such as jumping between applications, handling authentication, and interacting with legacy software.\n\nThe advantages of this simplified abstraction are universality, fidelity, composability, observability, and extensibility. This approach allows companies to integrate agents without restructuring their workflows or maintaining custom APIs, as the agent simply operates within the existing computing environment. The intelligence is model-agnostic and improves automatically as models advance. The author emphasizes that Bytebot is designed for the long term, providing a stable platform for agents regardless of future LLM advancements.\n",
    "chinese_title": "为什么最简单的桌面代理抽象能够胜出",
    "chinese_summary": "本文提倡一种简化的AI桌面代理构建方法，重点关注最通用的界面：键盘、鼠标和屏幕。作者的解决方案Bytebot正是基于此原则构建的。\n\n本文将此方法与依赖API和直接工具集成的传统方法进行对比，作者认为这些方法脆弱、受限，并且由于LLM的快速发展而最终不可持续。他们引用了“惨痛的教训”，强调最显著的AI进步来自于利用算力扩展简单的方法，而不是构建复杂的专用系统。\n\nBytebot的“远程工作者”抽象允许代理与任何为人类使用而设计的应用程序进行交互，无需自定义集成，并使代理更强大且面向未来。它解决了API和内部逻辑之间的“无人区”任务，例如在应用程序之间跳转、处理身份验证以及与遗留软件交互。\n\n这种简化抽象的优势在于通用性、保真度、可组合性、可观察性和可扩展性。这种方法允许公司集成代理，而无需重组其工作流程或维护自定义API，因为代理只需在现有的计算环境中运行。智能是模型无关的，并随着模型的发展而自动改进。作者强调Bytebot专为长期使用而设计，无论未来的LLM如何发展，都为代理提供了一个稳定的平台。"
  },
  {
    "id": "44478217",
    "title": "Programming problems that seem easy, but aren't, featuring Jon Skeet",
    "url": "https://the-stack-overflow-podcast.simplecast.com/episodes/programming-problems-that-seem-easy-but-arent-featuring-jon-skeet/transcript",
    "summary": "Okay, I have analyzed the provided transcript of the Stack Overflow Podcast episode \"Programming Problems That Seem Easy, But Aren't, Featuring Jon Skeet.\" Here's a summary:\n\nThe podcast episode discusses programming problems that appear straightforward but are deceptively complex when considering edge cases, performance, and maintainability. Jon Skeet, a renowned figure in the programming community, joins the discussion, providing insightful perspectives and anecdotes.\n\nThe core theme revolves around the idea that many seemingly simple tasks, such as date and time manipulation, string parsing, currency formatting, and even basic calculations, can quickly become challenging due to various factors. These factors include:\n\n*   **Globalization/Localization:** Handling different cultural norms, such as date formats, number separators, and currency symbols, adds significant complexity. Dealing with time zones and daylight saving time is particularly troublesome.\n\n*   **Edge Cases & Corner Cases:** These are situations that are uncommon but still valid, often leading to unexpected errors if not handled properly. Skeet uses examples like leap years and unusual date ranges.\n\n*   **Performance Considerations:** Simple solutions might work for small datasets, but can become extremely slow and inefficient when dealing with larger volumes of data.\n\n*   **Maintainability:** Code that solves a problem in a simple way now might become difficult to understand, modify, or debug later on, especially when new requirements are added.\n\n*   **Floating-Point Arithmetic:** Representing real numbers in computers is not always precise, leading to subtle errors that can accumulate and cause problems in calculations.\n\nSkeet highlights the importance of thorough testing and careful consideration of all possible inputs and scenarios when tackling these \"simple\" programming problems. He advocates for using well-tested libraries and frameworks whenever possible, rather than trying to reinvent the wheel. The episode emphasizes that robust and reliable code requires more than just a basic understanding of syntax; it requires careful planning, meticulous testing, and awareness of potential pitfalls. The podcast also briefly touched upon the challenges of code review in such situations.\n",
    "chinese_title": "看似简单却并不简单的编程问题，乔恩·斯基特参与解答",
    "chinese_summary": "好的，我已经分析了提供的Stack Overflow Podcast节目“看似简单，实则不然的编程问题，嘉宾：Jon Skeet”的文字记录。以下是摘要：\n\n该播客节目讨论了看似简单，但在考虑边缘情况、性能和可维护性时却极具复杂性的编程问题。编程界知名人物Jon Skeet参与讨论，提供了深刻的见解和轶事。\n\n核心主题围绕着这样一个观点：许多看似简单的任务，如日期和时间操作、字符串解析、货币格式化，甚至基本计算，都可能因各种因素而迅速变得具有挑战性。这些因素包括：\n\n*   **全球化/本地化：** 处理不同的文化规范，如日期格式、数字分隔符和货币符号，会增加显著的复杂性。处理时区和夏令时尤其麻烦。\n\n*   **边缘情况和极端情况：** 这些是不常见但仍然有效的情况，如果处理不当，通常会导致意外错误。Skeet使用了闰年和不寻常的日期范围等例子。\n\n*   **性能考量：** 简单的解决方案可能适用于小型数据集，但在处理大量数据时可能会变得非常缓慢和低效。\n\n*   **可维护性：** 现在以简单方式解决问题的代码可能在以后变得难以理解、修改或调试，尤其是在添加新需求时。\n\n*   **浮点运算：** 在计算机中表示实数并不总是精确的，这会导致细微的误差积累，并在计算中引起问题。\n\nSkeet强调了在解决这些“简单”编程问题时，进行彻底测试并仔细考虑所有可能的输入和场景的重要性。他提倡尽可能使用经过良好测试的库和框架，而不是试图重新发明轮子。该节目强调，健壮且可靠的代码需要的不仅仅是基本的语法理解；它需要仔细的规划、细致的测试以及对潜在陷阱的认识。播客还简要提到了在这种情况下代码审查的挑战。"
  },
  {
    "id": "44444686",
    "title": "The Moat of Low Status",
    "url": "https://usefulfictions.substack.com/p/learn-to-love-the-moat-of-low-status",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "低地位的护城河",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "44442396",
    "title": "Build Systems à la Carte (2018) [pdf]",
    "url": "https://www.microsoft.com/en-us/research/wp-content/uploads/2018/03/build-systems.pdf",
    "summary": "I am unable to summarize this article because it is not in a human-readable format. The provided text appears to be a PDF file's internal code, consisting of object definitions and compressed data streams. To summarize, I would need access to the actual text content of the article, not its binary representation.\n",
    "chinese_title": "按需定制构建系统 (2018) [pdf]",
    "chinese_summary": "我无法总结这篇文章，因为它不是人类可读的格式。提供的文本似乎是一个PDF文件的内部代码，由对象定义和压缩数据流组成。为了总结，我需要访问文章的实际文本内容，而不是其二进制表示。"
  },
  {
    "id": "44449509",
    "title": "The History of Electronic Music in 476 Tracks (1937–2001)",
    "url": "https://www.openculture.com/2025/06/the-history-of-electronic-music-in-476-tracks.html",
    "summary": "This article highlights a remarkable online compilation hosted by Ubuweb: \"The History of Electronic Music in 476 Tracks (1937–2001),\" originally a 62-CD set. This extensive archive, uploaded by Caio Barros, aims to present a historical overview of electronic/electroacoustic music, catering particularly to those interested in the avant-garde and musicology.\n\nThe article acknowledges the collection's limitations, as pointed out by Ubuweb, specifically its lack of representation of female composers and non-Western traditions. However, it emphasizes the compilation's admirable effort and the wealth of great music it contains. The author suggests viewing the collection as a starting point, encouraging listeners to curate their own playlists or consider it an immersive course in traditional Western avant-garde electronic music.\n\nThe article also points out that electronic music encompasses more than just celebrity DJs and obscure avant-garde composers, highlighting artists who bridge the gap between pop/dance/performance and serious composition. Ultimately, the piece presents the Ubuweb collection as a valuable resource, while acknowledging its biases and advocating for a more inclusive and comprehensive understanding of electronic music history. It also provides links to related content, including the history of women in electronic music and an explanation of electronic music by Daphne Oram.\n",
    "chinese_title": "电子音乐史：476首精选 (1937–2001)",
    "chinese_summary": "本文重点介绍了Ubuweb上一个引人注目的在线汇编：“电子音乐史：476首曲目 (1937–2001)”，它最初是一套62张CD。这个由Caio Barros上传的庞大档案旨在呈现电子/电子声学音乐的历史概览，特别适合对先锋派和音乐学感兴趣的人。\n\n本文承认该收藏的局限性，正如Ubuweb所指出的，特别是缺乏对女性作曲家和非西方传统的代表。然而，它强调了该汇编的可贵努力和其中包含的大量优秀音乐。作者建议将该收藏视为一个起点，鼓励听众策划自己的播放列表，或者将其视为一门沉浸式的西方传统先锋派电子音乐课程。\n\n本文还指出，电子音乐不仅仅包括名人DJ和默默无闻的先锋派作曲家，并突出了那些弥合流行/舞曲/表演和严肃作曲之间差距的艺术家。最终，这篇文章将Ubuweb收藏视为一个宝贵的资源，同时承认其偏见，并倡导对电子音乐历史进行更具包容性和全面性的理解。文章还提供了相关内容的链接，包括电子音乐中的女性历史和达芙妮·奥拉姆对电子音乐的解释。"
  },
  {
    "id": "44480418",
    "title": "Rene Turcios has attended over 200 hackathons and doesn’t know how to code",
    "url": "https://sfstandard.com/2025/07/05/rene-turcios-hackathon-labubu-vibe-coding-chatgpt/",
    "summary": "Rene Turcios, a self-proclaimed \"hackathon king\" in San Francisco, has attended over 200 hackathons in two years, winning prizes and recognition despite not knowing how to code. Turcios leverages AI coding tools, a practice dubbed \"vibe coding,\" to quickly build projects using natural language prompts.\n\nInitially dismissed by traditional engineers, Turcios demonstrated the power of AI in hackathons, converting songs to lo-fi versions using ChatGPT in his first win. His success stemmed from his competitive spirit, honed during his past career as a professional Yu-Gi-Oh! player, where he mastered efficient strategies.\n\nTurcios's unconventional background includes a childhood in a circus family and a nomadic Yu-Gi-Oh! career. After a failed metaverse infrastructure company due to his engineers' resistance to AI, Turcios embraced hackathons to explore AI's potential.\n\nNow, Turcios contracts projects for businesses, runs AI coding workshops, and is building his own AI agents startup as a solo founder, with AI handling all the coding. He showcased his skills by creating a resale site for his Labubu dolls in just fifteen minutes using AI tools. He believes anyone can build anything they want with the help of AI.\n",
    "chinese_title": "瑞内·图尔西奥斯参加过200多个黑客马拉松，但他不会写代码。",
    "chinese_summary": "雷内·图尔西奥斯，自称旧金山“黑客马拉松之王”，两年内参加了超过200场黑客马拉松，虽然不懂编程，却赢得了奖品和认可。图尔西奥斯利用AI编程工具，这种做法被称为“氛围编程”，通过自然语言提示快速构建项目。\n\n起初被传统工程师不屑一顾的图尔西奥斯，证明了AI在黑客马拉松中的力量，在他的首次获胜中，他使用ChatGPT将歌曲转换成lo-fi版本。他的成功源于他的竞争精神，这得益于他过去作为职业游戏王牌手的职业生涯，在那里他掌握了高效的策略。\n\n图尔西奥斯不同寻常的背景包括在马戏团家庭长大以及游牧式游戏王职业生涯。由于他的工程师抵制AI，他的元宇宙基础设施公司倒闭后，图尔西奥斯开始专注于黑客马拉松，以探索AI的潜力。\n\n现在，图尔西奥斯为企业承包项目，举办AI编程研讨会，并作为一名独立创始人，正在建立自己的AI代理创业公司，AI处理所有编程工作。他展示了自己的技能，仅用十五分钟就使用AI工具为他的Labubu娃娃创建了一个转售网站。他相信在AI的帮助下，任何人都可以构建他们想要的任何东西。"
  },
  {
    "id": "44473871",
    "title": "The Calculator-on-a-Chip (2015)",
    "url": "http://www.vintagecalculators.com/html/the_calculator-on-a-chip.html",
    "summary": "This article, \"The Calculator-on-a-Chip,\" details the development and introduction of the integrated circuit that revolutionized the calculator industry in the early 1970s. Before the chip, calculators were large, complex, and expensive, requiring multiple circuit boards filled with numerous components.\n\nThe article highlights Mostek's MK6010 (later MK5010) as the first \"Calculator-on-a-Chip,\" developed for Busicom in November 1970. This chip significantly reduced the size, cost, and complexity of calculators. The Busicom Junior was the first to use this chip, replacing two circuit boards with a single chip. A low-power version (MK6010L) enabled the creation of the first pocket calculator, the Busicom LE-120A \"HANDY.\"\n\nTexas Instruments (TI) quickly followed with its TMS1802 (later TMS0102), a more sophisticated single-chip microcontroller optimized for calculator use. Unlike Mostek's custom chip, the TMS1802 was available \"off-the-shelf\" and could be programmed for various functionalities.\n\nThe introduction of these chips significantly lowered labor costs and paved the way for the consumer calculator market. While initial models using the chips were expensive, the price reduction trajectory eventually led to cheaper models and widespread adoption. Despite its pioneering role, Busicom faced financial difficulties and ceased production in 1974, while TI further expanded its microcontroller designs.\n",
    "chinese_title": "芯片上的计算器 (2015)",
    "chinese_summary": "芯片计算器\n        \n本文《芯片计算器》详细介绍了20世纪70年代初彻底改变计算器行业的集成电路的开发和推出。在芯片出现之前，计算器体积庞大、结构复杂且价格昂贵，需要多个电路板才能容纳众多元件。\n\n文章重点介绍了Mostek为Busicom于1970年11月开发的MK6010（后来为MK5010），这是第一款“芯片计算器”。该芯片显著减小了计算器的尺寸、成本和复杂性。Busicom Junior是第一款使用该芯片的产品，它用单个芯片取代了两个电路板。低功耗版本（MK6010L）使第一款袖珍计算器Busicom LE-120A“HANDY”的诞生成为可能。\n\n德州仪器（TI）紧随其后推出了TMS1802（后来为TMS0102），这是一款更先进的单芯片微控制器，专为计算器使用而优化。与Mostek的定制芯片不同，TMS1802是“现成的”，可以编程用于各种功能。\n\n这些芯片的引入显著降低了劳动力成本，并为消费级计算器市场铺平了道路。虽然使用这些芯片的初始型号价格昂贵，但价格下降的趋势最终导致了更便宜的型号和广泛的采用。尽管Busicom发挥了先锋作用，但它面临财务困境，并于1974年停止生产，而TI进一步扩展了其微控制器设计。"
  },
  {
    "id": "44465319",
    "title": "Mini NASes marry NVMe to Intel's efficient chip",
    "url": "https://www.jeffgeerling.com/blog/2025/mini-nases-marry-nvme-intels-efficient-chip",
    "summary": "This article reviews three mini NAS devices: the GMKtec G9, Aiffro K100, and Beelink ME mini, all designed for smaller homelabs and utilizing Intel N100/N150 chips. The author, downsizing from a large storage setup, seeks a compact and efficient NAS solution with around 6TB of usable space.\n\nAll three NASes feature 2.5 Gbps networking (dual on GMKtec and Beelink) and multiple M.2 NVMe SSD slots, leveraging the Intel chip's PCIe lanes. The GMKtec G9 is the budget-friendly option but initially suffered from cooling issues, requiring a design revision. The Aiffro K100 is the smallest, coolest, and most power-efficient, boasting a metal enclosure and comprehensive ventilation, but lacks eMMC and Wi-Fi, and only has one 2.5Gbps port. The Beelink ME mini has six NVMe slots (though most are limited to PCIe Gen 3 x1), built-in eMMC, and a unique internal power supply design. It runs slightly hotter than the K100.\n\nThe author highlights the compromises inherent in these tiny devices. While the G9 offers the best price, its initial cooling problems were significant. The K100 excels in efficiency and cooling but is the most expensive and lacks eMMC. The Beelink offers the most storage expandability, but at the expense of individual drive bandwidth. The author leans towards the K100 if a good deal can be found on 4 TB NVMe SSDs to meet the storage requirement.\n",
    "chinese_title": "迷你NAS结合NVMe与英特尔高效芯片",
    "chinese_summary": "本文评测了三款迷你NAS设备：GMKtec G9、Aiffro K100和Beelink ME mini，它们都专为小型家庭实验室设计，并采用Intel N100/N150芯片。作者正从大型存储设置转型，寻求一种紧凑高效且具有约6TB可用空间的NAS解决方案。\n\n这三款NAS都具有2.5 Gbps网络连接（GMKtec和Beelink为双口），以及多个M.2 NVMe SSD插槽，利用了Intel芯片的PCIe通道。GMKtec G9是经济实惠的选择，但最初存在散热问题，需要进行设计修改。Aiffro K100是最小、最冷静、最节能的设备，拥有金属外壳和全面的通风设计，但缺少eMMC和Wi-Fi，且只有一个2.5Gbps端口。Beelink ME mini具有六个NVMe插槽（尽管大多数被限制为PCIe Gen 3 x1），内置eMMC，以及独特的内部电源设计。它的运行温度略高于K100。\n\n作者强调了这些小型设备固有的妥协。虽然G9提供了最优惠的价格，但其最初的散热问题非常严重。K100在效率和散热方面表现出色，但也是最昂贵的，并且缺少eMMC。Beelink提供了最大的存储扩展性，但代价是单个驱动器的带宽。如果能找到4 TB NVMe SSD的好价钱来满足存储需求，作者倾向于K100。"
  },
  {
    "id": "44476137",
    "title": "7-Zip 25.00",
    "url": "https://github.com/ip7z/7zip/releases/tag/25.00",
    "summary": "The article announces the release of 7-Zip version 25.00. Key improvements include:\n\n*   **Enhanced CPU Utilization:** 7-Zip can now utilize more than 64 CPU threads for compression (zip/7z/xz) and benchmarking, distributing threads across different processor groups in Windows systems with more than 64 CPU threads.\n\n*   **Compression Speed Improvements:** bzip2 compression is 15-40% faster, and deflate (zip/gz) compression is 1-3% faster.\n\n*   **Improved Archive Support:** Better support for zip, cpio, and fat archives is included.\n\n*   **Bug Fixes and Vulnerability Patches:** The release addresses various bugs and vulnerabilities.\n\nThe release was made by ip7z, has 139 forks, 1.7k stars, and 62 people reacted to it. The article mentions loading issues with assets.\n",
    "chinese_title": "7-Zip 25.00",
    "chinese_summary": "文章发布 7-Zip 25.00 版。主要改进包括：\n\n*   **增强 CPU 利用率：** 7-Zip 现在可以利用超过 64 个 CPU 线程进行压缩（zip/7z/xz）和基准测试，并在具有超过 64 个 CPU 线程的 Windows 系统中，将线程分配到不同的处理器组。\n\n*   **压缩速度提升：** bzip2 压缩速度提高 15-40%，deflate (zip/gz) 压缩速度提高 1-3%。\n\n*   **改进的存档支持：** 包括对 zip、cpio 和 fat 存档的更好支持。\n\n*   **漏洞修复：** 此版本修复了各种错误和漏洞。\n\n该版本由 ip7z 发布，有 139 个 fork，1.7k 个 star，并且有 62 人对此作出了反应。文章提到资源加载问题。"
  },
  {
    "id": "44469124",
    "title": "OBBB signed: Reinstates immediate expensing for U.S.-based R&D",
    "url": "https://www.kbkg.com/feature/house-passes-tax-bill-sending-to-president-for-signature",
    "summary": "The \"One Big Beautiful Bill Act\" (OBBBA), passed by the House, represents a significant tax policy overhaul effective immediately or retroactively to the start of 2025. A key provision reinstates immediate expensing for U.S.-based R&D, allowing full deduction of domestic research costs, with a potential catch-up deduction for capitalized expenses from 2022-2024. Small businesses can retroactively apply full expensing to tax years after 2021.\n\nThe act also restores 100% bonus depreciation for qualifying assets placed in service after January 19, 2025, and introduces bonus depreciation for qualified production property until 2029.\n\nConversely, it terminates many IRA clean energy incentives, like 179D and 45L, and limits the Investment Tax Credit (ITC) and Production Tax Credit (PTC) for projects starting construction within 12 months of the act's enactment and placed in service by December 31, 2027.\n\nOther key changes include an increased Section 179 expensing cap for small businesses, preservation of SALT workarounds, an increased SALT cap with a phaseout for high earners, elimination of Section 899 \"Retaliatory Tax,\" softened excess business loss rules, and revisions to Section 163(j) business interest deduction rules. International tax rules are tightened, and the LIHTC ceiling is increased to encourage affordable housing. Pro-business enhancements are included, along with new middle-class deductions. Tax professionals and businesses need to quickly assess the impact of these changes on their portfolios, model scenarios, and communicate with stakeholders to optimize tax strategies.\n",
    "chinese_title": "OBBB签署：恢复美国本土研发费用立即费用化",
    "chinese_summary": "众议院通过的《大型美丽账单法案》（OBBBA）代表着一项重大的税收政策改革，立即生效或追溯至2025年初。一项关键条款是恢复美国本土研发的立即费用化，允许全额扣除国内研究成本，并有可能追溯扣除2022-2024年资本化的费用。小型企业可以将全额费用化追溯应用于2021年之后的纳税年度。\n\n该法案还恢复了2025年1月19日之后投入使用的合格资产的100%额外折旧，并为符合条件的生产财产引入了截至2029年的额外折旧。\n\n相反，该法案终止了许多IRA清洁能源激励措施，例如179D和45L，并限制了投资税收抵免（ITC）和生产税收抵免（PTC），适用于法案颁布后12个月内开始建设并在2027年12月31日之前投入使用的项目。\n\n其他主要变化包括提高小型企业的第179条费用化上限，保留SALT变通办法，提高SALT上限并为高收入者逐步取消，取消第899条“报复性税收”，放宽超额商业亏损规则，并修订第163(j)条商业利息扣除规则。国际税收规则收紧，LIHTC上限提高以鼓励经济适用房。其中包括亲商业的改进措施，以及新的中产阶级扣除额。税务专业人士和企业需要迅速评估这些变化对其投资组合的影响，建立情景模型，并与利益相关者沟通，以优化税务策略。"
  },
  {
    "id": "44455591",
    "title": "Is It Cake? How Our Brain Deciphers Materials",
    "url": "https://nautil.us/is-it-cake-how-our-brain-deciphers-materials-1222193/",
    "summary": "Dale Markowitz's Nautilus article, \"Is It Cake? How Our Brain Deciphers Materials,\" explores the neuroscience behind our ability to recognize what objects are made of. This seemingly simple skill is crucial for survival, helping us interact appropriately with the world, from determining if something is edible to assessing its potential as a tool.\n\nWhile neuroscience has extensively studied object recognition, material perception has been relatively overlooked. An influential paper by Edward H. Adelson in 2001 spurred research in this area. Recent studies focus on specific materials like wood or metal, and properties like gloss or hardness.\n\nA recent PNAS paper by Schmidt, Hebart, Schmid, and Fleming proposes a generalized approach. Using machine learning techniques on a dataset of material images and participant similarity ratings, they identified 36 \"core dimensions of material perception.\" These dimensions, such as \"mineral,\" \"fabric-y,\" \"crystalline,\" and \"spongy,\" are cognitive axes used by the brain to categorize materials.\n\nInstead of a dedicated \"stuff\" area, the brain relies on a distributed network integrating low-level visual features with higher-order knowledge like context, memory, and experience. Research on \"dynamic dot materials\" demonstrates that even without visual texture, the brain can infer material properties based on motion, activating visual, somatosensory, and motor regions. This shows the brain can fill in missing information and anticipates how a material would behave and feel.\n\nThe article concludes that our brains are deeply wired to recognize materials, explaining our fascination with illusions like \"Is It Cake?\" because a glitch in this system would disrupt our interaction with the world.\n",
    "chinese_title": "是蛋糕吗？我们的大脑如何解读材质",
    "chinese_summary": "戴尔·马科维茨的《鹦鹉螺》杂志文章“这是蛋糕吗？我们的大脑如何解读材质”探讨了我们识别物体材质能力背后的神经科学。这种看似简单的技能对于生存至关重要，帮助我们正确地与世界互动，从判断某物是否可食用到评估其作为工具的潜力。\n\n虽然神经科学已经广泛研究了物体识别，但材料感知却相对被忽视。Edward H. Adelson在2001年发表的一篇有影响力的论文推动了该领域的研究。最近的研究集中在诸如木材或金属等特定材料，以及诸如光泽或硬度等属性上。\n\n最近，Schmidt、Hebart、Schmid和Fleming在《美国国家科学院院刊》上发表的一篇论文提出了一种广义方法。他们使用机器学习技术处理了一个材料图像数据集和参与者的相似度评级，识别出了36个“材料感知的核心维度”。这些维度，如“矿物”、“织物状”、“晶体状”和“海绵状”，是大脑用于分类材料的认知轴。\n\n大脑并非依靠专门的“物质”区域，而是依赖于一个分布式网络，将低级视觉特征与高级知识（如背景、记忆和经验）相结合。对“动态点材料”的研究表明，即使没有视觉纹理，大脑也能根据运动推断材料的属性，激活视觉、体感和运动区域。这表明大脑可以填补缺失的信息，并预测材料的行为和触感。\n\n文章总结说，我们的大脑与识别材料的能力深度连接，这解释了我们对“这是蛋糕吗？”这类错觉的着迷，因为该系统中的一个小故障就会扰乱我们与世界的互动。"
  },
  {
    "id": "44468175",
    "title": "Nvidia won, we all lost",
    "url": "https://blog.sebin-nyshkim.net/posts/nvidia-is-full-of-shit/",
    "summary": "The article paints a bleak picture of Nvidia's current state, arguing that its recent successes have come at the expense of consumers. It criticizes the RTX 50 series launch, citing issues like scalper bots, limited stock allegedly artificially inflating demand, and inflated prices through retailer bundling. The author points out that even older RTX 40 series GPUs are overpriced compared to AMD alternatives.\n\nThe piece highlights hardware defects, specifically GPUs with missing ROPs, and the persistent melting 12VHPWR connectors, attributing the latter to a flawed design Nvidia hasn't adequately addressed. The author questions why Nvidia struggles with supply compared to other tech giants like Apple, suggesting a decreased focus on consumer GPUs due to the lucrative data center market.\n\nFurther criticism is leveled at Nvidia's proprietary technologies like DLSS, CUDA, NVENC, and G-Sync, arguing they create vendor lock-in and force users to choose between performance and broader ecosystem compatibility. The article also points to Nvidia breaking backwards compatibility by dropping 32-bit PhysX support, negatively impacting older games.\n\nFinally, the author argues that DLSS, while widespread, is a \"snake oil\" solution that masks the inadequate performance of GPUs for ray tracing. The RTX 5090 still struggles to achieve playable frame rates in demanding ray-traced games at native 4K, implying that Nvidia's technological advancements are overshadowed by their marketing and pricing strategies. Ultimately, the article suggests that Nvidia's dominance has led to a decline in quality and consumer value.\n",
    "chinese_title": "英伟达赢了，我们都输了",
    "chinese_summary": "该文章描绘了英伟达当前黯淡的景象，认为其近期的成功是以牺牲消费者利益为代价的。文章批评了 RTX 50 系列的发布，指出存在黄牛机器人、据称人为抬高需求的有限库存，以及零售商捆绑销售导致的价格虚高等问题。作者指出，即使是较老的 RTX 40 系列 GPU，与 AMD 的替代产品相比，价格也过高。\n\n文章重点指出了硬件缺陷，特别是缺少 ROP 的 GPU，以及持续熔化的 12VHPWR 连接器，并将后者归因于英伟达尚未充分解决的设计缺陷。作者质疑为什么英伟达在供应方面不如苹果等其他科技巨头，暗示由于利润丰厚的数据中心市场，英伟达对消费级 GPU 的关注度降低。\n\n文章进一步批评了英伟达的专有技术，如 DLSS、CUDA、NVENC 和 G-Sync，认为它们造成了供应商锁定，迫使用户在性能和更广泛的生态系统兼容性之间做出选择。文章还指出，英伟达通过放弃 32 位 PhysX 支持破坏了向后兼容性，对旧游戏产生了负面影响。\n\n最后，作者认为，虽然 DLSS 应用广泛，但它是一种“灵丹妙药”，掩盖了 GPU 在光线追踪方面性能不足的事实。RTX 5090 仍然难以在原生 4K 分辨率下，在高要求的光线追踪游戏中实现可玩帧率，这意味着英伟达的技术进步被其营销和定价策略所掩盖。最终，文章认为英伟达的统治地位导致了质量和消费者价值的下降。"
  },
  {
    "id": "44479009",
    "title": "New study offers clues about what makes someone cool",
    "url": "https://www.nytimes.com/2025/06/30/well/mind/cool-people-traits-study.html",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "新研究揭示让人觉得“酷”的因素",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "44477660",
    "title": "Chasing Hobbies over Achievement Boosts Happiness (2023)",
    "url": "https://neurosciencenews.com/hedonism-happiness-achievement-23923/",
    "summary": "This 2023 University of Essex study, published in the Journal of Personality, investigated the relationship between value fulfillment and well-being across India, Turkey, and the UK. Researchers found that prioritizing \"hedonism\" (enjoyment) and \"self-direction\" (freedom) led to increased happiness, better sleep quality, and reduced stress and anxiety. Specifically, focusing on freedom resulted in a 13% increase in well-being, while pursuing hobbies and relaxation led to an 8% rise in well-being and a 10% drop in stress and anxiety.\n\nConversely, prioritizing \"achievement\" and \"conformity\" showed no direct positive impact on happiness. While achievement can indirectly affect happiness via job satisfaction, the study suggests that balancing achievement-oriented pursuits with enjoyment and autonomy is crucial for mental well-being. The study employed a diary method where participants recorded how different values impacted them over nine days. The researchers emphasize the importance of focusing on increasing happiness rather than solely reducing anxiety and stress, suggesting this approach can be more beneficial.\n",
    "chinese_title": "追求爱好比追求成就更能提升幸福感 (2023)",
    "chinese_summary": "2023年埃塞克斯大学研究：追求享乐和自由与幸福感相关\n\n（或：埃塞克斯大学2023年研究：享乐和自由提升幸福感）"
  },
  {
    "id": "44474297",
    "title": "Seine reopens to Paris swimmers after century-long ban",
    "url": "https://www.lemonde.fr/en/france/article/2025/07/05/seine-reopens-to-paris-swimmers-after-century-long-ban_6743058_7.html",
    "summary": "After a century-long ban, the Seine River in Paris reopened to public swimming on July 5, 2025. This milestone follows a major cleanup effort spurred by the Paris 2024 Olympics, where open-water swimming and triathlon events took place in the river. Three supervised swimming zones, equipped with amenities like changing rooms and showers, are now available to the public.\n\nParis officials have implemented safety measures including daily water quality testing and swim assessments by lifeguards. While water quality is reported as \"exceptional,\" with E. coli and enterococci levels far below safety thresholds, swimmers are warned about potential dangers like strong currents and boat traffic. Fines will be issued to those swimming outside designated areas.\n\nThe reopening is the culmination of decades-long efforts, dating back to former Mayor Jacques Chirac's initial advocacy in 1988. President Macron celebrated the reopening, calling it a \"collective effort\" and a source of \"pride\" for France.\n\nAuthorities invested €1.4 billion to improve the Seine's water quality and plan to close the sites after heavy rainfall due to sewage overflow. Despite the risks, the city is hoping for drier weather this year. Mayor Hidalgo views the Seine cleanup as part of a larger strategy to adapt Paris to climate change and improve the quality of life for its citizens. The swimming spots are free and open to the public until August 31.\n",
    "chinese_title": "塞纳河百年禁泳令解除，巴黎泳者重返河中",
    "chinese_summary": "After a century-long ban, the Seine River in Paris reopened to public swimming on July 5, 2025. This milestone follows a major cleanup effort spurred by the Paris 2024 Olympics, where open-water swimming and triathlon events took place in the river. Three supervised swimming zones, equipped with amenities like changing rooms and showers, are now available to the public.\n\nParis officials have implemented safety measures including daily water quality testing and swim assessments by lifeguards. While water quality is reported as \"exceptional,\" with E. coli and enterococci levels far below safety thresholds, swimmers are warned about potential dangers like strong currents and boat traffic. Fines will be issued to those swimming outside designated areas.\n\nThe reopening is the culmination of decades-long efforts, dating back to former Mayor Jacques Chirac's initial advocacy in 1988. President Macron celebrated the reopening, calling it a \"collective effort\" and a source of \"pride\" for France.\n\nAuthorities invested €1.4 billion to improve the Seine's water quality and plan to close the sites after heavy rainfall due to sewage overflow. Despite the risks, the city is hoping for drier weather this year. Mayor Hidalgo views the Seine cleanup as part of a larger strategy to adapt Paris to climate change and improve the quality of life for its citizens. The swimming spots are free and open to the public until August 31.\n"
  },
  {
    "id": "44455196",
    "title": "Robots move Shanghai city block [video]",
    "url": "https://www.youtube.com/watch?v=7ZccC9BnT8k",
    "summary": "生成摘要时出错",
    "chinese_title": "Robots move Shanghai city block [video]",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44469727",
    "title": "ADXL345 (2024)",
    "url": "https://www.tinytransistors.net/2024/08/25/adxl345/",
    "summary": "生成摘要时出错",
    "chinese_title": "ADXL345 (2024)",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44440948",
    "title": "Solve high degree polynomials using Geode numbers",
    "url": "https://www.tandfonline.com/doi/full/10.1080/00029890.2025.2460966",
    "summary": "生成摘要时出错",
    "chinese_title": "Solve high degree polynomials using Geode numbers",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44478247",
    "title": "BYD Seal 06 DM-i Variant: 2,000 Kilometer Range at USD15,340",
    "url": "https://cleantechnica.com/2025/07/05/byd-seal-6-dm-1-variant-2000-kilometer-range-15340-anybody-want-one/",
    "summary": "生成摘要时出错",
    "chinese_title": "BYD Seal 06 DM-i Variant: 2,000 Kilometer Range at USD15,340",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44464641",
    "title": "Kepler.gl",
    "url": "https://kepler.gl/",
    "summary": "生成摘要时出错",
    "chinese_title": "Kepler.gl",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44475600",
    "title": "WinUAE 6 Amiga Emulator",
    "url": "https://www.winuae.net/",
    "summary": "生成摘要时出错",
    "chinese_title": "WinUAE 6 Amiga Emulator",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44476799",
    "title": "Mirage: First AI-Native UGC Game Engine Powered by Real-Time World Model",
    "url": "https://blog.dynamicslab.ai",
    "summary": "生成摘要时出错",
    "chinese_title": "幻境：首个由实时世界模型驱动的AI原生UGC游戏引擎",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44464068",
    "title": "Why I left my tech job to work on chronic pain",
    "url": "https://sailhealth.substack.com/p/why-i-left-my-tech-job-to-work-on",
    "summary": "生成摘要时出错",
    "chinese_title": "我为什么离开科技行业，转而研究慢性疼痛",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44476166",
    "title": "Operators, Not Users and Programmers",
    "url": "https://jyn.dev/operators-not-users-and-programmers/",
    "summary": "生成摘要时出错",
    "chinese_title": "操作员，而非用户和程序员",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44480284",
    "title": "Stop killing games and the industry response",
    "url": "https://blog.kronis.dev/blog/stop-killing-games",
    "summary": "生成摘要时出错",
    "chinese_title": "Stop killing games and the industry response",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44477151",
    "title": "A Canadian's AI hoax duped the media and propelled a 'band' to success",
    "url": "https://www.cbc.ca/news/entertainment/ai-band-hoax-velvet-sundown-1.7575874",
    "summary": "生成摘要时出错",
    "chinese_title": "A Canadian's AI hoax duped the media and propelled a 'band' to success",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44439915",
    "title": "Optimizing typography of insect labels using free fonts and free software (2012) [pdf]",
    "url": "https://www.akentsoc.org/doc/Bowser_ML_2012.pdf",
    "summary": "生成摘要时出错",
    "chinese_title": "Optimizing typography of insect labels using free fonts and free software (2012) [pdf]",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44471695",
    "title": "Problems the AI industry is not addressing adequately",
    "url": "https://www.thealgorithmicbridge.com/p/im-losing-all-trust-in-the-ai-industry",
    "summary": "生成摘要时出错",
    "chinese_title": "Problems the AI industry is not addressing adequately",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44471190",
    "title": "A 37-year-old wanting to learn computer science",
    "url": "https://initcoder.com/posts/37-year-old-learning-cs/",
    "summary": "生成摘要时出错",
    "chinese_title": "A 37-year-old wanting to learn computer science",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44452106",
    "title": "N-Back – A Minimal, Adaptive Dual N-Back Game for Brain Training",
    "url": "https://n-back.net",
    "summary": "生成摘要时出错",
    "chinese_title": "N-Back – A Minimal, Adaptive Dual N-Back Game for Brain Training",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44455867",
    "title": "The ancient invention that ignited game play (2021)",
    "url": "https://www.bbc.com/future/article/20210318-the-ancient-invention-that-ignited-game-play",
    "summary": "生成摘要时出错",
    "chinese_title": "The ancient invention that ignited game play (2021)",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44479743",
    "title": "The 1960s schools experiment that created a whole new alphabet",
    "url": "https://www.theguardian.com/education/2025/jul/06/1960s-schools-experiment-created-new-alphabet-thousands-children-unable-to-spell",
    "summary": "生成摘要时出错",
    "chinese_title": "The 1960s schools experiment that created a whole new alphabet",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44455124",
    "title": "Baba Is Eval",
    "url": "https://fi-le.net/baba/",
    "summary": "生成摘要时出错",
    "chinese_title": "Baba Is Eval",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44455787",
    "title": "Introducing tmux-rs",
    "url": "https://richardscollin.github.io/tmux-rs/",
    "summary": "生成摘要时出错",
    "chinese_title": "Introducing tmux-rs",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44428997",
    "title": "Killer whales groom each other with pieces of kelp",
    "url": "https://www.science.org/content/article/killer-whales-groom-each-other-pieces-kelp",
    "summary": "生成摘要时出错",
    "chinese_title": "Killer whales groom each other with pieces of kelp",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44467279",
    "title": "Show HN: AirBending – Hand gesture based macOS app MIDI controller",
    "url": "https://www.nanassound.com/products/software/airbending",
    "summary": "生成摘要时出错",
    "chinese_title": "Show HN: AirBending – Hand gesture based macOS app MIDI controller",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44465206",
    "title": "Compression Dictionary Transport",
    "url": "https://developer.mozilla.org/en-US/docs/Web/HTTP/Guides/Compression_dictionary_transport",
    "summary": "生成摘要时出错",
    "chinese_title": "Compression Dictionary Transport",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44465206",
    "title": "Compression Dictionary Transport",
    "url": "https://developer.mozilla.org/en-US/docs/Web/HTTP/Guides/Compression_dictionary_transport",
    "summary": "生成摘要时出错",
    "chinese_title": "Compression Dictionary Transport",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44437014",
    "title": "Scientists capture slow-motion earthquake in action",
    "url": "https://phys.org/news/2025-06-scientists-capture-motion-earthquake-action.html",
    "summary": "生成摘要时出错",
    "chinese_title": "Scientists capture slow-motion earthquake in action",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44464647",
    "title": "Ask HN: I want to leave tech: what do I do?",
    "url": "https://write.as/conjure-utopia/lets-say-youre-working-in-tech-and-you-have-a-technical-role-youre-a",
    "summary": "生成摘要时出错",
    "chinese_title": "Ask HN: I want to leave tech: what do I do?",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44476084",
    "title": "The Right Way to Embed an LLM in a Group Chat",
    "url": "https://blog.tripjam.app/the-right-way-to-embed-an-llm-in-a-group-chat/",
    "summary": "生成摘要时出错",
    "chinese_title": "The Right Way to Embed an LLM in a Group Chat",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44479546",
    "title": "Umberto Eco's Guide to Thesis Writing and a Guide to Life",
    "url": "https://www.newyorker.com/books/page-turner/a-guide-to-thesis-writing-that-is-a-guide-to-life",
    "summary": "生成摘要时出错",
    "chinese_title": "Umberto Eco's Guide to Thesis Writing and a Guide to Life",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44470464",
    "title": "The messy reality of SIMD (vector) functions",
    "url": "https://johnnysswlab.com/the-messy-reality-of-simd-vector-functions/",
    "summary": "生成摘要时出错",
    "chinese_title": "The messy reality of SIMD (vector) functions",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44477235",
    "title": "Volunteer finds Holy Grail of abolitionist-era Baptist documents",
    "url": "https://www.bostonherald.com/2025/07/03/baptist-anti-slavery-scroll/",
    "summary": "生成摘要时出错",
    "chinese_title": "Volunteer finds Holy Grail of abolitionist-era Baptist documents",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44474894",
    "title": "Pet ownership and cognitive functioning in later adulthood across pet types",
    "url": "https://www.nature.com/articles/s41598-025-03727-9",
    "summary": "生成摘要时出错",
    "chinese_title": "Pet ownership and cognitive functioning in later adulthood across pet types",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44433062",
    "title": "Lens: Lenses, Folds and Traversals",
    "url": "https://hackage.haskell.org/package/lens",
    "summary": "生成摘要时出错",
    "chinese_title": "Lens: Lenses, Folds and Traversals",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44465980",
    "title": "Gremllm",
    "url": "https://github.com/awwaiid/gremllm",
    "summary": "生成摘要时出错",
    "chinese_title": "Gremllm",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44466888",
    "title": "Sleeping beauty Bitcoin wallets wake up after 14 years to the tune of $2B",
    "url": "https://www.marketwatch.com/story/sleeping-beauty-bitcoin-wallets-wake-up-after-14-years-to-the-tune-of-2-billion-79f1f11f",
    "summary": "生成摘要时出错",
    "chinese_title": "Sleeping beauty Bitcoin wallets wake up after 14 years to the tune of $2B",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44463536",
    "title": "Can Large Language Models Play Text Games Well? (2023)",
    "url": "https://arxiv.org/abs/2304.02868",
    "summary": "生成摘要时出错",
    "chinese_title": "Can Large Language Models Play Text Games Well? (2023)",
    "chinese_summary": "生成摘要时出错"
  }
]