[
  {
    "id": "46087737",
    "title": "It's Always the Process, Stupid",
    "url": "https://its.promp.td/its-always-the-process-stupid/",
    "summary": "This article argues that successful AI implementation in business hinges on solid business process optimization (BPO), not simply applying AI as a \"magic wand\" to existing problems. It criticizes the current focus on AI strategy without first addressing fundamental process inefficiencies, warning that AI will only amplify the speed of existing garbage processes.\n\nThe core issue lies in unstructured data. AI excels at handling messy data like emails and PDFs, which reveals that processes reliant on unstructured data are often unstructured themselves, residing undocumented within the expertise of senior staff. Before AI can be effectively applied, these hidden processes need to be brought into the light, analyzed, and structured.\n\nThe article emphasizes the importance of understanding the trigger, transformation, and structured output within a process before automation. It differentiates between \"smarter\" and \"faster,\" explaining that AI primarily accelerates pattern matching, while true intelligence (wisdom, context) still requires human oversight.\n\nUltimately, the author advocates for a return to fundamental BPO principles. Businesses should map their value chain, identify bottlenecks and waste, and streamline processes before considering AI as an accelerator. The key message is that technology changes, but the rules of business efficiency remain constant: it's always the process. The author also mentions the IT-Divide which consists of Business-IT (compliance, efficiency) and Social-IT (social interaction), and explains why businesses struggle with AI uptake.\n",
    "chinese_title": "总是流程，笨蛋！",
    "chinese_summary": "本文认为，人工智能在商业中的成功应用取决于扎实的业务流程优化（BPO），而不是简单地将人工智能作为解决现有问题的“魔杖”。文章批评了当前只关注人工智能战略而忽略根本流程效率低下的做法，并警告说人工智能只会加速现有垃圾流程的运行速度。\n\n核心问题在于非结构化数据。人工智能擅长处理诸如电子邮件和PDF之类的混乱数据，这表明依赖非结构化数据的流程通常本身就是非结构化的，未被记录，而是存在于资深员工的专业知识中。在有效应用人工智能之前，需要将这些隐藏流程揭示出来，进行分析和结构化。\n\n文章强调了在自动化之前理解流程中的触发、转换和结构化输出的重要性。它区分了“更智能”和“更快”，解释说人工智能主要加速模式匹配，而真正的智能（智慧、背景）仍然需要人工监督。\n\n最终，作者主张回归基本的BPO原则。企业在考虑将人工智能作为加速器之前，应先梳理其价值链，识别瓶颈和浪费，并简化流程。关键信息是，技术在不断变化，但业务效率的规则始终不变：流程永远是关键。作者还提到了由业务IT（合规性、效率）和社会IT（社交互动）组成的IT鸿沟，并解释了为什么企业在人工智能应用方面举步维艰。"
  },
  {
    "id": "46088192",
    "title": "Iceland declares ocean-current instability a national security risk",
    "url": "https://www.dagens.com/news/iceland-declares-ocean-current-instability-a-national-security-risk",
    "summary": "Iceland has declared the potential collapse of the Atlantic Meridional Overturning Circulation (AMOC) as a national security risk, citing mounting evidence of the current's instability and the potential for drastic climate and economic consequences. This marks the first time Iceland has applied such a designation to a climate impact.\n\nThe decision follows new research raising \"grave concerns\" about the AMOC, a critical ocean current system that regulates weather across the Atlantic. Officials fear a breakdown could disrupt transport, damage infrastructure, and devastate the fishing industry.\n\nExperts warn that warming temperatures and disrupted salinity levels are slowing the AMOC, potentially leading to a tipping point this century. A collapse could trigger surging sea levels along US and European coasts, monsoon disruptions in Africa and Asia, and a deep freeze in parts of Europe, especially Iceland, which could become surrounded by sea ice.\n\nThe national security designation will trigger a coordinated, high-level government effort to analyze the threat and develop strategies to manage or mitigate the potential consequences. Iceland's Minister for Environment, Energy, and Climate stressed the existential threat, stating the potential for drastic climate change could make adaptation impossible and that national survival and security are at stake. Other nations are encouraged to treat the risk with similar urgency.\n",
    "chinese_title": "冰岛宣布洋流不稳定为国家安全风险。",
    "chinese_summary": "冰岛将大西洋经向翻转环流（AMOC）潜在崩溃列为国家安全风险，理由是越来越多的证据表明该环流不稳定，并可能造成剧烈的气候和经济后果。 这是冰岛首次将气候影响指定为国家安全风险。\n\n该决定是基于一项新的研究，该研究对AMOC提出了“严重关切”，AMOC是一个重要的洋流系统，调节着整个大西洋的天气。官员们担心，崩溃可能会扰乱运输，破坏基础设施，并摧毁渔业。\n\n专家警告说，气温升高和盐度水平紊乱正在减缓AMOC，可能会导致本世纪出现临界点。崩溃可能会引发美国和欧洲沿海地区海平面急剧上升，非洲和亚洲季风中断，以及欧洲部分地区，特别是冰岛的深度冻结，冰岛可能会被海冰包围。\n\n国家安全指定将触发一项协调一致的高级别政府努力，以分析威胁并制定策略来管理或减轻潜在后果。冰岛环境、能源和气候部长强调了生存威胁，称剧烈的气候变化可能会使适应变得不可能，国家生存和安全受到威胁。鼓励其他国家以类似的紧迫性对待这一风险。"
  },
  {
    "id": "46087596",
    "title": "DNS LOC Record (2014)",
    "url": "https://blog.cloudflare.com/the-weird-and-wonderful-world-of-dns-loc-records/",
    "summary": "This article discusses the implementation and challenges of supporting the little-used DNS LOC record within Cloudflare's authoritative DNS server, RRDNS. The author, John Graham-Cumming, explains that LOC records specify a physical location and, despite their rarity, Cloudflare encountered a situation where a customer's LOC record wasn't being served correctly.\n\nThe investigation revealed that RRDNS lacked the code to parse the textual representation of a LOC record (latitude, longitude, altitude, size, precision) into the binary format required for transmission. The article details both the textual and binary formats as defined in RFC 1876, highlighting the complex encoding used for size and precision, which allows a wide range of values to be represented efficiently.\n\nThe author then describes the solution: writing a parser for the LOC text record type and associated tests. After the fix was rolled out, existing LOC records were correctly served by RRDNS. The article concludes with an example of a successful LOC record query and a brief overview of Cloudflare's mission and services. The key takeaway is the importance of handling even obscure DNS record types when operating at a large scale and the challenges involved in ensuring compatibility with older standards like RFC 1876.\n",
    "chinese_title": "DNS LOC记录 (2014)",
    "chinese_summary": "本文探讨了在Cloudflare权威DNS服务器RRDNS中支持鲜为人用的DNS LOC记录的实现与挑战。作者John Graham-Cumming解释说，LOC记录指定一个物理位置，尽管它们很少见，但Cloudflare遇到了一种情况，即客户的LOC记录未被正确提供。\n\n调查显示，RRDNS缺少将LOC记录的文本表示形式（纬度、经度、海拔、大小、精度）解析为传输所需的二进制格式的代码。本文详细介绍了RFC 1876中定义的文本和二进制格式，重点介绍了用于大小和精度的复杂编码，该编码允许有效地表示各种值。\n\n作者随后描述了解决方案：编写LOC文本记录类型的解析器以及相关测试。修复程序推出后，现有的LOC记录已由RRDNS正确提供。文章最后提供了一个成功的LOC记录查询示例，并简要概述了Cloudflare的使命和服务。主要结论是在大规模运营时处理即使是晦涩的DNS记录类型也很重要，以及确保与RFC 1876等旧标准兼容所涉及的挑战。"
  },
  {
    "id": "46087549",
    "title": "Hachi: An Image Search Engine",
    "url": "https://eagledot.xyz/hachi.md.html",
    "summary": "\"Hachi: An Image Search Engine\" details the development of a self-hosted personal search engine focusing on images, with future plans to expand to video, text, and audio. The author's motivation stems from the limitations of existing search engines, which fail to accommodate the stochastic nature of human queries and the need for user feedback to improve results. Hachi aims to expose multiple attributes of a resource to the user, allowing for recursive query refinement.\n\nKey principles driving the project include minimalism (reducing external dependencies), experimentation (fusing deterministic and semantic attributes), and hackability (making the code easily modifiable). The author aims to avoid data duplication by using a meta-data indexing engine coupled with vector-search engines for semantic search. The system is built using Python and Nim, with Nim used for performance-critical parts.\n\nThe meta-index, a single-threaded, column-oriented database written in Nim, stores and queries meta-data. The author discusses the challenges of string querying in Nim and potential performance improvements using ShortString data types.\n\nA significant feature is face recognition, which involves detecting faces, identifying landmarks, and generating embeddings for nearest neighbor search. The author acknowledges the difficulty in choosing an implementation that balances latency, accuracy, and hardware requirements.\n",
    "chinese_title": "八公：图像搜索引擎",
    "chinese_summary": "Hachi：一个图像搜索引擎 详细介绍了以图像为中心的自托管个人搜索引擎的开发，未来计划扩展到视频、文本和音频。作者的动机源于现有搜索引擎的局限性，这些搜索引擎无法适应人类查询的随机性以及改进结果所需的用户反馈。Hachi旨在向用户展示资源的多个属性，从而允许递归查询细化。\n\n该项目的关键原则包括极简主义（减少外部依赖）、实验性（融合确定性和语义属性）和易hack性（使代码易于修改）。作者的目标是通过使用元数据索引引擎与用于语义搜索的向量搜索引擎相结合来避免数据重复。该系统使用Python和Nim构建，Nim用于性能关键的部分。\n\n元索引是一个用Nim编写的单线程、面向列的数据库，用于存储和查询元数据。作者讨论了在Nim中进行字符串查询的挑战，以及使用ShortString数据类型进行潜在的性能改进。\n\n一个重要的功能是面部识别，涉及检测面部、识别地标以及生成用于最近邻搜索的嵌入。作者承认在选择平衡延迟、准确性和硬件要求的实现方案方面存在困难。"
  },
  {
    "id": "46006323",
    "title": "Bronze Age mega-settlement in Kazakhstan has advanced urban planning, metallurgy",
    "url": "https://archaeologymag.com/2025/11/bronze-age-mega-settlement-in-kazakhstan/",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "哈萨克斯坦青铜时代大型聚落拥有先进的城市规划和冶金术",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "46084956",
    "title": "System 7 natively boots on the Mac mini G4",
    "url": "https://macos9lives.com/smforum/index.php?topic=7711.0",
    "summary": "This forum post announces that System 7 has been successfully booted natively on a Mac mini G4. This is significant because the Mac mini G4 was not originally designed to run System 7. The post is located on a forum dedicated to running Mac OS 9 and earlier operating systems on unsupported hardware. The post is part of a larger thread discussing hacks and upgrades related to Mac OS 9. Recent topics on the forum include discussions about booting Mac OS 9 on the Mac mini G4 with detailed posts, searching for the perfect launcher, compatible SSDs for Mac OS 9, the 1.5GB memory limit in Mac OS 9.2.2, writing software on older systems, buying old hardware, and troubleshooting boot issues. The forum also provides XHTML, RSS, and WAP2 feeds.\n",
    "chinese_title": "Mac mini G4 原生启动 System 7",
    "chinese_summary": "该论坛帖子宣布System 7已成功在Mac mini G4上原生启动。这具有重要意义，因为Mac mini G4最初并非设计用于运行System 7。该帖子位于一个专门在不支持的硬件上运行Mac OS 9及更早操作系统的论坛上。该帖子是讨论与Mac OS 9相关的破解和升级的更广泛主题的一部分。论坛上最近的主题包括关于在Mac mini G4上启动Mac OS 9的讨论，其中包含详细的帖子，寻找完美的启动器，与Mac OS 9兼容的SSD，Mac OS 9.2.2中的1.5GB内存限制，在旧系统上编写软件，购买旧硬件以及解决启动问题。该论坛还提供XHTML、RSS和WAP2订阅源。"
  },
  {
    "id": "46089008",
    "title": "AccessOwl (YC S22) Is Hiring a Technical Account Manager (IAM)",
    "url": "https://www.ycombinator.com/companies/accessowl/jobs/dGC3pcO-technical-account-manager-identity-access-management",
    "summary": "AccessOwl (YC S22), a startup building an AI-native Access Governance Suite, is hiring a Technical Account Manager (IAM) to own post-sale relationships, guide onboarding and implementation for customers, and translate customer requirements into technical solutions. The role involves troubleshooting, proactively monitoring account health, and providing customer feedback to shape the product roadmap.\n\nThe ideal candidate has 3+ years of experience in IT administration or helpdesk (MSP experience is a plus), a solid understanding of IT, identity, and SaaS ecosystems (Google Workspace, Okta, etc.), and excellent communication skills to engage with both technical and non-technical stakeholders. A hands-on problem solver with a builder mindset who thrives in a startup environment is preferred.\n\nAccessOwl offers a remote-first work environment in North America with flexible hours, yearly international team retreats, and the opportunity to shape the account management function at an early-stage, profitable startup. They focus on impact, pragmatism, and building customer-centric processes. To apply, candidates should include three sentences explaining their personal interest in the role.\n\nAccessOwl aims to simplify SaaS access, spending, and compliance using RPA and agentic AI workflows, replacing traditional solutions like Okta, outdated ticketing systems, and spreadsheets. They are a customer-centric team dedicated to solving real problems for IT and security teams.\n",
    "chinese_title": "AccessOwl (YC S22) 招聘技术客户经理 (IAM)",
    "chinese_summary": "AccessOwl (YC S22) 是一家构建 AI 原生访问治理套件的初创公司，现招聘技术客户经理 (IAM)，负责售后客户关系，指导客户进行产品导入和实施，并将客户需求转化为技术解决方案。该职位包括故障排除、主动监控账户健康状况，并提供客户反馈以塑造产品路线图。\n\n理想的候选人拥有 3 年以上 IT 管理或帮助台经验（有 MSP 经验者优先），对 IT、身份和 SaaS 生态系统（Google Workspace、Okta 等）有扎实的理解，并具备与技术和非技术利益相关者沟通的优秀沟通能力。最好是具有实践经验、具有构建者思维并在初创环境中蓬勃发展的解决问题的人。\n\nAccessOwl 在北美提供远程优先的工作环境，工作时间灵活，每年有国际团队旅行，并有机会在早期、盈利的初创公司中塑造客户管理职能。他们注重影响力、实用主义和构建以客户为中心的流程。申请者应包含三句话，说明他们对该职位的个人兴趣。\n\nAccessOwl 旨在利用 RPA 和代理式 AI 工作流程简化 SaaS 访问、支出和合规性，取代 Okta 等传统解决方案、过时的工单系统和电子表格。他们是一支以客户为中心的团队，致力于解决 IT 和安全团队的实际问题。"
  },
  {
    "id": "46087022",
    "title": "The CRDT Dictionary: A Field Guide to Conflict-Free Replicated Data Types",
    "url": "https://www.iankduncan.com/engineering/2025-11-27-crdt-dictionary/",
    "summary": "This article serves as a field guide to Conflict-free Replicated Data Types (CRDTs), data structures designed for distributed systems where concurrent writes and network partitions are common. Unlike traditional methods relying on consensus or \"last-write-wins\" which can lead to data loss or unavailability, CRDTs ensure deterministic merging of data across replicas without coordination.\n\nThe article highlights that CRDTs work because their merge operations are commutative, associative, and idempotent, guaranteeing eventual consistency. It introduces the concept of lattices, where data structure states form a partial order, enabling updates that only move \"upward\" in the ordering. The two main types of CRDTs are state-based (CvRDTs) and operation-based (CmRDTs), with the guide focusing primarily on state-based approaches.\n\nThe article explores several specific CRDTs with interactive demos, including:\n\n*   **G-Counter:** Grow-only counter, suitable for increment-only scenarios.\n*   **PN-Counter:** Allows both increments and decrements, using two G-Counters.\n*   **G-Set:** Grow-only set, ideal for append-only collections.\n*   **2P-Set:** Supports both add and remove, but once an element is removed, it cannot be re-added.\n*   **LWW-Element-Set:** Uses timestamps to resolve conflicts between add and remove operations, enabling re-adding elements.\n\nFor each CRDT, the article explains the core idea, implementation details, underlying mathematical principles, tradeoffs (advantages and disadvantages), and ideal use cases.\n",
    "chinese_title": "CRDT字典：无冲突复制数据类型的实地指南",
    "chinese_summary": "无冲突复制数据类型（CRDT）实战指南：为分布式系统设计的数据结构，可应对并发写入和网络分区。与依赖共识或“后写胜出”的传统方法不同，CRDT 确保跨副本的数据确定性合并，无需协调。\n\n本文强调 CRDT 的工作原理在于其合并操作满足交换律、结合律和幂等律，从而保证最终一致性。介绍了格的概念，即数据结构状态构成偏序关系，从而实现仅在排序中“向上”移动的更新。CRDT 主要分为基于状态（CvRDT）和基于操作（CmRDT）两种类型，本指南主要关注基于状态的方法。\n\n本文通过交互式演示，探讨了几种特定的 CRDT，包括：\n\n*   **G-Counter：** 只增计数器，适用于仅递增的场景。\n*   **PN-Counter：** 允许递增和递减，使用两个 G-Counter 实现。\n*   **G-Set：** 只增集合，非常适合仅追加的集合。\n*   **2P-Set：** 支持添加和删除，但一旦元素被删除，就无法重新添加。\n*   **LWW-Element-Set：** 使用时间戳来解决添加和删除操作之间的冲突，从而可以重新添加元素。\n\n对于每个 CRDT，本文解释了核心思想、实现细节、底层数学原理、权衡（优点和缺点）以及理想的用例。"
  },
  {
    "id": "46045207",
    "title": "WinApps: Run Windows apps as if they were a part of the native Linux OS",
    "url": "https://github.com/winapps-org/winapps",
    "summary": "WinApps allows you to run Windows applications seamlessly on Linux (KDE Plasma, GNOME, XFCE) as if they were native. It achieves this by running Windows in a Docker, Podman, or libvirt virtual machine and using FreeRDP to render the applications alongside Linux apps.\n\nKey features include access to the Linux /home directory from within Windows, Nautilus integration for opening files with Windows applications, a taskbar widget for managing the Windows subsystem, and automatic opening of Microsoft Office links in the Windows subsystem. WinApps supports virtually all Windows applications, except those relying on kernel-level anti-cheat systems. It automatically detects installed applications using community tested lists and registry scanning, providing high-resolution icons and MIME types where available.\n\nThe installation process involves: 1) configuring a Windows VM using Docker/Podman or libvirt (with Docker/Podman being the recommended methods for ease of use), 2) installing dependencies based on your Linux distribution, 3) creating a configuration file (`~/.config/winapps/winapps.conf`) with credentials and settings like the backend (Docker, Podman, or libvirt), IP address, scaling factor, and FreeRDP flags, and 4) testing the FreeRDP connection to ensure proper configuration and certificate enrollment. Security precautions, such as restricting access to the configuration file and using valid Windows credentials, are emphasized.\n",
    "chinese_title": "WinApps: 像运行原生Linux应用一样运行Windows应用",
    "chinese_summary": "WinApps 让你能够在 Linux (KDE Plasma、GNOME、XFCE) 上无缝运行 Windows 应用程序，就像它们是原生应用一样。它通过在 Docker、Podman 或 libvirt 虚拟机中运行 Windows，并使用 FreeRDP 将应用程序与 Linux 应用一同渲染来实现这一点。\n\n主要功能包括从 Windows 访问 Linux 的 /home 目录、使用 Nautilus 集成来通过 Windows 应用程序打开文件、用于管理 Windows 子系统的任务栏小部件，以及在 Windows 子系统中自动打开 Microsoft Office 链接。WinApps 支持几乎所有 Windows 应用程序，但依赖于内核级反作弊系统的应用除外。它使用经过社区测试的列表和注册表扫描自动检测已安装的应用程序，并在可用时提供高分辨率图标和 MIME 类型。\n\n安装过程包括：1) 使用 Docker/Podman 或 libvirt 配置 Windows VM（推荐使用 Docker/Podman 以方便使用），2) 根据您的 Linux 发行版安装依赖项，3) 创建一个包含凭据和设置（如后端（Docker、Podman 或 libvirt）、IP 地址、缩放因子和 FreeRDP 标志）的配置文件（`~/.config/winapps/winapps.conf`），以及 4) 测试 FreeRDP 连接以确保正确配置和证书注册。强调了安全预防措施，例如限制对配置文件的访问和使用有效的 Windows 凭据。"
  },
  {
    "id": "46051332",
    "title": "Building road signs at home using a Cricut Machine",
    "url": "https://annanay.dev/build-a-signboard/",
    "summary": "This article details a DIY project on creating signboards at home using a Cricut Maker 2. The author, inspired by TheSignGuy, outlines the process and required materials.\n\nThe core tool is the Cricut Maker 2, used to cut vinyl based on designs created using the Cricut software. The size of the Cricut and its base sheet (1ft x 2ft in this case) limit the maximum signboard dimensions. The process involves aligning and pressing the vinyl onto the base cutting sheet before cutting.\n\nFor the signboard's base, the author utilizes 4x16 aluminum sheets and 12x12 Plexiglass sheets. A crucial step involves transferring the cut vinyl from its plastic backing onto the chosen base material using transfer tape.\n\nInitially, the author struggled with air bubbles during manual vinyl application. To resolve this, they invested in a cold roll laminator, which ensures a smooth, bubble-free finish when pressing the vinyl onto the base material. The article concludes by mentioning some of the boards the author has created using this method.\n",
    "chinese_title": "使用 Cricut 机器在家制作道路标志",
    "chinese_summary": "本文详细介绍了一个在家使用Cricut Maker 2制作标牌的DIY项目。作者受到TheSignGuy的启发，概述了制作过程和所需材料。\n\n核心工具是Cricut Maker 2，用于根据使用Cricut软件创建的设计切割乙烯基材料。Cricut的尺寸及其底板（在本例中为1英尺 x 2英尺）限制了标牌的最大尺寸。该过程包括在切割前将乙烯基材料对齐并压在底板切割板上。\n\n对于标牌的底板，作者使用了4x16铝板和12x12有机玻璃板。一个关键步骤涉及使用转移胶带将切割好的乙烯基材料从其塑料背衬转移到所选的底板材料上。\n\n最初，作者在手动贴乙烯基材料时遇到了气泡问题。为了解决这个问题，他们投资了一台冷裱机，以确保将乙烯基材料压到基材上时获得光滑、无气泡的表面。文章最后提到了作者使用此方法制作的一些标牌。"
  },
  {
    "id": "46035126",
    "title": "WebR – R in the Browser",
    "url": "https://webr.sh/",
    "summary": "The article \"WebR – R in the Browser\" introduces webR, a version of the R programming language that runs directly in web browsers. The main point is that webR allows users to execute R code without the need for a server-side R installation or connection. The article highlights that JavaScript is required to run the application. Essentially, webR brings the power of R's statistical computing capabilities to a client-side environment.\n",
    "chinese_title": "WebR - 浏览器中的R",
    "chinese_summary": "WebR – 浏览器中的 R\n\n文章“WebR – 浏览器中的 R”介绍了 webR，一个可以直接在网页浏览器中运行的 R 编程语言版本。主要内容是 webR 允许用户执行 R 代码，而无需服务器端的 R 安装或连接。文章强调需要 JavaScript 才能运行该应用程序。本质上，webR 将 R 强大的统计计算能力带到了客户端环境。"
  },
  {
    "id": "46088236",
    "title": "Major AI conference flooded with peer reviews written by AI",
    "url": "https://www.nature.com/articles/d41586-025-03506-6",
    "summary": "A major AI conference, the International Conference on Learning Representations (ICLR) 2026, is facing a crisis due to widespread use of AI in peer reviews. Concerns arose from academics noticing unusually verbose and vague feedback, and even hallucinated citations in the reviews. AI researcher Graham Neubig crowd-sourced an analysis using Pangram Labs' AI-detection tool, which revealed that approximately 21% of the 75,800 peer reviews submitted were fully AI-generated, and over half showed signs of AI assistance.\n\nThe analysis also indicated that 1% of the 19,490 submitted manuscripts were entirely AI-generated, and 9% contained over 50% AI-generated text. This confirmation of suspected AI use in peer review has caused frustration among researchers, as it can negatively impact the evaluation of their work. One researcher discovered that a fully AI-generated review, which gave their paper a low rating, nearly resulted in a rejection.\n\nConference organizers are now implementing automated tools to detect AI policy violations in submissions and reviews. This is the first time ICLR has encountered this problem on such a large scale, and they aim to restore trust in the peer review process. The incident highlights the increasing challenges and ethical considerations associated with AI's role in scientific publishing.\n",
    "chinese_title": "大型人工智能会议充斥着AI撰写的同行评审。",
    "chinese_summary": "机器学习国际会议（ICLR）2026面临危机：同行评审中AI使用泛滥。 学术界注意到评论中出现异常冗长和模糊的反馈，甚至出现捏造的引文，引发担忧。 AI 研究员 Graham Neubig 使用 Pangram Labs 的 AI 检测工具进行众包分析，结果显示，在提交的 75,800 份同行评审中，约 21% 是完全由 AI 生成的，超过一半显示出 AI 辅助的迹象。\n\n分析还表明，在提交的 19,490 份稿件中，1% 完全由 AI 生成，9% 包含超过 50% 的 AI 生成文本。 这种对同行评审中涉嫌使用 AI 的确认，引起了研究人员的不满，因为它会对他们工作的评估产生负面影响。 一位研究人员发现，一份完全由 AI 生成的评论，对其论文的评分很低，几乎导致其论文被拒。\n\n会议组织者现在正在实施自动化工具，以检测提交内容和评审中违反 AI 政策的行为。 这是 ICLR 首次如此大规模地遇到这个问题，他们旨在恢复对同行评审过程的信任。 该事件凸显了与 AI 在科学出版中的作用相关的日益增长的挑战和伦理考量。"
  },
  {
    "id": "46083004",
    "title": "Airbus A320 – intense solar radiation may corrupt data critical for flight",
    "url": "https://www.airbus.com/en/newsroom/press-releases/2025-11-airbus-update-on-a320-family-precautionary-fleet-action",
    "summary": "Airbus has identified a potential safety issue affecting a significant number of in-service A320 Family aircraft: intense solar radiation may corrupt flight control data. Following a recent incident, Airbus is taking proactive steps to mitigate the risk.\n\nThe company has issued an Alert Operators Transmission (AOT), requesting immediate precautionary action from operators to implement software and/or hardware protections. This AOT will be followed by an Emergency Airworthiness Directive from the European Union Aviation Safety Agency (EASA).\n\nAirbus acknowledges that these recommendations will cause operational disruptions for passengers and customers and apologizes for the inconvenience. The company is committed to working closely with operators to ensure the fleet remains safe to fly, prioritizing safety above all else.\n",
    "chinese_title": "空中客车A320 – 强烈太阳辐射可能破坏飞行关键数据",
    "chinese_summary": "空客发现大量在役A320系列飞机存在潜在安全问题：强烈太阳辐射可能导致飞行控制数据损坏。在近期发生一起事故后，空客正采取积极措施降低风险。\n\n该公司已发布警示运营商电报（AOT），要求运营商立即采取预防措施，实施软件和/或硬件保护。此AOT之后，欧洲联盟航空安全局（EASA）将发布紧急适航指令。\n\n空客承认这些建议将对乘客和客户的运营造成中断，并对此造成的不便表示歉意。公司致力于与运营商紧密合作，确保机队飞行安全，并将安全置于首位。"
  },
  {
    "id": "46037031",
    "title": "Show HN: Explore what the browser exposes about you",
    "url": "https://neberej.github.io/exposedbydefault/",
    "summary": "ExposedByDefault is a project that demonstrates the surprising amount of information a browser reveals about a user simply by visiting a webpage. It allows users to see, in real-time, the data their browser exposes without any explicit action on their part. This includes information like:\n\n*   **Basic Browser & OS Details:** The type of browser and operating system being used, version numbers, and device details.\n*   **Hardware Information:** CPU cores, memory capacity, and other hardware specifications.\n*   **Network Information:** IP address, network connection type (e.g., Wi-Fi, Ethernet), and possibly even location information.\n*   **Installed Fonts:** A list of all fonts installed on the system.\n*   **Screen Resolution & Color Depth:** The screen resolution, color depth, and other display-related settings.\n*   **Installed Plugins & Extensions:** Information about browser plugins and extensions, which can reveal specific software or services used.\n*   **User Preferences:** Language settings, time zone, and other personalized preferences.\n\nThe project highlights the potential for websites to track users based on this information, even without cookies or other traditional tracking methods. This can contribute to browser fingerprinting, a technique used to uniquely identify users based on their specific browser configuration. The demonstration serves as a reminder of the privacy risks associated with web browsing and the importance of being aware of what information is being shared automatically. It implicitly encourages users to consider privacy-enhancing tools and browser configurations.\n",
    "chinese_title": "Show HN: 探索浏览器暴露的关于你的信息",
    "chinese_summary": "ExposedByDefault 是一个项目，旨在展示浏览器仅通过访问网页就能出人意料地泄露大量用户信息。它允许用户实时查看他们的浏览器在未经任何明确操作的情况下暴露的数据。这包括以下信息：\n\n*   **基本浏览器和操作系统详情：** 所使用的浏览器和操作系统类型、版本号和设备详情。\n*   **硬件信息：** CPU核心数、内存容量和其他硬件规格。\n*   **网络信息：** IP地址、网络连接类型（例如，Wi-Fi、以太网），甚至可能包括位置信息。\n*   **已安装字体：** 系统上安装的所有字体的列表。\n*   **屏幕分辨率和颜色深度：** 屏幕分辨率、颜色深度和其他显示相关设置。\n*   **已安装插件和扩展：** 关于浏览器插件和扩展的信息，这些信息可以揭示所使用的特定软件或服务。\n*   **用户偏好：** 语言设置、时区和其他个性化偏好。\n\n该项目突出了网站基于这些信息跟踪用户的可能性，即使没有cookies或其他传统跟踪方法。这可能导致浏览器指纹识别，这是一种基于用户特定浏览器配置来唯一识别用户的技术。该演示提醒人们与网络浏览相关的隐私风险，以及了解哪些信息正在自动共享的重要性。它隐式地鼓励用户考虑增强隐私的工具和浏览器配置。"
  },
  {
    "id": "46056715",
    "title": "Running a Business Means Contact with Reality",
    "url": "https://fredkozlowski.com/2025/11/02/running-a-business-means-contact-with-reality/",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "经营企业意味着接触现实",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "46085585",
    "title": "Garfield's Proof of the Pythagorean Theorem",
    "url": "https://en.wikipedia.org/wiki/Garfield%27s_proof_of_the_Pythagorean_theorem",
    "summary": "Garfield's proof of the Pythagorean theorem, published in 1876 while James A. Garfield was a U.S. Congressman, is an original and \"clever\" demonstration of the famous theorem. Garfield, later the 20th U.S. President, is the only president to contribute an original concept to mathematics.\n\nThe proof involves constructing a trapezoid from two congruent right triangles (ABC and BDE) and an isosceles right triangle (ABD). The triangles share sides a, b, and hypotenuse c. The area of the trapezoid ACED is then calculated in two ways: first, as height x average of parallel sides, resulting in 1/2(a+b)(a+b); and second, as the sum of the areas of the three triangles, resulting in 1/2(ab) + 1/2(c^2) + 1/2(ab).\n\nEquating these two expressions for the area of the trapezoid: 1/2(a+b)(a+b) = 1/2(ab) + 1/2(c^2) + 1/2(ab). Simplifying the equation leads to the Pythagorean theorem: a^2 + b^2 = c^2. This proof is recognized for its ingenuity and is included in collections of Pythagorean theorem proofs.\n",
    "chinese_title": "加菲尔德对勾股定理的证明",
    "chinese_summary": "加菲尔德对勾股定理的证明：美国总统的数学贡献\n\n加菲尔德在1876年担任美国国会议员期间发表的勾股定理证明，是对著名定理的一种原创且“巧妙”的论证。加菲尔德后来成为美国第20任总统，也是唯一一位为数学贡献原创概念的总统。\n\n该证明涉及用两个全等的直角三角形（ABC和BDE）和一个等腰直角三角形（ABD）构造一个梯形。这些三角形共享边a、b和斜边c。梯形ACED的面积随后以两种方式计算：首先，作为高乘以平行边的平均值，结果为1/2(a+b)(a+b)；其次，作为三个三角形面积的总和，结果为1/2(ab) + 1/2(c^2) + 1/2(ab)。\n\n将梯形面积的这两个表达式相等：1/2(a+b)(a+b) = 1/2(ab) + 1/2(c^2) + 1/2(ab)。简化该方程即可得出勾股定理：a^2 + b^2 = c^2。该证明因其独创性而受到认可，并被收录在勾股定理证明的合集中。"
  },
  {
    "id": "46087029",
    "title": "Chainalysis Successful Deanonymization Attack on Monero",
    "url": "https://darkwebinformer.com/chainalysis-successful-deanonymization-attack-on-monero-2/",
    "summary": "This article, originally posted on Dread, details a claimed successful deanonymization attack on Monero by Chainalysis. According to the author, Chainalysis runs a network of \"poisoned\" Monero nodes globally, which they use to de-anonymize users. These nodes can serve poisoned RingCT decoys, effectively reducing transaction anonymity to 1:1 for users who connect to them.\n\nThe attack relies on collecting metadata (IP addresses, timestamps, transaction sizes, fees), contracting ISPs for user data, and linking blockchain activity to real-world identities. Even using Tor or VPNs isn't foolproof if your originating IP is tied to your real identity. This information is then used to link transactions to centralized exchanges, leading to fund freezes and KYC requests.\n\nThe article's main recommendation for countermeasures is to **run your own full or pruned Monero node**. This enables the Dandelion++ feature and prevents poisoned decoys. Other countermeasures include using Tor from locations not linked to your real identity, using DEXes instead of CEXes, mixing Monero properly, and generally obfuscating your transactions as much as possible. The article emphasizes the danger of using remote nodes, especially those potentially controlled by malicious actors like Chainalysis. Finally, the article provides an example scenario illustrating how a combined attack can deanonymize a Monero user despite using Tor. The author urges users to take precautions and seek help if needed.\n",
    "chinese_title": "Chainalysis成功破解门罗币匿名性",
    "chinese_summary": "据称Chainalysis成功破解Monero的匿名性：一种可能的攻击方式\n\n该文章最初发布在Dread论坛上，详细描述了一种据称由Chainalysis对Monero发起的成功去匿名化攻击。作者称，Chainalysis在全球运行一个“有毒”的Monero节点网络，利用这些节点来去匿名化用户。这些节点可以提供有毒的RingCT诱饵，有效地将连接到这些用户的交易匿名性降低到1:1。\n\n该攻击依赖于收集元数据（IP地址、时间戳、交易大小、费用）、联系ISP获取用户数据，并将区块链活动与现实世界身份联系起来。即使使用Tor或VPN，如果您的原始IP与您的真实身份相关联，也并非万无一失。然后，这些信息被用来将交易与中心化交易所联系起来，导致资金冻结和KYC请求。\n\n文章的主要对策建议是**运行您自己的完整或修剪过的Monero节点**。 这将启用Dandelion++功能并防止有毒诱饵。 其他对策包括从未与您的真实身份相关联的位置使用Tor，使用DEX而不是CEX，正确地混合Monero，以及通常尽可能地混淆您的交易。 该文章强调了使用远程节点的危险，尤其是那些可能由Chainalysis等恶意行为者控制的节点。 最后，该文章提供了一个示例场景，说明了即使使用Tor，组合攻击如何能够去匿名化Monero用户。 作者敦促用户采取预防措施，并在需要时寻求帮助。"
  },
  {
    "id": "46043318",
    "title": "Build Your Own Router with URLPattern()",
    "url": "https://jschof.dev/posts/2025/11/build-your-own-router/",
    "summary": "This article explains how to build a simple Single Page Application (SPA) router using the newly available `URLPattern()` browser API and vanilla JavaScript. The key idea is to use `URLPattern()` to match the browser's URL against a configured set of routes and render the corresponding web component.\n\nThe author highlights the importance of `URLPattern()` in accurately testing the browser URL and capturing dynamic parts of routes. The router configuration is an array of objects, each associating a URL route (using `URLPattern()`) with a specific web component. The router component iterates through these configurations, rendering the first matching component as a child.\n\nThe article then addresses handling SPA navigation, including server configuration to ensure all paths serve the index HTML file. It demonstrates how to intercept link clicks (`preventDefault()`) to simulate page transitions by manually setting the URL and updating the browser history using `window.pushState()`.  A click handler is set up to accomplish this.\n\nFinally, the article covers handling browser back/forward button clicks by listening for the `popstate` event and rendering the appropriate component based on the updated URL.  A working example is provided in StackBlitz.\n\nThe article concludes with a discussion of security considerations (XSS vulnerabilities) when building custom routers, emphasizing the importance of keeping the router configuration private and avoiding rendering based solely on query parameters or dynamic segments. It also raises the question of whether web components are the ideal choice for building routers.\n",
    "chinese_title": "使用URLPattern()构建你自己的路由器",
    "chinese_summary": "本文阐述了如何使用新推出的`URLPattern()`浏览器 API 和原生 JavaScript 构建一个简单的单页应用 (SPA) 路由器。其核心思想是使用 `URLPattern()` 将浏览器 URL 与配置的一组路由进行匹配，并渲染相应的 Web 组件。\n\n作者强调了 `URLPattern()` 在精确测试浏览器 URL 和捕获路由动态部分方面的重要性。路由器配置是一个对象数组，每个对象都将 URL 路由（使用 `URLPattern()`）与特定的 Web 组件相关联。路由器组件遍历这些配置，并将第一个匹配的组件渲染为子组件。\n\n本文接着探讨了处理 SPA 导航的问题，包括服务器配置，以确保所有路径都提供索引 HTML 文件。它演示了如何拦截链接点击 (`preventDefault()`)，通过手动设置 URL 并使用 `window.pushState()` 更新浏览器历史记录来模拟页面转换。为此，设置了一个点击处理程序。\n\n最后，本文介绍了通过监听 `popstate` 事件并根据更新后的 URL 渲染相应的组件来处理浏览器后退/前进按钮点击。StackBlitz 中提供了一个可用的示例。\n\n本文最后讨论了构建自定义路由器时的安全注意事项（XSS 漏洞），强调了保持路由器配置私有以及避免仅根据查询参数或动态片段进行渲染的重要性。它还提出了 Web 组件是否是构建路由器的理想选择的问题。"
  },
  {
    "id": "46088379",
    "title": "Testing Shows Automotive Glassbreakers Can't Break Modern Automotive Glass",
    "url": "https://www.core77.com/posts/138925/Testing-Shows-Automotive-Glassbreakers-Cant-Break-Modern-Automotive-Glass",
    "summary": "This Core77 article examines the effectiveness of automotive glassbreakers in modern vehicles. It argues that the $500 million car escape tool market is driven by fear, fueled by the fantasy of needing these tools in a crash involving fire or submersion. However, these scenarios are statistically rare.\n\nThe key point is that modern vehicles increasingly use laminated glass for side windows due to the \"Ejection Mitigation Rule,\" making traditional glassbreakers designed for tempered glass ineffective. AAA research confirms that common glassbreakers fail against laminated glass. While not all automakers use laminated glass (some opt for advanced side airbags), major brands like Acura, BMW, Chevy, Ford, Honda, and Toyota now widely employ it.\n\nTherefore, glassbreakers are mostly only helpful in older vehicles with tempered glass. However, seatbelt cutters remain useful for first responders needing to quickly free unconscious accident victims. The article concludes that while glassbreakers are largely obsolete for modern cars, seatbelt cutters still hold value in specific, emergency rescue situations.\n",
    "chinese_title": "测试显示汽车玻璃破碎器无法击碎现代汽车玻璃",
    "chinese_summary": "Core77文章：现代车辆的车窗击破器是否有效？\n该文章认为，价值5亿美元的汽车逃生工具市场是由恐惧驱动的，源于人们幻想在发生火灾或车辆落水的事故中需要这些工具。然而，这些情况在统计上非常罕见。\n\n关键在于，由于“弹出缓解规则”，现代车辆越来越多地使用夹层玻璃作为侧窗，这使得专为钢化玻璃设计的传统车窗击破器失效。美国汽车协会（AAA）的研究证实，常见的车窗击破器对夹层玻璃无效。虽然并非所有汽车制造商都使用夹层玻璃（有些选择使用先进的侧面安全气囊），但讴歌、宝马、雪佛兰、福特、本田和丰田等主要品牌现在广泛使用夹层玻璃。\n\n因此，车窗击破器主要只对使用钢化玻璃的旧款车辆有效。然而，安全带切割器对于需要快速解救昏迷事故受害者的急救人员仍然有用。文章总结说，虽然车窗击破器在很大程度上已不适用于现代汽车，但安全带切割器在特定的紧急救援情况下仍然具有价值。"
  },
  {
    "id": "46084535",
    "title": "Every mathematician has only a few tricks (2020)",
    "url": "https://mathoverflow.net/questions/363119/every-mathematician-has-only-a-few-tricks",
    "summary": "This MathOverflow post discusses Gian-Carlo Rota's assertion that \"every mathematician has only a few tricks\" that they repeatedly use. The question asks for examples of these common mathematical tricks.\n\nMany answers suggest core principles rather than specific techniques. These include:\n\n*   Changing the order of summation/integration (Fubini's theorem variant).\n*   Simplifying or complicating the problem to make it provable.\n*   Adding parameters to a problem to generalize and find a solution.\n*   Using the triangle inequality.\n*   Integration by parts.\n*   Relating the maximum/minimum to the average (Pigeonhole Principle).\n*   Employing the probabilistic method (trying a random object/construction).\n*   Using the Möbius function instead of Inclusion-Exclusion.\n*   Using continuity for integer-valued functions to prove constancy.\n*   Looking up sequences in OEIS.\n\nSome comments indicate that Rota's point might be that each mathematician develops a personalized set of techniques they deeply understand and repeatedly apply, rather than universal tricks known by all. The thread highlights that even famous mathematicians may rely on a limited set of core ideas, applying them ingeniously across various problems.\n",
    "chinese_title": "每个数学家只有几个诀窍 (2020)",
    "chinese_summary": "这个MathOverflow帖子讨论了吉安-卡洛·罗塔的论断，即“每位数学家只有少数几个反复使用的技巧”。该问题征求这些常见数学技巧的例子。\n\n许多回答建议的是核心原则，而非具体技术。这些包括：\n\n*   改变求和/积分的顺序（富比尼定理的变体）。\n*   简化或复杂化问题以使其可证明。\n*   向问题添加参数以进行推广并找到解决方案。\n*   使用三角不等式。\n*   分部积分法。\n*   将最大值/最小值与平均值相关联（鸽巢原理）。\n*   采用概率方法（尝试随机对象/构造）。\n*   使用莫比乌斯函数代替容斥原理。\n*   使用连续性证明整数值函数的常数性。\n*   在OEIS中查找序列。\n\n一些评论表明，罗塔的观点可能是，每位数学家都会发展出一套他们深刻理解并反复应用的个性化技术，而不是所有人都知道的通用技巧。该帖子强调，即使是著名的数学家也可能依赖于一套有限的核心思想，并在各种问题中巧妙地应用它们。"
  },
  {
    "id": "46081188",
    "title": "Imgur geo-blocked the UK, so I geo-unblocked my network",
    "url": "https://blog.tymscar.com/posts/imgurukproxy/",
    "summary": "Oscar Molnar was frustrated that Imgur geo-blocked the UK, making embedded images unavailable across the internet (e.g., Minecraft shader previews). Instead of installing VPNs on individual devices and suffering speed hits on his 2.5 Gbps internet connection, he implemented a network-level solution.\n\nHe uses Pi-hole to intercept DNS requests for i.imgur.com, routing them to his Traefik reverse proxy. Traefik directs this traffic to a Gluetun container, which establishes a VPN connection. Inside Gluetun's network, an Nginx container acts as a simple TCP proxy, passing the request to the real i.imgur.com through the VPN tunnel. The image then returns through the tunnel to the requesting device.\n\nThis setup requires minimal Nginx configuration for TCP passthrough with SNI. Docker Compose manages Gluetun (for the VPN) and Nginx containers. Traefik is configured to route i.imgur.com traffic using TCP routing and TLS passthrough. Molnar uses NixOS and Agenix to declaratively configure and manage the system, including encrypted VPN credentials.\n\nThe result is that every device on his network can access Imgur images without individual VPNs or client-side configuration. The latency impact is minimal and only affects Imgur traffic. He acknowledges the setup is overkill but appreciates its cleanliness, minimal maintenance, and ability to finally see those Minecraft shaders.\n",
    "chinese_title": "Imgur对英国进行了地理封锁，所以我对我的网络进行了地理解锁。",
    "chinese_summary": "奥斯卡·莫尔纳对Imgur封锁英国地区感到沮丧，导致嵌入式图片在整个互联网上无法访问（例如，Minecraft着色器预览）。他没有在单个设备上安装VPN并承受2.5 Gbps互联网连接的速度损失，而是实施了一个网络级解决方案。\n\n他使用Pi-hole拦截对i.imgur.com的DNS请求，并将其路由到他的Traefik反向代理。Traefik将此流量定向到一个Gluetun容器，该容器建立一个VPN连接。在Gluetun的网络内部，一个Nginx容器充当一个简单的TCP代理，通过VPN隧道将请求传递到真正的i.imgur.com。然后，图像通过隧道返回到请求设备。\n\n此设置只需要最少的Nginx配置即可进行带有SNI的TCP直通。Docker Compose管理Gluetun（用于VPN）和Nginx容器。Traefik配置为使用TCP路由和TLS直通来路由i.imgur.com流量。莫尔纳使用NixOS和Agenix来声明式地配置和管理系统，包括加密的VPN凭据。\n\n结果是，他网络上的每个设备都可以访问Imgur图像，而无需单独的VPN或客户端配置。延迟影响很小，并且仅影响Imgur流量。他承认这种设置有些过度，但他欣赏它的简洁性、最少的维护以及最终能够看到那些Minecraft着色器的能力。"
  },
  {
    "id": "46083303",
    "title": "Confessions of a Software Developer: No More Self-Censorship",
    "url": "https://kerrick.blog/articles/2025/confessions-of-a-software-developer-no-more-self-censorship/",
    "summary": "Kerrick Long, a software developer, explains his recent absence from blogging by confessing the fears that led him to self-censor. He now aims to be more transparent about his learning journey and professional experiences.\n\nHe reveals several knowledge gaps: a lack of understanding of polymorphism despite years of OO programming, forgetting SQL skills due to lack of use, and neglecting to write automated tests for the majority of his production code (a practice he now recognizes as ethically questionable). He also admits to abandoning learning Blazor after a shift in his company's tech stack strategy.\n\nKerrick then shares personal fears, including being perceived negatively by his employer for wanting to write more Ruby and being harassed online after contributing AI-assisted code to an open-source project without disclosure. The cyberbullying incident deeply affected him, leading him to fear further online interactions.\n\nFinally, he touches on workplace issues, arguing against custom software development processes in favor of established methodologies like Scrum or Kanban, and expressing his preference for in-office work despite having a remote job. He fears that admitting his preference could jeopardize his current and future employment.\n\nNow that he's started, Kerrick plans to be more open in his writing and encourages readers to engage with him and subscribe to his blog via Mastodon, RSS, or email.\n",
    "chinese_title": "软件开发者的自白：不再自我审查",
    "chinese_summary": "软件开发者Kerrick Long解释了他近期停止更新博客的原因，坦承了导致他自我审查的恐惧。他现在计划更加透明地分享他的学习历程和职业经验。\n\n他坦露了一些知识缺口：尽管有多年的面向对象编程经验，却对多态缺乏理解；由于缺乏使用而忘记了SQL技能；并且忽略了为大部分生产代码编写自动化测试（他现在认为这种做法在道德上是有问题的）。他还承认，在公司技术栈策略转变后，他放弃了学习Blazor。\n\nKerrick随后分享了个人的恐惧，包括因想编写更多Ruby代码而被雇主负面看待，以及在未经披露的情况下向开源项目贡献了AI辅助代码后受到网络骚扰。网络欺凌事件深深地影响了他，导致他害怕进一步的在线互动。\n\n最后，他谈到了工作场所问题，反对自定义软件开发流程，赞成像Scrum或Kanban这样的成熟方法，并表达了他对在办公室工作的偏好，尽管他有一份远程工作。他担心承认自己的偏好可能会危及他目前和未来的工作。\n\n现在他已经开始了，Kerrick计划在他的写作中更加开放，并鼓励读者通过Mastodon、RSS或电子邮件与他互动并订阅他的博客。"
  },
  {
    "id": "46054879",
    "title": "Anthony Bourdain's Lost Li.st's",
    "url": "https://bourdain.greg.technology/",
    "summary": "This article is a partial archive of Anthony Bourdain's lists from the defunct website li.st, recovered from the Internet Archive. It compiles a diverse range of Bourdain's opinions and preferences, showcasing his unique perspective on various topics.\n\nThe lists cover a broad spectrum, including his favorite 80's playlist, humorous captions for a Donald Trump image, and \"Crimes Against Food,\" where he humorously critiques culinary offenses like brioche hamburger buns and truffle oil.\n\nHe also details dishes he craves for his hypothetical NYC market, highlighting specific vendors from his travels in Singapore, Vietnam, Hong Kong, and Mexico. His \"Food on Film\" list praises movies that accurately depict the cooking profession or the joy of eating, such as \"Eat Drink Man Woman\" and \"Ratatouille.\"\n\nOther lists explore potential band names, perfect albums, things he finds terrifying (clowns, mimes, Switzerland), sequels that surpass the originals, and six memorable aspects of dining with President Obama in Hanoi. He also shares a list of films from the Criterion Collection and Websites he liked.\n\nFinally, the article presents Bourdain's recommendations for \"Underrated, Douche-free Destinations,\" advocating for places like Uruguay, Marseille, Laos, Sardinia, and Beirut, praising their authenticity, cuisine, and lack of mainstream tourism.\n",
    "chinese_title": "安东尼·波登遗失的清单",
    "chinese_summary": "本文是已关闭的网站li.st上安东尼·布尔丹列表的部分存档，从互联网档案馆恢复而来。它汇编了布尔丹的各种观点和偏好，展示了他对不同主题的独特见解。\n\n这些列表涵盖了广泛的范围，包括他最喜欢的80年代播放列表、唐纳德·特朗普图像的幽默标题以及“美食犯罪”，他在其中幽默地批评了诸如奶油面包汉堡和松露油等烹饪冒犯行为。\n\n他还详细介绍了他在假想的纽约市场渴望的菜肴，重点介绍了来自他在新加坡、越南、香港和墨西哥旅行中的特定供应商。他的“电影中的食物”列表赞扬了那些准确描绘烹饪行业或美食乐趣的电影，例如《饮食男女》和《料理鼠王》。\n\n其他列表探讨了潜在的乐队名称、完美的专辑、他认为可怕的事物（小丑、哑剧、瑞士）、超越原作的续集以及在河内与奥巴马总统共进晚餐的六个难忘的方面。他还分享了一个来自标准收藏的电影列表和他喜欢的网站。\n\n最后，文章介绍了布尔丹关于“被低估的、无混蛋的目的地”的建议，倡导像乌拉圭、马赛、老挝、撒丁岛和贝鲁特这样的地方，赞扬它们的真实性、美食和缺乏主流旅游业。"
  },
  {
    "id": "46080364",
    "title": "So you wanna build a local RAG?",
    "url": "https://blog.yakkomajuri.com/blog/local-rag",
    "summary": "This article details the author's experience building a local, fully open-source RAG (Retrieval-Augmented Generation) system using Skald, with a focus on data privacy and self-hosting. The author outlines the key components of a RAG system (vector database, embeddings model, LLM, reranker, document parsing) and provides open-source alternatives for each.\n\nThe author's initial setup uses Postgres + pgvector for the vector database, Sentence Transformers for embeddings, GPT-OSS 20B as the LLM, Sentence Transformers cross-encoder for reranking, and Docling for document parsing. The goal was to create a functional and easily deployable system, with extensive benchmarking planned for further optimization.\n\nThe author then compares the performance of this local setup against a cloud-based setup (Voyage AI embeddings and reranker, Claude Sonnet LLM) using a custom question/answer dataset based on the PostHog website content. The cloud setup performed exceptionally well. The local setup, while initially scoring lower, showed promise, especially with point queries in English. Switching to multilingual models like bge-m3 and mmarco-mMiniLMv2-L12-H384-v1 improved performance significantly, though challenges remained in aggregating information from multiple documents.\n\nThe article concludes that building a local RAG system is feasible and improving, and that performance will improve as better open source models emerge. The author encourages engagement and collaboration for further development and optimization of open-source RAG solutions, particularly for organizations with strict data privacy requirements.\n",
    "chinese_title": "所以你想搭建一个本地RAG？",
    "chinese_summary": "本文详细介绍了作者使用Skald构建本地、完全开源的RAG（检索增强生成）系统的经验，重点关注数据隐私和自托管。作者概述了RAG系统的关键组件（向量数据库、嵌入模型、LLM、重排序器、文档解析），并为每个组件提供了开源替代方案。\n\n作者的初始设置使用Postgres + pgvector作为向量数据库，Sentence Transformers用于嵌入，GPT-OSS 20B作为LLM，Sentence Transformers交叉编码器用于重排序，Docling用于文档解析。目标是创建一个功能完善且易于部署的系统，并计划进行广泛的基准测试以进一步优化。\n\n随后，作者使用基于PostHog网站内容的自定义问答数据集，将此本地设置的性能与基于云的设置（Voyage AI嵌入和重排序器，Claude Sonnet LLM）进行了比较。云设置表现出色。本地设置虽然最初得分较低，但显示出潜力，尤其是在英语的点查询方面。切换到bge-m3和mmarco-mMiniLMv2-L12-H384-v1等多语言模型后，性能显着提高，但从多个文档中聚合信息仍然面临挑战。\n\n文章总结说，构建本地RAG系统是可行且不断改进的，随着更好的开源模型出现，性能将会提高。作者鼓励大家参与和协作，以进一步开发和优化开源RAG解决方案，特别是对于那些具有严格数据隐私要求的组织。"
  },
  {
    "id": "46086624",
    "title": "High air pollution could diminish exercise benefits by half – study",
    "url": "https://scienceclock.com/exercise-may-protect-less-when-air-pollution-is-high-study-finds/",
    "summary": "The article \"High air pollution could diminish exercise benefits by half – study\" suggests that exercising in areas with high air pollution can significantly reduce the health benefits typically gained from physical activity. The core finding is that pollution exposure can counteract the positive effects of exercise, potentially halving the gains. This means individuals exercising in polluted environments may not experience the same level of cardiovascular improvement, respiratory health benefits, or overall well-being as those exercising in cleaner air. The study underscores the importance of considering air quality when making decisions about exercise location and timing to maximize health benefits and minimize the detrimental effects of pollution. While the article is brief, this summary captures the key message about the interplay between exercise and air pollution.\n",
    "chinese_title": "高空气污染或使运动益处减半——研究",
    "chinese_summary": "研究表明：空气污染严重或使运动益处减半"
  },
  {
    "id": "46086920",
    "title": "Show HN: I built Magiclip – an all-in-one AI studio",
    "url": "https://magiclip.io/",
    "summary": "Magiclip is an AI-powered platform designed to transform existing video content into engaging short-form videos for platforms like TikTok, Instagram Reels, and YouTube Shorts. It streamlines the creation process, claiming users can create viral shorts in just two clicks.\n\nKey features include:\n\n*   **AI Video Generation:** Uses Veo 3 AI to create professional-looking videos from text prompts.\n*   **Automatic Clipping & Optimization:** Transforms longer videos (like YouTube videos) into shorter, optimized clips with automatic subtitles, designed to capture attention on social media.\n*   **AI Voice Generation:** Converts text into realistic, natural voices in multiple languages for narrations or explanations.\n*   **AI Image Generation:** Creates unique images from text descriptions.\n*   **Split-screen Video:** Enables adding gameplay or animated backgrounds.\n\nMagiclip offers tiered pricing plans (Creator, Expert, and Professional) with varying limits on the number of AI video generations, image credits, and voice credits per month. The plans cater to different levels of usage, from individual creators to professionals managing multiple accounts. The platform also provides estimates of potential earnings based on view counts, suggesting a monetization focus.\n\nThe FAQ section answers common questions regarding functionality, supported formats, usage limits, language availability, social media optimization, and subscription cancellation. Magiclip aims to simplify video content creation with AI-driven tools that enhance videos with subtitles, effects, and voices, making them suitable for short-form video platforms.\n",
    "chinese_title": "展示 HN: 我搭建了 Magiclip – 一体化 AI 工作室",
    "chinese_summary": "Magiclip：一款由人工智能驱动的平台，旨在将现有视频内容转化为引人入胜的短视频，适用于 TikTok、Instagram Reels 和 YouTube Shorts 等平台。它简化了创作过程，声称用户只需点击两下即可创建病毒式短片。\n\n主要功能包括：\n\n*   **人工智能视频生成：** 使用 Veo 3 AI 通过文本提示创建专业外观的视频。\n*   **自动剪辑和优化：** 将较长的视频（如 YouTube 视频）转换为更短、优化的片段，并自动添加字幕，旨在吸引社交媒体上的注意力。\n*   **人工智能语音生成：** 将文本转换为逼真、自然的多种语言语音，用于旁白或解释。\n*   **人工智能图像生成：** 通过文本描述创建独特的图像。\n*   **分屏视频：** 允许添加游戏画面或动画背景。\n\nMagiclip 提供分级定价方案（创作者、专家和专业人士），每个月在 AI 视频生成数量、图像积分和语音积分方面有不同的限制。 这些方案适用于不同的使用级别，从个人创作者到管理多个帐户的专业人士。 该平台还根据观看次数提供潜在收入估算，表明其关注货币化。\n\n常见问题解答部分回答了有关功能、支持的格式、使用限制、语言可用性、社交媒体优化和订阅取消的常见问题。 Magiclip 旨在通过人工智能驱动的工具简化视频内容创作，这些工具通过字幕、效果和声音增强视频，使其适用于短视频平台。"
  },
  {
    "id": "46080916",
    "title": "Molly: An Improved Signal App",
    "url": "https://molly.im/",
    "summary": "Molly is presented as an enhanced, fully open-source (FOSS) alternative to the Signal app for Android. It offers improved features with a focus on security, privacy, and customization.\n\nKey improvements include:\n\n*   **FOSS and Encrypted:** Unlike Signal, Molly is completely FOSS and encrypts the database with passphrase protection.\n*   **Multi-Device Support:** Users can pair multiple devices to a single account.\n*   **Customization:** Offers a Material You theme that adapts to the device's color palette.\n*   **Enhanced Privacy:** Integrates UnifiedPush for notifications (avoiding Google services), features automatic locking based on inactivity, and securely shreds sensitive data with RAM shredding.\n*   **Tor Support:** Allows for SOCKS proxy and Tor integration via Orbot for increased anonymity.\n\nThe article encourages users to download Molly from GitHub and provides an option to donate. It also suggests that more improvements are planned for the future.\n",
    "chinese_title": "Molly：一款改进的Signal应用",
    "chinese_summary": "Molly是一款增强型的、完全开源 (FOSS) 的安卓 Signal 应用替代品。它提供了改进的功能，专注于安全性、隐私和定制化。\n\n主要改进包括：\n\n*   **开源和加密：** 与 Signal 不同，Molly 完全开源，并使用密码保护加密数据库。\n*   **多设备支持：** 用户可以将多个设备绑定到一个账户。\n*   **定制化：** 提供 Material You 主题，可适应设备的配色方案。\n*   **增强的隐私：** 集成 UnifiedPush 进行通知（避免使用 Google 服务），具有基于非活动状态的自动锁定功能，并通过 RAM 碎片安全地粉碎敏感数据。\n*   **Tor 支持：** 允许通过 Orbot 集成 SOCKS 代理和 Tor，以提高匿名性。\n\n文章鼓励用户从 GitHub 下载 Molly，并提供捐赠选项。文章还表明，未来计划进行更多改进。"
  },
  {
    "id": "46086863",
    "title": "DMT-induced shifts in criticality correlate with self-dissolution",
    "url": "https://www.jneurosci.org/content/early/2025/10/24/JNEUROSCI.0344-25.2025",
    "summary": "This 2025 Journal of Neuroscience article, \"DMT-induced shifts in criticality correlate with self-dissolution,\" investigates how the psychedelic substance DMT affects brain dynamics and subjective experience in humans. The researchers focused on the concept of \"criticality,\" a state where brain oscillations exhibit fluctuations across various scales, thought to be important for healthy brain function.\n\nThe study found that DMT shifts brain oscillations away from criticality, specifically in the alpha and adjacent frequency bands. This shift is characterized by increased entropy (disorder) and reduced complexity in brain activity. Importantly, the degree of this criticality shift in alpha and theta bands correlated with the intensity of self-dissolution, a common feature of psychedelic experiences. Furthermore, the study indicated that the DMT-induced shift pushes brain oscillations toward a subcritical regime, meaning a state of lower excitability.\n\nIn essence, the research demonstrates that DMT alters brain dynamics, specifically moving brain oscillations away from a critical state, which is linked to the subjective experience of self-dissolution. These findings contribute to understanding the neurological mechanisms behind psychedelic-induced altered states of consciousness and the role of criticality in brain function. The study received funding from multiple organizations and includes a potential conflict of interest declaration from one author.\n",
    "chinese_title": "DMT诱导的临界性转变与自我溶解相关",
    "chinese_summary": "这篇2025年《神经科学杂志》的文章“DMT诱导的临界性转变与自我消解相关”研究了迷幻物质DMT如何影响人类的大脑动力学和主观体验。研究人员侧重于“临界性”这一概念，这是一种大脑振荡在不同尺度上表现出波动的状态，被认为对健康的大脑功能至关重要。\n\n该研究发现，DMT使大脑振荡偏离临界性，特别是在α波和相邻的频段。这种转变的特征是脑活动中的熵（无序）增加和复杂性降低。重要的是，α波和θ波频段中这种临界性转变的程度与自我消解的强度相关，自我消解是迷幻体验的一个常见特征。此外，该研究表明，DMT诱导的转变将大脑振荡推向亚临界状态，意味着较低的兴奋性状态。\n\n本质上，这项研究表明，DMT改变了大脑动力学，特别是使大脑振荡偏离临界状态，这与自我消解的主观体验有关。这些发现有助于理解迷幻剂诱导的意识改变状态背后的神经机制以及临界性在大脑功能中的作用。这项研究获得了多个组织的资助，并包含一位作者的潜在利益冲突声明。"
  },
  {
    "id": "46013269",
    "title": "The risk of round numbers and sharp thresholds in clinical practice",
    "url": "https://www.nature.com/articles/s41746-025-02079-y",
    "summary": "This article investigates how the common clinical practice of using round-number thresholds for decision-making, while simplifying, can distort risk assessments and negatively impact patient outcomes. The authors demonstrate that these thresholds can create anomalies like discontinuities and counter-causal paradoxes in mortality risk, even with advancements in medicine.\n\nThe study uses an interpretable machine learning model to identify these threshold-induced artifacts in real-world data, simulations, and longitudinal studies. It highlights that treatment decisions based on misaligned round-number thresholds can lead to excess risk due to undertreatment or overtreatment. The research showcases examples using data from pneumonia patients and the MIMIC-IV dataset, where serum creatinine and blood urea nitrogen levels reveal surprising risk patterns diverging from predicted models like APACHE II.\n\nThe authors categorize these anomalies into discontinuities (abrupt changes in risk around thresholds) and counter-causal non-monotonicities (where treatment paradoxically improves outcomes for higher-risk patients). They propose a glass-box machine learning approach to systematically identify these artifacts and suggest continuous reassessment of clinical protocols to align thresholds with the continuous nature of risk, particularly in critical care settings, to improve patient outcomes. The study emphasizes the potential for AI-driven protocols to be misled by these distorted risk profiles, underscoring the need for nuanced risk assessment methods.\n",
    "chinese_title": "临床实践中整数和锐性阈值的风险",
    "chinese_summary": "本文探讨了在临床实践中普遍存在的采用整数阈值进行决策的方法，指出这种简化方式虽然方便，但可能会扭曲风险评估，并对患者的治疗结果产生负面影响。作者证明，即使在医学进步的情况下，这些阈值也可能导致死亡风险出现不连续性和反因果悖论等异常现象。\n\n该研究使用一种可解释的机器学习模型来识别真实世界数据、模拟和纵向研究中由阈值引起的这些人为偏差。研究强调，基于错位的整数阈值做出的治疗决策可能因治疗不足或过度治疗而导致额外的风险。该研究展示了肺炎患者和MIMIC-IV数据集中的案例，其中血清肌酐和血尿素氮水平揭示了与APACHE II等预测模型不同的惊人风险模式。\n\n作者将这些异常现象分为不连续性（阈值附近风险的突然变化）和反因果非单调性（即治疗反而能改善高风险患者的治疗结果）。他们提出了一种“玻璃盒”机器学习方法，以系统地识别这些人为偏差，并建议持续重新评估临床协议，使阈值与风险的连续性相一致，尤其是在重症监护环境中，从而改善患者的治疗结果。该研究强调了人工智能驱动的协议可能会被这些扭曲的风险曲线所误导，突出了对细致风险评估方法的需求。"
  },
  {
    "id": "46086771",
    "title": "Leak confirms OpenAI is preparing ads on ChatGPT for public roll out",
    "url": "https://www.bleepingcomputer.com/news/artificial-intelligence/leak-confirms-openai-is-preparing-ads-on-chatgpt-for-public-roll-out/",
    "summary": "A leaked beta version of the ChatGPT Android app suggests OpenAI is planning to introduce ads into the platform, potentially disrupting the current web advertising model. The leak, discovered by Tibor on X, references \"ads feature,\" \"bazaar content,\" \"search ad,\" and \"search ads carousel\" within the app's code.\n\nThis move marks a shift from ChatGPT's current ad-free experience, mirroring Google's search engine model with sponsored results. The article suggests that ChatGPT's extensive user data could allow for highly personalized and effective advertising, potentially exceeding Google's capabilities. Initially, ads are expected to be limited to the search experience within ChatGPT.\n\nThe article highlights ChatGPT's impressive user growth, citing 800 million weekly users and the handling of 2.5 billion prompts daily. India is now the largest user base, surpassing the US. This significant user base provides a strong foundation for a successful advertising implementation.\n\nThe article also includes a promotional section for a \"2026 CISO Budget Benchmark\" report and links to related articles about OpenAI's future plans and product releases.\n",
    "chinese_title": "泄露证实OpenAI正准备在ChatGPT上推出广告",
    "chinese_summary": "泄露的ChatGPT安卓应用测试版暗示OpenAI计划引入广告，可能颠覆当前的网页广告模式。X用户Tibor发现，该泄露版本在代码中引用了“广告功能”、“集市内容”、“搜索广告”和“搜索广告轮播”。\n\n此举标志着ChatGPT从当前无广告体验的转变，效仿了谷歌的搜索引擎模式，引入赞助商结果。文章认为，ChatGPT庞大的用户数据能够实现高度个性化和有效的广告投放，可能超越谷歌的能力。最初，广告预计仅限于ChatGPT内部的搜索体验。\n\n文章强调了ChatGPT令人印象深刻的用户增长，引用了每周8亿用户和每天处理25亿条提示。印度现在是最大的用户群体，超过了美国。如此庞大的用户基础为成功的广告实施奠定了坚实的基础。\n\n文章还包含一个“2026年CISO预算基准”报告的推广部分，并链接到有关OpenAI未来计划和产品发布的文章。"
  },
  {
    "id": "46084122",
    "title": "A triangle whose interior angles sum to zero",
    "url": "https://www.johndcook.com/blog/2025/11/28/tricusp-triangle/",
    "summary": "This article explores how the sum of interior angles of a triangle differs from Euclidean geometry in spherical and hyperbolic geometries. In spherical geometry, the interior angles of a triangle always sum to *more* than π radians (180 degrees), with the triangle's area directly related to the excess over π. In hyperbolic geometry, the interior angles always sum to *less* than π, and the triangle's area is related to the \"defect,\" which is the difference between π and the angle sum.\n\nThe article highlights that while small triangles in both geometries approach Euclidean behavior (angle sum close to π), dramatic differences can occur with larger triangles. In hyperbolic geometry, the angle sum can approach zero. This leads to the intriguing concept of a \"triangle\" with an angle sum of 0 and an area of π. Although technically an \"improper triangle\" since its vertices lie at infinity (ideal points on the real axis) on the hyperbolic plane (defined by semicircles), the article explains that triangles with sums arbitrarily close to zero can exist within the plane. Crucially, the article notes that the specific radii of the semicircles forming this triangle don't affect its area, emphasizing the distinct properties of hyperbolic geometry. Finally, the article points out that this \"zero-angle\" triangle has an infinite perimeter but a finite area (π).\n",
    "chinese_title": "内角和为零的三角形",
    "chinese_summary": "本文探讨了球面几何和双曲几何中三角形内角和与欧几里得几何的不同之处。在球面几何中，三角形内角和总是*大于*π弧度（180度），三角形的面积与超过π的盈余直接相关。在双曲几何中，内角和总是*小于*π，三角形的面积与“亏损”有关，即π与角和之间的差值。\n\n文章强调，虽然两种几何中的小三角形都接近欧几里得几何行为（角和接近π），但较大的三角形可能出现显著差异。在双曲几何中，角和可以接近于零。这引出了一个有趣的“三角形”概念，其角和为0，面积为π。尽管从技术上讲，它是一个“不规则三角形”，因为它的顶点位于双曲平面（由半圆定义）上的无穷远处（实轴上的理想点），但文章解释说，平面内可以存在角和任意接近于零的三角形。至关重要的是，文章指出，形成该三角形的半圆的具体半径并不影响其面积，这突出了双曲几何的独特属性。最后，文章指出，这种“零角”三角形具有无限的周长，但面积有限（π）。"
  },
  {
    "id": "46079073",
    "title": "Language is primarily a tool for communication rather than thought (2024) [pdf]",
    "url": "https://gwern.net/doc/psychology/linguistics/2024-fedorenko.pdf",
    "summary": "It is impossible to summarise the article.\n\nThe provided text is a PDF file's internal code, not the actual content of an article. It includes PDF syntax, compressed data streams, and other technical elements that define the document's structure and appearance. It is not human-readable text that can be processed to understand the topic of an article.\n",
    "chinese_title": "语言主要是一种交流工具，而非思考工具 (2024) [pdf]",
    "chinese_summary": "无法总结该文章。\n\n（提供的文本是PDF文件的内部代码，而非文章的实际内容。它包含PDF语法、压缩数据流以及定义文档结构和外观的其他技术元素。它不是可供处理以理解文章主题的人类可读文本。）"
  },
  {
    "id": "46080289",
    "title": "Airloom – 3D Flight Tracker",
    "url": "https://objectiveunclear.com/airloom.html",
    "summary": "Airloom is a 3D flight tracker application that visualizes flight paths in a three-dimensional space. Upon initialization, it provides a range of features for users to explore and analyze flight data. Users can search for flights by airport, utilizing their current location or specifying a search radius. A flight/aircraft search function is also available.\n\nThe application offers customizable display settings, including trail length, line thickness, color coding by speed, and airport/city labels. Users can select different map layers, including dark themes, satellite imagery, and wireframe views. Airspace visualization is also supported, allowing users to view Class B, C, and D airspace with adjustable opacity and filtering options.\n\nData settings include adjustable update rates and filters based on callsign, aircraft type, and altitude. Recording and playback features allow users to capture flight data and replay it at various speeds. Advanced settings enable customization of altitude scale, ground elevation, fog distance, coordinate axes display, and map brightness. Furthermore, users can control their viewpoint in a \"Fly Mode\" using WASD keys and mouse for navigation. Controls for resetting the view, clearing flight trails, and adjusting automatic rotation are included, along with features for flight following, and \"Surf Mode\" (auto-switching flights based on clicks). Finally, there are sharing options to share the current view or join a mailing list for updates.\n",
    "chinese_title": "Airloom – 3D 飞行追踪器",
    "chinese_summary": "Airloom是一款3D飞行追踪应用程序，可在三维空间中可视化飞行路径。初始化后，它提供一系列功能供用户探索和分析飞行数据。用户可以通过机场搜索航班，利用当前位置或指定搜索半径。还提供航班/飞机搜索功能。\n\n该应用程序提供可自定义的显示设置，包括轨迹长度、线条粗细、按速度进行颜色编码以及机场/城市标签。用户可以选择不同的地图图层，包括深色主题、卫星图像和线框视图。还支持空域可视化，允许用户查看B、C和D类空域，并具有可调节的不透明度和过滤选项。\n\n数据设置包括可调节的更新速率和基于呼号、飞机类型和高度的过滤器。录制和回放功能允许用户捕获飞行数据并以不同速度回放。高级设置可自定义高度比例、地面高度、雾距离、坐标轴显示和地图亮度。此外，用户可以使用WASD键和鼠标在“飞行模式”中控制他们的视点进行导航。包括重置视图、清除飞行轨迹和调整自动旋转的控件，以及飞行跟随和“冲浪模式”（根据点击自动切换航班）的功能。最后，还有共享选项可以共享当前视图或加入邮件列表以获取更新。"
  },
  {
    "id": "46082204",
    "title": "The original ABC language, Python's predecessor (1991)",
    "url": "https://github.com/gvanrossum/abc-unix",
    "summary": "This document describes the original ABC programming language, a predecessor to Python, developed at CWI (Centrum Wiskunde & Informatica) from approximately 1983-1986. Guido van Rossum, Python's creator, worked on ABC during this time. The source code, downloaded from cwi.nl, has modification dates primarily from 1991, with a few from 1996 or 2021, and is also available on Luciano Ramalho's GitHub. Van Rossum hopes to compare and unify these versions.\n\nCurrently, the code assumes a 32-bit system; an upgrade to support 64-bit systems is planned. While CWI never formally licensed ABC, they retain the copyright. Van Rossum intends to negotiate a permissive license, ideally MIT, with Steven Pemberton.\n\nThe authors of ABC include Eddy Boeve, Frank van Dijk, Leo Geurts, Timo Krijnen, Lambert Meertens, Steven Pemberton, and Guido van Rossum. The document also provides references, including the \"ABC Programmer's Handbook\" and articles by Pemberton and Meertens, shedding light on the language and its influence on Python. Links to Steven Pemberton's homepage and an article by Lambert Meertens about Python's origins are also included.\n",
    "chinese_title": "ABC语言，Python的前身 (1991)",
    "chinese_summary": "本文档描述了最初的ABC编程语言，它是Python的前身，大约在1983年至1986年间由CWI（荷兰数学与计算机科学研究中心）开发。Python的创建者Guido van Rossum在此期间参与了ABC的开发。从cwi.nl下载的源代码，其修改日期主要为1991年，少数为1996年或2021年，也可在Luciano Ramalho的GitHub上找到。Van Rossum希望比较和统一这些版本。\n\n目前，该代码假定为32位系统；计划升级以支持64位系统。尽管CWI从未正式授权ABC，但他们保留版权。Van Rossum打算与Steven Pemberton协商一个宽松的许可协议，理想情况下是MIT许可。\n\nABC的作者包括Eddy Boeve、Frank van Dijk、Leo Geurts、Timo Krijnen、Lambert Meertens、Steven Pemberton和Guido van Rossum。本文档还提供了参考文献，包括《ABC程序员手册》以及Pemberton和Meertens的文章，阐明了该语言及其对Python的影响。此外，还包括Steven Pemberton的主页链接和Lambert Meertens关于Python起源的文章。"
  },
  {
    "id": "46081053",
    "title": "28M Hacker News comments as vector embedding search dataset",
    "url": "https://clickhouse.com/docs/getting-started/example-datasets/hackernews-vector-search-dataset",
    "summary": "This document describes how to use a Hacker News dataset containing 28.74 million postings and their vector embeddings for building a large-scale vector search application using ClickHouse.  The embeddings were generated using the SentenceTransformers model all-MiniLM-L6-v2. The steps involve creating a ClickHouse table to store the data, loading the data from a Parquet file in an S3 bucket, building a vector similarity index using the `vector_similarity` function, and performing approximate nearest neighbor (ANN) search using cosine distance.\n\nThe document also provides a Python script using Sentence Transformers to generate embeddings for search queries, which are then used to search the Hacker News data. It provides an example of how to run the script and shows example results.\n\nFinally, a summarization application is presented. It takes a topic as input, generates its embedding, retrieves relevant Hacker News posts/comments via vector search, and then uses LangChain and the OpenAI gpt-3.5-turbo Chat API to summarize the retrieved content. The summary is generated by passing the retrieved posts/comments as context to the Chat API. The code for the summarization application is included demonstrating a basic Generative AI use case, along with an example use case.\n",
    "chinese_title": "2800万 Hacker News 评论向量嵌入搜索数据集",
    "chinese_summary": "本文档描述了如何使用包含 2874 万篇帖子及其向量嵌入的 Hacker News 数据集，利用 ClickHouse 构建大规模向量搜索应用程序。这些嵌入是使用 SentenceTransformers 模型 all-MiniLM-L6-v2 生成的。步骤包括：创建 ClickHouse 表来存储数据，从 S3 存储桶中的 Parquet 文件加载数据，使用 `vector_similarity` 函数构建向量相似度索引，以及使用余弦距离执行近似最近邻 (ANN) 搜索。\n\n本文档还提供了一个 Python 脚本，该脚本使用 Sentence Transformers 为搜索查询生成嵌入，然后用于搜索 Hacker News 数据。它提供了一个如何运行脚本的示例，并展示了示例结果。\n\n最后，介绍了一个摘要应用程序。它以一个主题作为输入，生成其嵌入，通过向量搜索检索相关的 Hacker News 帖子/评论，然后使用 LangChain 和 OpenAI gpt-3.5-turbo Chat API 来总结检索到的内容。摘要是通过将检索到的帖子/评论作为上下文传递给 Chat API 来生成的。包含了摘要应用程序的代码，演示了一个基本的生成式 AI 用例，以及一个用例示例。"
  },
  {
    "id": "46087333",
    "title": "Users brutually reject Microsoft's \"Copilot for work\" in Edge and Windows 11",
    "url": "https://www.windowslatest.com/2025/11/28/you-heard-wrong-users-brutually-reject-microsofts-copilot-for-work-in-edge-and-windows-11/",
    "summary": "Microsoft is facing strong backlash from Windows users regarding its aggressive integration of \"Copilot for work\" AI features into Edge and Windows 11. Users are protesting the perceived forced implementation of AI, particularly \"Copilot Mode,\" which is intended to automate tasks but is seen as unwanted and unnecessary.\n\nThe article highlights user frustration expressed on social media, with many stating they never requested these AI features and actively seek ways to remove them. Criticism centers around the feeling that Microsoft is out of touch with user needs, pushing AI integration despite widespread opposition. While Microsoft responds selectively to positive feedback, it largely ignores negative comments.\n\nConcerns are also raised about the accuracy and reliability of these AI agents, with IT professionals questioning their value in professional settings. Users are skeptical of Copilot's ability to accurately perform complex tasks and point out the risk of AI \"hallucinations.\"\n\nThe article also touches on Microsoft's past attempts to integrate AI, including backlash that forced a Windows boss to lock social media replies and promise to listen to feedback. Despite this, the company continues to push for AI integration, even teasing AI agents in the Windows 11 taskbar. The piece contrasts this push with Microsoft's acknowledgment of needing to improve Windows 11's reliability and design consistency, further fueling user skepticism.\n",
    "chinese_title": "用户强烈抵制微软 Edge 和 Windows 11 中的“工作版 Copilot”",
    "chinese_summary": "微软因其在Edge和Windows 11中激进整合“工作助手”人工智能功能而面临Windows用户的强烈反对。用户抗议这种被认为是强行实施人工智能的行为，特别是“助手模式”，该模式旨在自动化任务，但被视为不受欢迎且不必要的。\n\n文章强调了用户在社交媒体上表达的沮丧情绪，许多人表示他们从未要求这些人工智能功能，并且正在积极寻找删除它们的方法。批评的焦点在于人们感觉微软脱离了用户需求，不顾广泛的反对意见而强行推进人工智能整合。虽然微软有选择性地回应积极反馈，但它在很大程度上忽略了负面评论。\n\n人们还对这些人工智能代理的准确性和可靠性提出了担忧，IT专业人士质疑它们在专业环境中的价值。用户对助手准确执行复杂任务的能力表示怀疑，并指出了人工智能“幻觉”的风险。\n\n文章还提到了微软过去整合人工智能的尝试，包括迫使一位Windows主管锁定社交媒体回复并承诺倾听反馈的强烈反对。尽管如此，该公司仍在继续推动人工智能整合，甚至在Windows 11任务栏中展示人工智能代理。文章将这种推动与微软承认需要改进Windows 11的可靠性和设计一致性形成对比，进一步加剧了用户的怀疑情绪。"
  },
  {
    "id": "46083051",
    "title": "A first look at Django's new background tasks",
    "url": "https://roam.be/notes/2025/a-first-look-at-djangos-new-background-tasks/",
    "summary": "This article introduces Django 6.0's new built-in background tasks framework, `django.tasks`. While not intended to replace established solutions like Celery, it offers a common API for task queue implementations. The core idea is to define tasks using Django's standard API, making them backend-agnostic.\n\nThe author illustrates this by creating a notification app using ntfy.sh, highlighting the process of defining a task with the `@task` decorator and enqueuing it using the `enqueue` method. A key limitation is the lack of a built-in worker; execution requires external infrastructure. Django 6.0 provides only `ImmediateBackend` and `DummyBackend` for immediate or no execution.\n\nThe article then details building a custom database-backed task backend and worker. It covers the necessary database models (`Task`, `Attempt`, `Error`) to store task information, attempts, and errors. The model design emphasizes quick task retrieval, claiming, and processing by the worker. Key features include `available_after` for task scheduling and `attempt_count` to manage retries.\n\nConfiguration options for specifying maximum attempts and backoff factors are also explained. The article further elaborates on the `QueueStore` class responsible for task retrieval and enqueueing and a `Worker` class responsible for claiming and processing tasks.\n",
    "chinese_title": "Django 新后台任务初探",
    "chinese_summary": "本文介绍了 Django 6.0 新增的内置后台任务框架 `django.tasks`。 虽然其目的不是为了取代像 Celery 这样的成熟解决方案，但它为任务队列实现提供了一个通用的 API。 核心思想是使用 Django 的标准 API 定义任务，使其与后端无关。\n\n作者通过创建一个使用 ntfy.sh 的通知应用来说明了这一点，重点介绍了使用 `@task` 装饰器定义任务以及使用 `enqueue` 方法将其加入队列的过程。 一个主要的限制是缺少内置的 worker；执行需要外部基础设施。 Django 6.0 仅提供 `ImmediateBackend` 和 `DummyBackend` 用于立即执行或不执行。\n\n文章随后详细介绍了如何构建一个自定义的、基于数据库的任务后端和 worker。 它涵盖了必要的数据库模型（`Task`、`Attempt`、`Error`）来存储任务信息、尝试次数和错误。 该模型设计强调 worker 快速检索、声明和处理任务。 主要功能包括用于任务调度的 `available_after` 和用于管理重试的 `attempt_count`。\n\n文章还解释了指定最大尝试次数和退避因子的配置选项。 进一步阐述了负责任务检索和入队的 `QueueStore` 类，以及负责声明和处理任务的 `Worker` 类。"
  },
  {
    "id": "46080143",
    "title": "True P2P Email on Top of Yggdrasil Network",
    "url": "https://github.com/JB-SelfCompany/Tyr",
    "summary": "Tyr is a peer-to-peer email system for Android that leverages the Yggdrasil network to provide a truly decentralized and private email experience. Unlike traditional email, Tyr doesn't rely on centralized mail servers, offering direct P2P connections, built-in network encryption, and automatic NAT traversal through Yggdrasil.\n\nKey features include seamless integration with DeltaChat/ArcaneChat for a P2P messaging experience, a local SMTP/IMAP server running on the device, cryptographic identity verification via Ed25519 keys, auto-start for continuous availability, and encrypted backups.\n\nTyr works by embedding a Yggmail server (written in Go) within the Android app, providing standard SMTP/IMAP protocols on localhost. It uses cryptographic keys derived from your public key as your email address, ensuring verifiable identity.\n\nSetting up Tyr involves installing the app, configuring Yggdrasil peers, and then setting up DeltaChat/ArcaneChat to connect to the local SMTP/IMAP server.\n\nSecurity features include Android Keystore encryption with AES-256-GCM, automatic keystore recovery, Yggdrasil network encryption, local-only port access, cryptographic identity, and encrypted backups.\n\nTyr aims to provide censorship-resistant, private, and decentralized email communication, placing control back in the hands of the user. The project is open-source and encourages contributions.\n",
    "chinese_title": "基于Yggdrasil网络的真P2P邮件",
    "chinese_summary": "Tyr 是一款安卓平台的点对点邮件系统，利用 Yggdrasil 网络提供真正去中心化和私密的邮件体验。与传统邮件不同，Tyr 不依赖中心化的邮件服务器，而是提供直接的 P2P 连接、内置的网络加密以及通过 Yggdrasil 实现自动 NAT 穿透。\n\n主要功能包括与 DeltaChat/ArcaneChat 的无缝集成以实现 P2P 消息体验、设备上运行的本地 SMTP/IMAP 服务器、通过 Ed25519 密钥进行加密身份验证、自动启动以保证持续可用性以及加密备份。\n\nTyr 的工作原理是在 Android 应用中嵌入一个 Yggmail 服务器（用 Go 编写），在 localhost 上提供标准的 SMTP/IMAP 协议。它使用从您的公钥派生的加密密钥作为您的电子邮件地址，从而确保可验证的身份。\n\n设置 Tyr 涉及安装应用程序、配置 Yggdrasil 对等节点，然后设置 DeltaChat/ArcaneChat 以连接到本地 SMTP/IMAP 服务器。\n\n安全功能包括使用 AES-256-GCM 的 Android Keystore 加密、自动密钥库恢复、Yggdrasil 网络加密、本地专用端口访问、加密身份以及加密备份。\n\nTyr 旨在提供抗审查、私密和去中心化的邮件通信，将控制权交还给用户。该项目是开源的，并鼓励贡献。"
  },
  {
    "id": "46085897",
    "title": "The undeserved status of the pigeon-hole principle (1991)",
    "url": "https://www.cs.utexas.edu/~EWD/transcriptions/EWD10xx/EWD1094.html",
    "summary": "This article critiques the \"pigeon-hole principle\" (PHP), arguing that its traditional formulations are overly specific and shrouded in unnecessary mystique. The author contends that the PHP's common phrasing, involving \"objects\" and \"compartments,\" is clumsy and obscures its fundamental arithmetic nature. This phrasing introduces irrelevant \"noise\" like the need to visualize \"distributing\" and \"receiving,\" and invites misleading visualizations (overstuffed vs. underoccupied compartments) that hide equivalent formulations.\n\nInstead, the author proposes a simpler and more general alternative: \"for a nonempty, finite bag of real numbers, the maximum is at least the average (and the minimum is at most the average).\" This formulation eliminates the need for metaphor, highlighting the principle's core arithmetic.\n\nThe author argues that the traditional PHP is a weaker version of this generalized principle. To demonstrate this, they present the \"Problem of the German Soccer Lotto,\" which requires the stronger, generalized form of the principle for a straightforward solution. The problem's seemingly surprising solution, achieved through the pigeon-hole principle, is attributed to a fortunate arithmetic coincidence within the problem's parameters (5 being the smallest integer >= 13/3). The author concludes that the ease of solving the problem with the PHP is a matter of luck, and problems requiring a slightly larger value are significantly more challenging. In essence, the author argues for a demystification and reformulation of the PHP, advocating for its recognition as a simple, arithmetic relationship between averages and extrema, rather than a complex and ingenious tool.\n",
    "chinese_title": "鸽巢原理的盛名之累 (1991)",
    "chinese_summary": "本文批判了“鸽巢原理”(PHP)，认为其传统表述过于具体，且笼罩着不必要的神秘感。作者认为，PHP通常使用的“物体”和“盒子”这种措辞笨拙，掩盖了其根本的算术性质。这种措辞引入了无关的“噪音”，例如需要可视化“分配”和“接收”，并诱导产生误导性的可视化（过度拥挤与未充分利用的盒子），从而掩盖了等价的表述。\n\n相反，作者提出了一个更简单、更通用的替代方案：“对于一个非空的有限实数集合，最大值至少是平均值（且最小值至多是平均值）。” 这种表述消除了对隐喻的需求，突出了该原理的核心算术本质。\n\n作者认为，传统的PHP是这一广义原理的弱化版本。为了证明这一点，他们提出了“德国足球彩票问题”，该问题需要更强大的广义原理才能得到直接的解决方案。通过鸽巢原理获得的该问题看似令人惊讶的解决方案，归因于问题参数中幸运的算术巧合（5是大于等于13/3的最小整数）。作者得出结论，用PHP轻松解决这个问题是一种运气，而需要稍大数值的问题则更具挑战性。本质上，作者主张对PHP进行去神秘化和重新表述，倡导将其视为平均值和极值之间简单的算术关系，而不是一种复杂而巧妙的工具。"
  },
  {
    "id": "46034255",
    "title": "Show HN: Mu – The Micro Network",
    "url": "https://github.com/asim/mu",
    "summary": "\"Mu: The Micro Network\" is a new project aiming to rebuild online services without the addictive algorithms, ads, and exploitative practices of Big Tech. It's a membership-based network designed to be sustainable and user-focused, offering an ad-free and algorithm-free experience. Subscribers gain access to features, support, and direct input into the platform's development.\n\nCurrently, Mu offers a basic API, a PWA, an LLM-powered chat UI, RSS news feed, YouTube search, and micro-blogging functionality. Future plans include private email, a wallet for platform credits, utilities like a QR code scanner, and a marketplace of services.\n\nThe project aims to be supported by a flat monthly subscription fee, intended to sustain development rather than upsell features. Users can try Mu for free at mu.xyz.\n\nFor developers, the project is open-source and built with Go. To run Mu locally, you need Go installed, the Mu repository cloned and installed via `go install`, and API keys for YouTube Data and Fanar (for LLM queries) set as environment variables. The application can then be launched using `mu --serve` and accessed at localhost:8081.\n",
    "chinese_title": "Show HN: Mu – 微型网络",
    "chinese_summary": "Mu：微型网络 是一个旨在重建在线服务的新项目，摆脱了大型科技公司令人上瘾的算法、广告和剥削性做法。它是一个基于会员制的网络，旨在实现可持续发展和以用户为中心，提供无广告和无算法的体验。订阅者可以获得功能、支持，并直接参与平台的开发。\n\n目前，Mu提供基本的API、PWA、LLM驱动的聊天UI、RSS新闻源、YouTube搜索和微型博客功能。未来的计划包括私人电子邮件、用于平台积分的钱包、二维码扫描仪等实用工具以及服务市场。\n\n该项目旨在通过每月固定的订阅费来支持，旨在维持开发，而不是追加销售功能。用户可以在mu.xyz免费试用Mu。\n\n对于开发者来说，该项目是开源的，并使用Go构建。要本地运行Mu，您需要安装Go，克隆Mu存储库并通过`go install`安装，并将YouTube Data和Fanar（用于LLM查询）的API密钥设置为环境变量。然后可以使用`mu --serve`启动应用程序，并通过localhost:8081访问。"
  },
  {
    "id": "46082291",
    "title": "Electron vs. Tauri",
    "url": "https://www.dolthub.com/blog/2025-11-13-electron-vs-tauri/",
    "summary": "This blog post compares Electron and Tauri, two frameworks for building desktop applications from web technologies, using the Dolt Workbench as a case study. The author highlights Electron's popularity and ease of integration with existing web projects like those using Next.js, especially with tools like Nextron. However, Electron suffers from significant bloat due to bundling a full Chromium browser engine.\n\nTauri, a newer framework, addresses the bloat issue by leveraging the system's native webview instead of bundling a browser engine. While this introduces potential compatibility concerns, the author found them to be minimal. Tauri also utilizes Rust for the main application process, which may be less accessible to web developers but offers a more natural API compared to Electron's Node.js-based approach. Electron, however, simplifies the use of sidecar processes because it ships with the Node.js runtime, while Tauri requires compiling Node.js applications as separate binaries.\n\nDespite Tauri's advantages in terms of size and API, the author is holding off on a full migration due to limitations in Windows bundle support (.appx and .msix) and issues with macOS universal binaries. The author concludes that Tauri is a promising alternative to Electron, offering a more lightweight solution that integrates well with existing codebases, but some practical issues need to be resolved first.\n",
    "chinese_title": "Electron与Tauri",
    "chinese_summary": "本文以 Dolt Workbench 为例，比较了 Electron 和 Tauri 这两个使用 Web 技术构建桌面应用程序的框架。作者强调了 Electron 的流行性及其与现有 Web 项目（例如使用 Next.js 的项目）轻松集成的特点，尤其是借助 Nextron 等工具。然而，Electron 因捆绑完整的 Chromium 浏览器引擎而存在严重的臃肿问题。\n\nTauri 是一个较新的框架，通过利用系统的原生 Webview 而不是捆绑浏览器引擎来解决臃肿问题。虽然这会引入潜在的兼容性问题，但作者发现这些问题很小。Tauri 还使用 Rust 作为主应用程序进程，这对 Web 开发人员来说可能不太容易上手，但与 Electron 基于 Node.js 的方法相比，它提供了更自然的 API。然而，Electron 简化了辅助进程的使用，因为它附带了 Node.js 运行时，而 Tauri 需要将 Node.js 应用程序编译为单独的二进制文件。\n\n尽管 Tauri 在大小和 API 方面具有优势，但由于 Windows 捆绑支持（.appx 和 .msix）的限制以及 macOS 通用二进制文件的问题，作者暂缓全面迁移。作者总结说，Tauri 是 Electron 的一个很有前途的替代方案，它提供了一种更轻量级的解决方案，可以与现有代码库很好地集成，但一些实际问题需要首先解决。"
  },
  {
    "id": "46016634",
    "title": "I mathematically proved the best \"Guess Who?\" strategy [video]",
    "url": "https://www.youtube.com/watch?v=_3RNB8eOSx0",
    "summary": "This YouTube video, titled \"I mathematically proved the best 'Guess Who?' strategy,\" likely delves into a data-driven approach to optimize the strategy for the board game \"Guess Who?\". The title suggests the creator has used mathematical principles to identify the most effective questions to ask in order to narrow down the potential characters and ultimately win the game.\n\nHowever, the \"Content\" section is simply YouTube's footer information containing links to things like copyright notices, contact information, advertising, developer resources, terms of service, privacy policy, security, how YouTube works, beta features, and NFL Sunday Ticket.\n\nTherefore, the content provided doesn't actually summarize the *video's* content. Instead, it's a boilerplate list of YouTube policies and functionalities. **Without more information, it is impossible to accurately summarize the video's mathematical analysis of the \"Guess Who?\" strategy.**\n",
    "chinese_title": "我用数学证明了“猜猜我是谁？”的最佳策略 [视频]",
    "chinese_summary": "这个YouTube视频，标题为“我用数学证明了最佳的‘猜猜我是谁？’策略”，很可能深入探讨了一种数据驱动的方法，以优化棋盘游戏“猜猜我是谁？”的策略。 该标题表明创作者使用了数学原理来确定最有效的提问方式，从而缩小潜在角色范围并最终赢得游戏。\n\n然而，“内容”部分只是YouTube的页脚信息，其中包含指向版权声明、联系信息、广告、开发者资源、服务条款、隐私政策、安全、YouTube运作方式、测试版功能和NFL Sunday Ticket等内容的链接。\n\n因此，提供的内容实际上并未总结*视频*的内容。 相反，它是YouTube政策和功能的样板列表。 **在没有更多信息的情况下，无法准确概括视频对“猜猜我是谁？”策略的数学分析。**"
  },
  {
    "id": "46079785",
    "title": "Don't tug on that, you never know what it might be attached to (2016)",
    "url": "https://blog.plover.com/2016/07/01/#tmpdir",
    "summary": "Mark Dominus recounts tracking down a frustrating bug involving Emacs, emacsclient, and the TMPDIR environment variable. His workflow using a shell script called `also`, which relies on `emacsclient` to open files in Emacs, suddenly broke with `emacsclient` failing to find the server socket.\n\nThe investigation revealed that `emacsclient` was looking for the socket in `/mnt/tmp/emacs2017/server`, while Emacs was creating it in `/tmp/emacs2017/server`. The discrepancy stemmed from the `TMPDIR` environment variable being set to `/mnt/tmp`.\n\nDominus then discovered that Emacs itself correctly recognized the `TMPDIR` variable when queried directly, leading him to suspect environment differences between Emacs and `emacsclient`. He traced the issue back to a Perl program (`git-re-edit`) used within a Git workflow, which was somehow unsetting the `TMPDIR` variable before invoking Emacs. Further investigation revealed that Perl itself was the culprit, bizarrely only for the `TMPDIR` variable.\n\nDominus implemented two workarounds: configuring Emacs to use TCP sockets instead of Unix-domain sockets and manually passing the correct socket path to `emacsclient` via a custom `EMACS_SERVER_SOCKET` environment variable.\n\nThe root cause, discovered with help from others in the Perl community, turned out to be a security measure. To prevent attacks where elevated-privilege programs are tricked into writing temporary files to unsafe locations, the dynamic loader in some Perl installations will unset TMPDIR when the program is loaded.\n",
    "chinese_title": "别拽那个，你永远不知道它连着什么 (2016)",
    "chinese_summary": "Mark Dominus 讲述了追踪一个令人沮丧的 bug 的过程，该 bug 涉及 Emacs、emacsclient 和 TMPDIR 环境变量。他使用一个名为 `also` 的 shell 脚本（依赖 `emacsclient` 在 Emacs 中打开文件）的工作流突然中断，`emacsclient` 无法找到服务器套接字。\n\n调查显示，`emacsclient` 在 `/mnt/tmp/emacs2017/server` 中寻找套接字，而 Emacs 在 `/tmp/emacs2017/server` 中创建它。差异源于 `TMPDIR` 环境变量被设置为 `/mnt/tmp`。\n\nDominus 随后发现，当直接查询时，Emacs 本身正确识别了 `TMPDIR` 变量，这使他怀疑 Emacs 和 `emacsclient` 之间的环境存在差异。他将问题追溯到一个 Git 工作流中使用的 Perl 程序 (`git-re-edit`)，该程序以某种方式在调用 Emacs 之前取消设置了 `TMPDIR` 变量。进一步调查显示，Perl 本身是罪魁祸首，奇怪的是，仅针对 `TMPDIR` 变量。\n\nDominus 实现了两个解决方法：配置 Emacs 使用 TCP 套接字而不是 Unix 域套接字，以及通过自定义的 `EMACS_SERVER_SOCKET` 环境变量手动将正确的套接字路径传递给 `emacsclient`。\n\n在 Perl 社区其他人的帮助下，发现的根本原因是安全措施。为了防止具有提升权限的程序被诱骗将临时文件写入不安全的位置，某些 Perl 安装中的动态加载器将在加载程序时取消设置 TMPDIR。"
  },
  {
    "id": "46083375",
    "title": "Fabric Project",
    "url": "https://github.com/Fabric-Project/Fabric",
    "summary": "Fabric is a creative coding environment and rapid prototyping tool built for interactive visuals, image and video processing, 3D content creation, and high-fidelity rendering using modern techniques. Inspired by Quartz Composer, it offers a visual node-based interface, SDK support for custom node creation via plugins, and the ability to load common interchange file formats.\n\nFabric aims to be both a beginner-friendly creative coding tool and a professional environment for creating reusable visual assets that can be embedded in third-party applications. It leverages the Satin 3D engine and Lygia shader library for physically based rendering, scene graph management, real-time shader editing, GPU compute, image-based lighting, 3D model loading, and material systems.\n\nKey features include authoring interactive 3D graphics, image processing and effects, audio-reactive scenes, and image/video analysis pipelines.  Fabric supports technologies like ML-based real-time segmentation and keypoint detection, shader-based image processing, and local LLM calling.\n\nCurrently under heavy development and requiring macOS 14+ and Xcode 15+, Fabric is an Apple platform-specific tool built with Swift, SwiftUI, and C++.  The creator, Anton Marini, seeks to build a community of developers reminiscent of the Quartz Composer era. The goal is to provide a user experience that aligns with his design philosophy and offers the desired level of abstraction, differentiating it from other node-based tools.\n",
    "chinese_title": "布料项目",
    "chinese_summary": "Fabric：一个用于交互式视觉效果、图像和视频处理、3D内容创作以及使用现代技术进行高保真渲染的创意编码环境和快速原型工具。受Quartz Composer启发，它提供了一个可视化的基于节点的界面、通过插件进行自定义节点创建的SDK支持，以及加载通用交换文件格式的能力。\n\nFabric旨在成为一个对初学者友好的创意编码工具，同时也是一个创建可重用视觉资源（可嵌入第三方应用程序）的专业环境。它利用Satin 3D引擎和Lygia着色器库进行基于物理的渲染、场景图管理、实时着色器编辑、GPU计算、基于图像的光照、3D模型加载和材质系统。\n\n主要功能包括创作交互式3D图形、图像处理和特效、音频响应场景以及图像/视频分析管道。 Fabric支持诸如基于ML的实时分割和关键点检测、基于着色器的图像处理以及本地LLM调用等技术。\n\n目前正在大力开发中，需要macOS 14+和Xcode 15+，Fabric是一个使用Swift、SwiftUI和C++构建的Apple平台专用工具。 创作者Anton Marini希望建立一个让人想起Quartz Composer时代的开发者社区。 目标是提供符合其设计理念的用户体验，并提供所需的抽象级别，使其与其他基于节点的工具区分开来。"
  },
  {
    "id": "46086681",
    "title": "Belgian Police exposed using botnets to manipulate EU data law impact assessment",
    "url": "https://old.reddit.com/r/europe/comments/1p9kxhm/belgian_federal_police_forgot_to_turn_their_vpn/",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "比利时警方被曝利用僵尸网络操纵欧盟数据法影响评估",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "46077136",
    "title": "The Math of Why You Can't Focus at Work",
    "url": "https://justoffbyone.com/posts/math-of-why-you-cant-focus-at-work/",
    "summary": "This article explores the math behind why it's hard to focus at work, attributing it to interruptions and recovery time. It argues that constant connectivity via Slack, Teams, and a culture of instant responsiveness have exacerbated the problem.\n\nThe author uses a mathematical model with three key parameters: λ (lambda), the interruption rate per hour; Δ (delta), the recovery time in minutes after an interruption; and θ (theta), the minimum uninterrupted time required for meaningful work. The article visualizes workdays as timelines, illustrating focus blocks (green), interruptions (red), and recovery time (gray).\n\nThe article introduces the concept of \"capacity,\" which quantifies the amount of productive work achieved based on the three parameters. It demonstrates how varying these parameters can drastically impact capacity, even with the same total focus time. Simulating 100 workdays under different conditions highlights how high interruption rates and long recovery times lead to unproductive days with short focus blocks.\n\nFinally, the article cites research on interruption frequency and recovery times in real jobs, noting that workers are often interrupted every few minutes and require significant time to regain focus. The author suggests that understanding and modeling these parameters can help individuals and organizations address the problem of focus fragmentation.\n",
    "chinese_title": "工作时无法集中注意力的数学原理",
    "chinese_summary": "工作难以集中注意力的数学原理：中断与恢复时间\n\n本文探讨了工作时难以集中注意力的数学原理，将其归因于中断和恢复时间。文章认为，通过Slack、Teams等工具进行的持续连接，以及即时响应的文化，加剧了这个问题。\n\n作者使用了一个包含三个关键参数的数学模型：λ (lambda)，每小时的中断率；Δ (delta)，中断后的恢复时间（分钟）；以及θ (theta)，进行有意义工作所需的最小不间断时间。文章将工作日可视化为时间线，用绿色表示专注时间段，红色表示中断，灰色表示恢复时间。\n\n文章引入了“产能”的概念，量化了基于这三个参数所实现的生产性工作量。它展示了即使总专注时间相同，改变这些参数也可能对产能产生巨大影响。模拟100个工作日在不同条件下的情况，突出了高中断率和长恢复时间如何导致生产力低下，专注时间段短的工作日。\n\n最后，文章引用了关于真实工作中断频率和恢复时间的研究，指出员工经常每隔几分钟就被打断一次，并且需要大量时间才能重新集中注意力。作者认为，理解和建模这些参数可以帮助个人和组织解决注意力碎片化的问题。"
  },
  {
    "id": "46004895",
    "title": "Show HN: Choose your own adventure style Presentation",
    "url": "https://github.com/Skarlso/adventure-voter",
    "summary": "Adventure Voter is an interactive presentation system that transforms traditional slideshows into \"Choose Your Own Adventure\" experiences. Presenters write their content as Markdown files with decision points. During the presentation, the audience votes on their phones via WebSockets, influencing the presentation's path in real-time.\n\nThe system consists of a Go backend for handling WebSocket connections and vote aggregation, and an Alpine.js frontend for the user interface.  Presenters have a dedicated view to control the presentation, while audience members use a separate URL (voter view) to participate.\n\nTo use Adventure Voter, you can either use Docker Compose or build from source. The presentation logic is defined in a `story.yaml` file which links together Markdown files containing content and decision points.  Decision points include a timer and a set of choices with labels and corresponding 'next' chapter IDs.\n\nThe system is designed to be deployed behind a reverse proxy (like Nginx or Traefik) and offers optional presenter authentication to prevent unauthorized control. While functional, the tool is in alpha and might contain bugs. It includes basic security features like thread-safe state management and file path sanitization but is not intended for mission-critical applications. Configuration is done via command-line flags to set the server address, content and story paths, and presenter secret.\n",
    "chinese_title": "Show HN: 自选冒险式演示",
    "chinese_summary": "冒险投票者是一个互动演示系统，它将传统幻灯片演示转变为“选择你自己的冒险”体验。演示者将他们的内容编写为带有决策点的 Markdown 文件。在演示过程中，观众通过手机上的 WebSocket 进行投票，实时影响演示的路径。\n\n该系统由用于处理 WebSocket 连接和投票聚合的 Go 后端以及用于用户界面的 Alpine.js 前端组成。演示者拥有一个专用视图来控制演示，而观众则使用单独的 URL（投票者视图）来参与。\n\n要使用冒险投票者，你可以使用 Docker Compose 或从源代码构建。演示逻辑定义在一个 `story.yaml` 文件中，该文件将包含内容和决策点的 Markdown 文件链接在一起。决策点包括计时器和一组带有标签和相应“下一章”ID 的选项。\n\n该系统被设计为部署在反向代理（如 Nginx 或 Traefik）之后，并提供可选的演示者身份验证，以防止未经授权的控制。 虽然功能齐全，但该工具目前处于 Alpha 阶段，可能包含错误。 它包括基本安全功能，如线程安全状态管理和文件路径清理，但不适用于关键任务应用程序。 通过命令行标志进行配置，以设置服务器地址、内容和故事路径以及演示者密钥。"
  },
  {
    "id": "46038868",
    "title": "How stealth addresses work in Monero",
    "url": "https://www.johndcook.com/blog/2025/11/24/monero-stealth-addresses/",
    "summary": "This article explains how Monero uses stealth addresses to ensure privacy in transactions. Alice, the restaurant owner, displays her public view key (A) and public spend key (S). When Bob wants to pay, his software generates a random number (r) and calculates R = rG. It also calculates k = H(rA), where H is a hash function. The stealth address P is then computed as P = kG + S, and Bob sends (P, R) to Alice.\n\nAlice can calculate k because she knows her private view key (a), and A = aG. She computes aR, which is equal to rA. Both Alice and Bob then hash aR (or rA) to obtain k, using the Elliptic Curve Diffie-Hellman key exchange. Alice scans the blockchain for payments to P.\n\nThe key point is that P is on the blockchain, but only Alice and Bob know k. Because only Alice knows her private spend key (s), she can derive the private key corresponding to P, which is (k + s), allowing her to spend the money. Even though Bob sent money to P, Monero's ring signatures obfuscate the sender among a group of possibilities. Essentially, stealth addresses ensure that each transaction is sent to a unique, untraceable address, enhancing privacy because only the sender and receiver can link the transaction to them. The difficulty of reversing elliptic curve multiplication prevents the determination of Alice's private view key.\n",
    "chinese_title": "门罗币中的隐形地址如何运作",
    "chinese_summary": "门罗币如何使用隐匿地址确保交易隐私\n此文阐述了门罗币如何使用隐匿地址来确保交易隐私。餐厅老板Alice展示她的公钥查看密钥（A）和公钥消费密钥（S）。当Bob想付款时，他的软件会生成一个随机数（r）并计算R = rG。它还会计算k = H(rA)，其中H是一个哈希函数。隐匿地址P随后被计算为P = kG + S，Bob将(P, R)发送给Alice。\n\nAlice可以计算k，因为她知道她的私钥查看密钥（a），且A = aG。她计算aR，这等于rA。然后Alice和Bob都对aR（或rA）进行哈希运算以获得k，使用椭圆曲线迪菲-赫尔曼密钥交换。Alice扫描区块链，查找支付给P的款项。\n\n关键点在于P在区块链上，但只有Alice和Bob知道k。因为只有Alice知道她的私钥消费密钥（s），她可以推导出对应于P的私钥，即(k + s)，从而允许她花费这笔钱。即使Bob将钱发送到P，门罗币的环签名也会混淆发送者在一组可能性中。本质上，隐匿地址确保每笔交易都发送到一个唯一、不可追踪的地址，从而增强了隐私，因为只有发送者和接收者可以将交易与他们联系起来。反向计算椭圆曲线乘法的困难性阻止了Alice的私钥查看密钥被确定。"
  },
  {
    "id": "46082223",
    "title": "How good engineers write bad code at big companies",
    "url": "https://www.seangoedecke.com/bad-code-at-big-companies/",
    "summary": "This article argues that the surprisingly bad code often found at large tech companies isn't due to incompetent engineers, but rather a systemic issue stemming from high employee turnover and frequent re-organization. This leads to engineers constantly working in unfamiliar codebases, making them effectively \"beginners\" much of the time.\n\nWhile experienced \"old hands\" exist to review code, they are often overloaded and lack formal mechanisms to retain or leverage their expertise effectively. The article suggests companies prioritize internal \"legibility\" (easy reassignment of engineers) over long-term code quality. This is a deliberate trade-off, accepting a certain level of bad code in exchange for the ability to rapidly deploy engineers to new problems.\n\nThe author differentiates between \"pure\" engineering (self-contained technical projects) and \"impure\" engineering (deadline-driven work in unfamiliar systems), arguing that big tech engineers are often forced into the latter, making mistakes inevitable.\n\nIndividual engineers have limited power to change this dynamic. Becoming an \"old hand\" can help, but even then, efforts to improve code quality can be challenging. The article concludes that while pointing out bad code is useful for fixing specific instances, the primary responsibility lies with the systemic issues that force engineers to work in unfamiliar environments.\n",
    "chinese_title": "大型公司里的优秀工程师如何编写糟糕的代码",
    "chinese_summary": "大型科技公司中令人惊讶的糟糕代码，并非源于工程师能力不足，而是高员工流动率和频繁重组所导致的系统性问题。这导致工程师经常在不熟悉的代码库中工作，使其大部分时间实际上都像“新手”。\n\n虽然有经验丰富的“老手”负责代码审查，但他们往往负担过重，并且缺乏正式机制来保留或有效利用他们的专业知识。文章认为，公司优先考虑内部“易读性”（便于重新分配工程师），而不是长期的代码质量。这是一种有意的权衡，接受一定程度的糟糕代码，以换取将工程师快速部署到新问题的能力。\n\n作者区分了“纯粹”的工程（独立的、技术性项目）和“不纯粹”的工程（在不熟悉的系统中，以截止日期为导向的工作），认为大型科技公司的工程师常常被迫从事后者，这使得犯错不可避免。\n\n个人工程师改变这种动态的力量有限。成为“老手”会有所帮助，但即使如此，改进代码质量的努力也可能充满挑战。文章总结说，指出糟糕的代码有助于修复具体问题，但主要责任在于迫使工程师在不熟悉的环境中工作的系统性问题。"
  },
  {
    "id": "46070203",
    "title": "GitLab discovers widespread NPM supply chain attack",
    "url": "https://about.gitlab.com/blog/gitlab-discovers-widespread-npm-supply-chain-attack/",
    "summary": "GitLab discovered a widespread NPM supply chain attack involving an evolved version of \"Shai-Hulud\" malware, exhibiting worm-like propagation and a destructive \"dead man's switch.\" The malware infects NPM packages, harvesting credentials from GitHub, npm, AWS, GCP, and Azure, exfiltrating data to attacker-controlled GitHub repositories, and automatically infecting other packages.\n\nThe infection process involves a multi-stage loader, initially appearing innocuous, that executes a heavily obfuscated payload, `bun_environment.js`. Stolen GitHub tokens are used to create public repositories for data exfiltration and, critically, to share access tokens between compromised systems, forming a resilient botnet. The malware propagates by injecting malicious code into victim's packages and republishing them to npm.\n\nThe \"dead man's switch\" triggers data destruction on compromised systems if access to both GitHub (exfiltration) and npm (propagation) is lost, potentially leading to widespread data loss if takedown attempts are made.\n\nGitLab recommends using Dependency Scanning and GitLab Duo Chat to detect the malware. Key indicators of compromise include the `bun_environment.js` file, `.truffler-cache/` directory, and specific commands like `shred -uvz -n 1`. GitLab's systems are monitoring for new infections, and the company shared its findings to help the community respond effectively. The attack's \"dead man's switch\" requires careful remediation strategies to avoid triggering data destruction.\n",
    "chinese_title": "GitLab 发现大规模 NPM 供应链攻击",
    "chinese_summary": "GitLab发现大规模NPM供应链攻击，涉及“沙丘蠕虫”恶意软件的进化版本，该恶意软件具有蠕虫式传播和破坏性的“死者开关”。该恶意软件感染NPM包，从GitHub、npm、AWS、GCP和Azure收集凭据，将数据泄露到攻击者控制的GitHub存储库，并自动感染其他包。\n\n感染过程涉及一个多阶段加载器，最初看似无害，但会执行一个高度混淆的有效载荷`bun_environment.js`。被盗的GitHub令牌用于创建公开存储库以进行数据泄露，并且关键的是，用于在受感染系统之间共享访问令牌，从而形成一个有弹性的僵尸网络。该恶意软件通过将恶意代码注入受害者的包并将其重新发布到npm上来传播。\n\n如果无法访问GitHub（数据泄露）和npm（传播），“死者开关”会触发受感染系统上的数据销毁，如果尝试进行删除，可能会导致大范围的数据丢失。\n\nGitLab建议使用依赖项扫描和GitLab Duo Chat来检测恶意软件。主要入侵指标包括`bun_environment.js`文件、`.truffler-cache/`目录以及特定的命令，如`shred -uvz -n 1`。GitLab的系统正在监控新的感染，该公司分享了其发现，以帮助社区有效应对。攻击的“死者开关”需要谨慎的补救策略，以避免触发数据销毁。"
  },
  {
    "id": "46080579",
    "title": "C++ Web Server on my custom hobby OS",
    "url": "https://oshub.org/projects/retros-32/posts/getting-a-webserver-running",
    "summary": "This article details the author's journey in building a web server on their custom hobby operating system, RetrOS-32. After a break, the author returned to tackle networking challenges, particularly with TCP and HTTP. Initial hurdles included a corrupted terminal buffer and incorrect handling of incoming packets by the E1000 network driver, both of which were eventually resolved.\n\nPerformance issues arose with TCP due to unhandled RST packets, which were addressed to improve stability under heavy browser refreshes. The author then developed a custom HTTP engine, leveraging a parser from a previous project (c-web-modules). This was followed by a web engine focusing on routing, enabling the definition of routes, HTTP methods, and handler functions (lambdas).\n\nThe web server implementation involved a `WebEngine` that uses an `HTTPEngine` and `FileRepository`. The `FileRepository` enables serving static files with caching. The article provides code snippets demonstrating routing and serving files from the OS file system. The author concludes by outlining future steps, including a more advanced web server UI, graceful shutdown functionality, and ultimately, building a web browser for the OS. The full source code for the project is available on Github.\n",
    "chinese_title": "在我自制的业余操作系统上的C++ Web服务器",
    "chinese_summary": "作者详述了在自制 Hobby 操作系统 RetrOS-32 上构建 Web 服务器的历程。中断一段时间后，作者重新开始解决网络难题，特别是 TCP 和 HTTP 方面的问题。最初的障碍包括终端缓冲区损坏以及 E1000 网络驱动程序对传入数据包处理不正确，这两个问题最终都得到了解决。\n\n由于未处理的 RST 数据包导致 TCP 出现性能问题，通过解决这些问题提高了在高负载浏览器刷新下的稳定性。随后，作者开发了一个自定义的 HTTP 引擎，利用了之前项目 (c-web-modules) 中的解析器。 之后开发了一个专注于路由的 Web 引擎，能够定义路由、HTTP 方法和处理函数（lambda 表达式）。\n\nWeb 服务器的实现涉及使用 `HTTPEngine` 和 `FileRepository` 的 `WebEngine`。 `FileRepository` 实现了静态文件的缓存服务。文章提供了代码片段，演示了从操作系统文件系统中进行路由和提供文件。作者最后概述了未来的步骤，包括更高级的 Web 服务器 UI、优雅的关闭功能，以及最终为操作系统构建 Web 浏览器。该项目的完整源代码可在 Github 上找到。"
  },
  {
    "id": "46080769",
    "title": "JSON Schema Demystified: Dialects, Vocabularies and Metaschemas",
    "url": "https://www.iankduncan.com/engineering/2025-11-24-json-schema-demystified/",
    "summary": "This article demystifies JSON Schema terminology by explaining the core concepts and their relationships in a clear and understandable way. It breaks down the often-confusing terms like schemas, metaschemas, dialects, and vocabularies, illustrating how they fit together to define and validate JSON data.\n\nA **schema** is a JSON document that defines constraints on other JSON documents, specifying data types, allowed values, and required properties. A **metaschema** is a schema that describes the structure of other schemas, validating that schemas are well-formed and adhere to the specification.\n\nA **dialect** is a specific version of JSON Schema, defined by a particular metaschema. Different dialects support different keywords and behaviors, identified by a URI (using the `$schema` keyword in your schemas).\n\n**Vocabularies**, introduced in Draft 2019-09, are named collections of keywords that provide specific functionality. They promote modularity, allowing you to choose and combine relevant keywords.  The article highlights the core, applicator, validation, and metadata vocabularies as key examples.\n\nThe article also emphasizes the extensibility of JSON Schema through custom vocabularies. This allows developers to define domain-specific keywords for tasks such as API descriptions.\n\nThe key takeaway is that JSON Schema is a powerful and flexible tool for data validation, built on a foundation of well-defined concepts and relationships, and enabling custom extensions. Understanding these concepts is critical for effectively using and extending JSON Schema in various applications.\n",
    "chinese_title": "JSON Schema 解密：方言、词汇表和元模式",
    "chinese_summary": "本文旨在通过清晰易懂的方式解释核心概念及其关系，从而揭开 JSON Schema 术语的神秘面纱。它分解了schemas、metaschemas、方言和词汇表等常令人困惑的术语，阐述了它们如何协同工作来定义和验证 JSON 数据。\n\n**Schema（模式）**是一个 JSON 文档，它定义了对其他 JSON 文档的约束，指定数据类型、允许的值和必需的属性。 **Metaschema（元模式）**是一种模式，用于描述其他模式的结构，验证模式是否格式良好并符合规范。\n\n**Dialect（方言）**是 JSON Schema 的特定版本，由特定的元模式定义。不同的方言支持不同的关键字和行为，通过 URI（在您的模式中使用 `$schema` 关键字）进行标识。\n\n**Vocabularies（词汇表）**，在 Draft 2019-09 中引入，是提供特定功能的命名关键字集合。它们提高了模块化，允许您选择和组合相关的关键字。本文重点介绍了核心、应用器、验证和元数据词汇表作为关键示例。\n\n本文还强调了 JSON Schema 通过自定义词汇表的可扩展性。这允许开发人员为诸如 API 描述之类的任务定义特定于领域的关键字。\n\n关键结论是，JSON Schema 是一种强大而灵活的数据验证工具，它建立在定义明确的概念和关系的基础上，并支持自定义扩展。理解这些概念对于在各种应用程序中有效使用和扩展 JSON Schema 至关重要。"
  },
  {
    "id": "46080473",
    "title": "Bringing Sexy Back. Internet surveillance has killed eroticism",
    "url": "https://lux-magazine.com/article/privacy-eroticism/",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "找回性感。互联网监控扼杀了情色。",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "46042074",
    "title": "How to get Pandoc to respect custom table styles in Word templates",
    "url": "https://johnathandos.com/posts/2025-11-24-custom-tables-with-pandoc/",
    "summary": "This article explains how to customize table styles when converting Markdown to .docx using Pandoc and a custom reference document. The key takeaway is that Pandoc specifically looks for a table style named \"Table\" in the reference document to apply to tables in the converted output.\n\nThe author initially struggled because the provided reference document lacked a table style explicitly named \"Table.\" They also overlooked the Pandoc documentation mentioning the \"Table\" style requirement and distrusted LLM-based troubleshooting, leading to a more complicated workaround involving extracting the default \"Table\" style from a fresh Word document using Style Organizer.\n\nUltimately, the author discovered the simplest solution: create a new table style in the reference document directly within Word and name it \"Table.\" Any modifications made to this \"Table\" style will then be applied by Pandoc to tables generated during the Markdown to .docx conversion. The article serves as a guide to avoid the unnecessary complexity of alternative methods by emphasizing the importance of using the \"Table\" style name for custom table formatting in Pandoc workflows.\n",
    "chinese_title": "如何在Word模板中让Pandoc识别自定义表格样式",
    "chinese_summary": "使用Pandoc自定义Markdown转.docx的表格样式\n\n本文介绍了如何在使用Pandoc和自定义参考文档将Markdown转换为.docx时自定义表格样式。关键在于，Pandoc会专门查找参考文档中名为“Table”的表格样式，并将其应用于转换输出中的表格。\n\n作者最初遇到了困难，因为提供的参考文档缺少明确命名为“Table”的表格样式。他们也忽略了Pandoc文档中提到“Table”样式的要求，并且不信任基于LLM的故障排除，导致使用样式管理器从新的Word文档中提取默认“Table”样式的更复杂变通方法。\n\n最终，作者发现了最简单的解决方案：直接在Word中的参考文档中创建一个新的表格样式，并将其命名为“Table”。对该“Table”样式所做的任何修改都将被Pandoc应用于Markdown到.docx转换期间生成的表格。本文旨在避免替代方法的不必要复杂性，强调在Pandoc工作流程中使用“Table”样式名称进行自定义表格格式设置的重要性。"
  },
  {
    "id": "46039317",
    "title": "Atuin’s New Runbook Execution Engine",
    "url": "https://blog.atuin.sh/introducing-the-new-runbook-execution-engine/",
    "summary": "Atuin Desktop has released a major architectural update, a completely redesigned runbook execution engine, addressing issues like flaky context and inconsistent execution. The new engine introduces persistent runbook state, meaning no more rebuilding or re-running blocks after closing tabs or restarting the app. Runbooks now behave predictably, with context flowing downwards only.\n\nKey improvements include:\n\n*   **Persistent Context:** Runbooks remember their state across restarts.\n*   **Reproducible Execution:** Blocks only influence blocks below them.\n*   **Templates Everywhere:** Templates can be used in variable names, context blocks, and any input field.\n*   **Self-Referential Variables:** Variables can now refer to themselves.\n*   **Two Types of Context:** Passive (automatically set) and Active (set during execution), with the latter persisting across restarts and can be cleared with a new button.\n\nThis update lays the foundation for real-time collaboration. Changes include removing global context, replacing the editor variable sync toggle with a manual update UI, and script output variables capturing only stdout.\n\nUnder the hood, the execution system has been rewritten in Rust, making it more portable and reliable. The new architecture paves the way for a CLI runner, improved serial execution, secrets management, and Markdown-based runbooks. The update is available now in v0.2.0.\n",
    "chinese_title": "Atuin 的全新 Runbook 执行引擎",
    "chinese_summary": "Atuin Desktop 发布重大架构更新，完全重新设计的 Runbook 执行引擎，解决了上下文不稳定和执行不一致等问题。新引擎引入了持久化的 Runbook 状态，这意味着关闭标签或重启应用后，无需再重建或重新运行代码块。现在，Runbook 的行为可预测，上下文仅向下流动。\n\n主要改进包括：\n\n*   **持久化上下文：** Runbook 跨重启记住其状态。\n*   **可重现的执行：** 代码块仅影响其下方的代码块。\n*   **模板无处不在：** 模板可用于变量名、上下文块和任何输入字段。\n*   **自引用变量：** 变量现在可以引用自身。\n*   **两种类型的上下文：** 被动（自动设置）和主动（执行期间设置），后者在重启后持续存在，并可使用新按钮清除。\n\n此次更新为实时协作奠定了基础。更改包括移除全局上下文，用手动更新 UI 替换编辑器变量同步切换，以及脚本输出变量仅捕获 stdout。\n\n在底层，执行系统已用 Rust 重写，使其更具可移植性和可靠性。新的架构为 CLI 运行器、改进的串行执行、密钥管理和基于 Markdown 的 Runbook 铺平了道路。该更新现已在 v0.2.0 中提供。"
  },
  {
    "id": "46082825",
    "title": "Flight disruption warning as Airbus requests modifications to 6k planes",
    "url": "https://www.bbc.com/news/live/cvg4y6g74ert",
    "summary": "Airbus has issued a warning that flight disruptions are expected due to necessary software updates on over 6,000 of its planes, primarily the A320 model. The issue stems from a vulnerability in the planes' computers to interference from intense solar radiation, potentially corrupting data and affecting the aircraft's elevation. This problem was brought to light after a JetBlue aircraft experienced a sudden altitude drop in October, believed to be caused by solar interference. The timing of the disruption coincides with a major holiday weekend in the US, impacting major A320 operators like American Airlines, Delta Air Lines, JetBlue, and United Airlines. While UK airports have seen limited disruption, several airlines worldwide have reported cancellations.\n",
    "chinese_title": "空客请求改装6千架飞机，航班中断预警",
    "chinese_summary": "空中客车警告：超过6000架飞机（主要为A320型号）因必要的软件更新预计将出现航班中断。问题源于飞机电脑容易受到强烈太阳辐射干扰的漏洞，可能导致数据损坏并影响飞机高度。此前，捷蓝航空一架飞机在10月份经历了一次突然的高度下降，据信是由太阳干扰引起的，此问题由此被曝光。此次中断的时间恰逢美国的主要假日周末，将影响美国航空、达美航空、捷蓝航空和联合航空等主要A320运营商。虽然英国机场受到的影响有限，但全球多家航空公司已报告航班取消。"
  },
  {
    "id": "46076642",
    "title": "SQLite as an Application File Format",
    "url": "https://sqlite.org/appfileformat.html",
    "summary": "生成摘要时出错",
    "chinese_title": "SQLite 作为应用程序文件格式",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46079721",
    "title": "Can Dutch universities do without Microsoft?",
    "url": "https://dub.uu.nl/en/news/can-dutch-universities-do-without-microsoft",
    "summary": "The HOP article, \"Can Dutch universities do without Microsoft?\", likely explores the ongoing debate within Dutch universities about their dependence on Microsoft software and services. The article probably discusses the challenges and potential benefits of migrating to open-source alternatives.\n\nKey points likely covered include:\n\n*   **The current situation:** Most Dutch universities heavily rely on Microsoft products like Windows, Office 365, and Azure for core operations, research, and education.\n*   **Concerns:** The article probably addresses concerns around vendor lock-in, data privacy (especially with the Cloud Act), cost, and lack of control over the software being used.\n*   **Arguments for alternatives:** The article likely highlights the advantages of open-source alternatives, such as greater security, transparency, cost savings, customization possibilities, and potential for innovation.\n*   **Migration challenges:** The piece probably discusses the hurdles involved in switching to alternatives, including compatibility issues, user training, technical expertise required, and potential disruption to existing workflows.\n*   **Examples:** The article may cite specific universities or departments that have already started experimenting with open-source solutions and the lessons learned from those experiences.\n*   **Potential solutions/strategies:** The article likely touches upon possible approaches universities can take to reduce their reliance on Microsoft, such as gradual migration, focusing on specific use cases first, investing in open-source expertise, and collaborating with other institutions.\n\nIn essence, the article likely poses the question of whether a future where Dutch universities operate independently of Microsoft's ecosystem is feasible and explores the complexities and considerations involved in such a transition.\n",
    "chinese_title": "荷兰大学能否摆脱微软？",
    "chinese_summary": "HOP文章《荷兰大学能否摆脱微软？》可能探讨了荷兰大学内部关于其对微软软件和服务依赖性的持续争论。该文章可能讨论了迁移到开源替代方案的挑战和潜在益处。\n\n可能涵盖的关键点包括：\n\n*   **现状：** 大多数荷兰大学在核心运营、研究和教育方面严重依赖微软产品，如Windows、Office 365和Azure。\n*   **担忧：** 该文章可能涉及对供应商锁定、数据隐私（特别是涉及云法案时）、成本以及对所使用软件缺乏控制的担忧。\n*   **替代方案的论据：** 该文章可能强调开源替代方案的优势，例如更高的安全性、透明度、成本节约、定制可能性以及创新潜力。\n*   **迁移挑战：** 该文章可能讨论了切换到替代方案所涉及的障碍，包括兼容性问题、用户培训、所需的技术专业知识以及对现有工作流程的潜在中断。\n*   **例子：** 该文章可能会引用已经开始试验开源解决方案的特定大学或部门，以及从这些经验中获得的教训。\n*   **潜在的解决方案/策略：** 该文章可能涉及大学可以采取的减少对微软依赖的可能方法，例如逐步迁移，首先关注特定用例，投资于开源专业知识，以及与其他机构合作。\n\n本质上，该文章可能提出了这样一个问题：荷兰大学在独立于微软生态系统的未来是否可行，并探讨了这种转型所涉及的复杂性和考量因素。"
  },
  {
    "id": "46081704",
    "title": "Effective harnesses for long-running agents",
    "url": "https://www.anthropic.com/engineering/effective-harnesses-for-long-running-agents",
    "summary": "This article addresses the challenge of building effective long-running AI agents, specifically for complex tasks like software development that require sustained effort across multiple context windows. The core problem is that agents often struggle to maintain continuity and make consistent progress because each session starts fresh, lacking memory of previous work.\n\nThe authors propose a two-part solution to enable effective work across context windows:\n\n1.  **Initializer Agent:** This agent sets up the initial environment, including an `init.sh` script for server setup, a `claude-progress.txt` file to track progress, an initial git commit, and a comprehensive feature list (in JSON format) marking all features as initially \"failing\".\n\n2.  **Coding Agent:** This agent makes incremental progress in each session, focusing on one feature at a time, and leaves the environment in a \"clean state\" suitable for merging. It starts by reading progress notes, git logs, and the feature list to understand the current state, then runs basic tests. The agent is prompted to commit its progress to git with descriptive messages and update the progress file. Browser automation tools are used for end-to-end testing and feature verification.\n\nThe solution addresses common failure modes: the agent prematurely declaring victory, leaving the environment in a buggy state, marking features as done without proper testing, and struggling to run the app.\n\nThe article suggests that while this approach demonstrates progress, questions remain about the optimal agent architecture: whether a general-purpose agent or specialized agents (testing, QA, code cleanup) are more effective. Furthermore, generalizing the solution beyond web app development to other fields like scientific research or financial modeling is a direction for future work.\n",
    "chinese_title": "长期运行代理的有效工具",
    "chinese_summary": "本文探讨了构建高效长期运行AI代理的挑战，特别是对于软件开发等需要在多个上下文窗口中持续努力的复杂任务。核心问题在于，代理通常难以保持连续性并取得持续进展，因为每个会话都是从头开始，缺乏对先前工作的记忆。\n\n作者提出了一个由两部分组成的解决方案，以实现跨上下文窗口的有效工作：\n\n1.  **初始化代理（Initializer Agent）：** 此代理设置初始环境，包括用于服务器设置的 `init.sh` 脚本，用于跟踪进度的 `claude-progress.txt` 文件，初始git提交，以及将所有功能最初标记为“失败”的全面功能列表（JSON格式）。\n\n2.  **编码代理（Coding Agent）：** 此代理在每个会话中逐步取得进展，一次专注于一个功能，并将环境保持在适合合并的“干净状态”。它首先读取进度注释、git日志和功能列表，以了解当前状态，然后运行基本测试。提示该代理将进度提交到git，并附带描述性消息，以及更新进度文件。浏览器自动化工具用于端到端测试和功能验证。\n\n该解决方案解决了常见的故障模式：代理过早地宣布胜利，将环境置于错误状态，在没有适当测试的情况下将功能标记为已完成，以及难以运行应用程序。\n\n文章表明，虽然这种方法展示了进展，但关于最佳代理架构的问题仍然存在：通用代理还是专用代理（测试、QA、代码清理）更有效。此外，将解决方案从Web应用程序开发推广到科学研究或金融建模等其他领域是未来工作的方向。"
  },
  {
    "id": "46088241",
    "title": "Copenhagenize Index 2025: The Global Ranking of Bicycle-Friendly Cities",
    "url": "https://copenhagenizeindex.eu/",
    "summary": "The Copenhagenize Index 2025, EIT Urban Mobility Edition, ranks 100 cities worldwide based on their bicycle-friendliness. This holistic ranking identifies the top 30 cities, highlighting global leaders in cycling infrastructure and culture.\n\nThe index also provides regional rankings, showcasing leading cities in North America (Montréal), Latin America (Niteroi), Europe (Utrecht), Africa (Quelimane), and Asia & Oceania (Christchurch). Notably, Utrecht, Copenhagen, and Ghent top the overall list.\n\nThe document lists the top 30 cities with their corresponding ranking and index score. This allows for a comparison of cities based on factors contributing to bike-friendliness.\n\nThe information provided states that the data collected via form submission will be utilized solely for addressing inquiries and subsequent follow-ups, adhering to the outlined privacy policy.\n\nThe document also spotlights \"Success Stories,\" detailing positive transformations resulting from bike-friendly initiatives in cities like Bryant Avenue and Nairobi, as well as traffic education programs in Brno. Contact information is provided for further inquiries.\n",
    "chinese_title": "哥本哈根指数2025：全球自行车友好城市排名",
    "chinese_summary": "哥本哈根化指数2025，EIT城市交通版：对全球100座城市的自行车友好度进行排名。这项综合排名评选出前30名城市，着重展示自行车基础设施和文化领域的全球领导者。\n\n该指数还提供区域排名，展示北美（蒙特利尔）、拉丁美洲（尼泰罗伊）、欧洲（乌得勒支）、非洲（奎利马内）以及亚洲和大洋洲（基督城）的领先城市。值得注意的是，乌得勒支、哥本哈根和根特名列总榜单前茅。\n\n该文件列出了前30名城市及其相应的排名和指数得分，从而可以根据促进自行车友好度的因素对城市进行比较。\n\n提供的信息声明，通过表格提交收集的数据将仅用于处理询问和后续跟进，并遵守概述的隐私政策。\n\n该文件还重点介绍了“成功案例”，详细介绍了布莱恩特大道和内罗毕等城市因自行车友好倡议而产生的积极转变，以及布尔诺的交通教育计划。联系方式已提供，以供进一步查询。"
  },
  {
    "id": "46075882",
    "title": "Show HN: Glasses to detect smart-glasses that have cameras",
    "url": "https://github.com/NullPxl/banrays",
    "summary": "This \"Show HN\" post details an experiment to create glasses (\"Ban-Rays\") that detect smart glasses with hidden cameras, specifically targeting Meta Raybans. The project explores two main detection methods: optics and networking.\n\nThe optical approach leverages the retro-reflectivity (cat-eye effect) of camera lenses by shining IR light and detecting the reflected signal. The author initially struggled to differentiate camera reflections from other surfaces using simple IR sweeps and a photodiode, finding inconsistencies in the signal strength. They are experimenting with structured sweep patterns and different wavelengths to improve differentiation.\n\nThe networking approach focuses on Bluetooth Low Energy (BLE) fingerprinting. The author successfully detects Meta Raybans by identifying their manufacturer data (Meta's SIG-assigned ID 0x01AB) and service UUID (0xFD5F) during pairing or power-on. However, detecting them during active use (when communicating with a paired phone) is proving difficult, requiring more advanced BLE traffic analysis. The author is exploring using an nRF module to address this and acknowledges the challenges of using Bluetooth Classic due to hardware costs. The author references relevant research papers and thanks collaborators for their input.\n",
    "chinese_title": "显示 HN：检测带有摄像头的智能眼镜的眼镜",
    "chinese_summary": "此篇“Show HN”帖子详细介绍了一项实验，旨在制作一种眼镜（“Ban-Rays”）来检测带有隐藏摄像头的智能眼镜，特别是针对Meta Rayban。该项目探索了两种主要的检测方法：光学和网络。\n\n光学方法利用相机镜头的逆反射性（猫眼效应），通过照射红外光并检测反射信号来实现。作者最初难以区分相机反射与其他表面的反射，使用简单的红外扫描和光电二极管时，信号强度不一致。他们正在尝试结构化的扫描模式和不同的波长来提高区分度。\n\n网络方法侧重于蓝牙低功耗（BLE）指纹识别。作者成功地通过识别配对或开机期间的制造商数据（Meta的SIG分配ID 0x01AB）和服务UUID（0xFD5F）来检测Meta Rayban。然而，在活跃使用期间（与配对手机通信时）检测它们被证明很困难，需要更高级的BLE流量分析。作者正在探索使用nRF模块来解决这个问题，并承认由于硬件成本的原因，使用经典蓝牙具有挑战性。作者引用了相关的研究论文，并感谢合作者的投入。"
  },
  {
    "id": "46035298",
    "title": "Comments on \"Glauert's optimum rotor disk revisited\"",
    "url": "https://wes.copernicus.org/preprints/wes-2025-105/",
    "summary": "This document details a public discussion surrounding J. Gordon Leishman's comment on the Wind Energy Science paper, \"Glauert's optimum rotor disk revisited\" by Tyagi and Schmitz (2025). Leishman's comment critiques the paper's practical relevance, physical realizability, and novelty, raising concerns about the high and low tip-speed ratio limits and the application of momentum theory.\n\nLeishman argues the paper presents a fundamental contradiction in the high tip-speed ratio limit, where vanishing swirl implies zero torque and power, and criticizes the use of momentum theory in the low tip-speed ratio limit where the assumptions break down. He also questions the novelty of the calculus of variations approach.\n\nThe replies consist of responses from an anonymous reviewer (RC1 & RC2), the author of the comment (AC1 & AC4), and the Editor-in-Chief of Wind Energy Science (CEC1). The reviewer argues that Leishman's critique is largely based on subjective opinions regarding the paper's practicality. Leishman, in turn, accuses the reviewer (believing it to be an editor) of defending the publication decision rather than providing an impartial scientific review. He maintains that his identified issues are factual and verifiable, not just opinions.\n\nThe Editor-in-Chief clarifies that the reviewers were independent experts and that different editors handled the comment's review than the original paper. An editorial note addressing certain aspects of the Tyagi and Schmitz paper has also been published. The discussion highlights a disagreement on the interpretation and value of the original paper, with Leishman suggesting that it contains errors and misrepresentations.\n",
    "chinese_title": "对“Glauert最佳旋翼盘重访”的评论",
    "chinese_summary": "本文详细阐述了围绕J. Gordon Leishman对Tyagi和Schmitz (2025)发表在《风能科学》上的论文“Glauert最佳转子盘再探”的评论所展开的公开讨论。Leishman的评论批判了该论文的实际相关性、物理可实现性和新颖性，并对高低叶尖速比限制以及动量理论的应用提出了质疑。\n\nLeishman认为该论文在高叶尖速比限制下存在根本性矛盾，即消失的旋涡意味着零扭矩和功率，并批评了在低叶尖速比限制下动量理论的使用，因为此时其假设已经失效。他还质疑了变分法的新颖性。\n\n回复包括匿名审稿人（RC1和RC2）、评论作者（AC1和AC4）以及《风能科学》主编（CEC1）的回复。审稿人认为Leishman的批评主要基于对该论文实用性的主观意见。Leishman则指责审稿人（认为他是编辑）是在为发表决定辩护，而不是提供公正的科学评论。他坚持认为，他指出的问题是事实且可验证的，而不仅仅是意见。\n\n主编澄清说，审稿人是独立的专家，并且处理该评论审查的编辑与原始论文不同。此外，还发表了一篇社论，涉及Tyagi和Schmitz论文的某些方面。此次讨论突显了对原始论文的解释和价值的争议，Leishman认为该论文包含错误和不实之处。"
  },
  {
    "id": "46079868",
    "title": "Credit report shows Meta keeping $27B off its books through advanced geometry",
    "url": "https://stohl.substack.com/p/exclusive-credit-report-shows-meta",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "信用报告显示Meta通过高级几何技术将270亿美元隐藏在账外",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "46078770",
    "title": "Petition to formally recognize open source work as civic service in Germany",
    "url": "https://www.openpetition.de/petition/online/anerkennung-von-open-source-arbeit-als-ehrenamt-in-deutschland#petition-main",
    "summary": "This article is about a petition in Germany advocating for the formal recognition of open-source work as civic service (\"Ehrenamt\" - often translated as voluntary work or honorary office). The main argument is that open-source contributions significantly benefit society, similar to traditional volunteer activities, and should be recognized accordingly.\n\nThe petition appears to stem from a desire for open-source developers to be treated equally with those engaged in traditional volunteer work, such as working in clubs and associations. Benefits associated with civic service recognition can include tax advantages, access to specific resources, or formal acknowledgement of the contribution.\n\nThe articles indicate a growing movement within the open-source community to gain this formal recognition, highlighting the societal value of their work and seeking parity with other forms of civic engagement. The numerous news articles covering the topic suggest significant public interest and potential support for the petition.\n",
    "chinese_title": "正式请愿：在德国正式承认开源工作为公民服务",
    "chinese_summary": "德国一项请愿旨在正式承认开源工作为公民服务（“Ehrenamt” - 常译为志愿工作或荣誉职务）。主要论点是开源贡献与传统志愿活动一样，对社会具有显著益处，应得到相应认可。\n\n该请愿似乎源于开源开发者希望与从事传统志愿工作（如在俱乐部和协会工作）的人们获得同等待遇的愿望。与公民服务认可相关的福利可能包括税收优惠、获得特定资源或对贡献的正式认可。\n\n这些文章表明，开源社区内部正在兴起一场争取这种正式认可的运动，突显了其工作的社会价值，并寻求与其他形式的公民参与的同等地位。报道该主题的大量新闻文章表明公众对此有浓厚的兴趣和潜在的支持。"
  },
  {
    "id": "46012803",
    "title": "Moss: a Rust Linux-compatible kernel in 26,000 lines of code",
    "url": "https://github.com/hexagonal-sun/moss",
    "summary": "Moss is a Linux-compatible kernel written in Rust and Aarch64 assembly, aiming for a modern, asynchronous core and modular architecture. It features binary compatibility with Linux userspace applications, currently capable of running most BusyBox commands. A key feature is its use of Rust's async/await model within the kernel to prevent deadlocks.\n\nThe kernel boasts features like full aarch64 support with a HAL for easy porting, full MMU enablement, Copy-on-Write pages, safe userspace interaction, and a buddy allocator for memory management. Process management includes scheduling, task migration, and implementation of 51 Linux syscalls.\n\nMoss utilizes a Virtual File System with async abstractions and includes drivers for Ramdisk, read-only FAT32, and devtmpfs. Built on libkernel, an architecture-agnostic utility library, the project offers a comprehensive test suite that allows testing logic on a host machine before deployment.\n\nThe document outlines instructions for building and running Moss using QEMU, including commands for preparing the image and running the kernel and test suite.\n\nThe project roadmap focuses on expanding Linux syscall compatibility, implementing a networking stack (TCP/IP), improving the scheduler for task load balancing, developing a read/write capable filesystem, and extending the number of supported syscalls. Contributions are encouraged, and the project is licensed under the MIT License.\n",
    "chinese_title": "Moss：一个用26000行代码编写的Rust Linux兼容内核",
    "chinese_summary": "Moss：一个用 Rust 和 Aarch64 汇编编写的 Linux 兼容内核，旨在实现现代化的异步核心和模块化架构。它与 Linux 用户空间应用程序二进制兼容，目前能够运行大多数 BusyBox 命令。其关键特性是在内核中使用 Rust 的 async/await 模型来防止死锁。\n\n该内核拥有诸如完整 aarch64 支持（带有便于移植的 HAL）、完整 MMU 启用、写时复制页、安全用户空间交互以及用于内存管理的伙伴分配器等特性。进程管理包括调度、任务迁移以及 51 个 Linux 系统调用的实现。\n\nMoss 利用带有异步抽象的虚拟文件系统，并包含 Ramdisk、只读 FAT32 和 devtmpfs 的驱动程序。该项目构建在 libkernel（一个与架构无关的实用程序库）之上，提供了一个全面的测试套件，可以在部署之前在主机上测试逻辑。\n\n本文档概述了使用 QEMU 构建和运行 Moss 的说明，包括准备镜像以及运行内核和测试套件的命令。\n\n该项目路线图侧重于扩展 Linux 系统调用兼容性、实现网络堆栈 (TCP/IP)、改进调度器以实现任务负载均衡、开发可读/写文件系统以及扩展支持的系统调用数量。鼓励贡献，该项目已获得 MIT 许可证。"
  },
  {
    "id": "46085344",
    "title": "The 'S&P 493' reveals a different U.S. economy",
    "url": "https://www.msn.com/en-us/money/markets/the-s-p-493-reveals-a-very-different-us-economy/ar-AA1R1VUJ",
    "summary": "This MSN article, titled \"The 'S&P 493' reveals a different U.S. economy,\" likely argues that looking beyond the S&P 500's leading companies (the \"S&P 493\" after removing the dominant \"Magnificent Seven\" or similar group of high-performing tech companies) paints a different, and potentially less optimistic, picture of the U.S. economy.\n\nThe core argument would be that the S&P 500's overall strong performance is being disproportionately driven by a small number of mega-cap tech stocks. This concentration masks the struggles or underperformance of a much larger group of companies that represent a more diverse cross-section of the American economy. These other companies are likely facing challenges like inflation, rising interest rates, supply chain issues, and shifting consumer demand.\n\nThe article likely highlights the divergence between the booming profits of these few tech giants and the more muted or negative growth experienced by the majority of companies in the S&P 500. It probably suggests that this divergence is a cause for concern, potentially indicating vulnerabilities in the broader economy that are being obscured by the performance of a select few.\n\nThe article might also suggest caution about relying solely on the S&P 500 as an indicator of overall economic health and advocate for a more nuanced understanding of the various sectors and company sizes contributing to the U.S. economy. Furthermore, it could explore the potential implications for investors who may be overly exposed to these high-flying tech stocks and missing opportunities or risks in other market segments.\n",
    "chinese_title": "“标普493”揭示了不同的美国经济",
    "chinese_summary": "这篇题为《“标普493”揭示不同的美国经济》的MSN文章，可能认为，如果将标普500指数中领先的公司（在剔除占主导地位的“七巨头”或类似的高绩效科技公司群体后，被称为“标普493”）排除在外，就能看到一幅不同的，且可能不那么乐观的美国经济图景。\n\n其核心论点可能是，标普500指数的整体强劲表现，是由少数几家超大型科技股不成比例地推动的。这种集中掩盖了更大一部分公司的困境或表现不佳，而这些公司代表了美国经济更为多样化的横截面。这些其他公司可能正面临着通货膨胀、利率上升、供应链问题以及消费者需求变化等挑战。\n\n这篇文章可能突出了少数科技巨头蓬勃发展的利润与标普500指数中大多数公司所经历的较为温和或负增长之间的差异。它可能暗示这种差异令人担忧，可能表明更广泛的经济存在脆弱性，而这种脆弱性正被少数公司的优异表现所掩盖。\n\n这篇文章可能还建议，不要仅仅依赖标普500指数作为衡量整体经济健康的指标，并倡导对构成美国经济的各个行业和公司规模有更细致的了解。此外，它还可以探讨对投资者的潜在影响，这些投资者可能过度暴露于这些高科技股票，并错失了其他市场领域的机遇或风险。"
  },
  {
    "id": "46075320",
    "title": "Pocketbase – open-source realtime back end in 1 file",
    "url": "https://pocketbase.io/",
    "summary": "This article introduces PocketBase, an open-source, real-time backend bundled into a single executable file. Key takeaways are:\n\n*   **Simplicity:** PocketBase aims for simplicity by offering a complete backend solution in a single file, making deployment and management easier.\n\n*   **Real-time Capabilities:** It provides real-time functionality, allowing applications to react instantly to data changes.\n\n*   **Open Source:** Being open-source, users have the freedom to inspect, modify, and distribute the code.\n\n*   **Resources:** The article provides links to a live demo and the official documentation, encouraging users to explore PocketBase's capabilities and learn more about its features.\n\nIn essence, PocketBase offers a streamlined, open-source alternative for developers seeking a quick and easy-to-deploy backend solution with real-time capabilities. The provided resources invite users to experiment with the software and delve into its documentation for comprehensive understanding and usage.\n",
    "chinese_title": "Pocketbase – 单文件开源实时后端",
    "chinese_summary": "本文介绍 PocketBase，一个打包成单个可执行文件的开源、实时后端。主要内容包括：\n\n*   **简洁性：** PocketBase 旨在通过在单个文件中提供完整的后端解决方案来实现简洁性，从而简化部署和管理。\n\n*   **实时功能：** 它提供实时功能，使应用程序能够立即对数据更改做出反应。\n\n*   **开源：** 作为开源软件，用户可以自由地检查、修改和分发代码。\n\n*   **资源：** 本文提供了实时演示和官方文档的链接，鼓励用户探索 PocketBase 的功能并了解更多关于其特性的信息。\n\n本质上，PocketBase 为寻求快速、易于部署且具有实时功能的后端解决方案的开发人员提供了一个简化的开源替代方案。提供的资源邀请用户尝试该软件并深入研究其文档，以获得全面的理解和使用。"
  },
  {
    "id": "46077106",
    "title": "A Repository with 44 Years of Unix Evolution",
    "url": "https://www.spinellis.gr/pubs/conf/2015-MSR-Unix-History/html/Spi15c.html",
    "summary": "生成摘要时出错",
    "chinese_title": "A Repository with 44 Years of Unix Evolution",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46080737",
    "title": "Show HN: An LLM-Powered Tool to Catch PCB Schematic Mistakes",
    "url": "https://netlist.io/",
    "summary": "生成摘要时出错",
    "chinese_title": "Show HN: An LLM-Powered Tool to Catch PCB Schematic Mistakes",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46077964",
    "title": "A Tale of Four Fuzzers",
    "url": "https://tigerbeetle.com/blog/2025-11-28-tale-of-four-fuzzers/",
    "summary": "生成摘要时出错",
    "chinese_title": "A Tale of Four Fuzzers",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46081443",
    "title": "Show HN: Pulse 2.0 – Live co-listening rooms where anyone can be a DJ",
    "url": "https://473999.net/pulse",
    "summary": "生成摘要时出错",
    "chinese_title": "Show HN: Pulse 2.0 – Live co-listening rooms where anyone can be a DJ",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46075628",
    "title": "Tiger Style: Coding philosophy (2024)",
    "url": "https://tigerstyle.dev/",
    "summary": "生成摘要时出错",
    "chinese_title": "Tiger Style: Coding philosophy (2024)",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46085593",
    "title": "KDE going all-in on a Wayland future",
    "url": "https://blogs.kde.org/2025/11/26/going-all-in-on-a-wayland-future/",
    "summary": "生成摘要时出错",
    "chinese_title": "KDE going all-in on a Wayland future",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46075746",
    "title": "How to use Linux vsock for fast VM communication",
    "url": "https://popovicu.com/posts/how-to-use-linux-vsock-for-fast-vm-communication/",
    "summary": "生成摘要时出错",
    "chinese_title": "How to use Linux vsock for fast VM communication",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46087616",
    "title": "Datacenters in space are a terrible, horrible, no good idea",
    "url": "https://taranis.ie/datacenters-in-space-are-a-terrible-horrible-no-good-idea/",
    "summary": "生成摘要时出错",
    "chinese_title": "Datacenters in space are a terrible, horrible, no good idea",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46053017",
    "title": "Space: 1999 – Special Effects Techniques",
    "url": "https://catacombs.space1999.net/main/pguide/upsfx.html",
    "summary": "生成摘要时出错",
    "chinese_title": "Space: 1999 – Special Effects Techniques",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46020561",
    "title": "How to make precise sheet metal parts (photochemical machining) [video]",
    "url": "https://www.youtube.com/watch?v=bR9EN3kUlfg",
    "summary": "生成摘要时出错",
    "chinese_title": "How to make precise sheet metal parts (photochemical machining) [video]",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46033386",
    "title": "Open (Apache 2.0) TTS model for streaming conversational audio in realtime",
    "url": "https://github.com/nari-labs/dia2",
    "summary": "生成摘要时出错",
    "chinese_title": "Open (Apache 2.0) TTS model for streaming conversational audio in realtime",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46038684",
    "title": "Implementing Bluetooth LE Audio and Auracast on Linux Systems",
    "url": "https://www.collabora.com/news-and-blog/blog/2025/11/24/implementing-bluetooth-le-audio-and-auracast-on-linux-systems/",
    "summary": "生成摘要时出错",
    "chinese_title": "Implementing Bluetooth LE Audio and Auracast on Linux Systems",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46080218",
    "title": "Lobsters Interview",
    "url": "https://susam.net/my-lobsters-interview.html",
    "summary": "生成摘要时出错",
    "chinese_title": "Lobsters Interview",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46078566",
    "title": "Writing Builds Resilience in Everyday Challenges by Changing Your Brain",
    "url": "https://scienceclock.com/writing-builds-resilience-in-everyday-challenges-by-changing-your-brain/",
    "summary": "生成摘要时出错",
    "chinese_title": "Writing Builds Resilience in Everyday Challenges by Changing Your Brain",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46077038",
    "title": "Tech Titans Amass Multimillion-Dollar War Chests to Fight AI Regulation",
    "url": "https://www.wsj.com/tech/ai/tech-titans-amass-multimillion-dollar-war-chests-to-fight-ai-regulation-88c600e1",
    "summary": "生成摘要时出错",
    "chinese_title": "Tech Titans Amass Multimillion-Dollar War Chests to Fight AI Regulation",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46078138",
    "title": "A Remarkable Assertion from A16Z",
    "url": "https://nealstephenson.substack.com/p/a-remarkable-assertion-from-a16z",
    "summary": "生成摘要时出错",
    "chinese_title": "A Remarkable Assertion from A16Z",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46028649",
    "title": "Generalizing Printf in C",
    "url": "https://webb.is-a.dev/articles/generalizedprintf/",
    "summary": "生成摘要时出错",
    "chinese_title": "Generalizing Printf in C",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46080972",
    "title": "Rock Paper Scissors Solitaire",
    "url": "https://klezlab.it/rock-paper-scissors-solitaire.html",
    "summary": "生成摘要时出错",
    "chinese_title": "Rock Paper Scissors Solitaire",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46057488",
    "title": "Voyager 1 is about to reach one light-day from Earth",
    "url": "https://scienceclock.com/voyager-1-is-about-to-reach-one-light-day-from-earth/",
    "summary": "生成摘要时出错",
    "chinese_title": "Voyager 1 is about to reach one light-day from Earth",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46032371",
    "title": "AltSendme: Another Alternative to MAgic Wormhole?",
    "url": "https://github.com/tonyantony300/alt-sendme",
    "summary": "生成摘要时出错",
    "chinese_title": "AltSendme: Another Alternative to MAgic Wormhole?",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46087101",
    "title": "A brief history of NSA backdoors. (2013)",
    "url": "https://www.ethanheilman.com/x/12/index.html",
    "summary": "生成摘要时出错",
    "chinese_title": "A brief history of NSA backdoors. (2013)",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46086620",
    "title": "The GitHub Infrastructure Powering North Korea's Contagious Interview NPM Attack",
    "url": "https://socket.dev/blog/north-korea-contagious-interview-npm-attacks",
    "summary": "生成摘要时出错",
    "chinese_title": "The GitHub Infrastructure Powering North Korea's Contagious Interview NPM Attack",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46080597",
    "title": "Anti-patterns while working with LLMs",
    "url": "https://instavm.io/blog/llm-anti-patterns",
    "summary": "生成摘要时出错",
    "chinese_title": "Anti-patterns while working with LLMs",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46085276",
    "title": "The Great Downzoning",
    "url": "https://worksinprogress.co/issue/the-great-downzoning/",
    "summary": "生成摘要时出错",
    "chinese_title": "The Great Downzoning",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46075219",
    "title": "Shor's algorithm: the one quantum algo that ends RSA/ECC tomorrow",
    "url": "https://blog.ellipticc.com/posts/what-is-shors-algorithm-and-why-its-the-single-biggest-threat-to-classical-cryptography/",
    "summary": "生成摘要时出错",
    "chinese_title": "Shor's algorithm: the one quantum algo that ends RSA/ECC tomorrow",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46079605",
    "title": "Open-Source n8n Alternative for Workflow Building (GUI and Docker Included)",
    "url": "https://github.com/empowerd-cms/nyno",
    "summary": "生成摘要时出错",
    "chinese_title": "Open-Source n8n Alternative for Workflow Building (GUI and Docker Included)",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46070668",
    "title": "Same-day upstream Linux support for Snapdragon 8 Elite Gen 5",
    "url": "https://www.qualcomm.com/developer/blog/2025/10/same-day-snapdragon-8-elite-gen-5-upstream-linux-support",
    "summary": "生成摘要时出错",
    "chinese_title": "Same-day upstream Linux support for Snapdragon 8 Elite Gen 5",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46066522",
    "title": "Mixpanel Security Breach",
    "url": "https://mixpanel.com/blog/sms-security-incident/",
    "summary": "生成摘要时出错",
    "chinese_title": "Mixpanel Security Breach",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46073817",
    "title": "A programmer-friendly I/O abstraction over io_uring and kqueue (2022)",
    "url": "https://tigerbeetle.com/blog/2022-11-23-a-friendly-abstraction-over-iouring-and-kqueue/",
    "summary": "生成摘要时出错",
    "chinese_title": "A programmer-friendly I/O abstraction over io_uring and kqueue (2022)",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46035819",
    "title": "Maxduino Review: Tape Cassette Emulator for Multiple Retro Computers",
    "url": "https://retrogamecoders.com/maxduino-review/",
    "summary": "生成摘要时出错",
    "chinese_title": "Maxduino Review: Tape Cassette Emulator for Multiple Retro Computers",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46064757",
    "title": "Penpot: The Open-Source Figma",
    "url": "https://github.com/penpot/penpot",
    "summary": "生成摘要时出错",
    "chinese_title": "Penpot: The Open-Source Figma",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46087397",
    "title": "How to Never Get Overstimulated Again",
    "url": "https://substack.com/home/post/p-177511410",
    "summary": "生成摘要时出错",
    "chinese_title": "How to Never Get Overstimulated Again",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46082210",
    "title": "Airbus grounds A320 aircraft amid solar radiation risk",
    "url": "https://aerospaceglobalnews.com/news/a320-grounding-radiation/",
    "summary": "生成摘要时出错",
    "chinese_title": "Airbus grounds A320 aircraft amid solar radiation risk",
    "chinese_summary": "生成摘要时出错"
  }
]