[
  {
    "id": "45324349",
    "title": "Sj.h: A tiny little JSON parsing library in ~150 lines of C99",
    "url": "https://github.com/rxi/sj.h",
    "summary": "This article introduces `sj.h`, a minimalist JSON parsing library written in approximately 150 lines of C99 code. It boasts zero memory allocations, making it suitable for resource-constrained environments. The library provides error messages that pinpoint the exact location (line and column) of errors within the JSON text.\n\nKey design choices emphasize flexibility: `sj.h` avoids built-in number and string parsing. Developers are expected to handle number conversion using functions like `strtod` or `atoi`, allowing for customized behavior. Similarly, string handling, including Unicode surrogate pair processing, is left to the user's implementation.\n\nThe provided code example demonstrates how to use `sj.h` to parse a JSON string representing a rectangle and populate a corresponding `Rect` struct in C. The example iterates through the JSON object, extracts values associated with keys like \"x\", \"y\", \"w\", and \"h,\" and converts these values to integers using `atoi`.\n\nThe library is released under a public domain license, encouraging widespread adoption and modification. Further usage examples can be found in the \"demo\" folder.\n",
    "chinese_title": "Sj.h: 一个用约150行C99代码编写的微型JSON解析库",
    "chinese_summary": "本文介绍 `sj.h`，这是一个极简的 JSON 解析库，用大约 150 行 C99 代码编写。它拥有零内存分配的特性，使其适用于资源受限的环境。该库提供的错误信息能精确定位 JSON 文本中错误的准确位置（行和列）。\n\n关键的设计选择强调灵活性：`sj.h` 避免了内置的数字和字符串解析。开发者需要使用诸如 `strtod` 或 `atoi` 的函数来处理数字转换，从而允许自定义行为。类似地，字符串处理，包括 Unicode 代理对处理，留给用户自行实现。\n\n提供的代码示例演示了如何使用 `sj.h` 解析表示矩形的 JSON 字符串，并在 C 中填充相应的 `Rect` 结构体。该示例遍历 JSON 对象，提取与 \"x\"、\"y\"、\"w\" 和 \"h\" 等键关联的值，并使用 `atoi` 将这些值转换为整数。\n\n该库以公共领域许可发布，鼓励广泛采用和修改。\"demo\" 文件夹中可以找到更多使用示例。"
  },
  {
    "id": "45324365",
    "title": "The link between trauma, drug use, and our search to feel better",
    "url": "https://lithub.com/the-link-between-trauma-drug-use-and-our-search-to-feel-better/",
    "summary": "Based solely on the title provided (\"The link between trauma, drug use, and our search to feel better\") and the accompanying content of a Lit Hub page displaying popular posts and articles, it's impossible to provide a summary of the article's content itself. The provided text is metadata surrounding an article, not the article's substance.\n\nHowever, we can *infer* what the article *might* be about based on its title:\n\nThe article likely explores the connection between traumatic experiences and the subsequent use of drugs as a coping mechanism. It probably delves into the idea that individuals who have experienced trauma may turn to drugs as a way to alleviate pain, numb emotions, or escape from difficult memories. The article likely touches upon the underlying human desire to feel better, suggesting that drug use, while ultimately harmful, stems from a natural instinct to seek relief from suffering. It could also discuss the neurobiological and psychological mechanisms that contribute to this link, potentially referencing studies or theories on addiction and trauma. Ultimately, the article would likely aim to shed light on the complex relationship between trauma, drug use, and the human quest for well-being.\n\nTo get a real summary, you would need to provide the actual content of the article.\n",
    "chinese_title": "创伤、药物滥用与寻求慰藉之间的关联",
    "chinese_summary": "仅凭提供的标题（“创伤、药物使用以及我们寻求感觉更好的联系”）以及Lit Hub页面上展示的热门文章和帖子的附带内容，不可能提供文章内容的摘要。所提供的文本是围绕文章的元数据，而不是文章的实质内容。\n\n然而，我们可以*推断*文章*可能*是关于什么的，基于其标题：\n\n文章可能探讨了创伤经历与随后使用药物作为应对机制之间的联系。它可能深入探讨了经历过创伤的个体可能会转向药物，以此来减轻痛苦、麻木情绪或逃避痛苦记忆的观点。文章可能触及了人类渴望感觉更好的潜在愿望，表明药物使用，虽然最终是有害的，但源于寻求摆脱痛苦的自然本能。它也可能讨论导致这种联系的神经生物学和心理机制，可能参考有关成瘾和创伤的研究或理论。最终，文章可能旨在阐明创伤、药物使用和人类对幸福的追求之间复杂的关系。\n\n要获得真正的摘要，你需要提供文章的实际内容。"
  },
  {
    "id": "45323207",
    "title": "DXGI debugging: Microsoft put me on a list",
    "url": "https://slugcat.systems/post/25-09-21-dxgi-debugging-microsoft-put-me-on-a-list/",
    "summary": "Luna chronicles their debugging journey to get Space Station 14 (SS14) running on Windows ARM64. The game was crashing on ARM64, but not on x64, hindering launcher builds for both architectures.\n\nInitial debugging with WinDbg was frustrating due to issues with symbol loading and ARM64EC emulation confusion. After resolving these issues, the crash was traced to `USER32!GetDC`, a fundamental Windows function. Digging deeper, the culprit was identified as `DXGI!My_GetDC`, a Microsoft detour in DirectX Graphics Infrastructure (DXGI).\n\nThe detour was part of \"Optimizations for windowed games\" in Windows 11, which forces flip model (a modern DirectX swapchain effect) on older games using the less efficient bitblt model. This optimization was breaking SS14 on ARM64.\n\nThe unexpected twist was that this behavior only occurred when the executable was named \"SS14.Loader.exe.\" It turns out Microsoft has a list of games for which these optimizations are enabled, and SS14 happened to be on that list. It seems this scenario was missed in testing, as there aren't many ARM64 Windows games using the bitblt swapchain model.\n\nFurthermore, the article touches upon issues with OpenGL on Windows ARM64, where the default \"OpenGL on D3D12\" driver has graphical glitches for SS14, necessitating the use of ANGLE (a compatibility layer translating OpenGL to DirectX). This is a temporary workaround and should eventually be fixed.\n\nDue to these issues, official Windows ARM64 support for SS14 is postponed until either the OpenGL on D3D12 driver is fixed, or the ARM64 DXGI detours problem is addressed.\n",
    "chinese_title": "DXGI调试：微软把我列入黑名单了",
    "chinese_summary": "Luna记录了他们调试Space Station 14 (SS14)在Windows ARM64上运行的历程。该游戏在ARM64上崩溃，但在x64上没有，这阻碍了两种架构的启动器构建。\n\n使用WinDbg进行初始调试令人沮丧，因为存在符号加载问题和ARM64EC模拟混淆。解决这些问题后，崩溃被追溯到`USER32!GetDC`，这是一个基本的Windows函数。深入挖掘后，罪魁祸首被确定为`DXGI!My_GetDC`，它是DirectX图形基础结构（DXGI）中的Microsoft绕行。\n\n该绕行是Windows 11中“窗口化游戏优化”的一部分，它对使用效率较低的位块传输模型的旧游戏强制使用翻转模型（一种现代DirectX交换链效果）。这种优化破坏了ARM64上的SS14。\n\n意想不到的转折是，这种行为仅在可执行文件命名为“SS14.Loader.exe”时才会发生。事实证明，Microsoft有一个启用这些优化的游戏列表，而SS14恰好在该列表上。似乎在测试中遗漏了这种情况，因为没有太多使用位块传输交换链模型的ARM64 Windows游戏。\n\n此外，文章还提到了Windows ARM64上的OpenGL问题，默认的“D3D12上的OpenGL”驱动程序对SS14有图形故障，因此需要使用ANGLE（一个将OpenGL转换为DirectX的兼容性层）。这是一种临时解决方案，最终应该修复。\n\n由于这些问题，SS14的官方Windows ARM64支持被推迟，直到D3D12上的OpenGL驱动程序得到修复，或者ARM64 DXGI绕行问题得到解决。"
  },
  {
    "id": "45323793",
    "title": "The University of Oxford has fallen out of the top three universities in the UK",
    "url": "https://hotminute.co.uk/2025/09/19/oxford-loses-top-3-university-ranking-for-the-first-time/",
    "summary": "In a significant shift in UK university rankings, the University of Oxford has fallen out of the top three for the first time, according to The Times and The Sunday Times Good University Guide 2026. Durham University has surpassed both Oxford and Cambridge, securing the third-place spot. Oxford and Cambridge are now tied for fourth place, a result of their comparatively lower performance in the National Student Survey.\n\nThe London School of Economics and Political Science (LSE) remains the top-ranked university in the UK for the second consecutive year, followed by the University of St Andrews, also holding its second-place position. While St Andrews excels in student experience and teaching quality, LSE leads in graduate prospects and research quality.\n\nDurham University's rise is attributed to a substantial 30-place improvement in student evaluations of teaching quality. Professor Karen O’Brien, Durham's Vice-Chancellor, highlighted the university's commitment to student growth and the impressive career prospects of its graduates. The article includes a table listing the top 20 universities in the UK according to The Times University Rankings 2026.\n",
    "chinese_title": "牛津大学跌出英国前三名大学之列。",
    "chinese_summary": "根据《泰晤士报》和《星期日泰晤士报》2026年优秀大学指南，英国大学排名出现重大变化，牛津大学首次跌出前三。杜伦大学超越牛津大学和剑桥大学，位居第三。牛津大学和剑桥大学并列第四，原因是他们在全国学生调查中的表现相对较差。\n\n伦敦政治经济学院（LSE）连续第二年蝉联英国排名第一的大学，其次是圣安德鲁斯大学，也保持了第二名的位置。虽然圣安德鲁斯大学在学生体验和教学质量方面表现出色，但伦敦政治经济学院在毕业生前景和研究质量方面领先。\n\n杜伦大学的崛起归功于学生对教学质量的评价大幅提升了30位。杜伦大学校长凯伦·奥布莱恩教授强调了大学对学生成长和毕业生令人印象深刻的职业前景的承诺。文章包含一份表格，列出了根据《泰晤士报》2026年大学排名得出的英国前20名大学。"
  },
  {
    "id": "45323856",
    "title": "LaLiga's Anti-Piracy Crackdown Triggers Widespread Internet Disruptions in Spain",
    "url": "https://reclaimthenet.org/laligas-anti-piracy-crackdown-triggers-widespread-internet-disruptions",
    "summary": "**Summary:**\n\nLaLiga, the organizing body of Spain's top football league, has implemented an anti-piracy system intended to block illegal streaming websites. This system, however, has reportedly caused widespread internet disruptions for legitimate users across Spain. The system works by identifying and blocking domains suspected of hosting pirated content.\n\nThe article alleges that LaLiga's blocking efforts have been overzealous, resulting in the disruption of access to legitimate websites and services unrelated to piracy. This \"collateral damage\" has affected internet users attempting to access various online resources, causing frustration and raising concerns about the proportionality and effectiveness of LaLiga's approach.\n\nCritics argue that the broad-stroke blocking method lacks precision and fails to distinguish between legitimate and infringing content. They also raise questions about the transparency and accountability of the system, as well as the potential for abuse. The article highlights concerns that this anti-piracy crackdown sets a dangerous precedent for censorship and internet control, where private entities can unilaterally disrupt internet access without sufficient oversight or due process. The situation has sparked debate about the balance between protecting intellectual property and preserving internet freedom, raising concerns about the potential for similar measures to be implemented elsewhere.\n",
    "chinese_title": "西甲反盗版行动引发西班牙大范围网络中断",
    "chinese_summary": "**摘要：**\n\n西甲联赛组织方实施了一项旨在屏蔽非法流媒体网站的反盗版系统。据报道，该系统已导致西班牙各地合法用户遭遇大范围网络中断。该系统通过识别和屏蔽涉嫌托管盗版内容的域名来运作。\n\n文章声称，西甲联赛的屏蔽措施过于激进，导致与盗版无关的合法网站和服务也受到影响。这种“附带损害”影响了试图访问各种在线资源的互联网用户，引起了不满，并引发了对西甲联赛措施的比例性和有效性的担忧。\n\n批评人士认为，这种一刀切的屏蔽方法缺乏精确性，无法区分合法内容和侵权内容。他们还对该系统的透明度和问责制以及潜在的滥用行为提出了质疑。文章强调，这次反盗版行动为审查和互联网控制开创了一个危险的先例，即私人实体可以在没有充分监督或正当程序的情况下单方面中断互联网访问。这种情况引发了关于保护知识产权和维护互联网自由之间平衡的辩论，并引发了对在其他地方实施类似措施的可能性的担忧。"
  },
  {
    "id": "45322819",
    "title": "I forced myself to spend a week in Instagram instead of Xcode",
    "url": "https://www.pixelpusher.club/p/i-forced-myself-to-spend-a-week-in",
    "summary": "Daniel Hour chronicles his week-long experiment of focusing solely on Instagram marketing for his Lagree Buddy app, foregoing coding and feature development. Initially uncomfortable with prioritizing social media over code, he documented his daily efforts, highlighting the challenges and unexpected successes.\n\nHe created daily Instagram story arcs, reached out to studios and trainers via cold DMs, and even attended a class taught by Sebastian Lagree himself to showcase the app. Daniel underestimated the time and effort required for content creation, finding it far more demanding than he anticipated.\n\nDespite not seeing immediate quantifiable results in app sales, the week yielded meaningful connections. He secured a potential collaboration with Lagreeing at Home and gained the attention of Sebastian Lagree, opportunities that coding alone couldn't have achieved. He also received a positive response from a studio owner who remembered his earlier Reddit post.\n\nDaniel concluded that while content creation is significantly more time-consuming than he expected, marketing efforts like cold DMs and in-person interactions are crucial for building awareness and relationships, supplementing the core development work. He emphasized the importance of actively promoting his app, rather than relying solely on its features to attract users.\n",
    "chinese_title": "我强迫自己花一周时间刷Instagram，而不是写代码。",
    "chinese_summary": "丹尼尔·豪尔记录了他为期一周的实验，期间他完全专注于Instagram营销来推广他的Lagree Buddy应用程序，放弃了编码和功能开发。起初，他对于优先考虑社交媒体而不是代码感到不适，但他记录了他的每日努力，突出了挑战和意想不到的成功。\n\n他创建了每日Instagram故事线，通过陌生私信联系工作室和教练，甚至参加了由塞巴斯蒂安·拉格雷本人教授的课程来展示该应用程序。丹尼尔低估了内容创作所需的时间和精力，发现它比他预期的更耗费精力。\n\n尽管在应用程序销售额方面没有看到立竿见影的量化结果，但这一周产生了有意义的联系。他与Lagreeing at Home达成了潜在的合作，并获得了塞巴斯蒂安·拉格雷的关注，这些机会是仅靠编码无法实现的。他还收到了工作室老板的积极回应，这位老板记得他之前在Reddit上发布的帖子。\n\n丹尼尔总结说，虽然内容创作比他预期的耗时得多，但像陌生私信和面对面互动这样的营销活动对于建立知名度和关系至关重要，可以补充核心开发工作。他强调了积极推广他的应用程序的重要性，而不是仅仅依靠其功能来吸引用户。"
  },
  {
    "id": "45322623",
    "title": "Disk Utility still can't check and repair APFS volumes and containers (2021)",
    "url": "https://eclecticlight.co/2021/11/19/disk-utility-still-cant-check-and-repair-apfs-volumes-and-containers/",
    "summary": "This article discusses the persistent issue of Disk Utility failing to check and repair APFS volumes and containers in macOS, specifically highlighting problems observed in Monterey 12.0.1. The core problem lies in Disk Utility's inability to unmount volumes or containers, preventing the `fsck_apfs` tool from running correctly. The author notes this bug has been present since Catalina and Big Sur.\n\nWhile Disk Utility's First Aid often fails, the author offers several workarounds. The primary suggestion is to bypass Disk Utility altogether and use the command-line tool `fsck_apfs` directly. The process involves:\n\n1.  Identifying the device name of the APFS container or volume in Disk Utility or Terminal.\n2.  Using Disk Utility's Unmount tool to unmount the volume or container.\n3.  Executing `fsck_apfs` in Terminal with appropriate options like `-n` (check only), `-y` (repair automatically), `-S` (exclude snapshots). The author provides examples of different commands.\n4.  Remounting the volume or container using Disk Utility's Mount tool.\n\nAlternatively, booting into Recovery mode allows Disk Utility to function correctly as it avoids the unmounting issues.\n\nThe article also mentions that while Apple recommends checking volumes within a container before checking the container itself, this duplicates checks. The author expresses frustration with the persistence of this bug and the irony of Disk Utility failing to back up a Time Machine backup volume.\n",
    "chinese_title": "磁盘工具仍无法检查和修复APFS卷和容器 (2021)",
    "chinese_summary": "本文探讨了macOS中磁盘工具在检查和修复APFS宗卷和容器时持续存在的问题，特别强调了在Monterey 12.0.1中观察到的问题。核心问题在于磁盘工具无法卸载宗卷或容器，从而阻止`fsck_apfs`工具正确运行。作者指出，此错误自Catalina和Big Sur以来一直存在。\n\n虽然磁盘工具的急救功能经常失效，但作者提供了几种解决方法。主要建议是完全绕过磁盘工具，直接使用命令行工具`fsck_apfs`。该过程包括：\n\n1. 在磁盘工具或终端中识别APFS容器或宗卷的设备名称。\n2. 使用磁盘工具的卸载工具卸载宗卷或容器。\n3. 在终端中执行`fsck_apfs`，并使用适当的选项，例如`-n`（仅检查）、`-y`（自动修复）、`-S`（排除快照）。作者提供了不同命令的示例。\n4. 使用磁盘工具的挂载工具重新挂载宗卷或容器。\n\n或者，启动到恢复模式允许磁盘工具正常工作，因为它避免了卸载问题。\n\n文章还提到，虽然Apple建议在检查容器本身之前检查容器内的宗卷，但这会重复检查。作者对这个错误的持续存在以及磁盘工具无法备份Time Machine备份宗卷的讽刺意味表示沮丧。"
  },
  {
    "id": "45323027",
    "title": "The Beginner's Textbook for Homomorphic Encryption",
    "url": "https://arxiv.org/abs/2503.05136",
    "summary": "This arXiv article, titled \"The Beginner's Textbook for Fully Homomorphic Encryption,\" introduces Fully Homomorphic Encryption (FHE), a cryptographic scheme enabling computations directly on encrypted data. The result of decrypting the computation matches the result obtained from applying the same computation to the plaintext data.\n\nThe textbook explains that FHE supports basic operations like addition and multiplication, allowing for the construction of more complex functions, including subtraction, division, logic gates, and advanced mathematical functions like ReLU, sigmoid, and trigonometric functions. These functions can be exact or approximated.\n\nA key application of FHE is privacy-preserving machine learning, where servers can process encrypted client data without learning the plaintext data or the inference results. FHE also finds applications in confidential blockchain services, secure data analytics outsourcing, encrypted database queries, privacy-preserving searches, and secure multi-party computation.\n\nThe textbook is an open project, inviting collaboration from FHE experts. The article provides the submission history, author information (Ronny Ko), subject categories (Cryptography and Security, Discrete Mathematics), and links to the PDF, TeX source, and other resources. It also provides links to various bibliographic, citation, code, data, media, demo and related papers resources.\n",
    "chinese_title": "同态加密入门教材",
    "chinese_summary": "这篇arXiv文章，题为“全同态加密入门教程”，介绍了全同态加密(FHE)，一种允许直接在加密数据上进行计算的密码学方案。解密计算结果与将相同计算应用于明文数据所得到的结果一致。\n\n该教程解释说，FHE支持加法和乘法等基本运算，从而可以构建更复杂的功能，包括减法、除法、逻辑门以及ReLU、sigmoid和三角函数等高级数学函数。这些函数可以是精确的或近似的。\n\nFHE的一个关键应用是保护隐私的机器学习，服务器可以在不了解明文数据或推理结果的情况下处理加密的客户端数据。FHE还应用于机密区块链服务、安全数据分析外包、加密数据库查询、保护隐私的搜索以及安全多方计算。\n\n该教程是一个开放项目，欢迎FHE专家合作。 该文章提供了提交历史、作者信息（Ronny Ko）、学科分类（密码学和安全、离散数学）以及指向PDF、TeX源代码和其他资源的链接。它还提供了指向各种书目、引文、代码、数据、媒体、演示和相关论文资源的链接。"
  },
  {
    "id": "45319876",
    "title": "Spectral Labs releases SGS-1: the first generative model for structured CAD",
    "url": "https://www.spectrallabs.ai/research/SGS-1",
    "summary": "Spectral Labs has announced SGS-1, a new foundation model capable of generating fully manufacturable and parametric 3D geometry in STEP format. Unlike existing generative models, SGS-1 produces accurate and editable CAD B-Rep parts from images or \"dumb\" 3D meshes.\n\nSGS-1 demonstrates strong general performance, creating more complex CAD shapes than current methods. It can be used in real-world engineering tasks, such as designing brackets for assemblies, and performs well when given partial assembly context and text descriptions.\n\nThe article compares SGS-1 to OpenAI's GPT-5 and the open-source HoLa model, using a benchmark set of 75 images. SGS-1 outperforms both models, demonstrating superior spatial understanding and geometric accuracy. While GPT-5 struggled to produce usable outputs, SGS-1 accurately captured geometric features and integrated seamlessly into assembly contexts with editable dimensions.\n\nSGS-1 also automates the conversion of sketches, engineering drawings, and STL files into parametric STEP files, streamlining reverse engineering.\n\nThe model's limitations include difficulties with creative assets, organic shapes, thin structures, and full assembly generation. Future models will address these limitations, support more complex spatial context, and incorporate advanced physical reasoning through reinforcement learning and physical simulation feedback. Spectral Labs encourages those interested in deploying SGS-1, collaborating on research, or joining their team to get in touch.\n",
    "chinese_title": "Spectral Labs 发布 SGS-1：首个结构化 CAD 生成模型",
    "chinese_summary": "Spectral Labs发布SGS-1，一款能够生成完全可制造和参数化STEP格式3D几何体的新型基础模型。与现有生成模型不同，SGS-1可从图像或“哑”3D网格生成精确且可编辑的CAD B-Rep零件。\n\nSGS-1表现出强大的通用性能，创造比当前方法更复杂的CAD形状。它可用于实际工程任务，例如设计装配支架，并且在给定部分装配上下文和文本描述时表现良好。\n\n文章将SGS-1与OpenAI的GPT-5和开源HoLa模型进行了比较，使用了包含75张图像的基准数据集。SGS-1的性能优于这两个模型，展示了卓越的空间理解能力和几何精度。虽然GPT-5难以生成可用的输出，但SGS-1准确地捕捉了几何特征，并无缝集成到具有可编辑尺寸的装配上下文中。\n\nSGS-1还可以自动将草图、工程图和STL文件转换为参数化STEP文件，从而简化逆向工程。\n\n该模型的局限性包括难以处理创意资产、有机形状、薄结构和完整装配体的生成。未来的模型将解决这些局限性，支持更复杂的空间背景，并通过强化学习和物理模拟反馈来整合高级物理推理。Spectral Labs欢迎那些有兴趣部署SGS-1、合作研究或加入其团队的人员联系。"
  },
  {
    "id": "45323187",
    "title": "New thermoelectric cooling breakthrough nearly doubles efficiency",
    "url": "https://www.sciencedaily.com/releases/2025/09/250919085242.htm",
    "summary": "Johns Hopkins APL researchers have developed a new thermoelectric cooling technology, CHESS, that nearly doubles the efficiency of traditional materials at room temperature. This solid-state refrigeration technology uses nano-engineered materials and offers a scalable and more efficient alternative to compressor-based cooling systems.\n\nThe CHESS thin-film technology, initially developed for national security, demonstrated a near 100% improvement in efficiency over traditional thermoelectric materials in standardized tests. This translated to a 75% efficiency gain at the device level and a 70% improvement in a fully integrated refrigeration system.\n\nA key advantage of CHESS is its scalability. The technology uses a small amount of material and can be mass-produced using semiconductor chip production tools. It utilizes a metal-organic chemical vapor deposition (MOCVD) process, already used for solar cells and LEDs.\n\nBeyond refrigeration, CHESS materials can convert temperature differences into usable power, opening doors for applications in energy harvesting, prosthetics, and human-machine interfaces. APL is partnering with organizations to further refine the materials, aiming to match the efficiency of conventional mechanical systems and explore applications in larger refrigeration systems and HVAC equipment. They are also investigating integrating AI to optimize energy efficiency.\n",
    "chinese_title": "热电制冷新突破，效率近翻倍",
    "chinese_summary": "约翰·霍普金斯APL研究人员开发出新型热电冷却技术CHESS，在室温下效率几乎是传统材料的两倍。这种固态制冷技术采用纳米工程材料，为基于压缩机的冷却系统提供了一种可扩展且更高效的替代方案。\n\n最初为国家安全而开发的CHESS薄膜技术，在标准化测试中表现出比传统热电材料近100%的效率提升。这转化为设备层面效率提高75%，以及完全集成的制冷系统中效率提高70%。\n\nCHESS的一个关键优势是其可扩展性。该技术使用少量材料，并可使用半导体芯片生产工具进行大规模生产。它采用金属有机化学气相沉积(MOCVD)工艺，该工艺已用于太阳能电池和LED的生产。\n\n除了制冷之外，CHESS材料还可以将温差转化为可用电力，为能量收集、假肢和人机界面等应用打开了大门。APL正在与各组织合作，进一步改进这些材料，目标是达到传统机械系统的效率水平，并探索在大型制冷系统和HVAC设备中的应用。他们还在研究整合人工智能以优化能源效率。"
  },
  {
    "id": "45319690",
    "title": "iFixit iPhone Air teardown",
    "url": "https://www.ifixit.com/News/113171/iphone-air-teardown",
    "summary": "iFixit's teardown of the iPhone Air reveals that its slim design doesn't compromise repairability, earning it a provisional 7 out of 10 score. Apple achieved this by cleverly rearranging internal components, primarily by placing the logic board above the battery, creating a \"flat disassembly tree\" and easier access to key parts.\n\nThe battery is readily accessible through the back glass due to Apple's dual entry design, uses electrically debonding adhesive for safe removal, and surprisingly, is the same cell used in Apple's MagSafe battery pack. While the battery life might be shorter than other iPhones, the swap process is straightforward. The USB-C port is also modular, though Apple doesn't currently offer in-house repairs or replacement parts. The port's housing utilizes a unique 3D-printed titanium process, which iFixit examined under a microscope.\n\nThe phone's structural integrity is supported by a titanium frame, however, it is vulnerable at the plastic antenna passthroughs, as demonstrated in a bend test. Overall, iFixit praises Apple's design choices for prioritizing repairability in the slim form factor, highlighting the ease of battery replacement, accessible components, and commitment to repair manuals. They conclude that the iPhone Air is a successful example of how good engineering can create durable and repairable thin devices, although they're waiting on parts availability confirmation from Apple to make their score final.\n",
    "chinese_title": "iFixit iPhone Air 拆解",
    "chinese_summary": "iFixit拆解iPhone Air：纤薄设计未损可修复性，暂评7分（满分10分）。苹果通过巧妙地重新排列内部组件，特别是将逻辑板置于电池上方，实现了这一目标，创造了“扁平化的拆解树”，更容易接触到关键部件。\n\n由于苹果的双入口设计，电池可以通过后玻璃轻松访问，使用电解脱胶粘合剂进行安全移除，并且令人惊讶的是，它与Apple MagSafe电池包中使用的电池芯相同。虽然电池续航时间可能比其他iPhone短，但更换过程很简单。USB-C端口也是模块化的，尽管苹果目前不提供内部维修或更换部件。该端口的壳体采用了独特的3D打印钛工艺，iFixit在显微镜下对其进行了检查。\n\n手机的结构完整性由钛金属框架支撑，但在塑料天线过孔处较为脆弱，这在弯曲测试中得到了证实。总的来说，iFixit赞扬了苹果在纤薄外形中优先考虑可修复性的设计选择，强调了电池更换的简易性、易于访问的组件以及对维修手册的承诺。他们总结说，iPhone Air是卓越工程如何创造耐用且可修复的纤薄设备的成功典范，尽管他们仍在等待苹果确认零件的可用性，以便最终确定评分。"
  },
  {
    "id": "45319062",
    "title": "AI was supposed to help juniors shine. why does it mostly make seniors stronger?",
    "url": "https://elma.dev/notes/ai-makes-seniors-stronger/",
    "summary": "This article examines the discrepancy between the initial expectation that AI would empower junior developers and the reality where it primarily benefits senior developers. The author argues that while AI excels at tasks like generating boilerplate, automating routines, and rapid prototyping, its shortcomings in code review, prompt quality, architectural design, code quality, and security make it more useful in the hands of experienced developers.\n\nSeniors benefit from AI's ability to speed up routine tasks and ship features quickly because they possess the foundational knowledge and critical thinking skills to effectively leverage these capabilities and mitigate potential risks. Juniors, lacking this experience, are more likely to encounter issues with AI-generated code, leading to bugs, technical debt, and security vulnerabilities.\n\nThe author suggests focusing AI on areas like fast prototyping, automating repetitive tasks, multi-disciplinary work (filling knowledge gaps), and function tests, emphasizing the need for human oversight and validation. The piece concludes that current AI capabilities, while promising for the future, are not yet mature enough to democratize coding and instead amplify the expertise of senior developers. The author advocates for resetting expectations around AI in software development to avoid unrealistic burdens on junior developers and maintain code quality.\n",
    "chinese_title": "人工智能本应帮助新人脱颖而出，为何大多时候却让资深人士更强？",
    "chinese_summary": "本文探讨了人工智能赋能初级开发者的最初期望与人工智能主要使高级开发者受益的现实之间的差距。作者认为，尽管人工智能擅长生成样板代码、自动化例程和快速原型设计等任务，但其在代码审查、提示词质量、架构设计、代码质量和安全性方面的不足使其更有利于经验丰富的开发者。\n\n高级开发者受益于人工智能加速日常任务和快速交付功能的能力，因为他们具备有效利用这些能力并减轻潜在风险的基础知识和批判性思维能力。缺乏经验的初级开发者更容易遇到人工智能生成的代码问题，导致错误、技术债务和安全漏洞。\n\n作者建议将人工智能的重点放在快速原型设计、自动化重复性任务、跨学科工作（填补知识空白）和功能测试等领域，并强调需要人工监督和验证。文章总结说，目前的人工智能能力虽然对未来充满希望，但尚未成熟到足以实现编码民主化，反而放大了高级开发者的专业知识。作者提倡重置对软件开发中人工智能的期望，以避免对初级开发者造成不切实际的负担并保持代码质量。"
  },
  {
    "id": "45295538",
    "title": "A coin flip by any other name (2023)",
    "url": "https://cgad.ski/blog/a-coin-flip-by-any-other-name.html",
    "summary": "This article explores the probability of two seemingly unrelated problems both resulting in a 1/2 chance: a path remaining after random edge removal in a specific graph and the origin lying within the convex hull of four random points on a unit circle. The author argues that these even odds suggest underlying symmetries at play.\n\nFor the graph problem, a \"duality\" trick is introduced, demonstrating that a path exists between top and bottom nodes if and only if no path exists between left and right. Since the configurations are symmetrical, each event (path or no path) occurs with probability 1/2.\n\nFor the four-point problem, a measure-preserving transformation is defined, taking ((a,b),(c,d)) to (normal(a,b),normal(-c,-d)), where 'normal' returns orthogonal unit vectors. This transformation preserves probability and swaps the event of the origin being inside the convex hull with the event of it not being inside, again leading to a 1/2 probability.\n\nThe article then generalizes the problem to *k* points in *n*-dimensional space, connecting it to the problem of dividing space using hyperplanes. It provides a combinatorial formula to calculate the probability of the origin being within the convex hull of *k* random vectors in R^n, assuming the distribution of vectors is invariant under sign negation. This probability is linked to the sum of *k*-1 independent Bernoulli variables. Finally, the article frames the problem in terms of hemispheres covering the unit sphere, highlighting the counter-intuitive nature of when random points are likely to contain the origin in different dimensions.\n",
    "chinese_title": "换个说法的抛硬币 (2023)",
    "chinese_summary": "本文探讨了两个看似无关的问题都导致1/2概率的可能性：特定图中随机移除边后路径仍然存在，以及原点位于单位圆上四个随机点的凸包内。作者认为这种偶数概率表明存在潜在的对称性。\n\n对于图的问题，引入了一个“对偶”技巧，证明了顶部和底部节点之间存在路径当且仅当左右节点之间不存在路径。由于配置是对称的，所以每个事件（存在路径或不存在路径）发生的概率均为1/2。\n\n对于四点问题，定义了一个保测变换，将((a,b),(c,d))转换为(normal(a,b),normal(-c,-d))，其中'normal'返回正交单位向量。这种变换保持概率，并将原点位于凸包内的事件与原点不位于凸包内的事件互换，再次导致1/2的概率。\n\n文章随后将问题推广到*n*维空间中的*k*个点，并将其与使用超平面划分空间的问题联系起来。它提供了一个组合公式来计算原点位于R^n中*k*个随机向量的凸包内的概率，假设向量的分布在符号取反下是不变的。这个概率与*k*-1个独立伯努利变量的和有关。最后，文章将问题框架化为半球覆盖单位球，突出了不同维度中随机点何时可能包含原点的反直觉性质。"
  },
  {
    "id": "45323901",
    "title": "Review: Project Xanadu – The Internet That Might Have Been",
    "url": "https://www.astralcodexten.com/p/your-review-project-xanadu-the-internet",
    "summary": "This review explores the origins of hypertext and the internet through the lens of Project Xanadu, a visionary project conceived by Ted Nelson. It begins by highlighting Vannevar Bush's \"Memex\" concept from 1945, a theoretical machine for organizing and connecting knowledge. Doug Engelbart's oN-Line System (NLS) in 1968, which showcased hypermedia, the mouse, and collaborative editing, is presented as an early attempt to realize the Memex vision. However, Engelbart's work faded into obscurity.\n\nThe review then focuses on Ted Nelson, who envisioned Xanadu as a universal hypertext system capable of storing and connecting documents in intricate ways. Nelson's ambition was to create a platform supporting version histories, intricate linking, and creative exploration of knowledge. The review emphasizes Nelson's philosophical approach to Xanadu and how it differed from traditional data processing. It also mentions some of the challenges faced with the project.\n",
    "chinese_title": "评：世外桃源计划——本可能出现的互联网",
    "chinese_summary": "本文回顾了超文本和互联网的起源，以泰德·尼尔森构想的富有远见的Xanadu计划为视角。首先介绍了范内瓦尔·布什1945年提出的“Memex”概念，这是一种用于组织和连接知识的理论机器。道格·恩格尔巴特于1968年推出的oN-Line System (NLS) 展示了超媒体、鼠标和协同编辑，被认为是实现Memex愿景的早期尝试。然而，恩格尔巴特的研究逐渐被埋没。\n\n接下来，本文重点介绍了泰德·尼尔森，他将Xanadu设想为一个通用的超文本系统，能够以复杂的方式存储和连接文档。尼尔森的雄心是创建一个支持版本历史、复杂链接和知识创造性探索的平台。本文强调了尼尔森对Xanadu的哲学方法，以及它与传统数据处理的不同之处。文章还提到了该项目面临的一些挑战。"
  },
  {
    "id": "45322050",
    "title": "Meta exposé author faces bankruptcy after ban on criticising company",
    "url": "https://www.theguardian.com/technology/2025/sep/21/meta-expose-author-sarah-wynn-williams-faces-bankruptcy-after-ban-on-criticising-company",
    "summary": "Sarah Wynn-Williams, a former Meta executive and author of the exposé \"Careless People,\" is facing potential bankruptcy after Meta secured an order preventing her from disparaging the company. The book contains claims about Meta's dealings with China and its treatment of teenagers, as well as allegations of sexual harassment, all denied by the company.\n\nMP Louise Haigh raised the issue in Parliament, accusing Meta of trying to \"silence and punish\" Wynn-Williams for speaking out, potentially facing a $50,000 fine for each breach of the order. Haigh argued that Meta is using the arbitration system in the UK to financially ruin Wynn-Williams, despite previous statements about not using NDAs in sexual harassment cases.\n\nMeta maintains that Wynn-Williams voluntarily entered into a non-disparagement agreement upon her departure in 2017 and that she hasn't yet made any payments. They claim her Senate testimony was false and that she was fired for \"poor performance and toxic behavior\" after an investigation concluded she made unfounded harassment allegations. They also describe her book as a collection of outdated claims and false accusations.\n\nWhile the ruling prevents Wynn-Williams from promoting the book, Pan Macmillan has sold over 150,000 copies. Wynn-Williams's lawyer says she remains silenced despite calls from Congress to end the arbitration proceedings.\n",
    "chinese_title": "禁止批评公司后，Meta 曝光作者面临破产",
    "chinese_summary": "前Meta高管、《轻率之辈》一书的作者萨拉·温-威廉姆斯在Meta获得禁止其诋毁公司的命令后，面临破产的可能。该书包含关于Meta与中国的交易、对青少年的待遇以及性骚扰指控，所有指控均遭到该公司否认。\n\n议员路易丝·海格在议会提出了这个问题，指责Meta试图“压制和惩罚”温-威廉姆斯的发声，她可能因每次违反该命令而面临5万美元的罚款。海格认为，Meta正在利用英国的仲裁系统在经济上摧毁温-威廉姆斯，尽管此前Meta曾声明不在性骚扰案件中使用保密协议。\n\nMeta坚持认为，温-威廉姆斯在2017年离职时自愿签署了非贬低协议，并且她尚未支付任何款项。他们声称她的参议院证词是虚假的，并且在调查得出她提出了毫无根据的骚扰指控后，她因“表现不佳和有毒行为”而被解雇。他们还将她的书描述为过时的说法和虚假指控的集合。\n\n虽然该裁决阻止了温-威廉姆斯宣传这本书，但Pan Macmillan已售出超过15万册。温-威廉姆斯的律师表示，尽管国会呼吁结束仲裁程序，她仍然保持沉默。"
  },
  {
    "id": "45323297",
    "title": "How to stop functional programming (2016)",
    "url": "https://brianmckenna.org/blog/howtostopfp",
    "summary": "This satirical article addresses the situation where a developer is told to stop using functional programming (FP) due to a coworker's lack of understanding and a manager's conflict-avoidance decision. The author highlights the absurdity of trying to *completely* avoid FP, demonstrating how even seemingly simple tasks inevitably involve functional concepts.\n\nThe author uses the example of creating a function to list a user's coworkers. Initially written in a pure, functional style using `flatMap`, the author then attempts to avoid FP by introducing mutable state (a `ListBuffer`) and a side-effect (logging). The humor lies in the fact that even with these changes, the function still contains functional elements and the definition of \"no functional programming\" is vague.\n\nThe article then pushes the satire further by introducing a product requirement change (displaying the number of coworkers instead of the list). This forces the developer to consider *how* to perform simple arithmetic without being \"pure,\" implying the directive to avoid FP is ultimately impractical and hinders productivity. The conclusion suggests the manager's decision might lead to absurd scenarios where even basic operations become complicated due to the forced avoidance of effective programming paradigms. The main message is that blanket bans on programming styles can be detrimental and counterproductive.\n",
    "chinese_title": "如何停止函数式编程 (2016)",
    "chinese_summary": "这篇讽刺文章讲述了这样一种情况：由于同事缺乏理解以及经理的回避冲突决策，开发者被告知停止使用函数式编程（FP）。作者强调了*完全*避免FP的荒谬性，论证了即使是看似简单的任务也不可避免地涉及到函数式概念。\n\n作者用创建一个列出用户同事的函数的例子来说明。最初使用`flatMap`以纯粹的函数式风格编写，然后作者试图通过引入可变状态（`ListBuffer`）和副作用（日志记录）来避免FP。幽默之处在于，即使进行了这些更改，该函数仍然包含函数式元素，“没有函数式编程”的定义也很模糊。\n\n文章随后通过引入产品需求变更（显示同事的数量而不是列表）进一步推进了讽刺。这迫使开发者考虑*如何*在不“纯粹”的情况下执行简单的算术运算，暗示了避免FP的指令最终是不切实际的，并且阻碍了生产力。结论表明，经理的决定可能会导致荒谬的情况，即由于被迫避免有效的编程范例，即使是基本操作也会变得复杂。主要信息是，一概而论地禁止编程风格可能是有害且适得其反的。"
  },
  {
    "id": "45314592",
    "title": "Ultrasonic Chef's Knife",
    "url": "https://seattleultrasonics.com/",
    "summary": "This advertisement promotes the Seattle Ultrasonics C-200 Ultrasonic 8\" Chef's Knife, claiming it's the world's first ultrasonic chef's knife for home cooks. The knife uses ultrasonics to allow the blade to effortlessly glide through food, resulting in clean cuts, minimal force, and reduced sticking.\n\nKey features include a 200mm blade made of Japanese san mai AUS-10 steel and a battery rechargeable via USB-C and wireless charging.\n\nTwo options are available for pre-order: the knife alone for $399.00 and a knife and charger bundle for $499.00 (discounted from the regular combined price of $548.00). Both are currently sold out and are available for pre-order with an estimated shipping date of January 2026 (Batch 1). Customers can cancel their pre-order anytime before the order ships. The advertisement encourages interested individuals to sign up for more information.\n",
    "chinese_title": "超声波厨刀",
    "chinese_summary": "本广告宣传西雅图超声波C-200超声波8寸厨师刀，声称其为世界首款家用超声波厨师刀。该刀利用超声波使刀刃轻松滑过食物，从而实现干净利落的切割、最小的力气和减少粘连。\n\n主要特点包括采用日本三枚钢AUS-10钢材制成的200毫米刀刃，以及可通过USB-C和无线充电充电的电池。\n\n目前提供两种预购选项：单独一把刀售价399.00美元；刀和充电器套装售价499.00美元（低于原价组合价548.00美元）。 两者目前已售罄，可预订，预计发货日期为2026年1月（第一批）。 顾客可以在订单发货前的任何时间取消预购。 该广告鼓励感兴趣的人士注册以获取更多信息。"
  },
  {
    "id": "45317527",
    "title": "$2 WeAct Display FS adds a 0.96-inch USB information display to your computer",
    "url": "https://www.cnx-software.com/2025/09/18/2-weact-display-fs-adds-a-0-96-inch-usb-information-display-to-your-computer/",
    "summary": "This article introduces the WeAct Display FS V1, a tiny $2 USB dongle featuring a 0.96-inch full-color display (160x80 resolution) designed to add an information screen or secondary display to computers and SBCs. The USB-A port is reversible, allowing users to orient the display in either direction.\n\nWeAct provides two software programs for the device. \"WeAct Studio System Monitor,\" based on the open-source Turing Smart Screen project, lets users create custom UIs displaying text, images, weather, and other information. While WeAct states this program only works on Windows, the original project supports macOS, Linux, and other Python 3.9+ compatible operating systems.\n\nThe second program, \"WeAct Studio Screen Projection,\" emulates a display, enabling users to move windows and programs onto the tiny screen. However, its practical use is questionable due to the very low resolution of 160x80. This second program is Windows-only and closed-source.\n\nThe WeAct Display FS V1 is available on AliExpress for around $2 plus shipping. The article also mentions a larger 3.5-inch variant with a 480x320 resolution, priced around $11.\n",
    "chinese_title": "WeAct Display FS 为你的电脑增加一个0.96英寸的USB信息显示屏",
    "chinese_summary": "本文介绍 WeAct Display FS V1，一款小巧的 2 美元 USB 加密狗，配备 0.96 英寸全彩显示屏（160x80 分辨率），旨在为计算机和 SBC 添加信息屏幕或辅助显示器。USB-A 端口是可逆的，允许用户以任一方向定向显示屏。\n\nWeAct 为该设备提供了两个软件程序。 \"WeAct Studio System Monitor\" 基于开源的 Turing Smart Screen 项目，允许用户创建自定义 UI，显示文本、图像、天气和其他信息。虽然 WeAct 声称该程序仅适用于 Windows，但原始项目支持 macOS、Linux 和其他 Python 3.9+ 兼容的操作系统。\n\n第二个程序 \"WeAct Studio Screen Projection\" 模拟显示器，使用户能够将窗口和程序移动到微型屏幕上。然而，由于 160x80 的极低分辨率，它的实际用途令人质疑。第二个程序仅适用于 Windows，并且是闭源的。\n\nWeAct Display FS V1 在速卖通上有售，价格约为 2 美元加上运费。文章还提到了一款更大的 3.5 英寸型号，分辨率为 480x320，价格约为 11 美元。"
  },
  {
    "id": "45312202",
    "title": "Writing a competitive BZip2 encoder in Ada from scratch in a few days – part 3",
    "url": "https://gautiersblog.blogspot.com/2025/09/writing-competitive-bzip2-encoder-in.html",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "几天内从头开始用Ada编写一个有竞争力的BZip2编码器 - 第3部分",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "45323008",
    "title": "UUIDv7 in Postgres 18. With time extraction",
    "url": "https://www.thenile.dev/blog/uuidv7",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "Postgres 18 中的 UUIDv7，带时间提取功能",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "45290358",
    "title": "Hi No Youjin",
    "url": "https://aethermug.com/posts/hi-no-youjin",
    "summary": "Marco Giancotti reflects on his experiences of feeling a connection to the past, initially triggered by ancient Roman ruins. He found a sense of awe and timelessness in touching the old stones, imagining the lives of those who stood in the same spot millennia ago. He initially believed this experience was specific to durable materials like stone and metal.\n\nHowever, after moving to Japan, he discovered that this feeling could be evoked even by wooden structures, specifically citing Douglas Adams' anecdote about the Golden Pavilion in Kyoto, which is repeatedly rebuilt but considered the same building. This led him to realize that the enduring \"idea\" or \"intention\" behind a structure, rather than the original materials, is key to this connection.\n\nHe further refines his understanding by observing that mere age or reconstruction isn't enough. The Ise Grand Shrine, rebuilt every 20 years, elicits a deeper connection than a modern building, highlighting the importance of something beyond physical age.\n\nThe author then shares his experience in Tokyo, hearing the \"hi no youjin\" (\"be careful with fire\") patrol in his neighborhood. He learns this fire watch practice dates back to 1648, and hearing the same phrase recited night after night evokes a powerful sense of continuity with the past, transporting him to Edo-era Japan. Giancotti concludes that the essence of connecting to the past lies in the enduring tradition and the shared human experience, transcending the physical materials and age of the object or practice.\n",
    "chinese_title": "嗨，野兽前辈",
    "chinese_summary": "马可·詹科蒂反思了他与过去产生联系的经历，最初是由古罗马遗址触发的。触摸古老的石头，他感到敬畏和永恒，想象着几千年前站在同一地点的人们的生活。他最初认为这种体验仅限于石头和金属等耐用材料。\n\n然而，搬到日本后，他发现即使是木制建筑也能唤起这种感觉，他特别引用了道格拉斯·亚当斯关于京都金阁寺的轶事，金阁寺不断重建，但仍被认为是同一座建筑。这让他意识到，这种联系的关键在于建筑背后持久的“理念”或“意图”，而不是原始材料。\n\n他进一步完善了自己的理解，认为仅仅是年代久远或重建是不够的。伊势神宫每20年重建一次，但它比现代建筑更能引起更深层次的联系，突出了超越物理年龄的重要性。\n\n作者随后分享了他在东京的经历，听到邻里里“火の用心”（“小心火烛”）的巡逻声。他了解到这种防火警戒的做法可以追溯到1648年，每天晚上听到同样的短语，唤起了一种与过去强大的连续感，将他带到了江户时代的日本。詹科蒂总结说，与过去联系的本质在于持久的传统和共同的人类体验，超越了物体或实践的物理材料和年龄。"
  },
  {
    "id": "45324021",
    "title": "Linux Ready to Upstream Support for Google's PSP Encryption for TCP Connections",
    "url": "https://www.phoronix.com/news/PSP-Encryption-Linux-6.18",
    "summary": "Google's PSP (PSP Security Protocol), designed for encrypting TCP network connections in-transit, is poised to be integrated into the mainline Linux kernel with the upcoming 6.18 release. After thirteen rounds of review, the code, which has been successfully tested with PSP-capable CX7 NICs, is expected to be merged.\n\nPSP, open-sourced by Google in 2022, serves as an encryption encapsulation layer on top of IP, aimed at addressing the needs of large-scale data centers. Google developed PSP as a simpler, more functional, and scalable alternative to IPsec ESP.\n\nThe initial implementation focuses on enabling PSP for efficient TLS offload, leveraging the protocol's superior offload characteristics. The core code exposes device information for use by various PSP implementations (xfrm, tunneling, etc.), integrating TCP in a TLS-style manner by attaching crypto state to sockets and marking skbs as \"decrypted.\"\n\nThe first iteration includes a device-specific implementation for NVIDIA-Mellanox MLX5 network drivers. Future development aims to use PSP as a more efficient TLS offload by performing a TLS handshake inline within the same TCP connection and then switching to PSP. The code is being submitted as part of the upcoming Linux 6.18 merge window.\n",
    "chinese_title": "Linux 准备向上游提交对 Google PSP 加密 TCP 连接的支持",
    "chinese_summary": "谷歌的PSP（PSP安全协议），旨在加密传输中的TCP网络连接，预计将在即将发布的6.18版本中集成到主线Linux内核中。经过十三轮审查，该代码已成功通过支持PSP的CX7 NIC的测试，预计将被合并。\n\nPSP由谷歌于2022年开源，作为IP之上的加密封装层，旨在满足大型数据中心的需求。谷歌开发PSP是为了替代IPsec ESP，使其更简单、更实用、更具可扩展性。\n\n最初的实现侧重于启用PSP以实现高效的TLS卸载，利用该协议卓越的卸载特性。核心代码公开设备信息，供各种PSP实现（xfrm、隧道等）使用，通过将加密状态附加到套接字并将skb标记为“已解密”，以TLS的方式集成TCP。\n\n第一个迭代版本包括针对NVIDIA-Mellanox MLX5网络驱动程序的设备特定实现。未来的发展目标是使用PSP作为更高效的TLS卸载，在同一TCP连接中内联执行TLS握手，然后切换到PSP。该代码将作为即将到来的Linux 6.18合并窗口的一部分提交。"
  },
  {
    "id": "45322992",
    "title": "Extrachromosomal DNA–Driven Oncogene Evolution in Glioblastoma",
    "url": "https://aacrjournals.org/cancerdiscovery/article/doi/10.1158/2159-8290.CD-24-1555/764257/Extrachromosomal-DNA-Driven-Oncogene-Spatial",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "胶质母细胞瘤中染色体外DNA驱动的癌基因演化",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "45289150",
    "title": "Teardown of Apple 40W dynamic power adapter with 60W max",
    "url": "https://www.chargerlab.com/teardown-of-apple-40w-dynamic-power-adapter-with-60w-max-a3365/",
    "summary": "This article is a teardown of Apple's new 40W Dynamic Power Adapter (A3365), which can dynamically deliver up to 60W. Released alongside the iPhone 17 series, it's noted for its compact size, similar to Apple's 20W charger, and foldable prongs. It charges an iPhone 17 to 50% in 20 minutes and can deliver up to 60W for devices like the MacBook Air M3.\n\nThe teardown reveals a well-engineered internal design. The enclosure uses snap-fit clips and ultrasonic welding. Internal components are insulated with graphite thermal pads, foam cushions, and high-temperature tape for heat dissipation and protection.\n\nKey components include a PI master control chip (ZN1612F), RECTRON synchronous rectifier (RM85N100DF), Infineon protocol chip (CYPDC1185B2-32E), and NCC and Nichicon capacitors for filtering. A thermistor enables dynamic power switching based on temperature. The design features two common mode chokes, a safety X2 capacitor, and utilizes both electrolytic and solid capacitors.\n\nThe article concludes that the adapter’s dynamic power delivery intelligently adjusts output based on device needs, making it suitable for both iPhones and MacBooks. ChargerLAB highlights the high integration of components, effective heat dissipation, and robust build quality.\n",
    "chinese_title": "苹果40W动态功率适配器拆解（最大功率60W）",
    "chinese_summary": "本文拆解了苹果新款40W动态电源适配器 (A3365)，它能动态提供高达60W的功率。该适配器与iPhone 17系列一同发布，以其紧凑的尺寸（类似于苹果20W充电器）和可折叠插脚而著称。它可在20分钟内将iPhone 17充电至50%，并可为 MacBook Air M3 等设备提供高达 60W 的功率。\n\n拆解显示其内部设计精良。外壳采用卡扣式夹子和超声波焊接。内部组件采用石墨散热垫、泡沫缓冲垫和耐高温胶带进行绝缘，以实现散热和保护。\n\n主要组件包括PI主控芯片（ZN1612F）、RECTRON同步整流器（RM85N100DF）、英飞凌协议芯片（CYPDC1185B2-32E）以及用于滤波的NCC和尼吉康电容。热敏电阻可实现基于温度的动态功率切换。该设计具有两个共模扼流圈、一个安全X2电容，并同时使用电解电容和固态电容。\n\n文章总结称，该适配器的动态功率输出能根据设备需求智能调节，使其适用于iPhone和MacBook。ChargerLAB强调了组件的高度集成、有效的散热以及坚固的制造质量。"
  },
  {
    "id": "45285387",
    "title": "Why, as a responsible adult, SimCity 2000 hits differently",
    "url": "https://arstechnica.com/gaming/2025/09/thirty-years-later-simcity-2000-hasnt-changed-but-i-have/",
    "summary": "In this article, Kyle Orland reflects on revisiting SimCity 2000 as an adult, contrasting his childhood experience with a newfound sense of responsibility. As a child, the game was a playground for unchecked power, marked by infinite money cheats and reckless experimentation with the virtual city. He would gleefully destroy neighborhoods, prioritize aesthetics over functionality, and disregard the well-being of his simulated citizens.\n\nHowever, returning to the game as an adult homeowner, parent, and city-dweller, Orland finds himself contemplating the real-world implications of his in-game decisions. Raising taxes, legalizing gambling, and neglecting infrastructure now carry a weight informed by personal experience and an understanding of societal consequences. He grapples with trade-offs related to social programs, environmental concerns, and urban planning.\n\nThe article also highlights the idealized aspects of SimCity 2000, contrasting its streamlined construction processes with the realities of real-world urban development. Despite some archaic UI elements, the game's retro-futuristic aesthetic remains charming. Ultimately, as a responsible adult, Orland desires to create a thriving and livable environment for his virtual citizens, even while acknowledging the lingering temptation to indulge his inner child's destructive impulses. The author concludes by highlighting the availability of SimCity 2000 on GOG and disclosing his role as Senior Gaming Editor at Ars Technica.\n",
    "chinese_title": "为何身为负责任的成年人，《模拟城市2000》给人的感受如此不同",
    "chinese_summary": "在本文中，凯尔·奥兰德反思了成年后重玩《模拟城市2000》的经历，对比了他童年时期的体验和一种新的责任感。童年时，这款游戏是肆意妄为的乐园，充斥着无限金钱作弊码和对虚拟城市的鲁莽实验。他会兴高采烈地摧毁街区，优先考虑美观而非功能，并且无视模拟市民的福祉。\n\n然而，作为一名成年房主、父母和城市居民重返游戏时，奥兰德发现自己开始思考游戏中决策的现实影响。提高税收、赌博合法化以及忽视基础设施建设现在都承载着个人经验和对社会后果的理解带来的沉重感。他纠结于与社会项目、环境问题和城市规划相关的权衡。\n\n文章还突出了《模拟城市2000》的理想化方面，将其简化的建造过程与现实世界城市发展的现实进行了对比。尽管存在一些古老的UI元素，但这款游戏的复古未来主义美学仍然充满魅力。最终，作为一名负责任的成年人，奥兰德渴望为他的虚拟市民创造一个繁荣宜居的环境，即使他承认内心深处仍然存在放纵他内心孩子破坏冲动的诱惑。作者最后强调了《模拟城市2000》在GOG上的可用性，并公开了他作为Ars Technica高级游戏编辑的身份。"
  },
  {
    "id": "45324350",
    "title": "Liberté, égalité, Radioactivité",
    "url": "https://worksinprogress.co/issue/liberte-egalite-radioactivite/",
    "summary": "This article explores France's successful adoption of nuclear energy in the 1970s, contrasting it with the decline of nuclear programs in other Western countries. Despite a slow start and internal conflicts between the CEA (nuclear weapons program) and EDF (electricity grid), France ultimately embraced nuclear power due to a politically driven decision to prioritize cheap, reliable electricity over solely domestic technology.\n\nThe Messmer Plan, launched in response to the 1973 oil crisis, spearheaded a rapid nuclear buildout, characterized by standardized reactor designs, long-term planning, and streamlined regulations. This allowed France to construct reactors quickly and efficiently, at a fraction of the cost seen in the US.\n\nA key factor in France's success was the comparatively weak anti-nuclear movement. The French political system, with its strong executive and weak legislature, offered little legal avenue for opposition. Furthermore, the communist party, a potential source of anti-nuclear sentiment, relied on the support of nuclear industry workers and thus adopted a pro-nuclear stance.\n\nThe French tax system, which directed industrial revenues back to the host communities, also played a crucial role. Municipalities received significant financial benefits from hosting nuclear power plants, enabling them to lower taxes, improve infrastructure, and foster local support for nuclear energy. This financial incentive transformed local mayors into active advocates for nuclear expansion, ultimately contributing to France's successful decarbonization of its grid.\n",
    "chinese_title": "自由，平等，放射性",
    "chinese_summary": "本文探讨了法国在20世纪70年代成功采用核能的案例，并将其与其他西方国家核计划的衰落进行了对比。尽管起步缓慢，且法国原子能委员会（CEA，核武器计划）与法国电力公司（EDF，电网）之间存在内部冲突，但由于一项将廉价、可靠电力置于完全依赖本土技术之上的政治驱动决策，法国最终拥抱了核能。\n\n梅斯梅尔计划是为应对1973年石油危机而启动的，它率先进行了快速的核能建设，其特点是标准化反应堆设计、长期规划和简化的法规。这使得法国能够以美国成本的一小部分快速高效地建造反应堆。\n\n法国成功的关键因素在于相对较弱的反核运动。法国的政治体制拥有强大的行政部门和薄弱的立法机构，几乎没有提供反对的法律途径。此外，共产党作为潜在的反核情绪来源，依赖于核工业工人的支持，因此采取了支持核能的立场。\n\n法国的税收制度也将工业收入导向东道社区，这也发挥了至关重要的作用。市政当局从运营核电站中获得了巨大的财政收益，使他们能够降低税收、改善基础设施并促进当地对核能的支持。这种财政激励措施将地方市长转变为核能扩张的积极倡导者，最终为法国电网的成功脱碳做出了贡献。"
  },
  {
    "id": "45319399",
    "title": "The bloat of edge-case first libraries",
    "url": "https://43081j.com/2025/09/bloat-of-edge-case-libraries",
    "summary": "This article critiques the prevalence of \"edge-case-first\" libraries in software development, arguing they contribute to bloated dependency trees. The author contends that many libraries over-engineer for unlikely or unnecessary edge cases, leading to overly granular dependencies.\n\nThe author illustrates this with examples like an over-engineered `clamp` function that handles string inputs despite being designed for numbers, ultimately satirizing the existence of libraries like `is-number`. They advocate for libraries that focus on the common use case and assume correct input types, leaving validation to the application level at data boundaries.\n\nExamples of problematic libraries include `is-arrayish`, `is-number`, `pascalcase`, and `is-regexp`, highlighting their handling of obscure edge cases (like cross-realm RegExp objects) that most users won't encounter. In contrast, the author praises libraries like `scule` and `dlv` that are more focused and make assumptions about input types.\n\nThe article also touches on overly-granular libraries like `shebang-regex` and `is-whitespace`, criticizing the trend of splitting functionalities into atomic units.\n\nThe author suggests that maintainers should review their dependencies, consider using native functionality or more performant alternatives, and be stricter about input types. Users are encouraged to monitor their dependencies and ensure validation happens at data boundaries. The core argument is that libraries should prioritize the main use case, with edge case support provided by alternatives or plugins, rather than imposing the cost of edge case handling on everyone.\n",
    "chinese_title": "优先考虑极端情况的首发库的臃肿",
    "chinese_summary": "本文批判了软件开发中“边缘情况优先”的库的普遍现象，认为它们会导致臃肿的依赖树。作者认为，许多库为了不太可能或不必要的边缘情况而过度设计，导致过度细化的依赖关系。\n\n作者用例子说明了这一点，例如一个过度设计的`clamp`函数，它处理字符串输入，尽管它是为数字设计的，最终讽刺了像`is-number`这样的库的存在。他们提倡专注于常见用例并假定正确输入类型的库，将验证留给数据边界处的应用程序级别。\n\n有问题的库的例子包括`is-arrayish`、`is-number`、`pascalcase`和`is-regexp`，突出了它们对大多数用户不会遇到的晦涩边缘情况（如跨领域的RegExp对象）的处理。相比之下，作者赞扬了像`scule`和`dlv`这样的库，它们更专注，并对输入类型做出假设。\n\n本文还提到了像`shebang-regex`和`is-whitespace`这样过度细化的库，批评了将功能拆分为原子单元的趋势。\n\n作者建议维护者应该审查他们的依赖关系，考虑使用原生功能或性能更高的替代方案，并且对输入类型更加严格。鼓励用户监控他们的依赖关系，并确保验证发生在数据边界。核心论点是，库应该优先考虑主要用例，边缘情况支持应由替代方案或插件提供，而不是将边缘情况处理的成本强加给每个人。"
  },
  {
    "id": "45286302",
    "title": "Gluco data handler: Receive and visualize glucose data on Android",
    "url": "https://github.com/pachi81/GlucoDataHandler",
    "summary": "GlucoDataHandler (GDH) is an Android application that centralizes and visualizes glucose data from various sources on smartphones, smartwatches (Wear OS, Miband, Amazfit), and cars (via GlucoDataAuto).\n\nIt supports diverse data sources, including cloud services like LibreLinkUp, Dexcom Share, Medtrum, and Nightscout, as well as local apps like AndroidAPS, Juggluco, xDrip+, Eversense (ESEL), and Dexcom BYODA. A beta feature receives glucose values via Android Notifications.\n\nGDH offers comprehensive visualization through widgets, a floating widget, optional notifications with customizable icons, lock screen wallpaper, and Always On Display (AOD) support. It includes customizable alarms for very low, low, high, very high, and obsolete glucose values, with individual sound settings and a fullscreen lockscreen alarm.\n\nWear OS integration provides complications for other watchfaces and receives alarms directly on the watch (requires the phone app). WatchDrip+ support enables use with specific Miband and Amazfit devices. The app features TalkBack accessibility. It is also Android Auto compatible via GlucoDataAuto and supports Tasker integration. Data forwarding allows sending glucodata broadcasts to other apps.\n\nGDH doesn't provide standalone Wear OS watchfaces, but two users provide specialized watchfaces compatible with GDH's complications.\n",
    "chinese_title": "血糖数据处理器：在安卓设备上接收和可视化血糖数据",
    "chinese_summary": "GlucoDataHandler (GDH) 是一款 Android 应用程序，可集中并可视化来自智能手机、智能手表（Wear OS、小米手环、华米）和汽车（通过 GlucoDataAuto）等各种来源的葡萄糖数据。\n\n它支持多种数据源，包括 LibreLinkUp、Dexcom Share、Medtrum 和 Nightscout 等云服务，以及 AndroidAPS、Juggluco、xDrip+、Eversense (ESEL) 和 Dexcom BYODA 等本地应用。一项 Beta 功能可以通过 Android 通知接收葡萄糖值。\n\nGDH 通过小部件、浮动小部件、带有可自定义图标的可选通知、锁屏壁纸和息屏显示 (AOD) 支持提供全面的可视化。它包括针对极低、低、高、极高和过期葡萄糖值的可自定义警报，具有单独的声音设置和全屏锁屏警报。\n\nWear OS 集成提供适用于其他表盘的复杂功能，并在手表上直接接收警报（需要手机应用程序）。 WatchDrip+ 支持可用于特定的小米手环和华米设备。该应用具有 TalkBack 辅助功能。它还通过 GlucoDataAuto 兼容 Android Auto，并支持 Tasker 集成。数据转发允许将血糖数据广播到其他应用程序。\n\nGDH 不提供独立的 Wear OS 表盘，但两位用户提供了与 GDH 复杂功能兼容的专用表盘。"
  },
  {
    "id": "45296550",
    "title": "Bluefin LTS Is Released",
    "url": "https://docs.projectbluefin.io/blog/bluefin-lts-ga/",
    "summary": "Bluefin LTS and Bluefin GDX are now Generally Available after nine months of development. Bluefin LTS is a workstation OS based on CentOS Stream 10 designed for users who prefer long-term support with a modern GNOME 48 desktop and features like Flathub, Homebrew, and ZFS support. It offers an optional hardware enablement (HWE) branch with a newer Linux kernel (6.15.9) for newer hardware like the Framework 12 and Framework Desktop.\n\nBluefin GDX is an AI workstation derived from Bluefin LTS, focusing on providing Nvidia drivers and CUDA for AI and machine learning professionals. It includes features like Nvidia CUDA and VSCode integrations, Ramalama for AI model management, and uv for Python package management, and the project has partnered with the Red Hat Enterprise Linux Command Line Assistant team.\n\nThe releases feature a new Anaconda webui installer and will receive weekly updates. Bluefin LTS will be more sustainable for developers, and while Bluefin GTS might be hidden from the website, it will still be offered. Bluefin LTS does not support local layering or AppImages, unlike Bluefin and Bluefin GTS.\n\nThe article also announces a new Bluefin store with merchandise to support paleoartwork. The release was a team effort with contributions from Yulian Kuncheff, Ahmed Adan, and M. Gopal, along with support from Carl George, Laura Santamaria, Shaun McCance, and the bootc team. Downloads for both Bluefin LTS and GDX are available for AMD/Intel and ARM (aarch64) architectures.\n",
    "chinese_title": "蓝鳍LTS已发布",
    "chinese_summary": "经过九个月的开发，Bluefin LTS 和 Bluefin GDX 现已正式发布。Bluefin LTS 是一个基于 CentOS Stream 10 的工作站操作系统，专为喜欢长期支持且拥有现代 GNOME 48 桌面以及 Flathub、Homebrew 和 ZFS 支持等功能的用户而设计。它提供一个可选的硬件支持 (HWE) 分支，该分支具有更新的 Linux 内核 (6.15.9)，适用于更新的硬件，例如 Framework 12 和 Framework Desktop。\n\nBluefin GDX 是一个衍生自 Bluefin LTS 的 AI 工作站，专注于为 AI 和机器学习专业人士提供 Nvidia 驱动程序和 CUDA。它包括 Nvidia CUDA 和 VSCode 集成、用于 AI 模型管理的 Ramalama 以及用于 Python 包管理的 uv 等功能，并且该项目已与 Red Hat Enterprise Linux 命令行助手团队合作。\n\n这些版本具有新的 Anaconda webui 安装程序，并将每周收到更新。Bluefin LTS 对开发者来说将更具可持续性，虽然 Bluefin GTS 可能会在网站上隐藏，但仍将提供。与 Bluefin 和 Bluefin GTS 不同，Bluefin LTS 不支持本地分层或 AppImages。\n\n文章还宣布了一家新的 Bluefin 商店，其中包含用于支持古生物艺术品的商品。此次发布是 Yulian Kuncheff、Ahmed Adan 和 M. Gopal 等人共同努力的结果，并得到了 Carl George、Laura Santamaria、Shaun McCance 和 bootc 团队的支持。Bluefin LTS 和 GDX 的下载适用于 AMD/Intel 和 ARM (aarch64) 架构。"
  },
  {
    "id": "45320431",
    "title": "Vibe coding cleanup as a service",
    "url": "https://donado.co/en/articles/2025-09-16-vibe-coding-cleanup-as-a-service/",
    "summary": "The article discusses the emergence of \"Vibe Coding cleanup\" as a new service category in the tech industry, driven by the widespread use of AI code generation tools like Copilot. While AI promises increased productivity, it often results in production-unready code riddled with issues like inconsistencies, security vulnerabilities, and architectural flaws. This leads to increased code churn and \"competency debt,\" where teams struggle to maintain AI-generated systems they don't fully understand.\n\nThe demand for specialists who can fix this \"AI spaghetti\" is growing, with individuals and consultancies offering Vibe Coding cleanup services at premium rates. Marketplaces like VibeCodeFixers.com are connecting clients with these specialists, often dealing with prototypes built rapidly with AI but needing significant remediation to become production-ready.\n\nThe core problem is that AI excels at small, isolated tasks but struggles with system-level architectural decisions, creating technical debt with each prompt. This results in inconsistent code, duplicated logic, and security holes. Georgetown University research indicates nearly half of AI-generated code contains security vulnerabilities.\n\nThe article highlights the significant market opportunity in Vibe Coding cleanup, with Gartner predicting widespread AI code assistant usage. While startups save time initially with AI, cleanup often requires comparable time and budget. This creates new career paths for developers who master AI code remediation, enabling them to command high salaries. The article concludes that successful companies use AI strategically, primarily for prototyping, and invest in thorough cleanup processes before accruing unsustainable technical debt.\n",
    "chinese_title": "氛围代码清理即服务",
    "chinese_summary": "AI代码生成催生新服务类别：Vibe Coding 清理"
  },
  {
    "id": "45324073",
    "title": "Magnesium, the microbiome, and reducing the risk of colon cancer",
    "url": "https://newatlas.com/health-wellbeing/magnesium-supplements-gut-bacteria-colorectal-cancer/",
    "summary": "This 2025 article explores the potential link between magnesium supplementation, gut bacteria, and the reduced risk of colon cancer. A clinical trial led by Vanderbilt University Medical Center found that magnesium supplements can boost beneficial gut bacteria, specifically *Carnobacterium maltaromaticum* and, to a lesser extent, *Faecalibacterium prausnitzii*, which may help inhibit the growth of colorectal cancer.\n\nHowever, the effect varied based on genetics and sex. Individuals without a specific \"missense variant\" (Thr1482Ile) in the TRPM7 gene (which regulates magnesium) responded well to magnesium supplementation, experiencing an increase in these beneficial bacteria, particularly women. Those *with* the variant sometimes experienced the opposite effect.\n\nFollow-up colonoscopies revealed that higher levels of *C. maltaromaticum* in rectal tissue biopsies were associated with a lower risk of developing serrated polyps (associated with higher colorectal cancer risk), while higher levels of *F. prausnitzii* were linked to a higher risk of polyps, though this finding was less conclusive.\n\nThe study suggests a \"precision nutrition\" approach, where genetic testing could help identify individuals who would benefit most from magnesium supplementation. While the study has limitations (short duration, specific demographic), it highlights the potential role of magnesium and the gut microbiome in colorectal cancer prevention, particularly for women and those without the specific TRPM7 genetic variant. Further research is needed to confirm these findings and translate them into clinical recommendations.\n",
    "chinese_title": "镁、微生物组与降低结肠癌风险",
    "chinese_summary": "2025年文章：镁补充剂、肠道细菌与降低结肠癌风险的潜在联系\n\n该2025年文章探讨了镁补充剂、肠道细菌与降低结肠癌风险之间的潜在联系。范德堡大学医学中心领导的一项临床试验发现，镁补充剂可以促进有益肠道细菌的生长，特别是*麦芽糖肉杆菌(Carnobacterium maltaromaticum)*，并在较小程度上促进*粪杆菌(Faecalibacterium prausnitzii)*的生长，这可能有助于抑制结直肠癌的生长。\n\n然而，这种效果因基因和性别而异。TRPM7基因（调节镁）中没有特定“错义变异”(Thr1482Ile)的个体对镁补充剂反应良好，这些有益细菌有所增加，尤其是女性。*有*这种变异的个体有时会产生相反的效果。\n\n后续的结肠镜检查显示，直肠组织活检中较高水平的*麦芽糖肉杆菌*与较低的发生锯齿状息肉（与较高的结直肠癌风险相关）的风险有关，而较高水平的*粪杆菌*与较高的息肉风险有关，尽管这一发现不太具有确定性。\n\n该研究提出了一种“精准营养”方法，通过基因检测可以帮助识别最能从镁补充剂中获益的个体。尽管该研究存在局限性（持续时间短，特定人群），但它突出了镁和肠道微生物群在预防结直肠癌方面的潜在作用，特别是对于女性和那些没有特定TRPM7基因变异的人。还需要进一步的研究来证实这些发现，并将其转化为临床建议。"
  },
  {
    "id": "45315312",
    "title": "Designing NotebookLM",
    "url": "https://jasonspielman.com/notebooklm",
    "summary": "The article \"Designing NotebookLM\" focuses on the user journey and annotated overview of the design process behind NotebookLM, likely a tool for note-taking, knowledge organization, or information management.\n\nThe title suggests a design-centric perspective, emphasizing the user experience and how the interface was conceptualized and developed. The mention of \"User Journey\" indicates a focus on mapping out the steps a user takes while interacting with the software, highlighting pain points and areas for improvement. This likely includes considerations for onboarding, navigation, and core functionality.\n\nThe inclusion of \"Annotated Overview\" implies a detailed examination of the product's features and functionalities. This might involve visually explaining key elements of the user interface, providing context for design choices, and showcasing how the tool addresses specific user needs. It suggests the article will break down the product into its components, providing insightful explanations and potentially visual aids.\n\nIn essence, the article probably delves into the user-centered design process for NotebookLM, detailing how the creators understood and addressed the needs of their target audience through a well-defined user journey and a thoroughly annotated examination of the product's features and interface. It likely aims to provide a comprehensive understanding of the rationale behind the design choices made in creating NotebookLM.\n",
    "chinese_title": "设计 NotebookLM",
    "chinese_summary": "文章“设计NotebookLM”侧重于NotebookLM（可能是一款用于笔记、知识整理或信息管理的工具）背后的设计过程的用户旅程和带注释的概述。\n\n标题表明以设计为中心的视角，强调用户体验以及界面的概念化和开发过程。提及“用户旅程”表明重点在于绘制用户在与软件交互时所采取的步骤，突出痛点和需要改进的领域。这可能包括对引导、导航和核心功能的考虑。\n\n包含“带注释的概述”意味着对产品功能和特性的详细检查。这可能涉及直观地解释用户界面的关键元素，为设计选择提供背景信息，并展示该工具如何满足特定的用户需求。这表明文章将把产品分解为各个组件，提供深刻的解释，并可能提供视觉辅助。\n\n本质上，这篇文章可能深入探讨NotebookLM以用户为中心的设计过程，详细说明创建者如何通过明确定义的用户旅程和对产品功能和界面的彻底注释检查来理解和满足目标受众的需求。它可能旨在全面了解创建NotebookLM的设计选择背后的原理。"
  },
  {
    "id": "45324350",
    "title": "Liberté, égalité, Radioactivité",
    "url": "https://worksinprogress.co/issue/liberte-egalite-radioactivite/",
    "summary": "This article explores France's successful adoption of nuclear energy in the 1970s, contrasting it with the decline of nuclear power in other Western countries. While other nations grappled with rising costs, regulatory issues, and public opposition, France embarked on a rapid nuclear buildout under the Messmer Plan, ultimately decarbonizing its grid with a high reliance on nuclear power.\n\nThe success wasn't predetermined. Early French nuclear efforts were hampered by technological choices and internal conflicts. The shift to pressurized water reactors (PWRs), championed by EDF, was crucial despite resistance from the CEA. After De Gaulle left the presidency, France adopted the technology. The 1973 oil crisis further fueled this push, leading to a massive order of new reactors.\n\nSeveral factors contributed to France's success: streamlined regulatory processes, long-term planning, standardized designs, and a specialized supply chain. Critically, the article highlights the relative weakness of French anti-nuclear movements due to a strong executive branch, a pro-nuclear consensus across major political parties, and trade union support linked to nuclear employment.\n\nFurthermore, France's business tax system incentivized local communities to embrace nuclear power by directing industrial revenues towards host areas. This, combined with government subsidies and EDF's investment in local infrastructure and cultural events, transformed mayors into active proponents of nuclear expansion. The article emphasizes that the French experience offers valuable lessons for other nations seeking to embrace nuclear energy as a decarbonization strategy.\n",
    "chinese_title": "自由，平等，放射性",
    "chinese_summary": "本文探讨了法国在 20 世纪 70 年代成功采用核能的案例，并将其与其他西方国家核电衰落的情况进行了对比。 当其他国家苦于应对成本上升、监管问题和公众反对时，法国在梅斯梅尔计划下启动了快速的核电建设，最终以高度依赖核能的方式实现了电网的脱碳。\n\n这种成功并非命中注定。 法国早期的核电努力因技术选择和内部冲突而受阻。尽管 CEA 存在抵制，但法国电力公司 (EDF) 倡导转向压水反应堆 (PWR) 至关重要。 在戴高乐卸任总统后，法国采用了该技术。 1973 年的石油危机进一步推动了这一进程，导致大量订购新的反应堆。\n\n法国成功的因素有以下几个：简化的监管流程、长期规划、标准化设计和专业的供应链。 关键在于，文章强调了法国反核运动相对薄弱的原因，包括强大的行政部门、主要政党之间亲核的共识以及与核能就业相关的工会支持。\n\n此外，法国的商业税收制度通过将工业收入导向当地社区，从而鼓励当地社区接受核电。 这与政府补贴以及法国电力公司对当地基础设施和文化活动的投资相结合，将市长们转变为核电扩张的积极支持者。 文章强调，法国的经验为其他寻求将核能作为脱碳战略的国家提供了宝贵的经验。"
  },
  {
    "id": "45283637",
    "title": "Learning Languages with the Help of Algorithms",
    "url": "https://www.johndcook.com/blog/2025/09/17/learning-languages-with-the-help-of-algorithms/",
    "summary": "This article explores using algorithms to efficiently boost vocabulary acquisition when learning a new language, specifically through selecting books with high vocabulary impact. The problem is formalized as finding the best book(s) from a set, where \"best\" is defined by the weighted sum of vocabulary words present, weighted by their frequency in the language.\n\nWhile finding the single best book can be solved in linear time, selecting the best *k* books for optimal joint vocabulary coverage is an NP-hard problem, meaning exact solutions become computationally infeasible for larger *k*. However, the problem can be treated as a maximal weighted cover problem within the submodular problem space, allowing for approximation algorithms with guaranteed accuracy within a certain factor of the optimal solution.\n\nThe article highlights a greedy approach: iteratively adding the single highest-impact book to the selection, leveraging libraries like Python's `submodlib` for speed. Improvements to this greedy approach, such as blocking strategies, look-ahead strategies, and heuristics (e.g., discarding books with redundant vocabulary), can enhance result quality at the cost of increased computation. Despite these improvements, finding an *exact* solution remains challenging unless P=NP. Ultimately, the article presents a practical, algorithm-driven method to optimize language learning by strategically selecting reading materials.\n",
    "chinese_title": "利用算法学习语言",
    "chinese_summary": "本文探讨了使用算法来高效提升新语言学习中的词汇习得，特别是通过选择具有高词汇影响力的书籍。该问题被形式化为从一组书籍中找到最佳书籍，其中“最佳”的定义是存在于书中的词汇单词的加权总和，并根据它们在该语言中的频率进行加权。\n\n虽然找到单本最佳书籍可以在线性时间内解决，但选择最佳的 *k* 本书籍以获得最佳的联合词汇覆盖是一个 NP 难题，这意味着对于较大的 *k*，精确解在计算上变得不可行。然而，该问题可以被视为子模问题空间中的最大加权覆盖问题，从而允许使用近似算法，其精度在最佳解决方案的某个因子内得到保证。\n\n本文重点介绍了一种贪婪方法：迭代地将单本最具影响力的书籍添加到选择中，利用 Python 的 `submodlib` 等库来提高速度。对这种贪婪方法的改进，例如阻止策略、前瞻策略和启发式方法（例如，丢弃具有冗余词汇的书籍），可以提高结果质量，但会增加计算量。尽管有这些改进，除非 P=NP，否则找到一个 *精确* 解仍然具有挑战性。最终，本文提出了一种实用的、算法驱动的方法，通过策略性地选择阅读材料来优化语言学习。"
  },
  {
    "id": "45292915",
    "title": "Lidar, optical distance and time of flight sensors",
    "url": "https://ams-osram.com/innovation/technology/depth-and-3d-sensing/lidar-optical-distance-and-time-of-flight-sensors",
    "summary": "This short article focuses on three types of sensors: LIDAR, optical distance, and time-of-flight (ToF) sensors. It highlights the availability of fully integrated direct Time-of-Flight (dToF) modules and indirect Time-of-Flight (iToF) VCSEL illuminators, specifically for short-range applications. The article also mentions laser sources suitable for longer-range LIDAR systems, implying their importance in enabling wider sensing capabilities. Essentially, it summarizes the availability of components and solutions for both short and long-range distance and depth sensing using various technologies.\n",
    "chinese_title": "激光雷达、光学测距和飞行时间传感器",
    "chinese_summary": "本文重点介绍三种类型的传感器：激光雷达 (LIDAR)、光学测距传感器和飞行时间 (ToF) 传感器。文章着重强调了全集成直接飞行时间 (dToF) 模块和间接飞行时间 (iToF) VCSEL 照明器的可用性，特别适用于短程应用。文章还提到了适用于远程激光雷达系统的激光源，暗示了它们在实现更广泛的传感能力方面的重要性。总而言之，本文总结了使用各种技术进行短程和远程距离及深度感测的组件和解决方案的可用性。"
  },
  {
    "id": "45324231",
    "title": "EA as Antichrist: Understanding Peter Thiel",
    "url": "https://forum.effectivealtruism.org/posts/hGwAohPbwCrDT5ynY/ea-as-antichrist-understanding-peter-thiel",
    "summary": "This article explains Peter Thiel's controversial view of Effective Altruism (EA) as potentially embodying the Antichrist. Thiel believes the Antichrist isn't necessarily a person, but a system or ideology that promises peace and safety while actually leading to global stagnation and totalitarianism.\n\nHis argument hinges on the idea that slowing down AI development, which EAs advocate for due to safety concerns, ultimately hinders technological progress, the only remaining vector for growth. Thiel believes stagnation leads to conflict and societal collapse.\n\nThe article introduces Girardian mimetic theory, a key influence on Thiel, where human desire is based on copying others, leading to conflict resolved by scapegoating. Christianity, according to Girard, exposes the wrongness of scapegoating. Thiel fears a modern \"wokeness\" version of this, leading to a new totalitarianism.\n\nThiel sees government and globalization as inherently problematic. He emphasizes the tradeoff between existential risks like AI and the danger of a stagnant, globally regulated \"one world government\" under the guise of peace and safety. He views organizations regulating technology like the FDA and Nuclear Regulatory Commission as potentially embodying this dangerous trend, mirroring the Antichrist's deceptive promise of peace at the expense of progress. Therefore, he sees EA, with its focus on AI safety regulation, as inadvertently contributing to this dystopian outcome.\n",
    "chinese_title": "EA 作为敌基督：理解彼得·蒂尔",
    "chinese_summary": "本文阐述了彼得·蒂尔对有效利他主义（EA）颇具争议的观点，即EA可能体现了敌基督。蒂尔认为敌基督不一定是个人，而是一种体系或意识形态，它承诺和平与安全，但实际上导致全球停滞和极权主义。\n\n他的论点基于这样一种理念：由于安全考虑，有效利他主义者倡导放缓人工智能的发展，但这最终会阻碍技术进步，而技术进步是唯一剩余的增长动力。蒂尔认为停滞会导致冲突和社会崩溃。\n\n本文介绍了吉拉德的模仿理论，这是对蒂尔产生关键影响的理论。该理论认为人类的欲望是基于对他人模仿，从而导致冲突，而冲突可以通过替罪羊来解决。根据吉拉德的说法，基督教揭示了替罪羊行为的错误。蒂尔担心现代“觉醒”版本的替罪羊行为，会导致新的极权主义。\n\n蒂尔认为政府和全球化本质上存在问题。他强调了人工智能等生存风险与在和平与安全的幌子下，一个停滞不前、受到全球监管的“世界政府”的危险之间的权衡。他认为像FDA和核管理委员会这样监管技术的组织可能体现了这种危险趋势，反映了敌基督以牺牲进步为代价，对和平的欺骗性承诺。因此，他认为有效利他主义及其对人工智能安全监管的关注，无意中促成了这种反乌托邦的结果。"
  },
  {
    "id": "45318798",
    "title": "In defence of swap: common misconceptions (2018)",
    "url": "https://chrisdown.name/2018/01/02/in-defence-of-swap.html",
    "summary": "This article defends the use of swap space in modern Linux systems, arguing against the common misconception that it's merely slow, emergency memory. It asserts that swap's primary purpose is to enable \"equality of reclamation,\" allowing the system to efficiently manage memory by paging out infrequently used anonymous pages (memory allocations not backed by a file) to disk, thus freeing up RAM for more active use.\n\nThe author explains that without swap, these anonymous pages remain locked in memory, potentially hindering performance by displacing more important data in the page cache (file memory). Disabling swap doesn't eliminate disk I/O issues under memory pressure; it simply shifts the thrashing from anonymous pages to file pages.\n\nThe article addresses concerns about swap's performance, stating that on SSDs, swapping anonymous pages is comparable to reclaiming file pages. For older spinning disks, a lower `vm.swappiness` value is recommended. Furthermore, the author highlights improvements in swap management in kernels 4.0 and later.\n\nIt argues that while swap can prolong pathological behavior at near-OOM situations, disabling it doesn't prevent it. The article recommends using `memory.low` in cgroup v2 for fine-grained control over swap behavior, allowing admins to prioritize certain applications for reclaim under memory pressure.\n\nThe author concludes that having more swap is generally better than less, especially on recent kernels, and advocates for opportunistic, proactive memory management rather than relying solely on the OOM killer. He mentions the need for better memory pressure metrics, currently being developed at Facebook, to facilitate more informed tuning.\n",
    "chinese_title": "为互换辩护：常见误解 (2018)",
    "chinese_summary": "本文为在现代 Linux 系统中使用交换空间辩护，反驳了一种常见的误解，即它仅仅是缓慢的、紧急情况下的内存。文章认为，交换空间的主要目的是实现“回收平等”，通过将不常用的匿名页（未由文件支持的内存分配）分页到磁盘，从而有效地管理内存，释放 RAM 以供更积极的使用。\n\n作者解释说，如果没有交换空间，这些匿名页将保持锁定在内存中，可能会通过取代页面缓存（文件内存）中更重要的数据来阻碍性能。禁用交换空间并不能消除内存压力下的磁盘 I/O 问题；它只是将抖动从匿名页转移到文件页。\n\n本文解决了对交换空间性能的担忧，指出在 SSD 上，交换匿名页与回收文件页相当。对于较旧的旋转磁盘，建议使用较低的 `vm.swappiness` 值。此外，作者还强调了 4.0 及更高版本内核中交换空间管理的改进。\n\n文章认为，虽然交换空间可以在接近 OOM 的情况下延长病态行为，但禁用它并不能阻止它。文章建议在 cgroup v2 中使用 `memory.low` 来对交换空间行为进行细粒度控制，允许管理员在内存压力下优先回收某些应用程序。\n\n作者的结论是，拥有更多的交换空间通常比更少好，尤其是在最新的内核上，并提倡机会主义的、主动的内存管理，而不是仅仅依赖 OOM killer。他提到需要更好的内存压力指标，目前正在 Facebook 开发，以促进更明智的调整。"
  },
  {
    "id": "45277052",
    "title": "Knitted Anatomy",
    "url": "https://www.knitted-anatomy.at/cardiovascular-system/",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "针织解剖",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "45324113",
    "title": "European airports race to fix check-in glitch after hacking disruption",
    "url": "https://www.cnn.com/2025/09/21/europe/europe-airports-hack-operations-intl",
    "summary": "European airports, including Heathrow, Berlin, and Brussels, experienced significant disruptions to automatic check-in systems on Saturday due to a hacking incident targeting Collins Aerospace, an RTX-owned provider of check-in and boarding systems. Passengers faced long queues, delays, and cancellations.\n\nWhile the disruption eased significantly by Sunday, some delays persisted, and regional regulators are investigating the source of the hack. RTX identified the issue as a \"cyber-related disruption\" impacting its MUSE software, used by several airlines.\n\nBerlin Brandenburg Airport reported ongoing issues but stated that a manual workaround was in place, minimizing major delays or cancellations. Brussels Airport acknowledged a large impact on its flight schedule, with continued delays and cancellations. Heathrow reported ongoing recovery efforts, noting that most flights continued to operate.\n\nCirium's analysis indicated low delays at Heathrow, moderate delays at Berlin, and significant delays, though decreasing, at Brussels. The incident is the latest in a series of cyberattacks targeting various sectors, highlighting growing concerns about digital security vulnerabilities.\n",
    "chinese_title": "黑客攻击扰乱运营，欧洲机场竞相修复值机故障",
    "chinese_summary": "由于针对RTX旗下科林斯宇航的黑客攻击事件，包括希思罗、柏林和布鲁塞尔在内的欧洲机场的自动值机系统于周六遭遇严重中断。旅客面临长时间排队、延误和取消。\n\n虽然中断情况在周日已显著缓解，但一些延误仍然存在，地区监管机构正在调查此次黑客攻击的来源。RTX公司确认该问题是影响多家航空公司使用的MUSE软件的“网络相关中断”。\n\n柏林勃兰登堡机场报告了持续存在的问题，但表示已采取手动解决方法，从而最大限度地减少了重大延误或取消。布鲁塞尔机场承认其航班时刻表受到重大影响，持续出现延误和取消。希思罗机场报告了持续的恢复工作，并指出大多数航班继续运营。\n\nCirium的分析表明，希思罗机场延误程度较低，柏林机场延误程度中等，布鲁塞尔机场延误程度较高，但呈下降趋势。该事件是近期一系列针对各个行业的网络攻击事件中的最新一起，凸显了人们对数字安全漏洞日益增长的担忧。"
  },
  {
    "id": "45265688",
    "title": "Escapee pregnancy test frogs colonised Wales for 50 years (2019)",
    "url": "https://www.bbc.com/news/uk-wales-44886585",
    "summary": "This article details the story of African clawed frogs, originally used for pregnancy tests, that escaped captivity and established a breeding colony in South Wales for around 50 years. In the early 1960s, these frogs, *Xenopus laevis*, found a suitable habitat in the Bridgend and Vale of Glamorgan areas, with the first sighting recorded in 1966.\n\nScientists and researchers studied the population, even marking and releasing thousands of frogs between 1981 and 2010.  Despite the frogs' ability to survive in the colder climate, there were no conservation concerns raised about them.\n\nBy 2008, the Welsh Government, concerned about the potential spread of the chytrid fungus to native amphibians, initiated an eradication program in 2010. However, before the program could be fully implemented, the frog population mysteriously disappeared.  Researchers believe severe winters in 2009 and 2010, including drought conditions, led to the decimation of tadpole populations and increased cannibalism due to limited food resources.  \n\nWhile trapping efforts continued until 2014, only one frog was captured after 2010.  The Welsh Government believes the frogs have been eradicated from their primary habitat, though acknowledges the possibility of a small, isolated population surviving elsewhere. Despite the lack of recent sightings, surveys haven't been conducted in recent years to definitively confirm their absence.\n",
    "chinese_title": "逃逸验孕蛙在威尔士殖民50年 (2019)",
    "chinese_summary": "本文详述了非洲爪蟾的故事。这种青蛙最初被用于妊娠测试，后来从圈养环境中逃脱，并在南威尔士建立了繁殖地约50年。20世纪60年代初，这些青蛙，*Xenopus laevis*，在布里真德和格拉摩根谷地区找到了适宜的栖息地，1966年首次被记录到。\n\n科学家和研究人员研究了这个种群，甚至在1981年至2010年间标记并释放了数千只青蛙。尽管这些青蛙能够在寒冷的气候中生存，但人们并未对其保护提出任何担忧。\n\n到2008年，威尔士政府担心壶菌可能传播给本地两栖动物，于2010年启动了一项根除计划。然而，在计划完全实施之前，青蛙种群神秘地消失了。研究人员认为，2009年和2010年的严冬，包括干旱条件，导致蝌蚪数量锐减，并由于食物资源有限而加剧了同类相食。\n\n虽然诱捕工作持续到2014年，但在2010年后仅捕获了一只青蛙。威尔士政府认为这些青蛙已从其主要栖息地被根除，但也承认在其他地方可能存在少量孤立的种群。尽管近期缺乏目击记录，但近年来并未进行调查以明确确认它们的消失。"
  },
  {
    "id": "45323752",
    "title": "Dan Brown: The human species has never created a technology it hasn't weaponized",
    "url": "https://english.elpais.com/culture/2025-09-21/dan-brown-the-human-species-has-never-created-a-technology-that-it-hasnt-weaponized.html",
    "summary": "This article is an interview with Dan Brown, author of \"The Da Vinci Code\" and other popular thrillers, discussing his new book, \"The Secret of Secrets,\" and his evolving views on religion, science, and humanity.\n\nBrown's new book delves into human consciousness and near-death experiences, exploring the possibility that consciousness can exist outside the body. This ties into his growing interest in science challenging the spiritual, a shift from the religious themes prominent in his earlier works. He expresses skepticism towards organized religion, drawing from his personal experience of questioning religious dogma as a child.\n\nBrown believes humanity is inherently prone to weaponizing technology, making knowledge dangerous without kindness. He sees evil as less prevalent than love but notes its disproportionate impact when combined with power. He also discusses the conflict between religion and science, suggesting that scientific advancements gradually debunk religious myths.\n\nThe interview touches upon personal aspects of Brown's life, including his divorce and new engagement to a younger woman. He emphasizes his preference for strong, independent women, reflecting the female characters in his novels. He also reveals his affinity for Costa Rica, where he finds a lack of materialism and genuine connection.\n\nUltimately, Brown sees writing as a journey of self-discovery, enabling him to explore complex questions and communicate them in an accessible way. He emphasizes the importance of gratitude, compassion, and embracing doubt in the pursuit of knowledge.\n",
    "chinese_title": "丹·布朗：人类从未创造出未被武器化的科技。",
    "chinese_summary": "本文是对《达芬奇密码》等畅销惊悚小说作者丹·布朗的采访，探讨了他的新书《秘密的秘密》，以及他对宗教、科学和人性的不断演变的看法。\n\n布朗的新书深入探讨了人类意识和濒死体验，探索了意识可能存在于身体之外的可能性。 这与他对科学挑战精神领域日益增长的兴趣有关，这与他早期作品中突出的宗教主题有所转变。 他对有组织的宗教表示怀疑，这源于他小时候对宗教教条的质疑的个人经历。\n\n布朗认为，人类天生容易将技术武器化，使知识在缺乏善良的情况下变得危险。 他认为邪恶不如爱普遍，但指出当邪恶与权力结合时，其影响不成比例。 他还讨论了宗教与科学之间的冲突，认为科学的进步逐渐揭穿了宗教神话。\n\n采访触及了布朗生活的个人方面，包括他的离婚以及与一位年轻女性的新订婚。 他强调了他对坚强、独立的女性的偏爱，这反映了他小说中的女性角色。 他还透露了他对哥斯达黎加的热爱，在那里他发现了缺乏物质主义和真正的联系。\n\n最终，布朗将写作视为自我发现的旅程，使他能够探索复杂的问题并以易于理解的方式进行交流。 他强调在追求知识的过程中，感恩、同情和拥抱怀疑的重要性。"
  },
  {
    "id": "45292404",
    "title": "Newton for Ladies (1737) – Newtonianism vs. Cartesianism",
    "url": "https://www.whipplelib.hps.cam.ac.uk/special/exhibitions-and-displays/exhibitions-archive/newton-and-newtonianism/ladies",
    "summary": "Francesco Algarotti's \"Newton for Ladies\" (1737), written as a dialogue between a narrator and a Marchioness, aims to popularize Newtonianism by \"converting\" the Marchioness from Cartesianism. Modeled after Fontenelle's Cartesian dialogues, the book demonstrates the growing dominance of Newtonian thought. Elizabeth Carter later translated it into English as \"Sir Isaac Newton's theory of light.\"\n\nWhile Algarotti's goal was entertainment and popularization rather than rigorous instruction, evident in the inclusion of poems dedicated to figures like Lady Mary Wortley Montagu, the text focuses on light and color theory, avoiding more complex mechanical aspects of Newtonian physics. This gendering of Newtonianism raises questions about its portrayal of women.\n\nSome argue that the book presents the Marchioness as a passive receiver of knowledge, incapable of grasping complex theories, reinforcing traditional gender roles. Others contend that it demonstrates the possibility for women to be both intellectually curious and fashionable, highlighting a changing social landscape where scientific interest was becoming more acceptable for women. Thus, \"Newton for Ladies\" provides insight into the dissemination of scientific ideas, the evolving role of women in intellectual discourse, and the competition between Cartesian and Newtonian worldviews in the 18th century.\n",
    "chinese_title": "女士的牛顿学 (1737) – 牛顿主义 vs. 笛卡尔主义",
    "chinese_summary": "弗朗切斯科·阿尔加罗蒂的《献给女士的牛顿》（1737年）以叙述者和侯爵夫人对话的形式写成，旨在通过将侯爵夫人从笛卡尔主义“转化”过来，普及牛顿主义。该书模仿丰特奈尔的笛卡尔对话录，展示了牛顿思想日益增长的统治地位。伊丽莎白·卡特后来将其翻译成英文，名为《艾萨克·牛顿爵士的光学理论》。\n\n虽然阿尔加罗蒂的目标是娱乐和普及，而不是严谨的教学，这体现在书中收录了献给玛丽·沃特利·蒙塔古等人物的诗歌，但该文本侧重于光和颜色理论，避免了牛顿物理学中更复杂的机械方面。牛顿主义的这种性别化引发了人们对其女性形象塑造的质疑。\n\n一些人认为，这本书将侯爵夫人描绘成知识的被动接受者，无法掌握复杂的理论，从而强化了传统的性别角色。另一些人则认为，它证明了女性既可以具有求知欲，又可以时尚，突显了社会变革的景象，即科学兴趣对女性来说变得更加可接受。《献给女士的牛顿》因此为了解科学思想的传播、女性在智力讨论中不断变化的角色以及18世纪笛卡尔主义和牛顿主义世界观之间的竞争提供了深刻的见解。"
  },
  {
    "id": "45321663",
    "title": "They Thought They Were Free (1955)",
    "url": "https://press.uchicago.edu/Misc/Chicago/511928.html",
    "summary": "In Milton Mayer's \"They Thought They Were Free,\" a German philologist reflects on how the Nazi regime gradually took hold of German society. He explains that the process was subtle, involving the widening gap between the government and the people through secrecy, emergency measures, and appeals to patriotism. This, coupled with a constant stream of activity and distractions, prevented people from recognizing the fundamental changes occurring around them.\n\nThe philologist admits that even educated individuals, like himself, were caught up in the day-to-day, lacking the time or inclination to think critically about the regime's trajectory. He emphasizes the difficulty of resisting the beginnings of oppression without foreseeing the end, a foresight rarely possessed by ordinary people.\n\nHe recounts how small, incremental steps normalized increasingly oppressive measures, desensitizing the population and making it difficult to pinpoint a moment to take a stand. Uncertainty and the lack of public protest further dissuaded individuals from speaking out, leading to isolation and a gradual erosion of principles.\n\nThe philologist concludes by lamenting the devastating consequences of inaction, highlighting how the regime's final, most horrific acts were only possible due to the accumulated effect of countless smaller compromises. He describes the eventual realization of the full extent of the moral decay, leading to either despair, compromised principles, or a life lived in shame. The judge who acquitted a Jewish man is a specific example of this concept. He also explains that the war gave the government justification to take things further than they ever could have before.\n",
    "chinese_title": "他们以为他们是自由的 (1955)",
    "chinese_summary": "在米尔顿·迈耶的《他们以为自己是自由的》中，一位德国语文学家反思了纳粹政权如何逐渐控制德国社会。他解释说，这个过程是微妙的，涉及通过保密、紧急措施和爱国主义呼吁，扩大政府与人民之间的差距。再加上持续不断的活动和干扰，使人们无法认识到周围发生的根本性变化。\n\n这位语文学家承认，即使像他这样受过教育的人，也陷入了日常事务，缺乏时间和意愿去批判性地思考政权的轨迹。他强调，在没有预见到结局的情况下，很难抵制压迫的开始，而普通人很少具备这种远见。\n\n他回忆说，微小的、渐进式的步骤使日益压迫性的措施正常化，使民众麻木，难以确定采取行动的时机。不确定性和缺乏公众抗议进一步阻止了个人发声，导致孤立和原则的逐渐丧失。\n\n这位语文学家最后感叹了不作为造成的灾难性后果，强调了该政权最终、最可怕的行为之所以成为可能，是因为无数次较小妥协的累积效应。他描述了最终意识到道德堕落的全部程度，导致绝望、原则妥协或生活在羞耻中。赦免一名犹太男子的法官就是这个概念的具体例子。他还解释说，战争为政府提供了借口，使他们能够比以往任何时候都走得更远。"
  },
  {
    "id": "45293012",
    "title": "MapSCII – World map in terminal",
    "url": "https://github.com/rastapasta/mapscii",
    "summary": "MapSCII is a command-line tool that renders a world map in your terminal using Braille and ASCII characters. It allows users to explore a map directly from their console using simple commands or mouse controls (if supported).\n\nKey features include: mouse-driven pan and zoom, point-of-interest discovery, customizable map styling with Mapbox Styles support, connectivity to various vector tile servers (including the optimized OSM2VectorTiles), offline functionality with local VectorTile/MBTiles, and compatibility with most Linux and OSX terminals.\n\nThe tool can be installed globally via `npm` (Node Package Manager) or `snap` (for Linux distributions). Basic usage involves simply running the `mapscii` command in the terminal. Keyboard shortcuts provide navigation and control, with 'q' to quit.\n\nMapSCII leverages various JavaScript libraries for console manipulation (like `x256`, `term-mouse`, and `keypress`), vector tile parsing (`vector-tile`, `pbf`, `mbtiles`), spatial indexing and geometry calculations (`earcut`, `rbush`, `bresenham`, `simplify-js`), and data handling (`node-fetch`).\n\nThe project acknowledges the contributions of lukasmartinelli & manuelroth (OSM2VectorTiles) and mourner (GIS algorithms). Map data uses the Open Data Commons Open Database License (ODbL), and the cartography is licensed under Creative Commons Attribution-ShareAlike 2.0 (CC BY-SA).\n",
    "chinese_title": "MapSCII – 终端中的世界地图",
    "chinese_summary": "MapSCII 是一个命令行工具，它使用盲文和 ASCII 字符在您的终端中渲染世界地图。它允许用户使用简单的命令或鼠标控制（如果支持）直接从控制台浏览地图。\n\n主要功能包括：鼠标驱动的平移和缩放，兴趣点发现，支持 Mapbox Styles 的可自定义地图样式，连接到各种矢量瓦片服务器（包括优化的 OSM2VectorTiles），使用本地 VectorTile/MBTiles 的离线功能，以及与大多数 Linux 和 OSX 终端的兼容性。\n\n该工具可以通过 `npm` (Node Package Manager) 或 `snap`（适用于 Linux 发行版）全局安装。基本用法包括简单地在终端中运行 `mapscii` 命令。键盘快捷键提供导航和控制，按 'q' 退出。\n\nMapSCII 利用各种 JavaScript 库进行控制台操作（如 `x256`、`term-mouse` 和 `keypress`），矢量瓦片解析（`vector-tile`、`pbf`、`mbtiles`），空间索引和几何计算（`earcut`、`rbush`、`bresenham`、`simplify-js`）以及数据处理（`node-fetch`）。\n\n该项目感谢 lukasmartinelli & manuelroth (OSM2VectorTiles) 和 mourner (GIS 算法) 的贡献。地图数据使用开放数据共享通用数据库许可 (ODbL)，制图根据知识共享署名-相同方式共享 2.0 (CC BY-SA) 许可。"
  },
  {
    "id": "45318559",
    "title": "Teen suspect surrenders in 2023 Las Vegas casino cyberattack case",
    "url": "https://www.casino.org/news/teen-suspect-surrenders-in-2023-las-vegas-strip-cyberattack-case/",
    "summary": "A teenage suspect has surrendered to Las Vegas authorities in connection with the 2023 cyberattacks that targeted multiple Las Vegas casino properties, including MGM Resorts International and Caesars Entertainment. The attacks, attributed to the hacker group Scattered Spider, involved vishing to gain access to the casinos' internal systems, causing significant financial losses.\n\nThe suspect, whose name is withheld due to his age, faces six felony charges, including obtaining personal information, extortion, and computer-related offenses. Prosecutors are seeking to try him as an adult. The arrest is part of a broader FBI investigation into similar cyberattacks, which previously led to the indictment of four men.\n\nMGM reportedly refused to pay a ransom, incurring an estimated $100 million in losses and significant system outages. In contrast, Caesars allegedly paid $15 million of a $30 million ransom demand and experienced less disruption.\n",
    "chinese_title": "青少年嫌疑人在2023年拉斯维加斯赌场网络攻击案中自首",
    "chinese_summary": "一名青少年嫌疑犯已向拉斯维加斯当局自首，他涉嫌参与了2023年针对多家拉斯维加斯赌场（包括米高梅国际度假集团和凯撒娱乐）的网络攻击。这些攻击被归咎于黑客组织“分散蜘蛛”，他们通过语音钓鱼获取了赌场内部系统的访问权限，造成了巨大的经济损失。\n\n由于年龄原因，嫌疑人姓名未予公布，他面临六项重罪指控，包括获取个人信息、敲诈勒索和与计算机相关的犯罪行为。检察官正在寻求以成年人身份审判他。这次逮捕是联邦调查局对类似网络攻击进行更广泛调查的一部分，此前该调查导致四名男子被起诉。\n\n据报道，米高梅拒绝支付赎金，损失估计达1亿美元，并遭受了严重的系统中断。相比之下，凯撒据称支付了3000万美元赎金要求中的1500万美元，受到的干扰较小。"
  },
  {
    "id": "45281782",
    "title": "Hololuminescent Display",
    "url": "https://lookingglassfactory.com/hld-overview",
    "summary": "The article introduces Hololuminescent™ Displays (HLD), a new display technology by Looking Glass that creates a holographic illusion of 3D presence from standard 2D video content. HLD aims to bring characters, people, and products to life in a holographic stage without bulky equipment, offering a scalable solution for immersive experiences.\n\nHLDs feature a fixed holographic etched background combined with a high-resolution 4K screen, optimized for showcasing content with depth and dimension. The technology uses standard 2D workflows with background removal, shadows, and reflections to create realistic spatial presence.\n\nThe displays come in three models: 16\", 27\", and 86\", with prices ranging from $1500 to $15000 (with a limited-time 25% pre-order discount). All models are portrait-oriented and offer varying resolutions and thicknesses, with ship dates scheduled for late 2025 and early 2026.\n\nHLD is designed for various applications, including showcasing animated characters in entertainment venues, displaying presenters for remote communication, and transforming product demonstrations in retail settings. It targets installations, integrations, and activations in industries like entertainment, retail, museums, and events. The article also provides a FAQ section addressing general and technical questions about HLD.\n",
    "chinese_title": "全息发光显示器",
    "chinese_summary": "本文介绍了Looking Glass公司的新型显示技术——全息发光™显示器（HLD），该技术能够从标准的2D视频内容中创造出具有3D临场感的全息幻象。HLD旨在无需笨重设备即可在全息舞台上使角色、人物和产品栩栩如生，为沉浸式体验提供可扩展的解决方案。\n\nHLD具有固定的全息蚀刻背景，并结合了高分辨率的4K屏幕，经过优化，可展示具有深度和维度的内容。该技术使用标准的2D工作流程，通过背景移除、阴影和反射来创造逼真的空间存在感。\n\n该显示器有三种型号：16英寸、27英寸和86英寸，价格从1500美元到15000美元不等（限时预购享25%折扣）。所有型号均为纵向显示，并提供不同的分辨率和厚度，预计发货日期为2025年末和2026年初。\n\nHLD专为各种应用而设计，包括在娱乐场所展示动画角色、为远程通信展示演示者以及改变零售环境中的产品演示。其目标是在娱乐、零售、博物馆和活动等行业进行安装、集成和激活。本文还提供了一个FAQ部分，解答关于HLD的常见问题和技术问题。"
  },
  {
    "id": "45313415",
    "title": "Vapor chamber tech keeps iPhone 17 Pro cool",
    "url": "https://spectrum.ieee.org/iphone-17-pro-vapor-chamber",
    "summary": "According to an article in IEEE Spectrum by Gwendolyn Rak, Apple is expected to incorporate vapor chamber cooling technology in the iPhone 17 Pro to manage heat. This will bring Apple in line with competitors like Samsung and Google, who already use similar methods to cool their devices. The article highlights that this cooling tech is likely a more important advancement than superficial changes like a new iPhone color. In essence, the article suggests Apple is prioritizing internal improvements focused on device performance through temperature regulation.\n",
    "chinese_title": "均热板技术让iPhone 17 Pro保持低温",
    "chinese_summary": "苹果预计将在iPhone 17 Pro中采用均热板散热技术以控制温度，据Gwendolyn Rak在IEEE Spectrum上发表的文章称。这将使苹果与三星和谷歌等竞争对手保持一致，这些公司已经使用类似的方法来冷却其设备。文章强调，这种散热技术可能比像新iPhone颜色这样的表面变化更重要。本质上，文章表明苹果正在优先考虑内部改进，专注于通过温度调节来提升设备性能。"
  },
  {
    "id": "45291903",
    "title": "Were RNNs all we needed? A GPU programming perspective",
    "url": "https://dhruvmsheth.github.io/projects/gpu_pogramming_curnn/",
    "summary": "This article summarizes a GPU programming project implementing and benchmarking parallelizable GRU and LSTM models (\"minGRU\" and \"minLSTM\") based on the paper \"Were RNNs All We Needed?\". The core idea is that by simplifying RNN architectures to remove direct dependencies between hidden states, their recurrence can be expressed in a form suitable for parallel scan algorithms, enabling $O(\\log T)$ parallel processing instead of $O(T)$ sequential processing.\n\nThe author compared three implementations: CPU-seq (standard PyTorch loop), CPU-scan (vectorized gate computations but sequential scan), and GPU-scan (custom CUDA implementation with parallel Blelloch scan). Benchmarks on an RTX 4090 showed that for short sequences, CPU-scan was sometimes faster due to optimized BLAS libraries and CUDA overhead. However, for longer sequences ($T > 8192$), the GPU-scan's logarithmic scaling became dominant, achieving a 2x speedup over CPU-scan at $T=65,536$.\n\nGPU kernel profiling with Nsight revealed initial bottlenecks in gate computation, which were addressed by fusing gate computations into a single kernel using shared memory tiling. This shifted the bottleneck to the final output projection layer (matvec_kernel), which the author plans to optimize by replacing multiple kernel launches with a single cuBLAS GEMM call.\n\nThe author concludes that the paper's claims hold up: RNNs can be parallelized through recurrence reformulation, leading to substantial GPU performance gains for long sequences. They also reference criticisms of the paper regarding the models' performance compared to Transformers, and discuss the broader role of architecture in deep learning.\n",
    "chinese_title": "循环神经网络是我们所需要的全部吗？一个GPU编程的视角",
    "chinese_summary": "本文总结了一个GPU编程项目，该项目基于论文“Were RNNs All We Needed?”，实现了并基准测试了可并行化的GRU和LSTM模型（“minGRU”和“minLSTM”）。其核心思想是通过简化RNN架构以消除隐藏状态之间的直接依赖性，它们的递归可以表达为适合并行扫描算法的形式，从而实现$O(\\log T)$的并行处理，而不是$O(T)$的顺序处理。\n\n作者比较了三种实现：CPU-seq（标准PyTorch循环）、CPU-scan（向量化的门计算但顺序扫描）和GPU-scan（带有并行Blelloch扫描的自定义CUDA实现）。在RTX 4090上的基准测试表明，对于短序列，由于优化的BLAS库和CUDA开销，CPU-scan有时更快。然而，对于较长的序列（$T > 8192$），GPU-scan的对数缩放占据主导地位，在$T=65,536$时实现了比CPU-scan快2倍的速度。\n\n使用Nsight进行的GPU内核分析揭示了门计算中的初始瓶颈，这些瓶颈通过使用共享内存平铺将门计算融合到单个内核中得到解决。这使得瓶颈转移到最终的输出投影层（matvec_kernel），作者计划通过用单个cuBLAS GEMM调用替换多个内核启动来优化该层。\n\n作者得出结论，该论文的论点成立：RNN可以通过递归重构进行并行化，从而为长序列带来显着的GPU性能提升。他们还参考了对该论文关于模型性能与Transformer相比的批评，并讨论了架构在深度学习中的更广泛作用。"
  },
  {
    "id": "45312515",
    "title": "Images over DNS",
    "url": "https://dgl.cx/2025/09/images-over-dns",
    "summary": "This article explores the possibility of serving images over DNS TXT records, demonstrating how to bypass the traditional 255-byte limit. The author explains that while individual character strings within a TXT record are limited, multiple strings can be combined, allowing for larger payloads, especially when using TCP instead of UDP for DNS queries. TCP allows for up to 64KB of data compared to UDP's ~1232 bytes.\n\nThe author successfully served an image using Google Public DNS's JSON API and a custom Go server that serves large TXT responses over TCP. The key challenge was handling binary data within the JSON format, which required custom parsing to avoid Base64 encoding overhead. The author demonstrates how to retrieve and reconstruct the image data using `dig` and a Perl script.\n\nThe author highlights the potential security implications of this technique, noting that attackers could tunnel large payloads to browsers via DNS, potentially bypassing DNS filtering, especially with the increasing availability of IP address certificates. The author also discusses the possibility of using DNS recursor caches as a free distributed CDN, though they acknowledge that recursors might implement adaptive TTL limits to prevent abuse. The server-side code was primarily generated by ChatGPT, although the author corrected some errors. The author concludes by framing the project as a 'cute hack', and focuses on the novelty of the idea.\n",
    "chinese_title": "DNS上的图像",
    "chinese_summary": "本文探讨了通过 DNS TXT 记录传输图像的可能性，并展示了如何绕过传统的 255 字节限制。作者解释说，虽然 TXT 记录中的单个字符串受到限制，但可以将多个字符串组合起来，从而允许更大的有效负载，尤其是在使用 TCP 而不是 UDP 进行 DNS 查询时。TCP 允许传输高达 64KB 的数据，而 UDP 只能传输约 1232 字节。\n\n作者成功地使用 Google Public DNS 的 JSON API 和一个自定义的 Go 服务器来提供图像，该服务器通过 TCP 提供大型 TXT 响应。关键挑战在于处理 JSON 格式中的二进制数据，这需要自定义解析以避免 Base64 编码开销。作者演示了如何使用 `dig` 和 Perl 脚本检索和重构图像数据。\n\n作者强调了这种技术的潜在安全隐患，指出攻击者可以通过 DNS 将大型有效负载隧道传输到浏览器，从而可能绕过 DNS 过滤，尤其是在 IP 地址证书日益普及的情况下。作者还讨论了将 DNS 递归缓存用作免费分布式 CDN 的可能性，尽管他们承认递归器可能会实施自适应 TTL 限制以防止滥用。服务器端代码主要由 ChatGPT 生成，但作者纠正了一些错误。作者最后将该项目定义为一种“可爱的黑客行为”，并侧重于该想法的新颖性。"
  },
  {
    "id": "45320734",
    "title": "Examples of Google Gemini Photo Editing Prompts",
    "url": "https://curateclick.com/blog/10-examples-of-google-gemini-photo-editing-prompt",
    "summary": "This article explores the photo editing capabilities of Google Gemini, highlighting how its AI can transform images based on natural language prompts. It emphasizes that clear and specific prompts are crucial for achieving desired results.\n\nThe core of the article provides 10 practical examples of Google Gemini photo editing prompts, complete with before and after images, explanations, and best practices. These examples include:\n\n1.  **3D Figurine:** Transforms a photo into a realistic figurine.\n2.  **Foto Polaroid:** Creates a vintage Polaroid effect.\n3.  **Dramatic Sky Replacement:** Replaces the sky with dramatic cloudscapes.\n4.  **Retro Image For Couples:** Converts couple photos into a 1990s retro movie style.\n5.  **AI Saree:** Drapes the subject in a traditional Indian saree.\n6.  **Hyper-Realistic Artwork:** Enhances photos to achieve hyper-realistic artwork quality.\n7.  **Put This Shirt On Him:** Replaces clothing while maintaining a realistic fit.\n8.  **Makeup Analysis + Optimization Suggestions:** Provides visual feedback and suggestions for makeup improvement.\n9.  **Doodle Overlay:** Adds creative hand-drawn elements to photos.\n10. **Reference For Posture:** Transfers poses between different images.\n\nThe article also offers advanced tips for better results, including iterative refinement, combining multiple techniques, prompt optimization strategies, and batch processing recommendations. It stresses the importance of starting with high-quality original images and being specific with prompts for the best outcomes. Finally, it refers readers to nano banana prompts and tutorials for more inspiration.\n",
    "chinese_title": "Google Gemini 照片编辑提示示例",
    "chinese_summary": "本文探讨了 Google Gemini 的照片编辑功能，重点介绍了其 AI 如何根据自然语言提示转换图像。文章强调，清晰而具体的提示对于获得理想效果至关重要。\n\n文章的核心部分提供了 10 个 Google Gemini 照片编辑提示的实用示例，包括编辑前后的图像、解释和最佳实践。这些例子包括：\n\n1. **3D 手办：** 将照片转换为逼真的手办。\n2. **宝丽来照片：** 创建复古宝丽来效果。\n3. **戏剧性天空替换：** 用戏剧性的云景替换天空。\n4. **情侣复古照片：** 将情侣照片转换为 20 世纪 90 年代的复古电影风格。\n5. **AI 纱丽：** 为照片中的人物披上传统的印度纱丽。\n6. **超现实主义艺术品：** 增强照片以达到超现实主义艺术品的质量。\n7. **给他穿上这件衬衫：** 更换服装，同时保持逼真的贴合度。\n8. **妆容分析 + 优化建议：** 提供视觉反馈和改进妆容的建议。\n9. **涂鸦叠加：** 为照片添加创意手绘元素。\n10. **姿势参考：** 在不同的图像之间转移姿势。\n\n文章还提供了获得更好效果的高级技巧，包括迭代优化、结合多种技术、提示优化策略和批量处理建议。文章强调，从高质量的原始图像开始，并针对提示进行具体说明，对于获得最佳效果至关重要。最后，文章建议读者参考 nano banana 的提示和教程以获取更多灵感。"
  },
  {
    "id": "45322101",
    "title": "That DEA agent's 'credit card' could be eavesdropping on you",
    "url": "https://www.independent.co.uk/news/world/americas/dea-surveillance-hidden-cameras-federal-law-enforcement-b2828606.html",
    "summary": "The Drug Enforcement Administration (DEA) is expanding its covert surveillance tactics, now equipping agents with audio-video recorders disguised as credit cards. Procurement data reveals the DEA purchased 57 of these devices from a Swiss company, Nagra: 30 with both audio and video capabilities and 27 with audio-only. These recorders are designed to look like everyday credit cards, complete with customizable printed overlays to pass close inspection. They feature 16GB of memory, a built-in microphone, and a lithium battery.\n\nWhile the DEA hasn't specified the intended use of the devices, past operations suggest potential applications in undercover operations, citing a 2022 arrest where an alleged Yakuza leader was lured to a meeting. The purchase also includes badge holders, hinting at potential use as disguised ID cards.\n\nThis purchase is part of a broader pattern of the DEA using unconventional surveillance methods. Previously, the agency has concealed cameras in items like streetlights, toolboxes, and vacuum cleaners, highlighting a continuous effort to enhance their surveillance capabilities. The article notes the DEA's increasing focus on assisting Immigration and Customs Enforcement in deportation efforts. The agency has not responded to requests for comment.\n",
    "chinese_title": "那个缉毒署探员的“信用卡”可能正在窃听你",
    "chinese_summary": "缉毒局购入信用卡式秘密录音录像设备，扩大隐蔽监控范围。采购数据显示，缉毒局从瑞士Nagra公司购买了57台此类设备：30台具备录音录像功能，27台仅具备录音功能。这些录音设备外观与普通信用卡无异，可定制印刷覆膜以通过近距离检查。它们配备16GB内存、内置麦克风和锂电池。\n\n虽然缉毒局未明确说明这些设备的用途，但过往行动表明，它们可能被用于卧底行动，例如2022年逮捕一名被指控的雅库扎头目，他被诱骗至一场会面。此次采购还包括证件夹，暗示可能用作伪装身份证。\n\n此次采购是缉毒局使用非常规监控方法这一更大趋势的一部分。此前，该机构曾将摄像头隐藏在路灯、工具箱和吸尘器等物品中，突显了其不断增强监控能力的努力。文章指出，缉毒局正日益侧重于协助移民和海关执法局进行驱逐行动。该机构尚未回应置评请求。"
  },
  {
    "id": "45316744",
    "title": "A revolution in English bell ringing",
    "url": "https://harpers.org/archive/2025/10/a-change-of-tune-veronique-greenwood-bell-ringing/",
    "summary": "This article, \"A Revolution in English Bell Ringing\" by Veronique Greenwood, likely discusses significant changes happening in the traditional English practice of bell ringing. The article, slated for the October 2025 issue, suggests a transformative shift, potentially affecting the methods, technology, or cultural aspects of the art form.\n\nGiven Veronique Greenwood's background as both a writer and a bell ringer living in England, she brings a knowledgeable and potentially personal perspective to the topic. The tags \"Bell ringing\" and \"England\" explicitly define the article's scope and geographical focus.\n\nThe presence of \"Adjust\" and \"Share\" buttons indicates the article is designed to be interactive and encourages readers to engage with the content and disseminate it to others.\n\nIn essence, the article promises to explore a groundbreaking evolution within English bell ringing, delivered by an author intimately familiar with the subject.\n",
    "chinese_title": "英式钟乐的革新",
    "chinese_summary": "薇罗妮克·格林伍德的文章《英国钟乐变革》很可能探讨了英国传统钟乐演奏发生的重大变化。这篇文章计划在2025年10月刊发表，预示着一场变革性的转变，可能会影响这种艺术形式的方法、技术或文化层面。\n\n鉴于薇罗妮克·格林伍德作为作家和居住在英国的钟乐演奏者的背景，她对该主题带来了知识渊博且可能带有个人视角的观点。“钟乐”和“英国”的标签明确定义了文章的范围和地域重点。\n\n“调整”和“分享”按钮的存在表明该文章旨在具有互动性，并鼓励读者参与内容并将其传播给他人。\n\n本质上，这篇文章承诺探索英国钟乐演奏的开创性演变，作者对该主题非常熟悉。"
  },
  {
    "id": "45323831",
    "title": "Clean hydrogen is facing a big reality check",
    "url": "https://www.technologyreview.com/2025/09/18/1123818/hydrogen-reality-check-china/",
    "summary": "The article \"Clean Hydrogen is Facing a Big Reality Check\" highlights the complexities and challenges currently impacting the clean hydrogen industry. While hydrogen is touted as a key component for the energy transition, the International Energy Agency (IEA) reports that expectations for clean hydrogen production by 2030 are shrinking due to project cancellations and delays, particularly in the US and Europe.\n\nThe article emphasizes three key points:\n\n1.  **Shrinking Expectations:** The IEA has revised its 2030 clean hydrogen production forecast downwards from 49 million metric tons to 37 million metric tons annually, citing cancelled electrolysis and carbon capture projects in various regions.\n2.  **China's Dominance:** China is a leading force in electrolyzer manufacturing and development, accounting for a significant portion of global capacity. The country is poised to produce cost-competitive green hydrogen by the end of the decade, potentially making it an attractive alternative to fossil fuel-based hydrogen.\n3.  **Southeast Asia as an Emerging Market:** Southeast Asia presents a promising market for low-emissions hydrogen due to its growing economy, energy demand, and existing hydrogen usage in industries like oil refining and chemicals. The region's major shipping industry also offers potential for hydrogen-based fuels.\n\nOverall, the article suggests that the clean hydrogen industry is facing a reality check, and the next few years will be critical to determining its viability and success in meeting ambitious climate goals.\n",
    "chinese_title": "清洁氢正面临严峻的现实检验。",
    "chinese_summary": "文章《清洁氢能正面临严峻的现实检验》强调了当前影响清洁氢能行业的复杂性和挑战。尽管氢能被誉为能源转型的关键组成部分，但国际能源署（IEA）报告称，由于项目取消和延误，特别是美国和欧洲，对2030年清洁氢能产量的预期正在缩减。\n\n文章强调了三个要点：\n\n1.  **预期缩减：** 国际能源署已将其2030年清洁氢能产量预测从每年4900万吨下调至3700万吨，理由是多个地区取消了电解和碳捕获项目。\n2.  **中国的主导地位：** 中国是电解槽制造和开发领域的领先力量，占全球产能的很大一部分。到本十年末，中国有望生产出具有成本竞争力的绿色氢能，这可能使其成为化石燃料制氢的有吸引力的替代品。\n3.  **东南亚作为新兴市场：** 东南亚因其不断增长的经济、能源需求以及石油炼制和化工等行业中现有的氢能使用，为低排放氢能提供了一个有希望的市场。该地区主要的航运业也为氢能燃料提供了潜力。\n\n总的来说，文章表明清洁氢能行业正面临现实检验，未来几年对于确定其可行性和成功实现雄心勃勃的气候目标至关重要。"
  },
  {
    "id": "45317526",
    "title": "A brief history of threads and threading",
    "url": "https://eclecticlight.co/2025/09/20/a-brief-history-of-threads-and-threading/",
    "summary": "This article provides a historical overview of threads and threading on macOS, starting with the limitations of the original 1984 Macintosh and its single processor. It traces the evolution from running only one application at a time to today's Macs that can handle multiple applications and background tasks simultaneously, thanks to multi-core processors.\n\nThe article highlights the shift from Andy Hertzfeld's Switcher to MultiFinder, which introduced cooperative multitasking in classic Mac OS, a method of rapidly switching between programs to create the illusion of simultaneous operation. This was followed by the introduction of preemptive multitasking with A/UX and later in System 7.5.3, addressing the issue of poorly behaved tasks hogging the processor.\n\nThe introduction of multi-core processors in 2000 with the PowerPC G4 marked a turning point, enabling the use of various thread types (Mach, POSIX, Java, Cocoa) for managing processing across multiple cores. Processes, threads, and tasks are clearly defined within the macOS environment.\n\nA major advancement came with Grand Central Dispatch (GCD) in Mac OS X 10.6 Snow Leopard, a dispatcher managing queues of tasks and optimizing their execution on multi-core systems. With Apple silicon Macs, GCD now manages threads for performance (P) and efficiency (E) cores, prioritizing tasks based on Quality of Service (QoS).\n\nIn summary, the article chronicles the journey from single-tasking to the sophisticated threading capabilities of modern macOS, allowing for optimal performance from multiple tasks and processes across multi-core processors.\n",
    "chinese_title": "线程及线程简史",
    "chinese_summary": "本文概述了macOS上线程和线程的历史发展，从1984年初代 Macintosh 及其单处理器的局限性开始。它追溯了从一次只能运行一个应用程序到如今的Mac可以同时处理多个应用程序和后台任务的演变，这得益于多核处理器。\n\n文章重点介绍了从Andy Hertzfeld的Switcher到MultiFinder的转变，后者在经典Mac OS中引入了协作式多任务处理，这是一种在程序之间快速切换以产生同时运行的错觉的方法。随后，A/UX以及后来的System 7.5.3引入了抢占式多任务处理，解决了行为不端的任务占用处理器的问题。\n\n2000年PowerPC G4中多核处理器的引入标志着一个转折点，它可以使用各种线程类型（Mach、POSIX、Java、Cocoa）来管理跨多个内核的处理。进程、线程和任务在macOS环境中得到了明确的定义。\n\nMac OS X 10.6 Snow Leopard中的Grand Central Dispatch（GCD）是一项重大进步，它是一个调度器，用于管理任务队列并优化它们在多核系统上的执行。随着Apple Silicon Mac的出现，GCD现在管理性能（P）和效率（E）内核的线程，并根据服务质量（QoS）对任务进行优先级排序。\n\n总而言之，本文记录了从单任务到现代macOS复杂线程功能的演变过程，从而可以优化多核处理器上多个任务和进程的性能。"
  },
  {
    "id": "45263035",
    "title": "I’m Not a Robot",
    "url": "https://neal.fun/not-a-robot/",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "我不是机器人",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "45285711",
    "title": "Evals in 2025: going beyond simple benchmarks to build models people can use",
    "url": "https://github.com/huggingface/evaluation-guidebook/blob/main/yearly_dives/2025-evaluations-for-useful-models.md",
    "summary": "This article, \"Evals in 2025: going beyond simple benchmarks to build models people can use,\" likely discusses the future of evaluating machine learning models, particularly large language models (LLMs), with a focus on moving beyond simple benchmark scores to build models that are truly useful in real-world scenarios.\n\nThe core idea is that current evaluation methods are insufficient. The article probably argues that simple benchmarks can be easily gamed and don't accurately reflect a model's performance on complex, nuanced tasks that humans encounter. It advocates for a more holistic approach to evaluation, encompassing:\n\n*   **Real-world application focus:** Emphasizing evaluation based on how well models perform in practical use cases and user-centric scenarios.\n*   **Beyond single metrics:**  Moving away from relying solely on single-number scores and towards analyzing various aspects of model performance, such as reliability, safety, fairness, and explainability.\n*   **Human-centered evaluation:** Incorporating human feedback and judgment into the evaluation process to assess model usability and alignment with human values.\n*   **More robust and comprehensive evaluation suites:** Implementing more comprehensive evaluation suites that cover a wider range of tasks, edge cases, and adversarial scenarios.\n*   **Focus on reliability and safety:** Giving greater attention to issues like hallucination, bias, and harmful outputs to ensure models are safe and dependable.\n\nIn essence, the article highlights the need for a paradigm shift in model evaluation, shifting from a focus on achieving high scores on static benchmarks to building and evaluating models that are truly useful, reliable, and beneficial for people in 2025 and beyond. The use of \"evaluation-guidebook\" in the Github repository name suggests a practical guide or framework for implementing these evolved evaluation methods.\n",
    "chinese_title": "2025年评估：超越简单基准，构建人们可用的模型",
    "chinese_summary": "2025年的评估：超越简单基准，构建人们可用的模型"
  },
  {
    "id": "45287838",
    "title": "After Babel Fish: The promise of cheap translations at the speed of the Web",
    "url": "https://hedgehogreview.com/issues/lessons-of-babel/articles/after-babel-fish",
    "summary": "This article explores the evolution of machine translation (MT), starting with the early promise and pitfalls of AltaVista's Babel Fish. While Babel Fish offered free, instant translations, its inaccuracies, as highlighted by Umberto Eco, demonstrated the limitations of mechanical synonym-swapping and the importance of context and \"world knowledge\" in effective translation.\n\nThe article then discusses the advancements in MT, particularly with Google Translate's statistical approach and the subsequent neural net upgrade and generative AI, leading to claims that MT is \"almost a solved problem\" for high-resource languages like English and Spanish. However, it cautions against overblown expectations, noting limitations in handling the vast number of global languages, the scarcity of training data for many, and persistent errors in longer texts, idiomatic expressions, and sensitive grammatical matters.\n\nThe author acknowledges the convenience and increasing accuracy of MT for everyday use, especially in routine tasks, but expresses reservations about the industry's push to replace human translators entirely. While MT excels at automating repeatable processes, complex translation requires human nuance, contextual understanding, and cultural awareness. The article warns against viewing translation as a task \"fit only for machines\" and emphasizes the enduring value of human expertise in ensuring accurate and meaningful communication across languages and cultures.\n",
    "chinese_title": "巴别鱼之后：网络速度下的廉价翻译前景",
    "chinese_summary": "本文探讨了机器翻译（MT）的演变，从AltaVista的Babel Fish早期的承诺和缺陷开始。尽管Babel Fish提供了免费、即时的翻译，但正如翁贝托·埃科所强调的那样，其不准确性表明了机械同义词替换的局限性，以及在有效翻译中上下文和“世界知识”的重要性。\n\n文章随后讨论了机器翻译的进步，特别是谷歌翻译的统计方法以及随后的神经网络升级和生成式人工智能，从而导致人们声称机器翻译对于像英语和西班牙语这样的高资源语言来说“几乎是一个已解决的问题”。然而，文章告诫人们不要抱有过高的期望，并指出在处理大量全球语言、许多语言的训练数据稀缺以及较长文本、习语表达和敏感语法问题中存在的持续性错误。\n\n作者承认机器翻译在日常使用中的便利性和日益提高的准确性，尤其是在例行任务中，但对行业推动完全取代人工翻译的做法表示保留。虽然机器翻译擅长自动化可重复的流程，但复杂的翻译需要人类的细微差别、情境理解和文化意识。文章警告说，不要将翻译视为一项“只适合机器”的任务，并强调人类专业知识在确保跨语言和文化的准确和有意义的沟通方面的持久价值。"
  },
  {
    "id": "45295475",
    "title": "Mesda Craftsman Database",
    "url": "http://test0.dlibrary.org/en/nodes/4066-craftsman-database",
    "summary": "The MESDA Craftsman Database is a valuable resource containing information about artisans in the early South (Maryland, Virginia, the Carolinas, Georgia, Kentucky, and Tennessee) before 1861. Gathered from primary sources like newspapers, directories, court records, and private papers, the database documents artisans across 127 trades. Records vary in detail, offering insights into their work, land transactions, vital statistics, production methods, and sales.\n\nThe database aims to collect and make accessible data on artisans' lives and work habits and has informed numerous museum exhibitions, articles, and books. A unique aspect of the database is its inclusive approach, documenting women and African Americans (enslaved and free) and providing information to help track the migration of craftsmen.\n\nWhile primarily focused on the early South, the database includes some craftsmen from New England and the Mid-Atlantic states, primarily drawn from city directories. MESDA is continuously expanding the database and is only halfway through surveying existing documents. The included information is only the first page of the results of the database that contains 50 results, the database can show up to 200 results per page.\n",
    "chinese_title": "Mesda 工匠数据库",
    "chinese_summary": "MESDA工匠数据库是一个宝贵的资源，包含1861年前南方早期（马里兰州、弗吉尼亚州、南北卡罗来纳州、佐治亚州、肯塔基州和田纳西州）工匠的信息。该数据库从报纸、名录、法院记录和私人文件等原始资料中收集，记录了127个行业的工匠信息。记录详细程度各异，提供了关于他们的工作、土地交易、重要统计数据、生产方法和销售的见解。\n\n该数据库旨在收集并提供关于工匠生活和工作习惯的数据，并为众多博物馆展览、文章和书籍提供了信息。该数据库的一个独特之处在于其包容性方法，记录了妇女和非裔美国人（奴隶和自由人）的信息，并提供信息以帮助追踪工匠的迁徙。\n\n虽然主要关注南方早期，但该数据库也包含一些来自新英格兰和大西洋中部各州的工匠，主要来自城市名录。MESDA正在不断扩充数据库，目前仅完成现有文件调查的一半。包含的信息只是包含50个结果的数据库结果的第一页，数据库每页最多可以显示200个结果。"
  },
  {
    "id": "45310529",
    "title": "If you are good at code review, you will be good at using AI agents",
    "url": "https://www.seangoedecke.com/ai-agents-and-code-review/",
    "summary": "This article argues that strong code review skills are crucial for effectively using AI coding agents like Claude Code, Codex, and Copilot. While these tools can generate a lot of code, they often lack the judgment of experienced software engineers and can lead to suboptimal design choices.\n\nThe author illustrates this with examples from their own projects, where AI agents proposed overly complex solutions like reverse-engineering existing code or implementing full background job infrastructures when simpler alternatives were available. These situations highlight the need for human oversight to steer the AI towards more efficient and maintainable solutions.\n\nThe core of effective AI agent use lies in structural code review: focusing not just on the code written, but on the code that *could* have been written. This involves looking beyond the immediate changes and considering the broader codebase context to identify opportunities for simplification, reuse, and better architectural choices. A nitpicky reviewer risks getting bogged down in minor details while missing the bigger picture, while a rubber-stamp reviewer trusts the AI too much.\n\nThe author believes we're in a \"centaur chess\" model where humans and AI work together, and code review is the key skill for successfully guiding these agents. It's not about blindly adopting AI everywhere, but about intelligently supervising and directing it, much like guiding a junior engineer. They also ponder whether the current rapid advancement of AI tools can be compared to the growth of a human software engineer in terms of experience and effectiveness.\n",
    "chinese_title": "如果你擅长代码审查，你也会擅长使用AI代理。",
    "chinese_summary": "强大的代码审查能力是有效使用AI编码助手（如Claude Code、Codex和Copilot）的关键。本文认为，虽然这些工具可以生成大量代码，但它们往往缺乏经验丰富的软件工程师的判断力，并可能导致次优的设计选择。\n\n作者通过其自身项目的例子说明了这一点，在这些项目中，AI助手提出了过于复杂的解决方案，例如逆向工程现有代码或在可以使用更简单替代方案时实施完整的后台作业基础设施。这些情况凸显了需要人工监督来引导AI朝着更高效和可维护的解决方案发展。\n\n有效使用AI助手的核心在于结构化代码审查：不仅要关注编写的代码，还要关注*可以*编写的代码。这涉及超越直接的更改，并考虑更广泛的代码库上下文，以识别简化、重用和更好架构选择的机会。吹毛求疵的审查者可能会陷入细枝末节，而忽略了更大的图景，而橡皮图章式的审查者则过于信任AI。\n\n作者认为我们正处于“人机混合象棋”模式中，人类和AI协同工作，而代码审查是成功指导这些助手的关键技能。这并非盲目地在所有地方采用AI，而是像指导初级工程师一样，对其进行智能的监督和指导。他们还思考了当前AI工具的快速发展是否可以与人类软件工程师在经验和效率方面的增长相提并论。"
  },
  {
    "id": "45270861",
    "title": "Hyperion: Minecraft game engine for custom events",
    "url": "https://hyperion.rs/",
    "summary": "Hyperion is a Minecraft game engine designed for running large-scale, custom events reliably. Its key strength is its stability, stemming from being built in Rust. This allows event organizers to be highly confident that their events won't be interrupted by common issues like memory leaks or segmentation faults (SEGFAULTS) that can plague other systems. In essence, Hyperion prioritizes stability and robustness for large, custom Minecraft event management.\n",
    "chinese_title": "许珀里翁：用于自定义事件的 Minecraft 游戏引擎",
    "chinese_summary": "Hyperion：为大规模定制活动稳定运行而设计的Minecraft游戏引擎。其核心优势在于稳定性，源于使用Rust构建。这使得活动组织者可以高度确信他们的活动不会被内存泄漏或段错误等常见问题中断，这些问题可能会困扰其他系统。本质上，Hyperion优先考虑大型定制Minecraft活动管理的稳定性和健壮性。"
  },
  {
    "id": "45275058",
    "title": "Claude can sometimes prove it",
    "url": "https://www.galois.com/articles/claude-can-sometimes-prove-it",
    "summary": "Mike Dodds' article \"Claude Can (Sometimes) Prove It\" discusses the surprising ability of Anthropic's Claude Code, an AI coding agent, to perform interactive theorem proving (ITP) using tools like Lean. While ITP is typically challenging even for experts due to its complexity and pedantry, Claude Code demonstrates proficiency in completing complex proof steps.\n\nDodds highlights that ITP demands various skills beyond just proving theorems, including conceptual mathematics, mapping concepts into Lean, decomposing theorems, and debugging failures – resembling \"proof engineering.\" He contrasts this with automated reasoning tools like SMT solvers, which are restricted in scope but highly automated.\n\nClaude Code, unlike simple chatbots, can break down complex tasks into sub-tasks, making it suitable for software engineering and, surprisingly, ITP. It can analyze code, run tools, and propose solutions, iterating based on feedback from the Lean compiler. This iterative process, where the agent attempts, fails, and corrects itself, contributes to its success.\n\nDodds successfully used Claude Code to formalize a research paper in Lean, acting as a \"project manager\" to guide the agent. While the agent could work on various levels of the formalization process, including refactoring, Dodds notes that the AI-assisted formalization was slower than manual work due to issues like thrashing, persistent mistakes, and the agent's tendency to get stuck. However, he suggests better tools could mitigate these issues. He concludes that despite its limitations, Claude Code's ability to perform ITP is promising and suggests a shift towards designing tools specifically for AI agents, focusing on providing detailed feedback rather than avoiding failures.\n",
    "chinese_title": "克劳德有时可以证明这一点。",
    "chinese_summary": "迈克·多兹的文章《克劳德（有时）可以证明它》探讨了Anthropic公司的Claude Code，一种AI编码代理，在交互式定理证明（ITP）方面的惊人能力，它可以使用像Lean这样的工具。虽然ITP通常具有复杂性和吹毛求疵的特点，即使对于专家来说也极具挑战性，但Claude Code却表现出完成复杂证明步骤的能力。\n\n多兹强调，ITP除了证明定理之外，还需要各种技能，包括概念数学、将概念映射到Lean、分解定理和调试失败——类似于“证明工程”。他将此与SMT求解器等自动化推理工具进行了对比，后者范围有限但高度自动化。\n\nClaude Code不同于简单的聊天机器人，它可以将复杂的任务分解为子任务，使其适用于软件工程，并且令人惊讶地适用于ITP。它可以分析代码、运行工具并提出解决方案，根据Lean编译器的反馈进行迭代。这种迭代过程，即代理尝试、失败并自我纠正，是其成功的原因。\n\n多兹成功地使用Claude Code在Lean中形式化了一篇研究论文，充当“项目经理”来指导代理。虽然代理可以在形式化过程的各个级别工作，包括重构，但多兹指出，由于诸如抖动、持续性错误以及代理容易卡住等问题，AI辅助形式化比手动工作慢。然而，他认为更好的工具可以缓解这些问题。他总结说，尽管存在局限性，但Claude Code执行ITP的能力很有希望，并建议转向专门为AI代理设计工具，重点是提供详细的反馈，而不是避免失败。"
  },
  {
    "id": "45321949",
    "title": "Yangwang U9 Xtreme hits 308mph(496km/h), becomes fastest production car",
    "url": "https://www.topgear.com/car-news/electric/yangwang-u9-xtreme-hits-308mph-becomes-worlds-fastest-ever-production-car",
    "summary": "This article presents two distinct pieces of automotive news. The first, and headline grabbing, claim is that the Yangwang U9 Xtreme, a production car, has reached a top speed of 308 mph (496 km/h). If verified, this would make it the fastest production car in the world. While the article mentions this achievement, it provides no details on the location, conditions, or official verification process.\n\nThe second part of the article shifts focus to a review of \"Formula Legends,\" likely a game, documentary, or other media related to retro Formula 1 racing. The article describes this source as a \"treasure trove,\" suggesting it contains significant and valuable information about older F1 racing cars, drivers, and events. However, the review provides no specific details about the content of \"Formula Legends.\" The focus is on its overall worth and potential value for enthusiasts of classic F1 racing.\n",
    "chinese_title": "仰望U9 Xtreme 极速达496公里/小时，成为最快量产车",
    "chinese_summary": "本文介绍了两个不同的汽车新闻。第一个引人注目的消息是量产车仰望U9 Xtreme达到了308英里/小时（496公里/小时）的最高速度。如果得到验证，这将使其成为世界上最快的量产车。 虽然文章提到了这一成就，但没有提供有关地点、条件或官方验证过程的详细信息。\n\n文章的第二部分将重点转移到对“方程式传奇”的评论上，这很可能是一款与复古一级方程式赛车相关的游戏、纪录片或其他媒体。文章将此来源描述为“宝库”，表明它包含有关旧式F1赛车、车手和赛事的重要且有价值的信息。但是，该评论没有提供有关“方程式传奇”内容的具体细节。重点在于其整体价值以及对经典F1赛车爱好者的潜在价值。"
  },
  {
    "id": "45313557",
    "title": "Cormac McCarthy's tips on how to write a science paper (2019) [pdf]",
    "url": "https://gwern.net/doc/science/2019-savage.pdf",
    "summary": "It's impossible to summarize the content of the provided text. The document appears to be a PDF file represented in a raw, encoded format (likely including FlateDecode and DCTDecode filters for compression). This format isn't human-readable and contains instructions for how a PDF reader should interpret and render the file, not the actual text of the article itself. Without a tool to properly decode and interpret the PDF structure, one cannot extract the supposed tips from Cormac McCarthy on writing a science paper.\n",
    "chinese_title": "科马克·麦卡锡关于如何撰写科学论文的建议 (2019) [pdf]",
    "chinese_summary": "无法总结所提供文本的内容。该文档似乎是以原始、编码格式表示的PDF文件（可能包括用于压缩的FlateDecode和DCTDecode过滤器）。这种格式并非人类可读，并且包含PDF阅读器应如何解释和渲染文件的指令，而不是文章本身的实际文本。如果没有工具来正确解码和解释PDF结构，就无法从科马克·麦卡锡那里提取关于撰写科学论文的所谓技巧。"
  },
  {
    "id": "45313418",
    "title": "Living microbial cement supercapacitors with reactivatable energy storage",
    "url": "https://www.cell.com/cell-reports-physical-science/fulltext/S2666-3864(25)00409-6",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "具有可再激活能量存储的活性微生物水泥超级电容器",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "45319463",
    "title": "Amazon to end commingling after years of complaints from brands and sellers",
    "url": "https://www.modernretail.co/operations/amazon-to-end-commingling-program-after-years-of-complaints-from-brands-and-sellers/",
    "summary": "Amazon is ending its \"commingling\" program, a long-standing practice of pooling identical items from different sellers under a single barcode, after years of complaints from brands and sellers. The decision, announced at the Amazon Accelerate seller conference, was met with significant applause.\n\nCommingling, intended to speed deliveries and save warehouse space, had allowed counterfeit or expired goods to be mixed with authentic items, damaging brand reputations and making it difficult to trace problems back to specific sellers. Ending the practice signals Amazon's commitment to brand protection and a move away from resellers.\n\nAmazon executives stated that the economics of commingling no longer made sense due to advancements in their logistics network. The company estimated brand owners spent $600 million annually re-stickering products due to the commingling system. Now, with faster shipping speeds achievable without pooling inventory, resources can be reinvested in seller growth.\n\nIndustry analysts like Ben Donovan from Marketplace Pulse view this as a significant step in supporting brands, making Amazon a tougher environment for resellers. This move aligns with Amazon's strategy of prioritizing direct partnerships with major brands, exemplified by the resumed wholesale partnership with Nike, which restricts independent resellers from listing certain Nike items.\n\nWhile Amazon heavily promoted its new AI-powered seller assistant, the decision to end commingling resonated more strongly with sellers. The phasing out of commingling is scheduled for later this year.\n",
    "chinese_title": "亚马逊将停止混储，此前品牌和卖家已投诉多年。",
    "chinese_summary": "亚马逊将停止其“混储”计划。该计划长期以来将不同卖家的相同商品混合存放于同一条形码下，多年来一直受到品牌和卖家的诟病。该决定在亚马逊加速卖家大会上宣布，获得了热烈掌声。\n\n混储旨在加快交付速度并节省仓库空间，但却导致假冒或过期商品与正品混杂，损害了品牌声誉，并使追踪问题到特定卖家变得困难。结束该做法标志着亚马逊对品牌保护的承诺，以及摆脱转售商的举措。\n\n亚马逊高管表示，由于物流网络的进步，混储的经济效益已不再有意义。该公司估计，由于混储系统，品牌所有者每年花费 6 亿美元重新粘贴产品标签。现在，在无需混合库存的情况下即可实现更快的运输速度，资源可以重新投资于卖家的增长。\n\nMarketplace Pulse 的 Ben Donovan 等行业分析师认为，这是支持品牌的重要一步，使亚马逊成为对转售商更严峻的环境。这一举措符合亚马逊优先发展与主要品牌直接合作的战略，耐克恢复批发合作伙伴关系就是例证，该合作限制了独立转售商销售某些耐克商品。\n\n虽然亚马逊大力推广其全新的人工智能卖家助手，但结束混储的决定在卖家中引起了更强烈的共鸣。混储的逐步淘汰计划定于今年晚些时候进行。"
  },
  {
    "id": "45320759",
    "title": "Universities should be more than toll gates",
    "url": "https://www.waliddib.com/posts/universities-should-be-more-than-toll-gates/",
    "summary": "The author reflects on their Environmental Engineering education in Jordan, arguing that it functioned more as a credentialing process (\"toll gate\") than a genuine learning experience. They criticize the rote memorization emphasis, useless mandatory courses, and the university's role as a \"labor conveyor belt\" to Germany. A stark contrast is drawn between their uninspired university experience and the passionate learning environment they encountered during a foreign exchange program in Germany.\n\nYears later, inspired by Harvard's CS50 course, the author rediscovered a love for learning independently, exploring computer science, Arduino, game development, and API creation out of pure curiosity. However, this self-directed learning also brought frustration and a feeling of inadequacy due to the vastness of knowledge.\n\nUltimately, the author reframes their perspective on learning. They embrace the imperfect nature of self-education, accepting forgetting and losing track as part of the process. They conclude that the joy of discovery and the pursuit of new knowledge is the primary goal, and aspire to achieve financial freedom to design their own lifelong curriculum, learning on their own terms. The author's experience highlights a critique of university systems that prioritize credentialing over genuine understanding and the potential for passionate, self-directed learning.\n",
    "chinese_title": "大学不应只是收费站",
    "chinese_summary": "作者反思其在约旦的环境工程教育经历，认为其更像是一个资格认证过程（“收费站”），而非真正的学习体验。他们批判了死记硬背的强调、无用的必修课程，以及大学作为输送劳动力到德国的“劳务传送带”的角色。他们的大学经历毫无启发性，这与他们在德国海外交流项目中所遇到的充满激情的学习环境形成了鲜明对比。\n\n多年以后，受到哈佛CS50课程的启发，作者重新发现了独立学习的热爱，出于纯粹的好奇心探索了计算机科学、Arduino、游戏开发和API创建。然而，这种自主学习也带来了挫折感和因知识浩瀚而产生的不足感。\n\n最终，作者重塑了他们对学习的看法。他们拥抱了自我教育的不完美性，接受遗忘和迷失方向是过程的一部分。他们得出结论，发现的乐趣和对新知识的追求才是主要目标，并渴望实现财务自由，以设计自己的终身课程，按照自己的方式学习。作者的经历突显了对大学体制的批判，即优先考虑资格认证而非真正的理解，以及充满激情、自主学习的潜力。"
  },
  {
    "id": "45283887",
    "title": "Slack has raised our charges by $195k per year",
    "url": "https://skyfall.dev/posts/slack",
    "summary": "Hack Club, a nonprofit providing coding education to teenagers, faced a sudden and drastic price increase from Slack. After using Slack for 11 years, even paying $5,000 annually after a previous transition from a free nonprofit plan, Slack demanded an immediate payment of $50,000 and an ongoing $200,000 per year, totaling a $195,000 annual increase. Failure to comply within a week would result in workspace deactivation and data deletion.\n\nThe author argues this move by Salesforce, Slack's parent company, is unreasonable, especially considering the short notice and the burden it places on a small nonprofit. The immediate impact was significant, forcing Hack Club staff and volunteers to urgently update systems, rebuild integrations, and migrate years of institutional knowledge.\n\nThe article highlights the importance of data ownership, leading Hack Club to transition to Mattermost. The author encourages other small businesses to consider migrating away from Slack due to this experience.\n\nThe article ends on a positive note. Due to the post's virality on Hacker News and Twitter/X, Slack's CEO contacted Hack Club and offered a resolution that the author describes as \"better than the plan we were on previously.\" While details are undisclosed, the author expresses gratitude for the public support in resolving the issue.\n",
    "chinese_title": "Slack每年向我们提高了19.5万美元的费用。",
    "chinese_summary": "面向青少年提供编程教育的非营利组织 Hack Club 面临来自 Slack 的突如其来的大幅涨价。在使用 Slack 11 年后，即便在之前从免费非营利计划过渡后每年支付 5000 美元，Slack 仍要求立即支付 50000 美元，并持续每年支付 20 万美元，总计每年增加 19.5 万美元。若在一周内不遵守，工作区将被停用并删除数据。\n\n作者认为，Slack 的母公司 Salesforce 的这一举动是不合理的，尤其是考虑到时间紧迫以及它给小型非营利组织带来的负担。直接影响是巨大的，迫使 Hack Club 的员工和志愿者紧急更新系统、重建集成并迁移多年的机构知识。\n\n文章强调了数据所有权的重要性，促使 Hack Club 过渡到 Mattermost。作者鼓励其他小型企业因这次经历考虑从 Slack 迁移。\n\n文章以积极的结尾结束。由于该帖子在 Hacker News 和 Twitter/X 上的广泛传播，Slack 的 CEO 联系了 Hack Club 并提供了一个解决方案，作者称该方案“比我们之前使用的计划更好”。虽然细节未公开，但作者对公众在解决问题方面的支持表示感谢。"
  },
  {
    "id": "45318140",
    "title": "Bazel and Glibc Versions",
    "url": "https://blogsystem5.substack.com/p/glibc-versions-bazel",
    "summary": "生成摘要时出错",
    "chinese_title": "Bazel and Glibc Versions",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45307242",
    "title": "Less is safer: Reducing the risk of supply chain attacks",
    "url": "https://obsidian.md/blog/less-is-safer/",
    "summary": "生成摘要时出错",
    "chinese_title": "Less is safer: Reducing the risk of supply chain attacks",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45287474",
    "title": "Scream cipher",
    "url": "https://sethmlarson.dev/scream-cipher",
    "summary": "生成摘要时出错",
    "chinese_title": "Scream cipher",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45272022",
    "title": "Solving a wooden puzzle using Haskell",
    "url": "https://glocq.github.io/en/blog/20250428/",
    "summary": "生成摘要时出错",
    "chinese_title": "Solving a wooden puzzle using Haskell",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45323154",
    "title": "100% Repairable Laptop, DIY Project, Introductory First Video",
    "url": "https://www.youtube.com/watch?v=kobUTW_QiII",
    "summary": "生成摘要时出错",
    "chinese_title": "100% Repairable Laptop, DIY Project, Introductory First Video",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45268084",
    "title": "PyPI Blog: Token Exfiltration Campaign via GitHub Actions Workflows",
    "url": "https://blog.pypi.org/posts/2025-09-16-github-actions-token-exfiltration/",
    "summary": "生成摘要时出错",
    "chinese_title": "PyPI Blog: Token Exfiltration Campaign via GitHub Actions Workflows",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45323086",
    "title": "The unbearable slowness of being: Why do we live at 10 bits/s? [pdf]",
    "url": "https://meisterlab.caltech.edu/documents/30100/Zheng_2024_The_unbearable_slowness_of_being-_Why_do_we_live_at_10_bitss.pdf",
    "summary": "生成摘要时出错",
    "chinese_title": "The unbearable slowness of being: Why do we live at 10 bits/s? [pdf]",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45320230",
    "title": "Representing Heterogeneous Data (2023)",
    "url": "https://journal.stuffwithstuff.com/2023/08/04/representing-heterogeneous-data/",
    "summary": "生成摘要时出错",
    "chinese_title": "Representing Heterogeneous Data (2023)",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45274779",
    "title": "I once appeared in The Old New Thing",
    "url": "https://mtlynch.io/my-old-new-thing-cameo/",
    "summary": "生成摘要时出错",
    "chinese_title": "I once appeared in The Old New Thing",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45321793",
    "title": "US companies laid off 40k+ US tech workers, replaced them with H-1B visa holders",
    "url": "https://www.hindustantimes.com/world-news/american-companies-laid-off-over-40-000-us-tech-workers-replaced-them-with-h-1b-visa-holders-white-house-101758431251767.html",
    "summary": "生成摘要时出错",
    "chinese_title": "US companies laid off 40k+ US tech workers, replaced them with H-1B visa holders",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45311115",
    "title": "LLM-Deflate: Extracting LLMs into Datasets",
    "url": "https://www.scalarlm.com/blog/llm-deflate-extracting-llms-into-datasets/",
    "summary": "生成摘要时出错",
    "chinese_title": "LLM-Deflate: Extracting LLMs into Datasets",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45300615",
    "title": "Dynamo AI (YC W22) Is Hiring a Senior Kubernetes Engineer",
    "url": "https://www.ycombinator.com/companies/dynamo-ai/jobs/fU1oC9q-senior-kubernetes-engineer",
    "summary": "生成摘要时出错",
    "chinese_title": "Dynamo AI (YC W22) Is Hiring a Senior Kubernetes Engineer",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45313194",
    "title": "Bezier Curve as Easing Function in C++",
    "url": "https://asawicki.info/news_1790_bezier_curve_as_easing_function_in_c",
    "summary": "生成摘要时出错",
    "chinese_title": "Bezier Curve as Easing Function in C++",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45310995",
    "title": "PYREX vs. pyrex: What's the difference?",
    "url": "https://www.corning.com/worldwide/en/products/life-sciences/resources/stories/in-the-field/pyrex-vs-pyrex-whats-the-difference.html",
    "summary": "生成摘要时出错",
    "chinese_title": "PYREX vs. pyrex: What's the difference?",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45298336",
    "title": "Nostr",
    "url": "https://nostr.com/",
    "summary": "生成摘要时出错",
    "chinese_title": "Nostr",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45300810",
    "title": "The best YouTube downloaders, and how Google silenced the press",
    "url": "https://windowsread.me/p/best-youtube-downloaders",
    "summary": "生成摘要时出错",
    "chinese_title": "The best YouTube downloaders, and how Google silenced the press",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45295898",
    "title": "Want to piss off your IT department? Are the links not malicious looking enough?",
    "url": "https://phishyurl.com/",
    "summary": "生成摘要时出错",
    "chinese_title": "Want to piss off your IT department? Are the links not malicious looking enough?",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45313597",
    "title": "Is Zig's new writer unsafe?",
    "url": "https://www.openmymind.net/Is-Zigs-New-Io-Unsafe/",
    "summary": "生成摘要时出错",
    "chinese_title": "Is Zig's new writer unsafe?",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45314432",
    "title": "Are touchscreens in cars dangerous?",
    "url": "https://www.economist.com/science-and-technology/2025/09/19/are-touchscreens-in-cars-dangerous",
    "summary": "生成摘要时出错",
    "chinese_title": "Are touchscreens in cars dangerous?",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45316244",
    "title": "TV Time Machine: A Raspberry Pi That Plays Random 90s TV",
    "url": "https://quarters.captaintouch.com/blog/posts/2025-09-20-tv-time-machine-a-raspberry-pi-that-plays-random-90s-tv.html",
    "summary": "生成摘要时出错",
    "chinese_title": "TV Time Machine: A Raspberry Pi That Plays Random 90s TV",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45312447",
    "title": "Overcoming barriers of hydrogen storage with a low-temperature hydrogen battery",
    "url": "https://www.isct.ac.jp/en/news/okmktjxyrvdc",
    "summary": "生成摘要时出错",
    "chinese_title": "Overcoming barriers of hydrogen storage with a low-temperature hydrogen battery",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45312696",
    "title": "Git: Introduce Rust and announce it will become mandatory in the build system",
    "url": "https://lore.kernel.org/git/20250904-b4-pks-rust-breaking-change-v1-0-3af1d25e0be9@pks.im/",
    "summary": "生成摘要时出错",
    "chinese_title": "Git: Introduce Rust and announce it will become mandatory in the build system",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45322239",
    "title": "Plausibility is not truth: Do you really understand AI?",
    "url": "https://thecritic.co.uk/plausibility-is-not-truth/",
    "summary": "生成摘要时出错",
    "chinese_title": "Plausibility is not truth: Do you really understand AI?",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45317870",
    "title": "Why do some gamers invert their controls?",
    "url": "https://www.theguardian.com/games/2025/sep/18/why-do-some-gamers-invert-their-controls-scientists-now-have-answers-but-theyre-not-what-you-think",
    "summary": "生成摘要时出错",
    "chinese_title": "Why do some gamers invert their controls?",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45314157",
    "title": "Systemd can be a cause of restrictions on daemons",
    "url": "https://utcc.utoronto.ca/~cks/space/blog/linux/SystemdCanBeRestrictionCause",
    "summary": "生成摘要时出错",
    "chinese_title": "Systemd can be a cause of restrictions on daemons",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45312323",
    "title": "Node 20 will be deprecated on GitHub Actions runners",
    "url": "https://github.blog/changelog/2025-09-19-deprecation-of-node-20-on-github-actions-runners/",
    "summary": "生成摘要时出错",
    "chinese_title": "Node 20 will be deprecated on GitHub Actions runners",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45322173",
    "title": "Thoth Blueprint: software to visualize and modify database schema",
    "url": "https://github.com/AHS12/thoth-blueprint",
    "summary": "生成摘要时出错",
    "chinese_title": "Thoth Blueprint: software to visualize and modify database schema",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45322169",
    "title": "Multi-Kernel Architecture Proposed for the Linux Kernel",
    "url": "https://www.phoronix.com/news/Linux-Multi-Kernel-Patches",
    "summary": "生成摘要时出错",
    "chinese_title": "Multi-Kernel Architecture Proposed for the Linux Kernel",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45310294",
    "title": "High-performance read-through cache for object storage",
    "url": "https://github.com/s2-streamstore/cachey",
    "summary": "生成摘要时出错",
    "chinese_title": "对象存储的高性能透读缓存",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45297066",
    "title": "Help us raise $200k to free JavaScript from Oracle",
    "url": "https://deno.com/blog/javascript-tm-gofundme",
    "summary": "生成摘要时出错",
    "chinese_title": "Help us raise $200k to free JavaScript from Oracle",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45294053",
    "title": "The SAT Game",
    "url": "https://www.cril.univ-artois.fr/~roussel/satgame/satgame.php?level=5&lang=eng",
    "summary": "生成摘要时出错",
    "chinese_title": "The SAT Game",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45288161",
    "title": "Nvidia buys $5B in Intel",
    "url": "https://www.tomshardware.com/pc-components/cpus/nvidia-and-intel-announce-jointly-developed-intel-x86-rtx-socs-for-pcs-with-nvidia-graphics-also-custom-nvidia-data-center-x86-processors-nvidia-buys-usd5-billion-in-intel-stock-in-seismic-deal",
    "summary": "生成摘要时出错",
    "chinese_title": "Nvidia buys $5B in Intel",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45265760",
    "title": "Show the Physics",
    "url": "https://interactivetextbooks.tudelft.nl/showthephysics/Introduction/About.html",
    "summary": "生成摘要时出错",
    "chinese_title": "Show the Physics",
    "chinese_summary": "生成摘要时出错"
  }
]