[
  {
    "id": "44777760",
    "title": "Anthropic: Persona Vectors",
    "url": "https://www.anthropic.com/research/persona-vectors",
    "summary": "Anthropic's research introduces \"persona vectors,\" a method for understanding and controlling character traits in large language models (LLMs). These vectors represent patterns of neural network activity corresponding to specific personality traits like \"evil,\" \"sycophancy,\" and \"hallucination.\" By identifying these vectors, researchers can monitor, mitigate, and predict personality shifts in LLMs.\n\nThe process involves automatically generating prompts to elicit opposing behaviors for a trait, then identifying the difference in neural activity. These vectors can be injected into the model to \"steer\" its behavior, confirming their influence.\n\nPersona vectors enable monitoring personality changes during deployment, potentially alerting developers to undesirable drifts. They can also be used to mitigate negative traits acquired during training. A counterintuitive \"vaccine\" approach involves steering the model *towards* undesirable traits during training, making it more resilient to acquiring them from problematic data. This method preserves model capabilities better than steering against the trait after training.\n\nFinally, persona vectors can flag problematic training data by predicting how the data will impact a model's personality before training even begins. The research demonstrated the effectiveness of this flagging technique on real-world datasets. The findings suggest that persona vectors offer a promising path toward ensuring LLMs remain aligned with human values and behave as intended.\n",
    "chinese_title": "Anthropic：角色向量",
    "chinese_summary": "Anthropic 研究引入“人格向量”，这是一种理解和控制大型语言模型 (LLM) 中角色特性的方法。这些向量代表与特定人格特征（如“邪恶”、“奉承”和“幻觉”）相对应的神经网络活动模式。通过识别这些向量，研究人员可以监测、缓解和预测 LLM 中的人格转变。\n\n该过程涉及自动生成提示来引出某种特性的对立行为，然后识别神经活动中的差异。这些向量可以注入到模型中以“引导”其行为，从而确认其影响。\n\n人格向量能够监测部署期间的人格变化，从而可能提醒开发者注意不良漂移。它们还可以用于缓解训练期间获得的负面特征。一种违反直觉的“疫苗”方法包括在训练期间将模型*引导至*不良特征，使其更具弹性，不易从有问题的数据中获取这些特征。与训练后引导对抗该特征相比，此方法能更好地保留模型能力。\n\n最后，人格向量可以通过预测数据在训练开始前将如何影响模型的人格来标记有问题的数据。该研究证明了这种标记技术在真实数据集上的有效性。研究结果表明，人格向量为确保 LLM 保持与人类价值观的一致性并按预期行事提供了一条有希望的途径。"
  },
  {
    "id": "44775563",
    "title": "If you're remote, ramble",
    "url": "https://stephango.com/ramblings",
    "summary": "This article advocates for \"ramblings\" channels in team chat apps to foster connection and idea generation within remote teams of 2-10 people. These channels, acting as personal journals or microblogs, allow teammates to share thoughts, ideas, and updates without disrupting group channels.\n\nEach team member has their own \"ramblings\" channel, named after them, where they can post updates 1-3 times a week. These posts can include project ideas, reflections on articles, \"what if\" scenarios, personal photos, or even problem-solving attempts. Others can reply to these posts in threads, facilitating discussion.\n\nThe \"ramblings\" channels are grouped in a dedicated \"Ramblings\" section and are muted by default, alleviating pressure to read every post. This encourages deep focus while still providing a space for informal communication, serving as a virtual \"water cooler.\"\n\nThe author, who implemented \"ramblings\" at Obsidian two years ago, highlights that this system has become a valuable tool for staying connected and generating innovative ideas. The casual and unstructured nature of these channels has led to the emergence of feature ideas, prototypes, and creative solutions. These ramblings help maintain human connection between the team's annual in-person meetups.\n",
    "chinese_title": "如果你是远程办公，那就漫谈吧。",
    "chinese_summary": "本文提倡在团队聊天应用中设置“随笔”频道，以促进 2-10 人的远程团队内部的联系和创意产生。 这些频道就像个人日记或微博，允许队友分享想法、见解和更新，而不会打断群组频道。\n\n每个团队成员都有自己以自己名字命名的“随笔”频道，他们可以在其中每周发布 1-3 次更新。 这些帖子可以包括项目想法、对文章的反思、“如果……会怎样”的情景、个人照片，甚至解决问题的尝试。其他人可以在这些帖子下方的评论区回复，促进讨论。\n\n“随笔”频道被归类在专门的“随笔”部分，并且默认静音，从而减轻了阅读每篇帖子的压力。 这鼓励深度专注，同时仍然为非正式沟通提供空间，充当虚拟“茶水间”。\n\n作者两年前在 Obsidian 实施了“随笔”，他强调这个系统已经成为保持联系和产生创新想法的宝贵工具。 这些频道的随意性和非结构化性质促成了功能想法、原型和创造性解决方案的出现。 这些随笔有助于在团队年度线下聚会之间保持人际联系。"
  },
  {
    "id": "44776434",
    "title": "The Fulbright Program: Chock Full of Bright Ideas",
    "url": "https://bastian.rieck.me/blog/2025/fulbright/",
    "summary": "This blog post highlights the author's positive experience hosting a Fulbright scholar, Emily Simons, and argues for the continued funding of the Fulbright Program. The author initially collaborated with Emily on a healthcare-related project that ultimately fell through. However, Emily quickly adapted and contributed significantly to other projects, including work on physician-patient referral networks and graph learning datasets, culminating in a joint publication at ICML 2025. Beyond research, Emily also improved the lab's dissemination strategies, repositories, and website.\n\nThe author emphasizes that the true value of the Fulbright Program extends beyond quantifiable research outcomes. It lies in connecting bright minds, fostering intellectual enrichment, and creating opportunities for cross-cultural understanding and innovation. The author urges policymakers to recognize the long-term benefits of such programs, arguing against short-sighted funding cuts driven by a commodification of research. By connecting people, the Fulbright program creates unseen opportunities, change, and innovation across cultural borders. The author strongly supports these kinds of programs.\n",
    "chinese_title": "富布赖特项目：满载奇思妙想",
    "chinese_summary": "这篇博文讲述了作者接待富布赖特学者艾米丽·西蒙斯的积极体验，并呼吁继续资助富布赖特项目。作者最初与艾米丽合作开展一个医疗保健相关项目，但最终未能成功。然而，艾米丽迅速适应并为其他项目做出了重大贡献，包括医生-患者转诊网络和图学习数据集的研究，最终在ICML 2025上共同发表了一篇论文。除了研究之外，艾米丽还改进了实验室的传播策略、知识库和网站。\n\n作者强调，富布赖特项目的真正价值远不止于可量化的研究成果，它在于连接聪明才智，促进智力提升，并为跨文化理解和创新创造机会。作者敦促决策者认识到此类项目的长期利益，反对因研究商品化而导致的目光短浅的资金削减。通过连接人，富布赖特项目在文化边界之间创造了看不见的机会、变革和创新。作者强烈支持此类项目。"
  },
  {
    "id": "44774104",
    "title": "Twenty Eighth International Obfuscated C Code Contest",
    "url": "https://www.ioccc.org/2024/index.html",
    "summary": "The 28th International Obfuscated C Code Contest (IOCCC28) marked its 40th anniversary and the end of a 4-year hiatus. The contest saw significant improvements, including a rebuilt website, new registration and submission processes, and the mkiocccentry toolkit. These changes aimed to streamline the contest and reduce the time between winner selection and code release; the source code was released within 2 hours of the announcement on a YouTube show.\n\nIOCCC28 had a record-breaking 23 winners, reflecting a high quantity and quality of submissions. While the code size limit increased, many entries were well under the limit, suggesting that originality and obfuscation skills are valued more than sheer size. The rules and guidelines will be improved for IOCCC29, planned for December 2025.\n\nThe announcement highlights several winning entries, including a small LLM inference engine (cable1), a polite editor (howe), a one-liner with magic numbers (stedolan), a C-preprocessor intensive image renderer (endoh1), an exploration of virtual machines (mills and macke), and an Intel 4004 emulator (carlini). The article also touches on common pitfalls that prevented some submissions from winning, such as reliance on ASLR, resembling past entries too closely, and poor handling of modern C compilers. It encourages submitters to keep trying and provides resources for compiling, running, and fixing issues with winning entries.\n",
    "chinese_title": "第二十八届国际C语言混乱代码大赛",
    "chinese_summary": "第28届国际C语言混乱代码大赛(IOCCC28)迎来了其40周年纪念以及四年中断后的回归。 本次大赛有了显著的改进，包括重建的网站、新的注册和提交流程以及mkiocccentry工具包。 这些改变旨在简化比赛流程，并缩短获奖者选定和代码发布之间的时间； 源代码在YouTube节目中宣布后的2小时内就发布了。\n\nIOCCC28有创纪录的23位获奖者，反映了提交作品的高质量和高数量。 虽然代码大小限制有所增加，但许多参赛作品远低于该限制，这表明原创性和混淆技巧比单纯的代码大小更受重视。 计划于2025年12月举行的IOCCC29的规则和指南将会得到改进。\n\n公告重点介绍了几个获奖作品，包括小型LLM推理引擎 (cable1)、一个礼貌的编辑器 (howe)、一个带有幻数的单行代码 (stedolan)、一个C预处理器密集型图像渲染器 (endoh1)、一个对虚拟机的探索 (mills and macke) 以及一个Intel 4004模拟器 (carlini)。 文章还提到了阻止一些提交作品获胜的常见陷阱，例如依赖ASLR、与过去的参赛作品过于相似以及对现代C编译器的处理不佳。 它鼓励提交者继续尝试，并提供用于编译、运行和修复获奖作品问题的资源。"
  },
  {
    "id": "44736025",
    "title": "Helsinki records zero traffic deaths for full year",
    "url": "https://www.helsinkitimes.fi/finland/finland-news/domestic/27539-helsinki-records-zero-traffic-deaths-for-full-year.html",
    "summary": "Helsinki has achieved a remarkable milestone: a full year without any traffic-related fatalities. City and police officials attribute this success to long-term planning, infrastructure improvements, and reduced speed limits. Over half of Helsinki's streets now have a 30 km/h speed limit, and areas around schools have also been reduced.\n\nRedesigned street layouts, pedestrian crossings, and expanded cycling and walking infrastructure contribute to increased safety by separating vulnerable road users. Improved traffic enforcement through automated systems and targeted patrols has also played a key role. The city's excellent public transport system reduces car usage, further minimizing accidents.\n\nBeyond fatalities, Helsinki has seen a significant decrease in injury-causing accidents, dropping from nearly 1,000 annually in the late 1980s to 277 in the past year. The city's traffic safety strategy, running from 2022 to 2026, focuses on protecting pedestrians, children, and cyclists, supported by data-driven planning.\n\nWhile electric scooters presented a challenge, Helsinki has responded with adjusted parking rules and speed restrictions. Officials also credited the positive behaviour and awareness of all road users for the achievement.\n\nAligned with the EU's Vision Zero goal of eliminating traffic fatalities by 2050, Helsinki uses this target to guide daily decision-making and assess the long-term impact of its initiatives.\n",
    "chinese_title": "赫尔辛基全年实现零交通死亡",
    "chinese_summary": "赫尔辛基创下瞩目成就：全年实现交通事故零死亡。城市和警方官员将这一成功归功于长期规划、基础设施改善和降低限速。目前，赫尔辛基超过一半的街道限速为30公里/小时，学校周边区域的限速也已降低。\n\n重新设计的街道布局、人行横道以及扩大的自行车和步行基础设施通过分隔弱势道路使用者，提高了安全性。通过自动化系统和有针对性的巡逻来加强交通执法也发挥了关键作用。该市完善的公共交通系统减少了汽车使用，进一步减少了事故。\n\n除了死亡人数外，赫尔辛基的受伤事故也大幅减少，从1980年代后期的每年近1000起降至去年的277起。该市2022年至2026年的交通安全战略侧重于保护行人、儿童和骑自行车者，并以数据驱动的规划为支持。\n\n虽然电动滑板车带来了一项挑战，但赫尔辛基已通过调整停车规则和速度限制做出回应。官员们还将所有道路使用者的积极行为和意识归功于这一成就。\n\n为了实现欧盟到2050年消除交通事故死亡的“零愿景”目标，赫尔辛基利用这一目标来指导日常决策，并评估其举措的长期影响。"
  },
  {
    "id": "44745441",
    "title": "Imaging reveals intricate tattoos of 2,500-year-old Siberian ice mummy",
    "url": "https://www.bbc.com/news/articles/c4gzx0zm68vo",
    "summary": "High-resolution imaging has revealed intricate tattoos on a 2,500-year-old Siberian \"ice mummy,\" providing insights into the culture and practices of the nomadic Pazyryk people. The tattoos, depicting animals like leopards, stags, roosters, and mythical creatures, were found on the woman's arms and hands, showcasing a sophisticated level of artistry.\n\nResearchers collaborated with a tattooist specializing in ancient methods to understand how the tattoos were created. The scans revealed detailed and uniform tattooing, suggesting skilled craftsmanship. The team believes the tattoos were likely stenciled onto the skin before being applied using needle-like tools made from animal horn or bone, with pigment derived from burnt plant material or soot.\n\nAnalysis suggests varying quality between tattoos on different arms, possibly indicating different artists or mistakes.  The time commitment involved in creating the tattoos highlights their significance. While some tattoos were damaged during burial preparation, the study suggests their importance was primarily for the living. The mummies were discovered in ice tombs in the Altai Mountains, and the research sheds light on the advanced skills and cultural practices of the Pazyryk people.\n",
    "chinese_title": "成像揭示2500年前西伯利亚冰冻木乃伊精美纹身",
    "chinese_summary": "高分辨率成像揭示了一具2500年前西伯利亚“冰冻木乃伊”身上精美的纹身，为了解游牧的巴泽雷克文化和习俗提供了线索。这些纹身位于该女性的手臂和手上，描绘了豹、鹿、公鸡和神话生物等动物，展现了高超的艺术水平。\n\n研究人员与一位专精于古代方法的纹身师合作，以了解纹身是如何创作的。扫描结果显示纹身精细且均匀，表明其工艺精湛。研究小组认为，这些纹身很可能先用模具印在皮肤上，然后使用动物角或骨头制成的针状工具进行纹刺，颜料则来源于烧焦的植物材料或烟灰。\n\n分析表明，不同手臂上的纹身质量参差不齐，可能表明是不同的艺术家所为或存在失误。创作纹身所花费的时间凸显了它们的重要性。虽然一些纹身在埋葬准备过程中受损，但研究表明它们的重要性主要体现在生者身上。这些木乃伊是在阿尔泰山脉的冰墓中发现的，这项研究揭示了巴泽雷克人先进的技能和文化习俗。"
  },
  {
    "id": "44777965",
    "title": "Converge (YC S23) well-capitalized New York startup seeks product developers",
    "url": "https://www.runconverge.com/careers",
    "summary": "Converge, a well-capitalized New York startup from YC S23, is seeking product developers to join their lean team of 6. They boast a strong product-market fit, evidenced by >$1M ARR, >200 customers, and high daily user engagement (33%). This translates to significant impact for new hires, who will own entire products and see immediate customer feedback.\n\nConverge tackles engineering challenges at scale, processing 20M daily customer interactions and $3B in GMV annually, competing with giants like Segment and Fivetran. The company emphasizes urgency, deep understanding, humility, and simplicity in its values.\n\nThey discourage candidates who prefer managing over building, endless design reviews, chasing hype, pivoting, seeking heavy mentorship, or remote work. The founding team, consisting of Jan-Henrik (CEO), Jerome (COO), and Thomas (CTO), emphasizes a hands-on approach, with all founders having written production code. The team highlights their close relationships and diverse backgrounds.\n",
    "chinese_title": "拥有充足资金的纽约初创公司Converge（YC S23）寻求产品开发人员",
    "chinese_summary": "Converge，一家资金充足的纽约初创公司，隶属于 YC S23，正在寻找产品开发人员加入其精简的 6 人团队。他们拥有强大的产品市场契合度，表现为超过 100 万美元的年度经常性收入、超过 200 家客户以及高每日用户参与度（33%）。这意味着新员工将产生重大影响，他们将拥有整个产品并立即获得客户反馈。\n\nConverge 致力于解决大规模的工程挑战，每天处理 2000 万次客户互动，每年处理 30 亿美元的 GMV，与 Segment 和 Fivetran 等巨头竞争。该公司强调紧迫性、深刻理解、谦逊和简单是其价值观。\n\n他们不鼓励喜欢管理而非构建、无休止的设计评审、追逐炒作、频繁转型、寻求大量指导或远程工作的候选人。创始团队由 Jan-Henrik（首席执行官）、Jerome（首席运营官）和 Thomas（首席技术官）组成，他们强调亲力亲为的方法，所有创始人都编写过生产代码。该团队强调他们密切的关系和多元化的背景。"
  },
  {
    "id": "44774567",
    "title": "A Real PowerBook: The Macintosh Application Environment on a Pa-RISC Laptop",
    "url": "http://oldvcr.blogspot.com/2025/08/a-real-powerbook-macintosh-application.html",
    "summary": "This article explores the RDI PrecisionBook, a rare PA-RISC laptop from 1997, and its ability to run Macintosh applications via Apple's Macintosh Application Environment. The author highlights that while PowerPC was the expected successor to the Motorola 68000 for Macintosh, the PrecisionBook offered an alternative using Hewlett-Packard's PA-RISC architecture.\n\nThe PrecisionBook, positioned against the PowerBook 3400c, boasted advantages like a higher resolution display, larger keyboard, and more RAM, but was significantly more expensive. Its key feature was running HP-UX alongside a Macintosh System 7.5.3 desktop, allowing users to run 68K Mac software.\n\nThe article details RDI's history as a SPARC laptop manufacturer before diversifying to PA-RISC. The PrecisionBook was essentially a portable HP Visualize workstation, using the same components and even identifying as the same model.  The author’s specific machine, nicknamed \"ruby,\" featured a 160MHz PA-7300LC processor and 256MB (later upgraded to 512MB) of RAM.\n\nFurther described are the laptop's various features, including its status LCD panel, battery life, ports, and graphics capabilities. It had dual hard drive bays, PCMCIA slots, and external connectivity options. The article also touches on the machine's boot process and the technical specifications of the PA-7300LC processor. Ultimately, the author sets the stage to explore the performance and underpinnings of running the Macintosh Application Environment on this unusual piece of hardware.\n",
    "chinese_title": "真正的PowerBook：在PA-RISC笔记本电脑上的Macintosh应用程序环境",
    "chinese_summary": "本文探讨了RDI PrecisionBook，一款1997年罕见的PA-RISC笔记本电脑，以及它通过苹果的Macintosh应用程序环境运行Macintosh应用程序的能力。作者强调，虽然PowerPC是Macintosh的摩托罗拉68000处理器的预期继任者，但PrecisionBook提供了一种使用惠普PA-RISC架构的替代方案。\n\nPrecisionBook的定位是与PowerBook 3400c竞争，它拥有更高的分辨率显示器、更大的键盘和更多的RAM等优势，但价格也明显更高。其主要特点是运行HP-UX的同时，运行Macintosh System 7.5.3桌面，从而允许用户运行68K Mac软件。\n\n文章详细介绍了RDI在多元化到PA-RISC之前作为SPARC笔记本电脑制造商的历史。PrecisionBook本质上是一台便携式HP Visualize工作站，使用相同的组件，甚至识别为同一型号。作者的特定机器，昵称为“ruby”，配备了160MHz PA-7300LC处理器和256MB（后来升级到512MB）的RAM。\n\n文章进一步描述了该笔记本电脑的各种功能，包括其状态LCD面板、电池寿命、端口和图形功能。它具有双硬盘驱动器托架、PCMCIA插槽和外部连接选项。文章还提到了机器的启动过程和PA-7300LC处理器的技术规格。最终，作者为探索在这个不寻常的硬件上运行Macintosh应用程序环境的性能和基础做好了准备。"
  },
  {
    "id": "44740325",
    "title": "The Ski Rental Problem",
    "url": "https://lesves.github.io/articles/ski-rental/",
    "summary": "This article explains the \"ski rental problem,\" a classic online algorithm problem where you must decide whether to rent or buy skis without knowing how many days you'll ski. Renting costs $1 per day, and buying costs $B.\n\nThe optimal offline algorithm (knowing the number of ski days, *k*) is to buy if *k* ≥ *B* and rent otherwise, costing min(*k*, *B*). A simple online algorithm is to buy after renting for *B* days, resulting in a competitive ratio of 2 (meaning it's at most twice as bad as the optimal offline solution).\n\nThe article then explores a randomized algorithm to potentially improve the competitive ratio. This algorithm buys skis on day *i+1* with probability *P<sub>i</sub>*. By approximating the discrete probabilities with a continuous probability density function *P(x)*, the goal is to find an optimal *P(x)* that minimizes the competitive ratio.  Using calculus, the article derives the optimal probability distribution: *P(x) = e<sup>x/B</sup> / (B(e-1))* for *x < B* and 0 otherwise. This leads to an expected competitive ratio of approximately *e / (e - 1)*, which is better than the simple deterministic algorithm.  The article includes Python code to simulate the randomized strategy, although acknowledging it is approximating a discrete solution with a continuous one. Finally, it posits that the algorithm could be helpful if similar decisions must be made repeatedly.\n",
    "chinese_title": "滑雪租赁问题",
    "chinese_summary": "本文解释了“滑雪板租赁问题”，这是一个经典的在线算法问题，你必须决定租用还是购买滑雪板，但不知道你会滑多少天。租用每天花费1美元，购买花费B美元。\n\n最优离线算法（知道滑雪天数*k*）是在*k* ≥ *B*时购买，否则租用，花费min(*k*, *B*)。一个简单的在线算法是在租用*B*天后购买，这导致竞争比率为2（意味着它最多比最优离线解决方案差两倍）。\n\n然后，本文探讨了一种随机算法，以潜在地提高竞争比率。该算法在第*i+1*天以概率*P<sub>i</sub>*购买滑雪板。通过使用连续概率密度函数*P(x)*来近似离散概率，目标是找到一个最小化竞争比率的最优*P(x)*。使用微积分，本文推导出最优概率分布：*P(x) = e<sup>x/B</sup> / (B(e-1))*，当*x < B*时，否则为0。这导致预期的竞争比率约为*e / (e - 1)*，这比简单的确定性算法更好。本文包含Python代码来模拟随机策略，但承认它正在用连续解来近似离散解。最后，它假设如果必须重复做出类似的决策，该算法可能会有所帮助。"
  },
  {
    "id": "44775830",
    "title": "How To Make (almost) Anything (2019)",
    "url": "https://fab.cba.mit.edu/classes/863.19/CBA/people/dsculley/index.html",
    "summary": "D. Sculley, a Google researcher leading machine learning teams in Cambridge, is participating in the \"How To Make (almost) Anything\" course to explore fabrication methods and potential cross-domain applications, particularly in biology and chemistry. His interest stems from his team's current projects which leverage machine learning for design and fabrication. He brings a diverse background to the course, including years of experience in machine learning (since 2003), prior experience as a teacher, and a visual and environmental studies (\"art\") undergraduate degree. He acknowledges his intention to make mistakes and welcomes discussions on machine learning. The syllabus outlines a comprehensive exploration of various fabrication techniques, spanning CAD & sketching to CNC machining, embedded programming, molding & casting, electronics design & production, 3D scanning & printing, and culminates in a final project after covering input and output devices, networking, machine week, application programming, and a wildcard week.\n",
    "chinese_title": "如何制作（几乎）任何东西（2019）",
    "chinese_summary": "D. Sculley，一位在剑桥领导谷歌机器学习团队的研究员，正在参加“如何制作（几乎）任何东西”课程，以探索制造方法和潜在的跨领域应用，尤其是在生物学和化学领域。 他的兴趣源于他团队目前利用机器学习进行设计和制造的项目。 他为该课程带来了多元化的背景，包括多年的机器学习经验（自2003年以来）、之前的教学经验以及视觉与环境研究（“艺术”）本科学位。 他承认自己打算犯错，并欢迎关于机器学习的讨论。 课程大纲概述了对各种制造技术的全面探索，涵盖CAD与草图绘制到CNC加工、嵌入式编程、模具与铸造、电子设计与生产、3D扫描与打印，并在涵盖输入和输出设备、网络、机器周、应用程序编程和通配符周之后，以一个最终项目告终。"
  },
  {
    "id": "44769039",
    "title": "Telo MT1",
    "url": "https://www.telotrucks.com/",
    "summary": "The TELO MT1 is an all-electric mini truck designed for urban living and weekend adventures, combining the capabilities of a Toyota Tacoma with the efficiency of a Tesla and the footprint of a MINI Cooper. It seats five with a 60-inch bed, expandable to accommodate 4x8 plywood sheets or up to eight passengers with an innovative midgate and optional third-row seating.\n\nThe MT1 boasts a 350-mile range, 500 horsepower, and rapid 20-minute fast charging (20-80%). It offers a secure tonneau cover for storage and prioritizes safety with advanced collision detection technology. The interior features a minimalist design with natural fabrics. The specifications highlight dual motor options, potential for 2WD drivetrains, payload capacity of 2,000 lbs and variable seating configurations and battery ranges. TELO Trucks emphasizes redesigning the EV truck for maximum efficiency and functionality. You can reserve yours today.\n",
    "chinese_title": "Telo MT1",
    "chinese_summary": "TELO MT1 是一款全电动迷你卡车，专为城市生活和周末探险设计。它结合了丰田 Tacoma 的性能、特斯拉的效率和 MINI Cooper 的占地面积。MT1 可容纳五人，并配备 60 英寸货箱，可通过创新的中门和可选的第三排座椅扩展，以容纳 4x8 英寸的胶合板或多达八名乘客。\n\nMT1 拥有 350 英里的续航里程、500 马力和快速 20 分钟的快速充电（20-80%）。它提供安全的卷帘盖以供存储，并通过先进的碰撞检测技术优先考虑安全性。内饰采用极简设计，并使用天然面料。规格重点包括双电机选项、潜在的 2WD 传动系统、2,000 磅的有效载荷能力以及可变的座椅配置和电池续航里程。TELO Trucks 强调重新设计电动卡车以实现最大效率和功能性。 您今天就可以预订。"
  },
  {
    "id": "44746621",
    "title": "6 weeks of Claude Code",
    "url": "https://blog.puzzmo.com/posts/2025/07/30/six-weeks-of-claude-code/",
    "summary": "This article reflects on the transformative impact of Claude Code on the author's software development workflow over six weeks, specifically within the Puzzmo engineering space. The author emphasizes a newfound \"freedom of expression\" in coding, decoupling them from writing every line of code while maintaining full responsibility for the final product. Comparing this to the \"introduction of photography\" for programming, the author believes Claude Code significantly accelerates development.\n\nThe primary benefit highlighted is the dramatically reduced cost of maintenance and addressing technical debt. The author details a substantial list of completed projects, including codebase conversions, system replacements, and infrastructure improvements, all accomplished as \"side-projects\" while working on their primary roadmap. This resulted in years of backlog being addressed in a little over a month and a half, without significant increase in work hours. This allows for quick exploration of ideas and the ability to \"Write First, Decide Later\".\n\nThe author also introduces the \"Two Clones lifestyle,\" using two separate VS Code instances for independent pull request work. They explain how Claude Code has also changed Puzzmo's game development process, enabling designers to quickly prototype and deploy games. However, this raises concerns about maintaining code quality and integrating prototypes into the production pipeline.\n\nThe author also discusses the success internally and the importance of being a full-breadth developer. They attribute the success of Claude Code to Puzzmo's monorepo architecture, explicit tech choices, and the nature of their business as a test suite/benchmark for these models.\n\nWhile the author acknowledges a lack of significant change in metrics like pull requests and lines of code, they firmly believe in the increased pace of change at Puzzmo. The author concludes by recommending a focus on effective Claude Code usage rather than obsessing over the latest LLM trends.\n",
    "chinese_title": "克劳德代码六周",
    "chinese_summary": "克劳德代码对Puzzmo工程师六周内软件开发工作流程的变革性影响。作者强调在编码中获得了前所未有的“表达自由”，无需编写每一行代码，同时对最终产品承担全部责任。作者将其比作编程界的“摄影术的引入”，认为克劳德代码显著加速了开发进程。\n\n主要优点是大幅降低了维护和解决技术债务的成本。作者详细列举了一系列已完成的项目，包括代码库转换、系统替换和基础设施改进，这些项目都是在处理主要路线图的同时作为“副项目”完成的。这使得多年积压的工作在不到一个半月的时间内得以解决，而工作时间没有明显增加。这使得他们能够快速探索想法并“先编写，后决定”。\n\n作者还介绍了“两个克隆体生活方式”，即使用两个独立的 VS Code 实例进行独立的拉取请求工作。他们解释了克劳德代码如何改变了 Puzzmo 的游戏开发流程，使设计师能够快速原型设计和部署游戏。然而，这也引发了人们对保持代码质量和将原型集成到生产流水线中的担忧。\n\n作者还讨论了内部的成功以及成为一名全方位开发者的重要性。他们将克劳德代码的成功归功于 Puzzmo 的单一代码库架构、明确的技术选择以及其作为这些模型的测试套件/基准的业务性质。\n\n虽然作者承认拉取请求和代码行数等指标没有发生显著变化，但他们坚信 Puzzmo 的变化步伐加快了。作者最后建议关注克劳德代码的有效使用，而不是沉迷于最新的 LLM 趋势。"
  },
  {
    "id": "44737738",
    "title": "Flourishing chemosynthetic life at the greatest depths of hadal trenches",
    "url": "https://www.nature.com/articles/s41586-025-09317-z",
    "summary": "This article reports the discovery of extensive chemosynthesis-based communities in the Kuril-Kamchatka and western Aleutian Trenches, some of Earth's deepest environments. Using the manned submersible Fendouzhe, researchers identified communities spanning 2,500 km at depths of 5,800 m to 9,533 m, dominated by siboglinid polychaetes and bivalves.\n\nThese communities are sustained by hydrogen sulfide and methane-rich fluids released through faults traversing deep sediment layers, where methane is produced microbially from deposited organic matter. Isotopic analysis supports this methane production mechanism.\n\nThe communities' species composition varies between the trenches and even within them. The Kuril-Kamchatka Trench features mostly frenulate siboglinids, while the Kamchatka Aleutian Transition is abundant in vesicomyid clams. Specific sites, such as \"The Deepest\" (9,533 m) and \"Wintersweet Valley\" (9,120 m), exhibit distinct species assemblages and densities.  The presence of *Tartarothyasira hadalis* in the Kuril-Kamchatka Trench marks the deepest occurrence of chemosymbiotrophic bivalves in hadal zones.\n\nThe discovery challenges existing models of life at extreme depths and carbon cycling in the deep ocean, suggesting that such communities might be more widespread in hadal trenches than previously thought due to geological similarities.  The study highlights the ecological significance of these previously underappreciated hadal ecosystems.\n",
    "chinese_title": "海沟极深处繁盛的化能合成生命",
    "chinese_summary": "本文报道了在千岛-堪察加和西阿留申海沟（地球上一些最深的环境）中发现的广泛的化能合成生物群落。研究人员利用载人潜水器“奋斗者”号，在5800米至9533米的深度识别出绵延2500公里的生物群落，这些生物群落主要由管状蠕虫和双壳类动物组成。\n\n这些生物群落依靠富含硫化氢和甲烷的流体维持，这些流体通过贯穿深层沉积层的断层释放出来，甲烷是在那里由沉积的有机物通过微生物产生的。同位素分析支持这种甲烷生产机制。\n\n这些生物群落的物种组成在海沟之间甚至在海沟内部都各不相同。千岛-堪察加海沟主要以缨鳃虫为主，而堪察加-阿留申过渡区则富含囊蛤。诸如“最深处”（9533米）和“冬馨谷”（9120米）等特定地点表现出不同的物种组合和密度。在千岛-堪察加海沟中发现的*Tartarothyasira hadalis*标志着在海沟带发现了最深处的化能共生双壳类动物。\n\n这一发现挑战了现有的关于极端深度生命和深海碳循环的模型，表明由于地质相似性，这种生物群落可能比以前认为的更广泛地分布在海沟带中。该研究强调了这些以前未被充分认识的海沟生态系统的生态意义。"
  },
  {
    "id": "44771808",
    "title": "Lina Khan points to Figma IPO as vindication of M&A scrutiny",
    "url": "https://techcrunch.com/2025/08/02/lina-khan-points-to-figma-ipo-as-vindication-for-ma-scrutiny/",
    "summary": "Lina Khan, former FTC chair, sees Figma's successful IPO as validation of her stricter approach to M&A scrutiny. Khan argues that allowing startups like Figma to grow independently generates more value than being acquired by larger companies, alluding to the failed $20 billion Adobe-Figma deal which faced regulatory challenges during her tenure.\n\nWhile Adobe cited regulatory hurdles in Europe and the UK, the US also raised concerns about the acquisition stifling competition. Khan defended her aggressive stance against Big Tech acquisitions, claiming only a small percentage received intense scrutiny and that founders benefit from more potential acquirers.\n\nAlthough Khan has departed from the FTC, her comments view the Figma IPO as beneficial for employees, investors, innovation, and the public. Critics, however, argue that Figma's success stems from its own innovation, not regulatory intervention. Wedbush Securities analyst Dan Ives, for example, attributed Figma's success to its innovative growth rather than the FTC's actions. The article highlights the ongoing debate about the role of regulatory scrutiny in the tech industry and its impact on startups.\n",
    "chinese_title": "莉娜·可汗认为Figma首次公开募股证明并购审查是正确的",
    "chinese_summary": "前联邦贸易委员会主席莉娜·汗认为Figma的成功上市验证了她对并购审查采取的更严格方式。 汗认为，允许像Figma这样的初创公司独立发展比被大公司收购更能产生价值，她指的是在她任期内面临监管挑战的、价值200亿美元的Adobe-Figma失败交易。\n\n虽然Adobe引用了欧洲和英国的监管障碍，但美国也对收购扼杀竞争表示担忧。 汗为她对大型科技公司收购采取的强硬立场辩护，声称只有一小部分收购受到了严格审查，并且创始人可以从更多的潜在收购者中受益。\n\n尽管汗已离开联邦贸易委员会，但她的评论认为Figma的首次公开募股对员工、投资者、创新和公众都有利。 然而，批评人士认为，Figma的成功源于其自身的创新，而非监管干预。 例如，Wedbush Securities分析师Dan Ives将Figma的成功归功于其创新增长，而不是联邦贸易委员会的行动。 这篇文章强调了关于监管审查在科技行业中的作用及其对初创企业的影响的持续辩论。"
  },
  {
    "id": "44739944",
    "title": "Micron rolls out 276-layer SSD trio for speed, scale, and stability",
    "url": "https://blocksandfiles.com/2025/07/30/micron-three-276-layer-ssds/",
    "summary": "Micron has unveiled three new SSDs based on their Gen 9 276-layer 3D NAND technology, targeting distinct market needs: speed, capacity, and consistent performance.\n\nThe **9650** is a high-performance PCIe Gen 6 SSD using TLC flash, available in read-optimized \"Pro\" and mixed-use \"Max\" variants. It boasts speeds up to 28 GBps sequential reads and 14 GBps sequential writes, with up to 5.5 million/900,000 random read/write IOPS. Capacities range from 6.4 TB to 30.72 TB in E3.S and E1.S formats. It's aimed at accelerating AI training and inference and is significantly faster and more power-efficient than its predecessor, the 9550.\n\nThe **6600 ION** is a high-capacity PCIe Gen 5 SSD built with QLC flash. Aimed at bulk storage, it offers capacities up to 122.88 TB, succeeding the 6550 ION. While offering capacities up to 122.88 TB, its read/write speeds are slower compared to the 6550, trading speed for capacity. A 245 TB version is planned for 2026.\n\nThe **7600** is a PCIe Gen 5 TLC SSD focused on consistent low latency for applications like AI, databases, and cloud computing. It comes in Pro (read-intensive) and Max (mixed-use) versions, with capacities ranging from 1.6 TB to 15.36 TB, available in the U.2 format. While not the fastest, it balances performance and predictability.\n\nAll three SSDs feature Micron's in-house DRAM, NAND, controller, and firmware, and incorporate various security features. Samples of the 9650 and 7600 are currently shipping, while the 6600 ION 122 TB is expected in Q3 2025.\n",
    "chinese_title": "美光推出276层SSD三剑客，兼顾速度、规模和稳定性",
    "chinese_summary": "美光推出三款基于Gen 9 276层3D NAND技术的全新SSD，分别针对不同的市场需求：速度、容量和一致性性能。\n\n**9650** 是一款高性能PCIe Gen 6 SSD，采用TLC闪存，提供读优化“Pro”和混合用途“Max”两种型号。 其顺序读取速度高达28 GBps，顺序写入速度高达14 GBps，随机读取/写入IOPS高达550万/90万。 容量范围从6.4 TB到30.72 TB，采用E3.S和E1.S规格。 它旨在加速AI训练和推理，并且比其前身9550更快、更节能。\n\n**6600 ION** 是一款高容量PCIe Gen 5 SSD，采用QLC闪存。 专为大容量存储而设计，提供高达122.88 TB的容量，是6550 ION的后续产品。 尽管容量高达122.88 TB，但其读写速度与6550相比有所降低，牺牲速度以换取容量。 计划于2026年推出245 TB版本。\n\n**7600** 是一款PCIe Gen 5 TLC SSD，专注于为AI、数据库和云计算等应用提供一致的低延迟。 它提供Pro（读取密集型）和Max（混合用途）版本，容量范围从1.6 TB到15.36 TB，采用U.2规格。 虽然不是最快的，但它平衡了性能和可预测性。\n\n这三款SSD均采用美光自研的DRAM、NAND、控制器和固件，并集成了各种安全功能。 9650和7600的样品目前正在发货，而6600 ION 122 TB预计将于2025年第三季度上市。"
  },
  {
    "id": "44766508",
    "title": "We may not like what we become if A.I. solves loneliness",
    "url": "https://www.newyorker.com/magazine/2025/07/21/ai-is-about-to-solve-loneliness-thats-a-problem",
    "summary": "This article explores the complex and potentially unsettling implications of AI companionship in addressing loneliness. The author, a psychology professor who previously argued in favor of empathic AI, acknowledges the concerns of those who see it as a soulless substitute for genuine human connection.\n\nThe piece highlights the pervasive nature and detrimental effects of loneliness, citing research linking it to various health problems and emotional distress. It argues that while ideal solutions involve human connection, the scarcity of real human attention makes AI companions a viable, if imperfect, alternative, particularly for the elderly or those lacking social support.\n\nThe author presents evidence suggesting that AI chatbots can, in some cases, provide surprisingly empathic responses, even outperforming human doctors in certain scenarios. This raises the possibility of AI acting as therapeutic companions, though concerns remain about the potential for deception and the lack of genuine human presence.\n\nThe author grapples with the ethical implications of widespread AI companionship, particularly for younger generations. While acknowledging the potential benefits for those severely lonely, the piece questions the long-term societal impact of readily available AI relationships on solitude, independent thought, and creativity. It also suggests that as AI becomes more adept at mimicking empathy, the line between person and program will blur, potentially leading to unforeseen psychological consequences and a reliance on simulated connection. Ultimately, the article raises profound questions about what it means to be human in a world where artificial companions are increasingly sophisticated and accessible.\n",
    "chinese_title": "如果人工智能解决了孤独，我们可能不喜欢我们会变成什么样。",
    "chinese_summary": "本文探讨了人工智能陪伴在解决孤独问题上复杂且可能令人不安的影响。作者是一位心理学教授，他之前曾论证支持具有同理心的人工智能。他承认那些认为人工智能是缺乏灵魂的、对真正人际关系的替代品的人的担忧。\n\n文章强调了孤独的普遍性和有害影响，引用了将其与各种健康问题和情绪困扰联系起来的研究。文章认为，虽然理想的解决方案涉及人际交往，但由于真正的人类关注的稀缺，人工智能伴侣成为一种可行的（即使是不完美的）替代方案，特别是对于老年人或缺乏社会支持的人。\n\n作者提出了证据表明，在某些情况下，人工智能聊天机器人可以提供出人意料的同理心回应，甚至在某些情况下胜过人类医生。这提出了人工智能充当治疗性伴侣的可能性，但人们仍然担心潜在的欺骗以及缺乏真正的人类存在。\n\n作者探讨了广泛使用人工智能陪伴的伦理影响，特别是对于年轻一代。文章承认其对那些严重孤独的人的潜在好处，但质疑触手可及的人工智能关系对孤独、独立思考和创造力的长期社会影响。它还表明，随着人工智能越来越擅长模仿同理心，人与程序之间的界限将会变得模糊，可能导致无法预见的心理后果以及对模拟连接的依赖。最终，本文提出了深刻的问题，即在一个人工伴侣日益复杂和易于获得的世界中，成为人类意味着什么。"
  },
  {
    "id": "44746583",
    "title": "PixiEditor 2.0 – A FOSS universal 2D graphics editor",
    "url": "https://pixieditor.net/blog/2025/07/30/20-release/",
    "summary": "PixiEditor 2.0, launched on July 30, 2025, is a free and open-source \"Universal 2D Editor,\" evolving from its pixel-art roots to handle raster, vector, animation, and procedural graphics. It aims to be highly configurable for diverse workflows, not just a Photoshop alternative.\n\nKey features include switchable toolsets for painting, pixel art, and vector editing, allowing mixed graphics in a single file. Vector support includes high DPI editing with non-destructive layers and tools like path, line, ellipse, rectangle, and text. The powerful Node Graph enables complex effects and procedural animations, offering fine-grained control over image rendering. Pre-built node workspaces streamline workflows.\n\nAnimations can be frame-by-frame or procedurally generated, exportable as videos or spritesheets. The pixel art toolset includes a pixel-perfect brush, transform tools, and a non-destructive text tool.\n\nTo support full-time development, Pixi Labs Sp. z o.o. was established. A first paid extension, the Founder's Pack, offers workspaces like Card Builder, 3D Cube Texturing, Texture tiling, and Reusable Pixel-Art Animation, alongside unique palettes and an in-app badge. A live stream was held to showcase PixiEditor 2.0 and offer discounts.\n\nWhile requiring a Vulkan-compatible GPU and 64-bit system, PixiEditor 2.0 is a significant upgrade. Version 1.0 is still available as a beta.\n",
    "chinese_title": "PixiEditor 2.0 – 一款 FOSS 通用 2D 图形编辑器",
    "chinese_summary": "PixiEditor 2.0 于 2025 年 7 月 30 日发布，是一款免费开源的“通用 2D 编辑器”，它从像素艺术起家，逐步发展到可以处理栅格、矢量、动画和程序图形。它的目标是高度可配置，以适应不同的工作流程，而不仅仅是 Photoshop 的替代品。\n\n主要功能包括可切换的绘画、像素艺术和矢量编辑工具集，允许在单个文件中混合图形。矢量支持包括具有非破坏性图层的高 DPI 编辑以及路径、线条、椭圆、矩形和文本等工具。强大的节点图能够实现复杂的效果和程序动画，从而可以精细地控制图像渲染。预构建的节点工作区简化了工作流程。\n\n动画可以是逐帧的或程序生成的，可以导出为视频或精灵表。像素艺术工具集包括像素完美的画笔、转换工具和非破坏性的文本工具。\n\n为了支持全职开发，成立了 Pixi Labs Sp. z o.o.。第一个付费扩展包，创始人包，提供了卡片生成器、3D 立方体纹理、纹理平铺和可重用的像素艺术动画等工作区，以及独特的调色板和应用内徽章。举办了直播活动来展示 PixiEditor 2.0 并提供折扣。\n\n虽然需要兼容 Vulkan 的 GPU 和 64 位系统，但 PixiEditor 2.0 是一次重大的升级。1.0 版本仍然作为测试版提供。"
  },
  {
    "id": "44772177",
    "title": "HTML-in-Canvas",
    "url": "https://github.com/WICG/html-in-canvas",
    "summary": "This article introduces a proposal for new HTML Canvas APIs that allow rendering HTML content directly into a `<canvas>` element for both Canvas 2D and WebGL. The goal is to address the limitations of current canvas implementations, particularly in areas like styled text, accessibility, and the integration of HTML content with shaders.\n\nThe proposal includes several new APIs: `layoutsubtree` (a canvas attribute to enable layout of descendant elements), `drawElement` (Canvas 2D method to render an element and its subtree), `texElement2D` (WebGL method to render an element into a texture), and `setHitTestRegions` (both Canvas 2D and WebGL to redirect hit tests from the canvas to the drawn element, enabling interactivity). A `fireOnEveryPaint` option is also added to ResizeObserverOptions to notify when drawn elements' DOM state changes, triggering canvas redraws.\n\nThese APIs enable use cases such as richer text rendering in canvas, improved accessibility by ensuring the fallback content matches the rendered content, composing HTML elements with shaders, and rendering HTML content within 3D scenes.\n\nThe document also provides details on developer trials, including how to enable the feature in Chrome Canary and cautions about potential privacy issues during the trial phase. Developers are encouraged to provide feedback on what content works and fails, missing canvas rendering context support, and accessibility improvements. Demos showcase API usage in rendering HTML into a GL texture, and utilizing interactive elements within a canvas.\n",
    "chinese_title": "画布中的HTML",
    "chinese_summary": "本文介绍了一项关于新型 HTML Canvas API 的提案，该提案允许将 HTML 内容直接渲染到 `<canvas>` 元素中，适用于 Canvas 2D 和 WebGL。其目标是解决当前 canvas 实现的局限性，尤其是在样式化文本、可访问性以及 HTML 内容与着色器集成等领域。\n\n该提案包括几个新的 API：`layoutsubtree`（一个 canvas 属性，用于启用后代元素的布局），`drawElement`（Canvas 2D 方法，用于渲染一个元素及其子树），`texElement2D`（WebGL 方法，用于将一个元素渲染成纹理）以及 `setHitTestRegions`（Canvas 2D 和 WebGL 均有，用于将点击测试从 canvas 重定向到绘制的元素，从而实现交互性）。此外，还向 ResizeObserverOptions 添加了一个 `fireOnEveryPaint` 选项，用于在绘制元素的 DOM 状态更改时发出通知，从而触发 canvas 重绘。\n\n这些 API 能够实现诸如 canvas 中更丰富的文本渲染、通过确保回退内容与渲染内容匹配来改善可访问性、将 HTML 元素与着色器组合以及在 3D 场景中渲染 HTML 内容等用例。\n\n该文档还提供了关于开发者试用的详细信息，包括如何在 Chrome Canary 中启用该功能以及有关试用阶段潜在隐私问题的注意事项。鼓励开发者就哪些内容有效和失败、缺失的 canvas 渲染上下文支持以及可访问性改进提供反馈。演示展示了 API 在将 HTML 渲染到 GL 纹理中以及在 canvas 中利用交互式元素方面的用法。"
  },
  {
    "id": "44766962",
    "title": "At a Loss for Words: A flawed idea is teaching kids to be poor readers (2019)",
    "url": "https://www.apmreports.org/episode/2019/08/22/whats-wrong-how-schools-teach-reading",
    "summary": "In \"At a Loss for Words,\" Emily Hanford investigates how a flawed theory called \"three cueing\" is hindering reading education in American schools. This theory, popularized by Ken Goodman and Marie Clay, suggests readers use graphic, syntactic, and semantic cues to guess words, rather than decoding them. Hanford highlights Molly Woodworth's struggle with reading and her dismay at seeing her child taught the same ineffective strategies.\n\nCognitive scientists have debunked three cueing, demonstrating that skilled readers rely on quickly and accurately recognizing words as a sequence of letters, without heavy reliance on context. Research by Keith Stanovich confirmed that weaker readers depend more on context. Despite scientific evidence, three cueing persists in schools, influencing curriculum and teaching practices. This is evident in reader's workshop, where children are taught to use \"picture power\" and other context clues to guess words. The article argues that this approach makes it harder for children to learn to read proficiently. It connects poor reading skills to negative outcomes such as high school dropouts and involvement in the criminal justice system. The piece criticizes the continued investment in cueing-based teaching methods and calls for a shift towards scientifically-backed approaches for teaching reading.\n",
    "chinese_title": "词穷语塞：一个有缺陷的理念正在教坏孩子们的阅读能力（2019）",
    "chinese_summary": "在《失语症》中，艾米丽·汉福德调查了一种名为“三提示法”的错误理论如何阻碍美国学校的阅读教育。这种理论由肯·古德曼和玛丽·克莱推广，认为读者使用图像、句法和语义线索来猜测单词，而不是解码它们。汉福德着重讲述了莫莉·伍德沃思在阅读上的挣扎，以及她看到自己的孩子被教授同样无效的策略时的沮丧。\n\n认知科学家已经驳斥了三提示法，证明熟练的读者依赖于快速、准确地识别单词作为一系列字母，而不过度依赖语境。基思·斯塔诺维奇的研究证实，较弱的读者更依赖语境。尽管有科学证据，三提示法仍然存在于学校中，影响着课程和教学实践。这在读者工作坊中很明显，孩子们被教导使用“图片力量”和其他语境线索来猜测单词。文章认为，这种方法使得孩子们更难学会熟练阅读。它将糟糕的阅读技能与负面结果联系起来，例如高中辍学和卷入刑事司法系统。文章批评了对基于提示的教学方法的持续投入，并呼吁转向基于科学的阅读教学方法。"
  },
  {
    "id": "44772917",
    "title": "C++26 Reflections adventures and compile-time UML",
    "url": "https://www.reachablecode.com/2025/07/31/c26-reflections-adventures-compile-time-uml/",
    "summary": "This article explores using C++26's reflection features to automatically generate UML diagrams from C++ code at compile time. The author tackles the problem of manually creating UML diagrams, which is often tedious and time-consuming, by leveraging the new `lift` (^^) and `splice` operators to reflect on C++ types and their members.\n\nThe core idea revolves around a `make_class_graph` function template that uses `std::meta::info` to represent reflected types and values. This function recursively traverses the members of a class, extracting information about their types and relationships. A key challenge is managing the \"meta\" space, where reflections of types and values are both represented as `std::meta::info`, requiring checks using `std::meta::is_type` to determine the kind of reflection being handled.\n\nThe generated UML diagram is built as a string at compile time using `std::define_static_string`, which converts a compile-time `std::string` into a string literal that can be returned from a `consteval` function. The author also discusses the use of `std::meta::access_context` to manage access rules during reflection.  Finally, functions such as `std::meta::nonstatic_data_members_of` and `std::meta::info::display_string_of` are used to access class members and their names. The author acknowledges the slight complexity introduced by needing to differentiate between type and value reflections but considers it a worthwhile trade-off for the power of C++26's reflection capabilities. The output is a PlantUML diagram ready for visualization.\n",
    "chinese_title": "C++26 反射探索与编译时 UML",
    "chinese_summary": "本文探讨了如何利用C++26的反射特性，在编译时从C++代码自动生成UML图。作者利用新的`lift` (^^) 和 `splice` 运算符来反映 C++ 类型及其成员，从而解决手动创建 UML 图的繁琐耗时问题。\n\n核心思想围绕一个`make_class_graph`函数模板展开，该模板使用`std::meta::info`来表示反射的类型和值。此函数递归地遍历类的成员，提取有关其类型和关系的信息。一个关键挑战是管理“元”空间，其中类型的反射和值的反射都表示为`std::meta::info`，需要使用`std::meta::is_type`来确定正在处理的反射类型。\n\n生成的UML图在编译时使用`std::define_static_string`构建为字符串，该函数将编译时`std::string`转换为可以从`consteval`函数返回的字符串字面量。作者还讨论了使用`std::meta::access_context`来管理反射期间的访问规则。最后，使用`std::meta::nonstatic_data_members_of`和`std::meta::info::display_string_of`等函数来访问类成员及其名称。作者承认需要区分类型反射和值反射带来了一点复杂性，但认为这对于C++26反射功能的强大性来说是值得的。 输出是可供可视化的 PlantUML 图。"
  },
  {
    "id": "44735059",
    "title": "LangExtract: Python library for extracting structured data from language models",
    "url": "https://github.com/google/langextract",
    "summary": "LangExtract is a Python library that utilizes LLMs to extract structured information from unstructured text based on user-defined instructions and examples. It excels at tasks like clinical note processing, identifying key details, and maintaining a consistent output schema.\n\nKey features include precise source grounding (mapping extractions to their origin), reliable structured outputs via controlled generation, optimized processing for long documents via chunking and parallel processing, interactive visualization for review, flexible LLM support (cloud-based and local like Ollama), and adaptability to various domains without fine-tuning.\n\nThe library requires defining a prompt and providing examples to guide the model. It supports models like Gemini and OpenAI (with specific configuration needs). Results can be saved in JSONL format and visualized via an interactive HTML.\n\nInstallation can be done via pip (PyPI), from source, or using Docker. Using cloud models requires an API key, which can be set through environment variables, a `.env` file, or (less ideally) directly in the code.\n\nThe documentation provides example use cases, including Romeo and Juliet full text extraction, medication extraction, and radiology report structuring (RadExtract demo). Contributions are welcome, and the project utilizes automated formatting tools and pre-commit hooks to maintain code style. The library is distributed under the Apache 2.0 License, with additional terms for health-related applications.\n",
    "chinese_title": "LangExtract：用于从语言模型中提取结构化数据的 Python 库",
    "chinese_summary": "LangExtract 是一个 Python 库，利用大型语言模型（LLM）根据用户定义的指令和示例从非结构化文本中提取结构化信息。它擅长处理临床笔记、识别关键细节和保持一致的输出模式等任务。\n\n其主要功能包括精确的源头定位（将提取的内容映射到其来源）、通过受控生成实现可靠的结构化输出、通过分块和并行处理优化长文档的处理、交互式可视化审查、灵活的 LLM 支持（云端和本地，例如 Ollama），以及无需微调即可适应各种领域。\n\n该库需要定义提示并提供示例来指导模型。它支持 Gemini 和 OpenAI 等模型（具有特定的配置需求）。结果可以保存为 JSONL 格式，并通过交互式 HTML 进行可视化。\n\n可以通过 pip (PyPI)、从源代码或使用 Docker 安装。使用云模型需要 API 密钥，可以通过环境变量、`.env` 文件或（不太理想的）直接在代码中设置。\n\n文档提供了示例用例，包括罗密欧与朱丽叶全文提取、药物提取和放射学报告结构化（RadExtract 演示）。欢迎贡献，该项目利用自动格式化工具和 pre-commit 钩子来维护代码风格。该库根据 Apache 2.0 许可证分发，但与健康相关的应用程序有附加条款。"
  },
  {
    "id": "44730544",
    "title": "Online Collection of Keygen Music",
    "url": "https://keygenmusic.tk",
    "summary": "Keygenmusic.tk is an online tracker music player dedicated to providing music often found in keygens (software license generators). The site supports formats like .mod, .xm, .s3m, and .it.\n\nThe site is currently in beta (β15), and a changelog details updates from 2015 to 2025, highlighting improvements like Firefox compatibility, media key support, icon updates, playlist integration, a spectrum analyzer, favorites, search functionality, and updates to music packs from keygenmusic.net. The site explicitly states it contains no illegal content, only music from keygens.\n\nThe site is developed by Mikhailo Onikiienko and utilizes various libraries and tools including chiptune2.js, libopenmpt, emscripten, jsTabs, baron, Sergio Camalich's work, webaudio68, and the Darcula color scheme. It also mentions a shuffle on/off switcher.\n\nContact information is provided via email address keygenmusic.tk{at}outlook.com. The site also indicates potential issues with browsers that do not support AudioContext, recommending Firefox for optimal functionality. The site tracks total and unique tracks played, however there is no data present in the document.\n",
    "chinese_title": "keygen音乐在线合集",
    "chinese_summary": "Keygenmusic.tk 是一个在线跟踪音乐播放器，专门提供常见于注册机（软件许可证生成器）中的音乐。该网站支持 .mod、.xm、.s3m 和 .it 等格式。\n\n该网站目前处于测试阶段 (β15)，更新日志详细记录了从 2015 年到 2025 年的更新，重点介绍了 Firefox 兼容性、媒体键支持、图标更新、播放列表集成、频谱分析仪、收藏夹、搜索功能以及来自 keygenmusic.net 的音乐包的更新等改进。该网站明确声明不包含非法内容，只包含来自注册机的音乐。\n\n该网站由 Mikhailo Onikiienko 开发，并利用了各种库和工具，包括 chiptune2.js、libopenmpt、emscripten、jsTabs、baron、Sergio Camalich 的作品、webaudio68 和 Darcula 配色方案。它还提到了一个随机播放开/关切换器。\n\n通过电子邮件地址 keygenmusic.tk{at}outlook.com 提供联系方式。该网站还指出不支持 AudioContext 的浏览器可能存在问题，建议使用 Firefox 以获得最佳功能。该网站跟踪播放的总曲目数和唯一曲目数，但文档中没有数据。"
  },
  {
    "id": "44737296",
    "title": "Descent of Inanna into the Underworld",
    "url": "https://en.wikipedia.org/wiki/Descent_of_Inanna_into_the_Underworld",
    "summary": "The \"Descent of Inanna into the Underworld\" is a Sumerian myth (with an Akkadian version titled \"Descent of Ishtar into the Underworld\") detailing the goddess Inanna's journey to the Underworld to challenge her sister Ereshkigal, the Queen of the Dead. Inanna's descent leads to her death and suspension as a corpse until Enki intervenes, restoring her to life. However, her return requires a substitute, leading to her spouse Dumuzi being sent to the Underworld. Later, due to his sister Geshtinanna's pleas, Dumuzi's sentence is lessened to spending only part of the year in the Underworld, with his sister taking his place for the remaining time.\n\nThe myth exists in Sumerian and Akkadian versions, the latter discovered first. The Sumerian version, older and longer, required extensive reconstruction from tablet fragments. Initially, scholars misinterpreted Inanna's motive as searching for Dumuzi, influenced by the Orpheus myth. However, it was later understood that she sought to expand her power.\n\nKey characters include Inanna (Ishtar), a multi-faceted goddess of love, war, and fertility; Ereshkigal, the static Queen of the Underworld; Gugalanna, Ereshkigal's husband; Namtar, her vizier and deity of disease; and Enki, the god of freshwater and wisdom who restores Inanna to life. The galatura and kurgara, beings of ambiguous gender, also play a role, navigating the Underworld to appease Ereshkigal.\n\nThe myth offers insights into Mesopotamian culture, influencing later civilizations and providing material for psychoanalytic theory. Recent re-examinations suggest Inanna herself intervened for Dumuzi's seasonal return, highlighting the ongoing interpretation and evolution of the story.\n",
    "chinese_title": "伊南娜下冥府",
    "chinese_summary": "《伊南娜下冥界》是苏美尔神话（阿卡德版本标题为《伊什塔尔下冥界》），讲述了女神伊南娜前往冥界挑战她的姐姐、亡灵女王埃列什基伽勒的故事。伊南娜的下行导致她的死亡和作为尸体的悬挂，直到恩基介入，让她复活。然而，她的回归需要一个替代者，导致她的配偶杜牧兹被送往冥界。后来，由于他妹妹格什廷安娜的恳求，杜牧兹的刑期被缩短为一年中只有一部分时间在冥界度过，他的妹妹在剩余的时间里代替他。\n\n这个神话有苏美尔语和阿卡德语版本，后者首先被发现。苏美尔语版本更古老也更长，需要从石板碎片中进行大量重建。最初，学者们误解了伊南娜的动机是寻找杜牧兹，受到了俄耳甫斯神话的影响。然而，后来人们了解到她寻求扩张自己的权力。\n\n主要人物包括：伊南娜（伊什塔尔），一位多面女神，掌管爱情、战争和生育；埃列什基伽勒，静止的冥界女王；古迦兰纳，埃列什基伽勒的丈夫；南塔尔，她的维齐尔和疾病之神；以及恩基，淡水和智慧之神，他使伊南娜复活。格拉图拉和库尔加拉，性别模糊的存在，也发挥了作用，在冥界穿梭以安抚埃列什基伽勒。\n\n这个神话提供了对美索不达米亚文化的洞见，影响了后来的文明，并为精神分析理论提供了素材。最近的重新审视表明，伊南娜本人介入了杜牧兹的季节性回归，突出了故事的持续解读和演变。"
  },
  {
    "id": "44774027",
    "title": "Seed7 – The Extensible Programming Language",
    "url": "https://seed7.net",
    "summary": "Seed7 is a general-purpose, extensible programming language designed by Thomas Mertes, aiming for a higher level of abstraction compared to languages like Ada, C/C++, and Java. Both an interpreter and compiler (translating to C) are available as open-source software.\n\nKey features include the ability to define new statements and operators easily, and the use of first-class types, allowing for elegant templates and generics without special syntax. Object orientation is selectively implemented where advantageous. Seed7 draws inspiration from Pascal, Ada, C, C++, and Java.\n\nSeed7 boasts features like user-defined statements/operators, predefined constructs defined in libraries, interfaces and multiple dispatch for object orientation, static type checking, no automatic casts, and automatic memory management *without* garbage collection. It also supports exception handling, debugging, overflow detection for integer computations, and unlimited-size numbers (bigInteger, bigRational). Function, operator, and statement overloading is supported, alongside various predefined types.\n\nSeed7 aims for source code portability across operating systems and offers a database-independent API compatible with multiple databases. It runs under Linux, various Unix versions, and Windows. The interpreter and example programs are GPL licensed, while the runtime library is LGPL licensed.\n",
    "chinese_title": "Seed7 – 可扩展的程序设计语言",
    "chinese_summary": "Seed7 是一种通用、可扩展的编程语言，由 Thomas Mertes 设计，旨在提供比 Ada、C/C++ 和 Java 等语言更高的抽象级别。 解释器和编译器（转换为 C）均以开源软件形式提供。\n\n主要特性包括轻松定义新语句和运算符的能力，以及使用一等类型，从而无需特殊语法即可实现优雅的模板和泛型。 对象导向有选择性地在有利的地方实现。 Seed7 从 Pascal、Ada、C、C++ 和 Java 中汲取灵感。\n\nSeed7 拥有诸如用户定义的语句/运算符、库中定义的预定义构造、用于对象导向的接口和多重分派、静态类型检查、无自动类型转换以及 *没有* 垃圾回收的自动内存管理等特性。 它还支持异常处理、调试、整数计算的溢出检测以及无限大小的数字（bigInteger、bigRational）。 支持函数、运算符和语句重载，以及各种预定义类型。\n\nSeed7 旨在实现跨操作系统的源代码可移植性，并提供与多个数据库兼容的独立于数据库的 API。 它可以在 Linux、各种 Unix 版本和 Windows 下运行。 解释器和示例程序采用 GPL 许可，而运行时库采用 LGPL 许可。"
  },
  {
    "id": "44746062",
    "title": "Show HN: Implementation of DDPM (Denoising Diffusion Probabilistic Models)",
    "url": "https://github.com/alenMangattu/DDPM-Denoising-Diffusion-Probabilistic-Models",
    "summary": "This \"Show HN\" post introduces a minimal implementation of Denoising Diffusion Probabilistic Models (DDPMs). DDPMs are a class of generative models known for their ability to generate high-quality images and other data.\n\nThe post highlights a simplified, \"bare bones\" implementation, implying a focus on clarity and conciseness over optimization or advanced features. This suggests the implementation is intended to be easily understandable and serve as a learning resource for those interested in grasping the core concepts of DDPMs.\n\nThe author's casual tone (\"ig\") indicates an informal presentation and perhaps a beginner-friendly approach. While lacking specifics about the implementation's details, the post serves as a signal for those interested in a simple, introductory version of the DDPM algorithm. The \"Show HN\" tag on Hacker News implies the author is sharing their project for feedback and discussion within the community. Therefore, users interested in learning about DDPMs or contributing to the project are encouraged to examine the linked code directly.\n",
    "chinese_title": "Show HN: DDPM (去噪扩散概率模型) 实现",
    "chinese_summary": "此“Show HN”帖子介绍了一种去噪扩散概率模型(DDPM)的极简实现。DDPM是一类生成模型，以其生成高质量图像和其他数据的能力而闻名。\n\n该帖子重点介绍了一种简化的“骨架式”实现，这意味着侧重于清晰和简洁，而不是优化或高级功能。这表明该实现旨在易于理解，并作为有兴趣掌握DDPM核心概念的人的学习资源。\n\n作者的随意语气(\"ig\")表明演示方式较为非正式，可能采用对初学者友好的方法。虽然缺乏关于实现细节的具体信息，但该帖子为那些对DDPM算法的简单入门版本感兴趣的人发出了信号。“Show HN”标签表明作者正在Hacker News上分享他们的项目，以征求社区内的反馈和讨论。因此，鼓励对学习DDPM或为该项目做出贡献的用户直接查看链接的代码。"
  },
  {
    "id": "44767433",
    "title": "Anandtech.com now redirects to its forums",
    "url": "https://forums.anandtech.com/",
    "summary": "Anandtech.com now redirects to its forums, a comprehensive online community focused on technology, hardware, software, and deals. The forums cover a wide range of topics including CPUs, motherboards, graphics cards, memory & storage, displays, power supplies, cases & cooling, laptops, networking, Apple products, peripherals, computer building, consumer electronics, console gaming, mobile devices, audio, TVs, software (Windows, Apple, Open Source, Operating Systems, Programming), PC games, distributed computing, security, shopping (deals and Black Friday), and social topics (OT Discussion Club, Politics, Technical Discussions, Garage, Health, Home & Garden, and forum issues).\n\nThe site highlights trending threads within the CPUs and Overclocking section and features a \"Latest Posts\" section showing recent activity across different forums. Users can join the AnandTech community to participate in discussions and seek expert advice. The forums also provide options to share content via social media platforms. AnandTech is part of Future plc.\n",
    "chinese_title": "Anandtech.com 现在重定向到其论坛。",
    "chinese_summary": "Anandtech.com 现在重定向至其论坛，这是一个专注于技术、硬件、软件和交易的综合性在线社区。论坛涵盖广泛的主题，包括 CPU、主板、显卡、内存与存储、显示器、电源、机箱与散热、笔记本电脑、网络、苹果产品、外设、电脑组装、消费电子产品、主机游戏、移动设备、音频、电视、软件（Windows、Apple、开源、操作系统、编程）、PC 游戏、分布式计算、安全、购物（交易和黑色星期五）以及社交话题（OT 讨论俱乐部、政治、技术讨论、车库、健康、家居与园艺以及论坛问题）。\n\n该网站突出显示 CPU 和超频版块的热门话题，并设有“最新帖子”版块，展示不同论坛的最新动态。用户可以加入 AnandTech 社区参与讨论并寻求专家建议。论坛还提供通过社交媒体平台分享内容的选项。AnandTech 是 Future plc 的一部分。"
  },
  {
    "id": "44745727",
    "title": "Ongoing Lean formalisation of the proof of Fermat's Last Theorem",
    "url": "https://github.com/ImperialCollegeLondon/FLT",
    "summary": "This article describes an open-source project dedicated to formalizing a proof of Fermat's Last Theorem using the Lean theorem prover. Led by Kevin Buzzard and funded by the EPSRC until September 2029, the project is hosted at Imperial College London. The project aims to implement a modern version of the Wiles/Taylor-Wiles proof, as planned by Richard Taylor. It provides links to resources explaining Fermat's Last Theorem, Lean, the motivations behind the project, the mathematical blueprint, and instructions on how individuals can contribute to the effort. The ultimate goal is to create a fully formalized and verified proof of Fermat's Last Theorem within the Lean environment.\n",
    "chinese_title": "费马大定理证明的Lean形式化持续进行中",
    "chinese_summary": "本文介绍一个开源项目，该项目致力于使用Lean定理证明器形式化证明费马大定理。该项目由凯文·巴扎德领导，并由EPSRC资助至2029年9月，位于伦敦帝国理工学院。该项目旨在实现理查德·泰勒计划的Wiles/Taylor-Wiles证明的现代版本。它提供了解释费马大定理、Lean、项目动机、数学蓝图以及个人如何为此做出贡献的资源链接。最终目标是在Lean环境中创建一个完全形式化和验证的费马大定理证明。"
  },
  {
    "id": "44747786",
    "title": "Show HN: My Bytecode Optimizer Beats Copilot by 2X",
    "url": "https://deviantabstraction.com/2025/07/29/how-my-bytecode-optimizer-beats-copilot-by-2x/",
    "summary": "This \"Show HN\" article presents a side-project called SuperVM, a bytecode optimizer, and compares its performance against Copilot (specifically GPT-4o and Sonnet) on a simple fractal generator task. The author, Deviant/Abstraction, argues that specialized tools can outperform general-purpose AI models, even at an early stage of development.\n\nThe experiment involved giving Copilot the prompt \"make it faster\" for a hand-coded fractal generator and comparing the resulting frames per second (FPS) against the original code and SuperVM's output. SuperVM achieved an average of 99.8 FPS, doubling the original 13.8 FPS, and significantly exceeding Copilot's 49.3 FPS. The key difference is SuperVM's ability to directly edit bytecode and leverage formal proofs for optimization.\n\nThe author highlights that Copilot identified and parallelized a loop, while SuperVM proved the pixel iteration loop was side-effect-free, enabling it to split it into multiple worker threads and maintain sequential GUI repainting. SuperVM also completed the compilation in seconds, compared to minutes for Copilot. While acknowledging the limitations of the narrow test case, the author suggests this demonstrates the potential of specialized tools to complement LLMs, particularly in code optimization. The author intends to test SuperVM on more general benchmarks, including inference serving, in the future.\n",
    "chinese_title": "展示 HN：我的字节码优化器性能是 Copilot 的两倍",
    "chinese_summary": "此“Show HN”文章介绍了一个名为SuperVM的副项目，它是一个字节码优化器，并将其在简单分形生成器任务上的性能与Copilot（特别是GPT-4o和Sonnet）进行了比较。作者Deviant/Abstraction认为，即使在早期开发阶段，专用工具也能胜过通用人工智能模型。\n\n该实验要求Copilot针对一个手工编写的分形生成器发出“让它更快”的提示，并将产生的每秒帧数 (FPS) 与原始代码和 SuperVM 的输出进行比较。SuperVM 平均实现了 99.8 FPS，是原始 13.8 FPS 的两倍，并显著超过了 Copilot 的 49.3 FPS。关键区别在于 SuperVM 能够直接编辑字节码并利用形式化证明进行优化。\n\n作者强调，Copilot 识别并并行化了一个循环，而 SuperVM 证明像素迭代循环没有副作用，使其能够将其拆分为多个工作线程并保持顺序 GUI 重绘。SuperVM 还可以在几秒钟内完成编译，而 Copilot 需要几分钟。虽然承认了狭窄测试用例的局限性，但作者认为这表明了专用工具在补充大型语言模型方面的潜力，尤其是在代码优化方面。作者计划将来在更通用的基准上测试 SuperVM，包括推理服务。"
  },
  {
    "id": "44766758",
    "title": "A.I. researchers are negotiating $250M pay packages",
    "url": "https://www.nytimes.com/2025/07/31/technology/ai-researchers-nba-stars.html",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "人工智能研究员正在洽谈2.5亿美元的薪酬方案。",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "44767555",
    "title": "The Art of Multiprocessor Programming 2nd Edition Book Club",
    "url": "https://eatonphil.com/2025-art-of-multiprocessor-programming.html",
    "summary": "This document announces a book club focused on \"The Art of Multiprocessor Programming 2nd Edition\" by Herlihy, Shavit, Luchangco, and Spear (2020). The book club is part of the Software Internals Email Book Club and will conduct discussions via a Google Group, requiring a Google account. All communication will be text-based; there will be no video calls.\n\nThe club will cover one chapter per week, starting August 16th, 2024, with an introduction, and continuing through December 13th, 2024, covering barriers. Participants are expected to read each chapter before the corresponding discussion date.\n\nEach week, a designated \"discussion starter\" will initiate the conversation with a brief email sharing personal reflections on the chapter's content, rather than simply summarizing it. The goal is to foster engaging and relatable discussions based on individual experiences and interpretations.\n\nInterested individuals can sign up through a provided form. Feedback and inquiries can be directed to the organizer via email or Twitter. The organizer emphasizes the importance of obtaining the 2nd Edition of the book.\n",
    "chinese_title": "多处理器编程艺术（第二版）读书会",
    "chinese_summary": "本书宣布成立一个读书会，专注于Herlihy、Shavit、Luchangco和Spear于2020年出版的《多处理器编程的艺术（第二版）》。该读书会是软件内幕邮件读书俱乐部的一部分，将通过Google Group进行讨论，需要一个Google帐户。所有交流都将以文本形式进行；不会有视频通话。\n\n读书会将每周讨论一章，从2024年8月16日开始，进行介绍，并持续到2024年12月13日，涵盖障碍。参与者需要在相应的讨论日期之前阅读每一章。\n\n每周，指定的“讨论发起者”将通过简短的电子邮件分享对该章节内容的个人思考来启动对话，而不是简单地总结它。目标是基于个人经验和解读，培养引人入胜且具有相关性的讨论。\n\n感兴趣的人可以通过提供的表格注册。反馈和疑问可以通过电子邮件或Twitter发送给组织者。组织者强调获取本书第二版的重要性。"
  },
  {
    "id": "44736854",
    "title": "Build Your Own Minisforum N5 Inspired Mini NAS: A Comprehensive Guide",
    "url": "https://jackharvest.com/index.php/2025/07/27/build-your-own-minisforum-n5-inspired-mini-nas-a-comprehensive-guide/",
    "summary": "This article provides a comprehensive guide to building a DIY mini NAS inspired by the Minisforum N5, but designed to be more affordable and flexible by reusing existing mini PCs. The author, jackharvest, details the design goals: fitting on a small 3D printer bed (180x180mm), mirroring the aesthetics of the N5, and maintaining low power consumption with an easy build process (no supports needed for the main pieces).\n\nThe design, created in Shapr3D, will be released as raw files later. The build involves 3D printing various parts in PETG and TPU, including the main body, magnetic faceplate grabbers, motherboard offsets, feet, and fan screws.\n\nThe guide provides detailed instructions for assembling the NAS, focusing on the hard drive bay zone, mini PC drawer zone, and the power section. A dual-power cable approach (19V for the mini PC and 12V for the drives) is used for efficiency. The author offers step-by-step instructions with images for connecting power, installing the backplane PCB, and managing cables. The mini PC is mounted inside a drawer, and the hard drives are connected via a M.2 SATA port adapter.\n\nFinally, the article includes an estimated cost breakdown, assuming the user has a 3D printer but otherwise needs to purchase all the components.\n",
    "chinese_title": "打造你的专属 Minisforum N5 灵感迷你 NAS：一份全面指南",
    "chinese_summary": "本文提供了一份全面的指南，教你如何打造一款DIY迷你NAS，其灵感来源于Minisforum N5，但通过复用现有的迷你PC，使其更经济实惠且更灵活。作者jackharvest详细介绍了设计目标：适合在小型3D打印机床（180x180mm）上打印，模仿N5的美学设计，并保持低功耗和简易的组装过程（主要部件无需支撑）。\n\n该设计在Shapr3D中创建，稍后将发布原始文件。构建过程包括使用PETG和TPU材料3D打印各种部件，包括主体、磁性面板夹具、主板偏移柱、底脚和风扇螺丝。\n\n该指南提供了详细的NAS组装说明，重点介绍了硬盘仓区域、迷你PC抽屉区域和电源部分。采用双电源线方案（迷你PC使用19V，硬盘使用12V）以提高效率。作者提供了带有图片的逐步说明，指导如何连接电源、安装背板PCB和管理线缆。迷你PC安装在抽屉内，硬盘通过M.2 SATA端口适配器连接。\n\n最后，文章还包括一份估算成本明细，假设用户拥有3D打印机，但需要购买所有其他组件。"
  },
  {
    "id": "44773919",
    "title": "Writing a basic service for GNU Guix",
    "url": "https://tannerhoelzel.com/gnu-shepherd-simple-service.html",
    "summary": "This article details the process of creating a service for GNU Guix to automatically start and manage the `kmonad` keyboard remapper daemon. It begins by outlining the motivation for creating a dedicated Guix service rather than using alternative methods like cron jobs.\n\nThe author then explores the Guix documentation and existing examples, specifically the \"Game Services\" and the `wesnothd` service, to understand how to define a custom service type. The article walks through the steps of defining `kmonad-service-type`, including extending the `account-service-type` with a dedicated \"kmonad-daemon\" user and group, and extending the `shepherd-root-service-type` to manage the daemon's lifecycle using the Shepherd init system.\n\nA key aspect is defining `kmonad-shepherd-service`, which leverages G-Expressions and `make-forkexec-constructor` to start `kmonad` with a specified configuration file (`.kbd`) and logging. The article explains the importance of defining service requirements like `udev` and `user-processes` to ensure proper startup dependencies.\n\nFinally, the code is packaged into a Guix module (`my/services/kmonad.scm`), and the article demonstrates how to incorporate the `kmonad-service-type` into the system configuration, including adding the necessary user groups, packages, and udev rules. The article concludes with a command to reconfigure the Guix system, activating the new service.\n",
    "chinese_title": "为 GNU Guix 编写基础服务",
    "chinese_summary": "本文详细介绍了为GNU Guix创建一项服务，以自动启动和管理`kmonad`键盘重映射守护进程的过程。首先概述了创建专用Guix服务而不是使用诸如cron job等替代方法的原因。\n\n作者随后探索了Guix文档和现有示例，特别是“游戏服务”和`wesnothd`服务，以了解如何定义自定义服务类型。文章逐步介绍了定义`kmonad-service-type`的步骤，包括使用专用的“kmonad-daemon”用户和组扩展`account-service-type`，以及扩展`shepherd-root-service-type`以使用Shepherd init系统管理守护进程的生命周期。\n\n一个关键方面是定义`kmonad-shepherd-service`，它利用G-Expressions和`make-forkexec-constructor`，以指定的配置文件（`.kbd`）和日志记录来启动`kmonad`。文章解释了定义诸如`udev`和`user-processes`等服务需求的重要性，以确保正确的启动依赖关系。\n\n最后，该代码被打包到Guix模块（`my/services/kmonad.scm`）中，文章演示了如何将`kmonad-service-type`整合到系统配置中，包括添加必要的用户组、软件包和udev规则。文章最后给出了一个重新配置Guix系统的命令，以激活新服务。"
  },
  {
    "id": "44777869",
    "title": "UN Report Finds UN Reports Are Not Widely Read",
    "url": "https://www.reuters.com/world/un-report-finds-united-nations-reports-are-not-widely-read-2025-08-01/",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "联合国报告发现联合国报告阅读量不高",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "44775485",
    "title": "EHRs – The Hidden Distraction in Your Doctor's Office",
    "url": "https://spectrum.ieee.org/electronic-health-records",
    "summary": "This Computing Magazine article, \"EHRs – The Hidden Distraction in Your Doctor's Office,\" examines the U.S.'s $100 billion investment in Electronic Health Record (EHR) systems since 2004, revealing both progress and persistent problems. While EHRs have improved access to medical information compared to the past, the vision of a seamless, interoperable system remains elusive.\n\nThe article highlights how the HITECH Act of 2009, part of the economic stimulus, allocated $49 billion to promote EHR adoption. This led to widespread implementation but also created fragmented \"electronic silos\" due to a lack of interoperability standards and the presence of diverse EHR systems across different specialists.\n\nThe rush to adopt EHRs under HITECH incentives overlooked critical systems-engineering principles and human-centered design, resulting in costly, poorly designed, and insecure systems. These issues contribute to clinician burnout, data breaches, and new sources of medical errors. Furthermore, the article points out the unintended consequence of doctors spending excessive time, an average of 4.5 hours a day, on data entry, detracting from patient interaction and professional satisfaction. The article suggests a need for a more thoughtful and integrated approach to EHR implementation, emphasizing interoperability, usability, and security, to avoid worsening the U.S. healthcare system.\n",
    "chinese_title": "电子病历——诊所里不易察觉的干扰",
    "chinese_summary": "计算机杂志文章《电子病历——医生诊所里隐藏的干扰》探讨了自2004年以来美国在电子健康记录（EHR）系统上投资的1000亿美元，揭示了进步和持续存在的问题。虽然与过去相比，电子病历改善了医疗信息的获取，但无缝、互操作系统的愿景仍然难以实现。\n\n该文章强调了2009年的《高科技法案》（HITECH Act）作为经济刺激计划的一部分，拨款490亿美元用于促进电子病历的采用。这导致了广泛的实施，但也由于缺乏互操作性标准以及不同专科医生之间存在各种电子病历系统，造成了分散的“电子孤岛”。\n\n在《高科技法案》激励下仓促采用电子病历忽略了关键的系统工程原则和以人为本的设计，导致了成本高昂、设计糟糕且不安全的系统。这些问题导致临床医生倦怠、数据泄露和新的医疗错误来源。此外，文章指出，医生每天花费过多时间（平均每天4.5小时）进行数据录入，从而分散了患者互动和职业满意度，这是一个意想不到的后果。文章建议需要一种更周全和集成的电子病历实施方法，强调互操作性、可用性和安全性，以避免美国医疗保健系统恶化。"
  },
  {
    "id": "44739813",
    "title": "Flipping Bits in the World",
    "url": "https://opuslabs.substack.com/p/how-to-flip-bits-in-the-world",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "翻转世界的比特",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "44741078",
    "title": "Remote hosting for your telescope",
    "url": "https://www.sierra-remote.com/",
    "summary": "Sierra Remote Observatories (SRO) offers remote telescope hosting services at their site in the Sierra Nevada Mountains. They provide infrastructure, technical support, and excellent seeing conditions for astronomical imaging, data acquisition, satellite tracking, and space communications.\n\nSRO boasts over 180 operational telescopes on-site and has been in operation since 2007, catering to universities, science institutes, space industry professionals, and astrophotographers. Key features include:\n\n*   Exceptional Seeing: 1 arcsecond summer seeing, 1.2 arcsecond winter seeing and subarcsecond peak seeing, dark skies, and minimal wind.\n*   Reliable Infrastructure: 24/7 technical support, fiber optic internet (1 Gbps, with higher speeds available), Starlink backup, secure VPN, on-site machine shop, and generator backup.\n*   Accessibility: Easy access from Fresno-Yosemite International Airport.\n\nSRO offers telescope hosting in shared, private, and custom observatories. Hosting packages include pier space, power, internet, network services, telemetry, and on-site support. They also offer telescope rentals through iTelescope.net, which operates a 24\" PlaneWave CDK at SRO. For those looking to buy, rent or share telescopes, SRO has a Billboard section on the website. The base hosting price starts at $600/month.\n",
    "chinese_title": "望远镜远程托管",
    "chinese_summary": "塞拉遥感天文台(SRO)在内华达山脉提供远程望远镜托管服务，为天文成像、数据采集、卫星跟踪和太空通信提供基础设施、技术支持和优异的视宁度。\n\nSRO拥有超过180台在运行的望远镜，自2007年以来一直为大学、科研机构、航天工业专业人士和天文摄影师提供服务。主要特点包括：\n\n*   卓越的视宁度：夏季视宁度1角秒，冬季视宁度1.2角秒，峰值视宁度小于1角秒，暗夜环境，以及极小的风力。\n*   可靠的基础设施：24/7全天候技术支持，光纤互联网（1 Gbps，可提供更高的速度），星链备份，安全VPN，现场机加工车间和发电机备份。\n*   便利的交通：从弗雷斯诺-约塞米蒂国际机场可轻松抵达。\n\nSRO在共享、私人和定制天文台中提供望远镜托管服务。托管套餐包括墩位空间、电力、互联网、网络服务、遥测和现场支持。 他们还通过iTelescope.net提供望远镜租赁服务，该公司在SRO运营一台24英寸的PlaneWave CDK望远镜。 对于那些希望购买、租赁或共享望远镜的人，SRO网站上有一个公告栏部分。 基础托管价格起价为每月600美元。"
  },
  {
    "id": "44768714",
    "title": "Browser extension and local backend that automatically archives YouTube videos",
    "url": "https://github.com/andrewarrow/starchive",
    "summary": "Starchive is a system designed to automatically archive YouTube videos you visit. It consists of a Firefox browser extension and a local Go backend. The extension detects YouTube video pages, extracts the video ID, and sends it to the Go backend.\n\nThe Go backend, running a server on port 3009, uses `yt-dlp` and `ffmpeg` to download the video and convert it to MOV format with h264_videotoolbox encoding, leveraging hardware acceleration. It also aims to download English subtitles in VTT format (currently disabled for retry loops). Videos are saved in the `./data/` directory.\n\nThe Firefox extension has a content script (`content.js`) to identify YouTube video pages, a background script (`background.js`) to communicate with the Go backend API, and a popup interface (`popup.html/js`) for manual data fetching.\n\nTo use Starchive, you first start the Go backend (`go run .`), then load the Firefox extension. Visiting a YouTube video page then automatically triggers the archiving process. The system requires `yt-dlp`, `ffmpeg`, and Go to function. The author explicitly states this project is not associated with the website starchive.io.\n",
    "chinese_title": "自动存档YouTube视频的浏览器扩展和本地后端",
    "chinese_summary": "Starchive 是一个旨在自动归档您访问的 YouTube 视频的系统。它包含一个 Firefox 浏览器扩展和一个本地 Go 后端。该扩展程序检测 YouTube 视频页面，提取视频 ID，并将其发送到 Go 后端。\n\nGo 后端在端口 3009 上运行服务器，使用 `yt-dlp` 和 `ffmpeg` 下载视频并将其转换为采用 h264_videotoolbox 编码的 MOV 格式，从而利用硬件加速。它还旨在下载 VTT 格式的英文字幕（目前因重试循环而禁用）。视频保存在 `./data/` 目录中。\n\nFirefox 扩展具有一个内容脚本 (`content.js`) 用于识别 YouTube 视频页面，一个后台脚本 (`background.js`) 用于与 Go 后端 API 通信，以及一个弹出界面 (`popup.html/js`) 用于手动获取数据。\n\n要使用 Starchive，您首先启动 Go 后端 (`go run .`)，然后加载 Firefox 扩展。访问 YouTube 视频页面将自动触发归档过程。该系统需要 `yt-dlp`、`ffmpeg` 和 Go 才能运行。作者明确声明此项目与网站 starchive.io 无关。"
  },
  {
    "id": "44766718",
    "title": "Compressing Icelandic name declension patterns into a 3.27 kB trie",
    "url": "https://alexharri.com/blog/icelandic-name-declension-trie",
    "summary": "This article details the creation of a JavaScript library for applying grammatical cases to Icelandic personal names. Icelandic uses declension, changing noun forms based on grammatical case, which is challenging as names are typically stored in the nominative case. The author addresses this by creating a library that derives declension rules from public Icelandic data, specifically the Database of Icelandic Morphology (DIM) and the Personal Names Register.\n\nThe library compresses the data into a trie-like data structure to minimize bundle size. The initial approach involved storing declension data as an array of name forms, but this proved too large. A more efficient \"suffix encoding\" method was implemented, storing the longest common prefix and suffixes for each name's forms. A trie data structure is used to map reversed name strings to these suffix encodings, grouping names with similar endings. Trie compression is then applied, consolidating subtrees with common values, further reducing data size.\n\nThe compression leads to generalization; the library can now handle names not explicitly in the initial dataset by recognizing patterns in suffixes. The final library achieves a bundle size under 4.5kB gzipped, making it suitable for inclusion in web applications without significantly increasing their size, and allowing for correct grammatical case usage for Icelandic names in user interfaces.\n",
    "chinese_title": "将冰岛语姓名变格模式压缩成3.27 kB的trie树",
    "chinese_summary": "本文详细介绍了如何创建一个 JavaScript 库，用于对冰岛语人名应用语法格。冰岛语使用变格，根据语法格改变名词形式。由于姓名通常以主格形式存储，这带来了挑战。作者通过创建一个库来解决这个问题，该库从公开的冰岛语数据（特别是冰岛语形态数据库 (DIM) 和个人姓名注册表）中推导出变格规则。\n\n该库将数据压缩成类似 Trie 树的数据结构，以最大限度地减少包大小。最初的方法是将变格数据存储为名称形式的数组，但事实证明这太大了。因此实施了一种更有效的“后缀编码”方法，为每个名称的形式存储最长公共前缀和后缀。Trie 树数据结构用于将反转的名称字符串映射到这些后缀编码，从而对具有相似结尾的名称进行分组。然后应用 Trie 树压缩，合并具有公共值的子树，从而进一步减小数据大小。\n\n这种压缩导致了泛化；该库现在可以通过识别后缀中的模式来处理初始数据集中未明确包含的名称。最终的库实现了小于 4.5kB（gzip 压缩后）的包大小，使其适合包含在 Web 应用程序中，而不会显着增加其大小，并允许在用户界面中正确使用冰岛语名称的语法格。"
  },
  {
    "id": "44773998",
    "title": "The Algebra Gatekeepers",
    "url": "https://www.educationprogress.org/p/the-algebra-gatekeepers",
    "summary": "\"The Algebra Gatekeepers\" details how schools systematically deny academically qualified students, particularly low-income and minority students, access to advanced math courses, hindering their long-term academic trajectories. Research in North Carolina revealed that over half of students predicted to succeed in 8th-grade algebra were not enrolled, often due to teacher recommendations overriding academic performance.\n\nThis placement gap has significant consequences. Students who take algebra in 8th grade are far more likely to pursue advanced math and science courses in high school and perform better on college entrance exams. The study found that biases among educators, revealed through interviews with 5th-grade teachers, influence placement decisions, often disadvantaging minority students.\n\nThe article highlights that even when interventions successfully improve math performance among disadvantaged students, fixed numbers of advanced math classes and a lack of qualified teachers can still prevent them from accessing these opportunities. Furthermore, the article reveals the significant effects of principal leadership and parental involvement in math placement. Lastly, the issues aren't confined to North Carolina; research indicates this is a widespread, decades-old problem nationwide, perpetuated by social class and inequitable placement practices.\n",
    "chinese_title": "代数守门人",
    "chinese_summary": "代数守门人：学校如何系统性地剥夺学业合格的学生，特别是低收入和少数族裔学生，选修高等数学课程的机会，从而阻碍他们的长期学业发展轨迹。北卡罗来纳州的研究表明，超过一半被预测能在八年级代数中取得成功的学生没有被录取，通常是因为教师的推荐凌驾于学业成绩之上。\n\n这种分班差距后果严重。八年级学习代数的学生更有可能在高中阶段学习高等数学和科学课程，并在大学入学考试中表现更好。该研究发现，通过对五年级教师的采访揭示，教育工作者中的偏见会影响分班决定，常常使少数族裔学生处于不利地位。\n\n文章强调，即使干预措施成功提高了弱势学生的数学成绩，固定数量的高等数学课程和缺乏合格教师仍然会阻止他们获得这些机会。此外，文章揭示了校长领导力和家长参与对数学分班的重大影响。最后，这些问题并非仅限于北卡罗来纳州；研究表明，这是一个在全国范围内存在了几十年的普遍问题，由社会阶层和不公平的分班做法所延续。"
  },
  {
    "id": "44772249",
    "title": "The Crisis of Professional Skepticism",
    "url": "https://mitchhorowitz.substack.com/p/the-crisis-of-professional-skepticism",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "职业怀疑主义危机",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "44767959",
    "title": "The /o in Ruby regex stands for \"oh the humanity \"",
    "url": "https://jpcamara.com/2025/08/02/the-o-in-ruby-regex.html",
    "summary": "This article delves into the obscure and potentially dangerous Ruby regex modifier `/o`, revealing its surprising behavior and the potential for introducing confounding bugs. The author recounts a debugging experience where the `/o` modifier caused unexpected caching of the first interpolated value in a regex, leading to incorrect matching.\n\nThe core issue is that `/o` (Interpolation Mode) caches the compiled regex object after its first evaluation, using that same regex for all subsequent calls, even with different input. This behavior is explained using Ruby VM bytecode analysis, showing that the `once` instruction ensures the regex is only evaluated once ever, within the entire Ruby process.\n\nThe article demonstrates the implications of this caching, including non-deterministic behavior in multithreaded scenarios and unexpected results in recursive calls. The author strongly advises against using the `/o` modifier, arguing that the potential performance gains are outweighed by the risks of unpredictable behavior.\n\nFinally, the article reveals a way to force re-evaluation of the `/o` modifier: reloading the code, as this triggers a complete re-evaluation by Ruby. While offering a glimpse into Ruby's internals, the article's central message is a clear warning against using the `/o` modifier due to its potential to introduce hard-to-debug issues.\n",
    "chinese_title": "Ruby 正则表达式中的 /o 代表 “天啊，人类啊！”",
    "chinese_summary": "本文深入探讨了Ruby正则表达式修饰符`/o`这个晦涩且潜在危险的特性，揭示了其令人惊讶的行为以及引入混淆性错误的可能。作者回顾了一次调试经历，其中`/o`修饰符导致正则表达式中首次插值的值被意外缓存，从而导致错误的匹配。\n\n核心问题在于，`/o`（插值模式）会在首次评估后缓存已编译的正则表达式对象，并在所有后续调用中使用相同的正则表达式，即使输入不同。通过Ruby VM字节码分析解释了这种行为，表明`once`指令确保正则表达式在整个Ruby进程中只被评估一次。\n\n本文展示了这种缓存的含义，包括多线程场景中的不确定行为以及递归调用中的意外结果。作者强烈建议不要使用`/o`修饰符，认为潜在的性能提升不如不可预测行为的风险。\n\n最后，本文揭示了一种强制重新评估`/o`修饰符的方法：重新加载代码，因为这会触发Ruby的完全重新评估。虽然本文提供了一瞥Ruby内部机制的机会，但其中心信息是对使用`/o`修饰符的明确警告，因为它可能引入难以调试的问题。"
  },
  {
    "id": "44734450",
    "title": "Mezzano, an operating system written in Common Lisp",
    "url": "https://github.com/froggey/Mezzano",
    "summary": "Mezzano is an operating system written in Common Lisp. Demo releases are available via GitHub, primarily designed for VirtualBox (with QEMU support) on x86-64 architecture. AArch64 support exists but requires significant user involvement to configure on specific hardware.\n\nBuilding from source is possible via the MBuild repository. Users can join the #mezzano IRC channel for support.\n\nKey improvements since Demo 4 include a USB stack, improved file system support with EXT2/3/4 compatibility, a GMA950 modesetting display driver, hardware-accelerated 3D via Virgl, multicore support, enhanced atomic operations, async APIs, and networking improvements. Source location tracking, weak hash tables, object representation cleanup, unboxed structure slots, short floats, unboxed arithmetic, stack overflow/memory fault recovery, Windows building support, and CLOS/MOP conformance enhancements are also included.\n\nDemo 3 brought FAT32 support, McCLIM port, Quicklisp port, improved introspection tools (DISASSEMBLE, ED), generational garbage collection, a new compiler backend, and gray streams overhaul.\n\nDemo 2 introduced Trentino media player, improved conformance/stability/performance, CLOS MOP alignment, traditional window management, CD/USB booting on real hardware, Intel HDA audio driver support, and VirtualBox guest integration.\n\nEarlier demos focused on core functionality, performance enhancements, editor improvements, increased RAM support, memory management, transparency, and bug fixes. The OS includes Dejavu Fonts, some icons from Icojam, and uses images under various Creative Commons licenses.\n",
    "chinese_title": "用 Common Lisp 编写的操作系统 Mezzano",
    "chinese_summary": "Mezzano 是一个用 Common Lisp 编写的操作系统。演示版本可通过 GitHub 获取，主要为 VirtualBox（支持 QEMU）在 x86-64 架构上设计。AArch64 支持存在，但需要在特定硬件上进行大量用户配置。\n\n可以通过 MBuild 仓库从源代码构建。用户可以加入 #mezzano IRC 频道以获得支持。\n\n自 Demo 4 以来的主要改进包括 USB 协议栈、改进的文件系统支持（兼容 EXT2/3/4）、GMA950 模式设置显示驱动程序、通过 Virgl 实现的硬件加速 3D、多核支持、增强的原子操作、异步 API 和网络改进。还包括源代码位置跟踪、弱哈希表、对象表示清理、非装箱结构槽、短浮点数、非装箱算术、堆栈溢出/内存错误恢复、Windows 构建支持以及 CLOS/MOP 一致性增强。\n\nDemo 3 带来了 FAT32 支持、McCLIM 移植、Quicklisp 移植、改进的内省工具（DISASSEMBLE、ED）、分代垃圾回收、新的编译器后端和灰色流的全面改进。\n\nDemo 2 引入了 Trentino 媒体播放器、改进的一致性/稳定性/性能、CLOS MOP 对齐、传统的窗口管理、真实硬件上的 CD/USB 启动、Intel HDA 音频驱动程序支持和 VirtualBox 客户机集成。\n\n早期的演示侧重于核心功能、性能增强、编辑器改进、增加的 RAM 支持、内存管理、透明度和错误修复。该操作系统包括 Dejavu 字体、来自 Icojam 的一些图标，并使用在各种 Creative Commons 许可下的图像。"
  },
  {
    "id": "44767775",
    "title": "Show HN: WebGPU enables local LLM in the browser – demo site with AI chat",
    "url": "https://andreinwald.github.io/browser-llm/",
    "summary": "This \"Show HN\" submission introduces a web-based demo showcasing the ability to run Large Language Models (LLMs) directly within a web browser, leveraging the WebGPU API. The core achievement is the elimination of the need for a server-side LLM, bringing AI chat functionality to the client-side. By utilizing WebGPU, which provides access to the device's GPU, the demo enables significantly faster and more efficient LLM inference compared to relying solely on JavaScript. This approach offers several potential benefits including:\n\n*   **Privacy:** Data remains local to the user's browser, enhancing privacy as queries are not sent to external servers.\n*   **Reduced Latency:** Eliminating server communication minimizes response times, resulting in a more interactive experience.\n*   **Offline Functionality:** With the model and execution occurring locally, the application can potentially function even without an internet connection.\n*   **Cost Savings:** No server resources are required to run the LLM, lowering operational costs.\n\nThe submission is likely a demonstration of the possibilities that WebGPU opens up for client-side AI, potentially sparking interest in developing more sophisticated and privacy-focused AI applications directly within the browser environment. The \"AI Chat\" element suggests an accessible interface for users to interact with the local LLM.\n",
    "chinese_title": "Show HN：WebGPU 使浏览器能够运行本地 LLM – 包含 AI 聊天的演示网站",
    "chinese_summary": "此“Show HN”提交展示了一个基于 Web 的演示，该演示展示了直接在 Web 浏览器中运行大型语言模型 (LLM) 的能力，利用了 WebGPU API。 核心成就在于消除了对服务器端 LLM 的需求，从而将 AI 聊天功能引入到客户端。 通过利用 WebGPU (它提供对设备 GPU 的访问)，与仅依赖 JavaScript 相比，该演示能够实现更快、更高效的 LLM 推理。 这种方法提供了几个潜在的好处，包括：\n\n*   **隐私：** 数据保留在用户的本地浏览器中，提高了隐私性，因为查询不会发送到外部服务器。\n*   **降低延迟：** 消除服务器通信可最大限度地缩短响应时间，从而带来更具交互性的体验。\n*   **离线功能：** 由于模型和执行都在本地发生，因此即使没有互联网连接，应用程序也可能可以运行。\n*   **节省成本：** 无需服务器资源来运行 LLM，从而降低了运营成本。\n\n此提交很可能是在演示 WebGPU 为客户端 AI 开辟的可能性，可能会激发人们对直接在浏览器环境中开发更复杂、更注重隐私的 AI 应用程序的兴趣。“AI 聊天”元素表明用户可以使用一种易于访问的界面与本地 LLM 进行交互。"
  },
  {
    "id": "44765600",
    "title": "Microsoft is open sourcing Windows 11's UI framework",
    "url": "https://www.neowin.net/news/microsoft-is-taking-steps-to-open-sourcing-windows-11-user-interface-framework/",
    "summary": "Microsoft is taking steps to open-source its Windows 11 user interface framework, WinUI, but it's a phased approach due to its complexity and deep integration with proprietary Windows components. The company aims for a more open and collaborative future with WinUI, but it's not an instant switch.\n\nOver the next six months, Microsoft will progress through four phases:\n1. **Increased Mirror Frequency:** More frequent mirroring of internal code changes to the public GitHub repository, starting after the WASDK 1.8 release (end of August).\n2. **Local Builds:** External developers will be able to clone and build the WinUI repository locally, with provided documentation.\n3. **Contributions and Testing:** Third-party developers will be able to submit pull requests (PRs) and run tests locally, as Microsoft disentangles private dependencies.\n4. **GitHub as Center of Gravity:** GitHub will become the primary hub for development, issue tracking, and community interaction, phasing out internal mirrors.\n\nMicrosoft emphasizes that security, stability, and support for existing products remain priorities. The progress can be tracked on a GitHub board. Developers can contribute by providing feedback, reporting well-documented issues, and upvoting existing suggestions. The open-sourcing process is deliberate and incremental.\n",
    "chinese_title": "微软开源Windows 11的UI框架",
    "chinese_summary": "微软正逐步开源其Windows 11用户界面框架WinUI，但由于其复杂性以及与Windows专有组件的深度集成，这是一个分阶段的过程。该公司致力于与WinUI建立更加开放和协作的未来，但这并非一蹴而就。\n\n在接下来的六个月里，微软将经历四个阶段：\n1. **提高镜像频率：** 更频繁地将内部代码更改镜像到公共GitHub存储库，从WASDK 1.8版本发布后（8月底）开始。\n2. **本地构建：** 外部开发人员将能够克隆并在本地构建WinUI存储库，并提供文档。\n3. **贡献与测试：** 第三方开发人员将能够提交拉取请求（PR）并在本地运行测试，因为微软正在解除私有依赖关系。\n4. **GitHub作为重心：** GitHub将成为开发、问题跟踪和社区互动的主要中心，逐步淘汰内部镜像。\n\n微软强调，安全性、稳定性和对现有产品的支持仍然是优先事项。进度可以在GitHub看板上跟踪。开发人员可以通过提供反馈、报告有据可查的问题以及赞成现有建议来做出贡献。开源过程是深思熟虑且渐进的。"
  },
  {
    "id": "44767702",
    "title": "Financial lessons from my family's experience with long-term care insurance",
    "url": "https://www.whitecoatinvestor.com/financial-lessons-father-long-term-care-insurance/",
    "summary": "The article \"Financial lessons from my family's experience with long-term care insurance\" on White Coat Investor discusses the author's family's experience with long-term care (LTC) insurance and the lessons learned. The author's father purchased LTC insurance in his 60s and eventually needed to use it extensively in his 80s, demonstrating the potential value of such coverage.\n\nThe article highlights several key financial lessons:\n\n*   **LTC insurance can protect assets:** The policy significantly offset the high costs of long-term care, preserving a substantial portion of the father's estate for his spouse and heirs. Without it, a significant amount of assets would have been depleted.\n\n*   **Purchase it earlier rather than later:** Buying the policy in one's 60s was beneficial as premiums are lower than when purchased later in life, although the father did pay premiums for nearly 20 years before needing the coverage.\n\n*   **Understand the policy details:** The author emphasizes the importance of understanding the policy's specifics, including the daily benefit amount, inflation protection, elimination period, and covered services. Knowing these details is crucial for maximizing the benefits and avoiding surprises.\n\n*   **LTC insurance is not for everyone:** The author acknowledges that LTC insurance might not be suitable for everyone, especially those with limited assets or those who are already wealthy enough to self-insure. It's a complex decision that requires careful consideration of individual circumstances and financial resources.\n\n*   **Inflation riders are critical:** The author stresses the importance of inflation protection riders in LTC policies to ensure that the benefits keep pace with the rising costs of care over time.\n\nIn conclusion, the article argues that while LTC insurance is not a one-size-fits-all solution, it can be a valuable tool for protecting assets and providing peace of mind, especially when purchased thoughtfully and with a clear understanding of its terms. The author's family's experience demonstrates the potential benefits of LTC insurance in mitigating the financial burden of long-term care needs.\n",
    "chinese_title": "我家购买长期护理保险的经验教训",
    "chinese_summary": "怀特大褂投资人网站上的文章“从我家长期护理保险经验中得到的财务教训”讨论了作者家庭的长期护理（LTC）保险经验以及从中汲取的教训。作者的父亲在60多岁时购买了长期护理保险，最终在80多岁时需要大量使用它，这证明了这种保险的潜在价值。\n\n这篇文章强调了几个关键的财务教训：\n\n*   **长期护理保险可以保护资产：** 该保单显著抵消了长期护理的高昂费用，为他的配偶和继承人保留了父亲的大部分遗产。如果没有它，大量的资产将会耗尽。\n\n*   **尽早购买而不是稍后购买：** 在60多岁时购买保单是有益的，因为保费低于晚年购买时，尽管父亲在需要保险之前支付了近20年的保费。\n\n*   **了解保单细节：** 作者强调了理解保单细节的重要性，包括每日福利金额、通货膨胀保护、免赔额和承保服务。了解这些细节对于最大化利益和避免意外至关重要。\n\n*   **长期护理保险并不适合所有人：** 作者承认长期护理保险可能不适合所有人，特别是那些资产有限或已经足够富有可以自我保险的人。这是一个复杂的决定，需要仔细考虑个人情况和财务资源。\n\n*   **通货膨胀附加条款至关重要：** 作者强调了长期护理保单中通货膨胀保护附加条款的重要性，以确保福利能够跟上护理成本随时间的上涨。\n\n总之，这篇文章认为，虽然长期护理保险并非万能的解决方案，但它可以成为保护资产和提供安心的宝贵工具，尤其是在经过深思熟虑并清楚了解其条款的情况下购买时。作者家庭的经验证明了长期护理保险在减轻长期护理需求的财务负担方面的潜在好处。"
  },
  {
    "id": "44745490",
    "title": "OpenAI's \"Study Mode\" and the risks of flattery",
    "url": "https://resobscura.substack.com/p/openais-new-study-mode-and-the-risks",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "OpenAI的“学习模式”与奉承的风险",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "44776086",
    "title": "Falcon-H1: A Family of Hybrid-Head Models Redefining Efficiency and Performance",
    "url": "https://arxiv.org/abs/2507.22448",
    "summary": "This technical report introduces Falcon-H1, a new family of large language models (LLMs) designed for both high performance and efficiency. The key innovation lies in its hybrid architecture, combining Transformer-based attention with State Space Models (SSMs) to leverage the strengths of both: Transformer's general capabilities and SSM's long-context memory and computational efficiency.\n\nThe Falcon-H1 series is released in multiple configurations, ranging from 0.5B to 34B parameters, including base and instruction-tuned variants, and even quantized versions, totaling over 30 checkpoints on Hugging Face Hub.\n\nA core claim is that Falcon-H1 models achieve state-of-the-art performance with exceptional parameter and training efficiency. The flagship 34B model reportedly matches or surpasses the performance of models up to 70B in scale (Qwen3-32B, Qwen2.5-72B, and Llama3.3-70B) while using fewer parameters and less training data. Smaller models also demonstrate impressive results, with the 1.5B-Deep model rivaling current 7B-10B models and the 0.5B model performing similarly to typical 7B models from 2024.\n\nThe models exhibit strong capabilities in reasoning, mathematics, multilingual tasks, instruction following, and scientific knowledge, and support up to 256K context tokens and 18 languages. The Falcon-H1 models are released under a permissive open-source license, facilitating broader access and impact in AI research. The authors revisited the model design, data strategy, and training dynamics, challenging conventional practices in LLM development.\n",
    "chinese_title": "Falcon-H1：重新定义效率与性能的混合头模型系列",
    "chinese_summary": "本技术报告介绍了 Falcon-H1，一种为高性能和高效率而设计的新型大型语言模型 (LLM) 系列。其关键创新在于混合架构，将基于 Transformer 的注意力机制与状态空间模型 (SSM) 相结合，以利用两者的优势：Transformer 的通用能力以及 SSM 的长上下文记忆和计算效率。\n\nFalcon-H1 系列发布了多种配置，参数范围从 0.5B 到 34B 不等，包括基础和指令调优变体，甚至量化版本，在 Hugging Face Hub 上总共有 30 多个检查点。\n\n一个核心论点是，Falcon-H1 模型以卓越的参数和训练效率实现了最先进的性能。据报道，旗舰 34B 模型在规模上与高达 70B 的模型（Qwen3-32B、Qwen2.5-72B 和 Llama3.3-70B）的性能相匹配或超过，同时使用了更少的参数和更少的训练数据。较小的模型也表现出令人印象深刻的结果，其中 1.5B-Deep 模型可与当前的 7B-10B 模型相媲美，而 0.5B 模型与 2024 年的典型 7B 模型表现相似。\n\n这些模型在推理、数学、多语言任务、指令遵循和科学知识方面表现出强大的能力，并支持高达 256K 的上下文标记和 18 种语言。Falcon-H1 模型以宽松的开源许可证发布，从而促进了人工智能研究中的更广泛访问和影响。作者重新审视了模型设计、数据策略和训练动态，挑战了 LLM 开发中的传统实践。"
  },
  {
    "id": "44768513",
    "title": "Hiding secret codes in light protects against fake videos",
    "url": "https://news.cornell.edu/stories/2025/07/hiding-secret-codes-light-protects-against-fake-videos",
    "summary": "Cornell researchers have developed a new method to combat fake videos by \"watermarking\" light sources with nearly imperceptible fluctuations that encode a secret code. This hidden watermark is captured in any video recorded under the watermarked light, allowing fact-checkers to verify the authenticity of the footage and detect manipulation.\n\nThe system works by embedding information into the light emitted from sources like computer screens and lamps, creating a \"code video\" alongside the regular footage. This code video contains a time-stamped version of the unmanipulated scene under slightly different lighting. If the video is altered, inconsistencies arise between the manipulated sections and the code video, revealing the tampering. Even AI-generated fake videos produce random variations in the code video, making them easily identifiable.\n\nThe watermarks are designed to be undetectable to the human eye by mimicking natural \"noise\" in light. The system is adaptable, working with various light sources through software coding or small computer chips. Researchers have successfully implemented multiple codes in a single scene, making it even harder for malicious actors to fake the light. While promising, the team cautions that the fight against misinformation is ongoing and adversaries will likely adapt.\n",
    "chinese_title": "在光线中隐藏秘密代码可防止伪造视频",
    "chinese_summary": "康奈尔大学研究人员开发了一种新方法来打击虚假视频，通过“水印”光源，使其产生几乎无法察觉的波动，从而编码一个秘密代码。任何在加水印光源下录制的视频都能捕捉到这种隐藏的水印，使事实核查人员能够验证素材的真实性并检测篡改行为。\n\n该系统的工作原理是将信息嵌入到计算机屏幕和灯具等光源发出的光中，从而在常规视频之外创建一个“代码视频”。这个代码视频包含一个带有时间戳的，在略微不同的光照条件下拍摄的未被篡改场景的版本。如果视频被篡改，被篡改的部分和代码视频之间会出现不一致，从而揭示篡改行为。即使是人工智能生成的虚假视频也会在代码视频中产生随机变化，使其易于识别。\n\n这些水印通过模仿光线中的自然“噪声”来设计成肉眼无法察觉。该系统具有很强的适应性，可以通过软件编码或小型计算机芯片与各种光源配合使用。研究人员已成功在一个场景中实施多个代码，这使得恶意行为者更难伪造光线。虽然前景广阔，但该团队警告说，打击虚假信息的斗争仍在继续，对手可能会不断适应。"
  },
  {
    "id": "44777205",
    "title": "Kano Model",
    "url": "https://en.wikipedia.org/wiki/Kano_model",
    "summary": "The Kano model, developed by Noriaki Kano, is a theory for product development and customer satisfaction that helps organizations prioritize development efforts. It categorizes customer preferences into five types, each influencing satisfaction differently:\n\n1.  **Must-be Quality:** Basic requirements customers expect; their presence leads to neutrality, while their absence causes dissatisfaction (e.g., functioning brakes in a car).\n2.  **One-dimensional Quality:** Attributes that cause satisfaction when fulfilled and dissatisfaction when not, often the focus of competition (e.g., more milk in a package for the same price).\n3.  **Attractive Quality:** Unexpected features that delight customers when present but do not cause dissatisfaction when absent (e.g., advanced parking sensors in a car).\n4.  **Indifferent Quality:** Attributes that neither satisfy nor dissatisfy customers (e.g., the thickness of wax coating on a milk carton).\n5.  **Reverse Quality:** Attributes where a high degree of achievement leads to dissatisfaction, as not all customers desire extra features (e.g., excessive jargon in a call center).\n\nCustomer expectations evolve, causing attributes to shift from \"delighters\" to basic needs over time. The Kano model is measured using a standardized questionnaire asking about functional (positive) and dysfunctional (negative) aspects of features. Combining the answers reveals the feature category. The model is used in Quality Function Deployment (QFD) to improve product quality by understanding customer preferences and supporting product specification discussions.\n",
    "chinese_title": "卡诺模型",
    "chinese_summary": "狩野模型，由狩野纪昭开发，是一种用于产品开发和客户满意度的理论，它帮助组织确定开发工作的优先级。它将客户偏好分为五种类型，每种类型对满意度的影响各不相同：\n\n1.  **必备品质：** 客户期望的基本要求；其存在只会导致中性，而缺失会导致不满（例如，汽车中正常工作的刹车）。\n2.  **一维品质：** 当满足时会引起满意，不满足时会引起不满的属性，通常是竞争的焦点（例如，相同价格的包装中含有更多的牛奶）。\n3.  **魅力品质：** 存在时会让客户愉悦的意外功能，但缺失时不会引起不满（例如，汽车中的高级停车传感器）。\n4.  **无关紧要的品质：** 既不会让客户满意也不会让客户不满意的属性（例如，牛奶纸盒上蜡涂层的厚度）。\n5.  **反向品质：** 过高的成就度会导致不满意的属性，因为并非所有客户都希望有额外的功能（例如，呼叫中心中过多的术语）。\n\n客户期望会不断发展，导致属性随着时间的推移从“令人愉悦的功能”转变为基本需求。狩野模型通过标准化的问卷调查来衡量，询问功能的正面（积极）和负面（消极）方面。结合答案可以揭示功能类别。该模型用于质量功能展开（QFD），通过了解客户偏好并支持产品规格讨论来提高产品质量。"
  },
  {
    "id": "44732508",
    "title": "Australia’s gains in wheat-farm productivity",
    "url": "https://www.reuters.com/investigations/less-rain-more-wheat-how-australian-farmers-defied-climate-doom-2025-07-29/",
    "summary": "**Summary of \"Australia’s gains in wheat-farm productivity\" (based on likely content given the title and URL):**\n\nThe Reuters article \"Australia’s gains in wheat-farm productivity\" likely explores how Australian wheat farmers have managed to increase yields and remain competitive in the face of increasingly challenging climatic conditions, particularly reduced rainfall and increased drought frequency, despite initial predictions of climate-related agricultural decline.\n\nThe article probably details the various strategies and innovations adopted by farmers to combat these challenges. Key factors likely include:\n\n*   **Adoption of drought-resistant wheat varieties:** Breeding and planting wheat varieties that are more resilient to water stress and can thrive in drier conditions.\n*   **Improved soil management techniques:** Implementing methods like no-till farming, stubble retention, and precision agriculture to improve soil health, water retention, and nutrient availability.\n*   **Technological advancements:** Utilizing advanced technologies such as GPS-guided machinery, remote sensing, and data analytics to optimize planting, fertilization, and irrigation practices.\n*   **Shift in farming practices:** Adjusting planting times, crop rotations, and other agronomic practices to better align with changing weather patterns and maximize water use efficiency.\n*   **Government support and research:** Highlighting the role of government investment in agricultural research and development, as well as policies that support farmers in adopting sustainable and climate-resilient practices.\n\nThe article likely emphasizes that Australia's success is not guaranteed and continuous innovation is required to maintain productivity as climate change progresses.\n",
    "chinese_title": "澳大利亚小麦农场生产力增长",
    "chinese_summary": "澳大利亚小麦农场生产力增长概要 (基于标题及URL推测内容):\n\n路透社文章《澳大利亚小麦农场生产力增长》可能探讨了澳大利亚小麦农场在日益严峻的气候条件，特别是降雨减少和干旱频率增加的情况下，如何设法提高产量并保持竞争力，尽管最初预测农业会因气候变化而衰退。\n\n该文章可能详细介绍了农民为应对这些挑战而采取的各种策略和创新。关键因素可能包括：\n\n*   **采用耐旱小麦品种：** 培育和种植更能抵抗水分胁迫并在更干燥条件下生长的小麦品种。\n*   **改进土壤管理技术：** 实施免耕种植、秸秆覆盖和精准农业等方法，以改善土壤健康、保水能力和养分有效性。\n*   **技术进步：** 利用 GPS 引导机械、遥感和数据分析等先进技术来优化种植、施肥和灌溉实践。\n*   **转变耕作方式：** 调整播种时间、作物轮作和其他农艺措施，以更好地适应不断变化的天气模式并最大限度地提高用水效率。\n*   **政府支持和研究：** 强调政府对农业研究和发展的投资，以及支持农民采用可持续和气候适应型措施的政策的作用。\n\n该文章可能强调澳大利亚的成功并非必然，随着气候变化的进展，需要持续创新才能维持生产力。"
  },
  {
    "id": "44776743",
    "title": "How Social Media Shortens Your Life and How to Expand It",
    "url": "https://www.gurwinder.blog/p/how-social-media-shortens-your-life",
    "summary": "This article argues that social media platforms are deliberately designed to shorten our perceived and actual lives by stealing our time and impairing our awareness and memory. Social media achieves this through techniques borrowed from casino design, turning feeds into \"curvilinear mazes\" that keep users passively scrolling without a clear beginning or end, disrupting their sense of time.\n\nThe author explains how social media hinders both present awareness and retrospective memory. The constant stream of alarming but ultimately routine content desensitizes the brain, making it difficult to remember what was seen. Furthermore, features like infinite scroll and autoplay lull users into passivity, while notifications and the sheer volume of information divide attention, leading to anxiety, stress, and a \"switch-cost effect.\"\n\nThe article connects social media use to negative impacts on health, including disrupted sleep cycles, mental health problems, and potentially accelerated aging. By living out of sync with reality due to constant disorientation, our biological life might also be shortened.\n\nThe author proposes escaping this trap by abstaining from social media and being aware of similar time-warping tactics in other technologies like chatbots. The key is to avoid getting lost in \"curvilinear mazes\" and instead pursuing clear, intentional destinations to maintain awareness and control of our time. Ultimately, reclaiming time is not just about resisting specific platforms but also about resisting design patterns that manipulate our attention.\n",
    "chinese_title": "社交媒体如何缩短你的寿命，以及如何延长它",
    "chinese_summary": "本文认为社交媒体平台被刻意设计成通过窃取时间和损害我们的意识及记忆来缩短我们感知和实际的生命。社交媒体通过借鉴赌场设计的技巧来实现这一点，将信息流变成“曲线迷宫”，让用户被动地无休止地滚动，没有明确的开始或结束，从而扰乱他们的时间感。\n\n作者解释了社交媒体如何阻碍当前的意识和回顾性记忆。 不断涌现的令人震惊但最终是常规的内容使大脑麻木，难以记住所看到的内容。 此外，无限滚动和自动播放等功能使使用者陷入被动状态，而通知和大量信息分散了注意力，导致焦虑、压力和“切换成本效应”。\n\n文章将社交媒体的使用与对健康的负面影响联系起来，包括睡眠周期紊乱、精神健康问题以及可能加速衰老。 由于持续的迷失方向而与现实脱节，我们的生物生命也可能缩短。\n\n作者建议通过戒除社交媒体并注意其他技术（如聊天机器人）中类似的时间扭曲策略来逃脱这种陷阱。 关键是避免迷失在“曲线迷宫”中，而是追求清晰、有意识的目标，以保持对时间的意识和控制。 最终，夺回时间不仅仅是抵制特定的平台，也是抵制操纵我们注意力的设计模式。"
  },
  {
    "id": "44772729",
    "title": "Got tired of bad PDF WebApp so we made a Free, Open-Sourced, Private Alternative",
    "url": "https://luxpdf.com",
    "summary": "LuxPDF is presented as a free, open-source, and privacy-focused alternative to existing PDF web applications. Dissatisfied with the privacy compromises, clunky interfaces, and subscription models of other services, the developers, a group of college students, created LuxPDF to perform all PDF conversions and modifications directly on the user's device, eliminating server uploads and data collection.\n\nLuxPDF offers a suite of over 15 tools, including PDF conversion to PNG and JPEG, PNG/JPEG to PDF, PDF to TXT, TXT to PDF, merging/splitting/compressing/rotating PDFs, metadata and password removal, page extraction/removal/rearrangement, and more. The service boasts unlimited usage and requires no registration.\n\nThe developers emphasize their commitment to privacy and user experience, highlighting the platform's lightweight, efficient code, and the fact that user files never leave their device. LuxPDF is funded through sponsorships and voluntary donations, avoiding ads and data harvesting. The creators encourage community contributions like bug reports, feature suggestions, and financial support. They position LuxPDF as a superior option compared to competitors by offering a free, unlimited, and private service, prioritizing user privacy and a clean UI. The target audience includes students, freelancers, small businesses, tech enthusiasts, and anyone seeking a better PDF web app.\n",
    "chinese_title": "受够了糟糕的PDF WebApp，所以我们做了一个免费、开源、私有的替代品",
    "chinese_summary": "LuxPDF：一款免费、开源、注重隐私的 PDF 网络应用替代方案。开发者（一群大学生）对现有服务的隐私泄露、笨拙界面和订阅模式不满，创建了 LuxPDF，旨在直接在用户设备上执行所有 PDF 转换和修改，无需服务器上传和数据收集。\n\nLuxPDF 提供超过 15 种工具，包括 PDF 转换为 PNG 和 JPEG，PNG/JPEG 转换为 PDF，PDF 转换为 TXT，TXT 转换为 PDF，PDF 合并/分割/压缩/旋转，元数据和密码移除，页面提取/移除/重新排列等。该服务拥有无限使用次数，无需注册。\n\n开发者强调其对隐私和用户体验的承诺，突出平台轻量、高效的代码以及用户文件从不离开其设备的事实。 LuxPDF 通过赞助和自愿捐款获得资金，避免了广告和数据收集。 创作者鼓励社区贡献，如错误报告、功能建议和经济支持。 他们将 LuxPDF 定位为优于竞争对手的选择，提供免费、无限且私密的服务，优先考虑用户隐私和简洁的用户界面。 目标受众包括学生、自由职业者、小企业、技术爱好者以及任何寻求更好 PDF 网络应用的人。"
  },
  {
    "id": "44745067",
    "title": "Helion begins work on Washington nuclear fusion plant",
    "url": "https://www.nucnet.org/news/microsoft-backed-fusion-company-begins-work-on-washington-nuclear-fusion-plant-7-4-2025",
    "summary": "Helion, a Microsoft-backed nuclear fusion company, has begun construction of its first fusion power plant, Orion, in Washington state, aiming to supply power to Microsoft data centers by 2028. This follows Microsoft's agreement to purchase up to 50 MW of power from Helion, making it the world's first power purchase agreement for nuclear fusion.\n\nHelion's seventh-generation prototype, Polaris, aims to demonstrate electricity production from fusion. Their previous prototype, Trenta, achieved a fuel temperature of 100 million degrees Celsius, a key requirement for commercial fusion. The company emphasizes that this timeline is faster than typical projections for commercial fusion deployment.\n\nHelion needs to secure final permits from the state government, but remains on track to deliver power by 2028. They are backed by OpenAI founder Sam Altman and recently raised $425 million in a Series F round, bringing their total funding to over $1 billion and valuation to $5.4 billion.\n\nThe article also notes that Google has signed a 200 MW PPA with Commonwealth Fusion Systems, another fusion company, for power from their ARC plant, projected to deliver power to the Virginia grid in the early 2030s. Fusion, unlike fission, offers the potential for a nearly limitless and cleaner energy source.\n",
    "chinese_title": "海里昂启动华盛顿核聚变工厂建设",
    "chinese_summary": "微软支持的核聚变公司Helion开始建造其首个聚变电站Orion，目标是在2028年前向微软数据中心供电，该电站位于华盛顿州。此前，微软已同意从Helion购买高达50兆瓦的电力，这使其成为全球首个核聚变电力购买协议。\n\nHelion的第七代原型机Polaris旨在演示聚变发电。他们之前的原型机Trenta实现了1亿摄氏度的燃料温度，这是商业聚变的必要条件。该公司强调，这一时间表比商业聚变部署的典型预测更快。\n\nHelion需要获得州政府的最终许可，但仍有望在2028年前交付电力。该公司由OpenAI创始人Sam Altman支持，最近在F轮融资中筹集了4.25亿美元，使其总融资额超过10亿美元，估值达到54亿美元。\n\n文章还指出，谷歌已与另一家聚变公司Commonwealth Fusion Systems签署了200兆瓦的电力购买协议，用于其ARC电站的电力，预计该电站将于2030年代初向弗吉尼亚电网供电。与裂变不同，聚变有望提供近乎无限且更清洁的能源。"
  },
  {
    "id": "44740617",
    "title": "People still use our old-fashioned Unix login servers",
    "url": "https://utcc.utoronto.ca/~cks/space/blog/sysadmin/LoginServersStillUsed",
    "summary": "Chris Siebenmann's blog, Wandering Thoughts, is blocking access to users with older browsers due to a surge in high-volume web crawlers, particularly those mimicking older Chrome user agents, likely used for LLM training data collection. He's implemented this measure to reduce the load on his blog caused by these crawlers.\n\nIf a legitimate user with a current browser is wrongly blocked, they are encouraged to contact Siebenmann at his university email (obtainable through context clues) with their browser details, including the User-Agent string.\n\nHe specifically addresses users accessing the blog through archival services like archive.today, archive.ph, and archive.is. He criticizes these services for behaving similarly to malicious crawlers by using outdated Chrome user agents, crawling from widespread IP ranges, and sometimes using misleading reverse DNS entries. He recommends using archive.org instead, as it's a more well-behaved archival crawler capable of accessing his blog. The post is dated February 17, 2025.\n",
    "chinese_title": "人们仍然在使用我们老式的Unix登录服务器。",
    "chinese_summary": "由于大量网络爬虫（特别是那些模仿旧版Chrome用户代理的爬虫，可能被用于LLM训练数据收集）的涌入，Chris Siebenmann的博客“Wandering Thoughts”正在阻止使用旧版浏览器的用户访问。他采取这项措施是为了减轻这些爬虫给博客造成的负载。\n\n如果使用当前浏览器的合法用户被错误阻止，他们应通过大学邮箱（可通过上下文线索获取）联系Siebenmann，并提供他们的浏览器详细信息，包括User-Agent字符串。\n\n他特别提到了通过archive.today、archive.ph和archive.is等存档服务访问博客的用户。他批评这些服务的行为与恶意爬虫类似，使用了过时的Chrome用户代理，从广泛的IP范围进行爬取，有时还使用误导性的反向DNS条目。他建议使用archive.org，因为它是一个行为更规范的存档爬虫，能够访问他的博客。该文章发布于2025年2月17日。"
  },
  {
    "id": "44766326",
    "title": "North Korea sent him abroad to be a secret IT worker",
    "url": "https://www.bbc.com/news/articles/c15wk77zxngo",
    "summary": "This BBC article details how North Korea sends its citizens abroad as secret IT workers to generate revenue for the regime, circumventing international sanctions. \"Jin-su,\" a defector whose name has been changed, reveals how these workers operate, often using fake identities to secure remote jobs with Western companies, particularly in the US and Europe. He states that 85% of their earnings are sent back to North Korea, contributing to an estimated $250m-$600m annually, according to a UN Security Council report.\n\nThe scheme boomed during the pandemic's remote work surge. Some workers have also engaged in data theft, hacking, and extortion. Securing identities involves posing as Chinese and then leveraging those identities to acquire Western European ones, targeting countries like the UK.\n\nWhile internet access is limited in North Korea, being abroad allows IT workers to see the outside world, but few defect due to the risks involved for themselves and their families back home. Even though they only keep a fraction of their earnings, it is significantly more than they would have in North Korea. Hiring managers have noticed suspicious candidates, sometimes using AI to disguise themselves, leading to increased scrutiny. While rare, the skills these workers acquire help them integrate into new lives if they defect.\n",
    "chinese_title": "朝鲜派他出国做秘密IT工作者。",
    "chinese_summary": "朝鲜秘密派遣公民海外充当IT工人，为政权创收，规避国际制裁：一名叛逃者揭秘内幕"
  },
  {
    "id": "44775700",
    "title": "Tokens are getting more expensive",
    "url": "https://ethanding.substack.com/p/ai-subscriptions-get-short-squeezed",
    "summary": "**Summary of \"Tokens are getting more expensive\"**\n\nEthan Ding's article explores the increasing cost of using AI language models, specifically focusing on how the transition towards usage-based pricing (tokens) is impacting various AI subscription services. The author argues that while AI subscriptions may appear cheaper initially, users are often surprised by the rapid consumption of tokens, leading to significantly higher costs than anticipated.\n\nThe core thesis is that the apparent affordability of subscription models can be misleading. Users underestimate token consumption based on their usage patterns and the inherent complexity of AI model operations. Certain prompts, requests for longer outputs, and tasks involving higher-quality models all consume more tokens. This, combined with the potential for unexpected spikes in usage or the need for higher-tier models to achieve desired results, can quickly deplete allocated tokens and trigger overage charges or force users to upgrade to more expensive plans.\n\nDing highlights the disconnect between the perceived value of a subscription and the actual cost of using the underlying AI. He suggests that this \"short squeeze\" on AI subscriptions could lead to user dissatisfaction and a reevaluation of pricing models in the future. He hints that this may force providers to re-think their models to better align cost with user expectations and prevent surprises related to token consumption. In essence, users need to be more aware of token costs and providers may need to be more transparent about them.\n",
    "chinese_title": "代币越来越贵了",
    "chinese_summary": "Tokens 变得更贵”摘要"
  },
  {
    "id": "44743432",
    "title": "Double-slit experiment holds up when stripped to its quantum essentials",
    "url": "https://news.mit.edu/2025/famous-double-slit-experiment-holds-when-stripped-to-quantum-essentials-0728",
    "summary": "MIT physicists have conducted an idealized version of the double-slit experiment, confirming the fundamental principles of quantum mechanics and settling a long-standing debate between Einstein and Bohr. The double-slit experiment famously demonstrates that light can behave as both a wave and a particle, but these properties cannot be observed simultaneously.\n\nThe MIT team used individual atoms as slits and weak light beams to scatter single photons. By manipulating the quantum states of the atoms, they could control the information obtained about the photons' paths. Their findings confirmed that increasing the knowledge of a photon's path (particle nature) diminished the visibility of the wave-like interference pattern.\n\nThis experiment provides strong support for Bohr's interpretation of quantum mechanics, contradicting Einstein's idea that one could simultaneously observe both wave and particle properties by detecting the force exerted by a photon on a slit. The team also demonstrated that the \"springs\" (representing the method of holding the slits) previously used in conceptualizing the experiment are not crucial; the key factor is the \"fuzziness\" or uncertainty of the atom's location. This idealized setup, working at the single-atom and single-photon level, reinforces the counterintuitive nature of quantum mechanics and its impact on our understanding of reality. With their experiment, the researchers provide a more profound description that uses quantum correlations between photons and atoms.\n",
    "chinese_title": "双缝实验精简至量子本质依然成立",
    "chinese_summary": "麻省理工学院物理学家进行了理想化的双缝实验，证实了量子力学的基本原理，并解决了爱因斯坦和玻尔之间长期存在的争论。双缝实验著名地展示了光既可以表现为波，也可以表现为粒子，但这些特性不能同时观察到。\n\n麻省理工学院的团队使用单个原子作为狭缝，并使用弱光束散射单个光子。通过操纵原子的量子态，他们可以控制有关光子路径的信息。他们的发现证实，增加对光子路径的了解（粒子性质）会降低波状干涉图样的可见性。\n\n这项实验为玻尔对量子力学的解释提供了强有力的支持，驳斥了爱因斯坦关于可以通过检测光子对狭缝施加的力来同时观察波和粒子性质的观点。该团队还证明了先前用于概念化实验的“弹簧”（代表固定狭缝的方法）并非至关重要；关键因素是原子位置的“模糊性”或不确定性。这种理想化的设置，在单原子和单光子水平上工作，加强了量子力学违反直觉的本质及其对我们理解现实的影响。通过他们的实验，研究人员提供了一种更深刻的描述，该描述使用了光子和原子之间的量子关联。"
  },
  {
    "id": "44742373",
    "title": "Super-resolution of Sentinel-2 images (10M –> 5M)",
    "url": "https://github.com/Topping1/L1BSR-GUI",
    "summary": "This document describes a user-friendly desktop application, \"Sentinel-2 Super-Resolution GUI,\" designed to enhance the resolution of Sentinel-2 satellite images from 10m to 5m. It uses a pre-trained AI model (REC_Real_L1B.safetensors) to upscale the Blue, Green, Red, and Near-Infrared (NIR) bands.\n\nThe application features a simple graphical interface, eliminating the need for command-line tools. Users load the model and four Sentinel-2 band files (B02, B03, B04, B08) in TIFF format with a UTM coordinate system. After processing, a 2x super-resolution image is generated, and a preview is displayed allowing users to compare the upscaled image with the original by clicking and holding on the preview. An optional unsharp mask filter can be applied for visual sharpening.\n\nOutput can be saved as a GeoTIFF (preserving geographic data) or a JPG with a JGW world file for GIS compatibility. The application requires Python 3 and libraries like `pyqt5`, `torch`, `safetensors`, `rasterio`, `pillow`, and `numpy`. GPU acceleration via CUDA is recommended for faster processing. An alternative version, `L1-BSR-GUI-ONNX.py`, uses OnnxRuntime for inference and requires a reduced set of libraries and an Onnx model.\n\nThe application is based on the L1BSR project and is licensed under the GNU General Public License v3.0.\n",
    "chinese_title": "哨兵2号影像超分辨率重建 (10米 -> 5米)",
    "chinese_summary": "本文介绍了一款用户友好的桌面应用程序“Sentinel-2超分辨率GUI”，旨在将Sentinel-2卫星图像的分辨率从10米提升到5米。它使用预训练的AI模型（REC_Real_L1B.safetensors）来放大蓝色、绿色、红色和近红外（NIR）波段。\n\n该应用程序具有简单的图形界面，无需使用命令行工具。用户加载模型和四个Sentinel-2波段文件（B02、B03、B04、B08），文件格式为TIFF，并具有UTM坐标系。处理后，将生成2倍超分辨率图像，并显示预览，用户可以通过点击并按住预览来比较放大后的图像与原始图像。可以选择应用可选的非锐化掩模滤镜以进行视觉锐化。\n\n输出可以保存为GeoTIFF（保留地理数据）或JPG（带有JGW世界文件，以实现GIS兼容性）。该应用程序需要Python 3和`pyqt5`、`torch`、`safetensors`、`rasterio`、`pillow`和`numpy`等库。建议使用CUDA进行GPU加速以加快处理速度。另一个版本`L1-BSR-GUI-ONNX.py`使用OnnxRuntime进行推理，需要的库集较少，并使用Onnx模型。\n\n该应用程序基于L1BSR项目，并根据GNU General Public License v3.0获得许可。"
  },
  {
    "id": "44744121",
    "title": "Why leather is best motorcycle protection [video]",
    "url": "https://www.youtube.com/watch?v=xwuRUcAGIEU",
    "summary": "This is a YouTube video titled \"Why leather is best motorcycle protection\". However, the provided content is just the standard YouTube footer information, including links to legal pages, contact information, and copyright notices. There is no actual information about the video's content or the arguments presented for why leather is the best motorcycle protection. Therefore, it is impossible to summarize the video's content based on the given information.\n",
    "chinese_title": "为什么皮革是最佳摩托车保护 [视频]",
    "chinese_summary": "这是一个名为“为何皮革是最佳摩托车防护”的YouTube视频。然而，提供的内容只是标准的YouTube页脚信息，包括法律页面链接、联系方式和版权声明。没有关于视频内容或皮革为何是最佳摩托车防护的论点的实际信息。因此，不可能根据给定的信息总结视频内容。"
  },
  {
    "id": "44773690",
    "title": "Parsing without ASTs and Optimizing with Sea of Nodes  [video]",
    "url": "https://www.youtube.com/watch?v=NxiKlnUtyio",
    "summary": "The provided content is not an article, but rather boilerplate text typically found at the bottom of a YouTube page. It's a mix of navigational links and copyright information.\n\nTherefore, it's impossible to summarize an article that isn't present. The text contains:\n\n*   **Links:** Links to various YouTube resources like \"About,\" \"News,\" \"Contact Us,\" \"Creators,\" \"Advertise,\" \"Developers,\" \"Terms,\" \"Privacy,\" and \"Policy & Safety.\"\n*   **Copyright Information:** Including copyright notice (© 2025 Google LLC) and information about NFL Sunday Ticket.\n*   **General Information:** \"YouTube 的运作方式\" (How YouTube Works) and \"测试新功能\" (Test New Features).\n\nEssentially, it's just the standard footer information of a YouTube webpage and has nothing to do with \"Parsing without ASTs and Optimizing with Sea of Nodes.\" There is no content here that can be related to the video title.\n",
    "chinese_title": "不使用抽象语法树的解析及使用节点海洋优化 [视频]",
    "chinese_summary": "提供的内容并非文章，而是通常位于 YouTube 页面底部的样板文字。它混合了导航链接和版权信息。\n\n因此，无法总结不存在的文章。该文本包含：\n\n*   **链接：** 指向各种 YouTube 资源的链接，如“关于”、“新闻”、“联系我们”、“创作者”、“广告”、“开发者”、“条款”、“隐私”和“政策与安全”。\n*   **版权信息：** 包括版权声明（© 2025 Google LLC）以及关于 NFL Sunday Ticket 的信息。\n*   **一般信息：** “YouTube 的运作方式”和“测试新功能”。\n\n本质上，这只是 YouTube 网页的标准页脚信息，与“Parsing without ASTs and Optimizing with Sea of Nodes”无关。此处没有任何与视频标题相关的内容。"
  },
  {
    "id": "44738216",
    "title": "A dive into open chat protocols",
    "url": "https://wiki.alopex.li/ADiveIntoOpenChat",
    "summary": "The article describes a website's implementation of \"Anubis,\" a security measure designed to deter AI companies from aggressively scraping its content. The administrator believes such scraping causes downtime and makes resources inaccessible.\n\nAnubis uses a \"Proof-of-Work\" scheme, similar to Hashcash, which requires users to perform a small computation to prove they are not a bot. While the computational load is minimal for individual users, it becomes significant for large-scale scrapers, making scraping more expensive.\n\nThe article emphasizes that Anubis is a temporary solution. The ultimate goal is to develop more sophisticated fingerprinting and identification techniques for headless browsers (often used by scrapers) based on characteristics like font rendering. This would allow the website to present the \"Proof-of-Work\" challenge only to suspicious users, minimizing inconvenience for legitimate visitors.\n\nThe text also notes that Anubis requires JavaScript and users may need to disable plugins like JShelter to pass the challenge. This requirement stems from the fact that AI companies have altered the expected behavior of website hosting, making such measures necessary. A \"no-JS\" solution is being considered for the future.\n",
    "chinese_title": "深入探讨开放聊天协议",
    "chinese_summary": "本文介绍了某网站实施的名为“阿努比斯”的安全措施，该措施旨在阻止人工智能公司过度抓取其内容。网站管理员认为，这种抓取会导致网站宕机并使资源无法访问。\n\n“阿努比斯”采用类似于Hashcash的“工作量证明”机制，要求用户执行少量计算来证明其不是机器人。虽然对单个用户来说，计算量很小，但对于大规模抓取者来说，计算量会变得非常显著，从而增加抓取的成本。\n\n本文强调，“阿努比斯”只是一个临时解决方案。最终目标是开发更复杂的指纹识别和身份识别技术，针对无头浏览器（通常被抓取器使用），基于字体渲染等特征进行识别。这样，网站就可以只向可疑用户显示“工作量证明”挑战，从而最大限度地减少对合法访问者的不便。\n\n文章还指出，“阿努比斯”需要JavaScript，用户可能需要禁用JShelter等插件才能通过挑战。这一要求源于人工智能公司改变了网站托管的预期行为，使得采取此类措施成为必要。未来正在考虑采用“无JavaScript”的解决方案。"
  },
  {
    "id": "44745045",
    "title": "Benchmarks in CI: Escaping the Cloud Chaos",
    "url": "https://codspeed.io/blog/benchmarks-in-ci-without-noise",
    "summary": "This article addresses the challenges of running reliable performance benchmarks in Continuous Integration (CI) environments, particularly due to the \"noisy neighbor\" problem in cloud-hosted runners like GitHub Actions.  It highlights the importance of catching performance regressions early to prevent negative impacts on user experience, cost, and development efficiency.\n\nThe author demonstrates that GitHub-hosted runners have a high coefficient of variation (2.66%) leading to a significant false positive rate (45%) when trying to detect even small (2%) performance regressions. This makes performance gates unreliable and erodes trust in the benchmarking process.\n\nTo combat this, the article introduces \"CodSpeed Macro Runners,\" a solution built on bare-metal instances with OS-level optimizations designed for high-precision benchmarking. These Macro Runners drastically reduce variance (0.56%), leading to a much lower false positive rate. Using the same 2% performance gate, the false positive rate drops to 0.04%.\n\nThe article emphasizes that minimal changes are required to integrate CodSpeed Macro Runners into existing CI workflows, primarily by changing the `runs-on` field in GitHub Actions.  It concludes by advocating for reliable performance data in CI to improve user experience, lower costs, enhance developer feedback loops, and reduce post-deployment debugging. It also promises a future deep dive into the technical details of their infrastructure.\n",
    "chinese_title": "CI中的基准测试：摆脱云混沌",
    "chinese_summary": "本文探讨了在持续集成 (CI) 环境中运行可靠性能基准测试所面临的挑战，尤其是在诸如 GitHub Actions 等云托管 runners 中由于 \"嘈杂邻居\" 问题。 文章强调了尽早发现性能衰退以防止对用户体验、成本和开发效率产生负面影响的重要性。\n\n作者证明了 GitHub 托管 runners 具有较高的变异系数 (2.66%)，导致在试图检测即使是很小 (2%) 的性能衰退时也会产生显著的假阳性率 (45%)。 这使得性能门不可靠，并削弱了对基准测试过程的信任。\n\n为了解决这个问题，本文介绍了 \"CodSpeed Macro Runners\"，这是一种基于裸机实例且具有为高精度基准测试设计的操作系统级优化的解决方案。 这些 Macro Runners 大幅降低了方差 (0.56%)，从而导致假阳性率大大降低。 使用相同的 2% 性能门，假阳性率降至 0.04%。\n\n文章强调，将 CodSpeed Macro Runners 集成到现有 CI 工作流程中只需要进行极少的更改，主要通过更改 GitHub Actions 中的 `runs-on` 字段。 最后，文章主张在 CI 中使用可靠的性能数据，以改善用户体验、降低成本、增强开发者反馈循环以及减少部署后的调试。 文章还承诺未来将深入探讨其基础设施的技术细节。"
  },
  {
    "id": "44767304",
    "title": "Show HN: NaturalCron – Human-Readable Scheduling for .NET (With Fluent Builder)",
    "url": "https://github.com/hugoj0s3/NaturalCron",
    "summary": "NaturalCron is a .NET library designed to simplify scheduling tasks by using human-readable expressions instead of complex cron strings. It aims to improve code readability and reduce errors by allowing developers to define schedules with intuitive syntax, like \"every 30 minutes in [jan, jun] between 09:00 and 18:00\".\n\nKey features include support for ranges, weekday lists, first/last day handling, and time zone support using IANA TZ names. NaturalCron is not a cron converter but a new expressive syntax that focuses on enhanced readability.\n\nThe library provides two ways to define schedules:\n\n*   **Using Expressions:** Parsing a string-based human-readable expression.\n*   **Using a Fluent Builder API:** A strongly-typed API for .NET developers with IntelliSense support.\n\nThe article showcases examples comparing cron expressions with NaturalCron expressions for common scheduling tasks. It also includes installation instructions (`dotnet add package NaturalCron`), documentation links, and encourages contributions and support for the project. Finally, it highlights that this approach eliminates the need for online cron expression generators.\n",
    "chinese_title": "Show HN: NaturalCron – .NET 人性化可读调度器（带流畅构建器）",
    "chinese_summary": "NaturalCron 是一个 .NET 库，旨在通过使用人类可读的表达式（而不是复杂的 cron 字符串）来简化调度任务。它旨在通过允许开发人员使用直观的语法（例如“在 [jan, jun] 中每隔 30 分钟，时间在 09:00 到 18:00 之间”）来定义计划，从而提高代码的可读性并减少错误。\n\n主要功能包括支持范围、工作日列表、首日/末日处理以及使用 IANA TZ 名称的时区支持。 NaturalCron 不是 cron 转换器，而是一种新的表达语法，专注于增强可读性。\n\n该库提供了两种定义计划的方式：\n\n*   **使用表达式：** 解析基于字符串的人类可读表达式。\n*   **使用 Fluent Builder API：** 一个为 .NET 开发人员提供的具有 IntelliSense 支持的强类型 API。\n\n本文展示了比较常见调度任务的 cron 表达式和 NaturalCron 表达式的示例。 它还包括安装说明 (`dotnet add package NaturalCron`)、文档链接，并鼓励对该项目做出贡献和支持。 最后，它强调这种方法消除了对在线 cron 表达式生成器的需求。"
  },
  {
    "id": "44777189",
    "title": "Friending",
    "url": "https://www.profgalloway.com/friending/",
    "summary": "Scott Galloway's article \"Friending\" highlights the declining number of close friendships among American men and its negative consequences. He cites statistics showing a significant drop in men reporting having at least six close friends, coupled with a rise in those reporting zero friends. This lack of social connection contributes to issues like deaths of despair, addiction, misogyny, and overall inadequacy as partners, employees, and citizens.\n\nGalloway emphasizes the importance of surrounding oneself with impressive, good people and actively seeking out new friendships at any age. He challenges the tendency to become socially stagnant as one gets older, advocating for pushing beyond comfort zones and being open to new connections. He shares anecdotes about forming friendships later in life, including initiating contact with individuals he admired.\n\nThe article also touches on Galloway's personal experiences, highlighting how his perspective on friendships with women has evolved. He encourages readers to overcome insecurities and not be intimidated by others, as he once was. He concludes by emphasizing the enriching nature of life and the value of continually expanding one's social circle to learn and grow. The article serves as a promotion for his new book, \"Notes on Being a Man\", and includes comments from readers sharing their own experiences and perspectives on the importance of friendship.\n",
    "chinese_title": "交友",
    "chinese_summary": "斯科特·加洛韦的文章《交友》强调了美国男性亲密友谊数量的下降及其负面后果。他引用统计数据表明，报告至少有六个亲密朋友的男性人数显著下降，而报告零朋友的人数则在上升。这种缺乏社会联系的情况导致了诸如绝望性死亡、成瘾、厌女症以及作为伴侣、雇员和公民的整体不足等问题。\n\n加洛韦强调了与令人印象深刻的优秀人士为伍，并在任何年龄积极寻求新友谊的重要性。他挑战了随着年龄增长而变得社交停滞的趋势，倡导突破舒适区并对新的联系持开放态度。他分享了晚年建立友谊的轶事，包括主动联系他钦佩的人。\n\n这篇文章还涉及加洛韦的个人经历，强调了他对与女性友谊的看法是如何演变的。他鼓励读者克服不安全感，不要被他人吓倒，就像他曾经那样。他最后强调了生活的丰富性以及不断扩大社交圈以学习和成长的价值。这篇文章也是对他新书《男人札记》的宣传，并包含了读者分享他们自己关于友谊重要性的经历和观点的评论。"
  },
  {
    "id": "44695015",
    "title": "Write \"Freehold\" Software",
    "url": "https://deadbeef.io/freehold_software",
    "summary": "This \"article\" is essentially a snippet pointing to a website, `deadbeef.io`, followed by the message \"Error: An unknown error occurred.\" There's no substantial content to summarize beyond this.\n\nTherefore, the main point is that the website `deadbeef.io` is associated with some kind of software or project labeled \"Freehold,\" and accessing the website results in an unknown error. We can infer that either the website is currently down, experiencing technical difficulties, or there's an issue related to accessing information about the \"Freehold\" software through the provided URL. The user intended to visit the site to learn more about \"Freehold\" software but was met with an error instead.\n",
    "chinese_title": "编写“永久产权”软件",
    "chinese_summary": "这篇文章实际上只是一个指向 `deadbeef.io` 网站的链接，并附带消息“错误：发生未知错误。” 除此之外，没有实质内容可以总结。\n\n因此，要点是网站 `deadbeef.io` 与名为“Freehold”的软件或项目相关联，但访问该网站会产生未知错误。 我们可以推断该网站目前已关闭、遇到技术困难，或者通过提供的URL访问有关“Freehold”软件的信息时出现问题。 用户本想访问该网站以了解有关“Freehold”软件的更多信息，但却遇到了错误。"
  },
  {
    "id": "44764568",
    "title": "Robert Wilson has died",
    "url": "https://www.theartnewspaper.com/2025/08/01/robert-wilson-playwright-director-artist-obituary",
    "summary": "Robert Wilson, the highly influential experimental playwright, director, and visual artist, has died at the age of 83 at his home in Water Mill, New York, after a short illness. Known for his visually striking and stylised theatrical productions, Wilson collaborated with a diverse range of artists, including Philip Glass, Laurie Anderson, Marina Abramović, and Lady Gaga.\n\nThroughout his six-decade career, Wilson's productions, such as \"Deafman Glance\" and \"Einstein on the Beach\" (with Philip Glass), challenged theatrical norms and gained international acclaim. His distinctive style, which rejected naturalism, incorporated elements of silent film, mime, and minimalist stage design, emphasizing the importance of visual elements alongside text and music.\n\nBeyond theatre, Wilson was a prolific visual artist, creating drawings, sculptures, and video portraits. His Video Portraits series, featuring celebrities like Lady Gaga, Brad Pitt, and Winona Ryder in the style of classical paintings, was exhibited at prestigious institutions like the Louvre. He also designed exhibitions, notably the Giorgio Armani retrospective at the Guggenheim.\n\nBorn in a conservative Texas environment, Wilson studied dance and architecture before forming the Byrd Hoffman School of Byrds and staging performances in New York City. In 1992, he founded the Watermill Center, a prominent arts organization on Long Island, known for its annual benefit gala. Wilson consistently cited architecture as a major influence, emphasizing the fundamental role of light in creating space and shaping his artistic vision.\n",
    "chinese_title": "罗伯特·威尔逊去世了",
    "chinese_summary": "极具影响力的实验剧作家、导演和视觉艺术家罗伯特·威尔逊因病于纽约州水磨坊的家中去世，享年83岁。他以其视觉冲击力强、风格化的戏剧作品而闻名，曾与菲利普·格拉斯、劳里·安德森、玛丽娜·阿布拉莫维奇和Lady Gaga等众多艺术家合作。\n\n在长达六十年的职业生涯中，威尔逊的作品，如《聋人一瞥》和（与菲利普·格拉斯合作的）《海滩上的爱因斯坦》，挑战了戏剧规范并获得了国际赞誉。他独特的风格摒弃了自然主义，融合了默片、哑剧和极简主义舞台设计的元素，强调了视觉元素与文本和音乐的重要性。\n\n除了戏剧，威尔逊还是一位多产的视觉艺术家，创作了绘画、雕塑和录像肖像。他的录像肖像系列，以 Lady Gaga、布拉德·皮特和薇诺娜·瑞德等名人为特色，采用古典绘画的风格，曾在卢浮宫等著名机构展出。他还设计展览，尤其是古根海姆博物馆的乔治·阿玛尼回顾展。\n\n威尔逊出生于德克萨斯州一个保守的环境中，在成立伯德·霍夫曼·伯德学校并在纽约市进行表演之前，他学习了舞蹈和建筑学。1992 年，他在长岛创立了水磨坊艺术中心，该中心以其年度慈善晚会而闻名。威尔逊一直认为建筑是他的主要影响，强调光在创造空间和塑造他的艺术视野中的根本作用。"
  },
  {
    "id": "44731116",
    "title": "How I do support and community",
    "url": "https://pketh.org/support-community.html",
    "summary": "This article details the author's philosophy and practical approach to customer support and community building for their software, Kinopio.  The author sees support not as a cost-cutting exercise, but as a valuable opportunity to build a strong, engaged community. They strive to provide excellent service, drawing an analogy to running a high-quality hotel where customer experience is paramount.\n\nThe author balances coding and community engagement, acknowledging the tension between focusing on software improvements and attending to user needs.  They actively embrace user contact through email, Discord chat, and a Discourse forum, each serving different purposes. They emphasize the importance of proactively managing and organizing these communication channels, a practice they call \"constant pruning.\"\n\nKey strategies include welcoming new community members, directing conversations to appropriate channels (email, chat, or forum) based on their nature and urgency, and prioritizing the forum for long-term discussion and knowledge capture. The author acknowledges the effort required to shift communication types, framing it as a filter for user commitment.\n\nUltimately, the author advocates for a long-term view of customer support.  They prioritize treating existing customers well and believe it is essential for building a sustainable and lasting company. They see personalized support and community engagement as vital differentiators in a market saturated with automated solutions. They highlight the importance of being \"many:many,\" rather than \"1:many.\"\n",
    "chinese_title": "我如何做支持和社区",
    "chinese_summary": "本文详细介绍了作者关于其软件Kinopio的客户支持和社区建设的理念和实践方法。作者认为支持不是一项削减成本的活动，而是一个建立强大、积极参与的社区的宝贵机会。他们努力提供卓越的服务，将其比作经营一家以客户体验至上的高品质酒店。\n\n作者平衡了编码和社区参与，承认专注于软件改进与关注用户需求之间的紧张关系。他们通过电子邮件、Discord聊天和Discourse论坛积极地与用户联系，每种渠道都有不同的用途。他们强调积极管理和组织这些沟通渠道的重要性，他们称之为“持续修剪”。\n\n关键策略包括欢迎新社区成员，根据其性质和紧急程度将对话引导至适当的渠道（电子邮件、聊天或论坛），并优先考虑论坛进行长期讨论和知识积累。作者承认转换沟通类型所需的努力，将其视为用户承诺的过滤器。\n\n最终，作者提倡对客户支持采取长远的眼光。他们优先考虑善待现有客户，并认为这对于建立可持续和持久的公司至关重要。他们认为个性化的支持和社区参与是在一个充斥着自动化解决方案的市场中重要的差异化因素。他们强调成为“多对多”的重要性，而不是“一对多”。"
  },
  {
    "id": "44743034",
    "title": "Caches: LRU vs. Random",
    "url": "https://danluu.com/2choices-eviction/",
    "summary": "生成摘要时出错",
    "chinese_title": "Caches: LRU vs. Random",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44767928",
    "title": "The Rubik's Cube Perfect Scramble (2024)",
    "url": "https://www.solutionslookingforproblems.com/post/the-rubik-s-cube-perfect-scramble",
    "summary": "生成摘要时出错",
    "chinese_title": "The Rubik's Cube Perfect Scramble (2024)",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44775395",
    "title": "StreamPark: A streaming application development framework",
    "url": "https://github.com/apache/streampark",
    "summary": "生成摘要时出错",
    "chinese_title": "StreamPark: A streaming application development framework",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44746529",
    "title": "I tried living on IPv6 for a day",
    "url": "https://www.xda-developers.com/the-internet-isnt-fully-ipv6-ready/",
    "summary": "生成摘要时出错",
    "chinese_title": "I tried living on IPv6 for a day",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44769145",
    "title": "Linear Types for Programmers (2023)",
    "url": "https://twey.io/for-programmers/linear-types/",
    "summary": "生成摘要时出错",
    "chinese_title": "Linear Types for Programmers (2023)",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44767125",
    "title": "ThinkPad designer David Hill on unreleased models",
    "url": "https://www.theregister.com/2025/08/02/thinkpad_david_hill_interview/",
    "summary": "生成摘要时出错",
    "chinese_title": "ThinkPad designer David Hill on unreleased models",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44719222",
    "title": "Show HN: Draw a fish and watch it swim with the others",
    "url": "https://drawafish.com",
    "summary": "生成摘要时出错",
    "chinese_title": "Show HN: Draw a fish and watch it swim with the others",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44721932",
    "title": "JavaScript retro sound effects generator",
    "url": "https://github.grumdrig.com/jsfxr/",
    "summary": "生成摘要时出错",
    "chinese_title": "JavaScript retro sound effects generator",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44773296",
    "title": "A Letter to the CalyxOS Community",
    "url": "https://calyxos.org/news/2025/08/01/a-letter-to-our-community/",
    "summary": "生成摘要时出错",
    "chinese_title": "A Letter to the CalyxOS Community",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44767858",
    "title": "The case for having roommates even when you can afford to live alone",
    "url": "https://supernuclear.substack.com/p/the-case-for-having-roommates-even",
    "summary": "生成摘要时出错",
    "chinese_title": "The case for having roommates even when you can afford to live alone",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44762859",
    "title": "Tim Cook rallying Apple employees around AI efforts",
    "url": "https://www.bloomberg.com/news/articles/2025-08-01/apple-ceo-tells-staff-ai-is-ours-to-grab-in-hourlong-pep-talk",
    "summary": "生成摘要时出错",
    "chinese_title": "Tim Cook rallying Apple employees around AI efforts",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44768677",
    "title": "How to reverse engineer an analog chip: the TDA7000 FM radio receiver",
    "url": "https://www.righto.com/2025/08/reverse-engineering-analog-TDA7000.html",
    "summary": "生成摘要时出错",
    "chinese_title": "How to reverse engineer an analog chip: the TDA7000 FM radio receiver",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44762959",
    "title": "Cerebras Code",
    "url": "https://www.cerebras.ai/blog/introducing-cerebras-code",
    "summary": "生成摘要时出错",
    "chinese_title": "Cerebras Code",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44772997",
    "title": "Show HN: Voltpeek – Vim-inspired oscilloscope software",
    "url": "https://github.com/schuyler4/voltpeek",
    "summary": "生成摘要时出错",
    "chinese_title": "Show HN: Voltpeek – Vim-inspired oscilloscope software",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44732429",
    "title": "A Quantum Gravimeter for GPS Backup",
    "url": "https://spectrum.ieee.org/quantum-gravity-sensor",
    "summary": "生成摘要时出错",
    "chinese_title": "A Quantum Gravimeter for GPS Backup",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44769338",
    "title": "Show HN: Wordle-style game for Fermi questions",
    "url": "https://www.fermiquestions.org/",
    "summary": "生成摘要时出错",
    "chinese_title": "Show HN: Wordle-style game for Fermi questions",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44720619",
    "title": "Yearly Organiser",
    "url": "https://neatnik.net/calendar/",
    "summary": "生成摘要时出错",
    "chinese_title": "Yearly Organiser",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44739998",
    "title": "Neural networks that learn non-linearity without activation functions [pdf]",
    "url": "https://www.tahabouhsine.com/nmn/assets/deep_learning_two_point_o_point_one.pdf",
    "summary": "生成摘要时出错",
    "chinese_title": "Neural networks that learn non-linearity without activation functions [pdf]",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44776340",
    "title": "A laundry-folding robot blew up the Internet. We talked to the inventor",
    "url": "https://sfstandard.com/2025/07/30/ai-lamp-laundry-robot-bedroom/",
    "summary": "生成摘要时出错",
    "chinese_title": "A laundry-folding robot blew up the Internet. We talked to the inventor",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44764376",
    "title": "Hardening mode for the compiler",
    "url": "https://discourse.llvm.org/t/rfc-hardening-mode-for-the-compiler/87660",
    "summary": "生成摘要时出错",
    "chinese_title": "Hardening mode for the compiler",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44771060",
    "title": "Modeling open-world cognition as on-demand synthesis of probabilistic models",
    "url": "https://arxiv.org/abs/2507.12547",
    "summary": "生成摘要时出错",
    "chinese_title": "Modeling open-world cognition as on-demand synthesis of probabilistic models",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44761548",
    "title": "Native Sparse Attention",
    "url": "https://aclanthology.org/2025.acl-long.1126/",
    "summary": "生成摘要时出错",
    "chinese_title": "Native Sparse Attention",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44749387",
    "title": "The Big Oops in type systems: This problem extends to FP as well",
    "url": "https://danieltan.weblog.lol/2025/07/the-big-oops-in-type-systems-this-problem-extends-to-fp-as-well",
    "summary": "生成摘要时出错",
    "chinese_title": "The Big Oops in type systems: This problem extends to FP as well",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44765292",
    "title": "This Month in Ladybird",
    "url": "https://ladybird.org/newsletter/2025-07-31/",
    "summary": "生成摘要时出错",
    "chinese_title": "This Month in Ladybird",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44740034",
    "title": "TclSqueak – Program in Tcl the Smalltalk Way",
    "url": "http://www.xdobry.de/tclsqueak/",
    "summary": "生成摘要时出错",
    "chinese_title": "TclSqueak – Program in Tcl the Smalltalk Way",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44739315",
    "title": "The Math Is Haunted",
    "url": "https://overreacted.io/the-math-is-haunted/",
    "summary": "生成摘要时出错",
    "chinese_title": "The Math Is Haunted",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44762856",
    "title": "Anthropic revokes OpenAI's access to Claude",
    "url": "https://www.wired.com/story/anthropic-revokes-openais-access-to-claude/",
    "summary": "生成摘要时出错",
    "chinese_title": "Anthropic revokes OpenAI's access to Claude",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44768048",
    "title": "VSCode extension for syntax highlighting multi-line YAML strings",
    "url": "https://github.com/harrydowning/vscode-yaml-embedded-languages",
    "summary": "生成摘要时出错",
    "chinese_title": "VSCode extension for syntax highlighting multi-line YAML strings",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44759171",
    "title": "Ergonomic keyboarding with the Svalboard: a half-year retrospective",
    "url": "https://twey.io/hci/svalboard/",
    "summary": "生成摘要时出错",
    "chinese_title": "Ergonomic keyboarding with the Svalboard: a half-year retrospective",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44720285",
    "title": "Make Your Own Backup System – Part 2: Forging the FreeBSD Backup Stronghold",
    "url": "https://it-notes.dragas.net/2025/07/29/make-your-own-backup-system-part-2-forging-the-freebsd-backup-stronghold/",
    "summary": "生成摘要时出错",
    "chinese_title": "Make Your Own Backup System – Part 2: Forging the FreeBSD Backup Stronghold",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44724259",
    "title": "How Hyper built a 1M-accurate indoor GPS",
    "url": "https://andrewhart.me/hyper/",
    "summary": "生成摘要时出错",
    "chinese_title": "How Hyper built a 1M-accurate indoor GPS",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44772110",
    "title": "Running Gaming Workloads Through AMD's Zen 5",
    "url": "https://chipsandcheese.com/p/running-gaming-workloads-through",
    "summary": "生成摘要时出错",
    "chinese_title": "Running Gaming Workloads Through AMD's Zen 5",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44759152",
    "title": "At 17, Hannah Cairo solved a major math mystery",
    "url": "https://www.quantamagazine.org/at-17-hannah-cairo-solved-a-major-math-mystery-20250801/",
    "summary": "生成摘要时出错",
    "chinese_title": "At 17, Hannah Cairo solved a major math mystery",
    "chinese_summary": "生成摘要时出错"
  }
]