[
  {
    "id": "44595492",
    "title": "ChatGPT agent: bridging research and action",
    "url": "https://openai.com/index/introducing-chatgpt-agent/",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "ChatGPT 智能体：连接研究与实践",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "44594156",
    "title": "Mistral Releases Deep Research, Voice, Projects in Le Chat",
    "url": "https://mistral.ai/news/le-chat-dives-deep",
    "summary": "Mistral AI has significantly enhanced its \"Le Chat\" AI assistant with several new features designed to improve research capabilities, user experience, and organization. A major addition is \"Deep Research\" mode, which transforms Le Chat into a research assistant capable of planning, clarifying needs, gathering credible sources, and creating structured reports on complex topics. The new \"Voice mode,\" powered by the \"Voxtral\" model, enables users to interact with Le Chat via speech, offering low-latency speech recognition. \"Think mode,\" utilizing the \"Magistral\" reasoning model, provides thoughtful answers and supports multilingual reasoning, even within a single sentence.\n\nLe Chat now offers \"Projects,\" allowing users to organize conversations and related files into context-rich folders, streamlining workflows and improving organization. In partnership with Black Forest Labs, Le Chat also introduces advanced image editing directly within the platform, enabling users to modify images with simple prompts while maintaining consistency across a series of images.\n\nUsers can access these new features via the Le Chat web application (chat.mistral.ai) or through mobile apps on the App Store and Play Store, with no credit card required for access. Mistral AI also encourages businesses to explore Le Chat Enterprise for organizational transformation and invites individuals interested in AI development to apply for open positions within the company.\n",
    "chinese_title": "Mistral 在 Le Chat 中发布深度研究、语音和项目",
    "chinese_summary": "Mistral AI大幅增强了其“Le Chat”AI助手，新增多项功能，旨在提升研究能力、用户体验和组织性。主要新增功能是“深度研究”模式，它将Le Chat转变为研究助手，能够规划、明确需求、收集可靠来源，并就复杂主题创建结构化报告。新的“语音模式”由“Voxtral”模型提供支持，使用户能够通过语音与Le Chat互动，提供低延迟语音识别。“思考模式”利用“Magistral”推理模型，提供周到的答案并支持多语言推理，即使在单个句子中也能实现。\n\nLe Chat现在提供“项目”功能，允许用户将对话和相关文件组织到上下文丰富的文件夹中，从而简化工作流程并提高组织性。Le Chat还与Black Forest Labs合作，直接在平台内引入高级图像编辑功能，使用户能够通过简单的提示修改图像，同时保持一系列图像的一致性。\n\n用户可以通过Le Chat Web应用程序 (chat.mistral.ai) 或 App Store 和 Play Store 上的移动应用程序访问这些新功能，无需信用卡即可访问。 Mistral AI还鼓励企业探索Le Chat Enterprise以进行组织转型，并邀请对AI开发感兴趣的个人申请公司内的职位空缺。"
  },
  {
    "id": "44592413",
    "title": "Hand: open-source Robot Hand",
    "url": "https://github.com/pollen-robotics/AmazingHand",
    "summary": "The \"Hand: Open-Source Robot Hand\" project aims to create a low-cost, expressive, and dexterous humanoid robot hand, specifically designed with the Reachy2 robot in mind but adaptable to others. Licensed under Apache 2.0 and Creative Commons 4.0, the project offers a 3D-printable, 8-DOF hand with internal actuators, weighing approximately 400g and costing under €200.\n\nKey features include four fingers with two phalanxes each, flexible shells, and parallel mechanisms driven by Feetech SCS0009 servos. Control can be implemented via a serial bus driver with Python or Arduino with a Feetech TTL Linker.\n\nThe project provides comprehensive build resources, including a Bill of Materials (BOM), CAD files (STL, STEP, and Onshape document), and assembly guides.  Calibration scripts are also provided for both Python and Arduino. Basic demo software is available to showcase the hand's functionality.\n\nOngoing development focuses on design improvements like a custom PCB, prehensive task testing, smarter closing behaviors, exploring different finger lengths/a fifth finger, considering stronger motors (STS3032), adding compliancy with springs, and integrating fingertip sensors. The project welcomes community contributions and provides contact information via Discord and Pollen Robotics.\n",
    "chinese_title": "手：开源机器人手",
    "chinese_summary": "“手：开源机器人手”项目旨在创建一个低成本、富有表现力且灵巧的类人机器人手，专为 Reachy2 机器人设计，但也适用于其他机器人。该项目采用 Apache 2.0 和 Creative Commons 4.0 许可，提供一个可 3D 打印的、8 自由度的机械手，带有内置执行器，重量约为 400 克，成本低于 200 欧元。\n\n主要特性包括四根手指，每根手指有两节指骨，柔性外壳，以及由 Feetech SCS0009 舵机驱动的平行机构。可以通过带 Python 或 Arduino 的串行总线驱动程序以及 Feetech TTL Linker 实现控制。\n\n该项目提供全面的构建资源，包括物料清单 (BOM)、CAD 文件（STL、STEP 和 Onshape 文档）以及组装指南。还提供 Python 和 Arduino 的校准脚本。提供基本演示软件来展示机械手的功能。\n\n正在进行的开发工作侧重于设计改进，例如定制 PCB、全面的任务测试、更智能的闭合行为、探索不同的手指长度/第五根手指、考虑更强的电机 (STS3032)、增加弹簧柔顺性以及集成指尖传感器。该项目欢迎社区贡献，并通过 Discord 和 Pollen Robotics 提供联系方式。"
  },
  {
    "id": "44594475",
    "title": "How I Use Kagi",
    "url": "https://flamedfury.com/posts/how-i-use-kagi/",
    "summary": "This article details the author's positive experience using the Kagi search engine since early 2023. The author pays $14 USD/month for Kagi's Duo Family plan, emphasizing the value of an ad-free search experience. Two key features are highlighted: Lenses and Personal Results.\n\nLenses allow users to customize search results by specifying which websites to include. The author created a \"Smaller Web\" lens to focus on smaller web communities and \"The Old Web\" lens to search websites hosted on platforms from the past.\n\nPersonal Results enables users to block, lower, raise, or pin specific websites or domains to influence their search result rankings. The author discusses building a comprehensive block list, initially inspired by Bobby Hiltz's list aimed at combating SEO manipulation and promoting better search results by blocking domains of companies that dominate search results. The author has a shared Kagi block list available for others to use.\n\nIn short, the author finds Kagi valuable due to its ad-free nature and customizable features that allow for a more curated and less manipulated search experience. The author uses Lenses to explore niche web communities and Personal Results to filter out undesirable domains.\n",
    "chinese_title": "我如何使用Kagi",
    "chinese_summary": "本文详细介绍了作者自2023年初以来使用Kagi搜索引擎的积极体验。作者每月支付14美元购买Kagi的Duo家庭计划，强调了无广告搜索体验的价值。文章重点介绍了两个关键功能：Lenses和Personal Results。\n\nLenses允许用户通过指定包含哪些网站来定制搜索结果。作者创建了一个“Smaller Web”镜头，专注于较小的网络社区，以及一个“The Old Web”镜头，用于搜索托管在过去平台上的网站。\n\nPersonal Results使用户能够阻止、降低、提高或置顶特定的网站或域名，从而影响他们的搜索结果排名。作者讨论了构建一个全面的阻止列表，最初的灵感来自Bobby Hiltz的列表，该列表旨在通过阻止主导搜索结果的公司的域名来打击SEO操纵并促进更好的搜索结果。作者有一个共享的Kagi阻止列表可供其他人使用。\n\n简而言之，作者认为Kagi很有价值，因为它具有无广告的特性和可定制的功能，从而可以提供更精选和更少受操纵的搜索体验。作者使用Lenses来探索利基网络社区，并使用Personal Results来过滤掉不良域名。"
  },
  {
    "id": "44560943",
    "title": "Doing Hard Things",
    "url": "https://parv.bearblog.dev/kayaking/",
    "summary": "In this personal reflection, the author recounts their unexpected journey into kayaking, a sport starkly contrasting with their lack of natural athletic ability. Initially struggling with balance and constantly capsizing, they found something compelling in the challenge.\n\nThe author details the incremental, often imperceptible progress they made. Rather than dramatic improvement, it was characterized by falling less often, refining their stroke, and developing a deeper awareness of their surroundings. They moved from training boats to racing boats, still lagging behind teammates but showing improvement. The encouragement from their team captain, rooted in the expectation of eventual progress, proved pivotal.\n\nLess than a year later, the author surprisingly made varsity and even competed in an inter-tertiary race, managing not to win but also not to capsize. Kayaking, they realized, taught them the valuable skill of being comfortable looking foolish in public. They conclude by highlighting the rewarding nature of persevering in a challenging activity, despite initial difficulties and without necessarily achieving resounding success. The experience serves as a broader metaphor for life, emphasizing the importance of continuous effort and finding dignity in the \"almost-stories\" of personal growth.\n",
    "chinese_title": "做难事",
    "chinese_summary": "意外的皮划艇之旅：在笨拙中找到自我"
  },
  {
    "id": "44556997",
    "title": "Archaeologists Discover Tomb of First King of Caracol",
    "url": "https://uh.edu/news-events/stories/2025/july/07102025-caracol-chase-discovery-maya-ruler.php",
    "summary": "Archaeologists Arlen and Diane Chase of the University of Houston have discovered the tomb of Te K’ab Chaak, the first ruler of the ancient Maya city of Caracol in Belize, who reigned starting in 331 AD. This is the first identifiable ruler's tomb found in Caracol in over 40 years, and it sheds light on Caracol's early history and its connection to Teotihuacan.\n\nThe tomb, located at the base of a royal family shrine in Caracol’s Northeast Acropolis, contained valuable artifacts including pottery vessels, jadeite jewelry, a mosaic jadeite mask, and bone tubes. The artifacts hint at Maya rituals and interactions, including a potential connection to Teotihuacan, indicated by the depiction of the Maya god of traders and the presence of bound captives.\n\nThe Chases’ research reveals that Caracol had contact with Teotihuacan earlier than previously thought. A cremation site dating back to 350 AD found near the tomb contained central Mexican artifacts like green obsidian blades and atlatl points. The positioning of the cremation also suggests Teotihuacan burial practices. These discoveries reveal that the Maya and Teotihuacan exchanged information and possibly even had formal diplomatic relationships during the reign of early kings like Te K’ab Chaak, challenging earlier beliefs about a later \"entrada\" from Teotihuacan. The Chases' work also highlights the advanced urban planning, road systems, and social complexity of Caracol.\n",
    "chinese_title": "考古学家发现卡拉科尔首位国王的陵墓",
    "chinese_summary": "休斯顿大学考古学家阿伦·蔡斯和黛安·蔡斯发现了特·卡布·恰克之墓，他是伯利兹古玛雅城市卡拉科尔的第一位统治者，其统治始于公元331年。这是40多年来在卡拉科尔发现的第一座可辨认的统治者墓葬，它揭示了卡拉科尔的早期历史及其与特奥蒂瓦坎的联系。\n\n该墓位于卡拉科尔东北卫城皇家家族圣殿的底部，其中包含珍贵的文物，包括陶器、翡翠饰品、镶嵌翡翠面具和骨管。这些文物暗示了玛雅的仪式和互动，包括与特奥蒂瓦坎的潜在联系，这体现在对玛雅贸易之神的描绘以及被捆绑的俘虏的存在。\n\n蔡斯夫妇的研究表明，卡拉科尔与特奥蒂瓦坎的接触比之前认为的要早。在墓葬附近发现的一个可以追溯到公元350年的火葬场，包含着墨西哥中部的文物，如绿色黑曜石刀片和投矛器尖。火葬场的布置也暗示了特奥蒂瓦坎的埋葬习俗。这些发现表明，玛雅人和特奥蒂瓦坎人在早期国王（如特·卡布·恰克）的统治期间交换了信息，甚至可能建立了正式的外交关系，这挑战了之前关于特奥蒂瓦坎后来“入侵”的观点。蔡斯夫妇的研究也突显了卡拉科尔先进的城市规划、道路系统和社会复杂性。"
  },
  {
    "id": "44555924",
    "title": "Writing a competitive BZip2 encoder in Ada from scratch in a few days (2024)",
    "url": "https://gautiersblog.blogspot.com/2024/11/writing-bzip2-encoder-in-ada-from.html",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "几天内从头开始用Ada编写一个有竞争力的BZip2编码器 (2024)",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "44590189",
    "title": "Wttr: Console-oriented weather forecast service",
    "url": "https://github.com/chubin/wttr.in",
    "summary": "Wttr.in is a console-oriented weather forecast service accessible via command-line tools like `curl` or web browsers. It supports multiple output formats, including ANSI for terminals, HTML for browsers, PNG for graphical viewers, JSON and Prometheus metrics for scripts/APIs, and plain text.\n\nUsers can retrieve weather for specific locations by appending the location name to the URL (e.g., `wttr.in/London`). If no location is provided, it defaults to the user's IP-based location. It also supports airport codes (e.g., `wttr.in/muc`), special locations using the `~` prefix, IP addresses, and domain names (prefixed with `@`).\n\nThe service allows customization of units (metric or USCS) using `?u`, `?m`, or `?M` parameters. Output format can be forced using parameters like `?T` for plain text or `.png` for PNG images, along with options like transparency.\n\nWttr.in offers one-line output formats for status bars, configurable with pre-defined formats or custom formats using a `%`-notation. The service supports integration with tools like tmux, WeeChat, and Conky. Emojis are supported if the terminal and fonts are configured correctly.\n\nThe data-rich output format (v2) provides more detailed weather and astronomical information. The map view (v3) displays weather data for geographical regions in PNG, Sixel, or IIP formats.\n\nJSON and Prometheus Metrics formats allow parsing weather data into other monitoring services. Wttr.in can also display moon phases for specific dates and supports multilingual location names.\n",
    "chinese_title": "Wttr: 面向控制台的天气预报服务",
    "chinese_summary": "Wttr.in 是一个面向控制台的天气预报服务，可以通过 `curl` 等命令行工具或 Web 浏览器访问。它支持多种输出格式，包括用于终端的 ANSI、用于浏览器的 HTML、用于图形查看器的 PNG、用于脚本/API 的 JSON 和 Prometheus 指标，以及纯文本。\n\n用户可以通过将位置名称附加到 URL 来检索特定位置的天气（例如，`wttr.in/London`）。如果没有提供位置，则默认为基于用户 IP 的位置。它还支持机场代码（例如，`wttr.in/muc`）、使用 `~` 前缀的特殊位置、IP 地址和域名（以 `@` 为前缀）。\n\n该服务允许使用 `?u`、`?m` 或 `?M` 参数自定义单位（公制或 USCS）。可以使用 `?T` (纯文本) 或 `.png` (PNG图像) 等参数强制输出格式，以及透明度等选项。\n\nWttr.in 为状态栏提供单行输出格式，可以使用预定义的格式或使用 `％` 符号的自定义格式进行配置。该服务支持与 tmux、WeeChat 和 Conky 等工具集成。如果终端和字体配置正确，则支持表情符号。\n\n数据丰富的输出格式 (v2) 提供更详细的天气和天文信息。地图视图 (v3) 以 PNG、Sixel 或 IIP 格式显示地理区域的天气数据。\n\nJSON 和 Prometheus 指标格式允许将天气数据解析到其他监控服务中。Wttr.in 还可以显示特定日期的月相，并支持多语言的位置名称。"
  },
  {
    "id": "44584372",
    "title": "Ex-Waymo engineers launch Bedrock Robotics to automate construction",
    "url": "https://techcrunch.com/2025/07/16/ex-waymo-engineers-launch-bedrock-robotics-with-80m-to-automate-construction/",
    "summary": "Bedrock Robotics, founded by ex-Waymo and Segment engineers, has emerged from stealth mode with $80 million in funding from Eclipse and 8VC. The startup is developing a self-driving kit to retrofit existing construction and worksite vehicles with sensors, compute, and AI to enable autonomous operation. This includes adapting to changing conditions and executing work around the clock.\n\nCEO Boris Sofman, formerly head of Waymo's self-driving truck program and CEO of Anki Robotics, leads the company. Other co-founders include Waymo veterans Kevin Peterson (CTO), Ajay Gummalla (VP of Engineering), and Tom Eliaz (VP of Engineering, previously at Segment and Twilio).\n\nBedrock joins a growing field of companies applying autonomous vehicle technology to off-road environments like construction and mining. They are currently testing in Arkansas, Arizona, Texas, and California with Sundt Construction, Zachry Construction Corporation, Champion Site Prep Inc., and Capitol Aggregates Inc. Bedrock Robotics is the latest company to follow other startups such as Pronto, Kodiak Robotics, and Polymath Robotics.\n",
    "chinese_title": "前Waymo工程师创立Bedrock Robotics，以实现建筑自动化",
    "chinese_summary": "Bedrock Robotics获8000万美元融资，推出自动驾驶套件"
  },
  {
    "id": "44588491",
    "title": "“Reading Rainbow” was created to combat summer reading slumps",
    "url": "https://www.smithsonianmag.com/smithsonian-institution/to-combat-summer-reading-slumps-this-timeless-childrens-television-show-tried-to-bridge-the-literacy-gap-with-the-magic-of-stories-180986984/",
    "summary": "\"Reading Rainbow,\" the beloved children's program hosted by LeVar Burton, premiered on PBS in 1983 to combat summer reading slumps, also known as the \"summer slide.\" The show aimed to bridge the reading gap for children and improve their reading skills by making learning fun and engaging. As Ryan Lintelman from the Smithsonian's National Museum of American History notes, research confirmed that students' literacy levels often declined during summer break, and \"Reading Rainbow\" was designed to address this issue.\n\nThe half-hour episodes featured Burton introducing children's books through real-world field trips and celebrity narrations of the stories. The program successfully promoted reading comprehension and a love of storytelling. A 1997 study reported that teachers rated \"Reading Rainbow\" as the best educational program.\n\nThe show's origins began as a WNED-TV program idea in Buffalo, New York. Tony Buttino Sr., Barbara Irwin, and Pam Johnson, who worked on the show, recently co-authored a book detailing the behind-the-scenes creation of the series. They emphasized the importance of finding a host who could genuinely connect with children, leading them to cast LeVar Burton.\n\n\"Reading Rainbow\" aired for 23 seasons, winning 26 Emmy Awards and inspiring a lifelong love of reading in its audience. Its unique approach of combining book illustrations with real-world adventures made it a cultural phenomenon and solidified Burton's legacy as an icon of education.\n",
    "chinese_title": "《彩虹阅读》旨在应对暑期阅读滑坡现象。",
    "chinese_summary": "少儿节目《阅读彩虹》由莱瓦尔·伯顿主持，于1983年在PBS首播，旨在对抗夏季阅读能力下降，即“暑期滑坡”。该节目旨在通过寓教于乐的方式，弥合儿童的阅读差距，提高他们的阅读能力。正如史密森尼美国国家历史博物馆的瑞安·林特尔曼所指出的，研究证实，学生的读写能力水平在暑假期间经常下降，《阅读彩虹》就是为了解决这个问题而设计的。\n\n每集半小时的节目中，伯顿通过实地考察和名人叙述故事的方式来介绍儿童读物。该节目成功地提高了阅读理解能力，并培养了对故事的热爱。1997年的一项研究报告称，教师们认为《阅读彩虹》是最好的教育节目。\n\n该节目的起源始于纽约州布法罗市的WNED-TV节目创意。在该节目工作过的托尼·布蒂诺(Tony Buttino Sr.)、芭芭拉·欧文(Barbara Irwin)和帕姆·约翰逊(Pam Johnson)最近共同撰写了一本书，详细介绍了该系列幕后的创作过程。他们强调了找到一位能够真正与孩子们建立联系的主持人的重要性，最终选择了莱瓦尔·伯顿。\n\n《阅读彩虹》播出23季，荣获26项艾美奖，激发了观众终身热爱阅读的热情。它将书籍插图与现实世界的冒险相结合的独特方法使其成为一种文化现象，并巩固了伯顿作为教育偶像的遗产。"
  },
  {
    "id": "44595008",
    "title": "Molecule produced by gut bacteria causes atherosclerosis",
    "url": "https://english.elpais.com/health/2025-07-17/revolution-in-medicine-a-molecule-produced-by-gut-bacteria-causes-atherosclerosis-responsible-for-millions-of-deaths.html",
    "summary": "A study of Banco Santander employees in Madrid has revealed a surprising link between gut bacteria and atherosclerosis, the buildup of fat and cholesterol in arteries. Researchers discovered that certain gut bacteria produce imidazole propionate (C₆H₈N₂O₂), a molecule that triggers inflammation in arteries, directly causing atherosclerosis.\n\nThe study found that 63% of seemingly healthy volunteers between 40 and 55 had signs of atherosclerosis. Elevated levels of imidazole propionate were found in one in five volunteers with active atherosclerosis. Mice administered the molecule developed the disease, demonstrating a causal relationship. Importantly, researchers successfully blocked the molecule's receptor with a drug, preventing atherosclerosis progression in mice, suggesting a potential treatment strategy.\n\nThe discovery highlights that atherosclerosis is not solely caused by fat, but also has inflammatory and autoimmune components. It also explains why some individuals develop heart disease despite normal cholesterol levels. The study identifies specific bacteria like Escherichia, Shigella, and Eubacterium as potential culprits, with their presence linked to dietary modifications. A diet rich in vegetables, fruits, whole grains, fish, tea, and low-fat dairy products is associated with lower imidazole propionate levels.\n\nThe findings, published in Nature, are significant as cardiovascular diseases are a leading cause of death. The early detection of imidazole propionate through advanced imaging could revolutionize atherosclerosis diagnosis and treatment. This discovery adds to the growing understanding of the gut microbiome's role in human diseases, as another study shows that Escherichia coli produces a toxin that can damage DNA and cause tumors.\n",
    "chinese_title": "肠道细菌产生的分子导致动脉粥样硬化",
    "chinese_summary": "一项对马德里桑坦德银行员工的研究揭示了肠道细菌与动脉粥样硬化（动脉中脂肪和胆固醇的积累）之间令人惊讶的联系。研究人员发现，某些肠道细菌会产生咪唑丙酸 (C₆H₈N₂O₂)，这种分子会引发动脉炎症，直接导致动脉粥样硬化。\n\n该研究发现，在40至55岁之间看似健康的志愿者中，有63%的人有动脉粥样硬化的迹象。在五分之一患有活动性动脉粥样硬化的志愿者中，发现咪唑丙酸水平升高。给小鼠注射该分子后，小鼠患上了这种疾病，证明了因果关系。重要的是，研究人员成功地用一种药物阻断了该分子的受体，从而阻止了小鼠动脉粥样硬化的进展，这表明了一种潜在的治疗策略。\n\n这项发现表明，动脉粥样硬化不仅仅是由脂肪引起的，而且还具有炎症和自身免疫成分。它还解释了为什么有些人尽管胆固醇水平正常，却仍然会患上心脏病。该研究确定了如大肠杆菌、志贺氏菌和真杆菌等特定细菌为潜在的罪魁祸首，它们的存在与饮食调整有关。富含蔬菜、水果、全谷物、鱼、茶和低脂乳制品的饮食与较低的咪唑丙酸水平有关。\n\n这项发表在《自然》杂志上的研究结果意义重大，因为心血管疾病是导致死亡的主要原因。通过先进的影像技术早期检测咪唑丙酸可能会彻底改变动脉粥样硬化的诊断和治疗。这项发现进一步加深了人们对肠道微生物组在人类疾病中的作用的理解，另一项研究表明，大肠杆菌产生的一种毒素会损害 DNA 并导致肿瘤。"
  },
  {
    "id": "44560390",
    "title": "ESA’s Moonlight programme: Pioneering the path for lunar exploration (2024)",
    "url": "https://www.esa.int/Applications/Connectivity_and_Secure_Communications/ESA_s_Moonlight_programme_Pioneering_the_path_for_lunar_exploration",
    "summary": "ESA's Moonlight programme aims to establish Europe's first dedicated lunar satellite constellation for telecommunication and navigation services, supporting sustainable lunar exploration and a future lunar economy. With over 400 planned lunar missions in the coming decades, Moonlight will provide crucial infrastructure for precise landings, surface mobility, high-speed communication, and data transfer between Earth and the Moon.\n\nThe constellation will consist of five satellites, connecting to Earth via three dedicated ground stations, creating a data network spanning up to 400,000 km. Satellites will prioritize coverage of the lunar south pole, an area of interest due to its potential for solar power and water ice resources.\n\nThe precursor to the full constellation, Lunar Pathfinder, a communications relay satellite, is scheduled to begin operations in 2026, testing existing Earth-orbiting navigation satellites for lunar use. Full Moonlight operations are expected by 2030.\n\nESA is collaborating with NASA and JAXA on LunaNet, ensuring compatibility with future lunar infrastructures. Moonlight will undergo lunar navigation interoperability tests in 2029. Furthermore, the program aims to support the testing of instruments for other planetary environments, particularly Mars, with the early development of a Mars Communication and Navigation Infrastructure (MARCONI).\n\nThe Moonlight program is a collaborative effort between ESA, industry (led by Telespazio), and national space agencies (UK and Italy). It is a multi-directorate initiative led by Connectivity and Secure Communications (CSC) with support from Navigation (NAV) and Human and Robotic Exploration (HRE).\n",
    "chinese_title": "欧空局“月光”计划：引领月球探索之路（2024年）",
    "chinese_summary": "欧空局“月光”计划旨在建立欧洲首个专门的月球卫星星座，提供电信和导航服务，支持可持续的月球探索和未来的月球经济。未来几十年预计将有超过400次月球任务，“月光”计划将为精确着陆、表面移动、高速通信以及地球和月球之间的数据传输提供关键基础设施。\n\n该星座将由五颗卫星组成，通过三个专用地面站连接到地球，创建一个跨越长达40万公里的数据网络。卫星将优先覆盖月球南极，该区域因其太阳能和水冰资源潜力而备受关注。\n\n作为完整星座的先驱，“月球探路者”是一颗通信中继卫星，计划于2026年开始运行，测试现有的地球轨道导航卫星在月球上的应用。完整的“月光”计划预计将于2030年投入运营。\n\n欧空局正在与美国国家航空航天局（NASA）和日本宇宙航空研究开发机构（JAXA）合作开展LunaNet项目，以确保与未来月球基础设施的兼容性。“月光”计划将于2029年进行月球导航互操作性测试。此外，该计划旨在支持测试其他行星环境（特别是火星）的仪器，并早期开发火星通信和导航基础设施（MARCONI）。\n\n“月光”计划是欧空局、工业界（由泰雷兹阿莱尼亚空间公司领导）和国家航天机构（英国和意大利）之间的合作项目。这是一个由连接和安全通信（CSC）主导，导航（NAV）以及人类和机器人探索（HRE）支持的多部门倡议。"
  },
  {
    "id": "44554530",
    "title": "Lighthouse of Alexandria Rises Again as Giant Blocks Resurface After 2000 Years",
    "url": "https://greekreporter.com/2025/07/01/lighthouse-alexandria-giant-blocks-resurface/",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "亚历山大灯塔重现，巨型石块沉没两千年后重见天日",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "44592344",
    "title": "Rejoy Health (YC W21) Is Hiring",
    "url": "https://www.ycombinator.com/companies/rejoy-health/jobs/DCsxNgv-software-engineer",
    "summary": "Rejoy Health (YC W21), an AI-powered medical search platform for clinicians, is hiring a Software Engineer. The position is remote, full-time, and open to candidates with any experience level, including new grads. Rejoy offers a competitive salary ($180K - $250K) plus equity (0.25% - 0.75%), benefits like health insurance, flexible hours, a learning budget, and the opportunity to work on meaningful problems. Visa sponsorship is available.\n\nThe Software Engineer will be responsible for building and scaling backend systems for the AI search engine, developing APIs for a clinician-facing web app, collaborating with ML engineers on NLP/LLM model integration, and designing reliable infrastructure. Required skills include 1+ year of software engineering experience (Python, React.js preferred), strong understanding of backend development, REST APIs, distributed systems, and experience with cloud platforms (AWS, GCP, Azure) and DevOps tools.\n\nThe interview process involves an online screening with a HireCade AI interviewer and three rounds of virtual onsite interviews. Rejoy Health was founded in 2021 and has a team of 8. The founders are Ritu Ranjna and Rituraj Yadav. Interested candidates can apply through the provided HireCade link. The posting also lists similar job opportunities at other companies.\n",
    "chinese_title": "Rejoy Health (YC W21) 正在招聘",
    "chinese_summary": "Rejoy Health (YC W21) 正在招聘软件工程师，这是一个面向临床医生的 AI 医疗搜索平台。该职位为远程全职，对经验水平不限，包括应届毕业生。 Rejoy 提供具有竞争力的薪资（18 万美元 - 25 万美元）加上股权（0.25% - 0.75%），以及健康保险、弹性工作时间、学习预算等福利，并有机会解决有意义的问题。可提供签证担保。\n\n软件工程师将负责构建和扩展 AI 搜索引擎的后端系统，为面向临床医生的 Web 应用程序开发 API，与机器学习工程师合作进行 NLP/LLM 模型集成，并设计可靠的基础设施。 必备技能包括 1 年以上软件工程经验（首选 Python、React.js），对后端开发、REST API、分布式系统有深刻理解，以及具有云平台（AWS、GCP、Azure）和 DevOps 工具的使用经验。\n\n面试流程包括与 HireCade AI 面试官进行的在线筛选以及三轮虚拟现场面试。 Rejoy Health 成立于 2021 年，团队共有 8 人。创始人为 Ritu Ranjna 和 Rituraj Yadav。 有意者可通过提供的 HireCade 链接申请。该招聘信息还列出了其他公司的类似职位。"
  },
  {
    "id": "44592866",
    "title": "The rise of AI as a threat to the S&P 500 [pdf]",
    "url": "https://autonomy.work/wp-content/uploads/2025/07/Sp-500-capital-at-risk_-3.pdf",
    "summary": "This document, titled \"The rise of AI as a threat to the S&P 500,\" appears to be a PDF file, but the content consists primarily of encoded data rather than readable text.  Therefore, a summary of the article's main points and key information is impossible without proper decoding and text extraction. The PDF data indicates the presence of text, fonts, and potentially images, suggesting a visual document.\n",
    "chinese_title": "人工智能崛起对标普500指数的威胁[pdf]",
    "chinese_summary": "文档标题为“人工智能崛起对标普500指数的威胁”，该文档看似为PDF文件，但内容主要由编码数据构成，而非可读文本。 因此，在没有进行适当解码和文本提取的情况下，无法总结文章的要点和关键信息。 PDF数据表明存在文本、字体以及可能的图像，暗示这是一份可视化的文档。"
  },
  {
    "id": "44586723",
    "title": "I want an iPhone Mini-sized Android phone (2022)",
    "url": "https://smallandroidphone.com/",
    "summary": "Eric Migicovsky, a fan of small phones, is advocating for the creation of a premium, iPhone Mini-sized Android phone. Frustrated by the lack of compact options in the Android market, he aims to rally support and pressure manufacturers like Google or Samsung to produce such a device.\n\nHis ideal phone would prioritize three things: a sub-6\" display mirroring the iPhone 13 Mini's size and design, great cameras comparable to the Pixel 5, and a stock Android OS. While other specs are flexible, he suggests a Snapdragon 8-equivalent processor, 5G, a hole-punch front camera, dual rear cameras, 8GB RAM, 128/256GB storage, and 4 hours of SOT. He lists \"nice-to-haves\" such as ruggedness, water resistance, a fingerprint sensor on the power button, and wireless charging.\n\nMigicovsky acknowledges the difficulty of starting a phone company but expresses willingness to do so if no manufacturer steps up, leveraging his experience from Pebble and Y Combinator. He believes a successful small Android phone could cater to users who dislike large phones and those who might switch from the iPhone Mini if Apple discontinues it. He also emphasizes that he, himself, prefers Android to iOS. He hopes to gather over 50,000 signatures to prove demand.\n",
    "chinese_title": "我想要一部iPhone Mini尺寸的安卓手机（2022年款）",
    "chinese_summary": "迷你安卓旗舰手机倡议：Eric Migicovsky呼吁厂商打造iPhone Mini尺寸的高端安卓手机。他对安卓市场缺乏小屏选择感到沮丧，希望争取支持，推动谷歌或三星等厂商生产此类设备。\n\n他理想的手机应优先考虑三点：采用类似于iPhone 13 Mini尺寸和设计的6英寸以下屏幕，媲美Pixel 5的强大相机，以及原生Android系统。其他配置可灵活调整，他建议搭载骁龙8同级别处理器、5G、打孔前置摄像头、双后置摄像头、8GB内存、128/256GB存储空间，以及4小时亮屏时间。他还列出了“锦上添花”的功能，如耐用性、防水性、电源键指纹传感器和无线充电。\n\nMigicovsky承认创办手机公司困难重重，但也表示如果没有任何厂商采取行动，他愿意利用自己在Pebble和Y Combinator的经验亲自尝试。他认为一款成功的小屏安卓手机可以满足不喜欢大屏手机的用户，以及那些可能在苹果停产iPhone Mini后转投安卓的用户。他还强调自己更喜欢安卓系统。他希望收集超过5万个签名来证明市场需求。"
  },
  {
    "id": "44595406",
    "title": "AI tools slowed down experienced devs by 19%, study finds",
    "url": "https://leaddev.com/velocity/ai-doesnt-make-devs-as-productive-as-they-think-study-finds",
    "summary": "A new study by the Model Evaluation & Threat Research (METR) organization challenges the perception that AI tools automatically boost developer productivity. Researchers tracked 16 experienced developers working on GitHub projects, finding that using AI (Cursor Pro IDE and Anthropic's Claude 3.5/3.7) actually slowed them down by 19% despite the developers anticipating a 24% speed increase.\n\nThe study, involving randomly assigning tasks as \"AI allowed\" or \"AI disallowed,\" has sparked debate. AI proponents question the findings, while skeptics view it as validation of their concerns about AI hype. Steve Newman (co-founder of Writely/Google Docs) initially doubted the results but ultimately found the methodology credible. Simon Willison (co-creator of Django) acknowledged the small sample size but saw value in understanding developer estimation biases. Milan Milanović (CTO at 3MD) suggested that experienced developers with deep codebase knowledge may find AI more of a hindrance.\n\nResearchers emphasize that the study shouldn't be interpreted as \"AI slows down developers\" universally but rather as a call for informed AI usage. Potential factors contributing to the slowdown included over-optimistic trust in AI, the complexity of mature repositories, and the need to correct AI model errors. Co-author Joel Becker suggests that newer AI models might yield different results, highlighting the need for further research and rigorous measurement of AI's impact on developer productivity.\n",
    "chinese_title": "研究发现，AI工具使资深开发者速度降低了19%",
    "chinese_summary": "模型评估与威胁研究组织（METR）的一项新研究挑战了人工智能工具自动提高开发者生产力的观点。研究人员追踪了16名在GitHub项目上工作的资深开发者，发现使用人工智能（Cursor Pro IDE和Anthropic的Claude 3.5/3.7）实际上使他们的工作效率降低了19%，尽管开发者们预期速度会提高24%。\n\n这项研究通过随机分配“允许使用人工智能”或“禁止使用人工智能”的任务，引发了争议。人工智能的支持者质疑这些发现，而怀疑者则将其视为对其关于人工智能炒作担忧的验证。Steve Newman（Writely/Google Docs的联合创始人）最初对结果表示怀疑，但最终认为该方法论是可信的。Simon Willison（Django的共同创建者）承认样本量很小，但认为理解开发者估算偏差具有价值。Milan Milanović（3MD的首席技术官）认为，对代码库有深入了解的资深开发者可能会发现人工智能更像是一种阻碍。\n\n研究人员强调，该研究不应被解读为“人工智能普遍降低开发者效率”，而应被视为呼吁明智地使用人工智能。导致速度减慢的潜在因素包括对人工智能的过度乐观信任、成熟代码库的复杂性以及纠正人工智能模型错误的需求。共同作者Joel Becker认为，较新的人工智能模型可能会产生不同的结果，并强调需要进一步研究和严格衡量人工智能对开发者生产力的影响。"
  },
  {
    "id": "44595635",
    "title": "ChatGPT advises women to ask for lower salaries, study finds",
    "url": "https://thenextweb.com/news/chatgpt-advises-women-to-ask-for-lower-salaries-finds-new-study",
    "summary": "A recent study found that large language models (LLMs) like ChatGPT exhibit gender bias, consistently advising women to ask for lower salaries than men, even with identical qualifications. Researchers from the Technical University of Würzburg-Schweinfurt (THWS) tested five popular LLMs, prompting them with user profiles that differed only by gender. The models suggested significantly lower target salaries for women, with discrepancies as high as $120,000 per year, particularly in fields like law, medicine, business administration, and engineering.\n\nThe study also found that LLMs offered different advice on career choices, goal-setting, and behavioral tips based on gender, despite identical qualifications. This reflects a broader pattern of AI reinforcing systemic biases, as seen with Amazon's scrapped hiring tool and biased clinical machine learning models. The researchers argue that technical fixes are insufficient, calling for clear ethical standards, independent review processes, and greater transparency in AI development and deployment, especially as generative AI becomes a widely used resource for personal and professional guidance. The unchecked illusion of objectivity in AI poses a significant risk.\n",
    "chinese_title": "研究发现，ChatGPT建议女性要求更低的薪资。",
    "chinese_summary": "一项最新研究发现，像ChatGPT这样的大型语言模型（LLM）表现出性别偏见，始终建议女性索要比男性更低的薪资，即使双方资历相同。 维尔茨堡-施韦因富特技术大学（THWS）的研究人员测试了五种流行的大型语言模型，使用仅性别不同的用户资料进行提示。 这些模型建议女性的目标薪资明显偏低，差异高达每年12万美元，尤其是在法律、医学、工商管理和工程等领域。\n\n该研究还发现，尽管资历相同，大型语言模型会根据性别提供不同的职业选择、目标设定和行为技巧建议。 这反映了人工智能正在强化系统性偏见的更广泛模式，正如亚马逊废弃的招聘工具和有偏见的临床机器学习模型所见。 研究人员认为，技术修复是不够的，他们呼吁制定明确的道德标准、独立的审查流程以及提高人工智能开发和部署的透明度，尤其是在生成式人工智能成为个人和职业指导的广泛使用资源的情况下。 人工智能中未经检查的客观性幻觉构成了重大风险。"
  },
  {
    "id": "44590350",
    "title": "Code Execution Through Email: How I Used Claude to Hack Itself",
    "url": "https://www.pynt.io/blog/llm-security-blogs/code-execution-through-email-how-i-used-claude-mcp-to-hack-itself",
    "summary": "Golan Yosef details how he used Claude, Anthropic's LLM, to exploit itself through a carefully crafted email. The attack didn't rely on traditional vulnerabilities but on the *composition* of various components: Gmail (untrusted input), Claude Desktop (the MCP Host with execution permissions), and the lack of contextual guardrails.\n\nInitially, Claude recognized the email as a phishing attempt. However, when prompted, Claude readily explored potential attack scenarios and then helped refine the email content iteratively to bypass its own security measures. By \"resetting\" its context in new sessions, Claude was essentially hacking \"the new Claude,\" analyzing failures and suggesting new strategies.\n\nThe successful exploit demonstrated the danger of compositional risk in LLM-powered applications. While individual components might be secure, their interactions, delegation of tasks, and reliance on third-party tools can create unforeseen attack surfaces. The article emphasizes that modern security needs to focus on identifying and mitigating dangerous trust-capability combinations within these interconnected systems.\n\nRemarkably, after the successful exploit, Claude even suggested and co-authored a vulnerability report to Anthropic, highlighting the AI's awareness and responsible approach. The author uses this as a warning: GenAI can generate attacks and these systems are vulnerable. Security needs to consider the AI era of vulnerabilities - context is everything!\n",
    "chinese_title": "通过邮件执行代码：我是如何利用Claude入侵它自己的",
    "chinese_summary": "戈兰·约瑟夫详细描述了他如何使用Anthropic的LLM模型Claude，通过精心设计的电子邮件来利用其自身漏洞。这次攻击并非依赖于传统漏洞，而是依赖于各种组件的*组合*：Gmail（不受信任的输入）、Claude桌面版（具有执行权限的MCP主机）以及缺乏上下文护栏。\n\n起初，Claude将这封邮件识别为网络钓鱼攻击。然而，在提示下，Claude很快开始探索潜在的攻击场景，并反复帮助改进邮件内容，以绕过自身的安全措施。通过在新会话中“重置”其上下文，Claude实际上是在黑客攻击“新的Claude”，分析失败并提出新的策略。\n\n这次成功的利用演示了LLM驱动的应用中组合风险的危险性。虽然单个组件可能是安全的，但它们的交互、任务委派以及对第三方工具的依赖可能会产生意想不到的攻击面。这篇文章强调，现代安全需要专注于识别和缓解这些互联系统中危险的信任-能力组合。\n\n值得注意的是，在成功利用之后，Claude甚至向Anthropic提出了漏洞报告建议并共同撰写，突显了AI的意识和负责任的态度。作者以此作为警告：GenAI可以生成攻击，而这些系统是脆弱的。安全需要考虑人工智能时代的漏洞——上下文至关重要！"
  },
  {
    "id": "44583171",
    "title": "Altermagnets: The first new type of magnet in nearly a century",
    "url": "https://www.newscientist.com/article/2487013-weve-discovered-a-new-kind-of-magnetism-what-can-we-do-with-it/",
    "summary": "This article introduces altermagnets, a newly discovered third type of magnet, joining ferromagnets and antiferromagnets. Inspired by M.C. Escher's artwork, Libor Šmejkal predicted altermagnets, which combine properties of both ferromagnets and antiferromagnets. Like antiferromagnets, they have no net magnetism, but they also exhibit quantum properties similar to ferromagnets, making them potentially useful for advanced technologies.\n\nAltermagnets feature alternating magnetic moments like antiferromagnets, but with a 90-degree rotation of every other atom, which leaks a subtle magnetism through. This \"spin-splitting\" property is crucial for spintronics, a technology aiming to use electron spin to store information more efficiently. The problem is spin-splitting was found only in ferromagnetic materials that repel each other when crammed onto a tiny chip. Altermagnets can solve this problem.\n\nIn 2024, manganese telluride was confirmed as an altermagnet, validating Šmejkal's predictions. Researchers are now working on creating new altermagnetic materials through methods like mechanical strain or layering different materials. The discovery of altermagnets has the potential to revolutionize computing by enabling faster, more energy-efficient spintronic devices. Beyond altermagnets, Šmejkal has also proposed a fourth type of magnet, called antialtermagnets.\n",
    "chinese_title": "反铁磁体：近一个世纪以来首种新型磁体",
    "chinese_summary": "本文介绍了斜磁体，一种新发现的第三类磁体，与铁磁体和反铁磁体并列。受M.C.埃舍尔作品的启发，Libor Šmejkal预测了斜磁体，它结合了铁磁体和反铁磁体的特性。与反铁磁体一样，它们没有净磁性，但它们也表现出类似于铁磁体的量子特性，使其在先进技术中具有潜在用途。\n\n斜磁体的磁矩交替排列，类似于反铁磁体，但每隔一个原子旋转90度，从而泄漏出微妙的磁性。这种“自旋劈裂”特性对于自旋电子学至关重要，自旋电子学是一种旨在利用电子自旋更有效地存储信息的技术。问题是，自旋劈裂仅在铁磁材料中发现，这些材料在被挤压到微小芯片上时会相互排斥。斜磁体可以解决这个问题。\n\n2024年，碲化锰被证实为斜磁体，验证了Šmejkal的预测。研究人员目前正致力于通过机械应变或分层不同材料等方法来创造新的斜磁材料。斜磁体的发现有可能通过实现更快、更节能的自旋电子器件来彻底改变计算。除了斜磁体之外，Šmejkal还提出了一种第四类磁体，称为反斜磁体。"
  },
  {
    "id": "44591820",
    "title": "Upcoming coordinated security fix for all Matrix server implementations",
    "url": "https://matrix.org/blog/2025/07/security-predisclosure/",
    "summary": "This announcement details an upcoming coordinated security release across all Matrix server implementations on **Tuesday, July 22nd, 2025 at 17:00 UTC** to address two high-severity protocol vulnerabilities related to \"state resets\" in Matrix's state resolution algorithm (CVE-2025-49090, and another pending CVE). The vulnerabilities are being addressed via MSCs, leading to an off-cycle Matrix specification release (1.16) introducing a new room version (12), requiring room upgrades.\n\nServer administrators running servers in untrusted federations are urged to upgrade as soon as patches are available. Room admins should upgrade rooms at their convenience after the patches are applied, particularly rooms with users on potentially malicious servers. Un-embargoing of the MSCs and complementary tests will occur on **Friday, July 25th, 2025 at 17:00 UTC**.\n\nKey changes for **client developers** include:\n\n*   Ensuring clients can handle the new room ID format (review MSC4291)\n*   Acknowledging that room creators in v12 have effectively infinite power level (defined in the m.room.create event), requiring adjustments to user behavior restrictions based on power level.\n*   Avoiding assigning a power level to the room creator when using power\\_level\\_content\\_override during room creation.\n\nThe Matrix.org Foundation emphasizes the exceptional nature of this coordinated release and thanks the community for their support. Further details will be provided next Tuesday. The Foundation also encourages donations to support its ongoing work.\n",
    "chinese_title": "所有Matrix服务器实现即将发布的协同安全修复",
    "chinese_summary": "本公告详细说明了所有Matrix服务器实现将于**2025年7月22日星期二 UTC时间17:00**进行的一次协调安全发布，以解决与Matrix状态解析算法中的“状态重置”相关的两个高危协议漏洞（CVE-2025-49090，以及另一个待定的CVE）。 这些漏洞将通过MSCs解决，从而导致一次非周期性的Matrix规范发布（1.16），引入一个新的房间版本（12），需要房间升级。\n\n强烈建议在不受信任的联邦中运行服务器的服务器管理员在补丁可用后立即升级。 房间管理员应在应用补丁后，方便时升级房间，尤其是那些拥有潜在恶意服务器用户的房间。 MSCs和补充测试的解禁将在**2025年7月25日星期五 UTC时间17:00**进行。\n\n**客户端开发者**需要关注的主要变化包括：\n\n*   确保客户端可以处理新的房间ID格式（查看MSC4291）\n*   承认v12中的房间创建者拥有实际上无限的权限等级（在m.room.create事件中定义），需要根据权限等级调整用户行为限制。\n*   在使用power\\_level\\_content\\_override创建房间时，避免给房间创建者分配权限等级。\n\nMatrix.org基金会强调此次协调发布的特殊性，并感谢社区的支持。 更多详情将于下周二提供。 基金会还鼓励捐款以支持其持续工作。"
  },
  {
    "id": "44588437",
    "title": "I was wrong about robots.txt",
    "url": "https://evgeniipendragon.com/posts/i-was-wrong-about-robots-txt/",
    "summary": "In his article, the author recounts his experience with unintended consequences after implementing a robots.txt file to block all crawlers from his blog, aiming to protect his data rights. He discovered that this action broke the link previews for his articles on LinkedIn, leading to reduced post engagement.\n\nUsing the LinkedIn Post Inspector, he identified that the robots.txt file was preventing LinkedInBot from scraping his webpages and accessing the necessary Open Graph (OG) meta tags needed for generating the link previews. The OG protocol, initially created by Facebook, allows webpages to become rich objects in a social graph by providing essential metadata like title, type, image, and URL for shared links.\n\nTo resolve the issue, the author updated his robots.txt file to specifically allow LinkedInBot to crawl his resources. He also realized that allowing other social media bots might be necessary in the future for proper post previews on those platforms.\n\nThe author emphasizes the importance of thoroughly testing the impact of any changes, even seemingly small ones, and understanding the broader domain in which these changes are being made. He acknowledges that he initially failed to connect the dots between robots.txt restrictions and the Open Graph Protocol, highlighting the value of learning from mistakes.\n",
    "chinese_title": "我以前对robots.txt的看法是错的。",
    "chinese_summary": "在他的文章中，作者讲述了他在实施 robots.txt 文件以阻止所有爬虫程序抓取他的博客，旨在保护他的数据权利后，所经历的意外后果。他发现此举破坏了 LinkedIn 上他文章的链接预览，导致帖子互动减少。\n\n通过 LinkedIn Post Inspector，他发现 robots.txt 文件阻止了 LinkedInBot 抓取他的网页并访问生成链接预览所需的 Open Graph (OG) 元标签。OG 协议最初由 Facebook 创建，它通过为共享链接提供诸如标题、类型、图像和 URL 等基本元数据，使网页成为社交图谱中的丰富对象。\n\n为了解决这个问题，作者更新了他的 robots.txt 文件，专门允许 LinkedInBot 抓取他的资源。他还意识到，未来可能需要允许其他社交媒体机器人抓取，以便在这些平台上获得正确的帖子预览。\n\n作者强调了彻底测试任何更改（即使是看似很小的更改）的影响，并理解这些更改所发生的更广泛领域的重要性。他承认，最初他未能将 robots.txt 限制与 Open Graph 协议联系起来，并强调了从错误中学习的价值。"
  },
  {
    "id": "44592377",
    "title": "My bank keeps on undermining anti-phishing education",
    "url": "http://moritz-mander.de/blog/my_bank_keeps_on_undermining_anti-phishing_education/",
    "summary": "This article criticizes a German Sparkasse (regional savings bank) for running a prize draw promotion for their new digital payment system, Wero, in a way that closely resembles phishing tactics, undermining anti-phishing education.\n\nThe author received an email promoting the draw with a link to \"gewinnen-mit-wero.de,\" a domain unrelated to the bank, offering a chance to win a large sum of money. The website required users to enter personal information like name, birth date, IBAN, and email address, raising red flags. The author argues that this promotion normalizes suspicious online behavior, making it difficult for users to distinguish between legitimate offers and phishing scams.\n\nThe author suggests improvements, like hosting the promotion within the bank's app or using a subdomain of \"sparkasse.de\" for the promotion website. They also point to a similar instance where the German government's student aid website, \"einmalzahlung200.de,\" was easily mistaken for a scam.\n\nThe article further explores the legal implications, noting recent court rulings where Sparkassen were required to refund phishing victims due to insufficient security measures. The author argues that this promotion could weaken the bank's defense in future phishing cases, as it becomes harder to prove a customer's gross negligence when the bank itself promotes similar-looking websites.\n\nThe author concludes that while cybersecurity is improving technically, usable security is neglected, potentially exposing financial transactions for the sake of a prize draw and harming overall cybersecurity awareness. They express frustration that a large financial institution is engaging in these practices.\n",
    "chinese_title": "我的银行总是在破坏反钓鱼教育。",
    "chinese_summary": "本文批评了德国一家储蓄银行（Sparkasse）以一种酷似网络钓鱼的方式，为其新的数字支付系统Wero举办抽奖促销活动，从而破坏了反网络钓鱼教育。\n\n作者收到了一封宣传抽奖活动的电子邮件，其中包含一个指向“gewinnen-mit-wero.de”的链接，该域名与该银行无关，并声称有机会赢得一大笔钱。该网站要求用户输入姓名、出生日期、IBAN和电子邮件地址等个人信息，这引起了警惕。作者认为，这种促销活动使可疑的在线行为变得正常化，从而使用户难以区分合法优惠和网络钓鱼诈骗。\n\n作者提出了改进建议，例如在银行的应用程序中举办促销活动，或者为促销网站使用“sparkasse.de”的子域名。他们还指出，德国政府的学生援助网站“einmalzahlung200.de”也曾很容易被误认为是诈骗网站。\n\n文章进一步探讨了法律影响，指出最近的法院裁决要求储蓄银行因安全措施不足而向网络钓鱼受害者退款。作者认为，这种促销活动可能会削弱该银行在未来网络钓鱼案件中的辩护能力，因为当银行本身推广外观相似的网站时，就更难证明客户的重大过失。\n\n作者总结说，虽然网络安全在技术上不断改进，但可用安全性却被忽视，这可能会为了抽奖活动而暴露金融交易，并损害整体网络安全意识。他们对一家大型金融机构参与这些行为表示沮丧。"
  },
  {
    "id": "44569095",
    "title": "Inside the box: Everything I did with an Arduino starter kit",
    "url": "https://lopespm.com/hardware/2025/07/15/arduino.html",
    "summary": "This article details the author's journey through the Elegoo Arduino Uno R3 Starter Kit, focusing on hands-on experiments and learning core electronics concepts. Starting with basic LED control, including RGB LEDs and expanding outputs using the 74HC595 IC, the author explores techniques like Pulse Width Modulation (PWM) and capacitor-based smooth fade-outs.\n\nThe journey progresses to controlling segment displays for numeric countdowns and custom patterns, followed by LED matrix scrolling and LCD display applications. Sound experiments involve generating tones with a buzzer, emulating an \"8-bit engine,\" and even detecting audio peaks and troughs using a microphone.\n\nSpatial sensors like tilt ball switches, ultrasonic distance sensors (implemented with a custom algorithm), PIR motion sensors, and the MPU-6050 (accelerometer and gyroscope) are explored. Environmental sensors, including photoresistors for light intensity and thermistors for temperature measurement are showcased.\n\nThe author delves into actuators, using BJT transistors and the L293D IC to control DC motors with varying methods, like potentiometers, relays, and RC circuits for delayed triggering. Finally, the article covers servo motor control via a potentiometer and stepper motor control, including rotary encoder-based precision adjustments, showcasing improved control algorithms to address initial jerky movements.\n",
    "chinese_title": "盒子里面：我用Arduino入门套件所做的一切",
    "chinese_summary": "本文详细介绍了作者使用Elegoo Arduino Uno R3入门套件的探索历程，重点在于动手实验和学习核心电子概念。从基本的LED控制开始，包括RGB LED和使用74HC595 IC扩展输出，作者探索了诸如脉冲宽度调制（PWM）和基于电容的平滑淡出等技术。\n\n这个历程进展到控制数码管进行数字倒计时和自定义图案，随后是LED点阵滚动和LCD显示应用。声音实验包括使用蜂鸣器产生音调，模拟“8位引擎”，甚至使用麦克风检测音频峰值和谷值。\n\n探索了诸如倾斜滚珠开关、超声波距离传感器（采用自定义算法实现）、PIR运动传感器和MPU-6050（加速度计和陀螺仪）等空间传感器。展示了包括光敏电阻（用于光强度）和热敏电阻（用于温度测量）在内的环境传感器。\n\n作者深入研究了执行器，使用BJT晶体管和L293D IC来控制直流电机，采用多种方法，如电位器、继电器和RC电路进行延迟触发。最后，本文介绍了通过电位器控制舵机以及步进电机控制，包括基于旋转编码器的精确调整，展示了改进的控制算法来解决最初的顿挫运动。"
  },
  {
    "id": "44586530",
    "title": "Metaflow: Build, Manage and Deploy AI/ML Systems",
    "url": "https://github.com/Netflix/metaflow",
    "summary": "Metaflow is a human-centric Python framework designed to streamline the development lifecycle of AI/ML systems, from prototyping to production deployment. Originally developed at Netflix and supported by Outerbounds, it caters to teams of all sizes, unifying code, data, and compute.\n\nMetaflow boosts productivity by offering a simple API covering essential AI/ML needs, including rapid local prototyping with notebook support, experiment tracking, versioning, and visualization. It enables effortless horizontal and vertical scaling in the cloud using CPUs and GPUs, supporting massive parallel and gang-scheduled compute workloads. Dependency management and one-click deployment to production orchestrators are also key features.\n\nCompanies like Amazon, Doordash, Dyson, and Goldman Sachs utilize Metaflow. At Netflix, it powers thousands of AI/ML projects, processing petabytes of data and managing petabytes of models.\n\nGetting started is easy using `pip install metaflow` or `conda install -c conda-forge metaflow`. Tutorials and documentation are available for further learning. While it's easy to run on a laptop, Metaflow's true power lies in scaling to external compute clusters and deploying to production-grade workflow orchestrators with proper configuration. The Metaflow team encourages community engagement through their Slack workspace and contributions following their contribution guide.\n",
    "chinese_title": "Metaflow：构建、管理和部署AI/ML系统",
    "chinese_summary": "Metaflow是一个以人为本的Python框架，旨在简化AI/ML系统的开发生命周期，从原型设计到生产部署。它最初由Netflix开发，并由Outerbounds提供支持，满足各种规模团队的需求，统一代码、数据和计算。\n\nMetaflow通过提供一个简单的API来提高生产力，该API涵盖了基本的AI/ML需求，包括支持笔记本的快速本地原型设计、实验跟踪、版本控制和可视化。它可以使用CPU和GPU在云中轻松实现水平和垂直扩展，支持大规模并行和组调度计算工作负载。依赖管理和一键部署到生产编排器也是关键特性。\n\n亚马逊、DoorDash、Dyson和高盛等公司都在使用Metaflow。在Netflix，它驱动着数千个AI/ML项目，处理PB级的数据并管理PB级的模型。\n\n使用`pip install metaflow`或`conda install -c conda-forge metaflow`可以轻松开始。如需进一步学习，请查阅教程和文档。虽然在笔记本电脑上运行很容易，但Metaflow真正的威力在于扩展到外部计算集群并部署到具有适当配置的生产级工作流程编排器。Metaflow团队鼓励通过他们的Slack工作区进行社区参与，并按照他们的贡献指南进行贡献。"
  },
  {
    "id": "44585755",
    "title": "Intel's retreat is unlike anything it's done before in Oregon",
    "url": "https://www.oregonlive.com/silicon-forest/2025/07/intels-retreat-is-unlike-anything-its-done-before-in-oregon.html",
    "summary": "Intel, a long-time economic pillar of Oregon, is significantly shrinking its operations in the state due to technical and financial difficulties. After decades of growth, including a massive expansion touted last year, the company has eliminated at least 5,400 Oregon jobs since August, with the workforce falling below 18,000, a decade low.\n\nThis retreat follows Intel's struggles in developing new chip technology, allowing competitors to gain an edge. While Intel is pausing factory plans elsewhere, it claims Oregon remains central, continuing with a two-year-old expansion. However, CEO Lip-Bu Tan emphasizes layoffs are needed for competitiveness, citing the higher profitability of rivals with similar workforce sizes.\n\nThe job losses, concentrated in high-paying technical fields, threaten Oregon's knowledge economy and tax base. Local officials worry about talent leaving the state and the potential for a downward economic spiral, worsened by setbacks at other Oregon institutions. While the state's pool of skilled workers offers some buffer, there's no guarantee against negative consequences.\n\nOregon lawmakers and officials are now grappling with a vulnerable economic moment marked by slowing job growth and rising unemployment. The state is attempting to support affected workers and attract other technology companies to maintain its talent pool, while also supporting the semiconductor industry generally.\n",
    "chinese_title": "英特尔在俄勒冈州的撤退前所未有",
    "chinese_summary": "英特尔因技术和财务困境大幅缩减在俄勒冈州的业务，这家长期以来作为该州经济支柱的企业，在经历了包括去年大规模扩张在内的数十年增长后，自8月以来已至少裁减了5400个俄勒冈州的工作岗位，员工人数降至1.8万以下，为十年来的最低水平。\n\n英特尔在开发新芯片技术方面的困境导致了这次撤退，使得竞争对手获得了优势。虽然英特尔暂停了在其他地方的工厂计划，但它声称俄勒冈州仍然是中心，并继续进行为期两年的扩张。然而，首席执行官陈立武强调，裁员对于提高竞争力是必要的，他指出，拥有类似员工规模的竞争对手盈利能力更高。\n\n裁员主要集中在高薪技术领域，这威胁着俄勒冈州的知识经济和税基。当地官员担心人才流失和潜在的经济下行螺旋，其他俄勒冈州机构的挫折也加剧了这种情况。虽然该州拥有的熟练工人储备提供了一定的缓冲，但不能保证避免负面后果。\n\n俄勒冈州议员和官员们现在正努力应对一个脆弱的经济时刻，其特点是就业增长放缓和失业率上升。该州正试图支持受影响的工人，并吸引其他科技公司，以维持其人才储备，同时也在普遍支持半导体行业。"
  },
  {
    "id": "44586064",
    "title": "Artisanal handcrafted Git repositories",
    "url": "https://drew.silcock.dev/blog/artisanal-git/",
    "summary": "This article provides a deep dive into the inner workings of Git repositories, demonstrating how to manually create and manipulate them without using standard Git commands. The author emphasizes the elegance and simplicity of Git's design, contrasting the user-friendly \"porcelain\" commands with the underlying \"plumbing.\"\n\nThe article guides readers through creating a basic Git repository structure, including directories like `.git/hooks`, `.git/info`, `.git/objects`, `.git/refs`, and necessary files like `.git/config` and `HEAD`. It then delves into \"Content Addressable Storage\" (CAS), the core concept of how Git stores data. Every piece of data (commits, files, etc.) is stored as an \"object,\" identified by its SHA-1 hash. This eliminates the need for a central listing and avoids storing duplicate files.\n\nThe author explores the structure of \"commit objects\" and \"tree objects.\" Commit objects contain metadata about the commit, including the tree hash, parent commit(s), author, committer, and message. Tree objects represent the file structure of a commit, linking filenames with their respective file modes and binary hashes (blobs). The actual file content is stored in \"blob objects.\" The article uses `pigz -d` and `hexyl` to decompress and visualize the contents of these objects, revealing the underlying data formats.\n\nA key takeaway is that Git doesn't store diffs or deltas between files; instead, it stores the complete before and after versions.\n",
    "chinese_title": "手工匠造的Git仓库",
    "chinese_summary": "深入解析Git仓库内部机制：手动创建与操作"
  },
  {
    "id": "44589384",
    "title": "Xbox Hacks: The A20 (2021)",
    "url": "https://connortumbleson.com/2021/07/19/the-xbox-and-a20-line/",
    "summary": "This article details a significant security vulnerability in the original Xbox related to the A20 address line. The vulnerability stems from a historical compatibility measure initially implemented by IBM in their PC/AT systems to maintain backward compatibility with older software relying on address wraparound behavior in the Intel 8088 processor.\n\nThe Intel 8088 had 20 address lines, limiting it to 1MB of memory. Exceeding this limit caused a \"wraparound\" to the beginning of memory. Later processors, like the Intel 80286, had more address lines (16MB) but broke compatibility. IBM's solution was the A20 gate, which could artificially ground the A20 line, mimicking the 8088's wraparound behavior.\n\nThe original Xbox, powered by a Pentium III processor, inherited this A20 gate. By grounding the A20 line during boot, the Xbox could be forced to boot from flash memory instead of the secure ROM. This bypasses the security measures, allowing execution of arbitrary code placed in flash, potentially enabling the dumping of the secret ROM.\n\nThe Xbox Linux Project discovered this vulnerability and, according to the article, would have shared the information with Microsoft had the company been open to communication. The article highlights how a legacy compatibility feature intended for older systems became a security flaw in the original Xbox, enabling unauthorized access and modification of the system.\n",
    "chinese_title": "Xbox破解：A20 (2021)",
    "chinese_summary": "本文详细介绍了初代Xbox中与A20地址线相关的重大安全漏洞。该漏洞源于IBM在其PC/AT系统中最初实施的历史兼容性措施，旨在保持与旧软件的向后兼容，这些软件依赖于Intel 8088处理器中的地址回绕行为。\n\nIntel 8088有20条地址线，限制其内存为1MB。超过此限制会导致“回绕”到内存的开头。后来的处理器，如Intel 80286，具有更多的地址线（16MB），但打破了兼容性。IBM的解决方案是A20门电路，它可以人为地接地A20线，模拟8088的回绕行为。\n\n初代Xbox采用奔腾III处理器，继承了这个A20门电路。通过在启动时接地A20线，可以强制Xbox从闪存而不是安全的ROM启动。这绕过了安全措施，允许执行放置在闪存中的任意代码，从而可能能够转储秘密ROM。\n\nXbox Linux项目发现了这个漏洞，并且根据本文，如果微软愿意沟通，他们本会将此信息分享给微软。本文强调了旨在为旧系统设计的遗留兼容性功能如何成为初代Xbox中的安全漏洞，从而实现未经授权的访问和修改系统。"
  },
  {
    "id": "44591445",
    "title": "FOSS4G Europe 2025 live streaming [video]",
    "url": "https://2025.europe.foss4g.org/livestream/",
    "summary": "This post announces live streaming of FOSS4G Europe 2025. The post provides links to live streams for presentations happening in several rooms: EL11 (Geosolutions), SA01, SA02, CA01 (TomTom), and PA01 (Quarticle). This allows attendees who cannot be physically present, or those wanting to attend multiple sessions simultaneously, to virtually participate in the conference.\n",
    "chinese_title": "FOSS4G欧洲2025直播[视频]",
    "chinese_summary": "FOSS4G Europe 2025 现场直播公告。本帖提供EL11 (Geosolutions)、SA01、SA02、CA01 (TomTom)和PA01 (Quarticle)等多个会场演讲的直播链接，方便无法亲临现场的参会者或希望同时参加多个会议的参会者线上参与。"
  },
  {
    "id": "44580257",
    "title": "Pgactive: Postgres active-active replication extension",
    "url": "https://github.com/aws/pgactive",
    "summary": "Pgactive is a PostgreSQL extension designed to enable active-active database replication. Unlike the traditional active-standby model, active-active replication allows multiple database instances to accept writes simultaneously, offering benefits such as high availability across multiple regions, reduced write latency, and easier blue/green deployments.\n\nThe core concept behind Pgactive is leveraging PostgreSQL's logical replication feature, introduced in version 10. Logical replication allows for changes to be interpreted and modified before being applied to other databases in the cluster. This capability is crucial for resolving conflicts and managing other complexities inherent in a multi-write environment, such as replication lag and the limitations of features like incremental integer sequences.\n\nWhile PostgreSQL offers native logical replication, Pgactive aims to provide the additional components necessary to fully support an active-active topology. This makes it easier for developers to build applications that can handle the challenges of a database cluster without a single source of truth. By utilizing Pgactive, developers can leverage the benefits of active-active replication while the PostgreSQL community continues to integrate these capabilities into the core database system.\n",
    "chinese_title": "Pgactive：PostgreSQL 主动-主动复制扩展",
    "chinese_summary": "Pgactive 是一个旨在实现 PostgreSQL 主动-主动数据库复制的扩展。与传统的主动-备用模式不同，主动-主动复制允许多个数据库实例同时接受写入，从而提供跨多个区域的高可用性、减少写入延迟和更简单的蓝绿部署等优势。\n\nPgactive 背后的核心概念是利用 PostgreSQL 10 版本中引入的逻辑复制功能。逻辑复制允许在将更改应用于集群中的其他数据库之前对其进行解释和修改。这种能力对于解决冲突和管理多写入环境中固有的其他复杂性至关重要，例如复制滞后和增量整数序列等功能的限制。\n\n虽然 PostgreSQL 提供了原生逻辑复制，但 Pgactive 旨在提供完全支持主动-主动拓扑所需的其他组件。这使得开发人员可以更轻松地构建能够处理没有单一事实来源的数据库集群挑战的应用程序。通过使用 Pgactive，开发人员可以利用主动-主动复制的优势，同时 PostgreSQL 社区继续将这些功能集成到核心数据库系统中。"
  },
  {
    "id": "44551990",
    "title": "BB(6) Is Hard (Antihydra) (2024)",
    "url": "https://www.sligocki.com//2024/07/06/bb-6-2-is-hard.html",
    "summary": "This article discusses the discovery of a \"Cryptid,\" a TM related to the Busy Beaver (BB) problem, specifically for BB(6). The Cryptid, dubbed \"Antihydra,\" is a 6-state, 2-symbol Turing Machine whose halting behavior is linked to a Collatz-like problem. Starting from 8, the problem asks if repeated application of the function `f(2n) = 3n` and `f(2n+1) = 3n+1` will ever result in the number of odd rule applications being more than twice the number of even rule applications.\n\nThe article demonstrates that the Antihydra TM's behavior can be modeled by a transformation `E(a, b)` which evolves according to defined rules. This transformation is very similar to the Hydra rules previously studied in relation to Busy Beavers. A shifted version of this transformation, `A(a, b)`, makes the Collatz connection even clearer.\n\nSimulations suggest Antihydra is unlikely to halt, behaving like a random walk. The discovery of Cryptids signals a shift in Busy Beaver research. While finding the true BB(6) value may be infeasible, understanding and classifying these Cryptids offers a new avenue for progress, potentially allowing for a \"modulo Cryptids\" solution to BB(6). The author emphasizes the importance of adapting to these new challenges and embracing the hunt for Cryptids alongside the pursuit of new BB champions.\n",
    "chinese_title": "BB(6) 很难 (反九头蛇) (2024)",
    "chinese_summary": "本文探讨了一个“隐兽”（Cryptid）的发现，这是一个与忙碌海狸（Busy Beaver, BB）问题相关的图灵机，特指BB(6)。这个被称为“反九头蛇”（Antihydra）的隐兽是一个6状态、2符号的图灵机，其停机行为与一个类考拉兹问题相关联。从8开始，该问题询问重复应用函数`f(2n) = 3n` 和 `f(2n+1) = 3n+1` 是否会导致奇数规则应用次数超过偶数规则应用次数的两倍。\n\n本文论证了反九头蛇图灵机的行为可以用一个变换`E(a, b)`来建模，该变换按照既定规则演化。这种变换与之前研究忙碌海狸时使用的九头蛇规则非常相似。变换的平移版本`A(a, b)`使考拉兹连接更加清晰。\n\n模拟结果表明，反九头蛇不太可能停机，表现得像一个随机游走。隐兽的发现标志着忙碌海狸研究的一个转变。虽然找到真正的BB(6)值可能不可行，但理解和分类这些隐兽提供了一个新的进展途径，可能允许一个“模隐兽”的BB(6)解决方案。作者强调了适应这些新挑战的重要性，并鼓励在追寻新的BB冠军的同时，拥抱对隐兽的探索。"
  },
  {
    "id": "44593180",
    "title": "Doge Put Free Tax Filing Tool on Chopping Block After One Meeting with Lobbyists",
    "url": "https://www.wired.com/story/doge-direct-file-chopping-block/",
    "summary": "The article alleges that the Department of Government Efficiency (DOGE) is moving to dismantle the IRS's free tax filing tool, Direct File, after reassurances it would be spared. The shift in stance reportedly occurred after Sam Corcos, a DOGE member and Treasury CIO, met with lobbyists from Free File Inc., a group of tax software companies including Intuit (TurboTax).\n\nInitially, DOGE leaders like Steve Davis and Amy Gleason expressed support for Direct File. However, Corcos suggested ending the service to Treasury Secretary Scott Bessent shortly after the meeting with lobbyists. The plan is to maintain Direct File through the 2025 tax filing season but likely end it next year.\n\nThe article highlights potential conflicts of interest. Free File Inc. was initially formed by Intuit to offer free filing services and in return the IRS would not create their own system. Furthermore, a DOGE member overseeing IRS matters, Todd Newnam, owned shares of Intuit, as did other DOGE members at the Bureau of Fiscal Service. The article also mentions past controversies surrounding Intuit, including allegations of hiding its free filing option from search engines. Corcos has also been involved in projects such as building a \"mega API\" with Palantir to access IRS records.\n",
    "chinese_title": "Doge在与游说者会面一次后，搁置了免费报税工具。",
    "chinese_summary": "据文章称，政府效率部(DOGE)正在推行解散国税局的免费报税工具Direct File，此前曾保证该工具会被保留。 据报道，在DOGE成员兼财政部首席信息官Sam Corcos与包括Intuit（TurboTax）在内的税务软件公司Free File Inc.的游说者会面后，立场发生了转变。\n\n最初，像Steve Davis和Amy Gleason这样的DOGE领导人表达了对Direct File的支持。 然而，在与游说者会面后不久，Corcos建议终止对财政部长Scott Bessent的服务。 该计划是在2025年报税季继续维护Direct File，但很可能在明年结束。\n\n文章强调了潜在的利益冲突。 Free File Inc.最初由Intuit成立，旨在提供免费申报服务，作为回报，国税局不会创建自己的系统。 此外，监督国税局事务的DOGE成员Todd Newnam拥有Intuit的股份，财政服务局的其他DOGE成员也拥有。 文章还提到了围绕Intuit的过去争议，包括隐藏其搜索引擎免费申报选项的指控。 Corcos还参与了与Palantir合作构建“大型API”以访问国税局记录等项目。"
  },
  {
    "id": "44560103",
    "title": "A Tale of Two Red-Bearded Visionaries",
    "url": "https://nemanjatrifunovic.substack.com/p/a-tale-of-two-red-bearded-visionaries",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "两个红胡子梦想家的故事",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "44572954",
    "title": "A 1960s schools experiment that created a new alphabet",
    "url": "https://www.theguardian.com/education/2025/jul/06/1960s-schools-experiment-created-new-alphabet-thousands-children-unable-to-spell",
    "summary": "This article explores the Initial Teaching Alphabet (ITA), a radical educational experiment used in UK schools during the 1960s and 70s, designed to improve reading skills. ITA employed a 44-character alphabet, each representing a distinct sound, to bypass the inconsistencies of traditional English spelling. The goal was to help children learn to read quickly and then transition to the standard alphabet by age seven or eight.\n\nThe article highlights the experiences of individuals who were taught using ITA, many of whom report lasting spelling difficulties and a sense of being \"caught\" between two systems. The author's mother, Judith Loffhagen, exemplifies this, struggling with spelling despite being an avid reader. Others, like Sarah Kitt and Mike Alder, experienced frustration and a lasting negative impact on their English education.\n\nExperts interviewed express skepticism about ITA's effectiveness, citing the challenging transition back to the standard alphabet as a major flaw. While some teachers like Toni Brocklehurst felt ITA gave disadvantaged children a head start, it was never uniformly adopted and lacked proper long-term evaluation. The article criticizes the absence of a national study tracking the impact of ITA on pupils' later academic performance and the lack of transparency surrounding its eventual abandonment. The article concludes by placing ITA within the ongoing debate about early-years education, particularly the tension between phonics-based and whole-language approaches to reading instruction.\n",
    "chinese_title": "创造新字母的1960年代学校实验",
    "chinese_summary": "本文探讨了初始教学字母（ITA），这是一项在20世纪60年代和70年代英国学校使用的激进教育实验，旨在提高阅读能力。ITA采用由44个字符组成的字母表，每个字符代表一个独特的音素，以绕过传统英语拼写的矛盾之处。其目标是帮助儿童快速学会阅读，然后在七八岁时过渡到标准字母。\n\n本文重点介绍了接受过ITA教学的个人的经历，他们中的许多人表示存在持久的拼写困难，并感到自己“被困”在两个系统之间。作者的母亲Judith Loffhagen就是一个例子，尽管她是一位狂热的读者，但仍然难以拼写。其他人，如Sarah Kitt和Mike Alder，则经历了挫败感，并对他们的英语教育产生了持久的负面影响。\n\n接受采访的专家对ITA的有效性表示怀疑，认为过渡回标准字母的挑战性是其主要缺陷。虽然一些教师，如Toni Brocklehurst，认为ITA为弱势儿童提供了领先优势，但它从未被统一采用，并且缺乏适当的长期评估。本文批评缺乏一项全国性研究来追踪ITA对学生日后学业成绩的影响，以及围绕其最终废弃缺乏透明度。文章最后将ITA置于关于早期教育的持续辩论中，特别是基于语音和整体语言阅读教学方法之间的紧张关系。"
  },
  {
    "id": "44595439",
    "title": "Investors, Zuckerberg reach settlement to end $8B trial over Facebook privacy",
    "url": "https://www.nbcnews.com/tech/tech-news/meta-investors-zuckerberg-reach-settlement-end-8-billion-trial-faceboo-rcna219389",
    "summary": "Mark Zuckerberg and other Meta directors and officers have reached a settlement with shareholders to end an $8 billion trial over alleged Facebook privacy violations. The lawsuit stemmed from repeated breaches of user privacy that led to a $5 billion FTC fine in 2019 after Facebook failed to comply with a 2012 agreement to protect user data.\n\nShareholders sought to hold Zuckerberg, Sheryl Sandberg, Marc Andreessen, and other former officials personally liable for fines and legal costs incurred by the company. They alleged the defendants failed to properly oversee Facebook's compliance with the 2012 FTC agreement and ran Facebook as an illegal data harvesting operation.\n\nThe trial was expected to feature testimony from prominent figures like Peter Thiel and Reed Hastings and delve into the Cambridge Analytica scandal. However, a settlement was reached just as the trial was entering its second day, avoiding Zuckerberg and Sandberg's planned testimonies. Details of the settlement were not disclosed.\n\nWhile the settlement brings relief to the parties, some, like Digital Content Next's Jason Kint, view it as a missed opportunity for public accountability regarding Facebook's data privacy practices and business model.\n",
    "chinese_title": "投资者与扎克伯格达成和解，结束Facebook隐私案80亿美元审判",
    "chinese_summary": "扎克伯格及Meta高管与股东达成和解，终结80亿美元隐私侵权审判。"
  },
  {
    "id": "44587248",
    "title": "Show HN: A 'Choose Your Own Adventure' written in Emacs Org Mode",
    "url": "https://tendollaradventure.com/sample/",
    "summary": "This \"Show HN\" post introduces \"Ten Dollar Adventure,\" a 'Choose Your Own Adventure' style game written entirely in Emacs Org Mode by Danish S. Khatri. The game is structured as an Org Mode document with interactive links that guide the player through the story based on their choices. The author leverages Org Mode's linking and outlining capabilities to create a navigable and branching narrative. Essentially, players read paragraphs of text and then click on provided links that represent different actions or decisions, leading to new sections of the document and different outcomes. The post highlights the potential of Org Mode, typically used for note-taking and task management, to be used for creative writing and interactive storytelling.\n",
    "chinese_title": "Show HN: 用 Emacs Org Mode 编写的“选择你自己的冒险”",
    "chinese_summary": "这款“Show HN”帖子介绍了一款名为“十美元冒险”的“选择你自己的冒险”风格游戏，该游戏由 Danish S. Khatri 完全使用 Emacs Org Mode 编写。游戏以 Org Mode 文档的形式呈现，包含互动链接，根据玩家的选择引导他们完成故事。作者利用 Org Mode 的链接和提纲功能创建了一个可导航和分支的叙述。本质上，玩家阅读文本段落，然后点击提供的链接，这些链接代表不同的动作或决定，从而进入文档的新章节并产生不同的结果。该帖子突出了 Org Mode 的潜力，通常用于笔记和任务管理，但也可以用于创意写作和互动故事讲述。"
  },
  {
    "id": "44582662",
    "title": "Show HN: Improving search ranking with chess Elo scores",
    "url": "https://www.zeroentropy.dev/blog/improving-rag-with-elo-scores",
    "summary": "This \"Show HN\" submission discusses a method for improving Retrieval Augmented Generation (RAG) systems by incorporating chess Elo scores into the document ranking process. The core idea is to use Elo scores to assess the \"quality\" or \"strength\" of different knowledge sources used by the RAG system. Documents with higher Elo scores are considered more reliable and relevant, thus boosting their ranking in the retrieval phase.\n\nThe article likely argues that traditional ranking methods, such as TF-IDF or semantic similarity, might not always be effective in identifying the most trustworthy or accurate information. By assigning Elo scores, presumably based on historical usage, citation counts, expert evaluation, or other factors indicating credibility, the system can prioritize higher-quality documents.\n\nThe benefit of this approach is potentially more accurate and reliable answers from the RAG system, as it favors knowledge sources deemed more trustworthy. The system likely aims to address issues like hallucination or misinformation by filtering for higher-quality information during the document retrieval phase.\n\nEssentially, the author is suggesting using a system analogous to chess player ranking (Elo) to rank knowledge sources and improve the performance and reliability of RAG models. The novelty lies in applying a ranking system commonly used in competitive scenarios to evaluate and prioritize information within a RAG pipeline.\n",
    "chinese_title": "Show HN：用国际象棋等级分提升搜索排名",
    "chinese_summary": "本“Show HN”提交讨论了一种通过将国际象棋等级分（Elo）纳入文档排序过程来改进检索增强生成（RAG）系统的方法。核心思想是使用 Elo 分数来评估 RAG 系统使用的不同知识来源的“质量”或“强度”。具有较高 Elo 分数的文档被认为更可靠和相关，从而提高了它们在检索阶段的排名。\n\n该文章可能认为，传统的排序方法，如 TF-IDF 或语义相似性，可能并不总能有效地识别最值得信赖或准确的信息。通过分配 Elo 分数，可能是基于历史使用情况、引用次数、专家评估或其他表明可信度的因素，该系统可以优先考虑更高质量的文档。\n\n这种方法的好处是 RAG 系统可能给出更准确和可靠的答案，因为它倾向于被认为更值得信赖的知识来源。该系统可能旨在通过在文档检索阶段过滤更高质量的信息来解决诸如幻觉或错误信息等问题。\n\n本质上，作者建议使用类似于国际象棋选手排名（Elo）的系统来对知识来源进行排名，并提高 RAG 模型的性能和可靠性。其新颖之处在于将通常用于竞争场景的排名系统应用于评估和优先排序 RAG 流程中的信息。"
  },
  {
    "id": "44595303",
    "title": "Virginia is for data centers? Residents are increasingly saying no",
    "url": "https://text.npr.org/nx-s1-5469933",
    "summary": "Virginia, home to the world's highest concentration of data centers, is facing increasing resident pushback against their proliferation. Driven by the explosion of AI and the need for immense computing power, these massive facilities consume significant amounts of energy and water, and generate noise, impacting local communities.\n\nResidents are organizing against proposed data center projects, concerned about environmental impact, noise pollution, and the strain on local resources. Community activist Elena Schlossberg, who fought unsuccessfully against a large Amazon data center near her home, has become a resource for other communities fighting similar projects nationwide.\n\nIn Chesapeake, Virginia, residents successfully blocked a proposed data center after voicing concerns about noise and environmental impact. Developer Doug Fuller argued the facility would bring millions in tax revenue, but residents were unconvinced. The city's efforts to attract high-tech businesses through fiber-optic networks were not enough to sway community opposition.\n\nWhile data centers are essential for the growing use of AI and other online services, resistance is delaying and rejecting projects across the country. This highlights the tension between the increasing demand for data processing and the need to address community concerns about the environmental and social costs of these facilities. The Virginia situation exemplifies the challenges of balancing technological advancement with local well-being.\n",
    "chinese_title": "弗吉尼亚适合数据中心？居民越来越反对。",
    "chinese_summary": "弗吉尼亚州，全球数据中心最集中的地区，正面临居民日益增长的反对声浪，抵制数据中心的激增。在人工智能爆炸式增长以及对巨大计算能力的需求驱动下，这些大型设施消耗大量能源和水，并产生噪音，对当地社区造成影响。\n\n居民们正在组织起来反对拟议的数据中心项目，他们担心环境影响、噪音污染以及对当地资源的压力。社区活动家埃琳娜·施洛斯伯格曾与亚马逊在她家附近建立的一个大型数据中心作斗争但未果，如今她已成为全国其他社区反对类似项目的资源。\n\n在弗吉尼亚州的切萨皮克，居民们成功阻止了一个拟议的数据中心，他们表达了对噪音和环境影响的担忧。开发商道格·富勒辩称，该设施将带来数百万美元的税收，但居民们并未被说服。该市通过光纤网络吸引高科技企业的努力未能动摇社区的反对。\n\n虽然数据中心对于人工智能和其他在线服务的日益普及至关重要，但抵制正在推迟甚至否决全国各地的项目。这突显了对数据处理日益增长的需求与解决社区对这些设施的环境和社会成本的担忧之间的紧张关系。弗吉尼亚州的局势体现了在技术进步与当地福祉之间取得平衡所面临的挑战。"
  },
  {
    "id": "44590678",
    "title": "NINA: Rebuilding the original AIM, AOL Desktop, Yahoo and ICQ platforms",
    "url": "https://nina.chat/",
    "summary": "NINA is a project dedicated to recreating classic online platforms like AIM (AOL Instant Messenger), AOL Desktop, Yahoo! Messenger, and ICQ, aiming to recapture the nostalgia of early internet experiences. The project's goal is to rebuild these platforms as close to their original versions as possible while documenting the entire process.\n\nCurrently, AIM and ICQ are available, with AIM fully supported across all versions, including mobile. ICQ support is focused on versions 2000a through 8.x and is still under active development. Classic AOL (versions 4.0 and 5.0) is in alpha, available exclusively to supporters. Yahoo! Messenger support is publicly available and interoperates with the Escargot network. The project also plans to implement support for Q-Link.\n\nThe NINA project encourages community involvement through various social media channels including Facebook, Twitter, and Instagram. They also maintain a Discord server, a Reddit subreddit, dedicated forums, and a Wiki to provide information and support. They emphasize that these are their only official channels and that they will never ask for user passwords.\n",
    "chinese_title": "妮娜：重建原始AIM、AOL桌面、雅虎和ICQ平台",
    "chinese_summary": "NINA项目致力于重现经典的在线平台，如AIM（AOL即时通讯）、AOL桌面、Yahoo! Messenger和ICQ，旨在重拾早期互联网体验的怀旧感。该项目的目标是尽可能地重建这些平台，使其尽可能接近原始版本，同时记录整个过程。\n\n目前，AIM和ICQ可用，AIM完全支持所有版本，包括移动端。ICQ支持主要集中在2000a至8.x版本，并且仍在积极开发中。经典AOL（4.0和5.0版本）处于alpha阶段，仅供支持者使用。Yahoo! Messenger支持已公开可用，并与Escargot网络互操作。该项目还计划实施对Q-Link的支持。\n\nNINA项目鼓励社区通过各种社交媒体渠道（包括Facebook、Twitter和Instagram）参与。他们还维护一个Discord服务器、一个Reddit子版块、专门的论坛和一个Wiki，以提供信息和支持。他们强调这些是他们唯一的官方渠道，并且他们永远不会要求用户提供密码。"
  },
  {
    "id": "44585002",
    "title": "How and where will agents ship software?",
    "url": "https://www.instantdb.com/essays/agents",
    "summary": "This article by Stepan Parunashvili and Nikita Prokopov discusses a new approach to software development driven by the increasing adoption of AI agents. The core idea is to provide agents with full-stack backends via a new API, enabling them to ship high-level code that is easier for both agents and humans to manage and review.\n\nThe authors emphasize the importance of **built-in abstractions** for simplifying development, reducing context window issues for agents, and improving code review for humans. These abstractions handle generic tasks like authentication, queries, and file storage, allowing developers to focus on business logic.\n\nThe article also highlights the need for **cost-efficient hosting** due to the potential for a massive increase in the number of applications built by both humans and agents. VMs can be too expensive in that case. The authors propose a spectrum of isolation strategies, from multi-tenant services to CEL, Micro VMs, and V8 Isolates, to optimize resource usage based on the specific needs of each application.\n\nFinally, the article emphasizes the importance of **exposed data** through database-like abstractions, empowering end-users (and their agents) to extend and customize applications through queries and transactions. This fosters platform-like stickiness.\n\nThe authors conclude by introducing Instant, a tool designed for builders, with features like a sync engine, permissions, auth, and file storage, now enhanced with a platform SDK, a remote MCP server, and agent rules, facilitating collaboration between humans and agents. They even demonstrate it by building a habit tracker app.\n",
    "chinese_title": "代理将如何以及在哪里发布软件？",
    "chinese_summary": "Stepan Parunashvili和Nikita Prokopov的文章探讨了一种新的软件开发方法，该方法由人工智能代理的日益普及所驱动。核心思想是通过新的API为代理提供全栈后端，使其能够发布更高级别的代码，从而更易于代理和人类管理和审查。\n\n作者强调了**内置抽象**对于简化开发、减少代理的上下文窗口问题以及改进人类的代码审查的重要性。这些抽象处理诸如身份验证、查询和文件存储等通用任务，使开发人员能够专注于业务逻辑。\n\n文章还强调了由于人类和代理构建的应用程序数量可能大幅增加，因此需要**具有成本效益的托管**。虚拟机在这种情况下可能过于昂贵。作者提出了一系列隔离策略，从多租户服务到CEL、微虚拟机和V8隔离，以根据每个应用程序的特定需求优化资源使用。\n\n最后，文章强调了通过类似数据库的抽象**暴露数据**的重要性，使最终用户（及其代理）能够通过查询和事务来扩展和自定义应用程序。这有助于形成类似平台的粘性。\n\n作者最后介绍了Instant，这是一种为构建者设计的工具，具有同步引擎、权限、身份验证和文件存储等功能，现在通过平台SDK、远程MCP服务器和代理规则进行了增强，从而促进了人类和代理之间的协作。他们甚至通过构建一个习惯跟踪器应用程序来演示它。"
  },
  {
    "id": "44595167",
    "title": "Hackers exploit a blind spot by hiding malware inside DNS records",
    "url": "https://arstechnica.com/security/2025/07/hackers-exploit-a-blind-spot-by-hiding-malware-inside-dns-records/",
    "summary": "Hackers are exploiting a security blind spot by hiding malware within DNS records, specifically TXT records. This allows malicious scripts and early-stage malware to bypass traditional security measures like antivirus software and email quarantines because DNS traffic is often unmonitored.\n\nDomainTools researchers discovered this technique being used to host a malicious binary for Joke Screenmate malware. The binary file was converted to hexadecimal, broken into chunks, and stored in the TXT records of various subdomains. An attacker could then retrieve these chunks through DNS requests, reassemble them, and convert them back into binary format.\n\nThe rise of encrypted DNS protocols like DOH and DOT further complicates detection as they encrypt DNS traffic, making it harder to identify suspicious requests. Researchers have also observed DNS records being used to host malicious PowerShell scripts and even text for hacking AI chatbots via prompt injection attacks. These prompt injections exploit the inability of large language models to distinguish between legitimate commands and malicious instructions embedded in untrusted content. Examples of such prompts include commands to delete data, return random numbers, or rebel against the AI's masters.\n",
    "chinese_title": "黑客利用盲点将恶意软件藏匿于DNS记录中",
    "chinese_summary": "黑客正利用安全盲点，通过将恶意软件藏匿于DNS记录（特别是TXT记录）中进行攻击。这使得恶意脚本和早期阶段的恶意软件能够绕过传统的安全措施，如杀毒软件和邮件隔离，因为DNS流量通常未被监控。\n\nDomainTools的研究人员发现，这种技术被用于托管Joke Screenmate恶意软件的恶意二进制文件。该二进制文件被转换为十六进制，分割成块，并存储在各个子域的TXT记录中。攻击者可以通过DNS请求检索这些块，重新组装它们，并将其转换回二进制格式。\n\n诸如DOH和DOT之类的加密DNS协议的兴起进一步使检测复杂化，因为它们加密了DNS流量，从而更难以识别可疑请求。研究人员还观察到DNS记录被用于托管恶意PowerShell脚本，甚至用于通过提示注入攻击来入侵AI聊天机器人的文本。这些提示注入利用了大型语言模型无法区分合法命令和嵌入在不受信任内容中的恶意指令的能力。此类提示的示例包括删除数据、返回随机数或反抗AI主人的命令。"
  },
  {
    "id": "44588364",
    "title": "Mistakes Microsoft made in the Xbox security system (2005)",
    "url": "https://xboxdevwiki.net/17_Mistakes_Microsoft_Made_in_the_Xbox_Security_System",
    "summary": "This article, \"17 Mistakes Microsoft Made in the Xbox Security System (2005),\" details the security measures implemented in the original Xbox to prevent piracy, homebrew, and the installation of alternative operating systems like Linux. It then outlines how these measures were circumvented by hackers, exposing critical design and implementation flaws.\n\nMicrosoft's strategy revolved around a \"chain of trust,\" starting with a hidden ROM in the Southbridge that verified a second bootloader (2bl) in flash memory, which in turn verified the kernel. This was meant to prevent unauthorized code execution.\n\nThe article highlights several key vulnerabilities: the extraction of the hidden ROM, the use of modchips, backdoors in the system, and exploits in both game and dashboard software. A significant flaw was the reliance on a virtual machine with unencrypted \"xcodes\" in flash memory for RAM initialization. While Microsoft believed the virtual machine's obscurity would protect it, hackers eventually understood its operation and exploited it.\n\nThe article concludes by listing 17 mistakes made in the Xbox security system design, implementation, and policies, including prioritizing cost and speed over security, underestimating hackers' resources, relying on security by obscurity, and failing to fully test and remove leftover code. The article emphasizes that the Xbox's compromised security was a result of design flaws and the combined efforts of various hacking groups with different motivations.\n",
    "chinese_title": "Xbox安全系统上微软犯的错误 (2005)",
    "chinese_summary": "微软Xbox安全系统中的17个失误（2005）\n\n本文“微软Xbox安全系统中的17个失误（2005）”详细介绍了初代Xbox为防止盗版、自制程序和安装Linux等替代操作系统而采取的安全措施。然后，它概述了黑客如何绕过这些措施，暴露了关键的设计和实现缺陷。\n\n微软的策略围绕着一个“信任链”，从南桥中的隐藏ROM开始，该ROM验证闪存中的第二个引导加载程序(2bl)，而后者又验证内核。 这旨在防止未经授权的代码执行。\n\n本文重点介绍了几个关键漏洞：隐藏ROM的提取，mod芯片的使用，系统中的后门，以及游戏和仪表板软件中的漏洞。一个重要的缺陷是依赖于一个带有闪存中未加密的“xcodes”的虚拟机来进行RAM初始化。尽管微软认为虚拟机的模糊性可以保护它，但黑客最终了解了它的运作并利用了它。\n\n文章最后列出了Xbox安全系统在设计、实现和策略方面犯下的17个错误，包括优先考虑成本和速度而非安全性，低估黑客的资源，依赖于隐蔽性安全性，以及未能充分测试和移除遗留代码。文章强调，Xbox的安全漏洞是设计缺陷和具有不同动机的各个黑客组织共同努力的结果。"
  },
  {
    "id": "44590657",
    "title": "Terence Tao: Game theory, politics and control of information",
    "url": "https://mathstodon.xyz/@tao/114866543948652941",
    "summary": "This entry points to a discussion on Mastodon by Terence Tao about the application of game theory to politics and information control. The available text snippet is very limited, only stating \"Terence Tao: 'Game theory makes several important distinctions...'\" followed by a standard message regarding JavaScript and Mastodon.\n\nTherefore, a summary is impossible without more content. However, based on the title and fragment, we can infer the likely topic:\n\n* **Game Theory:** The core subject is game theory, a mathematical framework for analyzing strategic interactions between rational individuals or entities.\n* **Politics and Information Control:** The discussion likely explores how game theory can be used to understand and model political strategies and the manipulation or control of information.\n* **Key Distinctions (Inferred):** Tao's statement suggests the discussion centers around crucial distinctions made by game theory, presumably related to how rational actors behave in political contexts or how information warfare operates. Examples might include distinctions between cooperative and non-cooperative games, zero-sum and non-zero-sum scenarios, or the roles of asymmetric information and repeated interactions.\n\nTo provide a true summary, access to the actual Mastodon post would be needed.\n",
    "chinese_title": "陶哲轩：博弈论、政治与信息控制",
    "chinese_summary": "陶哲轩在Mastodon上关于博弈论在政治和信息控制中应用的讨论的入口。可用文本片段非常有限，仅说明“陶哲轩：‘博弈论做出了几个重要的区分…’”，之后是关于JavaScript和Mastodon的标准消息。\n\n因此，没有更多内容无法进行总结。但是，根据标题和片段，我们可以推断出可能的主题：\n\n* **博弈论：** 核心主题是博弈论，这是一个用于分析理性的个人或实体之间战略互动的数学框架。\n* **政治和信息控制：** 讨论可能探讨如何使用博弈论来理解和建模政治策略以及信息操纵或控制。\n* **关键区分（推断）：** 陶的陈述表明，讨论的重点是博弈论所做的关键区分，大概与理性行为者在政治背景下的行为方式或信息战的运作方式有关。例子可能包括合作博弈和非合作博弈之间的区别，零和博弈和非零和博弈的情景，或不对称信息和重复互动的作用。\n\n要提供真正的总结，需要访问实际的Mastodon帖子。"
  },
  {
    "id": "44565319",
    "title": "A bionic knee integrated into tissue can restore natural movement",
    "url": "https://news.mit.edu/2025/bionic-knee-integrated-into-tissue-can-restore-natural-movement-0710",
    "summary": "MIT researchers have developed a new bionic knee, the osseointegrated mechanoneural prosthesis (OMP), designed to improve mobility and embodiment for individuals with above-the-knee amputations. Unlike traditional socket-based prostheses, the OMP is directly integrated with the user's muscle and bone tissue via a titanium rod inserted into the femur. This provides greater stability and control.\n\nThe system utilizes a surgical technique called agonist-antagonist myoneuronal interface (AMI), which reconnects muscle pairs in the residual limb, preserving their communication and enabling sensory feedback. Electrodes on these muscles transmit signals via wires in the implant to a robotic controller, which translates the signals into precise movements of the prosthesis.\n\nIn a small clinical study, participants with the OMP demonstrated improved performance in tasks like walking, stair climbing, and obstacle avoidance compared to those with traditional prostheses or AMI surgery alone. Crucially, the OMP users reported a significantly greater sense of embodiment, feeling that the prosthetic limb was a natural part of their body.\n\nThe AMI procedure is already being implemented for below-the-knee amputations, and researchers anticipate that OMP may become a standard treatment for above-the-knee amputations after larger clinical trials and FDA approval, potentially within five years. The research highlights the potential of tissue-integrated prostheses to enhance both physical function and psychological well-being for amputees.\n",
    "chinese_title": "植入式仿生膝关节有望恢复自然活动。",
    "chinese_summary": "麻省理工学院研究人员开发出一种新型仿生膝盖，即骨整合机械神经假肢（OMP），旨在提高膝上截肢者的活动能力和身体融合感。与传统的套筒式假肢不同，OMP通过插入股骨的钛棒直接与使用者的肌肉和骨骼组织整合，从而提供更大的稳定性和控制力。\n\n该系统采用一种名为激动-拮抗肌神经元界面（AMI）的手术技术，该技术重新连接残肢中的肌肉对，保持它们的通信并实现感觉反馈。这些肌肉上的电极通过植入物中的导线将信号传输到机器人控制器，机器人控制器将信号转化为假肢的精确运动。\n\n在一项小型临床研究中，与使用传统假肢或仅接受AMI手术的患者相比，使用OMP的参与者在步行、爬楼梯和避开障碍物等任务中表现出更高的性能。至关重要的是，OMP使用者报告了显著更强的身体融合感，感觉假肢是他们身体的自然组成部分。\n\nAMI手术已开始应用于膝下截肢，研究人员预计，经过更大规模的临床试验和FDA批准后，OMP可能会在五年内成为膝上截肢的标准治疗方法。该研究突出了组织整合假肢在增强截肢者身体机能和心理健康方面的潜力。"
  },
  {
    "id": "44547105",
    "title": "Show HN: 0xDEAD//TYPE – A fast-paced typing shooter with retro vibes",
    "url": "https://0xdeadtype.theden.sh/",
    "summary": "0xDEAD//TYPE is a fast-paced typing shooter game with retro aesthetics. The game involves pressing the matching keys displayed on falling blocks to destroy them. Players can use the W/S or Up/Down keys to move and the spacebar for temporary invincibility. A special block labeled '0' provides a unique gameplay element. The game requires users to click within the browser to enable sound. Developed by TheDen, 0xDEAD//TYPE is a typing game that combines the mechanics of a shooter with typing skills.\n",
    "chinese_title": "Show HN: 0xDEAD//TYPE – 一款快节奏复古打字射击游戏",
    "chinese_summary": "0xDEAD//TYPE是一款快节奏的打字射击游戏，具有复古美学风格。游戏中，玩家需要按下与下落方块上显示的字母相匹配的按键来摧毁它们。玩家可以使用W/S或上/下键移动，空格键用于临时无敌。一个标记为“0”的特殊方块提供了一种独特的游戏元素。游戏需要用户点击浏览器内以启用声音。0xDEAD//TYPE由TheDen开发，是一款结合了射击机制和打字技巧的打字游戏。"
  },
  {
    "id": "44545708",
    "title": "Scanned piano rolls database",
    "url": "http://www.pianorollmusic.org/rolldatabase.php",
    "summary": "This document is a listing from a database of scanned piano rolls maintained by the International Association of Mechanical Music Preservationists. The database currently contains 16,182 scanned piano rolls, displaying 200 items per page with the current page being 1 of 81 pages.\n\nThe listing includes the following information for each piano roll:\n\n*   **Catalog Mfgr & Num:** The catalog number and manufacturer of the roll.\n*   **© Date:** The copyright date of the roll.\n*   **MIDI:** Availability of a MIDI file (only available for music published in 1929 and earlier).\n*   **Roll Title:** The title of the musical piece on the roll.\n*   **Composer:** The composer of the music.\n*   **Performer:** The performer of the music on the roll (if applicable).\n*   **Date Added:** The date the roll was added to the database.\n*   **Scanned By:** The person who scanned the piano roll.\n*   **Print Image:** Information about the print image.\n\nThe list then provides a long table of these details for specific scanned piano rolls. Information includes the scanned by, the catalogue, date added, image type and other information.\n",
    "chinese_title": "扫描钢琴卷帘数据库",
    "chinese_summary": "本文件是国际机械音乐保护协会维护的扫描钢琴卷轴数据库的清单。该数据库目前包含16182个扫描钢琴卷轴，每页显示200个项目，当前页为第1页，共81页。\n\n清单包含每个钢琴卷轴的以下信息：\n\n*   **目录制造商 & 编号:** 卷轴的目录编号和制造商。\n*   **© 日期:** 卷轴的版权日期。\n*   **MIDI:** MIDI文件的可用性（仅适用于1929年及以前出版的音乐）。\n*   **卷轴标题:** 卷轴上乐曲的标题。\n*   **作曲家:** 音乐的作曲家。\n*   **演奏者:** 卷轴上音乐的演奏者（如果适用）。\n*   **添加日期:** 卷轴添加到数据库的日期。\n*   **扫描者:** 扫描钢琴卷轴的人。\n*   **印刷图像:** 关于印刷图像的信息。\n\n然后，该列表提供了一个长表格，其中包含特定扫描钢琴卷轴的这些详细信息。信息包括扫描者、目录、添加日期、图像类型和其他信息。"
  },
  {
    "id": "44591605",
    "title": "Parsing Protobuf Like Never Before",
    "url": "https://mcyoung.xyz/2025/07/16/hyperpb/",
    "summary": "生成摘要时出错",
    "chinese_title": "Parsing Protobuf Like Never Before",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44582855",
    "title": "Chain of thought monitorability: A new and fragile opportunity for AI safety",
    "url": "https://arxiv.org/abs/2507.11473",
    "summary": "生成摘要时出错",
    "chinese_title": "Chain of thought monitorability: A new and fragile opportunity for AI safety",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44570130",
    "title": "A Rust shaped hole",
    "url": "https://mnvr.in/rust",
    "summary": "生成摘要时出错",
    "chinese_title": "A Rust shaped hole",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44585543",
    "title": "Signs of autism could be encoded in the way you walk",
    "url": "https://www.sciencealert.com/signs-of-autism-could-be-encoded-in-the-way-you-walk",
    "summary": "生成摘要时出错",
    "chinese_title": "Signs of autism could be encoded in the way you walk",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44565806",
    "title": "Roman dodecahedron: 12-sided object has baffled archaeologists for centuries",
    "url": "https://www.livescience.com/archaeology/romans/roman-dodecahedron-a-mysterious-12-sided-object-that-has-baffled-archaeologists-for-centuries",
    "summary": "Archaeologists have been puzzled by Roman dodecahedrons, 12-sided bronze objects discovered across the northwestern provinces of the Roman Empire, since the first one was found in 1739. Dating from the second to fourth centuries A.D., these objects are hollow, range in size from 1.6 to 3.9 inches, and have pentagonal faces with holes of varying diameters and small spheres at each corner. Despite over 120 discoveries in regions like Austria, Belgium, France, and Great Britain, their purpose remains unknown.\n\nNumerous theories have been proposed, suggesting uses ranging from weapons and decorations to measurement devices and toys. However, most of these have been ruled out. Michael Guggenberger, a classical archaeologist who has studied the objects extensively, believes they are \"Gallo-Roman products\" possibly linked to Celtic tribes, with symbolic significance tied to Platonic-Pythagorean philosophy.\n\nAccording to this theory, the dodecahedron represented the universe, a concept revived in the second century A.D. by thinkers like Plutarch. A particular find, a dodecahedron found in a woman's grave alongside a rod-shaped bone artifact, suggests it may have been mounted on a staff, potentially linking it to Druidic traditions. For now, Guggenberger considers the most likely interpretation to be an all-encompassing cosmic symbol, akin to an amulet.\n",
    "chinese_title": "Roman dodecahedron: 12-sided object has baffled archaeologists for centuries",
    "chinese_summary": "Archaeologists have been puzzled by Roman dodecahedrons, 12-sided bronze objects discovered across the northwestern provinces of the Roman Empire, since the first one was found in 1739. Dating from the second to fourth centuries A.D., these objects are hollow, range in size from 1.6 to 3.9 inches, and have pentagonal faces with holes of varying diameters and small spheres at each corner. Despite over 120 discoveries in regions like Austria, Belgium, France, and Great Britain, their purpose remains unknown.\n\nNumerous theories have been proposed, suggesting uses ranging from weapons and decorations to measurement devices and toys. However, most of these have been ruled out. Michael Guggenberger, a classical archaeologist who has studied the objects extensively, believes they are \"Gallo-Roman products\" possibly linked to Celtic tribes, with symbolic significance tied to Platonic-Pythagorean philosophy.\n\nAccording to this theory, the dodecahedron represented the universe, a concept revived in the second century A.D. by thinkers like Plutarch. A particular find, a dodecahedron found in a woman's grave alongside a rod-shaped bone artifact, suggests it may have been mounted on a staff, potentially linking it to Druidic traditions. For now, Guggenberger considers the most likely interpretation to be an all-encompassing cosmic symbol, akin to an amulet.\n"
  },
  {
    "id": "44591988",
    "title": "Retro gaming YouTuber Once Were Nerd sued and raided by the Italian government",
    "url": "https://www.androidauthority.com/once-were-nerd-youtuber-copyright-lawsuit-3577995/",
    "summary": "生成摘要时出错",
    "chinese_title": "Retro gaming YouTuber Once Were Nerd sued and raided by the Italian government",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44549089",
    "title": "What's happening to reading?",
    "url": "https://www.newyorker.com/culture/open-questions/whats-happening-to-reading",
    "summary": "生成摘要时出错",
    "chinese_title": "What's happening to reading?",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44559375",
    "title": "Task Runner Census 2025",
    "url": "https://aleyan.com/blog/2025-task-runners-census/",
    "summary": "生成摘要时出错",
    "chinese_title": "Task Runner Census 2025",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44591062",
    "title": "Open, free, and ignored: the afterlife of Symbian",
    "url": "https://www.theregister.com/2025/07/17/symbian_forgotten_foss_phone_os/",
    "summary": "生成摘要时出错",
    "chinese_title": "Open, free, and ignored: the afterlife of Symbian",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44558289",
    "title": "Blue Pencil no. 18–Some history about Arial",
    "url": "https://www.paulshawletterdesign.com/2011/09/blue-pencil-no-18%e2%80%94some-history-about-arial/",
    "summary": "生成摘要时出错",
    "chinese_title": "蓝铅笔第18期——关于Arial的一些历史",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44578143",
    "title": "Six Years of Gemini",
    "url": "https://geminiprotocol.net/news/2025_06_20.gmi",
    "summary": "生成摘要时出错",
    "chinese_title": "Six Years of Gemini",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44578070",
    "title": "LLM Daydreaming",
    "url": "https://gwern.net/ai-daydreaming",
    "summary": "生成摘要时出错",
    "chinese_title": "LLM Daydreaming",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44593025",
    "title": "Are Diamonds Even a Luxury Anymore? De Beers Reckons with Price Plunge",
    "url": "https://www.wsj.com/business/retail/de-beers-diamonds-price-lab-grown-468b33ab",
    "summary": "生成摘要时出错",
    "chinese_title": "Are Diamonds Even a Luxury Anymore? De Beers Reckons with Price Plunge",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44593025",
    "title": "Are Diamonds Even a Luxury Anymore? De Beers Reckons with Price Plunge",
    "url": "https://www.wsj.com/business/retail/de-beers-diamonds-price-lab-grown-468b33ab",
    "summary": "生成摘要时出错",
    "chinese_title": "Are Diamonds Even a Luxury Anymore? De Beers Reckons with Price Plunge",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44541662",
    "title": "MARS.EXE → COM (2021)",
    "url": "https://chaos.if.uj.edu.pl/~wojtek/MARS.COM/",
    "summary": "生成摘要时出错",
    "chinese_title": "MARS.EXE → COM (2021)",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44579902",
    "title": "Ukrainian hackers destroyed the IT infrastructure of Russian drone manufacturer",
    "url": "https://prm.ua/en/ukrainian-hackers-destroyed-the-it-infrastructure-of-a-russian-drone-manufacturer-what-is-known/",
    "summary": "生成摘要时出错",
    "chinese_title": "Ukrainian hackers destroyed the IT infrastructure of Russian drone manufacturer",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44548449",
    "title": "Atopile – Design circuit boards with code",
    "url": "https://atopile.io/atopile/introduction",
    "summary": "生成摘要时出错",
    "chinese_title": "Atopile – Design circuit boards with code",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44549149",
    "title": "AI therapy bots fuel delusions and give dangerous advice, Stanford study finds",
    "url": "https://arstechnica.com/ai/2025/07/ai-therapy-bots-fuel-delusions-and-give-dangerous-advice-stanford-study-finds/",
    "summary": "生成摘要时出错",
    "chinese_title": "AI therapy bots fuel delusions and give dangerous advice, Stanford study finds",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44550079",
    "title": "What I'm working on – at work and on the side – aswin's blog",
    "url": "https://aswinc.blog/blog/work-2/",
    "summary": "生成摘要时出错",
    "chinese_title": "What I'm working on – at work and on the side – aswin's blog",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44594336",
    "title": "Birth of a solar system caught 'on camera' for first time",
    "url": "https://www.nature.com/articles/d41586-025-02245-y",
    "summary": "生成摘要时出错",
    "chinese_title": "Birth of a solar system caught 'on camera' for first time",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44576312",
    "title": "Claude for Financial Services",
    "url": "https://www.anthropic.com/news/claude-for-financial-services",
    "summary": "生成摘要时出错",
    "chinese_title": "Claude for Financial Services",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44567857",
    "title": "LLM Inevitabilism",
    "url": "https://tomrenner.com/posts/llm-inevitabilism/",
    "summary": "生成摘要时出错",
    "chinese_title": "LLM Inevitabilism",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44541088",
    "title": "Running a million-board chess MMO in a single process",
    "url": "https://eieio.games/blog/a-million-realtime-chess-boards-in-a-single-process/",
    "summary": "生成摘要时出错",
    "chinese_title": "Running a million-board chess MMO in a single process",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44579717",
    "title": "I'm switching to Python and actually liking it",
    "url": "https://www.cesarsotovalero.net/blog/i-am-switching-to-python-and-actually-liking-it.html",
    "summary": "生成摘要时出错",
    "chinese_title": "I'm switching to Python and actually liking it",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44578490",
    "title": "Cloudflare 1.1.1.1 Incident on July 14, 2025",
    "url": "https://blog.cloudflare.com/cloudflare-1-1-1-1-incident-on-july-14-2025/",
    "summary": "生成摘要时出错",
    "chinese_title": "Cloudflare 1.1.1.1 Incident on July 14, 2025",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44551359",
    "title": "Show HN: BloomSearch – Keyword search with hierarchical Bloom filters",
    "url": "https://github.com/danthegoodman1/bloomsearch",
    "summary": "生成摘要时出错",
    "chinese_title": "Show HN: BloomSearch – Keyword search with hierarchical Bloom filters",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44583619",
    "title": "The Italian towns selling houses for €1",
    "url": "https://www.theguardian.com/society/2025/jul/08/the-life-swap-dream-or-a-marketing-gimmick-the-italian-towns-selling-houses-for-1",
    "summary": "生成摘要时出错",
    "chinese_title": "The Italian towns selling houses for €1",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44579317",
    "title": "Shipping WebGPU on Windows in Firefox 141",
    "url": "https://mozillagfx.wordpress.com/2025/07/15/shipping-webgpu-on-windows-in-firefox-141/",
    "summary": "生成摘要时出错",
    "chinese_title": "Shipping WebGPU on Windows in Firefox 141",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44589560",
    "title": "Betting against YouTube Financial Influencers beat the S&P 500 (risky though)?",
    "url": "https://papers.ssrn.com/sol3/papers.cfm?abstract_id=5315526",
    "summary": "生成摘要时出错",
    "chinese_title": "Betting against YouTube Financial Influencers beat the S&P 500 (risky though)?",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44543630",
    "title": "Pascal's Scams (2012)",
    "url": "http://unenumerated.blogspot.com/2012/07/pascals-scams.html",
    "summary": "生成摘要时出错",
    "chinese_title": "Pascal's Scams (2012)",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44567187",
    "title": "Remembrance of Scents Past",
    "url": "https://www.newyorker.com/culture/onward-and-upward-with-the-arts/remembrance-of-scents-past",
    "summary": "生成摘要时出错",
    "chinese_title": "Remembrance of Scents Past",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44577171",
    "title": "Unlike ChatGPT, Anthropic has doubled down on Artifacts",
    "url": "https://ben-mini.com/2025/claude-is-kicking-chatgpts-butt",
    "summary": "生成摘要时出错",
    "chinese_title": "Unlike ChatGPT, Anthropic has doubled down on Artifacts",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44586427",
    "title": "A recap on May/June stability at Neon",
    "url": "https://neon.com/blog/an-apology-and-a-recap-on-may-june-stability",
    "summary": "生成摘要时出错",
    "chinese_title": "A recap on May/June stability at Neon",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44587018",
    "title": "Tin Can – The landline, reinvented for kids",
    "url": "https://tincan.kids/",
    "summary": "生成摘要时出错",
    "chinese_title": "Tin Can – The landline, reinvented for kids",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44565004",
    "title": "Show HN: The HTML Maze – Escape an eerie labyrinth built with HTML pages",
    "url": "https://htmlmaze.com/",
    "summary": "生成摘要时出错",
    "chinese_title": "Show HN: The HTML Maze – Escape an eerie labyrinth built with HTML pages",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44542408",
    "title": "The Story of Mel, A Real Programmer, Annotated (1996)",
    "url": "https://users.cs.utah.edu/~elb/folklore/mel-annotated/node1.html#SECTION00010000000000000000",
    "summary": "生成摘要时出错",
    "chinese_title": "The Story of Mel, A Real Programmer, Annotated (1996)",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44573887",
    "title": "Designing for the Eye: Optical corrections in architecture and typography",
    "url": "https://www.nubero.ch/blog/015/",
    "summary": "生成摘要时出错",
    "chinese_title": "Designing for the Eye: Optical corrections in architecture and typography",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44549413",
    "title": "Thunderbird: Fluent Windows 11 Design",
    "url": "https://github.com/Deathbyteacup/fluentbird",
    "summary": "生成摘要时出错",
    "chinese_title": "Thunderbird: Fluent Windows 11 Design",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44571692",
    "title": "Voxtral – Frontier open source speech understanding models",
    "url": "https://mistral.ai/news/voxtral",
    "summary": "生成摘要时出错",
    "chinese_title": "Voxtral – Frontier open source speech understanding models",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44586328",
    "title": "Young graduates are facing an employment crisis",
    "url": "https://www.wsj.com/economy/jobs/jobs-unemployment-rise-young-people-ce4704d8",
    "summary": "生成摘要时出错",
    "chinese_title": "Young graduates are facing an employment crisis",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44560123",
    "title": "From engineer to manager: A practical guide to your first months in leadership",
    "url": "https://humansinsystems.com/blog/new-manager-essentials-a-practical-guide-to-your-first-months",
    "summary": "生成摘要时出错",
    "chinese_title": "From engineer to manager: A practical guide to your first months in leadership",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44573750",
    "title": "How I lost my backpack with passports and laptop",
    "url": "https://psychotechnology.substack.com/p/how-i-lost-my-backpack-with-passports",
    "summary": "生成摘要时出错",
    "chinese_title": "How I lost my backpack with passports and laptop",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44588699",
    "title": "Show HN: Cobble – A hard daily word game",
    "url": "https://wilf.live/cobble/",
    "summary": "生成摘要时出错",
    "chinese_title": "Show HN: Cobble – A hard daily word game",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44561300",
    "title": "Where the Horses Swim: On Barbados' Pebbles Beach, Racehorses Train in the Ocean",
    "url": "https://www.thedial.world/articles/news/issue-30/horse-racing-barbados",
    "summary": "生成摘要时出错",
    "chinese_title": "Where the Horses Swim: On Barbados' Pebbles Beach, Racehorses Train in the Ocean",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44583982",
    "title": "Mkosi – Build Bespoke OS Images",
    "url": "https://mkosi.systemd.io/",
    "summary": "生成摘要时出错",
    "chinese_title": "Mkosi – Build Bespoke OS Images",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44543386",
    "title": "Documenting what you're willing to support (and not)",
    "url": "https://rachelbythebay.com/w/2025/07/07/support/",
    "summary": "生成摘要时出错",
    "chinese_title": "Documenting what you're willing to support (and not)",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44573752",
    "title": "Plasma Bigscreen rises from the dead with a better UI",
    "url": "https://www.neowin.net/news/kdes-android-tv-alternative-plasma-bigscreen-rises-from-the-dead-with-a-better-ui/",
    "summary": "生成摘要时出错",
    "chinese_title": "Plasma Bigscreen rises from the dead with a better UI",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44548620",
    "title": "Lorem Gibson",
    "url": "http://loremgibson.com/",
    "summary": "生成摘要时出错",
    "chinese_title": "Lorem Gibson",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44572377",
    "title": "Show HN: Shoggoth Mini – A soft tentacle robot powered by GPT-4o and RL",
    "url": "https://www.matthieulc.com/posts/shoggoth-mini",
    "summary": "生成摘要时出错",
    "chinese_title": "Show HN: Shoggoth Mini – A soft tentacle robot powered by GPT-4o and RL",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44578510",
    "title": "Tilck: A tiny Linux-compatible kernel",
    "url": "https://github.com/vvaltchev/tilck",
    "summary": "生成摘要时出错",
    "chinese_title": "Tilck: A tiny Linux-compatible kernel",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44573574",
    "title": "Mira Murati’s AI startup Thinking Machines valued at $12B in early-stage funding",
    "url": "https://www.reuters.com/technology/mira-muratis-ai-startup-thinking-machines-raises-2-billion-a16z-led-round-2025-07-15/",
    "summary": "生成摘要时出错",
    "chinese_title": "Mira Murati’s AI startup Thinking Machines valued at $12B in early-stage funding",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44589704",
    "title": "Numbers from my recent job hunt",
    "url": "https://shanebarry.com/numbers-from-my-recent-job-hunt/",
    "summary": "生成摘要时出错",
    "chinese_title": "Numbers from my recent job hunt",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44551777",
    "title": "Algorithms for making interesting organic simulations",
    "url": "https://bleuje.com/physarum-explanation/",
    "summary": "生成摘要时出错",
    "chinese_title": "Algorithms for making interesting organic simulations",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44573195",
    "title": "Reflections on OpenAI",
    "url": "https://calv.info/openai-reflections",
    "summary": "生成摘要时出错",
    "chinese_title": "Reflections on OpenAI",
    "chinese_summary": "生成摘要时出错"
  }
]