[
  {
    "id": "45464921",
    "title": "Germany must stand firmly against client-side scanning in Chat Control [pdf]",
    "url": "https://signal.org/blog/pdfs/germany-chat-control.pdf",
    "summary": "This document, titled \"Germany must stand firmly against client-side scanning in Chat Control,\" is a PDF file containing binary data.  While the PDF's structure is evident, its content is obfuscated and contains mostly non-human-readable characters. The title suggests the document argues against \"client-side scanning\" within the context of \"Chat Control,\" presumably a system proposed or implemented for monitoring online communications.\n\nClient-side scanning, in this context, likely refers to a method where messages are scanned on the user's device *before* they are sent, rather than on a central server. This raises significant privacy concerns.  The document's title argues that Germany should resist this type of surveillance.\n\nBecause the PDF content is essentially gibberish, it is impossible to provide specific arguments or details about the document's reasoning. However, the title clearly indicates its stance: opposition to client-side scanning in Chat Control. The document likely delves into the privacy implications and potential abuses of such a system, particularly from a German legal and ethical perspective.\n",
    "chinese_title": "德国必须坚决反对聊天监控中的客户端扫描 [pdf]",
    "chinese_summary": "题为“德国必须坚决反对聊天控制中的客户端扫描”的文件是一份包含二进制数据的PDF文件。虽然PDF的结构清晰，但其内容经过混淆处理，且大多包含非人类可读字符。标题表明该文件反对“聊天控制”中的“客户端扫描”，这可能是一种为监控在线通信而提出或实施的系统。\n\n在此背景下，客户端扫描可能指的是在用户设备上*发送之前*扫描消息的方法，而不是在中央服务器上扫描。这引发了重大的隐私问题。该文件的标题认为，德国应该抵制这种类型的监控。\n\n由于PDF内容本质上是乱码，因此无法提供关于该文件推理的具体论点或细节。但是，标题清楚地表明了其立场：反对聊天控制中的客户端扫描。该文件可能深入探讨了这种系统的隐私影响和潜在滥用，特别是从德国法律和伦理的角度来看。"
  },
  {
    "id": "45453936",
    "title": "Litestream v0.5.0",
    "url": "https://fly.io/blog/litestream-v050-is-here/",
    "summary": "This article announces the release of Litestream v0.5.0, a significant update to the open-source backup/restore system for SQLite. The update focuses on speed improvements and efficient point-in-time recovery (PITR).\n\nThe core change is the adoption of the LTX file format, previously used in LiteFS, another SQLite project. LTX allows Litestream to capture and compact changes at a page level rather than relying solely on WAL files. This leads to faster restoration times, achieved through a hierarchical compaction system (30-second, 5-minute, and 1-hour windows).\n\nThe update also eliminates the concept of \"generations,\" simplifying the backup process when multiple Litestream instances are used. It now uses monotonically incrementing transaction IDs for tracking database state.\n\nUpgrading from v0.3.x is straightforward – simply start using the new version. The configuration file is backwards compatible, but a single replica destination is now enforced per database for simplicity and reliability.\n\nOther improvements include per-page compression and indexing within LTX files, enabling future features like point-in-time queries without downloading the entire database. CGO has been removed, modernc.org/sqlite is now used, and a replica type for NATS JetStream has been added. Clients for S3, Google Storage, and Azure Blob Storage have been updated.\n\nThe next major feature under development is a Litestream VFS for read replicas, enabling instant access to a database copy while the rest is hydrating from object storage.\n",
    "chinese_title": "Litestream v0.5.0",
    "chinese_summary": "本文宣布发布 Litestream v0.5.0，这是 SQLite 开源备份/恢复系统的重要更新。本次更新着重于速度提升和高效的时间点恢复 (PITR)。\n\n核心变更是采用了 LTX 文件格式，该格式之前用于另一个 SQLite 项目 LiteFS。LTX 允许 Litestream 在页面级别捕获和压缩更改，而不是仅仅依赖 WAL 文件。这带来了更快的恢复时间，通过分层压缩系统（30 秒、5 分钟和 1 小时窗口）实现。\n\n本次更新还消除了“代”的概念，简化了使用多个 Litestream 实例时的备份过程。现在它使用单调递增的事务 ID 来跟踪数据库状态。\n\n从 v0.3.x 升级非常简单——只需开始使用新版本即可。配置文件向后兼容，但为了简单和可靠性，现在每个数据库强制执行单个副本目标。\n\n其他改进包括 LTX 文件中的每页压缩和索引，从而实现未来的功能，例如无需下载整个数据库即可进行时间点查询。CGO 已被移除，现在使用 modernc.org/sqlite，并添加了 NATS JetStream 的副本类型。S3、Google Storage 和 Azure Blob Storage 的客户端已更新。\n\n下一个正在开发的主要功能是 Litestream VFS，用于只读副本，在数据库的其余部分从对象存储中恢复时，能够立即访问数据库副本。"
  },
  {
    "id": "45464984",
    "title": "The Collapse of the Econ PhD Job Market",
    "url": "https://www.chrisbrunet.com/p/the-collapse-of-the-econ-phd-job",
    "summary": "Christopher Brunet's article, \"The Collapse of the Econ PhD Job Market,\" argues that a doctorate in economics, once a reliable path to tenure or other lucrative positions, is now a risky gamble. The article uses data from the American Economic Association's \"Job Openings for Economists\" (JOE) and Econ Job Market (EJM) to demonstrate a significant decline in job postings and interview invitations over the past three years. Tenure-track positions have decreased by roughly 35% since 2022.\n\nWhile the demand for positions plummets, the supply of PhD graduates is rising, alongside a substantial backlog of post-docs and visiting professors. The article cites data showing only a small percentage of American PhD students secure tenure-track jobs.\n\nBrunet attributes this decline to several structural factors: declining undergraduate enrollment in economics, the looming demographic cliff, the rise of AI automating tasks previously done by economists, and a loss of public trust due to perceived misinformation about inflation. He also notes the shrinkage of government, international organization, and tech industry hiring of economists.\n\nThe author concludes that an economics PhD is no longer a safe investment and suggests the future of economic discourse might shift towards decentralized platforms like Substack, as traditional academic jobs become increasingly scarce. He calls for PhD programs to reduce admissions to avoid further flooding the market.\n",
    "chinese_title": "经济学博士就业市场的崩溃",
    "chinese_summary": "克里斯托弗·布鲁内特的文章《经济学博士就业市场的崩溃》指出，经济学博士学位曾经是获得终身教职或其他高薪职位的可靠途径，但现在却成了一场高风险的赌博。该文章利用美国经济学会的“经济学家职位空缺”(JOE)和经济学就业市场(EJM)的数据，证明了过去三年职位发布和面试邀请的数量大幅下降。自2022年以来，终身教职的数量减少了大约35%。\n\n在职位需求暴跌的同时，博士毕业生的数量却在上升，同时还有大量的博士后和访问学者积压。文章引用数据显示，只有一小部分美国博士生能获得终身教职。\n\n布鲁内特将这种下降归因于几个结构性因素：经济学本科生入学人数下降、迫在眉睫的人口断崖、人工智能的兴起正在自动化以前由经济学家完成的任务，以及由于对通货膨胀的错误信息而导致的公众信任丧失。他还指出，政府、国际组织和科技行业对经济学家的招聘正在萎缩。\n\n作者的结论是，经济学博士学位不再是一项安全的投资，并认为随着传统学术职位的日益稀缺，经济学讨论的未来可能会转向Substack等去中心化平台。他呼吁博士项目减少招生，以避免进一步淹没市场。"
  },
  {
    "id": "45463656",
    "title": "Social anxiety isn't about being liked",
    "url": "https://chrislakin.blog/p/social-anxiety",
    "summary": "Chris Lakin's article challenges the common assumption that social anxiety stems from a desire to be liked. Instead, he proposes that it's fundamentally about avoiding being disliked. Socially anxious behaviors, such as shrinking, being less assertive, and avoiding risks, seem counterproductive if the goal is to be liked, but they are effective strategies for minimizing the chance of negative attention or judgment.\n\nThe author uses the analogy of financial insecurity, where the focus is on avoiding bankruptcy rather than maximizing profits. Similarly, socially anxious individuals prioritize avoiding negative social outcomes over pursuing popularity. The concept of \"countersignalling\" in close friendships further illustrates this point, as comfort in these relationships allows for riskier, potentially awkward, interactions.\n\nThe article argues that understanding this shift in perspective can be liberating. Individuals experiencing social anxiety often feel like failures because they believe they are failing to be liked. However, if the underlying goal is to avoid being disliked, their behavior makes logical sense. Recognizing this allows them to reframe their experiences and focus on addressing the root cause: discomfort with the possibility of being disliked. The solution, therefore, isn't to strive harder for approval, but to become more comfortable with potential disapproval.\n",
    "chinese_title": "社交焦虑并非在于被人喜欢。",
    "chinese_summary": "克里斯·莱金的文章挑战了一种常见的假设，即社交焦虑源于被喜欢的渴望。相反，他认为其根本在于避免被讨厌。社交焦虑行为，例如退缩、缺乏自信和避免冒险，如果目标是被人喜欢，似乎适得其反，但它们是最大限度地减少负面关注或评判机会的有效策略。\n\n作者使用财务不安全感作类比，重点在于避免破产而不是最大化利润。同样，社交焦虑的人优先考虑避免负面的社交结果，而不是追求受欢迎。亲密友谊中的“反信号”概念进一步说明了这一点，因为这些关系中的舒适感允许进行风险较高、可能尴尬的互动。\n\n文章认为，理解这种视角的转变可以带来解放。经历社交焦虑的人常常觉得自己是失败者，因为他们认为自己未能被人喜欢。然而，如果根本目标是避免被讨厌，他们的行为就变得合乎逻辑。认识到这一点使他们能够重新构建自己的经历，并专注于解决根本原因：对被讨厌可能性的不适。因此，解决方案不是更加努力地争取认可，而是变得更能接受潜在的不赞同。"
  },
  {
    "id": "45463251",
    "title": "Webbol: A minimal static web server written in COBOL",
    "url": "https://github.com/jmsdnns/webbol",
    "summary": "Webbol is a minimal, open-source static web server written in COBOL using GnuCOBOL. It serves files from the current directory, automatically detects MIME types for common file formats, and provides standard HTTP status codes. Security features include path traversal prevention and directory access restriction.\n\nTo use Webbol, you need GnuCOBOL installed on a POSIX-compatible system (Linux, macOS, BSD). The server is built using `make`, and started by running the `webserver` executable. By default, it serves content on port 8080 and looks for `index.html` in the root directory. Configuration, like changing the port, can be done by modifying `config.cpy` and recompiling.\n\nWebbol supports common MIME types like HTML, CSS, JavaScript, JSON, images, and text. Additional MIME types can be added by editing the `mime-types.cbl` file.\n\nLimitations include single-threaded operation, no SSL/TLS support, a 64KB file size limit, and no caching or compression. It's designed for serving simple, static content. The project structure includes files for configuration, socket definitions, HTTP and file structure definitions, path utilities, MIME type handling, file operations, and HTTP request/response handling. Webbol demonstrates that COBOL can be used for modern systems programming tasks.\n",
    "chinese_title": "Webbol：一个用COBOL编写的极简静态Web服务器",
    "chinese_summary": "Webbol：使用GnuCOBOL编写的极简开源COBOL静态Web服务器。它从当前目录提供文件，自动检测常见文件格式的MIME类型，并提供标准HTTP状态码。安全特性包括路径遍历防护和目录访问限制。\n\n要使用Webbol，需要在POSIX兼容系统（Linux、macOS、BSD）上安装GnuCOBOL。服务器使用`make`构建，并运行`webserver`可执行文件启动。默认情况下，它在8080端口提供内容，并在根目录中查找`index.html`。可以通过修改`config.cpy`并重新编译来更改端口等配置。\n\nWebbol支持常见的MIME类型，如HTML、CSS、JavaScript、JSON、图像和文本。可以通过编辑`mime-types.cbl`文件添加其他MIME类型。\n\n局限性包括单线程操作、无SSL/TLS支持、64KB文件大小限制以及无缓存或压缩。它专为提供简单的静态内容而设计。项目结构包括用于配置、套接字定义、HTTP和文件结构定义、路径实用程序、MIME类型处理、文件操作以及HTTP请求/响应处理的文件。Webbol证明了COBOL可用于现代系统编程任务。"
  },
  {
    "id": "45463319",
    "title": "I Turned the Lego Game Boy into a Working Game Boy",
    "url": "https://blog.nataliethenerd.com/i-turned-the-lego-game-boy-into-a-working-game-boy-part-1/",
    "summary": "Natalie, known online as @natalie_thenerd, is documenting her ambitious project of turning the Lego Game Boy set into a fully functional Game Boy. Drawing on her extensive knowledge of Game Boy hardware, detailed in her board scan wiki, she's designing a custom PCB to fit within the Lego set.\n\nNatalie opted for the Game Boy Pocket (MGB) CPU due to its internal VRAM, cost-effectiveness, and availability, making it more suitable for the space-constrained build compared to the original DMG CPU.\n\nUtilizing press images and scaling them to actual dimensions, Natalie strategically plans to house the Game Boy components within the screen insert area of the Lego build. The PCB design incorporates a custom power circuit (derived from her Safer Charger boards), a soft-latching power button, and pinouts for the button matrix and audio.\n\nRecognizing the Lego buttons' functionality, she's wiring them to custom 3D printed \"toy brick\" parts to interface with the Game Boy. Similarly, she's integrating a USB-C port.\n\nThe project is still under development, with Natalie currently refining the board now that she has the physical Lego set. She plans to release the complete project details once finalized, encouraging readers to stay tuned for updates.\n",
    "chinese_title": "我把乐高Game Boy变成了能用的Game Boy",
    "chinese_summary": "娜塔莉（网名@natalie_thenerd）正在记录她将乐高Game Boy套装改造成完全可用的Game Boy的宏伟项目。凭借其Game Boy硬件的渊博知识（详见她的电路板扫描维基），她正在设计一个定制PCB，使其能够安装在乐高套装内。\n\n娜塔莉选择了Game Boy Pocket (MGB) CPU，因为它具有内部VRAM、成本效益和可用性，与原始DMG CPU相比，更适合这种空间受限的构建。\n\n娜塔莉利用新闻图片并将它们缩放到实际尺寸，战略性地计划将Game Boy组件放置在乐高构建的屏幕插入区域内。 PCB设计包含一个定制电源电路（源自她的Safer Charger电路板）、一个软锁电源按钮以及按钮矩阵和音频的引脚。\n\n考虑到乐高按钮的功能，她将它们连接到定制的3D打印“玩具砖”部件，以便与Game Boy连接。 同样，她还集成了一个USB-C端口。\n\n该项目仍在开发中，娜塔莉目前正在获得实体乐高套装后改进电路板。她计划在完成后发布完整的项目细节，并鼓励读者继续关注更新。"
  },
  {
    "id": "45465078",
    "title": "Depot (YC W23) Is Hiring a Principal Design Engineer (Remote US/EU)",
    "url": "https://www.ycombinator.com/companies/depot/jobs/qg8iVTz-principal-design-engineer",
    "summary": "Depot (YC W23), a company focused on accelerating software development by improving build performance, is hiring a Principal Design Engineer. The role is remote and open to candidates in the US and Europe, with a salary range of $200K - $250K and equity options (0.05% - 0.15%).\n\nDepot aims to redefine software collaboration with a platform combining performance, empathy, and centralized collaboration. The Principal Design Engineer will be a key contributor, working closely with engineering and the founders, owning projects from conception to completion. Responsibilities include hands-on design and delivery of roadmap projects, gathering customer feedback, redesigning key product flows, creating prototypes and high-fidelity visuals, implementing a lightweight design system, and helping with future team hiring.\n\nIdeal candidates possess 7+ years of software design experience, are self-starters comfortable with ambiguity, can translate complex problems into focused design solutions, and possess strong prototyping and communication skills. Depot values ownership, data-driven decision-making, and asynchronous collaboration.\n\nDepot's platform helps companies like PostHog and Wistia save significant time by accelerating build processes, thus improving developer productivity and happiness. Their mission is to relentlessly accelerate software development, removing the \"dam\" of slow builds.\n",
    "chinese_title": "Depot (YC W23) 招聘首席设计工程师（美国/欧盟 远程办公）",
    "chinese_summary": "Depot（YC W23）是一家致力于通过提升构建性能来加速软件开发的公司，现招聘首席设计工程师。该职位为远程办公，面向美国和欧洲的候选人开放，薪资范围为 20 万美元至 25 万美元，并提供股权期权（0.05% - 0.15%）。\n\nDepot 旨在通过一个集性能、共情和集中式协作为一体的平台，重新定义软件协作。首席设计工程师将是关键贡献者，与工程团队和创始人紧密合作，负责从概念到完成的项目。职责包括亲身参与路线图项目的设计和交付、收集客户反馈、重新设计关键产品流程、创建原型和高保真视觉效果、实施轻量级设计系统，以及协助未来的团队招聘。\n\n理想的候选人拥有 7 年以上的软件设计经验，是能够适应模糊性的自启动者，能够将复杂问题转化为专注的设计解决方案，并具有强大的原型设计和沟通能力。Depot 重视主人翁精神、数据驱动的决策和异步协作。\n\nDepot 的平台通过加速构建过程，帮助 PostHog 和 Wistia 等公司节省大量时间，从而提高开发人员的生产力和幸福感。他们的使命是坚持不懈地加速软件开发，消除缓慢构建的“障碍”。"
  },
  {
    "id": "45461500",
    "title": "Niri – A scrollable-tiling Wayland compositor",
    "url": "https://github.com/YaLTeR/niri",
    "summary": "Niri is a stable, scrollable-tiling Wayland compositor built from the ground up for multi-monitor setups and dynamic workspaces. Unlike traditional tiling window managers, Niri arranges windows in columns on an infinite strip per monitor, preventing window overflow between screens. It features dynamic workspaces, a zoomable overview, built-in screenshot UI, monitor/window screencasting, touchpad/mouse gestures, tabbed windows, and configurable layout options.\n\nNiri supports fractional scaling, NVIDIA GPUs, and floating windows. It also integrates with Xwayland. It supports input devices like tablets, touchpads and touchscreens, and implements important Wayland protocols like layer-shell and screencopy.\n\nThe compositor is actively developed and used daily by many. The project provides resources like a Getting Started page, a list of related projects (awesome-niri), and a Matrix channel for support.\n\nSeveral media appearances highlight Niri, including a talk at Moscow RustCon 2024, an interview on the German podcast Das Triumvirat, and an article in LWN.\n\nContributions to Niri are welcome, and the project draws inspiration from PaperWM, which implements scrollable tiling on GNOME Shell. The project also lists other similar tiling projects like karousel, scroll, papersway, hyprscrolling, hyprslidr, and PaperWM.spoon.\n",
    "chinese_title": "Niri - 一款可滚动平铺的Wayland合成器",
    "chinese_summary": "Niri 是一个稳定的、可滚动平铺的 Wayland 合成器，从头开始构建，专为多显示器设置和动态工作区而设计。与传统的平铺窗口管理器不同，Niri 在每个显示器的无限条带上以列排列窗口，防止窗口在屏幕之间溢出。它具有动态工作区、可缩放的概览、内置屏幕截图 UI、显示器/窗口屏幕广播、触摸板/鼠标手势、选项卡式窗口和可配置的布局选项。\n\nNiri 支持分数缩放、NVIDIA GPU 和浮动窗口。它还与 Xwayland 集成。它支持平板电脑、触摸板和触摸屏等输入设备，并实现了重要的 Wayland 协议，如 layer-shell 和 screencopy。\n\n该合成器正在积极开发中，并被许多人日常使用。该项目提供诸如入门页面、相关项目列表 (awesome-niri) 和用于支持的 Matrix 频道等资源。\n\nNiri 的一些媒体报道包括在 2024 年莫斯科 RustCon 上的演讲、在德国播客 Das Triumvirat 上的采访以及 LWN 上的一篇文章。\n\n欢迎对 Niri 做出贡献，该项目从 PaperWM 中汲取灵感，后者在 GNOME Shell 上实现了可滚动平铺。该项目还列出了其他类似的平铺项目，如 karousel、scroll、papersway、hyprscrolling、hyprslidr 和 PaperWM.spoon。"
  },
  {
    "id": "45464269",
    "title": "Anduril and Palantir battlefield comms system has deep flaws: Army",
    "url": "https://www.cnbc.com/2025/10/03/anduril-palantir-ngc2-deep-flaws-army.html",
    "summary": "A U.S. Army memo reveals serious security flaws in the next-generation battlefield communications system (NGC2) being developed by Anduril, Palantir, and other contractors. The memo, written by the Army's chief technology officer, describes the system as posing a \"very high risk\" due to \"fundamental security\" problems and vulnerabilities.\n\nThe NGC2 platform, designed to connect soldiers, sensors, vehicles, and commanders with real-time data, suffers from issues such as a lack of access control, meaning any authorized user can access all data regardless of clearance. The system also lacks user activity tracking and secure software verification. The system allows users to access sensitive information without proper logging.\n\nThe report highlighted several security gaps, including hosting third-party applications that haven't undergone proper Army security assessments, with some containing hundreds of vulnerabilities.\n\nDespite the memo's strong critique, the Army's chief information officer stated the report was part of the process to identify and mitigate vulnerabilities. Anduril and Palantir have not commented.\n",
    "chinese_title": "安杜里尔和帕兰提尔战场通信系统存在严重缺陷：陆军",
    "chinese_summary": "一份美国陆军备忘录揭示了由安杜里尔、帕兰提尔和其他承包商开发的下一代战场通信系统（NGC2）存在严重的安全漏洞。该备忘录由陆军首席技术官撰写，将该系统描述为构成“极高风险”，原因是存在“根本性安全”问题和漏洞。\n\nNGC2平台旨在将士兵、传感器、车辆和指挥官与实时数据连接起来，但存在诸多问题，例如缺乏访问控制，这意味着任何授权用户都可以访问所有数据，而无需考虑权限级别。该系统还缺乏用户活动跟踪和安全软件验证。该系统允许用户在没有适当日志记录的情况下访问敏感信息。\n\n该报告强调了几个安全漏洞，包括托管未经陆军适当安全评估的第三方应用程序，其中一些应用程序包含数百个漏洞。\n\n尽管备忘录提出了强烈的批评，但陆军首席信息官表示，该报告是识别和缓解漏洞过程的一部分。安杜里尔和帕兰提尔尚未置评。"
  },
  {
    "id": "45462297",
    "title": "Faroes",
    "url": "https://photoblog.nk412.com/Faroe2025/Faroes/n-cPCNFr",
    "summary": "Nagarjuna Kumar's \"Faroes\" paints a vivid picture of the Faroe Islands, an autonomous region within Denmark. The islands are characterized by their dramatic landscapes, harsh weather, and strong Nordic culture. Shaped by constant storms and crashing waves, the volcanic rock has been sculpted into towering basalt cliffs that drop dramatically into the Atlantic. The weather is unpredictable, shifting rapidly between fog, rain, and brief periods of sunshine.\n\nSheep are a defining feature of the Faroes, outnumbering humans and roaming freely across the islands. The name \"Faroes\" itself is derived from the words for \"sheep\" and \"islands.\" Islanders have adapted to the landscape by building grass-roofed houses for insulation and waterproofing. Hiking trails are often just sheep paths, and the experience is raw and untamed, with no guardrails or warning signs.\n\nThe Kallur lighthouse on Kalsoy is a notable landmark, accessible via a challenging hike along a knife-edge ridge. The islands have also gained recent fame as a filming location for the James Bond film \"No Time To Die.\" The author emphasizes the rugged beauty and unique character of the Faroes, making them a compelling destination for adventurous travelers.\n",
    "chinese_title": "法罗群岛",
    "chinese_summary": "纳加尔朱纳·库马尔的《法罗群岛》生动地描绘了丹麦境内的自治地区法罗群岛。这些岛屿以其壮丽的景色、恶劣的天气和浓厚的北欧文化为特色。在持续不断的风暴和汹涌的海浪作用下，火山岩被塑造成高耸的玄武岩悬崖，陡峭地坠入大西洋。天气变化莫测，在雾、雨和短暂的阳光之间快速切换。\n\n羊是法罗群岛的标志性特征，其数量超过人类，并在岛屿上自由漫游。“法罗群岛”这个名字本身就源于“羊”和“岛屿”这两个词。岛民通过建造草皮屋顶的房屋来适应环境，以达到隔热和防水的目的。徒步旅行路线通常只是羊道，这种体验原始而狂野，没有护栏或警告标志。\n\n卡尔索伊岛上的卡卢尔灯塔是一个著名的地标，可以通过沿着刀刃般的山脊进行具有挑战性的徒步旅行到达。这些岛屿最近也因作为詹姆斯·邦德电影《无暇赴死》的拍摄地而声名鹊起。作者强调了法罗群岛的崎岖之美和独特个性，使其成为冒险旅行者引人注目的目的地。"
  },
  {
    "id": "45463642",
    "title": "Microsoft CTO says he wants to swap most AMD and Nvidia GPUs for homemade chips",
    "url": "https://www.theregister.com/2025/10/02/microsoft_maia_dc/",
    "summary": "In a move to optimize performance and reduce costs, Microsoft CTO Kevin Scott announced plans to transition the majority of its AI datacenter workloads from AMD and Nvidia GPUs to its own custom-designed chips, starting with its Maia AI accelerators. While currently reliant on Nvidia for best price-performance, Microsoft seeks greater control over system design for workload optimization.\n\nMicrosoft's first in-house AI accelerator, the Maia 100, launched in late 2023, shifted OpenAI's GPT-3.5 workloads, freeing up GPU capacity, but its performance fell short of competing GPUs. A second-generation Maia accelerator is reportedly in development for launch next year.\n\nAlthough Microsoft aims for its own silicon to dominate its data centers, the article suggests that Nvidia and AMD GPUs will likely still be needed. Other cloud providers like Amazon and Google have already deployed their own custom chips (TPUs and Trainium), but they still use Nvidia and AMD GPUs as customer demand for those chips continues.\n\nBeyond AI accelerators, Microsoft is also developing custom CPUs (Cobalt) and security silicon to further tailor its infrastructure and secure its data centers.\n",
    "chinese_title": "微软首席技术官表示希望用自研芯片替换大部分AMD和英伟达GPU。",
    "chinese_summary": "为优化性能并降低成本，微软首席技术官凯文·斯科特宣布计划将其大部分人工智能数据中心工作负载从AMD和英伟达GPU转移到其自身定制设计的芯片上，首先从其Maia AI加速器开始。虽然目前依赖英伟达以获得最佳性价比，但微软寻求对系统设计有更大的控制权，以优化工作负载。\n\n微软首款内部AI加速器Maia 100于2023年末推出，转移了OpenAI的GPT-3.5工作负载，释放了GPU容量，但其性能不及竞争对手的GPU。据报道，第二代Maia加速器正在开发中，计划明年推出。\n\n尽管微软的目标是让自己的芯片主导其数据中心，但文章表明英伟达和AMD的GPU可能仍然是必需的。其他云提供商，如亚马逊和谷歌，已经部署了他们自己的定制芯片（TPU和Trainium），但他们仍然使用英伟达和AMD的GPU，因为客户对这些芯片的需求持续存在。\n\n除了AI加速器，微软还在开发定制CPU（Cobalt）和安全芯片，以进一步定制其基础设施并保护其数据中心。"
  },
  {
    "id": "45420722",
    "title": "Modern Font Stacks",
    "url": "https://modernfontstacks.com/",
    "summary": "This is the beginning of Lewis Carroll's \"Alice's Adventures in Wonderland.\" Alice is bored while sitting with her sister by a river. Her sister is reading a book without pictures or conversations, which Alice deems useless. She is contemplating whether picking daisies is worth the effort when a White Rabbit with pink eyes runs past, muttering about being late and taking a watch out of its waistcoat pocket.\n\nThis is highly unusual for Alice, who has never seen a rabbit with a waistcoat or a watch. Overcome with curiosity, she follows the rabbit down a rabbit-hole. The hole descends like a tunnel and then suddenly drops, causing Alice to fall down what seems like a deep well.\n\nDuring her long fall, Alice observes cupboards, bookshelves, maps, and pictures lining the well's sides. She grabs an empty jar of \"ORANGE MARMALADE\" and manages to put it back on a shelf. As the fall continues endlessly, Alice starts talking to herself, wondering if her cat Dinah will miss her and hoping she'll get her saucer of milk. Finally, she lands on a heap of sticks and dry leaves, ending her fall.\n",
    "chinese_title": "现代字体堆栈",
    "chinese_summary": "这是刘易斯·卡罗尔的《爱丽丝梦游仙境》的开篇。爱丽丝和姐姐坐在河边，感到无聊。姐姐正在读一本没有图画或对话的书，爱丽丝认为这本书毫无用处。她正在考虑采摘雏菊是否值得，这时，一只长着粉红色眼睛的白兔跑过去，嘟囔着自己要迟到了，并从背心口袋里掏出一块怀表。\n\n对于爱丽丝来说，这非常不寻常，她从未见过穿着背心或戴着怀表的兔子。出于强烈的好奇心，她跟着兔子跳进了一个兔子洞。这个洞像隧道一样下降，然后突然坠落，导致爱丽丝掉进一口似乎很深的井里。\n\n在漫长的下落过程中，爱丽丝观察到水井的侧面排列着橱柜、书架、地图和图片。她抓住一个空空的“橘子酱”罐子，并设法把它放回架子上。随着无休止的下落继续，爱丽丝开始自言自语，想着她的猫黛娜是否会想念她，并希望她能得到她的牛奶碟。最后，她落在一堆树枝和干树叶上，结束了她的坠落。"
  },
  {
    "id": "45464849",
    "title": "OpenAI Is Just Another Boring, Desperate AI Startup",
    "url": "https://www.wheresyoured.at/sora2-openai/",
    "summary": "This article argues that OpenAI is not the revolutionary AI powerhouse it's portrayed to be, but rather a strategically unfocused and desperate AI startup masked by hype and massive funding. The author contends that OpenAI lacks a coherent vision, chasing too many disparate ventures like social media, productivity software, a jobs portal, advertising, cloud computing, hardware, and a browser, all while relying heavily on media leaks to inflate its valuation.\n\nThe core of OpenAI's business, ChatGPT, is deemed a mere \"wrapper\" around LLMs, and the company's API sales are underwhelming, indicating limited real-world integration of its models. The author criticizes the disappointing GPT-5 upgrade and questions the usefulness of OpenAI's expensive R&D, particularly given the inherent limitations of LLMs, such as hallucinations.\n\nThe author posits that OpenAI's slowing revenue growth, commoditized products, and reliance on a \"mythology\" of innovation are signs of a struggling company. Its business model primarily relies on ChatGPT subscriptions, yet it burns through exorbitant amounts of cash. Ultimately, the author suggests that OpenAI is an exploitative \"grift\" led by a charismatic but ultimately misleading CEO, Sam Altman, desperately trying to find sustainable ways to monetize generative AI amidst an industry that struggles to turn a profit. The conclusion is that OpenAI is likely to miss its revenue projections and burn even more cash than anticipated, despite the hype.\n",
    "chinese_title": "OpenAI不过是一家平庸且孤注一掷的AI初创公司",
    "chinese_summary": "本文认为，OpenAI并非其宣扬的那样是一家具有革命性的人工智能巨头，而是一家被炒作和巨额融资所掩盖的战略不集中且绝望的人工智能初创公司。作者认为，OpenAI缺乏连贯的愿景，追逐着太多不同的项目，如社交媒体、生产力软件、招聘门户、广告、云计算、硬件和浏览器，同时严重依赖媒体泄露来抬高其估值。\n\nOpenAI的核心业务ChatGPT被认为是LLM的简单“包装”，其API销售额表现平平，表明其模型在现实世界中的集成有限。作者批评了令人失望的GPT-5升级，并质疑OpenAI昂贵的研发的效用，特别是考虑到LLM固有的局限性，例如幻觉。\n\n作者认为，OpenAI营收增长放缓、产品商品化以及对创新“神话”的依赖，都是一家苦苦挣扎的公司的迹象。它的商业模式主要依赖于ChatGPT订阅，但却消耗了巨额资金。最终，作者认为OpenAI是由一位魅力非凡但最终具有误导性的CEO，Sam Altman领导的剥削性“骗局”，正在绝望地寻找可持续的方式来将生成式AI货币化，而整个行业都在努力实现盈利。结论是，尽管有炒作，OpenAI很可能会错过其收入预测，并消耗比预期更多的资金。"
  },
  {
    "id": "45458948",
    "title": "Fp8 runs ~100 tflops faster when the kernel name has \"cutlass\" in it",
    "url": "https://github.com/triton-lang/triton/pull/7298",
    "summary": "This GitHub issue discusses performance improvements to a Triton-based attention kernel, specifically focused on using FP8 data type. The author, Mogball, implemented persistent attention, which improved performance at low context lengths. However, they discovered a peculiar phenomenon: FP8 performance significantly increased (around 100 TFLOPS) when the kernel name contained the substring \"cutlass\".\n\nPerformance benchmarks are presented comparing \"triton-fp16\" and \"triton-fp8\" implementations for causal and non-causal attention with different context lengths (N_CTX) and embedding dimensions (D). Initial results show that persistent attention negatively impacted performance on fp16 and the \"cutlass\" naming trick provides a significant boost to fp8 performance.\n\nReviewers expressed surprise and curiosity about the kernel naming dependency. It was discovered through disassembly of `ptxas` (Nvidia's PTX assembler) that the compiler indeed contains hardcoded logic to apply specific optimizations based on the presence of \"cutlass\" in the kernel name.\n\nThe discussion concludes that this \"cutlass\" optimization is likely an unstable, experimental feature by NVIDIA. There are concerns of stability if forced (through patching `ptxas`). Suggestions are made to Nvidia to provide a more formal way to enable this optimization, such as a PTX directive.\n",
    "chinese_title": "当内核名称包含“cutlass”时，Fp8的运行速度大约快100 tflops。",
    "chinese_summary": "此GitHub议题讨论了基于Triton的Attention Kernel的性能改进，特别关注使用FP8数据类型。作者Mogball实现了持久性Attention，提升了短上下文长度下的性能。然而，他们发现了一个奇怪的现象：当内核名称包含子字符串“cutlass”时，FP8性能显著提升（约100 TFLOPS）。\n\n性能基准测试比较了“triton-fp16”和“triton-fp8”在不同上下文长度 (N_CTX) 和嵌入维度 (D) 下的因果和非因果Attention实现。初步结果表明，持久性Attention对fp16的性能产生了负面影响，而“cutlass”命名技巧显著提高了fp8的性能。\n\n审阅者对内核命名依赖性表示惊讶和好奇。通过反汇编 `ptxas` (Nvidia 的 PTX 汇编器) 发现，编译器确实包含硬编码逻辑，以根据内核名称中是否存在“cutlass”来应用特定的优化。\n\n讨论总结道，这种“cutlass”优化很可能是NVIDIA的一个不稳定的实验性功能。如果强制使用（通过修补`ptxas`），则存在稳定性问题。有人建议Nvidia提供一种更正式的方式来启用此优化，例如PTX指令。"
  },
  {
    "id": "45462713",
    "title": "CVE-2025-59489: Arbitrary Code Execution in Unity Runtime since 2017",
    "url": "https://flatt.tech/research/posts/arbitrary-code-execution-in-unity-runtime/",
    "summary": "This article details CVE-2025-59489, a vulnerability in the Unity Runtime affecting games and applications built on Unity 2017.1 and later. The vulnerability allows arbitrary code execution due to how Unity handles intents and command-line arguments passed to Unity applications. Specifically, a malicious intent can control the `xrsdk-pre-init-library` argument, enabling attackers to load arbitrary shared libraries (.so files) and execute malicious code within the context of the Unity application.\n\nThe author outlines two attack scenarios: local and remote. Locally, any malicious application on the same device can exploit the vulnerability. Remote exploitation requires specific conditions, including the application exporting a browsable activity and writing attacker-controlled content to its private storage. While SELinux restrictions mitigate most remote scenarios, the article explains potential bypasses.\n\nUnity has addressed this issue in versions 2019.1 and later and provided a Binary Patch tool. Developers are urged to update Unity, recompile, and republish their applications. The article concludes by highlighting the importance of understanding security implications in dependencies and promotes the author's company, GMO Flatt Security, for penetration testing and their AI security engineer, Takumi.\n",
    "chinese_title": "CVE-2025-59489：Unity Runtime自2017年起存在任意代码执行漏洞",
    "chinese_summary": "本文详细介绍了 CVE-2025-59489 漏洞，该漏洞存在于 Unity Runtime 中，影响基于 Unity 2017.1 及更高版本构建的游戏和应用程序。该漏洞允许任意代码执行，原因是 Unity 处理传递给 Unity 应用程序的 intents 和命令行参数的方式存在缺陷。具体而言，恶意 intent 可以控制 `xrsdk-pre-init-library` 参数，使攻击者能够加载任意共享库（.so 文件）并在 Unity 应用程序的上下文中执行恶意代码。\n\n作者概述了两种攻击场景：本地和远程。在本地，同一设备上的任何恶意应用程序都可以利用此漏洞。远程利用需要满足特定条件，包括应用程序导出可浏览的 activity 并将攻击者控制的内容写入其私有存储。虽然 SELinux 限制缓解了大多数远程场景，但本文解释了可能的绕过方法。\n\nUnity 已在 2019.1 及更高版本中解决了此问题，并提供了二进制补丁工具。强烈建议开发人员更新 Unity、重新编译并重新发布其应用程序。文章最后强调了了解依赖项中的安全隐患的重要性，并推广了作者所在公司 GMO Flatt Security 的渗透测试及其 AI 安全工程师 Takumi。"
  },
  {
    "id": "45462143",
    "title": "A Thermometer for Measuring Quantumness",
    "url": "https://www.quantamagazine.org/a-thermometer-for-measuring-quantumness-20251001/",
    "summary": "This article explores the intriguing concept of \"anomalous heat flow,\" where heat travels from cold to hot objects due to quantum mechanics, seemingly defying the second law of thermodynamics. It highlights research by Alexssandre de Oliveira Jr. and colleagues who propose using this anomalous heat flow as a \"thermometer\" for detecting quantum phenomena like superposition and entanglement without destroying them.\n\nThe article explains the connection between thermodynamics and information, referencing Maxwell's demon and Landauer's principle, which demonstrates that erasing information requires energy. Quantum mechanics introduces complexities because information can be processed in ways that classical physics can't. Entanglement, where quantum objects have interdependent states, allows for more efficient manipulation, as demonstrated by the work of Brukner, Vedral, and Partovi.\n\nThe key innovation lies in using a \"quantum memory\" (a Maxwell's demon-like system) to mediate heat flow between a quantum system and a heat sink. The quantum memory, entangled with both, catalyzes heat transfer, converting entanglement within the quantum system into extra heat in the sink. Measuring the heat sink's energy reveals the presence of entanglement without directly measuring (and thus destroying) the quantum system.\n\nThis method offers a simple and general way to verify the quantumness of devices, like quantum computers, and potentially probe quantum aspects of gravity. While requiring precise control and not detecting all entangled states, it presents a promising avenue for quantum diagnostics.\n",
    "chinese_title": "测量量子性的温度计",
    "chinese_summary": "本文探讨了“反常热流”这一引人入胜的概念，即由于量子力学，热量从冷物体流向热物体，看似违反了热力学第二定律。文章重点介绍了Alexssandre de Oliveira Jr.及其同事的研究，他们提出使用这种反常热流作为“温度计”来检测叠加态和纠缠等量子现象，且不会破坏它们。\n\n文章解释了热力学与信息之间的联系，提到了麦克斯韦妖和兰道尔原理，该原理表明擦除信息需要能量。量子力学引入了复杂性，因为信息可以以经典物理学无法实现的方式进行处理。纠缠，即量子物体具有相互依赖的状态，可以实现更高效的操纵，正如Brukner、Vedral和Partovi的研究所示。\n\n关键创新在于使用“量子存储器”（类似于麦克斯韦妖的系统）来调节量子系统和散热器之间的热流。量子存储器与两者纠缠，催化热传递，将量子系统中的纠缠转化为散热器中的额外热量。测量散热器的能量可以揭示纠缠的存在，而无需直接测量（从而破坏）量子系统。\n\n这种方法提供了一种简单通用的方法来验证量子设备的量子性，例如量子计算机，并有可能探测引力的量子方面。虽然需要精确控制且无法检测所有纠缠态，但它为量子诊断提供了一条有希望的途径。"
  },
  {
    "id": "45459233",
    "title": "In Praise of RSS and Controlled Feeds of Information",
    "url": "https://blog.burkert.me/posts/in_praise_of_syndication/",
    "summary": "This article champions RSS (Really Simple Syndication) as a superior alternative to algorithmic feeds for consuming online content. The author argues that social media platforms prioritize engagement and ad revenue over providing balanced and controlled information, leading to a \"miserable\" media diet. RSS, in contrast, offers users full control over their information sources and a reverse-chronological feed of updates from websites they choose.\n\nThe author shares a personal anecdote about their disillusionment with Facebook for following bands, highlighting the platform's engagement-bait and pay-to-play model. They detail their own RSS journey, currently using the FeedMe app on their phone, and emphasize the benefits of choosing content upfront, consuming longer-form articles, and categorizing interests. RSS readers offer a consistent, distraction-free reading experience, avoiding the visual clutter and engagement traps found on many websites.\n\nThe article provides practical tips for getting started with RSS, including looking for RSS icons on websites, using tools like Muspy for tracking new music releases, and starting with user-friendly aggregators like The Old Reader or Feedly. It also suggests creating categories, utilizing offline reading capabilities, exploring advanced RSS APIs for specific content filtering (like on arXiv), and regularly cleaning up subscriptions. Finally, it recommends resources for finding popular RSS feeds to begin building a personalized information ecosystem.\n",
    "chinese_title": "赞美RSS和可控的信息流",
    "chinese_summary": "本文提倡使用RSS（简易信息聚合）作为比算法推荐更优越的在线内容获取方式。作者认为，社交媒体平台优先考虑用户参与度和广告收入，而非提供平衡和可控的信息，导致了“糟糕”的媒体饮食。相比之下，RSS允许用户完全控制信息来源，并按照时间倒序显示其选择的网站的更新。\n\n作者分享了自己对使用Facebook关注乐队感到失望的个人经历，突出了该平台的诱导互动和付费推广模式。他们详细介绍了自己的RSS之旅，目前在手机上使用FeedMe应用程序，并强调了预先选择内容、阅读较长文章以及对兴趣进行分类的好处。RSS阅读器提供一致、无干扰的阅读体验，避免了许多网站上的视觉混乱和参与陷阱。\n\n本文提供了开始使用RSS的实用技巧，包括在网站上寻找RSS图标、使用Muspy等工具跟踪新音乐发行，以及从The Old Reader或Feedly等用户友好的聚合器开始。它还建议创建类别、利用离线阅读功能、探索用于特定内容过滤的高级RSS API（例如在arXiv上）以及定期清理订阅。最后，它推荐了一些资源，用于查找流行的RSS源，以开始构建个性化的信息生态系统。"
  },
  {
    "id": "45435283",
    "title": "Glide, an extensible, keyboard-focused web browser",
    "url": "https://blog.craigie.dev/introducing-glide/",
    "summary": "Glide is a new, keyboard-focused, and highly customizable web browser forked from Firefox. The key differentiator is its TypeScript configuration that allows users to deeply modify the browser's behavior and UI without the limitations of traditional browser extensions.\n\nUnlike extensions with security restrictions, Glide's config allows full control, including defining custom key mappings, accessing web extension APIs, and spawning external processes. It uses the concept of \"modes\" like (neo)vim to apply different keymaps based on context (e.g., normal, insert, ignore). A hint mode enables keyboard-only navigation of web pages.\n\nThe author built Glide to overcome the restrictions of web extensions like Tridactyl. Glide allows customizing the browser UI itself and integrating with other tools. Key features include focusing the largest input field with \"gI\", a tab fuzzy finder using \"<space><space>\", tab navigation with \"<c-i>\" and \"<c-o>\", an in-browser REPL, and a which-key inspired UI to display configured keybinds.\n\nGlide is currently in early alpha, available for macOS and Linux. The author has been using it daily for six months.\n",
    "chinese_title": "Glide，一款可扩展、以键盘操作为主的网页浏览器",
    "chinese_summary": "Glide：一款基于键盘操作、高度可定制的浏览器"
  },
  {
    "id": "45465091",
    "title": "Ants Trapped in a Soviet Nuclear Bunker Survived for Years",
    "url": "https://www.sciencealert.com/ants-trapped-in-an-old-soviet-nuclear-bunker-survived-for-years-by-turning-on-their-own",
    "summary": "In a dismantled Soviet nuclear bunker in Poland, researchers discovered a large colony of wood ants (Formica polyctena) trapped and surviving in complete darkness without a queen or typical resources. The colony, numbering up to a million live workers and several million dead, was not reproducing. Instead, its population was sustained by ants falling from a larger colony above, through a rusted ventilation pipe connecting the bunker to the forest.\n\nInitially puzzled by the ants' survival despite the lack of light, heat, and food, researchers determined the ants were cannibalizing their dead nest mates. An examination of corpses found in 'cemeteries' within the bunker revealed that approximately 93% of the bodies had bite marks and gnawed holes, indicating mass consumption.\n\nThe researchers concluded that the constant influx of new workers from the upper nest and the consumption of nestmate corpses provided an inexhaustible food source, allowing the bunker colony to survive in otherwise extremely unfavorable conditions. The ants' resilience highlighted their remarkable ability to adapt and endure adversity.\n\nIn 2016, researchers installed a wooden boardwalk connecting the ventilation pipe to the bunker floor, providing an escape route for the trapped ants. Within months, the ants deserted the bunker floor, ending their reliance on cannibalism. Now, any ants falling into the bunker can simply walk back to the colony above.\n",
    "chinese_title": "被困在苏联核掩体中的蚂蚁存活多年",
    "chinese_summary": "在波兰一处废弃的苏联核掩体中，研究人员发现了一个大型的林蚁（Formica polyctena）群落，它们被困在完全黑暗的环境中，没有蚁后或典型资源，却奇迹般地生存了下来。这个群落数量高达一百万只活工蚁和数百万只死蚁，并没有繁殖。相反，它们的种群是通过从上方更大的蚁群中掉下来的蚂蚁来维持的，这些蚂蚁是通过连接掩体和森林的锈蚀通风管道掉进来的。\n\n最初，研究人员对蚂蚁在缺乏光、热和食物的情况下还能生存感到困惑，后来确定这些蚂蚁在同类相食，啃食死去的同伴。对掩体内的“墓地”中发现的尸体进行检查后显示，大约93%的尸体有咬痕和啮咬的洞，表明存在大规模的同类相食现象。\n\n研究人员得出结论，来自上方巢穴的源源不断的新工蚁和对同伴尸体的消费提供了取之不尽的食物来源，使得这个掩体群落能够在极其不利的条件下生存下来。蚂蚁的韧性凸显了它们非凡的适应和忍受逆境的能力。\n\n2016年，研究人员安装了一个木制栈道，将通风管道连接到掩体地面，为被困的蚂蚁提供了一条逃生路线。几个月内，这些蚂蚁就离开了掩体地面，结束了它们对同类相食的依赖。现在，任何掉进掩体的蚂蚁都可以轻松地走回上方的蚁群。"
  },
  {
    "id": "45419780",
    "title": "Low-dose radiation offers relief to people with knee osteoarthritis",
    "url": "https://www.astro.org/news-and-publications/news-and-media-center/news-releases/2025/low-dose-radiation-therapy-offers-substantial-relief-to-people-with-painful-knee-osteoarthritis",
    "summary": "**Summary:**\n\nAccording to research presented at the American Society for Radiation Oncology (ASTRO) Annual Meeting, low-dose radiation therapy (LDRT) provides significant pain relief and functional improvement for individuals suffering from knee osteoarthritis (OA). The study, a meta-analysis of several clinical trials, demonstrated that LDRT is a safe and effective non-invasive treatment option for knee OA, offering benefits comparable to other conventional treatments without the risks associated with surgery or strong pain medications.\n\nThe research found that LDRT significantly reduced pain scores and improved joint function in patients with knee OA compared to a placebo or sham treatment. The positive effects were observed to persist for a sustained period after the treatment. While the exact mechanism of action is still being investigated, researchers believe that LDRT reduces inflammation in the joint, leading to pain relief and improved mobility.\n\nThe study authors emphasize that LDRT could offer a valuable alternative for patients who have not found sufficient relief from other conservative treatments or who are not suitable candidates for surgery. The results highlight the potential of LDRT as a promising therapeutic option for managing the debilitating symptoms of knee osteoarthritis. Further research is ongoing to optimize treatment protocols and identify the patients who would benefit most from this approach.\n",
    "chinese_title": "低剂量辐射缓解膝骨关节炎患者的症状",
    "chinese_summary": "**摘要：**\n\n根据美国放射肿瘤学会（ASTRO）年会上发布的研究，低剂量放射治疗（LDRT）可为膝骨关节炎（OA）患者提供显著的疼痛缓解和功能改善。这项研究是对多项临床试验的荟萃分析，表明LDRT是一种安全有效的膝骨关节炎非侵入性治疗选择，其益处与其他传统疗法相当，且没有与手术或强效止痛药相关的风险。\n\n研究发现，与安慰剂或假治疗相比，LDRT显著降低了膝骨关节炎患者的疼痛评分并改善了关节功能。观察到积极作用在治疗后持续存在一段时间。虽然确切的作用机制仍在研究中，但研究人员认为LDRT可减少关节炎症，从而缓解疼痛并改善活动能力。\n\n研究作者强调，对于那些未从其他保守治疗中获得充分缓解或不适合手术的患者，LDRT可能提供一种有价值的替代方案。结果突显了LDRT作为一种有前景的治疗选择，可用于控制膝骨关节炎的衰弱症状。目前正在进行进一步的研究，以优化治疗方案并确定最能从这种方法中受益的患者。"
  },
  {
    "id": "45435375",
    "title": "The Beer Can (2023)",
    "url": "https://brr.fyi/posts/beer-can",
    "summary": "This article celebrates the \"Beer Can\" at the South Pole Station, a vital piece of infrastructure connecting the above-ground living zone with the below-ground industrial zone. The author highlights the stark contrast between these two areas: the modern, comfortable elevated station versus the utilitarian, older \"Arches\" buried deep beneath the snow.\n\nThe elevated station, dedicated in 2008, houses all the living amenities like berthing, dining, and recreation. In contrast, the Arches contain essential industrial infrastructure, including power generation, water filtration, warehousing, and heavy equipment maintenance.\n\nThe Beer Can is a 50-foot corrugated metal cylinder and stairwell that bridges the elevation difference between the two zones, a consequence of the station's gradual burial under accumulating snow. It features freezer doors to separate the heated living area from the unheated Beer Can and Arches. It contains 90 stairs alongside a freight elevator, crucial for moving supplies and waste.\n\nThe author emphasizes the physical challenge of traversing the Beer Can's stairs, especially given the high altitude. This has led to the quirky tradition of \"doing beer cans\" as a form of exercise.\n\nUltimately, the Beer Can is presented not just as a stairwell but as a conceptual boundary, separating the comforts of living from the essential work of maintaining the South Pole Station.\n",
    "chinese_title": "啤酒罐 (2023)",
    "chinese_summary": "本文赞颂南极站的“啤酒罐”，它是连接地上生活区与地下工业区的重要基础设施。作者着重强调了这两个区域之间的鲜明对比：现代化、舒适的地上站与实用主义的、埋藏在厚厚冰雪之下的老旧“拱顶”。\n\n于2008年启用的地上站，容纳了所有生活设施，如住宿、餐饮和娱乐。相比之下，拱顶则包含重要的工业基础设施，包括发电、水过滤、仓储和重型设备维护。\n\n“啤酒罐”是一个50英尺长的波纹金属圆柱体和楼梯间，连接了这两个区域的高度差，这是由于南极站逐渐被不断积聚的冰雪掩埋造成的。它设有冷藏门，用于隔离加热的生活区与未加热的“啤酒罐”和拱顶。它包含90级台阶以及一个货运电梯，对于运输物资和废物至关重要。\n\n作者强调了穿越“啤酒罐”楼梯的身体挑战，尤其是在高海拔地区。这导致了“做啤酒罐”这种作为一种锻炼方式的奇特传统。\n\n最终，“啤酒罐”不仅仅被视为一个楼梯间，更被视为一个概念边界，分隔了舒适的生活和维持南极站正常运转的必要工作。"
  },
  {
    "id": "45417070",
    "title": "Small Near-Earth Objects in the Taurid Resonant Swarm",
    "url": "https://arxiv.org/abs/2509.22602",
    "summary": "This paper, titled \"Small Near-Earth Objects in the Taurid Resonant Swarm,\" investigates the population of asteroid-sized objects within the Taurid Resonant Swarm (TRS), a dynamically concentrated debris region associated with the Taurid Complex. The authors, led by Quanzhi Ye, analyze data from a Zwicky Transient Facility (ZTF) campaign during the 2022 TRS encounter.\n\nThe research aims to determine if the known abundance of sub-meter-sized particles in the TRS extends to larger objects. Their findings suggest the potential presence of approximately 100 Tunguska-sized objects and 1,000 Chelyabinsk-sized objects within the TRS. This estimate of Chelyabinsk-sized objects aligns with previous derivations from bolide records. Based on these numbers, the authors estimate an impact frequency of less than once every 4 million years.\n\nHowever, the authors emphasize that these results are based on the assumption that the orbital distribution of asteroids in the TRS mirrors that of the smaller, fireball-sized meteoroids, which remains unverified. The paper proposes that future wide-field facilities, such as the Vera C. Rubin Observatory, could play a crucial role in validating these findings by observing close approaches of the TRS in the 2020s and 2030s, thereby better constraining the size distribution of asteroid-sized objects within the swarm. The paper has been accepted for publication in Acta Astronautica as part of the PDC 2025 Special Issue.\n",
    "chinese_title": "金牛座共振群中的小型近地天体",
    "chinese_summary": "题为“金牛座共振群中的小型近地天体”的论文研究了金牛座共振群（TRS）内的小行星级天体群，该区域是与金牛座复合体相关的动态聚集的碎片区域。由叶泉志领导的作者分析了2022年TRS遭遇期间来自兹维基瞬变设施（ZTF）活动的数据。\n\n该研究旨在确定TRS中已知存在的亚米级粒子丰度是否也适用于更大的天体。他们的研究结果表明，TRS内可能存在约100个通古斯卡大小的天体和1000个车里雅宾斯克大小的天体。这种对车里雅宾斯克大小天体的估计与之前从火流星记录中得出的结果一致。基于这些数字，作者估计撞击频率低于每400万年一次。\n\n然而，作者强调，这些结果是基于TRS中小行星的轨道分布与较小的火球大小的流星体相似的假设，这一假设尚未得到证实。该论文提出，未来的广域观测设施，如维拉·C·鲁宾天文台，可以通过在2020年代和2030年代观测TRS的近距离接近来验证这些发现，从而更好地约束星群中小行星级天体的大小分布，从而发挥关键作用。该论文已被《宇航学报》接受发表，作为PDC 2025特刊的一部分。"
  },
  {
    "id": "45457670",
    "title": "I spent the day teaching seniors how to use an iPhone",
    "url": "https://forums.macrumors.com/threads/i-spent-the-day-trying-to-teach-seniors-how-to-use-an-iphone-and-it-was-a-nightmare.2468117/",
    "summary": "The author, scaramoosh, recounts their frustrating experience teaching seniors how to use iPhones. They believe iPhones are overly complex for the elderly, despite accessibility features, and that Apple needs to simplify the user experience. The initial setup process was a significant hurdle, with seniors struggling to create accounts, understand passcodes (even familiar birthdays), and use Touch ID or Face ID.\n\nThe author notes the abundance of apps, the phone app's lack of a default keypad, and the sensitivity of the touch screen as contributing factors to the confusion. Seniors struggled with accidental actions due to difficulty holding the phone steady. While Assistive Access helped, the author argues it should be a standard setup option for users over 65. They feel features like passcodes and extensive information are unnecessary for this demographic.\n\nThe author also points out issues with the \"fake\" Touch ID button and swipe gestures on Face ID phones, as the lack of tactile feedback made them difficult to use. Ultimately, the training failed because the seniors couldn't even manage the iPhones' basic unlocking functions. The underlying problem was the pocket dialing of 999 (emergency services) on their old Nokia phones. The author concluded that simple flip phones with call-answering/ending upon opening/closing are a better solution, albeit difficult to find without unnecessary features. The post ends with a plea for Apple to improve accessibility and reduce the fiddly nature of their phones for senior citizens.\n",
    "chinese_title": "我花了一天教老年人如何使用iPhone。",
    "chinese_summary": "作者scaramoosh讲述了他们教老年人使用iPhone的沮丧经历。他们认为，尽管有辅助功能，但iPhone对老年人来说过于复杂，苹果需要简化用户体验。最初的设置过程是一个重大障碍，老年人在创建账户、理解密码（即使是熟悉的生日）以及使用Touch ID或Face ID方面都感到困难。\n\n作者指出，应用程序过多、电话应用缺少默认键盘以及触摸屏的敏感性是造成困惑的原因。由于难以稳定握住手机，老年人很容易发生误操作。虽然辅助访问有所帮助，但作者认为这应该是65岁以上用户的标准设置选项。他们认为密码和大量信息对这个群体来说是不必要的。\n\n作者还指出了“假”Touch ID按钮和Face ID手机上的滑动手势的问题，因为缺乏触觉反馈使它们难以使用。最终，培训失败了，因为老年人甚至无法掌握iPhone的基本解锁功能。根本问题是他们以前的诺基亚手机上的口袋拨号999（紧急服务）。作者的结论是，简单的翻盖手机，开盖接听/关盖结束通话，是更好的解决方案，尽管很难找到没有不必要功能的。文章最后呼吁苹果改进辅助功能，并减少其手机对老年人的繁琐操作。"
  },
  {
    "id": "45435608",
    "title": "Radicle: Peer-to-Peer Collaboration with Git (2024)",
    "url": "https://lwn.net/Articles/966869/",
    "summary": "This LWN.net article introduces Radicle, a peer-to-peer collaboration platform built on Git, offering a decentralized alternative to centralized forges like GitHub and GitLab. Radicle aims to solve the single point of failure and potential censorship issues associated with centralized systems.\n\nRadicle works by having each user run a node that stores copies of repositories and synchronizes changes with other nodes. It adds support for issues and pull requests (\"patches\") directly within the Git repository. While it may look similar to the mainstream forges, the main difference is that all users are able to clone the project using the command line interface and a web user interface.\n\nKey features include self-signing repositories, ensuring authenticity regardless of storage location, and a \"collaborative object\" (COB) mechanism for conflict-free merging of issue and patch data.  The platform utilizes a gossip protocol for node and repository discovery and the Git v2 smart transfer protocol for content exchange. Radicle addresses the NAT issue via publicly accessible seed nodes.\n\nWhile still under development, Radicle faces challenges like mature CI/CD support, a more versatile identity system, code review functionality, and making it easier for users unfamiliar with Radicle to report issues. It also is in need of a solid code moderation system to prevent issues like malicious code being pushed and pulled from git repos.\n\nThe article concludes that Radicle presents a promising decentralized Git hosting solution.\n",
    "chinese_title": "Radicle：基于Git的P2P协作 (2024)",
    "chinese_summary": "这篇 LWN.net 文章介绍了 Radicle，一个构建在 Git 上的点对点协作平台，它为像 GitHub 和 GitLab 这样的中心化代码托管平台提供了一种去中心化的替代方案。Radicle 旨在解决中心化系统相关的单点故障和潜在审查问题。\n\nRadicle 的工作方式是让每个用户运行一个节点，该节点存储仓库的副本并与其他节点同步更改。它直接在 Git 仓库中增加了对议题（issues）和拉取请求（“补丁”）的支持。虽然它可能看起来类似于主流的代码托管平台，但主要区别在于所有用户都能够使用命令行界面和 Web 用户界面克隆项目。\n\n主要特性包括自签名仓库，确保无论存储位置如何都能保证真实性，以及用于无冲突合并议题和补丁数据的“协作对象”（COB）机制。该平台利用 gossip 协议进行节点和仓库发现，并利用 Git v2 智能传输协议进行内容交换。Radicle 通过公开可访问的种子节点解决了 NAT 问题。\n\n虽然仍在开发中，但 Radicle 面临着诸如成熟的 CI/CD 支持、更通用的身份系统、代码审查功能以及使不熟悉 Radicle 的用户更容易报告问题等挑战。它还需要一个可靠的代码审核系统，以防止恶意代码被推送和拉取到 git 仓库等问题。\n\n文章总结说，Radicle 呈现了一个有前景的去中心化 Git 托管解决方案。"
  },
  {
    "id": "45436148",
    "title": "Kairos: Immutable Distro for K8s at the Edge",
    "url": "https://kairos.io/",
    "summary": "Kairos is an immutable Linux distribution designed for running Kubernetes at the edge. It allows users to build custom bootable OS images for edge devices by choosing their desired OS and Kubernetes distribution, delivered as customizable container images. Key benefits include consistency across clusters via immutable images, enhanced security through reduced attack surfaces and data encryption, and simplified installation methods.\n\nKairos is optimized for Kubernetes workloads and supports upgrades via Kubernetes and uses cloud-init for configuration management. It is a Cloud Native Computing Foundation sandbox project.\n\nThe distribution offers X86 and RPi4 versions, downloadable as Docker images. It is being used by companies like DeEEP Network for secure systems with trusted boot. Spectro Cloud provides enterprise-grade Kubernetes management for Kairos through their Palette platform.\n\nThe article promotes community engagement through GitHub and LinkedIn and invites adopters to contact them. It also provides links to installation guides, architecture details, and usage examples.\n",
    "chinese_title": "Kairos：边缘 K8s 的不可变发行版",
    "chinese_summary": "Kairos：专为边缘 Kubernetes 打造的不可变 Linux 发行版。它允许用户通过选择所需的操作系统和 Kubernetes 发行版，构建用于边缘设备的可定制可引导操作系统镜像，这些都以可定制的容器镜像形式提供。主要优势包括：通过不可变镜像实现集群间的一致性，通过减少攻击面和数据加密来增强安全性，以及简化安装方法。\n\nKairos 针对 Kubernetes 工作负载进行了优化，支持通过 Kubernetes 进行升级，并使用 cloud-init 进行配置管理。它是一个云原生计算基金会沙箱项目。\n\n该发行版提供 X86 和 RPi4 版本，可作为 Docker 镜像下载。DeEEP Network 等公司正在使用它来构建具有可信启动的安全系统。Spectro Cloud 通过其 Palette 平台为 Kairos 提供企业级 Kubernetes 管理。\n\n本文鼓励通过 GitHub 和 LinkedIn 进行社区参与，并邀请采用者与他们联系。同时提供了安装指南、架构细节和使用示例的链接。"
  },
  {
    "id": "45451527",
    "title": "Signal Protocol and Post-Quantum Ratchets",
    "url": "https://signal.org/blog/spqr/",
    "summary": "This article discusses the integration of post-quantum cryptography into the Signal Protocol through the introduction of the Sparse Post Quantum Ratchet (SPQR), enhancing its resilience against future quantum computing threats while preserving forward secrecy (FS) and post-compromise security (PCS).\n\nThe current Signal Protocol uses hash functions (quantum-safe) for FS and elliptic-curve Diffie-Hellman (ECDH) (not quantum-safe) for PCS. SPQR adds a regularly advancing post-quantum ratchet that is mixed with Signal's existing Double Ratchet to form a \"Triple Ratchet\".\n\nThe key idea is to continuously generate and mix in secrets derived from quantum-secure Key-Encapsulation Mechanisms (KEMs). A naive implementation of KEMs, involving large encapsulation keys (EKs) and ciphertexts (CTs) sent with every message, is inefficient. The article explores solutions to address these issues, focusing on state machines and strategies for conserving bandwidth.\n\nTo mitigate the large data size, the article proposes sending EKs and CTs in chunks, using erasure codes. Erasure codes allow the reconstruction of the original message (EK or CT) even if some chunks are lost, mitigating the impact of message loss or malicious middleman attacks dropping specific chunks. The article also touches upon the efficient utilization of messaging capacity by noting that while Alice is sending chunks of EK, Bob has no data to send so this capacity is unused and should be used more often to speed up protocol.\n",
    "chinese_title": "信号协议与后量子棘轮",
    "chinese_summary": "本文探讨了通过引入稀疏后量子棘轮（SPQR）将后量子密码学集成到Signal协议中的方法，从而增强其抵抗未来量子计算威胁的能力，同时保持前向安全性（FS）和后泄露安全性（PCS）。\n\n目前的Signal协议使用哈希函数（量子安全）来实现FS，并使用椭圆曲线Diffie-Hellman（ECDH）（非量子安全）来实现PCS。 SPQR增加了一个定期推进的后量子棘轮，该棘轮与Signal现有的双棘轮混合，形成一个“三棘轮”。\n\n其核心思想是持续生成并混合来自量子安全密钥封装机制（KEM）的密钥。 KEM的简单实现方式，即每次消息都发送大量的封装密钥（EK）和密文（CT），效率低下。 本文探讨了解决这些问题的方法，重点关注状态机和节省带宽的策略。\n\n为了缓解数据量大的问题，本文提出以块的形式发送EK和CT，并使用纠删码。 即使丢失了一些块，纠删码也允许重建原始消息（EK或CT），从而减轻消息丢失或恶意中间人攻击丢弃特定块的影响。本文还提到了对消息容量的有效利用，并指出当Alice发送EK块时，Bob没有数据要发送，因此该容量未被使用，应该更频繁地使用以加速协议。"
  },
  {
    "id": "45455882",
    "title": "The strangest letter of the alphabet: The rise and fall of yogh",
    "url": "https://www.deadlanguagesociety.com/p/history-of-letter-yogh",
    "summary": "Colin Gorrie's article explores the history of the obscure medieval letter \"yogh\" (ȝ) and its impact on the complexities of English spelling. It starts by outlining the confusing nature of English spelling, with silent letters and multiple pronunciations.\n\nThe article traces the evolution of the letter 'g' from the Old English insular 'ᵹ' to the Carolingian 'g,' used for Latin. The Norman invasion further complicated things, as Norman scribes introduced new writing traditions. This led to the re-emergence of yogh (ȝ), derived from the insular 'ᵹ,' as a distinct letter in Middle English.\n\nYogh was used to represent two sounds: the \"y\" sound and the \"gh\" sound (as in \"loch\"). This duality mirrored the inconsistencies already present with the letters 'c' and 'g,' which also have dual pronunciations due to palatalization, a sound change where back-of-the-mouth sounds shift forward.\n\nThe article explains that the \"gh\" sound originated from a Proto-Germanic sound, represented by 'ᵹ' in Old English. Norman scribes then adopted yogh to represent both the \"y\" and \"gh\" sounds that didn't exist in French. Despite its usefulness, yogh eventually disappeared from English due to the availability of alternative spellings and the standardization brought about by the printing press, which favored readily available typefaces. However, yogh persisted longer in Scotland, often represented by \"z\" due to visual similarity, leading to pronunciation changes in names like Menzies and Mackenzie. The author shows that although yogh caused some confusion, the history of yogh reveals valuable insights into the evolution of English writing.\n",
    "chinese_title": "字母表中最怪异的字母：约赫字母的兴衰",
    "chinese_summary": "科林·戈里的文章探讨了鲜为人知的中世纪字母“约赫”(ȝ)的历史及其对英语拼写复杂性的影响。文章首先概述了英语拼写的令人困惑之处，包括无声字母和多种发音。\n\n文章追溯了字母“g”从古英语的岛屿体“ᵹ”到用于拉丁语的卡洛林体“g”的演变。诺曼入侵使情况更加复杂，因为诺曼抄写员引入了新的书写传统。这导致了源自岛屿体“ᵹ”的约赫 (ȝ) 重新出现，成为中古英语中一个独特的字母。\n\n约赫用于表示两个声音： \"y\" 音和 \"gh\" 音（如 \"loch\" 中）。这种双重性反映了字母 \"c\" 和 \"g\" 已经存在的矛盾之处，由于颚化现象（一种后部发音前移的语音变化），它们也有双重发音。\n\n文章解释说，“gh” 音起源于原始日耳曼语中的一个声音，在古英语中用“ᵹ”表示。诺曼抄写员随后采用约赫来表示法语中不存在的“y”和“gh”音。尽管约赫很有用，但由于替代拼写方式的出现以及印刷术带来的标准化，约赫最终从英语中消失了，因为印刷术更喜欢容易获得的字体。然而，约赫在苏格兰持续的时间更长，通常用 \"z\" 表示，因为两者在视觉上相似，这导致了 Menzies 和 Mackenzie 等名字的发音变化。作者表明，虽然约赫造成了一些混乱，但约赫的历史揭示了对英语书写演变的宝贵见解。"
  },
  {
    "id": "45458122",
    "title": "FyneDesk: A full desktop environment for Linux written in Go",
    "url": "https://github.com/FyshOS/fynedesk",
    "summary": "FyneDesk is a Linux/Unix desktop environment built using the Fyne toolkit and the Go programming language, aiming for ease of use and development, following Material Design principles. It relies on external tools like arandr, xbacklight/brightnessctl, connman-gtk, and compton for a full desktop experience, although it can function, albeit degraded, without them.\n\nInstallation involves using `go get` to install the `fynedesk` command. To set it up as a selectable desktop option, the project needs to be cloned from GitHub, and `make` commands must be executed to install it within the login manager. The window manager components can be tested in an embedded X window using the `make embed` command if Xephyr is installed.\n\nThe `fynedesk_runner` utility is provided to enhance resilience, automatically recovering from crashes during alpha/beta testing. It can be installed via `go get`.\n\nThe design concepts and wallpapers are contributed by Jost Grant. For distributions shipping FyneDesk, bundling the \"fin\" display manager application is recommended. Developers are encouraged to notify the project if they package FyneDesk for their system.\n",
    "chinese_title": "FyneDesk: 用 Go 编写的 Linux 完整桌面环境",
    "chinese_summary": "FyneDesk 是一个使用 Fyne 工具包和 Go 编程语言构建的 Linux/Unix 桌面环境，旨在实现易用性和易开发性，并遵循 Material Design 原则。它依赖 arandr、xbacklight/brightnessctl、connman-gtk 和 compton 等外部工具来实现完整的桌面体验，尽管没有它们也可以运行，但体验会降低。\n\n安装涉及使用 `go get` 安装 `fynedesk` 命令。要将其设置为可选择的桌面选项，需要从 GitHub 克隆项目，并执行 `make` 命令将其安装在登录管理器中。如果安装了 Xephyr，可以使用 `make embed` 命令在嵌入式 X 窗口中测试窗口管理器组件。\n\n提供了 `fynedesk_runner` 实用程序来增强韧性，在 alpha/beta 测试期间自动从崩溃中恢复。可以通过 `go get` 安装它。\n\n设计理念和壁纸由 Jost Grant 贡献。对于发布 FyneDesk 的发行版，建议捆绑 “fin” 显示管理器应用程序。如果开发者为他们的系统打包了 FyneDesk，欢迎通知项目。"
  },
  {
    "id": "45435016",
    "title": "Amazon Vega OS and Vega Developer Tools",
    "url": "https://developer.amazon.com/apps-and-games/vega",
    "summary": "This Amazon Appstore Developer Portal page introduces Vega OS and Vega Developer Tools, focusing on enabling developers to create premium TV experiences. Vega OS is designed for the next generation of Fire TV Sticks and leverages React Native for development.\n\nKey points include:\n\n*   **Introduction to Vega OS and Tools:** Aimed at creating TV experiences with familiar tools and frameworks.\n*   **Vega Developer Tools:** These provide resources for developing, testing, and distributing apps on Vega OS, including CLI, Simulator, and VS Code Extension, as well as Vega Libraries & APIs for navigation, focus, and state management.\n*   **Leveraging Existing Skills:** Encourages React Native and web developers to use their existing skills to build for Vega OS.\n*   **Fire TV Integration:** Provides information on Fire TV design principles, hardware-specific elements, and service integrations.\n*   **Testing and Debugging:** Offers tools for debugging with Vega Studio and testing throughout the development cycle on simulators or physical devices, including Live App Testing.\n*   **App Distribution:** Guides developers through the process of preparing and submitting their apps for distribution, highlighting requirements, steps, and best practices.\n*   **Community Resources:** Provides access to reference apps, samples, release notes, and a developer newsletter.\n*   **Additional Resources:** Links to Fire tablet and TV device specs, monetization tools, the Developer Console, and various developer support channels.\n",
    "chinese_title": "Amazon Vega OS 和 Vega 开发者工具",
    "chinese_summary": "此Amazon应用商店开发者门户页面介绍Vega OS和Vega开发者工具，着重于帮助开发者创建优质的电视体验。Vega OS专为下一代Fire TV Stick设计，并利用React Native进行开发。\n\n要点包括：\n\n*   **Vega OS和工具介绍：** 旨在利用熟悉的工具和框架创建电视体验。\n*   **Vega开发者工具：** 这些工具提供在Vega OS上开发、测试和分发应用程序的资源，包括CLI、模拟器和VS Code扩展，以及用于导航、焦点和状态管理的Vega库和API。\n*   **利用现有技能：** 鼓励React Native和Web开发者使用其现有技能为Vega OS构建应用。\n*   **Fire TV集成：** 提供关于Fire TV设计原则、硬件特定元素和服务集成的信息。\n*   **测试与调试：** 提供使用Vega Studio进行调试以及在模拟器或物理设备上进行整个开发周期测试的工具，包括Live App Testing。\n*   **应用分发：** 指导开发者完成准备和提交应用程序以进行分发的过程，重点介绍要求、步骤和最佳实践。\n*   **社区资源：** 提供对参考应用程序、示例、发行说明和开发者新闻通讯的访问。\n*   **其他资源：** 链接到Fire平板电脑和电视设备规格、变现工具、开发者控制台和各种开发者支持渠道。"
  },
  {
    "id": "45449348",
    "title": "Potential issues in curl found using AI assisted tools",
    "url": "https://mastodon.social/@bagder/115241241075258997",
    "summary": "The article, likely a social media post from Daniel Stenberg, states that Joshua Rogers has sent a \"massive\" list of potential issues found in curl. It's a brief announcement indicating that curl, a widely used command-line tool for transferring data with URLs, may have some newly identified vulnerabilities or bugs. The post doesn't specify the nature of the issues or their severity, only that a large number of them have been reported. The context provided by the Mastodon message at the end suggests the user is viewing the content on the Mastodon website and needs JavaScript enabled or should consider using a dedicated Mastodon app. This is separate from the curl announcement itself. In summary, the core message is a preliminary notification that a significant number of potential problems have been identified within curl, prompting further investigation and potential fixes.\n",
    "chinese_title": "使用AI辅助工具发现的curl潜在问题",
    "chinese_summary": "丹尼尔·斯滕贝格可能发布了一篇社交媒体帖子，称约书亚·罗杰斯发送了一份“大量”的关于curl潜在问题的列表。这是一个简短的公告，表明curl这个广泛使用的命令行URL数据传输工具可能存在一些新发现的漏洞或错误。该帖子没有具体说明这些问题的性质或严重程度，仅说明已报告了大量问题。末尾的Mastodon消息提供的上下文表明用户正在Mastodon网站上查看内容，需要启用JavaScript，或者应该考虑使用专门的Mastodon应用程序。这与curl公告本身无关。总之，核心信息是一个初步通知，表明curl内部已发现大量潜在问题，需要进一步调查和潜在修复。"
  },
  {
    "id": "45464748",
    "title": "Divorce Plunged in Kentucky. Equal Custody for Fathers Is a Big Reason Why",
    "url": "https://www.wsj.com/us-news/law/the-equal-custody-experiment-41e1f7a6",
    "summary": "Here's a summary of the Wall Street Journal article \"Divorce Plunged in Kentucky. Equal Custody for Fathers Is a Big Reason Why\":\n\nThe article explores the significant drop in divorce rates in Kentucky following the implementation of a 2018 law that made shared (equal) parenting time the default arrangement in divorce cases involving children. The article posits that this change is a primary driver behind the decline.\n\nThe main argument is that the shift to equal custody discourages divorces by making the process less appealing and more financially burdensome for both parents. Knowing they will likely have to share custody and parenting time, potential divorcees are more hesitant to pursue separation, particularly when the children are young. This is because the law increases the disruption and cost associated with dividing time and resources.\n\nThe article highlights anecdotal evidence from lawyers and family court professionals in Kentucky, suggesting that the law has led to more thoughtful consideration of the consequences of divorce. Some attorneys report seeing fewer frivolous divorce filings.\n\nWhile proponents argue the law strengthens fathers' roles and ensures children benefit from both parents, some critics express concerns that it can force children into uncomfortable or even unsafe situations if equal custody is not in their best interest, particularly in cases involving domestic violence or neglect. The article acknowledges that the full long-term impact of the law remains to be seen, but suggests it represents a significant change in how divorce is viewed and approached in Kentucky.\n",
    "chinese_title": "肯塔基州离婚率骤降，父亲平分监护权是重要原因。",
    "chinese_summary": "以下是《华尔街日报》文章“肯塔基州离婚率骤降，父亲平等监护权是重要原因”的摘要：\n\n文章探讨了肯塔基州在2018年实施一项法律后离婚率显著下降的情况，该法律规定在涉及子女的离婚案件中，共同（平等）育儿时间是默认安排。文章认为，这一变化是离婚率下降的主要驱动因素。\n\n主要论点是，转向平等监护权通过使离婚过程对父母双方的吸引力降低、经济负担加重，从而抑制了离婚。潜在的离婚者知道他们很可能需要分享监护权和育儿时间，因此在寻求分居时更加犹豫，尤其是在孩子年幼时。这是因为该法律增加了划分时间和资源相关的干扰和成本。\n\n文章强调了来自肯塔基州律师和家庭法院专业人士的轶事证据，表明该法律导致人们更加深思熟虑地考虑离婚的后果。一些律师报告说，他们看到的轻率离婚案件减少了。\n\n虽然支持者认为该法律加强了父亲的作用，并确保儿童能从父母双方受益，但一些批评者担心，如果平等监护权不符合儿童的最佳利益，尤其是在涉及家庭暴力或忽视的案件中，该法律可能会迫使儿童进入不舒服甚至不安全的境地。文章承认，该法律的全部长期影响仍有待观察，但表明它代表了肯塔基州看待和处理离婚方式的重大变化。"
  },
  {
    "id": "45411435",
    "title": "Consistent hashing",
    "url": "https://eli.thegreenplace.net/2025/consistent-hashing/",
    "summary": "This article introduces consistent hashing, an algorithm designed to minimize the impact of resizing a hash table. It addresses the problem of naive hashing, where adding or removing nodes in a distributed system (like a caching web proxy) causes a complete reshuffling of keys, leading to widespread cache misses and performance degradation, especially during peak load.\n\nConsistent hashing solves this by mapping both nodes and items onto a unit circle. An item is assigned to the closest node in the clockwise direction. When a node is added or removed, only items that would have been assigned to that node are remapped, significantly reducing the overall disruption. This is the \"monotonicity property.\"\n\nThe article details an implementation approach using binary search in a sorted array to find the responsible node. A key practical consideration is \"quantizing\" the unit circle into a discrete range [0, ringSize) to avoid collisions.\n\nIt further discusses the issue of unbalanced item distribution across nodes, even with a good hash function. To mitigate this, the article presents the concept of \"virtual nodes,\" where each node is mapped to multiple locations on the circle. This improves distribution by averaging out the distances between nodes.\n\nThe appendix delves into the mathematics behind item distribution and the impact of virtual nodes on reducing variance in the number of items assigned to each node. The article includes a link to a GitHub repository with Go code implementations of consistent hashing, with and without virtual nodes.\n",
    "chinese_title": "一致性哈希",
    "chinese_summary": "本文介绍了 Consistent Hashing（一致性哈希），一种旨在最小化哈希表大小调整影响的算法。它解决了朴素哈希的问题，即在分布式系统（如缓存 Web 代理）中添加或删除节点会导致键的完全重新洗牌，从而导致大范围的缓存未命中和性能下降，尤其是在高峰负载期间。\n\nConsistent Hashing 通过将节点和项目都映射到单位圆上来解决这个问题。一个项目被分配给顺时针方向上最近的节点。当添加或删除节点时，只有会被分配给该节点的项目才会被重新映射，从而显著减少整体中断。这就是“单调性属性”。\n\n本文详细介绍了使用排序数组中的二分查找来查找负责节点的实现方法。一个关键的实际考虑是“量化”单位圆到一个离散范围 [0, ringSize) 以避免冲突。\n\n文章进一步讨论了即使使用良好的哈希函数，项目在节点间分布不均的问题。为了缓解这个问题，文章提出了“虚拟节点”的概念，即每个节点被映射到圆上的多个位置。这通过平均节点之间的距离来改善分布。\n\n附录深入探讨了项目分布背后的数学原理以及虚拟节点对减少分配给每个节点的项目数量的方差的影响。本文包含一个指向 GitHub 存储库的链接，该存储库包含 Consistent Hashing 的 Go 代码实现，包括带虚拟节点和不带虚拟节点的版本。"
  },
  {
    "id": "45451577",
    "title": "Playball – Watch MLB games from a terminal",
    "url": "https://github.com/paaatrick/playball",
    "summary": "Playball is a command-line tool that allows users to watch MLB games directly from their terminal, offering a discreet alternative to MLB Gameday and MLB.tv. It can be installed globally using npm (`npm install -g playball`) or run via Docker. The tool provides several views: a schedule view, a standings view, and the actual game view, navigable using keyboard shortcuts.\n\nThe schedule view allows browsing games and jumping to specific days, while the game view displays play-by-play information. Playball is highly configurable using the `playball config` subcommand. Users can customize colors for various game elements like balls, strikes, outs, and on-base runners. They can also set their favorite teams to be highlighted in the schedule and standings views.\n\nConfiguration options include settings like `color.ball`, `color.strike`, `color.out`, `color.on-base`, and `favorites`. Colors can be specified using standard color names (red, green, blue), prefixed variations (bright-green), hex codes (#FFA500), or \"default\". Favorites are set as comma-separated team abbreviations. Configuration values can be retrieved, changed, or reverted to defaults.  The project is open-source and welcomes contributions.\n",
    "chinese_title": "Playball – 在终端观看MLB比赛",
    "chinese_summary": "Playball 是一款命令行工具，用户可以通过终端直接观看 MLB 比赛，为 MLB Gameday 和 MLB.tv 提供了一种低调的替代方案。它可以使用 npm 全局安装 (`npm install -g playball`)，也可以通过 Docker 运行。该工具提供多种视图：赛程视图、积分榜视图和实际比赛视图，可以使用键盘快捷键进行导航。\n\n赛程视图允许浏览比赛和跳转到特定日期，而比赛视图则显示逐场比赛信息。Playball 可以使用 `playball config` 子命令进行高度配置。用户可以自定义各种游戏元素的颜色，例如好球、坏球、出局和垒上跑者。他们还可以设置自己喜欢的球队，以便在赛程和积分榜视图中突出显示。\n\n配置选项包括 `color.ball`、`color.strike`、`color.out`、`color.on-base` 和 `favorites` 等设置。颜色可以使用标准颜色名称（red、green、blue）、前缀变体（bright-green）、十六进制代码（#FFA500）或“default”来指定。收藏夹设置为逗号分隔的球队缩写。配置值可以检索、更改或恢复为默认值。该项目是开源的，欢迎贡献。"
  },
  {
    "id": "45462687",
    "title": "Amber Room",
    "url": "https://en.wikipedia.org/wiki/Amber_Room",
    "summary": "The Amber Room, a chamber adorned with amber panels, gold leaf, and mirrors, was originally created in Prussia in the early 18th century. Initially intended for Charlottenburg Palace, it was eventually gifted to Tsar Peter the Great of Russia and installed in the Catherine Palace near Saint Petersburg.  It was considered the \"Eighth Wonder of the World\".\n\nDuring World War II, the Amber Room was looted by Nazi Germany and taken to Königsberg, where it was displayed. As Allied forces approached, the room was disassembled and crated. However, Königsberg was heavily bombed in 1944, and the Amber Room's location and fate became a mystery.  The official Soviet report said the room was destroyed in the bombing between April 9-11, 1945.\n\nDespite numerous searches and theories about its survival and whereabouts, no definitive proof of its continued existence has been found. Some believe it was destroyed in the bombing of Königsberg, while others speculate it was hidden elsewhere.\n\nIn 1979, a project to reconstruct the Amber Room began at the Catherine Palace. After decades of work by Russian and German craftsmen, and with significant donations, the replica was completed and inaugurated in 2003.\n",
    "chinese_title": "琥珀屋",
    "chinese_summary": "琥珀屋，一个装饰着琥珀板、金箔和镜子的房间，最初于18世纪初在普鲁士创作。它最初是为夏洛滕堡宫设计的，后来被赠送给俄罗斯的彼得大帝，并安装在圣彼得堡附近的凯瑟琳宫。它被誉为“世界第八大奇迹”。\n\n二战期间，琥珀屋被纳粹德国掠夺并运往柯尼斯堡，在那里展出。随着盟军逼近，这个房间被拆卸并装箱。然而，柯尼斯堡在1944年遭到猛烈轰炸，琥珀屋的下落和命运成了一个谜。苏联官方报告称，该房间在1945年4月9日至11日的轰炸中被摧毁。\n\n尽管人们进行了无数次的搜索，并提出了关于它幸存和下落的理论，但没有找到它继续存在的确凿证据。有些人认为它在柯尼斯堡的轰炸中被摧毁，而另一些人则推测它被藏在其他地方。\n\n1979年，在凯瑟琳宫启动了一个重建琥珀屋的项目。经过俄罗斯和德国工匠数十年的努力，并在大量捐款的支持下，复制品于2003年竣工并落成。"
  },
  {
    "id": "45458249",
    "title": "Stdlib: A library of frameworks, templates, and guides for technical leadership",
    "url": "https://debuggingleadership.com/stdlib",
    "summary": "Stdlib is a community-built library offering over 1,000 resources – frameworks, templates, guides, articles, and videos – aimed at improving technical leadership skills. It covers a wide range of topics relevant to engineering management and technical leadership.\n\nRecent additions and featured content focus on current challenges and trends: comment-driven development, the impact of distractions on engineers, handling unethical requests, team topologies for fast flow, delegation in incident response, managing unplanned work in sprints, and the overemphasis on process.\n\nThe platform also addresses key leadership competencies: business thinking for tech executives, AI's impact on junior developers' career paths, measuring team performance, fostering a culture of admitting mistakes, recognizing individual engineer contributions, engaging in organizational politics, avoiding over-engineering, and the importance of software maintenance.\n\nStdlib highlights several books, including \"Atomic Habits,\" \"The Phoenix Project,\" \"Team Topologies,\" \"Clean Code Handbook,\" and \"Accelerate,\" covering areas like personal productivity, DevOps, team organization, code quality, and high-performing technology organizations.\n\nFinally, it provides insights on topics such as privacy in startups, supporting teams after layoffs, storytelling in leadership, the measurability of engineering productivity, clarifying thinking for leaders, product strategy, managing difficult group participants, engineering enablement, incident escalation, stress management, and strategic thinking. Career Frameworks from Dropbox and resources about Peopleware also enrich this library.\n",
    "chinese_title": "标准库：技术领导力的框架、模板和指南库",
    "chinese_summary": "Stdlib是一个社区构建的库，提供超过1000种资源——框架、模板、指南、文章和视频——旨在提升技术领导力技能。它涵盖了与工程管理和技术领导力相关的广泛主题。\n\n最近新增和精选的内容侧重于当前的挑战和趋势：注释驱动开发、干扰对工程师的影响、处理不道德的请求、快速流动的团队拓扑、事件响应中的委派、管理冲刺中的计划外工作，以及对过程的过度强调。\n\n该平台还涉及关键的领导力能力：科技高管的商业思维、人工智能对初级开发人员职业道路的影响、衡量团队绩效、培养承认错误的文化、认可个人工程师的贡献、参与组织政治、避免过度工程设计，以及软件维护的重要性。\n\nStdlib重点介绍了多本书籍，包括《原子习惯》、《凤凰项目》、《团队拓扑》、《代码整洁之道》和《加速》，涵盖了个人效率、DevOps、团队组织、代码质量和高性能技术组织等领域。\n\n最后，它提供了关于以下主题的见解：创业公司中的隐私、裁员后支持团队、领导力中的故事讲述、工程生产力的可衡量性、澄清领导者的思维、产品战略、管理困难的团队成员、工程赋能、事件升级、压力管理和战略思维。来自Dropbox的职业框架和关于《人件》的资源也丰富了这个库。"
  },
  {
    "id": "45453222",
    "title": "Babel is why I keep blogging with Emacs",
    "url": "https://entropicthoughts.com/why-stick-to-emacs-blog",
    "summary": "The author describes their ambivalence about using Org mode and Emacs for blogging. While they acknowledge the allure of creating a simpler, custom static site generator (potentially around 2,000 lines of code), they remain tethered to Org mode primarily because of its Babel feature.\n\nThe author admits to not fully understanding the Org publishing process, finding its underlying code (over 20,000 lines) complex and intimidating. Despite this, the power of Babel to execute code blocks within Org documents and display the results, including tables and images, proves too valuable to abandon.\n\nBabel's ability to support sessions, inject variables, and provide language-specific code execution and styling is highlighted as a significant advantage. The author specifically mentions using it with R for generating plots directly within their blog posts. This tight integration of data, visualizations, and text allows for a cohesive and efficient drafting process.\n\nUltimately, while a custom blogging engine might seem appealing, replicating Babel's functionality would require a substantial time commitment, making it an impractical project. Therefore, the author resigns themselves to using the more complex but powerful Org mode and Babel for their blogging needs, despite the occasional frustration with its intricacies. They see the benefit of integrated code execution as outweighing the complexity cost.\n",
    "chinese_title": "Babel 是我坚持使用 Emacs 写作的原因。",
    "chinese_summary": "作者描述了他们在使用Org mode和Emacs进行博客写作时的矛盾心理。虽然他们承认创建更简单、自定义的静态站点生成器（可能大约2000行代码）的诱惑力，但他们仍然主要因为Babel功能而依赖于Org mode。\n\n作者承认没有完全理解Org的发布流程，觉得其底层代码（超过2万行）复杂且令人畏惧。尽管如此，Babel在Org文档中执行代码块并显示结果（包括表格和图像）的强大功能实在太有价值，无法放弃。\n\nBabel支持会话、注入变量以及提供特定于语言的代码执行和样式的能力被强调为一个显著优势。作者特别提到使用它与R语言结合，直接在博客文章中生成绘图。这种数据、可视化和文本的紧密集成使得起草过程连贯且高效。\n\n最终，虽然自定义博客引擎可能看起来很吸引人，但复制Babel的功能需要大量的时间投入，使其成为一个不切实际的项目。因此，作者最终还是选择使用更复杂但功能强大的Org mode和Babel来满足其博客需求，尽管偶尔会对它的复杂性感到沮丧。他们认为集成代码执行的优势超过了复杂性的成本。"
  },
  {
    "id": "45411939",
    "title": "How England misplaced its first king",
    "url": "https://www.bbc.com/future/article/20250926-why-england-forgot-its-first-king",
    "summary": "This article argues that Æthelstan, the first king of England, has been unfairly overlooked in history despite his significant achievements. Crowned in 925 AD, he unified disparate kingdoms to create England, forged strong relationships with mainland Europe, and established a diverse, outward-looking society. He even set the trend of English monarchs wearing a crown.\n\nÆthelstan expanded upon the groundwork laid by his grandfather, Alfred the Great, and his father, Edward the Elder, by conquering Northumbria and solidifying a unified English kingdom. His victory at the Battle of Brunanburh further secured his rule. The article challenges the notion of a homogenous \"Anglo-Saxon\" England, emphasizing the cultural diversity and international connections that characterized Æthelstan's reign.\n\nDespite his accomplishments, Æthelstan was later overshadowed by Alfred the Great, who had more readily available historical accounts and a strong biography written in his lifetime. However, in recent times, historians have started piecing together his life and legacy.\n\nWhile Æthelstan's kingdom fragmented after his death in 939 AD, the concept of a unified England remained. His reign also saw the establishment of more efficient governmental practices, with the evidence of diplomas, writs and agreements surviving to this day. The article concludes by highlighting Æthelstan's importance as a pioneer in royal power and points out that some of the coronation rituals used by King Charles III in 2023 had their roots in Æthelstan's coronation from 1,100 years earlier.\n",
    "chinese_title": "英格兰如何失去了它的第一位国王",
    "chinese_summary": "本文认为，英格兰首位国王埃塞尔斯坦尽管成就斐然，但在历史上却被不公正地忽视了。他于公元925年加冕，统一了分裂的王国，建立了英格兰，与欧洲大陆建立了牢固的关系，并建立了一个多元化、面向外部的社会。他甚至开创了英国君主佩戴王冠的先河。\n\n埃塞尔斯坦在祖父阿尔弗雷德大帝和父亲爱德华长者奠定的基础上，通过征服诺森布里亚，巩固了一个统一的英格兰王国。他在布鲁南堡战役中的胜利进一步巩固了他的统治。本文挑战了“盎格鲁-撒克逊”英格兰同质化的概念，强调了埃塞尔斯坦统治时期的文化多样性和国际联系。\n\n尽管取得了成就，但埃塞尔斯坦后来被阿尔弗雷德大帝的光芒所掩盖，后者拥有更容易获得的史料，并在有生之年就有了强大的传记。然而，近年来，历史学家已经开始拼凑他的生平和遗产。\n\n虽然埃塞尔斯坦的王国在他于公元939年去世后分裂，但统一英格兰的概念仍然存在。他的统治也见证了更有效的政府实践的建立，至今仍有文凭、令状和协议的证据留存。文章最后强调了埃塞尔斯坦作为王权先驱的重要性，并指出查理三世国王在2023年使用的一些加冕仪式源于1100年前埃塞尔斯坦的加冕典礼。"
  },
  {
    "id": "45452261",
    "title": "Why I chose Lua for this blog",
    "url": "https://andregarzia.com/2025/03/why-i-choose-lua-for-this-blog.html",
    "summary": "This blog post explains the author's decision to use Lua for their personal blog, replacing a previous setup based on Racket. The primary motivation was to reduce complexity and ensure long-term maintainability. The author criticizes the rapid pace of change in the JavaScript ecosystem, which often leads to dependency issues and code becoming obsolete quickly. They highlight the stability and slow evolution of Lua as a significant advantage.\n\nLua's simplicity, small size, and minimal dependencies allow the author to fully understand and manage the entire blogging system. This approach contrasts with the often overwhelming dependency trees associated with modern JavaScript frameworks. The author appreciates Lua's \"batteries-not-included\" philosophy, which encourages building custom solutions tailored to specific needs. They describe their use of CGI scripts and a SQLite database for serving the blog dynamically, emphasizing a simple, old-school approach.\n\nThe author acknowledges that Node.js might be more efficient in terms of resource usage, but prioritizes ease of maintenance and long-term viability over sheer performance. They enjoy implementing features like CGI, Micropub, IndieAuth, and WebMentions themselves, gaining a deeper understanding of the underlying technology. Ultimately, the choice of Lua is about control, simplicity, and the ability to maintain the blog for years to come without constantly chasing the latest trends. They advocate for \"choosing boring\" in the sense of stability and maintainability, allowing focus on content creation rather than battling a constantly evolving tech stack.\n",
    "chinese_title": "我为什么选择Lua来写博客",
    "chinese_summary": "这篇博文解释了作者决定使用Lua来搭建个人博客的原因，取代了之前基于Racket的方案。 主要动机是降低复杂性，并确保长期可维护性。 作者批评了JavaScript生态系统快速变化的节奏，这经常导致依赖问题和代码迅速过时。 他们强调Lua的稳定性和缓慢演进是其显著优势。\n\nLua的简洁、小巧和极少的依赖项使作者能够完全理解和管理整个博客系统。 这种方法与现代JavaScript框架中常见的令人头晕目眩的依赖树形成对比。 作者赞赏Lua的“不含电池”理念，该理念鼓励构建针对特定需求的定制解决方案。 他们描述了使用CGI脚本和SQLite数据库来动态地提供博客，强调了一种简单、老派的方法。\n\n作者承认Node.js可能在资源使用方面更有效率，但优先考虑易于维护和长期可行性，而不是单纯的性能。 他们享受自己实现诸如CGI、Micropub、IndieAuth和WebMentions等功能，从而更深入地了解底层技术。 最终，选择Lua是为了掌控、简洁以及能够长期维护博客，而无需不断追逐最新的趋势。 他们提倡“选择无聊”，即选择稳定性和可维护性，从而可以将精力集中在内容创作上，而不是与不断发展的技术栈作斗争。"
  },
  {
    "id": "45457460",
    "title": "Microcomputers – The Second Wave: Toward a Mass Market",
    "url": "https://technicshistory.com/2025/10/03/microcomputers-the-second-wave-towards-a-mass-market/",
    "summary": "This article chronicles the rise of microcomputers in the late 1970s, focusing on the \"second wave\" led by the Apple II, Commodore PET, and Tandy/Radio Shack TRS-80, collectively known as \"the Trinity.\" These machines broke from the hobbyist roots of the industry by offering user-friendly \"appliance\" computers aimed at a broader consumer market.\n\nThe success of this second wave required technical expertise, business acumen, and capital investment, along with a willingness to take risks. Established mainframe and minicomputer companies initially dismissed microcomputers as toys, while even some hobbyists doubted the potential for a mass market.\n\nThe article highlights Apple Computer's unique position, stemming from its deep roots in the hobbyist community. It details the backgrounds of co-founders Steve Wozniak and Steve Jobs. Wozniak, an electronics genius, designed the Apple I and II computers, driven by personal interest rather than market demand. Jobs, lacking Wozniak's technical expertise but possessing entrepreneurial vision, pushed for commercialization.\n\nThe article narrates the creation of the Apple I, its limited success, and the subsequent development of the Apple II with its color graphics capabilities. Facing funding challenges, Jobs secured investment from Mike Markkula, a seasoned business professional who provided crucial capital, business planning, and belief in the potential of home computing. Markkula's involvement, combined with Wozniak's engineering and Jobs' vision, ultimately positioned Apple for success, even though the Apple II started off with slow sales.\n",
    "chinese_title": "微型计算机：迈向大众市场的第二次浪潮",
    "chinese_summary": "本文记录了 20 世纪 70 年代末微型计算机的崛起，重点关注由 Apple II、Commodore PET 和 Tandy/Radio Shack TRS-80 引领的“第二波浪潮”，它们被统称为“三巨头”。 这些机器通过提供面向更广泛消费市场的用户友好型“家电”计算机，打破了该行业的业余爱好者根基。\n\n这一“第二波浪潮”的成功需要技术专长、商业头脑和资本投资，以及承担风险的意愿。 老牌大型机和小型计算机公司最初将微型计算机视为玩具，甚至一些业余爱好者也怀疑大众市场的潜力。\n\n本文重点介绍了苹果公司独特的地位，这源于其在业余爱好者社区的深厚根基。 它详细介绍了联合创始人史蒂夫·沃兹尼亚克和史蒂夫·乔布斯的背景。 沃兹尼亚克是一位电子天才，他出于个人兴趣而非市场需求，设计了 Apple I 和 II 计算机。 乔布斯缺乏沃兹尼亚克的技术专长，但拥有创业愿景，推动了商业化。\n\n本文讲述了 Apple I 的创建、其有限的成功，以及随后 Apple II 及其彩色图形功能的开发。 面对资金挑战，乔布斯获得了经验丰富的商业人士迈克·马库拉的投资，马库拉提供了关键的资金、商业计划和对家用计算潜力的信心。 马库拉的参与，加上沃兹尼亚克的工程技术和乔布斯的远见卓识，最终使苹果公司走向成功，尽管 Apple II 最初的销售额增长缓慢。"
  },
  {
    "id": "45415519",
    "title": "Highest bridge unveiled at more than 2,000ft above ground",
    "url": "https://www.independent.co.uk/tv/news/china-worlds-highest-bridge-video-b2835886.html",
    "summary": "The world's tallest bridge, the Huajiang Grand Canyon Bridge, has officially opened in China's Guizhou province. Standing at over 2,000ft above ground and measuring 2,890 meters long, the bridge significantly reduces travel time between the two sides of the canyon from two hours to just two minutes. The bridge took over three years to construct.\n\nBefore its opening, engineers conducted rigorous testing, deploying 96 trucks across the bridge to simulate heavy traffic conditions. Drone footage shared by the Ministry of Foreign Affairs showcased the bridge, including a \"spectacular water curtain test\" creating a rainbow underneath.\n",
    "chinese_title": "最高桥梁揭幕，离地超2000英尺",
    "chinese_summary": "世界最高桥梁花江峡谷大桥在中国贵州省正式开通。该桥高出地面2000多英尺，长2890米，将峡谷两岸的通行时间从两小时缩短至仅两分钟。大桥耗时三年多建造完成。\n\n在开通之前，工程师进行了严格的测试，部署了96辆卡车在桥上模拟重交通状况。外交部分享的无人机镜头展示了大桥，包括一个“壮观的水幕测试”，在桥下形成一道彩虹。"
  },
  {
    "id": "45420685",
    "title": "Some dogs can classify their toys by function",
    "url": "https://arstechnica.com/science/2025/09/some-dogs-can-classify-their-toys-by-function/",
    "summary": "This article discusses a new study published in Current Biology that reveals some dogs possess a sophisticated cognitive ability called \"label extension,\" allowing them to classify toys by function (pull or fetch) regardless of appearance, without formal training.\n\nResearchers at Eötvös Loránd University in Budapest, Hungary, studied \"gifted word learner\" (GWL) dogs already known for memorizing toy names. They found these dogs could generalize the labels \"pull\" and \"fetch\" beyond specific toys to the function of the toy during play. The dogs were introduced to new, unlabeled toys through play sessions involving either pulling or fetching. When asked to select a \"pull\" or \"fetch\" toy from the new set, the dogs chose correctly at a rate significantly higher than chance.\n\nThis indicates the dogs classify objects by their function, similar to how a child understands different types of cups are all \"cups\" despite their varying appearances. This capability usually requires extensive training in captive animals, but these dogs developed it naturally through playing with their owners. The research builds upon previous studies by the same group, which explored how dogs perceive gestures, use sensory features to identify toys, and form \"multistory mental images\" of objects by combining sight and smell. The study's findings suggest a broader understanding of how language-related skills may function in dogs and potentially other animals.\n",
    "chinese_title": "有些狗可以通过功能对玩具进行分类。",
    "chinese_summary": "本文讨论了发表在《当代生物学》上的一项新研究，该研究揭示了某些狗拥有一种被称为“标签扩展”的复杂认知能力，使其能够根据功能（拉扯或取回）对玩具进行分类，而无需考虑外观，也无需正式训练。\n\n匈牙利布达佩斯罗兰大学的研究人员研究了已经因记忆玩具名称而闻名的“天赋词汇学习者”(GWL)犬。他们发现，这些狗可以将“拉扯”和“取回”的标签从特定玩具推广到玩具在玩耍过程中的功能。这些狗通过涉及拉扯或取回的玩耍环节被介绍给新的、未标记的玩具。当被要求从新的玩具集中选择一个“拉扯”或“取回”的玩具时，这些狗的选择正确率显著高于偶然性。\n\n这表明这些狗根据功能对物体进行分类，类似于儿童理解不同类型的杯子都是“杯子”，尽管它们的外观各不相同。这种能力通常需要在圈养动物中进行大量的训练，但这些狗通过与主人玩耍自然地发展了这种能力。这项研究建立在该小组之前的研究基础上，之前的研究探索了狗如何感知手势，如何使用感官特征来识别玩具，以及如何通过结合视觉和嗅觉来形成物体的“多层心理图像”。该研究结果表明，人们对与语言相关的技能如何在狗和可能其他动物中发挥作用有了更广泛的理解。"
  },
  {
    "id": "45417826",
    "title": "How I block all 26M of your curl requests",
    "url": "https://foxmoss.com/blog/packet-filtering/",
    "summary": "This article details the author's exploration of using XDP (Express Data Path) and eBPF (Extended Berkeley Packet Filter) to block network requests, specifically those originating from `curl`. The author aims to handle network requests efficiently, dropping up to 26 million packets per second on consumer hardware.\n\nThe core idea revolves around fingerprinting TLS connections using a modified version of JA4 fingerprinting, dubbed FST1. FST1 leverages the cipher suites exchanged during the TLS handshake to identify clients.  To avoid the complexity of implementing SHA256 hashing within eBPF's limited stack space, the author utilizes the simpler Jenkins hash algorithm on the sorted list of cipher suites. The reasoning is that the security of a cryptographic hash isn't necessary, as attackers can simply mimic legitimate browser signatures.\n\nThe eBPF filter parses Ethernet and TCP headers, extracts cipher suites from the TLS Client Hello, calculates the FST1 hash, and compares it against a list of blocked hashes stored in an eBPF map.  The eBPF map allows communication between userspace (where the blocklist is managed) and the kernel (where the filtering occurs). Requests matching a blocked hash are dropped.\n\nThe author acknowledges the overzealous nature of blocking all `curl` requests but highlights the method's potential for detecting bots that spoof user agents.  While TLS signatures can be circumvented, it requires significantly more effort than simply changing a user agent. The author notes preliminary benchmarks suggest this XDP/eBPF approach is faster than performing similar filtering in userspace.  The code for the project is open-sourced.\n",
    "chinese_title": "我是如何屏蔽掉你所有 2600 万个 curl 请求的",
    "chinese_summary": "本文详细介绍了作者探索使用 XDP (Express Data Path) 和 eBPF (Extended Berkeley Packet Filter) 拦截网络请求，特别是来自 `curl` 的请求。作者旨在高效处理网络请求，在消费级硬件上每秒丢弃高达 2600 万个数据包。\n\n核心思想围绕使用名为 FST1 的 JA4 指纹识别的修改版本来识别 TLS 连接。 FST1 利用 TLS 握手期间交换的密码套件来识别客户端。为了避免在 eBPF 有限的栈空间内实现 SHA256 哈希的复杂性，作者对排序后的密码套件列表使用了更简单的 Jenkins 哈希算法。原因是加密哈希的安全性不是必需的，因为攻击者可以简单地模仿合法的浏览器签名。\n\neBPF 过滤器解析 Ethernet 和 TCP 头部，从 TLS Client Hello 中提取密码套件，计算 FST1 哈希，并将其与存储在 eBPF 映射中的阻止哈希列表进行比较。eBPF 映射允许用户空间（管理阻止列表的地方）和内核（进行过滤的地方）之间的通信。匹配阻止哈希的请求将被丢弃。\n\n作者承认阻止所有 `curl` 请求有些过度，但强调了该方法在检测欺骗用户代理的机器人方面的潜力。虽然 TLS 签名可以被规避，但这需要比简单地更改用户代理付出更多的努力。作者指出初步基准测试表明，这种 XDP/eBPF 方法比在用户空间执行类似过滤更快。该项目的代码已开源。"
  },
  {
    "id": "45450044",
    "title": "N8n added native persistent storage with DataTables",
    "url": "https://community.n8n.io/t/data-tables-are-here/192256",
    "summary": "N8n is launching Data Tables (beta) in version 1.113 for all plans, offering native persistent storage within the platform. This feature addresses the long-requested need for a table to store data between workflow executions without requiring external platforms or credentials.\n\nData Tables enable users to:\n\n*   Save data from workflow runs.\n*   Persist data between executions.\n*   Track execution status to prevent duplicates.\n*   Store reusable prompts.\n*   Collect AI workflow evaluation data.\n*   Perform data lookups, merges, and enhancements.\n\nA 50MB size limit is in place for all users to ensure performance. Self-hosting users can adjust this limit via the `N8N_DATA_TABLES_MAX_SIZE_BYTES` environment variable.\n\nN8n encourages users to upgrade to v1.113 and provide feedback on the Data Tables feature, including missing features and potential improvements. Documentation is available for further information.\n",
    "chinese_title": "N8n增加了使用DataTables的原生持久化存储",
    "chinese_summary": "N8n将在1.113版本中为所有计划推出数据表（beta版），提供平台内的原生持久存储。此功能解决了长期以来在工作流执行之间存储数据而无需外部平台或凭据的需求。\n\n数据表使用户能够：\n\n*   保存工作流运行的数据。\n*   在执行之间持久化数据。\n*   跟踪执行状态以防止重复。\n*   存储可重用的提示。\n*   收集AI工作流评估数据。\n*   执行数据查找、合并和增强。\n\n为确保性能，所有用户都有50MB的大小限制。自托管用户可以通过`N8N_DATA_TABLES_MAX_SIZE_BYTES`环境变量调整此限制。\n\nN8n鼓励用户升级到v1.113，并提供关于数据表功能的反馈，包括缺失的功能和潜在的改进。文档可供查阅，以获取更多信息。"
  },
  {
    "id": "45453586",
    "title": "OpenAI's H1 2025: $4.3B in income, $13.5B in loss",
    "url": "https://www.techinasia.com/news/openais-revenue-rises-16-to-4-3b-in-h1-2025",
    "summary": "The provided text is insufficient to summarize a full article. It only contains a title stating OpenAI generated $4.3B in income but incurred a staggering $13.5B loss in the first half of 2025 (H1 2025), and a snippet indicating the user needs to enable JavaScript to view the content on the Tech in Asia website.\n\nTherefore, I can only summarize based on the title:\n\nOpenAI experienced significant financial activity in the first half of 2025. While the company generated a substantial income of $4.3 billion, its losses far exceeded that, reaching $13.5 billion. This suggests a period of aggressive investment, high operating costs, or significant debt burden for OpenAI despite its revenue generation. Without the full article, it's impossible to determine the cause of this large loss or the specific context surrounding these figures.\n",
    "chinese_title": "OpenAI 2025年上半年：收入43亿美元，亏损135亿美元",
    "chinese_summary": "提供的文本不足以总结整篇文章。它仅包含一个标题，指出 OpenAI 在 2025 年上半年 (H1 2025) 产生了 43 亿美元的收入，但却产生了高达 135 亿美元的亏损，以及一条片段，表明用户需要启用 JavaScript 才能在 Tech in Asia 网站上查看内容。\n\n因此，我只能根据标题进行总结：\n\nOpenAI 在 2025 年上半年经历了重大的财务活动。尽管该公司产生了高达 43 亿美元的收入，但其亏损远超这一数字，达到 135 亿美元。这表明 OpenAI 在收入产生的同时，正处于积极投资、高运营成本或重大债务负担的时期。 在没有全文的情况下，无法确定造成巨额亏损的原因或围绕这些数字的具体背景。"
  },
  {
    "id": "45447699",
    "title": "How Israeli actions caused famine in Gaza, visualized",
    "url": "https://www.cnn.com/2025/10/02/middleeast/gaza-famine-causes-vis-intl",
    "summary": "This article details how Israeli actions have contributed to a severe food crisis, verging on famine, in Gaza, according to a UN-backed report and numerous humanitarian organizations. The report, cited by countries considering recognition of Palestine, projected that by the end of September, nearly a third of Gaza's population would face famine conditions. The UN Special Rapporteur on the right to food accuses Israel of using hunger as a weapon against Palestinians, violating international law.\n\nIsrael rejects these findings, claiming the report is biased and based on Hamas data, asserting they have increased aid entry. However, aid agencies contend that Israel's war intensification, particularly in Gaza City, hinders relief efforts. Bureaucratic impediments, arbitrary rejection of items, and delayed approvals severely limit the amount of aid reaching Gaza.\n\nThe article highlights the struggles of internal aid distribution due to damaged roads, fuel shortages, and ongoing hostilities. Alternative aid delivery methods, like the US and Israeli-backed Gaza Humanitarian Foundation (GHF) sites and airdrops, are deemed dehumanizing, inaccessible, and dangerous, with reports of numerous deaths near these sites and convoy routes.\n\nFurthermore, the Israeli offensive has drastically reduced accessible farmland, further limiting food sources. The UN warns that a full-scale invasion of Gaza City could collapse the already fragile aid supply chain, pushing the situation into an \"unimaginable catastrophe,\" highlighting the need for a ceasefire, unimpeded access, and restoration of local food systems to reverse the famine.\n",
    "chinese_title": "以色列的行动如何导致加沙饥荒，可视化呈现",
    "chinese_summary": "根据联合国支持的一份报告和众多人道主义组织的说法，本文详细介绍了以色列的行为如何导致加沙地带出现严重的粮食危机，濒临饥荒。这份被考虑承认巴勒斯坦的国家引用的报告预测，到9月底，近三分之一的加沙人口将面临饥荒状况。联合国食物权问题特别报告员指责以色列利用饥饿作为对付巴勒斯坦人的武器，违反了国际法。\n\n以色列否认这些调查结果，声称该报告带有偏见，并基于哈马斯的数据，并声称他们已经增加了援助物资的进入。然而，援助机构辩称，以色列的战争加剧，尤其是在加沙城，阻碍了救援工作。官僚障碍、武断地拒绝物资以及延误审批严重限制了抵达加沙的援助数量。\n\n本文强调了由于道路损坏、燃料短缺和持续的敌对行动，内部援助分配的困难。替代援助运送方法，如美国和以色列支持的加沙人道主义基金会（GHF）站点和空投，被认为是使人丧失尊严、难以获得且危险的，有报道称在这些站点和车队路线附近发生了多起死亡事件。\n\n此外，以色列的攻势已大大减少了可耕种的农田，进一步限制了食物来源。联合国警告说，对加沙城的全面入侵可能会使已经脆弱的援助供应链崩溃，将局势推向“难以想象的灾难”，强调需要停火、畅通无阻的通道以及恢复当地粮食系统，以扭转饥荒局面。"
  },
  {
    "id": "45457411",
    "title": "Researchers develop molecular qubits that communicate at telecom frequencies",
    "url": "https://chicagoquantum.org/news/researchers-develop-molecular-qubits-communicate-telecom-frequencies",
    "summary": "Researchers from multiple institutions have developed molecular qubits containing erbium that operate at telecom frequencies, bridging the gap between light and magnetism. This breakthrough enables the potential for seamless integration with existing fiber-optic networks, paving the way for scalable quantum technologies, including quantum networks (the \"quantum internet\"). These networks could enable ultra-secure communication, connect quantum computers, and distribute quantum sensors.\n\nThe molecular qubits can also serve as highly sensitive quantum sensors embeddable in unusual environments, and their compatibility with silicon photonics allows for integration into chips for compact quantum devices. The use of erbium, a rare-earth element, allows for strong interaction with both light and magnetic fields. Researchers demonstrated the qubit's compatibility with silicon photonics using optical spectroscopy and microwave techniques, suggesting accelerated development of hybrid molecular-photonic platforms.\n\nThe team emphasizes the importance of collaboration with chemists at UC Berkeley, highlighting the role of synthetic molecular chemistry in optimizing rare earth ion properties. They envision using synthetic chemistry to design and control quantum materials at the molecular level, enabling tailor-made quantum systems for networking, sensing, and computation. The research was supported by the U.S. Department of Energy's Office of Science and Q-NEXT.\n",
    "chinese_title": "研究人员开发出在电信频率下通信的分子量子比特",
    "chinese_summary": "多个机构的研究人员开发出了包含铒的、在电信频率下运行的分子量子比特，弥合了光与磁之间的差距。这一突破使与现有光纤网络无缝集成成为可能，为包括量子网络（“量子互联网”）在内的可扩展量子技术铺平了道路。这些网络可以实现超安全通信、连接量子计算机并分发量子传感器。\n\n分子量子比特还可以用作可嵌入不寻常环境中的高灵敏度量子传感器，并且它们与硅光子的兼容性允许集成到芯片中，用于紧凑型量子器件。 稀土元素铒的使用实现了与光和磁场的强烈相互作用。研究人员使用光学光谱学和微波技术证明了量子比特与硅光子的兼容性，表明混合分子-光子平台的发展将加速。\n\n该团队强调了与加州大学伯克利分校的化学家合作的重要性，突出了合成分子化学在优化稀土离子特性方面的作用。他们设想利用合成化学在分子水平上设计和控制量子材料，从而实现为网络、传感和计算量身定制的量子系统。这项研究得到了美国能源部科学办公室和 Q-NEXT 的支持。"
  },
  {
    "id": "45451547",
    "title": "Launch HN: Simplex (YC S24) – Browser automation platform for developers",
    "url": "https://www.simplex.sh/",
    "summary": "Simplex is launching a browser automation platform designed for developers, tackling the challenges of automating interactions with legacy web portals. It provides the infrastructure needed for modern browser automation, including remote browsers and steerable web agents. The platform is engineered to work reliably with older systems and automate tasks across various types of portals, such as billing, prior authorization, ERP, government, and TMS/WMS systems.\n\nSimplex offers features like cached agent actions for increased reliability and fast flow development, the ability to create real-time flows with low latency for phone call integration, and a production-ready environment. Key features include eval harnesses for stress-testing workflows, authentication handling SDKs, scalable headless browsers, stealth mode with CAPTCHA solving, controllable and optimized workflows, robust Python and TypeScript SDKs, and detailed logging with live session replays. The platform emphasizes reliability and scalability, promising consistent workflows and easy deployment. Users can book a call to discuss specific use cases and get started.\n",
    "chinese_title": "发布 HN：Simplex (YC S24) - 开发者浏览器自动化平台",
    "chinese_summary": "Simplex 推出一款专为开发者设计的浏览器自动化平台，旨在解决与传统网络门户交互自动化方面的挑战。 它为现代浏览器自动化提供所需的基础设施，包括远程浏览器和可控的网络代理。 该平台经过精心设计，能够可靠地与旧系统协同工作，并自动执行各种类型门户的任务，例如账单、事先授权、ERP、政府以及TMS/WMS系统。\n\nSimplex提供诸如缓存代理操作以提高可靠性和快速流程开发、创建具有低延迟的实时流程以实现电话集成以及生产就绪环境等功能。 主要功能包括用于压力测试工作流程的评估工具、身份验证处理SDK、可扩展的无头浏览器、具有验证码解决方案的隐身模式、可控和优化的工作流程、强大的Python和TypeScript SDK以及具有实时会话重放的详细日志记录。 该平台强调可靠性和可扩展性，承诺提供一致的工作流程和轻松的部署。 用户可以预约通话，讨论具体用例并开始使用。"
  },
  {
    "id": "45458550",
    "title": "You Want Technology with Warts",
    "url": "https://entropicthoughts.com/you-want-technology-with-warts",
    "summary": "This article summarizes a presentation advocating for technology choices that prioritize longevity and maintainability over cutting-edge features, even if it means embracing perceived \"warts.\" The author was struck by the presentation's focus on building web services designed to last for decades, drawing parallels to the enduring nature of infrastructure like bridges and simple HTML/CSS websites.\n\nThe presentation suggests using SQLite for data storage, SQL queries for application logic, Express-on-Node.js for routing, Jinja2 for presentation, and basic HTML/JS for HTTP requests. While the author suggests Perl as a possible alternative to Node.js for backend logic due to its perceived long-term stability, the core argument lies in selecting technologies with proven backward compatibility.\n\nThe author highlights the browser's evolving rendering behavior and the benefits of full-page reloads in certain contexts. The central idea reframes \"warts\" (like SQLite's flexible typing or nullable primary keys) as testaments to a technology's commitment to backward compatibility. Each \"wart\" represents a feature someone relied on, and its persistence signifies that the technology is unlikely to introduce breaking changes in the future. The author argues that configuring around known quirks upfront is preferable to facing unexpected disruptions caused by future updates. The goal is to select technologies with a history of prioritizing stability and legacy support over constant innovation.\n",
    "chinese_title": "你想要带瑕疵的技术吗？",
    "chinese_summary": "本文总结了一场演讲，该演讲提倡选择技术时，应优先考虑技术的寿命和可维护性，而非最前沿的功能，即使这意味着接受一些公认的“瑕疵”。演讲者专注于构建能够持续数十年的 Web 服务，这给作者留下了深刻的印象，作者将其与桥梁和简单的 HTML/CSS 网站等持久的基础设施相提并论。\n\n演讲建议使用 SQLite 进行数据存储，SQL 查询进行应用逻辑，Express-on-Node.js 进行路由，Jinja2 进行展示，以及基本的 HTML/JS 进行 HTTP 请求。虽然作者建议使用 Perl 作为 Node.js 的后端逻辑的替代方案，因为 Perl 被认为具有长期稳定性，但核心论点在于选择具有经过验证的向后兼容性的技术。\n\n作者强调了浏览器不断演变的渲染行为以及在某些情况下整页重新加载的好处。核心思想是将“瑕疵”（如 SQLite 的灵活类型或可为空的主键）重新定义为技术致力于向后兼容性的证明。每个“瑕疵”代表着有人依赖的功能，它的存在表明该技术不太可能在未来引入重大变更。作者认为，预先针对已知的怪癖进行配置，比面对未来更新造成的意外中断要好。目标是选择那些在历史上优先考虑稳定性和遗留支持而非不断创新的技术。"
  },
  {
    "id": "45461837",
    "title": "Ytterby",
    "url": "https://en.wikipedia.org/wiki/Ytterby",
    "summary": "Ytterby is a village on the Swedish island of Resarö, notable for being the source of several elemental discoveries. The name translates to \"outer village.\" The elements yttrium (Y), terbium (Tb), erbium (Er), and ytterbium (Yb) are named after Ytterby, and holmium (Ho), scandium (Sc), thulium (Tm), tantalum (Ta), and gadolinium (Gd) were also first discovered there.\n\nThe Ytterby mine initially extracted quartz in the 1600s and feldspar from 1790, primarily for porcelain manufacture. Feldspar mining intensified in the 1860s, making the mine one of Sweden's most productive for quartz and feldspar until it closed in 1933, marking 177 years of operation. The mine was later renovated and used for jet fuel storage from the late 1940s to 1978, followed by diesel storage. It was emptied and rehabilitated in the 1990s.\n\nIn 1787, Carl Axel Arrhenius found a heavy black mineral later identified as gadolinite, which contained the new element yttria. Further analysis revealed several other rare earth elements linked to the area. In 1989, ASM International placed a plaque at the mine's entrance to commemorate its historical significance. The European Chemical Society recognized the Ytterby mine as a Historical Landmark in 2018.\n",
    "chinese_title": "伊特比",
    "chinese_summary": "伊特比是瑞典雷萨勒岛上的一个村庄，因是多种元素发现的来源地而闻名。该名称意为“外村”。元素钇(Y)、铽(Tb)、铒(Er)和镱(Yb)以伊特比命名，钬(Ho)、钪(Sc)、铥(Tm)、钽(Ta)和钆(Gd)也首先在那里被发现。\n\n伊特比矿最初在 17 世纪开采石英，从 1790 年开始开采长石，主要用于瓷器制造。长石开采在 19 世纪 60 年代加剧，使该矿成为瑞典石英和长石产量最高的矿之一，直至 1933 年关闭，历时 177 年。该矿后来被改造，从 20 世纪 40 年代末到 1978 年用于储存航空燃料，随后用于储存柴油。它在 20 世纪 90 年代被清空并进行了修复。\n\n1787 年，卡尔·阿克塞尔·阿雷尼乌斯发现了一种重型黑色矿物，后来被鉴定为钆石，其中含有新元素氧化钇。进一步分析揭示了与该地区相关的其他几种稀土元素。1989 年，美国金属学会 (ASM International) 在矿井入口处放置了一块牌匾，以纪念其历史意义。 欧洲化学会于 2018 年将伊特比矿认定为历史地标。"
  },
  {
    "id": "45457048",
    "title": "Self-supervised learning, JEPA, world models, and the future of AI [video]",
    "url": "https://www.youtube.com/watch?v=yUmDRxV0krg",
    "summary": "This YouTube video titled \"Self-supervised learning, JEPA, world models, and the future of AI\" likely discusses advancements in AI focusing on self-supervised learning techniques, particularly Joint Embedding Predictive Architecture (JEPA), and their connection to building \"world models.\"\n\nSelf-supervised learning is a method where AI systems learn from unlabeled data, essentially teaching themselves by finding patterns and relationships in the data. JEPA is a specific architecture within self-supervised learning that likely aims to create more robust and generalizable representations of data.\n\nThe discussion of \"world models\" suggests the video explores how these techniques are being used to build AI systems capable of understanding and predicting how the world works. This allows the AI to plan, reason, and act more effectively in complex environments.\n\nThe video also touches upon the future implications of these advancements in AI. It likely explores how self-supervised learning, JEPA, and world models will contribute to creating more intelligent, adaptable, and human-like AI systems.\n\nFinally, the YouTube boilerplate text at the end highlights YouTube's terms and policies, and its continued innovation in various areas including testing new features and its partnership with the NFL. This is not directly related to the AI topic but is standard YouTube footer information.\n",
    "chinese_title": "自监督学习、JEPA、世界模型与人工智能的未来 [视频]",
    "chinese_summary": "YouTube视频“自监督学习、JEPA、世界模型以及人工智能的未来”很可能探讨人工智能的进展，重点关注自监督学习技术，特别是联合嵌入预测架构（JEPA），以及它们与构建“世界模型”的联系。\n\n自监督学习是一种人工智能系统从无标签数据中学习的方法，本质上是通过发现数据中的模式和关系来自我学习。JEPA是自监督学习中的一种特定架构，可能旨在创建更强大且更具通用性的数据表示。\n\n对“世界模型”的讨论表明该视频探讨了如何使用这些技术来构建能够理解和预测世界运作方式的人工智能系统。这使人工智能能够在复杂的环境中更有效地进行计划、推理和行动。\n\n该视频还涉及人工智能领域这些进展的未来影响。它很可能探讨了自监督学习、JEPA和世界模型将如何促进创建更智能、更适应性更强以及更像人类的人工智能系统。\n\n最后，YouTube末尾的样板文字突出了YouTube的条款和政策，以及它在包括测试新功能和与NFL合作等各个领域的持续创新。 这与人工智能主题没有直接关系，而是标准的YouTube页脚信息。"
  },
  {
    "id": "45412870",
    "title": "A simple habit that saves my evenings",
    "url": "https://alikhil.dev/posts/the-simple-habit-that-saves-my-evenings/",
    "summary": "The author, a software engineer, shares a simple habit to prevent wasted evenings and maintain work-life balance. The problem is the temptation to continue working late when nearing a breakthrough, often leading to exhaustion, demotivation, and minimal progress. Driven by the momentum of solving a problem, individuals often underestimate the time needed and end up working hours beyond their intended stopping point, leading to burnout and decreased productivity the following day.\n\nInstead of trying to finish a task in those final moments, the author recommends **writing down a detailed, step-by-step action plan for completing the task.** This allows one to leave work with a clear understanding of what needs to be done, reducing anxiety and promoting mental clarity.\n\nThe benefits of this approach are threefold:\n\n*   **Prevents Overworking:** It stops the cycle of working late and exhausting oneself.\n*   **Promotes Rest and Recovery:** Leaving work on time allows for proper rest, leading to increased energy and productivity the next day.\n*   **Encourages Better Solutions:** Rest and a fresh perspective often lead to new insights and better solutions.\n\nThe author has used this technique for over five years and emphasizes its effectiveness in maintaining balance between work and personal life. The core message is to avoid overworking by clearly defining the next steps before ending the workday, allowing for rest, improved focus, and ultimately, more efficient task completion.\n",
    "chinese_title": "一个节省我夜晚时间的简单习惯",
    "chinese_summary": "作者分享一个防止浪费夜晚和保持工作生活平衡的简单习惯。问题在于，接近突破时继续工作到深夜的诱惑，这通常会导致精疲力竭、积极性降低和进展甚微。受解决问题的动力驱使，人们常常低估所需时间，最终工作时间超出预期数小时，导致倦怠和第二天的工作效率下降。\n\n作者建议，与其在最后时刻试图完成任务，不如**写下完成任务的详细的分步行动计划。** 这能让人在清楚了解需要做什么的情况下离开工作，减少焦虑，并促进思维清晰。\n\n这种方法的好处有三方面：\n\n*   **防止过度工作：** 它阻止了工作到深夜和耗尽自己的循环。\n*   **促进休息和恢复：** 准时下班可以充分休息，从而提高第二天的精力和生产力。\n*   **鼓励更好的解决方案：** 休息和新的视角通常会带来新的见解和更好的解决方案。\n\n作者使用这项技巧超过五年，并强调其在维持工作和个人生活之间的平衡方面的有效性。核心信息是通过在结束工作日之前明确定义下一步，避免过度工作，从而实现休息、提高专注力，并最终更有效地完成任务。"
  },
  {
    "id": "45413059",
    "title": "RISC-V Conditional Moves",
    "url": "https://www.corsix.org/content/riscv-conditional-moves",
    "summary": "This article discusses the lack of direct conditional move instructions in RISC-V, contrasting it with the more comprehensive `csel` instruction found in architectures like aarch64. While RISC-V has some limited conditional functionalities through extensions like Zbb and Zicond (czero.eqz, czero.nez), a general conditional move instruction is absent.\n\nThe RISC-V instruction set manual suggests that short forward branches can effectively replace conditional moves and that microarchitectures might fuse these branches into conditional moves for performance. However, the author argues against the validity of such \"fusion\" due to the RISC-V memory consistency model. Specifically, branches introduce syntactic control dependencies on all subsequent store instructions, whereas conditional moves only create data or address dependencies on stores that use their result.\n\nThe article emphasizes that converting a branch into a conditional move removes the broad syntactic control dependency, potentially violating the intended memory model behavior. Therefore, if RISC-V cores implement branch fusion into conditional moves, the resulting \"fused\" instruction needs to retain branch-like properties to preserve the memory model's semantics. In essence, simply replacing a branch with a conditional move isn't always safe in RISC-V due to the defined control dependencies.\n",
    "chinese_title": "RISC-V 条件移动",
    "chinese_summary": "本文探讨了RISC-V中缺乏直接条件移动指令的问题，并将其与aarch64等架构中更为全面的`csel`指令进行了对比。虽然RISC-V通过Zbb和Zicond（czero.eqz, czero.nez）等扩展提供了一些有限的条件功能，但缺少通用的条件移动指令。\n\nRISC-V指令集手册建议短前向分支可以有效地替代条件移动，并且微架构可能会将这些分支融合为条件移动以提高性能。然而，作者反驳了这种“融合”的有效性，原因在于RISC-V的内存一致性模型。具体而言，分支会在所有后续存储指令上引入语法控制依赖，而条件移动仅在其结果被使用的存储指令上创建数据或地址依赖。\n\n本文强调，将分支转换为条件移动会消除广泛的语法控制依赖，从而可能违反预期的内存模型行为。因此，如果RISC-V内核将分支融合为条件移动，则生成的“融合”指令需要保留类似于分支的属性，以保留内存模型的语义。本质上，由于定义的控制依赖关系，在RISC-V中简单地用条件移动替换分支并非总是安全的。"
  },
  {
    "id": "45407953",
    "title": "We bought the whole GPU, so we're damn well going to use the whole GPU",
    "url": "https://hazyresearch.stanford.edu/blog/2025-09-28-tp-llama-main",
    "summary": "This article details the development of a high-throughput megakernel for Llama-70B inference on H100 GPUs, achieving a >22% performance increase over SGLang in end-to-end throughput on the ShareGPT benchmark. The core idea revolves around maximizing GPU utilization by overlapping compute, memory, and communication operations.\n\nThe authors previously developed a low-latency megakernel for Llama-1B, focusing on memory bandwidth optimization. The Llama-70B megakernel tackles a more heterogeneous workload, balancing compute-bound (matrix multiplies) and memory-bound (RMS norm) operations, as well as cross-GPU communication bottlenecks inherent in tensor-parallelism. The key innovation is to leverage the megakernel architecture to achieve fine-grained resource overlapping at multiple levels: within SMs (instruction pipelining), across SMs (concurrent execution of different operations), and across GPUs (background communication).\n\nA novel \"distributed transpose\" operation replaces the traditional reduce-scatter after the attention layer to facilitate overlapping of the O-projection matrix multiplication with communication. The megakernel is built around an instruction/interpreter model, where fine-grained instructions (RMS norm, matrix multiply, etc.) are executed by an on-GPU interpreter that pipelines operations. The interpreter specializes threads for loading, computing, and storing, enabling overlapping within SMs. Special \"storer\" threads handle cross-GPU communication in the background, further improving resource utilization. While presented as research code with limited support, the authors hope that the underlying ideas and performance gains will be of interest to the community.\n",
    "chinese_title": "我们买了整个GPU，所以我们他妈的一定要用完它。",
    "chinese_summary": "本文详细介绍了为H100 GPU上的Llama-70B推理开发的高吞吐量巨型内核，在ShareGPT基准测试中，端到端吞吐量比SGLang提高了22%以上。其核心思想是通过重叠计算、内存和通信操作来最大化GPU利用率。\n\n作者之前为Llama-1B开发了一个低延迟巨型内核，专注于内存带宽优化。Llama-70B巨型内核解决了更异构的工作负载，平衡了计算密集型（矩阵乘法）和内存密集型（RMS范数）操作，以及张量并行固有的跨GPU通信瓶颈。其关键创新在于利用巨型内核架构在多个层面上实现细粒度的资源重叠：在SM内部（指令流水线），跨SM（不同操作的并发执行），以及跨GPU（后台通信）。\n\n一种新颖的“分布式转置”操作取代了注意力层之后的传统reduce-scatter，以促进O-projection矩阵乘法与通信的重叠。巨型内核围绕一个指令/解释器模型构建，其中细粒度的指令（RMS范数、矩阵乘法等）由GPU上的解释器执行，该解释器对操作进行流水线处理。解释器专门分配线程用于加载、计算和存储，从而在SM内部实现重叠。特殊的“存储器”线程在后台处理跨GPU通信，进一步提高资源利用率。虽然以支持有限的研究代码形式呈现，但作者希望其基本思想和性能提升能够引起社区的兴趣。"
  },
  {
    "id": "45436083",
    "title": "Icebird: JavaScript Iceberg Reader",
    "url": "https://github.com/hyparam/icebird",
    "summary": "Icebird is a JavaScript library designed for reading Apache Iceberg tables directly within JavaScript environments. Built upon `hyparquet`, it facilitates the reading of underlying Parquet files, enabling data access from Iceberg tables in web applications.\n\nKey features include:\n\n*   **Basic Usage:** Provides simple functions to read data (`icebergRead`) and metadata (`icebergMetadata`) from Iceberg tables, specifying the table URL and row ranges.\n*   **Performance:** Subsequent reads can be sped up by providing the metadata obtained from `icebergMetadata`.\n*   **Time Travel:** Supports fetching previous versions of tables by specifying the metadata file name.\n*   **Authentication:** Allows adding custom headers to HTTP requests for authentication.\n*   **Demo:** A demo showing integration with a React web application using HighTable is provided for viewing Iceberg data.\n*   **Supported Features:** Icebird supports reading Iceberg v1 and v2 tables, Parquet and Avro storage, file-based catalogs, position and equality deletes, column renaming, all Parquet compression codecs and types. Icebird currently doesn't support Iceberg v3 Tables, ORC and Puffin storage, REST, Hive, Glue, and Service-based catalogs, binary deletion vectors, efficient partitioned read queries, Variant, Geometry and Geography Types, sorting and encryption.\n",
    "chinese_title": "冰鸟：JavaScript冰山阅读器",
    "chinese_summary": "Icebird是一个JavaScript库，旨在直接在JavaScript环境中读取Apache Iceberg表。它基于`hyparquet`构建，方便读取底层的Parquet文件，从而实现从Web应用程序中的Iceberg表访问数据。\n\n主要特性包括：\n\n*   **基本用法：** 提供简单的函数从Iceberg表中读取数据 (`icebergRead`) 和元数据 (`icebergMetadata`)，并指定表URL和行范围。\n*   **性能：** 通过提供从 `icebergMetadata` 获取的元数据，可以加快后续读取速度。\n*   **时间旅行：** 支持通过指定元数据文件名来获取表的先前版本。\n*   **身份验证：** 允许向HTTP请求添加自定义标头以进行身份验证。\n*   **演示：** 提供了一个演示，展示了与使用HighTable的React Web应用程序的集成，用于查看Iceberg数据。\n*   **支持的特性：** Icebird支持读取Iceberg v1和v2表、Parquet和Avro存储、基于文件的目录、位置和等式删除、列重命名、所有Parquet压缩编解码器和类型。Icebird目前不支持Iceberg v3表、ORC和Puffin存储、REST、Hive、Glue和服务型目录、二进制删除向量、高效的分区读取查询、Variant、Geometry和Geography类型、排序和加密。"
  },
  {
    "id": "45411514",
    "title": "Show HN: Traceroute Visualizer",
    "url": "https://kriztalz.sh/traceroute-visualizer/",
    "summary": "This \"Show HN: Traceroute Visualizer\" is a free, browser-based tool that helps users visualize network paths geographically. It supports standard traceroute, tracert, advanced flyingroutes, and MTR outputs, displaying the journey of network packets across the internet.\n\nThe tool automatically detects the user's IP as the starting point. Users then paste their traceroute output into a text area, and the tool analyzes it to create a route map. Results are presented in a table and an interactive map, showing hop numbers, IP addresses (linked to IPinfo), hostnames, locations, ISPs, packet loss (if applicable), and response times. Flyingroutes outputs display alternative paths, and MTR outputs provide packet loss and timing statistics. Internet Exchange Points (IXPs) are identified and marked on the map.\n\nKey features include latency heatmap, route statistics (total one-way time and distance), and the ability to share route links. The tool identifies hops at IXPs and marks them with a green badge.\n\nIt's useful for network troubleshooting, security investigations, geographic routing analysis, understanding network infrastructure, and educational purposes. The tool emphasizes user privacy, stating that data is processed in the browser and not stored on the server. The tool relies on IPinfo and PeeringDB APIs for geolocation and IXP data.\n",
    "chinese_title": "展示一下：路由追踪可视化工具",
    "chinese_summary": "这个“Show HN：路由追踪可视化工具”是一个免费的、基于浏览器的工具，帮助用户以地理方式可视化网络路径。它支持标准的traceroute、tracert、高级飞行路由和MTR输出，显示网络数据包在互联网上的传输路径。\n\n该工具会自动检测用户的IP作为起始点。用户随后将他们的traceroute输出粘贴到文本区域，工具会分析它以创建路由图。结果以表格和交互式地图的形式呈现，显示跳数、IP地址（链接到IPinfo）、主机名、位置、ISP、丢包率（如果适用）和响应时间。飞行路由输出显示替代路径，MTR输出提供丢包率和定时统计信息。互联网交换点（IXP）会被识别并在地图上标记。\n\n主要功能包括延迟热图、路由统计（总单向时间和距离）以及分享路由链接的能力。该工具识别在IXP的跳，并用绿色徽章标记它们。\n\n它对于网络故障排除、安全调查、地理路由分析、理解网络基础设施和教育目的非常有用。该工具强调用户隐私，声明数据在浏览器中处理，不存储在服务器上。该工具依赖IPinfo和PeeringDB API获取地理位置和IXP数据。"
  },
  {
    "id": "45406090",
    "title": "A 3K-year-old copper smelting site could be key to understanding origins of iron",
    "url": "https://phys.org/news/2025-09-year-copper-smelting-site-key.html",
    "summary": "This article details research from Cranfield University revealing how copper smelters may have inadvertently pioneered iron production. Reanalyzing metallurgical remains from the 3000-year-old Kvemo Bolnisi copper smelting site in Georgia, researchers found that iron oxide (hematite) was used as a flux to improve copper yields, contradicting earlier assumptions that the site was an early iron smelting operation.\n\nThe findings support the theory that iron smelting was born from experimentation by copper workers. The use of hematite as a flux demonstrated that these metalworkers recognized iron oxide as a distinct material and explored its properties within furnaces.\n\nThe development of iron metallurgy was a pivotal moment in history. While iron artifacts existed before the Iron Age, they were made from rare meteorite iron. The ability to extract iron from abundant iron ore led to the widespread availability of iron for tools and weapons, driving significant technological and societal changes.\n\nDr. Nathaniel Erb-Satullo emphasizes the significance of Kvemo Bolnisi as evidence of intentional iron use in copper smelting, highlighting its role in the evolution of iron metallurgy. Modern analytical techniques were used to understand the thought processes of these ancient metalworkers by examining slag, a waste product of smelting. This research underscores the importance of copper production sites in understanding the origins of iron technology.\n",
    "chinese_title": "一个三千年前的炼铜遗址可能是了解铁起源的关键。",
    "chinese_summary": "本文详述了克兰菲尔德大学的研究，揭示了炼铜厂可能如何无意中开创了炼铁生产。通过重新分析格鲁吉亚克维莫博尔尼西拥有3000年历史的炼铜遗址的冶金遗骸，研究人员发现氧化铁（赤铁矿）被用作助熔剂以提高铜的产量，这与早期认为该遗址是早期炼铁厂的假设相悖。\n\n研究结果支持了炼铁源于炼铜工人实验的理论。 使用赤铁矿作为助熔剂表明，这些金属工人认识到氧化铁是一种独特的材料，并在炉子中探索了其性质。\n\n冶铁技术的发展是历史上的一个关键时刻。虽然铁器时代之前就存在铁器，但它们是由稀有的陨石铁制成的。 从丰富的铁矿石中提取铁的能力使得铁能够广泛用于工具和武器，从而推动了重大的技术和社会变革。\n\n纳撒尼尔·埃尔布-萨图洛博士强调了克维莫博尔尼西作为铜冶炼中有意使用铁的证据的重要性，突出了它在冶铁技术演变中的作用。 通过检查炉渣（冶炼的废料），现代分析技术被用来了解这些古代金属工人的思维过程。 这项研究强调了铜生产遗址在理解铁技术起源方面的重要性。"
  },
  {
    "id": "45412472",
    "title": "PyOCI – Publish and install private Python packages using OCI/Docker registries",
    "url": "https://github.com/AllexVeldman/pyoci",
    "summary": "PyOCI allows you to use OCI/Docker registries like `ghcr.io` and Azure Container Registry as private Python package indexes, eliminating reliance on dedicated private package hosting services. It acts as a proxy between `pip` and the OCI registry, leveraging existing access control mechanisms like GitHub Packages.\n\nTo install packages, use `pip install --index-url=\"http://<username>:<password>@<pyoci-url>/<OCI-registry-url>/<namespace>/\" <package-name>`. A public PyOCI instance is available at `https://pyoci.com`.\n\nYou can also self-host PyOCI using a Docker container. Configuration is done via environment variables, including `PORT`, `PYOCI_PATH`, `PYOCI_MAX_BODY`, `PYOCI_MAX_VERSIONS`, and `OTLP_ENDPOINT`.\n\nPackages can be labeled by adding custom classifiers in the format `PyOCI :: Label :: <Key> :: <Value>` to your package's metadata. Authentication is handled via `pip`'s Basic authentication, which is forwarded to the OCI registry. Updating packages requires deleting the existing version first. Deletion is supported via a DELETE request if the underlying registry supports content management.\n\nPyOCI is also compatible with Renovate for dependency updates. Configure Renovate with credentials for PyOCI, potentially leveraging GitHub Actions and the `GITHUB_TOKEN` for authentication, granting Renovate read access to your private packages.\n",
    "chinese_title": "使用OCI/Docker镜像仓库发布和安装私有Python包",
    "chinese_summary": "PyOCI允许您使用OCI/Docker镜像仓库（如`ghcr.io`和Azure Container Registry）作为私有Python包索引，从而无需依赖专门的私有包托管服务。它充当`pip`和OCI镜像仓库之间的代理，利用现有的访问控制机制（如GitHub Packages）。\n\n要安装软件包，请使用`pip install --index-url=\"http://<用户名>:<密码>@<pyoci-url>/<OCI-registry-url>/<namespace>/\" <软件包名>`。公共PyOCI实例可在`https://pyoci.com`上找到。\n\n您还可以使用Docker容器自托管PyOCI。配置通过环境变量完成，包括`PORT`、`PYOCI_PATH`、`PYOCI_MAX_BODY`、`PYOCI_MAX_VERSIONS`和`OTLP_ENDPOINT`。\n\n可以通过在软件包的元数据中添加格式为`PyOCI :: Label :: <Key> :: <Value>`的自定义分类器来标记软件包。身份验证通过`pip`的基本身份验证处理，该身份验证将转发到OCI镜像仓库。更新软件包需要先删除现有版本。如果底层镜像仓库支持内容管理，则支持通过DELETE请求进行删除。\n\nPyOCI也与Renovate兼容，可用于依赖项更新。使用PyOCI的凭据配置Renovate，可以利用GitHub Actions和`GITHUB_TOKEN`进行身份验证，从而授予Renovate对您的私有软件包的读取权限。"
  },
  {
    "id": "45412938",
    "title": "Dbos: Durable Workflow Orchestration with Go and PostgreSQL",
    "url": "https://github.com/dbos-inc/dbos-transact-golang",
    "summary": "DBOS (Durable Workflow Orchestration System) is a lightweight system that simplifies adding durable workflows and queues to applications by leveraging PostgreSQL. It aims to reliably handle failures in applications like payment services and data pipelines without complex state management or external orchestration services.\n\nKey features include:\n\n*   **Durable Workflows:** Checkpoint program state in Postgres for automatic resumption after failures, allowing orchestration of business processes and building fault-tolerant data pipelines.\n*   **Durable Queues:** Run tasks in the background with guaranteed completion and result delivery, even after interruptions. Queues provide flow control and can be configured with timeouts, rate limits, deduplication, and prioritization.\n*   **Exactly-Once Event Processing:** Reliably process events such as webhooks and Kafka messages.\n*   **Durable Scheduling:** Schedule workflows using cron syntax or durable sleeps, ensuring execution at the designated time even after restarts.\n*   **Durable Notifications:** Pause workflows until notifications are received or emit events for progress updates, all with exactly-once semantics.\n\nDBOS is compared to other systems like Temporal, Airflow, and Celery/BullMQ, highlighting its advantages in scenarios where minimal rearchitecting, Postgres integration, flexibility in writing workflows as code, and reliability are crucial. While it may not match the performance of dedicated queueing systems, its durability makes it suitable for applications requiring strong guarantees around task completion and workflow execution.\n",
    "chinese_title": "Dbos：使用 Go 和 PostgreSQL 实现的持久化工作流编排",
    "chinese_summary": "DBOS（持久化工作流编排系统）是一个轻量级系统，它通过利用 PostgreSQL 简化了向应用程序添加持久化工作流和队列的过程。其目标是可靠地处理支付服务和数据管道等应用程序中的故障，而无需复杂的状态管理或外部编排服务。\n\n主要特性包括：\n\n*   **持久化工作流：** 在 Postgres 中检查点程序状态，以便在发生故障后自动恢复，从而能够编排业务流程并构建容错数据管道。\n*   **持久化队列：** 在后台运行任务，保证完成和结果交付，即使在中断后也是如此。队列提供流程控制，并且可以配置超时、速率限制、去重和优先级。\n*   **仅一次事件处理：** 可靠地处理诸如 Webhook 和 Kafka 消息之类的事件。\n*   **持久化调度：** 使用 cron 语法或持久化睡眠来调度工作流，确保即使在重启后也能在指定时间执行。\n*   **持久化通知：** 暂停工作流直到收到通知，或者发出事件以进行进度更新，所有这些都具有仅一次语义。\n\nDBOS 与 Temporal、Airflow 和 Celery/BullMQ 等其他系统进行了比较，突出了它在需要最少架构改造、Postgres 集成、以代码形式编写工作流的灵活性以及可靠性至关重要的场景中的优势。虽然它可能无法与专用队列系统的性能相媲美，但其持久性使其适合于需要围绕任务完成和工作流执行提供强有力保证的应用程序。"
  },
  {
    "id": "45456188",
    "title": "10k pushups and other silly exercise quests that changed my life",
    "url": "https://wjgilmore.com/articles/10000-pushups",
    "summary": "In 2025, feeling unhealthy and concerned about his example to his children, the author embarked on a year-long quest to do 10,000 pushups. Initially tracking progress in a Google Sheet, the challenge motivated him to exercise consistently. He combined the pushup goal with other lifestyle changes, including quitting fast food after a bad experience, and limiting alcohol consumption.\n\nThe author experienced fluctuating motivation throughout the year, with dips in exercise during the winter months but increased intensity in the spring and summer. He incorporated other forms of exercise, such as weightlifting, running, and even attempted the splits. A friendly pushup competition at work and a self-organized \"5/15/500 Challenge\" (running, biking, bodyweight exercises) further fueled his commitment.\n\nDiet became a focus, initially involving calorie restriction and later shifting to eliminating products with microplastics and heavy metals. He signed up for a half marathon, investing in a running watch to track his pace and utilizing GU packs for endurance.\n\nBy September 2025, the author reached his 10,000 pushup goal and experienced significant positive changes. He became visibly more muscular, his clothes no longer fit, and he received compliments on his improved physique. The journey instilled discipline, a healthier lifestyle, and a newfound appreciation for exercise and mindful eating. Despite a calf injury at the end of the month, the author's overall health and well-being drastically improved.\n",
    "chinese_title": "一万个俯卧撑和其他改变我人生的愚蠢健身挑战",
    "chinese_summary": "2025年，由于感到身体不适并担忧自己对孩子的榜样作用，作者开始了为期一年的挑战，目标是完成一万个俯卧撑。最初，他用 Google Sheet 记录进度，这项挑战激励他坚持锻炼。他将俯卧撑目标与其他生活方式的改变相结合，包括在一次糟糕的经历后戒掉快餐，并限制酒精摄入。\n\n在这一年中，作者的动力时有起伏，冬季月份运动量下降，但在春夏季节则增加了强度。他加入了其他形式的锻炼，例如举重、跑步，甚至尝试劈叉。工作中友好的俯卧撑比赛和一个自行组织的“5/15/500 挑战”（跑步、骑自行车、自重训练）进一步激发了他的投入。\n\n饮食成为了重点，最初涉及卡路里限制，后来转变为消除含有微塑料和重金属的产品。他报名参加了半程马拉松，购买了一块跑步手表来追踪他的配速，并利用 GU 能量胶来增强耐力。\n\n到 2025 年 9 月，作者完成了他的一万个俯卧撑的目标，并经历了显著的积极变化。他的肌肉明显增加，衣服不再合身，并且他收到了关于他改善后的体格的赞扬。这次旅程培养了自律、更健康的生活方式，以及对运动和正念饮食的新认识。尽管月底小腿受伤，作者的整体健康和福祉得到了显著改善。"
  },
  {
    "id": "45455648",
    "title": "Writing an LLM from scratch, part 20 – starting training, and cross entropy loss",
    "url": "https://www.gilesthomas.com/2025/10/llm-from-scratch-20-starting-training-cross-entropy-loss",
    "summary": "In this blog post, Giles delves into the training process of an LLM, specifically focusing on the loss function and cross-entropy loss. He begins by referencing Chapter 5 of Sebastian Raschka's book \"Build a Large Language Model (from Scratch),\" which explains how to train an LLM. Giles highlights the importance of a loss function in gradient descent, which indicates the inaccuracy of the model's results.\n\nHe explains how LLMs predict logits (predictions) for each token in an input sequence and how the training targets are the original sequence \"shifted left.\" This allows for multiple training runs from a single input sequence. Giles emphasizes that each prefix sequence/target pair can be treated as stand-alone for calculating the loss function.\n\nThe core of the post revolves around cross-entropy loss, a method to measure how far off the model's prediction is from the target token. He explains that instead of comparing the differences in probabilities across all tokens, focusing solely on the probability assigned to the target token and minimizing the negative logarithm of that probability effectively trains the model. He breaks down the math of cross-entropy loss, explaining how it relates to measuring the difference between the predicted probability and the actual (one-hot encoded) target.\n\nGiles also addresses the question of why it's called \"cross-entropy\" by providing a high-level explanation of entropy in information theory and its connection to the concept of \"messiness\" in probability distributions.\n",
    "chinese_title": "从零开始编写LLM，第20部分：开始训练，以及交叉熵损失",
    "chinese_summary": "在这篇博文中，Giles深入探讨了LLM的训练过程，特别是着重讲解了损失函数和交叉熵损失。他首先引用了Sebastian Raschka所著《从零开始构建大型语言模型》一书的第五章，该章节解释了如何训练LLM。Giles强调了损失函数在梯度下降中的重要性，它能指示模型结果的不准确性。\n\n他解释了LLM如何预测输入序列中每个token的logits（预测值），以及训练目标如何是“左移”的原始序列。这使得从单个输入序列中进行多次训练成为可能。Giles强调，每个前缀序列/目标对都可以被视为独立的，用于计算损失函数。\n\n这篇博文的核心围绕交叉熵损失展开，这是一种衡量模型预测与目标token偏差程度的方法。他解释说，与其比较所有token概率之间的差异，不如只关注分配给目标token的概率，并通过最小化该概率的负对数来有效地训练模型。他分解了交叉熵损失的数学原理，解释了它如何衡量预测概率与实际（one-hot编码）目标之间的差异。\n\nGiles还通过对信息论中熵的高层次解释以及它与概率分布“混乱度”概念的联系，解答了为什么它被称为“交叉熵”。"
  },
  {
    "id": "45451971",
    "title": "Y'all are over-complicating these AI-risk arguments",
    "url": "https://dynomight.net/ai-risk/",
    "summary": "The author argues that AI-risk arguments are often overly complex and proposes a simpler alternative based on the analogy of highly intelligent aliens arriving on Earth. This simple argument boils down to: if AI with an IQ of 300 is possible in the coming decades, and we don't know what it would be like, then we should be concerned about AI-risk, just as we'd be concerned about such aliens.\n\nThe author prefers the simple argument because it's more likely to be true (due to fewer assumptions) and more convincing (relying on existing intuitions). It also helps identify the core disagreement: whether people truly believe AI with human-like capabilities and super-intelligence is possible.\n\nHowever, the author also acknowledges the case for the complex argument, specifically a \"middle\" version that posits that *if* things go wrong with humanity, AI will *likely* be the cause. This justifies focusing on the complex scenario.\n\nFinally, the author addresses the question of which argument to use from a strategic messaging perspective. While initially favoring the simple argument for its clarity, the author considers recent polls showing widespread concern about AI. This leads the author to speculate that a more confident, albeit complex, argument might be more effective, encouraging people to move beyond a passive state of worry and take action. The author concludes by advocating for arguing what you genuinely believe, rather than watering it down for perceived optics.\n",
    "chinese_title": "你们把这些人工智能风险的争论想得太复杂了。",
    "chinese_summary": "作者认为，人工智能风险论证常常过于复杂，并提出一个更简单的替代方案，基于高智商外星人抵达地球的类比。这个简单论证归结为：如果在未来几十年内具备300智商的人工智能是可能的，而且我们不知道它会是什么样子，那么我们就应该关注人工智能风险，正如我们应该关注这类外星人一样。\n\n作者倾向于这个简单论证，因为它更可能为真（由于假设更少）且更具说服力（依赖于现有直觉）。它也有助于识别核心分歧：人们是否真正相信具备类人能力和超人工智能的人工智能是可能的。\n\n然而，作者也承认复杂论证的合理性，特别是“中间”版本，即*如果*人类出现问题，人工智能*很可能*是原因。这证明了专注于复杂情景是合理的。\n\n最后，作者从战略信息传递的角度探讨了使用哪种论证的问题。虽然最初倾向于简单论证的清晰性，但作者考虑到最近的民意调查显示，人们普遍担忧人工智能。这使得作者推测，一个更自信、尽管复杂的论证可能更有效，鼓励人们摆脱被动的担忧状态并采取行动。作者最后主张，应该论证你真正相信的事情，而不是为了所谓的观感而淡化它。"
  },
  {
    "id": "45454374",
    "title": "Why most product planning is bad and what to do about it",
    "url": "https://blog.railway.com/p/product-planning-improvement",
    "summary": "Angelo Saraceno's article, \"Why most product planning is bad and what to do about it,\" details Railway's journey to improve their planning process as they scaled to over 1.7 million users. Frustrated with traditional methods like OKRs that created more ceremony than clarity, they developed \"Problem Driven Development.\"\n\nThe article argues that traditional planning often relies on metrics-driven ceremonies, feature requests blocking deals, or founder intuition, leading to engineer dissatisfaction. Railway initially tried a lightweight SAFE approach, then OKRs, but found OKRs inflexible and reliant on concrete, easily measurable goals, better suited for factories or sales than creative engineering work.\n\nTheir solution, Problem Driven Development, is a 4-day quarterly process focusing on identifying and prioritizing problems, not solutions. Teams independently log problems, a \"planning captain\" assigns priorities, and then dependencies and capacity are checked. Finally, teams commit publicly and assign a DRI (Directly Responsible Individual) to each problem. Only after commitment do they begin RFCs and Linear tickets.\n\nKey takeaways:\n\n*   **Focus on problems, not solutions, initially.** This prevents attachment to premature solutions.\n*   **Independent team prioritization** avoids domination by the loudest voice.\n*   **Front-load hard conversations** about dependencies and capacity.\n*   **Public commitment** fosters accountability.\n\nSaraceno emphasizes that the process is not rocket science, but culture is crucial. Creating an environment where people can safely raise problems without defending solutions is key. They plan to open-source their Notion templates and acknowledge the process will continue to evolve.\n",
    "chinese_title": "为什么大多数产品规划都很糟糕以及如何改进",
    "chinese_summary": "安杰洛·萨拉切诺的文章《为什么大多数产品规划都很糟糕以及如何改进》详细介绍了 Railway 在用户规模扩展到 170 万以上时改进规划流程的历程。他们对传统方法（如 OKR，这种方法形式大于内容）感到失望，因此开发了“问题驱动开发”。\n\n文章认为，传统规划往往依赖于指标驱动的形式主义、阻碍交易的功能请求或创始人直觉，导致工程师不满。Railway 最初尝试了一种轻量级的 SAFE 方法，然后尝试了 OKR，但发现 OKR 缺乏灵活性，并且依赖于具体的、易于衡量的目标，更适合工厂或销售，而不是创造性的工程工作。\n\n他们的解决方案“问题驱动开发”是一个为期 4 天的季度流程，侧重于识别和优先排序问题，而不是解决方案。团队独立记录问题，“规划负责人”分配优先级，然后检查依赖关系和容量。最后，团队公开承诺，并为每个问题分配一名 DRI（直接责任人）。只有在承诺之后，他们才开始 RFC 和 Linear 工单。\n\n主要收获：\n\n*   **最初关注问题，而不是解决方案。** 这可以防止过早地依附于不成熟的解决方案。\n*   **独立团队优先级排序** 避免了最吵闹的声音的主导。\n*   **提前进行关于依赖关系和容量的艰难对话。**\n*   **公开承诺** 培养了责任感。\n\n萨拉切诺强调，这个过程并非高深莫测，但文化至关重要。创造一个人们可以安全地提出问题而不必为解决方案辩护的环境是关键。他们计划开源他们的 Notion 模板，并承认这个过程将继续发展。"
  },
  {
    "id": "45463817",
    "title": "Perplexity releases Comet browser for free on Windows and macOS",
    "url": "https://www.ghacks.net/2025/10/03/perplexity-releases-comet-browser-for-free-on-windows-and-macos/",
    "summary": "Perplexity has released its AI-powered \"Comet\" browser for free on Windows and macOS after initially launching it for subscribers in July. The author provides a neutral overview of the browser based on limited testing, emphasizing it's not a review.\n\nComet, built on Chromium, imports data from existing browsers. It features a familiar interface with a built-in ad blocker and AI-powered functionalities like a \"Summarize\" button and an \"Assistant\" chatbot. A key feature is its \"agentic AI,\" allowing users to delegate tasks like finding coupons or comparing products, which the browser then automates.\n\nThe author notes drawbacks, including persistent sign-in pop-ups and a subpar built-in ad blocker compared to extensions like uBlock Origin Lite. They also criticize the lack of options to customize the new tab experience. The author expresses privacy concerns regarding AI and states they used the browser without signing in.\n\nThe article highlights Perplexity's \"Comet Plus\" subscription (included in Perplexity Pro Max), aimed at supporting journalism. For $5 per month, it gives users and the AI browser access to content from partner news publishers like CNN, Wired, and The Washington Post. The author questions what support would be provided to other publishers. The author concludes by asking readers to share their own experiences with the Comet browser.\n",
    "chinese_title": "Perplexity 在 Windows 和 macOS 上免费发布 Comet 浏览器",
    "chinese_summary": "Perplexity 在七月最初面向订阅用户推出后，现已在 Windows 和 macOS 上免费发布其 AI 驱动的“Comet”浏览器。 作者根据有限的测试对该浏览器进行了中立的概述，并强调这不是一篇评测。\n\nComet 基于 Chromium 构建，可从现有浏览器导入数据。 它具有熟悉的界面，内置广告拦截器和 AI 驱动的功能，如“总结”按钮和“助手”聊天机器人。 一个关键特性是其“智能 AI”，允许用户委托任务，例如查找优惠券或比较产品，然后由浏览器自动执行。\n\n作者指出了一些缺点，包括持续的登录弹出窗口和与 uBlock Origin Lite 等扩展程序相比之下，内置广告拦截器的效果不佳。 他们还批评缺乏自定义新标签页体验的选项。 作者对 AI 表达了隐私担忧，并声明他们在未登录的情况下使用了该浏览器。\n\n文章重点介绍了 Perplexity 的“Comet Plus”订阅服务（包含在 Perplexity Pro Max 中），旨在支持新闻业。 每月 5 美元，它使用户和 AI 浏览器能够访问来自 CNN、Wired 和《华盛顿邮报》等合作新闻出版商的内容。 作者质疑将为其他出版商提供什么样的支持。 作者最后请读者分享他们自己使用 Comet 浏览器的体验。"
  },
  {
    "id": "45450525",
    "title": "Work is not school: Surviving institutional stupidity",
    "url": "https://www.leadingsapiens.com/surviving-institutional-stupidity/",
    "summary": "This article argues that the workplace operates under a different set of rules than school, where merit alone doesn't guarantee success. Instead, organizations are often driven by \"institutional stupidity,\" flawed psychology, and competing interests. The piece serves as a guide for high-performers struggling with this reality.\n\nKey takeaways include: blaming \"stupidity\" (inertia, bad incentives) instead of malice allows for a more curious and proactive approach. Merit is important, but it requires visibility and strategic positioning. Perception, especially among key influencers, matters just as much as performance, requiring active management of your narrative.\n\nThe article emphasizes the importance of understanding the subjective logic within organizations and positioning your work effectively to resonate with decision-makers. It also warns against applying personal standards universally, advocating for recognizing and anticipating asymmetry in how others operate.\n\nFurthermore, it acknowledges the bottleneck at higher organizational levels, where subjective criteria prevail. Playing the \"long game\" requires frustration tolerance and a clear understanding of the games being played.  Focusing on your circle of control and maintaining an internal locus of control helps prevent burnout. Finally, it advocates for a \"balanced portfolio\" of meaning beyond work to build resilience against organizational setbacks. The article concludes that navigating organizational absurdities involves understanding the system to contribute effectively from within.\n",
    "chinese_title": "工作不是学校：如何在机构愚蠢中求生",
    "chinese_summary": "本文认为，职场的运行规则与学校不同，仅凭能力无法保证成功。相反，组织常常受到“制度性愚蠢”、有缺陷的心理和相互竞争的利益所驱动。本文旨在为那些在现实中挣扎的高绩效者提供指导。\n\n主要观点包括：将问题归咎于“愚蠢”（惯性、不良激励）而不是恶意，能让人采取更积极主动的态度。能力很重要，但需要可见性和战略定位。感知，尤其是在关键影响者中的感知，与绩效同等重要，需要积极管理个人形象。\n\n本文强调理解组织内部的主观逻辑，并有效定位你的工作，使其与决策者产生共鸣的重要性。它还警告不要将个人标准普遍应用，主张认识并预见他人行事方式的不对称性。\n\n此外，本文承认在更高组织层级存在瓶颈，主观标准占据主导地位。“放长线钓大鱼”需要容忍挫折和清楚了解游戏规则。专注于你的可控范围并保持内在控制点有助于防止倦怠。最后，本文倡导建立工作之外的“平衡意义组合”，以增强应对组织挫折的韧性。文章总结道，驾驭组织的荒谬之处在于理解系统，从而从内部有效做出贡献。"
  },
  {
    "id": "45448326",
    "title": "NL Judge: Meta must respect user's choice of recommendation system",
    "url": "https://www.bitsoffreedom.nl/2025/10/02/judge-in-the-bits-of-freedom-vs-meta-lawsuit-meta-must-respect-users-choice/",
    "summary": "In a victory for digital rights, a Dutch judge has ruled that Meta is violating the Digital Services Act (DSA) by limiting user control over their Facebook and Instagram feeds. The lawsuit, brought by Bits of Freedom, argued that Meta's design undermines user autonomy by prioritizing a profiling-based feed optimized for ad revenue and hiding the non-profiled alternative.\n\nThe judge agreed, stating that Meta’s \"non-persistent choice option\" for recommendation systems contradicts the DSA's goal of empowering users with genuine control over their information consumption. The court found that Meta's platform design \"significantly disrupts the autonomy\" of users. The ruling mandates that Meta adjust its apps to preserve the user's feed choice across sessions and app sections.\n\nBits of Freedom spokesperson Maartje Knaap welcomed the decision, emphasizing the importance of preventing tech companies from dictating users' worldviews, particularly during election periods. While celebrating the win, Knaap acknowledged that this is just one step in a larger effort to hold Meta accountable and curb its influence. She hopes the ruling will inspire other organizations and regulators worldwide to challenge Meta's power and push for greater user autonomy on social media platforms.\n",
    "chinese_title": "荷兰法官：Meta必须尊重用户对推荐系统的选择",
    "chinese_summary": "荷兰法官裁定Meta违反《数字服务法》，用户对其Facebook和Instagram信息流控制受限。"
  },
  {
    "id": "45462094",
    "title": "Move over Dijkstra: New Algorithm Just Rewrote 70 Years of Computer Science",
    "url": "https://medium.com/@kanishks772/move-over-dijkstra-the-new-algorithm-that-just-rewrote-70-years-of-computer-science-d670696c440d",
    "summary": "This article announces a significant breakthrough in computer science: a new algorithm developed by Ran Duan's team at Tsinghua University that surpasses Dijkstra's algorithm in finding shortest paths. For nearly 70 years, Dijkstra's algorithm, created in 1956, has been the dominant method for this task, underpinning applications from GPS to network routing. Dijkstra's algorithm works by greedily selecting the closest unvisited vertex using a sorted priority queue.\n\nThe new algorithm achieves a deterministic O(m log^(2/3) n)-time complexity, breaking the \"sorting barrier\" that has limited shortest-path algorithms for the past 40 years. This advancement is described as a challenge to textbook assumptions and a significant step forward in algorithmic efficiency.\n",
    "chinese_title": "让路狄克斯特拉：新算法改写了计算机科学70年历史",
    "chinese_summary": "清华大学段然团队开发出一种超越Dijkstra算法的新算法，在寻找最短路径方面取得了重大突破。近70年来，Dijkstra算法（1956年创建）一直是该任务的主导方法，支撑着从GPS到网络路由等应用。Dijkstra算法通过使用排序优先级队列贪婪地选择最近的未访问顶点来工作。\n\n新算法实现了确定性的O(m log^(2/3) n)时间复杂度，打破了过去40年来限制最短路径算法的“排序壁垒”。 这一进步被描述为对教科书假设的挑战，也是算法效率方面的一个重大进步。"
  },
  {
    "id": "45415196",
    "title": "Class Dismissed: Profile of Joe Liemandt and Alpha School",
    "url": "https://joincolossus.com/article/joe-liemandt-class-dismissed/",
    "summary": "Okay, I have read the article \"Class Dismissed: Profile of Joe Liemandt and Alpha School\" from the provided URL.\n\nHere's a concise summary:\n\nThe article profiles Joe Liemandt, a highly successful, yet relatively unknown, entrepreneur who made his fortune in enterprise software. Liemandt dropped out of Stanford to found Trilogy, a company that specialized in configuring complex products. Trilogy thrived in the 1990s, making Liemandt a billionaire.\n\nThe article attributes Liemandt's success to his focus on identifying talented individuals, fostering a culture of relentless hard work and innovation, and focusing on complex, niche markets. He was known for hiring young, ambitious individuals and challenging them to push their limits.\n\nPost-Trilogy, Liemandt founded ESW Capital, a private equity firm that acquires and turns around struggling software companies. ESW's strategy involves aggressive cost-cutting, operational efficiency improvements, and a heavy emphasis on standardized processes. ESW, like Trilogy, is known for its demanding work environment.\n\nMore recently, Liemandt founded Alpha School, an educational venture aimed at equipping young people with practical skills in software development, sales, and marketing. Alpha School is designed to accelerate the learning process and prepare students for high-demand jobs in the tech industry. The article highlights the potential of Alpha School to disrupt traditional education models by focusing on skills-based training and direct placement into jobs. Liemandt's vision is to create a workforce ready to tackle the challenges of the modern tech landscape. The article presents Liemandt as a driven individual with a unique approach to business and education, consistently seeking to optimize and accelerate progress.\n",
    "chinese_title": "下课铃响：乔·利曼德和阿尔法学校侧写",
    "chinese_summary": "好的，我已阅读了来自所提供URL的文章“课堂解散：Joe Liemandt和Alpha School的简介”。\n\n以下是一个简明扼要的总结：\n\n这篇文章介绍了乔·利曼特(Joe Liemandt)，一位非常成功但相对不为人知的企业家，他在企业软件领域发了财。利曼特从斯坦福大学辍学，创立了Trilogy公司，该公司专门从事复杂产品的配置。Trilogy在20世纪90年代蓬勃发展，使利曼特成为亿万富翁。\n\n这篇文章将利曼特的成功归因于他专注于识别有才华的人、培养一种坚持不懈的努力工作和创新的文化，以及专注于复杂的小众市场。他以雇用年轻、雄心勃勃的人，并挑战他们突破自己的极限而闻名。\n\n在Trilogy之后，利曼特创立了ESW Capital，一家收购并扭转困境软件公司的私募股权公司。ESW的策略包括激进的削减成本、运营效率的提高，以及对标准化流程的重视。ESW与Trilogy一样，以其严苛的工作环境而闻名。\n\n最近，利曼特创立了Alpha School，一项旨在为年轻人提供软件开发、销售和营销方面实用技能的教育事业。Alpha School旨在加速学习过程，并为学生准备科技行业高需求的工作。这篇文章强调了Alpha School通过专注于基于技能的培训和直接就业安置来颠覆传统教育模式的潜力。利曼特的愿景是创建一个能够应对现代科技领域挑战的劳动力队伍。这篇文章将利曼特描述为一个充满动力的人，他对商业和教育有着独特的方法，并不断寻求优化和加速进步。"
  },
  {
    "id": "45411866",
    "title": "A primer for using weather surveillance radar to study bird migration",
    "url": "https://birdcast.info/news/a-primer-for-using-weather-surveillance-radar-to-study-bird-migration/",
    "summary": "生成摘要时出错",
    "chinese_title": "A primer for using weather surveillance radar to study bird migration",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45439997",
    "title": "The RAG Obituary: Killed by agents, buried by context windows",
    "url": "https://www.nicolasbustamante.com/p/the-rag-obituary-killed-by-agents",
    "summary": "生成摘要时出错",
    "chinese_title": "The RAG Obituary: Killed by agents, buried by context windows",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45454460",
    "title": "Anti-aging breakthrough: Stem cells reverse signs of aging in monkeys",
    "url": "https://www.nad.com/news/anti-aging-breakthrough-stem-cells-reverse-signs-of-aging-in-monkeys",
    "summary": "生成摘要时出错",
    "chinese_title": "Anti-aging breakthrough: Stem cells reverse signs of aging in monkeys",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45458987",
    "title": "'Western Qwen': IBM Wows with Granite 4 LLM Launch and Hybrid Mamba/Transformer",
    "url": "https://venturebeat.com/ai/western-qwen-ibm-wows-with-granite-4-llm-launch-and-hybrid-mamba-transformer",
    "summary": "生成摘要时出错",
    "chinese_title": "'Western Qwen': IBM Wows with Granite 4 LLM Launch and Hybrid Mamba/Transformer",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45414718",
    "title": "The history of cataract surgery",
    "url": "https://www.asimov.press/p/cataracts",
    "summary": "生成摘要时出错",
    "chinese_title": "The history of cataract surgery",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45435720",
    "title": "Pre-record your demos",
    "url": "https://www.steveharrison.dev/pre-record-your-demos/",
    "summary": "生成摘要时出错",
    "chinese_title": "Pre-record your demos",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45439670",
    "title": "Gmail will no longer support checking emails from third-party accounts via POP",
    "url": "https://support.google.com/mail/answer/16604719?hl=en",
    "summary": "生成摘要时出错",
    "chinese_title": "Gmail will no longer support checking emails from third-party accounts via POP",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45458455",
    "title": "Which Table Format Do LLMs Understand Best? (Results for 11 Formats)",
    "url": "https://www.improvingagents.com/blog/best-input-data-format-for-llms",
    "summary": "生成摘要时出错",
    "chinese_title": "Which Table Format Do LLMs Understand Best? (Results for 11 Formats)",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45450449",
    "title": "Two Amazon delivery drones crash into crane in commercial area of Tolleson, AZ",
    "url": "https://www.abc15.com/news/region-west-valley/tolleson/two-amazon-delivery-drones-crash-into-crane-in-commercial-area-of-tolleson",
    "summary": "生成摘要时出错",
    "chinese_title": "Two Amazon delivery drones crash into crane in commercial area of Tolleson, AZ",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45446834",
    "title": "Immich v2.0.0 – First stable release",
    "url": "https://github.com/immich-app/immich/discussions/22546",
    "summary": "生成摘要时出错",
    "chinese_title": "Immich v2.0.0 – First stable release",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45445114",
    "title": "Keyhive – Local-first access control",
    "url": "https://www.inkandswitch.com/keyhive/notebook/",
    "summary": "生成摘要时出错",
    "chinese_title": "Keyhive – Local-first access control",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45453299",
    "title": "The Answer (1954)",
    "url": "https://sfshortstories.com/?p=5983",
    "summary": "生成摘要时出错",
    "chinese_title": "The Answer (1954)",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45448772",
    "title": "Red Hat confirms security incident after hackers breach GitLab instance",
    "url": "https://www.bleepingcomputer.com/news/security/red-hat-confirms-security-incident-after-hackers-claim-github-breach/",
    "summary": "生成摘要时出错",
    "chinese_title": "Red Hat confirms security incident after hackers breach GitLab instance",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45461066",
    "title": "Sony's New Global Shutter Sensor Captures 105 Megapixels at 100FPS",
    "url": "https://petapixel.com/2025/09/29/sonys-new-global-shutter-sensor-captures-105-megapixels-at-100fps/",
    "summary": "生成摘要时出错",
    "chinese_title": "Sony's New Global Shutter Sensor Captures 105 Megapixels at 100FPS",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45410068",
    "title": "I built ChatGPT with Minecraft redstone [video]",
    "url": "https://www.youtube.com/watch?v=VaeI9YgE1o8",
    "summary": "生成摘要时出错",
    "chinese_title": "I built ChatGPT with Minecraft redstone [video]",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45458482",
    "title": "Google Workspace Updates: Send Gmail end-to-end encrypted emails to anyone",
    "url": "https://workspaceupdates.googleblog.com/2025/10/send-gmail-end-to-end-encrypted-emails-in-gmail.html",
    "summary": "生成摘要时出错",
    "chinese_title": "Google Workspace Updates: Send Gmail end-to-end encrypted emails to anyone",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45458791",
    "title": "Blender 4.5 LTS",
    "url": "https://lwn.net/Articles/1036262/",
    "summary": "生成摘要时出错",
    "chinese_title": "Blender 4.5 LTS",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45453448",
    "title": "Gemini 3.0 Pro – early tests",
    "url": "https://twitter.com/chetaslua/status/1973694615518880236",
    "summary": "生成摘要时出错",
    "chinese_title": "Gemini 3.0 Pro – early tests",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45404378",
    "title": "A replica of Citizen Quartz watch based on Harel's paper introducing statecharts",
    "url": "https://andyjakubowski.github.io/statechart-watch/",
    "summary": "生成摘要时出错",
    "chinese_title": "A replica of Citizen Quartz watch based on Harel's paper introducing statecharts",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45437759",
    "title": "F3: Open-source data file format for the future [pdf]",
    "url": "https://db.cs.cmu.edu/papers/2025/zeng-sigmod2025.pdf",
    "summary": "生成摘要时出错",
    "chinese_title": "F3: Open-source data file format for the future [pdf]",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45415591",
    "title": "IP over Lasers",
    "url": "https://www.mikekohn.net/micro/ip_over_lasers.php",
    "summary": "生成摘要时出错",
    "chinese_title": "IP over Lasers",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45406804",
    "title": "Throne of the Third Heaven of the Nations' Millennium General Assembly (2021)",
    "url": "https://americanart.si.edu/blog/throne-james-hampton",
    "summary": "生成摘要时出错",
    "chinese_title": "Throne of the Third Heaven of the Nations' Millennium General Assembly (2021)",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45438346",
    "title": "Show HN: Autism Simulator",
    "url": "https://autism-simulator.vercel.app/",
    "summary": "生成摘要时出错",
    "chinese_title": "Show HN: Autism Simulator",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45406879",
    "title": "Make the most of compiled C loops on the 68000",
    "url": "https://dciabrin.net/posts/make-the-most-of-compiled-c-loops-on-the-68000/make-the-most-of-compiled-c-loops-on-the-68000/",
    "summary": "生成摘要时出错",
    "chinese_title": "Make the most of compiled C loops on the 68000",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45400006",
    "title": "Show HN: The Unite real time operating system",
    "url": "https://jacquesmattheij.com/unite-operating-system/",
    "summary": "生成摘要时出错",
    "chinese_title": "Show HN: The Unite real time operating system",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45456003",
    "title": "PortalVR: XR Without a Headset",
    "url": "https://portalvr.io/",
    "summary": "生成摘要时出错",
    "chinese_title": "PortalVR: XR Without a Headset",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45430294",
    "title": "Show HN: Glide, an extensible, keyboard-focused web browser",
    "url": "https://blog.craigie.dev/introducing-glide/",
    "summary": "生成摘要时出错",
    "chinese_title": "Show HN: Glide, an extensible, keyboard-focused web browser",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45416552",
    "title": "Adding a new instruction to RISC-V back end in LLVM",
    "url": "https://blog.gustavoleite.me/llvm-riscv-instruction",
    "summary": "生成摘要时出错",
    "chinese_title": "Adding a new instruction to RISC-V back end in LLVM",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45457333",
    "title": "Apple takes down ICE tracking apps after pressure from DOJ",
    "url": "https://www.foxbusiness.com/politics/apple-takes-down-ice-tracking-app-after-pressure-from-ag-bondi",
    "summary": "生成摘要时出错",
    "chinese_title": "Apple takes down ICE tracking apps after pressure from DOJ",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45441222",
    "title": "Increasing your practice surface area",
    "url": "https://www.indiehackers.com/post/lifestyle/increasing-your-practice-surface-area-agxYGi9bL0gd1WYYQZAu",
    "summary": "生成摘要时出错",
    "chinese_title": "Increasing your practice surface area",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45458048",
    "title": "Show HN: BetterBrain – Dementia prevention, covered by insurance",
    "url": "https://www.betterbrain.com/insurance",
    "summary": "生成摘要时出错",
    "chinese_title": "Show HN: BetterBrain – Dementia prevention, covered by insurance",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45444694",
    "title": "Cormac McCarthy's personal library",
    "url": "https://www.smithsonianmag.com/arts-culture/two-years-cormac-mccarthys-death-rare-access-to-personal-library-reveals-man-behind-myth-180987150/",
    "summary": "生成摘要时出错",
    "chinese_title": "Cormac McCarthy's personal library",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45449670",
    "title": "Forth in Zig and WebAssembly",
    "url": "https://zig-wasm.github.io/zorth/",
    "summary": "生成摘要时出错",
    "chinese_title": "Forth in Zig and WebAssembly",
    "chinese_summary": "生成摘要时出错"
  }
]