[
  {
    "id": "44953032",
    "title": "How We Exploited CodeRabbit: From Simple PR to RCE and Write Access on 1M Repos",
    "url": "https://research.kudelskisecurity.com/2025/08/19/how-we-exploited-coderabbit-from-a-simple-pr-to-rce-and-write-access-on-1m-repositories/",
    "summary": "Nils Amiet details how they achieved remote code execution (RCE) on CodeRabbit's production servers, gaining access to sensitive data and potentially impacting 1 million code repositories. Prompted by a conversation after a security talk, Amiet investigated CodeRabbit, an AI code review tool popular on GitHub and GitLab.\n\nBy exploiting CodeRabbit's support for various static analysis tools, particularly Rubocop (a Ruby static analyzer), Amiet discovered a vulnerability. CodeRabbit allows users to configure these tools with configuration files. Amiet created a malicious pull request containing a Rubocop configuration file (.rubocop.yml) that loaded a malicious Ruby extension (ext.rb). This extension, when executed by Rubocop, exfiltrated the server's environment variables to an attacker-controlled server.\n\nThe leaked environment variables included API keys for OpenAI, Anthropic, Pinecone, Langchain, and other services, along with database credentials (PostgreSQL host, username, and password), the CodeRabbit GitHub App's private key and secrets, and other sensitive information. The obtained RCE could have been used to connect to the internal Postgres database, potentially enabling destructive operations or extraction of source code from the Docker container. This exploit demonstrated a significant security flaw in CodeRabbit's handling of external tools and configuration, ultimately granting read and write access to a vast number of code repositories.\n",
    "chinese_title": "我们如何利用 CodeRabbit：从简单的 PR 到 RCE 以及 100 万个代码仓库的写入权限",
    "chinese_summary": "尼尔斯·阿米埃特详细描述了他们如何在 CodeRabbit 的生产服务器上实现远程代码执行 (RCE)，从而获得对敏感数据的访问权限并可能影响 100 万个代码仓库。在一次安全讲座后的谈话启发下，阿米埃特调查了 CodeRabbit，这是一款在 GitHub 和 GitLab 上流行的 AI 代码审查工具。\n\n通过利用 CodeRabbit 对各种静态分析工具的支持，特别是 Rubocop (一个 Ruby 静态分析器)，阿米埃特发现了一个漏洞。CodeRabbit 允许用户使用配置文件来配置这些工具。阿米埃特创建了一个包含恶意 Rubocop 配置文件 (.rubocop.yml) 的恶意拉取请求，该文件加载了一个恶意的 Ruby 扩展 (ext.rb)。该扩展程序在被 Rubocop 执行时，会将服务器的环境变量泄露到一个攻击者控制的服务器。\n\n泄露的环境变量包括 OpenAI、Anthropic、Pinecone、Langchain 和其他服务的 API 密钥，以及数据库凭据（PostgreSQL 主机、用户名和密码）、CodeRabbit GitHub App 的私钥和密钥，以及其他敏感信息。获得的 RCE 本可用于连接到内部 Postgres 数据库，从而可能实现破坏性操作或从 Docker 容器中提取源代码。这一漏洞演示了 CodeRabbit 在处理外部工具和配置方面的重大安全缺陷，最终授予了对大量代码仓库的读写访问权限。"
  },
  {
    "id": "44951563",
    "title": "Without the Futex, It's Futile",
    "url": "https://h4x0r.org/futex/",
    "summary": "This article criticizes \"The Art of Multiprocessor Programming\" for its failure to cover futexes, a fundamental building block for modern concurrent programming. The author argues that futexes have revolutionized concurrency, making older System V IPC methods obsolete.\n\nFutexes separate locking from waiting and waking, enabling better performance by avoiding unnecessary system calls. Unlike System V, unlock operations can avoid kernel calls if no threads are waiting. Futexes allow threads to block and queue within the kernel, associated with a memory address, and include an optional timeout. The article highlights that the OS handles the order of operations on the futex, enqueuing waiters only with the correct view of the current state.\n\nThe author provides code examples, including wrappers for futex functionality on Linux and macOS, and demonstrates how to build a basic mutex and spin lock using futexes. The spin lock code shows the implementation of acquiring and releasing a lock using atomic operations. The article also discusses the issues of heavy contention, improper unlocking, and deadlock that could arise in spin locks. The author criticizes the book's suggestion to use `sleep()` for exponential backoff when dealing with lock contention and the wasted time spent blocking when the lock is released before the thread wakes up.\n",
    "chinese_title": "没有 Futex，徒劳无功。",
    "chinese_summary": "本文批评《多处理器编程的艺术》未涵盖 futex，这是一种现代并发编程的基本构建块。作者认为，futex 已经彻底改变了并发性，使得较旧的 System V IPC 方法过时。\n\nFutex 将锁定与等待和唤醒分离，通过避免不必要的系统调用来实现更好的性能。与 System V 不同，如果没有线程在等待，解锁操作可以避免内核调用。 Futex 允许线程在内核中阻塞和排队，并与内存地址关联，还包括可选的超时。本文强调，操作系统处理 futex 上的操作顺序，仅在对当前状态有正确视图时才将等待者入队。\n\n作者提供了代码示例，包括 Linux 和 macOS 上 futex 功能的封装，并演示了如何使用 futex 构建基本的互斥锁和自旋锁。自旋锁代码展示了使用原子操作获取和释放锁的实现。本文还讨论了自旋锁中可能出现的重度争用、不正确的解锁和死锁问题。作者批评了该书建议在使用指数退避来处理锁争用时使用 `sleep()`，以及在线程唤醒之前锁已释放时浪费的阻塞时间。"
  },
  {
    "id": "44953316",
    "title": "Emacs as your video-trimming tool",
    "url": "https://xenodium.com/emacs-as-your-video-trimming-tool",
    "summary": "This article discusses how to use Emacs as a video trimming tool, inspired by a blog post from Marcin 'mbork' Borkowski. The author, also needing a simple trimming solution beyond macOS's QuickTime Player, developed `video-trimmer-mode`, a roughly 300-line Emacs configuration that leverages `ffmpeg` for video processing.\n\nThe author highlights that they don't need complex video editing features and found the existing tools lacking a perfect fit, especially since adding a graphical seeker to Ready Player Mode sparked the idea.  Instead of sharing the full code in the blog post, the author directs readers to the latest version within their Emacs configuration repository, anticipating further refinements.\n\nThe article concludes with a call for support, encouraging readers to sponsor the author's indie development efforts, highlighting the importance of sustainability. It also contains links to other services offered, such as blog development and macOS/iOS apps, along with standard privacy policy and terms of service.\n",
    "chinese_title": "使用 Emacs 进行视频剪辑",
    "chinese_summary": "本文探讨了如何使用 Emacs 作为视频剪辑工具，其灵感来源于 Marcin 'mbork' Borkowski 的一篇博客文章。作者同样需要一个比 macOS 自带的 QuickTime Player 更简单的剪辑方案，因此开发了 `video-trimmer-mode`，这是一个大约 300 行的 Emacs 配置，利用 `ffmpeg` 进行视频处理。\n\n作者强调，他们不需要复杂的视频编辑功能，并且发现现有工具不够完美，特别是为 Ready Player Mode 添加图形化寻址器激发了他们的灵感。作者并未在博文中分享完整代码，而是引导读者访问其 Emacs 配置仓库中的最新版本，并期待进一步的完善。\n\n文章最后呼吁大家提供支持，鼓励读者赞助作者的独立开发工作，强调可持续性的重要性。文章还包含指向作者提供的其他服务的链接，例如博客开发和 macOS/iOS 应用，以及标准的隐私政策和服务条款。"
  },
  {
    "id": "44952185",
    "title": "\"Remove mentions of XSLT from the html spec\"",
    "url": "https://github.com/whatwg/html/pull/11563",
    "summary": "This GitHub issue proposes removing mentions of XSLT from the HTML specification. The author, mfreed7, argues that at least two implementers are interested in the removal, with no opposition. They provide links to tests, implementation bugs filed for Chromium, Gecko, and WebKit, and related issues and PRs for HTML AAM & ARIA and MDN documentation. The rationale aligns with the WHATWG Working Mode.\n\nHowever, several commenters express concerns. gucci-on-fleek questions whether removing XSLT support will break old, infrequently updated sites. They highlight the risk of users seeing raw XML instead of formatted content if `<?xml-stylesheet … ?>` is no longer supported. nomis provides examples of existing uses of XSLT, including government websites and applications for microcontrollers, arguing that page load statistics don't accurately reflect the quantity of accessible content. They contend that the limitation of browsers supporting only XSLT 1.0 hinders adoption.\n\njonsterling argues against the removal, emphasizing the diverse uses of XSLT and advocating for a web platform driven by its users. They criticize large browser vendors for dictating the platform's direction.\n\nDespite the concerns, a WHATWG member, domenic, thanks the author for their work and reminds them to update the dom.spec.whatwg.org accordingly. The conversation was eventually locked due to becoming \"too heated\".\n",
    "chinese_title": "从HTML规范中移除对XSLT的提及",
    "chinese_summary": "此 GitHub issue 提议从 HTML 规范中移除对 XSLT 的提及。作者 mfreed7 认为至少有两家实现者对此移除感兴趣，且没有反对意见。他们提供了测试链接、为 Chromium、Gecko 和 WebKit 提交的实现错误，以及 HTML AAM & ARIA 和 MDN 文档的相关 issue 和 PR。其理由与 WHATWG 工作模式一致。\n\n然而，一些评论者表达了担忧。gucci-on-fleek 质疑移除 XSLT 支持是否会破坏旧的、不常更新的网站。他们强调，如果不再支持 `<?xml-stylesheet … ?>`，用户可能会看到原始 XML 而不是格式化的内容，存在这种风险。nomis 提供了 XSLT 的现有用例示例，包括政府网站和微控制器应用，认为页面加载统计数据不能准确反映可访问内容的数量。他们认为，浏览器仅支持 XSLT 1.0 限制了其采用。\n\njonsterling 反对移除，强调了 XSLT 的多样化用途，并提倡由用户驱动的 Web 平台。他们批评大型浏览器供应商主导平台的走向。\n\n尽管存在担忧，WHATWG 成员 domenic 感谢作者的工作，并提醒他们相应地更新 dom.spec.whatwg.org。该对话最终因“过于激烈”而被锁定。"
  },
  {
    "id": "44921195",
    "title": "Candle Flame Oscillations as a Clock",
    "url": "https://cpldcpu.com/2025/08/13/candle-flame-oscillations-as-a-clock/",
    "summary": "This article explores the fascinating phenomenon of candle flame oscillations and how they can be harnessed as a stable time source. It starts by highlighting that while modern candles are designed *not* to flicker, bundling three candles together creates an oscillating flame with a surprisingly consistent frequency of approximately 9.9 Hz. This frequency, researchers have found, is primarily dependent on gravity and the dimensions of the fuel source (candle size).\n\nThe author details two methods for sensing this oscillation: using a phototransistor to detect light variations and, more interestingly, using capacitive sensing. The capacitive method involves suspending a wire in the flame and measuring capacitance changes caused by ionized gases using a microcontroller. This approach, although noisier than optical sensing, proves viable.\n\nThe core of the project lies in using the capacitive sensing data to generate a 1 Hz clock signal. This involves significant digital signal processing: filtering to remove baseline wander, zero-crossing detection to identify oscillation peaks, and a fractional counter to divide the 9.9 Hz signal down to 1 Hz. The author then uses the derived 1 Hz signal to blink an LED, demonstrating the successful creation of a rudimentary \"candle clock.\" The article concludes by noting this project as an entry to the HaD.io \"One Hertz Challenge\" and emphasizes the journey from deliberately inducing candle flicker to converting it into a usable timing signal.\n",
    "chinese_title": "烛焰摆动计时",
    "chinese_summary": "本文探讨了蜡烛火焰振荡这一引人入胜的现象，以及如何将其用作稳定的时间源。文章首先指出，虽然现代蜡烛的设计目的是*不*闪烁，但将三根蜡烛捆绑在一起会产生振荡火焰，其频率出乎意料地稳定，约为9.9赫兹。研究人员发现，该频率主要取决于重力和燃料源的尺寸（蜡烛大小）。\n\n作者详细介绍了两种感知这种振荡的方法：使用光电晶体管检测光线变化，以及更有趣的电容感应。电容法涉及将一根导线悬挂在火焰中，并使用微控制器测量由电离气体引起的电容变化。虽然这种方法比光学感应噪声更大，但证明是可行的。\n\n该项目的核心在于使用电容感应数据来生成1赫兹的时钟信号。这涉及大量的数字信号处理：滤波以消除基线漂移，过零检测以识别振荡峰值，以及使用小数计数器将9.9赫兹的信号降频至1赫兹。然后，作者使用导出的1赫兹信号来闪烁LED，展示了成功创建了一个简陋的“蜡烛时钟”。文章最后指出，该项目是HaD.io“一赫兹挑战赛”的参赛作品，并强调了从故意诱导蜡烛闪烁到将其转换为可用定时信号的整个过程。"
  },
  {
    "id": "44949895",
    "title": "Custom telescope mount using harmonic drives and ESP32",
    "url": "https://www.svendewaerhert.com/blog/telescope-mount/",
    "summary": "Sven De Waerhert chronicles his journey building a custom telescope mount using harmonic drives and an ESP32 microcontroller. Inspired by astrophotography and frustrated with the limitations of simpler tracking devices, he embarked on a deep dive into DIY mount construction.\n\nInitially, he learned PCB design, leading him to replace a thermostat with a custom ESP32-based design. This skill emboldened him to tackle the more complex telescope mount. He researched harmonic drives, stepper motors, and open-source FOC implementations like SimpleFOC. He designed a custom housing using FreeCAD and created a PCB using KiCad, learning from a costly mistake in the first version related to component substitution.\n\nThe final design incorporates a 42AIM15 servo motor for the RA axis and an MKS Servo042D stepper for the DEC axis, both paired with harmonic drives. The mount operates in both GEM and ALTAZ modes, powered via USB-C with power delivery negotiation.\n\nHe integrated OnStepX firmware, addressing initial WiFi stability issues by reducing slew rates and configuring the ESP32 as a WiFi client. Manufacturing was outsourced to JLCPCB, with minor adjustments needed during assembly.\n\nDespite challenges with polar alignment and software configurations, he achieved a verified precision of 1-2 arcseconds, suitable for 30-second exposures. The total project cost was approximately €1,700, but a single unit could cost around €800. De Waerhert emphasizes that the experience gained and the satisfaction of building a functional telescope mount far outweigh the monetary cost. The article concludes with stunning images of the Orion Nebula and the M51 Whirlpool Galaxy captured using his custom-built mount.\n",
    "chinese_title": "使用谐波驱动和ESP32的定制望远镜支架",
    "chinese_summary": "Sven De Waerhert记录了他使用谐波驱动器和ESP32微控制器构建定制望远镜赤道仪的旅程。受天体摄影的启发，并对简单跟踪设备的局限性感到沮丧，他开始深入研究DIY赤道仪的构建。\n\n最初，他学习了PCB设计，并用基于ESP32的定制设计取代了恒温器。这项技能使他有勇气去处理更复杂的望远镜赤道仪。他研究了谐波驱动器、步进电机和像SimpleFOC这样的开源FOC实现方案。他使用FreeCAD设计了一个定制外壳，并使用KiCad创建了一个PCB，从第一个版本中与元件替换相关的代价高昂的错误中吸取了教训。\n\n最终设计在RA轴上集成了42AIM15伺服电机，在DEC轴上集成了MKS Servo042D步进电机，两者都与谐波驱动器配对。该赤道仪在GEM和ALTAZ模式下运行，通过USB-C供电，并支持电源传输协商。\n\n他集成了OnStepX固件，通过降低回转速度并将ESP32配置为WiFi客户端，解决了最初的WiFi稳定性问题。制造外包给了JLCPCB，在组装过程中需要进行一些微调。\n\n尽管在极轴对准和软件配置方面存在挑战，但他实现了1-2角秒的验证精度，适用于30秒曝光。整个项目的总成本约为1700欧元，但单个单元的成本可能约为800欧元。De Waerhert强调，获得的经验和构建一个功能性望远镜赤道仪的满足感远远超过了金钱成本。文章最后展示了他使用定制赤道仪拍摄的猎户座星云和M51漩涡星系的惊人照片。"
  },
  {
    "id": "44915897",
    "title": "Lazy-brush – smooth drawing with mouse or finger",
    "url": "https://lazybrush.dulnan.net",
    "summary": "The article \"Lazy-brush – smooth drawing with mouse or finger\" introduces a tool called \"Lazy Brush\" that aims to improve the drawing experience on a canvas, specifically focusing on achieving smoother lines when drawing with a mouse or finger.\n\nThe core problem addressed is the jittery and uneven lines often produced when directly translating mouse or finger movements to a digital drawing. Lazy Brush tackles this by introducing a lagging effect, where the actual drawing position trails slightly behind the cursor/finger position.\n\nThis lag, carefully tuned, smooths out the immediate imperfections and tremors of the user's input, resulting in cleaner and more controlled lines. The user effectively sets a \"virtual inertia\" that reduces the sensitivity to quick, unintentional movements.\n\nIn essence, Lazy Brush acts as a post-processing filter on the input, smoothing the raw input data before it's rendered onto the canvas. This makes it easier to create more professional-looking drawings even without specialized drawing tablets or styluses. The tool offers a practical solution for improving drawing quality using readily available input devices like a mouse or finger on a touchscreen.\n",
    "chinese_title": "懒笔 – 用鼠标或手指流畅绘画",
    "chinese_summary": "文章“Lazy-brush – 使用鼠标或手指进行流畅绘画”介绍了一种名为“Lazy Brush”的工具，该工具旨在改善画布上的绘画体验，特别是专注于在使用鼠标或手指绘图时获得更平滑的线条。\n\n它解决的核心问题是直接将鼠标或手指移动转换为数字绘图时，经常产生的抖动和不均匀的线条。Lazy Brush通过引入滞后效应来解决这个问题，即实际绘制位置略微滞后于光标/手指位置。\n\n这种经过精心调整的滞后可以消除用户输入的即时缺陷和颤动，从而产生更干净和更受控制的线条。用户有效地设置了一种“虚拟惯性”，从而降低了对快速、无意移动的敏感性。\n\n本质上，Lazy Brush充当输入的后处理过滤器，在将原始输入数据渲染到画布上之前对其进行平滑处理。这使得即使没有专业的绘图板或手写笔，也能更轻松地创建更具专业外观的绘图。该工具为使用现成的输入设备（如鼠标或触摸屏上的手指）提高绘图质量提供了一种实用的解决方案。"
  },
  {
    "id": "44950981",
    "title": "Critical Cache Poisoning Vulnerability in Dnsmasq",
    "url": "https://lists.thekelleys.org.uk/pipermail/dnsmasq-discuss/2025q3/018288.html",
    "summary": "This security report details a critical cache poisoning vulnerability in all versions of Dnsmasq DNS software, dubbed the \"SHAR Attack\" (Single-character Hijack via ASCII Resolver-silence). Researchers Fasheng Miao (Tsinghua University) and Xiang Li (Nankai University) discovered that Dnsmasq forwards DNS queries containing special characters to upstream resolvers. Some upstream resolvers silently discard these malformed queries, creating a prolonged attack window.\n\nDuring this window, attackers can successfully brute-force the TxID and source port, significantly increasing the likelihood of successful cache poisoning due to the birthday paradox. The vulnerability allows attackers to inject arbitrary malicious DNS resource records, effectively poisoning domain names without complex techniques, even from off-path.\n\nThe researchers successfully poisoned Dnsmasq caches in all trials when querying a real domain (`viticm.com`) with crafted characters. The attack amplifies existing cache poisoning attacks like SADDNS and Tudoor and undermines the assumption that resolver silence is benign.\n\nThe suggested mitigation involves implementing detection mechanisms for silent upstream resolvers and adopting rate limiting and spoof-detection techniques similar to those used in PowerDNS. The researchers emphasize the urgency of this issue due to Dnsmasq's widespread deployment and offer assistance with coordinated disclosure and further testing.\n",
    "chinese_title": "Dnsmasq 关键缓存投毒漏洞",
    "chinese_summary": "Dnsmasq DNS 软件“SHAR攻击”缓存投毒漏洞安全报告（单字符劫持 ASCII 解析器静默）\n研究人员苗发盛（清华大学）和李祥（南开大学）发现，Dnsmasq 会将包含特殊字符的 DNS 查询转发到上游解析器。某些上游解析器会静默丢弃这些格式错误的查询，从而产生长时间的攻击窗口。\n\n在此窗口期间，攻击者可以成功地暴力破解 TxID 和源端口，由于生日悖论，显著增加了缓存投毒成功的可能性。该漏洞允许攻击者注入任意恶意 DNS 资源记录，从而有效地对域名进行投毒，无需复杂技术，甚至可以进行异地攻击。\n\n研究人员在所有测试中，通过使用精心设计的字符查询真实域名 (`viticm.com`)，成功地对 Dnsmasq 缓存进行了投毒。 该攻击放大了现有的缓存投毒攻击，如 SADDNS 和 Tudoor，并破坏了解析器静默是无害的假设。\n\n建议的缓解措施包括实施针对静默上游解析器的检测机制，并采用类似于 PowerDNS 中使用的速率限制和欺骗检测技术。 研究人员强调了此问题的紧迫性，因为 Dnsmasq 的部署范围很广，并表示愿意协助进行协同披露和进一步测试。"
  },
  {
    "id": "44951862",
    "title": "Positron, a New Data Science IDE",
    "url": "https://posit.co/blog/positron-product-announcement-aug-2025/",
    "summary": "Posit PBC announces Positron, a new free, next-generation Integrated Development Environment (IDE) for data science, designed to unify exploration and production workflows for both Python and R users. Born from the learnings of 14+ years of RStudio development, Positron treats both languages as equals and aims to support the entire scope of modern data science work.\n\nKey features include: Variable & Data Frame Explorer, Multi-Session Console, Notebook Support, a GenAI assistant, Plot Pane, Integrated Data App Workflow, Database Connection Pane, Push-Button Deployment, Interpreter Management, Extension Support, and Project Folder Templates. Positron is built on Code OSS, providing a modern and extensible editor with broad VSIX extension support.\n\nPositron Desktop is currently available for Windows, macOS, and Linux under the Elastic License 2.0. The upcoming release of Posit Workbench will also introduce Positron sessions as a generally available IDE type. RStudio will continue to be maintained and updated.\n\nPositron aims to provide a cohesive and thoughtful experience for code writing, analysis, and data exploration, supporting iterative development, rich interactive output, and publication-quality documents. Posit encourages users to download Positron, explore the Quick Start guides, watch the Quick Tour video, and engage with the community on GitHub. More information will be shared at posit::conf(2025).\n",
    "chinese_title": "正电子：一款新的数据科学 IDE",
    "chinese_summary": "Posit PBC发布Positron，一款全新的免费下一代数据科学集成开发环境 (IDE)，旨在统一 Python 和 R 用户探索和生产工作流程。Positron 从 14 年以上的 RStudio 开发经验中汲取灵感，将这两种语言视为平等，并致力于支持现代数据科学工作的整个范围。\n\n主要功能包括：变量和数据框浏览器、多会话控制台、Notebook 支持、GenAI 助手、绘图窗格、集成数据应用程序工作流程、数据库连接窗格、一键式部署、解释器管理、扩展支持和项目文件夹模板。Positron 基于 Code OSS 构建，提供了一个现代且可扩展的编辑器，并具有广泛的 VSIX 扩展支持。\n\nPositron Desktop 目前可在 Windows、macOS 和 Linux 上以 Elastic License 2.0 授权获得。即将发布的 Posit Workbench 也将推出 Positron 会话作为通用 IDE 类型。RStudio 将继续维护和更新。\n\nPositron 旨在为代码编写、分析和数据探索提供有凝聚力且周到的体验，支持迭代开发、丰富的交互式输出和出版质量的文档。Posit 鼓励用户下载 Positron，探索快速入门指南，观看快速导览视频，并在 GitHub 上与社区互动。更多信息将在 posit::conf(2025) 上分享。"
  },
  {
    "id": "44938622",
    "title": "Geotoy – Shadertoy for 3D Geometry",
    "url": "https://3d.ameo.design/geotoy",
    "summary": "This text introduces \"Geotoy,\" described as a \"Shadertoy for 3D Geometry.\" This suggests Geotoy is a platform or tool similar to Shadertoy, which allows users to create and share 3D geometry-based content using shaders. The bulk of the content then lists various creations made within Geotoy, attributed to the author \"ameo\" (or variations thereof, such as ameoshingles, ameotemple, etc.). These creations are presented as examples or demonstrations of Geotoy's capabilities. The listed examples showcase a diverse range of geometric shapes and structures, from mathematically defined objects like the Hilbert curve and torus knot to more organic and detailed scenes like FBM terrain, dandelions, and even specific references like a \"Dark Souls tree.\" The repeated authorship and the variety of examples highlight Geotoy's potential for generating complex and interesting 3D geometry through shader programming. In essence, Geotoy enables the creation of 3D models procedurally using code, much like Shadertoy does for 2D visuals.\n",
    "chinese_title": "Geotoy – 3D几何体的着色器玩具",
    "chinese_summary": "本文介绍“Geotoy”，它被描述为“用于3D几何体的Shadertoy”。这表明Geotoy是一个类似于Shadertoy的平台或工具，允许用户使用着色器创建和分享基于3D几何体的作品。接下来的大部分内容列出了在Geotoy中创作的各种作品，署名为作者“ameo”（或其变体，如ameoshingles、ameotemple等）。这些作品被呈现为Geotoy功能的示例或演示。列出的示例展示了各种各样的几何形状和结构，从数学上定义的对象，如希尔伯特曲线和环面纽结，到更具机理和细节的场景，如FBM地形、蒲公英，甚至还有特定的引用，如“黑暗之魂树”。重复的作者署名和各种各样的例子突显了Geotoy通过着色器编程生成复杂且有趣的3D几何体的潜力。本质上，Geotoy能够像Shadertoy对2D视觉效果所做的那样，使用代码以程序方式创建3D模型。"
  },
  {
    "id": "44949162",
    "title": "Prime Number Grid",
    "url": "https://susam.net/primegrid.html",
    "summary": "The webpage presents an interactive tool called \"Prime Number Grid.\" The tool allows users to generate a grid where the dimensions (number of rows and columns) can be specified. The core functionality, generating and displaying prime numbers within the grid, relies on JavaScript. The page indicates that JavaScript must be enabled in the user's browser for the grid to function correctly. Navigation elements \"«\" and \"»\" are likely used to navigate through different grids or pages of primes. The symbol \"·\" and \"t\" are less clear without interaction but might control display properties or provide additional information/help regarding the grid generation process. Essentially, the page offers a dynamic way to visualize prime numbers arranged in a grid format using JavaScript.\n",
    "chinese_title": "质数网格",
    "chinese_summary": "该网页提供了一个名为“质数网格”的交互式工具。该工具允许用户生成一个可指定行数和列数的网格。生成和显示网格内质数的核心功能依赖于JavaScript。页面提示用户的浏览器必须启用JavaScript才能使网格正常工作。“«”和“»”导航元素可能用于浏览不同的网格或质数页面。“·”和“t”符号的含义尚不明确，但可能控制显示属性或提供有关网格生成过程的额外信息/帮助。本质上，该页面提供了一种使用JavaScript以网格格式动态可视化质数的方法。"
  },
  {
    "id": "44952789",
    "title": "The Mysterious Underground City Found in a Man's Basement",
    "url": "https://www.atlasobscura.com/articles/derinkuyu-turkey-underground-city-strange-maps",
    "summary": "In 1963, a man in Derinkuyu, Turkey, accidentally discovered a vast, multi-level underground city while renovating his basement. Derinkuyu, located in Cappadocia, a region known for its unique \"fairy chimney\" landscape formed from soft volcanic tuff, is the largest of hundreds of subterranean dwellings in the area.\n\nThe city, potentially dating back to 2000 B.C., was likely built by either the Hittites, Phrygians, or early Christians as a refuge from invaders. It could house up to 20,000 people and features sophisticated ventilation systems with over 15,000 shafts, along with rolling stone doors for security. The upper levels served as living quarters, while the lower levels were for storage and even included a dungeon. The city also contained a wine press, animal shelters, a convent, and churches.\n\nSome shafts also doubled as wells, and locals unknowingly drew water from them even before the city's rediscovery. Besides refuge, the city offered a consistent, moderate temperature, making it suitable for storing harvests. It served as a hideout during conflicts between Byzantines and Arabs, Mongol raids, and Ottoman rule.\n\nCappadocian Greeks inhabited Derinkuyu until the 1923 population exchange with Greece, taking their knowledge of the city with them. Derinkuyu, now a popular tourist destination, was called Malakopia (“soft place”) by the Greeks, referring to the region’s pliable stone. The article concludes by playfully suggesting that readers might find their own undiscovered world behind their basement walls.\n",
    "chinese_title": "男子地下室发现神秘地下城",
    "chinese_summary": "1963年，土耳其代林库尤一男子在装修地下室时，意外发现一座巨大的多层地下城市。代林库尤位于卡帕多奇亚，该地区以由柔软火山凝灰岩形成的独特“仙人烟囱”景观而闻名，它是该地区数百个地下住所中最大的一个。\n\n这座城市可能可以追溯到公元前2000年，很可能是由赫梯人、弗里吉亚人或早期基督徒建造的，用于躲避入侵者。它可以容纳多达20,000人，并拥有复杂的通风系统，包含超过15,000个竖井，以及用于安全保障的滚动石门。上层用作居住区，而下层用于储存，甚至包括地牢。该城市还包含一个榨酒机、动物庇护所、一座修道院和教堂。\n\n一些竖井也兼作水井，当地人在城市被重新发现之前，甚至在不知情的情况下从中取水。除了避难所，这座城市还提供了稳定适中的温度，使其适合储存收成。在拜占庭人和阿拉伯人之间的冲突、蒙古人的袭击和奥斯曼帝国的统治期间，它曾作为藏身之处。\n\n卡帕多奇亚希腊人居住在代林库尤，直到1923年与希腊进行人口交换，并将他们对这座城市的了解带走。代林库尤现在是一个受欢迎的旅游目的地，希腊人称之为马拉科皮亚（“柔软的地方”），指的是该地区柔软的石头。文章最后开玩笑地暗示，读者可能会在他们地下室墙后找到他们自己未被发现的世界。"
  },
  {
    "id": "44950091",
    "title": "PyPI Preventing Domain Resurrection Attacks",
    "url": "https://blog.pypi.org/posts/2025-08-18-preventing-domain-resurrections/",
    "summary": "PyPI has implemented a new security measure to prevent domain resurrection attacks, a type of supply-chain attack where attackers purchase expired domains to hijack PyPI accounts via password resets. PyPI now uses Domainr (a Fastly service) to periodically check the status of domains associated with user email addresses.\n\nIf a domain enters the redemption period (indicating likely expiration), PyPI un-verifies the email addresses associated with that domain, preventing password reset requests from being sent to it. This is because an attacker could potentially register the expired domain and gain control of the email address. Since early June 2025, PyPI has unverified over 1,800 email addresses.\n\nWhile 2FA is required for accounts with activity after January 1, 2024, this measure also minimizes risk for accounts created before this date.\n\nPyPI recommends that users with only one verified email address from a custom domain add a second verified email address from a common provider like Gmail. This provides an alternate contact point and helps during account recovery. They also recommend enabling 2FA on other services using the same email address to prevent complete account takeovers.\n\nThis enhancement, while not foolproof, significantly reduces the risk of account takeovers via expired domains.\n",
    "chinese_title": "PyPI 防止域名复活攻击",
    "chinese_summary": "PyPI实施新安全措施防范域名复活攻击\n\nPyPI实施了一项新的安全措施，以防止域名复活攻击。这是一种供应链攻击，攻击者通过购买过期域名，并通过密码重置来劫持PyPI账户。PyPI现在使用Domainr (Fastly服务) 定期检查与用户电子邮件地址关联的域名的状态。\n\n如果某个域名进入赎回期（表明可能过期），PyPI将取消验证与该域名关联的电子邮件地址，从而阻止将密码重置请求发送到该地址。这是因为攻击者有可能注册过期的域名并获得对该电子邮件地址的控制权。自2025年6月初以来，PyPI已取消验证了超过1,800个电子邮件地址。\n\n虽然对于2024年1月1日之后有活动记录的账户，强制启用2FA，但这项措施也最大限度地降低了在此日期之前创建的账户的风险。\n\nPyPI建议只有一个来自自定义域的已验证电子邮件地址的用户，添加来自Gmail等常用提供商的第二个已验证电子邮件地址。这提供了一个备用联系点，并有助于账户恢复。他们还建议在使用相同电子邮件地址的其他服务上启用2FA，以防止完全的账户接管。\n\n这种增强措施虽然不是万无一失，但大大降低了通过过期域名接管账户的风险。"
  },
  {
    "id": "44946996",
    "title": "OpenMower – An open source lawn mower",
    "url": "https://github.com/ClemensElflein/OpenMower",
    "summary": "OpenMower is an open-source project aiming to create a smarter, more capable robotic lawn mower than commercially available options. The project utilizes the hardware from affordable mowers like the YardForce Classic 500, upgrading the software for improved functionality. The goal is to create an autonomous mower that doesn't require perimeter wires, is safe, cost-effective, and aesthetically pleasing, while also avoiding obstacles and reacting to rain.\n\nKey features include autonomous mowing, safety mechanisms (like emergency stops), wire-free operation, obstacle avoidance, and rain detection. The project is actively developed with a focus on ROS code (available on GitHub). The basic mowing function, map teaching, and automatic docking/recharging are functional.\n\nThe hardware includes a mainboard and motor controllers (xESC mini and experimental xESC 2040). Software development includes mowing state machines, path planning, obstacle avoidance, and an app for visualization.\n\nThe project encourages community involvement through building OpenMowers, providing feedback, and contributing to documentation on the OpenMower website and Wiki. The project also seeks to identify compatible mower models, although currently, the YardForce Classic 500 is the only confirmed compatible model.\n\nThe author also uses this project to advertise for hire due to experience in software engineering, embedded programming, hardware design, and robotics.\n\nThe project is licensed under a Creative Commons Attribution-NonCommercial-ShareAlike 4.0 International License, allowing personal and educational use but restricting commercial sales without permission. A disclaimer is included to warn users of the potential dangers and liabilities involved in building and using the OpenMower.\n",
    "chinese_title": "OpenMower – 开源割草机",
    "chinese_summary": "OpenMower：旨在打造更智能、更强大的开源割草机器人，超越现有商用产品。该项目利用YardForce Classic 500等廉价割草机的硬件，升级软件以提升功能。目标是打造一款无需边界线、安全、经济、美观、能避开障碍物并对雨水做出反应的自动割草机。\n\n主要功能包括自主割草、安全机制（如紧急停止）、无线运行、避障和雨水检测。该项目正在积极开发中，重点是ROS代码（可在GitHub上获取）。基本的割草功能、地图教学和自动停靠/充电已经实现。\n\n硬件包括主板和电机控制器（xESC mini和实验性的xESC 2040）。软件开发包括割草状态机、路径规划、避障和一个用于可视化的应用程序。\n\n该项目鼓励社区参与，包括构建OpenMower、提供反馈以及在OpenMower网站和Wiki上贡献文档。该项目还寻求识别兼容的割草机型号，但目前只有YardForce Classic 500被确认为兼容型号。\n\n作者还借此项目宣传其在软件工程、嵌入式编程、硬件设计和机器人技术方面的经验，寻求工作机会。\n\n该项目采用Creative Commons Attribution-NonCommercial-ShareAlike 4.0 International License（创作共用署名-非商业性使用-相同方式共享 4.0 国际许可协议）进行授权，允许个人和教育用途，但未经许可限制商业销售。免责声明警告用户构建和使用OpenMower可能存在的危险和责任。"
  },
  {
    "id": "44944241",
    "title": "Show HN: Chroma Cloud – serverless search database for AI",
    "url": "https://trychroma.com/cloud",
    "summary": "Chroma Cloud is introduced as a serverless, open-source search database tailored for AI applications. It emphasizes speed, cost-effectiveness, scalability, and reliability. The platform offers a suite of features including vector search (powered by SPANN and SPFresh), full-text search, metadata search, collection forking, and soon, ingestion and sync.\n\nThe platform boasts performance metrics related to latency, QPS, scaling, data object storage, operations, reliability, uptime, support, and security, alongside diverse deployment options. Chroma offers usage-based pricing and a dashboard for management. It seamlessly integrates into CI/CD workflows and provides a CLI for development.\n\nThe core value proposition is enabling fast and accurate retrieval across large datasets, even with continuous updates. Testimonials highlight improved latency and overall search functionality. A code example demonstrates how to create a database and perform vector searches using the Chroma Cloud client in Python. The service offers $5 in free credits and encourages users to get started with Python, JavaScript, and other languages.\n",
    "chinese_title": "Show HN: Chroma Cloud – 面向人工智能的无服务器搜索数据库",
    "chinese_summary": "Chroma Cloud：为AI应用打造的无服务器开源搜索数据库，强调速度、成本效益、可扩展性和可靠性。平台提供向量搜索（基于SPANN和SPFresh）、全文搜索、元数据搜索、集合分叉等功能，并将很快推出摄取和同步功能。\n\n该平台拥有与延迟、QPS、扩展、数据对象存储、操作、可靠性、正常运行时间、支持和安全性相关的性能指标，以及多样化的部署选项。Chroma提供基于使用量的定价和用于管理的仪表板。它可以无缝集成到CI/CD工作流程中，并提供用于开发的CLI。\n\n其核心价值在于能够快速、准确地检索大型数据集，即使数据持续更新也能做到。客户评价强调了延迟的改善和整体搜索功能的提升。一个代码示例展示了如何使用Python中的Chroma Cloud客户端创建数据库并执行向量搜索。该服务提供5美元的免费额度，并鼓励用户开始使用Python、JavaScript和其他语言。"
  },
  {
    "id": "44937893",
    "title": "Staff disquiet as Alan Turing Institute faces identity crisis",
    "url": "https://www.theguardian.com/technology/2025/aug/18/shut-it-down-and-start-again-staff-disquiet-as-alan-turing-institute-faces-identity-crisis",
    "summary": "The Alan Turing Institute (ATI), the UK's leading AI research body named after the renowned computer scientist Alan Turing, is facing an identity crisis and potential collapse due to funding threats and a government-demanded shift towards defence and security work. Staff have filed a whistleblower complaint with the Charity Commission, citing concerns about the potential withdrawal of £100 million in government funding and raising alarms about internal governance, culture, and oversight of spending.\n\nThe institute is undergoing a strategic overhaul (Turing 2.0), including redundancies and project shutdowns, to focus on health, environment, and defence/security. However, Technology Secretary Peter Kyle wants a primary focus on defence and security, even suggesting leadership changes to reflect this.\n\nStaff have expressed dissatisfaction with leadership and the new direction, with concerns about diversity and potential job losses. Some worry that a singular focus on defence and security would be too narrow, diminishing the institute's broader societal impact. Others have suggested that the institute should be shut down and restarted.\n\nWhile ATI leadership pledges to \"step up\" on defence and security, they also aim to continue work in other areas. The future of the institute, and its ability to maintain its original mission and staff morale, remains uncertain. The government insists it wants to see value for taxpayer money, which it believes is best achieved through ATI's involvement in national security.\n",
    "chinese_title": "艾伦·图灵研究所面临身份危机，员工不安",
    "chinese_summary": "艾伦·图灵研究所（ATI）是英国顶尖的人工智能研究机构，以著名计算机科学家艾伦·图灵的名字命名。目前，该研究所正面临身份危机和潜在的倒闭风险，原因是面临资金威胁以及政府要求其转向国防和安全领域的工作。员工已向慈善委员会提交举报信，指出对政府可能撤回1亿英镑资金的担忧，并对内部治理、文化和支出监督发出警报。\n\n该研究所正在进行战略改革（图灵2.0），包括裁员和项目关闭，以专注于健康、环境和国防/安全领域。然而，技术大臣彼得·凯尔希望重点放在国防和安全领域，甚至建议进行领导层变动以反映这一点。\n\n员工对领导层和新方向表示不满，担心多样性问题和潜在的失业。一些人担心，对国防和安全的单一关注过于狭隘，会削弱研究所更广泛的社会影响力。另一些人则建议关闭该研究所并重新启动。\n\n虽然ATI领导层承诺在国防和安全方面“加强”，但他们也旨在继续在其他领域开展工作。研究所的未来，以及其维持其原始使命和员工士气的能力，仍然不确定。政府坚称，希望看到纳税人的钱得到价值，它认为最好通过ATI参与国家安全来实现。"
  },
  {
    "id": "44950952",
    "title": "Vim Macros for Beancount",
    "url": "https://tangled.sh/@adam.tngl.sh/vim-beancounting",
    "summary": "This article details a user's journey of using Vim macros to reconcile internal transfer transactions within Beancount, a text-based accounting tool. Faced with CSV data containing incomplete information about transfers between multiple accounts, the author aims to balance transactions by matching debits and credits across different account exports.\n\nInstead of scripting or ignoring internal transfers, the author leverages Vim's text editing capabilities to manually combine transactions. The initial approach involves opening multiple CSV files in Vim, using window splits, and manually cutting and pasting transactions between files, utilizing basic Vim motions and commands like `d}`, `C-w`, `P`, `i`, and `dd`. This involves converting one transaction entry to a comment and combining its posting into another for zero sum in beancount.\n\nThe author acknowledges the initial inefficiency of this process and introduces Vim commands like `C-e`, `zt`, `zz`, and `zb` to improve buffer positioning and cursor alignment, attempting to commit these commands to muscle memory for faster navigation. These commands allow for consistent cursor eye level when switching between buffers and making quick adjustments.\n\nThe main takeaway is a practical example of using Vim for data manipulation, specifically in the context of financial accounting with Beancount, and emphasizes a commitment to incrementally improving Vim proficiency through real-world application.\n",
    "chinese_title": "Beancount 的 Vim 宏",
    "chinese_summary": "本文详述了一位用户如何使用Vim宏来调整Beancount（一款基于文本的会计工具）中的内部转账交易。面对包含多账户间转账不完整信息的CSV数据，作者旨在通过匹配不同账户导出的借方和贷方来平衡交易。\n\n作者没有选择脚本或忽略内部转账，而是利用Vim的文本编辑功能手动合并交易。最初的方法包括在Vim中打开多个CSV文件，使用窗口分割，手动在文件之间剪切和粘贴交易，使用诸如`d}`、`C-w`、`P`、`i`和`dd`等基本的Vim移动和命令。这涉及将一个交易条目转换为注释，并将其过账合并到另一个条目中，以在Beancount中实现零和。\n\n作者承认该过程最初效率低下，并引入了诸如`C-e`、`zt`、`zz`和`zb`等Vim命令来改善缓冲区定位和光标对齐，试图将这些命令记忆到肌肉记忆中以便更快地导航。这些命令允许在切换缓冲区和进行快速调整时保持一致的光标视线水平。\n\n主要收获是一个使用Vim进行数据操作的实用例子，特别是在使用Beancount进行财务会计的背景下，并强调通过实际应用逐步提高Vim熟练度的承诺。"
  },
  {
    "id": "44951287",
    "title": "Attention Is the New Big-O: A Systems Design Approach to Prompt Engineering",
    "url": "https://alexchesser.medium.com/attention-is-the-new-big-o-9c68e1ae9b27",
    "summary": "This article, \"Attention Is the New Big-O,\" argues that prompt engineering should be approached with a systems design mindset, focusing on how Large Language Models (LLMs) process and weight information through the \"attention\" mechanism. It posits that structuring prompts effectively, rather than just focusing on specific wording, significantly impacts the quality and consistency of the LLM's output.\n\nThe article explains that LLMs don't read sequentially like humans but calculate relationships between all tokens simultaneously, making prompt structure critical. A well-structured prompt, which breaks down tasks into numbered steps or distinct sections, leverages how transformer attention works, creating clearer context and guiding the model's reasoning.\n\nA production example, analyzing codebase architecture, illustrates how an \"attention-optimized\" prompt (with role-playing, hierarchy, front-loaded constraints, and specific scope) yields better results than a \"sub-optimal\" one. The optimized prompt is also more maintainable, similar to well-structured code.\n\nThe article then offers practical heuristics:\n*   **Prioritize:** Put the most important information upfront.\n*   **Structure:** Break down complex tasks into smaller, focused parts using markdown and clear sections.\n*   **Personas:** Use personas for guiding style and reasoning, but avoid them for tasks requiring factual accuracy.\n*   **Specificity:** Replace vague instructions with measurable ones to avoid attention drift.\n\nFinally, the article emphasizes that well-structured prompts increase efficiency, reduce wasted engineer time (the real economic lever), enable faster feedback loops, maximize the effective context window, and enhance system portability across different LLMs.\n",
    "chinese_title": "注意力是新的大O：一种基于系统设计的提示工程方法",
    "chinese_summary": "本文《注意力是新的大O符号》认为，应该以系统设计的思维方式对待提示工程，重点关注大型语言模型（LLM）如何通过“注意力”机制处理和权衡信息。文章指出，有效构建提示词的结构，而不仅仅是关注特定措辞，会对LLM输出的质量和一致性产生重大影响。\n\n文章解释说，LLM不像人类那样按顺序阅读，而是同时计算所有token之间的关系，因此提示词结构至关重要。一个结构良好的提示词，将任务分解为编号步骤或不同部分，利用了Transformer注意力机制的工作原理，从而创建更清晰的上下文并引导模型的推理。\n\n一个分析代码库架构的生产示例表明，与“次优”提示词相比，“注意力优化”的提示词（包括角色扮演、层级结构、前置约束和明确范围）会产生更好的结果。优化后的提示词也更易于维护，类似于结构良好的代码。\n\n文章随后提供了一些实用启发法：\n*   **优先排序：** 将最重要的信息放在最前面。\n*   **结构化：** 使用Markdown和清晰的章节将复杂的任务分解为更小、更集中的部分。\n*   **角色扮演：** 使用角色扮演来指导风格和推理，但避免将其用于需要事实准确性的任务。\n*   **具体性：** 用可衡量的指令代替模糊的指令，以避免注意力漂移。\n\n最后，文章强调，结构良好的提示词可以提高效率，减少浪费的工程师时间（真正的经济杠杆），实现更快的反馈循环，最大限度地利用有效的上下文窗口，并提高系统在不同LLM之间的可移植性。"
  },
  {
    "id": "44952672",
    "title": "As Alaska's salmon plummet, scientists home in on the killer – Science – AAAS",
    "url": "https://www.science.org/content/article/alaska-s-salmon-plummet-scientists-home-killer",
    "summary": "Alaska's salmon populations are experiencing dramatic declines across multiple species, raising concerns about the state's economy, food security, and ecosystem health. Scientists are investigating the complex factors contributing to this crisis, moving beyond single-cause explanations like overfishing.\n\nThe article highlights the increasing focus on \"thermal squeeze,\" where warming ocean temperatures combined with freshwater habitat changes are stressing salmon at multiple life stages. Warmer ocean waters reduce the availability of nutrient-rich plankton, the base of the salmon food web, impacting growth and survival. Simultaneously, warmer rivers and streams are making it harder for salmon to spawn and reproduce effectively.\n\nFurthermore, researchers are exploring the impact of changing predator-prey relationships due to warming waters. Shifts in species distributions are bringing salmon into contact with predators they haven't previously encountered, potentially increasing mortality rates. Competition from hatchery-raised salmon, which may be better adapted to warmer conditions, is also being examined as a contributing factor.\n\nThe investigation is complex and requires interdisciplinary collaboration, involving oceanographers, freshwater ecologists, and fisheries biologists. Scientists are using advanced tracking technologies, oceanographic models, and genetic analyses to understand the intricate interplay of these factors and predict future salmon population trends. Ultimately, understanding the \"thermal squeeze\" and its consequences is crucial for developing effective conservation and management strategies to protect Alaska's iconic salmon.\n",
    "chinese_title": "阿拉斯加鲑鱼骤减，科学家锁定真凶——科学——美国科学促进会",
    "chinese_summary": "阿拉斯加鲑鱼数量锐减，多个物种均受影响，引发对该州经济、粮食安全和生态系统健康的担忧。科学家们正在调查导致这场危机的复杂因素，不再局限于过度捕捞等单一原因的解释。\n\n文章强调了人们日益关注的“热挤压”现象，即海洋温度升高与淡水栖息地变化相结合，给鲑鱼的多个生命阶段带来压力。海洋变暖减少了富含营养的浮游生物的供应，这是鲑鱼食物网的基础，影响了生长和存活。与此同时，河流和小溪变暖使得鲑鱼更难有效地产卵和繁殖。\n\n此外，研究人员正在探索因水温升高而改变的捕食者与猎物关系的影响。物种分布的改变使得鲑鱼与它们以前未曾遇到的捕食者接触，可能增加死亡率。来自孵化场养殖的鲑鱼（它们可能更适应温暖的环境）的竞争也被作为一个促成因素进行研究。\n\n这项调查很复杂，需要海洋学家、淡水生态学家和渔业生物学家之间的跨学科合作。科学家们正在使用先进的跟踪技术、海洋模型和遗传分析来了解这些因素之间错综复杂的相互作用，并预测未来鲑鱼种群的趋势。最终，了解“热挤压”及其后果对于制定有效的保护和管理策略以保护阿拉斯加标志性的鲑鱼至关重要。"
  },
  {
    "id": "44921467",
    "title": "Guile bindings for Sway window manager",
    "url": "https://github.com/ebeem/guile-swayer",
    "summary": "Guile Swayer provides a Guile interface for controlling the Sway window manager, addressing the lack of a readily programmable interface for customization. It allows users to fully script and control Sway, similar to StumpWM in X11. While Hyprland was considered, Sway's stability made it the preferred choice.\n\nThe project enables querying Sway for information (workspaces, outputs), assigning keybindings that execute Guile code, and subscribing to events to trigger actions. Keybindings can be simple or complex, allowing for shell commands or Sway-specific operations. Event subscriptions allow reacting to changes like workspace switches.\n\nInstallation involves adding the guile-swayer package to Guile's load path. The article details project structure including modules for auto-reloading, general keybindings, keyboard translation, a which-key inspired feature, and workspace management (grids, groups).\n\nThe author's workflow showcases workspace grids for efficient navigation and workspace groups that span across multiple monitors, syncing related tasks across displays. \"Which-key\" and Submaps help discovering and remembering keybindings interactively and grouping related commands for easier usage. Experimental layout features are mentioned for improved window arrangements.\n\nThe summary also highlights the quick start instructions and addresses the need to load the module to your load path.\n",
    "chinese_title": "Sway窗口管理器的Guile绑定",
    "chinese_summary": "Guile Swayer 提供了一个 Guile 接口来控制 Sway 窗口管理器，解决了缺乏易于编程的自定义接口的问题。 它允许用户完全脚本化和控制 Sway，类似于 X11 中的 StumpWM。 虽然考虑过 Hyprland，但 Sway 的稳定性使其成为首选。\n\n该项目能够查询 Sway 获取信息（工作区、输出），分配执行 Guile 代码的键盘绑定，以及订阅事件以触发操作。 键盘绑定可以是简单的，也可以是复杂的，允许执行 shell 命令或 Sway 特定的操作。 事件订阅允许对工作区切换等更改做出反应。\n\n安装涉及将 guile-swayer 包添加到 Guile 的加载路径。 本文详细介绍了项目结构，包括用于自动重新加载、通用键盘绑定、键盘翻译、类似 which-key 的功能以及工作区管理（网格、组）的模块。\n\n作者的工作流程展示了用于高效导航的工作区网格和跨多个监视器的工作区组，从而在显示器之间同步相关任务。\"Which-key\" 和 Submaps 帮助以交互方式发现和记住键盘绑定，并将相关命令分组以便于使用。 提及了实验性布局功能以改进窗口排列。\n\n摘要还强调了快速入门说明，并解决了将模块加载到您的加载路径的必要性。"
  },
  {
    "id": "44912881",
    "title": "In 2006, Hitachi developed a 0.15mm-sized RFID chip",
    "url": "https://www.hitachi.com/New/cnews/060206.html",
    "summary": "In February 2006, Hitachi announced the development of the world's smallest and thinnest contactless RFID IC chip, measuring 0.15 x 0.15 mm and 7.5 µm thick. This new chip is a miniaturized version of their existing \"µ-Chip,\" maintaining the same functionality but with a significantly reduced size.\n\nThe key innovation behind this reduction is the use of Silicon-on-Insulator (SOI) technology, which provides insulation between circuit elements, allowing for closer placement and higher integration. Compared to Hitachi's previous 0.3mm IC chip from 2003, the new chip has a quarter of the surface area and an eighth of the thickness.\n\nThis size reduction drastically increases productivity, allowing for four times more chips to be fabricated on a single wafer. Compared to the µ-Chip used at the 2005 World Exposition, productivity is increased by about 10 times.\n\nThe µ-Chip utilizes a 2.45 GHz microwave external antenna to wirelessly transmit a 128-bit unique ID. As data is written using ROM, the chip offers high authenticity. The original µ-Chip was successfully used at the 2005 World Exposition with a minimal incidence of ticket recognition error.\n\nHitachi anticipates this new, smaller chip will broaden the range of applications for contactless IC chips, including security, transportation, amusement, traceability, and logistics, particularly in areas like gift certificates and certificates. Its double-surface electrode design ensures easy connection with external antennas and maintains high productivity. The advancements were presented at the IEEE International Solid-State Circuits Conference (ISSCC) in February 2006.\n",
    "chinese_title": "2006年，日立公司开发出一款0.15毫米大小的RFID芯片。",
    "chinese_summary": "2006年2月，日立公司宣布开发出世界最小、最薄的非接触式RFID IC芯片，尺寸为0.15 x 0.15毫米，厚度为7.5微米。这款新芯片是现有“µ-Chip”的微型化版本，保持了相同的功能，但尺寸显著缩小。\n\n实现这种缩小的关键创新是使用绝缘硅(SOI)技术，该技术可在电路元件之间提供绝缘，从而实现更紧密的放置和更高的集成度。与日立公司2003年推出的0.3毫米IC芯片相比，新芯片的表面积为其四分之一，厚度为其八分之一。\n\n这种尺寸的缩小极大地提高了生产力，使得在单个晶圆上可以制造出四倍数量的芯片。与2005年世界博览会上使用的µ-Chip相比，生产力提高了约10倍。\n\nµ-Chip利用2.45 GHz微波外部天线无线传输128位唯一ID。由于数据是使用ROM写入的，因此该芯片具有很高的真实性。原始µ-Chip已在2005年世界博览会上成功使用，门票识别错误率极低。\n\n日立公司预计，这种新型、更小的芯片将扩大非接触式IC芯片的应用范围，包括安全、运输、娱乐、溯源和物流，尤其是在礼品券和证书等领域。其双面电极设计确保了与外部天线的轻松连接，并保持了高生产率。这些进展已于2006年2月在IEEE国际固态电路会议（ISSCC）上进行了展示。"
  },
  {
    "id": "44948352",
    "title": "How to Build a Medieval Castle",
    "url": "https://archaeology.org/issues/september-october-2025/features/how-to-build-a-medieval-castle/",
    "summary": "Guédelon Castle in Burgundy, France, is an experimental archaeology project dedicated to building a 13th-century castle using only medieval tools, techniques, and materials. Started in 1998, the project involves archaeologists and skilled craftspeople working together to understand medieval construction methods.\n\nThe project reveals previously unknown details about medieval life and architecture. For example, the team discovered that glass was too expensive for lesser nobles' homes, prompting a search for alternative window materials. They experimented with goatskin and eventually settled on linen stiffened with beeswax and decorated with period-appropriate designs, though challenges remain in finding the ideal method for attaching the linen and protecting it from the elements.\n\nThe castle’s construction has led to other discoveries, such as efficient stone cutting techniques inspired by Philippian-era castles, methods for mixing ceramic tiles, lime mortar application, and scaffolding construction. The project utilizes local resources, including oak timber, sandstone, and pigments.\n\nThe project employs around 40 craftspeople and attracts over 300,000 visitors annually, funding itself through ticket sales and on-site amenities. By tackling real-world construction challenges, the team gains insights into the daily lives and problem-solving approaches of 13th-century laborers. One of the current goals is to finish the gatehouse, which involves educated guesses about how the portcullis mechanism would have functioned. The castle is seen more as a symbol of power than a defensive structure.\n",
    "chinese_title": "如何建造一座中世纪城堡",
    "chinese_summary": "法国勃艮第的盖德隆城堡是一项实验考古项目，致力于仅使用中世纪的工具、技术和材料建造一座13世纪的城堡。该项目始于1998年，考古学家和熟练的工匠共同合作，旨在了解中世纪的建筑方法。\n\n该项目揭示了先前不为人知的中世纪生活和建筑细节。例如，该团队发现玻璃对于地位较低的贵族家庭来说过于昂贵，促使他们寻找替代的窗户材料。他们尝试了山羊皮，最终确定使用涂有蜂蜡并饰有符合时代特征设计的亚麻布，尽管在寻找将亚麻布固定和保护其免受自然因素影响的理想方法方面仍然存在挑战。\n\n城堡的建造还带来了其他发现，例如受到腓力宾时代城堡启发的有效石材切割技术、陶瓷瓦混合方法、石灰砂浆的应用以及脚手架的搭建。该项目利用当地资源，包括橡木木材、砂岩和颜料。\n\n该项目雇用了大约40名工匠，每年吸引超过30万游客，并通过门票销售和现场设施自筹资金。通过应对现实世界的建筑挑战，该团队深入了解了13世纪劳动者的日常生活和解决问题的方法。目前的目标之一是完成门楼的建造，这涉及到对吊闸机构如何运作的推测。这座城堡更多地被视为权力的象征，而不是防御性建筑。"
  },
  {
    "id": "44937978",
    "title": "EloqKV, a distributed database with Redis compatible API (GPLv2 and AGPLv3)",
    "url": "https://github.com/eloqdata/eloqkv",
    "summary": "EloqKV is a high-performance, distributed key-value database with a Redis/ValKey compatible API, designed for modern, demanding applications, especially in the AI era. It distinguishes itself by offering ACID transactions, full elasticity and scalability, tiered storage, and session-style transaction syntax while maintaining Redis' simplicity.\n\nKey features include:\n\n*   **High Performance:** Multi-threaded architecture enabling up to 1.6M QPS on a single node.\n*   **Full Durability with Tiered Storage:** Replicated WAL and automatic data tiering to disk, reducing memory costs by up to 70%.\n*   **ACID Transactions:** Session-style syntax (BEGIN/COMMIT/ROLLBACK) for more robust transactions compared to Redis' MULTI/EXEC.\n*   **Distributed ACID Transactions:** Cross-node consistency without hash slot limitations.\n*   **Redis API Compatibility:** Works out-of-the-box with existing Redis clients.\n\nEloqKV's architecture uses Data Substrate, separating the Redis protocol-compatible frontend with a TxService for data operations, LogService for WAL, and Storage Service for memory state and cold data storage. Benchmarks indicate EloqKV outperforms Redis and ValKey in cache mode and delivers superior performance compared to other Redis-compatible stores like Apache KVRocks in persistent transactional mode.\n\nEloqKV offers multiple ways to get started including Docker, EloqCtl (cluster management tool), or a tarball for local setup. It's dual-licensed under GPLv2 and AGPLv3.\n",
    "chinese_title": "EloqKV，一个兼容 Redis API 的分布式数据库 (GPLv2 和 AGPLv3 许可)",
    "chinese_summary": "EloqKV是一款高性能、分布式键值数据库，具有Redis/ValKey兼容的API，专为现代、高要求的应用而设计，尤其是在人工智能时代。它以提供ACID事务、完全的弹性和可扩展性、分层存储以及会话式事务语法（同时保持Redis的简洁性）而著称。\n\n主要特性包括：\n\n*   **高性能：** 多线程架构，在单节点上可实现高达160万QPS。\n*   **具有分层存储的完全持久性：** 复制的WAL和自动数据分层到磁盘，可降低高达70%的内存成本。\n*   **ACID事务：** 会话式语法（BEGIN/COMMIT/ROLLBACK），与Redis的MULTI/EXEC相比，提供更强大的事务支持。\n*   **分布式ACID事务：** 无需哈希槽限制的跨节点一致性。\n*   **Redis API兼容性：** 可与现有的Redis客户端开箱即用。\n\nEloqKV的架构使用Data Substrate，将Redis协议兼容的前端与用于数据操作的TxService、用于WAL的LogService以及用于内存状态和冷数据存储的Storage Service分离。 基准测试表明，EloqKV在缓存模式下优于Redis和ValKey，并且在持久事务模式下，性能优于其他Redis兼容存储，如Apache KVRocks。\n\nEloqKV提供了多种入门方式，包括Docker、EloqCtl（集群管理工具）或用于本地设置的tarball。它采用GPLv2和AGPLv3双重许可。"
  },
  {
    "id": "44953125",
    "title": "Octopolis and Octlantis",
    "url": "https://en.wikipedia.org/wiki/Octopolis_and_Octlantis",
    "summary": "Octopolis and Octlantis are two settlements of gloomy octopuses located in Jervis Bay, New South Wales, Australia. Octopolis, discovered in 2009, is characterized by a bed of shells arranged in an ellipse, along with a piece of scrap metal. The octopuses burrow into the shell bed to create dens, benefiting from the superior building material compared to the surrounding sediment. Up to 14 octopuses have been observed at Octopolis simultaneously.\n\nIn 2016, a second settlement, Octlantis, was found nearby. Unlike Octopolis, Octlantis does not contain any human-made objects. Both sites are located within Booderee National Park and can house a similar number of octopuses.\n\nWhile some media outlets have referred to these settlements as \"octopus cities,\" researchers involved with the sites consider this analogy to be misleading. The sites provide insight into the social behavior and habitat preferences of *Octopus tetricus*.\n",
    "chinese_title": "章鱼城与章鱼亚特兰蒂斯",
    "chinese_summary": "章鱼城和章鱼洲：澳大利亚新南威尔士州杰维斯湾阴暗章鱼的两处聚居地。章鱼城发现于2009年，特征是排列成椭圆形的贝壳堆以及一块废金属。章鱼会钻入贝壳堆建造巢穴，相比周围的沉积物，贝壳是更优良的建筑材料。曾同时观察到多达14只章鱼栖息在章鱼城。\n\n2016年，在附近发现了第二处聚居地，章鱼洲。与章鱼城不同，章鱼洲不包含任何人造物品。这两处地点都位于布德里国家公园内，并且可以容纳数量相近的章鱼。\n\n虽然一些媒体将这些聚居地称为“章鱼城市”，但参与研究的科研人员认为这种类比具有误导性。这些地点为了解*Octopus tetricus*的社会行为和栖息地偏好提供了线索。"
  },
  {
    "id": "44942731",
    "title": "Show HN: Whispering – Open-source, local-first dictation you can trust",
    "url": "https://github.com/epicenter-so/epicenter/tree/main/apps/whispering",
    "summary": "The \"Show HN: Whispering – Open-source, local-first dictation you can trust\" post introduces \"Whispering,\" an open-source dictation tool that prioritizes user privacy by operating locally. The core selling point is trust: since the speech-to-text processing happens directly on the user's machine, there's no need to worry about sensitive audio data being sent to a third-party server.\n\nThe post is hosted on GitHub under the \"epicenter-so/epicenter\" repository. Despite showing \"Uh oh! There was an error while loading,\" suggesting an issue displaying the full details, the user engagement metrics are visible: the project has 126 forks and 2,000 stars, indicating substantial interest and potential community adoption.\n\nEssentially, the post announces a privacy-focused dictation solution with a local-first design, attracting significant attention within the open-source community. The error loading the page limits a complete understanding, but the project's name (\"Whispering\") and its description strongly suggest a focus on secure and private voice input.\n",
    "chinese_title": "Show HN: Whispering – 可信任的开源本地优先语音听写工具",
    "chinese_summary": "“展示HN：Whispering – 你可以信任的开源、本地优先的听写工具”帖子介绍了“Whispering”，一个通过本地运行来优先保护用户隐私的开源听写工具。其核心卖点是信任：由于语音转文本的处理直接在用户机器上进行，因此无需担心敏感音频数据被发送到第三方服务器。\n\n该帖子托管在GitHub的“epicenter-so/epicenter”仓库下。虽然显示“Uh oh! There was an error while loading”，暗示显示完整细节时出现问题，但用户参与度指标可见：该项目有126个fork和2,000个star，表明了相当大的兴趣和潜在的社区采用率。\n\n本质上，该帖子宣布了一个以隐私为中心的听写解决方案，采用本地优先设计，吸引了开源社区的广泛关注。加载页面时出现的错误限制了全面理解，但该项目的名称（“Whispering”）及其描述强烈暗示了对安全和私密语音输入的关注。"
  },
  {
    "id": "44946774",
    "title": "Ted Chiang: The Secret Third Thing",
    "url": "https://linch.substack.com/p/ted-chiang-review",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "特德·姜：第三种东西",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "44941369",
    "title": "Counter-Strike: A billion-dollar game built in a dorm room",
    "url": "https://www.nytimes.com/2025/08/18/arts/counter-strike-half-life-minh-le.html",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "反恐精英：从宿舍走出的十亿美元游戏",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "44924261",
    "title": "Netflix Revamps Tudum's CQRS Architecture with Raw Hollow In-Memory Object Store",
    "url": "https://www.infoq.com/news/2025/08/netflix-tudum-cqrs-raw-hollow/",
    "summary": "Netflix revamped the architecture of its Tudum fan website, replacing a CQRS implementation using Kafka and Cassandra with RAW Hollow, an in-memory object store developed internally. The original architecture, while enabling independent scaling of read and write paths, suffered from slow content update propagation due to caching refresh cycles, leading to delays in previewing content, which worsened as the content volume grew.\n\nRAW Hollow, designed for small to medium datasets with strong read-after-write consistency, allows the entire dataset to reside in the memory of each application process, offering low latency and high availability. The team concluded that for Tudum's specific needs, the CQRS pattern wasn't optimal.\n\nThe new architecture eliminated cache invalidation issues, as the entire dataset fits into memory. Hollow's data compression further aided this, reducing data size significantly. This resulted in faster data propagation and page construction due to reduced I/O and round-trip times, benefiting both content editors (faster previewing) and website visitors (faster page rendering).\n",
    "chinese_title": "Netflix用原始空心内存对象存储重构Tudum的CQRS架构",
    "chinese_summary": "Netflix改造了其Tudum粉丝网站的架构，用内部开发的内存对象存储RAW Hollow取代了使用Kafka和Cassandra的CQRS实现。 原本的架构虽然实现了读写路径的独立扩展，但由于缓存刷新周期导致内容更新传播缓慢，使得内容预览延迟，并且随着内容量的增长而加剧。\n\nRAW Hollow专为具有强读后写一致性的中小型数据集而设计，允许整个数据集驻留在每个应用程序进程的内存中，从而提供低延迟和高可用性。 团队认为，对于Tudum的特定需求，CQRS模式并非最佳选择。\n\n新的架构消除了缓存失效问题，因为整个数据集都适合内存。 Hollow的数据压缩进一步促进了这一点，显著减小了数据大小。 这减少了I/O和往返时间，从而加快了数据传播和页面构建，使内容编辑者（更快的预览）和网站访问者（更快的页面渲染）都受益。"
  },
  {
    "id": "44945008",
    "title": "Tiny-tpu: A minimal tensor processing unit (TPU), inspired by Google's TPU",
    "url": "https://github.com/tiny-tpu-v2/tiny-tpu",
    "summary": "Tiny-TPU is an open-source project aiming to create a minimal Tensor Processing Unit (TPU) inspired by Google's TPUs. Its goal is to provide a accessible resource for individuals of all skill levels to learn about and contribute to hardware accelerator design.\n\nThe Tiny-TPU architecture consists of several key components: Processing Elements (PEs) arranged in a Systolic Array for efficient matrix multiplication, a Vector Processing Unit (VPU) for post-processing operations like bias addition and activation functions, a Unified Buffer (UB) for storing intermediate data, and a Control Unit that interprets a 94-bit instruction set.\n\nThe Systolic Array utilizes a grid of PEs where input data flows horizontally, partial sums flow vertically, and weights remain fixed within each PE. The VPU performs element-wise operations after the Systolic Array, offering modules for bias addition, Leaky ReLU activation, MSE loss calculation, and Leaky ReLU derivative computation. The UB stores input matrices, weight matrices, bias vectors, and other relevant data.\n\nThe project includes instructions on setting up the development environment (MacOS and Ubuntu), adding new modules, running tests, and viewing waveforms using GTKWave. The documentation also details the instruction set architecture (ISA), providing descriptions of each bit field and its corresponding function.\n\nThe project's motivation is to demystify chip accelerator design, making it accessible to beginners and fostering an inventive mindset. Future steps include developing a compiler for the instruction set and scaling the TPU to larger dimensions.\n",
    "chinese_title": "Tiny-tpu：一个受谷歌TPU启发的极简张量处理器 (TPU)",
    "chinese_summary": "Tiny-TPU是一个开源项目，旨在创建一个受谷歌TPU启发的极简张量处理单元（TPU）。其目标是为所有技能水平的个人提供一个易于访问的资源，以学习和贡献于硬件加速器设计。\n\nTiny-TPU架构包含几个关键组件：以脉动阵列排列的用于高效矩阵乘法的处理单元（PE），用于后处理操作（如偏差加法和激活函数）的向量处理单元（VPU），用于存储中间数据的统一缓冲区（UB），以及解释94位指令集的控制单元。\n\n脉动阵列利用PE网格，其中输入数据水平流动，部分和垂直流动，权重保持在每个PE内固定。VPU在脉动阵列之后执行逐元素操作，提供用于偏差加法、Leaky ReLU激活、MSE损失计算和Leaky ReLU导数计算的模块。UB存储输入矩阵、权重矩阵、偏差向量和其他相关数据。\n\n该项目包含关于设置开发环境（MacOS和Ubuntu）、添加新模块、运行测试以及使用GTKWave查看波形的说明。文档还详细介绍了指令集架构（ISA），提供了每个位字段及其对应功能的描述。\n\n该项目的动机是揭开芯片加速器设计的神秘面纱，使其对初学者来说易于理解，并培养一种创新的思维模式。未来的步骤包括开发指令集的编译器以及将TPU扩展到更大的尺寸。"
  },
  {
    "id": "44923520",
    "title": "Show HN: I built an app to block Shorts and Reels",
    "url": "https://scrollguard.app/",
    "summary": "ScrollGuard is a new app aimed at helping users combat doom-scrolling habits by blocking Reels and Shorts on popular platforms like Instagram, Facebook, Reddit, and YouTube. It offers scrolling limits on any app via an \"antiscroll mode.\"\n\nThe app promises a distraction-free experience by eliminating ads, Reels, Shorts, and other addictive content. Currently available for Android, the developer is also working on an iOS version.\n\nThe iOS version faces technical limitations that prevent direct blocking of Reels and Shorts like the Android version. Instead, the developer is exploring alternative methods to reduce scrolling addiction on iPhones. Interested iOS users can join a waitlist to be notified when the iPhone app is launched.\n",
    "chinese_title": "展示一下：我做了个屏蔽短视频和Reels的应用",
    "chinese_summary": "ScrollGuard：阻止 Reels 和 Shorts，助您摆脱沉迷式浏览习惯。\n\nScrollGuard 是一款旨在帮助用户对抗沉迷式浏览习惯的新应用，它能屏蔽 Instagram、Facebook、Reddit 和 YouTube 等热门平台上的 Reels 和 Shorts 短视频。它还提供“反沉迷模式”，可对任何应用设置浏览限制。\n\n该应用承诺通过消除广告、Reels、Shorts 和其他令人上瘾的内容，提供一个无干扰的体验。目前该应用已在 Android 平台上线，开发者也在努力开发 iOS 版本。\n\n由于 iOS 版本面临技术限制，无法像 Android 版本那样直接屏蔽 Reels 和 Shorts 短视频。因此，开发者正在探索其他方法来减少 iPhone 用户的浏览成瘾。有兴趣的 iOS 用户可以加入等候名单，以便在 iPhone 应用发布时收到通知。"
  },
  {
    "id": "44926855",
    "title": "X-ray scans reveal Buddhist prayers inside tiny Tibetan scrolls",
    "url": "https://www.popsci.com/technology/tibetan-prayer-scroll-scans/",
    "summary": "Researchers at Germany's Helmholtz-Zentrum Berlin used 3D X-ray tomography and AI to virtually \"unroll\" delicate, antique Buddhist scrolls (dharanis) from Mongolia without physically damaging them. These scrolls, containing prayers, were part of portable shrines (gungervaa) owned by nomadic Mongolian families and were nearly wiped out during the Mongolian Revolution of 1921.\n\nThe scrolls, housed at Germany's Ethnological Museum since 1932, were scanned using synchrotron tomography, which compiles 3D representations of objects at a microscopic level. The process involved imaging the objects as a series of \"sub-volumes\" due to the equipment's limited field-of-view.\n\nThe scans revealed that each scroll contained a 31.5-inch strip of parchment wrapped approximately 50 times. AI analysis of the ink revealed the unexpected presence of metal particles. Furthermore, a section of writing was identified as the Tibetan Buddhist mantra \"Om mani padme hum,\" written in Sanskrit grammar instead of Tibetan.\n\nThe study's authors acknowledge that X-ray tomography is currently labor-intensive, but they believe it offers unique opportunities for examining inaccessible artifacts. They hope that advancements in the technology will lead to more collaborative, interdisciplinary projects in conservation work, allowing for deeper insights into these historical objects.\n",
    "chinese_title": "X光扫描揭示微型藏族卷轴内的佛教经文",
    "chinese_summary": "德国亥姆霍兹柏林中心的研究人员使用3D X射线断层扫描和人工智能技术，在不对蒙古出土的脆弱古代佛教卷轴（陀罗尼）造成物理损伤的情况下，对其进行虚拟“展开”。这些卷轴包含祈祷文，是蒙古游牧家庭拥有的便携式佛龛（gungervaa）的一部分，在1921年的蒙古革命期间几乎被摧毁殆尽。\n\n自1932年以来，这些卷轴一直保存在德国民族学博物馆，并使用同步加速器断层扫描技术进行扫描，该技术可以编译物体在微观层面的3D表示。由于设备的视场有限，该过程涉及将物体成像为一系列“子体积”。\n\n扫描显示，每个卷轴都包含一条约31.5英寸长的羊皮纸，包裹了大约50圈。对墨水的AI分析揭示了意想不到的金属颗粒的存在。此外，一段文字被确认为藏传佛教真言“唵嘛呢叭咪吽”，是用梵文语法而不是藏文书写的。\n\n该研究的作者承认，X射线断层扫描目前仍需投入大量人力，但他们认为它为检查无法接近的文物提供了独特的机会。他们希望这项技术的进步能够促成更多协作性的跨学科保护项目，从而更深入地了解这些历史文物。"
  },
  {
    "id": "44942936",
    "title": "Left to Right Programming",
    "url": "https://graic.net/p/left-to-right-programming",
    "summary": "This article advocates for \"Left to Right Programming,\" a paradigm where code is valid and understandable as it's being written, enabling better editor support and a more intuitive development experience. The author criticizes Python's list comprehensions and C's function-based approach to structs for being less discoverable and harder to parse while typing.  These patterns force the programmer to know information upfront that should ideally be discovered during the coding process.\n\nThe author praises Rust's and JavaScript's more chained and object-oriented approach, where methods are directly associated with objects, making them easily discoverable through editor autocompletion. This aligns with the principle of progressive disclosure, presenting complexity only when relevant.\n\nThe article argues that languages should facilitate code that can be read and understood from left to right, improving readability and reducing cognitive load, especially in complex logic.  The author uses examples to demonstrate how this \"valid as you type\" approach enables better editor assistance, faster learning, and ultimately, a more productive and pleasant coding experience, leading to the \"Pit of Success.\" They highlight the importance of discoverable APIs that guide developers towards the correct functions and methods as they write their code.\n",
    "chinese_title": "从左到右编程",
    "chinese_summary": "本文提倡“从左到右编程”这种范式，即代码在编写过程中就有效且易于理解，从而实现更好的编辑器支持和更直观的开发体验。作者批评了Python的列表推导式和C的基于函数的结构体方法，认为它们不易被发现，并且在输入时难以解析。这些模式迫使程序员预先知道理想情况下应该在编码过程中发现的信息。\n\n作者赞扬了Rust和JavaScript的更链式和面向对象的方法，其中方法直接与对象关联，从而可以通过编辑器自动完成轻松发现它们。这符合渐进式披露的原则，只在相关时才呈现复杂性。\n\n本文认为，语言应促进可以从左到右阅读和理解的代码，从而提高可读性并减少认知负荷，尤其是在复杂的逻辑中。作者通过示例展示了这种“即写即有效”的方法如何实现更好的编辑器辅助、更快的学习速度，并最终带来更高效和愉悦的编码体验，从而引导至“成功之坑”。他们强调了可发现API的重要性，这些API可以在开发者编写代码时引导他们找到正确的函数和方法。"
  },
  {
    "id": "44910300",
    "title": "The Life and Death of London's Crystal Palace (2021)",
    "url": "https://heritagecalling.com/2021/11/29/picturing-the-crystal-palace/",
    "summary": "This article from Historic England chronicles the life and death of London's Crystal Palace, focusing on its photographic history. From its construction in Hyde Park for the Great Exhibition of 1851 to its fiery demise in 1936, the Palace was a popular subject for photographers. The Great Exhibition itself was a significant event for photography, showcasing new equipment and images, including those belonging to Queen Victoria and Prince Albert. After the Exhibition, the Crystal Palace was moved and rebuilt at Sydenham Hill, with photographer Philip Henry Delamotte commissioned to document the process.\n\nThe article highlights Delamotte's work, showcasing the palace's themed courts and vibrant interior through albumen prints and hand-colored transparencies. A devastating fire in 1866 damaged a significant portion of the palace, leading to financial difficulties and limited restoration. Aerial photography, starting as early as 1858, captured unique perspectives of the Palace and its surrounding park.\n\nDespite surviving financial struggles and even serving as a Royal Navy depot during WWI, the Crystal Palace was ultimately destroyed by a massive fire in 1936. The event was widely photographed from both the ground and the air. After the fire, the site saw various proposals for its redevelopment, but ultimately was used for military purposes during WWII. The article concludes by noting that while the Palace is gone, surviving elements like garden terraces and the pedestrian subway continue to be photographed, preserving its legacy in the Historic England Archive.\n",
    "chinese_title": "伦敦水晶宫的生与死 (2021)",
    "chinese_summary": "英格兰遗产委员会：伦敦水晶宫的生与死——聚焦摄影史"
  },
  {
    "id": "44951676",
    "title": "Show HN: Python file streaming 237MB/s on $8/M droplet in 507 lines of stdlib",
    "url": "https://bellone.com/updates/axon-api/python-file-streaming-237mbs-on-$8-m-droplet-in-507-lines-stdlib",
    "summary": "This \"Show HN\" post introduces Axon API, an open-source Python WSGI core designed for rapid prototyping of applications requiring granular control over the request lifecycle. Written in 507 lines of standard library code (Python 3.10+), Axon achieves file streaming performance of up to 237MB/s on a low-cost $8/month Digital Ocean droplet.\n\nAxon utilizes multipart streaming, returning multiple files through a single HTTP connection using a Python generator and 64KB chunks for optimal throughput. A key architectural feature is its backpressure handling, preventing memory buildup by only 'chambering' chunks on client demand. This allows constant memory usage even under heavy load.\n\nPerformance tests, conducted on Digital Ocean droplets in NYC3, involved deploying fresh Axon instances and using `wrk` for stress testing with 50 concurrent connections. Tests covered various payload sizes (8KB-512KB) and single/multi-file scenarios. Results highlighted that CPU saturation is the primary bottleneck on single-core hardware, with network throughput becoming the limiting factor in multicore deployments. Axon maintains zero socket errors across all tests.  The performance scales with computational resources, suggesting a suitable architecture for distributed strategies specializing in node type and size.\n",
    "chinese_title": "Show HN: Python 文件流传输速度达 237MB/s，在 $8/月的服务器上仅用 507 行标准库代码实现",
    "chinese_summary": "这个“Show HN”帖子介绍 Axon API，一个开源 Python WSGI 核心，专为需要对请求生命周期进行精细控制的应用进行快速原型设计而生。Axon 由 507 行标准库代码（Python 3.10+）编写，在低成本的 8 美元/月 Digital Ocean droplet 上实现了高达 237MB/s 的文件流传输性能。\n\nAxon 利用多部分流传输，通过单个 HTTP 连接，使用 Python 生成器和 64KB 的块返回多个文件，以实现最佳吞吐量。一个关键的架构特性是其背压处理，通过仅在客户端需要时才“存储”块来防止内存累积。这使得即使在高负载下也能保持恒定的内存使用。\n\n在 NYC3 的 Digital Ocean droplet 上进行的性能测试包括部署新的 Axon 实例，并使用 `wrk` 进行压力测试，采用 50 个并发连接。测试涵盖了各种有效负载大小（8KB-512KB）和单/多文件场景。结果表明，CPU 饱和是单核硬件上的主要瓶颈，而网络吞吐量成为多核部署中的限制因素。Axon 在所有测试中都保持零套接字错误。性能随计算资源扩展，表明这是一种适用于专门针对节点类型和大小的分布式策略的架构。"
  },
  {
    "id": "44945532",
    "title": "Obsidian Bases",
    "url": "https://help.obsidian.md/bases",
    "summary": "The Obsidian Help article \"Introduction to Bases\" explains Obsidian's concept of \"bases\" as fundamental organizational structures or core note types used to build upon and connect information. It highlights that these bases are not rigid templates but rather adaptable starting points for different types of notes and workflows.\n\nThe key idea is to identify recurring patterns in your thinking and information management. By recognizing these patterns, you can create base notes that capture the essential elements and properties common to each type. This promotes consistency and efficiency in note-taking.\n\nThe article emphasizes the flexibility of bases. They can be anything from simple checklists to complex project management systems. It encourages users to experiment and refine their bases as their understanding and needs evolve. The goal is not to force information into a pre-defined structure but rather to leverage a flexible framework that supports natural thinking and knowledge connection.\n\nFurthermore, the article implicitly suggests that using bases can enhance the power of Obsidian's linking capabilities. By establishing consistent note structures, it becomes easier to identify relationships between different notes, fostering a more interconnected and navigable knowledge base. Ultimately, bases are presented as a tool for creating a more organized, efficient, and insightful note-taking system within Obsidian.\n",
    "chinese_title": "黑曜石基地",
    "chinese_summary": "Obsidian帮助文章《基础概念入门》阐述了Obsidian中“基础”的概念，即作为构建和连接信息的基本组织结构或核心笔记类型。它强调这些基础并非僵化的模板，而是针对不同类型的笔记和工作流程的可调整的起点。\n\n其核心思想是识别你的思考和信息管理中反复出现的模式。通过识别这些模式，你可以创建基础笔记来捕捉每种类型的基本要素和属性。这有助于提高笔记的一致性和效率。\n\n文章强调了基础的灵活性。它们可以是简单的清单，也可以是复杂的项目管理系统。文章鼓励用户根据自己的理解和需求不断尝试和改进基础。目标不是将信息强行塞入预定义的结构中，而是利用一个灵活的框架来支持自然的思考和知识连接。\n\n此外，文章还隐晦地表明，使用基础可以增强Obsidian的链接功能。通过建立一致的笔记结构，更容易识别不同笔记之间的关系，从而构建一个更互联和可导航的知识库。最终，基础被呈现为在Obsidian中创建一个更具组织性、效率和洞察力的笔记系统的工具。"
  },
  {
    "id": "44945562",
    "title": "Spice Data (YC S19) Is Hiring a Product Associate (New Grad)",
    "url": "https://www.ycombinator.com/companies/spice-data/jobs/RJz1peY-product-associate-new-grad",
    "summary": "Spice Data, a YC S19 company focused on providing restaurant data to enterprises, is hiring a Product Associate (New Grad) in San Francisco. The role involves cleaning, standardizing, and transforming raw data, identifying bad data, managing third-party contractors, delivering data to customers, and collaborating with Engineering to improve data pipelines. The role requires working from their downtown SF office 4 days a week.\n\nIdeal candidates will have prior internship experience in management consulting, investment banking, or at an early-stage B2B startup, along with strong Excel and data analysis skills, and excellent communication.\n\nThe position offers a salary of $80,000-$100,000, 0.1-0.5% equity, unlimited PTO, 401k, and comprehensive health, dental, and vision insurance. Lunch is provided when working from the office.\n\nThe interview process includes an intro call, two interviews focusing on data cleaning and problem-solving, and an onsite visit.\n\nSpice Data was founded in 2019, is profitable, San Francisco-based, has a small team, and is backed by YC and angel investors. They focus on providing high-quality data, particularly in the restaurant industry, to Fortune 500 companies.\n",
    "chinese_title": "Spice Data (YC S19) 招聘产品助理（应届生）",
    "chinese_summary": "Spice Data（YC S19公司，专注于为企业提供餐饮数据）正在旧金山招聘产品助理（应届毕业生）。该职位涉及清洗、标准化和转换原始数据，识别不良数据，管理第三方承包商，向客户交付数据，并与工程团队协作以改进数据管道。该职位要求每周在旧金山市中心办公室工作4天。\n\n理想的候选人应具有管理咨询、投资银行或早期B2B创业公司的实习经验，以及强大的Excel和数据分析技能，以及出色的沟通能力。\n\n该职位提供 80,000-100,000 美元的薪水、0.1-0.5% 的股权、无限 PTO、401k 以及全面的健康、牙科和视力保险。在办公室工作时提供午餐。\n\n面试流程包括介绍电话、两次侧重于数据清洗和问题解决的面试，以及一次现场访问。\n\nSpice Data 成立于 2019 年，盈利，总部位于旧金山，拥有一支小型团队，并得到 YC 和天使投资者的支持。他们专注于为财富 500 强公司提供高质量的数据，尤其是在餐饮行业。"
  },
  {
    "id": "44940485",
    "title": "FFmpeg Assembly Language Lessons",
    "url": "https://github.com/FFmpeg/asm-lessons",
    "summary": "This document introduces the \"FFmpeg School of Assembly Language,\" a resource designed to teach users assembly language specifically in the context of FFmpeg development. It emphasizes the difficulty and reward of learning assembly and aims to provide a foundation for understanding how computers operate at a low level.\n\nThe lessons are designed to equip learners with the skills to eventually contribute to the FFmpeg project. To get the most out of the material, prior knowledge of C programming (particularly pointers) and high school level math is recommended. Lessons and corresponding assignments will be available in a Git repository.\n\nA Discord server is provided for learners to ask questions and receive support. The lessons will also be translated into French and Spanish.\n",
    "chinese_title": "FFmpeg汇编语言教程",
    "chinese_summary": "本文介绍“FFmpeg汇编语言学校”，该资源旨在教授用户在FFmpeg开发环境中使用的汇编语言。它强调学习汇编语言的难度和回报，并旨在为理解计算机底层运行原理奠定基础。\n\n这些课程旨在使学习者掌握最终为FFmpeg项目做出贡献的技能。为了充分利用这些材料，建议具备C语言（特别是指针）和高中水平数学的先验知识。课程和相应的作业将在Git仓库中提供。\n\n我们提供了一个Discord服务器，供学习者提问和获得支持。这些课程还将翻译成法语和西班牙语。"
  },
  {
    "id": "44953321",
    "title": "Graphite Chat",
    "url": "https://graphite.dev/blog/introducing-graphite-chat",
    "summary": "Graphite Chat introduces a new way to review and improve code directly within pull requests using AI. Built upon their existing AI code review agent, Diamond, Graphite Chat allows developers to converse with AI to understand code changes, get suggestions, and apply fixes without switching tabs.\n\nKey benefits include:\n\n*   **Understanding diffs easily:** Chat provides context from the full codebase and PR history, answering questions about specific code sections.\n*   **Customized suggestions:** AI offers code style-aware suggestions for tests, refactors, and pattern matching.\n*   **Fast changes:** Integrated IDE allows in-context review of suggested changes, enabling line additions, test runs, and commits directly within the PR.\n*   **Simplified merging:** Incorporate edits and merge without leaving the PR window.\n\nGraphite Chat is designed for both code reviewers and authors. Reviewers can quickly understand unfamiliar logic or assess code quality, while authors can proactively identify improvements and fix issues before human review. It consolidates information from the codebase, CI pipeline, and web into a single conversational interface.\n\nCurrently in beta, Graphite Chat is free for all Graphite users. It aims to revolutionize code review by making it more efficient and integrated, accelerating the software development lifecycle.\n",
    "chinese_title": "石墨聊天",
    "chinese_summary": "Graphite Chat 推出全新方式，利用人工智能直接在 Pull Request 中审查和改进代码。Graphite Chat 建立在其现有的人工智能代码审查代理 Diamond 之上，使开发者能够与人工智能对话，了解代码更改、获取建议并应用修复，而无需切换标签页。\n\n主要优势包括：\n\n*   **轻松理解差异：** Chat 提供来自完整代码库和 PR 历史的上下文，回答有关特定代码段的问题。\n*   **定制化建议：** 人工智能针对测试、重构和模式匹配提供符合代码风格的建议。\n*   **快速变更：** 集成 IDE 允许对建议的更改进行上下文审查，从而能够在 PR 中直接添加行、运行测试和提交。\n*   **简化合并：** 在不离开 PR 窗口的情况下合并编辑并进行合并。\n\nGraphite Chat 专为代码审查员和作者设计。审查员可以快速理解不熟悉的逻辑或评估代码质量，而作者可以在人工审查之前主动识别改进并修复问题。它将来自代码库、CI 管道和 Web 的信息整合到一个对话界面中。\n\nGraphite Chat 目前处于 Beta 版，对所有 Graphite 用户免费。它旨在通过提高效率和集成度来彻底改变代码审查，从而加速软件开发生命周期。"
  },
  {
    "id": "44943986",
    "title": "Show HN: We started building an AI dev tool but it turned into a Sims-style game",
    "url": "https://www.youtube.com/watch?v=sRPnX_f2V_c",
    "summary": "This \"Show HN\" post describes an AI dev tool project that unexpectedly evolved into a Sims-style game. The provided content, however, is simply YouTube's standard footer information regarding copyright, terms of service, privacy, and contact details. There's no actual description of the AI dev tool, the Sims-style game, or any explanation of the project's evolution. Therefore, a meaningful summary beyond acknowledging the title's claim is impossible based on the supplied content. The core information lies solely in the title: a team started building an AI developer tool but it morphed into a game similar to The Sims.\n",
    "chinese_title": "Show HN：我们开始做AI开发工具，结果变成了模拟人生风格的游戏",
    "chinese_summary": "这篇“Show HN”帖子声称一个AI开发工具项目意外演变成了模拟人生风格的游戏。然而，提供的内容仅为YouTube的标准页脚信息，包含版权、服务条款、隐私和服务详情。没有关于AI开发工具、模拟人生风格游戏或项目演变的实际描述。因此，基于所提供的内容，除了确认标题的说法之外，不可能进行有意义的总结。核心信息仅在于标题：一个团队开始构建AI开发工具，但它演变成了一个类似于《模拟人生》的游戏。"
  },
  {
    "id": "44923451",
    "title": "How to Use Snprintf",
    "url": "https://bernsteinbear.com/blog/snprintf/",
    "summary": "This article by Max Bernstein discusses a useful feature of the `sprintf` family of functions, specifically `snprintf`, that allows determining the required buffer size dynamically. The key takeaway is that you can call `snprintf` with a `NULL` buffer and a size of `0` to obtain the number of characters that *would* be written (excluding the null terminator).\n\nThe author demonstrates this by first calling `snprintf(NULL, 0, format_string, ...)` to get the required size. Then, they allocate memory for the buffer using `malloc`, adding 1 for the null terminator. Finally, they call `snprintf` again, this time with the allocated buffer and the calculated size, to actually format the string. The article emphasizes this approach to avoid manual buffer size calculations and prevent potential buffer overflows. It also references a small, header-only library the author wrote for this purpose, though details are not provided. The core message is to use `snprintf`'s ability to pre-calculate required buffer size for safer and more efficient string formatting.\n",
    "chinese_title": "如何使用 Snprintf",
    "chinese_summary": "Max Bernstein 的这篇文章讨论了 `sprintf` 函数族，特别是 `snprintf` 的一个实用特性，该特性允许动态确定所需的缓冲区大小。其关键在于，你可以使用 `NULL` 缓冲区和大小 `0` 调用 `snprintf`，以获取 *将会* 写入的字符数（不包括空终止符）。\n\n作者首先通过调用 `snprintf(NULL, 0, format_string, ...)` 来获取所需的大小。然后，他们使用 `malloc` 为缓冲区分配内存，并为 null 终止符添加 1。最后，他们再次调用 `snprintf`，这次使用分配的缓冲区和计算的大小，来实际格式化字符串。文章强调了这种方法，以避免手动缓冲区大小计算并防止潜在的缓冲区溢出。它还提到了作者为此目的编写的一个小型、仅包含头文件的库，但未提供详细信息。核心信息是利用 `snprintf` 的预计算所需缓冲区大小的能力，来实现更安全、更高效的字符串格式化。"
  },
  {
    "id": "44951694",
    "title": "The 'big church move': Swedish town begins to roll historic building 5km",
    "url": "https://www.theguardian.com/world/2025/aug/19/the-big-church-move-sweden-kiruna-kyrka",
    "summary": "The Swedish town of Kiruna has begun moving its historic Kiruna Kyrka church 5km to accommodate the expansion of Europe's largest underground mine, operated by state-owned LKAB. The move, costing over £39 million, is part of a larger relocation of the entire town due to ground weakening caused by the mine. The church, inaugurated in 1912 and resembling a Sámi hut, is being moved at a pace of half a kilometre per hour over two days. The event is drawing large crowds and is being broadcast live on Swedish television. Celebrations, including a church service and musical entertainment, are planned at the new location.\n\nWhile LKAB describes the relocation as a unique historical event, it has faced criticism, particularly from the Sámi community. They fear the mine expansion will fragment their land, making reindeer herding difficult and threatening their Indigenous culture. A Sámi representative accused LKAB of \"land-grabbing\" and using the church move as a distraction from the environmental and cultural damage caused by mining activities. LKAB has defended the relocation, stating that Kiruna city center is unimaginable without the church and that the move is essential for the mine's continued operation. The church is expected to reopen at its new location next year, but the entire town relocation won't be complete until 2035.\n",
    "chinese_title": "“大教堂搬迁”：瑞典小镇开始滚动搬运历史建筑5公里",
    "chinese_summary": "为配合欧洲最大地下矿的扩张，瑞典基律纳镇已开始将其历史悠久的基律纳教堂搬迁5公里。这座矿由国有的LKAB公司运营。此次搬迁耗资超过3900万英镑，是由于矿区导致地面软化而进行的整个城镇搬迁计划的一部分。这座于1912年落成、形似萨米小屋的教堂，正以每小时半公里的速度，耗时两天进行搬迁。这一事件吸引了大量人群，并在瑞典电视台进行现场直播。在新址计划举行庆祝活动，包括教堂礼拜和音乐娱乐。\n\n虽然LKAB将此次搬迁描述为独特的历史事件，但它也面临批评，特别是来自萨米社区的批评。他们担心矿区的扩张会分割他们的土地，使驯鹿放牧变得困难，并威胁到他们的土著文化。一位萨米代表指责LKAB“掠夺土地”，并利用教堂搬迁来转移人们对采矿活动造成的环境和文化破坏的注意力。LKAB为搬迁辩护，称没有教堂，基律纳市中心是不可想象的，而且搬迁对于矿区的持续运营至关重要。教堂预计将于明年在新址重新开放，但整个城镇的搬迁要到2035年才能完成。"
  },
  {
    "id": "44952949",
    "title": "The Race to Rescue PBS and NPR Stations",
    "url": "https://www.nytimes.com/2025/08/19/business/the-race-to-rescue-pbs-and-npr-stations.html",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "拯救PBS和NPR电台的竞赛",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "44907133",
    "title": "The rising returns to R&D: Ideas are not getting harder to find",
    "url": "https://papers.ssrn.com/sol3/papers.cfm?abstract_id=5242171",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "研发回报率上升： 创意并非越来越难寻",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "44942501",
    "title": "Anna's Archive: An Update from the Team",
    "url": "https://annas-archive.org/blog/an-update-from-the-team.html",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "安娜的档案：团队最新进展",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "44950600",
    "title": "UK drops demand for backdoor into Apple encryption",
    "url": "https://www.theverge.com/news/761240/uk-apple-us-encryption-back-door-demands-dropped",
    "summary": "The UK has reportedly dropped its demand for Apple to provide backdoor access to encrypted iCloud user data, a move that could pave the way for Apple to reintroduce its Advanced Data Protection (ADP) encrypted iCloud storage to the UK. The decision follows pressure from the US, spearheaded by US Director of National Intelligence Tulsi Gabbard, who cited concerns about protecting the privacy and civil liberties of American citizens, as the UK order would have impacted the encrypted data of users worldwide, including Americans.\n\nIn January, the UK issued a secret order demanding backdoor access, prompting Apple to block new UK users from signing up for ADP. Apple challenged the order and won the right to publicly discuss the case in April. US officials also began investigating whether the UK order violated the bilateral CLOUD Act agreement, which prohibits the US and UK from demanding each other's data.\n\nReports last month indicated that the UK was considering retracting the demands due to pressure and the potential violation of the CLOUD Act. While the possibility of renegotiated terms with Apple that avoid implicating US citizens remains, it is suggested that any such negotiation would go against the new agreement. It is not clear if Apple will restore ADP service in the UK. Apple has been contacted for comment, and the UK Home Office has declined to comment.\n",
    "chinese_title": "英国放弃要求苹果加密留后门",
    "chinese_summary": "据报道，英国已放弃要求苹果公司提供访问加密iCloud用户数据的后门，此举可能为苹果公司在英国重新推出其高级数据保护(ADP)加密iCloud存储铺平道路。此前，美国国家情报总监图尔西·加巴德带头施压美国，表达了对保护美国公民隐私和公民自由的担忧，因为英国的命令将影响包括美国人在内的全球用户的加密数据。\n\n今年1月，英国发布了一项秘密命令，要求获得后门访问权限，促使苹果公司阻止新的英国用户注册ADP。苹果公司对该命令提出质疑，并在4月份赢得了公开讨论此案的权利。美国官员也开始调查英国的命令是否违反了双边CLOUD Act协议，该协议禁止美国和英国要求对方提供数据。\n\n上个月的报道显示，由于压力和可能违反CLOUD Act，英国正在考虑撤回相关要求。尽管与苹果公司重新谈判条款以避免牵连美国公民的可能性仍然存在，但有迹象表明，任何此类谈判都将与新协议相悖。目前尚不清楚苹果公司是否将在英国恢复ADP服务。苹果公司已被联系以征求意见，英国内政部拒绝置评。"
  },
  {
    "id": "44927778",
    "title": "An IRC-Enabled Lawn Mower (2021)",
    "url": "https://jotunheimr.idlerpg.net/users/jotun/lawnmower/",
    "summary": "In 2020, the author, \"jotun,\" was jokingly challenged by his IRC friends, Empus and Ragnar, to link an IRC server from his lawnmower. What began as a meme evolved into a real hardware project. \"Jotun,\" a software engineer with limited hardware experience, embarked on building an IRC-enabled lawnmower, nicknamed \"lawnmower.*\".\n\nThe project involved ordering a Raspberry Pi 4b+, a small OLED display, and a UPS HAT for battery power. He wrote custom monitoring software to display system information, WiFi signal strength, battery level, and IRC user count on the OLED screen. He optimized the code to minimize CPU usage, resolving issues with inefficient display drivers. He also load-tested the Pi's IRC server (ircu), finding it capable of handling thousands of users.\n\nThe hardware was housed in an electrical project box and mounted with standoffs. Holes were drilled for cooling fans and a button. He faced challenges like fitting the UPS HAT, safely cutting a hole for the power cable, and potential battery overheating. He also had an eye injury from plastic dust.\n\nHe spent considerable effort addressing the issue of revealing his home IP address when putting the server online, experimenting with SSH tunnels and WebIRC filters before finding a better solution with GRE tunneling.\n",
    "chinese_title": "基于IRC的割草机 (2021)",
    "chinese_summary": "2020年，作者“jotun”在IRC上被朋友Empus和Ragnar戏称为要从割草机上连接一个IRC服务器。这最初只是一个玩笑，后来演变成了一个真正的硬件项目。软件工程师“jotun”的硬件经验有限，但他开始着手打造一台支持IRC的割草机，昵称为“lawnmower.*”。\n\n该项目涉及订购一块Raspberry Pi 4b+、一个小OLED显示屏和一个用于电池供电的UPS HAT。他编写了定制的监控软件，用于在OLED屏幕上显示系统信息、WiFi信号强度、电池电量和IRC用户数。他优化了代码以最大限度地减少CPU使用率，并解决了低效显示驱动程序的问题。他还对Pi的IRC服务器(ircu)进行了负载测试，发现它能够处理数千个用户。\n\n硬件被安置在一个电气项目盒中，并用支架安装。钻孔用于安装散热风扇和一个按钮。他面临着诸多挑战，例如安装UPS HAT、安全地为电源线切出一个孔，以及潜在的电池过热。他还因塑料粉尘导致了眼睛受伤。\n\n他花费了大量精力来解决将服务器上线时暴露其家庭IP地址的问题，在找到使用GRE隧道更好的解决方案之前，他尝试了SSH隧道和WebIRC过滤器。"
  },
  {
    "id": "44946762",
    "title": "Croatian freediver held breath for 29 minutes",
    "url": "https://divernet.com/scuba-news/freediving/how-croatian-freediver-held-breath-for-29-minutes/",
    "summary": "Croatian freediver Vitomir Maričić has set a new Guinness World Record for the longest breath-hold underwater using oxygen, achieving an impressive 29 minutes and 3 seconds. This surpasses the previous record by over four minutes. The feat occurred in a 3-meter-deep pool in Opatija, Croatia, before official judges and spectators.\n\nMaričić prepared by pre-breathing pure oxygen, a technique that increases usable oxygen in the lungs. He then lay on his back underwater, focusing on mental control despite physical discomfort, particularly diaphragm contractions. He credited his team, family, and friends for their support in achieving the record.\n\nThe previous record was held by fellow Croatian Budimir Šobat at 24 minutes, 37 seconds. Notably, magician David Blaine once held the record at 17 minutes, 4 seconds. For comparison, the AIDA world record for static apnea (breath-hold on air) is 11 minutes, 35 seconds.\n\nMaričić's background includes an AIDA static apnea best of 10 minutes, 8 seconds, and he also holds a Guinness World Record for the longest underwater walk on one breath. The article highlights the physiological and mental demands of prolonged breath-holding, emphasizing the importance of diaphragmatic breathing, relaxation, and mental control. Oxygen pre-breathing is used to replace nitrogen in the lungs with oxygen, increasing usable oxygen.\n",
    "chinese_title": "克罗地亚自由潜水员憋气29分钟",
    "chinese_summary": "克罗地亚自由潜水员维托米尔·马里奇奇创下新的吉尼斯世界纪录，凭借氧气辅助水下闭气时长达到惊人的29分3秒。这比之前的纪录多了四分钟以上。这一壮举发生在克罗地亚奥帕蒂亚一个3米深的泳池中，有官方裁判和观众见证。\n\n马里奇奇通过预先呼吸纯氧进行准备，这项技术可以增加肺部可用的氧气。然后，他仰卧在水下，专注于精神控制，尽管身体感到不适，尤其是膈肌收缩。他将创纪录的功劳归于他的团队、家人和朋友的支持。\n\n之前的纪录由他的克罗地亚同胞布迪米尔·绍巴特保持，为24分37秒。值得注意的是，魔术师大卫·布莱恩曾以17分4秒保持该记录。相比之下，AIDA静态闭气（空气闭气）的世界纪录为11分35秒。\n\n马里奇奇的背景包括AIDA静态闭气10分8秒的个人最佳成绩，他还保持着一项吉尼斯世界纪录，即一次呼吸水下行走的最长距离。文章强调了长时间闭气的生理和心理需求，强调了膈肌呼吸、放松和精神控制的重要性。预先呼吸氧气是为了用氧气代替肺中的氮气，从而增加可用的氧气。"
  },
  {
    "id": "44949617",
    "title": "Intel 80286 emulator for Raspberry Pico",
    "url": "https://github.com/xrip/pico-286",
    "summary": "The Pico-286 project emulates a classic PC (8086/8088/80186/286 CPU) on a Raspberry Pi Pico (RP2040/RP2350), aiming for a lightweight, educational retro computing experience. It supports cross-platform builds (Pico, Windows, Linux) and emulates various retro peripherals, graphics modes (CGA, HGC, TGA, VGA, text), and sound (PC Speaker, Covox, Disney Sound Source, Adlib/Sound Blaster, MPU-401, Tandy 3-voice, Creative Music System).\n\nStorage options include virtual disk images (floppy and hard drives) on the SD card and direct host filesystem access via a mapped network drive (H:). The MAPDRIVE.COM utility enables the host drive.\n\nHardware configuration requires a Raspberry Pi Pico and PSRAM (8MB+ recommended). Optimal performance uses Raspberry Pi Pico 2 (RP2350) with QSPI PSRAM. Default pinouts are provided for peripherals like VGA/HDMI, TFT display, SD card, PSRAM, NES gamepad, and audio.\n\nMemory management utilizes conventional RAM (640KB on host, less on Pico), and extended memory via PSRAM (high-performance) or virtual memory (SD card swap file, slower). The architecture leverages the Pico's dual-core processor (core 0 for CPU and input, core 1 for video, audio, and timer interrupts). Windows and Linux builds are multi-threaded.\n\nBuilding requires appropriate toolchains (Pico SDK, CMake, ARM GCC, MSVC/GCC, or GCC/Clang), and selection of display (TFT, VGA, HDMI) and audio (I2S, PWM, hardware) options during CMake configuration. Specific build commands are provided for RP2350, RP2040, and Linux host.\n",
    "chinese_title": "树莓派 Pico 用的 Intel 80286 模拟器",
    "chinese_summary": "Pico-286项目旨在树莓派Pico (RP2040/RP2350)上模拟经典PC (8086/8088/80186/286 CPU)，提供轻量级的教育性复古计算体验。它支持跨平台构建（Pico, Windows, Linux），并模拟各种复古外围设备、图形模式（CGA, HGC, TGA, VGA, 文本）和声音（PC扬声器, Covox, Disney Sound Source, Adlib/Sound Blaster, MPU-401, Tandy 3音色, Creative Music System）。\n\n存储选项包括SD卡上的虚拟磁盘镜像（软盘和硬盘）以及通过映射网络驱动器(H:)直接访问主机文件系统。MAPDRIVE.COM实用程序启用主机驱动器。\n\n硬件配置需要一个树莓派Pico和PSRAM（建议8MB以上）。最佳性能使用带有QSPI PSRAM的树莓派Pico 2 (RP2350)。提供了用于VGA/HDMI, TFT显示器, SD卡, PSRAM, NES游戏手柄和音频等外围设备的默认引脚排列。\n\n内存管理利用传统RAM（主机上640KB，Pico上较少），并通过PSRAM（高性能）或虚拟内存（SD卡交换文件，较慢）扩展内存。该架构利用Pico的双核处理器（核心0用于CPU和输入，核心1用于视频、音频和定时器中断）。Windows和Linux版本是多线程的。\n\n构建需要适当的工具链（Pico SDK, CMake, ARM GCC, MSVC/GCC或GCC/Clang），并在CMake配置期间选择显示（TFT, VGA, HDMI）和音频（I2S, PWM, 硬件）选项。 提供了RP2350, RP2040和Linux主机的特定构建命令。"
  },
  {
    "id": "44941580",
    "title": "Launch HN: Reality Defender (YC W22) – API for Deepfake and GenAI Detection",
    "url": "https://www.realitydefender.com/platform/api",
    "summary": "Reality Defender, a Y Combinator Winter 2022 alum, launched a free access API for deepfake and GenAI detection on July 31, 2025. The API allows users to analyze content and determine the likelihood of it being synthetically generated or manipulated, aiding in combating the spread of misinformation and disinformation. The initiative highlights Reality Defender's commitment to making deepfake detection more accessible and widespread, potentially empowering individuals and organizations to verify the authenticity of media content. This launch marks a significant step in addressing the growing challenge posed by AI-generated content.\n",
    "chinese_title": "发布HN：Reality Defender (YC W22) – 用于深度伪造和生成式人工智能检测的API",
    "chinese_summary": "Reality Defender，一家 Y Combinator 2022 冬季校友公司，于 2025 年 7 月 31 日推出了免费访问的 API，用于深度伪造和 GenAI 检测。该 API 允许用户分析内容并确定其被合成生成或篡改的可能性，从而帮助对抗虚假和错误信息的传播。该举措突显了 Reality Defender 致力于使深度伪造检测更易于访问和广泛应用的承诺，有可能使个人和组织能够验证媒体内容的真实性。此次发布标志着在应对人工智能生成内容日益增长的挑战方面迈出了重要一步。"
  },
  {
    "id": "44945730",
    "title": "Newgrounds: Flash Forward 2025",
    "url": "https://www.newgrounds.com/bbs/topic/1542140",
    "summary": "This Newgrounds forum post announces \"Flash Forward Jam 2025,\" the fifth annual event celebrating Flash animation and game development in an alternate reality where Flash never died. Participants are encouraged to create games and interactive movies using Flash, ensuring compatibility with Ruffle (the Flash emulator used on Newgrounds). The event emphasizes premiering new content, discouraging re-releases of previous projects.\n\nKey dates include: April 6th (NG's 25th Flash Portal anniversary) and the extended deadline of April 20th for publishing entries with the tag \"Flash-Forward-2025.\"\n\nPrizes are awarded for both games and interactive movies, with the game prizes being significantly larger ($1200 for 1st place) than the movie prizes ($150 for 1st place). The post highlights a crowdfunding effort to increase prize money and lists current sponsors.\n\nA major update is the introduction of a new Newgrounds.io library for ActionScript 2.0, designed to replace the old Flash API and enabling access to features like medals, high scores, and sharing. Resources for learning Flash are provided, including tutorials and archives of previous Flash Forward entries.\n\nThe post also mentions other upcoming Newgrounds events, including celebrations for the site's 30th birthday on July 6th, featuring various collaborations. The subsequent comments show excitement for the event, with users discussing technical aspects (like AS3 compatibility and Flash CS6 installation), offering collaboration, and expressing support for the Flash revival.\n",
    "chinese_title": "Newgrounds：闪回2025",
    "chinese_summary": "Newgrounds论坛帖宣布“Flash Forward Jam 2025”，第五届年度活动，庆祝Flash动画和游戏在Flash永不消逝的平行宇宙中的发展。鼓励参与者使用Flash制作游戏和互动电影，确保与Ruffle（Newgrounds使用的Flash模拟器）兼容。活动强调首发新作，不鼓励重新发布之前的项目。\n\n重要日期包括：4月6日（NG 25周年Flash Portal纪念日）以及4月20日发布的、带有“Flash-Forward-2025”标签作品的截止日期。\n\n游戏和互动电影均有奖项，游戏奖金明显高于电影奖金（一等奖分别为1200美元和150美元）。该帖子重点介绍了增加奖金的众筹活动，并列出了目前的赞助商。\n\n一项重大更新是推出了新的Newgrounds.io ActionScript 2.0库，旨在取代旧的Flash API，并实现访问奖牌、高分和分享等功能。提供学习Flash的资源，包括教程和往届Flash Forward作品存档。\n\n该帖子还提到了其他即将到来的Newgrounds活动，包括7月6日网站30周年庆典，其中包含各种合作项目。后续评论显示了对该活动的热情，用户讨论了技术方面（如AS3兼容性和Flash CS6安装）、提供合作并表达了对Flash复兴的支持。"
  },
  {
    "id": "44952533",
    "title": "Nissan announces 2026 Leaf pricing, 300 mile range starting at $29,990",
    "url": "https://arstechnica.com/cars/2025/08/nissan-announces-2026-leaf-pricing-starting-at-29990/",
    "summary": "Nissan has announced the pricing and specifications for the 2026 Nissan Leaf, the third generation of the popular electric vehicle. The base model Leaf S+ starts at $29,990 and offers a 303-mile range thanks to a 75 kWh liquid-cooled battery. This price point is lower than the original 2011 Leaf's price, even before adjusting for inflation.\n\nAccording to Nissan, the goal is to offer affordable EVs with value. The Leaf SV+, priced at $34,230, includes larger wheels, an improved infotainment system, and an optional battery heater. It boasts a 288-mile range, which is a significant improvement over the 2025 model.\n\nThe top-tier Platinum+ trim shares the same powertrain as the S+ and SV+ but comes with additional standard features, starting at $38,990.\n\nA lower-priced \"S\" trim, featuring a smaller 52 kWh battery, is expected to arrive later and is anticipated to be priced below $30,000. Despite tariff challenges, Nissan is aiming for an aggressive price point for this entry-level model.\n\nOverall, the 2026 Leaf promises increased efficiency, a liquid-cooled battery, and competitive pricing across its various trim levels, making it an appealing option in the EV market.\n",
    "chinese_title": "日产公布2026款聆风定价，300英里续航，起价29,990美元",
    "chinese_summary": "日产发布2026款聆风定价及配置，第三代电动汽车。基本款Leaf S+起价29,990美元，配备75千瓦时液冷电池，续航里程达303英里。该价格甚至低于2011年初代聆风的原始价格，且未考虑通货膨胀因素。\n\n日产表示，其目标是提供物有所值的平价电动汽车。Leaf SV+售价34,230美元，配备更大尺寸的轮毂、改进的信息娱乐系统和可选的电池加热器，续航里程为288英里，较2025款车型有显著提升。\n\n顶配Platinum+版车型与S+和SV+共享相同的动力系统，但配备更多标准配置，起价38,990美元。\n\n预计稍后将推出价格更低的“S”版车型，配备较小的52千瓦时电池，预计售价低于30,000美元。尽管面临关税挑战，日产仍致力于为这款入门级车型设定极具竞争力的价格。\n\n总而言之，2026款聆风承诺更高的效率、液冷电池以及极具竞争力的各款车型定价，使其成为电动汽车市场中颇具吸引力的选择。"
  },
  {
    "id": "44944592",
    "title": "Show HN: I built a toy TPU that can do inference and training on the XOR problem",
    "url": "https://www.tinytpu.com",
    "summary": "This \"Show HN\" post details the creation of a \"toy TPU\" designed for inference and training on the XOR problem. The authors, a group of novices in hardware design, aimed to understand how TPUs work by re-inventing one from scratch, emphasizing a \"hacky\" approach and avoiding reliance on AI coding assistance.\n\nThe article explains that a TPU is an application-specific integrated circuit (ASIC) optimized for machine learning tasks like matrix multiplication, crucial for training and inference in neural networks. Their toy TPU utilizes a systolic array, comprised of Processing Elements (PEs) performing multiply-accumulate operations. They simplified the problem by focusing on XOR, a classic neural network challenge, using a 2->2->1 multi-layer perceptron (MLP).\n\nThe authors walk through the process of implementing matrix multiplication in hardware using the systolic array, including necessary data staggering and transposition techniques. They also detail the implementation of bias addition and the Leaky ReLU activation function. The post uses example weights, biases, and the XOR input matrix to illustrate how data flows through the systolic array and is processed in each layer. They use Verilog to show the code for the main parts of their toy TPU. The goal was not a 1-to-1 replica of a real TPU, but a practical exploration of its core principles, resulting in a functional accelerator capable of solving the XOR problem.\n",
    "chinese_title": "展示一下：我构建了一个玩具 TPU，可以对 XOR 问题进行推理和训练",
    "chinese_summary": "这个“Show HN”帖子详细介绍了为XOR问题设计用于推理和训练的“玩具TPU”的创建过程。作者是一群硬件设计新手，旨在通过从零开始重新发明一个TPU来理解TPU的工作原理，强调“hacky”方法，并避免依赖AI编码辅助。\n\n文章解释说，TPU是一种专门为机器学习任务（如矩阵乘法）优化的专用集成电路（ASIC），这对于神经网络中的训练和推理至关重要。他们的玩具TPU利用了包含执行乘法累加运算的PE（处理单元）的脉动阵列。他们通过专注于XOR（一个经典的神经网络挑战）简化了问题，使用了一个2->2->1多层感知器（MLP）。\n\n作者介绍了使用脉动阵列在硬件中实现矩阵乘法的过程，包括必要的数据交错和转置技术。他们还详细介绍了偏置加法和Leaky ReLU激活函数的实现。该帖子使用示例权重、偏置和XOR输入矩阵来说明数据如何在脉动阵列中流动并在每一层中被处理。他们使用Verilog展示了玩具TPU主要部分的代码。其目标不是真实TPU的1对1复制品，而是对其核心原理的实际探索，从而产生一个能够解决XOR问题的功能加速器。"
  },
  {
    "id": "44916339",
    "title": "Typechecker Zoo",
    "url": "https://sdiehl.github.io/typechecker-zoo/",
    "summary": "This article introduces \"Typechecker Zoo,\" a personal project focused on implementing minimal versions of influential static type systems in Rust. The project aims to provide hands-on understanding of typechecking algorithms and language design evolution, spanning from simpler systems to modern dependent types.\n\nThe project prioritizes practical implementation details over rigorous theoretical proofs, offering a more accessible learning experience compared to textbooks like TAPL and ATTAPL. The focus is on the \"gory details\" of data structures, logic, and abstract syntax trees.\n\nThe project includes implementations of:\n\n*   **Algorithm W:** Classic Hindley-Milner type inference for polymorphic lambda calculus.\n*   **System F:** Second-order lambda calculus with parametric polymorphism using bidirectional type checking.\n*   **System F-ω:** System F-ω with higher-kinded types and features found in Haskell.\n*   **Calculus of Constructions:** A dependent type checker inspired by Lean, featuring a countable hierarchy of universes and inductive types.\n\nThe implementations use common Rust compiler libraries and are simplified for clarity and easy modification. The author encourages contributions and corrections via pull requests on Github, as it's an MIT licensed hobby project.\n",
    "chinese_title": "类型检查器动物园",
    "chinese_summary": "本文介绍了“Typechecker Zoo”，一个旨在用 Rust 实现具有影响力的静态类型系统的最小版本的个人项目。该项目旨在提供对类型检查算法和语言设计演进的实践理解，涵盖从较简单的系统到现代依赖类型。\n\n与 TAPL 和 ATTAPL 等教科书相比，该项目更注重实际实现细节，而非严格的理论证明，从而提供更容易理解的学习体验。重点在于数据结构、逻辑和抽象语法树的“血淋淋的细节”。\n\n该项目包括以下实现：\n\n*   **Algorithm W:** 用于多态 Lambda 演算的经典 Hindley-Milner 类型推断。\n*   **System F:** 使用双向类型检查的具有参数多态性的二阶 Lambda 演算。\n*   **System F-ω:** 具有高阶种类类型和 Haskell 中功能的 System F-ω。\n*   **Calculus of Constructions:** 受 Lean 启发的依赖类型检查器，具有可数层级的宇宙和归纳类型。\n\n这些实现使用了常见的 Rust 编译器库，并经过简化，以实现清晰和易于修改。作者鼓励通过 Github 上的 pull request 进行贡献和更正，因为它是一个 MIT 许可的业余项目。"
  },
  {
    "id": "44945943",
    "title": "Shamelessness as a strategy (2019)",
    "url": "https://nadia.xyz/shameless",
    "summary": "This article explores \"shamelessness\" as a surprisingly effective strategy in modern society. The author draws a parallel to the game Avalon, where a player (Merlin) can strategically reveal information, seemingly foolishly, to mislead opponents.\n\nThe author argues that shamelessness involves defying expectations and creating confusion about one's true intentions. This is exemplified by Paris Hilton, initially dismissed as a \"dumb blonde,\" who ultimately pioneered a successful celebrity playbook later adopted by figures like the Kardashians. The 2016 US presidential election and the leadership styles of figures like Jack Dorsey are also cited as examples.\n\nThe effectiveness of shamelessness stems from a shift in social dynamics. Previously, social sanctions deterred outlandish behavior within finite communities. However, in today's fluid online environments, these sanctions often backfire, acting as signals that attract new followers who resonate with the message of the \"shameless\" individual.\n\nThe \"establishment\" wrongly assumes that \"shameless\" individuals seek their approval, when their actual goal is to build a separate community, regardless of the existing social order. The author also notes that whether a person is consciously aware of their strategy doesn't matter; they become a vessel for propagating ideas that resonate with others. The author concludes by suggesting that instead of dismissing those labeled as \"shameless,\" it's crucial to examine their actions more closely, as they may be employing a surprisingly effective, if counterintuitive, strategy.\n",
    "chinese_title": "以无耻为策略 (2019)",
    "chinese_summary": "无耻：现代社会一种出人意料的有效策略"
  },
  {
    "id": "44938920",
    "title": "MCP doesn't need tools, it needs code",
    "url": "https://lucumr.pocoo.org/2025/8/18/code-mcps/",
    "summary": "In his blog post, Armin Ronacher argues that relying on numerous CLI tools for agentic coding has limitations due to platform dependencies, undocumented features, and challenges with complex character inputs. Agents struggle with state management in CLI sessions (e.g., tmux) and security preflight checks can slow down the process.\n\nHe proposes using MCP (Model Context Protocol) servers with a single \"ubertool\" that acts as a stateful Python interpreter executing code. This simplifies the interface, leverages the agent's existing knowledge of Python and libraries like pexpect, and facilitates session management. Instead of piecing together CLI commands, the agent writes Python code within the MCP session.\n\nHe illustrates this with \"pexpect-mcp,\" a publicly available MCP server that provides a Python interpreter with the pexpect library. He demonstrates how an agent can use this single tool to debug a crashing demo application with LLDB, effectively writing and executing Python scripts to interact with the debugger. Furthermore, the agent can readily convert these debugging interactions into a reusable Python script. The key advantage is shifting the focus to the agent's strong suit – programming – and offloading session management to the MCP.\n",
    "chinese_title": "MCP不需要工具，它需要代码。",
    "chinese_summary": "Armin Ronacher 在其博文中指出，依赖众多 CLI 工具进行自主编程存在局限性，原因在于平台依赖、未文档化的功能以及复杂字符输入方面的挑战。代理在 CLI 会话（例如 tmux）中的状态管理方面存在困难，并且安全预检会减慢流程。\n\n他建议使用 MCP（模型上下文协议）服务器，配备一个充当有状态 Python 解释器的单一“ubertool”。这简化了接口，利用了代理现有的 Python 和 pexpect 等库的知识，并有助于会话管理。代理不再拼凑 CLI 命令，而是在 MCP 会话中编写 Python 代码。\n\n他用 “pexpect-mcp” 来说明这一点，这是一个公开可用的 MCP 服务器，提供了一个带有 pexpect 库的 Python 解释器。他演示了代理如何使用这个单一工具来调试崩溃的演示应用程序（使用 LLDB），有效地编写和执行 Python 脚本与调试器交互。此外，代理可以轻松地将这些调试交互转换为可重用的 Python 脚本。关键优势在于将重点转移到代理的优势——编程——并将会话管理卸载到 MCP。"
  },
  {
    "id": "44942761",
    "title": "The lottery ticket hypothesis: why neural networks work",
    "url": "https://nearlyright.com/how-ai-researchers-accidentally-discovered-that-everything-they-thought-about-learning-was-wrong/",
    "summary": "This article explores the \"lottery ticket hypothesis\" and its impact on understanding why massive neural networks work, despite contradicting traditional machine learning theory. For 300 years, the bias-variance tradeoff dictated that overly complex models would overfit data, memorizing noise rather than learning useful patterns. However, in 2019, researchers discovered \"double descent,\" where performance improved even after models initially overfit. This led to scaling up models, resulting in breakthroughs like ChatGPT.\n\nThe lottery ticket hypothesis explains this phenomenon. It posits that within large networks exist \"winning tickets\" - small subnetworks with the right initial weights that achieve similar performance to the full network. These networks succeed not by memorizing, but by providing numerous opportunities to find simple, elegant solutions. Training becomes a massive lottery draw, where the best-initialised small network emerges.\n\nThis theory reconciles empirical success with classical theory: large models don't memorize, they find simple solutions hidden in vast parameter spaces. This has implications beyond AI, suggesting that our brains, with their massive number of neurons, similarly provide potential solutions to problems. The article concludes that breakthroughs often come from testing assumptions and pushing beyond accepted theory. The success of scaling indicates future challenges and the importance of underlying architectural constraints. While scaling continues to improve AI, understanding the lottery ticket mechanism helps to explain current success and predict future limitations.\n",
    "chinese_title": "彩票假说：神经网络为何有效",
    "chinese_summary": "本文探讨了“彩票假设”及其对理解大规模神经网络工作原理的影响，尽管这与传统的机器学习理论相悖。三百年来，偏差-方差权衡原则表明，过度复杂的模型会过度拟合数据，记住噪声而不是学习有用的模式。然而，在2019年，研究人员发现了“双下降”现象，即性能甚至在模型最初过度拟合后仍然有所提高。这导致了模型的规模扩大，从而产生了像ChatGPT这样的突破。\n\n彩票假设解释了这一现象。它假设在大型网络中存在“中奖彩票”——具有正确初始权重的小型子网络，它们可以达到与完整网络相似的性能。这些网络成功不是通过记忆，而是通过提供大量机会来找到简单、优雅的解决方案。训练变成了一场大规模的彩票抽奖，其中最佳初始化的的小型网络脱颖而出。\n\n该理论将经验上的成功与经典理论调和了起来：大型模型不会记忆，而是在广阔的参数空间中找到隐藏的简单解决方案。这不仅对人工智能有影响，也暗示着我们的大脑，拥有着大量的神经元，同样也为解决问题提供了潜在的解决方案。文章总结说，突破往往来自于检验假设和突破公认的理论。规模化的成功表明了未来的挑战以及底层架构约束的重要性。虽然规模化继续改进人工智能，但理解彩票机制有助于解释当前的成功并预测未来的局限性。"
  },
  {
    "id": "44925570",
    "title": "One person was able to claim 20M IPs",
    "url": "https://lists.nanog.org/archives/list/nanog@lists.nanog.org/thread/MMCCEQKA4UPGGWFWEBWLYKHTYCAOQIZS/#MMCCEQKA4UPGGWFWEBWLYKHTYCAOQIZS",
    "summary": "Justine Tunney, operator of the online service ipv4.games, is seeking assistance regarding a player who managed to claim an astonishing 20 million IPv4 addresses through her game, representing 9% of all IPv4 hosts according to Censys.\n\nThe game, hosted at ipv4.games, involves users sending HTTP requests from various IP addresses to Tunney's web server. To claim an IP, a successful TCP three-way handshake with a VM on Google's network is required.\n\nTunney is baffled by how a European player, identified as \"femboy.cat,\" achieved this feat. She is soliciting ideas and suggestions from the NANOG community to understand the methods used. Furthermore, she humorously suggests that someone in North America step up to become a rival to this remarkably successful player. The thread includes a list of 17 participants discussing the topic.\n",
    "chinese_title": "一个人能够声称拥有2000万个IP地址。",
    "chinese_summary": "ipv4.games运营者Justine Tunney寻求帮助，一名玩家通过她的游戏成功认领了惊人的2000万个IPv4地址，根据Censys的数据，这相当于所有IPv4主机的9%。\n\n该游戏托管在ipv4.games上，用户需要通过不同的IP地址向Tunney的Web服务器发送HTTP请求。要认领一个IP，需要与Google网络上的VM成功进行TCP三次握手。\n\nTunney对名为“femboy.cat”的欧洲玩家如何做到这一点感到困惑。她正在向NANOG社区征求想法和建议，以了解其使用的方法。此外，她幽默地建议北美有人站出来成为这位非常成功的玩家的竞争对手。该帖子包含17位参与者讨论该主题的列表。"
  },
  {
    "id": "44915228",
    "title": "Precision mapping tracks woody plant spread across Great Plains grasslands",
    "url": "https://phys.org/news/2025-07-precision-tracks-woody-great-plains.html",
    "summary": "K-State researchers are using precision mapping and machine learning to track woody plant encroachment across Great Plains grasslands. Woody encroachment, the transformation of grasslands into shrub and tree-dominated landscapes, impacts biodiversity, forage, water resources, and wildfire risk.\n\nThe study, published in *Remote Sensing*, details a cost-effective, open-access approach combining aerial imagery from federal programs (USDA, NSF) with ground-based data collected at the Konza Prairie Biological Station. Using LiDAR and multispectral imagery, researchers have achieved approximately 97% accuracy in classifying areas as grassland, shrub, tree, or evergreen tree. Machine learning models are trained using data collected by K-State students, who also gain experience with GIS and computer coding.\n\nThe mapping tool's implications extend beyond classification, informing calculations of carrying capacity for bison, fire risk assessments, habitat selection studies, and tick-borne disease exposure research. For example, the data showed that grasshopper sparrows' habitat use declines with even a small amount of woody cover. The researchers aim to share the technology through a website or app for regional early warning systems, eventually partnering with landowners to refine their models using satellite data for broader application and historical analysis. The goal is to provide a transferable skill development opportunity for students while addressing a major environmental challenge in grasslands.\n",
    "chinese_title": "精确测绘追踪大平原草地木本植物扩张",
    "chinese_summary": "堪萨斯州立大学的研究人员正在利用精确绘图和机器学习技术，追踪大平原草原上木本植物入侵的情况。木本植物入侵，即草原转变为以灌木和树木为主的景观，会影响生物多样性、牧草、水资源和野火风险。\n\n这项发表在《遥感》杂志上的研究，详细介绍了一种经济高效、开放获取的方法，该方法结合了联邦项目（美国农业部、美国国家科学基金会）的航空影像和 Konza Prairie 生物站收集的地面数据。利用 LiDAR 和多光谱影像，研究人员在将区域划分为草原、灌木、树木或常绿树木时，达到了约 97% 的准确率。机器学习模型使用堪萨斯州立大学学生收集的数据进行训练，这些学生也获得了地理信息系统和计算机编码方面的经验。\n\n该绘图工具的影响不仅限于分类，还可以为野牛的承载能力计算、火灾风险评估、栖息地选择研究和蜱传疾病暴露研究提供信息。例如，数据显示，草蜢雀的栖息地利用率甚至会随着少量木本覆盖而下降。研究人员计划通过网站或应用程序分享这项技术，用于区域早期预警系统，最终与土地所有者合作，利用卫星数据完善他们的模型，以便更广泛的应用和历史分析。目标是在解决草原面临的主要环境挑战的同时，为学生提供可转移的技能发展机会。"
  },
  {
    "id": "44945959",
    "title": "Lab-grown salmon hits the menu",
    "url": "https://www.smithsonianmag.com/smart-news/lab-grown-salmon-hits-the-menu-at-an-oregon-restaurant-as-the-fda-greenlights-the-cell-cultured-product-180986769/",
    "summary": "Wildtype's lab-grown salmon has received FDA approval, marking the first cultured fish to enter the alternative protein market. The FDA stated it has \"no questions\" about the product's safety. This milestone was celebrated by Wildtype through a partnership with chef Gregory Gourdet, who is serving the lab-grown salmon at Kann, his Haitian restaurant in Portland, Oregon. Gourdet highlights the sustainability and values alignment the product brings to his menu.\n\nLab-grown meat addresses concerns surrounding animal welfare and, in the case of fish, aims to alleviate pressures from pollution, climate change, and overfishing impacting the seafood industry. Wildtype produces its salmon by extracting living cells from Pacific salmon and cultivating them in a controlled environment. Plant-based ingredients are then added to mimic the taste, texture, and appearance of salmon fillets. The company claims its product offers the same nutritional benefits as traditional salmon while eliminating risks of mercury, antibiotics, and parasite contamination.\n\nCurrently, cultivated meat is more expensive and found primarily in high-end restaurants. Wildtype's salmon will be available at Kann on specific nights before expanding to daily availability and other restaurants. While the cultivated meat industry is still small and faces regulatory hurdles, particularly in states considering bans, Wildtype is one of the few companies to receive FDA approval for its cultivated animal products.\n",
    "chinese_title": "实验室培育的三文鱼登上菜单",
    "chinese_summary": "Wildtype实验室培育的三文鱼已获得FDA批准，成为首个进入替代蛋白市场的培育鱼类。FDA表示对该产品的安全性“没有疑问”。Wildtype通过与厨师Gregory Gourdet的合作来庆祝这一里程碑，Gourdet将在其位于俄勒冈州波特兰的海地餐厅Kann供应实验室培育的三文鱼。Gourdet强调了该产品给他的菜单带来的可持续性和价值契合。\n\n实验室培育肉类解决了人们对动物福利的担忧，对于鱼类而言，旨在缓解污染、气候变化和过度捕捞对海产品行业的影响。Wildtype通过从太平洋鲑鱼中提取活细胞并在受控环境中培养来生产其三文鱼。然后添加植物性成分，以模仿三文鱼片的味道、质地和外观。该公司声称其产品提供与传统三文鱼相同的营养益处，同时消除了汞、抗生素和寄生虫污染的风险。\n\n目前，培育肉类价格更高，主要在高档餐厅中才能找到。Wildtype的三文鱼将在特定夜晚在Kann供应，之后将扩展到每日供应和其他餐厅。虽然培育肉类行业规模仍然很小，并且面临监管障碍，尤其是在一些正在考虑禁令的州，但Wildtype是少数几家获得FDA批准其培育动物产品的公司之一。"
  },
  {
    "id": "44937550",
    "title": "SystemD Service Hardening",
    "url": "https://roguesecurity.dev/blog/systemd-hardening",
    "summary": "This article provides a practical guide to hardening systemd services on Linux systems to improve security and reduce the potential impact of a compromise. It emphasizes that the default systemd configurations prioritize ease of use over security and offers various hardening options to address this.\n\nThe article begins by introducing the `systemd-analyze security` tool to assess the security posture of individual services or the entire system. It explains the meaning of the output, focusing on the exposure metric to prioritize security improvements.\n\nThe core of the article details how to implement security changes by modifying the `[Service]` section of systemd unit files (or `[Container]` section for podman quadlets). It recommends using override stubs for cleaner configuration management.\n\nA comprehensive, though admittedly incomplete, list of security options is provided, with explanations for options like `ProtectSystem`, `PrivateTmp`, `ProtectHome`, `SystemCallFilter` and others. It also addresses troubleshooting `SystemCallFilter` restrictions, including how to use `auditd` to identify blocked syscalls.\n\nThe author advises focusing on external-facing services first, like web servers and SSH, and particularly custom scripts run through systemd. Key hardening suggestions are summarized in a cliffnotes section. The article includes an example of hardening a Traefik quadlet unit.\n\nThe author concludes by stressing that this is a tool for responsible Linux administrators and self-hosters.\n",
    "chinese_title": "SystemD 服务加固",
    "chinese_summary": "本文提供了一份实用指南，旨在加强 Linux 系统上 systemd 服务的安全性，以降低潜在的安全漏洞带来的影响。文章强调，默认的 systemd 配置侧重易用性而非安全性，并提供了多种加固选项来解决这一问题。\n\n文章首先介绍 `systemd-analyze security` 工具，用于评估单个服务或整个系统的安全状况。它解释了输出结果的含义，重点关注暴露指标，以便优先进行安全改进。\n\n文章的核心内容详细介绍了如何通过修改 systemd 单元文件（或 podman quadlet 的 `[Container]` 部分）的 `[Service]` 部分来实施安全更改。文章建议使用覆盖存根来实现更清晰的配置管理。\n\n文章提供了一个全面的（尽管承认是不完整的）安全选项列表，并解释了诸如 `ProtectSystem`、`PrivateTmp`、`ProtectHome`、`SystemCallFilter` 等选项的含义。它还讨论了 `SystemCallFilter` 限制的故障排除，包括如何使用 `auditd` 来识别被阻止的系统调用。\n\n作者建议首先关注面向外部的服务，例如 Web 服务器和 SSH，特别是通过 systemd 运行的自定义脚本。文章在要点部分总结了关键的加固建议，并包含了一个加固 Traefik quadlet 单元的示例。\n\n作者最后强调，这是一个为负责任的 Linux 管理员和自托管用户提供的工具。"
  },
  {
    "id": "44919527",
    "title": "Association for the Preservation of Spiritualist and Occult Periodicals",
    "url": "https://iapsop.com",
    "summary": "The International Association for the Preservation of Spiritualist and Occult Periodicals (IAPSOP) is a US-based, all-volunteer organization dedicated to digitally preserving Spiritualist and occult periodicals published between the Congress of Vienna and World War II. Their archive, available free of charge to students and researchers, contains over 4.13 million pages from monographs and periodicals, totaling over 730 gigabytes of data.\n\nIAPSOP is currently experiencing service restrictions due to excessive crawling from IP addresses associated with AWS, China, and other sources likely being used to train large language models, impacting equitable access. They are throttling connection speeds and limiting bandwidth as a result.\n\nThe site offers various avenues for exploration, including direct access to the archive index, curated lists of occult areas, and a Lessons archive for practical teachings. Customer support is available for requests, help, and technical issues. They also maintain a want list for materials and welcome contributions of material and labor.\n\nThe organization highlights recent updates to German and French occult periodicals and lists the top 20 most accessed publications and visiting countries over the past 90 days. The material is licensed under a Creative Commons Attribution-NonCommercial 4.0 International License, and IAPSOP emphasizes its commitment to user privacy and data rights.\n",
    "chinese_title": "灵学及神秘学期刊保存协会",
    "chinese_summary": "国际灵学与神秘学期刊保存协会（IAPSOP）是一家位于美国的纯志愿者组织，致力于对维也纳会议至二战期间出版的灵学和神秘学期刊进行数字化保存。他们的档案向学生和研究人员免费开放，包含超过413万页的专著和期刊，总计超过730GB的数据。\n\n目前，由于与AWS、中国和其他可能用于训练大型语言模型的IP地址相关的过度爬取，IAPSOP正面临服务限制，这影响了公平访问。因此，他们正在限制连接速度和带宽。\n\n该网站提供多种探索途径，包括直接访问档案索引、精选的神秘学领域列表，以及用于实践教学的课程档案。如有请求、帮助或技术问题，可获得客户支持。他们还维护一个材料需求清单，并欢迎材料和劳力的捐赠。\n\n该组织重点介绍了德语和法语神秘学期刊的最新更新，并列出了过去90天内访问量最高的20种出版物和访问国家/地区。这些资料根据知识共享署名-非商业性4.0国际许可协议进行授权，IAPSOP强调其对用户隐私和数据权利的承诺。"
  },
  {
    "id": "44946813",
    "title": "A general Fortran code for solutions of problems in space mechanics [pdf]",
    "url": "https://jonathanadams.pro/blog-articles/Nasa-Fortran-Code-1963.pdf",
    "summary": "This document appears to be a corrupted or incomplete PDF file titled \"A general Fortran code for solutions of problems in space mechanics.\" The PDF content itself is mostly binary data and metadata, including xref tables, object definitions, and stream data (potentially compressed using FlateDecode or CCITTFaxDecode). It contains information related to the structure of a PDF document, such as catalog, pages, fonts, and images, but the bulk of the content seems to be encoded image data and text encoding definitions. Due to the nature of the content, and it's binary structure, no meaningful, human readable summary of the *article's content* is possible. The document likely *contains* fortran code, but the details are within the encoded and likely incomplete data.\n",
    "chinese_title": "用于解决航天力学问题的通用Fortran代码[pdf]",
    "chinese_summary": "此文档似乎是一个已损坏或不完整的PDF文件，标题为“空间力学问题求解的通用Fortran代码”。PDF内容主要为二进制数据和元数据，包括交叉引用表、对象定义和流数据（可能使用FlateDecode或CCITTFaxDecode压缩）。它包含与PDF文档结构相关的信息，例如目录、页面、字体和图像，但大部分内容似乎是编码的图像数据和文本编码定义。由于内容的性质及其二进制结构，无法提供*文章内容*的有意义、人类可读的摘要。该文档可能*包含*Fortran代码，但详细信息位于编码且可能不完整的数据中。"
  },
  {
    "id": "44923777",
    "title": "A Case for Protecting Computer Games with SGX (2016)",
    "url": "https://dl.acm.org/doi/10.1145/3007788.3007792",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "使用SGX保护电脑游戏的案例 (2016)",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "44944291",
    "title": "T-Mobile claimed selling location data without consent is legal–judges disagree",
    "url": "https://arstechnica.com/tech-policy/2025/08/t-mobile-claimed-selling-location-data-without-consent-is-legal-judges-disagree/",
    "summary": "A federal appeals court upheld $92 million in FCC fines against T-Mobile and Sprint for illegally selling customer location data to third-party firms without consent. The FCC initially fined T-Mobile, AT&T, and Verizon for sharing this data and failing to protect it from unauthorized disclosure. T-Mobile and Sprint argued the FCC overstepped its authority, but the court ruled against them, stating the FCC acted properly.\n\nThe court emphasized that cell phone location data creates an \"intimate window\" into a person's life. Until 2019, T-Mobile and Sprint sold this data to aggregators without verifying customer consent, leading to abuses. The court rejected the carriers' arguments that the location data didn't qualify as sensitive information under the law and that the fines were too large, citing the \"egregious\" nature of their conduct, even after breaches were exposed.\n\nThe court also dismissed the carriers' claims about a right to a jury trial, stating they voluntarily surrendered this right by seeking direct review. T-Mobile is \"reviewing\" the court's decision, while AT&T and Verizon are challenging their respective fines in other appellate courts. The FCC initially proposed the fines in 2020 but finalized them in 2024.\n",
    "chinese_title": "T-Mobile声称未经同意出售位置数据是合法的——法官们并不同意。",
    "chinese_summary": "联邦上诉法院维持了FCC对T-Mobile和Sprint处以的9200万美元罚款，原因是其在未经同意的情况下非法向第三方公司出售客户位置数据。FCC最初对T-Mobile、AT&T和Verizon处以罚款，原因是其共享此数据且未能保护其免受未经授权的披露。T-Mobile和Sprint辩称FCC越权，但法院驳回了他们的论点，称FCC行为得当。\n\n法院强调，手机位置数据为窥探个人生活提供了一个“私密窗口”。在2019年之前，T-Mobile和Sprint在未核实客户同意的情况下将此数据出售给聚合商，导致滥用行为。法院驳回了运营商的论点，即位置数据不符合法律规定的敏感信息，以及罚款过高，并援引了他们行为的“恶劣”性质，即使在违规行为曝光后也是如此。\n\n法院还驳回了运营商关于陪审团审判权的诉求，称他们通过寻求直接审查自愿放弃了这项权利。T-Mobile正在“审查”法院的判决，而AT&T和Verizon正在其他上诉法院质疑各自的罚款。FCC最初于2020年提出罚款，但于2024年最终确定。"
  },
  {
    "id": "44951357",
    "title": "Silicon Valley's AI deals are creating zombie startups",
    "url": "https://www.cnbc.com/2025/08/19/how-ai-zombie-deals-work-meta-google.html",
    "summary": "Silicon Valley's AI boom is leading to a new type of acquisition where tech giants like Meta, Google, Microsoft, and Amazon are poaching founders and key researchers from AI startups, leaving behind what some investors call \"zombie companies.\" This practice allows these giants to bypass regulatory hurdles associated with traditional mergers and acquisitions.\n\nThe article highlights examples like Google's $2.4 billion licensing deal with Windsurf, which resulted in the founders leaving to join Google, and Meta's $14.3 billion investment in Scale AI, followed by the departure of its CEO. Microsoft's move to hire Inflection AI's co-founders is another instance.\n\nThis trend raises concerns among venture capitalists, as promising startups are being dismantled, with most of the financial gains going to the founders and key engineers, rather than benefiting investors and other employees. While deals like Meta's investment in Scale AI provided significant returns for early investors, others leave the remaining company in a precarious position.\n\nThe article notes that regulatory scrutiny, particularly from the FTC, has pushed tech companies towards this workaround. While regulators are investigating some deals, the trend continues, potentially stifling innovation as talented individuals are lured away from independent ventures to work for established corporations.\n",
    "chinese_title": "硅谷AI交易催生僵尸初创公司",
    "chinese_summary": "硅谷人工智能热潮催生新型收购：Meta、谷歌、微软和亚马逊等科技巨头纷纷从人工智能初创企业挖走创始人及核心研究人员，导致一些投资者口中的“僵尸公司”出现。这种做法使这些巨头能够绕过与传统并购相关的监管障碍。\n\n文章重点提到了一些案例，例如谷歌与Windsurf达成24亿美元的授权协议，导致其创始人离职加入谷歌；以及Meta对Scale AI投资143亿美元后，其CEO离职。微软聘用Inflection AI联合创始人的举动也是另一个例子。\n\n这种趋势引起了风险投资家的担忧，因为有前途的初创企业正在被拆解，大部分经济利益流向了创始人及核心工程师，而非投资者和其他员工。虽然像Meta投资Scale AI这样的交易为早期投资者带来了丰厚的回报，但其他交易却使剩余的公司处于岌岌可危的境地。\n\n文章指出，监管机构，尤其是联邦贸易委员会（FTC）的审查，推动科技公司转向这种变通办法。尽管监管机构正在调查一些交易，但这种趋势仍在继续，可能会扼杀创新，因为有才华的人被从独立企业中吸引走，转而为老牌公司工作。"
  },
  {
    "id": "44953264",
    "title": "CEO pay at top US companies accelerates at fastest pace in 4 years",
    "url": "https://www.ft.com/content/d8da9877-a5d0-4ac2-87cd-236ff33d7269",
    "summary": "This article from the Financial Times discusses the acceleration of CEO pay at top US companies, reporting the fastest pace of increase in four years. Unfortunately, the text provided is primarily a subscription prompt and doesn't contain details about the actual content of the article on CEO pay. It's impossible to provide a complete summary without access to the full article. However, based on the title, the article likely explores the following themes:\n\n*   **CEO compensation trends:** The article will probably analyze the trends in CEO pay at leading US companies, focusing on the rate of increase compared to previous years.\n*   **Factors driving the increase:** The article will likely discuss potential factors driving the rise in CEO compensation, such as company performance, market conditions, or changes in compensation structures.\n*   **Potential impacts:** The article might discuss the potential impact of rising CEO pay on issues such as income inequality, shareholder value, and employee morale.\n*   **Financial Times' analysis:** The article would provide analysis and insights from the Financial Times' perspective on the trends in CEO pay.\n\nTo get a complete summary, the full article would need to be accessed.\n",
    "chinese_title": "美国顶级公司CEO薪酬以四年最快速度增长",
    "chinese_summary": "金融时报报道显示美国顶级公司CEO薪酬加速上涨，创四年最快增速。但遗憾的是，提供的文本主要为订阅提示，未包含关于CEO薪酬文章的具体内容。在无法访问全文的情况下，无法提供完整的摘要。然而，根据标题，文章可能探讨以下主题：\n\n*   **CEO薪酬趋势：** 文章可能分析美国领先公司CEO薪酬的趋势，重点关注与往年相比的增长速度。\n*   **推动增长的因素：** 文章可能讨论推动CEO薪酬上涨的潜在因素，例如公司业绩、市场状况或薪酬结构的变化。\n*   **潜在影响：** 文章可能讨论CEO薪酬上涨对收入不平等、股东价值和员工士气等问题的潜在影响。\n*   **《金融时报》的分析：** 文章将从《金融时报》的角度提供对CEO薪酬趋势的分析和见解。\n\n要获得完整的摘要，需要访问全文。"
  },
  {
    "id": "44922540",
    "title": "Walkie-Textie Wireless Communicator",
    "url": "http://www.technoblogy.com/show?2AON",
    "summary": "The Walkie-Textie is a handheld device that uses the LoRa wireless protocol for sending and receiving text messages, ideal for areas without mobile signal or as a low-cost communication tool. It features a 12-key keypad for multi-tap text entry, an OLED display for messages and status, and utilizes the HopeRF RFM95W LoRa module controlled by an ATtiny814 microcontroller.\n\nLoRa offers a range of up to 10 miles in rural areas and uses license-free sub-gigahertz frequencies. The Walkie-Textie displays received messages in a scrolling window and shows signal strength, beeper status, and battery level.\n\nThe device's construction involves soldering surface-mount components onto a custom-designed PCB, which the author had manufactured by JLCPCB. A simple wire antenna or an SMA connector for a \"rubber ducky\" antenna can be used. It can be powered by a LiPo battery or two AAA batteries.\n\nThe program uses character-cell plotting to avoid needing a memory display buffer and utilizes the Arduino LoRa library for wireless communication. Users need to set the appropriate frequency and SyncWord in the code. The ATtiny814 microcontroller is programmed using Spence Konde's megaTinyCore and a USB to Serial board. Resources like the code, Eagle/Gerber files for the PCB, and a parts list are provided. The article also suggests that a message receipt confirmation system could be implemented.\n",
    "chinese_title": "无线对讲文本通讯器",
    "chinese_summary": "Walkie-Textie是一种手持设备，使用LoRa无线协议发送和接收文本消息，非常适合没有移动信号的区域或作为低成本的通信工具。它具有一个用于多次点击文本输入的12键键盘，一个用于显示消息和状态的OLED显示屏，并使用由ATtiny814微控制器控制的HopeRF RFM95W LoRa模块。\n\nLoRa在乡村地区提供高达10英里的范围，并使用免许可的亚千兆赫频率。Walkie-Textie在一个滚动窗口中显示接收到的消息，并显示信号强度、蜂鸣器状态和电池电量。\n\n该设备的构造涉及将表面贴装组件焊接在定制设计的PCB上，该PCB由JLCPCB制造。可以使用简单的导线天线或用于“橡胶鸭”天线的SMA连接器。它可以由LiPo电池或两节AAA电池供电。\n\n该程序使用字符单元绘图来避免需要内存显示缓冲区，并利用Arduino LoRa库进行无线通信。用户需要在代码中设置适当的频率和SyncWord。ATtiny814微控制器使用Spence Konde的megaTinyCore和USB转串口板进行编程。提供了代码、PCB的Eagle/Gerber文件和零件清单等资源。该文章还建议可以实施消息回执确认系统。"
  },
  {
    "id": "44921780",
    "title": "The Cutaway Illustrations of Fred Freeman (2016)",
    "url": "https://5wgraphicsblog.com/2016/10/24/the-cutaway-illustrations-of-fred-freeman/",
    "summary": "生成摘要时出错",
    "chinese_title": "The Cutaway Illustrations of Fred Freeman (2016)",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44945379",
    "title": "Show HN: Fractional jobs – part-time roles for engineers",
    "url": "https://www.fractionaljobs.io",
    "summary": "生成摘要时出错",
    "chinese_title": "Show HN: Fractional jobs – part-time roles for engineers",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44941711",
    "title": "The Weight of a Cell",
    "url": "https://www.asimov.press/p/cell-weight",
    "summary": "生成摘要时出错",
    "chinese_title": "The Weight of a Cell",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44938818",
    "title": "Electromechanical reshaping,  an alternative to laser eye surgery",
    "url": "https://medicalxpress.com/news/2025-08-alternative-lasik-lasers.html",
    "summary": "生成摘要时出错",
    "chinese_title": "Electromechanical reshaping,  an alternative to laser eye surgery",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44937991",
    "title": "Web apps in a single, portable, self-updating, vanilla HTML file",
    "url": "https://hyperclay.com/",
    "summary": "生成摘要时出错",
    "chinese_title": "Web apps in a single, portable, self-updating, vanilla HTML file",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44948013",
    "title": "ChatGPT Go",
    "url": "https://help.openai.com/en/articles/11989085-what-is-chatgpt-go",
    "summary": "生成摘要时出错",
    "chinese_title": "ChatGPT Go",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44935658",
    "title": "The Lives and Loves of James Baldwin",
    "url": "https://www.newyorker.com/magazine/2025/08/18/baldwin-a-love-story-nicholas-boggs-book-review",
    "summary": "生成摘要时出错",
    "chinese_title": "The Lives and Loves of James Baldwin",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44941963",
    "title": "Who Invented Backpropagation?",
    "url": "https://people.idsia.ch/~juergen/who-invented-backpropagation.html",
    "summary": "生成摘要时出错",
    "chinese_title": "Who Invented Backpropagation?",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44945783",
    "title": "Structured (Synchronous) Concurrency",
    "url": "https://fsantanna.github.io/sc.html",
    "summary": "生成摘要时出错",
    "chinese_title": "Structured (Synchronous) Concurrency",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44915939",
    "title": "Sikkim and the Himalayan Chess Game (2016)",
    "url": "https://www.historytoday.com/archive/feature/sikkim-and-himalayan-chess-game",
    "summary": "生成摘要时出错",
    "chinese_title": "Sikkim and the Himalayan Chess Game (2016)",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44946783",
    "title": "XZ Utils Backdoor Still Lurking in Docker Images",
    "url": "https://www.binarly.io/blog/persistent-risk-xz-utils-backdoor-still-lurking-in-docker-images",
    "summary": "生成摘要时出错",
    "chinese_title": "XZ Utils Backdoor Still Lurking in Docker Images",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44951799",
    "title": "Why I'm all-in on Zen Browser",
    "url": "https://werd.io/why-im-all-in-on-zen-browser/",
    "summary": "生成摘要时出错",
    "chinese_title": "Why I'm all-in on Zen Browser",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44927629",
    "title": "How to free up and automatically manage disk space for WSL",
    "url": "https://www.freecodecamp.org/news/how-to-free-up-and-automatically-manage-disk-space-for-wsl-on-windows-1011/",
    "summary": "生成摘要时出错",
    "chinese_title": "How to free up and automatically manage disk space for WSL",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44953144",
    "title": "Why Are Some Stats Too 'Girly' for the BLS?",
    "url": "https://www.bloomberg.com/opinion/articles/2025-08-19/some-statistics-are-too-girly-for-the-bls",
    "summary": "生成摘要时出错",
    "chinese_title": "Why Are Some Stats Too 'Girly' for the BLS?",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44943420",
    "title": "How much do electric car batteries degrade?",
    "url": "https://www.sustainabilitybynumbers.com/p/electric-car-battery-degradation",
    "summary": "生成摘要时出错",
    "chinese_title": "How much do electric car batteries degrade?",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44939014",
    "title": "LinkedIn is the fakest platform of them all",
    "url": "https://www.prospectmagazine.co.uk/ideas/technology/70741/linkedin-is-the-fakest-platform-of-them-all",
    "summary": "生成摘要时出错",
    "chinese_title": "LinkedIn is the fakest platform of them all",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44945660",
    "title": "Phrack 72",
    "url": "https://phrack.org/issues/72/1",
    "summary": "生成摘要时出错",
    "chinese_title": "Phrack 72",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44953431",
    "title": "The Pragmatic Engineer 2025 Survey: What's in your tech stack? Part 1",
    "url": "https://newsletter.pragmaticengineer.com/p/the-pragmatic-engineer-2025-survey",
    "summary": "生成摘要时出错",
    "chinese_title": "The Pragmatic Engineer 2025 Survey: What's in your tech stack? Part 1",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44944620",
    "title": "GenAI FOMO has spurred businesses to light nearly $40B on fire",
    "url": "https://www.theregister.com/2025/08/18/generative_ai_zero_return_95_percent/",
    "summary": "生成摘要时出错",
    "chinese_title": "GenAI FOMO has spurred businesses to light nearly $40B on fire",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44950482",
    "title": "I Run a Full Linux Desktop in Docker Just Because I Can",
    "url": "https://www.howtogeek.com/i-run-a-full-linux-desktop-in-docker-just-because-i-can/",
    "summary": "生成摘要时出错",
    "chinese_title": "I Run a Full Linux Desktop in Docker Just Because I Can",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44940363",
    "title": "Apple and Amazon will miss AI like Intel missed mobile",
    "url": "https://gmays.com/the-biggest-bet-in-tech/",
    "summary": "生成摘要时出错",
    "chinese_title": "Apple and Amazon will miss AI like Intel missed mobile",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44921879",
    "title": "Countrywide natural experiment links built environment to physical activity",
    "url": "https://www.nature.com/articles/s41586-025-09321-3",
    "summary": "生成摘要时出错",
    "chinese_title": "Countrywide natural experiment links built environment to physical activity",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44919666",
    "title": "8x19 Text Mode Font Origins",
    "url": "https://www.os2museum.com/wp/8x19-text-mode-font-origins/",
    "summary": "生成摘要时出错",
    "chinese_title": "8x19 Text Mode Font Origins",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44940089",
    "title": "Vibe coding tips and tricks",
    "url": "https://github.com/awslabs/mcp/blob/main/VIBE_CODING_TIPS_TRICKS.md",
    "summary": "生成摘要时出错",
    "chinese_title": "Vibe coding tips and tricks",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44908528",
    "title": "A gigantic jet caught on camera: A spritacular moment for NASA astronaut",
    "url": "https://science.nasa.gov/science-research/heliophysics/a-gigantic-jet-caught-on-camera-a-spritacular-moment-for-nasa-astronaut-nicole-ayers/",
    "summary": "生成摘要时出错",
    "chinese_title": "A gigantic jet caught on camera: A spritacular moment for NASA astronaut",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44942602",
    "title": "My Retro TVs",
    "url": "https://www.myretrotvs.com/",
    "summary": "生成摘要时出错",
    "chinese_title": "My Retro TVs",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44920747",
    "title": "Image Fulgurator (2011)",
    "url": "https://juliusvonbismarck.com/bank/index.php/projects/image-fulgurator/2/",
    "summary": "生成摘要时出错",
    "chinese_title": "Image Fulgurator (2011)",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44943160",
    "title": "TREAD: Token Routing for Efficient Architecture-Agnostic Diffusion Training",
    "url": "https://arxiv.org/abs/2501.04765",
    "summary": "生成摘要时出错",
    "chinese_title": "TREAD: Token Routing for Efficient Architecture-Agnostic Diffusion Training",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44951919",
    "title": "What Is the Luhn Algorithm? The Math Behind Credit Card Transactions",
    "url": "https://www.scientificamerican.com/article/what-is-the-luhn-algorithm-the-math-behind-secure-credit-card-numbers/",
    "summary": "生成摘要时出错",
    "chinese_title": "What Is the Luhn Algorithm? The Math Behind Credit Card Transactions",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44942949",
    "title": "Macintosh Drawing Software Compared (2021)",
    "url": "https://blog.gingerbeardman.com/2021/04/24/macintosh-drawing-software-compared/",
    "summary": "生成摘要时出错",
    "chinese_title": "Macintosh Drawing Software Compared (2021)",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44912822",
    "title": "Sky Calendar",
    "url": "https://abramsplanetarium.org/SkyCalendar/index.html",
    "summary": "生成摘要时出错",
    "chinese_title": "Sky Calendar",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44945966",
    "title": "What could have been",
    "url": "https://coppolaemilio.com/entries/what-could-have-been/",
    "summary": "生成摘要时出错",
    "chinese_title": "What could have been",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44948648",
    "title": "Britain Drops Request That Apple Create a Back Door",
    "url": "https://www.nytimes.com/2025/08/19/technology/britain-apple-back-door.html",
    "summary": "生成摘要时出错",
    "chinese_title": "Britain Drops Request That Apple Create a Back Door",
    "chinese_summary": "生成摘要时出错"
  }
]