[
  {
    "id": "45823141",
    "title": "The shadows lurking in the equations",
    "url": "https://gods.art/articles/equation_shadows.html",
    "summary": "This article introduces \"FuzzyGraph,\" a new approach to visualizing equations that goes beyond the traditional binary (black and white) method of showing only where an equation is exactly true. Instead, FuzzyGraph uses a non-binary approach to visualize the \"error\" or deviation from equality, revealing \"mathematical shadows\" lurking beneath the surface of equations.\n\nThe article uses several examples to illustrate the power of FuzzyGraph. These examples show how FuzzyGraph can reveal \"black holes\" (regions of high error), \"shadow lines,\" and \"underwater islands\" (regions of near-solution) that are completely invisible in conventional graphs.\n\nExamples like the \"Slash Dot Equation\" and the \"Quasar Equation\" demonstrate how FuzzyGraph exposes regions where the equation fails, offering a more complete understanding of its behavior. The \"Simple Star and Black Hole\" examples further clarify the concept of representing error visually. The \"Shadow Line\" and \"Phi Equation\" examples illustrate how division can create \"shadows\" of previously visible elements. Finally, the \"Underwater Islands\" example shows how FuzzyGraph can reveal near-solutions to an equation, which can then be tweaked to become actual solutions, highlighting the potential for discovering hidden relationships.\n\nIn essence, FuzzyGraph provides a more nuanced and informative visualization of equations by revealing the underlying mathematical topography that conventional graphs miss, offering deeper insights into equation behavior and potential solutions.\n",
    "chinese_title": "潜藏在公式中的阴影",
    "chinese_summary": "本文介绍了一种新的方程可视化方法“模糊图”(FuzzyGraph)，它超越了传统的二元（黑白）方法，即只显示方程完全成立的位置。相反，FuzzyGraph采用非二元方法来可视化“误差”或与等式的偏差，从而揭示隐藏在方程表面之下的“数学阴影”。\n\n本文使用多个例子来说明FuzzyGraph的强大功能。这些例子表明，FuzzyGraph可以揭示传统图形中完全不可见的“黑洞”（高误差区域）、“阴影线”和“水下岛屿”（近解区域）。\n\n“Slash Dot方程”和“类星体方程”等示例展示了FuzzyGraph如何暴露方程失效的区域，从而更全面地了解其行为。“简单星和黑洞”示例进一步阐明了可视化表示误差的概念。“阴影线”和“Phi方程”示例说明了除法如何产生先前可见元素的“阴影”。最后，“水下岛屿”示例展示了FuzzyGraph如何揭示方程的近解，然后可以对其进行调整以成为实际解，从而突出了发现隐藏关系的可能性。\n\n本质上，FuzzyGraph通过揭示传统图形遗漏的底层数学地形，提供了一种更细致和信息丰富的方程可视化方法，从而更深入地了解方程的行为和潜在的解决方案。"
  },
  {
    "id": "45812756",
    "title": "An eBPF Loophole: Using XDP for Egress Traffic",
    "url": "https://loopholelabs.io/blog/xdp-for-egress-traffic",
    "summary": "This article details a novel technique to use XDP (eXpress Data Path) for egress traffic in Linux, overcoming its traditional limitation to ingress traffic. The core idea exploits the behavior of Virtual Ethernet (veth) interfaces. By routing outgoing traffic through one end of a veth pair, the other end perceives it as incoming traffic, allowing an XDP program attached to that interface to process the packet.\n\nThe authors highlight the performance limitations of existing egress traffic solutions like Traffic Control (TC) due to their late operation in the networking stack, contrasting it with XDP's early, zero-copy packet processing.\n\nThe implementation involves addressing checksumming and ARP resolution, responsibilities normally handled by the kernel but bypassed when using XDP directly. The authors provide code snippets demonstrating how to perform incremental checksum updates and manage an ARP table within the XDP program.\n\nBenchmarks comparing iptables, TC, and their XDP-based technique reveal significant performance gains, achieving near line-rate speeds (194Gbps) with the native XDP driver, outperforming iptables by 12.4x and TC by 9.2x. This improvement stems from bypassing the kernel's networking stack.\n\nThe authors emphasize the immediate applicability of this technique for container networking. Since containers already use veth pairs, this solution can be implemented as a drop-in replacement, bypassing iptables and connection tracking for faster packet routing. The primary use case is live migration, enabling transparent rerouting of connections at line rates.\n",
    "chinese_title": "一个eBPF漏洞：使用XDP处理出口流量",
    "chinese_summary": "本文详细介绍了一种使用XDP（eXpress Data Path）处理Linux出口流量的新技术，克服了其传统上仅限于入口流量的局限性。其核心思想是利用虚拟以太网（veth）接口的行为。通过将出站流量路由到veth对的一端，另一端将其视为入站流量，从而允许附加到该接口的XDP程序处理数据包。\n\n作者强调了现有出口流量解决方案（如Traffic Control (TC)）由于其在网络堆栈中运行较晚而存在的性能限制，并将其与XDP的早期、零拷贝数据包处理进行了对比。\n\n该实现涉及解决校验和计算和ARP解析问题，这些职责通常由内核处理，但在直接使用XDP时会被绕过。作者提供了代码片段，演示如何在XDP程序中执行增量校验和更新并管理ARP表。\n\n基准测试比较了iptables、TC和他们基于XDP的技术，结果显示性能显著提升，在使用原生XDP驱动程序时实现了接近线路速率的速度（194Gbps），性能分别是iptables的12.4倍和TC的9.2倍。这种改进源于绕过了内核的网络堆栈。\n\n作者强调了该技术在容器网络中的直接适用性。由于容器已经使用veth对，因此该解决方案可以作为直接替代方案来实现，绕过iptables和连接跟踪以实现更快的包路由。 主要用例是实时迁移，从而能够以线路速率透明地重新路由连接。"
  },
  {
    "id": "45763262",
    "title": "Learning from failure to tackle hard problems",
    "url": "https://blog.ml.cmu.edu/2025/10/27/learning-from-failure-to-tackle-extremely-hard-problems/",
    "summary": "This Carnegie Mellon University Machine Learning Blog article emphasizes the importance of learning from failure as a crucial aspect of tackling extremely hard problems in machine learning research. It suggests that acknowledging and analyzing failures, rather than solely focusing on successes, provides valuable insights for refining approaches and identifying new directions. The blog likely delves into how researchers can effectively extract actionable information from unsuccessful experiments and model attempts.\n\nWhile the exact details of the article are unavailable without the full text, it likely highlights methodologies for analyzing failures, such as:\n\n*   **Rigorous experiment design and documentation:** Ensures that failures are well-documented and reproducible, allowing for accurate diagnosis of the root causes.\n*   **Post-mortem analysis:** Involves a thorough review of the experiment or model-building process to identify weaknesses, flawed assumptions, or unforeseen challenges.\n*   **Iterative refinement:** Uses the knowledge gained from failures to adjust parameters, modify algorithms, or explore alternative approaches in subsequent attempts.\n\nThe article, judging from its focus on educational content, likely presents specific examples or case studies where learning from failure led to significant breakthroughs in tackling difficult machine learning problems. It aims to encourage a culture of embracing failure as a necessary stepping stone towards progress within the ML@CMU research community and beyond. It promotes the idea that understanding *why* something fails is often just as, if not more, valuable than knowing *that* something works.\n",
    "chinese_title": "从失败中学习，以解决难题",
    "chinese_summary": "卡内基梅隆大学机器学习博客文章强调了从失败中学习的重要性，认为这是解决机器学习研究中极难问题的关键。文章建议，承认和分析失败，而不是仅仅关注成功，能够为改进方法和确定新方向提供宝贵的见解。该博客可能深入探讨了研究人员如何有效地从不成功的实验和模型尝试中提取可操作的信息。\n\n虽然在没有全文的情况下无法获得文章的具体细节，但它可能强调了分析失败的方法，例如：\n\n* **严格的实验设计和文档记录：** 确保对失败进行充分记录并具有可重复性，从而可以准确诊断根本原因。\n* **事后分析：** 涉及对实验或模型构建过程进行彻底审查，以找出弱点、有缺陷的假设或未预见的挑战。\n* **迭代改进：** 利用从失败中获得的知识来调整参数、修改算法或在后续尝试中探索替代方法。\n\n从其对教育内容的关注来看，该文章很可能提出了具体的例子或案例研究，其中从失败中学习导致了在解决困难的机器学习问题方面的重大突破。它旨在鼓励一种拥抱失败的文化，将其作为 ML@CMU 研究社区内外进步的必要阶梯。它提倡这样一种观点，即理解*为什么*某些事情失败，通常与知道*某些事情有效*一样，甚至更有价值。"
  },
  {
    "id": "45823831",
    "title": "Ruby and Its Neighbors: Smalltalk",
    "url": "https://noelrappin.com/blog/2025/11/ruby-and-its-neighbors-smalltalk/",
    "summary": "This article explores the history and influence of Smalltalk on programming languages, particularly Ruby. While Smalltalk's syntax didn't directly transfer to Ruby, its object model profoundly impacted Ruby's design.\n\nThe author provides a personal history of Smalltalk, highlighting its origins at Xerox PARC alongside inventions like the windowed interface and ethernet. Smalltalk gained commercial traction in the 80s and 90s, finding use in industries like aviation. The open-source version, Squeak, was innovative in its self-hosting architecture, written mostly in Smalltalk itself.\n\nSmalltalk distinguishes itself from many modern languages by its independence from Unix and C, operating more like its own operating system. The development environment, tightly integrated with the language, features Workspaces (REPL) and Browsers for code editing and navigation. The Browser allows full access to the system's source code and modification capabilities.\n\nSmalltalk's syntax is simple, built around message passing between objects with unary, binary, and keyword messages. The article demonstrates how even basic operations rely on these message structures.\n\nThe article emphasizes the power of Smalltalk's integrated environment, especially for testing and debugging. The author laments that the all-encompassing nature of Smalltalk's environment, while a strength, ultimately contributed to its decline as the world shifted to Unix-based systems. However, Smalltalk's object-oriented principles continue to resonate in modern languages like Ruby.\n",
    "chinese_title": "Ruby及其邻居：Smalltalk",
    "chinese_summary": "本文探讨了Smalltalk对编程语言，特别是Ruby的历史和影响。虽然Smalltalk的语法没有直接移植到Ruby，但其对象模型深刻影响了Ruby的设计。\n\n作者提供了Smalltalk的个人历史，重点介绍了它在施乐PARC的起源，以及窗口界面和以太网等发明。Smalltalk在80年代和90年代获得了商业上的成功，并在航空等行业中得到应用。开源版本Squeak以其自托管架构而创新，主要用Smalltalk本身编写。\n\nSmalltalk与许多现代语言的区别在于它独立于Unix和C，更像是一个独立的操作系统。开发环境与语言紧密集成，具有用于代码编辑和导航的工作区（REPL）和浏览器。浏览器允许完全访问系统的源代码和修改功能。\n\nSmalltalk的语法很简单，围绕对象之间的消息传递构建，包括一元、二元和关键字消息。本文演示了即使是基本操作也依赖于这些消息结构。\n\n本文强调了Smalltalk集成环境的强大功能，尤其是在测试和调试方面。作者感叹，Smalltalk环境的包罗万象虽然是一个优势，但最终导致了它的衰落，因为世界转向了基于Unix的系统。然而，Smalltalk的面向对象原则继续在像Ruby这样的现代语言中产生共鸣。"
  },
  {
    "id": "45822982",
    "title": "A P2P Vision for QUIC (2024)",
    "url": "https://seemann.io/posts/2024-10-26---p2p-quic/",
    "summary": "This article, \"A P2P Vision for QUIC,\" explores using QUIC to simplify and improve NAT traversal in peer-to-peer (P2P) networks, traditionally handled by complex protocols like STUN, ICE, and TURN. The authors propose leveraging QUIC's connection migration and address discovery mechanisms to replace these older methods.\n\nThe traditional approach involves:\n*   **STUN:** Discovering public IP addresses behind NATs.\n*   **ICE:** Coordinating hole punching, where peers simultaneously send packets to \"punch\" holes in their NATs.\n*   **TURN:** Relaying traffic through a third-party server when direct connections fail.\n\nThe QUIC-based approach offers a more integrated solution:\n*   **QUIC Address Discovery:** Replacing STUN by exchanging observed addresses within QUIC connections using a new `OBSERVED_ADDRESS` frame.\n*   **Hole Punching via Connection Migration:** Utilizing QUIC's connection migration mechanism (designed for seamless network switching) to send probing packets (`PATH_CHALLENGE` and `PATH_RESPONSE`) for hole punching. Requires a new `PUNCH_ME_NOW` frame for coordination.\n*   **Relaying with HTTP Proxying:** Using HTTP proxying over QUIC to relay UDP packets when direct connections are impossible. This utilizes `HTTP Datagrams` which are thin wrappers around QUIC `DATAGRAM` frames.\n\nThe authors argue that QUIC's encryption, integrated address discovery, and existing connection migration features provide a more secure, efficient, and potentially simpler alternative to the traditional STUN/ICE/TURN approach for P2P NAT traversal. While new QUIC frames like `ADD_ADDRESS` and `PUNCH_ME_NOW` raise security concerns about spoofing, these can be mitigated with appropriate defenses.\n",
    "chinese_title": "QUIC的P2P愿景 (2024)",
    "chinese_summary": "QUIC的P2P愿景：利用QUIC简化P2P网络中的NAT穿透\n\n本文《QUIC的P2P愿景》探讨了如何利用QUIC简化并改进点对点（P2P）网络中的NAT穿透，而传统上这由STUN、ICE和TURN等复杂协议处理。作者建议利用QUIC的连接迁移和地址发现机制来替代这些较旧的方法。\n\n传统方法包括：\n*   **STUN：** 发现NAT后的公共IP地址。\n*   **ICE：** 协调打洞，即对等方同时发送数据包以“穿透”其NAT。\n*   **TURN：** 当直接连接失败时，通过第三方服务器中继流量。\n\n基于QUIC的方法提供了一种更集成的解决方案：\n*   **QUIC地址发现：** 通过使用新的`OBSERVED_ADDRESS`帧在QUIC连接中交换观察到的地址来替换STUN。\n*   **通过连接迁移进行打洞：** 利用QUIC的连接迁移机制（专为无缝网络切换而设计）发送探测数据包（`PATH_CHALLENGE`和`PATH_RESPONSE`）进行打洞。需要一个新的`PUNCH_ME_NOW`帧进行协调。\n*   **使用HTTP代理进行中继：** 当直接连接不可能时，使用基于QUIC的HTTP代理来中继UDP数据包。这利用了`HTTP Datagrams`，它们是QUIC `DATAGRAM`帧的薄包装。\n\n作者认为，QUIC的加密、集成的地址发现和现有的连接迁移功能为P2P NAT穿透提供了一种比传统STUN/ICE/TURN方法更安全、高效且可能更简单的替代方案。 虽然像`ADD_ADDRESS`和`PUNCH_ME_NOW`这样的新QUIC帧会引发有关欺骗的安全问题，但可以通过适当的防御措施来缓解这些问题。"
  },
  {
    "id": "45816853",
    "title": "Mr TIFF",
    "url": "https://inventingthefuture.ghost.io/mr-tiff/",
    "summary": "John Buck, author of \"Inventing the Future,\" recounts his persistent quest to identify the individual behind the Tag Image File Format (TIFF). Buck's mission is to credit the actual inventors of the hardware and software we use, rather than attributing achievements solely to companies. While researching the AIFF audio standard, Steve Milne and Mark Lentczner led him to TIFF as its predecessor.\n\nDespite TIFF's widespread use and importance, Buck found no readily available information about its creator, only the company Aldus. After painstaking research, including sifting through old MacWeek issues and Computer History Museum transcripts, Buck finally discovered the name Stephen Carlsen, albeit misspelled, in the Aldus TIFF specification document.\n\nThrough patent searches and old-fashioned detective work, including mailing a physical letter, Buck located Stephen Carlsen. Carlsen confirmed his role in creating TIFF, explaining the need for a standard image format for desktop publishing. He downplayed his contribution, emphasizing the collaborative effort to promote TIFF as an industry standard.\n\nTwo years after interviewing Carlsen, Buck received an email from Carlsen's ex-wife, Peggy, informing him of Carlsen's passing and her endearing nickname for him, \"Mr TIFF.\" The email highlighted Carlsen's humility and the importance of recognizing his contributions. Motivated by Peggy's message, Buck immediately updated the Wikipedia page for TIFF, crediting Stephen Carlsen as the creator, rectifying the historical record. Buck concludes that his extensive research efforts are worthwhile to ensure proper credit is given to the true inventors, regardless of their personal desire for recognition.\n",
    "chinese_title": "蒂夫先生",
    "chinese_summary": "约翰·巴克，《发明未来》的作者，讲述了他锲而不舍地探寻标签图像文件格式（TIFF）幕后真人的故事。巴克的使命是褒奖实际发明软硬件的个人，而非仅将成就归功于公司。在研究AIFF音频标准时，史蒂夫·米尔恩和马克·伦茨纳引导他发现了作为其前身的TIFF。\n\n尽管TIFF应用广泛且重要，巴克并未找到任何关于其创建者的现成信息，只有公司Aldus。经过艰苦的研究，包括翻阅旧的MacWeek杂志和计算机历史博物馆的记录稿，巴克终于在Aldus TIFF规范文档中发现了斯蒂芬·卡尔森的名字，尽管拼写有误。\n\n通过专利搜索和传统的侦探工作，包括邮寄实体信件，巴克找到了斯蒂芬·卡尔森。卡尔森证实了他在创建TIFF中的作用，解释了桌面出版对标准图像格式的需求。他淡化了自己的贡献，强调了推广TIFF作为行业标准的协作努力。\n\n采访卡尔森两年后，巴克收到了卡尔森的前妻佩吉的电子邮件，告知他卡尔森的去世以及她对他亲切的昵称“TIFF先生”。这封电子邮件突显了卡尔森的谦逊以及认可他的贡献的重要性。受佩吉信息的激励，巴克立即更新了TIFF的维基百科页面，将斯蒂芬·卡尔森列为创建者，纠正了历史记录。巴克总结说，他广泛的研究工作是值得的，以确保将适当的荣誉授予真正的发明者，无论他们个人是否渴望获得认可。"
  },
  {
    "id": "45823186",
    "title": "Carice TC2 – A non-digital electric car",
    "url": "https://www.caricecars.com/",
    "summary": "The Carice TC2 is an all-electric retro-styled car designed and built in the Netherlands, aiming to combine classic aesthetics with modern technology. It's marketed as a lightweight, dynamic, and elegant vehicle designed for a pure and enjoyable driving experience.\n\nKey features include its fully electric powertrain with zero emissions, a weight starting at 590 kg for dynamic handling and low power consumption, and an emphasis on simplicity and essential driving elements. The TC2 prioritizes driver and passenger enjoyment, offering a piece of art beyond just transportation.\n\nIt boasts a range of up to 300km depending on the battery pack, and charging takes as little as 2.7 hours to 80%.  The TC2 complies with EU regulations, allowing it to be driven in EU countries and those adopting those regulations.\n\nThe car can be personalized with a wide range of color options for paint, upholstery, and the rooftop. Production is currently on-demand, with prices starting at €44,500 excluding taxes.  Interested buyers can order a TC2 and reserve a spot in the next production run.\n",
    "chinese_title": "Carice TC2 – 非数字电动汽车",
    "chinese_summary": "Carice TC2 是一款在荷兰设计和制造的全电动复古风格汽车，旨在将经典美学与现代技术相结合。 它以轻量化、动感和优雅著称，专为纯粹而愉悦的驾驶体验而设计。\n\n主要特点包括零排放的全电动动力系统、590公斤起的车身重量以实现动态操控和低功耗，以及对简洁性和基本驾驶要素的强调。 TC2优先考虑驾驶者和乘客的享受，提供的不仅仅是一种交通工具，更是一件艺术品。\n\n根据电池组的不同，其续航里程可达 300 公里，充电至 80% 最快只需 2.7 小时。 TC2 符合欧盟法规，可在欧盟国家和采用这些法规的国家/地区行驶。\n\n该车可根据个人喜好定制油漆、内饰和车顶颜色。 目前按需生产，起价为 44,500 欧元（不含税）。 感兴趣的买家可以订购 TC2，并预订下一个生产批次的席位。"
  },
  {
    "id": "45822302",
    "title": "iOS 26.2 to allow third-party app stores in Japan ahead of regulatory deadline",
    "url": "https://www.macrumors.com/2025/11/05/ios-26-2-third-party-app-stores-japan/",
    "summary": "Apple's iOS 26.2, currently in beta, will allow users in Japan to install third-party app stores ahead of a regulatory deadline. This move follows the Japanese parliament's approval in June 2024 of legislation mandating Apple to permit alternative app stores and payment providers on iPhones. The Japan Fair Trade Commission further solidified this requirement in August 2025 with the Mobile Software Competition Act Guidelines, prohibiting platform operators like Apple from blocking alternative app stores and payment systems.\n\nThe change brings Japan in line with the EU, where Apple already allows third-party app stores due to the Digital Markets Act. According to a post on X, the iOS 26.2 beta allows Japanese users to install app stores like AltStore PAL and Epic Games Store. While Fortnite is available, in-app purchases are currently region-blocked by Epic.\n\nThe Mobile Software Competition Act Guidelines are set to take effect by December 18, 2025, and Apple is expected to release iOS 26.2 sometime between December 9 and December 16. Epic Games has plans to bring Fortnite and its game store platform to iOS in Japan by late 2025.\n",
    "chinese_title": "iOS 26.2 将在日本监管截止日期前允许第三方应用商店",
    "chinese_summary": "苹果iOS 26.2目前处于测试阶段，将允许日本用户在监管截止日期前安装第三方应用商店。此前，日本国会于2024年6月批准立法，强制苹果允许iPhone上存在替代应用商店和支付提供商。日本公平贸易委员会在2025年8月发布的《移动软件竞争法指南》中进一步巩固了这一要求，禁止像苹果这样的平台运营商阻止替代应用商店和支付系统。\n\n这一变化使日本与欧盟保持一致，欧盟由于《数字市场法案》已允许苹果开设第三方应用商店。根据X上的一篇帖子，iOS 26.2测试版允许日本用户安装AltStore PAL和Epic Games Store等应用商店。虽然《堡垒之夜》可用，但Epic目前对应用内购买进行了区域封锁。\n\n《移动软件竞争法指南》预计将于2025年12月18日生效，苹果预计将在12月9日至12月16日之间的某个时候发布iOS 26.2。Epic Games计划在2025年末将《堡垒之夜》及其游戏商店平台带到日本的iOS系统上。"
  },
  {
    "id": "45823059",
    "title": "Removing XSLT for a more secure browser",
    "url": "https://developer.chrome.com/docs/web-platform/deprecating-xslt",
    "summary": "This article discusses Chrome's plan to remove XSLT (Extensible Stylesheet Language Transformations) support from the browser by late 2026 due to security risks and declining usage. XSLT is a language for transforming XML documents, often into HTML, but the underlying libraries used for processing (like libxslt) have proven vulnerable to security exploits.\n\nThe main points include:\n\n*   **Removal Timeline:** XSLT support will be fully removed by Chrome 164 in August 2027, following a deprecation period with warnings and testing phases.\n*   **Security Concerns:** The complex C/C++ codebases of XSLT processors are prone to memory safety vulnerabilities.\n*   **Alternatives:**  Modern JavaScript APIs (Fetch API, DOMParser) and frameworks (React, Vue, Svelte) offer more secure and robust alternatives for data transformation and rendering.\n*   **Migration Strategies:** The article suggests migrating XSLT processing to the server-side, switching to JSON-based APIs and client-side rendering with JavaScript, or using a JavaScript-based XSLT library (Saxonica) or a polyfill to maintain functionality.\n*   **Specific Use Cases:**  The article addresses use cases like RSS/Atom feeds, embedded device API outputs, and client-side templating, offering specific migration recommendations for each.  A Chrome extension is also mentioned as a potential solution for legacy applications where the source XML or XSLT cannot be modified.\n\nThe overall goal is to improve browser security, simplify the web platform, and focus resources on technologies that actively support the modern web.\n",
    "chinese_title": "为了更安全的浏览器，移除 XSLT",
    "chinese_summary": "Chrome计划于2026年末移除XSLT支持：安全风险与替代方案\n\n主要内容包括：\n\n*   **移除时间表：** XSLT支持将于2027年8月的Chrome 164版本中完全移除，此前将经历一个包含警告和测试阶段的弃用期。\n*   **安全问题：** XSLT处理器的复杂C/C++代码库容易出现内存安全漏洞。\n*   **替代方案：** 现代JavaScript API（Fetch API、DOMParser）和框架（React、Vue、Svelte）为数据转换和渲染提供了更安全、更强大的替代方案。\n*   **迁移策略：** 文章建议将XSLT处理迁移到服务器端，切换到基于JSON的API和客户端JavaScript渲染，或使用基于JavaScript的XSLT库（Saxonica）或polyfill来维持功能。\n*   **特定用例：** 文章讨论了诸如RSS/Atom订阅、嵌入式设备API输出和客户端模板等用例，并为每个用例提供了具体的迁移建议。 还提到了Chrome扩展程序，作为无法修改源XML或XSLT的遗留应用程序的潜在解决方案。\n\n总体目标是提高浏览器安全性，简化Web平台，并将资源集中于积极支持现代Web的技术。"
  },
  {
    "id": "45761594",
    "title": "SPy: An interpreter and compiler for a fast statically typed variant of Python",
    "url": "https://antocuni.eu/2025/10/29/inside-spy-part-1-motivations-and-goals/",
    "summary": "This article introduces SPy, a new interpreter and compiler for a statically typed variant of Python focused on performance. SPy is not a 100% compatible \"compiler for Python\" because it deliberately excludes certain dynamic Python features. Instead, it aims for tight integration with the existing Python ecosystem, allowing import of Python libraries and SPy modules.\n\nThe author contrasts SPy with two common approaches to improving Python's speed: \"full Python\" JIT compilers (like PyPy) that struggle with consistent performance and memory usage, and \"subset/variant\" compilers (like Cython) that sacrifice Pythonic patterns for speed. SPy aims to bridge this gap by removing dynamic features that hinder optimization while introducing new features to maintain Pythonic expressiveness.\n\nThe author details the inherent performance limitations of Python, particularly its dynamic nature (e.g., runtime module resolution, mutable classes) and cache-unfriendly memory layout due to pervasive pointer chasing. They observe that developers often adhere to an informal \"RealPython\" subset for readability and JIT compatibility, but the interpreter cannot exploit these constraints. Static typing efforts improve the situation, but Python's design isn't ideally suited to it.\n\nSPy's design principles prioritize ease of use, static typing, performance comparable to C/Rust, predictable performance, rich metaprogramming, zero-cost abstractions, and opt-in dynamism via a dynamic type. Ultimately, SPy strives to provide both low-level control and high-level expressivity within a single language.\n",
    "chinese_title": "SPy：快速静态类型Python变体的解释器和编译器",
    "chinese_summary": "本文介绍 SPy，这是一种新的解释器和编译器，它针对Python的静态类型变体，专注于性能。 SPy不是100%兼容的“Python编译器”，因为它有意排除了一些动态Python特性。相反，它旨在与现有的Python生态系统紧密集成，允许导入Python库和SPy模块。\n\n作者将 SPy 与两种常见的提高 Python 速度的方法进行了对比：一是“完整 Python”JIT 编译器（如 PyPy），它们在一致的性能和内存使用方面存在困难；二是“子集/变体”编译器（如 Cython），它们牺牲了 Pythonic 模式来换取速度。SPy 旨在弥合这一差距，通过移除阻碍优化的动态特性，同时引入新特性以保持 Pythonic 的表达能力。\n\n作者详细介绍了 Python 固有的性能限制，特别是其动态特性（例如，运行时模块解析、可变类）以及由于普遍存在的指针追踪而导致的缓存不友好的内存布局。他们观察到，开发者通常为了可读性和 JIT 兼容性而遵守一种非正式的“RealPython”子集，但解释器无法利用这些约束。静态类型化的努力改善了这种情况，但 Python 的设计并不完全适合它。\n\nSPy 的设计原则优先考虑易用性、静态类型、与 C/Rust 相当的性能、可预测的性能、丰富的元编程、零成本抽象以及通过动态类型选择性地启用动态性。最终，SPy 致力于在单一语言中提供低级控制和高级表达能力。"
  },
  {
    "id": "45822071",
    "title": "The grim truth behind the Pied Piper (2020)",
    "url": "https://www.bbc.com/travel/article/20200902-the-grim-truth-behind-the-pied-piper",
    "summary": "This article explores the historical basis and enduring mystery behind the Pied Piper legend. While the story, popularized by the Grimm Brothers and Robert Browning, depicts a piper luring away children after being denied payment for ridding Hamelin of rats, evidence suggests a real incident inspired it.\n\nHamelin's town records, inscriptions, and historical accounts point to the disappearance of 130 children on June 26, 1284, led away by a piper in colorful clothes. This event is treated as a profound historical mystery, inspiring many theories.\n\nOne prominent theory suggests the \"Pied Piper\" was a recruiter leading young people eastward during a German migration to Eastern Europe. Another theory links the disappearance to outbreaks of \"dancing mania,\" a form of mass hysteria. More macabre theories suggest massacre during pagan midsummer festivities or being spirited away to monasteries.\n\nDespite the grim possibilities, the Pied Piper legend has become a cultural touchstone, known in numerous countries and languages and inspiring art, literature, and music. This shared heritage, in a way, unites people across cultures, transcending the original tragedy. Hamelin continues to capitalize on the legend, with restaurants and shops offering rat-themed food and souvenirs, while the Hamelin Museum explores the tale's global reach.\n",
    "chinese_title": "吹笛人背后的残酷真相 (2020)",
    "chinese_summary": "花衣魔笛手传说的历史渊源与不解之谜\n\n本文探讨了花衣魔笛手传说背后的历史基础和历久弥新的谜团。这个故事经格林兄弟和罗伯特·勃朗宁的普及，讲述了一个魔笛手因未收到清除哈默尔恩鼠患的报酬而引诱孩子们离开的故事，但有证据表明，一个真实事件启发了这个故事。\n\n哈默尔恩的城镇记录、铭文和历史记载表明，1284年6月26日，有130名儿童被一位身穿彩衣的魔笛手带领消失。这一事件被视为一个深刻的历史谜团，激发了许多理论。\n\n一种突出的理论认为，“花衣魔笛手”是一位招募人员，在德国向东欧移民期间带领年轻人向东前进。另一种理论将失踪事件与“舞蹈狂热症”的爆发联系起来，这是一种集体癔症。更恐怖的理论则暗示异教仲夏节期间的大屠杀，或者被秘密带到修道院。\n\n尽管存在种种可怕的可能性，花衣魔笛手传说已成为一种文化试金石，在众多国家和语言中广为人知，并激发了艺术、文学和音乐创作。在某种程度上，这种共同的遗产将不同文化背景的人们团结起来，超越了最初的悲剧。哈默尔恩继续利用这个传说，餐厅和商店提供以老鼠为主题的食物和纪念品，而哈默尔恩博物馆则探索这个故事的全球影响力。"
  },
  {
    "id": "45822559",
    "title": "Radiant Computer",
    "url": "https://radiant.computer",
    "summary": "生成摘要时出错",
    "chinese_title": "Radiant Computer",
    "chinese_summary": "生成摘要出错"
  },
  {
    "id": "45816963",
    "title": "UPS plane crashes near Louisville airport",
    "url": "https://avherald.com/h?article=52f5748f&opt=0",
    "summary": "生成摘要时出错",
    "chinese_title": "UPS飞机在路易斯维尔机场附近坠毁",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45822902",
    "title": "Microsoft Can't Keep EU Data Safe from US Authorities",
    "url": "https://www.forbes.com/sites/emmawoollacott/2025/07/22/microsoft-cant-keep-eu-data-safe-from-us-authorities/",
    "summary": "This Forbes article reports that Microsoft has admitted it cannot guarantee EU data will be protected from U.S. authorities, due to laws like the U.S. Cloud Act. Anton Carniaux, a Microsoft France executive, stated this during testimony before a French Senate inquiry focused on digital sovereignty and public procurement.\n\nThe admission raises concerns about European data sovereignty, with experts pointing out that the location of data storage (even within the EU) is irrelevant when U.S. jurisdiction applies to the provider. This impacts national security, privacy, and business competitiveness.\n\nThe inquiry specifically questioned the separation of data on Project Bleu, a Microsoft partnership, from the Health Data Hub medical research platform hosted on Azure, fearing that sensitive health data could be accessed by US authorities.\n\nThe article highlights the EU's reliance on U.S. cloud providers, despite calls for more homegrown solutions. While a recent report shows that US firms possess a significant portion of Europe's cloud infrastructure market share, it urges the EU and UK to follow France's lead in demanding answers and fostering true data sovereignty.\n",
    "chinese_title": "微软无法保护欧盟数据免受美国当局侵害",
    "chinese_summary": "This Forbes article reports that Microsoft has admitted it cannot guarantee EU data will be protected from U.S. authorities, due to laws like the U.S. Cloud Act. Anton Carniaux, a Microsoft France executive, stated this during testimony before a French Senate inquiry focused on digital sovereignty and public procurement.\n\nThe admission raises concerns about European data sovereignty, with experts pointing out that the location of data storage (even within the EU) is irrelevant when U.S. jurisdiction applies to the provider. This impacts national security, privacy, and business competitiveness.\n\nThe inquiry specifically questioned the separation of data on Project Bleu, a Microsoft partnership, from the Health Data Hub medical research platform hosted on Azure, fearing that sensitive health data could be accessed by US authorities.\n\nThe article highlights the EU's reliance on U.S. cloud providers, despite calls for more homegrown solutions. While a recent report shows that US firms possess a significant portion of Europe's cloud infrastructure market share, it urges the EU and UK to follow France's lead in demanding answers and fostering true data sovereignty.\n"
  },
  {
    "id": "45759839",
    "title": "RISC-V takes first step toward international ISO/IEC standardization",
    "url": "https://riscv.org/blog/risc-v-jtc1-pas-submitter/",
    "summary": "Andrea Gallo, CEO of RISC-V International, announces that RISC-V has been approved as a recognized PAS Submitter by the ISO/IEC Joint Technical Committee (JTC 1). This allows RISC-V International to submit draft international papers, beginning with the RISC-V Instruction Set Manual, for consideration as ISO/IEC standards.\n\nThis is a significant step for RISC-V, as ISO/IEC standardization brings increased credibility and wider acceptance, acting as a \"tailwind\" for market access. International standards ensure interoperability between different products, reduce integration costs, and inspire greater confidence due to their consensus-driven development.\n\nRISC-V's open and collaborative nature already aligned well with JTC 1's requirements, including openness in membership, transparent technical committees, and regulatory compliance. The process has strengthened RISC-V International organizationally and broadened its collaborative network, allowing engagement with other PAS submitters and JTC 1 working groups.\n\nGallo emphasizes the stability of the RISC-V ISA over the past nine years and highlights that it's the first ISA to pursue international standard status. This standardization provides a clear distinction between the approved ISA and non-compliant derivatives. RISC-V International plans to continue collaborating with JTC 1 to bring future extensions into the ISO/IEC process, reinforcing RISC-V's position as a foundation for open computing. The article concludes with a call to action to join the RISC-V community.\n",
    "chinese_title": "RISC-V迈出国际ISO/IEC标准化第一步",
    "chinese_summary": "RISC-V获得ISO/IEC认可，可提交国际标准草案"
  },
  {
    "id": "45824658",
    "title": "Norway reviews cybersecurity after remote-access feature found in Chinese buses",
    "url": "https://scandasia.com/norway-reviews-cybersecurity-after-hidden-remote-access-feature-found-in-chinese-buses/",
    "summary": "Norway has launched a cybersecurity review after Ruter, a public transport operator, discovered hidden Romanian SIM cards in Chinese-made Yutong electric buses, enabling potential remote access. These SIM cards theoretically allow Yutong to shut down the vehicles or interfere through software updates. While Ruter CEO Bernt Reitan Jenssen believes misuse is unlikely, the discovery raises concerns about cybersecurity risks associated with foreign technology suppliers.\n\nRuter has removed the SIM cards and is strengthening its cybersecurity measures, including procurement rules, firewalls, and cloud security, to maintain local control. Norway's Minister of Transport, Jon-Ivar Nygård, stated the government is assessing supplier risks from countries outside Norway's security alliances to protect critical infrastructure.\n\nAround 850 of Norway's 1,300 electric buses are from Yutong, with 300 operating in the Oslo and Akershus regions. The incident highlights broader cybersecurity challenges as Chinese electric buses are increasingly adopted globally, raising questions about digital security and strategic dependencies in public transport systems. The article includes a related post about Yutong delivering e-buses to Denmark, further underscoring the company's growing global presence.\n",
    "chinese_title": "挪威审查网络安全，因中国巴士发现远程访问功能。",
    "chinese_summary": "挪威在公共交通运营商Ruter于中国宇通电动巴士中发现隐藏的罗马尼亚SIM卡（可能允许远程访问）后，启动了一项网络安全审查。这些SIM卡理论上允许宇通关闭车辆或通过软件更新进行干预。虽然Ruter首席执行官Bernt Reitan Jenssen认为滥用不太可能，但这一发现引发了人们对外国技术供应商带来的网络安全风险的担忧。\n\nRuter已移除这些SIM卡，并正在加强其网络安全措施，包括采购规则、防火墙和云安全，以维持本地控制。挪威交通部长Jon-Ivar Nygård表示，政府正在评估来自挪威安全联盟以外国家的供应商风险，以保护关键基础设施。\n\n挪威1300辆电动巴士中约有850辆来自宇通，其中300辆在奥斯陆和阿克斯胡斯地区运营。该事件凸显了更广泛的网络安全挑战，因为中国的电动巴士在全球范围内日益普及，引发了人们对公共交通系统中数字安全和战略依赖性的质疑。文章包含一篇关于宇通向丹麦交付电动巴士的相关文章，进一步强调了该公司日益增长的全球影响力。"
  },
  {
    "id": "45818562",
    "title": "Hypothesis: Property-Based Testing for Python",
    "url": "https://hypothesis.readthedocs.io/en/latest/",
    "summary": "Hypothesis is a Python library for property-based testing. Instead of writing specific test cases, users define properties that should hold true for a range of inputs. Hypothesis then automatically generates random inputs within that range, including edge cases, to test the code. This approach helps uncover unexpected bugs and ensures code robustness.\n\nThe example given shows a test for a sorting function, where Hypothesis generates various lists of integers and floats to verify if `my_sort` produces the same result as the standard `sorted` function.\n\nThe documentation is structured to guide users from beginner to advanced levels. It includes a tutorial for newcomers, a quickstart for a faster introduction, how-to guides for practical applications, explanations for deeper understanding, and a comprehensive API reference. Essentially, it provides everything needed to learn how to use and effectively implement property-based testing using Hypothesis in Python.\n",
    "chinese_title": "假设：Python 的基于属性的测试",
    "chinese_summary": "Hypothesis是一个用于基于属性测试的Python库。用户无需编写特定的测试用例，而是定义应该对一系列输入都成立的属性。然后，Hypothesis会自动生成该范围内的随机输入，包括边缘情况，以测试代码。这种方法有助于发现意想不到的错误并确保代码的健壮性。\n\n给出的例子展示了一个排序函数的测试，其中Hypothesis生成各种整数和浮点数列表，以验证`my_sort`是否产生与标准`sorted`函数相同的结果。\n\n该文档的结构旨在引导用户从初学者到高级水平。它包括一个针对新手的教程，一个用于更快入门的快速入门指南，用于实际应用的实践指南，用于更深入理解的解释，以及一个全面的API参考。 基本上，它提供了学习如何使用Python中的Hypothesis并有效实施基于属性的测试所需的一切。"
  },
  {
    "id": "45697414",
    "title": "Parsing Chemistry",
    "url": "https://re.factorcode.org/2025/10/parsing-chemistry.html",
    "summary": "This article explores building a chemical formula parser in Factor, inspired by the Python `chemparse` project. The goal is to create functionality that parses chemical formulas into dictionaries mapping elements to their counts, supporting features like fractional stoichiometry, groups, nested groups, and bracketed formulas.\n\nThe author utilizes Factor's EBNF syntax support to define a parsing expression grammar. This grammar breaks down the parsing process into smaller steps: parsing symbols (one or two letters), numbers (integers or floats), and pairs (a symbol with optional number prefixes and postfixes, potentially within parentheses or brackets).\n\nThe initial EBNF definition, `split-formula`, successfully parses formulas into nested vectors, but requires further processing to achieve the desired element-to-count mapping. The article introduces the `flatten-formula` word to recursively flatten the nested structure into an associative array (assoc). This word combines element symbols with their counts and recursively processes grouped formulas.\n\nFinally, the `parse-formula` word combines `split-formula` and `flatten-formula` to provide a complete parsing solution. Several unit tests demonstrate the functionality of the parser, confirming its ability to handle simple formulas, fractional stoichiometry, grouped formulas (nested and bracketed), and accurately map each element to its correct count. The code is available on the author's GitHub.\n",
    "chinese_title": "解析化学",
    "chinese_summary": "本文探讨了在Factor中构建化学式解析器的方法，灵感来源于Python的`chemparse`项目。目标是创建能够将化学式解析为元素与其计数映射的字典的功能，支持诸如分数化学计量、基团、嵌套基团和括号式等特性。\n\n作者利用Factor的EBNF语法支持来定义解析表达式语法。该语法将解析过程分解为更小的步骤：解析符号（一个或两个字母）、数字（整数或浮点数）和对（带有可选数字前缀和后缀的符号，可能位于括号内）。\n\n最初的EBNF定义`split-formula`成功地将公式解析为嵌套向量，但需要进一步处理才能实现所需的元素到计数的映射。本文介绍了`flatten-formula`这个词，以递归方式将嵌套结构扁平化为关联数组（assoc）。该词将元素符号与其计数结合起来，并递归地处理分组公式。\n\n最后，`parse-formula`这个词结合了`split-formula`和`flatten-formula`，提供了一个完整的解析解决方案。一些单元测试演示了解析器的功能，确认其能够处理简单的公式、分数化学计量、分组公式（嵌套的和括号式的），并准确地将每个元素映射到其正确的计数。代码可在作者的GitHub上找到。"
  },
  {
    "id": "45733204",
    "title": "Asus Announces October Availability of ProArt Display 8K PA32KCX",
    "url": "https://press.asus.com/news/press-releases/asus-proart-display-8k-pa32kcx-availability/",
    "summary": "ASUS has announced the October 2025 availability of the ProArt Display 8K PA32KCX, the world's first 8K HDR mini LED professional monitor. This monitor boasts a 32-inch 8K HDR panel with 4032-zone local dimming, 1200 nits peak brightness, and 1000 nits sustained brightness, making it ideal for content creators who require high levels of detail and color accuracy.\n\nKey features include 95% Adobe RGB, 97% DCI-P3 color gamut coverage, true 10-bit color depth, and factory pre-calibration to Delta E < 1 color accuracy. It also supports Dolby Vision, HDR10, and HLG formats. A built-in motorized colorimeter enables self- and auto-calibration, and the monitor is compatible with ProArt Calibration software, Calman, and Light Illusion ColourSpace CMS.\n\nThe PA32KCX offers convenient connectivity with two Thunderbolt 4 ports, DisplayPort 2.1, and two HDMI 2.1 ports. A built-in Auto KVM switch allows seamless switching between two computers. Additionally, buyers in select regions will receive a free three-month subscription to Adobe Creative Cloud.\n\nThe monitor features an ambient light sensor, proximity sensor, and an ergonomic stand with tilt, swivel, pivot, and height adjustments. A wraparound hood is included to minimize reflections. The monitor utilizes mini LED technology to reduce visual artifacts and flickering while providing high sustained brightness.\n",
    "chinese_title": "华硕宣布ProArt Display 8K PA32KCX将于十月上市",
    "chinese_summary": "华硕宣布ProArt Display 8K PA32KCX专业显示器将于2025年10月上市，这是全球首款8K HDR mini LED专业显示器。这款显示器配备32英寸8K HDR面板，具有4032区局部调光、1200尼特峰值亮度和1000尼特持续亮度，非常适合需要高细节和色彩准确度的内容创作者。\n\n主要功能包括95% Adobe RGB、97% DCI-P3色域覆盖、真正的10位色彩深度，以及出厂预校准至Delta E < 1的色彩准确度。它还支持杜比视界、HDR10和HLG格式。内置的电动色度计可实现自校准和自动校准，并且该显示器与ProArt校准软件、Calman和Light Illusion ColourSpace CMS兼容。\n\nPA32KCX提供便捷的连接性，具有两个雷雳4端口、DisplayPort 2.1和两个HDMI 2.1端口。内置的自动KVM切换器可在两台计算机之间无缝切换。此外，特定地区的购买者将获得免费的三个月Adobe Creative Cloud订阅。\n\n该显示器具有环境光传感器、接近传感器和符合人体工程学的支架，可进行倾斜、旋转、枢轴和高度调节。随附环绕式遮光罩，以最大限度地减少反射。该显示器采用mini LED技术，可减少视觉伪影和闪烁，同时提供高持续亮度。"
  },
  {
    "id": "45718002",
    "title": "Stack walking: space and time trade-offs",
    "url": "https://maskray.me/blog/2025-10-26-stack-walking-space-and-time-trade-offs",
    "summary": "This article analyzes the space overhead trade-offs of different stack walking mechanisms on x86-64 Linux, focusing on frame pointers (FP), DWARF .eh_frame, and SFrame.\n\nThe author finds that enabling frame pointers, despite reserving a register, can paradoxically reduce binary size in scenarios with frequent stack object accesses. This is because RBP-relative addressing can produce more compact machine code than RSP-relative addressing. The impact varies significantly between programs and compiler implementations.\n\nSFrame, a newer profiling-focused format, is compared to .eh_frame. Analysis shows that SFrame metadata is approximately 10% larger than the combined size of .eh_frame and .eh_frame_hdr. The author expresses skepticism about SFrame's viability due to this size overhead and lack of clear advantages over existing methods. The author suggests compact unwind descriptors.\n\nA comparison of FP and SFrame approaches, using both Clang and GCC, reveals compiler-specific differences. Clang-built binaries show FP resulting in a smaller executable, whereas GCC-built binaries show the opposite trend, hinting at less optimized frame pointer code generation in GCC.\n\nThe article concludes that SFrame incurs a significant VM size increase.\nFinally, the author implores LLVM community for support for his technical objections to the SFrame RFC.\nRuntime performance analysis is planned for a future update.\n",
    "chinese_title": "栈回溯：空间与时间的权衡",
    "chinese_summary": "本文分析了x86-64 Linux上不同堆栈回溯机制的空间开销权衡，重点关注帧指针（FP）、DWARF .eh_frame和SFrame。\n\n作者发现，启用帧指针虽然会保留一个寄存器，但自相矛盾的是，在频繁访问堆栈对象的情况下，可以减少二进制文件的大小。这是因为相对于RSP相关的寻址方式，RBP相关的寻址方式可以产生更紧凑的机器码。这种影响在不同的程序和编译器实现之间差异很大。\n\nSFrame是一种较新的面向性能分析的格式，本文将其与.eh_frame进行比较。分析表明，SFrame元数据的大小比.eh_frame和.eh_frame_hdr的总和大约大10%。作者对SFrame的可行性表示怀疑，因为它具有这种大小开销，并且相对于现有方法缺乏明显的优势。作者建议使用紧凑的展开描述符。\n\n使用Clang和GCC对FP和SFrame方法进行比较，揭示了编译器特定的差异。Clang构建的二进制文件显示FP导致更小的可执行文件，而GCC构建的二进制文件显示相反的趋势，暗示GCC中帧指针代码生成优化程度较低。\n\n文章最后得出结论，SFrame会导致VM大小显著增加。\n\n最后，作者恳请LLVM社区支持他对SFrame RFC提出的技术异议。\n\n运行时性能分析计划在未来的更新中进行。"
  },
  {
    "id": "45817114",
    "title": "Bluetui – A TUI for managing Bluetooth on Linux",
    "url": "https://github.com/pythops/bluetui",
    "summary": "Bluetui is a terminal user interface (TUI) application for managing Bluetooth devices on Linux systems. It requires bluez to be installed and optionally nerdfonts for proper icon display. Installation methods include pre-built binaries from the release page, crates.io using `cargo install bluetui`, Arch Linux's extra repository (`pacman -S bluetui`), Gentoo's lamdness overlay, X-CMD (`x install bluetui`), or building from source using `git clone` and `cargo build`.\n\nThe TUI allows users to switch between sections, scroll, start/stop scanning, and quit the application using keyboard shortcuts. Specific actions like enabling/disabling pairing/discovery/power for adapters, unpairing/connecting/disconnecting/trusting/renaming paired devices, and pairing new devices are also controlled with keybindings.\n\nKeybindings are customizable via a `config.toml` file in `$HOME/.config/bluetui/` or a custom path specified with the `-c` flag. Configuration options include layout and window width. The application is licensed under GPLv3 and credits Marco Bulgarelli for the Bluetui logo.\n",
    "chinese_title": "Bluetui – Linux 蓝牙管理器",
    "chinese_summary": "Bluetui 是一个在 Linux 系统上管理蓝牙设备的终端用户界面（TUI）应用程序。它需要安装 bluez，并可选择安装 nerdfonts 以正确显示图标。 安装方法包括从发布页面获取预构建的二进制文件、使用 `cargo install bluetui` 从 crates.io 安装、Arch Linux 的 extra 仓库 (`pacman -S bluetui`)、Gentoo 的 lamdness overlay、X-CMD (`x install bluetui`)，或使用 `git clone` 和 `cargo build` 从源代码构建。\n\nTUI 允许用户使用键盘快捷键在不同部分之间切换、滚动、启动/停止扫描以及退出应用程序。 启用/禁用适配器的配对/发现/电源，取消配对/连接/断开/信任/重命名已配对的设备以及配对新设备等特定操作也通过快捷键控制。\n\n快捷键可以通过 `$HOME/.config/bluetui/` 中的 `config.toml` 文件或使用 `-c` 标志指定的自定义路径进行配置。 配置选项包括布局和窗口宽度。 该应用程序在 GPLv3 许可下发布，并感谢 Marco Bulgarelli 设计了 Bluetui 标志。"
  },
  {
    "id": "45761433",
    "title": "Apple’s Persona technology uses Gaussian splatting to create 3D facial scans",
    "url": "https://www.cnet.com/tech/computing/apple-talks-to-me-about-vision-pro-personas-where-is-our-virtual-presence-headed/",
    "summary": "This article explores Apple's \"Personas,\" a feature in the Vision Pro headset that creates realistic 3D avatars of users for real-time virtual interactions. The author highlights the technology's advanced capabilities compared to previous avatar systems, emphasizing its potential to revolutionize telepresence and collaboration.\n\nThe Personas are created using Gaussian splatting, a machine learning technique that knits together 2D images into a 3D model. This allows for detailed facial scans that capture nuances like expressions, jewelry, and even eyelashes. Apple emphasizes the technology focuses on creating authentic representations of individuals in real time, as opposed to generating deepfakes.\n\nThe author discusses the potential for Personas to extend beyond the Vision Pro, suggesting the technology could eventually be integrated into iPhones and other devices. While Apple acknowledges the appeal of this idea, they maintain that the Vision Pro's unique combination of sensors and display capabilities is currently essential for the optimal Persona experience.\n\nThe article concludes by emphasizing the transformative potential of Personas for various applications, including business collaboration and remote medical training, envisioning a future where the cost of entry to this technology is lower, allowing wider accessibility and adoption.\n",
    "chinese_title": "苹果的Persona技术使用高斯泼溅创建3D面部扫描",
    "chinese_summary": "本文探讨了苹果Vision Pro头显中的“人物角色”(Personas)功能，该功能可创建逼真的用户3D虚拟化身，用于实时虚拟互动。作者强调了该技术与以往的虚拟化身系统相比所具有的先进能力，并强调其在革新远程呈现和协作方面的潜力。\n\n这些“人物角色”是使用高斯溅射技术创建的，这是一种将2D图像编织成3D模型的机器学习技术。这使得能够进行详细的面部扫描，捕捉到诸如表情、珠宝甚至睫毛等细微之处。苹果强调该技术专注于创建真实的个人实时呈现，而不是生成深度伪造。\n\n作者讨论了“人物角色”超越Vision Pro的潜力，并暗示该技术最终可能会集成到iPhone和其他设备中。虽然苹果承认这一想法的吸引力，但他们坚持认为Vision Pro独特的传感器和显示功能组合对于获得最佳的人物角色体验至关重要。\n\n文章最后强调了“人物角色”在各种应用中的变革潜力，包括商业协作和远程医疗培训，并展望了该技术的入门成本降低，从而实现更广泛的可访问性和采用的未来。"
  },
  {
    "id": "45816673",
    "title": "Grayskull: A tiny computer vision library in C for embedded systems, etc.",
    "url": "https://github.com/zserge/grayskull",
    "summary": "Grayskull is a lightweight, dependency-free C library designed for computer vision tasks on resource-constrained devices like microcontrollers. It focuses on grayscale images and offers a range of algorithms for image processing and feature extraction within a small codebase (under 1KLOC).\n\nKey features include image operations like copying, cropping, resizing, and downsampling; filtering options such as blur, Sobel edge detection, and thresholding (global, Otsu, adaptive); morphological operations (erosion, dilation); geometry functionalities like connected components analysis and perspective warping; and feature detection using FAST/ORB keypoints. It also incorporates Local Binary Patterns (LBP) for object detection.\n\nThe library provides utilities for PGM image read/write and a single-header design for easy integration. It avoids dynamic memory allocation and C++ dependencies.\n\nThe API includes functions for manipulating `gs_image` structs (width, height, pixel data) and operations such as cropping, resizing, thresholding, blurring, edge detection, connected components analysis, feature extraction (FAST/ORB), and LBP cascade-based object detection. Optional helper functions for allocating and freeing image memory (`gs_alloc`, `gs_free`) and PGM I/O (`gs_read_pgm`, `gs_write_pgm`) are also provided.\n\nGrayskull is licensed under the MIT License, allowing for flexible usage in various projects. An online demo and example code are available for quick experimentation.\n",
    "chinese_title": "灰骷髅：一个用于嵌入式系统等的微型C语言计算机视觉库。",
    "chinese_summary": "Grayskull是一个轻量级、无依赖的C语言库，专为资源受限设备（如微控制器）上的计算机视觉任务而设计。它专注于灰度图像，并在小型代码库（小于1KLOC）内提供一系列用于图像处理和特征提取的算法。\n\n主要功能包括图像操作（如复制、裁剪、调整大小和降采样）；滤波选项（如模糊、Sobel边缘检测和阈值处理（全局、Otsu、自适应））；形态学操作（腐蚀、膨胀）；几何功能（如连通分量分析和透视变换）；以及使用FAST/ORB关键点的特征检测。它还集成了局部二值模式（LBP）用于目标检测。\n\n该库提供用于PGM图像读/写的实用程序，并采用单头文件设计，易于集成。它避免了动态内存分配和C++依赖。\n\nAPI包括用于操作`gs_image`结构（宽度、高度、像素数据）的函数，以及裁剪、调整大小、阈值处理、模糊、边缘检测、连通分量分析、特征提取（FAST/ORB）和基于LBP级联的目标检测等操作。还提供了用于分配和释放图像内存（`gs_alloc`，`gs_free`）以及PGM I/O（`gs_read_pgm`，`gs_write_pgm`）的可选辅助函数。\n\nGrayskull在MIT许可下授权，允许在各种项目中灵活使用。在线演示和示例代码可用于快速实验。"
  },
  {
    "id": "45788385",
    "title": "Intervaltree with Rust Back End",
    "url": "https://github.com/Athe-kunal/intervaltree_rs",
    "summary": "This article introduces `intervaltree_rs`, a Rust-backed interval tree implementation for Python, accessible through PyO3. It allows Python developers to leverage the performance of Rust for interval tree operations directly within their Python code.\n\nThe crate offers the ability to construct interval trees from lists of tuples representing intervals (left, right, payload), insert new intervals, search for overlapping intervals, and delete intervals based on their (left, right) boundaries.\n\nKey features include:\n\n*   **Performance:** Leverages the efficiency of Rust for interval tree operations.\n*   **Easy Integration:** Uses PyO3 to provide a seamless Python interface.\n*   **Core Functionality:** Supports building, inserting, searching, and deleting intervals.\n*   **Inclusive/Exclusive Search:** Offers a `search` function with an `inclusive` flag to control query behavior.\n\nTo use the library, users need a Rust toolchain, Python 3.8+, and `maturin` for building and installing the package. The article provides a quick start guide using a virtual environment and `maturin develop` for local development. It also explains how to build distributable wheels using `maturin build --release`.\n\nThe package is tested with Rust unit tests, ensuring its reliability. These tests can be run using `cargo test`. The article provides a comprehensive overview of `intervaltree_rs`, its functionalities, and how to set up and utilize it within a Python environment.\n",
    "chinese_title": "使用 Rust 后端的区间树",
    "chinese_summary": "本文介绍了`intervaltree_rs`，一个由Rust支持的Python区间树实现，通过PyO3访问。它允许Python开发者直接在他们的Python代码中利用Rust的性能进行区间树操作。\n\n该crate提供了从表示区间的元组列表（左边界，右边界，有效载荷）构建区间树、插入新区间、搜索重叠区间以及基于它们的（左边界，右边界）删除区间的能力。\n\n主要特性包括：\n\n*   **性能：** 利用Rust的高效性进行区间树操作。\n*   **易于集成：** 使用PyO3提供无缝的Python接口。\n*   **核心功能：** 支持构建、插入、搜索和删除区间。\n*   **包含/排除搜索：** 提供一个带有`inclusive`标志的`search`函数来控制查询行为。\n\n要使用该库，用户需要一个Rust工具链，Python 3.8+，以及用于构建和安装包的`maturin`。本文提供了一个使用虚拟环境和`maturin develop`进行本地开发的快速入门指南。它还解释了如何使用`maturin build --release`构建可分发的wheel包。\n\n该包通过Rust单元测试进行测试，确保其可靠性。这些测试可以使用`cargo test`运行。本文全面概述了`intervaltree_rs`、其功能，以及如何在Python环境中设置和使用它。"
  },
  {
    "id": "45788086",
    "title": "Moving tables across PostgreSQL instances",
    "url": "https://ananthakumaran.in/2025/11/02/moving-tables-across-postgres-instances.html",
    "summary": "This article details a method for moving specific tables between PostgreSQL instances using native logical replication, a more flexible alternative to Google's Database Migration Service (DMS), which migrates entire databases.\n\nThe process involves several key steps:\n\n1.  **Grant Replication Access:** Ensure user accounts on both source and destination instances have replication privileges.\n2.  **Copy Schema:** Use `pg_dump` to transfer table schemas. Create tables *without* constraints and indexes initially to speed up the initial data dump.\n3.  **Initial Dump & CDC:** Logical replication first performs an initial data dump, then switches to Change Data Capture (CDC) for real-time updates. Create the primary key during the schema copy.\n4.  **Publication & Subscription:** Create a publication on the source instance for the tables to be moved, and a corresponding subscription on the destination instance.\n5.  **Monitor Replication:** Track replication progress using PostgreSQL system tables like `pg_replication_slots` and `pg_stat_subscription`.\n6.  **Add Indexes & Foreign Keys:** After the replication switches to CDC mode, recreate indexes and foreign key constraints on the destination instance.\n7.  **Analyze & Vacuum:** Run `analyze` to update query statistics, ensuring efficient query planning. A `vacuum` can also be beneficial.\n8.  **Switchover:** Manually synchronize sequence values between instances. Then, disable writes to the source and switch to the destination. PgBouncer can facilitate near-zero downtime during this process by pausing connections, reloading the configuration to point to the new instance, and resuming connections.\n9.  **Cleanup:** Remove the publication and subscription after verifying the migration.\n\nThe article emphasizes the nuances of constraint handling, sequence synchronization, and the importance of proper monitoring and statistics updates for optimal performance after the migration.\n",
    "chinese_title": "在PostgreSQL实例间迁移表",
    "chinese_summary": "本文详细介绍了一种使用原生逻辑复制在PostgreSQL实例之间迁移特定表的方法，这是一种比谷歌数据库迁移服务（DMS）更灵活的替代方案，DMS迁移的是整个数据库。\n\n该过程涉及几个关键步骤：\n\n1.  **授予复制权限：** 确保源和目标实例上的用户帐户都具有复制权限。\n2.  **复制模式：** 使用`pg_dump`传输表模式。最初创建表时*不带*约束和索引，以加快初始数据转储速度。\n3.  **初始转储和CDC：** 逻辑复制首先执行初始数据转储，然后切换到变更数据捕获（CDC）以进行实时更新。在复制模式时创建主键。\n4.  **发布和订阅：** 在源实例上为要迁移的表创建发布，并在目标实例上创建相应的订阅。\n5.  **监控复制：** 使用PostgreSQL系统表（如`pg_replication_slots`和`pg_stat_subscription`）跟踪复制进度。\n6.  **添加索引和外键：** 在复制切换到CDC模式后，在目标实例上重建索引和外键约束。\n7.  **分析和清理：** 运行`analyze`以更新查询统计信息，确保高效的查询计划。`vacuum`也可能是有益的。\n8.  **切换：** 手动同步实例之间的序列值。然后，禁用对源的写入并切换到目标。PgBouncer可以通过暂停连接、重新加载配置以指向新实例以及恢复连接，来促进此过程中的近零停机时间。\n9.  **清理：** 验证迁移后，删除发布和订阅。\n\n本文强调了约束处理、序列同步的细微之处，以及适当监控和统计信息更新对于迁移后获得最佳性能的重要性。"
  },
  {
    "id": "45823358",
    "title": "Kosmos: An AI Scientist for Autonomous Discovery",
    "url": "https://arxiv.org/abs/2511.02824",
    "summary": "This arXiv article presents Kosmos, an AI scientist designed for autonomous scientific discovery. Kosmos automates the iterative cycles of data-driven research, including literature search, hypothesis generation, and data analysis. Unlike previous AI agents, Kosmos utilizes a structured world model to facilitate information sharing between a data analysis agent and a literature search agent, enabling coherent pursuit of objectives over extended periods (up to 12 hours and 200 agent rollouts).\n\nKosmos demonstrates its capabilities by performing an average of 42,000 lines of code execution and analyzing 1,500 papers per run. The system generates scientific reports with traceable reasoning, citing all claims with supporting code or literature. Independent scientists validated a high accuracy rate (79.4%) of the statements made in Kosmos' reports. Collaborators indicated that a single Kosmos run, limited to 20 cycles, can perform the equivalent of 6 months of research. The number of valuable findings also scales linearly with Kosmos cycles.\n\nThe paper highlights seven discoveries made by Kosmos across diverse fields like metabolomics, materials science, neuroscience, and statistical genetics. Notably, Kosmos independently reproduced findings from unpublished manuscripts and made novel contributions to the scientific literature. The article emphasizes Kosmos' potential to accelerate scientific discovery by automating and enhancing the research process.\n",
    "chinese_title": "科斯莫斯：用于自主发现的AI科学家",
    "chinese_summary": "此 arXiv 文章介绍了 Kosmos，一种专为自主科学发现而设计的人工智能科学家。 Kosmos 能够自动进行数据驱动研究的迭代循环，包括文献检索、假设生成和数据分析。 与以往的人工智能代理不同，Kosmos 利用结构化的世界模型来促进数据分析代理和文献检索代理之间的信息共享，从而能够在较长时间内（长达 12 小时和 200 次代理部署）连贯地追求目标。\n\nKosmos 通过平均每次运行执行 42,000 行代码并分析 1,500 篇论文来展示其能力。 该系统生成具有可追溯推理的科学报告，引用所有带有支持代码或文献的声明。 独立科学家验证了 Kosmos 报告中所述声明的高准确率（79.4%）。 合作者表示，单次 Kosmos 运行（仅限于 20 个周期）可以完成相当于 6 个月的研究工作。 有价值的发现数量也随着 Kosmos 周期的增加呈线性增长。\n\n该论文重点介绍了 Kosmos 在代谢组学、材料科学、神经科学和统计遗传学等不同领域取得的七项发现。 值得注意的是，Kosmos 独立地重现了来自未发表手稿的发现，并为科学文献做出了新的贡献。 该文章强调了 Kosmos 通过自动化和增强研究过程来加速科学发现的潜力。"
  },
  {
    "id": "45727173",
    "title": "Blue Prince (1989)",
    "url": "https://novalis.org/blog/2025-10-27-blue-prince-1989.html",
    "summary": "This article is a nostalgic review of the 1989 Apple //e game \"Blue Prince\" in light of its 2025 remake. The author, reflecting on their childhood love for the original, decided to revisit the updated version. However, they ultimately concluded that the original held more appeal.\n\nThe author highlights specific aspects of the 1989 game that they preferred. Chief among these is a unique, lateral-thinking puzzle requiring the player to physically invert the floppy disk. This ingenious solution, impossible to replicate in the remake, is considered a standout moment. They also appreciate the original's direct text-based descriptions, making the remake's inventory tracking feature less essential.\n\nFurthermore, the author criticizes the 2025 remake's use of 3D technology, arguing that it unnecessarily slows down the gameplay compared to the original's efficient text-based exploration. They preferred the responsive keyboard controls of the original, contrasting it with the perceived sluggishness of the modern version.\n\nIn conclusion, the author recommends that players who were turned off by the remake's slow pace should try the 1989 version, suggesting that the minimalist aesthetic and faster gameplay may offer a more enjoyable experience. They encourage readers to find a floppy disk image of the game and play it using an Apple emulator.\n",
    "chinese_title": "蓝王子 (1989)",
    "chinese_summary": "本文回顾性地评测了 1989 年 Apple //e 游戏《蓝王子》，并对比了 2025 年的重制版。作者回忆起童年对原作的热爱，决定重玩更新后的版本，但最终认为原作更具吸引力。\n\n作者强调了 1989 年游戏中他更喜欢的几个方面。其中最主要的是一个独特的、需要玩家物理反转软盘的横向思维谜题。这个巧妙的解决方案在重制版中无法复制，被认为是游戏的亮点。他还欣赏原作直接的文字描述，使得重制版的物品栏追踪功能显得不那么重要。\n\n此外，作者批评了 2025 年重制版对 3D 技术的运用，认为与原作高效的文字探索相比，这不必要地拖慢了游戏节奏。他更喜欢原作灵敏的键盘操作，并将其与现代版本的迟缓感形成对比。\n\n总而言之，作者建议那些因重制版节奏缓慢而失去兴趣的玩家尝试 1989 年的版本，并认为其极简主义的美学和更快的游戏节奏可能会带来更愉悦的体验。他鼓励读者找到游戏的软盘镜像，并使用 Apple 模拟器进行游戏。"
  },
  {
    "id": "45818471",
    "title": "The Microsoft SoftCard for the Apple II: Getting two processors to share memory",
    "url": "https://devblogs.microsoft.com/oldnewthing/20251104-00/?p=111758",
    "summary": "The Microsoft SoftCard allowed Apple II computers to run CP/M software by adding a Zilog Z80 processor. Since the Apple II already had a 6502 processor, the article explains how these two processors were able to coexist and share memory.\n\nThe SoftCard utilized the 6502 for I/O and other tasks it was suited for while running CP/M programs on the Z80. To avoid crashing the 6502, the SoftCard used the Z80's REFRESH line to allow the 6502 to execute brief spin loops and refresh its registers, preventing data loss. When the Z80 needed the 6502 to perform a task, it updated memory to signal the 6502 to execute specific code and return the results.\n\nMemory mapping was a critical issue. The 6502 and Z80 both wanted to use the first 256 bytes of memory for different purposes, and CP/M expected to load programs at a specific address already used by the 6502. To solve this, the SoftCard included address translation circuitry, remapping the Z80's memory space. The Apple II's special reserved addresses were moved to the end of the Z80 memory map, and the Apple II's normal RAM was made contiguous in the Z80's memory map, starting at address $0000. The SoftCard manual provided detailed instructions for programmers, including how to call 6502 subroutines from the Z80 and a memory remapping chart.\n",
    "chinese_title": "Apple II 的 Microsoft SoftCard：让两个处理器共享内存",
    "chinese_summary": "微软的SoftCard通过增加Zilog Z80处理器，使Apple II计算机能够运行CP/M软件。由于Apple II已经拥有6502处理器，本文解释了这两个处理器如何共存并共享内存。\n\nSoftCard利用6502进行I/O和其他适合它的任务，同时在Z80上运行CP/M程序。为了避免6502崩溃，SoftCard利用Z80的REFRESH线，允许6502执行短暂的自旋循环并刷新其寄存器，防止数据丢失。当Z80需要6502执行任务时，它会更新内存以通知6502执行特定代码并返回结果。\n\n内存映射是一个关键问题。6502和Z80都希望将内存的前256字节用于不同的目的，并且CP/M期望在6502已经使用的特定地址加载程序。为了解决这个问题，SoftCard包含了地址转换电路，重新映射了Z80的内存空间。Apple II的特殊保留地址被移动到Z80内存映射的末尾，Apple II的普通RAM在Z80的内存映射中变得连续，从地址$0000开始。SoftCard手册为程序员提供了详细的说明，包括如何从Z80调用6502子程序以及内存重映射图。"
  },
  {
    "id": "45820872",
    "title": "I’m worried that they put co-pilot in Excel",
    "url": "https://simonwillison.net/2025/Nov/5/brenda/",
    "summary": "This TikTok post by Ada James (@belligerentbarbies) expresses concern about the integration of Copilot AI into Excel, specifically focusing on the potential disruption to established workflows and the vital role played by skilled Excel users like \"Brenda.\"\n\nThe author fears that Copilot, despite its promises, will introduce errors into crucial financial reports. The central argument is that Brenda, the experienced Excel user, understands the intricacies of these reports and ensures their accuracy. However, higher-ups, unfamiliar with Excel's complexities, might rely on Copilot to make changes, leading to potentially significant mistakes due to the AI's tendency to \"hallucinate\" (generate incorrect or nonsensical information).\n\nThe post argues that Brenda's expertise, derived from years of experience and a deep understanding of Excel, is indispensable for accurate financial reporting. The author paints Brenda as a critical figure in the business world, whose mastery of Excel is essential for the function of capitalism itself. The core worry is that Copilot will supplant or undermine Brenda's role, ultimately leading to inaccurate and unreliable financial data. Essentially, the author trusts human expertise over AI when it comes to the complex and vital tasks performed in Excel.\n",
    "chinese_title": "我担心他们把Copilot放到Excel里。",
    "chinese_summary": "Ada James (@belligerentbarbies) 的TikTok帖子表达了对Copilot AI集成到Excel中的担忧，特别是关注其对现有工作流程的潜在破坏以及像“Brenda”这样的熟练Excel用户所扮演的重要角色。\n\n作者担心Copilot，尽管它做出了承诺，但会给关键的财务报告带来错误。核心论点是，经验丰富的Excel用户Brenda了解这些报告的复杂性并确保其准确性。然而，不熟悉Excel复杂性的高层管理者可能会依赖Copilot进行更改，由于AI倾向于“幻觉”（生成不正确或无意义的信息），这可能导致重大错误。\n\n帖子认为，Brenda的专业知识，源于多年的经验和对Excel的深刻理解，对于准确的财务报告是不可或缺的。作者将Brenda描绘成商业界的重要人物，她对Excel的掌握对于资本主义本身的运作至关重要。核心担忧是Copilot将取代或削弱Brenda的角色，最终导致不准确和不可靠的财务数据。本质上，在Excel中执行的复杂和至关重要的任务方面，作者更信任人类的专业知识而不是AI。"
  },
  {
    "id": "45816041",
    "title": "I took all my projects off the cloud, saving thousands of dollars",
    "url": "https://rameerez.com/send-this-article-to-your-friend-who-still-thinks-the-cloud-is-a-good-idea/",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "我把所有项目都从云端撤了下来，省下了数千美元。",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "45823162",
    "title": "Gnome Mutter Now \"Completely Drops the Whole X11 Back End\"",
    "url": "https://www.phoronix.com/news/GNOME-Mutter-Drops-X11",
    "summary": "GNOME's Mutter window manager has officially dropped its X11 backend, fully committing to Wayland as its sole display server protocol. This significant change, detailed in a merged request by Bilal Elmoussaoui, marks a complete removal of the X11 codebase. While the X11 backend was disabled by default in GNOME 49, GNOME 50 will finalize its removal. This move signifies a major shift in GNOME's architecture, prioritizing Wayland-based environments for future development. Importantly, GNOME 50 will still support XWayland, ensuring compatibility for existing X11 applications and games within the Wayland desktop environment. This transition signals a focused approach towards Wayland for GNOME, moving away from maintaining the legacy X11 support.\n",
    "chinese_title": "Gnome Mutter 彻底放弃整个 X11 后端",
    "chinese_summary": "GNOME的Mutter窗口管理器已正式放弃其X11后端，完全致力于Wayland作为其唯一的显示服务器协议。"
  },
  {
    "id": "45822539",
    "title": "NY smartphone ban has made lunch loud again",
    "url": "https://gothamist.com/news/ny-smartphone-ban-has-made-lunch-loud-again",
    "summary": "A smartphone ban in New York schools, including Benjamin N. Cardozo High School in Queens, has led to a noticeable increase in noise and social interaction during lunchtime. Students are now engaging in board games and conversation instead of being glued to their phones. Teachers report that the ban, now in effect in 31 states plus Washington, D.C., has improved classroom environments, increased student engagement, and boosted overall productivity.\n\nWhile the majority of school staff feel the ban is positive, some students miss having access to their phones. Some circumvent the rules with \"burner\" phones. Others are passing notes, playing cards, and taking Polaroid photos. Despite the mixed feelings, many students acknowledge benefits like increased reading and more lively classroom discussions.\n\nThe article highlights a survey from the state teacher's union that shows that 89% of school staff members said the new policies improved their schools' environments, and 76% said kids are more engaged in lessons. Teachers are generally happy with the changes, reporting better focus, more student interaction and discussion. One assistant principal even noted students need lessons on how to read analog clocks again.\n",
    "chinese_title": "纽约智能手机禁令让午餐再次喧闹起来",
    "chinese_summary": "纽约学校（包括皇后区本杰明·N·卡多佐高中）的智能手机禁令导致午餐时间噪音和社交互动明显增加。学生们现在玩棋盘游戏和交谈，而不是沉迷于手机。教师报告称，目前在 31 个州加上华盛顿特区生效的禁令改善了课堂环境，提高了学生的参与度，并提高了整体效率。\n\n虽然大多数学校工作人员认为这项禁令是积极的，但一些学生怀念使用手机。有些人使用“一次性”手机规避规则。另一些人则传递纸条、玩纸牌和拍摄宝丽来照片。尽管感受不一，但许多学生承认禁令的好处，例如阅读量增加和课堂讨论更加活跃。\n\n文章重点介绍了一项来自州教师工会的调查，该调查显示，89% 的学校工作人员表示新政策改善了学校环境，76% 的人表示孩子们更投入到课堂中。教师普遍对这些变化感到满意，并报告说专注力更好，学生互动和讨论更多。一位助理校长甚至指出，学生们需要重新学习如何读取模拟时钟。"
  },
  {
    "id": "45816879",
    "title": "Patching 68K Software – SimpleText",
    "url": "https://tinkerdifferent.com/threads/patching-68k-software-simpletext.4793/",
    "summary": "David Cook's article details his challenging experience patching SimpleText to open a smaller text window at startup. Initially expecting a simple constant overwrite, he discovered he needed to inject more complex code to handle various window types (text, pictures, video, about box).\n\nHe couldn't directly insert code without disrupting existing jump instructions, so he implemented a jump-out-and-back approach. He overwrote existing code with a jump to his custom routine appended at the end of the 'CODE' resource, then returned to the original SimpleText code flow. His routine checked if it was a text window and substituted a new size if needed. He then later had to patch code again, because SimpleText resized the window again, so he needed to store if the window had been previously resized by his code.\n\nKey challenges included: needing to preserve the functionality of overwritten code (like retrieving `MBarHeight`), finding a place to store the result of the first code patch for later use (solved by storing a variable within the code itself), and dealing with CodeWarrior limitations (no BSR instruction, requiring JSR and specific routine placement).\n\nHe used tricks like directly calling `GetHandleSize` to avoid library overhead, passing scratch registers to C functions, and defining window sizes in a resource for easier future modification. He also notes potential ResEdit corruption issues and includes a hacked version of SimpleText and the resource.\n",
    "chinese_title": "修补68K软件 - 简易文本",
    "chinese_summary": "David Cook的文章详细描述了他修改SimpleText以使其在启动时打开一个较小的文本窗口的充满挑战的经历。最初，他期望一个简单的常量覆盖，但后来发现需要注入更复杂的代码来处理各种窗口类型（文本、图片、视频、关于框）。\n\n他无法直接插入代码而不扰乱现有的跳转指令，因此他采用了一种跳出再跳回的方法。他用一个跳转到追加在'CODE'资源末尾的自定义例程的指令覆盖了现有代码，然后返回到原始的SimpleText代码流程。他的例程检查是否为文本窗口，并在需要时替换新的尺寸。之后，他不得不再次修补代码，因为SimpleText再次调整了窗口大小，所以他需要存储窗口是否已被他的代码先前调整过大小。\n\n关键挑战包括：需要保留被覆盖代码的功能（例如检索`MBarHeight`），找到一个地方来存储第一个代码补丁的结果以供后续使用（通过将变量存储在代码本身中解决），以及处理CodeWarrior的限制（没有BSR指令，需要JSR和特定的例程位置）。\n\n他使用了诸如直接调用`GetHandleSize`来避免库开销，将暂存寄存器传递给C函数，以及在资源中定义窗口大小以便于未来修改等技巧。他还提到了潜在的ResEdit损坏问题，并包含了一个破解版的SimpleText和资源。"
  },
  {
    "id": "45823436",
    "title": "Faustino Oro (12 years-old) takes Vidit Gujrathi (#27) to the tiebreaks in chess",
    "url": "https://twitter.com/FIDE_chess/status/1986051222512554279",
    "summary": "The article, titled \"Faustino Oro (12 years-old) takes Vidit Gujrathi (#27) to the tiebreaks in chess,\" describes a chess match where a 12-year-old player, Faustino Oro, performed exceptionally well against Vidit Gujrathi, a highly-ranked chess player (ranked #27 in the world). The key takeaway is that Oro was able to push Gujrathi to tiebreaks, highlighting the young player's impressive skill and competitive ability.\n",
    "chinese_title": "福斯蒂诺·奥罗 (12岁) 将维迪特·古杰拉蒂 (#27) 逼入国际象棋加赛",
    "chinese_summary": "“法斯蒂诺·奥罗 (12岁) 国际象棋战平世界第27位维迪特·古杰拉蒂，进入加赛” 这篇文章描述了一场国际象棋比赛，12 岁的法斯蒂诺·奥罗表现出色，与排名很高的国际象棋棋手（世界排名第 27 位）维迪特·古杰拉蒂战成平手。关键在于奥罗能够将古杰拉蒂逼入加赛，凸显了这位年轻棋手令人印象深刻的技能和竞争能力。"
  },
  {
    "id": "45749833",
    "title": "Developers are choosing older AI models",
    "url": "https://www.augmentcode.com/blog/developers-are-choosing-older-ai-models-and-16b-tokens-of-data-explain-why",
    "summary": "In October 2025, Augment Code observed developers increasingly choosing older AI models alongside newer ones, indicating a shift towards specialization rather than a simple upgrade cycle. Data from millions of live interactions showed Sonnet 4.5 usage declining while Sonnet 4.0 usage increased, suggesting models are being selected based on specific task profiles.\n\nThe article highlights behavioral differences between Sonnet 4.5, Sonnet 4.0, and GPT-5. Sonnet 4.5 exhibits deeper reasoning and lower tool call frequency, resulting in higher token output and cache utilization. Sonnet 4.0 prioritizes quick task execution with more frequent tool calls, leading to faster and more deterministic completions. GPT-5 balances reasoning with natural language, excelling in explanations and hybrid coding tasks.\n\nThe data revealed that Sonnet 4.5 is preferred for complex tasks like refactoring and debugging, while Sonnet 4.0 is favored for automation and rule-based coding. GPT-5 is best suited for code walkthroughs and documentation. This emergent specialization echoes community sentiment, with users recognizing each model's distinct strengths and weaknesses.\n\nThe key takeaways are that AI model adoption is diversifying, measurable behavioral differences exist between models, and system costs are shifting towards reasoning intensity and cache utilization. The focus is shifting from finding a single \"best\" model to selecting the most appropriate cognitive style for each task.\n",
    "chinese_title": "开发者正在选择较旧的AI模型",
    "chinese_summary": "2025年10月，Augment Code观察到，开发者越来越多地选择旧款AI模型与新款模型并用，这表明AI模型的使用趋势正在从简单的升级换代转向专业化。来自数百万次实时互动的数据显示，Sonnet 4.5 的使用量下降，而 Sonnet 4.0 的使用量增加，这表明模型的选择是基于特定的任务需求。\n\n文章重点介绍了 Sonnet 4.5、Sonnet 4.0 和 GPT-5 之间的行为差异。Sonnet 4.5 表现出更深层次的推理能力和较低的工具调用频率，从而导致更高的 token 输出和缓存利用率。Sonnet 4.0 优先考虑快速的任务执行，工具调用更频繁，从而实现更快、更具确定性的补全。GPT-5 平衡了推理和自然语言能力，擅长解释和混合编码任务。\n\n数据显示，Sonnet 4.5 更适用于重构和调试等复杂任务，而 Sonnet 4.0 更受自动化和基于规则的编码任务青睐。GPT-5 最适合代码演练和文档编写。这种涌现出的专业化趋势与社区情绪相呼应，用户认识到每个模型独特的优势和劣势。\n\n主要结论是，AI模型的使用正在多样化，不同模型之间存在可衡量的行为差异，并且系统成本正在向推理强度和缓存利用率转移。重点正在从寻找单一的“最佳”模型转向为每个任务选择最合适的认知风格。"
  },
  {
    "id": "45820715",
    "title": "The Hacker’s Manifesto (1986)",
    "url": "https://phrack.org/issues/7/3",
    "summary": "\"The Hacker's Manifesto,\" written by The Mentor in 1986, is a passionate defense of the hacker identity and a critique of societal perceptions. Penned shortly after his arrest, the manifesto argues that hackers are driven by curiosity, intelligence, and a desire for knowledge that is stifled by a rigid and uninspired educational system.\n\nThe Mentor portrays the hacker as someone who is bored and unchallenged by conventional schooling, finding solace and intellectual stimulation in the world of computers. The text emphasizes the hacker's frustration with being misunderstood and labeled as a troublemaker. It highlights the feeling of belonging within the online community, where individuals are judged by their ideas and abilities, not by superficial characteristics like race or nationality.\n\nThe manifesto challenges the notion that hackers are criminals, arguing that they are simply exploring systems and seeking knowledge. It accuses corporations of profiteering from technology and governments of hypocrisy, pointing out that hackers are often unfairly demonized while those in power commit far greater crimes.\n\nUltimately, \"The Hacker's Manifesto\" is a call for understanding and acceptance, arguing that hackers are driven by a desire to learn and explore, and that their actions should be viewed in that context. It concludes with a defiant assertion that the hacker spirit cannot be extinguished, as \"we're all alike.\"\n",
    "chinese_title": "黑客宣言 (1986)",
    "chinese_summary": "《黑客宣言》由The Mentor于1986年撰写，是对黑客身份的热情辩护以及对社会认知的批判。 这份宣言在他被捕后不久写成，认为黑客是由好奇心、智慧和对知识的渴望所驱动，而这些都被僵化且缺乏灵感的教育体系所扼杀。\n\nThe Mentor将黑客描绘成因传统教育而感到厌倦和缺乏挑战的人，他们在计算机世界中找到了慰藉和智力刺激。 该文本强调了黑客因被误解和被贴上麻烦制造者的标签而产生的挫败感。 它突出了在线社区中的归属感，在这个社区中，人们的评判标准是他们的想法和能力，而不是种族或国籍等肤浅的特征。\n\n该宣言挑战了黑客是罪犯的观念，认为他们只是在探索系统和寻求知识。 它指责公司从技术中牟取暴利，并指责政府虚伪，指出黑客经常受到不公正的妖魔化，而掌权者却犯下更大的罪行。\n\n最终，《黑客宣言》是对理解和接受的呼吁，认为黑客是被学习和探索的愿望所驱动的，他们的行为应该在这种背景下看待。它以一种挑衅性的断言结束，即黑客精神无法被熄灭，因为“我们都一样”。"
  },
  {
    "id": "45818319",
    "title": "Direct File won't happen in 2026, IRS tells states",
    "url": "https://www.nextgov.com/digital-government/2025/11/direct-file-wont-happen-2026-irs-tells-states/409309/",
    "summary": "Here's a concise summary of the article:\n\nThe IRS has informed states that the Direct File program, a free, government-run online tax filing service, will not be available in 2026. This follows a successful pilot program in 2024 and 2025, used by hundreds of thousands who gave it positive reviews. The decision comes after opposition from Republicans and tax preparation companies who lobbied against the program.\n\nThe Trump administration's tax and spending policy bill directed the IRS to explore public-private partnerships as a replacement for Direct File. The existing public-private partnership, Free File, has been underutilized and criticized for misleading users into paying for services.\n\nAdvocates for Direct File criticize the decision, claiming that it favors tax preparation monopolies like TurboTax at the expense of taxpayers who will now have to spend more money and time filing their taxes. Senator Elizabeth Warren stated that the fight to offer accessible tax filing options is not over. The IRS has not commented on the matter.\n",
    "chinese_title": "美国国税局告知各州，直接报税系统2026年不会实现。",
    "chinese_summary": "文章概要：\n\n美国国税局通知各州，免费的政府运营在线报税服务Direct File项目将于2026年停止提供。此前，该项目在2024年和2025年成功进行了试点，受到数十万用户的好评。这一决定是在共和党人和税务准备公司游说反对该项目之后做出的。\n\n特朗普政府的税收和支出政策法案指示国税局探索公私合作模式，以取代Direct File。现有的公私合作模式Free File使用率不高，并因误导用户付费服务而受到批评。\n\nDirect File的支持者批评这一决定，声称这有利于TurboTax等税务准备垄断企业，损害了纳税人的利益，他们现在将不得不花费更多的金钱和时间来报税。参议员伊丽莎白·沃伦表示，为纳税人提供便捷报税渠道的斗争尚未结束。美国国税局尚未对此事发表评论。"
  },
  {
    "id": "45823290",
    "title": "Don't panic yet, investors say as high-flying AI stocks tumble",
    "url": "https://www.reuters.com/world/asia-pacific/global-markets-ai-selloff-pix-2025-11-05/",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "人工智能热门股下跌，投资者称尚无需恐慌",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "45812024",
    "title": "This week in 1988, Robert Morris unleashed his eponymous worm",
    "url": "https://www.tomshardware.com/tech-industry/cyber-security/on-this-day-in-1988-the-morris-worm-slithered-out-and-sparked-a-new-era-in-cybersecurity-10-percent-of-the-internet-was-infected-within-24-hours",
    "summary": "In 1988, Cornell graduate student Robert Tappan Morris unintentionally unleashed the \"Morris worm\" on the Internet. Designed to gauge the Internet's size, it exploited vulnerabilities in BSD UNIX systems, particularly in email and the 'finger' program, causing infections in 10% of the Internet within 24 hours.\n\nUnlike viruses, the Morris worm self-replicated and spread autonomously, leading to system slowdowns, messaging delays, and crashes. Institutions like Berkeley, Harvard, and NASA were significantly affected, requiring some to wipe entire systems to eradicate the worm.\n\nThe FBI investigated and identified Morris as the culprit. He was indicted under the Computer Fraud and Abuse Act, but avoided jail time, receiving a fine, probation, and community service instead.\n\nThe incident highlighted the Internet's fragility at the time when it was primarily NSFNET and the WWW was not yet in existence. While the worm didn't damage files, the cost of its impact was estimated between $100,000 and millions of dollars, affecting roughly 6,000 of the 60,000 systems then connected. The event also led to improved security procedures and a shift away from a naive sense of trust on the Internet. Modern worms continue to be a threat, as seen with recent AI worms.\n",
    "chinese_title": "1988年的本周，罗伯特·莫里斯放出了以他名字命名的蠕虫病毒",
    "chinese_summary": "1988年，康奈尔大学研究生罗伯特·塔潘·莫里斯无意中在互联网上释放了“莫里斯蠕虫”。该蠕虫旨在评估互联网规模，利用BSD UNIX系统（特别是电子邮件和“finger”程序）中的漏洞，在24小时内感染了10%的互联网。\n\n与病毒不同，莫里斯蠕虫能够自我复制和自主传播，导致系统运行缓慢、消息延迟和崩溃。伯克利、哈佛和美国宇航局等机构受到了严重影响，一些机构需要擦除整个系统才能根除该蠕虫。\n\n联邦调查局对此事进行了调查，并将莫里斯确认为罪魁祸首。他因违反《计算机欺诈和滥用法案》而被起诉，但避免了牢狱之灾，而是被处以罚款、缓刑和社区服务。\n\n该事件凸显了当时互联网的脆弱性，那时互联网主要还是NSFNET，万维网尚未出现。虽然该蠕虫没有损坏文件，但其影响造成的损失估计在10万美元到数百万美元之间，影响了当时连接的6万台系统中的大约6000台。该事件还促使人们改进了安全程序，并摆脱了对互联网天真的信任感。正如最近的人工智能蠕虫所见，现代蠕虫仍然是一种威胁。"
  },
  {
    "id": "45817167",
    "title": "Uncle Sam wants to scan your iris and collect your DNA, citizen or not",
    "url": "https://www.theregister.com/2025/11/04/dhs_wants_to_collect_biometric_data/",
    "summary": "The Department of Homeland Security (DHS) is proposing a significant expansion of biometric data collection for immigration applications, potentially affecting not only immigrants but also US citizens connected to their cases. The proposed rule would broaden the scope of who must submit biometrics, including any applicant, petitioner, sponsor, supporter, derivative, dependent, beneficiary, or individual associated with an immigration request, regardless of age or citizenship. It also includes any alien apprehended or arrested by DHS.\n\nThe definition of \"biometrics\" would also expand to include \"measurable biological... or behavioral characteristics,\" opening the door to collecting data like ocular imagery, voice prints, and DNA. DHS explicitly seeks authority to collect raw DNA or DNA test results for purposes like verifying biological sex or familial relationships.\n\nDHS states the data will be used for identity verification, national security checks, secure document production, and administrative functions.\n\nCritics are voicing concerns about government overreach, comparing the proposal to authoritarian states and citing potential violations of constitutional rights. They also raise concerns about the accuracy and potential misuse of biometric data, particularly facial recognition technology. The public has until January 2nd to submit comments on the proposal. DHS has so far not responded to requests for comment regarding the negative public response.\n",
    "chinese_title": "山姆大叔想扫描你的虹膜并收集你的DNA，无论你是不是公民。",
    "chinese_summary": "国土安全部拟大幅扩大移民申请生物识别数据收集范围，不仅可能影响移民，还可能影响与他们案件相关的美国公民。拟议规则将扩大必须提交生物识别数据的人员范围，包括任何申请人、请愿人、担保人、支持者、衍生物、家属、受益人或与移民请求相关的个人，无论其年龄或公民身份。 该规则还包括任何被国土安全部逮捕或拘留的外国人。\n\n“生物识别数据”的定义也将扩大到包括“可测量的生物……或行为特征”，为收集眼部图像、声纹和 DNA 等数据打开了大门。 国土安全部明确寻求收集原始 DNA 或 DNA 测试结果的权力，用于验证生物性别或家庭关系等目的。\n\n国土安全部表示，这些数据将用于身份验证、国家安全检查、安全文件制作和行政职能。\n\n批评人士对政府权力过度扩张表示担忧，将该提案与专制国家相提并论，并指出可能侵犯宪法权利。 他们还对生物识别数据的准确性和潜在滥用表示担忧，尤其是面部识别技术。 公众可在 1 月 2 日之前就该提案提交意见。 国土安全部至今未回应有关公众负面反应的置评请求。"
  },
  {
    "id": "45733836",
    "title": "Frozen String Literals: Past, Present, Future?",
    "url": "https://byroot.github.io/ruby/performance/2025/10/28/string-literals.html",
    "summary": "This article delves into the history, purpose, and future of frozen string literals in Ruby. Unlike many popular languages where strings are immutable, Ruby strings are mutable by default, which offers flexibility but can lead to performance issues due to unnecessary string duplication and memory allocation.\n\nThe author explains that Ruby actually has both mutable and immutable strings, leveraging freezing to optimize certain operations. For example, Ruby automatically freezes string keys in hashes to prevent mutation-related issues.\n\nThe article then traces the evolution of frozen string literals. The initial motivation was to reduce overhead by freezing string literals used as constants. This led to proposals for new syntax and eventually the adoption of compiler optimizations.  Ruby 2.1 introduced the `opt_str_freeze` instruction, which avoids duplicating string literals before freezing them. Further optimizations like `opt_aref_with` and `opt_aset_with` improved hash access performance by avoiding unnecessary string copying.\n\nHowever, `opt_aref_with` has recently been removed from the Ruby trunk, as most performance-sensitive code now utilizes the magic comment `# frozen_string_literal: true`, diminishing its benefits. The article concludes by highlighting the ongoing trade-offs between mutable strings' flexibility and the performance overhead associated with them, and the continuous efforts to optimize string handling in Ruby.\n",
    "chinese_title": "冻结字符串字面量：过去、现在与未来？",
    "chinese_summary": "本文深入探讨了 Ruby 中冻结字符串字面量的历史、目的和未来。与许多流行的字符串不可变的语言不同，Ruby 字符串默认是可变的，这提供了灵活性，但也可能由于不必要的字符串复制和内存分配而导致性能问题。\n\n作者解释说，Ruby 实际上同时具有可变和不可变的字符串，利用冻结来优化某些操作。例如，Ruby 会自动冻结哈希中的字符串键，以防止与可变性相关的问题。\n\n文章随后追溯了冻结字符串字面量的演变历程。最初的动机是通过冻结用作常量的字符串字面量来减少开销。这导致了对新语法的提议，并最终采用了编译器优化。Ruby 2.1 引入了 `opt_str_freeze` 指令，该指令避免了在冻结字符串字面量之前复制它们。诸如 `opt_aref_with` 和 `opt_aset_with` 之类的进一步优化通过避免不必要的字符串复制来提高了哈希访问性能。\n\n然而，`opt_aref_with` 最近已从 Ruby 主干中删除，因为大多数对性能敏感的代码现在都使用了魔法注释 `# frozen_string_literal: true`，从而降低了它的好处。文章最后强调了可变字符串的灵活性与与之相关的性能开销之间持续存在的权衡，以及在 Ruby 中不断优化字符串处理的努力。"
  },
  {
    "id": "45813310",
    "title": "Launch HN: Plexe (YC X25) – Build production-grade ML models from prompts",
    "url": "https://www.plexe.ai/",
    "summary": "Plexe AI, a YC X25 startup, offers a platform that enables users to build and deploy production-grade ML models from natural language prompts. It positions itself as an \"agentic ML engineering team,\" democratizing AI model creation for various business needs.\n\nThe platform simplifies the ML development process by allowing users to connect their data, receive instant insights (including data quality checks and pattern identification), and define the desired model's purpose in plain language. Plexe then automatically builds a production-ready model tailored to the specific challenge, such as fraud detection or churn prediction.\n\nPlexe emphasizes transparency by providing users with clear performance metrics, training details, and explanations for each prediction, fostering trust and understanding. The platform supports various functionalities, including custom ML models, data dashboards, API endpoints, batch jobs, file uploads, and database connectors.\n\nPlexe caters to different industries, including finance & banking, e-commerce, logistics, and cybersecurity, offering tailored solutions like fraud prevention, credit underwriting, and churn reduction. The platform emphasizes its ability to deploy ML models quickly, going from idea to working AI in hours, not months. Finally, Plexe provides resources such as blogs, documentation, and communities on GitHub and Discord.\n",
    "chinese_title": "发布HN: Plexe (YC X25) – 从提示构建生产级机器学习模型",
    "chinese_summary": "Plexe AI是一家YC X25创业公司，提供一个平台，使用户能够通过自然语言提示构建和部署生产级机器学习模型。它将自身定位为一个“智能体ML工程团队”，从而为各种业务需求普及AI模型创建。\n\n该平台简化了机器学习开发流程，允许用户连接数据，接收即时洞察（包括数据质量检查和模式识别），并用通俗易懂的语言定义所需模型的用途。然后，Plexe会自动构建一个针对特定挑战（如欺诈检测或客户流失预测）量身定制的、可用于生产的模型。\n\nPlexe强调透明度，为用户提供清晰的性能指标、训练细节以及对每个预测的解释，从而培养信任和理解。该平台支持各种功能，包括自定义机器学习模型、数据仪表板、API端点、批量作业、文件上传和数据库连接器。\n\nPlexe服务于不同的行业，包括金融和银行、电子商务、物流和网络安全，提供量身定制的解决方案，如欺诈预防、信用承销和客户流失减少。该平台强调其快速部署机器学习模型的能力，可以在几小时内（而不是几个月）从想法变成可用的AI。最后，Plexe提供博客、文档以及GitHub和Discord上的社区等资源。"
  },
  {
    "id": "45816968",
    "title": "Google Removed 749M Anna's Archive URLs from Its Search Results",
    "url": "https://torrentfreak.com/google-removed-749-million-annas-archive-urls-from-its-search-results/",
    "summary": "Anna's Archive, a meta-search engine for shadow libraries offering access to pirated books and articles, has become a major target for copyright holders. Since its launch in 2022, Google has removed a staggering 749 million URLs associated with Anna's Archive from its search results following DMCA takedown requests. This represents 5% of all takedown requests Google has received since it began publishing transparency reports in 2012.\n\nPublishers like Penguin Random House and John Wiley & Sons, alongside over 1,000 other authors and publishers, are actively sending DMCA notices, currently averaging 10 million new URLs reported per week. Their goal is to make it difficult for users to find pirated content from Anna's Archive via Google searches.\n\nWhile many URLs have been delisted or demoted, the main Anna's Archive domains remain accessible through direct searches for the site's name, suggesting that complete eradication from search results has not yet been achieved. Despite legal pressure and takedown efforts, Anna's Archive remains operational, presenting a persistent challenge for publishers seeking to protect their copyrights.\n",
    "chinese_title": "谷歌从其搜索结果中移除了7.49亿个安娜的档案链接。",
    "chinese_summary": "安娜文库：盗版图书和文章的元搜索引擎，成版权方主要打击目标。自2022年上线以来，谷歌已应《数字千年版权法案》(DMCA) 下架请求，从搜索结果中删除了与安娜文库相关的7.49亿个网址，占谷歌自2012年发布透明度报告以来收到的所有下架请求的5%。\n\n包括企鹅兰登书屋和约翰威立父子出版公司在内的出版社，以及1000多名作者和出版商，正积极发送DMCA通知，目前平均每周报告1000万个新网址。他们的目标是使用户难以通过谷歌搜索找到安娜文库的盗版内容。\n\n虽然许多网址已被取消或降级，但通过直接搜索该网站名称，仍可访问安娜文库的主要域名，这表明尚未完全从搜索结果中清除该网站。尽管面临法律压力和下架努力，安娜文库仍在运营，对寻求保护其版权的出版商构成了持续的挑战。"
  },
  {
    "id": "45823728",
    "title": "FBI Warns of Criminals Posing as ICE, Urges Agents to ID Themselves",
    "url": "https://www.wired.com/story/fbi-warns-of-criminals-posing-as-ice-urges-agents-to-id-themselves/",
    "summary": "The FBI has issued a warning about criminals impersonating ICE agents, leading to robberies, kidnappings, and sexual assaults. The bulletin urges law enforcement to clearly identify themselves and cooperate with civilians verifying their identity due to the rise in impersonation crimes.\n\nThese crimes are exploiting the heightened profile of ICE to target vulnerable communities and erode trust in law enforcement. Examples cited include incidents in New York, Florida, Brooklyn, and North Carolina involving fake ICE agents committing crimes ranging from robbery to attempted rape.\n\nThe FBI advises agencies to coordinate to verify legitimate ICE operations and highlights signs of impersonation, such as forged credentials or outdated gear. They also recommend outreach programs to identify fake agents and counteract the mistrust caused by impersonators.\n\nThe article explores the underlying issue of ICE's own masking practices, which critics argue blurs the line between lawful arrest and military-style force, further weakening public confidence. Some jurisdictions, like California and Seattle, are considering or have enacted bans on masking by law enforcement in non-high-risk situations.\n\nThe article also details a specific case in Fife, Washington, where a man created a video dressed as an ICE agent, honking his horn as he drove through a Ukrainian grocery store, as part of a YouTube prank. This case underscores the potential for impersonation and its effects on community safety and trust.\n",
    "chinese_title": "联邦调查局警告：有罪犯冒充移民局，敦促探员表明身份",
    "chinese_summary": "联邦调查局警告：罪犯冒充移民局特工，导致抢劫、绑架和性侵案件发生。公告敦促执法部门明确表明身份，并配合民众核实身份，以应对冒充犯罪的抬头。\n\n这些犯罪行为利用了移民局的高度关注，针对脆弱社区，并削弱了对执法的信任。引用的例子包括发生在纽约、佛罗里达、布鲁克林和北卡罗来纳州的事件，其中假冒移民局特工犯下了从抢劫到企图强奸等罪行。\n\n联邦调查局建议各机构协调核实合法的移民局行动，并强调了冒充的迹象，例如伪造的证件或过时的装备。他们还建议开展外展计划，以识别假冒特工，并消除冒充者造成的不信任感。\n\n文章探讨了移民局自身掩盖行为的根本问题，批评人士认为这模糊了合法逮捕和军事式武力之间的界限，进一步削弱了公众的信心。一些司法管辖区，如加利福尼亚州和西雅图，正在考虑或已经颁布禁令，禁止执法部门在非高风险情况下进行遮面。\n\n文章还详细介绍了一个发生在华盛顿州法夫市的案例，其中一名男子制作了一个视频，打扮成移民局特工，在他开车经过一家乌克兰杂货店时鸣喇叭，作为YouTube恶作剧的一部分。该案例强调了冒充行为的可能性及其对社区安全和信任的影响。"
  },
  {
    "id": "45822190",
    "title": "The Benefits of Bubbles",
    "url": "https://stratechery.com/2025/the-benefits-of-bubbles/",
    "summary": "This article argues that economic bubbles, while ultimately unsustainable, offer significant long-term benefits, drawing on Carlota Perez's work on technological revolutions and Byrne Hobart and Tobias Huber's concept of \"Inflection Bubbles.\"\n\nThe author points out that the current AI boom, fueled by massive investments from companies like OpenAI, resembles past bubbles like the dot-com era. While a crash is likely, it's crucial to recognize the positive consequences.\n\nPerez's research highlights how bubbles drive the \"Installation Phase\" of technological revolutions, leading to infrastructure development that, even after the bubble bursts, lays the foundation for future growth. The dot-com bubble, despite its failures, resulted in widespread fiber optic infrastructure and a digitally literate workforce.\n\nHobart and Huber add the concept of \"cognitive capacity,\" where shared belief in a transformative future during a bubble leads to coordinated innovation. The dot-com bubble, for example, spurred innovations like XMLHttpRequest, which transformed web browsers from consumption to productivity tools. The bubble also drove back-end innovation, particularly with the rise of Linux and commodity hardware to handle scalability challenges.\n\nThe article then examines whether the AI bubble will be beneficial, addressing concerns about the short lifespan of GPUs. However, it notes that investments in chip fabrication (fabs) and, crucially, power generation infrastructure offer more lasting value. The author is encouraged by the industry already hitting the power wall, as this presents economic and governmental incentives to build more power, leading to an infrastucture boom that could significantly benefit humanity, particularly if it results in low-marginal cost renewable energy.\n",
    "chinese_title": "泡泡的益处",
    "chinese_summary": "本文认为，经济泡沫虽然最终不可持续，但能带来显著的长期效益，并借鉴了卡洛塔·佩雷斯关于技术革命以及伯恩·霍巴特和托拜厄斯·胡伯关于“拐点泡沫”的研究。\n\n作者指出，目前由OpenAI等公司巨额投资推动的人工智能繁荣，类似于过去的互联网泡沫时代。虽然崩盘很可能发生，但认识到其积极后果至关重要。\n\n佩雷斯的研究强调了泡沫如何驱动技术革命的“安装阶段”，从而导致基础设施建设，即使在泡沫破裂后，也能为未来的增长奠定基础。互联网泡沫尽管遭遇失败，但却促成了光纤基础设施的广泛普及和具备数字素养的劳动力。\n\n霍巴特和胡伯补充了“认知能力”的概念，即在泡沫期间，对变革性未来的共同信念导致协同创新。例如，互联网泡沫刺激了XMLHttpRequest等创新，将Web浏览器从消费工具转变为生产力工具。泡沫也推动了后端创新，特别是随着Linux和商品硬件的兴起，以应对可扩展性挑战。\n\n文章随后探讨了人工智能泡沫是否会有益，并解决了对GPU短寿命的担忧。然而，文章指出，对芯片制造厂（fabs）以及至关重要的发电基础设施的投资提供了更持久的价值。作者对该行业已经触及电力瓶颈感到鼓舞，因为这为建设更多电力提供了经济和政府激励，从而导致基础设施繁荣，这可能会极大地造福人类，特别是如果它能带来低边际成本的可再生能源。"
  },
  {
    "id": "45816191",
    "title": "BlackRock's Larry Fink: \"Tokenization\", Digital IDs, & Social Credit",
    "url": "https://thewinepress.substack.com/p/tokenization-blackrocks-larry-fink",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "贝莱德的拉里·芬克：“代币化”、数字身份与社会信用",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "45726597",
    "title": "Inside an Isotemp OCXO107-10 Oven Controlled Crystal Oscillator",
    "url": "https://tomverbeure.github.io/2025/10/26/Inside-an-Isotemp-OCXO107-10.html",
    "summary": "This article details the author's acquisition and exploration of an Isotemp OCXO107-10 oven-controlled crystal oscillator (OCXO). Purchased for $5, it's a 5 MHz oscillator, unlike the more common 10 MHz variants found in modern equipment, but compatible with older equipment like HP's cesium clocks and time interval counters.\n\nThe author compiles information from the \"time-nuts\" email list, highlighting that these oscillators were once expensive ($1000+), used by Lucent, and have variants like the OCXO107-16. He also obtains valuable internal photos from another enthusiast, Ed Palmer.\n\nThe article then describes how to get the OCXO running, detailing the DE-9 pinout for power and control (including 5V for TTL output, 12V for the oven, EFC, and VREF). Bench testing revealed the unit draws significant power initially to heat the oven, settling at lower consumption once stabilized. The output power and second harmonic distortion were measured. The author noted the unit's tag with EFC voltage settings and compared the measured Vref output to the expected value.\n\nThe internal design, based on photos provided by Ed Palmer, features a Dewar flask for thermal isolation, making it resistant to temperature variations but also fragile. The article speculates on the oscillator's temperature stability compared to other OCXOs, concluding that while older OCXOs may have superior temperature stability they may be outperformed by smaller and more robust modern double-oven OCXOs, but that other parameters such as phase noise, voltage stability, and size are also important. It also identifies key components like the Motorola Darlington transistor used as a heating element and a possible TL431 voltage reference.\n\nFinally, the author outlines plans to build a custom linear power supply for long-term comparative OCXO measurements, aiming to avoid the noise and power consumption of his current bench supply.\n",
    "chinese_title": "Isotemp OCXO107-10 恒温晶振内部",
    "chinese_summary": "本文详细介绍了作者获取和探索Isotemp OCXO107-10恒温晶体振荡器 (OCXO) 的过程。它以 5 美元的价格购得，是一个 5 MHz 的振荡器，与现代设备中更常见的 10 MHz 型号不同，但与惠普铯钟和时间间隔计数器等较旧的设备兼容。\n\n作者整理了来自“time-nuts”邮件列表的信息，强调这些振荡器曾经非常昂贵（1000 美元以上），被朗讯使用，并且有 OCXO107-16 等变体。他还从另一位爱好者 Ed Palmer 那里获得了宝贵的内部照片。\n\n文章随后描述了如何使 OCXO 运行，详细介绍了用于电源和控制的 DE-9 引脚排列（包括用于 TTL 输出的 5V、用于恒温器的 12V、EFC 和 VREF）。台式测试表明，该装置最初会消耗大量电力来加热恒温器，稳定后功耗会降低。测量了输出功率和二次谐波失真。作者注意到该装置的标签上有 EFC 电压设置，并将测量的 Vref 输出与预期值进行了比较。\n\n根据 Ed Palmer 提供的照片，其内部设计采用杜瓦瓶进行热隔离，使其能够抵抗温度变化，但也较为脆弱。文章推测了该振荡器的温度稳定性与其他 OCXO 相比如何，得出的结论是，虽然较旧的 OCXO 可能具有卓越的温度稳定性，但它们可能不如更小、更坚固的现代双恒温器 OCXO，但相位噪声、电压稳定性和尺寸等其他参数也很重要。文章还识别了关键组件，例如用作加热元件的摩托罗拉达林顿晶体管和可能的 TL431 电压基准。\n\n最后，作者概述了构建定制线性电源的计划，用于长期的 OCXO 比较测量，旨在避免当前台式电源的噪声和功耗。"
  },
  {
    "id": "45692042",
    "title": "Singing bus horns in West Sumatra",
    "url": "https://www.auralarchipelago.com/auralarchipelago/kalason",
    "summary": "This article explores the unique history of \"kalason oto,\" or singing bus horns, in West Sumatra, Indonesia, and pays tribute to Pak Budahar, a legendary player of the instrument. The kalason emerged in the 1950s, when mechanics began tuning and arranging spare car horns into musical scales, creating a keyboard for bus drivers to play melodies.\n\nAs people from the Minangkabau region traveled across Sumatra for work, these horns provided solace and a connection to home, playing traditional folk tunes and popular songs. Skilled players, known as \"tukang kalason,\" became highly sought after, with passengers specifically seeking out buses with their favorite musicians. The sound of the kalason became an integral part of the West Sumatran landscape.\n\nIn the 1970s and 80s, the popularity of kalason led to albums of the music being produced. However, the rise of modern diesel buses in the 1980s, incompatible with the kalason technology, led to its decline.\n\nThe article highlights the author's meeting with Pak Budahar and the revival of the kalason by a local car enthusiast. The author had hoped to document this tradition by traveling and recording Pak Budahar, but Pak Budahar passed away in 2023. The article serves as a loving tribute to the tradition and Pak Budahar, celebrating its cultural significance and expressing hope for its continued survival in some form.\n",
    "chinese_title": "西苏门答腊的歌唱巴士喇叭",
    "chinese_summary": "本文探寻了印度尼西亚西苏门答腊岛“卡拉松奥托”或称歌唱巴士喇叭的独特历史，并向传奇演奏家巴克·布达哈尔致敬。卡拉松产生于20世纪50年代，当时机械师开始将备用汽车喇叭调音并排列成音阶，为巴士司机创造了演奏旋律的键盘。\n\n当米南加保地区的人们为了工作而穿越苏门答腊岛时，这些喇叭提供了慰藉和与家乡的联系，演奏着传统的民谣和流行歌曲。技术娴熟的演奏者，被称为“tukang kalason”，变得炙手可热，乘客们专门寻找有他们喜爱音乐家的巴士。卡拉松的声音成为西苏门答腊景观不可或缺的一部分。\n\n在20世纪70年代和80年代，卡拉松的流行促使了音乐专辑的制作。然而，20世纪80年代现代柴油巴士的兴起，与卡拉松技术不兼容，导致了它的衰落。\n\n本文重点介绍了作者与巴克·布达哈尔的会面以及当地汽车爱好者对卡拉松的复兴。作者曾希望通过旅行和录制巴克·布达哈尔来记录这一传统，但巴克·布达哈尔于2023年去世。本文是对这一传统和巴克·布达哈尔的深情致敬，颂扬其文化意义，并表达了对它以某种形式继续生存下去的希望。"
  },
  {
    "id": "45813343",
    "title": "NoLongerEvil-Thermostat – Nest Generation 1 and 2 Firmware",
    "url": "https://github.com/codykociemba/NoLongerEvil-Thermostat",
    "summary": "This document details how to flash custom firmware onto first and second generation Nest Thermostats, replacing the official Nest/Google software with the \"NoLongerEvil\" platform. This allows users to bypass Google's cloud dependency and gain complete control over their thermostat and data.\n\nThe process involves using the OMAP DFU (Device Firmware Update) interface to flash modified bootloader and kernel images. Users must clone the repository, install prerequisites (build tools and libusb), build the `omap_loader` tool, and run the `install.sh` script. The script will wait for the Nest to enter DFU mode, which is achieved by connecting the device via USB, rebooting it while holding the display, and initiating the process. The installer flashes `x-load.bin`, `u-boot.bin`, and `uImage`.\n\nAfter flashing, the device boots to the NoLongerEvil firmware and redirects all network traffic to the NoLongerEvil platform. Users then register an account on the NoLongerEvil website, navigate to the thermostat to generate an entry code, and input the code to link it to their account.\n\n**Important Warnings:** The firmware is experimental and may brick the device. A backup thermostat is advised. Flashing voids Nest/Google warranty and the device will no longer communicate with Google servers. The project is built upon the work of previous researchers who demonstrated the ability to flash custom firmware, and the firmware images and backend API server code will be open-sourced.\n",
    "chinese_title": "NoLongerEvil-Thermostat – Nest 第一代和第二代固件",
    "chinese_summary": "本文件详细介绍了如何将自定义固件刷入第一代和第二代Nest恒温器，用“NoLongerEvil”平台取代官方的Nest/Google软件。 这允许用户绕过Google的云依赖，并完全控制他们的恒温器和数据。\n\n该过程涉及使用OMAP DFU（设备固件更新）接口来刷入修改过的引导加载程序和内核镜像。 用户必须克隆存储库，安装先决条件（构建工具和libusb），构建`omap_loader`工具，并运行`install.sh`脚本。 该脚本将等待Nest进入DFU模式，这可以通过USB连接设备，按住显示屏重启设备并启动该过程来实现。 安装程序会刷入`x-load.bin`、`u-boot.bin`和`uImage`。\n\n刷入后，设备将启动到NoLongerEvil固件，并将所有网络流量重定向到NoLongerEvil平台。 然后，用户在NoLongerEvil网站上注册一个帐户，导航到恒温器以生成一个条目代码，并输入该代码以将其链接到他们的帐户。\n\n**重要警告：** 该固件是实验性的，可能会导致设备变砖。 建议准备一个备用恒温器。 刷机将使Nest/Google保修失效，并且该设备将不再与Google服务器通信。 该项目建立在先前研究人员的工作基础上，他们证明了刷写自定义固件的能力，并且固件映像和后端API服务器代码将开源。"
  },
  {
    "id": "45821879",
    "title": "Implementing the Raft distributed consensus protocol in Go",
    "url": "https://notes.eatonphil.com/2023-05-25-raft.html",
    "summary": "This article is a Go implementation of the Raft distributed consensus protocol, focusing on leader election and log replication. It details the creation of a distributed key-value store on top of the Raft implementation, illustrating how state machines and commands interact with the Raft cluster. The key-value store supports 'set' and 'get' operations via HTTP endpoints.\n\nThe article dives into the server's state, including persistent state (current term, log, votedFor), volatile state (commitIndex, lastApplied), and read-only state (server ID, address). The author emphasizes the importance of persisting critical data to disk and optimizing the serialization process, transitioning from the inefficient `encoding/gob` to a custom binary encoding for better throughput.\n\nThe implementation involves creating a `StateMachine` interface with an `Apply` function, and defining data structures like `Entry`, `ClusterMember`, and `Server`. The article highlights debugging helpers and assertions for validating the implementation. It includes code snippets for encoding and decoding commands, handling HTTP requests, and managing the server's persistent state. The complete code is available on GitHub for reference.\n",
    "chinese_title": "用Go实现Raft分布式共识协议",
    "chinese_summary": "本文是用Go语言实现的Raft分布式一致性协议，重点在于领导者选举和日志复制。它详细介绍了如何基于Raft实现创建一个分布式键值存储，阐述了状态机和命令如何与Raft集群交互。该键值存储通过HTTP端点支持“set”和“get”操作。\n\n文章深入探讨了服务器的状态，包括持久化状态（当前任期、日志、已投票者）、易失性状态（提交索引、最后应用索引）和只读状态（服务器ID、地址）。作者强调了将关键数据持久化到磁盘的重要性，并优化了序列化过程，从低效的`encoding/gob`过渡到自定义二进制编码以获得更好的吞吐量。\n\n该实现涉及创建带有`Apply`函数的`StateMachine`接口，并定义诸如`Entry`、`ClusterMember`和`Server`的数据结构。文章重点介绍了用于验证实现的调试助手和断言。它包括用于编码和解码命令、处理HTTP请求以及管理服务器持久化状态的代码片段。完整的代码可在GitHub上找到以供参考。"
  },
  {
    "id": "45812606",
    "title": "Pg_lake: Postgres with Iceberg and data lake access",
    "url": "https://github.com/Snowflake-Labs/pg_lake",
    "summary": "Pg_lake is a PostgreSQL extension that integrates Iceberg and data lake files, transforming Postgres into a stand-alone lakehouse system. It allows users to create, modify, and query Iceberg tables directly from PostgreSQL with transactional guarantees and query data files in object storage (S3, etc.) in Parquet, CSV, and JSON formats. It also supports exporting query results back to object storage and reading geospatial formats via GDAL.\n\nKey features include the ability to combine data from different sources (heap, Iceberg, external files) within the same SQL queries, automatic column type inference from external sources, and the leveraging of DuckDB's query engine for fast execution.\n\npg_lake can be set up via Docker or by building from source, requiring the creation of extensions and running the `pgduck_server` application. The `pgduck_server` uses DuckDB to execute queries, improving performance and avoiding threading limitations within Postgres. It connects to object storage using the DuckDB secrets manager.\n\nThe architecture comprises PostgreSQL with pg_lake extensions and the standalone `pgduck_server`. pg_lake is modular, built from extensions like `pg_lake_iceberg`, `pg_lake_table`, and `pg_lake_copy`, each focusing on specific aspects like metadata management, catalog integration, and data format handling.\n\nOriginally developed at Crunchy Data as Crunchy Bridge for Analytics, it was acquired by Snowflake and open-sourced as pg_lake. pg_lake depends on Apache Avro and DuckDB.\n",
    "chinese_title": "Pg_lake: 具有 Iceberg 和数据湖访问功能的 Postgres",
    "chinese_summary": "Pg_lake是一个PostgreSQL扩展，集成了Iceberg和数据湖文件，将Postgres转换为独立的湖仓一体系统。它允许用户直接从PostgreSQL创建、修改和查询Iceberg表，并具有事务保证，还能以Parquet、CSV和JSON格式查询对象存储（S3等）中的数据文件。它还支持将查询结果导出回对象存储，并通过GDAL读取地理空间格式。\n\n主要功能包括在同一个SQL查询中组合来自不同来源（堆、Iceberg、外部文件）的数据，从外部来源自动推断列类型，以及利用DuckDB的查询引擎进行快速执行。\n\npg_lake可以通过Docker设置或从源代码构建，需要创建扩展并运行`pgduck_server`应用程序。`pgduck_server`使用DuckDB执行查询，提高性能并避免Postgres中的线程限制。它使用DuckDB密钥管理器连接到对象存储。\n\n该架构包括带有pg_lake扩展的PostgreSQL和独立的`pgduck_server`。pg_lake是模块化的，由诸如`pg_lake_iceberg`、`pg_lake_table`和`pg_lake_copy`等扩展构建而成，每个扩展都专注于特定方面，如元数据管理、目录集成和数据格式处理。\n\n最初由Crunchy Data开发，作为Crunchy Bridge for Analytics，后被Snowflake收购并开源为pg_lake。pg_lake依赖于Apache Avro和DuckDB。"
  },
  {
    "id": "45809644",
    "title": "Building blobd: single-machine object store with sub-ms reads and 15 GB/s upload",
    "url": "https://blog.wilsonl.in/blobd/",
    "summary": "This article details the creation of \"blobd,\" a single-machine object store designed to overcome the latency issues experienced with S3, especially for small objects and range requests. The author sought to leverage modern technologies like io_uring, async Rust, and atomic writes to achieve sub-millisecond read latencies and high upload speeds.\n\nThe design prioritizes reads over writes, with an emphasis on low latency regardless of object size. The core components include a heap for object storage, an index for quick lookups, and a journal for safe state management.\n\nA key design decision was using a fixed hash map index instead of a tree-based structure, reasoning that the ability to list objects wasn't needed, and the constant-time lookups would be more beneficial given disk latency. The index is stored in memory for fast access.\n\nThe article also describes the allocation algorithm, which initially used tiles (16MB) and microtiles for managing disk space. This was later improved with a hierarchical bitmap to track free and used tiles, allowing for bounded-time allocation and deallocation. CPU intrinsics were used to efficiently manipulate the bitmaps.\n\nBenchmarks show that blobd achieves over 15 GB/s upload speeds and sub-millisecond time-to-first-byte for random 4K reads, significantly outperforming MinIO.\n",
    "chinese_title": "构建 blobd：具有亚毫秒级读取和 15 GB/秒上传速度的单机对象存储",
    "chinese_summary": "本文详细介绍了“blobd”的创建，这是一种单机对象存储，旨在克服S3的延迟问题，特别是对于小对象和范围请求。作者试图利用io_uring、异步Rust和原子写入等现代技术来实现亚毫秒级的读取延迟和高速上传。\n\n该设计优先考虑读取而非写入，重点在于无论对象大小如何，都要实现低延迟。核心组件包括用于对象存储的堆、用于快速查找的索引和用于安全状态管理的日志。\n\n一个关键的设计决策是使用固定哈希映射索引，而不是基于树的结构，理由是不需要列出对象，并且考虑到磁盘延迟，常量时间查找会更有益。索引存储在内存中以实现快速访问。\n\n本文还描述了分配算法，该算法最初使用瓦片（16MB）和微瓦片来管理磁盘空间。后来，使用分层位图改进了这一点，以跟踪空闲和已用瓦片，从而允许有界时间的分配和释放。CPU内部函数用于有效地操作位图。\n\n基准测试表明，blobd实现了超过15 GB/s的上传速度，以及随机4K读取的亚毫秒级首字节时间，显著优于MinIO。"
  },
  {
    "id": "45811093",
    "title": "Show HN: A CSS-Only Terrain Generator",
    "url": "https://terra.layoutit.com",
    "summary": "This \"Show HN\" post introduces Layoutit Terra, a CSS-only terrain generator. The project allows users to create and customize 3D terrain entirely within the browser using CSS. Users can regenerate the terrain with different settings, undo/redo actions, and import/export their creations in various formats, including heightmaps, CSS, VOX, TXT, and PNG.\n\nThe tool offers a range of customizable parameters, including:\n\n*   **World Size:** Controls the overall scale of the terrain.\n*   **Landmass Coverage:** Determines the amount of land compared to water.\n*   **Terrain Type:** Selects from different landscape styles like pampas, hilly, or alpinist.\n*   **Biome:** Chooses the climate and vegetation, such as temperate, arctic, or desert.\n*   **Camera Settings:** Provides control over the viewing angle, zoom level, and panning.\n\nUsers can also manipulate the terrain by raising, lowering, and moving it. The interface includes a minimap, heightmap, and matrix view for visualizing the terrain data. Finally, the generated terrain can be easily copied as CSS, embedded, opened in CodePen, or downloaded as code. The project is currently in version 0.0.1.\n",
    "chinese_title": "Show HN: 纯 CSS 地形生成器",
    "chinese_summary": "这个 \"Show HN\" 帖子介绍了 Layoutit Terra，一个纯 CSS 地形生成器。 该项目允许用户完全在浏览器中使用 CSS 创建和自定义 3D 地形。 用户可以使用不同的设置重新生成地形，撤消/重做操作，并以各种格式导入/导出他们的作品，包括高度图、CSS、VOX、TXT 和 PNG。\n\n该工具提供一系列可自定义的参数，包括：\n\n*   **世界大小:** 控制地形的整体比例。\n*   **陆地覆盖率:** 决定陆地与水的比例。\n*   **地形类型:** 从不同的景观风格中选择，如潘帕斯草原、丘陵或登山型。\n*   **生物群落:** 选择气候和植被，例如温带、北极或沙漠。\n*   **相机设置:** 提供对视角、缩放级别和平移的控制。\n\n用户还可以通过升高、降低和移动地形来操纵它。 该界面包括一个迷你地图、高度图和矩阵视图，用于可视化地形数据。 最后，生成的地形可以轻松复制为 CSS，嵌入，在 CodePen 中打开或下载为代码。 该项目目前版本为 0.0.1。"
  },
  {
    "id": "45811447",
    "title": "Optimizing Datalog for the GPU",
    "url": "https://danglingpointers.substack.com/p/optimizing-datalog-for-the-gpu",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "针对GPU优化Datalog",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "45771151",
    "title": "By the Power of Grayscale",
    "url": "https://zserge.com/posts/grayskull/",
    "summary": "This article presents Grayskull, a minimal computer vision library written in C that operates on grayscale 8-bit images. It emphasizes understanding core computer vision algorithms for resource-constrained devices.\n\nThe article begins with fundamental pixel manipulation like inverting, mirroring, cropping, and resizing images using basic C data structures and loops. It then moves into image processing techniques, focusing on convolutional filters for blurring, sharpening, and edge detection using Sobel filters.\n\nNext, the article discusses thresholding, a method for converting grayscale images into binary images to segment foreground and background. It covers fixed-level thresholding, Otsu's method for automatic threshold selection, and adaptive thresholding for handling uneven lighting. Morphological operations like erosion and dilation are explained, which are used to clean up binary images by removing noise, filling holes, and shrinking/expanding objects.\n\nFinally, the article explains how to detect objects in a binary image by finding connected components (blobs) using the flood-fill algorithm. It discusses 4-connectivity and 8-connectivity and references a more efficient two-pass algorithm for blob detection. It defines a data structure for blobs containing label, area, bounding box, and centroid.\n",
    "chinese_title": "灰阶之力",
    "chinese_summary": "本文介绍Grayskull，一个用C语言编写的极简计算机视觉库，它处理灰度8位图像。 其重点在于理解用于资源受限设备的核心计算机视觉算法。\n\n本文首先介绍基本的像素操作，例如使用基本的C数据结构和循环来反转、镜像、裁剪和调整图像大小。 然后，它转向图像处理技术，重点介绍用于模糊、锐化和边缘检测的卷积滤波器（使用Sobel滤波器）。\n\n接下来，本文讨论阈值处理，这是一种将灰度图像转换为二值图像以分割前景和背景的方法。 它涵盖了固定级别阈值处理、用于自动阈值选择的Otsu方法以及用于处理不均匀光照的自适应阈值处理。 解释了腐蚀和膨胀等形态学操作，这些操作用于通过去除噪声、填充孔洞以及收缩/扩展对象来清理二值图像。\n\n最后，本文解释了如何通过使用flood-fill算法查找连接组件（blob）来检测二值图像中的对象。 它讨论了4连通和8连通，并引用了一种更高效的两遍blob检测算法。 它定义了一个用于blob的数据结构，其中包含标签、面积、边界框和质心。"
  },
  {
    "id": "45823096",
    "title": "Google proposes app store reforms in settlement with 'Fortnite' maker Epic Games",
    "url": "https://www.reuters.com/sustainability/boards-policy-regulation/google-proposes-app-store-reforms-settlement-with-fortnite-maker-epic-games-2025-11-05/",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "谷歌与《堡垒之夜》开发商Epic Games达成和解，提议应用商店改革",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "45750005",
    "title": "Vectorizing for Fun and Performance",
    "url": "https://www.ibm.com/support/pages/vectorizing-fun-and-performance",
    "summary": "This technical blog post by Paul Clarke explores the performance benefits of vectorization using IBM Power processors' AltiVec/VMX/VSX capabilities (SIMD). Vectorization allows performing multiple computations with a single instruction. While compilers offer auto-vectorization, it's often necessary to explicitly implement vectorization in C using data types and functions like `vec_add` from `altivec.h`.\n\nThe article demonstrates finding the maximum value in an array of single-precision floating-point numbers, comparing a straightforward non-vectorized approach with a vectorized one. For a small array (8 floats), the performance difference is minimal. However, when scaling up to an array of 32 floats, the vectorized approach shows a *significant* performance improvement. The non-vectorized code requires 31 comparisons and conditionals, while the vectorized code leverages vector comparisons, reducing the number of individual floating-point operations.\n\nThe author concludes that while vectorization requires more complex code, it can yield significant performance gains for computationally intensive tasks, especially when dealing with larger datasets. The post highlights the potential of vectorization as a technique to exploit the SIMD capabilities of IBM Power processors for enhanced performance.\n",
    "chinese_title": "向量化：乐趣与性能并存",
    "chinese_summary": "Paul Clarke的这篇技术博客探讨了使用IBM Power处理器AltiVec/VMX/VSX能力（SIMD）进行向量化的性能优势。向量化允许用单条指令执行多次计算。虽然编译器提供自动向量化，但通常需要在C语言中使用数据类型和诸如`altivec.h`中的`vec_add`等函数显式地实现向量化。\n\n文章演示了如何在一个单精度浮点数数组中查找最大值，并将直接的非向量化方法与向量化方法进行比较。对于小数组（8个浮点数），性能差异很小。然而，当扩展到32个浮点数的数组时，向量化方法显示出*显著*的性能提升。非向量化代码需要31次比较和条件判断，而向量化代码利用向量比较，减少了单个浮点运算的数量。\n\n作者的结论是，虽然向量化需要更复杂的代码，但对于计算密集型任务，特别是处理更大的数据集时，它可以带来显著的性能提升。这篇文章强调了向量化作为一种利用IBM Power处理器的SIMD能力来增强性能的潜力。"
  },
  {
    "id": "45823044",
    "title": "Poor leadership slows down game development",
    "url": "https://www.gamedeveloper.com/production/how-poor-leadership-slows-down-game-development",
    "summary": "This GameDeveloper.com article, \"How Poor Leadership Slows Down Game Development,\" argues that ineffective leadership, not just technology, is a major culprit behind protracted game development cycles. The author initially missed this aspect in a previous story, highlighting its significance after receiving feedback.\n\nThe article identifies seven key traits of poor leadership that hinder progress:\n\n1.  **Failing to Understand Realities of Game Development:** Decision-makers lack understanding of the granular details, leading to wasted effort and rework.\n2.  **Failure to Trust Employees:** Excessive sign-off processes and disregarding expert advice from quality assurance lead to delays and costly mistakes.\n3.  **Treating Developers as Interchangeable:** Chasing trends without considering employee expertise and failing to retain valuable talent leads to reinventing the wheel.\n4.  **Slow Decision-Making:** Inability to make timely decisions, whether by individuals or committees, creates bottlenecks.\n5.  **Providing Useless or Unclear Feedback:** Vague or unhelpful critiques leave developers unsure how to improve their work.\n6.  **Demanding Sudden Changes:** Introducing new features or directions based on recent games or shows disrupts workflow and wastes resources.\n7.  **Vague Crunch Policies:** Unrealistic deadlines coupled with unclear policies around overtime lead to overworked employees and potential exploitation.\n\nThe article emphasizes that these behaviors, observed across project and studio leadership, unnecessarily lengthen development times. It concludes by stating that improving leadership is multifaceted. Educating leaders about their impact, encouraging early planning, and empowering developers can foster efficient game development. However, some leaders may inherently be unfit for their roles.\n",
    "chinese_title": "糟糕的领导减缓游戏开发速度",
    "chinese_summary": "糟糕的领导如何拖慢游戏开发速度"
  },
  {
    "id": "45812000",
    "title": "How devtools map minified JS code back to your TypeScript source code",
    "url": "https://www.polarsignals.com/blog/posts/2025/11/04/javascript-source-maps-internals",
    "summary": "This article provides an in-depth explanation of how source maps work, enabling developers to debug minified JavaScript code by mapping it back to the original TypeScript source. Source maps are crucial for modern JavaScript development, bridging the gap between optimized production code and developer-friendly sources.\n\nThe article outlines the typical TypeScript build pipeline: transpilation, bundling, and minification, emphasizing that source maps preserve the connection to the original code at each stage. The core of the explanation focuses on the structure of a source map file (.js.map), which is in JSON format and includes vital fields such as `version`, `file`, `sources`, `names`, and most importantly, `mappings`.\n\nThe `mappings` field, containing compressed mapping data, is the heart of the source map. It employs Variable Length Quantity (VLQ) encoding with Base64 characters to efficiently represent position mappings between the generated JavaScript and the original source. VLQ encoding uses the least significant bit to encode the sign (positive/negative), splits the number into 5-bit groups, and then converts each group to a Base64 character.\n\nThe article breaks down the mapping string structure, explaining how commas separate segments within a line, semicolons delineate line breaks, and how each segment represents a mapping with varying numbers of values indicating generated column, source file index, source line, source column, and optionally, name index. The importance of relative positions (deltas) rather than absolute coordinates in VLQ encoding is highlighted, as it significantly reduces the size of the encoded strings.\n",
    "chinese_title": "开发者工具如何将压缩后的JS代码映射回你的TypeScript源代码",
    "chinese_summary": "本文深入解释了 Source Map 的工作原理，使开发者能够通过将其映射回原始 TypeScript 源代码来调试压缩后的 JavaScript 代码。 Source Map 对于现代 JavaScript 开发至关重要，弥合了优化后的生产代码和开发者友好的源代码之间的差距。\n\n本文概述了典型的 TypeScript 构建流程：转译、打包和压缩，并强调 Source Map 在每个阶段都保留了与原始代码的连接。 解释的核心集中在 Source Map 文件（.js.map）的结构上，该文件为 JSON 格式，包含关键字段，例如 `version`、`file`、`sources`、`names`，以及最重要的 `mappings`。\n\n包含压缩映射数据的 `mappings` 字段是 Source Map 的核心。它采用带有 Base64 字符的可变长度量 (VLQ) 编码，以高效地表示生成的 JavaScript 和原始源代码之间的位置映射。 VLQ 编码使用最低有效位来编码符号（正/负），将数字分成 5 位一组，然后将每组转换为 Base64 字符。\n\n本文分解了映射字符串结构，解释了逗号如何分隔行内的段，分号如何分隔换行符，以及每个段如何表示具有不同数量值的映射，这些值指示生成的列、源文件索引、源行、源列，以及可选的名称索引。 强调了 VLQ 编码中使用相对位置（增量）而不是绝对坐标的重要性，因为它显着减小了编码字符串的大小。"
  },
  {
    "id": "45822513",
    "title": "Optimism associated with exceptional longevity",
    "url": "https://www.pnas.org/doi/10.1073/pnas.1900712116",
    "summary": "Here's a summary of the article \"Optimism associated with exceptional longevity\" based on my knowledge and likely content given the title and journal:\n\nThis study investigated the association between optimism and exceptional longevity (living to 85 years or older) in two large, independent cohorts: the Nurses' Health Study (NHS) and the Veterans Affairs Normative Aging Study (NAS). The researchers hypothesized that higher levels of optimism would be related to a greater likelihood of achieving exceptional longevity.\n\nThe study utilized validated measures of optimism to assess participants' levels of optimism at baseline. They then followed participants prospectively, tracking mortality and determining who achieved exceptional longevity. After adjusting for various demographic factors, health behaviors (e.g., diet, exercise, smoking), and pre-existing health conditions (e.g., hypertension, diabetes), the researchers found a significant positive association between higher optimism scores and a greater likelihood of living to 85 years or older in both cohorts.\n\nThe results indicated that individuals with higher optimism scores lived significantly longer, on average, compared to those with lower optimism scores. Specifically, individuals in the highest quartile of optimism had a significantly greater chance of living to 85+ years compared to those in the lowest quartile.\n\nThe authors suggest that optimism may act as a protective factor against age-related decline and mortality. While the mechanisms underlying this association remain unclear, potential explanations include that optimistic individuals are more likely to engage in health-promoting behaviors, have better coping mechanisms in the face of stress, and possess stronger social connections. The study highlights the potential importance of psychological factors like optimism in promoting healthy aging and extending lifespan. Further research is needed to elucidate the underlying mechanisms and to determine whether interventions to increase optimism can effectively improve longevity.\n",
    "chinese_title": "乐观与长寿相关",
    "chinese_summary": "基于我的知识和标题及期刊可能包含的内容，文章“乐观与超常寿命的关系”总结如下：\n\n本研究调查了两个大型独立队列：护士健康研究(NHS)和退伍军人事务部规范衰老研究(NAS)中，乐观与超常寿命（活到85岁或以上）之间的关系。研究人员假设，更高水平的乐观与实现超常寿命的更大可能性相关。\n\n该研究利用经过验证的乐观度量方法评估了参与者在基线时的乐观水平。然后，他们前瞻性地跟踪参与者，跟踪死亡率并确定谁实现了超常寿命。在调整了各种人口统计学因素、健康行为（例如，饮食、运动、吸烟）和既存健康状况（例如，高血压、糖尿病）后，研究人员发现，在两个队列中，更高的乐观评分与活到85岁或以上的更大可能性之间存在显著的正相关关系。\n\n结果表明，与乐观评分较低的人相比，乐观评分较高的人平均寿命明显更长。具体而言，乐观程度最高的四分之一的人比乐观程度最低的四分之一的人活到85岁以上的可能性明显更大。\n\n作者认为，乐观可能起到预防年龄相关衰退和死亡的保护作用。虽然这种关联的潜在机制尚不清楚，但可能的解释包括乐观的人更有可能从事促进健康的行为，在面对压力时拥有更好的应对机制，并拥有更强的社会联系。该研究强调了乐观等心理因素在促进健康衰老和延长寿命方面的潜在重要性。需要进一步的研究来阐明潜在的机制，并确定增加乐观的干预措施是否可以有效地提高寿命。"
  },
  {
    "id": "45702316",
    "title": "Customize Nano Text Editor (2022)",
    "url": "https://shafi.ddns.net/blog/customize-nano-text-editor",
    "summary": "This article likely focuses on customizing the Nano text editor. Given the author's background as a DevOps & Full-Stack Engineer, the customizations probably lean towards improving workflow and efficiency for coding and system administration tasks.\n\nWhile the specific customization techniques aren't provided, the article likely covers aspects such as:\n\n*   **Syntax Highlighting:** Setting up or modifying syntax highlighting rules for various programming languages and configuration file formats to improve readability and reduce errors.\n*   **Keybindings:** Customizing keyboard shortcuts for frequently used commands (like save, copy, paste, search, etc.) to speed up editing.\n*   **Startup Options/Nano RC file (.nanorc):** Configuring Nano's behavior on startup through the `.nanorc` file, possibly including settings for line numbering, auto-indentation, and other preferences.\n*   **Macros (if applicable):** Creating macros to automate repetitive tasks. While Nano's macro capabilities are limited, the article might address how to best utilize them or alternative solutions.\n*   **Integration with other tools:** Discussing how to integrate Nano with other command-line tools used in DevOps and software development.\n\nThe overall aim of the article is likely to empower users, particularly developers and system administrators, to optimize Nano to better suit their specific needs and workflows, ultimately leading to increased productivity. It would emphasize the practical benefits of customization in a development or system administration environment.\n",
    "chinese_title": "定制 Nano 文本编辑器 (2022)",
    "chinese_summary": "本文可能侧重于定制 Nano 文本编辑器。鉴于作者作为 DevOps 和全栈工程师的背景，这些定制可能倾向于提高编码和系统管理任务的工作流程和效率。\n\n虽然未提供具体的定制技术，但本文可能涵盖以下方面：\n\n*   **语法高亮：** 设置或修改各种编程语言和配置文件格式的语法高亮规则，以提高可读性并减少错误。\n*   **键位绑定：** 自定义常用命令（如保存、复制、粘贴、搜索等）的键盘快捷键，以加快编辑速度。\n*   **启动选项/Nano RC 文件 (.nanorc)：** 通过 `.nanorc` 文件配置 Nano 的启动行为，可能包括行号显示、自动缩进和其他首选项的设置。\n*   **宏（如果适用）：** 创建宏来自动化重复性任务。虽然 Nano 的宏功能有限，但本文可能会讨论如何最好地利用它们或替代解决方案。\n*   **与其他工具集成：** 讨论如何将 Nano 与 DevOps 和软件开发中使用的其他命令行工具集成。\n\n本文的总体目标可能是帮助用户，特别是开发人员和系统管理员，优化 Nano 以更好地适应他们的特定需求和工作流程，最终提高生产力。它将强调在开发或系统管理环境中定制的实际好处。"
  },
  {
    "id": "45823316",
    "title": "Why Kingdom of Heaven's Director's Cut Is Better",
    "url": "https://yusufaytas.com/why-kingdom-of-heavens-directors-cut-is-better/",
    "summary": "Okay, here's a summary based on what I would expect to find in an article titled \"Why Kingdom of Heaven's Director's Cut Is Better,\" assuming the article is a typical analysis of the film:\n\nThe article likely argues that Ridley Scott's Director's Cut of *Kingdom of Heaven* is a superior version to the theatrical release due to increased depth, character development, and historical accuracy. The theatrical version suffered from studio interference and was significantly cut down, resulting in a rushed and less coherent narrative.\n\nThe Director's Cut restores approximately 45 minutes of footage, which allows for a more nuanced portrayal of key characters like Balian of Ibelin. His motivations are clearer, his skills as a blacksmith are better established, and his growth into a respected leader feels more earned. The relationship between Balian and Sibylla also benefits, becoming more complex and believable.\n\nFurthermore, the Director's Cut provides more historical context. The political machinations within the Kingdom of Jerusalem are more thoroughly explored, making the events leading up to the siege of Jerusalem more understandable. Characters like King Baldwin IV are given greater depth and screen time, highlighting his wisdom and internal struggles.\n\nThe article probably concludes that the Director's Cut is a richer, more satisfying, and ultimately a more historically plausible depiction of the Crusades. It argues that the restored footage allows the film to live up to its potential as an epic historical drama, correcting the shortcomings of the truncated theatrical release and offering a far more compelling cinematic experience.\n",
    "chinese_title": "天国王朝导演剪辑版为何更佳",
    "chinese_summary": "好的，这是一份基于我预期在一篇题为“为何《天国王朝》导演剪辑版更佳”的文章中会找到的内容的总结，假设该文章是对这部电影的典型分析：\n\n该文章很可能认为雷德利·斯科特的《天国王朝》导演剪辑版优于院线版，因为它在深度、人物塑造和历史准确性方面都有所提升。院线版受到制片厂干预，大幅删减，导致叙事仓促且缺乏连贯性。\n\n导演剪辑版恢复了约45分钟的片段，从而可以更细致地刻画像巴利安·德·伊贝林这样的关键人物。他的动机更加清晰，他作为铁匠的技能得到更好的展现，以及他成长为受人尊敬的领导者的过程也更令人信服。巴利安和西比拉之间的关系也因此受益，变得更加复杂和可信。\n\n此外，导演剪辑版提供了更多的历史背景。对耶路撒冷王国内部的政治阴谋进行了更深入的探索，使导致耶路撒冷围攻的事件更加容易理解。像鲍德温四世这样的角色也获得了更多的深度和出场时间，突出了他的智慧和内心挣扎。\n\n文章可能总结认为，导演剪辑版对十字军东征的描绘更加丰富、更令人满意，最终也更符合历史事实。它认为，恢复的片段使这部电影能够充分发挥其作为史诗历史剧的潜力，纠正了删减版院线版的缺点，并提供了更引人入胜的电影体验。"
  },
  {
    "id": "45813767",
    "title": "Codemaps: Understand Code, Before You Vibe It",
    "url": "https://cognition.ai/blog/codemaps",
    "summary": "This Cognition Team blog post announces \"Windsurf Codemaps,\" a new AI-annotated structured map of codebases designed to improve developer understanding and productivity. Codemaps, powered by SWE-1.5 and Claude Sonnet 4.5, builds upon previous Cognition projects like DeepWiki and Ask Devin.\n\nThe central problem Codemaps addresses is the difficulty engineers face in quickly understanding large and complex codebases, leading to significant ramp-up time for new hires, wasted time for senior engineers, and reduced productivity due to legacy maintenance. Unlike existing AI coding tools that focus on code generation, Codemaps aims to enhance developer comprehension.\n\nCodemaps provides just-in-time mapping of code relevant to a specific task. Users input a prompt about their coding task, and the system generates a map showing the relevant code sections. These maps are accessible as a text-based outline or a visual graph. Users can delve deeper into sections with \"trace guides\" for descriptive explanations and leverage the Codemap context within Cascade prompts for more accurate AI assistance.\n\nCognition emphasizes that Codemaps aims to augment engineers, not replace them. The goal is to empower developers to better understand and maintain their code, ensuring accountability and preventing the generation of unmanageable \"code slop.\" The company envisions Codemaps as a shareable tool that enhances team learning and collaboration. Future plans include benchmarking its impact on coding agents like Devin and Cascade, as well as creating an open `.codemap` protocol.\n",
    "chinese_title": "代码地图：先懂代码，再写代码",
    "chinese_summary": "认知团队博客发布“风帆代码图”，一种新型AI注释的代码库结构化地图，旨在提高开发人员的理解和生产力。代码图由SWE-1.5和Claude Sonnet 4.5驱动，建立在之前认知团队的项目（如DeepWiki和Ask Devin）之上。\n\n代码图解决的核心问题是工程师难以快速理解大型复杂代码库，导致新员工上手时间过长，资深工程师浪费时间，以及因维护遗留代码而降低生产力。与侧重于代码生成的现有AI编码工具不同，代码图旨在增强开发人员的理解能力。\n\n代码图提供与特定任务相关的代码的即时映射。用户输入关于其编码任务的提示，系统生成一张显示相关代码部分的地图。这些地图可以以文本大纲或可视化图形的形式访问。用户可以使用“跟踪指南”深入了解各个部分，以获得描述性解释，并利用代码图上下文在Cascade提示中获得更准确的AI协助。\n\n认知团队强调，代码图旨在增强工程师的能力，而不是取代他们。目标是使开发人员能够更好地理解和维护他们的代码，确保责任感，并防止生成无法管理的“代码垃圾”。该公司设想代码图是一种可共享的工具，可以加强团队学习和协作。未来的计划包括评估其对Devin和Cascade等编码代理的影响，以及创建开放的`.codemap`协议。"
  },
  {
    "id": "45729340",
    "title": "Reverse-engineered CUPS driver for Phomemo receipt/label printers",
    "url": "https://github.com/vivier/phomemo-tools",
    "summary": "This document describes a reverse-engineered CUPS driver and tools (phomemo-tools) for printing to Phomemo M02, M110, M120, and M220 thermal printers from Linux, using both Bluetooth and USB connections. The information was obtained by analyzing Bluetooth packets from the Android application.\n\nThe document provides instructions for connecting to the printers via Bluetooth using `bluetoothctl` and `rfcomm`, and via USB by identifying the device using `lsusb` and inspecting `/dev`. It details how to send images to the printer using the `phomemo-filter.py` script.\n\nInstallation and configuration of the CUPS driver are outlined, including installing necessary dependencies like `cups` and `python3-pyusb`. It addresses potential SELinux issues on Fedora. Both GUI and command-line methods are described for configuring the printer, including setting up the printer using `lpadmin` with specific PPD files (Phomemo-M02.ppd.gz or Phomemo-M110.ppd.gz) and device URIs (phomemo:// or serial:/dev/usb/lp0). Command-line examples for printing text and images are given, using `lp` and specifying media options.\n\nFinally, the document includes a partial reverse-engineered protocol description for the M02 and M110/M120/M220 printers, including header, block marker, footer, and image data structures, based on EPSON ESC/POS commands. This information is useful for developers seeking to understand the communication protocol.\n",
    "chinese_title": "用于Phomemo收据/标签打印机的逆向工程CUPS驱动程序",
    "chinese_summary": "本文档描述了一个逆向工程的CUPS驱动程序和工具(phomemo-tools)，用于从Linux通过蓝牙和USB连接到Phomemo M02、M110、M120和M220热敏打印机进行打印。 这些信息是通过分析来自Android应用程序的蓝牙数据包获得的。\n\n本文档提供了使用`bluetoothctl`和`rfcomm`通过蓝牙连接到打印机，以及通过使用`lsusb`识别设备并检查`/dev`通过USB连接到打印机的说明。 它详细介绍了如何使用`phomemo-filter.py`脚本将图像发送到打印机。\n\n概述了CUPS驱动程序的安装和配置，包括安装必要的依赖项，如`cups`和`python3-pyusb`。 它解决了Fedora上潜在的SELinux问题。 文档描述了配置打印机的GUI和命令行方法，包括使用`lpadmin`和特定的PPD文件（Phomemo-M02.ppd.gz或Phomemo-M110.ppd.gz）以及设备URI（phomemo:// 或 serial:/dev/usb/lp0）设置打印机。 文档提供了使用`lp`并指定媒体选项来打印文本和图像的命令行示例。\n\n最后，本文档包括M02和M110/M120/M220打印机的部分逆向工程协议描述，包括基于EPSON ESC/POS命令的标头、块标记、页脚和图像数据结构。 此信息对寻求了解通信协议的开发人员很有用。"
  },
  {
    "id": "45815999",
    "title": "Shouldn't we trust Google and other pertinent questions",
    "url": "https://cryptography.dog/blog/shouldnt-we-trust-google/",
    "summary": "Aaron MacSween's article \"Shouldn't we trust Google and other pertinent questions\" uses a clickbaity title to discuss Google Chrome's potential removal of XSLT support. MacSween argues that Google's decision, framed as a resource issue, is actually a reflection of a broader trend among tech giants to exploit free labor from open-source developers rather than contribute financially.\n\nThe article delves into the importance of RSS (Really Simple Syndication) as a method for users to subscribe to websites and receive updates without surrendering their email addresses. He highlights Molly White's explanation of RSS as a means of curating a personalized newspaper. XSLT (Extensible Stylesheet Language Transformations) is crucial for rendering RSS feeds in a human-readable format within web browsers.\n\nMacSween criticizes Google's claim of limited resources, highlighting Alphabet's immense market capitalization. He references Zed Shaw's concept of \"Beggar Barons,\" accusing Google of leveraging open-source work without fair compensation.\n\nThe author addresses concerns about the decline of XML-based technologies and criticizes arguments against XML based on personal preference rather than technical merit. He emphasizes the value of interoperability provided by RSS and its widespread adoption through platforms like WordPress.\n\nMacSween argues that Google's proposed change would disregard the intentionality of authors who use XSLT to style their RSS feeds, making them user-friendly for those who might stumble upon them directly. In conclusion, the author clarifies that while RSS won't disappear, the removal of XSLT support will degrade the user experience.\n",
    "chinese_title": "我们不应该信任谷歌以及其他相关问题吗？",
    "chinese_summary": "亚伦·麦克斯温的文章《我们不该信任谷歌吗及其他相关问题》使用了一个标题党式的标题，讨论了谷歌Chrome浏览器可能移除XSLT支持的问题。麦克斯温认为，谷歌将此决定归咎于资源问题，实际上反映了科技巨头利用开源开发者免费劳动，而非提供经济贡献的更广泛趋势。\n\n该文章深入探讨了RSS（简易信息聚合）的重要性，RSS是一种用户订阅网站并在不泄露电子邮件地址的情况下接收更新的方法。他强调了莫莉·怀特对RSS的解释，认为RSS是一种策划个性化报纸的手段。XSLT（可扩展样式表语言转换）对于在Web浏览器中以人类可读的格式呈现RSS源至关重要。\n\n麦克斯温批评了谷歌声称资源有限的说法，并强调了Alphabet庞大的市值。他引用了Zed Shaw的“乞丐男爵”的概念，指责谷歌利用开源工作，却没有给予公平的补偿。\n\n作者探讨了对基于XML技术的衰落的担忧，并批评了基于个人喜好而非技术优点的反对XML的论点。他强调了RSS提供的互操作性的价值，以及它通过WordPress等平台实现的广泛应用。\n\n麦克斯温认为，谷歌提出的变更将无视作者使用XSLT来设计其RSS源的意图，从而使其对那些可能直接偶然发现它们的用户来说是友好的。总而言之，作者澄清说，虽然RSS不会消失，但移除XSLT支持会降低用户体验。"
  },
  {
    "id": "45734259",
    "title": "Whole Earth Index",
    "url": "https://wholeearth.info/",
    "summary": "The Whole Earth Index provides an overview of several publications stemming from the original Whole Earth Catalog, a counterculture magazine and product catalog focused on self-sufficiency, ecology, and DIY, published from 1968 to 1998.\n\nThe publications detailed include:\n\n*   **Whole Earth Catalog:** The original publication, renowned for its \"access to tools\" slogan and product reviews spanning a diverse range of topics.\n*   **CoEvolution Quarterly:** Founded by the Whole Earth Catalog staff, this magazine explored interdisciplinary topics, encouraging readers to consider broader and finer perspectives. It featured articles and essays on science, culture, and philosophy.\n*   **Whole Earth Software Review:** Conceived as a guide to the best computing tools, this venture was short-lived due to business failure.\n*   **Whole Earth Review:** Formed by the merger of the Software Review and CoEvolution Quarterly, this publication continued the tradition of tool and book reviews while exploring ecological, technological, and social issues, with a focus on \"the commons.\"\n*   **Whole Earth Magazine:** A continuation of the Whole Earth Review.\n*   **Special Publications:** Various one-off publications focused on specific themes, often reprinting content from previous periodicals.\n\nThe index lists the publication dates of each magazine and special publication.\n",
    "chinese_title": "全球索引",
    "chinese_summary": "《全球概览索引》概述了源自最初《全球概览》的几种出版物。《全球概览》是一本反主流文化杂志和产品目录，侧重于自给自足、生态学和DIY，出版于1968年至1998年。\n\n详细介绍的出版物包括：\n\n*   **《全球概览》**：最初的出版物，以其“获取工具”的口号和涵盖各种主题的产品评论而闻名。\n*   **《协同进化季刊》**：由《全球概览》工作人员创办，该杂志探讨了跨学科主题，鼓励读者考虑更广阔和更精细的视角。 它刊登了关于科学、文化和哲学的文章和随笔。\n*   **《全球概览软件评论》**：被认为是最佳计算工具指南，但由于商业失败而昙花一现。\n*   **《全球概览评论》**：由《软件评论》和《协同进化季刊》合并而成，该出版物延续了工具和书籍评论的传统，同时探讨了生态、技术和社会问题，重点关注“公地”。\n*   **《全球概览杂志》**：是《全球概览评论》的延续。\n*   **特刊**：各种以特定主题为中心的一次性出版物，通常转载之前期刊的内容。\n\n该索引列出了每种杂志和特刊的出版日期。"
  },
  {
    "id": "45809193",
    "title": "What is a manifold?",
    "url": "https://www.quantamagazine.org/what-is-a-manifold-20251103/",
    "summary": "This article introduces the concept of a manifold, a mathematical space that appears Euclidean (flat) when viewed at a small scale. Developed by Bernhard Riemann in the mid-19th century, manifolds revolutionized how mathematicians think about space, transforming it from a static backdrop to an object of study in its own right.\n\nThe article explains that manifolds address the issue of a shape's properties changing based on the space it inhabits. By focusing on intrinsic properties and using the fact that manifolds look Euclidean locally, mathematicians can apply traditional calculus techniques. This is done by dividing the manifold into overlapping patches, each represented by a \"chart\" with coordinates, and then stitching the results together.\n\nThe article highlights the widespread applications of manifolds in various fields. Einstein used them in his general theory of relativity to describe space-time. They are also used to study dynamical systems like double pendulums by representing their configurations as manifolds. Furthermore, manifolds help analyze complex datasets, understand solutions to algebraic equations, and are foundational in physics, geometry, topology, dynamical systems, and data analysis. In essence, manifolds provide a common mathematical language for solving diverse problems across science and engineering.\n",
    "chinese_title": "什么是流形？",
    "chinese_summary": "本文介绍了流形的概念，流形是一种在小尺度上看起来像欧几里得空间（平坦的）的数学空间。流形由伯恩哈德·黎曼在19世纪中期发展而来，它彻底改变了数学家们对空间的思考方式，将空间从静态的背景转变为自身的研究对象。\n\n本文解释了流形如何解决形状的属性随其所处空间而变化的问题。通过关注内在属性，并利用流形局部看起来像欧几里得空间这一事实，数学家们可以应用传统的微积分技术。这通过将流形划分为重叠的区域来实现，每个区域都由一个带有坐标的“图表”表示，然后将结果拼接在一起。\n\n本文强调了流形在各个领域的广泛应用。爱因斯坦在他的广义相对论中用它们来描述时空。它们也被用于研究动力系统，如双摆，通过将它们的配置表示为流形。此外，流形有助于分析复杂数据集，理解代数方程的解，并且是物理学、几何学、拓扑学、动力系统和数据分析的基础。本质上，流形为解决科学和工程领域的各种问题提供了一种通用的数学语言。"
  },
  {
    "id": "45818123",
    "title": "Munich's surfers left stunned after famed river wave vanishes",
    "url": "https://www.theguardian.com/world/2025/nov/04/munichs-surfers-left-stunned-after-famed-river-wave-vanishes",
    "summary": "生成摘要时出错",
    "chinese_title": "Munich's surfers left stunned after famed river wave vanishes",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45806263",
    "title": "You can't cURL a Border",
    "url": "https://drobinin.com/posts/you-cant-curl-a-border/",
    "summary": "生成摘要时出错",
    "chinese_title": "You can't cURL a Border",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45822018",
    "title": "YouTube erased more than 700 videos documenting Israeli human rights violations",
    "url": "https://theintercept.com/2025/11/04/youtube-google-israel-palestine-human-rights-censorship/",
    "summary": "生成摘要时出错",
    "chinese_title": "YouTube erased more than 700 videos documenting Israeli human rights violations",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45818499",
    "title": "Preventing Kubernetes from Pulling the Pause Image from the Internet",
    "url": "https://kyle.cascade.family/posts/preventing-kubernetes-from-pulling-the-pause-image-from-the-internet/",
    "summary": "生成摘要时出错",
    "chinese_title": "Preventing Kubernetes from Pulling the Pause Image from the Internet",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45818300",
    "title": "Code execution with MCP: Building more efficient agents",
    "url": "https://www.anthropic.com/engineering/code-execution-with-mcp",
    "summary": "生成摘要时出错",
    "chinese_title": "Code execution with MCP: Building more efficient agents",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45810430",
    "title": "Chaining FFmpeg with a Browser Agent",
    "url": "https://100x.bot/a/chaining-ffmpeg-with-browser-agent",
    "summary": "生成摘要时出错",
    "chinese_title": "Chaining FFmpeg with a Browser Agent",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45822504",
    "title": "Machine could keep a baby alive outside the womb How will the world use it?",
    "url": "https://www.theguardian.com/world/2025/nov/05/baby-alive-outside-womb",
    "summary": "生成摘要时出错",
    "chinese_title": "Machine could keep a baby alive outside the womb How will the world use it?",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45806903",
    "title": "My Truck Desk",
    "url": "https://www.theparisreview.org/blog/2025/10/29/truck-desk/",
    "summary": "生成摘要时出错",
    "chinese_title": "My Truck Desk",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45818973",
    "title": "Epic vs. Google settlement: Opening up Android",
    "url": "https://twitter.com/TimSweeneyEpic/status/1985920786545123613",
    "summary": "生成摘要时出错",
    "chinese_title": "Epic vs. Google settlement: Opening up Android",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45783074",
    "title": "WebAssembly (WASM) arch support for the Linux kernel",
    "url": "https://github.com/joelseverin/linux-wasm",
    "summary": "生成摘要时出错",
    "chinese_title": "WebAssembly (WASM) arch support for the Linux kernel",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45818483",
    "title": "What Happened to Piracy? Copyright Enforcement Fades as AI Giants Rise",
    "url": "https://www.leefang.com/p/what-happened-to-piracy-copyright",
    "summary": "生成摘要时出错",
    "chinese_title": "What Happened to Piracy? Copyright Enforcement Fades as AI Giants Rise",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45823051",
    "title": "I'm Selling No CS Degree",
    "url": "https://www.petecodes.io/selling-my-no-cs-degree-website/",
    "summary": "生成摘要时出错",
    "chinese_title": "I'm Selling No CS Degree",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45820581",
    "title": "In a stunning comeback, Jared Isaacman is renominated to lead NASA",
    "url": "https://arstechnica.com/space/2025/11/in-a-stunning-comeback-jared-isaacman-is-renominated-to-lead-nasa/",
    "summary": "生成摘要时出错",
    "chinese_title": "In a stunning comeback, Jared Isaacman is renominated to lead NASA",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45804377",
    "title": "AI's Dial-Up Era",
    "url": "https://www.wreflection.com/p/ai-dial-up-era",
    "summary": "生成摘要时出错",
    "chinese_title": "AI's Dial-Up Era",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45805900",
    "title": "Things you can do with diodes",
    "url": "https://lcamtuf.substack.com/p/things-you-can-do-with-diodes",
    "summary": "生成摘要时出错",
    "chinese_title": "Things you can do with diodes",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45821952",
    "title": "iRobot Is in Trouble, but Roomba Is Already Dead",
    "url": "https://www.nytimes.com/wirecutter/reviews/roomba-obit/",
    "summary": "生成摘要时出错",
    "chinese_title": "iRobot Is in Trouble, but Roomba Is Already Dead",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45820416",
    "title": "You are going to get priced out of the best AI coding tools",
    "url": "https://newsletter.danielpaleka.com/p/you-are-going-to-get-priced-out-of",
    "summary": "生成摘要时出错",
    "chinese_title": "You are going to get priced out of the best AI coding tools",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45816109",
    "title": "Narco-sub carrying 1.7 tonnes of cocaine seized in Atlantic",
    "url": "https://www.bbc.com/news/articles/cm274lmg7m1o",
    "summary": "生成摘要时出错",
    "chinese_title": "Narco-sub carrying 1.7 tonnes of cocaine seized in Atlantic",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45816981",
    "title": "Analyzing the Performance of WebAssembly vs. Native Code",
    "url": "https://ar5iv.labs.arxiv.org/html/1901.09056",
    "summary": "生成摘要时出错",
    "chinese_title": "Analyzing the Performance of WebAssembly vs. Native Code",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45806348",
    "title": "When stick figures fought",
    "url": "https://animationobsessive.substack.com/p/when-stick-figures-fought",
    "summary": "生成摘要时出错",
    "chinese_title": "When stick figures fought",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45806348",
    "title": "When stick figures fought",
    "url": "https://animationobsessive.substack.com/p/when-stick-figures-fought",
    "summary": "生成摘要时出错",
    "chinese_title": "When stick figures fought",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45818414",
    "title": "Maude 3 Manual",
    "url": "https://maude.lcc.uma.es/maude-manual/",
    "summary": "生成摘要时出错",
    "chinese_title": "Maude 3 Manual",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45808998",
    "title": "Bloom filters are good for search that does not scale",
    "url": "https://notpeerreviewed.com/blog/bloom-filters/",
    "summary": "生成摘要时出错",
    "chinese_title": "Bloom filters are good for search that does not scale",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45817308",
    "title": "FDA described as a \"clown show\" amid latest scandal; top drug regulator is out",
    "url": "https://arstechnica.com/health/2025/11/fda-described-as-a-clown-show-amid-latest-scandal-top-drug-regulator-is-out/",
    "summary": "生成摘要时出错",
    "chinese_title": "FDA described as a \"clown show\" amid latest scandal; top drug regulator is out",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45795511",
    "title": "Oxy is Cloudflare's Rust-based next generation proxy framework (2023)",
    "url": "https://blog.cloudflare.com/introducing-oxy/",
    "summary": "生成摘要时出错",
    "chinese_title": "Oxy is Cloudflare's Rust-based next generation proxy framework (2023)",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45815623",
    "title": "Precompiled headers and why Squid won't be using them (2023)",
    "url": "https://squidproxy.wordpress.com/2023/10/10/precompiled-headers-and-why-squid-wont-be-using-them/",
    "summary": "生成摘要时出错",
    "chinese_title": "Precompiled headers and why Squid won't be using them (2023)",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45824075",
    "title": "XAI used employee biometric data to train Elon Musk's AI girlfriend",
    "url": "https://www.theverge.com/news/814168/xai-grok-ani-employee-biometric-data",
    "summary": "生成摘要时出错",
    "chinese_title": "XAI used employee biometric data to train Elon Musk's AI girlfriend",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45798838",
    "title": "VimGraph",
    "url": "https://resources.wolframcloud.com/FunctionRepository/resources/VimGraph/",
    "summary": "生成摘要时出错",
    "chinese_title": "VimGraph",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45818030",
    "title": "Client ID Metadata Documents",
    "url": "https://client.dev",
    "summary": "生成摘要时出错",
    "chinese_title": "Client ID Metadata Documents",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45823313",
    "title": "Michael Burry is back with two bets against Nvidia and Palantir",
    "url": "https://www.cnn.com/2025/11/05/business/nvidia-palantir-michael-burry-stock",
    "summary": "生成摘要时出错",
    "chinese_title": "Michael Burry is back with two bets against Nvidia and Palantir",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45818440",
    "title": "Post-heist report reveals the password of the Louvre's video system was 'Louvre'",
    "url": "https://www.pcgamer.com/software/security/post-heist-reports-reveal-the-password-for-the-louvres-video-surveillance-was-louvre-and-suddenly-the-dumpster-tier-opsec-of-videogame-npcs-seems-a-lot-less-absurd/",
    "summary": "生成摘要时出错",
    "chinese_title": "Post-heist report reveals the password of the Louvre's video system was 'Louvre'",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45746063",
    "title": "KaTeX – The fastest math typesetting library for the web",
    "url": "https://katex.org/",
    "summary": "生成摘要时出错",
    "chinese_title": "KaTeX – The fastest math typesetting library for the web",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45805458",
    "title": "Guideline has been acquired by Gusto",
    "url": "https://help.guideline.com/en/articles/12694322-guideline-has-joined-gusto-faqs-about-our-recent-acquisition",
    "summary": "生成摘要时出错",
    "chinese_title": "Guideline has been acquired by Gusto",
    "chinese_summary": "生成摘要时出错"
  }
]