[
  {
    "id": "44435484",
    "title": "The Fed says this is a cube of $1M. They're off by half a million",
    "url": "https://calvin.sh/blog/fed-lie/",
    "summary": "The article humorously recounts the author's investigation into a \"million-dollar\" cube display at the Federal Reserve Bank of Chicago's Money Museum. Skeptical of the sign's claim that the cube contained exactly $1,000,000, the author attempted to count the stacks of bills but found it challenging. Frustrated by the lack of readily available tools for counting objects in images, the author created a simple web app called \"Dot Counter.\"\n\nUsing Dot Counter, the author meticulously counted the stacks of bills visible in a photo of the cube and calculated its value based on assumed bundles of 100 bills each. The result was a surprising $1,550,400, a whopping $550,400 more than claimed.\n\nThe article playfully explores various explanations for the discrepancy, considering scenarios like the cube being hollow or strategically filled to appear more valuable. It then delves into the difficulty of creating a true cube with US currency due to the bills' dimensions and proposes an alternative configuration.\n\nUltimately, the author concludes that the cube either contains $1 million, $1.55 million, or is an illusion. The main takeaway is a humorous demonstration of the importance of questioning claims and verifying information, even those presented by official institutions, using the author's newly developed Dot Counter. The author encourages readers to use the tool for their own counting needs.\n",
    "chinese_title": "美联储称这是一个价值一百万美元的立方体，他们算错了，差了五十万。",
    "chinese_summary": "作者幽默地讲述了其调查芝加哥联邦储备银行货币博物馆中“百万美元”立方体展示的经历。作者怀疑标牌上声称该立方体包含整整1,000,000美元的说法，试图清点钞票堆，但发现极具挑战性。由于缺乏现成的图像对象计数工具，作者创建了一个名为“Dot Counter”的简单Web应用程序。\n\n利用Dot Counter，作者仔细数了立方体照片中可见的钞票堆，并根据每捆100张钞票的假设计算了其价值。结果令人惊讶，为1,550,400美元，比声称的数额高出惊人的550,400美元。\n\n文章风趣地探讨了造成差异的各种解释，考虑了立方体是空心的，或是经过策略性填充以显得更有价值等情况。然后，文章深入探讨了由于钞票的尺寸，使用美国货币创建一个真正的立方体的难度，并提出了另一种配置方案。\n\n最终，作者得出结论，该立方体要么包含100万美元，要么包含155万美元，要么就是一个幻觉。主要的收获是以幽默的方式展示了质疑声明和验证信息的重要性，即使这些信息是由官方机构提供的，并且使用了作者新开发的Dot Counter。作者鼓励读者使用该工具来满足他们自己的计数需求。"
  },
  {
    "id": "44434062",
    "title": "Feasibility study of a mission to Sedna - Nuclear propulsion and solar sailing",
    "url": "https://arxiv.org/abs/2506.17732",
    "summary": "This 2025 arXiv paper, \"Feasibility study of a mission to Sedna -- Nuclear propulsion and advanced solar sailing concepts,\" explores the viability of reaching Sedna using advanced propulsion methods. The authors, Elena Ancona, Roman Ya. Kezerashvili, and Savino Longo, compare the Direct Fusion Drive (DFD) rocket engine and a solar sail utilizing thermal desorption.\n\nThe study proposes a one-way Earth-to-Sedna mission, with the DFD enabling orbit insertion and the solar sail envisioned for a flyby. It evaluates key parameters such as payload capacity, travel time, and potential scientific return for both propulsion systems. The DFD is modeled as a 1.6 MW system with constant thrust, while the solar sail incorporates thermal desorption and a Jupiter gravity assist.\n\nThe mission analysis is divided into four phases: departure, interplanetary acceleration, interplanetary coasting, and rendezvous. The timing is critical due to Sedna's 2075-2076 perihelion passage. The results suggest that the DFD could reach Sedna in approximately 10 years, with 1.5 years of thrusting. The solar sail, with Jupiter's assistance, could complete the journey in 7 years.\n\nThe paper also addresses the feasibility of accommodating science payloads, power availability, and communication constraints. The study offers a comparative analysis to aid in future deep-space mission planning.\n",
    "chinese_title": "探访赛德娜任务可行性研究 - 核动力推进与太阳帆",
    "chinese_summary": "2025年arXiv论文《前往赛德娜的任务可行性研究——核动力推进与先进太阳帆概念》探讨了使用先进推进方法抵达赛德娜的可行性。作者Elena Ancona、Roman Ya. Kezerashvili和Savino Longo对比了直接聚变驱动（DFD）火箭发动机和利用热脱附的太阳帆。\n\n该研究提出了一项单向地球到赛德娜的任务，其中DFD用于轨道插入，太阳帆则设想用于飞掠。它评估了有效载荷能力、旅行时间和两种推进系统的潜在科学回报等关键参数。DFD被建模为具有恒定推力的1.6兆瓦系统，而太阳帆则结合了热脱附和木星引力辅助。\n\n任务分析分为四个阶段：出发、行星际加速、行星际滑行和交会。由于赛德娜在2075-2076年接近近日点，因此时间安排至关重要。结果表明，DFD可以在大约10年内到达赛德娜，其中推进时间为1.5年。借助木星的辅助，太阳帆可以在7年内完成旅程。\n\n该论文还探讨了容纳科学载荷、电力可用性和通信约束的可行性。该研究提供了一项比较分析，以帮助未来的深空任务规划。"
  },
  {
    "id": "44433409",
    "title": "Show HN: Spegel, a Terminal Browser That Uses LLMs to Rewrite Webpages",
    "url": "https://simedw.com/2025/06/23/introducing-spegel/",
    "summary": "Spegel is a proof-of-concept terminal web browser that uses LLMs to rewrite webpages, rendering the result as markdown in the terminal. Developed as a weekend project and boosted by the release of Google's faster Gemini 2.5 Pro Lite, Spegel aims to provide personalized views of web content by adapting it to individual needs through custom prompts.\n\nThe core idea is to address the clutter and distractions present in modern websites when viewed in a terminal. Spegel fetches HTML, processes it through an LLM using user-defined prompts from a config file, and outputs markdown rendered via the Textual library. Users can create multiple \"views\" of a single page, such as simplifying content (ELI5) or highlighting key actions, with prompts adjustable during browsing sessions.\n\nThe author shares an example configuration for extracting essential parts of recipes, showcasing the ability to transform content to suit specific needs. The browser currently only supports GET requests, but future plans include handling forms and POST requests. While acknowledging the existence of other terminal browsers like Lynx and Browsh, Spegel differentiates itself by leveraging LLMs to tailor content more closely to the user's requirements.\n\nSpegel is available for installation via pip (`pip install spegel`) and requires a configuration file. The source code is available on GitHub for contributions.\n",
    "chinese_title": "Show HN: Spegel，一款使用LLM重写网页的终端浏览器",
    "chinese_summary": "Spegel：一个使用LLM重写网页并在终端中以Markdown渲染的概念验证终端Web浏览器。作为一个周末项目开发，并受到谷歌更快的Gemini 2.5 Pro Lite发布的推动，Spegel旨在通过自定义提示将其适配到个人需求，从而提供个性化的网页内容视图。\n\n其核心思想是解决在终端中查看现代网站时存在的混乱和干扰。 Spegel获取HTML，通过LLM使用用户在配置文件中定义的提示对其进行处理，并通过Textual库输出渲染的Markdown。 用户可以创建单个页面的多个“视图”，例如简化内容 (ELI5) 或突出显示关键操作，并且可以在浏览会话期间调整提示。\n\n作者分享了一个提取食谱基本部分的示例配置，展示了转换内容以适应特定需求的能力。 该浏览器目前仅支持GET请求，但未来的计划包括处理表单和POST请求。 虽然承认存在其他终端浏览器，如Lynx和Browsh，但Spegel通过利用LLM更紧密地根据用户需求定制内容而脱颖而出。\n\nSpegel可通过pip安装 (`pip install spegel`)，并且需要一个配置文件。 源代码可在GitHub上获取，欢迎贡献。"
  },
  {
    "id": "44433899",
    "title": "Experience converting a mathematical software package to C++20 modules [PDF]",
    "url": "https://arxiv.org/abs/2506.21654",
    "summary": "This arXiv paper, titled \"Experience converting a large mathematical software package written in C++ to C++20 modules,\" explores the process of migrating a substantial C++ mathematical software library, specifically deal.II (approximately 800,000 lines of code), to the C++20 modules system. The author, Wolfgang Bangerth, details a method for supporting both traditional header-based interfaces and the new module-based approach simultaneously.\n\nThe paper discusses the challenges encountered during the conversion, providing insights into how C++20 modules function in real-world scenarios. The author evaluates the module system based on technical metrics like compile time and human factors such as ease of use.\n\nThe study concludes that converting large C++ codebases to modules is feasible with a considerable effort. While compile times improved for the converted library itself, downstream projects showed no consistent trend in compile time changes. The paper concludes by offering long-term strategies for a broader transition of the mathematical software ecosystem to C++20 modules over the coming years. The work contributes practical experience and insights for developers considering adopting C++20 modules in large-scale projects.\n",
    "chinese_title": "将数学软件包转换为C++20模块的经验 [PDF]",
    "chinese_summary": "将大型C++数学软件包转换为C++20模块的经验\n        \n这篇arXiv论文，题为“将大型C++数学软件包转换为C++20模块的经验”，探讨了将一个重要的C++数学软件库，特别是deal.II（约80万行代码），迁移到C++20模块系统的过程。作者Wolfgang Bangerth详细介绍了一种同时支持传统基于头文件的接口和新的基于模块的方法。\n\n该论文讨论了转换过程中遇到的挑战，并深入了解了C++20模块在实际场景中的运作方式。作者基于编译时间和易用性等人为因素等技术指标评估了该模块系统。\n\n该研究的结论是，将大型C++代码库转换为模块是可行的，但需要付出相当大的努力。虽然转换后的库本身的编译时间有所改善，但下游项目在编译时间变化方面没有显示出一致的趋势。该论文最后提出了长期战略，以便在未来几年内将数学软件生态系统更广泛地过渡到C++20模块。这项工作为考虑在大型项目中采用C++20模块的开发人员贡献了实践经验和见解。"
  },
  {
    "id": "44403988",
    "title": "I built something that changed my friend group's social fabric",
    "url": "https://blog.danpetrolito.xyz/i-built-something-that-changed-my-friend-gro-social-fabric/",
    "summary": "In 2022, the author's friend group, scattered across the globe, struggled to stay connected and organize gaming sessions using a chaotic Signal group chat. To solve this, the author built a Discord bot that sends a notification to a designated text channel whenever someone joins a voice channel in their Discord server. This simple solution acted as a \"Batsignal,\" alerting everyone when someone was available to chat or play games.\n\nInitially met with mixed reactions, the bot quickly transformed the group's social dynamics. It reduced the need for constant coordination in the group chat and encouraged spontaneous social interaction, with many members joining Discord simply for a quick chat, reminiscent of old phone calls. The author tracked Discord usage over the years, revealing a consistent increase in activity, even among friends now in their 30s with family responsibilities. The bot facilitated quick check-ins and a sense of connection amidst busy lives.\n\nThe author now creates a \"Discord Wrapped\" for their annual Christmas party, sharing personalized stats and leaderboards to recap the year's online activity. Future plans include adding achievements, tracking time spent in Discord, and potentially creating an IoT device with color-coded lights to indicate when specific friends join Discord voice channels. The author is considering turning the device into a real product.\n",
    "chinese_title": "我做了个东西，改变了我们朋友圈的社交结构。",
    "chinese_summary": "2022年，作者的朋友们分散在世界各地，他们使用混乱的Signal群聊努力保持联系和组织游戏。为了解决这个问题，作者构建了一个Discord机器人，每当有人加入Discord服务器中的语音频道时，该机器人就会向指定的文本频道发送通知。这个简单的解决方案就像一个“蝙蝠信号”，提醒所有人何时有人可以聊天或玩游戏。\n\n最初，该机器人褒贬不一，但很快就改变了群体的社交动态。它减少了群聊中不断协调的需求，并鼓励了自发的社交互动，许多成员仅仅为了快速聊天而加入Discord，让人想起过去的电话。作者多年来追踪Discord的使用情况，发现活动量持续增加，即使是那些现在30多岁并有家庭责任的朋友也是如此。该机器人促进了快速的问候，并在忙碌的生活中提供了一种连接感。\n\n作者现在为他们的年度圣诞派对制作一个“Discord年度回顾”，分享个性化的统计数据和排行榜，以回顾一年的在线活动。未来的计划包括添加成就、跟踪在Discord中花费的时间，并可能创建一个带有颜色编码灯的物联网设备，以指示特定朋友何时加入Discord语音频道。作者正在考虑将该设备变成真正的产品。"
  },
  {
    "id": "44435910",
    "title": "Cua (YC X25) Is Hiring a Founding Engineer",
    "url": "https://www.ycombinator.com/companies/cua/jobs/dIskIB1-founding-engineer-cua-yc-x25",
    "summary": "Cua (YC X25), a company building infrastructure for AI agents to safely and scalably use computers and apps, is seeking a Founding Engineer to join their team. They provide an open-source framework, a cloud container platform for agent execution, and a blueprint for production-grade agent systems.\n\nThe Founding Engineer will be responsible for shipping infrastructure to power agent workloads, shaping their open-source community, contributing to product strategy, and advocating for the platform.\n\nIdeal candidates will have a strong systems background, experience scaling infrastructure and securing containers, and a passion for designing simple APIs. Requirements include a BS in CS (or equivalent) with 2+ years of backend systems experience (Python, Go, TypeScript, or Rust), familiarity with LLM-generated code, and the ability to navigate ambiguity. Bonus points for Docker/KVM/OS virtualization experience, multi-cloud experience, PostgreSQL optimization experience, and open-source contributions.\n\nThe position is located in San Francisco (hybrid preferred, remote-friendly) and offers a $100K-$150K base salary with 0.5%-0.75% equity. Cua is backed by Y Combinator and top investors. Applicants should include their GitHub profile and a note about a challenging infra problem they solved, with a bonus for contributing to the Cua open-source project.\n",
    "chinese_title": "Cua (YC X25) 招聘创始工程师",
    "chinese_summary": "Cua (YC X25) 招聘创始工程师，该公司致力于构建人工智能代理安全且可扩展地使用计算机和应用程序的基础设施。他们提供开源框架、用于代理执行的云容器平台以及生产级代理系统的蓝图。\n\n创始工程师将负责交付驱动代理工作负载的基础设施、塑造开源社区、贡献于产品战略并推广该平台。\n\n理想的候选人应具有扎实的系统背景、扩展基础设施和保护容器的经验，以及对设计简单API的热情。要求包括计算机科学学士学位（或同等学历），以及2年以上后端系统经验（Python、Go、TypeScript或Rust）、熟悉LLM生成的代码以及应对不确定性的能力。Docker/KVM/OS虚拟化经验、多云经验、PostgreSQL优化经验以及开源贡献将是加分项。\n\n该职位位于旧金山（混合办公优先，支持远程办公），基本工资为 10 万美元至 15 万美元，股权为 0.5% 至 0.75%。Cua 获得了 Y Combinator 和顶级投资者的支持。申请人应提供他们的 GitHub 个人资料，并附注他们解决的具有挑战性的基础设施问题，为 Cua 开源项目做出贡献者优先。"
  },
  {
    "id": "44433386",
    "title": "Show HN: Jobs by Referral: Find jobs in your LinkedIn network",
    "url": "https://jobsbyreferral.com/",
    "summary": "JobsByReferral is a tool that helps users find job openings within their professional network on platforms like LinkedIn. It analyzes a user's connections data to identify companies where they have contacts, increasing their chances of securing a referral and landing an interview.\n\nThe process involves three steps: first, users must provide their connections data, either by uploading a data archive (like a ZIP file from LinkedIn) or a CSV file adhering to a specific format (First Name, Last Name, Company, Position are required). Second, the tool analyzes the network to identify companies with the most connections. Third, users can search for relevant jobs and view the results, leveraging their connections for referrals.\n\nThe platform provides a demo CSV file for users who want to test the service before uploading their own data, allowing them to experience the functionality and see how it works.\n",
    "chinese_title": "Show HN：人脉求职：在领英人脉中找工作",
    "chinese_summary": "JobsByReferral是一个工具，帮助用户在LinkedIn等平台上，通过职业人脉网络寻找职位空缺。它分析用户的联系人数据，识别出用户拥有人脉的公司，从而增加他们获得内推和面试的机会。\n\n该过程包括三个步骤：首先，用户必须提供他们的联系人数据，可以通过上传数据存档（例如LinkedIn的ZIP文件）或符合特定格式的CSV文件（需要包括名字、姓氏、公司、职位）来实现。其次，该工具会分析人脉网络，找出拥有最多联系人的公司。第三，用户可以搜索相关职位并查看结果，利用他们的人脉进行内推。\n\n该平台提供了一个演示CSV文件，供希望在上传自己的数据之前测试服务的用户使用，让他们体验该功能并了解其工作原理。"
  },
  {
    "id": "44435211",
    "title": "Show HN: HackerNewt - Breadth-first exploring HN client for iOS",
    "url": "https://apps.apple.com/us/app/hackernewt-for-hacker-news/id6448201970",
    "summary": "HackerNewt is an iOS app designed to improve the Hacker News reading experience. It presents comments in a breadth-first manner, avoiding the narrowing comment widths of traditional interfaces. This allows users to easily navigate discussions, maintain context, and skip uninterested subtrees via swiping and scrolling.\n\nKey features include custom boards, search (including in-thread search), anchors, a reading list, and recent items. The app is free but offers in-app purchases for tips and a premium version.\n\nUser reviews are mostly positive, averaging 4.6 out of 5 stars. One recent negative review citing the app not loading was quickly resolved by the developer, who also responded helpfully to a user unsure how to comment on posts.\n\nThe developer claims no data is collected by the app. It requires iOS 15.0 or later and is compatible with iPhones and iPod Touches. The app is categorized as News and is rated 17+ due to potential exposure to mature themes, profanity, and drug/alcohol references.\n",
    "chinese_title": "Show HN: HackerNewt - iOS 平台的广度优先 HN 探索客户端",
    "chinese_summary": "HackerNewt：一款旨在改善 Hacker News 阅读体验的 iOS 应用。它以广度优先的方式呈现评论，避免了传统界面中评论宽度逐渐变窄的问题。用户可以通过滑动和滚动轻松浏览讨论，保持上下文，并跳过不感兴趣的子树。\n\n主要功能包括自定义版块、搜索（包括线程内搜索）、锚点、阅读列表和最近项目。该应用免费，但提供应用内购买，用于打赏和购买高级版本。\n\n用户评价大多为正面，平均评分为 4.6 星（满分 5 星）。最近一条负面评论指出该应用无法加载，开发者迅速解决了该问题，并且还积极回应了一位不确定如何在帖子中发表评论的用户。\n\n开发者声称该应用不收集任何数据。它需要 iOS 15.0 或更高版本，并且与 iPhone 和 iPod Touch 兼容。该应用被归类为新闻类，并且由于可能接触到成人主题、亵渎性语言以及毒品/酒精内容，因此评级为 17+。"
  },
  {
    "id": "44397921",
    "title": "When Did Nature Burst into Vivid Color?",
    "url": "https://www.quantamagazine.org/when-did-nature-burst-into-vivid-color-20250627/",
    "summary": "This Quanta Magazine article, \"When Did Nature Burst into Vivid Color?\" explores the evolutionary timeline of color vision and colorful signals in the natural world. Evolutionary biologists Zachary Emberts and John Wiens reconstructed 500 million years of evolutionary history, combining fossil records and phylogenetic trees, to investigate whether color vision evolved before or after the colorful signals (e.g., bright fruits, flowers, mating colors).\n\nTheir research suggests that color vision evolved earlier than colorful signals, likely between 400 and 500 million years ago, in both arthropods and backboned animals. The emergence of colorful signals followed: distinctive colors appeared around 300 million years ago in fruits and seeds, followed by colorful flowers, warning colors (around 130 million years ago), and finally sexual signaling in animals (around 100 million years ago).\n\nThe article acknowledges the inherent uncertainties in reconstructing such deep evolutionary history, noting that colors don't readily fossilize and evolutionary trees are inherently speculative. Despite these limitations, the study offers valuable insights into the evolutionary relationship between color vision and the signals that rely on it, suggesting that color vision initially served a different purpose before its role in detecting these signals. The scientists propose early uses may have included recognizing objects, navigation, or even improving vision in low-light aquatic environments.\n",
    "chinese_title": "大自然何时焕发绚丽色彩？",
    "chinese_summary": "《量子杂志》文章“自然界何时迸发出鲜艳的色彩？”探讨了自然界中色彩视觉和鲜艳色彩信号的进化时间线。进化生物学家 Zachary Emberts 和 John Wiens 重建了 5 亿年的进化历史，结合化石记录和系统发育树，以研究色彩视觉是在鲜艳色彩信号（例如，鲜亮的水果、花朵、求偶色）之前还是之后进化而来。\n\n他们的研究表明，色彩视觉的进化早于鲜艳色彩信号，可能在 4 亿到 5 亿年前，发生在节肢动物和脊椎动物中。鲜艳色彩信号的出现紧随其后：大约在 3 亿年前，水果和种子中出现了独特的颜色，随后是色彩鲜艳的花朵、警戒色（大约在 1.3 亿年前），最后是动物的性信号（大约在 1 亿年前）。\n\n文章承认了重建如此久远的进化历史所固有的不确定性，指出颜色不易形成化石，且进化树本质上具有推测性。尽管存在这些局限性，该研究仍为色彩视觉和依赖于它的信号之间的进化关系提供了宝贵的见解，表明色彩视觉最初可能具有不同的用途，之后才在检测这些信号中发挥作用。科学家们提出，早期的用途可能包括识别物体、导航，甚至改善在弱光水生环境中的视觉。"
  },
  {
    "id": "44431178",
    "title": "OpenFLOW – Quickly make beautiful infrastructure diagrams local to your machine",
    "url": "https://github.com/stan-smith/OpenFLOW",
    "summary": "OpenFLOW is an open-source Progressive Web App (PWA) built with React and the Isoflow library that allows users to quickly create aesthetically pleasing isometric infrastructure diagrams directly within their web browser. It prioritizes user privacy by storing all data locally, and offers offline support for uninterrupted work.\n\nKey features include isometric diagramming, auto-save functionality (every 5 seconds), import/export of diagrams as JSON files, and comprehensive offline support. Users can add and connect components via drag-and-drop, customize their appearance, and easily navigate the canvas.\n\nDiagrams are automatically saved to the browser's local storage. The application also provides options for quick saving, saving copies, loading existing diagrams, and managing storage space.\n\nTo run OpenFLOW locally, users clone the GitHub repository, install dependencies with npm, and start the development server. Production builds can be created for deployment to static hosting services like GitHub Pages, Netlify, and AWS S3. HTTPS is required for PWA features.\n\nThe app relies on React for the UI, TypeScript for type safety, and the Isoflow library for isometric diagramming. Contributions are welcome, and the project is released under the Unlicense license. The Isoflow library itself is released under the MIT License.\n",
    "chinese_title": "OpenFLOW – 在本地快速制作精美的基础设施图表",
    "chinese_summary": "OpenFLOW是一款开源的渐进式Web应用(PWA)，使用React和Isoflow库构建，允许用户直接在Web浏览器中快速创建美观的等距基础设施图。它优先考虑用户隐私，将所有数据存储在本地，并提供离线支持以保证工作不中断。\n\n主要功能包括等距图绘制、自动保存功能（每5秒一次）、将图表导入/导出为JSON文件以及全面的离线支持。用户可以通过拖放添加和连接组件，自定义其外观，并轻松导航画布。\n\n图表会自动保存到浏览器的本地存储中。该应用程序还提供快速保存、保存副本、加载现有图表和管理存储空间等选项。\n\n要在本地运行OpenFLOW，用户需要克隆GitHub存储库，使用npm安装依赖项，然后启动开发服务器。可以创建生产版本，以便部署到静态托管服务，例如GitHub Pages、Netlify和AWS S3。 PWA功能需要HTTPS。\n\n该应用依赖于React来实现UI，TypeScript来实现类型安全，以及Isoflow库来实现等距图绘制。 欢迎贡献，该项目根据Unlicense许可发布。 Isoflow库本身根据MIT许可证发布。"
  },
  {
    "id": "44433429",
    "title": "Show HN: I built the tool I wished existed for moving Stripe between countries",
    "url": "https://www.stripemove.com/",
    "summary": "Stripe Move is a tool designed to solve the problem of migrating Stripe accounts between countries, a process that can be complex and disruptive to businesses. Switching Stripe accounts typically involves manual processes like recreating subscriptions, updating payment methods, and handling webhook configurations, potentially leading to customer churn and revenue loss.\n\nStripe Move automates much of this process, allowing businesses to switch to a new Stripe account in a different country without interrupting their operations. It handles tasks such as migrating customer data, subscriptions, payment methods, and product information, ensuring a smooth transition.\n\nThe key benefit is the elimination of manual data transfer and the reduction of potential errors, ultimately minimizing customer disruption and preventing revenue loss during the migration. By simplifying the Stripe migration process, Stripe Move aims to enable businesses to expand internationally or restructure their operations more easily, without the fear of complicated payment system transitions. In essence, it's a streamlined solution for switching Stripe accounts while preserving existing customer relationships and subscription models.\n",
    "chinese_title": "Show HN: 我做了个我一直想用的Stripe跨国迁移工具",
    "chinese_summary": "Stripe Move旨在解决Stripe账户跨国迁移的难题，这一过程对企业来说可能既复杂又具破坏性。切换Stripe账户通常涉及手动流程，如重新创建订阅、更新支付方式以及处理Webhook配置，这可能导致客户流失和收入损失。\n\nStripe Move能够自动化处理大部分流程，使企业能够在不同国家切换到新的Stripe账户，而不会中断其运营。它可以处理诸如迁移客户数据、订阅、支付方式和产品信息等任务，从而确保平稳过渡。\n\n其主要优势在于消除了手动数据传输并减少了潜在错误，最终最大限度地减少了客户中断，并在迁移期间防止收入损失。通过简化Stripe迁移过程，Stripe Move旨在使企业能够更轻松地进行国际扩张或重组其运营，而无需担心复杂的支付系统转换。 本质上，它是一种精简的解决方案，用于切换Stripe账户，同时保留现有的客户关系和订阅模式。"
  },
  {
    "id": "44433843",
    "title": "Aesop in Words of One Syllable",
    "url": "https://blog.pgdp.net/2025/07/01/aesop-in-words-of-one-syllable/",
    "summary": "This article discusses \"Æsop's Fables in Words of One Syllable,\" a unique 19th-century edition of Aesop's fables designed for children. It highlights the shift in children's literature from purely moral instruction to incorporating imagination. The article explains that while the historical Aesop's existence is debated, his fables have been consistently popular and influential, evolving from adult reading material to illustrated children's books.\n\nThis specific edition stands out because it's written almost entirely using one-syllable words, part of a series by Mary Godolphin (Lucy Aikin) aimed at making reading easier for children. The 1895 edition contains 99 fables, including well-known tales like \"The Boy Who Cried Wolf\" and \"The Fox and the Grapes,\" though some, like \"The Tortoise and the Hare,\" are absent. The article acknowledges the work of Distributed Proofreaders and Project Gutenberg for making this edition accessible.\n",
    "chinese_title": "伊索寓言单音节版",
    "chinese_summary": "本文探讨了19世纪专为儿童设计的独特版本的伊索寓言《单音节伊索寓言》。它突出了儿童文学从纯粹的道德教诲向融入想象力的转变。文章解释说，虽然历史上伊索是否存在尚有争议，但他的寓言一直广受欢迎且具有影响力，从成人读物演变为插图儿童读物。\n\n这个特别版本与众不同之处在于，它几乎完全使用单音节词编写，是玛丽·戈多尔芬（露西·艾金）旨在使儿童更容易阅读的系列作品的一部分。1895年版收录了99个寓言故事，包括“狼来了”和“狐狸与葡萄”等著名故事，尽管“龟兔赛跑”等一些故事缺失。文章感谢Distributed Proofreaders和Project Gutenberg为使这个版本易于访问所做的工作。"
  },
  {
    "id": "44403547",
    "title": "Graph Theory Applications in Video Games",
    "url": "https://utk.claranguyen.me/talks.php?id=videogames",
    "summary": "This article, \"Graph Theory Applications in Video Games\" by Clara Nguyễn, explores practical applications of graph theory in video game development. It covers various aspects, starting with the fundamentals of how graphs are used in 3D graphics, including vertices, edges, and triangle-based rendering with concepts like back-face culling and drawing modes (Triangle List, Strip, and Fan).\n\nA significant portion focuses on race games and lap counting. The article proposes using a \"checkpoint\" system that forms a Hamiltonian Circuit, where players must pass through all checkpoints to complete a lap. It demonstrates how representing the racetrack as a graph simplifies distance calculations between players by transforming a 2D problem into a 1D subtraction.\n\nThe article critiques the \"Ultra-Shortcut\" exploit in Mario Kart Wii, highlighting how its flawed checkpoint system allows players to skip significant portions of the track. This underscores the importance of using graph theory principles to ensure proper lap completion and prevent exploits.\n\nFinally, the article delves into maze generation using the Disjoint-Set data structure and Union-Find algorithm. It explains how initially treating each cell as a separate set and then using \"union\" operations to connect cells (breaking down walls) can efficiently generate complex mazes, forming a minimum spanning tree structure. The \"find\" operation optimization is hinted at for later discussion.  It emphasizes that mazes can be represented as graphs and solved using algorithms like DFS and BFS.\n",
    "chinese_title": "图论在电子游戏中的应用",
    "chinese_summary": "克拉拉·阮的《图论在视频游戏中的应用》一文探讨了图论在视频游戏开发中的实际应用。文章涵盖了各个方面，首先介绍了图在3D图形中的基本应用，包括顶点、边以及基于三角形的渲染，如背面剔除和绘制模式（三角形列表、条带和扇形）。\n\n文章的很大一部分重点是赛车游戏和圈数计算。文章提出使用形成哈密顿回路的“检查点”系统，玩家必须通过所有检查点才能完成一圈。文章展示了如何将赛道表示为图，通过将2D问题转化为1D减法，简化玩家之间的距离计算。\n\n文章批判了《马里奥赛车Wii》中的“超级捷径”漏洞，强调了其有缺陷的检查点系统如何允许玩家跳过赛道的重要部分。这突显了使用图论原理确保正确完成圈数并防止漏洞的重要性。\n\n最后，文章深入研究了使用不相交集数据结构和并查集算法生成迷宫的方法。文章解释了如何最初将每个单元格视为一个单独的集合，然后使用“并”操作连接单元格（打破墙壁）可以有效地生成复杂的迷宫，形成最小生成树结构。暗示了“查”操作优化将在稍后讨论。文章强调迷宫可以表示为图，并可以使用DFS和BFS等算法解决。"
  },
  {
    "id": "44425461",
    "title": "I write type-safe generic data structures in C",
    "url": "https://danielchasehooper.com/posts/typechecked-generic-c-data-structures/",
    "summary": "Daniel Hooper's article explores type-safe generic data structures in C, focusing on a novel approach using unions to associate type information with generic structures. The article uses a linked list as an example and contrasts this method with common C generic programming techniques, outlining their limitations and advantages.\n\nHere's a breakdown of the presented techniques:\n\n*   **Generics Level 0 (Generic Headers):** Involves using macros to define types within a header file, which is then included multiple times for each specific type. While generic and type-safe, this approach suffers from code bloat, difficulty in locating definitions, and the need for type-prefixed function names.\n*   **Generics Level 1 (void \\*):** Uses `void *` to represent generic data. It lacks type safety but is a simple approach. Additionally, separating the node from its data requires multiple allocations, which can have performance implications.\n*   **Generics Level 2 (Inline Storage):** Improves upon `void *` by storing data directly within the node using a flexible array member. This reduces memory overhead and improves cache performance but necessitates passing data sizes explicitly.\n*   **Generics Level 3 (Type Checking with Unions):** The core of the article presents a type-safe solution. It uses a union containing a ListNode pointer and a parameterized-type pointer (`payload`). Macros leverage the ternary operator to enforce type matching during function calls, triggering compile-time errors for type mismatches and avoiding runtime typecasting. Furthermore, this method can be utilized with structures containing multiple associated types.\nThe article concludes with examples on handling type returns and compiler issues with struct matching. It emphasizes the adaptability of this technique to various data structures, including hash maps.\n",
    "chinese_title": "我用C语言编写类型安全的泛型数据结构。",
    "chinese_summary": "Daniel Hooper的文章探讨了C语言中类型安全的泛型数据结构，重点介绍了一种使用联合体将类型信息与泛型结构关联起来的新方法。文章以链表为例，将此方法与常见的C语言泛型编程技术进行了对比，概述了它们的局限性和优点。\n\n以下是所介绍技术的分解：\n\n*   **泛型级别0（泛型头文件）：** 涉及使用宏在头文件中定义类型，然后为每个特定类型多次包含该头文件。虽然具有泛型和类型安全，但这种方法存在代码膨胀、难以定位定义以及需要类型前缀函数名称的问题。\n*   **泛型级别1（void \\*）：** 使用`void *`来表示泛型数据。它缺乏类型安全，但实现简单。此外，将节点与其数据分离需要多次分配，这可能会影响性能。\n*   **泛型级别2（内联存储）：** 通过使用灵活数组成员将数据直接存储在节点中，从而改进了`void *`方法。这减少了内存开销并提高了缓存性能，但需要显式传递数据大小。\n*   **泛型级别3（使用联合体进行类型检查）：** 本文的核心介绍了一种类型安全的解决方案。它使用包含ListNode指针和参数化类型指针(`payload`)的联合体。宏利用三元运算符在函数调用期间强制类型匹配，为类型不匹配触发编译时错误，并避免运行时类型转换。此外，该方法可用于包含多个关联类型的结构体。\n\n文章最后给出了处理类型返回和结构体匹配的编译器问题的示例。它强调了该技术对各种数据结构（包括哈希表）的适应性。"
  },
  {
    "id": "44405565",
    "title": "First-Class Models: The Missing Productivity Revolution",
    "url": "https://frest.substack.com/p/first-class-models-the-missing-productivity",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "一流模型：缺失的生产力革命",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "44409488",
    "title": "Genetic code enables zebrafish to mend damaged organs",
    "url": "https://www.caltech.edu/about/news/genetic-code-enables-zebrafish-to-mend-damaged-organs",
    "summary": "Zebrafish possess a remarkable ability to regenerate damaged hearts, a process governed by a specific set of genes. Research from Caltech and UC Berkeley has identified this genetic circuit, potentially offering insights into human heart repair. The study focused on neural crest cells, a type of stem cell that contributes to the formation of various cell types within the heart. These cells play a crucial role in orchestrating the regeneration process in zebrafish hearts. When these cells were removed, the zebrafish lost their ability to regenerate their hearts.\n\nThe study identified a complex network of genes activated during regeneration. These genes, essential for embryonic development, are typically deactivated in adulthood but are reactivated to facilitate tissue regeneration after injury. Researchers are now investigating the signal that triggers this gene reactivation after damage.\n\nThe Martik team is using CRISPR technology to explore whether these genes can be reactivated in human heart cells. The ultimate goal is to determine if humans can activate analogous genes to repair damaged hearts, such as after a heart attack or in cases of congenital heart defects. This research offers a potential path towards future therapies for human heart conditions.\n",
    "chinese_title": "基因密码使斑马鱼能够修复受损器官",
    "chinese_summary": "斑马鱼拥有非凡的心脏再生能力，这一过程由一组特定基因控制。加州理工学院和加州大学伯克利分校的研究已经确定了这个基因回路，可能为人类心脏修复提供见解。该研究重点关注神经嵴细胞，这是一种干细胞，有助于形成心脏内的各种细胞类型。这些细胞在协调斑马鱼心脏的再生过程中起着至关重要的作用。当这些细胞被移除时，斑马鱼失去了再生心脏的能力。\n\n该研究确定了一个在再生过程中激活的复杂基因网络。这些对胚胎发育至关重要的基因通常在成年期失活，但在损伤后会重新激活以促进组织再生。研究人员目前正在研究触发损伤后基因重新激活的信号。\n\nMartik团队正在使用CRISPR技术来探索这些基因是否可以在人类心脏细胞中重新激活。最终目标是确定人类是否可以激活类似的基因来修复受损的心脏，例如在心脏病发作后或先天性心脏缺陷的情况下。这项研究为未来治疗人类心脏疾病提供了一条潜在途径。"
  },
  {
    "id": "44413957",
    "title": "All Good Editors Are Pirates: In Memory of Lewis H. Lapham",
    "url": "https://www.laphamsquarterly.org/roundtable/all-good-editors-are-pirates",
    "summary": "Kira Brunner Don's \"All Good Editors Are Pirates\" is a heartfelt remembrance of Lewis H. Lapham, focusing on her time as executive editor of *Lapham's Quarterly*, the magazine he founded after a long tenure at *Harper's Magazine*. Don paints a picture of the early days of the magazine as a scrappy, almost comically understaffed operation driven by Lapham's intellectual curiosity and relentless work ethic.\n\nThe essay highlights Lapham's dedication to quality and his willingness to solicit input from everyone, from interns to his publisher. Don emphasizes his belief in the power of voice and the importance of in-depth discussions with writers to achieve the best results. While acknowledging his flaws, she stresses his laissez-faire management style, his encouragement of creativity, and his unwavering support for his employees.\n\nDon also recounts the vibrant New York literary scene Lapham inhabited, characterized by late-night dinners and intellectual debate. She explains how Lapham's example and mentorship directly influenced her decision to co-found *Stranger's Guide*, emphasizing that she and her co-founder built the magazine using his model. Finally, the essay reflects on the changing landscape of the New York literary world and celebrates the unique impact Lapham had on it, ending with his characteristic words of encouragement, \"Onward, dear heart.\"\n",
    "chinese_title": "所有优秀的编辑都是海盗：纪念刘易斯·H·拉帕姆",
    "chinese_summary": "基拉·布鲁纳·唐的《优秀的编辑都是海盗》深情回忆了刘易斯·H·拉帕姆，着重描述了她担任《拉帕姆季刊》执行主编的时光，这份杂志是他结束在《哈泼斯杂志》的长期任职后创办的。唐描绘了杂志创刊初期景象，人手严重不足，几乎到了滑稽的地步，但却被拉帕姆的求知欲和不知疲倦的职业道德所驱动。\n\n这篇文章突出了拉帕姆对质量的执着，以及他乐于征求所有人的意见，从实习生到出版商。唐强调了他对声音力量的信念，以及与作者进行深入讨论以获得最佳结果的重要性。在承认他缺点的同时，她强调了他自由放任的管理风格，对创造力的鼓励，以及对他员工坚定不移的支持。\n\n唐还回顾了拉帕姆所处的充满活力的纽约文学场景，其特点是深夜晚餐和激烈的学术辩论。她解释了拉帕姆的榜样和指导如何直接影响了她共同创办《陌生人指南》的决定，并强调她和她的联合创始人正是以他的模式建立了这份杂志。最后，这篇文章反思了纽约文学界不断变化的面貌，并赞扬了拉帕姆对它产生的独特影响，以他标志性的鼓励语“前进，亲爱的”结尾。"
  },
  {
    "id": "44427757",
    "title": "The new skill in AI is not prompting, it's context engineering",
    "url": "https://www.philschmid.de/context-engineering",
    "summary": "This article argues that \"context engineering\" is becoming the critical skill in AI development, surpassing \"prompt engineering.\" Context engineering is defined as designing systems that dynamically provide Large Language Models (LLMs) with the right information and tools, in the right format, at the right time to accomplish a task.\n\nThe article highlights that failures in AI agents are increasingly due to poor context, not model limitations. It broadens the definition of \"context\" beyond a single prompt to include instructions, user prompts, short-term memory (conversation history), long-term memory (persistent knowledge), retrieved information (RAG), available tools, and structured output formats.\n\nThe author contrasts a \"cheap demo\" agent with a \"magical\" agent to illustrate the impact of context. The \"magical\" agent, fueled by rich context (calendar data, past emails, contact lists, tools), produces far more helpful and relevant responses than the \"cheap demo\" agent that only sees the immediate user request.\n\nContext engineering is presented as a dynamic system, not a static prompt. It involves ensuring the model has access to crucial details and presenting that information concisely and clearly. The focus shifts from writing clever code to gathering and formatting the information needed for the LLM to succeed. The author concludes that building reliable AI agents is increasingly about structuring information effectively to enable LLMs to accomplish tasks, encompassing business understanding, output definition, and data structuring.\n",
    "chinese_title": "人工智能领域的新技能不是提示工程，而是上下文工程。",
    "chinese_summary": "本文认为，“上下文工程”正成为人工智能开发的关键技能，超越了“提示词工程”。上下文工程被定义为设计系统，以在正确的时间，以正确的格式，动态地为大型语言模型（LLM）提供正确的信息和工具，从而完成任务。\n\n文章强调，人工智能代理的失败越来越多地归因于不良的上下文，而非模型本身的局限性。它将“上下文”的定义扩展到单个提示词之外，包括指令、用户提示、短期记忆（对话历史）、长期记忆（持久知识）、检索信息（RAG）、可用工具和结构化输出格式。\n\n作者通过对比“廉价演示”代理和“神奇”代理来阐明上下文的影响。“神奇”代理由丰富的上下文（日历数据、过去的电子邮件、联系人列表、工具）驱动，产生的响应比仅能看到直接用户请求的“廉价演示”代理更有用和相关。\n\n上下文工程被认为是一个动态系统，而非静态提示词。它涉及确保模型可以访问关键细节，并以简洁明了的方式呈现该信息。重点从编写巧妙的代码转移到收集和格式化LLM成功所需的信息。作者总结说，构建可靠的人工智能代理越来越在于有效地组织信息，以使LLM能够完成任务，这涵盖了业务理解、输出定义和数据结构。"
  },
  {
    "id": "44433994",
    "title": "Grammarly acquires Superhuman",
    "url": "https://www.reuters.com/business/grammarly-acquires-email-startup-superhuman-ai-platform-push-2025-07-01/",
    "summary": "Okay, here's a summary based on the hypothetical scenario that Grammarly acquired Superhuman, given the provided title and publication date:\n\n**Summary:**\n\nGrammarly, the AI-powered writing assistant company, has acquired Superhuman, the premium email startup known for its speed, efficiency, and design-focused interface. The acquisition, reported on July 1, 2025, signals Grammarly's broader push into becoming a comprehensive AI communication platform, expanding beyond just grammar and spelling.\n\nThe purchase likely aims to integrate Superhuman's advanced email management capabilities with Grammarly's AI writing tools. This could result in features that provide real-time writing assistance and tone suggestions directly within the email composition process, improving the overall quality and effectiveness of email communication.\n\nAnalysts suggest that Grammarly is aiming to become a central hub for all forms of written communication, and acquiring Superhuman provides them with a strong foothold in the email market. Superhuman's focus on user experience and productivity complements Grammarly's strengths in AI-powered writing enhancement.\n\nThe financial terms of the acquisition were not disclosed in the initial report, but the deal positions Grammarly to better compete with larger tech companies offering integrated communication suites. The integration roadmap and future product offerings remain to be seen, but the acquisition is expected to bring significant advancements to email productivity and writing quality for users of both platforms.\n",
    "chinese_title": "Grammarly 收购 Superhuman",
    "chinese_summary": "**摘要：**\n\n在假定 Grammarly 收购 Superhuman 的情景下，以下为基于提供标题和发布日期的总结：\n\n人工智能写作助手公司 Grammarly 已收购以速度、效率和设计至上的界面著称的高端邮件初创公司 Superhuman。 这项收购于 2025 年 7 月 1 日报道，标志着 Grammarly 正扩大其业务范围，成为一个全面的 AI 通信平台，而不仅仅局限于语法和拼写。\n\n此次收购的目的很可能是将 Superhuman 先进的邮件管理功能与 Grammarly 的 AI 写作工具集成。 这可能会产生一些功能，这些功能可以直接在邮件撰写过程中提供实时的写作辅助和语气建议，从而提高邮件沟通的整体质量和效果。\n\n分析师认为，Grammarly 的目标是成为所有书面沟通形式的中心枢纽，而收购 Superhuman 为其在邮件市场提供了强大的立足点。 Superhuman 对用户体验和生产力的关注与 Grammarly 在 AI 驱动的写作增强方面的优势相辅相成。\n\n初步报告中未披露此次收购的财务条款，但该交易使 Grammarly 能够更好地与提供集成通信套件的大型科技公司竞争。 集成路线图和未来的产品供应仍有待观察，但预计此次收购将为两个平台的用户带来邮件生产力和写作质量的显著进步。"
  },
  {
    "id": "44399838",
    "title": "Simulations reveal the secret to strengthening carbon fiber",
    "url": "https://www.ornl.gov/news/simulations-reveal-secret-strengthening-carbon-fiber",
    "summary": "ORNL researchers have discovered a method to significantly strengthen carbon fiber composites by incorporating a thin, reinforcing layer of polyacrylonitrile (PAN) nanofibers. Using the Frontier supercomputer, they simulated 5 million atoms to understand how these nanofibers, which are 100 times thinner than a human hair, improve the material's strength at the atomic level.\n\nThe simulations revealed that PAN nanofibers with a diameter of approximately 6 nanometers provide the best performance, aligning uniformly at the interface between carbon fibers and the polymer matrix to improve stress transfer and overall strength. This approach addresses the common failure point in carbon fiber composites, which typically occurs at the interface between the carbon fiber and the polymer.\n\nThe team used the Large-scale Atomic/Molecular Massively Parallel Simulator (LAMMPS) to model the behavior of atoms, simulating pulling on the material using a graphene sheet to identify weak points. The simulations showed that using the nanofibers doubled the tensile strength of the carbon fiber composites.\n\nThis research, published in Advanced Functional Materials, paves the way for creating ultradurable, lightweight materials for various applications, including airplanes, vehicles, and general manufacturing. The team plans to continue their research on Frontier, integrating artificial intelligence to explore a wider range of advanced composites. Ultimately, their goal is to develop materials that are not only stronger but also smarter and more efficient.\n",
    "chinese_title": "模拟揭示增强碳纤维强度的秘密",
    "chinese_summary": "橡树岭国家实验室研究人员发现了一种通过加入聚丙烯腈（PAN）纳米纤维薄增强层来显著增强碳纤维复合材料的方法。他们利用前沿超级计算机模拟了500万个原子，以了解这些比人类头发细100倍的纳米纤维如何在原子层面提高材料的强度。\n\n模拟表明，直径约为6纳米的PAN纳米纤维性能最佳，它们在碳纤维和聚合物基体之间的界面处均匀排列，从而改善应力传递和整体强度。 这种方法解决了碳纤维复合材料中的常见失效点，该失效点通常发生在碳纤维和聚合物之间的界面处。\n\n该团队使用大规模原子/分子并行模拟器（LAMMPS）对原子的行为进行建模，使用石墨烯片拉动材料以识别薄弱点。 模拟表明，使用纳米纤维使碳纤维复合材料的抗拉强度提高了一倍。\n\n这项发表在《先进功能材料》上的研究为制造用于各种应用的超耐用、轻质材料铺平了道路，这些应用包括飞机、车辆和一般制造业。 该团队计划继续在前沿超级计算机上进行研究，整合人工智能以探索更广泛的先进复合材料。 最终，他们的目标是开发不仅更坚固，而且更智能、更高效的材料。"
  },
  {
    "id": "44426428",
    "title": "The hidden JTAG in a Qualcomm/Snapdragon device’s USB port",
    "url": "https://www.linaro.org/blog/hidden-jtag-qualcomm-snapdragon-usb/",
    "summary": "This article discusses Qualcomm's release of source code for interacting with EUD (Embedded USB Debug), a debugging interface built into most Qualcomm SoCs since around 2018. EUD provides access to CPU and co-processor debug facilities via a USB connection, exposing an SWD interface for JTAG-like debugging without external tools or soldering.\n\nThe release enables developers to use OpenOCD (an open-source on-chip debugger) to debug Qualcomm devices directly via USB. The author details the process of getting the code to build, including fixing errors and rebasing OpenOCD. They highlight the benefits of EUD for debugging U-Boot, TF-A, and OP-TEE, especially in vertically integrated BSPs.\n\nThe article also mentions the existence of COM (UART) and trace peripherals within EUD, suggesting potential for advanced closed-case debugging scenarios. The author encourages community contribution to extend EUD support to more SoCs and address quirks like the sticky reset bit.\n\nWhile EUD offers significant debugging capabilities, it appears limited in controlling higher execution levels on production devices. Despite this, the author concludes that the EUD release is a major step forward, lowering the barrier to entry for low-level debugging on Qualcomm platforms, saving costs, reducing setup times, and facilitating remote debugging. They emphasize Qualcomm's commitment to improving the developer experience and making their platforms more open.\n",
    "chinese_title": "高通/骁龙设备USB端口中的隐藏JTAG",
    "chinese_summary": "本文探讨了高通公司发布的可与EUD（嵌入式USB调试）交互的源代码。EUD是一种自2018年左右以来内置于大多数高通SoC中的调试接口，它通过USB连接提供对CPU和协处理器调试功能的访问，从而公开一个SWD接口，无需外部工具或焊接即可进行类似JTAG的调试。\n\n此次发布使开发者能够使用OpenOCD（一种开源片上调试器）直接通过USB调试高通设备。作者详细介绍了构建代码的过程，包括修复错误和重新构建OpenOCD。他们强调了EUD在调试U-Boot、TF-A和OP-TEE方面的优势，尤其是在垂直集成的BSP中。\n\n文章还提到了EUD中存在的COM（UART）和跟踪外设，暗示了高级封闭案例调试场景的潜力。作者鼓励社区贡献力量，将EUD支持扩展到更多SoC，并解决诸如粘滞复位位之类的怪异问题。\n\n尽管EUD提供了强大的调试功能，但它在控制生产设备上更高执行级别方面似乎受到限制。尽管如此，作者总结认为，EUD的发布是向前迈出的一大步，降低了高通平台低级调试的入门门槛，节省了成本，缩短了设置时间，并促进了远程调试。他们强调了高通致力于改善开发者体验并使其平台更加开放。"
  },
  {
    "id": "44410925",
    "title": "Embabel Agent Framework for the JVM",
    "url": "https://github.com/embabel/embabel-agent",
    "summary": "Embabel is a JVM framework for building intelligent agentic flows, blending LLM interactions with code and domain models. It supports sophisticated planning to achieve goals through actions, guided by conditions and a domain model. Unlike simple state machines, Embabel uses a non-LLM AI algorithm for dynamic planning, adapting to new information and enabling tasks beyond initial programming. This facilitates extensibility and reuse; adding new domain objects, actions, goals, and conditions enhances system capabilities without altering existing code.\n\nKey features include strong typing, platform abstraction, LLM mixing for cost-effectiveness, and integration with Spring and the JVM for enterprise functionality. Embabel allows agent authoring via annotations or a Kotlin DSL, both backed by a rich domain model. Its planning step is pluggable, with GOAP as the default.\n\nExecution modes include Focused (code-driven), Closed (agent chosen based on intent), and Open (platform seeks suitable goal and builds a custom agent). Open mode is powerful but less deterministic, allowing for novel paths. Future modes envision evolving processes and federation with other agent systems.\n\nEmbabel addresses limitations in existing agent frameworks by providing higher-level APIs (akin to Spring MVC versus Servlet API), facilitating testing, composability, robustness, and safety. It aims to leverage the JVM's existing code and infrastructure assets. The project practices \"extreme dogfooding,\" using AI agents to automate development tasks and improve the platform itself. Quick start options include using Java or Kotlin GitHub templates or a project creation tool.\n",
    "chinese_title": "适用于JVM的Embabel代理框架",
    "chinese_summary": "Embabel：用于构建智能代理流程的JVM框架，它融合了LLM交互与代码和领域模型。它支持复杂的规划，通过在条件和领域模型的指导下执行动作来达成目标。与简单的状态机不同，Embabel使用非LLM的AI算法进行动态规划，适应新信息并实现超出初始编程的任务。这促进了可扩展性和重用性；添加新的领域对象、动作、目标和条件可以增强系统功能，而无需更改现有代码。\n\n主要特性包括强类型、平台抽象、LLM混合以实现成本效益，以及与Spring和JVM的集成以实现企业功能。Embabel允许通过注解或Kotlin DSL进行代理创作，两者都由丰富的领域模型支持。其规划步骤是可插拔的，默认使用GOAP。\n\n执行模式包括专注型（代码驱动）、封闭型（基于意图选择代理）和开放型（平台寻找合适的目标并构建自定义代理）。开放模式功能强大但确定性较低，允许采用新颖的路径。未来的模式设想了不断发展的流程以及与其他代理系统的联邦。\n\nEmbabel通过提供更高级别的API（类似于Spring MVC与Servlet API），解决了现有代理框架的局限性，从而促进了测试、可组合性、健壮性和安全性。它旨在利用JVM现有的代码和基础设施资产。该项目实践“极限实践”，使用AI代理来自动化开发任务并改进平台本身。快速入门选项包括使用Java或Kotlin GitHub模板或项目创建工具。"
  },
  {
    "id": "44428438",
    "title": "Show HN: A continuation of IRS Direct File that can be self-hosted",
    "url": "https://github.com/openfiletax/openfile",
    "summary": "OpenFile is a free, self-hostable tax preparation tool forked from the IRS Direct File project. It allows users to file their taxes directly, and its source code is available for modification and independent hosting.\n\nTo run OpenFile, the user needs Docker. The tool can be deployed with a single command: `docker compose up -d`. Once deployed, the OpenFile client is accessible at `localhost:3000/df/file`.\n\nThe documentation at `https://docs.openfile.tax/en/latest/direct-file.html` provides more information about the project and its functionality. In essence, OpenFile aims to provide a free and open-source alternative for tax filing, building upon the foundation laid by the IRS Direct File program.\n",
    "chinese_title": "展示HN：可自托管的IRS直接报税系统延续版",
    "chinese_summary": "OpenFile：免费自托管报税工具\n\nOpenFile 是一个免费、可自托管的报税工具，它从美国国税局的 Direct File 项目衍生而来。它允许用户直接申报税务，并且其源代码可供修改和独立托管。\n\n要运行 OpenFile，用户需要 Docker。该工具可以使用单个命令部署：`docker compose up -d`。部署完成后，OpenFile 客户端可以通过 `localhost:3000/df/file` 访问。\n\n`https://docs.openfile.tax/en/latest/direct-file.html` 上的文档提供了有关该项目及其功能的更多信息。本质上，OpenFile 旨在为税务申报提供一个免费且开源的替代方案，建立在美国国税局 Direct File 项目奠定的基础上。"
  },
  {
    "id": "44432385",
    "title": "Cloudflare to introduce pay-per-crawl for AI bots",
    "url": "https://blog.cloudflare.com/introducing-pay-per-crawl/",
    "summary": "Cloudflare is introducing \"Pay per Crawl,\" a system enabling content creators to charge AI crawlers for accessing their content. This addresses the binary choice many publishers face: either allowing free access or creating a walled garden. Pay per Crawl offers a third option: compensated access at internet scale, leveraging HTTP response code 402.\n\nPublishers gain granular control, defining a flat, per-request price for their entire site with the option to Allow free access, Charge a configured price, or Block access. Even blocked crawlers receive a \"charge\" notification, signaling potential future relationships. Publishers retain flexibility to bypass charges for specific crawlers, accommodating partnerships outside the system.\n\nThe system uses Web Bot Auth proposals for secure crawler identification and charging. Crawlers generate a key pair, register with Cloudflare, and use HTTP Message Signatures with each request.\n\nCrawlers can access content through Reactive (discovery-first, encountering a 402 error and retrying with payment intent) or Proactive (intent-first, specifying a maximum price) flows. Cloudflare handles financial settlement, aggregating events, charging crawlers, and distributing earnings to publishers.\n\nCloudflare envisions Pay per Crawl evolving to support dynamic pricing, granular licensing, and programmatic negotiations for intelligent agents. They highlight the potential for AI agents to access and synthesize information based on pre-defined budgets.\n\nPay per Crawl is currently in private beta, and Cloudflare encourages interested crawlers and content creators to sign up.\n",
    "chinese_title": "Cloudflare将为AI机器人引入按次爬取付费模式",
    "chinese_summary": "Cloudflare推出“按爬取付费”机制，内容创作者可向访问其内容的人工智能爬虫收费。这解决了许多发布者面临的二元选择：要么允许免费访问，要么创建围墙花园。“按爬取付费”提供了第三种选择：以互联网规模的有偿访问，利用HTTP响应代码402。\n\n发布者获得了精细的控制权，可以为整个站点定义统一的、按请求收费的价格，并可选择允许免费访问、收取配置的价格或阻止访问。即使是被阻止的爬虫也会收到“收费”通知，预示着未来潜在的关系。发布者可以灵活地绕过对特定爬虫的收费，以适应系统之外的合作关系。\n\n该系统使用Web Bot Auth提案来实现安全的爬虫识别和收费。爬虫生成密钥对，向Cloudflare注册，并在每个请求中使用HTTP消息签名。\n\n爬虫可以通过被动（先发现，遇到402错误并重试以支付）或主动（先声明意图，指定最高价格）流程访问内容。Cloudflare负责财务结算，汇总事件、向爬虫收费，并将收益分配给发布者。\n\nCloudflare设想“按爬取付费”未来将发展为支持动态定价、精细化许可和智能代理的程序化协商。他们强调了人工智能代理根据预定义预算访问和合成信息的潜力。\n\n“按爬取付费”目前处于私有测试阶段，Cloudflare鼓励感兴趣的爬虫和内容创作者注册。"
  },
  {
    "id": "44426128",
    "title": "Proton joins suit against Apple for practices that harm developers and consumers",
    "url": "https://proton.me/blog/apple-lawsuit",
    "summary": "In June 2025, Proton joined a class-action lawsuit against Apple in the US, alleging anti-competitive practices in the App Store that harm developers and consumers. Proton argues that Apple's policies constitute violations of US antitrust law and aims to ensure American developers and consumers aren't disadvantaged compared to those in the EU where Apple has already faced penalties.\n\nProton highlights several concerns: Apple's App Store policies favor surveillance capitalism by disproportionately affecting privacy-focused companies through its 30% app store fees; Apple's censorship practices at the behest of authoritarian regimes stifle freedom and democracy; the restrictive subscription management system leads to a worse user experience and Apple intentionally cripples third-party apps,; and Apple's App Store fees act as an artificial tax on internet commerce, causing price inflation.\n\nProton seeks to end anti-competitive behavior on the App Store and to ensure real changes to Apple’s practices. Any monetary damages received by Proton will be donated to organizations fighting for democracy and human rights. They believe the outcome will benefit all app developers and users of apps in this market, not just themselves, and hope to set a precedent where free people, not monopolies, dictate the future of the internet. Proton is represented by Quinn Emanuel Urquhart & Sullivan LLP and Cohen Milstein Sellers & Toll PLLC.\n",
    "chinese_title": "Proton加入针对苹果损害开发者和消费者利益行为的诉讼",
    "chinese_summary": "在2025年6月，Proton在美国加入了一项针对苹果的集体诉讼，指控其应用商店存在损害开发者和消费者的反竞争行为。Proton认为苹果的政策违反了美国反垄断法，并旨在确保美国开发者和消费者不会像在欧盟那样处于不利地位，因为苹果已经在欧盟面临处罚。\n\nProton强调了几个担忧：苹果的应用商店政策通过其30%的应用商店费用不成比例地影响了注重隐私的公司，从而助长了监视资本主义；苹果应专制政权的要求进行的审查行为扼杀了自由和民主；限制性的订阅管理系统导致更差的用户体验，并且苹果有意削弱第三方应用程序；苹果的应用商店费用相当于对互联网商业征收人为税，导致价格上涨。\n\nProton寻求结束应用商店中的反竞争行为，并确保苹果的实践发生真正的改变。Proton收到的任何金钱赔偿将捐赠给为民主和人权而战的组织。他们认为结果将使该市场中的所有应用程序开发者和用户受益，而不仅仅是他们自己，并希望树立一个先例，即自由的人民，而不是垄断企业，来决定互联网的未来。Proton由Quinn Emanuel Urquhart & Sullivan LLP和Cohen Milstein Sellers & Toll PLLC代理。"
  },
  {
    "id": "44433222",
    "title": "RP2350pc Open Source Hardware all in one computer",
    "url": "https://olimex.wordpress.com/2025/07/01/rp2350pc-open-source-hardware-all-in-one-computer-with-rp2350b-8mb-psram-16mb-flash-four-usb-host-dvi-hdmi-output-and-audio-codec-for-retro-computer-emulation-and-education/",
    "summary": "This article introduces the RP2350pc, an open-source hardware all-in-one computer designed for retro computer emulation and education. It features the RP2350B processor, a dual-core ARM/RISC-V chip, along with 520KB RAM, 8MB PSRAM, and 16MB Flash.\n\nKey features include four USB ports, two UEXT connectors, DVI/HDMI output, an audio codec with microphone input and headphone output (plus an amplifier for external speakers), an SD card slot, LiPo UPS for battery operation, and two USB-C ports (one for power, one for programming). A power on/off switch is also included.\n\nThe RP2350pc is intended for creating retro-style ARM/RISC-V computers, complete with keyboard and TV output, making it suitable for games and educational purposes. Veselin Sladkov is developing Reload emulator support for the platform, which aims to enable emulation of systems like Apple ][, Oric Atmos, and Puldin 601. Paul Robson is also working on an RP2350pc API to facilitate the creation of compilers and operating systems with a unified BIOS.\n",
    "chinese_title": "RP2350pc 开源一体机",
    "chinese_summary": "本文介绍RP2350pc，一款专为复古电脑模拟和教育设计的开源硬件一体机。它搭载RP2350B处理器，一款双核ARM/RISC-V芯片，配备520KB RAM、8MB PSRAM和16MB Flash。\n\n主要特性包括四个USB端口、两个UEXT连接器、DVI/HDMI输出、带麦克风输入和耳机输出（外加外置扬声器放大器）的音频编解码器、SD卡槽、用于电池供电的LiPo UPS，以及两个USB-C端口（一个用于供电，一个用于编程）。此外还包括一个电源开关。\n\nRP2350pc旨在创建具有键盘和电视输出的复古风格ARM/RISC-V计算机，使其适用于游戏和教育用途。Veselin Sladkov正在开发对该平台的Reload模拟器支持，旨在实现对Apple ][、Oric Atmos和Puldin 601等系统的模拟。Paul Robson也在开发RP2350pc API，以方便创建具有统一BIOS的编译器和操作系统。"
  },
  {
    "id": "44432322",
    "title": "Show HN: ToplingDB - A Persistent Key-Value Store for External Storage",
    "url": "https://github.com/topling/toplingdb",
    "summary": "生成摘要时出错",
    "chinese_title": "Show HN: ToplingDB - 用于外部存储的持久化键值存储",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44404831",
    "title": "Abstraction boundaries are optimization boundaries",
    "url": "https://blog.snork.dev/posts/abstraction-boundaries-are-optimization-boundaries.html",
    "summary": "This article argues that abstraction boundaries act as optimization boundaries, using the N+1 query problem as a primary example. The N+1 query problem, where an application makes multiple redundant SQL queries, often stems from a leaky ORM abstraction that can't automatically optimize multiple single-row fetches into a single bulk query.\n\nThe author suggests that instead of lowering the abstraction boundary and manually optimizing the queries, we could potentially raise the abstraction boundary to encompass the ORM within the language itself. This would allow the compiler to understand the ORM's operations and apply rewrite rules to optimize queries, such as merging N queries into one.\n\nThe author highlights Haskell's rewrite rules for list operations via stream fusion as another example. This optimization is possible because Haskell's declarative nature abstracts away low-level operational semantics, allowing for compiler-level optimizations.\n\nThe core idea is that by elevating the abstraction boundary, we simultaneously expand the scope for optimization. In essence, the compiler's ability to optimize code is directly limited by what it understands; raising the abstraction boundary to include more functionality grants the compiler deeper insights and greater potential for optimization.\n",
    "chinese_title": "抽象边界即优化边界",
    "chinese_summary": "本文论证了抽象边界充当优化边界，并以 N+1 查询问题为例。N+1 查询问题，即应用程序发出多个冗余 SQL 查询，通常源于泄露的 ORM 抽象，无法自动将多个单行获取优化为单个批量查询。\n\n作者建议，与其降低抽象边界并手动优化查询，不如提升抽象边界，将 ORM 纳入语言本身。这将使编译器能够理解 ORM 的操作并应用重写规则来优化查询，例如将 N 个查询合并为一个。\n\n作者还以 Haskell 通过流融合对列表操作的重写规则为例。这种优化之所以可行，是因为 Haskell 的声明式特性抽象掉了底层操作语义，从而允许编译器级别的优化。\n\n核心思想是通过提升抽象边界，我们可以同时扩大优化范围。本质上，编译器优化代码的能力直接受到其理解能力的限制；提升抽象边界以包含更多功能，使编译器能够获得更深入的洞察力和更大的优化潜力。"
  },
  {
    "id": "44429225",
    "title": "Claude Code now supports hooks",
    "url": "https://docs.anthropic.com/en/docs/claude-code/hooks",
    "summary": "This document introduces Claude Code hooks, which are user-defined shell commands that execute at various points in Claude Code's lifecycle, providing deterministic control over its behavior. Hooks can be used for notifications, automatic formatting, logging, feedback, and custom permissions.\n\nHooks are configured in settings files (user, project, local project) and are organized by matchers, which define when a hook runs.  The document details the structure of hook configurations using JSON, including the \"EventName,\" \"matcher,\" and \"hooks\" fields. It outlines different hook events: PreToolUse (before tool calls), PostToolUse (after tool completion), Notification, and Stop, each with specific use cases and available matchers.\n\nHooks receive JSON data via stdin containing session information and event-specific data.  They can communicate back to Claude Code using exit codes (0 for success, 2 for blocking error, other for non-blocking error) or by returning structured JSON in stdout.  JSON output allows control over Claude's continuation, decision-making (approve/block), and providing feedback.\n\nThe document also covers working with Model Context Protocol (MCP) tools, which have a specific naming pattern, and provides examples for code formatting and custom notifications.  It emphasizes security considerations, highlighting the risks associated with executing arbitrary shell commands and providing best practices for writing secure hooks. Key recommendations are input validation, proper quoting, path traversal prevention, and using absolute paths. The document also details execution limits, environment, and debugging information.\n",
    "chinese_title": "Claude Code 现在支持 hooks 了",
    "chinese_summary": "本文介绍 Claude Code 钩子，这是一种用户自定义的 Shell 命令，可在 Claude Code 生命周期的各个阶段执行，从而对其行为提供确定性的控制。 钩子可用于通知、自动格式化、日志记录、反馈和自定义权限。\n\n钩子在设置文件（用户、项目、本地项目）中配置，并按匹配器组织，这些匹配器定义钩子的运行时间。 本文详细介绍了使用 JSON 的钩子配置结构，包括“EventName”、“matcher”和“hooks”字段。 它概述了不同的钩子事件：PreToolUse（工具调用之前）、PostToolUse（工具完成之后）、Notification 和 Stop，每个事件都有特定的用例和可用的匹配器。\n\n钩子通过 stdin 接收 JSON 数据，其中包含会话信息和特定于事件的数据。 它们可以使用退出代码（0 表示成功，2 表示阻塞错误，其他表示非阻塞错误）或通过在 stdout 中返回结构化的 JSON 来与 Claude Code 通信。 JSON 输出允许控制 Claude 的继续、决策（批准/阻止）以及提供反馈。\n\n本文还介绍了如何使用具有特定命名模式的模型上下文协议 (MCP) 工具，并提供了代码格式化和自定义通知的示例。 它强调了安全注意事项，突出了执行任意 Shell 命令的风险，并提供了编写安全钩子的最佳实践。 主要建议是输入验证、正确引用、路径遍历预防和使用绝对路径。 本文还详细介绍了执行限制、环境和调试信息。"
  },
  {
    "id": "44429225",
    "title": "Claude Code now supports hooks",
    "url": "https://docs.anthropic.com/en/docs/claude-code/hooks",
    "summary": "This document introduces Claude Code hooks, user-defined shell commands that execute at various points in Claude Code's lifecycle to provide deterministic control and extend its behavior. Hooks enable automation for tasks like notifications, code formatting, logging, feedback, and custom permissions.\n\nHooks are configured in JSON settings files (user, project, and local) and organized by \"event\" (PreToolUse, PostToolUse, Notification, Stop) and \"matcher\" (tool name or pattern). They receive JSON data via stdin and can return output (exit codes or structured JSON) to influence Claude Code's behavior, including blocking actions and providing feedback.\n\nPreToolUse hooks run before tool calls, allowing for validation and modification. PostToolUse hooks run after successful tool execution. Notification hooks customize notifications, and Stop hooks control when Claude Code finishes responding. The document details the specific input/output formats for each hook type, including how to use JSON to approve or block actions and provide reasons. Examples are provided for code formatting and notification customization.\n\nThe document stresses security considerations, emphasizing user responsibility for the safety and security of their hooks and providing best practices for writing secure hooks, such as input validation, proper quoting, and path traversal prevention. It also details hook execution details like timeout, parallelization, environment, and debugging techniques. Finally, it explains how hooks integrate with Model Context Protocol (MCP) tools.\n",
    "chinese_title": "Claude Code 现在支持 hooks 了",
    "chinese_summary": "本文介绍了 Claude Code 钩子，这是一种用户自定义的 Shell 命令，可在 Claude Code 生命周期中的不同阶段执行，以提供确定性控制并扩展其行为。 钩子可以实现自动化，用于通知、代码格式化、日志记录、反馈和自定义权限等任务。\n\n钩子在 JSON 设置文件（用户、项目和本地）中配置，并按“事件”（PreToolUse、PostToolUse、Notification、Stop）和“匹配器”（工具名称或模式）进行组织。 它们通过 stdin 接收 JSON 数据，并可以返回输出（退出代码或结构化 JSON）以影响 Claude Code 的行为，包括阻止操作和提供反馈。\n\nPreToolUse 钩子在工具调用之前运行，允许进行验证和修改。 PostToolUse 钩子在工具成功执行后运行。 Notification 钩子用于自定义通知，而 Stop 钩子用于控制 Claude Code 何时完成响应。 本文档详细介绍了每种钩子类型的特定输入/输出格式，包括如何使用 JSON 来批准或阻止操作并提供原因。 提供了代码格式化和通知自定义的示例。\n\n本文档强调了安全注意事项，强调用户对其钩子的安全负责，并提供了编写安全钩子的最佳实践，例如输入验证、正确引用和防止路径遍历。 它还详细介绍了钩子执行细节，如超时、并行化、环境和调试技术。 最后，它解释了钩子如何与模型上下文协议 (MCP) 工具集成。"
  },
  {
    "id": "44432444",
    "title": "The average chess players of Bletchley Park and AI research in Britain",
    "url": "https://blogs.bl.uk/science/2025/06/the-average-chess-players-of-bletchley-park-and-ai-research-in-britain.html",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "布莱切利园的普通棋手与英国的人工智能研究",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "44426726",
    "title": "Xfinity using WiFi signals in your house to detect motion",
    "url": "https://www.xfinity.com/support/articles/wifi-motion",
    "summary": "This Xfinity support page snippet focuses on Xfinity's \"WiFi Motion\" feature. It implies that Xfinity utilizes existing WiFi signals within a home to detect motion. The page likely explains how to use this feature through the Xfinity app. However, due to the incomplete nature of the snippet, details on its functionality, privacy implications, setup process, and potential limitations are missing. The snippet also highlights the need for JavaScript to be enabled for full functionality of the Xfinity support website. The copyright notice indicates the information is current as of 2025.\n",
    "chinese_title": "Xfinity利用家中WiFi信号探测动作",
    "chinese_summary": "这篇Xfinity支持页面片段主要介绍Xfinity的“WiFi Motion”功能。它暗示Xfinity利用家中现有的WiFi信号来检测运动。该页面可能解释了如何通过Xfinity应用程序使用此功能。然而，由于片段的不完整性，关于其功能、隐私影响、设置过程和潜在局限性的详细信息缺失。该片段还强调需要启用JavaScript才能使Xfinity支持网站的全部功能生效。版权声明表明信息截至2025年仍然有效。"
  },
  {
    "id": "44434667",
    "title": "PlanetScale for Postgres",
    "url": "https://planetscale.com/blog/planetscale-for-postgres",
    "summary": "PlanetScale is launching a private preview of PlanetScale for Postgres, a new Postgres hosting platform driven by customer demand after the announcement of PlanetScale Metal. Numerous companies requested Postgres support, prompting PlanetScale to develop this new offering.\n\nPlanetScale aims to deliver superior performance and reliability compared to existing Postgres hosting solutions, citing customer complaints about outages, poor performance, and high costs associated with current platforms. Their internal benchmarks demonstrate that PlanetScale for Postgres outperforms competitors, even with less resource allocation, leveraging real Postgres and PlanetScale Metal's locally attached NVMe SSDs.\n\nKey features include true high availability with automatic failovers, query buffering, connection pooling via PSBouncer, Postgres v17 support, online imports from Postgres v13+, and automatic version updates without downtime.\n\nWhile PlanetScale excels in database scaling with Vitess for MySQL, they are architecting a new system from first principles to bring similar scaling capabilities to Postgres, tailored to Postgres' strengths. They plan to release more information about this new system and offer early access.\n\nPlanetScale encourages interested companies running Postgres at scale to reach out. The announcement concludes with an invitation to sign up for the private preview waitlist.\n",
    "chinese_title": "PlanetScale 的 Postgres 支持",
    "chinese_summary": "PlanetScale推出PlanetScale for Postgres私有预览版，这是在PlanetScale Metal发布后，应客户需求推出的全新Postgres托管平台。许多公司要求支持Postgres，促使PlanetScale开发了这项新产品。\n\nPlanetScale旨在提供优于现有Postgres托管解决方案的性能和可靠性，理由是客户抱怨现有平台的停机、性能不佳和高成本。他们的内部基准测试表明，即使资源分配较少，PlanetScale for Postgres的性能也优于竞争对手，这得益于真实的Postgres和PlanetScale Metal的本地连接NVMe SSD。\n\n主要功能包括真正的具有自动故障转移的高可用性、查询缓冲、通过PSBouncer的连接池、Postgres v17支持、从Postgres v13+的在线导入以及无需停机的自动版本更新。\n\n虽然PlanetScale在MySQL的数据库扩展方面表现出色，但他们正在从第一性原理构建一个新系统，以便为Postgres带来类似的扩展能力，并根据Postgres的优势量身定制。他们计划发布更多关于这个新系统的信息并提供早期访问。\n\nPlanetScale鼓励大规模运行Postgres的有兴趣的公司联系他们。该公告最后邀请大家注册私有预览等候名单。"
  },
  {
    "id": "44428674",
    "title": "GPEmu: A GPU emulator for rapid, low-cost deep learning prototyping [pdf]",
    "url": "https://vldb.org/pvldb/vol18/p1919-wang.pdf",
    "summary": "GPEmu: A GPU emulator for rapid, low-cost deep learning prototyping is presented. The article discusses the challenges of accessing and utilizing GPUs for deep learning research and prototyping, including the high costs, limited availability, and quota restrictions associated with cloud-based GPU services. The proposed solution is GPEmu, a GPU emulator designed to enable rapid and low-cost prototyping of deep learning models. GPEmu offers a way to simulate GPU behavior and performance on commodity hardware, allowing researchers and developers to experiment with different model architectures, training strategies, and optimization techniques without the need for expensive GPUs or cloud resources. The document contains many internal and external hyperlinks.\n",
    "chinese_title": "GPEmu: 用于快速、低成本深度学习原型设计的GPU模拟器 [pdf]",
    "chinese_summary": "GPEmu：用于快速、低成本深度学习原型设计的GPU模拟器。本文讨论了深度学习研究和原型设计中访问和利用GPU所面临的挑战，包括与云端GPU服务相关的高成本、有限可用性和配额限制。提出的解决方案是GPEmu，一种旨在实现快速、低成本深度学习模型原型设计的GPU模拟器。GPEmu提供了一种在通用硬件上模拟GPU行为和性能的方法，使研究人员和开发人员无需昂贵的GPU或云资源，即可试验不同的模型架构、训练策略和优化技术。本文档包含许多内部和外部超链接。"
  },
  {
    "id": "44426845",
    "title": "End of an Era",
    "url": "https://www.erasmatazz.com/personal/self/end-of-an-era.html",
    "summary": "This article, written on June 29, 2025, is a reflection on the author's decades-long pursuit of creating \"interactive art\" through computer games and storytelling tools. He recounts his early work at Atari, including the game \"Gossip,\" and his subsequent attempt to create an Arthurian game, which was derailed by Atari's collapse.\n\nDriven by his artistic vision, he developed \"Erasmatron\" and later \"Storytron,\" software development environments designed to empower others to create interactive storyworlds. Despite their innovative features, including \"Deikto\" toy languages, these tools failed to gain traction, proving too complex for the intended audience.\n\nThe author then poured his energy into \"Siboot,\" an effort to showcase Storytron's capabilities, but ultimately deemed it a failure. Discouraged, he eventually returned to his original ambition: creating an Arthurian game. This culminated in \"Le Morte d'Arthur,\" which he considered a success, finally achieving his goal of genuine interactive art.\n\nDespite limited player engagement, he remained proud of his creation. His final attempt to share his technology with the interactive fiction community at Narrascope failed due to technical issues and a lack of follow-up interest. The author concludes that he has failed in his broader goal of advancing interactive storytelling and resigns himself to the fact that the world isn't ready for his vision, comparing himself to Charles Babbage. He sees his game, \"Le Morte d'Arthur,\" as a metaphorical autobiography, mirroring Arthur's failure to save his people but inspiring future generations.\n",
    "chinese_title": "一个时代的终结",
    "chinese_summary": "本文写于2025年6月29日，反思了作者数十年来通过电脑游戏和故事讲述工具创作“互动艺术”的追求。他回忆了他在雅达利公司的早期工作，包括游戏《八卦》，以及他后来试图创作亚瑟王游戏的经历，但因雅达利的倒闭而搁浅。\n\n在他的艺术 vision 的驱动下，他开发了“Erasmatron”，后来又开发了“Storytron”，这些软件开发环境旨在授权其他人创作互动故事世界。尽管它们具有创新功能，包括“Deikto”玩具语言，但这些工具未能获得认可，对于目标受众来说过于复杂。\n\n作者随后将精力投入到“Siboot”中，试图展示 Storytron 的功能，但最终认为它失败了。灰心丧气之后，他最终回到了最初的雄心壮志：创作亚瑟王游戏。这最终促成了《亚瑟之死》的诞生，他认为这是成功的，最终实现了他创作真正的互动艺术的目标。\n\n尽管玩家参与度有限，但他仍然为自己的创作感到自豪。他最后一次尝试在 Narrascope 上与互动小说社区分享他的技术失败了，原因是技术问题和缺乏后续兴趣。作者的结论是，他在推进互动故事讲述的更广泛目标上失败了，并且承认世界还没有准备好接受他的 vision，将自己比作查尔斯·巴贝奇。他认为他的游戏《亚瑟之死》是一部隐喻性的自传，反映了亚瑟未能拯救他的人民，但激励了后代。"
  },
  {
    "id": "44429531",
    "title": "Pluto is a unique dialect of Lua with a focus on general-purpose programming",
    "url": "https://github.com/PlutoLang/Pluto",
    "summary": "Pluto is a Lua dialect aimed at general-purpose programming that prioritizes accelerated development and enhanced features while maintaining Lua compatibility. It offers an enriched standard library and new syntax additions like switch statements and ternary expressions.\n\nPluto is largely compatible with Lua 5.4 source code, with potential conflicts arising from new keywords. These can be mitigated using \"Compatibility Mode.\" It also executes Lua 5.4 bytecode and most Pluto features generate compatible bytecode. A subset of Pluto features are incompatible, but are documented so they can be avoided if bytecode compatibility is required. The Pluto project actively keeps up-to-date with the main Lua repository, aiming to update to Lua 5.5 upon its release.\n\nComprehensive documentation, covering getting started, tooling, and feature improvements, is available on the Pluto website (which is also open-source). Users can quickly experiment with Pluto via an interactive web playground or utilize pre-built binaries. Tooling includes Pluto syntax highlighting and a dedicated language server.\n",
    "chinese_title": "冥王星是一种独特的Lua方言，专注于通用编程。",
    "chinese_summary": "Pluto是一种Lua方言，旨在用于通用编程，在保持Lua兼容性的前提下，优先考虑加速开发和增强功能。它提供了丰富的标准库，并新增了如switch语句和三元表达式等语法。\n\nPluto在很大程度上与Lua 5.4源代码兼容，潜在冲突可能来自新增关键字。这些冲突可以使用“兼容模式”来缓解。它还可以执行Lua 5.4字节码，并且大多数Pluto功能都会生成兼容的字节码。有一部分Pluto功能不兼容，但有文档记录，以便在需要字节码兼容性时可以避免使用。Pluto项目积极跟进Lua主仓库的更新，目标是在Lua 5.5发布后进行更新。\n\nPluto网站（也是开源的）提供了全面的文档，涵盖入门、工具和功能改进。用户可以通过交互式Web Playground快速体验Pluto，或者使用预构建的二进制文件。工具包括Pluto语法高亮显示和专用的语言服务器。"
  },
  {
    "id": "44407708",
    "title": "People Keep Inventing Prolly Trees",
    "url": "https://www.dolthub.com/blog/2025-06-03-people-keep-inventing-prolly-trees/",
    "summary": "This blog post discusses the phenomenon of multiple discovery, where the same invention is independently conceived by multiple individuals or groups around the same time. The author argues that prolly trees, a data structure crucial to Dolt, are a prime example of this, having been independently invented at least four times under different names.\n\nThe author traces the history of prolly trees back to 2009 with Avery Pennarun's bup, a tool for file system backups that used the core principles of prolly trees without naming them. The post then highlights Noms' formalization of \"Prolly Trees\" in 2015, followed by independent discoveries as \"Merkle Search Trees\" by researchers at Inria in 2019, and as \"Content-Defined Merkle Trees\" by DePaul University in 2020. Each invention arose in response to distinct needs, from distributed CRDTs to efficient container delivery, and each had unique implementation details.\n\nThe post emphasizes that prolly trees are built upon existing concepts like content-defined chunking, rolling hash functions, and Merkle trees, making their eventual discovery almost inevitable. The author concludes by questioning which name - Prolly Tree, Merkle Search Tree, or Content-Defined Merkle Tree - will eventually become the standard, while advocating for \"Prolly Tree\" due to its precedence and DoltHub's existing investment in the term. Ultimately, the post celebrates the power and impact of prolly trees in various fields.\n",
    "chinese_title": "人们不停地发明概率树",
    "chinese_summary": "多次发现现象：Dolt关键数据结构 Prolly Trees 的独立发明史\n\n本文探讨了多次发现现象，即同一发明在同一时期被多个个人或团体独立构思出来。作者认为，对于Dolt至关重要的数据结构 Prolly Trees 就是一个典型的例子，它至少被以不同的名称独立发明了四次。\n\n作者追溯了 Prolly Trees 的历史，始于2009年 Avery Pennarun 的 bup，这是一个用于文件系统备份的工具，它使用了 Prolly Trees 的核心原理，但没有命名它们。文章随后重点介绍了 Noms 在 2015 年对“Prolly Trees”的正式定义，以及 2019 年 Inria 研究人员独立发现的“Merkle Search Trees”，以及 2020 年 DePaul 大学独立发现的“Content-Defined Merkle Trees”。每项发明的出现都是为了应对不同的需求，从分布式 CRDT 到高效的容器交付，并且每个发明都有独特的实现细节。\n\n文章强调，Prolly Trees 建立在内容定义分块、滚动哈希函数和 Merkle 树等现有概念之上，使得它们的最终发现几乎是不可避免的。作者最后提出了一个问题，即哪个名称——Prolly Tree、Merkle Search Tree 或 Content-Defined Merkle Tree——最终会成为标准，同时由于其先例和 DoltHub 对该术语的现有投资，作者主张使用“Prolly Tree”。 最终，这篇文章赞扬了 prolly trees 在各个领域的力量和影响。"
  },
  {
    "id": "44434938",
    "title": "HN Slop: AI Startup Ideas from Hacker News",
    "url": "https://www.josh.ing/hn-slop",
    "summary": "This article, titled \"HN Slop: AI Startup Ideas from Hacker News,\" presents itself as a source of AI-generated startup ideas derived from current discussions on the Hacker News front page. It uses the playful title \"HN Slop,\" suggesting a mix of potentially valuable and less refined ideas. The article's primary function appears to be to automatically analyze trending topics on Hacker News and then leverage AI to brainstorm and suggest related startup concepts. This automated process implies a focus on identifying opportunities based on current tech trends and discussions within the Hacker News community. The short text indicates that the process is currently in action, with the AI analyzing current HN posts to generate startup ideas.\n",
    "chinese_title": "Hacker News 上的 AI 创业点子",
    "chinese_summary": "本文题为“HN Slop：来自 Hacker News 的 AI 创业点子”，旨在提供由人工智能生成的创业点子，这些点子来源于 Hacker News 首页的最新讨论。标题“HN Slop”颇具玩味，暗示其中既有潜在价值，也有不太成熟的想法。文章的主要功能似乎是自动分析 Hacker News 上的热门话题，然后利用人工智能进行头脑风暴，提出相关的创业概念。这种自动化流程意味着专注于根据当前科技趋势和 Hacker News 社区内的讨论来识别机会。简短的文本表明，该流程目前正在运行中，人工智能正在分析当前的 HN 帖子以生成创业点子。"
  },
  {
    "id": "44429182",
    "title": "Melbourne man discovers extensive model train network underneath house",
    "url": "https://www.sbs.com.au/news/article/i-was-shocked-melbourne-mans-unbelievable-find-after-buying-house/m4sksfer8",
    "summary": "Daniel Xu, a train enthusiast and rolling stock engineer, made an astonishing discovery after purchasing a house in Melbourne. He found an extensive model train network hidden beneath the house, a feature completely unmentioned during the buying process.\n\nThe elaborate setup, featuring intricate train lines and miniature landscapes, was built in the 1960s by the previous owner's father. The network had been largely untouched for years, gathering dust and spiderwebs.\n\nFor Xu, the discovery was a dream come true, aligning perfectly with his lifelong passion for trains. He was inspired by a Japanese cartoon about crime-fighting trains.\n\nDespite the unexpected project, Xu is committed to restoring the vintage model train network. He plans to clean up the tracks, assess what still functions, and upgrade the control technology to share his love of trains with a new generation. Even without power, the train set has already captivated the neighborhood children.\n",
    "chinese_title": "墨尔本男子在房屋下发现大型火车模型网络",
    "chinese_summary": "火车迷丹尼尔·徐在墨尔本购房后，做出了一个惊人的发现：他在房子底下找到了一个庞大的火车模型网络，而购买过程中对此只字未提。\n\n这个精心设计的装置，有着复杂的铁路线和微缩景观，是由前房主的父亲在20世纪60年代建造的。多年来，这个网络几乎未被触及，积满了灰尘和蜘蛛网。\n\n对徐来说，这个发现简直是梦想成真，与他毕生对火车的 passion 完美契合。他受到一部关于打击犯罪火车的日本卡通片的启发。\n\n尽管这个项目出乎意料，但徐致力于修复这个老式火车模型网络。他计划清理轨道，评估哪些还能运行，并升级控制技术，与新一代人分享他对火车的喜爱。即使没有通电，这套火车模型也已经迷住了邻里儿童。"
  },
  {
    "id": "44430984",
    "title": "Aging-related inflammation is not universal across human populations",
    "url": "https://www.publichealth.columbia.edu/news/aging-related-inflammation-not-universal-across-human-populations",
    "summary": "This Columbia University study published in *Nature Aging* challenges the idea that inflammation is a universal hallmark of aging. Researchers found that \"inflammaging,\" or chronic, low-grade inflammation associated with age, is more prevalent in industrialized populations and may be a byproduct of their lifestyles.\n\nThe study compared inflammation levels in two industrialized groups (Italian and Singaporean) with two Indigenous, non-industrialized groups (Tsimane of Bolivia and Orang Asli of Malaysia). While the industrialized populations showed a clear link between inflammation and aging, this wasn't the case in the Indigenous groups, where inflammation was primarily driven by infection. Interestingly, despite high levels of inflammation in the Indigenous groups, they did not experience the same chronic diseases linked to inflammaging in industrialized societies.\n\nThe research suggests that inflammation is \"context dependent,\" heavily influenced by environmental exposures, lifestyle, and infectious burdens. The study used a panel of 19 cytokines to assess inflammation patterns, which correlated with aging in industrialized populations but not in the Indigenous groups.\n\nThe authors call for a reevaluation of how aging and inflammation are measured across different populations, emphasizing the need for standardized, context-aware tools. They propose that factors like physical activity, diet, and infection may interact to influence how the immune system ages, which could inform more effective global health strategies.\n",
    "chinese_title": "与衰老相关的炎症并非普遍存在于所有人类群体中。",
    "chinese_summary": "这项发表在《自然衰老》上的哥伦比亚大学研究挑战了炎症是衰老普遍标志的观点。研究人员发现，“炎症衰老”，即与年龄相关的慢性、低度炎症，在工业化人群中更为普遍，可能是其生活方式的副产品。\n\n该研究比较了两个工业化群体（意大利和新加坡）与两个土著、非工业化群体（玻利维亚的奇马内人和马来西亚的奥朗阿斯利人）的炎症水平。虽然工业化人群显示炎症与衰老之间存在明显联系，但在土著群体中并非如此，他们的炎症主要由感染驱动。有趣的是，尽管土著群体中的炎症水平很高，但他们并没有经历与工业化社会中炎症衰老相关的相同慢性疾病。\n\n该研究表明，炎症是“情境依赖性的”，受环境暴露、生活方式和感染负担的严重影响。该研究使用了一组19种细胞因子来评估炎症模式，这些模式与工业化人群的衰老相关，但在土著群体中则不然。\n\n作者呼吁重新评估如何在不同人群中衡量衰老和炎症，强调需要标准化、具有情境意识的工具。他们提出，身体活动、饮食和感染等因素可能会相互作用，影响免疫系统衰老的方式，这可以为更有效的全球健康策略提供信息。"
  },
  {
    "id": "44426171",
    "title": "Sony DTC-700 audio DAT player/recorder",
    "url": "https://kevinboone.me/dtc-700.html",
    "summary": "This article is a nostalgic look back at Sony's DTC-700 DAT (Digital Audio Tape) player/recorder and the DAT format in general. The author argues that DAT offered superior sound quality to cassettes, rivaling CDs, with the added benefit of recording capabilities.  DAT allowed for direct digital recording from CDs and analog sources.\n\nDespite its advantages, DAT failed to achieve mainstream success for several reasons. The high cost of the players, coupled with a lack of commercially released music on DAT, hindered its adoption.  The recording industry's fear of digital copying, leading to legal restrictions and taxes on DAT devices, further contributed to its demise.  The DTC-700 also implemented anti-copying measures.\n\nTechnologically, DAT was complex, utilizing a rotating head similar to VHS recorders to achieve high data bandwidth on narrow tapes. This complexity led to reliability issues, exacerbated by the use of plastic components in the DTC-700. The author suggests that market saturation, with few opportunities for improvement or innovation in the format, ultimately sealed DAT's fate. While other vintage audio formats like vinyl and cassette have experienced a resurgence, the author doubts DAT will enjoy the same revival. Although there are modern alternatives for recording, such as computers with soundcards, the niche DAT once occupied is no longer needed.\n",
    "chinese_title": "索尼DTC-700音频DAT播放录音机",
    "chinese_summary": "本文是对索尼DTC-700 DAT（数字音频磁带）播放器/录音机以及DAT格式的回顾。作者认为，DAT提供了优于卡带的音质，可与CD媲美，并具有录音功能。DAT允许直接从CD和模拟源进行数字录音。\n\n尽管有其优点，但DAT未能取得主流成功，原因有几个。播放器的高成本，加上缺乏商业发行的DAT音乐，阻碍了其普及。录音行业对数字复制的担忧，导致对DAT设备的法律限制和税收，进一步促成了其衰落。DTC-700也采用了防复制措施。\n\n在技术上，DAT很复杂，它使用类似于VHS录像机的旋转磁头，以便在窄磁带上实现高数据带宽。这种复杂性导致了可靠性问题，DTC-700中使用塑料部件加剧了这一问题。作者认为，市场饱和，该格式几乎没有改进或创新的机会，最终决定了DAT的命运。虽然像黑胶唱片和卡带这样的其他复古音频格式已经复兴，但作者怀疑DAT是否会享受同样的复兴。虽然有现代的录音替代方案，例如带有声卡的计算机，但DAT曾经占据的利基市场不再需要了。"
  },
  {
    "id": "44432058",
    "title": "Pbf2sqlite: Reading OpenStreetMap into a SQLite Database",
    "url": "https://github.com/osmzoso/pbf2sqlite",
    "summary": "`pbf2sqlite` is a command-line tool designed to import OpenStreetMap (.osm.pbf) data into a SQLite database. Its primary function is to convert the OSM PBF format into a structured SQLite database format.\n\nThe basic usage is `pbf2sqlite DATABASE [OPTION ...]`, where `DATABASE` is the name of the SQLite database to be created or modified.\n\nKey options include:\n\n*   `read FILE`: Specifies the .osm or .osm.pbf file to be read and imported into the database.\n*   `rtree`: Adds R*Tree indexes for improved spatial querying performance.\n*   `addr`: Creates address tables to store address information extracted from the OSM data.\n*   `graph`: Generates a graph table, likely representing the network structure of the OpenStreetMap data, useful for routing or network analysis.\n\nThe tool can be used to create a database and populate it with data from an OSM PBF file, as demonstrated by the example `pbf2sqlite test.db read country.osm.pbf`.  OSM data, suitable for import, can be sourced from providers like Geofabrik. The article also mentions downloading the latest version (of the tool), but doesn't provide a link or other information on where to get it.\n",
    "chinese_title": "Pbf2sqlite：将OpenStreetMap数据读取到SQLite数据库",
    "chinese_summary": "`pbf2sqlite` 是一个命令行工具，用于将 OpenStreetMap (.osm.pbf) 数据导入到 SQLite 数据库中。它的主要功能是将 OSM PBF 格式转换为结构化的 SQLite 数据库格式。\n\n基本用法是 `pbf2sqlite DATABASE [OPTION ...]`，其中 `DATABASE` 是要创建或修改的 SQLite 数据库的名称。\n\n主要选项包括：\n\n*   `read FILE`: 指定要读取并导入到数据库中的 .osm 或 .osm.pbf 文件。\n*   `rtree`: 添加 R*Tree 索引以提高空间查询性能。\n*   `addr`: 创建地址表来存储从 OSM 数据中提取的地址信息。\n*   `graph`: 生成图表，可能代表 OpenStreetMap 数据的网络结构，用于路由或网络分析。\n\n该工具可用于创建数据库并使用 OSM PBF 文件中的数据填充它，如示例 `pbf2sqlite test.db read country.osm.pbf` 所示。 可以从 Geofabrik 等提供商处获取适合导入的 OSM 数据。 文章还提到下载最新版本（工具），但没有提供链接或有关在哪里获取的其他信息。"
  },
  {
    "id": "44425253",
    "title": "A CarFax for Used PCs; Hewlett Packard wants to give old laptops new life",
    "url": "https://spectrum.ieee.org/carmax-used-pcs",
    "summary": "This Hewlett Packard initiative aims to provide a \"CarFax\" equivalent for used PCs, giving old laptops a new lease on life. The article, authored by Abu Baker, Sal Vasi, Barbara Spitzer, and John Hong from HP, outlines HP's strategy for improving transparency and trust in the used PC market.\n\nThe core idea is to offer a standardized report, similar to a CarFax for vehicles, that details a used laptop's history and condition. This report would likely include information such as the original specifications, repair history, component replacements, and a detailed diagnostic assessment of its current performance.\n\nThis initiative seeks to address the common concerns of buyers in the used PC market, like uncertainty about the laptop's actual condition and potential hidden issues. By providing reliable and verified information, HP aims to increase consumer confidence and encourage the purchase of refurbished laptops, promoting sustainability and reducing electronic waste. Ultimately, HP envisions a more transparent and trustworthy ecosystem for buying and selling used computers.\n",
    "chinese_title": "二手电脑的CarFax；惠普希望让旧笔记本电脑焕发新生",
    "chinese_summary": "惠普计划打造二手电脑界的“CarFax”，为旧笔记本电脑赋予新生。本文由惠普的Abu Baker、Sal Vasi、Barbara Spitzer和John Hong撰写，概述了惠普旨在提高二手电脑市场透明度和信任度的战略。\n\n核心理念是提供一份标准化的报告，类似于车辆的CarFax，详细说明二手笔记本电脑的历史和状况。该报告可能包括原始规格、维修历史、组件更换以及对其当前性能的详细诊断评估等信息。\n\n该计划旨在解决二手电脑市场买家的常见担忧，例如对笔记本电脑实际状况的不确定性以及潜在的隐藏问题。通过提供可靠和经过验证的信息，惠普旨在增强消费者的信心，鼓励购买翻新笔记本电脑，从而促进可持续性并减少电子垃圾。最终，惠普设想建立一个更加透明和值得信赖的二手电脑买卖生态系统。"
  },
  {
    "id": "44416009",
    "title": "YouTube No Translation",
    "url": "https://addons.mozilla.org/en-GB/firefox/addon/youtube-no-translation/",
    "summary": "The \"YouTube No Translation\" Firefox extension prevents automatic translation on YouTube, ensuring a more authentic viewing experience. It keeps video titles and descriptions in their original language and defaults to the original audio track, even on Shorts. Users can choose their preferred subtitle language, with automatic disabling if the chosen language is unavailable (auto-generated subtitles are always ignored).\n\nKey features include preventing translation of video titles and descriptions, forcing the use of original audio tracks, and controlling subtitle language.\n\nThe extension is open-source and the developer encourages users to support its development through Ko-fi. Users can report issues or request features on GitHub. It requires access to data on the youtube.com and youtube-nocookie.com domains, with optional permissions for enhanced functionality. The latest version, 2.5.0, adds YouTube Data API v3 support for titles and search descriptions.\n",
    "chinese_title": "YouTube 无需翻译",
    "chinese_summary": "\"YouTube No Translation\" Firefox 扩展程序可阻止 YouTube 上的自动翻译，确保更原汁原味的观看体验。它保留视频标题和描述的原始语言，并默认使用原始音轨，即使在 Shorts 上也是如此。用户可以选择自己喜欢的字幕语言，如果所选语言不可用，则会自动禁用（始终忽略自动生成的字幕）。\n\n主要功能包括防止翻译视频标题和描述，强制使用原始音轨，以及控制字幕语言。\n\n该扩展程序是开源的，开发者鼓励用户通过 Ko-fi 支持其开发。用户可以在 GitHub 上报告问题或请求功能。它需要访问 youtube.com 和 youtube-nocookie.com 域上的数据，并提供可选权限以增强功能。最新版本 2.5.0 添加了对标题和搜索描述的 YouTube Data API v3 支持。"
  },
  {
    "id": "44426864",
    "title": "The original LZEXE (A.K.A. Kosinski) compressor source code has been released",
    "url": "https://clownacy.wordpress.com/2025/05/24/the-original-lzexe-a-k-a-kosinski-compressor-source-code-has-been-released/",
    "summary": "This article announces the release of the original source code for LZEXE, a DOS executable compressor developed by Fabrice Bellard in the early 90s and previously known as the \"Kosinski\" format used in some Mega Drive games. The source code, for version 0.91, was released under the MIT license, allowing for free use and modification.\n\nThe author, Clownacy, explains their previous work on reverse-engineering the Kosinski compressor, noting discrepancies between the compressed data found in Mega Drive Sonic games and the Mega CD BIOS, suggesting the potential use of different compressor versions with varying bugs or optimizations.\n\nWhile the released source code may not be an exact match for the compressor used in the Sonic games, it can be compared against disassembled binaries of the existing executables. The availability of this source code represents a significant advancement in understanding the \"KENS\" compression formats used on the Mega Drive, now having the source for Kosinski and Saxman. However, the author is not optimistic about finding the source code for the remaining \"KENS\" formats, Enigma and Nemesis, due to their custom nature and probable in-house development by Sega. The article includes a link to Devon's work extracting the core compression logic and encourages readers to share the news on social media.\n",
    "chinese_title": "原LZEXE (又名 Kosinski) 压缩器源代码已发布。",
    "chinese_summary": "本文宣布发布LZEXE的原始源代码，LZEXE是由Fabrice Bellard在90年代初开发的DOS可执行文件压缩器，之前被称为“Kosinski”格式，曾用于一些Mega Drive游戏中。0.91版本的源代码已在MIT许可下发布，允许免费使用和修改。\n\n作者Clownacy解释了他们之前对Kosinski压缩器的逆向工程工作，并指出Mega Drive Sonic游戏中发现的压缩数据与Mega CD BIOS之间存在差异，这表明可能使用了具有不同错误或优化的不同压缩器版本。\n\n虽然发布的源代码可能与Sonic游戏中使用的压缩器并不完全匹配，但可以与现有可执行文件的反汇编二进制文件进行比较。该源代码的发布代表了在理解Mega Drive上使用的“KENS”压缩格式方面的一个重大进展，现在已经有了Kosinski和Saxman的源代码。然而，由于Enigma和Nemesis的定制性质以及可能由世嘉内部开发，作者并不乐观能够找到剩余的“KENS”格式的源代码。本文包含一个指向Devon提取核心压缩逻辑的工作的链接，并鼓励读者在社交媒体上分享这一消息。"
  },
  {
    "id": "44411894",
    "title": "Experimental Playgrounds",
    "url": "https://mssv.net/2025/01/26/experimental-playgrounds/",
    "summary": "This article explores the history and philosophy of \"experimental playgrounds,\" also known as \"junk playgrounds\" and \"adventure playgrounds,\" which flourished in the 20th century as a response to the trauma of war. These playgrounds, unlike typical modern playgrounds, emphasized freedom, creativity, and cooperation by providing children with scrap materials, tools, and the space to build, experiment, and role-play with minimal adult interference.\n\nThe article traces the evolution of playgrounds from supervised spaces focused on physical and bodily skills to more progressive environments that fostered child-centered learning. It highlights key figures like Carl Theodor Sørensen, who envisioned junk playgrounds, and John Bertelsen, who emphasized the importance of playworkers facilitating rather than teaching.\n\nExamples such as the Emdrup playground in Denmark, The Yard in Minneapolis, and the Lollard Adventure Playground in London demonstrate the success and challenges of these spaces, including community concerns about safety and aesthetics. The article also discusses the decline of the movement due to commercialization and the desire for prettier, less anarchic spaces.\n\nWhile acknowledging the inspiring nature of experimental playgrounds, the author cautions against nostalgic replication and advocates for designing imaginative, co-created, embodied play that can exist in modern cities and compete with video games, drawing parallels with the immersive art and larp movements. The article concludes by recommending Ben Highmore's book, \"Playgrounds: The Experimental Years,\" for a deeper dive into the topic.\n",
    "chinese_title": "实验游乐场",
    "chinese_summary": "实验性游乐场：战争创伤的回应及现代启示"
  },
  {
    "id": "44428399",
    "title": "Jim Boddie codeveloped the first successful DSP at Bell Labs",
    "url": "https://spectrum.ieee.org/dsp-pioneer-jim-boddie",
    "summary": "This article commemorates Jim Boddie, a pioneer in digital signal processing (DSP) who codeveloped the first successful DSP at Bell Labs. Boddie worked at AT&T Bell Laboratories in Holmdel, N.J., where he helped design this groundbreaking semiconductor. The article highlights his significant contribution to the field, referencing insights from Steve Walters, who collaborated with Boddie on the Bell Labs DSP1, designing the I/O circuitry and the DSP development system, and Pat Hays, a lead developer of computer chips at Bell Labs. The piece underscores Boddie's impact as an architect and designer in the development of this pivotal technology.\n",
    "chinese_title": "吉姆·博迪在贝尔实验室共同开发了首个成功的DSP。",
    "chinese_summary": "本文纪念吉姆·博迪，一位数字信号处理(DSP)领域的先驱，他在贝尔实验室共同开发了首个成功的DSP。博迪曾在位于新泽西州霍姆德尔的AT&T贝尔实验室工作，在那里他帮助设计了这款开创性的半导体。本文重点介绍了他在该领域的重要贡献，并引用了史蒂夫·沃尔特斯（与博迪在贝尔实验室DSP1上合作，设计I/O电路和DSP开发系统）和帕特·海斯（贝尔实验室计算机芯片的主要开发人员）的见解。本文强调了博迪作为架构师和设计师，对这项关键技术发展所产生的重大影响。"
  },
  {
    "id": "44430311",
    "title": "Small language models are the future of agentic AI",
    "url": "https://arxiv.org/abs/2506.02153",
    "summary": "This arXiv paper, submitted on June 2, 2025, argues that small language models (SLMs) are the future of agentic AI. While large language models (LLMs) are praised for their general capabilities, the authors contend that SLMs are sufficiently powerful, more suitable, and more economical for the repetitive, specialized tasks common in agentic systems.\n\nThe authors, Peter Belcak et al., base their position on the current capabilities of SLMs, the architectures of agentic systems, and the cost-effectiveness of SLM deployment. They suggest that for situations requiring broader conversational abilities, heterogeneous agentic systems (agents using multiple models) are the best solution.\n\nThe paper identifies potential obstacles to SLM adoption and proposes a general LLM-to-SLM agent conversion algorithm. The core argument is a value statement emphasizing the significant operational and economic benefits of shifting, even partially, from LLMs to SLMs in the AI agent industry.\n\nThe authors aim to spark discussion about efficient AI resource utilization and reduce AI costs. They invite feedback on their position and commit to publishing all correspondence at a provided URL. The paper is categorized under Artificial Intelligence (cs.AI).\n",
    "chinese_title": "小型语言模型是自主人工智能的未来。",
    "chinese_summary": "这篇于2025年6月2日提交的arXiv论文认为，小型语言模型(SLM)是自主型人工智能的未来。虽然大型语言模型(LLM)因其通用能力而受到赞誉，但作者认为，对于自主系统中常见的重复性、专业化任务而言，SLM 既足够强大，也更适合，并且更经济。\n\n作者Peter Belcak等人基于SLM的现有能力、自主系统的架构以及SLM部署的成本效益来支持他们的观点。他们认为，对于需要更广泛对话能力的情况，异构自主系统（使用多个模型的智能体）是最佳解决方案。\n\n该论文指出了SLM应用可能面临的障碍，并提出了一种通用的LLM到SLM智能体转换算法。其核心论点是一个价值陈述，强调在人工智能智能体行业中，即使是部分地从LLM转向SLM，也能带来显著的运营和经济效益。\n\n作者旨在引发关于高效人工智能资源利用和降低人工智能成本的讨论。他们欢迎对其立场的反馈，并承诺在提供的URL上公开所有通信。该论文归类于人工智能（cs.AI）领域。"
  },
  {
    "id": "44433433",
    "title": "Waste into Construction Materials: Geopolymers from Recycled Sources",
    "url": "https://www.mdpi.com/2313-4321/10/3/118",
    "summary": "I am unable to access external URLs and thus cannot summarize the article. Therefore, my response is:\n\nUnable to access the article link.\n",
    "chinese_title": "废弃物变建材：再生资源地质聚合物",
    "chinese_summary": "我无法访问外部链接，因此无法总结文章。我的回复是：\n\n无法访问文章链接。"
  },
  {
    "id": "44432858",
    "title": "Show HN: Exceptional free templates, component libraries and boilerplates",
    "url": "https://htmlrev.com/",
    "summary": "HTMLrev is showcasing a vast collection of free templates, component libraries, and boilerplates for web developers. The resources span a wide range of frameworks and technologies, catering to diverse project needs.\n\nThe listed frameworks and technologies include: HTML, Bootstrap, Tailwind, Shadcn, Material, Bulma, Angular, React, Next.js, Vue, Nuxt, Svelte, Gatsby, Astro, Laravel, Django, Jekyll, Hugo, and BCMS. For each framework, several free templates are highlighted, covering various categories like business websites, landing pages, admin dashboards, portfolios, and documentation sites.\n\nSpecific examples are given for each category, such as \"Solid\" for HTML, \"Boldo\" for Bootstrap, \"Landing Page\" for Tailwind, and \"Shadcn Landing Page\" for Shadcn templates. Similarly, free templates for other frameworks are showcased, each with a brief description of their design and features.\n\nThe page also features sponsored slots highlighting website builders, admin dashboard template providers, UI component libraries and coding tools, like Unicorn Platform, WrapPixel, BCMS, ThemeSelection, CodedThemes, Shadcnblocks and Superflex. These sponsors offer both free and premium resources for web development. In addition to specific templates, several UI kits and design systems are also mentioned.\n",
    "chinese_title": "展示HN：卓越的免费模板、组件库和样板代码",
    "chinese_summary": "HTMLrev 展示了面向 Web 开发人员的大量免费模板、组件库和样板代码。这些资源涵盖了广泛的框架和技术，满足各种项目需求。\n\n列出的框架和技术包括：HTML、Bootstrap、Tailwind、Shadcn、Material、Bulma、Angular、React、Next.js、Vue、Nuxt、Svelte、Gatsby、Astro、Laravel、Django、Jekyll、Hugo 和 BCMS。对于每个框架，都重点介绍了多个免费模板，涵盖各种类别，例如企业网站、着陆页、管理仪表板、作品集和文档站点。\n\n针对每个类别都给出了具体示例，例如 HTML 的“Solid”，Bootstrap 的“Boldo”，Tailwind 的“Landing Page”以及 Shadcn 模板的“Shadcn Landing Page”。同样，还展示了其他框架的免费模板，每个模板都对其设计和功能进行了简要描述。\n\n该页面还设有赞助商位，重点介绍了网站构建器、管理仪表板模板提供商、UI 组件库和编码工具，例如 Unicorn Platform、WrapPixel、BCMS、ThemeSelection、CodedThemes、Shadcnblocks 和 Superflex。这些赞助商提供免费和高级 Web 开发资源。除了特定模板外，还提到了几个 UI 工具包和设计系统。"
  },
  {
    "id": "44429860",
    "title": "Tiny macOS utility that mirrors an external monitor in a resizable window",
    "url": "https://www.beeno.app/",
    "summary": "Beeno is a lightweight macOS utility that mirrors an external monitor's display in a resizable window on your main screen. This is particularly useful for checking presentations, demos, or sharing content without complex desktop rearrangement. It is specifically designed to aid Capture One users, allowing digital operators to easily project zooms or live views onto another screen for clients or photographers.\n\nTo use Beeno: download and extract the app, move it to Applications (optional), bypass Gatekeeper on the first launch (Right-click -> Open -> Open), and grant it Screen & System Audio Recording access. Once running, a bee icon appears in the menu bar. Left-clicking the icon toggles the preview window, right-clicking allows switching between mirrored displays, and right-clicking also provides the option to quit. The shortcut ⌥B also shows/hides the preview. Beeno is available for download as a .zip file and is licensed under CC BY-NC-ND 4.0.\n",
    "chinese_title": "在可调整大小的窗口中镜像外部显示器的微型macOS实用工具",
    "chinese_summary": "Beeno：一款在主屏幕可调整大小的窗口中镜像外部显示器显示的轻量级 macOS 实用工具。它尤其适用于检查演示文稿、演示或共享内容，无需复杂的桌面重新排列。该工具专为 Capture One 用户设计，方便数码操作员轻松地将放大图像或实时视图投影到另一个屏幕上，供客户或摄影师查看。\n\n使用 Beeno：下载并解压该应用程序，将其移动到“应用程序”文件夹（可选），首次启动时绕过 Gatekeeper（右键单击 -> 打开 -> 打开），并授予其“屏幕录制”和“系统音频录制”权限。运行后，菜单栏中会显示一个蜜蜂图标。左键单击该图标可切换预览窗口的显示/隐藏，右键单击可在镜像显示器之间切换，右键单击还提供退出选项。快捷键 ⌥B 也能显示/隐藏预览窗口。Beeno 以 .zip 文件形式提供下载，并采用 CC BY-NC-ND 4.0 许可。"
  },
  {
    "id": "44427134",
    "title": "Public Signal Backups Testing",
    "url": "https://community.signalusers.org/t/public-signal-backups-testing/69984",
    "summary": "Signal is launching a public test of their new end-to-end encrypted backup system on Android through a staging build. This backup system offers several highly requested features:\n\n*   **Hosted Backups:** Signal hosts the backups, protecting data even if a local backup is lost.\n*   **Dynamic Media Offloading:** Optimizes storage by allowing media to be dynamically downloaded when needed.\n*   **Cross-Platform Compatibility:** The backup format is readable by all clients, enabling restores across Android and iOS.\n*   **Free and Paid Tiers:** A free tier backs up all text content and the most recent 45 days of media. A paid tier offers 100GB of media storage.\n\nSecurity and privacy are paramount: backups are end-to-end encrypted, disabled by default, and designed to prevent Signal from linking backups or payments to specific users.\n\nTesting is currently only available on Android via a self-updating APK. Testers are encouraged to explore the UI, test edge cases (like sending media during or around a backup), and provide feedback on bugs, confusing descriptions, missing features, and performance issues. The post outlines how to override the free/paid tier setting for testing purposes.\n\nLocal backups will still exist and are being improved with a new cross-platform format and diff-based writing for faster backups. The post also addresses questions about disappearing messages, emphasizing that most will be backed up (except those close to expiration or view-once messages), and provides a timeline for future releases.\n",
    "chinese_title": "公共信号备份测试",
    "chinese_summary": "Signal正在安卓平台上通过staging build发布其全新端到端加密备份系统的公开测试版。该备份系统提供以下几个用户呼声很高的功能：\n\n*   **托管备份：** Signal托管备份，即使本地备份丢失也能保护数据。\n*   **动态媒体卸载：** 通过允许在需要时动态下载媒体来优化存储。\n*   **跨平台兼容性：** 备份格式可被所有客户端读取，支持在Android和iOS之间进行恢复。\n*   **免费和付费层级：** 免费层级备份所有文本内容和最近45天的媒体。付费层级提供100GB的媒体存储空间。\n\n安全和隐私至关重要：备份是端到端加密的，默认禁用，并旨在防止Signal将备份或付款与特定用户关联。\n\n目前测试仅在Android上通过自更新APK提供。我们鼓励测试人员探索用户界面，测试极端情况（例如在备份期间或备份前后发送媒体），并提供关于错误、令人困惑的描述、缺失的功能以及性能问题的反馈。该帖子概述了如何为了测试目的而覆盖免费/付费层级设置。\n\n本地备份仍然存在，并且正在通过新的跨平台格式和基于差异的写入来改进，以实现更快的备份。该帖子还解决了关于阅后即焚消息的问题，强调大多数消息将被备份（除了那些接近过期或一次性查看的消息），并提供了未来发布的计划时间表。"
  },
  {
    "id": "44405423",
    "title": "Restoring a ZX Spectrum+ Toastrack",
    "url": "https://celso.io/posts/2025/06/28/toastrack/",
    "summary": "This blog post details the restoration and improvement of a ZX Spectrum+ 128K \"Toastrack\" computer. The author, a retro-computing enthusiast, recounts childhood memories of the Spectrum and describes the restoration process.\n\nThe initial assessment revealed the machine was in relatively good condition, but required some basic repairs. The author reflowed solder on the main ICs to address booting issues, and tackled the overheating 7805 voltage regulator, replacing it with a cooler DD2712SA buck converter (and later considering a better alternative due to potential noise). A filter with capacitors was added to mitigate noise issues. The edge connector was cleaned and re-soldered to improve peripheral connectivity.\n\nSeveral video quality improvements were implemented, including a chrominance filter on the TEA2000 chip and the removal of modulated audio from the composite and RGB signals. The author also routed the composite video signal to an RCA connector. These mods significantly improved the composite video output.\n\nThe notoriously unreliable membrane keyboard was replaced, and the case and keys were thoroughly cleaned. The mono audio jacks were replaced, and the author discusses a stereo-to-mono cable for connecting to modern audio equipment, also mentions potential audio balance problems and a solution he did not apply.\n\nFinally, the author leveraged the 128K's RGB video output with an RGB2HDMI adapter for a crisp HDMI display. The restored \"Toastrack\" was then tested with games and demos, demonstrating its revitalized functionality and concluding with a plug for a Backbit cartridge.\n",
    "chinese_title": "修复ZX Spectrum+ Toastrack",
    "chinese_summary": "本文详细介绍了ZX Spectrum+ 128K“烤面包架”电脑的修复和改进过程。作者是一位复古计算爱好者，回忆了童年时期的Spectrum电脑，并描述了修复过程。\n\n初步评估显示，机器状况相对良好，但需要一些基本维修。作者重焊了主集成电路上的焊点，以解决启动问题，并解决了7805电压调节器过热问题，将其更换为更凉爽的DD2712SA降压转换器（后来考虑到潜在的噪声问题，又考虑了更好的替代方案）。 添加了一个带有电容器的滤波器来减轻噪声问题。 清理并重新焊接了边缘连接器，以改善外围设备的连接。\n\n实施了多项视频质量改进，包括TEA2000芯片上的色度滤波器，以及从复合和RGB信号中移除调制音频。 作者还将复合视频信号路由到RCA连接器。 这些改装显着改善了复合视频输出。\n\n更换了臭名昭著的不可靠的薄膜键盘，并彻底清洁了外壳和按键。 更换了单声道音频插孔，作者讨论了一种用于连接现代音频设备的立体声转单声道电缆，还提到了潜在的音频平衡问题以及他未应用的解决方案。\n\n最后，作者利用128K的RGB视频输出与RGB2HDMI适配器连接，实现了清晰的HDMI显示。 然后使用游戏和演示测试了修复后的“烤面包架”，展示了其恢复的全部功能，最后推广了Backbit卡带。"
  },
  {
    "id": "44427929",
    "title": "Entropy of a Mixture",
    "url": "https://cgad.ski/blog/entropy-of-a-mixture.html",
    "summary": "This article explores the entropy of a mixture distribution, pλ = (1 - λ)p0 + λp1, and how its shape reveals information about the relationship between the component distributions, p0 and p1. The author highlights that the concavity of entropy leads to an \"upward bulge\" in the graph of H(pλ) versus λ.\n\nA crucial point is that the \"bulge\" corresponds to mutual information, I(X;A), between a draw from pλ and a Bernoulli variable A indicating the origin (p0 or p1) of the draw. This mutual information can be expressed using KL divergences between p0, p1, and pλ.\n\nThe article introduces the concept of \"proclivity,\" Pc(p1, p0), which measures the initial change in entropy when mixing in a small amount of p1 into p0. It relates proclivity to entropy, KL divergence, and the change in cross-entropy with respect to temperature.\n\nFor small λ, the mutual information is approximated by λKL(p1∥p0), which serves as an upper bound. This bound has an interpretation in terms of predictive surprisal: it represents the extra cost of using p0 to predict X instead of having access to the knowledge about A. The author also touches on a Bayesian scenario of testing for a rare condition and interprets the mutual information in this context.\n\nFinally, the article examines higher-order terms in the Taylor series expansion of I(X;A), revealing a connection to the Neyman χ2 divergence. In essence, the shape of H(pλ) encapsulates several key divergence measures between p0 and p1, offering a rich perspective on their relationship.\n",
    "chinese_title": "混合物的熵",
    "chinese_summary": "本文探讨了混合分布 pλ = (1 - λ)p0 + λp1 的熵，以及其形状如何揭示关于分量分布 p0 和 p1 之间关系的信息。作者强调，熵的凹性导致 H(pλ) 相对于 λ 的图表中出现“向上凸起”。\n\n关键一点是，“凸起”对应于从 pλ 中抽取的样本与指示样本来源（p0 或 p1）的伯努利变量 A 之间的互信息 I(X;A)。此互信息可以使用 p0、p1 和 pλ 之间的 KL 散度来表达。\n\n本文介绍了“倾向性”的概念，Pc(p1, p0)，它衡量将少量 p1 混入 p0 时熵的初始变化。它将倾向性与熵、KL 散度以及相对于温度的交叉熵变化联系起来。\n\n对于小的 λ，互信息近似于 λKL(p1∥p0)，它作为一个上界。这个界限可以用预测惊异度来解释：它表示使用 p0 预测 X 而不是知道 A 的额外成本。作者还涉及测试罕见情况的贝叶斯情景，并在此背景下解释互信息。\n\n最后，本文考察了 I(X;A) 的泰勒级数展开式中的高阶项，揭示了与 Neyman χ2 散度的联系。本质上，H(pλ) 的形状概括了 p0 和 p1 之间的几个关键散度度量，为它们的关系提供了丰富的视角。"
  },
  {
    "id": "44413600",
    "title": "LLM Memory",
    "url": "https://grantslatton.com/llm-memory",
    "summary": "This article explores the complexities of building memory systems for LLMs, particularly for tasks like story generation. The author highlights the challenges of limited context windows and the need for consistent world-building, character development, and fact storage.\n\nKey concepts discussed include:\n\n*   **Reference Frames:** All knowledge exists within a specific context (time, location, or even fictional universes), making simple key-value stores insufficient.\n*   **Vector Embeddings:** While useful for semantic similarity, they struggle with episodic memories and lack explainability.\n*   **Knowledge Graphs:** A network of interconnected memories, with nodes representing information and edges representing relationships. The author favors a document-based approach with unlabeled edges and cheap agents crawling the graph. Semantic edges can be useful for things like temporal ordering.\n*   **Meta-documents:** The idea of creating summaries and analyses of previous queries, which can improve efficiency, akin to recalling the last time a memory was recalled.\n*   **Connection Creation & Forgetting:** Discusses strategies for creating connections between documents and the need to prune unused connections to avoid graph overload, potentially using LLMs to judge and remove unnecessary links.\n*   **Episodic Memory:** Simulating human-like recall through episodes of sensory input and daily \"sleep\" cycles to synthesize learnings and meta-documents.\n*   **Traversal Agent:** A system to search the knowledge graph for answers to queries. Discusses different techniques for throwing all of the information into context, or employing a priority queue type situation.\n*   **Databases:** A point that using databases such as SQLite may be an appropriate model for LLM storage of memories.",
    "chinese_title": "LLM记忆",
    "chinese_summary": "本文探讨了为大型语言模型构建记忆系统的复杂性，特别是对于故事生成等任务。作者强调了有限上下文窗口的挑战，以及对一致的世界构建、角色发展和事实存储的需求。\n\n讨论的关键概念包括：\n\n*   **参照系：** 所有知识都存在于特定的上下文中（时间、地点，甚至是虚构的宇宙），这使得简单的键值存储不足以胜任。\n*   **向量嵌入：** 虽然向量嵌入在语义相似性方面很有用，但它们在情景记忆方面存在困难，并且缺乏可解释性。\n*   **知识图谱：** 一个相互连接的记忆网络，其中节点代表信息，边代表关系。作者倾向于采用基于文档的方法，使用未标记的边和低成本的代理来爬取图谱。语义边对于时间排序等任务可能有用。\n*   **元文档：** 创建先前查询的摘要和分析，可以提高效率，类似于回忆上次回忆起某个记忆的时间。\n*   **连接创建与遗忘：** 讨论了在文档之间创建连接的策略，以及剪除未使用的连接以避免图谱过载的需求，可能使用大型语言模型来判断和删除不必要的链接。\n*   **情景记忆：** 通过感官输入和每日“睡眠”周期模拟人类般的记忆回溯，以综合学习和元文档。\n*   **遍历代理：** 一个用于在知识图谱中搜索查询答案的系统。讨论了将所有信息投入上下文或采用优先级队列类型的不同技术。\n*   **数据库：** 指出使用SQLite等数据库可能是大型语言模型存储记忆的合适模型。"
  },
  {
    "id": "44430286",
    "title": "Nimtable: Open-source web UI to browse and manage Apache Iceberg tables",
    "url": "https://github.com/nimtable/nimtable",
    "summary": "Nimtable is an open-source web UI designed to simplify the management and exploration of Apache Iceberg catalogs and data lakes. It offers a user-friendly platform for browsing tables, running queries, analyzing file distributions, and optimizing storage layouts.\n\nKey features include multi-catalog support (REST, AWS Glue, S3 Tables, PostgreSQL), seamless object store integration (S3, Cloudflare R2, Minio), interactive querying, AI-powered assistance, and tools for table optimization like file compaction and snapshot expiration. Nimtable also functions as a standard Iceberg REST Catalog, adapting underlying catalogs to a RESTful API.\n\nThe application can be easily deployed using Docker. Configuration is managed through a web UI or a YAML file, supporting different catalog types and AWS credential options.\n\nThe roadmap includes optimized compaction strategies, enhanced monitoring and analytics, database caching, broader query engine integration, improved metadata management, robust security and access control, data lineage tracking, and advanced AI Copilot support. Contributions are welcome, and the project is licensed under Apache License 2.0.\n",
    "chinese_title": "Nimtable: 用于浏览和管理 Apache Iceberg 表的开源 Web UI",
    "chinese_summary": "Nimtable：简化的 Iceberg 数据湖管理和探索平台。\n\nNimtable 是一个开源 Web UI，旨在简化 Apache Iceberg 目录和数据湖的管理与探索。它提供了一个用户友好的平台，用于浏览表、运行查询、分析文件分布以及优化存储布局。\n\n主要功能包括多目录支持（REST、AWS Glue、S3 Tables、PostgreSQL）、无缝对象存储集成（S3、Cloudflare R2、Minio）、交互式查询、AI 辅助以及表优化工具（如文件压缩和快照过期）。Nimtable 还可以作为标准的 Iceberg REST Catalog 使用，将底层目录适配为 RESTful API。\n\n该应用程序可以使用 Docker 轻松部署。配置通过 Web UI 或 YAML 文件管理，支持不同的目录类型和 AWS 凭证选项。\n\n路线图包括优化的压缩策略、增强的监控和分析、数据库缓存、更广泛的查询引擎集成、改进的元数据管理、强大的安全性和访问控制、数据沿袭跟踪以及高级 AI Copilot 支持。欢迎贡献，该项目采用 Apache License 2.0 许可证。"
  },
  {
    "id": "44424194",
    "title": "Donkey Kong Country 2 and Open Bus",
    "url": "https://jsgroth.dev/blog/posts/dkc2-open-bus/",
    "summary": "This article investigates a long-standing bug in the ZSNES emulator affecting Donkey Kong Country 2, where spinning barrels rotate uncontrollably. The author, jsgroth, explains that this bug is due to ZSNES's lack of proper \"open bus\" emulation, a behavior where reading from an invalid memory address returns the last value placed on the data bus.\n\nThe author delves into the 65816 CPU architecture used in the SNES, explaining memory banking and addressing. They identify the specific code responsible for the barrel rotation and disassemble it to understand the logic. The code reads the barrel orientation, adds a rotation amount, and then uses a bitwise XOR and AND operation to determine if the barrel has reached a cardinal or ordinal direction. If it has, the barrel is rounded to that direction and the rotation stops.\n\nCrucially, the code incorrectly uses an absolute addressing mode `and $2000`, triggering the open bus read from address $2000 in bank $B3, which on actual hardware returns 0x2020. However, because of the constant 0x2020, this works. Without open bus emulation, the AND result is always zero, causing the barrel to spin continuously.\n\nThe author posits that the `and $2000` instruction was a typo, intended to be `and #$2000` (immediate addressing), effectively using the constant 0x2000. By changing this single byte in the ROM, the bug is fixed even without open bus emulation. The author concludes that this was an academic exercise driven by curiosity, as the issue is prevalent only in the outdated ZSNES emulator.\n",
    "chinese_title": "森喜刚国度2与开放式巴士",
    "chinese_summary": "本文调查了ZSNES模拟器中存在已久的、影响《森喜刚2》的漏洞，该漏洞表现为旋转木桶不受控制地旋转。作者jsgroth解释说，此漏洞源于ZSNES缺乏正确的“开放总线”模拟，即读取无效内存地址时会返回数据总线上最后一个值。\n\n作者深入研究了SNES中使用的65816 CPU架构，解释了内存库和寻址。他们确定了负责木桶旋转的特定代码，并对其进行反汇编以理解其逻辑。代码读取木桶方向，增加旋转量，然后使用按位异或和与操作来确定木桶是否已到达基点或序点方向。如果已到达，则木桶将被舍入到该方向，并且旋转停止。\n\n至关重要的是，该代码错误地使用了绝对寻址模式 `and $2000`，从而触发了从库$B3中地址$2000的开放总线读取，在实际硬件上会返回0x2020。但是，由于常量0x2020，这能正常工作。如果没有开放总线模拟，则AND结果始终为零，导致木桶持续旋转。\n\n作者假设 `and $2000` 指令是一个错字，本应是 `and #$2000` (立即寻址)，实际上是使用常量0x2000。 通过更改ROM中的这个单字节，即使没有开放总线模拟，该漏洞也能被修复。 作者得出结论，这是一种出于好奇心驱动的学术练习，因为该问题仅在过时的ZSNES模拟器中普遍存在。"
  },
  {
    "id": "44434355",
    "title": "I am not a supplier (2022)",
    "url": "https://www.softwaremaxims.com/blog/not-a-supplier",
    "summary": "Thomas Depierre's article \"I am not a supplier\" challenges the application of \"Software Supply Chain\" concepts to Free and Open Source Software (FOSS). He argues that FOSS developers and maintainers are not suppliers in the traditional sense because there is no formal business relationship or transaction involved in using their code.\n\nDepierre explains that the term \"Supply Chain\" originates in manufacturing, where companies rely on a network of suppliers to produce their goods, fostering deep relationships to mitigate risks. The software industry, however, has adopted this term to describe the dependencies on FOSS libraries, often without considering the implications.\n\nThe core argument is that FOSS licenses explicitly state \"AS IS,\" meaning developers offer their code without any warranties or liabilities. Users freely utilize these libraries at their own risk. He asserts that imposing \"Software Supply Chain\" rules, such as strict testing, security protocols, and access control measures, on FOSS developers is inappropriate because they are volunteers who contribute to the community without compensation. He argues many are already stretched thin and struggle to maintain their projects, which already underpin much of the digital economy.\n\nDepierre suggests that if companies require specific development practices or guarantees, they should engage FOSS developers as suppliers by offering fair compensation under a different license agreement. Until then, treating FOSS developers as unpaid suppliers demanding compliance is unreasonable; companies are essentially benefiting from \"free code\" found through public means. The article concludes by emphasizing that FOSS is provided \"AS IS,\" reinforcing the lack of a supplier-customer relationship.\n",
    "chinese_title": "我不是供应商 (2022)",
    "chinese_summary": "托马斯·德皮埃尔的文章《我不是供应商》对将“软件供应链”概念应用于自由及开源软件（FOSS）提出了质疑。他认为，FOSS开发者和维护者并非传统意义上的供应商，因为在使用他们的代码时，不存在正式的商业关系或交易。\n\n德皮埃尔解释说，“供应链”一词起源于制造业，在该领域，公司依靠供应商网络来生产商品，从而建立深入的关系以降低风险。然而，软件行业采用了这个术语来描述对FOSS库的依赖，常常没有考虑到其含义。\n\n核心论点是，FOSS许可证明确声明“按原样”提供，这意味着开发者在不提供任何保证或承担任何责任的情况下提供他们的代码。用户可以自行承担风险自由使用这些库。他断言，对FOSS开发者施加“软件供应链”规则，例如严格的测试、安全协议和访问控制措施，是不恰当的，因为他们是志愿者，他们无偿地为社区做出贡献。他认为，许多人已经不堪重负，难以维护他们的项目，而这些项目已经支撑了数字经济的很大一部分。\n\n德皮埃尔建议，如果公司需要特定的开发实践或保证，他们应该通过在不同的许可协议下提供公平的报酬来聘请FOSS开发者作为供应商。在此之前，将FOSS开发者视为要求合规的无偿供应商是不合理的；公司本质上是从公共渠道获得的“免费代码”中受益。文章最后强调，FOSS是“按原样”提供的，强化了缺乏供应商-客户关系这一事实。"
  },
  {
    "id": "44421978",
    "title": "Printegrated Circuits: Merging 3D Printing and Electronics",
    "url": "https://spectrum.ieee.org/3d-printing-smart-objects",
    "summary": "This article introduces \"Printegrated Circuits,\" a novel approach to manufacturing that integrates electronic components directly into 3D-printed objects. Oliver Child is developing techniques to streamline this process, making it easier to embed printed circuit boards and conductive elements during the 3D printing process. The article suggests this method promises to revolutionize the creation of smart, functional 3D-printed items by seamlessly combining structural elements with electronic functionality. This could have significant implications for consumer electronics and other industries. Alfred Poor, the author, is a former editor of Health Tech Insider and a contributor to IEEE Spectrum, lending credibility to the technology and its potential impact. In essence, the article highlights a promising advancement that merges 3D printing and electronics for enhanced product capabilities.\n",
    "chinese_title": "预印制电路：融合3D打印与电子学",
    "chinese_summary": "本文介绍了“印刷集成电路”这一新型制造方法，它将电子元件直接集成到3D打印物体中。Oliver Child正在开发简化此过程的技术，使其更容易在3D打印过程中嵌入印刷电路板和导电元件。文章认为，这种方法有望通过将结构元素与电子功能无缝结合，彻底改变智能、功能性3D打印物品的制造。这可能对消费电子产品和其他行业产生重大影响。作者Alfred Poor曾是Health Tech Insider的编辑，也是IEEE Spectrum的撰稿人，这增加了该技术及其潜在影响的可信度。总而言之，本文重点介绍了一项将3D打印和电子技术融合以增强产品功能的有前景的进步。"
  },
  {
    "id": "44423263",
    "title": "Cloud-forming isoprene and terpenes from crops may drastically improve climate",
    "url": "https://www.smithsonianmag.com/science-nature/scientists-are-just-beginning-to-understand-how-life-makes-clouds-and-their-discoveries-may-drastically-improve-climate-science-180986872/",
    "summary": "This article explores the significant role of biological processes, specifically gases emitted by plants and plankton, in cloud formation and climate regulation. Scientists are discovering that these \"biogenic\" vapors contribute more to cloud formation than previously thought, influencing how accurately climate models can predict future climate scenarios.\n\nThe CLAW hypothesis proposed that marine algae release gases that form clouds, which then shade the ocean and regulate algae growth. Researchers have since observed that oceans directly eject biological particles into the atmosphere, aiding ice crystal formation and cloud development at higher temperatures.\n\nOn land, studies at CERN have identified specific molecules from trees, like monoterpenes and isoprene, that contribute to aerosol formation and cloud development. Isoprene, even in small concentrations, creates aerosol particles at high rates, which then descend and form clouds.\n\nThe inclusion of these biological factors in climate models is complex and has led to varying predictions. Accurate climate simulations require immense computer power, limiting the level of detail that can be incorporated.\n\nDespite these challenges, advancements are being made in modeling cloud physics and incorporating organic material from sea spray. Improved climate models, informed by clearer cloud science, are crucial for preparing for dangerous climate scenarios and evaluating geoengineering solutions.\n\nResearch indicates that restoring forests could have a larger climate mitigation potential than previously thought due to the cooling effect of aerosols and clouds formed from plant vapors. As air pollution decreases, the influence of these biogenic factors on cloud formation becomes increasingly important for understanding and addressing climate change.\n",
    "chinese_title": "农作物释放的形成云的异戊二烯和萜烯可能显著改善气候。",
    "chinese_summary": "生物过程在云形成和气候调节中的重要作用\n\n本文探讨了生物过程，特别是植物和浮游生物排放的气体，在云形成和气候调节中的重要作用。科学家们正在发现，这些“生物源”挥发物对云形成的贡献比之前认为的更大，从而影响气候模型预测未来气候情景的准确性。\n\nCLAW假说提出，海洋藻类释放形成云的气体，这些云随后遮蔽海洋并调节藻类生长。研究人员后来观察到，海洋直接将生物颗粒喷射到大气中，有助于冰晶形成和在较高温度下形成云。\n\n在陆地上，欧洲核子研究中心的（CERN）研究已经确定了来自树木的特定分子，如单萜和异戊二烯，它们有助于气溶胶的形成和云的形成。即使在低浓度下，异戊二烯也会以高速率产生气溶胶颗粒，然后下降并形成云。\n\n将这些生物因素纳入气候模型非常复杂，并导致不同的预测结果。准确的气候模拟需要巨大的计算机能力，从而限制了可以纳入的细节水平。\n\n尽管存在这些挑战，但在模拟云物理和纳入海浪产生的有机物方面正在取得进展。改进的气候模型，得益于更清晰的云科学，对于应对危险的气候情景和评估地球工程解决方案至关重要。\n\n研究表明，由于植物蒸气形成的气溶胶和云所产生的冷却效应，恢复森林可能比以前认为的具有更大的气候缓解潜力。随着空气污染的减少，这些生物源因素对云形成的影响对于理解和应对气候变化变得越来越重要。"
  },
  {
    "id": "44427331",
    "title": "Bulk Lots of DB-19s for Sale",
    "url": "https://www.bigmessowires.com/2025/06/30/bulk-lots-of-db-19s-for-sale/",
    "summary": "In a blog post dated June 30th, 2025, Steve announces the sale of bulk lots of DB-19 connectors. He explains that he unintentionally became the world's largest holder of these connectors after commissioning a factory in 2016 to manufacture them for his BMOW Floppy Emu disk emulator due to their scarcity. The DB-19, a 19-pin connector common in vintage Apple, Atari, and NeXT computers, ceased production in the 1990s, leading to a shortage in the retrocomputing community.\n\nSteve, previously reluctant to sell his stock, is now offering the DB-19s in lots of 1000, starting with an eBay auction. The starting bid translates to $0.44 per connector, a significantly lower price compared to their market value when available. He clarifies that he won't sell individual connectors or small lots, hoping someone will buy in bulk and resell in smaller quantities. Larger quantities beyond the auction are negotiable.\n\nThe connectors are newly manufactured in 2024, identical to those used in BMOW products. They are DB-19 male connectors with solder cup terminals and all-metal shells, suitable for cable making or edge-mounting on PCBs. They are packaged in trays of 50, with 20 trays per box. He includes a link to the eBay auction listing which ends July 8th. A commenter, Roy, asks about the total quantity Steve possesses and the minimum order quantity from the initial manufacturing run.\n",
    "chinese_title": "批量出售DB-19连接器",
    "chinese_summary": "在2025年6月30日的博文中，史蒂夫宣布出售大批DB-19连接器。他解释说，由于DB-19连接器稀缺，他于2016年委托一家工厂为他的BMOW Floppy Emu磁盘模拟器制造这些连接器后，无意中成为了世界上最大的DB-19连接器持有者。DB-19是一种19针连接器，常见于老式Apple、Atari和NeXT计算机，在20世纪90年代停止生产，导致复古计算社区出现短缺。\n\n史蒂夫此前一直不愿出售库存，现在正以1000个为一批提供DB-19连接器，首先从eBay拍卖开始。起拍价相当于每个连接器0.44美元，远低于它们上市时的市场价值。他明确表示，他不会出售单个连接器或小批量连接器，希望有人批量购买并以较小的数量转售。超出拍卖数量的更大数量可以协商。\n\n这些连接器是2024年新生产的，与BMOW产品中使用的连接器相同。它们是带有焊接杯端子和全金属外壳的DB-19公头连接器，适用于电缆制造或PCB上的边缘安装。它们以每盘50个的方式包装，每箱20盘。他提供了一个指向eBay拍卖列表的链接，该列表将于7月8日结束。一位评论者Roy询问史蒂夫拥有的总数量以及最初生产运行的最小订购数量。"
  },
  {
    "id": "44432805",
    "title": "Science's Pirate Queen Gets a Memecoin: Sci-Hub Explores New Funding",
    "url": "https://www.forbes.com/sites/digital-assets/2025/06/30/sciences-pirate-queen-gets-a-memecoin-sci-hub-explores-new-funding/",
    "summary": "This Forbes article explores Alexandra Elbakyan's Sci-Hub, a website providing free access to millions of academic papers locked behind paywalls, and its unconventional experiment with cryptocurrency funding. Facing legal battles from publishers like Elsevier, Elbakyan, dubbed \"Science's Pirate Queen,\" has relied on donations to keep Sci-Hub operational.\n\nIn 2024, supporters launched the $SCIHUB memecoin to fund Sci-Hub, briefly reaching a $20 million market cap. However, the project faced challenges, including a lack of trust from supporters and accusations of a \"rug pull\" when Elbakyan migrated the project to a new token address controlled directly by Sci-Hub.\n\nThe article argues that cryptocurrency's appeal lies in its ability to operate outside traditional power structures, attracting both speculators and those seeking alternative funding models for causes like open science. Elbakyan's anti-establishment stance and communist ideals resonate with this movement.\n\nThe piece highlights the generational divide, noting that cryptocurrency appeals to younger generations facing economic displacement and distrust in traditional institutions. Elbakyan's journey from struggling researcher to cryptocurrency pioneer symbolizes the potential for individuals to challenge institutional power through technology.\n\nUltimately, the article suggests that the $SCIHUB experiment reflects a broader transformation in how knowledge, money, and power operate in the digital age, especially considering the increasing need for open access to scholarly literature for AI training.\n",
    "chinese_title": "科学海盗女王获发行模因币：Sci-Hub探索新融资方式",
    "chinese_summary": "这篇福布斯文章探讨了亚历山德拉·埃尔巴基扬的Sci-Hub，该网站提供免费访问数百万被锁定在付费墙后的学术论文，以及其非常规的加密货币资助实验。面对来自爱思唯尔等出版商的法律诉讼，埃尔巴基扬被誉为“科学海盗女王”，一直依靠捐款来维持Sci-Hub的运营。\n\n2024年，支持者推出了$SCIHUB迷因币，旨在资助Sci-Hub，市值一度达到2000万美元。然而，该项目面临挑战，包括缺乏支持者的信任，以及当埃尔巴基扬将项目迁移到一个由Sci-Hub直接控制的新代币地址时，被指控为“rug pull”（卷款跑路）。\n\n文章认为，加密货币的吸引力在于其能够在传统权力结构之外运作，吸引了投机者和那些为开放科学等事业寻求替代融资模式的人。埃尔巴基扬的反建制立场和共产主义理想与这场运动产生了共鸣。\n\n文章强调了代际差异，指出加密货币对面临经济困境和不信任传统机构的年轻一代具有吸引力。埃尔巴基扬从苦苦挣扎的研究人员到加密货币先驱的旅程，象征着个人通过技术挑战机构权力的潜力。\n\n最终，文章表明，$SCIHUB实验反映了知识、金钱和权力在数字时代运作方式的更广泛变革，尤其是考虑到人工智能训练对开放获取学术文献的需求日益增长。"
  },
  {
    "id": "44397482",
    "title": "So you want to serialize some DER?",
    "url": "https://alexgaynor.net/2025/jun/20/serialize-some-der/",
    "summary": "This article details the author's journey optimizing DER serialization in their Rust library, rust-asn1, using the Claude AI model to improve the efficiency of integer length calculation. Initially, the author sought to optimize the pre-computation of integer lengths for serialization, discovering inefficiencies in the existing code and generated assembly.\n\nAfter some trial and error, Claude produced code that looked good and was verified as correct with Alive2, a formal verification tool. This led to the discovery of a missed optimization in LLVM (Low Level Virtual Machine), a compiler infrastructure project.\n\nThe author, initially hesitant, then tasked Claude with implementing the optimization directly in LLVM. The model successfully added a test case and implemented the necessary changes, even incorporating feedback from LLVM maintainers during code review.\n\nThe author concludes that LLMs, when combined with verification tools, can be surprisingly effective at complex coding tasks, especially when clear success criteria are defined. They highlight the importance of human review in ensuring the quality and correctness of the AI-generated code. The article also emphasizes the existence of undiscovered compiler optimizations and the relative ease of contributing these improvements, with the aid of AI, to projects like LLVM.\n",
    "chinese_title": "所以你想序列化一些DER数据？",
    "chinese_summary": "本文详细介绍了作者使用 Claude AI 模型优化其 Rust 库 rust-asn1 中 DER 序列化的过程，以提高整数长度计算的效率。 最初，作者试图优化序列化前整数长度的预计算，发现了现有代码和生成的汇编代码中的效率低下问题。\n\n经过一些尝试和错误，Claude 生成的代码看起来不错，并使用形式验证工具 Alive2 验证为正确。 这导致发现了 LLVM（底层虚拟机）中一个遗漏的优化，LLVM 是一个编译器基础设施项目。\n\n最初犹豫不决的作者随后让 Claude 直接在 LLVM 中实现优化。 该模型成功地添加了一个测试用例并实现了必要的更改，甚至在代码审查期间整合了来自 LLVM 维护者的反馈。\n\n作者得出结论，大型语言模型 (LLM) 与验证工具结合使用时，在复杂的编码任务中可能出人意料地有效，尤其是在定义了明确的成功标准时。 他们强调了人工审查在确保 AI 生成代码的质量和正确性方面的重要性。 本文还强调了未被发现的编译器优化的存在，以及在 AI 的帮助下，相对容易地为 LLVM 等项目贡献这些改进。"
  },
  {
    "id": "44433709",
    "title": "Higher levels of trust in people and institutions linked to greater well-being",
    "url": "https://phys.org/news/2025-06-higher-people-linked-greater.html",
    "summary": "This article, published in Psychological Bulletin and summarized by the American Psychological Association, explores the link between trust and well-being. A meta-analysis of nearly 1,000 studies involving over 2.5 million participants from around the globe found a strong correlation between higher levels of trust (interpersonal, institutional, and generalized) and increased subjective well-being.\n\nSubjective well-being, defined as how people feel about their own lives, encompassing both emotional experiences (happiness, sadness, anxiety, depressive symptoms) and reflective judgments (life satisfaction), was found to be higher in individuals who reported greater trust in others and institutions.\n\nThe research also demonstrated a reciprocal relationship: trust boosts well-being, and enhanced well-being leads to increased trust over time. Supportive, healthy relationships, which are fundamental to well-being, depend on trust, potentially explaining the observed link.\n\nThe authors, including Catrin Finkenauer and Marlies Maes of Utrecht University, emphasized the importance of fostering trust in a world where misinformation can erode it. They advocate for media literacy, fair regulations, and environments where people can rely on each other, highlighting the responsibility of families, schools, and governments in building trust to support mental health and stronger communities.\n",
    "chinese_title": "对人和机构的更高信任度与更高的幸福感相关。",
    "chinese_summary": "发表于《心理学通报》并由美国心理学协会总结的文章探讨了信任与幸福感之间的联系。一项对来自全球超过250万名参与者的近1000项研究的荟萃分析发现，更高水平的信任（人际、机构和普遍信任）与更高的主观幸福感之间存在很强的相关性。\n\n主观幸福感被定义为人们对自己生活的感受，包括情感体验（快乐、悲伤、焦虑、抑郁症状）和反思性判断（生活满意度），研究发现，在那些表示对他人和机构有更大信任的个体中，主观幸福感更高。\n\n该研究还表明了一种互惠关系：信任可以提升幸福感，而增强的幸福感随着时间的推移会增加信任。支持性的、健康的关系对幸福感至关重要，而这有赖于信任，这或许可以解释观察到的联系。\n\n包括乌特勒支大学的Catrin Finkenauer和Marlies Maes在内的作者强调了在一个虚假信息可能侵蚀信任的世界中培养信任的重要性。他们提倡媒体素养、公平的规章制度以及人们可以相互依赖的环境，强调家庭、学校和政府在建立信任以支持心理健康和更强大的社区方面的责任。"
  },
  {
    "id": "44402618",
    "title": "Creating fair dice from random objects",
    "url": "https://arstechnica.com/science/2025/05/your-next-gaming-dice-could-be-shaped-like-a-dragon-or-armadillo/",
    "summary": "Researchers have developed a method to design \"fair\" dice in virtually any shape, including kittens, dragons, and armadillos. This departs from traditional dice shapes (cubes and polyhedra) and allows for dice with non-uniform probability distributions. The research, led by Hossein Baktash and Keenan Crane, focuses on using analytical geometry to predict the resting configurations of rigid bodies when tossed, rather than relying on dynamical simulations.\n\nThe team mapped the corners, edges, and faces of the dice onto a sphere and simulated the effects of gravity to estimate the probability of each resting configuration. They validated their computer simulations by 3D-printing seven unusual dice designs and conducting thousands of trial throws, tweaking the shapes to align experimental results with predicted probabilities.\n\nThe resulting dice included designs mimicking the rolling of two six-sided dice, coin flips, and single dice with three equally likely outcomes represented by the animal shapes. The algorithm can even predict the resting configurations of objects like the pig from \"Pass the Pigs\" game.\n\nWhile the method has limitations – ignoring factors like friction and bouncing – it is deemed sufficient for creating fun and engaging tabletop game dice. The researchers also envision applications in areas like underwater construction, where precise orientation of objects is crucial. The STL files for the designs have been made available for 3D printing. Despite the existence of more precise random number generators through computers, the study emphasizes the tactile and entertaining aspect of dice rolling.\n",
    "chinese_title": "利用随机物品制作公平骰子",
    "chinese_summary": "研究人员开发出一种设计“公平”骰子的方法，几乎可以设计成任何形状，包括小猫、龙和犰狳。这与传统的骰子形状（立方体和多面体）不同，并允许设计具有非均匀概率分布的骰子。这项由Hossein Baktash和Keenan Crane领导的研究，侧重于使用解析几何来预测刚性物体被抛掷时的静止构型，而不是依赖于动态模拟。\n\n该团队将骰子的角、边和面映射到一个球体上，并模拟重力影响来估计每个静止构型的概率。他们通过3D打印七种不同寻常的骰子设计并进行数千次试验投掷来验证他们的计算机模拟，并调整形状以使实验结果与预测的概率一致。\n\n由此产生的骰子包括模拟两个六面骰子滚动、抛硬币以及由动物形状代表的具有三个等概率结果的单个骰子的设计。该算法甚至可以预测像“Pass the Pigs”游戏中猪的静止构型。\n\n虽然该方法存在局限性——忽略了摩擦和弹跳等因素——但它被认为足以创造出有趣且引人入胜的桌面游戏骰子。研究人员还设想了在水下建筑等领域的应用，在这些领域中，物体的精确方向至关重要。这些设计的STL文件已被提供用于3D打印。尽管存在通过计算机实现的更精确的随机数生成器，但该研究强调了骰子滚动的触觉和娱乐性。"
  },
  {
    "id": "44433980",
    "title": "Writing Code Was Never the Bottleneck",
    "url": "https://ordep.dev/posts/writing-code-was-never-the-bottleneck",
    "summary": "This article argues that while Large Language Models (LLMs) have significantly reduced the time and cost of writing code, they haven't addressed the real bottleneck in software engineering: understanding, testing, and maintaining code.\n\nThe author contends that traditional bottlenecks like code reviews, knowledge transfer, debugging, and team coordination remain, and are potentially exacerbated by LLMs. While LLMs can rapidly generate code, this influx can overwhelm review processes, especially when authors lack a full understanding of the generated code, or when the code introduces unfamiliar patterns or hidden edge cases.\n\nThe article emphasizes that understanding code, not writing it, is the most significant cost in software development. LLMs haven't changed the effort required to reason about behavior, identify bugs, or ensure long-term maintainability. This challenge is compounded when reviewers struggle to differentiate between generated and handwritten code.\n\nThe author stresses the importance of collaborative software engineering, built on shared understanding, alignment, and mentorship. Rapid code generation can strain these processes, potentially leading to a reliance on assumed quality rather than ensured quality.\n\nUltimately, the article advocates for recognizing that LLMs, while valuable for prototyping and automation, don't negate the need for clear thinking, careful review, and thoughtful design. The cost of team understanding remains the true bottleneck, and should not be overlooked in the rush to leverage AI-generated code.\n",
    "chinese_title": "编写代码从来都不是瓶颈",
    "chinese_summary": "大型语言模型降低了代码编写的时间和成本，但并未解决软件工程的真正瓶颈：理解、测试和维护代码。"
  },
  {
    "id": "44427147",
    "title": "Price of rice in Japan falls below ¥4k per 5kg",
    "url": "https://www.japantimes.co.jp/news/2025/06/24/japan/japan-rice-price-falls-below-4000/",
    "summary": "The price of rice in Japan has fallen below ¥4,000 per 5 kilograms for the first time since early March, reaching ¥3,920 in the week ending June 15th. This drop, the largest since March 2022, is attributed to the government's release of stockpiled rice under discretionary contracts. Prime Minister Ishiba had aimed for this price range by mid-June.\n\nWhile the price decrease is a significant step, Agriculture Minister Koizumi cautioned against complacency, noting that prices are still significantly higher (¥1,772) than a year ago. Major retailers have been selling government stockpiled rice at around ¥2,000 per 5 kilograms, and the inclusion of smaller retailers is further amplifying the impact of the government's efforts to control rising rice prices. The article highlights the government's commitment to curbing abnormally high rice prices and acknowledges the progress made while emphasizing the need for continued vigilance.\n",
    "chinese_title": "日本大米价格跌破每5公斤4000日元",
    "chinese_summary": "日本大米价格自3月初以来首次跌破每5公斤4000日元，截至6月15日当周达到3920日元。这次下跌是自2022年3月以来最大的一次，原因是政府根据自由裁量合同释放了储备大米。首相石破茂曾希望在6月中旬前达到这个价格范围。\n\n虽然价格下降是重要一步，但农业大臣小泉提醒不要自满，指出价格仍比一年前高出很多（1772日元）。主要零售商一直以每5公斤约2000日元的价格出售政府储备大米，小型零售商的加入进一步扩大了政府控制大米价格上涨的影响。该文章强调了政府遏制异常高昂大米价格的决心，并承认已取得的进展，同时强调需要继续保持警惕。"
  },
  {
    "id": "44429695",
    "title": "Rust CLI with Clap",
    "url": "https://tucson-josh.com/posts/rust-clap-cli/",
    "summary": "生成摘要时出错",
    "chinese_title": "Rust CLI with Clap",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44426307",
    "title": "Meta Joins Kotlin Foundation",
    "url": "https://engineering.fb.com/2025/06/30/android/meta-joins-kotlin-foundation/",
    "summary": "生成摘要时出错",
    "chinese_title": "Meta Joins Kotlin Foundation",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44422480",
    "title": "Show HN: TokenDagger – A tokenizer faster than OpenAI's Tiktoken",
    "url": "https://github.com/M4THYOU/TokenDagger",
    "summary": "生成摘要时出错",
    "chinese_title": "Show HN: TokenDagger – A tokenizer faster than OpenAI's Tiktoken",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44429457",
    "title": "Why email startups fail",
    "url": "https://forwardemail.net/en/blog/docs/email-startup-graveyard-why-80-percent-email-companies-fail",
    "summary": "生成摘要时出错",
    "chinese_title": "Why email startups fail",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44399123",
    "title": "Show HN: Open-Source International Space Station Tracker ESP32/Arduino for $20",
    "url": "https://github.com/GuitarML/SpaceStationTracker",
    "summary": "生成摘要时出错",
    "chinese_title": "Show HN: Open-Source International Space Station Tracker ESP32/Arduino for $20",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44428260",
    "title": "Transformers Are Graph Neural Networks",
    "url": "https://arxiv.org/abs/2506.22084",
    "summary": "生成摘要时出错",
    "chinese_title": "Transformers Are Graph Neural Networks",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44426049",
    "title": "High-Severity Vulnerability in Notepad++",
    "url": "https://www.csa.gov.sg/alerts-and-advisories/alerts/al-2025-063",
    "summary": "生成摘要时出错",
    "chinese_title": "High-Severity Vulnerability in Notepad++",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44423983",
    "title": "There are no new ideas in AI, only new datasets",
    "url": "https://blog.jxmo.io/p/there-are-no-new-ideas-in-ai-only",
    "summary": "生成摘要时出错",
    "chinese_title": "There are no new ideas in AI, only new datasets",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44421185",
    "title": "The provenance memory model for C",
    "url": "https://gustedt.wordpress.com/2025/06/30/the-provenance-memory-model-for-c/",
    "summary": "生成摘要时出错",
    "chinese_title": "The provenance memory model for C",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44419091",
    "title": "Gridfinity: The modular, open-source grid storage system",
    "url": "https://gridfinity.xyz/",
    "summary": "生成摘要时出错",
    "chinese_title": "Gridfinity: The modular, open-source grid storage system",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44429116",
    "title": "Show HN: Local LLM Notepad – run a GPT-style model from a USB stick",
    "url": "https://github.com/runzhouye/Local_LLM_Notepad",
    "summary": "生成摘要时出错",
    "chinese_title": "Show HN: Local LLM Notepad – run a GPT-style model from a USB stick",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44399792",
    "title": "Researching LED Displays for the Time Circuits",
    "url": "https://www.partsnotincluded.com/researching-time-circuit-led-displays/",
    "summary": "生成摘要时出错",
    "chinese_title": "Researching LED Displays for the Time Circuits",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44421776",
    "title": "Show HN: New Ensō – first public beta",
    "url": "https://untested.sonnet.io/notes/new-enso-first-public-beta/",
    "summary": "生成摘要时出错",
    "chinese_title": "Show HN: New Ensō – first public beta",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44398743",
    "title": "Data Centers, Temperature, and Power",
    "url": "https://www.backblaze.com/blog/data-centers-temperature-and-power/",
    "summary": "生成摘要时出错",
    "chinese_title": "Data Centers, Temperature, and Power",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44434793",
    "title": "'The Most Humbling Thing I've Ever Seen': Ford CEO on China's Car Industry",
    "url": "https://insideevs.com/news/764318/ford-ceo-china-evs-humbled/",
    "summary": "生成摘要时出错",
    "chinese_title": "'The Most Humbling Thing I've Ever Seen': Ford CEO on China's Car Industry",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44422356",
    "title": "Reverse Engineering Vercel's BotID",
    "url": "https://www.nullpt.rs/reversing-botid",
    "summary": "生成摘要时出错",
    "chinese_title": "Reverse Engineering Vercel's BotID",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44430263",
    "title": "Virtue garnish: A mental hack to short-circuit bad habits",
    "url": "https://ledgeroflife.blog/virtue-garnishes-the-3-second-mental-hack-that-short-circuits-bad-habits/",
    "summary": "生成摘要时出错",
    "chinese_title": "Virtue garnish: A mental hack to short-circuit bad habits",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44390440",
    "title": "Ultrasound toothbrush promises painless checks for hidden gum problems",
    "url": "https://phys.org/news/2025-06-ultrasound-toothbrush-painless-hidden-gum.html",
    "summary": "生成摘要时出错",
    "chinese_title": "Ultrasound toothbrush promises painless checks for hidden gum problems",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44405937",
    "title": "Jacobi Ellipsoid",
    "url": "https://en.wikipedia.org/wiki/Jacobi_ellipsoid",
    "summary": "生成摘要时出错",
    "chinese_title": "Jacobi Ellipsoid",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44396620",
    "title": "Robotic tongue drummer bangs out all the ambient hits",
    "url": "https://blog.arduino.cc/2025/06/07/this-robotic-tongue-drummer-bangs-out-all-the-ambient-hits/",
    "summary": "生成摘要时出错",
    "chinese_title": "机械舌鼓手敲出所有氛围节奏",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44427244",
    "title": "Ted Chiang on Superintelligence in \"The Hampdenshire Wonder\"",
    "url": "https://lithub.com/ted-chiang-on-superintelligence-and-its-discontents-in-j-d-beresfords-innovative-work-of-early-20th-century-science-fiction/",
    "summary": "生成摘要时出错",
    "chinese_title": "Ted Chiang on Superintelligence in \"The Hampdenshire Wonder\"",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44398809",
    "title": "The Plot of the Phantom, a text adventure that took 40 years to finish",
    "url": "https://scottandrew.com/blog/2025/06/you-can-now-play-plot-of-the-phantom-the-text-adventure-game/",
    "summary": "生成摘要时出错",
    "chinese_title": "The Plot of the Phantom, a text adventure that took 40 years to finish",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44396867",
    "title": "New proof dramatically compresses space needed for computation",
    "url": "https://www.scientificamerican.com/article/new-proof-dramatically-compresses-space-needed-for-computation/",
    "summary": "生成摘要时出错",
    "chinese_title": "New proof dramatically compresses space needed for computation",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44413185",
    "title": "I made my VM think it has a CPU fan",
    "url": "https://wbenny.github.io/2025/06/29/i-made-my-vm-think-it-has-a-cpu-fan.html",
    "summary": "生成摘要时出错",
    "chinese_title": "I made my VM think it has a CPU fan",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44434970",
    "title": "Drug cartel hacked FBI official's phone to track and kill informants",
    "url": "https://arstechnica.com/security/2025/06/mexican-drug-cartel-hacked-fbi-officials-phone-to-track-informant-report-says/",
    "summary": "生成摘要时出错",
    "chinese_title": "Drug cartel hacked FBI official's phone to track and kill informants",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44432900",
    "title": "phkmalloc",
    "url": "https://phk.freebsd.dk/sagas/phkmalloc/",
    "summary": "生成摘要时出错",
    "chinese_title": "phkmalloc",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44427452",
    "title": "CertMate – SSL Certificate Management System",
    "url": "https://github.com/fabriziosalmi/certmate",
    "summary": "生成摘要时出错",
    "chinese_title": "CertMate – SSL Certificate Management System",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44401350",
    "title": "Jane Austen's Boldest Novel Is Also Her Least Understood",
    "url": "https://www.nytimes.com/2025/06/27/books/review/jane-austen-mansfield-park.html",
    "summary": "生成摘要时出错",
    "chinese_title": "Jane Austen's Boldest Novel Is Also Her Least Understood",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44416221",
    "title": "Asynchronous Error Handling Is Hard",
    "url": "https://parallelprogrammer.substack.com/p/asynchronous-error-handling-is-hard",
    "summary": "生成摘要时出错",
    "chinese_title": "Asynchronous Error Handling Is Hard",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44413574",
    "title": "The Medley Interlisp Project: Reviving a Historical Software System [pdf]",
    "url": "https://interlisp.org/documentation/young-ccece2025.pdf",
    "summary": "生成摘要时出错",
    "chinese_title": "The Medley Interlisp Project: Reviving a Historical Software System [pdf]",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44426399",
    "title": "Datadog's $65M/year customer mystery solved",
    "url": "https://blog.pragmaticengineer.com/datadog-65m-year-customer-mystery/",
    "summary": "生成摘要时出错",
    "chinese_title": "Datadog's $65M/year customer mystery solved",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44435037",
    "title": "TikTok moderators in Turkey fight trauma, burnout, union-busting",
    "url": "https://restofworld.org/2025/tiktok-moderators-turkey/",
    "summary": "生成摘要时出错",
    "chinese_title": "TikTok moderators in Turkey fight trauma, burnout, union-busting",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44401358",
    "title": "Cross-Compiling Common Lisp for Windows",
    "url": "https://www.fosskers.ca/en/blog/cl-windows",
    "summary": "生成摘要时出错",
    "chinese_title": "Cross-Compiling Common Lisp for Windows",
    "chinese_summary": "生成摘要时出错"
  }
]