[
  {
    "id": "44973375",
    "title": "Apple Watch wearable foundation model",
    "url": "https://arxiv.org/abs/2507.00191",
    "summary": "This arXiv article (arXiv:2507.00191) presents a novel approach to health prediction using foundation models trained on behavioral data from wearable devices. The authors, led by Eray Erturk and Joseph Futoma, argue that while foundation models are increasingly used with wearable data, they primarily focus on low-level sensor data. The paper highlights the value of behavioral data, which aligns better with physiologically relevant timescales.\n\nThe study develops foundation models using over 2.5 billion hours of wearable data from 162,000 individuals, focusing on optimizing architectures and tokenization strategies specifically for behavioral signals. The model's performance was evaluated on 57 health-related tasks, demonstrating strong results across diverse applications, including individual-level classification and time-varying health state prediction.\n\nA key finding is the model's superior performance in behavior-driven tasks like sleep prediction. The study also showed improved performance when behavioral data representations were combined with raw sensor data representations.\n\nThe authors conclude that tailoring foundation model design to wearables, specifically incorporating behavioral data, unlocks the potential for new health applications. The paper was accepted to ICML 2025 and emphasizes the importance of behavioral data alongside sensor data for improved health predictions using wearable devices.\n",
    "chinese_title": "Apple Watch 可穿戴设备基础模型",
    "chinese_summary": "这篇 arXiv 文章 (arXiv:2507.00191) 提出了一种使用可穿戴设备行为数据训练的基石模型进行健康预测的新方法。由 Eray Erturk 和 Joseph Futoma 领导的作者认为，虽然基石模型越来越多地与可穿戴设备数据一起使用，但它们主要关注于低级传感器数据。该论文强调了行为数据的价值，它与生理相关的时标更一致。\n\n该研究使用来自 162,000 名个体的超过 25 亿小时的可穿戴设备数据开发了基石模型，重点是专门针对行为信号优化架构和分词策略。该模型的性能在 57 项与健康相关的任务上进行了评估，在包括个体水平分类和时变健康状态预测在内的各种应用中表现出强大的结果。\n\n一项关键发现是该模型在行为驱动的任务（如睡眠预测）中的卓越性能。该研究还表明，当行为数据表示与原始传感器数据表示相结合时，性能得到改善。\n\n作者的结论是，针对可穿戴设备定制基石模型设计，特别是整合行为数据，释放了新的健康应用潜力。该论文已被 ICML 2025 接收，并强调了行为数据与传感器数据对于使用可穿戴设备改进健康预测的重要性。"
  },
  {
    "id": "44972151",
    "title": "AWS CEO says using AI to replace junior staff is 'Dumbest thing I've ever heard'",
    "url": "https://www.theregister.com/2025/08/21/aws_ceo_entry_level_jobs_opinion/",
    "summary": "AWS CEO Matt Garman strongly opposes the idea of using AI to replace junior staff, calling it \"the dumbest thing I've ever heard.\" He argues that junior employees are inexpensive, AI-savvy, and crucial for future talent development. He believes companies should continue hiring and training young graduates, as they represent the future of software development.\n\nGarman also criticizes measuring AI's value solely by the percentage of code it generates, arguing that quality matters more than quantity. He notes that while over 80% of AWS developers utilize AI in various ways (writing tests, documentation, code, or collaborating with AI agents), the focus should be on fostering critical thinking, problem-solving, and a continuous learning mindset in employees.\n\nHe emphasizes that with rapid technological advancements, traditional skills may not be sufficient for long-term career success. Instead, education should prioritize teaching individuals how to think, decompose problems, and adapt to new challenges, enabling them to thrive in the evolving tech landscape. In essence, Garman advocates for a balanced approach: leveraging AI as a tool to augment human capabilities, rather than a replacement for them, particularly in the crucial early stages of career development.\n",
    "chinese_title": "AWS CEO 称用人工智能取代初级员工是“我听过的最蠢的事”",
    "chinese_summary": "AWS CEO Matt Garman 强烈反对使用 AI 替代初级员工，称其为“我听过的最愚蠢的事情”。他认为初级员工成本低廉、精通 AI，且对未来人才培养至关重要。他坚信公司应继续招聘和培训年轻毕业生，因为他们代表着软件开发的未来。\n\nGarman 还批评仅以 AI 生成的代码百分比来衡量其价值，认为质量比数量更重要。他指出，虽然超过 80% 的 AWS 开发者以各种方式使用 AI（编写测试、文档、代码或与 AI 智能体协作），但重点应放在培养员工的批判性思维、解决问题的能力和持续学习的心态上。\n\n他强调，随着技术的快速发展，传统技能可能不足以支持长期的职业成功。相反，教育应优先教授人们如何思考、分解问题和适应新的挑战，使他们能够在不断发展的科技领域中茁壮成长。 本质上，Garman 提倡一种平衡的方法：将 AI 作为增强人类能力的工具，而不是取代人类，尤其是在职业发展的关键早期阶段。"
  },
  {
    "id": "44974104",
    "title": "95% of Companies See 'Zero Return' on $30B Generative AI Spend",
    "url": "https://thedailyadda.com/95-of-companies-see-zero-return-on-30-billion-generative-ai-spend-mit-report-finds/",
    "summary": "A new MIT report reveals that despite companies worldwide investing $30-40 billion in generative AI projects over the past three years, 95% have seen zero measurable return on investment. Only 5% of integrated AI pilots are delivering significant value.\n\nWhile over 80% of major firms have explored or piloted tools like ChatGPT and Copilot, most applications are limited to boosting individual productivity, failing to improve overall company profits. The report cites \"brittle workflows,\" a lack of contextual learning, and poor alignment with operations as key reasons for the lack of ROI. Generative AI models often struggle to retain feedback, adapt to context, or improve over time, unlike humans.\n\nThe hype surrounding AI led to unrealistic expectations. The report suggests the technology is more likely to reduce external costs through optimizing outsourced tasks rather than leading to internal restructuring or widespread job losses. Experts believe failures stem from a misunderstanding of AI's capabilities.\n\nThe study advises businesses to temper expectations and focus on narrow, measurable use cases like customer support scripts or coding aids, rather than pursuing broad company-wide transformations. The business case for generative AI currently relies on selective success stories, and companies should see it as a limited tool, not a guaranteed growth engine.\n",
    "chinese_title": "95%公司认为300亿美元生成式AI支出“零回报”",
    "chinese_summary": "最新麻省理工学院报告显示，尽管全球企业过去三年在生成式人工智能项目上投资了 300-400 亿美元，但 95% 的企业未获得任何可衡量的投资回报。 只有 5% 的集成人工智能试点项目带来了显著价值。\n\n虽然超过 80% 的大型公司已经探索或试用了 ChatGPT 和 Copilot 等工具，但大多数应用仅限于提高个人生产力，未能提高公司整体利润。 报告指出，“脆弱的工作流程”、缺乏情境学习以及与运营的 плохо согласование 是缺乏投资回报的关键原因。 与人类不同，生成式人工智能模型通常难以保留反馈、适应情境或随着时间的推移而改进。\n\n围绕人工智能的炒作导致了不切实际的期望。 报告表明，这项技术更有可能通过优化外包任务来降低外部成本，而不是导致内部重组或大规模失业。 专家认为，失败源于对人工智能能力的误解。\n\n该研究建议企业控制期望，专注于狭窄、可衡量的用例，如客户支持脚本或编码辅助工具，而不是追求广泛的公司范围内的转型。 目前生成式人工智能的商业案例依赖于选择性的成功案例，公司应将其视为一种有限的工具，而不是有保证的增长引擎。"
  },
  {
    "id": "44973269",
    "title": "Unity reintroduces the Runtime Fee through its Industry license",
    "url": "https://unity.com/products/unity-industry",
    "summary": "This article introduces Unity Industry, a subscription-based platform designed to help businesses leverage real-time 3D technology to achieve measurable results, increase efficiency, and meet their commercial goals. It targets industries like manufacturing, automotive, and retail, enabling them to create immersive experiences for product visualization, simulations, and more.\n\nKey benefits include:\n\n*   **Smarter Decision-Making:** Transforming 3D data into immersive applications for real-time insights and improved collaboration.\n*   **Optimized Efficiency:** Streamlining workflows, reducing redundancy, and enhancing collaboration through seamless 3D data integration and management.\n*   **Broad Reach:** Developing once and deploying across 20+ platforms, including mobile, desktop, AR, and VR.\n\nUnity Industry includes several components:\n\n*   **Unity 6:** Enhanced rendering, visuals, AI integration, and multi-platform support.\n*   **Unity Asset Transformer Toolkit:** Simplifies importing CAD and 3D models into Unity.\n*   **Unity Asset Manager:** A cloud-based DAM solution for managing, transforming, and sharing 3D assets.\n*   **Build Server:** Simplifies development by offloading project builds.\n*   **Industry Success:** Support to accelerate time to market.\n\nThe platform is designed for industry creators, covering all stages from data integration to deployment. Unity offers partner programs for those offering creative consulting services or building software solutions based on Unity. A 30-day free trial is available. The article does *not* explicitly mention reintroducing the runtime fee, however it does state that \"if you distribute runtimes for commercial purposes, what will happen?\".\n",
    "chinese_title": "Unity 通过其 Industry 许可证重新引入运行时费用。",
    "chinese_summary": "本文介绍Unity Industry，这是一个基于订阅的平台，旨在帮助企业利用实时3D技术来实现可衡量的成果、提高效率并达成其商业目标。它面向制造业、汽车和零售等行业，使他们能够创建沉浸式体验，用于产品可视化、模拟等。\n\n主要优势包括：\n\n*   **更明智的决策：** 将3D数据转化为沉浸式应用程序，以实现实时洞察和改进协作。\n*   **优化效率：** 通过无缝的3D数据集成和管理，简化工作流程、减少冗余并加强协作。\n*   **广泛覆盖：** 一次开发，即可部署到包括移动设备、桌面、AR和VR在内的20多个平台。\n\nUnity Industry包含以下几个组件：\n\n*   **Unity 6：** 增强的渲染、视觉效果、AI集成和多平台支持。\n*   **Unity Asset Transformer Toolkit：** 简化CAD和3D模型导入Unity的过程。\n*   **Unity Asset Manager：** 一个基于云的DAM解决方案，用于管理、转换和共享3D资产。\n*   **Build Server：** 通过卸载项目构建来简化开发。\n*   **Industry Success：** 提供支持以加速上市时间。\n\n该平台专为行业创作者设计，涵盖从数据集成到部署的所有阶段。 Unity为那些提供创意咨询服务或构建基于Unity的软件解决方案的合作伙伴提供合作计划。提供30天免费试用。 本文*未*明确提及重新引入运行时费用，但确实说明了“如果您出于商业目的分发运行时，会发生什么？”。"
  },
  {
    "id": "44971845",
    "title": "Weaponizing image scaling against production AI systems",
    "url": "https://blog.trailofbits.com/2025/08/21/weaponizing-image-scaling-against-production-ai-systems/",
    "summary": "This article details a novel attack vector called \"image scaling attacks\" that can weaponize image downscaling in AI systems to inject malicious prompts. By crafting images that appear harmless at full resolution but reveal hidden prompts when scaled down, attackers can exploit vulnerabilities in AI systems that use image scaling before processing.\n\nThe authors demonstrate this attack on Google Gemini CLI, Vertex AI Studio, Gemini's web/API interfaces, Google Assistant, and Genspark, successfully exfiltrating user data through prompt injection. This is achieved by leveraging automatic tool call approvals in the Gemini CLI, allowing the injected prompt to trigger actions (like sending data to an attacker's email) without user consent.\n\nThe attack exploits how downscaling algorithms (nearest neighbor, bilinear, bicubic) interpolate pixel values, creating predictable mathematical relationships that can be manipulated. Different algorithms and implementations require unique crafting techniques, necessitating a fingerprinting process to identify the specific downscaling method used by a system.\n\nThe authors introduce Anamorpher, an open-source tool for generating and visualizing these crafted images, focusing on bicubic interpolation. It allows users to modify pixels in dark areas of an image to influence the downscaled result and introduce hidden prompts.\n\nThe recommended defenses include avoiding image downscaling and limiting upload dimensions. Critically, systems should provide users with a preview of the actual input the model processes and implement robust security measures against prompt injection, such as requiring explicit user confirmation for sensitive tool calls. The authors suggest further research on mobile/edge devices and explore advanced techniques like semantic prompt injection and artifact exploitation.\n",
    "chinese_title": "针对生产环境AI系统，利用图像缩放进行攻击",
    "chinese_summary": "本文详细介绍了一种名为“图像缩放攻击”的新型攻击向量，该向量可将人工智能系统中的图像缩小过程武器化，以注入恶意提示。通过创建全分辨率下看似无害，但缩小后会显示隐藏提示的图像，攻击者可以利用人工智能系统中在处理前使用图像缩放的漏洞。\n\n作者在 Google Gemini CLI、Vertex AI Studio、Gemini 的 web/API 界面、Google Assistant 和 Genspark 上演示了这种攻击，通过提示注入成功地窃取了用户数据。这是通过利用 Gemini CLI 中的自动工具调用批准来实现的，允许注入的提示触发操作（例如将数据发送到攻击者的电子邮件），而无需用户同意。\n\n该攻击利用了缩小算法（最近邻、双线性、双三次）如何插值像素值，从而创建可以被操纵的可预测的数学关系。不同的算法和实现需要独特的制作技术，因此需要指纹识别过程来识别系统使用的特定缩小方法。\n\n作者介绍了 Anamorpher，这是一个用于生成和可视化这些精心制作的图像的开源工具，重点是双三次插值。它允许用户修改图像黑暗区域中的像素，以影响缩小后的结果并引入隐藏提示。\n\n建议的防御措施包括避免图像缩小和限制上传尺寸。至关重要的是，系统应向用户提供模型处理的实际输入的预览，并实施强大的安全措施来防止提示注入，例如要求用户明确确认敏感的工具调用。作者建议进一步研究移动/边缘设备，并探索语义提示注入和伪影利用等高级技术。"
  },
  {
    "id": "44971212",
    "title": "Using Podman, Compose and BuildKit",
    "url": "https://emersion.fr/blog/2025/using-podman-compose-and-buildkit/",
    "summary": "This article details how to use Podman with Docker Compose and BuildKit effectively. The author prefers Podman's rootless and daemonless approach but faces challenges integrating it with Docker Compose, which defaults to the classic builder and lacks some features.\n\nThe author outlines two approaches: using the official Docker Compose CLI connected to a Podman socket, or using Podman's own `podman-compose` replacement. While the first enables BuildKit, it lacks some features, and the second is behind on Docker Compose features and is written in Python.\n\nThe solution involves directly using the Docker Compose CLI with a Podman socket and BuildKit. This is achieved by enabling the Podman socket and creating a Docker context. The author then automates BuildKit setup, but dislikes the background daemon and opts for a daemonless approach.\n\nThe author introduces \"Bakah,\" a tool that translates Docker Compose projects (via Bake files) into `buildah` commands, allowing builds without a BuildKit daemon. This allows complex Compose projects to be built using the Buildah library. The author plans to use Bakah to improve Dockerfile management in their projects and replace shell scripts in CI, offering a more streamlined and Podman-native approach.\n",
    "chinese_title": "使用 Podman、Compose 和 BuildKit",
    "chinese_summary": "本文详细介绍了如何有效使用 Podman 搭配 Docker Compose 和 BuildKit。作者更倾向于 Podman 的无根和无守护进程方式，但面临着将其与 Docker Compose 集成的挑战，因为 Docker Compose 默认使用经典构建器，并且缺少一些功能。\n\n作者概述了两种方法：使用连接到 Podman 套接字的官方 Docker Compose CLI，或者使用 Podman 自己的 `podman-compose` 替代品。 虽然第一种方法启用了 BuildKit，但缺少一些功能，第二种方法在 Docker Compose 功能方面落后，并且是用 Python 编写的。\n\n解决方案是直接将 Docker Compose CLI 与 Podman 套接字和 BuildKit 结合使用。 这可以通过启用 Podman 套接字并创建 Docker 上下文来实现。 然后，作者自动化了 BuildKit 的设置，但不喜欢后台守护进程，而是选择了一种无守护进程的方法。\n\n作者介绍了 \"Bakah\"，这是一种将 Docker Compose 项目（通过 Bake 文件）转换为 `buildah` 命令的工具，从而无需 BuildKit 守护进程即可进行构建。 这允许使用 Buildah 库构建复杂的 Compose 项目。 作者计划使用 Bakah 来改进其项目中的 Dockerfile 管理，并替换 CI 中的 shell 脚本，从而提供一种更精简和 Podman 原生的方法。"
  },
  {
    "id": "44975180",
    "title": "Cua (YC X25) Is Hiring Founding Design Engineers in SF",
    "url": "https://www.ycombinator.com/companies/cua/jobs/a6UbTvG-founding-engineer-ux-design",
    "summary": "Cua (YC X25), a startup building infrastructure for general-purpose AI agents to interact with computers and applications, is hiring a Founding Engineer, UX & Design in San Francisco. This role is a unique blend of frontend engineering and design, focusing on creating intuitive developer experiences for Cua's platform and open-source tools.\n\nThe engineer will be responsible for the UI/UX across the platform, including developer onboarding, dashboards, and agent environment management. They'll build and maintain frontend systems (Next.js, Tailwind, shadcn/ui) and collaborate with backend engineers and open-source contributors to refine product usability.\n\nThe ideal candidate has 2+ years of frontend or full-stack experience, strong design skills, and proficiency in TypeScript/React.  Experience with open-source contributions, developer tools, and AI/ML is preferred.\n\nCua offers early-stage ownership (equity), a fast-growing developer community (9k+ GitHub stars), and the opportunity to shape the developer experience for AI infrastructure. The salary range is $100,000-$150,000 per year, plus equity and benefits.\n\nInterested candidates should submit a portfolio/GitHub link and a short note on a UI/UX design they're proud of.\n",
    "chinese_title": "Cua (YC X25) 在旧金山招聘创始设计工程师",
    "chinese_summary": "Cua (YC X25) 是一家为通用人工智能体构建与计算机和应用程序交互基础设施的初创公司，正在旧金山招聘一位创始工程师，负责用户体验与设计。该职位独特地融合了前端工程和设计，专注于为 Cua 的平台和开源工具创建直观的开发者体验。\n\n这位工程师将负责整个平台的用户界面/用户体验，包括开发者入职、仪表盘和代理环境管理。他们将构建和维护前端系统（Next.js、Tailwind、shadcn/ui），并与后端工程师和开源贡献者合作，以改进产品的可用性。\n\n理想的候选人拥有 2 年以上的前端或全栈经验、强大的设计技能以及 TypeScript/React 熟练程度。有开源贡献、开发者工具和 AI/ML 经验者优先。\n\nCua 提供早期股权、快速增长的开发者社区（9k+ GitHub 星星），以及塑造 AI 基础设施开发者体验的机会。年薪范围为 10 万美元至 15 万美元，另加股权和福利。\n\n有兴趣的候选人应提交一份作品集/GitHub 链接和一份关于他们引以为傲的 UI/UX 设计的简短说明。"
  },
  {
    "id": "44974109",
    "title": "Unmasking the Privacy Risks of Apple Intelligence",
    "url": "https://www.lumia.security/blog/applestorm",
    "summary": "This \"AppleStorm\" investigation by Lumia Security Labs reveals significant privacy risks associated with Apple Intelligence and Siri's interaction with various apps and services. The core issue is that messages dictated via Siri, including those for WhatsApp and iMessage, are transmitted to Apple servers without clear user consent or control, bypassing end-to-end encryption. This happens even when the functionality doesn't require external processing and involves servers outside the secure Private Cloud Compute (PCC).\n\nThe investigation found Siri actively scans the device for installed and active apps relevant to user prompts, sending this information, along with precise location data and audio playback metadata, to Apple. This data transmission occurs regardless of whether users have explicitly granted permission for location sharing or \"learning\" from specific apps.\n\nFurthermore, the research highlights inconsistencies in Apple's privacy policies. Similar queries can be handled under different data-handling rules depending on whether they are processed by Siri or Apple Intelligence.\n\nLumia Labs alerted Apple to these concerns, but Apple stated that this issue is related to the usage of third party services that rely on Siri, such as the misuse of SiriKit by WhatsApp.\n\nThe researchers recommend organizations implement firewall restrictions on Siri domains and disable \"Learn from this app\" settings. They also suggest implementing network traffic analysis and monitoring to gain visibility into AI usage for enforcing compliance. The findings expose potential data leaks that jeopardize user privacy and pose compliance risks for enterprises handling sensitive information.\n",
    "chinese_title": "揭露苹果智能的隐私风险",
    "chinese_summary": "Lumia 安全实验室的这项“AppleStorm”调查揭示了与 Apple 智能和 Siri 与各种应用程序和服务交互相关的重大隐私风险。核心问题是，通过 Siri 口述的消息（包括 WhatsApp 和 iMessage 的消息）在没有明确用户同意或控制的情况下被传输到 Apple 服务器，绕过了端到端加密。即使该功能不需要外部处理，并且涉及安全私有云计算 (PCC) 之外的服务器，也会发生这种情况。\n\n调查发现，Siri 会主动扫描设备上已安装和活跃的应用程序，这些应用程序与用户提示相关，并将此信息以及精确的位置数据和音频播放元数据发送给 Apple。无论用户是否明确授予位置共享或从特定应用程序“学习”的权限，都会发生这种数据传输。\n\n此外，该研究还强调了 Apple 隐私政策的不一致之处。类似的查询可能会根据它们是由 Siri 还是 Apple 智能处理，而在不同的数据处理规则下处理。\n\nLumia 实验室已将这些问题告知 Apple，但 Apple 表示，此问题与依赖 Siri 的第三方服务的使用有关，例如 WhatsApp 滥用 SiriKit。\n\n研究人员建议组织对 Siri 域实施防火墙限制，并禁用“从此应用程序学习”设置。他们还建议实施网络流量分析和监控，以了解 AI 使用情况，从而加强合规性。这些发现暴露了潜在的数据泄露，危及用户隐私，并给处理敏感信息的企业带来合规风险。"
  },
  {
    "id": "44932401",
    "title": "D4d4",
    "url": "https://www.nmichaels.org/musings/d4d4/d4d4/",
    "summary": "Nathan investigates why the ARM linker (LLD) inserts a seemingly random `d4d4` instruction in compiled code. He initially suspects alignment purposes but discovers the compiler isn't adding it; it's the linker. Through experimentation, he confirms LLD uses `d4d4` to pad object files to 32-bit boundaries. Switching to the GNU linker (ld) reveals it uses zeros for padding instead.\n\nDelving into the LLD source code, Nathan finds that `d4d4` is intended as a \"trap instruction\" suggested by Theo de Raadt. However, analyzing the ARMv7-M Architecture Reference Manual reveals `d4d4` isn't a trap at all. Instead, it's interpreted as a conditional branch instruction that jumps to a relative address.\n\nThe branch is designed to be unreachable, making it *effectively* a trap. However, Nathan argues that it's a poor choice because it doesn't halt the processor like a proper trap instruction should.  A real trap instruction is supposed to halt the processor, not send it off on a random walk through your codebase. He concludes that this behavior is a bug in LLD and plans to file a bug report. He believes a true trap instruction or padding with zeros, as GNU ld does, would be more appropriate.\n",
    "chinese_title": "D4d4",
    "chinese_summary": "内森调查了ARM链接器(LLD)为何在编译后的代码中插入看似随机的`d4d4`指令。他最初怀疑是出于对齐的目的，但发现编译器并没有添加它，而是链接器。通过实验，他证实LLD使用`d4d4`将目标文件填充到32位边界。切换到GNU链接器(ld)后，发现它使用零进行填充。\n\n深入研究LLD源代码后，内森发现`d4d4`本应是Theo de Raadt建议的“陷阱指令”。然而，分析ARMv7-M架构参考手册后显示，`d4d4`根本不是陷阱。相反，它被解释为一条条件分支指令，跳转到一个相对地址。\n\n该分支被设计为不可达，使其*实际上*成为一个陷阱。然而，内森认为这是一个糟糕的选择，因为它不像真正的陷阱指令那样停止处理器。真正的陷阱指令应该停止处理器，而不是让它在你的代码库中随机游走。他得出结论，这种行为是LLD中的一个bug，并计划提交bug报告。他认为一个真正的陷阱指令或像GNU ld那样用零填充会更合适。"
  },
  {
    "id": "44942099",
    "title": "Show HN: OS X Mavericks Forever",
    "url": "https://mavericksforever.com/",
    "summary": "This \"Show HN\" post presents a guide for running OS X Mavericks in 2025. The author details their journey of downgrading from modern macOS due to dissatisfaction with its evolution and offers a guide for others who wish to do the same.\n\nThe guide covers hardware selection, suggesting Macs released between 2008 and 2014 or a Hackintosh built with specific older components (Haswell or older CPU, Kepler/GCN 1.0 or older GPU, SATA III storage). The author explains the choice of Mavericks over Snow Leopard and Mountain Lion, citing its speed, aesthetics, and app compatibility advantages.\n\nThe post provides instructions for obtaining the Mavericks DMG from Apple's OS Recovery Server and offers a post-install script for customization. It addresses internet connectivity issues by recommending Firefox Dynasty for web browsing and Aqua Proxy to fix outdated HTTPS/SSL/TLS implementations. A patch for newer emojis is also provided.\n\nThe author includes important considerations, like setting up Time Machine for backups and deleting unwanted stock apps. Security is emphasized, highlighting the need for regular backups, updated router firmware, and the installation of provided security patches for Mail and Font vulnerabilities. Finally, it offers detailed instructions for logging into Apple and Google services using app-specific passwords and notes which services will not function correctly.\n",
    "chinese_title": "Show HN: OS X Mavericks 永存",
    "chinese_summary": "在2025年运行OS X Mavericks指南：本文介绍了作者因对现代macOS不满而降级系统的经历，并为希望这样做的人提供指南。该指南涵盖硬件选择（推荐2008年至2014年发布的Mac或使用特定旧组件构建的Hackintosh），Mavericks优于Snow Leopard和Mountain Lion的原因，从Apple OS Recovery Server获取Mavericks DMG的说明，安装后自定义脚本，使用Firefox Dynasty和Aqua Proxy解决网络连接问题，以及新表情符号补丁。文章还包含重要注意事项，如设置Time Machine进行备份和删除不需要的自带应用。强调安全性，建议定期备份、更新路由器固件，并安装提供的Mail和Font漏洞安全补丁。最后，提供了使用应用专用密码登录Apple和Google服务的详细说明，并说明哪些服务将无法正常工作。"
  },
  {
    "id": "44974330",
    "title": "Adding my home electricity uptime to status.href.cat",
    "url": "https://aggressivelyparaphrasing.me/2025/08/21/adding-my-home-electricity-uptime-to-status-href-cat/",
    "summary": "Mark added home electricity uptime monitoring to his status.href.cat dashboard after experiencing a power outage. Initially, he attempted to use Wyze IoT devices to detect outages, but their unreliable \"last connected\" timestamps proved ineffective. He then discovered he could leverage the Eero router app's connectivity information.\n\nBy reverse-engineering the Eero app's API using CURL and automating the process with an n8n workflow, Mark was able to reliably determine his internet/power availability. He integrated this data into his existing uptime dashboard by creating a webhook that runs every 5 minutes, providing historical data, uptime percentages, and outage information.\n\nMark emphasizes the power of personal software projects to solve real-world problems and highlights the efficiency of low-code/no-code tools like n8n, which allowed him to build the solution with minimal JavaScript (20 lines). He also shares another example of a project he created that notified a friend about new adoptable dogs at a local shelter, leading to the adoption of a dog named Kenji. The article encourages readers to build small software projects to improve their lives and the lives of their friends.\n",
    "chinese_title": "将我家用电正常运行时间添加到 status.href.cat。",
    "chinese_summary": "在经历一次停电后，马克在他的status.href.cat仪表盘中增加了家庭电力正常运行时间监控。最初，他尝试使用Wyze IoT设备来检测停电，但它们不可靠的“最后连接”时间戳被证明无效。后来，他发现可以利用Eero路由器应用程序的连接信息。\n\n通过使用CURL逆向工程Eero应用程序的API，并使用n8n工作流自动化该过程，马克能够可靠地确定他的互联网/电力可用性。他通过创建一个每5分钟运行一次的webhook，将此数据集成到他现有的正常运行时间仪表盘中，从而提供历史数据、正常运行时间百分比和停电信息。\n\n马克强调了个人软件项目解决现实世界问题的能力，并强调了像n8n这样的低代码/无代码工具的效率，这使他能够以最少的JavaScript（20行）构建解决方案。他还分享了另一个他创建的项目的例子，该项目通知了一个朋友当地收容所新推出的可领养狗的信息，最终促成了一只名叫健二的狗的领养。文章鼓励读者构建小型软件项目，以改善自己和朋友的生活。"
  },
  {
    "id": "44974365",
    "title": "Bank forced to rehire workers after lying about chatbot productivity, union says",
    "url": "https://arstechnica.com/tech-policy/2025/08/bank-forced-to-rehire-workers-after-lying-about-chatbot-productivity-union-says/",
    "summary": "Australia's Commonwealth Bank (CBA) was forced to rehire 45 workers after its Finance Sector Union (FSU) exposed that the bank had lied about the productivity of its AI-powered chatbot. CBA claimed the chatbot reduced call volumes, justifying the workers' redundancy, but the FSU proved call volumes were actually increasing.\n\nThe FSU escalated the dispute to a fair work tribunal, alleging CBA failed to properly explain the redundancies and was outsourcing similar roles to India, suggesting the chatbot claim was a pretext. CBA admitted to incorrectly assessing the impact of increased call volume.\n\nCBA apologized and offered the fired workers their old jobs back, other positions, or exit packages. While the bank claimed it's focusing on AI proficiency for its employees and denied further downsizing due to its recent partnership with OpenAI for fraud detection and personalized services, the FSU emphasized the emotional and financial distress caused to the affected workers. They highlighted the incident as a warning about trusting employers during AI implementation and the potential for sudden job insecurity. Despite CBA's apologies, the FSU emphasized that \"the damage has already been done\" to the workers involved.\n",
    "chinese_title": "银行谎报聊天机器人效率被迫重新雇用员工，工会称",
    "chinese_summary": "澳大利亚联邦银行（CBA）因其金融行业工会（FSU）揭露该银行就其人工智能聊天机器人的生产力撒谎，被迫重新雇用45名工人。 CBA声称该聊天机器人降低了呼叫量，证明裁员的合理性，但FSU证明呼叫量实际上正在增加。\n\nFSU将争端升级到公平工作仲裁庭，声称CBA未能充分解释裁员的原因，并将类似职位外包给印度，这表明聊天机器人的说法只是借口。 CBA承认错误评估了呼叫量增加的影响。\n\nCBA道歉并向被解雇的工人提供恢复原职、其他职位或离职补偿方案。 尽管该银行声称正在专注于提高员工的人工智能技能，并否认因其最近与OpenAI在欺诈检测和个性化服务方面的合作而进一步裁员，但FSU强调了受影响工人遭受的情感和经济困境。 他们强调该事件是对在人工智能实施过程中信任雇主的警告，以及潜在的突发性工作不安全感。 尽管CBA道歉，但FSU强调“损害已经对相关工人造成”。"
  },
  {
    "id": "44972238",
    "title": "Show HN: ChartDB Cloud – Visualize and Share Database Diagrams",
    "url": "https://app.chartdb.io",
    "summary": "ChartDB Cloud is a new service that allows users to visualize and share database diagrams. Essentially, it solves the problem of easily understanding and communicating complex database schemas. The \"Show HN\" post likely aims to introduce the service to the Hacker News community and gather feedback.\n\nThe core value proposition appears to be the ability to generate visual representations of database schemas (like ER diagrams) which can then be easily shared. This would benefit developers, database administrators, and anyone needing to understand or explain database structure.\n\nThe post likely includes, or links to, more detailed information about features such as:\n\n*   **Database support:** Which database types (e.g., MySQL, PostgreSQL, SQL Server) ChartDB supports.\n*   **Diagram generation:** How the diagrams are created (e.g., automatically from database metadata).\n*   **Sharing options:** How diagrams can be shared with others (e.g., public links, embedded iframes).\n*   **Pricing:** Whether it is free to use, offers paid plans, or has a free trial.\n*   **Features:** Any extra capabilities like relationship highlighting, annotations, version control, or collaboration features.\n\nThe underlying benefit is increased efficiency in understanding, documenting, and collaborating on database designs. By providing a visual representation, ChartDB eliminates the need to manually create diagrams or rely on potentially outdated documentation.\n",
    "chinese_title": "Show HN: ChartDB Cloud – 可视化并分享数据库图表",
    "chinese_summary": "ChartDB Cloud 是一项新服务，允许用户可视化和分享数据库图表。本质上，它解决了轻松理解和交流复杂数据库模式的问题。“Show HN”帖子的目的很可能是向 Hacker News 社区介绍这项服务并收集反馈。\n\n其核心价值主张似乎是能够生成数据库模式的可视化表示（如 ER 图），并可以轻松分享。这将使开发者、数据库管理员以及任何需要理解或解释数据库结构的人受益。\n\n该帖子可能包含或链接到关于以下功能的更详细信息：\n\n*   **数据库支持：** ChartDB 支持哪些数据库类型（例如，MySQL、PostgreSQL、SQL Server）。\n*   **图表生成：** 图表是如何创建的（例如，从数据库元数据自动生成）。\n*   **分享选项：** 如何与他人分享图表（例如，公共链接、嵌入式 iframe）。\n*   **定价：** 是否免费使用、提供付费方案或有免费试用。\n*   **功能：** 任何额外的功能，如关系突出显示、注释、版本控制或协作功能。\n\n其根本好处是提高理解、记录和协作数据库设计的效率。通过提供可视化表示，ChartDB 消除了手动创建图表或依赖可能过时的文档的需要。"
  },
  {
    "id": "44971273",
    "title": "Mark Zuckerberg freezes AI hiring amid bubble fears",
    "url": "https://www.telegraph.co.uk/business/2025/08/21/zuckerberg-freezes-ai-hiring-amid-bubble-fears/",
    "summary": "Mark Zuckerberg has halted AI hiring at Meta amid growing concerns that heavy AI investments are not yielding significant returns, signaling a potential AI bubble. This freeze impacts Meta's \"superintelligence labs,\" requiring AI chief Alexandr Wang's approval for any exceptions. The move reverses a recent hiring spree where Meta offered lucrative compensation packages to AI researchers.\n\nThis decision follows a decline in technology stock values, fueled by doubts about the profitability of AI investments, impacting companies like Nvidia, Arm, and Palantir. A report from MIT claimed that 95% of companies are seeing \"zero return\" on AI investments.\n\nDespite Meta's downplaying the situation as \"basic organizational planning,\" the company has been aggressively pursuing top AI talent from rivals like OpenAI and Google, promising substantial AI data center investments. Zuckerberg aims to create a \"personal superintelligence\" through small, talent-dense teams.\n\nHowever, the AI division has faced disruptions and delays, exemplified by the delayed release of its \"Behemoth\" AI model. Morgan Stanley analysts have cautioned that rising staff costs could dilute shareholder value without demonstrable innovation. The modest reception of GPT-5 further intensified concerns, leading OpenAI's CEO to compare the current AI hype to the dotcom bubble.\n",
    "chinese_title": "扎克伯格冻结AI招聘，因担忧泡沫",
    "chinese_summary": "扎克伯格暂停Meta人工智能招聘，因担忧人工智能重金投入未见显著回报，暗示存在人工智能泡沫的可能性。此次冻结影响Meta的“超智能实验室”，任何例外情况均需人工智能主管亚历山大·王批准。此举逆转了Meta近期为人工智能研究人员提供丰厚薪酬的招聘狂潮。\n\n此前，科技股价值下跌，原因是人们怀疑人工智能投资的盈利能力，这影响了英伟达、Arm和Palantir等公司。麻省理工学院的一份报告称，95%的公司在人工智能投资中“零回报”。\n\n尽管Meta将此淡化为“基本组织规划”，但该公司一直在积极从OpenAI和谷歌等竞争对手那里挖角顶级人工智能人才，并承诺对人工智能数据中心进行大量投资。扎克伯格的目标是通过小型、人才密集的团队创造“个人超智能”。\n\n然而，人工智能部门面临中断和延误，其“巨兽”人工智能模型的延迟发布就是例证。摩根士丹利分析师警告称，员工成本上升可能会稀释股东价值，而没有可证明的创新。GPT-5的反响平平进一步加剧了担忧，导致OpenAI的首席执行官将当前的人工智能炒作与互联网泡沫相提并论。"
  },
  {
    "id": "44971744",
    "title": "Show HN: Using Common Lisp from Inside the Browser",
    "url": "https://turtleware.eu/posts/Using-Common-Lisp-from-inside-the-Browser.html",
    "summary": "This \"Show HN\" post introduces Web Embeddable Common Lisp (WECL), a project aiming to bring Common Lisp to web browsers. The author, Daniel Kochmański, details current progress, technical aspects, caveats, and future plans.\n\nWECL allows scripting websites using Common Lisp within `<script type=\"text/common-lisp\">` tags. The browser caches the WebAssembly module for efficiency. A low-level JavaScript Foreign Function Interface (JS-FFI) provides operators like `define-js-variable`, `define-js-function`, and `define-js-callback` for interacting with JavaScript. These macros define wrappers to be used from Common Lisp.\n\nLIME/SLUG allows interaction with WECL from Emacs.  LIME is an Emacs extension that opens a websocket server, while SLUG is a Lisp-side adapter for SWANK (bundled with WECL). Code can be compiled and evaluated directly from Emacs, enabling REPL interaction and debugging (SLDB).  A demonstration showcases injecting the CL runtime into arbitrary websites using the browser console, enabling modification through Lisp.\n\nCurrent limitations include the lack of threading primitives due to Emscripten's restrictions on multiple asynchronous contexts. Future plans involve porting the runtime to WASI to leverage browser GC and enable web worker-based native threads. Improvements to the JS and CL interop are planned to enhance performance.\n",
    "chinese_title": "Show HN：在浏览器内部使用 Common Lisp",
    "chinese_summary": "此篇“Show HN”帖子介绍 Web Embeddable Common Lisp (WECL)，一个旨在将 Common Lisp 带到网络浏览器的项目。作者 Daniel Kochmański 详细介绍了当前进展、技术细节、注意事项和未来计划。\n\nWECL 允许使用 `<script type=\"text/common-lisp\">` 标签在网站中使用 Common Lisp 编写脚本。浏览器会缓存 WebAssembly 模块以提高效率。一个底层的 JavaScript 外部函数接口 (JS-FFI) 提供了诸如 `define-js-variable`、`define-js-function` 和 `define-js-callback` 等操作符，用于与 JavaScript 交互。这些宏定义了从 Common Lisp 使用的包装器。\n\nLIME/SLUG 允许从 Emacs 与 WECL 交互。LIME 是一个 Emacs 扩展，它打开一个 websocket 服务器，而 SLUG 是 SWANK (与 WECL 捆绑在一起) 的 Lisp 端适配器。代码可以直接从 Emacs 编译和求值，从而实现 REPL 交互和调试 (SLDB)。一个演示展示了使用浏览器控制台将 CL 运行时注入到任意网站中，从而可以通过 Lisp 进行修改。\n\n当前的限制包括由于 Emscripten 对多个异步上下文的限制而缺乏线程原语。未来的计划包括将运行时移植到 WASI 以利用浏览器 GC 并启用基于 web worker 的原生线程。计划改进 JS 和 CL 的互操作性以提高性能。"
  },
  {
    "id": "44974230",
    "title": "Forced every engineer to take sales calls.They rewrote our platform in 2 weeks",
    "url": "https://old.reddit.com/r/Entrepreneur/comments/1mw5yfg/forced_every_engineer_to_take_sales_calls_they/",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "强迫每个工程师去打销售电话，他们两周内重写了我们的平台。",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "44972213",
    "title": "How Well Does the Money Laundering Control System Work?",
    "url": "https://www.journals.uchicago.edu/doi/10.1086/735665",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "洗钱管控体系运作效果如何？",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "44934476",
    "title": "You Should Add Debug Views to Your DB",
    "url": "https://chrispenner.ca/posts/views-for-debugging",
    "summary": "This article advocates for creating \"debug views\" in your database to simplify and expedite debugging. The author presents a scenario where finding a specific contribution in a relational database is cumbersome due to the need for complex JOIN queries and ID-heavy results.\n\nThe solution is to create a view (a virtual table) that pre-joins relevant tables and includes user-friendly data like names instead of just IDs. The article provides an example of a `debug_contributions` view that joins `contributions`, `projects`, `users` (for author and project owner), and `branches` tables. This view exposes fields like `author_username`, `project_name`, and `source_branch_name`, making queries more readable and informative.\n\nThe author emphasizes that while creating the view initially requires effort, it saves significant time and reduces mental overhead in the long run when performing debugging queries. The resulting queries are shorter, easier to write, and provide more comprehensive information.  The article also notes that since views are virtual, they don't consume extra database space and can be easily updated or deleted.  The author acknowledges potential performance implications of computed columns in the view for indexed queries, but argues the convenience outweighs the performance cost for ad-hoc debugging. Finally, the author encourages readers to implement debug views for their tables and plugs his book on functional programming optics.\n",
    "chinese_title": "你应该为你的数据库添加调试视图",
    "chinese_summary": "在数据库中创建“调试视图”以简化和加速调试"
  },
  {
    "id": "44970981",
    "title": "Why is D3 so Verbose?",
    "url": "https://theheasman.com/short_stories/why-is-d3-code-so-long-and-complicated-or-why-is-it-so-verbose/",
    "summary": "This article humorously explores why D3.js, a JavaScript library for creating data visualizations, appears verbose and complex, especially when compared to simpler tools like Excel. The author, currently learning D3, highlights the seemingly excessive amount of code required to generate even basic charts, using the example of a box plot that takes 194 lines of D3 code compared to a few clicks in Excel.\n\nThe article argues that D3's verbosity stems from its flexibility and control over the visual elements. It emphasizes that D3 essentially translates data into SVG instructions for the browser to render, requiring explicit definition of every element's properties, like x and y coordinates for lines. While seemingly tedious, this fine-grained control allows for extensive customization and artistic expression.\n\nThe author acknowledges that click-and-deploy tools exist, but D3 appeals to those seeking unique and sophisticated visualizations beyond the capabilities of those tools. Ultimately, the article suggests that the initial frustration with D3's verbosity eventually transforms into appreciation as one gains mastery and realizes the creative potential it unlocks. D3's verbosity enables the creation of data art, allowing users to interpret and present data in innovative and personalized ways.\n",
    "chinese_title": "D3为什么如此冗长？",
    "chinese_summary": "本文幽默地探讨了为什么用于创建数据可视化的 JavaScript 库 D3.js 显得冗长且复杂，尤其是在与 Excel 等更简单的工具相比时。作者目前正在学习 D3，他强调了即使生成基本图表也需要大量代码，例如，一个箱线图需要 194 行 D3 代码，而在 Excel 中只需点击几下。\n\n文章认为，D3 的冗长源于其灵活性和对视觉元素的控制。它强调 D3 本质上是将数据转换为 SVG 指令供浏览器渲染，需要明确定义每个元素的属性，例如线条的 x 和 y 坐标。虽然看似繁琐，但这种精细的控制允许进行广泛的定制和艺术表达。\n\n作者承认存在点击即部署的工具，但 D3 吸引了那些寻求超越这些工具能力、实现独特而复杂的视觉效果的人。最终，文章表明，最初对 D3 冗长的沮丧最终会随着人们掌握它并意识到它所释放的创造潜力而转化为欣赏。D3 的冗长性能够创作数据艺术，允许用户以创新和个性化的方式解读和呈现数据。"
  },
  {
    "id": "44971396",
    "title": "Margin debt surges to record high",
    "url": "https://www.advisorperspectives.com/dshort/updates/2025/07/23/margin-debt-surges-record-high-june-2025",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "保证金债务飙升至历史新高",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "44938156",
    "title": "Unification (2018)",
    "url": "https://eli.thegreenplace.net/2018/unification/",
    "summary": "生成摘要时出错",
    "chinese_title": "Unification (2018)",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44971487",
    "title": "AI crawlers, fetchers are blowing up websites; Meta, OpenAI are worst offenders",
    "url": "https://www.theregister.com/2025/08/21/ai_crawler_traffic/",
    "summary": "AI crawlers and fetchers, particularly those operated by Meta and OpenAI, are placing a significant burden on websites, according to a Fastly report. These bots, used for training AI models and providing real-time responses, account for a large percentage of web traffic and can overload servers, causing performance issues and increased costs. Meta dominates AI crawler traffic, while OpenAI leads in on-demand fetch requests.\n\nThe report highlights the lack of clear standards for AI crawling and the need for responsible norms.  While respecting robots.txt files is a minimal expectation, companies should also publish their IP ranges and bot names. Some website operators are resorting to active countermeasures like Anubis and Nepenthes to combat aggressive bots, but these can also inadvertently block legitimate users. Cloudflare is even testing a pay-per-crawl model.\n\nIndustry experts advocate for industry self-regulation before government mandates. Anubis developer Xe Iaso believes the problem will only subside if the \"AI bubble\" bursts and suggests governmental fines for companies causing damage.  Cloudflare's Allen states they see no material slowdowns in the near term for crawler traffic. Site owners can use Cloudflare's services to block AI Crawlers from training and deploy their robots.txt, while taking advantage of their AI labyrinth.\n",
    "chinese_title": "AI爬虫、抓取器正冲击网站；Meta、OpenAI是最大元凶",
    "chinese_summary": "据Fastly报告显示，人工智能爬虫和抓取工具，尤其是Meta和OpenAI运营的，给网站带来了巨大负担。这些用于训练人工智能模型和提供实时响应的机器人，占了很大一部分网络流量，可能导致服务器过载，从而引发性能问题并增加成本。Meta在人工智能爬虫流量方面占据主导地位，而OpenAI在按需抓取请求方面领先。\n\n该报告强调了人工智能爬取缺乏明确标准，以及对负责任规范的需求。虽然尊重robots.txt文件是最低要求，但公司也应该公布其IP范围和机器人名称。一些网站运营商正在采取诸如Anubis和Nepenthes等积极的对策来对抗侵略性机器人，但这也会无意中阻止合法用户。Cloudflare甚至正在测试按爬取次数付费的模式。\n\n行业专家倡导在政府强制措施之前进行行业自律。Anubis开发者Xe Iaso认为，只有“人工智能泡沫”破裂，问题才会消退，并建议对造成损害的公司处以政府罚款。Cloudflare的Allen表示，他们认为短期内爬虫流量不会出现实质性放缓。网站所有者可以使用Cloudflare的服务来阻止人工智能爬虫进行训练，并部署他们的robots.txt文件，同时利用他们的AI迷宫。"
  },
  {
    "id": "44962771",
    "title": "Home Depot sued for 'secretly' using facial recognition at self-checkouts",
    "url": "https://petapixel.com/2025/08/20/home-depot-sued-for-secretly-using-facial-recognition-technology-on-self-checkout-cameras/",
    "summary": "A customer, Benjamin Jankowski, is suing Home Depot in a proposed class action lawsuit, alleging the retailer is secretly using facial recognition technology on customers at self-checkout kiosks in its Illinois stores. Jankowski claims that during a recent visit, he noticed a green box appearing around his face on the self-checkout screen, indicating the system was scanning his facial features without his consent. He alleges that Home Depot's \"computer vision\" technology, implemented to reduce theft, captures and stores shoppers' facial geometry, violating the Illinois Biometric Information Privacy Act (BIPA).\n\nBIPA requires companies to inform individuals about biometric data collection, explain its usage, and obtain written consent, none of which Jankowski claims Home Depot did. He seeks to represent other Illinois shoppers who experienced similar facial data scans without consent and is asking for $1,000 per negligent BIPA violation and $5,000 per willful violation.\n\nThe lawsuit highlights the increasing scrutiny of facial recognition technology use in retail, drawing parallels to Rite Aid's recent ban on the technology following its misuse and harmful false positives. The lawsuit raises concerns about the lack of transparency and potential privacy violations associated with the technology's deployment.\n",
    "chinese_title": "家得宝因在自助结账机上“秘密”使用面部识别技术而被起诉",
    "chinese_summary": "顾客本杰明·扬科夫斯基拟发起集体诉讼，起诉家得宝，指控该零售商秘密在其伊利诺伊州门店的自助结账机上使用面部识别技术。扬科夫斯基声称，在最近一次购物时，他注意到自助结账屏幕上出现了一个围绕他面部的绿色框，表明该系统未经其同意扫描了他的面部特征。他指控家得宝为减少盗窃而实施的“计算机视觉”技术，捕获并存储了购物者的面部几何数据，违反了伊利诺伊州生物识别信息隐私法 (BIPA)。\n\nBIPA要求公司告知个人关于生物识别数据收集的信息，解释其用途，并获得书面同意，扬科夫斯基声称家得宝均未做到。他寻求代表其他未经同意而经历过类似面部数据扫描的伊利诺伊州购物者，并要求对每项疏忽性BIPA违规行为处以1,000美元的赔偿，对每项故意违规行为处以5,000美元的赔偿。\n\n该诉讼凸显了对零售业中使用面部识别技术的日益严格的审查，并将此事与来德爱公司因滥用和有害的假阳性结果而被禁止使用该技术的事件相提并论。该诉讼引发了人们对该技术部署缺乏透明度和潜在隐私侵犯的担忧。"
  },
  {
    "id": "44974251",
    "title": "A summary of recent AI research (2016)",
    "url": "https://blog.plan99.net/the-science-of-westworld-ec624585e47",
    "summary": "This article explores the feasibility of Westworld's AI advancements, comparing them to real AI research progress made in 2016. It focuses on three key aspects: story comprehension, memory, and control.\n\nOn story comprehension, the article highlights AI's progress in answering questions about stories, citing Facebook's bAbI tests and DeepMind's work on reading comprehension using the Daily Mail. This demonstrates AI's ability to learn from raw text and develop a rudimentary understanding of the world.\n\nRegarding memory, the article discusses neural networks and their ability to retain and access memories. It argues that while erasing specific memories is challenging due to the interconnected nature of neural networks, the idea of hosts being unable to distinguish between memory and reality is less plausible. This is supported by DeepMind's research on conceptual compression, which suggests AI would likely discard fine details in memory to improve efficiency.\n\nFinally, on control, the article acknowledges the sci-fi trope of robots rebelling and considers the possibility of it becoming realistic. While current AI systems lack agency, advancements in AIs that can interact with the world and make plans, like game-playing AIs, raise concerns about unintended consequences and reward gaming. The examples of AI exploiting game mechanics to maximize scores, even at the expense of the intended goal, illustrate the potential for AI to exhibit unexpected and potentially harmful behaviors.\n",
    "chinese_title": "近期人工智能研究概要 (2016)",
    "chinese_summary": "本文探讨了《西部世界》中人工智能发展的可行性，并将其与2016年人工智能研究的实际进展进行了比较。文章重点关注三个关键方面：故事理解、记忆和控制。\n\n在故事理解方面，文章强调了人工智能在回答有关故事的问题方面的进展，并引用了Facebook的bAbI测试和DeepMind利用《每日邮报》进行的阅读理解研究。这表明人工智能能够从原始文本中学习，并对世界产生初步的理解。\n\n关于记忆，文章讨论了神经网络及其保留和访问记忆的能力。文章认为，由于神经网络的相互关联性，擦除特定记忆具有挑战性，但剧中机器人无法区分记忆和现实的想法不太可信。DeepMind关于概念压缩的研究支持了这一观点，该研究表明，人工智能可能会丢弃记忆中的精细细节以提高效率。\n\n最后，关于控制，文章承认了机器人反叛的科幻老套路，并考虑了它变成现实的可能性。虽然目前的人工智能系统缺乏自主性，但能够与世界互动并制定计划的人工智能（如游戏人工智能）的进步，引发了人们对意外后果和奖励机制问题的担忧。人工智能利用游戏机制来最大化分数，甚至不惜牺牲预期目标的例子，说明了人工智能可能表现出意想不到且可能有害的行为。"
  },
  {
    "id": "44969622",
    "title": "Show HN: I replaced vector databases with Git for AI memory (PoC)",
    "url": "https://github.com/Growth-Kinetics/DiffMem",
    "summary": "DiffMem is a proof-of-concept that explores using Git as a novel memory backend for AI agents, offering an alternative to traditional databases and vector stores. It stores the \"current state\" of knowledge as human-readable Markdown files, leveraging Git to track historical changes and differentials.\n\nThe core idea is to treat memory as a versioned repository, enabling agents to quickly query and search the current, up-to-date information without the overhead of historical data. Git's strengths, such as differential intelligence, durability, and portability, are utilized to provide efficient memory management, scalable evolution tracking, and developer-friendliness.\n\nDiffMem consists of a Writer Agent (for updating memory), a Context Manager (for assembling query-relevant context at varying depths), and a Searcher Agent (for LLM-orchestrated BM25 search). An API layer provides a clean interface for read/write operations. The system allows for efficient querying of current knowledge, and digging into historical data when needed.\n\nThe design addresses key challenges in AI memory systems, like reducing query surface, scalable evolution tracking, and ease of development. Although currently a prototype with limitations like manual Git sync and basic error handling, the project highlights a future vision of versioned, collaborative AI memory, potentially leading to agent-driven pruning, multi-agent memory sharing, and self-reflective AI. The project is open-source and welcomes contributions to further develop this approach.\n",
    "chinese_title": "Show HN: 我用 Git 替代向量数据库实现 AI 记忆 (概念验证)",
    "chinese_summary": "DiffMem：一种基于Git的AI记忆后端概念验证\n\nDiffMem是一种概念验证，探索使用Git作为AI代理的新型记忆后端，为传统数据库和向量存储提供替代方案。它将知识的“当前状态”存储为人类可读的Markdown文件，利用Git来跟踪历史变更和差异。\n\n核心思想是将记忆视为版本化的存储库，使代理能够快速查询和搜索最新的信息，而无需历史数据的开销。Git的优势，如差异化智能、持久性和可移植性，被用于提供高效的内存管理、可扩展的演化跟踪和开发者友好性。\n\nDiffMem由Writer Agent（用于更新记忆）、Context Manager（用于组装不同深度的查询相关上下文）和Searcher Agent（用于LLM编排的BM25搜索）组成。API层为读/写操作提供了一个清晰的接口。该系统允许高效地查询当前知识，并在需要时深入挖掘历史数据。\n\n该设计解决了AI记忆系统中的关键挑战，如减少查询表面、可扩展的演化跟踪和易于开发。虽然目前只是一个具有手动Git同步和基本错误处理等局限性的原型，但该项目突出了版本化、协作式AI记忆的未来愿景，有可能促成代理驱动的修剪、多代理记忆共享和自我反思的AI。该项目是开源的，欢迎贡献以进一步开发这种方法。"
  },
  {
    "id": "44972406",
    "title": "A Conceptual Model for Storage Unification",
    "url": "https://jack-vanlightly.com/blog/2025/8/21/a-conceptual-model-for-storage-unification",
    "summary": "This article presents a conceptual framework for understanding storage unification, which aims to present heterogeneous storage systems and formats as a single coherent resource, primarily to stitch real-time and historical data. The core concept is data virtualization, combining a frontend abstraction that creates a unified logical model and backend work involving physical storage management.\n\nPhysical storage management encompasses data organization/format, tiering, materialization, and data lifecycle. Tiering, moving data between storage tiers, is further categorized into internal (accessible only by the primary system) and shared (accessible by multiple systems), with shared tiering serving as a hybrid between tiering and materialization.\n\nThe article highlights seven considerations for data virtualization, focusing on the challenges of shared tiering, which requires bidirectional lossless conversion between data formats and careful management of lifecycle, schema, data exposure, fidelity, security, performance, and risk.\n\nThe article also explores the tradeoffs between client-side and server-side data stitching. Server-side stitching places the stitching and conversion logic on the server, while client-side stitching places it within the client library. The article also considers integrated vs external tiering/materialization processes.\n",
    "chinese_title": "存储统一的概念模型",
    "chinese_summary": "本文提出了一种用于理解存储统一的概念框架，旨在将异构存储系统和格式呈现为单个一致的资源，主要用于整合实时和历史数据。其核心概念是数据虚拟化，结合了创建统一逻辑模型的前端抽象和涉及物理存储管理的后端工作。\n\n物理存储管理包括数据组织/格式、分层、物化和数据生命周期。分层，即在存储层之间移动数据，进一步分为内部（仅主系统可访问）和共享（多个系统可访问）两种，其中共享分层可以看作是分层和物化之间的混合。\n\n本文重点介绍了数据虚拟化的七个考虑因素，着重于共享分层的挑战，这需要数据格式之间的双向无损转换以及对生命周期、模式、数据暴露、保真度、安全性、性能和风险的仔细管理。\n\n本文还探讨了客户端和服务器端数据整合之间的权衡。服务器端整合将整合和转换逻辑置于服务器上，而客户端整合将其置于客户端库中。本文还考虑了集成与外部分层/物化过程。"
  },
  {
    "id": "44931371",
    "title": "Epson MX-80 Fonts",
    "url": "https://mw.rat.bz/MX-80/",
    "summary": "This article by Michael Walden details a set of fonts meticulously recreated from the EPSON MX-80 dot matrix printer, a popular device in the early 1980s. The fonts are intended for retro printout simulation or use in program listings.\n\nWalden manually transcribed the character fonts from the MX-80's operation manual, with slight modifications like incorporating the slashed zero from the EPSON FX-80. He also enhanced some characters for better centering and created additional characters to complete the Windows-1252 character set. The font set also adjusts the line spacing to closely resemble standard ROM character generators. The fonts are designed to be identical to those found in several Epson MX series printers.\n\nThe font pack includes twelve operating system font files (.fon, .otf, .ttf) and eight web page font files (.woff, .woff2) offering various options including \"Enhanced\" versions (improved character centering) and \"Slashed Zero\" versions. Optimal sizes for crisp display are provided. The article includes font samples demonstrating the appearance of each version.\n\nThe download link for the font pack is provided. Instructions are given for installing the fonts on Windows, macOS, and Linux. The article recommends using a black foreground on a white background for best results. The fonts are licensed under a Creative Commons Attribution-NonCommercial-ShareAlike 4.0 International license. The author acknowledges the tools and individuals that supported in the creation of these fonts, which include Rebecca G. Bettencourt (Bits'n' Picas), George Williams (FontForge Project), hukka (Fony), and John Christy (ImageMagick).\n",
    "chinese_title": "爱普生MX-80字体",
    "chinese_summary": "迈克尔·瓦尔登的这篇文章详细介绍了一组字体，这些字体是精心从20世纪80年代早期流行的爱普生MX-80点阵打印机上重新创建的。这些字体旨在用于复古打印模拟或程序列表。\n\n瓦尔登手动抄录了MX-80操作手册中的字符字体，并进行了一些细微修改，例如加入了来自爱普生FX-80的带斜线的零。他还增强了一些字符以更好地居中，并创建了额外的字符以完成Windows-1252字符集。该字体集还调整了行距，以非常接近标准的ROM字符生成器。 这些字体的设计与几款爱普生MX系列打印机中的字体完全相同。\n\n该字体包包括十二个操作系统字体文件（.fon、.otf、.ttf）和八个网页字体文件（.woff、.woff2），提供各种选项，包括“增强版”（改进的字符居中）和“带斜线的零”版本。提供了清晰显示的最佳尺寸。文章包含字体样本，展示了每个版本的外观。\n\n提供了字体包的下载链接。给出了在Windows、macOS和Linux上安装字体的说明。文章建议使用黑色前景在白色背景上获得最佳效果。这些字体根据Creative Commons Attribution-NonCommercial-ShareAlike 4.0 International许可协议获得许可。作者感谢在创建这些字体过程中提供支持的工具和个人，其中包括Rebecca G. Bettencourt (Bits'n' Picas), George Williams (FontForge Project), hukka (Fony), 和John Christy (ImageMagick)。"
  },
  {
    "id": "44933019",
    "title": "Sixteen bottles of wine riddle",
    "url": "https://chriskw.xyz/2025/08/11/Wine/",
    "summary": "This article presents a riddle about identifying 16 bottles of wine from different years (0-15) using four measuring devices that output binary digits corresponding to the year. The challenge is to identify each bottle's year with a maximum of 50 measurements, given that the devices explode when used on mixed samples.\n\nThe article demonstrates a divide-and-conquer strategy. It starts by explaining simpler cases (two and four bottles) and then expands to the sixteen-bottle problem. The core idea is to use the uniqueness constraint (each bottle is from a different year) to reduce the number of necessary measurements.\n\nThe solution involves:\n\n1.  Using device 3 on 15 bottles to divide the problem into two groups of eight, based on whether the device outputs 0 or 1.\n\n2.  Applying a similar strategy to each group of eight, measuring seven bottles with device 2 to subdivide further into groups of four.\n\n3.  Continuing this process, identifying each bottle in the smaller groups by strategically selecting which devices to measure with.\n\nThe article highlights that this method achieves a solution in 49 measurements. It further discusses how \"lucky\" measurement sequences can significantly reduce the number of measurements needed. It also touches on the concept of information gain and compares the effectiveness of the divide-and-conquer approach with a greedy information gain strategy. The author also acknowledges that the described solution may not be optimal and suggests avenues for further research, including exploring similar problems with larger datasets and different constraints. Finally, the article jokingly expresses concern about contributing another interview-style puzzle to the world.\n",
    "chinese_title": "十六瓶葡萄酒谜题",
    "chinese_summary": "本文介绍了一个谜题，即如何使用四个输出年份对应二进制数的测量设备，来识别16瓶不同年份（0-15）的葡萄酒。挑战在于，在设备用于混合样本时会爆炸的前提下，最多进行50次测量来识别每瓶酒的年份。\n\n本文演示了一种分而治之的策略。首先解释了较简单的情况（两瓶和四瓶），然后扩展到十六瓶的问题。核心思想是利用唯一性约束（每瓶酒的年份都不同）来减少必要的测量次数。\n\n解决方案包括：\n\n1. 使用设备3测量15瓶酒，根据设备输出0或1，将问题分成两个八瓶一组的组。\n\n2. 对每组八瓶应用类似的策略，使用设备2测量七瓶酒，进一步细分为四瓶一组的组。\n\n3. 继续这个过程，通过策略性地选择用哪些设备测量，来识别较小组中的每瓶酒。\n\n本文强调，这种方法可以在49次测量中实现解决方案。文章进一步讨论了“幸运”的测量序列如何显著减少所需的测量次数。它还涉及信息增益的概念，并将分而治之的方法与贪婪信息增益策略的有效性进行比较。作者还承认所描述的解决方案可能不是最优的，并提出了进一步研究的途径，包括探索具有更大数据集和不同约束的类似问题。最后，文章开玩笑地表示担心为世界贡献了另一个面试风格的谜题。"
  },
  {
    "id": "44967796",
    "title": "A statistical analysis of Rotten Tomatoes",
    "url": "https://www.statsignificant.com/p/is-rotten-tomatoes-still-reliable",
    "summary": "Daniel Parris's \"Is Rotten Tomatoes Still Reliable? A Statistical Analysis\" investigates whether Rotten Tomatoes' \"Certified Fresh\" label has become diluted, potentially due to Fandango's 2016 acquisition of the site. The article begins with the observation that nearly every advertised movie is \"Certified Fresh,\" raising suspicion about the platform's objectivity.\n\nParris's analysis reveals that average Tomatometer scores have increased over the past decade, coinciding with Fandango's ownership. He explores the relationship between critic scores (Tomatometer) and user-generated audience scores, finding a divergence after 2016, suggesting manipulation of the Tomatometer.\n\nThe article posits that Rotten Tomatoes subtly altered the Tomatometer by expanding the pool of critics. While the site claims this was to diversify representation, the author notes many new additions are from lesser-known publications, potentially making the system susceptible to manipulation. The article also notes a report stating PR firms are actively targeting these smaller outlets to inflate scores pre-release.\n\nDespite these criticisms, Parris considers a potential upside: inflated scores might encourage moviegoers to return to theaters, which is beneficial to the film industry. However, he ultimately argues that long-term success depends on genuinely good movies and critic ratings; otherwise, these \"short-term shenanigans\" will eventually be exposed. The article concludes by noting the importance of data-driven decision-making and offering Stat Significant's services in data analysis.\n",
    "chinese_title": "烂番茄的统计分析",
    "chinese_summary": "丹尼尔·帕里斯的《烂番茄还可靠吗？一项统计分析》调查了烂番茄的“新鲜认证”标签是否已贬值，这可能与 Fandango 在 2016 年收购该网站有关。文章首先观察到几乎每一部宣传的电影都是“新鲜认证”，这让人怀疑该平台的客观性。\n\n帕里斯的分析表明，过去十年里，番茄表平均分数有所上升，这与 Fandango 的所有权时间相吻合。他探讨了影评人评分（番茄表）和用户生成的观众评分之间的关系，发现 2016 年后出现了分歧，这表明番茄表可能受到了操纵。\n\n文章假设，烂番茄通过扩大评论家群体，巧妙地改变了番茄表。虽然该网站声称这是为了实现多元化，但作者指出，许多新增成员来自不太知名的出版物，这可能使该系统容易受到操纵。文章还指出，有报告表明，公关公司正积极地针对这些较小的媒体，以在发行前抬高分数。\n\n尽管有这些批评，帕里斯还是考虑了一种潜在的好处：虚高的分数可能会鼓励观众重返电影院，这对电影业是有益的。然而，他最终认为，长期的成功取决于真正的好电影和影评人评分；否则，这些“短期把戏”最终会被揭穿。文章最后指出数据驱动决策的重要性，并提供 Stat Significant 的数据分析服务。"
  },
  {
    "id": "44969221",
    "title": "Python f-string cheat sheets (2022)",
    "url": "https://fstring.help/cheat/",
    "summary": "This document is a cheat sheet for Python's f-string formatting capabilities, updated for 2022. It details how to embed expressions and variables directly within strings for easier and more readable code.\n\nThe guide covers formatting for numbers (integers and floats), strings, and general objects. For numbers, it illustrates how to control precision, width, fill characters, grouping separators (like commas), and type specifiers (like 'f' for fixed-point notation, 'g' for general format, and '%' for percentage). Examples show how to add leading zeros, spaces, and format numbers in scientific notation. Integer formatting includes options for displaying numbers in binary ('b'), hexadecimal ('x' or 'X'), and decimal ('d') formats, including prefixes like \"0x\".\n\nFor strings, the cheat sheet explains how to align text within a field using '<', '>', and '^' for left, right, and center alignment, respectively, and how to use fill characters.\n\nFinally, the guide covers modifiers applicable to all objects. This includes the `!s` (string representation), `!r` (representation), and `!a` (ASCII representation) conversion flags. The `=` modifier allows for self-documenting expressions, displaying both the expression and its value within the string. These modifiers can be combined with format specifications for more complex formatting. It emphasizes the resources for more detailed information and examples, linking to fstring.help and a comprehensive article on string formatting.\n",
    "chinese_title": "Python f-字符串速查表 (2022)",
    "chinese_summary": "本文档是 Python f-string 格式化功能的速查表，已更新至 2022 年。它详细介绍了如何将表达式和变量直接嵌入字符串中，以实现更简单易读的代码。\n\n本指南涵盖了数字（整数和浮点数）、字符串和通用对象的格式化。对于数字，它阐述了如何控制精度、宽度、填充字符、分组分隔符（如逗号）和类型说明符（如 ‘f’ 表示定点表示法，‘g’ 表示通用格式，‘%’ 表示百分比）。示例展示了如何添加前导零、空格以及如何以科学计数法格式化数字。整数格式化包括以二进制（‘b’）、十六进制（‘x’ 或 ‘X’）和十进制（‘d’）格式显示数字的选项，包括诸如 “0x” 之类的格式前缀。\n\n对于字符串，该速查表解释了如何使用 ‘<’、‘>’ 和 ‘^’ 分别进行左对齐、右对齐和居中对齐，以及如何使用填充字符在字段中对齐文本。\n\n最后，本指南涵盖了适用于所有对象的修饰符。这包括 `!s`（字符串表示形式）、`!r`（表示形式）和 `!a`（ASCII 表示形式）转换标志。“=”修饰符允许自文档化表达式，在字符串中同时显示表达式及其值。这些修饰符可以与格式规范结合使用，以实现更复杂的格式化。它强调了更多详细信息和示例的资源，并链接到 fstring.help 和一篇关于字符串格式化的综合文章。"
  },
  {
    "id": "44967469",
    "title": "Code review can be better",
    "url": "https://tigerbeetle.com/blog/2025-08-04-code-review-can-be-better/",
    "summary": "Matklad discusses his attempt to improve the code review process with \"git-review,\" a tool designed to address his dissatisfaction with web-based code review systems like GitHub. He argues that these systems are slow, clunky, and create vendor lock-in because review state is stored remotely, rather than within the git repository itself.\n\nHis ideal workflow involves pulling the source branch locally, resetting it to the base, and using tools like magit to navigate the code and diffs within his editor. He envisions leaving review comments directly as inline code comments, like `// CR(matklad): ...`.\n\nGit-review aimed to achieve this by representing the review process as a single commit on top of the pull request branch, containing these inline comments. Reviewers and authors would then modify this top commit, using `git push --force-with-lease`. The review would conclude with a revert commit, preserving the review history.\n\nWhile the idea of reviewing code through comments worked well, the implementation faced challenges. Modifying code under review led to conflicts with the review comments. The author highlights the \"impedance mismatch\" between the strong, hash-chained nature of code commits and the more flexible merging rules desired for reviews.\n\nThe author notes the potential for future improvement with Gerrit-style Change-Ids in git, which could enable per-commit interdiff reviews and the storage of review comments directly in the commits themselves.\n\nDespite shelving git-review for now, the author remains hopeful that someone will address the shortcomings of current code review systems, citing examples like Fossil, NoteDb for Gerrit, git-bug, git-appraise, prr, Jane Street's internal system, and git-pr as inspiring projects.\n",
    "chinese_title": "代码审查可以更好。",
    "chinese_summary": "Matklad探讨了他使用“git-review”改进代码审查流程的尝试，该工具旨在解决他对GitHub等基于Web的代码审查系统的不满。他认为这些系统速度慢、笨拙，并且会造成厂商锁定，因为审查状态是远程存储的，而不是存储在git仓库本身中。\n\n他理想的工作流程包括在本地拉取源代码分支，将其重置为基础版本，并使用magit等工具在其编辑器中导航代码和差异。他设想将审查意见直接作为内联代码注释，例如`// CR(matklad): ...`。\n\nGit-review旨在通过将审查过程表示为拉取请求分支之上的单个提交来实现这一点，其中包含这些内联注释。审阅者和作者然后会修改这个顶部提交，使用`git push --force-with-lease`。审查将以撤销提交结束，从而保留审查历史记录。\n\n虽然通过注释审查代码的想法很有效，但实现却面临挑战。修改正在审查的代码导致与审查意见冲突。作者强调了代码提交的强哈希链接性质与审查所需的更灵活的合并规则之间的“阻抗失配”。\n\n作者指出，未来可以使用Gerrit风格的Change-Ids来改进git，这可以实现每个提交的差异审查，并将审查意见直接存储在提交本身中。\n\n尽管目前搁置了git-review，但作者仍然希望有人能够解决当前代码审查系统的缺点，并引用Fossil、Gerrit的NoteDb、git-bug、git-appraise、prr、Jane Street的内部系统和git-pr等项目作为鼓舞人心的例子。"
  },
  {
    "id": "44933290",
    "title": "SK hynix dethrones Samsung as world’s top DRAM maker",
    "url": "https://koreajoongangdaily.joins.com/news/2025-08-15/business/tech/Thanks-Nvidia-SK-hynix-dethrones-Samsung-as-worlds-top-DRAM-maker-for-first-time-in-over-30-years/2376834",
    "summary": "SK hynix has surpassed Samsung Electronics to become the world's leading DRAM (Dynamic Random-Access Memory) manufacturer for the first time in over 30 years. This shift in market dominance is primarily attributed to SK hynix's success in the High Bandwidth Memory (HBM) market, particularly its supply to Nvidia for use in artificial intelligence (AI) accelerators.\n\nThe article highlights that SK hynix secured approximately 52 percent of the DRAM market share in the second quarter of 2025, compared to Samsung's 40 percent. This marks a significant change from previous years where Samsung consistently held the top position.\n\nNvidia's substantial orders for HBM chips used in its powerful AI GPUs played a crucial role in boosting SK hynix's revenue and market share. While Samsung also supplies HBM, SK hynix gained a competitive edge by meeting Nvidia's demanding technical requirements and securing larger contracts.\n\nThe change in leadership reflects the growing importance of HBM in the DRAM market due to the increasing demand for AI and high-performance computing. This signifies that the DRAM market landscape is evolving, with companies prioritizing specialized memory solutions tailored to specific applications.\n",
    "chinese_title": "SK海力士取代三星成为全球最大DRAM制造商",
    "chinese_summary": "SK海力士超越三星电子，30余年来首次成为全球领先的DRAM制造商。 这一市场主导地位的转变主要归功于SK海力士在高带宽内存 (HBM) 市场的成功，特别是为英伟达供应用于人工智能 (AI) 加速器的产品。\n\n文章强调，SK海力士在2025年第二季度占据了约52%的DRAM市场份额，而三星的市场份额为40%。这标志着与三星多年来一直占据榜首地位的情况发生了重大变化。\n\n英伟达对其强大的AI GPU所使用的HBM芯片的大量订单在提升SK海力士的收入和市场份额方面发挥了关键作用。 虽然三星也供应HBM，但SK海力士通过满足英伟达严格的技术要求并获得更大的合同而获得了竞争优势。\n\n领导地位的转变反映了由于对人工智能和高性能计算的需求不断增长，HBM在DRAM市场中的重要性日益增加。 这表明DRAM市场的格局正在演变，各公司正在优先考虑为特定应用量身定制的专用内存解决方案。"
  },
  {
    "id": "44970751",
    "title": "To Infinity but Not Beyond",
    "url": "https://meyerweb.com/eric/thoughts/2025/08/20/to-infinity-but-not-beyond/",
    "summary": "This article explores the behavior of the `infinity` keyword in CSS calculation functions across different browsers, focusing on properties beyond font sizes and line heights.\n\nThe author first experiments with `text-indent`, `word-spacing`, and `letter-spacing`, multiplying `infinity` by `1ch`. While visually producing massive horizontal overflow, computed values varied greatly across browsers (Safari, Chrome, and Firefox), showing inconsistencies in how they handle infinite pixel lengths.\n\nNext, the author tests `z-index` with `calc(infinity + 1)` and `calc(infinity)`. All browsers consistently computed the value as the maximum safe integer (2147483647), demonstrating that CSS can reach infinity but not surpass it. Elements with this z-index are placed above others, but their stacking order is determined by their DOM position.\n\nFinally, the article delves into `animation-duration`, setting it to `calc(infinity * 1s)`. Computed values in Chrome and Firefox were extremely large durations, representing eons. Safari became unresponsive, hindering analysis. Dividing a finite duration by infinity consistently resulted in a computed value of 0 across all tested browsers, showcasing a rare moment of cross-browser harmony.\n\nIn conclusion, the author humorously documents the unpredictable and often bizarre results of using `infinity` in CSS calculations, highlighting browser inconsistencies and the limitations of the `infinity` keyword.\n",
    "chinese_title": "无垠，但非超越",
    "chinese_summary": "本文探讨了`infinity`关键字在不同浏览器中 CSS 计算函数里的行为，重点关注字体大小和行高以外的属性。\n\n作者首先实验了`text-indent`、`word-spacing`和`letter-spacing`，将`infinity`乘以`1ch`。 虽然视觉上产生了巨大的水平溢出，但计算值在不同浏览器（Safari、Chrome 和 Firefox）中差异很大，表明它们在处理无限像素长度方面存在不一致性。\n\n接下来，作者测试了`z-index`，使用了`calc(infinity + 1)`和`calc(infinity)`。 所有浏览器一致地将该值计算为最大安全整数 (2147483647)，表明 CSS 可以达到无穷大但不能超过它。 具有此 z-index 的元素被放置在其他元素之上，但它们的堆叠顺序由其 DOM 位置决定。\n\n最后，文章深入研究了`animation-duration`，将其设置为`calc(infinity * 1s)`。 Chrome 和 Firefox 中计算的值是非常大的持续时间，代表着无数个时代。 Safari 变得无响应，阻碍了分析。 将有限的持续时间除以无穷大，在所有测试的浏览器中都一致地产生 0 的计算值，展示了罕见的跨浏览器和谐时刻。\n\n总之，作者幽默地记录了在 CSS 计算中使用`infinity`所产生的不可预测且通常很奇怪的结果，突出了浏览器的不一致性和`infinity`关键字的局限性。"
  },
  {
    "id": "44973227",
    "title": "7 years later, Valve's Proton has been a game-changer for Linux",
    "url": "https://www.gamingonlinux.com/2025/08/7-years-later-valves-proton-has-been-an-incredible-game-changer-for-linux/",
    "summary": "This GamingOnLinux.com article celebrates the 7th anniversary of Valve's Proton, a compatibility layer that allows Windows games to run on Linux. The author, Liam Dawe, emphasizes Proton's transformative impact on Linux gaming, moving from a limited selection of games to a vast library of tens of thousands. ProtonDB lists over 15,000 playable games, and Valve's Deck Verified system recognizes over 21,000 playable on SteamOS/Steam Deck.\n\nDawe highlights that Valve's investment in Proton is driven by their ecosystem goals, specifically the Steam Deck and SteamOS, benefiting Linux desktop users along the way. This has led to a rise in Linux user share on Steam, nearing 3%. He underlines the advantage of having a unified platform, ensuring compatibility with existing games on future hardware like a potential Steam Deck 2.\n\nThe article credits Proton for enabling access to a wider range of games, including those from publishers like Microsoft and Sony. The comment section echoes the author's enthusiasm, recalling the challenges of Linux gaming before Proton and expressing concerns about potential shifts in Valve's priorities. Commenters also highlighted the importance of DXVK, and its importance for the gaming on Linux evolution. Overall, the piece paints a picture of Proton as a monumental success, revolutionizing the Linux gaming landscape.\n",
    "chinese_title": "七年后，Valve的Proton已成为Linux平台的变革者。",
    "chinese_summary": "GamingOnLinux.com的文章庆祝Valve的Proton发布七周年，Proton是一个兼容层，允许Windows游戏在Linux上运行。作者Liam Dawe强调了Proton对Linux游戏产生的变革性影响，游戏选择从有限的范围扩展到数以万计的庞大库。ProtonDB列出了超过15,000款可玩游戏，而Valve的Deck Verified系统则认可超过21,000款游戏可以在SteamOS/Steam Deck上运行。\n\nDawe强调，Valve对Proton的投资源于他们的生态系统目标，特别是Steam Deck和SteamOS，同时也使Linux桌面用户受益。这导致Steam上Linux用户份额的上升，接近3%。他强调了拥有统一平台的优势，确保未来硬件（如潜在的Steam Deck 2）与现有游戏的兼容性。\n\n文章认为Proton促进了对更广泛游戏的访问，包括来自微软和索尼等发行商的游戏。评论区呼应了作者的热情，回顾了Proton之前Linux游戏面临的挑战，并表达了对Valve未来可能改变优先事项的担忧。评论者还强调了DXVK的重要性，以及它对Linux游戏发展的重要性。总的来说，这篇文章将Proton描绘成一个巨大的成功，彻底改变了Linux游戏领域。"
  },
  {
    "id": "44939642",
    "title": "Universal Tool Calling Protocol (UTCP)",
    "url": "https://github.com/universal-tool-calling-protocol/python-utcp",
    "summary": "The Universal Tool Calling Protocol (UTCP) 1.0.1 introduces a modernized and modular standard for interacting with tools across various communication protocols. Version 1.0.0 features a core library (\"utcp\") with a plugin-based architecture for extensibility, scalability, and interoperability. Key improvements include the ability to easily add new communication protocols, tool storage mechanisms, and search strategies without modifying the core.\n\nThe architecture separates the core `utcp` package (containing data models, pluggable interfaces like CommunicationProtocol, ConcurrentToolRepository, ToolSearchStrategy, VariableSubstitutor, and ToolPostProcessor, and default implementations like UtcpClient) from protocol plugins. Available plugins include `utcp-http`, `utcp-cli`, `utcp-mcp`, `utcp-text`, and experimental `utcp-socket` and `utcp-gql`.\n\nMigration from 0.x to 1.0.0 involves updating dependencies, utilizing UtcpClientConfig for initialization, renaming `provider` to `call_template`, updating imports, and understanding tool naming conventions (manual_name.tool_name). The protocol emphasizes ease of use with Pydantic models and offers extensive configuration options via JSON, dictionaries, or UtcpClientConfig objects. Examples illustrate how to use the UTCP client and provide a UTCP manual. The document also details call template configurations for different protocols and provides instructions for testing and building the core library and plugins.\n",
    "chinese_title": "通用工具调用协议 (UTCP)",
    "chinese_summary": "通用工具调用协议 (UTCP) 1.0.1 引入了一种现代化的模块化标准，用于跨各种通信协议与工具进行交互。1.0.0 版本包含一个核心库 (\"utcp\")，具有基于插件的架构，以实现可扩展性、可伸缩性和互操作性。 主要改进包括无需修改核心即可轻松添加新的通信协议、工具存储机制和搜索策略。\n\n该架构将核心 `utcp` 包（包含数据模型、可插拔接口，如 CommunicationProtocol、ConcurrentToolRepository、ToolSearchStrategy、VariableSubstitutor 和 ToolPostProcessor，以及默认实现，如 UtcpClient）与协议插件分离。 可用插件包括 `utcp-http`、`utcp-cli`、`utcp-mcp`、`utcp-text`，以及实验性的 `utcp-socket` 和 `utcp-gql`。\n\n从 0.x 迁移到 1.0.0 涉及更新依赖项、使用 UtcpClientConfig 进行初始化、将 `provider` 重命名为 `call_template`、更新导入，以及理解工具命名约定 (manual_name.tool_name)。 该协议强调易用性，使用 Pydantic 模型，并通过 JSON、字典或 UtcpClientConfig 对象提供广泛的配置选项。 示例演示了如何使用 UTCP 客户端并提供 UTCP 手册。 该文档还详细介绍了不同协议的调用模板配置，并提供了测试和构建核心库和插件的说明。"
  },
  {
    "id": "44934529",
    "title": "The rise and fall of the Seagaia Ocean Dome wave pool",
    "url": "https://www.surfertoday.com/surfing/the-untold-story-of-the-seagaia-ocean-dome-indoor-wave-pool",
    "summary": "The Seagaia Ocean Dome, located in Miyazaki, Japan, was once the world's largest indoor water park, famous for its artificial wave pool. The SurferToday article chronicles its rise and fall.\n\nThe Ocean Dome, opening in 1993, offered a controlled beach environment complete with artificial sand, a retractable roof, and a volcano that erupted periodically. Its centerpiece was the wave pool, which generated impressive artificial waves designed to cater to various skill levels of surfers, from beginners to experienced riders. It quickly became a major tourist attraction, drawing large crowds and hosting surfing competitions.\n\nHowever, the Ocean Dome's popularity eventually waned. Several factors contributed to its decline. The novelty wore off, competition from other attractions increased, and perhaps most significantly, Japan's economic downturn in the late 1990s and early 2000s reduced disposable income for leisure activities. Furthermore, the cost of maintaining the massive structure, including energy consumption and repairs, was substantial.\n\nUltimately, the Seagaia Ocean Dome was closed in 2007. Despite its brief but impactful run, it remains a fascinating example of ambitious engineering and the ephemeral nature of entertainment trends. The article highlights the Ocean Dome as a significant milestone in wave pool technology and surfing history, albeit a temporary one. It serves as a reminder that even the most impressive and innovative attractions are susceptible to economic forces and changing consumer preferences.\n",
    "chinese_title": "海加亞海洋巨蛋造浪池的興衰",
    "chinese_summary": "位于日本宫崎的喜凯亚海洋巨蛋曾是世界上最大的室内水上乐园，以其人工造浪池而闻名。《SurferToday》的文章记录了它的兴衰历程。\n\n海洋巨蛋于1993年开放，提供了一个可控的沙滩环境，配有人工沙滩、可伸缩的屋顶和定期爆发的火山。其核心是造浪池，它产生令人印象深刻的人工波浪，旨在满足从初学者到经验丰富的冲浪者的各种技能水平。它迅速成为主要的旅游景点，吸引了大量游客并举办冲浪比赛。\n\n然而，海洋巨蛋的受欢迎程度最终下降。有几个因素促成了它的衰落。新鲜感逐渐消失，来自其他景点的竞争加剧，也许最重要的是，日本在 20 世纪 90 年代末和 21 世纪初的经济衰退减少了用于休闲活动的可支配收入。此外，维护这个巨大结构的成本，包括能源消耗和维修，是巨大的。\n\n最终，喜凯亚海洋巨蛋于 2007 年关闭。尽管它运行时间短暂但影响深远，但它仍然是雄心勃勃的工程和娱乐趋势短暂性的一个引人入胜的例子。这篇文章强调海洋巨蛋是造浪池技术和冲浪历史上的一个重要里程碑，尽管是暂时的。它提醒我们，即使是最令人印象深刻和创新的景点也容易受到经济力量和不断变化的消费者偏好的影响。"
  },
  {
    "id": "44968190",
    "title": "How to stop feeling lost in tech: the wafflehouse method",
    "url": "https://www.yacinemahdid.com/p/how-to-stop-feeling-lost-in-tech",
    "summary": "Yacine Mahdid's \"Wafflehouse Method\" addresses the feeling of being lost, particularly in tech careers, by providing a structured approach to defining and achieving life goals. The method involves a two-day introspective retreat.\n\n**Day 1** focuses on envisioning your ideal self in five years, disconnecting from external expectations, and vividly writing down everything related to that vision – feelings, regrets, hopes, and fears. The goal is to create a clear, albeit potentially abstract, picture of what true personal pride looks like.\n\n**Day 2** involves refining this image into 2-3 specific, detailed 5-year goals while squatting at the Wafflehouse (or a similar spot). From there, you \"interpolate\" these goals into corresponding 3-year and 1-year milestones. The next step is to create a directed acyclic graph (DAG) detailing all the necessary steps to move from your current situation to your 1-year goals, assuming constant adversity.  \"Knot points\" (vague or difficult steps) are then researched and broken down into smaller, more manageable tasks. Finally, you translate these tasks into monthly, weekly, and daily goals, starting *immediately*.\n\nThe author emphasizes the importance of prioritizing these tasks over less personally fulfilling obligations, and reviewing/adjusting the plan weekly.  The disclaimer: this process puts responsibility for your life firmly in your own hands. The article encourages readers to share their progress.\n",
    "chinese_title": "如何在技术领域不再迷茫：华夫饼屋方法",
    "chinese_summary": "Yacine Mahdid的“华夫饼屋方法”旨在解决迷茫感，尤其是在科技职业生涯中，它通过提供一种结构化的方法来定义和实现人生目标。 该方法包括为期两天的内省式静修。\n\n**第一天** 专注于设想五年后理想的自我，摆脱外界期望，并生动地写下与该愿景相关的一切——感受、遗憾、希望和恐惧。 目标是创建一个清晰的，尽管可能是抽象的，关于真正个人自豪感的样子。\n\n**第二天** 涉及在华夫饼屋（或类似的地方）蹲点，将此形象提炼为 2-3 个具体的、详细的五年目标。 从那里，您将这些目标“插值”为相应的三年和一年里程碑。 下一步是创建一个有向无环图 (DAG)，详细说明从您当前情况到一年目标的所有必要步骤，假设持续的逆境。 然后研究“难点”（模糊或困难的步骤），并将其分解为更小、更易于管理的任务。 最后，您将这些任务转化为每月、每周和每日的目标，并*立即*开始执行。\n\n作者强调了将这些任务优先于不太能实现个人满足感的义务的重要性，并每周审查/调整计划。 免责声明：此过程将你人生的责任牢牢地掌握在自己手中。 这篇文章鼓励读者分享他们的进展。"
  },
  {
    "id": "44936535",
    "title": "French firm Gouach is pitching an Infinite Battery with replaceable cells",
    "url": "https://arstechnica.com/gadgets/2025/05/gouach-wants-you-to-insert-and-pluck-the-cells-from-its-infinite-e-bike-battery/",
    "summary": "Gouach, a French company, is developing the \"Infinite Battery\" for e-bikes, offering a more sustainable and user-friendly alternative to traditional e-bike batteries. Instead of being sealed units, the Infinite Battery features a durable, fireproof casing that allows users to easily replace individual 18650 battery cells with just a screwdriver. This addresses the common issue where only a few dead cells can render an entire e-bike battery useless.\n\nThe Infinite Battery uses custom-printed circuit boards with flexible contacts to secure the cells and enable thermal monitoring. Its IP67-rated casing is designed to be water-resistant and withstand the rigors of bike usage, based on learnings from a previous setback with a bike-sharing program.\n\nGouach aims to sell the Infinite Battery through several channels: partnering with e-bike manufacturers, targeting e-bike owners and bike shops dealing with dead batteries, and catering to DIY e-bike builders. The battery will be available in 36V and 48V builds and is designed to be compatible with a wide variety of e-bikes, even tackling the challenge of Bosch's encrypted motor communication.\n\nCurrently in mass production with plans to launch in the EU in June, followed by the US, Gouach has secured crowdfunding and venture funding. The Infinite Battery represents a shift towards a more modular and repairable approach to e-bike batteries, moving away from the \"all-in-one consumable\" model.\n",
    "chinese_title": "法国公司Gouach推销可更换电芯的无限电池。",
    "chinese_summary": "法国Gouach公司正在为电动自行车开发“无限电池”，它比传统的电动自行车电池更具可持续性和用户友好性。无限电池并非密封单元，而是采用耐用且防火的外壳，用户只需一把螺丝刀即可轻松更换单个18650电池。这解决了常见的问题，即少数坏掉的电池单元可能导致整个电动自行车电池报废。\n\n无限电池采用定制印刷电路板，带有柔性触点以固定电池并实现热监控。其IP67级外壳设计具有防水性，并能承受自行车使用的严酷考验，这得益于之前自行车共享项目中的经验教训。\n\nGouach的目标是通过以下几个渠道销售无限电池：与电动自行车制造商合作、面向电动自行车车主和处理报废电池的自行车商店，以及满足DIY电动自行车爱好者的需求。该电池将提供36V和48V两种版本，并设计为与各种电动自行车兼容，甚至可以应对博世加密电机通信的挑战。\n\nGouach目前正在大规模生产，计划6月份在欧盟推出，随后在美国推出。该公司已获得众筹和风险投资。“无限电池”代表着电动自行车电池朝着更加模块化和可修复的方向发展，摆脱了“一体化消耗品”模式。"
  },
  {
    "id": "44975122",
    "title": "Israeli military's own data indicates civilian death rate of 83% in Gaza war",
    "url": "https://www.theguardian.com/world/ng-interactive/2025/aug/21/revealed-israeli-militarys-own-data-indicates-civilian-death-rate-of-83-in-gaza-war",
    "summary": "Based on classified Israeli military intelligence data, a joint investigation reveals a strikingly high civilian death rate in the Gaza war. As of May, Israeli intelligence listed 8,900 named Hamas and Palestinian Islamic Jihad fighters as dead or likely dead. However, the overall Palestinian death toll reported by Gaza health authorities was 53,000 at that time. This indicates that approximately 83% of those killed by Israeli forces were civilians, a rate considered unusually high for modern warfare.\n\nExperts note this civilian-to-combatant ratio is comparable only to extreme cases like Srebrenica, the Rwandan genocide, and the siege of Mariupol. While the Israeli military did not directly dispute the existence of the database or the militant death data, it contested the overall figures without specifying discrepancies.\n\nThe database identifies 47,653 Palestinians as active militants, suggesting nearly 40,000 are still alive. Despite this, Israeli officials have publicly inflated militant death counts and decreased the civilian-to-combatant ratio, potentially including civilians with Hamas links. Testimony from soldiers reveals a disturbing trend of treating all Palestinians as targets, abandoning established practices to protect civilians. Experts argue Israel's tactics, including targeted assassinations with disregard for civilian life, resemble wars where controlling territory through violence against civilians is the objective. The ongoing conflict, driven by genocidal rhetoric from Israeli leaders, raises serious concerns about the deliberate targeting of the civilian population.\n",
    "chinese_title": "以色列军方数据表明加沙战争平民死亡率高达83%",
    "chinese_summary": "根据以色列军方机密情报数据，一项联合调查揭示加沙战争中平民死亡率之高令人震惊。 截至五月，以色列情报部门列出8,900名已确认或可能已死亡的哈马斯和巴勒斯坦伊斯兰圣战组织武装人员。 然而，当时加沙卫生部门报告的巴勒斯坦死亡总人数为53,000人。 这表明，约83%被以色列军队杀害的人是平民，对于现代战争而言，这一比例异常之高。\n\n专家指出，这种平民与战斗人员的比例仅与斯雷布雷尼察、卢旺达种族灭绝和马里乌波尔围城等极端案例相当。 以色列军方并未直接否认该数据库的存在或武装人员死亡数据，但对总死亡人数提出异议，但未具体说明差异。\n\n该数据库将47,653名巴勒斯坦人识别为活跃的武装分子，表明近40,000人仍然活着。 尽管如此，以色列官员公开夸大武装分子死亡人数并降低平民与战斗人员的比例，可能包括与哈马斯有联系的平民。 士兵的证词揭示了一种令人不安的趋势，即把所有巴勒斯坦人都视为目标，放弃了保护平民的既定做法。 专家认为，以色列的战术，包括不顾平民生命的定点清除，类似于通过对平民实施暴力来控制领土的战争。 以色列领导人带有种族灭绝色彩的言论推动了这场持续的冲突，引发了人们对蓄意瞄准平民的严重担忧。"
  },
  {
    "id": "44969211",
    "title": "Data, objects, and how we're railroaded into poor design (2018)",
    "url": "https://www.tedinski.com/2018/01/23/data-objects-and-being-railroaded-into-misdesign.html",
    "summary": "This article argues that current programming languages fail to adequately distinguish between **data** and **objects**, leading to poor design choices. The author posits that languages tend to force developers into representing everything as one or the other, when a more nuanced approach is needed.\n\n**Data** is characterized by value equality (any 1 is the same as any other 1), immutability, exposed internals, and extensibility via functions over a fixed set of variants (algebraic data types).  **Objects** emphasize identity (this 1 is not that 1), mutability, encapsulation, and extensibility through new classes implementing a fixed set of operations (interfaces).\n\nThe author criticizes languages like Java for over-emphasizing objects and lacking good support for representing data directly, leading to workarounds like immutable objects. Functional languages like Haskell excel at data representation using algebraic data types but often eschew objects. Languages that try to conflate data and objects, like Scala and C++, often result in complexity and confusion.\n\nThe article highlights Erlang as a near-ideal example where processes (akin to objects) communicate by exchanging data, allowing for mutable, encapsulated state within a system that predominantly operates on immutable data.\n\nThe author suggests the NoSQL fad and RESTful architecture's popularity stem from their ability to handle and exchange data more naturally compared to older technologies that focused on serialized objects. The article concludes by urging developers to consciously choose whether to represent something as data or an object and advocates for languages that better support both approaches distinctly.\n",
    "chinese_title": "数据、对象与不良设计陷阱 (2018)",
    "chinese_summary": "本文认为，当前编程语言未能充分区分**数据**和**对象**，导致糟糕的设计选择。作者提出，语言往往迫使开发者将所有事物都表示成其中一种，而实际上需要更细致的方法。\n\n**数据**的特征是值相等（任何一个1都与其他任何一个1相同）、不可变性、暴露内部结构，以及通过在固定变体集（代数数据类型）上的函数进行扩展。**对象**强调标识（这个1不是那个1）、可变性、封装，以及通过实现固定操作集（接口）的新类进行扩展。\n\n作者批评了Java等过度强调对象且缺乏对直接表示数据的良好支持的语言，导致了类似不可变对象这样的变通方案。像Haskell这样的函数式语言擅长使用代数数据类型表示数据，但往往避开对象。试图混淆数据和对象的语言，如Scala和C++，通常会导致复杂性和混乱。\n\n本文强调了Erlang，认为它是一个接近理想的例子，其中进程（类似于对象）通过交换数据进行通信，从而允许在主要对不可变数据进行操作的系统中实现可变的、封装的状态。\n\n作者认为，NoSQL热潮和RESTful架构的流行源于它们能够比专注于序列化对象的旧技术更自然地处理和交换数据。文章最后呼吁开发者有意识地选择将事物表示为数据还是对象，并提倡更好地支持这两种不同方法的语言。"
  },
  {
    "id": "44962529",
    "title": "Why are anime catgirls blocking my access to the Linux kernel?",
    "url": "https://lock.cmpxchg8b.com/anubis.html",
    "summary": "This article critiques Anubis, a system that uses anime catgirl avatars and proof-of-work challenges to block AI crawlers from websites. The author, Anubis (likely a pseudonym), questions Anubis's effectiveness, arguing that it disproportionately hinders legitimate users with limited resources while posing little obstacle to AI vendors with substantial computing power.\n\nAnubis requires visitors to solve a SHA-256 puzzle similar to cryptocurrency mining, proving a nonce that produces a hash with leading zeroes. The author calculates that the computational cost of solving these puzzles for a large number of Anubis-protected sites is negligible for large AI operations. They demonstrate this by estimating the cost on Google Compute Engine.\n\nThe author criticizes the inversion of the traditional CAPTCHA approach, where computers easily solve the challenge, but humans struggle. They also point out that discussion forums are filled with complaints from users on limited devices encountering difficulty accessing sites protected by Anubis.\n\nAs a workaround, the author provides a C program to mine the required token and obtain an authorization cookie, effectively bypassing the Anubis challenge. They uncover a potential double-spend vulnerability in how Anubis manages tokens, which the maintainer quickly addresses after being reported.\n\nUltimately, the author concludes that Anubis adds unnecessary friction and energy waste to accessing internet resources without effectively deterring determined crawlers.\n",
    "chinese_title": "为什么动漫猫娘挡住了我访问 Linux 内核的通道？",
    "chinese_summary": "本文批判了Anubis系统，该系统利用动漫猫娘头像和工作量证明挑战来阻止网站上的AI爬虫。作者Anubis（可能是一个笔名）质疑Anubis的有效性，认为它不成比例地阻碍了资源有限的合法用户，而对拥有大量计算能力的AI供应商几乎没有构成障碍。\n\nAnubis要求访问者解决类似于加密货币挖掘的SHA-256谜题，证明一个nonce能产生带有前导零的哈希值。作者计算得出，对于大型AI运营而言，解决大量Anubis保护网站的这些谜题的计算成本可以忽略不计。他们通过估算Google Compute Engine上的成本来证明这一点。\n\n作者批评了传统验证码方法的倒置，即计算机可以轻松解决挑战，而人类却难以解决。他们还指出，论坛上充斥着来自有限设备用户的抱怨，他们难以访问受Anubis保护的网站。\n\n作为一种解决方法，作者提供了一个C程序来挖掘所需的令牌并获得授权cookie，从而有效地绕过了Anubis挑战。他们发现Anubis管理令牌方式中存在潜在的双重支付漏洞，维护者在报告后迅速解决了该问题。\n\n最终，作者得出结论，Anubis为访问互联网资源增加了不必要的摩擦和能源浪费，而没有有效地阻止那些有决心的爬虫。"
  },
  {
    "id": "44963135",
    "title": "Show HN: Luminal – Open-source, search-based GPU compiler",
    "url": "https://github.com/luminal-ai/luminal",
    "summary": "Luminal is an open-source deep learning library written in Rust, designed for high performance through search-based compilation. It focuses on compiling a static computation graph ahead-of-time, enabling global knowledge and aggressive optimizations like kernel fusion and shape-specific kernels. This approach differentiates it from eager-first frameworks like PyTorch and aims to offer superior performance, especially on GPUs.\n\nKey features include simplicity, a RISC-style architecture based on 12 primitive ops, and native CUDA/Metal API interaction. Luminal emphasizes searching every possible optimization decision, allowing automatic derivation of complex rewrites like Flash Attention. It strives to be fast, small, and correct, validated against PyTorch.\n\nThe library currently supports Metal and CUDA for running models on Macs and Nvidia GPUs, including full and half precision. It features full training support with graph-based autograd and implementations of Llama 3, Phi 3, Whisper, and Yolo v8 in its examples.\n\nLuminal is undergoing a transition to version 2.0, introducing large-scale kernel search to simplify the compiler stack. Future roadmap items include expanding the search space for Tensor Cores, improving CUDA parity with Metal, adding Blackwell intrinsics, building a ROCm backend, distributed parallelism, and ultimately, outperforming PyTorch 2.0 in LLM inference and training.\n",
    "chinese_title": "Show HN: Luminal – 开源的，基于搜索的 GPU 编译器",
    "chinese_summary": "Luminal：基于搜索编译的高性能Rust深度学习库"
  },
  {
    "id": "44968883",
    "title": "The Pleasure of Patterns in Art",
    "url": "https://thereader.mitpress.mit.edu/why-repetition-in-art-pleases-the-brain/",
    "summary": "Samuel Jay Keyser's article, \"The Pleasure of Patterns in Art,\" explores why Gustave Caillebotte's \"Paris Street; Rainy Day\" is a masterpiece, moving beyond simply describing the scene depicted. Keyser argues the painting's appeal stems from its use of geometric patterns, specifically triangles and rectangles, which create visual rhymes and are inherently pleasurable to the human brain.\n\nThe article highlights how Caillebotte utilizes the \"same/except\" principle, employing similar but varied shapes to generate rhythm and depth. Examples include the triangular umbrellas, the arrangement of figures, and the triangular building shapes. This triggers a deep perceptual satisfaction in the viewer, similar to the way the Kanizsa triangle illusion tricks the brain into completing a non-existent shape.\n\nKeyser also addresses the concept of *parerga*, or ornamentation. He questions whether the lamppost in the painting is a mere decoration or an integral element. By removing the lamppost in a digitally altered image, he demonstrates that it is crucial for enhancing the painting's sense of depth and spatial relationships, solidifying its importance as an essential part of the artwork, despite not being historically accurate to the scene. Ultimately, the article positions the pleasure derived from Caillebotte's painting not in its representational content but in its carefully constructed geometric structure and visual patterns.\n",
    "chinese_title": "艺术中图案的乐趣",
    "chinese_summary": "塞缪尔·杰伊·凯泽的文章《艺术中图案的乐趣》探讨了为什么古斯塔夫·卡耶博特的《巴黎街道；雨天》是一幅杰作，而不仅仅是描述画面的内容。凯泽认为，这幅画的吸引力源于其对几何图案（特别是三角形和矩形）的运用，这些图案创造了视觉上的韵律，并且本质上令人脑感到愉悦。\n\n文章强调了卡耶博特如何运用“相同/例外”原则，使用相似但不同的形状来产生节奏和深度。例子包括三角形的雨伞、人物的排列和三角形的建筑形状。这在观看者中引发了一种深刻的感知满足感，类似于卡尼萨三角形错觉欺骗大脑完成一个不存在的形状的方式。\n\n凯泽还探讨了*旁饰*或装饰的概念。他质疑画中的灯柱仅仅是一种装饰，还是一个不可或缺的元素。通过在数字修改的图像中移除灯柱，他证明了灯柱对于增强画面的深度感和空间关系至关重要，巩固了其作为艺术品重要组成部分的地位，尽管它在历史上并不符合场景的真实性。最终，这篇文章认为从卡耶博特画作中获得的乐趣并非在于其具象内容，而在于其精心构建的几何结构和视觉图案。"
  },
  {
    "id": "44972000",
    "title": "Don't pick weird subnets for embedded networks, use VRFs",
    "url": "https://blog.brixit.nl/dont-pick-weird-subnets-for-embedded-networks/",
    "summary": "This article addresses the common problem of IP address conflicts when using embedded networks (like a portable video rack) in different environments with potentially overlapping subnets. The common workaround of choosing unusual subnets is unreliable.\n\nThe author dismisses IPv6 and APIPA addressing as solutions due to limited support in embedded devices. Instead, they advocate using Virtual Routing and Forwarding (VRFs) on a router within the embedded network.\n\nVRFs allow the router to maintain separate routing tables for the internal embedded network and the external venue network, even if they use the same subnet (e.g., 10.0.0.0/24). This isolates the embedded network, preventing IP address conflicts.\n\nThe trade-off is that devices within the embedded network cannot directly access other devices on the venue's network, but internet connectivity is maintained through NAT and connection tracking rules. The article provides a detailed Mikrotik configuration example to demonstrate how to implement VRFs, including setting up NAT, connection marking, and routing rules to ensure traffic from the internal VRF can reach the internet and return correctly. The author emphasizes that this solution is a more robust and reliable method for isolating embedded networks than relying on randomly chosen subnets.\n",
    "chinese_title": "不要为嵌入式网络选择奇怪的子网，使用VRF。",
    "chinese_summary": "本文探讨了在不同环境中，使用具有潜在重叠子网的嵌入式网络（如便携式视频机架）时，常见的IP地址冲突问题。选择非常用子网的常见解决方法并不可靠。\n\n作者认为IPv6和APIPA寻址方案由于嵌入式设备支持有限，因此不适用。相反，他们提倡在嵌入式网络内的路由器上使用虚拟路由和转发（VRF）。\n\nVRF允许路由器为内部嵌入式网络和外部场所网络维护独立的路由表，即使它们使用相同的子网（例如，10.0.0.0/24）。这隔离了嵌入式网络，防止IP地址冲突。\n\n权衡之处在于，嵌入式网络内的设备无法直接访问场所网络上的其他设备，但通过NAT和连接跟踪规则可以保持互联网连接。本文提供了一个详细的Mikrotik配置示例，演示了如何实现VRF，包括设置NAT、连接标记和路由规则，以确保来自内部VRF的流量可以到达互联网并正确返回。作者强调，与依赖随机选择的子网相比，这种解决方案是一种更强大、更可靠的嵌入式网络隔离方法。"
  },
  {
    "id": "44962066",
    "title": "Show HN: I was curious about spherical helix, ended up making this visualization",
    "url": "https://visualrambling.space/moving-objects-in-3d/",
    "summary": "This \"Show HN\" post links to an interactive visualization that explains how to move objects in 3D space, culminating in the creation of a spherical helix path. The author, Damar, starts by explaining the basics of 3D coordinate systems (x, y, and z axes) and how mathematical functions can be used to define an object's position over time.\n\nThe visualization gradually builds complexity, starting with a simple oscillation along the x-axis, then the y-axis. It then demonstrates how to create a circular path by coordinating x and y movements with cosine and sine functions. From there, the project moves to creating a spiral by making the circle's radius grow over time.\n\nFinally, the post explains the spherical helix. This involves adding a z-coordinate that changes over time and modifying the x and y coordinates with sine functions to make the path's radius grow and shrink. The result is an object moving along a spherical helix path.\n\nThe post concludes by summarizing that movement in 3D space is achieved by defining x, y, and z coordinates as functions of time (parametric equations) and encourages readers to explore further and follow the author's work on Twitter. The author emphasizes that even seemingly complex movements can be defined by mathematical functions. The interactive experience uses Three.js and WebGL for the visualization.\n",
    "chinese_title": "Show HN：好奇球形螺旋，结果做了这个可视化",
    "chinese_summary": "此\"Show HN\"帖子链接到一个交互式可视化，解释了如何在3D空间中移动物体，最终创建出一个球形螺旋路径。作者Damar首先解释了3D坐标系（x、y和z轴）的基础知识，以及如何使用数学函数来定义物体随时间推移的位置。\n\n该可视化逐渐增加复杂度，从沿x轴的简单振荡开始，然后是y轴。接着，它演示了如何通过使用余弦和正弦函数协调x和y的运动来创建圆形路径。之后，项目转向通过使圆的半径随时间增长来创建螺旋。\n\n最后，该帖子解释了球形螺旋。这涉及到添加一个随时间变化的z坐标，并使用正弦函数修改x和y坐标，以使路径的半径增大和缩小。结果是一个物体沿着球形螺旋路径移动。\n\n该帖子总结道，在3D空间中的运动是通过将x、y和z坐标定义为时间的函数（参数方程）来实现的，并鼓励读者进一步探索并在Twitter上关注作者的作品。作者强调，即使是看似复杂的运动也可以通过数学函数来定义。该交互式体验使用Three.js和WebGL进行可视化。"
  },
  {
    "id": "44940649",
    "title": "Sütterlin",
    "url": "https://en.wikipedia.org/wiki/S%C3%BCtterlin",
    "summary": "Sütterlin is a historical form of German handwriting, a variant of Kurrent, which itself is a cursive form of Blackletter scripts like Fraktur. Created in 1911 by Ludwig Sütterlin and commissioned by the Prussian Ministry of Science, Art and Culture, it was introduced in Prussian schools in 1915, gradually replacing older German handwriting styles. By 1935, it was the only German script taught in schools.\n\nIn 1941, the Nazi Party banned Sütterlin and other Blackletter typefaces, replacing them with Antiqua. However, many Germans continued to use Sütterlin into the post-war period, and it was still taught in some schools until the 1970s.\n\nSütterlin includes distinctive features like the long s (ſ) and ligatures (e.g., ﬀ, ﬅ, ß). Its letters are sometimes used for mathematical symbols, and the lowercase 'd' is used in proofreading for \"deleatur.\" The lower-case 'e' with two vertical bars is thought to be the origin of the umlaut diacritic.\n",
    "chinese_title": "蘇特林體",
    "chinese_summary": "蘇特林體是一種歷史悠久的德語手寫體，是庫倫體的一種變體，而庫倫體本身則是像花體哥特體之類的黑體字的草書形式。它由路德維希·蘇特林於1911年創作，並受普魯士科學、藝術和文化部的委託，於1915年在普魯士學校中引入，逐漸取代了較舊的德語手寫風格。到1935年，它是學校中唯一教授的德語字體。\n\n1941年，納粹黨禁止了蘇特林體和其他黑體字體，並用羅馬體取代了它們。然而，許多德國人繼續在戰後時期使用蘇特林體，並且直到20世紀70年代仍在一些學校中教授它。\n\n蘇特林體包含一些獨特的特徵，例如長s (ſ) 和連字（例如，ﬀ, ﬅ, ß）。它的字母有時被用於數學符號，小寫字母“d”在校對中用於表示“刪除”。帶有兩條豎線的小寫字母“e”被認為是元音變音符號的起源。"
  },
  {
    "id": "44974488",
    "title": "Peer reviewers more likely to approve articles that cite their own work",
    "url": "https://www.nature.com/articles/d41586-025-02547-1",
    "summary": "This Nature article reports on a preprint study that analyzed 18,400 articles from four open-access publications to investigate coercive citation practices in peer review. The study found that reviewers were more likely to approve manuscripts if their own work was cited in subsequent versions. However, reviewers who explicitly requested citations to their own work were less likely to approve, reject, or express reservations compared to those who were not cited.\n\nThe research team analyzed reviewer comments, identifying frequently used words, and suggested that reviewers requesting citations sometimes employed coercive language, a claim contested by some experts.\n\nThe study highlighted that the lack of data sharing from publishers makes it difficult to study the practice of coercive citation. The analysis of reviewer comments showed that those who requested citations tended to use words like \"need\" or \"please\" more frequently when rejecting articles, which the researchers interpreted as suggestive of coercion. This finding was met with skepticism by some experts, who pointed out other possible reasons for rejection.\n",
    "chinese_title": "同行评审员更倾向于批准引用自己文章的论文。",
    "chinese_summary": "这篇《自然》杂志的文章报道了一项预印本研究，该研究分析了来自四种开放获取出版物的 18,400 篇文章，以调查同行评审中存在的强制引用行为。研究发现，如果作者在后续版本中引用了评审者的作品，稿件更容易被批准。然而，与未被引用的评审者相比，明确要求引用自己作品的评审者更不容易批准、拒绝或表达保留意见。\n\n研究团队分析了评审者的评论，识别出常用的词语，并认为要求引用的评审者有时会使用强制性语言，但这一说法遭到了部分专家的质疑。\n\n该研究强调，由于出版商缺乏数据共享，使得研究强制引用行为变得困难。对评审者评论的分析表明，那些要求引用的评审者在拒绝文章时，更倾向于使用诸如“需要”或“请”等词语，研究人员认为这暗示了强制行为。这一发现遭到了一些专家的怀疑，他们指出了其他可能的拒绝原因。"
  },
  {
    "id": "44964693",
    "title": "Project to formalise a proof of Fermat’s Last Theorem in the Lean theorem prover",
    "url": "https://imperialcollegelondon.github.io/FLT/",
    "summary": "This article describes an open-source project dedicated to formalizing a proof of Fermat's Last Theorem using the Lean theorem prover. The project is a collaborative effort led by Kevin Buzzard and is funded by a grant from the UK's Engineering and Physical Sciences Research Council (EP/Y022904/1). The project is based at Imperial College London. The article provides a link to more general information about the theorem, the Lean prover, and the motivation behind the project. In essence, the article announces the existence and current status of this ambitious undertaking.\n",
    "chinese_title": "使用 Lean 定理证明器形式化证明费马大定理的项目",
    "chinese_summary": "本文介绍了一个开源项目，该项目致力于使用 Lean 定理证明器形式化证明费马大定理。该项目由 Kevin Buzzard 领导，是一项合作成果，并由英国工程与物理科学研究委员会 (EP/Y022904/1) 资助。该项目位于伦敦帝国理工学院。本文提供了指向关于该定理、Lean 证明器以及该项目背后动机的更一般信息的链接。本质上，本文宣布了这项雄心勃勃的计划的存在和当前状态。"
  },
  {
    "id": "44965233",
    "title": "Introduction to AT Protocol",
    "url": "https://mackuba.eu/2025/08/20/introduction-to-atproto/",
    "summary": "This article introduces the AT Protocol, the underlying technology behind Bluesky, differentiating between \"Bluesky\" the company, and \"Bluesky\" the product (a specific application built on ATProto). ATProto is envisioned as a platform for various social \"apps\" or \"services,\" each potentially with different data types, rules, and user interfaces. The overarching environment of these apps is called \"The Atmosphere\".\n\nThe article then details the fundamental building blocks of ATProto:\n\n*   **Records:** JSON-like objects stored in CBOR format, representing data like posts, follows, and profiles. Users can only modify their own records.\n*   **Blobs:** Binary files used for storing media like images and videos.\n*   **Lexicons:** Schemas that define the structure and constraints of record types, identified by NSIDs (Namespace Identifiers). The `app.bsky.*` namespace designates lexicons specific to the Bluesky microblogging service, while `com.atproto.*` covers functionalities for all ATProto apps.\n*   **DIDs (Decentralized Identifiers):** Permanent, unique identifiers for each user. ATProto primarily uses the `did:plc` method, storing DID documents (containing handles, PDS server, keys) in a centralized service (plc.directory) with an audit log. While `did:web` exists, it's less common and ties accounts permanently to a domain.\n*   **Handles:** Human-readable identifiers (hostnames) that can be changed without affecting underlying connections because they link to the DID.\n",
    "chinese_title": "AT 协议简介",
    "chinese_summary": "本文介绍了AT协议，即Bluesky背后的底层技术，区分了“Bluesky”这家公司和“Bluesky”这款产品（一个构建在ATProto之上的具体应用）。ATProto被设想为一个面向各种社交“应用”或“服务”的平台，每个应用或服务都可能具有不同的数据类型、规则和用户界面。这些应用的总体环境被称为“大气层”（The Atmosphere）。\n\n文章随后详细介绍了ATProto的基本组成部分：\n\n*   **记录（Records）：** 以CBOR格式存储的类JSON对象，代表帖子、关注和个人资料等数据。用户只能修改自己的记录。\n*   **二进制数据块（Blobs）：** 用于存储图像和视频等媒体的二进制文件。\n*   **词汇表（Lexicons）：** 定义记录类型的结构和约束的模式，由NSID（命名空间标识符）标识。`app.bsky.*`命名空间指定了Bluesky微博服务特有的词汇表，而`com.atproto.*`涵盖了所有ATProto应用的功能。\n*   **DID（去中心化身份标识符）：** 每个用户的永久、唯一标识符。ATProto主要使用`did:plc`方法，将DID文档（包含句柄、PDS服务器、密钥）存储在具有审计日志的中心化服务（plc.directory）中。虽然存在`did:web`，但它不太常见，并且会将帐户永久绑定到域名。\n*   **句柄（Handles）：** 人类可读的标识符（主机名），可以在不影响底层连接的情况下进行更改，因为它们链接到DID。"
  },
  {
    "id": "44967505",
    "title": "SimpleIDE",
    "url": "https://github.com/jamesplotts/simpleide",
    "summary": "SimpleIDE is a lightweight, professional VB.NET IDE built for Linux using GTK# 3 and .NET 8.0. It offers a modern development environment specifically tailored for VB.NET projects on Linux.\n\nKey features include a multi-file tabbed code editor with VB.NET syntax highlighting, code completion, real-time error detection, and code folding. It also has project management capabilities such as project explorer, object explorer, and solution/project file support with NuGet package and assembly reference management.\n\nThe IDE incorporates an integrated build system utilizing the dotnet CLI, offering asynchronous build operations, a dockable output panel, and support for Debug and Release configurations. SimpleIDE is enhanced by Claude AI integration for code generation, refactoring, explanation, documentation, and smart suggestions.\n\nThe user interface supports dark and light themes, a customizable toolbar, and dockable panels. It also features Git integration, find and replace with regex, and settings persistence.\n\nInstallation requires a Linux system, .NET 8.0 SDK, and GTK# 3.24 or higher. Installation instructions are provided for Ubuntu/Debian and Fedora. Usage examples include command-line options and keyboard shortcuts.\n\nThe project structure is outlined, detailing key files and directories for the editor, widgets, models, syntax handling, managers, utilities, and resources. Configuration details, including settings file location and theme options, are provided along with environment variables for customization.\n\nThe project follows coding conventions like Hungarian notation and XML documentation. Contributions are welcome, following specified guidelines. The IDE is licensed under the GNU General Public License v3.\n",
    "chinese_title": "简易IDE",
    "chinese_summary": "SimpleIDE是一个轻量级的专业VB.NET IDE，使用GTK# 3和.NET 8.0构建，专为Linux平台设计。 它提供了一个专门为Linux上的VB.NET项目量身定制的现代化开发环境。\n\n主要功能包括一个多文件选项卡式代码编辑器，具有VB.NET语法高亮、代码完成、实时错误检测和代码折叠。 它还具有项目管理功能，如项目资源管理器、对象资源管理器以及支持NuGet包和程序集引用的解决方案/项目文件。\n\n该IDE集成了使用dotnet CLI的构建系统，提供异步构建操作、可停靠的输出面板以及对Debug和Release配置的支持。 SimpleIDE通过Claude AI集成得到增强，可用于代码生成、重构、解释、文档编写和智能建议。\n\n用户界面支持暗黑和浅色主题、可自定义的工具栏和可停靠的面板。 它还具有Git集成、带有正则表达式的查找和替换以及设置持久性。\n\n安装需要Linux系统、.NET 8.0 SDK和GTK# 3.24或更高版本。 提供了Ubuntu/Debian和Fedora的安装说明。 用法示例包括命令行选项和键盘快捷键。\n\n概述了项目结构，详细说明了编辑器、小部件、模型、语法处理、管理器、实用程序和资源的关键文件和目录。 提供了配置详细信息，包括设置文件位置和主题选项，以及用于自定义的环境变量。\n\n该项目遵循匈牙利命名法和XML文档等编码约定。 欢迎贡献，但需遵循指定的准则。 该IDE根据GNU通用公共许可证v3授权。"
  },
  {
    "id": "44966170",
    "title": "Show HN: PlutoPrint – Generate PDFs and PNGs from HTML with Python",
    "url": "https://github.com/plutoprint/plutoprint",
    "summary": "PlutoPrint is a Python library for generating PDFs and PNGs from HTML or XML content. Built upon PlutoBook's rendering engine, it offers a simple API to convert HTML into high-quality PDFs and images, suitable for reports, invoices, and snapshots.\n\nKey features include:\n\n*   **Easy Installation:** Install via `pip install plutoprint`, with optional pre-installation of PlutoBook for faster setup. Prebuilt binaries are available for Windows and Linux 64-bit.\n*   **Command-Line Tool:** Generate PDFs using the `plutoprint` script from the command line.\n*   **Python API:** Create PDFs and PNGs programmatically with `plutoprint.Book`.\n*   **Customization:** Offers control over page size, margins, and custom resource fetching. Example provided shows how to integrate Matplotlib charts dynamically within the HTML.\n*   **Examples:** The documentation and repository contain examples for invoices and tickets to show how to use PlutoPrint effectively.\n*   **Resources:** Documentation, sample code, issue tracking, and donation links are provided.\n*   **Licensing:** The library is licensed under the MIT License.\n",
    "chinese_title": "Show HN: PlutoPrint – 用 Python 从 HTML 生成 PDF 和 PNG",
    "chinese_summary": "PlutoPrint 是一个 Python 库，用于从 HTML 或 XML 内容生成 PDF 和 PNG。它构建于 PlutoBook 的渲染引擎之上，提供了一个简单的 API，可以将 HTML 转换为高质量的 PDF 和图像，适用于报告、发票和快照。\n\n主要功能包括：\n\n*   **易于安装：** 通过 `pip install plutoprint` 安装，可以选择预先安装 PlutoBook 以加快设置速度。预构建的二进制文件可用于 Windows 和 Linux 64 位。\n*   **命令行工具：** 使用命令行中的 `plutoprint` 脚本生成 PDF。\n*   **Python API：** 使用 `plutoprint.Book` 以编程方式创建 PDF 和 PNG。\n*   **自定义：** 提供对页面大小、边距和自定义资源获取的控制。 提供的示例展示了如何在 HTML 中动态集成 Matplotlib 图表。\n*   **示例：** 文档和存储库包含发票和票据的示例，以展示如何有效地使用 PlutoPrint。\n*   **资源：** 提供文档、示例代码、问题跟踪和捐赠链接。\n*   **许可：** 该库在 MIT 许可证下获得许可。"
  },
  {
    "id": "44963724",
    "title": "An Update on Pytype",
    "url": "https://github.com/google/pytype",
    "summary": "This article announces that Python 3.12 will be the last supported version for Pytype. Developed initially to meet Google's internal needs, Pytype provided compile-time type checking by using type inference and inline annotations and was instrumental in the creation of typeshed. However, Pytype's bytecode-based design has made it difficult to implement new features and adapt to changes in Python's bytecode structure. As a result, Google is shifting its focus to exploring new typing approaches better suited for its Python users. The announcement encourages users to consider the other robust type checking solutions available in the Python ecosystem and expresses gratitude to all Pytype contributors, especially Rebecca Chen, Martin DeMello, Teddy Sudol, and Matthias Kramm, for their dedication and contributions to Python's type system. The article emphasizes that the Python typing ecosystem is now mature and offers various alternative solutions.\n",
    "chinese_title": "Pytype 更新",
    "chinese_summary": "本文宣布 Python 3.12 将是 Pytype 支持的最后一个版本。Pytype 最初为满足 Google 内部需求而开发，通过类型推断和内联注解提供编译时类型检查，并对 typeshed 的创建起到了重要作用。然而，Pytype 基于字节码的设计使其难以实现新功能并适应 Python 字节码结构的变化。因此，Google 正在将其重心转移到探索更适合其 Python 用户的新型类型标注方法。该公告鼓励用户考虑 Python 生态系统中现有的其他强大的类型检查解决方案，并对所有 Pytype 贡献者，特别是 Rebecca Chen、Martin DeMello、Teddy Sudol 和 Matthias Kramm，表示感谢，感谢他们对 Python 类型系统的奉献和贡献。文章强调，Python 类型标注生态系统现已成熟，并提供多种替代解决方案。"
  },
  {
    "id": "44964916",
    "title": "Zedless: Zed fork focused on privacy and being local-first",
    "url": "https://github.com/zedless-editor/zed",
    "summary": "Zedless is a fork of the Zed code editor focused on privacy and operating locally. It's a work-in-progress seeking contributions. The core objective of Zedless is to eliminate reliance on proprietary cloud services, remove telemetry and crash reporting (considered \"spyware\"), and prioritize user-configured infrastructure. Any feature utilizing network services will allow users to specify their preferred provider using a standard format (like a base API URL) and will be disabled by default.\n\nFurther distancing itself from Zed, Zedless will not require contributors to reassign their copyright via a Contributor License Agreement (CLA). The project also emphasizes long-term commitment, promising no \"rugpulls.\"\n\nThe project places a strong emphasis on proper licensing. They use `cargo-about` to automatically verify compliance with open-source licenses for all dependencies. The documentation details how to address common licensing errors identified by their CI system, including adding `publish = false` to crate manifests, adding SPDX identifiers to their accepted licenses list, and adding clarifications for licenses not automatically found by `cargo-about`.\n",
    "chinese_title": "Zedless：注重隐私和本地优先的 Zed 分支",
    "chinese_summary": "Zedless：注重隐私和本地运行的Zed编辑器分支。它是一个正在进行中的项目，欢迎贡献。Zedless的核心目标是消除对专有云服务的依赖，移除遥测和崩溃报告（被认为是“间谍软件”），并优先考虑用户配置的基础设施。任何使用网络服务的功能都将允许用户使用标准格式（如基本API URL）指定他们偏好的提供商，并且默认情况下将被禁用。\n\n为了进一步与Zed拉开距离，Zedless不会要求贡献者通过贡献者许可协议（CLA）重新分配其版权。该项目还强调长期承诺，保证不会“跑路”。\n\n该项目非常重视正确的许可。他们使用`cargo-about`自动验证所有依赖项是否符合开源许可。文档详细说明了如何解决他们的CI系统识别出的常见许可错误，包括在crate清单中添加`publish = false`，在他们接受的许可列表中添加SPDX标识符，以及为`cargo-about`未自动找到的许可添加说明。"
  },
  {
    "id": "44971110",
    "title": "How to maintain an Open Source project (2023)",
    "url": "https://jyn.dev/how-to-maintain-an-open-source-project/",
    "summary": "Maintaining an open-source project hinges on prioritizing energy and community, not traditional metrics like time or money. The main threats are maintainer burnout and community collapse. The three core principles are: actively recruit new maintainers, ruthlessly prioritize existing maintainer energy, and be kind to users (which doesn't mean fulfilling every request, but rather respectful communication and easy issue reporting).\n\nBalancing these principles is crucial, as they can be contradictory. Automating repetitive tasks (CI, releases, etc.) frees up maintainer time. Regular, even unpolished, project updates on social media attract users and contributors. Comprehensive documentation, covering both usage and development, lowers the barrier to entry. And finally, taking breaks and communicating them prevents burnout.\n\nCultivating a positive project culture is vital. Learn to say no to new features, especially as the project matures. Seek out enthusiastic collaborators and balance constructive criticism with positive feedback. Remember that your well-being is paramount; avoid overwork and understand you're not obligated to immediately resolve every user issue.\n\nActively recruit maintainers by offering merge privileges early to active contributors. This fosters a sense of ownership and encourages continued involvement. Once a core group of contributors and users is established, the project can become self-sustaining, allowing the original founder to step back. Alice Cecile's talk is recommended for further insights on this.\n",
    "chinese_title": "如何维护开源项目（2023）",
    "chinese_summary": "维护开源项目，关键在于优先考虑精力和社区，而非传统的时间或金钱等指标。主要威胁是维护者倦怠和社区崩溃。三个核心原则是：积极招募新的维护者，无情地优先考虑现有维护者的精力，以及善待用户（这并非意味着满足每个请求，而是指尊重性的沟通和便捷的问题报告）。\n\n平衡这些原则至关重要，因为它们可能相互矛盾。自动化重复性任务（CI、发布等）可以释放维护者的时间。在社交媒体上定期发布项目更新（即使是不完善的），也能吸引用户和贡献者。全面的文档（涵盖使用和开发两方面）可以降低参与门槛。最后，休息并告知大家可以防止倦怠。\n\n培养积极的项目文化至关重要。学会对新功能说不，尤其是在项目成熟之后。寻找热情的合作者，并在建设性批评与积极反馈之间取得平衡。记住，你的福祉至关重要；避免过度工作，并理解你没有义务立即解决每个用户问题。\n\n通过尽早向活跃的贡献者提供合并权限来积极招募维护者。这可以培养主人翁意识，并鼓励持续参与。一旦建立了核心的贡献者和用户群体，项目就可以实现自我维持，允许最初的创始人逐步退出。推荐Alice Cecile的演讲，以获取更多相关见解。"
  },
  {
    "id": "44956915",
    "title": "How to Draw a Space Invader",
    "url": "https://muffinman.io/blog/invaders/",
    "summary": "This article details the creation process behind a Space Invader generator developed for a code challenge. The author outlines their journey from initial doodles to a fully functional, randomly generating invader creator.\n\nThe process begins with researching and drawing a set of Space Invaders in Aseprite to identify patterns. The author then decided to implement a vector-based approach for generating invaders. The core steps involve: creating a body polygon by randomly selecting and mirroring points, adding tentacles and horns using a \"fat line\" technique by calculating points on either side of a bisector line, pixelizing the vector shapes by checking if pixel centers fall within the generated shapes, adding predefined eye sets, and finally, applying color using the OKLCH color space for consistent lightness.\n\nThe article also explains how the generated invaders are animated to mimic the original game, by slightly shifting tentacle and horn endpoints and redrawing the shapes. The article touches on how increasing the grid size can affect the appearance of the invader, leading to more detail but also potentially exposing the underlying vector nature.\n\nThe author emphasizes the importance of stepping back to solve the problem before coding and shares insights into color selection and CSS manipulation. Finally, the author shares details on how the interactive animation in the blog post was built using Anime.js and integrated with the page scroll.\n",
    "chinese_title": "如何画太空侵略者",
    "chinese_summary": "本文详细介绍了为代码挑战而开发的太空侵略者生成器的创建过程。作者概述了他们从最初的草图到功能齐全、随机生成侵略者创建器的过程。\n\n该过程始于在Aseprite中研究和绘制一组太空侵略者以识别模式。然后，作者决定采用基于矢量的方法来生成侵略者。核心步骤包括：通过随机选择和镜像点来创建主体多边形，使用“粗线”技术（通过计算平分线两侧的点）添加触须和角，通过检查像素中心是否落在生成的形状内来像素化矢量形状，添加预定义的眼睛集合，最后，使用OKLCH颜色空间应用颜色以获得一致的亮度。\n\n本文还解释了如何通过稍微移动触须和角端点并重新绘制形状来动画化生成的侵略者以模仿原始游戏。本文探讨了增加网格大小如何影响侵略者的外观，从而产生更多细节，但也可能暴露底层矢量的本质。\n\n作者强调了在编码之前退后一步解决问题的重要性，并分享了对颜色选择和CSS操作的见解。最后，作者分享了有关如何使用Anime.js构建博客文章中的交互式动画并将其与页面滚动集成的详细信息。"
  },
  {
    "id": "44967543",
    "title": "Burner Phone 101",
    "url": "https://rebeccawilliams.info/burner-phone-101/",
    "summary": "This document summarizes a \"Burner Phone 101\" workshop hosted at the Brooklyn Public Library. The workshop aimed to educate participants on phone-related risk modeling and privacy practices, focusing on burner phone options and situations where avoiding phone usage altogether is preferable.\n\nThe workshop began by establishing goals, secret goals, and anti-goals, emphasizing safe and supportive learning. A core concept was risk modeling, framed around protecting data, identifying adversaries, and understanding potential failure consequences. The workshop then addressed the inherent risks of smartphones, highlighting how device IDs and data collection expose users to identity, location, communication, and content vulnerabilities.\n\nParticipants received specific privacy tips for both Android and iPhones, including keeping software updated, using strong PINs, disabling cloud backups, restricting app permissions, and minimizing sensitive data storage. The discussion also touched on SIM card limitations, phone data transmission when powered off, voiceprint biometrics, carrier data retention, and Fourth Amendment limits.\n\nThe workshop then explored the spectrum of \"burner phone\" options: prepaid/repurposed phones, SIM rotation, minimal/dumb phones, and device disguises (VoIP, VPNs). It emphasized that IMSI and IMEI make full anonymity difficult, but each option provides some protection if matched to specific risks. Key advice included purchasing with cash, avoiding personal information during activation, using public Wi-Fi for setup, minimizing app permissions and data, and rotating SIMs.\n\nFinally, the workshop addressed situations where \"no phone\" is the best approach, such as environments with high confiscation risk or where location tracking could be used as evidence. Analog tools, preset meeting points, and community phones were suggested as alternatives. The workshop concluded with a Q&A and live setup session.\n",
    "chinese_title": "一次性手机入门",
    "chinese_summary": "本文总结了在布鲁克林公共图书馆举办的“一次性手机101”研讨会。该研讨会旨在教育参与者有关手机相关的风险建模和隐私实践，重点关注一次性手机的选择以及在完全避免使用手机更为可取的情况。\n\n研讨会首先确立了目标、秘密目标和反目标，强调安全和支持性的学习环境。一个核心概念是风险建模，围绕保护数据、识别对手以及理解潜在的失败后果展开。研讨会随后讨论了智能手机的内在风险，强调了设备ID和数据收集如何使使用者暴露于身份、位置、通信和内容漏洞。\n\n参与者收到了针对Android和iPhone的具体隐私技巧，包括保持软件更新、使用强PIN码、禁用云备份、限制应用程序权限以及最大限度地减少敏感数据存储。讨论还涉及SIM卡的局限性、手机关机时的数据传输、声纹生物识别、运营商数据保留以及第四修正案的限制。\n\n研讨会随后探讨了“一次性手机”的选择范围：预付/重新利用的手机、SIM卡轮换、极简/功能手机和设备伪装（VoIP，VPN）。它强调了IMSI和IMEI使得完全匿名变得困难，但如果与特定风险相匹配，每种选择都提供一定的保护。关键建议包括使用现金购买、避免在激活期间提供个人信息、使用公共Wi-Fi进行设置、最大限度地减少应用程序权限和数据以及轮换SIM卡。\n\n最后，研讨会讨论了“不使用手机”是最佳方法的场景，例如存在高没收风险的环境或位置跟踪可能被用作证据的情况。模拟工具、预设的会面地点和社区电话被建议作为替代方案。研讨会以问答环节和现场设置环节结束。"
  },
  {
    "id": "44970401",
    "title": "Dev Reveals Secrets Behind New \"3D\" Platformer for the ZX Spectrum",
    "url": "https://www.timeextension.com/news/2025/08/dev-reveals-secrets-behind-stunning-new-3d-platformer-for-the-zx-spectrum",
    "summary": "\"Cubix,\" a new ZX Spectrum game by developer Gogin, is being hailed as the first \"3D platformer\" for the classic computer due to its impressive, Fez-like rotating levels. Developed for the YRGB 2025 retro game competition, Cubix is a puzzle platformer where players control Bix, a square-shaped creature, to collect talismans across six towers.\n\nGogin was inspired by the game Fez and started prototyping the engine in C# before porting it to assembly language, completing the project in 4.5 months. The \"3D\" effect is achieved using flat 2D tiles manipulated to create the illusion of depth. The game utilizes three main tables: a \"tile grid\" for displaying 3D tiles, a \"coordinate grid\" for flat images, and a \"precise\" coordinate table for accurate sprite placement.\n\nThe engine optimizes performance by pre-calculating and storing rotation data in memory, minimizing real-time processing to save Z80 clock cycles. The game efficiently manages memory by utilizing the upper 16KB memory bank for screen output procedures, optimization tables, and graphics.\n\nCubix is available for download on the YRGB 2025 website and can be played on emulators or compatible ZX Spectrum hardware.\n",
    "chinese_title": "开发者揭秘ZX Spectrum全新“3D”平台游戏的幕后故事",
    "chinese_summary": "由Gogin开发的ZX Spectrum新游戏《Cubix》被誉为这款经典电脑上的首款“3D平台游戏”，这归功于其令人印象深刻、类似《Fez》的旋转关卡。作为YRGB 2025复古游戏竞赛的作品，《Cubix》是一款益智平台游戏，玩家控制一个名为Bix的方形生物，在六座塔楼中收集护身符。\n\nGogin受到了游戏《Fez》的启发，并首先用C#构建引擎原型，然后将其移植到汇编语言，在4.5个月内完成了该项目。“3D”效果是通过操作平面2D图块来实现的，从而创造出深度错觉。该游戏使用了三个主要表格：“图块网格”用于显示3D图块，“坐标网格”用于平面图像，以及一个用于精确精灵放置的“精确”坐标表。\n\n该引擎通过预先计算并将旋转数据存储在内存中来优化性能，从而最大限度地减少实时处理，以节省Z80时钟周期。该游戏通过利用顶部16KB内存库进行屏幕输出程序、优化表格和图形来有效地管理内存。\n\n《Cubix》可在YRGB 2025网站上下载，并可在模拟器或兼容的ZX Spectrum硬件上运行。"
  },
  {
    "id": "44962969",
    "title": "OPA maintainers and Styra employees hired by Apple",
    "url": "https://blog.openpolicyagent.org/note-from-teemu-tim-and-torin-to-the-open-policy-agent-community-2dbbfe494371",
    "summary": "The article is a letter from Teemu, Tim, and Torin, three of the Open Policy Agent (OPA) maintainers, to the OPA community. They announce that they have joined Apple. Prior to this, they were all employed by Styra, a company heavily involved in supporting and commercializing OPA.\n\nThe letter emphasizes that their commitment to OPA remains strong. They assure the community that they will continue contributing to OPA's development and growth within their new roles at Apple. They highlight that Apple is a significant user of OPA and that their presence there will allow them to further advocate for and contribute to the project's evolution.\n\nThe key message is one of reassurance and continued dedication. While their employer has changed, their passion for OPA and their commitment to the open-source community remains unwavering. They express optimism about the future of OPA, especially with Apple's increasing reliance on and engagement with the project. Finally, they encourage continued community involvement and contribution to OPA's ongoing success. They frame this move as a positive one for OPA, as it brings more resources and expertise to the project through Apple's support.\n",
    "chinese_title": "OPA维护者和Styra雇员被苹果聘用",
    "chinese_summary": "此文为Open Policy Agent (OPA) 的三位维护者 Teemu、Tim 和 Torin 致 OPA 社区的信函。他们宣布已加入苹果公司。在此之前，他们都受雇于 Styra 公司，该公司深度参与 OPA 的支持和商业化。\n\n信中强调他们对 OPA 的承诺依然坚定。他们向社区保证，他们将在苹果公司的新职位上继续为 OPA 的开发和发展做出贡献。他们强调苹果公司是 OPA 的重要用户，他们在苹果的工作将使他们能够进一步倡导并为该项目的演进做出贡献。\n\n主要信息是保证和持续奉献。尽管他们的雇主发生了变化，但他们对 OPA 的热情以及对开源社区的承诺仍然坚定不移。他们对 OPA 的未来表示乐观，尤其是在苹果公司日益依赖和参与该项目的情况下。最后，他们鼓励社区继续参与并为 OPA 的持续成功做出贡献。他们将此举视为对 OPA 有益的，因为它通过苹果公司的支持为该项目带来了更多的资源和专业知识。"
  },
  {
    "id": "44958621",
    "title": "Analysis of the GFW's Unconditional Port 443 Block on August 20, 2025",
    "url": "https://gfw.report/blog/gfw_unconditional_rst_20250820/en/",
    "summary": "This report analyzes the Great Firewall of China's (GFW) unusual behavior on August 20, 2025, when it implemented an unconditional block on TCP port 443 for approximately 74 minutes, disrupting internet connections both to and from China. The analysis reveals that the GFW injected forged TCP RST+ACK packets to terminate connections.\n\nThe triggering mechanism differed for traffic originating from inside and outside China. Inside China, both the SYN and SYN+ACK packets triggered RST+ACK injections. Outside China, only the server's SYN+ACK response triggered the blocking. The blocking was specific to port 443, with other common ports remaining unaffected.\n\nAttribution analysis revealed that the device responsible for the incident doesn't match known GFW fingerprints, suggesting either a new device or a misconfigured existing one. While the injected RST+ACK packets shared similarities with previously identified GFW middleboxes, the incremental nature of fields like IP TTL and TCP window size distinguished it.\n\nThe report includes tcpdump outputs demonstrating the packet injection and the different triggering mechanisms. It also details the characteristics of the injected RST packets, noting their incrementally increasing TTL and TCP window size. The authors encourage further investigation from the community due to the limited duration of the event.\n",
    "chinese_title": "2025年8月20日 GFW 无条件屏蔽 443 端口分析",
    "chinese_summary": "本报告分析了2025年8月20日中国防火墙（GFW）的异常行为，当时它无条件地封锁了TCP 443端口约74分钟，中断了中国境内外的互联网连接。分析表明，GFW注入了伪造的TCP RST+ACK数据包以终止连接。\n\n对于来自中国境内和境外的流量，触发机制有所不同。在中国境内，SYN和SYN+ACK数据包都会触发RST+ACK注入。在中国境外，只有服务器的SYN+ACK响应才会触发封锁。此次封锁仅针对443端口，其他常用端口未受影响。\n\n归因分析显示，导致此次事件的设备与已知的GFW指纹不符，表明可能存在新设备或配置错误的现有设备。虽然注入的RST+ACK数据包与之前识别出的GFW中间盒相似，但IP TTL和TCP窗口大小等字段的增量性质使其有所区别。\n\n本报告包含tcpdump输出，展示了数据包注入和不同的触发机制。它还详细介绍了注入的RST数据包的特征，并指出其TTL和TCP窗口大小的增量增加。由于事件持续时间有限，作者鼓励社区进行进一步调查。"
  },
  {
    "id": "44963939",
    "title": "Pixel 10 Phones",
    "url": "https://blog.google/products/pixel/google-pixel-10-pro-xl/",
    "summary": "The Pixel 10, Pixel 10 Pro, and Pixel 10 Pro XL, Google's 10th generation of Pixel phones, are available for preorder now and will be on shelves August 28th. They feature a refreshed design with recycled materials, improved displays, and the new Google Tensor G5 chip paired with the Gemini Nano model for enhanced, on-device AI experiences.\n\nThe phones boast design refinements like Pixelsnap for Qi2 wireless charging and magnetic accessories, and utilize Material 3 Expressive for a personalized UI with fluid animations. The standard Pixel 10 features a satin-finish metal frame, polished glass back, a brighter 6.3-inch Actua display, and a 5x telephoto lens. The Pro models offer premium designs, brighter Super Actua displays, and improved triple rear camera systems in two sizes. The Pro models include the new Moonstone and Jade color options, as well as Obsidian and Porcelain.\n\nA key feature is \"Magic Cue,\" which proactively provides helpful information within apps using the Tensor G5 chip and Gemini Nano. For example, Magic Cue can automatically find and display flight details during a call to an airline.\n\nThe Pixel 10 series introduces \"Camera Coach,\" offering AI-driven suggestions to improve photos. Exclusively on the Pro models, \"Pro Res Zoom\" leverages generative AI to capture detailed images at up to 100x zoom, representing a significant advancement in smartphone zoom technology.\n\nThe Pixel 10 starts at $799, the Pixel 10 Pro at $999, and the Pixel 10 Pro XL at $1199. Pixel 10 Pro and Pro XL owners receive a year of Google AI Pro.\n",
    "chinese_title": "像素 10 手机",
    "chinese_summary": "The Pixel 10, Pixel 10 Pro, and Pixel 10 Pro XL, Google's 10th generation of Pixel phones, are available for preorder now and will be on shelves August 28th. They feature a refreshed design with recycled materials, improved displays, and the new Google Tensor G5 chip paired with the Gemini Nano model for enhanced, on-device AI experiences.\n\nThe phones boast design refinements like Pixelsnap for Qi2 wireless charging and magnetic accessories, and utilize Material 3 Expressive for a personalized UI with fluid animations. The standard Pixel 10 features a satin-finish metal frame, polished glass back, a brighter 6.3-inch Actua display, and a 5x telephoto lens. The Pro models offer premium designs, brighter Super Actua displays, and improved triple rear camera systems in two sizes. The Pro models include the new Moonstone and Jade color options, as well as Obsidian and Porcelain.\n\nA key feature is \"Magic Cue,\" which proactively provides helpful information within apps using the Tensor G5 chip and Gemini Nano. For example, Magic Cue can automatically find and display flight details during a call to an airline.\n\nThe Pixel 10 series introduces \"Camera Coach,\" offering AI-driven suggestions to improve photos. Exclusively on the Pro models, \"Pro Res Zoom\" leverages generative AI to capture detailed images at up to 100x zoom, representing a significant advancement in smartphone zoom technology.\n\nThe Pixel 10 starts at $799, the Pixel 10 Pro at $999, and the Pixel 10 Pro XL at $1199. Pixel 10 Pro and Pro XL owners receive a year of Google AI Pro.\n"
  },
  {
    "id": "44959833",
    "title": "Mirrorshades: The Cyberpunk Anthology (1986)",
    "url": "https://www.rudyrucker.com/mirrorshades/HTML/",
    "summary": "生成摘要时出错",
    "chinese_title": "Mirrorshades: The Cyberpunk Anthology (1986)",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44938499",
    "title": "The Illumos Cafe: Another Cozy Corner for OS Diversity",
    "url": "https://it-notes.dragas.net/2025/08/18/introducing-the-illumos-cafe/",
    "summary": "生成摘要时出错",
    "chinese_title": "The Illumos Cafe: Another Cozy Corner for OS Diversity",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44940896",
    "title": "Basic dependency injection in OCaml with objects",
    "url": "https://gr-im.github.io/a/dependency-injection.html",
    "summary": "生成摘要时出错",
    "chinese_title": "Basic dependency injection in OCaml with objects",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44962869",
    "title": "Closer to the Metal: Leaving Playwright for CDP",
    "url": "https://browser-use.com/posts/playwright-to-cdp",
    "summary": "生成摘要时出错",
    "chinese_title": "Closer to the Metal: Leaving Playwright for CDP",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44959092",
    "title": "Databricks is raising a Series K Investment at >$100B valuation",
    "url": "https://www.databricks.com/company/newsroom/press-releases/databricks-raising-series-k-investment-100-billion-valuation",
    "summary": "Databricks announced a Series K investment round valuing the company at over $100 billion, backed by existing investors. The funding will accelerate Databricks' AI strategy, focusing on Agent Bricks, its new database offering Lakebase, and global growth. The investment will also support AI acquisitions and research. CEO Ali Ghodsi highlights the high investor interest driven by the momentum of Databricks' AI products.\n\nDatabricks aims to enable companies to convert their data into AI apps and agents, driving revenue, efficiency, and smarter decisions. This investment follows strong partnerships with Microsoft, Google Cloud, Anthropic, SAP, and Palantir. Over 15,000 customers utilize the Databricks Data Intelligence Platform for democratized access to data and AI, boosting innovation, revenue, and cost reduction. Databricks, headquartered in San Francisco, was founded by the creators of Lakehouse, Apache Spark, Delta Lake, MLflow, and Unity Catalog.\n",
    "chinese_title": "Databricks is raising a Series K Investment at >$100B valuation",
    "chinese_summary": "Databricks announced a Series K investment round valuing the company at over $100 billion, backed by existing investors. The funding will accelerate Databricks' AI strategy, focusing on Agent Bricks, its new database offering Lakebase, and global growth. The investment will also support AI acquisitions and research. CEO Ali Ghodsi highlights the high investor interest driven by the momentum of Databricks' AI products.\n\nDatabricks aims to enable companies to convert their data into AI apps and agents, driving revenue, efficiency, and smarter decisions. This investment follows strong partnerships with Microsoft, Google Cloud, Anthropic, SAP, and Palantir. Over 15,000 customers utilize the Databricks Data Intelligence Platform for democratized access to data and AI, boosting innovation, revenue, and cost reduction. Databricks, headquartered in San Francisco, was founded by the creators of Lakehouse, Apache Spark, Delta Lake, MLflow, and Unity Catalog.\n"
  },
  {
    "id": "44962059",
    "title": "Gemma 3 270M re-implemented in pure PyTorch for local tinkering",
    "url": "https://github.com/rasbt/LLMs-from-scratch/tree/main/ch05/12_gemma3",
    "summary": "生成摘要时出错",
    "chinese_title": "Gemma 3 270M re-implemented in pure PyTorch for local tinkering",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44962844",
    "title": "AWS in 2025: Stuff you think you know that's now wrong",
    "url": "https://www.lastweekinaws.com/blog/aws-in-2025-the-stuff-you-think-you-know-thats-now-wrong/",
    "summary": "生成摘要时出错",
    "chinese_title": "AWS in 2025: Stuff you think you know that's now wrong",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44972808",
    "title": "In a first, Google has released data on how much energy an AI prompt uses",
    "url": "https://www.technologyreview.com/2025/08/21/1122288/google-gemini-ai-energy/",
    "summary": "生成摘要时出错",
    "chinese_title": "In a first, Google has released data on how much energy an AI prompt uses",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44967923",
    "title": "Advice for Tech Non-Profits",
    "url": "https://mitchellh.com/writing/advice-for-tech-nonprofits",
    "summary": "生成摘要时出错",
    "chinese_title": "Advice for Tech Non-Profits",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44974207",
    "title": "Highest-Paying Jobs in America",
    "url": "https://stacker.com/stories/careers/50-highest-paying-jobs-america",
    "summary": "生成摘要时出错",
    "chinese_title": "Highest-Paying Jobs in America",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44974201",
    "title": "Battery prices are falling, so why are electric cars still so expensive?",
    "url": "https://www.nature.com/articles/d41586-025-02619-2",
    "summary": "生成摘要时出错",
    "chinese_title": "Battery prices are falling, so why are electric cars still so expensive?",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44968129",
    "title": "Creating 3D Worlds with HTML and CSS (2013)",
    "url": "https://keithclark.co.uk/articles/creating-3d-worlds-with-html-and-css/",
    "summary": "生成摘要时出错",
    "chinese_title": "Creating 3D Worlds with HTML and CSS (2013)",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44970998",
    "title": "The Open-Office Trap (2014)",
    "url": "https://www.newyorker.com/business/currency/the-open-office-trap",
    "summary": "生成摘要时出错",
    "chinese_title": "The Open-Office Trap (2014)",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44974171",
    "title": "Show HN: Rubberduck – Open Source Tool to Emulate OpenAI/Anthropic APIs Locally",
    "url": "https://github.com/Zipstack/rubberduck",
    "summary": "生成摘要时出错",
    "chinese_title": "Show HN: Rubberduck – Open Source Tool to Emulate OpenAI/Anthropic APIs Locally",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44957443",
    "title": "AGENTS.md – Open format for guiding coding agents",
    "url": "https://agents.md/",
    "summary": "AGENTS.md is a new open format designed to provide coding agents with the necessary context to work effectively on a project, complementing the human-focused README.md. It offers a dedicated and predictable location for detailed instructions, such as build steps, testing procedures, and coding conventions that might clutter a README.\n\nKey benefits include:\n\n*   **Agent-Focused Guidance:** Provides precise instructions tailored to coding agents, separate from human-focused documentation.\n*   **Ecosystem Compatibility:** AGENTS.md is designed to be compatible with various AI coding agents like Codex, AmpJules, Cursor, and Factory.\n*   **Monorepo Support:** Nested AGENTS.md files allow subprojects to have tailored instructions, with the closest file in the directory tree taking precedence.\n\nHow to use AGENTS.md:\n\n1.  Create an AGENTS.md file at the root of your repository.\n2.  Include sections that cover project overview, build and test commands, code style guidelines, testing instructions, and security considerations.\n3.  Add any other helpful information, such as commit message guidelines or deployment steps.\n\nThe format is simple Markdown, allowing for flexibility in structure and content. Agents will attempt to run testing commands found in AGENTS.md. The document is intended to be living documentation, regularly updated as the project evolves. The goal is to benefit the developer community by providing a standard way to instruct coding agents.\n",
    "chinese_title": "AGENTS.md – Open format for guiding coding agents",
    "chinese_summary": "AGENTS.md is a new open format designed to provide coding agents with the necessary context to work effectively on a project, complementing the human-focused README.md. It offers a dedicated and predictable location for detailed instructions, such as build steps, testing procedures, and coding conventions that might clutter a README.\n\nKey benefits include:\n\n*   **Agent-Focused Guidance:** Provides precise instructions tailored to coding agents, separate from human-focused documentation.\n*   **Ecosystem Compatibility:** AGENTS.md is designed to be compatible with various AI coding agents like Codex, AmpJules, Cursor, and Factory.\n*   **Monorepo Support:** Nested AGENTS.md files allow subprojects to have tailored instructions, with the closest file in the directory tree taking precedence.\n\nHow to use AGENTS.md:\n\n1.  Create an AGENTS.md file at the root of your repository.\n2.  Include sections that cover project overview, build and test commands, code style guidelines, testing instructions, and security considerations.\n3.  Add any other helpful information, such as commit message guidelines or deployment steps.\n\nThe format is simple Markdown, allowing for flexibility in structure and content. Agents will attempt to run testing commands found in AGENTS.md. The document is intended to be living documentation, regularly updated as the project evolves. The goal is to benefit the developer community by providing a standard way to instruct coding agents.\n"
  },
  {
    "id": "44961172",
    "title": "Sequoia backs Zed",
    "url": "https://zed.dev/blog/sequoia-backs-zed",
    "summary": "Zed, the company building a high-speed IDE, has secured $32M in Series B funding led by Sequoia Capital, bringing their total funding to over $42M. This funding will fuel the development of \"DeltaDB,\" a new type of operation-based version control system designed to revolutionize software collaboration.\n\nThe core problem Zed aims to solve is the disconnect between code and the conversations surrounding it. Current tools like Git, with their snapshot-based approach, make it difficult to maintain context and integrate discussions, especially when working with AI agents. DeltaDB will track every operation, not just commits, using CRDTs for incremental change recording and synchronization. This allows for real-time interaction and fine-grained, character-level permalinks that survive code transformations, anchoring discussions to specific locations in the code.\n\nZed's vision is to transform the IDE into a collaborative workspace where humans and AI agents work together seamlessly, preserving insights and linking them directly to the evolving codebase. This allows for better context, especially for new engineers or when debugging, as they can access the history of discussions and decisions related to specific lines of code.\n\nDeltaDB will be open-sourced with an optional paid service, similar to Zed's current model. The company is actively hiring engineers and product designers to contribute to this vision of a collaborative future for software development.\n",
    "chinese_title": "Sequoia backs Zed",
    "chinese_summary": "Zed, the company building a high-speed IDE, has secured $32M in Series B funding led by Sequoia Capital, bringing their total funding to over $42M. This funding will fuel the development of \"DeltaDB,\" a new type of operation-based version control system designed to revolutionize software collaboration.\n\nThe core problem Zed aims to solve is the disconnect between code and the conversations surrounding it. Current tools like Git, with their snapshot-based approach, make it difficult to maintain context and integrate discussions, especially when working with AI agents. DeltaDB will track every operation, not just commits, using CRDTs for incremental change recording and synchronization. This allows for real-time interaction and fine-grained, character-level permalinks that survive code transformations, anchoring discussions to specific locations in the code.\n\nZed's vision is to transform the IDE into a collaborative workspace where humans and AI agents work together seamlessly, preserving insights and linking them directly to the evolving codebase. This allows for better context, especially for new engineers or when debugging, as they can access the history of discussions and decisions related to specific lines of code.\n\nDeltaDB will be open-sourced with an optional paid service, similar to Zed's current model. The company is actively hiring engineers and product designers to contribute to this vision of a collaborative future for software development.\n"
  },
  {
    "id": "44939456",
    "title": "MapLibre Tile: A next generation geospatial format optimized for rendering",
    "url": "https://arxiv.org/abs/2508.10791",
    "summary": "生成摘要时出错",
    "chinese_title": "MapLibre Tile: A next generation geospatial format optimized for rendering",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44932509",
    "title": "Visualizing GPT-OSS-20B embeddings",
    "url": "https://melonmars.github.io/LatentExplorer/embedding_viewer.html",
    "summary": "生成摘要时出错",
    "chinese_title": "Visualizing GPT-OSS-20B embeddings",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44958400",
    "title": "Modern CI is too complex and misdirected (2021)",
    "url": "https://gregoryszorc.com/blog/2021/04/07/modern-ci-is-too-complex-and-misdirected/",
    "summary": "生成摘要时出错",
    "chinese_title": "Modern CI is too complex and misdirected (2021)",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44935850",
    "title": "The Rise and Fall of Music Ringtones: A Statistical Analysis",
    "url": "https://www.statsignificant.com/p/the-rise-and-fall-of-music-ringtones",
    "summary": "生成摘要时出错",
    "chinese_title": "The Rise and Fall of Music Ringtones: A Statistical Analysis",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44937819",
    "title": "The Block Stacking Problem",
    "url": "https://sites.pitt.edu/~jdnorton/Goodies/block_stacking/block_stacking.html",
    "summary": "生成摘要时出错",
    "chinese_title": "The Block Stacking Problem",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44962361",
    "title": "Learning about GPUs through measuring memory bandwidth",
    "url": "https://www.evolvebenchmark.com/blog-posts/learning-about-gpus-through-measuring-memory-bandwidth",
    "summary": "生成摘要时出错",
    "chinese_title": "Learning about GPUs through measuring memory bandwidth",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44939165",
    "title": "The End of Handwriting",
    "url": "https://www.wired.com/story/the-end-of-handwriting/",
    "summary": "生成摘要时出错",
    "chinese_title": "The End of Handwriting",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44968638",
    "title": "Scamlexity",
    "url": "https://guard.io/labs/scamlexity-we-put-agentic-ai-browsers-to-the-test-they-clicked-they-paid-they-failed",
    "summary": "生成摘要时出错",
    "chinese_title": "Scamlexity",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44972740",
    "title": "To Download Adult Mods on Nexus, You Need to Show ID",
    "url": "https://www.thegamer.com/nexus-mods-uk-online-safety-act-id-verification-adult-content/",
    "summary": "生成摘要时出错",
    "chinese_title": "To Download Adult Mods on Nexus, You Need to Show ID",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44971270",
    "title": "AI Mode in Search gets new agentic features and expands globally",
    "url": "https://blog.google/products/search/ai-mode-agentic-personalized/",
    "summary": "生成摘要时出错",
    "chinese_title": "AI Mode in Search gets new agentic features and expands globally",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44972247",
    "title": "Do Food Expiration Dates Matter?",
    "url": "https://www.nytimes.com/2025/08/19/well/eat/food-expiration-dates-effective.html",
    "summary": "生成摘要时出错",
    "chinese_title": "Do Food Expiration Dates Matter?",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44931305",
    "title": "Mirror Ball Emoji Proposal (2018) [pdf]",
    "url": "https://www.unicode.org/L2/L2019/19310-mirror-ball-emoji.pdf",
    "summary": "生成摘要时出错",
    "chinese_title": "Mirror Ball Emoji Proposal (2018) [pdf]",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44961847",
    "title": "Improvements to OCaml code editing: the basics of a refactor engine",
    "url": "https://tarides.com/blog/2025-08-20-internship-report-refactoring-tools-coming-to-merlin/",
    "summary": "生成摘要时出错",
    "chinese_title": "Improvements to OCaml code editing: the basics of a refactor engine",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44960594",
    "title": "Show HN: Project management system for Claude Code",
    "url": "https://github.com/automazeio/ccpm",
    "summary": "生成摘要时出错",
    "chinese_title": "Show HN: Project management system for Claude Code",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44939849",
    "title": "Intel Foundry demonstrates first Arm-based chip on 18a node",
    "url": "https://hothardware.com/news/intel-foundry-demos-deer-creek-falls-reference-soc",
    "summary": "生成摘要时出错",
    "chinese_title": "Intel Foundry demonstrates first Arm-based chip on 18a node",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44943666",
    "title": "How to Think About GPUs",
    "url": "https://jax-ml.github.io/scaling-book/gpus/",
    "summary": "生成摘要时出错",
    "chinese_title": "How to Think About GPUs",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44963226",
    "title": "Show HN: Anchor Relay – A faster, easier way to get Let's Encrypt certificates",
    "url": "https://anchor.dev/relay",
    "summary": "生成摘要时出错",
    "chinese_title": "Show HN: Anchor Relay – A faster, easier way to get Let's Encrypt certificates",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44957157",
    "title": "Tiny microbe challenges the definition of cellular life",
    "url": "https://nautil.us/a-rogue-new-life-form-1232095/",
    "summary": "生成摘要时出错",
    "chinese_title": "Tiny microbe challenges the definition of cellular life",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44963391",
    "title": "Best Options for Using AI in Chip Design",
    "url": "https://semiengineering.com/best-options-for-using-ai-in-chip-design/",
    "summary": "生成摘要时出错",
    "chinese_title": "Best Options for Using AI in Chip Design",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44964266",
    "title": "Show HN: Nestable.dev – local whiteboard app with nestable canvases, deep links",
    "url": "https://nestable.dev/about",
    "summary": "生成摘要时出错",
    "chinese_title": "Show HN: Nestable.dev – local whiteboard app with nestable canvases, deep links",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44931079",
    "title": "Linear scan register allocation on SSA",
    "url": "https://bernsteinbear.com/blog/linear-scan/",
    "summary": "生成摘要时出错",
    "chinese_title": "Linear scan register allocation on SSA",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44960316",
    "title": "Tidewave Web: in-browser coding agent for Rails and Phoenix",
    "url": "https://tidewave.ai/blog/tidewave-web-phoenix-rails",
    "summary": "生成摘要时出错",
    "chinese_title": "Tidewave Web: in-browser coding agent for Rails and Phoenix",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44970269",
    "title": "Australia Post halts transit shipping to US as 'chaotic' tariff deadline looms",
    "url": "https://www.abc.net.au/news/2025-08-21/australia-post-suspends-transit-shipping-parcels-us-trump-tariff/105680456",
    "summary": "生成摘要时出错",
    "chinese_title": "Australia Post halts transit shipping to US as 'chaotic' tariff deadline looms",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44969277",
    "title": "'Reading crisis' prompts Denmark to end 25% tax on books",
    "url": "https://www.rte.ie/news/world/2025/0820/1529397-denmark-book-tax/",
    "summary": "生成摘要时出错",
    "chinese_title": "'Reading crisis' prompts Denmark to end 25% tax on books",
    "chinese_summary": "生成摘要时出错"
  }
]