[
  {
    "id": "45916196",
    "title": "Zed Is Our Office",
    "url": "https://zed.dev/blog/zed-is-our-office",
    "summary": "Zed Industries uses its own text editor, Zed, as its virtual office, highlighting its collaborative features and seamless integration. The article emphasizes that collaboration is not just an add-on, but built into Zed's DNA, using CRDTs for conflict-free editing and low latency, regardless of location or team size. Unlike other editors requiring extensions and link sharing, Zed uses GitHub handles for easy setup and includes built-in audio and screensharing.\n\nThe \"virtual office\" is organized around a hierarchical channel tree, serving different purposes: company-wide discussions, project-specific collaboration, and individual focus time. Company-wide channels are used for all-hands meetings, retrospectives, and demos, while project channels facilitate code sharing and task management. Personal channels provide individual workspaces for focused work.\n\nZed is designed to promote continuous conversation and integration of discussions, edits, and insights with the code.  While the development has been prioritized and detoured by user requested features like debugging, windows and git support, their primary goal remains focused on building the greatest multiplayer software development tool. The collaboration features are currently in alpha and free to use. The article concludes with invitations to download Zed and consider joining the team.\n",
    "chinese_title": "Zed 是我们的办公室",
    "chinese_summary": "Zed Industries 将其自身的文本编辑器 Zed 作为其虚拟办公室，突出了其协作功能和无缝集成。文章强调，协作不仅仅是一个附加功能，而是融入了 Zed 的 DNA，使用 CRDT 实现无冲突编辑和低延迟，无论位置或团队规模如何。与其他需要扩展和链接共享的编辑器不同，Zed 使用 GitHub 句柄进行轻松设置，并包含内置的音频和屏幕共享功能。\n\n“虚拟办公室”围绕着一个分层频道树组织，用于不同的目的：公司范围内的讨论、项目特定的协作和个人专注时间。公司范围内的频道用于全体会议、回顾和演示，而项目频道则促进代码共享和任务管理。个人频道为专注工作提供个人工作空间。\n\nZed 旨在促进持续的对话，并将讨论、编辑和见解与代码集成。虽然开发工作因用户要求的功能（如调试、窗口和 git 支持）而优先处理并有所偏离，但他们的主要目标仍然是构建最强大的多人软件开发工具。协作功能目前处于 Alpha 阶段，可免费使用。文章最后邀请用户下载 Zed 并考虑加入团队。"
  },
  {
    "id": "45916525",
    "title": "Launch HN: Tweeks (YC W25) – Browser extension to de-enshittify the web",
    "url": "https://www.tweeks.io/onboarding",
    "summary": "Tweeks, a new browser extension from YC W25, aims to \"de-enshittify\" the web by giving users control over their online experience. The extension allows users to customize websites by removing distractions, personalizing feeds, and applying custom themes and redesigns.\n\nThe key features include:\n\n*   **Custom Tweeks:** Users can generate tailor-made modifications using natural language prompts or utilize pre-built scripts.\n*   **Universal Application:** Tweeks works on any website.\n*   **Inspiration Library:** Provides example tweeks for users to try and adapt.\n\nThe landing page guides users through the installation process and showcases example tweeks for popular platforms like LinkedIn, X (Twitter), Google, and YouTube. These examples demonstrate features like focus mode (removing sidebars and distractions), feed personalization (filtering by ads, date, likes, and replies), and custom branding (applying themes like a 1970s command-line interface to Google).\n\nThe \"Preview Mode\" for each example is locked until the extension is installed, encouraging users to download and experiment with Tweeks. The core message is empowering users to reclaim control over their online environments, fighting against algorithm-driven content and unwanted distractions.\n",
    "chinese_title": "启动HN：Tweeks (YC W25) – 用于清理垃圾网络的浏览器扩展",
    "chinese_summary": "Tweeks：一款YC W25出品的浏览器扩展，旨在通过赋予用户掌控在线体验的权力，来“去垃圾化”网络。该扩展允许用户自定义网站，移除干扰、个性化信息流，并应用自定义主题和重新设计。\n\n主要功能包括：\n\n*   **自定义调整 (Custom Tweeks):** 用户可以使用自然语言提示生成定制修改，或使用预置脚本。\n*   **通用应用 (Universal Application):** Tweeks 可在任何网站上运行。\n*   **灵感库 (Inspiration Library):** 提供示例调整，供用户尝试和修改。\n\n登录页面引导用户完成安装过程，并展示针对LinkedIn、X (Twitter)、Google和YouTube等热门平台的示例调整。这些示例演示了诸如专注模式（移除侧边栏和干扰）、信息流个性化（按广告、日期、点赞和回复进行过滤）以及自定义品牌（将诸如1970年代命令行界面等主题应用于Google）等功能。\n\n每个示例的“预览模式”在安装扩展程序之前会被锁定，从而鼓励用户下载并试用 Tweeks。核心信息是赋能用户重新掌控他们的在线环境，对抗算法驱动的内容和不必要的干扰。"
  },
  {
    "id": "45915731",
    "title": "GitHub Partial Outage",
    "url": "https://www.githubstatus.com/incidents/1jw8ltnr1qrj",
    "summary": "This GitHub Status update reports a partial outage affecting git push and pull operations for some users on November 13, 2025. The incident began around 15:00 UTC, with initial reports indicating an investigation into the issue. By 15:03 UTC, GitHub acknowledged degraded performance for Git Operations and continued their investigation. The incident was reported as resolved by 15:13 UTC. GitHub thanked users for their patience and understanding and promised to share a detailed root cause analysis soon. The affected component was identified as \"Git Operations\". The report also provides links for users to subscribe to notifications about GitHub status updates via email, text message, Slack, and webhooks. It also links to GitHub's support site and developer newsletter.\n",
    "chinese_title": "GitHub 部分中断",
    "chinese_summary": "2025年11月13日部分用户Git推送和拉取操作受影响，GitHub状态更新报告。事件于UTC时间15:00左右开始，初步报告显示正在调查问题。UTC时间15:03，GitHub确认Git操作性能下降并继续调查。事件于UTC时间15:13报告已解决。GitHub感谢用户的耐心和理解，并承诺尽快分享详细的根本原因分析。受影响的组件已确定为“Git操作”。该报告还提供链接，供用户通过电子邮件、短信、Slack和Webhook订阅有关GitHub状态更新的通知，并链接到GitHub的支持网站和开发者新闻通讯。"
  },
  {
    "id": "45916762",
    "title": "The Monks in the Casino",
    "url": "https://www.derekthompson.org/p/the-monks-in-the-casino",
    "summary": "Derek Thompson's \"The Monks in the Casino\" explores the growing trend of young men withdrawing from social engagement and gravitating towards solitary activities like pornography and online gambling, creating a modern form of asceticism. He uses the examples of \"Spishak,\" a pornosexual, and \"Kyle,\" a sports gambling addict, to illustrate this phenomenon.\n\nThompson argues that this isn't simply a \"loneliness crisis,\" but rather an \"absence-of-loneliness crisis\" where the allure of solitary, screen-based activities outweighs the desire for human connection. This is fueled by a culture that increasingly prizes solitude and an economy that caters to it.\n\nHe criticizes the shift toward \"casino capitalism,\" where the ease of online gambling and financial speculation, coupled with the difficulty of achieving traditional markers of success like homeownership, pushes young men toward risky, quick-win schemes. This is exacerbated by policy choices that favor digital spaces over physical community building.\n\nThe article contrasts this modern \"monk\" with the Protestant ethic described by Max Weber. Instead of being socially generous and financially prudent, these modern monks are risk-averse in the social sphere but risk-chasing in the financial one. Thompson concludes that society needs to re-evaluate its priorities, fostering community and real-world engagement instead of prioritizing easy access to online casinos.\n",
    "chinese_title": "The Monks in the Casino",
    "chinese_summary": "德里克·汤普森的《赌场里的僧侣》探讨了年轻男性逐渐退出社会交往、转向色情和网络赌博等孤独活动的趋势，形成了一种现代形式的禁欲主义。他以性瘾者“斯皮沙克”和沉迷体育博彩的“凯尔”为例，来说明这种现象。\n\n汤普森认为，这不仅仅是“孤独危机”，而是“缺乏孤独危机”，即孤独、基于屏幕的活动的诱惑超过了对人际关系的渴望。这得益于一种越来越重视孤独的文化和迎合它的经济。\n\n他批评了向“赌场资本主义”的转变，在这种转变中，在线赌博和金融投机的便利，加上难以实现传统成功标志（如拥有住房）的困难，将年轻男性推向了冒险、快速致富的计划。偏向数字空间而非实体社区建设的政策选择加剧了这种情况。\n\n文章将这种现代“僧侣”与马克斯·韦伯描述的新教伦理进行了对比。这些现代僧侣在社交领域规避风险，但在金融领域却追逐风险，而不是在社会上慷慨大方，在经济上谨慎。汤普森总结说，社会需要重新评估其优先事项，培养社区和现实世界的参与，而不是优先考虑轻松访问在线赌场。"
  },
  {
    "id": "45912698",
    "title": "Checkout.com hacked, refuses ransom payment, donates to security labs",
    "url": "https://www.checkout.com/blog/protecting-our-merchants-standing-up-to-extortion",
    "summary": "Checkout.com, a payment processing platform, was targeted by the \"ShinyHunters\" criminal group who claimed to have stolen data and demanded a ransom. The company confirmed unauthorized access to a legacy third-party cloud file storage system used in 2020 and prior, affecting less than 25% of their current merchant base. This system contained internal operational documents and merchant onboarding materials.\n\nCrucially, Checkout.com emphasizes that their live payment processing platform was *not* impacted, and merchant funds or card numbers were *not* accessed. The vulnerability stemmed from the improper decommissioning of this older system.\n\nCheckout.com is taking responsibility for the incident and has begun notifying affected merchants and working with law enforcement and regulators. They are refusing to pay the ransom. Instead, they are donating the equivalent amount to Carnegie Mellon University and the University of Oxford Cyber Security Center to support cybercrime research. The company reaffirms its commitment to security, transparency, and trust, and is offering assistance to its merchants.\n",
    "chinese_title": "Checkout.com遭黑客攻击，拒绝支付赎金，捐款给安全实验室",
    "chinese_summary": "支付处理平台Checkout.com遭受“ShinyHunters”犯罪团伙攻击，该团伙声称窃取了数据并勒索赎金。该公司已确认在2020年及之前使用的旧版第三方云文件存储系统遭到未经授权的访问，影响了不到25%的现有商户。该系统包含内部运营文件和商户入驻材料。\n\n关键是，Checkout.com强调其实时支付处理平台*未*受到影响，商户资金或卡号*未*被访问。漏洞源于该旧系统的错误停用。\n\nCheckout.com正在承担此次事件的责任，并已开始通知受影响的商户，并与执法部门和监管机构合作。他们拒绝支付赎金，而是将等额款项捐赠给卡内基梅隆大学和牛津大学网络安全中心，以支持网络犯罪研究。该公司重申其对安全、透明和信任的承诺，并为商户提供协助。"
  },
  {
    "id": "45914761",
    "title": "Blender Lab",
    "url": "https://www.blender.org/news/introducing-blender-lab/",
    "summary": "The Blender Foundation is launching **Blender Lab**, a dedicated innovation space to explore challenging and future-facing projects that keep Blender relevant. This initiative addresses the growing complexity of adding new features to Blender due to its maturity, technical debt, and emphasis on stability.\n\nBlender Lab allows designers, developers, and researchers to experiment and \"break things\" outside the normal release cycle. Lab projects are public and visible on blender.org/lab, detailing objectives, timelines, participants, and offering intermediate builds for testing and feedback.\n\nLab activities can be either:\n\n*   **Applied research:** Focuses on developing groundbreaking solutions based on current research.\n*   **Academic research:** Involves Blender developers advising on the implementation of technology from university and research center projects.\n\nInitial projects listed include explorations into touch/pen interfaces, VR/XR, volume rendering, and light transport. Future projects might involve USD Authoring and AI/ML integration.\n\nTo propose a project for the Lab, interested parties should contact the Blender Foundation with a detailed public proposal. Project adoption depends on factors like funding, relevance to Blender's mission, and applicant experience.\n\nTon Roosendaal has advocated for this project since 2018. It's enabled through growing community and corporate support and will require continued funding through the Blender Development Fund.\n",
    "chinese_title": "Blender实验室",
    "chinese_summary": "Blender基金会推出Blender实验室，致力于探索具有挑战性的前瞻性项目，以保持Blender的活力。此举旨在解决Blender因其成熟度、技术债务和对稳定性的重视而导致添加新功能日益复杂的问题。\n\nBlender实验室允许设计师、开发者和研究人员在正常的发布周期之外进行实验和“破坏”。实验室项目是公开的，并在blender.org/lab上可见，详细说明目标、时间表、参与者，并提供中间版本以供测试和反馈。\n\n实验室活动可以是：\n\n*   **应用研究：** 侧重于基于当前研究开发突破性解决方案。\n*   **学术研究：** 涉及Blender开发者为大学和研究中心项目的技术实施提供建议。\n\n初始项目包括对触摸/笔界面、VR/XR、体积渲染和光传输的探索。未来的项目可能涉及USD编写和AI/ML集成。\n\n要为实验室提议项目，感兴趣的各方应向Blender基金会提交详细的公开提案。项目的采纳取决于资金、与Blender使命的相关性以及申请人的经验等因素。\n\nTon Roosendaal自2018年以来一直倡导这个项目。它得益于不断增长的社区和企业支持，并将需要通过Blender开发基金持续资助。"
  },
  {
    "id": "45917282",
    "title": "BAML is hiring compilers/rust engineers (YC W23)",
    "url": "https://github.com/BoundaryML/baml/tree/canary/jobs",
    "summary": "BAML (BoundaryML), a company that participated in the Y Combinator W23 batch, is hiring compilers and Rust engineers. The project, titled \"baml\" on GitHub, is public and has garnered significant attention, evidenced by 6.7k stars and 325 forks. This suggests the project is actively developed and has a growing community. The job posting is specifically targeting engineers skilled in compilers and Rust, indicating those skills are central to the company's work.\n",
    "chinese_title": "BAML招聘编译器/Rust工程师 (YC W23)",
    "chinese_summary": "参与Y Combinator W23批次的BAML (BoundaryML) 公司正在招聘编译器和Rust工程师。该项目在GitHub上名为“baml”，已公开并引起广泛关注，拥有6.7k星和325个fork，表明该项目正在积极开发且拥有不断增长的社区。该职位招聘尤其针对具备编译器和Rust技能的工程师，表明这些技能是公司工作的核心。"
  },
  {
    "id": "45908938",
    "title": "Android developer verification: Early access starts",
    "url": "https://android-developers.googleblog.com/2025/11/android-developer-verification-early.html",
    "summary": "This Android Developers Blog post announces the early access launch of the new Android developer verification requirements, designed to enhance user safety by combating scams and malware. The verification aims to make it harder for malicious actors to distribute harmful apps by requiring them to use a real identity.\n\nThe announcement addresses concerns raised by the developer community, particularly students, hobbyists, and power users. Google is introducing a dedicated account type for students and hobbyists, allowing them to distribute apps to a limited number of devices without full verification. For power users who understand the risks, Google is developing an \"advanced flow\" that allows them to install unverified apps with clear warnings and safeguards against coercion.\n\nThe post highlights the importance of verification in preventing scams, especially in rapidly digitizing regions, citing an example of scammers using social engineering to trick users into sideloading malware. Verification is seen as a way to change the \"whack-a-mole\" dynamic of constantly battling bad apps by forcing attackers to operate with accountable identities.\n\nEarly access is now available for developers distributing apps outside of Google Play, with Play developers soon to follow. Google encourages developers to provide feedback on streamlining the verification experience. Resources including a video walkthrough and FAQs are provided.\n",
    "chinese_title": "Android开发者验证：抢先体验开始",
    "chinese_summary": "此Android开发者博客宣布启动新的Android开发者验证要求的早期访问计划，旨在通过打击诈骗和恶意软件来增强用户安全性。该验证旨在要求恶意行为者使用真实身份，从而使他们更难分发有害应用程序。\n\n该公告回应了开发者社区（尤其是学生、爱好者和高级用户）提出的担忧。Google正在为学生和爱好者推出专门的帐户类型，允许他们在未经完全验证的情况下将应用程序分发到有限数量的设备。对于了解风险的高级用户，Google正在开发一种“高级流程”，允许他们在明确的警告和防止胁迫的措施下安装未经验证的应用程序。\n\n该帖子强调了验证在防止诈骗中的重要性，尤其是在快速数字化的地区，并举例说明了诈骗者使用社会工程学来诱骗用户侧载恶意软件。验证被视为一种通过迫使攻击者使用可追溯的身份来运作，从而改变不断打击恶意应用程序的“打地鼠”动态的方式。\n\n目前，向Google Play之外分发应用程序的开发者可以使用早期访问计划，Play开发者很快也会跟进。Google鼓励开发者提供关于简化验证体验的反馈。相关资源包括视频演示和常见问题解答。"
  },
  {
    "id": "45916037",
    "title": "SIMA 2: An Agent That Plays, Reasons, and Learns with You in Virtual 3D Worlds",
    "url": "https://deepmind.google/blog/sima-2-an-agent-that-plays-reasons-and-learns-with-you-in-virtual-3d-worlds/",
    "summary": "This announcement from Google DeepMind in August 2025 introduces SIMA 2, a groundbreaking agent designed to interact with users and learn in virtual 3D environments. The core concept is that SIMA 2 can play, reason, and learn *with* a human user in these simulated worlds.\n\nThe announcement also mentions Genie 3, which appears to be a crucial component enabling SIMA 2's capabilities. Genie 3 is described as a \"general purpose world model\" capable of generating a wide variety of interactive environments. This suggests that SIMA 2 leverages Genie 3 to experience diverse scenarios and learn effectively.\n\nIn essence, the article highlights the development of an advanced AI agent (SIMA 2) that can operate collaboratively with humans in a variety of 3D virtual environments, enabled by a powerful world model (Genie 3). This opens the door to collaborative problem-solving, training, and exploration within these virtual spaces.\n",
    "chinese_title": "SIMA 2：一个能在虚拟3D世界中与你一起玩耍、推理和学习的智能体",
    "chinese_summary": "谷歌DeepMind于2025年8月发布公告，推出SIMA 2，这是一种突破性智能体，旨在与用户互动并在虚拟3D环境中学习。其核心概念是SIMA 2可以在这些模拟世界中与人类用户一起玩耍、推理和学习。\n\n公告还提到了Genie 3，它似乎是实现SIMA 2功能的一个关键组成部分。Genie 3被描述为一种“通用世界模型”，能够生成各种各样的交互式环境。这表明SIMA 2利用Genie 3来体验各种场景并有效地学习。\n\n本质上，这篇文章强调了一种先进AI智能体（SIMA 2）的开发，该智能体能够在各种3D虚拟环境中与人类协作，并由强大的世界模型（Genie 3）提供支持。这为在这些虚拟空间内进行协作问题解决、培训和探索打开了大门。"
  },
  {
    "id": "45915114",
    "title": "Kratos - Cloud native Auth0 open-source alternative (self-hosted)",
    "url": "https://github.com/ory/kratos",
    "summary": "Ory Kratos is an open-source, API-first identity and user management system designed for cloud-native applications. It offers a self-hosted alternative to Auth0 and similar services, centralizing key workflows like login, registration, account recovery, verification, and profile management, thereby removing identity logic from application code.\n\nKey features include self-service login/registration, MFA, profile management, identity schemas, and admin APIs. Ory Kratos is designed to scale, integrate with other Ory tools (Hydra, Oathkeeper, Keto), and fit into Kubernetes environments.\n\nYou can deploy Ory Kratos either as a managed service on the Ory Network or self-hosted. The Ory Network provides a fully managed solution with features like passkey support, prebuilt UI components, OAuth2/OIDC, and GDPR-friendly storage. Self-hosting offers full control but requires managing infrastructure. For business-critical systems, an Ory Enterprise License (OEL) offers additional features (SCIM, SAML, CAPTCHAs), security releases with SLAs, premium support, and access to a private Docker registry.\n\nThe document provides instructions for a quickstart using the Ory CLI to create a new project and highlights companies using Ory Kratos.\n",
    "chinese_title": "Kratos - 云原生 Auth0 开源替代方案（自托管）",
    "chinese_summary": "Ory Kratos：面向云原生应用设计的开源、API优先的身份和用户管理系统。它提供了一个可自托管的Auth0及类似服务的替代方案，集中管理登录、注册、账户恢复、验证和个人资料管理等关键工作流程，从而将身份验证逻辑从应用程序代码中移除。\n\n主要功能包括自助服务登录/注册、MFA、个人资料管理、身份验证模式和管理API。Ory Kratos旨在扩展、与其他Ory工具（Hydra、Oathkeeper、Keto）集成，并适应Kubernetes环境。\n\n您可以将Ory Kratos部署为Ory Network上的托管服务，或选择自托管。Ory Network提供完全托管的解决方案，具有诸如密钥支持、预构建的UI组件、OAuth2/OIDC和符合GDPR的存储等功能。自托管提供完全控制权，但需要管理基础设施。对于业务关键型系统，Ory Enterprise License (OEL) 提供额外功能（SCIM、SAML、CAPTCHA），带有 SLA 的安全版本、高级支持以及对私有 Docker 注册表的访问。\n\n本文档提供了使用 Ory CLI 创建新项目的快速入门指南，并重点介绍了使用 Ory Kratos 的公司。"
  },
  {
    "id": "45915069",
    "title": "Denx (a.k.a. U-Boot) Retires",
    "url": "https://www.denx.de/",
    "summary": "After 20 successful years, the privately-held company DENX, a pioneer in Open Source and Embedded Linux, is winding down operations and entering voluntary liquidation, with the decision announced in July 2025. DENX is known for its widely used U-Boot bootloader, which runs on millions of devices globally and will continue to be maintained by a large community of contributors.\n\nThe decision to retire comes from the DENX holders after two decades in the embedded world. They express gratitude to all customers and contributors who supported the company's success.\n\nWhile DENX is ceasing operations, its legacy of expertise will continue through a new company called NABLA. Former DENX engineers have formed NABLA to provide high-level support and consulting in Open Source, U-Boot, Embedded Linux, and Security, ensuring the same quality and expertise previously offered by DENX. Thus, customers seeking continued support can find it through NABLA.\n",
    "chinese_title": "Denx（又名U-Boot）退役",
    "chinese_summary": "在成功运营二十年后，开源和嵌入式 Linux 领域的先驱、私营公司 DENX 将于 2025 年 7 月宣布停止运营并进入自愿清算。DENX 以其广泛使用的 U-Boot 引导加载程序而闻名，该程序在全球数百万台设备上运行，并将继续由庞大的贡献者社区维护。\n\n退出运营的决定来自 DENX 持有人，他们在嵌入式领域深耕二十年。他们对所有支持公司成功的客户和贡献者表示感谢。\n\n虽然 DENX 停止运营，但其专业知识的遗产将通过一家名为 NABLA 的新公司继续传承。前 DENX 工程师成立了 NABLA，以提供开源、U-Boot、嵌入式 Linux 和安全方面的高级支持和咨询，确保与 DENX 之前提供的相同质量和专业知识。因此，寻求持续支持的客户可以通过 NABLA 获得支持。"
  },
  {
    "id": "45915884",
    "title": "We cut our Mongo DB costs by 90% by moving to Hetzner",
    "url": "https://prosopo.io/blog/we-cut-our-mongodb-costs-by-90-percent/",
    "summary": "Prosopo significantly reduced their MongoDB costs by 90% by migrating from MongoDB Atlas on AWS to a self-hosted solution on Hetzner. Initially, Atlas was convenient for rapid scaling, but the cost escalated to over $3,000 per month due to data transfer fees (particularly those incurred by traffic over the internet), which became significant due to their multi-cloud architecture designed for resilience. They also lacked support at that price point.\n\nHetzner offered predictable, flat-rate pricing and no data transfer fees, making it a cost-effective alternative. Prosopo opted for a powerful dedicated server with ample RAM and fast SSDs for their workload, costing $160 per month.\n\nThe migration involved taking a `mongodump`, restoring it to the new Hetzner server, and syncing changes. The server setup includes Proxmox, an Ubuntu VM, Docker for MongoDB, and Traefik as a reverse proxy.\n\nThe switch required them to handle security, backups (using `mongodump`, cron, and Hetzner storage boxes), and monitoring (using OpenObserve). They now have direct control over connection management within the MongoDB shell, which was previously limited in Atlas.\n\nWhile acknowledging the increased responsibility, Prosopo highlights the improved performance due to the server's high specifications and the value gained from controlling their infrastructure. They also point out that this DIY approach may not be suitable for everyone, especially as they continue to scale.\n",
    "chinese_title": "通过迁移到Hetzner，我们的MongoDB成本降低了90%。",
    "chinese_summary": "Prosopo 通过从 AWS 上的 MongoDB Atlas 迁移到 Hetzner 上的自托管解决方案，显著降低了 90% 的 MongoDB 成本。最初，Atlas 便于快速扩展，但由于数据传输费用（特别是互联网流量产生的费用），成本飙升至每月超过 3,000 美元，这在他们为实现弹性而设计的多云架构中变得尤为重要。而且，这个价格并没有得到相应的支持。\n\nHetzner 提供可预测的、固定费率的定价，且没有数据传输费用，使其成为一种经济高效的替代方案。Prosopo 选择了一台拥有充足 RAM 和快速 SSD 的强大专用服务器来处理他们的工作负载，每月成本为 160 美元。\n\n迁移过程包括获取一个 `mongodump`，将其恢复到新的 Hetzner 服务器，并同步更改。服务器设置包括 Proxmox、一个 Ubuntu VM、用于 MongoDB 的 Docker 和作为反向代理的 Traefik。\n\n这次切换需要他们处理安全、备份（使用 `mongodump`、cron 和 Hetzner 存储盒）和监控（使用 OpenObserve）。他们现在可以直接控制 MongoDB shell 中的连接管理，这在 Atlas 中以前是受限的。\n\n虽然 Prosopo 承认责任增加，但他们强调了由于服务器的高规格而带来的性能提升，以及从控制其基础设施中获得的价值。他们还指出，这种 DIY 方法可能不适合所有人，尤其是在他们继续扩展的情况下。"
  },
  {
    "id": "45916146",
    "title": "Tesla Is Recalling Cybertrucks Again. Yep, More Pieces Are Falling Off",
    "url": "https://www.popularmechanics.com/cars/hybrid-electric/a69384091/cybertruck-lightbar-recall/",
    "summary": "Tesla is recalling just over 6,000 Cybertrucks due to a potential issue with the optional off-road light bar detaching. The recall, affecting about 10% of Cybertrucks on the road, stems from the incorrect primer used when gluing the light bar to the windshield, potentially causing it to detach and become a projectile.\n\nThe fix involves Tesla service inspecting the light bar and installing an additional mechanical attachment. In some cases, they will replace the light bar, using tape to adhere it to the windshield alongside a mechanical attachment.\n\nThe NHTSA expects owner notification letters to be mailed by December 26, 2025, but the timeline for owners to get their vehicles serviced remains unclear, potentially taking months based on previous recall experiences. The article highlights that while the Cybertruck is marketed as an off-roader, the light bar, glued to the windshield with potentially faulty primer, can detach and pose a safety risk. The article also briefly explains the typical use of primer in bonding processes, contrasting it with the apparent issue in the Cybertruck's light bar installation.\n",
    "chinese_title": "特斯拉再次召回Cybertruck，没错，又有部件脱落了",
    "chinese_summary": "特斯拉因越野灯条可能脱落而召回 6000 多辆赛博卡车。此次召回影响了大约 10% 的已上路赛博卡车，原因是将灯条粘合到挡风玻璃时使用了错误的底漆，可能导致其脱落并成为抛射物。\n\n维修方案包括特斯拉服务部门检查灯条并安装额外的机械连接装置。在某些情况下，他们将更换灯条，使用胶带将其粘合到挡风玻璃上，并配以机械连接装置。\n\n美国国家公路交通安全管理局预计车主通知信将于 2025 年 12 月 26 日之前寄出，但车主车辆维修的时间表仍不清楚，根据之前的召回经验，可能需要数月时间。文章强调，虽然赛博卡车被宣传为越野车，但用可能存在缺陷的底漆粘合在挡风玻璃上的灯条可能会脱落，从而构成安全风险。文章还简要解释了底漆在粘合过程中的典型用途，并将其与赛博卡车灯条安装中明显存在的问题进行了对比。"
  },
  {
    "id": "45914815",
    "title": "Heartbeats in Distributed Systems",
    "url": "https://arpitbhayani.me/blogs/heartbeats-in-distributed-systems/",
    "summary": "Heartbeats are crucial in distributed systems for monitoring node health, ensuring system reliability, and enabling timely failure detection. A heartbeat is a periodic signal sent from one component to another, indicating the sender's liveness. The receiver monitors these signals and declares a node as failed if heartbeats are missed beyond a defined timeout.\n\nKey components of heartbeat systems include the sender, the receiver/monitor, the heartbeat interval (frequency of messages), and the timeout (duration of allowed missed heartbeats). Choosing appropriate intervals and timeouts is essential; short intervals increase overhead but allow faster detection, while longer intervals reduce overhead but delay detection. Timeouts must account for network latency to avoid false positives.\n\nHeartbeat models can be push-based (nodes actively send heartbeats) or pull-based (monitors actively query nodes). Hybrid approaches combining both are common for increased reliability.\n\nFailure detection algorithms range from simple fixed timeouts to more sophisticated methods like the phi accrual failure detector, which uses statistical analysis to determine a suspicion level instead of a binary alive/dead status.\n\nGossip protocols offer a decentralized approach to heartbeat monitoring. Each node exchanges health information with a random subset of peers, distributing the responsibility and improving scalability and resilience compared to centralized monitoring.\n",
    "chinese_title": "分布式系统中的心跳",
    "chinese_summary": "心跳机制在分布式系统中至关重要，用于监控节点健康状况，确保系统可靠性，并实现及时故障检测。心跳是从一个组件发送到另一个组件的周期性信号，表明发送方的活跃状态。接收方监控这些信号，如果在定义的超时时间内未收到心跳，则将节点声明为已失效。\n\n心跳系统的关键组件包括发送方、接收方/监控器、心跳间隔（消息频率）和超时时间（允许丢失的心跳持续时间）。选择合适的间隔和超时时间至关重要；较短的间隔会增加开销，但可以更快地检测到故障，而较长的间隔会减少开销，但会延迟检测。超时时间必须考虑网络延迟，以避免误报。\n\n心跳模型可以是推模式（节点主动发送心跳）或拉模式（监控器主动查询节点）。结合两者的混合方法很常见，可以提高可靠性。\n\n故障检测算法的范围从简单的固定超时到更复杂的方法，例如 phi 累积故障检测器，它使用统计分析来确定怀疑级别，而不是二元的存活/死亡状态。\n\nGossip 协议提供了一种去中心化的心跳监控方法。每个节点与随机的对等节点子集交换健康信息，与集中式监控相比，这分散了责任，并提高了可扩展性和弹性。"
  },
  {
    "id": "45915210",
    "title": "Pebble: How to Build a Smartwatch: Software – Setting Expectations and Roadmap",
    "url": "https://ericmigi.com/blog/how-to-build-a-smartwatch-software-setting-expectations-and-roadmap/",
    "summary": "This blog post from Pebble outlines the software strategy and roadmap for the new Pebble smartwatches, particularly the Pebble 2 Duo (P2D) and upcoming Pebble Time 2. The post acknowledges shipping delays for the P2D due to production challenges, but emphasizes that software development is the real focus now.\n\nGiven a small team of 5 compared to the original Pebble's 180, the company prioritizes sustainability, aiming to maintain profitability to support future watch sales, software development, and support. The approach involves setting expectations realistically: core features should work well, but customization may have \"rough edges.\" They are focused on essential features and avoiding unnecessary complexity.\n\nThe near-term roadmap includes: PebbleOS readiness for Pebble Time 2, increasing P2D battery life, language pack integration, quality of life improvements, PebbleKit Android support, customizable watch settings from the mobile app, notification enhancements (custom vibrations, message history, filtering), improved Developer SDK (including JavaScript support), a voice assistant, and a watchface generator. They encourage community contributions to the open-source PebbleOS.\n\nThe author discusses the four main software components of a smartwatch (OS, companion app, SDK, cloud services) and highlights the challenges of embedded software development. He praises the original Pebble's software, including the SDK which enabled many people to start coding. He also details the development of the Pebble's new open-source mobile app library, libpebble3 and mentions the addition of local speech-to-text model.\n",
    "chinese_title": "Pebble：如何打造智能手表：软件 – 设定期望和路线图",
    "chinese_summary": "Pebble新智能手表软件战略与路线图\n\n这篇来自Pebble的博客文章概述了新款Pebble智能手表，特别是Pebble 2 Duo (P2D)和即将推出的Pebble Time 2的软件战略和路线图。该文章承认由于生产方面的挑战导致P2D发货延迟，但强调现在的真正重点是软件开发。\n\n鉴于目前只有5人的小团队，相比最初Pebble的180人团队，该公司优先考虑可持续性，旨在保持盈利能力，以支持未来的手表销售、软件开发和支持。该方法包括设定现实的期望：核心功能应该运行良好，但定制可能会有“粗糙之处”。他们专注于基本功能，避免不必要的复杂性。\n\n近期路线图包括：PebbleOS为Pebble Time 2做好准备，增加P2D电池续航，语言包集成，生活质量改进，PebbleKit Android支持，从移动应用自定义手表设置，通知增强（自定义震动，消息历史记录，过滤），改进的开发者SDK（包括JavaScript支持），语音助手和表盘生成器。他们鼓励社区为开源PebbleOS做出贡献。\n\n作者讨论了智能手表的四个主要软件组成部分（操作系统，配套应用，SDK，云服务），并强调了嵌入式软件开发的挑战。他赞扬了最初Pebble的软件，包括使许多人开始编码的SDK。他还详细介绍了Pebble新的开源移动应用库libpebble3的开发，并提到了本地语音转文本模型的添加。"
  },
  {
    "id": "45914718",
    "title": "Britain's railway privatization was an abject failure",
    "url": "https://www.rosalux.de/en/news/id/53917/britains-railway-privatization-was-an-abject-failure",
    "summary": "Gareth Dennis argues that the privatization of Britain's railways has been a failure. He outlines the Thatcher government's motivations for privatization, including reducing public debt and increasing shareholding, but highlights the lack of focus on service quality or expansion.\n\nThe privatization process, beginning in the late 1980s, fragmented the rail system, creating Railtrack (infrastructure), freight operating companies, train operating companies, and rolling stock operating companies (ROSCOs). The ROSCOs, in particular, profited by leasing trains back to operators at high costs, incentivizing shorter trains and overcrowding. This also led to the decline of the UK train manufacturing industry.\n\nThe fragmented system contributed to several fatal train crashes in the late 1990s and early 2000s, prompting the de facto renationalization of infrastructure through Network Rail. The West Coast Main Line upgrade became a costly debacle. Despite rising passenger numbers, franchise agreements became overly complex, leading to financial failures and the collapse of franchises like East Coast. Cost-cutting measures resulted in disruptive strikes and a decade-long skills gap, hindering infrastructure projects.\n\nThe COVID-19 pandemic effectively ended the franchise system, with the government taking control of train operations. The Williams-Shapps Plan for Rail proposed Great British Railways (GBR), but its future remains unclear. Despite public support for publicly owned railways, the article concludes that democratization of the rail industry, ensuring local decision-making, is crucial for its reinvigoration. The author expresses concern about the lack of progress and the current state of squeezed capacity and declining major projects.\n",
    "chinese_title": "英国铁路私有化是一场彻底的失败。",
    "chinese_summary": "加雷斯·丹尼斯认为英国铁路私有化是一场失败。他概述了撒切尔政府私有化的动机，包括减少公共债务和增加股东，但强调缺乏对服务质量或扩张的关注。\n\n始于20世纪80年代末的私有化进程使铁路系统碎片化，产生了铁路轨道公司（基础设施）、货运公司、客运公司和车辆租赁公司（ROSCO）。尤其是车辆租赁公司，通过以高成本将列车租回给运营商而获利，从而鼓励了更短的列车和拥挤。这也导致了英国列车制造业的衰落。\n\n这种碎片化的系统导致了20世纪90年代末和21世纪初的几起致命的火车相撞事故，促使通过英国铁路网公司对基础设施进行事实上的国有化。西海岸干线升级成为一场代价高昂的惨败。尽管客运量不断上升，特许经营协议变得过于复杂，导致财务失败和东海岸等特许经营权的崩溃。削减成本的措施导致了破坏性的罢工和长达十年的技能差距，阻碍了基础设施项目。\n\n新冠疫情实际上结束了特许经营体系，政府接管了列车运营。威廉姆斯-夏普斯铁路计划提出了英国铁路公司（GBR），但其未来仍不明朗。尽管公众支持公有铁路，但文章总结认为，铁路行业的民主化，确保地方决策，对其复兴至关重要。作者对缺乏进展以及目前运力紧张和重大项目减少的现状表示担忧。"
  },
  {
    "id": "45790530",
    "title": "The Useful Personal Computer",
    "url": "https://technicshistory.com/2025/11/02/the-useful-personal-computer/",
    "summary": "This article explores the evolution of the personal computer from a hobbyist toy to a potentially useful tool for everyday life. In the late 1970s, manufacturers grappled with defining the personal computer's purpose and target audience. Early marketing efforts focused on domestic tasks like budgeting and recipe management, but these proved insufficient to drive widespread adoption.\n\nThe market diversified with the emergence of third-party software developers. These developers created popular software in two categories: business applications and games. This led to the development of two distinct computer types: high-end business machines and inexpensive game-oriented computers.\n\nA key factor in the personal computer's success was the availability of pre-written application software. Early adopters needed software to do something practical with their computers. The most important application to emerge was word processing. Michael Shrayer's Electric Pencil, the first microcomputer word processor, addressed the need for document creation and formatting, even with its limitations. It became a notable success, but its creator's lack of focus paved the way for competitors like Commodore Word Processor and EasyWriter, created by John Draper (Captain Crunch). WordStar was another example of an early word processor that targeted business users. These programs made tasks like editing, reordering, and correcting text significantly easier than on a typewriter.\n",
    "chinese_title": "有用的个人电脑",
    "chinese_summary": "本文探讨了个人电脑从业余爱好者的玩具到可能用于日常生活的实用工具的演变过程。在 20 世纪 70 年代后期，制造商们都在努力确定个人电脑的用途和目标受众。早期的营销工作侧重于家庭任务，如预算和食谱管理，但事实证明，这些不足以推动广泛应用。\n\n随着第三方软件开发商的出现，市场变得多样化。这些开发商创建了两种受欢迎的软件：商业应用程序和游戏。这导致了两种不同类型的计算机的开发：高端商务机和廉价的面向游戏的计算机。\n\n预先编写的应用程序软件的可用性是个人电脑成功的关键因素。早期采用者需要软件来用他们的电脑做一些实际的事情。出现的最重要的应用程序是文字处理。迈克尔·施雷尔的 Electric Pencil，第一个微型计算机文字处理器，解决了文档创建和格式化的需求，即使它存在局限性。它取得了显著的成功，但其创建者的缺乏专注为竞争对手铺平了道路，例如 Commodore Word Processor 和 John Draper（Captain Crunch）创建的 EasyWriter。WordStar 是另一个早期文字处理器的例子，它针对的是商业用户。这些程序使得编辑、重新排序和更正文本等任务比在打字机上容易得多。"
  },
  {
    "id": "45916044",
    "title": "European Nations Decide Against Acquiring Boeing E-7 Awacs Aircraft",
    "url": "https://defensemirror.com/news/40527/European_Nations_Decide_Against_Acquiring_Boeing_E_7_AWACS_Aircraft",
    "summary": "European Nations Decide Against Acquiring Boeing E-7 Awacs Aircraft\n\nSummary:\n\nSeveral European nations, including those looking to replace their aging NATO AWACS fleet, have reportedly decided against acquiring the Boeing E-7 Wedgetail AEW&C aircraft. The decision stems primarily from interoperability concerns, specifically the desire to maintain seamless data integration and communication with existing and planned European-developed systems. This interoperability is deemed critical for effective joint operations within the European theater.\n\nWhile the E-7 offers advanced capabilities, the article implies that European nations prioritize systems that natively integrate with existing and future European defense networks. The article doesn't specify which exact nations made this decision, but suggests that the collective decision-making impacts the potential for the E-7 to become the standardized replacement for the NATO AWACS fleet. The report suggests that these nations may be exploring alternative AEW&C solutions, potentially of European origin, that offer better interoperability and integration within the European defense framework. The decision reflects a strategic preference for strengthening European defense autonomy and avoiding dependence on non-European systems for critical capabilities.\n",
    "chinese_title": "欧洲国家决定不采购波音E-7预警机",
    "chinese_summary": "欧洲国家决定不采购波音E-7预警机\n\n概要：\n\n据报道，包括寻求替换其老旧北约预警机部队的若干欧洲国家已决定不采购波音E-7“楔尾”预警机。此决定主要源于互操作性方面的担忧，特别是希望与现有和计划中的欧洲开发系统保持无缝数据集成和通信。这种互操作性被认为对于在欧洲战区内进行有效的联合行动至关重要。\n\n虽然E-7提供了先进的功能，但该文章暗示欧洲国家优先考虑与现有和未来欧洲国防网络原生集成的系统。该文章未明确指出哪些国家做出了这一决定，但表明集体决策影响了E-7成为北约预警机部队标准化替代品的潜力。该报告表明，这些国家可能正在探索替代的预警机解决方案，可能源于欧洲，这些解决方案可在欧洲国防框架内提供更好的互操作性和集成。该决定反映了加强欧洲国防自主权，避免关键能力依赖非欧洲系统的战略偏好。"
  },
  {
    "id": "45909059",
    "title": "Human Fovea Detector",
    "url": "https://www.shadertoy.com/view/4dsXzM",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "人眼中央凹检测器",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "45810516",
    "title": "A Challenge to Roboticists: My Humanoid Olympics",
    "url": "https://spectrum.ieee.org/humanoid-robot-olympics",
    "summary": "Benjie Holson, VP of Engineering at Robust AI, proposes a \"Humanoid Olympics\" to challenge roboticists to create robots capable of performing everyday household tasks. He highlights that despite advancements in robotics and AI, robots still struggle with seemingly simple tasks like opening doors, doing laundry, and making a peanut butter sandwich.\n\nHolson believes a competition focused on these seemingly mundane activities would spur innovation and demonstrate the true capabilities of humanoid robots. The article implies that winning the \"gold medal\" in this Olympics would signify a significant leap forward in the development of robots truly useful in real-world, unstructured environments like homes. The central challenge revolves around building robots that can reliably and adaptively perform tasks that humans take for granted, suggesting a gap between theoretical robotics and practical application. The competition, therefore, is envisioned as a practical test of robots' dexterity, perception, and ability to adapt to unpredictable situations.\n",
    "chinese_title": "机器人学家的挑战：我的类人机器人奥运会",
    "chinese_summary": "Robust AI 工程副总裁 Benjie Holson 提议举办“人形机器人奥运会”，旨在挑战机器人专家们创造能够执行日常家务的机器人。他强调，尽管机器人技术和人工智能取得了进步，但机器人仍然难以完成看似简单的任务，例如开门、洗衣服和制作花生酱三明治。\n\nHolson 认为，专注于这些看似平凡的活动的比赛将激发创新，并展示人形机器人的真正能力。文章暗示，赢得这场奥运会的“金牌”将标志着在开发真正有用于现实世界、非结构化环境（如家庭）的机器人方面向前迈出了一大步。核心挑战围绕着制造能够可靠且适应性地执行人类认为理所当然的任务的机器人，这表明理论机器人技术与实际应用之间存在差距。因此，该竞赛被设想为对机器人灵活性、感知能力和适应不可预测情况的能力的实际测试。"
  },
  {
    "id": "45910381",
    "title": "Android 16 QPR1 is being pushed to the Android Open Source Project",
    "url": "https://grapheneos.social/@GrapheneOS/115533432439509433",
    "summary": "GrapheneOS announced on Mastodon that Android 16 QPR1 (Quarterly Platform Release 1) is being pushed to the Android Open Source Project (AOSP). This means that the source code for this updated version of Android is now publicly available for developers and manufacturers to integrate into their own Android distributions and devices. The message also implies a delay, indicated by the word \"finally,\" suggesting that the release to AOSP may have been anticipated for some time. The Mastodon post further notes that using the web version of Mastodon requires JavaScript and suggests users consider dedicated apps for their platform instead.\n",
    "chinese_title": "Android 16 QPR1 正在推送至 Android 开放源代码项目。",
    "chinese_summary": "GrapheneOS在Mastodon上宣布Android 16 QPR1（季度平台版本1）正在推送至Android开源项目(AOSP)。这意味着这个更新后的Android版本的源代码现在可供开发者和制造商公开获取，以便集成到他们自己的Android发行版和设备中。这条消息也暗示了一个延迟，由“终于”一词表明，暗示着向AOSP的发布可能已经被期待了很长时间。Mastodon帖子还指出，使用Mastodon的网页版需要JavaScript，并建议用户考虑使用适用于其平台的专用应用程序。"
  },
  {
    "id": "45903404",
    "title": "Steam Machine",
    "url": "https://store.steampowered.com/sale/steammachine",
    "summary": "This text represents the interface of a Steam Machine, likely a webpage or application menu. It's broken down into several key areas:\n\n*   **Navigation/Top Bar:** Contains links to core Steam functions like the store, exploration queue, wishlist, points shop, news, statistics, community, and Steam's main page.\n\n*   **Community Section:** Offers avenues for user interaction including discussions, workshops, a marketplace, and live streams.\n\n*   **About/Help Section:** Includes information \"About\" Steam and a \"Customer Support\" link.\n\n*   **Account & Installation:** Provides options to install Steam and log in.\n\n*   **Language Options:** Displays a comprehensive list of available languages for the interface, ranging from Traditional Chinese to Ukrainian. Includes an option to \"Report Translation Issues.\"\n\nIn essence, it's a portal to access various Steam services, community features, and account management tools, with a strong emphasis on language localization.\n",
    "chinese_title": "Steam Machine\n蒸汽机",
    "chinese_summary": "此文本代表Steam Machine的界面，可能是一个网页或应用程序菜单。它主要分为以下几个关键区域：\n\n*   **导航/顶部栏：** 包含指向核心Steam功能的链接，如商店、探索队列、愿望单、点数商店、新闻、统计、社区以及Steam主页。\n\n*   **社区版块：** 提供用户互动渠道，包括讨论、创意工坊、市场和直播。\n\n*   **关于/帮助版块：** 包括关于Steam的“关于”信息和一个“客服支持”链接。\n\n*   **账号 & 安装：** 提供安装Steam和登录的选项。\n\n*   **语言选项：** 显示界面可用的全面语言列表，从繁体中文到乌克兰语。包含一个“报告翻译问题”的选项。\n\n本质上，它是一个访问各种Steam服务、社区功能和帐户管理工具的入口，并特别强调语言本地化。"
  },
  {
    "id": "45916152",
    "title": "Hemp Ban Hidden Inside Government Shutdown Bill",
    "url": "https://hightimes.com/news/politics/hemp-ban-hidden-inside-government-shutdown-bill/",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "政府关门法案中暗藏大麻禁令",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "45911704",
    "title": "Reverse Engineering Yaesu FT-70D Firmware Encryption",
    "url": "https://landaire.net/reversing-yaesu-firmware-encryption/",
    "summary": "This article details the reverse engineering process used to decrypt firmware for the Yaesu FT-70D ham radio. The author started by examining the official Yaesu firmware update utility, finding an encrypted binary resource that likely contained the firmware.\n\nThey then disassembled the update utility using IDA Pro, tracing the loading and processing of the encrypted resource. By using a debugger (WinDbg with Time Travel Debugging), the author identified a function, `decrypt_data`, responsible for decrypting the firmware. This function inflates each byte of input data into its bit representation within a 64-byte scratch buffer. Afterwards, it calls `sub_407980`, a function doing complex table lookups and bitwise operations (XOR with pre-defined arrays, access into lookup tables using inflated byte values as indices) on the inflated data. Finally, the function deflates the data back into bytes, placing the result into an output buffer.\n\nThe author investigated the bit manipulation and lookup table process in `sub_407980`, ultimately revealing the encryption algorithm. By understanding this algorithm, the author successfully decrypted the firmware and could then analyze the plaintext firmware. The article provides a detailed, step-by-step explanation, making it accessible to readers with varying levels of reverse engineering expertise.\n",
    "chinese_title": "Yaesu FT-70D 固件加密逆向工程",
    "chinese_summary": "本文详细介绍了用于解密Yaesu FT-70D业余无线电固件的逆向工程过程。作者首先检查了Yaesu官方固件更新工具，发现了一个可能包含固件的加密二进制资源。\n\n随后，他们使用IDA Pro反汇编了该更新工具，追踪了加密资源的加载和处理过程。通过使用调试器（使用时间旅行调试的WinDbg），作者识别出一个名为`decrypt_data`的函数，该函数负责解密固件。此函数将每个输入数据字节扩展成其在64字节暂存缓冲区中的位表示。然后，它调用`sub_407980`，该函数对扩展后的数据执行复杂的表格查找和位运算（与预定义数组进行XOR运算，使用扩展后的字节值作为索引访问查找表）。最后，该函数将数据缩减回字节，并将结果放入输出缓冲区。\n\n作者调查了`sub_407980`中的位操作和查找表过程，最终揭示了加密算法。通过理解该算法，作者成功解密了固件，然后可以分析明文固件。本文提供了详细的、逐步的解释，使具有不同逆向工程专业知识水平的读者都能理解。"
  },
  {
    "id": "45907259",
    "title": "Homebrew no longer allows bypassing Gatekeeper for unsigned/unnotarized software",
    "url": "https://github.com/Homebrew/brew/issues/20755",
    "summary": "Homebrew is removing the `--no-quarantine` flag for casks, which is used to bypass macOS's Gatekeeper security mechanism and run unsigned/unnotarized applications. This change is motivated by several factors:\n\n*   **End of Intel Support:** macOS Tahoe is the last version to support Intel Macs, and Apple is making it harder to override Gatekeeper. Apple Silicon Macs require valid signatures for native arm64 code execution.\n*   **Security Concerns:** Homebrew wants to provide a safer experience and discourage users from bypassing OS-level security. The flag intentionally overrides macOS security mechanisms.\n*   **Gatekeeper Requirement:** Starting September 1st, 2026, Homebrew will require all casks to pass Gatekeeper checks, rendering the `--no-quarantine` flag obsolete.\n\nThe deprecation of the flag is intended to give users sufficient time to find alternative solutions or adjust their workflows. The developers believe this will affect a significant portion of Homebrew users positively by strengthening security. Alternatives were not considered as future Macs will make bypassing Gatekeeper even harder.\n",
    "chinese_title": "Homebrew不再允许绕过Gatekeeper来运行未签名/未公证的软件",
    "chinese_summary": "Homebrew将移除cask的`--no-quarantine`标志。该标志用于绕过macOS的Gatekeeper安全机制，运行未签名/未公证的应用程序。此更改的原因有以下几点：\n\n*   **停止Intel支持：** macOS Tahoe是最后一个支持Intel Mac的版本，并且Apple正在加大绕过Gatekeeper的难度。Apple Silicon Mac需要有效的签名才能执行原生arm64代码。\n*   **安全顾虑：** Homebrew希望提供更安全的使用体验，并阻止用户绕过操作系统级别的安全机制。该标志有意覆盖macOS的安全机制。\n*   **Gatekeeper\n\n弃用该标志旨在给予用户足够的时间寻找替代方案或调整其工作流程。开发者认为，这将通过加强安全性对Homebrew的大部分用户产生积极影响。由于未来的Mac将使绕过Gatekeeper变得更加困难，因此未考虑替代方案。"
  },
  {
    "id": "45904551",
    "title": "GPT-5.1: A smarter, more conversational ChatGPT",
    "url": "https://openai.com/index/gpt-5-1/",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "GPT-5.1：更智能、更健谈的ChatGPT",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "45828523",
    "title": "Continuous Autoregressive Language Models",
    "url": "https://arxiv.org/abs/2510.27688",
    "summary": "This arXiv paper (arXiv:2510.27688) introduces Continuous Autoregressive Language Models (CALM), a new paradigm for large language models (LLMs) designed to improve efficiency by increasing the semantic bandwidth of each generative step. The core idea is to move away from discrete, token-by-token generation to continuous next-vector prediction.\n\nCALM achieves this by using a high-fidelity autoencoder to compress chunks of K tokens into a single continuous vector, which can then be accurately reconstructed back into the original tokens (over 99.9% accuracy). This effectively reduces the number of generative steps required by a factor of K.\n\nThe authors also present a comprehensive likelihood-free framework to facilitate training, evaluation, and controllable sampling within this new continuous domain.\n\nExperiments demonstrate that CALM improves the performance-compute trade-off compared to traditional discrete LLMs, achieving comparable performance at a significantly lower computational cost. The authors conclude that next-vector prediction offers a promising and scalable approach towards developing ultra-efficient language models. Code and project links are provided.\n",
    "chinese_title": "连续自回归语言模型",
    "chinese_summary": "本文 (arXiv:2510.27688) 介绍了连续自回归语言模型 (CALM)，一种新型大型语言模型 (LLM) 范式，旨在通过提高每个生成步骤的语义带宽来提高效率。其核心思想是从离散的逐 token 生成转向连续的下一向量预测。\n\nCALM 通过使用高保真自编码器将 K 个 token 的块压缩成单个连续向量来实现这一点，该向量可以精确地重建回原始 token（准确率超过 99.9%）。 这有效地减少了生成步骤的数量，减少的系数为 K。\n\n作者还提出了一个全面的无似然框架，以促进在这个新的连续域中进行训练、评估和可控采样。\n\n实验表明，与传统的离散 LLM 相比，CALM 改善了性能与计算的权衡，以显著降低的计算成本实现了相当的性能。作者得出结论，下一向量预测为开发超高效语言模型提供了一种有前景且可扩展的方法。代码和项目链接已提供。"
  },
  {
    "id": "45912785",
    "title": "Seed. LINE's Custom Typeface",
    "url": "https://seed.line.me/index_en.html",
    "summary": "LINE Seed is LINE's new custom typeface designed to embody the brand's user-friendliness and accessibility. The name \"Seed\" signifies its intention to take root in LINE's services and grow alongside its users. It's a Geometric typeface with Gothic influences and rounded corners designed for readability and a friendly, familiar feel.\n\nLINE Seed aims to deliver a consistent message globally, initially created in Latin, Korean, Japanese, and Thai. Its design ensures harmony across languages, maintaining a unified texture even when different languages are used together. The typeface maintains the straight lines of the LINE logo while incorporating clear curves, resulting in a functional and legible font.\n\nKey features include a simple form representing universality and friendliness, rounded corners applied to all glyphs, and an OpenType ligature feature for consistent letter spacing with character combinations like \"fi\" or \"fl.\" The font also includes service icons for added visual appeal.\n\nThe fonts are released under the SIL Open Font License, allowing free use for personal and commercial purposes, although redistribution or sale of the font files by parties other than LY Corp is prohibited. Attribution is highly recommended for commercial use. LINE collaborated with Dalton Maag in London to develop LINE Seed.\n",
    "chinese_title": "Seed. LINE 的定制字体",
    "chinese_summary": "LINE Seed 是 LINE 全新的定制字体，旨在体现该品牌的用户友好性和易用性。\"Seed\"（种子）这个名字寓意着它将在 LINE 的服务中扎根，并与用户一同成长。它是一种带有哥特式影响的几何字体，具有圆角设计，旨在提供可读性和友好、熟悉的感觉。\n\nLINE Seed 旨在全球范围内传递一致的信息，最初以拉丁文、韩文、日文和泰文创建。其设计确保了跨语言的和谐，即使在使用不同语言时也能保持统一的纹理。该字体保持了 LINE 标志的直线，同时融入了清晰的曲线，从而形成了一种功能强大且易于阅读的字体。\n\n主要特点包括代表普适性和友好性的简单形式、应用于所有字形的圆角以及 OpenType 连字功能，用于在诸如“fi”或“fl”之类的字符组合中保持一致的字母间距。该字体还包括服务图标，以增加视觉吸引力。\n\n这些字体以 SIL Open Font License 发布，允许免费用于个人和商业目的，但禁止 LY Corp 以外的各方重新分发或销售字体文件。强烈建议在商业用途中注明出处。LINE 与伦敦的 Dalton Maag 合作开发了 LINE Seed。"
  },
  {
    "id": "45854418",
    "title": "COBOL to Kotlin via Formal Models (IR and Alloy and Golden Master)",
    "url": "https://marcoeg.medium.com/from-cobol-to-kotlin-795920b1f371",
    "summary": "Marco Graziano's article presents a verifiable approach to COBOL modernization using formal models, moving beyond simple translation to semantic reconstruction. He argues that modernization projects should focus on understanding and proving equivalence, not just rewriting code.\n\nThe core of his approach involves:\n\n1.  **Creating a Layered Intermediate Representation (IR):** Parsing COBOL into increasingly semantic layers capturing syntax, structure, control flow, effects, and ultimately, the transformations performed by the system.\n2.  **Modeling Formally:** Expressing system invariants and behavior using formal languages like Alloy (for static structure), TLA+ (for temporal behavior), and Z3 (for arithmetic consistency).\n3.  **Generating Modern Code:** Compiling the semantic IR into idiomatic Kotlin code.\n4.  **Golden Master Testing:** Proving functional equivalence by comparing the outputs of the original COBOL program and the modernized Kotlin code using the same input data. If checksums match, behavior is identical.\n\nThe article highlights the importance of formal methods in ensuring the correctness and reliability of modernized systems. The author also discusses the potential role of LLMs in accelerating modernization, particularly in code generation and verification, as long as they are guided by a formal context like the IR. The author proposes that LLMs are most effective as \"semantic compilers\" rather than mere translators. He concludes by emphasizing the importance of reconstructing the system's truth and ensuring it continues to function correctly, making modernization verifiable and trustworthy.\n",
    "chinese_title": "通过形式模型（IR、Alloy和黄金标准）将COBOL转换为Kotlin",
    "chinese_summary": "Marco Graziano的文章提出了一种使用形式化模型实现COBOL现代化的可验证方法，超越了简单的翻译，转向语义重建。他认为，现代化项目应该侧重于理解和证明等价性，而不仅仅是重写代码。\n\n其方法的核心包括：\n\n1.  **创建分层中间表示(IR):** 将COBOL解析为语义性递增的层，捕捉语法、结构、控制流、效果，以及最终系统执行的转换。\n2.  **形式化建模:** 使用形式化语言（如Alloy（用于静态结构）、TLA+（用于时间行为）和Z3（用于算术一致性））表达系统不变量和行为。\n3.  **生成现代代码:** 将语义IR编译为惯用的Kotlin代码。\n4.  **Golden Master测试:** 通过比较原始COBOL程序和现代化的Kotlin代码使用相同输入数据时的输出，证明功能等价性。如果校验和匹配，则行为相同。\n\n该文章强调了形式化方法在确保现代化系统的正确性和可靠性方面的重要性。作者还讨论了LLM在加速现代化方面的潜在作用，特别是在代码生成和验证方面，只要它们受到像IR这样的形式化上下文的指导。作者认为，LLM作为“语义编译器”而不是单纯的翻译器，效果最佳。最后，他强调了重建系统真相并确保其继续正常运行的重要性，从而使现代化具有可验证性和可信赖性。"
  },
  {
    "id": "45857657",
    "title": "Shader Glass",
    "url": "https://github.com/mausimus/ShaderGlass",
    "summary": "ShaderGlass is a Windows desktop overlay application that applies GPU shaders for visual effects. It can run in a floating window or full-screen, enhancing the display of various applications, from emulators and pixel art editors to modern games and streaming platforms like YouTube and Twitch. It boasts a large library of built-in RetroArch shaders (1200+), simulating CRT monitors, upscaling images, and emulating TV, VHS, and handheld device displays, along with various blurring, sharpening, and denoising effects.\n\nShaderGlass supports capture from USB devices (webcams/capture cards), saving/loading profiles, and importing external .slangp/.slang shaders. It offers high customizability with various options, operating modes, and adjustable shader parameters.  The application is compatible with OBS for streaming/recording using the Game Capture source.\n\nThe latest stable release (v1.2.2) includes device capture input, hidden cursor options, editable hotkeys, and performance improvements. It requires Windows 10 (version 2004+) or Windows 11 and a DirectX 11-capable GPU.\n\nThe application includes features like Desktop Glass mode (transparent shader overlay) and Window Clone mode (fixed window capture with scaling). It is built using Visual Studio 2022 and uses the Windows Capture API and DirectX 11, incorporating a limited RetroArch shader back-end. ShaderGlass is provided under the GNU GPL v3.0 license and includes shaders from the libretro repository, with proper attribution to copyright holders.\n",
    "chinese_title": "着色器玻璃",
    "chinese_summary": "ShaderGlass 是一款 Windows 桌面覆盖应用程序，可应用 GPU 着色器来实现视觉效果。它可以在浮动窗口或全屏模式下运行，从而增强各种应用程序的显示效果，从模拟器和像素艺术编辑器到现代游戏以及 YouTube 和 Twitch 等流媒体平台。它拥有一个大型的内置 RetroArch 着色器库（1200+），可以模拟 CRT 显示器、放大图像以及模拟电视、VHS 和手持设备显示器，还提供各种模糊、锐化和降噪效果。\n\nShaderGlass 支持从 USB 设备（网络摄像头/采集卡）捕获、保存/加载配置文件以及导入外部 .slangp/.slang 着色器。它提供高度的自定义性，具有各种选项、操作模式和可调节的着色器参数。该应用程序与 OBS 兼容，可使用游戏捕获源进行流式传输/录制。\n\n最新的稳定版本（v1.2.2）包括设备捕获输入、隐藏光标选项、可编辑的热键以及性能改进。它需要 Windows 10（版本 2004+）或 Windows 11 以及支持 DirectX 11 的 GPU。\n\n该应用程序包括桌面玻璃模式（透明着色器覆盖）和窗口克隆模式（具有缩放功能的固定窗口捕获）等功能。它使用 Visual Studio 2022 构建，并使用 Windows Capture API 和 DirectX 11，结合了有限的 RetroArch 着色器后端。ShaderGlass 在 GNU GPL v3.0 许可下提供，并包含来自 libretro 存储库的着色器，并对版权所有者进行了适当的署名。"
  },
  {
    "id": "45825040",
    "title": "Switching from GPG to Age",
    "url": "https://luke.hsiao.dev/blog/gpg-to-age/",
    "summary": "This article details the author's switch from GPG to age for encryption, primarily driven by the simplicity and modern approach of age, especially since they primarily used GPG for encryption and rarely for signing. Faced with expiring GPG sub-keys, they opted to explore age rather than renew or rotate.\n\nThe transition involved switching password managers from pass to passage, an age-backed fork, which was simplified by a migration script within passage. This also eliminated the need for gpg-agent, prompting the author to adopt dedicated SSH keys per machine for better security granularity.\n\nKey benefits highlighted include easier encryption with chezmoi for managing configuration files and secrets, such as font licenses, within a public dotfiles repository. Furthermore, configuring age with YubiKeys, aided by age-plugin-yubikey, proved significantly easier and faster than setting up GPG keys, allowing for secure key generation directly on the hardware. The author emphasizes the ease of future key rotation with age.\n\nUltimately, the switch to age was motivated by a desire to explore new tools and workflows, resulting in a new default that brought fresh ideas and delight to encryption practices. While not strictly necessary, the experiment proved worthwhile, showcasing the value of exploring alternatives in core workflows and the unexpected benefits they can bring.\n",
    "chinese_title": "从GPG切换到Age",
    "chinese_summary": "本文详细介绍了作者从 GPG 切换到 age 进行加密的过程，主要原因是 age 的简洁性和现代化方法，特别是考虑到他们主要使用 GPG 进行加密，很少用于签名。面对即将过期的 GPG 子密钥，他们选择探索 age，而不是续订或轮换。\n\n这一转变包括将密码管理器从 pass 切换到基于 age 的分支 passage，passage 内的迁移脚本简化了这一过程。这也消除了对 gpg-agent 的需求，促使作者为每台机器采用专用的 SSH 密钥，以获得更好的安全粒度。\n\n主要优点包括：使用 chezmoi 更容易地进行加密，以管理公共 dotfiles 存储库中的配置文件和密钥，例如字体许可证。此外，在 age-plugin-yubikey 的帮助下，配置带有 YubiKey 的 age 比设置 GPG 密钥容易得多，也快得多，从而可以直接在硬件上安全地生成密钥。作者强调了使用 age 进行未来密钥轮换的便利性。\n\n最终，切换到 age 的动机是渴望探索新的工具和工作流程，从而形成了一个新的默认设置，为加密实践带来了新的想法和乐趣。虽然并非绝对必要，但这次实验证明是值得的，它展示了在核心工作流程中探索替代方案的价值，以及它们可能带来的意想不到的好处。"
  },
  {
    "id": "45839980",
    "title": "Transpiler, a Meaningless Word (2023)",
    "url": "https://people.csail.mit.edu/rachit/post/transpiler/",
    "summary": "This article argues that the term \"transpiler\" is meaningless and misleading, essentially a watered-down term for a compiler. The author contends that the perceived differences between compilers and transpilers are superficial and based on a misunderstanding of language semantics.\n\nThe author dismantles common misconceptions about transpilers, including:\n\n1.  **Transpilers don't have frontends:** Using Python-to-C conversion as an example, the author illustrates that even simple transpilers require complex frontends to handle language features and built-in libraries.\n2.  **Transpilers are simple:** The author uses BabelJS's transformation of JavaScript generators to demonstrate the complexity involved, highlighting that such transformations can require whole-program analysis and intricate logic.\n3.  **Transpilers target the same level of abstraction:** Addressing BabelJS again, it is described how certain transformations demonstrate how features that look syntactically similar might be very different semantically.\n4.  **Transpilers don't have backends:** BabelJS \"presets\" that target different JavaScript versions are presented as backends under another name.\n5.  **Compilers only target machine code:** The author points out that compilers are widely used to generate bytecode for virtual machines like the JVM.\n6.  **Transpilers are not compilers:** The author concludes that the fear of complexity associated with \"compilers\" leads to the creation of poorly maintained \"transpilers\" that ultimately become just as complex due to the inherent challenges of translating between languages.\n\nThe article emphasizes that programming languages have both syntax and semantics, and attempting to manipulate only the syntax (as some claim transpilers do) leads to flawed tools.\n",
    "chinese_title": "转译器，一个毫无意义的词 (2023)",
    "chinese_summary": "本文认为“转译器”一词毫无意义且具有误导性，本质上是编译器的一种淡化说法。作者认为，人们所认为的编译器和转译器之间的差异是表面上的，并且是基于对语言语义的误解。\n\n作者驳斥了关于转译器的常见误解，包括：\n\n1. **转译器没有前端：** 作者以Python到C的转换为例，说明即使是简单的转译器也需要复杂的前端来处理语言特性和内置库。\n2. **转译器很简单：** 作者使用BabelJS对JavaScript生成器的转换来证明其复杂性，强调这种转换可能需要整个程序的分析和复杂的逻辑。\n3. **转译器针对相同级别的抽象：** 再次提及BabelJS，文章描述了某些转换如何展示出语法上看起来相似的特性可能在语义上非常不同。\n4. **转译器没有后端：** 将BabelJS的针对不同JavaScript版本的“预设”视为另一种名称的后端。\n5. **编译器只针对机器码：** 作者指出，编译器被广泛用于为JVM等虚拟机生成字节码。\n6. **转译器不是编译器：** 作者得出结论，对与“编译器”相关的复杂性的恐惧导致创建了维护不善的“转译器”，但由于在语言之间进行转换的内在挑战，最终变得同样复杂。\n\n本文强调，编程语言既有语法又有语义，试图仅操纵语法（如某些人声称的转译器所做的那样）会导致工具出现缺陷。"
  },
  {
    "id": "45903325",
    "title": "Steam Frame",
    "url": "https://store.steampowered.com/sale/steamframe",
    "summary": "This is a representation of the Steam platform's interface, showing the various navigation options and language settings. The \"Steam Frame\" likely refers to the basic layout or structure of the Steam client or website. The content includes links to the Store, Home, Discovery Queue, Wishlist, Points Shop, News, Statistics, Community features (Home, Discussions, Workshop, Market, Broadcasting), About, and Customer Support. It also provides options to install Steam and log in. A significant portion lists the available language options, spanning a wide variety of languages from Simplified Chinese to Ukrainian. Finally, it includes a link for reporting translation issues.\n",
    "chinese_title": "Steam Frame\n蒸汽边框",
    "chinese_summary": "这是Steam平台的界面展示，包含各种导航选项和语言设置。“Steam框架”可能指的是Steam客户端或网站的基本布局或结构。内容包括商店、首页、探索队列、愿望单、点数商店、新闻、统计、社区功能（首页、讨论、创意工坊、市场、直播）、关于和客服支持的链接。还提供了安装Steam和登录的选项。重要部分列出了可用的语言选项，涵盖从简体中文到乌克兰语的各种语言。最后，它包含一个用于报告翻译问题的链接。"
  },
  {
    "id": "45917235",
    "title": "California revokes 17,000 commercial driver's licenses for immigrants",
    "url": "https://www.pbs.org/newshour/politics/california-revokes-17000-commercial-drivers-licenses-for-immigrants",
    "summary": "California is revoking 17,000 commercial driver's licenses issued to immigrants after discovering that the expiration dates on the licenses extended beyond the drivers' legal authorization to be in the U.S. This action comes after criticism from the Trump administration and Transportation Secretary Sean Duffy, who claimed California improperly issued the licenses and is not adequately enforcing regulations.\n\nDuffy pointed to fatal truck crashes involving drivers not authorized to be in the U.S. as justification for stricter enforcement. He has threatened to withhold federal funding from California if the state doesn't address the issue and remove all \"illegal immigrants\" from behind the wheel of commercial vehicles.\n\nCalifornia initially defended its licensing standards but later admitted the licenses violated state law requiring them to expire on or before a person's legal status ends. Governor Newsom's office maintains that all drivers whose licenses are being revoked had valid work authorizations from the federal government.\n\nDuffy has also introduced new rules making it significantly harder for immigrants to obtain commercial driver's licenses, restricting eligibility to specific visa holders and requiring states to verify immigration status in a federal database. However, these new rules are not retroactive, allowing existing drivers to retain their licenses until renewal. The dispute has become politically charged, with both sides accusing each other of misrepresentation.\n",
    "chinese_title": "加州撤销1.7万份移民商业驾照",
    "chinese_summary": "加州撤销向移民发放的1.7万份商业驾照，原因是发现这些驾照的有效期超过了司机在美国的合法居留期限。此前，特朗普政府和交通部长肖恩·达菲批评加州不当发放驾照，且监管执行不力。\n\n达菲指出，涉及未获授权居留美国的司机的致命卡车事故是加强执法的理由。他威胁称，如果加州不解决这个问题，并将所有“非法移民”从商业车辆驾驶座上移除，将扣留联邦资金。\n\n加州最初为其许可标准辩护，但后来承认这些驾照违反了州法律，该法律要求驾照有效期必须在个人合法身份结束之日或之前到期。纽森州长的办公室坚称，所有驾照被撤销的司机都拥有联邦政府颁发的有效工作许可。\n\n达菲还推出了新规定，大大增加了移民获得商业驾照的难度，将资格限制在特定签证持有者身上，并要求各州在联邦数据库中验证移民身份。然而，这些新规定不具有追溯力，允许现有司机保留其驾照直至续期。这场争端已变得具有政治色彩，双方都指责对方歪曲事实。"
  },
  {
    "id": "45808047",
    "title": "Randomness Testing Guide",
    "url": "https://random.tastemaker.design/",
    "summary": "This \"Randomness Testing Guide\" introduces a simplified approach to randomness testing, aiming to make it accessible to hobbyists. It stems from the complex randomness tests developed by NIST for the AES encryption standard. While AES is widely used in VPNs, file encryption (7-zip), and HTTPS websites, concerns were raised about the complexity and potential issues in NIST's testing methods. The guide seeks to address these issues by providing a more straightforward and understandable way to assess randomness, focusing on simplicity and explainability. Users can input a binary string to run tests, implying the guide includes interactive functionality. The guide emphasizes the importance of randomness in cryptography and aims to empower individuals to perform their own analysis. The next section of the guide focuses on \"Goodness of Fit\".\n",
    "chinese_title": "随机性测试指南",
    "chinese_summary": "本“随机性测试指南”介绍了一种简化的随机性测试方法，旨在使其易于业余爱好者使用。它源于 NIST 为 AES 加密标准开发的复杂随机性测试。虽然 AES 广泛应用于 VPN、文件加密 (7-zip) 和 HTTPS 网站，但人们对 NIST 测试方法的复杂性和潜在问题提出了担忧。本指南旨在通过提供一种更直接和易于理解的方式来评估随机性，从而解决这些问题，重点关注简洁性和可解释性。用户可以输入二进制字符串来运行测试，这意味着该指南包含交互式功能。该指南强调了随机性在密码学中的重要性，并旨在使个人能够进行自己的分析。本指南的下一部分重点介绍“拟合优度”。"
  },
  {
    "id": "45908464",
    "title": "Valve is about to win the console generation",
    "url": "https://xeiaso.net/blog/2025/valve-is-about-to-win-the-console-generation/",
    "summary": "The provided content consists of a title: \"Valve is about to win the console generation,\" followed by a message in Chinese: \"正在确认你是不是机器人！ 加载中...请稍等，我们需要在继续之前检查您的连接安全性.\" which translates to \"Confirming that you are not a robot! Loading... Please wait, we need to check the security of your connection before continuing.\"\n\nSince the main body of the article is missing and only the title and a robotic check message are available, I can only infer the potential subject matter based on the title.\n\n**Summary based on the title:**\n\nThe article likely argues that Valve, the company behind Steam and games like Half-Life and Portal, is poised for significant success in the current console generation. Without the actual content, it's impossible to know the specific reasons, but potential arguments might include:\n\n*   **Steam Deck's Influence:** The success of the Steam Deck, a portable PC gaming device, is blurring the lines between PC and console gaming, potentially giving Valve a strong position.\n*   **Open Ecosystem:** Valve's open ecosystem, compared to the more closed systems of traditional consoles, could be attracting developers and players.\n*   **Software Dominance:** Even without a dedicated console, Steam's dominance as a digital distribution platform gives Valve significant influence over the gaming landscape.\n\nEssentially, the article posits that Valve is strategically positioned to thrive in the current console generation, even if they aren't directly competing with traditional consoles in the same way. However, this is just an inference based on the title alone.\n",
    "chinese_title": "Valve即将赢得主机世代。",
    "chinese_summary": "Valve即将赢得主机世代"
  },
  {
    "id": "45799664",
    "title": "Mergiraf: Syntax-Aware Merging for Git",
    "url": "https://lwn.net/SubscriberLink/1042355/434ad706cc594276/",
    "summary": "This LWN.net article introduces Mergiraf, a syntax-aware merge conflict resolver for Git, aiming to improve upon Git's default line-based merging strategy. Developed primarily by Antonin Delpeuch and Ada Alakbarova, Mergiraf supports 33 languages, including C, Python, and Rust.\n\nMergiraf leverages the tree-sitter parsing library to convert code into syntax trees and uses a non-language-specific tree-matching algorithm (GumTree) coupled with limited language-specific knowledge (like identifying \"commutative parents\" where order doesn't matter) to resolve conflicts. It first attempts a line-based merge for speed, then focuses on conflicting parts using the syntax tree.\n\nThe benefit is in resolving conflicts that arise from logically separate changes on the same line, such as modifications to return types and argument types in function declarations. While syntax-aware merging has been considered for years, Mergiraf builds on the Java-specific Spork implementation, attempting a more general solution.\n\nTesting Mergiraf on the Linux kernel's Git history resolved 428 previously manual merge conflicts out of 7,415, suggesting it could save maintainer time.  The tool offers interfaces for manual use and automatic integration with Git. While not a universal solution, Mergiraf promises to intelligently resolve common and trivial conflicts, making it potentially attractive for developers. However, the article and subsequent discussion highlight the potential for misinterpretations and the need for careful review of automatically resolved conflicts.\n",
    "chinese_title": "Mergiraf：Git 的语法感知合并",
    "chinese_summary": "LWN.net文章介绍：Mergiraf，一款语法感知型Git合并冲突解决工具，旨在改进Git默认的基于行的合并策略。Mergiraf主要由Antonin Delpeuch和Ada Alakbarova开发，支持33种语言，包括C、Python和Rust。\n\nMergiraf利用tree-sitter解析库将代码转换为语法树，并使用非语言特定的树匹配算法(GumTree)以及有限的语言特定知识(如识别顺序无关的“可交换父节点”)来解决冲突。它首先尝试基于行的快速合并，然后使用语法树专注于冲突部分。\n\n其优势在于解决因同一行上逻辑上独立的变化而产生的冲突，例如函数声明中返回类型和参数类型的修改。虽然语法感知合并已被考虑多年，但Mergiraf建立在Java特定的Spork实现之上，试图提供一种更通用的解决方案。\n\n在Linux内核的Git历史记录上测试Mergiraf，解决了7415个先前需要手动解决的合并冲突中的428个，这表明它可以节省维护人员的时间。该工具提供手动使用和与Git自动集成的接口。虽然并非万能解决方案，但Mergiraf承诺智能地解决常见且琐碎的冲突，使其对开发者具有潜在吸引力。然而，文章和随后的讨论强调了误解的可能性以及仔细审查自动解决的冲突的必要性。"
  },
  {
    "id": "45905408",
    "title": "GLP-1 drugs linked to lower death rates in colon cancer patients",
    "url": "https://today.ucsd.edu/story/glp-1-drugs-linked-to-dramatically-lower-death-rates-in-colon-cancer-patients",
    "summary": "A University of California San Diego study published in Cancer Investigation on November 11, 2025, reveals a link between GLP-1 receptor agonists (like Ozempic, Wegovy, and Mounjaro) and significantly lower death rates in colon cancer patients. The study, analyzing data from over 6,800 patients across University of California Health sites, found that patients taking GLP-1 medications were less than half as likely to die within five years compared to those not taking them (15.5% vs. 37.1%).\n\nLed by Raphael Cuomo, Ph.D., the research considered factors like age, BMI, and disease severity, and still found a strong protective effect associated with GLP-1 use. The survival benefit was particularly pronounced in patients with a BMI over 35. Researchers hypothesize that GLP-1 drugs may counteract inflammatory and metabolic conditions that worsen colon cancer outcomes. Potential mechanisms include reduced systemic inflammation, improved insulin sensitivity, weight loss, and even direct anti-cancer effects on tumor cells.\n\nWhile the study is observational, Cuomo emphasizes the urgent need for clinical trials to confirm these findings and investigate the potential of GLP-1 drugs to improve cancer survival rates, especially for individuals with obesity-related cancers. The study suggests a strong correlation, warranting further research to determine the direct anti-cancer benefits versus the indirect impact of improved metabolic health.\n",
    "chinese_title": "GLP-1药物与结肠癌患者较低死亡率相关",
    "chinese_summary": "加州大学圣地亚哥分校研究：GLP-1受体激动剂与结肠癌患者死亡率显著降低相关 (2025年11月11日《癌症研究》发布)"
  },
  {
    "id": "45907541",
    "title": "Marble: A Multimodal World Model",
    "url": "https://www.worldlabs.ai/blog/marble-world-model",
    "summary": "On November 12, 2025, a company released Marble, a multimodal world model that creates 3D environments from various inputs. Marble can generate and edit 3D worlds from text, images, video, or coarse 3D layouts. Users can export these worlds as Gaussian splats, meshes, or videos.\n\nA new \"Marble Labs\" creative hub has been launched. It will enable experimentation, showcase real-world workflows, and provide tutorials and documentation for users.\n\nMarble integrates sight, sound, touch, and language to build a mental model of the outside world, iteratively updating its understanding as new information is available. Users can generate worlds from simple prompts or precisely edit them.\n\nKey features include:\n\n*   **Text and Image to World:** Creating worlds from single images or text prompts.\n*   **Multi-Image and Video to World:** Stitching different prompt images or videos together to create a unified 3D world, even from real-world spaces.\n*   **World Editing:** AI-native tools for small or drastic edits to generated worlds.\n*   **Chisel:** An AI-native tool for sculpting worlds in 3D using coarse shapes and text prompts.\n*   **Expansion and Composition:** Expanding existing worlds or composing multiple worlds to create larger spaces.\n*   **Exporting:** Exporting worlds as Gaussian splats or triangle meshes for use in other tools, and rendering them as videos.\n\nThe goal is to provide users with fine-grained control over world creation, enabling detailed and expansive 3D environments for various applications.\n",
    "chinese_title": "大理石：一种多模态世界模型",
    "chinese_summary": "2025年11月12日，一家公司发布了Marble，一种多模态世界模型，可通过各种输入创建3D环境。Marble可以从文本、图像、视频或粗略的3D布局生成和编辑3D世界。用户可以将这些世界导出为高斯泼溅、网格或视频。\n\n一个新的“Marble Labs”创意中心已经启动，它将支持实验，展示真实世界的工作流程，并为用户提供教程和文档。\n\nMarble集成了视觉、声音、触觉和语言，以构建外部世界的心理模型，并在获得新信息时迭代更新其理解。用户可以通过简单的提示生成世界，或精确地编辑它们。\n\n主要功能包括：\n\n*   **文本和图像到世界：** 从单个图像或文本提示创建世界。\n*   **多图像和视频到世界：** 将不同的提示图像或视频拼接在一起，以创建统一的3D世界，即使是来自真实世界的空间。\n*   **世界编辑：** 用于对生成的世界进行小或大幅度编辑的AI原生工具。\n*   **Chisel：** 一种AI原生工具，用于使用粗略形状和文本提示在3D中雕刻世界。\n*   **扩展和组合：** 扩展现有世界或组合多个世界以创建更大的空间。\n*   **导出：** 将世界导出为高斯泼溅或三角形网格，以用于其他工具，并将其渲染为视频。\n\n目标是为用户提供对世界创建的精细控制，从而为各种应用实现详细而广阔的3D环境。"
  },
  {
    "id": "45902604",
    "title": "Helm 4.0",
    "url": "https://github.com/helm/helm/releases/tag/v4.0.0",
    "summary": "Helm 4.0.0, the first stable release of Helm 4, has been announced. It includes backward incompatible changes to the CLI flags, output, and SDK but aims to minimize workflow disruption compared to the v2 to v3 transition. Key new features include a redesigned plugin system supporting WebAssembly, server-side apply, improved resource watching via kstatus, local content-based caching, slog-based logging, reproducible builds, and an updated SDK API. Charts using apiVersion v2 are still supported.\n\nThe Helm team encourages testing installations and upgrades of existing charts to ensure compatibility. They also invite community engagement through Kubernetes Slack channels for questions, PR discussions, and bug reporting, as well as through the Public Developer Call.\n\nDownload links for Helm 4.0.0 binaries for various platforms (MacOS, Linux, Windows, and architectures) are provided. Future patch and minor releases are planned for December 10, 2025, and January 21, 2026, respectively. The Helm team expresses gratitude to the community for contributions, bug reports, and fostering a welcoming environment.\n",
    "chinese_title": "Helm 4.0",
    "chinese_summary": "Helm 4.0.0发布，首个稳定版本。它包含与CLI标志、输出和SDK向后不兼容的更改，但旨在最大程度地减少与v2到v3过渡相比的工作流程中断。主要新功能包括：重新设计的支持WebAssembly的插件系统、服务器端应用、通过kstatus改进的资源监视、基于本地内容的缓存、基于slog的日志记录、可重现的构建以及更新的SDK API。仍支持使用apiVersion v2的Chart。\n\nHelm团队鼓励测试现有Chart的安装和升级，以确保兼容性。他们还邀请社区通过Kubernetes Slack频道参与，提出问题、讨论PR和报告错误，以及通过公共开发者电话会议参与。\n\n提供了适用于各种平台（MacOS、Linux、Windows和架构）的Helm 4.0.0二进制文件的下载链接。计划于2025年12月10日和2026年1月21日分别发布未来的补丁和次要版本。Helm团队感谢社区的贡献、错误报告以及营造欢迎的环境。"
  },
  {
    "id": "45910347",
    "title": "Meta replaces WhatsApp for Windows with web wrapper",
    "url": "https://www.windowslatest.com/2025/11/12/meta-just-killed-native-whatsapp-on-windows-11-now-it-opens-webview-uses-1gb-ram-all-the-time/",
    "summary": "Meta has replaced the native WhatsApp application for Windows 11 with a web wrapper (WebView2), essentially loading web.whatsapp.com within the app. This change has been met with criticism due to a significant drop in performance compared to the previous native UWP/WinUI app.\n\nThe article highlights that the new WhatsApp uses considerably more RAM, consuming up to 300MB on the login screen and peaking at 2GB when loading chats, while the old native app used as little as 18MB on the login screen and averaged around 190MB during use. This increased memory usage contributes to sluggish performance, long loading times, and general unresponsiveness, making it a \"performance nightmare.\"\n\nThe new version also suffers from issues with Windows notifications, including problems with Do Not Disturb mode and delayed notifications. The author suggests that users are better off using WhatsApp Web in a browser like Edge or Chrome than downloading the new WebView2-based app.\n\nThe change is speculated to be a cost-saving measure following Meta's recent layoffs, potentially disbanding the team behind the native Windows app. While users can currently avoid the upgrade by not downloading version 2.2584.3.0 from the Microsoft Store, they will eventually be forced to switch to the WebView2 version.\n",
    "chinese_title": "Meta 用网页封装取代 WhatsApp Windows 应用",
    "chinese_summary": "Meta已经用网页封装（WebView2）取代了Windows 11的原生WhatsApp应用，本质上是在应用内加载web.whatsapp.com。这一改动受到了批评，原因是与之前的原生UWP/WinUI应用相比，性能显著下降。\n\n文章指出，新的WhatsApp消耗的RAM明显更多，登录界面最多占用300MB，加载聊天记录时峰值可达2GB，而旧的原生应用在登录界面仅占用18MB，使用期间平均占用190MB左右。这种增加的内存使用导致性能缓慢、加载时间长和普遍的无响应，使其成为一场“性能噩梦”。\n\n新版本还存在Windows通知方面的问题，包括免打扰模式的问题和通知延迟。作者建议，用户最好在Edge或Chrome等浏览器中使用WhatsApp Web，而不是下载基于WebView2的新应用。\n\n有推测认为，这次改动是Meta在最近裁员后采取的节约成本措施，可能解散了原生Windows应用背后的团队。虽然用户目前可以通过不从Microsoft Store下载2.2584.3.0版本来避免升级，但最终他们将被迫切换到WebView2版本。"
  },
  {
    "id": "45901904",
    "title": "The last-ever penny will be minted today in Philadelphia",
    "url": "https://www.cnn.com/2025/11/12/business/last-penny-minted",
    "summary": "The U.S. Mint has ceased production of the penny due to its high production cost (nearly four cents per coin) exceeding its value. The last penny was minted in Philadelphia, with ceremonial coins to be auctioned and the final circulation pennies struck in June.\n\nDespite its demise, the penny remains legal tender, but its removal poses challenges for retailers. Some plan to round prices to the nearest nickel, potentially costing consumers and, in some states, violating laws requiring exact change. The need for more nickels to compensate could offset any savings.\n\nGroups like Americans for Common Cents criticize the lack of a comprehensive plan for the penny's phase-out, contrasting it with the approaches of other countries that discontinued low-denomination coins. Retail organizations have requested legislative guidance to address the issues arising from the penny's discontinuation.\n\nThe penny, first minted in 1787, has declined in use and popularity despite an estimated 300 billion in circulation. While many harbor nostalgic memories of the coin, its practical value has diminished, leading to limited public outcry over its end.\n",
    "chinese_title": "最后一枚硬币将于今日在费城铸造。",
    "chinese_summary": "由于生产成本过高（每枚硬币近四美分），美国铸币局已停止生产一美分硬币，其成本已超过其价值。最后一枚一美分硬币在费城铸造，纪念币将被拍卖，最后一批流通的一美分硬币于六月铸造。\n\n尽管一美分硬币已停止生产，但它仍然是法定货币，但其移除给零售商带来了挑战。一些零售商计划将价格四舍五入到最近的五美分，这可能会让消费者付出代价，并且在某些州，还会违反要求准确找零的法律。对更多镍币的需求可能会抵消任何节省。\n\n像“美国通用美分”这样的组织批评缺乏关于一美分硬币淘汰的全面计划，并将其与其他国家停止使用小面额硬币的做法进行了对比。零售组织已要求立法指导，以解决一美分硬币停产所产生的问题。\n\n一美分硬币于1787年首次铸造，尽管估计有3000亿枚在流通，但其使用率和受欢迎程度已下降。虽然许多人对这种硬币怀有怀旧记忆，但其实际价值已经降低，因此对其结束几乎没有引起公众的强烈抗议。"
  },
  {
    "id": "45910305",
    "title": "Bitcoin's big secret: How cryptocurrency became law enforcement's secret weapon",
    "url": "https://bitwarden.com/blog/how-cryptocurrency-became-law-enforcements-secret-weapon/",
    "summary": "This article summarizes a discussion about how Bitcoin, initially thought to be a tool for complete anonymity, has become a powerful weapon for law enforcement. Andy Greenberg, author of \"Tracers in the Dark,\" reveals that blockchain's permanent, traceable record allows investigators to track criminal activity with unprecedented accuracy.\n\nThe turning point came around 2014, with investigators like Tigran Gambaryan using blockchain forensics to solve high-profile cases, including Silk Road corruption, the Mt. Gox heist, the AlphaBay takedown, and the Welcome to Video CSAM marketplace. These investigations led to the largest financial seizures in US Justice Department history.\n\nDespite the power of blockchain analysis, crime persists due to a gap between identifiability and accountability. Criminals operating in countries beyond the reach of Western law enforcement can evade consequences. While successful in disrupting ransomware, pig butchering scams continue to thrive with minimal repercussions.\n\nThe article also acknowledges the privacy concerns raised by blockchain analysis. The same technology used to catch criminals could potentially track law-abiding citizens, presenting a trade-off between security and privacy. The piece concludes by highlighting the crucial role of forensic accountants in leveraging blockchain analysis to combat crime in the digital age, and encourages people to watch the full fireside chat.\n",
    "chinese_title": "比特币的重大秘密：加密货币如何成为执法的秘密武器",
    "chinese_summary": "比特币：从匿名工具到执法利器"
  },
  {
    "id": "45898407",
    "title": "Yt-dlp: External JavaScript runtime now required for full YouTube support",
    "url": "https://github.com/yt-dlp/yt-dlp/issues/15012",
    "summary": "Yt-dlp version 2025.11.12 requires an external JavaScript runtime for full YouTube support due to changes on YouTube's end. Using yt-dlp without a JS runtime will result in limited format availability, especially for logged-in users, and is considered deprecated. This limitation is expected to worsen over time and may eventually make YouTube downloads impossible without a runtime.\n\nThe announcement strongly encourages users to install one of the supported runtimes: Deno (recommended), Node.js, QuickJS, QuickJS-ng, or Bun. Deno is enabled by default, while the others require explicit configuration for security reasons.\n\nYt-dlp also needs the `yt-dlp-ejs` component, which is included in official executables and when installing the Python package with the `default` extra. Users who installed yt-dlp differently should consult the documentation.\n\nThe post also provides guidance for package maintainers, emphasizing the separation of `yt-dlp-ejs` due to licensing differences and suggesting that the JS runtimes are optional dependencies. It anticipates expanded use of JavaScript runtimes beyond YouTube in the future.\n",
    "chinese_title": "Yt-dlp: 完整YouTube支持现在需要外部JavaScript运行时",
    "chinese_summary": "Yt-dlp 2025.11.12 版本需要外部 JavaScript 运行时才能完全支持 YouTube，原因是 YouTube 方面进行了更改。在没有 JS 运行时的情况下使用 yt-dlp 会导致可用的格式有限，特别是对于已登录用户，并且这种用法已被视为已弃用。预计这种限制会随着时间的推移而恶化，并可能最终导致在没有运行时的情况下无法下载 YouTube 视频。\n\n该公告强烈建议用户安装以下支持的运行时之一：Deno（推荐）、Node.js、QuickJS、QuickJS-ng 或 Bun。默认情况下启用 Deno，而其他运行时出于安全原因需要显式配置。\n\nYt-dlp 还需要 `yt-dlp-ejs` 组件，该组件包含在官方可执行文件中以及使用 `default` 额外项安装 Python 包时包含。以其他方式安装 yt-dlp 的用户应查阅文档。\n\n该帖子还为软件包维护者提供了指导，强调了由于许可差异而分离 `yt-dlp-ejs`，并建议 JS 运行时是可选依赖项。它预计未来 JavaScript 运行时的使用范围将超出 YouTube。"
  },
  {
    "id": "45817425",
    "title": "Enabling Trillion-Parameter Models on AWS EFA",
    "url": "https://research.perplexity.ai/articles/enabling-trillion-parameter-models-on-aws-efa",
    "summary": "The provided text is not an article but rather a collection of repetitive footer information typically found on a website, specifically from Perplexity. It mentions the possibility of enabling Trillion-Parameter Models on AWS EFA in the title, but the \"Content\" itself lacks any substance regarding this topic. The content primarily consists of:\n\n*   **Company Information:** Links to Careers, Press Inquiries, Brand Guidelines, etc.\n*   **Product Information:** Mentions Comet Browser, Desktop App, Mobile Apps, and Email Assistant.\n*   **Resources:** Links to Getting Started guides, Help Center, Changelog, and Feedback options.\n*   **API Platform:** Information about the API Platform, including Models, Playground, Documentation, FAQs, and Terms of Service.\n*   **Social Media Links:** Links to Perplexity's presence on X (Twitter), Discord, Threads, LinkedIn, and YouTube.\n*   **Copyright Notice:** Copyright 2025 Perplexity.\n\nThe text focuses on providing navigational links and legal/informational access to Perplexity's offerings rather than providing information on Trillion-Parameter Models on AWS EFA. Therefore, a summary on that specific topic is not possible based on the provided information.\n",
    "chinese_title": "Enabling Trillion-Parameter Models on AWS EFA",
    "chinese_summary": "提供的文本并非文章，而是一系列重复的网站页脚信息，特别来自Perplexity。标题提及在AWS EFA上启用万亿参数模型的可能性，但“内容”本身缺乏关于此主题的任何实质内容。内容主要包括：\n\n*   **公司信息：** 链接至招聘、媒体咨询、品牌指南等。\n*   **产品信息：** 提及Comet浏览器、桌面应用、移动应用和邮件助手。\n*   **资源：** 链接至入门指南、帮助中心、更新日志和反馈选项。\n*   **API平台：** 关于API平台的信息，包括模型、游乐场、文档、常见问题解答和服务条款。\n*   **社交媒体链接：** 链接至Perplexity在X (Twitter)、Discord、Threads、LinkedIn和YouTube上的存在。\n*   **版权声明：** 版权所有2025 Perplexity。\n\n该文本侧重于提供导航链接和对Perplexity产品的法律/信息访问，而不是提供关于在AWS EFA上使用万亿参数模型的信息。因此，基于所提供的信息，无法提供关于该特定主题的摘要。"
  },
  {
    "id": "45902273",
    "title": "Digital ID, a new way to create and present an ID in Apple Wallet",
    "url": "https://www.apple.com/newsroom/2025/11/apple-introduces-digital-id-a-new-way-to-create-and-present-an-id-in-apple-wallet/",
    "summary": "On November 12, 2025, Apple announced the launch of Digital ID, a new feature in Apple Wallet allowing users to create and present a digital identity using their U.S. passport. This secure and private method lets users present their ID via iPhone or Apple Watch for identity verification.\n\nInitially, Digital ID acceptance will roll out in beta at TSA checkpoints in over 250 U.S. airports for domestic travel. Apple anticipates expanding use cases in the future, including age verification at businesses and organizations, both in person and online. While Digital ID can be a useful alternative for those lacking a REAL ID-compliant driver’s license, it is not a replacement for a physical passport for international travel.\n\nTo add a Digital ID, users scan their passport's photo page and the chip embedded on the back using their iPhone. A selfie and facial/head movement verification process are also required. Presenting the ID involves double-clicking the side or Home button, selecting Digital ID in Apple Wallet, and authenticating with Face ID or Touch ID near an identity reader. Only necessary information is shared, with user authorization required for each transaction.\n\nApple emphasizes the security and privacy features, including data encryption and biometric authentication. Apple cannot see when and where users present their ID or what data was shared.\n\nThe article also mentions the existing capability to add driver's licenses and state IDs to Apple Wallet, currently available in 12 states, Puerto Rico, and Japan.\n",
    "chinese_title": "数字身份证：一种在 Apple 钱包中创建和展示身份证的新方式",
    "chinese_summary": "2025年11月12日，苹果公司宣布推出数字身份证（Digital ID），这是Apple Wallet中的一项新功能，允许用户使用其美国护照创建和展示数字身份。这种安全且私密的方式让用户可以通过iPhone或Apple Watch出示身份证明进行身份验证。\n\n最初，数字身份证的接受度将以测试版的形式在美国250多个机场的TSA检查点推出，用于国内旅行。 苹果预计未来会扩大使用场景，包括在企业和组织中进行年龄验证，无论是在线下还是在线上。 虽然数字身份证可以作为那些缺乏符合REAL ID标准的驾驶执照的人的有用替代品，但它不能替代用于国际旅行的实体护照。\n\n要添加数字身份证，用户需要使用他们的iPhone扫描护照的照片页和背面嵌入的芯片。 还需要自拍和面部/头部移动验证过程。 出示身份证明涉及双击侧边或Home键，在Apple Wallet中选择数字身份证，并在身份读取器附近使用Face ID或Touch ID进行身份验证。 只会分享必要的信息，并且每次交易都需要用户授权。\n\n苹果强调了安全和隐私功能，包括数据加密和生物识别认证。 苹果无法看到用户何时何地出示其身份证明，也无法看到分享了哪些数据。\n\n文章还提到了将驾驶执照和州身份证添加到Apple Wallet的现有功能，目前在美国的12个州、波多黎各和日本可用。"
  },
  {
    "id": "45869919",
    "title": "Strap Rail",
    "url": "https://www.construction-physics.com/p/strap-rail",
    "summary": "This article details the rise and fall of strap rail technology in the early United States railroad system, driven by the unique economic and geographical conditions of the time.  Early US railroads, unlike their British counterparts, needed to be built cheaply due to limited capital, vast distances, and low population density. This led to the adoption of strap rail, a cost-effective alternative to expensive solid iron rails used in Britain. Strap rail consisted of thin iron plates attached to wooden timbers, significantly reducing the iron needed for construction.\n\nWhile cheaper to build, strap rail suffered from significant drawbacks. The wooden rails decayed rapidly due to moisture and insects, requiring high maintenance. Furthermore, the iron straps were prone to curling up, leading to derailments.  By 1840, strap rail accounted for the majority of US railway mileage, but its inherent weaknesses ultimately led to its decline.\n\nBy 1850, solid iron rails began to replace strap rail.  Strap rail did find a niche in horse-drawn streetcar lines due to the lighter weight of the cars, and in some private industrial railways, before eventually fading out of use.  The article contrasts strap rail with an even cheaper but more rudimentary technology, the pole road, used in logging operations, highlighting the interplay between problem-solving and environmental constraints in technological development. The author concludes that US railroad tech evolved differently because of capital scarcity, limited access to iron, and low population density in the early 19th century.\n",
    "chinese_title": "带状轨道",
    "chinese_summary": "本文详细介绍了早期美国铁路系统中带状铁轨技术的兴衰，这是由当时独特的经济和地理条件驱动的。与英国同行不同，由于资金有限、距离遥远和人口密度低，早期的美国铁路需要以低廉的成本建造。这导致了带状铁轨的采用，这是一种比英国使用的昂贵的实体铁轨更具成本效益的替代方案。带状铁轨由连接到木制轨枕的薄铁板组成，大大减少了建造所需的铁。\n\n虽然建造起来更便宜，但带状铁轨存在着明显的缺陷。由于潮湿和昆虫的影响，木制轨道迅速腐烂，需要高维护。此外，铁带容易卷曲，导致脱轨。到 1840 年，带状铁轨占美国铁路里程的大部分，但其固有的弱点最终导致了其衰落。\n\n到 1850 年，实体铁轨开始取代带状铁轨。由于车辆重量较轻，带状铁轨确实在马拉街车线路和一些私人工业铁路上找到了用武之地，然后最终退出了使用。本文将带状铁轨与一种更便宜但更简陋的技术——用于伐木作业的杆路——进行了对比，突出了技术发展中问题解决和环境限制之间的相互作用。作者的结论是，由于 19 世纪初的资本稀缺、铁的获取有限以及人口密度低，美国的铁路技术发展方式有所不同。"
  },
  {
    "id": "45915087",
    "title": "Cursor: Past, Present, and Future",
    "url": "https://cursor.com/blog/series-d",
    "summary": "生成摘要时出错",
    "chinese_title": "光标：过去、现在与未来",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45862128",
    "title": "Comparing the Latitude of Europe and America",
    "url": "https://vividmaps.com/comparing-latitude-of-europe-and-america/",
    "summary": "This article explores the latitude similarities between cities and countries in North America, Europe, and Australia, primarily using maps to illustrate these comparisons. The author begins by comparing the latitudes of the United States and Europe, highlighting that many U.S. cities are located at lower latitudes than their European counterparts. Examples include Miami aligning with Egypt, San Diego with Morocco, and Detroit with southern Bulgaria.\n\nThe article then presents maps showing North American cities replaced with European cities at the same latitudes, and vice versa. It further extends the comparison by showcasing maps of European capital cities matched with cities globally, at corresponding latitudes, even identifying cities in the southern hemisphere that share the same latitude as European capitals.\n\nThe author also touches upon the difference in latitudes between American and Australian cities. Despite sharing similar latitudes, the article emphasizes that climate variations exist due to other geographical factors. In short, the article leverages visual maps to illustrate latitude relationships across different continents and prompts the reader to consider the influence of latitude on geography.\n",
    "chinese_title": "Comparing the Latitude of Europe and America",
    "chinese_summary": "本文探讨了北美、欧洲和澳大利亚城市和国家之间的纬度相似性，主要通过地图来展示这些比较。作者首先比较了美国和欧洲的纬度，强调许多美国城市位于比欧洲城市更低的纬度。例如，迈阿密与埃及、圣地亚哥与摩洛哥、底特律与保加利亚南部处于同一纬度。\n\n文章随后展示了地图，将北美城市替换为相同纬度的欧洲城市，反之亦然。文章还进一步拓展了比较，展示了欧洲首都城市与全球范围内相同纬度城市的匹配地图，甚至识别了与欧洲首都共享相同纬度的南半球城市。\n\n作者还提及了美国和澳大利亚城市之间的纬度差异。尽管纬度相似，但文章强调，由于其他地理因素，气候存在差异。 简而言之，本文利用可视地图来说明不同大陆之间的纬度关系，并促使读者考虑纬度对地理的影响。"
  },
  {
    "id": "45903995",
    "title": "How Tube Amplifiers Work",
    "url": "https://robrobinette.com/How_Amps_Work.htm",
    "summary": "This article serves as a layman's guide to understanding the workings of tube amplifiers, specifically focusing on the classic 1950's Fender 5F1 Champ. It breaks down the signal flow, components, and overall functionality of the amp.\n\nThe article begins with a warning about the lethal high voltage contained within tube amp chassis, emphasizing the need for professional service for those untrained in high voltage electronics. It then uses a combination of layout diagrams and schematics to explain the amp's signal path, starting from the guitar input jack, through the preamp tube (V1A), the volume control, the second half of the preamp tube (V1B), the power tube (V2), the output transformer, and finally to the speaker.\n\nIt explains the function of various components like input resistors (R1), grid stopper resistors (R2, R3), coupling capacitors (C1), and the tubes themselves. It also delves into basic electrical concepts like alternating current (AC), voltage, and current, using the analogy of electron pressure to explain voltage.\n\nThe article then provides an overview of how electric guitars generate an audio signal, explaining the role of pickups and the alternating positive and negative voltages produced by string vibration. This alternating signal is then amplified by the tube amp to drive the speaker cone. The article also introduces fundamental concepts like tube operation, power supply, grounding schemes, cathode bypass capacitors, phase inverters, and overdrive. Finally, it offers safety advice regarding capacitors that can store lethal voltage even when unplugged.\n",
    "chinese_title": "电子管放大器工作原理",
    "chinese_summary": "本文旨在为非专业人士提供了解电子管放大器工作原理的指南，特别是以经典的 1950 年代 Fender 5F1 Champ 型号为例。它分解了放大器的信号流、组件和整体功能。\n\n文章首先警告电子管放大器底盘内包含致命的高电压，强调未经高压电子设备培训的人员需要寻求专业维修。然后，文章结合布局图和原理图来解释放大器的信号路径，从吉他输入插孔开始，经过前级放大管（V1A）、音量控制、前级放大管的后半部分（V1B）、功率管（V2）、输出变压器，最后到达扬声器。\n\n文章解释了各种组件的功能，例如输入电阻（R1）、栅极电阻（R2、R3）、耦合电容（C1）以及电子管本身。它还深入探讨了基本的电气概念，例如交流电（AC）、电压和电流，并使用电子压力的类比来解释电压。\n\n文章随后概述了电吉他如何产生音频信号，解释了拾音器的作用以及琴弦振动产生的正负交替电压。这种交替信号随后被电子管放大器放大以驱动扬声器锥盆。文章还介绍了电子管工作原理、电源、接地方案、阴极旁路电容、倒相器和过载等基本概念。最后，它提供了关于电容器的安全建议，这些电容器即使在拔掉插头后仍可能储存致命电压。"
  },
  {
    "id": "45910009",
    "title": "A Commentary on the Sixth Edition Unix Operating System (1977)",
    "url": "https://warsus.github.io/lions-/",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "A Commentary on the Sixth Edition Unix Operating System (1977)",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "45896707",
    "title": "Hard drives on backorder for two years as AI data centers trigger HDD shortage",
    "url": "https://www.tomshardware.com/pc-components/hdds/ai-triggers-hard-drive-shortage-amidst-dram-squeeze-enterprise-hard-drives-on-backorder-by-2-years-as-hyperscalers-switch-to-qlc-ssds",
    "summary": "The surge in AI development is creating a severe shortage in both DRAM and storage, impacting consumers and driving up prices. Enterprise-grade HDDs, crucial for data centers, are facing delivery delays of up to two years due to manufacturers struggling to keep up with AI demand.\n\nTo bypass these delays, hyperscalers are increasingly switching to QLC NAND-based SSDs for nearline storage, despite QLC's typically lower endurance, leading to a shortage of QLC NAND as well. This demand is expected to cause QLC NAND to overtake TLC in popularity by 2027, and has already prompted memory manufacturer Sandisk to raise NAND prices by 50%.\n\nThis widespread scarcity, largely unexpected, is driven by AI companies' willingness to pay premium prices, leaving DRAM and NAND manufacturers with minimal buffer capacity. This is resulting in increased profits for these companies.\n\nUltimately, these shortages and price hikes are impacting everyday consumers, who are facing increased costs for RAM, SSDs, and even mechanical hard drives, making computing a more expensive hobby.\n",
    "chinese_title": "由于人工智能数据中心引发硬盘短缺，硬盘积压订单已达两年。",
    "chinese_summary": "人工智能发展的激增导致DRAM和存储严重短缺，影响消费者并推高价格。用于数据中心的企业级硬盘面临长达两年的交付延迟，原因是制造商难以满足人工智能的需求。\n\n为了绕过这些延迟，超大规模企业越来越多地转向基于QLC NAND的固态硬盘用于近线存储，尽管QLC的耐用性通常较低，这也导致了QLC NAND的短缺。预计这种需求将导致QLC NAND在2027年超越TLC的受欢迎程度，并且已经促使存储器制造商闪迪将NAND价格提高了50%。\n\n这种广泛的、很大程度上出乎意料的短缺，是由人工智能公司愿意支付高溢价推动的，这使得DRAM和NAND制造商的缓冲容量极小。这导致这些公司的利润增加。\n\n最终，这些短缺和价格上涨正在影响普通消费者，他们正面临RAM、固态硬盘甚至机械硬盘成本的增加，使计算成为一项更昂贵的爱好。"
  },
  {
    "id": "45910410",
    "title": "VibeThinker-1.5B",
    "url": "https://github.com/WeiboAI/VibeThinker",
    "summary": "VibeThinker-1.5B is a 1.5 billion parameter language model that demonstrates surprisingly strong reasoning capabilities, challenging the assumption that smaller models are inherently limited. Developed using a novel \"Spectrum-to-Signal Principle (SSP)\" based post-training methodology, VibeThinker-1.5B surpasses larger models like DeepSeek R1 (671B) on challenging mathematical benchmarks (AIME24, AIME25, HMMT25) and performs competitively with models like GPT OSS-20B Medium.\n\nThe core innovation lies in the SSP approach, which involves a \"Two-Stage Diversity-Exploring Distillation\" in the SFT phase to generate a broad range of potential solutions, followed by a \"MaxEnt-Guided Policy Optimization (MGPO)\" framework in the RL phase to strengthen the correct signal. This allows the model to effectively leverage its relatively small size.\n\nKey features of VibeThinker-1.5B include its ultra-efficient parameter count, innovative training methodology, and outstanding performance in mathematical and coding tasks. Notably, the model achieves these results at a significantly lower cost ($7,800) compared to larger models like DeepSeek R1 and MiniMax-M1 (which cost $294K and $535K respectively).\n\nThe model weights, technical report, and evaluation tools are open-source and available for download on Hugging Face and ModelScope. The model is recommended for competitive math and coding problems with specified parameter settings (temperature, max token length, top_p, top_k). It is licensed under the MIT License.\n",
    "chinese_title": "VibeThinker-1.5B\n思绪共鸣者-1.5B",
    "chinese_summary": "VibeThinker-1.5B is a 1.5 billion parameter language model that demonstrates surprisingly strong reasoning capabilities, challenging the assumption that smaller models are inherently limited. Developed using a novel \"Spectrum-to-Signal Principle (SSP)\" based post-training methodology, VibeThinker-1.5B surpasses larger models like DeepSeek R1 (671B) on challenging mathematical benchmarks (AIME24, AIME25, HMMT25) and performs competitively with models like GPT OSS-20B Medium.\n\nThe core innovation lies in the SSP approach, which involves a \"Two-Stage Diversity-Exploring Distillation\" in the SFT phase to generate a broad range of potential solutions, followed by a \"MaxEnt-Guided Policy Optimization (MGPO)\" framework in the RL phase to strengthen the correct signal. This allows the model to effectively leverage its relatively small size.\n\nKey features of VibeThinker-1.5B include its ultra-efficient parameter count, innovative training methodology, and outstanding performance in mathematical and coding tasks. Notably, the model achieves these results at a significantly lower cost ($7,800) compared to larger models like DeepSeek R1 and MiniMax-M1 (which cost $294K and $535K respectively).\n\nThe model weights, technical report, and evaluation tools are open-source and available for download on Hugging Face and ModelScope. The model is recommended for competitive math and coding problems with specified parameter settings (temperature, max token length, top_p, top_k). It is licensed under the MIT License.\n"
  },
  {
    "id": "45912708",
    "title": "IBM: Scaling for Quantum Advantage and Beyond",
    "url": "https://www.ibm.com/quantum/blog/qdc-2025",
    "summary": "IBM's Quantum Developer Conference (QDC) 2025 revealed significant strides towards achieving and scaling quantum advantage. IBM emphasized that quantum advantage, defined as quantum + classical methods outperforming purely classical ones, is the starting point for useful quantum computing.\n\nKey announcements include:\n\n*   **Quantum Advantage Tracker:** A community-led initiative to monitor and evaluate promising quantum advantage candidates.\n*   **IBM Quantum Nighthawk:** A new 120-qubit chip with a square qubit topology allowing for more complex circuits. Planned revisions aim to reach 15,000 quantum gates.\n*   **Improved IBM Quantum Heron:** Featuring lower two-qubit gate errors and increased CLOPS, enabling faster execution of quantum utility experiments.\n*   **Qiskit SDK v2.2:** Benchmarks show 83x faster transpilation than Tket 2.6.0.\n*   **Samplomatic:** A new package extending Qiskit functionality, enabling more efficient error mitigation techniques.\n*   **Utility-Scale Dynamic Circuits:** Demonstrating tangible benefits over static circuits, including improved accuracy and reduced gate usage.\n*   **Qiskit C API:** Enabling deeper integration with HPC systems through C++ interface for efficient quantum-classical workloads.\n*   **Qiskit Functions Catalog:** Partner contributions of functions to key areas like Hamiltonian simulation, optimization, machine learning, and differential equations.\n*   **IBM Quantum Loon:** A proof-of-concept processor demonstrating components for quantum low-density parity check (qLDPC) codes.\n*   **RelayBP on AMD FPGA:** Real-time error correction decoder significantly faster than other industry solutions.\n\nIBM highlighted advancements in hardware, software, and error correction, emphasizing the importance of collaboration between quantum and classical computing for realizing quantum advantage and scaling towards fault-tolerant quantum computing. They invited the community to join them in this journey.\n",
    "chinese_title": "IBM：量子优势及未来拓展",
    "chinese_summary": "IBM量子开发者大会 (QDC) 2025 揭示了在实现和扩展量子优势方面取得的重大进展。 IBM强调，量子优势（定义为量子+经典方法优于纯经典方法）是实用量子计算的起点。\n\n主要公告包括：\n\n*   **量子优势追踪器:** 一项社区主导的倡议，旨在监测和评估有前景的量子优势候选方案。\n*   **IBM Quantum Nighthawk:** 一款新的 120 量子比特芯片，具有方形量子比特拓扑，可实现更复杂的电路。 计划的修订旨在达到 15,000 个量子门。\n*   **改进的 IBM Quantum Heron:** 具有更低的双量子比特门错误和更高的 CLOPS，从而能够更快地执行量子效用实验。\n*   **Qiskit SDK v2.2:** 基准测试表明，其转译速度比 Tket 2.6.0 快 83 倍。\n*   **Samplomatic:** 一个扩展 Qiskit 功能的新软件包，可实现更有效的错误缓解技术。\n*   **实用规模的动态电路:** 展示了优于静态电路的实际优势，包括提高准确性和减少门的使用。\n*   **Qiskit C API:** 通过 C++ 接口实现与 HPC 系统更深层次的集成，以实现高效的量子-经典工作负载。\n*   **Qiskit 函数目录:** 合作伙伴在 Hamiltonian 模拟、优化、机器学习和微分方程等关键领域提供的函数贡献。\n*   **IBM Quantum Loon:** 一款概念验证处理器，展示了量子低密度奇偶校验 (qLDPC) 代码的组件。\n*   **AMD FPGA 上的 RelayBP:** 实时纠错解码器，比其他行业解决方案快得多。\n\nIBM 强调了在硬件、软件和纠错方面的进展，强调了量子和经典计算之间合作对于实现量子优势和扩展到容错量子计算的重要性。 他们邀请社区加入他们的行列，共同参与这一旅程。"
  },
  {
    "id": "45902898",
    "title": "Project Euler",
    "url": "https://projecteuler.net",
    "summary": "Project Euler is a website offering a series of challenging mathematical and computer programming problems designed to be solved using both mathematical insights and programming skills. It aims to provide a platform for learning new concepts in a fun and recreational context, appealing to students, mathematically interested adults, and professionals seeking to sharpen their problem-solving abilities.\n\nThe problems vary in difficulty, allowing participants to progressively learn and tackle more complex challenges. Over 1.3 million registered members from 220 locations use 113 programming languages to solve them.\n\nRegistration is free and required to track progress. Browsing the problems is possible before registering. Project Euler aims to encourage, challenge, and develop skills in mathematics.\n",
    "chinese_title": "欧拉计划",
    "chinese_summary": "欧拉计划是一个网站，提供一系列具有挑战性的数学和计算机编程问题，旨在通过数学见解和编程技巧来解决。它旨在为学习新概念提供一个有趣和娱乐的平台，吸引学生、对数学感兴趣的成年人以及寻求提高解决问题能力的专业人士。\n\n这些问题的难度各不相同，允许参与者逐步学习和解决更复杂的挑战。来自220个地区的超过130万注册会员使用113种编程语言来解决它们。\n\n注册是免费的，并且是跟踪进度的必要条件。在注册之前可以浏览问题。欧拉计划旨在鼓励、挑战和发展数学技能。"
  },
  {
    "id": "45915405",
    "title": "Intel CEO to oversee its AI efforts after executive departs for OpenAI",
    "url": "https://www.reuters.com/business/intel-ceo-oversee-companys-ai-efforts-after-departure-exec-openai-2025-11-10/",
    "summary": "Intel CEO Pat Gelsinger will directly oversee the company's artificial intelligence efforts following the departure of AI executive Irina Spivak to OpenAI. This signals Intel's increased emphasis and priority on AI development. Spivak, who previously headed Intel's data center and AI group's architecture team, is joining OpenAI as it continues to expand its talent pool.\n\nThe article highlights the competitive landscape in the AI sector, with companies like Intel and OpenAI vying for top talent. Gelsinger's direct involvement is intended to accelerate Intel's AI strategy and execution, potentially implying a need for more focused leadership in the wake of Spivak's exit. The move emphasizes Intel's commitment to being a major player in the AI market, despite facing challenges from competitors like Nvidia and AMD. While the article doesn't delve into specific details of Intel's AI strategy, it clearly indicates a renewed commitment and a change in leadership structure for its AI division.\n",
    "chinese_title": "英特尔CEO将亲自负责其人工智能业务，此前一名高管离职加入OpenAI。",
    "chinese_summary": "英特尔CEO盖尔辛格将直接负责公司的人工智能业务，此前人工智能高管Irina Spivak离职加入OpenAI。 这表明英特尔更加重视和优先发展人工智能。此前领导英特尔数据中心和人工智能部门架构团队的Spivak，将加入不断扩大人才储备的OpenAI。\n\n该文章凸显了人工智能领域的竞争格局，英特尔和OpenAI等公司都在争夺顶尖人才。盖尔辛格的直接参与旨在加速英特尔的人工智能战略和执行，可能意味着在Spivak离职后，需要更专注的领导。此举强调了英特尔致力于成为人工智能市场主要参与者的决心，尽管面临着来自英伟达和AMD等竞争对手的挑战。虽然文章没有深入探讨英特尔人工智能战略的具体细节，但它清楚地表明了对人工智能部门的重新投入以及领导结构的变化。"
  },
  {
    "id": "45910244",
    "title": "On USB HID, Keyboard LEDs, and device emulation (2024)",
    "url": "https://epsilon537.github.io/boxlambda/usb-hid/",
    "summary": "This article details the addition of USB keyboard and mouse support, specifically keyboard LED control, to the BoxLambda system, focusing on the integration of the NAND2Mario usb_hid_host core. The author outlines the existing BoxLambda system, including its RISC-V core, memory controller, graphics, audio, and file system.\n\nThe core of the article discusses modifying the NAND2Mario core to control keyboard LEDs. This involved extending the UKP processor within the core with new instructions for branching and outputting data. The author used the USB HID Boot Protocol and explains the SetReport message sequence. The modified core and its fork are available on GitHub.\n\nIntegrating the usb_hid_host core required a Wishbone frontend and Clock Domain Crossing (CDC) logic due to the differing clock speeds (12MHz for USB, 50MHz for the system). The author highlights the toggle-pulse generation technique for reliable CDC.\n\nTo facilitate testing, the author adapted an existing USB mouse emulator and created a keyboard emulator based on a J1 processor running Forth firmware. This simulation setup enabled thorough verification of the USB HID functionality.\n\nThe article also describes the expanded clock and reset domains introduced by the USB implementation, outlining the various clocks, reset domains, and reset sources. Finally, the author details the software side, including a thin Hardware Access Layer (HAL) and a system test case that polls the USB cores for report events and controls keyboard LEDs. Instructions are provided for building and running the test both in Verilator and on an Arty A7 FPGA.\n",
    "chinese_title": "关于USB HID、键盘LED以及设备模拟 (2024)",
    "chinese_summary": "本文详细介绍了为 BoxLambda 系统添加 USB 键盘和鼠标支持，特别是键盘 LED 控制，重点介绍了 NAND2Mario usb_hid_host 内核的集成。作者概述了现有的 BoxLambda 系统，包括其 RISC-V 内核、内存控制器、图形、音频和文件系统。\n\n本文的核心讨论了修改 NAND2Mario 内核以控制键盘 LED。这涉及到使用新的分支和输出数据指令扩展内核中的 UKP 处理器。作者使用了 USB HID 引导协议并解释了 SetReport 消息序列。修改后的内核及其分支可在 GitHub 上找到。\n\n集成 usb_hid_host 内核需要 Wishbone 前端和时钟域交叉 (CDC) 逻辑，因为时钟速度不同（USB 为 12MHz，系统为 50MHz）。作者重点介绍了用于可靠 CDC 的翻转脉冲生成技术。\n\n为了方便测试，作者改编了现有的 USB 鼠标模拟器，并创建了一个基于运行 Forth 固件的 J1 处理器的键盘模拟器。此模拟设置能够彻底验证 USB HID 功能。\n\n本文还介绍了 USB 实现引入的扩展时钟和复位域，概述了各种时钟、复位域和复位源。最后，作者详细介绍了软件方面，包括一个精简的硬件访问层 (HAL) 和一个系统测试用例，该用例轮询 USB 内核以获取报告事件并控制键盘 LED。提供了在 Verilator 和 Arty A7 FPGA 上构建和运行测试的说明。"
  },
  {
    "id": "45802035",
    "title": "LED types by color, brightness, and chemistry (2021)",
    "url": "https://donklipstein.com/ledc.html",
    "summary": "This document provides an overview of different LED types categorized by color, brightness, and chemistry, last updated in April 2021. It starts with infrared LEDs and progresses through the visible spectrum to blue and UV, and finally pink.\n\nThe document details the chemical composition (e.g., GaAs, GaAlAs, GaAsP), spectral peak, voltage drop, typical drive current, and luminous efficacy for each LED type. For example, it discusses the original infrared LEDs made of gallium arsenide (GaAs) and their later, more efficient gallium aluminum arsenide (GaAlAs) counterparts. It also covers the evolution of red LEDs, from the original low-efficiency GaAsP to the brighter GaAlAsP versions.\n\nThe article highlights the development of high-efficiency LEDs in various colors, including orange, yellow, and green, achieved through materials like InGaAlP. It also mentions older, less efficient technologies like silicon carbide yellow LEDs. The emergence of InGaN ultrabright blue and green LEDs, along with white LEDs (blue LED chips with phosphor coatings), is discussed, including improvements in luminous efficacy over time. Special attention is given to wideband GaN blue LEDs and their unique UV superluminescence. Finally, the document notes silicon carbide blue LEDs pioneered by Cree.\n",
    "chinese_title": "按颜色、亮度和化学成分分类的LED类型（2021年）",
    "chinese_summary": "本文件概述了不同LED类型，按颜色、亮度和化学成分分类，最后更新于2021年4月。内容从红外LED开始，逐步涵盖可见光谱至蓝色和紫外线，最终至粉色。\n\n本文详细介绍了每种LED类型的化学成分（如GaAs、GaAlAs、GaAsP）、光谱峰值、压降、典型驱动电流和发光效率。例如，讨论了最初由砷化镓（GaAs）制成的红外LED以及后来效率更高的砷化铝镓（GaAlAs）同类产品。它还涵盖了红色LED的演变，从最初的低效率GaAsP到更亮的GaAlAsP版本。\n\n本文重点介绍了通过InGaAlP等材料实现的各种颜色（包括橙色、黄色和绿色）的高效LED的开发。它还提到了较旧、效率较低的技术，如碳化硅黄色LED。讨论了InGaN超亮蓝色和绿色LED的出现，以及白色LED（带有荧光粉涂层的蓝色LED芯片），包括发光效率随时间的改进。特别关注宽带GaN蓝色LED及其独特的紫外超发光。最后，本文指出了Cree公司率先推出的碳化硅蓝色LED。"
  },
  {
    "id": "45915318",
    "title": "A Sad Collapse in Student Preparation at UC San Diego Was Inevitable",
    "url": "https://www.aei.org/education/a-sad-collapse-in-student-preparation-at-uc-san-diego-was-inevitable/",
    "summary": "The article \"A Sad Collapse in Student Preparation at UC San Diego Was Inevitable\" argues that a decline in student preparedness at UC San Diego, specifically in STEM fields, was a predictable consequence of lowered standards in California's K-12 education system, particularly in mathematics.\n\nThe author contends that factors like grade inflation, a focus on \"equity\" initiatives over rigorous content, and the devaluation of traditional math courses in favor of more \"accessible\" pathways have left many students entering UC San Diego inadequately prepared for the demands of university-level STEM coursework.\n\nThe article suggests that UC San Diego is now grappling with the repercussions of these systemic issues, leading to increased academic support needs and potentially affecting the overall rigor of the university's STEM programs. The author implies that the pursuit of equitable outcomes in K-12 education has inadvertently compromised academic standards, ultimately disadvantaging students who are then unprepared for the challenges of higher education. The article concludes that without addressing the root causes within the California education system, the problem of underprepared students at UC San Diego and similar institutions will likely persist.\n",
    "chinese_title": "A Sad Collapse in Student Preparation at UC San Diego Was Inevitable",
    "chinese_summary": "加州大学圣地亚哥分校学生准备不足的悲哀崩塌是必然的"
  },
  {
    "id": "45916295",
    "title": "For-profit healthcare is the problem, not (just) private equity",
    "url": "https://pluralistic.net/2025/11/13/patients-not-customers/",
    "summary": "生成摘要时出错",
    "chinese_title": "以营利为目的的医疗保健才是问题所在，而不仅仅是（仅仅是）私人股权投资",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45916276",
    "title": "Record Numbers of Younger Women Want to Leave the U.S.",
    "url": "https://news.gallup.com/poll/697382/record-numbers-younger-women-leave.aspx",
    "summary": "A significant portion of Americans, particularly younger women, express a desire to leave the U.S. permanently, with 40% of women aged 15-44 wanting to migrate in 2025, a fourfold increase since 2014. This trend, which began rising in 2016, has created a large gender gap, with a 21-percentage-point difference between younger men and women, the widest Gallup has recorded.\n\nThis desire to migrate is not unique to younger women in other developed countries.  It is influenced by political attitudes, with a significant gap between those who approve and disapprove of the country's leadership.  The trend persists regardless of marital status or whether they have children, suggesting a shift in perspective.  Canada remains the top preferred destination.\n\nThe article attributes this rise to declining confidence in American institutions, particularly following the Dobbs decision, with younger women experiencing the steepest drop in institutional confidence compared to other demographics. Overall, the rising desire to leave the U.S. is a politicized issue, and younger women are increasingly envisioning their futures elsewhere.\n",
    "chinese_title": "想离开美国的年轻女性人数创纪录",
    "chinese_summary": "相当一部分美国人，尤其是年轻女性，表达了永久离开美国的意愿。2025年，15至44岁的女性中有40%希望移民，这一比例是2014年的四倍。这一趋势始于2016年，并造成了巨大的性别差距，年轻男女之间的差距为21个百分点，是盖洛普记录中最大的差距。\n\n这种移民意愿并非年轻女性在美国等发达国家所独有，它受到政治态度的影响，对国家领导人赞成和不赞成的人之间存在显著差距。无论婚姻状况或是否有子女，这种趋势依然存在，表明人们的观念发生了转变。加拿大仍然是首选目的地。\n\n文章将这一增长归因于人们对美国机构信心的下降，尤其是在多布斯裁决之后，年轻女性的机构信任度下降幅度最大，超过其他人群。总而言之，离开美国的意愿日益增强是一个政治化的问题，越来越多的年轻女性正在设想她们在其他地方的未来。"
  },
  {
    "id": "45910257",
    "title": "Large integer precision error in Bash command output rendering",
    "url": "https://github.com/anthropics/claude-code/issues/11506",
    "summary": "This issue report describes a precision error in Claude Code (version v2.0.37) on macOS (Darwin 24.3.0) when rendering large integers in the output of Bash commands. Specifically, when the command `echo '348555896224571969'` or `echo '{\"value\": 348555896224571969}' | jq -c .value` is executed, Claude Code incorrectly displays the number as `348555896224571970`, which is off by one. The expected behavior is to display the exact integer: `348555896224571969`. The reporter verified the issue and confirmed that running the same commands in a native terminal produces the correct output. The bug is labeled as related to \"tools\" and affecting macOS specifically, with detailed reproduction steps provided.\n",
    "chinese_title": "Bash 命令输出渲染中的大整数精度误差",
    "chinese_summary": "此问题报告描述了在macOS (Darwin 24.3.0) 上 Claude Code (版本 v2.0.37) 中渲染 Bash 命令输出中的大型整数时出现的精度错误。具体而言，当执行命令 `echo '348555896224571969'` 或 `echo '{\"value\": 348555896224571969}' | jq -c .value` 时，Claude Code 错误地将数字显示为 `348555896224571970`，相差一位。预期的行为是显示精确的整数：`348555896224571969`。报告者验证了该问题，并确认在原生终端中运行相同的命令会产生正确的输出。此错误被标记为与“工具”相关，并且专门影响 macOS，并提供了详细的重现步骤。"
  },
  {
    "id": "45913421",
    "title": "Jsonrepair: Repair Invalid JSON Documents",
    "url": "https://github.com/josdejong/jsonrepair",
    "summary": "`jsonrepair` is a library for automatically fixing invalid JSON documents. It addresses common issues such as missing quotes, commas, escape characters, incorrect brackets, and can handle truncated JSON. It also cleans up JSON from various sources by removing comments, fenced code blocks, ellipsis in arrays, JSONP notation, MongoDB datatypes, and Python constants. The library can even concatenate strings and convert newline delimited JSON into a valid JSON array.\n\nIt offers both a regular and streaming API, with the streaming API designed for Node.js and capable of handling very large documents with a configurable `chunkSize` and `bufferSize`. The regular API is suitable for smaller files and browser usage. `jsonrepair` can be installed via npm (`npm install jsonrepair`) and used in various environments, including ES modules, CommonJS, UMD in browsers, and Python via PythonMonkey.\n\nA command-line interface (CLI) is also available for repairing files directly. When developing the library, it's important to note the existence of two implementations: a non-streaming one (`src/regular`) suitable for smaller files and browsers, and a streaming one (`src/streaming`) for Node.js, which requires careful configuration of buffer sizes. The library includes extensive unit tests and utilizes npm scripts for building, testing, linting, and releasing.\n",
    "chinese_title": "Jsonrepair：修复无效JSON文档",
    "chinese_summary": "`jsonrepair` 是一个用于自动修复无效 JSON 文档的库。它解决了常见的错误，例如缺少引号、逗号、转义字符、不正确的括号，并且可以处理截断的 JSON。它还可以通过删除注释、围栏代码块、数组中的省略号、JSONP 符号、MongoDB 数据类型和 Python 常量来清理来自各种来源的 JSON。该库甚至可以连接字符串并将换行符分隔的 JSON 转换为有效的 JSON 数组。\n\n它提供了一个常规 API 和一个流式 API，其中流式 API 专为 Node.js 设计，能够处理具有可配置 `chunkSize` 和 `bufferSize` 的非常大的文档。常规 API 适用于较小的文件和浏览器使用。可以通过 npm (`npm install jsonrepair`) 安装 `jsonrepair`，并可在各种环境中使用，包括 ES 模块、CommonJS、浏览器中的 UMD 以及通过 PythonMonkey 使用的 Python。\n\n还提供了一个命令行界面 (CLI)，用于直接修复文件。在开发该库时，重要的是要注意存在两种实现：一种是非流式实现 (`src/regular`)，适用于较小的文件和浏览器；另一种是流式实现 (`src/streaming`)，适用于 Node.js，需要仔细配置缓冲区大小。该库包含广泛的单元测试，并利用 npm 脚本进行构建、测试、代码检查和发布。"
  },
  {
    "id": "45829790",
    "title": "Bluetooth 6.2 – more responsive, improves security, USB comms, and testing",
    "url": "https://www.cnx-software.com/2025/11/05/bluetooth-6-2-gets-more-responsive-improves-security-usb-communication-and-testing-capabilities/",
    "summary": "The Bluetooth 6.2 specification has been released, introducing several key improvements focusing on responsiveness, security, USB communication, and testing.\n\n**Key highlights:**\n\n*   **Shorter Connection Intervals (SCI):** Reduces the minimum Bluetooth LE connection interval significantly, leading to faster responsiveness, especially beneficial for HID devices, HMIs, AR/VR, gaming, and latency-sensitive sensors.\n\n*   **Channel Sounding Amplitude-based Attack Resilience:** Strengthens security by adding protection against amplitude-based RF attacks, making devices in automotive, smart home, and industrial sectors more resistant to relay and spoofing attacks.\n\n*   **HCI USB LE Isochronous Support:** Introduces Bulk Serialization Mode for standardized isochronous data transmission over USB, simplifying host-controller interface (HCI) packet handling and streamlining LE Audio integration in Bluetooth USB devices.\n\n*   **LE Test Mode Enhancements:** Enables a unified control protocol for performing Bluetooth LE RF PHY tests and supports over-the-air (OTA) transport, reducing reliance on cables.\n\nThe Bluetooth SIG is now releasing new specifications bi-annually, with the next version (6.3) expected around May 2026. The article directs readers to the Bluetooth.org website for more detailed information and provides a brief author bio and a request to support the CNX Software website.\n",
    "chinese_title": "蓝牙6.2 – 响应更灵敏，增强安全性，改善USB通信和测试",
    "chinese_summary": "蓝牙6.2规范已发布，引入多项关键改进，重点关注响应速度、安全性、USB通信和测试。\n\n**主要亮点：**\n\n*   **更短连接间隔 (SCI)：** 显著缩短蓝牙LE的最小连接间隔，从而提高响应速度，尤其适用于HID设备、HMI、AR/VR、游戏和对延迟敏感的传感器。\n\n*   **基于信道探测幅度攻击的弹性：** 通过增加对基于幅度射频攻击的保护来增强安全性，使汽车、智能家居和工业领域的设备更能抵抗中继和欺骗攻击。\n\n*   **HCI USB LE 等时支持：** 引入批量序列化模式，用于通过USB进行标准化等时数据传输，简化主机控制器接口 (HCI) 数据包处理，并简化蓝牙USB设备中的LE音频集成。\n\n*   **LE测试模式增强：** 启用统一的控制协议来执行蓝牙LE RF PHY测试，并支持无线 (OTA) 传输，从而减少对电缆的依赖。\n\n蓝牙技术联盟 (Bluetooth SIG) 现在每两年发布一次新规范，预计下一个版本 (6.3) 将于2026年5月左右发布。文章引导读者访问Bluetooth.org网站以获取更详细的信息，并提供简短的作者简介以及支持CNX Software网站的请求。"
  },
  {
    "id": "45908483",
    "title": "Voyager 1 is a light-day away by November 2026",
    "url": "https://www.iflscience.com/on-november-13-2026-voyager-will-reach-one-full-light-day-away-from-earth-81432",
    "summary": "The article discusses Voyager 1's journey to becoming the first human-made object a full light-day away from Earth, anticipated to occur around November 13, 2026. Launched in 1977, Voyager 1 is currently about 169.5 AU from Earth, already having crossed the heliopause into interstellar space, with communication taking over 23 hours. Even at its speed of 61,198 km/h, it will take over a year to reach the light-day milestone of 25.9 billion kilometers.\n\nAfter achieving this distance, Voyager 1 will continue its journey, eventually losing power in the early 2030s. Its long-term path will lead it through the Oort cloud, potentially beginning within a few centuries, although traversing the entire cloud will take tens of thousands of years.\n\nAround 40,000 years from now, Voyager 1 will have a close encounter with the star Gliese 445, coming within 1.7 light-years. Further studies suggest another encounter with TYC 3135-52-1 in approximately 303,000 years. Ultimately, the article concludes that Voyager 1 will likely drift through the cosmos for an extremely long time, unlikely to be captured by a star and with a negligible chance of colliding with one, highlighting the immense distances and timescales involved in interstellar space travel. The Golden Records remain its only companions in this lonely voyage.\n",
    "chinese_title": "旅行者1号将于2026年11月到达光日距离",
    "chinese_summary": "“旅行者1号”迈向光日距离：星际漫游的孤独旅程\n\n旅行者1号预计将于2026年11月13日左右成为首个距离地球一个光日的人造物体。它于1977年发射，目前距离地球约169.5个天文单位，已穿越太阳层顶进入星际空间，通信时长超过23小时。即使以每小时61198公里的速度飞行，它仍需一年多的时间才能到达259亿公里的光日里程碑。\n\n达到这个距离后，“旅行者1号”将继续它的旅程，最终在2030年代初失去动力。它的长期路径将引导它穿过奥尔特云，可能在几个世纪内开始，但穿越整个云层将需要数万年。\n\n大约四万年后，“旅行者1号”将与格利泽445恒星近距离接触，距离仅1.7光年。进一步的研究表明，大约在303000年后，它还将与TYC 3135-52-1星相遇。文章最终得出结论，“旅行者1号”很可能会在宇宙中漂流极长的时间，不太可能被恒星捕获，并且与恒星相撞的几率微乎其微，这突显了星际空间旅行所涉及的巨大距离和时间尺度。金唱片仍然是它在这孤独航程中的唯一伙伴。"
  },
  {
    "id": "45900370",
    "title": "Fighting the New York Times' invasion of user privacy",
    "url": "https://openai.com/index/fighting-nyt-user-privacy-invasion",
    "summary": "Here's a summary of the OpenAI blog post \"Fighting the New York Times' invasion of user privacy\":\n\nOpenAI accuses The New York Times of hacking its products and manipulating them in ways that violated its terms of service in order to manufacture evidence for their lawsuit. The lawsuit, filed by the NYT, alleges copyright infringement regarding the use of their content to train OpenAI's AI models.\n\nOpenAI argues that the NYT actively sought to circumvent safeguards designed to prevent misuse and obtain specific outputs that would support their claims. They claim the NYT essentially \"hacked\" ChatGPT and other OpenAI products by prompting them repeatedly and in a misleading way, specifically targeting content they knew was protected by copyright.\n\nThe blog post emphasizes OpenAI's commitment to protecting user privacy and preventing malicious use of their models. They frame the NYT's actions as an invasion of user privacy because they were intentionally manipulating the system to generate specific outputs, potentially compromising the integrity of the AI and the experience for other users.\n\nOpenAI claims they are prepared to defend themselves vigorously against the NYT's lawsuit and are confident they will prevail. They believe the NYT's actions are not about copyright, but about hindering the development of innovative AI technologies. Ultimately, OpenAI portrays the NYT's tactics as unethical and aimed at stifling competition and innovation in the AI space.\n",
    "chinese_title": "对抗《纽约时报》对用户隐私的侵犯",
    "chinese_summary": "以下是OpenAI博客文章“反击《纽约时报》侵犯用户隐私”的摘要：\n\nOpenAI指责《纽约时报》入侵其产品，并以违反其服务条款的方式操纵它们，以制造证据来支持他们的诉讼。该诉讼由《纽约时报》提起，声称其内容被用于训练OpenAI的AI模型，构成版权侵权。\n\nOpenAI认为，《纽约时报》积极寻求规避旨在防止滥用的保障措施，并获得特定输出，以支持其主张。他们声称《纽约时报》通过重复且具有误导性的提示方式，专门针对他们知道受版权保护的内容，“入侵”了ChatGPT和其他OpenAI产品。\n\n该博客文章强调了OpenAI对保护用户隐私和防止恶意使用其模型的承诺。他们将《纽约时报》的行为定义为侵犯用户隐私，因为他们故意操纵系统以生成特定输出，可能损害AI的完整性以及其他用户的体验。\n\nOpenAI声称他们已准备好积极对抗《纽约时报》的诉讼，并有信心胜诉。他们认为《纽约时报》的行为并非关于版权，而是关于阻碍创新AI技术的发展。最终，OpenAI将《纽约时报》的策略描述为不道德，旨在扼杀AI领域的竞争和创新。"
  },
  {
    "id": "45904161",
    "title": "Blasting Yeast with UV Light",
    "url": "https://chillphysicsenjoyer.substack.com/p/results-from-blasting-yeast-with",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "用紫外线照射酵母",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "45900978",
    "title": "Learn Prolog Now (2006)",
    "url": "https://lpn.swi-prolog.org/lpnpage.php?pageid=top",
    "summary": "生成摘要时出错",
    "chinese_title": "Learn Prolog Now (2006)",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45899189",
    "title": "A brief look at FreeBSD",
    "url": "https://yorickpeterse.com/articles/a-brief-look-at-freebsd/",
    "summary": "生成摘要时出错",
    "chinese_title": "A brief look at FreeBSD",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45912381",
    "title": "Show HN: AI Bubble Monitor",
    "url": "https://aibubblemonitor.com",
    "summary": "生成摘要时出错",
    "chinese_title": "Show HN: AI Bubble Monitor",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45811084",
    "title": "Debugging containers that have no shell",
    "url": "https://docs.docker.com/reference/cli/docker/debug",
    "summary": "生成摘要时出错",
    "chinese_title": "Debugging containers that have no shell",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45913945",
    "title": "Chat Control is back [pdf]",
    "url": "https://cdn.netzpolitik.org/wp-upload/2025/11/2025-11-06_Council_Presidency_LEWP_CSA-R_Presidency-compromise-texts_14092.pdf",
    "summary": "生成摘要时出错",
    "chinese_title": "Chat Control is back [pdf]",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45905620",
    "title": "Making the Clang AST Leaner and Faster",
    "url": "https://cppalliance.org/mizvekov,/clang/2025/10/20/Making-Clang-AST-Leaner-Faster.html",
    "summary": "生成摘要时出错",
    "chinese_title": "Making the Clang AST Leaner and Faster",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45915584",
    "title": "October Jobs Report to Skip Unemployment Rate, Hassett Says",
    "url": "https://www.bloomberg.com/news/articles/2025-11-13/october-jobs-report-to-skip-unemployment-rate-hassett-says",
    "summary": "生成摘要时出错",
    "chinese_title": "October Jobs Report to Skip Unemployment Rate, Hassett Says",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45803071",
    "title": "Software development in the time of strange new angels",
    "url": "https://davegriffith.substack.com/p/software-development-in-the-time",
    "summary": "生成摘要时出错",
    "chinese_title": "Software development in the time of strange new angels",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45911282",
    "title": "Stanford Medicine scientists tie lupus to a virus nearly all of us carry",
    "url": "https://med.stanford.edu/news/all-news/2025/11/lupus-epstein-barr.html",
    "summary": "生成摘要时出错",
    "chinese_title": "Stanford Medicine scientists tie lupus to a virus nearly all of us carry",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45888620",
    "title": ".NET 10",
    "url": "https://devblogs.microsoft.com/dotnet/announcing-dotnet-10/",
    "summary": "生成摘要时出错",
    "chinese_title": ".NET 10",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45905703",
    "title": "Steam Controller",
    "url": "https://store.steampowered.com/sale/steamcontroller",
    "summary": "生成摘要时出错",
    "chinese_title": "Steam Controller",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45913663",
    "title": "Hack Club has been handling children's data for 4 years without a privacy policy",
    "url": "https://kys.llc/blog/my-hackclub-story",
    "summary": "生成摘要时出错",
    "chinese_title": "Hack Club has been handling children's data for 4 years without a privacy policy",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45900108",
    "title": "Micro.blog launches new 'Studio' tier with video hosting",
    "url": "https://heydingus.net/blog/2025/11/micro-blog-offers-an-indie-alternative-to-youtube-with-its-studio-video-hosting-plan",
    "summary": "生成摘要时出错",
    "chinese_title": "Micro.blog launches new 'Studio' tier with video hosting",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45811026",
    "title": "NetHack4 Philosophy",
    "url": "http://nethack4.org/philosophy.html",
    "summary": "生成摘要时出错",
    "chinese_title": "NetHack4 Philosophy",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45915352",
    "title": "Effects of residential ventilation and filtration interventions on adult asthma",
    "url": "https://www.sciencedirect.com/science/article/pii/S0360132325010492",
    "summary": "生成摘要时出错",
    "chinese_title": "Effects of residential ventilation and filtration interventions on adult asthma",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45915932",
    "title": "There's Just No Reason to Deal with Young Employees",
    "url": "https://nymag.com/intelligencer/article/ai-replacing-entry-level-jobs-gen-z-careers.html",
    "summary": "生成摘要时出错",
    "chinese_title": "There's Just No Reason to Deal with Young Employees",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45856014",
    "title": "Disassembling terabytes of random data with Zig and Capstone to prove a point",
    "url": "https://jstrieb.github.io/posts/random-instructions/",
    "summary": "生成摘要时出错",
    "chinese_title": "Disassembling terabytes of random data with Zig and Capstone to prove a point",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45915852",
    "title": "California revokes 17,000 expired commercial driver's licenses for immigrants",
    "url": "https://apnews.com/article/duffy-newsom-commercial-drivers-license-immigrant-trucking-c0f3064e329a00f19aecbd1404dd393d",
    "summary": "生成摘要时出错",
    "chinese_title": "California revokes 17,000 expired commercial driver's licenses for immigrants",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45814019",
    "title": "Using street lamps as EV chargers",
    "url": "https://www.techbriefs.com/component/content/article/54104-using-street-lamps-as-ev-chargers",
    "summary": "生成摘要时出错",
    "chinese_title": "Using street lamps as EV chargers",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45901855",
    "title": "Waymo robotaxis are now giving rides on freeways in LA, SF and Phoenix",
    "url": "https://techcrunch.com/2025/11/12/waymo-robotaxis-are-now-giving-rides-on-freeways-in-these-3-cities/",
    "summary": "生成摘要时出错",
    "chinese_title": "Waymo robotaxis are now giving rides on freeways in LA, SF and Phoenix",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45900159",
    "title": "The Geometry Behind Normal Maps",
    "url": "https://www.shlom.dev/articles/geometry-behind-normal-maps/",
    "summary": "生成摘要时出错",
    "chinese_title": "The Geometry Behind Normal Maps",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45783411",
    "title": "Ioannis Yannas, who invented artificial skin for treatment of burns, has died",
    "url": "https://news.mit.edu/2025/professor-ioannis-yannas-dies-1027",
    "summary": "生成摘要时出错",
    "chinese_title": "Ioannis Yannas, who invented artificial skin for treatment of burns, has died",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45898789",
    "title": "Pakistani newspaper mistakenly prints AI prompt with the article",
    "url": "https://twitter.com/omar_quraishi/status/1988518627859951986",
    "summary": "生成摘要时出错",
    "chinese_title": "Pakistani newspaper mistakenly prints AI prompt with the article",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45826596",
    "title": "Archive or Delete?",
    "url": "https://email-is-good.com/2025/11/05/archive-or-delete/",
    "summary": "生成摘要时出错",
    "chinese_title": "Archive or Delete?",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45803408",
    "title": "Max Number of Simultaneous Key-Press (N-Key Rollover, NKRO, Ghosting) (2010)",
    "url": "http://xahlee.info/kbd/keyboard_n-key_rollover_key_ghosting.html",
    "summary": "生成摘要时出错",
    "chinese_title": "Max Number of Simultaneous Key-Press (N-Key Rollover, NKRO, Ghosting) (2010)",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45868357",
    "title": "Building a CI/CD Pipeline Runner from Scratch in Python",
    "url": "https://muhammadraza.me/2025/building-cicd-pipeline-runner-python/",
    "summary": "生成摘要时出错",
    "chinese_title": "Building a CI/CD Pipeline Runner from Scratch in Python",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45821265",
    "title": "Tetrahedral Analog of the Pythagorean Theorem",
    "url": "https://www.johndcook.com/blog/2025/11/03/de-gua/",
    "summary": "生成摘要时出错",
    "chinese_title": "Tetrahedral Analog of the Pythagorean Theorem",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45909667",
    "title": "My dad could still be alive, but he's not",
    "url": "https://www.jenn.site/my-dad-could-still-be-alive-but-hes-not/",
    "summary": "生成摘要时出错",
    "chinese_title": "My dad could still be alive, but he's not",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45902678",
    "title": "Arch-delta Saves 80% Of Bandwidth On Upgrades",
    "url": "https://djugei.github.io/how-arch-delta-works/",
    "summary": "生成摘要时出错",
    "chinese_title": "Arch-delta Saves 80% Of Bandwidth On Upgrades",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45789674",
    "title": "Laptops with Stickers",
    "url": "https://stickertop.art/main/",
    "summary": "生成摘要时出错",
    "chinese_title": "Laptops with Stickers",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45897271",
    "title": "Yann LeCun to depart Meta and launch AI startup focused on 'world models'",
    "url": "https://www.nasdaq.com/articles/metas-chief-ai-scientist-yann-lecun-depart-and-launch-ai-start-focused-world-models",
    "summary": "生成摘要时出错",
    "chinese_title": "Yann LeCun to depart Meta and launch AI startup focused on 'world models'",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45903586",
    "title": "Async and Finaliser Deadlocks",
    "url": "https://tratt.net/laurie/blog/2025/async_and_finaliser_deadlocks.html",
    "summary": "生成摘要时出错",
    "chinese_title": "Async and Finaliser Deadlocks",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45916596",
    "title": "UK Crime Agency Backs \"Upload Prevention\" Plan to Scan Encrypted Messages",
    "url": "https://reclaimthenet.org/jess-phillips-supports-message-scanning-to-protect-children-online",
    "summary": "生成摘要时出错",
    "chinese_title": "UK Crime Agency Backs \"Upload Prevention\" Plan to Scan Encrypted Messages",
    "chinese_summary": "生成摘要时出错"
  }
]