[
  {
    "id": "43963868",
    "title": "Embeddings Are Underrated",
    "url": "https://technicalwriting.dev/ml/embeddings/overview.html",
    "summary": "This article argues that embeddings are an underrated machine learning technology for technical writing, offering the ability to discover connections between texts at scales previously impossible. Embeddings are generated by inputting text into a model, which then outputs a fixed-size array of numbers (a vector). The size of the array depends on the model (e.g., 768 numbers for Gemini's text-embedding-004, 1024 for Voyage AI's voyage-3). The key is that these numbers allow mathematical comparison of any two pieces of text, regardless of their size.\n\nThe author explains the process of creating embeddings using Gemini's API and discusses the cost and environmental impact. He also compares different embedding models, emphasizing the importance of input size (voyage-3 currently has the largest).\n\nThe author likens embeddings to points on a map, with each number in the array representing a dimension. Comparing the distance between embeddings reveals the semantic closeness of the texts. This concept is related to latent space.\n\nOne application is related page recommendations on documentation sites. By generating embeddings for each page and comparing them, the system can identify related content, potentially at a lower cost than traditional methods. The author conducted an experiment on the Sphinx documentation, generating embeddings using a custom Sphinx extension and finding nearest neighbors using linear algebra. He found the results promising and suggests freely providing embeddings for documentation content to foster community development.\n",
    "chinese_title": "嵌入被低估了",
    "chinese_summary": "嵌入：技术写作中被低估的机器学习技术\n\n本文认为，嵌入是一种被低估的机器学习技术，它可以发现文本之间以前无法实现的大规模连接。 嵌入是通过将文本输入到模型中生成的，模型会输出一个固定大小的数字数组（一个向量）。 数组的大小取决于模型（例如，Gemini 的 text-embedding-004 为 768 个数字，Voyage AI 的 voyage-3 为 1024 个数字）。 关键在于，这些数字允许对任意两段文本进行数学比较，而不管它们的大小如何。\n\n作者解释了使用 Gemini 的 API 创建嵌入的过程，并讨论了成本和环境影响。 他还比较了不同的嵌入模型，强调了输入大小的重要性（voyage-3 目前具有最大的输入大小）。\n\n作者将嵌入比作地图上的点，数组中的每个数字代表一个维度。 比较嵌入之间的距离揭示了文本的语义接近度。 这个概念与潜在空间有关。\n\n一个应用是文档站点上的相关页面推荐。 通过为每个页面生成嵌入并进行比较，系统可以识别相关内容，其成本可能低于传统方法。 作者在 Sphinx 文档上进行了一项实验，使用自定义 Sphinx 扩展生成嵌入，并使用线性代数找到最近邻。 他发现结果很有希望，并建议免费提供文档内容的嵌入，以促进社区发展。"
  },
  {
    "id": "43964937",
    "title": "I hacked a dating app (and how not to treat a security researcher)",
    "url": "https://alexschapiro.com/blog/security/vulnerability/2025/04/21/startups-need-to-take-security-seriously",
    "summary": "A security researcher discovered critical vulnerabilities in the dating app Cerca, potentially exposing the personal data of thousands of users. The researcher found that OTPs were sent directly in API responses, allowing account takeover with just a phone number. Furthermore, the researcher bypassed authentication to access unprotected endpoints, including one revealing user profiles with sensitive information like phone numbers, emails, sexual preferences, and intimate messages. Critically, the researcher could also access submitted passport/ID information.\n\nUsing a script, the researcher enumerated over 6,000 users, finding that over 200 had submitted their ID information. This represents a significant privacy breach, contradicting Cerca's claims of employing industry-standard encryption.\n\nThe researcher responsibly disclosed these vulnerabilities to Cerca in February 2025, who initially acknowledged the issues and promised prompt action. However, Cerca subsequently went silent, failing to provide updates, remediate the situation to users, or acknowledge the incident publicly. The researcher independently confirmed the vulnerabilities were patched and decided to publish their findings to raise awareness and advocate for better security practices. The researcher emphasizes the potential for real-world harm, including identity theft, stalking, and blackmail, due to the sensitive data exposed. The article highlights the need for startups to prioritize user data security over rapid market entry.\n",
    "chinese_title": "我破解了一个约会软件（以及如何不对待安全研究员）",
    "chinese_summary": "安全研究员发现Cerca约会应用存在严重漏洞，可能暴露数千用户的个人数据。该研究员发现一次性密码直接在API响应中发送，仅凭电话号码即可实现账户接管。此外，该研究员绕过身份验证访问未受保护的端点，其中包括一个显示用户个人资料的端点，其中包含敏感信息，如电话号码、电子邮件、性偏好和私密消息。至关重要的是，该研究员还可以访问提交的护照/身份证信息。\n\n该研究员使用脚本枚举了6000多名用户，发现其中200多人提交了身份证信息。这代表着严重的隐私泄露，与Cerca声称采用行业标准加密的说法相悖。\n\n该研究员于2025年2月负责任地向Cerca披露了这些漏洞，Cerca最初承认了这些问题并承诺迅速采取行动。然而，Cerca随后保持沉默，未提供更新、解决用户的问题或公开承认该事件。该研究员独立确认漏洞已得到修复，并决定公布其发现，以提高人们的意识并倡导更好的安全实践。该研究员强调了暴露的敏感数据可能造成的现实危害，包括身份盗窃、跟踪和敲诈勒索。文章强调，初创公司需要优先考虑用户数据安全，而不是快速进入市场。"
  },
  {
    "id": "43964136",
    "title": "The Barbican",
    "url": "https://arslan.io/2025/05/12/barbican-estate/",
    "summary": "The author recounts their fascination with the Barbican Estate, a residential complex in London built between 1965 and 1976, sparked by a search for Vitsoe furniture. This interest led to researching the Barbican through videos, books, and ultimately, a visit.\n\nDuring a recent trip to London, the author took a two-hour architectural tour led by a resident, revealing numerous intriguing details. The Barbican is designed as a self-contained community where residents can live their entire lives. The complex is deliberately maze-like, reputedly deterring thieves. It features amenities like underground parking (with abandoned cars), buildings named after historical English figures, and architectural inspiration from ancient Egypt.\n\nThe author highlights exclusive resident access, including hidden gateways accessible via key fobs. The Barbican's history is rich, built on Roman and Medieval ruins, including a Jewish burial ground. Residents rely on central heating, which can be inconsistently controlled, and communicate through an online forum, barbicantalk.com. The complex also contains references to famous architects like Le Corbusier and even houses a branch of a music school.\n\nThe author concludes by recommending three books for those interested in learning more about the Barbican: \"Barbican Residents,\" \"Barbican Estate,\" and \"Building Utopia: The Barbican Centre,\" the latter of which is especially noteworthy for its up-to-date and insider information.\n",
    "chinese_title": "巴比肯",
    "chinese_summary": "作者追溯了其对巴比肯住宅区的迷恋——这个位于伦敦，建于1965年至1976年的住宅群，而这份迷恋的开端源于一次对维索家具的寻找。这份兴趣促使作者通过视频、书籍，最终通过一次实地参观来研究巴比肯。\n\n在最近一次伦敦之旅中，作者参加了一个由居民带领的两个小时的建筑之旅，揭示了许多引人入胜的细节。巴比肯被设计成一个自给自足的社区，居民可以在这里度过一生。这个建筑群刻意设计成迷宫状，据说是为了阻止窃贼。它拥有地下停车场（里面有废弃的汽车）、以英国历史人物命名的建筑，以及来自古埃及的建筑灵感等设施。\n\n作者重点介绍了专属的居民权限，包括可以通过钥匙扣进入的隐藏入口。巴比肯的历史悠久，建在罗马和中世纪的废墟之上，包括一个犹太墓地。居民依靠集中供暖，但供暖控制不稳定，他们通过在线论坛barbicantalk.com进行交流。该建筑群还包含对著名建筑师如勒·柯布西耶的致敬，甚至还设有一所音乐学校的分校。\n\n作者最后推荐了三本供那些有兴趣了解更多关于巴比肯的人阅读的书籍：《巴比肯居民》、《巴比肯住宅区》和《建造乌托邦：巴比肯中心》，其中后者因其最新的和内部信息而尤其值得关注。"
  },
  {
    "id": "43964827",
    "title": "RIP Usenix ATC",
    "url": "https://bcantrill.dtrace.org/2025/05/11/rip-usenix-atc/",
    "summary": "This article reflects on the demise of the USENIX Annual Technical Conference (ATC), a once-pioneering forum for systems practitioners. The author reminisces about ATC's golden age, highlighting the USENIX Summer 1994 conference and the successful launch of DTrace at ATC 2004. However, the author notes a shift towards academia at ATC, lamenting the decline in industry participation and relevance.\n\nThe author connects ATC's struggles to broader changes in the systems landscape. Open-source projects like Go and Rust, driven by professionals and deployed in production, have become primary drivers of innovation, diminishing the need for formal conference publishing. The author acknowledges the inherent challenges in sustaining in-person conferences and suggests that online formats may offer more value.\n\nDespite its decline, the author emphasizes ATC's past contributions as a forum for presenting groundbreaking systems work. He highlights the last Best Paper, focusing on a real-world AI infrastructure validation system, as a testament to the conference's original spirit. The author concludes by expressing gratitude to USENIX for providing a platform for important ideas, even acknowledging a complicated relationship over the years. He ultimately attributes ATC's failure to adapt to the evolving landscape of systems development and the dominance of academic publishing models.\n",
    "chinese_title": "一路走好，Usenix ATC",
    "chinese_summary": "本文反思了曾经作为系统实践者先锋论坛的USENIX年度技术会议（ATC）的衰落。作者回忆了ATC的黄金时代，重点介绍了1994年USENIX夏季会议和2004年ATC上DTrace的成功发布。然而，作者注意到ATC向学术界的转变，并感叹行业参与度和相关性的下降。\n\n作者将ATC的困境与系统领域的更广泛变化联系起来。由专业人士驱动并在生产中部署的Go和Rust等开源项目已成为创新的主要驱动力，从而减少了对正式会议出版的需求。作者承认维持线下会议固有的挑战，并建议在线形式可能提供更多价值。\n\n尽管ATC衰落，作者仍强调其过去作为展示突破性系统工作的论坛所做的贡献。他重点介绍了最后一篇最佳论文，该论文侧重于一个真实的AI基础设施验证系统，以此证明会议的最初精神。作者最后感谢USENIX为重要思想提供了一个平台，甚至承认多年来的复杂关系。他最终将ATC的失败归因于未能适应不断发展的系统开发格局以及学术出版模式的主导地位。"
  },
  {
    "id": "43962148",
    "title": "University of Texas-led team solves a big problem for fusion energy",
    "url": "https://news.utexas.edu/2025/05/05/university-of-texas-led-team-solves-a-big-problem-for-fusion-energy/",
    "summary": "A University of Texas-led team has made a significant breakthrough in fusion energy research by developing a new method for designing leak-proof magnetic confinement systems for stellarator reactors. This advancement addresses a 70-year-old challenge of containing high-energy particles, specifically alpha particles, within the reactor, preventing them from escaping and hindering the fusion reaction.\n\nThe existing methods for identifying leaks in the magnetic field, vital for preventing particle escape, are either computationally expensive (using Newton's laws) or inaccurate (using perturbation theory). The new method, based on symmetry theory, provides a shortcut that is both accurate and 10 times faster than the traditional gold standard method. This allows engineers to rapidly iterate on designs and eliminate leaks.\n\nThe breakthrough is a \"paradigm shift\" in stellarator design, a type of fusion reactor that uses external coils to create magnetic fields for plasma confinement. The new method also has potential applications in tokamak reactors, addressing the problem of runaway electrons that can damage reactor walls. The research, published in Physical Review Letters, was supported by the U.S. Department of Energy and involves collaboration between researchers at UT Austin, Los Alamos National Laboratory, and Type One Energy Group, a company planning to build stellarators for power generation.\n",
    "chinese_title": "德克萨斯大学领衔团队解决聚变能源领域一大难题",
    "chinese_summary": "德克萨斯大学领导的团队在聚变能源研究方面取得了重大突破，他们开发了一种新方法来设计用于仿星器反应堆的防漏磁约束系统。这项进展解决了困扰70年的难题，即如何在反应堆内约束高能粒子（特别是α粒子），防止它们逸出并阻碍聚变反应。\n\n现有的用于识别磁场泄漏（对于防止粒子逸出至关重要）的方法要么计算成本高昂（使用牛顿定律），要么不准确（使用微扰理论）。这种基于对称理论的新方法提供了一条捷径，既准确又比传统的黄金标准方法快10倍。这使得工程师能够快速迭代设计并消除泄漏。\n\n这项突破是仿星器设计中的一个“范式转变”，仿星器是一种使用外部线圈产生磁场以约束等离子体的聚变反应堆。这种新方法在托卡马克反应堆中也具有潜在应用，可以解决可能损坏反应堆壁的失控电子问题。这项发表在《物理评论快报》上的研究得到了美国能源部的支持，并涉及德克萨斯大学奥斯汀分校、洛斯阿拉莫斯国家实验室和Type One能源集团（一家计划建造仿星器用于发电的公司）的研究人员之间的合作。"
  },
  {
    "id": "43965161",
    "title": "Legion Health (YC S21) Is Hiring Founding Engineers to Fix Mental Health with AI",
    "url": "https://www.workatastartup.com/jobs/75011",
    "summary": "Legion Health (YC S21), a company building AI-native operations for mental health, is hiring Founding Engineers. They're focused on rebuilding psychiatry from the ground up, using AI and LLMs to automate operations, reduce administrative burden, and improve patient care. Unlike other AI startups that bolt AI onto existing workflows, Legion Health is re-engineering the entire system.\n\nThe role involves building AI-native care infrastructure, including scheduling, documentation, billing, intake, and risk detection, directly impacting real patients and clinicians. The company already has a live agentic co-pilot and serves over 2,000 patients with minimal support staff.\n\nKey responsibilities include architecting and scaling the backend (Node.js, Next.js, TypeScript, PostgreSQL, AWS), building LLM agent infrastructure, shaping human + AI ops UX, defining the world-state simulation of a patient’s journey, and engineering secure, HIPAA-compliant data pipelines. The ideal candidate has experience building complex systems, thinks in terms of systems and event flows, and is fluent in or eager to learn LLMs.\n\nLegion Health has $1M+ ARR, is growing fast, and has raised $6M in funding. They offer a chance to shape the future of AI-native mental healthcare and be a founding member of the engineering culture. They are looking for individuals who appreciate clean architecture and velocity. The company offers salary and equity.\n",
    "chinese_title": "Legion Health (YC S21) 招聘创始工程师，利用人工智能改善心理健康",
    "chinese_summary": "Legion Health (YC S21) 招募创始工程师：该公司致力于构建人工智能驱动的心理健康运营系统，从零开始重塑精神病学，利用AI和LLM自动化运营，减轻行政负担，并改善患者护理。与将AI附加到现有流程的其他AI初创公司不同，Legion Health正在重新设计整个系统。\n\n该职位涉及构建AI原生护理基础设施，包括日程安排、文档记录、账单、入院登记和风险检测，直接影响实际患者和临床医生。该公司已经拥有一个实时代理副驾驶，并以最少的支持人员服务超过2,000名患者。\n\n主要职责包括架构和扩展后端（Node.js、Next.js、TypeScript、PostgreSQL、AWS）、构建LLM代理基础设施、塑造人机协同运营的用户体验、定义患者旅程的世界状态模拟以及设计安全、符合HIPAA的数据管道。理想的候选人具有构建复杂系统的经验，以系统和事件流的方式思考，并且精通或渴望学习LLM。\n\nLegion Health 拥有超过 100 万美元的年度经常性收入，增长迅速，并已筹集了 600 万美元的资金。他们提供塑造人工智能原生心理健康未来，并成为工程文化创始成员的机会。他们正在寻找欣赏清晰架构和速度的个人。该公司提供薪资和股权。"
  },
  {
    "id": "43961908",
    "title": "A community-led fork of Organic Maps",
    "url": "https://www.comaps.app/news/2025-05-12/3/",
    "summary": "A community-led fork of Organic Maps, provisionally named CoMaps, is rapidly developing with the core principles of transparency, community decision-making, non-profit status, open source, and privacy. The project aims to provide a community-driven alternative due to unresolved disagreements between Organic Maps shareholders, leaving the future of Organic Maps uncertain.\n\nCoMaps is focusing on building its technological foundation and preparing for its first release. The community is actively involved in choosing the final project name through voting on Codeberg, which concludes on May 20th.\n\nThe community can get involved in several ways: contributing to development on Codeberg, participating in organizational activities in the Governance repo, spreading awareness, assisting with social media content, helping build the website, and donating through Open Collective.\n\nNegotiations with Organic Maps shareholders have made little progress. Viktor is willing to guarantee not to sell the project, but insists on retaining full control, while the shareholder disagreement remains unresolved. The next update will announce the final project name for CoMaps.\n",
    "chinese_title": "社区主导的Organic Maps分支",
    "chinese_summary": "一个由社区主导的Organic Maps分支，暂命名为CoMaps，正在迅速发展，其核心原则是透明、社区决策、非营利性质、开源和隐私。由于Organic Maps股东之间未解决的分歧，Organic Maps的未来充满不确定性，该项目旨在提供一个社区驱动的替代方案。\n\nCoMaps正在专注于构建其技术基础，并准备首次发布。社区积极参与通过Codeberg上的投票选择最终项目名称，投票将于5月20日结束。\n\n社区可以通过多种方式参与：在Codeberg上参与开发，参与Governance仓库中的组织活动，传播意识，协助社交媒体内容，帮助构建网站，并通过Open Collective捐款。\n\n与Organic Maps股东的谈判进展甚微。Viktor愿意保证不出售该项目，但坚持保留完全控制权，而股东分歧仍未解决。下一次更新将公布CoMaps的最终项目名称。"
  },
  {
    "id": "43964304",
    "title": "Traffic Fatalities Are a Choice",
    "url": "https://asteriskmag.com/issues/10/traffic-fatalities-are-a-choice",
    "summary": "Abi Olvera's article, \"Traffic Fatalities Are a Choice,\" argues that the high rate of traffic-related deaths in the United States is a result of policy choices rather than an inevitability. The US lags significantly behind other developed countries in road safety, with fatality rates far exceeding those of nations like the Netherlands, Sweden, and Spain.\n\nThese safer countries adopted the \"Safe System\" approach, which acknowledges human error and designs roads to mitigate its consequences. This involves physically separating pedestrians from high-speed traffic, slowing down traffic using street design, and creating \"self-explaining\" roads that intuitively guide drivers. Examples include the Netherlands' separated bicycle tracks and woonerfs, and Sweden's 2+1 roads with cable barriers.\n\nWhile some American cities have implemented aspects of Safe System design, such as protected bike lanes and improved intersections, the US lacks a cohesive, national effort. A major obstacle is the control state DOTs have over major roads, often prioritizing free-flowing car traffic over safety and sometimes overruling local safety initiatives. Furthermore, the Manual for Uniform Traffic Control Devices (MUTCD) historically set speed limits based on driver behavior rather than safety.\n\nThe author emphasizes that factors like high car ownership and rural expanse are not insurmountable excuses, as countries like Canada and Finland have similar conditions but lower fatality rates. Overcoming state inertia through stronger federal support and grassroots activism is crucial to achieving Vision Zero, the goal of zero traffic fatalities.\n",
    "chinese_title": "交通事故死亡是一种选择",
    "chinese_summary": "Abi Olvera的文章《交通事故死亡是一种选择》认为，美国高交通事故死亡率是政策选择的结果，而非不可避免的。在道路安全方面，美国显著落后于其他发达国家，死亡率远高于荷兰、瑞典和西班牙等国。\n\n这些更安全的国家采用了“安全系统”方法，该方法承认人为错误，并通过道路设计来减轻其后果。这包括将行人与高速交通物理隔离、通过街道设计减缓交通速度，以及创建直观引导驾驶员的“自我解释”道路。例如，荷兰的分隔自行车道和步行街，以及瑞典的带有缆索护栏的2+1道路。\n\n虽然一些美国城市已经实施了安全系统设计的某些方面，例如受保护的自行车道和改进的交叉路口，但美国缺乏统一的国家级努力。一个主要的障碍是各州交通运输部对主要道路的控制，他们经常优先考虑车辆的畅通，而不是安全，有时甚至否决地方安全倡议。此外，《统一交通控制设备手册》(MUTCD)历来根据驾驶员行为而非安全性来设定速度限制。\n\n作者强调，像高汽车拥有量和广阔的乡村这样的因素并不是不可逾越的借口，因为加拿大和芬兰等国也有类似的条件，但死亡率较低。通过更强大的联邦支持和基层行动主义来克服各州的惰性，对于实现“零愿景”，即零交通事故死亡的目标至关重要。"
  },
  {
    "id": "43963747",
    "title": "Demonstrably Secure Software Supply Chains with Nix",
    "url": "https://nixcademy.com/posts/secure-supply-chain-with-nix/",
    "summary": "This article argues that Nix, a package and dependency manager, provides a powerful solution for achieving demonstrably secure software supply chains, addressing increasing demands from government agencies worldwide for proof of software integrity. It highlights how traditional security measures like air-gapped environments can hinder development and increase costs, while Nix offers a way to prove software origin and integrity without impeding developer workflow.\n\nNix allows organizations to guarantee that a specific set of sources produced an image without third-party interference, track all application sources and toolchains for transparency, and audit outputs by archiving the exact sources of each release. The article details how Nix achieves this by focusing on reproducible builds and fixed-output derivations (FODs).  It demonstrates, using an example GitHub project, how to create a \"source closure\" – a collection of all necessary source packages – that can be exported to an offline, verified system for a complete rebuild from scratch.  This process proves the integrity of the resulting binaries, including compilers and their compilers, exceeding the depth of verification offered by starting with binary distributions.\n\nThe benefits include empowering developers with the latest tools, streamlining compliance for officers, and mitigating supply chain attacks for security professionals. While adopting Nix requires overcoming initial challenges, it transforms compliance into a manageable final verification step, decoupling development from stringent upfront security protocols. Nix makes robust supply chain guarantees a realistic and cheap post-development process.\n",
    "chinese_title": "使用Nix构建可验证的安全软件供应链",
    "chinese_summary": "本文论述了包和依赖管理器 Nix 提供了一个强大的解决方案，以实现可论证的安全软件供应链，从而应对全球政府机构日益增长的软件完整性证明需求。文章强调了传统安全措施（如气隙环境）如何阻碍开发并增加成本，而 Nix 提供了一种在不影响开发者工作流程的情况下证明软件来源和完整性的方法。\n\nNix 允许组织保证特定的一组源代码产生了镜像，且不受第三方干扰；跟踪所有应用程序的来源和工具链以提高透明度；并通过存档每个版本的确切来源来审核输出。文章详细介绍了 Nix 如何通过关注可重现的构建和固定输出推导 (FOD) 来实现这一点。它使用一个 GitHub 项目的例子，展示了如何创建一个“源闭包”（包含所有必需的源包的集合），该闭包可以导出到离线、经过验证的系统，以便从头开始完全重建。这个过程证明了最终二进制文件（包括编译器及其编译器）的完整性，超越了从二进制分发开始所提供的验证深度。\n\n其好处包括为开发人员提供最新的工具，简化合规人员的工作，并为安全专业人员减轻供应链攻击。虽然采用 Nix 需要克服最初的挑战，但它将合规性转变为一个可管理的最终验证步骤，将开发与严格的预先安全协议分离。Nix 使强大的供应链保证成为一个现实且廉价的开发后流程。"
  },
  {
    "id": "43945660",
    "title": "Why GADTs matter for performance (2015)",
    "url": "https://blog.janestreet.com/why-gadts-matter-for-performance/",
    "summary": "Yaron Minsky argues that GADTs (Generalized Algebraic Data Types) are valuable for performance in OCaml, especially in controlling memory representation. He initially dismissed GADTs as relevant only to compiler writers. However, at Jane Street, they've found that GADTs enable memory representation tweaks that would be difficult or unsafe otherwise.\n\nThe core problem is OCaml's uniform memory representation for polymorphic types, which can lead to inefficient space usage. Standard arrays use the same space per element regardless of the element's size.\n\nMinsky demonstrates how to create a `Compact_array` type that uses bytes for characters and a general array otherwise. He first attempts this with a regular variant, which fails to produce the desired type signatures for `get` and `set` functions. He then tries a \"poor-man's object\" approach using closures, but this introduces overhead with allocated closures per `Compact_array`.\n\nHe then rewrites the `Compact_array` using GADTs. By defining the type `'a t` with constructors `Array` and `Bytes`, and specifically typing `Bytes` as `bytes -> char t`, he can enforce the desired type behavior. However, type inference becomes tricky, requiring the use of locally-abstract types to guide the compiler. By annotating the function with a locally abstract type, the compiler can infer that the type is different in different branches of a match statement.\n\nThe resulting GADT-based `Compact_array` provides type-safe access while potentially improving memory efficiency, without the closure overhead. The article concludes that GADTs offer a powerful mechanism for building abstractions with precise control over memory representation, crucial for high-performance applications.\n",
    "chinese_title": "GADTs为何对性能至关重要 (2015)",
    "chinese_summary": "Yaron Minsky认为GADTs（广义代数数据类型）对OCaml的性能很有价值，尤其是在控制内存表示方面。他最初认为GADTs只与编译器编写者相关。然而，在Jane Street，他们发现GADTs能够实现原本难以或不安全实现的内存表示调整。\n\n核心问题是OCaml对多态类型的统一内存表示，这可能导致低效的空间使用。标准数组对每个元素使用相同的空间，而不管元素的大小如何。\n\nMinsky演示了如何创建一个`Compact_array`类型，该类型对字符使用字节，否则使用通用数组。他首先尝试使用常规变体来实现这一点，但未能为`get`和`set`函数生成所需的类型签名。然后，他尝试使用“穷人对象”方法（使用闭包），但这为每个`Compact_array`引入了分配的闭包开销。\n\n然后，他使用GADTs重写了`Compact_array`。通过定义类型`'a t`，并使用构造函数`Array`和`Bytes`，并专门将`Bytes`键入为`bytes -> char t`，他可以强制执行所需的类型行为。但是，类型推断变得棘手，需要使用局部抽象类型来引导编译器。通过使用局部抽象类型注释函数，编译器可以推断出该类型在match语句的不同分支中是不同的。\n\n由此产生的基于GADT的`Compact_array`提供了类型安全的访问，同时可能提高内存效率，而没有闭包开销。文章总结说，GADTs提供了一种强大的机制，可以构建对内存表示进行精确控制的抽象，这对于高性能应用程序至关重要。"
  },
  {
    "id": "43962992",
    "title": "Tailscale 4via6 – Connect Edge Deployments at Scale",
    "url": "https://tailscale.com/blog/4via6-connectivity-to-edge-devices",
    "summary": "This blog post announces Tailscale's 4via6 subnet routing, a solution for connecting complex edge deployments where traditional VPNs struggle due to overlapping IPs, NAT, and strict firewalls. 4via6 allows users to extend Tailscale's mesh network into environments with numerous identical networks, like fleets of robots or edge devices, without the complexities of managing IPs, CIDR ranges, or ports.\n\nTraditional site-to-site VPNs are often unsuitable for these scenarios, as they assume unique CIDR ranges, long-lived connections, and public IPs, which are rarely present in edge deployments. 4via6 addresses these challenges by assigning each connected network a unique identifier, enabling seamless connections and secure remote access.\n\nUse cases include managing robots with multiple IP addressable components, connecting VPCs across different environments or cloud providers with overlapping CIDR ranges, and enabling reproducible testing environments. Benefits include isolating customer deployments, connecting all deployments for a single customer, and providing secure remote access for support teams. Dexory uses 4via6 to securely access their global robot fleet and manage embedded networked devices.\n\nDevices on the network can be accessed using MagicDNS names or IPv6 addresses. 4via6 is available on all Tailscale plans, with enhanced security monitoring on Premium and Enterprise tiers.\n",
    "chinese_title": "Tailscale 4via6 – 大规模连接边缘部署",
    "chinese_summary": "此博文宣布 Tailscale 的 4via6 子网路由，该方案旨在连接复杂的边缘部署，在这些部署中，传统 VPN 会因 IP 重叠、NAT 和严格的防火墙而举步维艰。4via6 允许用户将 Tailscale 的网状网络扩展到具有大量相同网络的环境中，例如机器人或边缘设备群，而无需管理 IP、CIDR 范围或端口的复杂性。\n\n传统的站点到站点 VPN 通常不适用于这些场景，因为它们假定存在唯一的 CIDR 范围、长期连接和公共 IP，而这些在边缘部署中很少存在。4via6 通过为每个连接的网络分配一个唯一标识符来解决这些挑战，从而实现无缝连接和安全的远程访问。\n\n用例包括管理具有多个可寻址 IP 组件的机器人，连接具有重叠 CIDR 范围的不同环境或云提供商的 VPC，以及启用可重现的测试环境。优势包括隔离客户部署、连接单个客户的所有部署以及为支持团队提供安全的远程访问。Dexory 使用 4via6 安全地访问其全球机器人群并管理嵌入式网络设备。\n\n网络上的设备可以使用 MagicDNS 名称或 IPv6 地址访问。4via6 在所有 Tailscale 计划中均可用，并在高级版和企业版中提供增强的安全监控。"
  },
  {
    "id": "43962770",
    "title": "Ruby 3.5 Feature: Namespace on read",
    "url": "https://bugs.ruby-lang.org/issues/21311",
    "summary": "This article describes a proposed new feature for Ruby 3.5 called \"Namespace on Read\" designed to address name conflicts between libraries, prevent unexpected sharing of modules/objects, and potentially enable multiple versions of gems to be required in an application. The feature introduces the concept of virtual top-level namespaces that can independently require/load libraries, separating their dependencies.\n\n\"On read\" means that namespaces are created before requiring/loading code, allowing programmers to control isolation incrementally.  This contrasts with an \"on write\" approach (like Java packages) where the library itself declares the namespace, which the author deems impractical for the Ruby ecosystem.\n\nThe feature distinguishes between \"root\" (built-in classes, modules, constants, and RubyGems) and \"user\" namespaces (for user scripts). User namespaces can be the \"main\" namespace where the primary script executes, or optional namespaces created via `Namespace.new`.  Built-in definitions are copied to user namespaces, while new definitions are isolated.\n\nConstants, class variables, and global variables are also separated by namespace. Methods and procs retain their defined namespace when called from elsewhere. Dynamic link libraries are loaded within namespaces. Built-in classes can be modified within a user namespace via copy-on-write semantics, without affecting the root namespace.\n\nThe feature is initially disabled and enabled via the `RUBY_NAMESPACE=1` environment variable.  Discussion includes potential syntax improvements with a `namespace` keyword for Ruby 4.x, and concerns about how object references and constants are handled during namespace creation (copy-on-write for built-in classes/modules, shared references for other objects).  There is a discussion about the fact that objects created in one namespace will not `is_a?` their class from the main namespace (e.g. `ns1::Date.today.is_a?(Date) # => false`), leading to potential confusion.\n",
    "chinese_title": "Ruby 3.5 新特性：读取时的命名空间",
    "chinese_summary": "本文介绍了一个为 Ruby 3.5 提出的名为“读取时命名空间”的新特性，旨在解决库之间的命名冲突，防止模块/对象的意外共享，并可能允许在一个应用程序中需要多个版本的 gem。该特性引入了虚拟顶层命名空间的概念，这些命名空间可以独立地 require/load 库，从而分离它们的依赖关系。\n\n“读取时”意味着在 require/load 代码之前创建命名空间，允许程序员逐步控制隔离。这与“写入时”方法（如 Java 包）形成对比，后者由库本身声明命名空间，作者认为这对于 Ruby 生态系统来说是不切实际的。\n\n该特性区分了“根”命名空间（内置类、模块、常量和 RubyGems）和“用户”命名空间（用于用户脚本）。用户命名空间可以是主脚本执行的“main”命名空间，也可以是通过 `Namespace.new` 创建的可选命名空间。内置定义会被复制到用户命名空间，而新的定义则被隔离。\n\n常量、类变量和全局变量也按命名空间进行分离。方法和 proc 从其他地方调用时，会保留其定义的命名空间。动态链接库在命名空间内加载。可以通过写时复制语义在用户命名空间中修改内置类，而不会影响根命名空间。\n\n该特性最初处于禁用状态，通过 `RUBY_NAMESPACE=1` 环境变量启用。讨论包括使用 `namespace` 关键字改进 Ruby 4.x 的潜在语法，以及关于在命名空间创建期间如何处理对象引用和常量的担忧（内置类/模块使用写时复制，其他对象使用共享引用）。讨论还包括在一个命名空间中创建的对象将不会 `is_a?` 来自主命名空间的类（例如，`ns1::Date.today.is_a?(Date) # => false`），从而导致潜在的混淆。"
  },
  {
    "id": "43963397",
    "title": "Reviving a Modular Cargo Bike Design from the 1930s",
    "url": "https://www.core77.com/posts/136773/Reviving-a-Modular-Cargo-Bike-Design-from-the-1930s",
    "summary": "This Core77 article discusses the Cyclauto, a cargo bike designed by a French mobility company that revives a modular design from the 1930s by French industrialist Auguste Reymond. Unlike typical cargo bikes with a long frame divided into rider and cargo sections, the Cyclauto positions the rider directly above the front wheel, which they pedal directly, eliminating the chain and reducing maintenance. A three-speed hub is implemented to ease with start up.\n\nA key feature is the detachable cargo-carrying part, similar to a semi-trailer, allowing for various trailer styles to be fitted, creating a modular system for different user needs, including cargo, passenger, or even commercial fixtures like food carts. This two-piece frame also allows the bike to be broken down for easier transport in a car trunk. The company claims a shorter wheelbase provides a tighter turning radius for improved maneuverability in urban settings.\n\nThe article notes that the Cyclauto has been showcased at bike shows, but a production date has not been revealed. Commenters raise concerns about the riding position, steering wheel design lacking leverage, rear brake mechanism, and the temptation to ride only the front wheel.\n",
    "chinese_title": "复兴1930年代的模块化货运自行车设计",
    "chinese_summary": "Core77文章讨论了一款名为Cyclauto的货运自行车，由一家法国移动出行公司设计，它复兴了法国实业家奥古斯特·雷蒙德在1930年代提出的模块化设计。与常见的将车架分为骑行者和货物区域的长车架货运自行车不同，Cyclauto将骑行者直接置于前轮上方，骑行者直接踩踏前轮，无需链条，减少了维护。为了便于启动，采用了三速花鼓。\n\n一个关键特性是可以拆卸的载货部分，类似于半挂车，允许安装各种样式的拖车，从而创建一个满足不同用户需求的模块化系统，包括货物、乘客，甚至商业设施，如餐车。这种两件式车架也允许自行车拆卸，便于放入汽车后备箱运输。该公司声称较短的轴距提供了更小的转弯半径，从而提高了在城市环境中的机动性。\n\n文章指出，Cyclauto已在自行车展上展出，但尚未公布生产日期。评论者提出了对骑行姿势、缺乏杠杆作用的方向盘设计、后刹车机制以及只想骑前轮的诱惑等方面的担忧。"
  },
  {
    "id": "43962427",
    "title": "Show HN: CLI that spots fake GitHub stars, risky dependencies and licence traps",
    "url": "https://github.com/m-ahmed-elbeskeri/Starguard",
    "summary": "StarGuard is a CLI tool designed to automate open-source due diligence by detecting risks associated with GitHub repositories, such as fake star campaigns, dependency hijacking, and license red flags. It analyzes public GitHub data to generate a trust score, offering a fast and scalable alternative to manual reviews.\n\nKey features include:\n\n*   **Star Analysis:** Detects fake stars using burst detection, bot-likeness profiling, and a Fake Star Index.\n*   **Dependency Analysis:** Parses SBOMs/manifests to flag unpinned, shadow, or non-registry dependencies across various package managers (npm, PyPI, Maven, Go, Ruby).\n*   **License Analysis:** Identifies unknown or high-risk licenses like GPL/AGPL in both the repository and its direct dependencies.\n*   **Maintainer Analysis:** Assesses contributor concentration, commit cadence, and inactivity.\n*   **Code Signal Analysis:** Scans for code patterns indicative of obfuscation, remote execution, crypto-mining, or data exfiltration.\n\nStarGuard uses the GitHub API, burst detection algorithms, user profiling, and dependency/license parsers to assess risks. It outputs reports in JSON, Markdown, or plaintext, and can generate star-history plots and shields.io badges.\n\nIt requires Python 3.9+ and a GitHub Personal Access Token for optimal performance. Use cases include CTOs reviewing open-source additions, security teams scheduling scans, VCs performing due diligence, and open-source maintainers promoting transparency. The project is licensed under Apache-2.0 and emphasizes security and privacy by only reading public metadata and performing static analysis.\n",
    "chinese_title": "Show HN: 识别虚假 GitHub 星星、高风险依赖项和许可证陷阱的 CLI 工具",
    "chinese_summary": "StarGuard是一个命令行工具，旨在自动化开源尽职调查，通过检测与GitHub仓库相关的风险，例如虚假刷星活动、依赖劫持和许可证风险信号。它分析公共GitHub数据以生成信任评分，为手动审查提供快速且可扩展的替代方案。\n\n主要功能包括：\n\n*   **星级分析：** 使用突发检测、机器人相似度分析和虚假星级指数检测虚假刷星。\n*   **依赖分析：** 解析SBOM/清单文件，标记各种包管理器（npm、PyPI、Maven、Go、Ruby）中未锁定版本、影子依赖或非注册依赖项。\n*   **许可证分析：** 识别仓库及其直接依赖项中未知或高风险的许可证，如GPL/AGPL。\n*   **维护者分析：** 评估贡献者集中度、提交频率和不活跃性。\n*   **代码信号分析：** 扫描指示混淆、远程执行、加密挖矿或数据泄露的代码模式。\n\nStarGuard使用GitHub API、突发检测算法、用户画像和依赖/许可证解析器来评估风险。它以JSON、Markdown或纯文本格式输出报告，并能生成星级历史图表和shields.io徽章。\n\n它需要Python 3.9+和一个GitHub个人访问令牌才能获得最佳性能。用例包括：CTO审查开源新增内容、安全团队安排扫描、风险投资进行尽职调查，以及开源维护者提高透明度。该项目以Apache-2.0许可授权，并通过仅读取公共元数据和执行静态分析来强调安全性和隐私。"
  },
  {
    "id": "43963839",
    "title": "OpenEoX to Standardize End-of-Life (EOL) and End-of-Support (EOS) Information",
    "url": "https://openeox.org/",
    "summary": "OpenEoX is an initiative aiming to standardize the exchange of End-of-Life (EOL) and End-of-Support (EOS) information across the software and hardware industries, benefiting both vendors and open-source maintainers. It seeks to address inconsistencies in how product lifecycle status is represented, providing a transparent, efficient, and unified approach. Founding members include Cisco, Microsoft, Red Hat, Siemens, BSI, and CISA.\n\nOpenEoX utilizes a machine-readable format, allowing for automation and integration with tools like SBOMs and CSAF/VEX documents, enhancing cybersecurity and vulnerability management by incorporating lifecycle information into security and compliance workflows. Its lightweight and standalone schema enables wide adoption without extensive system overhauls.\n\nThe importance of OpenEoX lies in reducing cybersecurity risks by enabling quicker identification and replacement of unsupported products. It improves vulnerability management through automated tracking of product lifecycles and allows for better decision-making by integrating with security tools. Other benefits include simplified product management, enhanced customer confidence through transparency, and facilitated transitions to new technology solutions. Ultimately, OpenEoX promotes a more secure and efficient IT environment by standardizing EOL and EOS practices.\n",
    "chinese_title": "OpenEoX 旨在标准化产品生命周期结束（EOL）和支持结束（EOS）信息",
    "chinese_summary": "OpenEoX 旨在标准化软硬件行业产品生命周期结束 (EOL) 和支持结束 (EOS) 信息的交换，从而使供应商和开源维护者受益。它致力于解决产品生命周期状态表示不一致的问题，提供透明、高效和统一的方法。创始成员包括思科、微软、红帽、西门子、BSI 和 CISA。\n\nOpenEoX 采用机器可读的格式，允许自动化和与 SBOM 和 CSAF/VEX 文档等工具集成，通过将生命周期信息纳入安全和合规工作流程来增强网络安全和漏洞管理。其轻量级和独立的模式使其能够在无需大规模系统改造的情况下被广泛采用。\n\nOpenEoX 的重要性在于通过更快地识别和更换不受支持的产品来降低网络安全风险。它通过自动跟踪产品生命周期来改进漏洞管理，并通过与安全工具集成来实现更好的决策。其他好处包括简化产品管理、通过透明度增强客户信心以及促进向新技术解决方案的过渡。最终，OpenEoX 通过标准化 EOL 和 EOS 实践来促进更安全高效的 IT 环境。"
  },
  {
    "id": "43962138",
    "title": "Spade Hardware Description Language",
    "url": "https://spade-lang.org/",
    "summary": "Spade is a new hardware description language (HDL) designed to simplify hardware design and reduce errors by incorporating features from modern software programming languages. Key features include language-level support for pipelines via the `reg` keyword, making retiming easier, and a strong type system with structs, arrays, tuples, and enums (including enums with payloads). Pattern matching facilitates clean and comprehensive conditional logic.\n\nSpade offers type inference, reducing the need for explicit type declarations, and emphasizes helpful error messages to aid debugging. It includes tooling like the Swim build tool, cocotb and Verilator support for testing, and VCD translation with Spade type information. Planned features include integer ranges as types, generics with traits, and clock domain awareness.\n\nSpade is under active development at Linköping University and is available for use, though users should expect potential bugs and missing features. The Spade website offers a work-in-progress book and links to a talk providing an overview. The project is open-source and encourages community involvement via Gitlab and Discord. Publications detailing the language's design and features are also available. The compiler is licensed under EUPL-1.2, and the standard library/website under MIT and Apache licenses.\n",
    "chinese_title": "黑桃硬件描述语言",
    "chinese_summary": "Spade：一种新型硬件描述语言，旨在通过融合现代软件编程语言的特性来简化硬件设计并减少错误。其关键特性包括通过`reg`关键字在语言层面支持流水线，使时序调整更加容易，以及具有结构体、数组、元组和枚举（包括带有有效载荷的枚举）的强大类型系统。模式匹配有助于实现清晰且全面的条件逻辑。\n\nSpade提供类型推断，减少了对显式类型声明的需求，并强调有用的错误消息以帮助调试。它包含诸如Swim构建工具之类的工具，支持cocotb和Verilator进行测试，以及具有Spade类型信息的VCD转换。计划中的功能包括作为类型的整数范围、带有特性的泛型以及时钟域感知。\n\nSpade正在林雪平大学积极开发中，并且可以使用，但用户应预期存在潜在的错误和缺失的功能。Spade网站提供了一本正在编写中的书籍以及提供概述的演讲链接。该项目是开源的，并鼓励通过Gitlab和Discord进行社区参与。还提供了详细介绍该语言设计和功能的出版物。编译器在EUPL-1.2下获得许可，标准库/网站在MIT和Apache许可下获得许可。"
  },
  {
    "id": "43964885",
    "title": "Ex-UK Special Forces break silence on 'war crimes' by colleagues",
    "url": "https://www.bbc.com/news/articles/cj3j5gxgz0do",
    "summary": "Former UK Special Forces members have broken their silence, alleging that colleagues committed war crimes in Iraq and Afghanistan. They describe incidents of SAS and SBS troops murdering unarmed people, including children, executing handcuffed detainees, and intentionally killing wounded individuals. These actions, they say, became routine, with \"drop weapons\" planted to cover them up and reports falsified.\n\nThe allegations span over a decade, implicating the SBS for the first time and surpassing the timeframe of the current public inquiry. The veterans accuse some special forces members of exhibiting \"psychopathic traits\" and operating as if \"untouchable.\" One veteran described detainees being searched, handcuffed and shot before a pistol was placed by the body.\n\nThey claim senior commanders were aware of these practices and that a culture of competition around kills existed within the SAS, with some members seeming \"addicted\" to killing. The article alleges that then-Prime Minister David Cameron was repeatedly warned about civilian casualties caused by UK Special Forces during meetings with Afghan President Hamid Karzai, although a spokesperson for Lord Cameron claims the issues raised were about Nato forces in general. The Ministry of Defence stated they are \"fully committed\" to supporting the public inquiry.\n",
    "chinese_title": "前英国特种部队打破沉默，揭露同事犯下的“战争罪行”",
    "chinese_summary": "前英国特种部队成员打破沉默，指控同事在伊拉克和阿富汗犯下战争罪行。他们描述了SAS和SBS部队谋杀手无寸铁的平民（包括儿童）、处决被铐上手铐的被拘留者以及故意杀害受伤人员的事件。他们说，这些行为变得司空见惯，并会“放置武器”掩盖真相，并伪造报告。\n\n这些指控跨越十年以上，首次牵涉到SBS，并且超过了目前公开调查的时间范围。这些退伍军人指责一些特种部队成员表现出“精神病特征”，并表现得“不可触碰”。一位退伍军人描述了搜查、铐上手铐后枪杀被拘留者，然后在尸体旁放置手枪的情况。\n\n他们声称，高级指挥官知道这些行为，并且SAS内部存在一种围绕杀戮的竞争文化，一些成员似乎对杀戮“上瘾”。文章称，时任首相戴维·卡梅伦在与阿富汗总统哈米德·卡尔扎伊的会晤中，曾多次被警告英国特种部队造成平民伤亡，但卡梅伦勋爵的一位发言人声称，提出的问题是关于北约部队的总体情况。国防部表示，他们“完全致力于”支持公开调查。"
  },
  {
    "id": "43961226",
    "title": "Universe expected to decay in 10⁷⁸ years, much sooner than previously thought",
    "url": "https://phys.org/news/2025-05-universe-decay-years-sooner-previously.html",
    "summary": "A new study by researchers at Radboud University suggests the universe will decay much faster than previously thought, estimating its end to be around 10^78 years away. This revised estimate is based on calculations of Hawking-like radiation from various celestial objects, including white dwarfs, neutron stars, and even humans.\n\nThe research, published in the Journal of Cosmology and Astroparticle Physics, builds on a previous paper showing that objects besides black holes can \"evaporate\" via a process similar to Hawking radiation. The researchers calculated the decay time of various objects based on their density in an ideal environment. They found white dwarf stars, the most persistent celestial bodies, will decay in approximately 10^78 years, a significantly shorter time than the previously estimated 10^1100 years.\n\nSurprisingly, neutron stars and stellar black holes were found to have similar decay times of around 10^67 years, despite black holes having stronger gravitational fields. This is attributed to black holes reabsorbing some of their own radiation. The study also calculated the decay time for the Moon and a human, both estimated at 10^90 years, though other factors are acknowledged to likely cause their demise sooner.\n\nThe research highlights the importance of interdisciplinary collaboration between astrophysics, quantum physics, and mathematics in understanding the universe's fundamental processes and potentially unraveling the mystery of Hawking radiation. The lead author of the article is Heino Falcke.\n",
    "chinese_title": "宇宙预计在10⁷⁸年内衰变，比先前认为的要早得多",
    "chinese_summary": "拉德堡德大学一项新研究表明宇宙衰变速度远超预期，预计约在10^78年后终结。这一修正后的估计基于对包括白矮星、中子星甚至人类在内的各种天体发出类霍金辐射的计算。\n\n该研究发表在《宇宙学和天体粒子物理学杂志》上，建立在之前一篇论文的基础上，该论文表明除黑洞之外的物体也可以通过类似于霍金辐射的过程“蒸发”。研究人员根据各种物体在理想环境中的密度计算了它们的衰变时间。他们发现白矮星是持续时间最长的天体，将在大约10^78年后衰变，这比之前估计的10^1100年短得多。\n\n令人惊讶的是，尽管黑洞具有更强的引力场，但中子星和恒星黑洞的衰变时间相似，约为10^67年。这归因于黑洞会重新吸收一部分自身的辐射。该研究还计算了月球和人类的衰变时间，估计均为10^90年，但承认其他因素可能会导致它们更快地消亡。\n\n该研究强调了天体物理学、量子物理学和数学之间的跨学科合作在理解宇宙基本过程以及潜在地揭开霍金辐射之谜方面的重要性。该文章的主要作者是海诺·法尔克。"
  },
  {
    "id": "43962528",
    "title": "The FTC puts off enforcing its 'click-to-cancel' rule",
    "url": "https://www.theverge.com/news/664730/ftc-delay-click-to-cancel-rule",
    "summary": "The FTC is delaying the enforcement of its \"click-to-cancel\" rule, also known as the Negative Option Rule, from May 14th to July 14th, 2025. This rule mandates that companies must make canceling subscriptions as easy as signing up for them. If a customer can sign up online, they must be able to cancel online without additional hurdles.\n\nThe FTC decided to postpone enforcement after reassessing the potential burden on companies to comply by the original deadline. The vote to delay was 3-0, though with only three commissioners present due to two vacancies created by the controversial firing of commissioners in March.\n\nThe FTC has stated that after July 14th, it will fully enforce the rule, requiring regulated entities to be in complete compliance. However, the agency also indicated that it is open to amending the rule if enforcement reveals any unforeseen problems. The core principle remains that canceling subscriptions should be as straightforward as the initial sign-up process.\n",
    "chinese_title": "FTC推迟执行“点击取消”规则",
    "chinese_summary": "美国联邦贸易委员会将“一键取消”规则（又称“否定选择规则”）的执行日期从2024年5月14日推迟至2025年7月14日。该规则要求公司取消订阅的流程必须和注册订阅一样简单。如果消费者可以在网上注册，就必须能够在网上取消，且不得设置额外障碍。\n\n美国联邦贸易委员会在重新评估公司在原定期限内遵守规则的潜在负担后，决定推迟执行。推迟执行的投票结果为3比0，但由于三月份解雇委员引发争议导致出现两个空缺，当时只有三名委员在场。\n\n美国联邦贸易委员会声明，在7月14日之后，将全面执行该规则，要求受监管实体完全合规。 然而，该机构也表示，如果执行过程中发现任何未预见的问题，愿意修改该规则。 核心原则仍然是，取消订阅应与最初的注册过程一样简单直接。"
  },
  {
    "id": "43959403",
    "title": "I ruined my vacation by reverse engineering WSC",
    "url": "https://blog.es3n1n.eu/posts/how-i-ruined-my-vacation/",
    "summary": "The author, es3n1n, recounts their vacation project: reverse engineering the Windows Security Center (WSC) to disable Windows Defender. Inspired by the previous \"no-defender\" project (which was DMCA'd), they aimed for a clean implementation without relying on third-party antivirus software.\n\nInitially, using a COM API, they managed to register a fake AV, but faced access denied errors due to WSC's process validation. The journey involved debugging the WSC service, a challenging task due to the author's use of an M4Pro MacBook and the need for an x86 Windows environment. This led to a convoluted setup involving remote access to a friend's PC (with high latency) and eventually a shadow.tech subscription for a dedicated VM.\n\nThe core issue was WSC validating the caller process using checks for PPL protection, WinDefend SID, elevation, signature, and DllCharacteristics (specifically ForceIntegrity).  The author initially incorrectly believed they needed to impersonate WinDefend. After correcting this error, they identified that by impersonating WinDefend, that WSC would operate on Windows Defender itself, which wouldn't allow disabling Defender. By targeting specific binaries (like Taskmgr.exe) with the required characteristics, they bypassed these checks.\n\nThe author eventually overcame debugging hurdles (invalid AV name, Parsec lag) and successfully created a tool (\"defendnot\") that disables Windows Defender via the WSC API. The conclusion emphasizes the challenging debugging environment and the author's determination to complete the project.\n",
    "chinese_title": "我逆向工程WSC毁了我的假期。",
    "chinese_summary": "作者es3n1n讲述了他们的假期项目：逆向工程Windows安全中心(WSC)以禁用Windows Defender。受到之前被DMCA的“no-defender”项目的启发，他们的目标是进行一个干净的实现，不依赖第三方杀毒软件。\n\n最初，通过使用COM API，他们成功注册了一个虚假的AV，但由于WSC的进程验证，遇到了访问被拒绝的错误。这个过程包括调试WSC服务，这是一个具有挑战性的任务，因为作者使用M4Pro MacBook，并且需要一个x86 Windows环境。这导致了一个复杂的环境设置，包括远程访问朋友的电脑（具有高延迟）以及最终订阅shadow.tech以获得专用VM。\n\n核心问题是WSC使用PPL保护、WinDefend SID、提权、签名和DllCharacteristics（特别是ForceIntegrity）的检查来验证调用者进程。作者最初错误地认为需要模仿WinDefend。纠正这个错误后，他们发现通过模仿WinDefend，WSC将对Windows Defender本身进行操作，这不允许禁用Defender。通过使用所需特征定位特定二进制文件（如Taskmgr.exe），他们绕过了这些检查。\n\n作者最终克服了调试障碍（无效的AV名称、Parsec延迟），并成功创建了一个通过WSC API禁用Windows Defender的工具（“defendnot”）。结论强调了具有挑战性的调试环境以及作者完成项目的决心。"
  },
  {
    "id": "43964201",
    "title": "Show HN: Airweave – Let agents search any app",
    "url": "https://github.com/airweave-ai/airweave",
    "summary": "Airweave is a tool that empowers AI agents to semantically search any application's data. It bridges the gap between agents and various data sources, whether structured or unstructured, by transforming them into agent-ready knowledge via REST and MCP endpoints.\n\nKey features include:\n\n*   **Data Synchronization:** Connects to 25+ sources with minimal configuration.\n*   **Entity Extraction and Transformation:** Provides a pipeline for processing data.\n*   **Semantic Search:** Enables agents to query data based on meaning.\n*   **Other features:** Includes multi-tenancy with OAuth2, incremental updates, versioning, and white-labeling.\n\nAirweave offers SDKs for Python and TypeScript/JavaScript for easy integration. The platform is built on React/TypeScript (frontend), FastAPI (backend), PostgreSQL (metadata), and Qdrant (vector database). Deployment is supported via Docker Compose for development and Kubernetes for production.\n\nThe roadmap includes additional source integrations, Redis worker queues for large-scale syncs, webhooks for event-driven syncs, and Kubernetes support via Helm charts. The project welcomes contributions and is released under the MIT license. You can connect with the Airweave team via Discord, GitHub Issues, or Twitter.\n",
    "chinese_title": "Show HN: Airweave – 让智能体搜索任何应用",
    "chinese_summary": "Airweave：赋能AI代理语义搜索任何应用数据。它通过REST和MCP端点将结构化或非结构化的各种数据源转换为代理可用的知识，弥合了代理与数据源之间的差距。\n\n主要功能包括：\n\n*   **数据同步：** 以最少的配置连接到25+个数据源。\n*   **实体提取和转换：** 提供处理数据的流水线。\n*   **语义搜索：** 使代理能够基于含义查询数据。\n*   **其他功能：** 包括具有OAuth2的多租户、增量更新、版本控制和白标。\n\nAirweave提供Python和TypeScript/JavaScript的SDK，方便集成。该平台构建于React/TypeScript（前端）、FastAPI（后端）、PostgreSQL（元数据）和Qdrant（向量数据库）之上。通过Docker Compose支持开发部署，通过Kubernetes支持生产部署。\n\n路线图包括额外的源集成、用于大规模同步的Redis工作队列、用于事件驱动同步的Webhooks以及通过Helm charts支持Kubernetes。该项目欢迎贡献，并以MIT许可证发布。您可以通过Discord、GitHub Issues或Twitter与Airweave团队联系。"
  },
  {
    "id": "43944526",
    "title": "A Typical Workday at a Japanese Hardware Tool Store [video]",
    "url": "https://www.youtube.com/watch?v=A98jyfB5mws",
    "summary": "This \"article\" is not an article at all; it's a YouTube video title and a list of standard YouTube links and disclaimers. The actual content is missing.\n\nBased solely on the information provided, the video likely showcases a typical workday in a Japanese hardware tool store. Without seeing the video, we can only assume that it would provide insights into the daily operations, customer interactions, and possibly the unique aspects of running such a business in Japan. It's likely a slice-of-life portrayal aiming to give viewers a glimpse into this specific work environment.\n\nThe listed links are boilerplate YouTube content and offer no information about the video itself. They relate to copyright, advertising, terms of service, privacy, and other standard YouTube-related topics.\n",
    "chinese_title": "日本五金工具店的典型工作日 [视频]",
    "chinese_summary": "这篇“文章”根本不是文章；它是一个YouTube视频标题和一些标准的YouTube链接及免责声明。实际内容缺失。\n\n仅根据现有信息，该视频可能展示了日本五金工具店里典型的一天。在没有观看视频的情况下，我们只能推测它会提供关于日常运营、客户互动的信息，以及可能在日本经营此类业务的独特之处。这可能是一个生活片段的写照，旨在让观众了解这种特定的工作环境。\n\n所列出的链接是样板化的YouTube内容，没有提供关于视频本身的任何信息。它们涉及版权、广告、服务条款、隐私以及其他标准的YouTube相关主题。"
  },
  {
    "id": "43927794",
    "title": "Optimizing My Hacker News Experience",
    "url": "https://reorientinglife.substack.com/p/optimizing-my-hacker-news-experience",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "优化我的 Hacker News 体验",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "43943984",
    "title": "Ash (Almquist Shell) Variants",
    "url": "https://www.in-ulm.de/~mascheck/various/ash/",
    "summary": "This document details the history and relationships of Ash (Almquist Shell) variants, tracing their lineage from the original '89 release by Kenneth Almquist, intended as a replacement for the System V Release 4 Bourne shell. It highlights key differences between Ash and the SVR4 shell, such as support for \"$(...)\" command substitution and the `export VAR=value` syntax.\n\nThe document then outlines the evolution of Ash through various BSD distributions (4.3BSD-Net/2, 4.4BSD-Alpha, etc.), 386BSD, BSD/OS, NetBSD, and FreeBSD, noting specific changes and bugfixes in each version. It also covers the early Linux port of NetBSD ash, the development of dash (Debian Almquist Shell), BusyBox, Minix, Cygwin and Android variants derived from NetBSD.\n\nSpecific features and bugs unique to particular versions are identified, allowing for differentiation between variants. This includes the presence or absence of features like command line editing, arithmetic expansion, and the \"type\" built-in. The document also mentions the impact of the license war between AT&T and Berkeley on the development of Ash. The goal is to provide a comprehensive log of source code changes for variants lacking changelogs and to document the relationships between the diverse Ash family.\n",
    "chinese_title": "Ash (Almquist Shell) 变体",
    "chinese_summary": "本文详细介绍了Ash（Almquist Shell）变体的历史和关系，追溯了其从Kenneth Almquist最初于 89 年发布的版本开始的血统，该版本旨在替代System V Release 4 Bourne shell。它重点介绍了Ash和SVR4 shell之间的关键差异，例如对“$(...)”命令替换和`export VAR=value`语法的支持。\n\n然后，本文概述了Ash在各种BSD发行版（4.3BSD-Net/2、4.4BSD-Alpha等）、386BSD、BSD/OS、NetBSD和FreeBSD中的演变，并记录了每个版本中的特定更改和错误修复。它还涵盖了NetBSD ash的早期Linux移植，dash（Debian Almquist Shell）、BusyBox、Minix、Cygwin和从NetBSD衍生的Android变体的开发。\n\n文中还识别了特定版本独有的特性和错误，从而可以区分不同的变体。这包括诸如命令行编辑、算术扩展和“type”内置等功能的有无。本文还提到了AT&T和Berkeley之间的许可战争对Ash开发的影响。目标是为缺乏变更日志的变体提供全面的源代码更改日志，并记录各种Ash家族之间的关系。"
  },
  {
    "id": "43959071",
    "title": "Continuous Thought Machines",
    "url": "https://pub.sakana.ai/ctm/",
    "summary": "This article introduces the Continuous Thought Machine (CTM), a novel neural network architecture that incorporates neural timing and synchronization as foundational elements, drawing inspiration from biological brains. Unlike modern AI systems that abstract away temporal dynamics for efficiency, the CTM embraces them as crucial for achieving more flexible and adaptable intelligence.\n\nThe CTM features a decoupled internal dimension, enabling iterative thought processes independent of data dimensions. Neuron-level models (NLMs) allow each neuron to process a history of incoming signals, considering precise neural timing, unlike static activation functions in standard NNs. Neural synchronization is used as the latent representation for observing and predicting, highlighting neural activity as key to intelligence.\n\nThe authors argue that incorporating time as a central component is essential for AI to rival or surpass human brain capabilities. The CTM uses internal recurrence to unfold neural activity, NLMs to compute post-activations based on pre-activation histories, and synchronization between neurons to represent and interact with data. Input data is processed at each internal tick based on synchronization, influencing predictions. The CTM aims to bridge the gap between efficient modern AI and biologically plausible neural computation. A maze-solving demo is provided to showcase the CTM's capabilities.\n",
    "chinese_title": "连续思维机器",
    "chinese_summary": "本文介绍了一种新型神经网络架构——连续思维机 (CTM)。该架构融合了神经时序和同步作为基础要素，其灵感来源于生物大脑。与为了效率而抽象掉时间动态的现代人工智能系统不同，CTM 认为时间动态对于实现更灵活和适应性强的智能至关重要。\n\nCTM 具有解耦的内部维度，能够实现独立于数据维度的迭代思考过程。神经元级模型 (NLM) 允许每个神经元处理传入信号的历史记录，考虑到精确的神经时序，这与标准神经网络中的静态激活函数不同。神经同步被用作观察和预测的潜在表示，突出了神经活动作为智能的关键。\n\n作者认为，将时间作为核心组成部分对于人工智能赶上或超过人脑能力至关重要。CTM 使用内部递归来展开神经活动，使用 NLM 来基于预激活历史计算后激活，并使用神经元之间的同步来表示数据并与之交互。输入数据根据同步在每个内部时钟周期进行处理，从而影响预测。CTM 旨在弥合高效的现代人工智能与生物学上合理的神经计算之间的差距。文章提供了一个迷宫求解演示来展示 CTM 的能力。"
  },
  {
    "id": "43958898",
    "title": "Intellect-2 Release: The First 32B Model Trained Through Globally Distributed RL",
    "url": "https://www.primeintellect.ai/blog/intellect-2-release",
    "summary": "This article announces the release of INTELLECT-2, a 32B parameter reasoning language model trained using globally distributed reinforcement learning (RL). This differs from traditional centralized training, utilizing a dynamic, heterogeneous network of permissionless compute contributors.\n\nTo achieve this, the Prime Intellect Team built a novel training framework called PRIME-RL, with key components: TOPLOC for verifiable rollouts from untrusted workers and SHARDCAST for efficient policy weight broadcasting. They also modified the standard GRPO training recipe and data filtering techniques to improve training stability and model learning.\n\nThe article highlights the paradigm shift towards decentralized training, leveraging RL's inherent asynchronous nature. INTELLECT-2 uses training data from NuminaMath-1.5, Deepscaler, and SYNTHETIC-1 with a binary task reward and length reward system. Experiments like TARGET-SHORT and TARGET-LONG demonstrate successful communication-computation overlap and improved task rewards. INTELLECT-2 showed performance improvements over QwQ-32B on mathematics and coding benchmarks.\n\nFuture work focuses on increasing the ratio of inference to training compute, implementing tool calls and multi-turn RL, crowdsourcing RL tasks, and model merging via DiLoCo. The team encourages participation in building open-source and decentralized AGI, emphasizing the potential of open-source to outpace closed labs in distributed RL. INTELLECT-2's code and data are open-sourced, and a chat interface is provided for testing.\n",
    "chinese_title": "Intellect-2发布：首个通过全球分布式强化学习训练的32B模型",
    "chinese_summary": "本文宣布发布 INTELLECT-2，一个使用全球分布式强化学习 (RL) 训练的 32B 参数推理语言模型。这不同于传统的集中式训练，它利用一个动态的、异构的、无需许可的计算贡献者网络。\n\n为了实现这一点，Prime Intellect 团队构建了一个名为 PRIME-RL 的新型训练框架，其关键组件包括：用于验证来自不受信任的 Worker 的 rollouts 的 TOPLOC，以及用于高效策略权重广播的 SHARDCAST。他们还修改了标准的 GRPO 训练配方和数据过滤技术，以提高训练的稳定性和模型学习。\n\n本文重点介绍了向去中心化训练的范式转变，利用了 RL 固有的异步特性。INTELLECT-2 使用来自 NuminaMath-1.5、Deepscaler 和 SYNTHETIC-1 的训练数据，采用二进制任务奖励和长度奖励系统。TARGET-SHORT 和 TARGET-LONG 等实验证明了成功的通信-计算重叠和改进的任务奖励。INTELLECT-2 在数学和编码基准测试中表现出优于 QwQ-32B 的性能改进。\n\n未来的工作重点是提高推理与训练计算的比率，实施工具调用和多轮 RL，众包 RL 任务，以及通过 DiLoCo 进行模型合并。该团队鼓励参与构建开源和去中心化的 AGI，强调开源在分布式 RL 中超越封闭实验室的潜力。INTELLECT-2 的代码和数据已开源，并提供了一个聊天界面用于测试。"
  },
  {
    "id": "43943673",
    "title": "Continuous glucose monitors reveal variable glucose responses to the same meals",
    "url": "https://examine.com/research-feed/study/1jjKq1/",
    "summary": "Here's a summary of the article based on the title provided and assuming the article reports on a study about continuous glucose monitors (CGMs) and their use in understanding glucose response to meals:\n\n**Summary:**\n\nThe article, \"Continuous glucose monitors reveal variable glucose responses to the same meals,\" likely discusses a study that explored the use of continuous glucose monitors (CGMs) to track individual blood glucose responses to standardized meals. The core finding is that individuals exhibit surprisingly **variable glucose responses even when consuming the *same* meals**.\n\nThe study probably highlights that factors beyond the macronutrient composition of a meal (carbohydrates, fats, proteins) influence blood glucose levels. These factors may include individual differences in gut microbiome composition, timing of food intake, prior diet, physical activity levels, sleep patterns, stress levels, and individual metabolic differences. CGMs provide a granular and real-time view of these responses, uncovering variations that would be missed by traditional finger-prick testing, which only offers snapshots in time.\n\nThe implications of the study likely suggest that a \"one-size-fits-all\" approach to dietary recommendations for blood sugar control may be inadequate. The findings support the concept of personalized nutrition, where dietary advice is tailored to an individual's unique metabolic response to specific foods. Furthermore, the study probably underscores the value of using CGMs to empower individuals to understand their own glucose responses and make informed dietary choices to optimize their blood sugar management and overall health. The study probably also mentioned limitations, such as the sample size and participant characteristics, that limit the generalizability of the findings.\n",
    "chinese_title": "连续血糖监测仪揭示了对相同膳食的不同血糖反应",
    "chinese_summary": "**摘要：**\n\n文章《持续血糖监测仪揭示相同膳食引起的血糖反应差异》可能讨论了一项研究，该研究探索了使用持续血糖监测仪（CGM）来追踪个体对标准化膳食的血糖反应。其核心发现是，即使**食用*相同*的膳食，个体也会表现出惊人的血糖反应差异**。\n\n该研究可能强调了膳食中的宏量营养素组成（碳水化合物、脂肪、蛋白质）以外的因素也会影响血糖水平。这些因素可能包括肠道微生物群组成、进食时间、先前的饮食、身体活动水平、睡眠模式、压力水平以及个体代谢差异。CGM提供了这些反应的精细和实时视图，揭示了传统指尖采血测试（仅提供时间点的快照）会错过的变化。\n\n该研究的意义可能表明，针对血糖控制的“一刀切”的膳食建议可能是不够的。该研究结果支持个性化营养的概念，即膳食建议应根据个体对特定食物的独特代谢反应进行调整。此外，该研究可能强调了使用CGM来帮助个体了解自身血糖反应并做出明智的饮食选择，从而优化其血糖管理和整体健康的价值。该研究可能还提到了局限性，例如样本量和参与者特征，这些局限性限制了研究结果的普遍性。"
  },
  {
    "id": "43960577",
    "title": "Armbian Updates: OMV support, boot improvents, Rockchip optimizations",
    "url": "https://www.armbian.com/newsflash/armbian-updates-nas-support-lands-boot-systems-improve-and-rockchip-optimizations-arrive/",
    "summary": "This Armbian update brings several key improvements focusing on usability, hardware support, and system optimization. Most notably, OpenMediaVault (OMV) is now directly installable through Armbian's configuration tool, providing a simplified way to turn single-board computers into NAS devices.\n\nUsability improvements include removing an unnecessary \"Disable Wireless Hotspot?\" prompt, streamlining the initial setup process.\n\nHardware advancements include the Orange Pi 5 Max now booting using mainline U-Boot for easier updates and kernel integration. The PocketBeagle2 also transitioned to extlinux for boot configuration, aligning with Armbian's standardization.\n\nRockchip64 platforms receive enhanced power management with the addition of missing Operating Performance Points (OPPs) for better energy efficiency and stability. Outdated wireless firmware workarounds were also removed, as upstream drivers now resolve previous compatibility issues.\n\nFinally, the Armbian team continues to refine its infrastructure by removing deprecated artifacts and preparing for testing initiatives to validate new features like OMV across supported devices. Documentation for OpenMediaVault and other software is available in the Armbian Software User Guide.\n",
    "chinese_title": "Armbian更新：OMV支持、启动改进、瑞芯微优化",
    "chinese_summary": "本次Armbian更新带来多项关键改进，重点在于易用性、硬件支持和系统优化。最值得注意的是，OpenMediaVault (OMV) 现在可以直接通过 Armbian 的配置工具安装，从而简化了将单板计算机转变为 NAS 设备的过程。\n\n易用性改进包括删除不必要的“禁用无线热点？”提示，从而简化了初始设置过程。\n\n硬件方面的提升包括 Orange Pi 5 Max 现在可以使用主线 U-Boot 启动，从而更容易进行更新和内核集成。PocketBeagle2 也已过渡到 extlinux 进行启动配置，与 Armbian 的标准化保持一致。\n\nRockchip64 平台通过添加缺失的 Operating Performance Points (OPPs) 增强了电源管理，从而提高了能源效率和稳定性。此外，还移除了过时的无线固件解决方法，因为上游驱动程序现在可以解决以前的兼容性问题。\n\n最后，Armbian 团队继续完善其基础设施，移除了已弃用的组件，并准备进行测试，以验证新功能（例如 OMV）在受支持设备上的运行情况。OpenMediaVault 和其他软件的文档可在 Armbian 软件用户指南中找到。"
  },
  {
    "id": "43961597",
    "title": "Implicit UVs: Real-time semi-global parameterization of implicit surfaces [pdf]",
    "url": "https://baptiste-genest.github.io/papers/implicit_uvs.pdf",
    "summary": "The article \"Implicit UVs: Real-time semi-global parameterization of implicit surfaces\" presents a method for generating UV coordinates on implicit surfaces in real-time. Implicit surfaces, defined by an equation rather than explicit geometry, pose a challenge for texture mapping due to the lack of inherent parameterization.\n\nThe key idea is to compute a *semi-global* parameterization by solving a Poisson equation on the surface. This approach aims for a smooth, low-distortion UV map over a significant portion of the surface, rather than strictly local and potentially inconsistent parameterizations. The method leverages the implicit surface definition to efficiently calculate the necessary differential operators (Laplacian, gradient) directly on the surface.\n\nThe pipeline involves: 1) discretizing the implicit surface using a marching cubes-like algorithm; 2) defining boundary conditions for the UV coordinates on a small portion of the surface; 3) solving the Poisson equation to propagate the UV coordinates smoothly across the discretized surface; and 4) using these UV coordinates for texture mapping.\n\nA significant advantage is real-time performance. By precomputing certain components and using efficient numerical solvers on the GPU, the UV coordinate generation can be achieved interactively. The authors demonstrate the method on various implicit surfaces and show that the resulting texture mapping is smooth, continuous, and minimizes distortion. This facilitates the use of textures and materials on implicit surfaces in interactive applications, such as sculpting tools or games.\n",
    "chinese_title": "隐式UV：隐式曲面的实时半全局参数化 [pdf]",
    "chinese_summary": "文章《隐式UV：隐式表面的实时半全局参数化》提出了一种在隐式表面上实时生成UV坐标的方法。隐式表面由方程而非显式几何定义，由于缺乏固有的参数化，因此对纹理映射提出了挑战。\n\n其核心思想是通过在表面上求解泊松方程来计算*半全局*参数化。这种方法旨在在表面的重要部分上获得平滑、低失真的UV贴图，而不是严格的局部和可能不一致的参数化。该方法利用隐式表面定义来有效地直接在表面上计算必要的微分算子（拉普拉斯算子、梯度）。\n\n该流程包括：1）使用类似Marching Cubes的算法离散化隐式表面；2）在表面的一小部分上定义UV坐标的边界条件；3）求解泊松方程以在离散化表面上平滑地传播UV坐标；以及4）使用这些UV坐标进行纹理映射。\n\n一个显著的优点是实时性能。通过预计算某些组件并在GPU上使用高效的数值求解器，可以交互式地实现UV坐标的生成。作者在各种隐式表面上演示了该方法，并表明生成的纹理映射是平滑的、连续的并且最小化了失真。这有助于在交互式应用（如雕刻工具或游戏）中在隐式表面上使用纹理和材质。"
  },
  {
    "id": "43962207",
    "title": "CrowdStrike CEO cuts his voting power by 92% with unexplained gifts",
    "url": "https://www.bloomberg.com/news/articles/2025-05-12/billionaire-crowdstrike-ceo-cuts-voting-power-by-92-with-unexplained-gifts",
    "summary": "CrowdStrike CEO George Kurtz has significantly reduced his voting power in the company through a series of transactions, culminating in a recent disclosure of gifting over $1 billion worth of stock to undisclosed recipients. This has slashed his voting influence from 31% in 2022 to a mere 2.5%, according to the company's latest proxy statement. The article highlights the unusual nature of this move for a tech founder, as it substantially diminishes his control over CrowdStrike. The gifts were discovered through Bloomberg Terminal research.\n",
    "chinese_title": "CrowdStrike CEO通过未解释的赠与行为削减92%的投票权",
    "chinese_summary": "CrowdStrike CEO乔治·库尔茨通过一系列交易大幅降低了其在公司的投票权，最近披露的向未公开的接受者赠送价值超过10亿美元的股票，最终导致他的投票影响力从2022年的31%降至仅2.5%（根据公司最新的委托书声明）。 文章强调了对于一位科技创始人来说，这一举动的非同寻常性，因为它大大削弱了他对CrowdStrike的控制权。 这些赠与是通过彭博终端研究发现的。"
  },
  {
    "id": "43931237",
    "title": "Making PyPI's test suite faster",
    "url": "https://blog.trailofbits.com/2025/05/01/making-pypis-test-suite-81-faster/",
    "summary": "This article details how Trail of Bits significantly improved the performance of PyPI's Warehouse test suite, reducing execution time from 163 seconds to 30 seconds while increasing the test count from 3,900 to over 4,700. The primary optimizations included:\n\n1.  **Parallelizing test execution using `pytest-xdist`:** This delivered the most significant gain (67% reduction) by distributing tests across multiple CPU cores. Challenges like database fixture isolation and coverage reporting were addressed.\n2.  **Optimizing coverage with Python 3.12's `sys.monitoring`:** Leveraging the lightweight monitoring API in `coverage.py` resulted in a 53% reduction in test execution time.\n3.  **Accelerating test discovery with `testpaths`:** Configuring `pytest` to focus on specific test directories reduced test collection time by 66%.\n4.  **Removing unnecessary import overhead:** Identifying and removing unused dependencies like `ddtrace` provided a small but meaningful improvement.\n\nThe article also discusses an experiment with database migration squashing, which was ultimately deemed too complex to implement despite performance benefits. The author emphasizes that optimizing test performance is vital for security, encouraging frequent testing and enabling developers to catch issues earlier. The article concludes with practical advice for improving test suite performance, including prioritizing parallelization, optimizing coverage instrumentation, speeding up test discovery, and eliminating unnecessary imports.\n",
    "chinese_title": "加快 PyPI 的测试套件速度",
    "chinese_summary": "本文详细介绍了Trail of Bits如何显著提升PyPI的Warehouse测试套件性能，将执行时间从163秒缩短到30秒，同时将测试数量从3900个增加到4700多个。 主要优化包括：\n\n1.  **使用`pytest-xdist`并行执行测试：** 这是最显著的改进（减少了67%），通过将测试分布到多个CPU核心上实现。 解决了数据库fixture隔离和覆盖率报告等挑战。\n2.  **使用Python 3.12的`sys.monitoring`优化覆盖率：** 利用`coverage.py`中的轻量级监控API，测试执行时间减少了53%。\n3.  **使用`testpaths`加速测试发现：** 配置`pytest`以专注于特定的测试目录，从而将测试收集时间减少了66%。\n4.  **消除不必要的导入开销：** 识别并删除未使用的依赖项，如`ddtrace`，提供了一个虽小但有意义的改进。\n\n本文还讨论了数据库迁移压缩的实验，尽管有性能优势，但最终因实施过于复杂而被放弃。 作者强调优化测试性能对于安全性至关重要，鼓励频繁测试，使开发人员能够更早地发现问题。文章最后提出了提高测试套件性能的实用建议，包括优先考虑并行化、优化覆盖率检测、加速测试发现和消除不必要的导入。"
  },
  {
    "id": "43957010",
    "title": "Why Bell Labs Worked",
    "url": "https://1517.substack.com/p/why-bell-labs-worked",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "贝尔实验室为何成功",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "43954896",
    "title": "Plain Vanilla Web",
    "url": "https://plainvanillaweb.com/index.html",
    "summary": "This website, \"Plain Vanilla Web,\" explores building websites and web applications using only standard web technologies (HTML, CSS, and JavaScript) without frameworks or build tools. It champions a \"plain vanilla\" approach, leveraging modern browser standards to achieve long-term simplicity and minimal maintenance, contrasting it with the complexities and maintenance demands of framework-driven development.\n\nThe site focuses on four key areas:\n\n*   **Components:** Using Web Components to create reusable building blocks, similar to React or Vue components, but without a framework.\n*   **Styling:** Utilizing modern CSS features to replace the functionalities provided by CSS Modules, PostCSS, or SASS.\n*   **Sites:** Developing and deploying web projects using Web Components, achieving production-readiness without build tools or server-side logic.\n*   **Applications:** Constructing single-page applications (SPAs) with vanilla JavaScript techniques, including routing and state management.\n\nThe tutorial assumes a solid understanding of HTML, CSS, and JavaScript and is not suitable for complete beginners. It contrasts the speed and richness of framework-based development with the simplicity and long-term benefits of the plain vanilla approach. The author argues that today's browser support for web standards makes this a viable and attractive option for some projects.\n",
    "chinese_title": "纯粹的Web",
    "chinese_summary": "\"Plain Vanilla Web\"网站探索仅使用标准Web技术（HTML、CSS和JavaScript），不借助框架或构建工具来构建网站和Web应用程序。它提倡一种“纯粹”的方式，利用现代浏览器标准来实现长期的简洁性和最小的维护成本，这与框架驱动开发的复杂性和维护需求形成对比。\n\n该网站专注于四个关键领域：\n\n*   **组件：** 使用Web Components创建可重用的构建块，类似于React或Vue组件，但不依赖框架。\n*   **样式：** 利用现代CSS特性来替代CSS Modules、PostCSS或SASS提供的功能。\n*   **站点：** 使用Web Components开发和部署Web项目，无需构建工具或服务器端逻辑即可实现生产就绪。\n*   **应用：** 使用原生JavaScript技术构建单页应用程序（SPA），包括路由和状态管理。\n\n本教程假定读者对HTML、CSS和JavaScript有扎实的理解，不适合完全的初学者。它将基于框架的开发的快速性和丰富性与纯粹方式的简单性和长期优势进行了对比。作者认为，如今浏览器对Web标准的支持使这种方法成为某些项目的可行且有吸引力的选择。"
  },
  {
    "id": "43964819",
    "title": "Google Worried It Couldn't Control How Israel Uses Project Nimbus, Files Reveal",
    "url": "https://theintercept.com/2025/05/12/google-nimbus-israel-military-ai-human-rights/",
    "summary": "This article from The Intercept reveals that Google was aware of the potential for its Project Nimbus cloud computing services to be used by Israel in ways that could facilitate human rights violations against Palestinians, even to the point of potentially contributing to war crimes. An internal report acknowledged the risk and Google's limited ability to monitor or prevent such misuse, as the contract grants Israel significant control and restricts Google's oversight.\n\nA third-party consultant recommended withholding AI and machine learning tools due to these risks. The report also indicates that Google might be obligated to stonewall external investigations into Israel's use of the technology. The deal requires close collaboration with Israeli security agencies, including intelligence sharing, unprecedented in Google's other deals.\n\nInternational law experts suggest that Google's awareness and inability to conduct due diligence could expose the company to legal liability, especially given the ongoing conflict in Gaza and shareholder concerns. While Google claims it has clear terms of service, the article highlights conflicting information suggesting Israel operates under a secret amended policy. The article argues that Google's provision of computing services to Israel Aerospace Industries and the Israel Land Authority (involved in the West Bank occupation) could further complicate legal accountability. Experts suggest that if Project Nimbus is directly tied to war crimes, Google executives could potentially face criminal liability, though civil lawsuits are more likely.\n",
    "chinese_title": "谷歌担心无法控制以色列如何使用Nimbus项目，文件显示",
    "chinese_summary": "Intercept 披露，谷歌早已知晓其“尼姆布斯项目”云计算服务可能被以色列以助长侵犯巴勒斯坦人人权的方式使用，甚至可能促成战争罪行。一份内部报告承认了这一风险，以及谷歌对这种滥用的监控和预防能力有限，因为该合同赋予以色列重大控制权，并限制了谷歌的监督权。\n\n第三方顾问建议因这些风险而暂缓提供人工智能和机器学习工具。报告还表明，谷歌可能有义务阻止对以色列使用该技术的外部调查。该协议要求与以色列安全机构密切合作，包括情报共享，这在谷歌的其他交易中是前所未有的。\n\n国际法专家认为，谷歌的知情和无力进行尽职调查可能会使该公司面临法律责任，尤其是在加沙持续冲突和股东担忧的情况下。虽然谷歌声称其服务条款明确，但该文章强调了相互矛盾的信息，表明以色列在秘密修改后的政策下运作。该文章认为，谷歌向以色列航空航天工业公司和以色列土地管理局（参与西岸占领）提供计算服务可能会进一步使法律责任复杂化。专家认为，如果“尼姆布斯项目”与战争罪行直接相关，谷歌高管可能会面临刑事责任，但民事诉讼的可能性更大。"
  },
  {
    "id": "43955525",
    "title": "Car companies are in a billion-dollar software war",
    "url": "https://insideevs.com/features/759153/car-companies-software-companies/",
    "summary": "The automotive industry is embroiled in a costly and complex \"software war\" as legacy automakers struggle to transition to software-defined vehicles (SDVs), a concept pioneered by Tesla. SDVs, characterized by centralized computing, over-the-air updates, and greater flexibility, offer significant advantages like reduced costs and improved user experiences, but the shift is proving challenging.\n\nMany automakers, including Ford, GM, and VW, have faced setbacks and delays in developing their SDV platforms. GM's launch of several EV models were plagued by software issues, while VW's Cariad software division has been a \"clusterf---,\" leading them to outsource crucial software tasks. Ford is scaling back on their FNV4 project. The core issue is that these companies must overhaul their organizational approach to software, transitioning from viewing it as a problem to solve to a design to be experienced. This requires merging safety-first mindsets with a faster, more creative development process.\n\nTesla, Rivian, Lucid, and many Chinese automakers have a head start with ground-up SDV systems. GM, despite some consumer backlash, appears to be making progress in comparison to its legacy peers. BMW and Mercedes are also approaching the launch of their SDV platforms. Japanese and Korean companies are behind the curve. The ultimate goal is for a legacy automaker to successfully transform into a true software company, proving that established hardware brands can adapt to the software-driven future of the automotive industry.\n",
    "chinese_title": "汽车公司正陷入一场十亿美元的软件战",
    "chinese_summary": "汽车行业正陷入一场代价高昂且复杂的“软件战争”，传统汽车制造商正努力转型为软件定义汽车（SDV），这一概念由特斯拉率先提出。SDV以集中式计算、空中更新和更高的灵活性为特征，具有降低成本和改善用户体验等显著优势，但这种转变极具挑战性。\n\n包括福特、通用汽车和大众汽车在内的许多汽车制造商在开发其SDV平台方面都面临挫折和延误。通用汽车几款电动汽车的推出受到软件问题的困扰，而大众汽车的Cariad软件部门一直是一团糟，导致他们将关键软件任务外包。福特正在缩减其FNV4项目。核心问题在于，这些公司必须彻底改革其对软件的组织方法，将软件从视为需要解决的问题转变为需要体验的设计。这需要将安全至上的心态与更快、更具创造性的开发过程相结合。\n\n特斯拉、Rivian、Lucid和许多中国汽车制造商在从头开始构建SDV系统方面具有领先优势。尽管受到一些消费者的强烈反对，但与传统同行相比，通用汽车似乎正在取得进展。宝马和梅赛德斯也即将推出他们的SDV平台。日本和韩国公司则落后于这一趋势。最终目标是让一家传统汽车制造商成功转型为真正的软件公司，证明成熟的硬件品牌可以适应汽车行业软件驱动的未来。"
  },
  {
    "id": "43962535",
    "title": "Gig Companies Violate Workers Rights",
    "url": "https://www.hrw.org/news/2025/05/12/us-major-companies-violate-gig-workers-rights",
    "summary": "Human Rights Watch released a report exposing how major gig companies in the US, including Amazon Flex, DoorDash, Instacart, Lyft, Shipt, Favor and Uber, misclassify workers as independent contractors, denying them basic labor rights and protections. The report, based on interviews and surveys of gig workers in Texas and other states, reveals that these companies exploit workers through algorithmic control, low wages, and a lack of transparency.\n\nThe companies claim to offer flexibility, but in reality, algorithms dictate job assignments, wages, and even terminations, often without clear explanation. Workers struggle to understand how they are paid and lack recourse to challenge decisions. Many earn below minimum wage after expenses, struggling to afford basic necessities like housing and food. The report found that Texas workers surveyed earned nearly 30 percent below the federal minimum wage and about 70 percent below what the Massachusetts Institute of Technology estimates is a living wage in Texas.\n\nDespite the economic insecurity faced by gig workers, these companies are generating billions in revenue and are valued at billions more. By classifying workers as independent contractors, they avoid paying for benefits like Social Security, Medicare, and unemployment insurance, depriving public funds. Human Rights Watch calls on US and state authorities to take action to protect gig workers' rights, ensure workplace safety, and allow them to unionize, urging the International Labour Organization to establish global standards for platform work. They emphasize that these companies are creating a workforce without the rights and protections workers have fought for decades to achieve.\n",
    "chinese_title": "零工公司侵犯工人权益",
    "chinese_summary": "人权观察发布报告，揭露包括亚马逊Flex、DoorDash、Instacart、Lyft、Shipt、Favor和Uber在内的美国主要零工平台公司如何将工人错误归类为独立承包商，剥夺其基本劳动权利和保障。该报告基于对得克萨斯州和其他州的零工工人的访谈和调查，揭示这些公司通过算法控制、低工资和缺乏透明度来剥削工人。\n\n这些公司声称提供灵活性，但实际上，算法决定了工作分配、工资甚至解雇，而且往往没有明确的解释。工人难以理解他们的工资计算方式，也缺乏质疑决定的途径。许多人在扣除费用后收入低于最低工资，难以负担住房和食物等基本生活必需品。报告发现，接受调查的得克萨斯州工人收入比联邦最低工资低近30%，比麻省理工学院估计的得克萨斯州生活工资低约70%。\n\n尽管零工工人面临经济上的不稳定，这些公司却创造了数十亿美元的收入，估值更高达数十亿美元。通过将工人归类为独立承包商，他们避免支付社会保障、医疗保险和失业保险等福利，从而剥夺了公共资金。人权观察呼吁美国和州政府采取行动，保护零工工人的权利，确保工作场所安全，并允许他们组织工会，同时敦促国际劳工组织制定平台工作的全球标准。他们强调，这些公司正在创造一支没有工人奋斗数十年才获得的权利和保障的劳动力。"
  },
  {
    "id": "43922341",
    "title": "Absolute Zero Reasoner",
    "url": "https://andrewzh112.github.io/absolute-zero-reasoner/",
    "summary": "This document presents code samples generated by various language models (LLMs) in response to the prompt: \"Write a script that shows 10 balls bouncing inside a spinning hexagon. The balls should be affected by gravity and friction, and must bounce off the rotating walls realistically.\" The code samples are from models like AZR-Coder-14b, GPT-4o-mini, Qwen2.5-72B-Instruct, Qwen2.5-32B-Instruct, and Qwen2.5-14B-Instruct.\n\nEach code snippet aims to create a Pygame-based simulation. They initialize Pygame, set up the screen, define colors and constants like gravity and friction, and create ball objects with random initial positions and velocities. The core of each script involves drawing a rotating hexagon and updating the ball positions based on physics (gravity, friction) and collision detection with the hexagon walls and screen edges. When a collision occurs, the ball's velocity is reflected to simulate a bounce. The main game loop updates the positions, checks for collisions, and redraws the scene.\n\nThe AZR interface itself allows users to explore and compare code generated by different models, embedded using `jina-embeddings-v2-base-code` and projected into a 2D space using UMAP. Users can hover over points to view associated programs and click to lock selections. Configuration details like temperature and top_p are provided for some of the model runs.\n",
    "chinese_title": "绝对零度推理者",
    "chinese_summary": "本文档展示了各种语言模型（LLM）针对以下提示生成的代码示例：“编写一个脚本，展示10个球在一个旋转的六边形内弹跳。这些球应受到重力和摩擦力的影响，并且必须以真实的方式从旋转的墙壁上弹开。” 代码示例来自AZR-Coder-14b、GPT-4o-mini、Qwen2.5-72B-Instruct、Qwen2.5-32B-Instruct和Qwen2.5-14B-Instruct等模型。\n\n每个代码片段都旨在创建一个基于Pygame的模拟。它们初始化Pygame，设置屏幕，定义颜色和常量（如重力和摩擦力），并创建具有随机初始位置和速度的球对象。每个脚本的核心包括绘制一个旋转的六边形，并根据物理定律（重力、摩擦力）以及与六边形墙壁和屏幕边缘的碰撞检测来更新球的位置。当发生碰撞时，球的速度会发生反射，以模拟弹跳。主游戏循环更新位置、检查碰撞并重绘场景。\n\nAZR界面本身允许用户探索和比较不同模型生成的代码，这些代码使用`jina-embeddings-v2-base-code`嵌入，并使用UMAP投影到二维空间中。用户可以将鼠标悬停在点上以查看相关的程序，然后单击以锁定选择。对于某些模型运行，会提供诸如温度和top_p之类的配置详细信息。"
  },
  {
    "id": "43954488",
    "title": "High-school shop students attract skilled-trades job offers",
    "url": "https://www.wsj.com/lifestyle/careers/skilled-trades-high-school-recruitment-fd9f8257",
    "summary": "Okay, here's a summary based on the information I can gather about similar WSJ articles on the topic, and what the URL suggests:\n\n**Summary:**\n\nThe Wall Street Journal article \"High-school shop students attract skilled-trades job offers\" highlights the growing demand for skilled tradespeople and the increasingly aggressive recruitment efforts targeting high school students. Facing a severe labor shortage, companies in fields like construction, manufacturing, and automotive repair are actively seeking young talent straight out of vocational programs.\n\nThe article likely discusses how companies are partnering with high schools, offering apprenticeships, internships, and even signing bonuses to attract students with specialized skills in areas like welding, machining, electrical work, and plumbing. These programs provide students with valuable hands-on experience and a clear pathway to well-paying jobs immediately after graduation, often avoiding the need for expensive and time-consuming four-year college degrees.\n\nThe article likely contrasts this trend with the traditional emphasis on college preparation, pointing out the growing recognition of the value and earning potential of skilled trades. It might also discuss the stigma sometimes associated with vocational careers and efforts to rebrand them as viable and respected professional paths. Factors contributing to the increased demand include the aging workforce, technological advancements requiring skilled technicians, and a decline in vocational training programs over the years. Finally, the article probably contains examples of students who have successfully transitioned from high school shop classes to promising careers in the skilled trades.\n",
    "chinese_title": "高中职业学校学生备受技术行业工作邀约青睐",
    "chinese_summary": "好的，以下是根据我能收集到的关于华尔街日报类似主题文章的信息以及URL的暗示所做的总结：\n\n**概要：**\n\n《华尔街日报》文章“高中技工学生吸引技术行业工作机会”突显了对技术工人的日益增长的需求，以及针对高中学生的日益激烈的招聘活动。由于面临严重的劳动力短缺，建筑、制造和汽车维修等领域的公司正积极寻找直接从职业课程毕业的年轻人才。\n\n这篇文章可能讨论了公司如何与高中合作，提供学徒制、实习机会，甚至签约奖金，以吸引在焊接、机械加工、电气工作和管道等领域拥有专门技能的学生。这些项目为学生提供宝贵的实践经验，以及毕业后立即获得高薪工作的明确途径，通常避免了昂贵且耗时的四年制大学学位。\n\n这篇文章可能将这一趋势与传统的大学预备教育重点进行对比，指出人们越来越认识到技术行业的价值和盈利潜力。它也可能讨论有时与职业生涯相关的污名，以及将它们重新塑造为可行且受人尊敬的职业道路的努力。导致需求增加的因素包括劳动力老龄化、需要熟练技术人员的技术进步，以及多年来职业培训项目的减少。最后，这篇文章可能包含学生成功从高中技工课程过渡到技术行业有前途的职业的例子。"
  },
  {
    "id": "43955842",
    "title": "Scraperr – A Self Hosted Webscraper",
    "url": "https://github.com/jaypyles/Scraperr",
    "summary": "Scraperr is a self-hosted web scraping application that allows users to extract data from websites using XPath selectors. It offers a clean interface for managing scraping jobs, viewing results, and exporting data.\n\nKey features include precise XPath-based extraction, queue management for multiple jobs, domain spidering, custom headers, media downloads, structured data visualization, and data export in various formats. Scraperr also supports completion notifications through various channels.\n\nThe application emphasizes responsible scraping practices, urging users to respect robots.txt, adhere to website Terms of Service, and implement rate limiting to avoid overloading servers. It explicitly states that Scraperr should only be used on websites that permit scraping and disclaims responsibility for misuse.\n\nThe project is licensed under the MIT License and encourages contributions. Development can be started by running `make build up-dev`.\n",
    "chinese_title": "Scraperr – 自托管网页抓取器",
    "chinese_summary": "Scraperr是一款自托管的网络爬虫应用程序，允许用户使用XPath选择器从网站提取数据。它提供了一个简洁的界面来管理爬取任务、查看结果和导出数据。\n\n主要功能包括：基于精确XPath的提取、多任务队列管理、域名爬取、自定义标头、媒体下载、结构化数据可视化，以及多种格式的数据导出。Scraperr还支持通过各种渠道发送完成通知。\n\n该应用程序强调负责任的爬取行为，敦促用户遵守robots.txt、遵守网站服务条款，并实施速率限制以避免服务器过载。它明确声明Scraperr应仅用于允许爬取的网站，并且不对滥用行为承担责任。\n\n该项目根据MIT许可证授权，并鼓励贡献。可以通过运行`make build up-dev`来启动开发。"
  },
  {
    "id": "43961247",
    "title": "US Copyright Office found AI companies breach copyright. Its boss was fired",
    "url": "https://www.theregister.com/2025/05/12/us_copyright_office_ai_copyright/",
    "summary": "Here's a concise summary of the article:\n\nThe US Copyright Office released a draft report concluding that AI companies' use of copyrighted material for training AI models often exceeds fair use boundaries, particularly when used for commercial purposes that compete with existing markets. Shortly after the report's release, the head of the Copyright Office, Shira Perlmutter, was reportedly fired.\n\nThe report highlights that AI companies, including Google, Meta, OpenAI, and Microsoft (all donors to Donald Trump's inauguration fund), may face legal challenges as they train AI models on copyrighted data scraped from the internet without compensating creators. The report suggests that the \"fair use\" defense is weak when AI outputs compete commercially with the copyrighted works used in training, especially if illegal access was involved.\n\nWhile the White House claims the firing was related to DEI concerns within the Library of Congress (which oversees the Copyright Office), others, including Representative Joe Morelle, suggest it was connected to Perlmutter's resistance to Elon Musk's AI endeavors that rely on copyrighted material. Some also suspect the firing was done to appease donors of the Trump administration.\n",
    "chinese_title": "美国版权局认定人工智能公司侵犯版权，其负责人被解雇。",
    "chinese_summary": "以下是文章的简洁总结：\n\n美国版权局发布了一份报告草案，结论是人工智能公司使用受版权保护的材料训练人工智能模型的行为，通常超出合理使用范围，尤其是在用于与现有市场竞争的商业目的时。 报告发布后不久，据报道，版权局局长希拉·珀尔马特被解雇。\n\n该报告强调，包括谷歌、Meta、OpenAI 和微软（均为唐纳德·特朗普就职典礼捐助者）在内的人工智能公司，在未经补偿创作者的情况下，从互联网上抓取受版权保护的数据来训练人工智能模型，可能会面临法律挑战。 报告表明，当人工智能的输出在商业上与用于训练的受版权保护的作品竞争时，尤其是在涉及非法访问的情况下，“合理使用”的辩护理由很薄弱。\n\n虽然白宫声称解雇与国会图书馆（负责监管版权局）内部的多元、公平与包容 (DEI) 问题有关，但包括众议员乔·莫雷尔在内的其他人认为，这与珀尔马特对埃隆·马斯克依赖受版权保护材料的人工智能事业的抵制有关。 一些人还怀疑，解雇是为了安抚特朗普政府的捐助者。"
  },
  {
    "id": "43931366",
    "title": "Writing an LLM from scratch, part 13 – attention heads are dumb",
    "url": "https://www.gilesthomas.com/2025/05/llm-from-scratch-13-taking-stock-part-1-attention-heads-are-dumb",
    "summary": "Giles' blog post, \"Writing an LLM from scratch, part 13 – attention heads are dumb,\" delves into the \"why\" behind self-attention in Large Language Models (LLMs). The author challenges the misconception that individual attention heads are complex and argues that their power lies in their simplicity and collaboration through multi-head attention and layering.\n\nThe core argument is that each attention head performs basic pattern matching, comparing \"what I'm looking for\" (queries) with \"what I am\" (keys) in a shared, potentially impoverished, embedding space. The dot product of query and key vectors determines the attention score, indicating the strength of the relationship between tokens. Value vectors, projected into a potentially rich space, are then used to create context vectors, capturing the nuanced relationships identified by the attention head.\n\nThe layering aspect is crucial, as each layer builds upon the previous, gradually enriching the context vectors with more complex information. This addresses the fixed-length bottleneck problem of earlier encoder/decoder RNNs by allowing the \"hidden state\" (context vectors) to scale with the input sequence length.\n\nThe author illustrates this with an example of an attention head learning to match articles with nouns. It emphasizes that the embedding space used for query and key vectors can be simpler than the input embedding space, focusing only on the relevant features for the specific pattern-matching task.\n\nIn essence, the post suggests that the intelligence of LLMs doesn't reside in the complexity of individual attention heads, but rather in their collective ability, through layering and multi-head attention, to build complex representations from simple pattern-matching operations.\n",
    "chinese_title": "从零开始编写LLM，第13部分——注意力头是愚蠢的",
    "chinese_summary": "Giles 的博客文章“从零开始编写 LLM，第 13 部分——注意力头很笨”深入探讨了大型语言模型 (LLM) 中自注意力机制背后的“原因”。作者挑战了对单个注意力头复杂性的误解，并认为它们的力量在于其简单性以及通过多头注意力和分层的协作。\n\n核心论点是，每个注意力头都执行基本的模式匹配，在一个共享的、可能简化的嵌入空间中，将“我在寻找什么”（查询）与“我是什么”（键）进行比较。查询和键向量的点积决定了注意力得分，表明 token 之间关系的强度。然后，值向量被投影到一个可能丰富的空间中，用于创建上下文向量，从而捕获注意力头识别的细微关系。\n\n分层方面至关重要，因为每一层都建立在前一层的基础上，逐步用更复杂的信息丰富上下文向量。这解决了早期编码器/解码器 RNN 的固定长度瓶颈问题，允许“隐藏状态”（上下文向量）随输入序列长度缩放。\n\n作者用一个注意力头学习匹配文章和名词的例子来说明这一点。它强调，用于查询和键向量的嵌入空间可以比输入嵌入空间更简单，只关注特定模式匹配任务的相关特征。\n\n本质上，这篇文章表明，LLM 的智能并不在于单个注意力头的复杂性，而在于它们通过分层和多头注意力，从简单的模式匹配操作中构建复杂表示的集体能力。"
  },
  {
    "id": "43963288",
    "title": "The Audio Stack Is a Crime Scene",
    "url": "https://fireborn.mataroa.blog/blog/i-want-to-love-linux-it-doesnt-love-me-back-post-2-the-audio-stack-is-a-crime-scene/",
    "summary": "This article, \"The Audio Stack Is a Crime Scene,\" details the frustrating and often broken state of audio on Linux, particularly for blind users. The author argues that the current system is a messy and unreliable combination of legacy technologies (ALSA, PulseAudio) and newer solutions (PipeWire) that haven't fully replaced the old. This leads to unpredictable behavior, debugging nightmares, and a general lack of user-friendliness.\n\nWhile PipeWire offers improvements, most applications still rely on PulseAudio compatibility layers, perpetuating old problems. For blind users, these issues are catastrophic because they rely on audio feedback for everything, and audio failures can completely lock them out of their system with no visual fallback.\n\nThe author criticizes the lack of clear error messages, the instability of Bluetooth audio, and the need for arcane terminal commands to manage basic audio functions. Graphical mixers are often inaccessible to screen readers, and command-line tools are poorly documented and difficult to script. Laptop audio is particularly problematic due to firmware quirks and the poorly documented UCM system. The core message is that Linux audio is a broken system requiring specialist knowledge to fix, and it demands a complete overhaul with accessibility as a priority.\n",
    "chinese_title": "音频堆栈是个犯罪现场",
    "chinese_summary": "音频堆栈：一场犯罪现场\n\n本文“音频堆栈：一场犯罪现场”详细描述了Linux音频令人沮丧且经常崩溃的状态，特别是对于盲人用户而言。作者认为，当前的系统是由遗留技术（ALSA、PulseAudio）和尚未完全取代旧技术的新解决方案（PipeWire）组成的混乱且不可靠的组合。这导致了不可预测的行为、调试噩梦以及普遍缺乏用户友好性。\n\n虽然PipeWire提供了一些改进，但大多数应用程序仍然依赖于PulseAudio兼容层，从而延续了旧问题。对于盲人用户来说，这些问题是灾难性的，因为他们的一切都依赖于音频反馈，而音频故障可能会完全将他们锁定在系统之外，且没有视觉回退方案。\n\n作者批评了缺乏清晰的错误消息、蓝牙音频的不稳定性，以及需要使用晦涩难懂的终端命令来管理基本音频功能。图形混音器通常无法被屏幕阅读器访问，命令行工具的文档记录不佳且难以编写脚本。笔记本电脑音频由于固件怪癖和文档记录不佳的UCM系统而特别成问题。核心信息是，Linux音频是一个需要专业知识才能修复的崩溃系统，并且需要彻底改革，并将可访问性作为优先事项。"
  },
  {
    "id": "43953883",
    "title": "Title of work deciphered in sealed Herculaneum scroll via digital unwrapping",
    "url": "https://www.finebooksmagazine.com/fine-books-news/title-work-deciphered-sealed-herculaneum-scroll-digital-unwrapping",
    "summary": "Researchers using digital unwrapping techniques have successfully deciphered the title and author of a sealed Herculaneum scroll, PHerc. 172, housed at the Bodleian Libraries. The scroll has been identified as \"On Vices\" by the Greek philosopher Philodemus, specifically *On Vices and Their Opposite Virtues and In Whom They Are and About What*, a treatise offering guidance on virtuous living. This achievement earned researchers the Vesuvius Challenge First Title Prize.\n\nThe breakthrough followed the public release of data from a 2024 scanning of the scroll. While initial images emerged earlier in 2025, identifying the title page required extensive analysis independently achieved by Sean Johnson and Marcel Roth & Micha Nowak. Independent review by the Vesuvius Challenge papyrological team confirmed the findings.\n\nPhilodemus, an Epicurean philosopher, championed practical happiness over abstract intellectual debate. The discovery reinforces his central role in the Villa of Papyri library. While the scroll's title and author are confirmed, its position within the ten-book \"On Vices\" series is still debated. Identifying the specific book number (potentially Book 1) is ongoing.\n\nExperts like Michael McOsker highlight the potential to gain deeper insights into Philodemus' ethical views and the broader \"On Vices\" series. Richard Ovenden emphasizes the transformative potential of AI in arts and humanities scholarship. The Vesuvius Challenge continues to foster global collaboration in deciphering the Herculaneum Scrolls without physical intervention.\n",
    "chinese_title": "通过数字展开技术解读赫库兰尼姆封存卷轴作品标题",
    "chinese_summary": "研究人员利用数字解卷技术成功解读了封存的海格力姆卷轴PHerc. 172的标题和作者，该卷轴现藏于博德利图书馆。该卷轴被确定为希腊哲学家菲洛德谟的著作《论恶习》，具体为《论恶习及其对立美德以及它们存在于何处及关于什么》，这是一部提供美德生活指导的论著。这一成就为研究人员赢得了维苏威挑战赛的首个标题奖。\n\n该突破得益于2024年对卷轴扫描数据的公开发布。虽然初步图像早在2025年出现，但标题页的识别需要肖恩·约翰逊和马塞尔·罗斯与米哈·诺瓦克独立完成的大量分析。维苏威挑战赛纸莎草学团队的独立审查证实了这些发现。\n\n伊壁鸠鲁派哲学家菲洛德谟提倡实际幸福，而非抽象的学术辩论。这一发现加强了他于纸莎草别墅图书馆的核心地位。虽然卷轴的标题和作者已得到确认，但它在十卷本《论恶习》系列中的位置仍在争论中。确定具体的卷号（可能是第一卷）仍在进行中。\n\n迈克尔·麦考斯克等专家强调，这有可能更深入地了解菲洛德谟的伦理观点和更广泛的《论恶习》系列。理查德·奥文登强调了人工智能在艺术和人文领域学术研究中的变革潜力。维苏威挑战赛继续促进全球合作，在无需物理干预的情况下解读海格力姆卷轴。"
  },
  {
    "id": "43933091",
    "title": "How friction is being redistributed in today's economy",
    "url": "https://kyla.substack.com/p/the-most-valuable-commodity-in-the",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "摩擦力如何在当今经济中重新分配",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "43958082",
    "title": "I hacked my clock to control my focus",
    "url": "https://www.paepper.com/blog/posts/how-i-hacked-my-clock-to-control-my-focus.md/",
    "summary": "This article details a clever hack to improve focus by leveraging the computer's clock as a persistent reminder. The author, struggling with distractions, transformed their Ubuntu GNOME desktop clock into a dynamic focus tracker.\n\nThe implementation involves installing the \"Panel Date Format\" GNOME extension and creating a bash script called `focus.sh`. This script, when executed with a focus keyword (e.g., `focus.sh Coding`), updates the clock's display to show the current date and time, along with the designated focus (\"Focus: Coding\"). If run without an argument, it prompts the user to enter their current focus.\n\nThe `focus.sh` script uses `dconf` to modify the \"Panel Date Format\" extension's configuration, altering the display format. Adding the script to the user's PATH allows for easy access from any terminal.\n\nThe author argues that this method is effective because it requires zero willpower, is omnipresent (the clock is frequently glanced at), resets context, and is non-intrusive compared to notifications. It works by utilizing an existing behavior (looking at the clock) rather than forcing a new habit.\n\nThe article concludes with suggestions for extending the functionality with Pomodoro timers, color-coded tasks, and time tracking integration.\n",
    "chinese_title": "我破解了我的闹钟来控制我的专注力。",
    "chinese_summary": "利用电脑时钟提升专注力的巧妙技巧：将Ubuntu GNOME桌面时钟改造为动态专注追踪器\n\n本文详细介绍了一种巧妙的技巧，通过利用电脑时钟作为持久的提醒来提高专注力。作者在与注意力分散作斗争的过程中，将他们的Ubuntu GNOME桌面时钟改造成了一个动态的专注追踪器。\n\n其实现方法包括安装“Panel Date Format”GNOME扩展，并创建一个名为`focus.sh`的bash脚本。这个脚本在执行时，如果带有一个专注关键词（例如，`focus.sh Coding`），就会更新时钟的显示，以显示当前的日期和时间，以及指定的专注内容（“Focus: Coding”）。 如果在没有参数的情况下运行，它会提示用户输入他们当前的专注内容。\n\n`focus.sh`脚本使用`dconf`来修改“Panel Date Format”扩展的配置，从而改变显示格式。将该脚本添加到用户的PATH中，可以方便地从任何终端访问它。\n\n作者认为，这种方法是有效的，因为它不需要任何意志力，无处不在（人们经常看时钟），重置上下文，并且与通知相比，是非侵入性的。它的工作原理是利用现有的行为（看时钟），而不是强迫养成一个新的习惯。\n\n文章最后建议通过番茄工作法计时器、颜色编码的任务和时间跟踪集成来扩展该功能。"
  },
  {
    "id": "43956547",
    "title": "ToyDB rewritten: a distributed SQL database in Rust, for education",
    "url": "https://github.com/erikgrinaker/toydb",
    "summary": "ToyDB is a distributed SQL database written in Rust, designed as an educational tool to illustrate the architecture and concepts behind distributed SQL databases. It's a rewrite, informed by the author's experience at CockroachDB and Neon, focusing on simplicity, understandability, functionality, and correctness over performance and scalability.\n\nKey features include:\n\n*   **Raft consensus:** Ensures linearizable state machine replication.\n*   **ACID transactions:** Implements MVCC-based snapshot isolation.\n*   **Pluggable storage:** Supports BitCask and in-memory backends.\n*   **Iterator-based query engine:** Offers heuristic optimization and time-travel capabilities.\n*   **SQL interface:** Supports joins, aggregates, and transactions.\n\nThe project provides an architecture guide, SQL examples and reference, and research materials. Users can easily set up a local five-node cluster and interact with it via a command-line client. The database supports common SQL features, and the project includes an `EXPLAIN` query planner.\n\nTesting is done via Goldenscripts, covering Raft, MVCC, SQL execution, and end-to-end scenarios. A workload benchmark tool allows running read, write, and bank transaction workloads, highlighting the trade-offs between durability (fsync) and performance. VSCode debugging configurations are also provided.\n",
    "chinese_title": "ToyDB 重写版：用 Rust 编写的分布式 SQL 数据库，用于教育",
    "chinese_summary": "ToyDB 是一个用 Rust 编写的分布式 SQL 数据库，旨在作为一种教育工具，用于展示分布式 SQL 数据库背后的架构和概念。它是作者在 CockroachDB 和 Neon 的经验基础上重写而成，侧重于简洁性、可理解性、功能性和正确性，而非性能和可扩展性。\n\n主要特性包括：\n\n*   **Raft 共识：** 确保线性化的状态机复制。\n*   **ACID 事务：** 实施基于 MVCC 的快照隔离。\n*   **可插拔存储：** 支持 BitCask 和内存后端。\n*   **基于迭代器的查询引擎：** 提供启发式优化和时间旅行功能。\n*   **SQL 接口：** 支持连接、聚合和事务。\n\n该项目提供架构指南、SQL 示例和参考，以及研究材料。用户可以轻松设置本地五节点集群，并通过命令行客户端与之交互。该数据库支持常见的 SQL 功能，并且该项目包含一个 `EXPLAIN` 查询计划器。\n\n测试通过 Goldenscripts 完成，涵盖 Raft、MVCC、SQL 执行和端到端场景。工作负载基准测试工具允许运行读取、写入和银行交易工作负载，突出显示持久性 (fsync) 和性能之间的权衡。还提供了 VSCode 调试配置。"
  },
  {
    "id": "43942881",
    "title": "A simple 16x16 dot animation from simple math rules",
    "url": "https://tixy.land",
    "summary": "The article \"A simple 16x16 dot animation from simple math rules\" introduces a technique for generating compelling 16x16 pixel animations using concise mathematical formulas. The core concept revolves around expressing the color of each pixel in the 16x16 grid (indexed by `x` and `y`) as a function of time (`t`) and pixel coordinates (`x`, `y`).\n\nThe article implies, via the \"(t,i,x,y) => 'creative code golfing'\" statement, that the real focus is on finding the most compact and elegant mathematical expressions that produce visually interesting animations. \"Creative code golfing\" suggests a challenge of minimizing code length while maximizing visual output.\n\nEssentially, the author is using mathematical equations to map time and spatial coordinates to a color value for each pixel. By carefully crafting these equations, complex and dynamic patterns can be created within the limited resolution of a 16x16 grid. The value of this approach lies in its ability to generate complex visuals from extremely simple and efficient code, highlighting the power of mathematical abstraction in creative coding. The title emphasizes simplicity and math as the driving forces behind creating animated visuals. The parameters (t,i,x,y) could mean time, index, x-coordinate, and y-coordinate respectively. The index parameter is ambiguous, but it might refer to color index in a palette.\n",
    "chinese_title": "基于简单数学规则的16x16点阵动画",
    "chinese_summary": "文章《通过简单数学规则实现16x16点阵动画》介绍了一种使用简洁的数学公式生成引人注目的16x16像素动画的技术。其核心概念是将16x16网格中每个像素的颜色（由`x`和`y`索引）表示为时间(`t`)和像素坐标(`x`, `y`)的函数。\n\n文章通过\"(t,i,x,y) => '创意代码高尔夫'\" 这句话暗示，真正的重点在于找到能够产生视觉上有趣的动画的最紧凑和优雅的数学表达式。“创意代码高尔夫”表明，这是一种在最小化代码长度的同时最大化视觉输出的挑战。\n\n本质上，作者是使用数学方程式将时间和空间坐标映射到每个像素的颜色值。通过精心设计这些方程式，可以在16x16网格的有限分辨率内创建复杂且动态的图案。这种方法的价值在于它能够从极其简单和高效的代码中生成复杂的视觉效果，突出了数学抽象在创意编码中的力量。标题强调了简单性和数学是创建动画视觉效果的驱动力。参数(t,i,x,y)可能分别表示时间、索引、x坐标和y坐标。索引参数含义不明确，但可能指的是调色板中的颜色索引。"
  },
  {
    "id": "43955397",
    "title": "LSP client in Clojure in 200 lines of code",
    "url": "https://vlaaad.github.io/lsp-client-in-200-lines-of-code",
    "summary": "This article presents a minimal Language Server Protocol (LSP) client written in Clojure in under 200 lines of code. The target audience is primarily Clojure developers interested in building tools that interact with language servers.\n\nThe article explains the core concepts of LSP, highlighting its benefits in solving the MxN problem of IDE and language integration. It outlines the implementation of essential blocks of the LSP specification, focusing on programmatic read-only querying of language servers. The code covers the base communication layer (handling byte streams with headers and JSON bodies), the JSON-RPC layer (defining request/response and notification structures), and a wrapper around the JSON-RPC connection, making it a functioning language server client.\n\nThe author uses Java 24 with virtual threads for efficient blocking code. The implementation excludes JSON parsing (using the jsonista library), and document syncing (text editor functionality).\n\nThe author walks through the Clojure code, explaining the functions for reading ASCII lines, handling base communication, and implementing the JSON-RPC protocol. The `lsp-jsonrpc` function manages communication between the client and server, handling both requests and notifications.\n\nFinally, the article provides a simple API with functions for starting a language server (`start!`), sending requests (`request!`), and sending notifications (`notify!`). This enables Clojure developers to create command-line linters or other tools that leverage language servers for code analysis and other language-specific tasks.\n",
    "chinese_title": "用Clojure实现的200行代码的LSP客户端",
    "chinese_summary": "本文介绍了一个用Clojure编写的、少于200行代码的极简语言服务器协议（LSP）客户端。目标受众主要是对构建与语言服务器交互的工具有兴趣的Clojure开发者。\n\n本文解释了LSP的核心概念，强调了其在解决IDE和语言集成的MxN问题方面的优势。 它概述了LSP规范的基本模块的实现，重点是语言服务器的程序化只读查询。 代码涵盖了基础通信层（处理带有头部和JSON主体的字节流）、JSON-RPC层（定义请求/响应和通知结构），以及JSON-RPC连接的封装器，使其成为一个可工作的语言服务器客户端。\n\n作者使用带有虚拟线程的Java 24来实现高效的阻塞代码。 该实现不包括JSON解析（使用jsonista库）和文档同步（文本编辑器功能）。\n\n作者逐步讲解了Clojure代码，解释了用于读取ASCII行、处理基础通信以及实现JSON-RPC协议的函数。 `lsp-jsonrpc`函数管理客户端和服务器之间的通信，处理请求和通知。\n\n最后，本文提供了一个简单的API，其中包含用于启动语言服务器（`start!`）、发送请求（`request!`）和发送通知（`notify!`）的函数。 这使Clojure开发者能够创建命令行linter或其他工具，利用语言服务器进行代码分析和其他特定于语言的任务。"
  },
  {
    "id": "43943898",
    "title": "Show HN: Codigo – The Programming Language Repository",
    "url": "https://codigolangs.com",
    "summary": "Codigo is presented as a programming language repository. The landing page, as described, features:\n\n*   **Core Functionality:** Offers a searchable repository of programming languages and an option to \"Explore all languages.\" Login functionality is available.\n*   **Language News:** Displays recent news and articles related to various programming languages, including Raku, C++, Kotlin, Python, PHP, C#, and Mojo. Each item includes a title, associated language, and date.\n*   **Popularity Rankings:** Provides rankings of languages based on different metrics: \"Most Viewed,\" \"Most Favorited,\" \"PyPL Index,\" \"TIOBE Index,\" and \"Most GitHub Pushes.\" Each category lists the top 20 languages according to its respective measure. The PyPL and TIOBE Index rankings link to external sites for the full index. The indexes feature languages such as Python, Java, JavaScript, C++, C, C#, R, PHP, Rust, and more.\n\nIn essence, Codigo aims to be a central hub for programming language information, providing news, trends, and resources for developers. The presented data suggests a focus on language popularity and community engagement.\n",
    "chinese_title": "展示HN：Codigo – 编程语言代码库",
    "chinese_summary": "Codigo：编程语言代码库。着陆页功能描述：\n\n*   **核心功能：** 提供可搜索的编程语言代码库，并提供“浏览所有语言”选项。提供登录功能。\n*   **语言新闻：** 显示与各种编程语言相关的最新新闻和文章，包括Raku、C++、Kotlin、Python、PHP、C#和Mojo。每条新闻包括标题、相关语言和日期。\n*   **流行度排名：** 提供基于不同指标的语言排名：“浏览最多”、“收藏最多”、“PyPL指数”、“TIOBE指数”和“GitHub推送最多”。每个类别根据各自的指标列出前20名语言。PyPL和TIOBE指数排名链接到外部网站以获取完整指数。这些指数包含Python、Java、JavaScript、C++、C、C#、R、PHP、Rust等语言。\n\n总而言之，Codigo旨在成为编程语言信息的中心枢纽，为开发人员提供新闻、趋势和资源。呈现的数据表明侧重于语言的流行度和社区参与度。"
  },
  {
    "id": "43933548",
    "title": "For better or for worse, the overload (2024)",
    "url": "https://consteval.ca/2024/07/25/overload/",
    "summary": "This article delves into the intricacies of overload resolution in C++, focusing specifically on qualification conversions and how they influence the selection of the \"best\" function overload.\n\nThe author begins by introducing the concept of implicit conversion sequences, comprised of standard conversions (like lvalue-to-rvalue, array-to-pointer, function-to-pointer, integral/floating-point/pointer conversions, and qualification conversions) and potentially user-defined conversions.  The central focus shifts to qualification conversions, dissecting how `const` and `volatile` qualifiers affect type conversions.\n\nA mathematical notation is introduced to analyze the cv-qualifiers within complex types, simplifying the comparison process. The key concept of \"similar\" types is defined, based on agreement in non-const-y parts of cv-decompositions.  The article then presents the \"cv-combined type\" algorithm, which determines if a type T1 can be converted to T2 based on their cv-qualification signatures. This algorithm is illustrated with examples showing how `const` placement impacts conversion success.\n\nFinally, the author revisits overload resolution, defining \"viable\" and \"better\" candidate functions. They emphasize that standard conversion sequences are preferred over user-defined ones. A table ranks standard conversions, with \"exact match\" being the best. Tie-breakers for same-rank sequences are discussed, including preferring subsequences, rvalue references, lvalue references bound to function lvalues, and the \"less qualified\" reference binding. The article concludes with clarifying examples and a warning against top-level cv-qualifier overloading for non-reference types.\n",
    "chinese_title": "好也罢，坏也罢，《超载》（2024）",
    "chinese_summary": "本文深入探讨了C++中重载决议的复杂性，特别关注于限定转换以及它们如何影响“最佳”函数重载的选择。\n\n作者首先介绍了隐式转换序列的概念，它由标准转换（如左值到右值、数组到指针、函数到指针、整型/浮点型/指针转换以及限定转换）和潜在的用户自定义转换组成。 重点转移到限定转换，剖析了`const`和`volatile`限定符如何影响类型转换。\n\n引入了一种数学符号来分析复杂类型中的cv-限定符，简化了比较过程。 定义了基于cv-分解的非const部分的“相似”类型的关键概念。 然后，文章提出了“cv-组合类型”算法，该算法确定类型T1是否可以基于其cv-限定签名转换为T2。 通过示例说明了该算法，展示了`const`放置如何影响转换成功。\n\n最后，作者重新审视了重载决议，定义了“可行”和“更好”的候选函数。 他们强调标准转换序列优先于用户自定义序列。 一个表格对标准转换进行了排序，“精确匹配”是最好的。 讨论了相同等级序列的决胜规则，包括优先子序列、右值引用、绑定到函数左值的左值引用以及“较少限定”的引用绑定。 文章最后通过清晰的示例以及关于非引用类型不应使用顶级cv-限定符重载的警告作为结尾。"
  },
  {
    "id": "43956723",
    "title": "Burrito Now, Pay Later",
    "url": "https://enterprisevalue.substack.com/p/burrito-now-pay-later",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "墨西哥卷饼，先吃后付",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "43952714",
    "title": "The Epochalypse Project",
    "url": "https://epochalypse-project.org/",
    "summary": "The Epochalypse Project warns of a critical vulnerability: the 32-bit timestamp issue, impacting millions of embedded and industrial systems globally. By January 19, 2038, systems tracking time using a 32-bit signed integer will \"roll over,\" potentially causing widespread disruptions in essential services like healthcare, banking, transportation, and power grids.\n\nThis issue is deemed more severe than Y2K due to its massive scale, embedded nature (difficult to patch), increased societal dependence on digital infrastructure, security implications (remote exploitation), and limited visibility of affected systems. The project stresses the urgency of coordinated action, as simply replacing or updating all vulnerable systems is unrealistic.\n\nThe project, founded by cybersecurity researchers Trey Darley and Pedro Umbelino, aims to build a global collaborative initiative. Their mission includes standardized testing, documenting vulnerabilities, developing remediation strategies, and sharing knowledge across sectors.\n\nThe article urges participation from various groups: the general public (testing smart devices), industry professionals (testing and updating products), government (developing guidance and regulations), and technical professionals (analyzing firmware and developing solutions). Contributions, including findings, methodologies, and strategies, are welcomed through the project's reporting portal, promoting collective effort in mitigating this potential digital catastrophe. The project highlights the current lack of action and seeks to remedy it.\n",
    "chinese_title": "末世录计划",
    "chinese_summary": "Epochalypse项目警告存在一个关键漏洞：32位时间戳问题，该问题影响全球数百万个嵌入式和工业系统。到2038年1月19日，使用32位有符号整数跟踪时间的系统将会“溢出”，可能导致医疗、银行、交通和电网等关键服务出现大范围中断。\n\n由于其规模庞大、嵌入式特性（难以修复）、社会对数字基础设施日益依赖、安全隐患（远程利用）以及受影响系统的可见性有限，该问题被认为比Y2K问题更为严重。该项目强调协同行动的紧迫性，因为简单地更换或更新所有易受攻击的系统是不现实的。\n\n该项目由网络安全研究人员Trey Darley和Pedro Umbelino创立，旨在建立一个全球协作倡议。他们的使命包括标准化测试、记录漏洞、制定补救策略以及在各个部门之间分享知识。\n\n文章敦促各方参与：普通大众（测试智能设备）、行业专业人士（测试和更新产品）、政府（制定指导和法规）和技术专业人士（分析固件和开发解决方案）。欢迎通过该项目的报告门户网站提供调查结果、方法和策略等贡献，以促进集体努力，减轻这种潜在的数字灾难。该项目强调目前缺乏行动，并寻求补救。"
  },
  {
    "id": "43945157",
    "title": "3D printing in vivo for non-surgical implants and drug delivery",
    "url": "https://www.science.org/doi/10.1126/science.adt0293",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "体内3D打印用于非手术植入和药物递送",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "43925820",
    "title": "Dart added support for cross-compilation",
    "url": "https://dart.dev/tools/dart-compile#cross-compilation-exe",
    "summary": "This article describes the `dart compile` command, which replaces older commands like `dart2native`, `dart2aot`, and `dart2js` for compiling Dart programs to various target platforms. The `dart compile` command offers several subcommands, each generating a different type of output:\n\n*   **`exe`:** Creates self-contained, architecture-specific executables (Windows, macOS, Linux). Supports cross-compilation to Linux x64 and ARM64 from macOS, Windows, and Linux.\n\n*   **`aot-snapshot`:** Generates AOT (Ahead-of-Time) compiled modules, also architecture-specific. Requires `dartaotruntime` to execute. Cross-compilation support is the same as for `exe`.\n\n*   **`jit-snapshot`:** Creates JIT modules with intermediate code that was generated during a training run.\n\n*   **`kernel`:** Produces portable kernel modules (`.dill` files) runnable on all operating systems and CPU architectures.\n\n*   **`js`:** Compiles Dart code into deployable JavaScript.\n\nThe `js` subcommand offers options for optimization (`-O`), source maps, and analysis control (e.g., fatal warnings, CSP). To improve JavaScript performance, avoid `Function.apply()`, `noSuchMethod()`, setting variables to `null`, and maintain consistent argument types.\n\nThe article also notes some known limitations for `exe` and `aot-snapshot`, such as no support for `dart:mirrors` and `dart:developer`.\n",
    "chinese_title": "Dart 增加了对交叉编译的支持",
    "chinese_summary": "本文介绍了`dart compile`命令，该命令取代了较旧的`dart2native`、`dart2aot`和`dart2js`等命令，用于将 Dart 程序编译为各种目标平台。`dart compile`命令提供多个子命令，每个子命令生成不同类型的输出：\n\n*   **`exe`：** 创建独立的、特定于体系结构的执行文件（Windows、macOS、Linux）。支持从 macOS、Windows 和 Linux 交叉编译到 Linux x64 和 ARM64。\n\n*   **`aot-snapshot`：** 生成 AOT（Ahead-of-Time）编译的模块，也是特定于体系结构的。需要`dartaotruntime`来执行。交叉编译支持与`exe`相同。\n\n*   **`jit-snapshot`：** 创建 JIT 模块，其中包含在训练运行期间生成的中间代码。\n\n*   **`kernel`：** 生成可移植的内核模块（`.dill`文件），可在所有操作系统和 CPU 架构上运行。\n\n*   **`js`：** 将 Dart 代码编译为可部署的 JavaScript。\n\n`js`子命令提供优化（`-O`）、源代码映射和分析控制（例如，致命警告、CSP）的选项。为了提高 JavaScript 性能，请避免`Function.apply()`、`noSuchMethod()`、将变量设置为`null`，并保持参数类型一致。\n\n本文还指出`exe`和`aot-snapshot`的一些已知限制，例如不支持`dart:mirrors`和`dart:developer`。"
  },
  {
    "id": "43964551",
    "title": "Perplexity AI's Valuation Surges to $14B in $500M Funding Round",
    "url": "https://www.wsj.com/tech/ai-startup-perplexitys-valuation-surges-to-14-billion-in-fresh-funding-round-26124482",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "Perplexity AI 估值飙升至 140 亿美元，获 5 亿美元融资",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "43958382",
    "title": "Avoiding AI is hard – but our freedom to opt out must be protected",
    "url": "https://theconversation.com/avoiding-ai-is-hard-but-our-freedom-to-opt-out-must-be-protected-255873",
    "summary": "This article argues that while AI offers benefits, the increasing integration of AI into essential services and daily life raises serious concerns about individual autonomy and the right to opt out of AI's influence. The author highlights how AI is shaping decisions in areas like hiring, finance, and healthcare, often with biases that disadvantage certain groups. Opting out of AI is becoming increasingly difficult, potentially leading to exclusion from modern society and widening the gap between those who embrace AI and those who are left behind.\n\nThe author uses the analogy of \"The Sorcerer's Apprentice\" to illustrate the dangers of uncontrolled technology and warns against summoning a power that cannot be managed. They contend that the freedom to choose whether or not to engage with AI is crucial for preserving autonomy in the digital age, especially considering that turning AI off entirely is impractical due to its integration into essential systems.\n\nTo protect this right, the author urges governments, businesses, and communities to implement policies that regulate AI while also respecting individual freedoms. They advocate for greater transparency in AI decision-making, ensuring accountability and recourse for individuals affected by AI systems. The article also emphasizes the importance of digital literacy to empower people to understand and challenge the technologies shaping their lives. Ultimately, the author stresses the urgency of addressing these issues to prevent a future where personal autonomy is compromised and AI's influence goes unchecked.\n",
    "chinese_title": "避免人工智能很难——但我们选择退出的自由必须得到保护",
    "chinese_summary": "本文认为，人工智能在带来益处的同时，其日益融入基本服务和日常生活也引发了对个人自主权和退出人工智能影响权利的严重担忧。作者强调，人工智能正在塑造招聘、金融和医疗保健等领域的决策，并且往往带有偏见，使某些群体处于不利地位。选择退出人工智能正变得越来越困难，可能导致被现代社会排斥，并扩大拥抱人工智能者和被抛弃者之间的差距。\n\n作者以“魔法师的学徒”为喻，说明了不受控制的技术的危险性，并警告不要召唤一种无法管理的力量。他们认为，选择是否与人工智能互动的自由对于维护数字时代的自主权至关重要，特别是考虑到由于人工智能已融入基本系统，完全关闭它是不可行的。\n\n为了保护这项权利，作者敦促政府、企业和社区实施在监管人工智能的同时尊重个人自由的政策。他们倡导提高人工智能决策的透明度，确保对受人工智能系统影响的个人进行问责和提供追索权。文章还强调了数字素养的重要性，以使人们能够理解和挑战塑造他们生活的技术。最终，作者强调解决这些问题的紧迫性，以防止个人自主权受到损害，人工智能的影响不受控制的未来。"
  },
  {
    "id": "43960470",
    "title": "Creating a static website for all my bookmarks",
    "url": "https://alexwlchan.net/2025/bookmarks-static-site/",
    "summary": "This article details the author's transition from using Pinboard to a self-hosted, static website for managing bookmarks. Frustrated by Pinboard's decline, the author sought more control and longevity for their data. The author highlights the importance of personal bookmarking due to link rot, the rise of AI-generated content in search results, and the value of personal summaries.\n\nThe author favors a static site for its simplicity, portability, minimal maintenance, and lack of lock-in. The website consists of a single page with a scrolling list of bookmarks, each containing a title, URL, handwritten summary, and tags. Bookmarks can be filtered by tag or author and sorted by title, date, or randomly.\n\nThe key feature is the local snapshot of each web page, allowing offline access and protection against link rot. The author uses a custom-built system using a JavaScript file for metadata and a viewer to render the HTML. The data model, inspired by Pinboard, includes fields for title, authors, description, date, tags, and an \"archive\" object that stores the path to the local snapshot and associated assets. The author uses a Python script for data validation and Git for version control.\n\nThe article is the first in a series. Subsequent posts will cover building a personal web archive, lessons learned about web development from archiving, and highlights from the author's bookmark collection.\n",
    "chinese_title": "为所有书签创建一个静态网站",
    "chinese_summary": "本文详细介绍了作者从使用 Pinboard 到使用自托管静态网站管理书签的转变。由于对 Pinboard 的衰落感到沮丧，作者寻求对其数据的更多控制和长期保存。作者强调了个人书签的重要性，原因包括链接失效、搜索结果中人工智能生成内容的兴起以及个人摘要的价值。\n\n作者偏爱静态网站，因为其简单性、可移植性、极少的维护和无锁定性。该网站由一个包含滚动书签列表的单页组成，每个书签包含标题、URL、手写摘要和标签。书签可以按标签或作者过滤，并按标题、日期或随机排序。\n\n关键功能是每个网页的本地快照，允许离线访问和防止链接失效。作者使用自定义系统，包括用于存储元数据的 JavaScript 文件和用于渲染 HTML 的查看器。数据模型灵感来自 Pinboard，包括标题、作者、描述、日期、标签和一个“存档”对象，该对象存储本地快照和相关资产的路径。作者使用 Python 脚本进行数据验证，并使用 Git 进行版本控制。\n\n本文是系列文章的第一篇。后续文章将涵盖构建个人网络档案、从存档中学到的网络开发经验以及作者书签收藏的亮点。"
  },
  {
    "id": "43955333",
    "title": "An online exhibition of pretty software bugs",
    "url": "https://glitchgallery.org/",
    "summary": "The Glitch Gallery is an online exhibition celebrating the beauty of software bugs, transforming accidental errors into art. The site invites visitors to browse a collection of \"accidental artworks\" and encourages submissions of user-encountered glitches.\n\nThe exhibition showcases a wide variety of visual anomalies and unexpected outputs from various software programs and processes. Each artwork is attributed to its discoverer and often includes the year of its creation/discovery. The pieces range from abstract patterns and distorted images to unexpected color combinations and bizarre geometric shapes. They reflect errors in areas like interpolation, pixel rendering, memory management, and graphical processing.\n\nExamples of exhibited works include: \"Interpolation Space,\" \"Sky Hits the Limit,\" various \"Erosion\" pieces, \"Pacman Pie,\" \"Neon Giraffe,\" \"Chess in the Matrix,\" \"Sequence Symmetry in Asymmetry,\" \"Wait, how big is an int?,\" \"Mountains of Sierpnonski,\" \"Morisawa Error,\" \"Lapin Noir,\" \"Exploding Hedgehog,\" \"Cylinder Wrapping Gone Great,\" \"Psychedelic Ride,\" \"Out of Line,\" and \"Uncontained,\" among many others. The gallery highlights how unexpected software behavior can result in unique and visually captivating outcomes.\n",
    "chinese_title": "赏心悦目的软件错误在线展览",
    "chinese_summary": "故障艺术馆：这是一个在线展览，旨在赞美软件漏洞之美，将意外错误转化为艺术。网站邀请访客浏览一系列“意外艺术品”，并鼓励用户提交遇到的故障。\n\n该展览展示了各种软件程序和流程中出现的各种视觉异常和意外输出。每件艺术品都署名其发现者，并通常包括其创作/发现年份。这些作品范围广泛，从抽象图案和扭曲图像到意外的色彩组合和奇异的几何形状。它们反映了插值、像素渲染、内存管理和图形处理等领域的错误。\n\n展出的作品包括：“插值空间”、“天空触及极限”、各种“侵蚀”作品、“吃豆人派”、“霓虹长颈鹿”、“矩阵中的象棋”、“不对称中的序列对称”、“等等，一个int有多大？”、“谢尔宾斯基山脉”、“森泽错误”、“黑兔”、“爆炸的刺猬”、“圆柱包裹大成功”、“迷幻之旅”、“出界”和“未包含”等等。艺术馆突出了意外的软件行为如何产生独特且引人入胜的视觉效果。"
  },
  {
    "id": "43954649",
    "title": "I built a native Windows Todo app in pure C (278 KB, no frameworks)",
    "url": "https://github.com/Efeckc17/simple-todo-c",
    "summary": "This article introduces \"Simple Todo,\" a lightweight and native Windows todo application built entirely in C using the Win32 API. The application boasts a small executable size (278KB) and avoids external frameworks, showcasing advanced Windows GUI programming.\n\nKey features include creating, editing, and deleting todo items, marking tasks as complete, persistent data storage in the AppData folder, system tray integration, a native Windows look and feel, and an option to auto-start with Windows.\n\nTechnically, it's written in pure C, utilizes the Win32 API for the GUI, integrates with the system tray, and uses modern Windows visual styles. Todos are stored in a binary file in `%APPDATA%\\TodoApp\\todos.dat`, with a maximum capacity of 100 items.\n\nBuilding the application requires Windows OS, MinGW-w64 (GCC compiler), and the Windows SDK. The article provides instructions on how to clone the repository, build the project using the provided `build.bat` script, and use the compiled executable.\n\nThe project structure includes `src/` containing `main.c` (entry point), `todo.c` and `todo.h` (todo management), and `gui.c` (GUI implementation), along with `bin/` (compiled executable), `build.bat`, and `README.md`. Key components used in development include the Win32 API, Common Controls, UXTheme, and File I/O.\n\nThe project is licensed under the MIT License, and contributions are welcomed. Contact information is provided for the developer.\n",
    "chinese_title": "我用纯C语言构建了一个原生Windows待办事项应用（278 KB，无框架）。",
    "chinese_summary": "本文介绍了“Simple Todo”，一个轻量级的原生Windows待办事项应用程序，完全使用C语言和Win32 API构建。该应用程序拥有很小的可执行文件大小（278KB），并且避免了外部框架，展示了高级的Windows GUI编程。\n\n主要功能包括创建、编辑和删除待办事项，将任务标记为完成，在AppData文件夹中进行持久性数据存储，系统托盘集成，原生的Windows外观和感觉，以及随Windows自动启动的选项。\n\n从技术上讲，它使用纯C语言编写，利用Win32 API来实现GUI，与系统托盘集成，并使用现代Windows视觉样式。待办事项存储在`%APPDATA%\\TodoApp\\todos.dat`中的一个二进制文件中，最大容量为100项。\n\n构建该应用程序需要Windows操作系统、MinGW-w64（GCC编译器）和Windows SDK。本文提供了如何克隆存储库、使用提供的`build.bat`脚本构建项目以及使用已编译的可执行文件的说明。\n\n项目结构包括包含`main.c`（入口点）、`todo.c`和`todo.h`（待办事项管理）以及`gui.c`（GUI实现）的`src/`，以及`bin/`（已编译的可执行文件）、`build.bat`和`README.md`。开发中使用的关键组件包括Win32 API、通用控件、UXTheme和文件I/O。\n\n该项目采用MIT许可证授权，欢迎贡献。提供了开发者的联系方式。"
  },
  {
    "id": "43952239",
    "title": "Build iOS Apps on Linux and Windows",
    "url": "https://forums.swift.org/t/xtool-cross-platform-xcode-replacement-build-ios-apps-on-linux-and-more/79803",
    "summary": "This article announces `xtool`, a new open-source tool enabling the building, signing, and deployment of iOS apps from Linux and Windows (WSL). It's based on Swift Package Manager (SwiftPM) and designed to replace Xcode for iOS development, even on macOS.\n\n`xtool` allows developers to build SwiftPM packages into iOS apps, sign and install them on devices, and interact with Apple Developer Services programmatically. Documentation and a tutorial are available on Swift Package Index.\n\nThe article also highlights current limitations and future plans: Interface Builder isn't supported (as SwiftUI is the preferred approach), and Asset Catalogs aren't fully implemented. Apple-proprietary macros might require reverse engineering. App Extensions aren't yet supported but are planned. LLDB debugging on newer iOS versions is challenging due to Apple's changes, but integration is desired. App Store deployment isn't currently supported, though technically achievable.\n\nThe author, the sole developer of `xtool`, welcomes external contributions to expand the tool's functionality. The tool represents a significant step towards cross-platform iOS development and offers a declarative, SwiftPM-based alternative to Xcode.\n",
    "chinese_title": "在Linux和Windows上构建iOS应用",
    "chinese_summary": "本文宣布推出`xtool`，一款新的开源工具，可在Linux和Windows（WSL）上构建、签名和部署iOS应用。它基于Swift Package Manager (SwiftPM) 构建，旨在取代Xcode进行iOS开发，即使在macOS上也是如此。\n\n`xtool`允许开发者将SwiftPM包构建成iOS应用，签名并将其安装到设备上，并以编程方式与Apple Developer Services交互。文档和教程可在Swift Package Index上找到。\n\n本文还强调了当前的局限性和未来的计划：不支持Interface Builder（因为首选使用SwiftUI），且Asset Catalogs尚未完全实现。Apple专有的宏可能需要逆向工程。App Extensions尚未支持，但已列入计划。由于Apple的更改，在新版本的iOS上进行LLDB调试具有挑战性，但期望集成。目前不支持App Store部署，但技术上可行。\n\n`xtool`的唯一开发者欢迎外部贡献，以扩展该工具的功能。该工具代表着向跨平台iOS开发迈出的重要一步，并提供了一种基于SwiftPM的声明式Xcode替代方案。"
  },
  {
    "id": "43932686",
    "title": "A formatter for your kdl files",
    "url": "https://github.com/hougesen/kdlfmt",
    "summary": "`kdlfmt` is a command-line tool for formatting KDL (KDL Document Language) files, built on top of the `kdl-rs` Rust parser. It ensures consistent formatting and validates existing files.\n\n**Installation:** Available through Cargo (`cargo install kdlfmt`), Homebrew (`brew install hougesen/tap/kdlfmt`), npm (`npm install -g kdlfmt`) or precompiled binaries for various operating systems, including Linux, macOS, and Windows.\n\n**Usage:** The core command is `kdlfmt format PATH`, which formats the KDL file at the specified path.  You can read from stdin and write to stdout using `kdlfmt format -`. The `kdlfmt check PATH` command validates if a file is already formatted correctly. Both `format` and `check` can take multiple paths and support KDL version specification (`--kdl-version`) and log level control (`--log-level`). Files can be ignored using `.kdlfmtignore` files, adhering to `.gitignore` syntax.\n\n**Other features:**\n*   `kdlfmt init`: Initializes formatter config (not detailed in this document).\n*   `kdlfmt completions`: Generates shell completions for Bash, Zsh, Fish, PowerShell, Elvish, and Nushell, improving command-line experience.\n",
    "chinese_title": "KDL文件格式化工具",
    "chinese_summary": "`kdlfmt` 是一个命令行工具，用于格式化 KDL (KDL 文档语言) 文件，构建于 `kdl-rs` Rust 解析器之上。它确保一致的格式化并验证现有文件。\n\n**安装:** 可通过 Cargo (`cargo install kdlfmt`)、Homebrew (`brew install hougesen/tap/kdlfmt`)、npm (`npm install -g kdlfmt`) 或适用于各种操作系统的预编译二进制文件获取，包括 Linux、macOS 和 Windows。\n\n**用法:** 核心命令是 `kdlfmt format PATH`，它格式化指定路径下的 KDL 文件。 你可以使用 `kdlfmt format -` 从 stdin 读取并写入 stdout。 `kdlfmt check PATH` 命令验证文件是否已正确格式化。 `format` 和 `check` 命令都可以接受多个路径，并支持 KDL 版本指定 (`--kdl-version`) 和日志级别控制 (`--log-level`)。 可以使用 `.kdlfmtignore` 文件忽略文件，该文件遵循 `.gitignore` 语法。\n\n**其他功能:**\n*   `kdlfmt init`: 初始化格式化程序配置（本文档未详细说明）。\n*   `kdlfmt completions`: 为 Bash、Zsh、Fish、PowerShell、Elvish 和 Nushell 生成 shell 补全，从而改善命令行体验。"
  },
  {
    "id": "43959932",
    "title": "Show HN: Blog comments, nice looking, open source – Talkyard",
    "url": "https://blog-comments.talkyard.io/demo/",
    "summary": "This \"Show HN\" post introduces Talkyard, an open-source comment system that can be embedded in blogs and forums. The author demonstrates how to embed the comments section using a simple JavaScript snippet, emphasizing the need for proper domain configuration. While Talkyard can function as a forum as well, the post acknowledges current limitations like logout issues on page reload when embedded as a forum. The blog post showcases a live demo of the embedded comment functionality and encourages users to report any bugs or issues encountered while using the system. The comments displayed are pulled from the original blog post itself, further illustrating the embedding capability.\n",
    "chinese_title": "Show HN：美观开源的博客评论系统 – Talkyard",
    "chinese_summary": "此“Show HN”帖子介绍了 Talkyard，一个可嵌入博客和论坛的开源评论系统。作者演示了如何使用简单的 JavaScript 代码片段嵌入评论区，并强调了正确配置域名的必要性。虽然 Talkyard 也可以作为论坛使用，但该帖子承认目前存在一些限制，例如嵌入为论坛时，页面重新加载时会出现注销问题。该博客文章展示了嵌入式评论功能的实时演示，并鼓励用户报告使用系统时遇到的任何错误或问题。显示的评论来自原始博客文章本身，进一步说明了嵌入功能。"
  },
  {
    "id": "43925005",
    "title": "Monitoring my Minecraft server with OpenTelemetry and Prometheus",
    "url": "https://www.dash0.com/blog/monitoring-minecraft-with-opentelemetry",
    "summary": "This article details how the author set up monitoring for their Minecraft server using OpenTelemetry, Prometheus, and Dash0 to ensure its reliability and uptime. The goal was to proactively address server issues before family members (the end-users) noticed.\n\nThe monitoring architecture involves three main components:\n1.  **OpenTelemetry Java Agent:** Running within the Minecraft server's JVM, it collects runtime metrics like CPU and memory usage.\n2.  **Minecraft Exporter for Prometheus:** Scrapes Minecraft-specific metrics (player count, blocks mined, cake eaten). The author explores various exporters and chooses one written in Go due to its ease of use.\n3.  **OpenTelemetry Collector:** Aggregates telemetry from the Java Agent and Prometheus exporter, adds metadata, and forwards it to Dash0. It also collects logs from Systemd (journald).\n\nThe article highlights the difference between the OpenTelemetry agent (pushing metrics) and the Prometheus exporter (requiring pulling). The collector handles both.\n\nAlerting is implemented within Dash0 using PromQL to detect server downtime, restarts, and crashes. The author uses logs for alerting due to their richness of information compared to simple \"up\" metrics.  Specifically, the article details how to monitor systemd logs to detect issues in starting or restarting the minecraft server process.\n\nThe author concludes that the project was enjoyable, providing an excuse to leverage Java and Linux sysadmin skills. The priority is server uptime, not complex dashboards, so focus is placed on effective alerting.\n",
    "chinese_title": "使用 OpenTelemetry 和 Prometheus 监控我的 Minecraft 服务器",
    "chinese_summary": "本文详细介绍了作者如何使用 OpenTelemetry、Prometheus 和 Dash0 为其 Minecraft 服务器设置监控，以确保其可靠性和正常运行时间。目标是在家庭成员（最终用户）注意到之前主动解决服务器问题。\n\n监控架构涉及三个主要组件：\n1. **OpenTelemetry Java Agent：** 在 Minecraft 服务器的 JVM 中运行，它收集运行时指标，如 CPU 和内存使用情况。\n2. **Minecraft Prometheus Exporter：** 抓取 Minecraft 特定的指标（玩家数量、挖掘的方块、吃掉的蛋糕）。作者探索了各种 exporter，并选择了一个用 Go 编写的，因为它易于使用。\n3. **OpenTelemetry Collector：** 聚合来自 Java Agent 和 Prometheus exporter 的遥测数据，添加元数据，并将其转发到 Dash0。它还从 Systemd (journald) 收集日志。\n\n本文重点介绍了 OpenTelemetry agent（推送指标）和 Prometheus exporter（需要拉取）之间的区别。 Collector 可以处理这两种情况。\n\nAlerting 在 Dash0 中使用 PromQL 实现，以检测服务器停机、重启和崩溃。由于日志的信息丰富性高于简单的“up”指标，作者使用日志进行 alerting。具体而言，本文详细介绍了如何监控 systemd 日志，以检测启动或重启 minecraft 服务器进程中的问题。\n\n作者总结说，这个项目令人愉快，提供了一个利用 Java 和 Linux 系统管理员技能的借口。 优先考虑的是服务器正常运行时间，而不是复杂的仪表板，因此重点放在有效的 alerting 上。"
  },
  {
    "id": "43960793",
    "title": "Show HN: MMORPG prototype inspired by World of Warcraft",
    "url": "https://github.com/nickyvanurk/everwilds",
    "summary": "\"Everwilds\" is a prototype MMORPG project, inspired by World of Warcraft, designed as a learning resource for developers. It demonstrates the networking and netcode architecture behind real-time online RPGs, focusing on synchronization and client-server interactions. While not a complete game, it includes features like character movement, basic combat, a leveling system, and a chat system. A key feature is its implementation of player movement synchronization, mirroring the technique used by World of Warcraft for smooth replication with minimal bandwidth. The project is built using Three.js, TypeScript, and HTML/CSS. The creator aims to share the insights gained from researching and implementing this system. Instructions are provided for running the project locally using Git, NPM, and a manual copy of assets on Windows.\n",
    "chinese_title": "展示HN：受《魔兽世界》启发的MMORPG原型",
    "chinese_summary": "Everwilds 是一个MMORPG原型项目，灵感来源于《魔兽世界》，旨在为开发者提供学习资源。它演示了实时在线RPG背后的网络和网络代码架构，重点关注同步和客户端-服务器交互。虽然不是一个完整的游戏，但它包含了角色移动、基本战斗、等级系统和聊天系统等功能。一个关键特性是它实现了玩家移动同步，模仿了《魔兽世界》所使用的技术，以最小的带宽实现平滑的复制。该项目使用Three.js、TypeScript和HTML/CSS构建。创建者旨在分享从研究和实现该系统中所获得的见解。提供了使用Git、NPM在本地运行该项目的说明，以及在Windows上手动复制资源的操作。"
  },
  {
    "id": "43931226",
    "title": "Show HN: Translate between dialects and share SQL queries on the browser",
    "url": "https://sqlscope.netlify.app",
    "summary": "This \"Show HN\" post introduces a web application called SQL Scope, built to allow users to translate SQL queries between different dialects and share them. The description is extremely brief, indicating that the core functionality revolves around SQL dialect translation and query sharing directly within the user's web browser. The \"You need to enable JavaScript to run this app\" message suggests the application heavily relies on client-side JavaScript for its operation, implying that processing and translation likely happen in the browser rather than a server-side process.\n",
    "chinese_title": "Show HN: 在浏览器上进行方言互译并分享SQL查询",
    "chinese_summary": "此“Show HN”帖子介绍了一个名为SQL Scope的Web应用程序，旨在允许用户在不同SQL方言之间转换查询并分享它们。描述非常简短，表明其核心功能围绕SQL方言转换和查询共享，直接在用户的Web浏览器中进行。“你需要启用JavaScript才能运行此应用程序”的消息表明该应用程序高度依赖客户端JavaScript进行操作，这意味着处理和转换可能在浏览器中发生，而不是服务器端进程。"
  },
  {
    "id": "43964209",
    "title": "'Everybody's Replaceable': The New Ways Bosses Talk About Workers",
    "url": "https://www.wsj.com/lifestyle/workplace/corporate-bosses-workers-culture-changing-cbd19c2c",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "“人人可替代”：老板们谈论员工的新方式",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "43924178",
    "title": "Ink and Algorithms: Techniques, tools and the craft of pen plotting",
    "url": "https://penplotter.art/",
    "summary": "\"Ink & Algorithms\" is a weekly exploration of pen plotting, covering its techniques, tools, and the artists driving the medium forward. The content highlights the journey of pen plotters from technical tools in the 1950s to their almost exclusive use for art today.\n\nFeatured posts cover a range of topics, including the \"Plotter Postcard Exchange\" (#PTPX), a successful movement within the plotter art community. Another article delves into the evolution of pen plotting into an art form, tracing its transformation from a practical tool to a creative outlet. The series also explores specific artistic techniques, such as the Truchet tile pattern, showcasing artists who utilize it to create unique and complex plots.\n\nThe series also features artist profiles, such as one on James Nolan Gandy, highlighting his analog drawing machines and unique approach to pen plotting with pens, pulleys, and paper. The \"Archive\" section presents a convenient summary of previous posts, allowing readers to easily revisit past topics and artist profiles.\n",
    "chinese_title": "墨与算法：钢笔绘图的技巧、工具与工艺",
    "chinese_summary": "墨水与算法：每周探索笔式绘图，涵盖其技术、工具及推动该媒介发展的艺术家。内容重点介绍笔式绘图仪从 20 世纪 50 年代的技术工具到如今几乎完全用于艺术创作的历程。\n\n精选文章涵盖一系列主题，包括“绘图仪明信片交流”(#PTPX)，这是绘图仪艺术界一项成功的活动。另一篇文章深入探讨了笔式绘图演变成一种艺术形式的过程，追溯了它从实用工具到创意出口的转变。该系列还探索了特定的艺术技巧，例如 Truchet 瓷砖图案，展示了利用该图案创作独特而复杂绘图的艺术家。\n\n该系列还包含艺术家简介，例如 James Nolan Gandy 的简介，重点介绍了他的模拟绘图机器以及他使用笔、滑轮和纸张进行笔式绘图的独特方法。“档案”部分提供了先前文章的便捷摘要，使读者可以轻松回顾过去的主题和艺术家简介。"
  },
  {
    "id": "43962412",
    "title": "Have you ever seen an emolument fly?",
    "url": "https://reason.com/volokh/2025/05/11/have-you-ever-seen-an-emolument-fly/",
    "summary": "This article details a controversial potential gift from the Qatari royal family to the United States: a luxury Boeing 747-8 jumbo jet intended for President Trump's use as Air Force One until shortly before he leaves office, after which ownership would transfer to the Trump presidential library foundation. The estimated value of the plane is $400 million.\n\nWhile this gift raises concerns regarding the Constitution's emoluments clause, laws against bribery, and potential security risks, the White House and Justice Department lawyers reportedly determined the gift is legally permissible. Their justification is that the plane is a gift to the United States Air Force and then the presidential library foundation, not directly to an individual, and is not conditioned on any specific official action, thus avoiding bribery charges.\n\nThe article also highlights a new golf resort deal the Trump family organization struck in Qatar. This deal, involving luxury villas and an 18-hole golf course built by a Saudi Arabian company, marks the Trump Organization's first foreign deal since Trump took office, contrasting with his previous pledge to avoid foreign deals to prevent conflicts of interest. This deal raises further questions about potential conflicts of interest and the influence of foreign entities on US policy during a second Trump administration.\n",
    "chinese_title": "你见过薪水飞走吗？",
    "chinese_summary": "卡塔尔王室拟赠送美国一架豪华波音747-8巨型喷气式飞机，供特朗普总统在卸任前用作空军一号，之后所有权将转移至特朗普总统图书馆基金会，飞机估价4亿美元。此举引发争议，涉及宪法薪酬条款、反贿赂法以及潜在安全风险。据报道，白宫和司法部律师认定该礼物在法律上是允许的，理由是该飞机是赠送给美国空军和总统图书馆基金会，而非直接赠予个人，且未附加任何具体官方行为的条件，因此不构成受贿。\n\n文章还重点介绍了特朗普家族集团在卡塔尔达成的一项新的高尔夫度假村协议。该协议涉及由沙特阿拉伯公司建造的豪华别墅和一个18洞高尔夫球场，标志着特朗普集团自特朗普上任以来达成的第一笔外国交易，与其此前避免外国交易以防止利益冲突的承诺形成对比。 这笔交易进一步引发了人们对潜在利益冲突以及外国实体对特朗普第二任政府时期美国政策的影响的质疑。"
  },
  {
    "id": "43959887",
    "title": "Replacing tmux and GNU screen with Emacs",
    "url": "https://www.masteringemacs.org/article/replacing-tmux-gnu-screen-emacs",
    "summary": "This article argues that Emacs can effectively replace terminal multiplexers like tmux and GNU screen, especially for users already familiar with Emacs. While acknowledging the utility of tmux for remote servers and situations where Emacs isn't available, the author highlights Emacs's ability to handle detaching/re-attaching sessions, windowing, terminal emulation, and running shells.\n\nThe author first addresses the perils of running Emacs within a terminal, citing key binding conflicts, limited functionality, lack of fidelity (image/PDF support), and flow control issues. They emphasize the client-server architecture of Emacs, allowing users to run programs within a persistent server instance and access them via `emacsclient`.\n\nThe article then explores various methods for running programs within Emacs, including `M-x shell`, `M-x term`, `M-x vterm`, `M-x eat`, and `M-x eshell`, recommending `vterm` for a near-terminal experience and `M-x shell` for a more Emacs-centric approach. The author also suggests leveraging Emacs's compilation and scripting capabilities instead of relying solely on shells. A bash script `emux.sh` is provided to launch programs within Emacs from outside the environment.\n\nFinally, the article compares Emacs's windowing system to those of tmux and screen, clarifying the terminology (frame, window, buffer, pane, session) and highlighting Emacs's advanced window management capabilities. A table compares common tmux/screen keybindings with their Emacs equivalents, emphasizing that while not a direct replacement, Emacs can fulfill most multiplexing needs.\n",
    "chinese_title": "用 Emacs 替代 tmux 和 GNU screen",
    "chinese_summary": "本文论证了Emacs可以有效地替代像tmux和GNU screen这样的终端复用器，特别是对于已经熟悉Emacs的用户。文章承认tmux在远程服务器以及Emacs不可用的情况下具有实用性，但作者强调了Emacs处理分离/重新连接会话、窗口管理、终端模拟和运行shell的能力。\n\n作者首先阐述了在终端中运行Emacs的弊端，包括按键冲突、功能受限、缺乏保真度（图像/PDF支持）和流量控制问题。他们强调了Emacs的客户端-服务器架构，允许用户在持久服务器实例中运行程序，并通过`emacsclient`访问它们。\n\n文章随后探讨了在Emacs中运行程序的各种方法，包括`M-x shell`、`M-x term`、`M-x vterm`、`M-x eat`和`M-x eshell`，推荐使用`vterm`以获得接近终端的体验，并推荐使用`M-x shell`以获得更以Emacs为中心的方法。作者还建议利用Emacs的编译和脚本编写功能，而不是仅仅依赖于shell。文章提供了一个 bash 脚本 `emux.sh`，用于从环境外部在 Emacs 中启动程序。\n\n最后，文章将Emacs的窗口系统与tmux和screen的窗口系统进行了比较，阐明了术语（frame, window, buffer, pane, session），并强调了Emacs的高级窗口管理能力。文中列出了一个表格，比较了常见的tmux/screen快捷键及其Emacs等效键，强调虽然Emacs不能直接替代tmux/screen，但它可以满足大多数的复用需求。"
  },
  {
    "id": "43932764",
    "title": "Show HN: Vom Decision Platform (Cursor for Decision Analyst)",
    "url": "https://www.vomdecision.com",
    "summary": "Vom is a no-code decision platform designed to help businesses automate and improve decision-making processes across areas like credit, insurance underwriting, and more. It offers features such as an Excel-formula based decision flow editor, REST API integration, an AI copilot for policy improvement, connectors to data providers and services, and easy A/B testing capabilities.\n\nKey benefits include a versioning system for auditing and security, a scalable cloud infrastructure for fast decision execution, and comprehensive decision history logging. Vom aims to empower users to continuously improve their automated decisions through accessible data access, no-code policy creation, and simple A/B testing.\n\nThe platform's founders, with experience across industries, created Vom to address the challenges of automated decision-making. Their vision is to help companies leverage data, automation, AI/ML, and navigate regulations effectively. They emphasize user-friendliness, performance, and security in their technology, making it suitable for businesses of all sizes. Users can connect with Vom through scheduling a demo or requesting contact to discuss how the platform can help them.\n",
    "chinese_title": "Show HN: Vom决策平台（决策分析师的Cursor）",
    "chinese_summary": "Vom：一个无需代码的决策平台，旨在帮助企业自动化并改进信贷、保险核保等领域的决策流程。它提供诸如基于Excel公式的决策流程编辑器、REST API集成、用于策略改进的AI副驾驶、数据提供商和服务连接器以及简易的A/B测试功能。\n\n主要优势包括用于审计和安全性的版本控制系统、用于快速决策执行的可扩展云基础设施以及全面的决策历史记录。Vom致力于通过便捷的数据访问、无需代码的策略创建和简单的A/B测试，赋能用户持续改进其自动化决策。\n\n该平台的创始团队拥有跨行业经验，创建Vom旨在解决自动化决策所面临的挑战。他们的愿景是帮助企业有效利用数据、自动化、人工智能/机器学习，并驾驭监管。他们在技术中强调用户友好性、性能和安全性，使其适用于各种规模的企业。用户可以通过预约演示或请求联系来与Vom取得联系，以讨论该平台如何帮助他们。"
  },
  {
    "id": "43954249",
    "title": "Gonzalo Guerrero",
    "url": "https://en.wikipedia.org/wiki/Gonzalo_Guerrero",
    "summary": "Gonzalo Guerrero was a Spanish sailor who was shipwrecked off the Yucatán Peninsula in 1511 and enslaved by the local Maya. He integrated into Mayan society, becoming a respected warrior (\"nakom\") under the lord of Chetumal, converting to Mayan polytheism, and marrying Zazil Ha, the governor's daughter. Their children were among the first mestizos in the Americas.\n\nIn 1519, Hernán Cortés, upon landing in Cozumel, learned of Guerrero and his surviving crewmate, Gerónimo de Aguilar, and invited them to join his expedition. Aguilar accepted and became a translator, but Guerrero declined, citing his family and obligations to the Mayan governor. He famously told Aguilar that he could not return to the Spanish because he was tattooed, pierced, and considered a lord by the Maya.\n\nGuerrero played a key role in resisting the Spanish conquest, advising and leading Mayan forces against Spanish entradas by Hernández de Córdoba, Juan de Grijalva, Francisco de Montejo, Alonso de Avila, and Pedro de Alvarado. He is credited with helping to thwart Montejo's 1527-1528 campaign. Guerrero died in 1536 during a battle against Alvarado's forces in the Sula Valley of Honduras, possibly killed by an arquebus shot.\n\nGuerrero is viewed in Mexican culture as a symbol of the merging of Spanish and indigenous cultures, the father of the mestizo people. Although there are no firsthand accounts from Guerrero, his story has been retold and reinterpreted in numerous historical chronicles, literary works, and popular culture, solidifying his legacy as a complex and pivotal figure in the history of the Spanish conquest of the Americas.\n",
    "chinese_title": "冈萨洛·格雷罗",
    "chinese_summary": "冈萨洛·格雷罗是一位西班牙水手，1511年在尤卡坦半岛附近遭遇海难，被当地玛雅人奴役。他融入玛雅社会，成为切图马尔领主手下备受尊敬的战士(\"nakom\")，皈依玛雅多神教，并娶了总督的女儿萨齐尔·哈为妻。他们的孩子是美洲最早的混血儿之一。\n\n1519年，埃尔南·科尔特斯登陆科苏梅尔时，得知了格雷罗和他幸存的船员赫罗尼莫·德·阿吉拉尔，并邀请他们加入他的探险队。阿吉拉尔接受了邀请，成为一名翻译，但格雷罗拒绝了，理由是他有家庭和对玛雅总督的义务。他曾对阿吉拉尔说，他不能回到西班牙，因为他身上有纹身和穿孔，而且被玛雅人视为领主。\n\n格雷罗在抵抗西班牙征服中发挥了关键作用，他为玛雅军队提供建议，并领导他们对抗埃尔南德斯·德·科尔多瓦、胡安·德·格里哈尔瓦、弗朗西斯科·德·蒙特霍、阿隆索·德·阿维拉和佩德罗·德·阿尔瓦拉多的西班牙入侵。他被认为是帮助挫败蒙特霍1527-1528年战役的关键人物。格雷罗于1536年在洪都拉斯苏拉山谷对抗阿尔瓦拉多军队的战斗中阵亡，可能死于火绳枪射击。\n\n在墨西哥文化中，格雷罗被视为西班牙和土著文化融合的象征，是混血人民的父亲。虽然没有来自格雷罗的第一手资料，但他的故事在无数的历史编年史、文学作品和流行文化中被重述和重新诠释，巩固了他作为西班牙征服美洲历史上一个复杂而关键人物的遗产。"
  },
  {
    "id": "43928364",
    "title": "In-Memory Ferroelectric Differentiator",
    "url": "https://www.nature.com/articles/s41467-025-58359-4",
    "summary": "This article introduces an in-memory differentiator leveraging the dynamic domain reversal of ferroelectric materials for efficient differential computation, addressing the challenges of energy efficiency and speed in processing large datasets for edge computing. The core of the differentiator is a 40x40 passive crossbar array of ferroelectric P(VDF-TrFE) capacitors.\n\nThe device exploits the nonlinear domain dynamics of the ferroelectric material, particularly the narrow switching window, to minimize the sneak path issue prevalent in passive crossbar arrays, enabling reliable and uniform domain switching across the array. This architecture allows the device to directly perform differential calculations within the memory unit itself, significantly reducing data transfer and energy consumption compared to traditional MCU-based methods.\n\nThe article demonstrates the differentiator's capabilities in solving derivative functions and visual processing tasks like moving object extraction and image discrepancy identification. By converting video pixels into voltage signals applied to the capacitor array, changes between consecutive frames trigger domain switching, revealing motion information. The estimated energy consumption per differential calculation is remarkably low (0.24 fJ), with the potential for further speed improvements. The device also exhibits a retention capability of over five days, making it suitable for slow dynamic scenarios.\n",
    "chinese_title": "内存铁电差分器",
    "chinese_summary": "本文介绍了一种利用铁电材料的动态畴反转实现高效差分计算的内存微分器，旨在解决边缘计算处理大型数据集时面临的能效和速度挑战。该微分器的核心是一个由铁电 P(VDF-TrFE) 电容器组成的 40x40 无源交叉阵列。\n\n该器件利用铁电材料的非线性畴动力学，特别是窄开关窗口，以最大限度地减少无源交叉阵列中普遍存在的潜行路径问题，从而实现整个阵列中可靠且均匀的畴切换。这种架构使设备能够在存储单元内部直接执行差分计算，与传统的基于MCU的方法相比，显著减少了数据传输和能量消耗。\n\n本文展示了该微分器在解决导数函数和视觉处理任务（如移动物体提取和图像差异识别）方面的能力。通过将视频像素转换为施加到电容器阵列的电压信号，连续帧之间的变化会触发畴切换，从而揭示运动信息。每次差分计算的估计能耗非常低（0.24 fJ），并且有进一步提高速度的潜力。该器件还表现出超过五天的保持能力，使其适用于慢动态场景。"
  },
  {
    "id": "43954054",
    "title": "Booting the RP2350 from UART",
    "url": "https://pfister.dev/blog/2025/rp2350-uart-bl.html",
    "summary": "Thomas Pfister explores booting the Raspberry Pi RP2350 microcontroller via its UART bootloader, an alternative to the more common USB method. He aims to use multiple RP2350s as port expanders and prefers the simplicity of UART over managing complex firmware versions.\n\nThe article details the process: unlocking the bootloader with a magic pattern, sending the firmware in 32-byte chunks, and then running it. While the firmware needs to reside in SRAM, the RP2350's ample 520 KiB should be sufficient for the intended use.\n\nPfister outlines the hardware modifications needed to enable UART booting: pulling CSn low and SD1 high. He provides code examples for compiling a binary to run from SRAM and embedding it within another microcontroller's firmware. A Python script for transferring the firmware is presented, and he then ports the code to C.\n\nHe addresses the speed limitations of UART by calculating the theoretical transfer rate and acknowledging discrepancies in his Python implementation. Finally, he tackles the issue of UART's robustness over long cables by implementing RS-485 with TI's THVD1450 transceivers and standard Ethernet cables, enabling reliable booting over a 10-meter connection and potentially much further. He also highlights and provides a workaround for an SDK limitation regarding GPIO bank usage with the bootloader.\n",
    "chinese_title": "从UART启动RP2350",
    "chinese_summary": "托马斯·普菲斯特探讨了通过Raspberry Pi RP2350微控制器的UART引导加载程序进行启动的方法，这是一种替代更常见的USB方式的选择。他的目标是将多个RP2350用作端口扩展器，并且更喜欢UART的简洁性，而不是管理复杂的固件版本。\n\n文章详细介绍了该过程：用魔术模式解锁引导加载程序，以32字节的块发送固件，然后运行它。虽然固件需要驻留在SRAM中，但RP2350充足的520 KiB应该足以满足预期用途。\n\n普菲斯特概述了启用UART启动所需的硬件修改：将CSn拉低，将SD1拉高。他提供了代码示例，用于编译从SRAM运行的二进制文件，并将其嵌入到另一个微控制器的固件中。文章展示了一个用于传输固件的Python脚本，然后他将代码移植到C语言。\n\n他通过计算理论传输速率并承认其Python实现中的差异，解决了UART的速度限制问题。最后，他通过使用TI的THVD1450收发器和标准以太网电缆实施RS-485，解决了UART在长电缆上的鲁棒性问题，从而能够在10米连接上实现可靠启动，并且可能更远。他还强调并提供了解决SDK关于GPIO Bank与引导加载程序一起使用的限制的方法。"
  },
  {
    "id": "43951588",
    "title": "One-Click RCE in Asus's Preinstalled Driver Software",
    "url": "https://mrbruh.com/asusdriverhub/",
    "summary": "This article details a one-click Remote Code Execution (RCE) vulnerability found in ASUS's pre-installed DriverHub software. The author discovered that DriverHub, designed to manage drivers via a background process communicating with `driverhub.asus.com`, had a poorly secured Remote Procedure Call (RPC) mechanism. While the RPC initially appeared to only accept requests from `driverhub.asus.com`, the author found it was vulnerable to subdomain wildcard matching (e.g., `driverhub.asus.com.mrbruh.com`), allowing malicious websites to send commands to the local DriverHub process.\n\nExploitable RPC endpoints included obtaining device information, rebooting the system, downloading logs, and critically, updating applications (`UpdateApp`). While `UpdateApp` required a signed executable, the author leveraged this by exploiting ASUS's WiFi driver installation package, specifically the `AsusSetup.exe` file, which reads installation parameters from `AsusSetup.ini`. By serving a malicious `AsusSetup.ini` file with a custom `SilentInstallRun` parameter (pointing to `calc.exe`), the author could trigger the execution of arbitrary code when DriverHub downloaded and executed the legitimate, signed `AsusSetup.exe`. This allowed a website to execute arbitrary code with admin privileges with one click.\n\nThe author reported the vulnerability to ASUS, who quickly patched it. CVEs were assigned. The author's tracking efforts suggest the vulnerability was not actively exploited prior to their discovery. Despite not receiving a bug bounty, the author was acknowledged in ASUS's \"hall of fame.\" The author also sarcastically notes that the WiFi driver that motivated the investigation still doesn't work.\n",
    "chinese_title": "华硕预装驱动软件中的一键RCE漏洞",
    "chinese_summary": "本文详细介绍了一个在华硕预装的 DriverHub 软件中发现的一键远程代码执行 (RCE) 漏洞。作者发现 DriverHub 旨在通过与 `driverhub.asus.com` 通信的后台进程管理驱动程序，但其远程过程调用 (RPC) 机制安全性不足。虽然 RPC 最初似乎只接受来自 `driverhub.asus.com` 的请求，但作者发现它容易受到子域名通配符匹配的攻击（例如，`driverhub.asus.com.mrbruh.com`），从而允许恶意网站向本地 DriverHub 进程发送命令。\n\n可利用的 RPC 端点包括获取设备信息、重启系统、下载日志，以及至关重要的更新应用程序 (`UpdateApp`)。虽然 `UpdateApp` 需要签名可执行文件，但作者通过利用华硕的 WiFi 驱动程序安装包，特别是 `AsusSetup.exe` 文件，读取来自 `AsusSetup.ini` 的安装参数，从而利用了这一点。通过提供一个包含自定义 `SilentInstallRun` 参数（指向 `calc.exe`）的恶意 `AsusSetup.ini` 文件，作者可以在 DriverHub 下载并执行经过合法签名的 `AsusSetup.exe` 时触发任意代码的执行。这允许网站通过一键执行具有管理员权限的任意代码。\n\n作者向华硕报告了该漏洞，华硕迅速对其进行了修补。分配了 CVE。作者的跟踪工作表明，该漏洞在他们发现之前没有被积极利用。尽管没有收到漏洞赏金，但作者在华硕的“名人堂”中得到了认可。作者还讽刺地指出，促使此次调查的 WiFi 驱动程序仍然无法工作。"
  },
  {
    "id": "43950525",
    "title": "Dotless Domains",
    "url": "https://lab.avl.la/dotless/",
    "summary": "This article explores \"dotless domains,\" which are top-level domains (TLDs) like `.com` or `.gov` that are directly reachable via a web browser (e.g., `http://com/`) or email server (e.g., `contact@gov`). ICANN and the IAB generally oppose this practice, especially for generic TLDs (gTLDs), but country code TLDs (ccTLDs) often operate under their own national jurisdiction.\n\nThe article details the technical requirements for dotless domains, noting that they require A/AAAA records for web access and MX records for email functionality in the apex (root) of the domain. It highlights a conflict with standard email protocols (SMTP), which typically require at least two labels (e.g., `domain.tld`).\n\nThe content provides comprehensive lists, last updated March 31, 2025, of ccTLDs exhibiting dotless behavior. These are categorized into:\n*   **Current A/AAAA:** ccTLDs with active A or AAAA records, making them web-accessible. Examples include `.bd` (Bangladesh) and `.uz` (Uzbekistan).\n*   **Historical A/AAAA:** ccTLDs that previously had A/AAAA records but no longer do.\n*   **Current MX Only:** ccTLDs with only MX records, theoretically capable of receiving email. Examples include `.cf` (Central African Republic) and `.gt` (Guatemala).\n*   **Historical MX Only:** ccTLDs that formerly had only MX records.\n\nThe article briefly addresses ICANN's requirement for new TLDs to have informational apex records for a limited time to prevent naming collisions. Finally, it explores the theoretical possibility of a \"dotless dot,\" suggesting that the root domain (represented by `.`) could technically have DNS records, though it's highly improbable.\n",
    "chinese_title": "无点域名",
    "chinese_summary": "本文探讨了“无点域名”，这指的是可以直接通过网络浏览器（例如，`http://com/`）或电子邮件服务器（例如，`contact@gov`）访问的顶级域名（TLD），如`.com`或`.gov`。ICANN和IAB通常反对这种做法，特别是对于通用顶级域名（gTLD），但国家代码顶级域名（ccTLD）通常在其自身的国家管辖下运作。\n\n本文详细介绍了无点域名的技术要求，指出它们需要在域名的根部（apex）设置A/AAAA记录以实现Web访问，以及MX记录以实现电子邮件功能。文章强调了这与标准电子邮件协议（SMTP）的冲突，后者通常至少需要两个标签（例如，`domain.tld`）。\n\n文章提供了截至2025年3月31日更新的，表现出无点行为的ccTLD的综合列表。这些列表被分类为：\n\n*   **当前A/AAAA：** 具有活跃的A或AAAA记录，使其可以进行Web访问的ccTLD。例如`.bd`（孟加拉国）和`.uz`（乌兹别克斯坦）。\n*   **历史A/AAAA：** 以前具有A/AAAA记录但现在不再具有的ccTLD。\n*   **当前仅MX：** 仅具有MX记录，理论上能够接收电子邮件的ccTLD。例如`.cf`（中非共和国）和`.gt`（危地马拉）。\n*   **历史仅MX：** 以前仅具有MX记录的ccTLD。\n\n文章简要讨论了ICANN要求新顶级域名在有限的时间内具有信息性的根记录，以防止命名冲突。最后，它探讨了“无点之点”的理论可能性，认为根域名（用`.`表示）在技术上可以具有DNS记录，尽管这极不可能。"
  },
  {
    "id": "43959075",
    "title": "Migrating to Codeberg",
    "url": "https://guix.gnu.org/blog/2025/migrating-to-codeberg/",
    "summary": "The Guix project is migrating its repositories, bug tracking, and patch tracking to Codeberg over the next month, a decision reached through a collective consensus-building process. This move, outlined in the second Guix Consensus Document (GCD), aims to improve tooling and services for maintaining Guix's vast package collection.\n\nKey milestones include migrating Git repositories to Codeberg by June 7th, with the Guix repository itself moving on May 25th.  The old Savannah URL will remain a mirror until at least May 25th, 2026. Bug reports and patches will still be accepted via email until December 31st, 2025, alongside Codeberg's issue and pull request system.\n\nFor users, the primary change involves updating channel.scm configuration files to point to the Codeberg URL, although `guix pull` will provide guidance and the old URL will remain a mirror. `guix describe` and time-machine deployments will continue to function even after Savannah eventually disappears due to Software Heritage.\n\nFor contributors, the migration introduces the option of using pull requests via Codeberg, a welcome change for some but potentially disruptive for those used to email-based workflows. Efforts are underway to develop command-line and Emacs interfaces for Codeberg interaction. Concerns regarding the need for Codeberg accounts are acknowledged, with hopes for future federation support. Email submissions to guix-devel will still be accepted for occasional contributions.\n\nThe move aims to improve the project's ability to manage its scale (100+ contributors, 2,000+ commits/month, 33,000+ packages).\n",
    "chinese_title": "迁移到 Codeberg",
    "chinese_summary": "Guix项目将在下个月内将其代码仓库、缺陷跟踪和补丁跟踪迁移到 Codeberg，这项决定是通过集体共识构建过程达成的。此举在第二份 Guix 共识文档 (GCD) 中有所概述，旨在改进维护 Guix 庞大软件包集合的工具和服务。\n\n主要里程碑包括在 6 月 7 日之前将 Git 代码仓库迁移到 Codeberg，其中 Guix 代码仓库本身将于 5 月 25 日迁移。旧的 Savannah URL 至少在 2026 年 5 月 25 日之前仍将作为镜像存在。Bug 报告和补丁将继续通过电子邮件接受，直至 2025 年 12 月 31 日，同时还将使用 Codeberg 的 issue 和 pull request 系统。\n\n对于用户而言，主要变化包括更新 channel.scm 配置文件以指向 Codeberg URL，尽管 `guix pull` 将提供指导，并且旧 URL 将保持镜像。即使在 Savannah 最终因 Software Heritage 而消失后，`guix describe` 和时间机器部署也将继续运行。\n\n对于贡献者而言，迁移引入了通过 Codeberg 使用 pull request 的选项，这对某些人来说是一个受欢迎的改变，但可能会对那些习惯于基于电子邮件的工作流程的人产生干扰。正在努力开发用于 Codeberg 交互的命令行和 Emacs 界面。对于需要 Codeberg 帐户的担忧已得到承认，并希望未来能够提供联邦支持。仍然会接受通过电子邮件提交到 guix-devel 的偶尔贡献。\n\n此举旨在提高项目管理其规模的能力（100 多名贡献者，每月 2,000 多次提交，33,000 多个软件包）。"
  },
  {
    "id": "43956095",
    "title": "Why not object capability languages?",
    "url": "https://blog.plan99.net/why-not-capability-languages-a8e6cbdf9682",
    "summary": "Mike Hearn's article explores the challenges of adopting object capability languages to mitigate supply chain attacks in software. He argues that while capabilities (like handles and tokens) are already used, applying them within programs is difficult.\n\nThe core problems include defining a suitable threat model (resource exhaustion, DoS, Spectre attacks), preventing memory tampering between components, and balancing security with usability. He uses Java and Chrome's Mojo as examples. Java's Joe-E language subset demonstrates the radical changes needed to achieve pure capability programming, including removing reflection, global methods granting ambient authority, native methods, and mutable global state.\n\nThe article highlights the \"God Object\" problem, where the main method requires access to all ambient authorities, leading to complex proxy objects and backward-incompatible API changes.  The Java SecurityManager attempted to solve this with stack walks and privilege intersections, but it was ultimately abandoned due to performance costs, exploit vulnerabilities, and a lack of developer adoption.\n\nSpectre attacks, allowing code to read the entire address space, further complicated the problem, leading some to believe only hardware-enforced address spaces are sufficient. Chrome's Mojo offers a hardware isolation approach with inter-process communication via unforgeable pipes, effectively implementing object capabilities across microservices. However, it requires OS-specific reverse engineering for sandboxing, is not easily reusable, functions primarily as an RPC system, and has high context switch costs.\n\nIn essence, the article paints a realistic picture of the steep hill involved in making capability-based systems truly usable in practice, highlighting usability and performance issues.\n",
    "chinese_title": "为什么不使用对象能力语言？",
    "chinese_summary": "Mike Hearn的文章探讨了采用对象能力语言来缓解软件供应链攻击所面临的挑战。他认为，尽管能力（如句柄和令牌）已经被使用，但在程序中应用它们却很困难。\n\n核心问题包括定义合适的威胁模型（资源耗尽、DoS、Spectre攻击），防止组件之间的内存篡改，以及平衡安全性和可用性。他以Java和Chrome的Mojo为例。Java的Joe-E语言子集展示了实现纯粹能力编程所需的根本性改变，包括移除反射、授予环境权限的全局方法、原生方法和可变全局状态。\n\n文章强调了“上帝对象”问题，即主方法需要访问所有环境权限，导致复杂的代理对象和向后不兼容的API变更。Java安全管理器试图通过堆栈遍历和权限交集来解决这个问题，但最终因性能成本、漏洞利用和缺乏开发者采用而被放弃。\n\nSpectre攻击允许代码读取整个地址空间，进一步使问题复杂化，导致一些人认为只有硬件强制执行的地址空间才足够。Chrome的Mojo提供了一种硬件隔离方法，通过不可伪造的管道进行进程间通信，有效地在微服务之间实现对象能力。然而，它需要针对沙盒的操作系统特定反向工程，不易重用，主要作为RPC系统运行，并且具有很高的上下文切换成本。\n\n本质上，这篇文章描绘了一个现实的画面，即在实践中使基于能力的系统真正可用所涉及的陡峭坡度，突出了可用性和性能问题。"
  },
  {
    "id": "43932871",
    "title": "How to (actually) prove it – New Frontiers of Mathematics and Computing in Lean",
    "url": "https://kirancodes.me/posts/log-how-to-prove-it-maths.html",
    "summary": "This article highlights the exciting new frontier of \"mechanised mathematics\" using the Lean Theorem prover, which offers unprecedented insights into how mathematicians actually develop proofs. The key innovation is the \"Lean Blueprints\" tool, designed by mathematicians to plan formalizations, visualize dependencies between definitions, lemmas, and theorems, and track their progress.\n\nThe author emphasizes that these blueprints, coupled with version control systems, provide a unique opportunity to observe how mathematicians approach problem-solving, conjecture lemmas, and break down complex proofs into manageable steps. The article features animated visualizations of the blueprint evolution for various active Lean projects, including formalizations of the Polynomial Freiman Ruzsa conjecture, the Kelley-Meka bound, Carleson's theorem, and more.\n\nThese visualizations reveal different patterns of development, such as \"Cambrian\" explosions of theorems, sporadic progress, or a gradual build-up of knowledge. The author suggests these visualizations offer a rich dataset for understanding mathematical reasoning and potentially training machine learning models to assist mathematicians. Furthermore, projects like the Equational Theories formalization, which aim to develop new mathematics in Lean, provide a glimpse into the future of collaborative human-machine mathematics. The author concludes by encouraging readers to explore the available data and contribute to this evolving field.\n",
    "chinese_title": "如何在 Lean 中（真正地）证明它——数学与计算的新前沿",
    "chinese_summary": "本文重点介绍了使用 Lean 定理证明器的“机械化数学”这一令人兴奋的新领域，它为数学家实际开发证明的方式提供了前所未有的洞察力。其关键创新是“Lean 蓝图”工具，由数学家设计，用于规划形式化，可视化定义、引理和定理之间的依赖关系，并跟踪其进展。\n\n作者强调，这些蓝图与版本控制系统相结合，提供了一个独特的机会来观察数学家如何解决问题、推测引理以及将复杂的证明分解为可管理的步骤。文章展示了各种活跃的 Lean 项目的蓝图演变动画可视化，包括 Polynomial Freiman Ruzsa 猜想、Kelley-Meka 界、Carleson 定理等的形式化。\n\n这些可视化揭示了不同的发展模式，例如定理的“寒武纪”爆发、零星的进展或知识的逐步积累。作者认为，这些可视化为理解数学推理提供了一个丰富的数据集，并有可能训练机器学习模型来协助数学家。此外，像 Equational Theories 形式化这样的项目旨在在 Lean 中开发新的数学，让我们得以一窥人机协作数学的未来。作者最后鼓励读者探索可用的数据并为这个不断发展的领域做出贡献。"
  },
  {
    "id": "43950976",
    "title": "Leaving Google",
    "url": "https://www.airs.com/blog/archives/670",
    "summary": "Ian Lance Taylor, a key contributor to the Go programming language, announces his departure from Google after 19 years. Taylor joined the Go team in 2008 and played a significant role in its development and adoption.\n\nHe reflects on Go's unexpected success, surpassing initial hopes of simply influencing other languages, and highlights his contributions, including creating a Go frontend for GCC and adding Go support to Google's build system and SWIG. He also managed the team for a time and helped develop and implement generics into the language.\n\nTaylor notes that his approach focused on addressing current and near-future problems, which proved valuable but might have hindered the pursuit of more innovative, forward-thinking ideas. He believes changes within Google and Go, as well as the evolving programming landscape, have led to his departure, citing a growing sense that he's no longer a good fit.\n\nDespite leaving Google, Taylor remains interested in Go and believes the language needs continuous evolution, particularly its standard library. He plans to take a break but hopes to contribute to Go again in the future.\n\nThe post includes comments from others who appreciate Taylor's work and presence in the Go community. One commenter, cuishuang, expresses the sentiment that Taylor's departure is an immeasurable loss to the language and community.\n",
    "chinese_title": "离开谷歌",
    "chinese_summary": "Go语言关键贡献者 Ian Lance Taylor 宣布离开 Google，结束 19 年任期。Taylor 于 2008 年加入 Go 团队，在 Go 语言的开发和推广中发挥了重要作用。\n\n他回顾了 Go 语言出乎意料的成功，超越了最初仅影响其他语言的期望，并强调了他的贡献，包括为 GCC 创建 Go 前端，以及为 Google 的构建系统和 SWIG 添加 Go 支持。他还曾管理团队一段时间，并帮助开发和实施了泛型。\n\nTaylor 指出，他的方法侧重于解决当前和近期的难题，这被证明是有价值的，但可能阻碍了对更具创新性和前瞻性想法的追求。他认为 Google 和 Go 内部的变化，以及不断发展的编程格局，导致了他的离开，他感到自己不再适合。\n\n尽管离开 Google，Taylor 仍然对 Go 感兴趣，并认为该语言需要不断发展，尤其是其标准库。他计划休息一段时间，但希望将来能再次为 Go 做出贡献。\n\n该帖子包含其他人对 Taylor 的工作和他在 Go 社区的贡献表示感谢的评论。一位评论者 cuishuang 表示，Taylor 的离开对该语言和社区来说是不可估量的损失。"
  },
  {
    "id": "43924560",
    "title": "SDFs and the Fast sweeping algorithm in Jax",
    "url": "https://rohangautam.github.io/blog/fast_sweeping/fastsweeping/",
    "summary": "This blog post explores the Fast Sweeping Method (FSM) as a way to solve the Eikonal equation in JAX, particularly for applications involving Signed Distance Functions (SDFs). The Eikonal equation models wavefront propagation, and its solutions can be used for various problems, including shortest paths, medical imaging, and creating SDFs for implicit surface representations in machine learning.\n\nThe post contrasts Lagrangian front evolution with the Eulerian level set method, highlighting how the latter tracks interfaces implicitly on a fixed grid using the zero level set of a function. Traditional numerical methods struggle with the singularities and shocks that can arise in the Eikonal equation, motivating the use of handcrafted algorithms like FSM.\n\nFSM offers a faster O(n) solution compared to the Fast Marching Method's O(n log n) time complexity. The algorithm works by performing sweeps across the grid in different directions, approximating the arrival time in each direction and combining them. The spatial derivative is approximated using a Godunov upwind difference scheme.\n\nThe author provides both NumPy and JAX implementations of the FSM algorithm, emphasizing the efficiency gains achieved through JAX's just-in-time compilation. Benchmarks demonstrate the JAX code's superior performance compared to NumPy, although a dedicated C++ library (skfmm) is even faster. The post concludes with a discussion of an attempt to parallelize the FSM algorithm using JAX, which faced challenges due to tracing limitations.\n",
    "chinese_title": "Jax中的SDFs和快速扫描算法",
    "chinese_summary": "本文探讨了快速扫描法(FSM)作为在JAX中求解Eikonal方程的一种方法，尤其适用于涉及符号距离函数(SDFs)的应用。Eikonal方程模拟波前传播，其解可用于各种问题，包括最短路径、医学成像以及为机器学习中的隐式表面表示创建SDF。\n\n文章对比了拉格朗日前沿演化和欧拉水平集方法，强调后者如何使用函数的零水平集在固定网格上隐式地跟踪界面。传统的数值方法难以处理Eikonal方程中可能出现的奇点和冲击波，这促使人们使用像FSM这样手工设计的算法。\n\n相比于快速行进法(FMM)的O(n log n)时间复杂度，FSM提供了一种更快的O(n)解决方案。该算法通过在不同方向上扫描网格来工作，近似每个方向上的到达时间并将它们组合起来。空间导数使用Godunov迎风差分格式进行近似。\n\n作者提供了FSM算法的NumPy和JAX实现，强调了通过JAX的即时编译所获得的效率提升。基准测试表明，JAX代码的性能优于NumPy，尽管专用的C++库(skfmm)速度甚至更快。文章最后讨论了使用JAX并行化FSM算法的尝试，但由于跟踪限制而面临挑战。"
  },
  {
    "id": "43961573",
    "title": "Microbe that infests hospitals can digest medical-grade plastic ― a first",
    "url": "https://www.nature.com/articles/d41586-025-01412-5",
    "summary": "A strain of the bacterium *Pseudomonas aeruginosa*, commonly found in hospitals and known to cause infections, has been discovered to break down medical-grade plastic, specifically polycaprolactone (PCL). Researchers in the UK identified an enzyme, Pap1, in this strain that enables it to degrade PCL, a biodegradable plastic often used in healthcare. This is significant because previously, plastic-degrading enzymes were only found in environmental bacteria, not in hospital pathogens.\n\nThe discovery raises concerns because if *P. aeruginosa* can degrade plastic, it could compromise the integrity of plastic-containing medical devices like sutures and implants, negatively impacting patient outcomes. The researchers confirmed Pap1's role by inserting the gene into *E. coli*, which then broke down PCL, and by deleting the gene from *P. aeruginosa*, which then lost its ability to degrade the plastic.\n\nFurthermore, the study found that the enzyme increases biofilm formation, potentially leading to increased antibiotic resistance. Experiments with greater wax moth larvae showed that the bacterium was more harmful when a PCL implant was present, highlighting the potential consequences of this plastic-degrading ability in a biological context.\n",
    "chinese_title": "能侵染医院的微生物能分解医用塑料，尚属首次",
    "chinese_summary": "一种常见于医院且已知会导致感染的细菌铜绿假单胞菌，被发现可以分解医用级塑料，特别是聚己内酯（PCL）。英国的研究人员在该菌株中发现了一种酶，Pap1，使之能够降解PCL，一种常用于医疗保健的可生物降解塑料。这非常重要，因为之前，降解塑料的酶只在环境细菌中发现，而不是在医院病原体中。\n\n这一发现引起了人们的担忧，因为如果铜绿假单胞菌能够降解塑料，它可能会损害含有塑料的医疗设备（如缝线和植入物）的完整性，从而对患者的治疗结果产生负面影响。研究人员通过将该基因插入大肠杆菌，使其分解PCL，以及从铜绿假单胞菌中删除该基因，使其丧失降解塑料的能力，从而证实了Pap1的作用。\n\n此外，该研究发现该酶会增加生物膜的形成，可能导致抗生素耐药性的增加。用大蜡螟幼虫进行的实验表明，当存在PCL植入物时，该细菌的危害更大，突显了这种塑料降解能力在生物环境中的潜在后果。"
  },
  {
    "id": "43955374",
    "title": "Klarna changes its AI tune and again recruits humans for customer service",
    "url": "https://www.customerexperiencedive.com/news/klarna-reinvests-human-talent-customer-service-AI-chatbot/747586/",
    "summary": "Klarna is reversing its strategy of relying heavily on AI for customer service and is now re-introducing human representatives alongside its AI chatbot. This shift comes a year after the \"buy now, pay later\" company claimed its AI could replace 700 customer service agents. Klarna now believes customers should always have the option of speaking with a human, prioritizing empathy and complex problem-solving that AI cannot fully provide.\n\nThe company's CEO, Sebastian Siemiatkowski, acknowledged that they previously focused too much on cost savings with AI, leading to lower quality service. Klarna is now recruiting workers for a flexible, remote \"Uber-type\" customer service model, offering competitive pay to attract skilled individuals who can handle complex issues while providing real-time product feedback. The goal is also to reduce reliance on outsourced customer service.\n\nWhile the AI chatbot still handles two-thirds of customer inquiries and has improved response times and reduced repeat issues, Klarna recognizes the value of human interaction, particularly for sensitive situations. This strategic adjustment aligns with broader consumer sentiment that prioritizes empathy and human connection in customer service, especially when dealing with complex or emotional issues. Experts emphasize that AI should augment human agents, not replace them, to ensure customer satisfaction and loyalty.\n",
    "chinese_title": "Klarna转变AI策略，重新启用人工客服",
    "chinese_summary": "Klarna 扭转策略：重新引入人工客服，不再过度依赖 AI"
  },
  {
    "id": "43953722",
    "title": "Show HN: GlassFlow – OSS streaming dedup and joins from Kafka to ClickHouse",
    "url": "https://github.com/glassflow/clickhouse-etl",
    "summary": "GlassFlow is an open-source real-time stream processor designed to simplify data pipeline creation and management between Kafka and ClickHouse. Targeted at data engineers, it offers built-in deduplication and temporal join functionalities to handle late-arriving events and ensure data correctness.\n\nKey features include:\n\n*   **Streaming Deduplication:** Real-time deduplication with configurable time windows (up to 7 days) prevents duplicate data in ClickHouse.\n*   **Temporal Stream Joins:** Real-time joining of two Kafka streams, also with configurable time windows (up to 7 days), simplifies the creation of joined data streams for ClickHouse.\n*   **Built-in Kafka Connector:** Powered by NATS-Kafka Bridge, it automates data extraction from Kafka topics and supports multiple partitions and JSON data.\n*   **Optimized ClickHouse Sink:** Native connection, configurable batch sizes and retry mechanisms ensure efficient data ingestion into ClickHouse, including JSON data.\n*   **User-Friendly Web UI:** Facilitates pipeline configuration, management, and monitoring.\n\nGlassFlow provides a quick start guide with Docker Compose, a local development setup, and a comprehensive demo environment including Kafka, ClickHouse, sample data, and example pipelines. The architecture involves a GlassFlow API (written in Go), a web UI, NATS for internal communication, and a Kafka Bridge. Pipeline configurations are defined in JSON, specifying source (Kafka), sink (ClickHouse), and optional join parameters. The project is licensed under Apache License 2.0 and welcomes contributions.\n",
    "chinese_title": "Show HN: GlassFlow – 从 Kafka 到 ClickHouse 的 OSS 流式去重和连接",
    "chinese_summary": "GlassFlow：一款开源实时流处理器，旨在简化 Kafka 和 ClickHouse 之间的数据管道创建和管理。它面向数据工程师，提供内置的去重和时间连接功能，以处理延迟到达的事件并确保数据正确性。\n\n主要功能包括：\n\n*   **流式去重：** 具有可配置时间窗口（最长 7 天）的实时去重，防止 ClickHouse 中出现重复数据。\n*   **时态流连接：** 实时连接两个 Kafka 流，同样具有可配置时间窗口（最长 7 天），简化了 ClickHouse 连接数据流的创建。\n*   **内置 Kafka 连接器：** 由 NATS-Kafka Bridge 驱动，自动从 Kafka 主题提取数据，并支持多个分区和 JSON 数据。\n*   **优化的 ClickHouse Sink：** 原生连接、可配置的批处理大小和重试机制确保将数据高效摄取到 ClickHouse 中，包括 JSON 数据。\n*   **用户友好的 Web UI：** 方便管道配置、管理和监控。\n\nGlassFlow 提供了一个使用 Docker Compose 的快速入门指南、一个本地开发设置，以及一个包含 Kafka、ClickHouse、示例数据和示例管道的综合演示环境。 该架构涉及 GlassFlow API（用 Go 编写）、Web UI、用于内部通信的 NATS 和 Kafka Bridge。 管道配置在 JSON 中定义，指定源（Kafka）、Sink（ClickHouse）和可选的连接参数。 该项目在 Apache License 2.0 许可下发布，并欢迎贡献。"
  },
  {
    "id": "43913414",
    "title": "Lazarus Release 4.0",
    "url": "https://forum.lazarus.freepascal.org/index.php?topic=71050.0",
    "summary": "This is a forum announcement for Lazarus Release 4.0. The forum is dedicated to the Lazarus IDE and the Free Pascal compiler. It includes links to various resources such as the Lazarus and Free Pascal websites, downloads, documentation, bug trackers, mailing lists, and project information. The forum also features a list of recent posts covering various topics related to Lazarus development, including porting, startup options, visual components, Free Pascal issues, help requests, and general programming questions. It displays the post titles and authors, along with the time of the last post. The forum navigation includes links to previous and next pages, allowing users to browse through the discussions. The bottom of the page provides information about the forum software (SMF) and the TinyPortal add-on.\n",
    "chinese_title": "Lazarus 4.0 发布",
    "chinese_summary": "这是Lazarus 4.0版本发布的论坛公告。该论坛致力于Lazarus IDE和Free Pascal编译器，包含Lazarus和Free Pascal网站、下载、文档、Bug追踪器、邮件列表和项目信息等各种资源链接。论坛还展示了近期发布的帖子列表，涵盖与Lazarus开发相关的各种主题，包括移植、启动选项、可视化组件、Free Pascal问题、求助请求和通用编程问题。它显示帖子标题和作者，以及上次发帖的时间。论坛导航包含上一页和下一页的链接，允许用户浏览讨论内容。页面底部提供了关于论坛软件（SMF）和TinyPortal插件的信息。"
  },
  {
    "id": "43955025",
    "title": "US Copyright Office: Generative AI Training [pdf]",
    "url": "https://www.copyright.gov/ai/Copyright-and-Artificial-Intelligence-Part-3-Generative-AI-Training-Report-Pre-Publication-Version.pdf",
    "summary": "This document appears to be a US Copyright Office document related to generative AI training, judging by the title. However, the content consists of encoded data, likely the PDF's binary information, and is unreadable in its current form. Therefore, it is impossible to extract meaningful information about the specifics of the copyright office's stance, guidelines, or discussion related to generative AI training from the provided text. In order to provide an accurate summary, the actual text of the PDF would need to be extracted and interpreted.\n",
    "chinese_title": "美国版权局：生成式人工智能训练 [pdf]",
    "chinese_summary": "这份文件标题显示为美国版权局关于生成式AI训练的文件。然而，其内容为编码数据，可能是PDF的二进制信息，目前无法读取。因此，无法从提供的文本中提取关于版权局对生成式AI训练的立场、指南或讨论的具体信息。为了提供准确的摘要，需要提取并解读PDF的实际文本内容。"
  },
  {
    "id": "43924082",
    "title": "An Introduction to Solid Queue for Ruby on Rails",
    "url": "https://blog.appsignal.com/2025/05/07/an-introduction-to-solid-queue-for-ruby-on-rails.html",
    "summary": "This article introduces Solid Queue, a new background job processing library in Rails 8, highlighting its unique feature of relying solely on the database, eliminating the need for Redis or other external dependencies. This aligns with Rails' goal of reducing operational overhead for new applications.\n\nThe article explains the core components: Jobs (ActiveRecord models representing the tasks) and Workers (processes that execute the tasks). Communication between Jobs and Workers happens through the database, using multiple tables to manage job states (e.g., `solid_queue_jobs`, `solid_queue_ready_executions`, `solid_queue_claimed_executions`).\n\nThe lifecycle of a job is detailed, from enqueueing (creating records in the `jobs` and `ready_executions` tables) to worker claiming (creating a record in `claimed_executions`) and eventual execution.\n\nPerformance is achieved through clever database design, particularly the use of the `solid_queue_ready_executions` table for quick polling and `FOR UPDATE SKIP LOCKED` to prevent worker blocking during polling. SQLite doesn't support `SKIP LOCKED`, creating a limitation to consider.\n\nThe article emphasizes job safety, explaining how the `solid_queue_claimed_executions` and `solid_queue_processes` tables, along with a supervisor process, prevent jobs from being lost if workers crash. The supervisor monitors worker heartbeats and re-queues jobs claimed by inactive workers.\n\nThe article concludes by mentioning further features like scheduling recurring and sequential jobs, promising a deeper dive in the next part of the series.\n",
    "chinese_title": "Ruby on Rails 的 Solid Queue 简介",
    "chinese_summary": "本文介绍了 Rails 8 中新的后台任务处理库 Solid Queue，强调了其仅依赖数据库的独特功能，无需 Redis 或其他外部依赖项。这符合 Rails 降低新应用程序运营开销的目标。\n\n文章解释了核心组件：任务（代表任务的 ActiveRecord 模型）和工作进程（执行任务的进程）。任务和工作进程之间的通信通过数据库进行，使用多个表来管理任务状态（例如，`solid_queue_jobs`、`solid_queue_ready_executions`、`solid_queue_claimed_executions`）。\n\n文章详细介绍了任务的生命周期，从入队（在 `jobs` 和 `ready_executions` 表中创建记录）到工作进程声明（在 `claimed_executions` 中创建记录）以及最终执行。\n\n通过巧妙的数据库设计实现了性能，特别是使用 `solid_queue_ready_executions` 表进行快速轮询，并使用 `FOR UPDATE SKIP LOCKED` 来防止工作进程在轮询期间阻塞。SQLite 不支持 `SKIP LOCKED`，因此存在需要考虑的限制。\n\n文章强调了任务安全性，解释了 `solid_queue_claimed_executions` 和 `solid_queue_processes` 表，以及一个监督进程如何防止任务在工作进程崩溃时丢失。监督进程监视工作进程的心跳，并重新排队由不活动工作进程声明的任务。\n\n文章最后提到了一些其他功能，例如调度重复性和顺序性任务，并承诺在下一部分中进行更深入的探讨。"
  },
  {
    "id": "43954178",
    "title": "JEP 515: Ahead-of-Time Method Profiling",
    "url": "https://openjdk.org/jeps/515",
    "summary": "JEP 515 proposes \"Ahead-of-Time Method Profiling\" to improve Java application startup and warmup times by leveraging method execution profiles collected during training runs. Currently, the JVM collects profiles during the initial part of an application's execution, leading to a performance slowdown during the warmup period. This JEP aims to shift profile collection to a separate training run, storing the profiles in the existing AOT (Ahead-of-Time) cache introduced by JEP 483.\n\nBy making these profiles available to the JVM at startup, the JIT (Just-In-Time) compiler can immediately generate optimized native code, reducing the warmup time. The key goals include accelerating warmup, requiring no code changes, introducing no new execution constraints, and using existing AOT cache workflows.\n\nThe cached profiles will supplement, not replace, ongoing profiling during production runs, allowing the JVM to adapt to potential behavioral changes. This approach combines the benefits of AOT profiles, online profiling, and JIT compilation. Testing will involve new unit tests and existing AOT cache tests to ensure functionality and stability. The underlying assumption is that training runs provide useful data that translates to performance improvements in production.\n",
    "chinese_title": "JEP 515：提前编译方法分析",
    "chinese_summary": "JEP 515 提议“提前编译方法分析”，通过利用在训练运行期间收集的方法执行配置文件来改善 Java 应用程序的启动和预热时间。目前，JVM 在应用程序执行的初始阶段收集配置文件，导致预热期间性能下降。此 JEP 旨在将配置文件收集转移到单独的训练运行中，并将配置文件存储在 JEP 483 引入的现有 AOT（提前编译）缓存中。\n\n通过在启动时使这些配置文件可供 JVM 使用，JIT（即时）编译器可以立即生成优化的本机代码，从而缩短预热时间。主要目标包括加速预热、无需修改代码、不引入新的执行约束以及使用现有的 AOT 缓存工作流程。\n\n缓存的配置文件将补充，而不是取代生产运行期间的持续分析，从而使 JVM 能够适应潜在的行为变化。这种方法结合了 AOT 配置文件、在线分析和 JIT 编译的优势。测试将涉及新的单元测试和现有的 AOT 缓存测试，以确保功能和稳定性。基本假设是，训练运行提供有用的数据，可以转化为生产中的性能改进。"
  },
  {
    "id": "43933605",
    "title": "Hill or High Water",
    "url": "https://royalsociety.org/blog/2025/05/hill-or-high-water/",
    "summary": "Ainsley Vinall's \"Hill or High Water\" highlights a recently catalogued collection of over 300 photographic slides from the 1958-59 Royal Society expedition to Southern Chile, donated by expedition leader Sir Martin Holdgate. The expedition, coinciding with the centenary of Darwin's \"On the Origin of Species,\" aimed to reassess sites visited by Darwin and investigate species common to New Zealand, Australia, and South America, contributing to the emerging understanding of plate tectonics.\n\nThe team of five scientists, including zoologist Holdgate, botanist Eric Godley, marine biologist George Knox, geologist William Watters, and entomologist Guillermo Kuschel, explored various locations in Chile, starting from Santiago and progressing to Chepu on Chiloé Island, the San Pedro Mountain Range, Puerto Edén on Wellington Island, Punta Arenas, and finally, Puerto Williams on Navarino Island.\n\nThe expedition documented local landscapes, wildlife, and the daily life of the indigenous Kawésqar people in Puerto Edén, providing a valuable insight into their unique culture. The photographs reveal relatively untouched landscapes, particularly in the southernmost islands. Upon returning to the UK, the party shared their findings in a conference and published them in Proceedings B, also holding an exhibition in 1961. The catalogued photographs serve as a historical record of the expedition, the landscape, and the lives of the people of Southern Chile over 65 years ago.\n",
    "chinese_title": "不成功便成仁",
    "chinese_summary": "Ainsley Vinall 的《不顾一切》（Hill or High Water）重点介绍了近期编目的、由探险队队长 Martin Holdgate 爵士捐赠的 1958-59 年英国皇家学会南智利探险队的 300 多张幻灯片。该探险队恰逢达尔文《物种起源》一百周年纪念，旨在重新评估达尔文考察过的地点，并调查新西兰、澳大利亚和南美洲共有的物种，从而促进对板块构造的新兴理解。\n\n该团队由五位科学家组成，包括动物学家 Holdgate、植物学家 Eric Godley、海洋生物学家 George Knox、地质学家 William Watters 和昆虫学家 Guillermo Kuschel，他们探索了智利的多个地点，从圣地亚哥开始，到奇洛埃岛的 Chepu、圣佩德罗山脉、惠灵顿岛的 Puerto Edén、蓬塔阿雷纳斯，最后到达纳瓦里诺岛的 Puerto Williams。\n\n探险队记录了当地的景观、野生动物以及 Puerto Edén 当地 Kawésqar 人的日常生活，为了解他们独特的文化提供了宝贵的见解。这些照片展示了相对未受破坏的景观，尤其是在最南端的岛屿上。回到英国后，该团队在一次会议上分享了他们的发现，并在 Proceedings B 上发表了成果，还在 1961 年举办了一次展览。编目的照片记录了 65 多年前的探险、景观和南智利人民的生活，具有重要的历史意义。"
  },
  {
    "id": "43949542",
    "title": "Observations from people-watching",
    "url": "https://skincontact.substack.com/p/21-observations-from-people-watching",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "观察人",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "43915470",
    "title": "Strain gauge made out of PCB",
    "url": "https://github.com/vapetrov/PCB_strain_gauge",
    "summary": "This article describes a PCB strain gauge, a sensor designed to measure small deflections using the circuit board itself as the sensing element. It's sensitive enough to measure micrometers of deflection with a full-scale range of +/- 3cm. The project provides multiple PCB designs, including versions with 4-element and 2-element sensing bridges (for potentially lower thermal drift), along with a stiffener for the component side. The recommended board thickness is 0.6mm, but this can be adjusted for specific applications.\n\nThe project is designed for easy hand assembly, avoiding the need for specialized equipment like hot air or reflow ovens. It can be used standalone with a microcontroller (Seeed Studio XIAO RP2040) or interfaced with an external one via header pins. The design allows for omitting certain components like the external ADC and bias voltage generator with minor modifications.\n\nSample firmware for calibration and continuous sampling is provided, along with a Python script for data visualization. The article highlights the importance of allowing the board to reach a stable operating temperature before calibration for high-sensitivity measurements. Users can customize the shape of the sensing element using a provided Python notebook and SVG editing tools to generate custom KiCad footprints. The design files, including PCB layouts and example code, are available for download.\n",
    "chinese_title": "PCB应变计",
    "chinese_summary": "本文介绍了一种PCB应变计，这是一种利用电路板本身作为传感元件来测量微小挠度的传感器。它非常灵敏，能够测量微米级的挠度，满量程范围为+/- 3厘米。该项目提供了多种PCB设计，包括带有4元件和2元件传感桥的版本（可能降低热漂移），以及用于元件侧的加强筋。建议的板厚为0.6毫米，但可以根据具体应用进行调整。\n\n该项目设计易于手工组装，无需热风或回流焊炉等专用设备。它可以与微控制器（Seeed Studio XIAO RP2040）独立使用，也可以通过排针与外部微控制器连接。该设计允许通过少量修改省略某些组件，例如外部ADC和偏置电压发生器。\n\n提供了用于校准和连续采样的示例固件，以及用于数据可视化的Python脚本。本文强调了在高灵敏度测量之前，允许电路板达到稳定的工作温度的重要性。用户可以使用提供的Python notebook和SVG编辑工具自定义传感元件的形状，以生成自定义的KiCad封装。设计文件，包括PCB布局和示例代码，均可供下载。"
  },
  {
    "id": "43964639",
    "title": "Kennedy Is Right About the Chemicals in Our Food",
    "url": "https://www.nytimes.com/2025/05/12/opinion/kennedy-ultraprocessed-food-dyes.html",
    "summary": "This article argues that while Robert F. Kennedy Jr. has a history of promoting pseudoscience, his concerns about chemicals in the U.S. food supply are valid and potentially understated. The article highlights that the U.S. allows an estimated 10,000 additives in food, often used in ultra-processed foods.\n\nA key concern is the GRAS (\"generally recognized as safe\") regulatory pathway, which allows companies to self-certify the safety of many chemicals without prior FDA approval. This means the food industry, rather than federal regulators, often vets the safety of ingredients. Researchers estimate that around 1,000 chemicals in our food are unknown to regulators. Kennedy is reportedly working to close this loophole.\n\nThe article further criticizes the FDA's limited testing scope, which primarily focuses on cancer, genetic mutations, and organ damage, neglecting to investigate the subtle, long-term effects of these chemicals on chronic diseases like obesity, cardiovascular disease, and diabetes. The cumulative effect of consuming hundreds or thousands of chemicals is also not adequately studied. Moreover, the FDA doesn't routinely re-examine existing chemicals based on new scientific findings, unlike European regulators. The article concludes that the FDA's reliance on outdated science and principles is inadequate for ensuring food safety.\n",
    "chinese_title": "肯尼迪对我们食物中的化学物质是正确的",
    "chinese_summary": "本文认为，尽管小罗伯特·F·肯尼迪曾有推广伪科学的历史，但他对美国食品供应中化学物质的担忧是合理且可能被低估的。文章强调，美国允许估计有10,000种食品添加剂，这些添加剂通常用于超加工食品。\n\n一个关键问题是GRAS（“通常被认为是安全的”）监管途径，该途径允许公司自行证明许多化学品的安全性，而无需事先获得FDA的批准。这意味着通常是食品行业，而不是联邦监管机构，来审查成分的安全性。研究人员估计，我们食物中大约有1000种化学物质是监管机构未知的。据报道，肯尼迪正在努力堵住这个漏洞。\n\n文章进一步批评了FDA有限的测试范围，主要侧重于癌症、基因突变和器官损伤，而忽略了调查这些化学物质对肥胖、心血管疾病和糖尿病等慢性疾病的微妙而长期的影响。 此外，对食用数百或数千种化学物质的累积效应的研究也不足。而且，与欧洲监管机构不同，FDA不会根据新的科学发现来例行地重新检查现有化学物质。 文章总结说，FDA对过时科学和原则的依赖不足以确保食品安全。"
  },
  {
    "id": "43949855",
    "title": "The History and Legacy of Visual Basic",
    "url": "https://retool.com/visual-basic",
    "summary": "This article details the origins of Visual Basic, tracing its roots back to Alan Cooper's shell construction set, Tripod (later Ruby), created in the late 1980s. Cooper aimed to improve the rudimentary Windows shell by allowing users to customize it with drag-and-drop \"gizmos.\"\n\nCooper's demo of Tripod impressed Bill Gates, who acquired the project for Microsoft. Cooper and his team rewrote Tripod, renamed Ruby, but it was ultimately excluded from Windows 3.0 due to internal politics and a shift in Microsoft's strategy towards OS/2.\n\nGates, recognizing the potential of a visual programming environment, repurposed Ruby by replacing its internal language with BASIC, creating Visual Basic. The Business Languages Group, initially reluctant, tasked a young team (codenamed “Thunder”) to develop it, relying heavily on Michael Geary from Cooper's original team for expertise.\n\nThe development process was longer and more complex than anticipated, involving significant architectural changes, including replacing Ruby's event-passing system with Omega's Embedded Basic code editor and event model. While Cooper's initial vision of a customizable shell wasn't realized in the same way, it paved the way for Visual Basic, which became a dominant programming environment.\n",
    "chinese_title": "Visual Basic 的历史与遗产",
    "chinese_summary": "本文详细介绍了Visual Basic的起源，追溯至Alan Cooper在20世纪80年代末创建的shell构建工具集Tripod（后更名为Ruby）。Cooper旨在通过允许用户使用拖放式的“小工具”自定义Windows shell，从而改进其简陋的用户界面。\n\nCooper对Tripod的演示给比尔·盖茨留下了深刻印象，他收购了该项目供微软使用。Cooper及其团队重写了Tripod，并更名为Ruby，但由于内部政治和微软向OS/2战略的转变，最终未能包含在Windows 3.0中。\n\n盖茨意识到可视化编程环境的潜力，将Ruby重新定位，用BASIC取代了其内部语言，从而创建了Visual Basic。最初不太情愿的商业语言组指派了一个年轻的团队（代号为“Thunder”）来开发它，并大量依赖Cooper原始团队中的Michael Geary的专业知识。\n\n开发过程比预期的时间更长、更复杂，涉及重大的架构变更，包括用Omega的嵌入式BASIC代码编辑器和事件模型替换Ruby的事件传递系统。虽然Cooper最初的可定制shell的愿景并未以相同的方式实现，但它为Visual Basic铺平了道路，后者成为一种主导性的编程环境。"
  },
  {
    "id": "43916818",
    "title": "Is there a balance to be struck between simple hierarchical models and",
    "url": "https://statmodeling.stat.columbia.edu/2024/05/26/is-there-a-balance-to-be-struck-between-simple-hierarchical-models-and-more-complex-hierarchical-models-that-augment-the-simple-frameworks-with-more-modeled-interactions-when-analyzing-real-data/",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "在简单的层级模型和……之间，是否需要寻求某种平衡？",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "43951368",
    "title": "Fan Service",
    "url": "https://flak.tedunangst.com/post/fan-service",
    "summary": "This article details the author's journey in creating an ASUS ACPI WMI driver for OpenBSD to control laptop fan speed, a feature typically accessible via Fn-F5 or Fn-F on ASUS laptops but non-functional in OpenBSD.\n\nThe author explains the basics of ACPI and WMI, highlighting how they allow the operating system to communicate with hardware and access vendor-specific functionalities. OpenBSD lacks a WMI driver, prompting the author to build one leveraging insights from the Linux driver for ASUS laptops.\n\nThe process involved several stages: identifying GUIDs and ACPI event codes, deciphering ACPI code using acpidump and iasl, and understanding how to set device states for features like keyboard backlight and fan profiles. The author encountered challenges like incorrect byte ordering, misinterpreting ACPI event codes, and identifying the correct device ID for fan control.\n\nEventually, through analyzing the Linux driver and the system's ACPI code, the author successfully created a driver that allows toggling fan speeds between whisper mode and megablast turbo mode. This impacts performance and battery life.\n\nThe author contrasts OpenBSD's code organization, which keeps related C and header files together for easier navigation, with Linux's more structured but less intuitive file arrangement. The result is a working fan control solution that improves user experience and battery performance on ASUS laptops running OpenBSD.\n",
    "chinese_title": "粉丝福利",
    "chinese_summary": "本文详细介绍了作者为 OpenBSD 创建 ASUS ACPI WMI 驱动以控制笔记本电脑风扇速度的历程。该功能通常可以通过 ASUS 笔记本电脑上的 Fn-F5 或 Fn-F 访问，但在 OpenBSD 中无法使用。\n\n作者解释了 ACPI 和 WMI 的基础知识，强调了它们如何允许操作系统与硬件通信并访问供应商特定的功能。OpenBSD 缺乏 WMI 驱动，这促使作者利用从 Linux 的 ASUS 笔记本电脑驱动程序中获得的见解来构建一个。\n\n该过程涉及几个阶段：识别 GUID 和 ACPI 事件代码，使用 acpidump 和 iasl 解读 ACPI 代码，以及了解如何设置设备状态以实现键盘背光和风扇配置文件等功能。作者遇到了诸如错误的字节顺序、误解 ACPI 事件代码以及识别用于风扇控制的正确设备 ID 等挑战。\n\n最终，通过分析 Linux 驱动程序和系统的 ACPI 代码，作者成功创建了一个驱动程序，该驱动程序允许在静音模式和超速涡轮模式之间切换风扇速度。 这会影响性能和电池续航时间。\n\n作者将 OpenBSD 的代码组织方式与 Linux 进行了对比，OpenBSD 将相关的 C 和头文件放在一起以便于导航，而 Linux 的文件安排更结构化但不太直观。 最终的结果是一个可用的风扇控制解决方案，可改善在运行 OpenBSD 的 ASUS 笔记本电脑上的用户体验和电池性能。"
  },
  {
    "id": "43958968",
    "title": "Bios Boot to D",
    "url": "https://theartofmachinery.com/2017/01/24/boot_to_d.html",
    "summary": "This article details the process of creating a BIOS bootloader that loads and executes D code on a PC. It begins by explaining the basics of assembly language, particularly Intel syntax. The author then walks through the steps a PC takes during startup, from the BIOS POST to loading the first 512 bytes of a bootable disk into memory at address 0x7c00.\n\nThe article emphasizes the challenges of working within the constraints of 16-bit real mode, including limited memory access (1MiB) and the need to handle the infamous A20 gate. The bootloader's tasks include saving the boot disk number, setting segment registers, enabling the A20 line, and loading the OS payload from disk.\n\nA key challenge is loading the OS (D code) when BIOS disk drivers only function in real mode, while larger OS payloads require protected mode. The article explains a strategy of switching between real and protected modes to load the OS in chunks, using functions that always return to real mode.\n\nThe author describes the process of entering 32-bit protected mode, including setting up the Global Descriptor Table (GDT) to define memory segments. Finally, it covers copying the OS chunk into high memory and the eventual execution of the loaded D code.\n",
    "chinese_title": "BIOS 从D盘启动",
    "chinese_summary": "本文详细介绍了在PC上创建加载并执行D代码的BIOS引导加载程序的过程。首先解释了汇编语言的基础知识，特别是Intel语法。然后，作者逐步介绍了PC在启动过程中所采取的步骤，从BIOS POST到将可引导磁盘的前512个字节加载到地址0x7c00的内存中。\n\n本文强调了在16位实模式的约束下工作的挑战，包括有限的内存访问（1MiB）和处理臭名昭著的A20栅极的必要性。引导加载程序的任务包括保存启动磁盘号，设置段寄存器，启用A20线以及从磁盘加载OS有效负载。\n\n一个关键的挑战是在BIOS磁盘驱动程序仅在实模式下起作用时加载OS（D代码），而更大的OS有效负载需要保护模式。本文解释了一种在实模式和保护模式之间切换以分块加载OS的策略，使用始终返回到实模式的函数。\n\n作者描述了进入32位保护模式的过程，包括设置全局描述符表（GDT）以定义内存段。最后，它涵盖了将OS块复制到高位内存以及最终执行加载的D代码。"
  },
  {
    "id": "43949056",
    "title": "Why the Apple II Didn't Support Lowercase Letters (2020)",
    "url": "https://www.vintagecomputing.com/index.php/archives/2833/why-the-apple-ii-didnt-support-lowercase-letters",
    "summary": "This article, penned by Steve Wozniak and published on How-To Geek, explains why the original Apple II computer lacked lowercase letter support. Wozniak reveals that his limited financial resources in the early 1970s were the primary reason.\n\nHe initially created a TV Terminal for accessing the ARPAnet, using a $60 (equivalent to about $333 today) uppercase-only keyboard, the cheapest option available. This financial constraint carried over to the Apple I and II development.\n\nWozniak had already built his TV Terminal with the uppercase keyboard before conceiving of the Apple computer. While he desired lowercase support, adding it would have required rewriting his BASIC interpreter code, a \"horrendous and risky job\" done entirely by hand due to lack of funds for a timeshare assembler. He discussed the issue with Steve Jobs, who didn't prioritize lowercase, and ultimately, the financial limitations dictated the design. Wozniak hand-wrote all 8KB of code for the Apple II, further solidifying the uppercase-only limitation.\n\nThe article also includes reader comments discussing copyright issues, potential clones, and the \"cut trace\" modification for enabling lowercase typing on some Apple II models. Benj Edwards, the editor, adds that Wozniak's resourcefulness, born from necessity, ultimately led to the creation of the Apple I and II.\n",
    "chinese_title": "为什么Apple II不支持小写字母 (2020)",
    "chinese_summary": "史蒂夫·沃兹尼亚克在 How-To Geek 上发表的文章解释了最初的 Apple II 电脑为何不支持小写字母。沃兹尼亚克透露，20世纪70年代初他有限的财政资源是主要原因。\n\n最初，他为了访问 ARPAnet 创建了一个电视终端，使用了一个 60 美元（相当于今天的约 333 美元）的仅支持大写的键盘，这是当时最便宜的选择。 这种财务限制延续到了 Apple I 和 II 的开发中。\n\n在构思 Apple 电脑之前，沃兹尼亚克已经用大写键盘构建了他的电视终端。 虽然他想要小写字母支持，但添加它将需要重写他的 BASIC 解释器代码，这是一项“可怕且冒险的工作”，完全是手工完成的，因为没有资金购买分时汇编器。 他与史蒂夫·乔布斯讨论了这个问题，乔布斯并没有优先考虑小写字母，最终，财务限制决定了设计。 沃兹尼亚克手工编写了 Apple II 的全部 8KB 代码，进一步巩固了仅支持大写的限制。\n\n文章还包括读者评论，讨论了版权问题、潜在的克隆版本，以及用于在某些 Apple II 型号上启用小写字母输入的“切割走线”修改方法。 编辑本杰·爱德华兹补充说，沃兹尼亚克的足智多谋，源于必要性，最终促成了 Apple I 和 II 的诞生。"
  },
  {
    "id": "43960491",
    "title": "HTML Time Tags and DRY (HARC Stack)",
    "url": "https://rakujourney.wordpress.com/2025/05/12/harc-stack-semantic-time/",
    "summary": "This article, the fourth in a series about the HARC Stack (HTMX, Raku Air, Red, and Cro), focuses on the `time` tag in HTML and how Air::Base provides a DRY (Don't Repeat Yourself) approach to its implementation.\n\nThe author highlights the importance of semantic HTML tags and how Air::Functional lets developers use functional code style for HTML construction. The problem with the standard HTML `time` tag is that it requires redundant, and potentially error-prone, entry of both the machine-readable datetime attribute and the human-readable text.\n\nAir::Base's `time` tag solution leverages the server-side capabilities of Raku to automatically generate the human-readable date and time from the `datetime` attribute provided in the code. This eliminates redundancy and ensures consistency.  Developers can specify the format using a `mode` attribute (`time`, `datetime`, or `date`), with `date` being the default.\n\nThe author emphasizes the benefits of this approach: improved maintainability, reduced errors, and the alignment of semantic time with the programmatic time value.  The `Time` role in Air::Base is also composable, allowing for customization and reuse in other Raku classes or roles. The article concludes that this DRY approach aligns with the core principles of HARC Stack, encouraging efficient and reliable web development and invites readers to explore the source code on GitHub.\n",
    "chinese_title": "HTML时间标签与DRY原则 (HARC Stack)",
    "chinese_summary": "本文是关于HARC堆栈（HTMX、Raku Air、Red和Cro）系列文章的第四篇，重点介绍HTML中的`time`标签，以及Air::Base如何以DRY（不要重复自己）的方式实现它。\n\n作者强调了语义化HTML标签的重要性，以及Air::Functional如何让开发者使用函数式代码风格来构建HTML。标准的HTML `time`标签的问题在于，它需要冗余且可能容易出错地同时输入机器可读的datetime属性和人类可读的文本。\n\nAir::Base的`time`标签解决方案利用Raku的服务器端功能，从代码中提供的`datetime`属性自动生成人类可读的日期和时间。这消除了冗余并确保了一致性。开发者可以使用`mode`属性（`time`、`datetime`或`date`）指定格式，其中`date`为默认值。\n\n作者强调了这种方法的好处：提高可维护性，减少错误，以及使语义化时间与程序化时间值对齐。Air::Base中的`Time`角色也是可组合的，允许在其他Raku类或角色中进行自定义和重用。文章最后总结说，这种DRY方法符合HARC堆栈的核心原则，鼓励高效可靠的Web开发，并邀请读者在GitHub上探索源代码。"
  },
  {
    "id": "43914321",
    "title": "Crowd Sourcing Broken QR Codes",
    "url": "https://www.humanqr.com/news/qr-code-not-scanning-well-try-to-help/",
    "summary": "This article is a call for participation in a crowdsourced effort to improve QR code repair technology. The author, Daniel, recounts a personal experience of successfully repairing a damaged QR code found on a stray cat's tag. This experience, coupled with a conversation with someone named Greg about the unknown failure modes of QR codes, inspired the author to seek a more reliable solution for repairing non-scanning QR codes.\n\nCurrently, determining why a QR code fails is difficult. The author aims to create a software tool to automatically repair QR codes, making them scannable again. To achieve this, the author is collecting a dataset of broken or corrupted QR codes.\n\nThe article urges readers to submit their non-scanning QR codes via a Google Form (linked in the article) or email to daniel@humanqr.com. By submitting, participants contribute to building a valuable dataset. The author will also attempt to repair the submitted QR codes individually and return the results to the submitters. The ultimate goal is to release this curated dataset to the public, enabling others to further develop QR code restoration techniques and eventually create an automated QR code repair tool. The author asks readers not to intentionally damage QR codes for submission.\n",
    "chinese_title": "众包破解二维码",
    "chinese_summary": "本文呼吁大家参与众包活动，以改进二维码修复技术。作者Daniel讲述了自己成功修复在流浪猫吊牌上发现的受损二维码的个人经历。这次经历，加上与一位名叫Greg的人讨论二维码的未知失效模式，促使作者寻求更可靠的解决方案来修复无法扫描的二维码。\n\n目前，确定二维码失效的原因很困难。作者的目标是创建一个软件工具来自动修复二维码，使其能够再次扫描。为了实现这个目标，作者正在收集损坏或损坏的二维码数据集。\n\n本文敦促读者通过Google表格（文章中链接）或电子邮件至daniel@humanqr.com提交无法扫描的二维码。通过提交，参与者有助于构建有价值的数据集。作者还将尝试单独修复提交的二维码，并将结果返回给提交者。最终目标是向公众发布这个经过整理的数据集，使其他人能够进一步开发二维码修复技术，并最终创建一个自动二维码修复工具。作者要求读者不要故意损坏二维码进行提交。"
  },
  {
    "id": "43918478",
    "title": "Engineers develop wearable heart attack detection technology",
    "url": "https://medicalxpress.com/news/2025-04-wearable-heart-technology.html",
    "summary": "University of Mississippi engineers are developing a wearable, real-time heart attack detection technology that could significantly improve patient outcomes. The technology, designed as a lightweight, energy-efficient chip, utilizes artificial intelligence to analyze electrocardiograms (ECGs) and detect heart attacks with 92.4% accuracy. This is potentially twice as fast as traditional methods.\n\nThe researchers, led by Assistant Professor Kasem Khalil, emphasize the importance of speed in heart attack treatment, stating that quicker diagnosis can lead to less permanent damage. The device is designed to be embedded in wearables like watches or phones, allowing for continuous heart monitoring and faster intervention compared to current methods that require medical facility visits for ECGs or blood tests.\n\nDoctoral student Tamador Mohaidat focused on developing the artificial neural network, while graduate student Md. Rahat Kader Khan built the software. The team stresses their holistic approach, concentrating on both hardware and software aspects for optimal system performance. The researchers envision expanding the technology's application to detect other health issues, like seizures or dementia, by adapting the AI and sensor capabilities. The research was published in papers from the International Conference on Intelligent Systems, Blockchain and Communication Technologies.\n",
    "chinese_title": "工程师开发可穿戴的心脏病发作检测技术",
    "chinese_summary": "密西西比大学工程师正在开发一种可穿戴的实时心脏病发作检测技术，有望显著改善患者的治疗效果。这项技术被设计成一种轻量级、节能芯片，利用人工智能分析心电图 (ECG)，并以 92.4% 的准确率检测心脏病发作。这可能比传统方法快两倍。\n\n研究人员在 Kasem Khalil 助理教授的带领下，强调了心脏病发作治疗中速度的重要性，指出更快的诊断可以减少永久性损伤。该设备旨在嵌入到手表或手机等可穿戴设备中，从而实现连续的心脏监测和更快的干预，而目前的方法需要去医疗机构进行心电图或血液测试。\n\n博士生 Tamador Mohaidat 专注于开发人工神经网络，而研究生 Md. Rahat Kader Khan 构建了软件。该团队强调其整体方法，专注于硬件和软件两方面，以实现最佳的系统性能。研究人员设想通过调整人工智能和传感器能力，将该技术的应用扩展到检测其他健康问题，如癫痫或痴呆症。该研究发表在智能系统、区块链和通信技术国际会议的论文中。"
  },
  {
    "id": "43946149",
    "title": "Comparison of C/POSIX standard library implementations for Linux",
    "url": "https://www.etalabs.net/compare_libcs.html",
    "summary": "This article compares several C/POSIX standard library implementations for Linux: musl, uClibc, dietlibc, and glibc, focusing on feature-richness versus bloat. Authored by someone associated with musl, the comparison covers various aspects, including bloat, behavior on resource exhaustion, performance, ABI/versioning, algorithms, features, target architectures, build environment, and security.\n\nThe \"Bloat comparison\" section evaluates library size and overhead, noting that glibc has the largest footprint due to iconv modules. The article discusses how each library handles resource exhaustion scenarios like thread-local storage allocation failure. Performance is benchmarked across tasks like allocation, string manipulation, thread creation, and I/O.\n\nABI and versioning examines stability, compatibility, and atomic upgrades, highlighting musl's atomic upgrade capability. Algorithm comparison delves into the efficiency of substring search, regular expression matching, and sorting algorithms.\n\nThe features comparison highlights differences in C99 math library support, POSIX threads, locale definition, and security features like UTF-8 decoding and stack smashing protection. Target architectures lists supported architectures. Build environment aspects like header design and toolchain dependencies are also discussed. The conclusion emphasizes the trade-offs between feature richness and overhead across the different libraries.\n",
    "chinese_title": "Linux下C/POSIX标准库实现的比较",
    "chinese_summary": "本文比较了Linux上的几种C/POSIX标准库实现：musl、uClibc、dietlibc和glibc，重点关注功能丰富性和臃肿之间的权衡。该比较由与musl相关的人员撰写，涵盖了多个方面，包括臃肿、资源耗尽时的行为、性能、ABI/版本控制、算法、功能特性、目标架构、构建环境和安全性。\n\n“臃肿比较”部分评估了库的大小和开销，指出glibc由于iconv模块而拥有最大的占用空间。本文讨论了每个库如何处理资源耗尽场景，例如线程局部存储分配失败。性能基准测试涵盖了分配、字符串操作、线程创建和I/O等任务。\n\nABI和版本控制考察了稳定性、兼容性和原子升级，突出了musl的原子升级能力。算法比较深入研究了子字符串搜索、正则表达式匹配和排序算法的效率。\n\n功能特性比较突出了C99数学库支持、POSIX线程、区域设置定义以及UTF-8解码和堆栈粉碎保护等安全功能方面的差异。目标架构列出了支持的架构。还讨论了构建环境方面，例如头文件设计和工具链依赖性。结论强调了不同库在功能丰富性和开销之间的权衡。"
  }
]