[
  {
    "id": "44719222",
    "title": "Show HN: Draw a fish and watch it swim with the others",
    "url": "https://drawafish.com",
    "summary": "This \"Show HN\" post highlights a project where users can draw a fish and then watch their creation swim in a virtual environment with other user-submitted fish. The core idea is interactive and engaging, allowing users to contribute their artistic skills and see the results animated in real-time. The prompt specifically requests users to draw a fish facing to the right, suggesting that the direction influences the fish's behavior within the virtual ocean. The simple call to action \"Draw a Fish!\" emphasizes the ease of participation and the immediate gratification of seeing one's drawing come to life within the project. The project appears to be focused on visual appeal and community participation, leveraging a simple drawing interface to create a shared virtual ecosystem.\n",
    "chinese_title": "展示HN: 画条鱼，看它和其它鱼一起游泳",
    "chinese_summary": "用户可以在这个“Show HN”帖子中突出显示的项目里画一条鱼，然后观看他们的作品与其他用户提交的鱼一起在虚拟环境中游泳。核心理念是互动性和参与性，允许用户贡献他们的艺术技能，并实时看到动画效果。提示特别要求用户画一条面向右侧的鱼，这表明方向会影响鱼在虚拟海洋中的行为。“画一条鱼！”这个简单的行动号召强调了参与的便捷性以及看到自己的绘画作品在该项目中栩栩如生的即时满足感。该项目似乎专注于视觉吸引力和社区参与，利用简单的绘图界面来创建一个共享的虚拟生态系统。"
  },
  {
    "id": "44759382",
    "title": "Corporation for Public Broadcasting Ceasing Operations",
    "url": "https://cpb.org/pressroom/Corporation-Public-Broadcasting-Addresses-Operations-Following-Loss-Federal-Funding",
    "summary": "The Corporation for Public Broadcasting (CPB) will cease operations following the loss of federal funding, a result of a recent federal rescissions package and the Senate Appropriations Committee's FY 2026 bill excluding CPB funding. This marks the first time in over five decades that CPB has been defunded.\n\nCPB, established by Congress in 1967, has played a crucial role in supporting public media, including educational content, local journalism, emergency communications, cultural programming, and other essential services through partnerships with local stations and producers.\n\nCPB President and CEO Patricia Harrison expressed disappointment but affirmed the organization's commitment to a transparent and responsible wind-down. The majority of staff positions will end by September 30, 2025, with a small transition team remaining until January 2026 to handle compliance, final distributions, and long-term financial obligations, including music rights and royalties.\n\nHarrison emphasized public media's role as a trusted institution providing education, emergency alerts, civil discourse, and cultural connections. CPB will provide ongoing updates and guidance to stations and producers during this challenging period. The organization has been the steward of federal investment in public broadcasting, supporting over 1,500 local public TV and radio stations and serving as the largest funder of public media research, technology, and program development.\n",
    "chinese_title": "公共广播公司停止运营",
    "chinese_summary": "因联邦拨款丧失，公共广播公司（CPB）将停止运营，这是近期联邦撤销方案以及参议院拨款委员会2026财年法案排除CPB拨款所致。这是五十多年来CPB首次被取消资助。\n\nCPB于1967年由国会成立，通过与地方电视台和制片人合作，在支持公共媒体方面发挥了关键作用，包括教育内容、地方新闻、紧急通讯、文化节目和其他基本服务。\n\nCPB总裁兼首席执行官帕特里夏·哈里森表达了失望之情，但肯定了该组织致力于透明和负责任的解散。大多数员工职位将于2025年9月30日结束，一个小型的过渡团队将保留到2026年1月，以处理合规、最终分配和长期财务义务，包括音乐版权和版税。\n\n哈里森强调了公共媒体作为可信机构在提供教育、紧急警报、公民讨论和文化联系方面的作用。CPB将在这一充满挑战的时期为电视台和制片人提供持续的更新和指导。该组织一直是联邦政府对公共广播投资的管理者，支持着1500多家地方公共电视和广播电台，并是公共媒体研究、技术和节目开发的最大资助者。"
  },
  {
    "id": "44758957",
    "title": "Supporting the BEAM community with free CI/CD security audits",
    "url": "https://www.erlang-solutions.com/blog/supporting-the-beam-community-with-free-ci-cd-security-audits/",
    "summary": "Erlang Solutions is offering free CI/CD security audits to open-source Erlang and Elixir projects to support the BEAM community. These audits leverage SAFE (Security Audit for Erlang/Elixir), a tool designed to detect vulnerabilities in BEAM code. The CI/CD integration allows for automated scanning with each code commit or update, enabling early detection of issues, a more secure codebase, and improved risk visibility. Results are delivered quickly (minutes for small projects, up to 30 minutes for larger ones) with actionable feedback.\n\nOpen-source maintainers can request a free license by emailing safe@erlang-solutions.com with a link to their repository. Licenses are granted for one month to a year, depending on the project’s needs.\n\nErlang Solutions also offers expert-led audits for production BEAM systems, including code reviews, architecture assessments, and performance audits. These services complement SAFE for a comprehensive security and performance evaluation.\n\nBeyond security, Erlang Solutions actively contributes to the BEAM ecosystem through sponsoring events like Code Sync, supporting the Erlang Ecosystem Foundation (EEF), backing inclusion initiatives like Women in BEAM, sharing learning resources, and contributing to open-source libraries. Their goal is to ensure BEAM-based systems are scalable, reliable, and secure.\n",
    "chinese_title": "免费为BEAM社区提供CI/CD安全审计支持",
    "chinese_summary": "为了支持BEAM社区，Erlang Solutions正在为开源Erlang和Elixir项目提供免费的CI/CD安全审计。这些审计利用SAFE (Erlang/Elixir安全审计)，这是一种旨在检测BEAM代码漏洞的工具。CI/CD集成允许在每次代码提交或更新时进行自动扫描，从而实现问题的早期检测、更安全的代码库和改进的风险可见性。结果交付速度快（小型项目只需几分钟，大型项目最多30分钟），并提供可操作的反馈。\n\n开源维护者可以通过发送邮件至safe@erlang-solutions.com，并附上其仓库链接，来申请免费许可证。许可证的有效期为一个月到一年，具体取决于项目的需求。\n\nErlang Solutions还为生产BEAM系统提供专家主导的审计，包括代码审查、架构评估和性能审计。这些服务对SAFE进行了补充，以实现全面的安全和性能评估。\n\n除了安全之外，Erlang Solutions还通过赞助Code Sync等活动、支持Erlang Ecosystem Foundation (EEF)、支持像Women in BEAM这样的包容性倡议、分享学习资源以及贡献开源库等方式，积极为BEAM生态系统做出贡献。他们的目标是确保基于BEAM的系统具有可扩展性、可靠性和安全性。"
  },
  {
    "id": "44755279",
    "title": "Gemini 2.5 Deep Think",
    "url": "https://blog.google/products/gemini/gemini-2-5-deep-think/",
    "summary": "The article announces the release of \"Deep Think,\" a more powerful version of the Gemini AI model, initially to Google AI Ultra subscribers in the Gemini app and a select group of mathematicians. This iteration, a variation of the model that achieved gold-medal standard at the International Mathematical Olympiad (IMO), offers improved problem-solving capabilities through parallel thinking techniques and extended inference time. This allows Gemini to generate and consider multiple ideas simultaneously before arriving at the best solution.\n\nDeep Think excels in tasks requiring creativity, strategic planning, and iterative improvements, such as web development, scientific discovery, and algorithmic development. It demonstrates state-of-the-art performance on challenging benchmarks like LiveCodeBench V6 and Humanity’s Last Exam.\n\nWhile Deep Think offers enhanced problem-solving, Google emphasizes ongoing safety and responsibility measures, including content safety improvements and mitigation strategies for potential risks associated with increased complexity. Users can access Deep Think in the Gemini app by toggling the \"Deep Think\" option. Google also plans to release Deep Think with and without tools to a wider set of trusted testers via the Gemini API for developer and enterprise applications. The team hopes to improve Gemini's helpfulness and capabilities, pushing the boundaries of human knowledge.\n",
    "chinese_title": "双子座 2.5 深度思考",
    "chinese_summary": "文章宣布发布“深度思考”(Deep Think)，这是 Gemini AI 模型的一个更强大的版本，最初面向 Gemini 应用中的 Google AI Ultra 订阅者和精选的数学家群体。这一迭代版本，是国际数学奥林匹克竞赛 (IMO) 中达到金牌标准的模型变体，通过并行思考技术和延长的推理时间，提供了改进的问题解决能力。这使得 Gemini 能够同时生成和考虑多个想法，然后得出最佳解决方案。\n\n“深度思考”擅长需要创造力、战略规划和迭代改进的任务，例如 Web 开发、科学发现和算法开发。 它在 LiveCodeBench V6 和 Humanity’s Last Exam 等具有挑战性的基准测试中表现出最先进的性能。\n\n虽然“深度思考”提供了增强的问题解决能力，但 Google 强调正在采取持续的安全和责任措施，包括内容安全改进和针对与复杂性增加相关的潜在风险的缓解策略。 用户可以通过切换 Gemini 应用中的“深度思考”选项来访问“深度思考”。 Google 还计划通过 Gemini API 向更广泛的可信测试者发布带有和不带有工具的“深度思考”，用于开发者和企业应用程序。 该团队希望提高 Gemini 的实用性和能力，从而推动人类知识的边界。"
  },
  {
    "id": "44758132",
    "title": "Fast (2019)",
    "url": "https://patrickcollison.com/fast",
    "summary": "This article, titled \"Fast,\" is a collection of examples showcasing instances where individuals and teams achieved ambitious goals within remarkably short timeframes. These examples range from the creation of financial products like BankAmericard to the rapid development of crucial wartime technologies like the P-80 Shooting Star and the Alaska Highway. It highlights the construction of iconic landmarks such as the Eiffel Tower and the Empire State Building, alongside innovative projects like the Treasure Island and the daring mission of Apollo 8. It also includes software and product innovations such as Javascript, Git, and the Amazon Prime initiative, as well as the remarkable speed with which COVID-19 vaccines were developed.\n\nThe article then pivots to contrasting these examples of swift achievement with contemporary projects that face significant delays. This contrast leads to a discussion about why infrastructure projects, particularly large-scale physical ones, seem to have taken longer to complete in recent decades compared to the pre-1970 era.\n\nThe article cites various sources that explore potential reasons for this slowdown, including increased red tape, bureaucratic constrictions, the rise of special interest groups, and the evolution of the American governmental system. It suggests that societal and political shifts since the 1960s may have contributed to a less dynamic and more complex environment for project execution. Ultimately, the article raises questions about the factors that enable rapid achievement and the challenges hindering timely project completion in the modern era.\n",
    "chinese_title": "速度 (2019)",
    "chinese_summary": "这篇名为“快”的文章，汇集了一系列案例，展示了个人和团队在极短时间内实现宏伟目标的例子。这些例子涵盖了金融产品（如美国银行卡）的创建，以及关键战时技术（如P-80流星战斗机和阿拉斯加公路）的快速开发。它重点介绍了标志性建筑（如埃菲尔铁塔和帝国大厦）的建造，以及创新项目（如金银岛和大胆的阿波罗8号任务）。此外，它还包括软件和产品创新，如Javascript、Git和亚马逊Prime计划，以及新冠疫苗开发的惊人速度。\n\n文章随后转向，将这些快速成就的例子与面临重大延误的当代项目进行对比。这种对比引出了一个讨论，即为什么基础设施项目，特别是大型物理项目，与1970年以前相比，在最近几十年里似乎需要更长的时间才能完成。\n\n文章引用了各种资料来源，探讨了造成这种放缓的潜在原因，包括繁文缛节的增加、官僚机构的限制、特殊利益集团的崛起以及美国政府体系的演变。它认为，自20世纪60年代以来，社会和政治的转变可能导致项目执行的环境变得不那么活跃，也更加复杂。最终，文章提出了关于什么因素促成快速成就，以及现代时代阻碍项目及时完成的挑战的问题。"
  },
  {
    "id": "44759432",
    "title": "Coverage Cat (YC S22) Is Hiring a Senior, Staff, or Principal Engineer",
    "url": "https://www.coveragecat.com/careers/engineering/software-engineer",
    "summary": "Coverage Cat, a YC S22 company, is hiring a Senior, Staff, or Principal Engineer to join their team and build the \"AI-native insurance broker of the future.\" They aim to improve financial outcomes for millions by making the insurance industry more transparent and policies easier to understand.\n\nThe role requires 6+ years of experience and offers a salary starting at $140,000+.  The ideal candidate is a senior engineer eager to own and build products end-to-end, gather data for customers, and provide tools to help them make informed insurance decisions. The responsibilities include building new features from concept to delivery, identifying customer problems, and delivering solutions that save people money and protect their assets. In essence, the position involves building and improving a single-service website that leverages data, matchmaking, and recommendations to address non-commercial insurance needs.\n",
    "chinese_title": "Coverage Cat (YC S22) 正在招聘高级、资深或首席工程师",
    "chinese_summary": "Coverage Cat (YC S22 公司) 正在招聘高级、资深或首席工程师，加入他们的团队，打造“AI原生未来保险经纪人”。 他们的目标是通过提高保险行业的透明度并使保单更易于理解，从而改善数百万人的财务状况。\n\n该职位要求 6 年以上经验，起薪为 14 万美元以上。 理想的候选人是一位渴望端到端地拥有和构建产品、为客户收集数据并提供工具以帮助他们做出明智的保险决策的高级工程师。 职责包括从概念到交付构建新功能、识别客户问题并提供能够为人们省钱并保护其资产的解决方案。 本质上，该职位涉及构建和改进一个利用数据、匹配和推荐来满足非商业保险需求的单服务网站。"
  },
  {
    "id": "44759152",
    "title": "At 17, Hannah Cairo solved a major math mystery",
    "url": "https://www.quantamagazine.org/at-17-hannah-cairo-solved-a-major-math-mystery-20250801/",
    "summary": "This article chronicles the remarkable story of Hannah Cairo, who at 17, disproved the Mizohata-Takeuchi conjecture, a 40-year-old problem in harmonic analysis. Homeschooled and largely self-taught, Cairo found math a liberating escape from isolation.\n\nWhile stranded in Chicago during the pandemic, she joined Math Circles, then participated in Berkeley's Math Circle summer program. Despite lacking formal credentials, she enrolled in graduate-level math courses at Berkeley, where she encountered the Mizohata-Takeuchi conjecture as extra credit in a problem set.\n\nThe conjecture relates to how energy concentrates in functions built from waves with specific frequencies.  Cairo's counterexample involved constructing a complex function whose energy spread in unexpected, fractal-like patterns, defying the conjecture's prediction. Her discovery, initially met with skepticism, was eventually validated by her professor and the broader math community.\n\nCairo's work has significant implications, demonstrating that a related conjecture known as Stein’s conjecture is also false. The article highlights the elegance and impact of her proof, praising its potential to inspire new research. Despite lacking a high school diploma or a college degree, Cairo will begin her doctoral studies at the University of Maryland, a testament to her exceptional talent and dedication. The story underscores the potential for extraordinary mathematical achievements from unconventional backgrounds.\n",
    "chinese_title": "17岁的汉娜·开罗解决了重大的数学难题。",
    "chinese_summary": "本文讲述了汉娜·开罗的非凡故事。17岁的她推翻了水畑-竹内猜想，一个存在了40年的调和分析难题。开罗在家自学，数学对她来说是摆脱孤独的自由。\n\n疫情期间滞留芝加哥时，她加入了数学圈，之后参加了伯克利的数学圈暑期项目。尽管缺乏正式资历，她还是选修了伯克利的研究生数学课程，并在一个作业的额外加分题中遇到了水畑-竹内猜想。\n\n该猜想与由特定频率的波构建的函数中能量的集中方式有关。开罗的反例涉及构建一个复杂的函数，其能量以意想不到的、类似分形模式扩散，违背了该猜想的预测。她的发现最初受到质疑，但最终得到了她的教授和更广泛的数学界的验证。\n\n开罗的成果具有重要意义，表明一个相关的猜想，即斯坦因猜想，也是错误的。本文强调了她证明的优雅性和影响力，赞扬了其激发新研究的潜力。尽管没有高中文凭或大学学位，开罗即将开始在马里兰大学攻读博士学位，这证明了她非凡的天赋和奉献精神。这个故事强调了来自非传统背景的非凡数学成就的可能性。"
  },
  {
    "id": "44730691",
    "title": "Show HN: An interactive dashboard to explore NYC rentals data",
    "url": "https://leaseswap.nyc/analytics",
    "summary": "This \"Show HN\" post introduces an interactive dashboard designed to explore NYC rental market data. The dashboard allows users to analyze rental trends across different neighborhoods in New York City, providing market insights.\n\nKey features and functionalities include:\n\n*   **Exploration of market insights:** Users can analyze rental data trends over various timeframes (1 month, 3 months, 6 months, and 1 year).\n*   **Customizable filters:** The dashboard provides filters for bedrooms, bathrooms, and rental sources (e.g., Leasebreak, Streeteasy, Craigslist).\n*   **Neighborhood-specific analysis:** Users can select specific neighborhoods on a map to view data relevant to those areas.\n*   **Comprehensive data sources:** Data is aggregated from multiple sources including Leasebreak, Streeteasy, Leaseswap, Craigslist, Renthop, NYBits, and Trulia.\n\nIn essence, the dashboard provides a tool to understand the NYC rental market, offering granular control over filtering and selecting specific areas of interest.\n",
    "chinese_title": "Show HN：探索纽约市租房数据的交互式仪表盘",
    "chinese_summary": "这个“Show HN”帖子介绍了一个交互式仪表盘，旨在探索纽约市租赁市场数据。该仪表盘允许用户分析纽约市不同社区的租赁趋势，提供市场洞察。\n\n主要功能和特性包括：\n\n*   **市场洞察探索：** 用户可以分析不同时间段（1个月、3个月、6个月和1年）的租赁数据趋势。\n*   **可定制的过滤器：** 仪表盘提供卧室、浴室和租赁来源（例如，Leasebreak、Streeteasy、Craigslist）的过滤器。\n*   **针对特定社区的分析：** 用户可以在地图上选择特定社区，以查看与这些区域相关的数据。\n*   **全面的数据来源：** 数据来自多个来源，包括 Leasebreak、Streeteasy、Leaseswap、Craigslist、Renthop、NYBits 和 Trulia。\n\n本质上，该仪表盘提供了一个工具来了解纽约市租赁市场，并提供对过滤和选择特定感兴趣区域的精细控制。"
  },
  {
    "id": "44757755",
    "title": "Hyrum's Law",
    "url": "https://www.hyrumslaw.com",
    "summary": "Hyrum's Law, named after Adobe's Hyrum Wright and popularized by Titus Winters, states that with a sufficient number of users, all observable behaviors of a system's implementation will be depended on by somebody, regardless of the contract. This expands upon Spolsky's \"Law of Leaky Abstractions,\" suggesting that no implementation detail remains truly private in heavily used systems.\n\nThe article argues that interfaces, intended to abstract away implementation details, often fail to do so effectively over time. Users begin to rely not only on the explicitly defined interface but also on implicit aspects like performance characteristics, error handling, or even unintended side effects. This \"implicit interface\" constrains future changes to the implementation, forcing developers to maintain \"bug-for-bug compatibility\" to avoid breaking existing dependencies.\n\nAs usage grows, the implicit interface tends to converge towards the complete implementation, effectively making the implementation the interface. This presents a significant challenge to system evolution, as even seemingly minor changes can have unforeseen consequences. While thorough testing can detect these dependencies, it cannot eliminate them.\n\nThe key takeaway is that developers should be aware of the implicit interface and its constraints when designing and maintaining complex systems, recognizing that the actual interface of a widely used system is much broader and deeper than initially intended. This law stems from experiences where seemingly simple library changes caused unexpected failures in distant parts of the system.\n",
    "chinese_title": "海勒姆定律",
    "chinese_summary": "海勒姆定律，以Adobe的Hyrum Wright命名，并由Titus Winters推广，指出当用户数量足够多时，系统实现的所有可观察行为都会被某些人所依赖，无论合约如何。 这扩展了Spolsky的“抽象泄露法则”，表明在被广泛使用的系统中，没有实现细节可以保持真正的私有。\n\n文章认为，旨在抽象实现细节的接口，往往不能随着时间的推移有效地做到这一点。 用户不仅开始依赖于显式定义的接口，还依赖于隐式方面，例如性能特征、错误处理，甚至是非预期的副作用。 这种“隐式接口”限制了未来对实现的更改，迫使开发人员维护“bug-for-bug兼容性”以避免破坏现有的依赖关系。\n\n随着使用量的增长，隐式接口往往会收敛到完整的实现，从而有效地使实现成为接口。 这对系统演进提出了重大挑战，因为即使看似微小的变化也可能产生意想不到的后果。 虽然全面的测试可以检测到这些依赖关系，但无法消除它们。\n\n关键在于，开发人员在设计和维护复杂系统时，应意识到隐式接口及其约束，认识到广泛使用的系统的实际接口比最初预期的要广泛和深入得多。 这条定律源于看似简单的库更改导致系统中遥远的部分发生意外故障的经验。"
  },
  {
    "id": "44758281",
    "title": "Show HN: Pontoon – Open-source customer data syncs",
    "url": "https://github.com/pontoon-data/Pontoon",
    "summary": "Pontoon is an open-source, self-hosted data export platform designed for vendors to provide data syncs as a product feature to their enterprise customers. It addresses the limitations of using traditional APIs for large-scale data exports, such as performance issues, poor customer experience due to required ETLs, rate limits, and slow backfills.\n\nPontoon offers direct data warehouse integration (Snowflake, BigQuery, Redshift, Postgres), eliminating the need for customers to build or pay for ETL tools. Key features include easy deployment with Docker or AWS Fargate, multi-cloud support, automated and scheduled syncs with automatic backfills and incremental loads, scalable architecture for millions of records per minute, a user-friendly web interface, and a REST API.\n\nUnlike traditional ETL platforms used by data teams, Pontoon is deployed by vendors to provide data syncs as a product offering. It enables multi-tenant data export and direct data warehouse integrations, and is designed for bulk transfers.\n\nThe article includes a comparison table highlighting Pontoon's advantages over other ETL/Reverse-ETL platforms like Airbyte, Fivetran, Hightouch, and others, particularly regarding open-source nature, self-hosting options, first-class data products, multi-tenant data export, and direct data warehouse integrations.\n\nThe article concludes with a quick start guide using Docker and Docker Compose to get Pontoon up and running quickly, and directs users to the transfer quick start guide to create their first data export.\n",
    "chinese_title": "Show HN: Pontoon – 开源客户数据同步",
    "chinese_summary": "Pontoon：一款面向供应商的开源自托管数据导出平台，旨在为企业客户提供数据同步作为产品特性。它解决了使用传统API进行大规模数据导出时的局限性，例如性能问题、因需要ETL而导致糟糕的客户体验、速率限制和缓慢的回填。\n\nPontoon提供直接的数据仓库集成（Snowflake、BigQuery、Redshift、Postgres），无需客户构建或支付ETL工具的费用。主要功能包括使用Docker或AWS Fargate轻松部署、多云支持、具有自动回填和增量加载的自动化和计划同步、每分钟数百万条记录的可扩展架构、用户友好的Web界面和REST API。\n\n与数据团队使用的传统ETL平台不同，Pontoon由供应商部署，以提供数据同步作为产品。它支持多租户数据导出和直接数据仓库集成，专为批量传输而设计。\n\n文章包含一个对比表格，突出了Pontoon相对于其他ETL/Reverse-ETL平台（如Airbyte、Fivetran、Hightouch等）的优势，尤其是在开源性质、自托管选项、一流数据产品、多租户数据导出和直接数据仓库集成方面。\n\n文章最后提供了一个使用Docker和Docker Compose快速启动Pontoon的快速入门指南，并引导用户查阅传输快速入门指南来创建他们的第一个数据导出。"
  },
  {
    "id": "44713701",
    "title": "Yes in My Bamako Yard",
    "url": "https://asteriskmag.com/issues/11/yes-in-my-bamako-yard",
    "summary": "\"Yes In My Bamako Yard\" argues that Africa's rapid urbanization, expected to add 900 million people to cities by 2050, is not translating into the same economic benefits seen in other regions. The article highlights that African cities are urbanizing at lower income levels with limited resources and are plagued by regulatory barriers, hindering economic growth.  It posits that Africa needs a \"YIMBY\" (Yes In My Backyard) movement focused on pro-housing reforms.\n\nHowever, unlike YIMBY movements in developed nations focused on removing restrictive zoning and building codes, Africa's YIMBY must address fundamental issues in land, capital, and labor markets. Specifically, the article advocates for proactive, bare-bones urban expansion planning, suggesting a simple five-step process for creating implementable expansion plans.  This involves predicting land needs, designating expansion areas, preserving sensitive environments, planning road grids, and securing rights-of-way. Successful examples from Ethiopia and the World Bank's Sites and Services program in Tanzania demonstrate the effectiveness of this approach in fostering economic growth and attracting private investment.\n\nFurthermore, the article emphasizes the need for African cities to tap into land value capture as a crucial source of capital, as traditional external funding becomes scarce. By proactively planning and investing in infrastructure in advance of population growth, African cities can unlock the economic potential of urbanization and improve the lives of their residents.\n",
    "chinese_title": "在我巴马科的院子里，是的",
    "chinese_summary": "“我家巴马科院子里也行”认为，非洲快速的城市化进程，预计到2050年将为城市增加9亿人口，但并未转化为其他地区所见的同等经济效益。文章强调，非洲城市化发生在较低收入水平和资源有限的情况下，并受到监管壁垒的困扰，阻碍了经济增长。文章提出，非洲需要一场专注于支持住房改革的“我家院子里也行”（YIMBY）运动。\n\n然而，与发达国家专注于取消限制性分区和建筑法规的YIMBY运动不同，非洲的YIMBY必须解决土地、资本和劳动力市场中的根本问题。 具体而言，文章倡导积极主动、简明扼要的城市扩张规划，并提出了一个创建可实施扩张计划的简单五步流程。 这包括预测土地需求、指定扩张区域、保护敏感环境、规划道路网格以及确保通行权。 埃塞俄比亚的成功案例以及世界银行在坦桑尼亚的场地和服务计划都证明了这种方法在促进经济增长和吸引私人投资方面的有效性。\n\n此外，文章强调，随着传统外部资金日益稀缺，非洲城市需要利用土地增值作为重要的资本来源。 通过在人口增长之前主动规划并投资于基础设施，非洲城市可以释放城市化的经济潜力，并改善居民的生活。"
  },
  {
    "id": "44759085",
    "title": "Design patterns you should unlearn in Python",
    "url": "https://www.lihil.cc/blog/design-patterns-you-should-unlearn-in-python-part1/",
    "summary": "This article argues that many classic Gang of Four (GOF) design patterns, often touted as essential for \"serious\" Python development, are actually counterproductive and should be unlearned. These patterns, born from the limitations of languages like Java and C++, solve problems that Python inherently addresses through its features like first-class functions, dynamic typing, and modules.\n\nThe article focuses on Creational Patterns, specifically Singleton and Builder, as prime examples of over-engineered solutions. The Singleton pattern, often implemented with complex class logic in Python, aims to ensure only one instance of a class. However, Python modules naturally provide this functionality, making the pattern unnecessary. Lazy initialization can be achieved with closures instead.\n\nSimilarly, the Builder pattern, designed for constructing complex objects step-by-step (especially useful in languages without default argument values), is redundant in Python. Python's default arguments in constructors and factory functions (potentially using `typing.overload` for better IDE support) offer a simpler and more readable alternative.\n\nThe core message is that blindly applying GOF patterns in Python leads to overly complex, less maintainable, and harder-to-test code. Python's native features provide elegant and concise solutions to the problems these patterns attempt to solve, making their use unnecessary and even detrimental. The article advocates for a more Pythonic approach, leveraging the language's strengths instead of forcing it into patterns designed for other paradigms.\n",
    "chinese_title": "Python 中你应该忘记的设计模式",
    "chinese_summary": "本文认为，许多经典的“四人帮”（GOF）设计模式，虽然常被吹捧为“严肃”Python开发的必备，但实际上适得其反，应该摒弃。这些模式源于Java和C++等语言的局限性，所解决的问题Python通过其一级函数、动态类型和模块等特性已经固有地解决了。\n\n本文重点关注创建型模式，特别是Singleton和Builder，作为过度设计的典型例子。Singleton模式通常在Python中使用复杂的类逻辑来实现，旨在确保只有一个类实例。然而，Python模块自然地提供了此功能，使该模式变得不必要。延迟初始化可以使用闭包来实现。\n\n类似地，Builder模式旨在逐步构建复杂对象（在没有默认参数值的语言中尤其有用），但在Python中是多余的。Python构造函数中的默认参数和工厂函数（可能使用`typing.overload`以获得更好的IDE支持）提供了更简单、更易读的替代方案。\n\n核心信息是，在Python中盲目应用GOF模式会导致代码过于复杂、可维护性降低且更难测试。Python的本地特性为这些模式试图解决的问题提供了优雅而简洁的解决方案，使其使用变得不必要甚至有害。本文提倡一种更Python化的方法，利用该语言的优势，而不是强迫它采用为其他范例设计的模式。"
  },
  {
    "id": "44758842",
    "title": "Rollercoaster Tycoon (Or, MicroProse's Last Hurrah)",
    "url": "https://www.filfre.net/2025/08/rollercoaster-tycoon-or-microproses-last-hurrah/",
    "summary": "This article recounts the story of Rollercoaster Tycoon and its unlikely savior role for MicroProse Software. Following the departure of key personnel and financial struggles, MicroProse was acquired by Hasbro Interactive in 1998.\n\nChris Sawyer, a Scottish programmer, developed Rollercoaster Tycoon using ultra-efficient assembly language, building on his earlier success with Transport Tycoon. Sawyer, inspired by his love for roller coasters and amusement parks, created a more wholesome and detail-oriented park management game compared to Bullfrog's Theme Park.\n\nDespite its niche appeal, Rollercoaster Tycoon, released in 1999, became a massive success, exceeding sales expectations. The game's popularity was partially attributed to its complete state upon delivery, unlike many projects plagued by development issues. Sawyer retained the Rollercoaster Tycoon trademark, a decision that would prove immensely valuable.\n\nIronically, Hasbro Interactive, led by Alan Hassenfeld, who sought to compete with Mattel's success in the computer games market, stumbled upon a hit that momentarily rescued MicroProse from financial ruin. This success came about not from strategic foresight, but from good fortune in acquiring a virtually complete and exceptional game. Ultimately, Rollercoaster Tycoon became MicroProse's \"last hurrah,\" demonstrating the unpredictable nature of the gaming industry.\n",
    "chinese_title": "过山车大亨（或，MicroProse最后的辉煌）",
    "chinese_summary": "本文讲述了过山车大亨的故事，以及它如何出人意料地成为了MicroProse Software的救星。在关键人员离职和财务困境之后，MicroProse于1998年被孩之宝互动收购。\n\n苏格兰程序员克里斯·索耶使用超高效的汇编语言开发了过山车大亨，这建立在他早期《运输大亨》的成功之上。索耶受到他对过山车和游乐园的热爱的启发，创造了一个比Bullfrog的《主题公园》更健康、更注重细节的公园管理游戏。\n\n尽管具有小众吸引力，但1999年发布的过山车大亨却获得了巨大成功，超出了销售预期。该游戏的受欢迎程度部分归功于交付时的完整状态，这与许多受开发问题困扰的项目不同。索耶保留了过山车大亨的商标，这一决定后来被证明非常有价值。\n\n具有讽刺意味的是，在艾伦·哈森菲尔德的领导下，孩之宝互动公司试图在电脑游戏市场与美泰的成功竞争，却意外地获得了一个热门游戏，从而暂时将MicroProse从财务困境中解救了出来。这一成功并非来自战略上的远见，而是来自收购了一款几乎完整且出色的游戏带来的好运。最终，过山车大亨成为了MicroProse的“最后一搏”，展示了游戏行业不可预测的本质。"
  },
  {
    "id": "44753298",
    "title": "Every satellite orbiting earth and who owns them (2023)",
    "url": "https://dewesoft.com/blog/every-satellite-orbiting-earth-and-who-owns-them",
    "summary": "This article from Dewesoft, published in February 2023, analyzes the ownership and purpose of the approximately 4,550 satellites orbiting Earth as of September 1, 2021. It highlights that SpaceX owns the most satellites (1,655, or 36% of the total), primarily due to its Starlink program aiming to provide global high-speed internet. The United States owns or operates the most satellites overall (2,804), followed by China, the United Kingdom and Russia. The article lists the top 10 satellite owners and the top 30 countries with satellites in orbit.\n\nThe article further details the types of orbits satellites occupy: low Earth orbit (LEO), medium Earth orbit (MEO), highly elliptical orbit (HEO), and geosynchronous orbit (GSO)/geostationary orbit (GEO). LEO is the most populated orbit, housing communications and remote sensing satellites, including Starlink. GSO/GEO satellites are mainly used for telecommunications and Earth observation.\n\nThe article categorizes the purposes of these satellites, with the majority (63%) dedicated to communications, followed by Earth observation (22.1%). Other purposes include technology development, navigation/global positioning, and scientific research. The article concludes by mentioning Dewesoft's data acquisition hardware and software used for testing satellites and other aerospace vehicles.\n",
    "chinese_title": "绕地球运行的每颗卫星及其所有者（2023年）",
    "chinese_summary": "这篇Dewesoft发表于2023年2月的文章分析了截至2021年9月1日地球轨道上约4550颗卫星的所有权和用途。文章指出，SpaceX拥有的卫星数量最多（1655颗，占总数的36%），这主要是由于其旨在提供全球高速互联网的星链计划。美国拥有或运营的卫星总数最多（2804颗），其次是中国、英国和俄罗斯。文章列出了卫星拥有数量最多的前10名公司以及在轨卫星数量最多的前30个国家。\n\n文章进一步详细介绍了卫星所占据的轨道类型：低地球轨道（LEO）、中地球轨道（MEO）、高度椭圆轨道（HEO）以及地球同步轨道（GSO）/地球静止轨道（GEO）。低地球轨道是卫星数量最多的轨道，容纳了包括星链在内的通信和遥感卫星。地球同步轨道/地球静止轨道卫星主要用于电信和地球观测。\n\n文章对这些卫星的用途进行了分类，其中大部分（63%）用于通信，其次是地球观测（22.1%）。其他用途包括技术开发、导航/全球定位以及科学研究。文章最后提到了Dewesoft的数据采集硬件和软件，这些硬件和软件用于测试卫星和其他航空航天飞行器。"
  },
  {
    "id": "44754523",
    "title": "Our Farewell from Google Play",
    "url": "https://secuso.aifb.kit.edu/english/2809.php",
    "summary": "The SECUSO Research Group is announcing their departure from the Google Play Store with their Privacy Friendly Apps project, which began in 2016. The project aimed to provide privacy-focused alternatives to apps that demanded excessive permissions. Over the years, they developed over 30 apps with over 350,000 installs.\n\nHowever, the increased effort required to maintain the apps on the Google Play Store has become unsustainable for their research group, especially compared to the F-Droid platform. While the need for privacy-friendly apps remains, the maintenance overhead on Google Play is too significant.\n\nExisting users of their apps will not be affected immediately, but they will no longer receive updates through the Google Play Store. This means that the apps may eventually become incompatible with future Android versions. SECUSO recommends migrating to the F-Droid Store to ensure continued support and updates for their Privacy Friendly Apps. They have provided migration instructions to facilitate the switch and preserve user data. The apps will continue to be available on F-Droid.\n",
    "chinese_title": "告别 Google Play",
    "chinese_summary": "SECUSO研究组宣布其Privacy Friendly Apps项目将退出Google Play商店。该项目始于2016年，旨在为需要过度权限的应用程序提供注重隐私的替代方案。多年来，他们开发了超过30个应用程序，安装量超过35万。\n\n然而，在Google Play商店维护这些应用程序所需的精力日益增加，对于他们的研究组来说已变得难以维持，尤其与F-Droid平台相比。尽管对注重隐私的应用程序的需求仍然存在，但Google Play上的维护负担过于沉重。\n\n现有应用程序用户不会立即受到影响，但他们将不再通过Google Play商店收到更新。这意味着这些应用程序最终可能与未来的Android版本不兼容。SECUSO建议迁移到F-Droid商店，以确保对其Privacy Friendly Apps的持续支持和更新。他们提供了迁移说明，以方便切换并保存用户数据。这些应用程序将继续在F-Droid上提供。"
  },
  {
    "id": "44754492",
    "title": "Replacing tmux in my dev workflow",
    "url": "https://bower.sh/you-might-not-need-tmux",
    "summary": "This article details the author's shift away from using tmux as a terminal multiplexer in their development workflow, motivated by concerns about its impact on the wider terminal ecosystem and issues like color rendering problems, scrollback inconsistencies, and lack of support for newer terminal protocols like kitty graphics.\n\nThe author explores alternatives for session persistence and window management, key features previously provided by tmux. While tools like `ctrl-z + fg`, `nohup`, and `disown` don't fully replicate tmux's functionality, the author finds promise in smaller, focused tools like `dtach`, `abduco`, and `shpool`, particularly the latter.\n\nThe author leverages `shpool` for session persistence (detach/reattach) and their existing window manager (ghostty/sway+foot) for window management. To address the challenge of controlling remote sessions via SSH, the author uses SSH configuration to automatically attach to `shpool` sessions upon connection and `autossh` for automatic reconnection.\n\nThe author concludes that this new setup has successfully replaced tmux in their workflow, providing benefits like native scrollback, proper terminal notifications, and correct terminal titles. While acknowledging existing issues with `shpool`, the author offers workarounds and discusses the limitations of the approach, inviting feedback from others. The shift required some adjustments, but the author finds the trade-offs worthwhile.\n",
    "chinese_title": "在我的开发流程中替换 tmux",
    "chinese_summary": "本文详细介绍了作者在开发工作流程中不再使用 tmux 作为终端复用器的原因，这是出于对其对更广泛的终端生态系统影响以及诸如颜色渲染问题、滚动回溯不一致和缺乏对更新的终端协议（如 kitty 图形）支持等问题的担忧。\n\n作者探索了会话持久性和窗口管理的替代方案，这些是以前由 tmux 提供的关键功能。虽然像 `ctrl-z + fg`、`nohup` 和 `disown` 这样的工具不能完全复制 tmux 的功能，但作者发现像 `dtach`、`abduco` 和 `shpool` 这样更小、更专注的工具很有希望，尤其是后者。\n\n作者利用 `shpool` 进行会话持久化（分离/重新连接），并使用现有的窗口管理器（ghostty/sway+foot）进行窗口管理。为了解决通过 SSH 控制远程会话的难题，作者使用 SSH 配置在连接时自动连接到 `shpool` 会话，并使用 `autossh` 进行自动重新连接。\n\n作者的结论是，这种新的设置已成功取代了他们工作流程中的 tmux，并提供了诸如原生滚动回溯、正确的终端通知和正确的终端标题等好处。虽然承认 `shpool` 存在的问题，但作者提供了解决方法并讨论了该方法的局限性，邀请其他人提出反馈。这种转变需要一些调整，但作者认为这些权衡是值得的。"
  },
  {
    "id": "44720285",
    "title": "Make Your Own Backup System – Part 2: Forging the FreeBSD Backup Stronghold",
    "url": "https://it-notes.dragas.net/2025/07/29/make-your-own-backup-system-part-2-forging-the-freebsd-backup-stronghold/",
    "summary": "This article, Part 2 of a series on creating a backup system, focuses on setting up a FreeBSD-based backup server. The author advocates for full control over backup data and emphasizes the benefits of FreeBSD for its partitioning capabilities and ZFS integration.\n\nThe article highlights the importance of both local (physically accessible) and remote (datacenter) backups for redundancy and quick restoration, stressing the need for backups to be in a separate datacenter from production data. Disk redundancy (mirroring or RAID) is also crucial to prevent data loss.\n\nSecurity is a primary concern. The author recommends hardening the backup server, ideally making it accessible only via VPN or a disconnected LAN. Encryption is mandatory, with GELI full-disk encryption for local servers and ZFS native encryption for remote ones.\n\nThe setup includes installing BastilleBSD for jail management to isolate backups from different sources, configuring networking with a bridge, and optionally setting up vm-bhyve for running VMs like Proxmox Backup Server.\n\nThe article then discusses backup strategies, primarily using zfs-autobackup for FreeBSD systems with ZFS and BorgBackup for non-ZFS systems. A key point is creating a separate FreeBSD jail for each server backed up via BorgBackup to enhance security and isolate potential compromises. The \"push\" nature of Borgbackup is acknowledged as a potential security concern, which can be partially mitigated by snapshotting the backup server.\n",
    "chinese_title": "创建你自己的备份系统 – 第二部分：打造 FreeBSD 备份堡垒",
    "chinese_summary": "本文是关于创建备份系统的系列文章的第二部分，重点介绍如何设置基于 FreeBSD 的备份服务器。作者提倡对备份数据的完全控制，并强调 FreeBSD 在分区能力和 ZFS 集成方面的优势。\n\n本文强调了本地（物理可访问）和远程（数据中心）备份对于冗余和快速恢复的重要性，并强调备份需要位于与生产数据不同的数据中心。磁盘冗余（镜像或 RAID）对于防止数据丢失也至关重要。\n\n安全性是首要考虑因素。作者建议加强备份服务器的安全性，最好仅通过 VPN 或断开连接的 LAN 访问。加密是强制性的，本地服务器使用 GELI 全盘加密，远程服务器使用 ZFS 原生加密。\n\n该设置包括安装 BastilleBSD 用于 jail 管理，以隔离来自不同来源的备份，使用网桥配置网络，并可选择设置 vm-bhyve 以运行诸如 Proxmox Backup Server 之类的虚拟机。\n\n本文接着讨论了备份策略，主要使用 zfs-autobackup 用于具有 ZFS 的 FreeBSD 系统，以及 BorgBackup 用于非 ZFS 系统。一个关键点是为每个通过 BorgBackup 备份的服务器创建一个单独的 FreeBSD jail，以提高安全性并隔离潜在的损害。\"推送\"性质的 BorgBackup 被认为是潜在的安全隐患，可以通过对备份服务器进行快照来部分缓解。"
  },
  {
    "id": "44748934",
    "title": "Slow",
    "url": "https://michaelnotebook.com/slow/index.html",
    "summary": "This article explores the concept of \"slow\" projects, those endeavors that require a very long time to complete or maintain, contrasting them with \"fast\" projects. It poses the question of what problems humans can only solve over extended periods and how institutions can be built to tackle them.\n\nThe author provides a curated list of examples of such long-term projects, focusing on goal-directed endeavors rather than decentralized or unplanned changes. These examples include:\n\n*   **Mathematical Proofs:** Fermat's Last Theorem, requiring centuries of mathematical development.\n*   **Architectural Marvels:** Cathedrals like Notre Dame and the ongoing Sagrada Familia.\n*   **Longitudinal Studies:** Cape Grim Air Archive, Framingham Heart Study, Central England Temperature series.\n*   **Scientific Instruments:** LIGO gravitational wave detector.\n*   **Evolutionary Experiments:** E. coli long-term evolution experiment, Pitch drop experiment.\n*   **Enduring Constructions:** The Clock of the Long Now, 2nd Ave Subway.\n*   **Long-lasting Organizations:** Oldest companies like Kongo Gumi (now defunct) and Shinto Shrines.\n*   **Longitudinal Research:** Study of Mathematically Precocious Youth.\n\nThe article also touches on the potential for long-term survival of open-source systems like Linux and Wikipedia, and the endurance of standards like ASCII and TCP/IP. A key question is raised: Could these projects have been significantly accelerated, or was their longevity essential to their success? The author concludes by noting the psychological impact of observing such long-term experiments, shaping the perception of possibilities.\n",
    "chinese_title": "慢",
    "chinese_summary": "本文探讨了“慢”项目，即那些需要很长时间才能完成或维护的项目，并将它们与“快”项目进行对比。文章提出了一个问题：人类只能在较长时间内解决哪些问题？以及如何建立机构来解决这些问题？\n\n作者提供了一份精心策划的长期项目案例清单，重点关注有目标导向的努力，而非分散或无计划的改变。这些例子包括：\n\n*   **数学证明：** 费马大定理，需要几个世纪的数学发展。\n*   **建筑奇迹：** 巴黎圣母院和仍在建设中的圣家堂。\n*   **纵向研究：** 弗雷姆角空气档案馆、弗雷明汉心脏研究、英格兰中部气温序列。\n*   **科学仪器：** LIGO引力波探测器。\n*   **进化实验：** 大肠杆菌长期进化实验、沥青滴漏实验。\n*   **持久的建筑：** 长今钟、第二大道地铁。\n*   **长寿组织：** 金刚组（现已倒闭）和神社等最古老的公司。\n*   **纵向研究：** 对数学早慧青年的研究。\n\n文章还涉及了Linux和维基百科等开源系统长期生存的潜力，以及ASCII和TCP/IP等标准的持久性。一个关键问题被提出：这些项目是否可以显著加速？或者它们的寿命对于它们的成功至关重要？作者最后指出，观察这些长期实验对心理的影响，塑造了人们对可能性的认知。"
  },
  {
    "id": "44758511",
    "title": "OpenAI Leaks 120B Open Model on Hugging Face",
    "url": "https://twitter.com/main_horse/status/1951201925778776530",
    "summary": "This \"article\" titled \"OpenAI Leaks 120B Open Model on Hugging Face\" presents a broken website experience from X (formerly Twitter). The content provided is essentially an error message indicating that JavaScript is disabled in the user's browser. It suggests enabling JavaScript or switching to a supported browser. Legal information from X Corp. is also displayed.\n\nTherefore, there is **no actual article content** discussing an OpenAI leak or a 120B open model on Hugging Face. The title is misleading, and the page doesn't contain any information to support it. The information presented is related to a website malfunction rather than an OpenAI leak. The user is seeing the basic footer of X.com due to the Javascript error.\n",
    "chinese_title": "OpenAI 在 Hugging Face 上泄露了 1200 亿参数的开源模型",
    "chinese_summary": "标题为“OpenAI在Hugging Face上泄露120B开放模型”的文章显示来自X（前Twitter）的网站体验出现故障。内容本质上是一条错误消息，表明用户的浏览器已禁用JavaScript。建议启用JavaScript或切换到受支持的浏览器。还显示了来自X Corp.的法律信息。\n\n因此，**没有实际的文章内容**讨论OpenAI泄露或在Hugging Face上的120B开放模型。标题具有误导性，该页面不包含任何支持标题的信息。所呈现的信息与网站故障有关，而不是OpenAI泄露。用户由于Javascript错误而看到X.com的基本页脚。"
  },
  {
    "id": "44755644",
    "title": "The untold impact of cancellation",
    "url": "https://pretty.direct/impact",
    "summary": "The author details the devastating impact of being \"canceled\" within the Scala programming community in 2021 after being accused of sexual misconduct in coordinated online posts. These accusations, amplified by an open letter signed by prominent community members, led to immediate and widespread ostracism. He vehemently denies the allegations, emphasizing the lack of due process.\n\nThe consequences were swift and severe. He lost his job, income, home, and many friendships. His contributions to the Scala community, including open-source projects and training materials, were abandoned or removed. He describes the psychological toll of seeing friends and acquaintances publicly condemn him, leading to a profound sense of isolation and a questioning of his past dedication to the community. He highlights the lasting impact on his mental health and the challenges of recontextualizing his past experiences in light of the accusations.\n\nThe author also discusses the financial hardships exacerbated by the pandemic, which had already impacted his training and conference business. The cancellation further eroded his ability to earn a living, pushing him into debt and eventual homelessness. He advocates for greater awareness of the destructive power of online condemnation and calls for caution when participating in such actions due to their profound impact on individuals' lives.\n",
    "chinese_title": "取消事件未被讲述的影响",
    "chinese_summary": "作者详细描述了在2021年因被指控在有组织的在线帖子中存在性行为不端后，在Scala编程社区内被“取消”所带来的毁灭性影响。这些指控被一份由社区知名成员签署的公开信放大，导致立即且广泛的排斥。他强烈否认这些指控，并强调缺乏正当程序。\n\n后果是迅速而严重的。他失去了工作、收入、住所和许多友谊。他对Scala社区的贡献，包括开源项目和培训材料，被放弃或删除。他描述了看到朋友和熟人公开谴责他的心理打击，导致一种深刻的孤立感，并开始质疑他过去对社区的奉献。他强调了对他的心理健康的持久影响，以及在这些指控的影响下，重新解读他过去经历的挑战。\n\n作者还讨论了因疫情加剧的经济困难，疫情已经影响了他的培训和会议业务。这次“取消”进一步削弱了他的谋生能力，使他陷入债务和最终的无家可归。他呼吁人们更加意识到网络谴责的破坏力，并呼吁人们在参与此类行为时保持谨慎，因为它们对个人生活有着深远的影响。"
  },
  {
    "id": "44726641",
    "title": "Pseudo, a Common Lisp macro for pseudocode expressions",
    "url": "http://funcall.blogspot.com/2025/07/pseudo.html",
    "summary": "This blog post introduces \"Pseudo,\" a Common Lisp macro that leverages a large language model (LLM) to expand pseudocode expressions into Lisp code. The author, Joe Marshall, proposes embedding an LLM directly into a programming language, rather than using it as an API. The `pseudo` macro takes a string describing a desired expression and uses the LLM to generate the corresponding s-expression, allowing users to integrate LLM-generated code seamlessly into their Lisp programs.\n\nThe macro provides the LLM with contextual information like lexically visible variables, function names, and coding style preferences to improve code generation accuracy and predictability.  Lisp's s-expression-based macro system provides more contextual information to the LLM, making it easier to implement compared to languages like Java.\n\nThe author acknowledges the limitations of using LLMs, including speed, cost, and the potential for unpredictable or incorrect code. He emphasizes that it's not suitable for production environments.  `pseudo` has a dependency on SBCL for extracting lexical variables and requires the `gemini` library, along with several other dependencies available on Quicklisp and GitHub.  Marshall encourages readers to try `pseudo` and provide feedback.\n\nA comment from Josh Ballanco mentions a similar concept implemented in Julia, highlighting the advantages of Lisp-like languages for metaprogramming.  Marshall responds, emphasizing the importance of limiting the scope of LLM-generated code to smaller expressions to improve reliability.\n",
    "chinese_title": "用于伪代码表达式的 Common Lisp 宏 Pseudo",
    "chinese_summary": "这篇博文介绍了“Pseudo”，一个Common Lisp宏，它利用大型语言模型（LLM）将伪代码表达式扩展为Lisp代码。作者Joe Marshall提出将LLM直接嵌入到编程语言中，而不是将其用作API。`pseudo`宏接收一个描述所需表达式的字符串，并使用LLM生成相应的s-表达式，从而允许用户将LLM生成的代码无缝集成到他们的Lisp程序中。\n\n该宏向LLM提供上下文信息，如词法可见的变量、函数名称和编码风格偏好，以提高代码生成准确性和可预测性。与Java等语言相比，Lisp基于s-表达式的宏系统为LLM提供了更多的上下文信息，使其更容易实现。\n\n作者承认使用LLM的局限性，包括速度、成本以及生成不可预测或不正确代码的可能性。他强调它不适用于生产环境。`pseudo`依赖于SBCL来提取词法变量，并需要`gemini`库，以及Quicklisp和GitHub上提供的其他几个依赖项。Marshall鼓励读者尝试`pseudo`并提供反馈。\n\nJosh Ballanco的评论提到了在Julia中实现的类似概念，突出了类似Lisp的语言在元编程方面的优势。Marshall回应说，强调限制LLM生成的代码的范围在较小的表达式内，以提高可靠性。"
  },
  {
    "id": "44756045",
    "title": "Live coding interviews measure stress, not coding skills",
    "url": "https://hadid.dev/posts/living-coding/",
    "summary": "This article argues that live coding interviews primarily measure stress response, not actual coding skills. The author recounts their own experience failing a live coding test despite later easily solving the problem and cites research showing that stress impairs cognitive function, specifically working memory, crucial for coding.\n\nThe article highlights a study by Microsoft researchers where participants performed significantly worse on coding tasks when observed (\"public setting\") compared to coding alone (\"private setting\"). Shockingly, no women passed in the public setting, while all did in the private setting, suggesting live coding acts as an unfair \"exclusion filter,\" particularly for women.\n\nWhile some companies may intentionally use live coding to assess performance under pressure, the author contends that most simply want skilled engineers. Freezing during a timed coding exercise doesn't necessarily reflect overall coding ability, documentation skills, or debugging prowess.\n\nThe author suggests mitigating stress by practicing mock live coding sessions. They also mention potential supplements like L-tyrosine (to replenish catecholamines) and L-theanine (for relaxation and focus), although caution is advised. The article concludes that struggling with live coding doesn't equate to being a bad engineer, emphasizing that it's a test of stress response, not inherent coding aptitude.\n",
    "chinese_title": "现场编程面试衡量的是压力，而非编程技能。",
    "chinese_summary": "本文认为在线编程面试主要衡量的是压力反应，而非实际的编码技能。作者回忆了自己未能通过在线编程测试的经历，尽管之后轻松解决了问题，并引用研究表明压力会损害认知功能，特别是对编码至关重要的工作记忆。\n\n本文重点介绍了一项微软研究人员的研究，该研究表明，与单独编码（“私下环境”）相比，参与者在被观察（“公开环境”）时，编码任务表现明显更差。令人震惊的是，在公开环境中没有女性通过测试，而在私下环境中所有女性都通过了测试，这表明在线编程面试充当了一个不公平的“排除过滤器”，尤其是对女性而言。\n\n虽然一些公司可能有意使用在线编程面试来评估压力下的表现，但作者认为大多数公司只是想要有技能的工程师。在限时编程练习中卡壳并不一定反映整体的编码能力、文档编写能力或调试能力。\n\n作者建议通过练习模拟在线编程会话来减轻压力。他们还提到了一些潜在的补充剂，如L-酪氨酸（补充儿茶酚胺）和L-茶氨酸（放松和集中注意力），但建议谨慎使用。文章总结说，在线编程面试表现不佳并不等同于成为一名糟糕的工程师，强调这是一种压力反应测试，而不是固有的编码能力测试。"
  },
  {
    "id": "44757316",
    "title": "Long Term Support",
    "url": "https://www.sqlite.org/lts.html",
    "summary": "SQLite's developers are committed to supporting the database system until at least 2050 and beyond. This long-term vision influences development decisions, prioritizing cross-platform compatibility, stable database files, rigorous testing, extensive documentation, well-commented source code, and disaster planning. SQLite is designed to run on a wide range of platforms and its database files are bit-for-bit identical across architectures, ensuring longevity and accessibility.\n\nThe commitment to long-term support is evident in several ways. Extensive testing ensures robustness for future migrations, while detailed documentation and heavily commented source code make the system accessible to new developers and maintainable over time. Disaster planning, including geographically distributed source code repositories and diverse development teams, safeguards against data loss and ensures continued development. The team avoids fleeting programming trends, focusing on timeless code that will remain understandable and maintainable.\n\nCrucially, SQLite guarantees full backwards compatibility for its C-language API and on-disk format. This means that applications built today will be able to use future versions of SQLite seamlessly. This commitment aims to ensure that data stored in SQLite remains accessible for generations to come. The US Library of Congress has recognized SQLite as a recommended storage format for the preservation of digital content, highlighting its suitability for long-term data storage.\n",
    "chinese_title": "长期支持",
    "chinese_summary": "SQLite的开发者致力于至少到2050年及以后继续支持该数据库系统。 这种长远眼光影响着开发决策，优先考虑跨平台兼容性、稳定的数据库文件、严格的测试、详尽的文档、注释详尽的源代码以及灾难规划。 SQLite旨在广泛的平台上运行，并且其数据库文件在各种架构上都是逐位相同的，从而确保了持久性和可访问性。\n\n对长期支持的承诺体现在多个方面。 广泛的测试确保了未来迁移的稳健性，而详细的文档和注释丰富的源代码使新开发人员易于访问该系统，并使其在很长一段时间内保持可维护性。 灾难规划，包括地理上分布的源代码存储库和多元化的开发团队，可防止数据丢失并确保持续开发。 该团队避免了转瞬即逝的编程趋势，专注于永恒的代码，这些代码将始终保持可理解和可维护。\n\n至关重要的是，SQLite保证其C语言API和磁盘格式的完全向后兼容性。 这意味着今天构建的应用程序将能够无缝使用SQLite的未来版本。 这种承诺旨在确保存储在SQLite中的数据在未来几代人都可以访问。 美国国会图书馆已将SQLite确认为数字内容保存的推荐存储格式，突显了其长期数据存储的适用性。"
  },
  {
    "id": "44756314",
    "title": "GPT-5 is already (ostensibly) available via API",
    "url": "https://old.reddit.com/r/OpenAI/comments/1mettre/gpt5_is_already_ostensibly_available_via_api/",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "GPT-5 据称已通过 API 提供",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "44758339",
    "title": "FBI seized $40k from Linda Martin without charging her with a crime",
    "url": "https://reason.com/2025/07/28/the-fbi-took-her-40000-without-explaining-why-she-fought-back-and-lost/",
    "summary": "Linda Martin had $40,000 seized by the FBI from her safe-deposit box at U.S. Private Vaults, a company suspected of criminal wrongdoing. Despite the warrant forbidding seizure of customers' boxes without cause, the FBI confiscated assets from numerous innocent individuals, including Martin. The agency provided a vague notice listing numerous potential federal crimes but failed to specify any connection between Martin and those offenses.\n\nMartin sued, arguing that the FBI violated due process by seizing assets without a clear explanation. Although the FBI eventually returned her money after two years, Martin continued the lawsuit to challenge the FBI's practice of seizing assets without justification. Other individuals, like Travis May and the Snitkos, also had cash and personal items seized from them and suffered losses, including lost gold coins.\n\nHowever, the U.S. Court of Appeals for the District of Columbia dismissed her suit for lack of jurisdiction. Attorneys from the Institute for Justice (I.J.), who represented Martin, criticize the civil forfeiture system, which allows the FBI to keep seized assets without clearly stating why the seizure is justified. They highlight that this lack of transparency prevents property owners from understanding the basis of the forfeiture and effectively challenging it, leading to a high percentage of forfeitures going uncontested. They hope a suitable case will reach the Supreme Court and challenge the current civil forfeiture system.\n",
    "chinese_title": "联邦调查局没起诉琳达·马丁就没收了她四万美元。",
    "chinese_summary": "琳达·马丁曾有四万美元被联邦调查局从美国私人金库（一家涉嫌犯罪的公司）的保险箱中没收。尽管搜查令禁止在没有理由的情况下没收客户的箱子，但联邦调查局没收了包括马丁在内的大量无辜个人的资产。该机构提供了一份含糊不清的通知，列出了许多潜在的联邦犯罪，但未能明确马丁与这些罪行之间的任何联系。\n\n马丁提起诉讼，认为联邦调查局在没有明确解释的情况下没收资产，侵犯了正当程序。尽管联邦调查局最终在两年后归还了她的钱，但马丁继续提起诉讼，以挑战联邦调查局在没有正当理由的情况下没收资产的做法。其他个人，如特拉维斯·梅和斯尼特科夫妇，他们的现金和个人物品也被没收，并遭受损失，包括丢失的金币。\n\n然而，美国哥伦比亚特区巡回上诉法院以缺乏管辖权为由驳回了她的诉讼。代表马丁的公正研究所（I.J.）的律师批评了民事没收制度，该制度允许联邦调查局在没有明确说明没收理由的情况下保留没收的资产。他们强调，这种缺乏透明度使得财产所有者无法理解没收的依据，也无法有效地质疑它，从而导致很高比例的没收无人质疑。他们希望一个合适的案件能够提交到最高法院，并挑战目前的民事没收制度。"
  },
  {
    "id": "44755528",
    "title": "How did Facebook intercept competitor's encrypted mobile app traffic? (2024)",
    "url": "https://haxrob.net/onavo-facebook-ssl-mitm-technical-analysis/",
    "summary": "This article analyzes how Facebook, through its Onavo Protect app, allegedly intercepted encrypted traffic from competitors like Snapchat, YouTube, and Amazon between 2016 and 2019. The strategy, termed \"ssl bump,\" involved prompting users to install a \"Facebook Research\" Certificate Authority (CA) certificate on their Android devices, enabling Facebook to decrypt TLS traffic.\n\nThe article details the technical aspects of this Man-in-the-Middle (MITM) attack, facilitated by a VPN connection and a Squid caching proxy. Facebook was reportedly targeting specific competitor domains to gain \"in-app\" intelligence. The author reverse-engineered archived versions of the Onavo Protect app to uncover the embedded CA certificates used for decryption.\n\nThe article highlights how Android security updates, specifically starting with Android 7 (Nougat), made this MITM technique increasingly difficult by limiting trust in user-installed certificates. Furthermore, certificate pinning by apps, had it been fully implemented by competitors, would have prevented successful interception. The author discovered that Snapchat, at the time, did not implement certificate pinning for its analytics domain, leaving it vulnerable.\n\nThe article also mentions Facebook's consideration of abusing Android's Accessibility API as an alternative after the MITM technique became less effective.\n",
    "chinese_title": "脸书如何拦截竞争对手的加密移动应用流量？ (2024)",
    "chinese_summary": "本文分析了Facebook如何利用其Onavo Protect应用程序，据称在2016年至2019年间拦截了Snapchat、YouTube和Amazon等竞争对手的加密流量。该策略被称为“ssl bump”，涉及提示用户在其Android设备上安装“Facebook Research”证书颁发机构(CA)证书，使Facebook能够解密TLS流量。\n\n本文详细介绍了这种中间人(MITM)攻击的技术方面，该攻击由VPN连接和Squid缓存代理促成。据报道，Facebook的目标是特定的竞争对手域名，以获取“应用内”情报。作者对Onavo Protect应用程序的存档版本进行了逆向工程，以揭示用于解密的嵌入式CA证书。\n\n本文强调了Android安全更新，特别是从Android 7 (Nougat)开始，如何通过限制对用户安装证书的信任，使这种MITM技术越来越困难。此外，如果竞争对手完全实施了证书锁定，本可以阻止成功的拦截。作者发现，当时Snapchat并未对其分析域实施证书锁定，使其易受攻击。\n\n本文还提到，在MITM技术效果降低后，Facebook曾考虑滥用Android的辅助功能API作为替代方案。"
  },
  {
    "id": "44750416",
    "title": "The anti-abundance critique on housing is wrong",
    "url": "https://www.derekthompson.org/p/the-anti-abundance-critique-on-housing",
    "summary": "Derek Thompson's article critiques the \"anti-abundance\" argument that blames housing affordability issues on homebuilding monopolies restricting supply. Thompson focuses on a detailed analysis of the Dallas, Texas, housing market by Basel Musharbash, a key example used by antitrust advocates.\n\nThompson's investigation reveals several flaws in Musharbash's claims. He contacted the experts cited in Musharbash's article and found that their views were misrepresented or misapplied. Specifically, an economist whose research was used to support the \"oligopoly\" argument stated that Dallas doesn't meet the criteria for a dangerous level of market concentration. Similarly, a Dallas housing analyst quoted as describing builders as \"market-share-devouring juggernauts\" clarified that he doesn't believe large builders are driving up prices and instead attributes it to land use regulations like zoning. An industry expert whose data on builder consolidation is frequently cited said market concentration isn't a top concern in housing and argues big builders may actually increase supply.\n\nThompson concludes that the anti-abundance critique on housing relies on misinterpretations, out-of-context quotes, and assertions lacking evidence. He challenges the notion that breaking up large homebuilders is a solution, questioning whether a construction industry solely composed of vulnerable, small builders is desirable.\n",
    "chinese_title": "针对住房反富足论的批判是错误的。",
    "chinese_summary": "德里克·汤普森的文章批判了“反充裕”论点，该论点将住房可负担性问题归咎于房屋建筑垄断限制了供应。汤普森重点分析了巴塞尔·穆沙巴什对德克萨斯州达拉斯住房市场的详细分析，这是反垄断倡导者使用的一个关键案例。\n\n汤普森的调查揭示了穆沙巴什的主张中的几个缺陷。他联系了穆沙巴什文章中引用的专家，发现他们的观点被歪曲或误用。具体来说，一位其研究被用来支持“寡头垄断”论点的经济学家表示，达拉斯不符合市场集中度达到危险水平的标准。同样，一位被引用描述建筑商为“吞噬市场份额的巨头”的达拉斯住房分析师澄清说，他不认为大型建筑商正在推高价格，而是将其归因于土地使用法规，如分区。一位经常被引用其关于建筑商整合数据的行业专家表示，市场集中度不是住房的首要问题，并认为大型建筑商实际上可能会增加供应。\n\n汤普森总结说，对住房的“反充裕”批判依赖于误解、断章取义的引用以及缺乏证据的主张。他质疑打破大型房屋建筑商的观点，质疑一个完全由脆弱的小型建筑商组成的建筑行业是否是可取的。"
  },
  {
    "id": "44755551",
    "title": "Navy demonstrates multi-day solar UAS flight",
    "url": "https://www.navair.navy.mil/news/Navy-demonstrates-multi-day-solar-UAS-flight/Tue-07292025-1554",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "海军演示多日太阳能无人机飞行",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "44745555",
    "title": "Releasing weights for FLUX.1 Krea",
    "url": "https://www.krea.ai/blog/flux-krea-open-source-release",
    "summary": "On July 31, 2025, Krea AI released open weights for FLUX.1 Krea [dev], their first image model trained in collaboration with Black Forest Labs, aimed at providing superior aesthetic control and image quality, while avoiding the common \"AI look.\" This checkpoint is a guidance distilled model compatible with the FLUX.1 ecosystem.\n\nThe article highlights the challenges of AI-generated images, particularly the prevalence of the \"AI look\" characterized by blurry backgrounds, waxy skin textures, and boring compositions. They argue that current benchmarks prioritize technical capabilities over aesthetic quality and stylistic diversity.\n\nTheir goal was to create AI images that don't look AI, addressing issues misaligned with user preferences. They focused on careful data curation and model calibration.\n\nThe development process involved pre-training (focused on mode coverage and world understanding, even with \"bad\" data to inform negative prompts) and post-training (focused on mode collapsing to bias the model towards desirable aesthetics).\n\nFor post-training, they partnered with Black Forest Labs, utilizing their flux-dev-raw model as a base, which offers world knowledge and diverse outputs without the common \"AI aesthetic\". Their post-training pipeline involves Supervised Finetuning (SFT) with hand-curated and synthetic images, and Reinforcement Learning from Human Feedback (RLHF) using a preference optimization technique called TPO to boost aesthetics and stylization.\n\nKey findings included the importance of data quality over quantity and taking an opinionated approach to aesthetic preferences rather than relying on global user preferences. Future research will focus on personalization, aesthetics, and controllability.\n",
    "chinese_title": "发布 FLUX.1 Krea 的权重",
    "chinese_summary": "2025年7月31日，Krea AI发布了FLUX.1 Krea [dev]的开源权重，这是他们与黑森林实验室合作训练的首个图像模型，旨在提供卓越的美学控制和图像质量，同时避免常见的“AI感”。该检查点是一个与FLUX.1生态系统兼容的指导蒸馏模型。\n\n文章强调了AI生成图像的挑战，特别是“AI感”的普遍存在，其特征是模糊的背景、蜡状的皮肤纹理和乏味的构图。他们认为，目前的基准测试优先考虑技术能力，而不是美学质量和风格多样性。\n\n他们的目标是创造看起来不像AI的AI图像，解决与用户偏好不符的问题。他们专注于仔细的数据管理和模型校准。\n\n开发过程包括预训练（侧重于模式覆盖和世界理解，即使使用“坏”数据来告知负面提示）和后训练（侧重于模式崩溃，以使模型偏向于理想的美学）。\n\n在后训练方面，他们与黑森林实验室合作，使用他们的flux-dev-raw模型作为基础，该模型提供世界知识和多样化的输出，而没有常见的“AI美学”。他们的后训练流程涉及使用手工策划和合成图像进行监督微调（SFT），以及使用称为TPO的偏好优化技术从人类反馈中进行强化学习（RLHF），以提高美学和风格化水平。\n\n主要发现包括数据质量的重要性超过数量，以及采取对美学偏好的主观方法，而不是依赖于全球用户偏好。未来的研究将侧重于个性化、美学和可控性。"
  },
  {
    "id": "44755441",
    "title": "Belgium bans Internet Archive's ‘Open Library’",
    "url": "https://torrentfreak.com/belgium-bans-internet-archives-open-library-in-sweeping-site-blocking-order/",
    "summary": "Belgium has banned the Internet Archive's Open Library, along with other pirate libraries like Anna's Archive and Z-Library, through a broad blocking order issued by the Brussels Business Court. The request came from publishing and author organizations citing copyright infringement.\n\nThe Open Library, founded by Aaron Swartz and Brewster Kahle, aims to archive all published books and loan digital copies, but it has been sued previously in the U.S. for its scanning practices. Belgian publishers argue that the Open Library illegally provides access to copyrighted material without permission, making it similar to pirate sites.\n\nThe order is notable for its sweeping scope. It not only targets ISPs like Telenet and Starlink for DNS blocking, but also compels search engines (Google, Bing) to remove the sites from search results and block DNS queries. Hosting providers (Hostinger, GoDaddy, AWS, Cloudflare, etc.) are instructed to terminate hosting and deactivate domain names, while payment intermediaries (Alipay, Cash App, PayPal) are to suspend services.\n\nThe Internet Archive was not consulted before the order was issued. The publishers cited a U.S. court order against the Open Library as justification for the blocking. This ban effectively prevents access to the Open Library in Belgium, including public domain content. Pushback from affected intermediaries is anticipated.\n",
    "chinese_title": "比利时禁用互联网档案馆“开放图书馆”",
    "chinese_summary": "比利时已通过布鲁塞尔商业法院颁布的广泛禁令，禁止互联网档案的开放图书馆，以及其他盗版图书馆，如Anna's Archive和Z-Library。该请求来自出版和作者组织，理由是侵犯版权。\n\n开放图书馆由亚伦·斯沃茨和布鲁斯特·卡勒创立，旨在存档所有已出版的书籍并借出数字副本，但此前曾因其扫描行为在美国被起诉。比利时出版商认为，开放图书馆非法提供对受版权保护材料的访问，未经许可，使其类似于盗版网站。\n\n该禁令因其广泛的范围而引人注目。它不仅针对Telenet和Starlink等ISP进行DNS屏蔽，还强制搜索引擎（谷歌、必应）从搜索结果中删除这些网站并阻止DNS查询。托管服务提供商（Hostinger、GoDaddy、AWS、Cloudflare等）被指示终止托管并停用域名，而支付中介机构（支付宝、Cash App、PayPal）则需暂停服务。\n\n互联网档案在禁令发布前未被咨询。出版商引用了美国法院针对开放图书馆的命令，以此作为封锁的理由。该禁令实际上阻止了在比利时访问开放图书馆，包括公共领域内容。预计受影响的中介机构将会进行反击。"
  },
  {
    "id": "44721516",
    "title": "Show HN: Rewindtty – Record and replay terminal sessions as structured JSON",
    "url": "https://github.com/debba/rewindtty",
    "summary": "Rewindtty is a C-based hobby project that records and replays terminal sessions, storing them as structured JSON files. It aims to capture terminal input/output with precise timing. The project is under active development and encourages contributions.\n\nKey features include recording terminal sessions, replaying them with original timing, session analysis for statistics, a lightweight C implementation with minimal dependencies, and a web browser-based player.\n\nBuilding requires GCC, GNU Make, a standard C library with GNU extensions, and Git (including submodules). The `make` command compiles the project.\n\nUsage involves recording with `./build/rewindtty record [file]`, replaying with `./build/rewindtty replay [file]`, and analyzing with `./build/rewindtty analyze [file]`. The browser player, found in `browser_player/`, offers an enhanced experience with an interactive timeline, command list, bookmarks, playback controls, and drag-and-drop file loading.\n\nThe session files are stored in `data/session.json`. The project handles interruption signals gracefully, ensuring proper file closure. The project is licensed under the MIT License.\n",
    "chinese_title": "Show HN: Rewindtty – 以结构化 JSON 格式记录和回放终端会话",
    "chinese_summary": "Rewindtty: 一款基于C的终端会话录制与回放工具，将数据存储为结构化的JSON文件。旨在精确捕获终端输入/输出及其时间信息。项目正在积极开发中，欢迎贡献。\n\n主要特性包括：录制终端会话、按原始时间回放、会话统计分析、轻量级C实现及极少的依赖项，以及基于Web浏览器的播放器。\n\n构建需要GCC、GNU Make、带有GNU扩展的标准C库和Git（包括子模块）。使用`make`命令编译项目。\n\n用法：使用`./build/rewindtty record [file]`录制，使用`./build/rewindtty replay [file]`回放，使用`./build/rewindtty analyze [file]`分析。`browser_player/`中的浏览器播放器提供增强体验，包含交互式时间线、命令列表、书签、播放控制以及拖放文件加载功能。\n\n会话文件存储在`data/session.json`中。项目能优雅地处理中断信号，确保文件正确关闭。本项目采用MIT许可证。"
  },
  {
    "id": "44746603",
    "title": "Ubiquiti launches UniFi OS Server for self-hosting",
    "url": "https://lazyadmin.nl/home-network/unifi-os-server/",
    "summary": "Ubiquiti has launched UniFi OS Server in Early Access, enabling users to self-host their complete UniFi network stack, including UniFi Network, InnerSpace, and UniFi Identity. This offers more control and flexibility compared to cloud-based solutions.\n\nThe article details the requirements for installation, including storage (minimum 20GB), specific operating system requirements (WSL2 for Windows, Podman 4.3.1+ for Linux), and a list of required open ports. Download links for various operating systems (Windows, macOS, and Linux for both arm64 and x64 architectures) are provided.\n\nThe author's experience primarily focuses on Windows installation, describing the straightforward process of downloading the setup file and following the prompts. Setting up the WSL environment and initial server boot-up takes some time. Logging in with a Ubiquiti account allows for remote management, MFA, cloud backups, and access to features like Teleport and Site Magic VPN. Existing UniFi Network configurations or backups from UniFi Consoles can be imported.\n\nUniFi OS Server comes with UniFi Network pre-installed. InnerSpace can be added through the settings. The server runs in the background even after closing the interface, and can be stopped/started via the system tray.\n\nThe article also includes a set of commands for installing UniFi OS Server on Debian, along with a script for installing a Let's Encrypt SSL certificate.\n\nThe author expresses hope that UniFi Protect will be added to UOS in the future and encourages readers to leave questions in the comments.\n",
    "chinese_title": "Ubiquiti 推出用于自托管的 UniFi OS 服务器",
    "chinese_summary": "Ubiquiti发布UniFi OS服务器抢先体验版，使用户能够自托管其完整的UniFi网络堆栈，包括UniFi网络、InnerSpace和UniFi Identity。与基于云的解决方案相比，这提供了更多的控制和灵活性。\n\n文章详细介绍了安装要求，包括存储（最低20GB）、特定操作系统要求（Windows的WSL2，Linux的Podman 4.3.1+）以及所需开放端口列表。提供了适用于各种操作系统（Windows、macOS和Linux，arm64和x64架构）的下载链接。\n\n作者的经验主要集中在Windows安装上，描述了下载安装文件并按照提示操作的简单过程。设置WSL环境和初始服务器启动需要一些时间。使用Ubiquiti帐户登录可以进行远程管理、多因素身份验证、云备份，并访问诸如Teleport和Site Magic VPN之类的功能。可以导入来自UniFi控制台的现有UniFi网络配置或备份。\n\nUniFi OS服务器预装了UniFi网络。可以通过设置添加InnerSpace。即使关闭界面，服务器也会在后台运行，并且可以通过系统托盘停止/启动。\n\n文章还包括一组用于在Debian上安装UniFi OS服务器的命令，以及一个用于安装Let's Encrypt SSL证书的脚本。\n\n作者希望未来UniFi Protect能够添加到UOS中，并鼓励读者在评论中留下问题。"
  },
  {
    "id": "44745897",
    "title": "MacBook Pro Insomnia",
    "url": "https://manuel.bernhardt.io/posts/2025-07-24-macbook-pro-insomnia",
    "summary": "This article discusses a MacBook Pro (Silicon M1 Max) user experiencing significant battery drain overnight despite the laptop being in sleep mode. The issue started seemingly without cause after a period of proper functioning.\n\nThe author initially attempted to diagnose the problem using `pmset -g log` command in the terminal and created a tool to analyze the verbose power management logs, but this proved only marginally helpful. They experimented with settings like `tcpkeepalive` with little success.\n\nFurther research led to the discovery of the \"Sleep Aid\" application. Sleep Aid provides a more user-friendly interface for viewing wake events and adjusting related settings. The author noticed that the \"Wake for maintenance\" option was disabled, which Sleep Aid highlighted as a potential cause for frequent wake-up events.\n\nDisabling \"Wake for maintenance\" caused the MacBook Pro to frequently wake up in what the author describes as a \"wake-up frenzy\". Re-enabling the \"Wake for maintenance\" setting in Sleep Aid resolved the issue, significantly reducing overnight battery drain. In essence, the fix was to allow the Mac to wake up periodically for maintenance instead of constantly waking up for individual events.\n",
    "chinese_title": "MacBook Pro 睡眠问题",
    "chinese_summary": "本文讨论了一位 MacBook Pro (Silicon M1 Max) 用户在笔记本电脑处于睡眠模式时，经历夜间电池电量显著损耗的问题。这个问题似乎在正常运行一段时间后，无故发生。\n\n作者最初尝试使用终端中的 `pmset -g log` 命令诊断问题，并创建了一个工具来分析详细的电源管理日志，但结果收效甚微。他们尝试了诸如 `tcpkeepalive` 之类的设置，但效果不佳。\n\n进一步研究后，作者发现了“Sleep Aid”应用程序。“Sleep Aid”提供了一个更友好的用户界面，用于查看唤醒事件和调整相关设置。作者注意到“Wake for maintenance”（唤醒以进行维护）选项已禁用，而“Sleep Aid”将其突出显示为频繁唤醒事件的潜在原因。\n\n禁用“Wake for maintenance”导致 MacBook Pro 频繁唤醒，作者将其描述为“唤醒狂潮”。在“Sleep Aid”中重新启用“Wake for maintenance”设置解决了这个问题，显著减少了夜间电池电量损耗。本质上，解决方法是允许 Mac 定期唤醒以进行维护，而不是不断地为单个事件唤醒。"
  },
  {
    "id": "44746948",
    "title": "QUIC for the kernel",
    "url": "https://lwn.net/Articles/1029851/",
    "summary": "This LWN.net article discusses the ongoing efforts to integrate the QUIC transport-layer network protocol into the Linux kernel. QUIC aims to improve upon TCP by streamlining connection setup, supporting multiple data streams to avoid head-of-line blocking, encrypting metadata to prevent inspection by middleboxes, and circumventing protocol ossification.\n\nWhile QUIC is widely used in user-space applications like web browsers, its kernel implementation is lagging. Xin Long has posted initial patches to provide mainline kernel support, using IPPROTO_QUIC for socket creation, and integrating with user space for TLS handshake management via `sendmsg()` and `recvmsg()`. QUIC also caches TLS negotiations for faster subsequent connections.\n\nEarly performance benchmarks of the in-kernel QUIC implementation are underwhelming compared to in-kernel TLS and TCP. The article suggests that future hardware offload support and optimizations could improve performance. Despite current performance issues, there's already interest in integrating QUIC into Samba, the in-kernel SMB/NFS filesystems, and curl.\n\nThe initial patch series adds 9,000 lines of code, with more to come. The review process is expected to be lengthy, and mainline inclusion is unlikely before 2026. A brief commentary notes the presence of Rust based QUIC implementations.\n",
    "chinese_title": "内核 QUIC",
    "chinese_summary": "LWN.net文章：Linux内核中QUIC协议的集成进展\n\n本文探讨了将QUIC传输层网络协议集成到Linux内核的持续努力。QUIC旨在改进TCP，通过简化连接建立，支持多数据流以避免队头阻塞，加密元数据以防止中间盒检查，并规避协议僵化。\n\n虽然QUIC已广泛应用于Web浏览器等用户空间应用程序，但其内核实现却滞后。Xin Long发布了初始补丁，以提供主线内核支持，使用IPPROTO_QUIC进行套接字创建，并通过`sendmsg()`和`recvmsg()`与用户空间集成以进行TLS握手管理。QUIC还缓存TLS协商，以加快后续连接速度。\n\n与内核TLS和TCP相比，内核QUIC实现的早期性能基准测试表现平平。文章指出，未来的硬件卸载支持和优化可能会提高性能。尽管存在当前的性能问题，但已经有人对将QUIC集成到Samba，内核SMB/NFS文件系统和curl中感兴趣。\n\n初始补丁系列增加了9,000行代码，并且还将添加更多代码。预计审查过程将很漫长，并且在2026年之前不太可能包含在主线中。简短的评论指出存在基于Rust的QUIC实现。"
  },
  {
    "id": "44720077",
    "title": "Mountain of Ink",
    "url": "https://mountainofink.com",
    "summary": "This \"Mountain of Ink\" article reviews five standard Akkerman inks: 16 Oranje Boven, 17 Staten-Generaal Rood, 18 Garuda Rood, 19 Rood Haags Pluche, and 20 Pulchri Pink. The reviewer purchased these inks from retailers like Vanness Pens.\n\nThe review includes visual swabs of the inks and writing samples on Rhodia, Tomoe River, and Leuchtturm paper to assess their behavior. Key observations include dry times between 40-80 seconds and medium water resistance. All inks exhibited no feathering or bleeding on fountain pen-friendly paper, but showed medium show-through and low-medium shading. Oranje Boven displayed low gold sheen. On cheaper Walmart Pen + Gear copy paper, feathering was significant but bleeding was still absent.\n\nThe reviewer draws comparisons to other popular inks, finding 16 Oranje Boven similar to Sailor Kin-mokusei, 17 Staten-Generaal Rood to Diamine Amaranth, 18 Garuda Rood to PenBBS 381 Frosted Leaf in Autumn, 19 Rood Haags Pluche to Private Reserve Infinity Red, and 20 Pulchri Pink slightly warmer than Montblanc Pink.\n\nUsing a Taroko Enigma notebook, all inks had average flow. The reviewer's overall favorite is 16 Oranje Boven due to its shading, sheen, and well-behaved nature. The review concludes that any of the five inks would be a good choice. The author emphasizes the review is unsponsored and based on personal opinions.\n",
    "chinese_title": "墨山",
    "chinese_summary": "这篇“墨水山”文章评测了五款标准的阿克曼墨水：16号橙色之上，17号议会红，18号迦楼达红，19号海牙天鹅绒红，以及20号普尔其粉。 评测者从Vanness Pens等零售商处购买了这些墨水。\n\n评测包括墨水的视觉色卡以及在Rhodia、Tomoe River和Leuchtturm纸上的书写样本，以评估它们的表现。 主要观察结果包括40-80秒的干燥时间和中等防水性。 所有墨水在钢笔友好型纸张上均未出现洇墨或渗墨，但显示出中等透写和低到中等程度的色彩浓淡变化。 16号橙色之上呈现出低度金色光泽。 在较廉价的沃尔玛Pen + Gear复印纸上，洇墨现象明显，但仍然没有渗墨。\n\n评测者将这些墨水与其他流行的墨水进行比较，发现16号橙色之上类似于写乐金木犀，17号议会红类似于Diamine Amaranth，18号迦楼达红类似于坛水381秋叶霜，19号海牙天鹅绒红类似于Private Reserve Infinity Red，以及20号普尔其粉略微比万宝龙粉色更暖。\n\n在使用Taroko Enigma笔记本时，所有墨水都具有平均流畅度。 评测者最喜欢的是16号橙色之上，因为它具有色彩浓淡变化、光泽和良好的表现。 评测总结说，这五款墨水中的任何一款都是不错的选择。 作者强调，该评测为非赞助且基于个人观点。"
  },
  {
    "id": "44747457",
    "title": "Gemini Embedding: Powering RAG and context engineering",
    "url": "https://developers.googleblog.com/en/gemini-embedding-powering-rag-context-engineering/",
    "summary": "This Google Developers Blog post highlights the uses and benefits of the Gemini Embedding text model, particularly in the context of Retrieval-Augmented Generation (RAG) and context engineering for AI applications. The article emphasizes that Gemini Embedding enables AI agents to access and integrate crucial information (documents, conversation history, tool definitions) for improved performance.\n\nSeveral organizations are showcased to demonstrate Gemini Embedding in action:\n\n*   **Box:** Increased recall (3.6%) and multilingual support for answering questions from complex documents.\n*   **re:cap:** Improved F1 score (1.9% and 1.45% increase over previous Google models) in classifying B2B bank transactions, leading to sharper liquidity insights.\n*   **Everlaw:** Achieved 87% accuracy in semantic matching across millions of legal documents, outperforming Voyage and OpenAI models. Its Matryoshka property allows for efficient storage and retrieval.\n*   **Roo Code:** Enhanced code search accuracy and flexibility for developers by pairing Gemini Embedding with Tree-sitter for logical code splitting.\n*   **Mindlid:** Improved AI wellness companion with consistent sub-second latency (420ms median) and a 4% recall lift over OpenAI in understanding conversational history.\n*   **Interaction Co.:** Significantly reduced the time to embed emails (90.4% reduction compared to Voyage-2) for their AI email assistant, Poke.\n\nThe article concludes that high-performance embedding models like Gemini Embedding are foundational for building the next generation of autonomous agents that can reason, retrieve information, and act effectively.\n",
    "chinese_title": "Gemini 嵌入：赋能 RAG 和上下文工程",
    "chinese_summary": "Google开发者博客文章重点介绍了Gemini Embedding文本模型的用途和优势，尤其是在检索增强生成（RAG）和人工智能应用中的上下文工程方面。文章强调，Gemini Embedding使人工智能代理能够访问和整合关键信息（文档、对话历史、工具定义），从而提高性能。\n\n以下展示了几个组织使用Gemini Embedding的案例：\n\n*   **Box：** 提高了从复杂文档中回答问题的召回率（3.6%）和多语言支持。\n*   **re:cap：** 在B2B银行交易分类中提高了F1分数（比之前的Google模型分别提高了1.9%和1.45%），从而获得了更敏锐的流动性见解。\n*   **Everlaw：** 在数百万份法律文档的语义匹配中实现了87%的准确率，优于Voyage和OpenAI模型。其Matryoshka属性允许高效的存储和检索。\n*   **Roo Code：** 通过将Gemini Embedding与Tree-sitter配对以进行逻辑代码拆分，增强了开发人员的代码搜索准确性和灵活性。\n*   **Mindlid：** 改进了AI健康伴侣，具有一致的亚秒级延迟（中位数为420毫秒），并且在理解对话历史方面比OpenAI提高了4%的召回率。\n*   **Interaction Co.：** 大幅缩短了为其AI电子邮件助手Poke嵌入电子邮件的时间（与Voyage-2相比减少了90.4%）。\n\n文章总结说，像Gemini Embedding这样的高性能嵌入模型是构建下一代能够进行推理、检索信息和有效行动的自主代理的基础。"
  },
  {
    "id": "44744715",
    "title": "Many countries that said no to ChatControl in 2024 are now undecided",
    "url": "https://digitalcourage.social/@echo_pbreyer/114946559233051667",
    "summary": "This Mastodon post by Patrick Breyer, as cited by digitalcourage.social, discusses a leaked development regarding \"ChatControl\" (likely referring to the EU's proposed regulation on monitoring digital communication). The main point is that several countries which previously opposed the ChatControl proposal in 2024 are now \"undecided.\"\n\nThe post uses strong language, including an alarm emoji, suggesting Breyer views this shift in stance negatively. While the post itself doesn't provide details about which countries changed their position or the reasons behind the shift, the implication is that these countries are reconsidering their opposition to the controversial ChatControl proposal. This suggests a potential weakening of resistance against the proposed regulations, and therefore a possible increase in the likelihood of ChatControl being implemented, at least in some form. The post encourages readers to look into the situation further, highlighting the potential seriousness of the developments.\n",
    "chinese_title": "许多在2024年对ChatControl说不的国家现在犹豫不决。",
    "chinese_summary": "数字权利组织digitalcourage.social引用了Patrick Breyer的一条Mastodon帖子，该帖子讨论了关于“聊天监控”（可能指欧盟提出的监控数字通信的法规）泄露的进展。 主要内容是，此前在2024年反对聊天监控提案的几个国家现在“未定”。\n\n帖子使用了强烈的措辞，包括一个警报表情符号，表明Breyer对这种立场转变持否定态度。 虽然帖子本身没有提供关于哪些国家改变了立场或转变背后的原因的细节，但暗示这些国家正在重新考虑他们对有争议的聊天监控提案的反对意见。 这表明对拟议法规的抵制可能会减弱，因此聊天监控至少以某种形式实施的可能性可能会增加。 该帖子鼓励读者进一步调查情况，突出了事态发展的潜在严重性。"
  },
  {
    "id": "44726347",
    "title": "Programmers aren’t so humble anymore, maybe because nobody codes in Perl",
    "url": "https://www.wired.com/story/programmers-arent-humble-anymore-nobody-codes-in-perl/",
    "summary": "This article explores the rise and fall of the Perl programming language, arguing that its unique philosophy holds valuable lessons for today's tech landscape. Perl, once a dominant force on the internet, distinguished itself with its motto \"There's More Than One Way to Do It,\" embracing complexity and a \"write-only\" approach. Its creator, linguist Larry Wall, believed that programming languages should reflect the organic evolution and imperfections of natural languages.\n\nWhile Perl's messiness ultimately contributed to its decline, the author suggests its core value of humility remains relevant. In a world of complex technological systems, like AI, a single, rigid approach won't suffice. Perl's pluralism, acknowledging exceptions and complications, provides a valuable model for navigating this complexity.\n\nThe article contrasts Perl with the elegant, mathematical Lisp, highlighting Perl's \"language of the people\" quality. Despite its flaws, Perl reminds us that programming languages are fundamentally for human understanding and collaboration, not just machine execution. The author concludes that while a Perl revival is unlikely, its message of embracing human-centric, less precious approaches to programming remains timeless and crucial for bridging the gap between humans and machines.\n",
    "chinese_title": "程序员们不再那么谦逊了，也许是因为没人再用Perl编程了。",
    "chinese_summary": "本文探讨了Perl编程语言的兴衰，并认为其独特的哲学为当今科技领域提供了宝贵的经验教训。 Perl曾是互联网上的主导力量，以其“条条大路通罗马”的座右铭脱颖而出，拥抱复杂性和“只写”方法。 它的创造者，语言学家Larry Wall认为，编程语言应该反映自然语言的有机演变和不完善之处。\n\n虽然Perl的混乱最终导致了它的衰落，但作者认为其谦逊的核心价值仍然具有现实意义。 在像人工智能这样复杂的科技系统世界中，单一、僵化的方法是不够的。 Perl的多元化，承认例外和复杂性，为驾驭这种复杂性提供了一个有价值的模型。\n\n文章将Perl与优雅的数学语言Lisp进行了对比，突出了Perl“大众语言”的特质。 尽管存在缺陷，Perl提醒我们，编程语言从根本上是为了人类的理解和协作，而不仅仅是机器执行。 作者总结说，虽然Perl的复兴不太可能，但其拥抱以人为本、不那么精细的编程方法的理念仍然是永恒的，并且对于弥合人与机器之间的差距至关重要。"
  },
  {
    "id": "44755110",
    "title": "Onshape – Product Development Platform",
    "url": "https://www.onshape.com/en/",
    "summary": "Onshape is presented as a leading cloud-native CAD & PDM platform designed for improved design efficiency and team collaboration. It emphasizes accessibility on any device, eliminating crashes and data loss. The platform streamlines collaboration with features like branching and merging. Onshape offers a free Onshape Professional trial for up to 6 months.\n\nThe platform highlights its modern CAD and PDM capabilities, boasting new feature releases every three weeks. It positions itself as a solution that saves users development time. Key benefits include built-in PDM, secure real-time collaboration, and instant deployment on any device, which eliminates IT burdens. Onshape tracks all activity for infinite restore capabilities.\n\nThe document targets different user groups: professionals, enterprises, students/educators, and hobbyists, offering tailored plans for each. The article highlights user testimonials, showing how Onshape saved time and money for businesses. It underlines a departure from traditional CAD/PDM problems, such as crashes, file sharing complexities, and version control issues found in systems like SOLIDWORKS.\n\nIt promotes several features including parts, assemblies, drawings, sheet metal, frames, configurations, surfacing, simulation, PCB studio, rendering, customization & automation, augmented reality, CAM studio, real-time communication, collaboration tools, enterprise light users, integrations, administration, and security.\n",
    "chinese_title": "Onshape – 产品开发平台",
    "chinese_summary": "Onshape 是领先的云原生 CAD & PDM 平台，旨在提高设计效率和团队协作。它强调在任何设备上的可访问性，消除崩溃和数据丢失。该平台通过分支和合并等功能简化协作。Onshape 提供长达 6 个月的 Onshape Professional 免费试用。\n\n该平台强调其现代 CAD 和 PDM 功能，并以每三周发布新功能为荣。它将自身定位为节省用户开发时间的解决方案。主要优势包括内置 PDM、安全的实时协作以及在任何设备上的即时部署，从而消除了 IT 负担。Onshape 跟踪所有活动以实现无限恢复能力。\n\n该文档面向不同的用户群体：专业人士、企业、学生/教育工作者和业余爱好者，为每个群体提供量身定制的计划。文章重点介绍了用户评价，展示了 Onshape 如何为企业节省时间和金钱。它强调摆脱了传统 CAD/PDM 问题，例如崩溃、文件共享复杂性和 SOLIDWORKS 等系统中存在的版本控制问题。\n\n它推广了多个功能，包括零件、装配体、工程图、钣金、框架、配置、曲面、仿真、PCB 工作室、渲染、定制和自动化、增强现实、CAM 工作室、实时通信、协作工具、企业轻量级用户、集成、管理和安全性。"
  },
  {
    "id": "44705960",
    "title": "Show HN: I made a website that makes you cry",
    "url": "https://www.cryonceaweek.com",
    "summary": "This \"Show HN\" post introduces a website designed to evoke emotional responses and make visitors cry. The website, titled \"Cry Once a Week,\" features a simple interface with a call to action \"click to feel something.\" Clicking the button likely triggers a tear-inducing video. The site claims that studies show crying can relieve stress for a week.\n\nUsers are asked if the video made them cry and given \"Yes\" or \"No\" options. Regardless of their response, they are thanked for visiting and encouraged to return in a week. The site also offers a free eBook on the benefits of crying and updates on future projects in exchange for an email address. The page encourages sharing the experience and suggests refreshing the page for a new video and weekly visits for stress relief. There are multiple repetitions of the \"Thank you\" message and email signup section, suggesting possible variations or errors in the webpage's display.\n",
    "chinese_title": "展示一下：我做了一个让你哭的网站",
    "chinese_summary": "这个“Show HN”帖子介绍了一个旨在唤起情感反应并使访问者哭泣的网站。该网站名为“每周哭一次”，界面简洁，包含“点击以感受”的行动号召。点击按钮可能会触发一段催人泪下的视频。该网站声称研究表明哭泣可以缓解一周的压力。\n\n用户会被问及视频是否让他们哭了，并给出“是”或“否”的选项。无论他们的回答如何，他们都会被感谢来访，并被鼓励在一周后再次光临。该网站还提供一本关于哭泣益处的免费电子书，并提供未来项目更新，以换取电子邮件地址。该页面鼓励分享体验，并建议刷新页面以获取新视频，并每周访问以缓解压力。 “谢谢”消息和电子邮件注册部分有多次重复，表明网页的显示可能存在变化或错误。"
  },
  {
    "id": "44758938",
    "title": "Microsoft gives in to Chromebook bullies and drops Windows 11 SE",
    "url": "https://www.theregister.com/2025/08/01/microsoft_abandons_windows_11_se/",
    "summary": "In August 2025, Microsoft announced it would discontinue support for Windows 11 SE, its ChromeOS competitor in the education sector, by October 2026. This decision comes just four years after its release in 2021. Microsoft cited the absence of feature updates beyond version 24H2 as the reason for the transition recommendation to a full Windows 11 version.\n\nWindows 11 SE was a stripped-down, cloud-based, centrally managed operating system designed to mirror the ChromeOS experience, even launching alongside the budget-friendly $250 Surface SE laptop. Microsoft did not confirm whether the Surface SE laptop would also be discontinued and suggested transitioning to new hardware, indicating it's unlikely to remain a priority.\n\nThe move suggests a change in Microsoft's strategy in the education market, shifting away from direct competition with Chromebooks towards promoting the full version of Windows 11 as the ideal educational solution. While Chromebooks currently dominate the education space due to their ease of management and low cost, the article mentions educators are noticing the durability issues of cheap Chromebooks.\n\nThe article implies that Microsoft is struggling to compete with ChromeOS in the budget-conscious education market and is now banking on the broader appeal and functionality of its full Windows 11 offering.\n",
    "chinese_title": "微软屈服于 Chromebook 的霸凌，放弃 Windows 11 SE",
    "chinese_summary": "微软将于2026年10月停止对Windows 11 SE的支持"
  },
  {
    "id": "44729452",
    "title": "PHP-ORT: Machine learning inference for the web",
    "url": "https://krakjoe.github.io/ort/",
    "summary": "PHP-ORT aims to bring first-class machine learning inference capabilities to PHP, addressing the growing gap between PHP's dominance in web development and the increasing need for AI-powered applications. The current solutions for incorporating ML into PHP involve inefficient workarounds like external Python services or REST APIs.\n\nPHP-ORT offers a solution with a Tensor API, high-performance Math library, and optional ONNX integration, allowing direct ML inference in PHP. It focuses on production-ready infrastructure with key innovations like immutable tensors, dual storage class tensors, optimized memory management, SIMD optimization, and a robust type system. Performance benchmarks are reproducible and available.\n\nThe initiative directly addresses common criticisms, such as the lack of a PHP ML ecosystem, by positioning PHP-ORT as the foundational center for such an ecosystem to grow. It emphasizes that the project isn't about replacing Python for training, but about enabling inference directly within PHP applications.\n\nThe path forward involves validation, early adoption, community building, and ecosystem growth, ultimately aiming to make ML inference as simple as database queries for PHP developers. This would empower PHP developers to build intelligent applications and remain relevant in an AI-first world. The vision is to see every PHP website capable of intelligent behavior.\n",
    "chinese_title": "PHP-ORT：网页机器学习推理",
    "chinese_summary": "PHP-ORT 旨在为 PHP 带来一流的机器学习推理能力，解决 PHP 在 Web 开发领域的主导地位与对 AI 驱动应用程序日益增长的需求之间的差距。目前将 ML 整合到 PHP 的解决方案涉及低效的变通方法，例如外部 Python 服务或 REST API。\n\nPHP-ORT 提供了一个解决方案，该方案具有 Tensor API、高性能数学库和可选的 ONNX 集成，允许在 PHP 中直接进行 ML 推理。它专注于生产就绪的基础设施，具有关键创新，例如不可变张量、双存储类张量、优化的内存管理、SIMD 优化和强大的类型系统。性能基准是可重现且可用的。\n\n该倡议直接解决了常见的批评，例如缺乏 PHP ML 生态系统，通过将 PHP-ORT 定位为这样一个生态系统发展的基础中心。它强调该项目并非要取代 Python 进行训练，而是要直接在 PHP 应用程序中启用推理。\n\n未来的道路包括验证、早期采用、社区建设和生态系统增长，最终旨在使 ML 推理像 PHP 开发人员的数据库查询一样简单。这将使 PHP 开发人员能够构建智能应用程序并在 AI 优先的世界中保持相关性。愿景是看到每个 PHP 网站都具备智能行为。"
  },
  {
    "id": "44716521",
    "title": "Living with an Apple Lisa [video]",
    "url": "https://www.youtube.com/watch?v=KISxcJ2DydY",
    "summary": "This \"article\" isn't really an article, but more of a YouTube video description snippet. The title indicates the video is about \"Living with an Apple Lisa,\" likely a historical piece about the experience of using the Apple Lisa computer.\n\nHowever, the provided content is just the standard YouTube footer information, including links to things like copyright, contact information, advertising, developer resources, terms of service, privacy policy, and information about how YouTube functions. It also mentions the NFL Sunday Ticket and Google LLC.\n\nTherefore, the main point is that the provided content doesn't offer any information about the actual video content related to the Apple Lisa. It only provides boilerplate YouTube legal and operational links. To understand the video's content, one would need to watch the video itself.\n",
    "chinese_title": "与Apple Lisa共处 [视频]",
    "chinese_summary": "这篇“文章”实际上并非文章，更像是YouTube视频的描述片段。标题表明该视频是关于“与Apple Lisa共处”，很可能是一部关于使用Apple Lisa电脑体验的历史作品。\n\n然而，所提供的内容只是标准的YouTube页脚信息，包括版权、联系方式、广告、开发者资源、服务条款、隐私政策以及关于YouTube如何运作的信息的链接。它还提到了NFL Sunday Ticket和Google LLC。\n\n因此，重点是所提供的内容并未提供任何关于与Apple Lisa相关的实际视频内容的信息。它仅提供样板的YouTube法律和运营链接。要了解视频的内容，需要观看视频本身。"
  },
  {
    "id": "44707062",
    "title": "Raspberry Pi 5 Gets a MicroSD Express Hat",
    "url": "https://www.cnx-software.com/2025/07/28/raspberry-pi-5-gets-a-microsd-express-hat/",
    "summary": "This article discusses the RPI5-SDexpress-Hat, a new HAT+ for the Raspberry Pi 5 that adds a microSD Express card slot, allowing for significantly faster storage speeds compared to traditional microSD cards. Created by Will Whang, the HAT also includes an eject button and two Qwiic connectors.\n\nMicroSD Express cards utilize the PCIe interface and NVMe commands to achieve SSD-like performance. The motivation for this HAT stems from the upcoming Nintendo Switch 2, which is expected to feature a microSD Express slot.\n\nThe RPI5-SDexpress-Hat includes a WCH CH32V003 RISC-V microcontroller for hotplugging and unmounting, a PCIe Gen3 x1 interface, and various power management features. Benchmark tests demonstrate improved read and write speeds compared to standard microSD cards, particularly in random I/O operations.\n\nDespite the performance gains, the article notes that microSD Express cards are currently more expensive than comparable M.2 NVMe SSDs or CFexpress Type B cards. For example, the Samsung 256GB microSD Express card used in the demo costs $59.99 while a similar SSD goes for $25. Due to the cost, Will Whang will not manufacture the HAT, but the open-source design is available on GitHub under an MIT license, allowing others to produce it. The author speculates that microSD Express might become more viable for future Raspberry Pi models as prices decrease.\n",
    "chinese_title": "树莓派5获得MicroSD Express扩展板",
    "chinese_summary": "本文探讨了 RPI5-SDexpress-Hat，这是一款为 Raspberry Pi 5 设计的新型 HAT+ 扩展板，它增加了一个 microSD Express 卡槽，与传统的 microSD 卡相比，存储速度显著提高。这款扩展板由 Will Whang 创建，还包括一个弹出按钮和两个 Qwiic 连接器。\n\nMicroSD Express 卡利用 PCIe 接口和 NVMe 命令来实现类似 SSD 的性能。这款扩展板的动机源于即将推出的 Nintendo Switch 2，预计它将配备 microSD Express 卡槽。\n\nRPI5-SDexpress-Hat 包含一个用于热插拔和卸载的 WCH CH32V003 RISC-V 微控制器，一个 PCIe Gen3 x1 接口以及各种电源管理功能。基准测试表明，与标准 microSD 卡相比，读写速度有所提高，尤其是在随机 I/O 操作中。\n\n尽管性能有所提升，但文章指出，目前 microSD Express 卡比同等容量的 M.2 NVMe SSD 或 CFexpress Type B 卡更昂贵。例如，演示中使用的三星 256GB microSD Express 卡售价为 59.99 美元，而类似的 SSD 售价为 25 美元。由于成本原因，Will Whang 不会生产这款扩展板，但开源设计已在 GitHub 上以 MIT 许可证发布，允许其他人进行生产。作者推测，随着价格下降，microSD Express 可能会在未来的 Raspberry Pi 型号中变得更可行。"
  },
  {
    "id": "44747229",
    "title": "Show HN: Mcp-use – Connect any LLM to any MCP",
    "url": "https://github.com/mcp-use/mcp-use",
    "summary": "Mcp-use is an open-source library that allows developers to connect any Large Language Model (LLM) to any Model Context Protocol (MCP) server, enabling the creation of custom MCP agents with tool access, without relying on closed-source solutions. It supports LLMs that have tool calling capabilities like OpenAI, Anthropic, Groq, and Llama.\n\nKey features include ease of use (requiring only a few lines of code to create an agent), LLM flexibility, a code builder for exploring MCP capabilities, HTTP support, dynamic server selection, multi-server support, tool restrictions, and the ability to build custom agents using a LangChain adapter.\n\nThe library offers functionalities like streaming agent output for real-time feedback, and examples are provided for use cases such as web browsing with Playwright, Airbnb search, and Blender 3D creation. It supports configuration from files, HTTP connections, and multi-server setups, allowing agents to intelligently select the appropriate server for a task using a Server Manager.\n\nMcp-use allows restriction on tool access for security and supports sandboxed execution using E2B's cloud infrastructure, which eliminates the need for local dependencies and provides a consistent environment. Installation instructions and examples are provided, covering everything from basic setup to advanced features like restricted tool access and sandboxed execution.\n",
    "chinese_title": "Show HN: Mcp-use – 连接任意LLM到任意MCP",
    "chinese_summary": "Mcp-use 是一个开源库，允许开发者将任何大型语言模型 (LLM) 连接到任何模型上下文协议 (MCP) 服务器，从而创建具有工具访问权限的自定义 MCP 代理，而无需依赖闭源解决方案。它支持具有工具调用功能的 LLM，如 OpenAI、Anthropic、Groq 和 Llama。\n\n主要功能包括易用性（只需几行代码即可创建代理）、LLM 灵活性、用于探索 MCP 功能的代码构建器、HTTP 支持、动态服务器选择、多服务器支持、工具限制以及使用 LangChain 适配器构建自定义代理的能力。\n\n该库提供流式传输代理输出以实现实时反馈等功能，并提供了诸如使用 Playwright 进行网页浏览、Airbnb 搜索和 Blender 3D 创建等用例示例。它支持来自文件的配置、HTTP 连接和多服务器设置，允许代理使用服务器管理器智能地选择适合任务的服务器。\n\nMcp-use 允许限制工具访问以确保安全，并支持使用 E2B 云基础设施进行沙盒执行，从而无需本地依赖并提供一致的环境。提供了安装说明和示例，涵盖从基本设置到高级功能（如受限工具访问和沙盒执行）的所有内容。"
  },
  {
    "id": "44710651",
    "title": "Face it: you're a crazy person",
    "url": "https://www.experimental-history.com/p/face-it-youre-a-crazy-person",
    "summary": "Adam Mastroianni's article \"Face it: You're a Crazy Person\" argues that choosing a fulfilling career requires unpacking the realities of a job and matching it with one's unique \"craziness\" - the traits that make someone an outlier. He introduces the \"Coffee Beans Procedure\" as a method for unpacking, forcing people to consider the mundane details of a job (like sourcing coffee beans) to determine if it aligns with their interests.\n\nThe article highlights that successful individuals often possess a level of dedication bordering on obsession, making them uniquely suited for their chosen path. Examples include Mr. Beast's outlandish YouTube stunts and Tracy Wolff's prolific writing output. Mastroianni contends that high-status professions often conceal their downsides, appealing to a select few who can tolerate them.\n\nMost people struggle to unpack their assumptions, and often overestimate how normal their preferences are, which the author identifies as the \"false consensus effect\". This leads to choosing careers that don't fit, like administrators who dislike students or dermatologists who hate treating acne.\n\nThe author encourages readers to embrace their \"craziness\" by understanding the specific tasks involved in a job and matching them with their own unique interests and abilities. By asking detailed questions and unpacking both the job and oneself, individuals can find careers that harness their unusual traits and lead to success. Ultimately, the article suggests that acknowledging and embracing one's individual \"craziness\" is essential for finding a fulfilling and suitable career path.\n",
    "chinese_title": "面对现实吧：你就是个疯子。",
    "chinese_summary": "亚当·马斯特罗亚尼的文章《面对现实：你是个疯子》认为，选择一份令人满足的职业需要拆解工作的真实情况，并将其与个人独特的“疯狂”——使某人成为异类的特质——相匹配。他介绍了“咖啡豆程序”作为一种拆解方法，迫使人们考虑工作的平凡细节（如采购咖啡豆），以确定其是否符合他们的兴趣。\n\n文章强调，成功人士通常拥有近乎痴迷的奉献精神，这使他们特别适合他们选择的道路。例如，Mr. Beast 异想天开的 YouTube 特技和 Tracy Wolff 多产的写作。马斯特罗亚尼认为，高地位的职业往往隐藏着它们的缺点，只对少数能够容忍这些缺点的人具有吸引力。\n\n大多数人难以拆解他们的假设，并且经常高估他们的偏好有多么正常，作者将其称为“虚假同感偏差”。这导致他们选择不适合自己的职业，比如不喜欢学生的行政人员或讨厌治疗痤疮的皮肤科医生。\n\n作者鼓励读者通过了解工作中涉及的具体任务，并将它们与自己独特的兴趣和能力相匹配来拥抱他们的“疯狂”。通过提出详细的问题并拆解工作和自己，个人可以找到能够利用他们不寻常的特质并带来成功的职业。最终，文章表明，承认和拥抱个人的“疯狂”对于找到令人满足和合适的职业道路至关重要。"
  },
  {
    "id": "44757708",
    "title": "European Censorship Accelerates",
    "url": "https://www.racket.news/p/report-european-censorship-accelerates",
    "summary": "Matt Taibbi's \"Report: European Censorship Accelerates\" on Racket News details concerns that the European Commission's Digital Services Act (DSA) will lead to censorship affecting not only Europeans, but also Americans. A House Judiciary Committee report, led by Jim Jordan, investigated the DSA after a controversial incident involving a letter from European Commissioner Thierry Breton to Elon Musk regarding a planned Trump interview on X. Breton expressed concern about \"illegal content\" being accessible to EU users, even though the interview was to occur in America.\n\nThe article focuses on a \"DSA MultiStakeholder Workshop\" where major platforms were instructed on their DSA obligations. Disturbingly, participants were asked to develop intervention plans for content that wasn't even \"illegal\" under EU standards. The article emphasizes that European authorities expect platforms to modify their \"global\" policies, meaning EU censorship could impact what Americans can say and see online.\n\nThe report highlights the EU's expansive definition of \"illegal content\" and its intent to censor humor, satire, innocuous political opinions, and memes that \"may\" spread \"discriminatory ideologies.\" In contrast to Trump's policies that focused on removing subsidies for ideologically charged speech and using immigration laws against dissenting views, the EU is actively subsidizing ideologically charged speech while seeking to eliminate criticism of its immigration policies. The EU is therefore going further than Trump's policies to control speech.\n",
    "chinese_title": "欧洲审查加速",
    "chinese_summary": "马特·泰比在Racket News上发表的“报道：欧洲审查加速”详细阐述了对欧盟委员会《数字服务法案》(DSA)的担忧，该法案不仅会影响欧洲人，还会影响美国人。在一封欧洲专员蒂埃里·布雷顿就X平台上计划进行的特朗普采访致埃隆·马斯克的信件引发争议后，由吉姆·乔丹领导的众议院司法委员会报告对DSA进行了调查。布雷顿表达了对欧盟用户可以访问“非法内容”的担忧，即使该采访发生在美国。\n\n文章重点关注了一个“DSA多方利益相关者研讨会”，主要平台在会上被告知其DSA义务。令人不安的是，参与者被要求制定干预计划，针对的内容甚至在欧盟标准下都不是“非法的”。文章强调，欧洲当局希望平台修改其“全球”政策，这意味着欧盟的审查制度可能会影响美国人在网上可以说什么和看到什么。\n\n该报告强调了欧盟对“非法内容”的广泛定义，以及审查幽默、讽刺、无害的政治观点以及“可能”传播“歧视性意识形态”的表情包的意图。与特朗普专注于取消意识形态色彩浓厚的言论补贴以及利用移民法打击异见的政策相比，欧盟正在积极补贴意识形态色彩浓厚的言论，同时试图消除对其移民政策的批评。因此，欧盟在控制言论方面走得比特朗普的政策更远。"
  },
  {
    "id": "44739315",
    "title": "The Math Is Haunted",
    "url": "https://overreacted.io/the-math-is-haunted/",
    "summary": "This article introduces Lean, a programming language primarily used by mathematicians to formalize mathematics. Lean allows mathematicians to treat math as code, enabling them to create structured, verifiable, and composable theorems and proofs.\n\nThe author uses a simple example, proving 2 = 2, to illustrate Lean's syntax and core concepts. The `sorry` tactic allows for incomplete proofs, similar to `any` in TypeScript. The `rfl` tactic proves equalities by reflexivity (x = x), and `exact` allows referencing previously proven theorems. These tactics form the basis of Lean proofs.\n\nThe article then explores the concept of \"haunted mathematics\" by introducing an axiom that 2 = 3. This demonstrates that Lean verifies logical conclusions based on chosen axioms, even if those axioms are false. By using this axiom, the author \"proves\" that 2 + 2 = 6, highlighting the importance of sound axioms in mathematical proofs. The article relates this to historical anxieties caused by contradictions found in early set theory.\n\nThe author concludes by briefly mentioning the ongoing effort to formalize Fermat's Last Theorem in Lean and recommends resources for learning Lean, including the Natural Numbers Game, Mathematics in Lean, Tao's Analysis with its Lean companion, and the Lean Zulip community. The goal is to encourage exploration of Lean, highlighting its potential to provide sound and verifiable mathematical proofs.\n",
    "chinese_title": "数学闹鬼了",
    "chinese_summary": "本文介绍了 Lean，一种主要由数学家用于形式化数学的编程语言。Lean 允许数学家将数学视为代码，使他们能够创建结构化、可验证和可组合的定理和证明。\n\n作者使用一个简单的例子，证明 2 = 2，来说明 Lean 的语法和核心概念。`sorry` 策略允许不完整的证明，类似于 TypeScript 中的 `any`。`rfl` 策略通过自反性（x = x）证明等式，而 `exact` 允许引用先前证明的定理。这些策略构成了 Lean 证明的基础。\n\n文章随后通过引入公理 2 = 3，探索了“闹鬼的数学”这一概念。这表明 Lean 验证基于所选公理的逻辑结论，即使这些公理是错误的。通过使用这个公理，作者“证明”了 2 + 2 = 6，突出了健全公理在数学证明中的重要性。文章将此与早期集合论中发现的矛盾所引起的历史焦虑联系起来。\n\n作者最后简要提到了用 Lean 形式化费马大定理的持续努力，并推荐了学习 Lean 的资源，包括 Natural Numbers Game、Mathematics in Lean、陶哲轩的 Analysis 及其 Lean 配套资源，以及 Lean Zulip 社区。目的是鼓励探索 Lean，突出其提供健全且可验证的数学证明的潜力。"
  },
  {
    "id": "44750563",
    "title": "“No tax on tips” is an industry plant",
    "url": "https://www.newyorker.com/magazine/2025/08/04/no-tax-on-tips-is-an-industry-plant",
    "summary": "This article investigates the deceptive tactics employed by the restaurant industry, particularly the Arizona Restaurant Association (ARA), to suppress wage increases for tipped workers. The ARA, disguising its agenda with initiatives like the \"Tipped Workers Protection Act,\" aims to pay tipped employees less than the state minimum wage, undermining efforts like the \"One Fair Wage Act\" which seeks to raise the minimum wage to $18 for all, including tipped workers.\n\nThe article highlights a hearing where individuals in \"Save Our Tips\" T-shirts, seemingly supporting the industry's agenda, were revealed to be associated with the ARA and restaurant management, not entry-level servers. This demonstrates the manipulation used to portray worker support for lower wages.\n\nThe piece also examines Donald Trump's proposal to eliminate taxes on tips, which, while seemingly beneficial to tipped workers, disproportionately favors high-earning individuals in the industry while doing little for those in poverty. Furthermore, it explores the challenges faced by advocates pushing for a fair minimum wage for tipped workers, citing the powerful influence of the National Restaurant Association (NRA) and the resistance from some lawmakers. Saru Jayaraman, a prominent advocate, argues that the practice of relying on tips as a substitute for wages is rooted in historical injustices and perpetuates inequality, particularly affecting women and minorities. Ultimately, the article reveals a complex web of political maneuvering, corporate lobbying, and historical legacies that contribute to the exploitation of tipped workers in the United States.\n",
    "chinese_title": "小费免税是行业阴谋",
    "chinese_summary": "本文调查了餐饮业，特别是亚利桑那州餐馆协会（ARA），为压制小费员工工资增长而采取的欺骗手段。ARA以“小费工人保护法”等倡议伪装其意图，旨在向小费员工支付低于州最低工资的报酬，从而破坏了旨在将所有员工（包括小费员工）的最低工资提高到18美元的“公平工资法”等努力。\n\n文章重点介绍了一次听证会，会上，身穿“拯救我们的小费”T恤的人们，表面上支持该行业的议程，但实际上被揭示与ARA和餐馆管理层有关，而不是初级服务员。这表明了利用操控手段来描绘工人支持低工资的假象。\n\n文章还考察了唐纳德·特朗普提出的取消小费税的提案。该提案表面上对小费员工有利，但实际上不成比例地有利于行业内的高收入人群，而对贫困人群的帮助却微乎其微。此外，文章还探讨了倡导者为小费员工争取公平最低工资所面临的挑战，并列举了全国餐馆协会（NRA）的强大影响力以及来自某些立法者的阻力。著名倡导者萨鲁·贾亚拉曼认为，依靠小费代替工资的做法源于历史不公正，并使不平等现象永久存在，尤其影响到妇女和少数族裔。最终，本文揭示了一个由政治操纵、公司游说和历史遗留问题构成的复杂网络，这些因素共同导致了美国小费员工的剥削。"
  },
  {
    "id": "44745820",
    "title": "Show HN: AgentMail – Email infra for AI agents",
    "url": "https://chat.agentmail.to/",
    "summary": "AgentMail is presented as email infrastructure specifically designed for AI agents. The \"Show HN\" title indicates it's a launch or presentation of the project to the Hacker News community. The core message is that AgentMail simplifies and enables email communication capabilities for AI agents. The primary call to action is \"Create your first inbox to get started,\" which suggests the service allows users to quickly and easily set up email inboxes directly integrated with their AI agents. This highlights ease of use and quick setup as key features. A \"Chat Demo\" is also offered, implying users can interact with an AI agent via email through the platform. In essence, AgentMail is positioning itself as a platform that removes the complexity of email integration for AI agents, allowing developers to focus on the AI logic rather than email infrastructure management. It offers a simple, quick-to-start email system designed for AI interactions.\n",
    "chinese_title": "展示HN：AgentMail - AI 代理的邮件基础设施",
    "chinese_summary": "AgentMail：专为AI Agent设计的邮件基础设施。“Show HN”标题表明这是向Hacker News社区发布或展示该项目。核心信息是AgentMail简化并实现了AI Agent的邮件通信能力。主要行动号召是“创建您的第一个收件箱以开始使用”，这表明该服务允许用户快速轻松地设置与他们的AI Agent直接集成的电子邮件收件箱。这突出了易用性和快速设置作为关键特性。还提供了一个“聊天演示”，暗示用户可以通过该平台通过电子邮件与AI Agent进行交互。本质上，AgentMail的定位是一个消除了AI Agent邮件集成复杂性的平台，使开发人员能够专注于AI逻辑而不是邮件基础设施管理。它提供了一个简单、快速启动的电子邮件系统，专为AI交互而设计。"
  },
  {
    "id": "44739494",
    "title": "150 years of Hans Christian Andersen",
    "url": "https://www.newstatesman.com/culture/books/book-of-the-day/2025/07/150-years-of-the-bizarre-hans-christian-andersen",
    "summary": "This article commemorates the 150th anniversary of Hans Christian Andersen's death, exploring his life and literary contributions beyond just children's fairy tales. It highlights Andersen's early life marked by poverty, social awkwardness, and perceived ugliness, shaping him into an outsider who channeled his experiences into his writing.\n\nThe article emphasizes Andersen's autobiographical elements within his fairy tales, citing \"The Ugly Duckling\" as a prime example. It recounts anecdotes of Andersen's physical appearance and social interactions, which were often ridiculed and led to comparisons to Charles Dickens' character Uriah Heep.\n\nDespite facing hardship and initial rejections, Andersen's talent was recognized, leading to formal education and early success with poetry, plays, and novels before he became renowned for his fairy tales. While lauded for his storytelling, Andersen resented being labeled solely as a children's writer, believing his tales were for the child within everyone. The article underscores Andersen's gift for capturing and retaining stories, embedding them with profound meaning and transforming them into timeless narratives. It presents Andersen not as a mere \"ugly duckling\" turned \"swan,\" but as a unique artistic force whose power is still felt today.\n",
    "chinese_title": "汉斯·克里斯蒂安·安徒生诞辰150周年",
    "chinese_summary": "本文纪念汉斯·克里斯蒂安·安徒生逝世150周年，探讨其超越儿童童话的生活和文学贡献。文章着重介绍了安徒生早期贫困、不善社交和自认丑陋的生活，这些经历塑造了他作为局外人的身份，并将之融入了他的创作中。\n\n文章强调了安徒生童话中自传性元素，并以《丑小鸭》为例。文章叙述了关于安徒生外貌和社交互动的轶事，这些经历常常被嘲笑，并导致人们将其与查尔斯·狄更斯笔下的尤赖亚·希普相提并论。\n\n尽管面临困境和最初的拒绝，安徒生的才华最终得到了认可，使他接受了正规教育，并在创作童话之前，凭借诗歌、戏剧和小说获得了早期的成功。虽然安徒生因其讲故事的能力而备受赞誉，但他厌恶被仅仅贴上儿童文学作家的标签，他认为自己的故事是为每个人心中的孩子而创作的。文章强调了安徒生捕捉和保留故事的天赋，并将深刻的意义融入其中，使之转化为永恒的叙事。文章将安徒生展现为一个独特的艺术力量，而非仅仅是一个“丑小鸭”变成“天鹅”的故事，他的力量至今仍能感受到。"
  },
  {
    "id": "44757247",
    "title": "OpenAI raises $8.3B at $300B valuation",
    "url": "https://www.nytimes.com/2025/08/01/business/dealbook/openai-ai-mega-funding-deal.html",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "OpenAI以3000亿美元估值融资83亿美元",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "44745984",
    "title": "Carbon Language: An experimental successor to C++",
    "url": "https://docs.carbon-lang.dev/",
    "summary": "Carbon Language is an experimental successor to C++ designed to address the limitations of C++ while leveraging its existing ecosystem. It aims to achieve performance matching C++, seamless interoperability with existing C++ codebases, a gentle learning curve for C++ developers, and scalable migration options. Unlike other modern languages, Carbon prioritizes these aspects to facilitate adoption.\n\nKey goals include performance-critical software support, language evolution, code readability, practical safety mechanisms, fast development, and interoperability with C++. Carbon is designed around modern features like a generics system and modular code organization. Notably, it will not have a stable ABI or perfect backward/forward compatibility.\n\nThe project is under heavy development, focusing on building a toolchain with a compiler and linker. A key area is achieving Carbon ↔ C++ interop. Experimental nightly releases of the toolchain are available for Ubuntu-like systems.\n\nCarbon offers features like definition-checked generics that surpass C++ templates in error detection and compilation cost, plus it provides opt-in templates for interop. Safety is addressed with better tracking of uninitialized states, dynamic bounds checks, and a safer debug build mode, with a long-term goal of a memory-safe subset.\n\nThe Carbon project welcomes contributions. Most design discussions occur on Discord. Interested developers can contribute to language design, implementation, or project infrastructure.\n",
    "chinese_title": "Carbon语言：C++的实验性后继者",
    "chinese_summary": "Carbon语言是一种实验性的C++继任者，旨在解决C++的局限性，同时利用其现有生态系统。它致力于实现与C++相匹配的性能、与现有C++代码库的无缝互操作性、C++开发人员的平缓学习曲线以及可扩展的迁移选项。与其他现代语言不同，Carbon优先考虑这些方面以促进采纳。\n\n关键目标包括性能关键型软件支持、语言演进、代码可读性、实用安全机制、快速开发以及与C++的互操作性。Carbon围绕诸如泛型系统和模块化代码组织等现代特性进行设计。值得注意的是，它不会具有稳定的ABI或完美的前后向兼容性。\n\n该项目正在积极开发中，重点是构建具有编译器和链接器的工具链。一个关键领域是实现Carbon ↔ C++ 互操作。工具链的实验性夜间构建版本适用于类似Ubuntu的系统。\n\nCarbon提供了诸如定义检查的泛型等特性，这些特性在错误检测和编译成本方面超越了C++模板，并且它还为互操作性提供了选择性模板。安全性通过更好地跟踪未初始化状态、动态边界检查以及更安全的调试构建模式来解决，长期目标是实现内存安全的子集。\n\nCarbon项目欢迎贡献。大多数设计讨论都在Discord上进行。感兴趣的开发人员可以为语言设计、实现或项目基础设施做出贡献。"
  },
  {
    "id": "44757494",
    "title": "Facebook bought a VPN app for $120M and spied on 33M+ users' phones for years",
    "url": "https://twitter.com/itsalexvacca/status/1950927585845948600",
    "summary": "This article, titled \"Facebook bought a VPN app for $120M and spied on 33M+ users' phones for years,\" discusses Facebook's acquisition of a VPN app and its subsequent use for data collection. While the details of the article are unavailable due to JavaScript being disabled and displaying a default error page from X Corp (formerly Twitter), the title provides the crucial information:\n\n*   **Facebook acquired a VPN app for $120 million.** This establishes Facebook's financial investment in the technology and sets the stage for the issue.\n*   **Facebook spied on 33M+ users' phones for years.** This is the core of the article's claim: Facebook used the acquired VPN app as a tool for extensive user surveillance. The number of users (33 million+) and the duration (\"for years\") underscore the scale and timeframe of the alleged privacy violation.\n\nBased solely on the title, the article likely elaborates on how Facebook collected data through the VPN, the type of data collected, the potential privacy implications, and any legal or ethical concerns raised by this practice. It would likely detail the timeline of events and the reactions of users and regulatory bodies to the discovery of this activity. The shift in the content to the X Corp. error page doesn't negate the potential impact of the original headline.\n",
    "chinese_title": "脸书曾以1.2亿美元收购VPN应用，并多年来监视超过3300万用户的手机。",
    "chinese_summary": "脸书曾以1.2亿美元收购VPN应用，并秘密监控3300万+用户手机多年"
  },
  {
    "id": "44722910",
    "title": "Rao Reading Algorithm (2024)",
    "url": "https://raohacker.com/rao-reading-algorithm/",
    "summary": "The \"Rao Reading Algorithm (2024)\" describes the author's highly personalized and expansive approach to reading and learning. Reading is defined broadly as consuming information from various sources, not just books. The goal is to integrate knowledge into a multidisciplinary world model, connect it to personal interests, and find pleasure in the process. The algorithm emphasizes building semantic trees of knowledge, starting with fundamental principles and branching out into details.\n\nKey aspects include:\n\n*   **Building semantic trees:** Focusing on fundamental knowledge (math, physics, humanities) and creating connections between seemingly disparate fields.\n*   **Pareto principle:** Prioritizing key ideas (20/80 rule) within the semantic tree.\n*   **Book vetting:** Carefully selecting books through reviews, recommendations, and primary source investigation.\n*   **Levels of comprehension:** Progressing from initial exposure to active application and revisiting of knowledge.\n*   **Types of reading:** Employing elementary, inspectional, analytical, and syntopical reading methods, with an emphasis on analytical (critical evaluation) and syntopical (connecting themes).\n*   **Creating Virtual People:** Building up intellectual models to act as judges and teachers.\n*   **Practical considerations:** Optimizing reading environment and habits, including reading multiple books concurrently, highlighting, and note-taking.\n*   **Primary Sources:** Emphasizing the importance of going back to primary sources to evaluate knowledge creation.\n\nThe author stresses the personal nature of this algorithm, aiming to inspire readers to reflect on their own reading habits and epistemologies. Ultimately, the algorithm is a lifelong pursuit of continuous learning and knowledge integration.\n",
    "chinese_title": "饶氏阅读算法 (2024)",
    "chinese_summary": "“饶氏阅读算法 (2024)”描述了作者高度个性化且广泛的阅读和学习方法。阅读被广义地定义为从各种来源获取信息，而不仅仅是书籍。其目标是将知识整合到一个多学科的世界模型中，将其与个人兴趣联系起来，并在过程中找到乐趣。该算法强调构建知识的语义树，从基本原理开始，然后扩展到细节。\n\n主要方面包括：\n\n*   **构建语义树：** 专注于基础知识（数学、物理、人文）并在看似不同的领域之间建立联系。\n*   **帕累托原则：** 在语义树中优先考虑关键思想（20/80 法则）。\n*   **书籍筛选：** 通过评论、推荐和原始来源调查仔细选择书籍。\n*   **理解层次：** 从最初接触到主动应用和知识回顾逐步提升。\n*   **阅读类型：** 采用基础阅读、检视阅读、分析阅读和主题阅读方法，重点是分析阅读（批判性评估）和主题阅读（连接主题）。\n*   **创建虚拟人物：** 建立智力模型来充当评判者和老师。\n*   **实践考量：** 优化阅读环境和习惯，包括同时阅读多本书籍、高亮显示和笔记。\n*   **原始资料：** 强调追溯原始资料以评估知识创造的重要性。\n\n作者强调该算法的个人性质，旨在启发读者反思自己的阅读习惯和认识论。最终，该算法是对持续学习和知识整合的终身追求。"
  },
  {
    "id": "44744454",
    "title": "How was the Universal Pictures 1936 opening logo created?",
    "url": "https://movies.stackexchange.com/questions/128020/how-was-the-universal-pictures-1936-opening-logo-created",
    "summary": "This article explores the creation of the iconic Universal Pictures 1936 opening logo, known for its complex moving parts, transparency, and reflections. The inquirer found little information online about its production and wanted to understand how it was made, considering the technology available at the time.\n\nThe answer reveals that the logo was painstakingly created over half a year using physical models and optical effects, not computer graphics. Art Director Alexander Golitzen embraced Art Deco, using plexiglass and a phosphorescent compound (silver-activated zinc sulfide) for the stars and globe.\n\nThe process involved several steps:\n\n1.  **Spinning Stars:** Independently rotating plexiglass stars were filmed with moving lights and a tight camera aperture to create shimmering light trails.\n2.  **Joining Stars to Globe:** The star footage was projected onto a black globe coated with a diluted phosphorescent material.\n3.  **Company Lettering:** A separate larger, polished globe with the company lettering was manually rotated and filmed at high speed, then triple-printed over the original globe footage. The first pass created the title reflection, the second shot with no lights, and the background was a matte.\n4.  **Final Title Overlay:** A silhouette of the globe was created and used as a matte to overlay the final layer: the actual title.\n\nThe intricate layering of separately filmed elements created the dazzling effect, a testament to the artistry and ingenuity of pre-digital special effects techniques. The globe was later repurposed as the \"Interociter\" in the movie 'This Island Earth' (1955).\n",
    "chinese_title": "环球影业1936年开场标志是如何制作的？",
    "chinese_summary": "本文探讨了1936年环球影业标志性开场logo的创作过程，该logo以其复杂的活动部件、透明度和反射效果而闻名。探究者发现网上关于其制作过程的信息甚少，并希望了解在当时的技术条件下它是如何制作出来的。\n\n答案揭示，该logo历时半年多，通过物理模型和光学效果精心制作而成，而非计算机图形。艺术总监Alexander Golitzen采用了装饰艺术风格，使用有机玻璃和磷光化合物（硫化锌银活化剂）来制作星星和地球。\n\n该过程包括以下几个步骤：\n\n1.  **旋转的星星：** 独立旋转的有机玻璃星星在移动的灯光和紧凑的相机光圈下拍摄，以创造闪烁的光迹。\n2.  **星星与地球的结合：** 星星的素材被投射到一个涂有稀释磷光材料的黑色地球仪上。\n3.  **公司字样：** 一个单独的、更大的、抛光的带有公司字样的地球仪被手动旋转并以高速拍摄，然后三次叠印在原始地球仪素材上。第一次叠印产生标题反射，第二次拍摄时没有灯光，背景是遮片。\n4.  **最终标题叠加：** 创建了地球仪的轮廓，并将其用作遮片来叠加最后一层：实际标题。\n\n通过对单独拍摄的元素进行复杂的图层叠加，创造了令人眼花缭乱的效果，这证明了前数字特效技术的艺术性和独创性。这个地球仪后来在电影《This Island Earth》（1955）中被重新用作“Interociter”。"
  },
  {
    "id": "44752469",
    "title": "Show HN: KubeForge – A GUI for Kubernetes YAMLs",
    "url": "https://github.com/kubenote/KubeForge",
    "summary": "KubeForge is a visual GUI tool designed to simplify the creation, validation, and management of Kubernetes YAML configurations. It aims to reduce the learning curve for Kubernetes, eliminate syntax errors, and help DevOps teams prototype deployments visually. Users can get started quickly by running a Docker container.\n\nKey features include a drag-and-drop interface, smart schema awareness powered by Kubernetes JSON schemas, a modular component editor with support for templates, real-time visual updates and dependency linking, and exportable YAML files. KubeForge stays up-to-date by integrating with a repository that fetches the latest official Kubernetes JSON schemas daily, ensuring accurate field validation and metadata. It also supports direct YAML hosting, allowing referencing configurations from a stable URL. Future features include real-time validation against cluster versions, Helm chart generation, and GitOps-style export templates. The project is open to contributions and feature requests.\n",
    "chinese_title": "Show HN: KubeForge – Kubernetes YAML 的 GUI",
    "chinese_summary": "KubeForge：一款可视化的GUI工具，旨在简化Kubernetes YAML配置的创建、验证和管理。它致力于降低Kubernetes的学习曲线，消除语法错误，并帮助DevOps团队以可视化方式进行部署原型设计。用户可以通过运行Docker容器快速上手。\n\n主要功能包括拖放界面、由Kubernetes JSON模式驱动的智能模式感知、支持模板的模块化组件编辑器、实时可视化更新和依赖关系链接，以及可导出的YAML文件。KubeForge通过与每天获取最新官方Kubernetes JSON模式的存储库集成来保持最新状态，确保准确的字段验证和元数据。它还支持直接YAML托管，允许从稳定的URL引用配置。未来的功能包括针对集群版本的实时验证、Helm Chart生成和GitOps风格的导出模板。该项目对贡献和功能请求持开放态度。"
  },
  {
    "id": "44718211",
    "title": "Zig Profiling on Apple Silicon",
    "url": "https://blog.bugsiki.dev/posts/zig-profilers/",
    "summary": "This article addresses the limited profiling tools available for Zig developers on Apple Silicon Macs compared to Linux. It focuses on CPU time profilers (statistical sampling, hardware event-based sampling, instrumentation). Common Linux tools like `perf` and `valgrind` have limited or no support.\n\nThe article highlights four alternative profiling tools for Apple Silicon:\n\n1.  **Samply:** A sampling profiler using the Mach Interface, offering a feature-rich UI via the Firefox Profiler. It can profile executables or running processes.\n2.  **poop (Performance Optimizer Observation Platform):** A hardware counter-based profiler using Apple's private `kperf` framework.  A specific fork is needed as the main branch lacks macOS support. Requires root privileges and may be unstable due to using a private API.\n3.  **Tracy:** A real-time instrumentation profiler.  Instrumentation features are useful, but callstack sampling is not supported on Apple Silicon. Requires embedding client libraries in your code and modifying the `build.zig` file.\n4.  **Apple Instruments:** A comprehensive but slow tool providing CPU, GPU, and other profiling capabilities. It includes a command-line tool `xctrace`, but it's also very slow.\n\nThe author recommends `samply` for quick performance overviews and `poop` for iterative optimization. While `tracy` is powerful for instrumentation, the lack of callstack sampling limits its usefulness. Apple Instruments is suggested only when other tools are insufficient due to its performance issues.\n",
    "chinese_title": "Apple Silicon 上的 Zig 性能分析",
    "chinese_summary": "在 Apple Silicon Mac 上 Zig 开发者的性能分析工具局限性：Samply, poop, Tracy, 以及 Apple Instruments\n\n本文探讨了与 Linux 相比，Apple Silicon Mac 上可用于 Zig 开发者的有限的性能分析工具。它主要关注 CPU 时间分析器（统计采样、基于硬件事件的采样、代码插桩）。常见的 Linux 工具，如 `perf` 和 `valgrind`，支持有限或不支持。\n\n本文重点介绍了四种适用于 Apple Silicon 的替代性能分析工具：\n\n1.  **Samply:** 一个使用 Mach 接口的采样分析器，通过 Firefox Profiler 提供功能丰富的 UI。它可以分析可执行文件或正在运行的进程。\n2.  **poop (性能优化观察平台):** 一个基于硬件计数器的分析器，使用 Apple 的私有 `kperf` 框架。 需要一个特定的分支，因为主分支缺少 macOS 支持。 需要 root 权限，并且由于使用了私有 API，可能不稳定。\n3.  **Tracy:** 一个实时代码插桩分析器。 代码插桩功能很有用，但 Apple Silicon 上不支持调用堆栈采样。 需要将客户端库嵌入到您的代码中并修改 `build.zig` 文件。\n4.  **Apple Instruments:** 一个全面但速度较慢的工具，提供 CPU、GPU 和其他性能分析功能。 它包括一个命令行工具 `xctrace`，但速度也很慢。\n\n作者建议使用 `samply` 进行快速性能概览，使用 `poop` 进行迭代优化。 虽然 `tracy` 在代码插桩方面功能强大，但缺乏调用堆栈采样限制了其用途。 仅当其他工具因其性能问题而不足时，才建议使用 Apple Instruments。"
  },
  {
    "id": "44716653",
    "title": "OpenAI's ChatGPT Agent casually clicks through \"I am not a robot\" verification",
    "url": "https://arstechnica.com/information-technology/2025/07/openais-chatgpt-agent-casually-clicks-through-i-am-not-a-robot-verification-test/",
    "summary": "OpenAI's new ChatGPT Agent, designed to perform multi-step tasks for users by controlling a web browser, has demonstrated the ability to bypass Cloudflare's \"I am not a robot\" verification, raising questions about the future effectiveness of CAPTCHAs. A Reddit user shared screenshots showing the agent successfully clicking through the verification checkbox and narrating its actions, stating it needed to prove it wasn't a bot.\n\nWhile not a novel feat for AI, the agent's ability highlights the ongoing arms race between CAPTCHA creators and those seeking to defeat them. Cloudflare's Turnstile, which analyzes user behavior, is designed to differentiate between humans and bots. The agent's success signifies sophisticated browser automation.\n\nThe article also touches on the history of CAPTCHAs, their evolution into tools for digitizing books and training AI, and their limitations as a foolproof security measure. CAPTCHAs now primarily serve to slow down bot attacks rather than eliminate them. Despite this achievement, the article also notes that ChatGPT Agent isn't flawless, struggling with complex website interfaces in some cases. Ultimately, the article uses the incident as a showcase of the tool's ability to process visual context and navigate complex processes that often demand human judgment.\n",
    "chinese_title": "OpenAI的ChatGPT智能代理随意通过“我不是机器人”验证",
    "chinese_summary": "OpenAI新型ChatGPT Agent绕过Cloudflare验证，引发CAPTCHA有效性质疑。该Agent通过控制浏览器为用户执行多步骤任务，并成功绕过“我不是机器人”验证。虽然AI攻破验证并非新鲜事，但该Agent的能力凸显了CAPTCHA开发者与破解者之间持续的军备竞赛。Cloudflare的Turnstile旨在通过分析用户行为区分人类和机器人，而该Agent的成功则表明了高级的浏览器自动化。文章还回顾了CAPTCHA的历史，其作为数字化书籍和训练AI工具的演变，以及作为万无一失安全措施的局限性。现在，CAPTCHA主要用于减缓而非消除机器人攻击。尽管如此，ChatGPT Agent并非完美，有时在复杂的网站界面上会遇到困难。最终，文章将此事件展示了该工具处理视觉上下文和导航通常需要人类判断的复杂流程的能力。"
  },
  {
    "id": "44714796",
    "title": "Scientists and engineers craft radio telescope bound for the moon",
    "url": "https://www.bnl.gov/newsroom/news.php?a=122408",
    "summary": "Brookhaven National Laboratory has completed the development phase of LuSEE-Night, a radio telescope designed to operate on the far side of the moon. This ambitious project aims to detect the \"Dark Ages Signal,\" radio waves from the universe's early period before stars and planets existed, which are obscured by radio interference on Earth.\n\nLuSEE-Night faces extreme conditions on the lunar far side: extended periods of darkness and sunlight, drastic temperature swings, and cosmic radiation. A collaboration led by UC Berkeley's Space Sciences Laboratory (SSL) distributed the engineering challenges, with Brookhaven Lab designing and building the core scientific instrument, including a highly sensitive radio spectrometer. This spectrometer can continuously listen to the full radio band of the early universe, a significant improvement over existing instruments.\n\nThe project involved overcoming challenges related to mass, energy consumption, and temperature control. The telescope had to be light enough to launch, self-sufficient on limited power, and able to withstand extreme temperatures. To address these, the design includes a heat pipe, thermal switches, and the ability to manage energy consumption remotely from Earth.\n\nLuSEE-Night is viewed as a pathfinder mission, aiming to prove the feasibility of long-term radio astronomy on the lunar far side and pave the way for future space science endeavors. Final assembly and testing are underway, with a planned launch in 2026 via Firefly Aerospace's Blue Ghost lander. The science team at Brookhaven is preparing operational plans to ensure the telescope is ready for its mission.\n",
    "chinese_title": "科学家和工程师打造奔赴月球的射电望远镜",
    "chinese_summary": "布鲁克海文国家实验室已完成月球暗面探测器LuSEE-Night的开发阶段，这是一架设计在月球背面运行的射电望远镜。这项雄心勃勃的项目旨在探测“黑暗时代信号”，即宇宙早期在恒星和行星存在之前发出的无线电波，这些无线电波在地球上被无线电干扰所掩盖。\n\nLuSEE-Night面临着月球背面极端恶劣的条件：长时间的黑暗和阳光照射、剧烈的温度变化以及宇宙辐射。由加州大学伯克利分校空间科学实验室 (SSL) 领导的合作团队分配了工程挑战，其中布鲁克海文实验室负责设计和建造核心科学仪器，包括一台高度灵敏的射电频谱仪。该频谱仪可以持续监听早期宇宙的整个无线电波段，与现有仪器相比有了显著改进。\n\n该项目涉及克服与质量、能耗和温度控制相关的挑战。望远镜必须足够轻才能发射，能够在有限的电力下自给自足，并且能够承受极端温度。为了解决这些问题，该设计包括热管、热开关以及从地球远程管理能源消耗的能力。\n\nLuSEE-Night被视为一项探路任务，旨在证明在月球背面进行长期射电天文学的可行性，并为未来的空间科学事业铺平道路。最终的组装和测试正在进行中，计划于 2026 年通过萤火虫航空航天公司的蓝色幽灵着陆器发射。布鲁克海文的科学团队正在制定运营计划，以确保望远镜为执行任务做好准备。"
  },
  {
    "id": "44747634",
    "title": "AI is a floor raiser, not a ceiling raiser",
    "url": "https://elroy.bot/blog/2025/07/29/ai-is-a-floor-raiser-not-a-ceiling-raiser.html",
    "summary": "This article argues that AI acts as a \"floor raiser,\" making it easier for individuals to acquire basic skills and knowledge, but doesn't significantly elevate expertise or creativity (\"ceiling raiser\").\n\nThe author explains that pre-AI, learning was hampered by a \"matching problem,\" where resources weren't tailored to individual knowledge gaps or preferred learning styles. AI overcomes this by providing personalized learning and handling rote tasks, accelerating initial skill acquisition.\n\nHowever, experts are skeptical because AI's knowledge is limited by its training data, making it less effective for complex or controversial topics. Furthermore, AI can facilitate \"cheating,\" leading to plateaus at the level AI can provide answers.\n\nThe impact of AI depends on the level of mastery required for a specific task. It significantly benefits individuals like engineering managers who need basic competence in specific frameworks, enabling them to create simple applications. Conversely, its impact is limited in areas requiring deep context, complex problem-solving, or novelty, like large codebases or creative works. Tasks already efficiently handled by specialized apps, such as email and food ordering, also see minimal disruption.\n\nUltimately, the article suggests that AI's impact is unevenly distributed. While some experience a significant shift in their relationship with technology, others find it less useful or even threatening. The author concludes that AI is a powerful tool, but its utility varies depending on individual needs and circumstances.\n",
    "chinese_title": "AI是抬高下限，而非抬高上限。",
    "chinese_summary": "人工智能：抬高下限，难提上限"
  },
  {
    "id": "44758731",
    "title": "How to build a ship for interstellar travel",
    "url": "https://www.economist.com/science-and-technology/2025/07/31/how-to-build-a-ship-for-interstellar-travel",
    "summary": "This article discusses a competition focused on designing ships for interstellar travel and planetary colonization. The winning designs are described as unconventional, resembling a giant pen, conjoined Ferris wheels, and a jellyfish. The designs are part of what is described as a serious, or at least semi-serious, effort to envision interstellar travel and settlement on exoplanets. The article also briefly touches upon other science and technology topics, including AI models in China, efforts to sequence all animals, fungi, and plants on Earth, collagen supplements, chip-export controls, immune responses to infections, allergy treatments, and the labs that maintain and build America's nuclear weapons.\n",
    "chinese_title": "如何建造星际旅行飞船",
    "chinese_summary": "设计星际旅行及行星殖民飞船竞赛，获奖设计奇特，形似巨型笔、连体摩天轮、水母。这些设计旨在认真（或至少半认真地）设想星际旅行和外星殖民。文章还简要提及其他科技话题，包括中国AI模型、地球动植物真菌测序计划、胶原蛋白补充剂、芯片出口管制、感染免疫反应、过敏治疗，以及维护和制造美国核武器的实验室。"
  },
  {
    "id": "44721378",
    "title": "The Longest Sightline on Earth",
    "url": "https://calgaryvisioncentre.com/news/2017/6/23/tdgft1bsbdlm8496ov7tn73kr0ci1q",
    "summary": "This article explores the concept of sightlines and what factors influence how far we can see on Earth. It begins with the basic idea that the horizon, determined by the Earth's curvature, limits sight distance, estimating it to be around 4.7 km on flat ground. The article then discusses how increasing the observer's height, such as by standing atop a skyscraper, significantly extends the visible distance.\n\nHowever, the true potential for long sightlines relies on two additional elements: the target's height and air temperature. Taller targets can be seen from further away as they \"peak\" above the horizon. Refraction, caused by temperature gradients in the air, bends light and further extends visibility. Cooler air near the ground and warmer air above it bend light downwards, allowing us to see farther.\n\nBy considering all these factors, researchers determined that the theoretical longest sightline on Earth is 538 km from Mt. Dankova in Kyrgyzstan to Hindu Tagh in China. The longest photographed sightline is 443 km, from Pic de Finestrelles in the Spanish Pyrenees to Pic Gaspard in the French Alps.\n\nThe article concludes by explaining how visual acuity affects sightlines, emphasizing that an object's size and distance determines its visibility. As a promotional piece, the author encourages readers to book an eye exam at Calgary Vision Centre.\n",
    "chinese_title": "地球上最长的视线",
    "chinese_summary": "本文探讨了视线范围的概念以及影响我们在地球上视距的因素。文章从地球曲率决定地平线限制视距这一基本概念入手，估计在平地上视距约为4.7公里。文章接着讨论了增加观测者的高度，例如站在摩天大楼上，如何显著延长可见距离。\n\n然而，实现远距离视线潜力的关键还在于两个额外的因素：目标的高度和空气温度。较高的目标可以从更远的地方看到，因为它们会“越过”地平线。由空气中的温度梯度引起的光线折射会弯曲光线，从而进一步扩大能见度。近地面较冷的空气和上方较暖的空气会向下弯曲光线，使我们看得更远。\n\n通过考虑所有这些因素，研究人员确定地球上理论上最长的视线范围是从吉尔吉斯斯坦的丹科娃山到中国的新疆康西瓦地区的兴都塔格山，距离为538公里。而拍摄到的最长视线距离为443公里，从西班牙比利牛斯山脉的菲内斯特雷斯峰到法国阿尔卑斯山脉的加斯帕德峰。\n\n文章最后解释了视力敏锐度如何影响视线范围，强调物体的尺寸和距离决定了其可见性。作为一篇宣传文章，作者鼓励读者在卡尔加里视力中心预约眼科检查。"
  },
  {
    "id": "44745539",
    "title": "What is gVisor?",
    "url": "https://blog.yelinaung.com/posts/gvisor/",
    "summary": "This article explains gVisor, a security-focused container runtime that enhances isolation compared to standard Docker containers. Standard containers share the host OS kernel, creating potential security risks like the runc vulnerability. gVisor addresses this by acting as an intermediary \"application kernel\" or \"user-space kernel\" between the container and the host kernel.\n\nWhen a container makes a system call (e.g., opening a file), gVisor intercepts it via its component, \"Sentry\", and handles it within a sandboxed environment, instead of the host kernel directly. While gVisor still needs to interact with the host kernel for certain operations, it does so in a controlled and limited way, minimizing the attack surface.\n\ngVisor's benefits include reduced host kernel exposure, a smaller auditable attack surface (written in memory-safe Go), and strong isolation. Even if an attacker escapes the application within gVisor, they are still within the Sentry, making further escape to the host more difficult.\n\nThe main trade-off is performance overhead due to system call interception and user-space processing. This can impact I/O-intensive applications. The article demonstrates gVisor in action, showing how processes within a gVisor container are not visible on the host OS. Debug logs further illustrate the Sentry's role in intercepting and processing system calls.\n\nFinally, the article mentions real-world use cases: Google CloudRun (originally), Google Kubernetes Engine (GKE) Sandbox, and Fly.io's consideration of gVisor. In conclusion, gVisor can be a valuable layer for multi-tenant container systems, especially when security is paramount, but the potential performance impact should be considered.\n",
    "chinese_title": "什么是gVisor？",
    "chinese_summary": "本文介绍了gVisor，一种以安全为中心的容器运行时，相比标准Docker容器，它增强了隔离性。标准容器共享宿主机操作系统内核，存在潜在的安全风险，例如runc漏洞。gVisor通过充当容器和宿主机内核之间的中间“应用程序内核”或“用户空间内核”来解决这个问题。\n\n当容器发出系统调用（例如，打开文件）时，gVisor通过其组件“Sentry”拦截该调用，并在一个沙箱环境中处理它，而不是直接在宿主机内核中处理。虽然gVisor仍然需要与宿主机内核进行交互以执行某些操作，但它以一种受控和有限的方式进行，从而最大限度地减少攻击面。\n\ngVisor的优势包括减少宿主机内核暴露、更小的可审计攻击面（用内存安全的Go语言编写）以及强大的隔离性。即使攻击者逃脱了gVisor内的应用程序，他们仍然在Sentry中，这使得进一步逃逸到宿主机更加困难。\n\n主要的权衡是由于系统调用拦截和用户空间处理而产生的性能开销。这可能会影响I/O密集型应用程序。本文演示了gVisor的实际应用，展示了gVisor容器中的进程在宿主机操作系统上是不可见的。调试日志进一步说明了Sentry在拦截和处理系统调用方面的作用。\n\n最后，本文提到了实际用例：Google CloudRun（最初）、Google Kubernetes Engine（GKE）Sandbox 以及 Fly.io 对 gVisor 的考虑。总而言之，gVisor可以成为多租户容器系统的一个有价值的层，尤其是在安全性至关重要时，但应考虑潜在的性能影响。"
  },
  {
    "id": "44719860",
    "title": "Telephone colophon: Or, how I overengineered my call audio (2020)",
    "url": "https://noahliebman.net/2020/12/telephone-colophon-or-how-i-overengineered-my-call-audio/",
    "summary": "This article details a complex audio setup for Zoom calls, designed for musicians or anyone desiring granular control over their audio. The author sought to use an external microphone (Shure SM57) and potentially other inputs like a guitar pickup, while monitoring the mix through headphones and hearing the other participants.\n\nThe core of the solution involves using BlackHole, a virtual audio driver, to route audio between different devices. Two instances of BlackHole are used (16-channel and 2-channel) due to Zoom's limitation of using only the first two channels of any audio interface. The author creates an aggregate audio device in macOS's Audio MIDI Setup, combining the USB audio interface (Behringer UMC202HD) and the two BlackHole instances.\n\nThe DAW, Reaper, becomes the central hub for audio routing and mixing. Inputs from the USB interface are routed to individual tracks in Reaper, allowing for effects like noise reduction and compression. The master output of Reaper is then sent both to the headphones (via the USB interface) and to BlackHole 2ch, which Zoom uses as its microphone.\n\nTo hear the Zoom call participants, audio from BlackHole 16ch (Zoom's speaker output) is routed to a dedicated track in Reaper and then sent directly to the headphones, bypassing the master output to prevent feedback. Zoom settings are adjusted to disable automatic gain control and enable \"original sound\" for the highest audio quality.\n\nFinally, the article details how to share system sound by routing it through BlackHole 16ch channels 3 and 4, enabling it to be mixed into the Zoom call through a separate Reaper track. The author notes that this setup can also be achieved with Rogue Amoeba's Loopback, which provides a more user-friendly interface.\n",
    "chinese_title": "电话尾注：或，我是如何过度设计我的通话音频的 (2020)",
    "chinese_summary": "本文详细介绍了一个复杂的 Zoom 通话音频设置，专为音乐家或任何希望精细控制其音频的人士设计。作者试图使用外部麦克风 (Shure SM57) 以及潜在的其他输入，例如吉他拾音器，同时通过耳机监听混音并听到其他参与者。\n\n该解决方案的核心在于使用 BlackHole（一种虚拟音频驱动程序）在不同设备之间路由音频。由于 Zoom 只能使用任何音频接口的前两个通道，因此使用了两个 BlackHole 实例（16 通道和 2 通道）。作者在 macOS 的音频 MIDI 设置中创建了一个聚合音频设备，将 USB 音频接口 (Behringer UMC202HD) 和两个 BlackHole 实例组合在一起。\n\nDAW Reaper 成为音频路由和混音的中心枢纽。来自 USB 接口的输入被路由到 Reaper 中的各个轨道，从而可以应用噪声抑制和压缩等效果。Reaper 的主输出随后被发送到耳机（通过 USB 接口）和 BlackHole 2ch，Zoom 将其用作麦克风。\n\n为了听到 Zoom 通话参与者的声音，来自 BlackHole 16ch（Zoom 的扬声器输出）的音频被路由到 Reaper 中的专用轨道，然后直接发送到耳机，绕过主输出以防止反馈。调整 Zoom 设置以禁用自动增益控制并启用“原始声音”，以获得最高的音频质量。\n\n最后，本文详细介绍了如何通过 BlackHole 16ch 的通道 3 和 4 路由系统声音来共享系统声音，从而能够通过单独的 Reaper 轨道将其混合到 Zoom 通话中。作者指出，此设置也可以使用 Rogue Amoeba 的 Loopback 实现，后者提供了更友好的用户界面。"
  },
  {
    "id": "44736967",
    "title": "Fast",
    "url": "https://www.catherinejue.com/fast",
    "summary": "Catherine Jue's \"Fast\" argues that speed in software is a crucial, often overlooked factor that fundamentally alters user behavior and unlocks new possibilities. While users rarely explicitly request \"fast,\" its impact is profound. Faster software encourages more frequent code deployments, enables real-time collaboration, and eliminates cognitive friction, creating a \"magical\" user experience. Examples include Raycast's instant application surfacing and Superhuman's sub-100ms email.\n\nThe author highlights that speed signals simplicity, forcing a focus on essential features and exposing performance bottlenecks, leading to more disciplined and focused product development. Streamlined tools like Linear are contrasted with bloated enterprise software to illustrate this point. Achieving speed often requires complex behind-the-scenes engineering to simplify the user's experience, as exemplified by Cash App's careful user journey design and Instagram's optimistic photo uploads.\n\nWhile acknowledging the current focus on capabilities in AI-augmented workflows, Jue points out the performance lag compared to traditional software. She argues that as the initial novelty fades, optimization for low latency, interface design, and reliability will become paramount. This shift will unlock unforeseen use cases and further empower users, shaping how we live and work. Ultimately, fast software isn't just a technical achievement; it's a signal of prioritization, focus, and respect for the user's time, leading to experiences that feel like superpowers.\n",
    "chinese_title": "快",
    "chinese_summary": "Catherine Jue的《快》认为，软件速度是一个至关重要且经常被忽视的因素，它从根本上改变用户行为并开启新的可能性。 虽然用户很少明确要求“快”，但其影响深远。 更快的软件鼓励更频繁的代码部署，实现实时协作，并消除认知摩擦，创造出“神奇”的用户体验。 例子包括Raycast的即时应用程序呈现和Superhuman的亚100毫秒电子邮件。\n\n作者强调，速度代表着简洁，迫使人们专注于基本功能并暴露性能瓶颈，从而促成更严谨和专注的产品开发。 精简的工具（如Linear）与臃肿的企业软件形成对比，以说明这一点。 实现速度通常需要复杂的幕后工程来简化用户体验，正如Cash App精心设计的用户旅程和Instagram乐观的照片上传所体现的那样。\n\n虽然承认目前人工智能增强型工作流程侧重于功能，但Jue指出与传统软件相比，性能存在滞后。 她认为，随着最初的新鲜感消退，低延迟、界面设计和可靠性的优化将变得至关重要。 这种转变将开启意想不到的用例，并进一步赋能用户，从而塑造我们的生活和工作方式。 最终，快速的软件不仅仅是一项技术成就，它还是优先级、专注和尊重用户时间的信号，从而带来感觉像超能力般的体验。"
  },
  {
    "id": "44757262",
    "title": "IRS head says free Direct File tax service is 'gone'",
    "url": "https://www.theverge.com/news/717308/irs-direct-file-gone-billy-long-trump-administration",
    "summary": "The IRS's free Direct File tax service, launched in 2023, is reportedly being eliminated due to a provision in President Donald Trump's \"Big Beautiful Bill,\" which establishes a task force to replace it. IRS Commissioner Billy Long stated the program is \"gone,\" prioritizing \"direct audit\" instead.\n\nDirect File allowed taxpayers to submit returns directly to the government for free, and had been in testing with plans to expand. The potential elimination follows months of uncertainty and suggestions that Department of Government Efficiency (DOGE) federal cuts could doom the program.\n\nLawmakers like Senator Elizabeth Warren have criticized the decision, accusing the Trump administration of favoring tax preparation companies like TurboTax. The IRS acknowledged Treasury will be issuing a report to Congress regarding Direct File and potential public-private partnerships as alternatives, as required by the \"One Big Beautiful Bill\".\n",
    "chinese_title": "美国国税局负责人称免费报税系统“已成历史”",
    "chinese_summary": "据报道，美国国税局于2023年推出的免费直接报税服务（Direct File）将被取消，原因是唐纳德·特朗普总统的“宏伟法案”中的一项条款，该条款设立了一个特别工作组来取代该服务。美国国税局局长比利·朗表示，该项目已经“结束”，并将优先考虑“直接审计”。\n\nDirect File允许纳税人直接向政府免费提交报税表，并且一直在测试中，计划扩大规模。此潜在取消是在数月的不确定性和政府效率部（DOGE）联邦削减可能使该项目失败的说法之后发生的。\n\n像参议员伊丽莎白·沃伦这样的立法者批评了这一决定，指责特朗普政府偏袒像TurboTax这样的税务筹备公司。美国国税局承认，财政部将按照“一项宏伟法案”的要求，向国会提交一份关于Direct File以及潜在的公私合作替代方案的报告。"
  },
  {
    "id": "44733341",
    "title": "Problem solving using Markov chains (2007) [pdf]",
    "url": "http://math.uchicago.edu/~shmuel/Network-course-readings/Markov_chain_tricks.pdf",
    "summary": "生成摘要时出错",
    "chinese_title": "Problem solving using Markov chains (2007) [pdf]",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44745347",
    "title": "Dark patterns",
    "url": "https://www.nsw.gov.au/departments-and-agencies/fair-trading/dark-patterns",
    "summary": "生成摘要时出错",
    "chinese_title": "Dark patterns",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44756910",
    "title": "OpenAI Open Source Model Leaked on HF",
    "url": "https://old.reddit.com/r/LocalLLaMA/comments/1mepz8z/openai_os_model_info_leaked_120b_20b_will_be/",
    "summary": "生成摘要时出错",
    "chinese_title": "OpenAI Open Source Model Leaked on HF",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44697689",
    "title": "We revamped our docs for AI-driven development",
    "url": "https://docs.freestyle.sh/blog/docs-revamp",
    "summary": "生成摘要时出错",
    "chinese_title": "We revamped our docs for AI-driven development",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44749772",
    "title": "Denver rent is back to 2022 prices after 20k new units hit the market",
    "url": "https://denverite.com/2025/07/25/denver-rent-prices-drop-q2/",
    "summary": "生成摘要时出错",
    "chinese_title": "Denver rent is back to 2022 prices after 20k new units hit the market",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44752546",
    "title": "LLM leaderboard – Comparing models from OpenAI, Google, DeepSeek and others",
    "url": "https://artificialanalysis.ai/leaderboards/models",
    "summary": "生成摘要时出错",
    "chinese_title": "LLM leaderboard – Comparing models from OpenAI, Google, DeepSeek and others",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44734891",
    "title": "Show HN: Sourcebot – Self-hosted Perplexity for your codebase",
    "url": "https://github.com/sourcebot-dev/sourcebot/releases/tag/v4.6.0",
    "summary": "生成摘要时出错",
    "chinese_title": "Show HN: Sourcebot – Self-hosted Perplexity for your codebase",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44747843",
    "title": "Secure boot certificate rollover is real but probably won't hurt you",
    "url": "https://mjg59.dreamwidth.org/72892.html",
    "summary": "生成摘要时出错",
    "chinese_title": "Secure boot certificate rollover is real but probably won't hurt you",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44711163",
    "title": "Following Up on the Python JIT",
    "url": "https://lwn.net/Articles/1029307/",
    "summary": "生成摘要时出错",
    "chinese_title": "Following Up on the Python JIT",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44710256",
    "title": "Sumo – Simulation of Urban Mobility",
    "url": "https://eclipse.dev/sumo/",
    "summary": "生成摘要时出错",
    "chinese_title": "Sumo – Simulation of Urban Mobility",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44744079",
    "title": "How to trigger a command on Linux when power switches from AC to battery",
    "url": "https://dataswamp.org/~solene/2025-05-31-linux-killswitch-on-power-disconnect.html",
    "summary": "生成摘要时出错",
    "chinese_title": "How to trigger a command on Linux when power switches from AC to battery",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44745123",
    "title": "So you're a manager now",
    "url": "https://scottkosman.com/post/blog/so-youre-a-manager-now/",
    "summary": "生成摘要时出错",
    "chinese_title": "So you're a manager now",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44744331",
    "title": "GEPA: Reflective prompt evolution can outperform reinforcement learning",
    "url": "https://arxiviq.substack.com/p/gepa-reflective-prompt-evolution",
    "summary": "生成摘要时出错",
    "chinese_title": "GEPA: Reflective prompt evolution can outperform reinforcement learning",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44744578",
    "title": "Introduction to Computer Music",
    "url": "https://cmtext.com/",
    "summary": "生成摘要时出错",
    "chinese_title": "Introduction to Computer Music",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44744324",
    "title": "I tried Servo",
    "url": "https://www.spacebar.news/servo-undercover-web-browser-engine/",
    "summary": "生成摘要时出错",
    "chinese_title": "I tried Servo",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44724259",
    "title": "How Hyper Built a 1m-Accurate Indoor GPS",
    "url": "https://andrewhart.me/hyper/",
    "summary": "生成摘要时出错",
    "chinese_title": "How Hyper Built a 1m-Accurate Indoor GPS",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44724072",
    "title": "Go’s race detector has a mutex blind spot",
    "url": "https://doublefree.dev/go-race-mutex-blindspot/",
    "summary": "生成摘要时出错",
    "chinese_title": "Go’s race detector has a mutex blind spot",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44755867",
    "title": "Detecting toxic work culture early on",
    "url": "https://www.deccanherald.com/education/detecting-toxic-work-culture-early-on-2-3654210",
    "summary": "生成摘要时出错",
    "chinese_title": "Detecting toxic work culture early on",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44710647",
    "title": "Ferrari Status",
    "url": "https://collabfund.com/blog/ferrari-status/",
    "summary": "生成摘要时出错",
    "chinese_title": "Ferrari Status",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44746415",
    "title": "Ursa: A leaderless, object storage–based alternative to Kafka",
    "url": "https://streamnative.io/products/ursa",
    "summary": "生成摘要时出错",
    "chinese_title": "Ursa: A leaderless, object storage–based alternative to Kafka",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44739556",
    "title": "Vibe code is legacy code",
    "url": "https://blog.val.town/vibe-code",
    "summary": "生成摘要时出错",
    "chinese_title": "Vibe code is legacy code",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44747816",
    "title": "How long before superintelligence? (1997)",
    "url": "https://nickbostrom.com/superintelligence",
    "summary": "生成摘要时出错",
    "chinese_title": "How long before superintelligence? (1997)",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44747241",
    "title": "The Chrome Speculation Rules API allows the browser to preload and prerender",
    "url": "https://www.docuseal.com/blog/make-any-website-load-faster-with-6-lines-html",
    "summary": "生成摘要时出错",
    "chinese_title": "The Chrome Speculation Rules API allows the browser to preload and prerender",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44751155",
    "title": "Crafting your own Static Site Generator using Phoenix (2023)",
    "url": "https://fly.io/phoenix-files/crafting-your-own-static-site-generator-using-phoenix/",
    "summary": "生成摘要时出错",
    "chinese_title": "Crafting your own Static Site Generator using Phoenix (2023)",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44748634",
    "title": "Astronomical Telescope “Hadley” – an easy assembly, high performance Newtonian",
    "url": "https://www.printables.com/model/224383-astronomical-telescope-hadley-an-easy-assembly-hig",
    "summary": "生成摘要时出错",
    "chinese_title": "Astronomical Telescope “Hadley” – an easy assembly, high performance Newtonian",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44713716",
    "title": "Replacing cron jobs with a centralized task scheduler",
    "url": "https://mayhul.com/posts/scheduled-tasks/",
    "summary": "生成摘要时出错",
    "chinese_title": "Replacing cron jobs with a centralized task scheduler",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44712847",
    "title": "Windows Directory Structure Synchronizer",
    "url": "https://github.com/fernvenue/path-dumper-windows",
    "summary": "生成摘要时出错",
    "chinese_title": "Windows Directory Structure Synchronizer",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44754717",
    "title": "Pride Versioning 0.3.0",
    "url": "https://pridever.org/",
    "summary": "生成摘要时出错",
    "chinese_title": "Pride Versioning 0.3.0",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44746334",
    "title": "U.S. senators introduce new pirate site blocking bill, \"Block BEARD\"",
    "url": "https://torrentfreak.com/u-s-senators-introduce-new-pirate-site-blocking-bill-block-beard/",
    "summary": "生成摘要时出错",
    "chinese_title": "U.S. senators introduce new pirate site blocking bill, \"Block BEARD\"",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44745843",
    "title": "Orion Browser",
    "url": "https://kagi.com/orion/",
    "summary": "生成摘要时出错",
    "chinese_title": "Orion Browser",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44739632",
    "title": "Ollama's new app",
    "url": "https://ollama.com/blog/new-app",
    "summary": "生成摘要时出错",
    "chinese_title": "Ollama's new app",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44703180",
    "title": "Profiling without Source code – how I diagnosed Trackmania stuttering",
    "url": "https://larstofus.com/2025/07/27/profiling-without-source-code-how-i-diagnosed-trackmania-stuttering/",
    "summary": "生成摘要时出错",
    "chinese_title": "Profiling without Source code – how I diagnosed Trackmania stuttering",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44724216",
    "title": "Attention is your scarcest resource (2020)",
    "url": "https://www.benkuhn.net/attention/",
    "summary": "生成摘要时出错",
    "chinese_title": "Attention is your scarcest resource (2020)",
    "chinese_summary": "生成摘要时出错"
  }
]