[
  {
    "id": "43630388",
    "title": "Hardening the Firefox Front End with Content Security Policies",
    "url": "https://attackanddefense.dev/2025/04/09/hardening-the-firefox-frontend-with-content-security-policies.html",
    "summary": "This article details Firefox's efforts to harden its user interface against injection attacks, specifically Cross-Site Scripting (XSS). The Firefox UI, built using web technologies like HTML, CSS, and JavaScript, is vulnerable to XSS, making it a target for attackers. The primary defense strategy involves implementing Content Security Policies (CSPs) to restrict script execution, similar to how websites protect themselves.\n\nThe core of the project focuses on removing inline event handlers from `browser.xhtml`, the main UI file. Over 600 of these handlers have been replaced with safer alternatives using `addEventListener`, significantly reducing the attack surface. This initiative was a direct response to vulnerabilities discovered in Pwn2Own 2022.\n\nThe article highlights the process of replacing inline handlers and offers guidance for developers. Beyond `browser.xhtml`, Firefox is expanding CSP application to other UI components and about: pages, aiming for even stricter policies to block dynamic code execution entirely. The ultimate goal is to create a more secure Firefox, resilient to XSS attacks. The changes are expected to ship in Firefox 138, representing a substantial improvement in frontend security and potentially breaking existing exploit chains.\n",
    "chinese_title": "使用内容安全策略强化 Firefox 前端",
    "chinese_summary": "本文详述了 Firefox 为抵御注入攻击（特别是跨站脚本攻击，即 XSS）而做出的努力。Firefox 的用户界面使用 HTML、CSS 和 JavaScript 等 Web 技术构建，容易受到 XSS 攻击，从而使其成为攻击者的目标。主要防御策略包括实施内容安全策略（CSP）以限制脚本执行，类似于网站保护自己的方式。\n\n该项目的核心是移除来自 `browser.xhtml` (主要的 UI 文件)的内联事件处理程序。已经使用 `addEventListener` 将 600 多个此类处理程序替换为更安全的替代方案，从而显著减少了攻击面。这项举措是对 Pwn2Own 2022 中发现的漏洞的直接回应。\n\n文章重点介绍了替换内联处理程序的过程，并为开发人员提供了指导。除了 `browser.xhtml` 之外，Firefox 正在将 CSP 应用扩展到其他 UI 组件和 about: 页面，旨在实施更严格的策略，以完全阻止动态代码执行。最终目标是创建一个更安全的 Firefox，使其能够抵抗 XSS 攻击。预计这些更改将在 Firefox 138 中发布，这将代表前端安全性的实质性改进，并可能破坏现有的漏洞利用链。"
  },
  {
    "id": "43624220",
    "title": "Apache ECharts",
    "url": "https://echarts.apache.org/en/index.html",
    "summary": "This document introduces Apache ECharts, a declarative framework designed for quickly building web-based visualizations. The primary focus is on ECharts as a tool for representing data visually on the web. The document also emphasizes proper citation when using ECharts in various projects and publications, from research to product development and educational contexts. It provides a link to a published paper (Visual Informatics, 2018) to be cited when referencing or utilizing ECharts. Essentially, the document serves as an announcement and guide to acknowledging the source when using ECharts.\n",
    "chinese_title": "Apache ECharts",
    "chinese_summary": "本文档介绍了Apache ECharts，一个用于快速构建Web可视化效果的声明式框架。主要侧重于ECharts作为在Web上可视化呈现数据的工具。文档还强调在各种项目和出版物中使用ECharts时应进行适当的引用，涵盖从研究到产品开发和教育的各个领域。它提供了已发表论文（Visual Informatics, 2018）的链接，用于在引用或使用ECharts时进行参考。本质上，该文档作为在使用ECharts时对来源进行确认的公告和指南。"
  },
  {
    "id": "43629307",
    "title": "The best programmers I know",
    "url": "https://endler.dev/2025/best-programmers/",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "我认识的最棒的程序员",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "43627646",
    "title": "PostgreSQL Full-Text Search: Fast When Done Right (Debunking the Slow Myth)",
    "url": "https://blog.vectorchord.ai/postgresql-full-text-search-fast-when-done-right-debunking-the-slow-myth",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "PostgreSQL 全文搜索：用对才快（揭穿“慢”的迷思）",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "43629887",
    "title": "'Sun-Like' Stars",
    "url": "https://www.centauri-dreams.org/2025/04/08/on-sun-like-stars/",
    "summary": "This article explores the ambiguity and evolving definition of the term \"Sun-like\" when discussing exoplanets and their potential for habitability. The author, Paul Gilster, highlights how the meaning shifts depending on the context, creating confusion between scientific publications and popular media.\n\nThe core issue revolves around which types of stars qualify as \"Sun-like.\" Initially, the term implied G-class stars, similar to our Sun, with a lifespan of roughly 10 billion years. However, the definition has expanded to include K-class and sometimes even F-class stars, which are slightly cooler, less massive, and/or hotter and more massive than the Sun, respectively. This broadening significantly impacts estimations of how many stars might host Earth-like planets, as different stellar classes have vastly different population percentages in the galaxy.\n\nThe article emphasizes the importance of clarity in defining \"Sun-like\" when communicating research findings to the public.  Vague usage can lead to misinterpretations and potentially affect public support for exoplanet research, particularly when discussing concepts like \"Earth-class planets.\"  The author concludes by stressing the need for precision in terminology to avoid confusing non-experts, especially as the field of exoplanet research gains more public attention. He highlights the importance of clear communication in this burgeoning field, especially in contexts like news releases.\n",
    "chinese_title": "类太阳恒星",
    "chinese_summary": "这篇文章探讨了在讨论系外行星及其潜在宜居性时，“类太阳”一词的模糊性和不断演变的定义。作者Paul Gilster强调了其含义如何根据语境而变化，从而在科学出版物和大众媒体之间造成混淆。\n\n核心问题围绕着哪些类型的恒星符合“类太阳”的标准。最初，这个术语指的是G型星，类似于我们的太阳，寿命约为100亿年。然而，定义已经扩展到包括K型星，有时甚至包括F型星，这些恒星分别比太阳略微凉、质量较小和/或更热、质量更大。这种扩展极大地影响了关于可能存在地球类行星的恒星数量的估计，因为不同恒星类别在银河系中的占比差异很大。\n\n文章强调了在向公众传达研究成果时明确定义“类太阳”的重要性。模糊的用法可能导致误解，并可能影响公众对系外行星研究的支持，尤其是在讨论“地球类行星”等概念时。作者总结说，为了避免混淆非专业人士，尤其是在系外行星研究领域获得更多公众关注之际，术语的精确性至关重要。他强调了在这个新兴领域中清晰沟通的重要性，特别是在新闻发布等情境中。"
  },
  {
    "id": "43625474",
    "title": "Obituary for Cyc",
    "url": "https://yuxi-liu-wired.github.io/essays/posts/cyc/",
    "summary": "This article serves as an obituary for the Cyc project, Douglas Lenat's ambitious 40-year endeavor to build artificial general intelligence (AGI) through symbolic logic. The project ultimately failed, despite significant investment ($200 million and 2,000 person-years) and Lenat's persistent belief in its potential. Cyc aimed to encode a massive database of common-sense knowledge, the \"knowledge pump,\" to enable machine learning and autonomous scientific discovery. However, it never achieved its goal, and commercial applications focused on standard expert systems and data integration, offering no competitive advantage over existing technologies.\n\nThe article traces Lenat's journey, starting with his PhD work on automated mathematical discovery with AM and EURISKO, which also suffered from limited progress. These experiences convinced him of the necessity of a vast knowledge base. Cyc's insular nature, academic disinterest, and Lenat's rejection of alternative AI approaches (like neural networks) are highlighted. The project’s secretive nature, including the removal of open information and Lenat’s resistance to open-source and academic collaboration, further contributed to its isolation.\n\nThe article further explores the roots of Lenat's vision through his earlier work, like AM, a system designed to autonomously discover mathematical concepts.  It delves into the logical AI approach of heuristic search, where systems like BACON and Dendral attempted to discover scientific laws and molecular structures, respectively.  The core problem, as the article argues, lies in the heuristic rules governing these systems, many of which were hand-waved and lacked the necessary level of detail for independent verification and replication.  Ultimately, the Cyc project’s long, slow failure serves as a critique of the symbolic-logical approach to AI.\n",
    "chinese_title": "Cyc 讣告",
    "chinese_summary": "Cyc 项目讣告"
  },
  {
    "id": "43627758",
    "title": "Show HN: DrawDB – open-source online database diagram editor (a retro)",
    "url": "https://www.drawdb.app/",
    "summary": "This \"Show HN\" article announces the launch of **DrawDB**, an open-source online database diagram editor. The tool allows users to visually design database schemas and automatically generate the corresponding SQL code. Users can create and manipulate diagrams online, simplifying the process of database design and development. The article highlights that to use DrawDB, JavaScript must be enabled. This suggests the application is entirely web-based and relies on JavaScript for its functionality. The article is short and acts primarily as a launch announcement, likely aimed at attracting attention from the developer community. It emphasizes the open-source nature of the tool, which encourages community contributions and further development. The core function of DrawDB is to facilitate database design and ease the task of writing SQL, making it a potentially valuable tool for developers working with databases.\n",
    "chinese_title": "Show HN：DrawDB - 开源在线数据库图表编辑器 (复古风)",
    "chinese_summary": "DrawDB: 开源在线数据库图表编辑器发布"
  },
  {
    "id": "43620279",
    "title": "Brazil's government-run payments system has become dominant",
    "url": "https://www.economist.com/the-americas/2025/04/03/brazils-government-run-payments-system-has-become-dominant",
    "summary": "Brazil's government-run digital payment system, Pix, launched in November 2020, has rapidly become the dominant payment method in the country. Initially introduced during the COVID-19 pandemic, Pix's ease of use, speed, and lack of fees led to its swift adoption. Users can transfer money using a recipient's national ID, phone number, or a QR code.\n\nBy 2024, Pix had surpassed both cash and card payments in popularity. The system's growth has been remarkable, with the number of transactions increasing from 9 billion in 2021 to 63 billion in 2024. During this period, Pix facilitated the movement of 26 trillion reais ($4.5 trillion). The speed of Pix's adoption is unprecedented globally.\n\nThe article highlights Pix's success in modernizing Brazil's banking sector. However, it also raises concerns about the significant power the central bank now wields due to its control over the system. The article appeared in the The Americas section of the print edition under the headline “Pix perfect”.\n",
    "chinese_title": "巴西政府运营的支付系统已占据主导地位",
    "chinese_summary": "巴西政府运营的数字支付系统 Pix 在 2020 年 11 月推出后，迅速成为该国主要的支付方式。Pix 最初在 COVID-19 疫情期间推出，其易用性、速度和零手续费促使其迅速普及。用户可以使用收款人的身份证、电话号码或二维码转账。\n\n到 2024 年，Pix 的受欢迎程度已超过现金和银行卡支付。该系统的增长引人注目，交易量从 2021 年的 90 亿笔增加到 2024 年的 630 亿笔。在此期间，Pix 促成了 26 万亿雷亚尔（4.5 万亿美元）的资金流动。Pix 的普及速度在全球范围内都是前所未有的。\n\n文章强调了 Pix 在巴西银行业现代化方面的成功。然而，它也对中央银行因控制该系统而拥有的巨大权力提出了担忧。这篇文章出现在印刷版的《美洲》版块，标题为“Pix 完美”。"
  },
  {
    "id": "43597264",
    "title": "Linux Kernel Defence Map – Security Hardening Concepts",
    "url": "https://github.com/a13xp0p0v/linux-kernel-defence-map",
    "summary": "This article introduces the \"Linux Kernel Defence Map,\" a graphical representation designed to help navigate the complex world of Linux kernel security hardening. The map, available on GitHub, Codeberg, and GitFlic, visualizes the relationships between vulnerability classes, exploitation techniques, bug detection mechanisms, and defense technologies within the Linux kernel. It uses the DOT language and GraphViz for generation, offering a convenient way to understand the interplay of these concepts.\n\nThe map focuses solely on kernel security hardening, excluding attack surface reduction, userspace security features, and Linux Security Modules (LSM) policies. The author also created a \"kernel-hardening-checker\" to automatically verify kernel security configuration options, as many hardening features are not enabled by default in major Linux distributions. The article encourages users to manually configure these options for improved system security. The project is licensed under GPL-3.0 and references several sources on Linux kernel security, including resources from Grsecurity, Kees Cook, and Microsoft. The map is currently up-to-date for Linux kernel v6.10.\n",
    "chinese_title": "Linux 内核防御地图 – 安全强化概念",
    "chinese_summary": "Linux 内核防御图"
  },
  {
    "id": "43620141",
    "title": "Tailscale has raised $160M",
    "url": "https://tailscale.com/blog/series-c",
    "summary": "Tailscale, a company focused on simplifying networking, announced it has raised $160 million USD ($230 million CAD) in its Series C funding round. The round was led by Accel with participation from CRV, Insight Partners, Heavybit, and Uncork Capital, along with angel investors like George Kurtz (Crowdstrike CEO) and new investor Anthony Casalena (Squarespace CEO).\n\nThe article explains that the funding will be used to accelerate Tailscale's growth and development. The company aims to remove friction in networking, scale its network without added complexity, and prioritize identity over IP addresses for secure connectivity, a concept they call \"identity-first networking.\" This approach allows users to connect to their apps, teammates, and services, regardless of their location, simplifying the networking experience.\n\nTailscale highlights the growing need for their solution, particularly within the AI industry, where companies like Perplexity, Mistral, Cohere, Groq, and Hugging Face are utilizing Tailscale to manage and secure their infrastructure. Other companies like Instacart, SAP, Telus, Motorola, and Duolingo are also using Tailscale.\n\nThe investment will allow Tailscale to expand its engineering and product teams, support its free customer offerings, and further develop its platform, ensuring backward compatibility. The company emphasizes its commitment to making networking simple and accessible for all, from startups to Fortune 500 companies and individuals.\n",
    "chinese_title": "Tailscale 融资 1.6 亿美元",
    "chinese_summary": "需求：\n1.  只提供一个准确的中文翻译\n2.  直接输出翻译结果，无需解释或多重选择\n3.  保持原文的含义和风格\n4.  如果是标题，请保持简洁明了\n\nTailscale, a company focused on simplifying networking, announced it has raised $160 million USD ($230 million CAD) in its Series C funding round. The round was led by Accel with participation from CRV, Insight Partners, Heavybit, and Uncork Capital, along with angel investors like George Kurtz (Crowdstrike CEO) and new investor Anthony Casalena (Squarespace CEO).\n\nThe article explains that the funding will be used to accelerate Tailscale's growth and development. The company aims to remove friction in networking, scale its network without added complexity, and prioritize identity over IP addresses for secure connectivity, a concept they call \"identity-first networking.\" This approach allows users to connect to their apps, teammates, and services, regardless of their location, simplifying the networking experience.\n\nTailscale highlights the growing need for their solution, particularly within the AI industry, where companies like Perplexity, Mistral, Cohere, Groq, and Hugging Face are utilizing Tailscale to manage and secure their infrastructure. Other companies like Instacart, SAP, Telus, Motorola, and Duolingo are also using Tailscale.\n\nThe investment will allow Tailscale to expand its engineering and product teams, support its free customer offerings, and further develop its platform, ensuring backward compatibility. The company emphasizes its commitment to making networking simple and accessible for all, from startups to Fortune 500 companies and individuals.\n\nTailscale宣布完成1.6亿美元（2.3亿加元）C轮融资\n\n专注于简化网络连接的Tailscale公司宣布已完成1.6亿美元（2.3亿加元）的C轮融资。本轮融资由Accel领投，CRV、Insight Partners、Heavybit和Uncork Capital参投，以及包括George Kurtz（Crowdstrike首席执行官）和新投资者Anthony Casalena（Squarespace首席执行官）在内的天使投资人。\n\n文章解释说，这笔资金将用于加速Tailscale的增长和发展。该公司旨在消除网络连接中的摩擦，在不增加复杂性的情况下扩展其网络，并优先考虑身份认证而非IP地址以实现安全连接，他们称之为“身份优先网络”。这种方法允许用户无论身处何处，都能连接到他们的应用程序、团队成员和服务，从而简化网络体验。\n\nTailscale强调了对其解决方案日益增长的需求，特别是在人工智能行业，Perplexity、Mistral、Cohere、Groq和Hugging Face等公司正在使用Tailscale来管理和保护其基础设施。Instacart、SAP、Telus、Motorola和Duolingo等其他公司也在使用Tailscale。\n\n此次投资将使Tailscale能够扩大其工程和产品团队，支持其免费客户服务，并进一步开发其平台，确保向后兼容性。该公司强调其致力于让网络连接对所有人（从初创公司到财富500强公司，再到个人用户）来说都简单易用。"
  }
]