[
  {
    "id": "44672003",
    "title": "There is no memory safety without thread safety",
    "url": "https://www.ralfj.de/blog/2025/07/24/memory-safety.html",
    "summary": "Ralf's Ramblings argues that the traditional separation of \"memory safety\" and \"thread safety\" is misleading because thread unsafety can directly lead to memory safety violations, ultimately resulting in Undefined Behavior (UB). The author uses Go as a prime example, demonstrating how data races in Go, particularly with interfaces and slices, can lead to memory corruption and crashes, effectively breaking the language's promise of memory safety.\n\nWhile other languages like Java allow data races, they are designed to ensure that these races result in predictable, well-defined outcomes, preventing the kind of memory corruption that causes segfaults. Languages like Rust and Swift employ strong type systems to largely eliminate data races and handle the remaining cases safely.\n\nGo, however, takes neither approach, allowing data races that can cause memory safety issues. While Go has data race detection tools, relying on testing to uncover all potential concurrency issues is insufficient. The author criticizes Go's memory model documentation for downplaying the severity of data races and comparing itself favorably to Java and JavaScript, which have stronger thread safety guarantees.\n\nThe core argument is that \"safety\" should be defined as the absence of Undefined Behavior. If a program can violate the language's specification and abstractions, it creates a breeding ground for vulnerabilities. While Go might be safer than languages like C, its susceptibility to data races that compromise memory safety places it in a problematic middle ground.\n",
    "chinese_title": "没有线程安全就没有内存安全",
    "chinese_summary": "Ralf的漫谈认为，传统上将“内存安全”和“线程安全”分开是具有误导性的，因为线程不安全可以直接导致内存安全违规，最终导致未定义行为（UB）。作者以Go为例，展示了Go中的数据竞争，特别是接口和切片中的数据竞争，如何导致内存损坏和崩溃，从而打破了该语言对内存安全的承诺。\n\n虽然Java等其他语言允许数据竞争，但它们的设计旨在确保这些竞争产生可预测的、定义明确的结果，从而防止导致段错误的内存损坏。像Rust和Swift这样的语言采用强大的类型系统来在很大程度上消除数据竞争，并安全地处理剩余的情况。\n\n然而，Go没有采用这两种方法中的任何一种，而是允许可能导致内存安全问题的数据竞争。虽然Go有数据竞争检测工具，但依靠测试来发现所有潜在的并发问题是不够的。作者批评了Go的内存模型文档，因为它淡化了数据竞争的严重性，并将其与具有更强线程安全保证的Java和JavaScript进行了有利的比较。\n\n核心论点是，“安全”应该被定义为不存在未定义行为。如果一个程序可以违反语言的规范和抽象，它就会为漏洞创造温床。虽然Go可能比C等语言更安全，但它对损害内存安全的数据竞争的敏感性使其处于一个有问题的中间地带。"
  },
  {
    "id": "44671373",
    "title": "PSA: SQLite WAL checksums fail silently and may lose data",
    "url": "https://avi.im/blag/2025/sqlite-wal-checksum/",
    "summary": "This article highlights a critical issue with SQLite's Write-Ahead Logging (WAL) mode and its checksum verification. While WAL mode improves write throughput and includes checksums, SQLite's behavior upon detecting a checksum mismatch can lead to silent data loss.\n\nSpecifically, when SQLite detects a corrupted frame in the WAL during WAL Index (.db-shm file) rebuilding (which happens after an unclean shutdown or if the .db-shm file is missing), it drops the corrupted frame *and all subsequent frames*, even if those subsequent frames are not corrupt. This is intentional behavior, not a bug.\n\nThe problem arises because SQLite doesn't throw an error upon corruption detection. Instead, it silently checkpoints the potentially incomplete WAL to the main database file and truncates the WAL, resulting in data loss. This can happen when the .db-shm file is absent, a common scenario when receiving a database from another source or following a system crash during a WAL write.\n\nThe author expresses frustration with this default behavior, arguing that an error should be raised to allow for custom error handling and potential data recovery. They suggest that the current \"limp along\" approach might be suitable for embedded environments but is problematic for applications where data integrity is paramount. While this behavior might be partially influenced by SQLite's prevalence on mobile devices with less reliable storage, the lack of error reporting remains a concern.\n",
    "chinese_title": "PSA: SQLite WAL校验和静默失败并可能丢失数据",
    "chinese_summary": "本文重点介绍 SQLite 的预写式日志 (WAL) 模式及其校验和验证的一个关键问题。虽然 WAL 模式提高了写入吞吐量并包含校验和，但 SQLite 在检测到校验和不匹配时的行为可能导致静默数据丢失。\n\n具体来说，当 SQLite 在 WAL 索引（.db-shm 文件）重建期间（这会在不干净的关闭后或 .db-shm 文件丢失时发生）检测到 WAL 中的损坏帧时，它会丢弃损坏的帧*以及所有后续帧*，即使这些后续帧未损坏。这是有意为之的行为，而不是错误。\n\n问题在于 SQLite 在检测到损坏时不会抛出错误。相反，它会将可能不完整的 WAL 静默地检查点到主数据库文件并截断 WAL，从而导致数据丢失。当 .db-shm 文件不存在时，可能会发生这种情况，这在从其他来源接收数据库或在 WAL 写入期间系统崩溃后是一种常见情况。\n\n作者对这种默认行为表示失望，认为应该引发一个错误，以便允许自定义错误处理和潜在的数据恢复。他们认为，当前这种“勉强维持”的方法可能适用于嵌入式环境，但对于数据完整性至关重要的应用程序来说是有问题的。虽然这种行为可能部分受到 SQLite 在存储可靠性较低的移动设备上的普及的影响，但缺乏错误报告仍然是一个问题。"
  },
  {
    "id": "44672859",
    "title": "Major Quantum Computing Advance Made Obsolete by Teenager",
    "url": "https://www.quantamagazine.org/teenager-finds-classical-alternative-to-quantum-recommendation-algorithm-20180731/",
    "summary": "This article details how an 18-year-old, Ewin Tang, disproved a significant claim of quantum speedup in the \"recommendation problem,\" a problem crucial for recommendation systems like those used by Amazon and Netflix.\n\nIn 2016, computer scientists Kerenidis and Prakash developed a quantum algorithm believed to solve the recommendation problem exponentially faster than any existing classical algorithm. This was considered a major win for quantum computing, showcasing its potential for real-world applications.\n\nHowever, Tang, while working on a research project advised by Scott Aaronson, discovered a classical algorithm that could perform nearly as well as the quantum one. This discovery essentially eliminates one of the strongest arguments for quantum supremacy in the recommendation problem.\n\nTang's classical algorithm was inspired by the quantum techniques used by Kerenidis and Prakash, demonstrating a valuable interplay between quantum and classical algorithms. While this result represents a setback for quantum computing's perceived advantage, it also underscores the rapid advancements in both fields. The algorithm underwent informal review at a quantum computing workshop and is now awaiting formal peer review. Despite the setback for quantum computing, the work highlights the potential for classical algorithms to improve in response to quantum innovations.\n",
    "chinese_title": "青少年使量子计算的重大进展过时",
    "chinese_summary": "本文详细介绍了18岁的唐一文如何推翻了量子加速在“推荐问题”上的一个重要论断。“推荐问题”对于亚马逊和奈飞等使用的推荐系统至关重要。\n\n2016年，计算机科学家Kerenidis和Prakash开发了一种量子算法，据信该算法解决推荐问题的速度比任何现有的经典算法都要快指数级。这被认为是量子计算的一项重大胜利，展示了其在现实世界应用中的潜力。\n\n然而，唐一文在Scott Aaronson指导的一个研究项目中，发现了一种经典算法，其性能几乎与量子算法一样好。这一发现基本上消除了量子霸权在推荐问题上最强有力的论据之一。\n\n唐一文的经典算法受到了Kerenidis和Prakash使用的量子技术的启发，展示了量子算法和经典算法之间有价值的相互作用。虽然这一结果代表了量子计算的感知优势的一次挫折，但也突显了这两个领域的快速发展。该算法在量子计算研讨会上进行了非正式审查，目前正在等待正式的同行评审。尽管量子计算遭遇挫折，但这项工作突显了经典算法在响应量子创新时具有改进的潜力。"
  },
  {
    "id": "44671484",
    "title": "Use Your Type System",
    "url": "https://www.dzombak.com/blog/2025/07/use-your-type-system/",
    "summary": "This article advocates for leveraging a programming language's type system to prevent bugs related to incorrect usage of primitive types like integers, strings, and UUIDs. The author points out that using generic types for distinct entities (e.g., UserID vs. AccountID, or Fahrenheit vs. Celsius) leads to errors where one type is mistakenly used in place of another.\n\nThe solution is to define specific, distinct types for each entity, even if they are based on the same underlying primitive. This allows the compiler to catch type mismatches at compile time, preventing runtime errors.\n\nThe author provides examples using Go, showcasing how creating `AccountID` and `UserID` types based on UUIDs can prevent them from being used interchangeably. Similarly, using specific types like `TempF` and `RelHumidity` avoids mixing up temperature scales or accidentally swapping arguments in functions.\n\nThe core message is that distinct entities should have distinct types, even if they share the same underlying representation. This simple technique, though rarely seen in production code, significantly reduces a common class of bugs and improves code reliability. The author encourages developers to utilize the type system to its full potential, especially when dealing with IDs and measurements.\n",
    "chinese_title": "使用你的类型系统",
    "chinese_summary": "本文倡导利用编程语言的类型系统来预防因不正确使用整数、字符串和UUID等基本类型而产生的错误。作者指出，对不同实体（例如，UserID与AccountID，或华氏度与摄氏度）使用泛型会导致一种类型的错误地代替另一种类型。\n\n解决方案是为每个实体定义特定的、不同的类型，即使它们基于相同的底层基本类型。这样可以使编译器在编译时捕获类型不匹配，从而防止运行时错误。\n\n作者提供了使用Go的例子，展示了如何创建基于UUID的`AccountID`和`UserID`类型可以防止它们被互换使用。同样，使用`TempF`和`RelHumidity`等特定类型可以避免混淆温度刻度或意外地交换函数中的参数。\n\n核心信息是，不同的实体应该具有不同的类型，即使它们共享相同的底层表示。这种简单的技术虽然在生产代码中很少见到，但可以显著减少一类常见的错误并提高代码的可靠性。作者鼓励开发人员充分利用类型系统，尤其是在处理ID和测量值时。"
  },
  {
    "id": "44670326",
    "title": "UK: Phone networks down: EE, BT, Three, Vodafone, O2 not working in mass outage",
    "url": "https://www.the-independent.com/tech/ee-bt-three-vodafone-o2-down-phone-networks-outage-latest-b2795260.html",
    "summary": "A major outage is affecting several major UK phone networks, including BT, EE, Three, and Vodafone, leaving millions unable to make or receive calls. Users have reported issues on social media, citing inability to connect calls. Vodafone and EE have acknowledged the problems, with Vodafone stating they are working to fix the issue. DownDetector reports indicate that London, Birmingham, Manchester, and Glasgow are among the areas most affected. While some O2 customers reported issues, the company claims its network is operating normally and that the reports are likely due to users attempting to contact those on affected networks. The cause of the widespread outage remains unconfirmed.\n",
    "chinese_title": "英国：电话网络瘫痪：EE、BT、Three、Vodafone、O2大规模中断",
    "chinese_summary": "英国主要电话网络发生大范围中断，包括英国电信、EE、Three和沃达丰，导致数百万人无法拨打或接听电话。用户在社交媒体上报告了相关问题，称无法连接通话。沃达丰和EE已承认存在问题，沃达丰表示正在努力修复。DownDetector报告显示，伦敦、伯明翰、曼彻斯特和格拉斯哥是受影响最严重的地区。虽然一些O2客户报告了问题，但该公司声称其网络运行正常，这些报告可能是由于用户试图联系受影响网络的用户造成的。目前，此次大范围中断的原因尚未得到证实。"
  },
  {
    "id": "44672145",
    "title": "When swiping supplants scissors: The hidden cost of touchscreens",
    "url": "https://caseorganic.medium.com/when-swiping-supplants-scissors-the-hidden-cost-of-touchscreens-and-how-designers-can-help-dba0fa65f5b7",
    "summary": "Amber Case's article \"When Swiping Supplants Scissors: The Hidden Cost of Touchscreens\" explores the potential negative impact of excessive touchscreen use on children's fine motor skills and cognitive development. The author argues that the shift towards digital interaction, with devices like Chromebooks dominating classrooms, reduces opportunities for tactile learning experiences crucial for developing hand-eye coordination and spatial awareness.\n\nCase draws on research, personal anecdotes, and interviews to highlight this issue. She cites a survey indicating educators are noticing increasing difficulties in young students with tasks like writing and tying shoes. Contrasting this with her own childhood filled with hands-on activities like soldering and building, she emphasizes the importance of tactile creativity for problem-solving and future success. She interviews a teacher witnessing decreased arts and crafts projects in school in favor of digital integration.\n\nThe author references Chesterton’s Fence to illustrate how removing tactile experiences without understanding their underlying importance can lead to unforeseen consequences. She warns that over-reliance on touchscreens can increase anxiety, myopia, and a dependence on external software, potentially hindering cognitive development.\n\nCase calls for a restoration of tactile interactivity, suggesting ways schools, designers, and companies can contribute. She highlights the scientific evidence supporting the cognitive benefits of handwriting and physical crafts and points to the potential for innovation in handwriting-based devices, citing reMarkable as an example. She encourages designers to explore alternative form factors beyond current tech obsessions like XR headsets and AI pins, suggesting the next big innovation might come from someone deeply engaged in tactile creative pursuits.\n",
    "chinese_title": "滑动取代剪刀：触摸屏的隐性成本",
    "chinese_summary": "Amber Case 的文章《当滑动取代剪刀：触摸屏的隐性成本》探讨了过度使用触摸屏对儿童精细运动技能和认知发展可能产生的负面影响。作者认为，随着 Chromebook 等设备在课堂上占据主导地位，向数字化互动的转变减少了触觉学习体验的机会，而这些体验对于培养手眼协调能力和空间意识至关重要。\n\nCase 引用研究、个人轶事和访谈来强调这个问题。她引用一项调查表明，教育工作者注意到年轻学生在书写和系鞋带等任务方面越来越困难。她将此与自己充满焊接和建造等动手活动的童年进行对比，强调了触觉创造力对于解决问题和未来成功的重要性。她采访了一位老师，这位老师亲眼目睹了学校的艺术和手工艺项目减少，而数字化整合却在增加。\n\n作者引用了切斯特顿栅栏（Chesterton’s Fence）来阐述，在不理解其潜在重要性的情况下移除触觉体验可能会导致意想不到的后果。她警告说，过度依赖触摸屏可能会增加焦虑、近视以及对外部软件的依赖，从而可能阻碍认知发展。\n\nCase 呼吁恢复触觉互动，并提出了学校、设计师和公司可以做出贡献的方式。她强调了支持手写和实体工艺认知益处的科学证据，并指出基于手写的设备具有创新潜力，并以 reMarkable 为例。她鼓励设计师探索当前技术迷恋（如 XR 头显和 AI 别针）之外的替代外形尺寸，并暗示下一个重大创新可能来自那些深入参与触觉创意活动的人。"
  },
  {
    "id": "44673148",
    "title": "The great AI delusion is falling apart",
    "url": "https://www.mikemcbrideonline.com/2025/07/worth-reading-the-great-ai-delusion-is-falling-apart/",
    "summary": "This article questions the pervasive hype surrounding AI's productivity benefits, arguing that the promised gains haven't fully materialized in real-world applications. It cites a study where experienced programmers using AI tools were actually *slower* than those without, highlighting a \"self-deception\" where perceived speed doesn't translate to actual efficiency.\n\nThe author critiques the tendency to focus on individual tasks sped up by AI, like drafting emails or creating business plans, without accounting for the additional time required for review, correction, and verification. The example of email communication illustrates this point: while AI might quickly draft a response, the lack of clarity or completeness could lead to a drawn-out exchange, negating the initial time saved.\n\nThe core argument is that true productivity measurement requires evaluating the *entire* process, from AI-generated output to final, verified product. Without this holistic approach, AI's purported productivity gains may be illusory. The article expresses concern that significant investments in AI infrastructure are predicated on unrealized productivity increases, potentially leading to negative consequences for companies and workers alike. While acknowledging areas where AI provides genuine productivity benefits, the author stresses the need for a more realistic and comprehensive assessment of AI's impact on overall productivity.\n",
    "chinese_title": "伟大的AI幻想正在破灭",
    "chinese_summary": "本文质疑了围绕人工智能生产力效益的普遍炒作，认为承诺的收益尚未在实际应用中完全实现。文章引用了一项研究，其中使用人工智能工具的经验丰富的程序员实际上比没有使用这些工具的程序员*更慢*，突显了一种“自我欺骗”，即感知的速度并未转化为实际效率。\n\n作者批判了只关注人工智能加速的个体任务（如起草电子邮件或创建商业计划）的倾向，而没有考虑到审查、更正和验证所需的额外时间。电子邮件通信的例子说明了这一点：虽然人工智能可以快速起草回复，但缺乏清晰度或完整性可能会导致冗长的交流，从而抵消最初节省的时间。\n\n核心论点是，真正的生产力衡量需要评估*整个*过程，从人工智能生成的输出到最终的、经过验证的产品。如果没有这种整体方法，人工智能所谓的生产力提升可能是虚幻的。文章表达了对基于未实现的生产力增长而对人工智能基础设施进行大量投资的担忧，这可能会给公司和员工带来负面后果。虽然承认人工智能在某些领域提供了真正的生产力效益，但作者强调需要对人工智能对整体生产力的影响进行更现实和全面的评估。"
  },
  {
    "id": "44671804",
    "title": "Everything Else",
    "url": "https://newleftreview.org/sidecar/posts/everything-else",
    "summary": "In \"Everything Else,\" Caitlin Doherty recounts her disillusioning trip to Dubai to report on a violin competition. Initially drawn by the eccentric composer and the promise of observing a peculiar scene, she quickly becomes overwhelmed by the stark contrast between the city's opulence and the exploitation of its migrant workforce.\n\nDoherty describes the manufactured reality of Dubai, from the artificial Palm Jumeirah built with imported sand to the luxury resorts staffed by workers living in desert camps. She contrasts the lavish lifestyles of tourists and wealthy residents with the precarious existence of laborers from India, Pakistan, and other countries who are subjected to poor working conditions and limited rights.\n\nThe author expresses shame for participating in Dubai's consumerist culture, where the exploitation of others is normalized and even celebrated through social media posts and luxury experiences. She critiques the city's superficiality, highlighting the lack of meaningful cultural experiences beyond indulging in wealth and being served.\n\nDoherty also reflects on the geopolitical implications of Dubai's existence, noting the strong ties between the emirate and Israel and the city's role in whitewashing Zionism for international consumption. Ultimately, she abandons her attempt to write a humorous narrative about the trip, realizing that it would only serve to glorify a system built on inequality and human suffering. Instead, she argues that Dubai embodies a world where everything is for sale, except for fundamental values like love, dignity, and freedom, which are worth fighting for.\n",
    "chinese_title": "其他",
    "chinese_summary": "在《其他一切》中，凯特琳·多赫蒂叙述了她前往迪拜报道一场小提琴比赛的幻灭之旅。起初，她被古怪的作曲家和观察奇特景象的承诺所吸引，但很快就被这座城市奢华的表象与对其外来劳工的剥削之间鲜明对比所淹没。\n\n多赫蒂描述了迪拜的人造现实，从用进口沙子建造的人工棕榈岛到由居住在沙漠营地的工人提供服务的豪华度假村。她将游客和富裕居民的奢华生活方式，与来自印度、巴基斯坦和其他国家的劳工的朝不保夕的生活进行了对比，这些劳工遭受恶劣的工作条件和有限的权利。\n\n作者对参与迪拜的消费主义文化表示羞愧，在这种文化中，对其他人的剥削被常态化，甚至通过社交媒体帖子和奢侈体验来庆祝。她批判了这座城市的肤浅，强调除了沉迷于财富和被人服务之外，缺乏有意义的文化体验。\n\n多赫蒂还反思了迪拜存在的地缘政治影响，指出该酋长国与以色列之间的牢固关系，以及该城市在为国际消费粉饰犹太复国主义方面的作用。最终，她放弃了撰写有关这次旅行的幽默叙事的尝试，意识到这只会美化一个建立在不平等和人类苦难之上的体系。相反，她认为迪拜体现了一个一切都可以出售的世界，除了爱、尊严和自由等基本价值观，这些价值观值得为之奋斗。"
  },
  {
    "id": "44671584",
    "title": "The FastLanes File Format [pdf]",
    "url": "https://github.com/cwida/FastLanes/blob/dev/docs/specification.pdf",
    "summary": "This \"article,\" titled \"The FastLanes File Format,\" presents very limited information, focusing primarily on the FastLanes project within a web-based platform (likely GitHub or a similar repository). The content reveals a username \"cwida\" under which the \"FastLanes\" project is located within a \"Public\" repository.\n\nThe core takeaway is that this seems to be an open project, accessible publicly. Furthermore, the metrics \"Fork 19\" and \"Star 261\" suggest the project has some level of community engagement, indicating that others have found it useful or interesting enough to fork the repository (copy it for their own use) or star it (bookmark it as a favorite). The notification mention implies users can sign in to receive updates about the project.\n\nUltimately, the content provides no details about the file format itself, its purpose, or its technical specifications. It's more of a pointer to a project than a technical document explaining the FastLanes File Format. To understand the file format, one would need to access the actual project files within the repository.\n",
    "chinese_title": "FastLanes文件格式 [pdf]",
    "chinese_summary": "这篇题为《FastLanes文件格式》的“文章”信息非常有限，主要关注一个基于网络的平台（可能为GitHub或类似代码仓库）上的FastLanes项目。内容显示，用户名“cwida”下有一个位于“Public”仓库中的“FastLanes”项目。\n\n核心要点是，这似乎是一个公开项目，可以公开访问。此外，“Fork 19”和“Star 261”这两个指标表明该项目具有一定程度的社区参与度，说明其他人认为它有用或有趣，并Fork了该仓库（复制供自己使用）或Star了它（将其标记为收藏）。通知提示意味着用户可以登录以接收有关该项目的更新。\n\n总而言之，该内容未提供有关文件格式本身、其用途或其技术规范的任何详细信息。它更像是指向项目的指针，而不是解释FastLanes文件格式的技术文档。要了解文件格式，需要访问仓库中的实际项目文件。"
  },
  {
    "id": "44632674",
    "title": "I wasted weeks hand optimizing assembly because I benchmarked on random data",
    "url": "https://www.vidarholen.net/contents/blog/?p=1160",
    "summary": "The author recounts a time spent optimizing VarInt encoding for a large-scale distributed Java platform. Motivated by the potential impact of even small performance gains and the opportunity to leverage custom JVM optimizations, they developed a hand-coded assembly implementation that significantly outperformed the existing Java version in benchmarks using random numbers.\n\nHowever, when deployed in production, the optimization yielded no measurable improvement. The root cause was traced back to the benchmark's use of random numbers, which skewed the data towards large values requiring more bytes for VarInt encoding. In reality, the data being processed in the system consisted primarily of small numbers. The original Java implementation was already efficient at handling small values, negating any benefits from the optimized assembly code.\n\nThe author learned a valuable lesson about the importance of using realistic data in benchmarks. Their optimization, designed for the worst-case scenario with large random numbers, was irrelevant to the actual use case where small numbers dominated. The change was ultimately rolled back, and the effort was considered a proof-of-concept rather than a practical optimization. The experience highlighted the pitfalls of optimizing based on unrealistic benchmarks.\n",
    "chinese_title": "我浪费了几个星期手工优化汇编，因为我用随机数据做了基准测试。",
    "chinese_summary": "作者讲述了其优化大规模分布式Java平台的VarInt编码的经历。 受益于即使是微小的性能提升的潜在影响以及利用自定义JVM优化的机会的驱动，他们开发了一种手写汇编实现，该实现使用随机数在基准测试中明显优于现有的Java版本。\n\n然而，当部署在生产环境中时，该优化没有产生可衡量的改进。 根本原因追溯到基准测试中使用随机数，这使得数据偏向需要更多字节进行VarInt编码的大数值。 实际上，系统中处理的数据主要由小数值组成。 原始的Java实现已经可以有效地处理小数值，从而抵消了优化后的汇编代码带来的任何好处。\n\n作者学到了关于在基准测试中使用真实数据的必要性的宝贵一课。 他们为包含大量随机数的最坏情况设计的优化，与小数值占主导地位的实际用例无关。 该更改最终被回滚，并且该努力被认为是概念验证，而不是实际的优化。 该经历突出了基于不切实际的基准进行优化的缺陷。"
  },
  {
    "id": "44672414",
    "title": "Two narratives about AI",
    "url": "https://calnewport.com/no-one-knows-anything-about-ai/",
    "summary": "This article presents two conflicting narratives regarding the impact of AI, specifically LLMs, on the computer programming industry.\n\n**Narrative 1:** AI, due to its ability to generate well-structured text, is poised to revolutionize programming. Examples like AI-powered coding tools drastically reducing task completion time and claims of significant AI-related job cuts support this view. The article cites sources suggesting AI is replacing programmers, and even academic computer science is feeling the pressure.\n\n**Narrative 2:** This perspective pushes back against the doomsday predictions. A study showed experienced developers were slower using AI tools. Some engineers argue that AI is a tool to enhance, not replace, programmers, comparing it to a table saw for carpenters. Claims of AI-driven layoffs at Microsoft are debunked, with the company clarifying cuts were broader and aimed at reallocating funds to AI initiatives. A decline in CS majors is attributed to a broader correction in the tech market following pandemic-era spending.\n\nThe article concludes that the impact of AI is uncertain and advises readers to be skeptical of extreme claims. It recommends tuning out both overly enthusiastic and dismissive viewpoints, focusing on tangible, AI-related changes in areas of interest, and approaching AI news with caution, as understanding of its true impact is still limited. While acknowledging the importance of AI, the author emphasizes that its full potential and consequences remain largely unknown.\n",
    "chinese_title": "关于人工智能的两种叙事",
    "chinese_summary": "本文呈现了关于人工智能（尤其是大型语言模型）对计算机编程行业影响的两种相互冲突的叙述。\n\n**叙述一：** 人工智能凭借其生成结构良好的文本的能力，有望彻底改变编程。人工智能驱动的编码工具大幅缩短任务完成时间以及大量与人工智能相关的裁员声明等案例，都支持这一观点。本文引用了一些消息来源，表明人工智能正在取代程序员，甚至学术计算机科学领域也感受到了压力。\n\n**叙述二：** 这种观点反驳了末日预言。一项研究表明，经验丰富的开发人员在使用人工智能工具时速度较慢。一些工程师认为，人工智能是一种增强而非取代程序员的工具，将其比作木匠的台锯。微软人工智能驱动裁员的说法已被驳斥，该公司澄清裁员范围更广，旨在将资金重新分配给人工智能计划。计算机科学专业人数的下降归因于疫情时代支出后科技市场的更广泛调整。\n\n文章最后得出结论，人工智能的影响是不确定的，并建议读者对极端说法持怀疑态度。它建议忽略过于热情和不屑一顾的观点，关注感兴趣领域中与人工智能相关的切实变化，并谨慎对待人工智能新闻，因为对其真正影响的理解仍然有限。虽然承认人工智能的重要性，但作者强调，其全部潜力和后果仍然很大程度上未知。"
  },
  {
    "id": "44634208",
    "title": "Lslvr/mwm: The smallest (usable) X11 window manager",
    "url": "https://github.com/lslvr/mwm",
    "summary": "This article introduces \"mwm,\" a minimalist X11 window manager boasting a tiny 20 lines of code, designed for users who prioritize simplicity and hackability over features and standards compliance. Mwm eschews all common window manager elements like title bars, borders, mouse control, and virtual desktops, presenting a single fullscreen window at a time.\n\nThe author emphasizes the project's focus on creating software that is understandable and modifiable, contrasting it with the complexity of modern software. Mwm is designed to enable essential window management functions: launching applications, switching between windows, and closing windows.\n\nUsers can customize mwm using the `grab` and `map` macros to assign keybindings for launching applications or performing other actions, with an example configuration provided in `mwm-custom.c`. The build process is simplified with a `build.sh` script. The author implies mwm offers a more minimal alternative to even other tiny WMs like TinyWM while offering a degree of functionality. In essence, mwm is presented as a tool for those seeking complete control over their window management, valuing customizability and minimal resource usage above all else.\n",
    "chinese_title": "Lslvr/mwm: 最小（可用）的X11窗口管理器",
    "chinese_summary": "本文介绍了\"mwm\"，一款极简的X11窗口管理器，仅有20行代码，专为那些优先考虑简洁性和可修改性，而非功能和标准兼容性的用户设计。Mwm摒弃了所有常见的窗口管理器元素，如标题栏、边框、鼠标控制和虚拟桌面，一次只呈现一个全屏窗口。\n\n作者强调该项目的重点是创建易于理解和修改的软件，与现代软件的复杂性形成对比。Mwm旨在实现基本的窗口管理功能：启动应用程序、切换窗口和关闭窗口。\n\n用户可以使用`grab`和`map`宏来自定义mwm，为启动应用程序或执行其他操作分配快捷键，`mwm-custom.c`中提供了一个示例配置。构建过程通过`build.sh`脚本简化。作者暗示mwm提供了比TinyWM等其他小型窗口管理器更简约的替代方案，同时提供了一定程度的功能。本质上，mwm被定位为一款工具，适用于那些寻求完全控制窗口管理，并且最看重可定制性和最小资源使用的用户。"
  },
  {
    "id": "44636240",
    "title": "Covers as a way of learning music and code",
    "url": "https://ntietz.com/blog/covers-as-a-way-of-learning/",
    "summary": "This article argues that creating covers (of music or code) is a valuable learning tool, offering objectivity and insights not found in original works. When learning music, covering a song provides a benchmark for performance, enabling musicians to identify areas for improvement and understand the original artist's choices. By simplifying or altering elements and comparing them to the original, learners gain insight into the \"why\" behind specific techniques.\n\nSimilarly, in programming, reimplementing existing libraries like Boost in C++ allows developers to understand complex concepts like templates and data structures. Attempting to recreate functionality from scratch forces them to confront design decisions and understand the rationale behind specific implementations, learning from experienced programmers by proxy.\n\nThe author addresses the common hesitation to create derivative works due to a perceived lack of originality, encouraging learners to \"do it anyway.\" The existence of a reference point provides an invaluable opportunity for comparison, learning, and growth. The key is to always give credit to the original creator, acknowledging that the work is a cover or reimplementation and not a completely original invention. The author then includes various calls to action: sharing the post, subscribing to a newsletter, contacting them directly, seeking coaching services, or joining/hiring via the Recurse Center.\n",
    "chinese_title": "用翻唱学习音乐和代码",
    "chinese_summary": "本文认为创作翻唱作品（音乐或代码）是一种宝贵的学习工具，能提供原创作品中无法获得的客观性和洞见。在学习音乐时，翻唱一首歌曲可以提供一个演奏基准，使音乐家能够识别需要改进的领域并理解原作者的选择。通过简化或改变元素，并将其与原作进行比较，学习者可以深入了解特定技术背后的“原因”。\n\n类似地，在编程中，用 C++ 重新实现像 Boost 这样的现有库，可以让开发者理解像模板和数据结构这样复杂的概念。从头开始重新创建功能迫使他们面对设计决策，并理解特定实现背后的原理，从而通过代理向经验丰富的程序员学习。\n\n作者解决了由于认为缺乏原创性而对创作衍生作品的常见犹豫，鼓励学习者“无论如何都要去做”。参考点的存在为比较、学习和成长提供了宝贵的机会。关键是要始终向原作者致谢，承认该作品是翻唱或重新实现，而不是完全原创的发明。作者随后提出了各种行动号召：分享帖子、订阅时事通讯、直接联系他们、寻求辅导服务，或通过 Recurse Center 加入/雇用。"
  },
  {
    "id": "44671601",
    "title": "Show HN: Nia – MCP server that gives more context to coding agents",
    "url": "https://www.trynia.ai/",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "Show HN: Nia - 为编码 Agent 提供更多上下文信息的 MCP 服务器",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "44669998",
    "title": "Vet is a safety net for the risky curl | bash pattern",
    "url": "https://github.com/vet-run/vet",
    "summary": "`vet` is a command-line tool designed to mitigate the security risks associated with the common `curl | bash` installation pattern. This pattern, while convenient, involves blindly trusting and executing remote scripts, which can be dangerous due to potential malicious code, compromised servers, or incomplete downloads.\n\n`vet` provides a safer alternative by:\n\n1.  **Fetching** the remote script to a temporary location.\n2.  **Diffing & Reviewing** the script, showing changes since the last execution.\n3.  **Linting** the script (if `shellcheck` is installed) to identify potential bugs or malicious patterns.\n4.  **Confirming** execution, requiring explicit user approval.\n\nInstallation is recommended via Homebrew (`brew tap vet-run/vet && brew install vet-run`), but a manual installation is also provided for security-conscious users. The manual installation emphasizes reviewing the installer script before execution, demonstrating the core principle of `vet`. Usage is straightforward: `vet <URL>`. Options include `--force` for non-interactive execution in trusted environments.\n\n`vet` requires Bash 4+ to leverage modern features for improved robustness and security. Contributions are welcome, with guidelines provided for forking, creating feature branches, testing, and submitting pull requests.\n",
    "chinese_title": "兽医是高风险 curl | bash 模式的安全网",
    "chinese_summary": "`vet` 旨在降低常见 `curl | bash` 安装模式带来的安全风险，它是一个命令行工具。这种模式虽然方便，但涉及盲目信任和执行远程脚本，由于潜在的恶意代码、受损的服务器或不完整的下载，可能非常危险。\n\n`vet` 提供了一种更安全的替代方案：\n\n1.  **获取** 远程脚本到临时位置。\n2.  **差异比较 & 审查** 脚本，显示自上次执行以来的更改。\n3.  **代码检查** 脚本（如果安装了 `shellcheck`）以识别潜在的错误或恶意模式。\n4.  **确认** 执行，需要明确的用户批准。\n\n建议通过 Homebrew 安装（`brew tap vet-run/vet && brew install vet-run`），但也为注重安全的用户提供了手动安装。手动安装强调在执行前审查安装脚本，这体现了 `vet` 的核心原则。用法很简单：`vet <URL>`。选项包括 `--force`，用于在受信任环境中进行非交互式执行。\n\n`vet` 需要 Bash 4+ 才能利用现代功能来提高健壮性和安全性。欢迎贡献，并提供了有关 fork、创建特性分支、测试和提交 pull request 的指南。"
  },
  {
    "id": "44663227",
    "title": "AI overviews cause massive drop in search clicks",
    "url": "https://arstechnica.com/ai/2025/07/research-shows-google-ai-overviews-reduce-website-clicks-by-almost-half/",
    "summary": "A new analysis from the Pew Research Center reveals that Google's AI Overviews are significantly reducing clicks to websites in search results. The study, based on data from 900 users, found that searches without AI Overviews resulted in a 15% click rate, while searches with AI Overviews saw a click rate of only 8%. The research also indicates that just 1% of AI Overviews resulted in a click on a cited source, predominantly to Wikipedia, YouTube, or Reddit.\n\nThe article highlights that users are more likely to end their search session after viewing an AI Overview, potentially leading to the acceptance of inaccurate information due to AI \"hallucinations.\" The increasing prevalence of AI Overviews, triggered more often by longer and question-based searches (appearing in 20% of all searches), amplifies this concern.\n\nGoogle disputes the findings, claiming the study's methodology is flawed and that AI features create new opportunities for website connections. They maintain that billions of clicks are directed to websites daily and haven't observed significant traffic drops. However, the article concludes that the research provides further evidence that Google's AI integration is shifting how people gather information online, benefiting Google financially while potentially harming web publishing. The study was updated on 7/23 to include Google's official statement.\n",
    "chinese_title": "AI概览导致搜索点击量大幅下降",
    "chinese_summary": "皮尤研究中心新分析显示，谷歌AI概览正显著减少搜索结果中的网站点击量。该研究基于900名用户的数据，发现没有AI概览的搜索点击率为15%，而有AI概览的搜索点击率仅为8%。研究还表明，只有1%的AI概览会导致对引用来源的点击，且主要流向维基百科、YouTube或Reddit。\n\n文章强调，用户在查看AI概览后更可能结束搜索会话，可能因AI“幻觉”而接受不准确的信息。AI概览的日益普及，尤其是在更长和基于问题的搜索中（出现在20%的搜索中），加剧了这一担忧。\n\n谷歌对研究结果提出异议，声称该研究的方法存在缺陷，并表示AI功能为网站连接创造了新的机会。他们坚称每天有数十亿次点击导向网站，且未观察到显著的流量下降。然而，文章总结称，该研究进一步证明了谷歌的AI整合正在改变人们在线收集信息的方式，在经济上使谷歌受益，却可能损害网络出版业。该研究已于7月23日更新，包含谷歌的官方声明。"
  },
  {
    "id": "44669631",
    "title": "Thunder Compute (YC S24) Is Hiring a C++ Systems Engineer",
    "url": "https://www.ycombinator.com/companies/thunder-compute/jobs/DhML6Uf-c-systems-engineer",
    "summary": "Thunder Compute (YC S24), a seed-funded GPU cloud platform experiencing rapid revenue growth, is hiring a C++ Systems Engineer to join their 4-person team. The company is relocating its headquarters from Atlanta to either San Francisco or New York City within 6 months.\n\nThe core technical challenge involves building a custom virtualization layer that network-attaches GPUs over TCP for better resource utilization, aiming for a 5x improvement in margins compared to competitors like Lambda Labs. The role focuses on optimizing the C++ core of this platform, including performance optimization, systems debugging, and research into oversubscription and checkpointing.\n\nThe ideal candidate possesses top 0.1% C++ ability, experience optimizing NIC/GPU performance, a deep understanding of low-level networking, and experience in latency-sensitive environments. Strong communication skills and a self-driven attitude are essential. A CS PhD/Masters from a top 50 US university and experience at a trading firm or hardware company like NVIDIA are preferred.\n\nThe position is full-time and offers a salary between $100K - $150K, plus 0.5-1% equity. The C++ Systems Engineer will report to Co-founder/CTO Brian (ex-Citadel quant dev). Thunder Compute aims to be the world's cheapest GPU cloud platform.\n",
    "chinese_title": "Thunder Compute (YC S24) 正在招聘 C++ 系统工程师",
    "chinese_summary": "雷霆计算(YC S24)，一家种子轮融资、收入快速增长的GPU云平台，现招聘一名C++系统工程师加入其4人团队。公司计划在6个月内将总部从亚特兰大迁至旧金山或纽约市。\n\n核心技术挑战在于构建一个定制化的虚拟化层，通过TCP将GPU网络连接，以提高资源利用率，目标是比Lambda Labs等竞争对手提高5倍的利润率。该职位专注于优化此平台的C++核心，包括性能优化、系统调试以及对超额认购和检查点技术的研究。\n\n理想的候选人应具备顶尖的C++能力，优化NIC/GPU性能的经验，对底层网络有深刻的理解，以及在对延迟敏感的环境中的经验。 强大的沟通能力和自我驱动的态度至关重要。 拥有美国排名前50大学的计算机科学博士/硕士学位，以及在贸易公司或像NVIDIA这样的硬件公司的经验者优先。\n\n该职位为全职，薪资在10万至15万美元之间，外加0.5-1%的股权。 C++系统工程师将向联合创始人/首席技术官Brian（前Citadel量化开发人员）汇报。雷霆计算的目标是成为世界上最便宜的GPU云平台。"
  },
  {
    "id": "44661846",
    "title": "CARA – High precision robot dog using rope",
    "url": "https://www.aaedmusa.com/projects/cara",
    "summary": "CARA (Capstans Are Really Awesome) is the author's latest quadrupedal robot, notable for using capstan drives with rope instead of gears or pulleys for joint movement. This design offers advantages like zero backlash, high torque transparency, and quiet operation.\n\nA key focus was achieving a precise 8:1 gear ratio in the capstan drives, overcoming initial inaccuracies by using a numerical approach based on the rope's effective diameter. The robot's leg design employs a compact 5-bar linkage powered by capstan drives, with each joint driven by a BLDC motor and controlled by an ODrive. The robot's structural frame uses carbon fiber tubes for its high strength-to-weight ratio.\n\nCARA is programmed with homing sequences, inverse/forward/rotation kinematics for precise movement, and a cycloidal step trajectory for a smooth, natural-looking gait. Crucially, CARA features stability control, allowing it to maintain balance on inclines and recover from external forces, both while standing and walking.\n\nFuture improvements include a higher capacity battery, more durable foot material (potentially silicone), and improved gait sequencing to overcome obstacles. The author also envisions adding features like wheels, attachments like a GoPro or LiDAR sensor, and increased autonomous capabilities through object detection. The next project planned is a smaller, more builder-friendly version of CARA, complete with a build guide.\n",
    "chinese_title": "CARA – 使用绳索的高精度机器狗",
    "chinese_summary": "CARA（绞盘真的很棒）是作者最新的四足机器人，其显著特点是使用带绳索的绞盘驱动装置，而不是齿轮或滑轮来进行关节运动。这种设计具有零间隙、高扭矩透明度和安静运行等优点。\n\n一个关键的重点是在绞盘驱动器中实现精确的8:1齿轮比，通过使用基于绳索有效直径的数值方法来克服最初的精度不足。该机器人的腿部设计采用紧凑的五杆联动机构，由绞盘驱动器提供动力，每个关节由BLDC电机驱动，并由ODrive控制。该机器人的结构框架使用碳纤维管，以获得其高强度重量比。\n\nCARA 采用归位序列、逆/正/旋转运动学进行精确运动，并采用摆线步长轨迹实现平稳、自然的步态。至关重要的是，CARA 具有稳定性控制，使其能够在斜坡上保持平衡，并在站立和行走时从外力中恢复。\n\n未来的改进包括更大容量的电池、更耐用的足部材料（可能是硅胶）以及改进的步态序列以克服障碍物。作者还设想增加诸如轮子、GoPro 或 LiDAR 传感器之类的附件，以及通过物体检测来增强自主能力。计划的下一个项目是 CARA 的更小、更便于构建的版本，并附带构建指南。"
  },
  {
    "id": "44632314",
    "title": "Writing is thinking",
    "url": "https://www.nature.com/articles/s44222-025-00323-4",
    "summary": "This article, titled \"Writing is Thinking,\" argues for the continued importance of human-generated scientific writing in the age of large language models (LLMs). While LLMs can generate scientific articles quickly, the author contends that the act of writing itself is crucial for scientific thinking. Writing allows researchers to structure their thoughts, identify the core message of their work, and engage with their findings in a deeper, more meaningful way. This idea is backed by scientific evidence showing that handwriting can enhance brain connectivity and memory.\n\nThe article acknowledges the potential benefits of LLMs, such as aiding in grammar, literature searching, brainstorming, and overcoming writer's block. However, it cautions against relying solely on LLMs for writing, as these models lack accountability and can generate inaccurate information (\"hallucinations\"). Editing LLM-generated text can be more time-consuming than writing from scratch because it requires understanding the LLM's reasoning.\n\nThe author suggests that outsourcing the entire writing process to LLMs deprives researchers of the opportunity to reflect on their field and shape their findings into a compelling narrative, a skill that has value beyond scientific writing. The article ultimately advocates for a balanced approach, where LLMs are used as tools to augment, rather than replace, human scientific writing.\n",
    "chinese_title": "写作即思考",
    "chinese_summary": "这篇题为《写作即思考》的文章论证了在大语言模型（LLM）时代，人工撰写科学文章仍然至关重要。虽然LLM可以快速生成科学文章，但作者认为写作行为本身对于科学思考至关重要。写作使研究人员能够构建他们的思想，明确其工作的核心信息，并以更深入、更有意义的方式参与他们的发现。这一观点得到了科学证据的支持，这些证据表明手写可以增强大脑的连接性和记忆力。\n\n文章承认LLM的潜在好处，例如辅助语法、文献检索、集思广益和克服写作障碍。然而，文章告诫不要仅仅依赖LLM进行写作，因为这些模型缺乏责任感，并且可能生成不准确的信息（“幻觉”）。编辑LLM生成的文本可能比从头开始写作更耗时，因为它需要理解LLM的推理过程。\n\n作者认为，将整个写作过程外包给LLM剥夺了研究人员反思其领域并将他们的发现塑造成引人入胜的叙述的机会，而这种技能在科学写作之外也具有价值。文章最终倡导一种平衡的方法，即使用LLM作为工具来增强而不是取代人工科学写作。"
  },
  {
    "id": "44670319",
    "title": "A valid HTML zip bomb",
    "url": "https://ache.one/notes/html_zip_bomb",
    "summary": "This article describes the creation and implementation of a valid HTML zip bomb designed to exhaust the resources of aggressive web crawlers. The author aims to combat LLM web crawlers that disregard `robots.txt` by creating a small, pre-compressed file that expands to a large size when decompressed, overwhelming the crawler's RAM.\n\nThe author created a Gzip bomb consisting of 10MB of repeated \"H\" characters wrapped within an HTML comment, ensuring the initial HTML parsing is valid. This bomb is then served using Nginx with the `ngx_http_gzip_static_module`, pre-compressing the file and preventing the server from decompressing it. The Nginx configuration serves the pre-compressed file (Gzip or Brotli) directly if the client supports the encoding.\n\nThe author tests the bomb in Firefox and Chrome, both of which crash due to out-of-memory errors, demonstrating the potential to crash Selenium-type web crawlers.  They ensure the bomb is disallowed in `robots.txt` to avoid impacting legitimate crawlers.\n\nThe article concludes by discussing potential improvements, like varying the HTML structure to prevent parser optimizations, and notes the availability of a Brotli version of the bomb for even greater compression efficiency.\n",
    "chinese_title": "有效的HTML压缩炸弹",
    "chinese_summary": "本文描述了一种有效的HTML zip炸弹的创建和实现，旨在耗尽侵略性网络爬虫的资源。作者旨在通过创建一个小型、预压缩的文件来对抗无视`robots.txt`的LLM网络爬虫，该文件解压缩后会扩展到很大的尺寸，从而压垮爬虫的RAM。\n\n作者创建了一个Gzip炸弹，包含10MB的重复“H”字符，包裹在HTML注释中，以确保初始HTML解析有效。然后使用Nginx和`ngx_http_gzip_static_module`来提供此炸弹，预压缩该文件并防止服务器解压缩它。如果客户端支持该编码，Nginx配置会直接提供预压缩文件（Gzip或Brotli）。\n\n作者在Firefox和Chrome中测试了该炸弹，两者都因内存不足错误而崩溃，证明了其崩溃Selenium类型网络爬虫的潜力。他们确保在`robots.txt`中禁止该炸弹，以避免影响合法的爬虫。\n\n文章最后讨论了潜在的改进，例如改变HTML结构以防止解析器优化，并指出Brotli版本的炸弹可用于更高的压缩效率。"
  },
  {
    "id": "44633809",
    "title": "Global earthquake detection and warning using Android phones",
    "url": "https://doi.org/10.1126/science.ads4779",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "利用安卓手机进行全球地震探测和预警",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "44670624",
    "title": "AMD CEO says U.S.-made TSMC chips are 5%-20% more expensive, but worth it",
    "url": "https://www.tomshardware.com/tech-industry/amd-ceo-says-u-s-made-tsmc-chips-are-more-expensive-but-worth-it-costs-more-than-5-percent-but-less-than-20-percent-higher-than-taiwan-sourced-alternative",
    "summary": "AMD CEO Lisa Su stated that chips manufactured at TSMC's Arizona facility are more expensive (5%-20%) than those from their Taiwan facilities. While acknowledging the higher cost, Su emphasized the importance of a resilient supply chain, highlighting lessons learned during the pandemic where relying solely on the lowest cost wasn't sufficient. She views U.S. manufacturing as a worthwhile investment for reliability and security.\n\nTSMC Arizona has reportedly begun producing 4nm chips with comparable quality to Taiwan, and despite the slightly higher costs (estimated around 10% more), customers are willing to pay the premium, with production sold out until late 2027. AMD expects to receive chips from TSMC Arizona by the end of the year, joining Apple as early recipients of \"made in America\" chips. Nvidia is also sourcing some Blackwell system production from the site.\n\nThe developments signal a win for the U.S. government's efforts to revitalize domestic semiconductor manufacturing, despite the associated cost increases.\n",
    "chinese_title": "AMD CEO表示，美国产台积电芯片贵5%-20%，但物有所值。",
    "chinese_summary": "AMD CEO苏姿丰表示，台积电亚利桑那州工厂生产的芯片比台湾工厂生产的芯片成本更高（5%-20%）。虽然承认成本较高，但苏姿丰强调了弹性供应链的重要性，并强调了疫情期间的教训，即仅仅依靠最低成本是不够的。她认为美国制造是值得为可靠性和安全性进行的投资。\n\n据报道，台积电亚利桑那州工厂已开始生产质量与台湾相当的4纳米芯片，尽管成本略高（估计高出10%左右），但客户愿意支付溢价，产品已售罄至2027年底。AMD预计将在今年年底前收到来自台积电亚利桑那州工厂的芯片，与苹果一起成为“美国制造”芯片的早期接收者。英伟达也正在从该基地采购一些Blackwell系统的生产。\n\n这些进展标志着美国政府振兴国内半导体制造业的努力取得了胜利，尽管随之而来的是成本的增加。"
  },
  {
    "id": "44669853",
    "title": "Web fingerprinting is worse than I thought (2023)",
    "url": "https://www.bitestring.com/posts/2023-03-19-web-fingerprinting-is-worse-than-I-thought.html",
    "summary": "This article explores the issue of web fingerprinting, a technique that websites use to identify users across different sessions without relying on cookies or other persistent storage. The author highlights how fingerprinting collects data about a user's browser and hardware configuration (browser version, CPU count, screen size, etc.) to generate a unique ID.\n\nThe article focuses on FingerprintJS, a company that sells fingerprinting as a service, demonstrating how their technology can accurately identify users even in private browsing mode or after clearing browser data. The author tests FingerprintJS's demo across different browsers: Firefox, Chromium (Chrome), and Tor Browser.\n\nThe results show that Firefox in its default configuration and Chromium are vulnerable to fingerprinting, allowing FingerprintJS to link browsing sessions. Enabling `privacy.resistFingerprinting = true` in Firefox effectively mitigates fingerprinting by masking certain browser properties. Tor Browser, designed for privacy, also successfully prevents fingerprinting.\n\nThe author concludes that web fingerprinting undermines online privacy and that clearing cookies or using private browsing mode alone is insufficient protection. To defend against fingerprinting, the author recommends using Tor Browser or Firefox with `privacy.resistFingerprinting = true`. Brave browser is mentioned as an alternative for Chromium users, although not fully endorsed due to its reliance on Google's engine. VPNs are noted to be ineffective against fingerprinting as they only mask IP addresses.\n",
    "chinese_title": "Web指纹比我想象的更糟糕 (2023)",
    "chinese_summary": "本文探讨了网站指纹识别的问题。网站指纹识别是一种网站用来识别不同会话中的用户，而无需依赖 Cookie 或其他持久性存储的技术。作者强调指纹识别如何收集有关用户浏览器和硬件配置（浏览器版本、CPU 数量、屏幕尺寸等）的数据，以生成唯一的 ID。\n\n文章重点介绍了 FingerprintJS 这家将指纹识别作为一种服务出售的公司，展示了他们的技术如何能够准确地识别用户，即使在隐私浏览模式下或清除浏览器数据后也是如此。作者在不同的浏览器上测试了 FingerprintJS 的演示：Firefox、Chromium (Chrome) 和 Tor Browser。\n\n结果表明，默认配置下的 Firefox 和 Chromium 容易受到指纹识别的攻击，使得 FingerprintJS 能够关联浏览会话。在 Firefox 中启用 `privacy.resistFingerprinting = true` 可以有效地缓解指纹识别，方法是屏蔽某些浏览器属性。专为隐私设计的 Tor Browser 也成功地阻止了指纹识别。\n\n作者得出结论，网站指纹识别破坏了在线隐私，仅仅清除 Cookie 或使用隐私浏览模式不足以提供保护。为了防御指纹识别，作者建议使用 Tor Browser 或启用 `privacy.resistFingerprinting = true` 的 Firefox。 Brave 浏览器被提及作为 Chromium 用户的替代方案，但由于其对 Google 引擎的依赖，并未完全认可。 VPN 被认为对指纹识别无效，因为它们仅屏蔽 IP 地址。"
  },
  {
    "id": "44665815",
    "title": "BGP.Tools: Browse the Internet Ecosystem",
    "url": "https://bgp.tools/",
    "summary": "BGP.Tools is a website offering tools to browse and analyze the internet ecosystem, particularly focusing on BGP (Border Gateway Protocol) data. It provides a user-friendly interface with frequently updated external data, aiming to be a valuable resource for understanding internet routing.\n\nThe site identifies the user's connection details, including their IPv4 address (172.200.183.244), associated organization (Microsoft Corporation - AS8075), and the assigned IP range (172.200.0.0/13). It also attempts to measure latency (Layer 7 and Layer 4) and MSS (Maximum Segment Size), though the results are initially unavailable and marked as \"Probing...\".\n\nThe website offers a \"Looking Glass\" feature and provides examples such as Cloudflare, LINX LON1, and Google DNS Prefix. It also maintains a changelog documenting recent updates, with entries listed from July 2025 to October 2024.\n\nBGP.Tools offers near real-time BGP data, and user-friendly interfaces for free. Paid users gain access to additional services like BGP network monitoring and IRR (Internet Routing Registry) database monitoring.\n",
    "chinese_title": "BGP.Tools：浏览互联网生态系统",
    "chinese_summary": "BGP.Tools 是一个网站，提供浏览和分析互联网生态系统的工具，尤其侧重于 BGP（边界网关协议）数据。它提供了一个用户友好的界面，包含频繁更新的外部数据，旨在成为理解互联网路由的宝贵资源。\n\n该网站识别用户的连接详情，包括 IPv4 地址 (172.200.183.244)、相关组织（Microsoft Corporation - AS8075）和分配的 IP 范围 (172.200.0.0/13)。 它还尝试测量延迟（第 7 层和第 4 层）和 MSS（最大分段大小），但结果最初不可用，并标记为“探测中...”。\n\n该网站提供“Looking Glass”功能，并提供 Cloudflare、LINX LON1 和 Google DNS Prefix 等示例。 它还维护一个变更日志，记录最近的更新，条目从 2025 年 7 月到 2024 年 10 月不等。\n\nBGP.Tools 免费提供近乎实时的 BGP 数据和用户友好的界面。 付费用户可以访问额外的服务，如 BGP 网络监控和 IRR（互联网路由注册表）数据库监控。"
  },
  {
    "id": "44671472",
    "title": "A list of changes to make it easier to build beautiful and walkable places",
    "url": "https://chrisbarber.co/A+list+of+changes+to+make+it+easier+to+build+beautiful+%26+walkable+places",
    "summary": "This article by Chris Barber likely outlines a series of changes needed to facilitate the construction of aesthetically pleasing and pedestrian-friendly environments. While the specific changes are not provided in the prompt, we can infer some common themes and suggestions based on the general principles of urban planning and walkability:\n\nThe article probably argues that current regulations and practices often hinder the creation of desirable urban spaces. Potential changes might include:\n\n*   **Zoning Reform:** Moving away from strict single-use zoning to allow for mixed-use developments that combine residential, commercial, and recreational spaces within walkable distances. This could involve allowing for higher density housing in appropriate areas and reducing parking requirements.\n\n*   **Streamlining Permitting:** Reducing bureaucratic obstacles and simplifying the approval process for developers building walkable, mixed-use projects. This can involve faster review times and clearer, more predictable regulations.\n\n*   **Prioritizing Pedestrian and Cyclist Infrastructure:** Investing in sidewalks, bike lanes, and pedestrian crossings to create safe and comfortable environments for non-motorized transportation.\n\n*   **Encouraging Public Transit:** Expanding and improving public transportation options to reduce reliance on cars and promote walkability near transit hubs.\n\n*   **Design Guidelines:** Implementing design guidelines that prioritize aesthetic appeal, human scale, and community character, ensuring new developments contribute to the beauty and vibrancy of the public realm.\n\n*   **Parking Reform:** Reducing or eliminating minimum parking requirements, allowing developers to build less parking and invest more in pedestrian-friendly amenities.\n\n*   **Financial Incentives:** Offering tax breaks or other financial incentives to developers who build walkable, mixed-use projects.\n\nThe core argument would be that implementing these changes will lead to more livable, economically vibrant, and environmentally sustainable communities.\n",
    "chinese_title": "打造优美宜居街区的一系列改进建议",
    "chinese_summary": "克里斯·巴伯的这篇文章可能概述了一系列为促进美观且利于行人的环境建设所需的变革。虽然提示中未提供具体变更，但我们可以根据城市规划和步行友好性的总体原则推断出一些常见主题和建议：\n\n这篇文章可能认为，当前的法规和实践常常阻碍了理想城市空间的创造。潜在的变更可能包括：\n\n*   **分区改革：** 摆脱严格的单一用途分区，允许混合用途开发，在步行距离内结合住宅、商业和休闲空间。这可能涉及在适当区域允许更高密度住宅，并减少停车位要求。\n\n*   **简化许可流程：** 减少官僚障碍，简化开发商建设步行友好型混合用途项目的审批流程。这可能涉及更快的审查时间和更清晰、更可预测的法规。\n\n*   **优先发展行人和自行车基础设施：** 投资建设人行道、自行车道和人行横道，为非机动交通创造安全舒适的环境。\n\n*   **鼓励公共交通：** 扩大和改善公共交通选择，以减少对汽车的依赖，并促进交通枢纽附近的步行友好性。\n\n*   **设计指南：** 实施优先考虑美学吸引力、人体尺度和社区特征的设计指南，确保新开发项目有助于公共领域的美丽和活力。\n\n*   **停车改革：** 减少或取消最低停车位要求，允许开发商建设更少的停车位，并将更多资金投入到利于行人的设施中。\n\n*   **财政激励：** 为建设步行友好型混合用途项目的开发商提供税收减免或其他财政激励。\n\n核心论点是，实施这些变更将带来更宜居、经济更具活力、环境更可持续的社区。"
  },
  {
    "id": "44666896",
    "title": "Apache HTTP Server: 'RewriteCond expr' always evaluates to true",
    "url": "https://github.com/apache/httpd/commit/8abb3d06b23975705ebcf4bf4476464fd0b9bd0b",
    "summary": "This article highlights a bug fix in the Apache HTTP Server's `mod_rewrite` module, specifically in the `mod_rewrite.c` file. The issue was that the 'RewriteCond expr' always evaluated to true, regardless of the actual condition being tested.\n\nThe fix addresses a flaw in the `apply_rewrite_cond` function. The original code unconditionally set the return code (`rc`) to `COND_RC_MATCH` if the condition was not a regular expression. The corrected code introduces a check to ensure that the result of the condition evaluation (`rc`) is greater than 0 before setting `rc` to `COND_RC_MATCH`. This ensures that the RewriteCond expression correctly reflects the condition's actual outcome, resolving the \"always true\" evaluation. The change also updates the backreference information (`briRC`).\n\nEssentially, a line of code was added to properly handle the evaluation of non-regex `RewriteCond` directives, preventing them from always evaluating to true, leading to unintended rewrite behavior. This ensures that the `RewriteCond` directives function as expected, allowing for more accurate and controlled URL rewriting.\n",
    "chinese_title": "Apache HTTP服务器：“RewriteCond expr”总是求值为真",
    "chinese_summary": "本文重点介绍了 Apache HTTP 服务器 `mod_rewrite` 模块中的一个 bug 修复，具体位于 `mod_rewrite.c` 文件中。该问题表现为 'RewriteCond expr' 总是评估为 true，而忽略了实际被测试的条件。\n\n该修复解决了一个 `apply_rewrite_cond` 函数中的缺陷。原始代码无条件地将返回代码（`rc`）设置为 `COND_RC_MATCH`，如果该条件不是正则表达式。修正后的代码引入了一个检查，以确保条件评估的结果（`rc`）大于 0，然后才将 `rc` 设置为 `COND_RC_MATCH`。这确保了 RewriteCond 表达式能够正确反映条件的实际结果，从而解决了“总是为真”的评估问题。此更改还更新了反向引用信息 (`briRC`)。\n\n本质上，添加了一行代码来正确处理非 regex `RewriteCond` 指令的评估，防止它们总是评估为 true，从而避免了意外的重写行为。这确保了 `RewriteCond` 指令能够按预期工作，从而实现更准确和可控的 URL 重写。"
  },
  {
    "id": "44671375",
    "title": "Transformers Without Normalization",
    "url": "https://arxiv.org/abs/2503.10622",
    "summary": "This arXiv article, titled \"Transformers without Normalization,\" presents a novel approach to building Transformer networks that eliminates the need for traditional normalization layers. The authors, Jiachen Zhu, Xinlei Chen, Kaiming He, Yann LeCun, and Zhuang Liu, propose a simple yet effective replacement: Dynamic Tanh (DyT). DyT is an element-wise operation, defined as `DyT(x) = tanh(alpha * x)`, inspired by the S-shaped input-output mappings often observed in Transformer layer normalization.\n\nThe core finding is that Transformers incorporating DyT can achieve performance comparable to or even exceeding that of their normalized counterparts across diverse tasks. The researchers demonstrate the effectiveness of DyT in settings ranging from image recognition to text generation, and from supervised to self-supervised learning. Importantly, this performance boost is achieved mostly without extensive hyperparameter tuning.\n\nThe authors argue that these results challenge the long-held belief that normalization layers are essential in modern neural networks, providing new insights into their role in deep learning. The paper was submitted to CVPR 2025 and includes a project page (linked in the abstract). The article is categorized under Machine Learning (cs.LG) along with Artificial Intelligence (cs.AI), Computation and Language (cs.CL), and Computer Vision and Pattern Recognition (cs.CV). The article has been revised once since its initial submission.\n",
    "chinese_title": "不使用归一化的Transformer",
    "chinese_summary": "这篇题为“无归一化Transformer”的arXiv文章提出了一种构建Transformer网络的新方法，该方法消除了对传统归一化层的需求。作者朱嘉晨、陈新磊、何恺明、Yann LeCun和刘壮提出了一种简单而有效的替代方案：动态Tanh (DyT)。 DyT是一种逐元素操作，定义为`DyT(x) = tanh(alpha * x)`，其灵感来自于Transformer层归一化中常见的S形输入-输出映射。\n\n核心发现是，包含DyT的Transformer可以在各种任务中实现与归一化Transformer相当甚至超过的性能。 研究人员证明了DyT在从图像识别到文本生成，以及从监督学习到自监督学习等设置中的有效性。 重要的是，这种性能提升主要是在没有进行大量超参数调整的情况下实现的。\n\n作者认为，这些结果挑战了长期以来认为归一化层在现代神经网络中必不可少的观点，并为它们在深度学习中的作用提供了新的见解。 该论文已提交至CVPR 2025，并包含一个项目页面（链接在摘要中）。 该文章被归类于机器学习（cs.LG），以及人工智能（cs.AI）、计算与语言（cs.CL）和计算机视觉与模式识别（cs.CV）类别下。 该文章自首次提交以来已经过一次修订。"
  },
  {
    "id": "44669318",
    "title": "XOR_singleheader: Header-only binary fuse and XOR filter library",
    "url": "https://github.com/FastFilter/xor_singleheader",
    "summary": "This header-only C library provides implementations of Binary Fuse and Xor Filters, offering faster and more compact alternatives to Bloom filters for membership testing. Unlike Bloom filters, these filters are easily compressible. The library supports both 8-bit (`binary_fuse8_t`) and 16-bit (`binary_fuse16_t`) versions, trading memory usage for lower false-positive probabilities.\n\nThe library provides functions for allocation, population, containment testing, and deallocation of the filters. Serialization and deserialization are supported in both unpacked (faster) and packed (potentially smaller) formats, with example code provided.  The library assumes 64-bit integer keys, requiring hashing for other data types.\n\nThe documentation also provides C++ examples and information about memory requirements (24 bytes per entry during construction), testing, and benchmarking instructions. It emphasizes the importance of bug reports and fixes while discouraging issues based solely on static analyzer warnings unless a genuine bug is identified. Finally, it includes links to implementations in other programming languages.\n",
    "chinese_title": "XOR_singleheader: 仅头文件的二进制融合和XOR过滤器库",
    "chinese_summary": "此仅头文件C库提供了Binary Fuse和Xor Filter的实现，为成员资格测试提供了比Bloom Filter更快更紧凑的替代方案。与Bloom Filter不同，这些过滤器易于压缩。该库支持8位(`binary_fuse8_t`)和16位(`binary_fuse16_t`)版本，以内存使用换取更低的假阳性概率。\n\n该库提供了过滤器分配、填充、包含测试和释放的函数。序列化和反序列化支持解包（更快）和打包（可能更小）两种格式，并提供了示例代码。该库假定使用64位整数键，对于其他数据类型需要进行哈希处理。\n\n文档还提供了C++示例以及关于内存需求（构建期间每个条目24字节）、测试和基准测试说明的信息。它强调了错误报告和修复的重要性，同时不鼓励仅基于静态分析器警告的问题，除非识别出真正的错误。最后，它包含了指向其他编程语言实现的链接。"
  },
  {
    "id": "44629805",
    "title": "Distillation makes AI models smaller and cheaper",
    "url": "https://www.quantamagazine.org/how-distillation-makes-ai-models-smaller-and-cheaper-20250718/",
    "summary": "This article from Quanta Magazine discusses knowledge distillation, a fundamental technique in AI used to create smaller, more efficient AI models. The core idea involves using a large, expensive \"teacher\" model to train a smaller, less resource-intensive \"student\" model.\n\nThe concept originated from a 2015 Google paper by Geoffrey Hinton and others, who sought to transfer \"dark knowledge\" – information about the relative likelihood of incorrect answers – from complex ensemble models to a single, leaner model. This is achieved by using \"soft targets,\" which are probability distributions over different classifications, rather than just the single most likely answer. This allows the student to understand the relationships between categories.\n\nWhile initially overlooked, distillation gained prominence as AI models grew in size and cost. It became a popular method for reducing the computational burden of large models like BERT, leading to the development of more efficient versions like DistilBERT. Distillation is now widely used and offered as a service by major tech companies.\n\nThe article addresses concerns raised by the DeepSeek R1 chatbot, which was rumored to have used distillation to mimic OpenAI's o1 model. It clarifies that direct distillation requires access to the internal workings of the teacher model, but a student model can learn from a teacher through carefully designed prompts and answers.\n\nThe article concludes by noting ongoing research into new applications of distillation, such as training chain-of-thought reasoning models, highlighting its continued importance in the field of AI.\n",
    "chinese_title": "蒸馏让AI模型更小更便宜",
    "chinese_summary": "知识蒸馏：AI模型瘦身的利器\n\nQuanta Magazine的这篇文章探讨了知识蒸馏，这是一种AI领域的基础技术，用于创建更小、更高效的AI模型。其核心思想是使用一个大型、昂贵的“教师”模型来训练一个较小、资源消耗较少的“学生”模型。\n\n这个概念源于Geoffrey Hinton等人于2015年发表的一篇谷歌论文，他们试图将“暗知识”（关于错误答案的相对可能性的信息）从复杂的集成模型转移到一个更精简的单一模型。这是通过使用“软目标”实现的，软目标是不同分类的概率分布，而不是仅仅是最可能的答案。这使得学生能够理解类别之间的关系。\n\n尽管最初被忽视，但随着AI模型规模和成本的增长，蒸馏变得越来越重要。它成为一种流行的减少大型模型（如BERT）计算负担的方法，从而促成了DistilBERT等更高效版本的开发。蒸馏现在被广泛使用，并被主要科技公司作为一项服务提供。\n\n这篇文章还探讨了DeepSeek R1聊天机器人引发的担忧，据传该机器人使用了蒸馏来模仿OpenAI的o1模型。文章澄清说，直接蒸馏需要访问教师模型的内部运作方式，但学生模型可以通过精心设计的提示和答案从教师那里学习。\n\n文章最后指出，目前正在进行对蒸馏新应用的研究，例如训练思维链推理模型，突显了其在AI领域中的持续重要性。"
  },
  {
    "id": "44666157",
    "title": "Electric cars produce far less brake dust pollution than combustion-engine cars",
    "url": "https://modernengineeringmarvels.com/2025/07/22/surprising-science-how-electric-cars-quietly-transform-urban-air/",
    "summary": "This article highlights the significant reduction in brake dust pollution achieved by electric vehicles (EVs) compared to combustion-engine cars. A study by EIT Urban Mobility in London, Milan, and Barcelona found an 83% decrease in brake dust pollution from EVs due to regenerative braking, which utilizes the motor to decelerate and reduces the reliance on traditional friction brakes.\n\nBrake dust, composed of harmful particles like iron, copper, and zinc, contributes significantly to urban air pollution. Studies indicate that brake wear accounts for a substantial portion of non-exhaust traffic-related PM10, posing health risks, especially for vulnerable populations in urban areas, linked to respiratory and cardiovascular issues.\n\nWhile EVs may have slightly higher tire wear, the study found brake dust to be a more significant source of airborne particulate pollution. Overall, EVs produce 38% less particulate pollution than gasoline cars, even when considering tire, brake, and road wear, before accounting for tailpipe emissions. The article cites California's experience, where increased EV adoption has correlated with reduced air pollution and asthma emergencies.\n\nThe article underscores the need for policymakers to address non-exhaust emissions, particularly brake wear, with upcoming regulations like Euro 7. Technological innovations like enclosed brake drum systems and specialized tire compounds are also emerging. However, the report emphasizes that shifting commuters from private cars to public transport, cycling, or walking offers the most substantial reduction in non-exhaust emissions. Nevertheless, the adoption of EVs with regenerative braking is a significant step towards cleaner urban air quality.\n",
    "chinese_title": "电动汽车产生的刹车粉尘污染远低于燃油车。",
    "chinese_summary": "电动汽车显著减少刹车粉尘污染：研究表明再生制动大幅降低排放"
  },
  {
    "id": "44661682",
    "title": "The Promised LAN",
    "url": "https://tpl.house/",
    "summary": "The Promised LAN is a private, always-on LAN party network established in 2021, documented on a website as a resource for members and prospective members. It emphasizes a balance of social and technical aspects, detailed in its Manifesto.\n\nThe network employs a backbone architecture to maintain scalability. Individual LAN segments connect to the closest backbone node, which are independently operated using strongSwan and iked, and these nodes peer over IPSec links using specific cryptographic algorithms for IKE and Child SAs (HMAC SHA2 512, AES 256/ChaCha20 Poly1305, and Curve25519 respectively). The backbone operates on a dedicated /24 allocation, with BGP (bird/bgpd) used to advertise user LANs.\n\nDNS is managed using the non-standard \".tpl\" TLD, with authoritative nameservers hosted across different LANs for redundancy. Each LAN is expected to run its own authoritative nameserver at a fixed IP, and recursive resolvers running unbound are anycasted on the backbone.\n\nFor TLS-enabled services, the LAN operates its own x509 Certificate Authorities with a three-year lifecycle, issuing roots using ECDSA P-384 keys and SHA384 signatures, constrained to DNS:.tpl and email:.tpl. Certificate issuance is automated via SSH, verifying the requested SAN against DNS TXT records containing OpenSSH public keys. This approach avoids the complexity of ACME while still providing secure certificate management within the controlled environment of the Promised LAN.\n",
    "chinese_title": "约定的局域网",
    "chinese_summary": "应许之地局域网是一个私有的、永久在线的局域网聚会网络，于2021年建立，并在一个网站上记录，作为成员和潜在成员的资源。它强调社交和技术方面的平衡，并在其宣言中详细说明。\n\n该网络采用骨干架构来保持可扩展性。各个局域网段连接到最近的骨干节点，这些节点使用strongSwan和iked独立运行，并且这些节点通过IPSec链接使用特定的加密算法进行IKE和子SA（分别为HMAC SHA2 512、AES 256/ChaCha20 Poly1305和Curve25519）进行对等互联。骨干网在一个专用的/24分配上运行，并使用BGP (bird/bgpd)来广播用户局域网。\n\nDNS使用非标准的\".tpl\" TLD进行管理，授权域名服务器托管在不同的局域网中以实现冗余。每个局域网都应以固定的IP运行其自己的授权域名服务器，并且运行unbound的递归解析器在骨干网上进行任播。\n\n对于启用TLS的服务，该局域网运行自己的x509证书颁发机构，其生命周期为三年，使用ECDSA P-384密钥和SHA384签名颁发根证书，限制为DNS:.tpl和email:.tpl。证书颁发通过SSH自动完成，根据包含OpenSSH公钥的DNS TXT记录验证请求的SAN。这种方法避免了ACME的复杂性，同时仍在应许之地局域网的受控环境中提供安全的证书管理。"
  },
  {
    "id": "44669858",
    "title": "WiX Toolset: Introduce the Open Source Maintenance Fee",
    "url": "https://github.com/wixtoolset/issues/issues/8974",
    "summary": "This document outlines a proposal to introduce an \"Open Source Maintenance Fee\" for the WiX Toolset, starting with version 6.0 on April 5th, 2025. The fee is intended to provide sustainable funding for ongoing maintenance tasks.\n\nThe fee will be mandatory for all revenue-generating consumers of the WiX Toolset and will be enforced via an EULA included with binary releases on GitHub and NuGet.org. Users can pay via GitHub Sponsors, with tiered pricing based on company size: $10/month for small organizations (under 20 people), $40/month for medium organizations (20-100 people), and $60/month for large organizations (over 100 people).\n\nCustomers of WiX Developer Direct are exempt from the maintenance fee, as it's included in their support agreement.\n\nThe proposal includes action items such as finalizing the EULA with lawyers, adding the EULA to .nupkgs, setting up GitHub Sponsorship tiers, and updating the README. The initial reaction to the proposal has been mixed, with a variety of positive and negative reactions expressed through GitHub issue reactions.\n",
    "chinese_title": "WiX工具集：引入开源维护费",
    "chinese_summary": "本文件概述了一项提议，旨在为 WiX 工具集引入“开源维护费”，自 2025 年 4 月 5 日发布的 6.0 版本开始实施。该费用旨在为持续维护工作提供可持续的资金。\n\n对于所有通过 WiX 工具集产生收入的消费者，该费用是强制性的，并将通过包含在 GitHub 和 NuGet.org 二进制发布版本中的 EULA 来执行。用户可以通过 GitHub Sponsors 支付，费用分级基于公司规模：小型组织（20 人以下）每月 10 美元，中型组织（20-100 人）每月 40 美元，大型组织（100 人以上）每月 60 美元。\n\nWiX Developer Direct 的客户免除维护费，因为它已包含在他们的支持协议中。\n\n该提议包括以下行动项目：与律师最终确定 EULA、将 EULA 添加到 .nupkgs、设置 GitHub Sponsorship 等级以及更新 README。对此提议的初步反应褒贬不一，通过 GitHub 议题的反应表达了各种正面和负面的意见。"
  },
  {
    "id": "44672450",
    "title": "OpenAI prepares to launch GPT-5 in August",
    "url": "https://www.theverge.com/notepad-microsoft-newsletter/712950/openai-gpt-5-model-release-date-notepad",
    "summary": "This article reports on the anticipated launch of OpenAI's GPT-5 in early August. According to sources and a hint from OpenAI CEO Sam Altman, the new model boasts improved capabilities, including advanced reasoning (o3), and will come in mini and nano versions accessible through the API. GPT-5 aims to unify OpenAI's models and potentially reach AGI, which would impact Microsoft's stake in OpenAI's profits.\n\nThe article also mentions an imminent release of an open-source language model \"similar to o3 mini\" from OpenAI, expected before GPT-5's debut.\n\nBeyond OpenAI news, the article highlights Microsoft's recent security issues, including a SharePoint vulnerability exploited by Chinese hacking groups and concerns about Microsoft's practice of using engineers based in China to assist with the US Defense Department’s computer systems. Microsoft is responding to the latter concern by limiting escort programs to only US-based employees for government cloud data centers.\n\nOther topics covered include:\n\n*   Microsoft working on Windows 11 performance improvements.\n*   Abrupt closure of Microsoft's Movies & TV store.\n*   Potential delays for Nvidia and MediaTek Arm-based CPUs for Windows.\n*   The Outer Worlds 2 dropping the $79.99 price tag.\n*   GitHub launching its AI app-making tool, GitHub Spark.\n*   Maingear's Retro95 PC with a retro design and modern components.\n*   The release of Microsoft's new Intel-powered Surface Laptop 5G in August.\n*   Xbox cloud games integrating into play history across devices.\n*   New AI features rolling out to Windows 11.\n*   WhatsApp switching from a native Windows app to a web version.\n*   Remote PC locking via Android phone.\n*   Microsoft hiring AI talent from Google DeepMind.\n*   A new shared audio feature coming to Windows 11.",
    "chinese_title": "OpenAI 预计八月发布 GPT-5。",
    "chinese_summary": "本文报道了OpenAI预计将于8月初发布的GPT-5。据消息人士和OpenAI首席执行官Sam Altman的暗示，新模型拥有改进的功能，包括高级推理(o3)，并将推出可通过API访问的迷你版和纳米版。GPT-5旨在统一OpenAI的模型，并有可能实现AGI，这将影响微软在OpenAI利润中的股份。\n\n文章还提到，OpenAI即将发布一个开源语言模型，与\"o3 mini\"类似，预计在GPT-5发布之前。\n\n除了OpenAI的新闻之外，文章还强调了微软最近的安全问题，包括中国黑客组织利用的SharePoint漏洞，以及对微软雇佣位于中国的工程师协助美国国防部计算机系统的做法的担忧。微软正在通过限制护送计划，仅限于位于美国的员工进入政府云数据中心来回应后者的担忧。\n\n其他涵盖的主题包括：\n\n* 微软致力于Windows 11的性能改进。\n* 微软电影和电视商店的突然关闭。\n* 英伟达和联发科基于Arm的Windows CPU可能延期。\n* 《天外世界2》放弃79.99美元的价格标签。\n* GitHub推出其AI应用制作工具GitHub Spark。\n* Maingear的Retro95 PC，采用复古设计和现代组件。\n* 微软新款基于英特尔的Surface Laptop 5G将于8月发布。\n* Xbox云游戏集成到跨设备的游戏历史记录中。\n* 新的AI功能正在推广到Windows 11。\n* WhatsApp从原生Windows应用切换到网页版。\n* 通过安卓手机远程锁定PC。\n* 微软从谷歌DeepMind聘请AI人才。\n* Windows 11即将推出的新共享音频功能。"
  },
  {
    "id": "44629300",
    "title": "Vanishing home field advantage in English football",
    "url": "https://blog.engora.com/2025/07/vanishing-home-field-advantage-in.html",
    "summary": "This blog post analyzes the trend of diminishing home field advantage in English football from 1888 to the 2024-2025 season. The author uses two primary metrics: per-match home goal advantage (home goals minus away goals) and home win fraction (proportion of wins that are home wins).\n\nThe analysis reveals a clear downward trend in home advantage across all English football leagues over time. A notable exception is the 2020-2021 season, played mostly without spectators due to COVID-19, where home advantage virtually disappeared. This suggests that home support is a major factor contributing to the advantage.\n\nWhile in 2025, the home advantage is about 0.25 goals.\n\nThe author explores potential explanations for the long-term decline, dismissing factors like easier travel or league-specific changes. Instead, they propose player fitness/training, increased travel by fans to support away teams, and referee bias as possible contributing factors. The author favors the traveling fans and referee bias hypotheses.\n\nThe post concludes that current trends suggest a continued dwindling of home advantage, potentially leading to its eventual disappearance. It also raises the importance of maintaining fan support for clubs, as it seems to be a significant element in creating home advantage.\n",
    "chinese_title": "英格兰足球主场优势消退",
    "chinese_summary": "本博文分析了1888年至2024-2025赛季英格兰足球主场优势减弱的趋势。作者使用了两个主要指标：每场比赛主场进球优势（主场进球数减去客场进球数）和主场胜率（主场获胜的比例）。\n\n分析表明，随着时间的推移，所有英格兰足球联赛的主场优势都呈现明显的下降趋势。一个显著的例外是2020-2021赛季，该赛季大部分时间由于COVID-19而没有观众，主场优势几乎消失。这表明主场球迷的支持是构成优势的主要因素。\n\n2025年，主场优势约为0.25个进球。\n\n作者探讨了长期下降的潜在原因，排除了诸如旅行便利或联赛特定变化等因素。相反，他们提出了球员体能/训练、客队球迷旅行增加以及裁判偏见等可能的促成因素。作者倾向于客队球迷和裁判偏见的假设。\n\n文章总结说，目前的趋势表明主场优势将持续下降，最终可能消失。它还提出了保持球迷对俱乐部的支持的重要性，因为它似乎是创造主场优势的重要因素。"
  },
  {
    "id": "44669365",
    "title": "Detekt – A static code analyzer for Kotlin",
    "url": "https://detekt.dev/",
    "summary": "Detekt is a static code analysis tool for Kotlin designed to help developers write cleaner code and focus on building software. It integrates easily into various build systems like Gradle, Maven, and Bazel, and supports a wide range of Kotlin projects including Android, JVM, JS, Native, and Multiplatform. Detekt is highly extensible, allowing developers to create custom rules to identify and fix specific anti-patterns in their codebase. As an open-source project, Detekt is community-driven, encouraging contributions and collaboration on GitHub to improve and shape the tool's future. In essence, Detekt aims to simplify code analysis, improve code quality, and facilitate easier maintenance for Kotlin projects.\n",
    "chinese_title": "Detekt – Kotlin 静态代码分析器",
    "chinese_summary": "Detekt：一款 Kotlin 静态代码分析工具，旨在帮助开发者编写更清晰的代码并专注于软件构建。它能轻松集成到 Gradle、Maven 和 Bazel 等各种构建系统中，并支持包括 Android、JVM、JS、Native 和 Multiplatform 在内的广泛 Kotlin 项目。Detekt 具有高度可扩展性，允许开发者创建自定义规则来识别和修复代码库中的特定反模式。作为一个开源项目，Detekt 由社区驱动，鼓励在 GitHub 上进行贡献和协作，以改进和塑造该工具的未来。本质上，Detekt 旨在简化代码分析，提高代码质量，并促进 Kotlin 项目的更轻松维护。"
  },
  {
    "id": "44660323",
    "title": "US AI Action Plan",
    "url": "https://www.ai.gov/action-plan",
    "summary": "This document outlines the \"US AI Action Plan,\" designed to secure American dominance in artificial intelligence for economic growth, national security, and societal advancement. The plan rests on three pillars.\n\n**Pillar 1: Accelerate AI Innovation:** Focuses on fostering private sector-led innovation by removing regulatory hurdles, ensuring AI protects free speech and American values, encouraging open-source AI, and enabling AI adoption across industries. It emphasizes empowering American workers, supporting next-generation manufacturing, investing in AI-enabled science, building scientific datasets, and advancing the science of AI itself. Further, it promotes AI interpretability, robustness, builds an AI evaluation ecosystem, accelerates AI adoption in government, protects AI innovations, and combats synthetic media.\n\n**Pillar 2: Build American AI Infrastructure:** Addresses the need for significantly increased energy generation to support AI advancements. It involves streamlining permitting for semiconductor manufacturing and energy infrastructure, developing a grid to match AI innovation, restoring American semiconductor manufacturing, building high-security data centers, training a skilled workforce, and bolstering critical infrastructure cybersecurity. The plan also promotes secure-by-design AI technologies and mature federal capacity for AI incident response.\n\n**Pillar 3: Lead in International AI Diplomacy and Security:** Aims to promote the global adoption of American AI systems, hardware, and standards. This involves exporting American AI to allies, countering Chinese influence in international governance, strengthening export controls on AI compute and semiconductor manufacturing, aligning protection measures globally, ensuring the U.S. government leads in evaluating national security risks, and investing in biosecurity. The plan seeks to prevent adversaries from exploiting American innovations.\n",
    "chinese_title": "美国人工智能行动计划",
    "chinese_summary": "本文件概述了“美国人工智能行动计划”，旨在确保美国在人工智能领域的领先地位，以促进经济增长、国家安全和社会进步。该计划基于三大支柱。\n\n**支柱一：加速人工智能创新：** 侧重于通过消除监管障碍、确保人工智能保护言论自由和美国价值观、鼓励开源人工智能以及促进人工智能在各行业的应用来促进私营部门主导的创新。它强调赋能美国工人、支持下一代制造业、投资于人工智能驱动的科学、构建科学数据集以及推进人工智能科学本身。此外，它还促进人工智能的可解释性、稳健性，构建人工智能评估生态系统，加速人工智能在政府部门的应用，保护人工智能创新，并打击合成媒体。\n\n**支柱二：构建美国人工智能基础设施：** 解决对大幅增加能源生产以支持人工智能发展的需求。它包括简化半导体制造和能源基础设施的审批流程、开发与人工智能创新相匹配的电网、恢复美国半导体制造业、建设高安全数据中心、培养技术工人队伍以及加强关键基础设施的网络安全。该计划还提倡安全设计的人工智能技术，并建立成熟的联邦人工智能事件响应能力。\n\n**支柱三：引领国际人工智能外交与安全：** 旨在促进美国人工智能系统、硬件和标准在全球范围内的采用。这包括向盟友出口美国人工智能、抵制中国在国际治理中的影响力、加强对人工智能计算和半导体制造的出口管制、在全球范围内协调保护措施、确保美国政府在评估国家安全风险方面发挥主导作用，以及投资于生物安全。该计划力求防止对手利用美国的创新成果。"
  },
  {
    "id": "44625846",
    "title": "Solving a Childhood Mystery: How BASIC Games Learned to Win",
    "url": "https://sublevelgames.github.io/blogs/2025-07-20-basic-game-hexapawn/",
    "summary": "This article delves into the BASIC code of the Hexapawn game from David H. Ahl's \"BASIC Computer Games,\" exploring how a seemingly simple program could learn to win. Hexapawn, a minichess variant, involves two players with three pawns each, aiming to eliminate opponent pieces or reach the opposite end of the board.\n\nThe author dissects the challenging DATA section of the code, explaining how it stores possible game states and corresponding actions the computer can take. The computer \"learns\" by initially selecting random actions from a predetermined set. When the computer loses, the specific action leading to the loss is removed from its repertoire, effectively learning from its mistakes.\n\nThe code matches the current game board state to the stored states and then chooses an action, flipping the board horizontally if necessary. The AI uses functions like FNM and FNR to manipulate the board and pawn positions.\n\nUltimately, this simple deletion of losing moves is the key to the AI's learning. After around 11 losses out of 36 games, the AI achieves near-perfect play. The article connects Hexapawn's learning mechanism to Donald Michie's MENACE, a matchbox learning machine for tic-tac-toe, highlighting the similar principle of reinforcing good moves and eliminating bad ones through a process of trial and error.\n",
    "chinese_title": "解开童年谜题：BASIC游戏如何学会获胜",
    "chinese_summary": "本文深入探讨David H. Ahl的《BASIC电脑游戏》中Hexapawn游戏的BASIC代码，探索看似简单的程序如何学会获胜。Hexapawn是一种迷你象棋变体，涉及各有三个棋子的两名玩家，目标是消灭对方棋子或到达棋盘的另一端。\n\n作者剖析了代码中具有挑战性的DATA部分，解释了它如何存储可能的棋局状态以及计算机可以采取的相应行动。计算机通过最初从预定集合中选择随机行动来“学习”。当计算机失败时，导致失败的特定行动将从其技能中删除，从而有效地从错误中学习。\n\n代码将当前的棋盘状态与存储的状态进行匹配，然后选择一个动作，必要时水平翻转棋盘。AI使用诸如FNM和FNR之类的函数来操纵棋盘和棋子位置。\n\n最终，这种简单地删除失败走法是AI学习的关键。在36场比赛中输掉大约11场之后，AI达到了接近完美的水平。文章将Hexapawn的学习机制与Donald Michie的MENACE联系起来，MENACE是一种用于井字棋的火柴盒学习机器，突出了通过反复试验来加强好棋并消除坏棋的类似原理。"
  },
  {
    "id": "44663684",
    "title": "Jitsi privacy flaw enables one-click stealth audio and video capture",
    "url": "https://zimzi.substack.com/p/jitsi-privacy-flaw-that-enables-one",
    "summary": "The article \"Jitsi privacy flaw enables one-click stealth audio and video capture\" details a significant security vulnerability discovered in the Jitsi Meet open-source video conferencing platform. The flaw allows a malicious actor to silently and remotely activate a user's microphone and camera without their knowledge or consent, essentially enabling one-click stealth audio and video capture.\n\nThe vulnerability stems from Jitsi's handling of focus privileges. When a meeting participant receives focus privileges, they are authorized to perform certain actions, including muting/unmuting participants. The flaw allows a malicious user to manipulate these privileges to silently unmute and enable a target's camera without requiring any explicit user interaction or permissions. This means the target user would not see any visual cues or warnings that their microphone and camera are active.\n\nThe exploit requires the attacker to be present in the Jitsi meeting. However, it requires minimal technical skill and can be triggered with relative ease once the attacker gains focus privileges (or through exploiting weaknesses in how these privileges are assigned). This makes it particularly dangerous.\n\nThe author emphasizes the severe privacy implications of this flaw, highlighting the potential for eavesdropping, surveillance, and unauthorized recording of sensitive conversations and activities. The article urges Jitsi users to be cautious and potentially consider alternative solutions until the vulnerability is fully patched and verified. It also stresses the importance of regularly updating software to mitigate security risks.\n",
    "chinese_title": "Jitsi隐私漏洞允许一键式隐蔽音视频捕获",
    "chinese_summary": "文章《Jitsi隐私漏洞可一键隐蔽录制音视频》详细描述了在Jitsi Meet开源视频会议平台中发现的一个重大安全漏洞。该漏洞允许恶意行为者在用户不知情或未经同意的情况下，静默地远程激活用户的麦克风和摄像头，从而实现一键隐蔽录制音视频。\n\n该漏洞源于Jitsi对焦点权限的处理方式。当会议参与者获得焦点权限时，他们有权执行某些操作，包括静音/取消静音参与者。该漏洞允许恶意用户操纵这些权限，以在无需任何显式用户交互或许可的情况下，静默地取消目标用户的静音并启用摄像头。这意味着目标用户不会看到任何视觉提示或警告，表明他们的麦克风和摄像头已激活。\n\n该漏洞利用需要攻击者存在于Jitsi会议中。但是，它只需要最少的技术技能，并且一旦攻击者获得焦点权限（或通过利用这些权限分配方式的弱点），就可以相对容易地触发。这使其特别危险。\n\n作者强调了此漏洞的严重隐私影响，突出了窃听、监视和未经授权录制敏感对话和活动的可能性。文章敦促Jitsi用户保持警惕，并在漏洞完全修复和验证之前，可能考虑替代解决方案。它还强调了定期更新软件以减轻安全风险的重要性。"
  },
  {
    "id": "44664873",
    "title": "Show HN: Tinder but it's only pictures of my wife and I can only swipe right",
    "url": "https://trytender.app/",
    "summary": "This \"Show HN\" post presents \"Tender,\" a personalized version of the Tinder dating app designed exclusively for viewing photos of the user's spouse. The key feature is that the user is limited to swiping right, implying an unconditional positive sentiment towards the presented images. Essentially, it's a digital photo album presented in the swipe-based interface of Tinder, optimized for appreciating and engaging with images of one's partner. The project is a playful reimagining of a popular app, repurposing its mechanics for a more intimate and personal purpose. The core idea is about celebrating and constantly affirming affection for a loved one through a familiar and engaging interface. It serves as a lighthearted, potentially daily, reminder of positive feelings.\n",
    "chinese_title": "展示一下：Tinder，但只有我妻子的照片，而且我只能右滑",
    "chinese_summary": "此“Show HN”帖子展示“Tender”，一个为专门浏览用户配偶照片而设计的Tinder约会应用的个性化版本。其主要功能是用户只能右滑，意味着对展示的图像表达无条件的积极情感。本质上，它是一个以Tinder的滑动界面呈现的数字相册，专门用于欣赏和互动伴侣的图像。该项目是对一个流行应用的趣味性重新构想，将其机制重新用于更亲密和个人的目的。其核心理念是通过熟悉且引人入胜的界面来庆祝和不断确认对爱人的感情。它可以作为一种轻松的，潜在的每日提醒，提醒积极的情感。"
  },
  {
    "id": "44659921",
    "title": "Building better AI tools",
    "url": "https://hazelweakly.me/blog/stop-building-ai-tools-backwards/",
    "summary": "This article argues that current AI tools are being built \"backwards,\" deskilling humans instead of enhancing their capabilities. The author contends that AI should augment human processes, not replace them, and draws on cognitive science principles of learning to support this.\n\nThe core argument revolves around how humans learn effectively: through retrieval practice (recalling information), focusing on process rather than rote knowledge, and excelling at cumulative iteration within groups. Current AI tooling, however, often skips human retrieval and initiation, hindering knowledge transfer and deskilling practitioners.\n\nThe author proposes a new AI interaction model based on the \"Explain, Demonstrate, Guide, Enhance\" (EDGE) method, reframing AI as an \"absent-minded instructor\" rather than a co-worker.  Instead of automatically initiating actions, AI should suggest missing steps, explain processes, demonstrate queries, guide users when stuck, and enhance future actions by suggesting improvements and capturing team learning.\n\nThe article uses incident management with observability tooling as a primary example, contrasting common anti-patterns (like automated responses) with the proposed EDGE approach.  The author also briefly touches on code generation, advocating for AI to first generate documentation, architecture diagrams, testing plans, and tests before the actual code itself.  The overarching theme is to reinforce human learning, facilitate collaboration, accelerate in-process execution, and incorporate team learning into the tool's output.\n",
    "chinese_title": "构建更好的AI工具",
    "chinese_summary": "本文认为当前人工智能工具的构建方式“本末倒置”，导致人类技能退化而非增强其能力。作者认为人工智能应增强人类流程，而非取代它们，并借鉴认知科学的学习原则来支持这一观点。\n\n核心论点围绕人类如何有效学习：通过检索练习（回忆信息），专注于过程而非死记硬背，以及擅长在群体内进行累积迭代。然而，当前的人工智能工具通常跳过人类的检索和启动环节，阻碍知识转移并导致从业者技能退化。\n\n作者提出了一种基于“解释、演示、引导、增强”（EDGE）方法的新型人工智能交互模型，将人工智能重新定义为“心不在焉的指导者”而非同事。人工智能不应自动启动行动，而应建议遗漏的步骤、解释流程、演示查询、在用户遇到困难时提供指导，并通过建议改进和捕获团队学习来增强未来的行动。\n\n本文以可观测性工具的事件管理为例，将常见的反模式（如自动响应）与所提出的EDGE方法进行了对比。作者还简要地谈到了代码生成，提倡人工智能首先生成文档、架构图、测试计划和测试，然后再生成实际的代码。总的主题是加强人类学习、促进协作、加速过程执行以及将团队学习融入工具的输出中。"
  },
  {
    "id": "44653136",
    "title": "Vector Tiles are deployed on OpenStreetMap.org",
    "url": "https://blog.openstreetmap.org/2025/07/22/vector-tiles-are-deployed-on-openstreetmap-org/",
    "summary": "OpenStreetMap.org has deployed vector tiles on its foundation servers, offering a sharper and faster visual layer for mappers and visitors on the OSM website. This marks a significant technological upgrade after months of testing and improvements focused on reliability and speed.\n\nA key advantage of vector tiles is their adaptability, allowing developers to create custom styles based on existing Shortbread styles or develop new ones using the OSMF-hosted tiles. Developers are encouraged to consult the Vector Tile Usage Policy for project implementation, noting that the policy may evolve after the launch.\n\nThe Shortbread spec and styles will continue to evolve, and feedback is welcome in the spirit, tilekiln, and shortbread-tiles repositories for styles, tile generation, and tile content specification, respectively.\n",
    "chinese_title": "矢量瓦片已部署在OpenStreetMap.org上。",
    "chinese_summary": "OpenStreetMap.org 在其基础服务器上部署了矢量瓦片，为 OSM 网站上的地图绘制者和访客提供了更清晰、更快的视觉层。 经过数月的测试和改进，专注于可靠性和速度，这标志着一项重要的技术升级。\n\n矢量瓦片的一个主要优势是其适应性，允许开发者基于现有的 Shortbread 样式创建自定义样式，或者使用 OSMF 托管的瓦片开发新的样式。 鼓励开发者查阅矢量瓦片使用策略以进行项目实施，并注意到该策略在发布后可能会不断发展。\n\nShortbread 规范和样式将继续发展，欢迎就样式、瓦片生成和瓦片内容规范分别在 spirit、tilekiln 和 shortbread-tiles 存储库中提供反馈。"
  },
  {
    "id": "44591605",
    "title": "Parsing Protobuf like never before",
    "url": "https://mcyoung.xyz/2025/07/16/hyperpb/",
    "summary": "This article introduces hyperpb, a new high-performance Protobuf parser for Go that outperforms existing solutions like Protobuf Go's generated code and vtprotobuf. The author details the design principles and internal workings of hyperpb, drawing inspiration from UPB (a fast C-based Protobuf runtime) while adapting to Go's unique characteristics and limitations.\n\nKey advantages of hyperpb include its runtime-dynamic nature, meaning it doesn't require ahead-of-time compilation of types, and its adoption of a Protobuf JIT compiler achieved through online profile-guided optimization (PGO). This approach allows hyperpb to adapt to specific message types encountered during runtime, leading to performance gains.\n\nThe article delves into the implementation, highlighting the core components: `tdp` (the object code format), `tdp/compiler` (for converting message descriptors), `tdp/dynamic` (for dynamic message types), `tdp/vm` (the interpreter), and `tdp/thunks` (archetypes for layout and parsers). Optimizations include field scheduling, a \"cold region\" for infrequently set fields, and a parser VM designed to leverage Go's register ABI for maximum performance. The parser cleverly uses function pointers (virtual calls) to dispatch parsing logic, finding that this approach is faster than complex branch mazes due to modern CPU's indirect branch prediction capabilities. hyperpb also utilizes PGO to optimize field ordering and the use of the cold region.\n",
    "chinese_title": "前所未有地解析 Protobuf",
    "chinese_summary": "本文介绍 hyperpb，这是一款新的高性能 Go Protobuf 解析器，其性能优于现有的解决方案，如 Protobuf Go 生成的代码和 vtprotobuf。作者详细介绍了 hyperpb 的设计原则和内部运作机制，从 UPB（一种快速的基于 C 的 Protobuf 运行时）中汲取灵感，同时适应 Go 的独特特性和局限性。\n\nhyperpb 的主要优势包括其运行时动态特性，这意味着它不需要提前编译类型，以及其通过在线剖面引导优化 (PGO) 实现的 Protobuf JIT 编译器。这种方法使 hyperpb 能够适应运行时遇到的特定消息类型，从而提高性能。\n\n本文深入探讨了实现细节，重点介绍了核心组件：`tdp`（对象代码格式）、`tdp/compiler`（用于转换消息描述符）、`tdp/dynamic`（用于动态消息类型）、`tdp/vm`（解释器）和 `tdp/thunks`（布局和解析器的原型）。优化措施包括字段调度、用于不经常设置字段的“冷区域”以及旨在利用 Go 的寄存器 ABI 实现最大性能的解析器 VM。该解析器巧妙地使用函数指针（虚拟调用）来分派解析逻辑，发现由于现代 CPU 的间接分支预测能力，这种方法比复杂的分支迷宫更快。 hyperpb 还利用 PGO 来优化字段排序和冷区域的使用。"
  },
  {
    "id": "44660437",
    "title": "Neil Armstrong's customs form for moon rocks (2016)",
    "url": "https://magazine.uc.edu/editors_picks/recent_features/armstrong/moonrocks.html",
    "summary": "This article discusses the surprising fact that Neil Armstrong, Buzz Aldrin, and Michael Collins, after their Apollo 11 mission to the moon, were required to fill out a U.S. Customs declaration form upon their return. The form, a \"General Declaration,\" listed their point of departure as \"Moon\" and their destination as Honolulu, Hawaii. They declared \"moon rock and moon dust samples\" as the items acquired on their trip.\n\nThe customs form humorously highlights the stringent regulations, questioning if the astronauts were bringing in plants, food, animals, soil, disease agents, cell cultures, or even snails. Notably, the \"Declaration of Health\" section included a question about any condition on board that might lead to the spread of disease, to which the astronauts cautiously responded, \"To be determined.\"\n\nThe article credits UC alumnus Luama Mays for sharing a copy of the declaration with UC Magazine. Mays, a pilot, befriended Armstrong when the former astronaut was a professor at UC. Armstrong had sought out Mays to ride his old helicopter, identical to the one he trained on for the lunar module. The article also includes links to related stories about Neil Armstrong's life, career, and connection to the University of Cincinnati.\n",
    "chinese_title": "尼尔·阿姆斯特朗的月球岩石报关单 (2016)",
    "chinese_summary": "本文探讨了一个令人惊讶的事实：尼尔·阿姆斯特朗、巴兹·奥尔德林和迈克尔·柯林斯在阿波罗11号登月任务返回后，被要求填写美国海关申报单。这份“通用申报单”将他们的出发地列为“月球”，目的地列为夏威夷檀香山。他们申报的物品是“月球岩石和月球尘埃样本”。\n\n这份海关申报单幽默地突出了严格的规章制度，询问宇航员是否携带了植物、食物、动物、土壤、病原体、细胞培养物，甚至是蜗牛。值得注意的是，“健康申报”部分包括一个关于船上可能导致疾病传播的任何情况的问题，对此宇航员谨慎地回答说：“待定”。\n\n本文赞扬了加州大学的校友卢阿玛·梅斯，感谢他与《加州大学杂志》分享了这份申报单的副本。梅斯是一名飞行员，在阿姆斯特朗担任加州大学教授期间与他结为好友。阿姆斯特朗曾找到梅斯，想乘坐他那架与他用于登月舱训练的直升机一模一样的旧直升机。本文还包括了关于尼尔·阿姆斯特朗的生活、职业生涯以及与辛辛那提大学的联系的相关报道链接。"
  },
  {
    "id": "44657556",
    "title": "Lumo: Privacy-first AI assistant",
    "url": "https://proton.me/blog/lumo-ai",
    "summary": "Lumo is a privacy-focused AI assistant developed by Proton, the company behind ProtonMail, designed as an alternative to Big Tech AI offerings that prioritize data collection and surveillance. Lumo emphasizes user privacy and control over data, ensuring conversations are confidential, never shared or sold, and not used to train the AI model.\n\nKey privacy features include: no server-side logs, zero-access encryption of saved chats, no data sharing with third parties, and no use of user data for AI model training. Lumo is based on open-source language models and operates from Proton's European datacenters, providing greater transparency.\n\nLumo offers productivity features such as web search, file uploads, and Proton Drive integration, all while maintaining user privacy. A \"ghost mode\" allows users to have chats that disappear immediately after closing. Users can start using Lumo for free without an account. A paid \"Lumo Plus\" subscription provides access to premium features and unlimited queries.\n\nProton is moving its physical infrastructure, including Lumo, out of Switzerland due to legal uncertainties around surveillance proposals, investing over €100 million into the EU to develop a sovereign EuroStack.\n",
    "chinese_title": "Lumo：隐私优先的AI助手",
    "chinese_summary": "Lumo：一款注重隐私的AI助手，由Proton（ProtonMail背后的公司）开发，旨在替代那些优先考虑数据收集和监控的大型科技公司提供的AI产品。Lumo强调用户隐私和对数据的控制，确保对话的保密性，永不分享或出售，也不会用于训练AI模型。\n\n关键隐私功能包括：无服务器端日志、保存的聊天记录零访问加密、不与第三方共享数据，以及不使用用户数据进行AI模型训练。Lumo基于开源语言模型，并在Proton的欧洲数据中心运营，提供更高的透明度。\n\nLumo提供诸如网页搜索、文件上传和Proton Drive集成等生产力功能，同时保持用户隐私。“幽灵模式”允许用户进行在关闭后立即消失的聊天。用户无需帐户即可免费开始使用Lumo。付费的“Lumo Plus”订阅提供对高级功能和无限次查询的访问权限。\n\n由于围绕监控提案存在法律不确定性，Proton正将其包括Lumo在内的物理基础设施迁出瑞士，并在欧盟投资超过1亿欧元，以开发一个主权的EuroStack。"
  },
  {
    "id": "44665373",
    "title": "I drank every cocktail",
    "url": "https://aaronson.org/blog/i-drank-every-cocktail",
    "summary": "The author chronicles their quest to drink all the cocktails on the International Bartenders Association (IBA) official list, a canonical list of cocktails deemed the \"most requested\" worldwide. Starting as a casual list of \"legal cocktails\" after turning 21, it evolved into a mission to complete the IBA list, which at the time consisted of 89 cocktails.\n\nThe author describes the IBA list, its history, categories (Unforgettables, Contemporary, and New Era), and the initial ease of finding and trying many cocktails. Encounters with bartenders at various establishments, from dive bars to high-end establishments, are recounted. Notably, a trip to Satan's Whiskers in London proved invaluable due to its extensive cocktail knowledge and willingness to make obscure drinks.\n\nMidway through the quest, the IBA updated its list, adding 16 new cocktails and removing 3, bringing the total to 102. This posed a significant challenge, especially with the introduction of the \"IBA Tiki,\" a cocktail with 9 ingredients, including Cuban rum unavailable in the US, and limited information available about the drink. This change reinvigorated the author's determination to complete the updated list, ending the article on that point.\n",
    "chinese_title": "我喝了每一种鸡尾酒。",
    "chinese_summary": "作者记录了自己为了喝遍国际调酒师协会(IBA)官方鸡尾酒单上所有酒品的历程。这份鸡尾酒单被认为是全球“最受欢迎”的经典酒品清单。 从21岁成年后的一份随意“合法鸡尾酒”清单开始，逐渐演变成一项完成IBA清单的使命，当时的清单包含89款鸡尾酒。\n\n作者描述了IBA清单、它的历史、分类（经典永恒、当代经典和新时代经典），以及最初寻找和尝试许多鸡尾酒的容易程度。书中叙述了作者在从简陋酒吧到高端场所的各种酒吧遇到的调酒师。值得一提的是，伦敦的撒旦胡须酒吧之行被证明是宝贵的，因为它拥有丰富的鸡尾酒知识，并且愿意调制冷门饮品。\n\n任务进行到一半时，IBA更新了清单，增加了16种新鸡尾酒，删除了3种，总数达到102种。 这带来了巨大的挑战，尤其是“IBA提基”鸡尾酒的引入，这款鸡尾酒包含9种成分，包括在美国无法获得的古巴朗姆酒，而且关于这款饮品的信息有限。 这一变化重新激发了作者完成更新清单的决心，文章到此结束。"
  },
  {
    "id": "44659251",
    "title": "Why Elixir? Common misconceptions",
    "url": "https://matthewsinclair.com/blog/0181-why-elixir",
    "summary": "This article passionately advocates for Elixir as a superior platform for modern software development, challenging common misconceptions about its niche appeal. The author highlights Elixir's foundation on the Erlang VM (BEAM) for inherent scalability, concurrency, and fault tolerance, making it ideal for demanding applications. The mature ecosystem boasts production-grade libraries like Phoenix (a full-stack web framework simplifying front-end development), Ash (a declarative backend framework reducing boilerplate), and Nx (for numerical computing and machine learning).\n\nElixir promotes developer productivity through clarity, maintainability, and its AI-native language model compatibility. The author argues that Elixir developers are highly skilled and enjoy greater job satisfaction, leading to better retention. Furthermore, Elixir's ecosystem often eliminates the need for complex infrastructure components like Kubernetes, external job queues, and elaborate monitoring setups.\n\nIn short, the article argues that Elixir offers a faster, cheaper, and more maintainable solution for building robust and scalable systems, from front-end to back-end and even machine learning, all while fostering AI-assisted development. The author emphasizes the comprehensive nature of Elixir and encourages readers to explore a detailed paper generated by an LLM for a deeper understanding.\n",
    "chinese_title": "为什么要用 Elixir？常见误解",
    "chinese_summary": "Elixir：现代软件开发的卓越平台"
  },
  {
    "id": "44634756",
    "title": "A Python tool to parse PDF statements from Poste Italiane",
    "url": "https://github.com/genbs/poste-italiane-parser",
    "summary": "This document describes a Python tool, `poste-italiane-parser`, designed to automatically parse PDF statements from Poste Italiane (Italian Post Office) and convert them into structured JSON or CSV data. It caters to users with \"conto postale\" accounts, offering a solution to extract information from documents like BancoPosta statements and Postepay reports.\n\nKey features include automatic document type detection, data validation to ensure financial data integrity, and support for JSON and CSV output formats. The tool supports batch processing, allowing users to analyze single PDFs or entire directories of documents.\n\nThe installation process involves cloning the GitHub repository, navigating into the directory, and installing the necessary Python dependencies using `pip`. The script is used from the command line, accepting arguments for the input PDF path, output format (JSON or CSV), and output path.  Verbose logging is also an option.\n\nThe parser can also be used as a library within Python projects.\n\nThe output data is structured in JSON, providing details like document type, currency, initial and final balances, IBAN, holder information, card number, account number, period (start and end dates), customer information (name, street, city), and a list of transactions with details like accounting date, value date, description, debits, and credits.\n\nTesting requires creating `.test.json` files containing the expected output for each test case. The test suite can then be run using `unittest`. Contributions are welcome, and the project is licensed under the MIT License.\n",
    "chinese_title": "一个解析意大利邮政PDF账单的Python工具",
    "chinese_summary": "本文档介绍了一个名为`poste-italiane-parser`的Python工具，该工具旨在自动解析意大利邮政(Poste Italiane)的PDF账单，并将其转换为结构化的JSON或CSV数据。它面向拥有“conto postale”账户的用户，提供了一种从BancoPosta账单和Postepay报告等文档中提取信息的解决方案。\n\n主要功能包括自动文档类型检测、数据验证以确保财务数据完整性，以及对JSON和CSV输出格式的支持。该工具支持批量处理，允许用户分析单个PDF或整个文档目录。\n\n安装过程包括克隆GitHub仓库，导航到该目录，并使用`pip`安装必要的Python依赖项。该脚本从命令行使用，接受输入PDF路径、输出格式（JSON或CSV）和输出路径等参数。还提供详细日志记录选项。\n\n该解析器也可以作为库在Python项目中使用。\n\n输出数据以JSON格式结构化，提供文档类型、货币、期初和期末余额、IBAN、持有人信息、卡号、账号、期间（起始和结束日期）、客户信息（姓名、街道、城市）以及包含会计日期、价值日期、描述、借方和贷方等详细信息的交易列表等信息。\n\n测试需要创建包含每个测试用例的预期输出的`.test.json`文件。然后可以使用`unittest`运行测试套件。欢迎贡献，该项目采用MIT许可证。"
  },
  {
    "id": "44659019",
    "title": "What to expect from Debian/Trixie",
    "url": "https://michael-prokop.at/blog/2025/07/20/what-to-expect-from-debian-trixie-newintrixie/",
    "summary": "This article provides a sysadmin-focused overview of what to expect from Debian 13 \"Trixie,\" scheduled for release on August 9, 2025. It highlights the author's efforts in preparing for the upgrade and identifies key changes to be aware of.\n\nThe author points to the official Debian release notes for comprehensive information, urging readers to review \"What's new in Debian 13.\"\n\nA significant portion of the article details package version upgrades compared to Debian 12 \"Bookworm,\" covering essential software like Ansible, Apache, Docker, various databases (MariaDB, Postgres), and programming languages (Python, Go, Ruby, Rust).\n\nThe article then dives into specific changes and new features in core system components:\n\n*   **apt:** Introduces colorized output, improved readability, Sequoia signature verification, a new solver, modernization of source lists (`apt modernize-sources`), a distclean command, kernel management improvements, and the removal of `apt-key`.\n*   **systemd:** Highlights the upgrade to v257, potential naming scheme changes, and lists new tools like `run0`, `systemd-ac-power`, and others, along with numerous new options for existing `systemd` tools. Several new binary packages are also shipping with Debian's systemd.\n*   **Linux Kernel:** The article details that Trixie ships with Linux kernel version 6.12, listing new Debian packages (linux-bpf-dev, intel-sdsi, virtme-ng), xz compression for kernel modules, new syscalls, and various improvements to file systems, networking, and hardware support.\n\nThe article also touches upon specific software, and mentions configuration management, specifically, Puppet, and versions available in Debian.\n",
    "chinese_title": "Debian/Trixie 有哪些值得期待的",
    "chinese_summary": "本文概述了Debian 13 “Trixie”（预计于2025年8月9日发布）的系统管理员关注点，重点介绍了作者为升级所做的准备工作，并指出了需要注意的关键变更。\n\n作者建议查阅官方Debian发布说明以获取全面信息，并敦促读者查看“Debian 13 的新功能”。\n\n文章的大部分内容详细介绍了与Debian 12 “Bookworm”相比的软件包版本升级，涵盖了Ansible、Apache、Docker、各种数据库（MariaDB、Postgres）和编程语言（Python、Go、Ruby、Rust）等重要软件。\n\n文章随后深入探讨了核心系统组件中的具体变更和新功能：\n\n*   **apt:** 引入了彩色输出、改进的可读性、Sequoia签名验证、新的求解器、源列表的现代化（`apt modernize-sources`）、distclean命令、内核管理改进以及`apt-key`的移除。\n*   **systemd:** 重点介绍了升级到v257、潜在的命名方案变更，并列出了诸如`run0`、`systemd-ac-power`等新工具以及现有`systemd`工具的众多新选项。 还有几个新的二进制包也随Debian的systemd一起发布。\n*   **Linux Kernel:** 文章详细说明了Trixie附带Linux内核版本6.12，列出了新的Debian软件包（linux-bpf-dev、intel-sdsi、virtme-ng），用于内核模块的xz压缩、新的系统调用以及对文件系统、网络和硬件支持的各种改进。\n\n文章还涉及了特定软件，并提及了配置管理，特别是Puppet，以及Debian中可用的版本。"
  },
  {
    "id": "44672960",
    "title": "Europe's Self Inflicted Cloud Crisis",
    "url": "https://berthub.eu/articles/posts/our-self-inflicted-cloud-crisis/",
    "summary": "Europe is facing a self-inflicted \"cloud crisis\" by becoming overly reliant on US-based cloud providers like Amazon, Microsoft, and Google. The article argues that this dependence threatens European sovereignty and exposes sensitive data to US control, especially given the current political climate.\n\nThe author contends that the narrative that computing is impossible without these US clouds is false. Europe has ample infrastructure for renting servers, storage, and bandwidth, but lacks equivalent \"pre-fabricated\" cloud services, leading to vendor lock-in and high costs associated with using US clouds. The author criticizes the trend of outsourcing core national services to US companies, making them subject to US spying legislation.\n\nThe piece advocates for a two-pronged approach: First, European software developers and IT professionals should relearn how to deploy software on locally available servers and databases, rather than relying on proprietary US cloud services. Second, efforts like EuroStack to develop robust European cloud alternatives should be supported.\n\nThe author dismisses the notion that a perfect clone of AWS is necessary or even feasible. Instead, he encourages utilizing existing European infrastructure and capabilities, highlighting the success of systems like OpenTK.nl. He urges policymakers to consider the long-term costs of digital colonization and emphasizes the importance of making political decisions to support European technological independence. The key is to retain what works locally, promote European cloud options, and improve internal server deployment processes.\n",
    "chinese_title": "欧洲自 inflicted 的云危机",
    "chinese_summary": "欧洲正面临一场自 inflicted 的“云危机”，因为它过度依赖亚马逊、微软和谷歌等美国云服务提供商。文章认为，这种依赖威胁着欧洲的主权，并将敏感数据暴露在美国的控制之下，尤其是在当前的政治气候下。\n\n作者认为，认为没有这些美国云就无法进行计算的说法是错误的。欧洲拥有充足的基础设施来租赁服务器、存储和带宽，但缺乏同等的“预制”云服务，导致供应商锁定和使用美国云的高成本。作者批评了将核心国家服务外包给美国公司的趋势，使其受到美国间谍法的影响。\n\n这篇文章提倡一种双管齐下的方法：首先，欧洲软件开发人员和 IT 专业人员应该重新学习如何在本地可用的服务器和数据库上部署软件，而不是依赖专有的美国云服务。其次，应该支持像 EuroStack 这样开发强大的欧洲云替代方案的努力。\n\n作者驳斥了认为有必要甚至可行完全克隆 AWS 的想法。相反，他鼓励利用现有的欧洲基础设施和能力，并强调了像 OpenTK.nl 这样的系统的成功。他敦促决策者考虑数字殖民的长期成本，并强调做出政治决策以支持欧洲技术独立的重要性。关键是保留本地有效的东西，推广欧洲云选项，并改进内部服务器部署流程。"
  },
  {
    "id": "44667667",
    "title": "Itch.io: Update on NSFW Content",
    "url": "https://itch.io/updates/update-on-nsfw-content",
    "summary": "itch.io has deindexed all adult NSFW content from its browse and search pages due to pressure from payment processors. This decision was prompted by a campaign from the organization Collective Shout, who raised concerns about content on itch.io, specifically citing the game \"No Mercy\" (which was previously banned).\n\nThe deindexing is a temporary measure while itch.io conducts a comprehensive audit of its content to ensure compliance with payment processor policies. After the review, they will implement new compliance measures, including a confirmation step for creators of NSFW content to verify it aligns with the policies of their linked payment processors. Some pages will be permanently removed, and affected account holders will be notified via email.\n\nitch.io apologizes for the sudden and disruptive nature of this change, explaining that the situation developed rapidly and required immediate action to protect the platform's payment infrastructure. They ask for patience and understanding while they navigate this challenging period. They promise to provide further updates as the situation evolves.\n",
    "chinese_title": "Itch.io：关于成人内容的更新",
    "chinese_summary": "由于支付处理商的压力，itch.io已将其浏览和搜索页面上所有成人NSFW内容取消索引。这一决定是由组织Collective Shout发起的一项活动引发的，该组织对itch.io上的内容提出了担忧，特别提到了游戏“No Mercy”（此前已被禁止）。\n\n取消索引是一项临时措施，在此期间，itch.io将对其内容进行全面审查，以确保符合支付处理商的政策。审查结束后，他们将实施新的合规措施，包括要求NSFW内容的创作者确认其内容符合其关联支付处理商的政策。部分页面将被永久删除，受影响的帐户持有人将收到电子邮件通知。\n\nitch.io对此次更改的突然性和破坏性表示歉意，并解释说情况发展迅速，需要立即采取行动以保护平台的支付基础设施。他们恳请用户耐心和理解，因为他们正在应对这一充满挑战的时期。他们承诺在情况发展变化时提供进一步的更新。"
  },
  {
    "id": "44672521",
    "title": "ICEBlock, an iOS Exclusive",
    "url": "https://daringfireball.net/2025/07/iceblock",
    "summary": "This article discusses ICEBlock, an iOS-exclusive app designed to allow users to anonymously report ICE (Immigration and Customs Enforcement) activity in their vicinity. The app provides real-time updates within a 5-mile radius and automatically deletes sightings after four hours, prioritizing user privacy by not storing any personal data.\n\nThe article highlights the criticism ICE has faced regarding civil rights abuses and due process, framing ICEBlock as a tool to empower communities to stay informed. It contrasts ICEBlock with Apple's previous decision to remove the HKmap.live app from the App Store, which aided pro-democracy activists in Hong Kong. The author suggests Apple might face pressure to remove ICEBlock as well, particularly from the Trump administration.\n\nA key argument is the technical justification for ICEBlock's iOS exclusivity. The developers claim that Android's push notification system requires storing device IDs, which would compromise user anonymity and create a vulnerable database. iOS, on the other hand, allows for push notifications without storing user-identifiable information, enabling ICEBlock to maintain its commitment to complete anonymity. The author hopes Apple will defend the app's existence and its unique privacy features.\n",
    "chinese_title": "ICEBlock，iOS 独占",
    "chinese_summary": "本文讨论了ICEBlock，这是一款iOS独占应用，旨在允许用户匿名举报其附近的移民及海关执法局（ICE）活动。该应用提供5英里半径范围内的实时更新，并在四小时后自动删除目击报告，通过不存储任何个人数据来优先保护用户隐私。\n\n本文强调了ICE因侵犯公民权利和正当程序而面临的批评，并将ICEBlock定位为一种赋能社区以保持知情的工具。本文将ICEBlock与苹果公司此前将HKmap.live应用从App Store中移除的决定进行了对比，后者曾帮助香港的亲民主人士。作者认为，苹果公司可能面临移除ICEBlock的压力，特别是来自特朗普政府的压力。\n\n一个关键论点是ICEBlock的iOS独占性的技术论证。开发者声称，安卓的推送通知系统需要存储设备ID，这将损害用户匿名性并创建一个脆弱的数据库。另一方面，iOS允许在不存储用户可识别信息的情况下进行推送通知，从而使ICEBlock能够坚持其完全匿名的承诺。作者希望苹果公司能够捍卫该应用的存在及其独特的隐私功能。"
  },
  {
    "id": "44612313",
    "title": "The Big OOPs: Anatomy of a Thirty-Five Year Mistake",
    "url": "https://www.computerenhance.com/p/the-big-oops-anatomy-of-a-thirty",
    "summary": "Casey Muratori announces the availability of his \"The Big OOPs: Anatomy of a Thirty-Five Year Mistake\" presentation from the Better Software Conference. He researched extensively, reviewing hundreds of pages of source material to paint an accurate historical picture, though he had to omit some fascinating stories to keep the runtime under two hours.\n\nHe's considering a live stream to discuss additional documents not featured in the talk and encourages readers to express their interest in the comments. He also provides links to four collected histories for those wanting to explore the topic further:\n\n*   **The Early History of Smalltalk** by Alan Kay: Details the development of Smalltalk, useful for understanding the nuances of Smalltalk's approach to \"class hierarchy.\"\n*   **A History of C++** by Bjarne Stroustrup: Stroustrup's retrospective on C++, also available as the first chapter of his book \"The Design and Evolution of C++.\"\n*   **The Development of the Simula Languages** by Ole-Johan Dahl and Kristen Nygaard: Covers the creation of Simula I and Simula 67, where classes and virtual functions first appeared.\n*   **Origins of the APT Language for Automatically Programmed Tools** by Douglass T. Ross: Highlights the \"plex\" from 1956 as an early example of \"programming with highly structured data.\" Muratori is curious if the \"plex\" is truly the earliest instance of this paradigm. He encourages readers to share any earlier examples they know of.\n",
    "chinese_title": "大型面向对象失误：三十五年错误的剖析",
    "chinese_summary": "Casey Muratori 发布了他在 Better Software Conference 上所做的 “重大 OOPs：三十五年错误的剖析” 演示文稿。为了准确地呈现历史原貌，他进行了广泛的研究，查阅了数百页的原始资料，但为了将演示时间控制在两小时以内，他不得不省略了一些引人入胜的故事。\n\n他正在考虑进行直播，讨论演讲中未提及的其他文档，并鼓励读者在评论中表达他们的兴趣。他还提供了四个历史资料的链接，供那些想要进一步探索该主题的人参考：\n\n*   Alan Kay 的 **Smalltalk 的早期历史**：详细介绍了 Smalltalk 的发展，有助于理解 Smalltalk 对“类层次结构”的处理方式的细微差别。\n*   Bjarne Stroustrup 的 **C++ 历史**：Stroustrup 对 C++ 的回顾，也可以作为他的书《C++ 的设计与演化》的第一章。\n*   Ole-Johan Dahl 和 Kristen Nygaard 的 **Simula 语言的开发**：涵盖了 Simula I 和 Simula 67 的创建，其中首次出现了类和虚函数。\n*   Douglass T. Ross 的 **自动编程工具 APT 语言的起源**：强调了 1956 年的 “plex”，作为“使用高度结构化数据进行编程”的早期示例。 Muratori 很好奇 “plex” 是否真的是这种范式的最早实例。他鼓励读者分享他们所知道的任何更早的例子。"
  },
  {
    "id": "44667472",
    "title": "Shattering the rotation illusion: The attacker view and AWSKeyLockdown (2024)",
    "url": "https://www.clutch.security/blog/shattering-the-rotation-illusion-part-6-the-attackers-perspective-and-introducing-awskeylockdown",
    "summary": "This article, \"Shattering the Rotation Illusion: The Attacker's Perspective & Introducing AWSKeyLockdown,\" concludes a series exposing the inadequacy of traditional secret rotation for AWS keys. It highlights how attackers rapidly exploit leaked AWS access keys, often within minutes or seconds, even when GitHub's secret scanning triggers AWSCompromisedKeyQuarantineV2. The article argues that this quarantine policy offers a false sense of security because attackers can still perform reconnaissance, data exfiltration, privilege escalation, cost incurrence, and even establish backdoors within the compromised environment.\n\nThe authors emphasize that relying solely on secret rotation and automated detection is insufficient and advocates for a fundamental shift towards proactive security measures like Zero Trust and ephemeral identities. They criticize AWS's recommendation to delete exposed keys without providing a mechanism to immediately disable them, contrasting it with GCP's proactive approach of immediately revoking exposed service account keys.\n\nThe article introduces AWSKeyLockdown, an open-source tool built by the authors that instantly revokes AWS access keys as soon as the AWSCompromisedKeyQuarantineV2 policy is applied, preventing attackers from exploiting them. The authors ultimately call for organizations to move beyond static secrets and embrace modern security approaches to better defend against the risks of exposed credentials, highlighting the urgent need to protect Non-Human Identities across Code, CI/CD, and SaaS applications.\n",
    "chinese_title": "打破旋转错觉：攻击者视角与AWSKeyLockdown (2024)",
    "chinese_summary": "粉碎轮换幻觉：攻击者视角及AWSKeyLockdown介绍\n\n本文“粉碎轮换幻觉：攻击者视角及AWSKeyLockdown介绍”是揭露传统密钥轮换对AWS密钥不足的一系列文章的总结。它强调了攻击者如何迅速利用泄露的AWS访问密钥，通常在几分钟甚至几秒钟内，即使GitHub的秘密扫描触发了AWSCompromisedKeyQuarantineV2。 文章认为，这种隔离策略提供了一种虚假的安全感，因为攻击者仍然可以进行侦察、数据泄露、权限提升、成本产生，甚至在受损环境中建立后门。\n\n作者强调，仅仅依靠密钥轮换和自动检测是不够的，并提倡从根本上转向积极的安全措施，如零信任和临时身份。他们批评AWS建议删除暴露的密钥，却没有提供立即禁用它们的机制，这与GCP立即撤销暴露的服务帐户密钥的积极方法形成对比。\n\n文章介绍了AWSKeyLockdown，这是作者构建的一个开源工具，一旦应用AWSCompromisedKeyQuarantineV2策略，该工具会立即撤销AWS访问密钥，从而防止攻击者利用它们。 作者最终呼吁组织超越静态密钥，拥抱现代安全方法，以更好地防御暴露凭证的风险，并强调迫切需要保护代码、CI/CD和SaaS应用程序中的非人类身份。"
  },
  {
    "id": "44632890",
    "title": "Colodebug: A simple way to improve bash script debugging (2021)",
    "url": "https://johannes.truschnigg.info/writing/2021-12_colodebug/",
    "summary": "This article introduces \"Colodebug,\" a simple method to enhance Bash script debugging by leveraging the colon (`:`) command for runtime context information. It addresses limitations of standard debugging techniques like `set -x` (xtrace) by incorporating source code comments into the debugging output.\n\nThe core idea involves replacing standard hash (`#`) comments with \"colon comments\" (`: This is a colon comment`). When xtrace is enabled (`bash -x`), these comments are displayed, providing valuable context during script execution.\n\nThe article further enhances this by redefining the colon command as a function that acts as a \"verbose mode\" trigger. By setting the `COLODEBUG` environment variable, comments starting with `::` (`: :: verbose message`) are printed to stderr. This allows for selective enabling of verbose debugging messages without altering the script's core logic.\n\nThe script provided at the end of the article allows developers to incorporate a function definition for ':' that allows for the colon comments. If the COLODEBUG variable is present in the environment, all '::' prefixed comments get printed to stderr.\n\nThe article emphasizes that `: ::` should not be used as a complete replacement for `#`, and that any syntax errors that may be present in the comments will be passed to the shell for parsing.\n\nIn summary, Colodebug provides a minimally disruptive way to add context and a verbose mode to Bash scripts, improving debugging effectiveness through enhanced comment visibility and selective message output.\n",
    "chinese_title": "Colodebug：一种改进Bash脚本调试的简单方法 (2021)",
    "chinese_summary": "本文介绍了一种名为“Colodebug”的简单方法，通过利用冒号（`:`）命令来增强 Bash 脚本调试，以获取运行时上下文信息。它通过将源代码注释纳入调试输出，解决了标准调试技术（如 `set -x` (xtrace)）的局限性。\n\n其核心思想是将标准井号（`#`）注释替换为“冒号注释”（`: This is a colon comment`）。当启用 xtrace (`bash -x`) 时，这些注释会显示出来，从而在脚本执行期间提供有价值的上下文。\n\n本文还通过将冒号命令重新定义为一个充当“详细模式”触发器的函数来进一步增强此功能。通过设置 `COLODEBUG` 环境变量，以 `::` 开头的注释（`: :: verbose message`）将被打印到 stderr。这允许选择性地启用详细调试消息，而无需更改脚本的核心逻辑。\n\n文章末尾提供的脚本允许开发人员为“:”合并一个函数定义，该定义允许冒号注释。如果 COLODEBUG 变量存在于环境中，则所有以“::”为前缀的注释都将打印到 stderr。\n\n文章强调“`: ::`”不应被用作“`#`”的完全替代品，并且注释中可能存在的任何语法错误都将传递给 shell 进行解析。\n\n总而言之，Colodebug 提供了一种最小程度干扰的方式，可以向 Bash 脚本添加上下文和详细模式，通过增强注释可见性和选择性消息输出，提高调试效率。"
  },
  {
    "id": "44658908",
    "title": "Cops say criminals use a Google Pixel with GrapheneOS – I say that's freedom",
    "url": "https://www.androidauthority.com/why-i-use-grapheneos-on-pixel-3575477/",
    "summary": "Calvin Wankhede argues that using GrapheneOS on a Google Pixel shouldn't automatically equate to criminal activity, despite reports of Spanish police profiling individuals based on this combination. Wankhede highlights that GrapheneOS offers enhanced privacy and security features beneficial to anyone wanting more control over their data, not just criminals.\n\nHe details his personal experience, emphasizing the ease of installation and the surprising compatibility with apps like the Play Store, despite the absence of default Google services. The primary advantage, however, is GrapheneOS's ability to sandbox Google apps and restrict their access to data, granting users granular control over permissions. Features like the duress PIN, which permanently deletes all data, further enhance security.\n\nWankhede argues that using GrapheneOS is about exercising ownership and control over one's device, not hiding something. He criticizes the scrutiny that privacy-enhancing tools like GrapheneOS and Signal face, drawing parallels to the Pegasus spyware scandal in Catalonia, where government surveillance was a real threat. He concludes that using privacy tools shouldn't automatically make one a suspect and that profiling based on such use is misguided. The author states that developers of open source software cannot control who uses their software for better or worse, and that's how the concept of freedom works.\n",
    "chinese_title": "警察说罪犯使用搭载石墨烯操作系统的谷歌Pixel手机——我说那是自由。",
    "chinese_summary": "尽管有报道称西班牙警方根据个人使用的谷歌Pixel手机和石墨烯操作系统（GrapheneOS）进行侧写，但Calvin Wankhede认为，使用谷歌Pixel手机上的石墨烯操作系统不应自动等同于犯罪活动。Wankhede强调，石墨烯操作系统提供了增强的隐私和安全功能，对任何希望更好地控制自己数据的人都有益，而不仅仅是罪犯。\n\n他详细介绍了他的个人经历，强调了安装的便捷性以及令人惊讶的与Play商店等应用程序的兼容性，尽管它缺少默认的谷歌服务。然而，主要的优势是石墨烯操作系统能够沙盒化谷歌应用程序并限制它们对数据的访问，从而赋予用户对权限的精细控制。诸如紧急密码（duress PIN）之类的功能，该功能会永久删除所有数据，进一步增强了安全性。\n\nWankhede认为，使用石墨烯操作系统是关于行使对设备的自主权和控制权，而不是隐藏什么。他批评了石墨烯操作系统和Signal等隐私增强工具所面临的审查，并将此与加泰罗尼亚的飞马间谍软件丑闻相提并论，在加泰罗尼亚，政府监视是一个真正的威胁。他总结说，使用隐私工具不应自动使一个人成为嫌疑人，并且基于这种使用的侧写是错误的。作者指出，开源软件的开发者无法控制谁使用他们的软件做好事或坏事，这就是自由的概念的运作方式。"
  },
  {
    "id": "44626359",
    "title": "Checklists are hard, but still a good thing",
    "url": "https://utcc.utoronto.ca/~cks/space/blog/sysadmin/ChecklistsAreHardButGood",
    "summary": "Chris Siebenmann's \"Checklists are hard, but still a good thing\" is a notification explaining why some users may be blocked from accessing his blog, Wandering Thoughts, and the associated CSpace wiki. The issue stems from aggressive anti-crawler measures implemented to combat a surge in bot activity, particularly in early 2025, aiming to gather data for LLM training.\n\nSiebenmann is blocking browsers with suspiciously old user agents, primarily Chrome, because many crawlers disguise themselves with outdated browser identities. This means legitimate users with old browsers, or those using archival services other than archive.org, may be erroneously blocked.\n\nThe article specifically addresses users of archive.today, archive.ph, and archive.is, noting that these services mimic malicious crawler behavior by using old Chrome User-Agent values, utilizing widely distributed IP addresses, and sometimes falsifying reverse DNS entries. He recommends using archive.org instead, as it's a more ethical crawler.\n\nIf a user believes they've been blocked in error despite using a current browser, Siebenmann encourages them to contact him at his university email address with their browser details and User-Agent string. The goal is to reduce server load from malicious crawlers while minimizing inconvenience to genuine users.\n",
    "chinese_title": "清单很难，但仍然是好事。",
    "chinese_summary": "Chris Siebenmann：“清单很难，但仍然是件好事”是一则通知，解释了部分用户可能被阻止访问其博客 Wandering Thoughts 及相关 CSpace Wiki 的原因。问题源于旨在打击机器人活动激增（尤其是在 2025 年初）的激进反爬虫措施，其目的是收集数据以进行 LLM 训练。\n\nSiebenmann 正在阻止具有可疑旧版 User-Agent 的浏览器（主要是 Chrome），因为许多爬虫会伪装成过时的浏览器身份。这意味着使用旧版浏览器或使用 archive.org 以外的存档服务的合法用户可能会被错误地阻止。\n\n这篇文章专门针对 archive.today、archive.ph 和 archive.is 的用户，指出这些服务通过使用旧版 Chrome User-Agent 值、利用广泛分布的 IP 地址以及有时伪造反向 DNS 条目来模仿恶意爬虫行为。 他建议使用 archive.org 代替，因为它是一个更符合道德规范的爬虫。\n\n如果用户认为他们在使用当前浏览器的情况下被错误地阻止，Siebenmann 鼓励他们通过其大学电子邮件地址与他联系，并提供他们的浏览器详细信息和 User-Agent 字符串。目标是减少恶意爬虫造成的服务器负载，同时尽量减少对真实用户的干扰。"
  },
  {
    "id": "44622994",
    "title": "Seven Sisters eclipse will temporarily block stars from view",
    "url": "https://www.discovermagazine.com/the-sciences/the-seven-sisters-eclipse-will-temporarily-block-stars-from-view",
    "summary": "On July 20, 2025, skywatchers in the U.S. and Canada can observe a \"Seven Sisters Eclipse,\" where the waning crescent moon will pass in front of the Pleiades star cluster, temporarily blocking them from view. This event, technically a lunar occultation, is not exceptionally rare, happening monthly since September 2023 and continuing until July 2029, but visibility varies by location.\n\nTo witness the eclipse, look toward the eastern horizon in the early morning hours, ensuring a clear view and minimal light pollution. No special equipment is needed; even city dwellers can spot it, though darker locations offer better viewing.\n\nThe Pleiades, also known as Messier 45 or the Seven Sisters, are a cluster of over a thousand young stars, the brightest of which are visible to the naked eye. They are about 445 light-years away in the Taurus constellation.\n\nAdditionally, July 2025 offers other celestial events: Venus will appear near the crescent moon on July 21 and 22, with Jupiter on the horizon. Mars will be near the crescent moon on July 28. The constellation Aquila will also be visible in the eastern sky throughout the first half of the night.\n",
    "chinese_title": "七姐妹星团掩星将暂时遮蔽星光。",
    "chinese_summary": "2025年7月20日，美国和加拿大的天文爱好者可以观测到“七姐妹星食”，届时残月将从昴星团前方经过，暂时遮挡住它们。 这次事件，严格来说是月掩星，并不特别罕见，自2023年9月以来每月都会发生，并将持续到2029年7月，但可见度因地点而异。\n\n要观看这次星食，请在清晨时分看向东方地平线，确保视野清晰且光污染最小。 无需特殊设备；即使是城市居民也能看到，但较暗的地点提供更好的观看效果。\n\n昴星团，也被称为梅西耶45或七姐妹星团，是由一千多颗年轻恒星组成的星团，其中最亮的几颗可以用肉眼看到。 它们位于金牛座，距离地球约445光年。\n\n此外，2025年7月还提供其他天文事件：7月21日和22日，金星将出现在新月附近，木星则在地平线上。 7月28日，火星将在新月附近。 整个前半夜，鹰座也将出现在东方天空。"
  },
  {
    "id": "44662757",
    "title": "Major rule about cooking meat turns out to be wrong",
    "url": "https://www.seriouseats.com/meat-resting-science-11776272",
    "summary": "Daniel Gritzer's article challenges the long-held belief that resting meat makes it juicier. He argues that the real benefit of resting meat is temperature control, specifically managing carryover cooking.\n\nThe traditional view is that resting allows muscle fibers to relax and reabsorb juices pushed to the center during cooking, preventing juice loss upon slicing. However, Gritzer highlights research questioning this, particularly citing Meathead from AmazingRibs.com, who argued that perceived juiciness is complex and that any juice loss from skipping the rest is insignificant compared to factors affecting crispness.\n\nChris Young's experiments further challenge the traditional view. Using a Predictive Thermometer, Young demonstrated that when meat is sliced at the same final internal temperature, resting has no measurable effect on juice loss. Gritzer explains that previous tests failed to account for carryover cooking, which causes meat to continue cooking internally while resting, resulting in varying final temperatures at the time of slicing.\n\nGritzer conducted his own sensory test, using pork chops and a controlled environment to evaluate juiciness between rested and unrested samples sliced at the same internal temperature. He found that carryover cooking is significantly underestimated and occurs rapidly, making it difficult to achieve consistent slicing temperatures when following conventional resting advice.\n\nUltimately, the article concludes that resting meat should be viewed as a temperature control method to prevent overcooking due to carryover, rather than a way to retain juices.\n",
    "chinese_title": "关于烹饪肉类的一项主要规则被证明是错误的",
    "chinese_summary": "丹尼尔·格里泽的文章挑战了长期以来人们认为的“静置肉类使其更鲜嫩多汁”的观点。他认为，静置肉类的真正好处在于温度控制，特别是控制后熟效应。\n\n传统观点认为，静置可以让肌肉纤维放松并重新吸收烹饪过程中被挤压到中心的汁液，从而防止切片时汁液流失。然而，格里泽强调了一些对此提出质疑的研究，特别是引用了 AmazingRibs.com 网站的 Meathead 的观点，他认为感知到的多汁性是复杂的，而且与影响酥脆度的因素相比，跳过静置步骤造成的任何汁液流失都微不足道。\n\n克里斯·杨的实验进一步挑战了传统观点。杨使用预测温度计证明，当肉在相同的最终内部温度下切片时，静置对汁液流失没有可测量的影响。格里泽解释说，之前的测试未能考虑到后熟效应，这会导致肉在静置时继续在内部烹饪，从而导致切片时的最终温度不同。\n\n格里泽进行了自己的感官测试，使用猪排和一个受控环境来评估在相同内部温度下切片的静置和未静置样品之间的多汁性。他发现后熟效应被严重低估，并且发生得很快，这使得在遵循传统静置建议时难以实现一致的切片温度。\n\n最终，该文章得出结论，静置肉类应被视为一种控制温度以防止因后熟效应导致过度烹饪的方法，而不是一种保留汁液的方法。"
  },
  {
    "id": "44659712",
    "title": "Tram Trains",
    "url": "https://www.worksinprogress.news/p/tram-trains",
    "summary": "This article advocates for the adoption of \"tram-trains\" as a cost-effective public transit solution for smaller cities and large towns. Tram-trains are vehicles that can operate both on traditional railway lines and on tram networks within city centers, eliminating the need for passengers to transfer and increasing the capacity of existing railway lines.\n\nThe city of Karlsruhe, Germany, serves as a successful case study, where the integration of tram and train networks significantly boosted ridership and expanded the transit system. The article acknowledges the technical challenges of combining different railway and tram systems, such as varying voltages and signaling systems, but argues that these can be overcome.\n\nSeveral alternative models of light rail are discussed, including dedicated tram lines (like Manchester) and tram-metros (like Düsseldorf), which involve tunnels under the city center. The article also mentions the historical \"interurbans\" that connected cities and towns, solving the \"last mile problem\" by running on streets.\n\nThe author concludes that tram-trains offer a practical and affordable way to improve public transit in cities like Oxford (UK), Tours (France), and Charlotte (USA), by connecting suburban railway lines to existing tram networks and providing direct access to city centers. While not suitable for all cities, tram-trains represent a viable solution for many that lack the resources for more extensive metro systems.\n",
    "chinese_title": "有轨电车-火车",
    "chinese_summary": "本文倡导采用“有轨电车-火车”作为中小型城市和大型城镇经济高效的公共交通解决方案。“有轨电车-火车”车辆既可以在传统铁路线路上运行，也可以在市中心的有轨电车网络上运行，从而无需乘客换乘，并提高了现有铁路线路的运力。\n\n德国卡尔斯鲁厄市是一个成功的案例，其有轨电车和火车网络的整合显著提高了客流量并扩展了公交系统。本文承认整合不同的铁路和有轨电车系统存在技术挑战，例如不同的电压和信号系统，但认为这些挑战是可以克服的。\n\n文章讨论了几种轻轨的替代模型，包括专用有轨电车线路（如曼彻斯特）和有轨电车-地铁（如杜塞尔多夫），后者涉及城市中心下方的隧道。文章还提到了连接城镇的昔日“城际铁路”，通过在街道上运行解决了“最后一英里问题”。\n\n作者总结认为，通过将郊区铁路线路连接到现有的有轨电车网络，并提供直达市中心的交通，有轨电车-火车为改善牛津（英国）、图尔（法国）和夏洛特（美国）等城市的公共交通提供了一种实用且经济的方式。虽然并不适合所有城市，但有轨电车-火车为许多缺乏更广泛地铁系统资源的城市提供了一种可行的解决方案。"
  },
  {
    "id": "44661527",
    "title": "FastVLM: Efficient Vision Encoding for Vision Language Models",
    "url": "https://machinelearning.apple.com/research/fast-vision-language-models",
    "summary": "This article introduces FastVLM, a new Vision Language Model (VLM) designed to improve the accuracy-latency trade-off in visual query processing, making it suitable for real-time on-device applications. The key innovation is the use of a hybrid vision encoder called FastViTHD, optimized for high-resolution images.\n\nTraditional VLMs face a challenge: higher image resolution increases accuracy but also significantly increases processing time and token count, leading to slower performance. FastVLM addresses this by using FastViTHD, which combines convolutional and transformer blocks to achieve a better balance between accuracy and speed. The researchers found FastViTHD to be superior to purely transformer-based or convolutional encoders.\n\nFastVLM outperforms existing token pruning and merging methods and delivers a simpler and more efficient architecture. Dynamic tiling, another approach to handle high-resolution images, is only beneficial when combined with FastVLM at extremely high resolutions. Comparative testing shows that FastVLM is significantly faster and more accurate than other popular VLMs of similar size.\n\nAn iOS/macOS demo app showcases FastVLM's on-device efficiency, highlighting its potential for near real-time performance and enabling new on-device AI experiences. The researchers emphasize that FastVLM's efficient design allows for practical applications where both accuracy and speed are crucial.\n",
    "chinese_title": "FastVLM：视觉语言模型的高效视觉编码",
    "chinese_summary": "本文介绍了FastVLM，一种新型视觉语言模型(VLM)，旨在改善视觉查询处理中的精度-延迟权衡，使其适用于实时设备端应用。其关键创新是使用一种名为FastViTHD的混合视觉编码器，该编码器针对高分辨率图像进行了优化。\n\n传统的VLM面临一个挑战：更高的图像分辨率提高了精度，但也显著增加了处理时间和token数量，导致性能下降。FastVLM通过使用FastViTHD来解决这个问题，它结合了卷积块和transformer块，从而在精度和速度之间取得更好的平衡。研究人员发现FastViTHD优于纯粹基于transformer或卷积的编码器。\n\nFastVLM优于现有的token剪枝和合并方法，并提供了更简单高效的架构。动态平铺是另一种处理高分辨率图像的方法，只有在极高的分辨率下与FastVLM结合使用时才有效益。对比测试表明，FastVLM比其他类似大小的流行VLM更快、更准确。\n\n一个iOS/macOS演示应用程序展示了FastVLM的设备端效率，突显了其近实时性能的潜力，并实现了新的设备端AI体验。研究人员强调，FastVLM的高效设计使其能够应用于精度和速度都至关重要的实际应用中。"
  },
  {
    "id": "44658978",
    "title": "Manticore Search: Fast, efficient, drop-in replacement for Elasticsearch",
    "url": "https://github.com/manticoresoftware/manticoresearch",
    "summary": "Manticore Search is a fast, open-source search database designed as a drop-in replacement for Elasticsearch. It boasts significant performance advantages over Elasticsearch and MySQL, achieving up to 182x faster speeds than MySQL and up to 29x faster than Elasticsearch in specific use cases. It features a modern multithreading architecture, row-wise and columnar storage options, PGM-index for efficient indexing, and a cost-based query optimizer.\n\nManticore is SQL-first, compatible with the MySQL protocol, and offers clients in various languages like PHP, Python, Java, Go, and Rust. It also provides an HTTP JSON protocol with Elasticsearch-compatible writes. Built in C++, it has a small memory footprint and supports real-time inserts, multi-master replication, and data syncing from various sources like MySQL, PostgreSQL, and CSV.\n\nKey features include full-text search, rich filtering, fuzzy search, faceted search, geo-spatial search, vector search, joining tables, spelling correction, autocomplete, and NLP capabilities. It also supports stream filtering, high availability, and data safety through backup tools.\n\nManticore integrates with various tools like ProxySQL, Grafana, and Kibana, and offers a Columnar Library. Installation options include Docker, packages for various operating systems, and cloud platforms like Elestio and Hosting Ukraine. The project offers documentation, interactive courses, and community support. Users can support Manticore through donations or by becoming clients, and the project is licensed under GPLv3.\n",
    "chinese_title": "Manticore Search：快速、高效、可替代 Elasticsearch 的即时可用方案",
    "chinese_summary": "Manticore Search 是一款快速的开源搜索数据库，旨在作为 Elasticsearch 的直接替代品。 它在特定用例中拥有比 Elasticsearch 和 MySQL 显著的性能优势，速度比 MySQL 快高达 182 倍，比 Elasticsearch 快高达 29 倍。 它具有现代化的多线程架构、行式和列式存储选项、用于高效索引的 PGM 索引以及基于成本的查询优化器。\n\nManticore 优先使用 SQL，兼容 MySQL 协议，并提供 PHP、Python、Java、Go 和 Rust 等多种语言的客户端。 它还提供具有 Elasticsearch 兼容写入功能的 HTTP JSON 协议。 Manticore 使用 C++ 构建，内存占用小，支持实时插入、多主复制以及从 MySQL、PostgreSQL 和 CSV 等各种来源的数据同步。\n\n主要功能包括全文搜索、丰富的过滤、模糊搜索、分面搜索、地理空间搜索、向量搜索、表连接、拼写校正、自动完成和 NLP 功能。 它还支持流过滤、高可用性以及通过备份工具实现的数据安全性。\n\nManticore 集成了 ProxySQL、Grafana 和 Kibana 等各种工具，并提供一个列式库。 安装选项包括 Docker、适用于各种操作系统的软件包以及 Elestio 和 Hosting Ukraine 等云平台。 该项目提供文档、互动课程和社区支持。 用户可以通过捐赠或成为客户来支持 Manticore，该项目已获得 GPLv3 许可。"
  },
  {
    "id": "44620020",
    "title": "How YouTube won the battle for TV viewers",
    "url": "https://www.wsj.com/business/media/how-youtube-won-the-battle-for-tv-viewers-346d05b8",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "YouTube 如何赢得电视观众之战",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "44661607",
    "title": "Interactive Programming in C (2014)",
    "url": "https://nullprogram.com/blog/2014/12/23/",
    "summary": "This article describes how to implement interactive programming in C, allowing modification and extension of a running program without restarting. The author was inspired by Casey Muratori's Handmade Hero project. The key technique involves building the majority of the application as a shared library. This requires avoiding global and static variables to prevent state loss upon reloading. C standard library usage may also be restricted due to potential global state. Careful management of function pointers is crucial to prevent issues after reloading.\n\nThe article uses a Game of Life demo as an example. The program is split into two parts: a \"game\" shared library and a \"main\" wrapper. The wrapper loads, reloads, and calls the shared library at regular intervals, remaining agnostic to the game's operation.\n\nThe \"game\" exposes its API through a `game_api` struct containing function pointers for initialization, finalization, reloading, unloading, and stepping the game. The library exports a single global variable, `GAME_API`, which is a filled-out instance of this struct.\n\nThe wrapper uses `dlopen()`, `dlsym()`, and `dlclose()` to load and unload the shared library. It tracks the library's inode using `stat()` to determine if it has been updated. The `game_load()` function handles loading the library, checking for updates, and handling potential errors like compilation still in progress. The main loop calls `game_load()` repeatedly, and if successful, executes the `step()` function of the game. The author concludes that this technique opens up the possibility of developing a full game in C with interactive development.\n",
    "chinese_title": "C语言交互式编程 (2014)",
    "chinese_summary": "本文描述了如何在 C 语言中实现交互式编程，允许在不重启的情况下修改和扩展正在运行的程序。作者受到了 Casey Muratori 的 Handmade Hero 项目的启发。关键技术是将应用程序的大部分构建为共享库。这需要避免全局和静态变量，以防止重新加载时状态丢失。由于潜在的全局状态，C 标准库的使用也可能受到限制。仔细管理函数指针对于防止重新加载后出现问题至关重要。\n\n本文使用生命游戏演示作为示例。该程序分为两个部分：“游戏”共享库和一个“主”包装器。包装器定期加载、重新加载和调用共享库，与游戏的运行无关。\n\n“游戏”通过一个 `game_api` 结构体暴露其 API，该结构体包含用于初始化、最终化、重新加载、卸载和步进游戏的函数指针。该库导出一个全局变量 `GAME_API`，它是这个结构体的已填充实例。\n\n包装器使用 `dlopen()`、`dlsym()` 和 `dlclose()` 来加载和卸载共享库。它使用 `stat()` 跟踪库的 inode，以确定它是否已更新。`game_load()` 函数处理加载库、检查更新以及处理潜在的错误，例如编译仍在进行中。主循环重复调用 `game_load()`，如果成功，则执行游戏的 `step()` 函数。作者总结说，这种技术开启了用 C 语言开发具有交互式开发的完整游戏的可能性。"
  },
  {
    "id": "44665984",
    "title": "A small web July",
    "url": "https://smallcypress.bearblog.dev/a-small-web-july/",
    "summary": "In a post titled \"A Small Web July\" dated June 29, 2025, the author, \"fern_enjoyer,\" proposes a self-imposed challenge to reduce time spent on the \"corporate web\" throughout July and seeks others to join in a shared accountability structure. The goal is to rewire their brain by minimizing exposure to algorithm-driven, attention-grabbing platforms and prioritize real-life engagement.\n\nSpecific rules include avoiding walled garden social media like Meta, Reddit, and potentially Bluesky, except for a daily check-in with a sobriety group. The author also aims to limit time spent on YouTube (discovery pages), news (to 15 minutes), and ad-filled, infinite-scroll sites like Pinterest, instead focusing on building their RSS reader, website, and skills with static site generators.\n\nThe author intends to shift focus to the physical world, following Oliver Burkeman's advice to ground oneself in tangible activities. Personal strategies include using a new notebook to process urges to scroll, cleaning and organizing their physical environment, expanding their RSS feed with desired content (including YouTube channels via RSS), increasing real-life social interactions, and pursuing skill-building activities like walking, baking, drawing, painting, and swimming. While aiming for additional positive habits, the author emphasizes self-compassion and flexibility in their approach, prioritizing well-being over rigid adherence to rules. The author will post updates on their blog (accessible via RSS) and invites readers to connect via email (fern_enjoyer at tutamail dot com) or wherever the post is shared.\n",
    "chinese_title": "小小的七月网络",
    "chinese_summary": "在2025年6月29日发布的题为“小型网络七月”的帖子中，作者“fern_enjoyer”提出了一项自我挑战，旨在减少七月份在“企业网络”上花费的时间，并寻求其他人加入共享问责制结构。目标是通过尽量减少接触算法驱动、引人注意的平台来重塑大脑，并优先考虑现实生活中的互动。\n\n具体规则包括避免像Meta、Reddit和潜在的Bluesky这样的围墙花园式社交媒体，但每天与清醒互助小组进行一次签到除外。作者还计划限制在YouTube（发现页面）、新闻（15分钟）和充满广告的无限滚动网站（如Pinterest）上花费的时间，而是专注于构建他们的RSS阅读器、网站以及使用静态站点生成器的技能。\n\n作者打算将重点转移到现实世界，遵循奥利弗·伯克曼的建议，让自己沉浸在实际活动中。个人策略包括使用新的笔记本电脑来处理滚动浏览的冲动，清理和整理他们的物理环境，使用所需内容（包括通过RSS订阅的YouTube频道）扩展他们的RSS源，增加现实生活中的社交互动，以及追求步行、烘焙、绘画、游泳等技能培养活动。在追求更多积极习惯的同时，作者强调自我同情和方法的灵活性，优先考虑幸福感而不是严格遵守规则。作者将在他们的博客（可通过RSS访问）上发布更新，并邀请读者通过电子邮件（fern_enjoyer at tutamail dot com）或帖子分享的任何地方进行联系。"
  },
  {
    "id": "44655921",
    "title": "When Is WebAssembly Going to Get DOM Support?",
    "url": "https://queue.acm.org/detail.cfm?id=3746174",
    "summary": "This article from ACM Queue, published in July 2025, addresses the question of when WebAssembly (Wasm) will gain direct DOM support. It argues that while true direct DOM access might not be a priority, Wasm is already production-ready for web applications due to its interoperability with JavaScript.\n\nWasm's design inherently separates it from JavaScript, unlike asm.js. Instead of creating new Wasm-specific versions of web APIs like the DOM, the article explains how existing JavaScript APIs are sufficient. Wasm modules can interact with JavaScript code through compiler-generated glue code. This glue code allows Wasm to call JavaScript functions, which in turn interact with the DOM.\n\nThe article details how Wasm can model complex data structures, like objects, through a system of integer indices referencing a JavaScript array. While this introduces a degree of indirection, the author asserts that the performance hit is often less significant than other overheads associated with running code in the browser.\n\nThe article acknowledges limitations and slowdowns resulting from early methods, such as emulating exceptions or blocking I/O. However, recent WebAssembly advancements have focused on improving performance by optimizing calls between Wasm and JavaScript, adding native exception handling, enabling pausing for JavaScript Promises, and allowing direct referencing of JavaScript values on the stack.\n\nThe author discusses the possibility of using the Wasm Component Model to provide more direct access to web APIs, drawing a parallel to Web IDL. However, it notes the complexities of adapting Web IDL, given its current JavaScript-centric nature and the subtle variations in browser implementations. Ultimately, the article concludes that while direct DOM access remains a long-term possibility, current Wasm and JavaScript integration is practical and continues to improve.\n",
    "chinese_title": "WebAssembly何时才能获得DOM支持？",
    "chinese_summary": "这篇发表于2025年7月的ACM Queue文章探讨了WebAssembly (Wasm) 何时能获得直接DOM支持。文章认为，虽然真正的直接DOM访问可能并非首要任务，但由于Wasm与JavaScript的互操作性，它已经为Web应用程序做好了生产准备。\n\nWasm的设计本质上将其与JavaScript分离，这与asm.js不同。文章解释说，无需创建新的Wasm专用Web API（如DOM），现有的JavaScript API就已足够。Wasm模块可以通过编译器生成的粘合代码与JavaScript代码交互。这种粘合代码允许Wasm调用JavaScript函数，进而与DOM交互。\n\n文章详细介绍了Wasm如何通过引用JavaScript数组的整数索引系统来建模复杂的数据结构（如对象）。虽然这引入了一定程度的间接性，但作者认为性能损失通常低于与在浏览器中运行代码相关的其他开销。\n\n文章承认了早期方法（如模拟异常或阻塞I/O）导致的限制和减速。然而，最近的WebAssembly进展侧重于通过优化Wasm和JavaScript之间的调用、添加原生异常处理、启用JavaScript Promises的暂停以及允许直接引用堆栈上的JavaScript值来提高性能。\n\n作者讨论了使用Wasm组件模型来提供对Web API更直接访问的可能性，并将其与Web IDL进行了类比。然而，文章指出，鉴于Web IDL目前以JavaScript为中心以及浏览器实现中的细微差异，调整Web IDL的复杂性。最终，文章得出结论：虽然直接DOM访问仍然是一个长期的可能性，但当前的Wasm和JavaScript集成是实用的，并且还在不断改进。"
  },
  {
    "id": "44639828",
    "title": "Kimi-K2 Tech Report [pdf]",
    "url": "https://github.com/MoonshotAI/Kimi-K2/blob/main/tech_report.pdf",
    "summary": "This \"Kimi-K2 Tech Report\" from MoonshotAI's public repository showcases their project \"Kimi-K2,\" which appears to be attracting significant attention within the tech community. The report highlights the following key information:\n\n*   **Source:** The report originates from MoonshotAI, a company or organization involved in AI research and development.\n*   **Project Name:** The focus is on \"Kimi-K2,\" likely a specific AI model, application, or research initiative.\n*   **Public Availability:** The repository is publicly accessible, indicating a level of openness and transparency from MoonshotAI.\n*   **Community Engagement:** The project has garnered considerable interest, evidenced by 7,000 stars and 441 forks on the platform. This suggests active community involvement, contributions, or use of the project.\n*   **Platform Features:** The report makes use of platform features such as Notifications, Fork and Star.\n\nIn essence, the report signals a potentially noteworthy AI project (\"Kimi-K2\") by MoonshotAI that has resonated with a considerable number of developers and researchers, prompting them to engage with the project publicly. The specifics of the technology or research within Kimi-K2 itself are not detailed in the provided text, but its popularity suggests innovation.\n",
    "chinese_title": "Kimi-K2 技术报告 [pdf]",
    "chinese_summary": "MoonshotAI的“Kimi-K2技术报告”展示了他们的项目“Kimi-K2”，该项目似乎在技术社区中引起了广泛关注。报告重点介绍了以下关键信息：\n\n*   **来源：** 该报告来自MoonshotAI，一家从事人工智能研发的公司或组织。\n*   **项目名称：** 重点是“Kimi-K2”，可能是一个特定的人工智能模型、应用程序或研究计划。\n*   **公开可用性：** 该存储库可公开访问，表明MoonshotAI具有一定程度的开放性和透明度。\n*   **社区参与：** 该项目已获得相当大的关注，平台上有7000个星标和441个Fork可以证明这一点。这表明社区活跃参与、贡献或使用该项目。\n*   **平台功能：** 该报告使用了通知、Fork和Star等平台功能。\n\n本质上，该报告表明MoonshotAI的一个潜在的值得关注的人工智能项目（“Kimi-K2”）已引起了相当数量的开发者和研究人员的共鸣，促使他们公开参与该项目。 Kimi-K2本身的技术或研究细节在提供的文本中未详细说明，但其受欢迎程度表明了创新。"
  },
  {
    "id": "44632739",
    "title": "Leprechauns, root causes, and other fairy tales",
    "url": "https://www.tomdalling.com/blog/software-processes/leprechauns-root-causes-and-other-fairy-tails/",
    "summary": "This talk challenges the common practice of root cause analysis after incidents, arguing that it's a flawed approach based on a misunderstanding of how complex systems fail. Drawing heavily from Richard Cook's paper \"How Complex Systems Fail,\" the speaker asserts that incidents in complex systems aren't caused by a single \"root cause,\" but rather by the convergence of multiple failures.\n\nComplex systems, like banks or large software systems, are inherently hazardous and constantly operating in a degraded mode, experiencing minor failures all the time. These systems are heavily defended against failure, preventing small issues from escalating into major catastrophes. However, these defenses are imperfect, and major incidents occur when multiple failures align and slip through the defensive layers.\n\nThe speaker emphasizes that attributing accidents to a single \"root cause\" is fundamentally wrong and driven by a social need for blame (scapegoating). Root cause analysis often leads to the addition of new rules and processes, paradoxically increasing complexity and potentially raising the risk of future incidents. Instead of focusing on finding a scapegoat, the speaker suggests exploring alternative models like the Swiss cheese model of accident causation. The core message is that root causes are mythical, akin to leprechauns, and a more nuanced understanding of complex systems is needed for effective incident management and risk reduction.\n",
    "chinese_title": "小妖精、根本原因及其他神话",
    "chinese_summary": "This talk challenges the common practice of root cause analysis after incidents, arguing that it's a flawed approach based on a misunderstanding of how complex systems fail. Drawing heavily from Richard Cook's paper \"How Complex Systems Fail,\" the speaker asserts that incidents in complex systems aren't caused by a single \"root cause,\" but rather by the convergence of multiple failures.\n\nComplex systems, like banks or large software systems, are inherently hazardous and constantly operating in a degraded mode, experiencing minor failures all the time. These systems are heavily defended against failure, preventing small issues from escalating into major catastrophes. However, these defenses are imperfect, and major incidents occur when multiple failures align and slip through the defensive layers.\n\nThe speaker emphasizes that attributing accidents to a single \"root cause\" is fundamentally wrong and driven by a social need for blame (scapegoating). Root cause analysis often leads to the addition of new rules and processes, paradoxically increasing complexity and potentially raising the risk of future incidents. Instead of focusing on finding a scapegoat, the speaker suggests exploring alternative models like the Swiss cheese model of accident causation. The core message is that root causes are mythical, akin to leprechauns, and a more nuanced understanding of complex systems is needed for effective incident management and risk reduction.\n"
  },
  {
    "id": "44669393",
    "title": "System View for Inspecting DSM Registry Allocations in PostgreSQL",
    "url": "https://tselai.com/pg-dsm-registry-allocations",
    "summary": "生成摘要时出错",
    "chinese_title": "System View for Inspecting DSM Registry Allocations in PostgreSQL",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44658909",
    "title": "Reverse engineering GitHub Actions cache to make it fast",
    "url": "https://www.blacksmith.sh/blog/cache",
    "summary": "生成摘要时出错",
    "chinese_title": "Reverse engineering GitHub Actions cache to make it fast",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44631042",
    "title": "Geocities Backgrounds",
    "url": "https://pixelmoondust.neocities.org/archives/archivedtiles/backgroundsindex",
    "summary": "生成摘要时出错",
    "chinese_title": "Geocities Backgrounds",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44655515",
    "title": "AI coding agents are removing programming language barriers",
    "url": "https://railsatscale.com/2025-07-19-ai-coding-agents-are-removing-programming-language-barriers/",
    "summary": "生成摘要时出错",
    "chinese_title": "AI coding agents are removing programming language barriers",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44661862",
    "title": "A diverse cast of rocky worlds around a small star revealed by astronomers",
    "url": "https://nouvelles.umontreal.ca/en/article/2025/07/22/a-udem-team-confirms-a-fifth-potentially-habitable-planet-around-l-98-59-a-red-dwarf-35-l/",
    "summary": "生成摘要时出错",
    "chinese_title": "A diverse cast of rocky worlds around a small star revealed by astronomers",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44655565",
    "title": "Mathematics for Computer Science (2024)",
    "url": "https://ocw.mit.edu/courses/6-1200j-mathematics-for-computer-science-spring-2024/",
    "summary": "生成摘要时出错",
    "chinese_title": "Mathematics for Computer Science (2024)",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44632045",
    "title": "SIMD Perlin Noise: Beating the Compiler with SSE (2014)",
    "url": "https://scallywag.software/vim/blog/simd-perlin-noise-i",
    "summary": "生成摘要时出错",
    "chinese_title": "SIMD Perlin Noise: Beating the Compiler with SSE (2014)",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44656073",
    "title": "Extending Emacs with Fennel (2024)",
    "url": "https://andreyor.st/posts/2024-12-20-extending-emacs-with-fennel/",
    "summary": "生成摘要时出错",
    "chinese_title": "Extending Emacs with Fennel (2024)",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44660519",
    "title": "You can now disable all AI features in Zed",
    "url": "https://zed.dev/blog/disable-ai-features",
    "summary": "生成摘要时出错",
    "chinese_title": "You can now disable all AI features in Zed",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44584830",
    "title": "I'm Unsatisfied with Easing Functions",
    "url": "https://www.davepagurek.com/blog/easing-functions/",
    "summary": "生成摘要时出错",
    "chinese_title": "I'm Unsatisfied with Easing Functions",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44660736",
    "title": "Show HN: The missing link of a bookstore's tech stack",
    "url": "https://bookhead.net/",
    "summary": "生成摘要时出错",
    "chinese_title": "Show HN: The missing link of a bookstore's tech stack",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44658820",
    "title": "Using Radicle CI",
    "url": "https://radicle.xyz/2025/07/23/using-radicle-ci-for-development",
    "summary": "生成摘要时出错",
    "chinese_title": "Using Radicle CI",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44638304",
    "title": "SQL Injection as a Feature",
    "url": "https://idiallo.com/blog/sql-injection-as-a-feature",
    "summary": "生成摘要时出错",
    "chinese_title": "SQL Injection as a Feature",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44657727",
    "title": "Cerebras launches Qwen3-235B, achieving 1.5k tokens per second",
    "url": "https://www.cerebras.ai/press-release/cerebras-launches-qwen3-235b-world-s-fastest-frontier-ai-model-with-full-131k-context-support",
    "summary": "生成摘要时出错",
    "chinese_title": "Cerebras launches Qwen3-235B, achieving 1.5k tokens per second",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44653072",
    "title": "Qwen3-Coder: Agentic coding in the world",
    "url": "https://qwenlm.github.io/blog/qwen3-coder/",
    "summary": "生成摘要时出错",
    "chinese_title": "Qwen3-Coder: Agentic coding in the world",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44662497",
    "title": "Show HN: TheProtector – Linux Bash script for the paranoid admin on a budget",
    "url": "https://github.com/IHATEGIVINGAUSERNAME/theProtector",
    "summary": "生成摘要时出错",
    "chinese_title": "Show HN: TheProtector – Linux Bash script for the paranoid admin on a budget",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44658973",
    "title": "The Surprising gRPC Client Bottleneck in Low-Latency Networks",
    "url": "https://blog.ydb.tech/the-surprising-grpc-client-bottleneck-in-low-latency-networks-and-how-to-get-around-it-69d6977a1d02",
    "summary": "生成摘要时出错",
    "chinese_title": "低延迟网络中令人惊讶的 gRPC 客户端瓶颈",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44664875",
    "title": "Morally corrupt innovations are the easiest innovations to create",
    "url": "https://ceoretort.com/journal/ethics/2025/05/16/morally-corrupt-innovations-are-the-easiest-innovations-to-create-its-the-lazy-approach-with-dangerous-consequences/",
    "summary": "生成摘要时出错",
    "chinese_title": "Morally corrupt innovations are the easiest innovations to create",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44656105",
    "title": "Rescuing two PDP-11s from a former British Telecom underground shelter (2023)",
    "url": "https://forum.vcfed.org/index.php?threads/rescuing-two-pdp-11-systems-in-uk-from-a-former-big-british-telecom-underground-shelter-in-central-london.1244723/page-2",
    "summary": "生成摘要时出错",
    "chinese_title": "Rescuing two PDP-11s from a former British Telecom underground shelter (2023)",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44668910",
    "title": "The Cells That Breathe Two Ways",
    "url": "https://www.quantamagazine.org/the-cells-that-breathe-two-ways-20250723/",
    "summary": "生成摘要时出错",
    "chinese_title": "The Cells That Breathe Two Ways",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44657433",
    "title": "Checking Out CPython 3.14's remote debugging protocol",
    "url": "https://rtpg.co/2025/06/28/checking-out-sys-remote-exec/",
    "summary": "生成摘要时出错",
    "chinese_title": "Checking Out CPython 3.14's remote debugging protocol",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44622637",
    "title": "AI groups spend to replace low-cost 'data labellers' with high-paid experts",
    "url": "https://www.ft.com/content/e17647f0-4c3b-49b4-a031-b56158bbb3b8",
    "summary": "生成摘要时出错",
    "chinese_title": "AI groups spend to replace low-cost 'data labellers' with high-paid experts",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44667975",
    "title": "SETI at the Extremes",
    "url": "https://www.centauri-dreams.org/2025/07/22/seti-at-the-extremes/",
    "summary": "生成摘要时出错",
    "chinese_title": "SETI at the Extremes",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44619835",
    "title": "Reversing a Fingerprint Reader Protocol (2021)",
    "url": "https://blog.th0m.as/misc/fingerprint-reversing/",
    "summary": "生成摘要时出错",
    "chinese_title": "Reversing a Fingerprint Reader Protocol (2021)",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44655385",
    "title": "Org tutorials",
    "url": "https://orgmode.org/worg/org-tutorials/index.html",
    "summary": "生成摘要时出错",
    "chinese_title": "Org tutorials",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44665365",
    "title": "There's a Reason Bar Ice Looks Better Than Yours (and You Can Fix It)",
    "url": "https://www.seriouseats.com/how-to-make-clear-cocktail-ice-11773197",
    "summary": "生成摘要时出错",
    "chinese_title": "There's a Reason Bar Ice Looks Better Than Yours (and You Can Fix It)",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44669131",
    "title": "VectorDB bench now support S3Vector",
    "url": "https://github.com/zilliztech/VectorDBBench/pull/570",
    "summary": "生成摘要时出错",
    "chinese_title": "VectorDB bench now support S3Vector",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44665704",
    "title": "Vintage Macintosh Programming Book Library (2017)",
    "url": "https://vintageapple.org/macprogramming/index_year.html",
    "summary": "生成摘要时出错",
    "chinese_title": "Vintage Macintosh Programming Book Library (2017)",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44639880",
    "title": "Robot scans rare library books at 2.5k pages per hour",
    "url": "https://www.popsci.com/technology/book-scanning-robot/",
    "summary": "生成摘要时出错",
    "chinese_title": "Robot scans rare library books at 2.5k pages per hour",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44669610",
    "title": "Intel 18A Details and Cost, Future of DRAM 4F2 vs. 3D, Backside Power Adoption",
    "url": "https://semianalysis.com/2025/07/21/vlsi2025/",
    "summary": "生成摘要时出错",
    "chinese_title": "Intel 18A Details and Cost, Future of DRAM 4F2 vs. 3D, Backside Power Adoption",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44662690",
    "title": "How to increase your surface area for luck",
    "url": "https://usefulfictions.substack.com/p/how-to-increase-your-surface-area",
    "summary": "生成摘要时出错",
    "chinese_title": "How to increase your surface area for luck",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44622954",
    "title": "Using uninitialized memory for fun and profit (2008)",
    "url": "https://research.swtch.com/sparse",
    "summary": "生成摘要时出错",
    "chinese_title": "Using uninitialized memory for fun and profit (2008)",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44659661",
    "title": "Show HN: Self-updating MCP server for official pip, uv, poetry and conda docs",
    "url": "https://github.com/KemingHe/python-dependency-manager-companion-mcp-server",
    "summary": "生成摘要时出错",
    "chinese_title": "Show HN: Self-updating MCP server for official pip, uv, poetry and conda docs",
    "chinese_summary": "生成摘要时出错"
  }
]