[
  {
    "id": "45857053",
    "title": "Ticker: Don't Die of Heart Disease",
    "url": "https://myticker.com/",
    "summary": "Jared Hecht's article \"Ticker: Don't Die of Heart Disease\" argues that heart disease is a preventable leading cause of death often overlooked by standard medical practices. Hecht shares his personal experience of discovering early-stage heart disease through advanced testing offered by concierge medicine, in contrast to the \"totally okay\" assessment he received from a primary care physician using standard lipid panels.\n\nThe core message is that individuals must advocate for their own heart health. Hecht emphasizes that standard medical practices often miss crucial biomarkers like ApoB and Lp(a), and that accessible and affordable testing (around $300 annually) can detect early warning signs. These tests, coupled with lifestyle changes and medication, can significantly reduce the risk of heart attacks.\n\nHecht provides a roadmap for taking control of heart health, urging readers to demand comprehensive testing from their doctors and understand the results. He aims to democratize the knowledge and practices typically reserved for the wealthy, empowering individuals in their 30s and 40s to proactively manage their heart health and avoid becoming a statistic. He believes a consumer-facing company focused on heart disease prevention is needed, and hopes this guide will spark interest and action.\n",
    "chinese_title": "股票代码：别死于心脏病",
    "chinese_summary": "贾里德·赫克特的文章《定时炸弹：别死于心脏病》指出，心脏病是一种可预防的主要死因，却常常被标准医疗手段忽视。赫克特分享了他通过私人定制医疗服务提供的高级检测发现早期心脏病的个人经历，这与他通过使用标准血脂检查从初级保健医生那里得到的“完全正常”的评估形成对比。\n\n核心信息是，个人必须为自己的心脏健康负责。赫克特强调，标准医疗实践往往会遗漏ApoB和Lp(a)等关键生物标志物，而经济实惠且易于获得的检测（每年约300美元）可以检测到早期预警信号。这些检测，再加上生活方式的改变和药物治疗，可以显著降低心脏病发作的风险。\n\n赫克特为掌控心脏健康提供了一个路线图，敦促读者要求他们的医生进行全面的检查并理解结果。他的目标是普及通常为富人保留的知识和实践，使30多岁和40多岁的人能够积极地管理自己的心脏健康，避免成为统计数据中的一员。他认为需要一家专注于心脏病预防的面向消费者的公司，并希望这份指南能够激发人们的兴趣和行动。"
  },
  {
    "id": "45857016",
    "title": "Zig is so cool, C is cooler",
    "url": "https://github.com/little-book-of/c/blob/main/articles/zig-is-cool-c-is-cooler.md",
    "summary": "This looks like a webpage excerpt for a project titled \"little-book-of/c\" hosted on a platform (likely GitHub or similar). The title \"Zig is so cool, C is cooler\" suggests a playful comparison between the Zig programming language and the C programming language. The \"little-book-of/c\" likely refers to a project that is a small, introductory resource or tutorial about the C programming language.\n\nKey takeaways:\n\n*   **Project Name:** little-book-of/c (suggesting a small, introductory resource on C)\n*   **Theme:** Comparison between Zig and C (favoring C, implied by the title)\n*   **Audience:** People interested in learning C or comparing it to Zig.\n*   **Engagement:** Relatively low fork count (16) but a decent star count (332), suggesting reasonable popularity and interest.\n",
    "chinese_title": "Zig很酷，C更酷。",
    "chinese_summary": "这看起来像是托管在某个平台（可能是 GitHub 或类似平台）上的一个名为 \"little-book-of/c\" 的项目的网页摘要。标题 \"Zig 很酷，C 更酷\" 暗示了 Zig 编程语言和 C 编程语言之间的趣味比较。\"little-book-of/c\" 可能指的是一个关于 C 编程语言的小型入门资源或教程项目。\n\n要点：\n\n*   **项目名称：** little-book-of/c（暗示一个关于 C 的小型入门资源）\n*   **主题：** Zig 和 C 之间的比较（标题暗示倾向于 C）\n*   **受众：** 对学习 C 或将 C 与 Zig 进行比较的人。\n*   **互动：** 分叉数相对较低（16），但星数相当可观（332），表明具有一定的受欢迎程度和关注度。"
  },
  {
    "id": "45857836",
    "title": "Cloudflare Scrubs Aisuru Botnet from Top Domains List",
    "url": "https://krebsonsecurity.com/2025/11/cloudflare-scrubs-aisuru-botnet-from-top-domains-list/",
    "summary": "Cloudflare has been grappling with the Aisuru botnet, a rapidly growing network of compromised IoT devices, after its domains unexpectedly topped Cloudflare's ranking of most frequently requested websites. This botnet, capable of launching massive DDoS attacks, initially used Google's DNS servers but switched to Cloudflare's (1.1.1.1), leading to its domains dominating Cloudflare's rankings.\n\nThe surge in Aisuru domains raised concerns about security, brand confusion (due to mimicry of major cloud providers), and privacy (one domain being a street address). Cloudflare responded by redacting the malicious domains and adding a disclaimer about malicious behavior impacting the rankings. CEO Matthew Prince explained that the ranking system is based on DNS query volume, which Aisuru is manipulating to both attack Cloudflare's DNS service and potentially influence the ranking.\n\nExperts are divided on Cloudflare's handling of the situation. Some, like Renee Burton, acknowledge the complexities of ranking domains based on DNS queries. Others, like Alex Greenland, criticize Cloudflare for compromising the integrity of its rankings, arguing that the system should reflect real human use, not automated traffic. He suggests separating malicious domains entirely due to the widespread use of Cloudflare's rankings for trust and safety determination.\n\nWhile Cloudflare has begun hiding Aisuru domains from its web list, they still appear in downloaded spreadsheets. The majority of DNS queries to these domains originate from the US, aligning with previous findings about Aisuru's reliance on compromised IoT devices hosted on US ISPs. Experts recommend blocking domains ending in \".su\" (the former Soviet Union TLD) as a simple way to detect potential Aisuru bot activity, given its frequent use in cybercrime.\n",
    "chinese_title": "Cloudflare 清理了顶级域名列表中的 Aisuru 僵尸网络",
    "chinese_summary": "Cloudflare正应对Aisuru僵尸网络，该网络由大量受感染的物联网设备组成，并且增长迅速。起因是其域名意外地在Cloudflare最常被请求的网站排名中名列前茅。这个能够发起大规模DDoS攻击的僵尸网络最初使用Google的DNS服务器，但随后切换到Cloudflare的（1.1.1.1），导致其域名在Cloudflare的排名中占据主导地位。\n\nAisuru域名激增引发了对安全性、品牌混淆（由于模仿主要云提供商）和隐私（一个域名是一个街道地址）的担忧。Cloudflare的回应是编辑了恶意域名，并添加了关于恶意行为影响排名的声明。首席执行官Matthew Prince解释说，排名系统是基于DNS查询量，Aisuru正在操纵该查询量，既攻击Cloudflare的DNS服务，又可能影响排名。\n\n专家们对Cloudflare处理此事的方式存在分歧。一些人，如Renee Burton，承认基于DNS查询对域名进行排名的复杂性。另一些人，如Alex Greenland，批评Cloudflare损害了其排名的完整性，认为该系统应该反映真实的人类使用情况，而不是自动化流量。他建议完全分离恶意域名，因为Cloudflare的排名被广泛用于信任和安全判断。\n\n虽然Cloudflare已经开始从其网站列表中隐藏Aisuru域名，但它们仍然出现在下载的电子表格中。对这些域名的大部分DNS查询来自美国，这与之前关于Aisuru依赖于托管在美国ISP上的受感染物联网设备的发现相符。专家建议阻止以“.su”（前苏联顶级域名）结尾的域名，作为检测潜在Aisuru僵尸网络活动的一种简单方法，因为它经常被用于网络犯罪。"
  },
  {
    "id": "45856987",
    "title": "Btop: A better modern alternative of htop with a gamified interface",
    "url": "https://github.com/aristocratos/btop",
    "summary": "Btop is a C++ resource monitor and a modern alternative to htop, offering a game-inspired menu system and full mouse support. It displays usage and stats for processor, memory, disks, network, and processes.\n\nKey features include a responsive UI, process filtering, easy sorting, tree view, signal sending, UI configuration menu, auto-scaling network graphs, disk IO activity, battery meter, and custom presets.\n\nThe software supports themes and searches for them in specific directories. It encourages user contributions of new themes. Sponsorship and donations are welcome.\n\nBtop requires a terminal with truecolor support, a UTF8 locale, and a font that supports Unicode braille patterns, geometric shapes, box drawing, and block elements. Optional GPU monitoring dependencies are available for Linux (NVIDIA, AMD, INTEL).\n\nInstallation instructions are provided for various Linux distributions (openSUSE, Fedora, RHEL/Rocky/AlmaLinux), FreeBSD, NetBSD, macOS (via Homebrew), and Linux (via Homebrew). Compilation instructions are detailed for Linux and macOS, including options for GPU support and static linking. For Linux, users can compile with either Make or CMake.\n",
    "chinese_title": "Btop：一款优于 htop 且具有游戏化界面的现代替代品",
    "chinese_summary": "Btop：一款现代C++资源监视器，是htop的替代品，提供游戏风格的菜单系统和完整的鼠标支持。它显示处理器、内存、磁盘、网络和进程的使用情况和统计信息。\n\n主要功能包括响应式UI、进程过滤、轻松排序、树状视图、信号发送、UI配置菜单、自适应缩放网络图、磁盘IO活动、电池电量显示和自定义预设。\n\n该软件支持主题，并在特定目录中搜索主题。它鼓励用户贡献新的主题。欢迎赞助和捐赠。\n\nBtop需要支持真彩色的终端、UTF8区域设置以及支持Unicode盲文图案、几何形状、框线绘制和块元素的字体。Linux（NVIDIA、AMD、INTEL）提供可选的GPU监控依赖项。\n\n提供了适用于各种Linux发行版（openSUSE、Fedora、RHEL/Rocky/AlmaLinux）、FreeBSD、NetBSD、macOS（通过Homebrew）和Linux（通过Homebrew）的安装说明。详细说明了Linux和macOS的编译说明，包括GPU支持和静态链接的选项。对于Linux，用户可以使用Make或CMake进行编译。"
  },
  {
    "id": "45857045",
    "title": "An Algebraic Language for the Manipulation of Symbolic Expressions (1958) [pdf]",
    "url": "https://softwarepreservation.computerhistory.org/LISP/MIT/AIM-001.pdf",
    "summary": "This document is a PDF file containing \"An Algebraic Language for the Manipulation of Symbolic Expressions\" (1958). However, the content provided is largely PDF metadata and compressed data streams, rather than the actual text of the article. There's a substantial amount of binary data, seemingly related to font definitions, image data, and other PDF formatting elements. There is also what appears to be compressed image data stored as binary.\n\nBecause the core text of the article is encoded within these data streams, it is impossible to discern the actual contents, arguments, or conclusions of the paper. The only information readily extractable from the provided snippet is the title, and the year the article was written.\n",
    "chinese_title": "用于符号表达式操作的代数语言（1958）[pdf]",
    "chinese_summary": "该文档是一个PDF文件，包含“用于操作符号表达式的代数语言”（1958）。然而，所提供的内容主要是PDF元数据和压缩数据流，而非文章的实际文本。存在大量的二进制数据，似乎与字体定义、图像数据和其他PDF格式化元素有关。还有一些看起来像是被压缩的图像数据，以二进制形式存储。\n\n由于文章的核心文本被编码在这些数据流中，因此无法辨别论文的实际内容、论点或结论。从提供的片段中唯一容易提取的信息是标题和文章的撰写年份。"
  },
  {
    "id": "45856804",
    "title": "AI benchmarks are a bad joke – and LLM makers are the ones laughing",
    "url": "https://www.theregister.com/2025/11/07/measuring_ai_models_hampered_by/",
    "summary": "生成摘要时出错",
    "chinese_title": "AI 基准测试是个糟糕的笑话——而大语言模型厂商正在暗自发笑",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45799157",
    "title": "C++ move semantics from scratch (2022)",
    "url": "https://cbarrete.com/move-from-scratch.html",
    "summary": "This article explains C++ move semantics from the ground up, starting with a hypothetical scenario where they don't exist. It aims to provide a clear understanding, de-emphasizing the role of `std::move` in initial explanations.\n\nThe core concept is that rvalue references (`&&`) are essentially \"colored\" versions of regular lvalue references (`&`). They behave identically but are incompatible, allowing function overloading to discriminate between them. This distinction enables a specific optimization strategy: instead of copying large data structures (like vectors), data can be \"moved\" or \"stolen\" by transferring ownership. This involves copying metadata and pointing to the existing heap-allocated data, then nullifying the original container to prevent errors.\n\nThe article presents the evolution of this idea, ultimately using rvalue references to signal intent to \"move\" data instead of copying. Special constructors and assignment operators are created which take rvalue references. Within, algorithms are written to \"steal\" from one object and transfer the data to another. \n\nIt then discusses resource management applications, such as `std::shared_ptr` and `std::unique_ptr`, where moving can avoid costly reference count updates or enforce exclusive ownership.\n\nFinally, it explains that `std::move` is merely a cast to an rvalue reference. It calls a specific overload of a function or constructor, which, by convention, implements a \"move\" operation or falls back to copying if moving isn't applicable. The key takeaway is that move semantics are driven by function overloads designed to handle rvalue references differently, not by any inherent magic.\n",
    "chinese_title": "从零开始的C++移动语义 (2022)",
    "chinese_summary": "本文从头开始解释 C++ 移动语义，首先设想一种不存在移动语义的场景。 旨在提供清晰的理解，并在最初的解释中弱化 `std::move` 的作用。\n\n核心概念是右值引用 (`&&`) 本质上是常规左值引用 (`&`) 的“着色”版本。 它们的行为相同但互不兼容，从而允许函数重载来区分它们。 这种区分实现了一种特定的优化策略：无需复制大型数据结构（如 vectors），可以通过转移所有权来“移动”或“窃取”数据。 这涉及复制元数据并指向现有的堆分配数据，然后将原始容器置为空以防止错误。\n\n本文介绍了这个想法的演变，最终使用右值引用来表示“移动”数据而不是复制的意图。 创建特殊的构造函数和赋值运算符来接受右值引用。 在其中，编写算法以从一个对象“窃取”数据并将数据传输到另一个对象。\n\n然后，文章讨论了资源管理应用程序，例如 `std::shared_ptr` 和 `std::unique_ptr`，其中移动可以避免昂贵的引用计数更新或强制执行独占所有权。\n\n最后，文章解释了 `std::move` 仅仅是一个到右值引用的强制转换。 它调用函数的特定重载或构造函数，按照惯例，该函数或构造函数实现“移动”操作，如果移动不适用，则回退到复制。 关键在于，移动语义是由旨在不同地处理右值引用的函数重载驱动的，而不是由任何固有的魔力驱动的。"
  },
  {
    "id": "45852328",
    "title": "Why is Zig so cool?",
    "url": "https://nilostolte.github.io/tech/articles/ZigCool.html",
    "summary": "This article introduces Zig, a programming language praised for its ability to compile C code and cross-compile to different architectures. It emphasizes Zig's unique approach to programming, going beyond being a simple C/C++ replacement.\n\nThe article guides beginners through installing the Zig compiler and building a basic \"Hello World!\" program. It then dives into core Zig concepts and commands, including variable declarations, structs, anonymous structs, test blocks, and bitfields. It highlights Zig's syntax for loops and arrays, emphasizing automatic type inference and efficient memory management.\n\nA key feature discussed is Zig's \"test block,\" which allows in-module testing without separate executables, facilitating prototyping and validation. The article touches on Zig's OOP capabilities using structs with functions and explains how to build and execute Zig programs.\n\nDebugging is addressed using the `@breakpoint` built-in, a \"hack\" for debugging optimized code without symbols, enabling developers to inspect variable values at specific points using `std.debug.print`.\n\nFinally, the article briefly touches upon Zig's capabilities for low-level programming.\n",
    "chinese_title": "Zig 为什么这么酷？",
    "chinese_summary": "本文介绍了 Zig 编程语言，它因能够编译 C 代码并交叉编译到不同的架构而备受赞誉。文章强调了 Zig 独特的编程方法，超越了简单地替代 C/C++。\n\n文章指导初学者安装 Zig 编译器并构建一个基本的 \"Hello World!\" 程序。然后深入探讨 Zig 的核心概念和命令，包括变量声明、结构体、匿名结构体、测试块和位域。文章重点介绍了 Zig 的循环和数组语法，强调自动类型推断和高效的内存管理。\n\n讨论的一个关键特性是 Zig 的“测试块”，它允许在模块内进行测试，而无需单独的可执行文件，从而方便原型设计和验证。文章还介绍了 Zig 使用带有函数的结构体实现的面向对象编程功能，并解释了如何构建和执行 Zig 程序。\n\n调试部分介绍了使用 `@breakpoint` 内置函数，这是一种用于调试没有符号的优化代码的“hack”方法，使开发人员能够使用 `std.debug.print` 在特定点检查变量值。\n\n最后，文章简要介绍了 Zig 在底层编程方面的能力。"
  },
  {
    "id": "45852854",
    "title": "Valdi – A cross-platform UI framework that delivers native performance",
    "url": "https://github.com/Snapchat/Valdi",
    "summary": "Valdi is a cross-platform UI framework designed for native performance and developer velocity. It's currently in beta, but has been used in Snap's production apps for 8 years. Unlike other cross-platform frameworks that rely on web views, Valdi compiles declarative TypeScript UI code directly into native views for iOS, Android, and macOS, eliminating JavaScript bridges.\n\nKey benefits include true native performance through features like automatic view recycling, optimized component rendering, an optimized layout engine, and viewport-aware rendering. Valdi emphasizes developer experience with instant hot reload, full VSCode debugging, and familiar TSX syntax. Its flexible adoption model allows for embedding Valdi components into existing native apps and vice versa. It supports writing performance-critical code in C++, Swift, Kotlin, or Objective-C with type-safe bindings to TypeScript.\n\nValdi offers deep native integration through automatic code generation for bindings, direct access to native APIs, bidirectional communication between TypeScript and native code, and native protobuf support. The framework powers critical features in Snap apps, including advanced animations and complex gestures.\n\nIt features a Flexbox layout system, worker threads, native animations, advanced gesture recognition, a built-in testing framework, and Bazel integration. Support is available through Discord, and the project is licensed under MIT.\n",
    "chinese_title": "Valdi – 提供原生性能的跨平台UI框架",
    "chinese_summary": "Valdi：为原生性能和开发者效率而生的跨平台UI框架。目前正处于beta阶段，但已在Snap的生产应用中使用8年。与其他依赖Web视图的跨平台框架不同，Valdi将声明式的TypeScript UI代码直接编译成iOS、Android和macOS的原生视图，消除了JavaScript桥接。\n\n主要优势包括：通过自动视图回收、优化组件渲染、优化的布局引擎和视口感知渲染等功能实现真正的原生性能。Valdi强调开发者体验，提供即时热重载、完整的VSCode调试和熟悉的TSX语法。其灵活的采用模式允许将Valdi组件嵌入到现有的原生应用程序中，反之亦然。它支持使用C++、Swift、Kotlin或Objective-C编写性能关键代码，并具有与TypeScript的类型安全绑定。\n\nValdi通过自动代码生成绑定、直接访问原生API、TypeScript和原生代码之间的双向通信以及原生protobuf支持，提供深入的原生集成。该框架为Snap应用中的关键功能提供支持，包括高级动画和复杂手势。\n\n它具有Flexbox布局系统、工作线程、原生动画、高级手势识别、内置测试框架和Bazel集成。可通过Discord获得支持，该项目采用MIT许可证。"
  },
  {
    "id": "45854862",
    "title": "Making Democracy Work: Fixing and Simplifying Egalitarian Paxos",
    "url": "https://arxiv.org/abs/2511.02743",
    "summary": "This arXiv article, \"Making Democracy Work: Fixing and Simplifying Egalitarian Paxos,\" introduces EPaxos*, a corrected and simplified version of the Egalitarian Paxos (EPaxos) state-machine replication protocol. The authors, Fedor Ryabinin, Alexey Gotsman, and Pierre Sutra, address the complexity, ambiguous specification, and bugs present in the original EPaxos.\n\nEPaxos is a leaderless consensus protocol designed to overcome the single point of failure and latency issues associated with leader-based protocols like Paxos. It allows replicas to collaboratively order commands, maintaining throughput even with up to *f* process crashes out of *n* = 2*f*+1 processes. Under more favorable failure conditions (no more than *e* = ⌈(f+1)/2⌉ failures and commuting commands), EPaxos achieves fast command execution in just two message delays.\n\nThe key contribution of EPaxos* is a simpler and rigorously proven correct failure-recovery algorithm. Furthermore, the protocol generalizes EPaxos to support a broader range of failure thresholds, specifically *n* ≥ max{2*e*+*f*-1, 2*f*+1}, which the authors claim is optimal. The extended version of the paper was presented at OPODIS'25.\n",
    "chinese_title": "使民主运作：修复和简化平等Paxos",
    "chinese_summary": "本文 arXiv 文章“使民主发挥作用：修复和简化平等 Paxos”（EPaxos*）介绍了一种经过纠正和简化的平等 Paxos (EPaxos) 状态机复制协议。作者 Fedor Ryabinin、Alexey Gotsman 和 Pierre Sutra 解决了原始 EPaxos 中存在的复杂性、模糊规范和错误。\n\nEPaxos 是一种无领导者共识协议，旨在克服与基于领导者的协议（如 Paxos）相关的单点故障和延迟问题。它允许副本协同排序命令，即使在 *n* = 2*f*+1 个进程中最多发生 *f* 个进程崩溃，也能保持吞吐量。在更有利的故障条件下（不超过 *e* = ⌈(f+1)/2⌉ 个故障和可交换命令），EPaxos 仅需两次消息延迟即可实现快速命令执行。\n\nEPaxos* 的主要贡献是一种更简单且经过严格证明是正确的故障恢复算法。此外，该协议将 EPaxos 推广到支持更广泛的故障阈值，特别是 *n* ≥ max{2*e*+*f*-1, 2*f*+1}，作者声称这是最优的。本文的扩展版本已在 OPODIS'25 上发表。"
  },
  {
    "id": "45855933",
    "title": "My friends and I accidentally faked the Ryzen 7 9700X3D leaks",
    "url": "https://old.reddit.com/r/pcmasterrace/comments/1orc6jl/my_friends_and_i_accidentally_faked_the_ryzen_7/",
    "summary": "The Reddit post recounts how the author and their friends unintentionally created a false leak about the Ryzen 7 9700X3D processor. It started as a joke: they edited a screenshot of CPU-Z to display fabricated specifications for a fictitious Ryzen processor, including core count, clock speeds, and L3 cache size. They then shared this doctored image within their friend group.\n\nOne of the friends, without realizing it was a joke and believing it to be legitimate, posted the altered screenshot online, presumably on a tech forum or social media platform. The image quickly spread, gaining traction and being reported by various tech news outlets and YouTubers as a genuine leak.\n\nThe author and their friends were surprised and somewhat alarmed by how quickly and widely their fabricated information was disseminated. They acknowledge the irresponsibility of their actions, even though they didn't intend for the image to go public in that context. The post emphasizes the ease with which misinformation can spread online, particularly in the tech sphere where leaks are frequently shared and discussed. The author also expresses concern about the potential impact of their actions on AMD's reputation, even if indirectly, and hopes that the clarification helps to correct the record. The post serves as a cautionary tale about the dangers of spreading unverified information online.\n",
    "chinese_title": "我和我的朋友们不小心伪造了锐龙7 9700X3D的泄露信息。",
    "chinese_summary": "Reddit帖子讲述了作者和他们的朋友如何无意中制造了关于Ryzen 7 9700X3D处理器的虚假泄露。事情起初只是一个玩笑：他们编辑了一张CPU-Z的截图，显示了一个虚构的Ryzen处理器的捏造规格，包括核心数量、时钟速度和L3缓存大小。然后他们在他们的朋友圈内分享了这张伪造的图片。\n\n其中一位朋友，没有意识到这只是个玩笑，并信以为真，将修改后的截图发布到了网上，很可能是在一个科技论坛或社交媒体平台上。这张图片迅速传播开来，获得了关注，并被各种科技新闻媒体和YouTube用户报道为真实的泄露信息。\n\n作者和他们的朋友对他们捏造的信息传播如此之快和广泛感到惊讶和有些惊慌。他们承认自己行为的不负责任，即使他们并没有打算让这张图片在这种情况下公开。这篇文章强调了虚假信息在网上传播的容易程度，尤其是在科技领域，泄露信息经常被分享和讨论。作者还对他们的行为可能对AMD的声誉产生的潜在影响表示担忧，即使是间接的，并希望澄清有助于纠正记录。这篇文章是对在网上散布未经证实的信息的危险性的警示。"
  },
  {
    "id": "45857695",
    "title": "52 Year old data tape could contain Unix history",
    "url": "https://www.theregister.com/2025/11/07/unix_fourth_edition_tape_rediscovered/",
    "summary": "A potentially significant piece of Unix history, a tape reel labeled \"UNIX Original From Bell Labs V4,\" has been discovered at the University of Utah. This tape, dating back to around 1973, may contain the first version of UNIX written in the C programming language, making it a highly valuable find since very little of UNIX V4 is known to exist.\n\nThe tape was found during a storage room cleanup and identified by Professor Robert Ricci as bearing the handwriting of his late advisor, Jay Lepreau. Historical context suggests that the tape was received by Martin Newell, known for inventing the Utah Teapot, a ubiquitous object in computer graphics.\n\nDue to the tape's age and potential fragility, it is being carefully transported to the Computer History Museum (CHM) in Mountain View, California. Al Kossow, the software librarian at the CHM, plans to use specialized equipment, including a high-speed analog-to-digital converter and analysis software, to attempt data recovery. Given the rarity of this potential find, Kossow is prioritizing the recovery effort. The successful retrieval of the data could offer invaluable insights into the early development of UNIX and the transition to the C programming language.\n",
    "chinese_title": "52年旧磁带或含Unix历史",
    "chinese_summary": "在犹他大学发现了一盘可能具有重大意义的Unix历史磁带，标签为“UNIX Original From Bell Labs V4”。 这盘磁带可以追溯到1973年左右，可能包含用C语言编写的第一个版本的UNIX，由于已知存在的UNIX V4版本很少，这使得它成为一项极具价值的发现。\n\n这盘磁带是在清理储藏室时被发现的，并被Robert Ricci教授确认为带有他已故导师Jay Lepreau的笔迹。 历史背景表明，这盘磁带是由马丁·纽厄尔收到的，他以发明计算机图形学中无处不在的物体——犹他茶壶而闻名。\n\n由于磁带的年代久远且可能很脆弱，因此正在小心地将其运送到位于加利福尼亚州山景城的计算机历史博物馆 (CHM)。 CHM的软件管理员Al Kossow计划使用专门的设备，包括高速模数转换器和分析软件，尝试进行数据恢复。 鉴于这一潜在发现的稀有性，Kossow正在优先考虑恢复工作。 成功检索数据可以为UNIX的早期开发以及向C编程语言的过渡提供宝贵的见解。"
  },
  {
    "id": "45792555",
    "title": "Friendly attributes pattern in Ruby",
    "url": "https://brunosutic.com/blog/ruby-friendly-attributes-pattern",
    "summary": "This article introduces the \"Friendly Attributes Pattern\" in Ruby, a technique to simplify and make attribute definition more readable and concise. The author developed this pattern while working on RailsBilling to reduce code repetition and improve the experience of creating billing plans.\n\nThe core idea is to convert various data types (integers, symbols, durations) into standard attribute key-value pairs based on predefined rules. For example, an integer is interpreted as an amount, a symbol as a name, and a duration as an interval. This allows for more expressive and shorter code, such as `Billing::Plan.find_or_create_all_by_attrs!(1.month => {standard: 10, pro: 50, enterprise: 100})` instead of multiple `find_or_create_by!` calls with redundant attribute keys.\n\nThe pattern supports flexible input formats, including arrays, hashes, and even single values, which are then converted to standard attributes. It also allows mixing Friendly Attributes with traditional key-value attributes and is backward compatible. The author also describes a tree-like structure implementation for handling nested attributes to reduce repetition.\n\nWhile acknowledging potential downsides, the author argues that the pattern's flexibility and readability outweigh the risks. They emphasize that Friendly Attributes are primarily for human consumption and should not be used for API design or data storage. Finally, they provide a conceptual example of how the pattern could be applied to an IoT door lock system.\n",
    "chinese_title": "Ruby 中的友善属性模式",
    "chinese_summary": "本文介绍了 Ruby 中的“友善属性模式”，这是一种简化属性定义并使其更具可读性和简洁性的技术。作者在开发 RailsBilling 时，为了减少代码重复并改善创建账单计划的体验而开发了这种模式。\n\n其核心思想是基于预定义的规则，将各种数据类型（整数、符号、持续时间）转换为标准的属性键值对。例如，整数被解释为金额，符号被解释为名称，持续时间被解释为间隔。这允许更具表现力且更短的代码，例如 `Billing::Plan.find_or_create_all_by_attrs!(1.month => {standard: 10, pro: 50, enterprise: 100})`，而不是多次使用冗余属性键的 `find_or_create_by!` 调用。\n\n该模式支持灵活的输入格式，包括数组、哈希，甚至单个值，这些都会被转换为标准属性。它还允许将友善属性与传统的键值属性混合使用，并且向后兼容。作者还描述了一种树状结构实现，用于处理嵌套属性以减少重复。\n\n在承认潜在缺点的同时，作者认为该模式的灵活性和可读性超过了风险。他们强调，友善属性主要供人使用，不应用于 API 设计或数据存储。最后，他们提供了一个概念性的例子，说明该模式如何应用于物联网门锁系统。"
  },
  {
    "id": "45809782",
    "title": "Computational Complexity of Air Travel Planning (2003) [pdf]",
    "url": "http://www.ai.mit.edu/courses/6.034f/psets/ps1/airtravel.pdf",
    "summary": "It is impossible to provide a summary of the article \"Computational Complexity of Air Travel Planning (2003)\" based on the provided content. The text appears to be a raw, encoded PDF file, not the actual text of the article. It only contains PDF formatting information and encoded streams, not the article's abstract, introduction, methodology, results, or conclusions. Therefore, I cannot determine the article's subject matter, scope, findings, or any other information necessary to write a summary. I would need the actual text of the article to be able to summarise it.\n",
    "chinese_title": "空中旅行规划的计算复杂度 (2003) [pdf]",
    "chinese_summary": "由于提供的内容无法提供对文章“航空旅行规划的计算复杂性（2003）”的摘要。 此文本似乎是原始的、编码的PDF文件，而不是文章的实际文本。 它仅包含PDF格式信息和编码流，不包含文章的摘要、引言、方法、结果或结论。 因此，我无法确定文章的主题、范围、发现或撰写摘要所需的任何其他信息。 我需要文章的实际文本才能对其进行总结。"
  },
  {
    "id": "45808288",
    "title": "Reverse engineering a neural network's clever solution to binary addition (2023)",
    "url": "https://cprimozic.net/blog/reverse-engineering-a-small-neural-network/",
    "summary": "Casey Primozic reverse-engineered a small neural network (422 parameters) trained to perform binary addition on 8-bit unsigned integers. He was surprised it learned so well, expecting a much larger network mirroring a binary adder circuit.\n\nThe network cleverly converts binary inputs into analog signals using the weights of the input layer, mimicking a Digital-to-Analog Converter (DAC). It then utilizes a custom activation function called \"Ameo\" (and alternatively, the sine function) in the first layer to map the analog signal into periodic sine wave-like signals with different periods. These periods correlate directly with the switching periods of binary digits (1, 2, 4, 8, etc.), effectively encoding the addition results.\n\nSubsequent layers refine these signals, \"saturating\" them into square wave-like shapes closer to the target output values of -1 and 1.  The later layers are mostly concerned with routing and combining the outputs of the first layer. The network even learned to create shifted signals by combining outputs from neurons with different periods.\n\nPrimozic's investigation highlights the unexpected and efficient solutions that neural networks can devise, differing significantly from the anticipated logic gate-based approach.  He concludes by pondering if larger models could be made more efficient using custom architectures, while acknowledging \"The Bitter Lesson\" which states the supremacy of scaling and general methods. He remains impressed by the power of gradient descent and the consistency with which these patterns emerge from randomness.\n",
    "chinese_title": "逆向工程解析神经网络解决二进制加法的巧妙方案 (2023)",
    "chinese_summary": "凯西·普里莫奇逆向工程了一个小型神经网络（422个参数），该网络经过训练可在 8 位无符号整数上执行二进制加法。 他惊讶于它学习得如此之好，原本预计一个更大的网络会模仿二进制加法器电路。\n\n该网络巧妙地利用输入层的权重将二进制输入转换为模拟信号，模仿数模转换器 (DAC)。 然后，它在第一层中使用一种名为“Ameo”的自定义激活函数（或者，正弦函数），将模拟信号映射为具有不同周期的周期性正弦波状信号。 这些周期与二进制数字（1、2、4、8 等）的切换周期直接相关，有效地编码了加法结果。\n\n随后的层细化这些信号，将它们“饱和”成更接近目标输出值 -1 和 1 的方波状形状。 后面的层主要关注第一层输出的路由和组合。 该网络甚至学会了通过组合来自具有不同周期的神经元的输出来创建移位信号。\n\n普里莫奇的研究突出了神经网络可以设计出的出乎意料且高效的解决方案，这与预期的基于逻辑门的方法大相径庭。 他最后思考是否可以使用自定义架构使更大的模型更有效率，同时承认了“痛苦的教训”，即缩放和通用方法的至高无上地位。 他仍然对梯度下降的力量以及这些模式从随机性中持续涌现出来印象深刻。"
  },
  {
    "id": "45849342",
    "title": "Myna: Monospace typeface designed for symbol-heavy programming languages",
    "url": "https://github.com/sayyadirfanali/Myna",
    "summary": "Myna is a new monospace font designed for programming, addressing the common issue of symbols feeling like afterthoughts in many existing fonts. Its core philosophy is \"Symbol-First Design,\" prioritizing the clarity and visual weight of ASCII symbols commonly used in programming languages. This leads to near-perfect alignment for multi-character symbols (like `->` and `>>=`), a balanced visual weight between symbols and alphanumeric characters, minimalist forms for punctuation, and clear distinction between easily confused characters (like `1 l I |` and `0 O o`).\n\nMyna is language-aware, offering tailored glyphs for languages like Perl, Haskell, and C. The current release focuses on a single weight, though future expansions with ligatures are possible depending on community demand.\n\nThe font is available for installation on Linux, macOS, and Windows via cloning the GitHub repository or downloading the release. It is licensed under the SIL Open Font License, Version 1.1. Myna's development draws inspiration from several well-regarded monospace fonts, including Source Code Pro, Fira Mono, Inconsolata, Plex Mono, Office Code Pro, and Anonymous Pro.\n\nThe author actively solicits feedback and contributions from the community, particularly regarding bug reports and feature requests for expanding the font's character set and functionality. Contact information is provided for direct communication.\n",
    "chinese_title": "八哥：为符号密集型编程语言设计的等宽字体",
    "chinese_summary": "Myna：一款为编程设计的新等宽字体，解决了许多现有字体中符号显得像事后诸葛亮的问题。其核心理念是“符号优先设计”，优先考虑编程语言中常用 ASCII 符号的清晰度和视觉重量。这使得多字符符号（如 `->` 和 `>>=`）实现近乎完美的对齐，符号和字母数字字符之间实现平衡的视觉重量，标点符号采用简约形式，并且清晰区分易混淆的字符（如 `1 l I |` 和 `0 O o`）。\n\nMyna 具有语言感知能力，为 Perl、Haskell 和 C 等语言提供定制字形。当前版本侧重于单一字重，但未来可能会根据社区需求扩展连字。\n\n该字体可通过克隆 GitHub 存储库或下载发布版安装在 Linux、macOS 和 Windows 上。它采用 SIL 开放字体许可证 1.1 版授权。Myna 的开发灵感来自多种备受推崇的等宽字体，包括 Source Code Pro、Fira Mono、Inconsolata、Plex Mono、Office Code Pro 和 Anonymous Pro。\n\n作者积极征求社区的反馈和贡献，特别是关于错误报告和扩展字体字符集和功能的特性请求。提供联系信息以便直接沟通。"
  },
  {
    "id": "45852895",
    "title": "Immutable Software Deploys Using ZFS Jails on FreeBSD",
    "url": "https://conradresearch.com/articles/immutable-software-deploy-zfs-jails",
    "summary": "This article details how to implement immutable software deployments on FreeBSD using ZFS jails and Caddy as a reverse proxy. The core idea is to create a new, isolated jail for each deployment based on a ZFS snapshot of a base image, ensuring a clean and reproducible environment.\n\nThe process begins with setting up a dedicated loopback network interface for the jails and enabling ZFS and jail services. A base FreeBSD image is downloaded, extracted, and configured as a template. For each deployment, a ZFS clone of the template is created, forming a new jail. The application is then deployed inside this jail.\n\nCaddy acts as a reverse proxy, routing traffic to the currently healthy jail based on a health check endpoint (e.g., `/up`).  After a new jail passes the health check, Caddy is reconfigured to direct traffic to it, enabling zero-downtime upgrades.\n\nKey steps include:\n\n*   Creating a ZFS dataset for jails and child datasets for media, templates, and containers.\n*   Building and snapshotting a base image template with necessary configurations.\n*   Cloning the base image template to create a new jail for each deployment, named after the Git commit SHA.\n*   Configuring the jail with a dedicated IP address on the loopback interface and a service definition for the application.\n*   Setting up Caddy to perform health checks and route traffic to the healthy jail.\n\nThe article emphasizes the benefits of this approach, including zero-downtime deployments, instant rollbacks, and a consistent, reproducible environment, ultimately leading to increased reliability and easier management.\n",
    "chinese_title": "使用 ZFS Jail 在 FreeBSD 上实现不可变软件部署",
    "chinese_summary": "本文详细介绍了如何在FreeBSD上使用ZFS jails和Caddy反向代理来实现不可变软件部署。核心思想是基于基础镜像的ZFS快照为每次部署创建一个新的、隔离的jail，从而确保干净且可重现的环境。\n\n该过程始于为jails设置一个专用的环回网络接口，并启用ZFS和jail服务。下载、提取并配置一个基础FreeBSD镜像作为模板。对于每次部署，都会创建一个模板的ZFS克隆，形成一个新的jail。然后，应用程序部署在此jail内部。\n\nCaddy充当反向代理，根据健康检查端点（例如 `/up`）将流量路由到当前健康的jail。在新jail通过健康检查后，Caddy会被重新配置，将流量导向它，从而实现零停机升级。\n\n关键步骤包括：\n\n*   为jails创建ZFS数据集，并为媒体、模板和容器创建子数据集。\n*   构建基础镜像模板并使用必要的配置进行快照。\n*   克隆基础镜像模板，为每次部署创建一个新的jail，并以Git提交SHA命名。\n*   使用环回接口上的专用IP地址和一个应用程序的服务定义来配置jail。\n*   设置Caddy以执行健康检查并将流量路由到健康的jail。\n\n本文强调了这种方法的好处，包括零停机部署、即时回滚以及一致且可重现的环境，最终带来更高的可靠性和更轻松的管理。"
  },
  {
    "id": "45799949",
    "title": "Dark mode by local sunlight (2021)",
    "url": "https://www.ctnicholas.dev/articles/dark-mode-by-sunlight",
    "summary": "This article by Chris Nicholas explores how to automatically enable dark mode on websites based on a user's location and local sunlight. The author argues that using sunlight levels to determine the theme is a user-friendly approach.\n\nThe article outlines the process: First, the user's location is determined using the Geolocation API (or a backend API). Then, the SunCalc NPM package is used to calculate local sunrise and sunset times based on the user's location and the time of year. This is necessary because sunset and sunrise times vary significantly based on both location and time of year.\n\nThe calculated sunrise and sunset times are then compared to the user's current time to determine whether to activate dark or light mode. The author also suggests adding a \"twilight mode\" based on dawn, dusk, goldenHourEnd and goldenHour to provide a more gradual transition.\n\nThe article emphasizes that accessibility should be prioritized. Users may have specific color scheme preferences, such as those with astigmatism who may experience halation with light text on dark backgrounds. The author recommends respecting users' preferred color schemes, detectable using CSS and JavaScript media queries. Finally, the article advocates for including a manual dark mode switch even when automatic switching is implemented.\n",
    "chinese_title": "本地日光黑暗模式 (2021)",
    "chinese_summary": "克里斯·尼古拉斯的这篇文章探讨了如何根据用户的位置和当地的日照情况自动启用网站的暗黑模式。作者认为，使用日照水平来决定主题是一种用户友好的方法。\n\n文章概述了该过程：首先，使用Geolocation API（或后端API）确定用户的位置。然后，使用SunCalc NPM包根据用户的位置和一年中的时间计算当地的日出和日落时间。这是必要的，因为日出和日落时间会根据地点和一年中的时间而显著变化。\n\n计算出的日出和日落时间随后会与用户的当前时间进行比较，以确定是否激活暗黑或亮色模式。作者还建议基于黎明、黄昏、黄金时段结束和黄金时段添加一个“暮光模式”，以提供更渐进的过渡。\n\n文章强调，应优先考虑可访问性。用户可能有特定的配色方案偏好，例如患有散光的人可能会在深色背景上的浅色文本中遇到光晕。作者建议尊重用户偏好的配色方案，这可以使用CSS和JavaScript媒体查询来检测。最后，文章提倡即使在实现了自动切换时，也要包含一个手动暗黑模式开关。"
  },
  {
    "id": "45850382",
    "title": "How did I get here?",
    "url": "https://how-did-i-get-here.net/",
    "summary": "This article explains how the website \"how-did-i-get-here.net\" works, focusing on the traceroute feature. It breaks down the complexities of internet routing and how it's visualized for the user.\n\nThe site utilizes a custom traceroute program called \"ktr\" to trace the path packets take from the server to the user's IP address (a \"reverse traceroute\").  Ktr leverages ICMP packets and their \"time to live\" (TTL) field to identify the routers along the path. By sending packets with incrementally increasing TTLs, the program receives error messages from each router, revealing their IP addresses.\n\nThe article details the behind-the-scenes process: the server receives the HTTP request, starts the traceroute, and then streams the webpage content in chunks as the traceroute progresses. A clever CSS trick is used to make the traceroute appear to load in real-time without JavaScript.\n\nThe concept of autonomous systems (ASes), networks owned by companies, is explained.  The article highlights the role of Border Gateway Protocol (BGP) in enabling these networks to communicate. BGP allows border routers to share routing tables, determining the best path for packets to reach their destination. These routes are established through peering arrangements between ASes. The author acknowledges the inherent control of the Internet that AS owners possess.\n\nThe author expresses frustration with existing resources on Internet structure and hopes the site can inform and inspire people, further highlighting the open-source nature of the project.\n",
    "chinese_title": "我怎么会在这里？",
    "chinese_summary": "本文解释了网站 \"how-did-i-get-here.net\" 的运作方式，重点介绍其路由追踪功能。它解析了互联网路由的复杂性以及如何将其可视化呈现给用户。\n\n该网站使用一个名为 \"ktr\" 的自定义路由追踪程序，追踪数据包从服务器到用户 IP 地址的路径（一种“反向路由追踪”）。Ktr 利用 ICMP 数据包及其“生存时间”(TTL) 字段来识别路径上的路由器。通过发送 TTL 递增的数据包，该程序会收到来自每个路由器的错误消息，从而揭示它们的 IP 地址。\n\n本文详细介绍了幕后流程：服务器接收 HTTP 请求，启动路由追踪，然后在路由追踪进行时，以块的形式流式传输网页内容。采用了一种巧妙的 CSS 技巧，使路由追踪看起来像是在实时加载，而无需 JavaScript。\n\n文章解释了自治系统 (ASes) 的概念，即由公司拥有的网络。 文章强调了边界网关协议 (BGP) 在使这些网络能够通信方面的作用。BGP 允许边界路由器共享路由表，从而确定数据包到达其目的地的最佳路径。这些路由是通过 ASes 之间的对等安排建立的。作者承认 AS 所有者对互联网的固有控制权。\n\n作者对现有的互联网结构资源表示不满，并希望该网站能够启发人们，进一步强调该项目的开源性质。"
  },
  {
    "id": "45846517",
    "title": "Why I love OCaml (2023)",
    "url": "https://mccd.space/posts/ocaml-the-worlds-best/",
    "summary": "This article expresses the author's love for OCaml after experiences with Haskell and Go. The author, a functional programming enthusiast, initially appreciated Haskell's strong static guarantees and ability to break down complex problems, but found its complexity and slow compile times frustrating. Go offered simplicity, fast performance, good tooling, and quick compilation, but the author disliked its verbosity, fragile error handling, and lack of functional programming features.\n\nOCaml, according to the author, strikes a balance. It provides strong static guarantees via sum types and pattern matching, a simpler runtime similar to Go (garbage collected for systems programming), and very fast compilation times. OCaml's single-binary compilation simplifies deployment, and its excellent documentation tools (odig, utop, interface/implementation separation) enhance code exploration. The author also appreciates automatic type inference and modular code organization.\n\nThe author concludes that OCaml represents the right balance between simplicity and expressiveness, coupled with excellent documentation and tooling, making it a highly enjoyable and productive language despite its age and a few potentially unnecessary features.\n",
    "chinese_title": "我为什么热爱 OCaml (2023)",
    "chinese_summary": "作者在体验过 Haskell 和 Go 之后，表达了对 OCaml 的喜爱。作者作为一名函数式编程爱好者，最初欣赏 Haskell 强大的静态保证和分解复杂问题的能力，但发现其复杂性和缓慢的编译时间令人沮丧。Go 提供了简洁性、快速的性能、良好的工具和快速的编译，但作者不喜欢其冗长、脆弱的错误处理以及缺乏函数式编程特性。\n\n作者认为，OCaml 实现了平衡。它通过 sum types 和模式匹配提供了强大的静态保证，一个类似于 Go 的更简单的运行时（用于系统编程的垃圾回收），以及非常快的编译时间。OCaml 的单二进制编译简化了部署，其出色的文档工具（odig、utop、接口/实现分离）增强了代码探索。作者还欣赏自动类型推断和模块化的代码组织。\n\n作者总结说，OCaml 代表了简单性和表达性之间的正确平衡，再加上出色的文档和工具，使其成为一种非常令人愉快和高效的语言，尽管它已经存在了一段时间，并且有一些可能不必要的功能。"
  },
  {
    "id": "45789447",
    "title": "Nubeian Translation for Childhood Songs by Hamza El Din",
    "url": "https://nubianfoundation.org/translations/",
    "summary": "This document presents English translations and transliterations of two Nubian childhood songs by Hamza El Din: \"Nabra\" and \"Childhood.\" The original Nubian lyrics are provided alongside the English translations and transliterations, and Arabic versions of the Nubian are included.\n\n\"Nabra\" revolves around themes of memory, love, and longing. The speaker repeatedly questions Nabra, asking if she remembers him and their past. The song utilizes imagery of gold, the beautiful day, and love. The second half focuses on observing a beautiful girl (\"Too buru lim ajbikisa\") and the feelings of love and longing associated with her. The song ends with reflections on disappearance and a prayer, questioning a past absence and expressing sadness.\n\n\"Childhood\" is a nostalgic recollection of childhood memories centered around playing among date palms, gathering dates, and the Nile River. It uses vivid imagery of white clothes \"kissoola\" like sheep and the sweetness of honey (\"Inna silsoot\"), vowing never to forget these experiences. The song also touches upon themes of separation (\"Mingai ai forakai goka\") from that idyllic past.\n\nThe translations are attributed to Nabra Nelson and Dore Kolod, highlighting the collaborative effort in preserving and sharing these Nubian songs. The document also directs readers to explore further translations available on 'Nubian Music of Aswan.'\n",
    "chinese_title": "哈姆扎·埃尔·丁的努比亚童谣翻译",
    "chinese_summary": "本文呈现了汉姆扎·艾尔·丁的两首努比亚童年歌曲“Nabra”和“童年”的英文翻译和音译。 除了英文翻译和音译之外，还提供了努比亚语的原始歌词，并包含努比亚语的阿拉伯语版本。\n\n“Nabra”围绕着记忆、爱和渴望的主题展开。 歌者不断地询问Nabra，问她是否还记得他和他们的过去。 这首歌运用了黄金、美好的一天和爱的意象。 后半部分侧重于观察一个美丽的女孩(\"Too buru lim ajbikisa\")以及与之相关的爱和渴望之情。 这首歌以对消失的反思和祈祷结束，质疑过去的缺席，并表达悲伤。\n\n“童年”是对围绕在枣椰树中玩耍、采集枣子和尼罗河的童年记忆的怀旧回忆。 它使用了白色衣服“kissoola”像绵羊和蜂蜜的甜美（“Inna silsoot”）的生动意象，发誓永远不会忘记这些经历。 这首歌也触及了与那田园诗般的过去分离的主题 (\"Mingai ai forakai goka\")。\n\n这些翻译归功于Nabra Nelson和Dore Kolod，突出了在保存和分享这些努比亚歌曲方面的合作努力。 该文档还引导读者浏览“阿斯旺的努比亚音乐”上提供的更多翻译。"
  },
  {
    "id": "45801651",
    "title": "The Initial Ideal Customer Profile Worksheet",
    "url": "https://www.reifyworks.com/writing/2023-01-30-iicp",
    "summary": "This article by Michael Bernstein introduces the \"Initial Ideal Customer Profile (IICP) Worksheet\" as a tool to help businesses choose the most effective buyer persona to focus on when initiating persona-driven marketing. The core idea is to prioritize one persona and build from there.\n\nThe worksheet evaluates potential personas based on three key pillars:\n\n*   **Product Strength:** How well the product resonates with the persona.\n*   **Market Size:** Whether the persona's segment is appropriately sized (not too niche or too broad).\n*   **Distribution Strategy:** How effectively and authentically the business can reach the persona.\n\nThe article suggests listing up to three distinct personas and using a questionnaire (available in Google Doc format) to assess each against these criteria. Team members can also participate in the evaluation.\n\nA Likert scale scoring system (from -2 to +2) is provided to quantify confidence levels for each question, facilitating a data-driven decision. However, the article ultimately emphasizes choosing the persona the business knows best. This allows for more effective messaging, positioning, and confident assessment of product-market fit.\n\nFinally, the article highlights the link between persona choice and go-to-market strategy, cautioning against selecting personas that require strategies the business isn't suited for. It urges honesty in evaluating distribution strategies and encourages visualizing marketing content tailored to the chosen persona. The next step after persona selection is developing a compelling Value Story.\n",
    "chinese_title": "最初理想客户画像工作表",
    "chinese_summary": "迈克尔·伯恩斯坦的这篇文章介绍了“初始理想客户画像（IICP）工作表”，作为一种工具，帮助企业在启动以客户画像驱动的营销时，选择最有效的买家角色进行重点关注。核心思想是优先确定一个客户画像，并以此为基础进行构建。\n\n该工作表基于三个关键支柱评估潜在的客户画像：\n\n*   **产品优势：** 产品与客户画像的契合程度。\n*   **市场规模：** 客户画像所代表的细分市场规模是否合适（既不太小众也不太宽泛）。\n*   **分销策略：** 企业能够有效且真实地触达客户画像的程度。\n\n文章建议列出最多三个不同的客户画像，并使用问卷调查（以Google Doc格式提供）来评估每个客户画像在这三个标准下的表现。团队成员也可以参与评估。\n\n文章提供了一个李克特量表评分系统（从-2到+2），用于量化每个问题的置信度，从而促进数据驱动的决策。然而，文章最终强调选择企业最了解的客户画像。这有助于更有效地进行信息传递、定位，以及自信地评估产品与市场的契合度。\n\n最后，文章强调了客户画像选择与市场进入策略之间的联系，告诫企业不要选择需要企业不擅长的策略的客户画像。文章敦促企业诚实地评估分销策略，并鼓励企业可视化针对所选客户画像量身定制的营销内容。选择客户画像后的下一步是开发引人注目的价值故事。"
  },
  {
    "id": "45852974",
    "title": "Mullvad: Shutting down our search proxy Leta",
    "url": "https://mullvad.net/en/blog/shutting-down-our-search-proxy-leta",
    "summary": "Mullvad is shutting down its search proxy, Leta, on November 27, 2025. Leta's main purpose was to enhance search privacy by pooling and caching requests from numerous users. However, Mullvad believes that the evolving search industry will make Leta less effective in the future. They suggest that similar privacy benefits can now be achieved by combining a VPN with a privacy-focused browser. Therefore, Mullvad will discontinue Leta and focus on advancing VPN and browser privacy through its own research, development, and collaborations with partners. In essence, Mullvad is shifting its focus from a dedicated search proxy to a more comprehensive approach of VPN and browser-based privacy solutions.\n",
    "chinese_title": "Mullvad：关闭我们的搜索代理Leta",
    "chinese_summary": "Mullvad将于2025年11月27日关闭其搜索代理Leta。Leta的主要目的是通过汇集和缓存众多用户的请求来增强搜索隐私。然而，Mullvad认为，不断发展的搜索行业将使Leta在未来效果降低。他们建议，现在可以通过将VPN与注重隐私的浏览器相结合来实现类似的隐私优势。因此，Mullvad将停止Leta，并将重点放在通过自身的研究、开发以及与合作伙伴的协作来推进VPN和浏览器隐私。本质上，Mullvad正在将其重点从专用的搜索代理转向更全面的VPN和基于浏览器的隐私解决方案。"
  },
  {
    "id": "45852751",
    "title": "Cerebras Code now supports GLM 4.6 at 1000 tokens/sec",
    "url": "https://www.cerebras.ai/code",
    "summary": "Cerebras Code now offers access to GLM 4.6, a top-tier open-source coding model, boasting speeds of over 1,000 tokens per second. GLM 4.6 excels in tool calling, topping the Berkeley Function Calling Leaderboard, and matches Sonnet 4.5 in web-dev performance. Users can integrate Cerebras Code Pro with any AI-friendly code editor via API key, including Cline, RooCode, OpenCode, and Crush, eliminating the need to switch tools.\n\nCerebras offers three access tiers:\n\n*   **Free:** Limited tokens and requests for demo purposes.\n*   **Pro ($50):** Fast, high-context completions with up to 24 million tokens per day, suited for indie devs and simple agentic workflows.\n*   **Max ($200):** Access to 120 million tokens per day, ideal for full-time development, IDE integrations, code refactoring, and multi-agent systems.\n\nThe platform emphasizes speed and integration, allowing developers to leverage GLM 4.6's coding capabilities within their existing workflow.\n",
    "chinese_title": "Cerebras Code 现在支持 GLM 4.6，速度达 1000 tokens/秒",
    "chinese_summary": "Cerebras Code现已提供GLM 4.6访问权限，这是一款顶级开源编码模型，速度超过每秒1000个token。GLM 4.6擅长工具调用，在伯克利函数调用排行榜上名列前茅，并且在web开发性能方面与Sonnet 4.5相媲美。用户可以通过API密钥将Cerebras Code Pro与任何AI友好的代码编辑器集成，包括Cline、RooCode、OpenCode和Crush，无需切换工具。\n\nCerebras提供三个访问级别：\n\n*   **免费：** 限制token和请求，仅供演示。\n*   **Pro（$50）：** 快速、高上下文补全，每天最多2400万个token，适合独立开发者和简单的agentic工作流程。\n*   **Max（$200）：** 每天访问1.2亿个token，非常适合全职开发、IDE集成、代码重构和多代理系统。\n\n该平台强调速度和集成，使开发人员能够在现有工作流程中利用GLM 4.6的编码能力。"
  },
  {
    "id": "45857449",
    "title": "Authorities Shut Down Film Festival in New York",
    "url": "https://www.hrw.org/news/2025/11/07/china-authorities-shut-down-film-festival-in-new-york",
    "summary": "Human Rights Watch reports that the inaugural IndieChina Film Festival in New York City was \"suspended\" after the Chinese government harassed participating directors, producers, and their families in China, leading them to withdraw their films. The festival, scheduled for November 8-15, 2025, was organized by Zhu Riku.\n\nAccording to Chinese artist and activist Chiang Seeta, nearly all participating directors in China faced intimidation, and even directors abroad reported relatives and friends in China receiving threatening calls from police. By November 4, over two-thirds of the films had cancelled their screenings. Zhu Riku stated that the decision to suspend the festival was to protect those associated with it from further harassment.\n\nThe article highlights the intensifying crackdowns on independent film festivals in China over the past decade, noting the closure of Yunfest, the China Independent Film Festival, and the Beijing Independent Film Festival. It also mentions the prosecution and imprisonment of filmmakers critical of the government, such as Shen Yongping and Chen Pinlin, and the confiscation of equipment from artist Guo Zhenming.\n\nThe article also points out that Hong Kong authorities have banned 13 films on \"national security\" grounds and that China's transnational repression extends beyond film, affecting art exhibitions and artists from Uyghur, Tibetan, and Hongkonger communities. Human Rights Watch urges governments and art venues to counteract China's growing influence on free expression abroad and confront Chinese officials about their abusive actions.\n",
    "chinese_title": "纽约电影节被当局叫停",
    "chinese_summary": "人权观察报告称，纽约首届独立中国电影节因中国政府骚扰参展导演、制片人及其在中国的家人，导致他们撤回影片而被“暂停”。原定于2025年11月8日至15日举行的电影节由朱日坤组织。\n\n据中国艺术家和活动家蒋思涛称，几乎所有在中国的参展导演都面临恐吓，甚至海外导演也报告说，他们在中国的亲友接到了警方的威胁电话。截至11月4日，超过三分之二的影片已取消放映。朱日坤表示，暂停电影节的决定是为了保护与电影节相关的人免受进一步骚扰。\n\n文章强调，过去十年，中国对独立电影节的打压日益加强，并指出云之南纪录影像展、中国独立影像展和北京独立影像节已被关闭。文章还提到，批评政府的电影制作人，如沈勇平、陈品霖受到起诉和监禁，艺术家郭振明的设备被没收。\n\n文章还指出，香港当局以“国家安全”为由禁止了13部电影，中国的跨国镇压已经超越了电影领域，影响到维吾尔族、藏族和香港社群的艺术展览和艺术家。人权观察敦促各国政府和艺术机构抵制中国日益增长的对海外自由表达的影响，并就中国官员的虐待行为质问他们。"
  },
  {
    "id": "45850963",
    "title": "YouTube Removes Windows 11 Bypass Tutorials, Claims 'Risk of Physical Harm'",
    "url": "https://news.itsfoss.com/youtube-removes-windows-11-bypass-tutorials/",
    "summary": "The article discusses YouTube's removal of two Windows 11 tutorial videos from the CyberCPU Tech channel, citing a violation of community guidelines related to \"dangerous or illegal activities that risk serious physical harm or death.\" The videos showed how to install Windows 11 with a local account and bypass hardware requirements on unsupported systems. The creator, Rich, appealed the takedowns, but both were initially denied rapidly.\n\nThe article highlights the absurdity of labeling these tutorials as posing a \"risk of death,\" questioning the effectiveness of YouTube's content moderation system, especially given that a human review was allegedly involved. The author criticizes the over-reliance on automated moderation, which struggles with context and often fails to differentiate between harmless content and genuine threats.\n\nWhile the videos were eventually restored by YouTube, the incident raises concerns about censorship, the potential influence of Microsoft, and the lack of transparency and consistent rationale behind content moderation decisions on major platforms. The author emphasizes the need for human oversight in content moderation, arguing that automation alone is insufficient for handling complex cases, referencing other similar incidents involving content removal. The article also hints at Microsoft removing local account workarounds as Windows 10 approaches its end of life.\n",
    "chinese_title": "YouTube移除Windows 11绕过教程，称存在“人身伤害风险”",
    "chinese_summary": "YouTube以下架Windows 11教程视频引发争议：内容审核机制遭质疑"
  },
  {
    "id": "45849528",
    "title": "Ruby already solved my problem",
    "url": "https://newsletter.masilotti.com/p/ruby-already-solved-my-problem",
    "summary": "生成摘要时出错",
    "chinese_title": "Ruby 已经解决了我的问题。",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45850430",
    "title": "Apple is crossing a Steve Jobs red line",
    "url": "https://kensegall.com/2025/11/07/apple-is-crossing-a-steve-jobs-red-line/",
    "summary": "Ken Segall's article argues that Apple, under Tim Cook, is eroding the user experience-focused principles that were a \"red line\" for Steve Jobs, particularly by introducing advertising into its products and services.\n\nThe author recounts a story from the late 1990s when Apple considered, but Jobs ultimately rejected, the idea of offering an ad-supported version of the Mac OS, even with a paid ad-free option. Jobs believed this would degrade the \"pure, elegant, clean interface\" valued by Mac users, protecting Apple's core values.\n\nSegall argues that the recent introduction of ads into the App Store and the anticipated arrival of ads in Apple Maps represent a departure from this philosophy. He suggests this shift is driven by a desire for increased revenue, questioning whether such a decision prioritizes profits over customer satisfaction.\n\nThe author speculates that Jobs would have opposed this move, prioritizing the user experience even at the cost of potential revenue. He suggests that Tim Cook's acceptance of advertising reflects a fundamental change in Apple's priorities, prioritizing revenue over the customer experience.\n",
    "chinese_title": "苹果正在跨越乔布斯的红线",
    "chinese_summary": "肯·西格尔的文章认为，在蒂姆·库克领导下的苹果公司正在侵蚀以用户体验为中心的原则，而这些原则曾是史蒂夫·乔布斯不可逾越的“红线”，特别是通过在其产品和服务中引入广告。\n\n作者回顾了 20 世纪 90 年代末的一个故事，当时苹果公司曾考虑提供广告支持的 Mac OS 版本，甚至提供付费的无广告选项，但乔布斯最终拒绝了这个想法。乔布斯认为这会降低 Mac 用户所珍视的“纯粹、优雅、简洁的界面”，从而保护苹果的核心价值观。\n\n西格尔认为，最近在 App Store 中引入广告以及预计在 Apple Maps 中引入广告，都代表着对这种理念的背离。他认为这种转变是由增加收入的愿望驱动的，并质疑这种决定是否将利润置于客户满意度之上。\n\n作者推测乔布斯会反对这一举动，即使以牺牲潜在收入为代价，也会优先考虑用户体验。他认为，蒂姆·库克接受广告反映了苹果公司优先事项的根本性改变，即将收入置于客户体验之上。"
  },
  {
    "id": "45854441",
    "title": "Apple's \"notarisation\" – blocking software freedom of developers and users",
    "url": "https://fsfe.org/news/2025/news-20251105-01.en.html",
    "summary": "This article criticizes Apple's \"notarization\" process for iOS apps, arguing that it violates the spirit and objectives of the EU's Digital Markets Act (DMA).  The core argument is that notarization, requiring all apps to be reviewed and re-signed by Apple regardless of distribution channel, gives Apple excessive control over software installation, stifling competition and hindering software freedom.\n\nThe article highlights a civil-society complaint filed against Apple, arguing that notarization and high financial requirements for alternative app stores (like a €1,000,000 letter of credit) illegally restrict sideloading, prevent third-party app stores from effectively operating, and limit interoperability.\n\nFor Free Software developers, notarization requires acceptance of restrictive terms, opaque processes, and the application of DRM, undermining users' rights to verify and redistribute software freely. The article contrasts this with decentralized software curation models like F-Droid, where trust is distributed through transparent verification pipelines and community audits.\n\nThe complaint urges the European Commission to enforce the DMA, impose fines, and find alternatives to Apple's control, promoting decentralised software curation. The article concludes that Apple's security claims are a disguise for gatekeeping and genuine DMA compliance requires true openness, giving users the freedom to install and share software on their devices.\n",
    "chinese_title": "苹果的“公证”——阻碍开发者和用户的软件自由",
    "chinese_summary": "本文批评了苹果公司针对iOS应用程序的“公证”流程，认为其违反了欧盟《数字市场法》（DMA）的精神和目标。核心论点是，无论分发渠道如何，所有应用程序都需要经过苹果的审查和重新签名，这种“公证”赋予了苹果公司对软件安装的过度控制，扼杀了竞争并阻碍了软件自由。\n\n本文重点介绍了一项针对苹果公司的公民社会投诉，该投诉认为，“公证”以及对替代应用商店的高额财务要求（如100万欧元的信用证）非法限制了侧载，阻止了第三方应用商店的有效运营，并限制了互操作性。\n\n对于自由软件开发者来说，“公证”需要接受限制性条款、不透明的流程以及应用DRM，从而损害了用户自由验证和重新分发软件的权利。本文将此与像F-Droid这样的去中心化软件管理模式进行对比，在F-Droid中，信任通过透明的验证流程和社区审计进行分配。\n\n该投诉敦促欧盟委员会执行DMA，处以罚款，并寻找替代苹果控制的方案，以促进去中心化的软件管理。本文最后总结说，苹果公司的安全声明是为看门行为掩盖的，而真正的DMA合规需要真正的开放性，赋予用户在其设备上安装和共享软件的自由。"
  },
  {
    "id": "45848468",
    "title": "Angel Investors, a Field Guide",
    "url": "https://www.jeanyang.com/posts/angel-investors-a-field-guide/",
    "summary": "This article is a field guide to angel investors, written from the perspective of a founder who successfully utilized them. The author emphasizes the significant impact strategic angel investors can have on a startup's success, going beyond just providing capital.\n\nThe author distinguishes between different types of angel investors: those providing early runway (like their mentor), strategic angels who offer complementary expertise and networks, vanity angels (celebrities who may offer social proof), and friends and family. They advocate for choosing angels who fill gaps in expertise and networks, rather than purely for social clout.\n\nLeveraging angel investors effectively involves building relationships, keeping them informed with monthly updates including specific requests and thank yous, and understanding their unique position compared to institutional investors. Angels, not vying for future ownership, can freely introduce founders to other VCs and generate broader interest.\n\nFrom the perspective of an angel investor themselves (through a scouting relationship with a16z), the author highlights the importance of excitement about the company's problem and a belief in their ability to help. They favor B2B SaaS, product-led growth, and developer tools, focusing on understanding the problem the company solves and the team's execution.\n\nUltimately, the article advises founders to choose their angels wisely, recognizing the limitations of cap space and the importance of signaling. A well-chosen group of angels can significantly boost a startup's trajectory.\n",
    "chinese_title": "天使投资人实战指南",
    "chinese_summary": "天使投资人实战指南：一位成功创业者的视角。作者强调，战略性天使投资人不仅能提供资金，还能对初创企业的成功产生重大影响。\n\n文章区分了不同类型的天使投资人：提供早期启动资金的天使（如导师），提供互补专业知识和人脉的战略天使，提供社会声望的虚荣天使（名人），以及亲友。作者倡导选择能弥补专业知识和人脉缺口的天使，而非纯粹为了社会影响力。\n\n有效利用天使投资人需要建立关系，通过每月更新（包括具体需求和感谢）保持沟通，并了解他们与机构投资者的独特之处。天使不会争夺未来的所有权，因此可以自由地将创始人介绍给其他风险投资家，并产生更广泛的兴趣。\n\n作者以天使投资人的视角（通过与 a16z 的合作关系）强调了对公司所解决问题的热情以及相信自己能够提供帮助的重要性。他们偏爱 B2B SaaS、产品主导型增长和开发者工具，专注于理解公司解决的问题和团队的执行力。\n\n总之，文章建议创始人明智地选择天使投资人，认识到股权空间的限制和信号的重要性。精心选择的一组天使可以显著提升初创企业的轨迹。"
  },
  {
    "id": "45809007",
    "title": "Venn Diagram for 7 Sets",
    "url": "https://moebio.com/research/sevensets/",
    "summary": "This article describes a 7-set Venn diagram. While the specific content isn't accessible without an actual working interactive or visual element (the \"Your browser does not have support for Canvas\" message indicates a visual is missing), we can infer the main topic:\n\nThe core focus is presenting a Venn diagram that can represent and visually illustrate the relationships between seven distinct sets. Traditional Venn diagrams are relatively easy to construct for 2 or 3 sets, becoming increasingly complex and difficult to represent clearly with more. A 7-set Venn diagram would be a much more complex representation.\n\nThe article likely explores a specific visual layout designed to effectively display these 7 sets and their various possible intersections. It might discuss:\n\n*   **The specific shape or arrangement of the circles/shapes used to represent the sets.** Standard overlapping circles often become unmanageable, so alternative shapes and arrangements might be utilized.\n*   **The readability and clarity of the diagram.** A key challenge is ensuring the various intersections are easily identifiable and understandable.\n*   **The potential applications of a 7-set Venn diagram.** This could involve areas like data analysis, logic, set theory, or any field where visualizing the relationships between multiple overlapping groups is important.\n*   **Potentially the mathematical underpinning, explaining how to construct the diagram in order to satisfy all of the possible 2^7 - 1 regions in the diagram**\n",
    "chinese_title": "七集合维恩图",
    "chinese_summary": "本文介绍了一个七集合维恩图。虽然在没有实际可交互或可视元素的情况下无法访问具体内容（“您的浏览器不支持Canvas”消息表明缺少视觉元素），但我们可以推断出主要主题：\n\n核心在于呈现一个维恩图，它可以表示并直观地展示七个不同集合之间的关系。传统的维恩图对于2个或3个集合来说相对容易构建，但随着集合数量的增加，它们变得越来越复杂，难以清晰地表示。一个七集合维恩图将是一个非常复杂的表示。\n\n本文可能探讨了一种特定的视觉布局，旨在有效地显示这七个集合及其各种可能的交集。它可能讨论：\n\n*   **用于表示集合的圆形/形状的具体形状或排列。** 标准的重叠圆圈通常变得难以管理，因此可能会使用替代形状和排列。\n*   **图表的可读性和清晰度。** 一个关键挑战是确保各种交集易于识别和理解。\n*   **七集合维恩图的潜在应用。** 这可能涉及数据分析、逻辑、集合论等领域，或任何可视化多个重叠组之间关系很重要的领域。\n*   **可能涉及数学基础，解释如何构建图表以满足图中所有可能的2^7 - 1个区域。**"
  },
  {
    "id": "45796575",
    "title": "FSF40 Hackathon",
    "url": "https://www.fsf.org/events/fsf40-hackathon",
    "summary": "The Free Software Foundation (FSF) is hosting a global, online hackathon from November 21-23, 2025, as part of its 40th-anniversary celebrations. The hackathon aims to improve free software projects and highlight the work of free software developers. Participants can contribute individually or in teams of up to four to projects like the Free Software Directory, GNU Boot, GNU Guix, Lewa, LibreVR, op-mattermost, and Org Mode.\n\nThe event welcomes participants of all skill levels, with tasks available for developers and non-developers alike. The hackathon also focuses on skill development and learning. Specific skills like JavaScript, Python, Emacs Lisp, and DIY hardware knowledge are beneficial for certain projects.\n\nRegistration is free, with donations encouraged to support the FSF and GNU. Prizes will be awarded to first-time contributors, diverse teams, and for the most impactful contribution. Certificates will be provided to acknowledge participants' work. Work submitted between the specified dates will be considered for awards, with exceptions for shifted timezones upon request.\n\nThe FSF is also seeking sponsors and volunteers to moderate the hackathon channels. Individuals and organizations are encouraged to share the event using #HackFSF40. The hackathon is part of a larger set of initiatives for the FSF's 40th anniversary.\n",
    "chinese_title": "FSF40编程马拉松",
    "chinese_summary": "自由软件基金会(FSF)将于2025年11月21日至23日举办全球在线黑客马拉松，作为其40周年庆典的一部分。本次黑客马拉松旨在改进自由软件项目，并突出自由软件开发者的工作。参与者可以个人或以最多四人的团队形式为自由软件目录、GNU Boot、GNU Guix、Lewa、LibreVR、op-mattermost 和 Org Mode 等项目做出贡献。\n\n本次活动欢迎所有技能水平的参与者，为开发者和非开发者都提供可参与的任务。黑客马拉松也注重技能发展和学习。JavaScript、Python、Emacs Lisp和DIY硬件知识等特定技能对某些项目有益。\n\n注册是免费的，鼓励捐款以支持FSF和GNU。奖品将颁发给首次贡献者、多元化团队以及最具影响力的贡献。证书将颁发给参与者以表彰他们的工作。在指定日期之间提交的作品将被考虑授予奖励，时区差异可根据要求进行例外处理。\n\nFSF还在寻找赞助商和志愿者来管理黑客马拉松频道。鼓励个人和组织使用#HackFSF40分享活动。本次黑客马拉松是FSF 40周年纪念日的一系列举措之一。"
  },
  {
    "id": "45800009",
    "title": "Show HN: Find matching acrylic paints for any HEX color",
    "url": "https://acrylicmatch.com/",
    "summary": "This \"Show HN\" post presents \"Acrylic Match,\" a tool for finding the closest matching acrylic paint colors for any given HEX color code. The tool likely operates by comparing the user-inputted HEX code against a database of known acrylic paint colors and their corresponding color values. Users can input a HEX color code, and the tool will suggest the nearest commercially available acrylic paint(s) that match or closely resemble that color.\n\nThe post includes a visual representation of various CSS colors, suggesting these are selectable options for users to quickly find matching acrylic paints for these pre-defined colors. The comprehensive list of color names implies a relatively extensive database of acrylic paints the tool can search within. The overall purpose is to simplify the process of finding the right acrylic paint colors for artists and hobbyists by automatically matching HEX codes to readily available paint options.\n",
    "chinese_title": "Show HN: 查找与任何十六进制颜色匹配的丙烯颜料",
    "chinese_summary": "此“Show HN”帖子介绍“Acrylic Match”，一个用于查找与任何给定HEX颜色代码最匹配的丙烯颜料的工具。该工具可能通过将用户输入的HEX代码与已知丙烯颜料及其相应颜色值的数据库进行比较来工作。用户可以输入一个HEX颜色代码，该工具将建议最接近的可商购丙烯颜料，这些颜料与该颜色匹配或非常相似。\n\n帖子包含各种CSS颜色的可视化表示，表明这些是用户可选择的选项，以便快速找到与这些预定义颜色匹配的丙烯颜料。 完整的颜色名称列表暗示了该工具可以搜索的相对广泛的丙烯颜料数据库。 总体目的是通过自动将HEX代码与现成的颜料选项进行匹配，来简化艺术家和爱好者寻找合适的丙烯颜料的过程。"
  },
  {
    "id": "45853204",
    "title": "Running a 68060 CPU in Quadra 650",
    "url": "https://github.com/ZigZagJoe/Macintosh-Q650-68060",
    "summary": "This project details an experimental attempt to run a 68060 CPU in a Macintosh Quadra 650/800 or Centris 650, achieved through ROM modifications. The project is a proof-of-concept, and its current state only allows booting into an unmodified System 7.1. Functionality is limited and further development is needed for practical usability, a task the author doesn't plan to complete.\n\nThe author warns users about the highly experimental nature of the project, discouraging replication unless they possess advanced technical knowledge due to potential issues. They disclaim all responsibility for any damage or unexpected outcomes resulting from using the code.\n\nThe project credits Jockelill, Aprezbios, and Reinauer for their contributions. The build process involves utilizing Retro68 or a standard m68K GCC toolchain, then flashing the resulting image to a Quadra-compatible ROM SIMM.\n\nThe author releases all material under a license granting unrestricted use. They emphasize the importance of crediting original creators of reference content.\n",
    "chinese_title": "在 Quadra 650 上运行 68060 CPU",
    "chinese_summary": "该项目详细介绍了一项实验性尝试，旨在通过 ROM 修改，在 Macintosh Quadra 650/800 或 Centris 650 中运行 68060 CPU。该项目是一个概念验证，目前仅允许启动到未经修改的 System 7.1。功能有限，需要进一步开发才能实现实际可用性，而作者不打算完成这项任务。\n\n作者警告用户该项目具有高度实验性，不建议复制，除非他们具备先进的技术知识，因为存在潜在问题。他们对使用该代码造成的任何损害或意外结果不承担任何责任。\n\n该项目感谢 Jockelill、Aprezbios 和 Reinauer 的贡献。构建过程涉及使用 Retro68 或标准的 m68K GCC 工具链，然后将生成的镜像刷入与 Quadra 兼容的 ROM SIMM 中。\n\n作者以授予无限制使用权的许可发布所有材料。他们强调了引用内容时注明原始创作者的重要性。"
  },
  {
    "id": "45851495",
    "title": "Becoming a compiler engineer",
    "url": "https://rona.substack.com/p/becoming-a-compiler-engineer",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "成为一名编译器工程师",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "45850671",
    "title": "Ribir: Non-intrusive GUI framework for Rust/WASM",
    "url": "https://github.com/RibirX/Ribir",
    "summary": "Ribir is a non-intrusive Rust GUI framework designed to build multi-platform applications from a single codebase. It differentiates itself by focusing on data structure design, with UI updates automatically triggered by data mutations.\n\nKey features include:\n\n*   **Declarative UI:** Utilizes Rust macros for UI definition, but doesn't force a new language.\n*   **Widget Composition System:** Offers flexible widget creation through function widgets, `Render`, and `ComposeChild`.\n*   **Non-Intrusive State:** Converts data to a listenable state, updating the view based on changes.\n*   **Flutter Inspired Layout:** A sublinear layout system for efficient UI arrangement.\n*   **Composition Event System:** Supports event bubbling and capture.\n*   **Theme System:** Allows for different themes for sub-trees and runtime modification.\n*   **GPU Rendering:** Utilizes `wgpu` for GPU-accelerated rendering via path tessellation.\n*   **Text Support:** Basic text typography and IME input.\n*   **Basic Widgets Library:** Contains over 20 basic widgets.\n\nCurrently, Ribir supports Linux, Windows, macOS, and Web, with active development and testing on these platforms. While it can compile on mobile (iOS and Android), dedicated UI adaptation for mobile is planned for a later stage.\n\nThe project encourages contributions through documentation improvements, test coverage, and bug reporting. Ribir is MIT-licensed.\n",
    "chinese_title": "Ribir: Rust/WASM 的非侵入式 GUI 框架",
    "chinese_summary": "Ribir 是一个非侵入式的 Rust GUI 框架，旨在通过单一代码库构建多平台应用程序。它专注于数据结构设计，通过数据变化自动触发 UI 更新，以此与众不同。\n\n主要特性包括：\n\n*   **声明式 UI:** 利用 Rust 宏进行 UI 定义，但不会强制使用新的语言。\n*   **组件组合系统:** 通过函数组件、`Render` 和 `ComposeChild` 提供灵活的组件创建。\n*   **非侵入式状态:** 将数据转换为可监听状态，并根据变化更新视图。\n*   **Flutter 启发的布局:** 一种亚线性布局系统，用于高效的 UI 排列。\n*   **组合事件系统:** 支持事件冒泡和捕获。\n*   **主题系统:** 允许为子树设置不同的主题并进行运行时修改。\n*   **GPU 渲染:** 利用 `wgpu` 通过路径细分进行 GPU 加速渲染。\n*   **文本支持:** 基本的文本排版和 IME 输入。\n*   **基础组件库:** 包含超过 20 个基础组件。\n\n目前，Ribir 支持 Linux、Windows、macOS 和 Web，并在这些平台上进行积极的开发和测试。虽然它可以编译到移动平台（iOS 和 Android），但针对移动平台的专用 UI 适配计划在稍后阶段进行。\n\n该项目鼓励通过改进文档、增加测试覆盖率和报告错误来进行贡献。Ribir 采用 MIT 许可证。"
  },
  {
    "id": "45855918",
    "title": "Always Be Ready to Leave (Even If You Never Do)",
    "url": "https://andreacanton.dev/posts/2025-11-08-always-ready-to-leave/",
    "summary": "Andrea's article emphasizes that being \"ready to leave\" a job isn't just about exit strategies, but about cultivating professional habits that benefit you regardless of whether you stay or go.  After seven years at her previous company, Andrea outlines how she made her departure smooth by:\n\n*   **Communicating openly with decision-makers:** Instead of ranting to colleagues, she transparently discussed her concerns with her supervisor and HR, giving them opportunities to address issues and building a relationship based on honesty.\n*   **Documenting everything:** She actively documented her work processes, not as an exit strategy, but as a daily practice to clarify her thinking, reduce her cognitive load, and enable better collaboration and easier onboarding.\n*   **Strategically choosing battles:** She prioritized responsibilities that built her skills and advanced her career, avoiding tasks that drained her energy without contributing to her growth.\n\nThese habits, paradoxically, improved her work life even while she was still at Terranova, reducing stress and enabling her to focus on meaningful work. She emphasizes that \"being ready to leave\" means working professionally and making conscious choices about your career, rather than feeling trapped.\n\nWhen the time comes to leave, Andrea advises understanding your legal obligations, following the proper chain of command when announcing your departure, remaining useful until your last day by facilitating the transition, and expressing genuine gratitude. Ultimately, the best way to leave well is to consistently work well, building these habits from day one. She intends to carry these practices forward into her new role.\n",
    "chinese_title": "随时准备离开 (即使你从未离开)",
    "chinese_summary": "安德烈的文章强调，“准备离职”不仅仅是制定退出策略，而是培养对你有利的职业习惯，无论你留下还是离开。 在她之前公司工作七年后，安德烈概述了她如何通过以下方式顺利离职：\n\n*   **与决策者公开沟通：** 她没有向同事抱怨，而是坦诚地与她的主管和人力资源部门讨论她的顾虑，让他们有机会解决问题，并建立在诚实基础上的关系。\n*   **记录一切：** 她积极记录她的工作流程，不是作为一种退出策略，而是作为一种日常实践来理清她的思路，减轻她的认知负担，并促进更好的协作和更容易的入职。\n*   **有策略地选择战斗：** 她优先考虑那些能够提升她的技能并促进她的职业发展的职责，避免那些消耗她的精力而又对她的成长没有贡献的任务。\n\n矛盾的是，这些习惯甚至在她还在Terranova公司工作期间就改善了她的工作生活，减轻了压力，使她能够专注于有意义的工作。 她强调，“准备离职”意味着以专业的态度工作，并对你的职业生涯做出有意识的选择，而不是感到被困住。\n\n当离职时机到来时，安德烈建议了解你的法律义务，在宣布你的离职时遵循正确的指挥链，通过促进过渡在你的最后一天仍然发挥作用，并表达真诚的感激之情。 最终，好好离职的最佳方式是一贯地好好工作，从第一天起就养成这些习惯。 她打算将这些实践延续到她的新岗位上。"
  },
  {
    "id": "45853536",
    "title": "Local First Htmx",
    "url": "https://elijahm.com/posts/local_first_htmx/",
    "summary": "This article introduces the concept of \"Local First HTMX,\" a paradigm for building responsive web applications. It argues that traditional Server-Side Rendering (SSR), while common, can lead to sluggish performance due to the round trip time required for every interaction. Local First design, where the UI and data are co-located and changes synced asynchronously, offers a more performant alternative.\n\nThe core idea is to leverage HTMX, a \"meme\" (and serious tool) that aims to simplify frontend development, alongside WebAssembly (WASM) and service workers. The proposed architecture involves compiling SSR code into WASM and running it within a service worker. This service worker intercepts all `fetch` requests triggered by HTMX elements, handles the request locally, renders HTML, and returns it directly to the browser. In the background, the service worker synchronizes data with the server.\n\nThis approach aims to achieve the snappiness of a Javascript-based Single Page Application (SPA) with less Javascript code, by offloading the rendering to the browser while maintaining server synchronization.  The author promises a follow-up post detailing the implementation, challenges, and potential future developments of this \"Local First HTMX\" approach. The article advocates for local-first architecture for superior performance and user experience.\n",
    "chinese_title": "本地优先 Htmx",
    "chinese_summary": "本文介绍了“本地优先 HTMX”的概念，这是一种构建响应式 Web 应用程序的范例。文章认为，传统的服务器端渲染 (SSR) 虽然常见，但由于每次交互都需要往返时间，可能导致性能下降。“本地优先”设计将 UI 和数据共同定位，并异步同步更改，从而提供了一种性能更高的替代方案。\n\n核心思想是利用 HTMX（一种旨在简化前端开发的“梗”，同时也是一个严肃的工具）、WebAssembly (WASM) 和 service worker。所提出的架构涉及将 SSR 代码编译为 WASM，并在 service worker 中运行它。此 service worker 拦截所有由 HTMX 元素触发的 `fetch` 请求，在本地处理请求，渲染 HTML，并将其直接返回到浏览器。在后台，service worker 会与服务器同步数据。\n\n这种方法旨在通过将渲染卸载到浏览器，同时保持服务器同步，从而以更少的 Javascript 代码实现基于 Javascript 的单页应用程序 (SPA) 的流畅性。作者承诺在后续文章中详细介绍“本地优先 HTMX”方法的实现、挑战和潜在的未来发展。本文提倡采用本地优先架构，以获得卓越的性能和用户体验。"
  },
  {
    "id": "45786042",
    "title": "Can you save on LLM tokens using images instead of text?",
    "url": "https://pagewatch.ai/blog/post/llm-text-as-image-tokens/",
    "summary": "This article explores whether using images of text instead of text directly can save on LLM tokens. The author was inspired by the observation that OpenAI's API charges nearly the same number of tokens for image inputs as it does for text, despite the image potentially containing far more information.\n\nTo test this, the author compared the token usage and cost of using text and image versions of a blog post by Karpathy, prompting GPT models to summarize hygiene tips. The blog post was converted into two 768x768 images to meet OpenAI's optimal image size, ensuring readability.\n\nThe results show that while using images does reduce prompt tokens, particularly with GPT-5 (over 40% reduction), it often increases completion tokens. Only GPT-5-chat model resulted in savings when using images. Since completion tokens are typically more expensive than prompt tokens, only using the GPT-5-chat model would yield savings with this strategy.\n\nTherefore, the article concludes that while token savings are possible by using images instead of text, they are dependent on the model used and likely not worth the trade-offs, such as the increased complexity of image preparation and longer processing times.\n",
    "chinese_title": "能否用图像代替文本，节省LLM Token？",
    "chinese_summary": "本文探讨了使用文本图像而非直接文本是否能节省LLM token。作者的灵感来自于观察到OpenAI的API对图像输入的收费token数量几乎与文本相同，尽管图像可能包含更多信息。\n\n为了验证这一点，作者比较了使用Karpathy的博客文章的文本和图像版本所消耗的token以及成本，并提示GPT模型总结卫生习惯的技巧。该博客文章被转换为两张768x768的图像，以满足OpenAI的最佳图像尺寸要求，并确保可读性。\n\n结果表明，虽然使用图像确实减少了prompt tokens，尤其是在GPT-5中（减少超过40%），但通常会增加completion tokens。只有GPT-5-chat模型在使用图像时产生了节省。由于completion tokens通常比prompt tokens更昂贵，因此只有使用GPT-5-chat模型才能通过此策略实现节省。\n\n因此，文章得出结论，虽然通过使用图像代替文本来节省token是可能的，但这取决于所使用的模型，并且可能不值得权衡，例如图像准备的复杂性增加和处理时间更长。"
  },
  {
    "id": "45850751",
    "title": "VLC's Jean-Baptiste Kempf Receives the European SFS Award 2025",
    "url": "https://fsfe.org/news/2025/news-20251107-01.en.html",
    "summary": "Jean-Baptiste Kempf, president of VideoLAN and lead developer of VLC Media Player, has been awarded the European SFS Award 2025 for his long-term dedication to the Free Software movement. The award, presented by the FSFE and LUGBZ, recognizes his significant and lasting contributions to making VLC a ubiquitous and essential media player.\n\nOriginating as a student project in 1996, VLC faced potential abandonment after its initial developers graduated. Kempf stepped in, reorganized the code, and inspired new contributors, transforming VLC into the indispensable media player used by billions globally. He also founded VideoLabs and the VideoLAN non-profit organization to ensure the software remains free and community-driven.\n\nThe award celebrates Kempf's commitment to software freedom, resisting corporate buyouts and prioritizing user freedom over profit. He was lauded for fostering a vibrant community of volunteers and for making VLC accessible across various operating systems. His dedication was previously recognized with the Chevalier de l’Ordre National du Mérite in 2018.\n\nKempf thanked the VideoLAN and FFmpeg teams for their hard work and dedication. The European SFS Award recognizes individuals who advance Free Software across Europe, promoting community building and ethical technology. Previous recipients include Frank Karlitschek (Nextcloud) and Bram Moolenaar (Vim).\n",
    "chinese_title": "VLC创始人让-巴蒂斯特·肯普夫荣获2025年欧洲自由软件奖",
    "chinese_summary": "VideoLAN主席兼VLC Media Player首席开发者让-巴蒂斯特·肯普夫因其长期致力于自由软件运动而荣获2025年欧洲SFS奖。该奖项由FSFE和LUGBZ颁发，旨在表彰他为使VLC成为无处不在且不可或缺的媒体播放器所做出的重大而持久的贡献。\n\nVLC最初是1996年的一个学生项目，在其最初的开发者毕业后面临被放弃的可能。肯普夫介入其中，重组了代码，并激励了新的贡献者，将VLC转变为全球数十亿人使用的不可或缺的媒体播放器。他还创立了VideoLabs和VideoLAN非营利组织，以确保该软件保持免费且由社区驱动。\n\n该奖项旨在表彰肯普夫对软件自由的承诺，抵制公司收购，并将用户自由置于利润之上。他因培养了一个充满活力的志愿者社区以及使VLC可在各种操作系统上使用而受到称赞。他的奉献精神此前曾在2018年获得法国国家功绩骑士勋章的认可。\n\n肯普夫感谢VideoLAN和FFmpeg团队的辛勤工作和奉献精神。欧洲SFS奖旨在表彰那些在欧洲推进自由软件，促进社区建设和道德技术的个人。之前的获奖者包括Frank Karlitschek (Nextcloud) 和Bram Moolenaar (Vim)。"
  },
  {
    "id": "45809429",
    "title": "Transducer: Composition, abstraction, performance (2018)",
    "url": "https://funktionale-programmierung.de/en/2018/03/22/transducer.html",
    "summary": "This article by Marco Schneider explores transducers in Clojure, highlighting their compositionality, abstraction, and performance benefits compared to traditional list processing. The core idea is that `map`, `filter`, and similar higher-order functions can be redefined using `reduce` and further abstracted by parameterizing over the accumulation step (`conj` in the examples). This abstraction allows these operations to work on data structures beyond lists, such as channels, without modification.\n\nThe article demonstrates this by redefining `map` and `filter` as \"process modifiers\" that operate on steps, allowing for a separation of concerns between the transformation logic and the underlying data structure. By introducing arity overloading (functions accepting different number of arguments), transducers gain the ability to handle the \"beginning\" and \"end\" of processes independently of the data structure.\n\nA practical example showcases how using transducers (via `transduce`, Clojure's built-in function) to calculate the average performance of master's students is significantly faster than the traditional `filter-map-reduce` approach. This speedup is attributed to avoiding intermediate list creation, leading to increased throughput.\n\nFinally, the article illustrates transducers' versatility by applying the same transformation process to data flowing through Clojure's asynchronous channels, proving their reusability across different data structures. The conclusion emphasizes that transducers are a powerful, composable, and high-performance alternative to traditional list functions, offering significant advantages through consistent abstraction.\n",
    "chinese_title": "传感器：构成、抽象、性能 (2018)",
    "chinese_summary": "Marco Schneider 的这篇文章探讨了 Clojure 中的 transducers，重点介绍了它们相比传统列表处理的组合性、抽象性和性能优势。其核心思想是 `map`、`filter` 和类似的 higher-order 函数可以使用 `reduce` 重新定义，并通过参数化累积步骤（示例中的 `conj`）进一步抽象。这种抽象允许这些操作在无需修改的情况下，作用于列表之外的数据结构，如通道。\n\n这篇文章通过将 `map` 和 `filter` 重新定义为作用于步骤的“进程修饰符”来演示这一点，从而实现了转换逻辑和底层数据结构之间的关注点分离。通过引入 arity overloading（接受不同数量参数的函数），transducers 获得了独立于数据结构处理进程“开始”和“结束”的能力。\n\n一个实际例子展示了使用 transducers（通过 Clojure 的内置函数 `transduce`）计算硕士研究生的平均成绩，比传统的 `filter-map-reduce` 方法快得多。 这种加速归因于避免了中间列表的创建，从而提高了吞吐量。\n\n最后，文章通过将相同的转换过程应用于流经 Clojure 异步通道的数据，说明了 transducers 的多功能性，证明了它们在不同数据结构中的可重用性。结论强调，transducers 是传统列表函数的一种强大、可组合且高性能的替代方案，通过一致的抽象提供了显著优势。"
  },
  {
    "id": "45848083",
    "title": "Denmark's government aims to ban access to social media for children under 15",
    "url": "https://apnews.com/article/denmark-social-media-ban-children-7862d2a8cc590b4969c8931a01adc7f4",
    "summary": "Denmark's government is moving to ban social media access for children under 15, citing concerns about harmful content, commercial exploitation, and the amount of time children spend online. Digital Affairs Minister Caroline Stage stated that a large percentage of Danish children under 13 are already on social media, exposing them to violence and self-harm content.\n\nWhile tech platforms often have age restrictions, these aren't always effective. The proposed legislation aims to give parents the right to allow children aged 13 and up access after a specific assessment. The government plans to pass the necessary legislation over the coming months, ensuring no loopholes exist for tech companies. Denmark is developing an age-verification app, potentially coupled with its existing national electronic ID system, to enforce the ban. If tech giants fail to implement proper age verification, they risk fines of up to 6% of their global income.\n\nThis move follows a similar ban in Australia, which set the minimum age at 16 and imposed significant fines for non-compliance. While the Danish government emphasizes it is not aiming to exclude children from all digital activities, they hope to keep them safe from harmful content. Social media platform TikTok has responded, recognizing the importance of Denmark's initiative and citing its safety features and tools for parents. Other tech companies have not responded to requests for comment.\n",
    "chinese_title": "丹麦政府计划禁止15岁以下儿童访问社交媒体。",
    "chinese_summary": "丹麦政府拟禁止15岁以下儿童访问社交媒体，理由是担心有害内容、商业剥削以及儿童上网时长。 数字事务部长卡罗琳·斯凯表示，很大比例的13岁以下丹麦儿童已经在使用社交媒体，使他们接触到暴力和自残内容。\n\n虽然科技平台通常有年龄限制，但这些并不总是有效。 拟议的立法旨在赋予家长在特定评估后允许13岁及以上儿童访问的权利。 政府计划在未来几个月内通过必要的立法，确保科技公司不存在漏洞可钻。 丹麦正在开发一款年龄验证应用程序，可能与其现有的国家电子身份证系统结合使用，以执行该禁令。 如果科技巨头未能实施适当的年龄验证，他们将面临高达其全球收入6%的罚款风险。\n\n此前澳大利亚也实施了类似的禁令，将最低年龄设定为16岁，并对违规行为处以巨额罚款。 丹麦政府强调，其目的并非将儿童排除在所有数字活动之外，而是希望保护他们免受有害内容的影响。 社交媒体平台TikTok已做出回应，表示认可丹麦此举的重要性，并列举了其安全功能和家长工具。 其他科技公司尚未回应置评请求。"
  },
  {
    "id": "45852029",
    "title": "How a devboard works (and how to make your own)",
    "url": "https://kaipereira.com/journal/build-a-devboard",
    "summary": "This article is a tutorial on designing a custom dev board using the RP2040 SoC (System on Chip) in KiCad. The author explains the fundamental components of a PCB and how to wire them up in the schematic editor.\n\nThe tutorial covers five main elements: power, flash storage, crystal oscillator, I/O, and the RP2040 itself. It emphasizes good schematic practices, like consistent power/ground label direction and clearly labeled components.\n\nThe article details how to implement power decoupling with capacitors, including 0.1uF capacitors for each power pin and 1uF capacitors per power line (1.1V and 3.3V) to filter noise and provide stable power.  It then guides the reader on wiring up a USB-C receptacle for both power and programming. This involves grounding the SHIELD/GND, connecting D+/D- data lines through 27-ohm termination resistors to the RP2040, pulling down CC1 and CC2 pins with 5.1K resistors, and using an NCP1117 (or MCP1700) LDO (Low-Dropout Regulator) to step down the 5V USB-C input to 3.3V, with 10uF bulk capacitors on either side of the LDO.\n\nThe tutorial also covers the importance of a crystal oscillator for precise timing, explaining how to connect it with appropriate capacitors (15pF/33pF) and a damping resistor (1K) close to the MCU on the PCB. Finally, it explains the necessity of external flash storage due to the RP2040 not having built-in flash, explaining SPI and Quad SPI communication protocols, and wiring up a W25Q128JVS flash memory IC to the RP2040 via its QSPI pins, with a 0.1uF decoupling capacitor for noise filtering. The next step involves adding a button.\n",
    "chinese_title": "开发板工作原理（以及如何自制）",
    "chinese_summary": "本教程介绍如何使用KiCad设计基于RP2040 SoC (片上系统) 的定制开发板。作者解释了PCB的基本组成部分以及如何在原理图编辑器中进行连接。\n\n本教程涵盖五个主要元素：电源、闪存、晶体振荡器、I/O 和 RP2040 本身。它强调良好的原理图实践，例如一致的电源/地标签方向和清晰标记的组件。\n\n文章详细介绍了如何使用电容实现电源去耦，包括为每个电源引脚使用 0.1uF 电容，以及为每条电源线（1.1V 和 3.3V）使用 1uF 电容，以滤除噪声并提供稳定的电源。 然后，它指导读者连接 USB-C 插座以进行电源和编程。 这包括接地 SHIELD/GND，通过 27 欧姆终端电阻将 D+/D- 数据线连接到 RP2040，使用 5.1K 电阻下拉 CC1 和 CC2 引脚，以及使用 NCP1117（或 MCP1700）LDO (低压差稳压器) 将 5V USB-C 输入降至 3.3V，LDO 两侧各使用 10uF 旁路电容。\n\n本教程还介绍了晶体振荡器对于精确计时的重要性，解释了如何将其与适当的电容 (15pF/33pF) 和阻尼电阻 (1K) 连接在 PCB 上靠近 MCU 的位置。 最后，它解释了由于 RP2040 没有内置闪存，因此外部闪存的必要性，解释了 SPI 和 Quad SPI 通信协议，并通过其 QSPI 引脚将 W25Q128JVS 闪存 IC 连接到 RP2040，并使用一个 0.1uF 去耦电容进行噪声滤波。 下一步是添加一个按钮。"
  },
  {
    "id": "45843948",
    "title": "Leaving Meta and PyTorch",
    "url": "https://soumith.ch/blog/2025-11-06-leaving-meta-and-pytorch.md.html",
    "summary": "Soumith Chintala, after eleven years at Meta, is leaving, marking the end of his eight-year leadership of PyTorch. He expresses immense pride in PyTorch's growth from a small project to a widely adopted AI framework powering exascale training, foundation models, and used in academia and industry globally. Despite acknowledging the continued need for PyTorch to evolve, he believes its initial goals of accessibility and lowering barriers to entry have been largely achieved.\n\nSoumith explains his departure stems from a desire for something new and small, a need to explore opportunities outside the large, influential role he held at Meta. He emphasizes that this decision wasn't taken lightly, given his influential position and access to key players in the AI industry.\n\nHe expresses confidence in PyTorch's future, citing a strong and capable leadership team ready to guide the project. He explicitly names Edward, Suo, Alban, Greg, John, Joe, and Jana and their value alignment with PyTorch’s original vision. He believes PyTorch will continue to thrive, even without his direct involvement.\n\nSoumith reminisces fondly about his time at Meta's FAIR (Facebook AI Research) division, highlighting the collaborative and innovative environment. He expresses gratitude to key figures at Meta, including Mark Zuckerberg, Mike Schroepfer, Yann LeCun, Rob Fergus, and Aparna Ramani, for their support and belief in open-source principles. He also thanks countless members of the PyTorch team and community for their contributions. He plans to stay involved as a user, offering feedback and filing issues.\n",
    "chinese_title": "离开Meta和PyTorch",
    "chinese_summary": "在Meta工作十一年后，Soumith Chintala即将离职，标志着他领导PyTorch八年的结束。他表示，PyTorch从一个小项目成长为被广泛采用的AI框架，为百亿亿次级训练、基础模型提供动力，并在全球学术界和工业界得到应用，对此他感到无比自豪。尽管他承认PyTorch仍需不断发展，但他相信其最初设定的可访问性和降低准入门槛的目标已基本实现。\n\nSoumith解释说，他离开的原因是渴望新的、小型的项目，需要探索在Meta所担任的重要职位之外的机会。他强调，考虑到他的影响力以及与人工智能行业关键人物的接触，这个决定并非轻易做出。\n\n他对PyTorch的未来充满信心，认为强大的领导团队已经准备好指导该项目。他明确提到了Edward、Suo、Alban、Greg、John、Joe和Jana，以及他们与PyTorch最初愿景的价值一致性。他相信即使没有他的直接参与，PyTorch也会继续蓬勃发展。\n\nSoumith深情地回忆了他在Meta的FAIR（Facebook AI Research）部门的时光，强调了协作和创新的环境。他感谢Meta的关键人物，包括马克·扎克伯格、迈克·施洛普弗、杨立昆、罗伯·弗格斯和阿帕纳·拉马尼，感谢他们对开源原则的支持和信任。他还感谢PyTorch团队和社区的无数成员的贡献。他计划继续作为用户参与其中，提供反馈和提交问题。"
  },
  {
    "id": "45857099",
    "title": "$1T in Tech Stocks Sold Off as Market Grows Skeptical of AI",
    "url": "https://gizmodo.com/1-trillion-in-tech-stocks-sold-off-as-market-grows-skeptical-of-ai-2000683226",
    "summary": "The article discusses a recent downturn in tech stocks, particularly those heavily invested in AI, leading to a collective loss of $1 trillion in market value. Companies like Oracle, Meta, Palantir, and Nvidia have experienced significant stock declines, prompting skepticism about the profitability and massive expenditures associated with AI.\n\nMicrosoft is highlighted as experiencing its worst losing streak since 2011, with a $350 billion market valuation loss. Wall Street is growing wary of the vast sums being poured into AI infrastructure without concrete profits, as exemplified by Microsoft's $35 billion expenditure in the last quarter.\n\nBeyond AI-focused tech giants, the article notes broader economic anxieties contributing to the tech slump. Sweetgreen, a company attempting to integrate AI and automation, has struggled, selling off its robotics division after seeing its stock value plummet. Overall job losses are high, particularly in the tech sector, with Amazon shedding 14,000 jobs in the last month.\n\nAdding to the negative sentiment, a University of Michigan survey indicates that consumer sentiment is at a historic low, driven by concerns about the ongoing government shutdown and its potential economic consequences. The article concludes with a pessimistic outlook on the current economic climate, describing it as a \"dumpster fire\" with widespread fear and economic hardship.\n",
    "chinese_title": "科技股抛售潮达1万亿美元，市场对人工智能日益怀疑",
    "chinese_summary": "科技股下跌：AI投资巨头市值蒸发万亿，经济前景堪忧"
  },
  {
    "id": "45846360",
    "title": "I'm making a small RPG and I need feeback regarding performance",
    "url": "https://jslegenddev.substack.com/p/im-making-a-small-rpg-and-i-need",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "我在做一个小型RPG游戏，需要一些关于性能的反馈。",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "45857087",
    "title": "Reputational consequences of victim signaling: Victimhood decreases status",
    "url": "https://www.sciencedirect.com/science/article/pii/S0191886925004775",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "受害者信号的声誉后果：受害降低地位",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "45853849",
    "title": "GPT-OSS 120B Runs at 3000 tokens/sec on Cerebras",
    "url": "https://www.cerebras.ai/blog/openai-gpt-oss-120b-runs-fastest-on-cerebras",
    "summary": "This article announces the availability of OpenAI's GPT OSS 120B, a powerful open-weight reasoning model, on Cerebras systems. The key takeaway is that Cerebras offers significantly faster performance compared to GPU-based solutions.\n\nGPT OSS 120B, a 120 billion parameter model, rivals OpenAI's o4-mini in accuracy on reasoning benchmarks and excels in tasks like coding, math, and health-related queries. Its open-weight nature allows for transparency and fine-tuning flexibility.\n\nCerebras boasts up to 3,000 tokens per second inference speeds, reportedly 15x faster than leading GPU clouds. They also claim a time to first token of just 280 milliseconds, with output speed of 2,700 tokens/s. This speed makes it suitable for agentic and coding applications where rapid response times are crucial.\n\nMoreover, Cerebras claims equal-first accuracy in the AIME 2025 math evaluation and offers a strong price-performance advantage, delivering 16x the speed of the median GPU cloud for less than twice the cost. The model is available on the Cerebras Inference Cloud and through partners like HuggingFace, OpenRouter, and Vercel.\n",
    "chinese_title": "GPT-OSS 120B 在 Cerebras 上运行速度达 3000 tokens/秒",
    "chinese_summary": "本文宣布OpenAI的GPT OSS 120B（一款强大的开放权重推理模型）在Cerebras系统上可用。主要结论是，Cerebras提供的性能明显快于基于GPU的解决方案。\n\nGPT OSS 120B是一个拥有1200亿参数的模型，在推理基准测试中，其准确性可与OpenAI的o4-mini相媲美，并在编码、数学和健康相关查询等任务中表现出色。其开放权重的特性使其具有透明性和微调灵活性。\n\n据称，Cerebras拥有高达每秒3,000个token的推理速度，比领先的GPU云快15倍。他们还声称首个token的时间仅为280毫秒，输出速度为2,700个token/秒。这种速度使其适用于需要快速响应时间的代理和编码应用程序。\n\n此外，Cerebras声称在AIME 2025数学评估中并列第一，并具有强大的性价比优势，以不到两倍的成本提供中位数GPU云16倍的速度。该模型可在Cerebras推理云上以及通过HuggingFace、OpenRouter和Vercel等合作伙伴获得。"
  },
  {
    "id": "45798123",
    "title": "Understanding traffic",
    "url": "https://dr2chase.wordpress.com/",
    "summary": "This article delves into the complexities of traffic congestion, explaining that simply adding more lanes isn't a viable solution. It differentiates between road speed and throughput, highlighting that traffic jams significantly reduce throughput. The author emphasizes that cars are inefficient at transporting people due to space constraints and reaction time requirements, leading to limited lane capacity. Bottlenecks, often at intersections, are major culprits, and fixing one bottleneck merely exposes the next.\n\nThe article introduces the concept of \"marginal drivers,\" those who are willing to endure traffic, thus setting the overall congestion level. It also discusses \"latent demand,\" referring to people who avoid driving due to traffic and would drive if conditions improved. This highlights the phenomenon of induced demand, where improved road conditions attract more drivers, potentially negating the benefits of expansion.\n\nThe author also points out that through traffic contributes significantly to congestion and that routes compete with each other, sometimes causing counterintuitive situations like Braess's Paradox, where removing a road can actually improve flow.\n\nThe author advocates for attractive alternatives to driving, such as better and more frequent transit with seamless connections to other modes. They also suggest prioritizing transit in traffic, providing safe bike routes with parking, and supporting the use of e-bikes. Addressing minor inconveniences that discourage non-car modes can also contribute to reducing traffic.\n\nFinally, the article touches on the inadequacy of current bicycling networks, particularly for those using cargo bikes or trailers, and how infrastructure needs to be designed with a broader vision to encourage more people to choose cycling.\n",
    "chinese_title": "理解交通",
    "chinese_summary": "本文深入探讨了交通拥堵的复杂性，指出简单增加车道并非可行的解决方案。文章区分了道路速度和通行能力，强调交通堵塞会显著降低通行能力。作者强调，由于空间限制和反应时间要求，汽车在运送人员方面效率低下，导致车道容量有限。瓶颈，尤其是交叉路口，是主要原因，而解决一个瓶颈只会暴露下一个。\n\n文章介绍了“边际驾驶者”的概念，即那些愿意忍受交通拥堵的人，从而决定了整体拥堵程度。文章还讨论了“潜在需求”，指的是那些因交通拥堵而避免开车的人，如果交通状况改善，他们就会开车。这突出了诱导需求现象，即改善的道路状况会吸引更多的驾驶者，从而可能抵消扩建带来的好处。\n\n作者还指出，过境交通是造成拥堵的重要原因，并且路线之间相互竞争，有时会导致违反直觉的情况，例如布雷斯悖论，即移除一条道路实际上可以改善交通流量。\n\n作者提倡具有吸引力的替代驾驶方案，例如更好、更频繁的公交，并与其他交通方式无缝衔接。他们还建议在交通中优先考虑公交，提供安全的自行车道和停车场，并支持使用电动自行车。解决那些阻碍非汽车出行方式的小问题也有助于减少交通。\n\n最后，文章还谈到了当前自行车网络的不完善，特别是对于那些使用货运自行车或拖车的人来说，以及基础设施需要以更广阔的视野进行设计，以鼓励更多的人选择骑自行车。"
  },
  {
    "id": "45843146",
    "title": "A Fond Farewell",
    "url": "https://www.farmersalmanac.com/fond-farewell-from-farmers-almanac",
    "summary": "The Farmers' Almanac has announced that its 2026 edition will be its last, marking the end of a 200+ year publication run. In a farewell message, editors Sandi Duncan and Peter Geiger express gratitude to their loyal readers, contributors, and partners. They acknowledge the Almanac's long-standing presence in many families, where it was used for everything from planting guides based on Moon phases to determining the \"Best Days\" for various activities.\n\nWhile the Almanac will no longer be available in print or online after December 2025, the editors encourage readers to keep its spirit alive by passing down its wisdom and traditions. They suggest sharing Almanac-inspired knowledge, like planting peas when daffodils bloom or interpreting a red sky at night, to future generations.\n\nCopies of the final 2026 edition are available for purchase on FarmersAlmanac.com, Amazon.com, and at select local stores. Members are advised to check their inboxes for subscription information.\n",
    "chinese_title": "依依惜别",
    "chinese_summary": "《农民年鉴》宣布2026年版将是最后一版，标志着超过200年出版历程的结束。在告别信中，编辑桑迪·邓肯和彼得·盖格向他们忠实的读者、贡献者和合作伙伴表示感谢。他们承认年鉴在许多家庭中长期存在，人们利用它做各种事情，从根据月相制定的种植指南到确定各种活动的“最佳日子”。\n\n虽然年鉴在2025年12月之后将不再提供印刷版或在线版本，但编辑们鼓励读者通过传承其智慧和传统来保持其精神的延续。他们建议将年鉴启发下的知识，如水仙花开时种植豌豆或解读夜晚红色的天空，分享给后代。\n\n最后一版2026年版可在FarmersAlmanac.com、Amazon.com和部分当地商店购买。会员请查看收件箱以获取订阅信息。"
  },
  {
    "id": "45786490",
    "title": "Text case changes the size of QR codes",
    "url": "https://www.johndcook.com/blog/2025/10/31/smaller-qr-codes/",
    "summary": "This article explains how the case of text used to generate a QR code impacts its size. When generating QR codes, the algorithm interprets mixed-case text as binary data (ISO/IEC 8859-1), requiring 8 bits per character. However, if the text is entirely uppercase and within the QR code's alphanumeric character set (45 characters), it is encoded using a more efficient alphanumeric mode, encoding two characters in 11 bits (5.5 bits per character).\n\nThis more efficient encoding means that uppercase text generates smaller QR codes because it requires fewer bits to represent the same information. The example given demonstrates a reduction from a 33x33 pixel grid to a 29x29 pixel grid when converting text to uppercase before creating the QR code.\n\nThe article then applies this principle to Bitcoin addresses. Bech32 encoding, which uses a 32-character monocase alphabet, although requiring more characters than Base58 encoding (58 characters), ultimately results in smaller QR codes because of the monocase nature and the efficiency of alphanumeric encoding after being converted to uppercase. Therefore Bech32 encoding needs fewer QR code pixels to represent the same data as Base58 encoding.\n",
    "chinese_title": "文本大小写改变二维码尺寸",
    "chinese_summary": "本文解释了用于生成二维码的文本的大小写如何影响二维码的大小。生成二维码时，算法将大小写混合的文本解释为二进制数据（ISO/IEC 8859-1），每个字符需要 8 位。但是，如果文本完全是大写字母，并且位于二维码的字母数字字符集（45 个字符）内，则会使用更高效的字母数字模式进行编码，即用 11 位编码两个字符（每个字符 5.5 位）。\n\n这种更高效的编码意味着大写文本生成较小的二维码，因为它需要更少的位来表示相同的信息。给出的示例演示了在创建二维码之前将文本转换为大写时，从 33x33 像素网格减少到 29x29 像素网格。\n\n然后，本文将此原理应用于比特币地址。Bech32 编码使用 32 个字符的单字母表，虽然比 Base58 编码（58 个字符）需要更多字符，但由于单字母表的性质以及转换为大写后字母数字编码的效率，最终会产生更小的二维码。因此，Bech32 编码需要更少的二维码像素来表示与 Base58 编码相同的数据。"
  },
  {
    "id": "45855481",
    "title": "Why LTO-10 fell short on speed and backward compatibility",
    "url": "https://blocksandfiles.com/2025/07/29/tape-engineering-changes-from-lto-9-to-lto-10/",
    "summary": "This article analyzes why LTO-10 tape, while increasing capacity, failed to improve I/O speed and lost backward compatibility with LTO-9. LTO-9 uses linear serpentine recording, shingling, and servo bands for precise head positioning. Capacity increases traditionally come from wider/longer tapes, narrower tracks, or smaller bit areas, while I/O improvements come from faster tape speeds and more read-write head elements.\n\nLTO-10 maintained the 400 MBps native data rate due to physical limitations of the tape material's thickness, preventing faster speeds without risking damage. Linear density (bit length) also couldn't be easily improved, so capacity gains came from drastically increasing track density.\n\nWhile a 64-track read-write head (potentially doubling I/O to 1,000 MBps) is technically feasible, it presents a significant engineering challenge due to the massive increase in cables required.\n\nThe decision to forgo backward compatibility was driven by two major factors. First, clients usually skip generations and would be migrating from LTO-7/8 to LTO-10. Second, LTO-10 uses a different servo format with 36° angles to increase head assembly positioning resolution. This change, alongside improved tape dimensional stability, media initialization, and the introduction of head tilt-following control to handle the increased track density, made backward compatibility unachievable. Essentially, the pursuit of higher track density necessitated significant changes to the servo system and head positioning mechanisms, sacrificing compatibility for performance potential.\n",
    "chinese_title": "LTO-10为何在速度和向后兼容性方面表现不佳",
    "chinese_summary": "本文分析了LTO-10磁带在增加容量的同时，未能提高I/O速度并丧失与LTO-9向后兼容性的原因。LTO-9采用线性蛇形记录、叠瓦式记录和伺服带进行精确磁头定位。容量的增加传统上来自更宽/更长的磁带、更窄的磁道或更小的位区域，而I/O的改进则来自更快的磁带速度和更多的读写磁头元件。\n\nLTO-10保持了400 MBps的原始数据速率，因为磁带材料的厚度存在物理限制，无法在不冒损坏风险的情况下提高速度。线性密度（位长度）也难以轻松提高，因此容量的增加主要来自大幅提高磁道密度。\n\n虽然技术上可行使用64磁道读写头（可能将I/O提高到1,000 MBps），但这提出了巨大的工程挑战，因为所需的电缆数量将大幅增加。\n\n放弃向后兼容性的决定主要由两个因素驱动。首先，客户通常会跳过几代产品，直接从LTO-7/8迁移到LTO-10。其次，LTO-10使用不同的伺服格式，采用36°角来提高磁头组件的定位分辨率。这种改变，加上改进的磁带尺寸稳定性、介质初始化以及引入的磁头倾斜跟踪控制，以处理增加的磁道密度，使得向后兼容性无法实现。本质上，对更高磁道密度的追求迫使伺服系统和磁头定位机制发生重大变化，牺牲了兼容性以换取性能潜力。"
  },
  {
    "id": "45778653",
    "title": "1973 implementation of Wordle was published by DEC (2022)",
    "url": "https://troypress.com/1973-implementation-of-wordle-was-published-by-dec/",
    "summary": "This article traces the origins of Wordle-like games back to a 1973 BASIC program called WORD, published by Digital Equipment Corp. (DEC). Unlike the 1955 game Jotto, WORD provided clues about letter placement, similar to Wordle. Written by Charles Reid, WORD was included in the popular book *BASIC Computer Games*.\n\nThe article then broadens its scope to explore the history of guessing games in early computing, highlighting GUESS, a FOCAL program that inspired many others. These games, often simple enough for early computers with limited memory, involved a computer concealing information which the player had to deduce. Other examples include HI-LO, NUMBER, STARS, TRAP, BAGELS, and HURKLE, all described with their unique mechanics.\n\nThe article also touches on combat-themed guessing games like TARGET, Bombardment, Depth Charge, and Salvo, and explores the more complex reverse-guessing games, where the computer tries to guess what the human is thinking. Examples include ANIMAL, SALVO, DIGITS, and NICOMA.\n\nUltimately, the article emphasizes the rich history of guessing games in early computing, highlighting the simplicity and ingenuity that allowed these games to thrive even with limited technological resources. The article also offers links to play these classic games in a browser, suggesting the potential for rediscovering and rejuvenating these games for a modern audience.\n",
    "chinese_title": "1973年Wordle的实现由DEC于2022年发布。",
    "chinese_summary": "本文追溯了类Wordle游戏的历史渊源，将其追溯到1973年数字设备公司（DEC）发布的BASIC程序WORD。与1955年的游戏Jotto不同，WORD提供了字母位置的提示，与Wordle类似。WORD由查尔斯·里德编写，收录在畅销书《BASIC电脑游戏》中。\n\n然后，本文扩大了范围，探索了早期计算机中猜谜游戏的历史，重点介绍了启发了许多其他游戏的FOCAL程序GUESS。这些游戏通常足够简单，可以在早期内存有限的计算机上运行，包括计算机隐藏信息，玩家必须推断出来。其他例子包括HI-LO、NUMBER、STARS、TRAP、BAGELS和HURKLE，并描述了它们独特的机制。\n\n本文还涉及以战斗为主题的猜谜游戏，如TARGET、Bombardment、Depth Charge和Salvo，并探讨了更复杂的反向猜谜游戏，即计算机试图猜测人类的想法。例子包括ANIMAL、SALVO、DIGITS和NICOMA。\n\n最终，本文强调了早期计算机猜谜游戏丰富多彩的历史，突出了其简单性和独创性，使得这些游戏即使在技术资源有限的情况下也能蓬勃发展。本文还提供了在浏览器中玩这些经典游戏的链接，表明了重新发现和振兴这些游戏以吸引现代观众的潜力。"
  },
  {
    "id": "45789405",
    "title": "Why I love my Boox Palma e-reader",
    "url": "https://minimal.bearblog.dev/why-i-love-my-boox-palma-e-reader/",
    "summary": "This blog post details the author's love for their Boox Palma e-reader and why it has become their preferred reading device over their Kindle Paperwhite. The author emphasizes their rediscovery of reading as a hobby and their appreciation for e-ink technology, citing features like backlight, font consistency, contrast in sunlight, and portability as key benefits.\n\nWhile the author still uses their Kindle, they highlight several issues that led them to seek an alternative. These include the Kindle's size making it less portable, Amazon's restrictive book ownership policies, difficulty importing non-Amazon books, and the annoyance of pervasive ads.\n\nThe Boox Palma, purchased used, addresses these issues. Its small size and lightweight design make it easily pocketable and comfortable to hold. The full Android operating system allows for access to any reading app, freeing the user from the Amazon ecosystem. The screen quality is comparable to or better than the Kindle, and customizable lock screen wallpapers add a personal touch. Furthermore, the absence of built-in internet encourages focused reading. The inclusion of physical page-turn buttons is a bonus.\n\nThe author compares the Boox Palma to their Kindle, discusses their preferred TPU case, and shares pictures of the device in use. In conclusion, the author recommends the Boox Palma for those who value extreme portability and a distraction-free reading experience. They express a minor desire for a custom ROM to improve the Android software.\n",
    "chinese_title": "我为什么喜欢我的Boox Palma电子阅读器",
    "chinese_summary": "这篇博文详细描述了作者对文石Palma电子阅读器的喜爱，以及它如何取代Kindle Paperwhite成为作者首选的阅读设备。作者强调了自己重新发现阅读这一爱好，并赞赏电子墨水技术，列举了背光、字体一致性、阳光下的对比度和便携性等关键优点。\n\n虽然作者仍然使用Kindle，但他们也指出了导致他们寻找替代方案的几个问题。这些问题包括Kindle的尺寸使其便携性降低、亚马逊限制性的图书所有权政策、导入非亚马逊图书的困难，以及无处不在的广告带来的烦恼。\n\n二手购买的文石Palma解决了这些问题。它小巧的尺寸和轻巧的设计使其易于放入口袋且握持舒适。完整的Android操作系统允许访问任何阅读应用程序，从而使用户摆脱了亚马逊的生态系统。屏幕质量与Kindle相当或更好，可自定义的锁屏壁纸增添了个性化色彩。此外，缺乏内置互联网鼓励了专注阅读。物理翻页按钮的加入是一项额外的好处。\n\n作者将文石Palma与他们的Kindle进行了比较，讨论了他们首选的TPU保护套，并分享了设备的使用照片。总之，作者推荐文石Palma给那些重视极致便携性和无干扰阅读体验的人。他们表达了希望有一个自定义ROM来改进Android软件的小小愿望。"
  },
  {
    "id": "45855462",
    "title": "Research first to show humans have remote touch \"seventh sense\" like sandpipers",
    "url": "https://www.qmul.ac.uk/media/news/2025/science-and-engineering/se/research-first-to-show-humans-have-remote-touch-seventh-sense-like-sandpipers.html",
    "summary": "Researchers at Queen Mary University of London and University College London have discovered that humans possess a \"remote touch\" sense, similar to that used by shorebirds like sandpipers to detect buried prey. This is the first documented instance of this sense in humans.\n\nThe study involved participants using their fingers to locate a hidden cube in sand without direct contact. The results showed that humans can detect the presence of buried objects by perceiving minute displacements in the sand, approaching the theoretical limits of mechanical reflection detection.\n\nA comparison between human and robotic performance revealed that humans achieved 70.7% precision in detecting objects within the expected range, while a robotic tactile sensor achieved 40% precision despite sensing objects from slightly farther distances.\n\nThe discovery expands the understanding of human touch perception and offers valuable insights for developing advanced robotic tactile sensing systems. This research highlights potential applications in fields such as archaeology and exploration of challenging terrains like Martian soil or ocean floors, improving safety and effectiveness in tasks where vision is limited.\n\nThe researchers emphasize the multidisciplinary nature of the study, highlighting the collaboration between psychology, robotics, and AI. Elisabetta Versace, from Queen Mary, notes that this changes our conception of human perception, while Zhengqi Chen discusses potential applications in assistive technologies and robotic tools. Lorenzo Jamone from UCL, highlights the synergy between the human and robotic studies, illustrating the power of multidisciplinary collaboration.\n",
    "chinese_title": "研究表明人类可能拥有类似鹬鸟的远程触觉“第七感”",
    "chinese_summary": "伦敦玛丽女王大学和伦敦大学学院的研究人员发现，人类拥有一种“远程触觉”，类似于鹬等滨鸟用来探测埋藏猎物的方式。这是人类首次被记录到拥有这种感觉。\n\n这项研究涉及参与者在不直接接触的情况下，用手指在沙子中定位一个隐藏的立方体。结果表明，人类可以通过感知沙子中的微小位移来探测埋藏物体的存在，接近机械反射探测的理论极限。\n\n人类和机器人性能的比较显示，在预期范围内，人类探测物体的精度达到70.7%，而机器人触觉传感器尽管从稍远的距离感知物体，但精度仅为40%。\n\n这一发现扩展了对人类触觉认知的理解，并为开发先进的机器人触觉传感系统提供了宝贵的见解。这项研究突出了在考古学和探索火星土壤或海底等具有挑战性地形等领域的潜在应用，提高了在视觉受限任务中的安全性和效率。\n\n研究人员强调了这项研究的多学科性质，突出了心理学、机器人学和人工智能之间的合作。玛丽女王大学的伊丽莎白塔·范思哲指出，这改变了我们对人类感知的概念，而郑启辰讨论了在辅助技术和机器人工具中的潜在应用。伦敦大学学院的洛伦佐·贾莫内强调了人类和机器人研究之间的协同作用，说明了多学科合作的力量。"
  },
  {
    "id": "45809649",
    "title": "My Experience of building Bytebeat player in Zig",
    "url": "https://blog.karanjanthe.me/posts/zig-beat/",
    "summary": "This blog post details the author's experience building a bytebeat player called Zigbeat in Zig, a project undertaken during a break between jobs. Bytebeat is a form of algorithmic music generated from short programs using bitwise operations to produce 8-bit audio samples.\n\nThe author chose Zig for the project, appreciating its C-like feel without the complexities of borrow checkers and challenging syntax. The development process, which included setting up a Raylib-Zig project for both native and browser (wasm) compilation, provided valuable insights into Zig's memory management and string handling. A significant hurdle was optimizing performance, which was addressed by implementing an Arena Allocator to efficiently manage memory allocation for the AST (Abstract Syntax Tree) used in parsing bytebeat expressions. Initially, the author was allocating memory for the AST on every sample, which led to performance issues, especially in the browser.\n\nThe author aimed to create a retro 8-bit synth aesthetic, similar to older synthesizers with visualizers. Initial attempts using Raylib's primitive drawing API proved cumbersome, leading to exploration of sprite-based designs, but the author's lack of design experience posed a challenge.\n\nThe author concluded that choosing Zig over JavaScript was beneficial, leading to a deeper understanding of parsing and evaluation techniques like Pratt parsing and lexer mods. They express satisfaction with the learning experience and encourage readers to explore the Zigbeat project on GitHub.\n",
    "chinese_title": "我用 Zig 构建 Bytebeat 播放器的经验",
    "chinese_summary": "用 Zig 构建 Bytebeat 播放器 Zigbeat 的经验\n\n这篇博文详细介绍了作者在工作间隙使用 Zig 语言构建名为 Zigbeat 的 bytebeat 播放器的经验。Bytebeat 是一种算法音乐形式，它通过使用位运算生成 8 位音频样本的短程序来产生音乐。\n\n作者之所以选择 Zig 进行这个项目，是因为它具有类似 C 语言的风格，但没有借用检查器和复杂的语法。开发过程（包括为本机和浏览器 (wasm) 编译设置 Raylib-Zig 项目）提供了对 Zig 的内存管理和字符串处理的宝贵见解。一个重要的障碍是优化性能，这通过实现 Arena Allocator 来有效地管理 AST（抽象语法树）的内存分配来解决。最初，作者在每个样本上都为 AST 分配内存，这导致了性能问题，尤其是在浏览器中。\n\n作者的目标是创造一种复古的 8 位合成器美学，类似于带有可视化器的旧合成器。最初使用 Raylib 的原始绘图 API 的尝试被证明很麻烦，导致探索基于精灵的设计，但作者缺乏设计经验带来了挑战。\n\n作者得出结论，选择 Zig 而不是 JavaScript 是有益的，这导致了对 Pratt 解析和词法分析器修改等解析和评估技术的更深入理解。他们对学习经历表示满意，并鼓励读者在 GitHub 上探索 Zigbeat 项目。"
  },
  {
    "id": "45791596",
    "title": "WinObjC – The Windows Bridge for iOS",
    "url": "https://github.com/microsoft/WinObjC",
    "summary": "The Windows Bridge for iOS (WinObjC) is a Microsoft open-source project that allows developers to create Universal Windows Platform (UWP) apps from existing Objective-C iOS code. This enables code reuse and integration with Windows 10 features.\n\nTo use WinObjC, you need Windows 10 (build 10586 or higher) and Visual Studio 2017 with specific components selected during installation, including UWP development tools, .NET Mobile Development with Xamarin (due to Nugetizer Bug), and various SDKs and toolsets.\n\nTo import an Xcode project, install Chocolatey (a Windows package manager) and the `winobjc-tools` command-line tool using PowerShell with administrator privileges. Then, navigate to your Xcode project directory in PowerShell and run `vsimporter.exe` to generate a Visual Studio solution.\n\nThe WOCCatalog sample app in the bridge SDK is recommended for learning the bridge's features. Clone the repo, navigate to the WOCCatalog directory, open the solution in Visual Studio, set the WOCCatalog project as the startup project, and run the app.\n\nResources include a wiki, development roadmap, Windows Dev Center website, a quick start challenge, an FAQ, and a samples repo. Contributions are welcome through bug reports, code reviews, pull requests, and participation on Twitter and StackOverflow.\n\nAdvanced installation steps are provided for contributors who wish to build the bridge from source, including the need for Git LFS.\n",
    "chinese_title": "WinObjC – iOS的Windows桥梁",
    "chinese_summary": "The Windows Bridge for iOS (WinObjC) is a Microsoft open-source project that allows developers to create Universal Windows Platform (UWP) apps from existing Objective-C iOS code. This enables code reuse and integration with Windows 10 features.\n\nTo use WinObjC, you need Windows 10 (build 10586 or higher) and Visual Studio 2017 with specific components selected during installation, including UWP development tools, .NET Mobile Development with Xamarin (due to Nugetizer Bug), and various SDKs and toolsets.\n\nTo import an Xcode project, install Chocolatey (a Windows package manager) and the `winobjc-tools` command-line tool using PowerShell with administrator privileges. Then, navigate to your Xcode project directory in PowerShell and run `vsimporter.exe` to generate a Visual Studio solution.\n\nThe WOCCatalog sample app in the bridge SDK is recommended for learning the bridge's features. Clone the repo, navigate to the WOCCatalog directory, open the solution in Visual Studio, set the WOCCatalog project as the startup project, and run the app.\n\nResources include a wiki, development roadmap, Windows Dev Center website, a quick start challenge, an FAQ, and a samples repo. Contributions are welcome through bug reports, code reviews, pull requests, and participation on Twitter and StackOverflow.\n\nAdvanced installation steps are provided for contributors who wish to build the bridge from source, including the need for Git LFS.\n"
  },
  {
    "id": "45845772",
    "title": "Meta projected 10% of 2024 revenue came from scams",
    "url": "https://sherwood.news/tech/meta-projected-10-of-2024-revenue-came-from-scams-and-banned-goods-reuters/",
    "summary": "According to a Reuters report based on internal Meta documents, the company projected that 10% of its 2024 revenue, approximately $16 billion, would come from scam ads and sales of banned goods. These internal documents also revealed that Meta was aware of potential hefty fines for failing to curb this fraudulent activity. The company strategically prioritized enforcement efforts in regions with the strictest penalties, weighing the cost of lost revenue from cracking down on scams against potential regulatory fines.\n\nWhile the documents indicated Meta aimed to reduce fraudulent behavior, cuts to its moderation team resulted in most user-reported violations being ignored or rejected. In response to the report, Meta spokesperson Andy Stone claimed the documents presented a \"selective view\" of internal enforcement and asserted that Meta actively combats fraud and scams. Despite Meta's claims, the report highlights the significant financial benefit the company derives from fraudulent ads and banned goods, raising questions about its commitment to effectively addressing the issue.\n",
    "chinese_title": "Meta预计2024年收入的10%来自诈骗。",
    "chinese_summary": "根据路透社基于Meta内部文件的报道，该公司预计其2024年收入的10%，约160亿美元，将来自诈骗广告和违禁商品销售。这些内部文件还显示，Meta意识到因未能遏制这种欺诈行为而可能面临巨额罚款。该公司策略性地优先在处罚最严厉的地区开展执法工作，权衡打击诈骗带来的收入损失与潜在的监管罚款。\n\n虽然这些文件表明Meta旨在减少欺诈行为，但对其审核团队的削减导致大多数用户举报的违规行为被忽视或驳回。针对该报道，Meta发言人安迪·斯通声称这些文件呈现了内部执法的“选择性视角”，并断言Meta积极打击欺诈和诈骗。尽管Meta提出了上述声明，该报告凸显了该公司从欺诈广告和违禁商品中获得的巨大利益，引发了人们对其有效解决这一问题的承诺的质疑。"
  },
  {
    "id": "45850069",
    "title": "James Watson has died",
    "url": "https://www.nytimes.com/2025/11/07/science/james-watson-dead.html",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "詹姆斯·沃森去世",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "45809746",
    "title": "Shell Grotto: England's mysterious underground seashell chamber",
    "url": "https://boingboing.net/2025/09/05/shell-grotto-englands-mysterious-underground-seashell-chamber.html",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "贝壳岩窟：英格兰神秘的地下贝壳室",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "45840088",
    "title": "You should write an agent",
    "url": "https://fly.io/blog/everyone-write-an-agent/",
    "summary": "生成摘要时出错",
    "chinese_title": "You should write an agent",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45855546",
    "title": "A rats to riches story: Larry the Downing Street cat finds place in TV spotlight",
    "url": "https://www.theguardian.com/politics/2025/nov/08/a-rats-to-riches-story-larry-the-downing-street-cat-finds-place-in-tv-spotlight",
    "summary": "Larry the cat, the Chief Mouser of the Cabinet Office at 10 Downing Street, is the subject of a new Channel 4 documentary celebrating Britain's love of cats. Having resided at No. 10 since 2011, Larry has outlasted five Prime Ministers and become a beloved symbol of stability amid political change.\n\nAdopted from Battersea Dogs & Cats Home to address a rodent problem, Larry has become a fixture at Downing Street, charming world leaders like Barack Obama and Volodymyr Zelenskyy. He's known for his relaxed demeanor in front of cameras, his diplomatic appearances during official visits, and his ability to pose perfectly for photographers.\n\nDespite his popularity, Larry has faced criticism, including accusations of being lazy and overfed. However, sources close to Larry maintain that he is not publicly funded, with Downing Street staff covering his costs.\n\nHis daily routine includes greeting guests, inspecting security, napping on antique furniture, and contemplating mouse control. While he's had rivals, like Palmerston from the Foreign Office, Larry's enduring appeal is undeniable, evidenced by a large social media following and fan mail from around the world. His presence at No. 10 provides continuity, nonpartisan appeal, and a touch of levity in the world of British politics.\n",
    "chinese_title": "A rats to riches story: Larry the Downing Street cat finds place in TV spotlight",
    "chinese_summary": "住在唐宁街10号的内阁办公厅首席捕鼠官，猫咪拉里，是第四频道一部新纪录片的主题，该片旨在庆祝英国人对猫的喜爱。自2011年入住唐宁街10号以来，拉里已经经历了五位首相，并成为政治变革中备受欢迎的稳定象征。\n\n拉里从巴特西猫狗之家被领养来解决鼠患问题，如今已成为唐宁街的常客，以其魅力征服了巴拉克·奥巴马和弗拉基米尔·泽连斯基等世界领导人。他以在镜头前的放松姿态、在正式访问期间的外交亮相以及完美地为摄影师摆姿势的能力而闻名。\n\n尽管拉里很受欢迎，但他还是面临批评，包括被指责懒惰和过度喂养。然而，与拉里关系密切的消息人士坚称，他没有接受公共资金，唐宁街的工作人员承担了他的费用。\n\n他的日常包括迎接客人、检查安保、在古董家具上小憩以及思考如何控制老鼠。虽然他有过竞争对手，比如来自外交部的帕默斯顿，但拉里持久的魅力是不可否认的，这体现在庞大的社交媒体粉丝群和来自世界各地的粉丝来信中。他在唐宁街10号的存在为英国政坛提供了连续性、无党派吸引力以及一丝轻松。"
  },
  {
    "id": "45851786",
    "title": "Using the Web Monetization API for fun and profit",
    "url": "https://blog.tomayac.com/2025/11/07/using-the-web-monetization-api-for-fun-and-profit/",
    "summary": "This article discusses Web Monetization, a proposed standard that allows publishers to earn revenue directly from users in a pay-as-you-browse model. The author, who recently spoke at JSConf Mexico and interacted with the Interledger Foundation, encourages readers to try Web Monetization for themselves.\n\nTo get started, users need to install a Web Monetization extension, obtain a wallet (like GateHub, which supports EUR and USD), and connect the wallet to the extension. The transactions use fiat currency, despite the wallets often being used for crypto. When visiting a monetized site, the extension displays a green checkmark. Users can adjust the hourly payment rate and send one-time payments, with money streamed every minute.\n\nPublishers can implement Web Monetization by adding a payment link with their personalized payment pointer (obtained from their wallet) to their website's code. This allows them to receive streamed and one-time payments.\n\nThe JavaScript API allows for dynamic content adjustments based on monetization events. Publishers can detect when a user is paying and, for example, remove ads, unlock content, or display thank you messages.\n\nThe author is optimistic about Web Monetization's potential to create a financially sustainable future for web publishers of all sizes. They encourage others to try it and share their experiences.\n",
    "chinese_title": "使用Web Monetization API进行娱乐和盈利",
    "chinese_summary": "本文探讨了Web Monetization，一项允许发布者通过“按浏览付费”模式直接从用户处获得收入的拟议标准。作者最近在JSConf Mexico上发表了演讲，并与Interledger Foundation进行了互动，他鼓励读者亲自尝试Web Monetization。\n\n要开始使用，用户需要安装Web Monetization扩展程序，获取一个钱包（如支持欧元和美元的GateHub），并将钱包连接到扩展程序。 尽管这些钱包通常用于加密货币，但交易使用法定货币。 访问已货币化的网站时，扩展程序会显示一个绿色复选标记。 用户可以调整每小时的付款费率并发送一次性付款，资金每分钟都会进行流式传输。\n\n发布者可以通过将包含其个性化付款指针（从其钱包获得）的付款链接添加到其网站代码中来实现Web Monetization。 这使他们能够接收流式传输和一次性付款。\n\nJavaScript API允许基于货币化事件进行动态内容调整。 发布者可以检测到用户何时在付款，例如，删除广告、解锁内容或显示感谢消息。\n\n作者对Web Monetization在为各种规模的网络发布者创造财务可持续的未来方面的潜力持乐观态度。 他鼓励其他人尝试它并分享他们的经验。"
  },
  {
    "id": "45856883",
    "title": "Why Sam Altman Won't Be on the Hook for OpenAI's Spending Spree",
    "url": "https://www.forbes.com/sites/rashishrivastava/2025/11/07/why-sam-altman-wont-be-on-the-hook-for-openais-massive-spending-spree/",
    "summary": "This InnovationDaily article examines the implications of OpenAI's massive $1.4 trillion commitment to datacenter deals with tech giants, questioning how the company, with projected $20 billion annual revenue, can possibly afford it. While CFO Sarah Friar initially hinted at government support, Altman clarified that the market, not the government, would handle any failures.\n\nAnalysts estimate OpenAI would need a 2900% revenue jump by 2029 to meet its obligations. However, scenarios like renegotiated contracts, usage-based billing, and potential supplier delays offer OpenAI escape routes. The contracts often have \"capital I ifs.\" A key point is that CEO Sam Altman seemingly bears no personal financial risk, as he claims to have no stake in the company, even after restructuring. Experts criticize this lack of accountability, arguing he benefits from the upside without the downside.\n\nThe article explores potential outcomes, including increased fundraising, an IPO for easier debt raising, or even a fire sale acquisition by a company like Microsoft or Oracle in a bankruptcy scenario. In case of bankruptcy, debtholders like JPMorgan and other banks would be paid first, followed by equity investors, with Microsoft (owning 27%) likely prioritized. Common shareholders, including employees and the nonprofit, would be last in line.\n\nDespite the potential financial strain, Altman prioritizes securing ample compute power, viewing it as crucial for AI development and revenue growth. Ultimately, the article suggests that Altman's audacious spending spree is a calculated gamble, relying on exponential revenue growth, renegotiations, or even bailouts from partners who benefit from their association with OpenAI.\n",
    "chinese_title": "为什么山姆·奥特曼不会为OpenAI的消费狂潮负责",
    "chinese_summary": "OpenAI豪掷1.4万亿美元豪赌数据中心，谁来买单？"
  },
  {
    "id": "45836070",
    "title": "Kimi K2 Thinking, a SOTA open-source trillion-parameter reasoning model",
    "url": "https://moonshotai.github.io/Kimi-K2/thinking.html",
    "summary": "The article introduces Kimi K2 Thinking, positioned as a state-of-the-art (SOTA) open-source reasoning model with a trillion parameters. While the title implies significant advancements in reasoning capabilities, the short content provides minimal detail. The core takeaway is the model's name and purported scale, suggesting its ambition to compete with other large language models in the realm of reasoning tasks. Without further information within the provided content, it's impossible to delve deeper into its architecture, training data, specific reasoning strengths, or benchmarking results. However, the claim of being a \"trillion-parameter\" model immediately places it among the largest and most complex open-source language models available.\n",
    "chinese_title": "Kimi K2 思考，一个 SOTA 开源万亿参数推理模型",
    "chinese_summary": "Kimi K2 Thinking：参数达万亿的最先进开源推理模型"
  },
  {
    "id": "45856817",
    "title": "Washington Post among breach victims in Oracle EBS zero-day attacks",
    "url": "https://www.scworld.com/news/washington-post-latest-victim-of-oracle-ebs-zero-day-attacks",
    "summary": "The Washington Post was among the victims of recent attacks exploiting a zero-day vulnerability in Oracle E-Business Suite (EBS). Cybersecurity firm Onapsis disclosed that a sophisticated threat actor, likely financially motivated, has been actively targeting organizations using outdated and unpatched Oracle EBS systems to gain unauthorized access, steal sensitive data, and potentially disrupt operations. The vulnerability, identified as impacting several Oracle EBS versions, allowed attackers to bypass authentication and execute arbitrary code.\n\nThe attackers are believed to have been exploiting the flaw for at least two years prior to the public disclosure, indicating a prolonged period of undetected activity. The attacks are characterized by their precision and sophistication, suggesting the threat actor possesses significant knowledge of Oracle EBS architecture. Onapsis noted that the attacks involved deploying webshells to maintain persistent access to compromised systems.\n\nWhile Oracle had released patches for the vulnerability, many organizations, including The Washington Post, were apparently slow to apply them, leaving them exposed. The incident underscores the critical importance of timely patching and proactive security measures for enterprise resource planning (ERP) systems like Oracle EBS, which often hold highly sensitive business data. The article emphasizes the need for organizations to prioritize security updates and regularly monitor their systems for signs of compromise to mitigate the risk of such attacks.\n",
    "chinese_title": "华盛顿邮报成为Oracle EBS零日攻击的受害者之一",
    "chinese_summary": "《华盛顿邮报》成为利用Oracle电子商务套件(EBS)零日漏洞攻击的受害者之一。网络安全公司Onapsis披露，一个老练的威胁行为者（可能出于经济动机）一直在积极攻击使用过时且未打补丁的Oracle EBS系统，以获取未经授权的访问权限、窃取敏感数据并可能中断运营。该漏洞被确定影响多个Oracle EBS版本，允许攻击者绕过身份验证并执行任意代码。\n\n据信，攻击者在公开披露前至少两年就开始利用该漏洞，表明存在一段长时间的未被发现的活动。这些攻击的特点是精确性和复杂性，表明威胁行为者对Oracle EBS架构有深入的了解。Onapsis指出，这些攻击涉及部署webshell以维持对受损系统的持久访问。\n\n虽然Oracle已经发布了该漏洞的补丁，但包括《华盛顿邮报》在内的许多组织显然未能及时应用这些补丁，使其暴露在外。该事件突显了及时打补丁和主动安全措施对于像Oracle EBS这样的企业资源规划(ERP)系统至关重要，这些系统通常包含高度敏感的业务数据。这篇文章强调，各组织需要优先考虑安全更新，并定期监控其系统是否存在被入侵的迹象，以降低此类攻击的风险。"
  },
  {
    "id": "45852011",
    "title": "He Jiankui PhD Thesis: Spontaneous Emergence of Hierarchy in Biological Systems (2010)",
    "url": "https://repository.rice.edu/server/api/core/bitstreams/85449216-b2ec-4519-87cf-83eafe4534e7/content",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "贺建奎博士论文：生物系统中等级结构的自发涌现 (2010)",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "45855955",
    "title": "Copy button added to Stack Overflow",
    "url": "https://meta.stackexchange.com/questions/414573/results-of-the-october-2025-community-asks-sprint-copy-button-for-code-blocks",
    "summary": "生成摘要时出错",
    "chinese_title": "Copy button added to Stack Overflow",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45789143",
    "title": "Comparison Traits – Understanding Equality and Ordering in Rust",
    "url": "https://itsfoxstudio.substack.com/p/comparison-traits-understanding-equality",
    "summary": "生成摘要时出错",
    "chinese_title": "Comparison Traits – Understanding Equality and Ordering in Rust",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45856723",
    "title": "Growing rice in the UK 'not so crazy' as climate warms",
    "url": "https://www.purdueexponent.org/news/national/growing-rice-in-the-uk-not-so-crazy-as-climate-warms/article_bb71319a-4f91-5f03-90b0-249d497ecc34.html",
    "summary": "生成摘要时出错",
    "chinese_title": "Growing rice in the UK 'not so crazy' as climate warms",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45846090",
    "title": "OpenMW 0.50.0 Released – open-source Morrowind reimplementation",
    "url": "https://openmw.org/2025/openmw-0-50-0-released/",
    "summary": "生成摘要时出错",
    "chinese_title": "OpenMW 0.50.0 Released – open-source Morrowind reimplementation",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45839901",
    "title": "Two billion email addresses were exposed",
    "url": "https://www.troyhunt.com/2-billion-email-addresses-were-exposed-and-we-indexed-them-all-in-have-i-been-pwned/",
    "summary": "生成摘要时出错",
    "chinese_title": "Two billion email addresses were exposed",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45852275",
    "title": "FAA to restrict commercial rocket launches to overnight hours",
    "url": "https://www.space.com/space-exploration/launches-spacecraft/faa-restricts-commercial-rocket-launches-indefinitely-due-to-air-traffic-risks-from-government-shutdown",
    "summary": "生成摘要时出错",
    "chinese_title": "FAA to restrict commercial rocket launches to overnight hours",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45845958",
    "title": "We chose OCaml to write Stategraph",
    "url": "https://stategraph.dev/blog/why-we-chose-ocaml",
    "summary": "生成摘要时出错",
    "chinese_title": "We chose OCaml to write Stategraph",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45855369",
    "title": "Make yourself a Voxel Engine THIS weekend",
    "url": "https://daymare.net/blogs/voxel-engine-in-a-weekend/",
    "summary": "生成摘要时出错",
    "chinese_title": "Make yourself a Voxel Engine THIS weekend",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45793783",
    "title": "Skeena Indigenous Typeface",
    "url": "https://microsoft.github.io/Skeena-Indigenous-Typeface/",
    "summary": "生成摘要时出错",
    "chinese_title": "Skeena Indigenous Typeface",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45852642",
    "title": "Analysis of Hedy Lamarr's Contribution to Spread-Spectrum Communication",
    "url": "https://researchers.one/articles/24.01.00001v4",
    "summary": "生成摘要时出错",
    "chinese_title": "Analysis of Hedy Lamarr's Contribution to Spread-Spectrum Communication",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45845800",
    "title": "From Memorization to Reasoning in the Spectrum of Loss Curvature",
    "url": "https://arxiv.org/abs/2510.24256",
    "summary": "生成摘要时出错",
    "chinese_title": "From Memorization to Reasoning in the Spectrum of Loss Curvature",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45848504",
    "title": "Gmail AI gets more intrusive",
    "url": "https://daveverse.org/2025/11/07/gmail-ai-gets-even-more-intrusive/",
    "summary": "生成摘要时出错",
    "chinese_title": "Gmail AI gets more intrusive",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45846489",
    "title": "\"Green Llama\" did not just beat Cascade Platinum Plus",
    "url": "https://foxchapelresearch.substack.com/p/draft-no-green-llama-did-not-just",
    "summary": "生成摘要时出错",
    "chinese_title": "\"Green Llama\" did not just beat Cascade Platinum Plus",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45853995",
    "title": "Oddest ChatGPT leaks yet: Cringey chat logs found in Google Analytics tool",
    "url": "https://arstechnica.com/tech-policy/2025/11/oddest-chatgpt-leaks-yet-cringey-chat-logs-found-in-google-analytics-tool/",
    "summary": "生成摘要时出错",
    "chinese_title": "Oddest ChatGPT leaks yet: Cringey chat logs found in Google Analytics tool",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45852257",
    "title": "Mind captioning: Evolving descriptive text of mental content of brain activity",
    "url": "https://www.science.org/doi/10.1126/sciadv.adw1464",
    "summary": "生成摘要时出错",
    "chinese_title": "Mind captioning: Evolving descriptive text of mental content of brain activity",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45856681",
    "title": "'Black Hole Sun' by Soundgarden",
    "url": "https://faroutmagazine.co.uk/the-story-behind-soundgarden-black-hole-sun/",
    "summary": "生成摘要时出错",
    "chinese_title": "'Black Hole Sun' by Soundgarden",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45854892",
    "title": "Google Threat Intel Group AI Threat Tracker:Advances in Threat Actor AI Tool Use",
    "url": "https://cloud.google.com/blog/topics/threat-intelligence/threat-actor-usage-of-ai-tools",
    "summary": "生成摘要时出错",
    "chinese_title": "Google Threat Intel Group AI Threat Tracker:Advances in Threat Actor AI Tool Use",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45851335",
    "title": "As CO2 Levels Rise, Old Amazon Trees Are Getting Bigger",
    "url": "https://eos.org/articles/as-co2-levels-rise-old-amazon-trees-are-getting-bigger",
    "summary": "生成摘要时出错",
    "chinese_title": "As CO2 Levels Rise, Old Amazon Trees Are Getting Bigger",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45825733",
    "title": "Show HN: I scraped 3B Goodreads reviews to train a better recommendation model",
    "url": "https://book.sv",
    "summary": "生成摘要时出错",
    "chinese_title": "Show HN: I scraped 3B Goodreads reviews to train a better recommendation model",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45854307",
    "title": "Multi-objective optimization by quantum annealing",
    "url": "https://arxiv.org/abs/2511.01762",
    "summary": "生成摘要时出错",
    "chinese_title": "Multi-objective optimization by quantum annealing",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45788194",
    "title": "Helion: A high-level DSL for performant and portable ML kernels",
    "url": "https://pytorch.org/blog/helion/",
    "summary": "生成摘要时出错",
    "chinese_title": "Helion: A high-level DSL for performant and portable ML kernels",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45841262",
    "title": "Game design is simple",
    "url": "https://www.raphkoster.com/2025/11/03/game-design-is-simple-actually/",
    "summary": "生成摘要时出错",
    "chinese_title": "Game design is simple",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45838564",
    "title": "LLMs encode how difficult problems are",
    "url": "https://arxiv.org/abs/2510.18147",
    "summary": "生成摘要时出错",
    "chinese_title": "LLMs encode how difficult problems are",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45850125",
    "title": "Show HN: Three Emojis, a daily word puzzle for language learners",
    "url": "https://threeemojis.com/en-US/play/hex/en-US/2025-11-07",
    "summary": "生成摘要时出错",
    "chinese_title": "Show HN: Three Emojis, a daily word puzzle for language learners",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45787714",
    "title": "Hashtable vs. A-list in Scheme, which to choose?",
    "url": "https://nalaginrut.com/archives/2025/11/02/hashtable_vs_alist",
    "summary": "生成摘要时出错",
    "chinese_title": "Hashtable vs. A-list in Scheme, which to choose?",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45802449",
    "title": "Blood, Brick and Legend: The Chemistry of Dracula's Castle",
    "url": "https://news.research.gatech.edu/2025/10/31/blood-brick-and-legend-chemistry-draculas-castle",
    "summary": "生成摘要时出错",
    "chinese_title": "Blood, Brick and Legend: The Chemistry of Dracula's Castle",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45799109",
    "title": "Cryptography 101 with Alfred Menezes",
    "url": "https://cryptography101.ca",
    "summary": "生成摘要时出错",
    "chinese_title": "Cryptography 101 with Alfred Menezes",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45847221",
    "title": "Inside Cursor",
    "url": "https://joincolossus.com/article/inside-cursor/",
    "summary": "生成摘要时出错",
    "chinese_title": "Inside Cursor",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45781965",
    "title": "The Silent Scientist: When Software Research Fails to Reach Its Audience",
    "url": "https://cacm.acm.org/opinion/the-silent-scientist-when-software-research-fails-to-reach-its-audience/",
    "summary": "生成摘要时出错",
    "chinese_title": "The Silent Scientist: When Software Research Fails to Reach Its Audience",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45848341",
    "title": "Toxic Salton Sea dust triggers changes in lung microbiome after just one week",
    "url": "https://phys.org/news/2025-10-toxic-salton-sea-triggers-lung.html",
    "summary": "生成摘要时出错",
    "chinese_title": "Toxic Salton Sea dust triggers changes in lung microbiome after just one week",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45830829",
    "title": "Ratatui – App Showcase",
    "url": "https://ratatui.rs/showcase/apps/",
    "summary": "生成摘要时出错",
    "chinese_title": "Ratatui – App Showcase",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45843220",
    "title": "Dead Framework Theory",
    "url": "https://aifoc.us/dead-framework-theory/",
    "summary": "生成摘要时出错",
    "chinese_title": "Dead Framework Theory",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45827190",
    "title": "Solarpunk is happening in Africa",
    "url": "https://climatedrift.substack.com/p/why-solarpunk-is-already-happening",
    "summary": "生成摘要时出错",
    "chinese_title": "Solarpunk is happening in Africa",
    "chinese_summary": "生成摘要时出错"
  }
]