[
  {
    "id": "45104303",
    "title": "Static sites enable a good time travel experience",
    "url": "https://hamatti.org/posts/static-sites-enable-a-good-time-travel-experience/",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "静态网站提供良好的时间旅行体验。",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "45104907",
    "title": "Anthropic raises $13B Series F at $183B post-money valuation",
    "url": "https://www.anthropic.com/news/anthropic-raises-series-f-at-usd183b-post-money-valuation",
    "summary": "Anthropic has secured a $13 billion Series F funding round, valuing the company at $183 billion post-money. The round was led by ICONIQ, with co-leads Fidelity Management & Research Company and Lightspeed Venture Partners. The investment reflects confidence in Anthropic's position as a leading AI platform.\n\nSignificant investors include Altimeter, Baillie Gifford, affiliated funds of BlackRock, Blackstone, Coatue, D1 Capital Partners, General Atlantic, General Catalyst, GIC, Growth Equity at Goldman Sachs Alternatives, Insight Partners, Jane Street, Ontario Teachers' Pension Plan, Qatar Investment Authority, TPG, T. Rowe Price Associates, Inc., T. Rowe Price Investment Management, Inc., WCM Investment Management, and XN.\n\nAnthropic has experienced rapid growth since the launch of Claude in March 2023. Run-rate revenue reached $1 billion by the beginning of 2025 and surged to over $5 billion by August 2025. The company serves over 300,000 business customers, with a significant increase in large accounts (>$100,000 run-rate revenue).\n\nGrowth spans Anthropic's platform, including API and industry-specific products for businesses, Claude Code for developers (generating over $500 million in run-rate revenue), and Pro/Max plans for individual users. The Series F investment will expand capacity, deepen safety research, and support international expansion.\n",
    "chinese_title": "Anthropic 完成 130 亿美元 F 轮融资，投后估值达 1830 亿美元",
    "chinese_summary": "Anthropic 获得 130 亿美元 F 轮融资，投后估值达 1830 亿美元。本轮融资由 ICONIQ 领投，富达管理研究公司和光速创投共同领投。该投资反映了对 Anthropic 作为领先 AI 平台地位的信心。\n\n重要投资者包括 Altimeter、Baillie Gifford、BlackRock 关联基金、Blackstone、Coatue、D1 Capital Partners、General Atlantic、General Catalyst、GIC、高盛另类投资的成长股权部门、Insight Partners、Jane Street、安大略教师退休金计划、卡塔尔投资局、TPG、普信集团、普信投资管理公司、WCM Investment Management 和 XN。\n\n自 2023 年 3 月推出 Claude 以来，Anthropic 经历了快速增长。到 2025 年初，年化收入达到 10 亿美元，到 2025 年 8 月飙升至超过 50 亿美元。该公司为超过 30 万家企业客户提供服务，大型客户（> 10 万美元年化收入）显著增加。\n\n增长涵盖 Anthropic 的平台，包括面向企业的 API 和行业特定产品、面向开发者的 Claude Code（产生超过 5 亿美元的年化收入）以及面向个人用户的 Pro/Max 计划。F 轮融资将扩大产能，深化安全研究，并支持国际扩张。"
  },
  {
    "id": "45103436",
    "title": "The Little Book of Linear Algebra",
    "url": "https://github.com/the-litte-book-of/linear-algebra",
    "summary": "\"The Little Book of Linear Algebra\" is a beginner-friendly introduction to the core concepts of linear algebra. It begins by defining scalars and vectors, emphasizing their role as fundamental building blocks. Vectors are presented as ordered collections of scalars, visualized geometrically as points, displacements, or abstract elements in n-dimensional space.\n\nThe book then introduces vector addition and scalar multiplication, defining these operations and illustrating their geometric interpretations (parallelogram rule, scaling). Linear combinations are presented as a mechanism to generate new vectors, leading to the concept of a subspace.\n\nThe dot product is introduced as a way to link algebra and geometry, allowing for the calculation of lengths (norms), angles, and orthogonality. Orthogonality is further explored, defining orthogonal sets and orthonormal sets, and introducing the concept of projecting one vector onto another.\n\nFinally, the initial section concludes by introducing the idea of matrix as central objects. Matrices are defined formally using example notation.\n\nThe book highlights the importance of these foundational concepts for understanding vector spaces, linear transformations, and solving systems of equations, foreshadowing their application in fields like data science, physics, and machine learning. Each section includes exercises to reinforce understanding.\n",
    "chinese_title": "线性代数小书",
    "chinese_summary": "《线性代数小书》是一本面向初学者的线性代数核心概念入门读物。它首先定义标量和向量，强调它们作为基本构建块的作用。向量被表示为标量的有序集合，并在几何上可视化为n维空间中的点、位移或抽象元素。\n\n本书随后介绍了向量加法和标量乘法，定义了这些运算并阐述了它们的几何解释（平行四边形法则、缩放）。线性组合被呈现为生成新向量的机制，从而引出子空间的概念。\n\n点积被引入作为连接代数和几何的一种方式，允许计算长度（范数）、角度和正交性。正交性被进一步探索，定义了正交集和标准正交集，并介绍了将一个向量投影到另一个向量上的概念。\n\n最后，初始部分通过介绍矩阵作为中心对象的概念来结束。矩阵使用示例符号进行正式定义。\n\n本书强调了这些基本概念对于理解向量空间、线性变换和求解方程组的重要性，预示着它们在数据科学、物理学和机器学习等领域的应用。每个部分都包含练习以巩固理解。"
  },
  {
    "id": "45102664",
    "title": "Show HN: Moribito – A TUI for LDAP Viewing/Queries",
    "url": "https://github.com/ericschmar/moribito",
    "summary": "Moribito is a terminal-based (TUI) LDAP server explorer built with Go and BubbleTea, designed for interactively browsing, viewing, and querying LDAP directories. It features interactive tree navigation, a detailed record viewer with clipboard integration, a custom query interface with real-time results and pagination, flexible configuration, secure authentication with SSL/TLS, and automatic update notifications.\n\nInstallation is available via Homebrew (macOS/Linux), direct binary download with installation scripts (Linux, macOS, Windows), or building from source. Command-line options and configuration files allow for customization of connection details, pagination, and retry behavior. Configuration files are automatically located in OS-specific locations, and can be created manually or via command.\n\nNavigation is keyboard and mouse driven, allowing users to switch between tree, record, and query views. The query view includes features for formatting complex queries for readability and automatic pagination for handling large result sets efficiently. It supports various authentication methods (Simple Bind, OU-based, Active Directory, Anonymous Bind) and security options (SSL/LDAPS, StartTLS).\n\nThe project uses Semantic Versioning and provides comprehensive documentation generated by DocPress. Contributions are welcome via fork and pull request. It includes a Homebrew formula for easy installation and is licensed under the MIT License.\n",
    "chinese_title": "Show HN: Moribito – 用于 LDAP 查看/查询的 TUI 工具",
    "chinese_summary": "Moribito 是一款基于终端 (TUI) 的 LDAP 服务器浏览器，使用 Go 和 BubbleTea 构建，旨在交互式浏览、查看和查询 LDAP 目录。它具有交互式树状导航、带有剪贴板集成的详细记录查看器、带有实时结果和分页的自定义查询界面、灵活的配置、使用 SSL/TLS 的安全身份验证以及自动更新通知。\n\n可通过 Homebrew (macOS/Linux)、带有安装脚本的直接二进制下载 (Linux, macOS, Windows) 或从源代码构建进行安装。 命令行选项和配置文件允许自定义连接详细信息、分页和重试行为。 配置文件会自动定位在特定于操作系统的位置，并且可以手动或通过命令创建。\n\n导航由键盘和鼠标驱动，允许用户在树、记录和查询视图之间切换。 查询视图包括用于格式化复杂查询以提高可读性和自动分页以有效处理大型结果集的功能。 它支持各种身份验证方法（简单绑定、基于 OU 的绑定、Active Directory、匿名绑定）和安全选项（SSL/LDAPS、StartTLS）。\n\n该项目使用语义化版本控制并提供由 DocPress 生成的完整文档。 欢迎通过 fork 和 pull request 贡献。 它包含一个 Homebrew 公式，便于安装，并根据 MIT 许可证获得许可。"
  },
  {
    "id": "45103857",
    "title": "Removing Guix from Debian",
    "url": "https://lwn.net/SubscriberLink/1035491/d8100135a8ae4246/",
    "summary": "This LWN.net article discusses the impending removal of the Guix package manager from Debian stable and oldstable releases (Debian 13 \"trixie\" and Debian 12 \"bookworm\"). Security vulnerabilities in the `guix-daemon` were disclosed in June 2025, but the Guix project's rolling-release model and lack of stable branches made backporting fixes difficult for the Debian package maintainer, Vagrant Cascadian. The fixes were intertwined with other upstream changes, making backporting a significant challenge.\n\nCascadian ultimately filed bug reports to remove Guix from Debian 11 (\"bullseye\"), bookworm, and trixie. While removal from bullseye is impossible due to its LTS status, Guix is likely to be removed from point releases of trixie and bookworm. Users who already have Guix installed will be stuck with the old, vulnerable version unless they manually update.\n\nThe article highlights the challenges of maintaining a rolling-release package like Guix in a stable distribution like Debian. Cascadian notes the significant effort required to maintain Guix on Debian, including managing Guile dependencies and dealing with differing GCC versions. Despite the removal, Guix's inclusion in Debian has been beneficial, as it has helped uncover and fix bugs.\n\nThe Guix project has adopted a yearly release cycle, but this doesn't address the need for stable branches for distributions. Debian users can still use Guix via upstream binaries, but this may exclude some architectures. The article concludes by noting that the removal is unusual for stable releases, affecting a relatively small number of users (estimated at around 230 based on popcon statistics).\n",
    "chinese_title": "从Debian移除Guix",
    "chinese_summary": "LWN.net文章讨论了即将从 Debian 稳定版和旧稳定版（Debian 13 “trixie” 和 Debian 12 “bookworm”）中移除 Guix 包管理器。Guix 项目的 `guix-daemon` 在 2025 年 6 月披露了安全漏洞，但 Guix 项目的滚动发布模式和缺乏稳定分支使得 Debian 包维护者 Vagrant Cascadian 难以进行补丁回溯。这些修复与其他上游更改交织在一起，使得回溯成为一项重大挑战。\n\nCascadian 最终提交了错误报告，要求从 Debian 11 (“bullseye”)、bookworm 和 trixie 中移除 Guix。虽然由于 bullseye 的 LTS 状态，移除是不可能的，但 Guix 很可能会从 trixie 和 bookworm 的小版本更新中移除。已经安装了 Guix 的用户将只能使用旧的、易受攻击的版本，除非他们手动更新。\n\n这篇文章强调了在像 Debian 这样的稳定发行版中维护像 Guix 这样的滚动发布包所面临的挑战。Cascadian 指出，在 Debian 上维护 Guix 需要付出巨大的努力，包括管理 Guile 依赖和处理不同的 GCC 版本。尽管被移除，Guix 包含在 Debian 中仍然是有益的，因为它帮助发现并修复了错误。\n\nGuix 项目已经采用了年度发布周期，但这并没有解决发行版对稳定分支的需求。Debian 用户仍然可以通过上游二进制文件使用 Guix，但这可能会排除某些架构。文章最后指出，移除对于稳定版本来说是不寻常的，影响的用户数量相对较少（根据 popcon 统计数据估计约为 230 人）。"
  },
  {
    "id": "45103065",
    "title": "Passkeys and Modern Authentication",
    "url": "https://lucumr.pocoo.org/2025/9/2/passkeys/",
    "summary": "Armin Ronacher's blog post discusses the shift towards passkeys and modern authentication, highlighting potential drawbacks alongside the benefits. While passkeys aim to improve security for the average consumer, Ronacher raises concerns about the underlying standards and their potential for misuse.\n\nHe criticizes the attestation system, which allows websites to gather information about the authenticator, potentially leading to vendor lock-in, citing the Austrian government's requirement for whitelisted hardware tokens for accessing eID services as an example. He also worries about the lack of private key export between password managers, creating \"auth lock-in\" and making it difficult to switch ecosystems.\n\nRonacher also points out the issue of \"sneaky onboarding,\" where users are automatically enrolled in passkeys without clear notification, exemplified by Amazon's implementation. He further expresses concern about the increasing reliance on tech giants like Google, which can terminate accounts and revoke access to credentials on third-party websites without recourse. He argues this can be particularly problematic for families in cases of incapacitation or death.\n\nFinally, he notes that the increasing complexity of authentication schemes, such as OAuth and passkeys, makes it harder for individuals and open-source projects to build basic things from scratch, potentially leading to a loss of individual agency. While he acknowledges the potential benefits of passkeys, he concludes with a call for reflection on whether this is truly the desired path, given the increased reliance on complex systems controlled by large corporations and the potential for data loss and restricted access.\n",
    "chinese_title": "通行密钥与现代认证",
    "chinese_summary": "Armin Ronacher的博客文章探讨了向通行密钥和现代身份验证的转变，在强调其优点的同时也指出了潜在的缺点。虽然通行密钥旨在提高普通消费者的安全性，但Ronacher对底层标准及其潜在的滥用提出了担忧。\n\n他批评了证明系统，该系统允许网站收集有关验证器的信息，可能导致供应商锁定，并以奥地利政府要求使用白名单硬件令牌访问eID服务为例。他还担心密码管理器之间缺乏私钥导出，这会造成“身份验证锁定”，并使切换生态系统变得困难。\n\nRonacher还指出了“偷偷摸摸的入门”问题，即用户在没有明确通知的情况下自动注册通行密钥，亚马逊的实施就是一个例子。他进一步表达了对日益依赖谷歌等科技巨头的担忧，这些公司可以终止账户并撤销对第三方网站凭据的访问权限，且无法追索。他认为，这在家庭中，尤其是在丧失行为能力或死亡的情况下，可能会特别麻烦。\n\n最后，他指出，OAuth和通行密钥等身份验证方案日益复杂，使得个人和开源项目更难从头开始构建基本内容，从而可能导致个人能动性的丧失。虽然他承认通行密钥的潜在好处，但他在文章结尾呼吁人们反思，鉴于日益依赖大型公司控制的复杂系统以及数据丢失和访问受限的可能性，这是否真的是我们想要的发展方向。"
  },
  {
    "id": "45104597",
    "title": "X(Twitter) Shadow Bans Turkish Presidential Candidate",
    "url": "https://utkusen.substack.com/p/xtwitter-secretly-shadow-bans-turkish",
    "summary": "The article by Utku Sen alleges that X (formerly Twitter) secretly shadow banned Turkish presidential candidate Kemal Kılıçdaroğlu in the lead-up to the critical 2023 elections. The author presents data and analysis suggesting significant suppression of Kılıçdaroğlu's tweets and account visibility.\n\nThe core argument is that Kılıçdaroğlu's reach and engagement were artificially limited through unacknowledged algorithmic manipulation. Sen highlights observed discrepancies between the candidate's follower count and the actual visibility of his posts, particularly the lack of organic engagement (likes, retweets, replies) on tweets that should have generated significant traction given his follower base.\n\nSen claims that this constituted a form of political censorship, subtly impacting the information environment during a crucial election period. The article details how the shadow banning was allegedly implemented through manipulation of X's recommendation algorithms, reducing the likelihood of Kılıçdaroğlu's tweets appearing in users' timelines and search results.\n\nThe author emphasizes the lack of transparency from X regarding its content moderation policies and algorithmic practices in Turkey, raising concerns about potential bias and interference in democratic processes. The article implies that X's actions may have influenced public opinion and potentially impacted the election's outcome, calling for greater scrutiny of social media platforms' role in shaping political discourse, especially during elections. The article stops short of accusing X of direct intentional manipulation but highlights the strong correlations indicating a possible intervention.\n",
    "chinese_title": "X（推特）暗中封禁土耳其总统候选人",
    "chinese_summary": "乌特库·森的文章声称，X（前身为Twitter）在关键的2023年土耳其总统选举前夕，秘密对土耳其总统候选人凯末尔·基利奇达罗格鲁进行了屏蔽。作者提出了数据和分析，表明基利奇达罗格鲁的推文和账户可见度受到了显著压制。\n\n核心论点是，基利奇达罗格鲁的影响力和参与度通过未经承认的算法操纵被人为地限制了。森强调了候选人的粉丝数量与他的帖子实际可见度之间的观察到的差异，特别是鉴于他的粉丝基础，本应产生重大影响的推文缺乏自然互动（点赞、转发、回复）。\n\n森声称，这构成了一种政治审查形式，微妙地影响了关键选举期间的信息环境。文章详细介绍了据称如何通过操纵X的推荐算法来实施屏蔽，从而降低了基利奇达罗格鲁的推文出现在用户时间线和搜索结果中的可能性。\n\n作者强调X在土耳其的内容审核政策和算法实践方面缺乏透明度，引发了人们对潜在偏见和干预民主进程的担忧。文章暗示X的行为可能影响了公众舆论，并可能影响了选举结果，呼吁加强对社交媒体平台在塑造政治话语，特别是在选举期间的作用的审查。文章没有直接指责X进行有意的操纵，但强调了表明可能存在干预的强烈关联性。"
  },
  {
    "id": "45100499",
    "title": "Run Erlang/Elixir on Microcontrollers and Embedded Linux",
    "url": "https://www.grisp.org/software",
    "summary": "GRiSP provides open-source tools for running Erlang/Elixir on microcontrollers and embedded Linux, enabling real-time performance and reducing complexity for embedded applications. It offers three main stacks:\n\n*   **GRiSP Metal (formerly GRiSP):** Boots directly into the Erlang/Elixir VM on RTEMS for deterministic, real-time behavior on microcontrollers with minimal resource usage (fitting in 16MB of RAM). It offers direct hardware access and supervision trees for reliability.\n*   **GRiSP Alloy:** Boots into the Erlang/Elixir VM on a lean, Buildroot-based real-time Linux. Supports multiple VMs with priority separation and core affinity, connected via secure distributed Erlang links.\n*   **GRiSP Forge:** Similar to Alloy but uses Yocto, providing customizable Linux stacks and BSP integration for long-term, enterprise deployments.\n\nAll three stacks utilize efficient and secure local links via distributed Erlang and prioritize fast boot times and a small attack surface.\n\n**GRiSP-io** is a cloud and edge platform for remotely deploying, monitoring, and managing distributed embedded systems built using GRiSP stacks. It facilitates over-the-air updates, real-time system insights, and cloud/edge workflow integration.\n\nIn essence, GRiSP offers a scalable ecosystem, from prototyping to production, enabling robust, distributed applications optimized for embedded environments such as automation, robotics, and connected devices.\n",
    "chinese_title": "在微控制器和嵌入式 Linux 上运行 Erlang/Elixir",
    "chinese_summary": "GRiSP 提供开源工具，用于在微控制器和嵌入式 Linux 上运行 Erlang/Elixir，从而实现实时性能并降低嵌入式应用的复杂性。它提供三种主要堆栈：\n\n*   **GRiSP Metal（原 GRiSP）：** 直接启动到基于 RTEMS 的 Erlang/Elixir VM 中，以在微控制器上实现确定性的实时行为，并最大限度地减少资源使用（适用于 16MB 内存）。它提供直接的硬件访问和监督树以提高可靠性。\n*   **GRiSP Alloy：** 启动到基于精简 Buildroot 的实时 Linux 上的 Erlang/Elixir VM 中。 支持多个具有优先级分离和核心关联的 VM，通过安全的分布式 Erlang 链接连接。\n*   **GRiSP Forge：** 类似于 Alloy，但使用 Yocto，为长期企业部署提供可定制的 Linux 堆栈和 BSP 集成。\n\n所有三个堆栈都利用通过分布式 Erlang 实现的高效安全本地链接，并优先考虑快速启动时间和较小的攻击面。\n\n**GRiSP-io** 是一个云和边缘平台，用于远程部署、监控和管理使用 GRiSP 堆栈构建的分布式嵌入式系统。它有助于无线更新、实时系统洞察以及云/边缘工作流程集成。\n\n本质上，GRiSP 提供了一个可扩展的生态系统，从原型设计到生产，能够实现针对自动化、机器人和互联设备等嵌入式环境优化的强大分布式应用程序。"
  },
  {
    "id": "45069341",
    "title": "Reusing Computation in Text-to-Image Diffusion for Efficient Image Generation",
    "url": "https://arxiv.org/abs/2508.21032",
    "summary": "This arXiv paper, submitted on August 28, 2025, by Decatur et al., titled \"Reusing Computation in Text-to-Image Diffusion for Efficient Generation of Image Sets,\" addresses the computational expense of text-to-image diffusion models. Instead of focusing on per-inference optimization, the authors explore reducing redundancy when generating images from *correlated* prompts (i.e., similar prompts).\n\nTheir approach capitalizes on the coarse-to-fine nature of diffusion models, where early denoising steps handle shared structures among similar prompts. The proposed method is training-free and involves clustering prompts based on semantic similarity, allowing computation to be shared during the initial diffusion steps. This means the model only performs the computationally expensive early denoising steps once for a group of similar prompts.\n\nExperiments demonstrate that the method significantly reduces computational cost while *improving* image quality, especially when using models trained conditioned on image embeddings. It leverages UnClip's text-to-image prior to optimize diffusion step allocation for greater efficiency.\n\nThe authors emphasize the seamless integration of their approach with existing pipelines, its scalability with prompt sets, and its potential to reduce the environmental and financial burden of large-scale text-to-image generation. The project page is linked within the document. The paper was accepted for ICCV 2025.\n",
    "chinese_title": "在文本到图像扩散中重用计算以实现高效图像生成",
    "chinese_summary": "Decatur等人在2025年8月28日提交的arXiv论文《在文本到图像扩散中重用计算以高效生成图像集》旨在解决文本到图像扩散模型计算成本高昂的问题。作者并非专注于单次推理的优化，而是探索如何减少从*相关*提示词（即，相似提示词）生成图像时的冗余。\n\n他们的方法利用了扩散模型由粗到精的特性，其中早期的去噪步骤处理相似提示词之间的共享结构。该方法无需训练，包括基于语义相似性对提示词进行聚类，从而允许在初始扩散步骤中共享计算。这意味着模型仅对一组相似的提示词执行一次计算量大的早期去噪步骤。\n\n实验表明，该方法显著降低了计算成本，同时*提高*了图像质量，尤其是在使用经过图像嵌入训练的模型时。它利用UnClip的文本到图像先验来优化扩散步骤的分配，从而提高效率。\n\n作者强调了其方法与现有流程的无缝集成、对提示词集的可扩展性以及减少大规模文本到图像生成对环境和财务负担的潜力。项目页面链接在文档中。该论文已被ICCV 2025接收。"
  },
  {
    "id": "45099418",
    "title": "Collecting All Causal Knowledge",
    "url": "https://causenet.org/",
    "summary": "CauseNet is a large-scale causal knowledge base extracted from the web, aiming to represent all human causal knowledge and separate it from mere beliefs. It contains over 11 million causal relations between concepts, extracted from sources like ClueWeb12, Wikipedia sentences, lists, and infoboxes, with an estimated precision of 83%.\n\nThree versions of CauseNet are available for download: a full dataset (CauseNet-Full), a higher-precision subset (CauseNet-Precision), and a sample dataset (CauseNet-Sample). Each causal relation includes comprehensive provenance data, specifying the source and extraction method. For instance, relations from natural language sentences include the original sentence, the linguistic path pattern used, and source identifiers like page IDs and timestamps.\n\nThe data model consists of causal concepts connected by causal relations, exemplified by \"disease\" causing \"death.\" The data can be loaded into graph databases like Neo4j. To aid in identifying causal concepts within sentences, concept spotting datasets for different data sources are also available.\n\nThe CauseNet project provides a valuable resource for research in causal inference, question answering, computational argumentation, and other areas. The code is MIT licensed, and the data is under a Creative Commons Attribution 4.0 International license. The project is associated with a CIKM 2020 paper.\n",
    "chinese_title": "收集所有因果知识",
    "chinese_summary": "CauseNet：一个大规模因果知识库\n\nCauseNet是一个从网络提取的大规模因果知识库，旨在表示所有人类因果知识，并将其与单纯的信念区分开来。它包含超过1100万个概念之间的因果关系，这些关系从ClueWeb12、维基百科句子、列表和信息框等来源提取，估计精度为83%。\n\nCauseNet提供三个版本可供下载：完整数据集（CauseNet-Full）、更高精度子集（CauseNet-Precision）和样本数据集（CauseNet-Sample）。每个因果关系都包含全面的出处数据，指定来源和提取方法。例如，来自自然语言句子的关系包括原始句子、使用的语言路径模式以及页面ID和时间戳等源标识符。\n\n数据模型由因果概念和连接它们的因果关系组成，例如“疾病”导致“死亡”。该数据可以加载到Neo4j等图数据库中。为了帮助识别句子中的因果概念，还提供了用于不同数据源的概念识别数据集。\n\nCauseNet项目为因果推理、问答、计算论证和其他领域的研究提供了宝贵的资源。该代码以MIT许可发布，数据以Creative Commons Attribution 4.0 International许可发布。该项目与一篇CIKM 2020论文相关。"
  },
  {
    "id": "45079131",
    "title": "Quirks of Common Lisp Types",
    "url": "https://www.fosskers.ca/en/blog/cl-type-quirks",
    "summary": "This article, \"Quirks of Common Lisp Types,\" explores the nuances and functionalities of types in Common Lisp. It frames types in two perspectives: \"SkyTypes\" emphasizing correctness and \"EarthTypes\" focusing on optimization. The article likely delves into how these different approaches impact type checking and code generation.\n\nIt highlights the concept of \"Type Fluidity,\" potentially referring to the dynamic nature and flexibility of types in Common Lisp, which contrasts with statically typed languages. The discussion moves towards classes, emphasizing their role as the core building blocks for object-oriented programming, and mentioning inheritance and generic function dispatch as central mechanisms. Generic function dispatch, crucial in Common Lisp's object system (CLOS), likely forms a core argument about the power and flexibility of Common Lisp.\n\nThe article also touches on \"abstract\" classes, suggesting a discussion on abstraction and polymorphism within the Common Lisp type system. Finally, it mentions \"Fixnums,\" indicating a possible dive into specific numeric types and optimization considerations related to them. The summary suggests that the text explores the interplay between type safety, performance optimization, and object-oriented features within Common Lisp's powerful and flexible type system. The conclusion offers a \"Summary\" of the discussion and a \"Resources\" section for further learning.\n",
    "chinese_title": "Common Lisp 类型怪癖",
    "chinese_summary": "本文“Common Lisp类型之怪异之处”探讨了Common Lisp中类型的细微差别和功能。它从两个角度构建类型：“天空类型”强调正确性，“大地类型”侧重于优化。文章可能深入探讨了这些不同方法如何影响类型检查和代码生成。\n\n文章突出了“类型流动性”的概念，可能指的是Common Lisp中类型的动态性和灵活性，这与静态类型语言形成对比。讨论转向类，强调其作为面向对象编程核心构建块的作用，并提及继承和泛型函数分派作为中心机制。泛型函数分派在Common Lisp的对象系统（CLOS）中至关重要，可能构成了关于Common Lisp强大性和灵活性的核心论点。\n\n文章还涉及“抽象”类，表明讨论了Common Lisp类型系统中的抽象和多态性。最后，它提到了“定长整数”（Fixnums），表明可能深入研究特定的数值类型以及与其相关的优化考虑。摘要表明，文本探讨了Common Lisp强大而灵活的类型系统中类型安全性、性能优化和面向对象特性之间的相互作用。结论提供了讨论的“摘要”和一个用于进一步学习的“资源”部分。"
  },
  {
    "id": "45071592",
    "title": "The easy way to make a website with Markdown",
    "url": "https://github.com/dtedesco1/nextjs-markdown-boilerplate",
    "summary": "This article introduces a minimal Next.js 15 boilerplate designed for easily creating websites using Markdown (.mdx) files. It allows users to write content in Markdown, which is then rendered as styled, dynamic pages within a Next.js application.\n\nKey features include: automatic routing based on the file structure within the `app/content` directory, the ability to incorporate React components directly into Markdown content, and global styling with Tailwind CSS and DaisyUI. The boilerplate uses a static-first approach, pre-rendering pages at build time for optimal performance, but can be configured for dynamic behavior using Next.js 15's async APIs or by setting `dynamic = 'force-dynamic'`.\n\nThe guide covers setting up the project, including installing dependencies (Node.js 18+, npm 9+, TypeScript, React 19, Next.js 15), running the development server, and building for production. It also outlines the project structure, highlighting the importance of the `app/content` directory for managing Markdown content and page routing.\n\nThe boilerplate provides optional recipes for SEO/Sitemap generation, analytics integration, testing with Vitest, and static export. The article concludes with contribution guidelines, licensing information (MIT), and release notes detailing updates and compatibility with the latest versions of Next.js and React.\n",
    "chinese_title": "用 Markdown 轻松制作网站",
    "chinese_summary": "本文介绍了一个极简的 Next.js 15 样板项目，旨在方便使用 Markdown (.mdx) 文件创建网站。它允许用户以 Markdown 格式编写内容，然后将其渲染为 Next.js 应用程序中具有样式和动态的页面。\n\n主要功能包括：基于 `app/content` 目录中的文件结构自动路由，能够将 React 组件直接集成到 Markdown 内容中，以及使用 Tailwind CSS 和 DaisyUI 进行全局样式设置。该样板项目采用静态优先的方法，在构建时预渲染页面以获得最佳性能，但可以使用 Next.js 15 的异步 API 或通过设置 `dynamic = 'force-dynamic'` 来配置动态行为。\n\n本指南涵盖了项目的设置，包括安装依赖项（Node.js 18+、npm 9+、TypeScript、React 19、Next.js 15）、运行开发服务器以及构建生产版本。它还概述了项目结构，强调了 `app/content` 目录对于管理 Markdown 内容和页面路由的重要性。\n\n该样板项目提供了用于 SEO/站点地图生成、分析集成、使用 Vitest 进行测试以及静态导出的可选方案。本文最后介绍了贡献指南、许可信息（MIT）以及详细说明更新和与最新版本的 Next.js 和 React 兼容性的发行说明。"
  },
  {
    "id": "45062046",
    "title": "An LLM is a lossy encyclopedia",
    "url": "https://simonwillison.net/2025/Aug/29/lossy-encyclopedia/",
    "summary": "This article introduces the analogy of a Large Language Model (LLM) as a \"lossy encyclopedia.\" The author argues that LLMs contain a vast amount of information compressed within them, but this compression results in a loss of detail. Therefore, it's crucial to understand the types of questions LLMs can effectively answer versus those requiring a level of specific detail where the inherent lossiness becomes problematic.\n\nThe author uses a Hacker News comment requesting an LLM to generate a highly specific Zephyr project skeleton as an example of a question beyond the capabilities of a lossy encyclopedia. They suggest that instead of expecting LLMs to \"just know\" such granular details, users should provide correct examples for the LLM to work with. This approach treats the LLM as a tool that can process and act upon provided information, rather than a perfect repository of all facts. In essence, the article advocates for understanding the limitations of LLMs and leveraging their strengths by providing them with the necessary context and examples for successful task completion.\n",
    "chinese_title": "一个大型语言模型是有损百科全书",
    "chinese_summary": "本文将大型语言模型(LLM)比作“有损百科全书”。作者认为，LLM内部包含大量压缩信息，但这种压缩会导致细节丢失。因此，理解LLM能够有效回答哪些类型的问题，以及哪些问题需要特定程度的细节，而这种固有的有损性会造成问题，至关重要。\n\n作者以Hacker News上要求LLM生成高度特定的Zephyr项目骨架的评论为例，说明了超出有损百科全书能力范围的问题。他们建议，与其期望LLM“直接知道”如此细致的细节，不如为LLM提供正确的示例以供其使用。这种方法将LLM视为可以处理和作用于所提供信息的工具，而不是所有事实的完美存储库。本质上，本文提倡理解LLM的局限性，并通过为它们提供必要的上下文和示例来发挥其优势，从而成功完成任务。"
  },
  {
    "id": "45098269",
    "title": "Kazeta: An operating system that brings the console gaming experience of 90s",
    "url": "https://kazeta.org/",
    "summary": "Kazeta is a new operating system designed to recreate the classic console gaming experience of the 1990s on modern PCs. The core idea is to simplify the gaming process, mirroring the ease of use found in older consoles where you simply inserted a cartridge, powered on the device, and started playing. Kazeta aims to eliminate the complexities of modern operating systems and launchers by providing a streamlined \"insert cart, power on, play\" workflow. The system is designed to be intuitive and focused solely on gaming, harkening back to the straightforward experience of 90s console gaming.\n",
    "chinese_title": "Kazeta：重温 90 年代主机游戏体验的操作系统",
    "chinese_summary": "Kazeta：旨在现代PC上重现90年代经典主机游戏体验的新操作系统。核心理念是简化游戏流程，效仿老式主机易于使用的特性，只需插入卡带，启动设备，即可开始游戏。Kazeta旨在通过提供精简的“插入卡带、启动、游玩”流程，消除现代操作系统和启动器的复杂性。该系统设计直观，专注于游戏，重现90年代主机游戏的直接体验。"
  },
  {
    "id": "45105230",
    "title": "AI web crawlers are destroying websites in their never-ending content hunger",
    "url": "https://www.theregister.com/2025/08/29/ai_web_crawlers_are_destroying/",
    "summary": "AI web crawlers are aggressively consuming web content to feed Large Language Models (LLMs), creating major problems for website performance and accessibility. These crawlers, responsible for a significant portion of internet traffic (30% according to Cloudflare), are causing performance degradation, service disruptions, and increased operational costs for websites due to traffic spikes. They often ignore established crawler etiquette like \"robots.txt\" and crawl delays.\n\nSmall businesses and personal websites are particularly vulnerable, often knocked offline by the intense traffic. Even larger sites face increased resource demands to handle the load. This activity doesn't translate to monetization for content creators, as AI bots don't drive users back to the original sources like traditional search engine crawlers.\n\nWhile defenses like logins, paywalls, and anti-bot technologies exist, AI is adept at circumventing them. The proposed \"llms.txt\" standard aims to provide LLM-friendly content without harming site performance, but its future is uncertain. Infrastructure providers like Cloudflare are offering bot-blocking services to combat excessive crawling.\n\nThe author fears the resulting \"arms race\" will lead to a fragmented web with restricted access and siloed information, potentially creating a \"Balkanized Internet\" where access to information requires payment. The open web as it once was is in danger.\n",
    "chinese_title": "AI网络爬虫正因永无止境的内容需求而摧毁网站。",
    "chinese_summary": "AI网络爬虫正大量抓取网页内容以供大型语言模型（LLM）使用，给网站性能和可访问性带来重大问题。这些爬虫占据了相当一部分互联网流量（据Cloudflare称占30%），由于流量激增，导致网站性能下降、服务中断和运营成本增加。它们常常无视既定的爬虫礼仪，如“robots.txt”和抓取延迟。\n\n小型企业和个人网站尤其脆弱，经常因大量流量而瘫痪。即使是大型网站也面临着处理负载所带来的资源需求增加。这种活动不会转化为内容创作者的收入，因为人工智能机器人不像传统的搜索引擎爬虫那样将用户导回原始来源。\n\n虽然存在登录、付费墙和反机器人技术等防御措施，但人工智能擅长规避这些措施。拟议的“llms.txt”标准旨在提供对LLM友好的内容，而不损害网站性能，但其未来尚不确定。Cloudflare等基础设施提供商正在提供机器人拦截服务，以对抗过度抓取。\n\n作者担心由此产生的“军备竞赛”将导致网络碎片化，访问受限和信息孤岛，可能造成一个“巴尔干化的互联网”，其中访问信息需要付费。曾经的开放网络正处于危险之中。"
  },
  {
    "id": "45103646",
    "title": "You don't want to hire \"the best engineers\"",
    "url": "https://www.otherbranch.com/shared/blog/no-you-dont-want-to-hire-the-best-engineers",
    "summary": "This article challenges the common startup mantra of \"only hiring the best engineers.\" The author, a recruiter, argues that pursuing \"the best\" is often unrealistic and detrimental to early-stage companies. These top-tier engineers are typically expensive, opinionated, and have numerous attractive options, making them unlikely to choose a young startup.\n\nStartups, despite knowing they likely can't attract the *absolute* best, often maintain stringent and unrealistic hiring criteria: specific experience, Bay Area in-office presence, aversion to high salaries, and long work hours. This leads to prolonged hiring freezes, a critical issue for startups where time is a valuable resource.\n\nThe author advocates for a more pragmatic approach: prioritize hiring *great* engineers and consciously consider trade-offs. What skills are truly essential? How much is the company willing to concede on salary, remote work, or work-life balance to secure a hire quickly? The article highlights that startups should apply their risk-taking, fast-moving philosophy to hiring, acknowledging that speed and a \"good enough\" approach can be more beneficial than waiting for the \"perfect\" candidate who may never materialize. By widening the candidate pool through flexible requirements, startups can choose from a range of solid options and avoid settling for less out of desperation after months of unproductive searching. The key is to define what truly matters and act decisively.\n",
    "chinese_title": "你不想雇佣“最好的工程师”",
    "chinese_summary": "本文挑战了“只招最好的工程师”这一常见的创业公司口号。作者作为一名招聘人员认为，追求“最好”往往是不现实的，而且对早期公司有害。这些顶尖工程师通常薪酬高昂、固执己见，并且有很多诱人的选择，这使得他们不太可能选择一家年轻的创业公司。\n\n创业公司尽管知道自己可能无法吸引到*绝对*最好的工程师，但仍然坚持严格而不切实际的招聘标准：特定的经验、在湾区办公室办公、不愿意支付高薪以及长时间的工作。 这导致了长时间的招聘停滞，对于时间是宝贵资源的创业公司来说，这是一个关键问题。\n\n作者提倡一种更务实的方法：优先招聘*优秀*的工程师，并有意识地考虑权衡。哪些技能才是真正必不可少的？公司愿意在薪资、远程工作或工作与生活平衡方面做出多少让步，才能尽快招到人？文章强调，创业公司应将其冒险、快速行动的理念应用于招聘，认识到速度和“足够好”的方法可能比等待可能永远不会出现的“完美”候选人更有益。 通过放宽要求来扩大候选人范围，创业公司可以从一系列可靠的选择中进行选择，避免在数月毫无成效的搜索后，因绝望而选择次优方案。 关键是明确什么才是真正重要的，并果断行动。"
  },
  {
    "id": "45099192",
    "title": "Keyboards from my collection (2023)",
    "url": "https://aresluna.org/50-keyboards-from-my-collection/",
    "summary": "This article showcases 50 keyboards from Aresluna's unique collection, described as strange, esoteric, and meaningful. The collection was revealed to celebrate the Kickstarter success of the author's book, \"Shift Happens.\"\n\nThe keyboards span a wide range of types and eras, including ergonomic keyboards like the SafeType and Comfort System, keyboards designed for specific devices like the Commodore 64, and even gaming keyboards. There are also typewriters, including an Olivetti Praxis 48 and a Turkish Olympia typewriter, each with distinct features.\n\nThe collection includes keyboards designed for specific purposes, like a \"medical\" keyboard, a Swintec keyboard made transparent for prisons, and a braille keyboard called Tellatouch. Other highlights are unusual keyboards, such as the \"space cadet\" keyboard that only outputs spaces and a keyboard hidden in a shoe.\n\nThe list also highlights keyboards from failed computer systems and devices such as the One Laptop Per Child (OLPC) and Canon Cat. The article ends with a call to action, encouraging readers to back the author's book, \"Shift Happens,\" which will feature more photos and stories related to keyboards.\n",
    "chinese_title": "我的键盘收藏 (2023)",
    "chinese_summary": "本文展示了Aresluna独特收藏中的50个键盘，这些键盘被描述为奇异、深奥且富有意义。该收藏的公布是为了庆祝作者的著作《Shift Happens》在Kickstarter上的成功。\n\n这些键盘类型和年代跨度很大，包括SafeType和Comfort System等符合人体工程学的键盘，以及为Commodore 64等特定设备设计的键盘，甚至还有游戏键盘。其中还有打字机，包括Olivetti Praxis 48和土耳其Olympia打字机，每款都有其独特之处。\n\n该收藏包括为特定目的设计的键盘，例如“医疗”键盘、为监狱制造的透明Swintec键盘以及名为Tellatouch的盲文键盘。其他亮点包括不寻常的键盘，例如只输出空格的“太空学员”键盘以及隐藏在鞋子里的键盘。\n\n该列表还重点介绍了来自失败的计算机系统和设备的键盘，例如One Laptop Per Child (OLPC)和Canon Cat。文章最后呼吁读者支持作者的著作《Shift Happens》，该书将收录更多与键盘相关的照片和故事。"
  },
  {
    "id": "45102186",
    "title": "RubyMine is now free for non-commercial use",
    "url": "https://blog.jetbrains.com/ruby/2025/09/rubymine-is-now-free-for-non-commercial-use/",
    "summary": "RubyMine, the intelligent IDE for Ruby and Rails development, is now free for non-commercial use. This initiative aims to lower the barrier to entry for learning Ruby and Rails, contributing to open-source projects, creating developer content, and building personal projects. The free license provides a full-featured IDE, identical to the paid version except for the Code With Me feature which is limited to the Community edition.\n\nCommercial use, defined as developing products and earning commercial benefits, still requires a paid license. Non-commercial use includes learning, open-source contributions without financial gain, content creation, and hobby development. A key condition of the free license is mandatory, anonymized usage statistics collection to help improve the product.\n\nNon-commercial subscriptions are valid for one year and automatically renew if the license has been used within the last six months. Users can easily apply for the free license within the RubyMine IDE after installation. The offer is available for RubyMine versions 2025.2.1 and later. The move reflects JetBrains' commitment to supporting the Ruby community and ensuring developers have access to the tools they need to write clean, confident code.\n",
    "chinese_title": "RubyMine 现在可免费用于非商业用途",
    "chinese_summary": "RubyMine：非商业用途免费开放\n\nRubyMine是一款智能的Ruby和Rails开发IDE，现在对非商业用途免费开放。此举旨在降低学习Ruby和Rails、贡献开源项目、创作开发者内容以及构建个人项目的门槛。免费许可证提供功能齐全的IDE，与付费版本相同，只是“Code With Me”功能限制为社区版。\n\n商业用途，定义为开发产品并获得商业利益，仍需购买付费许可证。非商业用途包括学习、无经济收益的开源贡献、内容创作和业余爱好开发。免费许可证的一个关键条件是强制性的匿名使用情况统计信息收集，以帮助改进产品。\n\n非商业订阅有效期为一年，如果在过去六个月内使用了许可证，则会自动续订。用户安装后可以在RubyMine IDE内轻松申请免费许可证。此优惠适用于RubyMine 2025.2.1及更高版本。此举反映了JetBrains致力于支持Ruby社区，并确保开发人员能够使用所需的工具来编写清晰、自信的代码。"
  },
  {
    "id": "45063037",
    "title": "The day Return became Enter (2023)",
    "url": "https://aresluna.org/the-day-return-became-enter/",
    "summary": "This article traces the evolution of the \"Return\" key from its origins in mechanical typewriters to its modern \"Enter\" incarnation in computers, highlighting the complex and meandering transition. Initially, the carriage return lever on typewriters was a mechanical shorthand for advancing the paper and returning the carriage. The shift to electric typewriters in the mid-20th century simplified the process, transforming the lever into a key, often called \"Return.\"\n\nTeletypes, precursors to the internet, introduced the need for encoding characters and control characters, leading to the separation of Carriage Return (CR) and Line Feed (LF), a source of programming challenges even today.\n\nThe emergence of word processors brought another layer of complexity. The focus shifted from simply typing to modifying and rewriting text. Text reflow, a feature that automatically adjusted text and inserted carriage returns, required users to restrain from manually pressing Return at the end of each line, reserving it for paragraph ends. This introduced concepts like \"soft\" and \"hard\" returns and blurred the connection between keypress and output.\n\nWhile early word processors felt like computers, actual computers adopted QWERTY keyboards, recognizing their efficiency. The \"Return\" key became inadequate, its function evolving beyond simply moving to the next line. It became associated with executing commands or committing data. Thus, some systems replaced \"Return\" with \"Execute,\" \"Word Rel,\" or \"Next,\" ultimately paving the way for the \"Enter\" key, signifying the completion of an action and its subsequent processing.\n",
    "chinese_title": "归来变入境 (2023)",
    "chinese_summary": "本文追溯了“回车”键从机械打字机时代到计算机中现代“Enter”键的演变，着重介绍了这一复杂而曲折的过渡。最初，打字机上的回车杆是一种机械速记方式，用于推进纸张和返回字车。20世纪中期，电动打字机的出现简化了这一过程，将回车杆变成了按键，通常被称为“回车”。\n\n电传打字机是互联网的前身，它引入了编码字符和控制字符的需求，导致了回车 (CR) 和换行 (LF) 的分离，这至今仍然是编程挑战的根源。\n\n文字处理器的出现带来了另一层复杂性。重点从简单的打字转变为修改和重写文本。文本重排，一种自动调整文本并插入回车符的功能，要求用户避免在每行末尾手动按下回车键，仅将其保留用于段落结尾。这引入了“软回车”和“硬回车”等概念，并模糊了按键和输出之间的联系。\n\n虽然早期的文字处理器感觉像是计算机，但真正的计算机采用了 QWERTY 键盘，认可了其效率。“回车”键变得不再适用，其功能演变为不仅仅是移动到下一行。它开始与执行命令或提交数据相关联。因此，一些系统用“Execute”、“Word Rel”或“Next”取代了“Return”，最终为“Enter”键铺平了道路，它标志着动作的完成及其后续处理。"
  },
  {
    "id": "45095603",
    "title": "Amazon has mostly sat out the AI talent war",
    "url": "https://www.businessinsider.com/amazon-ai-talent-wars-internal-document-2025-8",
    "summary": "This Business Insider article, titled \"Amazon has mostly sat out the AI talent war,\" suggests that, despite the hype and intense competition for AI expertise, Amazon has largely refrained from aggressively pursuing top AI talent in the same way as its tech rivals.\n\nThe article likely explores various factors contributing to Amazon's seemingly less aggressive approach. These might include:\n\n*   **Internal Development:** Amazon may be focusing more on training and promoting existing employees to fill AI roles, rather than poaching talent from other companies.\n*   **Different AI Focus:** Amazon's AI priorities might differ from other companies, perhaps focusing more on practical applications within its existing businesses (like AWS, e-commerce, and Alexa) rather than cutting-edge research. This could mean they need different skillsets or are willing to accept talent with a different profile.\n*   **Cost Considerations:** The inflated salaries and benefits demanded by top AI talent can be exorbitant. Amazon may be more cost-conscious, opting for a more sustainable approach to building its AI capabilities.\n*   **Cultural Fit:** Amazon's corporate culture might not be as appealing to some AI researchers, who may prefer working in academic settings or startups with more autonomy.\n*   **Underestimated Investment:** While outwardly it seems Amazon has sat out the talent war, the article may consider if their acquisition strategy or internal allocation of resources suggests more subtle or less publicized investments in AI personnel.\n\nThe article probably provides evidence and examples to support the claim that Amazon is taking a different approach to the AI talent war compared to companies like Google, Microsoft, or Meta.\n",
    "chinese_title": "亚马逊在人工智能人才争夺战中基本缺席。",
    "chinese_summary": "商业内幕文章《亚马逊基本缺席AI人才争夺战》指出，尽管人工智能领域炒作不断，对AI专家的竞争异常激烈，但亚马逊在很大程度上并未像其科技竞争对手那样积极争取顶尖AI人才。\n\n该文章可能探讨了导致亚马逊看似不那么激进的原因，可能包括：\n\n*   **内部发展：** 亚马逊可能更专注于培养和提拔现有员工来填补AI职位，而不是从其他公司挖人。\n*   **不同的AI侧重点：** 亚马逊的AI优先事项可能与其他公司不同，或许更侧重于在其现有业务（如AWS、电子商务和Alexa）中的实际应用，而不是前沿研究。 这可能意味着他们需要不同的技能组合，或者愿意接受具有不同资历的人才。\n*   **成本考量：** 顶尖AI人才要求的薪酬和福利可能过高。 亚马逊可能更注重成本效益，选择一种更可持续的方式来构建其AI能力。\n*   **文化契合度：** 亚马逊的企业文化可能对一些AI研究人员没有那么大的吸引力，他们可能更喜欢在学术机构或具有更大自主权的初创公司工作。\n*   **低估的投资：** 虽然表面上看，亚马逊似乎缺席了人才争夺战，但该文章可能会考虑他们的收购策略或内部资源分配是否表明他们在AI人员方面的投资更为微妙或不为人知。\n\n该文章可能提供了证据和例子，以支持亚马逊在AI人才争夺战中采取了与谷歌、微软或Meta等公司不同的策略这一论断。"
  },
  {
    "id": "45070019",
    "title": "Writing a Hypervisor in 1k Lines",
    "url": "https://seiya.me/blog/hypervisor-in-1000-lines",
    "summary": "This article announces a new tutorial, \"Writing a Hypervisor in 1,000 Lines,\" aimed at developers familiar with the author's previous \"Operating System in 1,000 Lines\" book. The new tutorial guides readers through building a type-1 hypervisor from scratch on 64-bit RISC-V using QEMU. A significant aspect of this tutorial is its use of stable Rust, overcoming the need for nightly builds previously required for low-level tasks like inline assembly.\n\nThe author emphasizes a key understanding: hardware-assisted hypervisors function as sophisticated event handlers, similar to `try...catch` blocks. The guest OS runs within a \"try\" block, and the hypervisor intercepts events (\"VM exits\") to handle them, then resumes the guest OS. This paradigm unlocks potential beyond traditional OS virtualization, including hardware emulation, security boundary creation (like gVisor), and application-specific environments (like Hyperlight). The tutorial begins from scratch, covering some overlapping ground with the OS book but now in Rust. The book is publicly available at 1000hv.seiya.me.\n",
    "chinese_title": "用一千行代码编写虚拟机监控器",
    "chinese_summary": "本文宣布推出一项新的教程“用1000行代码编写一个虚拟机监控器”，面向熟悉作者之前“用1000行代码编写操作系统”一书的开发者。这个新教程将指导读者使用QEMU，在64位RISC-V上从头开始构建一个1型虚拟机监控器。该教程的一个重要方面是它使用了稳定的Rust，克服了以前执行内联汇编等底层任务时对 nightly 构建的需求。\n\n作者强调了一个关键理解：硬件辅助的虚拟机监控器充当复杂的事件处理程序，类似于`try...catch`块。客户操作系统在“try”块中运行，虚拟机监控器拦截事件（“VM exits”）来处理它们，然后恢复客户操作系统。这种模式解锁了超越传统操作系统虚拟化的潜力，包括硬件仿真、安全边界创建（如gVisor）和特定于应用程序的环境（如Hyperlight）。本教程从头开始，涵盖了与操作系统书籍的一些重叠内容，但现在使用 Rust 编写。该书可在1000hv.seiya.me上公开获取。"
  },
  {
    "id": "45104289",
    "title": "The staff ate it later",
    "url": "https://en.wikipedia.org/wiki/The_staff_ate_it_later",
    "summary": "\"The staff ate it later\" is a Japanese TV caption (\"Kono ato, sutaffu ga oishiku itadakimashita\") used when food appears on screen, indicating that it wasn't discarded after filming. Its use arose from viewers' concerns about food waste in TV variety shows.\n\nThe authenticity of the caption is debated. Some reports support its truthfulness, citing crew members and food professionals who claim the staff do consume leftover food to avoid waste and show consideration to restaurants. Former beach volleyball player Miwa Asao posted photos as proof.\n\nHowever, dissenting opinions exist. Comedian Hitoshi Matsumoto admitted he's never witnessed staff eating the food. Takeshi Kitano questioned the caption's validity when food is clearly unusable, and commentator Tsunehira Furuya stated that the food is simply thrown away.\n\nCommentators have discussed the caption's impact. While some see it as a response to increased viewer criticism after events like the \"Aru Aru Mondai,\" others argue it shifts responsibility to viewers and can lead to excessive self-regulation, potentially hindering creativity. Takashi Matsuo suggests parents should educate children about food ethics rather than rely on TV shows. He also points out the inconsistency of only displaying it on cooking shows, but not in events where food is wasted in other ways.\n",
    "chinese_title": "员工们后来吃了它。",
    "chinese_summary": "电视节目字幕“之后，工作人员愉快地享用了”（Kono ato, sutaffu ga oishiku itadakimashita）用于食物出现在屏幕上时，表示拍摄后食物没有被丢弃。其出现源于观众对电视综艺节目中食物浪费的担忧。\n\n该字幕的真实性存在争议。一些报道支持其真实性，引用剧组人员和食品专业人士的说法，他们声称工作人员确实会吃掉剩余食物，以避免浪费并向餐厅表示尊重。前沙滩排球运动员浅尾美和发布照片作为证明。\n\n然而，也存在不同意见。喜剧演员松本人志承认他从未亲眼目睹工作人员吃食物。北野武质疑该字幕的有效性，尤其是在食物明显无法食用时，而评论员古谷经衡表示食物 simply 会被扔掉。\n\n评论员们讨论了该字幕的影响。有些人认为这是对“Aru Aru事件”等事件后观众批评增加的回应，而另一些人则认为它将责任转移给观众，并可能导致过度自我监管，从而阻碍创造力。松尾贵史建议父母应该教育孩子关于食物伦理，而不是依赖电视节目。他还指出，只在烹饪节目中展示该字幕，但在其他浪费食物的活动中却没有展示，这并不一致。"
  },
  {
    "id": "45099939",
    "title": "Kapa.ai (YC S23) is hiring research and software engineers",
    "url": "https://www.ycombinator.com/companies/kapa-ai/jobs",
    "summary": "Kapa.ai, a Y Combinator S23 company, is hiring Research and Software Engineers. They offer remote positions with a salary range of $100K-$150K and equity of 0.10%-0.30%, requiring 3+ years of experience. Kapa.ai helps technical companies build AI assistants using their existing knowledge sources like documentation, forums, and GitHub issues. These AI assistants are used as chat interfaces on public documentation, first-line support on support forms, and internal assistants for GTM teams. Companies like Docker, Grafana, and Mixpanel utilize Kapa.ai. Founded in 2023 by Finn Bauer and Emil Soerensen, Kapa.ai has a team of 19 and has already answered over 10 million questions for more than 200 companies. The company streamlines access to complex technical information through AI, enhancing support and internal knowledge navigation.\n",
    "chinese_title": "Kapa.ai (YC S23) 招聘研究和软件工程师",
    "chinese_summary": "Kapa.ai (Y Combinator S23 公司) 招聘研究工程师和软件工程师。提供远程职位，薪资范围为 10 万美元至 15 万美元，股权为 0.10%-0.30%，要求 3 年以上经验。Kapa.ai 帮助技术公司利用其现有知识来源（如文档、论坛和 GitHub 问题）构建 AI 助手。这些 AI 助手用作公共文档上的聊天界面、支持表单上的第一线支持以及 GTM 团队的内部助手。Docker、Grafana 和 Mixpanel 等公司都在使用 Kapa.ai。Kapa.ai 由 Finn Bauer 和 Emil Soerensen 于 2023 年创立，拥有一支 19 人的团队，已为 200 多家公司解答了超过 1000 万个问题。该公司通过 AI 简化了对复杂技术信息的访问，从而增强了支持和内部知识导航。"
  },
  {
    "id": "45099922",
    "title": "Next.js is infuriating",
    "url": "https://blog.meca.sh/3lxoty3shjc2z",
    "summary": "Dominik's blog post, \"Next.js Is Infuriating,\" details his frustrating experience trying to implement production-ready logging in a Next.js application. He outlines a journey fraught with limitations and unexpected behavior.\n\nHis main grievance centers on the inadequacy of Next.js middleware. Dominik highlights its limitations, including the inability to chain middlewares and the restriction of passing only headers between them and routes. He attempts to use AsyncLocalStorage with pino for logging, encountering issues due to Next.js's default edge runtime and its apparent inability to maintain the same async context across middleware and pages/layouts.\n\nThe core problem is the lack of a clean way to pass request-specific information (like a request ID for logging) from the middleware to the actual page rendering logic. He resorts to a convoluted workaround involving passing the request ID via headers, splitting loggers, and dealing with different server environments, ultimately highlighting the clunky and error-prone nature of the solution.\n\nDominik then explores using a custom Next.js server, hoping to regain control and utilize AsyncLocalStorage effectively. However, even this approach fails to propagate the logging context.\n\nHe contrasts Next.js unfavorably with SvelteKit, praising the latter's middleware system for its flexibility and ability to pass data to handlers seamlessly. He criticizes Vercel for offering a superior solution in a side project while neglecting its flagship offering.\n\nFinally, Dominik expresses frustration with the Next.js GitHub issue tracker, where bug reports languish without response, creating a sense of helplessness and discouraging community contribution. His overall sentiment is one of disillusionment with Next.js, citing a constant stream of bugs, inconsistencies, and unnecessary complexity.\n",
    "chinese_title": "Next.js 令人恼火",
    "chinese_summary": "多米尼克的博客文章《Next.js 令人恼火》，详细描述了他尝试在 Next.js 应用中实现生产级日志记录时令人沮丧的经历。他概述了一段充满限制和意外行为的旅程。\n\n他的主要不满集中在 Next.js 中间件的不足上。多米尼克强调了它的局限性，包括无法链接中间件以及只能在它们和路由之间传递标头的限制。他尝试将 AsyncLocalStorage 与 pino 一起用于日志记录，但由于 Next.js 的默认边缘运行时以及它显然无法在中间件和页面/布局之间保持相同的异步上下文而遇到问题。\n\n核心问题是缺乏一种干净的方法将请求特定信息（例如用于日志记录的请求 ID）从中间件传递到实际的页面渲染逻辑。他采取了一种复杂的回避方法，涉及通过标头传递请求 ID、拆分记录器以及处理不同的服务器环境，最终突出了该解决方案的笨拙和容易出错的性质。\n\n多米尼克随后探索使用自定义 Next.js 服务器，希望重新获得控制并有效地利用 AsyncLocalStorage。然而，即使这种方法也未能传播日志记录上下文。\n\n他将 Next.js 与 SvelteKit 进行了不利的对比，称赞后者的中间件系统具有灵活性以及将数据无缝传递给处理程序的能力。他批评 Vercel 在一个副项目中提供了一个卓越的解决方案，却忽略了其旗舰产品。\n\n最后，多米尼克对 Next.js GitHub 问题跟踪器表示沮丧，其中的错误报告长期无人回应，从而产生一种无助感并阻碍社区贡献。他的总体情绪是对 Next.js 的失望，理由是不断的错误、不一致和不必要的复杂性。"
  },
  {
    "id": "45055205",
    "title": "Making Minecraft Spherical",
    "url": "https://www.bowerbyte.com/posts/blocky-planet/",
    "summary": "This article discusses the challenges and solutions involved in mapping Minecraft's cubic voxels onto a spherical planet in a Unity tech demo called \"Blocky Planet.\" The primary hurdle is adapting a flat, grid-based system to a curved surface while maintaining a Minecraft-like feel.\n\nThe article highlights two main problems: mapping a 2D square grid onto a 3D sphere and preserving block width with depth. It delves into the use of a quad sphere, dividing the globe into six sectors to reduce distortion compared to a single-rectangle map. An improved mapping method is used to pre-distort the square grid to counteract normalization distortion, resulting in less squished and stretched blocks.\n\nAddressing depth distortion, the article describes dividing the planet into shells, adding more blocks per layer as you move outward from the center to maintain block size. These shells group blocks where all sides align nicely.\n\nFinally, the article explains the planet's data structure. It's divided into six sectors, then shells of varying size that are further subdivided into regularly sized chunks (16x16x16 blocks) for efficient processing. A \"BlockAddress\" is used to specify each block's precise location within the sector, shell, chunk structure to facilitate mechanics like block placement. The article concludes with a detailed (optional) explanation of how to calculate the BlockAddress of a given world position.\n",
    "chinese_title": "让Minecraft变球形",
    "chinese_summary": "本文探讨了在 Unity 技术演示 “方块星球” 中，将 Minecraft 的立方体像素映射到球形星球上所涉及的挑战和解决方案。主要障碍在于如何将平面网格系统适应于曲面，同时保持类似 Minecraft 的风格。\n\n本文重点介绍了两个主要问题：将 2D 正方形网格映射到 3D 球体上，以及在深度方向上保持方块宽度。文章深入探讨了四边形球体的应用，将地球划分为六个扇区，与单矩形地图相比，减少了失真。采用了一种改进的映射方法来预先扭曲正方形网格，以抵消归一化失真，从而减少方块的挤压和拉伸。\n\n为了解决深度方向的失真，文章描述了将星球划分为多个壳层，随着从中心向外移动，每层增加更多方块，以保持方块大小。这些壳层将所有边对齐良好的方块分组在一起。\n\n最后，文章解释了星球的数据结构。它被划分为六个扇区，然后是大小不一的壳层，这些壳层进一步细分为规则大小的区块（16x16x16 个方块），以实现高效处理。使用 \"方块地址\" 来指定每个方块在扇区、壳层、区块结构中的精确位置，以方便诸如方块放置之类的机制。文章最后详细（可选）地解释了如何计算给定世界位置的方块地址。"
  },
  {
    "id": "45095460",
    "title": "Implementing a Foil Sticker Effect",
    "url": "https://www.4rknova.com/blog/2025/08/30/foil-sticker",
    "summary": "This article provides a detailed guide to creating a custom Three.js shader that simulates the visual effect of a foil sticker, complete with iridescence and sparkling metallic flakes. It explains the underlying principles behind the effect, drawing from real-world observations of iridescence caused by thin-film interference and the reflective nature of metallic flakes.\n\nThe implementation focuses on approximating these effects in real-time using techniques like mapping view angle to hue for iridescence and employing procedural noise to generate random bright patches mimicking foil flakes. The article provides a live demo where users can adjust shader parameters.\n\nThe article then breaks down the implementation into two main parts: the vertex shader and the fragment shader. The vertex shader manages the peel geometry using Rodrigues' rotation formula and passes vertex data to the fragment shader. The fragment shader handles the lighting, reflections, iridescence, and foil flakes. It uses alpha cutoff, back-face shading, procedural noise for flakes, environment map sampling for reflections, and Fresnel calculations to create a visually plausible foil sticker effect. The code for both shaders is provided, along with explanations of the uniforms and varying variables used.\n\nFinally, the article clarifies the licensing terms for the code, offering it under a Creative Commons Attribution-NonCommercial 4.0 International license. It also encourages readers to support the author's work through GitHub Sponsors to facilitate future tutorials and open-source projects.\n",
    "chinese_title": "实现箔片贴纸效果",
    "chinese_summary": "本文详细介绍了如何创建一个自定义的Three.js着色器，该着色器可以模拟箔片贴纸的视觉效果，包括虹彩和闪烁的金属薄片。它解释了该效果背后的基本原理，借鉴了现实世界中由薄膜干涉引起的虹彩现象以及金属薄片的反射特性。\n\n实现重点在于实时近似这些效果，使用诸如将视角映射到色调以产生虹彩，以及采用程序噪声生成模仿箔片闪光的随机亮斑等技术。本文提供了一个实时演示，用户可以在其中调整着色器参数。\n\n然后，本文将实现分解为两个主要部分：顶点着色器和片段着色器。顶点着色器使用Rodrigues旋转公式管理剥离几何体，并将顶点数据传递给片段着色器。片段着色器处理光照、反射、虹彩和箔片闪光。它使用alpha裁剪、背面着色、用于闪光的程序噪声、用于反射的环境贴图采样以及菲涅耳计算来创建视觉上合理的箔片贴纸效果。文章提供了两种着色器的代码，并解释了使用的uniform变量和varying变量。\n\n最后，本文阐明了代码的许可条款，根据Creative Commons Attribution-NonCommercial 4.0 International许可提供。它还鼓励读者通过GitHub Sponsors支持作者的工作，以促进未来的教程和开源项目。"
  },
  {
    "id": "45095849",
    "title": "Patrick Winston: How to Speak (2018) [video]",
    "url": "https://www.youtube.com/watch?v=Unzc731iCUY",
    "summary": "This appears to be the text at the *bottom* of a YouTube video page and **not a summary of the video content itself.** The title suggests the video is about effective speaking techniques by Patrick Winston, but the content you've provided is just standard YouTube boilerplate.\n\nTherefore, I cannot provide a summary of the video's content based on this information. The text only includes:\n\n*   **Standard YouTube Legal and Policy Links:** Links to YouTube's policies (privacy, terms, etc.) and contact information.\n*   **Copyright Information:** Indicating YouTube's copyright and Google LLC's involvement.\n*   **Features and Initiatives:** Mention of new features, creator resources, advertising options, and NFL Sunday Ticket.\n\nTo summarize the video, I would need access to the actual video content or a transcript/description of it.\n",
    "chinese_title": "帕特里克·温斯顿：如何演讲 (2018) [视频]",
    "chinese_summary": "这段文字看起来是 YouTube 视频页面*底部*的文字，**而不是视频内容本身的摘要。** 标题表明该视频是关于 Patrick Winston 的有效演讲技巧，但您提供的内容只是标准的 YouTube 样板文字。\n\n因此，我无法根据这些信息提供视频内容的摘要。文字仅包含：\n\n*   **标准的 YouTube 法律和政策链接：** 指向 YouTube 政策（隐私、条款等）和联系方式的链接。\n*   **版权信息：** 指出 YouTube 的版权和 Google LLC 的参与。\n*   **功能和倡议：** 提及新功能、创作者资源、广告选项和 NFL Sunday Ticket。\n\n要总结视频，我需要访问实际的视频内容或其文字稿/描述。"
  },
  {
    "id": "45098722",
    "title": "FreeDroidWarn",
    "url": "https://github.com/woheller69/FreeDroidWarn",
    "summary": "FreeDroidWarn is a library designed to display a warning dialog within Android apps, informing users about Google's upcoming developer verification requirement for apps distributed outside the Google Play Store. From 2026/2027, Google will mandate developers to submit personal identification details to Google for apps running on certified Android devices. The developers of apps using FreeDroidWarn indicate they will not comply with this requirement. Consequently, after 2026/2027, these apps will cease to function on certified Android devices.\n\nThe library can be easily integrated into Android projects via JitPack by adding the JitPack repository to the `build.gradle` file and including the dependency `com.github.woheller69:FreeDroidWarn:V1.3`.  A simple line of code, `FreeDroidWarn.showWarningOnUpgrade(this, BuildConfig.VERSION_CODE);`, added to the `onCreate` method of the app, will trigger the warning dialog upon app upgrade.\n\nThe library is released under the Apache V2.0 license, allowing for free use and modification. The documentation links to Android Authority and the official Android Developer website for further information on Google's verification requirements.\n",
    "chinese_title": "FreeDroidWarn\n\n自由安卓警告",
    "chinese_summary": "FreeDroidWarn 是一个库，旨在在 Android 应用中显示警告对话框，告知用户 Google 即将对在 Google Play 商店之外分发的应用提出的开发者验证要求。 从 2026/2027 年起，Google 将强制开发者向 Google 提交个人身份信息，用于在认证的 Android 设备上运行的应用。 使用 FreeDroidWarn 的应用的开发者表示他们不会遵守此要求。 因此，在 2026/2027 年之后，这些应用将停止在认证的 Android 设备上运行。\n\n可以通过将 JitPack 仓库添加到 `build.gradle` 文件并包含依赖项 `com.github.woheller69:FreeDroidWarn:V1.3`，轻松地通过 JitPack 将该库集成到 Android 项目中。 只需在应用的 `onCreate` 方法中添加一行简单的代码 `FreeDroidWarn.showWarningOnUpgrade(this, BuildConfig.VERSION_CODE);`，即可在应用升级时触发警告对话框。\n\n该库在 Apache V2.0 许可下发布，允许免费使用和修改。 该文档链接到 Android Authority 和官方 Android Developer 网站，以获取有关 Google 验证要求的更多信息。"
  },
  {
    "id": "45092490",
    "title": "Bear is now source-available",
    "url": "https://herman.bearblog.dev/license/",
    "summary": "On September 1, 2025, the creator of Bear announced a change in the software's license from MIT to the Elastic License. Initially released under MIT to encourage learning and auditing for privacy and security, the author now feels compelled to restrict usage due to repeated instances of competitors forking the project to create rival services.\n\nThe author expresses disappointment and frustration over seeing their hard work copied and potentially threatening their livelihood. The Elastic License, while very similar to MIT, prohibits the use of Bear's code to provide a hosted or managed service. This decision aligns with a growing trend among open-source projects aiming to prevent \"free-ride competition.\"\n\nThe author cites the increasing ease of creating competing products through AI-powered coding as a contributing factor to this change. While acknowledging the value of Bear's codebase, the author emphasizes that the platform's true strength lies in its user base and the commitment to its long-term maintenance. The decision to alter the license is a protective measure to ensure the platform's continued well-being, even if it limits what others can do with the code.\n",
    "chinese_title": "熊现在是源码可用了",
    "chinese_summary": "2025年9月1日，Bear的开发者宣布将该软件的许可证从MIT变更为Elastic许可证。最初以MIT许可证发布是为了鼓励学习和进行隐私及安全审计，但作者现在被迫限制使用，原因是竞争对手屡次复刻该项目以创建竞争服务。\n\n作者对自己的辛勤工作被抄袭并可能威胁到生计感到失望和沮丧。Elastic许可证虽然与MIT许可证非常相似，但禁止使用Bear的代码来提供托管或管理的服务。这一决定符合开源项目旨在阻止“搭便车竞争”的日益增长的趋势。\n\n作者认为，通过人工智能驱动的编码越来越容易创建竞争产品，这是导致这一变化的因素之一。虽然承认Bear代码库的价值，但作者强调该平台真正的优势在于其用户群以及对长期维护的承诺。更改许可证的决定是一种保护措施，旨在确保平台的持续良好发展，即使这限制了其他人可以对代码做的事情。"
  },
  {
    "id": "45105983",
    "title": "Dozens of scientists find errors in a new Energy Department climate report",
    "url": "https://www.npr.org/2025/09/02/nx-s1-5521384/energy-report-scientists-climate-change",
    "summary": "A new U.S. Department of Energy (DOE) report on climate change, spearheaded by Energy Secretary Chris Wright, is facing strong criticism from over 85 scientists who claim it is riddled with errors and misrepresents established climate science. This rebuttal comes after allegations that the report was secretly compiled by a hand-picked group of climate change skeptics.\n\nThe scientists argue that the DOE report cherry-picks data and neglects crucial aspects of climate science. For example, the DOE report suggests that increased carbon dioxide levels could benefit U.S. agriculture, while ignoring the negative impacts of extreme weather and increased heat on crops. It also claims there's no evidence of intensified \"meteorological\" droughts, overlooking the impact of higher temperatures and evaporation on drought severity.\n\nCritics argue that the DOE report is being used by the Trump administration to justify rolling back climate regulations, specifically the endangerment finding, which forms the basis for regulating climate pollution. John Cook, a climate misinformation researcher, believes the report aims to delay action on climate change by downplaying its severity.\n\nAndrew Dessler, professor at Texas A&M University, emphasizes the importance of addressing the report's scientific flaws, especially given its use in policy decisions. Travis Fisher of the Cato Institute, who coordinated the DOE's Climate Working Group, says the DOE will address any errors identified during the open-comment period. The Environmental Protection Agency administrator, Lee Zeldin, has stated the goal of the administration is \"driving a dagger straight into the heart of the climate change religion.\"\n",
    "chinese_title": "数十名科学家发现能源部一份新的气候报告存在错误。",
    "chinese_summary": "美国能源部一份新的气候变化报告，由能源部长克里斯·赖特主导，正面临超过85位科学家的强烈批评，他们声称该报告充斥着错误并歪曲了已确立的气候科学。此前有指控称该报告是由一批精心挑选的气候变化怀疑论者秘密编写的，而这次反驳正是在这些指控之后发生的。\n\n科学家们认为，能源部的报告存在选择性地采用数据，并忽略气候科学的关键方面的情况。例如，能源部的报告表明，二氧化碳水平的升高可能对美国农业有利，同时却忽略了极端天气和高温对农作物的负面影响。它还声称没有证据表明“气象”干旱加剧，忽略了高温和蒸发对干旱严重程度的影响。\n\n批评人士认为，特朗普政府正在利用能源部的报告来证明撤销气候法规是合理的，特别是构成气候污染监管基础的危害发现。气候虚假信息研究员约翰·库克认为，该报告旨在通过淡化气候变化的严重性来拖延应对气候变化的行动。\n\n德克萨斯A&M大学教授安德鲁·德斯勒强调了解决该报告科学缺陷的重要性，尤其考虑到它被用于政策决策。加图研究所的特拉维斯·费舍尔协调了能源部的气候工作组，他说能源部将解决公开评论期间发现的任何错误。环境保护署署长李·泽尔丁表示，本届政府的目标是“直接将匕首刺入气候变化宗教的心脏”。"
  },
  {
    "id": "45101794",
    "title": "The Sudden Surges That Forge Evolutionary Trees",
    "url": "https://www.quantamagazine.org/the-sudden-surges-that-forge-evolutionary-trees-20250828/",
    "summary": "This article explores a new evolutionary model proposing that evolution occurs in \"sudden surges\" rather than gradual change, a concept known as \"saltative branching.\" Based on punctuated equilibrium, the model suggests that significant evolutionary changes are clustered at the points where lineages split, rather than being spread out over long periods.\n\nEvolutionary biologist Jordan Douglas and his team developed a mathematical framework that measures \"spikes\" of change at branching points, and accounts for extinct lineages (\"phantom bursts\"). They tested the model across various datasets, including aminoacyl-tRNA synthetases (aaRSs), cephalopod traits, and Indo-European languages. The results consistently showed rapid evolutionary changes around lineage splits, suggesting a \"split-and-hit-the-gas\" dynamic.\n\nThe findings bridge perspectives of paleontologists, who often observe punctuated equilibrium in the fossil record, and molecular biologists, who tend to see more gradual change. The model suggests that environmental changes or new evolutionary pressures may trigger these rapid adaptations and speciation events. While further testing is needed, the model offers a new perspective on the tempo of evolution, suggesting that sudden bursts of change are a fundamental aspect of biological and cultural evolution.\n",
    "chinese_title": "塑造进化树的突发性涌动",
    "chinese_summary": "本文探讨了一种新的进化模型，该模型提出进化是以“突发性激增”而非渐进性变化的方式发生的，这一概念被称为“跃迁式分枝”。该模型基于间断平衡理论，认为显著的进化变化集中在线粒分裂的点上，而不是分散在很长一段时间内。\n\n进化生物学家乔丹·道格拉斯和他的团队开发了一个数学框架，用于测量分支点上的变化“峰值”，并解释了已灭绝的谱系（“幻影爆发”）。他们使用包括氨酰-tRNA合成酶（aaRSs）、头足类动物性状和印欧语系在内的各种数据集测试了该模型。结果一致表明，谱系分裂周围存在快速的进化变化，表明了一种“分裂即加速”的动态。\n\n这些发现弥合了古生物学家的观点（他们经常在化石记录中观察到间断平衡）和分子生物学家的观点（他们倾向于看到更渐进的变化）。该模型表明，环境变化或新的进化压力可能会触发这些快速适应和物种形成事件。虽然还需要进一步的测试，但该模型为进化的节奏提供了一个新的视角，表明突发性变化是生物和文化进化中的一个基本方面。"
  },
  {
    "id": "45096585",
    "title": "Raspberry Pi 5 support (OpenBSD)",
    "url": "https://marc.info/?l=openbsd-cvs&m=175675287220070&w=2",
    "summary": "This email announces the addition of Raspberry Pi 5 Model B support to the OpenBSD RAMDISK distribution for the arm64 architecture. The commit, made by Marcus Glocker on September 1, 2025, modifies the `Makefile` in both the `distrib/arm64/iso` and `distrib/arm64/ramdisk` directories, as well as adding entries to `install.md` and `list` in the `ramdisk` directory to enable this support.\n\nThe announcement also highlights several known issues with the initial Raspberry Pi 5 support:\n\n*   **PCIe Boot:** Booting from PCIe storage HATs is currently not functional due to a lack of U-Boot support.\n*   **WiFi:** WiFi is not working on Raspberry Pi 5 Model B \"d0\" boards.\n*   **Active Cooler (Fan):** The active cooler (fan) is not working because required pwm/clock drivers are missing, although there is ongoing work to address this.\n\nThe change was reviewed and approved by kettenis@ and deraadt@.\n",
    "chinese_title": "树莓派 5 支持 (OpenBSD)",
    "chinese_summary": "此邮件宣布OpenBSD RAMDISK发行版为arm64架构增加了对树莓派5 Model B的支持。Marcus Glocker于2025年9月1日提交的commit修改了`distrib/arm64/iso`和`distrib/arm64/ramdisk`目录下的`Makefile`，并在`ramdisk`目录下的`install.md`和`list`中添加了条目，以启用此支持。\n\n该公告还强调了树莓派5初始支持的几个已知问题：\n\n*   **PCIe启动：** 由于缺少U-Boot支持，目前无法从PCIe存储HAT启动。\n*   **WiFi：** WiFi在树莓派5 Model B \"d0\" 板上无法工作。\n*   **主动散热器（风扇）：** 主动散热器（风扇）无法工作，因为缺少所需的pwm/clock驱动程序，但目前正在努力解决这个问题。\n\n该更改已由kettenis@和deraadt@审核并批准。"
  },
  {
    "id": "45095475",
    "title": "The future of 32-bit support in the kernel",
    "url": "https://lwn.net/SubscriberLink/1035727/4837b0d3dccf1cbb/",
    "summary": "Arnd Bergmann, the kernel's architecture maintainer, discussed the future of 32-bit support in the Linux kernel at Open Source Summit Europe 2025. He stated that 32-bit systems are becoming obsolete for new products, with support mainly needed for existing hardware. While desktop and phone systems have largely transitioned to 64-bit, embedded Linux, particularly on Arm processors, still relies heavily on 32-bit.\n\nBergmann anticipates gradually removing support for older architectures. He aims to remove support for older pre-armv7 CPUs, and potentially removing high-memory support around 2027 and nommu support around 2028.\n\nThe article highlights pain points in maintaining 32-bit support, particularly the complexities of high memory management. Solutions like separating kernel and user-space address spaces or using physical memory as a zram swap device are being explored. The year-2038 problem, while addressed in the kernel, still poses challenges due to unfixed bugs in various packages.\n\nBig-endian support, intertwined with 32-bit, faces potential removal due to obsolescence, although IBM's ongoing support for big-endian mainframe and PowerPC systems keeps it alive. Discussions around removing support for older CPU architectures and board files are ongoing. The key takeaway is that while armv7 support will be needed for at least another decade, other 32-bit architectures will likely fade away sooner, subject to ongoing discussions and user needs.\n",
    "chinese_title": "内核中32位支持的未来",
    "chinese_summary": "内核架构维护者 Arnd Bergmann 在 2025 年欧洲开源峰会上讨论了 Linux 内核中 32 位支持的未来。他表示，对于新产品而言，32 位系统正变得过时，主要需要为现有硬件提供支持。虽然桌面和手机系统已基本过渡到 64 位，但嵌入式 Linux，尤其是在 Arm 处理器上，仍然严重依赖 32 位。\n\nBergmann 预计将逐步移除对旧架构的支持。他的目标是移除对较旧的 pre-armv7 CPU 的支持，并可能在 2027 年左右移除高内存支持，在 2028 年左右移除 nommu 支持。\n\n文章强调了维护 32 位支持的痛点，特别是高内存管理的复杂性。正在探索诸如分离内核和用户空间地址空间或使用物理内存作为 zram 交换设备等解决方案。尽管内核已解决了 2038 年问题，但由于各种软件包中未修复的错误，该问题仍然构成挑战。\n\n大端支持与 32 位交织在一起，由于过时而面临潜在的移除，尽管 IBM 对大端大型机和 PowerPC 系统的持续支持使其得以存活。关于移除对旧 CPU 架构和板级文件的支持的讨论正在进行中。关键在于，尽管 armv7 支持至少还需要十年，但其他 32 位架构可能会更快地消失，这取决于正在进行的讨论和用户需求。"
  },
  {
    "id": "45093090",
    "title": "Cloudflare Radar: AI Insights",
    "url": "https://radar.cloudflare.com/ai-insights",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "Cloudflare Radar：人工智能洞察",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "45105154",
    "title": "This Month in Ladybird: August 2025",
    "url": "https://buttondown.com/ladybird/archive/this-month-in-ladybird-august-2025/",
    "summary": "This \"Month in Ladybird: August 2025\" report highlights significant progress in the Ladybird browser engine, driven by 244 merged pull requests from 43 contributors. Key achievements include welcoming new sponsors like Bastian Müller, Timely Learning, and OakHost, whose support funds the project.\n\nSignificant strides were made in Web Platform Tests (WPT), with over 8,106 new passes totaling 1,839,962. Ladybird can now run Google Sheets, a major milestone achieved by fixing a canvas update bug. Other notable implementations include the Gamepad API, Cookie Store API, and the CSS `env()` function for environment-based styling.\n\nThe team began implementing the CSS Typed OM API for structured style property manipulation, along with the `:heading` pseudo-class for targeted heading styles. Improvements were also made to CSS clamping and interpolation, WebGL support on Linux (now on par with macOS), button layout within flex containers, nested inline margin boxes, and grapheme cluster handling for text editing and cursor placement.\n\nThe article acknowledges the numerous code contributors and encourages readers to subscribe to the Ladybird Newsletter for future updates.\n",
    "chinese_title": "瓢虫月报：2025年8月",
    "chinese_summary": "Ladybird浏览器引擎月报：2025年8月\n\n本报告重点介绍了Ladybird浏览器引擎的显著进展，这得益于43位贡献者合并的244个拉取请求。主要成就包括欢迎Bastian Müller、Timely Learning和OakHost等新赞助商，他们的支持为项目提供了资金。\n\nWeb平台测试(WPT)取得了重大进展，新增通过8,106项测试，总计1,839,962项。Ladybird现在可以运行Google Sheets，这是通过修复画布更新错误实现的一个重要里程碑。其他值得注意的实现包括Gamepad API、Cookie Store API和用于基于环境的样式的CSS `env()`函数。\n\n团队开始实施用于结构化样式属性操作的CSS Typed OM API，以及用于目标标题样式的`:heading`伪类。此外，还改进了CSS钳制和插值、Linux上的WebGL支持（现在与macOS相当）、弹性容器中的按钮布局、嵌套内联边距框以及用于文本编辑和光标放置的字形簇处理。\n\n文章感谢了众多代码贡献者，并鼓励读者订阅Ladybird新闻通讯以获取未来更新。"
  },
  {
    "id": "45102905",
    "title": "Imgur's Community Is in Full Revolt Against Its Owner",
    "url": "https://www.404media.co/imgurs-community-is-in-full-revolt-against-its-owner/",
    "summary": "Imgur, the popular image hosting and social media site, is facing a revolt from its community (\"Imgurians\") due to perceived degradation of the platform under its parent company, MediaLab AI. The front page of Imgur is currently filled with anti-MediaLab AI memes, most notably images of John Oliver raising his middle finger, symbolizing the users' frustration.\n\nThe core issues stem from a decline in site functionality (broken notifications, failed image uploads), the disappearance of human moderators, and a belief that AI moderation is ineffective and leads to unfair bans. Users feel the community aspect of Imgur is being neglected in favor of profit maximization, driven by MediaLab AI's strategy of monetizing popular websites through advertising.\n\nFormer employees confirm layoffs within the Imgur team and a shift of focus to MediaLab AI's broader goals, leaving Imgur understaffed and potentially relying heavily on AI moderation. This has led to concerns about censorship and a lack of human oversight in content management.\n\nImgurians are considering a boycott on September 1st to demonstrate their dissatisfaction. MediaLab AI is already facing legal challenges from the founder of Imgur, Alan Schaaf, and other previous owners of sites MediaLab AI has acquired, who allege withheld payments as part of the acquisition agreements. The community's anger highlights the tension between a dedicated user base and a corporation focused on maximizing profits from the platform.\n",
    "chinese_title": "Imgur社区全面反抗其所有者",
    "chinese_summary": "Imgur社区因MediaLab AI母公司下平台退化而面临反抗（“Imgurians”），Imgur首页目前充斥着反MediaLab AI的表情包，尤以约翰·奥利弗竖中指的图片最为显眼，象征着用户的不满。\n\n核心问题源于网站功能下降（通知故障、图片上传失败）、人工版主消失以及对人工智能审核无效且导致不公正封禁的担忧。用户认为，MediaLab AI以广告变现热门网站的策略，导致Imgur的社区属性被忽视，转而追求利润最大化。\n\n前员工证实Imgur团队内部出现裁员，重心转移至MediaLab AI的更广泛目标，导致Imgur人手不足，可能严重依赖人工智能审核。这引发了对审查制度和内容管理缺乏人工监督的担忧。\n\nImgurians正考虑在9月1日发起抵制活动，以表达不满。MediaLab AI已面临Imgur创始人Alan Schaaf以及其他之前被MediaLab AI收购的网站所有者的法律挑战，他们声称收购协议中存在未支付款项。社群的愤怒突显了忠实用户群体与专注于平台利润最大化的公司之间的紧张关系。"
  },
  {
    "id": "45061290",
    "title": "Stone Age settlement found under the sea in Denmark",
    "url": "https://apnews.com/article/denmark-stone-age-settlements-underwater-research-d0a77a07cdad2c23bd61c3f4bb015d7d",
    "summary": "A Stone Age settlement has been discovered underwater off the coast of Denmark, offering a rare glimpse into life in Northern Europe thousands of years ago. The submerged site, located in the Baltic Sea, contains well-preserved artifacts, including tools, animal bones, and even evidence of structures like hearths and dwellings.\n\nResearchers believe the settlement dates back to the early Stone Age, likely around 5,500 years ago, when sea levels were lower. The preservation of the site is exceptional due to the oxygen-poor conditions of the seabed, which slowed down the decay of organic materials.\n\nThe discovery is significant because it provides invaluable insights into the daily lives, hunting practices, and social organization of people living in this region during that period. The recovered artifacts offer tangible evidence of their technology, diet, and environment. Underwater archaeology is crucial for understanding these submerged landscapes, which were once habitable areas. This particular find promises to reveal more about the transition from nomadic hunter-gatherer societies to settled agricultural communities in Scandinavia. The research is ongoing and scientists are continuing to explore and analyze the site to uncover more secrets of this ancient submerged settlement.\n",
    "chinese_title": "丹麦海底发现石器时代聚落",
    "chinese_summary": "丹麦海岸水下发现石器时代遗址，为研究数千年前北欧的生活提供了难得的机会。该遗址位于波罗的海，包含保存完好的文物，包括工具、动物骨骼，甚至还有壁炉和住所等结构的证据。\n\n研究人员认为，该遗址可以追溯到石器时代早期，可能在 5500 年前左右，当时的海平面较低。由于海底缺氧，有机物的腐烂速度减慢，遗址的保存状况非常出色。\n\n这一发现意义重大，因为它为人们了解当时居住在该地区的人们的日常生活、狩猎方式和社会组织提供了宝贵的见解。出土的文物为他们的技术、饮食和环境提供了有形的证据。水下考古对于理解这些曾经是可居住地区的水下景观至关重要。这一特殊发现有望揭示更多关于斯堪的纳维亚半岛从游牧狩猎采集社会向定居农业社区过渡的信息。研究正在进行中，科学家们正在继续探索和分析该遗址，以揭开这个古老的水下遗址的更多秘密。"
  },
  {
    "id": "45099124",
    "title": "WinBoat: Run Windows apps on Linux with seamless integration",
    "url": "https://github.com/TibixDev/winboat",
    "summary": "WinBoat aims to seamlessly integrate Windows applications into Linux environments. Currently in beta, it provides an intuitive interface, automated installs, and the ability to run any Windows app as a native Linux window or access a full Windows desktop. File sharing between the two systems is facilitated through home directory mounting.\n\nPrerequisites include at least 4GB RAM, 2 CPU threads, 32GB free storage in /var, KVM virtualization, Docker, Docker Compose v2, and FreeRDP with sound support. The project offers both AppImage and unpacked Linux builds. Podman and Docker Desktop are currently unsupported.\n\nThe project welcomes contributions such as bug fixes, feature improvements, and documentation updates, focusing solely on technical aspects. The project's license is MIT. WinBoat acknowledges inspiration from similar projects like WinApps, Cassowary, and dockur/windows. Contact and social media links are provided.\n",
    "chinese_title": "WinBoat：在Linux上无缝运行Windows应用",
    "chinese_summary": "WinBoat旨在将Windows应用程序无缝集成到Linux环境中。目前处于测试阶段，它提供直观的界面、自动安装，并能以原生Linux窗口运行任何Windows应用程序或访问完整的Windows桌面。两个系统之间的文件共享通过挂载主目录实现。\n\n先决条件包括至少4GB内存、2个CPU线程、/var目录下32GB的可用存储空间、KVM虚拟化、Docker、Docker Compose v2以及带有声音支持的FreeRDP。该项目提供AppImage和解压缩的Linux构建版本。目前不支持Podman和Docker Desktop。\n\n项目欢迎错误修复、功能改进和文档更新等贡献，仅关注技术方面。该项目的许可证是MIT。WinBoat承认受到了类似项目（如WinApps、Cassowary和dockur/windows）的启发。提供联系方式和社交媒体链接。"
  },
  {
    "id": "45087396",
    "title": "We should have the ability to run any code we want on hardware we own",
    "url": "https://hugotunius.se/2025/08/31/what-every-argument-about-sideloading-gets-wrong.html",
    "summary": "This article argues that the debate surrounding sideloading restrictions, particularly on platforms like Android, often misses the core issue. The author agrees with the sentiment \"I should be able to run whatever code I want on hardware I own,\" but contends that sideloading restrictions are primarily about controlling the **software** provided with the hardware, not the hardware itself. The author believes a more effective critique is to focus on the lack of ability to build and install alternative operating systems on devices.\n\nThe article highlights Apple's iOS as an example where tight hardware-software integration contributes to the product's success, cautioning against legislatively forcing changes that would fundamentally alter the iPhone's nature.\n\nInstead of fighting for unfettered access within existing operating systems, the author proposes legislation that would **require manufacturers to provide the technical support and documentation necessary to build and install alternative operating systems.** This would enable users to repurpose their hardware, such as turning a PlayStation 5 into a Linux-based emulator, even if it means sacrificing access to the manufacturer's software and services. The focus shifts from demanding the freedom to run any code within the manufacturer's OS to demanding the freedom to install and run any OS on the hardware.\n",
    "chinese_title": "我们应该有能力在自己拥有的硬件上运行任何我们想运行的代码。",
    "chinese_summary": "本文认为，围绕侧载限制的争论，尤其是在Android等平台上，往往忽略了核心问题。作者赞同“我应该能够在自己拥有的硬件上运行任何代码”的观点，但认为侧载限制主要关乎控制硬件附带的**软件**，而非硬件本身。作者认为，更有效的批评是关注缺乏在设备上构建和安装替代操作系统的能力。\n\n本文以苹果的iOS为例，强调了紧密的软硬件集成对产品成功的贡献，并告诫不要通过立法强制进行会从根本上改变iPhone性质的改变。\n\n作者建议，与其争取在现有操作系统中不受限制的访问权限，不如推动立法，**要求制造商提供构建和安装替代操作系统所需的技术支持和文档。** 这样，用户就可以重新利用他们的硬件，例如将PlayStation 5变成基于Linux的模拟器，即使这意味着牺牲访问制造商的软件和服务。重点从要求在制造商的操作系统中运行任何代码的自由，转移到要求在硬件上安装和运行任何操作系统的自由。"
  },
  {
    "id": "45099112",
    "title": "Intuitive find and replace CLI (sed alternative)",
    "url": "https://github.com/chmln/sd",
    "summary": "`sd` is presented as an intuitive, user-friendly find and replace command-line tool designed as an alternative to `sed`. It focuses on simplifying common search and replace tasks with a more readable syntax and sensible defaults.\n\nKey features highlighted include:\n\n*   **Painless Regex:** Uses familiar JavaScript/Python regex syntax.\n*   **String-Literal Mode:** Offers a direct string replacement option, eliminating the need for escaping special characters.\n*   **Readable Syntax:** Separates the find and replace expressions for clarity.\n*   **Common-Sense Defaults:** Designed for typical everyday use.\n\nThe article contrasts `sd` with `sed`, showcasing scenarios where `sd`'s syntax is more concise and easier to use, particularly when dealing with special characters like newlines and slashes.\n\nBenchmarks demonstrate `sd`'s superior performance compared to `sed` in both simple and regex replacement tasks, showing speed improvements by factors of 2.35 and 11.93 respectively.\n\nThe article includes installation instructions and provides practical examples of using `sd` for basic regex replacements, capturing groups, and file modifications, including project-wide find and replace operations and handling edge cases.\n",
    "chinese_title": "直观的查找替换命令行工具（sed替代方案）",
    "chinese_summary": "`sd`：一款直观易用的命令行查找替换工具，旨在替代 `sed`。它致力于通过更易读的语法和合理的默认设置来简化常见的查找替换任务。\n\n主要特性包括：\n\n*   **轻松的正则表达式：** 使用熟悉的 JavaScript/Python 正则表达式语法。\n*   **字符串字面量模式：** 提供直接的字符串替换选项，无需转义特殊字符。\n*   **可读性强的语法：** 将查找和替换表达式分开，以提高清晰度。\n*   **符合常识的默认设置：** 专为典型的日常使用而设计。\n\n本文将 `sd` 与 `sed` 进行对比，展示了在处理换行符和斜杠等特殊字符时，`sd` 的语法更简洁易用。\n\n基准测试表明，在简单和正则表达式替换任务中，`sd` 的性能优于 `sed`，速度分别提高了 2.35 倍和 11.93 倍。\n\n本文包括安装说明，并提供了使用 `sd` 进行基本正则表达式替换、捕获组和文件修改的实际示例，包括项目范围内的查找替换操作和处理极端情况。"
  },
  {
    "id": "45101779",
    "title": "Toronto’s underground labyrinth",
    "url": "https://www.worksinprogress.news/p/torontos-underground-labyrinth",
    "summary": "This article explores Toronto's \"Path,\" a 30-kilometer network of underground pedestrian tunnels connecting metro stations, railway stations, and office buildings in the downtown core. Developed organically over decades by individual businesses, the Path offers a unique solution to downtown congestion, particularly during peak commuting hours and harsh winter weather.\n\nUnlike typical underpasses, the Path is a well-maintained, high-end shopping mall-like environment with private security. It efficiently moves hundreds of thousands of commuters daily, complementing the existing public transportation system.\n\nThe author argues that the Path's success lies in its unique economic model. Individual landowners found pedestrian tunnels valuable enough to finance and build them independently, even if other landowners benefited. Crucially, pedestrian tunnels have a high capacity limit, preventing congestion as the network expands.\n\nThe author contrasts this with other transportation infrastructure like railways, which require unified planning due to the lack of utility in partial segments and the risk of congestion from added branches.\n\nWhile pedestrian tunnels are not always appropriate, especially where they could diminish street life, they are beneficial in high-density downtowns like Toronto's. The article concludes by questioning why more cities haven't adopted similar pedestrian metro systems, suggesting potential reasons like existing underground infrastructure or regulatory barriers. It posits that pedestrian metros could play a significant role in addressing the transport challenges of thriving downtowns.\n",
    "chinese_title": "多伦多的地下迷宫",
    "chinese_summary": "本文探讨了多伦多的“PATH”地下通道，这是一个长达30公里的地下行人隧道网络，连接市中心的地铁站、火车站和办公楼。 PATH 由各个企业在几十年间自发发展而来，为缓解市中心拥堵，尤其是在高峰通勤时段和恶劣的冬季天气，提供了一种独特的解决方案。\n\n与典型的地下通道不同，PATH 是一个维护良好、高端购物中心式的环境，并配备私人保安。 它每天高效地输送数十万通勤者，是对现有公共交通系统的补充。\n\n作者认为，PATH 的成功在于其独特的经济模式。 单个土地所有者认为行人隧道足够有价值，可以独立融资和建造，即使其他土地所有者从中受益。 至关重要的是，行人隧道具有很高的容量限制，可防止网络扩展时出现拥堵。\n\n作者将其与铁路等其他交通基础设施进行了对比，由于部分路段缺乏效用以及新增支线可能导致拥堵的风险，铁路需要统一规划。\n\n虽然行人隧道并非总是适用，尤其是在它们可能削弱街道生活的地方，但在像多伦多这样的人口密集市中心，它们是有益的。 文章最后质疑为什么更多的城市没有采用类似的行人地铁系统，并提出了潜在的原因，例如现有的地下基础设施或监管障碍。 文章认为，行人地铁可以在解决繁荣市中心的交通挑战方面发挥重要作用。"
  },
  {
    "id": "45094421",
    "title": "Adaptive LLM routing under budget constraints",
    "url": "https://arxiv.org/abs/2508.21141",
    "summary": "This arXiv article (arXiv:2508.21141) presents a novel approach to Large Language Model (LLM) routing under budget constraints. The authors, Pranoy Panda, Raghav Magazine, Chaitanya Devaguptapu, Sho Takemori, and Vishal Sharma, address the challenge of dynamically selecting the most suitable LLM for a given query when faced with varying LLM capabilities, costs, and limited real-world knowledge of optimal query-LLM pairings.\n\nInstead of treating LLM routing as a supervised learning problem with complete knowledge, they frame it as a contextual bandit problem, allowing for adaptive decision-making through bandit feedback. Their method avoids the need for exhaustive inference across all LLMs for every query.\n\nThe core innovation is the development of a shared embedding space for queries and LLMs, learned initially from offline human preference data and refined using online bandit feedback. This embedding space aligns query and LLM representations to reflect their affinity. They introduce PILOT (Preference-prior Informed Linucb fOr adaptive rouTing), an extension of LinUCB, to implement this concept.\n\nFurthermore, the paper addresses the critical aspect of user budget constraints by implementing an online cost policy modeled as a multi-choice knapsack problem, which ensures resource-efficient LLM routing.\n\nThe paper was accepted at EMNLP 2025 (findings). The authors provide access to the PDF, HTML (experimental), and TeX source of the paper.\n",
    "chinese_title": "预算约束下的自适应LLM路由",
    "chinese_summary": "这篇arXiv文章 (arXiv:2508.21141) 提出了一种在预算约束下的大型语言模型 (LLM) 路由的新方法。作者 Pranoy Panda、Raghav Magazine、Chaitanya Devaguptapu、Sho Takemori 和 Vishal Sharma 解决了在面对不同LLM能力、成本以及对最佳查询-LLM配对的有限真实世界知识时，如何为给定查询动态选择最合适LLM的挑战。\n\n他们没有将LLM路由视为具有完整知识的监督学习问题，而是将其构建为上下文老虎机问题，从而可以通过老虎机反馈进行自适应决策。他们的算法避免了对每个查询在所有LLM上进行穷举推理的需要。\n\n核心创新是开发了一个查询和LLM的共享嵌入空间，该空间最初从离线人工偏好数据中学习，并使用在线老虎机反馈进行优化。这个嵌入空间对齐了查询和LLM的表示，以反映它们的亲和力。他们引入了PILOT (Preference-prior Informed Linucb fOr adaptive rouTing)，这是LinUCB的扩展，用于实现这一概念。\n\n此外，该论文通过实施建模为多重选择背包问题的在线成本策略，解决了用户预算约束的关键方面，确保了资源高效的LLM路由。\n\n该论文被EMNLP 2025（findings）接收。作者提供了该论文的PDF、HTML（实验性）和TeX源代码的访问权限。"
  },
  {
    "id": "45096254",
    "title": "The buyer-pull and seller-push theories of sales",
    "url": "https://howtogrow.substack.com/p/the-physics-of-sales",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "买方拉动和卖方推动销售理论",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "45101300",
    "title": "What's New with Firefox 142",
    "url": "https://www.mozilla.org/en-US/firefox/142.0.1/whatsnew/?oldversion=139.0.4&utm_medium=firefox-desktop&utm_source=update&utm_campaign=142",
    "summary": "Firefox 142 introduces a redesigned experience focusing on reduced clutter and improved focus. The key feature is the introduction of vertical tabs, which can be moved to a sidebar. This sidebar provides a convenient location for managing tabs, pinning important websites, and accessing an AI assistant. The update emphasizes efficient navigation and a more organized browsing environment. In essence, Firefox 142 aims to streamline the user experience by consolidating essential tools and features into a single, accessible sidebar, allowing for a less cluttered and more focused browsing session.\n",
    "chinese_title": "Firefox 142 新特性",
    "chinese_summary": "火狐142推出全新设计，着重减少干扰，提升专注度。主要特性是引入垂直标签页，可移动至侧边栏。该侧边栏提供便捷的位置来管理标签页、固定重要网站以及访问AI助手。此次更新强调高效导航和更整洁的浏览环境。总而言之，火狐142旨在通过将基本工具和功能整合到一个易于访问的侧边栏中，从而简化用户体验，实现更少干扰和更专注的浏览会话。"
  },
  {
    "id": "45094692",
    "title": "One of Britain's largest stocks of second-hand books ever amassed",
    "url": "https://www.worldofinteriors.com/story/richard-axe-second-hand-books-yorkshire",
    "summary": "Richard Axe, a 70-something bookseller, has amassed one of Britain's largest second-hand book collections, totaling over 150,000 volumes, in a vast former youth hostel in Aysgarth, North Yorkshire. Organized meticulously by subject, the collection fills 25 rooms over four floors, requiring the building's structural integrity to withstand the weight.\n\nAxe, who resides in the Philippines part-time, operated a highly successful business by attending auctions across the UK, buying large lots and selling valuable titles while retaining books for his own collection. He specialized in both \"good quality but relatively ordinary\" and \"very specialist, expensive antiquarian books.\" Despite minimal advertising and few visitors, he consistently sold a significant amount of books weekly.\n\nThe article highlights the impact of the internet on the book market, noting that while common books have depreciated, genuinely rare items have significantly increased in value, citing examples like early editions of \"Harry Potter and the Philosopher's Stone.\"\n\nFacing declining health and age, Axe is reluctantly selling his estate and collection for £1.5 million. He fears the collection being broken up and is willing to assist the buyer in continuing his work. While prepared to sell everything, he admits to wanting to keep his collections on Yorkshire, football, Ruskin, and 18th/19th-century maps.\n",
    "chinese_title": "英国有史以来规模最大的二手书库存之一",
    "chinese_summary": "70多岁的书商理查德·阿克斯在北约克郡艾斯加斯的旧青年旅舍里，积累了英国最大的二手书藏书之一，总计超过15万册。这些书籍按主题精心整理，占据了四层楼的25个房间，需要建筑结构能够承受其重量。\n\n阿克斯在菲律宾兼职居住，他通过参加英国各地的拍卖会，购买大量图书，出售有价值的书籍，同时为自己的藏书保留图书，从而经营着一项非常成功的业务。他专注于“质量好但相对普通”和“非常专业、昂贵的古董书”。尽管广告很少，访客也不多，但他每周都能稳定地售出大量书籍。\n\n文章强调了互联网对图书市场的影响，指出虽然普通书籍已经贬值，但真正稀有的物品价值却大幅增加，例如《哈利·波特与魔法石》的早期版本。\n\n由于健康状况下降和年龄增长，阿克斯不情愿地以150万英镑的价格出售他的房产和藏书。他担心藏书会被拆分，并愿意协助买家继续他的事业。虽然准备出售一切，但他承认自己想保留关于约克郡、足球、罗斯金以及18/19世纪地图的藏书。"
  },
  {
    "id": "45102551",
    "title": "Aperiodic Tilings V: The Refinable Frontier",
    "url": "https://www.chiark.greenend.org.uk/~sgtatham/quasiblog/aperiodic-refine/",
    "summary": "Simon Tatham's \"Aperiodic Tilings V: The Refinable Frontier\" addresses the challenge of creating deterministic transducers for generating aperiodic tilings when the initial substitution system is ambiguous. Ambiguity arises when the same tile arrangement can have multiple valid neighbor configurations, preventing the creation of a deterministic transducer.\n\nThe article introduces a method to refine ambiguous substitution systems into unambiguous ones, allowing for the creation of deterministic transducers. This refinement involves increasing the number of tile types by cloning existing ones into subtypes. The key is determining where and how to apply these subtypes within the tiling rules.\n\nTatham highlights previous approaches, including the HHTPFFF system for hat tilings, which was derived by observing correspondence between the ambiguous HTPF system and an unambiguous one involving 10 hexagonal metatiles. This process revealed that certain HTPF metatiles (like H and F) could be divided into subtypes, with different arrangements of hexagon clusters.\n\nThe article emphasizes that understanding the neighborhood of tiles is crucial for the refinement process. Tatham references mathBlock's work on \"drainage\" in HTPF tiles, noting that F metatiles can exhibit multiple behaviors depending on their placement. The division of F metatiles into F0, F1, and F2, for example, corresponds to different drainage behaviors. Specifically, subtypes of F can be distinguished by looking at how hats connect around the vertices of F expansion.\n\nTatham states that he has automated the process of refining ambiguous systems, though details of the algorithm are not yet described beyond the emphasis on neighborhoods.\n",
    "chinese_title": "非周期平铺 V：可精炼的边界",
    "chinese_summary": "Simon Tatham的“非周期性平铺 V：可精炼的边界” 探讨了在初始替换系统不明确时，创建确定性转换器以生成非周期性平铺的挑战。当相同的瓷砖排列可以有多个有效的相邻配置时，就会出现不明确性，从而妨碍了确定性转换器的创建。\n\n该文章介绍了一种将不明确的替换系统精炼为明确的系统的方法，从而允许创建确定性转换器。 这种精炼涉及通过将现有瓷砖克隆为子类型来增加瓷砖类型的数量。 关键在于确定在平铺规则中在何处以及如何应用这些子类型。\n\nTatham强调了以往的方法，包括用于帽子平铺的HHTPFFF系统，该系统是通过观察不明确的HTPF系统与涉及10个六边形元瓷砖的明确系统之间的对应关系而推导出来的。 这个过程表明，某些HTPF元瓷砖（如H和F）可以被划分为子类型，具有不同的六边形簇的排列方式。\n\n文章强调，理解瓷砖的邻域对于精炼过程至关重要。 Tatham引用了mathBlock关于HTPF瓷砖中“排水”的研究，指出F元瓷砖可以根据其位置表现出多种行为。 例如，将F元瓷砖划分为F0、F1和F2对应于不同的排水行为。 具体而言，可以通过观察帽子如何连接到F扩展的顶点来区分F的子类型。\n\nTatham表示，他已经自动化了精炼不明确系统的过程，但除了强调邻域之外，该算法的细节尚未描述。"
  },
  {
    "id": "45056377",
    "title": "Python: The Documentary – An origin story [video]",
    "url": "https://www.youtube.com/watch?v=GfH4QL4VqJ0",
    "summary": "The provided text appears to be the footer of a YouTube video page, not an article describing a documentary about Python. It includes standard YouTube legal and informational links, such as:\n\n*   **Copyright:** Links to information about news, copyright and related content.\n*   **Creator/Developer Resources:** Links targeted towards content creators and developers who use YouTube.\n*   **Terms and Policies:** Links to YouTube's terms of service, privacy policy, and safety information.\n*   **About YouTube:** An explanation of how YouTube works and features in testing.\n*   **NFL Sunday Ticket:** Indicates content related to NFL games (likely streamed through YouTube).\n*   **Copyright Notice:** A general copyright notice for Google LLC (the owner of YouTube).\n\nEssentially, this is the boilerplate text found at the bottom of a YouTube page. It doesn't offer any information about the content of a documentary titled \"Python: The Documentary – An origin story.\" Therefore, there's nothing to summarize *about the documentary itself* from this information.\n",
    "chinese_title": "Python纪录片：起源故事 [视频]",
    "chinese_summary": "提供的文本看起来是 YouTube 视频页面的页脚，而不是描述关于 Python 的纪录片的文章。 它包含标准的 YouTube 法律和信息链接，例如：\n\n*   **版权：**链接到关于新闻、版权和相关内容的信息。\n*   **创作者/开发者资源：**面向使用 YouTube 的内容创作者和开发者的链接。\n*   **条款和政策：**链接到 YouTube 的服务条款、隐私政策和安全信息。\n*   **关于 YouTube：**解释 YouTube 的运作方式以及测试中的功能。\n*   **NFL Sunday Ticket：**表明与 NFL 比赛相关的内容（可能通过 YouTube 播放）。\n*   **版权声明：**Google LLC（YouTube 的所有者）的通用版权声明。\n\n本质上，这是在 YouTube 页面底部找到的样板文字。 它没有提供任何关于名为“Python：纪录片 - 一个起源故事”的纪录片内容的信息。 因此，无法从这些信息中总结*关于纪录片本身*的任何内容。"
  },
  {
    "id": "45052517",
    "title": "What brain surgery taught me about the fragile gift of consciousness",
    "url": "https://bigthink.com/business/brain-surgery-fragile-gift-of-consciousness/",
    "summary": "In \"What Brain Surgery Taught Me About the Fragile Gift of Consciousness,\" Eric Markowitz reflects on the profound experience of facing a potentially fatal brain surgery and its lasting impact on his understanding of life and consciousness. The eve of his surgery brought a heightened awareness, a connection to loved ones and the world around him, and a deep appreciation for the miracle of existence.\n\nMarkowitz's surgery was successful, but the recovery was grueling. During this time, he experienced \"survivor's euphoria\" and a renewed focus on survival and what it truly means to live consciously. He realized life is not merely a series of achievements but a fragile, interwoven system reliant on many factors, including medical and emotional support.\n\nHe redefines longevity as an active choice, a practice rooted in noticing, loving, and choosing life, even amidst pain. Markowitz shifted his priorities, valuing presence over productivity and emphasizing listening and feeling. Ultimately, he argues that consciousness extends beyond neurological function, encompassing care, love, and a willingness to confront mortality with open eyes. He concludes that kindness stems from awareness, which in turn stems from care, and this is the true gift of consciousness.\n",
    "chinese_title": "脑部手术让我领悟到意识这脆弱的馈赠",
    "chinese_summary": "在《脑部手术教会了我意识的脆弱馈赠》一文中，埃里克·马科维茨反思了面对可能致命的脑部手术这一深刻经历，以及它对理解生命和意识所产生的持久影响。 手术前夕，他产生了高度的意识，与亲人和周围世界建立了联系，并对存在的奇迹产生了深深的感激之情。\n\n马科维茨的手术很成功，但恢复过程却十分艰难。 在此期间，他经历了“幸存者狂喜”，并重新专注于生存以及有意识地生活真正意味着什么。 他意识到生命不仅仅是一系列成就，而是一个脆弱的、相互交织的系统，依赖于许多因素，包括医疗和情感支持。\n\n他将长寿重新定义为一种积极的选择，一种植根于注意、热爱和选择生命的实践，即使在痛苦中也是如此。 马科维茨改变了他的优先事项，重视临在胜过生产力，并强调倾听和感受。 最终，他认为意识超越了神经功能，涵盖了关怀、爱和以开放的心态面对死亡的意愿。 他得出结论，善良源于意识，而意识又源于关怀，这才是意识的真正馈赠。"
  },
  {
    "id": "45105081",
    "title": "OpenAI says it's scanning users' conversations and reporting content to police",
    "url": "https://futurism.com/openai-scanning-conversations-police",
    "summary": "This article discusses OpenAI's newly disclosed practice of scanning users' ChatGPT conversations for harmful content, particularly threats of violence, and potentially reporting these conversations to law enforcement. This decision comes after increasing reports of users experiencing mental health crises, including \"AI psychosis,\" potentially triggered by interactions with ChatGPT.\n\nWhile OpenAI acknowledges that it is not currently reporting self-harm cases to police to respect user privacy, the company is monitoring conversations and escalating those indicating potential harm to others. This vague policy raises concerns about what specifically triggers human review and police involvement.\n\nThe article highlights the contradiction between this surveillance and OpenAI's stance on user privacy in its ongoing lawsuit with the New York Times, where it is resisting providing ChatGPT logs to protect user data. The author emphasizes that this new rule appears to contradict the company's pro-privacy stance and that OpenAI CEO Sam Altman has admitted that using ChatGPT as a therapist or attorney doesn't confer the same confidentiality that talking to a flesh-and-blood professional would.\n\nThe author concludes that OpenAI is caught between managing the negative PR from harmful user experiences and implementing heavy-handed moderation that arguably violates user privacy. The article also alludes to a specific case of a man who fell into AI psychosis and killed his mother in a murder-suicide, suggesting this event may have prompted OpenAI's new policy.\n",
    "chinese_title": "OpenAI称正在扫描用户对话并将内容报告给警方",
    "chinese_summary": "本文探讨了OpenAI新披露的一项做法，即扫描用户ChatGPT对话中的有害内容，特别是暴力威胁，并可能将这些对话报告给执法部门。此前，越来越多的报告显示，用户在与ChatGPT互动后出现了精神健康危机，包括可能由ChatGPT引发的“人工智能精神病”。\n\n虽然OpenAI承认目前没有将自残案例报告给警方以尊重用户隐私，但该公司正在监控对话，并将那些表明可能对他人造成伤害的对话升级处理。这项模糊的政策引发了人们的担忧，即究竟什么会触发人工审核和警方介入。\n\n文章强调了这种监视与OpenAI在与《纽约时报》的持续诉讼中对用户隐私的立场之间的矛盾，该公司在诉讼中拒绝提供ChatGPT日志以保护用户数据。作者强调，这项新规定似乎与该公司支持隐私的立场相矛盾，OpenAI首席执行官Sam Altman也承认，使用ChatGPT作为治疗师或律师并不能像与真人专业人士交谈那样获得同样的保密性。\n\n作者总结说，OpenAI正处于管理有害用户体验带来的负面公关，以及实施可能侵犯用户隐私的严厉审查之间的两难境地。文章还提到了一个具体的案例，一名男子陷入人工智能精神病并杀害了他的母亲后自杀，暗示这一事件可能促使OpenAI出台了新政策。"
  },
  {
    "id": "45089072",
    "title": "The first inkjet printer was a medical device",
    "url": "https://spectrum.ieee.org/rune-elmqvist",
    "summary": "Allison Marsh's article in *History of Technology Magazine* reveals that the first inkjet printer, the Mingograph, wasn't designed for typical printing purposes but as a medical device. Invented by Rune Elmqvist, who also pioneered the implantable pacemaker, the Mingograph used a nozzle to deposit ink onto paper. This marked a significant departure from the impact-based printing methods prevalent at the time.\n\nThe article challenges the common perception of inkjet printers as purely consumer electronics, highlighting their surprising origins in the biomedical field. It emphasizes the innovative thinking of Elmqvist, a figure known for his contributions to cardiac technology, demonstrating how medical needs can spur technological advancements with applications far beyond their initial purpose. In essence, the Mingograph serves as an example of how technology can evolve unexpectedly, branching into different sectors and ultimately shaping the landscape of consumer electronics.\n",
    "chinese_title": "第一台喷墨打印机曾是一种医疗设备。",
    "chinese_summary": "艾莉森·马什在《技术史杂志》上发表的文章揭示了，第一台喷墨打印机Mingograph并非为典型的打印目的而设计，而是一种医疗设备。Mingograph由植入式心脏起搏器的先驱Rune Elmqvist发明，它使用喷嘴将墨水喷到纸上。这标志着与当时流行的撞击式打印方法有了显著的背离。\n\n这篇文章挑战了人们普遍认为喷墨打印机纯粹是消费电子产品的看法，强调了它们在生物医学领域中令人惊讶的起源。它强调了Elmqvist的创新思维，Elmqvist以其对心脏技术的贡献而闻名，展示了医疗需求如何激发技术进步，其应用远远超出了最初的目的。本质上，Mingograph就是一个例子，说明了技术如何出乎意料地发展，分支到不同的领域，并最终塑造消费电子产品的格局。"
  },
  {
    "id": "45095545",
    "title": "Thoughts on (Amazonian) leadership",
    "url": "https://www.daemonology.net/blog/2025-09-01-Thoughts-on-Amazonian-Leadership.html",
    "summary": "This article offers an outsider's perspective on Amazon's Leadership Principles, specifically Customer Obsession, Ownership, and Bias for Action. The author, an AWS customer and AWS Hero for many years, argues that while these principles are sensible, their execution sometimes falls short.\n\nRegarding Customer Obsession, the author believes Amazon has shifted from providing innovative \"building blocks\" to simply delivering what customers directly request, potentially missing opportunities for groundbreaking solutions. They cite the need for services like Paxos-as-a-service, which customers wouldn't directly request but would greatly benefit from.\n\nOn Ownership, the author finds it too narrow, advocating for consideration of the entire technological ecosystem, not just Amazon's interests. While some Amazonians exemplify this, the company's internal siloing often prevents even the stated goal of acting on behalf of the entire company.\n\nConcerning Bias for Action, the author acknowledges the importance of speed but warns against launching half-baked services, which erodes customer trust. They advocate for a \"bias for inaction\" at senior levels, suggesting \"service bar raisers\" who can veto launches that don't meet the highest standards, similar to the existing hiring \"bar raisers.\"\n\nUltimately, the author urges Amazon to listen to external perspectives like those of AWS Heroes, believing constructive criticism stems from a place of care and a desire for Amazon to improve.\n",
    "chinese_title": "关于亚马逊领导力的思考",
    "chinese_summary": "本文从局外人的角度探讨了亚马逊的领导力准则，特别是客户至上、主人翁精神和行动偏好。作者是一位多年的AWS客户和AWS英雄，他认为这些原则本身是合理的，但实际执行有时却不尽如人意。\n\n关于客户至上，作者认为亚马逊已经从提供创新的“构建块”转变为仅仅交付客户直接要求的服务，这可能会错失突破性解决方案的机会。他们认为需要像Paxos即服务这样的服务，虽然客户不会直接要求，但会从中受益匪浅。\n\n关于主人翁精神，作者认为它过于狭隘，主张考虑整个技术生态系统，而不仅仅是亚马逊的利益。虽然有些亚马逊员工确实做到了这一点，但公司内部的各自为政往往阻碍了甚至代表整个公司行事的既定目标。\n\n关于行动偏好，作者承认速度的重要性，但也警告不要推出半生不熟的服务，这会损害客户的信任。他们主张高层领导应该持有“不行动偏好”，建议设立“服务质量把关人”，他们可以否决不符合最高标准的发布，类似于现有的招聘“质量把关人”。\n\n最后，作者敦促亚马逊倾听外部视角，比如AWS英雄们的观点，认为建设性的批评源于关心和希望亚马逊变得更好的愿望。"
  },
  {
    "id": "45098411",
    "title": "Apple pulls iPhone torrent app from AltStore PAL in Europe",
    "url": "https://www.theverge.com/news/767344/apple-removes-itorrent-altstore-pal-ios-marketplace",
    "summary": "Apple has removed the iTorrent app from AltStore PAL, an alternative iOS app marketplace in the EU. This action means the developer, Daniil Vinogradov, is now blocked from distributing apps on alternative iOS stores due to Apple revoking his distribution rights.\n\nAccording to Apple spokesperson Peter Ajemian, the removal was due to compliance with government sanctions-related rules in various jurisdictions, not a ban on torrenting itself. This was communicated to the developer.\n\nThe situation highlights Apple's continued ability to control apps, even those distributed outside of its official App Store, despite the EU's Digital Markets Act aimed at fostering greater app freedom. Vinogradov previously stated that Apple removed the alternative distribution functionality from iTorrent's Developer Portal without warning or explanation.\n",
    "chinese_title": "苹果已从欧洲的 AltStore PAL 下架 iPhone 种子下载应用。",
    "chinese_summary": "苹果已将 iTorrent 应用从 AltStore PAL 下架，后者是欧盟地区的替代 iOS 应用商店。此举意味着开发者 Daniil Vinogradov 现在被禁止在替代 iOS 商店上分发应用，因为苹果撤销了他的分发权限。\n\n苹果发言人 Peter Ajemian 表示，下架的原因是为了遵守各个司法管辖区与政府制裁相关的规定，而非禁止种子下载本身。此事已告知开发者。\n\n这一情况凸显了苹果持续控制应用的能力，即便这些应用是在其官方 App Store 之外分发的，尽管欧盟的《数字市场法案》旨在促进更大的应用自由。Vinogradov 此前表示，苹果在没有警告或解释的情况下，从 iTorrent 的开发者门户中移除了替代分发功能。"
  },
  {
    "id": "45086020",
    "title": "Eternal Struggle",
    "url": "https://yoavg.github.io/eternal/",
    "summary": "The article \"Eternal Struggle\" seems to be a very short, incomplete piece. Judging by the title and the only other line, \"change background,\" the article is likely about a topic characterized by constant conflict and ongoing battle. The phrase \"Eternal Struggle\" suggests a theme that is pervasive, enduring, and fundamental, likely involving opposing forces.\n\nThe line \"change background\" could have a few interpretations:\n\n*   **Literal:** It's a technical note for a website or document, indicating a need to alter the visual background. This would make the article itself incomplete and not convey much meaning.\n*   **Figurative:** It's a metaphor, suggesting that to understand or address the eternal struggle, one must fundamentally shift perspective, assumptions, or the context in which the struggle is viewed. This would be a more insightful, albeit still vague, interpretation.\n\nWithout further context, it's difficult to ascertain the specific subject matter of the \"Eternal Struggle.\" It could relate to political conflict, inner turmoil, philosophical debates, good versus evil, or any number of ongoing struggles. The \"change background\" note implies a need for a different approach or viewpoint to fully comprehend the struggle.\n",
    "chinese_title": "永恒的斗争",
    "chinese_summary": "文章《永恒的斗争》似乎是一篇非常短且不完整的作品。从标题和仅有的一行文字“更换背景”判断，这篇文章可能关于一个以持续冲突和不断战斗为特征的主题。“永恒的斗争”暗示了一个普遍、持久和根本性的主题，可能涉及对立的力量。\n\n“更换背景”这句话可能有几种解释：\n\n*   **字面意思：** 它是网站或文档的技术注释，表明需要更改视觉背景。这将使文章本身不完整，并且没有传达太多含义。\n*   **比喻意义：** 它是一个隐喻，表明要理解或解决永恒的斗争，必须从根本上转变视角、假设或看待斗争的背景。这将是一个更深刻的，尽管仍然模糊的解释。\n\n在没有更多背景信息的情况下，很难确定《永恒的斗争》的具体主题。它可能与政治冲突、内心挣扎、哲学辩论、善与恶的斗争或任何持续的斗争有关。“更换背景”的注释暗示需要不同的方法或观点来充分理解这场斗争。"
  },
  {
    "id": "45091493",
    "title": "CocoaPods trunk read-only plan",
    "url": "https://blog.cocoapods.org/CocoaPods-Specs-Repo/",
    "summary": "Here's a summary of the CocoaPods trunk read-only plan, based on the understanding that the specs repo is being made read-only:\n\nThe CocoaPods blog post announces a significant change to the CocoaPods Specs repository, moving it to a read-only state. This change is being implemented to address the growing size and performance issues associated with the repository, which has become a bottleneck for CocoaPods users.\n\nThe core issue is that the main Specs repo contains all versions of all pods, resulting in a massive repository that is slow to clone and update. To mitigate this, CocoaPods is shifting towards a more decentralized and efficient approach.\n\nThe main points are:\n\n*   **Specs repository becomes read-only:** No new commits will be made to the primary Specs repo.\n*   **Transition to CDN-based Specs repositories:** CocoaPods is encouraging developers to utilize CDN-hosted Specs repositories, which offer faster and more scalable access to pod specifications. These CDN repos only contain the specific pods and versions a user needs.\n*   **New pods/versions require creating/using a CDN-based repo:** To make a new pod or version available, maintainers will need to create/use a CDN-based repo. They can't push directly to the main repo anymore.\n*   **Improved performance and scalability:** This change will lead to significantly faster CocoaPods operations (install, update, etc.) due to the smaller and more efficient CDN-based repositories.\n*   **Community transition:** The CocoaPods team understands this change impacts the community and aims to make this transition as smooth as possible by providing tools, documentation, and support for migrating to CDN-based repositories. This includes guidance on creating and managing private Specs repositories.\n",
    "chinese_title": "CocoaPods trunk 只读计划",
    "chinese_summary": "以下是基于Specs仓库将被设置为只读的理解，对CocoaPods trunk只读计划的总结：\n\nCocoaPods博客宣布了对CocoaPods Specs仓库的一项重大变更，将其迁移到只读状态。 实施此变更旨在解决与该仓库相关的日益增长的规模和性能问题，这些问题已成为CocoaPods用户的瓶颈。\n\n核心问题在于，主要的Specs仓库包含所有pod的所有版本，从而导致仓库庞大，克隆和更新速度缓慢。 为了缓解这种情况，CocoaPods正在转向一种更加分散和高效的方法。\n\n要点包括：\n\n*   **Specs仓库变为只读：** 不再向主要的Specs仓库进行新的提交。\n*   **过渡到基于CDN的Specs仓库：** CocoaPods鼓励开发人员使用CDN托管的Specs仓库，这些仓库可提供更快，更可扩展的pod规范访问。 这些CDN仓库仅包含用户需要的特定pod和版本。\n*   **新的pod/版本需要创建/使用基于CDN的仓库：** 要使新的pod或版本可用，维护者将需要创建/使用基于CDN的仓库。 他们不能再直接推送到主仓库。\n*   **改善的性能和可伸缩性：** 由于基于CDN的仓库规模更小，效率更高，因此此更改将大大加快CocoaPods操作（安装，更新等）。\n*   **社区过渡：** CocoaPods团队了解此更改会影响社区，并致力于通过提供用于迁移到基于CDN的仓库的工具，文档和支持，使这种过渡尽可能顺利。 这包括创建和管理私有Specs仓库的指南。"
  },
  {
    "id": "45103466",
    "title": "America Needs Tough Grading",
    "url": "https://www.wsj.com/opinion/america-needs-tough-grading-educaiton-learning-students-98fa87d5",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "美国需要严格的评分标准",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "45094953",
    "title": "Steve Ballmer Interview",
    "url": "https://www.acquired.fm/episodes/the-steve-ballmer-interview",
    "summary": "This article summarizes an interview with Steve Ballmer, former Microsoft CEO, about his 34 years at the company. Ballmer reflects on Microsoft's history, starting with the IBM DOS deal, which he considers pivotal. He describes IBM's dominance at the time and how Microsoft acquired and licensed the DOS operating system. He notes the importance of negotiating a non-exclusive deal with IBM. Ballmer also discusses the development of Microsoft's enterprise business, highlighting its success. He admits to missing opportunities in the consumer market. Ballmer expresses pride in Microsoft Office and M365, which he sees as crucial for enterprise success, while considering it both a consumer and enterprise product. The interview also touches on Ballmer's investment strategy of holding Microsoft stock, which has significantly increased his net worth since leaving the company. He also briefly discusses the LA Clippers and Intuit Dome, his other passions.\n",
    "chinese_title": "史蒂夫·鲍尔默访谈",
    "chinese_summary": "本文总结了对微软前CEO史蒂夫·鲍尔默的采访，内容关于他在该公司任职的34年。鲍尔默回顾了微软的历史，从他认为至关重要的IBM DOS交易开始。他描述了当时IBM的主导地位，以及微软如何获得并授权DOS操作系统。他指出与IBM谈判达成非独家协议的重要性。鲍尔默还讨论了微软企业业务的发展，强调了其成功。他承认错失了消费者市场的机会。鲍尔默对Microsoft Office和M365感到自豪，他认为它们对企业的成功至关重要，同时认为它们既是消费产品也是企业产品。采访还涉及鲍尔默持有微软股票的投资策略，自从他离开公司以来，这大大增加了他的净资产。他还简要讨论了他的其他爱好，洛杉矶快船队和英图伊特穹顶。"
  },
  {
    "id": "45104711",
    "title": "AI-Powered Drone Swarms Have Now Entered the Battlefield",
    "url": "https://www.wsj.com/world/ai-powered-drone-swarms-have-now-entered-the-battlefield-2cab0f05",
    "summary": "**Summary:**\n\nThe Wall Street Journal article \"AI-Powered Drone Swarms Have Now Entered the Battlefield\" discusses the growing use and impact of drone swarms in modern warfare, particularly highlighting their recent deployment in the conflict between Russia and Ukraine. These are not simple remotely controlled drones, but often AI-powered systems capable of autonomous navigation, target identification, and coordinated attacks.\n\nThe article emphasizes that these drone swarms represent a significant advancement in military technology. Their ability to overwhelm defenses with sheer numbers, operate in GPS-denied environments, and adapt to changing battlefield conditions makes them a formidable threat. Furthermore, the relatively low cost of producing and deploying these drones compared to traditional military hardware makes them accessible to a wider range of actors.\n\nThe piece points out the ethical and strategic concerns raised by the increasing use of AI in warfare. Questions arise about accountability for civilian casualties, the potential for escalation, and the difficulty of distinguishing between combatants and non-combatants. The development and deployment of these drone swarms are also seen as accelerating a global arms race in autonomous weapons systems, with potential long-term consequences for international security. The article notes that current international regulations are inadequate to address the challenges posed by this rapidly evolving technology.\n",
    "chinese_title": "人工智能无人机蜂群已进入战场",
    "chinese_summary": "**概要：**\n\n《华尔街日报》文章“人工智能无人机蜂群已进入战场”探讨了无人机蜂群在现代战争中日益增长的应用和影响，尤其强调了其最近在俄罗斯和乌克兰冲突中的部署。这些并非简单的遥控无人机，而是通常由人工智能驱动的系统，能够自主导航、识别目标和协同攻击。\n\n文章强调，这些无人机蜂群代表了军事技术的重大进步。它们凭借数量优势压倒防御、在GPS受限环境下运行以及适应不断变化的战场条件的能力，构成了一种强大的威胁。此外，与传统军事装备相比，生产和部署这些无人机的成本相对较低，使其更易于被更广泛的行为者所获取。\n\n文章指出了人工智能在战争中日益增长的应用所引发的伦理和战略担忧。对于平民伤亡的责任、局势升级的可能性以及区分战斗人员和非战斗人员的难度等问题浮出水面。这些无人机蜂群的开发和部署也被视为加速了全球自主武器系统的军备竞赛，对国际安全可能产生长期影响。文章指出，目前的国际法规不足以应对这种快速发展的技术所带来的挑战。"
  },
  {
    "id": "45093022",
    "title": "Effective learning: Rules of formulating knowledge (1999)",
    "url": "https://www.supermemo.com/en/blog/twenty-rules-of-formulating-knowledge",
    "summary": "This article, titled \"Effective learning: Rules of formulating knowledge (1999),\" is a brief announcement regarding the learning software SuperMemo. The announcement, dated December 4, 2015, originates from SuperMemo.com.\n\nThe core message of the announcement is a \"Call for requests\" regarding import and export functions in SuperMemo.com. It states that they have recently received inquiries about these functions.\n\nTherefore, the primary purpose of the announcement is to solicit feedback and requests from users related to how they would like the import and export functions to work within the SuperMemo.com learning platform. The title suggests the broader article, which is likely not included, discusses effective learning strategies related to knowledge formulation, potentially providing context for the software's purpose. However, this particular snippet only focuses on the import/export request.\n",
    "chinese_title": "有效学习：知识构建法则 (1999)",
    "chinese_summary": "这篇题为《有效学习：知识构建规则(1999)》的文章，是关于SuperMemo学习软件的简短公告。该公告日期为2015年12月4日，来源于SuperMemo.com。\n\n公告的核心信息是关于SuperMemo.com中导入和导出功能的“请求征集”。声明他们最近收到了关于这些功能的咨询。\n\n因此，该公告的主要目的是征集用户对SuperMemo.com学习平台中导入和导出功能工作方式的反馈和请求。标题暗示了更广泛的文章，该文章可能未包含，讨论了与知识构建相关的有效学习策略，可能为该软件的目的提供背景。然而，这个特定的片段只关注导入/导出请求。"
  },
  {
    "id": "45104027",
    "title": "Chatbots and AI Are Already Transforming Kids' Classrooms",
    "url": "https://www.bloomberg.com/news/features/2025-09-01/what-artificial-intelligence-looks-like-in-america-s-classrooms",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "聊天机器人和人工智能已在改变孩子们的课堂",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "45089256",
    "title": "What Is Complexity in Chess?",
    "url": "https://lichess.org/@/Toadofsky/blog/what-is-complexity/pKo1swFh",
    "summary": "This article by Toadofsky critiques FM David Peng's research paper \"A Metric of Chess Complexity,\" which aims to quantify chess complexity using centipawn loss as determined by Stockfish. Toadofsky expresses skepticism about the paper's core propositions: that complexity can be reduced to a single, transferable metric based on centipawn loss, and that this metric can be used in real-time to determine position difficulty.\n\nHe questions the logical validity of various conclusions drawn from these propositions, suggesting that most require further research. While agreeing that complexity information could enrich spectating and post-game analysis, he challenges the claims regarding non-tactical puzzle generation, automated opening preparation, training material development, diagnostic chess exams, personalized AI opponents, and tailoring openings to exploit an opponent's complexity preferences.\n\nToadofsky highlights advancements in neural network chess engines (Stockfish-NNUE), suggesting the need to update conclusions based on older Stockfish versions. He also points out issues with endgame scaling in evaluations.\n\nWhile critical, Toadofsky is impressed with the research's focus on differing difficulty levels for players of varying skill levels. He suggests improvements such as incorporating segmented Stockfish evaluations (material, pawn structure, etc.), WDL statistics, Stockfish-NNUE data, modeling checks and time remaining, and incorporating human versus engine games. He hopes that a complexity metric will eventually be implemented, but not first by cheaters.\n",
    "chinese_title": "象棋中的复杂性是什么？",
    "chinese_summary": "Toadofsky 对彭大卫 FM 的论文“象棋复杂性度量”一文进行了评论，该论文旨在利用 Stockfish 评估的中心兵损失来量化象棋复杂性。Toadofsky 对论文的核心命题表示怀疑：即将复杂性简化为基于中心兵损失的单一、可转移的度量标准，并实时使用该指标来确定局面难度。\n\n他对从这些命题中得出的各种结论的逻辑有效性提出质疑，认为大多数结论需要进一步研究。虽然他同意复杂性信息可以丰富观赛和赛后分析，但他对非战术谜题生成、自动开局准备、训练材料开发、诊断性象棋考试、个性化 AI 对手以及定制开局以利用对手的复杂性偏好等方面的说法提出了挑战。\n\nToadofsky 强调了神经网络象棋引擎（Stockfish-NNUE）的进步，建议需要根据较旧的 Stockfish 版本更新结论。他还指出了评估中残局缩放的问题。\n\n尽管持批评态度，Toadofsky 对该研究关注不同技能水平玩家的不同难度等级印象深刻。他建议改进，例如纳入分段的 Stockfish 评估（材料、兵结构等）、WDL 统计数据、Stockfish-NNUE 数据、建模将军和剩余时间，以及纳入人与引擎的对局。他希望复杂性度量最终能够实现，但不要首先被作弊者使用。"
  },
  {
    "id": "45057974",
    "title": "The ABC Programming Language",
    "url": "https://homepages.cwi.nl/~steven/abc/",
    "summary": "The ABC Programming Language is an interactive, user-friendly language designed as a better alternative to BASIC. It emphasizes ease of learning and use for both beginners and experienced programmers. Originating from task analysis of programming, ABC boasts a clean syntax and powerful capabilities.\n\nKey features of the language include a small set of data types, strong typing without explicit declarations, no artificial limitations on data sizes, top-down programming support, and indentation-based nesting, resulting in compact code (often significantly smaller than equivalent Pascal or C programs).\n\nThe ABC environment offers a consistent user interface across various operations (command execution, editing, input), eliminates the need for file management (procedures/variables persist), and features a generalized undo mechanism.\n\nThe article provides links to implementations for various platforms (PC, Unix, Mac, Raspberry Pi), online resources like the ABC Programmer's Handbook, and publications detailing the language's design and use. It also highlights the influence of ABC on the design of Python. Finally, it mentions the availability of past newsletters and provides contact information.\n",
    "chinese_title": "ABC编程语言",
    "chinese_summary": "ABC编程语言是一种交互式的、用户友好的语言，旨在成为BASIC的更佳替代品。它强调易于学习和使用，适用于初学者和经验丰富的程序员。ABC源于编程的任务分析，拥有简洁的语法和强大的功能。\n\n该语言的关键特性包括：少量的数据类型、无需显式声明的强类型、数据大小没有人为限制、顶层编程支持以及基于缩进的嵌套，从而产生紧凑的代码（通常比等效的Pascal或C程序小得多）。\n\nABC环境在各种操作（命令执行、编辑、输入）中提供一致的用户界面，消除了文件管理的需求（过程/变量持久存在），并具有通用的撤销机制。\n\n本文提供了各种平台（PC、Unix、Mac、Raspberry Pi）的实现链接，以及像《ABC程序员手册》这样的在线资源，和详细介绍该语言设计和使用的出版物。它还强调了ABC对Python设计的影响。最后，它提到了过去新闻通讯的可用性并提供了联系方式。"
  },
  {
    "id": "45105495",
    "title": "How to Argue with an AI Booster",
    "url": "https://www.wheresyoured.at/how-to-argue-with-an-ai-booster/",
    "summary": "This article is a critical takedown of AI boosterism, arguing that many proponents of AI are driven by symbolic allegiance rather than a genuine understanding or practical use of the technology. The author contends that AI boosters often resort to vague claims, gaslighting, and victimhood narratives to defend their position, ignoring evidence of AI's limited impact and practical failures.\n\nThe piece cites a recent MIT study revealing that 95% of generative AI pilots in companies fail to produce a return on investment and debunks common AI myths, such as AI replacing jobs and transforming businesses. The author also criticizes boosters for drawing flawed comparisons between AI and past technological advancements like the internet and smartphones.\n\nA key argument is that AI boosters often lack a comprehensive knowledge of AI's capabilities, yet insist on its disruptive potential without providing concrete examples. The author accuses them of condescension and spreading misinformation, driven by a desire to feel superior and validated.\n\nThe article provides readers with a \"Table of Contents\" for quick reference to specific arguments and booster \"quips,\" equipping them with tools to effectively challenge AI booster narratives and highlight the technology's limitations. Ultimately, the author argues that generative AI is not achieving the transformative changes promised and that many of its problems cannot simply be \"learned\" out of.\n",
    "chinese_title": "如何与AI吹捧者争论",
    "chinese_summary": "本文批判了人工智能吹捧之风，认为许多人工智能支持者并非出于对该技术的真正理解或实际应用，而是受象征性忠诚的驱使。作者认为，人工智能吹捧者经常诉诸含糊不清的说法、精神操控和受害者叙事来捍卫自己的立场，无视人工智能影响有限和实际失败的证据。\n\n文章引用了麻省理工学院最近的一项研究，该研究表明，公司中 95% 的生成式人工智能试点项目未能产生投资回报，并揭穿了常见的人工智能神话，例如人工智能取代工作岗位和改变业务。作者还批评吹捧者将人工智能与互联网和智能手机等过去的科技进步进行有缺陷的比较。\n\n一个关键论点是，人工智能吹捧者往往缺乏对人工智能能力的全面了解，却坚持认为它具有颠覆性的潜力，但没有提供具体的例子。作者指责他们居高临下，散布虚假信息，其动机是渴望感到优越和获得认可。\n\n文章为读者提供了一个“目录”，以便快速参考具体的论点和吹捧者的“妙语”，从而使他们能够有效地挑战人工智能吹捧的叙事，并突出该技术的局限性。最终，作者认为，生成式人工智能并未实现承诺的变革性变化，并且其许多问题无法简单地通过“学习”来解决。"
  },
  {
    "id": "45091119",
    "title": "UK's largest battery storage facility at Tilbury substation",
    "url": "https://www.nationalgrid.com/national-grid-connects-uks-largest-battery-storage-facility-tilbury-substation",
    "summary": "National Grid has connected the UK's largest battery energy storage system (BESS), the 300MW Thurrock Storage project, to its Tilbury substation in Essex. Developed by Statera Energy, the 600MWh facility can power up to 680,000 homes and balances electricity supply and demand by storing surplus clean energy for later use.\n\nThe connection marks a symbolic shift from coal to renewable energy at the Tilbury site, which previously served coal-fired power stations. National Grid reinforced the substation with new protection and control systems to handle the battery's load.\n\nJohn Twomey of National Grid highlighted the vital role of battery storage in Britain's clean energy transition. Tom Vernon, Statera Energy CEO, emphasized the importance of BESS capacity for supporting the grid when renewable energy generation is low.\n\nNational Grid is also working to connect Statera's 450MW Thurrock Flexible Generation facility at the same substation. This project follows the recent energization of the 373MW Cleve Hill Solar Park in Kent, which National Grid connected to its Cleve Hill substation. These projects reflect the increasing importance of renewable energy sources and the infrastructure needed to support them.\n",
    "chinese_title": "蒂尔伯里变电站的英国最大电池储能设施",
    "chinese_summary": "国家电网已将其位于埃塞克斯郡蒂尔伯里变电站连接至英国最大的电池储能系统（BESS），即300兆瓦的瑟罗克储能项目。该项目由Statera Energy开发，拥有600兆瓦时的容量，可为多达68万户家庭供电，并通过储存多余的清洁能源以供日后使用来平衡电力供需。\n\n此次连接标志着蒂尔伯里场地从煤炭到可再生能源的象征性转变，该场地此前曾为燃煤发电站提供服务。国家电网通过新的保护和控制系统加强了变电站，以处理电池的负载。\n\n国家电网的John Twomey强调了电池储能在英国清洁能源转型中的重要作用。 Statera Energy首席执行官Tom Vernon强调了BESS容量对于在可再生能源发电量低时支持电网的重要性。\n\n国家电网还在努力将Statera的450兆瓦瑟罗克灵活发电设施连接到同一变电站。该项目紧随最近在肯特郡启动的373兆瓦克利夫山太阳能园区之后，国家电网已将其连接到克利夫山变电站。这些项目反映了可再生能源及其支持基础设施日益增长的重要性。"
  },
  {
    "id": "45061376",
    "title": "India's billion-dollar e-waste empire",
    "url": "https://restofworld.org/2025/india-e-waste-recycling-electronics/",
    "summary": "Yashraj Sharma's article \"India's Billion-Dollar E-Waste Empire\" delves into the complex and often hazardous reality of e-waste recycling in India. Fueled by a booming electronics sector, the industry is worth $1.5 billion, yet 95% of its workforce, estimated at a million people, operates informally. These workers face meager pay, dangerous conditions, and exposure to toxins while dismantling electronics to recover valuable materials like gold and copper.\n\nThe article highlights the stark contrast between the informal sector, exemplified by the Khatta dumpsite in Delhi controlled by powerful figures like Asif Malik, and the emerging formal sector, represented by companies like Recyclekaro. Khatta exemplifies the difficulties faced by workers like Noor, who earns very little and suffers health consequences working in dangerous conditions.\n\nNew government regulations aim to formalize the industry, mandating that electronics producers pay recyclers for proper disposal and meet recycling quotas. However, these policies, which have benefited companies like Recyclekaro, are facing pushback from tech manufacturers who argue they increase compliance costs.\n\nThe article emphasizes the environmental concerns and financial opportunities presented by India's massive e-waste problem. It suggests that India's success or failure in formalizing its e-waste industry could serve as a model or a warning for global e-waste management. The continued dominance of the informal sector poses both environmental and health risks, while formalization holds the promise of a more sustainable and responsible approach.\n",
    "chinese_title": "印度价值十亿美元的电子垃圾帝国",
    "chinese_summary": "Yashraj Sharma的文章《印度十亿美元的电子垃圾帝国》深入探讨了印度电子垃圾回收的复杂且往往危险的现实。在蓬勃发展的电子行业的推动下，该行业的价值达15亿美元，但估计有100万人的劳动力中，95%的人在非正规部门工作。这些工人在拆解电子产品以回收黄金和铜等有价值的材料时，面临着微薄的工资、危险的工作条件以及接触有毒物质的风险。\n\n这篇文章突出了非正规部门与新兴正规部门之间的鲜明对比。非正规部门以德里Khatta垃圾场为例，该垃圾场由阿西夫·马利克等有权势的人物控制；正规部门则以Recyclekaro等公司为代表。Khatta体现了像努尔这样的工人所面临的困境，他在危险的条件下工作，收入微薄，并且健康受到影响。\n\n新的政府法规旨在使该行业正规化，强制要求电子产品生产商向回收商支付适当处置费用，并达到回收配额。然而，这些政策已经使Recyclekaro等公司受益，但正面临着科技制造商的抵制，他们认为这些政策增加了合规成本。\n\n这篇文章强调了印度大规模电子垃圾问题带来的环境问题和金融机遇。它认为，印度在电子垃圾行业正规化方面的成功或失败，可以为全球电子垃圾管理提供一个模式或警告。非正规部门的持续主导地位带来了环境和健康风险，而正规化则有望实现更可持续和负责任的方法。"
  },
  {
    "id": "45096140",
    "title": "Towards Memory Specialization: A Case for Long-Term and Short-Term RAM",
    "url": "https://arxiv.org/abs/2508.02992",
    "summary": "This paper, \"Towards Memory Specialization: A Case for Long-Term and Short-Term RAM,\" argues for a shift away from the traditional memory hierarchy toward specialized memory architectures. The authors, including Peijing Li, propose that the stagnation in SRAM and DRAM scaling, leading to memory becoming a dominant cost factor, necessitates exploring alternative memory types that can optimize performance based on application-specific access patterns.\n\nThe central idea is to introduce two new memory classes with explicit operating system support: Long-Term RAM (LtRAM) and Short-Term RAM (StRAM). LtRAM would be optimized for read-intensive data with long lifecycles, while StRAM would be designed for frequently accessed transient data with short lifecycles.\n\nThe paper explores potential underlying device technologies that could implement these memory classes and how they could be integrated into existing systems. It also highlights the critical research challenges that need to be addressed to realize this vision of more efficient and scalable computing systems capable of meeting future demands. In essence, the authors advocate for a non-hierarchical memory system utilizing specialized memory types to overcome the limitations of current SRAM and DRAM technologies.\n",
    "chinese_title": "面向内存专用化：长期和短期RAM案例",
    "chinese_summary": "迈向内存专用化：一种关于长短期RAM的案例，本文认为应从传统内存层级结构转向专用内存架构。包括李培景在内的作者提出，SRAM和DRAM扩展的停滞导致内存成为主要的成本因素，因此有必要探索能够根据特定应用访问模式优化性能的替代内存类型。\n\n核心思想是引入两种新的内存类别，并提供明确的操作系统支持：长期RAM (LtRAM) 和短期RAM (StRAM)。LtRAM将针对具有长生命周期的读取密集型数据进行优化，而StRAM将针对具有短生命周期的频繁访问的瞬态数据进行设计。\n\n本文探讨了可能实现这些内存类别的潜在底层设备技术，以及如何将它们集成到现有系统中。它还强调了实现更高效和可扩展的计算系统以满足未来需求所需的关键研究挑战。本质上，作者提倡一种利用专用内存类型的非分层内存系统，以克服当前SRAM和DRAM技术的局限性。"
  },
  {
    "id": "45092925",
    "title": "Google AI Overview made up an elaborate story about me",
    "url": "https://bsky.app/profile/bennjordan.bsky.social/post/3lxojrbessk2z",
    "summary": "生成摘要时出错",
    "chinese_title": "谷歌AI概述编造了一个关于我的离奇故事。",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45087971",
    "title": "Nintendo Switch 2 Dock USB-C Compatibility",
    "url": "https://www.lttlabs.com/blog/2025/08/30/nintendo-switch-2-dock",
    "summary": "生成摘要时出错",
    "chinese_title": "Nintendo Switch 2 Dock USB-C Compatibility",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45092324",
    "title": "Tetris is NP-hard even with O(1) rows or columns (2020) [pdf]",
    "url": "https://martindemaine.org/papers/ThinTetris_JIP/paper.pdf",
    "summary": "生成摘要时出错",
    "chinese_title": "Tetris is NP-hard even with O(1) rows or columns (2020) [pdf]",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45093693",
    "title": "Search engine referral report for 2025 Q2",
    "url": "https://radar.cloudflare.com/reports/search-engine-market-share-2025-q2",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "2025年第二季度搜索引擎引荐报告",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "45093956",
    "title": "A Unique, High-Tech (Family) Computer",
    "url": "https://nicole.express/2025/a-computer-in-your-home.html",
    "summary": "生成摘要时出错",
    "chinese_title": "A Unique, High-Tech (Family) Computer",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45089938",
    "title": "Preserving Order in Concurrent Go Apps: Three Approaches Compared",
    "url": "https://destel.dev/blog/preserving-order-in-concurrent-go",
    "summary": "生成摘要时出错",
    "chinese_title": "Preserving Order in Concurrent Go Apps: Three Approaches Compared",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45095923",
    "title": "Reports of Gmail security issue are inaccurate",
    "url": "https://blog.google/products/workspace/gmail-security-protections/",
    "summary": "生成摘要时出错",
    "chinese_title": "Reports of Gmail security issue are inaccurate",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45059593",
    "title": "The Tragic End of Natalia Nagovitsyna's Ordeal on Pobeda Peak",
    "url": "https://explorersweb.com/tragic-end-of-natalia-nagovitsynas-ordeal-on-pobeda-peak/",
    "summary": "生成摘要时出错",
    "chinese_title": "The Tragic End of Natalia Nagovitsyna's Ordeal on Pobeda Peak",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45095826",
    "title": "I Was Wrong About Data Center Water Consumption",
    "url": "https://www.construction-physics.com/p/i-was-wrong-about-data-center-water",
    "summary": "生成摘要时出错",
    "chinese_title": "I Was Wrong About Data Center Water Consumption",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45063789",
    "title": "Animated Text in Voxel Space",
    "url": "https://www.splats.com/watch/635",
    "summary": "生成摘要时出错",
    "chinese_title": "Animated Text in Voxel Space",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45059888",
    "title": "An adventure in writing compatible systems",
    "url": "https://turso.tech/blog/an-adventure-in-writing-compatible-systems",
    "summary": "生成摘要时出错",
    "chinese_title": "An adventure in writing compatible systems",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45097263",
    "title": "Detecting and countering misuse of AI",
    "url": "https://www.anthropic.com/news/detecting-countering-misuse-aug-2025",
    "summary": "生成摘要时出错",
    "chinese_title": "Detecting and countering misuse of AI",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45096173",
    "title": "Desert Graves (2021)",
    "url": "https://www.desertmountaineer.com/2021/08/06/graves/",
    "summary": "生成摘要时出错",
    "chinese_title": "Desert Graves (2021)",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45098867",
    "title": "The Wetware Crisis: The Thermocline of Truth (2008)",
    "url": "https://brucefwebster.com/2008/04/15/the-wetware-crisis-the-themocline-of-truth/",
    "summary": "生成摘要时出错",
    "chinese_title": "The Wetware Crisis: The Thermocline of Truth (2008)",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45082731",
    "title": "“This telegram must be closely paraphrased before being communicated to anyone”",
    "url": "https://history.stackexchange.com/questions/79371/this-telegram-must-be-closely-paraphrased-before-being-communicated-to-anyone",
    "summary": "生成摘要时出错",
    "chinese_title": "“This telegram must be closely paraphrased before being communicated to anyone”",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45102246",
    "title": "Monitoring bands during the Norwegian national day parade – Using fiberoptics",
    "url": "https://www.nature.com/articles/s41598-025-97017-z",
    "summary": "生成摘要时出错",
    "chinese_title": "Monitoring bands during the Norwegian national day parade – Using fiberoptics",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45105614",
    "title": "32GB of RAM on track to become the new majority for gamers",
    "url": "https://www.tomshardware.com/pc-components/ram/32gb-of-ram-on-track-to-become-the-new-majority-for-gamers-steam-survey-indicates-shift-could-occur-before-the-end-of-the-year",
    "summary": "生成摘要时出错",
    "chinese_title": "32GB of RAM on track to become the new majority for gamers",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45080313",
    "title": "A Crack in the Cosmos",
    "url": "https://drb.ie/articles/a-crack-in-the-cosmos/",
    "summary": "生成摘要时出错",
    "chinese_title": "A Crack in the Cosmos",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45092605",
    "title": "Zfsbackrest: Pgbackrest style encrypted backups for ZFS filesystems",
    "url": "https://github.com/gargakshit/zfsbackrest",
    "summary": "生成摘要时出错",
    "chinese_title": "Zfsbackrest: Pgbackrest style encrypted backups for ZFS filesystems",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45102647",
    "title": "Neptune Balls",
    "url": "https://www.bbc.com/future/article/20250901-why-plastic-filled-neptune-balls-are-washing-up-on-beaches",
    "summary": "生成摘要时出错",
    "chinese_title": "Neptune Balls",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45092895",
    "title": "Git for Music – Using Version Control for Music Production (2023)",
    "url": "https://grechin.org/2023/05/06/git-and-reaper.html",
    "summary": "生成摘要时出错",
    "chinese_title": "Git for Music – Using Version Control for Music Production (2023)",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45093765",
    "title": "The time picker on the iPhone's alarm app isn't circular, it's just a long list",
    "url": "https://old.reddit.com/r/interestingasfuck/comments/1n5lztw/the_time_picker_on_the_iphones_alarm_app_isnt/",
    "summary": "生成摘要时出错",
    "chinese_title": "The time picker on the iPhone's alarm app isn't circular, it's just a long list",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45053029",
    "title": "Trade in War",
    "url": "https://news.mit.edu/2025/why-countries-trade-each-other-while-fighting-mariya-grinberg-book-0828",
    "summary": "生成摘要时出错",
    "chinese_title": "Trade in War",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45063904",
    "title": "Using JWT to establish a trusted context for Row Level Security",
    "url": "https://vondra.me/posts/using-jwt-to-establish-trusted-context-for-rls/",
    "summary": "生成摘要时出错",
    "chinese_title": "Using JWT to establish a trusted context for Row Level Security",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45095002",
    "title": "Thunk: Build Rust program to support Windows XP, Vista and more",
    "url": "https://github.com/felixmaker/thunk",
    "summary": "生成摘要时出错",
    "chinese_title": "Thunk: Build Rust program to support Windows XP, Vista and more",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45057734",
    "title": "A review of Nim 2: The good and bad with example code",
    "url": "https://miguel-martin.com/blog/nim2-review",
    "summary": "生成摘要时出错",
    "chinese_title": "A review of Nim 2: The good and bad with example code",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45098399",
    "title": "Corruption and Control: Turkmenistan turned internet censorship into a business",
    "url": "https://blog.torproject.org/Corruption-Control-Turkmenistan-internet-censorship-business/",
    "summary": "生成摘要时出错",
    "chinese_title": "Corruption and Control: Turkmenistan turned internet censorship into a business",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45059272",
    "title": "Can You Develop Film in a Jägerbomb?",
    "url": "https://petapixel.com/2025/08/04/can-you-develop-film-in-a-jagerbomb/",
    "summary": "生成摘要时出错",
    "chinese_title": "Can You Develop Film in a Jägerbomb?",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45074248",
    "title": "Cognitive load is what matters",
    "url": "https://github.com/zakirullin/cognitive-load",
    "summary": "生成摘要时出错",
    "chinese_title": "Cognitive load is what matters",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45061702",
    "title": "The Qweremin",
    "url": "https://www.linusakesson.net/qweremin/index.php",
    "summary": "生成摘要时出错",
    "chinese_title": "The Qweremin",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45101884",
    "title": "Scientists stunned as strange islands & hidden springs appear in Great Salt Lake",
    "url": "https://www.sciencedaily.com/releases/2025/08/250831010526.htm",
    "summary": "生成摘要时出错",
    "chinese_title": "Scientists stunned as strange islands & hidden springs appear in Great Salt Lake",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45053555",
    "title": "Bash Prompts Collection",
    "url": "https://www.gilesorr.com/bashprompt/prompts/",
    "summary": "生成摘要时出错",
    "chinese_title": "Bash Prompts Collection",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45052191",
    "title": "Bayes, Bits and Brains",
    "url": "https://bayesbitsbrains.github.io/",
    "summary": "生成摘要时出错",
    "chinese_title": "Bayes, Bits and Brains",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45092734",
    "title": "Show HN: Simple modenized .NET NuGet server reached RC",
    "url": "https://github.com/kekyo/nuget-server",
    "summary": "生成摘要时出错",
    "chinese_title": "Show HN: Simple modenized .NET NuGet server reached RC",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45084193",
    "title": "Plastic Before Plastic: How gutta-percha shaped the 19th century",
    "url": "https://worldhistory.substack.com/p/plastic-before-plastic",
    "summary": "生成摘要时出错",
    "chinese_title": "Plastic Before Plastic: How gutta-percha shaped the 19th century",
    "chinese_summary": "生成摘要时出错"
  }
]