[
  {
    "id": "44701555",
    "title": "Dumb Pipe",
    "url": "https://www.dumbpipe.dev/",
    "summary": "\"Dumb Pipe\" addresses the challenge of establishing direct device-to-device connections in modern network environments, where NAT and changing network conditions make it difficult. It provides a solution that facilitates a connection between devices A and B, effectively punching through NATs without requiring pre-configured IP addresses or complex setup. The system utilizes on-the-fly node identifiers, simplifying the process of establishing a connection. Furthermore, Dumb Pipe maintains the connection's integrity even as network conditions fluctuate, ensuring continued communication. The core principle of Dumb Pipe focuses solely on establishing and maintaining the connection; the user retains complete control over the data sent across the established pipe and the purpose of the connection. In essence, Dumb Pipe offers a simple and robust solution for creating a direct communication channel between devices, leaving the application logic and data handling entirely to the user.\n",
    "chinese_title": "哑管道",
    "chinese_summary": "“哑管道”旨在解决现代网络环境中建立直接设备到设备连接的难题，在这些环境中，NAT和不断变化的网络条件使得连接难以实现。它提供了一种解决方案，可以促进设备A和设备B之间的连接，有效地穿透NAT，而无需预配置的IP地址或复杂的设置。该系统利用即时节点标识符，简化了建立连接的过程。此外，“哑管道”即使在网络条件波动的情况下也能保持连接的完整性，确保持续通信。“哑管道”的核心原则仅专注于建立和维护连接；用户保留对通过已建立管道发送的数据以及连接目的的完全控制权。本质上，“哑管道”提供了一种简单而强大的解决方案，用于创建设备之间的直接通信通道，并将应用程序逻辑和数据处理完全留给用户。"
  },
  {
    "id": "44702046",
    "title": "Claude Code Is a Slot Machine",
    "url": "https://rgoldfinger.com/blog/2025-07-26-claude-code-is-a-slot-machine/",
    "summary": "Roger Goldfinger's article \"Claude Code Is A Slot Machine\" explores how AI coding tools are changing the software engineering experience. The author reminisces about the \"joyful\" process of traditional coding, emphasizing the satisfaction of bringing ideas to life through meticulous work. However, AI disrupts this flow, replacing the continuous high with intermittent rewards and periods of waiting.\n\nGoldfinger introduces the concepts of the \"Conjurer\" (broad strokes, less depth) and the \"Scribe\" (detailed understanding) in software engineering, highlighting the importance of knowing when to employ each approach. AI tools allow engineers to operate more like Conjurers, quickly generating code but eventually requiring Scribe-like attention to detail for functionality.\n\nThe author argues that the popularity of AI coding tools stems from the \"slot machine effect\" – intermittent rewards, fractured attention, and an inherent desire to avoid deep thinking. The experience of waiting and prompting AI can feel like inserting \"a few more cents\" for another chance at realizing a vision. While acknowledging the potential of AI to supercharge creation, Goldfinger expresses concern that it can also lead to a less engaged and less thoughtful approach to software engineering, driven by the allure of quick wins.\n",
    "chinese_title": "Claude 代码是个老虎机",
    "chinese_summary": "罗杰·戈德芬格的文章《Claude 代码是一台老虎机》探讨了人工智能编码工具如何改变软件工程的体验。作者回忆了传统编码的“快乐”过程，强调了通过细致的工作将想法变为现实的满足感。然而，人工智能打断了这个流程，用间歇性的奖励和等待期取代了持续的高峰体验。\n\n戈德芬格介绍了软件工程中的“魔术师”（大刀阔斧，深度不足）和“抄写员”（细致理解）的概念，强调了了解何时采用何种方法的重要性。人工智能工具使工程师更像魔术师，可以快速生成代码，但最终需要像抄写员一样关注细节才能实现功能。\n\n作者认为，人工智能编码工具的流行源于“老虎机效应”——间歇性的奖励、分散的注意力以及避免深度思考的内在渴望。等待和提示人工智能的体验感觉就像投入“多几分钱”，以再次有机会实现愿景。虽然承认人工智能具有增强创造力的潜力，但戈德芬格也表达了担忧，它也可能导致一种参与度较低、思考较少的软件工程方法，而这种方法是由快速获胜的诱惑驱动的。"
  },
  {
    "id": "44658323",
    "title": "Return of wolves to Yellowstone has led to a surge in aspen trees",
    "url": "https://www.livescience.com/animals/land-mammals/return-of-wolves-to-yellowstone-has-led-to-a-surge-in-aspen-trees-unseen-for-80-years",
    "summary": "The reintroduction of wolves to Yellowstone National Park in 1995, after being eradicated in the 1930s, has led to a resurgence of aspen trees in the park's northern range. Before the wolves' return, an unfettered elk population of around 18,000 decimated aspen saplings, preventing new growth.  Ecologists found no aspen saplings in surveys conducted in the 1990s.\n\nA recent study published in *Forest Ecology and Management* showed that, with the wolf population increasing and the elk population decreasing to around 2,000, a third of aspen stands surveyed now have a large number of tall aspen saplings, the first new growth seen since the 1940s. Another third show patches of tall saplings. These trees are resilient enough to reproduce, either through shoots from their roots or through seed production.\n\nWhile bison numbers have increased and could potentially hinder aspen recovery in some areas, the overall resurgence demonstrates the impact of a top predator on the ecosystem. Aspen are considered a keystone species, supporting a diverse range of plants, insects, birds, and animals like beavers. The increase in aspen trees suggests a broader positive impact on the park's biodiversity. The reintroduction of wolves to Yellowstone highlights the ecological benefits of restoring large carnivores to ecosystems.\n",
    "chinese_title": "黄石公园狼群回归，促使白杨树激增。",
    "chinese_summary": "1995年将狼重新引入黄石国家公园，使其在20世纪30年代灭绝后得以恢复，这导致公园北部地区的白杨树重新繁荣。在狼回归之前，大约18,000只不受控制的麋鹿种群摧毁了白杨树苗，阻止了新的生长。生态学家在20世纪90年代进行的调查中没有发现白杨树苗。\n\n最近发表在《森林生态与管理》上的一项研究表明，随着狼的数量增加，麋鹿的数量减少到大约2,000只，现在三分之一的白杨林地都生长着大量高大的白杨树苗，这是自20世纪40年代以来首次出现的新生长。另外三分之一的林地则显示出成片的高大树苗。这些树木具有足够的恢复力，可以通过根部的萌芽或种子生产进行繁殖。\n\n虽然野牛的数量有所增加，并且可能在某些地区阻碍白杨的恢复，但整体的复苏表明了顶级掠食者对生态系统的影响。白杨被认为是关键物种，支持着各种植物、昆虫、鸟类和动物，如海狸。白杨树的增加表明对公园生物多样性的更广泛的积极影响。将狼重新引入黄石公园突出了将大型食肉动物恢复到生态系统中的生态效益。"
  },
  {
    "id": "44699393",
    "title": "Linux on Snapdragon X Elite: Linaro and Tuxedo Pave the Way for ARM64 Laptops",
    "url": "https://www.linaro.org/blog/linux-on-snapdragon-x-elite/",
    "summary": "This article highlights the progress in bringing Linux support to Snapdragon X Elite ARM64 laptops, spearheaded by Linaro, Qualcomm, and TUXEDO Computers. It acknowledges Qualcomm's collaboration with Microsoft for Windows on Arm, but points out the need for native Linux support, similar to the availability on x86 laptops.\n\nSignificant strides have been made in the Linux kernel to support several commercial laptops using the Snapdragon X Elite, thanks to contributions from Linaro, Qualcomm, and the community. Key functionalities like GPU acceleration, external display output, USB, audio, camera, thermal management, Wi-Fi, Bluetooth, and suspend/resume are being improved.\n\nWhile Linux lags behind Windows on these devices, and x86 Linux support, Linaro aims to enhance the out-of-the-box experience on popular Linux distributions like Debian and Fedora. Ubuntu is already developing installable distributions, with Fedora following suit.\n\nTUXEDO Computers is committed to releasing a Qualcomm laptop with pre-installed Linux, partnering with Linaro to address missing features and refine the user experience. A prototype, the TUXEDO Elite 14 Gen1, was showcased at Linaro Connect 2025, demonstrating stable multitasking with emulated x86-64 games. This collaboration aims to expand choice and innovation in the ARM64 laptop market, offering users a power-efficient alternative to x86 notebooks.\n",
    "chinese_title": "骁龙X Elite上的Linux：Linaro和Tuxedo为ARM64笔记本电脑铺平道路",
    "chinese_summary": "本文重点介绍了Linaro、高通和TUXEDO Computers在为骁龙X Elite ARM64笔记本电脑带来Linux支持方面取得的进展。文章承认高通与微软在Windows on Arm上的合作，但指出需要类似x86笔记本电脑上提供的原生Linux支持。\n\n由于Linaro、高通和社区的贡献，Linux内核在支持使用骁龙X Elite的几款商用笔记本电脑方面取得了重大进展。GPU加速、外部显示输出、USB、音频、摄像头、散热管理、Wi-Fi、蓝牙和挂起/恢复等关键功能正在得到改进。\n\n虽然在这些设备上Linux落后于Windows和x86 Linux的支持，但Linaro旨在增强Debian和Fedora等流行Linux发行版的开箱即用体验。Ubuntu已经在开发可安装的发行版，Fedora也在紧随其后。\n\nTUXEDO Computers致力于发布一款预装Linux的高通笔记本电脑，并与Linaro合作解决缺失的功能并完善用户体验。原型机TUXEDO Elite 14 Gen1在Linaro Connect 2025上展示，演示了模拟x86-64游戏的稳定多任务处理。此次合作旨在扩大ARM64笔记本电脑市场的选择和创新，为用户提供一个节能的x86笔记本电脑替代方案。"
  },
  {
    "id": "44700923",
    "title": "Beetroot juice lowers blood pressure in older people by changing oral microbiome",
    "url": "https://news.exeter.ac.uk/faculty-of-health-and-life-sciences/beetroot-juice-lowers-blood-pressure-in-older-people-by-changing-oral-microbiome/",
    "summary": "This study by the University of Exeter reveals that nitrate-rich beetroot juice lowers blood pressure in older adults due to changes in their oral microbiome. Researchers compared responses of older adults (60s and 70s) to younger adults (under 30) after consuming concentrated beetroot juice shots twice daily for two weeks, versus a placebo. The older group experienced a significant reduction in blood pressure, an effect not seen in the younger group.\n\nThe key finding is that the beetroot juice altered the oral microbiome in both groups, but the changes were different. In older adults, the juice suppressed harmful bacteria like Prevotella and promoted beneficial bacteria like Neisseria. This shift is believed to improve the conversion of nitrate to nitric oxide, essential for healthy blood vessel function and blood pressure regulation.\n\nThe study highlights that as people age, they produce less nitric oxide and are more likely to have high blood pressure. Dietary nitrate supplementation, through vegetables like beetroot, spinach, and kale, could offer a potential solution by modifying the oral microbiome. Researchers suggest this study paves the way for further investigations into the influence of lifestyle factors and biological sex on how individuals respond to dietary nitrate. The research was funded by a BBSRC Industrial Partnership Award.\n",
    "chinese_title": "甜菜根汁通过改变口腔微生物群来降低老年人的血压",
    "chinese_summary": "埃克塞特大学研究显示，富含硝酸盐的甜菜根汁通过改变老年人口腔微生物群，降低其血压。研究人员比较了老年人（60多岁和70多岁）和年轻人（30岁以下）在每天两次服用浓缩甜菜根汁或安慰剂两周后的反应。老年组血压显著降低，而年轻组未观察到此效果。\n\n主要发现是甜菜根汁改变了两组的口腔微生物群，但改变不同。在老年人中，甜菜根汁抑制了有害细菌，如普雷沃菌属，并促进了有益细菌，如奈瑟菌属。这种转变被认为可以改善硝酸盐向一氧化氮的转化，这对健康的血管功能和血压调节至关重要。\n\n该研究强调，随着年龄增长，人们产生的一氧化氮减少，患高血压的可能性增加。通过甜菜根、菠菜和羽衣甘蓝等蔬菜进行膳食硝酸盐补充，可以通过改变口腔微生物群提供潜在的解决方案。研究人员认为，这项研究为进一步研究生活方式因素和生理性别如何影响个体对膳食硝酸盐的反应铺平了道路。该研究由BBSRC工业伙伴关系奖资助。"
  },
  {
    "id": "44698928",
    "title": "Chemical process produces critical battery metals with no waste",
    "url": "https://spectrum.ieee.org/nmc-battery-aspiring-materials",
    "summary": "Aspiring Materials, a New Zealand-based company, is pioneering a chemical process to extract valuable battery metals from olivine with zero waste. The company operates a pilot plant where they break down olivine into more useful materials. This process aims to provide a sustainable source of critical metals needed for battery production. The article, published on EnergyNews, highlights the potential of this technology to transform olivine into several useful materials.\n",
    "chinese_title": "无废料化学工艺生产关键电池金属",
    "chinese_summary": "新西兰公司Aspiring Materials率先采用一种化学方法，从橄榄石中零浪费地提取有价值的电池金属。该公司运营一家试验工厂，将橄榄石分解为更有用的材料。该工艺旨在为电池生产提供可持续的关键金属来源。《能源新闻》上发表的文章强调了该技术将橄榄石转化为多种有用材料的潜力。"
  },
  {
    "id": "44699052",
    "title": "4k NASA employees opt to leave agency through deferred resignation program",
    "url": "https://www.kcrw.com/news/shows/npr/npr-story/nx-s1-5481304",
    "summary": "In July 2025, nearly 4,000 NASA employees opted to leave the agency through the Trump administration's deferred resignation program, amounting to an estimated 20% reduction in NASA's workforce. This will shrink the agency from 18,000 to 14,000 employees, accounting for normal attrition of 500 other workers. The resignations follow the Trump administration's plan to reduce the federal workforce, guided by the Department of Government Efficiency (DOGE). The full impact and timeline for the reduction are unclear.\n\nWhile the administration proposed a 24% budget cut for NASA in its fiscal year 2026 budget request, the House and Senate are considering maintaining current funding levels. However, a recent \"One Big Beautiful Bill Act\" signed into law allocates nearly $10 billion in additional funding for NASA through 2032, supporting Mars missions and lunar return plans.\n\nThe proposed budget cuts and changes have drawn criticism from scientists and organizations like The Planetary Society, led by Bill Nye, who argue it undermines NASA's potential for unity and collaboration. Over 300 current and former NASA employees signed the \"Voyager Declaration\" criticizing \"rapid and wasteful changes\" including program and research cuts, urging the interim administrator to reject the proposed changes.\n",
    "chinese_title": "4千名NASA员工选择通过延期辞职计划离开机构",
    "chinese_summary": "2025年7月，近4000名美国国家航空航天局（NASA）雇员选择通过特朗普政府的延迟辞职计划离开该机构，估计相当于NASA员工总数的20%减少。这将使该机构的员工人数从18000人缩减到14000人，其中包含正常减员的500名其他员工。此次辞职是特朗普政府旨在减少联邦员工人数计划的一部分，该计划由政府效率部（DOGE）指导。目前还不清楚此次裁员的全部影响和时间表。\n\n虽然政府在其2026财年预算请求中提议削减NASA 24%的预算，但众议院和参议院正在考虑维持目前的资金水平。然而，最近签署生效的《一个伟大而美丽的法案》为NASA在2032年前额外拨款近100亿美元，以支持火星任务和月球返回计划。\n\n拟议的预算削减和变革招致了科学家和包括比尔·奈领导的行星学会在内的组织的批评，他们认为这破坏了NASA在团结和合作方面的潜力。超过300名现任和前任NASA雇员签署了《旅行者宣言》，批评“快速且浪费的变革”，包括项目和研究的削减，并敦促临时局长拒绝拟议的变革。"
  },
  {
    "id": "44665662",
    "title": "Katharine Graham: The Washington Post",
    "url": "https://fs.blog/knowledge-project-podcast/outliers-katharine-graham/",
    "summary": "This article summarizes the life and leadership of Katharine Graham, who took over the Washington Post in 1963 and transformed it into a highly successful and influential news organization. Despite lacking experience and confidence initially, Graham fearlessly led the Post through pivotal moments, including the publication of the Pentagon Papers and the Watergate scandal, ultimately challenging the Nixon administration.\n\nThe article highlights ten key lessons gleaned from Graham's life and leadership. These include her \"velvet hammer\" approach to leadership, prioritizing values over short-term gains, ignoring external criticism, demonstrating resilience, seeking mentorship (specifically from Warren Buffett), granting editorial freedom with transparency, embracing challenges without feeling qualified, prioritizing long-term vision, maintaining focus on core principles, and honoring her commitments.\n\nGraham's story demonstrates that courage, integrity, and a commitment to truth can overcome any initial lack of experience. Her leadership at the Washington Post solidified the newspaper's reputation for investigative journalism and its vital role in holding power accountable, proving that prioritizing principles ultimately drives long-term success.\n",
    "chinese_title": "凯瑟琳·格雷厄姆：《华盛顿邮报》",
    "chinese_summary": "本文概述了凯瑟琳·格雷厄姆的生平和领导力，她于1963年接管《华盛顿邮报》，并将其转型为一个高度成功且具有影响力的新闻机构。尽管最初缺乏经验和信心，格雷厄姆仍勇敢地带领《邮报》度过了关键时刻，包括发布“五角大楼文件”和“水门事件”，最终挑战了尼克松政府。\n\n本文重点介绍了从格雷厄姆的生平和领导力中汲取的十个关键教训。这些教训包括她“天鹅绒铁锤”式的领导方式、优先考虑价值观而非短期利益、无视外界批评、展现韧性、寻求指导（特别是来自沃伦·巴菲特的指导）、以透明的方式赋予编辑自由、在不具备资格的情况下拥抱挑战、优先考虑长期愿景、坚持核心原则以及信守承诺。\n\n格雷厄姆的故事表明，勇气、正直和对真相的承诺可以克服任何最初缺乏的经验。她在《华盛顿邮报》的领导巩固了该报在调查新闻方面的声誉，以及其在追究权力责任方面的重要作用，证明了优先考虑原则最终能够推动长期成功。"
  },
  {
    "id": "44699452",
    "title": "Hierarchical Reasoning Model",
    "url": "https://arxiv.org/abs/2506.21734",
    "summary": "This arXiv article (arXiv:2506.21734) introduces the Hierarchical Reasoning Model (HRM), a novel recurrent architecture designed to address the challenges of complex reasoning in AI. The authors, Guan Wang et al., highlight the limitations of current Chain-of-Thought (CoT) techniques used in large language models (LLMs), such as brittle task decomposition, high data demands, and latency.\n\nInspired by the human brain's hierarchical processing, HRM uses two interconnected recurrent modules: a high-level module for slow, abstract planning and a low-level module for rapid, detailed computations. This allows the model to achieve significant computational depth while maintaining training stability and efficiency, performing sequential reasoning tasks in a single forward pass without explicit supervision.\n\nNotably, HRM achieves exceptional performance on complex reasoning tasks with only 27 million parameters and 1000 training samples, without pre-training or CoT data. It demonstrates near-perfect performance on challenging tasks like complex Sudoku puzzles and optimal pathfinding in large mazes. The model also outperforms significantly larger models on the Abstraction and Reasoning Corpus (ARC), a benchmark for artificial general intelligence. The authors conclude that HRM demonstrates significant potential as a step toward universal computation and general-purpose reasoning systems. The paper is categorized under Artificial Intelligence (cs.AI) and Machine Learning (cs.LG).\n",
    "chinese_title": "层级推理模型",
    "chinese_summary": "这篇arXiv文章 (arXiv:2506.21734) 介绍了分层推理模型 (HRM)，一种旨在解决人工智能复杂推理挑战的新型循环架构。Guan Wang 等作者强调了当前大型语言模型 (LLM) 中使用的思维链 (CoT) 技术的局限性，例如任务分解脆弱、数据需求高和延迟。\n\n受人脑分层处理的启发，HRM 使用两个相互连接的循环模块：一个用于缓慢、抽象规划的高级模块和一个用于快速、详细计算的低级模块。这使得该模型能够在保持训练稳定性和效率的同时，实现显著的计算深度，并在没有显式监督的情况下，在单个前向传递中执行顺序推理任务。\n\n值得注意的是，HRM 仅使用 2700 万个参数和 1000 个训练样本，在没有预训练或 CoT 数据的情况下，在复杂的推理任务上实现了卓越的性能。它在具有挑战性的任务（如复杂的数独谜题和大型迷宫中的最佳路径寻找）上表现出接近完美的性能。该模型还在抽象和推理语料库 (ARC)（一种通用人工智能的基准）上优于规模大得多的模型。作者的结论是，HRM 显示出作为迈向通用计算和通用推理系统的重要一步的巨大潜力。该论文被归类于人工智能 (cs.AI) 和机器学习 (cs.LG) 之下。"
  },
  {
    "id": "44658722",
    "title": "High-performance RISC-V processors: UltraRISC UR-DP1000, Zhihe A210, SpacemIT K3",
    "url": "https://www.cnx-software.com/2025/07/22/three-high-performance-risc-v-processors-to-watch-in-h2-2025-ultrarisc-ur-dp1000-zizhe-a210-and-spacemit-k3/",
    "summary": "This article previews three high-performance RISC-V processors expected to launch in 2025: UltraRISC UR-DP1000, Zhihe A210, and SpacemIT K3.\n\nThe UltraRISC UR-DP1000 is an octa-core 64-bit SoC featuring eight UR-CP100 cores (\"RV64GCBHX\") running at up to 2.0 GHz, arranged in two 4-core clusters with 4MB L3 cache each (16MB total). It is RVA22 compliant (excluding V extension) and supports hardware virtualization. It will be featured on the Shenzhen Milk-V Technology's Titan mini-ITX motherboard, offering DDR4 ECC memory support, PCIe 4.0 expansion slots, and UEFI firmware with support for various Linux distributions. Mainline Linux support is expected by Q4 2026.\n\nThe Zhihe A210 is another octa-core 64-bit RISC-V CPU designed for edge server applications. It boasts a Unified Computing Architecture (UCA) and is fully RVA23 Profile compliant, supporting numerous extensions including Hypervisor, Vector, BF16, CFI, and Sv57. It features up to 12 TOPS (INT8) AI inference capability and is optimized for large-capacity DDR memory to support Mixture of Experts (MoE) models.  The company claims it outperforms some Intel and Arm instructions for specific tasks. Sample testing applications are open.\n\nThe SpacemIT K3 is based on X100 cores. The X100 core is an RVA23 64-bit RISC-V processor offering 2.5 TOPS @ INT8 AI computing power and 256-bit vector computing. It is a 12-stage, four-issue out-of-order execution core with performance figures of 9.0 SPECint2006/GHz and 7.7 CoreMarks/MHz. It supports virtualization, RAS features, and security features like Meltdown and Spectre attack resistance. The K3 is expected to offer up to 64 cores in multi-core, multi-cluster configuration.\n\nWhile details are limited, the article anticipates more information will be released in the latter half of 2025, with these platforms likely becoming usable sometime in 2026.\n",
    "chinese_title": "高性能RISC-V处理器：UltraRISC UR-DP1000、智核A210、SpacemIT K3",
    "chinese_summary": "本文预览了预计于 2025 年发布的三款高性能 RISC-V 处理器：UltraRISC UR-DP1000、智合 A210 和 SpacemIT K3。\n\nUltraRISC UR-DP1000 是一款八核 64 位 SoC，采用八个 UR-CP100 内核（“RV64GCBHX”），运行频率高达 2.0 GHz，分为两个 4 核集群，每个集群具有 4MB L3 缓存（总计 16MB）。它符合 RVA22 标准（不包括 V 扩展）并支持硬件虚拟化。它将出现在 Shenzhen Milk-V Technology 的 Titan mini-ITX 主板上，提供 DDR4 ECC 内存支持、PCIe 4.0 扩展槽以及支持各种 Linux 发行版的 UEFI 固件。预计将在 2026 年第四季度获得主线 Linux 支持。\n\n智合 A210 是另一款专为边缘服务器应用设计的八核 64 位 RISC-V CPU。它拥有统一计算架构 (UCA)，并且完全符合 RVA23 规范，支持包括 Hypervisor、Vector、BF16、CFI 和 Sv57 在内的众多扩展。它具有高达 12 TOPS (INT8) 的 AI 推理能力，并针对大容量 DDR 内存进行了优化，以支持混合专家模型 (MoE)。该公司声称，对于特定任务，它优于某些 Intel 和 Arm 指令。 样本测试应用程序已开放。\n\nSpacemIT K3 基于 X100 内核。 X100 内核是一款 RVA23 64 位 RISC-V 处理器，提供 2.5 TOPS @ INT8 的 AI 计算能力和 256 位向量计算。它是一个 12 级、四发射的乱序执行内核，性能指标为 9.0 SPECint2006/GHz 和 7.7 CoreMarks/MHz。它支持虚拟化、RAS 功能以及 Meltdown 和 Spectre 攻击防御等安全功能。预计 K3 将在多核、多集群配置中提供多达 64 个内核。\n\n虽然细节有限，但本文预计将在 2025 年下半年发布更多信息，这些平台可能会在 2026 年的某个时候变得可用。"
  },
  {
    "id": "44669026",
    "title": "BlueOS Kernel – Written in Rust, compatible with POSIX",
    "url": "https://github.com/vivoblueos/kernel",
    "summary": "The BlueOS kernel is a security-focused, lightweight, and general-purpose operating system kernel written in Rust. It aims for POSIX compatibility and supports the Rust standard library. The kernel currently supports ARM32, ARM64, RISCV32, and RISCV64 architectures, with QEMU support available and hardware board support in development.\n\nThe repository is structured into several key components:\n\n*   `apps`: Contains shell and example applications built using Rust's `std` library.\n*   `book`: Offers technical documentation and tutorials for kernel development.\n*   `build`: Includes build templates and scripts for project compilation.\n*   `kernel`: The core kernel repository, encompassing CPU architecture support, scheduling, synchronization primitives, asynchronous execution, memory management, file systems, networking, and device subsystems.\n*   `libc`: BlueOS's C standard library header files, forked from `rust-lang/libc`.\n*   `librs`: Implements the BlueOS kernel's C standard library using Rust.\n\nDevelopers interested in working with the BlueOS kernel should consult the provided documentation to prepare the build environment, build a customized Rust toolchain, and get started with kernel development. More in-depth technical information can be found in the kernel book.\n",
    "chinese_title": "BlueOS内核 – 使用Rust编写，兼容POSIX",
    "chinese_summary": "BlueOS内核是一个用Rust编写的、注重安全性、轻量级且通用的操作系统内核。它旨在实现POSIX兼容性，并支持Rust标准库。该内核目前支持ARM32、ARM64、RISCV32和RISCV64架构，提供QEMU支持，硬件板支持正在开发中。\n\n该仓库结构分为几个关键组件：\n\n*   `apps`: 包含使用Rust `std`库构建的Shell和示例应用程序。\n*   `book`: 提供内核开发的技术文档和教程。\n*   `build`: 包含用于项目编译的构建模板和脚本。\n*   `kernel`: 核心内核仓库，包含CPU架构支持、调度、同步原语、异步执行、内存管理、文件系统、网络和设备子系统。\n*   `libc`: BlueOS的C标准库头文件，fork自`rust-lang/libc`。\n*   `librs`: 使用Rust实现BlueOS内核的C标准库。\n\n有兴趣使用BlueOS内核的开发者应查阅提供的文档，准备构建环境，构建自定义的Rust工具链，并开始内核开发。更多深入的技术信息可以在内核手册中找到。"
  },
  {
    "id": "44698899",
    "title": "The future is not self-hosted, but self-sovereign",
    "url": "https://www.robertmao.com/blog/en/the-future-is-not-self-hosted-but-self-sovereign",
    "summary": "Based on the provided title and minimal content (\"The future is NOT Self-Hosted, but Self-Sovereign You need to enable JavaScript to run this app.\"), it's difficult to provide a comprehensive summary. However, we can infer the central argument:\n\nThe article likely argues that **\"self-sovereignty\" is a more important and desirable goal than \"self-hosting\" in the future of technology and online interactions.**\n\nHere's a breakdown of what that might mean:\n\n*   **Self-Hosting (what it likely rejects):** Self-hosting typically refers to hosting your own data, applications, and services on infrastructure you control. While offering more control, it also comes with complexities, technical burdens, and potential security vulnerabilities. The article likely argues this approach is not the ultimate solution for individual empowerment.\n\n*   **Self-Sovereignty (what it likely advocates):** Self-sovereignty, in this context, probably means having full control and ownership over one's digital identity, data, and online interactions, regardless of where the data is physically stored. It emphasizes autonomy and the ability to manage one's digital life without being beholden to centralized authorities or specific hosting providers.\n\nThe article probably posits that:\n\n*   True freedom and empowerment come not just from controlling the infrastructure, but from controlling the data and identity itself.\n*   Decentralized technologies and protocols that prioritize individual rights and data ownership are more crucial than simply running one's own servers.\n*   Future solutions should focus on enabling individuals to interact, transact, and participate online with full autonomy, privacy, and control over their digital assets and identities.\n\nEssentially, the article suggests that while self-hosting might be a step in the right direction, self-sovereignty represents a more profound and ultimately more empowering vision for the future of technology.\n",
    "chinese_title": "未来并非自主托管，而是自主主权。",
    "chinese_summary": "基于提供的标题和极简内容（“未来不是自托管，而是自决主权你需要启用JavaScript才能运行此应用。”），很难提供全面的总结。然而，我们可以推断出中心论点：\n\n这篇文章很可能认为，**在未来的技术和在线互动中，“自决主权”比“自托管”更重要，也更令人向往。**\n\n以下是对其含义的分解：\n\n*   **自托管（可能反对的）：** 自托管通常指的是在你控制的基础设施上托管你自己的数据、应用程序和服务。虽然提供更多的控制权，但它也带来了复杂性、技术负担和潜在的安全漏洞。这篇文章很可能认为这种方法不是个人赋权的最终解决方案。\n\n*   **自决主权（可能倡导的）：** 在这种语境下，自决主权可能意味着完全控制和拥有个人的数字身份、数据和在线互动，而不管数据实际存储在哪里。它强调自主性以及管理个人数字生活的能力，而不受制于中心化权威或特定的托管提供商。\n\n这篇文章可能认为：\n\n*   真正的自由和赋权不仅仅来自控制基础设施，而是来自控制数据和身份本身。\n*   优先考虑个人权利和数据所有权的去中心化技术和协议比仅仅运行自己的服务器更重要。\n*   未来的解决方案应侧重于使个人能够以完全的自主性、隐私以及对其数字资产和身份的控制来在线互动、交易和参与。\n\n本质上，这篇文章表明，虽然自托管可能是朝着正确方向迈出的一步，但自决主权代表着一个更深刻、最终也更有赋权意义的技术未来愿景。"
  },
  {
    "id": "44698754",
    "title": "Fast and cheap bulk storage: using LVM to cache HDDs on SSDs",
    "url": "https://quantum5.ca/2025/05/11/fast-cheap-bulk-storage-using-lvm-to-cache-hdds-on-ssds/",
    "summary": "This article details how to use Linux's Logical Volume Manager (LVM) to create a storage solution that combines the speed of SSDs with the capacity and affordability of HDDs. The author favors this approach over alternatives like bcache and EnhanceIO, citing familiarity and concerns about data corruption.\n\nThe core concept involves using an SSD as a cache for frequently accessed data, while less frequently used data resides on HDDs. To ensure data reliability, the HDDs are configured in a RAID 1 array using `mdadm`. The article provides step-by-step instructions for partitioning the HDDs to ensure compatibility and avoid size discrepancies between drives, as well as setting up the RAID 1 array and configuring it for automatic assembly on boot.\n\nThe process also involves partitioning the SSD to create a dedicated partition for the LVM cache. The author guides the reader through resizing an existing partition on the SSD to make room for the cache partition.\n\nFinally, the article touches upon the importance of redundancy and data protection by choosing RAID 1 over RAID 0, even for easily replaceable data, to minimize downtime in the event of drive failure. It also explains that even easily replaceable data will still require effort to replace.\n",
    "chinese_title": "快速廉价的海量存储：使用LVM在SSD上缓存HDD",
    "chinese_summary": "本文详细介绍了如何使用 Linux 的逻辑卷管理器 (LVM) 创建一种存储解决方案，该方案将 SSD 的速度与 HDD 的容量和经济性相结合。作者偏好这种方法，而不是 bcache 和 EnhanceIO 等替代方案，理由是熟悉度和对数据损坏的担忧。\n\n其核心概念是使用 SSD 作为频繁访问数据的缓存，而较少使用的数据则驻留在 HDD 上。为了确保数据可靠性，HDD 使用 `mdadm` 配置在 RAID 1 阵列中。本文提供了分步说明，用于对 HDD 进行分区以确保兼容性并避免驱动器之间的大小差异，以及设置 RAID 1 阵列并将其配置为在启动时自动组装。\n\n该过程还涉及对 SSD 进行分区，以创建一个专用于 LVM 缓存的分区。作者指导读者调整 SSD 上现有分区的大小，为缓存分区腾出空间。\n\n最后，本文还谈到了通过选择 RAID 1 而不是 RAID 0 来实现冗余和数据保护的重要性，即使对于易于替换的数据也是如此，以最大程度地减少驱动器发生故障时的停机时间。它还解释说，即使是易于替换的数据仍然需要付出努力才能进行替换。"
  },
  {
    "id": "44698733",
    "title": "Smallest particulate matter air quality sensor for ultra-compact IoT devices",
    "url": "https://www.bosch-sensortec.com/news/worlds-smallest-particulate-matter-sensor-bmv080.html",
    "summary": "Bosch Sensortec has introduced the BMV080, the world's smallest PM2.5 air quality sensor, designed for use in ultra-compact IoT devices. Addressing the issue of poor indoor air quality, which is often significantly more polluted than outdoor air, this tiny sensor (4.2 x 3.5 x 3 mm³) provides accurate, actionable data on PM2.5 particulate concentration.\n\nUnlike traditional PM2.5 sensors that rely on fans, the BMV080 utilizes an innovative fanless design based on ultra-compact lasers with integrated photodiodes, making it silent, maintenance-free, and more reliable. This makes it suitable for integration into wearables, smart thermostats, smart speakers, and other compact devices.\n\nThe BMV080 provides real-time, localized information, enabling users to identify and respond to poor air quality. Examples include triggering ventilation when cooking fumes are detected or activating air purifiers when wood burning releases particulates. The sensor empowers individuals to take informed actions to improve their health and well-being. The BMV080 can also be easily integrated into smart home and building systems to provide air quality notifications.\n",
    "chinese_title": "适用于超紧凑型物联网设备的最小颗粒物空气质量传感器",
    "chinese_summary": "博世Sensortec推出全球最小PM2.5空气质量传感器BMV080，专为超紧凑型物联网设备设计。该微型传感器（4.2 x 3.5 x 3 毫米³）解决了室内空气质量通常比室外空气污染更严重的问题，可提供关于PM2.5颗粒物浓度的准确、可执行数据。\n\n与依赖风扇的传统PM2.5传感器不同，BMV080采用基于超紧凑型激光器和集成光电二极管的创新无风扇设计，使其安静、免维护且更可靠。因此，它适用于集成到可穿戴设备、智能恒温器、智能扬声器和其他紧凑型设备中。\n\nBMV080提供实时的本地化信息，使用户能够识别并应对不良空气质量。例如，在检测到烹饪油烟时触发通风，或在燃烧木材释放颗粒物时激活空气净化器。该传感器使个人能够采取明智的行动来改善他们的健康和福祉。BMV080还可以轻松集成到智能家居和楼宇系统中，以提供空气质量通知。"
  },
  {
    "id": "44699980",
    "title": "Constrained languages are easier to optimize",
    "url": "https://jyn.dev/constrained-languages-are-easier-to-optimize/",
    "summary": "This article argues that constrained languages are easier to optimize than general-purpose languages with raw pointers. Modern languages often prioritize expressiveness over optimization, leading to performance bottlenecks. The author contends that languages with stricter constraints, like Haskell, Futhark, and SQL, enable more aggressive optimizations due to features like referential transparency and static type information.\n\nHaskell's stream fusion and Futhark's restrictions on array operations are highlighted as examples. While acknowledging Haskell's performance reputation, the author emphasizes its user-definable optimizations. Futhark, despite being highly restrictive, demonstrates significant speedups over C in specific domains due to its unboxed integers and static array size requirements. SQL's query planner and performance improvements over time further illustrate the benefits of declarative and constrained languages.\n\nThe author advocates for a shift away from the \"one language fits all\" approach. While acknowledging the occasional necessity of raw pointers for specific memory optimizations, they argue that these needs are rare. Rust is praised as a step in the right direction with its opt-in unsafe code and functional paradigms. Ultimately, the author proposes building meta-languages that facilitate easy interoperability between different languages, enabling developers to select the optimal tool for each performance-critical task. The core idea is that by understanding why compilers struggle with certain optimizations, we can design languages or language subsets that are easier to optimize, leading to faster code execution.\n",
    "chinese_title": "受限语言更容易优化。",
    "chinese_summary": "受限语言比带有原始指针的通用语言更易于优化。现代语言通常优先考虑表达力而非优化，导致性能瓶颈。作者认为，像Haskell、Futhark和SQL这样具有更严格约束的语言，由于引用透明性和静态类型信息等特性，可以实现更积极的优化。\n\nHaskell的流融合和Futhark对数组操作的限制被强调为例子。虽然承认Haskell的性能声誉，但作者强调了其用户可定义的优化。Futhark虽然高度受限，但由于其未装箱的整数和静态数组大小要求，在特定领域表现出比C显著的加速。SQL的查询计划器和随着时间的推移的性能改进进一步说明了声明式和受限语言的优势。\n\n作者提倡放弃“一种语言适用于所有”的方法。虽然承认在特定内存优化中偶尔需要原始指针，但他们认为这些需求很少。Rust因其可选的不安全代码和函数式范式而受到赞扬，被认为是朝着正确方向迈出的一步。最终，作者建议构建元语言，以促进不同语言之间的轻松互操作性，使开发人员能够为每个性能关键型任务选择最佳工具。核心思想是，通过理解编译器在某些优化中遇到的困难，我们可以设计更容易优化的语言或语言子集，从而更快地执行代码。"
  },
  {
    "id": "44699421",
    "title": "When we get Komooted",
    "url": "https://bikepacking.com/plog/when-we-get-komooted/",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "当我们被Komooted",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "44701574",
    "title": "The many, many, many JavaScript runtimes of the last decade",
    "url": "https://buttondown.com/whatever_jamie/archive/the-many-many-many-javascript-runtimes-of-the-last-decade/",
    "summary": "This article explores the explosion of JavaScript runtimes and engines in the last decade, driven by the need for precise fitness for task across diverse environments like edge computing, microcontrollers, and native applications.\n\n**Edge Computing:** The shift from server-side JavaScript with Node.js to the edge started with AWS Lambda, but Cloudflare Workers, with its purpose-built minimal runtime, truly ignited the market. This spurred the creation of numerous runtimes like Deno Deploy, Bun, WinterJS, and LLRT, each optimized for edge tasks and leveraging different JavaScript engines such as V8, JavaScriptCore, SpiderMonkey, and QuickJS.\n\n**Microcontrollers:** Due to the limited resources of microcontrollers, specialized slim engines like Duktape, Espruino, JerryScript, and elk emerged, enabling JavaScript execution on these devices. These engines powered runtimes like IoT.js, Microlattice.js, and low.js, catering to the Internet of Things.\n\n**Polyglot Engines:** The demand to call JavaScript from other languages led to the development of polyglot engines integrated with established VMs. Examples include Rhino, Nashorn, Graal.js (for Java/JVM), jint (for .NET), and various engines for Python, Ruby, Go, Rust, and Zig, often offering two-way language interop. JavaScript engines are even being built in JavaScript, such as Porffor, which compiles to WASM.\n\n**Native Apps:** JavaScript's suitability for GUIs led to its adoption in native app development, resulting in cross-platform frameworks. Web view-based apps (PhoneGap/Cordova, Ionic, Electron) initially gained traction but are now being surpassed by React Native, which renders native views. React Native has become increasingly engine-agnostic with JSI, supporting engines like Hermes, JSC, V8, QuickJS, and Chakra, and is poised to embrace Node-API.\n",
    "chinese_title": "过去十年中涌现的众多 JavaScript 运行时",
    "chinese_summary": "过去十年，受边缘计算、微控制器和原生应用等不同环境对任务精确适应性需求的驱动，JavaScript 运行时和引擎呈现爆发式增长。\n\n**边缘计算：** 从 Node.js 的服务端 JavaScript 向边缘的转变始于 AWS Lambda，但 Cloudflare Workers 凭借其专门构建的最小化运行时真正点燃了市场。 这催生了 Deno Deploy、Bun、WinterJS 和 LLRT 等众多运行时，每个运行时都针对边缘任务进行了优化，并利用了 V8、JavaScriptCore、SpiderMonkey 和 QuickJS 等不同的 JavaScript 引擎。\n\n**微控制器：** 由于微控制器的资源有限，Duktape、Espruino、JerryScript 和 elk 等专门的轻量级引擎应运而生，使 JavaScript 能够在这些设备上执行。 这些引擎驱动了 IoT.js、Microlattice.js 和 low.js 等运行时，以满足物联网的需求。\n\n**多语言引擎：** 从其他语言调用 JavaScript 的需求促使了与已建立的虚拟机集成的多语言引擎的开发。 示例包括 Rhino、Nashorn、Graal.js（适用于 Java/JVM）、jint（适用于 .NET）以及适用于 Python、Ruby、Go、Rust 和 Zig 的各种引擎，这些引擎通常提供双向语言互操作。 甚至出现用 JavaScript 构建的 JavaScript 引擎，例如编译为 WASM 的 Porffor。\n\n**原生应用：** JavaScript 对 GUI 的适用性促使其在原生应用开发中得到应用，从而产生了跨平台框架。 基于 Web 视图的应用（PhoneGap/Cordova、Ionic、Electron）最初获得了关注，但现在正被渲染原生视图的 React Native 所超越。 React Native 随着 JSI 的发展，对引擎的依赖性越来越低，支持 Hermes、JSC、V8、QuickJS 和 Chakra 等引擎，并且有望采用 Node-API。"
  },
  {
    "id": "44698185",
    "title": "Janet: Lightweight, Expressive, Modern Lisp",
    "url": "https://janet-lang.org",
    "summary": "Janet is a lightweight, embeddable, modern Lisp programming language designed for system scripting, embedding, rapid prototyping, and dynamic systems. It's a small package (under 1MB) that includes a core library, interpreter, compiler, and assembler. Janet runs on Windows, Linux, macOS, and BSDs, and is easily portable due to its C99 implementation.\n\nKey features include:\n\n*   Minimal setup: a single binary.\n*   Built-in support for threads, networking, and an event loop.\n*   First-class closures, garbage collection, and green threads.\n*   Mutable and immutable data structures (arrays/tuples, tables/structs, buffers/strings).\n*   Macros and tail call optimization.\n*   Direct C interop and dynamic C library loading.\n*   REPL with interactive debugger.\n*   Parsing Expression Grammars built in.\n*   A companion build tool, jpm, for creating standalone executables.\n\nThe article demonstrates basic usage with a simple example and REPL interaction. It also lists available modules and libraries for tasks like web development (Circlet, Joy), JSON parsing, SQLite integration, UI development (WebView, JanetUI), game development (Jaylib), and cryptography (JHydro). Editor support exists for Neovim, Vim, VSCode, Emacs, Sublime Text, Kakoune, and TIC-80.\n\nThe article directs users to the Janet Zulip instance, GitHub Discussions, and Janet Docs for further help and community interaction.\n",
    "chinese_title": "Janet：轻量级、富有表现力、现代 Lisp",
    "chinese_summary": "Janet：一款轻量级、可嵌入的现代Lisp编程语言，专为系统脚本、嵌入、快速原型设计和动态系统而生。它体积小巧（小于1MB），包含核心库、解释器、编译器和汇编器。Janet可在Windows、Linux、macOS和BSD上运行，并因其C99实现而易于移植。\n\n主要特性包括：\n\n*   极简设置：单个二进制文件。\n*   内置支持线程、网络和事件循环。\n*   头等闭包、垃圾回收和协程。\n*   可变和不可变数据结构（数组/元组、表/结构体、缓冲区/字符串）。\n*   宏和尾调用优化。\n*   直接C互操作和动态C库加载。\n*   带有交互式调试器的REPL。\n*   内置解析表达式语法。\n*   配套构建工具jpm，用于创建独立可执行文件。\n\n本文通过一个简单的示例和REPL交互演示了基本用法。它还列出了可用于Web开发（Circlet、Joy）、JSON解析、SQLite集成、UI开发（WebView、JanetUI）、游戏开发（Jaylib）和密码学（JHydro）等任务的可用模块和库。Neovim、Vim、VSCode、Emacs、Sublime Text、Kakoune和TIC-80提供编辑器支持。\n\n本文引导用户访问Janet Zulip实例、GitHub Discussions和Janet Docs，以获取更多帮助和社区互动。"
  },
  {
    "id": "44660219",
    "title": "A low power 1U Raspberry Pi cluster server for inexpensive colocation (2021)",
    "url": "https://github.com/pawl/raspberry-pi-1u-server",
    "summary": "This document details the design of a low-power 1U Raspberry Pi cluster server for inexpensive colocation, targeting providers with limited power allowances (around 1A @ 120V). The goal is to maximize computing power, storage, and value within these constraints.\n\nThe project uses a Supermicro 1U chassis, five Raspberry Pi 4b's, each with a 240GB M.2 SSD in a UGREEN enclosure and a 32GB Micro SD card for failover.  A NETGEAR 8-port Gigabit Ethernet unmanaged switch connects the Pis. Power is delivered via an ATX power supply and breakout board. Remote power management is achieved using an 8-channel relay module, controlled by one of the Pis, along with a single-channel relay for the management Pi itself.\n\nThe document outlines the hardware and software setup, including flashing the Pis with Raspbian Lite, configuring USB booting, disabling unnecessary services to save power, and setting up remote power management.  Detailed instructions are given for wiring the relays and power distribution.\n\nPower usage is carefully monitored, with the completed server drawing approximately 0.30-0.4A @ 120V at idle and 0.36A at load with the blower fan on low.\n\nThe document acknowledges single points of failure, like the switch, relay, and power supply. It briefly compares the cost and performance to cloud and physical server alternatives, and suggests ideas for a future version, including adding fuses for safety.  Alternative chassis and single-board computer options are also mentioned. The total cost of the project is estimated at around $800.\n",
    "chinese_title": "低功耗1U树莓派集群服务器，适用于廉价托管 (2021)",
    "chinese_summary": "本文详细介绍了低功耗1U树莓派集群服务器的设计，旨在为电力配额有限（约1A@120V）的托管服务商提供经济实惠的服务器托管方案。目标是在这些限制条件下最大限度地提高计算能力、存储和价值。\n\n该项目使用Supermicro 1U机箱、五台树莓派4b，每台配备一个UGREEN外壳的240GB M.2 SSD和一个用于故障转移的32GB Micro SD卡。一台NETGEAR 8端口千兆以太网非网管交换机连接这些树莓派。电源通过ATX电源和分线板提供。远程电源管理通过一个8通道继电器模块实现，该模块由其中一个树莓派控制，以及一个用于管理树莓派本身的单通道继电器。\n\n本文档概述了硬件和软件设置，包括使用Raspbian Lite刷写树莓派、配置USB启动、禁用不必要的服务以节省电力以及设置远程电源管理。提供了接线继电器和配电的详细说明。\n\n对功耗进行仔细监控，完成后的服务器在空闲状态下消耗约0.30-0.4A@120V，在低速风扇开启的负载状态下消耗0.36A。\n\n本文档承认了单点故障，例如交换机、继电器和电源。它简要地将成本和性能与云和物理服务器替代方案进行了比较，并为未来的版本提出了建议，包括增加保险丝以确保安全。还提到了替代机箱和单板计算机选项。该项目的总成本估计约为800美元。"
  },
  {
    "id": "44697145",
    "title": "Coronary artery calcium testing can reveal plaque in arteries, but is underused",
    "url": "https://www.nytimes.com/2025/07/26/health/coronary-artery-calcium-heart.html",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "冠状动脉钙化评分可揭示动脉斑块，但应用不足",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "44665644",
    "title": "Purple Earth hypothesis",
    "url": "https://en.wikipedia.org/wiki/Purple_Earth_hypothesis",
    "summary": "The Purple Earth Hypothesis (PEH) is an astrobiological theory proposing that early Earth's photosynthetic life forms, existing between 3.5 and 2.4 billion years ago, utilized retinal-based pigments instead of chlorophyll. This would have given the early biosphere a purplish hue.\n\nRetinal pigments absorb green and yellow light, reflecting red and blue, resulting in a magenta color. Chlorophyll, conversely, absorbs red and blue and reflects green. The hypothesis is supported by the relative simplicity of retinal compared to chlorophyll, its association with isoprenoid lipids in cell membranes, and the discovery of archaeal membrane components in ancient sediments.\n\nHaloarchaea, modern microbes using retinal-based photosynthesis, are cited as examples. These organisms utilize bacteriorhodopsin to pump protons, creating energy for ATP synthesis without carbon fixation.\n\nThe PEH suggests that retinal-powered archaea may have initially dominated Earth, absorbing green light, allowing eubacteria to evolve using residual red and blue light. Eventually, porphyrin-based photoautotrophs evolved, releasing oxygen and leading to the Great Oxygenation Event and subsequent Huronian glaciation.\n\nThis shift favored organisms with antioxidant capabilities, while anaerobic organisms were forced into anoxic environments. The evolution of chlorophyll created an \"evolutionary trap,\" preventing organisms from re-adapting to absorb green light.\n\nAstrobiologically, the PEH broadens the search for extraterrestrial life to include planets reflecting blue and red light, suggesting retinal-based photosynthesis may be more probable than chlorophyll-based systems on other planets.\n",
    "chinese_title": "紫色地球假说",
    "chinese_summary": "紫色地球假说（PEH）是一种天体生物学理论，认为早期地球（35亿至24亿年前）的光合生命形式使用视黄醛基色素而非叶绿素。这会使早期生物圈呈现紫色色调。\n\n视黄醛色素吸收绿光和黄光，反射红光和蓝光，从而产生洋红色。相反，叶绿素吸收红光和蓝光，反射绿光。视黄醛相对于叶绿素的相对简单性、其与细胞膜中异戊二烯类脂质的关联，以及在古代沉积物中发现的古菌膜成分都支持该假说。\n\n嗜盐古菌，即现代的使用视黄醛基光合作用的微生物，被引用作为例证。这些生物利用细菌视紫红质来泵送质子，产生ATP合成的能量，而无需碳固定。\n\nPEH表明，由视黄醛驱动的古菌可能最初在地球上占据主导地位，吸收绿光，从而使真细菌能够利用剩余的红光和蓝光进化。最终，基于卟啉的光合自养生物进化，释放氧气，导致大氧化事件和随后的休伦冰期。\n\n这种转变有利于具有抗氧化能力的生物，而厌氧生物则被迫进入缺氧环境。叶绿素的进化创造了一个“进化陷阱”，阻止生物重新适应吸收绿光。\n\n在天体生物学上，PEH将对地外生命的搜寻范围扩大到包括反射蓝色和红色光的行星，这表明视黄醛基光合作用可能比其他行星上基于叶绿素的系统更可能存在。"
  },
  {
    "id": "44695098",
    "title": "How we rooted Copilot",
    "url": "https://research.eye.security/how-we-rooted-copilot/",
    "summary": "The article \"How we rooted Copilot\" details Eye Security's discovery and exploitation of a SharePoint 0-day vulnerability (CVE-2025-53770) that allowed them to compromise Copilot. The article likely recounts the chronological steps from the initial detection of a suspicious Security Operations Center (SOC) alert to the eventual mass exploitation of the vulnerability.\n\nKey takeaways from the title and opening sentence suggest the article will explain:\n\n*   **The Vulnerability:** The 0-day was specifically in SharePoint and designated CVE-2025-53770.\n*   **The Discovery:** Eye Security identified the vulnerability.\n*   **The Exploitation:** They successfully leveraged this vulnerability to \"root\" or gain complete control over Copilot.\n*   **The Timeline:** The exploit chain began on the evening of July 18, 2025.\n*   **Impact:** This was potentially a mass exploitation event, given the phrase \"0-day Mass Exploitation\".\n\nBased on this limited information, the article likely dives into the technical details of the vulnerability, the steps Eye Security took to analyze and exploit it, and the potential impact of the vulnerability on Copilot and its users. It is structured as a tech blog post explaining a significant security find.\n",
    "chinese_title": "我们如何攻破Copilot",
    "chinese_summary": "文章“我们如何攻破Copilot”详细介绍了Eye Security发现并利用SharePoint零日漏洞（CVE-2025-53770）来攻陷Copilot的过程。该文章很可能按时间顺序叙述了从最初检测到可疑的安全运营中心（SOC）警报到最终大规模利用该漏洞的步骤。\n\n从标题和首句中可以推断出，文章将解释：\n\n*   **漏洞：** 零日漏洞 específicamente 存在于 SharePoint 中，编号为 CVE-2025-53770。\n*   **发现：** Eye Security 识别出该漏洞。\n*   **利用：** 他们成功利用此漏洞“攻破”或完全控制了 Copilot。\n*   **时间线：** 漏洞利用链始于 2025 年 7 月 18 日晚上。\n*   **影响：** 鉴于短语“零日大规模利用”，这可能是一起大规模利用事件。\n\n基于这些有限的信息，该文章很可能深入探讨漏洞的技术细节、Eye Security 分析和利用该漏洞所采取的步骤，以及该漏洞对 Copilot 及其用户的潜在影响。它以技术博客文章的形式呈现，解释了一项重要的安全发现。"
  },
  {
    "id": "44664179",
    "title": "Book Review: Nixon's Memoirs",
    "url": "https://justismills.substack.com/p/book-review-nixons-memoirs",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "书评：尼克松回忆录",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "44697007",
    "title": "Teach Yourself Programming in Ten Years (1998)",
    "url": "https://norvig.com/21-days.html",
    "summary": "Peter Norvig's \"Teach Yourself Programming in Ten Years\" critiques the trend of quick-fix programming books, arguing that true expertise requires substantial time and deliberate practice. He contends that superficial familiarity gained in 24 hours or 21 days is insufficient for deep understanding or effectively using a language.\n\nNorvig emphasizes the \"ten-year rule,\" citing research showing that mastery in various fields demands approximately ten years of dedicated practice, including challenging oneself, analyzing performance, and correcting mistakes. He uses examples like Mozart and the Beatles to illustrate this point.\n\nHe advocates for actively engaging with programming, learning by doing, and interacting with other programmers more than relying solely on books or courses. While formal education has its benefits, he emphasizes that practical experience is crucial. He suggests working on diverse projects, understanding others' code, and learning multiple programming languages with different paradigms.\n\nNorvig underscores the importance of understanding computer fundamentals and actively participating in the programming community. He stresses that inherent qualities like fearlessness or a willingness to dedicate significant time are essential for becoming a great programmer.\n\nHe concludes that while introductory books have some value, they won't provide lasting expertise. Instead, a commitment to continuous improvement over years is required. He also provides recommendations for initial language choices (Python or Scheme) and book resources.\n",
    "chinese_title": "十年学会编程 (1998)",
    "chinese_summary": "Peter Norvig 的《十年学会编程》批判了速成编程书籍的趋势，认为真正的专业技能需要大量的时间和刻意的练习。他认为，在 24 小时或 21 天内获得的肤浅知识不足以深入理解或有效使用一门语言。\n\nNorvig 强调“十年法则”，引用研究表明，在各个领域取得精通需要大约十年的专注练习，包括挑战自我、分析表现和纠正错误。他用莫扎特和披头士乐队等例子来说明这一点。\n\n他提倡积极参与编程，通过实践学习，并与他人程序员互动，而不是仅仅依赖书籍或课程。虽然正规教育有其好处，但他强调实践经验至关重要。他建议从事各种项目，理解他人的代码，并学习具有不同范例的多种编程语言。\n\nNorvig 强调了理解计算机基础知识和积极参与编程社区的重要性。他强调，诸如无畏或愿意投入大量时间之类的内在品质对于成为一名伟大的程序员至关重要。\n\n他总结说，入门书籍虽然有一定价值，但不会提供持久的专业知识。相反，需要多年来不断改进的承诺。他还提供了关于初始语言选择（Python 或 Scheme）和书籍资源的建议。"
  },
  {
    "id": "44665816",
    "title": "16colo.rs: ANSI/ASCII art archive",
    "url": "https://16colo.rs/",
    "summary": "16colo.rs is an online archive dedicated to preserving and showcasing ANSI and ASCII artpacks. These art forms, created for textmode consoles, flourished in the 1990s with the popularity of Bulletin Board Systems (BBS). Artists organized into groups, like ACiD and iCE, releasing their works in monthly artpacks, fueling competition and creativity.\n\nThe rise of the internet led to the decline of BBSs and diminished the practical need for ANSI/ASCII art. However, artists continue to create artpacks even today, and 16colo.rs serves as a public archive for these collections. The site also offers a variety of tools and features to engage with the art form, including tagging, advanced search, upload functionality, collaborative drawing servers (PabloDraw and Moebius), a textmode art sharing service, a SAUCE editor, and chat options.\n\nThe site also suggests learning more about the history of the ANSI art scene through the short film \"THE ART OF WAREZ.\" Essentially, 16colo.rs aims to document and celebrate the history and ongoing creativity of ANSI and ASCII art.\n",
    "chinese_title": "16colo.rs：ANSI/ASCII艺术作品库",
    "chinese_summary": "16colo.rs 是一个在线档案馆，致力于保存和展示 ANSI 和 ASCII 艺术包。这些为文本模式控制台创作的艺术形式，在 20 世纪 90 年代随着电子公告栏系统 (BBS) 的流行而蓬勃发展。艺术家们组织成 ACiD 和 iCE 等团体，以每月艺术包的形式发布作品，从而激发了竞争和创造力。\n\n互联网的兴起导致了 BBS 的衰落，并减少了对 ANSI/ASCII 艺术的实际需求。然而，即使在今天，艺术家们仍在继续创作艺术包，而 16colo.rs 则作为这些作品的公共档案馆。该网站还提供各种工具和功能来参与这种艺术形式，包括标签、高级搜索、上传功能、协作绘图服务器（PabloDraw 和 Moebius）、文本模式艺术分享服务、SAUCE 编辑器以及聊天选项。\n\n该网站还建议通过短片《THE ART OF WAREZ》了解更多关于 ANSI 艺术场景的历史。本质上，16colo.rs 旨在记录和庆祝 ANSI 和 ASCII 艺术的历史和持续的创造力。"
  },
  {
    "id": "44665982",
    "title": "Low cost mmWave 60GHz radar sensor for advanced sensing",
    "url": "https://www.infineon.com/part/BGT60TR13C",
    "summary": "The BGT60TR13C is a low-cost, active and preferred XENSIV™ 60GHz radar sensor designed for advanced sensing applications. It features Antennas in Package (AIP) in an L-shaped array and a built-in Finite-State Machine (FSM) for managing FMCW frequency sweeps, data acquisition, and sample storage. It's configurable via SPI and optimized for low power consumption with power modes and DC duty cycling. Key features include a ramp-up speed of 400MHz/µs, high Signal-To-Noise Ratio (SNR), high bandwidth (>5GHz), and high sensitivity. The package size is 6.5 x 5.0 x 0.9 mm³.\n\nThe sensor is suitable for various applications, including consumer electronics like smart TVs, smart speakers, and soundbars; home appliances like air purifiers; and smart home/building applications such as HVAC, security cameras, smart thermostats, and more. It offers Angle of Arrival, Range, and Speed detection capabilities. It is RoHS and Lead-free compliant. The sensor operates within a frequency range of 58 GHz to 63.5 GHz, has a maximum detection range of 15m, and uses 3 Rx antennas and 1 Tx antenna. The part number is BGT60TR13CE6327XUMA1 and it's available in a PG-VF2BGA-40 package.\n",
    "chinese_title": "用于高级感知的低成本毫米波60GHz雷达传感器",
    "chinese_summary": "BGT60TR13C是一款低成本、高性能的XENSIV™ 60GHz雷达传感器，专为高级传感应用而设计。它采用L型阵列的天线封装（AIP），并内置有限状态机（FSM）用于管理FMCW频率扫描、数据采集和样本存储。它可以通过SPI进行配置，并针对低功耗进行了优化，具有多种电源模式和直流占空比。主要特性包括400MHz/µs的斜坡上升速度、高信噪比（SNR）、高带宽（>5GHz）和高灵敏度。封装尺寸为6.5 x 5.0 x 0.9 mm³。\n\n该传感器适用于各种应用，包括智能电视、智能音箱和条形音箱等消费电子产品；空气净化器等家用电器；以及暖通空调、安防摄像头和智能恒温器等智能家居/楼宇应用。它提供到达角、距离和速度检测功能，符合RoHS和无铅标准。该传感器工作频率范围为58 GHz至63.5 GHz，最大检测范围为15m，使用3个接收天线和1个发射天线。零件编号为BGT60TR13CE6327XUMA1，采用PG-VF2BGA-40封装。"
  },
  {
    "id": "44697131",
    "title": "Resizable structs in Zig",
    "url": "https://tristanpemble.com/resizable-structs-in-zig/",
    "summary": "This article proposes a \"runtime resizable struct\" in Zig, addressing the gap in handling contiguous data with differing types and runtime-determined lengths.  Currently, Zig provides arrays (compile-time size), many-item pointers (runtime size, same type), and structs (compile-time size, differing types).  The author argues a need exists for a struct-like structure where the size of some fields are determined at runtime.\n\nThe problem is illustrated with an example from Zig's standard library where a `Connection` struct stores dynamically sized data. The current workaround involves manual memory allocation, `ptrCast`/`alignCast`, and tracking lengths, which is error-prone and complex.\n\nThe author proposes a solution using Zig's comptime meta-programming, introducing `ResizableArray(T)` and `ResizableStruct(Layout)`.  `ResizableArray` serves as a marker for fields with runtime-known lengths. `ResizableStruct` uses this information to generate a utility type with methods for initialization, accessing fields, resizing, and deallocation.  The implementation utilizes comptime to calculate offsets, sizes, and alignment, effectively creating a contiguous memory block with dynamically sized fields.  The core idea is to store a pointer to the allocated memory and a struct containing the lengths of the resizable arrays, minimizing overhead.\n\nThe author has created a proof-of-concept implementation available as a package on GitHub and seeks feedback on its design and potential incorporation into Zig's standard library. They encourage discussion and suggestions for improvement, particularly regarding real-world use cases and API enhancements.\n",
    "chinese_title": "Zig 中的可变大小结构体",
    "chinese_summary": "本文提出了一种 Zig 语言中的“运行时可调整大小的结构体”，旨在解决处理具有不同类型和运行时确定长度的连续数据的缺口。目前，Zig 提供了数组（编译时大小）、多项指针（运行时大小，相同类型）和结构体（编译时大小，不同类型）。作者认为需要一种类似于结构体的结构，其中一些字段的大小在运行时确定。\n\n问题通过 Zig 标准库中的一个 `Connection` 结构体的例子来说明，该结构体存储了动态大小的数据。目前的解决方法涉及手动内存分配、`ptrCast`/`alignCast` 和长度跟踪，这容易出错且复杂。\n\n作者提出了一个使用 Zig 的编译时元编程的解决方案，引入了 `ResizableArray(T)` 和 `ResizableStruct(Layout)`。`ResizableArray` 用作具有运行时已知长度的字段的标记。`ResizableStruct` 使用此信息生成一个实用程序类型，该类型具有用于初始化、访问字段、调整大小和释放内存的方法。该实现利用编译时来计算偏移量、大小和对齐方式，从而有效地创建一个具有动态大小字段的连续内存块。核心思想是存储一个指向已分配内存的指针和一个包含可调整大小的数组长度的结构体，从而最大限度地减少开销。\n\n作者创建了一个概念验证实现，可在 GitHub 上作为包使用，并寻求对其设计和可能纳入 Zig 标准库的反馈。他们鼓励讨论和改进建议，特别是关于实际用例和 API 增强。"
  },
  {
    "id": "44696033",
    "title": "What went wrong for Yahoo",
    "url": "https://dfarq.homeip.net/what-went-wrong-for-yahoo/",
    "summary": "This article explores the downfall of Yahoo, once a dominant force on the internet. Founded in 1994 as a curated directory of links, Yahoo quickly became a popular \"front page of the internet.\" To maintain its dominance, Yahoo pursued a strategy of acquiring other sites to increase traffic. However, unlike Google's successful acquisitions like YouTube, Yahoo's acquisitions often proved disastrous, with notable examples being Broadcast.com and Geocities, costing the company billions.\n\nA key factor in Yahoo's decline was its failure to recognize and capitalize on opportunities. The article highlights two missed opportunities: acquiring Google for a mere $1 million in 1998 and later for $1 billion in 2002, and failing to acquire Facebook in 2006 for a slightly higher bid. These missed chances, contrasting sharply with their successful early investment in Alibaba, underscore a series of poor strategic decisions.\n\nIn 2008, Microsoft offered $44.6 billion for Yahoo, but Yahoo rejected the offer, believing it undervalued the company. This decision is now viewed as a mistake, as Yahoo's eventual sale to Verizon in 2016 yielded only $4.8 billion, not including the Alibaba stake. Verizon later sold the combined Yahoo and AOL for $5 billion. Today, Yahoo is a shadow of its former self, primarily used for basic functions like network connectivity testing, a far cry from its role as a leading internet portal. The article concludes that while acquisitions are a necessary part of remaining competitive, Yahoo's failed to recognize profitable opportunities, and were unable to make many of their acquisitions profitable.\n",
    "chinese_title": "雅虎出了什么问题",
    "chinese_summary": "本文探讨了雅虎的衰落，雅虎曾经是互联网上的主导力量。雅虎成立于1994年，最初是一个精选的链接目录，迅速成为流行的“互联网首页”。为了保持其统治地位，雅虎采取了收购其他网站以增加流量的策略。然而，与谷歌成功收购YouTube等不同，雅虎的收购通常被证明是灾难性的，其中著名的例子包括Broadcast.com和Geocities，使该公司损失了数十亿美元。\n\n雅虎衰落的一个关键因素是它未能认识到并利用机会。文章强调了两个错失的机会：1998年仅以100万美元收购谷歌，后来在2002年以10亿美元收购谷歌，以及2006年未能以略高的出价收购Facebook。这些错失的机会，与他们早期成功投资阿里巴巴形成鲜明对比，突显了一系列糟糕的战略决策。\n\n2008年，微软出价446亿美元收购雅虎，但雅虎拒绝了该提议，认为其低估了公司价值。现在，这一决定被认为是一个错误，因为雅虎最终在2016年以仅48亿美元的价格出售给Verizon，不包括阿里巴巴的股份。 Verizon后来以50亿美元的价格出售了合并后的雅虎和AOL。 今天，雅虎已经成为其昔日辉煌的影子，主要用于网络连接测试等基本功能，与其作为领先互联网门户的角色相去甚远。 文章总结说，虽然收购是保持竞争力的必要组成部分，但雅虎未能认识到有利可图的机会，也未能使其许多收购实现盈利。"
  },
  {
    "id": "44693570",
    "title": "The natural diamond industry is getting rocked. Thank the lab-grown variety",
    "url": "https://www.cbc.ca/news/business/lab-grown-diamonds-1.7592336",
    "summary": "The natural diamond industry is facing significant disruption due to the rising popularity of lab-grown diamonds. Consumers, particularly millennials and Gen Z, are increasingly opting for lab-grown diamonds due to their lower cost, ethical considerations (avoiding \"blood diamonds\"), and the perception that they are functionally identical to mined diamonds.\n\nThis shift is having a major impact on the diamond mining industry, particularly in Canada's Northwest Territories, where diamond mining is a significant employer. Burgundy Diamond Mines has already announced layoffs and suspended operations due to declining diamond values. Canada, once a major diamond producer, is seeing its diamond mines winding down, potentially leading to job losses and an exodus of people from northern communities.\n\nWhile mined diamonds are marketed as \"real\" and \"unique\" due to their natural formation, lab-grown diamonds offer a more affordable and traceable alternative. Jewelers are seeing a significant shift in consumer preference towards lab-grown, with natural diamonds now representing a much smaller portion of their sales. Experts estimate that the closure of diamond mines in the Northwest Territories will result in substantial job losses and negatively impact the region's economy. Despite efforts to market natural diamonds to younger generations, lab-grown diamonds continue to gain popularity, challenging the long-held perception of natural diamonds as the ultimate symbol of enduring love.\n",
    "chinese_title": "天然钻石行业正遭受冲击。 感谢实验室培育钻石。",
    "chinese_summary": "由于实验室培育钻石日益普及，天然钻石行业正面临重大变革。消费者，尤其是千禧一代和 Z 世代，越来越多地选择实验室培育钻石，因为它们成本更低，出于道德考虑（避免“血钻”），并且认为它们在功能上与开采的钻石相同。\n\n这种转变对钻石开采业产生了重大影响，尤其是在加拿大西北地区，钻石开采是当地重要的雇主。勃艮第钻石矿业公司已经宣布裁员并暂停运营，原因是钻石价值下降。加拿大曾经是主要的钻石生产国，但其钻石矿正在逐渐关闭，这可能会导致失业和人们从北方社区外流。\n\n尽管开采的钻石因其天然形成而被宣传为“真品”和“独一无二”，但实验室培育钻石提供了更实惠和可追溯的替代品。珠宝商们发现消费者对实验室培育钻石的偏好发生了重大转变，天然钻石现在仅占其销售额的一小部分。专家估计，西北地区的钻石矿关闭将导致大量失业，并对该地区的经济产生负面影响。尽管为了向年轻一代推广天然钻石做出了努力，但实验室培育钻石仍然越来越受欢迎，挑战了长期以来人们认为天然钻石是永恒爱情终极象征的观念。"
  },
  {
    "id": "44697590",
    "title": "Personal aviation is about to get interesting (2023)",
    "url": "https://www.elidourado.com/p/personal-aviation",
    "summary": "Eli Dourado's article \"Personal aviation is about to get interesting\" discusses the FAA's new MOSAIC rulemaking initiative and its potential to transform personal aviation. The article highlights that while airline travel has progressed, personal aviation has stagnated. The MOSAIC rule aims to make personal aviation more viable by expanding the light-sport aircraft (LSA) category.\n\nThe article explains the FAA's \"safety continuum,\" which applies different safety standards to different types of aviation, from commercial airlines to ultralights. The FAA recognizes that overly strict safety regulations can hinder innovation and safety enhancements. The MOSAIC rule acknowledges that increasing the attractiveness of safer categories like LSA can improve overall system safety by encouraging pilots to switch from more dangerous experimental aircraft.\n\nMOSAIC proposes significant changes to LSA rules, including allowing helicopters and powered-lift aircraft to be considered LSAs (though initially requiring private pilot licenses to fly powered-lift), eliminating weight restrictions, more than doubling the maximum speed to 250 knots, and allowing retractable landing gear. By expanding the definition and capabilities of LSAs, the FAA hopes to encourage recreational pilots to choose LSAs over experimental aircraft, leading to a net reduction in aviation fatalities due to the LSA category's historically better safety record.\n",
    "chinese_title": "个人航空即将变得有趣 (2023)",
    "chinese_summary": "伊莱·杜拉多的文章《个人航空即将变得有趣》讨论了FAA新的MOSAIC规则制定倡议及其改变个人航空的潜力。文章强调，虽然航空旅行取得了进展，但个人航空却停滞不前。MOSAIC规则旨在通过扩大轻型运动飞机（LSA）类别，使个人航空更具可行性。\n\n文章解释了FAA的“安全连续体”，它对不同类型的航空（从商业航空公司到超轻型飞机）应用不同的安全标准。FAA认识到，过于严格的安全法规可能会阻碍创新和安全改进。MOSAIC规则承认，提高更安全类别（如LSA）的吸引力可以通过鼓励飞行员从更危险的实验飞机转向LSA来提高整体系统安全性。\n\nMOSAIC提议对LSA规则进行重大修改，包括允许将直升机和动力升力飞机视为LSA（尽管最初要求持有私人飞行员执照才能驾驶动力升力飞机），取消重量限制，将最大速度提高一倍以上至250节，并允许可伸缩起落架。通过扩大LSA的定义和功能，FAA希望鼓励休闲飞行员选择LSA而不是实验飞机，由于LSA类别历史上更好的安全记录，从而导致航空死亡人数净减少。"
  },
  {
    "id": "44663887",
    "title": "Implementing dynamic scope for Fennel and Lua",
    "url": "https://andreyor.st/posts/2025-06-09-implementing-dynamic-scope-for-fennel-and-lua/",
    "summary": "This article explores implementing dynamic scoping in Fennel and Lua, a feature missing from both languages but found in Clojure. Dynamic scoping allows variables to be bound differently depending on the call stack, unlike lexical scoping where variables are bound based on their position in the code.\n\nThe author initially outlines the problem dynamic scoping solves: refactoring code with anonymous functions that rely on variables defined in a specific scope. They then contrast lexical and dynamic scoping using Clojure examples, highlighting the use of `binding` to create a dynamic scope.\n\nThe core of the article focuses on implementing dynamic scoping in Fennel, leveraging Lua's ability to manipulate function environments. The author details the use of `setfenv` (or a manual implementation for Lua versions without it) to change a function's environment, a table where variable names are stored.\n\nThe chosen approach involves cloning the function to be called and setting a custom environment for the clone, avoiding permanent changes to the original function.  The `clone-function-with-env` function recursively clones the function and any called via upvalues, setting the provided environment. The `dynamic-call` function sets up the new environment and calls the cloned function. A `binding` macro provides a convenient syntax for using dynamic scoping.\n\nThe author acknowledges limitations of this approach (ordinary functions only, no coroutines, reliance on the debug library) and presents an alternative: temporarily setting global variables and restoring them later.  While more similar to the original Clojure implementation, this approach is disliked because it actually changes variable values. The article concludes with the author deciding to leave dynamic scoping out of cljlib for now, feeling unsatisfied with all proposed solutions.\n",
    "chinese_title": "为 Fennel 和 Lua 实现动态作用域",
    "chinese_summary": "本文探讨如何在 Fennel 和 Lua 中实现动态作用域。动态作用域是 Clojure 中存在，但在 Fennel 和 Lua 中缺失的一项特性。与词法作用域（变量根据代码中的位置绑定）不同，动态作用域允许变量根据调用栈以不同的方式绑定。\n\n作者首先概述了动态作用域所解决的问题：重构依赖于特定作用域中定义的变量的匿名函数代码。然后，他们使用 Clojure 示例对比了词法作用域和动态作用域，强调了使用 `binding` 创建动态作用域。\n\n文章的核心集中在如何在 Fennel 中实现动态作用域，利用 Lua 操作函数环境的能力。作者详细介绍了使用 `setfenv`（或者对于没有它的 Lua 版本，手动实现）来更改函数的环境，即存储变量名称的表。\n\n所选择的方法包括克隆要调用的函数，并为克隆函数设置自定义环境，从而避免对原始函数进行永久性更改。`clone-function-with-env` 函数递归地克隆该函数以及通过 upvalue 调用的任何函数，并设置提供的环境。`dynamic-call` 函数设置新的环境并调用克隆的函数。`binding` 宏为使用动态作用域提供了方便的语法。\n\n作者承认了这种方法的局限性（仅限于普通函数，没有协程，依赖于调试库），并提出了一种替代方案：临时设置全局变量并在之后恢复它们。虽然这种方法更类似于原始的 Clojure 实现，但作者不喜欢它，因为它实际上改变了变量的值。文章最后，作者决定暂时将动态作用域从 cljlib 中移除，因为对所有提出的解决方案都不满意。"
  },
  {
    "id": "44666984",
    "title": "Getting decent error reports in Bash when you're using 'set -e'",
    "url": "https://utcc.utoronto.ca/~cks/space/blog/programming/BashGoodSetEReports",
    "summary": "Chris Siebenmann's post addresses an issue where users with older or specific browser versions, particularly Chrome, are being blocked from accessing his blog (Wandering Thoughts) and associated wiki (CSpace). This is due to anti-crawler precautions implemented to combat a surge in high-volume crawling, especially from bots gathering data for LLM training purposes. These bots often use outdated browser user agents, particularly Chrome's, making them difficult to distinguish from legitimate users with older browsers.\n\nIf a user encounters this block in error, meaning they are using a current browser version, Siebenmann encourages them to contact him with details about their browser, including the User-Agent string, to help him refine his filtering rules.\n\nA specific problem is highlighted regarding archive.* services (archive.today, archive.ph, archive.is, etc.). These services crawl pages using methods that are indistinguishable from malicious actors due to their use of older Chrome User-Agents, distributed IP addresses (some with falsified DNS records), making them also subject to being blocked. Siebenmann recommends using archive.org instead, as it's a better-behaved archival crawler. In short, the author is trying to filter out malicious bots, but that can inadvertently block real users with old browsers or those using archive services.\n",
    "chinese_title": "在使用 'set -e' 时，如何在 Bash 中获得像样的错误报告",
    "chinese_summary": "Chris Siebenmann 的文章指出，使用较旧或特定浏览器版本的用户，尤其是 Chrome 用户，被阻止访问他的博客 (Wandering Thoughts) 和相关维基 (CSpace)。这是因为为了应对大量爬虫涌入而采取了反爬虫措施，特别是那些为 LLM 训练收集数据的机器人。这些机器人通常使用过时的浏览器用户代理，尤其是 Chrome 的，这使得它们很难与使用旧浏览器的合法用户区分开来。\n\n如果用户误遇到此阻止，即他们正在使用当前的浏览器版本，Siebenmann 鼓励他们联系他并提供有关其浏览器的详细信息，包括 User-Agent 字符串，以帮助他改进其过滤规则。\n\n一个特别的问题是关于 archive.* 服务（archive.today、archive.ph、archive.is 等）。这些服务使用与恶意行为者无法区分的方法来抓取页面，因为它们使用旧的 Chrome User-Agent，分布式的 IP 地址（有些带有伪造的 DNS 记录），这使得它们也容易被阻止。Siebenmann 建议使用 archive.org 代替，因为它是一个行为更好的存档爬虫。简而言之，作者试图过滤掉恶意机器人，但这可能会无意中阻止使用旧浏览器的真实用户或那些使用存档服务的用户。"
  },
  {
    "id": "44669864",
    "title": "StackSafe: Taming Recursion in Rust Without Stack Overflow",
    "url": "https://fast.github.io/blog/stacksafe-taming-recursion-in-rust-without-stack-overflow/",
    "summary": "This article introduces StackSafe, a Rust crate designed to prevent stack overflows in recursive algorithms and data structures. Stack overflows, a common problem with recursion, can crash programs when the call stack exceeds its limit.\n\nStackSafe provides a simple solution: annotating recursive functions with `#[stacksafe]` and wrapping recursive data structure fields with `StackSafe<T>`. This approach automatically grows the stack as needed, preventing crashes.\n\nThe article highlights the limitations of existing solutions like manual conversion to iterative code (complex and difficult for many scenarios) and lower-level crates like `stacker` and `recursive` (requiring careful annotation and manual trait implementations). StackSafe, in contrast, offers a unified solution for both functions and data structures, including derived traits like `Debug`, `Clone`, and `Drop`.\n\nA key feature of StackSafe is its debug-time safety checks. In debug builds, it verifies that access to `StackSafe<T>` is within a function annotated with `#[stacksafe]`, helping developers catch potential stack overflow issues early.\n\nThe article demonstrates how to adopt StackSafe with a real-world example of making a JSON processor stack-safe with minimal code changes. Ultimately, StackSafe allows developers to write elegant, recursive code without the worry of stack overflows, focusing on algorithm logic instead of stack management.\n",
    "chinese_title": "StackSafe: 在 Rust 中驯服递归，避免栈溢出",
    "chinese_summary": "本文介绍 StackSafe，一个旨在防止递归算法和数据结构中栈溢出的 Rust 包。栈溢出是递归常见的问题，当调用栈超过其限制时会导致程序崩溃。\n\nStackSafe 提供了一个简单的解决方案：使用 `#[stacksafe]` 注解递归函数，并用 `StackSafe<T>` 包裹递归数据结构字段。这种方法可以根据需要自动增长堆栈，从而防止崩溃。\n\n本文重点介绍了现有解决方案的局限性，例如手动转换为迭代代码（复杂且适用于许多场景）以及像 `stacker` 和 `recursive` 这样的底层包（需要仔细的注解和手动特征实现）。 相比之下，StackSafe 为函数和数据结构提供了一个统一的解决方案，包括像 `Debug`、`Clone` 和 `Drop` 这样的派生特征。\n\nStackSafe 的一个关键特性是其调试时的安全检查。 在调试构建中，它会验证对 `StackSafe<T>` 的访问是否在用 `#[stacksafe]` 注解的函数中，从而帮助开发人员及早发现潜在的栈溢出问题。\n\n本文通过一个实际的例子演示了如何通过最少的代码更改来采用 StackSafe 使 JSON 处理器具有栈安全性。最终，StackSafe 使开发人员能够编写优雅的递归代码，而无需担心栈溢出，从而专注于算法逻辑而不是栈管理。"
  },
  {
    "id": "44661571",
    "title": "Cable bacteria are living batteries",
    "url": "https://www.asimov.press/p/cable-bacteria",
    "summary": "Niko McCarty's article \"Cable Bacteria are Living Batteries\" details the discovery and implications of cable bacteria, microbes found in a Danish lake that conduct electricity over relatively long distances. Discovered in 2012 at Aarhus University, these bacteria form chains and function as living batteries by oxidizing sulfide in mud and transferring electrons to electron acceptors like oxygen in the water above. This allows them to thrive in environments where oxygen is limited, separating the redox reaction across a physical space.\n\nThe discovery challenges the conventional understanding that cells power themselves solely through local chemistry. Cable bacteria coordinate like tissues and behave like circuits, defying traditional microbiology. The discovery came about when Lars Peter Nielsen noticed hydrogen sulfide disappearing from mud samples, an occurrence that shouldn't have happened without oxygen.\n\nBeyond basic research, cable bacteria have practical applications. A study showed that adding cable bacteria to rice paddies significantly reduced methane emissions (by 93 percent) by increasing sulfate levels, which suppresses methane-producing microbes. Given that rice agriculture is a major source of methane, this could have a significant environmental impact. Field trials are underway to test this potential.\n\nHowever, using cable bacteria is limited because they cannot be grown in pure culture or genetically engineered, making them difficult to manipulate for wider application. Despite advancements, much remains unknown about these organisms, highlighting the need for continued research.\n",
    "chinese_title": "电缆细菌是活电池",
    "chinese_summary": "尼科·麦卡锡的文章《电缆细菌是活体电池》详细介绍了电缆细菌的发现及其意义。这种微生物在丹麦的一个湖泊中被发现，可以相对较长距离地导电。这些细菌于2012年在奥胡斯大学被发现，它们形成链状结构，并通过氧化泥中的硫化物并将电子转移到水中的氧气等电子受体来充当活体电池。这使得它们能够在氧气有限的环境中茁壮成长，从而在物理空间上分离氧化还原反应。\n\n这一发现挑战了细胞仅通过局部化学反应为其自身供电的传统观念。电缆细菌像组织一样协调，像电路一样运作，颠覆了传统的微生物学。这一发现源于Lars Peter Nielsen注意到泥浆样品中的硫化氢消失，这在没有氧气的情况下是不应该发生的。\n\n除了基础研究之外，电缆细菌还具有实际应用。一项研究表明，通过提高硫酸盐水平来抑制产生甲烷的微生物，向稻田中添加电缆细菌可显著减少甲烷排放（减少93%）。鉴于稻米农业是甲烷的主要来源，这可能对环境产生重大影响。目前正在进行田间试验以测试这种潜力。\n\n然而，使用电缆细菌受到限制，因为它们无法在纯培养中生长或进行基因工程改造，这使得它们难以操作以进行更广泛的应用。尽管取得了进展，但对于这些生物体仍有很多未知之处，这突出了继续研究的必要性。"
  },
  {
    "id": "44697437",
    "title": "Paul Dirac and the religion of mathematical beauty (2011) [video]",
    "url": "https://www.youtube.com/watch?v=jPwo1XsKKXg",
    "summary": "This YouTube video, titled \"Paul Dirac and the religion of mathematical beauty,\" likely explores the life and work of physicist Paul Dirac, specifically focusing on his belief in the fundamental role of mathematical beauty in scientific discovery.\n\nBased on the title, the video likely argues that Dirac considered mathematical elegance and aesthetics to be a crucial guide in formulating and evaluating physical theories. He believed that if a theory was mathematically beautiful, it was more likely to be true, even if experimental evidence was initially lacking.\n\nThe video likely discusses Dirac's contributions to quantum mechanics and quantum electrodynamics, highlighting examples where his pursuit of mathematical beauty led to groundbreaking discoveries, such as the Dirac equation, which predicted the existence of antimatter.\n\nIt may also explore the potential pitfalls of relying solely on mathematical beauty, discussing whether it can sometimes lead scientists astray and whether it should be balanced with empirical evidence. The \"religion\" metaphor likely alludes to the strong conviction and unwavering faith Dirac placed in the power of mathematical beauty in uncovering the secrets of the universe.\n\nThe provided YouTube footer information is irrelevant to the content of the video and can be disregarded.\n",
    "chinese_title": "保罗·狄拉克与数学之美信仰 (2011) [视频]",
    "chinese_summary": "这个YouTube视频，题为“保罗·狄拉克与数学之美教”，很可能探讨物理学家保罗·狄拉克的一生和工作，特别是侧重于他坚信数学之美在科学发现中的根本作用。\n\n根据标题，该视频很可能论证狄拉克认为数学的优雅和美感是构建和评估物理理论的关键指导。他相信，如果一个理论在数学上是美的，那么它就更可能是正确的，即使最初缺乏实验证据。\n\n该视频很可能讨论狄拉克对量子力学和量子电动力学的贡献，重点介绍他追求数学之美如何带来突破性发现的例子，例如狄拉克方程，该方程预测了反物质的存在。\n\n它也可能探讨仅仅依靠数学之美的潜在缺陷，讨论它是否有时会导致科学家误入歧途，以及它是否应该与经验证据相平衡。“宗教”这个比喻很可能暗示了狄拉克对数学之美在揭示宇宙秘密方面的力量的坚定信念和毫不动摇的信仰。\n\n所提供的YouTube页脚信息与视频内容无关，可以忽略。"
  },
  {
    "id": "44697798",
    "title": "Show HN: QuickTunes: Apple Music player for Mac with iPod vibes",
    "url": "https://furnacecreek.org/quicktunes/",
    "summary": "QuickTunes is a macOS application designed to provide a simple and fast Apple Music experience reminiscent of early 2000s music players like the iPod. It focuses on easy navigation of your Apple Music library, allowing you to quickly browse playlists, albums, artists, and songs.\n\nKey features include buttery smooth scrolling, keyboard navigation, multi-touch gesture support, and a floating player for easy control of playback, shuffle, and repeat. The app's layout dynamically adjusts to window size, offering both a compact, iPod-like interface and a multi-pane view. Users can customize the app's appearance through the settings. A floating Spotlight-style search (⌘F) allows users to search their local library or the entire Apple Music catalog.\n\nThe app boasts features like Up Next queue management, library sorting and filtering, media key support, and the ability to share the currently playing song. It is compatible with macOS 15 \"Sequoia\" on both Intel and Apple Silicon Macs. Users can download a trial or purchase the full version.\n",
    "chinese_title": "Show HN: QuickTunes：Mac 平台的 Apple Music 播放器，带 iPod 风格",
    "chinese_summary": "QuickTunes是一款macOS应用，旨在提供一个简单快速的Apple Music体验，让人想起2000年初像iPod一样的音乐播放器。它专注于轻松浏览你的Apple Music资料库，允许你快速浏览播放列表、专辑、艺术家和歌曲。\n\n主要功能包括如黄油般流畅的滚动、键盘导航、多点触控手势支持以及一个浮动播放器，方便控制播放、随机播放和重复播放。该应用程序的布局会动态调整以适应窗口大小，提供紧凑的、类似iPod的界面和多窗格视图。用户可以通过设置自定义应用程序的外观。一个浮动式的 Spotlight 式搜索 (⌘F) 允许用户搜索本地资料库或整个 Apple Music 目录。\n\n该应用程序拥有诸如“Up Next”队列管理、资料库排序和筛选、媒体键支持以及分享当前播放歌曲的功能。它与在 Intel 和 Apple Silicon Mac 上的 macOS 15 \"Sequoia\" 兼容。用户可以下载试用版或购买完整版。"
  },
  {
    "id": "44695877",
    "title": "Where are vacation homes located in the US?",
    "url": "https://www.construction-physics.com/p/where-are-vacation-homes-located",
    "summary": "This Construction Physics article explores the distribution of vacation homes in the US using Census data.  It highlights that while vacation homes constitute about 3.5% of all US housing units, their distribution is far from uniform.\n\nFlorida leads in the sheer number of vacation homes, followed by California and New York, but when considering the *percentage* of homes that are seasonal, New England states like Maine, Vermont, and New Hampshire rank highest. The article identifies key geographic regions for vacation homes: New England, the upper Midwest, the Southeast, and the Western states.\n\nThe analysis then dives into more granular census tract data, revealing concentrations near beaches (primarily on the East and Gulf Coasts), lakes (especially in the upper Midwest), and ski resorts (in the West and Northeast).  The article also mentions vacation homes near attractions like golf courses and Disney World. Surprisingly, major cities do not have a proportionally high number of vacation homes.\n\nThe author concludes that popular vacation home locations tend to remain popular over time due to geographic amenities.  Vacation homes are highly concentrated in specific areas and near certain amenities.  Despite economic growth, the increase in vacation homes hasn't kept pace, likely due to construction costs and land use restrictions.\n",
    "chinese_title": "美国的度假屋都位于哪里？",
    "chinese_summary": "美国度假屋分布：基于人口普查数据的分析\n\n本文探讨了Construction Physics利用人口普查数据分析美国度假屋分布情况。文章指出，虽然度假屋约占美国住房总量的3.5%，但其分布极不均匀。\n\n佛罗里达州的度假屋数量最多，其次是加利福尼亚州和纽约州，但如果考虑季节性住房的*比例*，新英格兰地区的缅因州、佛蒙特州和新罕布什尔州排名最高。文章确定了度假屋的主要地理区域：新英格兰地区、中西部北部、东南部和西部各州。\n\n该分析进一步深入到更细粒度的人口普查区数据，揭示了度假屋集中在海滩附近（主要集中在东海岸和墨西哥湾沿岸）、湖泊附近（尤其是在中西部北部）以及滑雪胜地附近（在西部和东北部）。文章还提到了高尔夫球场和迪士尼世界等景点附近的度假屋。令人惊讶的是，主要城市并没有拥有比例上很高的度假屋数量。\n\n作者得出结论，由于地理优势，受欢迎的度假屋位置往往随着时间的推移仍然受欢迎。度假屋高度集中在特定区域和某些设施附近。尽管经济增长，度假屋的增长速度并未跟上，这可能是由于建筑成本和土地使用限制。"
  },
  {
    "id": "44696894",
    "title": "Arvo Pärt at 90",
    "url": "https://www.theguardian.com/music/2025/jul/24/the-god-of-small-things-celebrating-arvo-part-at-90",
    "summary": "This article celebrates Arvo Pärt's 90th birthday and explores the enduring appeal of his minimalist and spiritually-charged music. Despite differing significantly from composers like John Williams, Pärt consistently ranks among the most performed contemporary composers worldwide. His music, characterized by simplicity, silence, and spiritual depth, offers a refuge from the noise and complexity of modern life.\n\nPärt's early career was shaped by Soviet rule, leading him to experiment with modernist techniques, though facing censorship for overtly Christian themes. This led to a period of withdrawal and immersion in early sacred music, resulting in the development of his signature \"tintinnabuli\" style. This technique pairs a melodic line with a harmonic line limited to a tonic triad, creating an ethereal and introspective sound.\n\nAfter leaving Estonia in 1980, Pärt composed larger, more overtly sacred works, solidifying his unique voice in late 20th-century music. Although often called a \"holy minimalist,\" Pärt resists easy categorization, aiming for prayerfulness rather than pulsating energy. His influence extends beyond classical music, inspiring artists like Björk and Radiohead, and finding its way into film scores.\n\nThe article highlights upcoming celebrations of Pärt's 90th birthday, including performances of his newest work, Für Jan van Eyck. It emphasizes that Pärt's music provides a much-needed space for reflection and introspection in a world saturated with noise, inviting listeners to an intimate encounter with stillness and grace.\n",
    "chinese_title": "阿沃·帕特九十岁",
    "chinese_summary": "本文庆祝阿尔沃·帕特90岁诞辰，并探讨其极简主义和充满灵性的音乐的持久魅力。尽管与约翰·威廉姆斯等作曲家截然不同，帕特始终位列全球演出最多的当代作曲家之列。他的音乐以简洁、静默和精神深度为特征，为现代生活的喧嚣和复杂提供了一个避难所。\n\n帕特的早期职业生涯受到苏联统治的影响，导致他尝试现代主义技巧，但因公开的基督教主题而面临审查。这导致了一段退隐和沉浸于早期神圣音乐的时期，从而发展出他标志性的“钟鸣”风格。这种技术将旋律线与仅限于主音三和弦的和声线配对，创造出一种空灵而内省的声音。\n\n1980年离开爱沙尼亚后，帕特创作了更大规模、更公开的神圣作品，巩固了他独特的20世纪末音乐之声。虽然经常被称为“神圣极简主义者”，但帕特拒绝简单的分类，他的目标是祈祷，而不是脉动的能量。他的影响超越了古典音乐，启发了比约克和电台司令等艺术家，并融入了电影配乐。\n\n本文重点介绍了即将到来的帕特90岁诞辰庆祝活动，包括他最新作品《为扬·凡·艾克》的演出。文章强调，在充满噪音的世界中，帕特的音乐为人们提供了一个急需的反思和内省空间，邀请听众与静止和恩典进行亲密的相遇。"
  },
  {
    "id": "44700925",
    "title": "Math Is Erotic",
    "url": "https://firstthings.com/math-is-erotic/",
    "summary": "In \"Math Is Erotic,\" Matthew B. Crawford reviews J. Jacob Tawney's \"Another Sort of Mathematics,\" arguing for a renewed appreciation of mathematics as a pursuit of truth and beauty, rather than a mere tool for economic gain or critical thinking. Crawford contrasts this view with the current state of universities, which he sees as plagued by careerism, declining standards, and credentialing rather than true education. He anticipates a future where universities, freed from these pressures, can return to liberal education for its own sake, driven by a love of truth.\n\nCrawford highlights Tawney's emphasis on mathematical proofs as a means of communicating truth, which he describes as having an \"effusive nature\" and a will to commonality. He connects this idea to the etymology of \"mathematics\" as \"what can be learned\" and \"taught.\" Drawing on Heidegger, he argues that math is not just about numbers but is fundamental to how we experience and understand the world, a mode of ontology.\n\nUltimately, Crawford embraces Tawney's Platonic metaphysics, suggesting that mathematics satisfies a unique need in the human soul because of our orientation toward the good, the true, and the beautiful. He concludes that mathematics reveals a resonance between mind and cosmos, making it an erotic pursuit in the sense of being deeply attractive and fulfilling. In essence, he advocates for a revival of math as a source of wonder and profound understanding, divorced from its utilitarian applications.\n",
    "chinese_title": "数学是性感的",
    "chinese_summary": "在《数学是爱欲》一文中，马修·B·克劳福德评论了J·雅各布·托尼的《另一种数学》，主张重新认识数学，将其视为对真理和美的追求，而非仅仅是经济利益或批判性思维的工具。克劳福德将这种观点与当前大学的现状进行了对比，他认为大学充斥着功利主义、标准下降以及文凭主义，而非真正的教育。他展望未来，大学摆脱这些压力，能够回归到为了自身价值而进行的博雅教育，并由对真理的热爱所驱动。\n\n克劳福德强调了托尼对数学证明作为传达真理手段的重视，他将其描述为具有“奔放的本质”和共同性的意愿。他将这一观点与“数学”的词源联系起来，即“可以学习”和“可以教授”的东西。他借鉴海德格尔的观点，认为数学不仅仅是关于数字，而且是我们体验和理解世界的根本方式，是一种本体论模式。\n\n最终，克劳福德拥抱了托尼的柏拉图式形而上学，认为数学满足了人类灵魂的独特需求，因为我们以善、真、美为导向。他总结说，数学揭示了心灵与宇宙之间的共鸣，使其成为一种爱欲的追求，因为它具有深刻的吸引力和满足感。本质上，他提倡复兴数学，使其成为一种奇迹和深刻理解的来源，并摆脱其功利主义的应用。"
  },
  {
    "id": "44664176",
    "title": "Shallow water is dangerous too",
    "url": "https://www.jefftk.com/p/shallow-water-is-dangerous-too",
    "summary": "This article recounts a near-drowning incident involving the author's 4-year-old daughter in a shallow fountain during a family vacation. The author initially deemed the fountain safe because its 24-inch depth was within standing range for their child. Despite setting boundaries for the children, the author acknowledges that supervision wasn't constant.\n\nThe author's aunt noticed the daughter on the fountain rim and alerted the author, who then discovered the child submerged. The author quickly rescued her; fortunately, she hadn't ingested any water and was physically unharmed. The daughter explained she couldn't stand up, possibly due to her poofy dress or inexperience with buoyancy control in water. The author suspects she was underwater for approximately 15 seconds.\n\nDespite the traumatic experience, the daughter showed no signs of emotional distress. The author reflects on the incident, realizing they mistakenly equated \"standing depth\" with absolute safety and acknowledging the importance of constant supervision around water, regardless of its shallowness. The author expresses gratitude for their aunt's vigilance and their ability to rescue their daughter in time.\n",
    "chinese_title": "浅水也危险。",
    "chinese_summary": "本文讲述了作者四岁女儿在一次家庭度假中，于浅水喷泉溺水的惊险经历。作者最初认为这个喷泉是安全的，因为其24英寸的深度在孩子的站立范围内。尽管为孩子们设定了界限，但作者承认监管并非时刻到位。\n\n作者的姑姑注意到女儿在喷泉边缘，并提醒了作者，作者随即发现孩子已浸没水中。作者迅速将她救起；幸运的是，她没有呛水，身体也没有受伤。女儿解释说她站不起来，可能是因为蓬松的裙子或者缺乏在水中控制浮力的经验。作者估计她大约在水下待了15秒。\n\n尽管经历了这场创伤，女儿没有表现出任何情绪困扰。作者反思了这次事件，意识到他们错误地将“站立深度”等同于绝对安全，并认识到在水边，无论水多浅，持续监管的重要性。作者对姑姑的警惕以及及时救出女儿表示感谢。"
  },
  {
    "id": "44660656",
    "title": "Reading QR codes without a computer",
    "url": "https://qr.blinry.org/",
    "summary": "Given the title \"Reading QR codes without a computer\" and the content \"Reading QR codes without a computer!\", the article (if it can even be called that) is extremely brief and doesn't actually *explain* how to read QR codes without a computer.\n\nTherefore, the summary is:\n\nThis article is a titular announcement stating that QR codes can be read without a computer. However, it provides no further information or instruction on how to accomplish this. Essentially, the article's sole point is to affirm the possibility of reading QR codes using alternative methods. The reader is left to deduce or seek elsewhere for specific methods or tools.\n",
    "chinese_title": "无需电脑读取二维码",
    "chinese_summary": "标题：“无需电脑读取二维码”；内容：“无需电脑读取二维码！” 这篇文章（如果可以称之为文章的话）极其简短，并且实际上并没有*解释*如何无需电脑读取二维码。\n\n因此，总结是：\n\n这篇文章只是一个标题式声明，表明无需电脑即可读取二维码。 然而，它没有提供关于如何实现此操作的进一步信息或说明。 本质上，这篇文章的唯一要点是确认可以使用替代方法读取二维码的可能性。读者需要自行推断或在其他地方寻找具体的方法或工具。"
  },
  {
    "id": "44697465",
    "title": "Torqued Accelerator Using Radiation from the Sun (Tars) for Interstellar Payload",
    "url": "https://arxiv.org/abs/2507.17615",
    "summary": "This arXiv article, submitted on July 23, 2025, proposes a novel space exploration concept called \"Torqued Accelerator using Radiation from the Sun\" (TARS). Authored by David Kipping and Kathryn Lampo, the paper suggests an alternative to conventional solar sails for interstellar travel, focusing on storing solar energy as rotational kinetic energy.\n\nTARS consists of two thin surfaces with differing albedos, designed to spin up in a sub-Keplerian \"quasite\" orbit around the Sun over several weeks or months. This rotational energy is then released to propel a small, phone-sized microprobe towards interstellar space. The design leverages commercially available materials like Carbon Nanotube (CNT) sheets, allowing for a system spanning tens of meters and weighing around a kilogram.\n\nThe authors claim that TARS can achieve interstellar velocities within a year, although size grows exponentially with increased velocity targets. Relativistic speeds are deemed implausible due to this limitation. The paper also explores potential strategies to maximize velocity, including the use of graphene sheets, gravity assists, the Oberth effect, and electrostatic confinement.\n\nThe authors position TARS as a compelling alternative to high-powered directed energy systems for light sail propulsion, offering a potentially low-cost method for deploying small, sub-relativistic interstellar probes. The paper has been accepted for publication in the Journal of the British Interplanetary Society (JBIS).\n",
    "chinese_title": "利用太阳辐射的扭矩加速器（Tars）进行星际载荷运输",
    "chinese_summary": "该arXiv文章于2025年7月23日提交，提出了一种名为“利用太阳辐射的扭矩加速器”（TARS）的全新太空探索概念。该论文由David Kipping和Kathryn Lampo撰写，提出了一种替代传统太阳帆进行星际旅行的方案，重点是将太阳能存储为旋转动能。\n\nTARS由两个具有不同反照率的薄表面组成，旨在数周或数月内在亚开普勒“准轨道”上围绕太阳加速旋转。然后释放这种旋转能量，以推动一个小型、手机大小的微型探测器进入星际空间。该设计利用碳纳米管（CNT）片等商业上可获得的材料，使系统能够扩展到数十米，重量约为一公斤。\n\n作者声称，TARS可以在一年内达到星际速度，但随着速度目标的提高，尺寸呈指数增长。由于这种限制，相对论速度被认为是不可能的。该论文还探讨了最大化速度的潜在策略，包括使用石墨烯片、引力助推、奥伯特效应和静电约束。\n\n作者将TARS定位为一种引人注目的替代高功率定向能量系统推进光帆的方案，提供了一种潜在的低成本方法来部署小型、亚相对论星际探测器。该论文已被《英国星际学会杂志》（JBIS）接受发表。"
  },
  {
    "id": "44653509",
    "title": "Tinyio: A tiny (~200 line) event loop for Python",
    "url": "https://github.com/patrick-kidger/tinyio",
    "summary": "Tinyio is a lightweight (~200 lines) Python event loop designed as a simpler alternative to asyncio, particularly when robust error handling is paramount. It prioritizes crashing the entire loop and propagating errors across all coroutines and threads to ensure resources are cleaned up.\n\nKey features include:\n\n*   **`yield` syntax:** Uses `yield` instead of `await` for awaiting coroutines, offering a straightforward suspension point.\n*   **Error propagation:** Any error cancels all coroutines and threads, raising `tinyio.CancelledError`, with the original error re-raised from `loop.run`. Errors propagate to and from threads as well.\n*   **Threading:** Supports running synchronous functions in threads via `tinyio.run_in_thread`, which returns a yieldable coroutine.\n*   **Looping:** Loops can be nested, avoiding the single-loop-per-thread restriction.\n*   **Simple API:** Limited to `tinyio.Loop`, `tinyio.run_in_thread`, `tinyio.sleep`, and `tinyio.CancelledError`.\n\nTinyio is suitable for simple use cases where a basic event loop with strong error handling is needed. It sacrifices advanced features for simplicity and clear error semantics. The `tinyio.Loop().run()` function manages coroutines, allowing them to `yield` to pause, `yield coro` to await a single coroutine, or `yield [coro1, coro2, ...]` to await multiple coroutines concurrently.\n\nWhile asyncio and trio offer more features, tinyio provides a simpler and more predictable approach to error management, especially when the goal is to crash and clean up on errors.\n",
    "chinese_title": "Tinyio：一个微型的 (~200 行) Python 事件循环",
    "chinese_summary": "Tinyio 是一个轻量级的 (~200 行) Python 事件循环，旨在作为 asyncio 的一个更简单的替代方案，尤其是在强大的错误处理至关重要时。它优先考虑崩溃整个循环并将错误传播到所有协程和线程，以确保资源得到清理。\n\n主要特性包括：\n\n*   **`yield` 语法：** 使用 `yield` 而不是 `await` 来等待协程，提供了一个简单的暂停点。\n*   **错误传播：** 任何错误都会取消所有协程和线程，引发 `tinyio.CancelledError`，原始错误从 `loop.run` 重新抛出。错误也会传播到线程和从线程传播。\n*   **线程：** 支持通过 `tinyio.run_in_thread` 在线程中运行同步函数，该函数返回一个可 yield 的协程。\n*   **循环：** 循环可以嵌套，避免了每个线程单个循环的限制。\n*   **简单 API：** 仅限于 `tinyio.Loop`、`tinyio.run_in_thread`、`tinyio.sleep` 和 `tinyio.CancelledError`。\n\nTinyio 适用于需要具有强大错误处理的基本事件循环的简单用例。它牺牲了高级功能来换取简单性和清晰的错误语义。`tinyio.Loop().run()` 函数管理协程，允许它们 `yield` 来暂停，`yield coro` 来等待单个协程，或 `yield [coro1, coro2, ...]` 来并发等待多个协程。\n\n虽然 asyncio 和 trio 提供了更多功能，但 tinyio 提供了一种更简单、更可预测的错误管理方法，尤其是在目标是崩溃并在出错时清理的情况下。"
  },
  {
    "id": "44701175",
    "title": "Don't give children under age 13 smartphones",
    "url": "https://www.cnn.com/2025/07/21/health/smartphones-not-safe-preteens-wellness",
    "summary": "This CNN article argues against giving smartphones to children under 13 due to potential negative impacts on their mental health. A new study found that smartphone use before age 13 is associated with suicidal thoughts, poor emotional regulation, low self-worth, and detachment from reality, particularly in girls. These issues are linked to increased social media access, sleep disruptions, cyberbullying, and strained family relationships.\n\nThe study's author advocates for global restrictions on smartphone and social media access for children under 13 and suggests more nuanced regulation of the digital environment. Social psychologist Jonathan Haidt supports waiting until 16 to introduce social media.\n\nThe article suggests parents should collectively agree to delay smartphone use, consider signing pledges like the \"Wait Until 8th\" pledge, and advocate for stronger school policies regarding smartphones. Even if a child already has a smartphone, parents can implement parental controls, switch to a flip phone, or delete apps.\n\nThe author advises parents to openly communicate with their children about the potential downsides of smartphone use, offer support, and seek professional help if needed. The article emphasizes that these are societal problems requiring collaborative solutions beyond individual parenting choices.\n",
    "chinese_title": "不要给13岁以下儿童使用智能手机。",
    "chinese_summary": "这篇CNN文章认为不应给13岁以下儿童使用智能手机，因为它可能对他们的心理健康产生负面影响。一项新研究发现，13岁前使用智能手机与自杀意念、情绪调节能力差、自尊心低以及脱离现实有关，尤其是在女孩中。这些问题与社交媒体访问增加、睡眠中断、网络欺凌以及紧张的家庭关系有关。\n\n该研究的作者主张全球限制13岁以下儿童使用智能手机和访问社交媒体，并建议对数字环境进行更细致的监管。社会心理学家乔纳森·海特支持等到16岁再开始使用社交媒体。\n\n文章建议父母们集体同意推迟智能手机的使用，考虑签署像“等到八年级”这样的承诺，并倡导更严格的学校智能手机政策。即使孩子已经拥有智能手机，父母也可以实施家长控制、改用翻盖手机或删除应用程序。\n\n作者建议父母与孩子公开沟通智能手机使用的潜在弊端，提供支持，并在需要时寻求专业帮助。文章强调，这些是社会问题，需要超越个人育儿选择的协作解决方案。"
  },
  {
    "id": "44702319",
    "title": "Grizzlies Were Raiding Montana Farms. Then Came Some Formidable Dogs",
    "url": "https://www.nytimes.com/2025/07/22/climate/montana-grizzly-bears-guard-dogs.html",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "灰熊袭击蒙大拿农场，之后来了一些强大的狗。",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "44658009",
    "title": "Font-size-adjust Is Useful",
    "url": "https://matklad.github.io/2025/07/16/font-size-adjust.html",
    "summary": "This article argues that the CSS property `font-size-adjust` is widely misunderstood and underutilized.  The author begins by explaining that `font-size` specifies the size of a box around a glyph, not the glyph itself, leading to inconsistencies in how fonts of the same size appear.  `font-size-adjust` allows scaling fonts based on a specific metric, like the \"ex-height,\" to achieve better visual consistency.\n\nThe author critiques the conventional use of `font-size-adjust` as a tool solely for font fallback scenarios, deeming it less compelling due to readily available alternatives like font embedding and `font-display`. Instead, the author proposes a more proactive approach: employing `font-size-adjust` to standardize font sizes across an entire webpage, irrespective of font fallback. This ensures consistency when using multiple fonts or when the font selection changes in the future. The author recommends incorporating `font-size-adjust: ex-height 0.53;` into a CSS reset, arguing it provides a consistent base ratio for font sizing. While 0.53 is based on Helvetica, any value in that range should improve overall visual harmony.\n",
    "chinese_title": "字体大小调整很有用",
    "chinese_summary": "本文认为CSS属性`font-size-adjust`被广泛误解和未被充分利用。作者首先解释`font-size`指定的是字形周围的盒子大小，而不是字形本身，导致相同大小的字体呈现出不一致的效果。`font-size-adjust`允许基于特定指标（如“x高度”）缩放字体，从而实现更好的视觉一致性。\n\n作者批评了将`font-size-adjust`仅作为字体回退场景工具的传统用法，认为由于字体嵌入和`font-display`等现成替代方案的存在，这种用法不太引人注目。相反，作者提出了一种更积极的方法：无论字体回退如何，都应使用`font-size-adjust`来标准化整个网页上的字体大小。这确保了使用多种字体或将来字体选择发生变化时的一致性。作者建议将`font-size-adjust: ex-height 0.53;`纳入CSS reset中，认为它为字体大小调整提供了一个一致的基础比例。虽然0.53是基于Helvetica，但该范围内的任何值都应改善整体视觉和谐性。"
  },
  {
    "id": "44656961",
    "title": "The rise and fall of the Hanseatic League",
    "url": "https://worksinprogress.co/issue/the-rise-and-fall-of-the-hanseatic-league/",
    "summary": "The article details the rise of the Hanseatic League and its impact on Northern European trade. Initially, Europe struggled with subsistence after the Roman Empire's collapse, but agricultural advancements and a warming climate led to increased crop yields and population growth, fostering a resurgence in trade and the artisan class.\n\nEarly merchants faced numerous obstacles, including piracy, tolls, and inconsistent local laws. To mitigate these risks, merchants formed \"hansas,\" armed groups that collectively negotiated for trade rights and protection. These hansas evolved into the Hanseatic League, a powerful trading network spanning Northern Europe.\n\nThe League facilitated long-distance trade, transforming local crafts into proto-industrial scales. Examples include the Scandinavian cured fish industry, which processed millions of herrings annually, and the English wool trade, which fueled the construction of impressive \"wool churches.\" The League's influence extended to the development of specialized trade centers like Bruges, which became a major hub for European commerce.\n\nThe development of the Cog ship was also key, even though the earlier Knarr ship was faster, by the 13th century merchants began to opt for the Cog ship.\n\nUltimately, the Hanseatic League secured trade routes, boosted European state capacity for commerce, and left an enduring legacy despite internal struggles and eventual decline.\n",
    "chinese_title": "汉萨同盟的兴衰",
    "chinese_summary": "汉萨同盟的崛起及其对北欧贸易的影响。文章详述了汉萨同盟的兴起及其对北欧贸易的影响。罗马帝国崩溃后，欧洲初期在生存线上挣扎，但农业进步和气候变暖带来了作物产量增加和人口增长，促进了贸易和工匠阶层的复苏。\n\n早期商人面临诸多障碍，包括海盗、通行费和不一致的地方法律。为了减轻这些风险，商人组成了“汉萨”，即为贸易权和保护进行集体谈判的武装团体。这些汉萨逐渐发展成为汉萨同盟，一个强大的贸易网络遍布北欧。\n\n同盟促进了长途贸易，将本地手工艺品转变为原始工业规模。例如，斯堪的纳维亚腌鱼业每年加工数百万条鲱鱼，英国羊毛贸易则推动了令人印象深刻的“羊毛教堂”的建造。同盟的影响力扩展到专业贸易中心的发展，如布鲁日，该地成为欧洲重要的商业枢纽。\n\n科格船的出现也至关重要，尽管早期的克纳尔船速度更快，但到了13世纪，商人开始选择科格船。\n\n最终，汉萨同盟确保了贸易路线，提高了欧洲各国的商业能力，并留下了持久的遗产，尽管内部存在斗争并最终衰落。"
  },
  {
    "id": "44654031",
    "title": "Large ancient Hawaiian petroglyphs uncovered by waves on Oahu",
    "url": "https://www.sfgate.com/hawaii/article/hawaii-petroglyphs-uncovered-20780579.php",
    "summary": "The SFGate article reports the discovery of a large collection of ancient Hawaiian petroglyphs on Oahu's North Shore. These petroglyphs, believed to be hundreds of years old, were uncovered by recent wave action that eroded sand from a previously submerged or covered section of coastline.\n\nThe petroglyphs depict various human and animal figures, as well as geometric shapes. Their size and number make this discovery significant, adding to the understanding of ancient Hawaiian life and artistic expression on Oahu. While the exact meaning and purpose of the petroglyphs are still under investigation by archaeologists and cultural experts, they likely represent important aspects of daily life, genealogy, storytelling, or religious beliefs.\n\nThe article emphasizes the fragility of the petroglyphs and the importance of protecting them from further erosion, vandalism, and the elements. Experts are working to document and study the petroglyphs, and measures are being considered to preserve them for future generations. The location of the find is being kept relatively secret to prevent potential damage. The discovery highlights the dynamic nature of Hawaii's coastline and the potential for further archaeological discoveries to be made as sea levels fluctuate and erosion occurs.\n",
    "chinese_title": "欧胡岛海浪冲刷出大型古代夏威夷岩画",
    "chinese_summary": "SFGate报道：瓦胡岛北岸发现大量夏威夷古老岩画。这些岩画据信有数百年历史，近期海浪侵蚀了先前淹没或覆盖的海岸线沙土后才得以重见天日。\n\n岩画描绘了各种人物、动物形象以及几何形状。其规模和数量使得这项发现意义重大，有助于进一步了解古代夏威夷的生活和瓦胡岛的艺术表达。虽然考古学家和文化专家仍在调查岩画的确切含义和目的，但它们可能代表着日常生活的各个重要方面、谱系、故事讲述或宗教信仰。\n\n该文章强调了岩画的脆弱性以及保护它们免受进一步侵蚀、破坏和自然环境影响的重要性。专家们正在努力记录和研究这些岩画，并正在考虑采取措施为后代保护它们。发现地点相对保密，以防止潜在的破坏。这项发现突显了夏威夷海岸线的动态变化，以及随着海平面波动和侵蚀发生，未来可能做出更多考古发现的潜力。"
  },
  {
    "id": "44656516",
    "title": "Breaking the WASM/JS communication performance barrier",
    "url": "https://github.com/ealmloff/sledgehammer_bindgen",
    "summary": "Sledgehammer bindgen is a Rust tool designed to provide faster batched bindings for JavaScript code, aiming to overcome performance barriers in WASM/JS communication. Unlike wasm-bindgen, which is more general-purpose, Sledgehammer is specifically optimized for web frameworks requiring low-level, fast DOM access. It's compatible with wasm-bindgen and can be used alongside it.\n\nSledgehammer's speed advantages stem from several key optimizations:\n\n*   **String Decoding:** It minimizes expensive string decoding by decoding strings in batches instead of individually, reducing the overhead of `TextDecoder.decode`. For small strings, it leverages JavaScript decoding for further efficiency.\n*   **String Caching:** It employs string caching in JavaScript to prevent redundant decoding of the same strings, particularly benefiting from hashing by pointer for static strings.\n*   **Byte Encoded Operations:** Operations are encoded as byte sequences packed into arrays. Batches of four operations are encoded as a `u32`, which is then split into individual bytes. This strategy minimizes the number of reads from the array buffer and allows for optimized inlining of reads within JavaScript.\n",
    "chinese_title": "打破WASM/JS通信性能壁垒",
    "chinese_summary": "Sledgehammer bindgen 是一款 Rust 工具，旨在为 JavaScript 代码提供更快的批量绑定，从而克服 WASM/JS 通信中的性能瓶颈。与更通用的 wasm-bindgen 不同，Sledgehammer 专门针对需要低级别、快速 DOM 访问的 Web 框架进行了优化。它与 wasm-bindgen 兼容，可以与其一起使用。\n\nSledgehammer 的速度优势源于以下几个关键优化：\n\n*   **字符串解码：** 它通过批量解码字符串而非单独解码，最大限度地减少了昂贵的字符串解码，从而降低了 `TextDecoder.decode` 的开销。对于小字符串，它利用 JavaScript 解码以进一步提高效率。\n*   **字符串缓存：** 它在 JavaScript 中使用字符串缓存，以防止重复解码相同的字符串，尤其受益于通过指针进行静态字符串的哈希处理。\n*   **字节编码操作：** 操作被编码为打包到数组中的字节序列。 每批四个操作被编码为一个 `u32`，然后将其拆分为单个字节。 这种策略最大限度地减少了从数组缓冲区读取的次数，并允许在 JavaScript 中优化读取的内联。"
  },
  {
    "id": "44696167",
    "title": "Test Results for AMD Zen 5",
    "url": "https://www.agner.org/forum/viewtopic.php?t=287&start=10",
    "summary": "The article, titled \"Test Results for AMD Zen 5,\" indicates that test results for the AMD Zen 5 processor are available. The author, likely overseeing the testing process, mentions that an error message encountered can be disregarded because they have already obtained the test results from another source. They are currently revising the scripts used for testing and offer to share the revised scripts with the recipient of the message, jfonseca. In essence, the key takeaway is that the Zen 5 test results exist and the author is refining the testing process based on them.\n",
    "chinese_title": "AMD Zen 5 测试结果",
    "chinese_summary": "AMD Zen 5 测试结果已出，文章表明AMD Zen 5处理器的测试结果已经可用。作者（可能负责监督测试过程）提到，遇到的一个错误信息可以忽略，因为他们已经从其他来源获得了测试结果。他们目前正在修改用于测试的脚本，并表示愿意与消息接收者jfonseca分享修改后的脚本。本质上，关键信息是Zen 5的测试结果存在，并且作者正在根据这些结果改进测试过程。"
  },
  {
    "id": "44658665",
    "title": "Inverted Indexes: A Step-by-Step Implementation Guide (2023)",
    "url": "https://www.chashnikov.dev/post/inverted-indexes-a-step-by-step-implementation-guide",
    "summary": "This article provides a step-by-step guide to implementing an inverted index for efficient document search. It begins by explaining the necessity of inverted indexes, contrasting them with naive document scanning methods and highlighting their scalability. The core concept involves mapping words (tokens) to the document IDs where they appear, enabling fast lookups for search queries.\n\nThe article then walks through the Scala implementation of an `InvertedIndex` class, demonstrating how to add tokens and retrieve documents associated with them. It introduces an `IndexGenerator` class, which reads files, processes the text into tokens (including basic cleanup and stop-word removal), and populates the inverted index.\n\nTo improve performance, the article incorporates multi-threading. It adds a `merge` method to the `InvertedIndex` class to combine indexes generated by different threads. The `runIndexer` function splits the files to be indexed into groups, processes each group in parallel using Scala's parallel collections (`.par`), and merges the resulting indexes into a final, comprehensive index. This parallel processing leverages multi-core CPUs for faster indexing. The article concludes by summarizing the key takeaways and providing a link to a GitHub repository with the complete code, tests, and benchmarking.\n",
    "chinese_title": "倒排索引：循序渐进的实现指南（2023）",
    "chinese_summary": "本文提供了一个逐步指南，用于实现倒排索引以进行高效的文档搜索。它首先解释了倒排索引的必要性，将其与朴素的文档扫描方法进行对比，并强调了其可扩展性。其核心概念是将单词（令牌）映射到它们出现的文档 ID，从而可以快速查找搜索查询。\n\n然后，本文逐步介绍了 `InvertedIndex` 类的 Scala 实现，演示了如何添加令牌以及检索与它们关联的文档。它引入了 `IndexGenerator` 类，该类读取文件，将文本处理成令牌（包括基本清理和停用词删除），并填充倒排索引。\n\n为了提高性能，本文采用了多线程。它向 `InvertedIndex` 类添加了一个 `merge` 方法，用于合并由不同线程生成的索引。 `runIndexer` 函数将要索引的文件分成组，使用 Scala 的并行集合（`.par`）并行处理每个组，并将生成的索引合并成一个最终的、全面的索引。这种并行处理利用多核 CPU 来实现更快的索引。文章最后总结了主要内容，并提供了一个 GitHub 存储库的链接，其中包含完整的代码、测试和基准测试。"
  },
  {
    "id": "44692876",
    "title": "Rust running on every GPU",
    "url": "https://rust-gpu.github.io/blog/2025/07/25/rust-on-every-gpu/",
    "summary": "This article discusses a demo showcasing cross-platform GPU compute using Rust, allowing the same Rust codebase to run on various GPU platforms: CUDA (NVIDIA), SPIR-V (Vulkan-compatible GPUs), Metal (Apple), DirectX 12 (Windows), WebGPU (browsers), and CPU fallback. This eliminates the need for specialized shader languages and reduces complexity by using standard Rust code for both host and device.\n\nThe author highlights three key projects enabling this: Rust GPU (compiles Rust to SPIR-V), Rust CUDA (compiles Rust to NVVM IR for NVIDIA), and Naga (a translation layer between shading languages). By bringing these projects together, the demo achieves unprecedented portability.\n\nThe demo implements a bitonic sort algorithm, sharing the same generic code across all targets. Backend selection is controlled via Cargo feature flags, allowing users to choose specific driver APIs (e.g., Vulkan via `ash`, CUDA via `cust`, or the system default via `wgpu`). Kernels are compiled during the build process and embedded into the binary.\n\nThe article also emphasizes Rust's strengths for GPU programming: `no_std` support, conditional compilation, newtypes, enums, traits, inlining, struct composition, memory layout control, pattern matching, and generics. These features enable writing type-safe, efficient, and maintainable GPU code with compile-time checks, reducing runtime errors and leveraging zero-cost abstractions.\n",
    "chinese_title": "在所有 GPU 上运行 Rust",
    "chinese_summary": "本文探讨了一个演示，展示了使用 Rust 实现的跨平台 GPU 计算，允许相同的 Rust 代码库在各种 GPU 平台上运行：CUDA (NVIDIA)、SPIR-V (Vulkan 兼容 GPU)、Metal (Apple)、DirectX 12 (Windows)、WebGPU (浏览器) 以及 CPU 回退。这消除了对专用着色器语言的需求，并通过对主机和设备使用标准 Rust 代码来降低复杂性。\n\n作者重点介绍了促成这一点的三个关键项目：Rust GPU（将 Rust 编译为 SPIR-V）、Rust CUDA（将 Rust 编译为 NVIDIA 的 NVVM IR）和 Naga（着色语言之间的翻译层）。通过将这些项目结合在一起，该演示实现了前所未有的可移植性。\n\n该演示实现了一个双调排序算法，在所有目标平台上共享相同的通用代码。后端选择通过 Cargo 特性标志控制，允许用户选择特定的驱动程序 API（例如，通过 `ash` 使用 Vulkan、通过 `cust` 使用 CUDA，或通过 `wgpu` 使用系统默认设置）。内核在构建过程中编译并嵌入到二进制文件中。\n\n文章还强调了 Rust 在 GPU 编程方面的优势：`no_std` 支持、条件编译、newtypes、枚举、traits、内联、结构体组合、内存布局控制、模式匹配和泛型。这些特性使得编写类型安全、高效且可维护的 GPU 代码成为可能，并具有编译时检查，从而减少了运行时错误并利用了零成本抽象。"
  },
  {
    "id": "44702147",
    "title": "'Japanese First': The deep roots of the rising far right",
    "url": "https://www.france24.com/en/asia-pacific/20250723-japanese-first-the-deep-roots-of-the-rising-far-right",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "“日本人优先”：崛起极右势力的深层根源",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "44699437",
    "title": "Beyond Food and People",
    "url": "https://aeon.co/essays/nietzsches-startling-provocation-youre-edible-and-delicious",
    "summary": "This Aeon essay explores the tension between human exceptionalism and the growing awareness of our interconnectedness with the natural world, or \"entanglement.\" While many embrace entanglement as a path to ecological harmony, the author argues that it often ignores the darker side: our vulnerability and edibility within the natural order.\n\nDrawing on the experience of eco-philosopher Val Plumwood's crocodile attack, the essay highlights the difficulty of reconciling our perception of ourselves as \"people\" with the reality of being \"food.\" The author then introduces Nietzsche's philosophy, arguing that his critiques of traditional morality, particularly the hatred of suffering and the belief in free will, contribute to the denial of our immersion in nature.\n\nNietzsche saw suffering as a necessary part of nature and the illusion of free will as a barrier separating us from the natural world. Instead, he proposes \"will to power\" as a way to understand agency as relational forces.\n\nThe essay concludes by illustrating how environmental changes and technology demonstrate the increasing permeability of human boundaries. We are becoming more aware that various natural and technological elements influence our bodies and minds. Accepting this entanglement requires a shift away from exceptionalist views and towards a more nuanced understanding of our place within the relentless processes of nature.\n",
    "chinese_title": "超越食物与人",
    "chinese_summary": "这篇Aeon文章探讨了人类例外论与我们日益增长的对与自然世界的相互关联，或“纠缠”的认识之间的张力。虽然许多人拥抱纠缠作为通往生态和谐的道路，但作者认为这常常忽略了阴暗面：我们在自然秩序中的脆弱性和可食用性。\n\n文章借鉴生态哲学家瓦尔·普拉姆伍德的鳄鱼袭击经历，强调了协调我们对自身作为“人”的认知与作为“食物”的现实之间的困难。然后，作者介绍了尼采的哲学，认为他对传统道德的批判，特别是对苦难的憎恨和对自由意志的信仰，导致了对我们沉浸于自然的否认。\n\n尼采认为苦难是自然的必要组成部分，而自由意志的幻觉是将我们与自然世界隔离开来的屏障。相反，他提出了“权力意志”作为理解行动力为关系力量的方式。\n\n文章最后阐述了环境变化和技术如何证明人类边界日益渗透。我们越来越意识到各种自然和技术要素影响着我们的身体和思想。接受这种纠缠需要从例外论的观点转变，转向更细致地理解我们在无情的自然过程中的位置。"
  },
  {
    "id": "44693129",
    "title": "Bringing a decade old bicycle navigator back to life with open source software",
    "url": "https://raymii.org/s/blog/Bringing_a_Decade_Old_Bicycle_Navigator_Back_to_Life_with_Open_Source_Software_and_DOOM.html",
    "summary": "Remy van Elst revitalized a decade-old Navman Bike 1000 (a rebadged Mio Cyclo 200) bicycle navigator using open-source software after being frustrated by the device's outdated maps and the manufacturer's planned obsolescence.\n\nThe article details the process of reverse engineering the device, discovering it runs Windows CE 6.0. Using tools like mitmproxy and WireShark, Remy analyzed the desktop software's network traffic, identifying URLs for software and map updates, which were unfortunately no longer active.\n\nRemy gained access to the device's file system by connecting it to a PC via USB, discovering two drives: one for .gpx tracks and the other for the entire Windows CE system. This allowed him to replace the \"DODGE.exe\" program with Total Commander, enabling file system browsing and the execution of other Windows CE applications, including DOOM.\n\nUltimately, the article showcases the successful integration of NAVeGIS, an open-source Windows Mobile/CE navigation application, with OpenStreetMap data from OpenFietsMap. This enabled the device to use up-to-date bicycle maps for navigation, overcoming the limitations of the original, outdated software. While features like GPS track recording and audio hints are absent, the core navigation functionality is restored. Remy also expresses a desire for legislation requiring manufacturers to open-source software and hardware for discontinued devices to combat e-waste.\n",
    "chinese_title": "用开源软件复活一台十年的自行车导航仪",
    "chinese_summary": "雷米·范·埃尔斯特使用开源软件，让一台十年之久的Navman Bike 1000（一款重新贴牌的Mio Cyclo 200）自行车导航仪重获新生。此前，他因设备过时的地图和制造商的有计划淘汰策略而感到沮丧。\n\n文章详细介绍了逆向工程该设备的过程，发现它运行的是Windows CE 6.0。雷米使用mitmproxy和WireShark等工具分析了桌面软件的网络流量，识别出软件和地图更新的URL，但不幸的是，这些URL已经失效。\n\n通过USB将设备连接到PC，雷米获得了对设备文件系统的访问权限，发现了两个驱动器：一个用于.gpx轨迹，另一个用于整个Windows CE系统。这使他能够用Total Commander替换“DODGE.exe”程序，从而实现文件系统浏览和执行其他Windows CE应用程序，包括DOOM。\n\n最终，文章展示了成功将NAVeGIS（一个开源的Windows Mobile/CE导航应用程序）与来自OpenFietsMap的OpenStreetMap数据集成。这使得该设备能够使用最新的自行车地图进行导航，克服了原始、过时软件的限制。虽然缺少GPS轨迹记录和音频提示等功能，但核心导航功能已恢复。雷米还表达了希望立法要求制造商为已停产设备开源软件和硬件，以对抗电子垃圾的愿望。"
  },
  {
    "id": "44700558",
    "title": "Wikipedia: Signs of AI Writing",
    "url": "https://en.wikipedia.org/wiki/Wikipedia:Signs_of_AI_writing",
    "summary": "This Wikipedia advice page, \"Signs of AI Writing,\" helps identify text potentially generated by AI chatbots like ChatGPT in Wikipedia articles. It emphasizes that while AI detection tools exist, human judgment is crucial, as AI is trained on human writing and similarities can occur naturally.\n\nThe page outlines common language and tone indicators in AI writing, including:\n\n*   **Undue Emphasis on Symbolism and Importance:** Overusing phrases that inflate the subject's significance (e.g., \"stands as a testament,\" \"watershed moment\").\n*   **Promotional Language:** Employing overly positive descriptors, especially regarding cultural heritage (e.g., \"rich cultural heritage,\" \"stunning natural beauty\").\n*   **Editorializing:** Introducing personal interpretations, analysis, or opinions, violating the \"No original research\" policy.\n*   **Overuse of Certain Conjunctives:** Excessively using connecting words like \"moreover\" or \"furthermore,\" leading to an essay-like tone.\n*   **Section Summaries:** Ending sections with summaries and restatements of the main idea, which is generally inappropriate for Wikipedia.\n*   **Negative Parallelisms:** Using constructions such as \"Not only ... but ...\"\n*   **Superficial analyses:** Attaching gerund phrases (\"-ing\") to the end of sentences to comment on information and its significance.\n*   **Vague Attributions of Opinion:** Attributing claims to unspecified authorities (e.g., \"Industry reports,\" \"Some critics argue\").\n\nThe page also identifies style indicators, such as the incorrect use of title case in section headings, excessive boldface, and specific list formatting. The overall goal is to help editors identify and revise AI-generated text to ensure it adheres to Wikipedia's Manual of Style and maintains a neutral, objective tone.\n",
    "chinese_title": "维基百科：人工智能写作的迹象",
    "chinese_summary": "维基百科建议页面“人工智能写作的迹象”旨在帮助识别维基百科文章中可能由人工智能聊天机器人（如ChatGPT）生成的文本。它强调，尽管存在人工智能检测工具，但人工判断至关重要，因为人工智能是基于人类写作训练的，相似之处可能自然发生。\n\n该页面概述了人工智能写作中常见的语言和语气指标，包括：\n\n*   **过度强调象征意义和重要性：** 过度使用夸大主题重要性的短语（例如，“是……的证明”、“分水岭时刻”）。\n*   **推广性语言：** 采用过于积极的描述词，尤其是在文化遗产方面（例如，“丰富的文化遗产”、“令人惊叹的自然美景”）。\n*   **评论性写作：** 引入个人解释、分析或观点，违反“禁止原创研究”政策。\n*   **过度使用某些连接词：** 过度使用连接词（如“此外”、“而且”），导致文章式的语气。\n*   **章节总结：** 以总结和重述主要思想结束章节，这通常不适合维基百科。\n*   **否定平行结构：** 使用诸如“不仅……而且……”之类的结构。\n*   **肤浅的分析：** 在句子末尾附加动名词短语（“-ing”）来评论信息及其重要性。\n*   **模糊的观点归属：** 将主张归于未指明的权威机构（例如，“行业报告”、“一些评论家认为”）。\n\n该页面还识别出风格指标，例如章节标题中不正确的使用标题大小写、过度使用粗体以及特定的列表格式。总体目标是帮助编辑识别和修改人工智能生成的文本，以确保其符合维基百科的格式手册并保持中立、客观的语气。"
  },
  {
    "id": "44691935",
    "title": "Simon Tatham's Portable Puzzle Collection",
    "url": "https://www.chiark.greenend.org.uk/~sgtatham/puzzles/",
    "summary": "Simon Tatham's Portable Puzzle Collection is a set of single-player puzzle games designed to run natively on Unix (GTK) and Windows, with web versions available as JavaScript or Java applets. The author created the collection to provide small, engaging desktop games accessible across multiple platforms.\n\nThe collection consists of reimplementations of existing puzzle concepts, with some contributions from other authors. The page provides links to play each puzzle on the web (JavaScript/WebAssembly or Java), download the Windows binary, and access the game's manual. A single bundle is available for download for all other platforms.\n\nThe collection includes various puzzles such as Black Box, Bridges, Cube, Dominosa, Fifteen, and many more, totaling around 39 different games.\n\nThe puzzles are distributed under the MIT license, allowing users to freely use and modify the games, except claiming authorship or holding the author liable for issues. The page provides download links for Windows executables, a help file, a .zip archive, and an MSI installer. A source archive is also available for compiling the games on Unix systems.\n\nThe project is open to contributions, with developer documentation available for creating new puzzles or front ends. The development sources are accessible through a git repository. Bug reports and patches are welcomed.\n\nThe author is no longer able to build the MacOS version but invites someone to volunteer to maintain the Mac front end code.\n",
    "chinese_title": "西蒙·塔特姆的便携谜题集",
    "chinese_summary": "西蒙·塔瑟姆的便携谜题合集是一组单人谜题游戏，旨在本地运行于 Unix (GTK) 和 Windows，并提供 JavaScript 或 Java 小程序的网页版本。作者创建此合集是为了提供可在多个平台上访问的小型、引人入胜的桌面游戏。\n\n该合集由现有谜题概念的重新实现组成，其中包含其他作者的一些贡献。该页面提供了链接，可用于在网页上玩每个谜题（JavaScript/WebAssembly 或 Java）、下载 Windows 二进制文件，以及访问游戏手册。所有其他平台均可下载单个捆绑包。\n\n该合集包括各种谜题，例如黑盒、桥、立方体、多米诺、十五等，总共约有 39 种不同的游戏。\n\n这些谜题在 MIT 许可下发布，允许用户自由使用和修改游戏，但不得声称拥有作者身份或让作者对问题负责。该页面提供了 Windows 可执行文件、帮助文件、.zip 压缩包和 MSI 安装程序的下载链接。还提供源代码存档，用于在 Unix 系统上编译游戏。\n\n该项目欢迎贡献，并提供开发者文档，用于创建新的谜题或前端。可以通过 git 存储库访问开发源。欢迎提交错误报告和补丁。\n\n作者已无法构建 MacOS 版本，但邀请某人自愿维护 Mac 前端代码。"
  },
  {
    "id": "44657803",
    "title": "Yes, the Book of PF, Fourth Edition Is Coming Soon",
    "url": "https://bsdly.blogspot.com/2025/07/yes-book-of-pf-4th-edition-is-coming.html",
    "summary": "Peter N. M. Hansteen announces the upcoming fourth edition of \"The Book of PF,\" slated for release in the second half of 2025. The new edition is updated to reflect the modern internet landscape, focusing on OpenBSD 7.8 and FreeBSD 14-STABLE.\n\nThe primary reason for the update after a long gap is to align the book with recent changes and advancements in network technology and the PF implementation on both operating systems. While user-visible changes were initially minimal, the need became apparent due to accumulated incremental updates and shifts in the broader networking environment.\n\nThe fourth edition will retain the familiar structure and chapter titles of previous editions, but the content will be thoroughly revised to address modern challenges and incorporate new features. NetBSD's shift to NPF and DragonFly BSD's outdated PF version prompted a focus on OpenBSD and FreeBSD. FreeBSD gets significantly more attention this time around.\n\nHansteen highlights that the editing process involved extensive review by Henning Brauer and Kristof Provost, ensuring accuracy and relevance. He plans to present the book at EuroBSDCon 2025 in Zagreb, alongside a revised Network Management with the OpenBSD Packet Filter Toolset tutorial. The book is available for preorder now.\n",
    "chinese_title": "是的，《PF之书》第四版即将面世",
    "chinese_summary": "Peter N. M. Hansteen 宣布《PF 之书》第四版即将面世，预计于 2025 年下半年发布。新版本已更新以反映现代互联网格局，重点关注 OpenBSD 7.8 和 FreeBSD 14-STABLE。\n\n经过长时间的间隔进行更新的主要原因是使本书与网络技术和两个操作系统上 PF 实现的最新变化和进步保持一致。虽然最初用户可见的更改很少，但由于累积的增量更新和更广泛的网络环境的变化，这种需求变得显而易见。\n\n第四版将保留先前版本的熟悉结构和章节标题，但内容将进行彻底修订，以应对现代挑战并整合新功能。NetBSD 转向 NPF 以及 DragonFly BSD 过时的 PF 版本促使人们关注 OpenBSD 和 FreeBSD。这次 FreeBSD 受到了更多的关注。\n\nHansteen 强调，编辑过程包括 Henning Brauer 和 Kristof Provost 的广泛审查，以确保准确性和相关性。他计划在萨格勒布举行的 EuroBSDCon 2025 上展示这本书，同时还将展示修订后的“使用 OpenBSD 数据包过滤器工具集进行网络管理”教程。该书现已接受预订。"
  },
  {
    "id": "44693815",
    "title": "The Rise of Shippable Microfactories",
    "url": "https://www.thesisdriven.com/p/the-rise-of-shippable-microfactories",
    "summary": "This article, \"The Rise of Shippable Microfactories,\" explores a new approach to prefabricated construction that addresses the challenges of traditional, centralized prefab models. Instead of shipping bulky housing components from large, fixed factories, the microfactory model involves shipping compact, automated production units (often container-sized) directly to the construction site.\n\nThe author argues that microfactories invert the traditional factory model, offering the benefits of off-site fabrication (automation, efficiency) without the high upfront costs, shipping expenses, and utilization challenges associated with mega-factories. The core idea is to increase factory \"Usage\" (the fraction of time the factory is actively producing) by amortizing the capital cost over multiple projects due to its portability.\n\nThe article outlines a spectrum of microfactory configurations, from lightweight robotic framing units (like AUAR) to full-scale turnkey building plants (like Cuby and Reframe Systems), and hybrid approaches like on-site CNC fabrication (Facit Homes). It emphasizes that microfactories aim to meet or beat conventional construction costs while adding efficiency.\n\nA real-world example, AUAR's use of a microfactory to construct a two-story office building in Belgium, is presented, showcasing the potential for significant reductions in framing labor and project timelines. The article concludes by acknowledging the technical hurdles that remain but expresses optimism about the future growth and transformative potential of shippable microfactories in the construction industry.\n",
    "chinese_title": "可运输微型工厂的崛起",
    "chinese_summary": "可运输微型工厂的兴起\n\n本文探讨了一种新型预制建筑方法，它解决了传统集中式预制模式的挑战。微型工厂模式并非从大型固定工厂运输笨重的房屋组件，而是将紧凑型自动化生产单元（通常为集装箱大小）直接运送到施工现场。\n\n作者认为，微型工厂颠覆了传统的工厂模式，提供了异地建造的优势（自动化、效率），同时避免了与大型工厂相关的高昂前期成本、运输费用和利用率挑战。其核心思想是通过可移植性在多个项目中分摊资本成本，从而提高工厂的“使用率”（工厂实际生产时间所占的比例）。\n\n本文概述了微型工厂配置的范围，从轻型机器人框架单元（如AUAR）到全尺寸交钥匙建筑工厂（如Cuby和Reframe Systems），以及混合方法（如现场CNC制造，Facit Homes）。文章强调，微型工厂旨在达到或低于传统建筑成本，同时提高效率。\n\n文章介绍了一个真实案例，即AUAR使用微型工厂在比利时建造一座两层办公楼，展示了大幅减少框架劳动力和项目时间表的潜力。文章最后承认仍然存在技术障碍，但对可运输微型工厂在建筑行业的未来增长和变革潜力表示乐观。"
  },
  {
    "id": "44662280",
    "title": "Meta Unveils Wristband for Controlling Computers with Hand Gestures",
    "url": "https://www.nytimes.com/2025/07/23/science/meta-computer-wristband-reardon.html",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "Meta发布腕带，通过手势控制电脑",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "44660547",
    "title": "Millet mystery: A staple crop failed to take root in ancient Japanese kitchens",
    "url": "https://phys.org/news/2025-07-millet-mystery-staple-crop-root.html",
    "summary": "This article discusses research into why millet, a staple crop in Korea, failed to become a significant part of the ancient Japanese diet despite being introduced around the same time as rice, approximately 3,000 years ago. Researchers from the University of York, University of Cambridge, and the Nara National Research Institute for Cultural Properties analyzed residues in ancient pottery and charred plant remains.\n\nThe study revealed that while both rice and millet were present in early Japanese farming settlements, rice transformed society while millet was largely ignored. The absence of millet in food residues and human bones was surprising, as environmental factors were not a barrier to its growth. The research suggests established culinary traditions, specifically fish-based dishes, were a more significant factor than the simple availability of a new crop.\n\nDespite the adoption of Korean pottery and farming tools, Japanese cooking practices remained largely unchanged, with Yayoi pots still used primarily for cooking fish and wild foods rather than rice. This indicates that food culture is deeply embedded and can resist technological shifts. The findings are part of the ENCOUNTER Project, which explores the diffusion of farming and its cultural impacts in Japan. This research highlights that technological developments don't always lead to immediate cultural changes, and established practices can persist for extended periods.\n",
    "chinese_title": "小米之谜：一种主要的农作物未能扎根于古代日本厨房",
    "chinese_summary": "本文探讨了对小米的研究，小米是韩国的主要农作物，虽然大约在3000年前与水稻同时传入日本，但并未成为古代日本人饮食的重要组成部分。约克大学、剑桥大学和奈良国立文化财产研究所的研究人员分析了古代陶器中的残留物和烧焦的植物残骸。\n\n研究表明，虽然水稻和小米都出现在早期日本农业聚落中，但水稻改变了社会，而小米却基本上被忽视了。在食物残渣和人类骨骼中缺乏小米令人惊讶，因为环境因素并不是其生长的障碍。研究表明，既定的烹饪传统，特别是以鱼类为基础的菜肴，比仅仅获得一种新的农作物更重要。\n\n尽管采用了韩国的陶器和农具，但日本的烹饪习惯在很大程度上没有改变，弥生时代的陶罐仍然主要用于烹饪鱼类和野生食物，而不是水稻。这表明食物文化根深蒂固，可以抵御技术变革。这项研究是ENCOUNTER项目的一部分，该项目探索了农业的传播及其对日本文化的影响。这项研究强调，技术发展并不总是立即导致文化变革，而且既定的做法可以长期存在。"
  },
  {
    "id": "44697689",
    "title": "We Revamped Our Docs for AI Driven Development",
    "url": "https://docs.freestyle.sh/blog/docs-revamp",
    "summary": "Freestyle revamped its documentation to improve AI's ability to understand and utilize it, addressing issues where AI provided incorrect or outdated information. The changes focus on making the documentation more accessible to AI agents and large language models (LLMs).\n\nKey improvements include:\n\n*   **LLMs.txt and .md Exports:** Creating `llms.txt` files with absolute URLs to provide raw content for AI agents. Converting all docs pages to `.md` extensions for direct access to the raw markdown, avoiding HTML/CSS/JS interference and ensuring accurate capture of content like Python documentation in tab views.\n*   **AI Buttons:** Implementing copy buttons to easily copy page content for pasting into AI tools like ChatGPT and Claude, including pre-filled prompts to initiate conversations with the AI agents.\n*   **MCP Tooling:** Redesigning their Machine Customer Protocol (MCP) `listDocs` and `getDocById` tool descriptions to be more actionable, guiding AI agents on when and how to use them. Offering deep links for easy installation of the MCP in tools like Cursor and VSCode.\n*   **AI Chat:** Implementing an AI Chat feature within the documentation, powered by gemini-2.5-flash and connected to their MCP, enabling users to directly interact with an AI agent that references the documentation in its answers.\n\nFuture plans include a DevOps MCP for querying logs, an `askQuestion` tool for semantic search, an `escalateIssue` tool for reporting issues directly, UI enhancements for the in-docs chatbot, and the creation of more step-by-step guides. They're also seeking deep links for one-click MCP installation into more tools and exploring better ways to generate SDK documentation.\n",
    "chinese_title": "我们重构了AI驱动开发文档",
    "chinese_summary": "Freestyle改进了其文档，以提高AI的理解和利用能力，解决了AI提供不正确或过时信息的问题。这些变更的重点是使文档对AI代理和大型语言模型(LLM)更易于访问。\n\n主要改进包括：\n\n*   **LLMs.txt 和 .md 导出：** 创建包含绝对URL的 `llms.txt` 文件，为AI代理提供原始内容。 将所有文档页面转换为 `.md` 扩展名，以便直接访问原始 markdown，避免 HTML/CSS/JS 的干扰，并确保准确捕获诸如 Python 文档中选项卡视图的内容。\n*   **AI 按钮：** 实施复制按钮，方便复制页面内容并粘贴到 ChatGPT 和 Claude 等 AI 工具中，包括预填充的提示，以启动与 AI 代理的对话。\n*   **MCP 工具：** 重新设计其机器客户协议 (MCP) 的 `listDocs` 和 `getDocById` 工具描述，使其更具可操作性，从而指导 AI 代理何时以及如何使用它们。 提供深度链接，以便在 Cursor 和 VSCode 等工具中轻松安装 MCP。\n*   **AI 聊天：** 在文档中实施 AI 聊天功能，该功能由 gemini-2.5-flash 提供支持并连接到其 MCP，使用户可以直接与 AI 代理交互，该代理在其答案中引用文档。\n\n未来的计划包括用于查询日志的 DevOps MCP、用于语义搜索的 `askQuestion` 工具、用于直接报告问题的 `escalateIssue` 工具、文档内聊天机器人的 UI 增强功能以及创建更多分步指南。 他们还在寻求深度链接，以便将 MCP 一键安装到更多工具中，并探索更好的方法来生成 SDK 文档。"
  },
  {
    "id": "44696979",
    "title": "OCaml Programming: Correct and Efficient and Beautiful",
    "url": "https://cs3110.github.io/textbook/cover.html",
    "summary": "This document introduces \"OCaml Programming: Correct + Efficient + Beautiful,\" a textbook on functional programming and data structures using OCaml. It's designed as the core text for Cornell University's CS 3110 course and was formerly known as \"Functional Programming in OCaml.\" The Spring 2025 edition features over 200 embedded YouTube videos accompanying the material.\n\nThe book draws upon over 20 years of course notes and intellectual contributions from numerous professors including Michael R. Clarkson, Robert L. Constable, and others. Michael R. Clarkson is credited as the primary compiler and author of the unified textbook, contributing roughly 40% of the content as of Fall 2021.\n\nThe textbook emphasizes semantics and software engineering principles within the context of OCaml programming. It is released under a Creative Commons Attribution-NonCommercial-NoDerivatives 4.0 International License, with copyright held by Michael R. Clarkson from 2021 to 2025. The YouTube playlist is designed to complement the book but can also be utilized independently.\n",
    "chinese_title": "OCaml编程：正确、高效、优美",
    "chinese_summary": "本文介绍教材《OCaml编程：正确+高效+优美》，这是一本关于使用OCaml进行函数式编程和数据结构的教材。它被设计为康奈尔大学CS 3110课程的核心教材，原名《OCaml函数式编程》。2025年春季版包含200多个嵌入式YouTube视频，与教材内容相配合。\n\n本书汲取了20多年的课程笔记以及包括Michael R. Clarkson、Robert L. Constable等众多教授的智慧贡献。Michael R. Clarkson被认为是这部统一教材的主要编纂者和作者，截至2021年秋季，他贡献了大约40%的内容。\n\n该教材强调OCaml编程语境下的语义和软件工程原则。它以知识共享署名-非商业性-禁止演绎 4.0 国际许可协议发布，版权由Michael R. Clarkson于2021年至2025年持有。YouTube播放列表旨在补充本书，但也可独立使用。"
  },
  {
    "id": "44701236",
    "title": "Turbulence is increasing. The aviation industry is trying to smooth things out",
    "url": "https://www.bbc.com/future/article/20250725-how-aircraft-designers-are-beating-rising-turbulence",
    "summary": "Turbulence is on the rise due to climate change, with severe clear-air turbulence increasing by 55% since 1979. This poses a safety risk to passengers, increases wear and tear on aircraft, and leads to higher fuel consumption as pilots attempt to avoid it.\n\nThe aviation industry is exploring several solutions to mitigate the effects of turbulence. One approach involves small \"flaplets\" on wings that adjust to airflow changes, potentially reducing turbulence felt by passengers by up to 80%. AI is also being explored to analyze fluid dynamics and control synthetic jets on aircraft wings, providing more accurate simulations of airflow. Additionally, researchers are testing improved sensing and prediction systems for drones using AI and developing microphone technology to detect turbulence at a distance. Lidar technology is being explored to create 3D maps of the air surrounding the aircraft.\n\nWhile these technologies are under development, pilots currently rely on weather briefings, jet stream charts, flight planning software, and turbulence forecasts. Forecasting accuracy has improved from 60% to 75% in the last 20 years, but access to real-time turbulence data is limited. Initiatives like Turbulence Aware from IATA share anonymized data, and apps like Turbli provide passengers with turbulence information, although their accuracy can vary. The convergence of manufacturing, AI, and new sensors promises to transform aviation in the future.\n",
    "chinese_title": "湍流加剧，航空业力求平稳。",
    "chinese_summary": "气候变化加剧湍流，1979年以来晴空湍流增加了55%。 这对乘客安全构成风险，加剧飞机损耗，并导致飞行员为避开湍流而消耗更多燃料。\n\n航空业正在探索多种解决方案以减轻湍流的影响。 一种方法是在机翼上安装可调节气流变化的小型“襟翼”，有望将乘客感受到的湍流减少高达 80%。 人工智能也被用于分析流体动力学并控制飞机机翼上的合成射流，从而提供更精确的气流模拟。 此外，研究人员正在测试改进的无人机传感和预测系统，该系统利用人工智能并开发麦克风技术以远距离检测湍流。 激光雷达技术正被探索用于创建飞机周围空气的 3D 地图。\n\n在这些技术开发的同时，飞行员目前依赖于天气简报、急流图、飞行计划软件和湍流预报。 过去 20 年，预测准确率从 60% 提高到 75%，但实时湍流数据的访问受到限制。 IATA 的 Turbulence Aware 等计划共享匿名数据，而 Turbli 等应用程序为乘客提供湍流信息，但它们的准确性可能有所不同。 制造业、人工智能和新型传感器的融合有望在未来改变航空业。"
  },
  {
    "id": "44697761",
    "title": "Asyncio: A library with too many sharp corners",
    "url": "https://sailor.li/asyncio",
    "summary": "This article sharply critiques Python's `asyncio` library, arguing it's fundamentally flawed and difficult to use due to several design issues.\n\n**Major Problems:**\n\n1.  **Broken Cancellation:** `asyncio` uses edge-triggered cancellation, meaning a cancellation signal only fires once. This allows cancellations to be swallowed or hidden, leading to deadlocks and unpredictable behavior, especially during cleanup in `finally` blocks or context managers. The author contrasts this with Trio's level-triggered cancellation, where cancellation remains active until explicitly shielded.\n2.  **\"Task was destroyed but it is pending!\" Errors:** `asyncio` uses weak references to tasks, leading to garbage collection and premature termination of tasks if strong references are not maintained. Functions like `wait_for`, `gather`, and `shield` can exacerbate this issue.\n3.  **Pointless I/O Landmines:** `asyncio` uses a protocol-based approach to sockets, which the author argues complicates network I/O compared to the simpler, linear approach offered by standard sockets and Trio.\n\nThe article highlights that these issues stem from the original design and its subsequent evolution. It contrasts `asyncio` unfavorably with libraries like Trio and AnyIO, which offer cleaner and more robust asynchronous programming models. It argues that many of `asyncio`'s problems were foreseeable and that the library's promotion to non-provisional status was premature.\n",
    "chinese_title": "Asyncio：太多棱角的库",
    "chinese_summary": "本文尖锐地批评了Python的`asyncio`库，认为由于几个设计问题，它存在根本性缺陷且难以使用。\n\n**主要问题：**\n\n1.  **失效的取消机制：** `asyncio`使用边沿触发的取消机制，意味着取消信号仅触发一次。这导致取消操作可能被吞噬或隐藏，从而导致死锁和不可预测的行为，尤其是在`finally`块或上下文管理器中的清理期间。作者将其与Trio的电平触发取消机制进行对比，后者会保持取消状态，直到明确屏蔽。\n2.  **\"Task was destroyed but it is pending!\" 错误：** 如果未维护强引用，`asyncio`使用对任务的弱引用，导致垃圾回收和任务的过早终止。`wait_for`、`gather`和`shield`等函数会加剧此问题。\n3.  **毫无意义的I/O陷阱：** `asyncio`对套接字使用基于协议的方法，作者认为与标准套接字和Trio提供的更简单、线性的方法相比，这使网络I/O复杂化。\n\n文章强调，这些问题源于最初的设计及其后续演变。它将`asyncio`与Trio和AnyIO等库进行了不利的比较，后者提供了更简洁、更健壮的异步编程模型。文章认为，`asyncio`的许多问题是可以预见的，并且该库提升为非临时状态为时过早。"
  },
  {
    "id": "44701788",
    "title": "Brits get around Discord's age verification with Death Stranding's photo mode",
    "url": "https://www.pcgamer.com/hardware/brits-can-get-around-discords-age-verification-thanks-to-death-strandings-photo-mode-bypassing-the-measure-introduced-with-the-uks-online-safety-act-we-tried-it-and-it-works-thanks-kojima/",
    "summary": "Following the implementation of the UK's Online Safety Act, users have discovered a way to bypass Discord's age verification system using Death Stranding's photo mode. The article details how using a close-up of Sam Porter Bridges (Norman Reedus) and manipulating his facial expressions in the game allows users to pass Discord's K-id age verification.\n\nDiscord employs two methods for age verification: face scan and ID scan. The face scan, powered by K-id, requires users to perform actions like opening and closing their mouth to prove they are a real person. Players are using Sam's in-game facial expressions to trick the system.\n\nThe article emphasizes that while this method works, it is not advocating for circumventing age restrictions, as adult content is intended for adults. It also acknowledges Discord's claim that it doesn't permanently store biometric data used for age verification.\n\nThe author also briefly considers the implications of the Online Safety Act on privacy and encryption. While the act aims to protect individuals from harmful content, concerns remain about potential overreach and the erosion of online privacy for UK citizens.\n",
    "chinese_title": "英国人利用《死亡搁浅》的照片模式绕过Discord的年龄验证",
    "chinese_summary": "英国《网络安全法案》实施后，用户发现了一种利用《死亡搁浅》拍照模式绕过Discord年龄验证系统的方法。文章详细介绍了如何使用山姆·波特·布里吉斯（诺曼·瑞杜斯饰演）的特写，并在游戏中操纵他的面部表情，从而通过Discord的K-id年龄验证。\n\nDiscord采用两种年龄验证方法：面部扫描和身份证扫描。面部扫描由K-id提供支持，要求用户执行诸如张开和闭合嘴巴等动作，以证明他们是真人。玩家正在使用山姆的游戏内面部表情来欺骗系统。\n\n文章强调，虽然这种方法有效，但并不提倡规避年龄限制，因为成人内容是为成年人准备的。文章还承认Discord声称它不会永久存储用于年龄验证的生物识别数据。\n\n作者还简要考虑了《网络安全法案》对隐私和加密的影响。虽然该法案旨在保护个人免受有害内容侵害，但人们仍然担心其潜在的过度干预以及英国公民在线隐私的侵蚀。"
  },
  {
    "id": "44695478",
    "title": "SF may soon ban natural gas in homes and businesses undergoing major renovations",
    "url": "https://www.sfchronicle.com/sf/article/natural-gas-ban-renovations-20776228.php",
    "summary": "San Francisco is considering expanding its ban on natural gas in new construction to include major renovations of existing homes and businesses. A proposed ordinance would require electrification – switching to electric appliances like stoves, water heaters, and furnaces – during renovations that meet a certain threshold, likely determined by the cost of the renovation relative to the building's value.\n\nThe goal is to further reduce greenhouse gas emissions, as buildings are a significant contributor to San Francisco's carbon footprint, and natural gas is a major source. Supporters argue that incentivizing electrification during renovations is more cost-effective than waiting for end-of-life appliance replacements.\n\nThe proposed ordinance is still under development, and the specific trigger for requiring electrification is a key point of debate. Stakeholders are discussing thresholds based on renovation cost as a percentage of building value, ensuring the requirement applies only to substantial renovations where the cost of electrification can be more easily absorbed.\n\nThe real estate and construction industries are expressing concerns about the potential costs and complexities of the proposal. Some worry about the impact on affordability, particularly for homeowners undergoing smaller renovations. Others are concerned about the city's electrical grid capacity and the potential for increased electricity demand to strain the system.\n\nThe Board of Supervisors will need to weigh these concerns against the city's climate goals as they consider the legislation. The final ordinance is expected to include exemptions and adjustments to address specific concerns and ensure a smooth transition towards electrification in existing buildings.\n",
    "chinese_title": "旧金山或将禁止大型翻修住宅及商用建筑使用天然气",
    "chinese_summary": "旧金山考虑扩大新建建筑天然气禁令，将现有住宅和商业建筑的重大翻新工程纳入其中。一项拟议法令将要求在达到一定阈值的翻新工程中进行电气化改造，即更换为电炉、热水器和暖气等电器，该阈值可能由翻新成本相对于建筑价值的比例决定。\n\n此举旨在进一步减少温室气体排放，因为建筑物是旧金山碳足迹的重要组成部分，而天然气是主要来源。支持者认为，鼓励在翻新过程中进行电气化改造比等待电器报废再更换更具成本效益。\n\n拟议法令仍在制定中，触发电气化要求的具体条件是争论的关键点。利益相关者正在讨论基于翻新成本占建筑价值百分比的阈值，以确保该要求仅适用于大型翻新工程，在这种情况下，电气化成本更容易被吸收。\n\n房地产和建筑行业对该提案的潜在成本和复杂性表示担忧。一些人担心其对负担能力的影响，特别是对于进行较小规模翻新的房主而言。另一些人则担心该市的电网容量，以及电力需求增加可能给系统带来的压力。\n\n监事会将需要在审议该法案时权衡这些担忧与该市的气候目标。最终法令预计将包括豁免和调整措施，以解决具体问题并确保现有建筑物向电气化平稳过渡。"
  },
  {
    "id": "44690911",
    "title": "CCTV footage captures video of an earthquake fault in motion",
    "url": "https://www.smithsonianmag.com/smart-news/cctv-footage-captures-the-first-ever-video-of-an-earthquake-fault-in-motion-shining-a-rare-light-on-seismic-dynamics-180987034/",
    "summary": "生成摘要时出错",
    "chinese_title": "CCTV footage captures video of an earthquake fault in motion",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44686164",
    "title": "Animated Cursors",
    "url": "https://tattoy.sh/news/animated-cursors/",
    "summary": "生成摘要时出错",
    "chinese_title": "Animated Cursors",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44701666",
    "title": "The Par Programming Language",
    "url": "https://faiface.github.io/par-lang/",
    "summary": "生成摘要时出错",
    "chinese_title": "The Par Programming Language",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44685011",
    "title": "Steam, Itch.io are pulling ‘porn’ games. Critics say it's a slippery slope",
    "url": "https://www.wired.com/story/steam-itchio-are-pulling-porn-games-censorship/",
    "summary": "生成摘要时出错",
    "chinese_title": "Steam, Itch.io are pulling ‘porn’ games. Critics say it's a slippery slope",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44656419",
    "title": "Keep Pydantic out of your Domain Layer",
    "url": "https://coderik.nl/posts/keep-pydantic-out-of-your-domain-layer/",
    "summary": "生成摘要时出错",
    "chinese_title": "Keep Pydantic out of your Domain Layer",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44663072",
    "title": "Developing our position on AI",
    "url": "https://www.recurse.com/blog/191-developing-our-position-on-ai",
    "summary": "生成摘要时出错",
    "chinese_title": "Developing our position on AI",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44657550",
    "title": "Open Sauce is a confoundingly brilliant Bay Area event",
    "url": "https://www.jeffgeerling.com/blog/2025/open-sauce-confoundingly-brilliant-bay-area-event",
    "summary": "生成摘要时出错",
    "chinese_title": "Open Sauce is a confoundingly brilliant Bay Area event",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44695190",
    "title": "Ageing accelerates around age 50 ― some organs faster than others",
    "url": "https://www.nature.com/articles/d41586-025-02333-z",
    "summary": "生成摘要时出错",
    "chinese_title": "Ageing accelerates around age 50 ― some organs faster than others",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44673296",
    "title": "Windsurf employee #2: I was given a payout of only 1% what my shares where worth",
    "url": "https://twitter.com/premqnair/status/1948420769945682413",
    "summary": "生成摘要时出错",
    "chinese_title": "Windsurf employee #2: I was given a payout of only 1% what my shares where worth",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44699273",
    "title": "The 14 Pains of Billing for AI Agents",
    "url": "https://arnon.dk/the-14-pains-of-billing-ai-agents/",
    "summary": "生成摘要时出错",
    "chinese_title": "The 14 Pains of Billing for AI Agents",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44696543",
    "title": "The Sail instruction-set semantics specification language",
    "url": "https://alasdair.github.io/manual.html",
    "summary": "生成摘要时出错",
    "chinese_title": "The Sail instruction-set semantics specification language",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44683682",
    "title": "Programming vehicles in games",
    "url": "https://wassimulator.com/blog/programming/programming_vehicles_in_games.html",
    "summary": "生成摘要时出错",
    "chinese_title": "Programming vehicles in games",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44701477",
    "title": "US Government takes $1B from nuclear modernization for gold-plated jet",
    "url": "https://www.nytimes.com/2025/07/27/us/politics/air-force-one-trump-cost.html",
    "summary": "生成摘要时出错",
    "chinese_title": "US Government takes $1B from nuclear modernization for gold-plated jet",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44702308",
    "title": "Microsoft to stop using China-based teams to support Department of Defense",
    "url": "https://www.propublica.org/article/microsoft-tech-support-government-cybersecurity-china-doj-treasury",
    "summary": "生成摘要时出错",
    "chinese_title": "Microsoft to stop using China-based teams to support Department of Defense",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44688096",
    "title": "Experimental surgery performed by AI-driven surgical robot",
    "url": "https://arstechnica.com/science/2025/07/experimental-surgery-performed-by-ai-driven-surgical-robot/",
    "summary": "生成摘要时出错",
    "chinese_title": "Experimental surgery performed by AI-driven surgical robot",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44695015",
    "title": "Write \"Freehold\" Software",
    "url": "https://deadbeef.io/freehold_software",
    "summary": "生成摘要时出错",
    "chinese_title": "Write \"Freehold\" Software",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44676363",
    "title": "Upsides and Downsides",
    "url": "https://calv.info/upsides-and-downsides",
    "summary": "生成摘要时出错",
    "chinese_title": "Upsides and Downsides",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44685067",
    "title": "CO2 Battery",
    "url": "https://energydome.com/co2-battery/",
    "summary": "生成摘要时出错",
    "chinese_title": "CO2 Battery",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44679048",
    "title": "Asciinema: Record and share your terminal sessions",
    "url": "https://asciinema.org",
    "summary": "生成摘要时出错",
    "chinese_title": "Asciinema: Record and share your terminal sessions",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44680308",
    "title": "Quantitative AI progress needs accurate and transparent evaluation",
    "url": "https://mathstodon.xyz/@tao/114910028356641733",
    "summary": "生成摘要时出错",
    "chinese_title": "Quantitative AI progress needs accurate and transparent evaluation",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44697990",
    "title": "I've returned to Linux but I miss PowerShell",
    "url": "http://chrisfun.xyz/PowerShell/",
    "summary": "生成摘要时出错",
    "chinese_title": "I've returned to Linux but I miss PowerShell",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44697217",
    "title": "Visualizing TCP",
    "url": "https://research.swtch.com/tcpviz",
    "summary": "生成摘要时出错",
    "chinese_title": "Visualizing TCP",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44658745",
    "title": "The append-and-review note",
    "url": "https://karpathy.bearblog.dev/the-append-and-review-note/",
    "summary": "生成摘要时出错",
    "chinese_title": "The append-and-review note",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44700694",
    "title": "Wikipedia editors, unsung heroes, keep it one of the last best places online",
    "url": "https://www.theglobeandmail.com/canada/article-wikipedia-page-editors/",
    "summary": "生成摘要时出错",
    "chinese_title": "Wikipedia editors, unsung heroes, keep it one of the last best places online",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44684373",
    "title": "Women dating safety app 'Tea' breached, users' IDs posted to 4chan",
    "url": "https://www.404media.co/women-dating-safety-app-tea-breached-users-ids-posted-to-4chan/",
    "summary": "生成摘要时出错",
    "chinese_title": "Women dating safety app 'Tea' breached, users' IDs posted to 4chan",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44657188",
    "title": "Researchers value null results, but struggle to publish them",
    "url": "https://www.nature.com/articles/d41586-025-02312-4",
    "summary": "生成摘要时出错",
    "chinese_title": "Researchers value null results, but struggle to publish them",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44667754",
    "title": "Algorithm for simulating phosphor persistence of analog oscilloscopes",
    "url": "https://richardandersson.net/?p=350",
    "summary": "生成摘要时出错",
    "chinese_title": "Algorithm for simulating phosphor persistence of analog oscilloscopes",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44688489",
    "title": "It's time for modern CSS to kill the SPA",
    "url": "https://www.jonoalderson.com/conjecture/its-time-for-modern-css-to-kill-the-spa/",
    "summary": "生成摘要时出错",
    "chinese_title": "It's time for modern CSS to kill the SPA",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44686726",
    "title": "Claude Code introduces specialized sub-agents",
    "url": "https://docs.anthropic.com/en/docs/claude-code/sub-agents",
    "summary": "生成摘要时出错",
    "chinese_title": "Claude Code introduces specialized sub-agents",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44659792",
    "title": "Algos and Code Performance: Your Code Works but Can It Handle Real Traffic?",
    "url": "https://beon.tech/blog/optimizing-algorithms-code-performance",
    "summary": "生成摘要时出错",
    "chinese_title": "Algos and Code Performance: Your Code Works but Can It Handle Real Traffic?",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44700383",
    "title": "Leak confirms Nvidia N1X PC chip features 20 CPU cores and 6144 CUDA cores",
    "url": "https://videocardz.com/newz/leak-confirms-nvidia-n1x-pc-chip-features-20-cpu-cores-and-6144-cuda-cores",
    "summary": "生成摘要时出错",
    "chinese_title": "Leak confirms Nvidia N1X PC chip features 20 CPU cores and 6144 CUDA cores",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44682964",
    "title": "It's a DE9, not a DB9 (but we know what you mean)",
    "url": "https://news.sparkfun.com/14298",
    "summary": "生成摘要时出错",
    "chinese_title": "It's a DE9, not a DB9 (but we know what you mean)",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44679854",
    "title": "Google spoofed via DKIM replay attack: A technical breakdown",
    "url": "https://easydmarc.com/blog/google-spoofed-via-dkim-replay-attack-a-technical-breakdown/",
    "summary": "生成摘要时出错",
    "chinese_title": "Google spoofed via DKIM replay attack: A technical breakdown",
    "chinese_summary": "生成摘要时出错"
  }
]