[
  {
    "id": "44736176",
    "title": "Crush: Glamourous AI coding agent for your favourite terminal",
    "url": "https://github.com/charmbracelet/crush",
    "summary": "Crush is an AI coding agent designed to integrate directly into your terminal, functioning as a coding assistant using your existing tools and workflows. It supports multiple LLMs via OpenAI- and Anthropic-compatible APIs, enabling you to switch between them while maintaining context across sessions.\n\nKey features include:\n\n*   **Multi-Model Support:** Works with various LLMs and allows adding custom ones.\n*   **Session-Based Context:** Maintains separate contexts for different projects.\n*   **LSP-Enhanced:** Uses Language Server Protocols for enhanced code understanding.\n*   **Extensible via MCPs:** Adds capabilities using Model Context Protocol servers (stdio, http, sse).\n*   **Cross-Platform:** Supports macOS, Linux, Windows (PowerShell and WSL), and FreeBSD.\n\nInstallation is available via package managers (Homebrew, NPM, yay, Nix, apt, yum) or Go. Configuration can be customized via JSON files on a project or global level. Crush can leverage LSPs for context and MCPs for extensibility, allowing integration with services like file systems or GitHub.\n\nFor security, Crush prompts for permission before running tool calls, but this can be bypassed with a whitelist or the `--yolo` flag (use with extreme caution). Custom providers, like Deepseek, can be configured using OpenAI- and Anthropic-compatible APIs.\n\nCrush provides logging features, accessible via the `crush logs` command, with options for tailing and real-time following. Debug mode can be enabled via the `--debug` flag or in the configuration.\n\nThe project encourages feedback and offers support through Twitter, Discord, Slack, and the Fediverse. It is licensed under FSL-1.1-MIT and is part of the Charm ecosystem.\n",
    "chinese_title": "Crush：你最爱的终端的迷人AI编码助手",
    "chinese_summary": "Crush：一款AI编码助手，旨在直接集成到您的终端中，使用您现有的工具和工作流程作为编码助手。它通过与OpenAI和Anthropic兼容的API支持多种LLM，使您能够在它们之间切换，同时保持跨会话的上下文。\n\n主要功能包括：\n\n*   **多模型支持：** 适用于各种LLM，并允许添加自定义模型。\n*   **基于会话的上下文：** 为不同的项目维护单独的上下文。\n*   **LSP增强：** 使用语言服务器协议来增强代码理解。\n*   **通过MCP扩展：** 使用模型上下文协议服务器（stdio、http、sse）添加功能。\n*   **跨平台：** 支持macOS、Linux、Windows（PowerShell和WSL）和FreeBSD。\n\n可以通过包管理器（Homebrew、NPM、yay、Nix、apt、yum）或Go进行安装。可以通过项目或全局级别的JSON文件自定义配置。Crush可以利用LSP获取上下文，利用MCP进行扩展，从而与文件系统或GitHub等服务集成。\n\n为了安全起见，Crush在运行工具调用之前会提示您授权，但可以使用白名单或`--yolo`标志绕过此提示（请谨慎使用）。可以使用与OpenAI和Anthropic兼容的API配置自定义提供程序，例如Deepseek。\n\nCrush提供日志记录功能，可以通过`crush logs`命令访问，并提供尾部和实时跟踪选项。可以通过`--debug`标志或在配置中启用调试模式。\n\n该项目鼓励反馈，并通过Twitter、Discord、Slack和Fediverse提供支持。它采用FSL-1.1-MIT许可，并且是Charm生态系统的一部分。"
  },
  {
    "id": "44733817",
    "title": "Our $100M Series B",
    "url": "https://oxide.computer/blog/our-100m-series-b",
    "summary": "Oxide Computer Company has announced a $100M Series B funding round, led by USIT, with participation from existing investors. This more than doubles the company's total capital raised to date. Oxide's initial vision was to build a company focused on a new hardware and software stack for on-premises cloud computing, a concept initially met with skepticism by some investors.\n\nThe company overcame technical challenges by building their own boards, microcontroller operating system, platform enablement software, host hypervisor, switch, integrated storage service, and control plane. This integrated approach avoids reliance on third-party solutions and addresses specific customer needs for on-premises infrastructure.\n\nAfter shipping their first system two years ago, Oxide achieved milestones like software updates, performance improvements, and feature additions based on customer feedback. They achieved general commercial availability and saw increasing customer adoption, with many customers citing Oxide's transparency through their podcast, RFDs, documentation, and open-source code.\n\nUSIT, led by founder Thomas Tull, recognized the potential of Oxide's vision and the significant market opportunity they are uniquely positioned to serve. The funding will be used to address customer needs related to manufacturing scale, system scale, operations scale, and roadmap scope, enabling Oxide to achieve its mission of transforming computing.\n",
    "chinese_title": "我们的1亿美元B轮融资",
    "chinese_summary": "Oxide计算机公司宣布完成由USIT领投的1亿美元B轮融资，现有投资者也参与其中。这使得该公司迄今为止的总融资额增加了一倍以上。Oxide最初的愿景是建立一家专注于本地云计算的新硬件和软件栈的公司，这一概念最初受到一些投资者的质疑。\n\n该公司通过构建自己的主板、微控制器操作系统、平台使能软件、主机虚拟机管理程序、交换机、集成存储服务和控制平面，克服了技术挑战。这种集成方法避免了对第三方解决方案的依赖，并满足了客户对本地基础设施的特定需求。\n\n在两年前交付了他们的第一个系统后，Oxide根据客户反馈实现了软件更新、性能改进和功能添加等里程碑。他们实现了全面的商业可用性，并看到客户采用率不断提高，许多客户提到Oxide通过其播客、RFD、文档和开源代码所体现的透明度。\n\n由创始人托马斯·图尔领导的USIT，认识到Oxide愿景的潜力以及他们独特地位所能服务的巨大市场机会。这笔资金将用于满足客户在制造规模、系统规模、运营规模和路线图范围方面的需求，从而使Oxide能够实现其转变计算的使命。"
  },
  {
    "id": "44736090",
    "title": "Optician Sans – A free font based on historical eye charts and optotypes",
    "url": "https://optician-sans.com/",
    "summary": "Optician Sans is a free font inspired by historical eye charts and optotypes used by opticians. It draws inspiration from the Snellen chart (1862), Sloan letters (1959), and the LogMAR chart, aiming to be a functional display typeface based on the same visual principles.\n\nDeveloped in 2018, Optician Sans is a continuation of these historical letterforms, particularly the Sloan optotypes, adjusted for readability and intended for commercial use while ensuring legibility for all visual abilities. Optometrist Øyvind Krogh highlights the font's effectiveness in conveying information clearly.\n\nThe font includes custom alternates to provide a more cohesive aesthetic, allowing users to choose how closely they adhere to the original optotype designs. It's available under the SIL Open Font License and can be found on GitHub as an open-source project. Press materials, including images and videos, are available for download. Optician Sans was created by ANTI Hamar and typographer Fábio Duarte Martins.\n",
    "chinese_title": "验光师字体 Sans - 一款基于历史视力表和视标的免费字体",
    "chinese_summary": "Optician Sans 是一款免费字体，其灵感源于历史上的视力表和眼科医生使用的视标。它从斯内伦视力表 (1862)、斯隆字母 (1959) 和 LogMAR 视力表中汲取灵感，旨在成为一种基于相同视觉原理的功能性展示字体。\n\nOptician Sans 于 2018 年开发，是这些历史字体的延续，尤其是斯隆视标，经过调整以提高可读性，并供商业用途，同时确保所有视力能力的人都能辨认。验光师 Øyvind Krogh 强调该字体在清晰传达信息方面的有效性。\n\n该字体包含自定义的替换字形，以提供更具凝聚力的美感，允许用户选择他们与原始视标设计的接近程度。它以 SIL 开放字体许可证提供，并且可以在 GitHub 上作为开源项目找到。新闻资料，包括图片和视频，可供下载。Optician Sans 由 ANTI Hamar 和排版师 Fábio Duarte Martins 创作。"
  },
  {
    "id": "44732020",
    "title": "Sleep all comes down to the mitochondria",
    "url": "https://www.science.org/content/blog-post/it-all-comes-down-mitochondria",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "睡眠最终都归结于线粒体。",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "44733341",
    "title": "Problem Solving Is Often a Matter of Cooking Up an Appropriate Markov Chain",
    "url": "https://www.jstor.org/stable/41548580",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "解决问题常常在于构建合适的马尔可夫链",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "44736673",
    "title": "Artie (YC S23) Is Hiring Founding AEs",
    "url": "https://www.ycombinator.com/companies/artie/jobs/CfSrcAH-founding-ae",
    "summary": "Artie, a Y Combinator (S23) backed startup focused on real-time data streaming from databases to data warehouses, is hiring two Founding Account Executives (AEs) to join their fully in-person team in San Francisco.\n\nArtie's platform provides a fully-managed change data capture (CDC) solution, enabling real-time data replication and is trusted by companies like Substack and Alloy. The AEs will play a crucial role in building Artie's GTM engine, owning the full sales cycle from outbound prospecting to closing deals, while defining sales processes and messaging. They will be responsible for driving discovery, solutioning, managing complex stakeholders, and translating technical concepts into business value.\n\nIdeal candidates should have 2+ years of AE experience selling technical products in the mid-market/enterprise SaaS space (ideally at a pre-Series B startup), be technically fluent, demonstrate extreme ownership, be a fanatical prospector, and possess consultative selling skills. Located or willing to relocate to the Bay Area is a requirement.\n\nThe role offers a base salary of $110K-$130K plus 0.10% equity, along with benefits like healthcare, 401K, unlimited PTO, and provided lunch/dinner. The interview process includes an intro call, case study, mock discovery call, and on-site visit.\n",
    "chinese_title": "Artie (YC S23) 招聘创始 AE",
    "chinese_summary": "Artie是一家Y Combinator (S23)支持的初创公司，专注于将数据库的实时数据流传输到数据仓库。现正招聘两位创始客户主管(AE)，加入他们在旧金山的完全线下团队。\n\nArtie的平台提供完全托管的变更数据捕获(CDC)解决方案，支持实时数据复制，并受到Substack和Alloy等公司的信任。客户主管将在构建Artie的市场推广引擎中发挥关键作用，负责从主动寻找潜在客户到完成交易的整个销售周期，同时定义销售流程和信息传递。他们将负责推动探索、解决方案、管理复杂的利益相关者，并将技术概念转化为商业价值。\n\n理想的候选人应具有2年以上在中间市场/企业SaaS领域销售技术产品的客户主管经验（最好是在B轮前初创公司），精通技术，表现出极强的责任感，热衷于寻找潜在客户，并具备咨询式销售技巧。 需要位于或愿意搬迁到湾区。\n\n该职位提供11万至13万美元的基本工资，外加0.10%的股权，以及医疗保健、401K、无限制PTO和提供的午餐/晚餐等福利。面试过程包括介绍电话、案例研究、模拟探索电话和现场访问。"
  },
  {
    "id": "44733119",
    "title": "The HTML Hobbyist",
    "url": "https://www.htmlhobbyist.com/",
    "summary": "\"The HTML Hobbyist\" is a call to reclaim the original spirit of the World Wide Web, advocating for simple, hand-coded websites over the complex, commercialized platforms that dominate the internet today. The article laments the shift from a decentralized, user-driven web to one characterized by advertising, tracking, walled-gardens of social media, and algorithm-driven content.\n\nIt criticizes the modern web experience, plagued by intrusive ads, cookie opt-ins, and paywalls. The author argues that while advancements in web development like CSS and JavaScript have increased control and interaction, they've also led to overly complex and automated systems that ultimately just deliver HTML.\n\nThe author champions a return to the simplicity and freedom of the early web, where anyone could easily create and share content. The \"HTML Hobbyist\" project aims to demonstrate the ease and affordability of building a simple website, providing guidance for others to do the same. This movement, also known as indieweb or yesterweb, echoes the early days of the internet, prioritizing individual expression and community over monetization and mass appeal. Quoting Tim Berners-Lee, the article emphasizes the Web's original dream of a common information space for sharing and collaboration, urging readers to break free from the \"sterilized, lifeless, monetized, monitored entities\" and rediscover the joy of personal creation. The goal is not to build the next big thing, but to contribute a simple, genuine hobby site to the World Wide Web.\n",
    "chinese_title": "HTML 爱好者",
    "chinese_summary": "HTML爱好者：呼唤回归互联网的最初精神，提倡用简单的手工编写网站来取代当今主导互联网的复杂商业化平台。文章感叹网络从去中心化的用户驱动模式转变为充斥着广告、追踪、社交媒体围墙花园和算法驱动内容。\n\n它批评了现代网络体验，饱受侵入式广告、Cookie 同意和付费墙的困扰。作者认为，虽然像 CSS 和 JavaScript 这样的网络开发技术的进步增加了控制和交互，但也导致了过于复杂和自动化的系统，而这些系统最终只是交付 HTML。\n\n作者倡导回归早期网络的简单和自由，那时任何人都可以轻松创建和分享内容。“HTML爱好者”项目旨在展示构建简单网站的容易性和经济性，并为其他人提供同样的指导。这场运动，也被称为独立网络或昨日网络，呼应了互联网的早期，将个人表达和社区置于货币化和大众吸引力之上。文章引用蒂姆·伯纳斯-李的话，强调了网络最初的梦想，即一个用于共享和协作的通用信息空间，敦促读者摆脱“经过消毒、毫无生气、货币化、受监控的实体”，重新发现个人创作的乐趣。目标不是创造下一个伟大的事物，而是为万维网贡献一个简单而真诚的业余爱好网站。"
  },
  {
    "id": "44735334",
    "title": "Words about Arrays and Tables",
    "url": "https://buttondown.com/hillelwayne/archive/2000-words-about-arrays-and-tables/",
    "summary": "This article explores a conceptual model of arrays and tables based on mathematical functions, aiming to explain the variations seen in different programming languages and data structures.\n\nThe core idea is that a 1D array is a function mapping a sequence of numbers (1..N) to homogeneous values.  This extends to N-dimensional arrays by considering them curried functions, like `1..M -> 1..N -> 1..O -> V`. This representation enables array transformations, such as transposition, by rearranging function parameters. The concept of \"dimensions\" is broadened to include any finite set, not just numerical indexes (e.g., `Row -> Col -> {R, G, B} -> Int` for a pixel grid).\n\nThe article distinguishes arrays from tables by noting that tables inherently involve heterogeneous data within rows (structs). Because struct members might have different types, it is difficult to make these into dimensions. While an array-of-structs (table) is isomorphic to a struct-of-arrays, the heterogeneous nature of the struct within a table prevents a direct conversion into a homogeneous array with added dimensions. The article argues this heterogeneity barrier explains why multiple columnar axes are less common in tables compared to multiple axes of array dimensions.\n",
    "chinese_title": "关于数组和表格的一些话",
    "chinese_summary": "本文探讨了一种基于数学函数的数组和表格的概念模型，旨在解释不同编程语言和数据结构中出现的差异。\n\n核心思想是，一维数组是将数字序列 (1..N) 映射到同类值的函数。通过将N维数组视为柯里化函数，例如 `1..M -> 1..N -> 1..O -> V`，可以将其扩展到N维。这种表示方法可以通过重新排列函数参数来实现数组转换，例如转置。“维度”的概念被扩展到包括任何有限集合，而不仅仅是数字索引（例如，像素网格的`Row -> Col -> {R, G, B} -> Int`）。\n\n本文通过指出表格本质上涉及行内异构数据（结构体），从而区分了数组和表格。由于结构体成员可能具有不同的类型，因此很难将它们转化为维度。虽然结构体数组（表格）与数组结构体是同构的，但表格中结构体的异构性质阻止了直接转换为具有附加维度的同类数组。本文认为这种异构障碍解释了为什么与数组维度的多个轴相比，表格中的多个列轴不太常见。"
  },
  {
    "id": "44736668",
    "title": "What's Not to Like?",
    "url": "https://theamericanscholar.org/whats-not-to-like/",
    "summary": "In \"What's Not to Like?\", Max Byrd explores the art of simile and metaphor, contrasting the effective use of these devices with examples of poor or awkward comparisons. He begins by expressing his fascination with similes, collecting them from various sources for their humor and descriptive power.\n\nByrd then categorizes similes, highlighting \"The Really Bad Simile,\" which he finds prevalent in contemporary fiction, often involving strained and bizarre comparisons. He also cites examples of particularly egregious similes used when writing about sex.\n\nThe article moves on to discuss epic or Homeric similes, which are longer and more elaborate, creating a broader scene or drama. Byrd emphasizes that a good simile maker must perceive resemblances and then make the reader see the comparison vividly.\n\nHe differentiates similes from metaphors, arguing that while similes announce themselves with \"like\" or \"as,\" metaphors directly transform one thing into another, possessing a more primitive, almost magical power. He suggests that this \"childlike\" quality allows for a deeper fusion of ideas. He uses examples from Updike and Shakespeare to illustrate the power of metaphor.\n\nFinally, Byrd celebrates James Joyce's masterful blending of simile, metaphor, and extended simile, demonstrating how language can transform reality and reveal the layers beneath the surface. He concludes by suggesting that the power of these literary devices lies in their ability to unveil the metamorphosis of reality.\n",
    "chinese_title": "有什么理由不喜欢呢？",
    "chinese_summary": "在《有什么不喜欢？》中，马克斯·伯德探讨了明喻和隐喻的艺术，对比了这些手法的有效运用与拙劣或笨拙的比较的例子。他首先表达了他对明喻的着迷，从各种来源收集它们，因为它们的幽默和描述力量。\n\n伯德随后对明喻进行分类，重点介绍了“真正糟糕的明喻”，他发现这种明喻在当代小说中很普遍，通常涉及牵强和奇异的比较。他还引用了在描写性时使用的特别糟糕的明喻的例子。\n\n文章接着讨论了史诗般的或荷马式的明喻，它们更长、更精致，创造了更广阔的场景或戏剧。伯德强调，一个好的明喻创作者必须感知相似之处，然后让读者生动地看到这种比较。\n\n他区分了明喻和隐喻，认为虽然明喻用“像”或“如同”来宣告自己，但隐喻直接将一件事物转化为另一件事物，具有更原始、几乎是神奇的力量。他认为这种“孩子气”的特质允许思想更深层次的融合。他用厄普代克和莎士比亚的例子来说明隐喻的力量。\n\n最后，伯德赞扬了詹姆斯·乔伊斯对明喻、隐喻和扩展明喻的精湛融合，展示了语言如何改变现实并揭示表象之下的层次。他总结说，这些文学手法的力量在于它们揭示现实变形的能力。"
  },
  {
    "id": "44733888",
    "title": "Try the Mosquito Bucket of Death",
    "url": "https://www.energyvanguard.com/blog/try-the-mosquito-bucket-of-death/",
    "summary": "In this blog post, Allison Bailes introduces the \"Mosquito Bucket of Death\" as a sustainable and cost-effective method to control mosquito populations in a yard. The bucket uses a bacterium called Bacillus thuringiensis (BT), found in MosquitoDunks®, to kill mosquito larvae without harming pets or other wildlife.\n\nThe process involves filling a bucket with water, adding decaying organic matter (leaves, compost), and providing sticks for insects to escape and for mosquitoes to land on. After a couple of days, a quarter of a MosquitoDunk is added to the bucket. The female mosquitoes lay their eggs in the bucket, and the larvae ingest the BT as they feed on the organic matter, leading to their demise.\n\nBailes highlights the advantages of this method compared to traditional insecticide spraying, which can be expensive, ineffective, and harmful to beneficial insects. She also mentions using dehumidifier water, which is free of chlorine, as a suitable water source.\n\nThe article explains the mosquito life cycle and suggests that a reduction in the mosquito population should be noticeable in about a month. The comments section includes reader feedback, with some confirming the method's effectiveness, while others raise concerns about potentially attracting mosquitoes from neighboring areas. The consensus is that the potential benefits outweigh the risks.\n",
    "chinese_title": "死亡蚊桶体验",
    "chinese_summary": "Allison Bailes 在这篇博文中介绍了一种名为“灭蚊桶”的可持续且经济高效的方法，用于控制院子里的蚊子数量。该水桶使用一种名为苏云金芽孢杆菌 (BT) 的细菌（在蚊香锭®中发现），杀死蚊子幼虫，而不会伤害宠物或其他野生动物。\n\n该过程包括在桶中装满水，加入腐烂的有机物（树叶、堆肥），并提供树枝供昆虫逃生和蚊子栖息。几天后，将四分之一的蚊香锭添加到桶中。雌蚊在桶中产卵，幼虫在以有机物为食时会摄入 BT，从而导致死亡。\n\nBailes 强调了与传统的杀虫剂喷洒相比，这种方法的优点，传统的杀虫剂喷洒既昂贵又无效，并且对有益昆虫有害。她还提到使用不含氯的除湿机水作为合适的水源。\n\n文章解释了蚊子的生命周期，并指出大约一个月内应该能注意到蚊子数量的减少。评论区包含读者的反馈，其中一些人确认了该方法的有效性，而另一些人则提出了关于可能吸引邻近地区蚊子的担忧。普遍的看法是，潜在的好处大于风险。"
  },
  {
    "id": "44699174",
    "title": ".NET 10 Preview 6 brings JIT improvements, one-shot tool execution",
    "url": "https://www.infoworld.com/article/4023654/net-10-preview-6-brings-jit-improvements-one-shot-tool-execution.html",
    "summary": ".NET 10 Preview 6, the latest preview of Microsoft's upcoming application development platform, introduces a variety of enhancements and improvements across the .NET ecosystem. Key features include improved JIT code generation for struct arguments, enabling the compiler to place promoted members into shared registers, and one-shot tool execution, allowing developers to run .NET tools without local or global installation, beneficial for CI/CD and ephemeral usage.\n\nThe preview also addresses JSON deserialization vulnerabilities by offering an option to disallow duplicate properties. Furthermore, .NET tools can now be published with support for multiple RuntimeIdentifiers in a single package, simplifying cross-platform development. A new `--cli-schema` option provides a JSON representation of CLI commands for shell integration and advanced scripting. File-based apps can be published as native executables via the `dotnet publish app.cs` command.\n\nBlazor gains a `<LinkPreload />` component for optimized WebAssembly preloading and now supports validation of nested objects and collection items in forms. For Windows Presentation Foundation (WPF), the Fluent theme has been improved, including a Fluent style for GridView. Entity Framework sees quality improvements and enhanced build performance. Windows Forms receives improvements to dark mode support and new security APIs to protect sensitive form data from screen capture. The production release of .NET 10 is expected in November.\n",
    "chinese_title": ".NET 10 预览版 6 带来 JIT 改进和一次性工具执行",
    "chinese_summary": ".NET 10 预览版 6 是微软即将推出的应用程序开发平台的最新预览版，它在 .NET 生态系统中引入了各种增强和改进。主要功能包括改进了结构体参数的 JIT 代码生成，使编译器能够将提升的成员放置到共享寄存器中，以及一次性工具执行，允许开发人员在没有本地或全局安装的情况下运行 .NET 工具，这对于 CI/CD 和临时使用非常有利。\n\n该预览版还通过提供禁用重复属性的选项来解决 JSON 反序列化漏洞。此外，.NET 工具现在可以发布，并在单个包中支持多个 RuntimeIdentifier，从而简化了跨平台开发。一个新的 `--cli-schema` 选项为 shell 集成和高级脚本提供了 CLI 命令的 JSON 表示形式。基于文件的应用程序可以通过 `dotnet publish app.cs` 命令发布为本机可执行文件。\n\nBlazor 获得了 `<LinkPreload />` 组件，用于优化 WebAssembly 预加载，并且现在支持表单中嵌套对象和集合项的验证。对于 Windows Presentation Foundation (WPF)，Fluent 主题得到了改进，包括 GridView 的 Fluent 样式。Entity Framework 在质量和构建性能方面都有所提高。Windows Forms 改进了对深色模式的支持，并提供了新的安全 API，以保护敏感表单数据免受屏幕捕获的影响。.NET 10 的正式版预计将于 11 月发布。"
  },
  {
    "id": "44733968",
    "title": "Writing memory efficient C structs",
    "url": "https://tomscheers.github.io/2025/07/29/writing-memory-efficient-structs-post.html",
    "summary": "Tom Scheers' blog post, \"Writing Memory Efficient C Structs,\" focuses on optimizing C structs for memory usage. The article starts by demonstrating how a seemingly simple struct can occupy more memory than expected due to padding added by the compiler for alignment purposes.\n\nThe author then presents several methods to reduce the memory footprint of structs:\n\n1.  **Reordering struct members:** Arranging members from largest to smallest based on their alignment requirements can minimize padding.\n2.  **Deriving state:** Instead of storing redundant boolean values, derive them dynamically from existing fields (e.g., inferring `is_alive` from `health > 0`).\n3.  **Using appropriate data types:** Employ the smallest suitable integer types from `<stdint.h>` to represent data efficiently (e.g., `uint8_t` instead of `int` when a smaller range suffices).\n4.  **Utilizing bitfields:** Represent boolean flags as individual bits instead of full bytes to pack multiple flags into a single byte.\n5.  **Employing enums for IDs:** Replace string-based identifiers with enums to avoid allocating separate strings for each instance of the struct.\n\nThe post illustrates these techniques with examples, gradually reducing the size of a `Monster` struct from 96 bytes to 20 bytes. The author emphasizes that while these optimizations are valuable in memory-constrained or performance-critical scenarios, readability and potential side effects (like integer overflows) should also be considered. The conclusion stresses the context-dependent nature of struct optimization, weighing the benefits against potential drawbacks.\n",
    "chinese_title": "编写内存高效的 C 结构体",
    "chinese_summary": "Tom Scheers 的博客文章“编写内存高效的 C 结构体”着重于优化 C 结构体以减少内存使用。文章首先演示了一个看似简单的结构体，由于编译器为了对齐而添加的填充，可能会占用比预期更多的内存。\n\n作者随后提出了几种减少结构体内存占用的方法：\n\n1. **重排结构体成员：** 根据对齐要求，将成员从大到小排列，可以最大限度地减少填充。\n2. **推导状态：** 不存储冗余的布尔值，而是从现有字段动态推导它们（例如，从 `health > 0` 推断 `is_alive`）。\n3. **使用合适的数据类型：** 使用 `<stdint.h>` 中最小的合适整数类型来有效地表示数据（例如，当较小的范围足够时，使用 `uint8_t` 代替 `int`）。\n4. **利用位域：** 将布尔标志表示为单个位，而不是完整的字节，以便将多个标志打包到一个字节中。\n5. **使用枚举作为 ID：** 用枚举替换基于字符串的标识符，以避免为结构体的每个实例分配单独的字符串。\n\n该文章用示例说明了这些技术，逐渐将 `Monster` 结构体的大小从 96 字节减少到 20 字节。作者强调，虽然这些优化在内存受限或性能至关重要的场景中很有价值，但也应考虑可读性和潜在的副作用（如整数溢出）。结论强调了结构体优化的上下文依赖性，权衡了收益与潜在的缺点。"
  },
  {
    "id": "44701001",
    "title": "Hexatetrahedral Rails",
    "url": "https://blog.julik.nl/2025/07/hexatetrahedral-rails",
    "summary": "This article critically examines the \"Hexagonal Rails\" architecture, a design pattern inspired by Domain-Driven Design and Hexagonal Architecture principles, often found in older Rails applications. The author playfully dubs these \"hexatetrahedral Rails applications\" due to their tendency to introduce complexities that outweigh the intended benefits.\n\nThe author argues that while the original premise of hexagonal architecture, emphasizing decoupling and modular composition, is sound, its application within Rails often fails. Decoupling from Rails seems counterintuitive since the application's primary delivery mechanism is the web within the Rails framework. The author questions the necessity of multiple repositories and the practical benefits of complete swappability for common Rails components.\n\nThe article identifies hallmarks of \"hexatetrahedral\" Rails apps: use of DataMapper/rom_rb, extensive dry-rb usage, RSpec, FactoryBot, Trailblazer/ROAR for views, repositories, mocking in tests, \"null databases,\" and stateful service objects. While acknowledging that these architectures often attempt to explore alternative paths from conventional Rails, the author deems them \"Frankenstein's monsters\" due to the increased complexity, dependencies, and indirections.\n\nUltimately, the author suggests that the real value behind Hexagonal Rails isn't domain modeling, but **API narrowing**. The immense API surface area of ActiveRecord makes it difficult to create reliable abstractions. \"Hexatetrahedral\" apps, by wrapping ActiveRecord and other Rails components, attempt to create smaller, more controlled interfaces. The article uses the example of IOConstraint, a narrowed IO interface for file parsing, to illustrate the benefits of API narrowing for control and maintainability.\n",
    "chinese_title": "六四面体轨道",
    "chinese_summary": "本文批判性地审视了“六边形Rails”架构，这是一种受领域驱动设计和六边形架构原则启发的，常见于较旧Rails应用程序中的设计模式。作者戏称其为“六四面体Rails应用程序”，因为它们倾向于引入超出预期收益的复杂性。\n\n作者认为，虽然六边形架构的最初前提——强调解耦和模块化组合——是合理的，但它在Rails中的应用常常失败。与Rails解耦似乎有悖常理，因为应用程序的主要交付机制是Rails框架内的Web。作者质疑多个存储库的必要性以及常见Rails组件完全可替换性的实际好处。\n\n文章识别了“六四面体”Rails应用程序的特征：使用DataMapper/rom_rb、大量使用dry-rb、RSpec、FactoryBot、Trailblazer/ROAR for views、存储库、测试中的mock、\"空数据库\"以及有状态的服务对象。虽然承认这些架构通常试图探索与传统Rails不同的路径，但作者认为它们是“弗兰肯斯坦的怪物”，因为增加了复杂性、依赖性和间接性。\n\n最终，作者认为六边形Rails背后的真正价值不是领域建模，而是**API缩小**。ActiveRecord巨大的API表面区域使得创建可靠的抽象变得困难。“六四面体”应用程序通过包装ActiveRecord和其他Rails组件，试图创建更小、更可控的接口。文章以IOConstraint（一个用于文件解析的缩小IO接口）为例，说明了API缩小对于控制和可维护性的好处。"
  },
  {
    "id": "44733094",
    "title": "Blog series on creating an OS in Rust",
    "url": "https://os.phil-opp.com/",
    "summary": "This blog series guides readers through creating a small operating system in Rust, starting from a basic freestanding Rust binary and progressing to more complex features. The series emphasizes hands-on learning with complete code examples and a corresponding GitHub repository.\n\nThe series covers essential OS development topics: setting up a minimal kernel, interacting with hardware through VGA text mode, implementing testing frameworks, handling CPU exceptions and interrupts, managing memory with paging, implementing heap allocation with different allocator designs, and exploring cooperative multitasking with Rust's async/await feature.\n\nThe content is structured as a series of tutorials, each building upon the previous one. It includes status updates on the blog and related tools, offering insights into ongoing development.\n\nThe blog also acknowledges the existence of a first edition which used the GRUB bootloader, but emphasizes the second edition is the active and updated version. Finally, it provides links to support the author's work, acknowledging the time and effort required to maintain the blog and associated libraries.\n",
    "chinese_title": "用 Rust 创建操作系统的博客系列",
    "chinese_summary": "本博客系列将指导读者使用 Rust 创建一个小型操作系统，从基本的独立 Rust 二进制文件开始，逐步发展到更复杂的功能。本系列强调动手学习，提供完整的代码示例和相应的 GitHub 仓库。\n\n本系列涵盖了操作系统开发的基本主题：设置最小内核、通过 VGA 文本模式与硬件交互、实现测试框架、处理 CPU 异常和中断、使用分页管理内存、使用不同的分配器设计实现堆分配，以及使用 Rust 的 async/await 功能探索协同多任务。\n\n内容结构为一系列教程，每个教程都建立在前一个教程的基础上。它包括关于博客和相关工具的状态更新，提供对持续开发的见解。\n\n该博客还承认存在使用 GRUB 引导加载程序的第一版，但强调第二版是当前活跃和更新的版本。最后，它提供了支持作者工作的链接，感谢维护博客和相关库所需的时间和精力。"
  },
  {
    "id": "44733734",
    "title": "Making Libcurl Work in WebAssembly",
    "url": "https://jeroen.github.io/notes/webassembly-curl/",
    "summary": "This article explains how to make applications using libcurl work in WebAssembly (Wasm) without code changes by routing traffic through a WebSocket proxy. The core issue is that WebAssembly lacks direct TCP socket access, relying on the browser's restricted JavaScript networking interfaces like `fetch`, which is insufficient for libcurl.\n\nThe solution involves using Emscripten's ability to emulate TCP connections over WebSockets. When libcurl tries to connect to a standard TCP port, Emscripten actually initiates a WebSocket connection to the same address. A `websockify` proxy server running on the target host accepts the WebSocket connection and forwards the traffic to the intended TCP service.\n\nHowever, the more practical application is to proxy libcurl traffic to any HTTP service. This is achieved by running a SOCKS5 proxy server behind `websockify`. Libcurl can then be configured to use this proxy via the `ALL_PROXY` environment variable.\n\nThe article provides a Docker container that simplifies setup with both `websockify` and a SOCKS5 server.  The author uses Cloudflare in front of the proxy setup for HTTPS and performance benefits. A demo is available using the WebR test UI which can be found at https://ws.r-universe.dev.\n\nThe author emphasizes the security benefits (SOCKS5 proxies are \"dumb\" and do not decrypt HTTPS traffic) and the ease of integration, requiring minimal configuration (setting the `ALL_PROXY` environment variable). A potential future improvement would involve Cloudflare handling the `websockify` part, simplifying the architecture further.\n",
    "chinese_title": "使Libcurl在WebAssembly中工作",
    "chinese_summary": "本文解释了如何通过WebSocket代理路由流量，使使用libcurl构建的应用程序在WebAssembly (Wasm) 中无需修改代码即可工作。核心问题在于WebAssembly缺乏直接的TCP套接字访问，依赖于浏览器受限的JavaScript网络接口，例如`fetch`，这对于libcurl来说是不够的。\n\n解决方案涉及使用Emscripten模拟通过WebSocket的TCP连接的能力。当libcurl尝试连接到标准TCP端口时，Emscripten实际上会发起与相同地址的WebSocket连接。运行在目标主机上的`websockify`代理服务器接受WebSocket连接，并将流量转发到目标TCP服务。\n\n然而，更实际的应用是将libcurl流量代理到任何HTTP服务。这可以通过在`websockify`后面运行SOCKS5代理服务器来实现。然后，可以通过`ALL_PROXY`环境变量将libcurl配置为使用此代理。\n\n本文提供了一个Docker容器，简化了`websockify`和SOCKS5服务器的设置。作者在代理设置前使用Cloudflare来获得HTTPS和性能优势。 演示可以使用WebR测试UI，可以在https://ws.r-universe.dev找到。\n\n作者强调了安全性优势（SOCKS5代理是“哑”的，不会解密HTTPS流量）和易于集成，只需要最少的配置（设置`ALL_PROXY`环境变量）。一个潜在的未来改进是让Cloudflare处理`websockify`部分，从而进一步简化架构。"
  },
  {
    "id": "44698007",
    "title": "Show HN: Convert from MIDI file to ASCII tablature (and more)",
    "url": "https://github.com/scottvr/gtrsnipe/blob/main/README.md",
    "summary": "This Show HN post announces a tool called \"gtrsnipe\" created by scottvr that converts MIDI files to ASCII tablature. The core functionality is taking a MIDI file as input and producing a guitar tablature representation of the music in ASCII format. The post is seeking feedback and attention (as indicated by the \"Show HN\" prefix), hoping users will find the tool useful and potentially contribute. The GitHub repository link, implied by the \"scottvr/gtrsnipe/Public\" structure, suggests the project is open-source and available for others to explore, use, and potentially contribute to. The mentions of \"Fork (0)\" and \"Star (11)\" indicates the number of forks and stars the repository has on GitHub, providing a measure of community interest and engagement. While not explicitly stated, the intention is to simplify music notation and make guitar music more accessible through text-based tablature.\n",
    "chinese_title": "Show HN: 将 MIDI 文件转换为 ASCII 指法谱 (及更多)",
    "chinese_summary": "Scottvr的gtrsnipe工具：MIDI转ASCII吉他谱"
  },
  {
    "id": "44731958",
    "title": "‘No Other Land’ consultant Awdah Hathaleen killed by Israeli settler",
    "url": "https://www.latimes.com/entertainment-arts/story/2025-07-29/awdah-hathaleen-killed-no-other-land-palestinian-activist-israeli-settler",
    "summary": "The article reports on the death of Awdah Hathaleen, a Palestinian community leader and consultant on the Oscar-winning documentary \"No Other Land,\" who was allegedly shot and killed by an Israeli settler in the occupied West Bank. Filmmaker Yuval Abraham shared a video of the incident on social media, identifying the shooter as Yinon Levi, who was previously sanctioned internationally for alleged attacks on Palestinians.\n\nThe incident occurred in the village of Umm al-Khair, the Masafer Yatta region documented in the film, which focuses on the demolition of Palestinian villages by Israel. Hathaleen was taken to a hospital in Israel but died from his injuries. Israeli police arrested an Israeli citizen but didn't identify them, claiming Palestinians threw rocks at a nearby settlement. The Israeli military also detained several Palestinians and foreign tourists.\n\n\"No Other Land\" co-director Basel Adra shared another video of the attack, alleging that Levi fired the bullet that killed Hathaleen and was later released to house arrest. The Center for Jewish Nonviolence mourned Hathaleen as a well-known community figure and activist who was recently deported after being denied entry to the U.S.\n\nThe article also references a previous incident in March where another \"No Other Land\" filmmaker, Hamdan Ballal, was beaten by settlers and detained by Israeli forces. The documentary highlights the displacement of Palestinian communities due to Israeli military activity. The article notes that over 60,000 Palestinians have been killed in the ongoing Israel-Hamas war.\n",
    "chinese_title": "“别无他乡”顾问奥达·哈塔林被以色列定居者杀害",
    "chinese_summary": "文章报道了巴勒斯坦社区领袖、奥斯卡获奖纪录片《没有别的土地》顾问奥达·哈塔林之死，据称他被一名以色列定居者在被占领的西岸枪杀身亡。电影制作人尤瓦尔·亚伯拉罕在社交媒体上分享了一段事件视频，指认枪手为伊农·列维，他此前因涉嫌袭击巴勒斯坦人而受到国际制裁。\n\n该事件发生在影片中记录的马萨费尔亚塔地区的乌姆·凯尔村，该片重点讲述了以色列拆除巴勒斯坦村庄的情况。哈塔林被送往以色列一家医院，但因伤势过重去世。以色列警方逮捕了一名以色列公民，但没有透露其身份，声称巴勒斯坦人向附近定居点投掷石块。以色列军方还拘留了几名巴勒斯坦人和外国游客。\n\n《没有别的土地》联合导演巴塞尔·阿德拉分享了另一段袭击视频，声称列维开枪打死了哈塔林，后来被释放并居家监禁。犹太非暴力中心悼念哈塔林，称他是一位著名的社区人物和活动家，最近在被拒绝进入美国后被驱逐出境。\n\n文章还提到了三月份发生的一起事件，当时另一位《没有别的土地》电影制作人哈姆丹·巴拉尔被定居者殴打，并被以色列军队拘留。该纪录片突出了巴勒斯坦社区因以色列军事活动而流离失所的情况。文章指出，在持续不断的以色列-哈马斯战争中，已有超过6万名巴勒斯坦人丧生。"
  },
  {
    "id": "44734983",
    "title": "Show HN: A High-Altitude Low-Power Flight Computer for High-Altitude Balloons",
    "url": "https://github.com/New-England-Weather-Balloon-Society/Tiny4FSK",
    "summary": "This \"Show HN\" post introduces Tiny4FSK, a lightweight, low-power, open-source flight computer designed for high-altitude balloons (HABs). It uses 4FSK modulation and the Horus Binary v2 tracking system and is built around a SAMD21G18A microcontroller, Si4063 transceiver, ATGM336H GPS module, and BME280 environmental sensor. Powered by a single AA battery, it can operate for 10-17 hours.\n\nThe post details the project's purpose (near-space exploration at a lower cost), target audience (space science enthusiasts and makers), and key components. It outlines the modular codebase structure, including files for configuration, CRC calculation, error correction, voltage detection, radio transmission, and other utilities.\n\nA step-by-step guide covers hardware setup (PCB configuration and antenna system), code configuration within the Arduino IDE (including obtaining a Horus ID and setting callsigns and frequencies), and uploading the code.  It also provides instructions on testing the setup and interpreting LED behavior.  Information regarding required Amateur Radio License is present as well.\n\nThe post acknowledges PCBWay for PCB fabrication and assembly sponsorship, providing contact information for the author, and listing cited works, special thanks to collaborators, and software/hardware licensing information. Finally, sponsors like Bagel Fund and Hack Club are mentioned.\n",
    "chinese_title": "Show HN: 用于高空气球的高空低功耗飞行计算机",
    "chinese_summary": "此“Show HN”帖子介绍Tiny4FSK，一款轻量级、低功耗、开源的飞行计算机，专为高空气球(HABs)设计。它使用4FSK调制和Horus Binary v2跟踪系统，并基于SAMD21G18A微控制器、Si4063收发器、ATGM336H GPS模块和BME280环境传感器构建。由单节AA电池供电，可运行10-17小时。\n\n帖子详细介绍了项目的目的（以更低的成本进行近太空探索）、目标受众（空间科学爱好者和创客）以及关键组件。它概述了模块化的代码库结构，包括用于配置、CRC计算、纠错、电压检测、无线电传输和其他实用程序的文件。\n\n一个循序渐进的指南涵盖了硬件设置（PCB配置和天线系统）、Arduino IDE中的代码配置（包括获取Horus ID以及设置呼号和频率）以及上传代码。它还提供了有关测试设置和解释LED行为的说明。同时提供了关于所需业余无线电执照的信息。\n\n该帖子感谢PCBWay赞助PCB制造和组装，并提供了作者的联系信息，以及引用的作品列表、特别感谢的合作者以及软件/硬件许可信息。最后，提到了Bagel Fund和Hack Club等赞助商。"
  },
  {
    "id": "44733742",
    "title": "Show HN: MoebiusXBIN – ASCII and text-mode art editor with custom font support",
    "url": "https://blog.glyphdrawing.club/moebiusxbin-ascii-and-text-mode-art-editor-with-custom-font-support/",
    "summary": "MoebiusXBIN is a text-mode and ASCII art editor for MacOS, Linux, and Windows, built as a fork of the original Moebius editor. The major distinguishing feature is its full support for custom fonts within the XBIN (eXtended BINary) file format. This allows artists to move beyond the limitations of standard IBM PC and Amiga fonts and explore new visual possibilities by creating art with custom character sets and color palettes.\n\nThe original Moebius, like PabloDraw, supports XBIN files but lacks the ability to change the font used. MoebiusXBIN addresses this by enabling users to load, import, and export fonts as PNG files, use a built-in font browser with almost 2400 fonts and color palettes created by the Lospec community. The editor also supports multiple encodings, writing directions and features a tutorial.\n\nThe tool aims to unlock artistic potential by allowing manipulation of fonts and color palettes within text-mode graphics. Several artists have used the editor to create a diverse range of art, some examples are featured within the article, including animations and ANSI art pieces with modified fonts. MoebiusXBIN is open source and welcomes contributions, with acknowledgement given to the original creator and other contributors.\n",
    "chinese_title": "Show HN: MoebiusXBIN – 支持自定义字体的ASCII和文本模式艺术编辑器",
    "chinese_summary": "MoebiusXBIN：一款支持自定义字体的文本模式及ASCII艺术编辑器，适用于MacOS、Linux和Windows，是原Moebius编辑器的分支。其主要特点是完全支持XBIN（eXtended BINary）文件格式中的自定义字体，允许艺术家摆脱标准IBM PC和Amiga字体的限制，通过使用自定义字符集和调色板进行创作，探索新的视觉可能性。\n\n原版Moebius，像PabloDraw一样，支持XBIN文件，但无法更改使用的字体。MoebiusXBIN解决了这个问题，它允许用户加载、导入和导出PNG格式的字体，并内置一个字体浏览器，其中包含洛斯佩克社区创作的近2400种字体和调色板。该编辑器还支持多种编码、书写方向，并提供教程。\n\n该工具旨在通过允许在文本模式图形中操作字体和调色板来释放艺术潜力。许多艺术家使用该编辑器创作了各种各样的艺术作品，文章中展示了一些例子，包括动画和使用修改字体的ANSI艺术作品。MoebiusXBIN是开源的，欢迎贡献，并感谢原作者和其他贡献者。"
  },
  {
    "id": "44736101",
    "title": "Critical Vulnerability Discovered 11 Days After Wix Buys Base44",
    "url": "https://www.wiz.io/blog/critical-vulnerability-base44",
    "summary": "Wiz Research discovered a critical vulnerability in Base44, a popular \"vibe coding\" platform recently acquired by Wix, allowing unauthorized access to private applications. The flaw, discovered just 11 days after the acquisition, involved bypassing authentication controls by exploiting undocumented registration and email verification endpoints. Attackers could create verified accounts for private applications using only the application's `app_id`, easily found in the application's URI or manifest file.\n\nThis granted full access to sensitive data within internal chatbots, automations, and business tools built on Base44. Wiz Research responsibly disclosed the vulnerability to Base44 and Wix, who promptly fixed it within 24 hours and found no evidence of past exploitation.\n\nThe vulnerability highlighted the shared-risk model of vibe coding platforms, where a single flaw can jeopardize all applications built on the platform's shared infrastructure. It also underscored the importance of prioritizing fundamental security controls like authentication in AI-powered development platforms, in addition to AI-specific threats.\n\nOrganizations using Base44 were advised to review user access logs for unusual activity but were assured that no action was required due to the platform-wide fix. The article emphasizes the need for security to be a core consideration in the development of these platforms to foster trust and enable faster development.\n",
    "chinese_title": "Wix 收购 Base44 后 11 天发现严重漏洞",
    "chinese_summary": "Wiz Research发现Base44关键漏洞，可未经授权访问私有应用\n\nWiz Research发现Base44（一款流行的“氛围编码”平台，最近被Wix收购）存在一个关键漏洞，该漏洞允许未经授权访问私有应用程序。该漏洞在收购后仅11天就被发现，涉及通过利用未公开的注册和电子邮件验证端点绕过身份验证控制。攻击者只需使用应用程序的`app_id`（很容易在应用程序的URI或清单文件中找到）即可为私有应用程序创建经过验证的帐户。\n\n这使得攻击者能够完全访问构建在Base44上的内部聊天机器人、自动化流程和业务工具中的敏感数据。 Wiz Research负责任地向Base44和Wix披露了该漏洞，后者在24小时内迅速修复了该漏洞，并且没有发现过去曾被利用的证据。\n\n该漏洞突出了氛围编码平台的共享风险模式，即单个漏洞可能会危及构建在平台共享基础设施上的所有应用程序。它还强调了在人工智能驱动的开发平台中，除了人工智能特有的威胁之外，优先考虑身份验证等基本安全控制的重要性。\n\n建议使用Base44的组织审查用户访问日志是否存在异常活动，但由于已进行平台范围的修复，因此无需采取任何措施。文章强调，安全必须是这些平台开发的核心考虑因素，以建立信任并加快开发速度。"
  },
  {
    "id": "44694606",
    "title": "Clj-coll: Clojure collections and sequences in Common Lisp",
    "url": "https://github.com/dtenny/clj-coll",
    "summary": "CLJ-COLL is a Common Lisp library providing Clojure's collection, sequence, and lazy-sequence APIs. It aims to offer a seamless integration of Clojure's immutable data structures and APIs within a Common Lisp environment, making CL more accessible to Clojure developers. It's *not* a full Clojure implementation but focuses on collection and sequence manipulation.\n\nKey features include:\n*   Immutable Cons, Queue, PersistentList, Vector, Set, and Map.\n*   Full interoperability with CL:LIST, CL:VECTOR, and CL:HASH-TABLE.\n*   Lazy sequences and transducer support.\n*   Optional printing and read syntax for Clojure-like collections.\n*   `equal?` for Clojure-style equivalence testing.\n*   \"M Functions\" - eager, mutable CL collection alternatives to lazy Clojure APIs.\n*   `queue` constructor for CLJ-COLL queues\n\nThe library provides utilities for selective access to its functionality, offering choices on shadowing CL symbols and using CL-compatible functions. The recommended usage includes shadowing essential CL symbols and enabling Clojure-style read and print syntax. A `CLJ-USER` package is provided for experimentation. CLJ-COLL includes utilities for shadowing and unshadowing Common Lisp functions using read-time eval, as well as M functions which will only ever return CL types.\n",
    "chinese_title": "Clj-coll：Common Lisp 中的 Clojure 集合与序列",
    "chinese_summary": "CLJ-COLL 是一个 Common Lisp 库，提供 Clojure 的集合、序列和惰性序列 API。它旨在在 Common Lisp 环境中无缝集成 Clojure 的不可变数据结构和 API，使 Clojure 开发者更容易上手 CL。它*不是*一个完整的 Clojure 实现，而是专注于集合和序列操作。\n\n主要特点包括：\n*   不可变的 Cons、Queue、PersistentList、Vector、Set 和 Map。\n*   与 CL:LIST、CL:VECTOR 和 CL:HASH-TABLE 的完全互操作性。\n*   惰性序列和 transducer 支持。\n*   Clojure 风格集合的可选打印和读取语法。\n*   用于 Clojure 风格等价测试的 `equal?`。\n*   “M 函数”——急切、可变的 CL 集合，作为惰性 Clojure API 的替代方案。\n*   CLJ-COLL 队列的 `queue` 构造函数\n\n该库提供用于选择性访问其功能的实用程序，提供关于隐藏 CL 符号和使用 CL 兼容函数的选择。推荐的用法包括隐藏必要的 CL 符号并启用 Clojure 风格的读取和打印语法。提供了一个 `CLJ-USER` 包用于实验。CLJ-COLL 包含使用读取时求值来隐藏和取消隐藏 Common Lisp 函数的实用程序，以及只会返回 CL 类型的 M 函数。"
  },
  {
    "id": "44698413",
    "title": "A Python dict that can report which keys you did not use",
    "url": "https://www.peterbe.com/plog/a-python-dict-that-can-report-which-keys-you-did-not-use",
    "summary": "This article introduces a custom Python dictionary class called `TrackingDict` designed to track which keys have been accessed. This is useful for debugging and ensuring that all data retrieved from sources like databases or within large data structures is actually being utilized in a program, especially when testing.\n\nThe `TrackingDict` class inherits from the built-in `dict` and overrides the `__getitem__` method. Each time a key is accessed using `[]` notation, the key is added to an internal `_accessed_keys` set. The class provides two properties: `accessed_keys`, which returns the set of accessed keys, and `never_accessed_keys`, which returns the set of keys in the dictionary that have not been accessed.\n\nThe article provides example use cases, including using `TrackingDict` in pytest to assert that all values within a dictionary are being tested.\n\nThe article also includes an updated version of the `TrackingDict` class with type hints for improved code clarity and maintainability, courtesy of a reader comment. The typed version uses `TypeVar` to define generic key (K) and value (V) types for the dictionary.  A commenter also raised a point that the `.get()` method wasn't tracked and key lookup misses also get added to accessed keys which could lead to unexpected behaviors in some scenarios.\n",
    "chinese_title": "一个能报告未使用的键的 Python 字典",
    "chinese_summary": "本文介绍了一个名为`TrackingDict`的自定义Python字典类，该类旨在跟踪哪些键已被访问。这对于调试和确保从数据库等来源或大型数据结构中检索的所有数据在程序中都被实际利用，尤其是在测试时，非常有用。\n\n`TrackingDict`类继承自内置的`dict`并重写了`__getitem__`方法。每次使用`[]`符号访问键时，该键都会被添加到内部`_accessed_keys`集合中。该类提供两个属性：`accessed_keys`，它返回已访问的键的集合；以及`never_accessed_keys`，它返回字典中尚未被访问的键的集合。\n\n本文提供了用例示例，包括在pytest中使用`TrackingDict`来断言字典中的所有值都已被测试。\n\n本文还包括一个更新版本的`TrackingDict`类，其中包含类型提示，以提高代码的清晰度和可维护性，感谢一位读者的评论。 类型化的版本使用`TypeVar`来定义字典的通用键 (K) 和值 (V) 类型。一位评论者还提出一个观点，即`.get()`方法未被跟踪，并且键查找失败也会被添加到已访问的键中，这可能会在某些情况下导致意外行为。"
  },
  {
    "id": "44734260",
    "title": "NMDA Receptor Antagonists: Slightly More Than You Wanted to Know",
    "url": "https://grillbert.substack.com/p/nmda-receptor-antagonists-a-bit-more",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "NMDA受体拮抗剂：远超所需略谈",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "44733983",
    "title": "Bitmapist: We built an open-source cohorts analytics tool that saved millions",
    "url": "https://www.doist.dev/bitmapist/",
    "summary": "Doist developed Bitmapist, an open-source cohort analytics library, to gain deeper insights into user behavior for their Todoist and Twist apps. Frustrated with the high costs and limited flexibility of commercial analytics platforms, they built a custom solution using Redis bitmaps. This allowed them to efficiently store and query massive amounts of event data in real-time, answering questions like feature adoption, user retention, and action correlations.\n\nBitmapist has significantly improved decision-making at Doist by enabling smarter feature launches, more effective A/B testing, and rapid decision-making across various teams. For example, they can instantly track user adoption of new features and quickly iterate based on data. The internal tool has also resulted in substantial cost savings, millions of dollars in analytics fees were saved over the years. An optimized `bitmapist-server`, replacing Redis, further reduced memory usage by 443x, leading to massive infrastructure cost savings.\n\nA key feature is Bitmapist's built-in cohort visualization, which provides clear, real-time charts of user behavior, aiding teams in identifying trends and drop-offs. Doist open-sourced Bitmapist and provides easy integration via `pip install bitmapist`. The library offers simple event marking and querying functionalities. Detailed documentation and examples are available on their GitHub page.\n",
    "chinese_title": "Bitmapist: 我们构建了一个开源用户群分析工具，节省了数百万美元",
    "chinese_summary": "Doist 开发了开源用户行为分析库 Bitmapist，以更深入地了解其 Todoist 和 Twist 应用的用户行为。由于商业分析平台成本高昂且灵活性有限，他们使用 Redis 位图构建了一个自定义解决方案。这使他们能够高效地存储和实时查询海量事件数据，从而解答诸如功能采纳、用户留存和行为关联等问题。\n\nBitmapist 通过支持更智能的功能发布、更有效的 A/B 测试以及各团队之间的快速决策，显著改进了 Doist 的决策制定。例如，他们可以立即跟踪用户对新功能的采纳情况，并根据数据快速迭代。该内部工具还节省了大量成本，多年来节省了数百万美元的分析费用。优化的 `bitmapist-server` 取代了 Redis，进一步降低了 443 倍的内存使用量，从而节省了巨大的基础设施成本。\n\n一个关键特性是 Bitmapist 内置的用户群可视化，它提供了清晰、实时的用户行为图表，帮助团队识别趋势和流失。Doist 开源了 Bitmapist，并通过 `pip install bitmapist` 提供了简单的集成方式。该库提供简单的事件标记和查询功能。详细文档和示例可在其 GitHub 页面上找到。"
  },
  {
    "id": "44729865",
    "title": "M8.7 earthquake in Western Pacific, tsunami warning issued",
    "url": "https://earthquake.usgs.gov/earthquakes/eventpage/us6000qw60/executive",
    "summary": "Based on the title and the provided content, here's a concise summary:\n\nA significant earthquake, magnitude 8.7, has occurred in the Western Pacific, triggering a tsunami warning. The content of the article itself is unavailable because the webpage requires Javascript to function, and the provided text only shows the error message displayed when Javascript is disabled. The article is inaccessible without Javascript. The provided message also encourages users to use Real-time Notifications, Feeds, and Web Services or to view the page with a supported browser that has Javascript enabled.\n",
    "chinese_title": "西太平洋发生8.7级地震，发布海啸警报",
    "chinese_summary": "基于标题和提供的内容，简要总结如下：\n\n西太平洋发生8.7级强烈地震，引发海啸预警。由于网页需要Javascript才能运行，且提供的文本仅显示禁用Javascript时显示的错误信息，因此文章内容不可用。没有Javascript，文章无法访问。提供的信息还鼓励用户使用实时通知、Feeds和Web服务，或使用支持Javascript的浏览器查看页面。"
  },
  {
    "id": "44703210",
    "title": "Show HN: Dlg – Zero-cost printf-style debugging for Go",
    "url": "https://github.com/vvvvv/dlg",
    "summary": "Dlg is a Go package designed for printf-style debugging that aims for zero performance overhead in production builds. By utilizing build tags, `dlg` provides a lightweight logger during development which completely vanishes when built without the `dlg` tag.\n\nKey features and benefits include:\n\n*   **Zero-Cost Abstraction:** All `dlg` calls are compiled away into no-ops and entirely eliminated by the Go linker in production builds.\n*   **Minimal API:** `dlg` exposes only two functions: `Printf` and `SetOutput`, making it easy to integrate.\n*   **Smart Stack Traces:** Stack trace generation is runtime-configurable using environment variables (e.g., `DLG_STACKTRACE=ERROR` to show traces only on errors).\n*   **Concurrency Safety:** The core `dlg.Printf` is safe for concurrent use; custom writers should implement `sync.Locker`.\n\nThe article demonstrates how to activate debug mode using the `dlg` build tag and provides examples for setting up stack traces and suppressing the debug banner. It explains how runtime and compile-time configurations can customize `dlg`'s behavior. It highlights the importance of concurrency safety for custom writers. Finally, the article includes a disassembly example to prove that `dlg` truly achieves zero-cost abstraction in production builds by showing that the compiler completely eliminates all traces of the `dlg` code.\n",
    "chinese_title": "Show HN: Dlg – Go 语言零成本 printf 风格调试",
    "chinese_summary": "Dlg 是一个 Go 包，专为 printf 风格的调试而设计，旨在生产构建中实现零性能开销。通过使用构建标签，`dlg` 在开发期间提供了一个轻量级日志记录器，当不使用 `dlg` 标签构建时，该记录器会完全消失。\n\n主要特性和优点包括：\n\n*   **零成本抽象：** 所有 `dlg` 调用都被编译成空操作，并在生产构建中完全被 Go 链接器消除。\n*   **最小化 API：** `dlg` 仅暴露两个函数：`Printf` 和 `SetOutput`，易于集成。\n*   **智能堆栈跟踪：** 堆栈跟踪生成可通过环境变量进行运行时配置（例如，`DLG_STACKTRACE=ERROR` 仅在发生错误时显示跟踪）。\n*   **并发安全：** 核心 `dlg.Printf` 可安全并发使用；自定义写入器应实现 `sync.Locker`。\n\n本文演示了如何使用 `dlg` 构建标签激活调试模式，并提供了设置堆栈跟踪和抑制调试横幅的示例。它解释了运行时和编译时配置如何自定义 `dlg` 的行为。 它强调了自定义写入器并发安全的重要性。 最后，本文包含一个反汇编示例，通过展示编译器完全消除了 `dlg` 代码的所有痕迹，来证明 `dlg` 确实在生产构建中实现了零成本抽象。"
  },
  {
    "id": "44736501",
    "title": "'70 MPH e-bikes' prompt one US state to change its laws",
    "url": "https://electrek.co/2025/07/29/70-mph-e-bikes-prompt-one-us-state-to-change-its-laws/",
    "summary": "This article discusses how the increasing popularity and modification of e-bikes, particularly among teenagers, have prompted Connecticut to update its e-bike laws. Concerns arose in Westport due to the prevalence of moped-style e-bikes, like those from Super73, being ridden to school and easily modified to reach speeds exceeding legal limits. Police Lt. Serenity Dobson highlighted the accessibility of online tutorials that teach riders how to bypass speed restrictions.\n\nCurrently, Connecticut uses the standard three-class e-bike system, capping Class 1 and 2 e-bikes at 20 mph and Class 3 at 28 mph, with a 750W power limit. The new laws, expected to take effect in October, will classify e-bikes with over 750W of power as \"motor-driven cycles,\" requiring a driver's license. E-bikes exceeding 3,500W will be considered motorcycles, mandating a motorcycle endorsement, registration, and insurance. The article also touches on the debate about whether 750W is an appropriate power limit and whether bikes exceeding 30 mph should be classified as motorcycles.\n",
    "chinese_title": "“70英里时速电动自行车”促使美国一州修改法律",
    "chinese_summary": "本文探讨了电动自行车日益普及和改装，尤其是在青少年群体中，促使康涅狄格州更新其电动自行车法律的情况。由于Super73等轻便摩托车式电动自行车在西港盛行，并被骑到学校，且易于改装以达到超过法定限制的速度，因此引起了人们的担忧。警察中尉Serenity Dobson强调了在线教程的可访问性，这些教程教导骑手如何绕过速度限制。\n\n目前，康涅狄格州采用标准的电动自行车三级分类系统，将1级和2级电动自行车的速度上限设定为20英里/小时，3级电动自行车设定为28英里/小时，功率限制为750W。预计于10月生效的新法律将把功率超过750W的电动自行车归类为“机动车”，需要驾驶执照。超过3500W的电动自行车将被视为摩托车，需要摩托车背书、注册和保险。文章还涉及关于750W是否为适当的功率限制，以及超过30英里/小时的自行车是否应归类为摩托车的争论。"
  },
  {
    "id": "44728833",
    "title": "URL-Driven State in HTMX",
    "url": "https://www.lorenstew.art/blog/bookmarkable-by-design-url-state-htmx/",
    "summary": "This article advocates for using the URL as the primary source of truth for application state in HTMX, eliminating the need for complex client-side state management libraries.  It details how to handle filters, sorting, pagination, and search by encoding this information directly into the URL.\n\nThe core pattern revolves around three synchronized steps: the server reading URL parameters to render the initial view, using HTML forms with hidden fields to preserve state across interactions, and automatic URL updating using HTMX's `hx-push-url` and `hx-params` attributes.\n\nThe server endpoint reads query parameters and renders the view accordingly, embedding the state directly into the DOM. Forms then capture all filter state, using hidden fields to persist parameters like sort order and page number across requests.  `hx-push-url=\"true\"` ensures HTMX updates the browser URL with the form data, creating history entries for back/forward navigation without needing Javascript.\n\nThe benefits include bookmarkable and shareable application state, a functional back button, built-in SEO, and transparent debugging.  The article also acknowledges potential limitations like URL length limits, emphasizing the importance of server-side validation and sanitization of URL parameters. Ultimately, the article argues that leveraging the URL for state management simplifies development, aligns with the web platform, and provides a superior user experience compared to complex client-side solutions.\n",
    "chinese_title": "HTMX 中的 URL 驱动状态",
    "chinese_summary": "本文倡导将URL作为HTMX中应用程序状态的主要来源，从而无需复杂的客户端状态管理库。文章详细介绍了如何通过将过滤器、排序、分页和搜索等信息直接编码到URL中来处理这些功能。\n\n核心模式围绕三个同步步骤展开：服务器读取URL参数以呈现初始视图，使用带有隐藏字段的HTML表单来保持交互过程中的状态，以及使用HTMX的`hx-push-url`和`hx-params`属性自动更新URL。\n\n服务器端点读取查询参数并相应地呈现视图，将状态直接嵌入到DOM中。表单随后捕获所有筛选器状态，使用隐藏字段来持久化排序顺序和页码等参数。`hx-push-url=\"true\"` 确保HTMX使用表单数据更新浏览器URL，为后退/前进导航创建历史记录，而无需JavaScript。\n\n其优点包括可收藏和分享的应用程序状态、可用的后退按钮、内置的SEO以及透明的调试。文章还承认了潜在的局限性，例如URL长度限制，强调了服务器端验证和清理URL参数的重要性。最终，文章认为，利用URL进行状态管理简化了开发，与Web平台保持一致，并且与复杂的客户端解决方案相比，提供了卓越的用户体验。"
  },
  {
    "id": "44736646",
    "title": "Australia widens teen social media ban to YouTube, scraps exemption",
    "url": "https://www.reuters.com/legal/litigation/australia-widens-teen-social-media-ban-youtube-scraps-exemption-2025-07-29/",
    "summary": "**Summary:**\n\nAustralia is expanding its proposed restrictions on social media access for teenagers, specifically targeting platforms like YouTube. The original proposal aimed to mandate parental consent for teenagers under 16 to access certain social media sites. The new move scraps a previously planned exemption for YouTube, meaning it will now also fall under the parental consent requirement.\n\nThe government's rationale is to protect young people from online harms, including cyberbullying, exposure to inappropriate content, and the potential for data exploitation. They believe that parental oversight is crucial in mitigating these risks.\n\nTech companies operating in Australia are likely to face compliance challenges, potentially requiring them to implement age verification systems and processes for obtaining verifiable parental consent. The implementation of these measures could be technically complex and costly.\n\nThe expanded social media ban is part of a broader effort by the Australian government to regulate the digital space and hold social media companies accountable for the content and experiences on their platforms, particularly as they relate to young users. The policy remains under development and will likely be subject to further debate and refinement.\n",
    "chinese_title": "澳大利亚扩大青少年社交媒体禁令至YouTube，取消豁免。",
    "chinese_summary": "**摘要：**\n\n澳大利亚正在扩大其针对青少年社交媒体访问的拟议限制，特别是针对 YouTube 等平台。 最初的提案旨在强制要求 16 岁以下的青少年访问某些社交媒体网站时需获得父母同意。 新举措取消了之前计划的 YouTube 例外，这意味着它现在也将受到父母同意要求的约束。\n\n政府的理由是保护年轻人免受网络欺凌、接触不当内容和潜在的数据剥削等网络危害。 他们认为父母的监督对于减轻这些风险至关重要。\n\n在澳大利亚运营的科技公司可能会面临合规挑战，可能需要它们实施年龄验证系统和获取可验证的父母同意的流程。 这些措施的实施可能在技术上非常复杂且成本高昂。\n\n这项扩大的社交媒体禁令是澳大利亚政府监管数字空间，并追究社交媒体公司对其平台上内容和体验责任的更广泛努力的一部分，尤其是在这些内容和体验与年轻用户相关时。 该政策仍在制定中，可能会受到进一步的辩论和完善。"
  },
  {
    "id": "44732700",
    "title": "Moneybadger and Peach Payments partner to enable Bitcoin payments",
    "url": "https://bitcoinke.io/2025/07/moneybadger-peach-payments-partnership/",
    "summary": "Peach Payments, a payment service provider in Africa, has partnered with MoneyBadger, a South African Bitcoin payment solution provider, to enable merchants to accept Bitcoin and other cryptocurrencies as payment. This partnership aims to broaden access to crypto payments for consumers.\n\nPick n Pay was the first retailer in Africa to offer Bitcoin payments, and now TicketPro is the first online ticketing company in South Africa to integrate MoneyBadger as a payment option through Peach Payments. TicketPro's CEO, Brandon Duffield, highlights the strategic advantage and customer convenience of this integration.\n\nAccording to MoneyBadger, South Africans are increasingly using Bitcoin for daily expenses. In the first half of 2025, MoneyBadger processed nearly 20,000 transactions worth R7.7 million, with Bitcoin accounting for 73% of the total crypto payments. The median transaction size is R174.\n\nThe process for consumers is seamless: they select \"Pay with Bitcoin,\" scan a QR code, and confirm the payment via their crypto wallet. Merchants are then paid in Rands. MoneyBadger supports several wallets, including Luno, VALR, and Binance.\n\nPeach Payments plans to expand the Bitcoin payment solution to other African territories as part of its unified payment strategy. Peach Payments also recently acquired PayDunya, a West-African payment platform operating in six Francophone countries. MoneyBadger's CEO, Carel van Wyk, says Peach Payments' strong merchant base made them a great partner.\n",
    "chinese_title": "Moneybadger与Peach Payments合作，实现比特币支付",
    "chinese_summary": "非洲支付服务提供商Peach Payments与南非比特币支付方案提供商MoneyBadger合作，使商家能够接受比特币和其他加密货币作为支付方式。此次合作旨在扩大消费者使用加密货币支付的渠道。\n\nPick n Pay是非洲第一家提供比特币支付的零售商，而现在TicketPro是南非第一家通过Peach Payments集成MoneyBadger作为支付选项的在线票务公司。TicketPro的首席执行官Brandon Duffield强调了此次集成的战略优势和客户便利性。\n\n据MoneyBadger称，南非人越来越多地使用比特币进行日常开支。2025年上半年，MoneyBadger处理了近2万笔交易，价值770万兰特，其中比特币占加密货币支付总额的73%。中位数交易规模为174兰特。\n\n消费者的流程非常简单：他们选择“使用比特币支付”，扫描二维码，并通过他们的加密钱包确认支付。然后商家以兰特收款。MoneyBadger支持多个钱包，包括Luno、VALR和Binance。\n\nPeach Payments计划将其比特币支付解决方案扩展到其他非洲地区，作为其统一支付战略的一部分。Peach Payments最近还收购了PayDunya，这是一个在六个法语国家运营的西非支付平台。MoneyBadger的首席执行官Carel van Wyk表示，Peach Payments强大的商家基础使他们成为了一个很好的合作伙伴。"
  },
  {
    "id": "44698946",
    "title": "Show HN: Cant – Library written in Rust that provides PyTorch-like functionality",
    "url": "https://github.com/TuckerBMorgan/can-t",
    "summary": "Cant is a Rust-based machine learning library designed as a learning project, aiming to replicate PyTorch functionality with automatic differentiation and tensor operations. It supports multi-dimensional array operations with broadcasting and provides both CPU (using `ndarray`) and macOS GPU (using Metal shaders) acceleration. Cant features a PyTorch-like API for ease of use.\n\nKey components include a central module (managing tensors, the computation graph, operations, and shapes) and acceleration backends (`cant_cpu` and `cant_metal`). It also includes utilities for GGUF model loading and timing.\n\nThe library utilizes a global equation system, a tensor ID system, and operation tracking for efficient computation and backward pass support. Testing includes unit tests, model tests (via GGUF files), and operation-specific tests.\n\nCurrently, Cant offers full CPU and Metal GPU support on macOS, while other platforms are limited to CPU-only operation via the `ndarray` backend. The library is released under the MIT License and authored by Tucker Morgan.\n",
    "chinese_title": "Show HN: Cant – Rust 编写的类 PyTorch 功能库",
    "chinese_summary": "Cant：一个基于 Rust 的机器学习库，旨在通过自动微分和张量运算复刻 PyTorch 功能，作为一个学习项目。它支持具有广播机制的多维数组运算，并提供 CPU（使用 `ndarray`）和 macOS GPU（使用 Metal shaders）加速。Cant 具有类似 PyTorch 的 API，易于使用。\n\n关键组件包括一个中心模块（管理张量、计算图、操作和形状）和加速后端（`cant_cpu` 和 `cant_metal`）。它还包括用于 GGUF 模型加载和计时的实用程序。\n\n该库利用全局方程系统、张量 ID 系统和操作跟踪来实现高效计算和反向传播支持。测试包括单元测试、模型测试（通过 GGUF 文件）和特定于操作的测试。\n\n目前，Cant 在 macOS 上提供完整的 CPU 和 Metal GPU 支持，而其他平台仅限于通过 `ndarray` 后端进行 CPU 操作。该库在 MIT 许可证下发布，由 Tucker Morgan 编写。"
  },
  {
    "id": "44736175",
    "title": "Ferrari were SO impressed by the Xiaomi SU7, they bought one",
    "url": "https://electrek.co/2025/07/29/report-ferrari-were-so-impressed-by-the-xiaomi-su7-they-bought-one/",
    "summary": "This Electrek article reports that Ferrari has purchased a Xiaomi SU7 Ultra to benchmark its technology for their upcoming electric vehicle. The story originated from a Weibo user posting photos of a SU7 Ultra leaving Ferrari's factory in Maranello, Italy. A Chinese blogger (\"Sago Dessert in Bologna\") claims Ferrari is actively analyzing the SU7 Ultra for its next-generation electric platform. Another blogger alleges that Ferrari representatives visited Xiaomi headquarters previously to discuss joint development of high-performance EV motors.\n\nThe Xiaomi SU7 Ultra boasts impressive specs, including 1,548 hp, sub 2.0-second 0-60 mph acceleration, and a top speed exceeding 200 mph, all at a lower price than competitors like the Tesla Model S Plaid and Porsche Taycan Turbo GT. It quickly sold out, garnering 50,000 orders almost immediately after its unveiling.\n\nThe article emphasizes the significance of Ferrari benchmarking the SU7, suggesting a potential shift in automotive innovation from the West to the East. Benchmarking involves dissecting competitor vehicles to compare various aspects like sound insulation, ride and handling, and manufacturing methods. This signals the SU7's recognized status as a new benchmark for EVs.\n",
    "chinese_title": "法拉利对小米SU7印象深刻，买了一辆。",
    "chinese_summary": "法拉利购入小米SU7 Ultra进行技术标杆研究，备战电动汽车。该消息源于微博用户发布的SU7 Ultra离开法拉利意大利马拉内罗工厂的照片。一位中国博主（“博洛尼亚的西米露”）称法拉利正在积极分析SU7 Ultra，用于其下一代电动平台。另一位博主声称，法拉利代表此前曾访问小米总部，讨论联合开发高性能电动汽车电机。\n\n小米SU7 Ultra拥有令人印象深刻的规格，包括1548马力，2秒内完成0-60英里/小时加速，以及超过200英里/小时的最高时速，而价格低于特斯拉Model S Plaid和保时捷Taycan Turbo GT等竞争对手。它迅速售罄，在发布后几乎立即获得了5万份订单。\n\n文章强调了法拉利对SU7进行标杆研究的意义，表明汽车创新可能从西方转向东方。标杆研究包括拆解竞争对手的车辆，以比较隔音、乘坐和操控以及制造方法等各个方面。这标志着SU7已被公认为电动汽车的新标杆。"
  },
  {
    "id": "44725764",
    "title": "Study mode",
    "url": "https://openai.com/index/chatgpt-study-mode/",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "学习模式",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "44698513",
    "title": "Show HN: The Aria Programming Language",
    "url": "https://github.com/egranata/aria",
    "summary": "Aria is a new, dynamic scripting language designed for ease of use and productivity. Inspired by languages like Python and Rust, Aria offers a familiar C-style syntax with features geared towards rapid development. The language aims to be a \"sweet spot\" for developers seeking a balance between power and simplicity.\n\nThe article highlights a simple example demonstrating Aria's ability to interact with web APIs, showcasing its features for making HTTP requests and parsing JSON responses. The standard library provides basic functionalities sufficient for tackling various tasks.\n\nCurrently, Aria supports only Linux, but contributions for other operating systems are welcomed. The example code fetches a GitHub user's data and prints the number of public repositories, illustrating the language's straightforward syntax and functionality. The article encourages users to try Aria and contribute to its development, directing them to the project's website for more information and resources.\n",
    "chinese_title": "Show HN: Aria编程语言",
    "chinese_summary": "Aria：一种注重易用性和效率的新型动态脚本语言。它从 Python 和 Rust 等语言中汲取灵感，采用熟悉的 C 风格语法，并针对快速开发量身定制了诸多特性。该语言旨在成为开发者寻求强大功能和简易性之间平衡的“最佳选择”。\n\n本文重点介绍了一个简单的示例，展示了 Aria 与 Web API 交互的能力，突出了其用于发出 HTTP 请求和解析 JSON 响应的功能。标准库提供了足够处理各种任务的基本功能。\n\n目前，Aria 仅支持 Linux，但欢迎为其他操作系统做出贡献。示例代码获取 GitHub 用户的数据并打印公共存储库的数量，展示了该语言直观的语法和功能。本文鼓励用户尝试 Aria 并为其开发做出贡献，并引导他们访问该项目的网站以获取更多信息和资源。"
  },
  {
    "id": "44736860",
    "title": "U.S. Imposes Sanctions on Brazilian Judge Overseeing Bolsonaro Coup Case",
    "url": "https://www.nytimes.com/2025/07/30/world/americas/trump-sanctions-brazil-judge-bolsonaro.html",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "美国制裁负责博索纳罗政变案的巴西法官",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "44734791",
    "title": "Show HN: Print the daily weather forecast on a thermal receipt printer",
    "url": "https://github.com/chr15m/print-weather",
    "summary": "This \"Show HN\" post describes a Python script that prints a daily weather forecast on a thermal receipt printer. It leverages the Pillow image library and ImageMagick for icon handling.\n\n**Key takeaways:**\n\n*   **Functionality:** Prints a daily weather forecast on a thermal receipt printer.\n*   **Dependencies:** Requires Python 3, Pillow, and ImageMagick. The script also needs weather icons (downloadable with a command-line flag, via git clone, or as a zip file).\n*   **Setup:** Explains how to install the dependencies using apt-get for Debian/Ubuntu or pip for other systems.\n*   **Usage:** Demonstrates how to run the script, redirecting the output to the printer device file.\n*   **Location:** The script can be configured with GPS coordinates and timezone either through command-line arguments (latitude, longitude, timezone) or environment variables. If not provided, it defaults to London, UK.\n*   **Scheduling:** Provides instructions on using `cron` to schedule the script to run automatically, including an example for running it at 5 AM daily using environment variables for location configuration.\n",
    "chinese_title": "Show HN: 用热敏小票打印机打印每日天气预报",
    "chinese_summary": "此“Show HN”帖子描述了一个Python脚本，该脚本可在热敏小票打印机上打印每日天气预报。它利用Pillow图像库和ImageMagick进行图标处理。\n\n**要点：**\n\n*   **功能：** 在热敏小票打印机上打印每日天气预报。\n*   **依赖：** 需要Python 3、Pillow和ImageMagick。脚本还需要天气图标（可以通过命令行标志下载，通过git clone，或作为zip文件下载）。\n*   **设置：** 解释了如何使用apt-get（针对Debian/Ubuntu）或pip（针对其他系统）安装依赖项。\n*   **用法：** 演示了如何运行脚本，并将输出重定向到打印机设备文件。\n*   **位置：** 可以通过命令行参数（纬度、经度、时区）或环境变量配置脚本的GPS坐标和时区。如果未提供，则默认为英国伦敦。\n*   **调度：** 提供了使用`cron`调度脚本自动运行的说明，包括一个每天凌晨5点使用环境变量进行位置配置的示例。"
  },
  {
    "id": "44698087",
    "title": "USB-C for Lightning iPhones",
    "url": "https://obsoless.com/products/iph0n3-usb-c-protection-case",
    "summary": "This page advertises the \"iPh0n3 - USB-C Protection Case,\" a product designed to give Lightning-port iPhones USB-C functionality. The case allows users to use USB-C cables for charging, data transfers, and CarPlay without needing to buy a new iPhone. It also supports wireless and MagSafe charging, with the latter reportedly even stronger with the case on.\n\nHowever, the case has limitations. It does not support accessories that draw power *from* the phone and rely on the Lightning port, such as wired headphones or external storage. These will still require the Lightning port, necessitating removal of the case.\n\nThe case is made in Switzerland from dark gray Nylon 12 plastic. Many models and batches are currently sold out, and potential buyers are encouraged to sign up with their email to be notified when their desired model is back in stock. An announcement video and instructions are provided.\n",
    "chinese_title": "适用于Lightning接口的iPhone的USB-C",
    "chinese_summary": "本页面宣传一款名为“iPh0n3 - USB-C 保护壳”的产品，旨在为 Lightning 接口的 iPhone 提供 USB-C 功能。该保护壳允许用户使用 USB-C 线缆进行充电、数据传输和 CarPlay，无需购买新的 iPhone。它还支持无线和 MagSafe 充电，据说使用该保护壳后，MagSafe 充电效果更强。\n\n然而，这款保护壳也有局限性。它不支持从手机 *取电* 并依赖 Lightning 接口的配件，例如有线耳机或外部存储设备。这些设备仍然需要 Lightning 接口，因此需要取下保护壳。\n\n该保护壳在瑞士制造，采用深灰色 Nylon 12 塑料。目前许多型号和批次已售罄，建议潜在买家注册邮箱，以便在所需型号补货时收到通知。 此外，还提供一段宣传视频和使用说明。"
  },
  {
    "id": "44733061",
    "title": "How email tracking works behind the scenes",
    "url": "https://buttondown.com/blog/email-tracking-pixels-bugs",
    "summary": "This article delves into the mechanics and ethics of email tracking, specifically focusing on the use of tracking pixels. It begins by drawing a parallel to the initial privacy concerns surrounding Caller ID. Email itself is inherently private, but the addition of HTML and image linking allows senders to track when and where emails are opened.\n\nThe core of email tracking relies on embedding a tiny, often invisible, image in the email. When the recipient's email client loads the image, the sender receives HTTP referer data, including IP address, location, operating system, and browser information. This raises significant privacy concerns, prompting ethical debates and prompting regulations like GDPR, which mandates informed consent for tracking.\n\nThe article highlights the increasing ineffectiveness of tracking pixels due to privacy measures implemented by major email providers like Gmail and Apple Mail, which pre-load or proxy images, rendering the data inaccurate. Gmail, for instance, loads images from random servers with fake configurations.\n\nUltimately, the article argues that the value of tracking data is depreciating and carries the risk of being marked as spam. It advocates for prioritizing genuine engagement and conversation through well-written content over relying on potentially misleading tracking metrics. Finally, it offers guidance on how to disable remote images in various email clients to protect personal privacy.\n",
    "chinese_title": "电子邮件追踪背后的运作原理",
    "chinese_summary": "本文深入探讨了邮件追踪的机制和伦理，特别关注追踪像素的使用。文章首先将其与最初围绕来电显示产生的隐私担忧进行类比。电子邮件本身具有内在的私密性，但HTML和图像链接的添加使得发送者可以追踪电子邮件何时何地被打开。\n\n邮件追踪的核心在于在邮件中嵌入一个微小的、通常不可见的图像。当收件人的邮件客户端加载该图像时，发送者会收到HTTP referer数据，包括IP地址、位置、操作系统和浏览器信息。这引发了重大的隐私问题，引发了伦理辩论，并促成了GDPR等法规的出台，这些法规强制要求追踪必须获得知情同意。\n\n文章强调，由于Gmail和Apple Mail等主要邮件提供商实施的隐私保护措施（例如预加载或代理图像），追踪像素的有效性日益降低，导致数据不准确。例如，Gmail会从具有虚假配置的随机服务器加载图像。\n\n最终，文章认为，追踪数据的价值正在贬值，并且存在被标记为垃圾邮件的风险。文章提倡优先考虑通过精心编写的内容进行的真实互动和对话，而不是依赖于可能具有误导性的追踪指标。最后，文章还提供了如何在各种邮件客户端中禁用远程图像以保护个人隐私的指南。"
  },
  {
    "id": "44729302",
    "title": "Two Birds with One Tone: I/Q Signals and Fourier Transform",
    "url": "https://wirelesspi.com/two-birds-with-one-tone-i-q-signals-and-fourier-transform-part-1/",
    "summary": "This article explains the concept of I/Q signals and their relationship to the Fourier Transform, focusing on their importance in wireless communication systems. It begins by highlighting the mystery surrounding I/Q signals and differentiates between \"phase shift\" and \"phase angle.\"\n\nThe article emphasizes that wireless systems use electromagnetic waves (sinusoids) to transmit information by modulating their amplitude, frequency, or phase. To increase the amount of information transmitted, the article introduces the concept of orthogonality. Orthogonality ensures that multiple carriers do not interfere with each other.\n\nThe core idea is that sinusoids with a $90^\\circ$ phase shift (cosine and negative sine) are orthogonal, enabling two independent data streams ($I$ and $Q$ components) to be transmitted simultaneously using amplitude modulation. The dot product is used to demonstrate that cosine and sine waves are orthogonal.\n\nThe article then uses Quadrature Amplitude Modulation (QAM) as a practical example to illustrate how I/Q signals are used in communication systems. In QAM, the amplitudes of the cosine ($I$) and negative sine ($Q$) waves are independently modulated based on the input data. These modulated signals are then combined to create a single transmitted waveform. The article explains how bits are mapped to specific amplitude values for the $I$ and $Q$ components in 4-QAM.\n\nIn summary, the article elucidates I/Q signals by connecting them to the fundamental concept of orthogonality and demonstrating their application in a QAM system.\n",
    "chinese_title": "一石二鸟：I/Q信号与傅里叶变换",
    "chinese_summary": "本文解释了I/Q信号的概念及其与傅里叶变换的关系，重点阐述了它们在无线通信系统中的重要性。文章首先点明了I/Q信号的神秘性，并区分了“相移”和“相位角”。\n\n文章强调，无线系统利用电磁波（正弦波）通过调制其幅度、频率或相位来传输信息。为了增加传输的信息量，文章介绍了正交性的概念。正交性确保了多个载波互不干扰。\n\n核心思想是，具有 $90^\\circ$ 相移的正弦波（余弦和负正弦）是正交的，这使得可以使用幅度调制同时传输两个独立的数据流（$I$ 和 $Q$ 分量）。点积被用来证明余弦波和正弦波是正交的。\n\n然后，文章使用正交幅度调制（QAM）作为一个实际例子，来说明I/Q信号是如何在通信系统中使用的。在QAM中，余弦（$I$）和负正弦（$Q$）波的幅度根据输入数据独立调制。然后，这些调制后的信号被组合起来，以创建一个单一的传输波形。文章解释了在4-QAM中，比特如何映射到$I$和$Q$分量的特定幅度值。\n\n总而言之，本文通过将I/Q信号与正交性的基本概念联系起来，并演示其在QAM系统中的应用，从而阐明了I/Q信号。"
  },
  {
    "id": "44727191",
    "title": "How the brain increases blood flow on demand",
    "url": "https://hms.harvard.edu/news/how-brain-increases-blood-flow-demand",
    "summary": "This article discusses a new study that sheds light on how the brain regulates blood flow to active regions. Researchers at Harvard Medical School discovered that the brain uses specialized channels in the lining of its blood vessels to communicate the need for increased blood flow to specific areas. These channels, called gap junctions, connect neighboring endothelial cells lining the blood vessels, creating a communication \"highway.\" This allows the brain to quickly and efficiently direct blood flow to areas requiring more energy.\n\nThe study, conducted in mice, identified two genes crucial for this communication pathway. The findings suggest that the brain uses the inner lining of its blood vessels as a coordinated signaling system to dilate or contract vessels, ensuring optimal blood delivery to active regions.\n\nThe research has potential implications for understanding and interpreting brain imaging tests like fMRI, which relies on the link between blood flow and neural activity. Furthermore, it may contribute to a better understanding of neurodegenerative diseases, where this communication system often malfunctions, leading to cognitive decline. The researchers hope that by understanding the mechanism behind blood flow regulation in the brain, they can develop new therapies for neurodegenerative diseases.\n",
    "chinese_title": "大脑如何按需增加血流量",
    "chinese_summary": "本文探讨了一项新研究，该研究阐明了大脑如何调节流向活跃区域的血流。哈佛医学院的研究人员发现，大脑利用血管内壁中的特殊通道来传递增加特定区域血流的需求。这些通道被称为间隙连接，连接着血管内壁相邻的内皮细胞，形成了一条通信“高速公路”。这使得大脑能够快速有效地将血流导向需要更多能量的区域。\n\n这项在小鼠身上进行的研究，确定了对该通信通路至关重要的两个基因。研究结果表明，大脑利用血管内壁作为一种协调的信号系统来扩张或收缩血管，从而确保最佳的血液输送到活跃区域。\n\n该研究对理解和解释脑成像测试（如fMRI）具有潜在意义，fMRI依赖于血流和神经活动之间的联系。此外，它可能有助于更好地理解神经退行性疾病，在这种疾病中，这种通信系统经常发生故障，导致认知能力下降。研究人员希望通过了解大脑血流调节背后的机制，他们能够开发出治疗神经退行性疾病的新疗法。"
  },
  {
    "id": "44734475",
    "title": "Opsqueue: Lightweight batch processing queue for heavy loads – now open-source",
    "url": "https://www.channable.com/tech/introducing-opsqueue",
    "summary": "Opsqueue, a lightweight batch processing queue system designed for heavy workloads, is now open-source. Developed in Rust, it prioritizes throughput over latency and scales to billions of operations using SQLite, object storage (like S3 or GCS), and a single binary for operational simplicity.\n\nOpsqueue implements a \"generate-execute\" pattern where a producer service generates operations, places them in an input queue, and a consumer service executes them, writing results to an output queue. This pattern is useful when the producer is not scalable or specialized for the required task. Opsqueue ensures clear order between operations, atomic success/failure of submissions, and consistency in the face of network failures, with built-in retry mechanisms. A key feature is consumer-driven prioritization, enabling fairness and optimal resource allocation.\n\nThe system leverages object storage for data and SQLite for metadata, reducing database size and network request times. Chunks of operations are processed to reduce coordination overhead. Opsqueue integrates OpenTelemetry Tracing for production insights.\n\nThe system avoids common pitfalls of Redis lists and Postgres-based queues. It is designed for operational simplicity with straightforward autoscaling and testing. Client libraries, currently mainly in Python, wrap Rust-based logic for performance and consistency. In production, Opsqueue handles millions of operations per hour with sub-millisecond queue overhead.\n",
    "chinese_title": "Opsqueue: 轻量级重负载批量处理队列——现已开源",
    "chinese_summary": "Opsqueue，一款为重负载设计的轻量级批量处理队列系统，现已开源。它使用 Rust 开发，优先考虑吞吐量而非延迟，并使用 SQLite、对象存储（如 S3 或 GCS）以及单个二进制文件进行扩展，以实现运营的简洁性，可扩展至数十亿次操作。\n\nOpsqueue 实现了“生成-执行”模式，其中生产者服务生成操作，将其放入输入队列，消费者服务执行这些操作，并将结果写入输出队列。当生产者无法扩展或专门用于所需任务时，此模式非常有用。Opsqueue 确保操作之间的清晰顺序、提交的原子成功/失败，以及在面对网络故障时的一致性，并具有内置的重试机制。一个关键特性是消费者驱动的优先级排序，从而实现公平和最佳的资源分配。\n\n该系统利用对象存储存储数据，利用 SQLite 存储元数据，从而减少数据库大小和网络请求时间。处理大块的操作以减少协调开销。Opsqueue 集成了 OpenTelemetry Tracing，以获得生产洞察力。\n\n该系统避免了 Redis 列表和基于 Postgres 的队列的常见缺陷。它专为运营的简洁性而设计，具有简单的自动缩放和测试功能。客户端库，目前主要为 Python，封装了基于 Rust 的逻辑，以实现性能和一致性。在生产环境中，Opsqueue 每小时可处理数百万次操作，队列开销低于毫秒级。"
  },
  {
    "id": "44736318",
    "title": "Raw milk outbreak from 2023 reported",
    "url": "https://arstechnica.com/features/2025/07/its-shocking-massive-raw-milk-outbreak-from-2023-finally-reported/",
    "summary": "In October 2023, a Salmonella outbreak linked to Raw Farm LLC raw milk initially sickened a handful of people in California, raising concerns due to the hospitalization of children. While initial press releases suggested a localized issue, a recently released report reveals the outbreak was far more extensive, spanning from September 2023 to March 2024, affecting at least 171 people across five states. A shocking 70% of those sickened were children and teens, with many requiring hospitalization.\n\nFood safety lawyer Bill Marler expressed outrage that the full scale of the outbreak wasn't publicized earlier, raising questions about the California Department of Public Health's (CDPH) communication strategy. CDPH's response to inquiries about the lack of transparency was limited.\n\nRaw Farm's owner, Mark McAfee, disputed the severity of the outbreak, claiming a far lower number of cases and casting doubt on the accuracy of genomic data linking the illness to his products. He also downplayed the risks of raw milk and touted debunked health benefits. Marler's blog tracks at least 11 outbreaks linked to Raw Farm.\n\nThe article underscores the significant health risks associated with consuming raw milk, particularly for vulnerable populations like children, and highlights the importance of transparent public health communication during outbreaks.\n",
    "chinese_title": "2023年原奶疫情报告",
    "chinese_summary": "2023年10月，与Raw Farm LLC生牛奶相关的沙门氏菌爆发最初导致加州少数人患病，儿童住院引发担忧。 虽然最初的新闻稿暗示这是一个局部问题，但最近发布的一份报告显示，疫情远比想象的严重，从2023年9月持续到2024年3月，影响了五个州的至少171人。 令人震惊的是，70%的患者是儿童和青少年，其中许多人需要住院治疗。\n\n食品安全律师比尔·马勒对疫情的全部规模未能早日公开表示愤慨，对加州公共卫生部（CDPH）的沟通策略提出了质疑。 CDPH对缺乏透明度调查的回应有限。\n\nRaw Farm的所有者马克·麦卡菲对疫情的严重程度提出异议，声称病例数量远低于实际数字，并对将疾病与他的产品联系起来的基因组数据的准确性表示怀疑。 他还淡化了生牛奶的风险，并吹捧已被揭穿的健康益处。 马勒的博客追踪了至少11起与Raw Farm相关的疫情爆发。\n\n这篇文章强调了食用生牛奶，特别是对儿童等弱势群体造成的重大健康风险，并突出了疫情期间透明公共卫生沟通的重要性。"
  },
  {
    "id": "44728188",
    "title": "RIP Shunsaku Tamiya, the man who made plastic model kits a global obsession",
    "url": "https://JapaneseNostalgicCar.com/rip-shunsaku-tamiya-plastic-model-kits/",
    "summary": "This article commemorates the passing of Shunsaku Tamiya, former president and chairman of Tamiya, Inc., highlighting his pivotal role in transforming the company into a globally recognized manufacturer of high-precision plastic model kits, radio control vehicles, and Mini 4WD racers. The article details Tamiya's early involvement in the company, its shift from lumber to wooden models, and then his leadership in embracing plastic technology, revolutionizing the model kit industry.\n\nTamiya was instrumental in establishing the company's branding and reputation for quality, including the \"twin stars\" logo and distinctive \"white box\" packaging. He was known for his commitment to accuracy, even going to the extreme of disassembling a real Porsche 911 to ensure the fidelity of the 1976 Porsche 934 Turbo RSR model kit.\n\nThe article notes Tamiya's Lifetime Achievement Award at the Japan Media Arts Festival in 2018. Several commenters share personal anecdotes about building Tamiya models in their youth, emphasizing the brand's quality and its influence in sparking an interest in cars, particularly JDM cars. Some commenters recall purchasing Tamiya models from unexpected retailers like Longs Drugs. The comments celebrate Tamiya's contribution to childhood pastimes and express hope for the company's continued success.\n",
    "chinese_title": "田宮俊作逝世，他让塑料模型风靡全球",
    "chinese_summary": "纪念田宫俊作逝世：塑模巨匠，引领模型革命"
  },
  {
    "id": "44689565",
    "title": "FoundationDB: From idea to Apple acquisition [video]",
    "url": "https://www.youtube.com/watch?v=C1nZzQqcPZw",
    "summary": "This YouTube video is titled \"FoundationDB: From idea to Apple acquisition.\" However, the provided content excerpt is solely standard YouTube boilerplate text related to copyright, terms of service, privacy, and Google. It doesn't offer any actual information about FoundationDB, its origins, or its acquisition by Apple. Therefore, it's impossible to summarize the video's content based on the given excerpt. To understand the video's message, one would need to actually watch it.\n",
    "chinese_title": "FoundationDB：从创意到苹果收购 [视频]",
    "chinese_summary": "该YouTube视频标题为“FoundationDB：从创意到苹果收购”。然而，所提供的内容摘录仅是标准的YouTube样板文字，涉及版权、服务条款、隐私和谷歌。它没有提供关于FoundationDB、其起源或被苹果收购的任何实际信息。因此，无法根据给定的摘录总结视频的内容。要理解视频的信息，需要实际观看。"
  },
  {
    "id": "44699199",
    "title": "Show HN: Online Ruler – Measuring in inches/centimeters",
    "url": "https://anruler.com/",
    "summary": "This \"Show HN\" post presents an online ruler tool for measuring in inches and centimeters. The tool aims for accuracy through automatic device detection, recognizing popular devices (Apple, Samsung, Google, etc.) and applying their factory PPI. A green \"Detected\" box confirms successful automatic detection.\n\nIf automatic detection fails, users can manually configure the ruler's accuracy using two methods:\n\n1.  **Screen Diagonal Input:** Users find their screen's diagonal size (from the device box or online search) and input it into the tool. The ruler then adjusts accordingly.\n\n2.  **Credit Card Calibration:** This method uses a standard-sized credit card (85.60 mm/3.37 in) as a reference. Users place a card on the screen next to the provided guide and adjust a slider until the guide matches the card's width, thus calibrating the ruler.\n\nThe chosen settings are saved for future visits, making the online ruler a convenient and persistent tool for digital measurements.\n",
    "chinese_title": "Show HN：在线尺子 – 英寸/厘米测量",
    "chinese_summary": "此“Show HN”帖子介绍了一个在线标尺工具，用于测量英寸和厘米。该工具旨在通过自动设备检测实现准确性，识别常用设备（Apple、Samsung、Google等）并应用其出厂PPI。绿色“已检测”框确认自动检测成功。\n\n如果自动检测失败，用户可以使用两种方法手动配置标尺的准确性：\n\n1.  **屏幕对角线输入：** 用户找到其屏幕的对角线尺寸（从设备包装盒或在线搜索），并将其输入到工具中。标尺随后会进行相应调整。\n\n2.  **信用卡校准：** 此方法使用标准尺寸的信用卡（85.60毫米/3.37英寸）作为参考。用户将卡片放在屏幕上提供的引导旁边，并调整滑块，直到引导与卡片的宽度匹配，从而校准标尺。\n\n所选设置将保存以供将来访问，使在线标尺成为方便且持久的数字测量工具。"
  },
  {
    "id": "44736564",
    "title": "Reuters used Gemini Pro to collect and analyze prison temperature data",
    "url": "https://www.reuters.com/world/us/how-reuters-collected-analyzed-prison-temperature-data-2025-07-30/",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "路透社使用 Gemini Pro 收集并分析监狱温度数据",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "44735572",
    "title": "Lume: The Robotic Lamp",
    "url": "https://twitter.com/aaronistan/status/1949862617872478664",
    "summary": "This isn't an article about the \"Lume: The Robotic Lamp.\" Instead, it's a static webpage error message displayed by X (formerly Twitter) stating that JavaScript is disabled. The page advises the user to enable JavaScript or switch to a supported browser in order to use the platform. It provides links to the X Help Center, Terms of Service, Privacy Policy, Cookie Policy, Imprint, and Ad Information. The copyright notice indicates the page belongs to X Corp. and is copyrighted to 2025.\n\nIn essence, the page is an error message preventing access to the X platform due to a lack of JavaScript functionality in the user's browser. There is no information provided about a robotic lamp or its features.\n",
    "chinese_title": "Lume：机械台灯",
    "chinese_summary": "这不是一篇关于“Lume：机器人灯”的文章。相反，这是一个由X（前身为Twitter）显示的静态网页错误信息，提示JavaScript已被禁用。该页面建议用户启用JavaScript或切换到受支持的浏览器以使用该平台。它提供了X帮助中心、服务条款、隐私政策、Cookie政策、版本说明和广告信息的链接。版权声明表明该页面属于X Corp.，版权所有至2025年。\n\n本质上，该页面是一个错误信息，由于用户的浏览器缺乏JavaScript功能而阻止访问X平台。 没有提供关于机器人灯或其功能的任何信息。"
  },
  {
    "id": "44734841",
    "title": "The Gen Xers Who Waited Their Turn to Be CEO Are Getting Passed Over",
    "url": "https://www.wsj.com/lifestyle/careers/gen-x-business-leadership-executives-d74ca6ad",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "等待轮到自己当CEO的X世代正被超越",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "44736547",
    "title": "The case for memes as a new form of comics",
    "url": "https://arstechnica.com/culture/2025/07/the-case-for-memes-as-a-new-form-of-comics/",
    "summary": "Michelle Ann Abate, an English professor specializing in comics, argues that internet memes, particularly image macros, represent a new form of digital comics. She draws parallels between single-panel comics and memes, highlighting the shared interplay of visual and verbal elements. Abate notes that while comics artists typically create both image and text, memes adapt existing visuals, which she likens to musical sampling, resulting in original art.\n\nThe article emphasizes how memes, as a form of sequential art, are influenced by their online nature, often employing vertical panel arrangements for phone readability. This arrangement, as exemplified by the \"American Chopper\" meme, enhances the perception of debate.\n\nAbate references Scott McCloud's \"infinite canvas\" concept for digital comics, suggesting that memes have a different kind of infinite potential. Instead of a large, explorable space, memes offer endless revisions and reinterpretations of a template, constantly re-imagined and recirculated.\n\nThe article also discusses the qualities of a good meme image, noting its ability to pair with captions and its elasticity for adaptation. While some memes are tied to specific events and may have limited longevity, others, like \"Distracted Boyfriend\" and \"This is Fine,\" possess greater staying power due to their broader applicability. In essence, Abate's argument posits that memes are not just fleeting internet trends, but a legitimate evolution of the comics medium.\n",
    "chinese_title": "表情包作为一种新型漫画的可能性",
    "chinese_summary": "米歇尔·安·阿贝特是一位专攻漫画的英语教授，她认为互联网迷因，尤其是图像宏，代表了一种新的数字漫画形式。她将单格漫画与迷因进行比较，强调了视觉和语言元素的共同作用。阿贝特指出，虽然漫画艺术家通常创作图像和文字，但迷因会改编现有的视觉素材，她将其比作音乐采样，从而产生原创艺术。\n\n文章强调了迷因作为一种序列艺术，如何受到其在线本质的影响，通常采用垂直面板排列以方便手机阅读。这种排列方式，如“美国直升机”迷因所例证的，增强了辩论的感知。\n\n阿贝特引用了斯科特·麦克劳德关于数字漫画的“无限画布”概念，表明迷因具有另一种无限潜力。迷因不是一个巨大的、可探索的空间，而是提供了对模板的无休止的修改和重新诠释，不断地被重新想象和重新传播。\n\n文章还讨论了优秀迷因图像的品质，指出其与标题的搭配能力以及其适应的弹性。虽然一些迷因与特定事件相关，可能寿命有限，但另一些迷因，如“分心男友”和“这没事”，由于其更广泛的适用性而具有更强的持久力。本质上，阿贝特的论点认为，迷因不仅仅是转瞬即逝的互联网潮流，而是漫画媒介的合法进化。"
  },
  {
    "id": "44732998",
    "title": "SensorLM: Learning the Language of Wearable Sensors",
    "url": "https://research.google/blog/sensorlm-learning-the-language-of-wearable-sensors/",
    "summary": "SensorLM, a new family of sensor-language foundation models developed by Google Research, aims to bridge the gap between raw wearable sensor data and its real-world meaning. Trained on nearly 60 million hours of multimodal sensor data from over 103,000 individuals, SensorLM learns to translate complex sensor data into meaningful, natural language descriptions.\n\nThe key challenge addressed is the lack of large-scale datasets pairing sensor recordings with descriptive text. To overcome this, researchers developed a hierarchical pipeline to automatically generate text captions from the sensor data itself, creating a massive sensor-language dataset.\n\nSensorLM employs both contrastive learning (matching sensor data with text descriptions) and generative pre-training (generating text captions from sensor data) to achieve a deep understanding of the relationship between sensor signals and language.\n\nThe model demonstrates strong performance in zero-shot and few-shot activity recognition, cross-modal retrieval (querying descriptions using sensor input or finding sensor patterns using natural language), and caption generation. SensorLM's generated captions are more coherent and accurate than those produced by generic language models. Scaling experiments show that performance consistently improves with more data, larger model sizes, and increased computation.\n\nThe research suggests that SensorLM can unlock a better understanding of wearable sensor data through natural language, enabling more personalized and actionable health insights. Future plans involve scaling pre-training data into new domains like metabolic health and sleep analysis, potentially leading to digital health coaches and clinical monitoring tools.\n",
    "chinese_title": "SensorLM：可穿戴传感器语言学习",
    "chinese_summary": "SensorLM：连接传感器数据与真实世界意义的新型传感器语言基础模型，由谷歌研究院开发。它利用来自超过103000名个人的近6000万小时多模态传感器数据进行训练，学习将复杂的传感器数据转化为有意义的自然语言描述。\n\n其解决的关键挑战是缺乏将传感器记录与描述性文本配对的大规模数据集。为了克服这一难题，研究人员开发了一种分层管道，从传感器数据本身自动生成文本说明，从而创建了一个大规模的传感器-语言数据集。\n\nSensorLM采用对比学习（将传感器数据与文本描述匹配）和生成式预训练（从传感器数据生成文本说明）相结合的方式，以实现对传感器信号和语言之间关系的深刻理解。\n\n该模型在零样本和少样本活动识别、跨模态检索（使用传感器输入查询描述或使用自然语言查找传感器模式）和说明生成方面表现出强大的性能。 SensorLM生成的说明比通用语言模型生成的说明更连贯、更准确。 扩展实验表明，性能随着更多的数据、更大的模型尺寸和更高的计算量而持续提高。\n\n该研究表明，SensorLM可以通过自然语言更好地理解可穿戴传感器数据，从而实现更个性化和可操作的健康见解。未来的计划包括将预训练数据扩展到新的领域，如代谢健康和睡眠分析，有可能催生数字健康教练和临床监测工具。"
  },
  {
    "id": "44733462",
    "title": "Silicon Is Coming to Smartphone Batteries for a Big Energy Boost",
    "url": "https://spectrum.ieee.org/enovix-silicon-anode-battery-smartphone",
    "summary": "This article discusses a new silicon-anode battery developed by Enovix, highlighting its potential to significantly boost the energy density of smartphone batteries. The key takeaway is that this AI-1 battery offers approximately 20% greater energy density compared to batteries currently used in major smartphone models. This improvement stems from the battery's use of a silicon anode, which allows for higher energy storage.\n\nIn essence, the article suggests that silicon-anode batteries, like Enovix's AI-1, represent a promising advancement in smartphone battery technology, potentially leading to longer battery life and improved performance for future devices.\n",
    "chinese_title": "硅将进入智能手机电池，带来巨大能量提升",
    "chinese_summary": "本文探讨了Enovix公司开发的新型硅负极电池，重点介绍了其显著提升智能手机电池能量密度的潜力。主要结论是，与目前主流智能手机型号中使用的电池相比，这款AI-1电池的能量密度提高了约20%。这一改进源于该电池采用了硅负极，从而能够实现更高的能量存储。\n\n总而言之，本文表明，像Enovix的AI-1这样的硅负极电池代表了智能手机电池技术的一个有希望的进步，可能会为未来的设备带来更长的电池续航时间和更高的性能。"
  },
  {
    "id": "44736526",
    "title": "YouTube will identify and restrict minors' accounts with AI",
    "url": "https://www.theverge.com/news/715343/youtube-age-estimation-ai-minor-account-restrictions",
    "summary": "YouTube will begin using AI to identify and restrict accounts belonging to users under 18, starting August 13th in the US. The AI will analyze account activity and age information to estimate a user's age. If YouTube determines an account belongs to a minor, it will automatically apply protections already offered to self-identified underage users. These protections include blocking age-restricted videos, disabling personalized ads, enabling \"take a break\" notifications, limiting sensitive video recommendations, and turning on privacy reminders.\n\nThis initiative aligns with a global push for online child safety and follows the implementation of age verification rules in the UK and various legislative efforts aimed at protecting minors online.\n\nUsers who are incorrectly identified as underage will have the option to verify their age through government ID upload, selfie, or credit card information. YouTube acknowledges that this change may affect creators, potentially leading to a decrease in ad revenue due to the absence of personalized ads for minors. The initial rollout will be limited to a small set of US users, after which YouTube will assess the results before expanding the initiative to other countries.\n",
    "chinese_title": "YouTube将使用AI识别并限制未成年人账户。",
    "chinese_summary": "自8月13日起，YouTube将在美国开始使用人工智能识别和限制属于18岁以下用户的帐户。该人工智能将分析帐户活动和年龄信息来估计用户年龄。如果YouTube确定某个帐户属于未成年人，将自动应用已提供给自我识别为未成年用户的保护措施，包括屏蔽年龄限制视频、禁用个性化广告、启用“稍作休息”通知、限制敏感视频推荐以及开启隐私提醒。\n\n这项举措符合全球范围内加强在线儿童安全的趋势，此前英国已实施年龄验证规则，并且各国纷纷出台旨在保护未成年人在线安全的立法。\n\n被错误识别为未成年用户的用户可以选择通过上传政府身份证件、自拍照或信用卡信息来验证年龄。YouTube承认这一变化可能会影响创作者，可能导致因未成年人无法投放个性化广告而减少广告收入。初步推广将仅限于一小部分美国用户，之后YouTube将评估结果，然后再将该计划推广到其他国家/地区。"
  },
  {
    "id": "44724238",
    "title": "Irrelevant facts about cats added to math problems increase LLM errors by 300%",
    "url": "https://www.science.org/content/article/scienceadviser-cats-confuse-ai",
    "summary": "The article \"Irrelevant facts about cats added to math problems increase LLM errors by 300%\" discusses a study showing that large language models (LLMs) struggle to solve mathematical problems when presented with extraneous, especially emotionally evocative, information. Specifically, the study found that adding irrelevant facts about cats to math problems significantly increased the error rate of these models.\n\nResearchers found that the LLMs were easily distracted by the \"cat facts,\" even if they were clearly unrelated to the mathematical task at hand. This distraction led to a dramatic increase in errors, tripling the failure rate in some cases. The models seem to latch onto the additional information and incorporate it into their reasoning process, even when it's completely unnecessary and detrimental to finding the correct answer. This highlights a key weakness in current LLMs: a lack of robust ability to discern relevant from irrelevant information and to prioritize logical problem-solving over processing extraneous text.\n\nThe findings suggest that LLMs are more susceptible to contextual noise and irrelevant information than previously thought, raising concerns about their reliability in real-world applications where data is often messy and contains extraneous details. The study underscores the need for further research into how to improve the reasoning abilities of LLMs and make them more resistant to distraction, particularly in tasks requiring logical deduction and mathematical calculations. Ultimately, this research demonstrates that simply scaling up models isn't enough to solve fundamental reasoning challenges and that more nuanced approaches are required to build truly reliable AI systems.\n",
    "chinese_title": "在数学题中加入无关的猫咪信息，会导致LLM错误率增加300%。",
    "chinese_summary": "文章《在数学题中加入猫的无关信息使LLM错误率增加300%》讨论了一项研究，该研究表明，当呈现无关的、特别是情绪化的信息时，大型语言模型（LLM）难以解决数学问题。 具体而言，该研究发现，在数学题中加入关于猫的无关信息会显著增加这些模型的错误率。\n\n研究人员发现，LLM很容易被“猫的知识”分散注意力，即使这些知识显然与手头的数学任务无关。 这种分心导致错误率急剧增加，在某些情况下，失败率增加了两倍。 这些模型似乎会抓住额外的信息，并将其纳入推理过程，即使这些信息完全不必要且不利于找到正确的答案。 这突出了当前LLM的一个关键弱点：缺乏从相关信息中辨别无关信息，以及优先考虑逻辑问题解决而不是处理无关文本的强大能力。\n\n研究结果表明，LLM比以前认为的更容易受到上下文噪声和无关信息的影响，这引发了人们对其在真实世界应用中可靠性的担忧，因为在真实世界应用中，数据通常是混乱的，并且包含无关的细节。 该研究强调需要进一步研究如何提高LLM的推理能力，并使其更能抵抗干扰，尤其是在需要逻辑推理和数学计算的任务中。 最终，这项研究表明，仅仅扩大模型规模不足以解决基本的推理挑战，需要更细致的方法来构建真正可靠的AI系统。"
  },
  {
    "id": "44732937",
    "title": "U.S. intelligence intervened with DOJ to push HPE-Juniper merger",
    "url": "https://www.axios.com/2025/07/30/merger-hpe-juniper-networks-national-security",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "美国情报部门干预司法部，力推慧与-瞻博网络合并案",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "44723461",
    "title": "iPhone 16 cameras vs. traditional digital cameras",
    "url": "https://candid9.com/phone-camera/",
    "summary": "The article argues that while iPhone photos may seem comparable to those from traditional digital cameras at first glance, significant differences impact our perception, particularly when photographing people. The author claims these differences explain why smartphone photos are rarely framed.\n\nThe primary criticisms of iPhone cameras focus on distortion caused by the wide-angle lens. This \"fish-eye\" effect distorts proportions, making subjects appear to lean and altering body shapes, specifically feet and jawlines. The article contends that iPhones prioritize overall brightness through computational photography, which, while making images well-lit, diminishes natural shadows and flattens facial features, resulting in less flattering portraits. Jawlines are particularly affected, sometimes appearing almost completely erased.\n\nThe article also highlights the importance of \"bokeh\" (blurred background), achievable with traditional cameras, which helps subjects \"pop\" and enhances the overall aesthetic. In comparison, the author implies iPhone cameras lack this capability, contributing to a less visually appealing image. The author also points out that the iPhone creates unflattering skin tones, referring to the iPhone’s complexion as looking like a “hotdog”.\n",
    "chinese_title": "iPhone 16 相机对比传统数码相机",
    "chinese_summary": "文章认为，虽然iPhone照片乍看之下可能与传统数码相机照片相媲美，但显著差异影响着我们的感知，尤其是在拍摄人物时。作者声称这些差异解释了为何智能手机照片很少被精心构图。\n\n对iPhone相机的主要批评集中在广角镜头造成的畸变上。这种“鱼眼”效应扭曲了比例，使主体显得倾斜，并改变了体型，特别是脚部和下颚线条。文章认为，iPhone优先考虑通过计算摄影实现的整体亮度，这虽然使图像光线充足，但削弱了自然阴影并使面部特征扁平化，导致不太讨喜的肖像。下颚线条尤其受到影响，有时几乎完全消失。\n\n文章还强调了“散景”（背景虚化）的重要性，传统相机可以实现这种效果，有助于主体“突出”并增强整体美感。相比之下，作者暗示iPhone相机缺乏这种能力，导致图像视觉吸引力降低。作者还指出，iPhone会产生不讨喜的肤色，并称iPhone的肤色看起来像“热狗”。"
  },
  {
    "id": "44700199",
    "title": "Analoguediehard",
    "url": "http://www.analoguediehard.com/",
    "summary": "The Analoguediehard webpage serves only as a landing page with a message indicating that a frame-enabled web browser is required to view the site's content. Therefore, there's no substantive content to summarize beyond this technical requirement. The page doesn't offer any information about the topic \"Analoguediehard\" itself, its purpose, or any associated content.\n",
    "chinese_title": "模拟顽固派",
    "chinese_summary": "Analoguediehard 网页仅作为登陆页，显示消息表明需要支持框架的浏览器才能查看网站内容。因此，除了这项技术要求之外，没有实质内容可供总结。该页面没有提供关于 “Analoguediehard” 本身、其目的或任何相关信息的介绍。"
  },
  {
    "id": "44725202",
    "title": "Show HN: I built an AI that turns any book into a text adventure game",
    "url": "https://www.kathaaverse.com/",
    "summary": "KathaaVerse is an AI-powered platform that transforms books into interactive text adventure games. Users can choose from a selection of books across genres like Fantasy & Magic, Science Fiction, Contemporary Fiction, and Dystopian & Thriller. Each title, ranging from classics like \"Alice in Wonderland\" and \"Pride and Prejudice\" to sci-fi hits like \"Dune\" and \"The Martian,\" is converted into a game where users direct the plot through text-based commands and choices. The platform offers a variety of popular titles, including books and movies. The selection is curated to provide diverse narrative experiences.\n",
    "chinese_title": "Show HN: 我用AI把任何书变成文字冒险游戏",
    "chinese_summary": "KathaaVerse是一个人工智能平台，可以将书籍转化为互动式文字冒险游戏。用户可以从奇幻与魔法、科幻、当代小说、反乌托邦与惊悚等多种类型的书籍中进行选择。从《爱丽丝梦游仙境》和《傲慢与偏见到》到《沙丘》和《火星救援》等科幻巨作，每部作品都被转化为游戏，用户可以通过基于文本的命令和选择来指导情节发展。该平台提供各种热门作品，包括书籍和电影，并经过精心策划，以提供多样化的叙事体验。"
  },
  {
    "id": "44732659",
    "title": "Qwen3 30B-A3B",
    "url": "https://huggingface.co/Qwen/Qwen3-30B-A3B-Instruct-2507",
    "summary": "The provided text describes a resource titled \"Qwen3 30B-A3B,\" which likely refers to a model or dataset. Here's a summary:\n\nThe resource, \"Qwen3 30B-A3B,\" consists of 80 items. It was recently updated, approximately 2 hours ago. The resource has garnered attention, indicated by 965 views or downloads. This suggests it is a relatively new and potentially popular resource. Given the \"Qwen3\" and \"30B\" naming convention, it is highly probable that this resource pertains to a large language model (LLM) with 30 billion parameters. \"A3B\" could be a version number, a specific fine-tuning or adaptation, or a project codename. Without further context, its exact meaning remains unclear. The information suggests a relatively recent upload of a collection (80 items) related to a potentially significant language model, likely attracting considerable interest.\n",
    "chinese_title": "Qwen3 30B-A3B",
    "chinese_summary": "提供的文本描述了一个名为“Qwen3 30B-A3B”的资源，这可能指的是一个模型或数据集。以下是一个概要：\n\n资源“Qwen3 30B-A3B”包含80项。它最近更新过，大约在2小时前。该资源引起了关注，有965次浏览或下载，表明它是一个相对较新且可能很受欢迎的资源。鉴于“Qwen3”和“30B”的命名惯例，该资源很可能与一个拥有300亿参数的大型语言模型（LLM）有关。“A3B”可能是一个版本号、特定的微调或适配，或者是一个项目代号。在没有更多背景信息的情况下，它的确切含义仍然不清楚。这些信息表明，最近上传了一个与潜在的重要语言模型相关的集合（80项），很可能会引起相当大的兴趣。"
  },
  {
    "id": "44723316",
    "title": "My 2.5 year old laptop can write Space Invaders in JavaScript now (GLM-4.5 Air)",
    "url": "https://simonwillison.net/2025/Jul/29/space-invaders/",
    "summary": "This article discusses the author's experience running the GLM-4.5 Air language model on a 2.5-year-old MacBook Pro M2 (64GB RAM). GLM-4.5 Air is a 106 billion parameter open-weight model from Z.ai, and a 3-bit quantized version (44GB) was created by Ivan Fioravanti for MLX, allowing it to run on machines with 64GB of RAM.\n\nThe author successfully ran the model using the MLX framework and tasked it with generating an HTML and JavaScript page for a Space Invaders game. The model produced functional code on the first try, showcasing its coding capabilities. The article highlights that even a smaller model like GLM-4.5 Air demonstrates impressive coding skills.\n\nThe author also tested the model's ability to generate an SVG image of a pelican riding a bicycle, and noted the model's peak memory usage around 48GB. The author emphasizes the recent trend of language models specifically targeting coding tasks and observes the significant improvements in their performance. Compared to the initial LLaMA models, the author is surprised that his existing laptop can now handle more powerful models such as GLM 4.5 Air, Mistral 3.2 Small, Gemma 3 and Qwen 3, reflecting the rapid advancement in local coding model technology.\n",
    "chinese_title": "My 2.5 year old laptop can write Space Invaders in JavaScript now (GLM-4.5 Air)",
    "chinese_summary": "This article discusses the author's experience running the GLM-4.5 Air language model on a 2.5-year-old MacBook Pro M2 (64GB RAM). GLM-4.5 Air is a 106 billion parameter open-weight model from Z.ai, and a 3-bit quantized version (44GB) was created by Ivan Fioravanti for MLX, allowing it to run on machines with 64GB of RAM.\n\nThe author successfully ran the model using the MLX framework and tasked it with generating an HTML and JavaScript page for a Space Invaders game. The model produced functional code on the first try, showcasing its coding capabilities. The article highlights that even a smaller model like GLM-4.5 Air demonstrates impressive coding skills.\n\nThe author also tested the model's ability to generate an SVG image of a pelican riding a bicycle, and noted the model's peak memory usage around 48GB. The author emphasizes the recent trend of language models specifically targeting coding tasks and observes the significant improvements in their performance. Compared to the initial LLaMA models, the author is surprised that his existing laptop can now handle more powerful models such as GLM 4.5 Air, Mistral 3.2 Small, Gemma 3 and Qwen 3, reflecting the rapid advancement in local coding model technology.\n"
  },
  {
    "id": "44733068",
    "title": "Pockets Are a Significant, Untapped Market",
    "url": "https://www.neurospicy.agency/post/pockets-are-a-significant-untapped-market",
    "summary": "生成摘要时出错",
    "chinese_title": "Pockets Are a Significant, Untapped Market",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44726280",
    "title": "Elements of System Design",
    "url": "https://github.com/jarulraj/periodic-table",
    "summary": "生成摘要时出错",
    "chinese_title": "Elements of System Design",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44724068",
    "title": "Observable Notebooks 2.0 Technology Preview",
    "url": "https://observablehq.com/notebook-kit/",
    "summary": "生成摘要时出错",
    "chinese_title": "Observable Notebooks 2.0 Technology Preview",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44723818",
    "title": "Structuring large Clojure codebases with Biff",
    "url": "https://biffweb.com/p/structuring-large-codebases/",
    "summary": "生成摘要时出错",
    "chinese_title": "Structuring large Clojure codebases with Biff",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44726731",
    "title": "A month using XMPP (using Snikket) for every call and chat (2023)",
    "url": "https://neilzone.co.uk/2023/08/a-month-using-xmpp-using-snikket-for-every-call-and-chat/",
    "summary": "生成摘要时出错",
    "chinese_title": "A month using XMPP (using Snikket) for every call and chat (2023)",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44725966",
    "title": "ACM Transitions to Full Open Access",
    "url": "https://www.acm.org/publications/openaccess",
    "summary": "生成摘要时出错",
    "chinese_title": "ACM Transitions to Full Open Access",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44736425",
    "title": "Trump appointees head for the exits at multiple agencies",
    "url": "https://www.govexec.com/management/2025/07/doge-and-other-day-one-trump-appointees-head-exits-multiple-agencies/407075/",
    "summary": "生成摘要时出错",
    "chinese_title": "Trump appointees head for the exits at multiple agencies",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44734866",
    "title": "Tony Hoare on record handling. (1966) [pdf]",
    "url": "https://archive.computerhistory.org/resources/text/Knuth_Don_X4100/PDF_index/k-9-pdf/k-9-u2293-Record-Handling-Hoare.pdf",
    "summary": "生成摘要时出错",
    "chinese_title": "Tony Hoare on record handling. (1966) [pdf]",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44727653",
    "title": "Dropbox Passwords discontinuation",
    "url": "https://help.dropbox.com/en-us/installs/dropbox-passwords-discontinuation",
    "summary": "生成摘要时出错",
    "chinese_title": "Dropbox Passwords discontinuation",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44696543",
    "title": "The Sail instruction-set semantics specification language",
    "url": "https://alasdair.github.io/manual.html",
    "summary": "生成摘要时出错",
    "chinese_title": "The Sail instruction-set semantics specification language",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44695364",
    "title": "Microsoft Flight Simulator 2024: WebAssembly SDK",
    "url": "https://docs.flightsimulator.com/msfs2024/html/6_Programming_APIs/WASM/WebAssembly.htm",
    "summary": "生成摘要时出错",
    "chinese_title": "Microsoft Flight Simulator 2024: WebAssembly SDK",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44736063",
    "title": "Examining mushrooms under microscopes helps engineers design stronger materials",
    "url": "https://theconversation.com/examining-mushrooms-under-microscopes-can-help-engineers-design-stronger-materials-260477",
    "summary": "生成摘要时出错",
    "chinese_title": "Examining mushrooms under microscopes helps engineers design stronger materials",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44736025",
    "title": "No traffic deaths in Helsinki for a year",
    "url": "https://www.helsinkitimes.fi/finland/finland-news/domestic/27539-helsinki-records-zero-traffic-deaths-for-full-year.html",
    "summary": "生成摘要时出错",
    "chinese_title": "No traffic deaths in Helsinki for a year",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44727788",
    "title": "Supervised fine tuning on curated data is reinforcement learning",
    "url": "https://arxiv.org/abs/2507.12856",
    "summary": "生成摘要时出错",
    "chinese_title": "Supervised fine tuning on curated data is reinforcement learning",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44727420",
    "title": "More honey bees dying, even as antibiotic use halves",
    "url": "https://news.uoguelph.ca/2025/07/more-honey-bees-dying-even-as-antibiotic-use-halves/",
    "summary": "生成摘要时出错",
    "chinese_title": "More honey bees dying, even as antibiotic use halves",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44725757",
    "title": "Learning basic electronics by building fireflies",
    "url": "http://a64.in/posts/learning-basic-electronics-by-building-fireflies/",
    "summary": "生成摘要时出错",
    "chinese_title": "Learning basic electronics by building fireflies",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44726838",
    "title": "Playing with Open Source LLMs",
    "url": "https://alicegg.tech//2025/07/29/open-source-llm.html",
    "summary": "生成摘要时出错",
    "chinese_title": "Playing with Open Source LLMs",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44732593",
    "title": "From XML to JSON to CBOR",
    "url": "https://cborbook.com/introduction/from_xml_to_json_to_cbor.html",
    "summary": "生成摘要时出错",
    "chinese_title": "From XML to JSON to CBOR",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44705445",
    "title": "Enough AI copilots, we need AI HUDs",
    "url": "https://www.geoffreylitt.com/2025/07/27/enough-ai-copilots-we-need-ai-huds",
    "summary": "生成摘要时出错",
    "chinese_title": "Enough AI copilots, we need AI HUDs",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44732464",
    "title": "A major AI training data set contains millions of examples of personal data",
    "url": "https://www.technologyreview.com/2025/07/18/1120466/a-major-ai-training-data-set-contains-millions-of-examples-of-personal-data/",
    "summary": "生成摘要时出错",
    "chinese_title": "A major AI training data set contains millions of examples of personal data",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44722951",
    "title": "Linux Performance Analysis (2015)",
    "url": "https://netflixtechblog.com/linux-performance-analysis-in-60-000-milliseconds-accc10403c55",
    "summary": "生成摘要时出错",
    "chinese_title": "Linux Performance Analysis (2015)",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44726672",
    "title": "Show HN: A GitHub Action that quizzes you on a pull request",
    "url": "https://github.com/dkamm/pr-quiz",
    "summary": "生成摘要时出错",
    "chinese_title": "Show HN: A GitHub Action that quizzes you on a pull request",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44724287",
    "title": "Project Zero – Policy and Disclosure: 2025 Edition",
    "url": "https://googleprojectzero.blogspot.com/2025/07/reporting-transparency.html",
    "summary": "生成摘要时出错",
    "chinese_title": "Project Zero – Policy and Disclosure: 2025 Edition",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44724842",
    "title": "The Convenience Trap: Why Seamless Banking Access Can Turn 2FA into 1FA",
    "url": "https://blog.opencore.ch/posts/the-convenience-trap-2fa/",
    "summary": "生成摘要时出错",
    "chinese_title": "The Convenience Trap: Why Seamless Banking Access Can Turn 2FA into 1FA",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44691242",
    "title": "A grand tour through the essays of Lewis H. Lapham",
    "url": "https://www.laphamsquarterly.org/roundtable/motet-record",
    "summary": "生成摘要时出错",
    "chinese_title": "A grand tour through the essays of Lewis H. Lapham",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44723098",
    "title": "Cucumber lets you write automated tests in plain language",
    "url": "https://cucumber.io/",
    "summary": "生成摘要时出错",
    "chinese_title": "Cucumber lets you write automated tests in plain language",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44727298",
    "title": "Maru OS – Use your phone as your PC",
    "url": "https://maruos.com/",
    "summary": "生成摘要时出错",
    "chinese_title": "Maru OS – Use your phone as your PC",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44726837",
    "title": "The Making of Dario Amodei",
    "url": "https://www.bigtechnology.com/p/the-making-of-dario-amodei",
    "summary": "生成摘要时出错",
    "chinese_title": "The Making of Dario Amodei",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44686624",
    "title": "Rotring 600 Ballpoint Pen",
    "url": "https://www.shellshore.com/review-rotring-600-ballpoint-pen/",
    "summary": "生成摘要时出错",
    "chinese_title": "Rotring 600 Ballpoint Pen",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44735081",
    "title": "Big Tech Killed the Golden Age of Programming",
    "url": "https://www.taylor.gl/blog/29",
    "summary": "生成摘要时出错",
    "chinese_title": "Big Tech Killed the Golden Age of Programming",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44688738",
    "title": "Tour de France confronts a new threat: Are cyclists using tiny motors?",
    "url": "https://www.washingtonpost.com/world/2025/07/25/tour-france-bikes-hidden-motors/",
    "summary": "生成摘要时出错",
    "chinese_title": "Tour de France confronts a new threat: Are cyclists using tiny motors?",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44725087",
    "title": "Microsoft Introduces 'Copilot Mode' in Edge",
    "url": "https://blogs.windows.com/msedgedev/2025/07/28/introducing-copilot-mode-in-edge-a-new-way-to-browse-the-web/",
    "summary": "生成摘要时出错",
    "chinese_title": "Microsoft Introduces 'Copilot Mode' in Edge",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44706653",
    "title": "VPN use surges in UK as new online safety rules kick in",
    "url": "https://www.ft.com/content/356674b0-9f1d-4f95-b1d5-f27570379a9b",
    "summary": "生成摘要时出错",
    "chinese_title": "VPN use surges in UK as new online safety rules kick in",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44732508",
    "title": "Less rain, more wheat: How Australian farmers defied climate doom",
    "url": "https://www.reuters.com/investigations/less-rain-more-wheat-how-australian-farmers-defied-climate-doom-2025-07-29/",
    "summary": "生成摘要时出错",
    "chinese_title": "Less rain, more wheat: How Australian farmers defied climate doom",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44721791",
    "title": "Show HN: Terminal-Bench-RL: Training long-horizon terminal agents with RL",
    "url": "https://github.com/Danau5tin/terminal-bench-rl",
    "summary": "生成摘要时出错",
    "chinese_title": "Show HN: Terminal-Bench-RL: Training long-horizon terminal agents with RL",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44689453",
    "title": "Truchet Tiles",
    "url": "https://en.wikipedia.org/wiki/Truchet_tiles",
    "summary": "生成摘要时出错",
    "chinese_title": "Truchet Tiles",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44716414",
    "title": "Show HN: Companies use AI to take your calls. I built AI to make them for you",
    "url": "https://www.pipervoice.com/",
    "summary": "生成摘要时出错",
    "chinese_title": "Show HN: Companies use AI to take your calls. I built AI to make them for you",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44736458",
    "title": "Entire Arab League condemns Oct 7, urges Hamas to disarm, at 2-state confab",
    "url": "https://www.timesofisrael.com/in-1st-entire-arab-league-condemns-oct-7-urges-hamas-to-disarm-at-2-state-solution-confab/",
    "summary": "生成摘要时出错",
    "chinese_title": "Entire Arab League condemns Oct 7, urges Hamas to disarm, at 2-state confab",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44721403",
    "title": "Wikimedia Foundation Challenges UK Online Safety Act Regulations",
    "url": "https://wikimediafoundation.org/news/2025/07/17/wikimedia-foundation-challenges-uk-online-safety-act-regulations/",
    "summary": "生成摘要时出错",
    "chinese_title": "Wikimedia Foundation Challenges UK Online Safety Act Regulations",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44732345",
    "title": "PanamaPlaylists – Leaked Tech CEOs Spotify Profiles",
    "url": "https://panamaplaylists.com/",
    "summary": "生成摘要时出错",
    "chinese_title": "PanamaPlaylists – Leaked Tech CEOs Spotify Profiles",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44701191",
    "title": "The Saltgator: A Desktop SoftGel Injection Molding Machine",
    "url": "https://www.core77.com/posts/137875/The-Saltgator-A-Desktop-SoftGel-Injection-Molding-Machine",
    "summary": "生成摘要时出错",
    "chinese_title": "The Saltgator: A Desktop SoftGel Injection Molding Machine",
    "chinese_summary": "生成摘要时出错"
  }
]