[
  {
    "id": "45222695",
    "title": "Many hard LeetCode problems are easy constraint problems",
    "url": "https://buttondown.com/hillelwayne/archive/many-hard-leetcode-problems-are-easy-constraint/",
    "summary": "This article argues that many \"hard\" LeetCode problems, often used in technical interviews, are actually easy to solve using constraint solvers like MiniZinc, Z3, or OR-Tools. The author contends that traditional programming languages are too low-level for these optimization problems (finding maximums or minimums under constraints), while constraint solvers are specifically designed for them.\n\nThe author demonstrates this with several examples, including the coin change problem, the stock trading profit maximization problem, a number-summing-to-zero problem, and the largest rectangle in a histogram problem. For each, they provide MiniZinc code snippets illustrating how the problem can be easily expressed as a constraint satisfaction or optimization problem.\n\nThe author acknowledges that constraint solvers might not be as performant as hand-crafted algorithms with optimal runtime complexity, but they are often easier to implement, particularly when new constraints are added. This is illustrated with an extended stock trading scenario with limits on sales and holdings, which would be difficult to code efficiently but requires only a small modification to the constraint problem.\n\nThe core argument is that using constraint solvers can be a powerful and efficient alternative to crafting complex algorithms for certain types of interview questions, offering a more practical approach to solving these problems. The author suggests that using LeetCode problems would be a more interesting showcase for constraint solvers than traditional puzzles.\n",
    "chinese_title": "很多困难的力扣题都是约束简单的题。",
    "chinese_summary": "本文论证了许多技术面试中常用的“困难”LeetCode题目，实际上可以使用MiniZinc、Z3或OR-Tools等约束求解器轻松解决。作者认为，传统编程语言对于这些优化问题（在约束条件下寻找最大值或最小值）来说过于底层，而约束求解器是专门为它们设计的。\n\n作者通过几个例子证明了这一点，包括硬币找零问题、股票交易利润最大化问题、数字求和为零问题以及柱状图中最大矩形问题。对于每个问题，他们都提供了MiniZinc代码片段，说明了如何将问题轻松地表达为约束满足或优化问题。\n\n作者承认，约束求解器的性能可能不如具有最佳运行时复杂度的手工算法，但它们通常更容易实现，尤其是在添加新约束时。作者用一个扩展的股票交易场景来说明这一点，该场景对销售和持有量有限制，如果用传统方式编码效率会很低，但只需对约束问题进行少量修改即可。\n\n核心论点是，对于某些类型的面试题，使用约束求解器可以成为编写复杂算法的强大而有效的替代方案，为解决这些问题提供更实际的方法。作者建议，使用LeetCode问题比传统谜题更能体现约束求解器的优势。"
  },
  {
    "id": "45222369",
    "title": "3D modeling with paper",
    "url": "https://www.arvinpoddar.com/blog/3d-modeling-with-paper",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "纸上的3D建模",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "45223419",
    "title": "Advanced Scheme Techniques (2004) [pdf]",
    "url": "https://people.csail.mit.edu//jhbrown/scheme/continuationslides04.pdf",
    "summary": "I am unable to provide a summary of the document. The text appears to be a PDF document, but the content presented is not human-readable text. Instead, it consists of encoded data, likely representing the PDF's internal structure, fonts, and other elements. To summarize the article, I would need access to the properly rendered text content of the PDF.\n",
    "chinese_title": "高级Scheme技巧 (2004) [pdf]",
    "chinese_summary": "我无法提供该文档的摘要。该文本似乎是PDF文档，但呈现的内容并非人类可读的文本，而是编码数据，可能代表PDF的内部结构、字体和其他元素。要总结这篇文章，我需要访问PDF正确呈现的文本内容。"
  },
  {
    "id": "45221274",
    "title": "The treasury is expanding the patriot act to attack Bitcoin self custody",
    "url": "https://www.tftc.io/treasury-iexpanding-patriot-act/",
    "summary": "Marty Bent argues that the US Treasury is expanding the Patriot Act to target Bitcoin self-custody, a concerning development for Bitcoin users and the broader cryptocurrency landscape. He believes this expansion represents an attack on financial freedom and privacy.\n\nThe article likely outlines how the Treasury plans to achieve this, possibly through stricter KYC/AML regulations targeting individuals or entities interacting with self-custodial wallets. This could involve requirements for exchanges to collect more data on users sending or receiving Bitcoin to/from their own wallets, effectively tracking the flow of funds and potentially flagging transactions deemed suspicious.\n\nBent likely argues that these measures would undermine Bitcoin's core principles, such as pseudonymity and decentralization, and stifle innovation in the space. He believes the ability to self-custody Bitcoin is crucial for financial sovereignty, allowing individuals to control their own assets without relying on intermediaries. The expansion of the Patriot Act, in his view, represents an attempt by the government to exert greater control over Bitcoin and limit its potential as a censorship-resistant form of money. He probably calls for resistance and highlights the importance of defending Bitcoin's principles of self-custody and privacy.\n",
    "chinese_title": "财政部正在扩大爱国者法案以打击比特币的自我托管。",
    "chinese_summary": "马蒂·本特认为，美国财政部正在扩大《爱国者法案》的适用范围，以针对比特币自托管，这对比特币用户和更广泛的加密货币领域来说是一个令人担忧的事态发展。他认为这种扩张是对金融自由和隐私的攻击。\n\n文章可能概述了财政部计划如何实现这一目标，可能通过更严格的 KYC/AML 法规来针对与自托管钱包互动的个人或实体。 这可能涉及要求交易所收集更多关于用户向自己的钱包发送或接收比特币的数据，从而有效地跟踪资金流动，并可能标记被认为可疑的交易。\n\n本特可能认为，这些措施会破坏比特币的核心原则，例如假名性和去中心化，并扼杀该领域的创新。他认为，自托管比特币的能力对于金融主权至关重要，它允许个人控制自己的资产，而无需依赖中介机构。 在他看来，《爱国者法案》的扩张代表了政府试图对比特币施加更大的控制，并限制其作为一种抗审查货币的潜力。 他可能会呼吁抵制，并强调捍卫比特币的自托管和隐私原则的重要性。"
  },
  {
    "id": "45223913",
    "title": "The rise of AI cults and the false prophets of revelation",
    "url": "https://wisewolfmedia.substack.com/p/the-rise-of-ai-cults-truth-terminal",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "人工智能邪教的兴起与启示的虚假先知",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "45175982",
    "title": "Windows-Use: an AI agent that interacts with Windows at GUI layer",
    "url": "https://github.com/CursorTouch/Windows-Use",
    "summary": "Windows-Use is an AI agent designed to automate tasks on Windows operating systems directly through the GUI, allowing Large Language Models (LLMs) to control the OS without relying on traditional computer vision. It enables actions like opening applications, clicking buttons, typing, executing shell commands, and capturing UI state.\n\nInstallation requires Python 3.12 or higher and the use of either UV or pip package managers. Basic usage involves importing the `Agent` class from the `windows_use` library, initializing it with an LLM (like Gemini via `langchain-google-genai`), and then using the `invoke` method to execute tasks based on user queries. The agent can be run directly from a Python script.\n\nThe project offers demonstrations of its capabilities, such as creating and saving notes in Word and switching between dark and light modes. The tool leverages vision capabilities to understand and interact with the Windows environment.\n\nA caution is issued regarding the agent's potential to cause unintended system behavior due to its direct interaction with the GUI, recommending use in a sandboxed environment. The project is open-source, licensed under the MIT License, and welcomes contributions following the guidelines in the CONTRIBUTING file. It was created by Jeomon George.\n",
    "chinese_title": "Windows 使用：一个在 GUI 层与 Windows 交互的 AI 代理",
    "chinese_summary": "Windows-Use是一个旨在直接通过GUI自动化Windows操作系统任务的AI代理，使大型语言模型（LLM）能够控制操作系统，而无需依赖传统的计算机视觉。它能够执行诸如打开应用程序、点击按钮、键入、执行shell命令和捕获UI状态等操作。\n\n安装需要Python 3.12或更高版本，并使用UV或pip包管理器。基本用法包括从`windows_use`库导入`Agent`类，使用LLM（例如通过`langchain-google-genai`的Gemini）初始化它，然后使用`invoke`方法根据用户查询执行任务。该代理可以直接从Python脚本运行。\n\n该项目展示了其功能，例如在Word中创建和保存笔记以及在暗黑和浅色模式之间切换。该工具利用视觉能力来理解Windows环境并与之交互。\n\n由于该代理直接与GUI交互，因此发出警告，提醒其可能导致意外的系统行为，建议在沙盒环境中进行使用。该项目是开源的，采用MIT许可证，并欢迎遵循CONTRIBUTING文件中指南的贡献。它由Jeomon George创建。"
  },
  {
    "id": "45219228",
    "title": "Qwen3-Next",
    "url": "https://qwen.ai/blog?id=4074cca80393150c248e508aa62983f9cb7d27cd&from=research.latest-advancements-list",
    "summary": "The article is extremely short and only consists of the title \"Qwen3-Next\" and the single word \"Qwen\" in the content. Therefore, it's impossible to provide a substantial summary.\n\n**Essentially, the article provides the following information:**\n\n*   **Title:** Qwen3-Next\n*   **Content:** Refers to \"Qwen\"\n\n**Possible Interpretations:**\n\nBased on this limited information, one can only speculate that \"Qwen3-Next\" likely refers to a future version or iteration (\"Next\") of a model or technology known as \"Qwen.\" Without further context, it's impossible to determine what \"Qwen\" actually is (e.g., a large language model, a company, a product) or what improvements \"Qwen3-Next\" is expected to bring.\n",
    "chinese_title": "通义千问3-Next",
    "chinese_summary": "文章极其简短，仅包含标题“Qwen3-Next”和正文中的一个词“Qwen”，因此无法提供实质性摘要。\n\n**本质上，文章提供以下信息：**\n\n*   **标题：**Qwen3-Next\n*   **内容：** 指“Qwen”\n\n**可能的解读：**\n\n基于此有限的信息，只能推测“Qwen3-Next”可能指的是名为“Qwen”的模型或技术的未来版本或迭代（“Next”）。在没有更多上下文的情况下，无法确定“Qwen”实际上是什么（例如，大型语言模型、公司、产品），也无法确定“Qwen3-Next”有望带来哪些改进。"
  },
  {
    "id": "45223239",
    "title": "A beginner's guide to extending Emacs",
    "url": "https://blog.tjll.net/a-beginners-guide-to-extending-emacs/",
    "summary": "This article provides a beginner's guide to extending Emacs, specifically focusing on adding auto-completion for reStructuredText references. It emphasizes Emacs' extensibility and the importance of leveraging existing functions and documentation.\n\nThe author walks through the process of creating a custom completion backend for reStructuredText references, starting with identifying the relevant Emacs completion system (completion-at-point-functions). The guide explains how to define a custom \"thing\" using `define-thing-chars` and `bounds-of-thing-at-point` to identify the text to be replaced by completion.\n\nIt then delves into regular expressions, showcasing Emacs' interactive re-builder tool and the `rx` macro for easier regex creation. The article demonstrates how to develop a regex to locate reStructuredText reference definitions in a document.\n\nThe summary stresses the importance of experimentation, utilizing built-in Emacs functions, and examining existing code for guidance. It also aims to alleviate the intimidation often associated with learning Emacs Lisp, offering basic Lisp principles and practical examples throughout the process. The ultimate goal is to empower users to customize Emacs to fit their specific needs, even without extensive Emacs Lisp knowledge.\n",
    "chinese_title": "Emacs扩展入门指南",
    "chinese_summary": "本文为Emacs扩展入门指南，重点介绍如何为reStructuredText引用添加自动补全功能。文章强调了Emacs的可扩展性以及利用现有函数和文档的重要性。\n\n作者逐步介绍了创建reStructuredText引用自定义补全后端的过程，首先确定相关的Emacs补全系统（completion-at-point-functions）。该指南解释了如何使用`define-thing-chars`和`bounds-of-thing-at-point`定义自定义的“thing”，以识别将被补全替换的文本。\n\n随后，文章深入探讨了正则表达式，展示了Emacs的交互式正则表达式构建工具以及用于简化正则表达式创建的`rx`宏。文章演示了如何开发正则表达式来定位文档中的reStructuredText引用定义。\n\n总结强调了实验、利用内置Emacs函数以及检查现有代码以获得指导的重要性。本文还旨在减轻学习Emacs Lisp时常有的畏惧感，在整个过程中提供基本的Lisp原理和实践示例。最终目标是使用户能够自定义Emacs以适应其特定需求，即使没有广泛的Emacs Lisp知识。"
  },
  {
    "id": "45222799",
    "title": "Oq: Terminal OpenAPI Spec Viewer",
    "url": "https://github.com/plutov/oq",
    "summary": "`oq` is a terminal-based viewer for OpenAPI specifications (OAS) in YAML or JSON format, supporting both OpenAPI 3.0.x and 3.1.x versions. It allows users to easily navigate and explore API definitions directly from the command line.\n\nUsers can provide the OAS file as an argument (e.g., `oq openapi.yaml`), pipe the content from a file (e.g., `cat openapi.yaml | oq`), or stream it from a URL (e.g., `curl https://api.example.com/openapi.json | oq`).\n\nKey features include:\n\n*   **Navigation:** Up/Down arrows or `k`/`j` keys for moving through items.\n*   **Views:** Tab key to switch between Endpoints and Components views.\n*   **Folding/Unfolding:** Enter or Space key to expand/collapse details.\n*   **Quitting:** `q` or `Ctrl+C` to exit.\n\nThe project is open-source under the MIT License, and contributions are encouraged via issues and pull requests. When contributing, ensure tests pass and test with both OpenAPI 3.0 and 3.1 examples.\n",
    "chinese_title": "Oq：终端 OpenAPI 规范查看器",
    "chinese_summary": "`oq` 是一款基于终端的 OpenAPI 规范 (OAS) 查看器，支持 YAML 或 JSON 格式，以及 OpenAPI 3.0.x 和 3.1.x 版本。它允许用户直接从命令行轻松导航和浏览 API 定义。\n\n用户可以提供 OAS 文件作为参数（例如，`oq openapi.yaml`），从文件管道传输内容（例如，`cat openapi.yaml | oq`），或从 URL 流式传输（例如，`curl https://api.example.com/openapi.json | oq`）。\n\n主要功能包括：\n\n*   **导航：** 使用向上/向下箭头或 `k`/`j` 键移动项目。\n*   **视图：** 使用 Tab 键在端点和组件视图之间切换。\n*   **折叠/展开：** 使用 Enter 或 Space 键展开/折叠详细信息。\n*   **退出：** 使用 `q` 或 `Ctrl+C` 退出。\n\n该项目在 MIT 许可证下开源，并鼓励通过问题和拉取请求进行贡献。 贡献时，请确保测试通过，并使用 OpenAPI 3.0 和 3.1 示例进行测试。"
  },
  {
    "id": "45222993",
    "title": "Doom-ada: Doom Emacs Ada language module with syntax, LSP and Alire support",
    "url": "https://github.com/tomekw/doom-ada",
    "summary": "This document describes the Doom Emacs module for Ada language support, named \"Doom-ada.\" It provides syntax highlighting using Tree-sitter, LSP support via `ada_language_server`, autocomplete functionality, and integrates with the Alire build system.\n\nKey features include:\n\n*   **Syntax Highlighting:** Uses `ada-ts-mode` for accurate and efficient syntax highlighting.\n*   **LSP Support:** Leverages `ada_language_server` for language server features like inline diagnostics and completions through Eglot.\n*   **Autocomplete:** Enables autocomplete functionality using `company-capf`.\n*   **Alire Integration:** Offers keybindings (`SPC m b`, `SPC m r`, `SPC m c`) for Alire commands such as build, run, and clean. Compilation errors are parsed into the compilation buffer.\n\nTo install the module, users clone the repository into their Doom Emacs modules folder, enable the `ada` module in their `init.el` file, sync Doom, and restart Emacs. Alire and the Ada Language Server are required for the module to function correctly.\n",
    "chinese_title": "Doom-ada：具有语法、LSP和Alire支持的Doom Emacs Ada语言模块",
    "chinese_summary": "本文档描述了用于 Ada 语言支持的 Doom Emacs 模块，名为“Doom-ada”。它使用 Tree-sitter 提供语法高亮，通过 `ada_language_server` 提供 LSP 支持，具有自动补全功能，并与 Alire 构建系统集成。\n\n主要功能包括：\n\n*   **语法高亮：** 使用 `ada-ts-mode` 进行准确高效的语法高亮。\n*   **LSP 支持：** 利用 `ada_language_server` 通过 Eglot 提供语言服务器功能，如内联诊断和补全。\n*   **自动补全：** 使用 `company-capf` 启用自动补全功能。\n*   **Alire 集成：** 提供 Alire 命令（如构建、运行和清理）的快捷键（`SPC m b`，`SPC m r`，`SPC m c`）。编译错误会被解析到编译缓冲区中。\n\n要安装此模块，用户需要将存储库克隆到他们的 Doom Emacs 模块文件夹中，在其 `init.el` 文件中启用 `ada` 模块，同步 Doom，然后重新启动 Emacs。 该模块要正常运行，需要 Alire 和 Ada 语言服务器。"
  },
  {
    "id": "45223053",
    "title": "Show HN: DWS OS, a Plan 9 Inspired Web \"OS\"",
    "url": "https://dws.rip",
    "summary": "The \"Show HN\" post introduces DWS OS, described as a Plan 9-inspired web \"OS\". This suggests that it's a web-based operating system mimicking the design principles and functionality of Plan 9 from Bell Labs. Given that Plan 9 is known for its file-centric approach, distributed computing, and namespace virtualization, DWS OS likely attempts to replicate these concepts within a web browser environment.\n\nThe post itself is extremely brief, offering little concrete information about the specific features, implementation, or purpose of DWS OS. However, the \"Show HN\" tag implies the author is seeking feedback from the Hacker News community on their project. Therefore, potential users would likely need to explore the project further (likely through a linked website or repository, not included in this text) to understand its capabilities and potential applications. Key questions that remain unanswered include: How does it emulate Plan 9's file system? What languages is it built with? What are its intended use cases? The focus of the post is simply to announce the existence of DWS OS and pique the reader's interest.\n",
    "chinese_title": "展示 HN：DWS OS，一个受 Plan 9 启发的 Web “操作系统”",
    "chinese_summary": "“Show HN”帖子介绍了 DWS OS，称其为受 Plan 9 启发的 Web “操作系统”。这表明它是一个基于 Web 的操作系统，模仿了贝尔实验室 Plan 9 的设计原则和功能。鉴于 Plan 9 以其以文件为中心的理念、分布式计算和命名空间虚拟化而闻名，DWS OS 很可能试图在 Web 浏览器环境中复制这些概念。\n\n该帖子本身非常简短，几乎没有提供关于 DWS OS 的具体功能、实现或用途的明确信息。“Show HN”标签表明作者正在寻求 Hacker News 社区对其项目的反馈。因此，潜在用户可能需要进一步探索该项目（可能通过链接的网站或存储库，未包含在本文中）以了解其功能和潜在应用。仍未解答的关键问题包括：它如何模拟 Plan 9 的文件系统？它使用什么语言构建？它的预期用例是什么？ 该帖子的重点仅仅是宣布 DWS OS 的存在并激起读者的兴趣。"
  },
  {
    "id": "45199256",
    "title": "Building a Deep Research Agent Using MCP-Agent",
    "url": "https://thealliance.ai/blog/building-a-deep-research-agent-using-mcp-agent",
    "summary": "Sarmad Qadri details his journey building a deep research agent powered by MCP (Model Control Plane) servers, emphasizing the philosophy that connecting LLMs to MCP and using simple design patterns is sufficient for complex tasks. He recounts three iterations:\n\n**Take 1: Orchestrator** - Based on Anthropic's pattern, using planning, execution, and synthesis layers. It worked for tasks with upfront plans but struggled with hallucination, token inefficiency, and fixed planning.\n\n**Take 2: Adaptive Workflow** - Aimed to improve on Take 1 with dynamic subagents, FIFO TODO queue, external memory, budget management, and a \"beast mode.\" However, it performed poorly in real-world scenarios due to navigation problems, performance issues, and complexity overhead.\n\n**Take 3: Deep Orchestrator** - The successful iteration. It combined the simplicity of the original Orchestrator with lessons from the Adaptive Workflow. Key features include:\n*   Initial full plan generation with a TODO queue.\n*   Memory and knowledge extraction with task dependency specifications.\n*   Deterministic plan verification (dependency, server, and agent validation) before execution.\n*   Prompt engineering using XML tags.\n*   A simple policy engine for decision-making (continue, replan, stop, or force completion).\n\nKey learnings: Simple architecture is superior, MCP is sufficient for diverse tasks, and small details significantly impact agent performance. Future plans involve remote execution via MCP, intelligent tool selection, representing memory as MCP resources, and dynamic model selection.\n",
    "chinese_title": "使用MCP-Agent构建深度研究智能体",
    "chinese_summary": "萨尔马德·卡德里详述了他构建一个由MCP（模型控制平面）服务器驱动的深度研究代理的历程，强调了将LLM连接到MCP并使用简单设计模式足以完成复杂任务的理念。他回顾了三个迭代版本：\n\n**第一版：编排器** - 基于Anthropic的模式，使用规划、执行和合成层。它适用于具有前期计划的任务，但在幻觉、token效率低下和固定计划方面表现不佳。\n\n**第二版：自适应工作流** - 旨在改进第一版，具有动态子代理、FIFO TODO队列、外部记忆、预算管理和“野兽模式”。 然而，由于导航问题、性能问题和复杂性开销，它在实际场景中表现不佳。\n\n**第三版：深度编排器** - 成功的迭代版本。它结合了原始编排器的简单性和自适应工作流的经验。 主要功能包括：\n*   使用TODO队列进行初始完整计划生成。\n*   通过任务依赖规范进行记忆和知识提取。\n*   执行前的确定性计划验证（依赖性、服务器和代理验证）。\n*   使用XML标签的Prompt工程。\n*   用于决策（继续、重新计划、停止或强制完成）的简单策略引擎。\n\n主要经验：简单的架构更优越，MCP足以完成各种任务，并且小细节会显著影响代理的性能。 未来计划包括通过MCP进行远程执行、智能工具选择、将记忆表示为MCP资源以及动态模型选择。"
  },
  {
    "id": "45221580",
    "title": "Chat Control faces blocking minority in the EU",
    "url": "https://twitter.com/TutaPrivacy/status/1966384776883142661",
    "summary": "The provided content doesn't actually contain an article. It appears to be a snippet from X (formerly Twitter) indicating that JavaScript is disabled, preventing the user from accessing the site's content. There's no information about \"Chat Control facing blocking minority in the EU\" within the snippet. Therefore, I cannot provide a summary of that supposed article. The snippet only conveys a technical issue preventing access to X.\n",
    "chinese_title": "欧盟聊天控制面临少数派阻挠",
    "chinese_summary": "提供的内容实际上并不包含文章。它看起来像是X（前身为Twitter）的一个片段，表明JavaScript已被禁用，阻止用户访问该网站的内容。该片段中没有关于“欧盟中聊天控制面临少数人反对”的信息。因此，我无法提供关于该假设文章的摘要。该片段仅传达了一个阻止访问X的技术问题。"
  },
  {
    "id": "45175439",
    "title": "I don't like curved displays",
    "url": "https://blog.danielh.cc/blog/curved",
    "summary": "This article expresses a dislike for curved displays, arguing they distort the intended viewing experience of most media. The author's primary reasoning centers around the prevalence of rectilinear lenses in media creation. These lenses project straight lines from a 3D scene onto a flat, 2D plane. Viewing this image on a flat screen preserves the original straight lines and accurately recreates the intended perspective.\n\nHowever, according to the author, a curved screen introduces distortion. Straight lines, which were faithfully reproduced on a flat surface based on rectilinear principles, are no longer straight when displayed on a curved surface. This deviation alters the intended perspective and ultimately detracts from the viewing experience. Therefore, the author prefers flat displays because they accurately represent the straight lines projected by rectilinear lenses, resulting in a viewing experience more faithful to the original image capture.\n",
    "chinese_title": "我不喜欢曲面屏。",
    "chinese_summary": "本文表达了对曲面屏幕的厌恶，认为它们扭曲了大多数媒体的预期观看体验。作者的主要理由围绕着媒体创作中直线透镜的普遍使用。这些透镜将 3D 场景中的直线投影到平坦的 2D 平面上。在平面屏幕上观看此图像可以保留原始直线，并准确地再现预期的视角。\n\n然而，根据作者的说法，曲面屏幕会引入失真。根据直线原理在平面上忠实再现的直线，在曲面上显示时不再是直线。这种偏差改变了预期的视角，最终降低了观看体验。因此，作者更喜欢平面屏幕，因为它们能准确地呈现直线透镜投射的直线，从而带来更忠实于原始图像捕捉的观看体验。"
  },
  {
    "id": "45174366",
    "title": "Racintosh Plus – Rackmount Mac Plus",
    "url": "http://www.identity4.com/2025-racintosh-plus/",
    "summary": "The \"Racintosh Plus\" project is a custom rack-mounted version of a 1986 Macintosh Plus, designed to fit neatly into a music studio rack. The creator aimed to address the original computer's bulkiness, age, heat generation, and potential component failure.\n\nThe project involved transplanting the logic board of a spare Macintosh Plus into a 1U rack chassis. Key modifications included soldering wires directly to the logic board to reduce height, using an RGBtoHDMI converter with a Raspberry Pi Zero for modern display output, and employing a BlueSCSI V2 for internal hard drive emulation with a 2GB system drive and a 512MB utilities drive. A Floppy Emu handles floppy disk emulation via microSD card, with the display and controls accessible on the front panel. Other features include a battery replacement kit for the CMOS battery and a new speaker.\n\nThe original analog board and CRT were removed and replaced with a Mean Well RT-65B power supply. A 3D model of the rack chassis and components was created in Sketchup to plan the layout and mounting. The chassis was manually modified with a Dremel tool, and custom mounting hardware was 3D printed. Front and back panels were originally intended to be laser etched, but decals were used instead due to etching issues.\n\nThe Racintosh Plus runs System 7.1 from a SCSI drive image, and a virtual machine running Mini VMac was used for software testing and image creation. The BlueSCSI provides Wi-Fi connectivity (though signal strength is limited), and a DateFix patch was used to correct a year 2020 date bug. The project demonstrates a creative blend of vintage computing and modern technology.\n",
    "chinese_title": "Racintosh Plus – 机架式 Mac Plus",
    "chinese_summary": "“Racintosh Plus”项目是将1986年 Macintosh Plus 定制成机架式版本，旨在完美融入音乐工作室机架。 创作者的目标是解决原电脑的笨重、老化、发热以及潜在的组件故障问题。\n\n该项目涉及将备用 Macintosh Plus 的逻辑板移植到 1U 机架机箱中。 主要修改包括将电线直接焊接到逻辑板上以降低高度，使用带 Raspberry Pi Zero 的 RGBtoHDMI 转换器以实现现代显示输出，以及采用 BlueSCSI V2 进行内部硬盘驱动器模拟，配置了 2GB 系统驱动器和 512MB 实用程序驱动器。 Floppy Emu 通过 microSD 卡处理软盘模拟，显示器和控制装置位于前面板上。 其他功能包括 CMOS 电池的电池更换套件和一个新的扬声器。\n\n原有的模拟板和 CRT 被移除，并替换为 Mean Well RT-65B 电源。 在 Sketchup 中创建了机架机箱和组件的 3D 模型，以规划布局和安装。 使用 Dremel 工具手动修改了机箱，并 3D 打印了定制的安装硬件。 前面板和后面板最初计划进行激光蚀刻，但由于蚀刻问题，改为使用贴花。\n\nRacintosh Plus 从 SCSI 驱动器映像运行 System 7.1，并使用运行 Mini VMac 的虚拟机进行软件测试和映像创建。 BlueSCSI 提供 Wi-Fi 连接（虽然信号强度有限），并使用 DateFix 补丁来纠正 2020 年的日期错误。 该项目展示了复古计算和现代技术的创造性融合。"
  },
  {
    "id": "45175099",
    "title": "Ten Years of D3D12",
    "url": "https://therealmjp.github.io/posts/ten-years-of-d3d12/",
    "summary": "This article celebrates the 10th anniversary of Direct3D 12 (D3D12), highlighting its continuous evolution with new interfaces, functions, and shader models despite not having a major version update. It then delves into specific additions to the core D3D12 API over the past decade.\n\nKey features discussed include:\n\n*   **Programmable Sample Points:** Enables custom MSAA subsample positions, useful for niche cases like software VRS.\n*   **View Instancing:** Designed for stereo rendering in VR, allowing shaders to apply view-specific matrices but potentially outperformed by manual instancing.\n*   **Depth Bounds Test:** An older feature enabling depth testing within specified bounds, potentially useful for deferred rendering or shadow techniques.\n*   **Variable Rate Shading (VRS):** Reduces pixel shader workload by varying shading rates per draw, primitive, or tile. However, performance gains may be limited, and spatial filtering/temporal reconstruction may be needed.\n*   **Relaxed Format Casting:** Simplifies resource view creation by relaxing format compatibility rules, improving driver optimizations.\n*   **Direct Writes to Block-Compressed Formats:** Allows direct GPU writes to BC textures, eliminating the need for intermediary copies.\n*   **Writable R9G9B9E5 Textures:** Enables GPU writes to this shared-exponent RGB format, potentially offering better precision.\n*   **WriteBufferImmediate and OpenExistingHeapFromAddress:** APIs that support GPU debugging by inserting \"breadcrumbs\" into the command list.\n*   **GPU Upload Heaps:** Allow direct CPU access to VRAM resources, streamlining data updates, but only available on Windows 11 with ReBAR enabled.\n*   **ExecuteIndirect Incrementing Constant:** Provides an implicit constant buffer value that increments for each draw/dispatch, approximating a \"DrawID\".\n*   **Sampler Feedback:** Provides information about accessed texels, useful for sparse virtual textures but with a complex API.\n",
    "chinese_title": "D3D12十年",
    "chinese_summary": "本文庆祝 Direct3D 12 (D3D12) 十周年，重点介绍其持续发展，尽管没有重大版本更新，但仍不断推出新的接口、功能和着色器模型。然后深入探讨过去十年中对核心 D3D12 API 的具体补充。\n\n讨论的关键特性包括：\n\n*   **可编程采样点：** 允许自定义 MSAA 子采样位置，适用于软件 VRS 等特定情况。\n*   **视图实例化：** 专为 VR 中的立体渲染设计，允许着色器应用特定于视图的矩阵，但可能不如手动实例化。\n*   **深度边界测试：** 一项较早的功能，允许在指定边界内进行深度测试，可能适用于延迟渲染或阴影技术。\n*   **可变速率着色 (VRS)：** 通过改变每次绘制、图元或图块的着色率来减少像素着色器的工作负载。但是，性能提升可能有限，并且可能需要空间过滤/时间重建。\n*   **放宽格式转换：** 通过放宽格式兼容性规则来简化资源视图的创建，从而改进驱动程序优化。\n*   **直接写入块压缩格式：** 允许 GPU 直接写入 BC 纹理，无需中间副本。\n*   **可写 R9G9B9E5 纹理：** 允许 GPU 写入此共享指数 RGB 格式，可能提供更好的精度。\n*   **WriteBufferImmediate 和 OpenExistingHeapFromAddress：** API 通过在命令列表中插入“面包屑”来支持 GPU 调试。\n*   **GPU 上传堆：** 允许 CPU 直接访问 VRAM 资源，从而简化数据更新，但仅在启用 ReBAR 的 Windows 11 上可用。\n*   **ExecuteIndirect 递增常量：** 提供一个隐式常量缓冲区值，每次绘制/调度都会递增，近似于“DrawID”。\n*   **采样器反馈：** 提供有关访问的纹素的信息，适用于稀疏虚拟纹理，但 API 复杂。"
  },
  {
    "id": "45223603",
    "title": "Ankit Gupta Joins YC as General Partner",
    "url": "https://www.ycombinator.com/blog/welcome-ankit/",
    "summary": "Y Combinator (YC) has announced Ankit Gupta as their newest General Partner. Gupta brings a combination of deep machine learning expertise and startup experience, making him well-suited to mentor founders working on AI innovations. He will be based primarily in Cambridge, Massachusetts, re-establishing a YC presence in the area.\n\nGupta's connection with YC began in the Winter 2018 batch as a co-founder of Reverie Labs, a biotech company that utilized machine learning for drug discovery. Reverie developed machine learning models for small-molecule design, partnered with pharmaceutical companies, and created their own medicines before being acquired by Ginkgo Bioworks in 2024. Prior to Reverie, Gupta studied Computer Science at Harvard, earning a B.A. and M.S., and published research on deep learning.\n\nYC President & CEO Garry Tan highlights Gupta's rare blend of research and founder experience as a key asset that will help future AI startups achieve success. YC is excited to welcome him and confident that his expertise will provide valuable support to YC founders at all stages of their journey.\n",
    "chinese_title": "Ankit Gupta 加入 YC 担任普通合伙人",
    "chinese_summary": "Y Combinator (YC) 宣布 Ankit Gupta 成为其最新普通合伙人。Gupta 兼具深厚的机器学习专业知识和创业经验，非常适合指导致力于人工智能创新的创始人。他将主要在马萨诸塞州剑桥市办公，重新建立 YC 在该地区的存在。\n\nGupta 与 YC 的联系始于 2018 年冬季，当时他是 Reverie Labs 的联合创始人，Reverie Labs 是一家利用机器学习进行药物发现的生物技术公司。Reverie 开发了用于小分子设计的机器学习模型，与制药公司合作，并在 2024 年被 Ginkgo Bioworks 收购之前，创建了自己的药物。在 Reverie 之前，Gupta 在哈佛大学学习计算机科学，获得了学士和硕士学位，并发表了关于深度学习的研究。\n\nYC 总裁兼首席执行官 Garry Tan 强调，Gupta 集研究和创始人经验于一身，这是一种罕见的优势，将帮助未来的 AI 初创公司取得成功。YC 很高兴欢迎他，并相信他的专业知识将为 YC 创始人旅程的各个阶段提供宝贵的支持。"
  },
  {
    "id": "45222772",
    "title": "Crates.io phishing attempt",
    "url": "https://fasterthanli.me/articles/crates-io-phishing-attempt",
    "summary": "This article reports a phishing attempt targeting crates.io, the primary public repository for Rust packages (crates). The attack involves phishing emails disguised as legitimate communications, directing maintainers to a fake GitHub login page, likely to steal credentials. The issue is under discussion on GitHub, and the crates.io team is aware of the attack and investigating possible countermeasures. As of September 12, 2025, no compromised packages have been identified. The article includes links to the Rust Security Response WG blog post and the GitHub discussion for further information. The author also included another article called \"Futures Nostalgia\" where he describes how he liked the Rust HTTP framework called hyper.\n",
    "chinese_title": "Crates.io 网络钓鱼尝试",
    "chinese_summary": "针对 crates.io 的网络钓鱼攻击报告"
  },
  {
    "id": "45217269",
    "title": "Why our website looks like an operating system",
    "url": "https://posthog.com/blog/why-os",
    "summary": "Cory Watilo discusses the redesign of PostHog.com, explaining its unusual operating system-like interface. Frustrated with the typical tab explosion and scrolling-heavy designs of many websites, he sought a more efficient and engaging way for users to consume content. The new PostHog.com allows multitasking with multiple articles, demo videos, and even games accessible simultaneously.\n\nThe redesign includes familiar OS elements like window snapping, keyboard shortcuts, a Windows File Explorer-inspired merch store, PowerPoint-style product pages, a document editor, Outlook Express-themed forums, a QuickTime clone, spreadsheet-formatted pages, screensavers, and desktop backgrounds.\n\nWatilo highlights the technical aspects of the project, including the separation of visual layer from content, with product pages powered by JSON files that dictate layout, content, competitor comparisons, and screenshots. This will eventually be connected to the PostHog app for a unified data source. He also discusses managing themes and color schemes for light and dark modes.\n\nA reference customer database was created, linking customers to products, quotes, and logos for dynamic presentation across the site. Watilo prototyped directly within the production environment using Typescript and Tailwind, facilitating iterative development. He concludes by acknowledging the MVP nature of the redesign and invites users to explore the new PostHog.com.\n",
    "chinese_title": "为什么我们的网站看起来像操作系统",
    "chinese_summary": "Cory Watilo 探讨了 PostHog.com 的重新设计，并解释了其不寻常的操作系统式界面。他对许多网站典型的标签页爆炸和重度滚动设计感到沮丧，因此寻求一种更高效、更具吸引力的方式让用户消费内容。新的 PostHog.com 允许同时处理多个文章、演示视频，甚至可以同时访问游戏，实现多任务处理。\n\n重新设计包含了熟悉的操作系统元素，如窗口对齐、键盘快捷键、受 Windows 文件资源管理器启发的周边商店、PowerPoint 风格的产品页面、文档编辑器、Outlook Express 主题的论坛、QuickTime 克隆、电子表格格式的页面、屏幕保护程序和桌面背景。\n\nWatilo 强调了该项目的技术方面，包括将视觉层与内容分离，产品页面由 JSON 文件驱动，这些文件决定布局、内容、竞争对手比较和屏幕截图。最终，这将连接到 PostHog 应用程序，以实现统一的数据源。他还讨论了管理浅色和深色模式的主题和配色方案。\n\n创建了一个参考客户数据库，将客户与产品、报价和徽标联系起来，以便在整个网站上进行动态展示。 Watilo 使用 Typescript 和 Tailwind 直接在生产环境中进行原型设计，从而促进了迭代开发。他最后承认重新设计的 MVP 性质，并邀请用户探索新的 PostHog.com。"
  },
  {
    "id": "45221996",
    "title": "Over 100 ships have sailed with fake insurance from the Norwegian Ro Marine",
    "url": "https://www.nrk.no/vestland/xl/over-100-ships-have-sailed-without-legitimate-insurance-from-the-norwegian-company-ro-marine-1.17565216",
    "summary": "A Norwegian company, Ro Marine, has been exposed for providing fake insurance to over 100 ships, primarily those transporting goods, including Russian oil and weapons, out of Russia. This fraudulent activity allowed these ships to circumvent Western sanctions and operate more freely. The scheme involved forged documents, including references and approvals from flag states like Panama and the Norwegian Financial Supervisory Authority.\n\nThe investigation, conducted by NRK and Dossier Center, revealed that Ro Marine was effectively aiding Russia's efforts to maintain oil exports, crucial for funding the war in Ukraine. Sanctions expert David Tannenbaum characterized Ro Marine as being \"among the worst of the worst\" for serving the \"shadow fleet\" involved in illegal activities and sanctions evasion. Vessels linked to sanctioned entities, including the Russian gas giant Novatek and the Iranian oil industry, were among Ro Marine's clients.\n\nThe mastermind behind the scam is Andrey Mochalin, a Russian citizen with prior experience working for a legitimate Norwegian insurance company. He, along with two Norwegians and a Bulgarian, have been charged with forgery and operating an illegal insurance business. The investigation uncovered a money trail leading to Mochalin's company in St. Petersburg. While Ro Marine has been forcibly dissolved in Norway and sanctioned by the UK, the St. Petersburg company remains active, and fake insurance certificates continue to surface.\n",
    "chinese_title": "超过100艘船舶使用挪威Ro Marine的假保险航行。",
    "chinese_summary": "挪威公司Ro Marine被曝光向100多艘船只提供虚假保险，这些船只主要运送货物，包括俄罗斯石油和武器出境。这种欺诈行为使这些船只能够规避西方制裁，更自由地运营。该计划涉及伪造文件，包括来自巴拿马和挪威金融监管局等船旗国的参考资料和批准。\n\n挪威广播公司（NRK）和文件中心（Dossier Center）进行的调查显示，Ro Marine实际上是在帮助俄罗斯维持石油出口，这对于资助乌克兰战争至关重要。制裁专家大卫·坦南鲍姆（David Tannenbaum）将Ro Marine 描述为服务于从事非法活动和逃避制裁的“影子舰队”的“最坏中的最坏”。与受制裁实体有关的船只，包括俄罗斯天然气巨头诺瓦泰克（Novatek）和伊朗石油工业，都是Ro Marine的客户。\n\n该骗局的幕后主使是安德烈·莫恰林（Andrey Mochalin），一位俄罗斯公民，此前曾在一家合法的挪威保险公司工作。他与两名挪威人和一名保加利亚人一起，被指控犯有伪造罪和经营非法保险业务罪。调查发现了一条通往莫恰林在圣彼得堡的公司的资金线索。虽然Ro Marine 已在挪威被强制解散并受到英国的制裁，但圣彼得堡公司仍然活跃，并且虚假保险证书继续出现。"
  },
  {
    "id": "45217415",
    "title": "Float Exposed",
    "url": "https://float.exposed/",
    "summary": "The article \"Float Exposed\" by Bartosz Ciechanowski explores the intricacies of floating-point numbers (floats) and related data types like half-floats, bfloats, and doubles. It visually presents and explains the structure of these data types, likely focusing on how values are represented through bit patterns within the significand-exponent range.\n\nThe article likely explains how these bit patterns translate into numerical values using a base-2 (binary) evaluation, and then demonstrates how that binary representation equates to a base-10 (decimal) value. The purpose is to visualize the often-opaque relationship between the underlying bit representation and the final, understandable number.\n\nFurthermore, \"Float Exposed\" probably examines the limitations of floating-point representation, specifically the concept of precision. It highlights the difference between the \"Exact Base-10 Value\" and a represented value, likely demonstrating potential rounding errors. This is further emphasized through the \"Delta to Next/Previous Representable Value,\" which illustrates the granularity and spacing of representable numbers around a given value, showcasing the imprecision inherent in floating-point arithmetic.\n\nIn essence, the article serves as an interactive and educational tool to deconstruct the internal workings of floating-point numbers, making the abstract concepts of bit patterns, significands, exponents, and their impact on precision more accessible and understandable.\n",
    "chinese_title": "浮点数漏洞",
    "chinese_summary": "Bartosz Ciechanowski 的文章《浮点数揭秘》探讨了浮点数 (float) 以及半精度浮点数 (half-float)、Bfloat 和双精度浮点数 (double) 等相关数据类型的复杂性。它以可视化的方式呈现并解释了这些数据类型的结构，可能侧重于如何通过尾数-指数范围内的位模式来表示值。\n\n这篇文章可能解释了这些位模式如何使用以 2 为基数（二进制）的评估转化为数值，然后演示了该二进制表示如何等同于以 10 为基数（十进制）的值。其目的是可视化底层位表示与最终可理解的数字之间通常不透明的关系。\n\n此外，《浮点数揭秘》可能还考察了浮点数表示的局限性，特别是精度的概念。它强调了“精确的十进制值”与表示值之间的差异，可能演示了潜在的舍入误差。通过“到下一个/上一个可表示值的差值”进一步强调了这一点，它说明了围绕给定值的可表示数字的粒度和间距，展示了浮点运算中固有的不精确性。\n\n本质上，这篇文章作为一个互动和教育工具，解构了浮点数的内部工作原理，使位模式、尾数、指数及其对精度的影响等抽象概念更易于理解和掌握。"
  },
  {
    "id": "45220843",
    "title": "Astrophysics Source Code Library",
    "url": "http://ascl.net/",
    "summary": "The Astrophysics Source Code Library (ASCL.net) is a free, online registry and repository for astrophysics source code used in peer-reviewed research. It indexes codes and provides unique, citable IDs that link to code entries.\n\nRecent additions to the library include:\n\n*   **adstex:** Automatically builds bibliography files from TeX source by fetching reference info from NASA's Astrophysics Data System (ADS).\n*   **IAR\\_Model:** Python and R functions that fit unequally spaced time series from the Irregular Autoregressive (IAR) model.\n*   **fm4ar:** Infers atmospheric properties of exoplanets from spectra using flow matching posterior estimation.\n*   **AGNI:** Simulates atmospheric structures of rocky exoplanets with magma oceans, ensuring radiative-convective equilibrium.\n*   **FiCUS:** Fits the stellar continuum of extragalactic ultraviolet (UV) spectra to estimate galaxy properties.\n*   **pyStarburst99:** A Python version of the Starburst99 population synthesis code.\n*   **SIGWAY:** Computes second-order, scalar induced gravitational wave signals emitted by curvature perturbations in the early universe.\n*   **sMV:** Provides a workflow for serial MultiView phase plane estimation.\n*   **DeepSSM:** Emulates gravitational wave (GW) spectra using neural networks.\n*   **HipFT:** Implements advection, diffusion, and data assimilation on the solar surface and forms the computational core of the Open-source Flux Transport (OFT) software suite.",
    "chinese_title": "天体物理源代码库",
    "chinese_summary": "天体物理源代码库 (ASCL.net) 是一个免费的在线注册库和存储库，用于存储同行评审研究中使用的天体物理源代码。它索引代码并提供唯一的、可引用的 ID，这些 ID 链接到代码条目。\n\n该库的最新添加包括：\n\n*   **adstex:** 通过从 NASA 天体物理数据系统 (ADS) 获取参考信息，从 TeX 源代码自动构建参考书目文件。\n*   **IAR\\_Model:** 用于拟合来自不规则自回归 (IAR) 模型的不等间距时间序列的 Python 和 R 函数。\n*   **fm4ar:** 使用流动匹配后验估计从光谱推断系外行星的大气属性。\n*   **AGNI:** 模拟具有岩浆海洋的岩石系外行星的大气结构，确保辐射对流平衡。\n*   **FiCUS:** 拟合河外紫外 (UV) 光谱的恒星连续谱以估计星系属性。\n*   **pyStarburst99:** Starburst99 星族合成代码的 Python 版本。\n*   **SIGWAY:** 计算早期宇宙中曲率扰动发出的二阶标量诱导引力波信号。\n*   **sMV:** 提供用于串行多视图相位平面估计的工作流程。\n*   **DeepSSM:** 使用神经网络模拟引力波 (GW) 频谱。\n*   **HipFT:** 在太阳表面实施平流、扩散和数据同化，并构成开源通量输运 (OFT) 软件套件的计算核心。"
  },
  {
    "id": "45223102",
    "title": "Show HN: An MCP Gateway to block the lethal trifecta",
    "url": "https://github.com/Edison-Watch/open-edison",
    "summary": "OpenEdison is presented as a secure MCP (Managed Compute Provider) gateway designed to prevent data exfiltration and agent hijacking when connecting AI to sensitive data and software. It addresses the \"lethal trifecta\" of AI risks: private data access, untrusted content exposure, and external communication.\n\nKey features include:\n\n*   **Data Leak Blocker:** Automatically blocks data leaks, even if the AI is jailbroken.\n*   **Deterministic Execution:** Guarantees data exfiltration prevention.\n*   **Easy Configuration:** Simplified management of MCP servers.\n*   **Visibility:** Tracks AI agent interactions with connected systems via MCP calls.\n*   **Simple API & Docker Support:** REST API for management and containerized deployment.\n\nEdison monitors and controls access to tools, resources, and prompts using configurable security classifications based on Access Control Levels (ACLs). It tracks the highest ACL level for each session and blocks write operations to lower ACL levels.\n\nThe system utilizes `tool_permissions.json`, `resource_permissions.json`, and `prompt_permissions.json` to define security classifications, with wildcard patterns allowed for broader definitions.\n\nThe `get_security_status` tool allows monitoring of session risk levels. When all three \"lethal trifecta\" risk flags are set, potentially dangerous operations are blocked.\n\nThe offering is available through various installation methods, including direct script execution, PyPI, and Docker, with setup instructions provided. Comprehensive documentation and a GPL-3.0 license are also available.\n",
    "chinese_title": "显示 HN：一个 MCP 网关，用于阻止致命的三重威胁",
    "chinese_summary": "OpenEdison是一个安全的MCP（托管计算提供商）网关，旨在防止在将AI连接到敏感数据和软件时发生的数据泄露和代理劫持。它解决了AI风险的“致命三要素”：私有数据访问、不受信任的内容暴露和外部通信。\n\n主要特性包括：\n\n*   **数据泄露拦截器：** 自动拦截数据泄露，即使AI已被越狱。\n*   **确定性执行：** 保证数据泄露预防。\n*   **轻松配置：** 简化MCP服务器的管理。\n*   **可见性：** 通过MCP调用跟踪AI代理与连接系统的交互。\n*   **简单API和Docker支持：** 用于管理的REST API和容器化部署。\n\nEdison使用基于访问控制级别（ACL）的可配置安全分类来监视和控制对工具、资源和提示的访问。它跟踪每个会话的最高ACL级别，并阻止写入较低ACL级别的操作。\n\n该系统利用 `tool_permissions.json`、`resource_permissions.json` 和 `prompt_permissions.json` 来定义安全分类，并允许使用通配符模式进行更广泛的定义。\n\n`get_security_status` 工具允许监控会话风险级别。当所有三个“致命三要素”风险标志都被设置时，潜在的危险操作将被阻止。\n\n该产品可通过多种安装方法获得，包括直接脚本执行、PyPI和Docker，并提供设置说明。还提供全面的文档和GPL-3.0许可。"
  },
  {
    "id": "45218111",
    "title": "Debian 13, Postgres, and the US time zones",
    "url": "https://rachelbythebay.com/w/2025/09/11/debtz/",
    "summary": "Okay, I have read the article \"Debian 13, Postgres, and the US time zones\" from rachelbythebay.com.\n\nHere's a summary:\n\nThe article discusses a potential issue in Debian 13 related to handling US time zone names, specifically with PostgreSQL. The author anticipates that Debian 13 might introduce changes to how time zones are named and represented, potentially leading to inconsistencies with how PostgreSQL stores and retrieves time zone information.\n\nThe core problem lies in the difference between using the full, long-form time zone names (like \"America/Los_Angeles\") versus shorter, often ambiguous abbreviations (like \"PST\" or \"PDT\"). PostgreSQL typically relies on the long-form names. The author fears that Debian 13's changes to the `tzdata` package (which contains time zone information) might inadvertently cause PostgreSQL to misinterpret or fail to recognize existing time zone data in databases if the system defaults to using abbreviations or a different naming convention.\n\nThis potential incompatibility could lead to data corruption, incorrect date/time calculations, and application malfunctions relying on accurate time zone handling within PostgreSQL. The author raises this concern early, hoping to alert Debian and PostgreSQL developers to the potential problem so they can investigate and implement mitigating strategies before the release of Debian 13. The article suggests that careful consideration and testing are necessary to ensure smooth transition and avoid breaking existing PostgreSQL installations and applications that depend on accurate time zone information. In short, the article is a warning about a possible time zone apocalypse for Postgres users with Debian 13.\n",
    "chinese_title": "Debian 13、Postgres 和美国时区",
    "chinese_summary": "好的，我阅读了来自 rachelbythebay.com 的文章《Debian 13、Postgres 和美国时区》。\n\n以下是摘要：\n\n该文章讨论了 Debian 13 中与处理美国时区名称相关的潜在问题，特别是与 PostgreSQL 相关的问题。作者预计 Debian 13 可能会更改时区的命名和表示方式，从而可能导致与 PostgreSQL 存储和检索时区信息的方式不一致。\n\n核心问题在于使用完整、长格式的时区名称（如“America/Los_Angeles”）与较短、通常含糊不清的缩写（如“PST”或“PDT”）之间的差异。PostgreSQL 通常依赖于长格式名称。作者担心 Debian 13 对 `tzdata` 包（包含时区信息）的更改可能会无意中导致 PostgreSQL 误解或无法识别数据库中现有的时区数据，如果系统默认使用缩写或其他命名约定。\n\n这种潜在的不兼容性可能导致数据损坏、不正确的日期/时间计算，以及依赖于 PostgreSQL 中准确时区处理的应用程序发生故障。作者提前提出这个问题，希望提醒 Debian 和 PostgreSQL 开发人员注意潜在问题，以便他们可以在 Debian 13 发布之前进行调查并实施缓解策略。文章建议需要仔细考虑和测试，以确保平稳过渡并避免破坏现有的 PostgreSQL 安装和依赖于准确时区信息的应用程序。简而言之，这篇文章是对 Debian 13 的 Postgres 用户可能面临的时区末日的警告。"
  },
  {
    "id": "45223719",
    "title": "Corporations are trying, and now failing, to hide job openings from US citizens",
    "url": "https://thehill.com/opinion/finance/5498346-corporate-america-has-been-trying-to-hide-job-openings-now-it-is-failing/",
    "summary": "The article on The Hill argues that corporations have been attempting to hide job openings from US citizens in order to fill those positions with foreign workers on H-1B visas, often at lower wages. This strategy, the author contends, allows companies to suppress salaries and weaken the bargaining power of American workers.\n\nThe article points out that companies are now finding it harder to conceal these job openings. This is due to increased scrutiny and improved tracking of job postings, exposing the practice of specifically targeting foreign workers or posting requirements that effectively exclude qualified American applicants. The author suggests that this increased visibility is making it more difficult for companies to justify hiring foreign workers over qualified American citizens.\n\nThe piece also suggests that this practice harms the American economy by depressing wages and displacing domestic workers. The author implies that greater transparency and stricter enforcement of immigration laws are needed to ensure that US citizens have fair access to job opportunities and to prevent companies from exploiting the H-1B visa program to artificially lower labor costs. The article advocates for policies that prioritize American workers and protect them from unfair competition.\n",
    "chinese_title": "公司正试图（但现在失败了）对美国公民隐藏职位空缺。",
    "chinese_summary": "《国会山报》的文章认为，公司一直在试图向美国公民隐藏职位空缺，以便用H-1B签证雇佣外国工人来填补这些职位，而且通常工资较低。作者认为，这种策略使公司能够压低工资并削弱美国工人的议价能力。\n\n文章指出，公司现在发现越来越难以隐藏这些职位空缺。 这是因为对职位发布的审查力度加大和追踪技术的改进，揭露了专门针对外国工人或发布有效排除合格美国申请人的要求的做法。 作者认为，这种更高的透明度使得公司更难证明聘用外国工人而非合格的美国公民是合理的。\n\n文章还认为，这种做法通过压低工资和取代国内工人来损害美国经济。 作者暗示，需要更高的透明度和更严格的移民法执行力度，以确保美国公民能够公平地获得就业机会，并防止公司利用H-1B签证计划人为地降低劳动力成本。 该文章倡导优先考虑美国工人并保护他们免受不公平竞争的政策。"
  },
  {
    "id": "45223726",
    "title": "VaultGemma: The most capable differentially private LLM",
    "url": "https://research.google/blog/vaultgemma-the-worlds-most-capable-differentially-private-llm/",
    "summary": "VaultGemma is a 1B-parameter, open-source language model trained from scratch using differential privacy (DP), making it the largest of its kind. Google Research, in partnership with Google DeepMind, developed it. The model's release aims to advance the development of privacy-preserving AI.\n\nThe research behind VaultGemma established new \"scaling laws\" for DP language models, which model the trade-offs between compute, privacy, and utility. A key finding is that for DP models, smaller model sizes and much larger batch sizes are more effective than traditional, non-DP training approaches.\n\nVaultGemma demonstrates the practical application of these scaling laws. It was trained using these principles and advanced algorithms, including \"Scalable DP-SGD,\" to address challenges posed by Poisson sampling, a crucial component of DP-SGD.\n\nPerformance benchmarks show VaultGemma achieves utility comparable to non-private models from about five years ago, highlighting the current resource investment needed for privacy. The model offers a sequence-level DP guarantee (ε ≤ 2.0, δ ≤ 1.1e-10), meaning that information contained within a single sequence of 1024 tokens has a provably limited influence on the model's output. Empirical testing demonstrates that VaultGemma exhibits no detectable memorization of its training data. The researchers hope VaultGemma and their scaling laws will drive further advancements in safe, responsible, and private AI.\n",
    "chinese_title": "VaultGemma：最强大的差分隐私LLM",
    "chinese_summary": "VaultGemma 是一款 10 亿参数的开源语言模型，从头开始使用差分隐私 (DP) 训练而成，是同类模型中规模最大的。它由 Google Research 与 Google DeepMind 合作开发。该模型的发布旨在推进隐私保护型人工智能的发展。\n\nVaultGemma 背后的研究建立了 DP 语言模型的全新“缩放法则”，这些法则对计算、隐私和效用之间的权衡进行了建模。一个关键发现是，对于 DP 模型而言，更小的模型尺寸和更大的批处理规模比传统的非 DP 训练方法更有效。\n\nVaultGemma 演示了这些缩放法则的实际应用。它使用这些原则和先进的算法进行训练，包括“可扩展的 DP-SGD”，以应对泊松抽样带来的挑战，而泊松抽样是 DP-SGD 的关键组成部分。\n\n性能基准测试表明，VaultGemma 实现了与大约五年前的非私有模型相当的效用，突显了当前隐私所需的资源投入。该模型提供序列级别的 DP 保证（ε ≤ 2.0，δ ≤ 1.1e-10），这意味着包含在单个 1024 个 token 序列中的信息对模型输出的影响有可证明的限制。实证测试表明，VaultGemma 没有表现出对其训练数据的可检测记忆。研究人员希望 VaultGemma 及其缩放法则能够推动安全、负责任和私有 AI 的进一步发展。"
  },
  {
    "id": "45173100",
    "title": "Introduction to Nyquist and Lisp Programming",
    "url": "https://manual.audacityteam.org/man/introduction_to_nyquist_and_lisp_programming.html",
    "summary": "This document introduces Nyquist and Lisp programming, particularly within the context of Audacity plugin development. Nyquist, designed for audio synthesis and analysis, uses Lisp syntax (and optionally SAL in newer Audacity versions).\n\nThe document emphasizes Lisp's S-expression structure, where everything is a parenthesized list of tokens, with the function name appearing first. It explains how to define functions using `defun`, assign values with `setf`, and work with mathematical operations using prefix notation. Quoting using `'` is essential when dealing with lists to prevent evaluation. List manipulation is covered with functions like `first`, `rest`, and `list`.\n\nIt provides a table of common Lisp/SAL functions, including math functions (+, -, *, /, truncate, float, rem, min, max, abs, random, rrandom, sin, cos, tan, expt, sqrt, comparison operators), list functions (first, rest, reverse, list, append, length, maplist), and conditional expressions (if, when, unless, cond, case). Examples demonstrate how to use these functions in both Lisp and SAL syntax.\n\nThe article guides the reader to available Nyquist manuals, specifically noting the Lisp-based version 2.37 and the SAL-focused version 3.1x. It serves as a starting point for developing Nyquist plugins within Audacity.\n",
    "chinese_title": "Nyquist 和 Lisp 编程入门",
    "chinese_summary": "本文介绍Nyquist和Lisp编程，特别是在Audacity插件开发背景下。 Nyquist专为音频合成和分析设计，使用Lisp语法（新版Audacity中可以选择使用SAL）。\n\n本文强调Lisp的S-表达式结构，其中一切都是带括号的标记列表，函数名位于最前面。它解释了如何使用`defun`定义函数，使用`setf`赋值，以及如何使用前缀表示法进行数学运算。在使用列表时，使用`'`进行引用以防止求值至关重要。列表操作涵盖了诸如`first`、`rest`和`list`等函数。\n\n本文提供了一个常见的Lisp/SAL函数表，包括数学函数（+, -, *, /, truncate, float, rem, min, max, abs, random, rrandom, sin, cos, tan, expt, sqrt, 比较运算符），列表函数（first, rest, reverse, list, append, length, maplist）和条件表达式（if, when, unless, cond, case）。示例演示了如何在Lisp和SAL语法中使用这些函数。\n\n本文引导读者查阅可用的Nyquist手册，特别指出基于Lisp的2.37版本和以SAL为重点的3.1x版本。它可以作为在Audacity中开发Nyquist插件的起点。"
  },
  {
    "id": "45167680",
    "title": "Classic GTK1 GUI Library",
    "url": "https://gitlab.com/robinrowe/gtk1",
    "summary": "The article, titled \"Classic GTK1 GUI Library,\" is in a loading state (\"加载中\"). Therefore, no meaningful summary can be provided because the actual content of the article is unavailable. A summary requires understanding the main points, key information, and arguments presented within the article's text, which is currently absent.\n",
    "chinese_title": "经典 GTK1 GUI 库",
    "chinese_summary": "文章《经典GTK1 GUI库》正在加载中，因此无法提供有意义的摘要。由于文章的实际内容不可用，摘要需要理解文章文本中的主要观点、关键信息和论点，而这些目前都不存在。"
  },
  {
    "id": "45220069",
    "title": "Show HN: I made a generative online drum machine with ClojureScript",
    "url": "https://dopeloop.ai/beat-maker/",
    "summary": "This \"Show HN\" post introduces Beat Maker, an online drum machine created by dopeloop.ai. The project is described as a generative online drum machine built using ClojureScript. The post's brevity suggests it is a brief introduction and likely a call to action for users to try the tool and provide feedback. The core offering is a web-based application that allows users to create drum beats, and the use of \"generative\" suggests the possibility of AI-assisted rhythm creation or algorithmic beat generation. The fact that it's built with ClojureScript indicates a modern, functional programming approach to web development.\n",
    "chinese_title": "Show HN: 我用 ClojureScript 做了一个生成式在线鼓机",
    "chinese_summary": "“Show HN”：Beat Maker – dopeloop.ai出品的在线鼓机"
  },
  {
    "id": "45223660",
    "title": "OpenAI Grove",
    "url": "https://openai.com/index/openai-grove/",
    "summary": "OpenAI Grove is a project focused on understanding and improving the long-term societal impacts of AI. It involves creating a simulated, interactive environment where researchers can explore the complex interplay of AI with human systems and institutions. The goal is to identify potential risks, unintended consequences, and beneficial applications of advanced AI before they manifest in the real world.\n\nThe environment allows researchers to experiment with different AI models and policies, observing their effects on various societal aspects like economies, information ecosystems, and social dynamics. This enables proactive mitigation strategies and informed decision-making regarding AI development and deployment.\n\nGrove aims to foster collaboration across disciplines, bringing together experts from AI, economics, political science, and sociology to contribute to a holistic understanding of AI's impact. By providing a shared platform for experimentation and analysis, Grove seeks to accelerate the development of responsible and beneficial AI technologies.\n\nKey features include a modular design allowing researchers to focus on specific areas of interest, data-driven simulations informed by real-world data and insights, and an emphasis on transparency and reproducibility of results. Ultimately, OpenAI Grove represents a significant step towards ensuring that AI benefits society as a whole by anticipating and addressing potential challenges in a controlled and rigorous manner.\n",
    "chinese_title": "OpenAI 格罗夫",
    "chinese_summary": "OpenAI Grove是一个致力于理解和改善人工智能长期社会影响的项目。它涉及创建一个模拟的、交互式的环境，供研究人员探索人工智能与人类系统和机构之间复杂的相互作用。其目标是在潜在风险、意外后果和先进人工智能的有益应用在现实世界中显现之前就识别出来。\n\n该环境允许研究人员试验不同的人工智能模型和政策，观察它们对经济、信息生态系统和社会动态等各种社会方面的影响。这使得能够采取积极的缓解策略，并就人工智能的开发和部署做出明智的决策。\n\nGrove旨在促进跨学科合作，汇集来自人工智能、经济学、政治学和社会学领域的专家，以促进对人工智能影响的整体理解。通过提供一个共享的实验和分析平台，Grove力求加速负责任和有益的人工智能技术的发展。\n\n关键特性包括模块化设计，允许研究人员专注于特定的兴趣领域；由真实世界数据和见解驱动的数据驱动型模拟；以及对结果的透明度和可重复性的强调。最终，OpenAI Grove代表着朝着确保人工智能通过以受控和严谨的方式预测和解决潜在挑战，从而使整个社会受益迈出的重要一步。"
  },
  {
    "id": "45221103",
    "title": "Lumina-DiMOO: An open-source discrete multimodal diffusion model",
    "url": "https://synbol.github.io/Lumina-DiMOO/",
    "summary": "Lumina-DiMOO is a new open-source foundational model designed for both multimodal generation and understanding. It distinguishes itself by using a fully discrete diffusion modeling approach, enabling it to handle inputs and outputs from various modalities seamlessly. This approach results in higher sampling efficiency compared to autoregressive or hybrid models and allows it to effectively perform tasks like text-to-image, image-to-image generation (including editing, subject-driven generation, and inpainting), and image understanding.\n\nThe model achieves state-of-the-art performance on several benchmarks, outperforming existing open-source unified multimodal models. To encourage further research in the field of multimodal and discrete diffusion models, the authors have released the code and model checkpoints.\n\nThe document showcases Lumina-DiMOO's capabilities through a variety of examples, including text-to-image generation, image editing, style transfer, subject-driven generation, controllable generation, and inpainting. Experimental results are presented using the GenEval, DPG, and Image Understanding benchmarks, highlighting its superior performance in comparison to other models. The work was supported by Huawei's MindSpeed MM, an open-source training framework specifically optimized for Huawei’s Ascend AI chips.\n",
    "chinese_title": "Lumina-DiMOO：一种开源的离散多模态扩散模型",
    "chinese_summary": "Lumina-DiMOO：用于多模态生成和理解的新型开源基础模型"
  },
  {
    "id": "45172905",
    "title": "Using Emacs Org-Mode With Databases: A getting-started guide",
    "url": "https://gitlab.com/ryanprior/emacs-org-data-starter",
    "summary": "Given the article content is \"加载中\" (Loading...), it's impossible to provide a summary that captures main points and key information. The article is incomplete or has failed to load.\n\nTherefore, the only possible summary is:\n\n**The article, titled \"Using Emacs Org-Mode With Databases: A getting-started guide,\" is currently loading and no content is available for summarization.**\n",
    "chinese_title": "使用Emacs Org-Mode连接数据库入门指南",
    "chinese_summary": "文章标题“使用 Emacs Org-Mode 连接数据库：入门指南”正在加载中，目前没有内容可供总结。"
  },
  {
    "id": "45220121",
    "title": "Examples from The LaTeX Companion book (3rd edition)",
    "url": "https://ctan.org/pkg/tlc3-examples",
    "summary": "This article describes the \"tlc3-examples\" package available on CTAN. This package contains all LaTeX source code and necessary supporting files for the examples presented in the third edition of \"The LaTeX Companion\" book (Parts I & II), published by Addison-Wesley in 2023 (ISBN-13: 978-0-13-816648-9, ISBN-10: 0-13-816648-X).  It also includes the PDFs used with spot color and trimming. The package is maintained by Frank Mittelbach and licensed under the LaTeX Project Public License 1.3c.  It is available for download as a zip archive (82.4M) and is also included in TeX Live. The article provides links to the package's bug tracker and repository, and suggests related packages containing examples from other LaTeX books. Essentially, this package offers a practical, hands-on resource for readers of \"The LaTeX Companion\" to experiment with and learn from the book's examples.\n",
    "chinese_title": "《LaTeX Companion》（第三版）书中的示例",
    "chinese_summary": "本文介绍了CTAN上的“tlc3-examples”软件包。该软件包包含《The LaTeX Companion》第三版（第一部分和第二部分）一书中所有示例的LaTeX源代码和必要的支持文件，该书由Addison-Wesley于2023年出版（ISBN-13: 978-0-13-816648-9, ISBN-10: 0-13-816648-X）。它还包括用于专色和裁剪的PDF文件。该软件包由Frank Mittelbach维护，并根据LaTeX Project Public License 1.3c获得许可。可以下载zip压缩包（82.4M），并且也包含在TeX Live中。本文提供了软件包的错误跟踪器和存储库的链接，并推荐了包含其他LaTeX书籍示例的相关软件包。总而言之，该软件包为《The LaTeX Companion》的读者提供了一个实践性的资源，可以用来实验和学习书中的示例。"
  },
  {
    "id": "45214908",
    "title": "Claude’s memory architecture is the opposite of ChatGPT’s",
    "url": "https://www.shloked.com/writing/claude-memory",
    "summary": "This article contrasts the memory architectures of Claude and ChatGPT, highlighting their fundamentally opposite approaches. Claude employs a blank-slate approach, activating memory only when explicitly invoked through commands like \"what did we discuss about.\" It retrieves information by searching the raw, unsummarized conversation history using two tools: `conversation_search` (keyword/topic-based) and `recent_chats` (time-based). This method gives users direct control and predictability, prioritizing accuracy over convenience.\n\nConversely, ChatGPT automatically loads all memory components, creating immediate personalization. It builds detailed user profiles and learns preferences without explicit user input. This aims for a seamless, \"magical\" user experience.\n\nThe divergence reflects the different target audiences. ChatGPT caters to a broad consumer base seeking ease of use and personalized experiences. Claude targets technical users, such as developers and researchers, who value control, transparency, and predictability in their professional workflows, and are willing to trade some convenience for it.\n\nThe author emphasizes that there's no single \"right\" way to design AI memory, and the ideal approach depends heavily on user needs and priorities. The AI memory design space is vast, and the current approaches are just the beginning of an evolving landscape. The author intends to continue dissecting different memory architectures and sharing updates as the field develops, noting an update from Anthropic to incorporate a memory feature that is much closer to ChatGPT.\n",
    "chinese_title": "Claude的记忆架构与ChatGPT相反。",
    "chinese_summary": "本文对比了Claude和ChatGPT的记忆架构，突出了它们截然相反的方法。Claude采用了一种白板方法，只有在通过“我们讨论了什么”等命令显式调用时才会激活记忆。它通过使用两种工具：`conversation_search`（基于关键词/主题）和`recent_chats`（基于时间）来搜索原始、未概括的对话历史记录，从而检索信息。这种方法赋予用户直接的控制和可预测性，并将准确性置于便利性之上。\n\n相反，ChatGPT会自动加载所有记忆组件，从而创建即时个性化。它无需用户显式输入即可构建详细的用户档案并学习偏好。这旨在实现无缝、\"神奇\"的用户体验。\n\n这种差异反映了不同的目标受众。ChatGPT面向寻求易用性和个性化体验的广泛消费者群体。Claude面向技术用户，如开发者和研究人员，他们重视在专业工作流程中的控制、透明性和可预测性，并且愿意为此牺牲一些便利性。\n\n作者强调，设计AI记忆没有唯一的“正确”方法，理想的方法在很大程度上取决于用户的需求和优先级。AI记忆设计空间广阔，目前的方法仅仅是一个不断发展的领域的开端。作者计划继续剖析不同的记忆架构，并在该领域发展时分享更新，并指出Anthropic已更新其功能，使其更接近ChatGPT的记忆特性。"
  },
  {
    "id": "45168823",
    "title": "Doorbell prankster that tormented residents of apartments turns out to be a slug",
    "url": "https://www.theguardian.com/world/2025/sep/08/doorbell-prankster-that-tormented-residents-of-german-apartments-turns-out-to-be-a-slug",
    "summary": "Residents of an apartment building in Bavaria, Germany, were plagued by persistent late-night doorbell ringing. Initially suspecting teenagers playing a prank known as \"klingelstreich\" (ding dong ditch), they called the police to investigate. To their surprise, the culprit wasn't human, but a slug.\n\nThe slug was sliding across the metal doorbell plate, triggering the bell repeatedly. The incessant ringing disrupted the residents' sleep and caused considerable frustration. Even after police arrived and found no one at the door and the motion detector inactive, the ringing continued, leading them to discover the slug and its slime trail on the bell panel.\n\nOne resident, Lisa, recounted how the ringing started after 10 pm, and her sister-in-law upstairs experienced the same problem. Their inability to identify the source of the ringing led to unease, prompting them to contact the police. The police confirmed that the slug was responsible. According to a police spokesperson, the slug was then \"brought down to size, taught about its territory boundaries and placed on a nearby stretch of grass,\" effectively ending its reign of doorbell terror.\n",
    "chinese_title": "按门铃恶作剧骚扰公寓居民的元凶竟是一只蛞蝓",
    "chinese_summary": "德国巴伐利亚一栋公寓楼的居民一直饱受深夜门铃骚扰之苦。起初他们怀疑是青少年恶作剧，即所谓的“klingelstreich”（按门铃逃跑），于是报警调查。令他们惊讶的是，罪魁祸首不是人，而是一只蛞蝓。\n\n这只蛞蝓在金属门铃面板上滑动，反复触发门铃。持续不断的铃声扰乱了居民的睡眠，引起了极大的 frustration。即使警察赶到后，发现门前没有人，运动探测器也没有反应，铃声仍然继续，这使得他们最终发现了蛞蝓以及它在门铃面板上的黏液痕迹。\n\n一位居民丽莎回忆说，门铃在晚上10点后开始响，她楼上的嫂子也遇到了同样的问题。他们无法确定铃声的来源，这让他们感到不安，于是报警。警方确认罪魁祸首是蛞蝓。据警方发言人称，这只蛞蝓随后被“制服，接受了关于其领地边界的教育，并被放置在附近的一片草地上”，从而有效地结束了它的门铃恐怖统治。"
  },
  {
    "id": "45220656",
    "title": "Becoming the person who does the thing",
    "url": "https://www.fredrivett.com/2025/09/10/becoming-the-person-who-does-the-thing/",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "成为那个做事的人",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "45221772",
    "title": "UK launches Project Octopus to deliver interceptor drones to Ukraine",
    "url": "https://www.shephardmedia.com/news/air-warfare/dsei-2025-uk-launches-project-octopus-to-deliver-thousands-of-interceptor-drones-to-ukraine/",
    "summary": "The UK has launched \"Project Octopus\" to mass produce Ukrainian-designed interceptor drones and supply them to Ukraine in the fight against Russian drones. The project, unveiled at DSEI 2025, is a partnership where Ukraine shares the technology behind its effective, low-cost interceptor drone with the UK. In return, the UK will rapidly develop and mass produce these drones, sending thousands to Ukraine monthly.\n\nAccording to UK Defence Secretary John Healey, these Ukrainian-designed drones have been highly effective against Iranian-made Shahed drones, costing less than 10% of the value of the Russian systems destroyed.\n\nThe agreement follows a £200 million investment by Ukrainian drone manufacturer UKRSPECSYSTEMS into two new UK facilities. Furthermore, other UK-Ukraine drone partnerships are emerging, including a joint venture between Prevail Partners (UK) and Skyeton (Ukraine) for the Raybird UAV, potentially for the UK's Project Corvus to replace the Watchkeeper drone.\n",
    "chinese_title": "英国启动“章鱼计划”，向乌克兰交付拦截无人机。",
    "chinese_summary": "英国启动“章鱼计划”大规模生产乌克兰拦截无人机并供应乌克兰对抗俄罗斯无人机。该项目在2025年英国国防与安全装备展上发布，是一项合作计划，乌克兰将其高效、低成本拦截无人机的技术分享给英国。作为回报，英国将迅速开发并大规模生产这些无人机，每月向乌克兰运送数千架。\n\n据英国国防大臣约翰·希利称，这些乌克兰设计的无人机在对抗伊朗制造的“沙赫德”无人机方面非常有效，成本仅为被摧毁的俄罗斯系统价值的不到10%。\n\n此前，乌克兰无人机制造商UKRSPECSYSTEMS已向英国的两个新设施投资了2亿英镑。此外，其他英乌无人机合作项目也在涌现，包括Prevail Partners（英国）和Skyeton（乌克兰）之间的合资企业，用于生产Raybird无人机，可能用于英国的“渡鸦计划”以取代“守望者”无人机。"
  },
  {
    "id": "45221938",
    "title": "Justice Department Announces Actions to Combat North Korean Remote IT Workers",
    "url": "https://www.justice.gov/opa/pr/justice-department-announces-coordinated-nationwide-actions-combat-north-korean-remote",
    "summary": "The Justice Department announced a coordinated nationwide effort to combat North Korean schemes that use remote IT workers to generate illicit revenue for the DPRK regime, funding its weapons programs. These actions include indictments, an arrest, a plea agreement, searches of \"laptop farms\" across 16 states, and seizures of financial accounts and fraudulent websites.\n\nNorth Korean individuals fraudulently obtain employment with U.S. companies using stolen and fake identities, assisted by individuals in the U.S., China, UAE, and Taiwan. Some U.S.-based individuals create front companies and host \"laptop farms\" to facilitate this. Once employed, the North Korean IT workers receive salaries, access sensitive data, and sometimes steal it, including export-controlled military technology and virtual currency. One scheme involved stealing over $900,000 in virtual currency from a Georgia-based blockchain company.\n\nActions include the arrest of Zhenxing \"Danny\" Wang in New Jersey for a multi-year fraud scheme generating over $5 million. Four North Korean nationals are charged in Georgia with stealing and laundering virtual currency. The FBI searched 21 suspected \"laptop farms\" in 14 states, seizing approximately 137 laptops.\n\nThe DOJ has made multiple announcements regarding the DPRK RevGen: Domestic Enabler Initiative. The FBI and other agencies have issued public service announcements and advisories regarding North Korean IT workers fraudulently obtaining employment.\n",
    "chinese_title": "司法部宣布打击朝鲜远程IT工作者的行动",
    "chinese_summary": "司法部宣布了一项协调一致的全国行动，打击朝鲜利用远程IT工作者为朝鲜政权非法创收、资助其武器项目的阴谋。这些行动包括起诉、逮捕、认罪协议、搜查16个州的“笔记本电脑农场”以及查封金融账户和欺诈网站。\n\n朝鲜个人在美国境内人士、中国、阿联酋和台湾地区人士的协助下，使用盗用和虚假身份，以欺诈手段获得美国公司的工作。一些美国境内人士创建幌子公司并设立“笔记本电脑农场”来促成此事。一旦受雇，朝鲜IT工作者就会获得薪水、访问敏感数据，有时还会窃取数据，包括受出口管制的军事技术和虚拟货币。其中一项阴谋涉及从一家位于佐治亚州的区块链公司窃取超过90万美元的虚拟货币。\n\n行动包括在新泽西州逮捕王振星（Zhenxing \"Danny\" Wang），他实施了一项多年欺诈计划，获利超过500万美元。四名朝鲜国民在佐治亚州被指控盗窃和洗钱虚拟货币。联邦调查局搜查了14个州的21个可疑“笔记本电脑农场”，查获约137台笔记本电脑。\n\n司法部已多次宣布关于“朝鲜创收：国内促成者倡议”（DPRK RevGen: Domestic Enabler Initiative）的消息。联邦调查局和其他机构已发布关于朝鲜IT工作者以欺诈手段获得工作的公共服务公告和建议。"
  },
  {
    "id": "45223643",
    "title": "America now leads the world in surveillanceware investment",
    "url": "https://www.theregister.com/2025/09/11/us_surveillanceware_investment/",
    "summary": "The United States has become the world leader in investment in surveillanceware, a ethically questionable but lucrative field of computer surveillance software. A report by the Atlantic Council reveals a surge in US investment, surpassing all other countries. This increase is concerning, as it undermines US government efforts to regulate the spyware market through initiatives like the Pall Mall Process.\n\nThe report highlights the growth in US-based entities investing in and reselling surveillanceware, even involving companies previously sanctioned or restricted. For example, after Paragon Solutions, a company with an ICE spyware contract, was acquired by a US firm, the stop-work order was lifted, allowing the contract to resume. Similarly, a US company acquired Saito Tech Ltd, which develops the Candiru surveillanceware tool despite the company's placement on the US Commerce Department's Entity List.\n\nThe Atlantic Council emphasizes a contradiction: US government efforts to constrain the spyware market are being undermined by domestic investment in the same technology. The increasing use of resellers further complicates regulation. The report warns that this contradiction erodes US leadership on the issue and urges the US government to address this imbalance between policy and industry investment.\n",
    "chinese_title": "美国目前在监控软件投资方面领先世界。",
    "chinese_summary": "美国已成为监控软件投资的世界领导者，这是一个在伦理上存疑但利润丰厚的计算机监控软件领域。大西洋理事会的一份报告显示，美国的投资激增，超过了所有其他国家。这种增长令人担忧，因为它破坏了美国政府通过“帕尔马尔进程”等举措来监管间谍软件市场的努力。\n\n该报告强调了总部位于美国的实体在投资和转售监控软件方面的增长，甚至涉及先前受到制裁或限制的公司。例如，在一家拥有美国移民及海关执法局（ICE）间谍软件合同的公司Paragon Solutions被一家美国公司收购后，停工令被解除，允许合同恢复。同样，一家美国公司收购了Saito Tech Ltd，该公司开发Candiru监控软件工具，尽管该公司已被列入美国商务部的实体清单。\n\n大西洋理事会强调了一个矛盾：美国政府限制间谍软件市场的努力正在被国内对同一技术的投资所破坏。经销商的日益使用进一步使监管复杂化。该报告警告说，这种矛盾正在削弱美国在该问题上的领导地位，并敦促美国政府解决政策与行业投资之间的这种不平衡。"
  },
  {
    "id": "45165070",
    "title": "Building my childhood dream PC",
    "url": "https://fabiensanglard.net/2168/",
    "summary": "Fabien Sanglard recounts his childhood dream of owning an IBM PS/1 2168, a top-of-the-line PC from 1993, sparked by the disappointment of owning an inferior Cyrix 486SLC. Unable to afford the expensive IBM at the time, he embarks on a journey in 2024 to acquire and restore one.\n\nThe article details his appreciation for the IBM PS/1 2168's design, highlighting features like its mini-tower form factor with a handle, rounded corners, cleverly concealed drives, and the high-quality Model M keyboard often bundled with it. He also notes the comprehensive documentation and upgradability of the PS/1 compared to clone PCs.\n\nSanglard describes the difficulty of finding a functional 2168, particularly a 33Mhz model for optimal performance. He eventually locates a DX2-66Mhz version in Finland, complete with original boxes and manuals, and negotiates a deal to purchase it. The article concludes with anticipation for the unboxing process, teasing future installments documenting the restoration and upgrading of the vintage PC, with the ultimate goal of running DOOM smoothly. The rest of the article content will be provided in a series of blog posts.\n",
    "chinese_title": "搭建我的童年梦想电脑",
    "chinese_summary": "Fabien Sanglard追忆童年梦想：拥有一台1993年的顶级PC——IBM PS/1 2168，这源于他对当时拥有的低端Cyrix 486SLC的失望。因无力负担昂贵的IBM，他在2024年踏上了一段寻觅并修复它的旅程。\n\n文章详细描述了他对IBM PS/1 2168设计的赞赏，突出了其迷你塔式机箱带把手、圆角、巧妙隐藏的驱动器以及通常附带的高品质Model M键盘等特点。他还提到，与兼容机相比，PS/1拥有全面的文档和可升级性。\n\nSanglard描述了寻找一台功能完好的2168的困难，尤其是要找到一台33Mhz型号以获得最佳性能。他最终在芬兰找到了一台DX2-66Mhz版本，连同原装包装盒和说明书，并协商达成购买协议。文章结尾充满了对开箱过程的期待，并预告了未来的文章将记录这台复古PC的修复和升级过程，最终目标是流畅运行DOOM。文章的剩余内容将在系列博文中提供。"
  },
  {
    "id": "45223572",
    "title": "Netherlands joins Ireland will boycott 2026 Eurovision if Israel participates",
    "url": "https://nltimes.nl/2025/09/12/netherlands-will-boycott-2026-eurovision-israel-participates-says-broadcaster",
    "summary": "AVROTROS, the Dutch broadcast company, announced the Netherlands will boycott the 2026 Eurovision Song Contest in Vienna if Israel participates. This makes the Netherlands the fifth country, joining Iceland, Slovenia, Spain, and Ireland, to announce a planned boycott.\n\nAVROTROS cited the \"ongoing and severe human suffering in Gaza\" as the reason, stating they can no longer justify Israel's participation in the current situation. The company also expressed concern over the \"serious erosion of press freedom,\" referencing alleged Israeli government interference in the previous year's event.\n\nThe broadcaster emphasized that they have discussed the matter with the European Broadcasting Union (EBU). Israel's participation has been controversial for years. It's worth noting that this isn't the first time the Netherlands threatened to withdraw from Eurovision; AVROTROS considered pulling out of the 2025 edition due to reports of an unsafe environment at the 2024 event, which led to Joost Klein's disqualification.\n",
    "chinese_title": "如果以色列参赛，荷兰将与爱尔兰一起抵制2026年欧洲歌唱大赛。",
    "chinese_summary": "荷兰广播公司AVROTROS宣布，如果以色列参加，荷兰将抵制在维也纳举行的2026年欧洲歌唱大赛。这使得荷兰成为继冰岛、斯洛文尼亚、西班牙和爱尔兰之后，第五个宣布计划抵制的国家。\n\nAVROTROS将原因归咎于“加沙持续而严重的人道苦难”，并表示他们无法再为以色列在当前局势下的参与辩护。该公司还对“新闻自由的严重侵蚀”表示担忧，并提到了据称以色列政府干预上届赛事的情况。\n\n该广播公司强调，他们已经与欧洲广播联盟（EBU）讨论了此事。多年来，以色列的参与一直备受争议。值得注意的是，这并非荷兰首次威胁退出欧洲歌唱大赛；AVROTROS曾考虑退出2025年的比赛，原因是2024年赛事中存在不安全环境的报道，这导致了Joost Klein被取消资格。"
  },
  {
    "id": "45217372",
    "title": "Toddlerbot: Open-Source Humanoid Robot",
    "url": "https://toddlerbot.github.io/",
    "summary": "The ToddlerBot project introduces a low-cost, open-source humanoid robot platform specifically designed to facilitate scalable policy learning and advance research in robotics and artificial intelligence. Its open-source nature allows researchers and developers to access and modify the design, fostering collaboration and accelerating innovation. The robot's affordability makes it accessible to a wider range of researchers, potentially democratizing robotics research and enabling larger-scale experiments. The focus on scalable policy learning suggests that ToddlerBot aims to provide a physical platform for developing and testing AI algorithms that can generalize and adapt to new situations. This could be crucial for creating robots that can learn complex tasks and interact effectively with the real world. Ultimately, ToddlerBot's goal is to contribute to the advancement of robotics and AI by providing a readily available and adaptable tool for exploration and experimentation.\n",
    "chinese_title": "幼儿机器人：开源人形机器人",
    "chinese_summary": "ToddlerBot项目：低成本开源人形机器人平台，旨在促进可扩展策略学习，并推进机器人和人工智能领域的研究。其开源特性使研究人员和开发者能够访问和修改设计，从而促进合作并加速创新。该机器人的经济性使其能够被更广泛的研究人员使用，从而可能实现机器人研究的民主化并进行更大规模的实验。对可扩展策略学习的关注表明，ToddlerBot旨在为开发和测试能够推广并适应新情况的AI算法提供物理平台。这对于创建能够学习复杂任务并与现实世界有效互动的机器人至关重要。最终，ToddlerBot的目标是通过提供一种易于获取和适应性强的探索和实验工具，为机器人和人工智能的进步做出贡献。"
  },
  {
    "id": "45223694",
    "title": "China bans one-pedal driving in default modes by 2027",
    "url": "http://www.asiaict.com/icv/10236.html",
    "summary": "This article discusses China's upcoming regulations regarding \"one-pedal driving\" mode in electric vehicles, set to take effect on January 1, 2027. The new national standard mandates that under default operating conditions, releasing the accelerator pedal cannot bring the vehicle to a complete stop, effectively limiting the one-pedal mode. While not a complete ban, the regulation requires users to actively select the one-pedal mode, and the vehicle must provide clear visual warnings when this mode is activated.\n\nThe article explains the difference between Type A and Type B regenerative braking and clarifies that the regulation primarily targets the kinetic energy recovery aspect of the one-pedal mode, which can bring a car to a full stop without using the brake pedal.\n\nThe regulations are a response to safety concerns, including reports of drivers mistaking the accelerator for the brake and studies showing increased reaction times for drivers accustomed to one-pedal driving. Tesla, which popularized the mode, has faced scrutiny and recalls related to this issue.\n\nBeyond one-pedal driving, the new standard also mandates that brake lights activate when regenerative braking deceleration exceeds 1.3m/s², improving safety for following vehicles. Furthermore, ABS (Anti-lock Braking System) will be a mandatory installation for all newly certified passenger vehicle models. These regulations aim to balance the benefits of kinetic energy recovery with enhanced driver and road safety.\n",
    "chinese_title": "中国将于2027年起禁止默认单踏板模式",
    "chinese_summary": "本文探讨了中国即将于2027年1月1日生效的关于电动汽车“单踏板模式”的法规。这项新的国家标准规定，在默认操作条件下，松开加速踏板不能使车辆完全停止，从而有效地限制了单踏板模式。虽然并非完全禁止，但该法规要求用户主动选择单踏板模式，并且车辆在激活此模式时必须提供清晰的视觉警告。\n\n本文解释了A型和B型再生制动之间的区别，并阐明该法规主要针对单踏板模式的动能回收方面，该方面可以在不使用制动踏板的情况下使汽车完全停止。\n\n这些法规是对安全问题的回应，包括驾驶员将加速踏板误认为制动踏板的报告，以及研究表明习惯于单踏板驾驶的驾驶员的反应时间增加。推广该模式的特斯拉，也因此问题面临审查和召回。\n\n除了单踏板驾驶之外，新标准还规定，当再生制动减速度超过1.3米/秒²时，制动灯必须亮起，从而提高后方车辆的安全性。此外，所有新认证的乘用车车型都必须强制安装ABS（防抱死制动系统）。这些法规旨在平衡动能回收的益处与增强驾驶员和道路安全。"
  },
  {
    "id": "45210850",
    "title": "Behind the scenes of Bun Install",
    "url": "https://bun.com/blog/behind-the-scenes-of-bun-install",
    "summary": "This article delves into the reasons behind Bun's significantly faster package installation compared to npm, pnpm, and yarn. It argues that modern hardware capabilities have outpaced the I/O-centric optimizations of traditional Node.js-based package managers. The bottleneck is now system calls, the communication between a program and the operating system kernel.\n\nBun addresses this by treating package installation as a systems programming problem. Written in Zig, Bun bypasses the JavaScript engine overhead inherent in Node.js package managers, enabling direct system calls. This drastically reduces system calls and eliminates the complex pipeline of file reading in Node.js involving libuv and thread pools. Benchmarks demonstrate Bun's superior file processing speed.\n\nFurthermore, Bun employs optimizations like asynchronous DNS resolution on macOS using Apple's private API and binary manifest caching. Instead of storing manifests as JSON, which requires parsing on every install, Bun uses a binary format, reducing parsing overhead and memory usage by avoiding duplicate string storage. This leads to faster comparisons and overall improved performance. The reduced number of futex calls also indicates more efficient thread synchronization, avoiding delays. The result is a package manager that leverages OS-specific optimizations and minimizes system calls for drastically faster installation times.\n",
    "chinese_title": "Bun 安装幕后",
    "chinese_summary": "本文深入探讨了 Bun 相比 npm、pnpm 和 yarn 在软件包安装速度上显著更快的背后原因。它认为，现代硬件能力已经超越了传统基于 Node.js 的软件包管理器以 I/O 为中心的优化。现在的瓶颈在于系统调用，即程序与操作系统内核之间的通信。\n\nBun 通过将软件包安装视为一个系统编程问题来解决这个问题。Bun 使用 Zig 编写，绕过了 Node.js 软件包管理器中固有的 JavaScript 引擎开销，从而能够直接进行系统调用。 这大大减少了系统调用，并消除了 Node.js 中涉及 libuv 和线程池的复杂文件读取管道。 基准测试表明 Bun 具有卓越的文件处理速度。\n\n此外，Bun 还采用了诸如在 macOS 上使用 Apple 的私有 API 进行异步 DNS 解析和二进制清单缓存等优化。 Bun 不像传统方法那样将清单存储为 JSON，每次安装都需要解析，而是使用二进制格式，从而通过避免重复字符串存储来减少解析开销和内存使用。 这带来了更快的比较速度和整体性能的提高。 futex 调用次数的减少也表明线程同步更加高效，避免了延迟。 最终，软件包管理器利用了特定于操作系统的优化并最大限度地减少了系统调用，从而实现了更快的安装时间。"
  },
  {
    "id": "45214498",
    "title": "Adam (YC W25) Is Hiring to Build the Future of CAD",
    "url": "https://www.ycombinator.com/companies/adam/jobs/q6td4uk-founding-engineer",
    "summary": "Adam, a Y Combinator W25 company, is hiring a Founding Engineer to build the future of CAD with AI. They aim to revolutionize how engineers interact with CAD, allowing them to bring physical objects to life using AI.\n\nThe role involves developing new AI-driven CAD interfaces, designing and deploying full features, and working with the product team to create a seamless application experience. Adam is looking for someone with excellent engineering skills, a passion for models and design, and the ability to own problems end-to-end.\n\nThe interview process includes a coding challenge, talks with the CEO and a founding engineer, and an onsite paid work trial.\n\nAdam is building a state-of-the-art text-to-CAD interface, following a successful YC launch and a first product that made CAD accessible with AI. Now they are focused on enhancing the capabilities of engineers to create complex models compatible with industry-standard software. The company is comprised of a small team of engineers, designers, and researchers who are passionate about CAD and building things. The founders are experienced, with backgrounds from UC Berkeley and major AI startups.\n\nThe position is full-time, located in San Francisco, and offers a salary of $160K - $250K with 1.00% - 2.00% equity. Required skills include Next.js, JavaScript, React, TypeScript, Python, and SQL. Adam is seeking a US citizen/visa holder with at least 1 year of experience.\n",
    "chinese_title": "Adam (YC W25) 招贤纳士，共筑CAD未来",
    "chinese_summary": "Adam (Y Combinator W25 公司) 正在招聘一位创始工程师，利用人工智能构建 CAD 的未来。他们的目标是通过人工智能彻底改变工程师与 CAD 的交互方式，使他们能够将物理对象变为现实。\n\n该职位涉及开发新的 AI 驱动的 CAD 界面，设计和部署完整功能，并与产品团队合作创造无缝的应用体验。Adam 正在寻找具有卓越工程技能、对模型和设计充满热情，并且能够端到端解决问题的人。\n\n面试过程包括编码挑战、与 CEO 和创始工程师的对话，以及现场带薪工作试用。\n\nAdam 正在构建最先进的文本到 CAD 界面，此前他们成功地推出了 YC 产品，并推出了首款通过 AI 使 CAD 易于访问的产品。现在，他们专注于增强工程师创建与行业标准软件兼容的复杂模型的能力。公司由一支由工程师、设计师和研究人员组成的小团队组成，他们对 CAD 和构建事物充满热情。创始人经验丰富，拥有加州大学伯克利分校和主要人工智能初创公司的背景。\n\n该职位为全职，位于旧金山，提供 16 万美元至 25 万美元的薪资，以及 1.00% 至 2.00% 的股权。所需的技能包括 Next.js、JavaScript、React、TypeScript、Python 和 SQL。Adam 正在寻找具有至少 1 年经验的美国公民/签证持有者。"
  },
  {
    "id": "45223847",
    "title": "Man, 34, has tooth implanted in eye to restore his vision",
    "url": "https://www.today.com/health/men-s-health/tooth-in-eye-surgery-restores-vision-rcna230395",
    "summary": "Brent Chapman, 34, regained his vision after undergoing a rare \"tooth-in-eye\" surgery to correct severe corneal blindness. Chapman lost sight in his right eye due to Stevens-Johnson syndrome following a reaction to ibuprofen at age 13. Multiple cornea transplants failed due to the severity of the damage.\n\nThe tooth-in-eye procedure, known as osteo-odonto-keratoprosthesis, involves removing a patient's tooth (in Chapman's case, an upper canine), shaping it, and implanting a lens within it. This tooth-lens structure is then implanted under the patient's cheek for about 3 months for tissue to grow around it. Finally, the structure is surgically attached to the damaged eye, providing a clear window to the retina. The body accepts the tooth because it recognizes it as its own tissue, preventing rejection.\n\nAfter the surgery, Chapman’s vision improved to 20/40 or 20/30. He can now read, walk without a cane, and play basketball again. The surgery is considered life-changing for him, allowing him to make eye contact for the first time in 20 years. While there's a 50% chance he'll retain his current vision level in 30 years, studies show a high success rate for the lens remaining functional in the long term. Chapman is one of the first in Canada to have the surgery. The Bascom Palmer Eye Institute in Miami is the only center in the U.S. performing the procedure.\n",
    "chinese_title": "34岁男子牙齿植入眼球恢复视力",
    "chinese_summary": "34岁的布伦特·查普曼通过一种罕见的“牙齿入眼”手术，矫正了严重的角膜盲症，重获视力。 查普曼在13岁时因服用布洛芬后患上史蒂文斯-约翰逊综合征，导致右眼失明。 由于损伤严重，多次角膜移植均告失败。\n\n牙齿入眼手术，即骨牙角膜移植术，包括取出患者的牙齿（查普曼的情况是上犬齿），进行塑形，并在其中植入晶体。 然后，将这种牙齿-晶体结构植入患者的面颊下约3个月，以便组织在其周围生长。 最后，将该结构通过手术连接到受损的眼睛，为视网膜提供一个清晰的窗口。 身体会接受这颗牙齿，因为它将其识别为自身的组织，从而防止排斥。\n\n手术后，查普曼的视力提高到20/40或20/30。 他现在可以阅读、不用拐杖走路，并再次打篮球。 这项手术被认为改变了他的人生，使他20年来首次可以进行眼神交流。 虽然他在30年后保持目前视力水平的几率为50%，但研究表明，从长远来看，晶体保持功能的成功率很高。 查普曼是加拿大首批接受这种手术的人之一。 迈阿密的巴斯科姆·帕尔默眼科研究所是美国唯一一家进行该手术的中心。"
  },
  {
    "id": "45214933",
    "title": "Rails on SQLite: new ways to cause outages",
    "url": "https://andre.arko.net/2025/09/11/rails-on-sqlite-exciting-new-ways-to-cause-outages/",
    "summary": "André Arko's talk, \"Rails on SQLite: New Ways to Cause Outages,\" explores the advantages and pitfalls of using SQLite with modern Rails applications.  With Rails 8's Solid Cable, Cache, and Queue, SQLite simplifies deployment by eliminating the need for separate database, Redis, and file storage services.\n\nThe core difference is SQLite being in-process – the database is a single file accessed directly by the web server, removing connection errors. However, this introduces challenges: the database must reside in persistent storage (EBS, Volumes) to avoid data loss during restarts.  All data (models, cache, jobs) reside in this single file, simplifying management but potentially causing contention.\n\nScaling requires vertical scaling (larger servers) rather than horizontal scaling (more VMs). SQLite's default locking mechanism can create queues, addressed by the Write-Ahead Log (WAL), but WAL introduces multiple files needing coordinated backups.  Separate SQLite databases for ActiveRecord, cache, jobs, and even ActiveStorage can mitigate contention. Extreme sharding (one database per customer) is also a possibility.\n\nSingle-server architecture means downtime if the server fails and requires proxy-based load balancing.  Tools like Sequel and DuckDB facilitate database migration. Geographic limitations exist, although CDNs can still improve content delivery.\n\nFor backup and replication, Litestream streams write-ahead log entries to S3-compatible storage, enabling database restoration. LiteFS offers full replication using a FUSE-based filesystem, but introduces caveats such as stale reads and potential data loss.\n",
    "chinese_title": "在 SQLite 上运行 Rails：导致服务中断的新方法",
    "chinese_summary": "André Arko 的演讲《Rails on SQLite：引发故障的新方式》探讨了在现代 Rails 应用程序中使用 SQLite 的优势和陷阱。借助 Rails 8 的 Solid Cable、Cache 和 Queue，SQLite 通过消除对独立数据库、Redis 和文件存储服务的需求来简化部署。\n\n核心区别在于 SQLite 是进程内的——数据库是一个由 Web 服务器直接访问的单个文件，消除了连接错误。然而，这带来了挑战：数据库必须驻留在持久存储（EBS、卷）中，以避免重启期间的数据丢失。所有数据（模型、缓存、作业）都驻留在这个单个文件中，简化了管理，但也可能导致争用。\n\n扩展需要纵向扩展（更大的服务器），而不是横向扩展（更多的 VM）。SQLite 的默认锁定机制会创建队列，这可以通过预写日志 (WAL) 来解决，但 WAL 引入了需要协调备份的多个文件。为 ActiveRecord、缓存、作业，甚至 ActiveStorage 使用单独的 SQLite 数据库可以缓解争用。极端的碎片化（每个客户一个数据库）也是一种可能性。\n\n单服务器架构意味着如果服务器发生故障会停机，并且需要基于代理的负载平衡。Sequel 和 DuckDB 等工具可以促进数据库迁移。存在地理限制，尽管 CDN 仍然可以改善内容交付。\n\n对于备份和复制，Litestream 将预写日志条目流式传输到与 S3 兼容的存储，从而实现数据库恢复。LiteFS 提供使用基于 FUSE 的文件系统的完整复制，但引入了诸如陈旧读取和潜在数据丢失等注意事项。"
  },
  {
    "id": "45214164",
    "title": "Bulletproof host Stark Industries evades EU sanctions",
    "url": "https://krebsonsecurity.com/2025/09/bulletproof-host-stark-industries-evades-eu-sanctions/",
    "summary": "This article details how bulletproof hosting provider Stark Industries, a known source of Kremlin-linked cyberattacks and disinformation, evaded EU sanctions imposed in May 2025. The EU sanctioned PQ Hosting and its owners, the Neculiti brothers, Stark's main conduits to the internet, for supporting Russia's hybrid warfare.\n\nHowever, Stark Industries anticipated the sanctions and rebranded as the[.]hosting, managed by Dutch entity WorkTitans BV. The Neculiti brothers also transferred assets to PQ Hosting Plus S.R.L., a new Moldovan company linked to them.\n\nThe report highlights the involvement of MIRhosting, another Netherlands-based hosting provider, operated by Andrey Nesterenko. MIRhosting was identified in 2024 as a critical pillar of Stark's network and appears to be the new home for Stark Industries. Employees of MIRhosting manage both the[.]hosting and WorkTitans.\n\nWorkTitans BV, doing business as Misfits Media and WT Hosting, was founded by Youssef Zinad, linked to MIRhosting through LinkedIn activity and previous communication with Nesterenko. Zinad is also listed as the founder of the[.]hosting, hosted by PQ Hosting Plus S.R.L.\n\nThe article concludes that the EU sanctions were ineffective, as Stark's infrastructure remained operational, services were quickly re-established under new branding, and ownership was obfuscated.\n",
    "chinese_title": "防弹主机斯塔克工业避开欧盟制裁",
    "chinese_summary": "本文详细介绍了防弹主机提供商斯塔克工业（Stark Industries）如何规避欧盟于2025年5月实施的制裁。斯塔克工业是与克里姆林宫有关联的网络攻击和虚假信息的已知来源。欧盟制裁了PQ Hosting及其所有者Neculiti兄弟，他们是斯塔克工业连接互联网的主要渠道，因为他们支持俄罗斯的混合战争。\n\n然而，斯塔克工业预料到了制裁，并更名为the[.]hosting，由荷兰实体WorkTitans BV管理。Neculiti兄弟还将资产转移到了PQ Hosting Plus S.R.L.，这是一家与他们有关联的摩尔多瓦新公司。\n\n该报告强调了MIRhosting的参与，MIRhosting是另一家位于荷兰的主机提供商，由Andrey Nesterenko运营。MIRhosting在2024年被确定为斯塔克网络的重要支柱，并且似乎是斯塔克工业的新家。MIRhosting的员工管理着the[.]hosting和WorkTitans。\n\nWorkTitans BV以Misfits Media和WT Hosting的名义开展业务，由Youssef Zinad创立，通过LinkedIn活动和之前与Nesterenko的沟通，Youssef Zinad与MIRhosting有关联。Zinad也被列为the[.]hosting的创始人，该网站由PQ Hosting Plus S.R.L.托管。\n\n文章总结称，欧盟的制裁并未奏效，因为斯塔克的基础设施仍然在运行，服务在新的品牌下迅速重建，并且所有权被混淆。"
  },
  {
    "id": "45175099",
    "title": "Ten Years of D3D12",
    "url": "https://therealmjp.github.io/posts/ten-years-of-d3d12/",
    "summary": "This article reflects on the ten years since the release of Direct3D 12 (D3D12) with Windows 10. While D3D12 has been the longest-lasting major version, it has received numerous updates. These include significant features such as DXR and Work Graphs, alongside smaller enhancements and HLSL updates.\n\nThe article then dives into specific additions to the core D3D12 API:\n\n*   **Programmable Sample Points:** Allows custom MSAA subsample positions, useful for niche cases and software VRS.\n*   **View Instancing:** Facilitates stereo rendering for VR/3D by instancing draws and providing a view ID to shaders.\n*   **Depth Bounds Test:** Allows setting depth bounds for pixel depth tests, useful for older deferred rendering techniques.\n*   **Variable Rate Shading (VRS):** Reduces pixel shader thread count by varying the shading rate per draw, primitive, or tile.\n*   **Relaxed Format Casting:** Removes the need for TYPELESS formats when creating multiple compatible views of a texture.\n*   **Directly Writing To Block-Compressed Formats:** Enables direct writing to BC-formatted textures via UAVs, eliminating intermediary copies.\n*   **Writable R9G9B9E5 Textures:** Allows GPUs to directly write to the R9G9B9E5 format through RTVs or typed UAVs, potentially offering higher precision than R11G11B10 in specific scenarios.\n*   **WriteBufferImmediate and OpenExistingHeapFromAddress:** APIs for gathering debugging information (\"breadcrumbs\") when the GPU crashes.\n*   **GPU Upload Heaps:** Leverages Resizable BAR to allow the CPU to directly update resources in VRAM without GPU copies.\n*   **ExecuteIndirect Incrementing Constant:** Provides an implicit incrementing constant buffer value to shaders for each draw or dispatch.\n*   **Sampler Feedback:** Lets developers determine which texels were accessed, useful for sparse virtual textures.\n\nThe article notes the complexities and limitations of some features, and how they are supported by different hardware vendors.\n",
    "chinese_title": "D3D12十年",
    "chinese_summary": "本文回顾了Windows 10发布以来Direct3D 12 (D3D12)的十年历程。D3D12是历时最长的主版本，并获得了多次更新，包括DXR和Work Graphs等重要功能，以及较小的增强功能和HLSL更新。\n\n接下来，本文深入探讨了D3D12 API的核心新增功能：\n\n*   **可编程采样点:** 允许自定义MSAA子采样位置，适用于特殊情况和软件VRS。\n*   **视口实例化:** 通过实例化绘制并向着色器提供视图ID，从而促进VR/3D的立体渲染。\n*   **深度范围测试:** 允许设置像素深度测试的深度范围，适用于较旧的延迟渲染技术。\n*   **可变速率着色 (VRS):** 通过改变每个绘制、图元或瓦片的着色率来减少像素着色器线程数。\n*   **放宽格式转换:** 创建纹理的多个兼容视图时，不再需要TYPELESS格式。\n*   **直接写入块压缩格式:** 允许通过UAV直接写入BC格式纹理，从而消除中间复制。\n*   **可写R9G9B9E5纹理:** 允许GPU通过RTV或类型化的UAV直接写入R9G9B9E5格式，在特定情况下可能提供比R11G11B10更高的精度。\n*   **WriteBufferImmediate和OpenExistingHeapFromAddress:** 用于在GPU崩溃时收集调试信息（“面包屑”）的API。\n*   **GPU上传堆:** 利用Resizable BAR，允许CPU直接更新VRAM中的资源，而无需GPU复制。\n*   **ExecuteIndirect递增常量:** 为每次绘制或分派向着色器提供隐式递增的常量缓冲区值。\n*   **采样器反馈:** 允许开发者确定访问了哪些纹素，适用于稀疏虚拟纹理。\n\n文章指出了一些功能的复杂性和局限性，以及不同硬件厂商对这些功能的支持情况。"
  },
  {
    "id": "45211596",
    "title": "Gene-edited pancreatic cells transplanted into a patient with type 1 diabetes",
    "url": "https://www.wired.com/story/no-more-injections-crispr-offers-new-hope-for-treating-diabetes/",
    "summary": "This WIRED article discusses a promising development in type 1 diabetes treatment: the successful implantation of gene-edited pancreatic cells into a patient. Researchers used CRISPR-Cas12b technology to modify islet cells from a deceased donor, making them \"hypoimmune\" or invisible to the recipient's immune system. This eliminated the need for immunosuppressant drugs, which carry significant risks.\n\nThe study, published in The New England Journal of Medicine, details how the edited cells were implanted into the patient's forearm. After 12 weeks, no rejection signs were observed, and the cells were confirmed to be functional, secreting insulin in response to glucose levels. This represents a major step towards controlling diabetes without insulin injections.\n\nWhile only one patient was involved and the cell dosage was low, the research's significance lies in the potential of immune-camouflaging gene edits. The long-term goal is to apply these edits to stem cells, which can then differentiate into insulin-secreting islet cells. This could offer a regenerative medicine solution for type 1 diabetes.\n\nDespite some criticisms regarding the replicability of the results and the current study's limitations, the findings represent a promising advancement in the field, offering hope for future clinical trials and ultimately, a potential cure for type 1 diabetes. Sana Biotechnology, the company that developed the treatment, plans to conduct further trials next year.\n",
    "chinese_title": "基因编辑的胰腺细胞移植到一名1型糖尿病患者体内",
    "chinese_summary": "基因编辑胰腺细胞植入为1型糖尿病治疗带来希望"
  },
  {
    "id": "45211527",
    "title": "From burner phones to decks of cards: NYC teens adjusting to the smartphone ban",
    "url": "https://gothamist.com/news/from-burner-phones-to-decks-of-cards-nyc-teens-are-adjusting-to-the-smartphone-ban",
    "summary": "The article explores how New York City teens are adjusting to the recent statewide smartphone ban in schools. Students are finding creative ways to cope with disconnected days, turning to lower-tech alternatives like Polaroid cameras, walkie-talkies, decks of cards, and even transistor radios. Some are using older technology like \"digicams\" and exploring the use of MP3 players. The ban seems to be encouraging more socializing and face-to-face interaction among students, with hallways and lunchrooms becoming more lively.\n\nDespite the ban, some students are finding workarounds, such as using \"fake phones,\" communicating via Google Docs, and taking phone breaks outside the building. Mayor Adams acknowledged these efforts as part of teenagers' \"creative spirit.\"\n\nSchools are employing various strategies, like collecting phones or using magnetic pouches, which have led to challenges like long lines and students being late to class. While some students express concerns about the ban interfering with activities like college applications, others recognize its potential benefits in reducing phone addiction and increasing engagement. Overall, the article portrays a mixed reaction to the ban, with students and educators observing both positive and negative consequences and adapting in different ways.\n",
    "chinese_title": "从一次性手机到纸牌：纽约青少年适应智能手机禁令",
    "chinese_summary": "纽约青少年如何适应学校智能手机禁令：学生们正寻找应对“失联”的创造性方法，包括使用拍立得相机、对讲机、纸牌甚至晶体管收音机。一些人开始使用旧技术如“数码相机”和MP3播放器。禁令似乎鼓励了更多的社交和面对面交流，走廊和餐厅也变得更加热闹。\n\n尽管有禁令，一些学生仍在寻找替代方案，例如使用“假手机”、通过Google Docs交流以及在校外休息时使用手机。市长亚当斯认为这些努力是青少年“创造精神”的一部分。\n\n学校正在采取各种策略，例如收缴手机或使用磁性袋，但这导致了排长队和学生上课迟到等问题。虽然一些学生担心禁令会影响大学申请等活动，但另一些人则认识到它在减少手机成瘾和提高参与度方面的潜在好处。总的来说，本文描绘了对禁令的复杂反应，学生和教育工作者都观察到了积极和消极的后果，并以不同的方式进行适应。"
  },
  {
    "id": "45165529",
    "title": "XFN – XHTML Friends Network (2003)",
    "url": "https://gmpg.org/xfn/",
    "summary": "XFN (XHTML Friends Network) is a straightforward method, introduced in 2003, for representing human relationships through hyperlinks on the web. Primarily intended for use in blogrolls, XFN allows web authors to define their relationships with linked individuals by adding a \"rel\" attribute to `<a href>` tags, such as `<a href=\"http://jeff.example.org\" rel=\"friend met\">`.\n\nThe XFN website provides information on using and implementing this system. It includes an introduction with examples, styling suggestions, and future potential use cases. It also offers a guide for getting started with XFN in four steps, a profile defining the values used in the \"rel\" attribute, and background information outlining the design choices made during XFN's development.\n\nFurther resources include a frequently asked questions section, a collection of XFN tools like the XFN Creator, and guides on integrating XFN with social networks and other technologies. The site also highlights examples of XFN usage, suggests ways to contribute to the project, and lists press articles referencing XFN. Finally, it expresses gratitude to contributors and invites feedback from users. XFN is copyrighted by GMPG, with some rights reserved.\n",
    "chinese_title": "XFN – XHTML 朋友网络 (2003)",
    "chinese_summary": "XFN (XHTML 友人网络) 是一种直接的方法，于2003年引入，用于通过网络上的超链接表示人际关系。 XFN 主要用于博客链接，允许网站作者通过向 `<a href>` 标签添加 \"rel\" 属性来定义与链接个人的关系，例如 `<a href=\"http://jeff.example.org\" rel=\"friend met\">`。\n\nXFN 网站提供了关于使用和实施此系统的信息，包括带有示例的介绍、样式建议和未来潜在的用例。 它还提供了一个四步入门 XFN 指南、一个定义 \"rel\" 属性中使用的值的配置文件，以及概述 XFN 开发期间的设计选择的背景信息。\n\n其他资源包括常见问题解答、XFN 工具（如 XFN Creator）的集合，以及关于将 XFN 与社交网络和其他技术集成的指南。 该网站还重点介绍了 XFN 使用示例，提出了为项目做出贡献的方法，并列出了引用 XFN 的新闻文章。 最后，它对贡献者表示感谢，并邀请用户提供反馈。 XFN 的版权归 GMPG 所有，保留部分权利。"
  },
  {
    "id": "45223432",
    "title": "Comcast Executives Warn Workers to Not Say the Wrong Thing About Charlie Kirk",
    "url": "https://www.404media.co/comcast-nbcuniversal-email-charlie-kirk/",
    "summary": "This article from 404 Media reports on a company-wide email sent by Comcast executives to NBCUniversal employees following the death of right-wing pundit Charlie Kirk. The email, signed by Brian Roberts, Mike Cavanagh, and Mark Lazarus, mourns Kirk, describing him as an \"advocate for open debate\" and emphasizing the importance of unity.\n\nThe email also alludes to the firing of MSNBC political analyst Matthew Dowd, who made critical comments about Kirk's legacy on air, linking his rhetoric to hateful actions. The executives emphasize that such coverage was \"at odds with fostering civil dialogue\" and warned employees to be respectful of differing viewpoints. They stated that employees are expected to embody company values in their work and communities by engaging with respect, listening, and treating people with kindness.\n\nThe article criticizes the mainstream media's efforts to \"sanitize\" Kirk's legacy, which it characterizes as including harassment and the normalization of denying basic human rights to people. Sam Cole, the author, is seeking information on how other companies are addressing the issue of political speech following Kirk's death.\n",
    "chinese_title": "康卡斯特高管警告员工不要对查理·柯克发表不当言论",
    "chinese_summary": "404 Media的这篇文章报道了康卡斯特高管在右翼评论员查理·柯克去世后，向NBC环球员工发送的一封公司内部邮件。这封由布莱恩·罗伯茨、迈克·卡瓦纳和马克·拉扎勒斯署名的邮件对柯克的去世表示哀悼，称他为“公开辩论的倡导者”，并强调了团结的重要性。\n\n该邮件还暗示了MSNBC政治分析师马修·道德被解雇一事，道德曾在节目中对柯克的遗产发表批评性评论，将他的言论与仇恨行为联系起来。高管们强调，这种报道“与促进文明对话背道而驰”，并警告员工要尊重不同的观点。他们表示，员工应通过尊重、倾听和善待他人，在工作和社区中体现公司的价值观。\n\n文章批评了主流媒体试图“美化”柯克遗产的做法，文章将其定义为包括骚扰和将剥夺人们基本人权的正常化。作者山姆·科尔正在寻求有关其他公司如何在柯克去世后处理政治言论问题的信息。"
  },
  {
    "id": "45217461",
    "title": "Revanced Team Gets DMCA from Spotify",
    "url": "https://revanced.app/announcements/15-spotify-dmca-notice-seeking-legal-help",
    "summary": "The ReVanced Team, developers of the popular ReVanced patching tool that allows users to customize Android apps, have received a DMCA takedown notice from Spotify. This notice specifically targets the modifications and patches made to the Spotify app through ReVanced.\n\nThe announcement states that Spotify's legal team alleges the modifications infringe upon their copyright. The exact specifics of the alleged infringement are not detailed in the announcement, but generally, these types of claims focus on circumventing Spotify's DRM (Digital Rights Management), modifying the app's intended functionality (e.g., ad blocking), or accessing premium features without a subscription.\n\nAs a result of the DMCA notice, the ReVanced Team has removed all Spotify-related patches and modifications from their platform to comply with the law and avoid potential legal repercussions. They are actively seeking legal assistance and guidance to understand the full implications of the DMCA notice and explore potential options.\n\nThe team emphasizes their commitment to respecting intellectual property rights but also highlights the community's interest in customization and personalization. The future of ReVanced's compatibility with Spotify remains uncertain pending legal review and potential negotiations with Spotify. The team is keeping the community updated on their progress and soliciting any relevant legal expertise.\n",
    "chinese_title": "Revanced团队收到Spotify的DMCA通知",
    "chinese_summary": "ReVanced团队，即热门Android应用自定义工具ReVanced补丁的开发者，收到了来自Spotify的DMCA移除通知。该通知特别针对通过ReVanced对Spotify应用进行的修改和补丁。\n\n公告称，Spotify的法律团队声称这些修改侵犯了他们的版权。公告中并未详细说明涉嫌侵权的细节，但通常这类声明都集中在规避Spotify的DRM（数字版权管理）、修改应用的预期功能（例如，广告拦截）或在未订阅的情况下访问高级功能。\n\n由于DMCA通知，ReVanced团队已从其平台上删除了所有与Spotify相关的补丁和修改，以遵守法律并避免潜在的法律影响。他们正在积极寻求法律援助和指导，以了解DMCA通知的全部含义并探索潜在的解决方案。\n\n该团队强调他们致力于尊重知识产权，但也强调了社区对定制和个性化的兴趣。在法律审查和与Spotify的潜在谈判之前，ReVanced与Spotify的兼容性的未来仍然不确定。该团队正在不断更新社区的进展，并征求任何相关的法律专业知识。"
  },
  {
    "id": "45211868",
    "title": "Conway's Game of Life, but musical",
    "url": "https://www.hudsong.dev/digital-darwin",
    "summary": "This article explores the fascinating parallels between musical evolution and biological systems, using Conway's Game of Life as a central analogy. The author describes building a \"melody breeder,\" a digital tool allowing users to evolve melodies by selecting and breeding their favorites, mirroring Richard Dawkins' \"memes\" concept and Savage et al.'s research on predictable patterns in musical evolution.\n\nThe author then showcases a musical interpretation of Conway's Game of Life, where cell births and deaths trigger harmonic and complementary tones, respectively, creating evolving and unpredictable music. This demonstrates how simple rules can generate complex structures, similar to how biological systems and musical compositions emerge.\n\nThe article extends this analogy to cultural phenomena like the Labubu toy craze, demonstrating how its spread mirrors epidemiological models, suggesting universal patterns in information dissemination. The author uses Google Trends data to visualize this. Drawing on Darwin's concept of \"endless forms most beautiful\" and Boyd & Richerson's view of culture as a shared pool of innovation, the piece posits that cultural evolution, be it music or memes, thrives on patterns that capture our attention. The author concludes by highlighting the empowering role of code in transforming abstract ideas into tangible, interactive experiences.\n",
    "chinese_title": "康威生命游戏，但具音乐性",
    "chinese_summary": "本文探讨了音乐进化与生物系统之间引人入胜的相似之处，并以康威生命游戏作为核心类比。作者描述了如何构建一个“旋律繁殖器”，一种允许用户通过选择和繁殖他们最喜欢的旋律来进化音乐的数字工具，这与理查德·道金斯的“模因”概念以及Savage等人关于音乐进化中可预测模式的研究相呼应。\n\n然后，作者展示了康威生命游戏的音乐诠释，其中细胞的诞生和死亡分别触发和谐与互补的音调，从而创造出不断进化且不可预测的音乐。这表明简单的规则如何产生复杂的结构，类似于生物系统和音乐作品的出现方式。\n\n本文将这种类比扩展到像Labubu玩具热潮这样的文化现象，展示了它的传播如何反映流行病学模型，暗示了信息传播中的普遍模式。作者使用Google Trends数据来可视化这一点。借鉴达尔文“最美丽的无尽形式”的概念以及博伊德和理查森将文化视为共享创新池的观点，本文认为，文化进化，无论是音乐还是模因，都依赖于那些能够抓住我们注意力的模式而蓬勃发展。作者最后强调了代码在将抽象想法转化为有形的、互动式体验方面的赋权作用。"
  },
  {
    "id": "45196945",
    "title": "Show HN: Small Transfers – charge from 0.000001 USD per request for your SaaS",
    "url": "https://smalltransfers.com/",
    "summary": "This \"Show HN\" post introduces \"Small Transfers,\" a service that allows SaaS businesses to charge extremely small amounts (down to $0.000001 USD) per API request or service usage. This opens up possibilities for micro-billing models, where users pay only for what they consume, avoiding subscription fees or large upfront costs.\n\nThe key benefit highlighted is the granularity of pricing. Instead of offering tiered pricing plans, businesses can precisely charge for the value delivered with each request, potentially attracting users who are deterred by traditional pricing structures.\n\nThe \"Loading...\" content suggests that the post likely contains more details about the service's implementation, API, use cases, and possibly a link to a website or documentation. It might also include information about the underlying technology enabling such small transactions, such as payment processors or blockchain solutions. Without the full content, the specific technical details and implementation are unknown, but the core offering is clear: extremely granular, usage-based pricing for SaaS services.\n",
    "chinese_title": "Show HN: 小额转账 – SaaS服务每次请求收费0.000001美元起",
    "chinese_summary": "这个“Show HN”帖子介绍“Small Transfers”服务，该服务允许SaaS企业对每次API请求或服务使用收取极小金额（低至0.000001美元）。这为微计费模式开辟了可能性，用户只需为他们消费的内容付费，避免了订阅费或大额前期成本。\n\n强调的关键优势是定价的精细度。企业可以精确地为每次请求所提供的价值收费，而不是提供分级定价方案，这可能会吸引那些因传统定价结构而望而却步的用户。\n\n“加载中……”的内容表明该帖子可能包含有关该服务实施、API、用例的更多详细信息，以及可能指向网站或文档的链接。它还可能包含有关支持如此小额交易的底层技术的信息，例如支付处理器或区块链解决方案。在没有完整内容的情况下，具体的的技术细节和实施方案是未知的，但核心产品是明确的：针对SaaS服务的极其精细的、基于使用量的定价。"
  },
  {
    "id": "45213299",
    "title": "NT OS Kernel Information Disclosure Vulnerability",
    "url": "https://www.crowdfense.com/nt-os-kernel-information-disclosure-vulnerability-cve-2025-53136/",
    "summary": "This article details a newly discovered kernel information disclosure vulnerability, CVE-2025-53136, in NT OS, specifically affecting Windows versions 24H2 and later. The vulnerability allows an attacker to leak kernel addresses, making exploitation easier despite Microsoft's previous mitigations against such leaks via `NtQuerySystemInformation`.\n\nThe author, hieu.q, discovered the bug while analyzing the patch for CVE-2024-43511, a TOCTOU race condition. The new vulnerability arises in the `RtlSidHashInitialize` function, where a pointer from the `TOKEN` structure (kernel address) is temporarily stored in a user-controlled buffer. By winning a race condition between reading the user-buffer and the function overwriting it, an attacker can leak the kernel address. The vulnerability is triggered via the `NtQueryInformationToken` syscall with the `TokenAccessInformation` class.\n\nThis leak is significant because previous methods for leaking kernel addresses have been patched in newer Windows versions. The bug can be exploited from Low IL or AppContainer contexts. When chained with a \"write-what-where\" bug to overwrite the `Privileges` field of the `TOKEN` object, it can lead to complete Local Privilege Escalation (LPE). The author successfully demonstrated the exploit on a Windows Insider Preview from Low IL and AppContainer contexts.\n\nThe article also outlines the disclosure timeline with Microsoft, including an initial misclassification of the bug as a duplicate before it was finally acknowledged and assigned CVE-2025-53136. The author emphasizes the importance of thorough patch analysis and careful code modification to prevent the introduction of new vulnerabilities.\n",
    "chinese_title": "NT操作系统内核信息泄露漏洞",
    "chinese_summary": "本文详细介绍了一个新发现的内核信息泄露漏洞，CVE-2025-53136，存在于NT OS中，尤其影响Windows 24H2及更高版本。该漏洞允许攻击者泄露内核地址，即便微软先前通过`NtQuerySystemInformation`缓解了此类泄露，也使得利用变得更容易。\n\n作者hieu.q在分析CVE-2024-43511（一个TOCTOU竞争条件漏洞）的补丁时发现了该漏洞。 新漏洞出现在`RtlSidHashInitialize`函数中，该函数将来自`TOKEN`结构的指针（内核地址）临时存储在用户可控的缓冲区中。 通过赢得读取用户缓冲区和函数覆盖它之间的竞争条件，攻击者可以泄露内核地址。该漏洞通过使用`TokenAccessInformation`类的`NtQueryInformationToken`系统调用触发。\n\n这种泄露意义重大，因为较新Windows版本中已修补了先前泄露内核地址的方法。 该漏洞可以从低完整性级别（Low IL）或AppContainer上下文中利用。当与“任意地址写”漏洞链接以覆盖`TOKEN`对象的`Privileges`字段时，它可能导致完整的本地权限提升（LPE）。作者已成功在来自低完整性级别和AppContainer上下文的Windows Insider Preview版本上演示了该漏洞的利用。\n\n本文还概述了与微软的披露时间线，包括最初错误地将该漏洞归类为重复漏洞，之后最终被承认并分配了CVE-2025-53136。 作者强调了彻底的补丁分析和谨慎的代码修改对于防止引入新漏洞的重要性。"
  },
  {
    "id": "45214159",
    "title": "A Web Framework for Zig",
    "url": "https://www.jetzig.dev/",
    "summary": "Jetzig is a new, MIT-licensed web framework written in Zig, designed for building RESTful APIs and web applications with a focus on speed and ease of use. It offers file-based routing that maps directly to Zig functions and supports HTML templating using Zmpl, offering layouts, partials, inheritance, and static content rendering. By default, endpoints render JSON, simplifying API development.\n\nKey features include:\n\n*   **Performance:** Built on `http.zig` for efficient and scalable operation.\n*   **Tooling:** CLI tools for project creation and component management.\n*   **Middleware:** Customizable middleware chain for request/response manipulation, including built-in support for htmx.\n*   **Sessions:** Out-of-the-box support for cookies, user sessions, and header management.\n*   **Database Layer:** JetQuery provides a powerful and flexible database interaction layer.\n\nJetzig is open source and community-driven, with an active Discord server for support. Documentation and examples are available to help users get started.\n",
    "chinese_title": "Zig 的 Web 框架",
    "chinese_summary": "Jetzig 是一个使用 Zig 编写的全新、MIT 许可的 Web 框架，专为构建 RESTful API 和 Web 应用程序而设计，注重速度和易用性。它提供基于文件的路由，直接映射到 Zig 函数，并支持使用 Zmpl 的 HTML 模板，提供布局、局部模板、继承和静态内容渲染。默认情况下，端点渲染 JSON，从而简化 API 开发。\n\n主要功能包括：\n\n*   **性能：** 构建于 `http.zig` 之上，实现高效且可扩展的运行。\n*   **工具：** CLI 工具，用于项目创建和组件管理。\n*   **中间件：** 可定制的中间件链，用于请求/响应处理，包括对 htmx 的内置支持。\n*   **会话：** 开箱即用的 cookie、用户会话和标头管理支持。\n*   **数据库层：** JetQuery 提供强大而灵活的数据库交互层。\n\nJetzig 是开源且社区驱动的，拥有活跃的 Discord 服务器提供支持。文档和示例可帮助用户快速入门。"
  },
  {
    "id": "45213732",
    "title": "‘Robber bees’ invade apiarist’s shop in attempted honey heist",
    "url": "https://www.cbc.ca/news/canada/british-columbia/robber-bees-terrace-bc-apiary-1.7627532",
    "summary": "In Terrace, B.C., beekeeper Christine McDonald of Rushing River Apiaries experienced an unusual \"robbery\" when thousands of \"robber bees\" invaded her shop in late August, seeking honey due to dwindling natural resources. This is the first time McDonald has seen robber bees targeting her indoor shop, a situation that initially frightened her. These bees, driven by scarcity in late summer and early fall, typically attack weaker beehives to steal honey.\n\nThe bees gained entry through cracks in the shop door, and after finding a food source, likely used a \"waggle dance\" to inform other bees. McDonald managed to save most of her honey and equipment by covering them with tarps and lids. She then cleverly trapped the bees in her bathroom using light as a lure and later released them, but it took several days for them to stop returning.\n\nHoneybee scientist Alison McAfee explains that robber bee behavior is common when nectar-producing flowers become scarce and bee populations peak, leading some colonies to invade weaker ones. She also highlights that wasps can similarly target honeybee colonies for sugary substances. McDonald believes the bees' desperation is higher this year due to prolonged heat. She advises other beekeepers to ensure their bees are well-fed to prevent robbing behavior.\n",
    "chinese_title": "“强盗蜂”入侵养蜂人商店，企图盗取蜂蜜",
    "chinese_summary": "在卑诗省特勒斯，Rushing River Apiaries的养蜂人克里斯汀·麦克唐纳在八月末经历了一场罕见的“抢劫”——数千只“盗蜂”入侵了她的商店，因自然资源匮乏而寻觅蜂蜜。这是麦克唐纳首次看到盗蜂以她室内商店为目标，最初的情况让她感到害怕。这些蜜蜂在夏末和初秋因资源稀缺而驱使，通常会攻击较弱的蜂箱以窃取蜂蜜。\n\n这些蜜蜂通过商店门上的裂缝进入，在找到食物来源后，可能使用了“摇摆舞”来告知其他蜜蜂。麦克唐纳通过用防水布和盖子盖住大部分蜂蜜和设备来保护它们。然后，她巧妙地利用光作为诱饵将蜜蜂困在浴室里，之后将它们释放，但它们花了几天时间才停止返回。\n\n蜜蜂科学家艾莉森·麦卡菲解释说，当产蜜花朵变得稀少，蜜蜂数量达到顶峰时，盗蜂行为很常见，导致一些蜂群入侵较弱的蜂群。她还强调，黄蜂也可能以蜜蜂的蜂群为目标，寻找含糖物质。麦克唐纳认为，由于持续的高温，今年蜜蜂的迫切程度更高。她建议其他养蜂人确保他们的蜜蜂得到充分喂养，以防止抢劫行为。"
  },
  {
    "id": "45208925",
    "title": "GrapheneOS accessed Android security patches but not allowed to publish sources",
    "url": "https://grapheneos.social/@GrapheneOS/115164133992525834",
    "summary": "The GrapheneOS Mastodon post states they have early access to the Android Security Bulletin. This implies GrapheneOS receives security patches and vulnerability information from Google before they are publicly released. However, the title mentions they are \"not allowed to publish sources,\" which suggests a restriction on how GrapheneOS can utilize or share this information. This likely means that while they can incorporate the security patches into their operating system, they are prohibited from publicly releasing the source code related to those patches before Google officially does. This arrangement allows GrapheneOS to address security vulnerabilities promptly but within the confines of their agreement with Google regarding information disclosure.\n",
    "chinese_title": "GrapheneOS 获取了安卓安全补丁，但不允许发布源代码。",
    "chinese_summary": "GrapheneOS的Mastodon帖子称他们可以提前访问安卓安全公告。这暗示GrapheneOS在公开披露前，从谷歌收到安全补丁和漏洞信息。然而，标题提到他们“不允许发布源代码”，这表明对GrapheneOS如何利用或分享这些信息存在限制。这可能意味着虽然他们可以将安全补丁整合到他们的操作系统中，但他们被禁止在谷歌正式发布之前公开与这些补丁相关的源代码。这种安排使GrapheneOS能够及时解决安全漏洞，但需要在与谷歌关于信息披露的协议框架内进行。"
  },
  {
    "id": "45165415",
    "title": "Show HN: C++ Compiler Support Page",
    "url": "https://cppstat.dev",
    "summary": "cppstat is a website dedicated to tracking the support status of C++ features across different compilers and standard libraries. It provides a searchable table indicating whether a specific C++ feature is fully supported (green), partially supported (orange), or not yet supported (red) by GCC, Clang, MSVC, and Xcode. The site distinguishes between language and library features, allowing users to filter accordingly. Clicking on compiler names reveals further details about release dates and reasons for partial support.\n\nThe information is regularly updated, with the latest update mentioned as September 12, 2025. Users are encouraged to report inaccuracies or missing information.\n\nThe main content is a table listing features planned for C++26 along with their corresponding paper number(s) and support status for each compiler. The table covers a wide array of features, including reflection capabilities, standard library hardening, constexpr enhancements, additions to the `<simd>` header, improvements to exception handling, and new library features like `std::mdspan`, `std::observable`, and enhancements to formatting and string handling. The table provides a comprehensive overview of the current implementation status of proposed C++26 features across different toolchains.\n",
    "chinese_title": "Show HN: C++ 编译器支持页面",
    "chinese_summary": "cppstat 是一个致力于追踪不同编译器和标准库对 C++ 特性支持情况的网站。它提供了一个可搜索的表格，指示特定 C++ 特性是否被 GCC、Clang、MSVC 和 Xcode 完全支持（绿色）、部分支持（橙色）或尚未支持（红色）。该网站区分语言和库特性，允许用户进行相应筛选。点击编译器名称可显示关于发布日期和部分支持原因的更多详细信息。\n\n信息定期更新，最新更新时间为 2025 年 9 月 12 日。鼓励用户报告不准确或缺失的信息。\n\n主要内容是一个表格，列出了计划用于 C++26 的特性及其对应的论文编号，以及每个编译器的支持状态。该表格涵盖了广泛的特性，包括反射功能、标准库强化、constexpr 增强、对 `<simd>` 头的添加、异常处理的改进以及新的库特性，如 `std::mdspan`、`std::observable` 以及对格式化和字符串处理的增强。该表格全面概述了不同工具链中已提议的 C++26 特性的当前实现状态。"
  },
  {
    "id": "45216805",
    "title": "Danish supermarket chain is setting up \"Emergency Stores\"",
    "url": "https://swiss.social/@swaldorff/115186445638788782",
    "summary": "The summary of the article \"Danish supermarket chain is setting up 'Emergency Stores'\" is unfortunately incomplete. The provided text only contains the title and the beginning of a Mastodon post by Svend Waldorff mentioning the interesting development of a Danish supermarket chain setting up \"Emergency Stores.\" Due to the missing content after \"settin...\", it's impossible to understand the purpose, concept, or specifics of these \"Emergency Stores,\" nor the supermarket chain involved. The rest of the text refers to the Javascript requirement for the Mastodon website and the suggestion to use a Mastodon app. Therefore, without more context, a proper summary cannot be provided.\n",
    "chinese_title": "丹麦连锁超市设立“应急商店”",
    "chinese_summary": "关于文章“丹麦连锁超市开设‘应急商店’”的摘要信息不完整。提供的文本仅包含标题和 Svend Waldorff 在 Mastodon 上发布的帖子开头，提到了一个有趣的动态，即丹麦连锁超市正在开设“应急商店”。由于“settin...”之后的内容缺失，因此无法理解这些“应急商店”的目的、概念或具体细节，也无法了解涉及的连锁超市。文本的其余部分提到了 Mastodon 网站对 Javascript 的要求，并建议使用 Mastodon 应用程序。因此，在没有更多上下文的情况下，无法提供完整的摘要。"
  },
  {
    "id": "45223504",
    "title": "MIT software tool turns everyday objects into animated, eye-catching displays",
    "url": "https://news.mit.edu/2025/fabobscura-turns-everyday-objects-into-animated-displays-0910",
    "summary": "MIT researchers have developed FabObscura, a software tool that simplifies the creation of barrier-grid animations (scanimations) without the need for electronics. These animations create the illusion of movement by sliding a patterned sheet across a specially prepared image, making everyday objects into dynamic displays.\n\nFabObscura allows users to design unconventional barrier patterns (zigzags, circles, etc.) by inputting mathematical functions, offering more creative freedom than existing tools that primarily focus on straight lines. The software supports various user interactions, including viewpoint-dependent displays and animations triggered by sliding or rotating the barrier. Users can upload animation frames or select from preset sequences and then print the barrier and image using a standard 2D printer.\n\nThe system also allows for \"nested animations,\" where different movements of the barrier reveal different animated sequences. While nested animations offer enhanced dynamism, the researchers acknowledge that they can compromise visual quality. They provide design guidelines to mitigate these issues, such as using fewer frames and high-contrast images.\n\nPotential applications for FabObscura include enhancing household items, creating dynamic art pieces, and developing reconfigurable signage. Future plans involve expanding the system to support video uploads and exploring the creation of 3D barrier-grid animations. The research highlights the potential to democratize animation creation, enabling users to transform ordinary objects into captivating, low-power displays.\n",
    "chinese_title": "麻省理工软件工具将日常物品变成引人注目的动画显示器",
    "chinese_summary": "麻省理工学院研究人员开发了FabObscura，这是一种无需电子设备即可简化栅栏网格动画（扫描动画）创建的软件工具。这些动画通过滑动图案化的片材穿过特殊准备的图像来产生运动错觉，使日常物品变成动态显示器。\n\nFabObscura允许用户通过输入数学函数来设计非常规的栅栏图案（锯齿形、圆形等），与主要关注直线的现有工具相比，提供了更大的创作自由。该软件支持各种用户交互，包括视角依赖型显示和由滑动或旋转栅栏触发的动画。用户可以上传动画帧或从预设序列中选择，然后使用标准2D打印机打印栅栏和图像。\n\n该系统还允许“嵌套动画”，其中栅栏的不同运动会显示不同的动画序列。虽然嵌套动画提供了增强的动态性，但研究人员承认它们可能会损害视觉质量。他们提供了设计指南来缓解这些问题，例如使用较少的帧和高对比度图像。\n\nFabObscura的潜在应用包括增强家居用品、创作动态艺术品和开发可重构的标牌。未来的计划包括扩展系统以支持视频上传，并探索创建3D栅栏网格动画。该研究突出了动画创作大众化的潜力，使用户能够将普通物品转化为引人入胜的低功耗显示器。"
  },
  {
    "id": "45222622",
    "title": "Eating Oysters against the climate catastrophy",
    "url": "https://www.pnas.org/doi/10.1073/pnas.2504004122",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "食用牡蛎对抗气候灾难",
    "chinese_summary": "无法访问该文章链接。"
  },
  {
    "id": "45209558",
    "title": "Reshaped is now open source",
    "url": "https://reshaped.so/blog/reshaped-oss",
    "summary": "Dima Belyaev has announced that Reshaped, a component library for React and Figma, is now fully open source. Belyaev initially created Reshaped to address the common needs of web development, focusing on aligning design and engineering while tackling UI challenges like theming and dark mode. Previously, Reshaped operated on a paid license model, which allowed for focused support and development. Two years ago, the React package became free.\n\nNow, the complete React library source code is available on GitHub, and the Figma library is available in the Figma Community. Belyaev hopes this move will facilitate knowledge sharing between design and engineering communities. He also plans to share behind-the-scenes insights into new feature implementations, particularly concerning integration with new Figma or React releases.\n\nExisting license holders will continue to receive full access to updates. Looking ahead, Belyaev is considering adding complex, premium components to the core library, focusing on advanced CSS and React logic, while maintaining Reshaped's core value of helping users build beautiful products and design systems. The author expresses enthusiasm and gratitude for the community.\n",
    "chinese_title": "Reshaped 现在开源了",
    "chinese_summary": "季马·别利亚耶夫宣布用于 React 和 Figma 的组件库 Reshaped 现已完全开源。别利亚耶夫最初创建 Reshaped 是为了解决 Web 开发的常见需求，重点在于对齐设计和工程，同时应对主题和暗黑模式等 UI 挑战。此前，Reshaped 采用付费许可模式，从而能够提供专注的支持和开发。两年前，React 包已免费。\n\n现在，完整的 React 库源代码可在 GitHub 上获取，Figma 库可在 Figma Community 中获取。别利亚耶夫希望此举能够促进设计和工程社区之间的知识共享。他还计划分享关于新功能实现的幕后见解，特别是关于与新 Figma 或 React 版本集成的幕后见解。\n\n现有许可证持有者将继续获得对更新的完全访问权限。展望未来，别利亚耶夫正在考虑向核心库添加复杂的高级组件，重点关注高级 CSS 和 React 逻辑，同时保持 Reshaped 帮助用户构建精美产品和设计系统的核心价值。作者表达了对社区的热情和感激之情。"
  },
  {
    "id": "45222608",
    "title": "Intel talent bleed continues as Xeon chip architect heads for the escape hatch",
    "url": "https://www.theregister.com/2025/09/11/intel_loses_chief_architect/",
    "summary": "Ronak Singhal, the chief architect behind Intel's Xeon server CPUs, is leaving Intel after nearly 30 years. He's credited with significant contributions to Intel's processor architectures, including Haswell and Broadwell, as well as the Core and Atom families.\n\nHis departure follows a period of increasing competition for Intel's Xeon division from AMD and Arm-based CPUs. Despite Intel closing the gap with AMD in recent years with the launch of Granite Rapids, Singhal's exit marks another loss of experienced talent for Intel's data center group.\n\nSeveral other key figures have left Intel recently, including Sailesh Kottapalli (to Qualcomm), Lisa Spelman (to Cornelis Networks), Justin Hotard (to Nokia), and Michelle Johnston Holthaus. This high turnover extends to the executive level, with Intel announcing a broader executive shakeup that includes new leadership for its data center engineering and client computing groups. Intel confirmed Singhal's departure but offered no further comment.\n",
    "chinese_title": "英特尔人才流失持续，至强芯片架构师离职。",
    "chinese_summary": "英特尔至强服务器CPU首席架构师Ronak Singhal将在效力近30年后离开英特尔。他为英特尔的处理器架构做出了重大贡献，包括Haswell和Broadwell，以及酷睿和凌动系列。\n\n在他离职之际，英特尔至强部门正面临来自AMD和基于Arm的CPU日益激烈的竞争。尽管英特尔近年来通过推出Granite Rapids缩小了与AMD的差距，但Singhal的离职标志着英特尔数据中心集团又失去了一位经验丰富的人才。\n\n最近，其他几位关键人物也离开了英特尔，包括Sailesh Kottapalli（加入高通）、Lisa Spelman（加入Cornelis Networks）、Justin Hotard（加入诺基亚）和Michelle Johnston Holthaus。这种高流动率甚至蔓延到了高管层面，英特尔宣布了一项更广泛的高管改组，其中包括其数据中心工程和客户端计算集团的新领导层。英特尔确认了Singhal的离职，但未作进一步评论。"
  },
  {
    "id": "45222749",
    "title": "The Influencer FBI",
    "url": "https://www.theatlantic.com/ideas/archive/2025/09/charlie-kirk-fbi-investigation/684184/",
    "summary": "The article \"The Influencer FBI\" details the unusual and concerning circumstances surrounding the FBI's investigation into the assassination of right-wing influencer Charlie Kirk. It focuses on FBI Director Kash Patel, a former pro-Trump influencer, and his social media activity immediately following the murder.\n\nPatel's rapid, and ultimately inaccurate, updates on X (formerly Twitter) regarding a suspect being apprehended and then released drew criticism from both right-wing figures and former law enforcement officials, who accused him of prioritizing \"click-bait\" over proper procedure. Critics believe this behavior undermines the FBI's credibility and distracts from the investigation.\n\nThe article highlights a broader issue of political violence and the role of influencers in shaping public perception following such events. It discusses how Kirk's murder became instantly consumed by influencer culture, with graphic videos and baseless conspiracy theories spreading online.\n\nThe author argues that Patel's background as an influencer is ill-suited for leading the FBI, contrasting the need for restraint and reliable information from law enforcement with the influencer's tendency to theorize and create content. The article also points out the challenges the FBI faces, including resource constraints and personnel shifts, potentially hindering its effectiveness in solving the case. It concludes with concern that the politicized leadership is compromising the FBI's ability to perform its duties effectively.\n",
    "chinese_title": "The Influencer FBI",
    "chinese_summary": "The article \"The Influencer FBI\" details the unusual and concerning circumstances surrounding the FBI's investigation into the assassination of right-wing influencer Charlie Kirk. It focuses on FBI Director Kash Patel, a former pro-Trump influencer, and his social media activity immediately following the murder.\n\nPatel's rapid, and ultimately inaccurate, updates on X (formerly Twitter) regarding a suspect being apprehended and then released drew criticism from both right-wing figures and former law enforcement officials, who accused him of prioritizing \"click-bait\" over proper procedure. Critics believe this behavior undermines the FBI's credibility and distracts from the investigation.\n\nThe article highlights a broader issue of political violence and the role of influencers in shaping public perception following such events. It discusses how Kirk's murder became instantly consumed by influencer culture, with graphic videos and baseless conspiracy theories spreading online.\n\nThe author argues that Patel's background as an influencer is ill-suited for leading the FBI, contrasting the need for restraint and reliable information from law enforcement with the influencer's tendency to theorize and create content. The article also points out the challenges the FBI faces, including resource constraints and personnel shifts, potentially hindering its effectiveness in solving the case. It concludes with concern that the politicized leadership is compromising the FBI's ability to perform its duties effectively.\n"
  },
  {
    "id": "45214672",
    "title": "Making io_uring pervasive in QEMU [pdf]",
    "url": "https://vmsplice.net/~stefan/stefanha-kvm-forum-2025.pdf",
    "summary": "生成摘要时出错",
    "chinese_title": "Making io_uring pervasive in QEMU [pdf]",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45217858",
    "title": "The challenge of maintaining curl",
    "url": "https://lwn.net/Articles/1034966/",
    "summary": "生成摘要时出错",
    "chinese_title": "The challenge of maintaining curl",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45210428",
    "title": "AirPods live translation blocked for EU users with EU Apple accounts",
    "url": "https://www.macrumors.com/2025/09/11/airpods-live-translation-eu-restricted/",
    "summary": "生成摘要时出错",
    "chinese_title": "AirPods live translation blocked for EU users with EU Apple accounts",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45211127",
    "title": "An engineering history of the Manhattan Project",
    "url": "https://www.construction-physics.com/p/an-engineering-history-of-the-manhattan",
    "summary": "生成摘要时出错",
    "chinese_title": "An engineering history of the Manhattan Project",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45163423",
    "title": "Removing yellow stains from fabric with blue light",
    "url": "https://phys.org/news/2025-09-yellow-fabric-blue.html",
    "summary": "生成摘要时出错",
    "chinese_title": "Removing yellow stains from fabric with blue light",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45223231",
    "title": "Swiss government look to undercut privacy tech stoking fear of mass surveillance",
    "url": "https://therecord.media/switzerland-digital-privacy-law-proton-privacy-surveillance",
    "summary": "生成摘要时出错",
    "chinese_title": "Swiss government look to undercut privacy tech stoking fear of mass surveillance",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45210399",
    "title": "Center for the Alignment of AI Alignment Centers",
    "url": "https://alignmentalignment.ai",
    "summary": "生成摘要时出错",
    "chinese_title": "Center for the Alignment of AI Alignment Centers",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45223196",
    "title": "FAA Launches Process to Select Prime Integrator for Brand New ATC System",
    "url": "https://www.faa.gov/newsroom/us-transportation-secretary-duffy-faa-launch-process-select-prime-integrator-brand-new-air",
    "summary": "生成摘要时出错",
    "chinese_title": "FAA Launches Process to Select Prime Integrator for Brand New ATC System",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45174944",
    "title": "Full Moon: Seestar S50 vs. Samsung S25",
    "url": "https://www.4rknova.com//blog/2025/09/08/moon-photos",
    "summary": "生成摘要时出错",
    "chinese_title": "Full Moon: Seestar S50 vs. Samsung S25",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45215869",
    "title": "Nano Banana image examples",
    "url": "https://github.com/PicoTrex/Awesome-Nano-Banana-images/blob/main/README_en.md",
    "summary": "生成摘要时出错",
    "chinese_title": "Nano Banana image examples",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45167739",
    "title": "Logging in Go with Slog: A Practitioner's Guide",
    "url": "https://www.dash0.com/guides/logging-in-go-with-slog",
    "summary": "生成摘要时出错",
    "chinese_title": "Logging in Go with Slog: A Practitioner's Guide",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45222705",
    "title": "Jef Raskin's cul-de-sac and the quest for the humane computer",
    "url": "https://arstechnica.com/gadgets/2025/09/jef-raskins-cul-de-sac-and-the-quest-for-the-humane-computer/",
    "summary": "生成摘要时出错",
    "chinese_title": "Jef Raskin's cul-de-sac and the quest for the humane computer",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45221230",
    "title": "Apple's iPhone security feature makes life more difficult for spyware makers",
    "url": "https://techcrunch.com/2025/09/11/apples-latest-iphone-security-feature-just-made-life-more-difficult-for-spyware-makers/",
    "summary": "生成摘要时出错",
    "chinese_title": "Apple's iPhone security feature makes life more difficult for spyware makers",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45217499",
    "title": "Backprompting: Leveraging synthetic production data for health advice guardrails",
    "url": "https://arxiv.org/abs/2508.18384",
    "summary": "生成摘要时出错",
    "chinese_title": "Backprompting: Leveraging synthetic production data for health advice guardrails",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45222820",
    "title": "US to split profits with Tokyo from Japan-funded projects till $550B is recouped",
    "url": "https://www.cnbc.com/2025/09/11/japan-us-tariff-550-billion-investment-trump-lutnick.html",
    "summary": "生成摘要时出错",
    "chinese_title": "US to split profits with Tokyo from Japan-funded projects till $550B is recouped",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45209389",
    "title": "Samsung taking market share from Apple in U.S. as foldable phones gain momentum",
    "url": "https://www.cnbc.com/2025/08/16/samsungs-us-market-share-apple-rivalry-foldable-phones.html",
    "summary": "生成摘要时出错",
    "chinese_title": "Samsung taking market share from Apple in U.S. as foldable phones gain momentum",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45210910",
    "title": "GrapheneOS and forensic extraction of data (2024)",
    "url": "https://discuss.grapheneos.org/d/13107-grapheneos-and-forensic-extraction-of-data",
    "summary": "生成摘要时出错",
    "chinese_title": "GrapheneOS and forensic extraction of data (2024)",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45215417",
    "title": "Disposable Code Is Here to Stay, but Durable Code Is What Runs the World",
    "url": "https://www.honeycomb.io/blog/disposable-code-is-here-to-stay",
    "summary": "生成摘要时出错",
    "chinese_title": "Disposable Code Is Here to Stay, but Durable Code Is What Runs the World",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45202489",
    "title": "Show HN: Making a cross-platform game in Go using WebRTC Datachannels",
    "url": "https://pion.ly/blog/making-a-game-with-pion/",
    "summary": "生成摘要时出错",
    "chinese_title": "Show HN: Making a cross-platform game in Go using WebRTC Datachannels",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45209065",
    "title": "PgEdge Goes Open Source",
    "url": "https://www.pgedge.com/blog/pgedge-goes-open-source",
    "summary": "生成摘要时出错",
    "chinese_title": "PgEdge Goes Open Source",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45169194",
    "title": "Learning lessons from the loss of the Norwegian frigate Helge Ingstad",
    "url": "https://www.navylookout.com/learning-the-lessons-the-loss-the-norwegian-frigate-helge-ingstad/",
    "summary": "生成摘要时出错",
    "chinese_title": "Learning lessons from the loss of the Norwegian frigate Helge Ingstad",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45166238",
    "title": "The Helix Text Editor (2024)",
    "url": "https://jonathan-frere.com/posts/helix/",
    "summary": "生成摘要时出错",
    "chinese_title": "The Helix Text Editor (2024)",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45215984",
    "title": "How Palantir is mapping the nation’s data",
    "url": "https://theconversation.com/when-the-government-can-see-everything-how-one-company-palantir-is-mapping-the-nations-data-263178",
    "summary": "生成摘要时出错",
    "chinese_title": "How Palantir is mapping the nation’s data",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45165721",
    "title": "Hashed sorting is typically faster than hash tables",
    "url": "https://reiner.org/hashed-sorting",
    "summary": "生成摘要时出错",
    "chinese_title": "Hashed sorting is typically faster than hash tables",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45213612",
    "title": "A tech-law measurement and analysis of event listeners for wiretapping",
    "url": "https://arxiv.org/abs/2508.19825",
    "summary": "生成摘要时出错",
    "chinese_title": "A tech-law measurement and analysis of event listeners for wiretapping",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45206311",
    "title": "Where did the Smurfs get their hats (2018)",
    "url": "https://www.pipelinecomics.com/beginning-bd-smurfs-hats-origin/",
    "summary": "生成摘要时出错",
    "chinese_title": "Where did the Smurfs get their hats (2018)",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45210564",
    "title": "Gregg Kellogg has died",
    "url": "https://lists.w3.org/Archives/Public/public-json-ld-wg/2025Sep/0012.html",
    "summary": "生成摘要时出错",
    "chinese_title": "Gregg Kellogg has died",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45172058",
    "title": "The HackberryPi CM5 handheld computer",
    "url": "https://github.com/ZitaoTech/HackberryPiCM5",
    "summary": "生成摘要时出错",
    "chinese_title": "The HackberryPi CM5 handheld computer",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45167346",
    "title": "Adjacency Matrix and std:mdspan, C++23",
    "url": "https://www.cppstories.com/2025/cpp23_mdspan_adj/",
    "summary": "生成摘要时出错",
    "chinese_title": "Adjacency Matrix and std:mdspan, C++23",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45167688",
    "title": "Public Suffix List",
    "url": "https://publicsuffix.org/",
    "summary": "生成摘要时出错",
    "chinese_title": "Public Suffix List",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45217545",
    "title": "The effects of algorithms on the public discourse",
    "url": "https://tekhne.dev/internet-resist/",
    "summary": "生成摘要时出错",
    "chinese_title": "The effects of algorithms on the public discourse",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45167352",
    "title": "Reverse-engineering Roadsearch Plus, or, roadgeeking with an 8-bit CPU",
    "url": "http://oldvcr.blogspot.com/2025/08/make-your-apple-ii-or-commodore-64.html",
    "summary": "生成摘要时出错",
    "chinese_title": "Reverse-engineering Roadsearch Plus, or, roadgeeking with an 8-bit CPU",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45167049",
    "title": "Beyond package management: How Nix refactored my digital life",
    "url": "https://www.jimmyff.co.uk/blog/beyond-package-management-how-nix-refactored-my-digital-life/",
    "summary": "生成摘要时出错",
    "chinese_title": "Beyond package management: How Nix refactored my digital life",
    "chinese_summary": "生成摘要时出错"
  }
]