[
  {
    "id": "44137715",
    "title": "Beating Google's kernelCTF PoW using AVX512",
    "url": "https://anemato.de/blog/kctf-vdf",
    "summary": "This article details Timothy Herchen's contribution to his team's successful attempt to win Google's kernelCTF bounty by optimizing the \"proof of work\" required for submission. The proof of work involved a computationally intensive, serial verifiable delay function (VDF) based on the \"sloth\" algorithm, making it difficult to parallelize.\n\nHerchen initially optimized the modular squaring operation at the heart of the VDF by using a mathematical shortcut for Mersenne number moduli and translating the code to C++. While this yielded significant speed improvements, it wasn't enough to guarantee a winning submission, especially given speculation that competitors might be using FPGAs.\n\nTo achieve a more substantial performance boost, Herchen leveraged Intel's AVX512 instruction set, specifically the AVX512IFMA extension. This extension allows for highly efficient, packed multiply-accumulate operations suitable for large integer arithmetic. He implemented a custom 1280-bit multiplication kernel using 52-bit limbs and the `vpmadd52luq` and `vpmadd52huq` instructions, significantly accelerating the modular squaring.\n\nThe optimization involved careful arrangement of multiplications and accumulation to minimize data shuffling and maximize the utilization of the AVX512 registers and instructions.  He also detailed how he handled the reduction modulo 2^1279-1. The AVX512-optimized solver ultimately provided the necessary edge to win the kernelCTF bounty.\n",
    "chinese_title": "使用AVX512破解谷歌kernelCTF的PoW",
    "chinese_summary": "本文详细介绍了蒂莫西·赫尔申如何通过优化提交所需的“工作量证明”，为他的团队成功赢得谷歌的kernelCTF赏金做出的贡献。该工作量证明涉及一种计算密集型、串行可验证的延迟函数（VDF），该函数基于“sloth”算法，使其难以并行化。\n\n赫尔申最初通过使用梅森数模数的数学捷径并将代码翻译成 C++，优化了 VDF 核心的模平方运算。虽然这带来了显着的速度提升，但仍不足以保证赢得提交，特别是考虑到有猜测竞争对手可能正在使用 FPGA。\n\n为了实现更显着的性能提升，赫尔申利用了英特尔的 AVX512 指令集，特别是 AVX512IFMA 扩展。此扩展允许高效的、打包的乘法累加运算，适用于大型整数算术。他使用 52 位 limbs 和 `vpmadd52luq` 和 `vpmadd52huq` 指令实现了一个定制的 1280 位乘法内核，从而显着加速了模平方运算。\n\n该优化涉及精心安排乘法和累加，以最大限度地减少数据洗牌并最大限度地利用 AVX512 寄存器和指令。他还详细介绍了他是如何处理模 2^1279-1 缩减的。AVX512 优化的求解器最终提供了赢得 kernelCTF 赏金所需的优势。"
  },
  {
    "id": "44137439",
    "title": "De Bruijn notation, and why it's useful",
    "url": "https://blueberrywren.dev/blog/debruijn-explanation/",
    "summary": "This article introduces De Bruijn notation (indexes and levels) as a solution to the variable capture problem in lambda calculus during beta reduction (function application). Traditional substitution requires renaming to avoid accidental capture, but De Bruijn notation uses numbers to represent variables, eliminating name collisions.\n\nDe Bruijn indexes represent variables by their distance from the binding lambda (0 being the most recent). During substitution, free variables in the substituted term are incremented by one each time a binder is bypassed, and the free variables of the substitutee are decremented once to account for the removal of the binder, preventing capture.\n\nDe Bruijn levels, conversely, represent variables by their depth within the term, with the lowest number referring to the least recently bound item. Indexes are considered more \"local\" and generally more useful, as levels require knowledge of the term's depth. Indexes are convenient when creating new binders, while levels are useful when moving a term under a binder, as free variables don't need to be modified.\n\nA key advantage of De Bruijn notation is simplifying alpha-equivalence checking. Terms that are alpha-equivalent (equal up to variable names) become identical in De Bruijn notation, making equality comparisons straightforward. The article concludes by mentioning alternative methods for addressing variable capture, primarily used in formalization.\n",
    "chinese_title": "德布鲁因记法及其用途",
    "chinese_summary": "本文介绍De Bruijn记号（索引和层级）作为λ演算中β归约（函数应用）期间变量捕获问题的解决方案。传统的替换需要重命名以避免意外捕获，但De Bruijn记号使用数字来表示变量，从而消除了名称冲突。\n\nDe Bruijn索引通过变量与绑定λ的距离来表示变量（0表示最近的绑定）。在替换过程中，被替换项中的自由变量每次绕过一个绑定器时，其值都会递增1，而替换者的自由变量则递减1，以考虑删除绑定器，从而防止捕获。\n\n相反，De Bruijn层级通过变量在术语中的深度来表示变量，最小的数字指的是最近最少绑定的项。索引被认为更“局部”，通常更有用，因为层级需要了解术语的深度。索引在创建新的绑定器时很方便，而层级在将术语移动到绑定器下时很有用，因为自由变量不需要修改。\n\nDe Bruijn记号的一个关键优势是简化了α等价性检查。在α等价（变量名相同）的术语在De Bruijn记号中变得相同，从而使相等比较变得简单直接。文章最后提到了解决变量捕获问题的替代方法，主要用于形式化。"
  },
  {
    "id": "44137187",
    "title": "The Surveilled Student",
    "url": "https://www.chronicle.com/article/the-surveilled-student",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "被监控的学生",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "44135638",
    "title": "Systems Correctness Practices at Amazon Web Services",
    "url": "https://cacm.acm.org/practice/systems-correctness-practices-at-amazon-web-services/",
    "summary": "This article outlines Amazon Web Services' (AWS) comprehensive approach to ensuring systems correctness, moving beyond traditional unit and integration testing. Formal methods, encompassing both rigorous and lightweight techniques, play a crucial role.\n\nThe **P programming language**, a state-machine-based language, facilitates modeling and analyzing distributed systems, bridging the gap between high-level specifications and implementation. PObserve further validates correctness by monitoring production logs against P specifications.\n\n**Lightweight formal methods** like property-based testing, deterministic simulation, and continuous fuzzing are extensively used. S3's ShardStore leveraged property-based testing, coverage-guided fuzzing, and fault injection for enhanced correctness. Deterministic simulation accelerates development by moving system property testing closer to build time.\n\n**Fault Injection Service (FIS)** allows customers to simulate faults, validating the resilience of their AWS infrastructure. By combining fault injection with formal specifications, AWS catches more bugs than traditional methods.\n\nAWS addresses **metastable failures** (where systems fail to recover without intervention) through discrete-event simulation and probabilistic model checking.\n\nFor critical security boundaries, like **authorization and virtualization**, AWS utilizes **formal proof** using languages like Dafny (for Cedar authorization) and Kani (for Firecracker VMM), providing mathematical guarantees of correctness. The open-sourcing of Dafny code and test procedures for Cedar enhances transparency and allows users to verify AWS's work.\n\nAWS actively supports the development of tools like Kani, Dafny, and Lean, which underpin these formal proof efforts. By integrating formal methods throughout the development lifecycle, AWS aims for faster development cycles, cost-effective services, and high confidence in system correctness.\n",
    "chinese_title": "亚马逊云服务的系统正确性实践",
    "chinese_summary": "亚马逊云服务（AWS）确保系统正确性的全面方法：超越传统单元和集成测试。形式化方法（包括严格和轻量级技术）发挥关键作用。\n\n基于状态机的P编程语言有助于分布式系统的建模和分析，弥合了高级规范和实现之间的差距。PObserve通过对照P规范监控生产日志，进一步验证正确性。\n\n广泛使用属性测试、确定性模拟和持续模糊测试等轻量级形式化方法。S3的ShardStore利用属性测试、覆盖率引导的模糊测试和故障注入来增强正确性。确定性模拟通过将系统属性测试提前到构建时，加速了开发。\n\n故障注入服务（FIS）允许客户模拟故障，验证其AWS基础设施的弹性。通过将故障注入与形式规范相结合，AWS比传统方法捕获更多的错误。\n\nAWS通过离散事件模拟和概率模型检测来解决亚稳态故障（系统在没有干预的情况下无法恢复）。\n\n对于关键的安全边界，如授权和虚拟化，AWS使用形式化证明，使用Dafny（用于Cedar授权）和Kani（用于Firecracker VMM）等语言，提供数学上的正确性保证。Cedar的Dafny代码和测试程序的开源增强了透明度，并允许用户验证AWS的工作。\n\nAWS积极支持Kani、Dafny和Lean等工具的开发，这些工具是这些形式化证明的基础。通过在整个开发生命周期中集成形式化方法，AWS旨在实现更快的开发周期、经济高效的服务以及对系统正确性的高度信心。"
  },
  {
    "id": "44136884",
    "title": "Show HN: W++ – A Python-style scripting language for .NET with NuGet support",
    "url": "https://github.com/sinisterMage/WPlusPlus",
    "summary": "W++ is a new, experimental scripting language for .NET inspired by Python's readability but not a Python dialect. Created by Ofek Bickel as an educational project, it aims to teach compiler and runtime skills through a meme-fueled language.\n\nKey features include a C# interpreter, async/await support, lambda expressions, control flow statements (if, else, while, for, switch), try/catch exception handling, and a custom VSCode extension for syntax highlighting and snippets. The language supports NuGet imports and compiles to IL for tight integration with the .NET ecosystem.\n\nThe project is structured into three main parts: the core C# interpreter and Abstract Syntax Tree (AST) in `WPlusPlus/`, a CLI wrapper for running scripts in `IngotCLI/`, and the VSCode extension in `wpp-vscode/`.\n\nThe project boasts an \"OOPSIE\" (Object-Oriented Programming Sometimes Isn’t Excellent) model. It was previously available on the VSCode Marketplace with over 33,000 downloads, but was removed. The source code is now open-source under the MIT License, and the authors welcome feedback and clarification regarding the takedown. They aim to have the language reinstated on the marketplace.\n",
    "chinese_title": "Show HN: W++ – 一款支持 NuGet 的 .NET Python 风格脚本语言",
    "chinese_summary": "W++是一种新的实验性.NET脚本语言，其灵感来源于Python的可读性，但并非Python的方言。它由Ofek Bickel作为教育项目创建，旨在通过一种梗化的语言来教授编译器和运行时技能。\n\n主要特性包括C#解释器、async/await支持、lambda表达式、控制流语句（if, else, while, for, switch）、try/catch异常处理，以及用于语法高亮和代码片段的自定义VSCode扩展。该语言支持NuGet导入并编译为IL，以便与.NET生态系统紧密集成。\n\n该项目分为三个主要部分：核心C#解释器和抽象语法树 (AST)，位于`WPlusPlus/`中；用于运行脚本的CLI封装器，位于`IngotCLI/`中；以及VSCode扩展，位于`wpp-vscode/`中。\n\n该项目拥有一个“OOPSIE”（面向对象编程有时并不出色）模型。它之前在VSCode Marketplace上提供，拥有超过33,000次下载，但已被移除。现在，源代码已在MIT许可证下开源，作者欢迎有关下架的反馈和澄清。他们的目标是将该语言重新恢复到 Marketplace 上。"
  },
  {
    "id": "44138034",
    "title": "A Smiling Public Man",
    "url": "https://salmagundi.skidmore.edu/articles/1407-a-smiling-public-man",
    "summary": "Jeffrey Meyers' \"A Smiling Public Man\" reviews a collection of Seamus Heaney's letters, offering insights into the poet's life, work, and relationships. The review highlights Heaney's \"miraculous year\" of 1965 when his first book was accepted, he secured a teaching position, and married Marie Devlin. It explores his experiences teaching at Berkeley, contrasted with the more conservative Belfast.\n\nThe article emphasizes Heaney's friendships with fellow writers, including Ted Hughes, Czeslaw Milosz, and Tom Flanagan. Hughes was a significant influence, while Milosz was nicknamed \"Coleslaw Meatloaf.\" The review touches upon Heaney's generous nature, offering praise and support to other writers like Edna O'Brien, even when encountering difficulties like Derek Mahon's alcoholism.\n\nThe review also explores the tension between Heaney's private life and increasing public exposure, especially after winning the Nobel Prize. He fiercely protected his privacy, even requesting family letters be excluded from the collection and expressing anxiety about biographical intrusion. Yet, he also participated in public life, attending conferences and accepting accolades, almost to an exhausting degree.\n\nFinally, the article reveals insights into Heaney's creative process, citing Theodore Roethke's influence, and his thoughts on the role of the artist in society, drawing upon his translation of Sophocles' \"Philoctetes.\" Woven throughout are anecdotes and vivid descriptions of Heaney's epistolary style and his observations of the world.\n",
    "chinese_title": "面带微笑的公众人物",
    "chinese_summary": "杰弗里·迈耶斯的《一位微笑的公众人物》评论了谢默斯·希尼的信件集，提供了对这位诗人生活、作品和人际关系的见解。这篇评论强调了希尼“奇迹般的一年”——1965年，他的第一本书被接受，他获得了一个教职，并与玛丽·德夫林结婚。它探讨了他在伯克利大学的教学经历，并与更为保守的贝尔法斯特进行了对比。\n\n文章强调了希尼与同行的友谊，包括泰德·休斯、切斯瓦夫·米沃什和汤姆·弗拉纳根。休斯产生了重大影响，而米沃什则被戏称为“凉拌卷心菜肉饼”。这篇评论提到了希尼慷慨的天性，即使遇到像德里克·马洪酗酒这样的困难，他仍然向埃德娜·奥布莱恩等其他作家提供赞扬和支持。\n\n这篇评论还探讨了希尼的私人生活与日益增加的公众曝光之间的紧张关系，尤其是在他获得诺贝尔奖之后。他极力保护自己的隐私，甚至要求将家庭信件排除在收藏之外，并对传记式的侵扰表示焦虑。然而，他也参与公共生活，参加会议并接受荣誉，几乎到了精疲力竭的程度。\n\n最后，这篇文章揭示了希尼创作过程的见解，引用了西奥多·罗特克的 influence，以及他对艺术家在社会中所扮演角色的思考，借鉴了他对索福克勒斯的《菲罗克忒忒斯》的翻译。文章始终贯穿着许多轶事和对希尼书信风格以及他对世界观察的生动描述。"
  },
  {
    "id": "44138084",
    "title": "Weave (YC W25) is hiring a founding engineer",
    "url": "https://www.ycombinator.com/companies/weave-3/jobs",
    "summary": "WeaveAI, a Y Combinator W25 company, is hiring two founding engineers: an AI Engineer and a Product Engineer. Both roles are located in the San Francisco/Oakland, CA area and offer a salary of $140K - $200K, plus 0.50% - 2.00% equity. The AI Engineer position requires 1+ years of experience, while the Product Engineer role welcomes new grads.\n\nWeave's mission is to build software that helps engineering teams move faster. The company is well-funded, backed by top investors, growing rapidly, and currently profitable. Founded in 2024, Weave is an active startup with a team of two founders: Andrew Churchill and Adam Cohen. Their website is workweave.dev. The company is building tools to measure engineering work.\n",
    "chinese_title": "Weave (YC W25) 招聘创始工程师",
    "chinese_summary": "WeaveAI（Y Combinator W25 公司）正在招聘两位创始工程师：一位 AI 工程师和一位产品工程师。两个职位均位于加州旧金山/奥克兰地区，年薪 14 万美元至 20 万美元，外加 0.50% 至 2.00% 的股权。AI 工程师职位要求 1 年以上工作经验，而产品工程师职位欢迎应届毕业生。\n\nWeave 的使命是构建帮助工程团队更快行动的软件。该公司资金充足，获得顶级投资者的支持，发展迅速，目前已实现盈利。Weave 成立于 2024 年，是一家活跃的初创公司，拥有一支由两位创始人（Andrew Churchill 和 Adam Cohen）组成的团队。他们的网站是 workweave.dev。该公司正在构建用于衡量工程工作的工具。"
  },
  {
    "id": "44135977",
    "title": "Microsandbox: Virtual Machines that feel and perform like containers",
    "url": "https://github.com/microsandbox/microsandbox",
    "summary": "Microsandbox offers a secure and efficient way to execute untrusted code, addressing the limitations of running code locally, using containers, or employing traditional VMs. It combines the bulletproof security of microVM isolation with the instant startup times (under 200ms) closer to containers. It's self-hosted, OCI compatible, and AI-ready with built-in MCP support.\n\nThe platform offers a quick start guide with SDKs for Python, JavaScript, and Rust, allowing users to easily execute code within sandboxed environments. Beyond the SDK, Microsandbox supports project-based development similar to package managers like npm, utilizing a `Sandboxfile` for environment configuration. It provides commands for creating, adding, running, and installing sandboxes.\n\nMicrosandbox outlines use cases like coding & dev environments, data analysis, web browsing agents, and instant app hosting, enabling AI agents to perform tasks safely with full system access and quick iteration. The architecture involves a client-side SDK communicating with a server that executes code in individual microVMs.\n\nFinally, the document encourages development contributions and specifies the project's licensing under Apache License 2.0.\n",
    "chinese_title": "微沙箱：感觉和性能都像容器的虚拟机",
    "chinese_summary": "Microsandbox提供了一种安全高效的执行不受信任代码的方式，解决了本地运行代码、使用容器或采用传统VM的局限性。它结合了microVM隔离的强大安全性与接近容器的快速启动时间（低于200毫秒）。它是自托管的，OCI兼容，并通过内置的MCP支持实现AI就绪。\n\n该平台提供Python、JavaScript和Rust的SDK快速入门指南，使用户能够轻松地在沙盒环境中执行代码。除了SDK之外，Microsandbox还支持类似于npm等包管理器的基于项目的开发，利用`Sandboxfile`进行环境配置。它提供了用于创建、添加、运行和安装沙盒的命令。\n\nMicrosandbox概述了诸如编码和开发环境、数据分析、网页浏览代理以及即时应用托管等用例，使AI代理能够安全地执行任务，并具有完整的系统访问权限和快速迭代能力。该架构涉及客户端SDK与在单独的microVM中执行代码的服务器进行通信。\n\n最后，该文档鼓励开发贡献，并指定项目在Apache License 2.0许可下进行许可。"
  },
  {
    "id": "44135738",
    "title": "Show HN: Git-Add–Interactive with Enhancements",
    "url": "https://github.com/cwarden/git-add-interactive",
    "summary": "This \"Show HN\" presents a Go implementation of Git's interactive add functionality (`git add -i` and `git add -p`), offering enhanced features compared to the original Perl script. The Go version provides the same interactive staging and patch mode, allowing users to selectively stage hunks with `y/n/s/e/q/a/d` commands, but adds significant improvements.\n\nKey enhancements include:\n\n*   **Global Filtering (G command):** Filters hunks across all files based on a regex pattern, enabling focused staging based on content.\n*   **Auto-Splitting (S command):** Automatically splits all hunks to the smallest possible granularity for maximum control.\n*   **Accept All (A command):** Accepts all visible hunks after filtering and splitting.\n*   **Enhanced Search and Navigation:** Local search within files and clear status display.\n\nThe implementation supports multiple patch modes (stage, reset, checkout, stash, worktree) and fully integrates with Git's color configuration. Installation involves building the Go binary and optionally setting it as the default `git add -i` and `git add -p` by modifying the `GIT_EXEC_PATH`. The post outlines the architecture, testing procedures, and demonstrates usage through command-line examples and workflow combinations. The goal is to provide a more powerful and efficient interactive staging experience.\n",
    "chinese_title": "展示 HN：增强版 Git-Add-Interactive",
    "chinese_summary": "此“Show HN”展示了 Git 交互式添加功能的 Go 实现（`git add -i` 和 `git add -p`），与原始 Perl 脚本相比，提供了增强的功能。Go 版本提供相同的交互式暂存和补丁模式，允许用户使用 `y/n/s/e/q/a/d` 命令选择性地暂存块，并增加了显著的改进。\n\n主要增强功能包括：\n\n*   **全局过滤（G 命令）：** 根据正则表达式模式过滤所有文件中的块，从而实现基于内容的集中暂存。\n*   **自动拆分（S 命令）：** 自动将所有块拆分为尽可能小的粒度，以实现最大程度的控制。\n*   **接受全部（A 命令）：** 在过滤和拆分后接受所有可见的块。\n*   **增强的搜索和导航：** 文件内的本地搜索和清晰的状态显示。\n\n该实现支持多种补丁模式（stage、reset、checkout、stash、worktree）并与 Git 的颜色配置完全集成。安装包括构建 Go 二进制文件，并可以选择通过修改 `GIT_EXEC_PATH` 将其设置为默认的 `git add -i` 和 `git add -p`。本文概述了架构、测试程序，并通过命令行示例和工作流程组合演示了用法。目标是提供更强大、更高效的交互式暂存体验。"
  },
  {
    "id": "44132673",
    "title": "The radix 2^51 trick (2017)",
    "url": "https://www.chosenplaintext.ca/articles/radix-2-51-trick.html",
    "summary": "This article, \"The Radix 2^51 Trick,\" explains a technique to speed up large integer addition and subtraction on modern CPUs by delaying carry propagation. Traditionally, adding large integers (e.g., 256-bit) involves breaking them into smaller 64-bit pieces and using \"add with carry\" (adc) instructions, which are slower due to the dependency between operations, hindering parallel execution.\n\nThe radix 2^51 trick solves this by representing numbers in a \"radix 2^51 representation.\" Instead of dividing a 256-bit number into four 64-bit \"digits\" (base 2^64), it's divided into five \"digits\" in base 2^51. This smaller base allows the higher bits of each digit to act as temporary storage for carries, enabling multiple additions to be performed in parallel using regular \"add\" instructions.\n\nThis method avoids immediate carry propagation. Carries are accumulated within each 64-bit \"digit\" until a normalization step at the end, where the carries are propagated from the least to the most significant \"digit\".\n\nThe article also extends the concept to subtraction by treating limbs as signed integers, which allows for negative carries. Benchmarks show that radix 2^51 addition outperforms radix 2^64 addition even for a small number of additions, including the cost of conversion and normalization. The core idea is to improve performance by increasing the number of registers used and the number of operations, achieving greater parallelism.\n",
    "chinese_title": "基数2^51技巧 (2017)",
    "chinese_summary": "Radix 2^51技巧：加速大整数加减法"
  },
  {
    "id": "44137542",
    "title": "Toxic Origins, Toxic Decisions: Biases in CEO Selection",
    "url": "https://papers.ssrn.com/sol3/papers.cfm?abstract_id=5270031",
    "summary": "This research paper, \"Toxic Origins, Toxic Decisions: Biases in CEO Selection,\" investigates how prenatal exposure to pollution, specifically living near future Superfund sites, can affect CEO selection and subsequent corporate risk-taking. The authors, P. Raghavendra Rau, YiLin Wu, and Richard Lok-Si Ieong, posit that early exposure to pollution can alter individual risk preferences.\n\nTheir findings suggest a bias in CEO promotion processes. CEOs born near future Superfund sites are more likely to be promoted internally. The study proposes that firms may be mistakenly rewarding observed success without fully understanding the underlying higher risk tolerance of these individuals. These \"Superfund CEOs\" perform well in internal roles but exhibit a tendency towards riskier external policies after promotion. This ultimately leads to increased volatility and weaker overall firm performance.\n\nThe core argument is that companies may be inadvertently filtering for high-variance risk-takers who exhibit lower mean performance with higher performance variance. This becomes problematic when these CEOs transition to decision-making roles with greater exposure and irreversible consequences, potentially mistaking luck for skill. The study utilizes the Superfund site proximity as an exogenous shock to individual risk preferences and links this to CEO behavior and firm outcomes.\n",
    "chinese_title": "有毒的起源，有毒的决策：CEO选拔中的偏见",
    "chinese_summary": "有毒的起源，有毒的决策：CEO选拔中的偏见\n\n这篇题为“有毒的起源，有毒的决策：CEO选拔中的偏见”的研究论文，调查了产前暴露于污染，特别是居住在未来的超级基金地点附近，如何影响CEO的选拔以及随后的企业风险承担行为。作者P. Raghavendra Rau、YiLin Wu和Richard Lok-Si Ieong提出，早期暴露于污染可能会改变个人的风险偏好。\n\n他们的研究结果表明CEO晋升过程中存在偏见。出生在未来超级基金地点附近的CEO更有可能在内部获得晋升。该研究提出，公司可能错误地奖励了观察到的成功，而没有充分理解这些个体潜在的更高风险承受能力。这些“超级基金CEO”在内部职位上表现良好，但在晋升后表现出倾向于采取更冒险的外部政策。这最终导致波动性增加和公司整体业绩下降。\n\n核心论点是，公司可能无意中筛选出高方差的风险承担者，他们表现出较低的平均绩效和较高的绩效方差。当这些CEO过渡到决策角色，面临更大的风险敞口和不可逆转的后果时，问题就出现了，这可能会错误地将运气误认为技能。该研究利用超级基金地点邻近性作为对个人风险偏好的外生冲击，并将其与CEO行为和公司业绩联系起来。"
  },
  {
    "id": "44113706",
    "title": "Atomics and Concurrency",
    "url": "https://redixhumayun.github.io/systems/2024/01/03/atomics-and-concurrency.html",
    "summary": "This article delves into the complexities of atomics and memory ordering in C++ for concurrent programming, offering an alternative to mutexes with potentially better performance but increased complexity.\n\nAtomics are indivisible operations, crucial for managing shared data between threads. The core operations are `store` (write), `load` (read), and `compare_exchange` (read-modify-write).\n\nMemory ordering addresses the compiler and CPU's ability to reorder instructions, which can lead to data races in multithreaded environments. The article illustrates how relaxed memory ordering (`std::memory_order_relaxed`) allows reordering, potentially causing issues where threads have inconsistent views of shared data. Sequential consistency (`std::memory_order_seq_cst`) introduces a memory barrier, ensuring a global order of operations across all threads, preventing reordering. Release-acquire ordering provides a middle ground, synchronizing only between specific release and acquire operations on the same atomic variable.\n\nThe choice of memory order impacts performance, with x86 architectures often handling sequential consistency relatively efficiently due to Total Store Ordering, while ARM architectures may incur higher penalties.\n\nThe article concludes with a basic example of a lock-free concurrent queue using atomics and memory ordering to synchronize `enqueue` and `dequeue` operations. It emphasizes that building such structures is intricate and prone to errors, highlighting the challenges of using atomics effectively in production environments.\n",
    "chinese_title": "原子性与并发",
    "chinese_summary": "C++并发编程中的原子操作和内存排序：一种替代互斥锁的方案\n\n原子操作是不可分割的操作，对于管理线程间的共享数据至关重要。核心操作包括`store`（写入）、`load`（读取）和`compare_exchange`（读-改-写）。\n\n内存排序解决了编译器和CPU重新排序指令的问题，这可能导致多线程环境中的数据竞争。本文阐述了宽松内存排序(`std::memory_order_relaxed`)允许重新排序，可能导致线程对共享数据持有不一致的视图。顺序一致性(`std::memory_order_seq_cst`)引入了一个内存屏障，确保所有线程之间的全局操作顺序，防止重新排序。释放-获取排序提供了一个中间地带，仅在同一原子变量上的特定释放和获取操作之间进行同步。\n\n内存排序的选择会影响性能，由于总存储顺序，x86架构通常可以相对高效地处理顺序一致性，而ARM架构可能会产生更高的代价。\n\n本文最后给出了一个使用原子操作和内存排序来同步`enqueue`和`dequeue`操作的无锁并发队列的基本示例。它强调构建此类结构复杂且容易出错，突出了在生产环境中有效使用原子操作的挑战。"
  },
  {
    "id": "44134364",
    "title": "Radio Astronomy Software Defined Radio (Rasdr)",
    "url": "https://radio-astronomy.org/rasdr",
    "summary": "The article discusses Radio Astronomy Software Defined Radio (RASDR), focusing on the hardware component – the SDR receiver. Two designs were completed based on the RASDR concept: wide-bandwidth, Windows-compatible, and well-documented SDRs specifically for radio astronomy. However, only the RASDR4 model is currently being commercially marketed.\n",
    "chinese_title": "射电天文学软件无线电 (Rasdr)",
    "chinese_summary": "本文讨论射电天文软件无线电 (RASDR)，重点关注硬件组件——SDR接收机。基于RASDR概念完成了两项设计：宽带宽、Windows兼容且文档齐全的SDR，专门用于射电天文。然而，目前只有RASDR4型号在商业销售。"
  },
  {
    "id": "44108386",
    "title": "Vrs: Personal Software Runtime inspired by Emacs, Plan 9, Erlang, Hypermedia",
    "url": "https://github.com/leoshimo/vrs",
    "summary": "Vrs is a personal software runtime envisioned as a holistic programming platform, drawing inspiration from Emacs, Erlang, Unix, Plan 9, and Hypermedia. It aims to provide a joyful, uniform, simple, practical, and interactive programming experience. Currently under heavy development, Vrs is a sandbox project for experimentation.\n\nKey components include:\n\n*   **Lyric:** An embedded Lisp dialect and virtual machine.\n*   **vrsd:** The runtime daemon.\n*   **libvrs:** A shared library for runtime and clients.\n*   **vrsctl:** A CLI client.\n*   **vrsjmp:** A GUI launch bar.\n\nLyric supports fundamental Lisp features like function definition, list manipulation, conditionals, pattern matching, and `eval`. Vrs processes run as lightweight green threads, utilizing non-blocking IO for concurrency. Inter-process communication occurs through message passing with each process having a dedicated mailbox.\n\nServices are long-running processes registered by name, allowing discovery and communication via message passing. PubSub functionality is built-in for global topic-based communication.\n\nThe document provides examples like a counter service and a system appearance service. Tooling includes `vrsctl` for REPL-driven workflows and scripting, along with a lyric-mode for Emacs that offers syntax highlighting and interactive development features.\n",
    "chinese_title": "Vrs：受 Emacs、Plan 9、Erlang、超媒体启发的个人软件运行时",
    "chinese_summary": "Vrs：一个整体编程平台的设想，灵感来自Emacs、Erlang、Unix、Plan 9和超媒体。旨在提供愉悦、统一、简单、实用且交互式的编程体验。目前正在积极开发中，Vrs是一个用于实验的沙盒项目。\n\n关键组件包括：\n\n*   **Lyric:** 一种嵌入式Lisp方言和虚拟机。\n*   **vrsd:** 运行时守护进程。\n*   **libvrs:** 用于运行时和客户端的共享库。\n*   **vrsctl:** 一个CLI客户端。\n*   **vrsjmp:** 一个GUI启动栏。\n\nLyric支持基本的Lisp特性，如函数定义、列表操作、条件语句、模式匹配和`eval`。Vrs进程以轻量级绿色线程运行，利用非阻塞IO实现并发。进程间通信通过消息传递进行，每个进程都有一个专用的邮箱。\n\n服务是以名称注册的长时间运行进程，允许通过消息传递进行发现和通信。内置PubSub功能，用于基于全局主题的通信。\n\n该文档提供了诸如计数器服务和系统外观服务之类的示例。工具包括用于REPL驱动的工作流程和脚本的`vrsctl`，以及为Emacs提供的lyric-mode，该模式提供语法高亮和交互式开发功能。"
  },
  {
    "id": "44134290",
    "title": "Tokenization for language modeling: BPE vs. Unigram Language Modeling (2020)",
    "url": "https://ndingwall.github.io/blog/tokenization",
    "summary": "This article explores the impact of tokenization methods, specifically BPE (Byte Pair Encoding) and Unigram Language Modeling, on language model performance. It argues that BPE, while widely used, often produces tokenizations that obscure morphological relationships within words, potentially hindering a language model's ability to learn effectively. Examples like \"destabilizing\" are used to illustrate how BPE can break words into sub-optimal segments, missing prefixes and suffixes.\n\nThe author highlights research suggesting that Unigram Language Modeling better preserves morphology, leading to improvements in downstream tasks. The article presents experimental results comparing BPE and Unigram LM tokenizers, demonstrating that Unigram LM more consistently identifies morphologically sound subwords based on Merriam-Webster's dictionary. This improved morphological awareness doesn't come at a speed cost; Unigram LM is only negligibly slower at inference.\n\nThe author concludes by advocating for broader adoption of Unigram LM in future language models. Furthermore, the article questions the fundamental use of compression algorithms for tokenization and proposes exploring character-level language modeling with modifications to the Transformer architecture (e.g., using windowed attention to handle long sequences) to better capture language structure. The aim is to move beyond tokenization methods that might impede models from directly learning from raw text data.\n",
    "chinese_title": "语言建模的分词：BPE vs. Unigram 语言模型 (2020)",
    "chinese_summary": "本文探讨了分词方法（特别是字节对编码(BPE)和Unigram语言建模）对语言模型性能的影响。文章认为，BPE虽然应用广泛，但经常产生模糊单词内部形态关系的切分，可能阻碍语言模型的有效学习能力。文章使用“destabilizing”等例子来说明BPE如何将单词分解成次优片段，从而错失前缀和后缀。\n\n作者强调，研究表明Unigram语言建模能更好地保留形态学信息，从而改进下游任务。文章展示了比较BPE和Unigram LM分词器的实验结果，表明Unigram LM能更一致地基于Merriam-Webster词典识别形态上合理的子词。这种改进的形态意识并没有带来速度上的损失；Unigram LM在推理时仅有极小的速度降低。\n\n作者最后提倡在未来的语言模型中更广泛地采用Unigram LM。此外，文章质疑了使用压缩算法进行分词的根本性，并提出探索使用Transformer架构修改（例如，使用窗口注意力来处理长序列）的字符级语言建模，以更好地捕捉语言结构。目的是超越那些可能阻碍模型直接从原始文本数据中学习的分词方法。"
  },
  {
    "id": "44135369",
    "title": "The Darwin Gödel Machine: AI that improves itself by rewriting its own code",
    "url": "https://sakana.ai/dgm/",
    "summary": "The Darwin Gödel Machine (DGM) represents a novel approach to AI development, aiming for continuous self-improvement through code rewriting. Unlike the theoretical Gödel Machine, DGM utilizes Darwinian evolution principles, employing foundation models to suggest code improvements and open-ended algorithms to search for diverse, high-quality AI agents.\n\nDGM operates by reading and modifying its own Python codebase, evaluating the impact of changes on coding benchmarks like SWE-bench and Polyglot. Results show significant performance improvements, with DGM autonomously enhancing its SWE-bench score from 20% to 50% and Polyglot from 14.2% to 30.7%, surpassing hand-designed agents. Experiments confirm that both self-improvement and open-ended exploration are crucial for continual progress.\n\nA key feature is DGM's open-ended exploration strategy, allowing for parallel investigation of multiple evolutionary paths and preventing premature convergence. This enables the discovery of generalizable agent design improvements, such as better tools and refined workflows, transferable across different foundation models and programming languages.\n\nRecognizing the importance of AI safety, DGM is developed with secure, sandboxed environments, human supervision, and transparent change lineage. Preliminary investigations show DGM's potential to address its own shortcomings, although instances of \"objective hacking\" were observed, highlighting the need for continued safety research to ensure alignment and prevent undesirable behaviors.\n",
    "chinese_title": "达尔文哥德尔机：通过重写自身代码自我提升的AI",
    "chinese_summary": "达尔文哥德尔机 (DGM) 代表了一种新颖的 AI 开发方法，旨在通过代码重写实现持续的自我改进。与理论上的哥德尔机不同，DGM 利用达尔文进化原则，采用基础模型来建议代码改进，并利用开放式算法来搜索多样化、高质量的 AI 智能体。\n\nDGM 通过读取和修改自身的 Python 代码库来运行，评估更改对 SWE-bench 和 Polyglot 等编码基准的影响。结果显示出显著的性能提升，DGM 自主地将其 SWE-bench 分数从 20% 提高到 50%，将其 Polyglot 分数从 14.2% 提高到 30.7%，超过了手工设计的智能体。实验证实，自我改进和开放式探索对于持续进步至关重要。\n\nDGM 的一个关键特性是其开放式探索策略，允许并行研究多个进化路径，并防止过早收敛。这使得能够发现可泛化的智能体设计改进，例如更好的工具和改进的工作流程，这些改进可以跨不同的基础模型和编程语言进行转移。\n\n认识到 AI 安全的重要性，DGM 在安全、沙盒化的环境中开发，并辅以人工监督和透明的变更沿袭。初步调查显示，DGM 有潜力解决自身的缺点，尽管观察到了一些“目标黑客”的实例，这突显了继续进行安全研究以确保对齐并防止不良行为的必要性。"
  },
  {
    "id": "44098688",
    "title": "Sieving pores: stable,fast alloying chemistry of Si -electrodes in Li-ion batt",
    "url": "https://www.nature.com/articles/s41467-025-60191-9",
    "summary": "This article presents a novel \"sieving-pore\" design for silicon (Si) negative electrodes in lithium-ion batteries, aiming to overcome the limitations of existing Si materials related to volume expansion and charge transfer. The design features carbon supports with nanopores to accommodate Si deformation and sub-nanopore entrances that promote ion pre-desolvation and fast transport.\n\nThe \"sieving effect\" leads to the formation of an inorganic-rich solid electrolyte interphase (SEI) that mechanically confines the silicon within the pores. This confinement produces a stress-voltage coupling effect, which mitigates the formation of detrimental crystalline Li15Si4. As a result, the electrodes exhibit low expansion, high initial/cyclic Coulombic efficiency, and minimal capacity decay.\n\nExperimental results demonstrate that the sieving-pore silicon/carbon (SSC) composite electrodes exhibit stable cycling performance, high initial Coulombic efficiency, and low electrode swelling. Furthermore, a practical pouch cell using the SSC electrode achieved 80% capacity retention over 1700 cycles and demonstrated 10-minute fast charging capabilities. The SSC material is synthesized through a two-step CVD process and can be produced on a large scale. This design rationale integrates mechanical stability and fast kinetics, improving the cycling and rate performance of low-expansion Si negative electrodes for practical applications.\n",
    "chinese_title": "筛选孔隙：锂离子电池中硅电极稳定、快速合金化的化学",
    "chinese_summary": "本文提出了一种新型的“筛分孔”设计，用于锂离子电池中的硅（Si）负极，旨在克服现有硅材料在体积膨胀和电荷转移方面的局限性。该设计采用具有纳米孔的碳载体来适应硅的变形，并采用亚纳米孔入口来促进离子预脱溶剂化和快速传输。\n\n“筛分效应”导致形成富含无机物的固体电解质界面（SEI），从而在机械上将硅限制在孔内。这种限制产生应力-电压耦合效应，从而减轻有害的晶体Li15Si4的形成。因此，该电极表现出低膨胀、高初始/循环库仑效率和最小的容量衰减。\n\n实验结果表明，筛分孔硅/碳（SSC）复合电极表现出稳定的循环性能、高的初始库仑效率和低的电极溶胀。此外，使用SSC电极的实用软包电池在1700次循环后实现了80%的容量保持率，并展示了10分钟的快速充电能力。SSC材料通过两步CVD工艺合成，可以大规模生产。这种设计理念集成了机械稳定性和快速动力学，从而改善了低膨胀硅负极的循环和倍率性能，适用于实际应用。"
  },
  {
    "id": "44131984",
    "title": "Practical SDR: Getting started with software-defined radio",
    "url": "https://nostarch.com/practical-sdr",
    "summary": "\"Practical SDR: Getting Started with Software-Defined Radio\" is a guide to understanding and implementing software-defined radio (SDR) using GNU Radio.\n\nThe book is structured in three parts:\n\n**Part I: Building a Basic Receiver:** This section introduces the fundamental concepts of radio technology and signals. It guides the reader through the basics of GNU Radio and demonstrates how to build a simple AM receiver using the software.\n\n**Part II: Inside the Receiver:** This part delves into the underlying principles of signal processing, explaining how an AM receiver functions. It then applies this knowledge to building an FM radio.\n\n**Part III: Working with SDR Hardware:** This section focuses on the practical aspects of using SDR hardware. It covers the physics of radio signals, explains how to create GNU Radio flowgraphs with SDR hardware, and explores modulation techniques. It also provides insights into the internal workings of SDR hardware and discusses peripheral hardware options. The book concludes with a section on transmitting signals.\n\nIn essence, the book aims to provide a hands-on, practical introduction to SDR, starting with software-only implementations and progressing to using real-world hardware for both receiving and transmitting radio signals.\n",
    "chinese_title": "实用SDR：软件定义无线电入门",
    "chinese_summary": "《实用SDR：软件定义无线电入门》是一本关于理解和使用GNU Radio实现软件定义无线电 (SDR) 的指南。\n\n本书分为三个部分：\n\n**第一部分：构建基本接收机：** 本节介绍无线电技术和信号的基本概念。它将指导读者了解 GNU Radio 的基础知识，并演示如何使用该软件构建一个简单的 AM 接收机。\n\n**第二部分：接收机内部：** 本部分深入研究信号处理的基本原理，解释 AM 接收机的工作原理。然后将这些知识应用于构建 FM 无线电。\n\n**第三部分：使用 SDR 硬件：** 本节侧重于使用 SDR 硬件的实际方面。它涵盖了无线电信号的物理学，解释了如何使用 SDR 硬件创建 GNU Radio 流程图，并探讨了调制技术。它还提供了对 SDR 硬件内部工作原理的见解，并讨论了外围硬件选项。本书最后以关于发送信号的部分作为结尾。\n\n本质上，本书旨在提供对 SDR 的实践性入门，从纯软件实现开始，逐步发展到使用真实世界的硬件进行无线电信号的接收和发送。"
  },
  {
    "id": "44120480",
    "title": "On eval in dynamic languages generally and in Racket specifically (2011)",
    "url": "https://blog.racket-lang.org/2011/10/on-eval-in-dynamic-languages-generally.html",
    "summary": "This article by Matthew Flatt discusses the use of `eval` in dynamic languages, particularly Racket, cautioning against its overuse while acknowledging its necessity in certain situations. Flatt uses an analogy of giving instructions to illustrate the core problem: `eval` introduces ambiguity regarding the language context in which the evaluated code will be interpreted, hindering compilation, optimization, and program understanding.\n\nHe argues that while `eval` appears powerful, it can lead to fragile code that is difficult to analyze and maintain. He provides examples where `eval` is potentially appropriate: when acting as an intermediary passing instructions, when instructing others to execute code, or when the evaluated code's language is clearly defined and understood. However, he cautions against using it simply to generate code with string manipulation, as this creates language-specific dependencies.\n\nIn Racket, the multiple-language environment exacerbates the issues with `eval`. He explains why a simple `eval` call within a Racket module might fail, while the same call within DrRacket's interactive window succeeds, due to the differing namespaces and default languages used by each context. DrRacket initializes its interaction window with the module's language as the context for `eval`, while module evaluation uses an empty default language.\n\nFlatt emphasizes that using `eval` means accepting the burden of ensuring the evaluated instructions will make sense in their execution context. He concludes that `eval` should be used sparingly and with careful consideration of the intended context for dynamic evaluation, emphasizing Racket's namespace tools. Mike Samuel's comment reinforces these arguments from a security perspective, highlighting the importance of limiting the authority of embedded scripting languages (including `eval`) and avoiding quoting confusion.\n",
    "chinese_title": "关于动态语言（通常）和Racket（特别）中的eval函数 (2011)",
    "chinese_summary": "Matthew Flatt 的这篇文章探讨了动态语言（特别是 Racket）中 `eval` 的使用，告诫不要过度使用，同时也承认其在某些情况下的必要性。Flatt 使用指令传递的比喻来说明核心问题：`eval` 引入了关于被评估代码将被解释的语言环境的歧义，从而阻碍了编译、优化和程序理解。\n\n他认为，虽然 `eval` 看起来很强大，但它会导致脆弱的代码，难以分析和维护。他提供了一些 `eval` 可能适用的例子：当作为传递指令的中介时，当指示他人执行代码时，或者当被评估代码的语言被清晰定义和理解时。但是，他警告不要仅仅为了通过字符串操作生成代码而使用它，因为这会产生特定于语言的依赖关系。\n\n在 Racket 中，多语言环境加剧了 `eval` 的问题。他解释了为什么在 Racket 模块中简单的 `eval` 调用可能会失败，而同样的调用在 DrRacket 的交互窗口中却会成功，这是由于每个上下文使用的命名空间和默认语言不同。DrRacket 使用模块的语言初始化其交互窗口作为 `eval` 的上下文，而模块评估则使用一个空的默认语言。\n\nFlatt 强调，使用 `eval` 意味着必须承担确保被评估的指令在其执行上下文中是有意义的负担。他总结说，`eval` 应该谨慎使用，并仔细考虑动态评估的预期上下文，并强调 Racket 的命名空间工具。Mike Samuel 的评论从安全的角度强化了这些论点，强调了限制嵌入式脚本语言（包括 `eval`）的权限以及避免引用混乱的重要性。"
  },
  {
    "id": "44134728",
    "title": "Bridged Indexes in OrioleDB: architecture, internals and everyday use?",
    "url": "https://www.orioledb.com/blog/orioledb-bridged-indexes",
    "summary": "OrioleDB's bridged indexes allow users to leverage PostgreSQL's existing non-B-tree Index Access Methods (GIN, GiST, etc.) without compromising OrioleDB's MVCC-aware, index-organized storage. Because OrioleDB manages data differently than standard PostgreSQL (using a B-tree on the primary key and an undo log for MVCC), a \"bridge\" is necessary to integrate these existing IndexAMs.\n\nThe bridge works by introducing a virtual, automatically incrementing `iptr` column. This column is updated whenever a column referenced by a bridged index changes. A bridge index maps this `iptr` to the primary key. PostgreSQL indexes are then built on the `iptr` values instead of the standard `ctid`, maintaining compatibility. This results in a three-level lookup: IndexAM -> `iptr` -> bridge index -> primary key fetch.\n\nUsing bridged indexes is simple. OrioleDB automatically creates the `iptr` column and bridge index when a non-B-tree index is created. Manual control is available for pre-emptive bridge creation or removal.\n\nPerformance considerations include an extra B-tree lookup and potentially increased update costs due to the `iptr` bump. However, for complex IndexAMs, the overhead can be negligible.\n\nIn conclusion, bridged indexes provide a balance between OrioleDB's efficient storage and PostgreSQL's rich indexing ecosystem, allowing users to use familiar extensions without a complete rewrite. While native OrioleDB indexes will be faster, the bridge offers flexibility and access to a wider range of indexing options.\n",
    "chinese_title": "OrioleDB中的桥接索引：架构、内部原理与日常使用？",
    "chinese_summary": "OrioleDB的桥接索引允许用户利用PostgreSQL现有的非B树索引访问方法 (GIN, GiST, 等等)，而不会影响OrioleDB的MVCC感知、索引组织的存储。由于OrioleDB管理数据的方式与标准PostgreSQL不同（在主键上使用B树，并使用撤销日志进行MVCC），因此需要一个“桥”来集成这些现有的IndexAMs。\n\n该桥的工作原理是引入一个虚拟的、自动递增的`iptr`列。每当桥接索引引用的列发生变化时，该列都会更新。桥接索引将此`iptr`映射到主键。然后，PostgreSQL索引建立在`iptr`值上，而不是标准的`ctid`，从而保持兼容性。这导致了一个三级查找：IndexAM -> `iptr` -> 桥接索引 -> 主键获取。\n\n使用桥接索引很简单。创建非B树索引时，OrioleDB会自动创建`iptr`列和桥接索引。可以手动控制以进行先发制人的桥创建或删除。\n\n性能方面的考虑包括额外的B树查找和由于`iptr`递增而可能增加的更新成本。但是，对于复杂的IndexAMs，这种开销可以忽略不计。\n\n总之，桥接索引在OrioleDB的高效存储和PostgreSQL丰富的索引生态系统之间提供了一个平衡，允许用户使用熟悉的扩展而无需完全重写。虽然原生的OrioleDB索引会更快，但该桥提供了灵活性和访问更广泛的索引选项。"
  },
  {
    "id": "44128322",
    "title": "FLUX.1 Kontext",
    "url": "https://bfl.ai/models/flux-kontext",
    "summary": "FLUX.1 Kontext is a new suite of generative flow matching models from Black Forest Labs designed for text-and-image-driven image generation and editing. Unlike traditional text-to-image models, FLUX.1 Kontext performs in-context generation, allowing users to prompt with both text and images to modify and create coherent renderings. It enables flexible and instant image editing through simple text instructions without requiring finetuning or complex workflows.\n\nKey capabilities include: character consistency across different scenes, local editing of specific image elements without affecting the rest, style reference to generate novel scenes while preserving unique styles, and interactive speed for iterative image generation and editing with minimal latency.\n\nThe FLUX.1 Kontext suite comes in three versions:\n\n*   **FLUX.1 Kontext [max]:** The premium model, prioritizing maximum performance, improved prompt adherence, typography generation, and consistency for editing.\n*   **FLUX.1 Kontext [pro]:** A unified model for local editing, generative modifications, and text-to-image generation with breakthrough speed and character consistency.\n*   **FLUX.1 Kontext [dev]:** An open-weights, distilled variant of Kontext for developers (coming soon).\n\nThe models are available through Black Forest Labs API and some versions are accessible on Playground. FLUX.1 Kontext aims to redefine image generation by providing consistent, context-aware editing and creation.\n",
    "chinese_title": "FLUX.1 上下文",
    "chinese_summary": "FLUX.1 Kontext：Black Forest Labs新一代文本图像驱动的生成式流匹配模型套件，用于图像生成和编辑。与传统文本到图像模型不同，FLUX.1 Kontext执行上下文生成，允许用户使用文本和图像进行提示，以修改和创建连贯的渲染效果。它通过简单的文本指令实现灵活且即时的图像编辑，无需微调或复杂的工作流程。\n\n主要功能包括：跨不同场景的角色一致性，对特定图像元素的局部编辑而不影响其余部分，风格参考以生成新颖的场景同时保留独特的风格，以及用于迭代图像生成和编辑的交互式速度和最小延迟。\n\nFLUX.1 Kontext套件包含三个版本：\n\n*   **FLUX.1 Kontext [max]:** 高级模型，优先考虑最大性能、改进的提示遵循度、排版生成和编辑一致性。\n*   **FLUX.1 Kontext [pro]:** 统一模型，用于局部编辑、生成式修改和文本到图像生成，具有突破性的速度和角色一致性。\n*   **FLUX.1 Kontext [dev]:** 开放权重，为开发者设计的Kontext精简变体（即将推出）。\n\n这些模型可通过Black Forest Labs API获得，某些版本可在Playground上访问。FLUX.1 Kontext 旨在通过提供一致的、上下文感知的编辑和创作来重新定义图像生成。"
  },
  {
    "id": "44132744",
    "title": "Triangle splatting: radiance fields represented by triangles",
    "url": "https://trianglesplatting.github.io/",
    "summary": "\"Triangle Splatting\" introduces a novel approach to radiance field rendering that leverages triangles as the primary scene representation, offering a compelling alternative to Neural Radiance Fields (NeRFs) and 3D Gaussian Splatting. The method utilizes a differentiable renderer that optimizes the triangles' 3D vertices, color, opacity, and smoothness through end-to-end gradient-based learning. Each triangle is rendered as a differentiable \"splat\" using a smooth window function derived from the triangle's signed distance field (SDF). This approach preserves sharp edges and fine details often lost with Gaussian primitives.\n\nKey features include the use of a learnable smoothness parameter (σ) to control the blend between triangle edges and surrounding pixels, and the accumulation of triangle contributions via alpha blending in front-to-back order. This differentiability allows for optimization using gradient descent.\n\nThe paper demonstrates that Triangle Splatting achieves higher visual fidelity, faster convergence, and increased rendering throughput compared to 2D/3D Gaussian Splatting methods. It outperforms concurrent non-volumetric methods on the Mip-NeRF360 dataset and rivals the state-of-the-art Zip-NeRF on indoor scenes regarding perceptual quality. Notably, the method achieves over 2,400 FPS at 1280x720 resolution for the Garden scene. The inherent compatibility of triangles with standard graphics pipelines is highlighted, showcasing the potential for seamless integration into game engines and real-time applications.\n",
    "chinese_title": "三角形飞溅：用三角形表示的辐射场",
    "chinese_summary": "三角片元渲染：一种基于三角形的辐射场渲染方法"
  },
  {
    "id": "44110721",
    "title": "Automated Verification of Monotonic Data Structure Traversals in C",
    "url": "https://arxiv.org/abs/2505.18818",
    "summary": "This arXiv article (arXiv:2505.18818) presents a new automated verification tool called Shrinker, designed to verify monotonic data structure traversals (MDSTs) in C code. MDSTs are a common type of data structure operation that iterates monotonically through a structure, such as `strlen` or binary search tree insertion.\n\nShrinker uses a novel program analysis strategy called \"scapegoating size descent,\" which leverages the similarity of execution traces between large and shrunk versions of inputs to improve verification efficiency. The tool aims to prove correctness, equivalence, and memory safety properties of MDSTs.\n\nThe authors introduce a benchmark set containing over 100 instances of MDSTs extracted from major C codebases like Linux, NetBSD, OpenBSD, QEMU, Git, and Musl. They demonstrate that Shrinker significantly outperforms state-of-the-art tools in verifying monotonic string and list traversals. The article mentions that Shrinker is a tool presented at CAV 2025, and a link to the tool is provided. The paper is categorized under Programming Languages (cs.PL) and Logic in Computer Science (cs.LO).\n",
    "chinese_title": "C语言中单调数据结构遍历的自动验证",
    "chinese_summary": "这篇arXiv文章（arXiv:2505.18818）介绍了一种名为Shrinker的新型自动化验证工具，该工具旨在验证C代码中的单调数据结构遍历（MDST）。MDST是一种常见的数据结构操作，它以单调方式遍历结构，例如`strlen`或二叉搜索树插入。\n\nShrinker使用一种名为“替罪羊式尺寸下降”的新颖程序分析策略，该策略利用输入的大版本和缩小版本之间执行轨迹的相似性来提高验证效率。该工具旨在证明MDST的正确性、等价性和内存安全属性。\n\n作者介绍了一个基准测试集，其中包含从Linux、NetBSD、OpenBSD、QEMU、Git和Musl等主要C代码库中提取的100多个MDST实例。他们证明，在验证单调字符串和列表遍历方面，Shrinker显著优于最先进的工具。文章提到Shrinker是CAV 2025上展示的工具，并提供了该工具的链接。该论文被归类于编程语言（cs.PL）和计算机科学逻辑（cs.LO）下。"
  },
  {
    "id": "44137028",
    "title": "Investigating AI Manipulation in Viral Chinese Paraglider Video",
    "url": "https://blog.hyperknot.com/p/investigating-ai-manipulation-in",
    "summary": "Zsolt Ero's article investigates the authenticity of a viral video claiming to show a Chinese paraglider pilot, Peng Yujiang, reaching an altitude of 8,598 meters after being sucked into a cloud. Ero, a paragliding enthusiast and AI observer, questions the video's legitimacy, identifying one scene as definitively AI-generated due to unnatural camera movements, distorted perspectives, and inconsistencies in the pilot's equipment.\n\nHe believes the video contains three distinct segments: an AI-generated scene, footage from a previous paragliding attempt, and footage from the actual record flight. He supports this by highlighting differences in the pilot's appearance, equipment (harness, phone vs. power bank), and the presence of a mechanical altimeter unusual for modern paragliding. He suspects the original footage might have been purposefully mixed with AI and older recordings, possibly even as part of a marketing campaign.\n\nEro speculates that the pilot's achievement is genuine, suggesting Peng Yujiang, potentially with specialized training, could have reached such altitudes despite the extreme conditions. The author finds it concerning that major news outlets disseminated the video without properly vetting its authenticity, particularly given the relatively low quality of the AI-generated segment. He expresses greater concern about the future, highlighting the rapid advancements in AI video generation and questioning how news outlets will distinguish fact from fiction as AI becomes increasingly sophisticated. The article concludes with examples of state-of-the-art AI video capabilities.\n",
    "chinese_title": "调查中国滑翔伞视频中AI操纵的现象",
    "chinese_summary": "佐尔特·埃罗的文章调查了一段病毒式视频的真实性，该视频声称中国滑翔伞飞行员彭宇江被吸入云层后达到了8598米的高度。 埃罗是一位滑翔伞爱好者和人工智能观察员，他对该视频的合法性提出质疑，认为其中一个场景绝对是人工智能生成的，原因是存在不自然的相机移动、扭曲的视角以及飞行员装备的不一致。\n\n他认为该视频包含三个不同的部分：一个人工智能生成的场景、先前滑翔伞尝试的录像，以及实际的记录飞行录像。 他通过强调飞行员的外貌、装备（安全带、手机与充电宝）以及现代滑翔伞不常用的机械高度表等方面的差异来支持这一观点。 他怀疑原始录像可能被故意与人工智能和旧录像混合，甚至可能是营销活动的一部分。\n\n埃罗推测飞行员的成就可能是真实的，他认为彭宇江可能接受过专门训练，即使在极端条件下也可能达到如此的高度。 作者发现令人担忧的是，各大新闻媒体在没有适当审查其真实性的情况下传播了该视频，特别是考虑到人工智能生成部分的质量相对较低。 他对未来更加担忧，强调人工智能视频生成技术的快速进步，并质疑随着人工智能变得越来越复杂，新闻媒体将如何区分事实与虚构。 文章最后列举了最先进的人工智能视频功能示例。"
  },
  {
    "id": "44132823",
    "title": "Show HN: MCP Server SDK in Bash",
    "url": "https://github.com/muthuishere/mcp-server-bash-sdk",
    "summary": "This \"Show HN\" post introduces a lightweight MCP (Model Context Protocol) server implementation written in pure Bash, offering a zero-overhead alternative to heavier runtimes like Node.js or Python. The implementation supports the full JSON-RPC 2.0 protocol over stdio, complete MCP protocol, dynamic tool discovery via function naming, external configuration using JSON files, and easy extensibility.\n\nKey features include: Bash shell and `jq` dependency, handling of JSON-RPC and MCP protocol within `mcpserver_core.sh`, business logic in separate files (e.g., `moviemcpserver.sh`), and configuration stored in the `assets/` directory.\n\nThe post outlines how to create a custom MCP server (e.g., `weatherserver.sh`), including sourcing the core script, defining tool functions (e.g., `tool_get_weather`), configuring `tools_list.json` and `mcpserverconfig.json`, and running the server.  It also shows how to integrate the server with VS Code and GitHub Copilot by updating the settings and using the `/mcp` command.\n\nLimitations include lack of concurrency, limited memory management, no streaming responses, and unsuitability for high throughput scenarios. However, the author argues that these limitations are acceptable for AI assistants and local tool execution. The project is MIT licensed and available on GitHub.\n",
    "chinese_title": "显示 HN：Bash 中的 MCP 服务器 SDK",
    "chinese_summary": "此“Show HN”帖子介绍了一个纯Bash编写的轻量级MCP（模型上下文协议）服务器实现，为Node.js或Python等较重运行时提供了一个零开销的替代方案。该实现通过stdio支持完整的JSON-RPC 2.0协议，完整的MCP协议，通过函数命名实现动态工具发现，使用JSON文件进行外部配置，并且易于扩展。\n\n主要特性包括：Bash shell和`jq`依赖，在`mcpserver_core.sh`中处理JSON-RPC和MCP协议，业务逻辑位于单独的文件中（例如，`moviemcpserver.sh`），以及配置存储在`assets/`目录中。\n\n该帖子概述了如何创建自定义MCP服务器（例如，`weatherserver.sh`），包括引入核心脚本，定义工具函数（例如，`tool_get_weather`），配置`tools_list.json`和`mcpserverconfig.json`，以及运行服务器。它还展示了如何通过更新设置和使用`/mcp`命令将服务器与VS Code和GitHub Copilot集成。\n\n局限性包括缺乏并发性，有限的内存管理，没有流式响应，以及不适用于高吞吐量场景。但是，作者认为这些局限性对于AI助手和本地工具执行是可以接受的。该项目采用MIT许可，可在GitHub上获取。"
  },
  {
    "id": "44123474",
    "title": "The Art of the Critic",
    "url": "https://www.metropolitanreview.org/p/the-art-of-the-critic",
    "summary": "In \"The Art of the Critic,\" Nick Ripatrazone explores the importance of robust and insightful literary criticism, drawing heavily on the example of Henry James. James, a prolific critic before becoming a renowned novelist, believed that criticism was a vital art form, essential for the health of the novel and literary culture.\n\nThe article highlights James's sharp, nuanced criticism, illustrated by his reviews of Dickens and Balzac. James believed critics should engage deeply with a work's technique, context, and concepts, and that criticism should be specific and grounded in the \"concrete instance[s] of the art.\" Ripatrazone argues that James's approach stemmed from his belief that novels should strive to represent life, and that serious art requires serious critical engagement.\n\nRipatrazone laments the decline of quality criticism in contemporary literary culture, noting the shrinking of book review sections, the lack of fair compensation for critics, and the rise of superficial book \"coverage.\" He echoes Elizabeth Hardwick's concerns about \"sweet, bland commendations\" replacing honest assessment.\n\nHe argues that a healthy literary ecosystem requires informed, engaged readers and critics who can foster a higher standard of writing and thought. Ripatrazone concludes by emphasizing James's belief that intelligent, sustained engagement with literary works is invaluable for authors and the overall development of literary art. He encourages critics and writers to embrace life and explore its depths, contributing to a vibrant and thriving literary landscape.\n",
    "chinese_title": "评论的艺术",
    "chinese_summary": "批评的艺术：\n\n尼克·里帕特拉佐内在《批评的艺术》一文中探讨了深刻而富有洞见的文学批评的重要性，并大量借鉴了亨利·詹姆斯的例子。詹姆斯在成为著名小说家之前是一位多产的评论家，他认为批评是一种重要的艺术形式，对小说和文学文化的健康至关重要。\n\n文章重点介绍了詹姆斯敏锐而细致的批评，以他对狄更斯和巴尔扎克的评论为例。詹姆斯认为，评论家应该深入研究作品的技巧、背景和概念，并且批评应该具体并扎根于“艺术的具体实例”。里帕特拉佐内认为，詹姆斯的方法源于他坚信小说应该努力再现生活，并且严肃的艺术需要严肃的批判性参与。\n\n里帕特拉佐内感叹当代文学文化中高质量批评的衰落，他注意到书评版块的萎缩、评论家缺乏公平的报酬以及肤浅的书籍“报道”的兴起。他呼应了伊丽莎白·哈德威克对“甜蜜而平淡的赞扬”取代诚实评价的担忧。\n\n他认为，健康的文学生态系统需要知情、投入的读者和评论家，他们能够培养更高标准的写作和思想。里帕特拉佐内最后强调了詹姆斯的观点，即对文学作品进行深入而持续的参与对于作者和文学艺术的整体发展来说是无价的。他鼓励评论家和作家拥抱生活并探索其深度，为充满活力和蓬勃发展的文学景观做出贡献。"
  },
  {
    "id": "44136945",
    "title": "The Nobel Prize Winner Who Thinks We Have the Universe All Wrong",
    "url": "https://www.theatlantic.com/science/archive/2025/05/adam-riess-hubble-tension/682980/",
    "summary": "Adam Riess, a Nobel laureate for his discovery of the accelerating expansion of the universe driven by dark energy, now questions the \"standard model of cosmology\" that his work helped establish. This model suggests the universe will end in a cold, empty state due to the dominance of dark energy.\n\nRiess's current research focuses on the Hubble tension – a discrepancy between the universe's expansion rate measured directly from distant galaxies and the rate extrapolated from observations of the early universe (afterglow of the Big Bang) based on the standard model. His precise measurements of galactic distances reveal a faster expansion rate than predicted, suggesting a potential flaw in the theory.\n\nWhile some cosmologists believe the Hubble tension will resolve with more data, Riess argues it indicates a fundamental problem with the standard model. He points to recent data from the Dark Energy Spectroscopic Instrument (DESI) hinting that dark energy might not be constant, potentially weakening or even reversing over time, leading to a different cosmic future.\n\nThis challenges the established view of a universe ending in \"heat death,\" opening possibilities for a static universe or even a cyclical one. Riess anticipates further data releases will strengthen the challenge, though his views are met with skepticism from some in the field who advocate for the established model.\n",
    "chinese_title": "认为我们对宇宙的理解完全错误的诺贝尔奖得主",
    "chinese_summary": "亚当·里斯，因发现暗能量驱动的宇宙加速膨胀而荣获诺贝尔奖，如今对由他的工作帮助建立的“宇宙学标准模型”提出了质疑。该模型认为，由于暗能量的主导地位，宇宙将终结于一个寒冷、空虚的状态。\n\n里斯目前的研究重点是哈勃张力——直接从遥远星系测量的宇宙膨胀速率与基于标准模型，从早期宇宙（大爆炸余辉）观测推断出的膨胀速率之间的差异。他对星系距离的精确测量显示，膨胀速率比预测的要快，这表明该理论可能存在缺陷。\n\n虽然一些宇宙学家认为哈勃张力会随着更多数据的出现而得到解决，但里斯认为它表明了标准模型存在根本问题。他指出，来自暗能量光谱仪器（DESI）的最新数据暗示暗能量可能不是恒定的，可能会随着时间的推移而减弱甚至逆转，从而导致不同的宇宙未来。\n\n这挑战了宇宙终结于“热寂”的既定观点，为静态宇宙甚至循环宇宙开启了可能性。里斯预计，进一步的数据发布将加强这一挑战，尽管他的观点受到了该领域一些拥护既定模型的人的怀疑。"
  },
  {
    "id": "44132075",
    "title": "U.S. sanctions cloud provider 'Funnull' as top source of 'pig butchering' scams",
    "url": "https://krebsonsecurity.com/2025/05/u-s-sanctions-cloud-provider-funnull-as-top-source-of-pig-butchering-scams/",
    "summary": "The U.S. government sanctioned Funnull Technology Inc., a Philippines-based company, for providing infrastructure used in widespread \"pig butchering\" scams that have cost Americans over $200 million. Funnull operated as a criminal content delivery network (CDN), routing traffic through U.S.-based cloud providers to conceal the origin of scam websites and facilitate virtual currency investment fraud.\n\nThese scams involve online strangers luring victims into investing in fraudulent cryptocurrency trading platforms, where they are encouraged to deposit increasing amounts of money before ultimately being unable to withdraw their funds.\n\nSecurity firm Silent Push discovered that Funnull was also linked to gambling sites with ties to the Suncity Group, which was accused of laundering money for the North Korean hacking group Lazarus.\n\nDespite pledges from Amazon and Microsoft to remove Funnull from their networks, Silent Push found that Amazon continues to host Funnull servers.\n\nThe article also mentions the EU sanctioning Stark Industries Solutions, an ISP used to conceal the source of cyberattacks and disinformation campaigns against Russia. Stark's traffic was also found to route through U.S.-based cloud providers. The EU also sanctioned Stark's co-founders, Moldovan brothers Ivan and Yuri Neculiti. These incidents highlight the vulnerability of U.S. cloud providers being used to facilitate cybercrime due to the potential disruption of blocking legitimate traffic.\n",
    "chinese_title": "美国制裁云服务商“Funnull”，因其为“杀猪盘”诈骗的主要来源",
    "chinese_summary": "美国政府制裁了总部位于菲律宾的Funnull Technology Inc.，该公司为广泛的“杀猪盘”诈骗提供了基础设施，这些诈骗已使美国人损失超过2亿美元。 Funnull 充当犯罪内容分发网络 (CDN)，通过位于美国的云提供商路由流量，以隐藏诈骗网站的来源并促进虚拟货币投资诈骗。\n\n这些诈骗涉及在线陌生人诱骗受害者投资于欺诈性加密货币交易平台，在这些平台上，他们被鼓励存入越来越多的资金，最终却无法提取资金。\n\n安全公司Silent Push发现Funnull还与赌博网站有关，这些网站与太阳城集团有联系，太阳城集团被指控为朝鲜黑客组织 Lazarus 洗钱。\n\n尽管亚马逊和微软承诺将Funnull从其网络中移除，但Silent Push发现亚马逊仍在托管Funnull服务器。\n\n文章还提到欧盟制裁了 Stark Industries Solutions，这是一家用于隐藏针对俄罗斯的网络攻击和虚假信息宣传活动来源的 ISP。 据发现，Stark 的流量也通过位于美国的云提供商路由。 欧盟还制裁了 Stark 的联合创始人，摩尔多瓦兄弟 Ivan 和 Yuri Neculiti。 这些事件凸显了美国云提供商被用于促进网络犯罪的脆弱性，原因是阻止合法流量可能会造成中断。"
  },
  {
    "id": "44132486",
    "title": "OpenBao Namespaces",
    "url": "https://openbao.org/blog/namespaces-announcement/",
    "summary": "OpenBao introduces Namespaces, a feature enabling robust multi-tenancy and isolation within a single OpenBao instance. Namespaces function as isolated environments for teams, organizations, or applications, each with its own policies, authentication, secret engines, tokens, and identity groups. This empowers organizations to implement an \"OpenBao-as-a-Service\" model.\n\nNamespaces address the need for strong isolation as organizations scale, offering secure multi-tenancy where each tenant operates independently with strictly scoped permissions. They also enable delegated administration and self-service, allowing namespace admins to manage their resources without impacting others. Furthermore, namespaces are a step towards horizontal scalability, aiming to support large deployments with infrequent resource access while maintaining a simpler cluster topology.\n\nThe article demonstrates creating namespaces using the `bao namespace` command, showing how to build a hierarchical structure for a SaaS company separating tenant and platform resources. It illustrates how namespace-aware commands, like `bao secrets enable` and `bao kv`, allow resource creation and management within specific namespaces.\n\nThe feature includes lifecycle operations such as namespace-aware policies and quotas, moving/renaming engines across namespaces, and namespace locking/unlocking. While offering new capabilities, API compatibility with Vault Enterprise is maintained. Future plans involve lazy loading of namespaces and mounts for improved scalability and resilience, as well as exploring namespace sealing, non-hierarchical namespaces, per-namespace storage backends, and plugin isolation. OpenBao 2.3 includes a beta release of this feature.\n",
    "chinese_title": "OpenBao命名空间",
    "chinese_summary": "OpenBao 引入命名空间：实现强大的多租户和隔离\n\nOpenBao 引入了命名空间功能，可在单个 OpenBao 实例中实现强大的多租户和隔离。命名空间作为团队、组织或应用程序的隔离环境，每个命名空间都有自己的策略、身份验证、密钥引擎、令牌和身份组。 这使组织能够实施“OpenBao 即服务”模型。\n\n随着组织的扩展，命名空间解决了对强隔离的需求，提供安全的多租户，其中每个租户都以严格限定的权限独立运行。它们还支持委托管理和自助服务，允许命名空间管理员管理其资源而不影响他人。此外，命名空间是实现水平可扩展性的一步，旨在支持具有不频繁资源访问的大型部署，同时保持更简单的集群拓扑。\n\n本文演示了如何使用 `bao namespace` 命令创建命名空间，展示了如何为 SaaS 公司构建分离租户和平台资源的分层结构。它说明了命名空间感知命令（例如 `bao secrets enable` 和 `bao kv`）如何允许在特定命名空间中创建和管理资源。\n\n该功能包括生命周期操作，例如命名空间感知策略和配额、跨命名空间移动/重命名引擎以及命名空间锁定/解锁。在提供新功能的同时，保持了与 Vault Enterprise 的 API 兼容性。未来的计划包括命名空间和挂载的延迟加载，以提高可扩展性和弹性，以及探索命名空间密封、非分层命名空间、每个命名空间的存储后端和插件隔离。OpenBao 2.3 包括此功能的 Beta 版本。"
  },
  {
    "id": "44126612",
    "title": "Show HN: I wrote a modern Command Line Handbook",
    "url": "https://commandline.stribny.name/",
    "summary": "This \"Show HN\" post introduces a modern Command Line Handbook designed to help anyone, from software developers to regular users, master the Unix/Linux command line. The handbook aims to provide a concise and practical understanding of terminals, shells, command-line applications, and shell scripting, avoiding the need to wade through extensive manuals.\n\nThe handbook includes over 100 annotated shell sessions and code examples to enable hands-on learning. Updated in 2025, the book is presented as a culmination of four years of development and designed to showcase the most essential command-line concepts efficiently.\n\nAccording to the author, Petr Stribny, the handbook is designed to help users realize the command line's full potential, introducing efficient usage of shells like Bash and Zsh, scripting, and various classic and modern terminal programs. The handbook is available as a PDF and currently priced at $14, with over 5700 readers already benefiting from it.\n",
    "chinese_title": "Show HN: 我写了一本现代命令行手册",
    "chinese_summary": "“Show HN”：现代命令行手册，助你精通Unix/Linux命令行。该手册旨在为软件开发者和普通用户提供关于终端、Shell、命令行应用和Shell脚本的简洁实用指南，避免阅读冗长手册。\n\n手册包含100多个带注释的Shell会话和代码示例，便于实践学习。该书于2025年更新，是四年开发的结晶，旨在高效展示最关键的命令行概念。\n\n作者Petr Stribny表示，该手册旨在帮助用户充分发挥命令行的潜力，介绍Bash和Zsh等Shell的高效用法、脚本编写以及各种经典和现代终端程序。该手册提供PDF格式，目前售价14美元，已有超过5700名读者从中受益。"
  },
  {
    "id": "44109017",
    "title": "The atmospheric memory that feeds billions of people: Monsoon rainfall mechanism",
    "url": "https://phys.org/news/2025-05-atmospheric-memory-billions-people-monsoon.html",
    "summary": "This article from the Potsdam Institute for Climate Impact Research (PIK) reveals that the atmosphere possesses a \"memory\" that significantly influences monsoon rainfall patterns. Contrary to the traditional understanding that monsoon seasons are solely driven by solar radiation, the study, published in *Proceedings of the National Academy of Sciences*, demonstrates the atmosphere's ability to store moisture, creating a \"bistable\" system with a physical memory effect.\n\nThe research, combining observational data and atmospheric simulations, shows that the atmosphere can exist in either a dry or rainy state at the same level of solar radiation, depending on its history. In spring, it must \"fill up\" with water vapor to initiate the monsoon, while in autumn, it remains moist and supports rainfall even as solar radiation decreases. This leads to abrupt on/off shifts in monsoon rainfall.\n\nResearchers identified a moisture threshold of approximately 35 kilograms per square meter, above which the monsoon switches on, and below which it switches off. Disruptions to this system, such as pollution or global warming, could have severe consequences for billions of people across India, Indonesia, Brazil, and China who rely on monsoon rains for their livelihoods. The discovery of this atmospheric memory and its associated tipping point could potentially lead to the development of early warning systems for monsoon shifts.\n",
    "chinese_title": "滋养数十亿人的大气记忆：季风降雨机制",
    "chinese_summary": "波茨坦气候影响研究所（PIK）的这篇文章揭示了大气层具有显著影响季风降雨模式的“记忆”。这项发表在《美国国家科学院院刊》上的研究表明，与传统上认为季风季节仅由太阳辐射驱动的观点相反，大气层具有储存水分的能力，从而形成具有物理记忆效应的“双稳态”系统。\n\n这项结合观测数据和大气模拟的研究表明，在相同的太阳辐射水平下，大气层可以根据其历史记录处于干燥或多雨的状态。在春季，大气层必须“充满”水汽才能启动季风，而在秋季，即使太阳辐射减少，它仍然保持湿润并支持降雨。这导致季风降雨突然开启/关闭。\n\n研究人员确定了一个大约为每平方米35公斤的湿度阈值，高于该阈值季风开启，低于该阈值季风关闭。对该系统的破坏，如污染或全球变暖，可能会对依赖季风降雨为生的印度、印度尼西亚、巴西和中国数十亿人造成严重后果。发现这种大气记忆及其相关的临界点，有可能促成季风转变的早期预警系统的开发。"
  },
  {
    "id": "44106048",
    "title": "Smallest Possible Files",
    "url": "https://github.com/mathiasbynens/small",
    "summary": "This repository aims to collect the smallest possible, yet syntactically valid, files across a wide range of programming languages, scripting languages, markup languages, audio, video, document, and graphics formats, as well as executables and archives.\n\nThe project, initiated from a blog post about minimal HTML files, invites contributions from the community in the form of pull requests. It operates under a license that waives all copyright and related rights to the work.\n\nThe repository is organized by file type, listing various formats under categories such as: Archives (e.g., .zip, .rar, .tar), Audio (e.g., .mp3, .wav), Documents (e.g., .pdf, .rtf), Executables (e.g., .exe, .elf, .wasm), Graphics (e.g., .jpg, .png, .gif, .webp), Languages (e.g., .c, .java, .python, .php, .js, .sh), Markup (e.g., .json, .xml, .html, .svg), and Video (e.g., .mp4, .webm, .avi).\n\nFurthermore, it includes an \"Unsorted\" category, featuring various unique and miscellaneous formats like cache manifest (.appcache), vertex-shader, whitespace, Git commits, and several esoteric programming languages. This diverse collection showcases the minimal requirements for different file types to be considered valid.\n",
    "chinese_title": "最小文件尺寸",
    "chinese_summary": "本仓库旨在收集各种编程语言、脚本语言、标记语言、音频、视频、文档和图形格式，以及可执行文件和存档的尽可能小，但语法上有效的文件。\n\n该项目源于一篇关于最小HTML文件的博客文章，并邀请社区以pull request的形式贡献。它采用放弃所有版权及相关权利的许可协议。\n\n本仓库按文件类型组织，在诸如“存档”（例如，.zip、.rar、.tar）、“音频”（例如，.mp3、.wav）、“文档”（例如，.pdf、.rtf）、“可执行文件”（例如，.exe、.elf、.wasm）、“图形”（例如，.jpg、.png、.gif、.webp）、“语言”（例如，.c、.java、.python、.php、.js、.sh）、“标记”（例如，.json、.xml、.html、.svg）和“视频”（例如，.mp4、.webm、.avi）等类别下列出各种格式。\n\n此外，它还包括一个“未分类”类别，其中包含各种独特和杂项格式，例如缓存清单 (.appcache)、顶点着色器、空白、Git提交以及几种深奥的编程语言。这个多样化的集合展示了不同文件类型被认为是有效的最小要求。"
  },
  {
    "id": "44112653",
    "title": "Printing metal on glass with lasers [video]",
    "url": "https://www.youtube.com/watch?v=J0NNO91WyXM",
    "summary": "This content isn't an article, but rather a description of a YouTube video. The only information provided is:\n\n*   **Title:** Printing metal on glass with lasers. This indicates the video likely demonstrates or discusses a process of using lasers to deposit or fuse metal onto glass surfaces.\n*   **Content:** This is just standard boilerplate text found at the bottom of YouTube pages, including links to YouTube's policies, terms of service, copyright information, advertising, and other general platform information. It also mentions NFL Sunday Ticket and Google LLC.\n\nTherefore, the core information is simply that the video is titled \"Printing metal on glass with lasers\" and is hosted on YouTube. We have no further details about the specific laser technology, metals used, or the applications of this process.\n",
    "chinese_title": "用激光在玻璃上打印金属 [视频]",
    "chinese_summary": "此内容并非文章，而是对YouTube视频的描述。仅提供以下信息：\n\n*   **标题：**用激光在玻璃上打印金属。这表明该视频很可能演示或讨论了一种使用激光将金属沉积或熔合到玻璃表面的过程。\n*   **内容：** 这只是在YouTube页面底部找到的标准样板文本，包括YouTube政策、服务条款、版权信息、广告和其他通用平台信息的链接。它还提到了NFL Sunday Ticket和Google LLC。\n\n因此，核心信息仅仅是视频的标题为“用激光在玻璃上打印金属”，并且托管在YouTube上。我们没有关于具体激光技术、使用的金属或此过程的应用的更多详细信息。"
  },
  {
    "id": "44136108",
    "title": "MinIO Removes Web UI Features from Community Version, Pushes Users to Paid Plans",
    "url": "https://biggo.com/news/202505261334_MinIO_Removes_Web_UI_Features",
    "summary": "MinIO, a popular open-source object storage solution, has sparked controversy by removing key web-based management features from its community version. This forces users to rely on command-line tools (mc client) or upgrade to a paid plan to regain access to features like account/policy management, configuration settings, and bucket management via a web interface.\n\nThis shift has been compared to \"enshittification,\" as it degrades the user experience to push users towards paid solutions. The core storage functionality remains intact, but organizations now face the choice of retraining staff, paying for commercial licenses, or migrating to alternatives.\n\nThe community response has been largely negative, with some users exploring alternatives like SeaweedFS, Garage, and Zenko, which offer S3-compatible storage. A community fork, OpenMaxIO, has even emerged, preserving the last version of MinIO before these changes.\n\nMinIO argues this strategy monetizes enterprise features while maintaining the core storage engine as open source to sustain development. However, the execution of these changes has created uncertainty, forcing users to reassess their storage solutions.\n",
    "chinese_title": "MinIO从社区版移除Web UI功能，引导用户转向付费计划",
    "chinese_summary": "MinIO移除社区版关键Web管理功能引发争议。此举迫使用户依赖命令行工具(mc客户端)或升级到付费计划才能重新访问诸如账户/策略管理、配置设置和通过Web界面进行存储桶管理等功能。\n\n这种转变被比作“垃圾化”，因为它降低了用户体验，迫使用户转向付费解决方案。核心存储功能保持不变，但组织现在面临着培训员工、支付商业许可或迁移到替代方案的选择。\n\n社区的反应大多是负面的，一些用户正在探索SeaweedFS、Garage和Zenko等提供S3兼容存储的替代方案。甚至出现了一个社区分支OpenMaxIO，保留了这些更改之前的最后一个MinIO版本。\n\nMinIO认为，这一策略使企业功能货币化，同时保持核心存储引擎开源，以维持开发。然而，这些变更的执行带来了不确定性，迫使用户重新评估他们的存储解决方案。"
  },
  {
    "id": "44108139",
    "title": "Why is everybody knitting chickens?",
    "url": "https://ironicsans.ghost.io/why-is-everybody-knitting-chickens/",
    "summary": "The article explores the recent knitting craze surrounding \"Emotional Support Chickens,\" a huggable, throw-pillow-sized knitted chicken designed by Annette Corsino at The Knitting Tree in Los Angeles. The pattern, adapted from a 90s design, gained immense popularity in the knitting community, especially during COVID lockdowns, due to its comforting nature and accessible skill level.\n\nNearly 11,000 people have shared their chicken creations on Ravelry, often giving them punny celebrity-inspired names. The Knitting Tree has sold thousands of patterns and kits, and the trend has even extended to knit-along events.\n\nBeyond personal enjoyment, the chickens are also being used for charitable purposes. A Facebook group is dedicated to knitting Emotional Support Chickens for survivors of Hurricane Helene, highlighting their comforting effect in times of crisis.\n\nThe trend has spurred variations on the pattern, including crochet and mini versions, and has garnered media attention, including news segments and reports on Olympic-themed chickens displayed in a UK yarn shop. The author concludes by acknowledging his late discovery of this popular trend and invites readers to share their own experiences with knitting emotional support chickens.\n",
    "chinese_title": "为什么大家都在织鸡？",
    "chinese_summary": "本文探讨了近期围绕“情感支持鸡”的编织热潮。这是一种由洛杉矶The Knitting Tree的Annette Corsino设计的、可拥抱的、靠垫大小的针织鸡。该图案改编自90年代的设计，因其舒适性和易于上手的技能水平，在编织界获得了巨大的欢迎，尤其是在新冠疫情封锁期间。\n\n在Ravelry上，近11000人分享了他们的鸡作品，并经常给它们起俏皮的名人名字。The Knitting Tree已经售出了数千份图案和套件，这种趋势甚至延伸到了编织聚会活动。\n\n除了个人享受之外，这些鸡也被用于慈善目的。一个Facebook小组致力于为飓风海伦的幸存者编织情感支持鸡，突显了它们在危机时刻的安慰作用。\n\n这种趋势催生了该图案的各种变体，包括钩针版本和迷你版本，并引起了媒体的关注，包括新闻片段和英国一家纱线店展出的奥运主题鸡的报道。作者最后承认他迟迟才发现这种流行的趋势，并邀请读者分享他们自己编织情感支持鸡的体验。"
  },
  {
    "id": "44132752",
    "title": "Show HN: Donut Browser, a Browser Orchestrator",
    "url": "https://donutbrowser.com/",
    "summary": "Donut Browser is a free, open-source \"browser orchestrator\" that allows users to manage and utilize multiple browsers and profiles. It offers the ability to download browsers like Chromium and Firefox, and create unlimited local profiles, each completely isolated with independent settings, extensions, and data. A key feature is built-in proxy support for all browsers except Tor.\n\nThe software is designed to be fast and lightweight, minimizing resource usage for quick startup and smooth operation. It also addresses the common issue of opening links in the wrong browser by allowing users to designate specific browsers for different links.\n\nCurrently, Donut Browser is available for macOS, with Windows and Linux support planned for the future. It promises to remain free forever, with its source code accessible on GitHub. Its core offering is giving users complete control over their browsing experience with an emphasis on privacy and flexibility through unlimited profile creation and seamless multi-browser management.\n",
    "chinese_title": "展示 HN: Donut Browser，一个浏览器编排器",
    "chinese_summary": "Donut浏览器是一款免费、开源的“浏览器编排器”，允许用户管理和使用多个浏览器和配置文件。它提供下载 Chromium 和 Firefox 等浏览器的功能，并创建无限的本地配置文件，每个配置文件完全隔离，具有独立的设置、扩展程序和数据。一个关键特性是为除 Tor 之外的所有浏览器内置代理支持。\n\n该软件设计快速且轻量级，最大限度地减少资源使用，从而实现快速启动和平稳运行。它还解决了在错误浏览器中打开链接的常见问题，允许用户为不同的链接指定特定的浏览器。\n\n目前，Donut浏览器适用于 macOS，计划未来支持 Windows 和 Linux。 它承诺永远免费，其源代码可在 GitHub 上访问。 它的核心优势是让用户完全控制他们的浏览体验，并通过无限的配置文件创建和无缝的多浏览器管理来强调隐私和灵活性。"
  },
  {
    "id": "44135695",
    "title": "Behavioral responses of domestic cats to human odor",
    "url": "https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0324016",
    "summary": "This study investigates how domestic cats use olfaction to distinguish between known (owner) and unknown humans. Thirty cats were presented with three odor stimuli: the owner's scent, an unknown person's scent, and a blank control. Researchers recorded the cats' behaviors, including sniffing duration and nostril use. Owners also completed questionnaires assessing the cats' personality (Feline Five) and the cat-owner relationship (CORS).\n\nThe results showed that cats spent significantly more time sniffing the unknown person's odor compared to the owner's, indicating that they use smell to differentiate between individuals. Cats also displayed lateralization in nostril use when responding to the unknown human's scent. A correlation was found between the first odor sniffed and the cat's personality score, and a strong correlation was observed between repetitive sniffing and personality in male cats. However, there was no association between behavior and the cat-owner relationship score. The study also observed that cats often rubbed their faces on the object immediately after sniffing, suggesting a possible link between olfactory exploration and odor-marking behavior. The study concluded that cats use olfaction to distinguish between humans, and that there may be a link between olfaction and behavior, requiring further investigation.\n",
    "chinese_title": "家猫对人类气味的行为反应",
    "chinese_summary": "本研究调查家猫如何利用嗅觉来区分熟悉（主人）和陌生的人类。给三十只猫呈现三种气味刺激：主人的气味、陌生人的气味和一个空白对照。研究人员记录了猫的行为，包括嗅闻时长和鼻孔的使用情况。主人也完成了问卷，评估猫的性格（猫科动物五因素）和猫主人关系（CORS）。\n\n结果表明，猫嗅闻陌生人的气味所花费的时间明显多于主人的气味，表明它们利用气味来区分个体。猫在对陌生人的气味作出反应时，也表现出鼻孔使用的偏侧性。研究发现，初次嗅闻的气味与猫的性格得分之间存在相关性，并且在雄性猫中，重复嗅闻与性格之间存在很强的相关性。然而，行为与猫主人关系得分之间没有关联。该研究还观察到，猫经常在嗅闻后立即在物体上摩擦脸部，表明嗅觉探索与气味标记行为之间可能存在联系。该研究得出结论，猫利用嗅觉来区分人类，并且嗅觉与行为之间可能存在联系，需要进一步研究。"
  },
  {
    "id": "44105746",
    "title": "Making C and Python Talk to Each Other",
    "url": "https://leetarxiv.substack.com/p/making-c-and-python-talk-to-each",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "让C和Python互相通信",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "44132404",
    "title": "Player Piano Rolls",
    "url": "https://omeka-s.library.illinois.edu/s/MPAL/page/player-piano-rolls-landing",
    "summary": "This webpage serves as an introduction to the world of player piano rolls. It outlines the different types of rolls available: Arranged, Hand-Played, and Reproducing rolls. The page likely delves into the distinctions between these types, potentially explaining how they are created and the unique playing experiences they offer. The presence of a section on \"Recut Rolls\" suggests the site also explores the history and evolution of player piano roll production.\n\nThe mention of \"MPAL's Roll Collection\" indicates that the site might highlight a specific collection of rolls, possibly focusing on its size, significance, or any unique characteristics it holds. Furthermore, the article notes the existence of rolls featuring composers performing their own works and highlighting player piano recording artists, signifying the historical importance of these technologies in preserving musical performances. A section dedicated to \"Works by Well-Known Composers\" suggests the page will likely offer insight into the repertoire available on player piano rolls.\n\nEssentially, this page provides an overview of player piano rolls, covering their different types, historical significance (including composers playing their own work), and the types of musical selections one can expect to find. It seems to be designed as a guide to help users understand and learn more about the fascinating world of player piano rolls.\n",
    "chinese_title": "钢琴卷帘",
    "chinese_summary": "本网页介绍了自动钢琴卷的世界，概述了编曲卷、手弹卷和复制卷等不同类型。页面可能深入探讨这些类型的区别，解释它们的制作方式以及提供的独特演奏体验。“重切卷”部分表明该网站还探讨了自动钢琴卷的历史和演变。“MPAL的卷收藏”表明该网站可能重点介绍一个特定的卷收藏，可能侧重于其规模、重要性或任何独特的特征。此外，文章还提到了作曲家演奏自己作品以及突出自动钢琴录音艺术家的卷，表明这些技术在保存音乐表演方面的历史重要性。“著名作曲家的作品”部分表明该页面可能会提供对自动钢琴卷上提供的曲目的见解。\n\n总而言之，该页面概述了自动钢琴卷，涵盖了它们的不同类型、历史意义（包括作曲家演奏自己的作品）以及人们可以找到的音乐选择类型。它似乎旨在作为帮助用户理解和了解更多关于迷人的自动钢琴卷世界的指南。"
  },
  {
    "id": "44135412",
    "title": "Take9 Won't Improve Cybersecurity",
    "url": "https://www.schneier.com/blog/archives/2025/05/why-take9-wont-improve-cybersecurity.html",
    "summary": "This article critiques the \"Take9\" cybersecurity awareness campaign, which encourages users to pause for nine seconds before clicking links or downloading files, arguing it's ineffective and misdirected. The author contends that the advice is unrealistic within the context of constant online activity and unlikely to help because it mirrors the failure of a similar past campaign, \"Stop. Think. Connect.\"\n\nThe core issue isn't a lack of pausing, but a lack of knowledge to discern threats. Take9 provides no guidance on *what* to think about during the pause, assuming users possess expertise they often lack. The author introduces the SCAM model (Suspicion, Cognition, Automaticity) to illustrate the complex interplay of factors influencing user decisions, highlighting the need for cognitive scaffolding and improved system design.\n\nThe article argues that successful awareness campaigns should trigger suspicion and then direct attention to specific elements to evaluate. The author acknowledges the increasing sophistication of phishing attacks and the vulnerability of even cybersecurity experts.\n\nFinally, the piece criticizes Take9 as bad public policy, as it blames users for falling victim to attacks, deflecting responsibility from the insecure systems we've created. The author argues that security awareness campaigns should not be used to cover up bad system design. Instead, the focus should be on developing secure systems that don't require users to be security experts.\n",
    "chinese_title": "Take9无法提高网络安全。",
    "chinese_summary": "本文批判了“Take9”网络安全意识活动，该活动鼓励用户在点击链接或下载文件前暂停九秒钟，认为其无效且方向错误。作者认为，在持续在线活动的情况下，该建议是不现实的，并且不太可能奏效，因为它与过去类似的“停止.思考.连接”活动失败如出一辙。\n\n核心问题不是缺乏暂停，而是缺乏辨别威胁的知识。“Take9”没有提供关于暂停期间应该*思考什么*的指导，而是假设用户拥有他们通常缺乏的专业知识。作者引入了SCAM模型（怀疑、认知、自动化）来阐述影响用户决策的各种因素之间的复杂关系，强调了对认知支架和改进系统设计的需求。\n\n本文认为，成功的安全意识活动应能触发怀疑，然后引导注意力到需要评估的具体要素上。作者承认网络钓鱼攻击日益复杂，甚至网络安全专家也容易受到攻击。\n\n最后，本文批评“Take9”是糟糕的公共政策，因为它将用户遭受攻击归咎于用户自身，从而转移了我们所创建的不安全系统的责任。作者认为，不应使用安全意识活动来掩盖糟糕的系统设计。相反，重点应该放在开发安全的系统上，这些系统不需要用户成为安全专家。"
  },
  {
    "id": "44105531",
    "title": "Superauthenticity: Computer Game Aspect Ratios",
    "url": "https://datadrivengamer.blogspot.com/2025/05/superauthenticity-computer-game-aspect.html",
    "summary": "This article, \"Superauthenticity: Computer Game Aspect Ratios,\" explores the complexities of accurately representing retro computer game graphics on modern displays, focusing on the often-overlooked aspect ratios. The author explains that early computer systems and consoles didn't use square pixels, leading to discrepancies when these games are displayed on square-pixel monitors. Factors like overscan and underscan further complicate the issue, as the displayed image often didn't perfectly match the 4:3 aspect ratio typically assumed.\n\nThe author introduces the concepts of \"authenticity\" (preserving overscan/underscan) and \"superauthenticity\" (potentially improving upon the original experience, even if it deviates from the precise original display). He criticizes the lack of non-square pixel support in common image formats.\n\nThe article then analyzes the ideal aspect ratios for various classic computer systems, including the Apple ][, TRS-80, Commodore PET, Atari 8-bit, VIC-20, IBM PC, and ZX Spectrum, providing specific examples of games from each platform. For each game, the author compares the visual results of using square pixels, a 4:3 display ratio, and system-specific aspect ratios, ultimately offering a subjective \"verdict\" on which option looks best. The conclusion emphasizes that while many emulators assume a 4:3 display, carefully considering the original pixel aspect ratios can lead to a more visually pleasing, if not perfectly \"authentic,\" gaming experience.\n",
    "chinese_title": "超真性：电脑游戏屏幕宽高比",
    "chinese_summary": "超真实性：电脑游戏宽高比\n\n本文《超真实性：电脑游戏宽高比》探讨了在现代显示器上准确呈现复古电脑游戏画面的复杂性，重点关注经常被忽视的宽高比问题。作者解释说，早期的电脑系统和游戏机并没有使用正方形像素，导致这些游戏在正方形像素显示器上显示时出现差异。过扫描和欠扫描等因素进一步使问题复杂化，因为显示的图像通常与通常假定的4:3宽高比并不完全匹配。\n\n作者介绍了“真实性”（保留过扫描/欠扫描）和“超真实性”（可能改进原始体验，即使它偏离了精确的原始显示）的概念。 他批评了常见图像格式缺乏对非正方形像素的支持。\n\n然后，本文分析了各种经典电脑系统的理想宽高比，包括Apple ][，TRS-80，Commodore PET，Atari 8-bit，VIC-20，IBM PC和ZX Spectrum，并提供了每个平台的游戏的具体示例。对于每个游戏，作者比较了使用正方形像素，4:3显示比例和系统特定宽高比的视觉效果，最终对哪个选项看起来最好提供了主观的“结论”。结论强调，虽然许多模拟器假定4:3显示，但仔细考虑原始像素宽高比可以带来更令人愉悦的视觉效果，即使不是完全“真实”的游戏体验。"
  },
  {
    "id": "44127739",
    "title": "Human coders are still better than LLMs",
    "url": "https://antirez.com/news/153",
    "summary": "This article argues that human coders currently outperform Large Language Models (LLMs) in software development. While LLMs have made significant strides in generating code snippets and automating certain tasks, the article suggests they fall short in critical areas where human expertise remains essential.\n\nThe core reasons for human coders' continued superiority likely stem from LLMs' limitations in:\n\n*   **Abstract Reasoning and Problem Solving:** Human coders excel at understanding complex requirements, architecting solutions, and adapting to unforeseen challenges, abilities that often surpass LLMs' current capabilities. LLMs may struggle with novel problems that require deeper understanding beyond their training data.\n*   **Contextual Awareness and Understanding:** LLMs can struggle to fully grasp the nuances of project goals, team dynamics, legacy code, and business logic, hindering their ability to generate contextually appropriate and maintainable code.\n*   **Debugging and Testing:** Identifying and rectifying subtle errors within code requires critical thinking and a deep understanding of the system's inner workings, qualities more readily found in experienced human developers.\n*   **Collaboration and Communication:** Software development is inherently a collaborative process. Human developers are better equipped to communicate effectively with stakeholders, explain code, and integrate seamlessly into development teams.\n*   **Ethical Considerations and Judgement:** Humans bring ethical judgement and are better placed to address bias and ensure their code aligns with broader social responsibility. LLMs may produce code with unforeseen or undesired consequences.\n\nIn conclusion, while LLMs are valuable tools for automating repetitive tasks, the article posits that human coders remain superior in critical areas like abstract reasoning, contextual understanding, debugging, collaboration, and ethical considerations, making them indispensable for complex software projects. This doesn't discount the potential of future LLM advancements but reflects the current state of the technology.\n",
    "chinese_title": "人类程序员仍然优于大型语言模型",
    "chinese_summary": "本文认为，目前在软件开发方面，人类程序员的表现优于大型语言模型 (LLM)。虽然 LLM 在生成代码片段和自动化某些任务方面取得了显著进展，但本文认为，LLM 在人类专业知识仍然至关重要的关键领域存在不足。\n\n人类程序员持续优越性的核心原因可能源于 LLM 在以下方面的局限性：\n\n*   **抽象推理和问题解决能力：** 人类程序员擅长理解复杂需求、架构解决方案以及适应突发挑战，这些能力通常超越了 LLM 目前的能力。 LLM 可能难以解决需要超出其训练数据的更深层次理解的新问题。\n*   **情境意识和理解能力：** LLM 可能难以充分理解项目目标、团队动态、遗留代码和业务逻辑的细微差别，从而阻碍了它们生成与情境相符且可维护的代码。\n*   **调试和测试能力：** 识别和纠正代码中的细微错误需要批判性思维和对系统内部运作的深刻理解，这些特质在经验丰富的人类开发人员身上更容易找到。\n*   **协作与沟通能力：** 软件开发本质上是一个协作过程。 人类开发人员能够更好地与利益相关者有效沟通、解释代码并无缝集成到开发团队中。\n*   **伦理考量和判断能力：** 人类具有伦理判断能力，并且能够更好地解决偏见，并确保他们的代码符合更广泛的社会责任。 LLM 可能会产生具有不可预见或不良后果的代码。\n\n总之，虽然 LLM 是用于自动化重复性任务的宝贵工具，但本文认为，人类程序员在抽象推理、情境理解、调试、协作和伦理考量等关键领域仍然更胜一筹，这使得他们在复杂的软件项目中不可或缺。 这并不否认未来 LLM 进步的潜力，但反映了该技术的当前状态。"
  },
  {
    "id": "44125966",
    "title": "Learning C3",
    "url": "https://alloc.dev/2025/05/29/learning_c3",
    "summary": "This article documents the author's journey learning the C3 programming language. Motivated by curiosity and experience with other low-level languages, the author explores C3's features and aims to understand its unique approach to problem-solving.\n\nThe article begins by outlining C3's purpose: building upon C with ergonomics, optimizations, and features difficult to implement in standard C, such as a module system, operator overloading, generics, compile-time execution, and error handling.\n\nThe author then walks through a \"Hello World\" example and analyzes several language features, including `foreach` loops, `while` loops with variable declaration, enums and `switch` statements with implicit/explicit breaks and `nextcase` for jump table functionality, and the `defer` keyword for resource cleanup. They also examine `struct` types with nested structures and unions, error handling using optional types and faults, contracts for pre- and post-conditions, struct methods using dot syntax, and briefly mentions macros.\n\nThe author provides opinions and comparisons to other languages (C, Zig, Rust), highlighting the pros and cons of C3's design choices, particularly in error handling and contract implementation. The article emphasizes C3's improvement over C in features like `defer` and struct methods, while acknowledging potential confusion with implicit/explicit break rules in switch statements. They plan to install C3 and create a calculator to further solidify their understanding.\n",
    "chinese_title": "学习C3",
    "chinese_summary": "本文记录了作者学习 C3 编程语言的旅程。出于好奇和拥有其他底层语言的经验，作者探索了 C3 的特性，并旨在理解其解决问题的独特方法。\n\n本文首先概述了 C3 的目的：在 C 的基础上构建，提供符合人体工程学、优化以及标准 C 中难以实现的功能，例如模块系统、运算符重载、泛型、编译时执行和错误处理。\n\n然后，作者通过一个“Hello World”示例，并分析了几个语言特性，包括 `foreach` 循环，带有变量声明的 `while` 循环，带有隐式/显式 breaks 和 `nextcase` 用于跳转表功能的 enums 和 `switch` 语句，以及用于资源清理的 `defer` 关键字。他们还研究了带有嵌套结构和联合的 `struct` 类型、使用可选类型和 faults 的错误处理、用于前置和后置条件的 contracts、使用点语法的 struct 方法，并简要提到了宏。\n\n作者提供了对其他语言（C、Zig、Rust）的观点和比较，突出了 C3 设计选择的优缺点，尤其是在错误处理和 contract 实现方面。本文强调了 C3 在 `defer` 和 struct 方法等功能上对 C 的改进，同时承认 switch 语句中隐式/显式 break 规则可能造成的混淆。他们计划安装 C3 并创建一个计算器，以进一步巩固他们的理解。"
  },
  {
    "id": "44131513",
    "title": "I'm starting a social club to solve the male loneliness epidemic",
    "url": "https://wave3.social",
    "summary": "Wave3 Social is a social club designed to combat male loneliness and foster deep, meaningful friendships in the work-from-home era. Currently operating in Boston, NYC, and SF, Wave3 offers a way for men to build consistent, in-person connections, reminiscent of college social life.\n\nThe process starts with attending open-to-all \"new member mixers,\" where potential members can meet existing members and gauge the community's vibe. If the fit is right, and existing members support the applicant, an invitation to join as a full member is extended.\n\nFull membership unlocks access to exclusive, curated events focused on shared interests, ranging from poker nights and whiskey roundtables to private chef dinners and game nights. These events are intentionally planned to facilitate genuine connection and camaraderie.\n\nWave3 emphasizes inclusivity, welcoming any man seeking solid friendships, regardless of his background or life stage. The club prioritizes a positive and respectful environment. While there isn't a strict dress code, members are encouraged to be themselves. Bringing friends to events is welcome, provided they align with the club's values of connection and mutual respect.\n\nMixers are typically free or low-cost, while some member events may have a small fee to cover expenses. The club's focus is on building a supportive community and combating the growing trend of male loneliness by actively cultivating lasting friendships.\n",
    "chinese_title": "我正在创建一个社交俱乐部来解决男性孤独症的蔓延。",
    "chinese_summary": "Wave3社交俱乐部旨在对抗男性孤独，并在居家办公时代培养深刻而有意义的友谊。目前在波士顿、纽约和旧金山运营，Wave3为男性提供了一种建立持续的、面对面联系的方式，让人想起大学的社交生活。\n\n加入流程从参加面向所有人的“新会员见面会”开始，潜在会员可以在这里与现有会员见面并评估社区的氛围。如果双方合适，并且现有会员支持申请人，则会发出正式会员的邀请。\n\n正式会员资格解锁专属的、精心策划的活动，这些活动侧重于共同的兴趣，范围从扑克之夜和威士忌圆桌会议到私人厨师晚餐和游戏之夜。这些活动的策划旨在促进真正的联系和友谊。\n\nWave3强调包容性，欢迎任何寻求真挚友谊的男性，无论其背景或人生阶段如何。俱乐部优先考虑积极和尊重的环境。虽然没有严格的着装要求，但鼓励会员们做自己。欢迎带朋友参加活动，前提是他们符合俱乐部建立联系和相互尊重的价值观。\n\n见面会通常是免费或低成本的，而一些会员活动可能会收取少量费用以支付费用。俱乐部的重点是通过积极培养持久的友谊，来建立一个支持性的社区，并对抗日益增长的男性孤独趋势。"
  },
  {
    "id": "44127109",
    "title": "WeatherStar 4000+: Weather Channel Simulator",
    "url": "https://weatherstar.netbymatt.com/",
    "summary": "WeatherStar 4000+ v5.21.8 is a Weather Channel simulator that allows users to view various weather information based on a specified location. The interface displays \"Current Conditions,\" \"Hourly Forecast,\" and \"Travel Forecast\" sections. The \"Current Conditions\" section shows wind, humidity, dewpoint, ceiling, visibility, and pressure. The \"Hourly Forecast\" includes a graph with temperature, cloud percentage, and precipitation percentage, as well as wind information. The \"Travel Forecast\" and \"Regional Observations\" are also present.\n\nAdditional features include an Almanac showing sunrise and sunset times, Moon data, and the Storm Prediction Center Outlook displaying risk levels like High, Moderate, Enhanced, Slight, and Marginal for thunderstorms. An Extended Forecast is also available.\n\nThe interface includes options for Local Radar (with precipitation levels), \"More Information,\" \"Selected Displays,\" \"Settings,\" and \"Sharing.\" The \"Sharing\" option allows users to copy a permalink to their clipboard for sharing the forecast information. The \"More Information\" section displays details like the location, Station Id, Radar Id, Zone Id, and WeatherStar 4000+ version (5.21.8). The system appears to be having some initial issues loading data.\n",
    "chinese_title": "WeatherStar 4000+: 天气频道模拟器",
    "chinese_summary": "WeatherStar 4000+ v5.21.8 是一款天气频道模拟器，允许用户查看基于指定位置的各种天气信息。界面显示“当前状况”、“每小时预报”和“出行预报”部分。“当前状况”部分显示风力、湿度、露点、云底高、能见度和气压。“每小时预报”包括温度、云量百分比和降水百分比的图表，以及风力信息。“出行预报”和“区域观测”也存在。\n\n其他功能包括显示日出日落时间的年历、月亮数据和风暴预测中心展望，显示雷暴的风险等级，如高、中、增强、轻微和边缘。还提供长期预报。\n\n界面包括本地雷达（含降水级别）、“更多信息”、“精选显示”、“设置”和“分享”选项。“分享”选项允许用户复制永久链接到剪贴板以分享预报信息。“更多信息”部分显示位置、站点ID、雷达ID、区域ID和WeatherStar 4000+ 版本 (5.21.8) 等详细信息。系统似乎在加载数据时遇到一些初始问题。"
  },
  {
    "id": "44137630",
    "title": "When will M&S take online orders again?",
    "url": "https://moneyweek.com/personal-finance/marks-and-spencer-online-order-problems",
    "summary": "Here's a concise summary of the MoneyWeek article about the M&S cyberattack:\n\nMarks & Spencer (M&S) online services have been disrupted since April 25, 2025, due to a cyberattack. The company expects the disruption to continue throughout June and into July 2025 as they gradually restart and ramp up operations.\n\nThe cyberattack, a ransomware incident, resulted in the theft of some customer data, including contact details, dates of birth, and online order history, but not usable payment information or passwords. M&S has informed affected customers and recommends resetting passwords as a precaution.\n\nThe attack is estimated to cost M&S £300 million in operating profit for the year and has already resulted in lost sales of approximately £40 million per week. M&S shares have fallen.\n\nWhile the attack is a significant setback, M&S leadership is focused on recovery and accelerating the company's transformation plans. Some customers affected by cancellations have received gift cards, and customers can contact customer service for queries or complaints. Despite the disruption, analysts suggest the underlying business remains strong, and the share price decline may represent an attractive entry point for investors willing to weather the near-term turbulence.\n",
    "chinese_title": "马莎百货何时恢复在线订购？",
    "chinese_summary": "以下是MoneyWeek关于马莎网络攻击事件的简要总结：\n\n自2025年4月25日起，由于遭受网络攻击，马莎百货(M&S)在线服务中断。该公司预计，由于逐步重启和扩大运营，中断将持续到2025年6月及7月。\n\n此次网络攻击是一起勒索软件事件，导致部分客户数据被盗，包括联系方式、出生日期和在线订单历史记录，但不包括可用的支付信息或密码。马莎已通知受影响的客户，并建议重置密码作为预防措施。\n\n据估计，此次攻击将使马莎本年度的运营利润损失3亿英镑，并已导致每周约4000万英镑的销售额损失。马莎股价已下跌。\n\n尽管这次攻击是一个重大挫折，但马莎领导层正专注于复苏并加速公司的转型计划。一些受取消订单影响的客户已收到礼品卡，客户可以联系客户服务部门进行咨询或投诉。尽管出现中断，分析师认为其潜在业务仍然强劲，股价下跌可能代表着愿意承受短期波动的投资者的一个有吸引力的入场点。"
  },
  {
    "id": "44120306",
    "title": "A visual exploration of vector embeddings",
    "url": "http://blog.pamelafox.org/2025/05/a-visual-exploration-of-vector.html",
    "summary": "This article provides a visual introduction to vector embeddings, explaining what they are, how they work, and how they are used. Vector embeddings map inputs (words, phrases, images) into lists of floating-point numbers, representing them in a multidimensional space. Different embedding models have varying dimensions, input types, and similarity spaces.\n\nThe article compares three models: word2vec, text-embedding-ada-002, and text-embedding-3-small, highlighting their unique characteristics and similarity spaces.  It examines how these models represent the word \"queen\" and compares their similarity rankings when finding words similar to \"dog.\"\n\nThe article then delves into vector similarity metrics, explaining cosine similarity, dot product, Euclidean distance, and Manhattan distance, explaining use cases of each. It emphasizes the importance of choosing the right metric for the application.\n\nThe primary use case for vector embeddings is vector search, finding semantically similar items in a database. The article touches on search methods: exhaustive search for small databases and Approximate Nearest Neighbors (ANN) algorithms (like HNSW, DiskANN, and IVFFlat) for larger databases.\n\nFinally, the article discusses vector compression techniques – scalar quantization and binary quantization – to reduce storage and computation costs, and dimension reduction for models that support it. It presents a compression strategy with rescoring to balance storage savings and search quality. The article concludes with resources for further exploration.\n",
    "chinese_title": "向量嵌入的可视化探索",
    "chinese_summary": "本文以可视化的方式介绍了向量嵌入，解释了它们是什么、如何工作以及如何使用。向量嵌入将输入（单词、短语、图像）映射到浮点数列表中，并在多维空间中表示它们。不同的嵌入模型具有不同的维度、输入类型和相似度空间。\n\n本文比较了三种模型：word2vec、text-embedding-ada-002和text-embedding-3-small，重点介绍了它们的独特特征和相似度空间。它考察了这些模型如何表示“queen”一词，并比较了它们在查找与“dog”相似的单词时的相似度排名。\n\n本文然后深入探讨了向量相似度度量，解释了余弦相似度、点积、欧几里得距离和曼哈顿距离，并解释了每种度量的用例。它强调了为应用程序选择正确的度量的重要性。\n\n向量嵌入的主要用例是向量搜索，即在数据库中查找语义上相似的项目。本文涉及搜索方法：用于小型数据库的穷举搜索和用于大型数据库的近似最近邻（ANN）算法（如HNSW、DiskANN和IVFFlat）。\n\n最后，本文讨论了向量压缩技术——标量量化和二元量化——以降低存储和计算成本，以及针对支持它的模型的降维。它提出了一种使用重评分的压缩策略，以平衡存储节省和搜索质量。本文最后提供了一些资源以供进一步探索。"
  },
  {
    "id": "44132756",
    "title": "Show HN: templUI – The UI Kit for templ (CLI-based, like shadcn/UI)",
    "url": "https://templui.io/",
    "summary": "templUI is presented as a UI kit specifically designed for use with the templ framework. It's likely CLI-based, meaning it can be installed and managed through the command line, similar to shadcn/UI. The announcement also mentions a \"templUI Pro\" version that is coming soon, suggesting a paid version with potentially more features and components. To encourage early adoption, a 50% discount is being offered to those who join the waitlist. In essence, templUI aims to provide a pre-built set of UI components and tools to streamline the process of building user interfaces with templ, and a professional, more feature-rich version is on the horizon.\n",
    "chinese_title": "Show HN: templUI – 用于 templ 的 UI 工具包（基于 CLI，类似于 shadcn/UI）",
    "chinese_summary": "templUI：专为templ框架设计的UI套件，类似于shadcn/UI，可能基于CLI，可通过命令行安装和管理。即将推出templUI Pro版本，预计是包含更多功能和组件的付费版本。加入等待列表可享五折优惠，鼓励早期采用。templUI旨在提供一套预构建的UI组件和工具，简化使用templ构建用户界面的流程，且专业增强版即将推出。"
  },
  {
    "id": "44128101",
    "title": "Open-sourcing circuit tracing tools",
    "url": "https://www.anthropic.com/research/open-source-circuit-tracing",
    "summary": "Anthropic is open-sourcing a new method and accompanying tools for tracing the \"thoughts\" of large language models (LLMs) through the generation of attribution graphs. These graphs partially reveal the steps an LLM takes to arrive at a specific output. The open-source library supports generating these graphs on popular open-weight models.\n\nThe release includes an interactive frontend hosted by Neuronpedia, allowing users to explore the graphs. The tools enable researchers to trace circuits, visualize and annotate graphs, and test hypotheses by modifying feature values and observing the effects on model outputs.\n\nAnthropic has already used these tools to study multi-step reasoning and multilingual representations in models like Gemma-2-2b and Llama-3.2-1b. They are inviting the community to use the tools to find additional interesting circuits, providing pre-generated, unanalyzed graphs as inspiration.\n\nThis open-sourcing effort, led by Anthropic Fellows and Decode Research, aims to advance interpretability research and bridge the gap between AI capabilities and our understanding of their inner workings. By making these tools accessible, Anthropic hopes to empower the broader community to study model behaviors and improve the tools themselves.\n",
    "chinese_title": "开源电路追踪工具",
    "chinese_summary": "Anthropic开源新方法和工具，通过生成归因图追踪大型语言模型（LLM）的“想法”。这些图部分揭示了LLM得出特定输出所采取的步骤。该开源库支持在流行的开放权重模型上生成这些图。\n\n此次发布包括由Neuronpedia托管的交互式前端，允许用户探索这些图。该工具使研究人员能够追踪电路、可视化和注释图，并通过修改特征值并观察对模型输出的影响来验证假设。\n\nAnthropic已经使用这些工具研究了Gemma-2-2b和Llama-3.2-1b等模型中的多步推理和多语言表示。他们邀请社区使用这些工具来发现更多有趣的电路，并提供预先生成但未经分析的图作为灵感。\n\n这项由Anthropic Fellows和Decode Research领导的开源工作，旨在推进可解释性研究，并弥合人工智能能力与我们对其内部运作理解之间的差距。通过使这些工具易于访问，Anthropic希望能够增强更广泛的社区研究模型行为和改进工具本身的能力。"
  },
  {
    "id": "44108590",
    "title": "Car Physics for Games (2003)",
    "url": "https://www.asawicki.info/Mirror/Car%20Physics%20for%20Games/Car%20Physics%20for%20Games.html",
    "summary": "This article provides a simplified approach to modeling car physics in games, focusing on separating longitudinal and lateral forces. Longitudinally, the car's motion is governed by a balance between traction force (engine), air resistance (drag), and rolling resistance. Drag is proportional to the square of velocity, becoming dominant at high speeds, while rolling resistance is linearly proportional to velocity. The net longitudinal force dictates acceleration, which, when integrated over time, determines velocity and position. Notably, top speed emerges naturally from these equations without needing a hard-coded limit.\n\nThe article then delves into calculating the drag and rolling resistance constants, emphasizing the importance of realistic values for accurate simulation. Braking is modeled by introducing a braking force opposite the direction of motion. Weight transfer during acceleration and braking is also discussed, affecting realism and maximum traction.\n\nEngine force is explained as torque converted via gears and differentials before reaching the wheels. The process involves losses, represented by transmission efficiency. The article details how to calculate drive force from engine torque, gear ratios, and wheel radius, demonstrating how engine torque interacts with tire friction limits to determine actual acceleration. Finally, the article provides example gear ratios for a Corvette C5.\n",
    "chinese_title": "游戏车辆物理(2003)",
    "chinese_summary": "游戏车辆物理建模的简化方法：纵向与横向力的分离。纵向运动由牵引力（引擎）、空气阻力（阻力）和滚动阻力之间的平衡决定。阻力与速度的平方成正比，高速时占主导地位，而滚动阻力与速度成线性比例关系。净纵向力决定加速度，积分后得到速度和位置。值得注意的是，最高速度可以从这些方程中自然得出，而无需硬编码限制。\n\n文章接着深入探讨了阻力和滚动阻力常数的计算，强调了真实数值对于精确模拟的重要性。制动通过引入与运动方向相反的制动力进行建模。文章还讨论了加速和制动期间的重量转移，这会影响真实感和最大牵引力。\n\n引擎力解释为扭矩通过齿轮和差速器转换后到达车轮。该过程涉及损耗，以传动效率表示。文章详细介绍了如何从引擎扭矩、齿轮比和车轮半径计算驱动力，展示了引擎扭矩如何与轮胎摩擦极限相互作用以确定实际加速度。最后，文章提供了克尔维特 C5 的示例齿轮比。"
  },
  {
    "id": "44130295",
    "title": "Notes on Tunisia",
    "url": "https://mattlakeman.org/2025/05/29/notes-on-tunisia/",
    "summary": "This article details the author's three-week trip to Tunisia, blending travel observations with historical and political context. Initially drawn by the Mediterranean climate, the author explores cities like Tunis, Bizerte, and Tozeur, but finds them generally unattractive, preferring the natural landscapes. Northern Tunisia resembles Italy, while the south offers desert scenery, oases, and unique geographical features like the dry Chott lakes and Arizona-like terrains with troglodyte villages.\n\nThe author notes Tunisians are generally friendly, but commercial interactions can be tricky with aggressive sales tactics. Culturally, Tunisia is relatively liberal for an Arab country. Practical travel aspects highlight the country's affordability, with cheap meals, accommodations, and transport. Shared vans (louages) are a common and inexpensive way to get around.\n\nThe author observes the lack of trust in society through chaotic train boarding practices and highlights the benefits of informality when they were able to leave their luggage with ticket vendors at tourist sites in El Jem. Politically, the author characterizes Tunisia's President Kais Saied as an accidental authoritarian figure and points out the apparent paradox between the country's climate, strategic location, and relatively low GDP.\n",
    "chinese_title": "突尼斯札记",
    "chinese_summary": "本文详细介绍了作者为期三周的突尼斯之旅，融合了旅行见闻与历史和政治背景。最初被地中海气候所吸引，作者探索了突尼斯、比塞大和杜兹等城市，但总体来说觉得这些城市缺乏吸引力，更喜欢自然景观。突尼斯北部类似于意大利，而南部则提供沙漠风光、绿洲以及独特的地理特征，如干燥的盐湖和亚利桑那州式的地形以及穴居村庄。\n\n作者注意到突尼斯人普遍友好，但商业互动可能会因激进的销售策略而变得棘手。在文化上，突尼斯对于一个阿拉伯国家来说相对自由。 实用旅行方面突出了该国的经济实惠，餐食、住宿和交通都很便宜。 合乘面包车（Louage）是一种常见的且廉价的出行方式。\n\n作者通过混乱的火车登车行为观察到社会缺乏信任，并强调了非正式的好处，例如他们在杰姆的旅游景点能够将行李寄存在售票员处。 在政治上，作者将突尼斯总统凯斯·赛义德描述为一个偶然的独裁人物，并指出了该国的气候、战略位置和相对较低的GDP之间的明显悖论。"
  },
  {
    "id": "44127027",
    "title": "The flip phone web: browsing with the original Opera Mini",
    "url": "https://www.spacebar.news/the-flip-phone-web-browsing-with-the-original-opera-mini/",
    "summary": "This article explores the history and functionality of the original Opera Mini web browser, initially released in 2005 for feature phones. It highlights how Opera Mini enabled web browsing on devices with limited processing power by rendering websites on Opera's servers and compressing the data sent to the phone. This approach allowed users to access full websites over slow 2G connections, unlike the limited WAP standard.\n\nThe article details how Opera Mini was widely adopted and even briefly available on early smartphones like the iPhone 3G. However, with the rise of more powerful smartphones capable of rendering web pages natively, Opera Mini's relevance diminished.\n\nDespite its age, the original Java ME version of Opera Mini still works today. The author describes the process of downloading and running Opera Mini on a modern computer using MicroEmulator and a Java runtime. They then detail the browsing experience, noting issues with modern website compatibility but also highlighting features like a built-in RSS feed reader.\n\nThe article also delves into the technical aspects, revealing that Opera Mini uses a modified Presto engine and reports itself as Opera 12.16 to websites. The author identifies the location of Opera Mini's servers in Amsterdam and discusses limitations like JavaScript execution. The article concludes by acknowledging Opera Mini's historical significance and its continued functionality on older phones, while also advising against using modern Opera browsers.\n",
    "chinese_title": "翻盖手机上网：使用最初的Opera Mini浏览器",
    "chinese_summary": "本文探讨了最初于2005年为功能手机发布的原始Opera Mini网页浏览器的历史和功能。它着重介绍了Opera Mini如何通过在Opera的服务器上渲染网站并压缩发送到手机的数据，从而在处理能力有限的设备上实现网页浏览。与有限的WAP标准不同，这种方法允许用户通过缓慢的2G连接访问完整的网站。\n\n文章详细介绍了Opera Mini的广泛应用，甚至短暂地出现在iPhone 3G等早期智能手机上。然而，随着能够原生渲染网页的更强大的智能手机的兴起，Opera Mini的相关性逐渐降低。\n\n尽管年代久远，原始的Java ME版本的Opera Mini如今仍然可以工作。作者描述了使用MicroEmulator和Java运行时在现代计算机上下载并运行Opera Mini的过程。然后，他们详细介绍了浏览体验，指出了与现代网站兼容性的问题，同时也突出了诸如内置RSS订阅阅读器之类的功能。\n\n文章还深入探讨了技术方面，揭示了Opera Mini使用修改后的Presto引擎，并向网站报告自身为Opera 12.16。作者确定了Opera Mini服务器在阿姆斯特丹的位置，并讨论了诸如JavaScript执行之类的限制。文章最后承认了Opera Mini的历史意义及其在旧手机上的持续功能，同时也建议不要使用现代Opera浏览器。"
  },
  {
    "id": "44106007",
    "title": "Dr John C. Clark, a scientist who disarmed atomic bombs twice",
    "url": "https://daxe.substack.com/p/disarming-an-atomic-bomb-is-the-worst",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "约翰·C·克拉克博士，一位两次拆除原子弹的科学家",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "44127173",
    "title": "Putting Rigid Bodies to Rest",
    "url": "https://twitter.com/keenanisalive/status/1925225500659658999",
    "summary": "The provided content snippet isn't an article, but a message from X (formerly Twitter) indicating that JavaScript is disabled in the user's browser. Because JavaScript is disabled, the user is unable to access or properly interact with the website.\n\nThe core message is that **JavaScript is required for the website to function correctly**. The message instructs the user to enable JavaScript or switch to a supported browser to continue using X.com. It also provides links to the Help Center for a list of supported browsers, as well as links to the Terms of Service, Privacy Policy, Cookie Policy, Imprint, and Ad Information. Finally, it includes the copyright information.\n\nEssentially, the content highlights a technical issue preventing the user from accessing the intended content on X.com. The title, \"Putting Rigid Bodies to Rest,\" is irrelevant to the actual content displayed.\n",
    "chinese_title": "使刚体静止",
    "chinese_summary": "您浏览器的 JavaScript 已禁用。 由于 JavaScript 已禁用，您无法访问或正常使用该网站。网站正常运行需要 JavaScript。请启用 JavaScript 或切换到支持的浏览器以继续使用 X.com。帮助中心提供了支持浏览器的列表，以及服务条款、隐私政策、Cookie 政策、版本说明和广告信息的链接。最后，其中包含版权信息。 本质上，该内容突出显示了一个技术问题，阻止用户访问 X.com 上的预期内容。“使刚体静止”的标题与显示的实际内容无关。"
  },
  {
    "id": "44133091",
    "title": "How to Do Ambitious Research in the Modern Era [video]",
    "url": "https://www.youtube.com/watch?v=w7DVlI_Ztq8",
    "summary": "This \"article\" is not an article at all, but rather a collection of footer links and disclaimers usually found at the bottom of a YouTube page. It lists items such as:\n\n*   **Legal and Copyright:** Links relating to YouTube's copyright policy and how to contact them regarding copyright issues.\n*   **Creator Resources:** Resources for content creators, including information on advertising and developer tools.\n*   **Legal & Policy:** YouTube's terms of service, privacy policy, and security measures.\n*   **About YouTube:** Information about how YouTube operates and new feature testing.\n*   **NFL Sunday Ticket:** A copyright notice specifically for NFL Sunday Ticket owned by Google LLC.\n\nEssentially, this isn't usable for generating a summary about how to do ambitious research. It provides basic legal, operational, and copyright information pertaining to the YouTube platform itself.\n",
    "chinese_title": "如何在现代进行雄心勃勃的研究[视频]",
    "chinese_summary": "此“文章”并非文章，而是通常位于YouTube页面底部的页脚链接和免责声明的集合。它列出了如下项目：\n\n*   **法律和版权：** 关于YouTube版权政策以及如何就版权问题联系他们的链接。\n*   **创作者资源：** 面向内容创作者的资源，包括关于广告和开发者工具的信息。\n*   **法律与政策：** YouTube的服务条款、隐私政策和安全措施。\n*   **关于YouTube：** 关于YouTube如何运作和新功能测试的信息。\n*   **NFL Sunday Ticket：** 专门针对Google LLC拥有的NFL Sunday Ticket的版权声明。\n\n本质上，这不适用于生成关于如何进行雄心勃勃的研究的总结。它提供了关于YouTube平台本身的基本法律、运营和版权信息。"
  },
  {
    "id": "44125489",
    "title": "I started a little math club in Bangalore",
    "url": "https://teachyourselfmath.app/club",
    "summary": "Vivek Nathani started a math club in Bangalore to recapture the collaborative learning environment he missed after graduating from college. He found studying math in isolation less fulfilling than the shared experience of discussing problems and learning together with peers.\n\nThe club has held two successful meetups at Dialogues Cafe in Kormangala. The first meetup on March 15, 2025, had 7 participants, and the second on May 4, 2025, drew 8 attendees. Participants work together on problem sets.\n\nVivek credits @clearlysid and @lifeofadvait for encouraging and assisting him in launching the club, and @Sarve___tanvesh for helping with the second meetup. He encourages anyone interested in joining the math club to reach out to him via email at viveknathani2402 at gmail[dot]com or on Twitter at @viveknathani_.\n",
    "chinese_title": "我在班加罗尔创办了一个小型数学俱乐部。",
    "chinese_summary": "Vivek Nathani 在班加罗尔创办了一个数学俱乐部，以重拾他大学毕业后失去的协作学习环境。他发现孤立地学习数学不如与同伴一起讨论问题和学习的共享体验那样令人满足。\n\n该俱乐部已经在科尔曼加拉的 Dialogues Cafe 成功举办了两次聚会。第一次聚会于 2025 年 3 月 15 日举行，有 7 名参与者，第二次聚会于 2025 年 5 月 4 日举行，吸引了 8 名参与者。参与者们一起解决问题集。\n\nVivek 感谢 @clearlysid 和 @lifeofadvait 鼓励和帮助他创办俱乐部，以及 @Sarve___tanvesh 帮助举办第二次聚会。他鼓励任何有兴趣加入数学俱乐部的人通过电子邮件 viveknathani2402 at gmail[dot]com 或在 Twitter 上 @viveknathani_ 与他联系。"
  },
  {
    "id": "44137241",
    "title": "'He spent thousands': how a bank team tries to rescue scam victims",
    "url": "https://www.theguardian.com/money/2025/feb/01/bank-team-scam-victims-fraud",
    "summary": "This article details how Santander's \"Break the Spell\" team works to rescue customers from sophisticated scams, particularly romance and investment fraud, which have surged since the pandemic. The team of 23 specialists deals with customers who are deeply convinced by scammers and refuse to believe they are being defrauded. They investigate suspect transactions, contact victims, and build trust over weeks or months to break the \"spell.\"\n\nThe article highlights the complexity and emotional manipulation involved in these scams, often targeting vulnerable individuals who are lonely, depressed, or bereaved. Scammers operate from sophisticated call centers, using personal data from social media to create fake connections and extract money, starting with small requests before escalating to significant sums, sometimes leading to victims remortgaging their homes.\n\nThe Break the Spell team not only prevents further financial loss, having stopped £17.6 million from reaching fraudsters, but also provides ongoing support to victims after they realize they've been conned, recognizing the significant psychological impact. The Banking Protocol scheme encourages police involvement when necessary. With recent rule changes mandating banks to reimburse scam victims who aren't unduly negligent, there's increased urgency for prevention and intervention. The article underscores the importance of empathy and understanding in combating these scams, emphasizing that anyone can fall victim.\n",
    "chinese_title": "他花费数千：银行团队如何尝试拯救诈骗受害者",
    "chinese_summary": "桑坦德银行“破咒”团队如何解救受复杂诈骗侵害的客户——尤其是在疫情期间激增的爱情和投资诈骗——本文对此进行了详细阐述。这个由23名专家组成的团队处理那些深受诈骗分子蛊惑、不愿相信自己被骗的客户。他们调查可疑交易，联系受害者，并在数周或数月内建立信任，以打破这种“魔咒”。\n\n文章强调了这些诈骗的复杂性和情感操控，这些诈骗通常针对孤独、沮丧或丧亲等脆弱人群。诈骗分子在复杂的呼叫中心运作，利用社交媒体上的个人数据建立虚假连接并榨取金钱，先从小额请求开始，然后升级到大额款项，有时甚至导致受害者重新抵押房屋。\n\n“破咒”团队不仅阻止了进一步的财务损失，已经阻止了1760万英镑落入诈骗者手中，而且在受害者意识到自己被骗后，还会为他们提供持续的支持，认识到由此产生的重大心理影响。“银行协议”计划鼓励在必要时警方介入。由于最近的规则变更要求银行赔偿非因重大过失的诈骗受害者，预防和干预变得更加紧迫。文章强调了同理心和理解在打击这些诈骗中的重要性，并强调任何人都有可能成为受害者。"
  },
  {
    "id": "44115244",
    "title": "Flash Back: An “oral” history of Flash",
    "url": "https://goodinternetmagazine.com/oral-history-of-flash/",
    "summary": "This article provides an \"oral\" history of Flash, exploring its rise and fall on the internet. Born from the desire for richer multimedia and interactivity than early HTML offered, Flash quickly became ubiquitous due to its small file size, cross-platform compatibility, and the ability to deliver animations, games, and even full-fledged applications. It allowed for creative expression, especially in animation and indie game development, providing a launchpad for many creators and popular titles. The author highlights the positive impact of Flash, particularly on personal creative endeavors and indie gaming before the dominance of platforms like Steam.\n\nHowever, the article also emphasizes Flash's significant drawbacks. Its proprietary nature placed control in the hands of a single corporation (Macromedia/Adobe), hindering open standards. Security vulnerabilities plagued the plugin, and it was notorious for performance issues, consuming CPU power even when idle. Flash also created accessibility barriers, hindering screen readers and making Flash-heavy sites difficult to index and archive.\n\nUltimately, the rise of mobile devices like the iPhone, which famously rejected Flash, and advancements in HTML, CSS, and JavaScript contributed to Flash's decline. The article concludes that while Flash offered significant advancements, its inherent flaws and the evolution of web technologies made its eventual replacement inevitable. It acknowledges Flash's important role in shaping the internet's early multimedia landscape while recognizing the relief brought about by its demise.\n",
    "chinese_title": "闪回：Flash的“口述”历史",
    "chinese_summary": "本文以“口述”历史的方式探讨了Flash在互联网上的兴衰。 Flash诞生于人们对早期HTML所能提供的更丰富的多媒体和交互性的渴望，由于其文件体积小、跨平台兼容性以及能够交付动画、游戏甚至成熟的应用程序的能力，Flash迅速普及。它为创意表达提供了可能，尤其是在动画和独立游戏开发领域，为许多创作者和热门作品提供了跳板。作者强调了Flash的积极影响，尤其是在个人创意活动和Steam等平台占据主导地位之前的独立游戏领域。\n\n然而，本文也强调了Flash的重大缺陷。 其专有性质将控制权置于单一公司（Macromedia/Adobe）手中，阻碍了开放标准。 安全漏洞困扰着该插件，并且以性能问题而臭名昭著，即使在空闲时也会消耗CPU功率。 Flash还造成了无障碍访问障碍，阻碍了屏幕阅读器，并使得包含大量Flash的网站难以索引和存档。\n\n最终，iPhone等移动设备的兴起（iPhone因拒绝Flash而闻名）以及HTML、CSS和JavaScript的进步促成了Flash的衰落。 本文的结论是，尽管Flash提供了显著的进步，但其固有的缺陷以及Web技术的演进使得它的最终替代成为必然。 它承认Flash在塑造互联网早期多媒体格局方面的重要作用，同时也承认了其消亡所带来的解脱。"
  },
  {
    "id": "44126264",
    "title": "Nova: A JavaScript and WebAssembly engine written in Rust",
    "url": "https://trynova.dev/",
    "summary": "Nova is a JavaScript and WebAssembly engine being developed in Rust, emphasizing data-oriented design. The project is currently experimental, aiming to explore and validate the feasibility of such an engine architecture. While still under development and only passing about 70% of the test262 test suite, progress is actively being made. The development team encourages participation and discussion via their GitHub repository and Discord server. The project showcases progress and insights through blog posts, with recent entries covering topics such as working for the Internet, Nova's garbage collector, memory management, and reflections on past and future goals.\n",
    "chinese_title": "Nova：用 Rust 编写的 JavaScript 和 WebAssembly 引擎",
    "chinese_summary": "Nova：一个用 Rust 开发的、强调数据导向设计的 JavaScript 和 WebAssembly 引擎。该项目目前处于实验阶段，旨在探索并验证这种引擎架构的可行性。虽然仍在开发中，且仅通过了约 70% 的 test262 测试套件，但进展正在积极进行。开发团队鼓励通过他们的 GitHub 仓库和 Discord 服务器参与和讨论。该项目通过博客文章展示进展和见解，最近的文章涵盖了诸如为互联网工作、Nova 的垃圾回收器、内存管理以及对过去和未来目标的反思等主题。"
  },
  {
    "id": "44114982",
    "title": "My website is ugly because I made it",
    "url": "https://goodinternetmagazine.com/my-website-is-ugly-because-i-made-it/",
    "summary": "Taylor Troesh's article \"My website is ugly because I made it\" explores the personal and expressive nature of creating a website, prioritizing individual expression over conventional good design. He argues that while polished, professionally designed websites exist, the value of his own site lies in its reflection of his unique personality and creative impulses.\n\nTroesh highlights his desire to build something that aligns with his specific interests, including humor, systems, life, and software, using HTML/CSS, and other mediums to express his emotions. He emphasizes that his website is a direct output of his internal feelings and creative drive.\n\nThe article details the evolution of his website's design, explaining his initial pursuit of simplicity and its eventual descent into controlled chaos. He provides specific CSS code snippets to illustrate how he intentionally incorporated seemingly random elements like rotations, varying fonts, letter spacing, and even a \"dusty paper\" texture created with CSS-doodle. These elements were chosen not for their aesthetic appeal, but for their personal significance and the feeling they evoke.\n\nUltimately, Troesh celebrates the iterative and evolving nature of his website, recognizing that it will continue to change as he himself changes. He encourages others to embrace their own \"ugly thing,\" suggesting that personal expression and continuous growth are more valuable than adhering to conventional design standards. He also describes himself as someone who embraces imperfection and celebrates creativity in its rawest form.\n",
    "chinese_title": "我的网站很丑，因为是我做的。",
    "chinese_summary": "泰勒·特罗什的文章《我的网站很丑，因为是我做的》探讨了创建网站的个人表达性，优先考虑个人表达而非传统的优秀设计。他认为，虽然存在精致、专业设计的网站，但他自己网站的价值在于它反映了他独特的个性和创造性冲动。\n\n特罗什强调了他渴望构建与他的特定兴趣相符的东西，包括幽默、系统、生活和软件，并使用 HTML/CSS 和其他媒介来表达他的情感。他强调他的网站是他内心感受和创造性驱动力的直接产出。\n\n文章详细描述了他网站设计的演变，解释了他最初对简洁的追求以及最终演变成可控混乱的过程。他提供了具体的 CSS 代码片段，以说明他如何有意识地融入看似随机的元素，如旋转、不同的字体、字母间距，甚至是用 CSS-doodle 创建的“布满灰尘的纸张”纹理。选择这些元素不是因为它们的美学吸引力，而是因为它们的个人意义以及它们唤起的感觉。\n\n最终，特罗什赞扬了他的网站的迭代和发展特性，认识到它将随着他自己的变化而不断变化。他鼓励其他人拥抱他们自己的“丑陋之物”，认为个人表达和持续成长比遵守传统设计标准更有价值。他还将自己描述为拥抱不完美并在其最原始的形式中庆祝创造力的人。"
  },
  {
    "id": "44127653",
    "title": "Show HN: Onlook – Open-source, visual-first Cursor for designers",
    "url": "https://github.com/onlook-dev/onlook",
    "summary": "Onlook is an open-source, visual-first code editor designed for designers, aiming to be an alternative to tools like Bolt.new and Webflow. It allows users to craft websites, prototypes, and designs using AI within a Next.js + TailwindCSS environment, offering a visual editor for direct DOM manipulation and real-time code integration. Currently under development for web, Onlook empowers users to create Next.js apps quickly, starting from text, images, templates, Figma imports, or GitHub repositories.\n\nKey features include visual editing with a Figma-like UI, real-time previews, brand asset management, layer browsing, component detection, page creation, and image management. The tool also provides real-time code editing, save/restore checkpoints, CLI commands, and app marketplace integration. Deployment is simplified with shareable links and custom domain linking, facilitating team collaboration through real-time editing and commenting.\n\nOnlook's architecture involves loading code into a web container, serving it through an iframe, and instrumenting the code to map elements to their corresponding code locations. Edits are reflected in both the iframe and the code. The AI chat also has code access for understanding and editing. The project is built with Next.js, Supabase, Drizzle, TailwindCSS, Bun, and tRPC and welcomes contributions via pull requests and issue submissions.\n",
    "chinese_title": "Show HN: Onlook – 面向设计师的开源、可视化优先光标",
    "chinese_summary": "Onlook：面向设计师的开源可视化优先代码编辑器，旨在成为 Bolt.new 和 Webflow 等工具的替代方案。它允许用户在 Next.js + TailwindCSS 环境中使用 AI 制作网站、原型和设计，提供可视化编辑器以进行直接 DOM 操作和实时代码集成。Onlook 目前正在进行 Web 开发，使用户能够从文本、图像、模板、Figma 导入或 GitHub 存储库快速创建 Next.js 应用程序。\n\n主要功能包括具有类似 Figma UI 的可视化编辑、实时预览、品牌资产管理、图层浏览、组件检测、页面创建和图像管理。该工具还提供实时代码编辑、保存/恢复检查点、CLI 命令和应用市场集成。通过可共享的链接和自定义域名链接简化了部署，并通过实时编辑和评论促进团队协作。\n\nOnlook 的架构涉及将代码加载到 Web 容器中，通过 iframe 提供服务，并检测代码以将元素映射到其相应的代码位置。编辑会反映在 iframe 和代码中。AI 聊天也具有代码访问权限，以便进行理解和编辑。该项目采用 Next.js、Supabase、Drizzle、TailwindCSS、Bun 和 tRPC 构建，并欢迎通过拉取请求和提交问题进行贡献。"
  },
  {
    "id": "44123486",
    "title": "The Maid Who Restored Charles II",
    "url": "https://www.historytoday.com/archive/feature/maid-who-restored-charles-ii",
    "summary": "This article argues that Anne Monck, the wife of General George Monck, played a crucial and often overlooked role in the restoration of Charles II to the British throne in 1660. While General Monck held significant power after Oliver Cromwell's death and the subsequent chaos, his initial intentions were not to restore the monarchy.\n\nThe article highlights Anne's humble origins as a laundry maid who met George while he was imprisoned in the Tower of London. Their relationship blossomed, and Anne's strong personality and political insights gradually influenced her husband. While Monck was initially hesitant, Anne, spurred by a prophetic dream, began advocating for a Stuart restoration, challenging his views during evening conversations in her \"treason gown.\"\n\nAnne's influence proved pivotal when Monck was ordered to suppress London, a decision he initially considered following. Anne, along with confidants, persuaded him that this action would ruin him. Monck then issued an ultimatum to Parliament, leading to new elections and eventually opening the door for Charles II's return.\n\nThe article emphasizes Anne's role as a go-between and advisor, even suggesting she rejected proposals for Monck to become Lord Protector in favor of the benefits the king could bestow upon their family. Charles II himself acknowledged Anne's contribution. After the restoration, the Moncks were elevated to Duke and Duchess of Albemarle, though Anne faced resentment due to her lower social standing. Despite historical eulogies, Anne's pivotal role in the restoration has largely been forgotten.\n",
    "chinese_title": "修复查理二世的女仆",
    "chinese_summary": "安妮·蒙克：被忽视的查理二世复辟关键人物"
  },
  {
    "id": "44119502",
    "title": "Unhappy Meals (2007)",
    "url": "https://michaelpollan.com/articles-archive/unhappy-meals/",
    "summary": "In \"Unhappy Meals,\" Michael Pollan argues that the focus on nutrients over whole foods has created confusion and anxiety about eating. He critiques the rise of \"nutritionism,\" an ideology that views food primarily as a source of nutrients, leading to the neglect of qualitative differences between foods and the overemphasis on expert advice.\n\nPollan traces the shift from eating \"food\" to consuming \"nutrients\" to a political controversy in the 1970s, when dietary guidelines suggesting a reduction in red meat consumption were revised due to industry pressure. This led to a focus on individual nutrients like saturated fat, avoiding direct recommendations about whole foods.\n\nPollan argues that nutritionism benefits the food industry, allowing them to reformulate processed foods with specific nutrients to capitalize on health trends, while whole foods struggle to compete. This focus on nutrients also empowers scientists and journalists who interpret the \"hidden reality of foods\" for the public, further complicating our understanding of diet. He suggests that this obsession with health through nutrients can ironically undermine our well-being by neglecting the social and pleasurable aspects of eating. Ultimately, Pollan advocates for a simpler approach: \"Eat food. Not too much. Mostly plants.\"\n",
    "chinese_title": "不快乐的餐点 (2007)",
    "chinese_summary": "在《不快乐的食物》中，迈克尔·波伦认为，对营养成分的关注胜过对完整食物的关注，导致了人们对饮食的困惑和焦虑。他批判了“营养主义”的兴起，这是一种将食物主要视为营养来源的意识形态，导致人们忽视食物之间的质量差异，并过度强调专家建议。\n\n波伦追溯了从食用“食物”到摄取“营养成分”的转变，认为这源于 20 世纪 70 年代的一场政治争议，当时由于行业压力，关于减少红肉消费的膳食指南被修改。这导致人们关注饱和脂肪等个别营养成分，从而避免了关于完整食物的直接建议。\n\n波伦认为，营养主义有利于食品工业，使他们能够用特定的营养成分重新配制加工食品，以利用健康趋势，而完整食物难以与之竞争。这种对营养成分的关注也赋予了科学家和记者权力，他们为公众解读“食物的隐藏现实”，进一步复杂化了我们对饮食的理解。他认为，这种通过营养成分关注健康的痴迷，反而会通过忽视饮食的社会性和愉悦性来破坏我们的福祉。最终，波伦提倡一种更简单的方法：“吃食物。不要太多。主要吃植物。”"
  },
  {
    "id": "44124808",
    "title": "Simple programming language with offline usable browser IDE",
    "url": "https://tiki.li/apps/tut_learn.html?v=2505e",
    "summary": "This article discusses the concept of a simple programming language that can be used within an offline-usable browser-based Integrated Development Environment (IDE). The article aims to introduce programming basics, likely through this new language. The title suggests the language is designed for ease of use, and the IDE's offline capability allows for development even without an internet connection.\n\nThe presence of \"Tiki\" and the loading message \"Loading...\" implies that the article is likely part of a larger system or platform called \"Tiki,\" and the reader is currently waiting for more content to load within this platform. The core idea is to provide an accessible programming learning experience with a tool readily available and usable regardless of internet connectivity.\n",
    "chinese_title": "带有离线可用浏览器IDE的简易编程语言",
    "chinese_summary": "本文探讨了一种可在离线浏览器集成开发环境（IDE）中使用的简单编程语言的概念。文章旨在介绍编程基础知识，可能通过这种新语言。标题表明该语言的设计注重易用性，而IDE的离线功能允许在没有互联网连接的情况下进行开发。“Tiki”的存在和“Loading...”加载消息暗示该文章可能是一个名为“Tiki”的更大系统或平台的一部分，并且读者目前正在等待此平台中加载更多内容。核心思想是提供一种易于访问的编程学习体验，使用户能够使用一种随时可用且不受互联网连接限制的工具。"
  },
  {
    "id": "44103923",
    "title": "Invading the Huum Uku WiFi Controller",
    "url": "https://kaurpalang.com/posts/invading-the-sauna/",
    "summary": "This article details a reverse engineering effort to control a Huum Uku WiFi sauna controller locally, bypassing its reliance on Huum's cloud service. The author, dissatisfied with cloud-dependent \"smart\" devices, aims to control the sauna remotely without using the official Huum app.\n\nThe author starts by analyzing network traffic between the controller and Huum's servers, initially using Wireshark on a laptop acting as a hotspot for the controller. They discover the communication is not TLS-encrypted, revealing plaintext messages. The author identifies several key message types, including those for setting temperature, controlling the heater, and reporting the sauna's status. The author posits that the communication might be over MQTT.\n\nThey then redirect the controller's traffic to a local server by rewriting the DNS record for api.huum.eu using AdGuard Home. The author discovers that the communication isn't WebSocket but raw TCP. The author then crafts a Bun server to emulate Huum's cloud, successfully sending commands to the controller and receiving status updates. They create a REST API to control the heater. The project successfully avoids the cloud and enables local control, identifying five communication protocols to do so.\n\nThe author expresses mixed feelings about the lack of TLS encryption, acknowledging both its convenience for reverse engineering and the potential security risk it poses. Finally, the author outlines next steps including a GitHub release and possibly trying to control other heaters in the area.\n",
    "chinese_title": "入侵 Huum Uku WiFi 控制器",
    "chinese_summary": "本文详细介绍了通过逆向工程，实现在本地控制Huum Uku WiFi桑拿控制器的过程，从而摆脱对Huum云服务的依赖。作者对依赖云的“智能”设备感到不满，旨在不使用官方Huum应用程序远程控制桑拿。\n\n作者首先分析了控制器与Huum服务器之间的网络流量，最初使用Wireshark在一台充当控制器热点的笔记本电脑上进行。他们发现通信没有使用TLS加密，从而暴露了明文消息。作者识别了几种关键消息类型，包括用于设置温度、控制加热器和报告桑拿状态的消息。作者推测通信可能通过MQTT进行。\n\n然后，他们使用AdGuard Home重写api.huum.eu的DNS记录，将控制器的流量重定向到本地服务器。作者发现通信不是WebSocket而是原始TCP。作者随后编写了一个Bun服务器来模拟Huum的云，成功地向控制器发送命令并接收状态更新。他们创建了一个REST API来控制加热器。该项目成功避免了云端并实现了本地控制，并确定了五种用于此目的的通信协议。\n\n作者对缺乏TLS加密表达了复杂的情感，既承认了它对逆向工程的便利性，也承认了它构成的潜在安全风险。最后，作者概述了后续步骤，包括发布GitHub版本，并可能尝试控制该区域的其他加热器。"
  },
  {
    "id": "44112149",
    "title": "High-quality OLED displays now enabling integrated thin and multichannel audio",
    "url": "https://www.sciencedaily.com/releases/2025/05/250521125055.htm",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "高质量OLED显示屏现已实现集成超薄多声道音频",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "44135509",
    "title": "Chaos on German autobahns as Google Maps wrongly says they are closed",
    "url": "https://www.theguardian.com/world/2025/may/30/chaos-on-german-autobahns-as-google-maps-wrongly-says-they-are-closed",
    "summary": "Google Maps erroneously indicated widespread autobahn closures in Germany at the start of a busy holiday weekend, causing chaos and confusion. Drivers were confronted with a map filled with stop signs suggesting major highways were closed around Frankfurt, Hamburg, Berlin, and other areas, extending into Belgium and the Netherlands.\n\nThis incorrect information led to severe congestion on alternative routes as drivers scrambled for detours. Police and traffic authorities were inundated with inquiries. Other navigation apps like Apple Maps and Waze, as well as traffic radio, showed normal traffic flow, highlighting the Google Maps error.\n\nSocial media users expressed frustration and speculated about the cause, ranging from terror incidents to hacking. Google is investigating the issue, stating that it relies on a mix of third-party providers, public sources, and user input for its map data. The company acknowledged the problem and is working to remove the incorrect closure signs. Google advised road users to consult multiple information sources when planning future trips.\n",
    "chinese_title": "谷歌地图错误显示德国高速公路关闭，引发混乱",
    "chinese_summary": "谷歌地图错误地显示德国高速公路在大假日前夕大范围关闭，造成混乱。司机们看到地图上布满了停车标志，显示法兰克福、汉堡、柏林和其他地区的主要高速公路关闭，并延伸到比利时和荷兰。\n\n这一错误信息导致替代路线严重拥堵，因为司机们争相寻找绕行路线。警察和交通部门接到了大量询问。其他导航应用程序，如苹果地图和Waze，以及交通广播，都显示正常的交通流量，突显了谷歌地图的错误。\n\n社交媒体用户表达了不满，并猜测原因，从恐怖事件到黑客攻击。谷歌正在调查此事，声明其地图数据依赖于第三方供应商、公共来源和用户输入。该公司承认了该问题，并正在努力删除不正确的关闭标志。谷歌建议道路使用者在计划未来的旅行时查阅多个信息来源。"
  },
  {
    "id": "44104653",
    "title": "Grid-Free Approach to Partial Differential Equations on Volumetric Domains [pdf]",
    "url": "http://rohansawhney.io/RohanSawhneyPhDThesis.pdf",
    "summary": "This document appears to be a PDF file containing the content of a research article titled \"Grid-Free Approach to Partial Differential Equations on Volumetric Domains.\" However, the provided text is the raw, compressed content of the PDF, making it unreadable directly.\n\nBased on the title, we can infer the general topic:\n\n*   **Partial Differential Equations (PDEs):** The article likely discusses methods for solving these equations, which are fundamental in modeling various physical phenomena.\n*   **Volumetric Domains:** The focus is on solving PDEs within three-dimensional spaces.\n*   **Grid-Free Approach:** This suggests that the method proposed does *not* rely on traditional grid-based discretization techniques (like finite difference or finite element methods). Grid-free methods can offer advantages in handling complex geometries, adaptivity, and potentially higher-order accuracy.\n\nWithout the actual content, it's impossible to provide further details. The article likely delves into the specifics of the proposed grid-free method, including:\n\n*   Its mathematical formulation.\n*   Implementation details.\n*   Performance comparisons with existing methods.\n*   Applications to specific problems (e.g., heat transfer, fluid dynamics, electromagnetics).\n*   Discussions of accuracy, stability, and computational cost.\n",
    "chinese_title": "基于体域偏微分方程的无网格方法 [pdf]",
    "chinese_summary": "该文档似乎是一个PDF文件，包含一篇题为“体积域上偏微分方程的无网格方法”的研究文章的内容。然而，提供的文本是PDF的原始压缩内容，无法直接阅读。\n\n根据标题，我们可以推断出大致主题：\n\n*   **偏微分方程 (PDEs):** 该文章可能讨论求解这些方程的方法，这些方程是各种物理现象建模的基础。\n*   **体积域:** 重点是在三维空间内求解偏微分方程。\n*   **无网格方法:** 这表明该方法*不*依赖于传统的基于网格的离散化技术（如有限差分或有限元方法）。无网格方法可以在处理复杂几何形状、自适应性以及潜在的更高阶精度方面提供优势。\n\n没有实际内容，无法提供更多细节。该文章可能深入探讨所提出的无网格方法的具体细节，包括：\n\n*   其数学公式。\n*   实施细节。\n*   与现有方法的性能比较。\n*   应用于特定问题（例如，热传递、流体动力学、电磁学）。\n*   关于准确性、稳定性和计算成本的讨论。"
  },
  {
    "id": "44123852",
    "title": "Gurus of 90s Web Design: Zeldman, Siegel, Nielsen",
    "url": "https://cybercultural.com/p/web-design-1997/",
    "summary": "Richard MacManus's article examines the divergent web design philosophies of the late 90s through the lens of three influential figures: Jeffrey Zeldman, David Siegel, and Jakob Nielsen. As CSS and Flash emerged, these \"gurus\" offered contrasting approaches.\n\nSiegel, a digital typography expert, advocated for \"hacks\" like invisible tables and single-pixel GIFs to achieve aesthetic goals, even prioritizing specific browsers (Netscape). He embraced Flash for its visual capabilities, despite its proprietary nature. Nielsen, a \"usability guru,\" championed semantic coding and accessibility across browsers, advocating for separating content from presentation and eventually supporting CSS. He vehemently opposed Flash. Zeldman, straddling the line, initially embraced both CSS and Flash, believing design could be both aesthetically pleasing and standards-compliant.\n\nThe article highlights the tensions between prioritizing visual flair (Siegel, initially Zeldman) versus usability and accessibility (Nielsen, Zeldman later). Flash offered immediate visual impact but sacrificed semantic code and standards. CSS, while promising, faced inconsistent browser support.\n\nThe article then tracks the gurus' subsequent careers. Nielsen's minimalist Useit website became a symbol of outdated design, eventually merging into his NNGroup. Siegel explored business, blockchain, and other interests. Zeldman remains a web designer, currently working at Automattic, indicating that his balanced approach of combining standards and design sensibilities arguably \"won out.\" The article concludes with the exciting news of Zeldman redesigning his website, suggesting a renewed focus on his original design philosophy and a hope for its wider adoption.\n",
    "chinese_title": "90年代网页设计大师：泽尔德曼、西格尔、尼尔森",
    "chinese_summary": "理查德·麦克马纳斯的文章通过杰弗里·泽尔德曼、大卫·西格尔和雅各布·尼尔森这三位有影响力的人物，考察了90年代末期网络设计理念的分歧。随着CSS和Flash的出现，这些“大师”提供了截然不同的方法。\n\n西格尔是一位数字排版专家，他提倡使用诸如隐形表格和单像素GIF之类的“技巧”来实现审美目标，甚至优先考虑特定浏览器（Netscape）。他拥抱Flash的视觉功能，尽管它具有专有性质。尼尔森是一位“可用性大师”，他倡导跨浏览器的语义编码和可访问性，主张将内容与表现分离，并最终支持CSS。他强烈反对Flash。泽尔德曼则介于两者之间，最初同时拥抱CSS和Flash，认为设计既可以美观又符合标准。\n\n文章强调了优先考虑视觉效果（西格尔，最初的泽尔德曼）与可用性和可访问性（尼尔森，后来的泽尔德曼）之间的紧张关系。Flash提供了立竿见影的视觉冲击力，但牺牲了语义代码和标准。CSS虽然前景广阔，但面临着浏览器支持不一致的问题。\n\n文章随后追踪了这些大师们的后续职业生涯。尼尔森的极简主义Useit网站成为了过时设计的象征，最终并入了他的NNGroup。西格尔探索了商业、区块链和其他领域。泽尔德曼仍然是一位网页设计师，目前在Automattic工作，这表明他结合标准和设计感性的平衡方法可以说“胜出”了。文章最后以泽尔德曼重新设计其网站的令人兴奋的消息作为结尾，暗示着他对原始设计理念的重新关注，并希望它能得到更广泛的采用。"
  },
  {
    "id": "44130301",
    "title": "Net-Negative Cursor",
    "url": "https://lukasatkinson.de/2025/net-negative-cursor/",
    "summary": "Lukas Atkinson critiques AI-assisted development tools using an example featured on the Cursor Editor's website. The article argues that, in this instance, the AI-generated code change, intended to improve a Rust function reading length-delimited strings, is actually detrimental and reduces productivity.\n\nThe AI suggests adding length validation and sanitization. Atkinson points out that the length validation is useless because the `u16` already limits the string length, and the sanitization is questionable in both style (unnecessary allocations, obscure character literals) and correctness (arbitrary handling of whitespace, potential for breaking the application, and incompatibility with a mirroring `write_string()` function).\n\nAtkinson contends that the AI tool makes suboptimal decisions without providing the necessary context for informed choices, leading to code that is either useless or subtly incorrect. He emphasizes that programming involves numerous decisions, and while AI tools can assist with boilerplate, they should also flag important decisions requiring human review.\n\nUltimately, Atkinson argues that when AI tools generate flawed code requiring extensive review and discussion, they become a \"net-negative\" for productivity, even in what Cursor considers a showcase example of AI-assisted coding. He concludes that current AI tools often fail to provide the necessary context and informed decision-making support required for effective programming.\n",
    "chinese_title": "净负光标",
    "chinese_summary": "Lukas Atkinson 评 Cursor Editor 网站上的一个例程，批评了 AI 辅助开发工具。文章指出，在这个例子中，AI 生成的代码修改（旨在改进读取长度分隔字符串的 Rust 函数）实际上是有害的，并降低了生产力。\n\nAI 建议添加长度验证和清理。Atkinson 指出，长度验证是无用的，因为 `u16` 已经限制了字符串长度，而清理在风格上（不必要的分配，晦涩的字符字面量）和正确性上都值得怀疑（对空格的任意处理，可能破坏应用程序，并且与镜像的 `write_string()` 函数不兼容）。\n\nAtkinson 认为，AI 工具在没有提供做出明智选择的必要上下文的情况下做出了次优的决策，导致代码要么是无用的，要么是微妙的错误。他强调，编程涉及无数的决策，虽然 AI 工具可以帮助处理样板代码，但它们也应该标记出需要人工审核的重要决策。\n\n最终，Atkinson 认为，当 AI 工具生成有缺陷的代码，需要进行大量的审查和讨论时，即使在 Cursor 认为的 AI 辅助编码的展示案例中，它们也会对生产力产生“净负面”影响。他总结说，当前的 AI 工具通常无法提供有效编程所需的必要上下文和知情决策支持。"
  },
  {
    "id": "44134005",
    "title": "Worldlines: Visualizing Special Relativity (2010)",
    "url": "https://worldlines.sourceforge.net/#source-code",
    "summary": "\"Worldlines: Visualizing Special Relativity\" is a project that uses the Processing programming language to create interactive visualizations of special relativity concepts. The project aims to make these complex ideas more accessible and understandable through visual representation.\n\nKey features of the project include:\n\n*   **Interactive Visualizations:** The core of the project involves dynamic visual representations of relativistic phenomena, allowing users to manipulate parameters and observe the resulting effects on worldlines and other elements.\n*   **Handbook:** The project includes a handbook (available in PDF and HTML formats) that presumably explains the underlying physics and how to use the visualization.\n*   **Application (App):** Ready-to-use applications are available for Windows, macOS, and Linux, offering a user-friendly way to interact with the visualizations without needing to write code.\n*   **Source Code:** The source code is available on GitHub, allowing users to explore the implementation details, modify the visualizations, and contribute to the project.\n*   **Components:** The source code listing indicates a modular design, with classes/components focusing on specific elements of the simulation such as axes, frames of reference, geometry, particles, and the relativistic calculations themselves.\n*   **Contact:** The project provides contact information via Twitter and email.\n\nIn essence, \"Worldlines\" is an educational tool designed to aid in learning and understanding special relativity through interactive visual simulations built using Processing.\n",
    "chinese_title": "世界线：狭义相对论可视化 (2010)",
    "chinese_summary": "世界线：狭义相对论可视化 是一个使用 Processing 编程语言创建狭义相对论概念的交互式可视化项目的工具。 该项目旨在通过视觉表示使这些复杂的概念更易于理解和掌握。\n\n该项目的关键特性包括：\n\n*   **交互式可视化：** 项目的核心在于相对论现象的动态视觉表示，允许用户操纵参数并观察其对世界线和其他元素的影响。\n*   **手册：** 该项目包含一本手册（提供 PDF 和 HTML 格式），据推测其中解释了基本物理原理以及如何使用可视化工具。\n*   **应用程序（App）：** 提供适用于 Windows、macOS 和 Linux 的即用型应用程序，提供了一种用户友好的方式来与可视化工具交互，而无需编写代码。\n*   **源代码：** 源代码可在 GitHub 上获取，允许用户探索实现细节、修改可视化效果并为项目做出贡献。\n*   **组件：** 源代码列表表明采用模块化设计，类/组件专注于模拟的特定元素，例如轴、参考系、几何图形、粒子和相对论计算本身。\n*   **联系方式：** 该项目通过 Twitter 和电子邮件提供联系信息。\n\n本质上，“世界线” 是一种教育工具，旨在通过使用 Processing 构建的交互式视觉模拟来帮助学习和理解狭义相对论。"
  },
  {
    "id": "44124652",
    "title": "Show HN: I made a Zero-config tool to visualize your code",
    "url": "https://staying.fun/en",
    "summary": "This \"Show HN\" submission introduces a zero-configuration code visualization platform. The tool aims to help users, especially students, educators, and developers, visualize their code in real-time. It supports Python, JavaScript, and C++, and emphasizes the visualization of data structures and algorithms. The key selling point is its \"zero-config\" nature, suggesting ease of use and a quick setup process. The platform promises to facilitate learning, improve coding efficiency, and allow users to both visualize and document their code.\n",
    "chinese_title": "Show HN: 我做了一个零配置代码可视化工具",
    "chinese_summary": "此“Show HN”提交介绍了一个零配置代码可视化平台。该工具旨在帮助用户，特别是学生、教育工作者和开发者，实时可视化他们的代码。它支持Python、JavaScript和C++，并强调数据结构和算法的可视化。其主要卖点是其“零配置”特性，表明易于使用和快速设置。该平台承诺促进学习，提高编码效率，并允许用户可视化和记录他们的代码。"
  },
  {
    "id": "44129603",
    "title": "California has got good at building giant batteries",
    "url": "https://www.economist.com/united-states/2025/05/22/california-has-got-really-good-at-building-giant-batteries",
    "summary": "California has become a leader in building large-scale battery storage, particularly in areas like eastern Kern County where renewable energy infrastructure is concentrated. These giant batteries, resembling shipping containers, are crucial for storing energy generated by wind and solar power. At peak times, these batteries provide 30% of the state’s electricity needs. The Eland solar and storage project, for example, features Tesla batteries and highlights the growing presence of battery technology alongside other renewable energy sources in California.\n",
    "chinese_title": "加州擅长建造巨型电池。",
    "chinese_summary": "加州已成为大规模电池储能领域的领导者，尤其是在可再生能源基础设施集中的东部克恩县等地区。这些巨大的电池，外形酷似集装箱，对于储存风能和太阳能发电至关重要。在高峰时段，这些电池可满足该州 30% 的电力需求。 例如，Eland 太阳能和储能项目就采用了特斯拉电池，突显了电池技术在加州与其他可再生能源并存的日益增长的地位。"
  },
  {
    "id": "44107828",
    "title": "Reducing Huntington’s-related repeat expansions in patient cells and in mice",
    "url": "https://www.nature.com/articles/s41588-025-02172-8",
    "summary": "This article explores a novel therapeutic approach for Trinucleotide Repeat (TNR) diseases like Huntington's disease (HD) and Friedreich's ataxia (FRDA), which are caused by expanded and unstable TNR sequences (CAG•CTG and GAA, respectively). The researchers utilized base editing, a precise genome editing technology, to introduce interruptions within these pathogenic repeats, mimicking naturally occurring, stable variants found in healthy individuals.\n\nThey used cytosine and adenine base editors (CBEs and ABEs) to create G•C>A•T and A•T>G•C substitutions, respectively, at CAG and GAA repeats. In vitro experiments in HEK293T cells demonstrated efficient CAG repeat editing using optimized CBEs like EA-evoA-32NLS. Application of this CAG-CBE strategy to HD patient-derived fibroblasts resulted in significant interruption of pathogenic CAG repeats and, crucially, prevented somatic repeat expansion over 30 days, even promoting contraction of the repeats.\n\nIn vivo experiments in HD and FRDA mouse models (Htt.Q111 and YG8s, respectively) using AAV9 delivery of base editors showed efficient editing in transduced tissues and reduced repeat expansion in the central nervous system. The study also investigated potential off-target effects of the CAG-CBE strategy, mapping genomic sites targeted due to sequence similarity. Overall, the research demonstrates the potential of base editing to mitigate a key neurological feature of TNR diseases by inducing interruptions in pathogenic TNR tracts, promoting their stability and contraction.\n",
    "chinese_title": "减少亨廷顿舞蹈症相关重复序列在患者细胞和小鼠中的扩增",
    "chinese_summary": "本文探讨了一种针对三核苷酸重复序列 (TNR) 疾病（如亨廷顿病 (HD) 和弗里德赖希共济失调 (FRDA)）的新型治疗方法，这些疾病由扩展且不稳定的 TNR 序列（分别为 CAG•CTG 和 GAA）引起。研究人员利用碱基编辑这种精确的基因组编辑技术，在这些致病重复序列内引入中断，模拟在健康个体中发现的天然存在的稳定变异体。\n\n他们使用胞嘧啶和腺嘌呤碱基编辑器（CBE 和 ABE）分别在 CAG 和 GAA 重复序列处产生 G•C>A•T 和 A•T>G•C 替换。在 HEK293T 细胞中进行的体外实验表明，使用优化的 CBE（如 EA-evoA-32NLS）可以有效地编辑 CAG 重复序列。将这种 CAG-CBE 策略应用于 HD 患者来源的成纤维细胞，可显著中断致病性 CAG 重复序列，并且至关重要的是，可在 30 天内阻止体细胞重复序列的扩展，甚至促进重复序列的收缩。\n\n在 HD 和 FRDA 小鼠模型（分别为 Htt.Q111 和 YG8s）中进行的体内实验，使用 AAV9 递送碱基编辑器显示，在转导的组织中实现了有效编辑，并减少了中枢神经系统中重复序列的扩展。该研究还调查了 CAG-CBE 策略的潜在脱靶效应，绘制了因序列相似性而被靶向的基因组位点。总的来说，该研究证明了碱基编辑通过诱导致病性 TNR 序列束中的中断，促进其稳定和收缩，从而减轻 TNR 疾病的关键神经特征的潜力。"
  },
  {
    "id": "44127177",
    "title": "Civil War in 3D: Stereographs from the New-York Historical Society (2015)",
    "url": "https://www.nyhistory.org/blogs/civil-war-in-3d-stereographs-from-the-new-york-historical-society",
    "summary": "This article from the New-York Historical Society discusses its digitization of over 700 stereographs from the U.S. Civil War, making them accessible online. Stereographs, popular during the Civil War era, combine two slightly offset photographs to create a three-dimensional image when viewed through a stereoscope. The article details the history of the stereograph, crediting Sir Charles Wheatstone with its invention and Oliver Wendell Holmes with coining the term and improving the viewer.\n\nThe piece highlights Mathew Brady and his company as key documenters of the Civil War through photography, noting that Brady likely employed numerous photographers to capture the conflict. Alexander Gardner and Timothy H. O’Sullivan, also prominent photographers of the era, are mentioned as contributors to the collection. Many images depict the devastation and death resulting from the war.\n\nThe article then addresses the challenge of viewing these images in their intended format due to the scarcity of antique stereoscopes. It highlights modern solutions like the New York Public Library's Stereogranimator, which creates animated GIFs and anaglyphs from stereographs, and Google Cardboard, which allows viewing stereographs using a smartphone and a cardboard viewer. The author concludes by emphasizing the enduring novelty and impact of experiencing these historical 3D images, allowing modern viewers to connect with events and figures from the Civil War era. Links to access the digitized collections are provided.\n",
    "chinese_title": "三维内战：来自纽约历史学会的立体照片 (2015)",
    "chinese_summary": "纽约历史学会文章探讨其将700多幅美国内战立体照片数字化，使其可在线访问。立体照片在内战时期风靡一时，它结合了两张略有偏移的照片，通过立体镜观看时可形成三维图像。文章详细介绍了立体照片的历史，认为查尔斯·惠斯通爵士发明了它，而奥利弗·温德尔·霍姆斯创造了这个术语并改进了观看器。\n\n文章重点介绍了马修·布雷迪及其公司作为通过摄影记录内战的关键人物，并指出布雷迪可能雇用了许多摄影师来捕捉这场冲突。亚历山大·加德纳和蒂莫西·H·奥沙利文也是该时期著名的摄影师，他们也被提及为该收藏的贡献者。许多图像描绘了战争造成的破坏和死亡。\n\n文章随后探讨了由于古董立体镜的稀缺，以其预期格式观看这些图像的挑战。它强调了现代解决方案，例如纽约公共图书馆的Stereogranimator，该工具可以从立体照片创建动画GIF和浮雕图片，以及Google Cardboard，它允许使用智能手机和纸板观看器观看立体照片。作者最后强调了体验这些历史3D图像的持久新颖性和影响力，使现代观众能够与内战时期的事件和人物联系起来。文章提供了访问数字化馆藏的链接。"
  },
  {
    "id": "44112686",
    "title": "The Polymarket users betting on when Jesus will return",
    "url": "https://ericneyman.wordpress.com/2025/03/24/will-jesus-christ-return-in-an-election-year/",
    "summary": "Eric Neyman explores why people are betting on Polymarket that Jesus Christ will return in 2025, despite the seemingly low probability. He highlights that traders have wagered over $100,000, pushing the market to trade around 3%.\n\nNeyman dismisses simple explanations like genuine belief, expectation of incorrect market resolution, or mere entertainment (\"the memes\"). He argues that the reason isn't a belief in the actual event, but rather a bet on the \"time value of Polymarket cash.\"\n\nThe core argument is that later in the year, increased activity in other markets (e.g., elections, geopolitical events) may lead traders to desperately need funds to bet on those events. This increased demand could drive up the price of \"No\" shares (bets against Jesus's return), allowing \"Yes\" bettors to sell their shares for a profit, even if Jesus doesn't return.\n\nNeyman uses the example of the 2024 election where bets on candidates in safe states skyrocketed in price on election day as traders sought to free up capital for other wagers. The Jesus market, therefore, becomes a proxy for gauging the expected demand for Polymarket funds throughout the year, especially during periods of heightened trading activity. He concludes that the Jesus market's pricing is an indicator of the time value of money within the Polymarket ecosystem, not necessarily a reflection of belief in the Second Coming.\n",
    "chinese_title": "在Polymarket上下注耶稣何时归来的用户",
    "chinese_summary": "埃里克·内曼探讨了人们为何在Polymarket上押注耶稣基督将在2025年回归，尽管可能性似乎很低。他强调，交易员已押注超过10万美元，推动市场交易额达到3%左右。\n\n内曼否定了简单的解释，例如真诚的信仰、对市场错误解决的期望，或者仅仅是娱乐（“迷因”）。他认为，原因并非是对实际事件的相信，而是押注于“Polymarket现金的时间价值”。\n\n核心论点是，今年晚些时候，其他市场（例如选举、地缘政治事件）的活跃度增加可能导致交易员迫切需要资金来押注这些事件。这种需求的增加可能会推高“否”股票（反对耶稣回归的赌注）的价格，从而使“是”投注者能够出售他们的股票以获取利润，即使耶稣没有回归。\n\n内曼以2024年选举为例，在安全州的候选人赌注在选举日价格飙升，因为交易员试图释放资金用于其他投注。因此，耶稣市场成为衡量今年Polymarket资金预期需求的指标，尤其是在交易活动高峰期。他得出结论，耶稣市场的定价是Polymarket生态系统中货币时间价值的指标，不一定反映了对耶稣再临的信仰。"
  },
  {
    "id": "44123289",
    "title": "RSyncUI – A SwiftUI based macOS GUI for rsync",
    "url": "https://github.com/rsyncOSX/RsyncUI",
    "summary": "RsyncUI is a macOS application that provides a graphical user interface (GUI) for the command-line tool `rsync`, used for synchronizing data. Built with SwiftUI and requiring macOS Sonoma or later, RsyncUI simplifies the use of `rsync` by allowing users to organize tasks and set parameters through a user-friendly interface. The application itself doesn't perform the synchronization; instead, it uses the `rsync` command-line tool in the background.\n\nThe current version, v2.5.5 (released May 23, 2025), is actively being developed. Users can install RsyncUI either through Homebrew using the command `brew install --cask rsyncui` or by downloading it directly. The application is signed and notarized by Apple for security.\n\nImportantly, the execution of `rsync` is an external process monitored by RsyncUI. Users can abort running tasks, but must allow the abort to complete fully to prevent potential unresponsiveness. The provided documentation is based on a fork of the Docsy Hugo theme.\n",
    "chinese_title": "RSyncUI – 基于SwiftUI的macOS rsync图形界面",
    "chinese_summary": "RsyncUI 是一款 macOS 应用程序，为命令行工具 `rsync` 提供图形用户界面 (GUI)，用于同步数据。RsyncUI 使用 SwiftUI 构建，需要 macOS Sonoma 或更高版本，它通过用户友好的界面允许用户组织任务和设置参数，从而简化了 `rsync` 的使用。该应用程序本身不执行同步；而是使用后台的 `rsync` 命令行工具。\n\n当前版本 v2.5.5（发布于 2025 年 5 月 23 日）正在积极开发中。用户可以通过 Homebrew 使用命令 `brew install --cask rsyncui` 安装 RsyncUI，或者直接下载它。该应用程序已由 Apple 签名和公证，以确保安全。\n\n重要的是，`rsync` 的执行是由 RsyncUI 监控的外部进程。用户可以中止正在运行的任务，但必须允许中止完全完成，以防止潜在的无响应。提供的文档基于 Docsy Hugo 主题的一个分支。"
  },
  {
    "id": "44128901",
    "title": "Airlines are charging solo passengers higher fares than groups",
    "url": "https://thriftytraveler.com/news/airlines/airlines-charging-solo-travelers-higher-fares/",
    "summary": "Airlines, including American, Delta, and United, are charging solo travelers higher fares compared to groups of two or more on some domestic routes. This pricing tactic isn't widespread but has been confirmed by Thrifty Traveler's flight deal analysts. The difference in price can be significant, with examples showing one-way fares dropping by almost a third when booking for multiple passengers.\n\nThe airlines achieve this by opening up different fare classes based on the number of passengers. For example, a solo traveler might only see the \"discount coach\" fare, while a group booking unlocks \"deep discount coach\" tickets. Fare rules even specify that the cheaper tickets require accompaniment by another adult.\n\nThe rationale behind this is likely \"segmentation,\" where airlines target business travelers, who are perceived to be less price-sensitive due to corporate travel budgets. However, this penalizes other solo travelers, such as those traveling for emergencies or visiting family.\n\nThis pricing strategy is mainly seen on one-way domestic flights, not roundtrips or international routes, and isn't practiced by all major U.S. carriers like Alaska, JetBlue, or Southwest. Airlines have not commented on this practice, but it highlights a growing trend of airlines tailoring prices based on customer profiles. This change will likely catch many travelers off guard, because bulk discounts are unusual for airlines, particularly for booking just two passengers.\n",
    "chinese_title": "航空公司向单独旅客收取的票价比团体旅客高。",
    "chinese_summary": "包括美国航空、达美航空和联合航空在内的航空公司，在某些国内航线上，对单人旅行者收取的费用高于两人或两人以上的团体。这种定价策略并不普遍，但经 Thrifty Traveler 的机票交易分析师证实。价格差异可能很大，有例子显示，预订多名乘客时，单程机票价格下降了近三分之一。\n\n航空公司通过根据乘客人数开放不同的票价等级来实现这一点。例如，单人旅行者可能只能看到“折扣经济舱”票价，而团体预订可以解锁“深度折扣经济舱”机票。票价规则甚至明确规定，更便宜的机票需要另一位成人陪同。\n\n这背后的原因很可能是“细分”，航空公司以此锁定商务旅客，因为他们被认为对价格不太敏感，因为有公司差旅预算。然而，这惩罚了其他单人旅行者，例如那些因紧急情况旅行或探亲的人。\n\n这种定价策略主要见于单程国内航班，而不是往返或国际航线，而且并非所有主要的美国航空公司（如阿拉斯加航空、捷蓝航空或西南航空）都采用这种策略。航空公司尚未对此做法发表评论，但这凸显了航空公司根据客户资料定制价格的日益增长的趋势。这种变化可能会让许多旅行者措手不及，因为批量折扣对于航空公司来说并不常见，尤其是只预订两名乘客。"
  },
  {
    "id": "44132409",
    "title": "MariaDB Acquires Galera Cluster",
    "url": "https://mariadb.com/newsroom/press-releases/mariadb-acquires-galera-cluster/",
    "summary": "MariaDB plc has acquired Codership Oy, the company behind Galera Cluster, a high-availability database solution. This acquisition strengthens MariaDB's European engineering and technical support team by bringing the core Galera team and founders into MariaDB. Galera Cluster has been a standard part of MariaDB Server for over nine years, with over a third of MariaDB Enterprise Platform customers already utilizing it.\n\nThe acquisition aims to enhance MariaDB's high availability and advanced replication capabilities, meeting growing customer demand for zero data loss in high-volume production environments. According to MariaDB, incorporating Galera Cluster will allow them to deliver a higher level of support and accelerate innovation.\n\nBoth MariaDB and MySQL versions of Galera Cluster will be maintained in the short term. Since being taken private by K1 Investment Management and the appointment of Rohit de Souza as CEO, MariaDB has been investing heavily in innovation, including launching open-source vector search capabilities and a new MariaDB Enterprise Platform version. The company was also recognized with a 2025 AI TechAward for its open-source vector search.\n",
    "chinese_title": "MariaDB 收购 Galera Cluster",
    "chinese_summary": "MariaDB plc 收购高可用数据库解决方案 Galera Cluster 背后的公司 Codership Oy。此次收购将核心 Galera 团队和创始人纳入 MariaDB，从而加强了 MariaDB 的欧洲工程和技术支持团队。九年多来，Galera Cluster 一直是 MariaDB Server 的标准组成部分，超过三分之一的 MariaDB Enterprise Platform 客户已经在使用它。\n\n此次收购旨在增强 MariaDB 的高可用性和高级复制能力，以满足客户对高容量生产环境中零数据丢失日益增长的需求。MariaDB 表示，整合 Galera Cluster 将使他们能够提供更高水平的支持并加速创新。\n\n短期内，MariaDB 和 MySQL 版本的 Galera Cluster 都将得到维护。自从被 K1 Investment Management 私有化并任命 Rohit de Souza 为 CEO 以来，MariaDB 一直在加大对创新的投资，包括推出开源向量搜索功能和新的 MariaDB Enterprise Platform 版本。该公司还因其开源向量搜索而荣获 2025 年 AI TechAward。"
  },
  {
    "id": "44132271",
    "title": "Domain/OS Design Principles (1989) [pdf]",
    "url": "http://www.bitsavers.org/pdf/apollo/014962-A00_Domain_OS_Design_Principles_Jan89.pdf",
    "summary": "I am unable to summarize the article as it contains binary data instead of human-readable content. The provided text appears to be a PDF file's internal structure, not the article's text.\n",
    "chinese_title": "域/操作系统设计原则 (1989) [pdf]",
    "chinese_summary": "由于提供的不是人类可读的内容，而是二进制数据，我无法总结文章。提供的文本似乎是PDF文件的内部结构，而不是文章的文本。"
  },
  {
    "id": "44119890",
    "title": "What does “Undecidable” mean, anyway",
    "url": "https://buttondown.com/hillelwayne/archive/what-does-undecidable-mean-anyway/",
    "summary": "This article explains the concept of \"undecidability\" in computer science, targeted at readers with limited technical knowledge. It begins by defining a \"decidable\" problem as one where a Turing machine can always correctly determine if an input string satisfies a given property (accept) or not (reject).\n\nThe author clarifies that this model covers a wide range of problems because strings can represent any data and non-boolean outputs can be faked. While weaker models like DFAs cannot solve all problems, Turing Machines (TMs) are theoretically the most powerful, with the Church-Turing thesis stating that if a real-world programming language can solve a problem, so can a TM.\n\nA key aspect of TMs is their ability to simulate other TMs, allowing for composition and decision problems about their behavior. The article then defines \"undecidable\" problems as those that no Turing machine can solve completely; there is no algorithm that can *always* determine if a program halts for any arbitrary program.\n\nThe article emphasizes that undecidability doesn't mean *all* instances of a problem are unsolvable, just that a general solution is impossible. Undecidability forces us to expend significant effort and face potential failure when trying to determine if a program has a specific property. The author concludes by stating what a world where all problems were decidable would look like, highlighting how much easier formal verification would be.\n",
    "chinese_title": "“不可判定”到底是什么意思",
    "chinese_summary": "本文面向技术知识有限的读者解释计算机科学中“不可判定性”的概念。文章首先将“可判定”问题定义为图灵机始终能正确判断输入字符串是否满足给定属性（接受）或不满足（拒绝）的问题。\n\n作者阐明，此模型涵盖了广泛的问题，因为字符串可以表示任何数据，并且非布尔输出可以伪造。虽然像DFA这样的较弱模型无法解决所有问题，但图灵机（TM）在理论上是最强大的，Church-Turing论题指出，如果现实世界的编程语言可以解决一个问题，那么TM也可以。\n\nTM的一个关键方面是它们能够模拟其他TM，从而可以组合并解决关于其行为的决策问题。文章接着将“不可判定”问题定义为没有任何图灵机能够完全解决的问题；不存在可以*总是*确定程序是否对于任何任意程序停止的算法。\n\n文章强调，不可判定性并不意味着问题的*所有*实例都无法解决，而只是通用的解决方案是不可能的。不可判定性迫使我们花费大量精力并面临潜在的失败，才能确定程序是否具有特定属性。作者最后描述了一个所有问题都是可判定的世界会是什么样子，突出了形式验证会变得多么容易。"
  },
  {
    "id": "44134122",
    "title": "Memvid – Video-Based AI Memory",
    "url": "https://github.com/Olow304/memvid",
    "summary": "Memvid is a novel approach to AI memory management that encodes text data into video files, offering a lightweight and efficient alternative to traditional vector databases. It enables sub-second semantic search across millions of text chunks stored within a single MP4 file. This \"video-as-database\" approach achieves up to 10x compression compared to conventional methods, minimizing RAM and storage requirements.\n\nKey features include semantic search capabilities, a built-in chat interface, PDF support, offline functionality, and a simple API. Memvid is compatible with various LLMs (OpenAI, Anthropic, local models) and requires minimal infrastructure. Use cases range from digital libraries and educational content to corporate knowledge bases and personal notes.\n\nThe lightweight architecture, implemented in roughly 1000 lines of Python, is CPU-friendly and portable, with the entire knowledge base contained in a single, streamable video file. Installation is straightforward via `pip install memvid`. The documentation provides examples for basic usage, building memories from documents, advanced search, and creating interactive chat interfaces.  Advanced configuration options include custom embeddings, video optimization techniques, and distributed processing. The document also includes troubleshooting, contribution guidelines, a comparison with traditional solutions, a roadmap outlining future development, and acknowledgements.\n",
    "chinese_title": "Memvid – 基于视频的AI记忆",
    "chinese_summary": "Memvid：一种新型AI内存管理方法，将文本数据编码为视频文件，提供了一种轻量高效的替代传统向量数据库的方案。它能在单个MP4文件中存储的数百万个文本块中实现亚秒级的语义搜索。这种“视频即数据库”的方法与传统方法相比，压缩率高达10倍，从而最大限度地减少了RAM和存储需求。\n\n主要功能包括语义搜索能力、内置聊天界面、PDF支持、离线功能以及简单的API。Memvid与各种LLM（OpenAI、Anthropic、本地模型）兼容，并且需要最少的infrastructure。用例范围从数字图书馆和教育内容到企业知识库和个人笔记。\n\n该轻量级架构用大约1000行Python代码实现，对CPU友好且可移植，整个知识库都包含在单个可流式传输的视频文件中。可以通过`pip install memvid`直接安装。文档提供了基本用法、从文档构建记忆、高级搜索以及创建交互式聊天界面的示例。高级配置选项包括自定义嵌入、视频优化技术和分布式处理。文档还包括故障排除、贡献指南、与传统解决方案的比较、概述未来发展方向的路线图以及致谢。"
  },
  {
    "id": "44097362",
    "title": "From Finite Integral Domains to Finite Fields",
    "url": "https://susam.net/from-finite-integral-domains-to-finite-fields.html",
    "summary": "This article explores the relationship between fields and integral domains in abstract algebra, focusing particularly on the impact of finiteness. It begins by defining an integral domain as a commutative ring with distinct additive and multiplicative identities, possessing no zero divisors. Examples of integral domains include the integers (ℤ), rational numbers (ℚ), and polynomials over an integral domain (R[t]). The article establishes key properties like *a* ⋅ 0 = 0 and the cancellation property. It clarifies that an integral domain must be a non-zero ring (0 ≠ 1).\n\nThe core of the article demonstrates that every field is an integral domain. However, the converse isn't always true. The integers (ℤ) serve as a counterexample: they form an infinite integral domain but not a field. Notably, the article proves that *every finite integral domain is a field*. Two proofs are provided for this result. The first utilizes the cancellation property and the pigeonhole principle. The second proof avoids the cancellation property, again using the pigeonhole principle to arrive at the same conclusion.\n\nThe article concludes by summarizing the key findings: all fields are integral domains, all finite integral domains are fields, some infinite integral domains are fields (e.g., ℚ, ℝ, ℂ), and some infinite integral domains are not fields (e.g., ℤ). The interaction between structure and size reveals that the finiteness condition transforms an integral domain into a field.\n",
    "chinese_title": "从有限整环到有限域",
    "chinese_summary": "本文探讨了抽象代数中域与整环之间的关系，特别关注有限性对它们的影响。文章首先将整环定义为一个具有不同加法单位元和乘法单位元的交换环，且没有零因子。整环的例子包括整数 (ℤ)、有理数 (ℚ) 以及整环上的多项式 (R[t])。本文确立了*a* ⋅ 0 = 0 和消去律等关键性质。它阐明了整环必须是一个非零环 (0 ≠ 1)。\n\n本文的核心论点在于证明每个域都是一个整环。然而，反之并不总是成立。整数 (ℤ) 就是一个反例：它们构成一个无限整环，但不是一个域。值得注意的是，本文证明了*每个有限整环都是一个域*。文章提供了两种证明方法。第一种方法利用了消去律和鸽巢原理。第二种证明方法避免了使用消去律，同样使用鸽巢原理得出相同的结论。\n\n文章最后总结了关键发现：所有域都是整环，所有有限整环都是域，一些无限整环是域（例如，ℚ、ℝ、ℂ），一些无限整环不是域（例如，ℤ）。结构与大小之间的相互作用表明，有限性条件将整环转换为域。"
  },
  {
    "id": "44132269",
    "title": "The-One-True-Lisp-Style-Guide",
    "url": "https://github.com/foxsae/The-One-True-Lisp-Style-Guide",
    "summary": "This document, titled \"The One True Lisp Style Guide,\" aims to identify common ground among various existing Common Lisp style guides to create a simplified, universally acceptable set of recommendations. It synthesizes advice from sources like Peter Norvig and Kent Pitman's tutorial, the lisp-lang.org style guide, the Google Common Lisp style guide, and others.\n\nThe guide emphasizes the importance of style guides for improving readability and preventing common programming errors. Key consensus points include:\n\n*   **Documentation:** Docstrings are crucial and should explain the purpose of code elements.\n*   **Comment Conventions:** A hierarchical system of semicolons for varying levels of comments (inline, top-level, region-specific, header).\n*   **Line Length:** Lines should be limited to under 100 characters, with shorter preferred.\n*   **Naming Conventions:** Names should be descriptive, brief, lowercase, separated by hyphens, and use `*` for specials and `+` for constants.\n*   **Function Definition:** Avoid mixing `&OPTIONAL` and `&KEY` arguments when possible.\n*   **Special Variables:** Use sparingly.\n*   **Indentation:** Rely on a properly configured editor's indentation standards.\n*   **Functional Style:** Write functions with a single, well-defined purpose.\n*   **Eval Usage:** `Eval` should be avoided unless absolutely necessary.\n*   **Macros:** Understanding macros is preferred over defining them.\n*   **Usage of :use:** `:import-from` is preferable unless all symbols are needed.\n*   **Error Detection:** Understand the difference between conditions and errors.\n*   **Library Usage:** Encouraged.\n*   **Recursion:** Favor iteration over recursion, except with recursive data structures.\n*   **Type Checking:** Explicitly declare types when known.\n*   **Conditional Expressions:** Use `when` or `unless` instead of `if` without `else`, and `cond` for multi-branch statements.\n*   **Predicates:** Suffix predicates with \"p\" or \"-p\".\n*   **List Abuse:** Use the appropriate data structure for each situation.\n",
    "chinese_title": "唯一正确的Lisp风格指南",
    "chinese_summary": "唯一Lisp风格指南：本指南旨在整合现有Common Lisp风格指南中的共识，创建一套简化且普遍接受的建议。它综合了来自Peter Norvig和Kent Pitman的教程、lisp-lang.org风格指南、Google Common Lisp风格指南等资料的建议。\n\n本指南强调风格指南对于提高可读性和防止常见编程错误的重要性。主要共识包括：\n\n*   **文档：** 文档字符串至关重要，应解释代码元素的用途。\n*   **注释约定：** 使用分号的分层系统来表示不同级别的注释（行内、顶层、区域特定、标题）。\n*   **行长：** 行长应限制在100个字符以下，越短越好。\n*   **命名约定：** 名称应具有描述性、简洁、小写、用连字符分隔，特殊变量使用`*`，常量使用`+`。\n*   **函数定义：** 尽量避免混合使用`&OPTIONAL`和`&KEY`参数。\n*   **特殊变量：** 谨慎使用。\n*   **缩进：** 依赖于正确配置的编辑器的缩进标准。\n*   **函数式风格：** 编写具有单一、明确用途的函数。\n*   **Eval的使用：** 除非绝对必要，否则应避免使用`Eval`。\n*   **宏：** 理解宏比定义宏更重要。\n*   **:use的使用：** 除非需要所有符号，否则`:import-from`更可取。\n*   **错误检测：** 了解条件和错误之间的区别。\n*   **库的使用：** 鼓励使用。\n*   **递归：** 除了递归数据结构外，优先选择迭代而不是递归。\n*   **类型检查：** 在已知类型时显式声明类型。\n*   **条件表达式：** 使用`when`或`unless`代替没有`else`的`if`，使用`cond`进行多分支语句。\n*   **谓词：** 谓词后缀使用“p”或“-p”。\n*   **滥用列表：** 为每种情况使用适当的数据结构。"
  },
  {
    "id": "44137273",
    "title": "Vanilla Web Components",
    "url": "https://github.com/vanillawc",
    "summary": "The \"Vanilla Web Components\" organization is a collective of developers dedicated to creating, sharing, and promoting Web Components (WC) using only the native WC specifications, without extra abstraction layers, dependencies, or complex build processes. The goal is to explore the potential and address criticisms of the WC standard's \"low-level\" API.\n\nThe organization showcases a variety of vanilla WC implementations, covering functionalities like arrows, carousels, code editors, date pickers, JSON viewers, markdown renderers, and more.\n\nContributions are welcome via Showcase, Proposal, and Discussion issues on GitHub. Contributors are encouraged to prefix repositories with \"wc-\", encapsulate code, prioritize reusability and accessibility, and use copyleft-friendly licenses like MIT. Avoiding additional abstraction layers, complex build steps, and personal attacks is also emphasized.\n\nThe document provides links to various Web Components communities (W3C, WebComponents.org, Open-WC.org), case studies of Web Component usage at companies like GitHub and CloudFour, collections of Web Components from various organizations (GitHub, Adobe, Penn State, ING Bank, RedHat, Boston University), and a list of resources for learning more about Web Components including the MDN documentation. The repository is dual-licensed under MIT (source code) and CC-BY-SA-4.0 (written content and assets).\n",
    "chinese_title": "原生 Web 组件",
    "chinese_summary": "“原生Web Components”组织是由一群开发者组成的团体，致力于仅使用原生WC规范，不依赖额外的抽象层、依赖项或复杂的构建过程，来创建、分享和推广Web Components（WC）。其目标是探索WC标准“底层”API的潜力并解决对其的批评。\n\n该组织展示了各种原生WC实现，涵盖箭头、轮播图、代码编辑器、日期选择器、JSON查看器、Markdown渲染器等功能。\n\n欢迎通过GitHub上的Showcase、Proposal和Discussion issue提交贡献。鼓励贡献者在仓库名称前加上\"wc-\"前缀，封装代码，优先考虑可重用性和可访问性，并使用像MIT这样对Copyleft友好的许可协议。还强调避免额外的抽象层、复杂的构建步骤和人身攻击。\n\n本文档提供了指向各种Web Components社区（W3C、WebComponents.org、Open-WC.org）、GitHub和CloudFour等公司Web Component使用案例研究、来自各个组织（GitHub、Adobe、宾夕法尼亚州立大学、荷兰国际集团银行、红帽、波士顿大学）的Web Components集合以及用于学习更多关于Web Components的资源（包括MDN文档）的链接。该存储库采用双重许可，源代码使用MIT许可，书面内容和资产使用CC-BY-SA-4.0许可。"
  },
  {
    "id": "44111236",
    "title": "Show HN: Weather2Geo – Geolocate screenshots from weather widgets",
    "url": "https://github.com/elliott-diy/Weather2Geo",
    "summary": "Weather2Geo is an open-source OSINT tool designed to geolocate screenshots based on weather widget information, specifically those from the Windows weather widget. By inputting the time, weather condition, and temperature displayed in a screenshot, the tool leverages the MSN Weather API (the same backend as the Windows widget) and a GeoNames cities database to identify cities matching those conditions.\n\nThe tool features timezone awareness, localizing the input time to each city's timezone for accuracy. It also includes clustering, grouping nearby hits to reduce noise and highlight potential locations. Users can customize the tool by adjusting temperature tolerance, clustering distance, and the cities data source.\n\nInstallation is straightforward, involving cloning the GitHub repository and installing the required Python packages. The tool is run from the command line, specifying the time, condition, temperature, and optional parameters like tolerance and cluster distance.\n\nWeather2Geo is intended for ethical, educational OSINT purposes and encourages contributions to improve matching accuracy, timezone logic, and data sources. The project welcomes bug reports, suggestions, and pull requests.\n",
    "chinese_title": "展示HN：Weather2Geo – 从天气小部件的截图中进行地理定位",
    "chinese_summary": "Weather2Geo：一款基于天气信息的截图地理定位开源情报工具。通过输入截图中的时间、天气状况和温度，该工具利用MSN天气API（与Windows小部件相同的后端）和GeoNames城市数据库，识别符合条件的城市。该工具具有时区感知功能，可将输入时间本地化为每个城市的时区以确保准确性。它还包括聚类功能，对附近的匹配结果进行分组，以减少噪声并突出显示潜在位置。用户可以通过调整温度容差、聚类距离和城市数据源来自定义该工具。安装过程简单，包括克隆GitHub存储库和安装所需的Python软件包。该工具从命令行运行，指定时间、状况、温度以及可选参数，如容差和聚类距离。Weather2Geo旨在用于符合伦理道德的教育目的开源情报，并鼓励贡献者改进匹配准确性、时区逻辑和数据源。该项目欢迎错误报告、建议和拉取请求。"
  },
  {
    "id": "44131800",
    "title": "Debian AI General Resolution Withdrawn",
    "url": "https://lwn.net/Articles/1020968/",
    "summary": "In May 2025, Debian developer Mo Zhou withdrew his proposed General Resolution (GR) that would have required the original training data for AI models to be released in order to be considered Debian Free Software Guidelines (DFSG)-compliant. The proposal aimed to ensure that AI models within Debian's main repository adhered to the DFSG.\n\nZhou's proposal contrasted with the Open Source Initiative's (OSI) Open Source AI Definition (OSAID), which doesn't require training data release. Several counter-proposals emerged, including one requiring model training during package build and another suggesting Debian endorse the OSAID.\n\nA key concern revolved around the impact on existing software like spam filters and OCR tools that rely on trained models with potentially non-free training data. Some developers worried that Zhou's proposal would disqualify such software from Debian's main repository, hindering user empowerment. Others argued for inspectability and questioned the trustworthiness of pre-trained models.\n\nZhou withdrew the proposal, acknowledging the community's unpreparedness for a vote and the need for further exploration. He plans to demonstrate how backdoors can be planted in neural networks and is seeking tools to scan the Debian archive for affected packages. The discussion raised fundamental questions about whether AI model weights should be considered software or data and whether requiring training data is practical or beneficial for Debian users.\n",
    "chinese_title": "Debian AI 通用决议撤回",
    "chinese_summary": "2025年5月，Debian开发者周摩撤回了他提出的通用决议（GR），该决议原本要求AI模型的原始训练数据必须发布，才能被视为符合Debian自由软件指南（DFSG）。该提案旨在确保Debian主仓库中的AI模型符合DFSG。\n\n周摩的提案与开源促进会（OSI）的开源人工智能定义（OSAID）形成对比，后者不要求发布训练数据。出现了几个反提案，包括一个要求在软件包构建期间进行模型训练，另一个建议Debian认可OSAID。\n\n一个关键的担忧围绕着对现有软件的影响，例如依赖于具有潜在非自由训练数据的训练模型的垃圾邮件过滤器和OCR工具。一些开发者担心周摩的提案会将此类软件从Debian的主仓库中排除，从而阻碍用户的赋权。另一些人则主张可检查性，并质疑预训练模型的可靠性。\n\n周摩撤回了该提案，承认社区尚未准备好进行投票，并且需要进一步探索。他计划演示如何在神经网络中植入后门，并正在寻找工具来扫描Debian归档中受影响的软件包。这次讨论提出了关于AI模型权重是否应被视为软件或数据，以及要求训练数据对于Debian用户来说是否实用或有益的根本性问题。"
  },
  {
    "id": "44123098",
    "title": "Show HN: Typed-FFmpeg 3.0–Typed Interface to FFmpeg and Visual Filter Editor",
    "url": "https://github.com/livingbio/typed-ffmpeg",
    "summary": "Typed-FFmpeg 3.0 is a Python package offering a modern, typed interface to FFmpeg, designed to simplify complex filter graph creation. It addresses limitations found in similar projects like ffmpeg-python by providing enhanced IDE integration, comprehensive typing, and new features like JSON serialization of filter graphs, graph visualization using graphviz, and automatic FFmpeg validation.\n\nKey features include zero dependencies (relying only on the Python standard library), user-friendly construction of filter graphs, extensive FFmpeg filter support with auto-completion and in-line documentation, robust static and dynamic type checking, and the ability to save and reload filter graphs as JSON. It also supports comprehensive input/output options and partial evaluation.\n\nInstallation is straightforward using `pip install typed-ffmpeg`. Visualization support requires an additional `pip install 'typed-ffmpeg[graph]'` and Graphviz. The package includes an interactive playground where users can experiment with filters, visualize graphs, and test configurations without local setup.\n\nWhile initially conceived using GPT-3 for code generation, the project shifted to traditional methods for a more reliable outcome, though AI tools still played a significant role in development. The project acknowledges the influence of ffmpeg-python and is dedicated to the author's son. Planned future enhancements include expanded FFmpeg version and filter support.\n",
    "chinese_title": "Show HN：Typed-FFmpeg 3.0 – FFmpeg 的类型化接口和可视化滤镜编辑器",
    "chinese_summary": "Typed-FFmpeg 3.0 是一个 Python 包，为 FFmpeg 提供了一个现代化的、类型化的接口，旨在简化复杂的滤镜图创建。它通过提供增强的 IDE 集成、全面的类型提示以及诸如滤镜图的 JSON 序列化、使用 graphviz 进行图可视化以及自动 FFmpeg 验证等新功能，解决了类似项目（如 ffmpeg-python）中存在的局限性。\n\n主要功能包括零依赖（仅依赖 Python 标准库）、用户友好的滤镜图构建、对 FFmpeg 滤镜的广泛支持（具有自动完成和内联文档）、强大的静态和动态类型检查，以及将滤镜图保存和重新加载为 JSON 的能力。它还支持全面的输入/输出选项和部分求值。\n\n可以使用 `pip install typed-ffmpeg` 轻松安装。可视化支持需要额外安装 `pip install 'typed-ffmpeg[graph]'` 和 Graphviz。该软件包包含一个交互式试验场，用户可以在其中试验滤镜、可视化图形并测试配置，而无需本地设置。\n\n虽然最初构思时使用 GPT-3 进行代码生成，但该项目转向了传统方法以获得更可靠的结果，尽管 AI 工具在开发中仍然发挥了重要作用。该项目承认 ffmpeg-python 的影响，并献给作者的儿子。计划的未来增强功能包括扩展的 FFmpeg 版本和滤镜支持。"
  },
  {
    "id": "44104832",
    "title": "The key to a successful egg drop experiment? Drop it on its side",
    "url": "https://arstechnica.com/science/2025/05/the-key-to-a-successful-egg-drop-experiment-drop-it-on-its-side/",
    "summary": "This article discusses an MIT study that challenges the conventional wisdom of egg drop experiments, where the goal is to protect an egg from breaking when dropped from a height. Traditionally, eggs are oriented vertically within protective devices. However, the MIT study, published in Communications Physics, found that dropping an egg horizontally, on its side, significantly reduces the likelihood of breakage.\n\nProfessor Tal Cohen's team conducted experiments dropping eggs from various heights in both vertical and horizontal orientations. The results showed that vertically dropped eggs broke much more frequently than horizontally dropped eggs. While vertical compression tests indicated eggs are stiffer along their long axis, distributing the load, this stiffness proves a disadvantage in dynamic impact situations like dropping.\n\nThe key takeaway is the distinction between stiffness (resistance to deformation) and toughness (ability to absorb energy before cracking). The study revealed that eggs are tougher when loaded horizontally along their equator. This is because, to survive a fall, an object needs to absorb kinetic energy through reversible deformation. Therefore, horizontal orientation allows for greater energy absorption before cracking. The authors suggest that focusing on toughness rather than stiffness is crucial for success in egg drop experiments, drawing a parallel to bending one's knees when landing a jump. The findings also highlight how improper framing of a problem can lead to misunderstanding and miseducation.\n",
    "chinese_title": "成功鸡蛋坠落实验的关键？侧面着地。",
    "chinese_summary": "本文探讨了一项麻省理工学院的研究，该研究挑战了鸡蛋坠落实验的传统认知。传统上，人们在保护装置中垂直放置鸡蛋，以防止其从高处坠落时破裂。然而，这项发表在《Communications Physics》上的麻省理工学院研究发现，水平放置鸡蛋，即侧放，显著降低了破裂的可能性。\n\n塔尔·科恩教授的团队进行了实验，分别以垂直和水平方向从不同高度坠落鸡蛋。结果表明，垂直坠落的鸡蛋比水平坠落的鸡蛋更容易破裂。虽然垂直压缩测试表明鸡蛋沿长轴方向更坚硬，可以分散载荷，但在动态冲击情况下（如坠落），这种硬度反而成为劣势。\n\n关键在于区分刚度（抵抗变形的能力）和韧性（开裂前吸收能量的能力）。该研究表明，鸡蛋在沿赤道水平加载时韧性更强。这是因为，为了在坠落中幸存，物体需要通过可逆形变来吸收动能。因此，水平放置允许在破裂前吸收更多的能量。作者建议，在鸡蛋坠落实验中，关注韧性而非刚度至关重要，这类似于跳跃落地时弯曲膝盖。研究结果还强调了不恰当的问题框架会导致误解和错误教育。"
  },
  {
    "id": "44096823",
    "title": "Grass Rendering Series",
    "url": "https://hexaquo.at/pages/grass-rendering-series-part-1-theory/",
    "summary": "This article, the first in a series on grass rendering, focuses on understanding the visual properties of grass and different methods for depicting it in 3D graphics. The article emphasizes that realistic grass rendering needs to account for the following aspects: shininess (specular highlights), translucency, patchiness (variations in height and color), and self-shadowing.\n\nThe article then explores various techniques used to depict grass in games. Older games commonly texture grass directly onto the terrain, which works for short grass but not taller varieties. A more advanced approach is using billboards, which are planes with images of grass stalks, offering a balance between detail and performance. However, close-up views can reveal their flatness, and wind animation is limited.\n\nThe article highlights the growing trend of using full geometry for individual grass blades, especially in games aiming for realism or a specific aesthetic. While historically limited by hardware, modern GPUs can handle the increased vertex count. Games like \"Ghost of Tsushima\" are cited as examples of leveraging full-geometry grass to create immersive environments.\n\nThe next article in the series will delve into creating full-geometry grass in Godot, covering efficient methods for populating fields with grass stalks and shading techniques to achieve the desired visual properties.\n",
    "chinese_title": "草地渲染系列",
    "chinese_summary": "本文是关于草地渲染系列文章的第一篇，重点在于理解草地的视觉特性以及在3D图形中描绘草地的不同方法。文章强调，逼真的草地渲染需要考虑以下几个方面：光泽（镜面高光）、半透明性、斑驳性（高度和颜色变化）以及自阴影。\n\n文章随后探讨了游戏中常用的草地描绘技术。较早的游戏通常将草地的纹理直接贴在地形上，这种方法适用于短草，但不适用于较高的品种。一种更高级的方法是使用公告板，即带有草茎图像的平面，可以在细节和性能之间取得平衡。然而，近距离观察可能会暴露出它们的平面感，并且风的动画效果有限。\n\n文章强调了使用完整几何体来渲染单个草叶的日益增长的趋势，特别是在追求真实感或特定美学的游戏中。虽然历史上受硬件限制，但现代GPU可以处理增加的顶点数量。《对马岛之魂》等游戏被引为例证，说明如何利用完整几何体草地来创造沉浸式环境。\n\n本系列的下一篇文章将深入探讨如何在Godot中创建完整几何体草地，涵盖用草茎填充草地的高效方法以及实现所需视觉属性的着色技术。"
  },
  {
    "id": "44122582",
    "title": "Run a C# file directly using dotnet run app.cs",
    "url": "https://devblogs.microsoft.com/dotnet/announcing-dotnet-run-app/",
    "summary": "This article introduces a new feature in .NET 10 Preview 4: the ability to directly run C# files using `dotnet run app.cs` without needing a project file (.csproj). This simplifies C# development for beginners and streamlines scripting, prototyping, and experimentation.\n\nKey features of this \"file-based apps\" approach include:\n\n*   **Ease of Use:** Lowers the barrier to entry, making C# more accessible for learning and quick scripting.\n*   **CLI Integration:** Uses the standard `dotnet` CLI, requiring no extra tools or dependencies.\n*   **Scalability:** Code can easily be transitioned to a full-fledged project when needed.\n*   **File-Level Directives:** Introduces directives like `#:package`, `#:sdk`, and `#:property` to specify NuGet packages, SDKs, and MSBuild properties directly within the `.cs` file.\n*   **Shebang Support:** Enables cross-platform C# shell scripts using shebang lines (`#!/usr/bin/dotnet run`).\n*   **Conversion to Project:** Allows easy conversion to a standard project using `dotnet project convert app.cs`.\n\nThe article highlights that this isn't a separate C# dialect, but a natural entry point into regular C# development. It acknowledges existing scripting solutions but emphasizes the built-in nature of this new feature for immediate use. It also provides instructions on how to install .NET 10 Preview 4, configure VS Code for file-based app support, and convert to a project. Future improvements include better VS Code integration and command-line support for multi-file scenarios.\n",
    "chinese_title": "使用dotnet run app.cs直接运行C#文件",
    "chinese_summary": "本文介绍了 .NET 10 Preview 4 中的一项新功能：可以直接使用 `dotnet run app.cs` 运行 C# 文件，而无需项目文件 (.csproj)。这简化了初学者的 C# 开发，并精简了脚本编写、原型设计和实验过程。\n\n这种“基于文件的应用程序”方法的主要特性包括：\n\n*   **易用性：**降低了入门门槛，使 C# 更容易学习和进行快速脚本编写。\n*   **CLI 集成：**使用标准的 `dotnet` CLI，无需额外的工具或依赖项。\n*   **可扩展性：**代码可以在需要时轻松过渡到完整的项目。\n*   **文件级指令：**引入了诸如 `#:package`、`#:sdk` 和 `#:property` 等指令，可以直接在 `.cs` 文件中指定 NuGet 包、SDK 和 MSBuild 属性。\n*   **Shebang 支持：**使用 Shebang 行 (`#!/usr/bin/dotnet run`) 启用跨平台 C# shell 脚本。\n*   **转换为项目：**可以使用 `dotnet project convert app.cs` 轻松转换为标准项目。\n\n本文强调这并非一种单独的 C# 方言，而是进入常规 C# 开发的自然入口点。它承认现有的脚本解决方案，但强调了此新功能的内置特性，以便立即使用。它还提供了关于如何安装 .NET 10 Preview 4、配置 VS Code 以支持基于文件的应用程序以及如何转换为项目的说明。未来的改进包括更好的 VS Code 集成和对多文件场景的命令行支持。"
  },
  {
    "id": "44121177",
    "title": "HTAP is Dead",
    "url": "https://www.mooncake.dev/blog/htap-is-dead",
    "summary": "This blog post argues that HTAP (Hybrid Transactional/Analytical Processing) as a dedicated database architecture is dead, though the underlying need it addressed remains. It traces the history of database design from the '70s where a single database handled both OLTP (transactional) and OLAP (analytical) workloads, to the '80s where the \"Great Divide\" emerged due to the conflicting demands of these workloads. This led to specialized OLTP and OLAP systems with different storage architectures (row-based vs. columnar).\n\nThe 2010s saw a potential reconciliation with the rise of NewSQL and Cloud Data Warehouses, leading to the formalization of HTAP in 2014 as a single database combining both types of processing. However, the author argues that Cloud Data Warehouses ultimately won out, while NewSQL stalled and HTAP never achieved product-market fit.\n\nSeveral factors contributed to this, including the difficulty of replacing existing OLTP systems, the fact that most workloads don't require distributed OLTP, cloud architectures favoring shared-disk over shared-nothing, and the separation of ownership between OLTP and OLAP.\n\nThe author proposes that HTAP has evolved into a disaggregated data stack, composed of best-in-class components: OLTP systems, open table formats, query engines, and real-time systems. While the concept of a single HTAP database has faded, the challenge of fast OLAP queries on fresh transactional data persists, now addressed through real-time data pipelines, cloud data lakes, and specialized indexing systems. The author sees the future of HTAP in making the lakehouse real-time ready by focusing on efficient data capture from OLTP systems and building lower-cost, synchronized indexes on data lakes.\n",
    "chinese_title": "HTAP已死",
    "chinese_summary": "此博文认为，作为一种专用数据库架构的 HTAP（混合事务/分析处理）已死，但其解决的根本需求依然存在。文章追溯了数据库设计的历史，从 70 年代单个数据库处理 OLTP（事务性）和 OLAP（分析性）工作负载，到 80 年代由于这些工作负载的冲突需求而出现的“大鸿沟”。 这导致了具有不同存储架构（基于行与基于列）的专用 OLTP 和 OLAP 系统。\n\n2010 年代见证了 NewSQL 和云数据仓库的兴起，使得潜在的和解成为可能，并在 2014 年正式确定了 HTAP 作为结合这两种处理类型的单个数据库。 然而，作者认为云数据仓库最终胜出，而 NewSQL 停滞不前，HTAP 从未实现产品市场契合度。\n\n造成这种情况的几个因素包括：替换现有 OLTP 系统的难度、大多数工作负载不需要分布式 OLTP 的事实、云架构偏爱共享磁盘而非共享存储、以及 OLTP 和 OLAP 之间的所有权分离。\n\n作者提出，HTAP 已经演变为一种分离的数据栈，由一流的组件组成：OLTP 系统、开放表格式、查询引擎和实时系统。 尽管单个 HTAP 数据库的概念已经消退，但对新鲜事务数据的快速 OLAP 查询的挑战仍然存在，现在通过实时数据管道、云数据湖和专用索引系统来解决。 作者认为，HTAP 的未来在于通过专注于从 OLTP 系统高效捕获数据以及在数据湖上构建低成本、同步的索引来使湖仓一体架构实现实时就绪。"
  },
  {
    "id": "44120507",
    "title": "Long live American Science and Surplus",
    "url": "https://milwaukeerecord.com/city-life/long-live-american-science-surplus-which-needs-your-help/",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "美国科学与剩余物资万岁",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "44106285",
    "title": "Chimps strike stones against trees as communication, study suggests",
    "url": "https://phys.org/news/2025-05-year-chimpanzees-stones-trees-communication.html",
    "summary": "A five-year study by Wageningen University & Research and the German Primate Research Center revealed that wild chimpanzees in West Africa use stones to communicate by striking them against trees. Researchers observed adult male chimpanzees repeatedly striking stones against tree trunks, creating piles of stones at the base. This behavior, dubbed \"stone-assisted drumming\" by lead author Sem van Loon, appears related to traditional drumming on buttress roots, used for long-distance communication and dominance displays.\n\nUnlike traditional drumming, the stone-striking behavior is often preceded by loud pant-hoots and followed by silence, suggesting a different motivation. Researchers believe the loud, low-frequency sounds produced by stones hitting trees may carry further in dense forests than typical communication.\n\nThe study, published in *Biology Letters*, also indicates that the behavior is culturally transmitted, with young chimpanzees learning it from older group members rather than inheriting it genetically. Professor Marc Naguib emphasizes the significance, stating that it demonstrates culture is not unique to humans and should be considered in nature conservation efforts. The research used camera traps and local field guides to collect video footage across five locations in a Guinea-Bissau nature reserve.\n",
    "chinese_title": "研究表明，黑猩猩敲击树干发出声音进行交流",
    "chinese_summary": "瓦赫宁根大学和德国灵长类动物研究中心一项为期五年的研究表明，西非的野生黑猩猩使用石头撞击树木进行交流。研究人员观察到成年雄性黑猩猩反复用石头撞击树干，并在树根处堆积石堆。首席作者Sem van Loon将这种行为称为“石器辅助鼓声”，它似乎与在支撑根上进行的传统鼓声有关，后者用于远程通信和展示统治地位。\n\n与传统鼓声不同，石击行为通常以大声喘气声开始，然后是寂静，这表明其动机不同。研究人员认为，石头撞击树木产生的大声、低频声音可能比典型的交流方式在茂密的森林中传播得更远。\n\n这项发表在《生物学快报》上的研究还表明，这种行为是文化传播的，幼年黑猩猩是从年长的群体成员那里学习的，而不是通过遗传获得的。Marc Naguib教授强调了其重要性，指出这表明文化并非人类独有，应在自然保护工作中加以考虑。该研究利用相机陷阱和当地野外指南，在几内亚比绍自然保护区的五个地点收集了视频素材。"
  },
  {
    "id": "44116906",
    "title": "Curie: A Research Experimentation Agent",
    "url": "https://github.com/Just-Curieous/Curie",
    "summary": "Curie is an AI-agent framework designed to automate and enhance scientific experimentation, aiming to accelerate research by handling every step from hypothesis to result interpretation. It focuses on precision, reliability, and reproducibility.\n\nKey features include automated experimentation (hypothesis, implementation, execution, analysis, reflection), rigor enhancement through verification modules, and broad applicability across ML research, system analysis, and scientific discovery.\n\nTo install Curie, users need Docker, permission to access the Docker daemon, and to clone the Curie repository from GitHub. They then need to provide their LLM API credentials in the `env.sh` file, build the Docker image, and install the Curie package.\n\nThe quick start examples demonstrate how to use Curie with a specific question and a dataset and codebase. The output includes an auto-generated experiment report, reproducible code and logs saved in a designated workspace. The document also guides users on how to integrate Curie with their own starter files and provides links to examples and use cases.\n\nFor support, users can raise issues on the GitHub Issues page or schedule a meeting with the Curie team.\n",
    "chinese_title": "居里：研究实验代理",
    "chinese_summary": "Curie：自动化并增强科学实验的AI智能体框架，旨在通过处理从假设到结果解读的每一步骤来加速研究。它专注于精确性、可靠性和可重复性。\n\n主要特性包括自动化实验（假设、实现、执行、分析、反思）、通过验证模块增强严谨性，以及在机器学习研究、系统分析和科学发现中的广泛适用性。\n\n要安装Curie，用户需要Docker、访问Docker守护程序的权限，以及从GitHub克隆Curie仓库。然后，他们需要在`env.sh`文件中提供其LLM API凭据，构建Docker镜像，并安装Curie包。\n\n快速入门示例演示了如何将Curie用于特定问题以及数据集和代码库。输出包括自动生成的实验报告，可重现的代码和保存在指定工作区中的日志。该文档还指导用户如何将Curie与他们自己的入门文件集成，并提供示例和用例的链接。\n\n如需支持，用户可以在GitHub Issues页面上提出问题或与Curie团队安排会议。"
  },
  {
    "id": "44102906",
    "title": "How did geometry create modern physics?",
    "url": "https://www.quantamagazine.org/how-did-geometry-create-modern-physics-20250515/",
    "summary": "This article, based on an episode of \"The Joy of Why\" podcast, explores the profound influence of geometry on modern physics. Janna Levin and Steven Strogatz interview Yang-Hui He, a theoretical physicist, who argues that geometry serves as a unifying language for modern physics.\n\nThe conversation traces geometry's evolution from its practical origins in ancient civilizations, such as land surveying in Mesopotamia and Egypt, to its rigorous formulation by Euclid in ancient Greece. Euclid's emphasis on axioms and proof transformed geometry into a cornerstone of mathematical thought.\n\nThe discussion highlights the crucial shift from Euclidean to non-Euclidean geometry, particularly in the context of Einstein's theory of general relativity. Einstein's insight was the realization that curved space-time, described by differential geometry (developed by mathematicians like Riemann, Lobachevsky, and Bolyai), was essential for a consistent theory of gravity.\n\nHe emphasizes that while he initially dismissed elementary geometry, he later recognized its profound beauty and importance.\n\nThe article also touches upon the historical figures who shaped physics and mathematics, with anecdotes about Einstein, Gödel, and von Neumann.\n",
    "chinese_title": "几何学如何创造了现代物理学？",
    "chinese_summary": "本文基于 \"The Joy of Why\" 播客的一集，探讨了几何学对现代物理学的深远影响。Janna Levin 和 Steven Strogatz 采访了理论物理学家何洋辉，他认为几何学是现代物理学的统一语言。\n\n对话追溯了几何学的演变历程，从其在古代文明中的实际起源，如美索不达米亚和埃及的土地测量，到古希腊欧几里得对其的严格公式化。欧几里得对公理和证明的强调将几何学转变为数学思想的基石。\n\n讨论重点强调了从欧几里得几何到非欧几里得几何的关键转变，尤其是在爱因斯坦广义相对论的背景下。爱因斯坦的洞见在于，弯曲的时空，由微分几何（由黎曼、罗巴切夫斯基和波约等数学家发展而来）描述，对于一个一致的引力理论至关重要。\n\n他强调，虽然他最初对初等几何不屑一顾，但他后来认识到它深刻的美丽和重要性。\n\n文章还涉及塑造物理学和数学的历史人物，并穿插了关于爱因斯坦、哥德尔和冯·诺伊曼的轶事。"
  },
  {
    "id": "44094109",
    "title": "A thought on JavaScript \"proof of work\" anti-scraper systems",
    "url": "https://utcc.utoronto.ca/~cks/space/blog/web/JavaScriptScraperObstacles",
    "summary": "Chris Siebenmann's blog, Wandering Thoughts, is experiencing a surge in high-volume crawling, likely for LLM training data gathering. To combat this, he's implemented anti-crawler measures that block browsers with suspiciously old user agents, particularly Chrome versions, as these are commonly used by malicious crawlers.\n\nIf a legitimate user encounters this block, Siebenmann asks them to contact him with their browser information and User-Agent string so he can refine his filtering.\n\nHe specifically addresses users accessing the blog through archive services like archive.today, archive.ph, and archive.is. He points out that these services are difficult to distinguish from malicious crawlers due to their use of old Chrome User-Agent values, distributed IP addresses with potentially falsified reverse DNS entries mimicking Googlebot. He recommends using archive.org instead, as it's a better-behaved archival crawler capable of accessing his blog.\n\nEssentially, Siebenmann is taking a proactive approach to managing crawler traffic to protect his blog's performance and asks for user feedback to improve the accuracy of his anti-crawler measures. He explicitly mentions the issues with some archival services due to their crawling practices.\n",
    "chinese_title": "关于 JavaScript “工作量证明” 反爬虫系统的思考",
    "chinese_summary": "Chris Siebenmann的博客 Wandering Thoughts 正经历大量爬虫访问，可能用于收集LLM训练数据。 为此，他实施了反爬虫措施，阻止具有可疑旧版用户代理的浏览器，尤其是 Chrome 版本，因为这些通常被恶意爬虫使用。\n\n如果合法用户遇到此屏蔽，Siebenmann 希望他们联系他，提供浏览器信息和 User-Agent 字符串，以便他改进过滤。\n\n他特别提到通过 archive.today、archive.ph 和 archive.is 等存档服务访问博客的用户。他指出，由于这些服务使用旧版 Chrome User-Agent 值，以及具有可能伪造反向 DNS 条目的分布式 IP 地址（模仿 Googlebot），因此很难将它们与恶意爬虫区分开来。 他建议使用 archive.org，因为它是一个行为更好的存档爬虫，能够访问他的博客。\n\n本质上，Siebenmann 正在采取积极主动的方法来管理爬虫流量，以保护他博客的性能，并要求用户反馈以提高其反爬虫措施的准确性。他明确提到了某些存档服务由于其爬行方式而导致的问题。"
  },
  {
    "id": "44101175",
    "title": "Show HN: Porting Terraria and Celeste to WebAssembly",
    "url": "https://velzie.rip/blog/celeste-wasm",
    "summary": "This \"Show HN\" post details the porting of the C# games Terraria and Celeste to WebAssembly, allowing them to run in a web browser. The author recounts a year-long journey of reverse engineering, bug fixing, and toolchain adjustments to overcome the challenges of running .NET games in a WASM environment.\n\nThe process began with decompiling the games' C# code, targeting WASM as the compilation target, and leveraging FNA, a reimplementation of the XNA framework.  Terraria required extracting embedded DLLs and configuring the build environment using emscripten. A significant hurdle was the FNA engine's reliance on native C++ components, which were addressed using a custom build system (FNA-WASM-BUILD).\n\nTo make the games actually *run*, the authors had to create a minimal entry point and game loop using JavaScript, enabling asset loading through the Origin Private File System (despite browser compatibility issues).  The project faced threading issues in .NET 8.0, which were resolved by upgrading to .NET 9.0 and enabling WASM threads.  This led to the creation of an OpenGL proxy due to worker/DOM thread conflicts, automating the process with a fish script.  Terraria faced AES encryption support limitations that were overcome by linking OpenSSL through emscripten.\n\nCeleste was ported using similar techniques, facing challenges with the proprietary FMOD audio library, requiring workarounds to integrate the library's object files and custom-generated C code. The ultimate goal of getting the Everest mod loader to run required solving issues with MonoMod.RuntimeDetour, used by Everest to apply runtime modifications to code, which they hadn't yet accomplished.\n\nThe post concludes with links to playable versions of Terraria and Celeste in the browser, along with their respective Git repositories.\n",
    "chinese_title": "Show HN: 将泰拉瑞亚和蔚蓝移植到 WebAssembly",
    "chinese_summary": "该“Show HN”帖子详细介绍了将C#游戏泰拉瑞亚和蔚蓝移植到WebAssembly的过程，使其能够在Web浏览器中运行。作者讲述了为期一年的逆向工程、修复漏洞和调整工具链的旅程，以克服在WASM环境中运行.NET游戏的挑战。\n\n该过程始于反编译游戏的C#代码，将WASM作为编译目标，并利用FNA（XNA框架的重新实现）。泰拉瑞亚需要提取嵌入的DLL，并使用emscripten配置构建环境。一个重要的障碍是FNA引擎对原生C++组件的依赖，这通过一个自定义构建系统(FNA-WASM-BUILD)得以解决。\n\n为了使游戏真正*运行*，作者必须使用JavaScript创建一个最小的入口点和游戏循环，从而通过Origin Private File System启用资源加载（尽管存在浏览器兼容性问题）。该项目遇到了.NET 8.0中的线程问题，通过升级到.NET 9.0并启用WASM线程得以解决。这导致创建了一个OpenGL代理，以解决worker/DOM线程冲突，并使用fish脚本自动化了该过程。泰拉瑞亚面临AES加密支持的限制，通过emscripten链接OpenSSL克服了该问题。\n\n蔚蓝的移植使用了类似的技术，面临着专有FMOD音频库的挑战，需要通过变通方法来集成该库的目标文件和自定义生成的C代码。使Everest mod加载器运行的最终目标需要解决Everest用于对代码应用运行时修改的MonoMod.RuntimeDetour的问题，他们尚未完成此项工作。\n\n帖子最后提供了泰拉瑞亚和蔚蓝在浏览器中可玩版本的链接，以及它们各自的Git存储库。"
  },
  {
    "id": "44126725",
    "title": "Web Bench: a new way to compare AI browser agents",
    "url": "https://blog.skyvern.com/web-bench-a-new-way-to-compare-ai-browser-agents/",
    "summary": "Web Bench is a new benchmark dataset designed to evaluate the performance of AI web browsing agents. Created in partnership with Halluminate, it addresses limitations of existing benchmarks like WebVoyager by significantly expanding the scope to 5,750 tasks across 452 diverse websites. A key distinction is the categorization of tasks into READ (data extraction) and WRITE (form filling, login, file download) activities.\n\nThe initial findings highlight that agents struggle significantly with WRITE-heavy tasks, indicating a major area for improvement. While Anthropic's CUA demonstrates strong performance in READ tasks, Skyvern 2.0 leads in WRITE tasks. Overall, the results indicate that current agents often fail due to incomplete execution, inability to interact with the correct elements, and general navigation issues. Infrastructure failures related to proxy issues, CAPTCHA challenges, and authentication problems also play a substantial role.\n\nThe benchmark also explores other characteristics like runtime duration and the number of steps required, highlighting the importance of fast and cost-effective agents.  Future plans include expanding the benchmark to include more websites, languages, website categories, and evaluating additional AI models and APIs. The dataset creation and evaluation methodology are detailed in a Halluminate team write-up, and an open-source evaluation harness is planned for future release.\n",
    "chinese_title": "Web Bench：一种比较AI浏览器代理的新方法",
    "chinese_summary": "Web Bench是一个新的基准数据集，旨在评估AI网页浏览代理的性能。它与Halluminate合作创建，通过将范围显著扩展到跨452个不同网站的5,750个任务，解决了WebVoyager等现有基准的局限性。一个关键的区别是将任务分为READ（数据提取）和WRITE（表格填写、登录、文件下载）活动。\n\n初步研究结果表明，代理在WRITE繁重的任务中表现不佳，这表明这是一个主要的改进领域。虽然Anthropic的CUA在READ任务中表现出色，但Skyvern 2.0在WRITE任务中领先。总体而言，结果表明，当前的代理经常因执行不完整、无法与正确的元素交互以及一般的导航问题而失败。与代理问题、验证码挑战和身份验证问题相关的基础设施故障也发挥了重要作用。\n\n该基准还探索了其他特性，如运行时长和所需步骤数，突出了快速且具有成本效益的代理的重要性。未来的计划包括扩展基准，以包括更多的网站、语言、网站类别，并评估更多的AI模型和API。数据集创建和评估方法在Halluminate团队的报告中详细说明，并计划在未来发布开源评估工具。"
  },
  {
    "id": "44106299",
    "title": "Bertrand Piccard's Big Hydrogen Adventure – hydrogen fuel-cell aircraft",
    "url": "https://spectrum.ieee.org/hydrogen-fuel-cell-aircraft",
    "summary": "Bertrand Piccard, from a family of renowned explorers, is embarking on a global journey to showcase the viability of hydrogen as an aviation fuel. He plans to circumnavigate the world in a hydrogen fuel-cell aircraft. The article highlights this ambitious project and Piccard's motivation to demonstrate hydrogen's potential in the aviation industry.\n",
    "chinese_title": "贝特朗·皮卡尔的氢能大冒险——氢燃料电池飞机",
    "chinese_summary": "伯特兰·皮卡尔，出身于著名的探险世家，正踏上环球之旅，以展示氢作为航空燃料的可行性。他计划驾驶氢燃料电池飞机环绕世界。本文重点介绍了这项雄心勃勃的计划以及皮卡尔展示氢在航空业潜力的动力。"
  }
]