[
  {
    "id": "45761445",
    "title": "Affinity Studio now free",
    "url": "https://www.affinity.studio/get-affinity",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "Affinity Studio 现已免费",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "45762012",
    "title": "Launch HN: Propolis (YC X25) – Browser agents that QA your web app autonomously",
    "url": "https://app.propolis.tech/#/launch",
    "summary": "Propolis, an YC X25 graduate, is launching a browser agent designed to autonomously QA web applications. The tool aims to automate the quality assurance process, reducing the manual effort involved in testing and improving the reliability of web apps. While the exact functionality isn't explicitly detailed in the provided title and introductory text, it's implied that Propolis utilizes browser agents to navigate and interact with web applications, likely executing pre-defined test cases or exploring the application's functionality to identify bugs and potential issues. In essence, Propolis seeks to provide an automated solution for web app QA, saving developers time and resources while ensuring higher quality software.\n",
    "chinese_title": "发布HN：Propolis (YC X25) – 自动测试你的网络应用的浏览器代理",
    "chinese_summary": "蜂胶 (YC X25 毕业生) 正在推出一款浏览器代理，旨在自主地对 Web 应用程序进行质量保证 (QA)。该工具旨在自动化质量保证流程，减少测试中涉及的人工工作量，并提高 Web 应用程序的可靠性。 虽然提供的标题和介绍性文本并未明确详细说明具体功能，但暗示蜂胶利用浏览器代理来导航和与 Web 应用程序交互，可能执行预定义的测试用例或探索应用程序的功能，以识别错误和潜在问题。 本质上，蜂胶致力于为 Web 应用程序 QA 提供自动化解决方案，从而节省开发人员的时间和资源，同时确保更高质量的软件。"
  },
  {
    "id": "45712620",
    "title": "987654321 / 123456789",
    "url": "https://www.johndcook.com/blog/2025/10/26/987654321/",
    "summary": "This article explores the relationship between two numbers formed in any base *b*: `num(b)`, which is the concatenation of digits in descending order, and `denom(b)`, which is the concatenation of digits in ascending order. The author notes the initial observation that 987654321 / 123456789 is very close to 8.\n\nThe main finding is that for any base *b* > 2, the ratio `num(b) / denom(b)` is very close to the integer *b* - 2. Specifically, the ratio is equal to (b-2) + (b-1)/denom(b).  This is demonstrated with Python code that verifies this for bases from 3 to 1000. The author explains that in bases like 16, the fractional part is so small it might be lost due to floating-point precision limitations, resulting in an integer result.\n\nThe author justifies including a Python script instead of a formal proof by arguing that while the proof is straightforward, it's tedious. More importantly, they suggest that computational demonstrations serve as a valuable complement to mathematical proofs, offering a different form of validation and potentially revealing details that might be overlooked in a traditional proof.  The author concludes that programs and proofs, while both susceptible to errors, are unlikely to share the same bugs.\n",
    "chinese_title": "987654321 / 123456789",
    "chinese_summary": "本文探讨了在任意进制*b*下形成的两个数之间的关系：`num(b)`是将数字按降序连接而成，而`denom(b)`是将数字按升序连接而成。作者注意到最初的观察结果，即987654321 / 123456789非常接近于8。\n\n主要发现是，对于任何大于2的进制*b*，比率`num(b) / denom(b)`非常接近于整数*b* - 2。具体而言，该比率等于 (b-2) + (b-1)/denom(b)。作者通过Python代码进行了演示，验证了从3到1000的进制的这一结论。作者解释说，在像16进制这样的进制中，小数部分非常小，可能会因浮点精度限制而丢失，从而导致整数结果。\n\n作者认为，虽然证明很简单，但很繁琐，因此选择包含Python脚本而不是正式的证明。更重要的是，他们认为计算演示可以作为数学证明的有价值的补充，提供另一种形式的验证，并可能揭示在传统证明中可能被忽视的细节。作者总结说，程序和证明虽然都容易出错，但不太可能共享相同的错误。"
  },
  {
    "id": "45761042",
    "title": "ZOZO's Contact Solver for physics-based simulations",
    "url": "https://github.com/st-tech/ppf-contact-solver",
    "summary": "ZOZO's Contact Solver is a robust and scalable tool for physics-based simulations of shells, solids, and rods, emphasizing accuracy and performance. Highlights include penetration-free contact resolutions, scalability to over 150 million contacts, GPU-based single-precision processing for cache efficiency, strict strain limits, Finite Element Method-driven accuracy, and massive parallelism.\n\nThe solver is Docker-sealed for out-of-the-box use, includes a JupyterLab interface for interactive examples, and provides documented Python APIs. It's cloud-ready, easily deployable on major platforms like AWS, vast.ai, and RunPod, and leaves no traces after use.\n\nKey features include dynamic mesh creation, minimal mesh data preparation, method chaining for intuitive APIs, and a single import for all frontend features. The documentation is comprehensive with API details, parameters, and logging capabilities accessible via GitHub Pages and interactive linting assistance. Example simulations cover various scenarios (weaving, stacking, etc.), with budget estimates provided for AWS usage. GitHub Actions run stress tests to ensure reliability, with explicit intersection checks. Large-scale examples are under development.\n",
    "chinese_title": "ZOZO的物理模拟接触求解器",
    "chinese_summary": "ZOZO接触求解器是一款强大且可扩展的工具，用于基于物理的壳、固体和杆的仿真，强调精度和性能。其亮点包括无穿透接触求解、可扩展至超过1.5亿个接触、基于GPU的单精度处理以提高缓存效率、严格的应变限制、有限元方法驱动的精度和大规模并行性。\n\n该求解器已Docker密封，可直接使用，包含用于交互式示例的JupyterLab界面，并提供文档完善的Python API。它已为云准备就绪，可轻松部署在AWS、vast.ai和RunPod等主要平台上，并且在使用后不留痕迹。\n\n主要功能包括动态网格创建、最少的网格数据准备、用于直观API的方法链以及用于所有前端功能的单一导入。文档全面，API详细信息、参数和日志记录功能可通过GitHub Pages访问，并提供交互式linting辅助。示例仿真涵盖各种场景（编织、堆叠等），并提供AWS使用预算估算。GitHub Actions运行压力测试以确保可靠性，并进行显式相交检查。大型示例正在开发中。"
  },
  {
    "id": "45760321",
    "title": "Show HN: I made a heatmap diff viewer for code reviews",
    "url": "https://0github.com",
    "summary": "This \"Show HN\" post introduces a heatmap diff viewer for code reviews, designed to highlight code changes that warrant extra attention. The viewer uses heatmaps to visually represent the complexity and potential issues within code diffs, going beyond basic bug detection to identify areas requiring a \"second look.\"\n\nThe key idea is to flag code not only for potential errors but also for complexity, unusual patterns, or potential security vulnerabilities. The system is implemented by replacing \"github.com\" with \"0github.com\" in any GitHub pull request URL.\n\nUnder the hood, the tool clones the repository, uses GPT-5 Codex to analyze each diff, and generates a JSON data structure that is then translated into a colored heatmap. The author provides example pull requests for testing. The heatmap viewer is open source and available on GitHub. In essence, the tool aims to improve code review efficiency by guiding reviewers to the most critical and potentially problematic code changes.\n",
    "chinese_title": "展示一下：我做了一个用于代码审查的热图差异查看器",
    "chinese_summary": "此“Show HN”帖子介绍了一个代码审查热图差异查看器，旨在突出显示需要特别关注的代码更改。该查看器使用热图以可视化方式呈现代码差异中的复杂性和潜在问题，超越了基本的错误检测，从而识别出需要“再看一眼”的区域。\n\n其核心思想不仅是标记潜在错误，还要标记代码的复杂性、不寻常的模式或潜在的安全漏洞。该系统的实现方法是在任何GitHub拉取请求URL中将“github.com”替换为“0github.com”。\n\n在底层，该工具会克隆存储库，使用GPT-5 Codex分析每个差异，并生成一个JSON数据结构，然后将其转换为彩色热图。作者提供了示例拉取请求供测试。该热图查看器是开源的，可在GitHub上找到。本质上，该工具旨在通过引导审查者关注最关键和可能存在问题的代码更改来提高代码审查效率。"
  },
  {
    "id": "45762259",
    "title": "The ear does not do a Fourier transform",
    "url": "https://www.dissonances.blog/p/the-ear-does-not-do-a-fourier-transform",
    "summary": "This article explains how the cochlea, the part of the inner ear responsible for hearing, processes sound. It clarifies that the cochlea **does not perform a Fourier transform**, a common method of analyzing signals that prioritizes precise frequency decomposition at the expense of temporal precision.\n\nInstead, the cochlea uses the basilar membrane to separate frequencies, with different locations resonating with different frequencies in a tonotopic organization. Hair cells on the basilar membrane translate these vibrations into electrical signals. The filters created by this process are somewhere between wavelets and Gabor functions. This means the cochlea trades off frequency and temporal resolution, offering high temporal resolution for high frequencies and high frequency resolution for low frequencies.\n\nThe article argues that this particular filtering scheme is an efficient way to represent natural sounds, reducing redundancy. Research suggests that the specific time-frequency tradeoff varies depending on the type of sound (environmental, animal vocalizations, or human speech). Human speech seems to occupy a unique time-frequency space. The article emphasizes the importance of ecologically-relevant representations, suggesting that sensory systems like audition are optimized to process information from the environment in a way that is relevant for behavior. The article concludes by hinting at efficient coding and the biophysics of computation in neurons, to be covered in the next lecture.\n",
    "chinese_title": "耳朵不做傅里叶变换",
    "chinese_summary": "本文解释了耳蜗（内耳中负责听觉的部分）如何处理声音。它阐明耳蜗**不执行傅里叶变换**——一种常见的信号分析方法，该方法优先考虑精确的频率分解，但牺牲了时间精度。\n\n相反，耳蜗利用基底膜分离频率，不同的位置与不同的频率共振，形成一种音位分布。基底膜上的毛细胞将这些振动转化为电信号。此过程创建的滤波器介于小波和Gabor函数之间。这意味着耳蜗在频率和时间分辨率之间进行权衡，为高频提供高时间分辨率，为低频提供高频率分辨率。\n\n本文认为，这种特殊的滤波方案是表示自然声音的一种有效方式，可以减少冗余。研究表明，特定的时频权衡取决于声音的类型（环境声音、动物发声或人类语音）。人类语音似乎占据了独特的时频空间。本文强调了与生态相关的表征的重要性，表明听觉等感觉系统经过优化，以对环境中与行为相关的信息进行处理。文章最后暗示了高效编码和神经元计算的生物物理学，这些内容将在下次讲座中介绍。"
  },
  {
    "id": "45760328",
    "title": "US declines to join more than 70 countries in signing UN cybercrime treaty",
    "url": "https://therecord.media/us-declines-signing-cybercrime-treaty?",
    "summary": "More than 70 countries, including the UK, EU, China, and Russia, signed the UN Convention against Cybercrime in Hanoi, aiming to establish a global framework for combating digital crime. The treaty focuses on international cooperation, capacity building, and tracking cybercriminals, addressing issues like illicit financial flows, ransomware attacks, and the use of the internet for terrorism, human trafficking, and money laundering. The UN estimates cybercrime costs $10.5 trillion annually and believes the treaty will aid governments, particularly in the Global South, in fighting it.\n\nNotably, the US did not sign the treaty, stating that it \"continues to review\" it.\n\nThe convention introduces the first global framework for electronic evidence collection and sharing and criminalizes internet-dependent crimes, including non-consensual image sharing. It also establishes a 24/7 international cooperation network.\n\nHowever, the treaty faces criticism from the tech industry and human rights groups. Concerns include potential criminalization of cybersecurity research, overly broad data requests, and the possibility of authoritarian regimes abusing the treaty for surveillance and repression, potentially impacting digital freedoms and enabling \"cyber authoritarianism.\" Despite these concerns, UN Secretary-General Guterres emphasized the need to protect fundamental human rights online and offline and highlighted the treaty's potential to overcome barriers in cross-border digital evidence sharing.\n",
    "chinese_title": "美国拒绝加入70多国签署的联合国网络犯罪条约",
    "chinese_summary": "包括英国、欧盟、中国和俄罗斯在内的70多个国家在河内签署了联合国打击网络犯罪公约，旨在建立打击数字犯罪的全球框架。该条约侧重于国际合作、能力建设和追踪网络罪犯，解决诸如非法资金流动、勒索软件攻击以及利用互联网进行恐怖主义、人口贩运和洗钱等问题。联合国估计网络犯罪每年造成10.5万亿美元的损失，并认为该条约将帮助各国政府，特别是全球南方国家，打击网络犯罪。\n\n值得注意的是，美国没有签署该条约，称其“仍在审查”该条约。\n\n该公约引入了首个电子证据收集和共享的全球框架，并将依赖互联网的犯罪行为定为犯罪，包括未经同意的图像共享。它还建立了一个24/7全天候国际合作网络。\n\n然而，该条约面临着来自科技行业和人权组织的批评。担忧包括可能将网络安全研究定为犯罪、数据请求过于宽泛，以及威权政权可能滥用该条约进行监视和压制，从而可能影响数字自由并助长“网络威权主义”。尽管存在这些担忧，联合国秘书长古特雷斯强调有必要保护线上和线下基本人权，并强调该条约在克服跨境数字证据共享障碍方面的潜力。"
  },
  {
    "id": "45761902",
    "title": "Falling panel prices lead to global solar boom, except for the US",
    "url": "https://arstechnica.com/science/2025/10/theres-a-global-boom-in-solar-except-in-the-united-states/",
    "summary": "Despite falling solar panel prices driving a global renewable energy boom, the US is lagging behind, primarily due to policy shifts under President Trump. China, leading the way in solar production and installation, has significantly reduced renewable hardware costs, making solar power an increasingly attractive option worldwide, even in petrostates.\n\nGlobally, renewable energy is expanding rapidly, with countries like India, Saudi Arabia, and South Africa embracing solar power. Small-scale solar installations are also increasing as individuals and businesses seek reliable power sources. However, challenges remain, including the need for improved energy storage, grid infrastructure, and the transition of consumers and industries away from fossil fuels. While renewable energy generation is successful, transitioning other sectors to electricity is more complicated.\n\nDespite China's impressive growth in renewables, coal still plays a significant role, and market reforms could impact future growth. In the US, the rollback of incentives and blocking of projects are hindering renewable energy development. This slowdown risks the US missing global climate targets and influence in the clean energy sector, potentially leading to higher electricity prices and reliance on fossil fuels.\n",
    "chinese_title": "面板价格下跌推动全球太阳能繁荣，美国除外",
    "chinese_summary": "尽管太阳能电池板价格下跌推动了全球可再生能源的繁荣，但美国却落后了，这主要是由于特朗普总统领导下的政策转变。中国在太阳能生产和安装方面处于领先地位，大幅降低了可再生能源硬件的成本，使太阳能发电在全球范围内越来越有吸引力，即使在石油大国也是如此。\n\n在全球范围内，可再生能源正在迅速扩张，印度、沙特阿拉伯和南非等国家也在拥抱太阳能。随着个人和企业寻求可靠的电力来源，小型太阳能装置也在增加。然而，挑战依然存在，包括需要改进的储能、电网基础设施以及消费者和产业从化石燃料的转型。虽然可再生能源发电取得了成功，但将其他行业过渡到电力则更为复杂。\n\n尽管中国在可再生能源方面取得了令人瞩目的增长，但煤炭仍然发挥着重要作用，市场改革可能会影响未来的增长。在美国，激励措施的取消和项目的阻止正在阻碍可再生能源的发展。这种放缓可能会导致美国无法实现全球气候目标并失去在清洁能源领域的影响力，从而可能导致更高的电价和对化石燃料的依赖。"
  },
  {
    "id": "45761789",
    "title": "Qt Creator 18 Released",
    "url": "https://www.qt.io/blog/qt-creator-18-released",
    "summary": "Qt Creator 18 has been released, featuring experimental development container support for automating project environment setup using \"devcontainer.json\" files and Docker containers. The update includes a redesigned Welcome mode with an Overview tab offering personalized tutorials and Qt blog highlights. Notifications have been integrated into progress popups, with an option to revert to banner style. Tabbed editors are now an option, alongside improved code navigation tools.\n\nC++ support is enhanced with Clangd/LLVM updated to version 21.1, plus fixes for new C++ features and quick fixes for brace removal and static data member definition. QML Language Server settings allow usage of the latest server versions regardless of the project's Qt version. GitHub Enterprise environments are now supported for GitHub Copilot.\n\nProject settings files (\".user\") are moved to a \".qtcreator/\" subdirectory, with compatibility for older files. Project mode allows filtering kits and separates Run settings into Deploy Settings and Run Settings. Run configurations can now be synced across kits. CMake projects gain Test Preset support and a \"ct\" Locator filter for CTest.\n\nDevice configuration is improved with auto-detection of tools on remote Linux devices. Auto-reconnect to devices at startup is a new setting. Rsync deployment is fixed for remote builds and targets. The update also includes Git improvements, like staging and unstaging files directly within the commit editor. Qt Creator 18 is available through the Qt Online Installer, Qt Account Portal, and open-source download page.\n",
    "chinese_title": "Qt Creator 18 发布",
    "chinese_summary": "Qt Creator 18 has been released, featuring experimental development container support for automating project environment setup using \"devcontainer.json\" files and Docker containers. The update includes a redesigned Welcome mode with an Overview tab offering personalized tutorials and Qt blog highlights. Notifications have been integrated into progress popups, with an option to revert to banner style. Tabbed editors are now an option, alongside improved code navigation tools.\n\nC++ support is enhanced with Clangd/LLVM updated to version 21.1, plus fixes for new C++ features and quick fixes for brace removal and static data member definition. QML Language Server settings allow usage of the latest server versions regardless of the project's Qt version. GitHub Enterprise environments are now supported for GitHub Copilot.\n\nProject settings files (\".user\") are moved to a \".qtcreator/\" subdirectory, with compatibility for older files. Project mode allows filtering kits and separates Run settings into Deploy Settings and Run Settings. Run configurations can now be synced across kits. CMake projects gain Test Preset support and a \"ct\" Locator filter for CTest.\n\nDevice configuration is improved with auto-detection of tools on remote Linux devices. Auto-reconnect to devices at startup is a new setting. Rsync deployment is fixed for remote builds and targets. The update also includes Git improvements, like staging and unstaging files directly within the commit editor. Qt Creator 18 is available through the Qt Online Installer, Qt Account Portal, and open-source download page.\n"
  },
  {
    "id": "45760878",
    "title": "Free software scares normal people",
    "url": "https://danieldelaney.net/normal/",
    "summary": "This very short article, titled \"Free software scares normal people,\" likely argues that free software, despite its potential benefits, faces adoption challenges due to its complexity or perceived differences from proprietary software. The author probably believes that the term \"free software\" or the concepts associated with it (like open source, licenses, command lines, customization) intimidate average computer users.\n\nThe core point is likely that the *perception* of free software being difficult to use, lacking support, or requiring technical expertise hinders its widespread adoption. The \"normal people\" are likely being used to describe the average user who is used to proprietary software solutions with simple interfaces and readily available commercial support.\n\nThe author may suggest that better marketing, simplified user interfaces, improved support resources, or a rebranding of free software are needed to overcome this \"fear\" and make it more accessible to the general public. The article probably highlights the psychological barrier and focuses on why free software fails to appeal to the average user despite its technical merits.\n",
    "chinese_title": "自由软件吓坏普通人",
    "chinese_summary": "名为《自由软件吓坏普通人》的短文可能认为，自由软件尽管具有潜在优势，但由于其复杂性或与专有软件的差异，面临着普及挑战。作者可能认为，“自由软件”一词或与其相关的概念（如开源、许可证、命令行、自定义）会让普通电脑用户望而却步。\n\n核心观点可能是，自由软件*被认为*难用、缺乏支持或需要技术专长，阻碍了其广泛应用。“普通人”可能指的是习惯于具有简单界面和随时可用的商业支持的专有软件解决方案的普通用户。\n\n作者可能建议，需要更好的营销、简化的用户界面、改进的支持资源或自由软件的品牌重塑，以克服这种“恐惧”，使其更容易被大众接受。 这篇文章可能强调了心理障碍，并着重说明了为什么自由软件尽管具有技术优点，却未能吸引普通用户。"
  },
  {
    "id": "45758421",
    "title": "Show HN: In a single HTML file, an app to encourage my children to invest",
    "url": "https://roberdam.com/en/dinversiones.html",
    "summary": "This \"Show HN\" post describes a simple HTML-based app called D-investments created by the author to teach his children about investing. The author wanted to illustrate the power of compound interest and the concept of money growth over time. He built a PWA (Progressive Web App) that could be installed on an old smartphone and mounted on the fridge as a dashboard.\n\nThe app takes inputs like the child's name, initial investment amount, interest rate, and start date. It then calculates and displays the daily, weekly, and monthly gains, as well as the total updated balance. The author acts as their \"investment agent,\" assigning realistic interest rates to keep them engaged.\n\nThe goal is to provide a visual representation of how investments grow over time, helping them understand the magic of compound interest. The author believes this is a valuable life lesson beyond simply receiving gifts. The app is a single HTML file and can be installed on any smartphone that supports PWAs.\n",
    "chinese_title": "Show HN: 用单个HTML文件编写的应用，鼓励我的孩子投资",
    "chinese_summary": "该“Show HN”帖子介绍了一款名为 D-investments 的简单 HTML 应用，作者创建它是为了教孩子们关于投资的知识。作者想要阐释复利的力量以及金钱随时间增长的概念。他构建了一个 PWA（渐进式 Web 应用），可以安装在旧智能手机上并贴在冰箱上作为仪表板。\n\n该应用接受诸如孩子姓名、初始投资金额、利率和开始日期等输入。然后，它计算并显示每日、每周和每月的收益，以及更新后的总余额。作者充当他们的“投资代理人”，分配实际的利率以保持他们的参与度。\n\n目标是提供投资如何随时间增长的视觉表现，帮助他们理解复利的魔力。作者认为，这不仅仅是接受礼物，而是一个宝贵的人生课程。该应用是一个单独的 HTML 文件，可以安装在任何支持 PWA 的智能手机上。"
  },
  {
    "id": "45702831",
    "title": "Frozen DuckLakes for Multi-User, Serverless Data Access",
    "url": "https://ducklake.select/2025/10/24/frozen-ducklake/",
    "summary": "This article introduces \"Frozen DuckLakes,\" a method for creating read-only, cloud-based data lakes using DuckDB without requiring a dedicated catalog database server. Frozen DuckLakes leverage cloud storage (like AWS S3 or HTTP) for Parquet data files, offering a serverless and cost-effective solution for multi-user data access.\n\nKey advantages include minimal overhead cost beyond storage, suitability for public-facing data, immediate SQL accessibility, and the ability to span multiple cloud environments. While \"frozen\" in time, data updates are achieved by creating new Frozen DuckLake versions. Older versions can be accessed through versioning or time travel features.\n\nThe process involves four steps: collecting a list of Parquet data files, generating SQL creation scripts (for table creation and data population via `ducklake_add_data_files()`), creating a local DuckLake, and publishing the resulting DuckDB file to cloud storage. The `ducklake_add_data_files()` function efficiently ingests data by only reading Parquet metadata.  The article emphasizes that `DATA_PATH` specified during the attach is not copied or used. The article also provided a live demo using a space mission dataset hosted on GitHub. Updating involves regenerating the DuckLake or incrementally adding new files. Versioning considerations are discussed to handle schema upgrades when DuckDB detects a new DuckLake version.\n",
    "chinese_title": "多用户、无服务器数据访问的冷冻鸭湖",
    "chinese_summary": "本文介绍了“Frozen DuckLakes”，这是一种使用 DuckDB 创建只读、基于云的数据湖的方法，无需专用的目录数据库服务器。“Frozen DuckLakes”利用云存储（如 AWS S3 或 HTTP）存储 Parquet 数据文件，为多用户数据访问提供了一种无服务器且经济高效的解决方案。\n\n主要优势包括除存储之外的最低开销成本、适用于面向公众的数据、即时 SQL 可访问性以及跨多个云环境的能力。虽然数据是“冻结”在某个时间点的，但数据更新是通过创建新的 Frozen DuckLake 版本来实现的。可以通过版本控制或时间旅行功能访问旧版本。\n\n该过程包括四个步骤：收集 Parquet 数据文件列表，生成 SQL 创建脚本（用于表创建和通过 `ducklake_add_data_files()` 填充数据），创建本地 DuckLake，以及将生成的 DuckDB 文件发布到云存储。`ducklake_add_data_files()` 函数通过仅读取 Parquet 元数据来高效地摄取数据。本文强调，附加期间指定的 `DATA_PATH` 不会被复制或使用。本文还提供了一个使用托管在 GitHub 上的太空任务数据集的实时演示。更新涉及重新生成 DuckLake 或增量添加新文件。讨论了版本控制注意事项，以便在 DuckDB 检测到新的 DuckLake 版本时处理模式升级。"
  },
  {
    "id": "45748484",
    "title": "Replacing EBS and Rethinking Postgres Storage from First Principles",
    "url": "https://www.tigerdata.com/blog/fluid-storage-forkable-ephemeral-durable-infrastructure-age-of-agents",
    "summary": "This article introduces Fluid Storage, a new distributed block storage architecture designed for the age of agents and modern data workloads. It argues that current \"elastic\" storage solutions like Amazon EBS aren't truly elastic, leading to inefficiencies in cost, scaling, and recovery.\n\nFluid Storage aims to solve these problems by offering:\n\n*   **True Elasticity:** Seamless scaling up and down of volumes based on actual usage, eliminating over-provisioning and wasted resources.\n*   **Fork-First Approach:** Instant, zero-copy forks and snapshots, enabling rapid environment creation for testing and development.\n*   **Usage-Based Pricing:** Customers pay only for the storage they consume.\n*   **High Performance:** Sustained high IOPS and throughput.\n*   **Strong Durability:** Reliable data protection via synchronous replication.\n*   **Compatibility:** Operates at the block layer, making it compatible with Postgres and other databases/filesystems.\n\nThe authors at Tiger Data built Fluid Storage because their experience managing thousands of Postgres instances in Tiger Cloud revealed the limitations of EBS in cost, scale-up/down performance, elasticity, and recovery. They discarded local NVMe (due to durability issues) and Aurora-like page-server architectures (due to PostgreSQL forking and complexity). Instead, they built a distributed block store that addresses these challenges at the storage layer, providing a fluid, scalable, and efficient solution for modern data management and agentic workflows.\n",
    "chinese_title": "从第一性原理重新思考Postgres存储并替换EBS",
    "chinese_summary": "本文介绍了Fluid Storage，一种为代理时代和现代数据工作负载设计的新型分布式块存储架构。文章指出，当前像Amazon EBS这样的“弹性”存储解决方案并非真正弹性，导致成本、扩展和恢复效率低下。\n\nFluid Storage旨在通过提供以下功能来解决这些问题：\n\n*   **真正的弹性：** 基于实际使用情况无缝地向上和向下扩展卷，消除过度配置和资源浪费。\n*   **Fork优先方法：** 即时、零拷贝的Fork和快照，实现快速创建测试和开发环境。\n*   **基于使用量的定价：** 客户仅为他们消耗的存储付费。\n*   **高性能：** 持续的高IOPS和吞吐量。\n*   **强大的持久性：** 通过同步复制实现可靠的数据保护。\n*   **兼容性：** 在块层运行，使其与Postgres和其他数据库/文件系统兼容。\n\nTiger Data的作者构建Fluid Storage是因为他们在Tiger Cloud中管理数千个Postgres实例的经验揭示了EBS在成本、向上/向下扩展性能、弹性和恢复方面的局限性。他们放弃了本地NVMe（由于持久性问题）和类似Aurora的页面服务器架构（由于PostgreSQL fork和复杂性）。相反，他们构建了一个分布式块存储，在存储层解决了这些挑战，为现代数据管理和代理工作流程提供了流畅、可扩展和高效的解决方案。"
  },
  {
    "id": "45760340",
    "title": "Ventoy: Create bootable USB drive for ISO/WIM/IMG/VHD(x)/EFI Files",
    "url": "https://github.com/ventoy/Ventoy",
    "summary": "Ventoy is an open-source tool for creating bootable USB drives from ISO/WIM/IMG/VHD(x)/EFI files. It eliminates the need to repeatedly format the USB drive; users simply copy image files to the drive and Ventoy provides a boot menu to select from. Ventoy supports multiple image files, browsing local drives for bootable files, and both MBR and GPT partition styles. It's compatible with x86 Legacy BIOS, IA32 UEFI, x86_64 UEFI, ARM64 UEFI, and MIPS64EL UEFI.\n\nVentoy supports a wide range of operating systems, including Windows, various Linux distributions, Unix-like systems, and ChromeOS. Over 1200 ISO files have been tested for compatibility. Key features include its speed, ease of use, support for large ISO files (over 4GB), and the ability to boot directly from ISO/WIM/IMG/VHD(x)/EFI files without extraction.\n\nVentoy offers advanced features through its plugin framework, including persistence, auto-installation, theme customization, password protection, and the ability to inject files into the runtime environment. It supports various file systems like FAT32, exFAT, NTFS, UDF, XFS, and Ext2/3/4. Detailed documentation, a FAQ, and a forum are available for users, and the developers accept donations through various platforms.\n",
    "chinese_title": "Ventoy：创建可启动USB驱动器，支持ISO/WIM/IMG/VHD(x)/EFI文件",
    "chinese_summary": "Ventoy 是一款开源工具，用于从 ISO/WIM/IMG/VHD(x)/EFI 文件创建可启动 USB 驱动器。它无需重复格式化 USB 驱动器；用户只需将镜像文件复制到驱动器，Ventoy 就会提供一个启动菜单供选择。Ventoy 支持多个镜像文件、浏览本地驱动器以查找可启动文件，以及 MBR 和 GPT 分区样式。它兼容 x86 Legacy BIOS、IA32 UEFI、x86_64 UEFI、ARM64 UEFI 和 MIPS64EL UEFI。\n\nVentoy 支持广泛的操作系统，包括 Windows、各种 Linux 发行版、类 Unix 系统和 ChromeOS。超过 1200 个 ISO 文件已通过兼容性测试。主要功能包括速度快、易于使用、支持大型 ISO 文件（超过 4GB），以及无需提取即可直接从 ISO/WIM/IMG/VHD(x)/EFI 文件启动。\n\nVentoy 通过其插件框架提供高级功能，包括持久化、自动安装、主题定制、密码保护以及将文件注入运行时环境的功能。它支持各种文件系统，如 FAT32、exFAT、NTFS、UDF、XFS 和 Ext2/3/4。用户可以访问详细的文档、FAQ 和论坛，开发者接受通过各种平台进行的捐赠。"
  },
  {
    "id": "45702252",
    "title": "Acronymy (Can we define every word as an acronym?)",
    "url": "https://acronymy.net/",
    "summary": "The article \"Acronymy\" explores the concept of defining every word as an acronym. It presents a game or project where users attempt to create acronymic expansions for words. The page indicates that 6.6203% of the words in a dataset (17890 out of 270231) have been defined as acronyms. Today's featured word is \"tingling,\" humorously defined as \"tiny impulses nervously generating little itching neural glow.\"\n\nThe article also highlights recent activity, showcasing words that have been either newly defined (squirts, tureen, enter, mine, manducate, integrity, nihilistically, oppressive, branches, gay) or listed as random undefined words. There are links to Twitter accounts (@acronymy.net and @daily.acronymy.net) suggesting a social media component. A leaderboard is also mentioned, indicating a competitive aspect to the project. The \"about\" section likely provides further details about the project's goals and methodology. In essence, \"Acronymy\" seems to be an experiment in creative wordplay, challenging the conventional meaning of words by reimagining them as acronyms.\n",
    "chinese_title": "缩略语 (我们能把每个词都定义成缩略语吗?)",
    "chinese_summary": "文章“缩略语化”探索了将每个单词定义为首字母缩略词的概念。它提出了一个游戏或项目，用户尝试为单词创建首字母缩略词扩展。该页面显示，数据集中的6.6203%的单词（270231个单词中的17890个）已被定义为首字母缩略词。今日推荐词是“tingling”（刺痛），幽默地定义为“tiny impulses nervously generating little itching neural glow”（微小的冲动紧张地产生轻微的瘙痒神经光芒）。\n\n文章还重点介绍了近期活动，展示了新定义的单词（squirts, tureen, enter, mine, manducate, integrity, nihilistically, oppressive, branches, gay）或列为随机未定义单词的列表。存在指向Twitter帐户（@acronymy.net和@daily.acronymy.net）的链接，表明存在社交媒体组成部分。还提到了排行榜，表明该项目具有竞争性。“关于”部分可能提供了有关项目目标和方法的更多详细信息。本质上，“缩略语化”似乎是一个创造性的文字游戏实验，通过将单词重新想象为首字母缩略词来挑战单词的传统含义。"
  },
  {
    "id": "45681156",
    "title": "NaN, the not-a-number number that isn't NaN",
    "url": "https://piccalil.li/blog/nan-the-not-a-number-number-that-isnt-nan/",
    "summary": "生成摘要时出错",
    "chinese_title": "NaN，非NaN的非数字数字",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45746482",
    "title": "Israel demanded Google and Amazon use secret 'wink' to sidestep legal orders",
    "url": "https://www.theguardian.com/us-news/2025/oct/29/google-amazon-israel-contract-secret-code",
    "summary": "生成摘要时出错",
    "chinese_title": "以色列要求谷歌和亚马逊使用秘密“暗号”来规避法律命令",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45683380",
    "title": "Spinning Up an Onion Mirror Is Stupid Easy",
    "url": "https://flower.codes/2025/10/23/onion-mirror.html",
    "summary": "This article provides a step-by-step guide on how to create a .onion mirror of an existing website using Caddy as the web server on a Debian-based VPS. The author emphasizes the simplicity of the process, stating it only involves a few commands and configuration lines.\n\nThe steps include:\n\n1.  **Installing Tor:** Using `apt` to install the Tor package.\n2.  **Configuring Tor:** Editing the `/etc/tor/torrc` file to disable SOCKS proxy, run Tor as a daemon, set up a hidden service directory and port (80), disable inbound connections, and disable directory services.\n3.  **Restarting Tor:** Restarting the Tor service using `systemctl`.\n4.  **Obtaining the .onion Address:** Retrieving the .onion address from the `/var/lib/tor/hidden_service/hostname` file.\n5.  **Configuring Caddy:** Optionally adding a new site block to the Caddy configuration file for the .onion address, especially if Caddy is configured to respond only to specific domains or IPs. The author notes the need to serve the site over plain HTTP since HTTPS certificates are not available for .onion addresses.\n6.  **(Optional) Advertising the .onion Address:** Adding an `Onion-Location` header to the main site's Caddy configuration to subtly inform Tor-enabled browsers about the .onion mirror. The header redirects users to the equivalent page on the .onion site.\n\nThe author concludes by encouraging readers to test their .onion mirror using a Tor-enabled browser. The author also mentions their motivation is for free speech and anti-censorship, and done \"because why not\".\n",
    "chinese_title": "建立洋葱镜像超级简单",
    "chinese_summary": "本文提供了一个逐步指南，介绍了如何使用Caddy作为Web服务器在基于Debian的VPS上创建现有网站的.onion镜像。作者强调了该过程的简单性，指出它仅涉及几个命令和配置行。\n\n步骤包括：\n\n1. **安装Tor:** 使用`apt`安装Tor软件包。\n2. **配置Tor:** 编辑`/etc/tor/torrc`文件以禁用SOCKS代理，将Tor作为守护程序运行，设置隐藏服务目录和端口（80），禁用入站连接，并禁用目录服务。\n3. **重启Tor:** 使用`systemctl`重启Tor服务。\n4. **获取.onion地址:** 从`/var/lib/tor/hidden_service/hostname`文件中检索.onion地址。\n5. **配置Caddy:** 可选地向Caddy配置文件添加一个新的站点块，用于.onion地址，尤其是在Caddy配置为仅响应特定域名或IP的情况下。作者指出需要通过纯HTTP提供站点，因为HTTPS证书不适用于.onion地址。\n6. **（可选）宣传.onion地址:** 将`Onion-Location`标头添加到主站点的Caddy配置中，以微妙地告知启用Tor的浏览器有关.onion镜像的信息。该标头将用户重定向到.onion站点上的等效页面。\n\n作者最后鼓励读者使用启用Tor的浏览器测试他们的.onion镜像。作者还提到他们的动机是为了言论自由和反审查，并且这样做“因为为什么不呢”。"
  },
  {
    "id": "45748879",
    "title": "Minecraft removing obfuscation in Java Edition",
    "url": "https://www.minecraft.net/en-us/article/removing-obfuscation-in-java-edition",
    "summary": "Minecraft: Java Edition is removing code obfuscation, a practice of hiding parts of the code, to make modding easier. Obfuscation, while common in the gaming industry, has made it difficult for modders to understand and work with the game's code.\n\nPreviously, modders had to piece together what each class and function did, but in 2019 Minecraft released \"obfuscation mappings\" to help match obfuscated terms to their original names. Now, they are removing obfuscation entirely, starting with the first snapshot after the \"Mounts of Mayhem\" launch. This means the original technical names for variables, fields, methods, and classes will be included by default.\n\nTo help modders prepare for this change, \"experimental release\" versions without obfuscation will be available alongside the obfuscated versions in upcoming snapshots, allowing them to test their tools and workflows. The first completely un-obfuscated version will be the snapshot following the full \"Mounts of Mayhem\" release. This change aims to speed up mod creation, simplify debugging, and make crash logs more readable. The End User License Agreement and Usage Guidelines remain in effect, and a LICENSE file linking to the EULA will be included in the .jar files. Modders are encouraged to provide feedback on this transition.\n",
    "chinese_title": "Minecraft Java版移除混淆",
    "chinese_summary": "《我的世界：Java版》移除代码混淆，简化Mod制作。代码混淆是隐藏部分代码的一种做法，在游戏行业中很常见，但它使Mod制作者难以理解和使用游戏代码。\n\n此前，Mod制作者必须拼凑每个类和函数的作用，但在2019年，《我的世界》发布了“混淆映射”，以帮助将混淆的术语与其原始名称匹配。现在，他们将完全移除混淆，从“混乱坐骑”发布后的第一个快照开始。这意味着变量、字段、方法和类的原始技术名称将默认包含在内。\n\n为了帮助Mod制作者为这一变化做好准备，在即将到来的快照中，无混淆的“实验性发布”版本将与混淆版本一同提供，让他们能够测试他们的工具和工作流程。第一个完全无混淆的版本将是完整版“混乱坐骑”发布后的快照。此举旨在加快Mod制作速度，简化调试过程，并使崩溃日志更易于阅读。《最终用户许可协议》和《使用指南》仍然有效，并且.jar文件中将包含一个链接到EULA的LICENSE文件。鼓励Mod制作者就此过渡提供反馈。"
  },
  {
    "id": "45758093",
    "title": "Language models are injective and hence invertible",
    "url": "https://arxiv.org/abs/2510.15511",
    "summary": "This arXiv paper, submitted in October 2025, titled \"Language Models are Injective and Hence Invertible\" by Nikolaou et al., challenges the common assumption that transformer language models are non-injective due to non-linearities and normalization. The authors mathematically prove that these models, when mapping discrete input sequences to continuous representations, are actually injective (lossless), a property maintained from initialization through training.\n\nThey empirically validate their claim through billions of collision tests across six state-of-the-art language models, finding no instances of collisions (different inputs mapping to the same output). Building on this injectivity, they introduce SipIt, a novel algorithm that can provably and efficiently reconstruct the exact input text from hidden activations in linear time, demonstrating practical invertibility.\n\nThe paper argues that this injectivity is a fundamental and exploitable property of language models, with significant implications for improving transparency, interpretability, and ensuring safer deployment of these models. The work contributes both a theoretical proof and a practical algorithm for inverting language models, opening avenues for new research directions in understanding and controlling these powerful systems.\n",
    "chinese_title": "语言模型是单射的，因此是可逆的。",
    "chinese_summary": "该 arXiv 论文由 Nikolaou 等人于 2025 年 10 月提交，题为“语言模型是单射的，因此是可逆的”，挑战了 Transformer 语言模型由于非线性和归一化而为非单射的普遍假设。作者通过数学证明，这些模型在将离散输入序列映射到连续表示时，实际上是单射的（无损的），这一性质从初始化到训练都得以保持。\n\n他们通过在六个最先进的语言模型上进行的数十亿次冲突测试，对他们的主张进行了经验验证，没有发现任何冲突实例（不同的输入映射到相同的输出）。基于这种单射性，他们引入了 SipIt，一种新颖的算法，可以证明地且高效地在线性时间内从隐藏激活中重建精确的输入文本，从而展示了实际的可逆性。\n\n该论文认为，这种单射性是语言模型的一个基本且可利用的属性，对提高透明度、可解释性和确保这些模型更安全的部署具有重要意义。这项工作贡献了语言模型逆向的理论证明和实用算法，为理解和控制这些强大的系统开辟了新的研究方向。"
  },
  {
    "id": "45697450",
    "title": "Typst's Math Mode Problem",
    "url": "https://laurmaedje.github.io/posts/math-mode-problem/",
    "summary": "This article discusses a persistent issue in Typst's math mode related to the parsing of sub- and superscripts, specifically concerning function calls. The core problem is that Typst treats identifiers followed by parentheses as function calls, creating ambiguity between Typst functions (like `abs(x)`) and mathematical functions (like `omega(x)`). This affects the precedence of sub- and superscripts, leading to unintuitive behavior like `f_i(x)` rendering as `i(x)` instead of `i`.\n\nThe author explains that making Typst function calls bind more tightly than sub/superscripts was initially intended to make `abs(x)` calls work, but it resulted in the unexpected precedence issues. Reverting to the previous behavior (Typst 0.3) would fix the subscript problem but break existing `abs(x)` calls.\n\nThe article explores several potential solutions: doing nothing (A), reverting to Typst 0.3 behavior (B), runtime parsing (C), introducing a `MathAttachCall` expression (D), and requiring different syntax for Typst function calls (E). Options C and D aim for the best of both worlds but increase complexity and decrease portability. Option E, introducing a hash for Typst functions (`#abs(x)`), could clarify the distinction but changes Typst's core character compared to LaTeX.\n\nThe author ultimately argues for option B (reverting to Typst 0.3 behavior), acknowledging the need for parentheses in cases like `e^(abs(x))`, but emphasizing the greater clarity and predictability it offers. They believe that the need for parentheses is a reasonable trade-off for a more intuitive and consistent math mode. A PR implementing option B is currently open and likely to be merged.\n",
    "chinese_title": "Typst的数学模式问题",
    "chinese_summary": "本文讨论了 Typst 数学模式中关于上下标解析的一个长期存在的问题，特别是涉及函数调用时。核心问题是 Typst 将后跟括号的标识符视为函数调用，导致 Typst 函数（如 `abs(x)`）和数学函数（如 `omega(x)`）之间存在歧义。这影响了上下标的优先级，导致出现不直观的行为，例如 `f_i(x)` 被渲染为 `i(x)` 而不是 `f_i`。\n\n作者解释说，最初的目的是让 Typst 函数调用比上下标结合得更紧密，以使 `abs(x)` 调用能够正常工作，但这导致了意外的优先级问题。恢复到之前的行为 (Typst 0.3) 可以解决下标问题，但会破坏现有的 `abs(x)` 调用。\n\n本文探讨了几种潜在的解决方案：不做任何处理 (A)、恢复到 Typst 0.3 的行为 (B)、运行时解析 (C)、引入 `MathAttachCall` 表达式 (D) 以及要求 Typst 函数调用使用不同的语法 (E)。选项 C 和 D 旨在两全其美，但增加了复杂性并降低了可移植性。选项 E，为 Typst 函数引入哈希标记（`#abs(x)`），可以明确区分，但与 LaTeX 相比，改变了 Typst 的核心特征。\n\n作者最终支持选项 B（恢复到 Typst 0.3 的行为），承认在 `e^(abs(x))` 之类的示例中需要括号，但强调了它提供的更大的清晰度和可预测性。他们认为，对于一个更直观和一致的数学模式来说，需要括号是一个合理的折衷方案。一个实施选项 B 的 PR 目前已开放，并可能被合并。"
  },
  {
    "id": "45681023",
    "title": "Some Smalltalk about Ruby Loops",
    "url": "https://tech.stonecharioteer.com/posts/2025/ruby-loops/",
    "summary": "This article explores the Ruby loop from the perspective of message passing, drawing parallels with Smalltalk's philosophy of \"Protocol over Syntax.\"  The author contrasts Ruby's approach with Python's, arguing that Ruby treats method calls as sending messages to objects, allowing objects to control iteration and define how they respond to these messages. In contrast, Python focuses on attribute lookup and then calling a method with call.\n\nThe author explains the concept of message passing in Ruby using the `.send` method and exploring how it enables defining custom behavior for methods like `.times`. This enables customization through classes such as `PseudoInteger` and `LyingPseudoInteger`, demonstrating how the object (not the loop syntax) defines iteration logic. The article explains how a language can have built-in constructs for message handling via `.respond_to?` and `.method_missing`.\n\nThe inclusion of the Enumerable module and the implementation of the `each` method are presented as examples of the Collection protocol from Smalltalk. The article criticizes the `for` loop in Ruby for being syntax sugar that pollutes the namespace and doesn't align with Ruby's message-passing paradigm.  Instead, the author emphasizes the importance of using methods like `.each` and `.times` to create idiomatic Ruby code. Ultimately, the author argues that understanding message passing helps developers see past syntax and design better object-oriented interfaces.\n",
    "chinese_title": "关于 Ruby 循环的一些闲谈",
    "chinese_summary": "本文从消息传递的角度探讨了 Ruby 的循环，并与 Smalltalk 的“协议胜于语法”哲学进行了类比。作者将 Ruby 的方法与 Python 的方法进行了对比，认为 Ruby 将方法调用视为向对象发送消息，允许对象控制迭代并定义它们如何响应这些消息。相比之下，Python 侧重于属性查找，然后使用 call 调用方法。\n\n作者使用 `.send` 方法解释了 Ruby 中消息传递的概念，并探讨了它如何为 `.times` 等方法定义自定义行为。这可以通过 `PseudoInteger` 和 `LyingPseudoInteger` 等类实现自定义，展示了对象（而非循环语法）如何定义迭代逻辑。本文解释了一种语言如何通过 `.respond_to?` 和 `.method_missing` 拥有内置的消息处理结构。\n\nEnumerable 模块的包含和 `each` 方法的实现被作为 Smalltalk 中 Collection 协议的示例。本文批评了 Ruby 中的 `for` 循环，认为它是污染命名空间并且不符合 Ruby 消息传递范例的语法糖。相反，作者强调使用 `.each` 和 `.times` 等方法来创建符合 Ruby 习惯用法的代码的重要性。最终，作者认为理解消息传递有助于开发者超越语法，设计更好的面向对象的接口。"
  },
  {
    "id": "45711577",
    "title": "How ancient people saw themselves",
    "url": "https://worldhistory.substack.com/p/how-ancient-people-saw-themselves",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "古代人如何看待自己",
    "chinese_summary": "Unable to access the article link.\n"
  },
  {
    "id": "45691218",
    "title": "The Aesthete's Progress",
    "url": "https://sydneyreviewofbooks.com/essays/the-aesthetes-progress",
    "summary": "This passage outlines a philosophical view of aesthetic contemplation and its transformative power, primarily focused on the relationship between the observer and the observed. It argues that when we perceive something as beautiful, we transcend our individual self and become a \"pure will-less subject of knowledge.\" This objectivity allows us to perceive the underlying \"Idea\" of the object, rather than its specific, individual instance.\n\nThe \"Idea\" transcends time and space. It doesn't matter which specific tree is being observed or who the observer is; the focus shifts to the essential, universal significance of the tree's existence. This universal significance is the core of the \"Idea.\"\n\nCrucially, aesthetic contemplation offers relief from suffering. By escaping the confines of our individual will and desires, we detach from the source of our misery. The \"pure subject of knowledge,\" free from the influence of the will, becomes the \"eternal eye of the world,\" unaffected by the fleeting nature of individual existence.\n\nThe passage concludes by asserting a dual existence within each individual. As a being driven by will, the individual experiences suffering and is bound to the limitations of time and place. However, as a \"purely objective perceiver,\" the individual participates in the objective world without the burden of suffering, becoming one with all that is perceived. In this state, the individual is not just limited to their singular, suffering existence, but encompasses the entirety of the perceived universe.\n",
    "chinese_title": "唯美主义者的历程",
    "chinese_summary": "本文概述了一种关于审美观照及其转化力量的哲学观点，主要关注观察者与被观察者之间的关系。它认为，当我们感知到某种事物是美的，我们就超越了个人的自我，成为一个“纯粹无意志的认知主体”。这种客观性使我们能够感知到该对象潜在的“理念”，而不是它的具体、个别实例。\n\n“理念”超越了时间和空间。观察的是哪棵具体的树或者观察者是谁并不重要；重点转移到树存在的基本的、普遍的意义上。这种普遍的意义是“理念”的核心。\n\n至关重要的是，审美观照可以缓解痛苦。通过摆脱我们个人意志和欲望的束缚，我们摆脱了痛苦的根源。摆脱意志影响的“纯粹认知主体”变成了“世界的永恒之眼”，不受个体存在短暂性的影响。\n\n文章最后断言，每个人都存在着双重存在。作为一个受意志驱动的存在，个人会经历痛苦，并受到时间和地点的限制。然而，作为一个“纯粹客观的感知者”，个人参与到客观世界中，而没有痛苦的负担，与所有被感知的事物融为一体。在这种状态下，个人不仅限于他们单一的、痛苦的存在，而是包含了整个被感知的宇宙。"
  },
  {
    "id": "45754439",
    "title": "Raspberry Pi Pico Bit-Bangs 100 Mbit/S Ethernet",
    "url": "https://www.elektormagazine.com/news/rp2350-bit-bangs-100-mbit-ethernet",
    "summary": "This article discusses developer Steve Markgraf's project, \"Pico-100BASE-TX,\" where he achieved 100 Mbit/s Fast Ethernet transmission on a Raspberry Pi Pico using purely software and the RP2040's (and RP2350's) Programmable I/O (PIO). Building on previous bit-banging achievements like 10BASE-T and USB, Markgraf's implementation leverages PIO and DMA for MLT-3 encoding, 4B5B line coding, and scrambling at a 125 MHz symbol rate. This results in a functional 100 Mbit/s Ethernet link capable of streaming about 11 Mbyte/s over UDP, demonstrated with real-time audio and ADC data streams.\n\nThe project is a transmit-only proof of concept, and the author advises using a pulse transformer or Ethernet switch for isolation. The accompanying repository includes examples like a counter, ADC streamer, and audio demo. The library supports both the RP2040 and RP2350 (Pico 2) and is compatible with the standard Pico SDK.\n\nThe article highlights the potential of this achievement for low-cost, high-speed data acquisition and streaming, envisioning applications in test instruments, remote sensors, and experimental network interfaces, all without the need for a dedicated PHY chip. It raises the question of how far software-defined hardware can be pushed on inexpensive microcontrollers.\n",
    "chinese_title": "树莓派Pico位碰撞实现百兆以太网",
    "chinese_summary": "本文探讨了开发者 Steve Markgraf 的项目“Pico-100BASE-TX”，他在 Raspberry Pi Pico 上纯粹使用软件和 RP2040（以及 RP2350）的可编程 I/O (PIO) 实现了 100 Mbit/s 快速以太网传输。 在 10BASE-T 和 USB 等先前的位碰撞成就的基础上，Markgraf 的实现利用 PIO 和 DMA 以 125 MHz 的符号率进行 MLT-3 编码、4B5B 线路编码和加扰。 这产生了一个功能性的 100 Mbit/s 以太网链路，能够通过 UDP 传输大约 11 Mbyte/s 的数据流，并已通过实时音频和 ADC 数据流进行了演示。\n\n该项目是一个仅发送的验证概念，作者建议使用脉冲变压器或以太网交换机进行隔离。 随附的存储库包含计数器、ADC 流媒体和音频演示等示例。 该库支持 RP2040 和 RP2350 (Pico 2)，并且与标准 Pico SDK 兼容。\n\n本文强调了这项成就对于低成本、高速数据采集和流媒体的潜力，设想了在测试仪器、远程传感器和实验性网络接口中的应用，所有这些都不需要专用 PHY 芯片。 它提出了一个问题：在廉价微控制器上，软件定义的硬件能被推到多远。"
  },
  {
    "id": "45762136",
    "title": "Moderna, the company that helped save the world, has unraveled",
    "url": "https://www.statnews.com/2025/10/30/moderna-rise-fall-biotech-analysis-from-pandemic-rise-to-mrna-crash/",
    "summary": "This article, titled \"Moderna, the company that helped save the world, has unraveled,\" suggests a significant downfall for the biotechnology company. The title itself implies a dramatic reversal of fortune for Moderna, a company that gained global recognition for its role in developing a COVID-19 vaccine.\n\nThe snippet provided doesn't offer much detail on the reasons for this unraveling, focusing instead on an unrelated news item: \"STAT Plus: Alnylam raises guidance as sales of heart drug match expectations.\" The juxtaposition of these two pieces implies a contrast between Moderna's struggles and the success of another pharmaceutical company, Alnylam.\n\nWithout further context, we can only infer that Moderna's current state is far from its previous successes. Possible reasons for this \"unraveling\" could include declining vaccine demand, challenges in developing new products, financial difficulties, internal mismanagement, increased competition, or negative press regarding its operations or products. The article likely delves into the specifics of these potential contributing factors, explaining how a company once celebrated for its vital contribution to global health has now faced significant setbacks. The fact that the article is dated October 30, 2025, indicates a period of time has passed since the initial success of the COVID-19 vaccines.\n",
    "chinese_title": "拯救世界的Moderna公司已分崩离析",
    "chinese_summary": "题为“莫德纳，这家曾帮助拯救世界的公司，如今已分崩离析”的文章暗示这家生物技术公司面临重大衰落。标题本身暗示莫德纳的命运发生了戏剧性逆转，这家公司因其在开发新冠疫苗方面的作用而获得全球认可。\n\n这段文字并没有提供太多关于这种分崩离析的原因的细节，而是专注于一个不相关的新闻项目：“STAT Plus：Alnylam提高指导，心脏药物销售额符合预期。” 这两篇文章的并列暗示了莫德纳的困境与另一家制药公司Alnylam的成功之间的对比。\n\n在没有更多背景信息的情况下，我们只能推断莫德纳目前的状态远非其之前的成功。 这种“分崩离析”的可能原因包括疫苗需求下降、新产品开发面临挑战、财务困难、内部管理不善、竞争加剧或对其运营或产品的负面报道。 这篇文章可能深入探讨了这些潜在因素的具体情况，解释了一家曾经因其对全球健康的重大贡献而受到赞扬的公司现在如何面临重大挫折。 文章的日期是2025年10月30日，表明自新冠疫苗最初成功以来已经过去了一段时间。"
  },
  {
    "id": "45755821",
    "title": "Hello-World iOS App in Assembly",
    "url": "https://gist.github.com/nicolas17/966a03ce49f949dd17b0123415ef2e31",
    "summary": "This article presents assembly code for a \"Hello-World\" iOS application. The code, titled `yellow.asm`, demonstrates how to build a basic iOS app from scratch using ARM64 assembly language, bypassing Objective-C or Swift.\n\nThe assembly code implements the following:\n\n*   **Application Delegate Setup:** Creates and registers an `AppDelegate` class, adhering to the `UIApplicationDelegate` protocol. It dynamically adds a method (`application:didFinishLaunchingWithOptions:`) to handle the app's launch.\n*   **UI Creation:** Instantiates `UIWindow`, `UIViewController`, and sets the background color of the view to yellow. It leverages Objective-C runtime functions like `objc_getClass`, `class_createInstance`, and `objc_msgSend` to interact with UIKit components.\n*   **Message Sending:** Employs `objc_msgSend` extensively to send messages to Objective-C objects, like setting the root view controller on the window and making the window key and visible.\n*   **Memory Management:** Utilizes autorelease pools (`objc_autoreleasePoolPush`, `objc_autoreleasePoolPop`) for basic memory management.\n*   **Core Functionality:** The `didFinishLaunching` function is responsible for setting up the user interface and making it visible.\n\nThe article also shows how strings are defined in the `.data` section for use with Objective-C APIs.\n\nComments highlight potential optimizations (popping x0 and x1 simultaneously) and a question regarding x7 register preservation after `_objc_autoreleasePoolPop`. Someone also asks for build and deployment instructions.\n",
    "chinese_title": "汇编实现的iOS Hello-World应用",
    "chinese_summary": "本文展示了一个 \"Hello-World\" iOS 应用的汇编代码。该代码，名为 `yellow.asm`，演示了如何使用 ARM64 汇编语言从头开始构建一个基本的 iOS 应用，绕过 Objective-C 或 Swift。\n\n汇编代码实现了以下功能：\n\n*   **应用程序委托设置：** 创建并注册一个 `AppDelegate` 类，遵循 `UIApplicationDelegate` 协议。它动态地添加一个方法 (`application:didFinishLaunchingWithOptions:`) 来处理应用程序的启动。\n*   **UI 创建：** 实例化 `UIWindow`、`UIViewController`，并将视图的背景颜色设置为黄色。它利用 Objective-C 运行时函数，如 `objc_getClass`、`class_createInstance` 和 `objc_msgSend` 来与 UIKit 组件交互。\n*   **消息发送：** 广泛使用 `objc_msgSend` 向 Objective-C 对象发送消息，例如设置窗口上的根视图控制器，并使窗口成为关键窗口且可见。\n*   **内存管理：** 使用自动释放池 (`objc_autoreleasePoolPush`, `objc_autoreleasePoolPop`) 进行基本的内存管理。\n*   **核心功能：** `didFinishLaunching` 函数负责设置用户界面并使其可见。\n\n本文还展示了如何在 `.data` 段中定义字符串，以便与 Objective-C API 一起使用。\n\n注释突出了潜在的优化（同时弹出 x0 和 x1）以及关于 `_objc_autoreleasePoolPop` 之后 x7 寄存器保存的问题。还有人询问构建和部署说明。"
  },
  {
    "id": "45747018",
    "title": "Kafka is Fast – I'll use Postgres",
    "url": "https://topicpartition.io/blog/postgres-pubsub-queue-benchmarks",
    "summary": "This article challenges the trend of blindly adopting complex technologies like Kafka when simpler solutions, like Postgres, might suffice. It argues that the \"Small Data\" movement and the resurgence of Postgres make a compelling case for prioritizing common sense and practicality over hype-driven tech choices.\n\nThe author benchmarks Postgres' capabilities as a pub/sub messaging system and a queue, comparing it to Kafka. The benchmark reconstructs a log from Postgres primitives and features at-least-once semantics.\n\n**Key findings:**\n\n*   **Pub/Sub:** A single Postgres instance achieved 4.8 MB/s write and 24.6 MB/s read throughput with reasonable latency. A replicated three-node setup maintained similar throughput while increasing p99 end-to-end latency to 186ms. The article concludes that a simple 3-node Postgres cluster can handle many common Kafka workloads with a low cost of $11,514 per year.\n*   **Queue:** The benchmarked throughput was lower, with limitations from the single-table bottleneck.\n\nThe author emphasizes that while Kafka excels at extreme scale, many organizations don't require that level of complexity. Postgres offers a battle-tested, scalable, and reliable alternative that handles a significant portion of specialized systems' use cases with less development effort. The article advocates for carefully considering the specific needs of a project before automatically opting for complex solutions like Kafka, especially when workloads are relatively small.\n",
    "chinese_title": "Kafka速度快——我用Postgres",
    "chinese_summary": "本文挑战了一种盲目采用Kafka等复杂技术的趋势，认为在某些情况下，更简单的解决方案，如Postgres，可能就足够了。“小数据”运动和Postgres的复兴，有力地证明了应该优先考虑常识和实用性，而不是受炒作驱动的技术选择。\n\n作者对Postgres作为发布/订阅消息系统和队列的能力进行了基准测试，并将其与Kafka进行了比较。该基准测试使用Postgres原语和至少一次语义重建了一个日志。\n\n**主要发现：**\n\n*   **发布/订阅：** 单个Postgres实例实现了4.8 MB/s的写入吞吐量和24.6 MB/s的读取吞吐量，且延迟合理。一个复制的三节点设置保持了类似的吞吐量，同时将p99端到端延迟增加到186毫秒。文章得出结论，一个简单的三节点Postgres集群可以处理许多常见的Kafka工作负载，且成本较低，每年11,514美元。\n*   **队列：** 基准测试的吞吐量较低，受到单表瓶颈的限制。\n\n作者强调，虽然Kafka擅长处理极端规模，但许多组织并不需要这种复杂程度。Postgres提供了一个经过实战检验、可扩展且可靠的替代方案，可以用更少的开发工作量处理大部分专用系统的用例。文章提倡在自动选择Kafka等复杂解决方案之前，仔细考虑项目的具体需求，尤其是在工作负载相对较小的情况下。"
  },
  {
    "id": "45750954",
    "title": "Dithering – Part 1",
    "url": "https://visualrambling.space/dithering-part-1/",
    "summary": "This article, \"Dithering – Part 1,\" explores the fascinating effect of dithering, explaining how it creates the illusion of more color variations than are actually used. Dithering cleverly simulates shades by strategically arranging pixels of limited colors (in this case, black and white) to trick the eye.\n\nThe author emphasizes how dithering creates the most out of limited resources. The article uses a grayscale image example to illustrate the concept. Instead of mapping each pixel to the closest available color (black or white), which results in harsh transitions and loss of detail, dithering selectively pushes some pixels towards the opposite color, generating special patterns that mimic shades through varying pixel densities.\n\nThe article introduces ordered dithering as a simple method using a threshold map. A threshold map is a grid of values representing brightness levels. By comparing each pixel's brightness to the corresponding threshold value, the pixel is turned either black or white. The design of the threshold map is key to outputting patterns where black-and-white pixel density matches the input image's shades.\n\nThe author concludes by stating that dithering replicates shades with fewer colors, strategically placed to maintain the original look. The article sets up the next two parts, promising to delve into algorithms for creating threshold maps and exploring error diffusion, another dithering algorithm. The author also encourages readers to follow them on X/Twitter.\n",
    "chinese_title": "抖动 – 第一部分",
    "chinese_summary": "抖动 – 第一部分：本文探讨了抖动这种引人入胜的效果，阐述了它如何创造出比实际使用的颜色变化更多的视觉错觉。抖动巧妙地通过策略性地排列有限颜色的像素（在本例中为黑色和白色）来模拟阴影，从而欺骗眼睛。\n\n作者强调了抖动如何最大限度地利用有限的资源。文章使用灰度图像示例来说明这个概念。 抖动不是将每个像素映射到最接近的可用颜色（黑色或白色），从而导致生硬的过渡和细节的丢失，而是有选择地将一些像素推向相反的颜色，生成特殊的图案，通过不同的像素密度来模拟阴影。\n\n文章介绍了一种使用阈值映射表的简单方法，即有序抖动。阈值映射表是一个表示亮度级别的数值网格。通过将每个像素的亮度与相应的阈值进行比较，像素会变成黑色或白色。 阈值映射表的设计是输出图案的关键，在这些图案中，黑白像素密度与输入图像的阴影相匹配。\n\n作者最后指出，抖动用更少的颜色复制阴影，并策略性地放置这些颜色以保持原始外观。 本文为接下来的两个部分做了铺垫，承诺深入研究创建阈值映射表的算法，并探索另一种抖动算法——误差扩散。 作者还鼓励读者在 X/Twitter 上关注他们。"
  },
  {
    "id": "45751400",
    "title": "Uv is the best thing to happen to the Python ecosystem in a decade",
    "url": "https://emily.space/posts/251023-uv",
    "summary": "This article champions uv, a new open-source Python tool developed by Astral, as a revolutionary improvement to the Python ecosystem. The author argues that uv simplifies Python installation, virtual environment management, and dependency synchronization, surpassing existing tools in speed and efficiency.\n\nKey features of uv include:\n\n*   **Fast installation:** Easy installation via a one-liner command, without interfering with existing Python installations.\n*   **Virtual environment management:** Integrates seamlessly with virtual environments using `pyproject.toml` files to manage dependencies and Python versions.\n*   **Simplified workflow:** Streamlines project setup with `uv init`, dependency management with `uv add`, and environment synchronization with `uv sync`. The `uv run` command simplifies script execution within the correct environment.\n*   **Version Pinning:** The tool enables pinning specific Python versions with `uv python pin`, ensuring consistent environments across machines.\n*   **On-the-fly execution:** The `uvx` (or `uv tool run`) command allows for quick execution of tools like Ruff or Jupyter Lab in temporary virtual environments without complex setup.\n\nThe author emphasizes uv's speed, cross-platform compatibility, and its ability to create reproducible Python environments via a `uv.lock` file. They share a personal experience using uv to manage Python installations across a distributed team, highlighting its positive impact on consistency and collaboration. In summary, the article positions uv as a game-changer for Python development, offering efficiency and simplification for various tasks.\n",
    "chinese_title": "Uv是过去十年里Python生态系统发生的最好的事情。",
    "chinese_summary": "本文赞扬由 Astral 开发的全新开源 Python 工具 uv，认为其是对 Python 生态系统的革命性改进。作者认为 uv 简化了 Python 安装、虚拟环境管理和依赖同步，在速度和效率上超越了现有工具。\n\nuv 的主要特点包括：\n\n*   **快速安装：** 通过一行命令轻松安装，不干扰现有的 Python 安装。\n*   **虚拟环境管理：** 使用 `pyproject.toml` 文件无缝集成虚拟环境，以管理依赖项和 Python 版本。\n*   **简化工作流程：** 使用 `uv init` 简化项目设置，使用 `uv add` 管理依赖项，使用 `uv sync` 同步环境。`uv run` 命令简化了在正确环境中执行脚本的操作。\n*   **版本锁定：** 该工具允许使用 `uv python pin` 锁定特定 Python 版本，确保跨机器环境的一致性。\n*   **即时执行：** `uvx`（或 `uv tool run`）命令允许在临时虚拟环境中快速执行诸如 Ruff 或 Jupyter Lab 之类的工具，而无需复杂的设置。\n\n作者强调了 uv 的速度、跨平台兼容性以及通过 `uv.lock` 文件创建可重现 Python 环境的能力。他们分享了使用 uv 管理分布式团队中 Python 安装的个人经验，突出了其对一致性和协作的积极影响。总而言之，本文将 uv 定位为 Python 开发的变革者，为各种任务提供效率和简化。"
  },
  {
    "id": "45750875",
    "title": "The Internet runs on free and open source software and so does the DNS",
    "url": "https://www.icann.org/en/blogs/details/the-internet-runs-on-free-and-open-source-softwareand-so-does-the-dns-23-10-2025-en",
    "summary": "This article highlights the crucial role of Free and Open Source Software (FOSS) in the Domain Name System (DNS), the foundation of the internet. The ICANN Security and Stability Advisory Committee (SSAC) has released SAC132, a report emphasizing the importance of understanding and supporting FOSS within the DNS, especially in light of new cybersecurity regulations.\n\nThe report argues that because FOSS is so deeply embedded in all aspects of DNS operations, policy decisions regarding cybersecurity will directly impact the internet's security and resilience. SAC132 aims to provide non-technical guidance to policymakers, ensuring that regulations strengthen rather than weaken this critical infrastructure.\n\nThe report provides a clear overview of the DNS and FOSS development model, analyzes current cybersecurity regulations in the US, UK, and EU regarding FOSS in the DNS, and offers practical recommendations for policymakers to support and secure FOSS.\n\nThe SSAC urges policymakers, technical experts, and stakeholders to read the full report and engage in discussions to ensure a secure, stable, and resilient internet supported by a strong and sustainable FOSS ecosystem. They invite participation at ICANN84 in Dublin or remotely. The article acknowledges the contributions of SSAC members and experts who contributed to the SAC132 report.\n",
    "chinese_title": "互联网运行在自由开源软件之上，域名系统亦如此。",
    "chinese_summary": "本文强调了自由开源软件 (FOSS) 在域名系统 (DNS)（互联网的基础）中的关键作用。ICANN 安全与稳定咨询委员会 (SSAC) 发布了 SAC132 报告，强调了理解和支持 DNS 中的 FOSS 的重要性，尤其是在新的网络安全法规出台的背景下。\n\n该报告认为，由于 FOSS 如此深入地嵌入到 DNS 运营的各个方面，因此有关网络安全的政策决策将直接影响互联网的安全性和弹性。SAC132 旨在为决策者提供非技术性指导，确保法规能够加强而非削弱这一关键基础设施。\n\n该报告清晰地概述了 DNS 和 FOSS 开发模式，分析了美国、英国和欧盟当前关于 DNS 中 FOSS 的网络安全法规，并为决策者提供了支持和保护 FOSS 的实用建议。\n\nSSAC 敦促决策者、技术专家和利益相关者阅读完整报告并参与讨论，以确保由强大且可持续的 FOSS 生态系统支持的安全、稳定且具有弹性的互联网。他们邀请大家参加在都柏林举行的 ICANN84 大会或远程参与。本文承认了为 SAC132 报告做出贡献的 SSAC 成员和专家的贡献。"
  },
  {
    "id": "45759922",
    "title": "3D solar tower increases capacity factor 50%, triples solar surface area",
    "url": "https://www.pv-magazine.com/2025/10/27/3d-solar-tower-increases-capacity-factor-50-triples-solar-surface-area/",
    "summary": "Janta Power secured $5.5 million in seed funding to advance its vertical 3D solar tower technology, designed for space-constrained environments. The towers, currently in pilot programs at airports like Dallas-Fort Worth and Munich, boast a 50% higher capacity factor than traditional solar installations, reaching approximately 32% compared to the standard 22%.\n\nThe unique geometry of the single-axis tracking towers triples the solar surface area exposure, capturing both morning and evening sunlight for a dual-peak power curve that aligns with energy demand. Janta Power aims to achieve a levelized cost of electricity (LCOE) as low as $0.05 kWh.\n\nThe company offers a 5 kW tower and a 1.5 kW rooftop model, with 8.5 kW and 10 kW towers in development. Built to withstand high winds, the towers feature steel construction and modular foundations to minimize site disruption. Their 3D design ensures smoother energy delivery throughout the day, mitigating grid stress and reducing reliance on peaker plants.\n",
    "chinese_title": "3D太阳能塔提高容量系数50%，太阳能表面积增加两倍",
    "chinese_summary": "Janta Power获550万美元种子轮融资，用于推进其垂直3D太阳能塔技术，该技术专为空间受限环境设计。这些塔目前正在达拉斯-沃斯堡和慕尼黑等机场进行试点项目，其容量系数比传统太阳能装置高50%，达到约32%，而标准为22%。\n\n单轴跟踪塔的独特几何结构使太阳能表面积暴露量增加两倍，捕捉早晚阳光，形成与能源需求相一致的双峰功率曲线。Janta Power的目标是实现低至0.05美元/千瓦时的平准化度电成本（LCOE）。\n\n该公司提供5千瓦的塔和1.5千瓦的屋顶型号，8.5千瓦和10千瓦的塔正在开发中。这些塔采用钢结构和模块化地基，旨在承受高风，最大限度地减少现场破坏。其3D设计确保全天更平稳的能源输送，减轻电网压力，并减少对调峰电厂的依赖。"
  },
  {
    "id": "45728525",
    "title": "GLP-1 therapeutics: Their emerging role in alcohol and substance use disorders",
    "url": "https://academic.oup.com/jes/article/9/11/bvaf141/8277723?login=false",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "GLP-1疗法：其在酒精和物质使用障碍中的新兴作用",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "45742456",
    "title": "Board: New game console recognizes physical pieces, with an open SDK",
    "url": "https://board.fun/",
    "summary": "Board is a new type of game console designed to bring people together for face-to-face gaming. It combines the tactile feel of board games with the dynamic magic of video games, using physical pieces that the console recognizes to control gameplay on its 24-inch tabletop screen.\n\nThe console boasts an open SDK, allowing for future game development and expansion of its library. Board comes with 12 exclusive games spanning genres like arcade, strategy, and action, designed for various ages (6+ and 8+) and skill levels. These games utilize unique physical pieces for intuitive control, eliminating the need for traditional controllers. Examples include arcade classics, a culinary co-op game, a puzzle game guiding Bloogs, a strategic block placement game called Strata, and a spy adventure. Other titles feature digital pets, snake games, sushi duels, and space battles.\n\nBoard is designed for everyone, from kids to grandparents, and supports solo play, duels, and group gameplay. The FAQ section highlights that Board is a fusion of board games and video games, emphasizing its social, tactile, and replayable nature, all experienced around a physical table. The aim is to offer a unique gaming experience that is both accessible and engaging for a wide audience.\n",
    "chinese_title": "板：新款游戏主机识别实体棋子，并提供开放SDK",
    "chinese_summary": "Board是一款新型游戏主机，旨在让人们聚集在一起进行面对面的游戏。它结合了桌游的触感和视频游戏的动态魔力，使用主机识别的实体棋子来控制其24英寸桌面屏幕上的游戏。\n\n该主机拥有开放的SDK，允许未来的游戏开发和扩展其游戏库。 Board配备了12款独家游戏，涵盖街机、策略和动作等类型，专为不同年龄段（6岁以上和8岁以上）和技能水平而设计。这些游戏使用独特的实体棋子进行直观控制，无需传统控制器。 示例包括街机经典、烹饪合作游戏、引导Bloogs的益智游戏、名为Strata的战略方块放置游戏以及间谍冒险。其他游戏包括数字宠物、贪吃蛇游戏、寿司决斗和太空战斗。\n\nBoard专为所有人设计，从儿童到祖父母，并支持单人游戏、决斗和团体游戏。常见问题解答部分强调，Board是桌游和视频游戏的融合，强调其社交性、触感和可重玩性，所有这些都在一张实体桌子周围体验。其目标是提供一种独特的游戏体验，既方便又吸引广泛的受众。"
  },
  {
    "id": "45749161",
    "title": "AOL to be sold to Bending Spoons for $1.5B",
    "url": "https://www.axios.com/2025/10/29/aol-bending-spoons-deal",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "AOL将以15亿美元出售给Bending Spoons",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "45749017",
    "title": "Tailscale Peer Relays",
    "url": "https://tailscale.com/blog/peer-relays-beta",
    "summary": "Tailscale has announced the public availability of Tailscale Peer Relays, a customer-managed alternative to Tailscale's DERP servers for relaying network traffic. Peer Relays offer improved throughput, rivaling direct connections, and address the performance limitations of DERP relays in certain environments, particularly those behind strict firewalls or in locked-down cloud infrastructure.\n\nPeer Relays operate on a single UDP port and integrate directly into the Tailscale client, simplifying deployment. They prioritize direct connections, falling back to Peer Relays and then DERP servers, ensuring connectivity while maintaining WireGuard encryption.\n\nThis new feature allows customers to build deterministic, high-throughput relay topologies, improving performance in situations where direct connections aren't possible. Use cases include bypassing cloud NATs, relaying traffic through network firewalls, offloading traffic from DERP servers, and providing controlled access to locked-down customer networks.\n\nTailscale Peer Relays is in public beta and available on all plans, including the free tier (with a limit of two free peer relays). While improvements are still underway, early partners have experienced easy deployments. The feature gives customers more control over their network connectivity, enabling them to scale Tailscale with ease and flexibility.\n",
    "chinese_title": "Tailscale 对等节点中继",
    "chinese_summary": "Tailscale发布Tailscale对等中继，为客户提供一种可管理的替代方案，以取代Tailscale的DERP服务器来中继网络流量。对等中继可提供更高的吞吐量，媲美直连，并解决了某些环境（特别是防火墙严格或锁定式云基础设施背后的环境）中DERP中继的性能限制。\n\n对等中继在单个UDP端口上运行，并直接集成到Tailscale客户端中，从而简化了部署。 它们优先考虑直接连接，回退到对等中继，然后再到DERP服务器，从而在保持WireGuard加密的同时确保连接性。\n\n这项新功能使客户能够构建确定性的、高吞吐量的中继拓扑，从而在无法直接连接的情况下提高性能。用例包括绕过云NAT、通过网络防火墙中继流量、从DERP服务器卸载流量以及提供对锁定式客户网络的受控访问。\n\nTailscale对等中继目前处于公开测试阶段，可在所有计划中使用，包括免费层（限制为两个免费对等中继）。 虽然仍在进行改进，但早期合作伙伴已经体验到轻松的部署。 该功能使客户能够更好地控制其网络连接，从而使他们能够轻松灵活地扩展 Tailscale。"
  },
  {
    "id": "45755788",
    "title": "IRCd service (2024)",
    "url": "https://example.fi/blog/ircd.html",
    "summary": "This article announces the launch of a simple IRCd service hosted at example.fi. Built in AWK (a scripting language not traditionally used for IRC servers), it's presented as both an educational tool and a tribute to the pioneering role of IRC in online communication. The article highlights IRC's historical significance, noting its creation in 1988 and its influence on modern communication platforms.\n\nThe service is deliberately limited, lacking features such as channel and user listings, topics, and operator functionality. Users connecting to example.fi are advised to use clients without fancy features, like Irssi with the `-nocap` option or Hexchat on Windows.\n\nThe article includes a sample Telnet connection to the IRCd, demonstrating a basic welcome message and a rudimentary \"Message of the Day\" (MOTD). Finally, it shares the fun fact that the entire server code is only around 60 lines of AWK and a few lines of bash, and that the code will be published when it is \"ready\".\n",
    "chinese_title": "IRCd 服务 (2024)",
    "chinese_summary": "本文宣布推出一个简单的IRCd服务，托管于example.fi。该服务用AWK（一种传统上不用于IRC服务器的脚本语言）构建，旨在作为一种教育工具，并致敬IRC在在线通信中的先驱作用。本文强调了IRC的历史意义，指出其创建于1988年及其对现代通信平台的影响。\n\n该服务有意地进行了限制，缺少频道和用户列表、主题和操作员功能等特性。建议连接到example.fi的用户使用没有花哨功能的客户端，如带`-nocap`选项的Irssi或Windows上的Hexchat。\n\n本文包含一个连接到IRCd的Telnet示例，展示了一个基本的欢迎消息和一个简陋的“每日消息”（MOTD）。最后，文章分享了一个有趣的事实，即整个服务器代码仅有大约60行AWK和几行bash代码，并且代码将在“准备就绪”时发布。"
  },
  {
    "id": "45750425",
    "title": "OpenAI’s promise to stay in California helped clear the path for its IPO",
    "url": "https://www.wsj.com/tech/ai/openais-promise-to-stay-in-california-helped-clear-the-path-for-its-ipo-3af1c31c",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "OpenAI承诺留在加州，为其首次公开募股扫清了道路。",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "45756445",
    "title": "Carlo Rovelli’s radical perspective on reality",
    "url": "https://www.quantamagazine.org/carlo-rovellis-radical-perspective-on-reality-20251029/",
    "summary": "This article profiles theoretical physicist Carlo Rovelli, known for his work on loop quantum gravity and his \"relational\" interpretation of quantum mechanics. Rovelli's work challenges our conventional understanding of space and time, suggesting they are not fundamental aspects of reality, but rather emerge from the interactions of quantum elements.\n\nHis perspective is heavily influenced by his countercultural youth and a belief in questioning established norms. He emphasizes the importance of philosophy in physics, arguing that philosophical insights help us to better understand and interpret existing scientific knowledge, especially when grappling with complex concepts like reality, information, space, and time.\n\nRovelli advocates for a perspectival view of reality, where properties are only definable in relation to another system. He argues that there is no objective, ultimate truth, but rather a network of interactions and limited perspectives. He suggests that accepting this limitation allows for more honest and effective scientific progress. He sees the constant flow of time not as fundamental, but as the product of the second law of thermodynamics, an illusion that is only \"real\" from our perspective.\n\nWhile loop quantum gravity faces challenges, Rovelli remains hopeful that future experiments, potentially involving cosmic microwave background radiation or the detection of tiny black holes, will provide supporting evidence. He suggests that the relational view of quantum mechanics, influenced by philosophers like Nagarjuna, provides a framework for understanding the world in terms of how things relate to one another, rather than as independent entities with inherent properties.\n",
    "chinese_title": "卡洛·罗韦利的激进现实观",
    "chinese_summary": "本文介绍了理论物理学家卡洛·罗韦利，他以其在圈量子引力和量子力学“关系”诠释方面的工作而闻名。罗韦利的研究挑战了我们对空间和时间的传统理解，认为它们不是现实的基本方面，而是从量子元素的相互作用中涌现出来的。\n\n他的观点深受其反主流文化的青年时代和对质疑既定规范的信念的影响。他强调哲学在物理学中的重要性，认为哲学见解有助于我们更好地理解和解释现有的科学知识，尤其是在应对诸如现实、信息、空间和时间等复杂概念时。\n\n罗韦利提倡一种现实的视角观，即属性只能相对于另一个系统来定义。他认为不存在客观的、终极的真理，而是一个相互作用和有限视角的网络。他认为，接受这种局限性可以实现更诚实、更有效的科学进步。他认为时间的恒定流动并非根本，而是热力学第二定律的产物，一种从我们的角度来看才是“真实”的幻觉。\n\n虽然圈量子引力面临挑战，但罗韦利仍然希望未来的实验，可能涉及宇宙微波背景辐射或微型黑洞的探测，将提供支持性证据。他认为，受那伽朱纳等哲学家影响的关系量子力学观点，提供了一个根据事物之间的关系，而不是作为具有内在属性的独立实体来理解世界的框架。"
  },
  {
    "id": "45759925",
    "title": "It's better to be rich than right",
    "url": "https://www.cnn.com/2025/10/30/business/tesla-meme-stock-nightcap",
    "summary": "This article argues that Wall Street has shifted from valuing fundamental business principles to a \"vibe-trading\" mentality, where the primary goal is to drive stock prices up regardless of a company's actual performance or the viability of its products.\n\nThe author uses Tesla as a prime example, highlighting the company's reliance on future technologies like robotaxis and humanoid robots, despite its core electric car business facing increasing competition. A significant portion of Tesla's stock value is attributed to these unproven ventures, yet the stock price continues to soar.\n\nSimilarly, the article points to the cryptocurrency market, where despite skepticism about its real-world utility, Bitcoin has significantly outperformed the S&P 500. Crypto skeptics who questioned the product's value have missed out on substantial gains.\n\nThe author observes that Wall Street seems impervious to \"bad\" news, as investors are conditioned to \"buy the dip,\" assuming that prices will inevitably rebound. However, the article cautions that this strategy is not sustainable indefinitely, as investors have finite resources and time horizons. The piece suggests that this \"vibe-trading\" approach could eventually lead to a market correction, but the timing of such an event remains uncertain.\n",
    "chinese_title": "有钱胜过有理",
    "chinese_summary": "华尔街已从重视基本商业原则转向“氛围交易”心态，主要目标是不顾公司实际业绩或产品可行性，推高股价。\n\n作者以特斯拉为例，强调该公司对机器人出租车和人形机器人等未来技术的依赖，尽管其核心电动汽车业务正面临日益激烈的竞争。特斯拉的大部分股票价值归功于这些未经证实的风险投资，但股价仍在飙升。\n\n类似地，文章指出，尽管人们对其现实世界的效用持怀疑态度，但比特币的表现明显优于标准普尔500指数。那些质疑产品价值的加密货币怀疑论者错过了巨大的收益。\n\n作者观察到，华尔街似乎对“坏”消息免疫，因为投资者已经习惯于“逢低买入”，认为价格必然会反弹。然而，文章警告说，这种策略不可能无限期地持续下去，因为投资者的资源和时间都是有限的。这篇文章认为，这种“氛围交易”方式最终可能导致市场回调，但此类事件发生的时间仍不确定。"
  },
  {
    "id": "45761601",
    "title": "Chipotle stock craters: young people without jobs cannot afford their food",
    "url": "https://finance.yahoo.com/news/chipotle-stock-craters-as-company-says-young-people-without-jobs-cant-afford-their-food-anymore-155415667.html",
    "summary": "Chipotle's stock plummeted after the company cut its full-year sales outlook for the third consecutive quarter, citing economic pressure on its core customer base, particularly young people aged 25-35. CEO Scott Boatwright attributed the decline to \"persistent macroeconomic pressures,\" including unemployment, student loan repayments, and slower wage growth affecting this demographic. Unemployment for Americans ages 20-24 was 9.2% in August, up from 7.9% a year prior.\n\nThe company reported third-quarter revenue of $3 billion, slightly below the expected $3.02 billion. While digital sales comprised 36.7% of total food and beverage revenue, same-store sales grew by only 0.3%, less than the anticipated 1%. Higher menu prices and larger ticket sizes offset a decline in foot traffic.\n\nChipotle expects the first quarter to be the most challenging, anticipating continued pressure from middle- and low-income consumers. To combat this, the company plans to increase marketing spend, enhance digital experiences, and introduce more menu innovation, including new sides, dips, and limited-time protein offerings. The recent introduction of Adobo Ranch dip may not have provided the intended boost, as analysts suggest Chipotle needs to improve its value proposition, with add-ons like expensive sauces potentially hindering progress.\n",
    "chinese_title": "Chipotle股票暴跌：失业青年吃不起了",
    "chinese_summary": "Chipotle's stock plummeted after the company cut its full-year sales outlook for the third consecutive quarter, citing economic pressure on its core customer base, particularly young people aged 25-35. CEO Scott Boatwright attributed the decline to \"persistent macroeconomic pressures,\" including unemployment, student loan repayments, and slower wage growth affecting this demographic. Unemployment for Americans ages 20-24 was 9.2% in August, up from 7.9% a year prior.\n\nThe company reported third-quarter revenue of $3 billion, slightly below the expected $3.02 billion. While digital sales comprised 36.7% of total food and beverage revenue, same-store sales grew by only 0.3%, less than the anticipated 1%. Higher menu prices and larger ticket sizes offset a decline in foot traffic.\n\nChipotle expects the first quarter to be the most challenging, anticipating continued pressure from middle- and low-income consumers. To combat this, the company plans to increase marketing spend, enhance digital experiences, and introduce more menu innovation, including new sides, dips, and limited-time protein offerings. The recent introduction of Adobo Ranch dip may not have provided the intended boost, as analysts suggest Chipotle needs to improve its value proposition, with add-ons like expensive sauces potentially hindering progress.\n"
  },
  {
    "id": "45732800",
    "title": "China has added forest the size of Texas since 1990",
    "url": "https://e360.yale.edu/digest/china-new-forest-report",
    "summary": "Despite global deforestation trends, particularly in tropical regions due to agriculture, ranching, fires, and drought, some countries are experiencing forest regrowth. A U.N. report highlights China's significant reforestation efforts, adding 173 million acres of forest since 1990, an area comparable to the size of Texas. This achievement is largely attributed to aggressive tree-planting programs, including projects aimed at containing desert expansion, such as the 2,000-mile-long belt of trees around the Taklamakan Desert.\n\nOther countries like Canada, India, and Russia have also increased their forest cover. Developed nations, where farming is more efficient, are seeing a slowdown or reversal of deforestation. While fires and drought still contribute to forest loss, these countries, including China and India, are overall adding trees. This positive trend stands in contrast to the ongoing deforestation in Brazil, Indonesia, and the Democratic Republic of the Congo, emphasizing the mixed global picture of forest cover change. The article underscores the importance of these reforestation efforts in the face of international goals to end deforestation.\n",
    "chinese_title": "自1990年以来，中国新增了相当于得克萨斯州面积的森林。",
    "chinese_summary": "尽管全球森林砍伐趋势，尤其是在热带地区因农业、畜牧业、火灾和干旱加剧的情况下，一些国家正经历森林再生。一份联合国报告强调了中国显著的植树造林努力，自1990年以来增加了1.73亿英亩的森林，面积相当于得克萨斯州的大小。这一成就主要归功于积极的植树计划，包括旨在遏制沙漠扩张的项目，例如环绕塔克拉玛干沙漠长达2000英里的防护林带。\n\n加拿大、印度和俄罗斯等其他国家也增加了森林覆盖率。发达国家由于农业效率更高，森林砍伐的速度正在放缓或逆转。虽然火灾和干旱仍然导致森林流失，但包括中国和印度在内的这些国家总体上正在增加树木。 这种积极趋势与巴西、印度尼西亚和刚果民主共和国持续的森林砍伐形成鲜明对比，突显了全球森林覆盖变化的复杂局面。文章强调了面对国际社会结束森林砍伐目标时，这些植树造林努力的重要性。"
  },
  {
    "id": "45671677",
    "title": "Eye prosthesis is the first to restore sight lost to macular degeneration",
    "url": "https://med.stanford.edu/news/all-news/2025/10/eye-prosthesis.html",
    "summary": "生成摘要时出错",
    "chinese_title": "眼部假体首次使因黄斑变性而丧失的视力得以恢复",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45755911",
    "title": "One year with Next.js App Router and why we're moving on",
    "url": "https://paperclover.net/blog/webdev/one-year-next-app-router",
    "summary": "生成摘要时出错",
    "chinese_title": "使用 Next.js App Router 一年后的感想以及我们放弃的原因",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45749690",
    "title": "Upwave (YC S12) is hiring software engineers",
    "url": "https://www.upwave.com/job/8228849002/",
    "summary": "Upwave, a brand outcomes measurement platform backed by Y Combinator and other investors, is hiring a Senior Software Engineer to join their remote-first team. This role involves building APIs, data pipelines, and systems to power their platform, which processes billions of ad impressions and delivers insights to major brands.\n\nThe ideal candidate has 5+ years of experience, strong full-stack skills with a backend focus (Java/Kotlin/Groovy experience preferred), familiarity with data systems like MySQL and DynamoDB, and experience with cloud platforms like AWS (Kubernetes, Terraform). Experience with modern front-end frameworks like React is a bonus. The position also requires understanding and embracing modern AI-powered development tools. The company seeks someone who values collaboration, takes ownership, and is passionate about building reliable, scalable systems.\n\nThe Senior Software Engineer will contribute across the stack, designing and building scalable backend systems, engineering data pipelines, and improving platform reliability. A key focus is on integrating LLMs and advanced causal inference to improve the user experience with AI-powered tools.\n\nUpwave offers a modern tech stack, an engineering-first environment, and the opportunity to influence significant advertising decisions. The compensation package includes a base salary of $150,000 - $175,000 + bonus + equity + benefits. They prioritize innovation, work-life balance, and a collaborative, inclusive culture.\n",
    "chinese_title": "Upwave (YC S12) 正在招聘软件工程师",
    "chinese_summary": "Upwave招聘高级软件工程师\n\nUpwave是一家由Y Combinator和其他投资者支持的品牌成果衡量平台，现招聘一名高级软件工程师加入其远程优先团队。此职位涉及构建API、数据管道和系统，以驱动其平台，该平台处理数十亿次广告曝光并为主要品牌提供洞察。\n\n理想的候选人拥有5年以上经验，具备强大的全栈技能，并侧重于后端（首选Java/Kotlin/Groovy经验），熟悉MySQL和DynamoDB等数据系统，以及AWS（Kubernetes、Terraform）等云平台的使用经验。 具备React等现代前端框架经验者优先。 该职位还要求理解和接受现代人工智能驱动的开发工具。公司正在寻找重视协作、具有主人翁精神并热衷于构建可靠、可扩展系统的人才。\n\n高级软件工程师将在整个技术栈中做出贡献，设计和构建可扩展的后端系统、工程数据管道并提高平台可靠性。 一个关键重点是集成LLM和高级因果推理，以通过人工智能驱动的工具改善用户体验。\n\nUpwave提供现代技术栈、以工程为主导的环境以及影响重大广告决策的机会。薪酬方案包括15万美元至17.5万美元的基本工资+奖金+股权+福利。 他们优先考虑创新、工作与生活平衡以及协作包容的文化。"
  },
  {
    "id": "45753222",
    "title": "How the U.S. National Science Foundation enabled Software-Defined Networking",
    "url": "https://cacm.acm.org/federal-funding-of-academic-research/how-the-u-s-national-science-foundation-enabled-software-defined-networking/",
    "summary": "This article details how the U.S. National Science Foundation (NSF) played a pivotal role in enabling the development and adoption of Software-Defined Networking (SDN). Frustrated with the slow pace of innovation and limited control over traditional networks dominated by router vendors, network owners sought greater control over network behavior. SDN emerged as a solution, separating the control plane from the data plane with logically centralized control.\n\nThe NSF invested heavily in addressing \"Internet ossification,\" funding projects like 100x100, GENI, FIND, and POMI, which fostered a research community that developed key SDN components such as the 4D architecture, Ethane, OpenFlow, and open-source controllers like NOX. GENI facilitated real-world experimentation, while FIND supported new Internet architectures leveraging SDN. POMI expanded SDN research to mobile networks and programmable forwarding planes.\n\nConcurrently, hyperscale cloud companies (Google, Microsoft, Amazon, Facebook) sought cost-effective and controllable networking solutions for their massive datacenters. SDN enabled network virtualization for multi-tenant environments (led by Nicira's NVP and Open vSwitch) and wide-area traffic engineering (Google's B4 backbone). This commercial adoption spurred further academic research and the creation of successful SDN startups.\n\nSDN's success shifted control from networking vendors to software programmers, enabling greater flexibility, faster innovation, and formal network verification. While initially focused on datacenters, SDN principles are now prevalent across various networks. The article emphasizes NSF's foresight in funding early research and fostering collaboration with industry, leading to a revolution in network architecture.\n",
    "chinese_title": "美国国家科学基金会如何推动软件定义网络",
    "chinese_summary": "本文详细介绍了美国国家科学基金会(NSF)如何在推动软件定义网络(SDN)的开发和应用方面发挥关键作用。网络所有者对路由器供应商主导的传统网络创新缓慢和控制有限感到沮丧，他们寻求对网络行为的更大控制权。SDN应运而生，它将控制平面与数据平面分离，并采用逻辑上集中的控制。\n\nNSF大力投资于解决“互联网僵化”问题，资助了100x100、GENI、FIND和POMI等项目，这些项目培养了一个研究社区，开发了关键的SDN组件，如4D架构、Ethane、OpenFlow和NOX等开源控制器。GENI促进了真实世界的实验，而FIND支持利用SDN的新互联网架构。POMI将SDN研究扩展到移动网络和可编程转发平面。\n\n与此同时，超大规模云公司（谷歌、微软、亚马逊、Facebook）为其庞大的数据中心寻求具有成本效益且可控的网络解决方案。SDN实现了多租户环境的网络虚拟化（以Nicira的NVP和Open vSwitch为首）和广域流量工程（谷歌的B4骨干网）。这种商业应用进一步刺激了学术研究和成功的SDN初创公司的诞生。\n\nSDN的成功将控制权从网络供应商转移到软件程序员手中，从而实现了更大的灵活性、更快的创新和正式的网络验证。虽然最初专注于数据中心，但SDN原则现在在各种网络中普遍存在。本文强调了NSF在资助早期研究和促进与产业界合作方面的远见卓识，从而引发了网络架构的一场革命。"
  },
  {
    "id": "45742907",
    "title": "Who needs Graphviz when you can build it yourself?",
    "url": "https://spidermonkey.dev/blog/2025/10/28/iongraph-web.html",
    "summary": "This article details the creation of `iongraph`, a custom tool for visualizing SpiderMonkey's Ion compiler graphs, developed due to dissatisfaction with existing tools like Graphviz. The author found Graphviz output unstable and lacking intuitive connection to the source code. The article presents a simplified Sugiyama layout algorithm adapted to leverage the specific properties of control flow graphs: limited cycles from loops and reducible control flow.\n\nThe algorithm is broken down into four main steps: **Layering**, which sorts blocks into horizontal tracks based on depth and loop structure to mimic source code order; **Creating dummy nodes** to route edges across layers, placing downward dummies left and upward dummies right for consistent visual flow; **Straightening edges** through iterative passes that align nodes and dummy nodes, \"indent\" loops, and reduce wobbliness; and **Tracking horizontal edges**, which sorts edges into parallel tracks to prevent visual overlap, recording the total track height for final layout.\n\nKey improvements over Graphviz include stable layouts (minimizing changes between compiler passes) and intuitive node placement reflecting code structure. The algorithm avoids complex parts of the Sugiyama algorithm (like crossing minimization) to prioritize stability and efficiency. The interactive demo (available on desktop) allows users to experiment with the graph visualization. The initial implementation was remarkably concise (around 1000 lines of Javascript) and optimized for compiler graph visualization.\n",
    "chinese_title": "谁还需要Graphviz，自己就能建一个？",
    "chinese_summary": "本文详细介绍了`iongraph`的创建过程，这是一个用于可视化SpiderMonkey的Ion编译器图的自定义工具。开发该工具的原因是对现有工具（如Graphviz）的不满。作者发现Graphviz的输出不稳定，且与源代码的直观连接不足。本文介绍了一种简化的Sugiyama布局算法，该算法经过调整，可以利用控制流图的特定属性：来自循环的有限循环和可约控制流。\n\n该算法分为四个主要步骤：**分层**，根据深度和循环结构将块排序到水平轨道中，以模仿源代码的顺序；**创建虚拟节点**，用于跨层路由边，将向下虚拟节点放置在左侧，向上虚拟节点放置在右侧，以实现一致的视觉流；**拉直边**，通过迭代过程对齐节点和虚拟节点，“缩进”循环并减少摆动；以及**跟踪水平边**，将边排序到并行轨道中以防止视觉重叠，并记录总轨道高度以进行最终布局。\n\n与Graphviz相比，主要改进包括稳定的布局（最大限度地减少编译器传递之间的更改）和反映代码结构的直观节点放置。该算法避免了Sugiyama算法的复杂部分（例如交叉最小化），以优先考虑稳定性和效率。交互式演示（可在桌面上使用）允许用户试验图形可视化。最初的实现非常简洁（大约1000行Javascript代码），并针对编译器图可视化进行了优化。"
  },
  {
    "id": "45722471",
    "title": "More than DNS: Learnings from the 14 hour AWS outage",
    "url": "https://thundergolfer.com/blog/aws-us-east-1-outage-oct20",
    "summary": "This article analyzes the 14-hour AWS us-east-1 outage on October 20th, focusing on the interconnected failures of DynamoDB, EC2, and NLB. The author, who experienced the outage firsthand, argues against simplistic explanations like \"brain drain\" or inherent cloud unreliability.\n\nThe outage began with a latent Time-of-Check-Time-of-Use (TOCTOU) race condition in DynamoDB's DNS management system, resulting in an incorrect empty DNS record. This caused a cascade of failures as EC2, which relies on DynamoDB for its DropletWorkflow Manager (DWFM), lost control of its physical servers. The DWFM, overwhelmed by a massive number of broken leases, entered a congestive collapse requiring manual intervention. Finally, NLB experienced issues due to EC2's Network Manager falling behind, leading to bad feedback in the healthcheck system and incorrect AZ failovers.\n\nThe author emphasizes that the failure was a result of multiple interacting factors rather than a single \"root cause,\" advocating for a control systems analysis that considers latency, garbage collection, guarding mechanisms, state corruption, alerting, and human operation. He highlights the importance of understanding metastable failure states, which EC2 experienced, and the potential for bad feedback loops in healthcheck systems. The article concludes that despite AWS's generally excellent reliability, the incident demonstrates the ongoing challenges in designing, implementing, and operating complex production systems.\n",
    "chinese_title": "超越DNS：从AWS 14小时中断事件中汲取的经验",
    "chinese_summary": "本文分析了 10 月 20 日 AWS us-east-1 区域发生的 14 小时中断事件，重点关注 DynamoDB、EC2 和 NLB 之间相互关联的故障。作者亲身经历了这次中断，并反对诸如“人才流失”或云固有的不可靠性之类的简单解释。\n\n此次中断始于 DynamoDB 的 DNS 管理系统中潜在的“检查时间到使用时间” (TOCTOU) 竞争条件，导致错误的空 DNS 记录。这引发了一系列连锁故障，因为 EC2 依赖 DynamoDB 的 DropletWorkflow Manager (DWFM)，因此失去了对其物理服务器的控制。DWFM 被大量损坏的租约淹没，进入拥塞崩溃状态，需要人工干预。最后，NLB 由于 EC2 的网络管理器滞后而出现问题，导致健康检查系统中出现不良反馈以及错误的 AZ 故障转移。\n\n作者强调，这次故障是多个相互作用因素的结果，而不是单一的“根本原因”，并倡导采用控制系统分析方法，考虑延迟、垃圾回收、保护机制、状态损坏、警报和人工操作。他强调了理解亚稳态故障状态（EC2 经历的）的重要性，以及健康检查系统中不良反馈回路的潜力。文章的结论是，尽管 AWS 的可靠性总体上非常出色，但该事件表明在设计、实施和运营复杂的生产系统方面仍然存在挑战。"
  },
  {
    "id": "45750995",
    "title": "Extropic is building thermodynamic computing hardware",
    "url": "https://extropic.ai/",
    "summary": "This short title and content excerpt announce that Extropic is developing thermodynamic computing hardware, specifically showcased in a launch video titled \"Thermodynamic Computing: From 0 to 1\" released on October 30th, 2025. The key takeaway is that Extropic is venturing into the realm of thermodynamic computing, implying a departure from traditional CMOS-based computing.\n\nThermodynamic computing leverages principles of thermodynamics to perform computations, potentially offering advantages in energy efficiency and novel computational architectures. The \"0 to 1\" likely refers to the initial stages of development and the potential for significant advancements in this field.\n\nWithout further information, it is impossible to provide more specific details about the hardware being developed, the target applications, or the underlying thermodynamic principles being utilized. However, the announcement positions Extropic as a player in the emerging field of thermodynamic computing, aiming to build physical hardware solutions.\n",
    "chinese_title": "Extropic正在构建热力学计算硬件。",
    "chinese_summary": "Extropic开发热力学计算硬件，发布\"热力学计算：从0到1\"启动视频。这意味着Extropic正在进军热力学计算领域，或将突破传统CMOS计算的限制。热力学计算利用热力学原理进行计算，可能在能源效率和新型计算架构方面具有优势。\"从0到1\"可能指的是开发的初始阶段以及该领域取得重大进展的潜力。目前尚无法提供关于正在开发的硬件、目标应用或所利用的热力学原理的更多具体细节。该公告将Extropic定位为热力学计算这一新兴领域的参与者，致力于构建物理硬件解决方案。"
  },
  {
    "id": "45748725",
    "title": "Composer: Building a fast frontier model with RL",
    "url": "https://cursor.com/blog/composer",
    "summary": "生成摘要时出错",
    "chinese_title": "Composer：用强化学习构建快速前沿模型",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45742419",
    "title": "Tips for stroke-surviving software engineers",
    "url": "https://blog.j11y.io/2025-10-29_stroke_tips_for_engineers/",
    "summary": "This article provides practical advice for software engineers who have survived strokes, specifically hemorrhagic strokes in the parietal lobe with residual epilepsy. The author, a stroke survivor himself, emphasizes the importance of prioritizing health over performance and learning to manage cognitive demands.\n\nKey tips include:\n\n*   **Prioritize rest:** Recognize and respond to fatigue, fuzziness, nausea, or unusual sensations by stopping work and resting.\n*   **Control your environment:** Minimize distractions with headphones, blinders, and working from home when possible. Create escape routes for rest.\n*   **Advocate for yourself:** Utilize laws and employee assistance programs to protect yourself from unreasonable demands.\n*   **Single-thread your work:** Avoid context switching by batching tasks and completing one before starting another.\n*   **Externalize working memory:** Use notebooks, whiteboards, and AI tools like Gemini to offload information storage from your brain.\n*   **Optimize your schedule:** Tackle demanding tasks during peak performance times (e.g., mornings) and delegate less important tasks to other times.\n*   **Minimize attention demands:** Disable notifications and avoid synchronous communication (e.g., long meetings) where possible.\n*   **Understand the neurological basis:** The author includes research showing how the parietal and frontal cortices are heavily involved in demanding cognitive tasks and that damage can impact the ability to handle cognitive load.\n\nThe author acknowledges the difficulty of implementing these changes and encourages readers to be patient with themselves while learning to navigate their new normal.\n",
    "chinese_title": "中风幸存软件工程师的建议",
    "chinese_summary": "为中风（特别是顶叶出血性中风并伴有残留癫痫）幸存的软件工程师提供的实用建议。作者本人也是中风幸存者，强调健康优先于工作表现，并学习管理认知需求的重要性。\n\n关键提示包括：\n\n*   **优先休息：** 一旦感到疲劳、思维模糊、恶心或不寻常的感觉，立即停止工作并休息。\n*   **控制你的环境：** 尽量使用耳机、眼罩并在家工作，以减少干扰。创建休息的退路。\n*   **为自己争取权益：** 利用法律和员工援助计划，保护自己免受不合理的要求。\n*   **单线程工作：** 通过批量处理任务并在开始下一个任务之前完成一个任务，避免上下文切换。\n*   **外部化工作记忆：** 使用笔记本、白板和像Gemini这样的AI工具，将信息存储从大脑中卸载出来。\n*   **优化你的日程：** 在表现最佳的时间（例如上午）处理要求高的任务，并将不太重要的任务委托给其他时间。\n*   **最小化注意力需求：** 尽可能禁用通知并避免同步沟通（例如长时间的会议）。\n*   **了解神经学基础：** 作者引用研究表明，顶叶和额叶皮层大量参与要求高的认知任务，而损伤会影响处理认知负荷的能力。\n\n作者承认实施这些改变的困难，并鼓励读者在学习适应新常态时对自己保持耐心。"
  },
  {
    "id": "45759649",
    "title": "Estimating the Perceived 'Claustrophobia' of New York City's Streets (2024)",
    "url": "http://mfranchi.net/posts/claustrophobic-streets/",
    "summary": "This article details the creation of a \"claustrophobia\" metric for New York City sidewalks, defined as a measure of crowdedness encompassing both pedestrian traffic and stationary clutter. The author aims to quantify the feeling of being cramped within the urban environment.\n\nThe methodology involves several steps: segmenting NYC OpenData's sidewalk geometries using the Shapely library and segmenting them into 50-foot increments. Clutter identification involved on-the-ground surveys matched with NYC OpenData datasets, with each clutter type (e.g., bus stops, trash cans, trees) assigned a weight reflecting its perceived space occupation. Pedestrian traffic data was derived from Nexar dashcam images, analyzed using YOLOv7-E6E object detection to count pedestrians and normalized by sidewalk width.\n\nLimitations include missing data streams for clutter types like sidewalk dining and imprecise data for elements like scaffolding, relying on building permits to estimate their coverage area.\n\nThe resulting \"claustrophobia\" scores are visualized at the Neighborhood Tabulation Area (NTA) and Census Tract (CT) levels. Maps show high claustrophobia in Midtown Manhattan, Jackson Heights, Flushing, Downtown Brooklyn, and Williamsburg. Staten Island exhibits lower levels. The article concludes by providing the top and bottom 20 neighborhoods ranked by claustrophobia and encourages readers to explore additional visualizations and data on the project's GitHub repository.\n",
    "chinese_title": "评估纽约市街道的感知“幽闭恐惧症”（2024）",
    "chinese_summary": "本文详细介绍了纽约市人行道“幽闭恐惧症”指标的创建，该指标定义为衡量拥挤程度的指标，包括行人和静态杂物。作者旨在量化在城市环境中感到局促的感觉。\n\n该方法包括几个步骤：使用Shapely库分割纽约市开放数据的行人道几何形状，并将其分割成50英尺的增量。杂物识别涉及实地调查与纽约市开放数据集的匹配，每种杂物类型（例如，公交车站、垃圾桶、树木）都被赋予一个权重，以反映其感知的空间占用。行人流量数据来自Nexar行车记录仪图像，使用YOLOv7-E6E目标检测进行分析以计算行人数量，并按人行道宽度进行标准化。\n\n局限性包括缺少人行道用餐等杂物类型的数据流，以及诸如脚手架等元素的不精确数据，依赖建筑许可证来估计其覆盖面积。\n\n最终的“幽闭恐惧症”得分在社区统计区域（NTA）和人口普查区（CT）级别上进行可视化。地图显示曼哈顿中城、杰克逊高地、法拉盛、布鲁克林市中心和威廉斯堡的幽闭恐惧症程度较高。史泰登岛的水平较低。本文最后提供了按幽闭恐惧症程度排名的前20名和后20名社区，并鼓励读者浏览项目GitHub存储库上的其他可视化和数据。"
  },
  {
    "id": "45746401",
    "title": "Grammarly rebrands to 'Superhuman,' launches a new AI assistant",
    "url": "https://techcrunch.com/2025/10/29/grammarly-rebrands-to-superhuman-launches-a-new-ai-assistant/",
    "summary": "Grammarly is rebranding itself to \"Superhuman\" after acquiring the email client of the same name. The core Grammarly product will retain its name, but other acquired products like Coda may be rebranded in the future.\n\nThe company is also launching \"Superhuman Go,\" an AI assistant integrated into the Grammarly extension. This assistant provides writing suggestions, email feedback, and connects with apps like Jira, Gmail, Google Drive, and Google Calendar to automate tasks like logging tickets or scheduling meetings. Future plans include enabling the assistant to fetch data from CRMs and internal systems to improve email suggestions.\n\nSuperhuman Go is available to all Grammarly users via a toggle in the extension, along with access to an agent store featuring tools like a plagiarism checker and proofreader. Grammarly is also offering product bundles, including a Pro subscription for $12/month (billed annually) with multi-language support and a Business plan for $33/month (billed annually) that includes Superhuman Mail.\n\nThe company aims to integrate AI features into Coda and Superhuman email clients, automatically fetching details from external and internal sources to enhance documents and email drafts. This move is part of Grammarly's broader strategy to become a more comprehensive productivity suite, positioning it to compete with companies like Notion and Google Workspace. The announcement coincides with TechCrunch Disrupt 2025.\n",
    "chinese_title": "Grammarly更名为“Superhuman”，推出全新AI助手",
    "chinese_summary": "在收购同名邮件客户端后，Grammarly 正将其品牌重塑为“Superhuman”。核心 Grammarly 产品将保留其名称，但其他收购的产品（如 Coda）未来可能会被重新命名。\n\n该公司还推出了 \"Superhuman Go\"，这是一款集成到 Grammarly 扩展中的人工智能助手。该助手提供写作建议、电子邮件反馈，并与 Jira、Gmail、Google Drive 和 Google Calendar 等应用程序连接，以自动化诸如记录工单或安排会议等任务。未来的计划包括使该助手能够从 CRM 和内部系统获取数据，以改进电子邮件建议。\n\n所有 Grammarly 用户都可以通过扩展中的切换按钮使用 Superhuman Go，并访问包含剽窃检查器和校对员等工具的代理商店。Grammarly 还提供产品捆绑包，包括每月 12 美元（按年计费）的 Pro 订阅，提供多语言支持；以及每月 33 美元（按年计费）的 Business 计划，其中包括 Superhuman Mail。\n\n该公司旨在将人工智能功能集成到 Coda 和 Superhuman 邮件客户端中，自动从外部和内部来源获取详细信息，以增强文档和电子邮件草稿。此举是 Grammarly 成为更全面的生产力套件的更广泛战略的一部分，使其能够与 Notion 和 Google Workspace 等公司竞争。该公告恰逢 TechCrunch Disrupt 2025 大会。"
  },
  {
    "id": "45742446",
    "title": "uBlock Origin Lite in Apple App Store",
    "url": "https://apps.apple.com/in/app/ublock-origin-lite/id6745342698",
    "summary": "uBlock Origin Lite (uBOL), a content blocker, is now available on the Apple App Store. Developed by Raymond Hill, uBOL uses a declarative approach, minimizing resource consumption by relying on the browser for filtering. The extension's service worker only runs when users interact with the popup panel or options page.\n\nThe app comes with uBlock Origin's default filter lists, including uBlock Origin's built-in filters, EasyList, EasyPrivacy, and Peter Lowe’s Ad and tracking server list. Users can enable additional rulesets through the options page.\n\nThe app has received positive reviews, with users praising its availability on iPadOS and Safari integration. Reviewers specifically mention the improved battery performance compared to the initial TestFlight version, and while customization with own lists is not possible, users are happy with the default filter lists.\n\nAccording to the App Privacy section, the developer does not collect any data from the app. The app is compatible with iPhone (iOS 18.5+), iPad (iPadOS 18.5+), Mac (macOS 13.5+), and Apple Vision (visionOS 2.5+). It is free to download and use.\n",
    "chinese_title": "Apple App Store 上的 uBlock Origin Lite",
    "chinese_summary": "uBlock Origin Lite (uBOL)，内容拦截器，现已在 Apple App Store 上架。uBOL 由 Raymond Hill 开发，采用声明式方法，依靠浏览器进行过滤，从而最大限度地减少资源消耗。该扩展的服务工作线程仅在用户与弹出面板或选项页面交互时运行。\n\n该应用自带 uBlock Origin 的默认过滤列表，包括 uBlock Origin 的内置过滤器、EasyList、EasyPrivacy 和 Peter Lowe 的广告和跟踪服务器列表。用户可以通过选项页面启用额外的规则集。\n\n该应用获得了积极评价，用户称赞其在 iPadOS 上的可用性和 Safari 集成。评论员特别提到，与最初的 TestFlight 版本相比，电池性能有所提升。虽然无法使用自己的列表进行自定义，但用户对默认过滤列表感到满意。\n\n根据 App 隐私部分显示，开发者不收集任何来自该应用的数据。该应用兼容 iPhone (iOS 18.5+)、iPad (iPadOS 18.5+)、Mac (macOS 13.5+) 和 Apple Vision (visionOS 2.5+)。 它是免费下载和使用的。"
  },
  {
    "id": "45761190",
    "title": "Firefox expands its Recommended Extensions program",
    "url": "https://blog.mozilla.org/addons/2025/10/29/new-recommended-extensions-arrived-thanks-to-our-community-curators/",
    "summary": "Firefox has expanded its Recommended Extensions program, adding several new extensions that meet high standards for security, functionality, and user experience. These extensions were selected through a community-driven curatorial project.\n\nThe newly recommended extensions include:\n\n*   **Yomitan:** A dictionary extension for language learning.\n*   **Power Thesaurus:** A tool providing synonyms and antonyms.\n*   **PhotoShow:** Allows users to enlarge and download images on websites.\n*   **Simple Gesture for Android:** Adds touch gestures for navigation and tab management on Android.\n*   **Immersive Translate:** Translates across various media, including web pages, PDFs, ebooks, and video subtitles.\n*   **Time Tracker:** Monitors website usage and allows blocking of time-wasting sites.\n*   **Checker Plus for Gmail:** Manages Gmail directly from the Firefox toolbar.\n*   **YouTube Search Fixer:** De-clutters the YouTube interface by removing distracting features.\n*   **Notefox:** Enables users to leave notes on websites.\n*   **Sink It for Reddit:** Improves the Reddit experience with features like color-coded comments and dark mode.\n*   **Raindrop.io:** A tool for saving and organizing web content.\n*   **Show Video Controls for Firefox:** Enables video controls for WebM videos.\n*   **Chrome Mask:** Masks Firefox as Chrome for websites that block or don't support Firefox.\n\nThe article also thanks the developers and the Firefox Recommended Extensions Advisory Board for their contributions. Firefox plans another curatorial project in 2026 and encourages developers and users to nominate extensions.\n",
    "chinese_title": "Firefox 扩展其推荐扩展程序",
    "chinese_summary": "Firefox扩展了其推荐扩展程序计划，新增了多款符合安全、功能和用户体验高标准的扩展。这些扩展是通过社区驱动的策展项目选出的。\n\n新推荐的扩展包括：\n\n*   **Yomitan：** 一款用于语言学习的词典扩展。\n*   **Power Thesaurus：** 一款提供同义词和反义词的工具。\n*   **PhotoShow：** 允许用户放大和下载网站上的图片。\n*   **Simple Gesture for Android：** 为安卓设备添加触摸手势，用于导航和标签页管理。\n*   **Immersive Translate：** 翻译各种媒体内容，包括网页、PDF、电子书和视频字幕。\n*   **Time Tracker：** 监控网站使用情况并允许屏蔽浪费时间的网站。\n*   **Checker Plus for Gmail：** 直接从 Firefox 工具栏管理 Gmail。\n*   **YouTube Search Fixer：** 通过移除干扰功能来简化 YouTube 界面。\n*   **Notefox：** 允许用户在网站上留下笔记。\n*   **Sink It for Reddit：** 通过彩色编码的评论和暗黑模式等功能改善 Reddit 体验。\n*   **Raindrop.io：** 一款用于保存和组织网络内容的工具。\n*   **Show Video Controls for Firefox：** 为 WebM 视频启用视频控制。\n*   **Chrome Mask：** 将 Firefox 伪装成 Chrome，以访问屏蔽或不支持 Firefox 的网站。\n\n文章还感谢了开发者和 Firefox 推荐扩展顾问委员会的贡献。Firefox 计划在 2026 年进行另一次策展项目，并鼓励开发者和用户提名扩展。"
  },
  {
    "id": "45747112",
    "title": "I made a 10¢ MCU Talk",
    "url": "https://www.atomic14.com/2025/10/29/CH32V003-talking",
    "summary": "This article details how the author squeezed audio playback and speech synthesis onto a very cheap (10-cent) CH32V003 microcontroller with only 16KB of flash memory and 2KB of RAM.\n\nFirst, they tackled playing audio by using the MCU's PWM output as a rudimentary DAC. Due to the limited flash, aggressive audio compression was necessary. Experimenting with different compression formats, they settled on 2-bit ADPCM, which allowed them to store about 7 seconds of audio. They even created a WAV-to-2-bit-ADPCM converter to simplify the process.\n\nNext, they explored LPC speech synthesis using the \"Talkie\" library, which models the human voice and requires far less storage than sampled audio. This allowed them to fit a large vocabulary of words and phrases within the limited memory. To generate custom LPC data from their own voice, they experimented with existing tools and ultimately created a streamlined online tool to convert audio recordings to LPC format.\n\nThe article concludes by highlighting the capabilities of the cheap MCU for both audio playback (using 2-bit ADPCM) and speech synthesis (using the Talkie LPC library). The author also shares a link to their GitHub repository containing the code.\n",
    "chinese_title": "十分钱的MCU演讲",
    "chinese_summary": "本文详细介绍了作者如何将音频播放和语音合成功能移植到一款非常廉价（10美分）的CH32V003微控制器上，该微控制器仅有16KB闪存和2KB内存。\n\n首先，他们利用MCU的PWM输出来实现基本的DAC功能，从而解决了音频播放问题。由于闪存容量有限，必须采用激进的音频压缩技术。经过对不同压缩格式的试验，他们最终选择了2位ADPCM，这使他们能够存储大约7秒的音频。他们甚至创建了一个WAV到2位ADPCM的转换器来简化该过程。\n\n接下来，他们探索了使用“Talkie”库的LPC语音合成技术，该技术对人声进行建模，并且比采样音频所需的存储空间要少得多。这使得他们能够在有限的内存中容纳大量的单词和短语。为了从他们自己的声音生成自定义LPC数据，他们尝试了现有工具，并最终创建了一个简化的在线工具，可以将录音转换为LPC格式。\n\n文章最后强调了这款廉价MCU在音频播放（使用2位ADPCM）和语音合成（使用Talkie LPC库）方面的强大功能。作者还分享了他们的GitHub存储库链接，其中包含代码。"
  },
  {
    "id": "45703059",
    "title": "Iommi – your first pick for a Django power chord",
    "url": "https://iommi.rocks/",
    "summary": "This article introduces Iommi, presented as a superior alternative to Django's built-in forms. Iommi aims to simplify form creation and management, especially for complex scenarios and scalable applications.\n\nKey advantages highlighted include:\n\n*   **Scalability:** Iommi is designed to handle the complexities of large-scale applications, unlike Django's forms which might require more \"glue code\" for similar functionality.\n*   **Familiar API with Smarter Defaults:** Iommi maintains a similar API to Django forms, making it easy for Django developers to learn, while incorporating better default settings for improved out-of-the-box functionality.\n*   **Great HTML by Default & Design System Integration:** Iommi generates high-quality HTML that can integrate seamlessly with existing design systems, likely reducing the need for extensive custom HTML templating.\n*   **Auto-generation from Models:** Iommi can automatically generate forms directly from Django models using `include/exclude` options for precise field selection.\n*   **Enhanced Foreign Key Widgets:** Features asynchronous search functionality within foreign key widgets.\n*   **Cross-object Field Paths:** Leverages Django's familiar double-underscore notation for navigating related models and accessing fields.\n\nIn essence, Iommi promises a more powerful, efficient, and integrated approach to building forms in Django, offering a smoother experience and better results, especially in projects requiring sophisticated form handling and scalability.\n",
    "chinese_title": "Iommi——Django和弦的首选",
    "chinese_summary": "本文介绍 Iommi，它被认为是 Django 内置表单的更优替代方案。Iommi 旨在简化表单的创建和管理，尤其适用于复杂场景和可扩展应用程序。\n\n重点突出的主要优势包括：\n\n*   **可扩展性：** Iommi 旨在处理大规模应用程序的复杂性，而 Django 表单可能需要更多的“胶水代码”才能实现类似的功能。\n*   **熟悉的 API 与更智能的默认值：** Iommi 保持了与 Django 表单相似的 API，使 Django 开发人员能够轻松学习，同时融入了更好的默认设置，从而改进了开箱即用的功能。\n*   **默认情况下出色的 HTML 和设计系统集成：** Iommi 生成高质量的 HTML，可以与现有设计系统无缝集成，从而可能减少对大量自定义 HTML 模板的需求。\n*   **从模型自动生成：** Iommi 可以使用 `include/exclude` 选项直接从 Django 模型自动生成表单，以实现精确的字段选择。\n*   **增强的外键部件：** 在外键部件中具有异步搜索功能。\n*   **跨对象字段路径：** 利用 Django 熟悉的双下划线表示法来导航相关模型和访问字段。\n\n本质上，Iommi 承诺在 Django 中构建表单时采用更强大、高效和集成的方法，尤其是在需要复杂的表单处理和可扩展性的项目中，提供更流畅的体验和更好的结果。"
  },
  {
    "id": "45754509",
    "title": "Crunchyroll is destroying its subtitles",
    "url": "https://daiz.moe/crunchyroll-is-destroying-its-subtitles-for-no-good-reason/",
    "summary": "This article argues that Crunchyroll is downgrading its subtitle quality, specifically in its handling of on-screen text translation (typesetting), for no good reason. The author highlights a noticeable decline in subtitle presentation from Summer 2025 to Fall 2025, with the newer subtitles lacking the stylized positioning and clear separation between dialogue and on-screen text translations seen previously.\n\nThe article points out that while low-quality subtitles aren't new on Crunchyroll (due to third-party licensors), it's now affecting first-party subtitles. This is a major issue because anime heavily relies on on-screen text, demanding proper overlaps, positioning, fonts, colors, and animations for effective localization (typesetting).\n\nThe author believes that Crunchyroll's move to simplify subtitles stems from the need to comply with the lower subtitling standards of general streaming services like Netflix and Amazon Prime Video, to which Crunchyroll sublicenses its anime. These platforms often restrict on-screen text and lack advanced formatting tools.\n\nThe article then dives into Crunchyroll's history, noting its origins as a pirate site that transitioned to a legitimate streaming service in 2009. It emphasizes Crunchyroll's early decision to use the fansubber standard of Aegisub and the ASS subtitle format, which led to the development of custom subtitle renderers, eventually incorporating features like overlaps and positioning. The move to HTML5 and WebAssembly allowed for further enhancements. The author implies this rich history and expertise is being sacrificed for the sake of compatibility with other streaming platforms.\n",
    "chinese_title": "Crunchyroll 正在毁掉它的字幕。",
    "chinese_summary": "本文认为，Crunchyroll正在降低其字幕质量，特别是在屏幕文字翻译（排版）的处理上，而且没有任何正当理由。作者强调，从2025年夏季到2025年秋季，字幕呈现效果明显下降，与之前相比，较新的字幕缺乏风格化的定位，以及对话与屏幕文字翻译之间的清晰区分。\n\n文章指出，虽然低质量字幕在Crunchyroll上并非新鲜事（由于第三方授权方），但现在却影响到了第一方字幕。这是一个主要问题，因为动漫非常依赖屏幕文字，需要适当的重叠、定位、字体、颜色和动画来实现有效的本地化（排版）。\n\n作者认为，Crunchyroll简化字幕的做法源于需要遵守Netflix和亚马逊Prime Video等普通流媒体服务较低的字幕标准，Crunchyroll将其动漫转授权给这些平台。这些平台通常限制屏幕文字，并且缺乏高级格式化工具。\n\n文章随后深入探讨了Crunchyroll的历史，指出它最初是一个盗版网站，于2009年转型为合法的流媒体服务。它强调了Crunchyroll早期决定使用粉丝字幕组的Aegisub标准和ASS字幕格式，这导致了定制字幕渲染器的开发，最终融合了重叠和定位等功能。转向HTML5和WebAssembly使得进一步的增强成为可能。作者暗示，为了与其他流媒体平台兼容，这种丰富的历史和专业知识正在被牺牲。"
  },
  {
    "id": "45745281",
    "title": "AWS to bare metal two years later: Answering your questions about leaving AWS",
    "url": "https://oneuptime.com/blog/post/2025-10-29-aws-to-bare-metal-two-years-later/view",
    "summary": "In 2023, OneUptime shared their move from AWS to bare metal, saving $230,000/year. This article addresses common questions raised after that post, providing a two-year update and deeper dive into the decision.\n\nNow saving over $1.2M/year, OneUptime justifies their choice despite Savings Plans/Reserved Instances by highlighting savings across S3, egress, EKS, and NAT gateways. Migration required about a week of engineering time, and ongoing maintenance averages 24 engineer-hours per quarter, comparable to AWS cost optimization efforts.\n\nAddressing the \"single point of failure\" concern, they've added a second rack in Frankfurt with redundant networking, mirroring Ceph pools, and isolated out-of-band management. Failover to their old AWS cluster is rehearsed quarterly using Anycast ingress via BGP for sub-minute traffic shifting.\n\nHardware is amortized over five years, with plans to cascade older hardware into their analytics cluster. Extended warranties and cold spares mitigate hardware failure risks.\n\nDespite the move, OneUptime still leverages AWS for Glacier backups, CloudFront for edge caching, and short-lived load testing environments, emphasizing that cloud is best for elasticity while bare metal excels for baseload. They maintain SOC 2 Type II and ISO 27001 certifications, adapting processes for physical colo controls and change management. The company concludes with insights into ongoing maintenance, future plans to share tooling, and a list of situations where remaining on cloud is advantageous.\n",
    "chinese_title": "两年后从AWS到裸金属：解答您关于离开AWS的疑问",
    "chinese_summary": "2023年，OneUptime分享了他们从AWS迁移到裸金属服务器的经验，每年节省23万美元。本文旨在解答该文章发布后常见的问题，提供两年的更新，并深入探讨该决策。\n\n现在每年节省超过120万美元，OneUptime通过强调S3、出口流量、EKS和NAT网关的节省，证明了他们选择的合理性，即使有Savings Plans/Reserved Instances也是如此。迁移大约需要一周的工程时间，而持续维护平均每季度花费24个工程师工时，与AWS的成本优化工作量相当。\n\n为了解决“单点故障”问题，他们在法兰克福增加了第二个机架，配备冗余网络、镜像Ceph池和隔离的带外管理。使用Anycast入口通过BGP进行每季度演练故障转移到他们旧的AWS集群，可在亚分钟级别进行流量转移。\n\n硬件摊销期为五年，并计划将旧硬件级联到其分析集群中。延长保修期和冷备件可以降低硬件故障风险。\n\n尽管进行了迁移，OneUptime仍然利用AWS的Glacier进行备份，CloudFront进行边缘缓存，以及短期负载测试环境，强调云最适合弹性需求，而裸金属服务器最适合基础负载。他们保持SOC 2 Type II和ISO 27001认证，并调整流程以适应物理数据中心控制和变更管理。该公司最后分享了关于持续维护的见解、未来共享工具的计划，以及列出了仍然适合使用云的情况。"
  },
  {
    "id": "45731848",
    "title": "Tailscale Services",
    "url": "https://tailscale.com/blog/services-beta",
    "summary": "Tailscale Services is a new feature that allows users to define and manage network resources with greater granularity and precision access control, even when Tailscale cannot be directly installed on the resource. It assigns virtual Tailscale IPv4 and IPv6 addresses (TailVIPs) and unique MagicDNS names to any reachable logical resource, making them a unit of policy for access control.\n\nKey benefits include simplified connectivity, precision access control, and automation via API. Tailscale Services can replace traditional load balancers with intelligent routing and availability mechanisms. Early users have employed it for various scenarios, including CI/CD pipelines, internal application access, and highly available secret stores.\n\nEach service consists of a TailVIP, MagicDNS name, endpoint definitions, and a set of advertising hosts. Services can be defined via API or the admin console. Service hosts must pass validations to be considered active, and users/devices need explicit grants to access a service via TailVIPs or MagicDNS name. The service leverages Tailscale's high availability options to intelligently route clients to available hosts, powered by Regional Routing.\n\nTailscale Services is in public beta and available on all plans. The company is planning future improvements like configuration audit logs, network flow logs, broader host destination options, more state validation, API integration for service host registration, and native integration with third-party proxies. Users can start defining services in the admin console or follow the documentation.\n",
    "chinese_title": "Tailscale服务",
    "chinese_summary": "Tailscale 服务是一项新功能，允许用户以更精细的粒度和精确的访问控制来定义和管理网络资源，即使 Tailscale 无法直接安装在资源上。它为任何可访问的逻辑资源分配虚拟 Tailscale IPv4 和 IPv6 地址 (TailVIP) 和唯一的 MagicDNS 名称，使其成为访问控制的策略单元。\n\n主要优势包括简化连接、精确访问控制和通过 API 实现自动化。Tailscale 服务可以用智能路由和可用性机制取代传统的负载均衡器。早期用户已将其应用于各种场景，包括 CI/CD 管道、内部应用程序访问和高可用性的密钥存储。\n\n每个服务都包含一个 TailVIP、MagicDNS 名称、端点定义和一组广告主机。可以通过 API 或管理控制台定义服务。服务主机必须通过验证才能被视为活动状态，并且用户/设备需要显式授权才能通过 TailVIP 或 MagicDNS 名称访问服务。该服务利用 Tailscale 的高可用性选项，通过区域路由智能地将客户端路由到可用的主机。\n\nTailscale 服务目前处于公开 Beta 阶段，适用于所有计划。该公司计划未来改进，例如配置审计日志、网络流日志、更广泛的主机目标选项、更多状态验证、用于服务主机注册的 API 集成以及与第三方代理的本机集成。用户可以在管理控制台中开始定义服务，或遵循文档。"
  },
  {
    "id": "45751995",
    "title": "How to Obsessively Tune WezTerm",
    "url": "https://rashil2000.me/blogs/tune-wezterm",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "如何沉迷式地调整 WezTerm",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "45736426",
    "title": "Cancer survival rates are misleading",
    "url": "https://www.allendowney.com/blog/2025/10/27/cancer-survival-rates-are-misleading/",
    "summary": "This article argues that 5-year cancer survival rates are often misleading and shouldn't be the sole basis for conclusions about screening effectiveness or treatment advancements. The author challenges four common incorrect inferences:\n\n1.  **Individual Survival Probability:** A 91% 5-year survival rate after early diagnosis doesn't guarantee a 91% chance of survival for a specific patient. Factors like overall health, age, and detection method significantly influence individual outcomes. Tumors detected through screening are often slow-growing, skewing survival rates.\n\n2.  **Screening Benefits:** Higher survival rates with early detection don't automatically justify increased screening. Screening is only beneficial if it catches cancers that would otherwise be fatal, treatments are effective, and benefits outweigh the costs of screening (false positives and overdiagnosis). The article presents a Markov model demonstrating that high survival rates can occur even with ineffective treatments.\n\n3.  **Counterfactual Survival:** Attributing a patient's death to late detection and assuming earlier detection would have ensured survival is flawed. Survival tables don't account for tumors that wouldn't have been fatal even without treatment. The hypothetical earlier diagnosis also necessitates considering longer-term survival rates beyond the initial 5-year window.\n\n4.  **Treatment Improvement:** Increased 5-year survival rates over time don't automatically indicate better treatments. More screening and more sensitive detection methods also inflate survival rates by catching slow-growing cancers or overdiagnosing benign conditions.\n\nThe article emphasizes that only reduced mortality rates can definitively prove the effectiveness of screening. Relying solely on 5-year survival rates can lead to inaccurate conclusions about cancer treatment and screening efficacy.\n",
    "chinese_title": "癌症生存率具有误导性",
    "chinese_summary": "本文认为，五年癌症生存率常常具有误导性，不应作为评估筛查有效性或治疗进展的唯一依据。作者对四种常见的错误推断提出了质疑：\n\n1.  **个体生存概率：** 早期诊断后91%的五年生存率并不能保证特定患者有91%的生存机会。 整体健康状况、年龄和检测方法等因素会显著影响个体结果。 通过筛查发现的肿瘤通常生长缓慢，这会扭曲生存率。\n\n2.  **筛查益处：** 早期发现的较高生存率并不能自动证明增加筛查的合理性。 只有当筛查能够发现原本会致命的癌症，且治疗有效，并且收益超过筛查的成本（假阳性和过度诊断）时，筛查才有益处。 本文提出了一个马尔可夫模型，表明即使治疗无效也可能出现高生存率。\n\n3.  **反事实生存：** 将患者的死亡归因于延迟发现，并假设早期发现能够确保生存是存在缺陷的。 生存表没有考虑到即使不接受治疗也不会致命的肿瘤。 假设性的早期诊断也需要考虑超出初始五年窗口期的长期生存率。\n\n4.  **治疗改进：** 随着时间的推移，五年生存率的提高并不自动表明治疗效果更好。 更多的筛查和更敏感的检测方法也会通过发现生长缓慢的癌症或过度诊断良性疾病来提高生存率。\n\n本文强调，只有降低死亡率才能明确证明筛查的有效性。 仅仅依靠五年生存率可能会导致对癌症治疗和筛查效果的错误结论。"
  },
  {
    "id": "45684008",
    "title": "Video‐rate tunable colour electronic paper with human resolution",
    "url": "https://www.nature.com/articles/s41586-025-09642-3#MOESM1",
    "summary": "This article introduces \"retina E-paper,\" a novel electronic paper technology aimed at achieving ultra-high resolution displays suitable for immersive virtual reality. The technology utilizes electrically tunable metapixels consisting of WO3 nanodisks, which undergo a reversible insulator-to-metal transition upon electrochemical reduction, enabling precise control over reflectance and contrast at the nanoscale. These metapixels, reaching sizes of ~560 nm (exceeding 25,000 PPI), potentially match the visual resolution limit when the display size corresponds to the pupil diameter.\n\nUnlike emissive displays that suffer from brightness and uniformity issues at small pixel sizes, retina E-paper leverages ambient light, maintaining high optical contrast regardless of pixel size. By carefully controlling the dimensions and spacing of the WO3 nanodisks, the system can selectively reflect RGB colors and achieve full-color video capability (>25 Hz). The technology also demonstrates high reflectance (~80%), strong optical contrast (~50%), and low energy consumption (~0.5–1.7 mW cm–2).\n\nThe article highlights the design and characterization of the WO3 metapixels, demonstrating how varying nanodisk diameter and spacing allows for color tuning. It emphasizes the importance of optimizing subpixel arrangement for accurate color mixing due to interactions between adjacent pixels at ultra-high densities. The potential of retina E-paper is further demonstrated through the reconstruction of an anaglyph 3D image and a high-resolution reproduction of \"The Kiss\" by Gustav Klimt, showcasing its capabilities for virtual reality applications and full-color display performance.\n",
    "chinese_title": "视频速率可调彩色电子纸，具备人眼分辨率",
    "chinese_summary": "本文介绍了一种名为“视网膜电子纸”的新型电子纸技术，旨在实现适用于沉浸式虚拟现实的超高分辨率显示。该技术利用由WO3纳米盘组成的可电调超材料像素，这些纳米盘在电化学还原时经历可逆的绝缘体到金属的转变，从而能够精确控制纳米级的反射率和对比度。这些超材料像素尺寸约为 560 纳米（超过 25,000 PPI），可能与显示器尺寸对应于瞳孔直径时的视觉分辨率极限相匹配。\n\n与在小像素尺寸下存在亮度和均匀性问题的发光显示器不同，视网膜电子纸利用环境光，无论像素尺寸如何，都能保持高光学对比度。通过精确控制 WO3 纳米盘的尺寸和间距，该系统可以选择性地反射 RGB 颜色并实现全彩色视频功能（>25 Hz）。该技术还表现出高反射率（~80%）、强光学对比度（~50%）和低能耗（~0.5–1.7 mW cm–2）。\n\n本文重点介绍了 WO3 超材料像素的设计和特性，展示了如何通过改变纳米盘直径和间距来实现颜色调节。文章强调了优化子像素排列对于准确混色的重要性，因为超高密度下相邻像素之间存在相互作用。通过重构立体3D图像和高分辨率再现古斯塔夫·克里姆特的《吻》，进一步展示了视网膜电子纸的潜力，展示了其在虚拟现实应用和全彩色显示性能方面的能力。"
  },
  {
    "id": "45750501",
    "title": "Encoding x86 Instructions",
    "url": "https://www-user.tu-chemnitz.de/~heha/hs/chm/x86.chm/x86.htm",
    "summary": "This article delves into the intricate encoding of x86 instructions, highlighting its complexity as a CISC (Complex Instruction Set Computer) architecture. It outlines the general format, showing instructions can be up to 15 bytes long, including prefixes that modify instruction behavior.\n\nThe article details opcode sizes, specifically focusing on the ADD instruction and how bits within the opcode determine data transfer direction (d bit) and operand size (s bit). The MOD-REG-R/M byte is crucial for specifying operands and addressing modes, with the MOD field dictating the addressing mode, the REG field indicating the source or destination register, and the R/M field defining the second or single operand.\n\nAddressing modes include register indirect, displacement, and register addressing. The SIB (Scaled Index Byte) layout enables more complex addressing, scaling index registers by factors of 1, 2, 4, or 8. The article gives examples of encoding different ADD instructions using various addressing modes, demonstrating how the direction bit affects opcode choice.\n\nIt then explains encoding immediate operands, which have a unique format and the 'x' bit determining the size of the constant.  The REG field in the MOD-REG-R/M byte functions as an opcode extension.  Operand size prefixes (66h) are required to specify 16-bit operands in 32-bit programs.\n\nFinally, it covers instruction prefixes such as repeat/lock and segment override prefixes. Shorter encodings for common instructions like \"add al, constant\" are also discussed as a space-saving optimization.\n",
    "chinese_title": "x86指令编码",
    "chinese_summary": "本文深入探讨了x86指令的复杂编码，突显了其作为CISC（复杂指令集计算机）架构的复杂性。 它概述了通用格式，表明指令长度可达15字节，包括修改指令行为的前缀。\n\n本文详细介绍了操作码大小，特别关注ADD指令，以及操作码中的位如何确定数据传输方向（d位）和操作数大小（s位）。 MOD-REG-R/M字节对于指定操作数和寻址模式至关重要，其中MOD字段决定寻址模式，REG字段指示源或目标寄存器，R/M字段定义第二个或单个操作数。\n\n寻址模式包括寄存器间接寻址、位移寻址和寄存器寻址。 SIB（比例索引字节）布局支持更复杂的寻址，将索引寄存器按1、2、4或8的因子缩放。 本文给出了使用各种寻址模式编码不同ADD指令的示例，展示了方向位如何影响操作码的选择。\n\n然后，它解释了立即数操作数的编码，立即数操作数具有独特的格式，'x'位确定常量的大小。 MOD-REG-R/M字节中的REG字段充当操作码扩展。 操作数大小前缀（66h）是32位程序中指定16位操作数所必需的。\n\n最后，它涵盖了指令前缀，如repeat/lock和段覆盖前缀。 诸如“add al, constant”之类的常见指令的较短编码也作为节省空间的优化进行了讨论。"
  },
  {
    "id": "45745566",
    "title": "Show HN: Learn German with Games",
    "url": "https://www.learngermanwithgames.com/",
    "summary": "This \"Show HN\" post introduces a collection of games designed to help users learn German. The platform offers interactive learning through various games focused on different aspects of the language, including:\n\n*   **Numbers:** Games for converting numbers to words and vice versa, learning to tell time, and using short forms of time.\n*   **Nouns:** Games for mastering German articles (der, die, das) and translating nouns between German and English.\n*   **Verbs:** Games for practicing verb conjugation in the present tense and translating verbs between German and English.\n\nThe platform offers at least 10 games, has mobile-friendly design, and allows users to filter games based on their learning focus (verbs, nouns, numbers). The games are designed to be engaging and help build vocabulary and grammar skills in a fun and interactive way.\n",
    "chinese_title": "展示HN：用游戏学德语",
    "chinese_summary": "此“Show HN”帖子介绍了一系列旨在帮助用户学习德语的游戏。该平台通过各种游戏提供互动式学习，游戏侧重于语言的不同方面，包括：\n\n*   **数字：** 用于数字与文字相互转换、学习报时以及使用时间缩写形式的游戏。\n*   **名词：** 用于掌握德语冠词（der, die, das）以及德语和英语名词互译的游戏。\n*   **动词：** 用于练习现在时动词变位以及德语和英语动词互译的游戏。\n\n该平台提供至少 10 款游戏，采用适合移动设备的设计，并允许用户根据学习重点（动词、名词、数字）筛选游戏。这些游戏旨在引人入胜，并以有趣且互动的方式帮助构建词汇和语法技能。"
  },
  {
    "id": "45697234",
    "title": "State of Embedded: Q4 2025 Overview",
    "url": "https://sbcwiki.com/news/articles/state-of-embedded-q4-25/",
    "summary": "The Q4 2025 embedded Single Board Computer (SBC) market saw significant developments, driven by ARM-based System-on-Chips (SoCs) increasingly challenging x86 platforms.\n\n**Key Highlights:**\n\n*   **NVIDIA:** Released the DGX Spark powered by the GB10 Grace Blackwell Superchip, but Jetson software support was dropped. The rumored DGX Station with Blackwell Ultra GPU remains unconfirmed.\n*   **Qualcomm:** Launched the Snapdragon Oryon X2 (hitting 5GHz) and the Dragon Q6A SBC with mainline support, competing with Raspberry Pi. Unexpectedly acquired Arduino, introducing the Arduino UNO Q SBC with mainline support, aiming to disrupt the IoT/Edge computing market.\n*   **Rockchip:** Unveiled roadmaps for RK3688 and RK3668 SoCs with next-gen Arm Mali Magni GPUs. Kernel updates continued, and open-source efforts advanced, including Vulkan support for Mali G610.\n*   **MediaTek:** Focused on proper software support and upstream Linux integration for Genio and Kompanio SoCs. New laptops featuring the MT8196 (Kompanio Ultra 910) are now available.\n*   **Raspberry Pi:** Introduced the Raspberry Pi 500+, an upgraded Pi 500 built into a keyboard and featuring an M.2 socket.\n*   **CIX:** Saw more products using their CD8160 SoC (Radxa Orion O6N & OrangePi 6 Plus). Mainline device-tree support is progressing.\n*   **Texas Instruments:** Focused on automotive applications, with ongoing driver work for the Imagination BXS-4-64 GPU used in their devkits.\n*   **Other:** DENX, known for U-Boot, ceased operations. Synaptics is releasing a new SBC with Toradex using the Astra SL1680 SoC.\n\nThe report concludes that the ARM SBC ecosystem is thriving, fueled by open-source initiatives, AI NPUs, and software enhancements, posing a strong challenge to x86.\n",
    "chinese_title": "嵌入式状态：2025年第四季度概览",
    "chinese_summary": "2025年第四季度嵌入式单板计算机(SBC)市场出现重大进展，基于ARM的片上系统(SoC)正日益挑战x86平台。\n\n**主要亮点：**\n\n*   **英伟达：** 发布了由GB10 Grace Blackwell 超级芯片驱动的 DGX Spark，但 Jetson 软件支持被取消。传闻中搭载Blackwell Ultra GPU的DGX Station 仍未得到证实。\n*   **高通：** 推出了 Snapdragon Oryon X2 (主频达5GHz) 和支持主线支持的 Dragon Q6A SBC，与树莓派竞争。 意外收购Arduino，推出了支持主线支持的 Arduino UNO Q SBC，旨在颠覆IoT/边缘计算市场。\n*   **瑞芯微：** 公布了采用下一代Arm Mali Magni GPU的 RK3688 和 RK3668 SoC 的路线图。 内核更新持续进行，开源工作取得进展，包括 Mali G610 的 Vulkan 支持。\n*   **联发科：** 专注于 Genio 和 Kompanio SoC 的适当软件支持和上游 Linux 集成。 搭载 MT8196 (Kompanio Ultra 910) 的新款笔记本电脑现已上市。\n*   **树莓派：** 推出了 Raspberry Pi 500+，一款内置于键盘并具有 M.2 插槽的升级版 Pi 500。\n*   **CIX：** 看到更多产品使用他们的 CD8160 SoC (Radxa Orion O6N & OrangePi 6 Plus)。 主线设备树支持正在推进。\n*   **德州仪器：** 专注于汽车应用，并为其开发套件中使用的 Imagination BXS-4-64 GPU 进行持续的驱动程序开发。\n*   **其他：** 以 U-Boot 闻名的 DENX 停止运营。 Synaptics 正在发布一款新的SBC，与 Toradex 合作使用 Astra SL1680 SoC。\n\n报告总结说，ARM SBC 生态系统蓬勃发展，这得益于开源计划、AI NPU 和软件增强，对 x86 构成了强有力的挑战。"
  },
  {
    "id": "45749746",
    "title": "The Green Tea Garbage Collector",
    "url": "https://go.dev/blog/greenteagc",
    "summary": "This Go blog post introduces Green Tea, an experimental garbage collector (GC) included in Go 1.25 (enabled via `GOEXPERIMENT=greenteagc`). It aims to improve GC performance by reducing the time spent in the marking phase, which constitutes about 90% of the total GC cost.\n\nThe post begins by explaining the fundamentals of Go's mark-sweep garbage collection algorithm, which identifies reachable objects through a graph flood, marking them as visited and subsequently sweeping away unreachable objects. The problem is that the standard algorithm is inefficient, spending a significant amount of time stalled on accessing heap memory due to its irregular access patterns, which are exacerbated by modern CPU trends like NUMA and reduced memory bandwidth per core.\n\nGreen Tea addresses this problem with a simple yet effective core concept: working with pages instead of individual objects. This means that instead of adding individual objects to a worklist, pages are added to the worklist, and scanning happens per-page instead of per-object.  This leads to more predictable memory access patterns, improving cache utilization and reducing stalls. The blog provides a visual walkthrough showing how Green Tea would perform compared to the original algorithm.\n\nInitial results show significant improvements, with some workloads experiencing up to a 40% reduction in GC time. Green Tea is already in use at Google and is considered production-ready. The Go team plans to make it the default in Go 1.26, contingent on user feedback.\n",
    "chinese_title": "绿茶垃圾回收器",
    "chinese_summary": "Go 1.25实验性垃圾收集器Green Tea介绍\n\n此Go博客介绍了Green Tea，一个包含在Go 1.25中的实验性垃圾收集器 (通过 `GOEXPERIMENT=greenteagc` 启用)。它的目标是通过减少标记阶段所花费的时间来提高GC性能，标记阶段约占GC总成本的90%。\n\n文章首先解释了Go的标记-清除垃圾回收算法的基础知识，该算法通过图的洪泛识别可达对象，将其标记为已访问，然后清除不可达对象。问题在于，标准算法效率低下，由于其不规则的访问模式，会在访问堆内存时花费大量时间停滞，而NUMA和每个内核的内存带宽减少等现代CPU趋势加剧了这种情况。\n\nGreen Tea通过一个简单而有效的核心概念解决了这个问题：处理页面而不是单个对象。这意味着，不是将单个对象添加到工作列表，而是将页面添加到工作列表，并且扫描按页面而不是按对象进行。这导致更可预测的内存访问模式，从而提高缓存利用率并减少停滞。该博客提供了一个可视化演练，展示了Green Tea 与原始算法相比的表现。\n\n初步结果显示出显著的改进，一些工作负载的GC时间减少了高达40%。 Green Tea已经在Google中使用，并被认为是生产就绪的。Go团队计划在Go 1.26中将其作为默认设置，具体取决于用户反馈。"
  },
  {
    "id": "45757953",
    "title": "Microsoft seemingly just revealed that OpenAI lost $11.5B last quarter",
    "url": "https://www.theregister.com/2025/10/29/microsoft_earnings_q1_26_openai_loss/",
    "summary": "生成摘要时出错",
    "chinese_title": "Microsoft seemingly just revealed that OpenAI lost $11.5B last quarter",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45736479",
    "title": "What we talk about when we talk about sideloading",
    "url": "https://f-droid.org/2025/10/28/sideloading.html",
    "summary": "生成摘要时出错",
    "chinese_title": "What we talk about when we talk about sideloading",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45761627",
    "title": "CISA and NSA share tips on securing Microsoft Exchange servers",
    "url": "https://www.bleepingcomputer.com/news/security/cisa-and-nsa-share-tips-on-securing-microsoft-exchange-servers/",
    "summary": "生成摘要时出错",
    "chinese_title": "CISA and NSA share tips on securing Microsoft Exchange servers",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45722069",
    "title": "It's insulting to read AI-generated blog posts",
    "url": "https://blog.pabloecortez.com/its-insulting-to-read-your-ai-generated-blog-post/",
    "summary": "生成摘要时出错",
    "chinese_title": "It's insulting to read AI-generated blog posts",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45754390",
    "title": "A century of reforestation helped keep the eastern US cool (2024)",
    "url": "https://news.agu.org/press-release/a-century-of-reforestation-helped-keep-the-eastern-us-cool/",
    "summary": "生成摘要时出错",
    "chinese_title": "A century of reforestation helped keep the eastern US cool (2024)",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45746844",
    "title": "Character.ai to bar children under 18 from using its chatbots",
    "url": "https://www.nytimes.com/2025/10/29/technology/characterai-underage-users.html",
    "summary": "生成摘要时出错",
    "chinese_title": "Character.ai to bar children under 18 from using its chatbots",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45728170",
    "title": "Quantifying pass-by-value overhead",
    "url": "https://owen.cafe/posts/struct-sizes/",
    "summary": "生成摘要时出错",
    "chinese_title": "Quantifying pass-by-value overhead",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45723737",
    "title": "Why imperfection could be key to Turing patterns in nature",
    "url": "https://arstechnica.com/science/2025/10/why-imperfection-could-be-key-to-turing-patterns-in-nature/",
    "summary": "生成摘要时出错",
    "chinese_title": "Why imperfection could be key to Turing patterns in nature",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45692116",
    "title": "Apple will phase out Rosetta 2 in macOS 28",
    "url": "https://developer.apple.com/documentation/apple-silicon/about-the-rosetta-translation-environment",
    "summary": "生成摘要时出错",
    "chinese_title": "Apple will phase out Rosetta 2 in macOS 28",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45722896",
    "title": "How blocks are chained in a blockchain",
    "url": "https://www.johndcook.com/blog/2025/10/27/blockchain/",
    "summary": "生成摘要时出错",
    "chinese_title": "How blocks are chained in a blockchain",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45739877",
    "title": "SwirlDB: Modular-first, CRDT-based embedded database",
    "url": "https://docs.swirldb.org/",
    "summary": "生成摘要时出错",
    "chinese_title": "SwirlDB: Modular-first, CRDT-based embedded database",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45734429",
    "title": "Show HN: Research Hacker News, ArXiv & Google with Hierarchical Bayesian Models",
    "url": "https://sturdystatistics.com/deepdive-search",
    "summary": "生成摘要时出错",
    "chinese_title": "Show HN: Research Hacker News, ArXiv & Google with Hierarchical Bayesian Models",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45754660",
    "title": "OS/2 Warp, PowerPC Edition (2011)",
    "url": "https://www.os2museum.com/wp/os2-history/os2-warp-powerpc-edition/",
    "summary": "生成摘要时出错",
    "chinese_title": "OS/2 Warp, PowerPC Edition (2011)",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45740241",
    "title": "Detour: Dynamic linking on Linux without Libc",
    "url": "https://github.com/graphitemaster/detour",
    "summary": "生成摘要时出错",
    "chinese_title": "Detour: Dynamic linking on Linux without Libc",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45748186",
    "title": "Hosting SQLite Databases on GitHub Pages (2021)",
    "url": "https://phiresky.github.io/blog/2021/hosting-sqlite-databases-on-github-pages/",
    "summary": "生成摘要时出错",
    "chinese_title": "Hosting SQLite Databases on GitHub Pages (2021)",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45739080",
    "title": "Generative AI Image Editing Showdown",
    "url": "https://genai-showdown.specr.net/image-editing",
    "summary": "生成摘要时出错",
    "chinese_title": "Generative AI Image Editing Showdown",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45674766",
    "title": "A Fork in the Road: Deciding Kafka's Diskless Future",
    "url": "https://jack-vanlightly.com/blog/2025/10/22/a-fork-in-the-road-deciding-kafkas-diskless-future",
    "summary": "生成摘要时出错",
    "chinese_title": "A Fork in the Road: Deciding Kafka's Diskless Future",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45742488",
    "title": "Keep Android Open",
    "url": "http://keepandroidopen.org/",
    "summary": "生成摘要时出错",
    "chinese_title": "Keep Android Open",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45747804",
    "title": "Collins Aerospace: Sending text messages to the cockpit with test:test",
    "url": "https://www.ccc.de/en/disclosure/collins-aerospace-mit-test-test-textnachrichten-bis-ins-cockpit-senden",
    "summary": "生成摘要时出错",
    "chinese_title": "Collins Aerospace: Sending text messages to the cockpit with test:test",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45726272",
    "title": "Movycat – A terminal movie player written in Zig",
    "url": "https://github.com/M64GitHub/movycat",
    "summary": "生成摘要时出错",
    "chinese_title": "Movycat – A terminal movie player written in Zig",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45748195",
    "title": "The end of the rip-off economy: consumers use LLMs against information asymmetry",
    "url": "https://www.economist.com/finance-and-economics/2025/10/27/the-end-of-the-rip-off-economy",
    "summary": "生成摘要时出错",
    "chinese_title": "The end of the rip-off economy: consumers use LLMs against information asymmetry",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45702397",
    "title": "ChatGPT's Atlas: The Browser That's Anti-Web",
    "url": "https://www.anildash.com//2025/10/22/atlas-anti-web-browser/",
    "summary": "生成摘要时出错",
    "chinese_title": "ChatGPT's Atlas: The Browser That's Anti-Web",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45734865",
    "title": "Show HN: Pipelex – Declarative language for repeatable AI workflows",
    "url": "https://github.com/Pipelex/pipelex",
    "summary": "生成摘要时出错",
    "chinese_title": "Show HN: Pipelex – Declarative language for repeatable AI workflows",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45733329",
    "title": "The AirPods Pro 3 flight problem",
    "url": "https://basicappleguy.com/basicappleblog/the-airpods-pro-3-flight-problem",
    "summary": "生成摘要时出错",
    "chinese_title": "The AirPods Pro 3 flight problem",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45751868",
    "title": "I'm Independently Verifying Go's Reproducible Builds",
    "url": "https://www.agwa.name/blog/post/verifying_go_reproducible_builds",
    "summary": "生成摘要时出错",
    "chinese_title": "I'm Independently Verifying Go's Reproducible Builds",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45758874",
    "title": "Alphabet tops $100B quarterly revenue for first time, cloud grows 34%",
    "url": "https://www.cnbc.com/2025/10/29/alphabet-google-q3-earnings.html",
    "summary": "生成摘要时出错",
    "chinese_title": "Alphabet tops $100B quarterly revenue for first time, cloud grows 34%",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45746478",
    "title": "From VS Code to Helix",
    "url": "https://ergaster.org/posts/2025/10/29-vscode-to-helix/",
    "summary": "生成摘要时出错",
    "chinese_title": "From VS Code to Helix",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45761107",
    "title": "JPMorgan Tokenizes Private-Equity Fund on Its Own Blockchain",
    "url": "https://www.wsj.com/finance/investing/jpmorgan-tokenizes-private-equity-fund-on-its-own-blockchain-729dadda",
    "summary": "生成摘要时出错",
    "chinese_title": "JPMorgan Tokenizes Private-Equity Fund on Its Own Blockchain",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45734486",
    "title": "Nvidia takes $1B stake in Nokia",
    "url": "https://www.cnbc.com/2025/10/28/nvidia-nokia-ai.html",
    "summary": "生成摘要时出错",
    "chinese_title": "Nvidia takes $1B stake in Nokia",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45736499",
    "title": "HTTPS by default",
    "url": "https://security.googleblog.com/2025/10/https-by-default.html",
    "summary": "生成摘要时出错",
    "chinese_title": "HTTPS by default",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45761056",
    "title": "NASA, DARPA Will Test Nuclear Engine for Future Mars Missions",
    "url": "https://www.nasa.gov/news-release/nasa-darpa-will-test-nuclear-engine-for-future-mars-missions/",
    "summary": "生成摘要时出错",
    "chinese_title": "NASA, DARPA Will Test Nuclear Engine for Future Mars Missions",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45759891",
    "title": "The International Criminal Court wants to become independent of USA technology",
    "url": "https://www.heise.de/en/news/International-Criminal-Court-Kicks-Out-Microsoft-10964189.html",
    "summary": "生成摘要时出错",
    "chinese_title": "The International Criminal Court wants to become independent of USA technology",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45731321",
    "title": "We need a clearer framework for AI-assisted contributions to open source",
    "url": "https://samsaffron.com/archive/2025/10/27/your-vibe-coded-slop-pr-is-not-welcome",
    "summary": "生成摘要时出错",
    "chinese_title": "We need a clearer framework for AI-assisted contributions to open source",
    "chinese_summary": "生成摘要时出错"
  }
]