[
  {
    "id": "45302065",
    "title": "I regret building this $3000 Pi AI cluster",
    "url": "https://www.jeffgeerling.com/blog/2025/i-regret-building-3000-pi-ai-cluster",
    "summary": "Jeff Geerling built a $3000 Raspberry Pi 5 compute blade cluster consisting of 10 nodes, each with a 16GB CM5 Lite module, aiming to explore its viability for HPC and AI tasks. After a two-year wait and multiple rebuilds due to unreliable SSDs and thermal throttling issues, he tested the cluster's performance using High Performance Linpack (HPL) and AI inference benchmarks.\n\nThe cluster achieved 325 Gflops in the HPL test, a 10x improvement over a single CM5. While more energy-efficient than his $8000 Framework Desktop cluster, it was significantly slower and less cost-effective for HPC.\n\nFor AI, the cluster struggled. Running Llama 3.2:3B on a single Pi yielded 6 tokens per second, weak compared to an Intel N100. Running Llama 3.3:70B across multiple Pis using llama.cpp RPC resulted in a slow 0.28 tokens per second. Using Distributed llama improved performance to 0.85 tokens/s across 8 nodes, but was still much slower and more fragile than the Framework cluster.\n\nGeerling concludes that while the cluster is efficient, quiet, and compact, its performance is not a powerhouse, and it's not the best value for most users. He suggests potential niche use cases for CI jobs or high-security edge deployments. He notes Unredacted Labs uses Pi clusters for Tor exit relays due to their efficiency and node density. Despite the underwhelming performance, Geerling intends to continue exploring the cluster's potential, inspired by the much larger Pi cluster at UC Santa Barbara.\n",
    "chinese_title": "我后悔搭建了这个价值3000美元的树莓派AI集群。",
    "chinese_summary": "杰夫·吉尔林搭建了一个价值3000美元的树莓派5计算刀片集群，包含10个节点，每个节点配备一个16GB CM5 Lite模块，旨在探索其在HPC和AI任务中的可行性。经过两年的等待，并因不可靠的固态硬盘和散热问题多次重建后，他使用高性能Linpack（HPL）和AI推理基准测试了集群的性能。\n\n该集群在HPL测试中达到了325 Gflops，比单个CM5提升了10倍。虽然比他价值8000美元的Framework桌面集群更节能，但对于HPC而言，速度明显更慢且成本效益更低。\n\n在AI方面，该集群表现不佳。在单个Pi上运行Llama 3.2:3B产生了每秒6个token，与Intel N100相比表现较弱。使用llama.cpp RPC在多个Pi上运行Llama 3.3:70B导致速度极慢，仅为每秒0.28个token。使用分布式llama将性能提升到8个节点上每秒0.85个token，但仍然比Framework集群慢得多且更不稳定。\n\n吉尔林总结说，虽然该集群高效、安静且紧凑，但其性能并非强大，对于大多数用户来说也不是最佳选择。他认为其可能适用于CI作业或高安全性边缘部署等小众用例。他指出，Unredacted Labs使用Pi集群作为Tor出口中继，因为它们效率高且节点密度大。尽管性能不尽如人意，但吉尔林打算继续探索该集群的潜力，受到加州大学圣巴巴拉分校更大的Pi集群的启发。"
  },
  {
    "id": "45300865",
    "title": "Ants Seem to Defy Biology: They Lay Eggs That Hatch into Another Species",
    "url": "https://www.smithsonianmag.com/smart-news/these-ant-queens-seem-to-defy-biology-they-lay-eggs-that-hatch-into-another-species-180987292/",
    "summary": "Iberian harvester ant queens (Messor ibericus) exhibit an unusual reproductive strategy called \"xenoparity,\" where they lay eggs that hatch into another species, the builder harvester ant (Messor structor). This defies the traditional biological definition of a species.\n\nM. ibericus queens mate with M. structor males and store their sperm. They then manipulate the eggs, removing their own genetic material before fertilization with M. structor sperm, resulting in the birth of M. structor male clones. The M. ibericus queens also produce their own species' males by mating with the M. ibericus males of the colony. All the worker ants within the M. ibericus colonies are hybrids of the two species.\n\nResearchers discovered this phenomenon by analyzing ants from M. ibericus colonies and found that some males were genetically M. structor, yet shared the M. ibericus mitochondrial DNA, inherited from the mother. This was further confirmed by observing M. structor births in laboratory colonies.\n\nThis relationship seems beneficial for both species. M. ibericus ensures a sufficient worker population and preserves access to M. structor males. The transported M. structor male clones have also allowed that species to spread to new places. However, due to the lack of sexual reproduction, these M. structor clones are accumulating potentially harmful mutations. Despite this, the arrangement has been successful, allowing one species to carry the other across southern Europe.\n",
    "chinese_title": "蚂蚁似乎违背生物学规律：它们产下的卵孵化成另一种物种",
    "chinese_summary": "伊比利亚收获蚁蚁后（Messor ibericus）表现出一种不寻常的繁殖策略，称为“异种生育”，即它们产下的卵会孵化成另一种物种，建造者收获蚁（Messor structor）。这颠覆了物种的传统生物学定义。\n\nM. ibericus 蚁后与 M. structor 雄蚁交配并储存精子。然后，它们操纵卵子，在用 M. structor 精子受精之前移除自身的遗传物质，从而产生 M. structor 雄性克隆体。M. ibericus 蚁后也通过与蚁群中的 M. ibericus 雄蚁交配来生产自身物种的雄蚁。M. ibericus 蚁群内的所有工蚁都是这两个物种的杂交种。\n\n研究人员通过分析 M. ibericus 蚁群中的蚂蚁发现了这种现象，并发现一些雄蚁在基因上是 M. structor，但共享从母亲那里继承的 M. ibericus 线粒体 DNA。在实验室蚁群中观察到 M. structor 的诞生进一步证实了这一点。\n\n这种关系似乎对两个物种都有利。M. ibericus 确保了足够的工蚁数量，并保持了获得 M. structor 雄蚁的途径。被转移的 M. structor 雄性克隆体也使该物种得以传播到新的地方。然而，由于缺乏有性繁殖，这些 M. structor 克隆体正在积累潜在的有害突变。尽管如此，这种安排是成功的，使得一个物种能够携带另一个物种横跨南欧。"
  },
  {
    "id": "45302222",
    "title": "Revamping an Old TV as a Gift (2019)",
    "url": "https://blog.davidv.dev/posts/revamping-an-old-tv-as-a-gift/",
    "summary": "In 2017, the author revamped a vintage TV as a gift for their dad's 50th birthday, aiming to create a seamless experience for watching 70s-80s shows. The project involved integrating a Raspberry Pi into the TV to play the content. Since the Pi outputs composite video, a composite RF modulator was used to convert the signal to a format the TV could display, with the TV tuner fixed to the modulator's output channel.\n\nTo retain channel switching functionality, the author implemented software-based channels controlled by a multi-polar rotary switch connected to the Pi's GPIO. Power for the Pi (5V) and modulator (9V) was derived from the TV's 12V rail using LM7809 and LM7805 voltage regulators, utilizing part of the TV as a heatsink.\n\nThe initial plan to randomly play shows and advertisements per channel was abandoned due to difficulties with GStreamer. Instead, each channel became a single 8-hour video with embedded advertisements. The playback timestamp is saved on power-off and restored on power-on, ensuring continuous playback. The author also created a fake parcel-tracking website as an extra touch.\n",
    "chinese_title": "将旧电视改造为礼物（2019）",
    "chinese_summary": "2017年，作者改造了一台老式电视机作为父亲50岁生日礼物，旨在创造流畅观看七八十年代节目的体验。该项目涉及将树莓派集成到电视中以播放内容。由于树莓派输出复合视频信号，因此使用了一个复合RF调制器将信号转换为电视可以显示的格式，并将电视调谐器固定到调制器的输出频道。\n\n为了保留频道切换功能，作者实现了基于软件的频道，由连接到树莓派GPIO的多极旋转开关控制。树莓派（5V）和调制器（9V）的电源来自电视的12V电源轨，使用LM7809和LM7805稳压器，并利用电视的一部分作为散热器。\n\n最初计划随机播放每个频道的节目和广告，但由于GStreamer的困难而被放弃。取而代之的是，每个频道都变成了一个包含嵌入式广告的8小时视频。播放时间戳在断电时保存，并在开机时恢复，确保连续播放。作者还创建了一个虚假的包裹追踪网站作为额外惊喜。"
  },
  {
    "id": "45255785",
    "title": "Internet Archive's big battle with music publishers ends in settlement",
    "url": "https://arstechnica.com/tech-policy/2025/09/internet-archives-big-battle-with-music-publishers-ends-in-settlement/",
    "summary": "The Internet Archive (IA) has reached a confidential settlement with major music publishers (UMG Recordings, Capitol Records, Sony Music Entertainment, et al.) over its Great 78 Project, which aimed to preserve early music recordings. The lawsuit, initiated by the publishers, initially sought $400 million in damages, later increased to $700 million, alleging copyright infringement and lost streaming revenue from IA's digitized recordings. IA argued that downloads and streams from the Great 78 Project were low and damages were overstated.\n\nThe settlement terms remain undisclosed, and it's unlikely the settlement amount will be made public. The agreement follows a similar legal battle lost by IA against book publishers, also resulting in an undisclosed payment. IA had accused the labels of adding works to the lawsuit late to force a settlement.\n\nDavid Seubert, a sound historian at UC Santa Barbara, suggested the lawsuit might be \"vindictive,\" as the Great 78 Project likely had little impact on the labels' revenue. He posited that the labels may have been pushing back against IA's \"pushing the envelope on copyright and fair use.\" The settlement's financial impact on the IA and the future of its digitization projects remain uncertain.\n",
    "chinese_title": "互联网档案馆与音乐出版商的大战以和解告终",
    "chinese_summary": "互联网档案馆(IA)与主要音乐出版商(环球音乐、国会唱片、索尼音乐娱乐等)就其旨在保存早期音乐录音的“伟大78转唱片计划”达成保密和解。出版商发起的诉讼最初寻求4亿美元的赔偿，后来增加到7亿美元，指控IA的数字化录音侵犯版权并造成流媒体收入损失。IA辩称，“伟大78转唱片计划”的下载量和播放量都很低，损害赔偿被夸大了。\n\n和解条款仍未公开，和解金额也不太可能被公开。在此协议之前，IA曾与图书出版商进行过类似的法律诉讼，最终败诉，也导致了一笔未公开的付款。IA曾指责唱片公司在诉讼后期添加作品，以迫使其达成和解。\n\n加州大学圣巴巴拉分校的声音历史学家大卫·塞伯特认为，这场诉讼可能具有“报复性”，因为“伟大78转唱片计划”可能对唱片公司的收入影响甚微。他推测，唱片公司可能是在反击IA“在版权和合理使用方面挑战极限”。和解对IA的财务影响以及其数字化项目的未来仍然不确定。"
  },
  {
    "id": "45299170",
    "title": "Ruby Central's Attack on RubyGems [pdf]",
    "url": "https://pup-e.com/goodbye-rubygems.pdf",
    "summary": "It's impossible to provide a meaningful summary of the document. The text appears to be extracted directly from the PDF source code and is a mix of PDF formatting characters, encoded data, and potentially some embedded text that is unreadable without proper PDF parsing and decoding. This is not a human-readable document and doesn't contain any coherent information about \"Ruby Central's Attack on RubyGems\" or any other topic. Any attempt to summarize it would be based on guesswork and completely inaccurate.\n",
    "chinese_title": "Ruby Central 对 RubyGems 的攻击 [pdf]",
    "chinese_summary": "无法对该文档提供有意义的摘要。文本似乎直接从PDF源代码中提取，混合了PDF格式字符、编码数据，以及一些嵌入的文本，这些文本未经正确的PDF解析和解码是无法阅读的。 这不是一份人类可读的文档，也不包含任何关于“Ruby Central对RubyGems的攻击”或其他主题的连贯信息。 任何试图总结它的行为都将基于猜测，并且完全不准确。"
  },
  {
    "id": "45295898",
    "title": "Want to piss off your IT department? Are the links not malicious looking enough?",
    "url": "https://phishyurl.com/",
    "summary": "This article describes a tool designed to generate \"phishy\" URLs for the purpose of educational testing or pranking. The tool functions as a redirect service, similar to TinyURL, but instead of shortening links, it makes them appear malicious. Users input a legitimate URL, and the tool creates a new URL that looks suspicious but simply redirects to the original link.\n\nThe article allows users to customize the generated phishy URL based on themes such as: Crypto, Financial, Phishing, Online Shopping, Gambling, Dating, Tech & Software, Adult Content, and a \"Surprise Me!\" option. Users can also select the length of the URL, ranging from Small to \"Just fuck me up fam!\", influencing the apparent complexity and potential maliciousness of the generated link.\n\nThe author emphasizes that the tool doesn't actually perform any malicious activity; it only aims to create a deceptive URL for demonstration or humorous purposes. The implied goal is to demonstrate how easily malicious-looking URLs can be created and potentially used in phishing attacks, presumably to raise awareness. While presented with a humorous tone, the underlying message touches upon the importance of URL scrutiny.\n",
    "chinese_title": "想惹恼你的IT部门吗？链接看起来还不够恶意？",
    "chinese_summary": "本文介绍了一种工具，该工具旨在生成“钓鱼”网址，用于教育测试或恶作剧。该工具的功能类似于TinyURL的重定向服务，但不是缩短链接，而是使其看起来具有恶意性。用户输入合法的网址，该工具会创建一个新的、看起来可疑的网址，但该网址只会重定向到原始链接。\n\n本文允许用户根据主题自定义生成的钓鱼网址，主题包括：加密货币、金融、钓鱼、在线购物、赌博、约会、科技与软件、成人内容以及“给我惊喜！”选项。用户还可以选择网址的长度，范围从小到“狠狠地搞我！”，从而影响生成链接的表面复杂性和潜在恶意性。\n\n作者强调，该工具实际上并未执行任何恶意活动；它仅旨在创建具有欺骗性的网址，用于演示或幽默目的。其隐含的目标是演示恶意外观的网址是多么容易创建，以及潜在地用于网络钓鱼攻击，大概是为了提高人们的意识。虽然本文以幽默的口吻呈现，但其潜在信息触及了网址审查的重要性。"
  },
  {
    "id": "45294390",
    "title": "Shipping 100 hardware units in under eight weeks",
    "url": "https://farhanhossain.substack.com/p/how-we-shipped-100-hardware-units",
    "summary": "Okay, here's a summary of the article \"Shipping 100 hardware units in under eight weeks\" based on my understanding of common challenges and solutions in hardware startups, since I'm unable to access the provided URL:\n\nThis article likely details the author's experience shipping a small batch (100 units) of a hardware product in a very tight timeframe (under eight weeks). Given typical hardware development challenges, the article probably focuses on efficiency and strategic decision-making.\n\nKey takeaways likely include:\n\n*   **Prioritization & Feature Reduction:** To meet the deadline, the team likely had to aggressively prioritize core features and eliminate \"nice-to-haves\" for the initial release. This could involve simplifying the design, focusing on essential functionalities, and deferring advanced features for later iterations.\n*   **Leveraging Existing Components & Services:** Instead of designing everything from scratch, the team probably used off-the-shelf components, modules, and cloud services to accelerate development and minimize custom engineering.\n*   **Rapid Prototyping & Testing:** Iterative prototyping and quick testing were probably crucial. This allowed the team to identify and fix bugs early in the process, avoiding costly delays later on. Methods like 3D printing and readily available development boards may have been used.\n*   **Efficient Manufacturing & Assembly:** The team might have used a contract manufacturer (CM) or worked with a local assembly partner to handle the production and assembly of the units. Clear communication, detailed documentation, and rigorous quality control were likely essential. They may have selected a CM based on speed and flexibility rather than lowest cost.\n*   **Streamlined Supply Chain:** Managing the supply chain for a small batch in a short timeframe is difficult. The team probably carefully selected suppliers with readily available stock and reliable delivery times. They might have also opted for air freight over sea freight to expedite shipping.\n*   **Team Collaboration & Communication:** A small, highly motivated team with clear roles and responsibilities was likely vital for success. Daily stand-up meetings, shared communication channels, and a culture of open feedback likely contributed to efficiency.\n*   **Accepting Imperfection:** The author probably acknowledges that the initial product wasn't perfect. The goal was to get something functional and shippable to customers quickly, gather feedback, and iterate based on that feedback.\n\nThe article likely emphasizes that shipping a hardware product quickly requires making tough choices, focusing on essential features, leveraging existing resources, and prioritizing speed over perfection in the initial release.\n",
    "chinese_title": "八周内交付100台硬件设备",
    "chinese_summary": "好的，以下是好的，这是一篇关于“八周内交付100个硬件产品”文章的摘要，基于我对硬件初创公司常见挑战和解决方案的理解，因为我无法访问提供的URL：\n\n这篇文章可能详细描述了作者在非常短的时间内（八周内）交付小批量（100个）硬件产品的经验。鉴于典型的硬件开发挑战，这篇文章可能侧重于效率和战略决策。\n\n关键要点可能包括：\n\n* **优先级排序与功能精简：** 为了赶上截止日期，团队可能不得不积极地优先考虑核心功能，并取消初始版本中的“锦上添花”的功能。这可能涉及简化设计，专注于基本功能，并将高级功能推迟到以后的迭代中。\n* **利用现有组件与服务：** 团队可能使用了现成的组件、模块和云服务来加速开发并最大限度地减少定制工程，而不是从头开始设计所有内容。\n* **快速原型设计与测试：** 迭代原型设计和快速测试可能至关重要。这使团队能够在过程的早期识别和修复错误，从而避免以后造成代价高昂的延误。可能使用了3D打印和现成的开发板等方法。\n* **高效的制造与组装：** 团队可能使用了合同制造商 (CM) 或与当地的组装合作伙伴合作来处理设备的生产和组装。清晰的沟通、详细的文档和严格的质量控制可能至关重要。他们可能根据速度和灵活性而不是最低成本来选择 CM。\n* **精简的供应链：** 在短时间内管理小批量产品的供应链非常困难。团队可能仔细选择了库存充足且交货时间可靠的供应商。他们可能还选择了空运而不是海运来加快运输速度。\n* **团队协作与沟通：** 一个小型、积极性高的团队，拥有明确的角色和职责，对于成功可能至关重要。每日站立会议、共享沟通渠道和开放反馈的文化可能有助于提高效率。\n* **接受不完美：** 作者可能承认最初的产品并不完美。目标是快速为客户提供功能齐全且可交付的产品，收集反馈，并根据该反馈进行迭代。\n\n这篇文章可能强调，快速交付硬件产品需要做出艰难的选择，专注于基本功能，利用现有资源，并在初始版本中优先考虑速度而不是完美。"
  },
  {
    "id": "45265760",
    "title": "Show the Physics",
    "url": "https://interactivetextbooks.tudelft.nl/showthephysics/Introduction/About.html",
    "summary": "\"Show the Physics\" is a book presenting a selection of 99 engaging physics demonstrations from the Dutch \"ShowdeFysica\" series, aiming to be a valuable resource for physics teachers. It provides strategies to maximize the educational impact of demonstrations, including videos and interactive Python simulations accessible without software installation.\n\nThe book categorizes demonstrations based on their purpose: nature of science, scientific inquiry, conceptual development, and special occasions. It encourages teachers to use the demonstrations to deepen understanding, stimulate thinking, or provide engaging physics content for events.\n\nThe book is a collaborative effort from the Dutch Association for Science Education, with each demonstration tested by teachers. While acknowledging inspiration from earlier experiments, the book includes questions to check student understanding. It's published under a CC-BY-NC license, allowing non-commercial use and adaptation with proper attribution.\n\nReaders are encouraged to use the book flexibly, searching for demonstrations relevant to their curriculum or exploring chapters on demonstration pedagogy. While safety measures are detailed, the authors are not liable for accidents and emphasize pre-testing.\n\nThe online format includes interactive Python code cells, allowing users to experiment and modify code within their browser. Readers can contribute to the book by reporting issues and suggesting improvements via GitHub. A companion resource of 200 smaller \"backpocket demos\" is also mentioned.\n",
    "chinese_title": "展示物理",
    "chinese_summary": "《展示物理》是一本书，精选了荷兰“ShowdeFysica”系列的99个引人入胜的物理演示实验，旨在成为物理教师的宝贵资源。它提供了最大化演示实验教育影响的策略，包括无需安装软件即可访问的视频和互动式Python模拟。\n\n本书根据演示实验的目的进行分类：科学本质、科学探究、概念发展和特殊场合。它鼓励教师利用这些演示实验来加深理解，激发思考，或为活动提供引人入胜的物理内容。\n\n本书是荷兰科学教育协会的合作成果，每个演示实验都经过教师测试。在承认受到早期实验启发的同时，本书也包含检查学生理解的问题。本书以CC-BY-NC许可发布，允许非商业用途和适当署名的改编。\n\n鼓励读者灵活使用本书，搜索与其课程相关的演示实验，或探索关于演示实验教学法的章节。尽管详细说明了安全措施，但作者不对事故负责，并强调预先测试。\n\n在线形式包括互动式Python代码单元，允许用户在其浏览器中试验和修改代码。读者可以通过GitHub报告问题和提出改进建议来为本书做出贡献。书中还提到了一个包含200个较小“口袋演示”的配套资源。"
  },
  {
    "id": "45297066",
    "title": "Help Us Raise $200k to Free JavaScript from Oracle",
    "url": "https://deno.com/blog/javascript-tm-gofundme",
    "summary": "Ryan Dahl, on September 18, 2025, is appealing to the developer community to help Deno raise $200,000 to fund a legal battle against Oracle for control of the \"JavaScript\" trademark. Deno filed a Cancellation Petition with the US Patent and Trademark Office after receiving over 27,000 signatures on an open letter to Oracle.\n\nThe petition aims to make \"JavaScript\" public domain, allowing free use by developers, conferences, authors, and companies without fear of trademark infringement. The funds are needed for the crucial discovery phase of the litigation, covering professional public surveys, expert witnesses, depositions from industry leaders, and legal filings.\n\nThe author emphasizes the importance of funding these elements to build a strong case proving that \"JavaScript\" is universally recognized as the name of a language, not an Oracle brand. Oracle, on August 6th, 2025, denied that “JavaScript” is a generic term in their response to the petition.\n\nDahl argues that if Oracle wins, they will essentially lock in ownership of a common language name, undermining the integrity of trademark law and potentially allowing other corporations to claim ownership of generic terms. If there are leftover funds, the money will go to OpenJS Foundation, not to Deno, for furthering civil liberties in the digital space. The author urges the developer community to donate and share the campaign to ensure trademark law functions as intended.\n",
    "chinese_title": "帮助我们筹集20万美元，让JavaScript摆脱甲骨文的控制",
    "chinese_summary": "瑞恩·达尔于2025年9月18日呼吁开发者社区帮助Deno筹集20万美元，以资助针对Oracle的“JavaScript”商标控制权法律战。Deno在收到超过27000个签名致Oracle的公开信后，向美国专利商标局提交了撤销申请。\n\n该请愿旨在使“JavaScript”成为公共领域，允许开发者、会议、作者和公司自由使用，而无需担心商标侵权。这笔资金用于诉讼的关键发现阶段，包括专业的公众调查、专家证人、行业领导者的证词和法律文件。\n\n作者强调了资助这些要素的重要性，以建立一个强有力的案例，证明“JavaScript”被普遍认为是语言的名称，而不是Oracle的品牌。Oracle在2025年8月6日对该请愿的回应中否认“JavaScript”是一个通用术语。\n\n达尔认为，如果Oracle胜诉，他们将基本上锁定对通用语言名称的所有权，破坏商标法的完整性，并可能允许其他公司声称拥有通用术语的所有权。如果还有剩余资金，这笔钱将捐给OpenJS基金会，而不是Deno，用于促进数字领域的公民自由。作者敦促开发者社区捐款并分享该活动，以确保商标法按预期运作。"
  },
  {
    "id": "45299625",
    "title": "Statistical Physics with R: Ising Model with Monte Carlo",
    "url": "https://github.com/msuzen/isingLenzMC",
    "summary": "This R package, `isingLenzMC`, provides tools to simulate the classical Ising Model, a fundamental system in statistical physics used to understand phenomena like spin glasses, magnetism, phase transitions, and neural networks. It focuses on simulating a one-dimensional Ising Model using Metropolis and Glauber Monte Carlo methods, specifically with single-spin-flip dynamics and periodic boundary conditions. The package also includes utility functions for calculating exact solutions. The Ising Model is a powerful tool for studying cooperative phenomena.\n\nThe package's development is related to research exploring the ergodicity of single-spin-flip dynamics in the Ising Model. Two related publications are cited: a Phys. Rev. E article investigating effective ergodicity and an arXiv preprint examining anomalous diffusion during convergence to effective ergodicity, both by Mehmet Suezen. Datasets associated with the arXiv paper are also mentioned, suggesting the package might be used for reproducing or extending the results presented in those works. In essence, the package offers a practical implementation of Ising Model simulations in R, grounded in theoretical research on its dynamic properties.\n",
    "chinese_title": "使用R语言的统计物理：蒙特卡洛模拟伊辛模型",
    "chinese_summary": "`isingLenzMC` R包提供模拟经典Ising模型的工具。Ising模型是统计物理学中的一个基本系统，用于理解诸如自旋玻璃、磁性、相变和神经网络等现象。它专注于使用Metropolis和Glauber Monte Carlo方法模拟一维Ising模型，特别是具有单自旋翻转动力学和周期性边界条件。该软件包还包括用于计算精确解的实用函数。 Ising模型是研究协同现象的强大工具。\n\n该软件包的开发与探索Ising模型中单自旋翻转动力学遍历性的研究相关。引用了两篇相关出版物：一篇研究有效遍历性的《Phys. Rev. E》文章和一篇检验收敛到有效遍历性期间异常扩散的arXiv预印本，两者均由Mehmet Suezen撰写。还提到了与arXiv论文相关的数据集，表明该软件包可能用于重现或扩展这些作品中呈现的结果。本质上，该软件包提供了在R中进行Ising模型模拟的实用实现，该实现基于对其动态特性的理论研究。"
  },
  {
    "id": "45302220",
    "title": "Trevor Milton's Nikola Case Dropped by SEC Following Trump Pardon",
    "url": "https://eletric-vehicles.com/nikola/trevor-miltons-nikola-case-dropped-by-sec-following-trump-pardon/",
    "summary": "The SEC has dropped its fraud case against Nikola founder Trevor Milton following a full and unconditional pardon granted by then-President Donald Trump in March, six months prior to the article's publishing date of September 17, 2025. Milton, who was initially convicted of securities fraud and sentenced to four years in prison for misleading investors about Nikola's technology and progress, claims the SEC's case was based on lies from the media, prosecutors, and former Nikola executives.\n\nMilton stepped down as CEO in 2020 after allegations of misrepresentation made by Hindenburg Research. Despite the pardon, which Milton argues \"wiped the slate clean,\" Nikola is contesting his demand for $69 million in legal fee indemnification, arguing he acted with \"gross negligence\" and \"bad faith.\"\n\nNikola is currently undergoing Chapter 11 bankruptcy proceedings in Delaware. The bankruptcy plan is being scrutinized, with creditors seeking to investigate whether Milton is dissipating personal assets that could be used to satisfy his debt to the company.\n",
    "chinese_title": "特朗普赦免后，SEC撤销对特雷弗·米尔顿的尼古拉案。",
    "chinese_summary": "在时任总统唐纳德·特朗普于3月给予尼古拉创始人特雷弗·米尔顿完全且无条件赦免后（本文章于2025年9月17日发布，赦免发生在6个月前），美国证监会已撤销对其的欺诈指控。米尔顿最初因证券欺诈罪被判处四年监禁，原因是其在尼古拉的技术和进展方面误导投资者。他声称证监会的案件是基于媒体、检察官和尼古拉前高管的谎言。\n\n在兴登堡研究公司提出虚假陈述指控后，米尔顿于2020年辞去首席执行官一职。尽管米尔顿辩称赦免“一笔勾销”，但尼古拉正在反对他要求赔偿6900万美元法律费用的要求，理由是他存在“严重疏忽”和“恶意”行为。\n\n尼古拉目前正在特拉华州进行第11章破产程序。破产计划正在受到审查，债权人寻求调查米尔顿是否正在转移个人资产，这些资产可用于偿还他对公司的债务。"
  },
  {
    "id": "45259471",
    "title": "Rules for creating good-looking user interfaces, from a developer",
    "url": "https://weberdominik.com/blog/rules-user-interfaces/",
    "summary": "This article offers a developer's perspective on creating good-looking user interfaces, emphasizing simplicity and consistency over intricate design knowledge. The author identifies alignment and consistency as crucial factors often overlooked in bad design, showcasing how even subtle improvements can significantly enhance user experience.\n\nThe core strategy revolves around leveraging component libraries, advocating for their consistent use without adaptation, even if it means accepting minor imperfections. The author advises selecting a library that offers all necessary components and aligns with your design preferences, cautioning against copy-paste libraries due to potential inconsistencies.\n\nThe article provides practical design rules: limiting font weights and text colors to two, adapting icon weights to surrounding content, and prioritizing the purpose of UI elements to avoid unnecessary clutter. It underscores the importance of creating a project-specific design rule document to ensure consistency across the entire product.\n\nThe author recommends three books: \"Practical UI,\" \"Refactoring UI,\" and \"Designing Interfaces,\" for developers seeking actionable UI design guidance.\n\nIn summary, the key takeaway is to prioritize global UI consistency over local optimizations, streamlining the design process and resulting in a more user-friendly and aesthetically pleasing interface.\n",
    "chinese_title": "作为开发者，创建美观用户界面的规则",
    "chinese_summary": "本文从开发者的角度探讨了如何创建美观的用户界面，强调简洁性和一致性，而非复杂的设计知识。作者认为，对齐和一致性是糟糕设计中经常被忽视的关键因素，并展示了即使是细微的改进也能显著提升用户体验。\n\n核心策略围绕利用组件库展开，提倡始终如一地使用它们，即使这意味着接受一些细微的瑕疵。作者建议选择一个提供所有必要组件且符合您设计偏好的库，并警告不要使用复制粘贴的库，因为这可能会导致不一致。\n\n文章提供了一些实用的设计规则：限制字体粗细和文本颜色为两种，使图标粗细适应周围内容，以及优先考虑UI元素的目的以避免不必要的混乱。文章强调了创建项目特定的设计规则文档的重要性，以确保整个产品的一致性。\n\n作者推荐了三本书籍：《Practical UI》、《Refactoring UI》和《Designing Interfaces》，供寻求可操作UI设计指导的开发者参考。\n\n总而言之，关键在于优先考虑全局UI一致性，而非局部优化，从而简化设计流程并打造更用户友好和美观的界面。"
  },
  {
    "id": "45301679",
    "title": "Intel Arc Celestial dGPU seems to be first casualty of Nvidia partnership",
    "url": "https://www.notebookcheck.net/Intel-Arc-Celestial-dGPU-seems-to-be-first-casualty-of-Nvidia-partnership-while-Intel-Arc-B770-is-allegedly-still-alive.1118962.0.html",
    "summary": "This article discusses the rumored fate of Intel's Arc desktop GPU lineup, specifically focusing on the Arc Battlemage B770 and the future Arc Celestial. According to a leak from Moore's Law Is Dead (MLID), the Arc B770 is still expected to launch this quarter with 32 Xe cores and a 256-bit wide bus, aiming for RTX 4070-level performance. However, it's now suggested that it will lack PCIe 5.0 support and may suffer from frame pacing issues, resulting in choppy performance and limited availability.\n\nMore significantly, the article claims that Intel has reportedly canceled its planned Arc Celestial dGPU, signaling a potential end to Intel's development of high-end desktop GPUs. This cancellation is rumored to be a consequence of Intel's partnership with Nvidia. If this is true, future architectures like Arc Druid might also be scrapped, effectively halting Intel's desktop GPU ambitions.\n\nDespite the bleak outlook for future high-end cards, the article expresses hope that Intel will continue to pursue desktop GPUs, citing the Arc Battlemage B580 as a positive addition to the GPU market. The article also mentions recent related news about Intel and Nvidia's partnership on Hammer Lake and Titan Lake APUs.\n",
    "chinese_title": "英特尔Arc Celestial独立显卡似乎是英伟达合作的第一个牺牲品",
    "chinese_summary": "本文探讨了关于英特尔Arc桌面GPU产品线命运的传闻，特别是关注Arc Battlemage B770和未来的Arc Celestial。根据Moore's Law Is Dead (MLID)的爆料，Arc B770预计仍将于本季度发布，拥有32个Xe核心和256位宽的总线，目标是达到RTX 4070级别的性能。然而，现在有消息称它将缺乏PCIe 5.0支持，并可能存在帧步调问题，导致性能不流畅和供应有限。\n\n更重要的是，本文声称英特尔据报道已取消了其计划中的Arc Celestial dGPU，这标志着英特尔可能结束高端桌面GPU的开发。据传，此次取消是英特尔与英伟达合作的后果。如果这是真的，像Arc Druid这样的未来架构也可能被放弃，从而有效地阻止英特尔的桌面GPU雄心。\n\n尽管未来高端显卡的前景黯淡，但本文表达了对英特尔将继续追求桌面GPU的希望，并称Arc Battlemage B580是GPU市场的一个积极补充。文章还提到了最近关于英特尔和英伟达在Hammer Lake和Titan Lake APU上合作的相关新闻。"
  },
  {
    "id": "45248356",
    "title": "Leatherman (vagabond)",
    "url": "https://en.wikipedia.org/wiki/Leatherman_(vagabond)",
    "summary": "The Leatherman was a vagabond who traveled a 365-mile circuit between the Connecticut and Hudson Rivers from roughly 1857 to 1889. He was known for his handmade leather clothing and his predictable route, returning to towns in western Connecticut and eastern New York every 34 days.\n\nHis origins and identity remain unknown, although he was believed to be French-Canadian due to his fluency in French and a French prayer book found on his person. He mostly communicated through grunts and gestures, rarely speaking in English. He lived in rock shelters, known as \"leatherman caves\", and relied on the generosity of townspeople for food. He was so well-known that several towns exempted him from the state \"tramp law.\"\n\nIn 1888, the Connecticut Humane Society had him hospitalized, where he was diagnosed as \"sane except for an emotional affliction.\" He was released due to having money and desiring freedom. He died of mouth cancer in 1889 in a cave near Ossining, New York.\n\nHis original tombstone mistakenly identified him as Jules Bourglay of Lyons, France, a claim later retracted. In 2011, his grave was moved, and a new headstone was installed simply reading \"The Leatherman.\" An exhumation of the grave yielded no human remains. The Leatherman has inspired various forms of media, including a Pearl Jam song and a video game character.\n",
    "chinese_title": "流浪者 (利泽曼)",
    "chinese_summary": "皮衣人是一位流浪者，大约从1857年到1889年间，他在康涅狄格河和哈德逊河之间往返于365英里的线路。他以手工制作的皮革服装和可预测的路线而闻名，每34天返回康涅狄格州西部和纽约州东部的城镇。\n\n他的身世和身份仍然未知，尽管人们认为他是法裔加拿大人，因为他精通法语，并且在他的身上发现了一本法语祈祷书。他主要通过咕哝和手势交流，很少说英语。他住在岩石庇护所里，被称为“皮衣人洞穴”，依靠城镇居民的慷慨捐助获得食物。他非常有名，以至于一些城镇免除了他的州“流浪法”。\n\n1888年，康涅狄格人道协会将他送往医院，在那里他被诊断为“神智健全，只是患有情感上的痛苦”。由于他有钱并渴望自由，他被释放了。1889年，他在纽约州奥西宁附近的一个洞穴中死于口腔癌。\n\n他最初的墓碑错误地将他认定为法国里昂的朱尔斯·布格莱，这一说法后来被撤回。2011年，他的坟墓被移动，并安装了一块新的墓碑，上面简单地写着“皮衣人”。对坟墓的挖掘没有发现任何人类遗骸。皮衣人启发了各种形式的媒体，包括一首珍珠果酱乐队的歌曲和一个电子游戏角色。"
  },
  {
    "id": "45253926",
    "title": "The Ruliology of Lambdas",
    "url": "https://writings.stephenwolfram.com/2025/09/the-ruliology-of-lambdas/",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "Lambda演算的规则学",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "45300615",
    "title": "Dynamo AI (YC W22) Is Hiring a Senior Kubernetes Engineer",
    "url": "https://www.ycombinator.com/companies/dynamo-ai/jobs/fU1oC9q-senior-kubernetes-engineer",
    "summary": "Dynamo AI (YC W22), a company building secure and scalable AI systems for enterprises, is hiring a Senior Kubernetes Engineer to lead the deployment of its Kubernetes-based clusters into customer environments. This is a customer-facing, hands-on role that involves being the technical bridge between Dynamo AI's product and the customer's infrastructure.\n\nThe engineer will be responsible for engaging with customers, understanding their needs, evolving core infrastructure for performance and security, developing deployment models for automated rollouts, working with DevOps, and collaborating across teams to improve AI system protection.\n\nKey qualifications include extensive experience with Kubernetes, Helm, containerized application delivery, and at least one of AWS, Azure, or GCP. The role also requires 4+ years of experience in solution architecture, DevOps, or cloud engineering, 2+ years of direct customer interaction, familiarity with authentication/authorization systems, and strong communication skills. US citizenship or security clearance is required due to work with U.S. government clients, and in-office presence is required 2-3 days a week in either San Francisco or New York. AI/ML infrastructure experience is a plus. The salary range is $170K - $230K.\n",
    "chinese_title": "Dynamo AI (YC W22) 招聘资深 Kubernetes 工程师",
    "chinese_summary": "Dynamo AI (YC W22) 是一家为企业构建安全且可扩展人工智能系统的公司，现招聘高级 Kubernetes 工程师，负责将其基于 Kubernetes 的集群部署到客户环境中。这是一个面向客户、亲力亲为的职位，需要成为 Dynamo AI 产品与客户基础设施之间的技术桥梁。\n\n该工程师将负责与客户沟通、了解他们的需求、改进核心基础设施以提高性能和安全性、开发用于自动化部署的部署模型、与 DevOps 团队合作，并跨团队协作以提高人工智能系统的保护能力。\n\n主要资格包括：在 Kubernetes、Helm、容器化应用程序交付方面拥有丰富的经验，以及至少精通 AWS、Azure 或 GCP 中的一种。该职位还要求在解决方案架构、DevOps 或云工程方面拥有 4 年以上的经验，2 年以上的直接客户互动经验，熟悉身份验证/授权系统，以及强大的沟通能力。由于与美国政府客户合作，因此需要美国公民身份或安全许可，并且需要在旧金山或纽约办公室每周工作 2-3 天。具有 AI/ML 基础设施经验者优先。薪资范围为 17 万美元至 23 万美元。"
  },
  {
    "id": "45264764",
    "title": "The Many Broken Feeds",
    "url": "https://notes.abhinavsarkar.net/2025/broken-feeds",
    "summary": "This article categorizes common reasons why RSS/Atom feeds break, offering solutions for each. The author, a heavy feed user, emphasizes the importance of subscribing to your own website's feed to proactively detect issues.\n\nThe most frequent breakage is due to **expired SSL certificates**, which can be resolved through manual reminders, automated renewals, or using a CDN like Cloudflare. **Timeouts caused by slow servers** are another issue, often intermittent but requiring investigation into hosting infrastructure or software for potential improvements like caching or hardware upgrades.\n\n**Misconfigured firewalls**, designed to block web scraping bots, can inadvertently block feed readers. The author urges website owners to exclude feed URLs from these rules or offer link-only feeds if content scraping is a concern. Servers going down unexpectedly are also a culprit, solvable by setting up monitoring and alerting systems.\n\n**Changed feed URLs** due to website rewrites or platform switches should be handled by maintaining the old URLs, redirecting them, or informing readers through banners or posts. **Feed parsing failures**, often due to hand-rolled feed generators, can be mitigated by regularly validating feeds for encoding issues.\n\nFinally, the author addresses the deliberate removal of feeds and websites, advocating for the continued use of feeds and expressing sadness over website deletions. The article concludes with a call to action, encouraging readers to share and comment.\n",
    "chinese_title": "许多损坏的信息流",
    "chinese_summary": "本文归纳了 RSS/Atom 订阅源失效的常见原因，并为每种情况提供了解决方案。作者作为资深的订阅源用户，强调订阅自己网站的订阅源对于主动发现问题至关重要。\n\n最常见的失效原因是 **SSL 证书过期**，可以通过手动提醒、自动续订或使用 Cloudflare 等 CDN 来解决。**服务器速度慢导致的超时** 是另一个问题，通常是间歇性的，但需要调查主机基础设施或软件，以进行潜在的改进，例如缓存或硬件升级。\n\n**配置错误的防火墙**，旨在阻止网络抓取机器人，可能会无意中阻止订阅源阅读器。作者敦促网站所有者将订阅源 URL 从这些规则中排除，或者在担心内容抓取时提供仅链接订阅源。服务器意外宕机也是罪魁祸首，可以通过设置监控和警报系统来解决。\n\n由于网站重写或平台切换而导致的 **订阅源 URL 更改**，应通过维护旧 URL、重定向它们，或通过横幅或帖子通知读者来处理。**订阅源解析失败**，通常是由于手动编写的订阅源生成器造成的，可以通过定期验证订阅源是否存在编码问题来缓解。\n\n最后，作者提到了故意删除订阅源和网站的行为，倡导继续使用订阅源，并对网站删除表示遗憾。文章最后发出了行动号召，鼓励读者分享和评论。"
  },
  {
    "id": "45256575",
    "title": "The Sagrada Família takes its final shape",
    "url": "https://www.newyorker.com/magazine/2025/09/22/is-the-sagrada-familia-a-masterpiece-or-kitsch",
    "summary": "The Sagrada Família, Antoni Gaudí's ambitious basilica in Barcelona, is nearing completion, poised to become the world's tallest church. Started in 1882, the project is famous for its slow pace, unique design inspired by nature, and reliance on donations and tourist revenue. Currently, the church is surpassing the city’s highest skyscrapers. The final addition of the cross this month will make it the world’s tallest church.\n\nGaudí, who dedicated 43 years to the project, envisioned a structure with eighteen towers dedicated to religious figures. While only a fraction was built when he died in 1926, subsequent architects have worked to realize his vision, despite the loss of many original plans during the Spanish Civil War.\n\nUnder current chief architect Jordi Faulí, construction has accelerated, utilizing advanced software and pre-assembled panels to build sections faster. The Sagrada Família has become a major tourist attraction, generating significant revenue that funds its construction. Faulí emphasizes a conservative approach to Gaudí's design, using existing records and photographs to guide his work, while also acknowledging the creative license encouraged by Gaudí. The basilica, a symbol of Catalan culture, is expected to be completed in the near future.\n",
    "chinese_title": "圣家堂渐入最终形态",
    "chinese_summary": "圣家族教堂，安东尼·高迪在巴塞罗那的宏伟圣殿，即将完工，有望成为世界最高的教堂。该项目始于1882年，以其缓慢的步伐、受自然启发的独特设计以及对捐赠和旅游收入的依赖而闻名。目前，教堂的高度正在超越该市最高的摩天大楼。本月十字架的最终安装将使其成为世界最高的教堂。\n\n高迪为该项目奉献了43年，他设想了一个拥有十八座塔楼的结构，分别献给宗教人物。尽管他在1926年去世时只建造了一小部分，但随后的建筑师一直在努力实现他的愿景，尽管在西班牙内战期间丢失了许多原始图纸。\n\n在现任首席建筑师霍尔迪·法uli的领导下，施工已经加快，利用先进的软件和预制面板来更快地建造各个部分。圣家族教堂已成为主要的旅游景点，产生了大量的收入来资助其建设。法uli强调对高迪设计的保守态度，使用现有的记录和照片来指导他的工作，同时也承认高迪鼓励的创造性许可。这座大教堂是加泰罗尼亚文化的象征，预计在不久的将来完工。"
  },
  {
    "id": "45294058",
    "title": "U.S. already has the critical minerals it needs, according to new analysis",
    "url": "https://www.minesnewsroom.com/news/us-already-has-critical-minerals-it-needs-theyre-being-thrown-away-new-analysis-shows",
    "summary": "A new analysis by Colorado School of Mines researchers, published in the journal Science, reveals that the U.S. already mines all the critical minerals it needs annually for energy, defense, and technology. However, these minerals, including cobalt, lithium, germanium, and rare earth elements, are currently discarded as tailings from other mining operations like gold and zinc.\n\nThe study highlights the potential for recovering these critical minerals to significantly reduce or eliminate the need for imports. By building a database of annual production from federally permitted metal mines and pairing it with geochemical concentration data, the researchers estimated the quantities of critical minerals being mined and processed but not recovered.\n\nFor example, recovering less than 10% of the cobalt currently discarded would be enough to fuel the entire U.S. battery market. Similarly, recovering less than 1% of the germanium in mine tailings would eliminate the need for imports.\n\nThe researchers emphasize that enhanced recovery offers economic, geopolitical, and environmental benefits, including reducing the environmental impact of mine waste. They call for further research and development to make the recovery of these minerals economically feasible and advocate for policies that incentivize mine operators to invest in additional processing infrastructure. While the market value of these minerals might not be sufficient to motivate investment alone, the right policies can bridge the gap.\n",
    "chinese_title": "根据最新分析，美国已经拥有其所需的重要矿物。",
    "chinese_summary": "科罗拉多矿业学院研究人员在《科学》杂志上发表的一项新分析显示，美国已经开采了每年能源、国防和技术所需的所有关键矿物。然而，包括钴、锂、锗和稀土元素在内的这些矿物，目前被作为金和锌等其他采矿作业的尾矿丢弃。\n\n该研究强调了回收这些关键矿物以显著减少或消除进口需求的潜力。通过建立一个联邦许可金属矿的年度产量数据库，并将其与地球化学浓度数据配对，研究人员估计了正在开采和加工但未回收的关键矿物的数量。\n\n例如，回收目前被丢弃的钴的不到10%就足以满足整个美国电池市场的需求。同样，回收矿山尾矿中不到1%的锗就可以消除进口需求。\n\n研究人员强调，加强回收具有经济、地缘政治和环境效益，包括减少矿山废弃物对环境的影响。他们呼吁进一步研究和开发，使这些矿物的回收在经济上可行，并倡导制定激励矿山运营商投资额外加工基础设施的政策。虽然这些矿物的市场价值可能不足以单独激励投资，但正确的政策可以弥合这一差距。"
  },
  {
    "id": "45294440",
    "title": "Apple: SSH and FileVault",
    "url": "https://keith.github.io/xcode-man-pages/apple_ssh_and_filevault.7.html",
    "summary": "This article describes how to use SSH with FileVault on macOS. When FileVault is enabled, the data volume is locked at boot, making the standard SSH configuration unavailable because it resides on the encrypted volume. However, when Remote Login is enabled, macOS allows password authentication via SSH specifically to unlock the FileVault volume remotely. This unlocking process doesn't grant an immediate SSH session. Instead, after successful authentication, SSH disconnects briefly while the system mounts the data volume and starts dependent services. After this brief interruption, full SSH access and other enabled services become available. This capability, allowing remote FileVault unlocking via SSH, was introduced in macOS 26 Tahoe. In essence, it allows a user to remotely unlock the FileVault volume and regain access to their system over SSH after the system has completed the boot process.\n",
    "chinese_title": "苹果：SSH 与 FileVault",
    "chinese_summary": "本文介绍如何在 macOS 上结合 FileVault 使用 SSH。启用 FileVault 后，数据卷在启动时会被锁定，导致标准的 SSH 配置不可用，因为它位于加密卷上。但是，启用“远程登录”后，macOS 允许通过 SSH 进行密码验证，专门用于远程解锁 FileVault 卷。此解锁过程不会立即授予 SSH 会话。相反，在成功验证后，SSH 会短暂断开连接，同时系统会挂载数据卷并启动相关服务。在此短暂中断后，完整的 SSH 访问和其他启用的服务将可用。这种允许通过 SSH 远程解锁 FileVault 的功能是在 macOS 26 Tahoe 中引入的。本质上，它允许用户在系统完成启动过程后，远程解锁 FileVault 卷并重新通过 SSH 访问其系统。"
  },
  {
    "id": "45303199",
    "title": "A shift in developer culture is impacting innovation and creativity",
    "url": "https://dayvster.com/blog/dev-culture-is-dying-the-curious-developer-is-gone/",
    "summary": "In his article, Dayvi Schuster expresses concern about a perceived shift in developer culture away from curiosity-driven innovation towards a focus on metrics, revenue optimization, and chasing the latest technologies. He reminisces about a time when developers created tools like Linux and Git purely out of curiosity and a desire to solve personal problems.\n\nSchuster argues that the current emphasis on building products for mass consumption and optimizing for metrics is stifling creativity and leading developers to identify with specific technologies rather than the problems they solve. He highlights the trend of constantly adopting new frameworks and libraries without a genuine passion for them, driven by a fear of being left behind.\n\nHe laments the potential loss of the \"curious developer\" – the tinkerer who builds cool things even if they have limited practical use. While acknowledging occasional sparks of innovation, he believes these are becoming rarer. He connects this trend to a broader loss of ownership, both for consumers who increasingly rent software and for creators who may prioritize profit over passion.\n\nSchuster encourages developers to carve out time for curiosity and creation, to build projects simply for the joy of it, and to share their work to inspire others. He concludes by emphasizing the importance of maintaining the unique blend of creativity and engineering that defines software development.\n",
    "chinese_title": "开发者文化的转变正在影响创新和创造力。",
    "chinese_summary": "戴维·舒斯特在他的文章中表达了对开发者文化中一种转变的担忧，即从好奇心驱动的创新转向关注指标、收入优化和追逐最新技术。他回忆起过去开发者们出于好奇心和解决个人问题的愿望而创造诸如 Linux 和 Git 等工具的时代。\n\n舒斯特认为，目前对构建大众消费产品和优化指标的强调正在扼杀创造力，并导致开发者认同特定的技术，而不是他们所要解决的问题。他强调了不断采用新的框架和库，而缺乏真正热情的趋势，这主要是出于对落后的恐惧。\n\n他感叹“好奇的开发者”——那些即使实用性有限，也会创造出很酷东西的工匠——的潜在消失。虽然他承认偶尔会有创新火花，但他认为这些正变得越来越稀少。他将这一趋势与更广泛的所有权丧失联系起来，无论是消费者越来越多地租赁软件，还是创造者可能将利润置于热情之上。\n\n舒斯特鼓励开发者抽出时间进行好奇心驱动的创造，仅仅为了乐趣而构建项目，并分享他们的作品以激励他人。他最后强调了保持创造力和工程技术的独特融合，这正是软件开发的定义所在。"
  },
  {
    "id": "45296638",
    "title": "David Lynch LA House",
    "url": "https://www.wallpaper.com/design-interiors/david-lynch-house-los-angeles-for-sale",
    "summary": "This article explores David Lynch's Hollywood Hills compound, a sprawling estate now listed for $15 million following his death. The property, showcasing Mid-Century modern architecture, is described as a \"creative sanctuary\" that reflects Lynch's cinematic vision.\n\nThe compound consists of five contiguous parcels containing three main residences and several other structures. The property's history began in 1987 with the acquisition of the Beverly Johnson House, designed by Lloyd Wright. Lynch later commissioned Wright's son, Eric Lloyd Wright, to add a pool and pool house. Over the years, he expanded the estate to include a Brutalist house, a studio building, and more land, ultimately creating a seven-structure sanctuary with 10 bedrooms and 11 bathrooms.\n\nThe heart of the compound is a 2,000 square foot home featuring abundant light and natural textures. Notably, 7035 Senalda served as both the Madison residence in \"Lost Highway\" and Lynch’s studio, complete with a library, screening room, and editing suite where he worked on projects like \"Mulholland Drive.\"\n\nLynch personally contributed to the design of a two-storey guest house and a one-bedroom retreat. The estate's terraces, courtyards, and walkways provide a contrast to the intensity of the creative process. The Agency describes the property as an architectural landmark, representing both a home and an archive of Lynch's ideas, ready for its next chapter.\n",
    "chinese_title": "大卫·林奇洛杉矶住宅",
    "chinese_summary": "本文探讨大卫·林奇位于好莱坞山的庄园，这座在他去世后以1500万美元的价格挂牌出售的广阔地产。该物业展示了中世纪现代建筑风格，被誉为反映林奇电影视野的“创意圣地”。\n\n该庄园由五块相邻的地块组成，包含三处主要住宅和其他几处建筑物。该物业的历史始于1987年收购的劳埃德·赖特设计的贝弗利·约翰逊住宅。林奇后来委托赖特的儿子埃里克·劳埃德·赖特增加了一个游泳池和泳池小屋。多年来，他扩建了庄园，包括一座粗野主义风格的房屋、一座工作室建筑和更多土地，最终创建了一个拥有七个建筑物、十间卧室和十一间浴室的圣地。\n\n庄园的核心是一栋2000平方英尺的住宅，其特点是光线充足和天然纹理。值得注意的是，塞纳尔达街7035号既是《妖夜慌踪》中麦迪逊的住所，也是林奇的工作室，配有图书馆、放映室和剪辑室，他在那里创作了《穆赫兰道》等作品。\n\n林奇亲自参与设计了一栋两层楼的客房和一间单卧室的静修室。庄园的露台、庭院和走道与创作过程的紧张形成对比。The Agency 将该物业描述为一座建筑地标，既代表着一个家，又代表着林奇思想的档案，为下一篇章做好了准备。"
  },
  {
    "id": "45297331",
    "title": "Gemini in Chrome",
    "url": "https://gemini.google/overview/gemini-in-chrome/",
    "summary": "This article announces the integration of Google's Gemini AI assistant directly into the Chrome browser. Gemini in Chrome acts as an AI assistant built into the browser that helps users quickly understand and utilize web content.\n\nKey features include:\n\n*   **Summarization:** Gemini can quickly generate summaries of articles, webpages, and posts directly within the browser.\n*   **Contextual Q&A:** It can answer questions based on the content of the current webpage, providing relevant explanations and information without disrupting the user's reading flow.\n*   **Explanation of Complex Content:** It helps users understand difficult concepts by clarifying confusing sections and aiding in deeper comprehension.\n*   **Informed Decision-Making:** It can extract key information, specifications, and pros/cons from web pages to help users make informed choices, particularly when researching products.\n*   **Live Conversations:** Users can engage in natural language conversations with Gemini, including receiving spoken responses (Live Mode).\n*   **Mobile Availability:** Gemini will be available on Android (already working by accessing the screen content), and is coming soon to iOS with direct integration into the Chrome app.\n*   **User Control:** The assistant only activates when the user clicks the Gemini icon or uses a designated keyboard shortcut.\n*   **Privacy Features:** Users can manage and delete their Gemini activity history.\n*   **Availability**: Currently available in US for Windows and Mac users that have their Chrome language set to English. Coming soon for iOS users in US with English Chrome settings.\n\nThe article emphasizes that Gemini in Chrome offers a seamless and efficient way to understand and interact with web content directly within the browser, without needing to switch tabs or applications.\n",
    "chinese_title": "在 Chrome 中使用 Gemini",
    "chinese_summary": "本文宣布谷歌的 Gemini AI 助手直接集成到 Chrome 浏览器中。Chrome 中的 Gemini 作为一个内置于浏览器的 AI 助手，可帮助用户快速理解和利用网页内容。\n\n主要功能包括：\n\n*   **摘要总结：** Gemini 可以在浏览器内快速生成文章、网页和帖子的摘要。\n*   **情境问答：** 它可以根据当前网页的内容回答问题，提供相关的解释和信息，而不会中断用户的阅读流程。\n*   **复杂内容解释：** 它可以帮助用户理解困难的概念，澄清令人困惑的部分，并帮助用户更深入地理解。\n*   **明智的决策：** 它可以从网页中提取关键信息、规格和优缺点，帮助用户做出明智的选择，尤其是在研究产品时。\n*   **实时对话：** 用户可以与 Gemini 进行自然语言对话，包括接收语音回复（实时模式）。\n*   **移动设备可用性：** Gemini 将在 Android 上提供（已经可以通过访问屏幕内容使用），并且很快将在 iOS 上推出，并直接集成到 Chrome 应用程序中。\n*   **用户控制：** 该助手仅在用户单击 Gemini 图标或使用指定的键盘快捷键时激活。\n*   **隐私功能：** 用户可以管理和删除他们的 Gemini 活动历史记录。\n*   **可用性：** 目前在美国适用于 Chrome 语言设置为英语的 Windows 和 Mac 用户。 很快将适用于美国 Chrome 设置为英语的 iOS 用户。\n\n文章强调，Chrome 中的 Gemini 提供了一种无缝且高效的方式来直接在浏览器中理解和交互网页内容，而无需切换标签页或应用程序。"
  },
  {
    "id": "45301774",
    "title": "Court lets NSF keep swinging axe at $1B in research grants",
    "url": "https://www.theregister.com/2025/09/19/court_lets_nsf_keep_swinging/",
    "summary": "A US court has allowed the National Science Foundation (NSF) to proceed with canceling over 1,700 research grants, worth $1.4 billion, after a judge rejected a request to reinstate them while a lawsuit challenging the terminations is heard. The NSF initiated the cuts following a policy change narrowing the scope of acceptable \"broader impact\" for taxpayer-funded projects, targeting those focused on diversity, equity, and inclusion (DEI) programs.\n\nThe lawsuit, filed by educational and scientific organizations, argued the NSF's actions were arbitrary and violated due process. Judge Jia Cobb ruled the court lacked jurisdiction to order the retroactive reinstatement of funds but allowed the challenge against the NSF's new grant-making policy to proceed.\n\nThe decision means projects are being paused or shut down, disrupting research, impacting graduate students, and forcing universities to scramble for funding. While some universities are attempting to fill the funding gaps, they warn they cannot cover everything.\n\nThe STEM Education Directorate was the most impacted. Meanwhile, France's Aix-Marseille University has launched a program to attract American researchers facing disruption, offering funding and a supportive environment.\n",
    "chinese_title": "法院允许美国国家科学基金会继续大幅削减10亿美元的研究经费",
    "chinese_summary": "美国法院已允许国家科学基金会（NSF）继续取消超过1700项研究资助，总价值14亿美元。此前，法官驳回了一项要求在审理挑战终止资助诉讼期间恢复这些资助的请求。国家科学基金会发起此次削减，是因为一项政策变更缩小了纳税人资助项目可接受的“更广泛影响”范围，目标是那些专注于多元化、公平和包容（DEI）计划的项目。\n\n教育和科学组织提起的诉讼辩称，国家科学基金会的行为是任意的，违反了正当程序。法官贾·科布裁定，法院无权命令追溯恢复资金，但允许继续挑战国家科学基金会的新拨款政策。\n\n这一决定意味着项目正在暂停或关闭，扰乱研究，影响研究生，并迫使大学争夺资金。虽然一些大学正在试图填补资金缺口，但他们警告说无法覆盖所有内容。\n\nSTEM教育理事会受到的影响最大。与此同时，法国艾克斯-马赛大学启动了一项计划，以吸引面临中断的美国研究人员，提供资金和支持性环境。"
  },
  {
    "id": "45256687",
    "title": "Linux for Nintendo 64 (1997)",
    "url": "https://web.archive.org/web/19990220141243/http://www.heise.de/ix/artikel/E/1997/04/036/",
    "summary": "This article, originally published in the German iX magazine in 1997, discusses an effort to port Linux to the Nintendo 64 (N64). It starts by mentioning earlier, unsuccessful attempts by Netscape and SCO to work with Nintendo for similar network-focused applications.\n\nThe core of the article details an Italian programmer team's success in porting Linux/Mips to the N64. Using a US version of the N64 and a SGI Indy, they overcame challenges primarily related to porting the X Window System to the N64's I/O hardware. While not entirely stable, their implementation achieved impressive XStone scores.\n\nThe article mentions using either the N64 controller or a PC keyboard for input, with limitations on the controller's text entry. Saving data, such as preferences, was possible using an optional controller pack. The prototype faced networking challenges due to issues with the manually soldered network chip.\n\nDespite running in bi-endian mode, Linux/N64 did not utilize the full 64-bit addressing capabilities due to the limited 4MB of memory. Nintendo's refusal to support the project hindered its commercial viability. However, Siemens Nixdorf and Silicon Graphics expressed interest. The Italian developers plan to release the software under the GPL, making it freely available.\n",
    "chinese_title": "任天堂64 Linux (1997)",
    "chinese_summary": "本文最初发表于1997年的德国iX杂志，探讨了一项将Linux移植到任天堂64（N64）的尝试。文章首先提到Netscape和SCO早期与任天堂合作开发类似网络应用，但均未成功。\n\n文章的核心内容详细介绍了意大利程序员团队成功将Linux/Mips移植到N64的过程。他们使用美版N64和SGI Indy工作站，克服了主要与将X Window系统移植到N64的I/O硬件相关的挑战。虽然尚未完全稳定，但他们的实现获得了令人印象深刻的XStone分数。\n\n文章提到可以使用N64手柄或PC键盘进行输入，但手柄的文本输入存在局限性。可以使用可选的控制器记忆卡来保存数据，例如偏好设置。原型机面临网络挑战，原因是手动焊接的网络芯片存在问题。\n\n尽管以双端模式运行，但由于内存只有4MB的限制，Linux/N64并没有充分利用64位寻址能力。任天堂拒绝支持该项目阻碍了其商业可行性。然而，西门子-尼克斯多夫和Silicon Graphics表示了兴趣。意大利开发者计划在GPL下发布该软件，使其可以免费使用。"
  },
  {
    "id": "45292694",
    "title": "This map is not upside down",
    "url": "https://www.maps.com/this-map-is-not-upside-down/",
    "summary": "Joshua Stevens' article \"This Map Is Not Upside Down\" discusses Robert Simmon's world map designed with south oriented at the top, challenging the conventional north-up perspective that dominates modern cartography. The article explains that while the south-up orientation may feel unfamiliar, it's geographically accurate and serves as a reminder that map conventions are not inherently fixed.\n\nThe author delves into the historical context, mentioning that centuries ago, cartographers used various orientations for maps reflecting the tools and knowledge of the time. He highlights the early Chinese use of magnetized devices, where south held a dominant positional significance.\n\nStevens explains that the north-up convention, while not intentionally designed to elevate certain regions, gained prominence through Ptolemy's use of latitude and longitude, enabling easier map copying and expansion. Furthermore, Stevens notes that there is a psychological association with \"good\" being up and \"bad\" being down, which can subconsciously affect map interpretation.\n\nUltimately, Simmon's map serves as both a geographical representation and a philosophical prompt, encouraging viewers to question established traditions and their influences. The article concludes by providing information about Simmon's map, its data sources, and instructions on submitting maps to Maps.com.\n",
    "chinese_title": "这张地图没有倒过来。",
    "chinese_summary": "约书亚·史蒂文斯的文章《这张地图不是上下颠倒的》讨论了罗伯特·西蒙设计的以南方为上的世界地图，挑战了主导现代制图学的传统的北方朝上视角。文章解释说，虽然南方朝上的方向可能让人觉得陌生，但它在地理上是准确的，并提醒人们地图惯例并非天生不变的。\n\n作者深入探讨了历史背景，提到几个世纪前，制图师使用各种方向的地图，反映了当时的工具和知识。他强调了早期中国人使用磁化装置，其中南方具有主要的方位意义。\n\n史蒂文斯解释说，北方朝上的惯例虽然并非有意设计用于提升某些地区，但由于托勒密对纬度和经度的使用而变得突出，从而使地图复制和扩展更容易。此外，史蒂文斯指出，人们存在一种“好”在上而“坏”在下的心理联想，这可能会潜意识地影响地图的解读。\n\n最终，西蒙的地图既是一种地理表示，又是一种哲学提示，鼓励观看者质疑既定传统及其影响。文章最后提供了关于西蒙地图的信息、其数据来源以及向Maps.com提交地图的说明。"
  },
  {
    "id": "45295794",
    "title": "AI tools are making the world look weird",
    "url": "https://strat7.com/blogs/weird-in-weird-out/",
    "summary": "This blog post, titled \"AI tools are making the world look weird,\" explores the unintended and often bizarre consequences of relying heavily on AI. Under the \"Analytics & AI\" section and humorously subtitled \"WEIRD in, WEIRD out,\" the article likely argues that flaws in data (WEIRD - Western, Educated, Industrialized, Rich, and Democratic populations) used to train AI models are leading to skewed and unrealistic outputs, effectively making the world look \"weird.\"\n\nThe core argument is that AI, despite its potential, is heavily reliant on the data it's trained on. If that data is biased towards a specific demographic or viewpoint (WEIRD), the resulting AI will perpetuate and even amplify those biases, leading to inaccurate representations and potentially harmful outcomes in areas like image generation, natural language processing, and even critical decision-making systems.\n\nThe article likely discusses examples of how this bias manifests, perhaps showcasing AI-generated images with unrealistic body types or features, or highlighting instances where AI systems struggle to understand or respond appropriately to language or cultural contexts outside of the \"WEIRD\" norm.\n\nUltimately, the post probably calls for greater awareness of data bias in AI development and a concerted effort to diversify training data to create more representative and equitable AI systems that better reflect the complexities and diversity of the real world. The \"WEIRD in, WEIRD out\" subtitle emphasizes the cyclical nature of this problem, suggesting that biased data will inevitably lead to biased and, ultimately, \"weird\" outputs.\n",
    "chinese_title": "AI工具正在让世界变得怪异。",
    "chinese_summary": "人工智能工具让世界变得怪异\n\n这篇题为《人工智能工具让世界变得怪异》的博文，探讨了过度依赖人工智能所带来的意想不到且往往是怪诞的后果。文章归类于“分析与人工智能”版块，并以幽默的副标题“怪异输入，怪异输出”为题，可能论证了用于训练人工智能模型的数据中的缺陷（怪异 - 指西方、受过教育、工业化、富裕和民主的人口）导致了扭曲和不切实际的输出，从而使世界看起来“怪异”。\n\n其核心论点是，人工智能虽然具有潜力，但严重依赖于训练它的数据。如果这些数据偏向于特定的人群或观点（怪异），那么由此产生的人工智能将延续甚至放大这些偏见，从而导致不准确的表示，并在图像生成、自然语言处理，甚至关键决策系统等领域产生潜在的有害结果。\n\n文章可能讨论了这种偏见如何体现的例子，也许展示了具有不切实际的体型或特征的人工智能生成的图像，或者强调了人工智能系统难以理解或适当地回应“怪异”规范之外的语言或文化背景的实例。\n\n最终，这篇文章可能呼吁人们更加关注人工智能开发中的数据偏见，并共同努力使训练数据多样化，从而创建更具代表性和公平性的人工智能系统，更好地反映现实世界的复杂性和多样性。“怪异输入，怪异输出”的副标题强调了这个问题循环的本质，表明有偏差的数据将不可避免地导致有偏差的，最终是“怪异”的输出。"
  },
  {
    "id": "45283887",
    "title": "Slack has raised our charges by $195k per year",
    "url": "https://skyfall.dev/posts/slack",
    "summary": "Hack Club, a nonprofit providing coding education to teenagers, faced a sudden and drastic price hike from Slack. After years of happily paying $5,000 annually, Slack informed them they would need to pay an additional $50,000 within a week and then $200,000 per year to avoid workspace deactivation and the deletion of their message history.\n\nThe author argues that this demand from Salesforce, Slack's parent company, amounts to extortion, as it provides insufficient time for the nonprofit to adjust to such a significant increase. The abrupt notice disrupted Hack Club's operations, forcing staff and volunteers to scramble to migrate systems and rebuild integrations.\n\nFollowing public outcry sparked by the author's viral post on Hacker News and Twitter/X, Slack's CEO contacted Hack Club and offered a resolution that was better than the previous plan. While the specifics are not detailed, the situation was resolved to Hack Club's satisfaction.\n\nThe experience led Hack Club to prioritize data ownership and move to Mattermost. The author encourages other small businesses to consider similar strategies to avoid reliance on external SaaS providers and ensure control over their data.\n",
    "chinese_title": "Slack 每年向我们增加了 19.5 万美元的费用。",
    "chinese_summary": "为青少年提供编程教育的非营利组织Hack Club突然面临Slack大幅涨价。多年来一直愉快地支付每年5000美元费用后，Slack通知他们，他们需要在一周内额外支付5万美元，然后每年支付20万美元，以避免工作区停用和消息历史记录删除。\n\n作者认为，Slack的母公司Salesforce的这一要求无异于勒索，因为它没有给该非营利组织足够的时间来适应如此大幅度的增长。这突如其来的通知扰乱了Hack Club的运营，迫使员工和志愿者争先恐后地迁移系统并重建集成。\n\n在作者在Hacker News和Twitter/X上的病毒式帖子引发公众强烈抗议后，Slack的首席执行官联系了Hack Club，并提供了一个比之前计划更好的解决方案。虽然具体细节未详细说明，但情况已解决，Hack Club对此表示满意。\n\n这次经历促使Hack Club优先考虑数据所有权并迁移到Mattermost。作者鼓励其他小型企业考虑类似的策略，以避免依赖外部SaaS提供商并确保对其数据的控制。"
  },
  {
    "id": "45248242",
    "title": "Tracking trust with Rust in the kernel",
    "url": "https://lwn.net/Articles/1034603/",
    "summary": "This LWN.net article from September 3, 2025, discusses Benno Lossin's proposed API for handling untrusted data in the Linux kernel Rust code. The API introduces a new `Untrusted` type to mark data originating from sources like user space, network connections, or removable storage. The core idea is to use Rust's type system to prevent accidental misuse of untrusted data. `Untrusted` is a transparent wrapper, adding no runtime overhead, but causing compiler errors if the value is used directly without validation.\n\nThe patch set includes documentation and utility functions, specifically for slices and vectors of untrusted values. It recommends writing functions that fill buffers with user-space data using `&mut [Untrusted<u8>]`. To actually use the data, the API introduces a `Validate` trait, which encapsulates the logic for converting `Untrusted<S>` into a safe, validated type `T`.\n\nGreg Kroah-Hartman requested an example driver using `Untrusted`, and Lossin provided a sketch using `ioctl()`. The example shows how to validate `ioctl()` arguments based on the command, using an enum and the `Untrusted<IoctlArgs>` type.\n\nKroah-Hartman also raised the issue of TOCTOU bugs (time-of-check time-of-use), where data is validated before being copied. Lossin's design uses `UserPtr` and `UserSlice` types to represent pointers and slices in user space, and proposes modifying `UserSlice::read_all()` to mark read bytes as untrusted.\n\nThe article concludes by noting that the API may require significant changes to Rust driver interfaces and is likely to be discussed at the upcoming Kangrejos conference. The comment section reflects on the advantages and potential pitfalls of the proposed API.\n",
    "chinese_title": "在内核中使用 Rust 追踪信任",
    "chinese_summary": "2025年9月3日 LWN.net 文章探讨了 Benno Lossin 提出的用于处理 Linux 内核 Rust 代码中非信任数据的 API。该 API 引入了一种新的 `Untrusted` 类型来标记来自用户空间、网络连接或可移动存储等来源的数据。核心思想是使用 Rust 的类型系统来防止意外滥用非信任数据。`Untrusted` 是一个透明的包装器，不增加运行时开销，但如果未经验证直接使用该值，则会导致编译器错误。\n\n该补丁集包括文档和实用工具函数，特别是用于非信任值的切片和向量。它建议编写使用 `&mut [Untrusted<u8>]` 填充用户空间数据的缓冲区函数。为了实际使用数据，该 API 引入了一个 `Validate` trait，它封装了将 `Untrusted<S>` 转换为安全、经过验证的类型 `T` 的逻辑。\n\nGreg Kroah-Hartman 要求提供一个使用 `Untrusted` 的示例驱动程序，Lossin 提供了一个使用 `ioctl()` 的草图。该示例展示了如何基于命令验证 `ioctl()` 参数，使用枚举和 `Untrusted<IoctlArgs>` 类型。\n\nKroah-Hartman 还提出了 TOCTOU 漏洞（检查时间和使用时间之间存在差异）的问题，即数据在被复制之前会被验证。 Lossin 的设计使用 `UserPtr` 和 `UserSlice` 类型来表示用户空间中的指针和切片，并建议修改 `UserSlice::read_all()` 将读取的字节标记为非信任。\n\n文章最后指出，该 API 可能需要对 Rust 驱动程序接口进行重大更改，并很可能在即将举行的 Kangrejos 会议上进行讨论。评论部分反映了所提出的 API 的优点和潜在缺陷。"
  },
  {
    "id": "45257241",
    "title": "JIT-ing a stack machine (with SLJIT)",
    "url": "https://bullno1.com/blog/jiting-a-stack-machine",
    "summary": "This article details the author's experience JIT-compiling a stack machine (specifically the uxn VM) using the SLJIT library. The goal was to improve performance, particularly on smaller devices, by replacing the existing bytecode interpreter with JIT-compiled code.\n\nThe author outlines the planned JIT compilation process: checking for existing JITed code, statically tracing code blocks, JITing with SLJIT, and caching the result. A quick primer on SLJIT is provided, explaining its portable assembly interface and register management.\n\nChallenges encountered include determining the number of registers to use (solved with enums), handling memory addressing limitations on x86-32 (addressed with `buxn_jit_set_mem_base`), and managing register allocation for operands (using a bitmap to track used registers). The implementation of a simple opcode (SUB) demonstrates the register allocation and code emission process.\n\nThe article highlights the issue of dynamic jumps, where the target is only known at runtime. A trampoline technique is implemented, where JITed functions return the next program counter (PC) to the trampoline, allowing for indirect jumps. The JIT compiler resembles an interpreter loop, statically tracing bytecode and calling opcode handlers.\n\nHowever, the initial JIT implementation yielded disappointing performance. The frequent dynamic jumps caused the JIT runtime to resemble a slow switch dispatch, negating the benefits of native compilation and optimized branch prediction in the original interpreter. Naive memory load and store operations for stack pushes and pops also contributed to the poor performance. The article concludes by emphasizing the importance of call optimization and memory access strategies for achieving true performance gains in a JIT compiler.\n",
    "chinese_title": "使用SLJIT即时编译栈式虚拟机",
    "chinese_summary": "本文详细介绍了作者使用 SLJIT 库对栈式虚拟机（特别是 uxn VM）进行 JIT 编译的经验。目标是通过用 JIT 编译的代码替换现有的字节码解释器，从而提高性能，尤其是在较小的设备上。\n\n作者概述了计划的 JIT 编译过程：检查现有 JIT 代码，静态跟踪代码块，使用 SLJIT 进行 JIT 编译，并缓存结果。文章简要介绍了 SLJIT，解释了其可移植的汇编接口和寄存器管理。\n\n遇到的挑战包括确定要使用的寄存器数量（使用枚举解决）、处理 x86-32 上的内存寻址限制（使用 `buxn_jit_set_mem_base` 解决）以及管理操作数的寄存器分配（使用位图跟踪已用寄存器）。一个简单的操作码 (SUB) 的实现演示了寄存器分配和代码生成过程。\n\n文章强调了动态跳转的问题，即目标只有在运行时才知道。文章实现了一种 trampoline 技术，其中 JIT 编译的函数将下一个程序计数器 (PC) 返回给 trampoline，从而允许间接跳转。JIT 编译器类似于解释器循环，静态跟踪字节码并调用操作码处理程序。\n\n然而，最初的 JIT 实现产生了令人失望的性能。频繁的动态跳转导致 JIT 运行时类似于缓慢的 switch 分发，抵消了原生编译的优势和原始解释器中优化的分支预测。用于堆栈推送和弹出的简单内存加载和存储操作也导致了性能不佳。文章最后强调了调用优化和内存访问策略对于在 JIT 编译器中实现真正的性能提升的重要性。"
  },
  {
    "id": "45257241",
    "title": "JIT-ing a stack machine (with SLJIT)",
    "url": "https://bullno1.com/blog/jiting-a-stack-machine",
    "summary": "This article details the author's journey of implementing a JIT (Just-In-Time) compiler for the uxn stack machine using the SLJIT library. The goal was to improve bytecode execution speed for a bytebeat-inspired live editing environment.\n\nThe initial plan involved a method JIT: checking for previously JIT'ed entry points, statically tracing code blocks, JIT compiling with SLJIT, and caching the compiled code. SLJIT's \"portable assembly\" approach allowed the author to leverage existing assembly knowledge. Key challenges included managing registers (solved with enums for saved and scratch registers), handling memory addressing limitations on x86-32, and allocating registers for operands using a bitmap-based approach.\n\nDynamic jumps, a feature of uxn where jump targets are only known at runtime, were addressed using a trampoline technique, returning the new program counter (PC) from the JIT'ed function. The compiler traced bytecode, handling opcodes and terminating upon encountering a BRK instruction.\n\nHowever, initial performance results were disappointing. Frequent returns to the trampoline due to dynamic jumps effectively turned the JIT runtime into a switch dispatch, negating the benefits of native compilation. Naive memory load and store implementations for stack operations (push and pop) further hampered performance due to memory access latency.\n\nThe article concludes by identifying branch prediction and memory access as key areas for future optimization, with a focus on static call identification to leverage processor-level call/return prediction.\n",
    "chinese_title": "使用SLJIT即时编译栈式虚拟机",
    "chinese_summary": "本文详细介绍了作者使用SLJIT库为uxn堆栈机实现JIT（即时）编译器的过程。目标是提高受字节跳动启发的实时编辑环境的字节码执行速度。\n\n最初的计划涉及方法JIT：检查先前JIT编译的入口点，静态跟踪代码块，使用SLJIT进行JIT编译，并缓存编译后的代码。SLJIT的“可移植汇编”方法使作者能够利用现有的汇编知识。关键挑战包括管理寄存器（使用枚举解决保存和暂存寄存器问题），处理x86-32上的内存寻址限制，以及使用基于位图的方法为操作数分配寄存器。\n\n动态跳转是uxn的一个特性，跳转目标仅在运行时才知道，通过使用跳转表技术解决，从JIT编译的函数返回新的程序计数器（PC）。编译器跟踪字节码，处理操作码并在遇到BRK指令时终止。\n\n然而，最初的性能结果令人失望。由于动态跳转而频繁返回到跳转表有效地将JIT运行时变成了一个switch分发，抵消了原生编译的优势。用于堆栈操作（push和pop）的简单内存加载和存储实现进一步阻碍了性能，原因是内存访问延迟。\n\n文章最后指出，分支预测和内存访问是未来优化的关键领域，重点是静态调用识别，以利用处理器级别的调用/返回预测。"
  },
  {
    "id": "45300810",
    "title": "YouTube downloaders (and how Google silenced the press)",
    "url": "https://windowsread.me/p/best-youtube-downloaders",
    "summary": "Chris Hoffman argues that while Google discourages the use and discussion of YouTube downloaders, they are ethical, necessary, and even secretly beneficial to Google's dominance in video hosting. He provides a list of recommended free YouTube downloaders: Stacher (Windows, Mac, Linux), yt-dlp (command line), Cobalt.tools (web-based, though currently blocked by Google), and NewPipe (Android).\n\nHoffman contends that YouTube downloaders allow users to archive important content, mirroring the function of saving web pages or images. He argues Google tacitly allows downloaders because completely locking down YouTube would drive users to more flexible platforms. He claims that Google has historically used its ad network to silence publications (like How-To Geek) that write about YouTube downloaders by threatening ad revenue, though this is less overt now. He argues that while Google doesn't want users openly downloading YouTube videos, the process is not impossible, maintaining an escape hatch that contributes to the video platform's success. He concludes with the justification for downloading videos in the age of AI content scraping and backs up his argument by mentioning EULA's that no one reads or follows.\n",
    "chinese_title": "YouTube下载器（以及谷歌如何让媒体噤声）",
    "chinese_summary": "克里斯·霍夫曼认为，尽管谷歌不鼓励使用和讨论YouTube下载器，但它们是合乎道德的、必要的，甚至暗中对谷歌在视频托管领域的统治地位有利。他提供了一个推荐的免费YouTube下载器列表：Stacher (Windows, Mac, Linux), yt-dlp (命令行), Cobalt.tools (基于网页，但目前被谷歌屏蔽), 和 NewPipe (Android)。\n\n霍夫曼认为，YouTube下载器允许用户存档重要内容，类似于保存网页或图像的功能。他认为谷歌默许下载器的存在，因为完全封锁YouTube会将用户赶到更灵活的平台。他声称，谷歌历史上曾通过威胁广告收入来压制报道YouTube下载器的出版物（如How-To Geek），尽管现在这种做法不那么明显了。他认为，虽然谷歌不希望用户公开下载YouTube视频，但这个过程并非不可能，保持着一个有助于视频平台成功的“逃生舱”。最后，他通过提及无人阅读或遵守的最终用户许可协议来支持他的论点，并为在AI内容抓取时代下载视频辩护。"
  },
  {
    "id": "45292648",
    "title": "Learn Your Way: Reimagining Textbooks with Generative AI",
    "url": "https://research.google/blog/learn-your-way-reimagining-textbooks-with-generative-ai/",
    "summary": "This Google Research article introduces \"Learn Your Way,\" a research experiment on Google Labs exploring how generative AI (GenAI) can transform textbooks into personalized and engaging learning experiences. The project addresses the limitation of one-size-fits-all textbooks by using GenAI to automatically generate alternative representations and personalized examples.\n\nLearn Your Way is built on two key pillars: generating diverse, multimodal representations of content (like mind maps, narrated slides, and audio lessons) and personalizing content based on student grade level and interests. The system utilizes LearnLM and Gemini 2.5 Pro to re-level text, replace generic examples, and create varied content formats.\n\nAn efficacy study with students aged 15-18 showed significant improvements in learning outcomes. Students using Learn Your Way scored 9% higher on immediate assessments and 11% higher on retention tests compared to those using a traditional digital PDF reader. User sentiment was also positive, with students reporting increased comfort with assessments and a desire to use Learn Your Way in the future.\n\nThe article highlights positive pedagogical evaluations by subject matter experts. Several example experiences are available on Google Labs, covering topics like the immune system, economies, and sociology. The authors envision further personalization moving towards systems that adapt to each learner's unique needs and progress.\n",
    "chinese_title": "用你的方式学习：用生成式AI重新构想教科书",
    "chinese_summary": "谷歌研究文章介绍“学你所想”，这是 Google Labs 上的一个研究实验，探索生成式 AI (GenAI) 如何将教科书转变为个性化和引人入胜的学习体验。该项目通过使用 GenAI 自动生成替代表示形式和个性化示例，解决了“一刀切”教科书的局限性。\n\n“学你所想”建立在两个关键支柱之上：生成多样化的、多模态的内容表示形式（如思维导图、旁白幻灯片和音频课程），并根据学生的年级和兴趣个性化内容。该系统利用 LearnLM 和 Gemini 2.5 Pro 重新调整文本难度、替换通用示例并创建各种内容格式。\n\n一项针对 15-18 岁学生的有效性研究表明，学习成果有了显著提高。与使用传统数字 PDF 阅读器的学生相比，使用“学你所想”的学生在即时评估中得分高出 9%，在记忆测试中得分高出 11%。用户情绪也很积极，学生报告说对评估的接受度更高，并希望将来使用“学你所想”。\n\n该文章强调了学科专家对教学法的积极评价。Google Labs 上提供了几个示例体验，涵盖免疫系统、经济学和社会学等主题。作者设想进一步的个性化将朝着适应每个学习者独特需求和进度的系统发展。"
  },
  {
    "id": "45296403",
    "title": "Llama-Factory: Unified, Efficient Fine-Tuning for 100 Open LLMs",
    "url": "https://github.com/hiyouga/LLaMA-Factory",
    "summary": "Llama-Factory is a unified and efficient fine-tuning tool for over 100 open-source large language models (LLMs) from various providers like Amazon, NVIDIA, and Aliyun. It offers a user-friendly interface (CLI and Web UI) requiring minimal coding for fine-tuning.\n\nThe platform supports diverse models including LLaMA, LLaVA, Mistral, Qwen, Gemma, and ChatGLM, among others. It integrates various training methods such as pre-training, supervised fine-tuning, and reinforcement learning techniques like PPO, DPO, and KTO. Llama-Factory facilitates scalable resource utilization through techniques like LoRA and QLoRA, along with advanced algorithms like GaLore and DoRA. It also implements practical tricks like FlashAttention-2 and Unsloth to improve performance.\n\nLlama-Factory supports a wide range of tasks including multi-turn dialogue, tool use, image understanding, and more. Experiment monitoring is supported through tools like LlamaBoard, Wandb, and SwanLab. Faster inference is achieved using OpenAI-style APIs and vLLM.\n\nThe platform provides numerous datasets for pre-training and supervised fine-tuning and has been used in diverse applications like mental health, role-playing, and information extraction. Day-N support ensures compatibility with the latest models. The project is actively maintained with frequent updates and improvements.\n",
    "chinese_title": "Llama工厂：统一高效的百种开源LLM微调",
    "chinese_summary": "Llama-Factory 是一个统一且高效的微调工具，支持来自 Amazon、NVIDIA 和阿里云等不同提供商的 100 多个开源大型语言模型 (LLM)。它提供用户友好的界面（CLI 和 Web UI），只需极少的编码即可进行微调。\n\n该平台支持多种模型，包括 LLaMA、LLaVA、Mistral、Qwen、Gemma 和 ChatGLM 等。它集成了各种训练方法，如预训练、监督式微调以及强化学习技术（如 PPO、DPO 和 KTO）。Llama-Factory 通过 LoRA 和 QLoRA 等技术以及 GaLore 和 DoRA 等高级算法，促进可扩展的资源利用。它还实现了 FlashAttention-2 和 Unsloth 等实用技巧来提高性能。\n\nLlama-Factory 支持广泛的任务，包括多轮对话、工具使用、图像理解等。通过 LlamaBoard、Wandb 和 SwanLab 等工具支持实验监控。使用 OpenAI 风格的 API 和 vLLM 可以实现更快的推理。\n\n该平台为预训练和监督式微调提供大量数据集，并已应用于心理健康、角色扮演和信息提取等多种应用。Day-N 支持确保与最新模型的兼容性。该项目正在积极维护，并进行频繁的更新和改进。"
  },
  {
    "id": "45261566",
    "title": "Rupert's snub cube and other Math Holes",
    "url": "http://tom7.org/ruperts/",
    "summary": "This article, titled \"Rupert's Snub Cube and other Math Holes,\" focuses on cubes and related shapes explored from various mathematical perspectives. It's built on the foundation of a previous work, \"Some upsetting things about shapes (that we already knew),\" implying a deep dive into the familiar aspects of these shapes.\n\nThe author invites readers to explore the topic further through several avenues: a challenging video game version, a visually calming video version with formal verification, and 3D models of Platonic, Archimedean, and Catalan solids, along with models of less appealing convex polyhedra.\n\nThe article encourages readers to engage actively by attempting to find solutions themselves or identify errors in the provided source code, suggesting the availability of code requiring a C++ compiler and a willingness to modify it.\n\nUltimately, the author seeks feedback through comments on their blog or by observing their infrequent posts on social media platforms like BlueSky or Mastodon. The article concludes by directing readers to a broader collection of the author's work at [tom7.org]. In essence, it's an invitation to delve into the intricacies of cubes and related shapes, with multiple paths for engagement and a request for community feedback.\n",
    "chinese_title": "鲁珀特的截角立方体和其他数学洞穴",
    "chinese_summary": "本文题为《鲁珀特立方体和其他数学漏洞》，侧重于从各种数学角度探索立方体及相关形状。它建立在先前作品《关于形状的一些令人不安的事情（我们已经知道的）》的基础上，暗示着对这些形状的熟悉方面的深入研究。\n\n作者邀请读者通过以下几种方式进一步探索该主题：一个具有挑战性的视频游戏版本，一个带有形式验证的、视觉上令人平静的视频版本，以及柏拉图、阿基米德和卡塔兰立体的3D模型，以及不太吸引人的凸多面体的模型。\n\n本文鼓励读者积极参与，尝试自己寻找解决方案或识别所提供的源代码中的错误，这表明存在需要C++编译器并愿意修改的代码。\n\n最后，作者希望通过在其博客上发表评论或通过观察他们在BlueSky或Mastodon等社交媒体平台上不经常发布的帖子来获取反馈。文章最后将读者引导至[tom7.org]上作者更广泛的作品集。本质上，这是一份邀请，邀请您深入研究立方体及相关形状的复杂性，并提供多种参与途径和征求社区反馈的请求。"
  },
  {
    "id": "45301403",
    "title": "The sordid reality of retirement villages: Residents are being milked for profit",
    "url": "https://unherd.com/2025/09/the-sordid-truth-about-retriement-villages/",
    "summary": "Alex Taylor's article \"The sordid reality of retirement villages: Residents are being milked for profit\" exposes the often-glamorized image of retirement villages as a deceptive facade. Taylor interweaves personal experience with broader research to reveal a system where residents face exorbitant fees, declining property value returns, and potential exploitation.\n\nWhile marketed as thriving communities with various amenities, the reality involves high service charges, ground rents, and complex buy-back agreements that leave families financially vulnerable. The author describes a disconnect between the advertised lifestyle and the actual experience, citing instances of neglect and a focus on profit over resident well-being. The elderly are often not thriving and active, but rather are there to be milked of their resources and savings.\n\nThe article highlights the financial disadvantages of retirement village living. It also mentions the potential benefits of social interaction and reduced loneliness. The author criticizes the current system for prioritizing profit over care. The article finishes by highlighting the urgent need for reform to protect vulnerable older people from exploitation in these independent living schemes.\n",
    "chinese_title": "养老院的肮脏现实：居民沦为牟利工具",
    "chinese_summary": "亚历克斯·泰勒的文章《养老社区的肮脏现实：住户被榨取利润》揭露了养老社区常常被美化的形象实则是一个欺骗性的外表。泰勒将个人经历与更广泛的研究相结合，揭示了一个住户面临高昂费用、房产价值回报下降以及潜在剥削的系统。\n\n虽然养老社区被宣传为拥有各种便利设施的蓬勃发展的社区，但现实情况却涉及高昂的服务费、地租和复杂的购回协议，这些都让家庭在经济上不堪一击。作者描述了广告宣传的生活方式与实际体验之间的脱节，并列举了忽视和关注利润而非住户福祉的例子。老年人往往不是在蓬勃发展和积极生活，而是被剥削他们的资源和储蓄。\n\n这篇文章强调了养老社区生活的经济劣势，同时也提到了社会互动和减少孤独的潜在好处。作者批评了当前这种以利润为先、忽略关怀的制度。文章最后强调迫切需要改革，以保护弱势老年人在这些独立生活计划中免受剥削。"
  },
  {
    "id": "45297258",
    "title": "Playing “Minecraft” without Minecraft (2024)",
    "url": "https://lenowo.org/viewtopic.php?t=5",
    "summary": "This article provides a guide on how to play a version of \"Minecraft\" without using any official Mojang code. It achieves this by utilizing community-developed cleanroom implementations of the game's client and server.\n\nThe guide outlines the necessary software components: Cuberite (a C++ based Minecraft server), ViaProxy (a Java-based protocol translator), and Minosoft (a Kotlin-based Minecraft client). It details the system requirements for running these components, emphasizing the need for a 64-bit computer with sufficient processing power, RAM, and an OpenGL-capable graphics card.\n\nThe article then provides step-by-step instructions on how to install and configure each component: downloading and running the Cuberite server, downloading and setting up ViaProxy to bridge the protocol difference between the server and client versions, and obtaining Minosoft from GitHub Actions.\n\nFinally, it explains how to launch Minosoft, create a player account, configure the server connection details within the client (pointing to the ViaProxy IP and port), and connect to the Cuberite server. A troubleshooting section addresses a common connection issue related to Cuberite's online mode login requirement and provides a solution to disable authentication. In essence, the guide empowers users to experience a \"Minecraft\"-like experience built entirely from open-source alternatives.\n",
    "chinese_title": "不玩《我的世界》玩《我的世界》(2024)",
    "chinese_summary": "本文介绍如何在不使用任何 Mojang 官方代码的情况下游玩一个版本的“Minecraft”。 它通过利用社区开发的对游戏客户端和服务器的洁净室实现来实现这一点。\n\n本指南概述了必要的软件组件：Cuberite (一个基于 C++ 的 Minecraft 服务器)、ViaProxy (一个基于 Java 的协议转换器) 和 Minosoft (一个基于 Kotlin 的 Minecraft 客户端)。 它详细介绍了运行这些组件的系统要求，强调需要一台具有足够处理能力、RAM 和支持 OpenGL 的显卡的 64 位计算机。\n\n然后，本文提供了有关如何安装和配置每个组件的分步说明：下载并运行 Cuberite 服务器，下载并设置 ViaProxy 以桥接服务器和客户端版本之间的协议差异，以及从 GitHub Actions 获取 Minosoft。\n\n最后，它解释了如何启动 Minosoft、创建玩家帐户、在客户端中配置服务器连接详细信息（指向 ViaProxy 的 IP 和端口），以及连接到 Cuberite 服务器。 故障排除部分解决了与 Cuberite 的在线模式登录要求相关的常见连接问题，并提供了禁用身份验证的解决方案。 本质上，该指南使用户能够体验完全由开源替代方案构建的类似“Minecraft”的体验。"
  },
  {
    "id": "45288161",
    "title": "Nvidia buys $5B in Intel",
    "url": "https://www.tomshardware.com/pc-components/cpus/nvidia-and-intel-announce-jointly-developed-intel-x86-rtx-socs-for-pcs-with-nvidia-graphics-also-custom-nvidia-data-center-x86-processors-nvidia-buys-usd5-billion-in-intel-stock-in-seismic-deal",
    "summary": "Nvidia and Intel have announced a surprising partnership involving joint development of x86 products and a $5 billion Nvidia investment in Intel. The collaboration includes:\n\n*   **Intel x86 RTX SOCs:** New x86 Intel CPUs fused with Nvidia RTX graphics chiplets for consumer gaming PCs, aimed at competing with AMD APUs in thin-and-light gaming laptops and small form-factor PCs. These chips will use NVLink for faster CPU-to-GPU communication and have uniform memory access.\n*   **Custom x86 Data Center CPUs:** Intel will build custom x86 data center CPUs for Nvidia's AI products, leveraging NVLink technology for enhanced CPU-GPU communication. Nvidia will then sell these as its own products. The extent of modifications to the CPUs is yet to be fully disclosed.\n*   **Nvidia Investment:** Nvidia will purchase $5 billion in Intel common stock, representing approximately a 5% ownership stake, subject to regulatory approval.\n\nNvidia emphasizes its commitment to existing product roadmaps, indicating that this partnership is additive to their current initiatives. While the manufacturing location is uncertain, Intel could potentially fabricate some of the Nvidia-custom x86 silicon in its own foundries. This partnership leverages the NVLink interface for improved bandwidth and lower latency compared to PCIe. The partnership aims to combine Nvidia's AI and accelerated computing with Intel's x86 ecosystem.",
    "chinese_title": "英伟达收购英特尔价值50亿美元股份",
    "chinese_summary": "英伟达与英特尔宣布合作，共同开发x86产品，英伟达将投资50亿美元。合作内容包括：\n\n*   **英特尔x86 RTX SOC：** 全新的x86英特尔CPU与英伟达RTX显卡芯片融合，面向消费级游戏PC，旨在与AMD APU在轻薄游戏笔记本和小尺寸PC市场竞争。这些芯片将使用NVLink实现更快的CPU到GPU通信和统一内存访问。\n*   **定制x86数据中心CPU：** 英特尔将为英伟达的AI产品构建定制的x86数据中心CPU，利用NVLink技术增强CPU-GPU通信。英伟达随后将作为自己的产品销售这些CPU。CPU的修改程度尚未完全披露。\n*   **英伟达投资：** 英伟达将购买价值50亿美元的英特尔普通股，约占5%的股份，需经监管部门批准。\n\n英伟达强调其对现有产品路线图的承诺，表明此次合作是对其现有计划的补充。虽然制造地点尚未确定，但英特尔有可能在其自己的代工厂中制造一些英伟达定制的x86芯片。此次合作利用NVLink接口实现比PCIe更高的带宽和更低的延迟。该合作旨在将英伟达的AI和加速计算与英特尔的x86生态系统相结合。"
  },
  {
    "id": "45303496",
    "title": "Texas A&M president to step down after turmoil over gender identity lesson",
    "url": "https://thehill.com/homenews/education/5511704-texas-am-president-to-step-down-after-turmoil-over-gender-identity-lesson/",
    "summary": "Texas A&M University President M. Katherine Banks resigned following controversy surrounding a faculty-led diversity, equity, and inclusion (DEI) training session on gender identity that was perceived as being against Texas law. The lesson, which was deemed inappropriate and at odds with the university's values by some, triggered a wave of criticism from state officials and conservative groups.\n\nThe controversy escalated after Texas A&M suspended, and then reinstated, the professor who organized the training, Joy Alonzo, following accusations from a Republican lawmaker that she had criticized Lt. Gov. Dan Patrick during the session, which Alonzo denied. This action, and the university's handling of the situation, sparked further criticism and concerns about academic freedom and political interference in university affairs.\n\nBanks cited the need for a \"consistent direction\" and stated her intention to retire immediately, claiming it was in the best interest of the university. The Board of Regents accepted her resignation. The controversy highlights the tension between DEI initiatives and state laws, particularly in conservative states like Texas, and raises concerns about the politicization of higher education. The future of DEI programs at Texas A&M and other Texas universities remains uncertain in the wake of this event.\n",
    "chinese_title": "德州农工大学校长将在性别认同课程风波后卸任",
    "chinese_summary": "德州农工大学校长M·凯瑟琳·班克斯因教师主导的关于性别认同的多元、公平和包容（DEI）培训课程引发争议而辞职，该课程被认为违反了德克萨斯州法律。 该课程被一些人认为不恰当且与大学价值观相悖，引发了州政府官员和保守团体的强烈批评。\n\n在共和党议员指控组织这次培训的教授乔伊·阿隆佐在课程中批评了副州长丹·帕特里克（阿隆佐否认了这一指控）后，德州农工大学暂停了阿隆佐的职务，然后又恢复了她的职务，这使得争议进一步升级。 这一行动以及大学对此事的处理，引发了更多的批评，以及对学术自由和政治干预大学事务的担忧。\n\n班克斯以需要“一致的方向”为由，表示她打算立即退休，并声称这符合大学的最佳利益。 校董会接受了她的辞呈。 这场争议凸显了DEI倡议与州法律之间的紧张关系，尤其是在像德克萨斯州这样的保守州，并引发了人们对高等教育政治化的担忧。 在这一事件发生后，德州农工大学和其他德克萨斯州大学的DEI项目的未来仍然不明朗。"
  },
  {
    "id": "45288690",
    "title": "KDE is now my favorite desktop",
    "url": "https://kokada.dev/blog/kde-is-now-my-favorite-desktop/",
    "summary": "This blog post details the author's positive experience switching to KDE as their desktop environment, primarily for its user-friendliness for their wife but ultimately finding it surprisingly excellent. They praise KDE's feature-completeness, even comparing it favorably to Windows and macOS. Specific examples include the detailed network applet information, the integrated screenshot tool with its smart cropping features, and the powerful \"Window Rules\" for application customization.\n\nThe author highlights KDE's well-integrated tools, such as easy Flatpak permission management and access to hardware information via the Info Center, eliminating the need for many third-party programs. They also commend KDE's speed, finding it faster than Windows 11 on the same hardware and comparable to macOS on a MacBook Pro. While noting a minor initial issue with taskbar placement due to multiple monitors, the author ultimately concludes that KDE provides their first truly enjoyable desktop environment experience on Linux. They give credit to the KDE developers for creating such a polished and feature-rich experience.\n",
    "chinese_title": "KDE现在是我最喜欢的桌面。",
    "chinese_summary": "作者切换到 KDE 桌面环境的积极体验：为妻子而始，惊艳于自身\n\n这篇博文详细介绍了作者切换到 KDE 作为桌面环境的积极体验。起初主要是为了 KDE 对其妻子的用户友好性，但最终发现它出乎意料的优秀。作者称赞 KDE 的功能完整性，甚至将其与 Windows 和 macOS 相提并论。具体的例子包括详细的网络小程序信息、集成了智能裁剪功能的屏幕截图工具，以及用于应用程序定制的强大的“窗口规则”。\n\n作者强调了 KDE 集成良好的工具，例如简便的 Flatpak 权限管理和通过信息中心访问硬件信息，从而无需许多第三方程序。他们还赞扬了 KDE 的速度，发现它在相同的硬件上比 Windows 11 更快，并且与 MacBook Pro 上的 macOS 相媲美。虽然注意到由于多个显示器导致的任务栏放置出现了一个小问题，但作者最终得出结论，KDE 提供了他们在 Linux 上第一次真正令人愉快的桌面环境体验。他们赞扬 KDE 开发者创造了如此精致且功能丰富的体验。"
  },
  {
    "id": "45289453",
    "title": "Flipper Zero Geiger Counter",
    "url": "https://kasiin.top/blog/2025-08-04-flipper_zero_geiger_counter_module/",
    "summary": "This document describes two Flipper Zero applications for interacting with a Geiger counter: a standard Geiger Counter app and an Atomic Dice Roller app. Both apps require third-party firmware (unleashed or Momentum are recommended).\n\nThe Geiger Counter app displays real-time radioactivity measurements in Counts Per Second (CPS) and Counts Per Minute (CPM), with options to change displayed units (μSv/h, mSv/y, etc.). It includes features for recording data to CSV files (stored on the SD card), zooming the graph, and clearing the display. It also has a test function using the A4 and A7 GPIO pins. Button assignments control these features. The app is designed to detect beta and gamma rays and can be used to measure the radioactivity of various sources, including uranium ore, radium dials, uranium pottery, and americium from smoke detectors. It notes that measurements in Sv or Rad are not precise and provides a list of usable and unusable radioactive sources based on the types of radiation emitted.\n\nThe Atomic Dice Roller app uses the Geiger counter to generate true random numbers based on detected beta or gamma rays. It hashes timestamps from these detections using either CRC32 (for low activity) or MD5 (for high activity) algorithms. It provides dice rolls (1-6) or coin flips (0-1) using the random numbers generated. The app displays CPS in the left corner and the number of available rolls in the right corner. The article also includes a disclaimer stating that both apps are for educational purposes only and should be used responsibly and on the user's own equipment.\n",
    "chinese_title": "菲利珀零盖革计数器",
    "chinese_summary": "本文档介绍了两款用于与盖革计数器交互的 Flipper Zero 应用程序：标准盖革计数器应用程序和原子骰子滚动应用程序。两款应用程序都需要第三方固件（推荐 Unleashed 或 Momentum）。\n\n盖革计数器应用程序以每秒计数 (CPS) 和每分钟计数 (CPM) 显示实时放射性测量值，并提供更改显示单位的选项（μSv/h、mSv/y 等）。它包括将数据记录到 CSV 文件（存储在 SD 卡上）、缩放图形和清除显示的功能。它还具有使用 A4 和 A7 GPIO 引脚的测试功能。按钮分配控制这些功能。该应用程序旨在检测贝塔射线和伽马射线，可用于测量各种来源的放射性，包括铀矿石、镭表盘、铀陶器和烟雾探测器中的镅。它指出 Sv 或 Rad 的测量值不精确，并根据发射的辐射类型提供了可用和不可用的放射源列表。\n\n原子骰子滚动应用程序使用盖革计数器根据检测到的贝塔射线或伽马射线生成真正的随机数。它使用 CRC32（用于低活动）或 MD5（用于高活动）算法对来自这些检测的时间戳进行哈希处理。它使用生成的随机数提供掷骰子 (1-6) 或抛硬币 (0-1)。该应用程序在左角显示 CPS，在右角显示可用滚动次数。文章还包括一个免责声明，声明这两款应用程序仅用于教育目的，应负责任地在用户自己的设备上使用。"
  },
  {
    "id": "45290245",
    "title": "TernFS – An exabyte scale, multi-region distributed filesystem",
    "url": "https://www.xtxmarkets.com/tech/2025-ternfs/",
    "summary": "This article introduces TernFS, a custom-built, exabyte-scale, multi-region distributed filesystem developed by XTX, an algorithmic trading firm, to address their growing storage demands. Facing limitations with existing solutions, XTX designed TernFS to handle massive data volumes, high concurrency, and redundancy across geographically dispersed data centers.\n\nTernFS architecture comprises four main services: Metadata shards (managing directory structure and file metadata), the Cross-Directory Coordinator (CDC) (handling cross-shard transactions), Block services (storing file content in chunks), and the Registry (tracking service locations and status). The design emphasizes disaggregation, with services communicating directly with clients.  Metadata is split into 256 shards for scalability, and the CDC facilitates transactions spanning multiple shards. Block services utilize standard TCP APIs for read/write access to files.  The Registry stores location data of the other services.\n\nKey features of TernFS include redundancy for data protection, no single point of failure in metadata services, file snapshots, multi-region support, hardware agnosticism, and a minimal set of dependencies. While designed for large files (median size 2MB) and immutable data, TernFS has limitations in directory creation/removal throughput and is permissionless.  Currently, TernFS stores over 500PB across multiple data centers and serves terabytes per second at peak.  XTX has open-sourced TernFS on GitHub.\n",
    "chinese_title": "TernFS – 艾字节级，多区域分布式文件系统",
    "chinese_summary": "本文介绍了TernFS，一个由算法交易公司XTX开发的、定制的、EB级别、多区域分布式文件系统，旨在解决其不断增长的存储需求。由于现有解决方案存在局限性，XTX设计了TernFS来处理海量数据、高并发以及跨地理分散数据中心的冗余。\n\nTernFS架构包含四个主要服务：元数据分片（管理目录结构和文件元数据）、跨目录协调器(CDC)（处理跨分片事务）、块服务（以块的形式存储文件内容）以及注册表（跟踪服务位置和状态）。该设计强调解耦，服务直接与客户端通信。元数据被分割成256个分片以实现可扩展性，CDC促进跨多个分片的事务。块服务利用标准TCP API进行文件读/写访问。注册表存储其他服务的位置数据。\n\nTernFS的关键特性包括数据保护的冗余、元数据服务中无单点故障、文件快照、多区域支持、硬件无关性以及最小化的依赖集。虽然TernFS是为大型文件（中位数大小为2MB）和不可变数据设计的，但在目录创建/删除吞吐量方面存在局限性，并且是无权限的。目前，TernFS在多个数据中心存储超过500PB的数据，并在高峰时提供每秒数TB的数据服务。XTX已在GitHub上开源TernFS。"
  },
  {
    "id": "45291024",
    "title": "Launch HN: Cactus (YC S25) – AI inference on smartphones",
    "url": "https://github.com/cactus-compute/cactus",
    "summary": "Cactus (YC S25) is launching an energy-efficient AI inference framework and kernels designed for smartphones, particularly budget and mid-range devices that dominate the market but are often overlooked by current optimization efforts. Unlike existing frameworks, Cactus is built from the ground up without external dependencies, making it suitable for all mobile devices.\n\nThe framework features a layered architecture including a Cactus FFI (OpenAI-compatible C API), a high-level Cactus Engine for transformer inference, a unified zero-copy Cactus Graph for general numerical computation, and low-level ARM-specific SIMD Cactus Kernels. This allows developers to implement custom models and scientific computing tasks, similar to JAX, on phones.\n\nThe Launch HN highlights the ease of integration with example code snippets demonstrating usage with both C++ and through the Foreign Function Interface for language bindings.\n\nPerformance benchmarks show Qwen3-600m-INT8 achieving 16-20 t/s on older phones (Pixel 6a, Galaxy S21, iPhone 11 Pro) and 50-70 t/s on upcoming flagship models (Pixel 9, Galaxy S25, iPhone 16). On Apple silicon, the same model runs at 60-70 toks/sec.\n\nCactus SDKs are already running over 500,000 weekly inference tasks in production. The roadmap includes support for more models (Gemma, SmolVLM, etc.), and hardware acceleration via SMMLA, NPU & DSP for high-end phones, as well as INT4 support for larger models. The company advises users of traditional computers to stick to existing x86-optimized inference solutions like HuggingFace, Llama.cpp, and others.\n",
    "chinese_title": "发布 HN：Cactus (YC S25) – 智能手机上的AI推理",
    "chinese_summary": "Cactus (YC S25) 发布面向智能手机的节能型 AI 推理框架及内核，专为占据市场主导地位但常被现有优化工作忽略的经济型和中端设备设计。与现有框架不同，Cactus 从零开始构建，不依赖外部依赖项，因此适用于所有移动设备。\n\n该框架采用分层架构，包括 Cactus FFI (OpenAI 兼容 C API)、用于 Transformer 推理的高级 Cactus 引擎、用于通用数值计算的统一零拷贝 Cactus 图，以及底层的 ARM 特定 SIMD Cactus 内核。这使得开发者能够在手机上实现自定义模型和科学计算任务，类似于 JAX。\n\nLaunch HN 重点介绍了易于集成性，并提供了示例代码片段，演示了 C++ 和通过 Foreign Function Interface 进行语言绑定的用法。\n\n性能基准测试显示，Qwen3-600m-INT8 在旧款手机（Pixel 6a、Galaxy S21、iPhone 11 Pro）上实现了 16-20 t/s，在即将推出的旗舰型号（Pixel 9、Galaxy S25、iPhone 16）上实现了 50-70 t/s。在 Apple 芯片上，同一模型以 60-70 toks/秒的速度运行。\n\nCactus SDK 已经在生产环境中运行超过 50 万个每周推理任务。路线图包括支持更多模型（Gemma、SmolVLM 等），以及通过 SMMLA、NPU & DSP 实现高端手机的硬件加速，以及支持更大模型的 INT4。该公司建议传统计算机用户继续使用现有的 x86 优化推理解决方案，如 HuggingFace、Llama.cpp 等。"
  },
  {
    "id": "45212535",
    "title": "Show HN: Asxiv.org – Ask ArXiv papers questions through chat",
    "url": "https://asxiv.org/",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "Show HN: Asxiv.org – 通过聊天提问 ArXiv 论文",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "45289558",
    "title": "Luau – Fast, small, safe, gradually typed scripting language derived from Lua",
    "url": "https://luau.org/",
    "summary": "Luau is a scripting language derived from Lua 5.1, developed by Roblox to meet the evolving needs of its platform, including large codebases, performance, and tooling. While striving for backward compatibility with Lua 5.1 and incorporating features from later versions, Luau diverges where design decisions differ, and use cases diverge.\n\nKey features of Luau include:\n\n*   **Sandboxing:** Luau enforces strict sandboxing to protect privileged code, limiting standard library access for user-written scripts.\n*   **Syntax Extensions:** Luau introduces syntactic improvements for better ergonomics while maintaining Lua 5.1 compatibility.\n*   **Analysis Tools:** Built-in linting and type checking tools (script analysis) help identify and prevent common coding errors.\n*   **Performance Focus:** Luau features a custom frontend, new bytecode, an interpreter competitive with LuaJIT, and an optional JIT compiler (x64/arm64) to optimize runtime performance.\n*   **Library Modifications:** While a superset of Lua 5.1 in language, Luau modifies the standard library, removing some functions and adding others. Applications embedding Luau often provide additional, application-specific libraries.\n\nIn essence, Luau aims to be a fast, small, safe, and gradually typed scripting language that addresses the specific requirements of the Roblox environment while retaining the familiarity of Lua.\n",
    "chinese_title": "Luau - 快速、小巧、安全、渐进式类型的脚本语言，源自Lua。",
    "chinese_summary": "Luau是一种脚本语言，源自Lua 5.1，由Roblox开发，旨在满足其平台不断发展的需求，包括大型代码库、性能和工具。在努力保持与Lua 5.1的向后兼容性并融入更高版本的功能的同时，Luau在设计决策和用例不同的地方有所偏离。\n\nLuau的主要特点包括：\n\n*   **沙盒化：** Luau强制执行严格的沙盒化，以保护特权代码，限制用户编写的脚本对标准库的访问。\n*   **语法扩展：** Luau引入了语法改进，以实现更好的用户体验，同时保持与Lua 5.1的兼容性。\n*   **分析工具：** 内置的linting和类型检查工具（脚本分析）有助于识别和防止常见的编码错误。\n*   **性能优先：** Luau具有自定义前端、新的字节码、与LuaJIT竞争的解释器以及可选的JIT编译器（x64/arm64），以优化运行时性能。\n*   **库修改：** 虽然Luau在语言上是Lua 5.1的超集，但它修改了标准库，移除了一些函数并添加了其他函数。嵌入Luau的应用程序通常提供额外的、特定于应用程序的库。\n\n本质上，Luau旨在成为一种快速、小巧、安全且逐渐类型的脚本语言，在保留Lua熟悉性的同时，满足Roblox环境的特定要求。"
  },
  {
    "id": "45260374",
    "title": "Sylvia Plath's fig tree meets machine learning",
    "url": "https://dontlognow.substack.com/p/sylvia-plaths-fig-tree-meets-machine",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "西尔维娅·普拉斯的无花果树遇上机器学习",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "45300084",
    "title": "The death rays that guard life",
    "url": "https://worksinprogress.co/issue/the-death-rays-that-guard-life/",
    "summary": "This article argues for the widespread adoption of far-UVC light as a crucial tool to improve indoor air quality and combat airborne diseases, drawing parallels with the historical success of water filtration and chlorination in eradicating waterborne illnesses.\n\nThe piece highlights the historical context, noting that while typhoid epidemics led to effective water purification methods, airborne diseases like tuberculosis and COVID-19 have not received equivalent attention. Traditional germicidal UV light (254nm) was effective but posed health risks, leading to its decline with the rise of antibiotics.\n\nFar-UVC light (specifically 222nm) offers a safer alternative. It effectively disables pathogens without harming human skin or eyes due to its short wavelength and limited penetration. Studies have shown its effectiveness in reducing airborne virus concentrations in occupied spaces.\n\nThe article acknowledges alternative air cleaning methods like ventilation and filtration but emphasizes their limitations. Ventilation is energy-intensive and can introduce polluted or improperly temperatured air. Filtration also requires energy and can be costly. Far-UVC, with its targeted disinfection, can overcome these limitations.\n\nWhile far-UVC systems can be more expensive initially than filtration, the article suggests the long-term benefits of safer indoor air justify the investment, advocating for its integration into public spaces to safeguard public health against airborne threats.\n",
    "chinese_title": "守护生命的死亡射线",
    "chinese_summary": "本文论证了广泛采用远紫外线(far-UVC)作为改善室内空气质量和对抗空气传播疾病的关键工具，并将其与水过滤和氯化在根除水传播疾病方面的历史性成功相提并论。\n\n文章强调了历史背景，指出伤寒流行促成了有效的水净化方法，但肺结核和COVID-19等空气传播疾病并未受到同等重视。 传统的杀菌紫外线（254nm）有效，但存在健康风险，随着抗生素的兴起而逐渐衰落。\n\n远紫外线（特别是222nm）提供了一种更安全的替代方案。 由于其短波长和有限的穿透力，它可以有效地使病原体失效，而不会损害人体皮肤或眼睛。 研究表明，它可以有效降低占用空间中的空气病毒浓度。\n\n文章承认了通风和过滤等替代空气净化方法，但强调了它们的局限性。 通风能源消耗大，并且可能引入受污染或温度不适宜的空气。 过滤也需要能源，并且成本可能很高。 远紫外线凭借其定向消毒，可以克服这些局限性。\n\n虽然远紫外线系统最初可能比过滤更昂贵，但文章认为，更安全的室内空气带来的长期益处证明了这项投资是合理的，并提倡将其整合到公共场所，以保护公众健康免受空气传播威胁。"
  },
  {
    "id": "45292475",
    "title": "OpenTelemetry collector: What it is, when you need it, and when you don't",
    "url": "https://oneuptime.com/blog/post/2025-09-18-what-is-opentelemetry-collector-and-why-use-one/view",
    "summary": "This article explains the OpenTelemetry (OTel) Collector, a vendor-neutral telemetry pipeline that receives, processes, and exports telemetry data (traces, metrics, logs) from applications to backends like OneUptime. It contrasts direct export (applications sending data directly to backends) with using a central Collector.\n\nDirect export is simpler for small apps but lacks centralized policy control, making vendor migration, cost optimization, and security harder. A Collector centralizes configuration for sampling, redaction, enrichment, routing to multiple destinations, and provides a security boundary. While adding an extra component, it decouples apps from vendors and handles scaling pressure.\n\nThe Collector uses receivers (ingest data), processors (transform, batch, sample), exporters (send to backends), and extensions (auth, health checks) connected via pipelines. The article provides a YAML example of a pipeline configuration.\n\nA Collector is essential for tail sampling, multi-destination routing, sensitive data stripping, cost governance, vendor independence, network isolation, and central retries. It can be skipped for small, simple applications with limited telemetry needs.\n\nCrucially, the Collector optimizes costs by batching data, dropping low-value spans, tail sampling, stripping attributes, and aggregating metrics before export. Monitoring the Collector's internal metrics is vital for performance and troubleshooting. The Collector acts as a control plane for telemetry, enabling efficient curation and storage of observability data.\n",
    "chinese_title": "OpenTelemetry Collector：它是什么，何时需要，何时不需要",
    "chinese_summary": "本文介绍了 OpenTelemetry (OTel) Collector，一个厂商中立的遥测流水线，它接收、处理和导出来自应用程序的遥测数据（链路、指标、日志）到诸如 OneUptime 的后端。文章对比了直接导出（应用程序直接发送数据到后端）和使用中央 Collector 的方式。\n\n直接导出对于小型应用来说更简单，但缺乏集中式策略控制，使得厂商迁移、成本优化和安全性更加困难。Collector 集中配置采样、数据清理、丰富、路由到多个目的地，并提供安全边界。虽然增加了一个额外的组件，但它将应用程序与厂商解耦，并处理扩展压力。\n\nCollector 使用接收器（摄取数据）、处理器（转换、批处理、采样）、导出器（发送到后端）和扩展（身份验证、健康检查），通过管道连接。文章提供了一个管道配置的 YAML 示例。\n\nCollector 对于尾部采样、多目的地路由、敏感数据剥离、成本治理、厂商独立性、网络隔离和中央重试至关重要。对于遥测需求有限的小型简单应用程序，可以跳过它。\n\n至关重要的是，Collector 通过批处理数据、丢弃低价值 span、尾部采样、剥离属性以及在导出前聚合指标来优化成本。监控 Collector 的内部指标对于性能和故障排除至关重要。Collector 充当遥测的控制平面，从而能够高效地管理和存储可观测性数据。"
  },
  {
    "id": "45299378",
    "title": "Cocktail Party Ideas",
    "url": "https://danluu.com/cocktail-ideas/",
    "summary": "This article critiques the phenomenon of people with superficial knowledge of a subject offering simplistic solutions to complex problems, particularly at social gatherings. The author observes this often happens with trendy topics like search engine development and transit construction, where individuals confidently propose fixes without understanding the underlying challenges and sub-problems.\n\nThe core issue, according to the author, is the assumption that a limited understanding reflects the full complexity of the field. This leads to \"cocktail-party solutions\" that are ultimately impractical. The author uses examples, such as programmers offering naive perspectives on \"trad\" engineering fields, to illustrate this point.\n\nThe article highlights the differences between pop-programmer perceptions and the realities faced by engineers, noting that people often overestimate the simplicity of fields outside their own. Comparing civil engineering (bridge building) to software development, the author argues that each field has unique constraints and complexities that are often overlooked by outsiders.\n\nThe author concludes by emphasizing the complexity inherent in large-scale projects and the multitude of interacting sub-fields involved. He contrasts this with the ease of creating simplistic solutions based on incomplete understanding, referencing a study on people's flawed understanding of how bicycles work and the misapplication of the \"paradox of choice\" study. The article advocates for a deeper appreciation of the complexities within different fields before proposing solutions.\n",
    "chinese_title": "鸡尾酒会创意",
    "chinese_summary": "本文批判了一种现象：人们对某个主题仅有肤浅的了解，却在复杂问题上提出过于简化的解决方案，尤其是在社交场合。作者观察到，这种情况经常发生在诸如搜索引擎开发和交通建设等热门话题上，这些人自信地提出解决方案，却不了解潜在的挑战和子问题。\n\n作者认为，核心问题在于人们假设有限的理解反映了该领域的全部复杂性。这导致了最终不切实际的“鸡尾酒会式解决方案”。作者以程序员对“传统”工程领域提出天真的看法为例，来说明这一点。\n\n本文强调了流行程序员的认知与工程师面临的现实之间的差异，指出人们常常高估自己领域之外的领域的简单性。通过将土木工程（桥梁建设）与软件开发进行比较，作者认为每个领域都有独特的约束和复杂性，而这些约束和复杂性常常被外行人忽视。\n\n作者最后强调了大型项目固有的复杂性以及所涉及的众多相互作用的子领域。他将此与基于不完全理解而轻松创建简单解决方案形成对比，并引用了一项关于人们对自行车工作原理的错误理解以及“选择悖论”研究的错误应用的研究。文章倡导在提出解决方案之前，应更深入地了解不同领域中的复杂性。"
  },
  {
    "id": "45286526",
    "title": "Pnpm has a new setting to stave off supply chain attacks",
    "url": "https://pnpm.io/blog/releases/10.16",
    "summary": "This article highlights new features and fixes in the pnpm package manager, focusing on security enhancements and improved dependency management.\n\nA key new feature is the `minimumReleaseAge` setting, designed to mitigate supply chain attacks by delaying the installation of newly released dependencies. This allows time for malicious versions to be detected and removed from registries. The setting specifies a minimum age (in minutes) for dependencies to be installed, and a `minimumReleaseAgeExclude` setting allows exceptions for specific packages that should always be installed in their latest versions.\n\nThe article also introduces \"finder functions\" for advanced dependency filtering with the `pnpm list` and `pnpm why` commands. These functions, defined in `.pnpmfile.cjs`, enable searching for dependencies based on properties beyond just name and version (e.g., finding packages with a specific React version in their peer dependencies). Finder functions can also return additional information from the package manifest for display in the output.\n\nFinally, the article notes several patch changes, including fixes for deprecation warnings in Node.js 24, enforcing exact semver versions for `nodeVersion` settings, enabling `pnpm publish` to handle `.tar.gz` files, and ensuring correct exit codes when canceling processes with Ctrl-C.\n",
    "chinese_title": "Pnpm 有了一个新设置来防范供应链攻击",
    "chinese_summary": "本文重点介绍 pnpm 包管理器中的新特性和修复，着重关注安全增强和改进的依赖管理。\n\n一项关键的新特性是 `minimumReleaseAge` 设置，旨在通过延迟安装新发布的依赖项来缓解供应链攻击。这为检测和从注册表中删除恶意版本留出了时间。该设置指定要安装的依赖项的最小存在时间（以分钟为单位），`minimumReleaseAgeExclude` 设置允许例外，以便始终安装特定软件包的最新版本。\n\n本文还介绍了“查找器函数”，用于使用 `pnpm list` 和 `pnpm why` 命令进行高级依赖项过滤。这些在 `.pnpmfile.cjs` 中定义的函数，能够基于名称和版本之外的属性搜索依赖项（例如，查找在其对等依赖项中具有特定 React 版本的包）。查找器函数还可以从包清单返回附加信息，以便在输出中显示。\n\n最后，本文指出了一些补丁更改，包括修复 Node.js 24 中的弃用警告、强制执行 `nodeVersion` 设置的精确语义版本、使 `pnpm publish` 能够处理 `.tar.gz` 文件，以及确保在使用 Ctrl-C 取消进程时返回正确的退出代码。"
  },
  {
    "id": "45245181",
    "title": "TIC-80 – Tiny Computer",
    "url": "https://tic80.com/",
    "summary": "TIC-80 is a free and open-source fantasy computer designed for creating, playing, and sharing tiny retro-style games. It provides built-in tools for all aspects of game development, including a code editor, sprite editor, map editor, sound editor, and command line interface. The goal is to create a complete mini-game, outputting a cartridge file that can be stored and played on the website, or packaged into a standalone player for various platforms.\n\nThe platform enforces technical limitations reminiscent of retro consoles, such as a 240x136 pixel display, a 16-color palette, a limited number of sprites, and 4-channel sound, encouraging creative problem-solving within constraints.\n\nThe article also highlights several \"New & Popular Carts\" (games) created using TIC-80, showcasing the diversity of projects possible within the platform, ranging from shoot 'em ups and adventure games to recreations and simple demos. Examples mentioned include \"Retro Gunner,\" \"Orbit Defender,\" \"A Story for the Night,\" and \"Pacman 80,\" among others. The article invites users to view all available games.\n",
    "chinese_title": "TIC-80 – 迷你电脑",
    "chinese_summary": "TIC-80是一款免费开源的梦幻计算机，专为创作、游玩和分享迷你复古风格游戏而设计。它提供了内置工具，涵盖游戏开发的各个方面，包括代码编辑器、精灵编辑器、地图编辑器、声音编辑器和命令行界面。目标是创建一个完整的迷你游戏，输出一个可以在网站上存储和游玩的卡带文件，或者打包成适用于各种平台的独立播放器。\n\n该平台强制执行类似于复古游戏机的技术限制，例如240x136像素的显示屏、16色调色板、有限数量的精灵和4声道声音，鼓励在约束条件下进行创造性的问题解决。\n\n文章还重点介绍了使用TIC-80创建的几个“最新热门游戏”（carts），展示了该平台上各种可能的项目，从射击游戏和冒险游戏到重制游戏和简单演示。提及的例子包括“Retro Gunner”、“Orbit Defender”、“A Story for the Night”和“Pacman 80”等。文章邀请用户查看所有可用的游戏。"
  },
  {
    "id": "45265487",
    "title": "Midcentury North American Restaurant Placemats",
    "url": "https://casualarchivist.substack.com/p/order-up",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "北美洲中世纪餐厅餐垫",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "45290021",
    "title": "Grief gets an expiration date, just like us",
    "url": "https://bessstillman.substack.com/p/oh-fuck-youre-still-sad",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "悲伤如同我们，终有期限。",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "45295482",
    "title": "Show HN: I created a small 2D game about an ant",
    "url": "https://aanthonymax.github.io/ant-and-apples/",
    "summary": "This Show HN post presents a simple 2D game called \"Ant and Apples\" where the player controls an ant to collect all the apples using the arrow keys. The game's goal is to help the ant get fed. The developer, aanthonymax, created the game partially using hmpl-js out of boredom and as a small side project over a few days. The post also provides a link to the game's GitHub repository: https://github.com/aanthonymax/ant-and-apples.\n",
    "chinese_title": "展示一下：我做了一个关于蚂蚁的小型2D游戏",
    "chinese_summary": "此Show HN帖子展示了一款简单的2D游戏“蚂蚁与苹果”，玩家通过方向键控制蚂蚁收集所有苹果。游戏的目标是帮助蚂蚁填饱肚子。开发者aanthonymax出于无聊，并利用几天时间，部分使用hmpl-js创建了这款小项目。帖子还提供了游戏GitHub仓库的链接：https://github.com/aanthonymax/ant-and-apples。"
  },
  {
    "id": "45302073",
    "title": "I Was a Weird Kid: Jailhouse Confessions of a Teen Hacker",
    "url": "https://www.bloomberg.com/news/features/2025-09-19/multimillion-dollar-hacking-spree-scattered-spider-teen-s-jailhouse-confessions",
    "summary": "The article \"I Was a Weird Kid: Jailhouse Confessions of a Teen Hacker\" details the story of a teenager, referred to as \"T\", who became involved with the notorious hacking group Scattered Spider. The article, based on jailhouse interviews, paints a picture of a socially awkward and isolated young person who found acceptance and a sense of purpose within the group's criminal activities.\n\nT recounts his early fascination with computers and his progression from harmless hacking to increasingly sophisticated and lucrative cybercrimes. He describes how Scattered Spider recruited him and others, emphasizing the group's hierarchical structure and the financial incentives that motivated them. The group targeted major corporations, stealing data and extorting them for millions of dollars.\n\nThe article highlights the devastating impact of these hacks, not only on the targeted companies but also on individuals whose personal information was compromised. It also delves into the psychological factors that may have contributed to T's involvement in cybercrime, exploring themes of isolation, belonging, and the allure of power and status within the online hacking community.\n\nThe narrative follows T's eventual arrest and his reflections on his past actions while incarcerated. The article raises questions about the responsibility of tech companies to better protect themselves from such attacks and the need for improved rehabilitation programs for young offenders involved in cybercrime. Ultimately, it portrays a complex individual caught in a web of his own making, grappling with the consequences of his choices and offering a chilling glimpse into the world of high-stakes cybercrime.\n",
    "chinese_title": "我曾是个怪小孩：少年黑客的监狱自白",
    "chinese_summary": "文章《我曾是个怪异的孩子：少年黑客的狱中忏悔》详细讲述了一个名叫“T”的青少年与臭名昭著的黑客组织“分散蜘蛛”扯上关系的故事。这篇文章基于狱中采访，描绘了一个不善社交、孤立无援的年轻人，在黑客组织的犯罪活动中找到了认同感和目标感。\n\nT回忆了他早期对计算机的迷恋，以及他从无害的黑客行为发展到日益复杂和有利可图的网络犯罪的过程。他描述了“分散蜘蛛”如何招募他和其他人，强调了该组织的等级结构和激励他们的经济利益。该组织以大型企业为目标，窃取数据并勒索数百万美元。\n\n这篇文章强调了这些黑客行为造成的毁灭性影响，不仅对目标公司，也对个人信息被泄露的个人造成了影响。文章还深入探讨了可能导致T参与网络犯罪的心理因素，探讨了孤立、归属感以及网络黑客社区中权力和地位的诱惑等主题。\n\n叙述跟随了T最终被捕以及他在狱中反思过去行为的过程。这篇文章提出了关于科技公司是否有责任更好地保护自己免受此类攻击，以及是否需要改进针对参与网络犯罪的年轻罪犯的改造计划的问题。最终，它描绘了一个被自己编织的网困住的复杂个体，努力应对自己选择的后果，并对高风险网络犯罪的世界进行了令人不寒而栗的描述。"
  },
  {
    "id": "45300815",
    "title": "An Unreliable Guide to XKB Configuration",
    "url": "https://www.charvolant.org/doug/xkb/html/xkb.html",
    "summary": "This document, \"An Unreliable Guide to XKB Configuration\" by Doug Palmer, aims to explain the complexities of configuring keyboards using the XKB system. Acknowledging the author's lack of expertise, it serves as a self-authored guide to a subject he wished to understand.\n\nThe document appears to be structured as a comprehensive overview of XKB, beginning with the basics like modifier keys, levels, groups, key codes, and key symbols. It outlines various methods for choosing an XKB configuration, ranging from easy, user-friendly approaches to more complex, hands-on methods involving direct manipulation of configuration files.\n\nA significant portion of the document is dedicated to XKB configuration files, breaking down different aspects like key codes, symbols, group and level handling, modifiers, control keys, special characters, dead keys, ISO keys, composition keys, types, compatibility maps, and geometry. It also addresses the organizational structure of XKB through directory files, grouping components, semantics, key maps, and rules.\n\nThe document further touches upon XKB programs and provides a practical example by detailing the configuration of a Happy Hacking Keyboard Lite. Finally, it concludes with a bibliography and information about the document itself. While labeled \"unreliable,\" the document seems to strive for a thorough, if potentially flawed, exploration of XKB keyboard configuration.\n",
    "chinese_title": "XKB配置不可靠指南",
    "chinese_summary": "道格·帕尔默所著的《XKB配置不可靠指南》旨在阐释使用XKB系统配置键盘的复杂性。作者坦承缺乏专业知识，因此本文可视为他为了理解该主题而撰写的自学指南。\n\n该文档似乎是XKB的全面概述，从修饰键、层、组、键码和键符号等基础知识入手。它概述了选择XKB配置的各种方法，从简单、用户友好的方法到涉及直接操作配置文件的更复杂、更手动的方法。\n\n文档的很大一部分致力于XKB配置文件，分解了键码、符号、组和层处理、修饰符、控制键、特殊字符、死键、ISO键、组合键、类型、兼容性映射和几何结构等不同方面。它还通过目录文件、分组组件、语义、键映射和规则来阐述XKB的组织结构。\n\n该文档进一步涉及XKB程序，并通过详细介绍Happy Hacking Keyboard Lite的配置来提供一个实际示例。最后，它以参考书目和关于文档本身的信息作为结尾。虽然标榜“不可靠”，但该文档似乎致力于对XKB键盘配置进行彻底（即使可能存在缺陷）的探索。"
  },
  {
    "id": "45302343",
    "title": "Suspect Asks for a 'Lawyer, Dog,' Willfully Ignorant Court Denies Comma, Counsel",
    "url": "https://abovethelaw.com/2017/10/suspect-asks-for-a-lawyer-dog-willfully-ignorant-court-denies-comma-counsel/",
    "summary": "Elie Mystal, in his Above the Law article, accuses the Louisiana Supreme Court of deliberately denying an African-American criminal defendant, Warren Demesme, his constitutional right to counsel. Demesme requested a lawyer during police questioning, stating, \"why don't you just give me a lawyer dog cause this is not what's up.\"\n\nThe court, in an 8-1 decision, deemed Demesme's request ambiguous, specifically highlighting the \"lawyer dog\" phrasing. Mystal argues that the court is intentionally misinterpreting Demesme's statement, claiming he actually said \"lawyer, dawg,\" a clear request for legal representation. He accuses the court of using the \"dog\" misinterpretation to create ambiguity where none exists, thus justifying the denial of Demesme's right to counsel.\n\nMystal further contends that even accepting the court's incorrect transcript, a reasonable response from the police would have been to clarify Demesme's request or, sarcastically, to find a dog with a law degree, rather than continuing the interrogation without legal representation. He asserts that the court's actions are rooted in racial bias, reflecting a systemic pattern of denying rights to black defendants in Louisiana. He concludes that the judges involved should be ashamed, but are likely not, as they consider this kind of behavior part of their jobs.\n",
    "chinese_title": "嫌疑人要求“律师，狗”，罔顾事实法庭拒绝逗号和律师",
    "chinese_summary": "埃利·米斯塔尔在他的“Above the Law”文章中指责路易斯安那州最高法院故意剥夺了一位非裔美国人刑事被告沃伦·德梅斯梅获得律师的宪法权利。德梅斯梅在警方讯问期间要求律师，他说：“要不你给我找个律师狗吧，因为这事不对劲。”\n\n法院以8比1的裁决认为德梅斯梅的要求含糊不清，特别强调了“律师狗”的措辞。米斯塔尔认为，法院是在故意曲解德梅斯梅的陈述，声称他实际上说的是“律师，伙计（lawyer, dawg）”，这是一个明确的法律代表要求。他指责法院利用对“狗”的误解来制造原本不存在的歧义，从而为拒绝德梅斯梅获得律师的权利辩护。\n\n米斯塔尔进一步辩称，即使接受法院不正确的笔录，警方也应该做出合理的反应，即澄清德梅斯梅的要求，或者讽刺地去找一只拥有法学学位的狗，而不是在没有法律代表的情况下继续审讯。他断言，法院的行为根植于种族偏见，反映了路易斯安那州系统性地剥夺黑人被告权利的模式。他最后指出，涉案法官应该感到羞耻，但他们可能不会，因为他们认为这种行为是他们工作的一部分。"
  },
  {
    "id": "45297030",
    "title": "The Math of Catastrophe",
    "url": "https://www.quantamagazine.org/the-math-of-climate-change-tipping-points-20250915/",
    "summary": "Gregory Barber's article \"The Math of Catastrophe\" explores the complexities and uncertainties surrounding tipping points in climate science, particularly as mathematicians attempt to model and predict them. The article highlights the historical context, referencing Mikhail Budyko's Snowball Earth model and the fear of nuclear winter, to illustrate the potential for dramatic climate shifts.\n\nThe piece discusses the challenges of applying mathematical models to the Earth's climate, which is far more complex than simplified systems like Peter Lake, where ecologists successfully predicted regime shifts by focusing on key variables. The article notes the initial enthusiasm and subsequent dismissal of \"catastrophe theory\" due to oversimplification and unrealistic assumptions in modeling complex social systems.\n\nDespite the challenges, mathematicians are seeking ways to make tipping point predictions more useful. The concept of a bifurcation, where a gradual change leads to a sudden shift, is key to understanding these points. Tim Lenton popularized the term \"tipping points\" to better convey the urgency of climate change. The article also emphasizes the importance of finding a balance between mathematical rigor and real-world application, acknowledging the limitations of available data and the potential for models to be overly sensitive to initial assumptions. While acknowledging the uncertainty, the article underlines the importance of using math to understand and potentially mitigate catastrophic climate scenarios.\n",
    "chinese_title": "灾难数学",
    "chinese_summary": "格雷戈里·巴伯的文章《灾难的数学》探讨了气候科学中关于临界点复杂性和不确定性，特别是数学家试图对其进行建模和预测时所面临的问题。文章强调了历史背景，提及米哈伊尔·布迪科的雪球地球模型以及对核冬天的恐惧，以说明剧烈气候转变的可能性。\n\n文章讨论了将数学模型应用于地球气候所面临的挑战，地球气候远比彼得湖等简化系统复杂，生态学家通过关注关键变量成功预测了彼得湖的体制转变。文章指出，由于过度简化和在复杂社会系统建模中不切实际的假设，“突变理论”最初备受推崇，随后遭到摒弃。\n\n尽管存在挑战，数学家们仍在寻求使临界点预测更有用的方法。分岔的概念，即渐进的变化导致突然的转变，是理解这些临界点的关键。蒂姆·伦顿推广了“临界点”一词，以更好地传达气候变化的紧迫性。文章还强调了在数学严谨性和实际应用之间取得平衡的重要性，承认现有数据的局限性以及模型可能对初始假设过于敏感。在承认不确定性的同时，文章强调了使用数学来理解并可能缓解灾难性气候情景的重要性。"
  },
  {
    "id": "45253795",
    "title": "Visual lexicon of consumer aesthetics from the 1970s until now",
    "url": "https://cari.institute/",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "从 1970 年代至今的消费者美学视觉词典",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "45287155",
    "title": "This website has no class",
    "url": "https://aaadaaam.com/notes/no-class/",
    "summary": "In a self-reflective post, the author describes refactoring their website to eliminate CSS classes, aiming for a cleaner, more semantic approach. Inspired by their own previous advice about treating HTML elements as pre-built components, they challenged themselves to build the site without relying on classes.\n\nThe author initially tried to use contextual styling extensively, nesting selectors and using `:where()` and `:has()`, but found this approach became overly complex and esoteric. They then turned to custom tags and attributes, leveraging patterns from web components without using JavaScript. This involved using custom element names (like `<note-pad>`) and custom attributes (like `shape-type=\"1\"`) to apply styles, replacing the functionality of BEM modifiers with key-value pairs.\n\nThe author found positive outcomes, including a reduction in CSS size and improved accessibility due to increased attention to semantic markup. The markup also became cleaner and more readable. However, the approach requires more careful planning and a holistic view of the website, making it potentially less suitable for large projects with diverse frontend skill levels.\n\nWhile acknowledging that custom tags and attributes are somewhat \"re-inventing\" classes, the author argues that this approach feels more coherent and allows for seamless enhancement to true web components. Despite not being fully convinced it's the ultimate solution, the author believes this experiment will significantly influence their future work. They ended up retaining classes only for a syntax highlighting plugin due to practical constraints.\n",
    "chinese_title": "这个网站毫无品味。",
    "chinese_summary": "作者在一篇自我反思的文章中描述了他们重构网站以消除CSS类的方法，旨在实现更简洁、更语义化的方法。受他们自己先前关于将HTML元素视为预构建组件的建议的启发，他们挑战自己构建网站而不依赖于类。\n\n作者最初尝试广泛使用上下文样式，嵌套选择器并使用`:where()`和`:has()`，但发现这种方法变得过于复杂和深奥。然后，他们转向自定义标签和属性，利用Web组件的模式而不使用JavaScript。这涉及到使用自定义元素名称（如`<note-pad>`）和自定义属性（如`shape-type=\"1\"`）来应用样式，用键值对替换BEM修饰符的功能。\n\n作者发现了一些积极的结果，包括CSS大小的减少以及由于更加关注语义标记而提高的可访问性。标记也变得更干净、更易读。然而，这种方法需要更仔细的规划和对网站的整体观察，使其可能不太适合具有多样化前端技能水平的大型项目。\n\n虽然承认自定义标签和属性在某种程度上是“重新发明”类，但作者认为这种方法感觉更连贯，并且可以无缝增强为真正的Web组件。尽管作者并没有完全确信这是最终的解决方案，但他们相信这个实验将极大地影响他们未来的工作。由于实际限制，他们最终只保留了用于语法高亮插件的类。"
  },
  {
    "id": "45263123",
    "title": "The Fisherman and His Wife (1857)",
    "url": "https://sites.pitt.edu/~dash/grimm019.html",
    "summary": "\"The Fisherman and His Wife\" is a cautionary tale about unchecked greed and ambition. A fisherman catches a magical flounder who grants wishes in exchange for its freedom. The fisherman's wife, Ilsebill, initially content with their impoverished life, pressures her husband to ask the flounder for increasingly extravagant desires.\n\nStarting with a simple cottage to replace their filthy shack, Ilsebill's ambitions quickly escalate. She demands a palace, then to become King, then Emperor, and finally, Pope. Each wish is granted, but with each fulfillment, the sea becomes more turbulent, reflecting the growing disruption and moral decay caused by Ilsebill's insatiable desires.\n\nThe fisherman, initially hesitant, becomes increasingly distressed by his wife's demands, recognizing their inherent wrongness. He continues to obey her, but with a heavy heart and a sense of impending doom.\n\nUltimately, Ilsebill's ambition knows no bounds. She declares that she wants to become like God and control the sun and moon. This final, outrageous demand breaks the magic. The flounder, fed up with her relentless greed, revokes all the previous gifts. The story concludes with the couple back in their original filthy shack, serving as a stark reminder of the dangers of unchecked ambition and the importance of contentment.\n",
    "chinese_title": "渔夫和他的妻子 (1857)",
    "chinese_summary": "渔夫和他的妻子：一个关于无度贪婪和野心的警示故事。渔夫捕获了一条神奇的比目鱼，比目鱼答应用满足愿望来换取自由。渔夫的妻子伊尔斯比尔，最初对他们贫困的生活感到满足，但她却迫使丈夫向比目鱼索要越来越奢侈的愿望。\n\n从用一个简陋的茅屋来代替他们肮脏的小屋开始，伊尔斯比尔的野心迅速升级。她要求一座宫殿，然后成为国王，然后是皇帝，最后是教皇。每一个愿望都实现了，但随着每一次满足，大海变得更加汹涌，反映了伊尔斯比尔永不满足的欲望所造成的日益增长的混乱和道德沦丧。\n\n渔夫最初犹豫不决，但渐渐地，他越来越为妻子的要求感到苦恼，认识到这些要求的内在错误。他继续服从她，但内心沉重，预感到厄运即将来临。\n\n最终，伊尔斯比尔的野心没有止境。她宣称她想变得像上帝一样，控制太阳和月亮。这最后一个离谱的要求打破了魔法。比目鱼厌倦了她无情的贪婪，收回了之前所有的礼物。故事的结尾是这对夫妇回到了他们最初肮脏的小屋，这鲜明地提醒人们无度野心的危险以及知足的重要性。"
  },
  {
    "id": "45258279",
    "title": "The Rise and Fall of the British Detective Novel (2010)",
    "url": "https://www.historytoday.com/archive/feature/rise-and-fall-british-detective-novel",
    "summary": "William Rubinstein's \"The Rise and Fall of the British Detective Novel\" explores the genre's \"golden age\" (1910-1950), its roots, and its decline. He credits Edgar Allan Poe and Arthur Conan Doyle (with Sherlock Holmes) for establishing detective fiction, noting Holmes' significant impact and influence on subsequent writers. The stories were usually set within the upper classes, a contrast to real-world crime, and focused on brilliant amateur detectives outsmarting Scotland Yard.\n\nThe article highlights prominent \"golden age\" British detective novelists like Cecil Street, Freeman Wills Crofts, and Dorothy L. Sayers, emphasizing their middle-class origins and audience. These novels reflected interwar British middle-class values like rationality, justice, and specific social prejudices.\n\nRubinstein contrasts British detective fiction with the American \"hard-boiled\" genre, exemplified by Dashiell Hammett and Raymond Chandler, which featured violence, anti-authoritarianism, and left-wing political agendas, absent in the more conservative British works.\n\nThe article argues that the classical British detective novel declined around 1960 due to factors like plot exhaustion, evolving social attitudes towards sex and violence, the rise of the spy thriller (James Bond), and the disintegration of core beliefs in rationality, justice, and the certainty of punishment in British society. It demonstrates the genre's link to the historical and social transformation of Britain.\n",
    "chinese_title": "英国侦探小说的兴衰 (2010)",
    "chinese_summary": "威廉·鲁宾斯坦的《英国侦探小说的兴衰》探讨了该类型的“黄金时代”（1910-1950）、其起源以及其衰落。他认为埃德加·爱伦·坡和亚瑟·柯南·道尔（及夏洛克·福尔摩斯）确立了侦探小说的地位，并指出福尔摩斯对后世作家产生了重大影响。这些故事通常以社会上层阶级为背景，与现实世界的犯罪形成对比，并侧重于聪明的业余侦探智胜苏格兰场。\n\n这篇文章重点介绍了塞西尔·斯特里特、弗里曼·威尔斯·克罗夫茨和多萝西·L·塞耶斯等杰出的“黄金时代”英国侦探小说家，强调了他们的中产阶级出身和受众。这些小说反映了两次世界大战期间英国中产阶级的价值观，如理性、正义和特定的社会偏见。\n\n鲁宾斯坦将英国侦探小说与美国“硬汉派”类型进行对比，后者以达希尔·哈米特和雷蒙德·钱德勒为代表，其特点是暴力、反权威主义和左翼政治议程，这些在更保守的英国作品中是缺失的。\n\n文章认为，古典英国侦探小说在1960年左右衰落，原因包括情节耗尽、社会对性和暴力态度的转变、间谍惊悚片（詹姆斯·邦德）的兴起，以及英国社会对理性、正义和惩罚确定性的核心信念的瓦解。它表明了该类型与英国历史和社会转型之间的联系。"
  },
  {
    "id": "45247392",
    "title": "TBM 377: Time Allocation ≠ Capacity Allocation",
    "url": "https://cutlefish.substack.com/p/tbm-377-time-allocation-capacity",
    "summary": "The article \"TBM 377: Time Allocation ≠ Capacity Allocation\" argues that simply allocating time to tasks doesn't guarantee those tasks will actually be completed effectively or reach their desired outcome. It highlights the crucial distinction between allocating time and allocating *capacity*.\n\nThe core argument is that merely scheduling meetings or setting deadlines doesn't automatically translate into productive work. Factors like energy levels, focus, distractions, prior knowledge, and the complexity of the task all impact the actual *capacity* available for productive work within that allocated time.\n\nThe author uses examples like scheduling an hour for writing but spending half that time staring at a blank screen due to lack of focus or needing to research a topic before actually starting the writing task. This illustrates that the time allocated doesn't reflect the actual *capacity* used.\n\nThe article suggests focusing on managing *capacity* instead of solely managing time. This involves understanding your peak performance times, mitigating distractions, breaking down complex tasks into smaller, manageable chunks, and ensuring you have the necessary resources and knowledge before starting a task.\n\nUltimately, the article advocates for a more holistic approach to productivity, acknowledging that time is a resource but not the only factor influencing output. Successful completion of tasks relies on effectively allocating and managing not just time, but also the mental, emotional, and physical *capacity* required to perform them well.\n",
    "chinese_title": "TBM 377：时间分配 ≠ 能力分配",
    "chinese_summary": "文章《TBM 377：时间分配 ≠ 能力分配》认为，简单地为任务分配时间并不能保证这些任务能够有效完成或达到预期结果。文章强调了分配时间与分配*能力*之间的关键区别。\n\n核心论点是，仅仅安排会议或设定截止日期并不能自动转化为高效的工作。精力水平、注意力、干扰、先验知识以及任务的复杂性等因素都会影响在分配的时间内可用于高效工作的实际*能力*。\n\n作者举例说明，比如安排一个小时写作，但由于缺乏专注力，却花了一半的时间盯着空白屏幕，或者在真正开始写作任务之前需要先研究一个主题。 这说明所分配的时间并不能反映实际使用的*能力*。\n\n文章建议关注管理*能力*，而不是仅仅管理时间。 这包括了解你的最佳表现时间、减少干扰、将复杂的任务分解成更小、更易于管理的块，并在开始任务之前确保你拥有必要的资源和知识。\n\n最终，文章提倡一种更全面的生产力方法，承认时间是一种资源，但不是影响产出的唯一因素。 成功完成任务不仅依赖于有效分配和管理时间，还依赖于有效分配和管理执行任务所需的精神、情感和身体*能力*。"
  },
  {
    "id": "45296550",
    "title": "Bluefin LTS Is Released",
    "url": "https://docs.projectbluefin.io/blog/bluefin-lts-ga/",
    "summary": "Bluefin LTS and Bluefin GDX, built on CentOS Stream 10, are now generally available. Bluefin LTS offers a modern desktop experience with long-term support (3-5 years per release) and features like first-class Flathub support, Homebrew, ZFS, and a backported GNOME 48 desktop. It includes an optional hardware enablement (HWE) branch with updated Linux kernels, accessible via `ujust rebase-helper` and dedicated ISOs for newer hardware.\n\nBluefin GDX is designed as an AI workstation, integrating Nvidia drivers and CUDA, and includes features like VSCode integrations, Ramalama for AI model management, and uv for Python package management. It's a collaboration with the Red Hat Enterprise Linux Command Line Assistant team, focusing on open-source AI/ML tools.\n\nThe release emphasizes sustainability for developers, with Bluefin LTS being less frequently updated than other Bluefin versions. The article also discusses the future of Bluefin GTS, which may be hidden from the website due to overlap with Bluefin LTS HWE. The new Anaconda webui is being used for installation and updates will be released weekly on Tuesdays. Downloads for both Bluefin LTS and GDX are available with checksums for verification. The team also introduced a new Bluefin store with merchandise to support paleoartwork.\n",
    "chinese_title": "蓝鳍 LTS 发布",
    "chinese_summary": "基于 CentOS Stream 10 的 Bluefin LTS 和 Bluefin GDX 现已正式发布。Bluefin LTS 提供现代桌面体验，具有长期支持（每个版本 3-5 年），并具备一流的 Flathub 支持、Homebrew、ZFS 和反向移植的 GNOME 48 桌面等功能。它包含一个可选的硬件启用 (HWE) 分支，其中包含更新的 Linux 内核，可通过 `ujust rebase-helper` 和适用于较新硬件的专用 ISO 访问。\n\nBluefin GDX 设计为 AI 工作站，集成了 Nvidia 驱动程序和 CUDA，并包含 VSCode 集成、用于 AI 模型管理的 Ramalama 以及用于 Python 包管理的 uv 等功能。它是与 Red Hat Enterprise Linux Command Line Assistant 团队合作开发的，专注于开源 AI/ML 工具。\n\n该版本强调开发者的可持续性，Bluefin LTS 的更新频率低于其他 Bluefin 版本。文章还讨论了 Bluefin GTS 的未来，由于与 Bluefin LTS HWE 重叠，可能会从网站上隐藏。新的 Anaconda webui 正被用于安装，更新将于每周二发布。Bluefin LTS 和 GDX 的下载均已提供，并附带校验和以供验证。该团队还推出了一个新的 Bluefin 商店，销售商品以支持古生物艺术。"
  },
  {
    "id": "45293839",
    "title": "Tldraw SDK 4.0",
    "url": "https://tldraw.dev/blog/tldraw-sdk-4-0",
    "summary": "Tldraw SDK 4.0 has been released, featuring new starter kits, accessibility improvements, and licensing changes. The release introduces a new CLI tool (`npm create tldraw@latest`) for creating projects using templates and starter kits. These starter kits include: agent (chatbot), workflow (node-and-wire apps), branching chat (AI chats), chat (image annotation for chatbots), and multiplayer (multiplayer backend via tldraw sync). All starter kits are MIT licensed.\n\nLicensing has been updated, requiring either a trial, commercial, or hobby license for production environments. The SDK is free for development environments. A free 100-day trial license is available, and commercial license sign-ups before the end of 2025 will receive a discount based on the remaining trial period.\n\nThe SDK now complies with WCAG 2.2 AA accessibility standards, benefiting downstream users. Tldraw encourages users to explore the new features via `npm create tldraw@latest` or the tldraw.dev website. The project has achieved significant milestones, including 40,000 GitHub stars, 70,000 weekly installs, and a $10M series A funding. Tldraw is also actively hiring.\n",
    "chinese_title": "Tldraw SDK 4.0",
    "chinese_summary": "Tldraw SDK 4.0 has been released, featuring new starter kits, accessibility improvements, and licensing changes. The release introduces a new CLI tool (`npm create tldraw@latest`) for creating projects using templates and starter kits. These starter kits include: agent (chatbot), workflow (node-and-wire apps), branching chat (AI chats), chat (image annotation for chatbots), and multiplayer (multiplayer backend via tldraw sync). All starter kits are MIT licensed.\n\nLicensing has been updated, requiring either a trial, commercial, or hobby license for production environments. The SDK is free for development environments. A free 100-day trial license is available, and commercial license sign-ups before the end of 2025 will receive a discount based on the remaining trial period.\n\nThe SDK now complies with WCAG 2.2 AA accessibility standards, benefiting downstream users. Tldraw encourages users to explore the new features via `npm create tldraw@latest` or the tldraw.dev website. The project has achieved significant milestones, including 40,000 GitHub stars, 70,000 weekly installs, and a $10M series A funding. Tldraw is also actively hiring.\n"
  },
  {
    "id": "45289921",
    "title": "Aaron Levie: Startups win in the AI era [video]",
    "url": "https://www.youtube.com/watch?v=uqc_vt95GJg",
    "summary": "生成摘要时出错",
    "chinese_title": "Aaron Levie: Startups win in the AI era [video]",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45279384",
    "title": "WASM 3.0 Completed",
    "url": "https://webassembly.org/news/2025-09-17-wasm-3.0/",
    "summary": "生成摘要时出错",
    "chinese_title": "WASM 3.0 Completed",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45293273",
    "title": "When Knowing Someone at Meta Is the Only Way to Break Out of \"Content Jail\"",
    "url": "https://www.eff.org/pages/when-knowing-someone-meta-only-way-break-out-content-jail",
    "summary": "生成摘要时出错",
    "chinese_title": "When Knowing Someone at Meta Is the Only Way to Break Out of \"Content Jail\"",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45246652",
    "title": "PostgreSQL Maintenance Without Superuser",
    "url": "https://boringsql.com/posts/postgresql-predefined-roles/",
    "summary": "生成摘要时出错",
    "chinese_title": "PostgreSQL Maintenance Without Superuser",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45298793",
    "title": "iTerm2 Web Browser",
    "url": "https://iterm2.com/documentation-web.html",
    "summary": "生成摘要时出错",
    "chinese_title": "iTerm2 网页浏览器",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45291132",
    "title": "American Prairie unlocks another 70k acres in Montana",
    "url": "https://earthhope.substack.com/p/victory-for-public-access-american",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "美国草原保护区在蒙大拿州新增7万英亩土地",
    "chinese_summary": "Unable to access the article link.\n"
  },
  {
    "id": "45289168",
    "title": "The quality of AI-assisted software depends on unit of work management",
    "url": "https://blog.nilenso.com/blog/2025/09/15/ai-unit-of-work/",
    "summary": "生成摘要时出错",
    "chinese_title": "The quality of AI-assisted software depends on unit of work management",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45274277",
    "title": "Apple Photos app corrupts images",
    "url": "https://tenderlovemaking.com/2025/09/17/apple-photos-app-corrupts-images/",
    "summary": "生成摘要时出错",
    "chinese_title": "苹果照片应用损坏图像",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45287513",
    "title": "Fast Fourier Transforms Part 1: Cooley-Tukey",
    "url": "https://connorboyle.io/2025/09/11/fft-cooley-tukey.html",
    "summary": "Connor Boyle's article, \"Fast Fourier Transforms Part 1: Cooley-Tukey,\" provides an introduction to the Cooley-Tukey algorithm, a widely used method for efficiently computing the Discrete Fourier Transform (DFT). The DFT transforms a sequence of complex numbers into its frequency components.\n\nThe article begins by defining the DFT and introducing the notation \\(W_N\\) to simplify complex exponentiation. It explains that a naive DFT implementation has a time complexity of \\(O(\\lvert x \\rvert^2)\\), where \\(|x|\\) is the length of the input sequence.\n\nThe Cooley-Tukey algorithm improves this by exploiting the composite nature of the input length (\\(\\lvert x \\rvert = r \\cdot d\\)), breaking down the single DFT summation into nested summations. This allows splitting the input sequence into subsequences \\(x_r^{j_0}\\) based on modulo classes. By recursively applying this decomposition, particularly when the input length is a power of 2 (\\(\\lvert x \\rvert = 2^n\\)), the algorithm achieves a significantly faster time complexity of \\(O (\\lvert x \\rvert \\cdot \\log(\\lvert x \\rvert))\\).\n\nThe article also notes that the Cooley-Tukey algorithm can be adapted for inverse DFT calculations and highlights its limitations with prime-length inputs, suggesting the need for algorithms like Bluestein's for broader applicability. The author includes an interactive visualization to illustrate the Cooley-Tukey process. Finally, Boyle expresses frustration with the common misuse of \"FFT\" to mean \"DFT,\" clarifying that FFT refers to the *algorithm* used to compute the DFT, not the result itself.\n",
    "chinese_title": "Fast Fourier Transforms Part 1: Cooley-Tukey",
    "chinese_summary": "Connor Boyle's article, \"Fast Fourier Transforms Part 1: Cooley-Tukey,\" provides an introduction to the Cooley-Tukey algorithm, a widely used method for efficiently computing the Discrete Fourier Transform (DFT). The DFT transforms a sequence of complex numbers into its frequency components.\n\nThe article begins by defining the DFT and introducing the notation \\(W_N\\) to simplify complex exponentiation. It explains that a naive DFT implementation has a time complexity of \\(O(\\lvert x \\rvert^2)\\), where \\(|x|\\) is the length of the input sequence.\n\nThe Cooley-Tukey algorithm improves this by exploiting the composite nature of the input length (\\(\\lvert x \\rvert = r \\cdot d\\)), breaking down the single DFT summation into nested summations. This allows splitting the input sequence into subsequences \\(x_r^{j_0}\\) based on modulo classes. By recursively applying this decomposition, particularly when the input length is a power of 2 (\\(\\lvert x \\rvert = 2^n\\)), the algorithm achieves a significantly faster time complexity of \\(O (\\lvert x \\rvert \\cdot \\log(\\lvert x \\rvert))\\).\n\nThe article also notes that the Cooley-Tukey algorithm can be adapted for inverse DFT calculations and highlights its limitations with prime-length inputs, suggesting the need for algorithms like Bluestein's for broader applicability. The author includes an interactive visualization to illustrate the Cooley-Tukey process. Finally, Boyle expresses frustration with the common misuse of \"FFT\" to mean \"DFT,\" clarifying that FFT refers to the *algorithm* used to compute the DFT, not the result itself.\n"
  },
  {
    "id": "45295995",
    "title": "Classic recessive-or-dominant gene dynamics may not be so simple",
    "url": "https://news.stanford.edu/stories/2025/09/classic-recessive-dominant-gene-dynamics-pesticide-resistance-research",
    "summary": "生成摘要时出错",
    "chinese_title": "Classic recessive-or-dominant gene dynamics may not be so simple",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45283306",
    "title": "Meta Ray-Ban Display",
    "url": "https://www.meta.com/blog/meta-ray-ban-display-ai-glasses-connect-2025/",
    "summary": "生成摘要时出错",
    "chinese_title": "Meta Ray-Ban Display",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45284311",
    "title": "Show HN: The text disappears when you screenshot it",
    "url": "https://unscreenshottable.vercel.app/?text=Hello",
    "summary": "生成摘要时出错",
    "chinese_title": "Show HN: The text disappears when you screenshot it",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45301123",
    "title": "EU ministers reach 'compromise' on digital euro roadmap",
    "url": "https://www.reuters.com/business/finance/eu-ministers-seek-agreement-digital-euro-be-independent-visa-mastercard-2025-09-19/",
    "summary": "生成摘要时出错",
    "chinese_title": "EU ministers reach 'compromise' on digital euro roadmap",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45291618",
    "title": "Show HN: One prompt generates an app with its own database",
    "url": "https://www.manyminiapps.com/",
    "summary": "生成摘要时出错",
    "chinese_title": "Show HN: One prompt generates an app with its own database",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45295878",
    "title": "Nvmath-Python: Nvidia Math Libraries for the Python Ecosystem",
    "url": "https://github.com/NVIDIA/nvmath-python",
    "summary": "生成摘要时出错",
    "chinese_title": "Nvmath-Python: Nvidia Math Libraries for the Python Ecosystem",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45289829",
    "title": "Automatic differentiation can be incorrect",
    "url": "https://www.stochasticlifestyle.com/the-numerical-analysis-of-differentiable-simulation-automatic-differentiation-can-be-incorrect/",
    "summary": "生成摘要时出错",
    "chinese_title": "Automatic differentiation can be incorrect",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45299800",
    "title": "Mapped: 6k Rocket Launches",
    "url": "https://www.maps.com/6000-rocket-launches-mapped/",
    "summary": "生成摘要时出错",
    "chinese_title": "已绘制：6千次火箭发射",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45283196",
    "title": "Stepping Down as Libxml2 Maintainer",
    "url": "https://discourse.gnome.org/t/stepping-down-as-libxml2-maintainer/31398",
    "summary": "The maintainer of libxml2 is stepping down, effectively leaving the project unmaintained for the foreseeable future. While full support is ending, the maintainer will continue to address regressions specifically in the 2.15 release until the end of 2025. This means that no new features, enhancements, or bug fixes (beyond regressions in 2.15) are expected, and the project's long-term stability and development are uncertain without a new maintainer.\n",
    "chinese_title": "Stepping Down as Libxml2 Maintainer",
    "chinese_summary": "The maintainer of libxml2 is stepping down, effectively leaving the project unmaintained for the foreseeable future. While full support is ending, the maintainer will continue to address regressions specifically in the 2.15 release until the end of 2025. This means that no new features, enhancements, or bug fixes (beyond regressions in 2.15) are expected, and the project's long-term stability and development are uncertain without a new maintainer.\n"
  },
  {
    "id": "45302689",
    "title": "Russian warplanes breach NATO airspace over Estonia",
    "url": "https://www.politico.eu/article/russian-fighter-jets-breach-estonian-airspace-near-tallinn/",
    "summary": "生成摘要时出错",
    "chinese_title": "Russian warplanes breach NATO airspace over Estonia",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45251111",
    "title": "Orange Pi RV2 $40 RISC-V SBC: Friendly Gateway to IoT and AI Projects",
    "url": "https://riscv.org/ecosystem-news/2025/09/orange-pi-rv2-40-risc-v-sbc-friendly-gateway-to-iot-and-ai-projects/",
    "summary": "生成摘要时出错",
    "chinese_title": "Orange Pi RV2 $40 RISC-V SBC: Friendly Gateway to IoT and AI Projects",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45299590",
    "title": "Daily Aspirin intake slashes colon cancer relapse risk by 55%",
    "url": "https://news.ki.se/common-inexpensive-drug-halves-recurrence-in-colorectal-cancer",
    "summary": "生成摘要时出错",
    "chinese_title": "Daily Aspirin intake slashes colon cancer relapse risk by 55%",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45271484",
    "title": "The Asus gaming laptop ACPI firmware bug",
    "url": "https://github.com/Zephkek/Asus-ROG-Aml-Deep-Dive",
    "summary": "生成摘要时出错",
    "chinese_title": "The Asus gaming laptop ACPI firmware bug",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45283731",
    "title": "Hypervisor 101 in Rust",
    "url": "https://tandasat.github.io/Hypervisor-101-in-Rust/",
    "summary": "生成摘要时出错",
    "chinese_title": "Hypervisor 101 in Rust",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45301129",
    "title": "Apollo laser takes down 200 drones unplugged",
    "url": "https://newatlas.com/military/apollo-laser-drones-weapon/",
    "summary": "生成摘要时出错",
    "chinese_title": "Apollo laser takes down 200 drones unplugged",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45247381",
    "title": "I Built an Event-Sourcing Database Engine: Meet Genesis DB",
    "url": "https://www.genesisdb.io",
    "summary": "生成摘要时出错",
    "chinese_title": "I Built an Event-Sourcing Database Engine: Meet Genesis DB",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45278657",
    "title": "Tinycolor supply chain attack post-mortem",
    "url": "https://sigh.dev/posts/ctrl-tinycolor-post-mortem/",
    "summary": "生成摘要时出错",
    "chinese_title": "Tinycolor supply chain attack post-mortem",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45253012",
    "title": "What's New in C# 14: Null-Conditional Assignments",
    "url": "https://blog.ivankahl.com/csharp-14-null-conditional-assignments/",
    "summary": "生成摘要时出错",
    "chinese_title": "What's New in C# 14: Null-Conditional Assignments",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45256145",
    "title": "Keeping SSH sessions alive with systemd-inhibit",
    "url": "https://kd8bny.com/posts/session_inhibit/",
    "summary": "生成摘要时出错",
    "chinese_title": "Keeping SSH sessions alive with systemd-inhibit",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45286369",
    "title": "CERN Animal Shelter for Computer Mice (2011)",
    "url": "https://computer-animal-shelter.web.cern.ch/index.shtml",
    "summary": "生成摘要时出错",
    "chinese_title": "CERN Animal Shelter for Computer Mice (2011)",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45294859",
    "title": "Meta’s live demo fails; “AI” recording plays before the actor takes the steps",
    "url": "https://www.reddit.com/r/LivestreamFail/comments/1nkbig7/metas_live_staged_demo_fails_the_ai_recording/",
    "summary": "生成摘要时出错",
    "chinese_title": "Meta’s live demo fails; “AI” recording plays before the actor takes the steps",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45277704",
    "title": "Launch HN: RunRL (YC X25) – Reinforcement learning as a service",
    "url": "https://runrl.com",
    "summary": "生成摘要时出错",
    "chinese_title": "Launch HN: RunRL (YC X25) – Reinforcement learning as a service",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45301450",
    "title": "Chandra finds black hole that's growing at 2.4 times the Eddington limit",
    "url": "https://phys.org/news/2025-09-chandra-black-hole-eddington-limit.html",
    "summary": "生成摘要时出错",
    "chinese_title": "Chandra finds black hole that's growing at 2.4 times the Eddington limit",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45291858",
    "title": "Configuration files are user interfaces",
    "url": "https://ochagavia.nl/blog/configuration-files-are-user-interfaces/",
    "summary": "生成摘要时出错",
    "chinese_title": "Configuration files are user interfaces",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45279357",
    "title": "DeepMind and OpenAI win gold at ICPC",
    "url": "https://codeforces.com/blog/entry/146536",
    "summary": "生成摘要时出错",
    "chinese_title": "DeepMind and OpenAI win gold at ICPC",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45270676",
    "title": "Slow social media",
    "url": "https://herman.bearblog.dev/slow-social-media/",
    "summary": "生成摘要时出错",
    "chinese_title": "Slow social media",
    "chinese_summary": "生成摘要时出错"
  }
]