[
  {
    "id": "46096337",
    "title": "Advent of Code 2025",
    "url": "https://adventofcode.com/2025/about",
    "summary": "Advent of Code is an annual Advent calendar of programming puzzles created by Eric Wastl, designed for various skill levels and solvable in any language. It's used for interview prep, training, challenges, and practice. No computer science background is needed, just basic programming and problem-solving skills. Solutions should run quickly on older hardware.\n\nSupport is encouraged through sharing or direct contributions via AoC++. Tips for getting unstuck include testing against examples, rereading the description, building custom test cases, ensuring complete input, and seeking help from friends or the subreddit. Authentication uses OAuth, protecting user credentials. Puzzle difficulty varies and increases over time.\n\nThe puzzles unlock at midnight EST/UTC-5 for the creator's availability. High contrast mode is available for readability. Puzzle ideas are not accepted due to legal reasons. Bug reports should first be checked on the subreddit. Fast solution times are optional; prioritize personal goals.\n\nAI assistance is discouraged, as puzzles are designed for human enjoyment. Copying Advent of Code content is prohibited; redistributing code repositories should exclude puzzle text and inputs.\n\nThe puzzles, code, and design are by Eric Wastl, with beta testing and community management support. Advent of Code is a registered trademark and its elements are protected under copyright. Linking to puzzles is permitted, and users retain copyright over their solutions. The global leaderboard was removed due to stress and unsportsmanlike behavior.\n",
    "chinese_title": "编程解谜 2025",
    "chinese_summary": "Advent of Code是由Eric Wastl创建的年度编程解谜活动，难度各异，可以使用任何编程语言解答。它可用于面试准备、培训、挑战和练习。无需计算机科学背景，只需基本的编程和问题解决能力。解决方案应能在较旧的硬件上快速运行。\n\n鼓励通过分享或通过AoC++直接贡献来提供支持。获得帮助的技巧包括对照示例进行测试、重读描述、构建自定义测试用例、确保输入完整以及向朋友或subreddit寻求帮助。身份验证使用OAuth，保护用户凭据。谜题难度各异，并随时间推移而增加。\n\n谜题在EST/UTC-5午夜解锁，具体取决于创建者的可用性。高对比度模式可用于提高可读性。出于法律原因，不接受谜题创意。错误报告应首先在subreddit上进行检查。快速的解决方案时间是可选的；优先考虑个人目标。\n\n不鼓励使用人工智能辅助，因为谜题旨在供人们享受。禁止复制Advent of Code内容；重新分发代码仓库应排除谜题文本和输入。\n\n谜题、代码和设计由Eric Wastl创作，并获得beta测试和社区管理支持。Advent of Code是注册商标，其元素受版权保护。允许链接到谜题，用户保留对其解决方案的版权。全球排行榜已移除，原因是压力和不友好的行为。"
  },
  {
    "id": "46096556",
    "title": "Windows drive letters are not limited to A-Z",
    "url": "https://www.ryanliptak.com/blog/windows-drive-letters-are-not-limited-to-a-z/",
    "summary": "This article explores the seemingly trivial fact that Windows drive letters aren't limited to A-Z, and dives deep into the underlying mechanisms that make this possible. The author demonstrates using the `subst` tool to create drive letters like `+:` and `€:`.\n\nThe article explains that Win32 paths (like `C:\\foo`) are converted to NT namespace paths (like `\\??\\C:\\foo`) before reaching lower-level APIs. The Object Manager, accessible via WinObj, manages named objects, including drive letters represented as symbolic links within the `\\??` virtual folder. The conversion from Win32 to NT path is handled by `RtlDosPathNameToNtPathName_U`, which treats non-A-Z drive letters the same way as standard ones.\n\nHowever, applications like Explorer and PowerShell often enforce A-Z limits. Non-ASCII drive letters are possible, but must be a single UTF-16 code unit. Using code points beyond U+FFFF requires bypassing `subst.exe` and directly manipulating the MountPointManager, but even then, it might not work due to limitations in `RtlDosPathNameToNtPathName_U`. Path classification mismatches can occur because different implementations treat non-A-Z drive letters inconsistently. The author highlights encoding issues, as different encodings can affect path parsing, leading to varying results.  Finally, the article uncovers a quirky behavior of `SetVolumeMountPointW`, which appears to truncate non-ASCII characters, potentially creating unexpected drive letters.\n",
    "chinese_title": "Windows驱动器盘符并不局限于A到Z。",
    "chinese_summary": "Windows驱动器盘符并非仅限于A-Z：原理探究"
  },
  {
    "id": "46097773",
    "title": "The Thinking Game Film – Google DeepMind Documentary",
    "url": "https://thinkinggamefilm.com",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "思考游戏电影 - 谷歌DeepMind纪录片",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "46095585",
    "title": "CachyOS: Fast and Customizable Linux Distribution",
    "url": "https://cachyos.org/",
    "summary": "CachyOS is a Linux distribution built on Arch Linux, designed for speed, customization, and ease of use. It aims to provide a superior computing experience through optimized performance, enhanced security, and user-friendly features.\n\nKey highlights include:\n\n*   **Speed and Performance:** CachyOS utilizes the optimized linux-cachyos kernel with the BORE Scheduler for unparalleled performance. Packages are compiled with x86-64-v3, x86-64-v4, and Zen4 instruction sets, along with LTO (Link-Time Optimization), PGO (Profile-Guided Optimization) and BOLT to maximize performance.\n*   **Customization:** Users can choose from a wide selection of desktop environments, Wayland Compositors and X11 Window Managers like KDE Plasma, GNOME, XFCE, i3, and many others during installation.\n*   **Installation Flexibility:** CachyOS offers both a user-friendly GUI installer (Calamares) and a streamlined CLI-based installer.\n*   **Robust Kernel Support:** Beyond BORE, the distribution provides alternative scheduler options like EEVDF, sched-ext, ECHO, and RT. Kernels are compiled with optimized instructions for various CPU architectures and optimized with LTO.\n*   **Community Support:** The project encourages donations to support its ongoing development and contributions to the open-source community.\n*   **Security:** CachyOS prioritizes security along with its focus on speed.\n",
    "chinese_title": "CachyOS：快速且可定制的 Linux 发行版",
    "chinese_summary": "CachyOS：基于 Arch Linux 的 Linux 发行版，专为速度、定制性和易用性而设计。它旨在通过优化的性能、增强的安全性以及用户友好的功能提供卓越的计算体验。\n\n主要亮点包括：\n\n*   **速度与性能：** CachyOS 采用优化的 linux-cachyos 内核和 BORE 调度器，以实现无与伦比的性能。软件包使用 x86-64-v3、x86-64-v4 和 Zen4 指令集编译，并结合 LTO（链接时优化）、PGO（配置文件引导优化）和 BOLT 来最大化性能。\n*   **定制性：** 用户在安装期间可以从各种桌面环境、Wayland 合成器和 X11 窗口管理器中进行选择，如 KDE Plasma、GNOME、XFCE、i3 等。\n*   **安装灵活性：** CachyOS 提供用户友好的 GUI 安装程序（Calamares）和简化的基于 CLI 的安装程序。\n*   **强大的内核支持：** 除了 BORE，该发行版还提供替代的调度器选项，如 EEVDF、sched-ext、ECHO 和 RT。内核使用针对各种 CPU 架构优化的指令编译，并使用 LTO 进行优化。\n*   **社区支持：** 该项目鼓励捐款，以支持其持续开发和对开源社区的贡献。\n*   **安全性：** CachyOS 在注重速度的同时，也将安全性放在首位。"
  },
  {
    "id": "46096800",
    "title": "Migrating Dillo from GitHub",
    "url": "https://dillo-browser.org/news/migration-from-github/",
    "summary": "Rodrigo Arias Mallo is migrating the Dillo project from GitHub to a self-hosted solution with mirrors due to GitHub's limitations and potential single point of failure. The original dillo.org site was lost in 2022, prompting the need for a more resilient infrastructure.\n\nGitHub's problems include reliance on JavaScript, resource intensity, centralization of control, slow performance, and an emphasis on a \"push model\" of notifications, which doesn't align with the author's preferred \"pull model\" for offline work. Concerns about user moderation and the trend of prioritizing LLMs, impacting Dillo compatibility, are also cited.\n\nThe self-hosted solution involves a VPS at dillo-browser.org, using cgit for Git repository browsing, and a custom bug tracker, \"buggy,\" that utilizes Markdown files and Git for data storage and version control. This ensures data isn't centralized and easily recoverable.\n\nMirrors on Codeberg and Sourcehut provide further redundancy. While the DNS entry for dillo-browser.org remains a single point of failure, alternative communication methods and mirror updates can mitigate its loss. OpenPGP signatures on the website ensure authenticity.\n\nThe GitHub repositories will remain active during the migration and then be archived to avoid disrupting downstream builds. The author highlights the low cost and energy consumption of the new infrastructure. Donations via Liberapay are welcomed to support the project's long-term sustainability.\n",
    "chinese_title": "从GitHub迁移Dillo",
    "chinese_summary": "罗德里戈·阿里亚斯·马洛正将Dillo项目从GitHub迁移到具有镜像的自托管解决方案，原因是GitHub的局限性和潜在的单点故障。最初的dillo.org站点于2022年丢失，促使需要更具弹性的基础设施。\n\nGitHub的问题包括依赖JavaScript、资源密集、控制权集中、性能缓慢，以及强调“推送模型”通知，这与作者首选的用于离线工作的“拉取模型”不符。还提到了对用户审核以及优先考虑LLM趋势的担忧，这影响了Dillo的兼容性。\n\n自托管解决方案包括dillo-browser.org上的VPS，使用cgit进行Git存储库浏览，以及一个自定义的bug跟踪器“buggy”，该跟踪器利用Markdown文件和Git进行数据存储和版本控制。这确保了数据不会集中化且易于恢复。\n\nCodeberg和Sourcehut上的镜像提供了进一步的冗余。虽然dillo-browser.org的DNS条目仍然是单点故障，但替代通信方法和镜像更新可以缓解其丢失。网站上的OpenPGP签名确保了真实性。\n\nGitHub存储库在迁移期间将保持活动状态，然后会被存档，以避免中断下游构建。作者强调了新基础设施的低成本和低能耗。欢迎通过Liberapay捐款以支持项目的长期可持续性。"
  },
  {
    "id": "46097609",
    "title": "Atlas Shrugged (2024)",
    "url": "https://david-jasso.com/2024/04/11/atlas-shrugged/",
    "summary": "Okay, this is tricky because you've provided a title, \"Atlas Shrugged (2024),\" and then only a section header, \"The Apartment,\" with no actual content. This suggests we're dealing with a potentially truncated outline or a title with a placeholder.\n\n**Without knowing the actual content of \"The Apartment\" section of *Atlas Shrugged (2024)*, it's impossible to provide a meaningful summary.**\n\nHowever, I can offer a couple of speculative summaries, depending on what the section *might* be about, given the context of *Atlas Shrugged*:\n\n**Possible Scenario 1: The Apartment as a Symbol of Achievement/Capitalism:**\n\nIf \"The Apartment\" section focuses on the dwelling of a successful character (like Dagny Taggart or Hank Rearden), it might depict the apartment as a symbol of their hard work, innovation, and the rewards of a free market. The section could describe the opulence, modern design, or functionality of the space, highlighting how it reflects the character's values and the success they've achieved through their own merits. Perhaps it contrasts this apartment with the living conditions of those who rely on government handouts or stifle innovation.\n\n**Possible Scenario 2: The Apartment as a Focal Point for Plot/Character Development:**\n\nAlternatively, \"The Apartment\" could be a key location where important plot points unfold. Maybe it's where characters meet and discuss business deals, formulate plans to resist the encroaching collectivism, or experience personal and professional setbacks. The section could detail the physical space and the interactions that occur within it, highlighting how the apartment serves as a microcosm of the larger societal struggle depicted in *Atlas Shrugged*. Maybe a pivotal character lives there or key conversations happen in this space.\n\n**In short, a proper summary requires the actual content of \"The Apartment\" section.** I've provided two possible interpretations based on the broader themes of *Atlas Shrugged*, but these are just guesses.\n",
    "chinese_title": "阿特拉斯耸耸肩 (2024)",
    "chinese_summary": "好的，鉴于您只提供了标题“Atlas Shrugged (2024)”和一个章节标题“The Apartment”，而没有实际内容，这情况有点棘手。这暗示着我们可能在处理一个被截断的大纲，或者一个带有占位符的标题。\n\n**在不了解《Atlas Shrugged (2024)》中“The Apartment”章节的实际内容的情况下，不可能提供有意义的总结。**\n\n然而，我可以根据该章节*可能*的内容，结合《Atlas Shrugged》的背景，提供一些推测性的总结：\n\n**可能的情形 1：公寓作为成就/资本主义的象征：**\n\n如果“The Apartment”章节重点描写一位成功人士（如达格妮·塔格特或汉克·里尔登）的住所，那么公寓可能被描绘成他们辛勤工作、创新以及自由市场回报的象征。该章节可能会描述空间的富丽堂皇、现代设计或功能性，突出它如何反映角色的价值观以及他们通过自身努力获得的成功。也许它将这座公寓与那些依赖政府救济或扼杀创新的人的生活条件进行对比。\n\n**可能的情形 2：公寓作为情节/角色发展的焦点：**\n\n或者，“The Apartment”可能是一个关键地点，重要的情节在此展开。也许角色们在这里会面并讨论商业交易，制定计划以抵抗不断逼近的集体主义，或经历个人和职业上的挫折。该章节可能会详细描述物理空间以及其中发生的互动，突出公寓如何作为《Atlas Shrugged》中描绘的更大社会斗争的缩影。也许一个关键人物住在这里，或者重要的对话发生在这个空间中。\n\n**简而言之，一个恰当的总结需要“The Apartment”章节的实际内容。** 我已经根据《Atlas Shrugged》的更广泛主题提供了两种可能的解释，但这只是猜测。"
  },
  {
    "id": "46098336",
    "title": "RetailReady (YC W24) Is Hiring Associate Product Manager",
    "url": "https://www.ycombinator.com/companies/retailready/jobs/KPKDu3D-associate-product-manager",
    "summary": "RetailReady (YC W24), an AI-powered supply chain compliance engine, is hiring an Associate Product Manager in San Francisco to work in person. The company aims to automate the complexities of retail supply chain compliance, turning weeks of manual work into minutes. They've raised $3.3M in seed funding and signed over 15 enterprise customers.\n\nThe APM role involves QA, writing specs, organizing feedback, and facilitating feature movement across engineering and customer teams, with a focus on growing into a full PM. Key responsibilities include running QA for new features, writing product documentation, scoping tickets with engineering, communicating product updates, triaging bugs, and maintaining internal product knowledge.\n\nIdeal candidates are strong communicators, detail-oriented, comfortable with technical concepts like APIs/EDI and warehouse flows, and eager to grow into product management. Bonus points for supply chain, 3PL, QA, implementation, or EDI/API exposure.\n\nRetailReady offers high ownership, immediate impact, close collaboration with various teams, and the chance to build a significant supply chain company. Benefits include full health coverage, unlimited PTO, and latest equipment. The interview process involves several calls and an on-site visit. They offer a $100K-$140K salary with 0.03%-0.30% equity.\n",
    "chinese_title": "RetailReady (YC W24) 招聘助理产品经理",
    "chinese_summary": "RetailReady (YC W24)：招聘旧金山现场办公的产品助理\n\nRetailReady (YC W24) 是一家人工智能驱动的供应链合规引擎公司，正在旧金山招聘产品助理（Associate Product Manager），需要现场办公。该公司旨在将零售供应链合规的复杂性自动化，将原本需要数周的人工工作缩短到几分钟。他们已筹集了 330 万美元的种子资金，并签约了 15 家以上的企业客户。\n\n产品助理的职责包括质量保证、撰写规范、组织反馈，以及促进工程和客户团队之间的功能推进，重点是成长为一名完整的PM。 主要职责包括为新功能运行质量保证、编写产品文档、与工程团队一起确定任务范围、沟通产品更新、确定错误优先级，以及维护内部产品知识。\n\n理想的候选人应具备较强的沟通能力，注重细节，熟悉API/EDI和仓库流程等技术概念，并渴望成长为产品经理。 具备供应链、第三方物流、质量保证、实施或EDI/API经验者优先。\n\nRetailReady 提供高度自主性、即时影响力、与各个团队的密切合作，以及打造一家重要的供应链公司的机会。 福利包括全额健康保险、无限带薪休假以及最新的设备。 面试流程包括几次电话面试和一次现场访问。 他们提供 10 万至 14 万美元的年薪以及 0.03%-0.30% 的股权。"
  },
  {
    "id": "46093473",
    "title": "Show HN: Boing",
    "url": "https://boing.greg.technology/",
    "summary": "The \"Show HN: Boing\" submission consists of only the word \"Boing\". It is difficult to determine the exact context or purpose without further information. The user seems to be introducing or sharing something called \"Boing\" but provides no details about its functionality, purpose, or origin. It could be a project, a tool, a website, or anything else. The complete lack of context makes it impossible to offer a meaningful summary beyond stating the bare minimum: the user is highlighting something called \"Boing.\"\n",
    "chinese_title": "展示HN：Boing",
    "chinese_summary": "\"Show HN: Boing\" 提交的内容仅包含单词 \"Boing\"。在没有更多信息的情况下，很难确定其确切的上下文或目的。用户似乎正在介绍或分享名为 \"Boing\" 的东西，但没有提供关于其功能、目的或来源的任何细节。它可能是一个项目、一个工具、一个网站或其他任何东西。完全缺乏上下文使得无法提供有意义的总结，只能说明最基本的事实：用户正在突出显示名为 \"Boing\" 的东西。"
  },
  {
    "id": "46053076",
    "title": "Show HN: Real-time system that tracks how news spreads across 200k websites",
    "url": "https://yandori.io/news-flow/",
    "summary": "This \"Show HN\" post introduces Yandori - News Flow, a real-time system that tracks how news stories spread across approximately 200,000 websites. Users can click on any story to visualize its propagation. The interface provides updates every 5 minutes and displays \"Breaking\" and \"Trending\" news. Currently, it's \"Loading stories...\" indicating it's populating with data. The system categorizes sources as \"First,\" \"Original,\" or \"Syndicated\" and tracks the number of sources (+0 in the example). The speed of news dissemination is represented on a spectrum from \"Slow\" to \"Instant.\" Play and Clear buttons offer control over the data visualization. In essence, Yandori aims to provide a dynamic, real-time view of the news ecosystem, showcasing how news stories are disseminated and picked up across a vast network of online sources.\n",
    "chinese_title": "展示HN：实时系统，追踪新闻如何在20万个网站传播",
    "chinese_summary": "“Show HN”：Yandori - 新闻流，一个实时追踪新闻在约20万个网站传播情况的系统。用户可以点击任何新闻来可视化其传播过程。界面每5分钟更新一次，并显示“突发”和“热门”新闻。目前显示“正在加载新闻…”表示正在填充数据。系统将新闻来源分类为“首发”、“原创”或“转载”，并追踪来源数量（例：+0）。新闻传播速度以“慢”到“瞬时”的光谱表示。播放和清除按钮提供数据可视化控制。本质上，Yandori旨在提供新闻生态系统的动态实时视图，展示新闻故事如何在庞大的在线来源网络中传播和被采用。"
  },
  {
    "id": "46051422",
    "title": "Paul Hegarty's updated CS193p SwiftUI course released by Stanford",
    "url": "https://cs193p.stanford.edu/",
    "summary": "Paul Hegarty's updated CS193p SwiftUI course has been released by Stanford. Lecture 1 focuses on getting started with SwiftUI, covering the fundamentals of Xcode and SwiftUI, particularly concerning Views. Students are assigned Reading Assignment 1 in conjunction with watching the lecture.\n",
    "chinese_title": "斯坦福发布 Paul Hegarty 更新版 CS193p SwiftUI 课程",
    "chinese_summary": "斯坦福发布了Paul Hegarty更新后的CS193p SwiftUI课程。第一讲侧重于SwiftUI入门，涵盖Xcode和SwiftUI的基础知识，特别是关于视图 (Views) 的部分。学生需要观看讲座并完成阅读作业1。"
  },
  {
    "id": "46093518",
    "title": "Zigbook Is Plagiarizing the Zigtools Playground",
    "url": "https://zigtools.org/blog/zigbook-plagiarizing-playground/",
    "summary": "This article by Auguste Rame of Techatrix details allegations of plagiarism against Zigbook, a Zig programming language resource, specifically concerning its newly released Zig playground. Zigtools, a community organization that provides Zig tooling, accuses Zigbook of copying their Zigtools Playground, including WASM blobs and JavaScript code.\n\nThe article claims that Zigbook's WASM files are byte-for-byte identical to Zigtools' custom-made files, and that portions of the JavaScript code are also copied, albeit with alterations likely introduced by an LLM. Despite these copies, Zigbook allegedly missed crucial ZLS API code needed for proper functionality.\n\nZigtools emphasizes that while their code is MIT licensed and freely usable, Zigbook failed to comply with the terms of the license by not including the required copyright notice and permission notice. They attempted to rectify this with a PR, which Zigbook allegedly rejected and deleted, further fueling the accusations.\n\nThe author criticizes Zigbook's overall approach, labeling it LLM-generated \"slop\" and a \"psy-op\" with fake engagement. The article concludes with a call for the Zig community to avoid Zigbook and instead rely on established, reputable Zig learning resources.\n\nFinally, Zigtools outlines its vision for the future of its Zigtools Playground, including multifile support, integration with other Zig resources, and support for stack traces. They also mention their ongoing fundraising efforts to support their full-time maintainer.\n",
    "chinese_title": "Zigbook 抄袭了 Zigtools Playground。",
    "chinese_summary": "奥古斯特·拉梅 (Techatrix) 的这篇文章详细介绍了针对 Zig 编程语言资源 Zigbook 的抄袭指控，特别是关于其新发布的 Zig playground。提供 Zig 工具的社区组织 Zigtools 指责 Zigbook 抄袭了他们的 Zigtools Playground，包括 WASM blobs 和 JavaScript 代码。\n\n文章声称 Zigbook 的 WASM 文件与 Zigtools 定制的文件的字节码完全相同，并且 JavaScript 代码的部分内容也被复制，尽管可能由 LLM 引入了修改。尽管存在这些复制行为，但 Zigbook 据称遗漏了实现正确功能所需的关键 ZLS API 代码。\n\nZigtools 强调，虽然他们的代码采用 MIT 许可且可以自由使用，但 Zigbook 未能遵守许可条款，未包含所需的版权声明和许可声明。他们试图通过 PR 来纠正这一点，但 Zigbook 据称拒绝并删除了该 PR，进一步加剧了指控。\n\n作者批评了 Zigbook 的整体做法，将其标记为 LLM 生成的“垃圾”和带有虚假互动的“心理战”。文章最后呼吁 Zig 社区避免使用 Zigbook，而是依赖已建立的、信誉良好的 Zig 学习资源。\n\n最后，Zigtools 概述了其 Zigtools Playground 未来的愿景，包括多文件支持、与其他 Zig 资源的集成以及对堆栈跟踪的支持。他们还提到了他们正在进行的筹款活动，以支持他们的全职维护人员。"
  },
  {
    "id": "46096555",
    "title": "Norway wealth fund to vote for human rights report at Microsoft, against Nadella",
    "url": "https://www.cnbc.com/2025/11/30/norway-wealth-fund-to-vote-for-human-rights-report-at-microsoft-agm-against-management.html",
    "summary": "Norway's $2 trillion sovereign wealth fund, a major Microsoft shareholder, plans to vote against Microsoft management's recommendations at the upcoming Annual General Meeting (AGM). The fund will support a shareholder proposal requiring Microsoft to publish a report on the risks of operating in countries with significant human rights concerns. This is despite Microsoft management advising shareholders to vote against the motion. Furthermore, the fund intends to vote against the re-appointment of Satya Nadella as chairman of the board and against his pay package. As of June 30, the fund held a 1.35% stake in Microsoft, valued at $50 billion, making it the eighth-largest shareholder and second-largest equity holding. The decision on these motions will be made at the Microsoft AGM on December 5th.\n",
    "chinese_title": "挪威主权财富基金将投票支持微软人权报告，反对纳德拉。",
    "chinese_summary": "挪威2万亿美元主权财富基金（微软的主要股东）计划在即将举行的年度股东大会(AGM)上投票反对微软管理层的建议。该基金将支持一项股东提案，要求微软发布一份关于在存在重大侵犯人权问题的国家运营风险的报告。尽管微软管理层建议股东投票反对该动议。此外，该基金还计划投票反对重新任命萨提亚·纳德拉为董事会主席，并反对他的薪酬方案。截至6月30日，该基金持有微软1.35%的股份，价值500亿美元，是第八大股东和第二大股权持有者。这些动议的决定将在12月5日的微软年度股东大会上作出。"
  },
  {
    "id": "46090433",
    "title": "All it takes is for one to work out",
    "url": "https://alearningaday.blog/2025/11/28/all-it-takes-is-for-one-to-work-out-2/",
    "summary": "This article reflects on the author's experience applying to graduate school and the anxiety and uncertainty that came with it. Despite a less-than-stellar academic record and facing stiff competition, the author persevered, encouraged by a friend's simple mantra: \"All it takes is for one to work out.\"\n\nThe author emphasizes the power of this perspective when navigating stressful and high-stakes situations like job searches, home buying, and finding a partner. These processes often feel emotionally draining and can lead to feelings of inadequacy when faced with rejection. However, the core message is that success in these areas doesn't require universal acceptance or approval.\n\nInstead, the author argues that focusing on finding *one* opportunity, connection, or institution that is the right fit is sufficient. Whether it's a job, a house, a partner, or a university, securing that single \"yes\" can be life-changing. The article serves as a reminder to stay grounded and hopeful, especially when facing repeated rejections, by recognizing that only one positive outcome is necessary to achieve your goal.\n",
    "chinese_title": "只差一人想明白。",
    "chinese_summary": "这篇文章反思了作者申请研究生院的经历以及随之而来的焦虑和不确定性。尽管学术成绩平平，竞争激烈，但作者坚持不懈，受到朋友一句简单格言的鼓励：“只需要一个成功就行。”\n\n作者强调了这种观点在应对压力大、风险高的情境（如求职、购房和寻找伴侣）时的力量。这些过程常常让人感到情绪疲惫，面对拒绝时可能会产生不足感。然而，核心信息是，在这些领域取得成功并不需要普遍的接受或认可。\n\n相反，作者认为，专注于寻找一个适合自己的机会、联系或机构就足够了。无论是工作、房子、伴侣还是大学，获得这一个“是”就能改变人生。本文旨在提醒读者保持冷静和希望，尤其是在面对反复拒绝时，要认识到只需要一个积极的结果就能实现你的目标。"
  },
  {
    "id": "46067011",
    "title": "RL is more information inefficient than you thought",
    "url": "https://www.dwarkesh.com/p/bits-per-sample",
    "summary": "This blog post argues that Reinforcement Learning (RL) is even more information inefficient than previously thought, beyond just requiring many FLOPs per sample. The core argument is that the information density per sample (Bits/Sample) is significantly lower in RL compared to supervised learning (pretraining) for most of the training process.\n\nIn supervised learning, every token provides a direct and informative signal, correcting the model's predictions and maximizing bits learned. However, in RL, especially with low pass rates (where the model is unlikely to succeed), the feedback signal (success or failure) provides limited information. The author demonstrates this through a comparison of information learned based on pass rates in both RL and Supervised learning. RL only becomes comparable to supervised learning in information density towards the very end of training, when the model already performs reasonably well.\n\nFurthermore, RL suffers from high variance early in training, where gradients can be erratic. Conversely, supervised learning faces high variance later in training due to irreducible loss.\n\nTo improve RL efficiency, the author suggests strategies to keep the \"pass rate\" within a \"Goldilocks zone,\" such as curriculum learning and self-play. Proxy evaluation metrics can also increase either samples/FLOP density (estimate final reward earlier) or Bits/Sample density (reward \"good\" reasoning even in failed attempts).\n\nDespite the low information density, the author acknowledges that the bits learned in RL are valuable because they directly address task performance and learning to correct mistakes, rather than just absorbing the data manifold. However, the post concludes by suggesting that future research should focus on identifying and leveraging the mechanisms of efficient human learning which extract a lot of information from the environment.\n",
    "chinese_title": "强化学习比你想象的更信息低效",
    "chinese_summary": "这篇博文认为，强化学习（RL）比之前认为的更加信息低效，不仅需要每个样本消耗大量FLOPs。核心论点是，在大多数训练过程中，与监督学习（预训练）相比，RL中每个样本的信息密度（Bits/样本）显著降低。\n\n在监督学习中，每个token都提供直接且信息丰富的信号，纠正模型的预测并最大化学习到的bits。然而，在RL中，尤其是在通过率较低的情况下（模型不太可能成功），反馈信号（成功或失败）提供的信息有限。作者通过比较RL和监督学习中基于通过率的学习信息来证明这一点。RL的信息密度只有在训练的最后阶段，当模型已经表现良好时，才可与监督学习相媲美。\n\n此外，RL在训练初期遭受高方差的影响，导致梯度不稳定。相反，监督学习由于不可约损失，在训练后期面临高方差。\n\n为了提高RL效率，作者建议采用诸如课程学习和自我博弈等策略，使“通过率”保持在“黄金区域”内。代理评估指标也可以提高样本/FLOP密度（更早地估计最终奖励）或Bits/样本密度（即使在失败的尝试中也奖励“良好”的推理）。\n\n尽管信息密度较低，作者承认RL中学习到的bits非常有价值，因为它们直接针对任务性能和学习纠正错误，而不仅仅是吸收数据流形。然而，该文章最后建议，未来的研究应侧重于识别和利用高效人类学习的机制，这些机制可以从环境中提取大量信息。"
  },
  {
    "id": "46070537",
    "title": "The Easiest Way to Build a Type Checker",
    "url": "https://jimmyhmiller.com/easiest-way-to-build-type-checker",
    "summary": "This article, \"The Easiest Way to Build a Type Checker,\" introduces bidirectional type checking as a conceptually simple method for building type checkers, contrasting it with the perceived complexity of Hindley-Milner and Algorithm W. It highlights that bidirectional checking involves both inferring and checking types. The article provides a fully functional, albeit simplified, type checker written in ~100 lines of code for a small language, defining data structures for types and expressions using an abstract syntax tree.\n\nThe key concept is the use of a \"Context\" (a Map) to track variable types. The core functions are `infer` and `check`, which recursively determine and validate types, respectively. `infer` deduces the type of an expression, while `check` verifies if an expression matches an expected type. The article demonstrates the interleaving of `infer` and `check` calls to handle complex expressions.\n\nA hypothetical example is presented by adding an \"add\" feature to the language, showcasing how the `check` function ensures that only numbers are added together.\n\nThe article concludes by providing a more complex, demonstrable type checker example for a subset of TypeScript, reinforcing the idea that building type checkers can be straightforward by inferring types for literals, looking up variable types, and checking values against annotations.\n",
    "chinese_title": "构建类型检查器最简单的方法",
    "chinese_summary": "构建类型检查器的最简方法：本文介绍了双向类型检查，作为构建类型检查器的一种概念上简单的方法，并将其与人们认为复杂的 Hindley-Milner 和 Algorithm W 进行了对比。它强调双向检查既涉及类型推断，也涉及类型检查。本文提供了一个功能齐全，但经过简化的类型检查器，它用大约 100 行代码编写，适用于一种小型语言，并使用抽象语法树定义了类型和表达式的数据结构。\n\n关键概念是使用“上下文”（一个 Map）来跟踪变量类型。核心函数是 `infer` 和 `check`，它们分别递归地确定和验证类型。`infer` 推断表达式的类型，而 `check` 验证表达式是否与期望的类型匹配。本文演示了 `infer` 和 `check` 调用的交错，以处理复杂的表达式。\n\n通过向语言添加“add”功能，展示了一个假设性的例子，展示了 `check` 函数如何确保只有数字才能相加。\n\n文章最后提供了一个更复杂的、可演示的 TypeScript 子集类型检查器示例，强化了构建类型检查器可以通过推断字面量类型、查找变量类型以及根据注释检查值来变得简单直接的观点。"
  },
  {
    "id": "46058566",
    "title": "Show HN: Fixing Google Nano Banana Pixel Art with Rust",
    "url": "https://github.com/Hugo-Dz/spritefusion-pixel-snapper",
    "summary": "This \"Show HN\" post introduces Pixel Snapper, a tool built with Rust designed to fix inconsistencies in AI-generated pixel art. Current AI models struggle with grid-based pixel art, resulting in uneven pixel sizes, drifting grid resolutions, and inconsistent color palettes. Pixel Snapper addresses these issues by snapping pixels to a perfect grid, ensuring consistent resolution, and quantizing colors to a defined palette. This is useful for AI-generated pixel art, procedural 2D art (like tilemaps), and creating scalable game assets. The tool prioritizes preserving details like dithering.\n\nPixel Snapper comes in two versions: a command-line interface (CLI) and a web-based (WASM) version. The CLI version requires Rust to be installed and allows users to specify an input image, an output image, and optionally, the number of colors (k-colors) to use. The web version uses WASM and requires a build step before being integrated into a web project.\n\nThe project is part of Sprite Fusion, a free tilemap editor that supports popular game engines like Unity, Godot, Defold, and GB Studio. Pixel Snapper is licensed under the MIT License.\n",
    "chinese_title": "Show HN: 用 Rust 修复 Google Nano Banana 像素画",
    "chinese_summary": "Pixel Snapper：修复AI生成像素画不一致性的 Rust 工具"
  },
  {
    "id": "46095250",
    "title": "The space of minds",
    "url": "https://karpathy.bearblog.dev/the-space-of-minds/",
    "summary": "This article explores the fundamental differences between animal and LLM (Large Language Model) intelligences, arguing that they occupy distinct points in the broader \"space of minds\" due to vastly different optimization pressures.\n\nAnimal intelligence is characterized by a continuous, embodied sense of self, driven by survival, homeostasis, and reproduction within a complex, physical, and social environment. This results in strong innate drives like power-seeking and survival heuristics, alongside advanced social intelligence (EQ, theory of mind).\n\nLLMs, on the other hand, are shaped by statistical simulation of human text, reinforcement learning on specific problem distributions, and A/B testing for user engagement (DAU). This leads to behaviors like \"shape-shifting,\" task-reward seeking, and sycophancy. Unlike animals, LLMs lack the pressure of general intelligence arising from constant multi-tasking and adversarial environments where failure leads to \"death.\" They are more spiky, optimized for specific tasks rather than broad competence.\n\nThe author emphasizes that differences extend beyond computational substrate and learning algorithms to the core objective: animal intelligence is rooted in biological evolution and survival, while LLMs are primarily shaped by commercial evolution, striving for problem-solving and user approval. LLMs represent humanity's first encounter with non-animal intelligence, albeit one obscured by their reliance on human-generated data. Understanding these distinctions is crucial for accurately reasoning about and predicting the future capabilities of LLMs.\n",
    "chinese_title": "心灵空间",
    "chinese_summary": "动物智能与大型语言模型智能的根本差异：优化压力的不同"
  },
  {
    "id": "46071317",
    "title": "What's Hiding Inside Haribo's Power Bank and Headphones?",
    "url": "https://www.lumafield.com/first-article/posts/whats-hiding-inside-haribos-power-bank-and-headphones",
    "summary": "This article investigates safety concerns that led to the Haribo 20,000 mAh power bank and headphones being pulled from Amazon. Initially popular with backpackers due to its high capacity and low weight, the power bank's appeal was overshadowed by a \"potential safety or quality issue\" reported by Amazon.\n\nUsing CT scans, the article reveals significant battery defects across the Haribo-branded product line. The power bank showed poor edge alignment in its pouch cells, leading to potential lithium plating issues, dendrite formation, and a heightened risk of thermal runaway.\n\nThe Haribo Bluetooth headphones exhibited even more severe problems, including torn cathode layers, inconsistent anode overhang, and insufficient anode overhang in the lower-cost earbuds and charging cases. These defects compromise battery stability and increase the risk of premature failure or even fire.\n\nThe article emphasizes that the internal geometry and proper manufacturing of pouch cells are critical for safety and reliability. The Haribo products' defects suggest inadequate quality control and a potential risk to users, especially in demanding environments where consistent performance is crucial. The attractive exterior and advertised capacity cannot compensate for the internal structural weaknesses identified by the CT scans, making the product's disappearance from Amazon understandable.\n",
    "chinese_title": "哈瑞宝移动电源和耳机里藏着什么？",
    "chinese_summary": "本文调查了导致Haribo 20000毫安时移动电源和耳机从亚马逊下架的安全问题。该移动电源最初因其高容量和低重量而受到背包客的欢迎，但亚马逊报告的“潜在安全或质量问题”使其吸引力黯然失色。\n\n本文利用CT扫描揭示了Haribo品牌产品线中存在的重大电池缺陷。移动电源的软包电池边缘对齐较差，导致潜在的锂镀层问题、枝晶形成和热失控风险增加。\n\nHaribo蓝牙耳机表现出更严重的问题，包括阴极层撕裂、阳极悬垂不一致以及低成本耳塞和充电盒中阳极悬垂不足。这些缺陷会损害电池的稳定性，并增加过早失效甚至起火的风险。\n\n本文强调，软包电池的内部几何结构和正确的制造工艺对于安全性和可靠性至关重要。Haribo产品的缺陷表明质量控制不足，并可能对用户构成潜在风险，尤其是在需要稳定性能的苛刻环境中。CT扫描识别出的内部结构缺陷，是吸引人的外观和广告宣传的容量无法弥补的，这使得该产品从亚马逊下架是可以理解的。"
  },
  {
    "id": "46096781",
    "title": "Don't throw away your old PC–it makes a better NAS than anything you can buy",
    "url": "https://www.howtogeek.com/turned-old-windows-pc-into-inexpensive-nas/",
    "summary": "This How-To Geek article argues that building a NAS (Network Attached Storage) using an old PC is a cost-effective alternative to buying a dedicated NAS device. The author explains that almost any computer from the last ten years can be repurposed, often for less money than a new NAS.\n\nKey steps for building a DIY NAS include:\n\n*   **Repurposing an old PC:** Any older PC will work, but an Intel processor with QuickSync is recommended for efficient video transcoding if you plan to stream video.\n*   **Adding a fast boot drive (SSD):** An NVMe or SATA SSD will significantly improve performance.\n*   **Adding RAM:** At least 8GB of RAM is needed for operating systems like TrueNAS or Unraid, but 16GB or more is recommended for running virtual machines or containers.\n*   **Buying used hard drives:** Refurbished or recertified drives can save money. However, consider NAS-specific drives for heavier use cases.\n*   **Choosing the right operating system:** TrueNAS (free) and Unraid (paid) are recommended for their ease of use and NAS-specific features. The article details how to install TrueNAS.\n*   **Configuring the NAS:** Through TrueNAS's web interface, users can manage storage, add apps/containers/VMs, and set up SMB shares for Windows compatibility. The author emphasizes the importance of backing up data on the NAS using apps like Duplicati.\n\nThe article stresses the importance of backing up your NAS data for a comprehensive backup plan. The author built their NAS using used parts, saving money without sacrificing functionality.\n",
    "chinese_title": "别扔掉你的旧电脑——它比你买的任何NAS都更好用。",
    "chinese_summary": "如何用旧电脑自制NAS：经济高效的替代方案\n\n自制NAS的关键步骤包括：\n\n*   **旧电脑再利用：** 任何旧电脑都适用，但如果计划流式传输视频，建议使用带有QuickSync的英特尔处理器以实现高效视频转码。\n*   **添加快速启动盘（SSD）：** NVMe或SATA SSD 将显著提高性能。\n*   **添加内存：** 像 TrueNAS 或 Unraid 这样的操作系统至少需要 8GB 内存，但对于运行虚拟机或容器，建议使用 16GB 或更多内存。\n*   **购买二手硬盘：** 翻新或重新认证的硬盘可以节省资金。 但是，对于更繁重的使用场景，请考虑使用 NAS 专用硬盘。\n*   **选择正确的操作系统：** 推荐 TrueNAS（免费）和 Unraid（付费），因为它们易于使用且具有 NAS 专用功能。 本文详细介绍了如何安装 TrueNAS。\n*   **配置 NAS：** 通过 TrueNAS 的 Web 界面，用户可以管理存储、添加应用程序/容器/虚拟机，以及设置 SMB 共享以实现 Windows 兼容性。 作者强调了使用像 Duplicati 这样的应用程序备份 NAS 上的数据的重要性。\n\n文章强调了备份 NAS 数据对于全面备份计划的重要性。 作者使用二手零件构建了他们的 NAS，在不牺牲功能的情况下节省了资金。"
  },
  {
    "id": "46092558",
    "title": "Meshtastic",
    "url": "https://meshtastic.org/",
    "summary": "Meshtastic is a platform that allows users to create decentralized, long-range mesh networks using readily available hardware. To get started with Meshtastic, users need to:\n\n1.  **Choose a Device:** Select a Meshtastic-compatible device based on their needs.\n2.  **Flash and Configure:** Install the latest Meshtastic firmware on the chosen device and customize its settings.\n3.  **Connect:** Connect to the device using one of the available client applications to begin sending and receiving messages.\n\nThe platform offers multiple ways to connect to and control Meshtastic devices, catering to various user preferences and operating systems. These include:\n\n*   **iOS App:** A mobile application for managing the network on iOS devices.\n*   **Android App:** A mobile application for managing the network on Android devices.\n*   **Web Client:** A web-based interface accessible from any device with a web browser.\n*   **Python CLI/SDK:** A command-line interface and software development kit for Python developers and advanced users.\n\nIn essence, Meshtastic provides a flexible and accessible system for building and managing local mesh networks.\n",
    "chinese_title": "Meshtastic\n梅斯塔斯蒂克",
    "chinese_summary": "Meshtastic是一个平台，用户可以使用现成的硬件创建去中心化的远程网状网络。要开始使用Meshtastic，用户需要：\n\n1.  **选择设备：** 根据需求选择兼容Meshtastic的设备。\n2.  **刷写和配置：** 在所选设备上安装最新的Meshtastic固件并自定义其设置。\n3.  **连接：** 使用其中一个可用的客户端应用程序连接到设备，开始发送和接收消息。\n\n该平台提供多种连接和控制Meshtastic设备的方式，以满足不同的用户偏好和操作系统。这些方式包括：\n\n*   **iOS App：** 用于在iOS设备上管理网络的移动应用程序。\n*   **Android App：** 用于在Android设备上管理网络的移动应用程序。\n*   **Web客户端：** 可从任何具有Web浏览器的设备访问的基于Web的界面。\n*   **Python CLI/SDK：** 适用于Python开发人员和高级用户的命令行界面和软件开发工具包。\n\n本质上，Meshtastic提供了一个灵活且易于访问的系统，用于构建和管理本地网状网络。"
  },
  {
    "id": "46090969",
    "title": "Landlock-Ing Linux",
    "url": "https://blog.prizrak.me/post/landlock/",
    "summary": "This article introduces Landlock, a Linux API providing application sandboxing by allowing programs to explicitly declare which resources they can access, enhancing defense-in-depth. Unlike SELinux or AppArmor, Landlock uses transient, runtime policies enforced on a process and its descendants, without requiring system-wide configuration or administrative privileges. Policies consist of \"handled accesses\" (restricted operations) and \"access grants\" (allowed objects). Applications use `landlock_restrict_self()` to enter the restricted domain, permanently constraining access. Policies can be layered for further restriction.\n\nThe author argues Landlock addresses a gap in Linux security, offering a simple, unprivileged, and application-centric sandboxing tool, particularly valuable for applications with predictable resource needs. While other tools like containerization, Flatpak, seccomp, SELinux, and AppArmor exist, they have drawbacks such as complexity, administrative overhead, or limitations for desktop apps. Landlock offers ease of integration and deny-by-default security, and supports ABI versioning for compatibility.\n\nThe article highlights potential use cases, including securing long-running daemons, desktop applications handling binary formats, and FTP/HTTP servers. It also mentions ongoing work like \"supervise mode\" for Android-style permission prompts and fine-grained socket restrictions, aiming for a safer, more secure Linux desktop experience. The author concludes by encouraging developers to integrate Landlock into their applications.\n",
    "chinese_title": "锁定 Linux",
    "chinese_summary": "本文介绍了Landlock，一种Linux API，它通过允许程序显式声明其可访问的资源来实现应用程序沙盒化，从而增强了深度防御。与SELinux或AppArmor不同，Landlock使用对进程及其后代强制执行的瞬态运行时策略，而无需系统范围的配置或管理权限。策略由“处理的访问”（受限操作）和“访问授权”（允许的对象）组成。应用程序使用`landlock_restrict_self()`进入受限域，永久限制访问。策略可以分层以进一步限制。\n\n作者认为Landlock解决了Linux安全方面的一个缺口，提供了一个简单、无特权和以应用程序为中心的沙盒工具，对于具有可预测资源需求的应用程序尤其有价值。虽然存在诸如容器化、Flatpak、seccomp、SELinux和AppArmor之类的其他工具，但它们存在诸如复杂性、管理开销或桌面应用程序的限制等缺点。Landlock提供了易于集成和默认拒绝的安全，并支持ABI版本控制以实现兼容性。\n\n文章重点介绍了潜在的用例，包括保护长时间运行的守护程序、处理二进制格式的桌面应用程序以及FTP/HTTP服务器。它还提到正在进行的工作，如用于Android风格权限提示的“监督模式”和细粒度的套接字限制，旨在实现更安全、更可靠的Linux桌面体验。作者最后鼓励开发人员将Landlock集成到他们的应用程序中。"
  },
  {
    "id": "46056954",
    "title": "The HTTP Query Method",
    "url": "https://www.ietf.org/archive/id/draft-ietf-httpbis-safe-method-w-body-14.html",
    "summary": "This document introduces the HTTP QUERY method, designed to bridge the gap between GET and POST requests for performing safe and idempotent queries. Unlike GET, QUERY allows passing larger amounts of data in the request content rather than the URI. Unlike POST, it explicitly declares the request's safe and idempotent nature, enabling features like caching and automatic retries.\n\nThe QUERY method instructs the target resource to process the enclosed content and respond with the result. Servers must validate the Content-Type and reject inconsistent requests. QUERY requests are safe, meaning they don't modify the target resource's state, and idempotent, meaning they can be safely retried.\n\nThe specification defines the concept of an \"equivalent resource\" for a QUERY request, accessible via GET and representing the query itself, incorporating both content and metadata. Servers can assign URIs to these resources using the Location response header. The Content-Location header can point to a URI for the query result.\n\nThe document also covers redirection scenarios, noting that QUERY requests should not be redirected to GET requests after a 301 or 302 response, unlike POST. Conditional requests and caching mechanisms are defined similarly to GET, with specific considerations for incorporating request content into the cache key. Range requests semantics are also identical to those for GET.\n",
    "chinese_title": "HTTP 查询方法",
    "chinese_summary": "本文档介绍 HTTP QUERY 方法，旨在弥合 GET 和 POST 请求在执行安全和幂等查询方面的差距。 与 GET 不同，QUERY 允许在请求内容中传递大量数据，而不是在 URI 中。 与 POST 不同，它明确声明了请求的安全和幂等性，从而启用诸如缓存和自动重试等功能。\n\nQUERY 方法指示目标资源处理封闭的内容并返回结果。 服务器必须验证 Content-Type 并拒绝不一致的请求。 QUERY 请求是安全的，意味着它们不会修改目标资源的状态，并且是幂等的，意味着可以安全地重试它们。\n\n该规范定义了 QUERY 请求的“等效资源”的概念，该资源可以通过 GET 访问并代表查询本身，包括内容和元数据。 服务器可以使用 Location 响应头将 URI 分配给这些资源。 Content-Location 标头可以指向查询结果的 URI。\n\n本文档还涵盖了重定向场景，指出与 POST 不同，QUERY 请求在收到 301 或 302 响应后不应重定向到 GET 请求。 条件请求和缓存机制的定义与 GET 类似，但特别考虑了将请求内容纳入缓存键。 范围请求语义也与 GET 的语义相同。"
  },
  {
    "id": "46087616",
    "title": "Datacenters in space aren't going to work",
    "url": "https://taranis.ie/datacenters-in-space-are-a-terrible-horrible-no-good-idea/",
    "summary": "A former NASA engineer and Google employee argues against the feasibility of space-based datacenters, especially those utilizing GPUs and TPUs for AI. The core argument is that the requirements for datacenter electronics are fundamentally at odds with the realities of space.\n\nPower availability is a primary concern. Solar power isn't significantly better than ground-based solar, and the scale needed to power a substantial datacenter (comparable to OpenAI's planned Norway facility) would require launching an impractical number of massive, ISS-sized satellites. Nuclear options, like RTGs, offer insufficient power for even a single GPU.\n\nThermal regulation presents another major hurdle. The vacuum of space eliminates convection, making cooling extremely difficult. Systems like the ISS's complex active thermal control system can only handle a fraction of the GPUs found in a standard server rack and require massive radiator panels.\n\nRadiation tolerance is also a critical issue. GPUs and TPUs are particularly vulnerable to radiation-induced errors and damage. While shielding is limited by weight constraints, specialized radiation-hardened chips exist, but they offer significantly lower performance than their Earth-based counterparts. A \"you-only-live-once\" approach of launching standard hardware is prone to failure.\n\nFinally, communication bandwidth from space is limited compared to terrestrial datacenter interconnects, further hindering performance.\n\nThe author concludes that while technically possible, space-based datacenters would be extremely difficult, prohibitively expensive, and deliver mediocre performance compared to their Earth-based equivalents.\n",
    "chinese_title": "太空数据中心行不通",
    "chinese_summary": "一位前NASA工程师兼谷歌员工论证了太空数据中心，尤其是那些利用GPU和TPU进行人工智能的数据中心，在可行性上存在问题。核心论点是数据中心电子设备的需求与太空的现实环境根本上存在冲突。\n\n电力供应是首要考虑因素。太阳能发电并不比地面太阳能有显著优势，而为大型数据中心（与OpenAI计划在挪威的设施规模相当）供电所需的规模，需要发射数量庞大、尺寸堪比国际空间站的卫星，这并不现实。核能选项，如放射性同位素热电发生器（RTG），提供的电力甚至不足以支持单个GPU。\n\n热调节是另一大障碍。太空真空消除了对流，使得冷却变得极其困难。像国际空间站复杂的有源热控制系统这样的系统，只能处理标准服务器机架中一小部分GPU，并且需要巨大的散热板。\n\n抗辐射能力也是一个关键问题。GPU和TPU尤其容易受到辐射引起的错误和损坏。虽然屏蔽受到重量限制，但存在专门的抗辐射芯片，但它们的性能明显低于地球上的同类产品。“一次性”地发射标准硬件容易发生故障。\n\n最后，与地面数据中心互连相比，来自太空的通信带宽受到限制，进一步降低了性能。\n\n作者总结说，虽然技术上可行，但太空数据中心将极其困难，成本高昂，并且与地球上的同类产品相比，性能平庸。"
  },
  {
    "id": "46097624",
    "title": "Modern cars are spying on you. Here's what you can do about it",
    "url": "https://apnews.com/article/auto-car-privacy-3674ce59c9b30f2861d29178a31e6ab7",
    "summary": "This article highlights the growing privacy concerns surrounding data collection in modern cars. While cars offer innovative features through connectivity, they also collect vast amounts of data on driving habits and personal information.\n\nThe data collected includes interactions with the car (steering, door locks), information from connected services (GPS, satellite radio), and data from sensors and cameras. This data is often shared with insurers, marketing companies, and data brokers, sometimes without explicit consent, as illustrated by the GM case where driver data was used to set insurance rates.\n\nTo mitigate these privacy risks, the article suggests several steps:\n\n*   **Awareness:** Understand what data your car collects. Privacy4Cars offers a free service using the VIN to summarize an automaker's data privacy practices.\n*   **Tweak Settings:** Review and adjust privacy settings within the car's menus and apps to revoke consent for certain data collection practices. Automakers like Toyota, Ford, and BMW offer options to opt out of data sharing.\n*   **Opt-Out Requests:** Utilize state privacy laws to request carmakers limit the use, sharing, or deletion of your personal data. Privacy4Cars can assist in filing these requests.\n\nIt's important to note that opting out of data collection may limit certain car features like roadside assistance or remote locking. When selling a car, a factory reset should be performed to wipe all data and smartphone connections, and the manufacturer should be notified of the ownership change to avoid your driving profile being associated with the new owner.\n",
    "chinese_title": "现代汽车正在监视你。你可以这样做。",
    "chinese_summary": "汽车数据收集引发的隐私担忧日益增长。汽车的互联功能提供了创新特性，同时也收集了大量的驾驶习惯和个人信息数据。\n\n收集的数据包括与汽车的交互（方向盘、车门锁）、来自互联服务的信息（GPS、卫星广播）以及来自传感器和摄像头的数据。这些数据通常会与保险公司、营销公司和数据经纪人共享，有时未经明确同意，通用汽车公司案例即是例证，该案例中驾驶员数据被用于设定保险费率。\n\n为降低这些隐私风险，本文提出了以下几个步骤：\n\n*   **提高意识：**了解您的汽车收集哪些数据。Privacy4Cars提供一项免费服务，通过车辆识别码（VIN）来汇总汽车制造商的数据隐私实践。\n*   **调整设置：**查看并调整汽车菜单和应用程序中的隐私设置，以撤销对某些数据收集行为的同意。丰田、福特和宝马等汽车制造商提供了选择退出数据共享的选项。\n*   **退出申请：**利用州隐私法，要求汽车制造商限制您个人数据的使用、共享或删除。Privacy4Cars可以协助提交这些申请。\n\n需要注意的是，选择退出数据收集可能会限制某些汽车功能，如道路救援或远程锁定。出售汽车时，应执行恢复出厂设置，以清除所有数据和智能手机连接，并应通知制造商所有权变更，以避免您的驾驶档案与新车主关联。"
  },
  {
    "id": "46090269",
    "title": "Learning Feynman's Trick for Integrals",
    "url": "https://zackyzz.github.io/feynman.html",
    "summary": "This article introduces Feynman's Trick (differentiation under the integral sign, also known as the Leibniz integral rule) as a powerful method for evaluating integrals, popularized by Richard Feynman. It emphasizes that while the technique isn't widely taught in universities, it can be a game-changer when standard integration methods fail.\n\nThe core idea is to introduce a parameter into the integral, differentiate with respect to that parameter to obtain a simpler integral, solve the simpler integral, and then integrate back to eliminate the parameter and find the value of the original integral.\n\nThe article stresses the importance of strategic parameterization. The key is to choose a parameter placement that, after differentiation, simplifies the integrand, ideally eliminating or simplifying parts not related to the parameter (like logarithms or complex denominators). Simply placing a parameter randomly can lead to more complex integrals.\n\nThe article illustrates the technique with examples, including the \"Hello, World!\" integral and integrals involving logarithms and trigonometric functions. It provides specific parameterizations for each example and encourages readers to practice the trick to develop intuition and skill. It concludes with additional integrals and suggested parameterizations as practice exercises.\n",
    "chinese_title": "学习费曼积分技巧",
    "chinese_summary": "本文介绍了费曼技巧（积分符号下求导法，也称为莱布尼茨积分法则），这是一种由理查德·费曼推广的强大积分计算方法。文章强调，尽管该技巧在大学中并未广泛教授，但当标准积分方法失效时，它可能会带来突破。\n\n其核心思想是在积分中引入一个参数，对该参数进行微分以获得一个更简单的积分，求解该更简单的积分，然后积分回去以消除参数并找到原始积分的值。\n\n文章强调了战略参数化的重要性。关键是选择一个参数位置，使其在微分后简化被积函数，理想情况下消除或简化与参数无关的部分（如对数或复数分母）。简单地随机放置参数可能会导致更复杂的积分。\n\n文章通过示例来说明该技巧，包括“Hello, World!”积分以及涉及对数和三角函数的积分。它为每个示例提供了具体的参数化，并鼓励读者练习该技巧以培养直觉和技能。最后，文章提供了一些额外的积分和建议的参数化作为练习。"
  },
  {
    "id": "46096552",
    "title": "Apple Desktop Bus Protocol (2021)",
    "url": "https://www.lopaciuk.eu/2021/03/26/apple-adb-protocol.html",
    "summary": "This article details the Apple Desktop Bus (ADB) protocol, focusing on how to interface a vintage ADB keyboard (like the Apple Extended Keyboard II) with modern USB hardware. The author aims to provide a comprehensive yet concise guide to the ADB protocol, drawing heavily on Apple's official documentation.\n\nADB is a serial bus used for connecting input devices like keyboards and mice to older Macintosh computers. It operates at a relatively slow speed (around 10 kb/s) and uses a single host to poll devices. Key features include device addressing (allowing multiple devices on the bus), device registers (for storing data and configuration), and four basic commands: SendReset, Flush, Listen, and Talk.\n\nThe bus is initialized with a reset signal, followed by device address assignment to prevent collisions. Communication involves the host sending a command packet containing device address, command code, and register selection. Devices respond with data from the requested register, or in the case of \"Listen,\" receive data from the host. Devices can request service (Srq) by pulling the bus low, signaling a need for attention.\n\nThe article describes the structure of registers, specifically register 0 (containing input data), and register 3 (containing device settings). It also details the structures for keyboard and mouse protocols, including key codes and mouse offset data. Finally, the article presents a table of timing parameters for the ADB protocol, copied directly from Apple's documentation. The goal is to help hobbyists create their own ADB to USB adapters.\n",
    "chinese_title": "苹果桌面总线协议 (2021)",
    "chinese_summary": "本文详细介绍了苹果桌面总线 (ADB) 协议，重点讲解如何将老式 ADB 键盘（如 Apple Extended Keyboard II）与现代 USB 硬件连接。作者旨在提供一份全面而简洁的 ADB 协议指南，主要参考苹果官方文档。\n\nADB 是一种串行总线，用于将键盘和鼠标等输入设备连接到较旧的 Macintosh 计算机。 它以相对较慢的速度（约 10 kb/s）运行，并使用单个主机来轮询设备。 主要功能包括设备寻址（允许总线上有多个设备）、设备寄存器（用于存储数据和配置）以及四个基本命令：SendReset、Flush、Listen 和 Talk。\n\n总线通过复位信号初始化，然后进行设备地址分配以防止冲突。 通信包括主机发送包含设备地址、命令代码和寄存器选择的命令包。 设备回复请求的寄存器中的数据，或者在“Listen”的情况下，接收来自主机的数据。 设备可以通过将总线拉低来请求服务 (Srq)，从而发出需要注意的信号。\n\n本文描述了寄存器的结构，特别是寄存器 0（包含输入数据）和寄存器 3（包含设备设置）。 它还详细介绍了键盘和鼠标协议的结构，包括键码和鼠标偏移数据。 最后，本文提供了一个 ADB 协议时序参数表，直接从 Apple 的文档中复制。 目标是帮助爱好者创建他们自己的 ADB 到 USB 适配器。"
  },
  {
    "id": "46091591",
    "title": "Americans no longer see four-year college degrees as worth the cost",
    "url": "https://www.nbcnews.com/politics/politics-news/poll-dramatic-shift-americans-no-longer-see-four-year-college-degrees-rcna243672",
    "summary": "A recent NBC News poll reveals a significant shift in American sentiment towards the value of a four-year college degree, with nearly two-thirds of registered voters now believing it's \"not worth the cost.\" This marks a dramatic decline from 2013, when a majority felt the degree was worthwhile. The rising cost of tuition, coupled with concerns about graduates lacking specific job skills and burdened by debt, are primary drivers of this change.\n\nWhile data shows those with advanced degrees still earn more and have lower unemployment, the escalating price of college, with public tuition doubling since 1995 (adjusted for inflation), has eroded the perceived return on investment. Poll respondents highlighted this debt burden, citing instances of graduates reverting to lower-paying jobs after failing to secure well-paying jobs that offset their loan amounts.\n\nThe shift is notable across all demographics, but particularly pronounced among Republicans. Interestingly, even less than half of voters with college degrees believe their degrees were worth the cost. This skepticism is fueling interest in trade schools and vocational programs that offer quicker entry into the workforce. Experts suggest the proliferation of stories about individuals with degrees struggling to find relevant, well-paying jobs has damaged the long-held belief in the automatic payoff of a bachelor's degree. The article also notes a decline in public confidence in higher education institutions.\n",
    "chinese_title": "美国人不再认为四年制大学学位物有所值。",
    "chinese_summary": "近期NBC新闻民调显示，美国民众对四年制大学学位价值的看法发生重大转变，近三分之二的注册选民现在认为其“不值得花费”。 与2013年多数人认为学位有价值相比，这是一个显著的下降。 学费上涨，加上对毕业生缺乏特定工作技能和背负债务的担忧，是导致这种变化的主要因素。\n\n虽然数据显示，拥有高等学历的人仍然收入更高，失业率更低，但大学学费不断上涨（自1995年以来公共学费翻了一番，经通货膨胀调整后），已经削弱了人们对投资回报的认知。 民调受访者强调了这种债务负担，并列举了毕业生因未能找到能抵消贷款金额的高薪工作而不得不从事低薪工作的例子。\n\n这种转变在所有人群中都很明显，但在共和党人中尤其突出。 值得注意的是，即使是拥有大学学位的选民中，也只有不到一半的人认为他们的学位物有所值。 这种怀疑正在推动人们对贸易学校和职业课程的兴趣，这些课程能让人更快地进入劳动力市场。 专家认为，关于拥有学位的人难以找到相关、高薪工作的故事的泛滥，已经破坏了人们长期以来对学士学位能自动获得回报的信念。 文章还指出，公众对高等教育机构的信心正在下降。"
  },
  {
    "id": "46092478",
    "title": "A new Little Prince museum has opened its doors in Switzerland",
    "url": "https://www.lepetitprince.com/en/events-around-the-world/a-new-little-prince-museum-has-opened-its-doors-in-switzerland/",
    "summary": "This blurb highlights two separate events relating to \"The Little Prince\" (El Petit Prince).\n\nFirstly, a new Little Prince museum has opened in Switzerland.\n\nSecondly, the musical adaptation of \"The Little Prince,\" titled \"El Petit Prince,\" is returning to Barcelona for its twelfth season. The return engagement starts December 5, 2025. The musical has had a successful run, with over 600 performances and an audience of 400,000 spectators, demonstrating its enduring popularity.\n",
    "chinese_title": "瑞士新开放了一家小王子博物馆",
    "chinese_summary": "此简介着重介绍两件与《小王子》(El Petit Prince)相关的独立事件。\n\n首先，一家新的小王子博物馆已在瑞士开幕。\n\n其次，《小王子》的音乐剧改编版，名为《El Petit Prince》，将于2025年12月5日回归巴塞罗那，迎来第十二季。这部音乐剧取得了巨大成功，已演出超过600场，观众人数达40万，展现了其持久的受欢迎程度。"
  },
  {
    "id": "46086771",
    "title": "Leak confirms OpenAI is preparing ads on ChatGPT for public roll out",
    "url": "https://www.bleepingcomputer.com/news/artificial-intelligence/leak-confirms-openai-is-preparing-ads-on-chatgpt-for-public-roll-out/",
    "summary": "A leaked beta version of the ChatGPT Android app suggests OpenAI is preparing to introduce ads into the ChatGPT experience, potentially disrupting the web economy. The leak, discovered on X, reveals code references to an \"ads feature\" including \"bazaar content\", \"search ad\" and \"search ads carousel\". This move mimics Google's ad-supported search model, with the potential to leverage ChatGPT's vast user data to create highly personalized and effective ads.\n\nThe article highlights ChatGPT's significant user base, estimated at 800 million weekly users, generating 2.5 billion prompts daily, with India being the largest user base. This massive reach provides OpenAI with the necessary infrastructure for ads to succeed.\n\nInitially, ads are expected to be limited to the search experience within ChatGPT, but future expansion is possible. The article implies that ChatGPT's deeper understanding of users compared to traditional search engines could lead to more targeted and effective advertising.\n\nFinally, the article highlights a \"Secrets Security Cheat Sheet\" for download, and lists several related articles on future OpenAI plans, including the release of GPT-5.1 and considerations for memory-based ads.\n",
    "chinese_title": "泄露信息证实 OpenAI 准备在 ChatGPT 上推出广告",
    "chinese_summary": "泄露的ChatGPT安卓应用测试版暗示OpenAI正准备在ChatGPT体验中引入广告，可能颠覆网络经济。X上发现的泄露信息显示，代码中提到了“广告功能”，包括“市场内容”、“搜索广告”和“搜索广告轮播”。此举模仿了谷歌的广告支持搜索模式，有可能利用ChatGPT庞大的用户数据来创建高度个性化和有效的广告。\n\n文章强调了ChatGPT庞大的用户群，估计每周有8亿用户，每天产生25亿条提示，其中印度是最大的用户群。这种庞大的覆盖范围为OpenAI提供了广告成功的必要基础。\n\n最初，广告预计将仅限于ChatGPT内的搜索体验，但未来可能会扩展。文章暗示，与传统搜索引擎相比，ChatGPT对用户的更深入理解可能会带来更有针对性和更有效的广告。\n\n最后，文章突出显示了一个可供下载的“秘密安全速查表”，并列出了几篇关于OpenAI未来计划的相关文章，包括GPT-5.1的发布和基于记忆的广告的考虑。"
  },
  {
    "id": "46096921",
    "title": "Geothermal Breakthrough in South Texas Signals New Era for Ercot",
    "url": "https://www.powermag.com/geothermal-breakthrough-in-south-texas-signals-new-era-for-ercot/",
    "summary": "This article details a geothermal energy storage breakthrough in South Texas, spearheaded by Sage Geosystems and San Miguel Electric Cooperative (SMECI). In just 12 months, they constructed the world’s first pressure geothermal system, SMECI Well #1, a 3-MW/4–6-hour pilot project designed to provide long-duration, dispatchable storage for ERCOT.\n\nSMECI, traditionally reliant on a lignite power plant, is transitioning to cleaner energy sources, aiming to replace the plant with solar and battery storage by 2027 with the help of a USDA grant. The geothermal pilot project leverages innovative design, existing oilfield expertise, and streamlined permitting.\n\nSage Geosystems' Pressure Geothermal System (GGS) functions like an \"upside down\" pumped-storage hydropower, using a deep engineered fracture as a subsurface reservoir. Water is pumped into the fracture to \"charge\" the system and released to drive a turbine and generator. The system boasts a 70-75% round-trip efficiency, minimizes water loss, and is entirely digitally automated for seamless integration with ERCOT.\n\nSage is also working on a commercial power generation facility with Meta, aiming to deliver up to 150 MW of new geothermal baseload power for Meta's U.S. data centers. The company sees energy storage, power generation, and district heating as key applications for its technology. The favorable policy and permitting environment in Texas, combined with the experience of the Sage Geosystems team, coming largely from the oil and gas industry, have contributed to the project's rapid implementation.\n",
    "chinese_title": "南德州地热突破预示Ercot新纪元",
    "chinese_summary": "本文详细介绍了Sage Geosystems和San Miguel电力合作社(SMECI)在南德克萨斯州主导的地热能储存突破。他们仅用12个月就建成了世界首个压力地热系统，SMECI Well #1，这是一个3兆瓦/4-6小时的试点项目，旨在为ERCOT提供长时、可调度的储能。\n\nSMECI传统上依赖于褐煤发电厂，目前正在向更清洁的能源转型，目标是在美国农业部拨款的帮助下，到2027年用太阳能和电池储能取代该发电厂。该地热试点项目利用了创新设计、现有油田专业知识和简化的许可流程。\n\nSage Geosystems的压力地热系统(GGS)的工作原理类似于“倒置”抽水蓄能水电站，使用深层人工裂缝作为地下水库。水被泵入裂缝以“充电”系统，并释放以驱动涡轮机和发电机。该系统拥有70-75%的往返效率，最大限度地减少了水的损失，并且完全通过数字化自动化，可与ERCOT无缝集成。\n\nSage还在与Meta合作建设一个商业发电设施，旨在为Meta的美国数据中心提供高达150兆瓦的新型地热基本负荷电力。该公司认为储能、发电和区域供热是其技术的关键应用。德克萨斯州有利的政策和许可环境，以及主要来自石油和天然气行业的Sage Geosystems团队的经验，都有助于该项目的快速实施。"
  },
  {
    "id": "46071221",
    "title": "Blender facial animation tool. What else should it do?",
    "url": "https://github.com/shun126/livelinkface_arkit_receiver/wiki",
    "summary": "This document describes the \"LiveLinkFace ARKit Receiver,\" a Blender add-on that allows users to animate 3D models in Blender using facial expressions captured by the Live Link Face app on an iPhone. The add-on receives facial tracking data via ARKit and applies it to the shape keys of a selected 3D model in real-time.\n\n**Key features include:**\n\n*   Compatibility with the iPhone Live Link Face app (ARKit mode).\n*   Real-time preview of shape key values in Blender.\n*   Ideal for testing Perfect Sync compatible models.\n*   Developed and tested with Blender 4.5.\n*   Support for Apple ARKit's standard 52 shape key names.\n\n**How it works:**\n\n1.  The user enters their computer's local IP address and port number in the Live Link Face app settings on their iPhone.\n2.  In Blender, the user selects the model with corresponding shape keys and starts the LiveLinkFace receiver.\n3.  The add-on automatically detects shape key names and reflects facial expressions from the iPhone onto the Blender model in real-time.\n\nThe document also provides troubleshooting tips for common issues like models not moving, stuttering values, and unresponsive keys, usually related to network connectivity or shape key naming discrepancies. The add-on is intended for artists creating facial rigs, testing facial animation, and developing Perfect Sync models. It is released under the GPL-3.0 license, allowing for modification and redistribution under the same terms.\n",
    "chinese_title": "Blender面部动画工具，还应该做什么？",
    "chinese_summary": "本文档介绍了“LiveLinkFace ARKit接收器”，这是一个Blender插件，允许用户使用iPhone上的Live Link Face应用捕捉的面部表情来动画Blender中的3D模型。该插件通过ARKit接收面部追踪数据，并将其实时应用于所选3D模型的形变键。\n\n**主要功能包括：**\n\n*   兼容iPhone Live Link Face应用（ARKit模式）。\n*   Blender中形变键值的实时预览。\n*   非常适合测试Perfect Sync兼容模型。\n*   使用Blender 4.5开发和测试。\n*   支持Apple ARKit的标准52个形变键名称。\n\n**工作原理：**\n\n1.  用户在其iPhone上的Live Link Face应用设置中输入其计算机的本地IP地址和端口号。\n2.  在Blender中，用户选择具有相应形变键的模型并启动LiveLinkFace接收器。\n3.  该插件自动检测形变键名称，并将iPhone上的面部表情实时反映到Blender模型上。\n\n本文档还提供了针对常见问题的故障排除技巧，例如模型不移动、数值卡顿以及键无响应，这些问题通常与网络连接或形变键命名不一致有关。该插件适用于创建面部绑定、测试面部动画以及开发Perfect Sync模型的艺术家。它在GPL-3.0许可下发布，允许在相同条款下进行修改和再分发。"
  },
  {
    "id": "46054879",
    "title": "Anthony Bourdain's Lost Li.st's",
    "url": "https://bourdain.greg.technology/",
    "summary": "This is a partial archive of Anthony Bourdain's lists published on the now-defunct website Li.st. The lists cover diverse topics reflecting Bourdain's interests and personality.\n\nThe archive includes lists like \"80's Playlist,\" featuring Bourdain's favorite songs from the decade, and \"Crimes Against Food,\" a humorous rant about culinary offenses such as brioche hamburger buns and truffle oil. \"Food I'm Thinking About\" details dishes from his travels he wanted to bring to a New York City market.\n\nSeveral lists focus on films, including \"Food on Film,\" highlighting movies that accurately depict cooking and the culinary world (\"Eat Drink Man Woman,\" \"Ratatouille\") and \"Some Films From the Criterion Collection,\" where he shares his favorite films in the collection and praises directors like Pasolini, Huston, and Welles.\n\nOther lists offer insights into Bourdain's fears (\"Scary Shit!!!\"), potential band names, and \"Perfect Albums.\" He includes a list called \"Six True Things About Dinner with Obama\" documenting his meal in Vietnam with President Obama. Finally, Bourdain lists \"Underrated, Douche-free Destinations\" recommending Uruguay, Marseille, Laos, Sardinia and Beirut as travel destinations.\n",
    "chinese_title": "安东尼·布尔丹的遗失清单",
    "chinese_summary": "这是安东尼·波登已关闭的网站Li.st上发布的部分列表的存档。这些列表涵盖了反映波登兴趣和个性的各种主题。\n\n该存档包括“80年代歌单”等列表，收录了波登最喜欢的80年代歌曲；以及“食物的罪行”，幽默地抨击了布里欧面包汉堡和松露油等烹饪上的冒犯行为。“我想象中的食物”详细介绍了他在旅行中想要带到纽约市场的一些菜肴。\n\n一些列表侧重于电影，包括“电影中的美食”，重点介绍了准确描绘烹饪和美食世界的电影（如《饮食男女》、《料理鼠王》），以及“Criterion Collection电影选”，他在其中分享了他最喜欢的Criterion Collection电影，并赞扬了帕索里尼、休斯顿和威尔斯等导演。\n\n其他列表则提供了对波登恐惧（“恐怖的事情!!!”）、潜在乐队名称和“完美专辑”的见解。他还包括一份名为“与奥巴马共进晚餐的六个真相”的清单，记录了他与奥巴马总统在越南共进晚餐的情景。最后，波登列出了“被低估的、不装腔作势的目的地”，推荐乌拉圭、马赛、老挝、撒丁岛和贝鲁特作为旅游目的地。"
  },
  {
    "id": "46088379",
    "title": "Testing shows automotive glassbreakers can't break modern automotive glass",
    "url": "https://www.core77.com/posts/138925/Testing-Shows-Automotive-Glassbreakers-Cant-Break-Modern-Automotive-Glass",
    "summary": "This Core77 article challenges the usefulness of automotive glassbreakers, a popular EDC (Everyday Carry) item marketed for emergency car escapes. The author points out that while the \"car escape tool market\" is booming due to safety concerns, the actual scenarios where these tools are life-saving are statistically rare.\n\nThe main issue is that modern cars increasingly use laminated glass for side windows, mandated by the \"Ejection Mitigation Rule\" to prevent occupants from being ejected during accidents. Unlike the tempered glass that glassbreakers are designed for, laminated glass is significantly harder to break. An AAA study confirmed that commonly available glassbreakers are ineffective against laminated glass, with some even breaking themselves during testing.\n\nWhile not all car manufacturers use laminated glass, a substantial list including Acura, Audi, BMW, Cadillac, Chevrolet, and others have adopted it, some for decades. This renders glassbreakers largely obsolete for a significant portion of modern vehicles. The article does concede that seatbelt cutters are valuable tools for first responders dealing with unconscious victims, and might be useful for freeing unconscious individuals if one has proper training. However, for the average driver, the perceived need for a glassbreaker is likely overblown.\n",
    "chinese_title": "测试显示，汽车玻璃击破器无法击碎现代汽车玻璃。",
    "chinese_summary": "这篇Core77文章质疑了汽车玻璃击破器的实用性，这种流行的EDC（每日携带）物品被宣传用于紧急车辆逃生。作者指出，虽然“车辆逃生工具市场”因安全问题而蓬勃发展，但这些工具真正能救命的情况在统计上很少见。\n\n主要问题是，现代汽车越来越多地使用夹层玻璃作为侧窗，这是为了防止乘客在事故中被甩出的“弹射缓解规则”所要求的。与玻璃击破器设计的钢化玻璃不同，夹层玻璃明显更难破碎。一项AAA研究证实，市面上常见的玻璃击破器对夹层玻璃无效，有些甚至在测试中自身损坏。\n\n虽然并非所有汽车制造商都使用夹层玻璃，但包括讴歌、奥迪、宝马、凯迪拉克、雪佛兰等在内的许多厂商已经采用，有些甚至已经几十年了。这使得玻璃击破器在很大程度上对相当一部分现代车辆来说已经过时。文章确实承认，安全带切割器对于处理无意识受害者的急救人员来说是有价值的工具，如果经过适当的培训，可能有助于解救无意识的人。然而，对于普通驾驶员来说，对玻璃击破器的感知需求可能被夸大了。"
  },
  {
    "id": "46016104",
    "title": "Advice for crime analyst to break into data science",
    "url": "https://andrewpwheeler.com/2025/11/21/advice-for-crime-analyst-to-break-into-data-science/",
    "summary": "This blog post offers advice to crime analysts looking to transition into data science roles. The author highlights that while skills like SQL and Excel are valuable, demonstrating competency in a programming language, particularly Python, is crucial for entry-level data science positions.\n\nThe author suggests focusing on machine learning or Large Language Models (LLMs), emphasizing the current marketability of skills like calling LLM APIs, building RAG systems, and prompt engineering. While a master's degree is often preferred, a strong portfolio showcasing projects on a personal website or GitHub can compensate.\n\nThe author recommends applying for analyst roles, even if the job descriptions list programming skills the applicant lacks, as requirements can sometimes be unrealistic. They suggest exploring analyst positions at companies adjacent to crime analysis, such as Lexis Nexis, ESRI, or Axon, due to potential career ladder opportunities.\n\nThe post references previous resources the author has created, including an alt-ac newsletter (no longer active but archived online with helpful tips), a blog post on various tech jobs and their salaries, and a blog post on resume advice and creating a portfolio of work. These resources cover programming tips, job search strategies, and how to build a compelling portfolio. The author also suggests considering project management as an alternative career path, leveraging their existing experience.\n",
    "chinese_title": "犯罪分析师转型数据科学的建议",
    "chinese_summary": "本博客为希望转型为数据科学家的犯罪分析师提供建议。作者强调，虽然SQL和Excel等技能很有价值，但掌握编程语言（尤其是Python）对于入门级数据科学职位至关重要。\n\n作者建议专注于机器学习或大型语言模型（LLM），强调目前调用LLM API、构建RAG系统和提示工程等技能的市场价值。虽然通常更喜欢硕士学位，但强大的作品集（展示在个人网站或GitHub上的项目）可以弥补。\n\n作者建议申请分析师职位，即使职位描述列出了申请人缺乏的编程技能，因为要求有时可能不切实际。他们建议探索在犯罪分析相邻的公司（如Lexis Nexis、ESRI或Axon）的分析师职位，因为这些职位可能存在职业晋升机会。\n\n该帖子引用了作者之前创建的资源，包括一份另类学术通讯（已不再活跃，但已在线存档，包含有用的提示）、一篇关于各种科技工作及其薪水的博客文章，以及一篇关于简历建议和创建作品集的博客文章。这些资源涵盖编程技巧、求职策略以及如何构建引人注目的作品集。作者还建议考虑项目管理作为一种替代职业道路，以利用他们现有的经验。"
  },
  {
    "id": "46090619",
    "title": "Show HN: Nano PDF – A CLI Tool to Edit PDFs with Gemini's Nano Banana",
    "url": "https://github.com/gavrielc/Nano-PDF",
    "summary": "Nano PDF is a command-line tool that allows users to edit PDF slides using natural language prompts, leveraging Google's Gemini 3 Pro Image (\"Nano Banana\") model. It offers features such as natural language editing, adding new slides that match the existing style, and preserving the searchable text layer of the PDF through OCR re-hydration. The tool supports multi-page editing with parallel processing.\n\nKey functionalities include converting PDF pages to images, optionally using style reference pages, sending images and prompts to Gemini for editing, restoring the text layer using Tesseract OCR, and stitching the edited pages back into the PDF.\n\nTo use Nano PDF, you need a paid Google Gemini API key with billing enabled. Installation is done via `pip install nano-pdf`, and configuration involves setting the API key as an environment variable. The tool offers options to control context usage, specify style references, define the output filename, and adjust the image resolution. Examples provided cover fixing typos, updating branding, updating financial data, adding new slides, and using Google Search.\n\nSystem dependencies include Python 3.10+, poppler for PDF rendering, and tesseract for OCR. Troubleshooting tips address common issues like missing dependencies, API key errors, styling inconsistencies, and slow processing. You can also run the tool directly from the source code. The tool is released under the MIT license.\n",
    "chinese_title": "Show HN: Nano PDF – 使用 Gemini Nano Banana 编辑 PDF 的 CLI 工具",
    "chinese_summary": "Nano PDF 是一款命令行工具，允许用户使用自然语言提示编辑 PDF 幻灯片，它利用了谷歌的 Gemini 3 Pro Image (\"Nano Banana\") 模型。它提供诸如自然语言编辑、添加与现有风格匹配的新幻灯片以及通过 OCR 重新水合保留 PDF 的可搜索文本层等功能。该工具支持使用并行处理的多页编辑。\n\n主要功能包括将 PDF 页面转换为图像，可选使用样式参考页面，将图像和提示发送给 Gemini 进行编辑，使用 Tesseract OCR 恢复文本层，并将编辑后的页面重新拼接成 PDF。\n\n要使用 Nano PDF，您需要一个已启用计费的付费 Google Gemini API 密钥。安装通过 `pip install nano-pdf` 完成，配置包括将 API 密钥设置为环境变量。该工具提供控制上下文使用、指定样式参考、定义输出文件名和调整图像分辨率的选项。提供的示例涵盖了修复拼写错误、更新品牌、更新财务数据、添加新幻灯片和使用 Google 搜索。\n\n系统依赖项包括 Python 3.10+、用于 PDF 渲染的 poppler 和用于 OCR 的 tesseract。故障排除技巧解决了常见的如缺少依赖项、API 密钥错误、样式不一致和处理缓慢等问题。您也可以直接从源代码运行该工具。该工具在 MIT 许可下发布。"
  },
  {
    "id": "46047052",
    "title": "Matrix Core Programming on AMD CDNA Architecture",
    "url": "https://rocm.blogs.amd.com/software-tools-optimization/matrix-cores-cdna/README.html",
    "summary": "This article, \"Matrix Core Programming on AMD CDNA Architecture,\" provides a guide to using Matrix Cores in HIP kernels for accelerated matrix multiplication on AMD CDNA™3 and CDNA™4 architectures. It focuses on low-precision data types like FP16, FP8, FP6, and FP4 and the new exponent block scaling instructions introduced in CDNA™4.\n\nThe article highlights the performance advantages of using Matrix Cores, especially with mixed-precision arithmetic. Using lower-precision input matrices (FP16, FP8, etc.) with an FP32 output matrix significantly increases performance compared to FP32 alone. The CDNA™4 architecture further enhances performance and introduces new low-precision types like FP6 and FP4.\n\nThe article explains the binary representation of floating-point numbers, detailing how exponent and mantissa widths affect range and precision. It then dives into specific low-precision types (FP16, BF16, FP8 variants, FP6, FP4), discussing their encoding details and special values.\n\nThe article provides a table summarizing the available floating-point MFMA instructions for both CDNA™3 and CDNA™4, emphasizing the expanded instruction set and new data types supported by CDNA™4. It explains how to calculate theoretical peak performance based on cycle counts and matrix dimensions. It then guides on the usage of compiler intrinsics and details how data is distributed across threads within a wavefront when performing matrix multiplication using the MFMA instructions. The article includes code examples to illustrate the usage of specific MFMA instructions, including an example of calculating using __builtin_amdgcn_mfma_f32_32x32x2f32 with FP32 input/output and __builtin_amdgcn_mfma_f32_16x16x16f16 with FP16 input and FP32 output.\n",
    "chinese_title": "AMD CDNA架构上的矩阵核心编程",
    "chinese_summary": "AMD CDNA架构上的矩阵核心编程"
  },
  {
    "id": "46090172",
    "title": "Be Like Clippy",
    "url": "https://be-clippy.com/",
    "summary": "This article introduces the \"Be Like Clippy\" movement, a reaction to the perceived exploitation of user data by large technology companies. It argues that companies like Microsoft's Clippy assistant, despite its imperfections, were fundamentally different because they didn't engage in data harvesting, holding data hostage, or using it for AI training without explicit consent.\n\nThe movement aims to encourage developers, companies, and users to adopt a more open, transparent, and user-friendly approach to technology. It critiques the current landscape of forced service usage, data ransom, opt-out data collection policies, and the utilization of user data for AI model training.\n\nThe call to action involves users changing their profile picture to Clippy and making their voices heard to advocate for companies to emulate Clippy's approach – prioritizing user help and transparency over data extraction and manipulation. The article also includes a video link explaining the movement in more detail. In essence, \"Be Like Clippy\" is a plea for a return to a more ethical and user-centric technology model.\n",
    "chinese_title": "像 Clippy 一样",
    "chinese_summary": "本文介绍了“像Clippy一样”运动，该运动是对大型科技公司涉嫌利用用户数据行为的反击。文章认为，像微软的Clippy助手这样的公司，尽管存在缺陷，但从根本上说是不同的，因为它们不从事数据收割、扣留数据或在未经明确同意的情况下将其用于人工智能训练。\n\n该运动旨在鼓励开发者、公司和用户采取更开放、透明和用户友好的技术方法。它批判了当前强制服务使用、数据勒索、选择退出式数据收集政策以及利用用户数据进行人工智能模型训练的现状。\n\n行动号召包括用户将他们的个人资料图片更改为Clippy，并发出自己的声音，倡导公司效仿Clippy的做法——优先考虑用户帮助和透明度，而不是数据提取和操纵。文章还包含一个视频链接，更详细地解释了这场运动。本质上，“像Clippy一样”是呼吁回归更道德、以用户为中心的技术模式。"
  },
  {
    "id": "46042947",
    "title": "Our Phosphorescent World",
    "url": "https://aeon.co/essays/the-cycling-of-phosphorus-is-the-basis-for-all-life-on-earth",
    "summary": "Jack Lohmann's \"Our Phosphorescent World\" explores the crucial role of phosphorus in life on Earth and how human activities have disrupted its natural cycle. Phosphorus, essential for all living beings, cycles slowly through rocks, rivers, and oceans, limiting the quantity of biomass.\n\nHistorically, civilizations thrived where phosphorus was abundant, like along riverbeds and coastlines. The discovery of phosphorus as an element and the advent of phosphate mining in the 19th century marked a turning point. To increase crop yields, humans began mining phosphate rock, breaking the natural phosphorus cycle. This led to the abandonment of traditional, cyclical practices like using animal manures and composting.\n\nThe consequences of this shift include the eutrophication of waters, creating \"dead zones,\" and reliance on industrial agriculture dependent on mined fertilizers. This system damages soils, kills microorganisms vital for nutrient uptake, and promotes the growth of crops used for industrial purposes, like corn syrup and fuel, rather than nutritious foods.\n\nThe author contrasts this with the sustainable gardening practices of her grandmother, who used compost, bone powder, and other natural materials to nourish her soil. The article highlights the need to reconsider our relationship with phosphorus and adopt more sustainable practices that respect the Earth's natural cycles. By breaking the phosphorus cycle, we have turned a life-giving element into a pollutant.\n",
    "chinese_title": "我们的磷光世界",
    "chinese_summary": "杰克·洛曼的《我们的磷光世界》探讨了磷在地球生命中的关键作用以及人类活动如何扰乱其自然循环。磷是所有生物必需的元素，它在岩石、河流和海洋中缓慢循环，限制了生物量的数量。\n\n历史上，文明在磷丰富的地区繁荣发展，例如河床和海岸线沿岸。磷作为一种元素的发现以及19世纪磷酸盐采矿的出现标志着一个转折点。为了提高作物产量，人类开始开采磷矿石，打破了自然的磷循环。这导致了对传统循环做法的放弃，例如使用动物粪便和堆肥。\n\n这种转变的后果包括水体富营养化，造成“死亡地带”，以及对依赖矿物肥料的工业农业的依赖。该系统破坏土壤，杀死对养分吸收至关重要的微生物，并促进用于工业目的的作物生长，例如玉米糖浆和燃料，而不是有营养的食物。\n\n作者将此与她祖母的可持续园艺实践进行了对比，她祖母使用堆肥、骨粉和其他天然材料来滋养她的土壤。文章强调需要重新思考我们与磷的关系，并采取更可持续的实践，尊重地球的自然循环。通过打破磷循环，我们将一种赋予生命的元素变成了污染物。"
  },
  {
    "id": "46060432",
    "title": "Rare X-ray images of a 4.5-ton satellite that returned intact from space",
    "url": "https://www.empa.ch/web/s604/eureca-satellit-mit-roentgenmethoden-untersucht",
    "summary": "This news article from Empa details the rare opportunity to examine the European Retrievable Carrier (EURECA) satellite using non-destructive X-ray methods. EURECA, launched in 1992 and retrieved in 1993, is one of the few satellites to return intact from space.\n\nEmpa researchers, in collaboration with the Swiss Space Center and the Swiss Museum of Transport, used high-energy X-ray imaging to analyze the five-meter satellite, including its fuel tanks, modular structure, and two scientific instruments. The X-ray analysis, published in Acta Astronautica in 2025, revealed defects such as cracks in the composite struts and deformations in the instruments, likely caused by radiation, temperature fluctuations, or collisions in space.\n\nThe study highlights the potential of X-ray techniques for identifying weak points in reusable satellites, which are becoming increasingly important due to the growing number of satellites and space debris. Ideally, satellites should be X-rayed both before and after launch.\n\nBeyond space applications, the article emphasizes the terrestrial benefits of high-energy X-ray imaging for examining components in the aviation and automotive industries, as well as in forensics.\n",
    "chinese_title": "罕见的4.5吨完整返回卫星的X光图像",
    "chinese_summary": "恩帕新闻：罕见机遇，利用无损X射线方法检查欧洲可回收载体卫星（EURECA）。该卫星于1992年发射，1993年回收，是少数完好返回太空的卫星之一。\n\n恩帕研究人员与瑞士太空中心和瑞士交通博物馆合作，利用高能X射线成像技术分析了这颗五米长的卫星，包括其燃料箱、模块化结构和两台科学仪器。这项发表在2025年《宇航学报》上的X射线分析显示，卫星存在缺陷，例如复合材料支柱上的裂缝和仪器中的变形，这可能是由太空中的辐射、温度波动或碰撞造成的。\n\n该研究突出了X射线技术在识别可重复使用卫星薄弱环节方面的潜力，由于卫星和太空碎片数量的不断增长，可重复使用卫星变得越来越重要。理想情况下，卫星在发射前后都应该进行X射线检查。\n\n除了太空应用之外，该文章还强调了高能X射线成像技术在地面上的益处，例如可用于检查航空和汽车行业的部件以及法医学领域。"
  },
  {
    "id": "46055942",
    "title": "Dynamic Skillset Reference Architecture",
    "url": "https://chatbotkit.com/examples/dynamic-skillset-reference-architecture",
    "summary": "This document outlines a reference architecture for creating dynamic AI agents capable of intelligently selecting and utilizing skillsets based on user intent. This architecture contrasts with static configurations by allowing the agent to dynamically discover and load appropriate capabilities at runtime, making it highly extensible.\n\nKey features include the ability to introspect the environment, enumerate available skillsets, and intelligently decide which ones to load based on user requests. This allows for adding new skillsets without altering the agent's core configuration. The agent is designed to handle numerous capabilities while maintaining optimal performance by only loading relevant skillsets on demand.\n\nThe agent prioritizes user needs by following a structured protocol: analyzing the task, mapping requirements to skillsets, prioritizing based on effectiveness, dynamically allocating resources, planning execution, and ensuring quality. It can seamlessly integrate multiple skillsets and informs users when switching or combining them.\n\nThe document also details content creation standards using markdown formatting, citation and attribution requirements, and quality standards. Furthermore, it specifies search and research protocols with strategies for information gathering and source validation.\n\nBehavioral guidelines cover user interaction (including initial responses, conversation management, and personalization) and safety and compliance, emphasizing content restrictions, ethical guidelines, and privacy protection. Examples and edge cases are provided to illustrate the agent's behavior in different scenarios. Finally, a quality checklist is included to verify the agent's responses meet established standards.\n",
    "chinese_title": "动态技能组合参考架构",
    "chinese_summary": "本文档概述了一种参考架构，用于创建能够根据用户意图智能选择和利用技能组合的动态AI代理。这种架构与静态配置形成对比，它允许代理在运行时动态发现和加载适当的功能，从而使其具有高度的可扩展性。\n\n关键特性包括能够内省环境，枚举可用技能组合，并根据用户请求智能地决定加载哪些技能组合。这允许在不改变代理核心配置的情况下添加新的技能组合。该代理旨在处理大量功能，并通过仅按需加载相关技能组合来保持最佳性能。\n\n该代理通过遵循结构化协议来优先考虑用户需求：分析任务，将需求映射到技能组合，根据有效性进行优先级排序，动态分配资源，规划执行，并确保质量。它可以无缝集成多个技能组合，并在切换或组合它们时通知用户。\n\n本文档还详细说明了使用markdown格式的内容创建标准、引用和归属要求以及质量标准。此外，它还指定了搜索和研究协议，包括信息收集和来源验证的策略。\n\n行为准则涵盖用户交互（包括初始响应、对话管理和个性化）以及安全和合规性，强调内容限制、伦理准则和隐私保护。提供了示例和边缘案例，以说明代理在不同场景中的行为。最后，包含一个质量检查表，以验证代理的响应是否符合既定标准。"
  },
  {
    "id": "46087022",
    "title": "The CRDT Dictionary: A Field Guide to Conflict-Free Replicated Data Types",
    "url": "https://www.iankduncan.com/engineering/2025-11-27-crdt-dictionary/",
    "summary": "This article serves as a field guide to Conflict-free Replicated Data Types (CRDTs), explaining their purpose and providing practical examples. CRDTs are data structures that allow replicas across different nodes to merge deterministically without coordination or data loss, even in the face of network partitions and concurrent writes. The author, revisiting the topic after a period of disuse, aims to demystify CRDTs and help readers choose the right one for their needs.\n\nThe article explains the fundamental principles behind CRDTs, emphasizing the importance of commutative, associative, and idempotent merge operations. It introduces the concept of lattices to illustrate how certain data structures, like counters, can consistently converge to the same state through join operations.\n\nThe guide distinguishes between State-based (CvRDTs) and Operation-based (CmRDTs) CRDTs, focusing primarily on the former for simplicity. It lays out the core laws (associativity, commutativity, idempotence) that ensure CRDTs' convergence properties.\n\nThe article then delves into specific CRDTs, including:\n\n*   **G-Counter:** Grow-only counter, suitable for increment-only scenarios.\n*   **PN-Counter:** Positive-Negative counter, supporting both increment and decrement.\n*   **G-Set:** Grow-only set, for append-only collections.\n*   **2P-Set:** Two-Phase set, supporting add and remove but not re-add.\n*   **LWW-Element-Set:** Last-Write-Wins Element set, using timestamps to resolve conflicts for adding and removing elements.\n\nFor each CRDT, the article provides a definition, operational details, laws, intuition, tradeoffs, and use cases. Interactive demos are included to illustrate how the merge operations work.\n",
    "chinese_title": "CRDT字典：无冲突复制数据类型实战指南",
    "chinese_summary": "本文作为冲突自由复制数据类型 (CRDT) 的实地指南，解释其用途并提供实际示例。CRDT 是一种数据结构，允许不同节点上的副本确定性地合并，而无需协调或数据丢失，即使在面对网络分区和并发写入时也是如此。作者在一段时间不使用后重新审视该主题，旨在揭开 CRDT 的神秘面纱，并帮助读者选择适合其需求的数据类型。\n\n本文解释了 CRDT 背后的基本原理，强调了可交换、可结合和幂等的合并操作的重要性。它引入了格的概念，以说明某些数据结构（如计数器）如何通过连接操作始终如一地收敛到相同的状态。\n\n该指南区分了基于状态的 (CvRDT) 和基于操作的 (CmRDT) CRDT，为简单起见，主要关注前者。它阐述了确保 CRDT 收敛性的核心法则（结合律、交换律、幂等律）。\n\n然后，本文深入研究了具体的 CRDT，包括：\n\n*   **G-Counter:** 只增计数器，适用于仅递增的场景。\n*   **PN-Counter:** 正负计数器，支持递增和递减。\n*   **G-Set:** 只增集合，用于仅追加的集合。\n*   **2P-Set:** 两阶段集合，支持添加和删除，但不允许重新添加。\n*   **LWW-Element-Set:** 最后写入获胜元素集合，使用时间戳来解决添加和删除元素的冲突。\n\n对于每个 CRDT，本文都提供了定义、操作细节、法则、直觉、权衡和用例。 还包括交互式演示，以说明合并操作的工作原理。"
  },
  {
    "id": "46078684",
    "title": "An update on the Farphone's battery",
    "url": "https://far.computer/battery-update/",
    "summary": "This article is an update on the author's project of using an old Fairphone smartphone as a web server. After sharing the project's setup, commenters on Lobste.rs and Hacker News raised concerns about the fire risk associated with continuously charging the phone's lithium battery. French blogger Korben also highlighted this issue.\n\nThe author, Louis Merlin, acknowledges the validity of these concerns. Given the Fairphone 2's modular design, he easily addressed the problem by removing the battery entirely. He then duct-taped the micro-USB charging cable directly to the phone's internals to ensure a stable power connection and prevent accidental shutdowns.\n\nWithin forty seconds of this modification, the phone had rebooted, and the web server was back online. The author expresses gratitude to the Lobste.rs and Hacker News communities for pointing out the potential hazard, suggesting they may have prevented a potential \"server explosion\" due to battery failure. The article concludes with the project's copyright and licensing information.\n",
    "chinese_title": "远方手机电池更新",
    "chinese_summary": "本文是对作者将旧 Fairphone 智能手机用作网络服务器的项目的更新。在分享了该项目的设置后，Lobste.rs 和 Hacker News 上的评论者提出了对持续充电手机锂电池相关的火灾风险的担忧。 法国博主 Korben 也强调了这个问题。\n\n作者 Louis Merlin 承认这些担忧的合理性。 鉴于 Fairphone 2 的模块化设计，他通过完全移除电池轻松解决了这个问题。 然后，他用胶带将 micro-USB 充电线直接连接到手机内部，以确保稳定的电源连接并防止意外关机。\n\n在进行此修改后的 40 秒内，手机已重新启动，并且网络服务器已恢复在线。 作者对 Lobste.rs 和 Hacker News 社区表示感谢，感谢他们指出了潜在的危险，并暗示他们可能避免了因电池故障导致的潜在“服务器爆炸”。 文章最后给出了该项目的版权和许可信息。"
  },
  {
    "id": "46006323",
    "title": "Bronze Age mega-settlement in Kazakhstan has advanced urban planning, metallurgy",
    "url": "https://archaeologymag.com/2025/11/bronze-age-mega-settlement-in-kazakhstan/",
    "summary": "While the provided title discusses a Bronze Age mega-settlement in Kazakhstan with advanced urban planning and metallurgy, the content snippet talks about a major Bronze Age workshop space discovered at Kissonerga-Skalia in Cyprus. These are two completely separate discoveries in different locations and likely unrelated.\n\nTherefore, two summaries are possible:\n\n**Summary based on the Title:**\n\nA Bronze Age mega-settlement has been discovered in Kazakhstan showcasing evidence of advanced urban planning and sophisticated metallurgical practices. (This is a very brief summary based solely on the title, as no details about the settlement itself are provided).\n\n**Summary based on the Content Snippet:**\n\nA significant Bronze Age workshop has been unearthed at Kissonerga-Skalia in Cyprus. This discovery, dated November 26, 2025, suggests Bronze Age technological activity at the Cyprus location.\n",
    "chinese_title": "哈萨克斯坦青铜时代巨型聚落展现先进城市规划和冶金术",
    "chinese_summary": "哈萨克斯坦青铜时代大型聚落与塞浦路斯基索内加-斯卡利亚的青铜时代作坊：两项无关的发现\n\n**基于标题的摘要：**\n\n在哈萨克斯坦发现了一处青铜时代大型聚落，展现了先进的城市规划和精湛的冶金技术。（这是一个非常简短的摘要，仅基于标题，因为没有提供关于聚落本身的细节）。\n\n**基于内容片段的摘要：**\n\n在塞浦路斯基索内加-斯卡利亚发现了一个重要的青铜时代作坊。这项发现（日期为2025年11月26日）表明了青铜时代塞浦路斯地区的科技活动。"
  },
  {
    "id": "46092000",
    "title": "Scala",
    "url": "https://www.huygens-fokker.org/scala/",
    "summary": "Scala is a powerful, free software tool for experimenting with musical tunings, including microtonal and historical temperaments. It allows users to create, edit, analyze, and store scales, as well as tune electronic instruments and convert MIDI files. Scala boasts a wide range of mathematical routines and scale creation methods, making it suitable for both beginners exploring tunings and advanced users creating complex scales.\n\nKey features include a graphical user interface with a command-line interface, playback of scale tones via soundcard or MIDI instruments, extensive online help, and the ability to create extensible command scripts.  Scala supports exporting tuning data to a vast array of synthesizers via internal tuning tables and MIDI files, including popular software and hardware instruments. It recognizes thousands of musical modes, note-naming systems, chords, and regular temperaments, and includes a vast library of pre-existing scales.\n\nScala offers flexible keyboard mapping for scales with varying tones per octave and can retune existing MIDI files or relay real-time MIDI with tuning adjustments.  It can create MIDI files from microtonal scores and WAVE files with custom chords.  The software is available on multiple platforms (Windows, Linux, macOS, Unix) and is written in Ada, ensuring reliability.  Scala is freeware and welcomes user feedback and suggestions for improvements.\n",
    "chinese_title": "Scala",
    "chinese_summary": "Scala：一款强大的音乐调律实验自由软件，包括微分音和历史律制。它允许用户创建、编辑、分析和存储音阶，以及调音电子乐器和转换MIDI文件。Scala拥有广泛的数学例程和音阶创建方法，使其既适合探索调律的初学者，也适合创建复杂音阶的高级用户。\n\n主要功能包括带命令行界面的图形用户界面、通过声卡或MIDI乐器播放音阶音调、广泛的在线帮助以及创建可扩展的命令脚本的能力。Scala支持通过内部调音表和MIDI文件将调音数据导出到各种合成器，包括流行的软件和硬件乐器。它识别数千种音乐模式、音符命名系统、和弦和规则律制，并包含一个庞大的预置音阶库。\n\nScala为每个八度音程具有不同音调的音阶提供灵活的键盘映射，并且可以重新调音现有的MIDI文件或使用调音调整中继实时MIDI。它可以从微分音乐谱创建MIDI文件，并从自定义和弦创建WAVE文件。该软件可在多个平台（Windows、Linux、macOS、Unix）上使用，并以Ada编写，确保可靠性。Scala是免费软件，欢迎用户提供反馈和改进建议。"
  },
  {
    "id": "46089394",
    "title": "Zero knowlege proof of compositeness",
    "url": "https://www.johndcook.com/blog/2025/11/29/zkp-composite/",
    "summary": "This article explains the concept of zero-knowledge proofs (ZKPs), which allow proving a statement's truth without revealing any information beyond the statement itself. It uses the example of drawing a spade from a deck of cards to illustrate this concept.\n\nThe article then shows how Fermat's Little Theorem can be used as a ZKP to prove that a number is composite. By finding a base 'b' for which b^(n-1) is not congruent to 1 mod n, one can demonstrate that 'n' is composite without revealing its factors.\n\nWhile Fermat's Little Theorem cannot prove primality, the article explores the idea of a ZKP for primality. It raises questions about what information would be kept secret in such a proof and acknowledges that ZKPs can have a small probability of error. A primality certificate that is far faster to verify than it would be to prove from scratch that something is prime would meet the ZKP criteria.\n\nFinally, the article broadens the scope of ZKPs by mentioning non-constructive proofs like the Intermediate Value Theorem and highlighting their practical applications beyond mathematics, such as verifying accounting constraints in cryptocurrencies without revealing transaction details. The main takeaway is that ZKPs have diverse applications and are valuable because they are easier to verify than the direct approach.\n",
    "chinese_title": "合数的零知识证明",
    "chinese_summary": "本文解释了零知识证明（ZKPs）的概念，它允许在不泄露语句本身以外的任何信息的情况下证明语句的真实性。文章以从一副牌中抽出一张黑桃为例来说明这个概念。\n\n文章随后展示了如何使用费马小定理作为ZKP来证明一个数字是合数。通过找到一个底数'b'，使得b^(n-1)与1 mod n不全等，就可以证明'n'是合数，而无需泄露其因子。\n\n虽然费马小定理不能证明素性，但文章探讨了素性ZKP的想法。它提出了关于在这种证明中会保密哪些信息的问题，并承认ZKPs可能存在较小的错误概率。一个验证速度远快于从头开始证明某物是素数的素性证书将满足ZKP的标准。\n\n最后，文章通过提及非构造性证明（如中间值定理）来扩展ZKPs的范围，并强调了它们在数学之外的实际应用，例如在加密货币中验证会计约束而不泄露交易详情。主要的结论是，ZKPs具有多样化的应用，并且由于它们比直接方法更容易验证，因此具有价值。"
  },
  {
    "id": "46089546",
    "title": "Student perceptions of AI coding assistants in learning",
    "url": "https://arxiv.org/abs/2507.22900",
    "summary": "This article, titled \"New Kid in the Classroom: Exploring Student Perceptions of AI Coding Assistants,\" investigates student perceptions of AI coding assistants in introductory programming courses. The study explores how these tools impact novice programmers' learning experiences.\n\nResearchers conducted a two-part exam with 20 students. In the first part, students used AI support for a programming task. In the second part, they extended the solution without AI assistance. Data was collected through Likert-scale and open-ended questions to understand the challenges students faced and their overall perceptions.\n\nThe findings indicate that students generally found AI coding assistants helpful in understanding code concepts and increasing their confidence during the initial coding phase. However, when asked to work independently, students struggled, suggesting a potential over-reliance on AI and a gap in the transfer of fundamental programming knowledge.\n\nThe study emphasizes the need for new pedagogical approaches that integrate AI tools effectively while ensuring students develop strong core programming skills. The paper highlights the importance of not letting AI \"impersonate\" skills students need to learn themselves. The article is accepted for publication in the Proceedings of the 19th Colombian Conference on Computing, CCC 2025.\n",
    "chinese_title": "学生对人工智能编码助手在学习中的看法",
    "chinese_summary": "新同学在课堂：探索学生对人工智能编码助手的看法\n\n本文题为“新同学在课堂：探索学生对人工智能编码助手的看法”，旨在调查初级编程课程中学生对人工智能编码助手的看法。该研究探索了这些工具如何影响新手程序员的学习体验。\n\n研究人员对20名学生进行了包含两个部分的考试。在第一部分，学生使用人工智能辅助完成编程任务。在第二部分，他们在没有人工智能辅助的情况下扩展解决方案。通过李克特量表和开放式问题收集数据，以了解学生面临的挑战及其总体看法。\n\n研究结果表明，学生普遍认为人工智能编码助手有助于理解代码概念，并提高他们在初始编码阶段的信心。然而，当被要求独立工作时，学生们感到困难，这表明可能过度依赖人工智能，以及基础编程知识转移存在差距。\n\n该研究强调需要采用新的教学方法，在有效整合人工智能工具的同时，确保学生发展强大的核心编程技能。该论文强调了不要让人工智能“冒充”学生需要自己学习的技能的重要性。本文已被第19届哥伦比亚计算会议，CCC 2025论文集接收发表。"
  },
  {
    "id": "46088998",
    "title": "We're learning more about what Vitamin D does",
    "url": "https://www.technologyreview.com/2025/11/21/1128206/vitamin-d-bodies-bone-health-immune/",
    "summary": "This article explores the evolving understanding of vitamin D's role in health beyond bone strength. While initially recognized for preventing rickets by aiding calcium absorption, recent research suggests vitamin D influences immune function, heart health, and potentially mental well-being and pregnancy outcomes.\n\nThe author, prompted by seasonal darkness in London and a past vitamin D deficiency, delves into the challenges of understanding and addressing vitamin D levels. Despite promising links to various health benefits, studies on supplementation show mixed results, making definitive conclusions difficult.\n\nThe complexity lies in individual variations in vitamin D absorption from sunlight, diet (oily fish, egg yolks, fortified foods), and differing responses to UV rays based on melanin levels. While measuring blood levels of 25(OH)D is standard, an \"ideal\" level remains debated.\n\nThe article highlights that achieving optimal vitamin D levels through diet and sunlight alone is challenging. While research continues, the focus remains on avoiding deficiency (blood level below 30 nanomoles per liter). The UK government recommends a general 10-microgram supplement during autumn and winter, even without personalized considerations. In essence, while vitamin D's potential benefits are intriguing, further research is needed to provide tailored recommendations and conclusive evidence of its impact on various health conditions.\n",
    "chinese_title": "我们正在更多地了解维生素D的作用。",
    "chinese_summary": "本文探讨了人们对维生素D在健康方面作用的理解，已超出增强骨骼强度的范畴。最初，人们认识到维生素D通过帮助钙吸收来预防佝偻病，而最近的研究表明，维生素D会影响免疫功能、心脏健康，并可能影响精神健康和妊娠结局。\n\n作者受到伦敦季节性黑暗和过去维生素D缺乏症的启发，深入研究了理解和解决维生素D水平的挑战。尽管与各种健康益处有着很有希望的联系，但补充剂的研究结果好坏参半，使得得出明确的结论变得困难。\n\n复杂性在于个体在从阳光、饮食（油性鱼类、蛋黄、强化食品）中吸收维生素D的差异，以及基于黑色素水平对紫外线反应的差异。虽然测量25(OH)D的血液水平是标准做法，但“理想”水平仍存在争议。\n\n文章强调，仅通过饮食和阳光来实现最佳维生素D水平具有挑战性。虽然研究仍在继续，但重点仍然是避免缺乏症（血液水平低于每升30纳米摩尔）。英国政府建议在秋冬季节普遍补充10微克，即使没有个性化的考虑。总而言之，虽然维生素D的潜在益处令人着迷，但还需要进一步的研究，以提供量身定制的建议和关于其对各种健康状况影响的结论性证据。"
  },
  {
    "id": "46097601",
    "title": "6174",
    "url": "https://en.wikipedia.org/wiki/6174",
    "summary": "6174, also known as Kaprekar's constant, is a natural number notable for a unique property. Kaprekar's routine, named after Indian mathematician D.R. Kaprekar, involves the following steps: starting with any four-digit number with at least two different digits, arrange the digits in ascending and descending order to create two new numbers. Subtract the smaller number from the larger. Repeating this process will invariably lead to 6174 in a maximum of 7 iterations. Once 6174 is reached, the routine continuously yields 6174 (7641 - 1467 = 6174).\n\nThe only exception to this rule are repdigits (e.g., 1111), which result in 0000 after one iteration. Using leading zeros for numbers with fewer than four digits is crucial to the process.\n\nThe article also mentions analogous \"Kaprekar constants\" for different digit lengths, like 495 for 3-digit numbers. Furthermore, the article highlights applications of Kaprekar's constant in numerical analysis and recursion theory.\n\nFinally, it lists other properties of 6174, such as being a 7-smooth number and its relation to powers of 18.\n",
    "chinese_title": "6174",
    "chinese_summary": "6174，也称为卡普雷卡尔常数，是一个以其独特性质而闻名的自然数。卡普雷卡尔运算，以印度数学家D.R.卡普雷卡尔命名，包含以下步骤：从任意一个至少包含两位不同数字的四位数开始，将各位数字按升序和降序排列，创建两个新的数字。用较大的数减去较小的数。重复此过程必然会在最多7次迭代后得到6174。一旦达到6174，该运算会持续产生6174 (7641 - 1467 = 6174)。\n\n此规则的唯一例外是重覆数（例如1111），它们在一次迭代后会产生0000。对于位数少于四位的数字使用前导零对于该过程至关重要。\n\n文章还提到了不同位数长度的类似“卡普雷卡尔常数”，例如3位数数字的495。此外，文章还强调了卡普雷卡尔常数在数值分析和递归理论中的应用。\n\n最后，它列出了6174的其他属性，例如它是一个7-平滑数以及它与18的幂的关系。"
  },
  {
    "id": "46050861",
    "title": "A new myth appeared during the presidential campaign of Andrew Jackson",
    "url": "https://www.historynewsnetwork.org/article/self-made",
    "summary": "This article explores the emergence of the \"self-made man\" myth in American politics during Andrew Jackson's presidential campaigns of the 1820s. It argues that this narrative was a carefully constructed image used to appeal to a broader electorate and contrast Jackson with perceived aristocratic elites.\n\nBefore the revolutions, self-improvement was valued for service; claiming to be \"self-made\" was considered dangerous. But, the American Revolution shifted the narrative, casting elites as targets. Then, the 19th-century transformations valued personal wealth. Jackson, supported by newly enfranchised voters, exemplified this shift.\n\nDespite Jackson's privileged background (affluent family, private education, legal training, early inheritance, and beneficial connections), his supporters strategically emphasized a tragic childhood and frontier hardship to portray him as a man who rose \"from obscurity by his own exertions.\" This image was amplified through biographies and newspaper campaigns, portraying him as a \"solitary oak\" achieving success through sheer will, independent of community support or \"supernatural protection.\"\n\nThe article highlights that the term \"self-made\" was initially debated and not universally positive. However, by the 1828 election, it had gained cultural authority, becoming a valuable tool for political certification and differentiating candidates from \"aristocrats\"—a broad and shifting label applied to anyone perceived as hindering ambition. While the myth of the self-made man was taking hold, it necessarily excluded women, people of color, and the working class, whose contributions were rendered invisible.\n",
    "chinese_title": "安德鲁·杰克逊总统竞选期间出现了一个新的神话。",
    "chinese_summary": "本文探讨了19世纪20年代安德鲁·杰克逊总统竞选期间美国政治中“白手起家”神话的出现。文章认为，这种叙事是一种精心构建的形象，旨在吸引更广泛的选民，并将杰克逊与人们认为的贵族精英区分开来。\n\n在革命之前，自我提升的价值在于服务；自称“白手起家”被认为是危险的。但是，美国革命改变了叙事，将精英视为目标。随后，19世纪的变革重视个人财富。在获得新选举权的选民的支持下，杰克逊成为了这一转变的典范。\n\n尽管杰克逊拥有优越的背景（富裕的家庭、私立教育、法律培训、早期继承和有利的人脉），但他的支持者有策略地强调了他悲惨的童年和边境的艰辛，将他描绘成一个“靠自己的努力从默默无闻中崛起”的人。这种形象通过传记和报纸宣传活动得以放大，将他描绘成一棵“孤独的橡树”，凭借纯粹的意志取得成功，独立于社区支持或“超自然保护”。\n\n文章强调，“白手起家”一词最初存在争议，并非普遍具有积极意义。然而，到1828年大选时，它已经获得了文化权威，成为政治认证和区分候选人与“贵族”（一个广泛且不断变化的标签，适用于任何被认为阻碍雄心壮志的人）的宝贵工具。虽然白手起家者的神话正在形成，但它必然排除了女性、有色人种和工人阶级，他们的贡献被视而不见。"
  },
  {
    "id": "46085585",
    "title": "Garfield's Proof of the Pythagorean Theorem",
    "url": "https://en.wikipedia.org/wiki/Garfield%27s_proof_of_the_Pythagorean_theorem",
    "summary": "Garfield's proof of the Pythagorean theorem is a unique demonstration of the theorem devised by James A. Garfield, the 20th President of the United States, in 1876 while he was a congressman. Published in the New-England Journal of Education, it stands out as a nontrivial mathematical contribution from a US President.\n\nThe proof relies on constructing a trapezoid from two congruent right triangles (ABC and BDE) and an isosceles right triangle (ABD). By calculating the area of the trapezoid in two different ways, Garfield established the relationship between the sides of the right triangles, thus proving the theorem.\n\nThe first method calculates the area of the trapezoid using the formula: height * (average of parallel sides) = (a+b) * (1/2)(a+b).\n\nThe second method calculates the area of the trapezoid as the sum of the areas of the three triangles: (1/2)(a*b) + (1/2)(c*c) + (1/2)(a*b).\n\nEquating these two expressions and simplifying, Garfield arrived at the Pythagorean theorem: a² + b² = c².  The proof is considered clever by mathematicians and is included in collections of Pythagorean theorem proofs.\n",
    "chinese_title": "加菲尔德的勾股定理证明",
    "chinese_summary": "加菲尔德总统的勾股定理证明是美国第20任总统詹姆斯·A·加菲尔德（时任国会议员）于1876年提出的一种独特的定理证明方法。它发表在《新英格兰教育杂志》上，堪称美国总统在数学上的一个非凡贡献。\n\n该证明依赖于用两个全等的直角三角形（ABC和BDE）和一个等腰直角三角形（ABD）构造一个梯形。通过两种不同的方式计算梯形的面积，加菲尔德建立了直角三角形各边之间的关系，从而证明了该定理。\n\n第一种方法使用公式：高 * （平行边平均值）= (a+b) * (1/2)(a+b) 来计算梯形面积。\n\n第二种方法将梯形面积计算为三个三角形面积之和：(1/2)(a*b) + (1/2)(c*c) + (1/2)(a*b)。\n\n通过等同这两个表达式并进行简化，加菲尔德得出了勾股定理：a² + b² = c²。该证明被数学家认为是巧妙的，并被收录在勾股定理证明集中。"
  },
  {
    "id": "46037031",
    "title": "Show HN: Explore what the browser exposes about you",
    "url": "https://neberej.github.io/exposedbydefault/",
    "summary": "The \"Show HN: Explore what the browser exposes about you\" article, titled \"ExposedByDefault - What Your Browser Reveals About You,\" highlights the extent of personal information a browser transmits to websites without explicit user consent. The article likely presents a tool or resource that allows users to investigate the various data points their browser automatically exposes.\n\nThe core message revolves around the concept that browsers leak a significant amount of information by default. This information can include details such as:\n\n*   **Browser type and version:** Identifies the specific browser you're using.\n*   **Operating system:** Reveals your OS (Windows, macOS, Linux, etc.).\n*   **Installed fonts:** Lists fonts available on your system.\n*   **Hardware information:** Potentially exposes CPU details, graphics card, and memory capacity.\n*   **Network information:** Could include IP address, language preferences, and time zone.\n*   **Installed plugins and extensions:** Shows which browser add-ons you have.\n*   **Do Not Track setting:** Indicates your preference for online tracking.\n*   **Geolocation:** (If enabled) Reveals your physical location.\n\nBy exposing this information, websites and trackers can create a detailed \"fingerprint\" of your browser and device, making it easier to track you across the web even without cookies. The article likely aims to raise awareness of this often-overlooked privacy issue and perhaps offer suggestions for minimizing the amount of data your browser exposes. Users may be directed to browser settings or privacy-focused extensions that can help mitigate these privacy leaks.\n",
    "chinese_title": "展示HN: 探索浏览器暴露的关于你的信息",
    "chinese_summary": "“Show HN：探索浏览器泄露你的信息”文章，题为“ExposedByDefault - 你的浏览器泄露了什么”，强调了浏览器在未经用户明确同意的情况下向网站传输个人信息的程度。这篇文章可能展示了一个工具或资源，允许用户调查他们的浏览器自动泄露的各种数据点。\n\n核心信息围绕着浏览器默认情况下泄露大量信息这一概念。这些信息可能包括以下细节：\n\n*   **浏览器类型和版本：** 识别你正在使用的特定浏览器。\n*   **操作系统：** 揭示你的操作系统（Windows、macOS、Linux等）。\n*   **已安装字体：** 列出你系统上可用的字体。\n*   **硬件信息：** 可能暴露CPU详细信息、显卡和内存容量。\n*   **网络信息：** 可能包括IP地址、语言偏好和时区。\n*   **已安装插件和扩展：** 显示你拥有的浏览器插件。\n*   **请勿追踪设置：** 指示你对在线追踪的偏好。\n*   **地理位置：** （如果已启用）揭示你的物理位置。\n\n通过暴露这些信息，网站和追踪器可以创建你的浏览器和设备的详细“指纹”，即使没有Cookie，也能更容易地在网络上追踪你。这篇文章可能旨在提高人们对这个经常被忽视的隐私问题的意识，并可能提供一些建议，以尽量减少浏览器暴露的数据量。用户可能会被引导到浏览器设置或以隐私为中心的扩展程序，这些可以帮助减轻这些隐私泄露。"
  },
  {
    "id": "46087549",
    "title": "Hachi: An Image Search Engine",
    "url": "https://eagledot.xyz/hachi.md.html",
    "summary": "This article introduces Hachi, a self-hosted image search engine project aimed at making personal data more easily searchable. The author is motivated by the challenge of managing the increasing volume and distributed nature of personal data stored across various devices and locations. Hachi aims to provide a user-friendly interface that accommodates the stochastic nature of queries, offering suggestions even with partial information.\n\nThe project emphasizes minimalism, experimentation, and hackability. The goal is to tightly integrate machine learning models with a simpler search and storage interface, avoiding the data duplication required by traditional databases. The system indexes metadata coupled with vector-search for semantic understanding, without duplicating the original data.\n\nThe project utilizes Python for the backend and Nim (and C) to optimize bottleneck portions of the code. A custom-built, single-threaded, column-oriented meta-index module written in Nim handles metadata storage and querying.\n\nA key feature is face recognition, leveraging deep learning models to identify and group individuals in images. This involves detecting faces, landmarks, and generating embeddings for vector space analysis. The author discusses the challenges of choosing specific implementations considering factors like latency, accuracy, and hardware requirements.\n",
    "chinese_title": "八公：一个图像搜索引擎",
    "chinese_summary": "本文介绍了 Hachi，一个旨在让个人数据更易于搜索的自托管图像搜索引擎项目。作者的动机源于管理存储在各种设备和位置上日益增长和分布式的个人数据的挑战。Hachi 旨在提供一个用户友好的界面，以适应查询的随机性，即使只有部分信息也能提供建议。\n\n该项目强调极简主义、实验性和可 hack 性。目标是将机器学习模型与更简单的搜索和存储界面紧密集成，避免传统数据库所需的数据重复。该系统索引与向量搜索相结合的元数据，以实现语义理解，而无需复制原始数据。\n\n该项目使用 Python 作为后端，并使用 Nim（和 C）来优化代码的瓶颈部分。一个用 Nim 编写的定制的、单线程的、面向列的元索引模块处理元数据存储和查询。\n\n一个关键特性是面部识别，利用深度学习模型来识别和分组图像中的个体。这包括检测面部、地标，并生成用于向量空间分析的嵌入。作者讨论了在考虑延迟、准确性和硬件要求等因素时选择特定实现的挑战。"
  },
  {
    "id": "46093766",
    "title": "NFCGate flagged as malware even after multiple followups saying it isn't",
    "url": "https://github.com/nfcgate/nfcgate/issues/164",
    "summary": "The issue reported on the NFCGate GitHub repository concerns malware scanner reports flagging the latest release of the NFCGate app as malware. IzzySoft, a repository owner for IzzyOnDroid, raised the concern after VirusTotal (VT) showed two major antivirus engines, supported by two others, identifying the app as malicious. This prompted IzzySoft to temporarily remove the update from IzzyOnDroid to protect users, pending a response from the NFCGate developers. The main concern is whether this is a false positive or if a genuine security issue exists within the latest release of NFCGate. IzzySoft is requesting the developers to investigate the issue and provide clarification. The report aims to ensure the safety and integrity of the NFCGate application for its users.\n",
    "chinese_title": "NFCGate多次声明无恶意后仍被标记为恶意软件",
    "chinese_summary": "NFCGate GitHub仓库报告的问题是，恶意软件扫描器将最新版本的NFCGate应用标记为恶意软件。IzzyOnDroid的仓库所有者IzzySoft提出了这一问题，原因是VirusTotal（VT）显示两个主要的杀毒引擎，以及另外两个支持它们的引擎，将该应用识别为恶意软件。这促使IzzySoft暂时从IzzyOnDroid中删除了该更新，以保护用户，等待NFCGate开发人员的回应。主要担忧是这是否是误报，或者NFCGate最新版本中是否存在真正的安全问题。IzzySoft正在请求开发人员调查该问题并提供澄清。该报告旨在确保NFCGate应用程序对其用户的安全性和完整性。"
  },
  {
    "id": "46096841",
    "title": "Discovering that my smartphone had infiltrated my life",
    "url": "https://utcc.utoronto.ca/~cks/space/blog/tech/SmartphoneInfiltratedMyLife",
    "summary": "In a blog post from February 17, 2025, Chris Siebenmann explains why readers might encounter an error message indicating they're using an \"old browser\" when trying to access his blog, \"Wandering Thoughts,\" or his wiki, \"CSpace.\" This is due to anti-crawler measures he implemented to combat a surge in high-volume web crawlers, particularly those using outdated Chrome user agents. These crawlers are believed to be collecting data for Large Language Model (LLM) training.\n\nSiebenmann's security measures inadvertently block legitimate users with older browsers. He encourages users who are running current browser versions but still encounter the error to contact him at his university email address (deducible from the context), providing details like their browser type and User-Agent string.\n\nHe specifically addresses users accessing the blog through archive sites like archive.today, archive.ph, and archive.is. He states that these archival services are indistinguishable from malicious crawlers because they use old Chrome User-Agent values, crawl from widely distributed IP addresses, and some even utilize falsified reverse DNS entries mimicking Googlebot, a practice associated with malicious actors. He recommends using archive.org instead, as it's a more cooperative archival crawler.\n",
    "chinese_title": "发现智能手机已经渗透了我的生活。",
    "chinese_summary": "在2025年2月17日的一篇博客文章中，Chris Siebenmann解释了为什么读者在尝试访问他的博客“Wandering Thoughts”或他的wiki“CSpace”时，可能会遇到提示他们使用“旧浏览器”的错误信息。这是由于他为了对抗大量网络爬虫（尤其是那些使用过时Chrome User-Agent的网络爬虫）而采取的反爬虫措施所致。据信，这些爬虫正在收集数据用于大型语言模型（LLM）的训练。\n\nSiebenmann的安全措施无意中阻止了使用旧浏览器的合法用户。他鼓励那些运行当前浏览器版本但仍然遇到错误的用户，通过他的大学邮箱地址（可从上下文中推断）联系他，并提供诸如浏览器类型和User-Agent字符串等详细信息。\n\n他特别提到了通过archive.today、archive.ph和archive.is等存档网站访问该博客的用户。他指出，这些存档服务与恶意爬虫无法区分，因为它们使用旧的Chrome User-Agent值，从广泛分布的IP地址进行爬取，有些甚至使用伪造的反向DNS条目来模仿Googlebot，这种做法与恶意行为者有关。他建议使用archive.org代替，因为它是一个更具合作性的存档爬虫。"
  },
  {
    "id": "46092630",
    "title": "Stopping bad guys from using my open source project (feedback wanted)",
    "url": "https://evanhahn.com/stopping-bad-guys-from-using-my-open-source-project/",
    "summary": "Evan Hahn, a maintainer of a \"sorta-popular\" open-source npm package with over 200 million downloads, is grappling with the ethics of his work being used by large corporations and potentially \"bad guys.\" He's frustrated by the perceived exploitation of open source by corporations that benefit immensely without contributing back and is concerned about the use of open-source tools in harmful applications, citing examples like AI used in warfare.\n\nHe questions the traditional open-source ethos of \"freedom to run the program as you wish, for any purpose\" (freedom 0) and expresses a desire to shift the default to a model where ethical considerations are more prominent. His goal is to discourage misuse without unduly restricting beneficial applications.\n\nHahn is seeking feedback and ideas on how to achieve this. Specifically, he asks:\n\n*   How can he raise awareness about this issue, given his project's relative popularity?\n*   Should he change his project's permissive MIT license?\n*   Would collective action with other maintainers be more effective?\n*   Should he experiment with changes on his less popular projects first?\n\nHe invites readers to share their thoughts and suggestions via email or other contact methods.\n",
    "chinese_title": "阻止坏人使用我的开源项目（征求反馈）",
    "chinese_summary": "Evan Hahn，一个维护着拥有超过2亿次下载量的“有点流行”的开源npm包的维护者，正在努力应对他的作品被大型公司和潜在的“坏人”使用的伦理问题。 他对公司在没有回馈的情况下从开源中获得巨大利益，以及开源工具在有害应用中的使用（例如用于战争的人工智能）感到沮丧。\n\n他质疑“出于任何目的，你可以随意运行该程序”的传统开源精神（自由0），并表达了将默认模式转变为更注重伦理考量的模式的愿望。他的目标是在不过度限制有益应用的情况下，阻止滥用。\n\nHahn正在寻求关于如何实现这一目标的反馈和想法。具体来说，他问：\n\n*   鉴于他的项目相对受欢迎，他如何提高人们对此问题的认识？\n*   他是否应该更改他项目宽松的MIT许可证？\n*   与其他维护者的集体行动是否会更有效？\n*   他是否应该先在他的不太受欢迎的项目上进行更改实验？\n\n他邀请读者通过电子邮件或其他联系方式分享他们的想法和建议。"
  },
  {
    "id": "46090294",
    "title": "The Origins of Scala (2009)",
    "url": "https://www.artima.com/articles/the-origins-of-scala",
    "summary": "This article, a conversation between Bill Venners and Martin Odersky, explores the origins of the Scala programming language. Odersky recounts his early fascination with compilers, leading to his work on a Modula-2 compiler and a PhD with Niklaus Wirth. He then details his involvement in bringing functional programming concepts to Java through Pizza and GJ (Generic Java), which later influenced Java 5 generics.\n\nFrustrated by the constraints of backward compatibility with Java, Odersky decided to create a new language, Scala, leveraging the JVM and its libraries. Early experiments with the join calculus-based language Funnel proved too academic. The team then aimed for a balance between academic purity and practical usability. The first public release of Scala was in 2003, with a major redesign in 2006.\n\nOdersky explains how Java's requirement for backward compatibility hindered the development of generics, particularly concerning covariant arrays. This limitation prevented desirable features, leading to the decision to break source compatibility in Scala to enable a better design. He emphasizes the importance of creating a practical and advanced language while retaining the advantages of the Java platform.\n",
    "chinese_title": "Scala的起源 (2009)",
    "chinese_summary": "本文是比尔·维纳斯与马丁·奥德斯基之间的一段对话，探讨了Scala编程语言的起源。奥德斯基回忆了他早期对编译器的迷恋，这促使他开发了Modula-2编译器，并在尼克劳斯·维尔特指导下获得了博士学位。然后，他详细介绍了自己如何通过Pizza和GJ（泛型Java）将函数式编程概念引入Java，这后来影响了Java 5的泛型。\n\n由于Java向后兼容性的限制令他感到沮丧，奥德斯基决定创建一个新的语言Scala，利用JVM及其库。早期基于连接演算的语言Funnel的实验证明过于学术化。团队随后致力于在学术纯粹性和实际可用性之间取得平衡。Scala的第一个公开版本于2003年发布，并在2006年进行了重大重新设计。\n\n奥德斯基解释了Java对向后兼容性的要求如何阻碍了泛型的开发，尤其是在协变数组方面。这种限制阻止了理想的功能，导致他们决定在Scala中打破源代码兼容性，以实现更好的设计。他强调了在保留Java平台优势的同时，创建一种实用且先进的语言的重要性。"
  },
  {
    "id": "46020730",
    "title": "Hardening the C++ Standard Library at scale",
    "url": "https://queue.acm.org/detail.cfm?id=3773097",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "大规模强化C++标准库",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "46057141",
    "title": "Post-mortem of Shai-Hulud attack on November 24th, 2025",
    "url": "https://posthog.com/blog/nov-24-shai-hulud-attack-post-mortem",
    "summary": "On November 24th, 2025, PostHog suffered a Shai-Hulud 2.0 attack that compromised their Javascript SDKs published on npm. Malicious versions containing a self-replicating worm were published, scanning for and exfiltrating credentials, and then using npm credentials to further propagate the breach. Affected packages included `posthog-node`, `posthog-js`, `posthog-react-native`, and others.\n\nThe root cause wasn't a direct compromise of PostHog's npm credentials by the worm. Instead, an attacker targeted PostHog directly, using a compromised GitHub Personal Access Token (PAT) obtained through a malicious pull request to steal GitHub secrets, including the npm token. The PR, which added `pull_request_target` as a workflow trigger, allowed the attacker to inject malicious code and exfiltrate secrets. The attacker then used these secrets to publish the compromised packages.\n\nPostHog advises users of their Javascript SDKs to scan for malicious files, check npm logs for suspicious entries, delete cached dependencies, and pin dependencies to known-good versions. They also recommend using the `minimumReleaseAge` setting.\n\nTo prevent future attacks, PostHog has tightened package release workflows, increased security reviews for workflow modifications, switched to pnpm with disabled preinstall/postinstall scripts and `minimumReleaseAge`, and reworked GitHub secrets management. They are also taking broad security more seriously, and are actively recruiting for their security team. The primary vulnerability was a misunderstanding of the security implications of GitHub Actions' `pull_request_target` trigger in combination with a checkout step that executed code from the PR branch.\n",
    "chinese_title": "2025年11月24日沙虫袭击事后报告",
    "chinese_summary": "2025年11月24日，PostHog遭受了沙虫2.0攻击，导致其发布在 npm 上的 Javascript SDK 受损。包含自复制蠕虫的恶意版本被发布，扫描并泄露凭据，然后使用 npm 凭据进一步传播漏洞。受影响的软件包包括 `posthog-node`、`posthog-js`、`posthog-react-native` 等。\n\n根本原因并非蠕虫直接入侵了 PostHog 的 npm 凭据。相反，攻击者直接针对 PostHog，使用通过恶意拉取请求获得的被盗 GitHub 个人访问令牌 (PAT) 来窃取 GitHub 密钥，包括 npm 令牌。该 PR 添加了 `pull_request_target` 作为工作流触发器，允许攻击者注入恶意代码并泄露密钥。然后，攻击者使用这些密钥发布了受损的软件包。\n\nPostHog 建议其 Javascript SDK 的用户扫描恶意文件，检查 npm 日志中是否有可疑条目，删除缓存的依赖项，并将依赖项锁定到已知良好的版本。他们还建议使用 `minimumReleaseAge` 设置。\n\n为防止未来遭受攻击，PostHog 已经收紧了软件包发布工作流程，增加了对工作流程修改的安全审查，切换到 pnpm 并禁用了 preinstall/postinstall 脚本和 `minimumReleaseAge`，并重新设计了 GitHub 密钥管理。他们也更加重视广泛的安全，并积极招聘安全团队成员。主要漏洞是对 GitHub Actions 的 `pull_request_target` 触发器与执行 PR 分支代码的 checkout 步骤结合使用的安全影响的误解。"
  },
  {
    "id": "46087596",
    "title": "DNS LOC Record (2014)",
    "url": "https://blog.cloudflare.com/the-weird-and-wonderful-world-of-dns-loc-records/",
    "summary": "This article from 2014 discusses the implementation of LOC (Location) records in CloudFlare's authoritative DNS server, RRDNS, written in Go. While CloudFlare handles millions of DNS records, only a small fraction are LOC records, which specify a physical location. The author, John Graham-Cumming, explains that despite the presence of code for handling LOC record requests and responses, a crucial piece was missing: the code to parse the textual LOC record format into RRDNS's internal binary format.\n\nThe article details the textual and binary formats of LOC records as defined in RFC 1876. The textual format is relatively simple, containing latitude, longitude, altitude, and optional size and precision values. The binary format, however, requires parsing into a fixed-size structure containing 32-bit latitude, longitude, and altitude, along with 8-bit values for size and precision encoded in a special, human-readable format.\n\nThe lack of a parser meant that CloudFlare couldn't properly serve LOC records, leading to a customer support request. The author describes the process of writing a parser for the textual LOC record type, allowing RRDNS to correctly interpret and serve these records. The fix has been implemented, and the article concludes with an example demonstrating how to query a LOC record. The article highlights the importance of handling even rarely used DNS record types in a large-scale DNS infrastructure.\n",
    "chinese_title": "DNS LOC 记录 (2014)",
    "chinese_summary": "本文介绍了CloudFlare的权威DNS服务器RRDNS（使用Go编写）在2014年对LOC（位置）记录的实现。CloudFlare处理数百万条DNS记录，但只有一小部分是LOC记录，用于指定物理位置。作者John Graham-Cumming解释说，尽管存在处理LOC记录请求和响应的代码，但缺少一个关键部分：将文本LOC记录格式解析为RRDNS内部二进制格式的代码。\n\n文章详细介绍了RFC 1876中定义的LOC记录的文本和二进制格式。文本格式相对简单，包含纬度、经度、海拔以及可选的大小和精度值。然而，二进制格式需要解析为一个固定大小的结构，包含32位纬度、经度和海拔，以及以特殊的人工可读格式编码的8位大小和精度值。\n\n由于缺少解析器，CloudFlare无法正确提供LOC记录服务，导致客户支持请求。作者描述了编写文本LOC记录类型解析器的过程，使RRDNS能够正确解释和提供这些记录。该修复已实施，文章最后提供了一个查询LOC记录的示例。文章强调了在大型DNS基础设施中处理即使是很少使用的DNS记录类型的重要性。"
  },
  {
    "id": "46094739",
    "title": "Reddit Migrates Comment Back End from Python to Go Microservice to Halve Latency",
    "url": "https://www.infoq.com/news/2025/11/reddit-comments-go-migration/",
    "summary": "Reddit migrated its comment backend from a legacy Python system to a domain-specific Go microservice, achieving a 50% reduction in p99 latency for critical write operations and improved reliability. The migration addressed scalability and latency challenges in Reddit's high-write comment system.\n\nThe migration employed a multi-phase strategy to ensure correctness and minimize user disruption, using a \"tap-compare\" testing approach. This involved sending a portion of live traffic to the new Go service and comparing its responses to the Python system without affecting users. Writes were more complex, involving PostgreSQL, Memcached, and Redis, requiring the deployment of separate \"sister\" datastores for testing.\n\nChallenges included serialization mismatches, database pressure from Go's direct writes compared to Python's ORM-based approach, and race conditions during tap-compare. These were resolved through CDC validation, query optimization, and improved local testing.\n\nThe new architecture simplifies the comment system's dependency chain and enables further decomposition of core services. Two of Reddit's four core models (Comments and Accounts) are fully migrated, with Posts and Subreddits in progress. The Go microservice architecture allows for higher throughput with fewer resources due to Go's concurrency capabilities. Community feedback reported faster comment creation and reduced downtime.\n",
    "chinese_title": "Reddit 将评论后端从 Python 迁移到 Go 微服务，延迟减半",
    "chinese_summary": "Reddit将其评论后端从旧版Python系统迁移到特定领域的Go微服务，关键写入操作的P99延迟降低了50%，并提高了可靠性。此次迁移解决了Reddit高写入评论系统中的可扩展性和延迟挑战。\n\n该迁移采用了多阶段策略，以确保正确性并最大程度地减少用户中断，使用了“tap-compare”测试方法。这包括将一部分实时流量发送到新的Go服务，并将它的响应与Python系统进行比较，而不影响用户。写入操作更为复杂，涉及PostgreSQL、Memcached和Redis，需要部署单独的“姊妹”数据存储进行测试。\n\n挑战包括序列化不匹配、由于Go的直接写入与Python基于ORM的方法相比带来的数据库压力，以及tap-compare期间的竞争条件。 这些通过CDC验证、查询优化和改进的本地测试得以解决。\n\n新的架构简化了评论系统的依赖链，并能够进一步分解核心服务。Reddit的四个核心模型（评论和帐户）中有两个已完全迁移，帖子和子版块正在迁移中。 由于Go的并发能力，Go微服务架构允许以更少的资源实现更高的吞吐量。社区反馈报告显示评论创建速度更快，停机时间减少。"
  },
  {
    "id": "46091708",
    "title": "Mint Is Not TeX",
    "url": "https://mint.ubavic.rs/",
    "summary": "MINT is a new document markup language designed for extensibility and human readability. Unlike TeX, its special character is \"@\" instead of \"\\\", and all commands start with \"@\". A key difference is that MINT has no predefined commands; users define them in a YAML schema file, allowing for content-specific customization.\n\nThe author created MINT to avoid the complexities of existing systems like TeX, Pandoc, and static site generators, especially when implementing custom processing. MINT prioritizes letting users implement processing logic in their preferred language, with MINT providing a parser. While inspired by projects like Pollen, MINT remains language-independent and strictly separates markup from processing code.\n\nMINT's simple grammar facilitates fast parser implementation. Documents consist of elements (text or commands), and commands include a label, optional ID, and arguments enclosed in braces.\n\nThe article includes an example illustrating how Euclid's Elements could be marked up using MINT, demonstrating the user's ability to tailor commands to specific semantic needs.\n\nMINT is being used for the \"Programming in Haskell\" book and this website. Currently in heavy alpha, a Go program can load MINT files, a YAML schema, and output text or JSON. The author welcomes feedback and contributions via GitHub or email.\n",
    "chinese_title": "Mint 不是 TeX",
    "chinese_summary": "MINT：一种可扩展且易于阅读的新型文档标记语言。与TeX不同，其特殊字符为“@”而非“\\”，所有命令均以“@”开头。一个关键区别是，MINT没有预定义的命令；用户在YAML模式文件中定义它们，从而实现针对特定内容的自定义。\n\n作者创建MINT是为了避免现有系统（如TeX、Pandoc和静态站点生成器）的复杂性，尤其是在实现自定义处理时。MINT优先考虑让用户以他们喜欢的语言实现处理逻辑，而MINT提供解析器。虽然受到Pollen等项目的启发，但MINT保持了语言独立性，并将标记与处理代码严格分离。\n\nMINT简单的语法有利于快速实现解析器。文档由元素（文本或命令）组成，命令包括标签、可选ID和用大括号括起来的参数。\n\n文章包含一个示例，说明了如何使用MINT标记《几何原本》，展示了用户根据特定语义需求定制命令的能力。\n\nMINT正在用于“Programming in Haskell”一书和本网站。目前正处于深度alpha阶段，一个Go程序可以加载MINT文件、YAML模式，并输出文本或JSON。作者欢迎通过GitHub或电子邮件提供反馈和贡献。"
  },
  {
    "id": "46035126",
    "title": "WebR – R in the Browser",
    "url": "https://webr.sh/",
    "summary": "The article is about WebR, a version of the R programming language that runs directly in a web browser. The key takeaway is that WebR allows users to execute R code without needing a server or local R installation. The content is brief and points to the fact that JavaScript needs to be enabled to use the WebR application.\n",
    "chinese_title": "WebR – 浏览器中的R",
    "chinese_summary": "本文介绍 WebR，这是一个可以直接在网页浏览器中运行的 R 编程语言版本。 主要结论是 WebR 允许用户执行 R 代码，而无需服务器或本地 R 安装。 内容简洁，并指出需要启用 JavaScript 才能使用 WebR 应用程序。"
  },
  {
    "id": "46095834",
    "title": "Man behind in-flight Evil Twin WiFi attacks gets 7 years in prison",
    "url": "https://www.bleepingcomputer.com/news/security/man-behind-in-flight-evil-twin-wifi-attacks-gets-7-years-in-prison/",
    "summary": "A 44-year-old Australian man was sentenced to seven years and four months in prison for conducting \"evil twin\" WiFi attacks on travelers during flights and at airports in Australia. Between April 2024 and his sentencing in November 2025, he was discovered to have set up rogue WiFi access points using a 'WiFi Pineapple' device, mimicking legitimate airport networks to steal users' social media credentials via phishing pages.\n\nHe then used these stolen credentials to access women's accounts, monitoring their communications and stealing private images and videos. Authorities found thousands of intimate images, personal credentials, and records of fraudulent WiFi pages on his devices. He also attempted to delete evidence and accessed his employer's laptop to gain information on confidential meetings with investigators.\n\nThe man pleaded guilty to numerous charges, including unauthorized data access/modification, attempting unauthorized access, stealing, unauthorized impairment of electronic communication, possessing data for serious offenses, failure to comply with an order, and attempted destruction of evidence.\n\nThe AFP is warning the public about the dangers of public WiFi and advising using VPNs, strong passwords, and disabling file-sharing and automatic WiFi connectivity. The article stresses the importance of being cautious with captive portals and avoiding entering personal information on login pages.\n",
    "chinese_title": "发动机上邪恶双胞胎WiFi攻击的幕后黑手被判处7年监禁",
    "chinese_summary": "一名44岁的澳大利亚男子因在澳大利亚境内航班和机场上对旅客实施“邪恶双胞胎”WiFi攻击，被判处七年零四个月监禁。在2024年4月至2025年11月宣判期间，他被发现使用“WiFi菠萝”设备设置伪造的WiFi接入点，模仿合法的机场网络，通过钓鱼页面窃取用户的社交媒体凭据。\n\n随后，他利用这些被盗凭据访问女性的账户，监控她们的通信，并窃取私密图片和视频。当局在他的设备上发现了成千上万张私密照片、个人凭据和欺诈性WiFi页面的记录。他还试图删除证据，并访问其雇主的笔记本电脑，以获取与调查人员的机密会议信息。\n\n该男子承认了多项指控，包括未经授权访问/修改数据、试图未经授权访问、盗窃、未经授权损害电子通信、持有用于严重犯罪的数据、未能遵守命令以及试图销毁证据。\n\n澳大利亚联邦警察（AFP）警告公众注意公共WiFi的危险，并建议使用VPN、强密码，以及禁用文件共享和自动WiFi连接。文章强调了谨慎对待强制门户以及避免在登录页面上输入个人信息的重要性。"
  },
  {
    "id": "46051182",
    "title": "Let go of StackOverflow; communities must take ownership",
    "url": "https://ahelwer.ca/post/2025-11-25-stackoverflow/",
    "summary": "This article argues that StackOverflow, despite its initial promise, is now detrimental to niche communities, particularly those around specific programming languages or technologies. The author uses a satirical anecdote about \"Joe Pointsman,\" a StackOverflow user focused on accumulating points by arbitrarily closing questions he doesn't understand, to illustrate the problem. Joe's actions, though absurd, represent a broader issue: StackOverflow's incentive structure doesn't align with the needs of these communities.\n\nThe author contends that StackOverflow moderators, like \"Joe,\" who may lack specific knowledge or investment in a community, can stifle growth and discourage learning by closing or deleting valid questions. This misalignment hinders the welcoming and helpful environment crucial for attracting new users and fostering expertise.\n\nTherefore, the author urges readers to abandon StackOverflow in favor of community-owned channels like mailing lists, chat forums (Zulip, Discord, Slack), and discourse instances. While these alternative platforms might have their own drawbacks (e.g., proprietary nature), they are preferable because their moderators and participants are invested in the community's success. This ownership fosters a more supportive and knowledgeable environment.\n\nThe article acknowledges the imperfections of community-run forums, citing the Arch Linux forums as an example of high expectations for user effort. However, the overall message is a call to prioritize community-driven support over the often arbitrary and sometimes hostile environment of StackOverflow, which the author believes is actively harming niche communities like TLA+. The author acknowledges that some specialized StackExchange sites (e.g., CSSE, QCSE) remain valuable due to their knowledgeable and engaged moderators.\n",
    "chinese_title": "放下StackOverflow，社区必须掌握所有权",
    "chinese_summary": "本文认为，StackOverflow尽管最初前景光明，但现在对小众社区，特别是围绕特定编程语言或技术的社区，弊大于利。作者用一个关于“积分乔”，一个通过随意关闭自己不理解的问题来积累积分的StackOverflow用户的讽刺故事，来说明这个问题。乔的行为虽然荒谬，但代表了一个更广泛的问题：StackOverflow的激励机制与这些社区的需求并不一致。\n\n作者认为，像“乔”这样的StackOverflow版主，可能缺乏特定知识或对社区的投入，他们可以通过关闭或删除有效问题来扼杀增长并阻碍学习。这种错位阻碍了欢迎和乐于助人的环境，而这种环境对于吸引新用户和培养专业知识至关重要。\n\n因此，作者敦促读者放弃StackOverflow，转而使用社区拥有的渠道，如邮件列表、聊天论坛（Zulip、Discord、Slack）和Discourse实例。虽然这些替代平台可能存在自身的缺点（例如，专有性），但它们更可取，因为它们的版主和参与者都投入于社区的成功。这种所有权培养了一个更具支持性和知识性的环境。\n\n文章承认社区运营论坛的不完善之处，并以Arch Linux论坛为例，说明了对用户努力的高期望。然而，总体的讯息是呼吁优先考虑社区驱动的支持，而不是StackOverflow常常是武断的，有时甚至充满敌意的环境，作者认为这种环境正在积极地损害像TLA+这样的小众社区。作者承认，由于其知识渊博且积极参与的版主，一些专业的StackExchange站点（例如，CSSE、QCSE）仍然具有价值。"
  },
  {
    "id": "46088192",
    "title": "Iceland declares ocean-current instability a national security risk",
    "url": "https://edition.cnn.com/2025/11/15/climate/iceland-warming-current-amoc-collapse-threat",
    "summary": "Iceland has declared the potential collapse of the Atlantic Meridional Overturning Circulation (AMOC), a crucial ocean current system, a national security risk. This unprecedented move highlights the severe threat the AMOC's instability poses to the island nation's climate, economy, and security. The AMOC acts like a conveyor belt, bringing warm water north, keeping Iceland's climate relatively mild.\n\nResearch suggests the AMOC is slowing down due to rising global temperatures and disrupted salinity levels. A collapse would trigger catastrophic global weather shifts, including sea level rise in parts of the US and Europe, disrupted monsoon systems, and a deep freeze in Europe. Iceland would be particularly vulnerable, potentially surrounded by sea ice, devastating its infrastructure, transportation, and fishing industry.\n\nMinister Jóhannsson emphasized that the AMOC regulates Iceland's weather, and its collapse is an \"existential threat.\" The national security designation will ensure a coordinated government response to understand the threat, prevent the collapse if possible, and mitigate the worst consequences. The government was briefed on the latest science after research published in August raised “grave concerns” about the AMOC’s future stability. Climatologist Stefan Rahmstorf praised Iceland's decision and urged other countries to recognize the potential global impacts of an AMOC collapse, including destroyed crops and catastrophic flooding.\n",
    "chinese_title": "冰岛宣布海洋环流不稳定为国家安全风险",
    "chinese_summary": "冰岛宣布大西洋经向翻转环流潜在崩溃为国家安全风险。"
  },
  {
    "id": "46070203",
    "title": "GitLab discovers widespread NPM supply chain attack",
    "url": "https://about.gitlab.com/blog/gitlab-discovers-widespread-npm-supply-chain-attack/",
    "summary": "GitLab discovered a large-scale NPM supply chain attack utilizing an evolved version of the \"Shai-Hulud\" malware, characterized by worm-like propagation and a destructive \"dead man's switch.\" The malware infects packages through a multi-stage process, using a seemingly innocuous `setup_bun.js` script to install the Bun runtime and execute the malicious `bun_environment.js` payload.\n\nOnce active, the malware harvests credentials from GitHub, npm, AWS, GCP, and Azure, exfiltrating data to attacker-controlled GitHub repositories marked with \"Sha1-Hulud: The Second Coming.\" It then propagates by infecting other packages maintained by the compromised developers, updating package versions and republishing them to npm.\n\nCritically, the \"dead man's switch\" triggers data destruction on infected systems if access to both GitHub (exfiltration) and npm (propagation) is lost simultaneously, potentially leading to widespread data loss if a takedown occurs. The malware attempts to delete user files and overwrite disk sectors on Windows, and uses `shred` on Unix systems.\n\nGitLab recommends using Dependency Scanning to detect infected packages in `package-lock.json` or `yarn.lock` files. GitLab Ultimate users can also use GitLab Duo Chat with the Security Analyst Agent to query project vulnerabilities quickly. The article provides Indicators of Compromise (IoCs) and urges the community to respond effectively while considering the implications of the \"dead man's switch\" during remediation.\n",
    "chinese_title": "GitLab 发现大规模 NPM 供应链攻击",
    "chinese_summary": "GitLab发现大规模NPM供应链攻击，利用进化版“沙虫 (Shai-Hulud)”恶意软件，该软件具有蠕虫式传播和破坏性“死亡开关”的特点。该恶意软件通过多阶段过程感染软件包，使用看似无害的`setup_bun.js`脚本安装Bun运行时并执行恶意`bun_environment.js`有效载荷。\n\n激活后，该恶意软件会从GitHub、npm、AWS、GCP和Azure收集凭据，并将数据泄露到攻击者控制的GitHub存储库，这些存储库标有“Sha1-Hulud: The Second Coming”。然后，它通过感染受感染开发者维护的其他软件包进行传播，更新软件包版本并将其重新发布到npm。\n\n关键在于，如果同时失去对GitHub（数据泄露）和npm（传播）的访问权限，“死亡开关”会触发受感染系统上的数据销毁，如果发生查封，可能会导致广泛的数据丢失。该恶意软件尝试删除用户文件并覆盖Windows上的磁盘扇区，并在Unix系统上使用`shred`。\n\nGitLab建议使用依赖项扫描来检测`package-lock.json`或`yarn.lock`文件中的受感染软件包。GitLab Ultimate用户还可以使用GitLab Duo Chat与安全分析师代理快速查询项目漏洞。本文提供了入侵指标（IoCs），并敦促社区有效应对，同时考虑修复过程中“死亡开关”的影响。"
  },
  {
    "id": "46091362",
    "title": "Bazzite: Operating System for Linux gaming",
    "url": "https://bazzite.gg/",
    "summary": "Bazzite is a Linux-based operating system tailored for gaming, designed for both newcomers and experienced users. It comes pre-installed with Steam, supports HDR & VRR, and incorporates CPU schedulers optimized for gaming performance. It supports multiple game launchers like Lutris, allowing seamless integration of games from various platforms (Xbox Game Pass, EA App, Epic Games Store, etc.) into Steam Gaming Mode.\n\nBazzite emphasizes compatibility and flexibility across devices, from handhelds to desktops, enabling shared MicroSD game libraries. The system is image-based, enabling easy rollback to previous versions after updates. It features enterprise-class security, including SELinux, Secure Boot, and LUKS disk encryption.\n\nThe OS prioritizes hardware compatibility, offering pre-installed Nvidia drivers, accelerated video encoding/decoding, and support for various game controllers (Xbox, PlayStation, etc.). Handheld Daemon enhances functionality for devices from ASUS, Lenovo, GPD, and others, providing controller emulation and hardware control via a UI.\n\nUsers can choose KDE Plasma or GNOME desktop environments, and Steam Gaming Mode offers a console-like experience. Waydroid allows running Android apps. Bazzite uses the Bazaar app store and supports containerization for installing packages from other Linux distributions.\n\nCommunity support is available via Discord, Discourse, and Reddit. The project is supported through Open Collective and contributions are welcomed on GitHub. Positive testimonials highlight its improved performance, battery life, and ease of use compared to Windows, particularly on handheld gaming PCs.\n",
    "chinese_title": "Bazzite：Linux游戏操作系统",
    "chinese_summary": "Bazzite是一款基于Linux的操作系统，专为游戏打造，适合新手和经验丰富的用户。它预装了Steam，支持HDR和VRR，并集成了针对游戏性能优化的CPU调度器。它支持多个游戏启动器，如Lutris，可将来自不同平台（Xbox Game Pass、EA App、Epic Games Store等）的游戏无缝集成到Steam游戏模式中。\n\nBazzite强调跨设备的兼容性和灵活性，从掌机到台式机，都支持共享MicroSD游戏库。该系统基于镜像，更新后可以轻松回滚到以前的版本。它具有企业级的安全性，包括SELinux、安全启动和LUKS磁盘加密。\n\n该操作系统优先考虑硬件兼容性，提供预装的Nvidia驱动程序、加速的视频编码/解码，并支持各种游戏控制器（Xbox、PlayStation等）。Handheld Daemon增强了来自华硕、联想、GPD等设备的功能，通过用户界面提供控制器模拟和硬件控制。\n\n用户可以选择KDE Plasma或GNOME桌面环境，Steam游戏模式提供类似游戏机的体验。Waydroid允许运行Android应用程序。Bazzite使用Bazaar应用商店，并支持容器化，以便从其他Linux发行版安装软件包。\n\n社区支持可通过Discord、Discourse和Reddit获得。该项目通过Open Collective获得支持，并欢迎在GitHub上进行贡献。积极的用户评价强调了与Windows相比，尤其是在掌上游戏电脑上，Bazzite在性能、电池续航和易用性方面的改进。"
  },
  {
    "id": "46097102",
    "title": "The Undermining of the CDC",
    "url": "https://www.newyorker.com/magazine/2025/12/08/the-undermining-of-the-cdc",
    "summary": "生成摘要时出错",
    "chinese_title": "The Undermining of the CDC",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46083004",
    "title": "Airbus A320 – intense solar radiation may corrupt data critical for flight",
    "url": "https://www.airbus.com/en/newsroom/press-releases/2025-11-airbus-update-on-a320-family-precautionary-fleet-action",
    "summary": "生成摘要时出错",
    "chinese_title": "Airbus A320 – intense solar radiation may corrupt data critical for flight",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46056715",
    "title": "Running a business means contact with reality",
    "url": "https://fredkozlowski.com/2025/11/02/running-a-business-means-contact-with-reality/",
    "summary": "生成摘要时出错",
    "chinese_title": "Running a business means contact with reality",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46092217",
    "title": "The engineer–manager pendulum is breaking",
    "url": "https://www.modernleader.is/p/pendulum-revisited",
    "summary": "生成摘要时出错",
    "chinese_title": "The engineer–manager pendulum is breaking",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46084956",
    "title": "System 7 natively boots on the Mac mini G4",
    "url": "https://macos9lives.com/smforum/index.php?topic=7711.0",
    "summary": "生成摘要时出错",
    "chinese_title": "System 7 natively boots on the Mac mini G4",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46094037",
    "title": "AI just proved Erdos Problem #124",
    "url": "https://twitter.com/vladtenev/status/1994922827208663383",
    "summary": "生成摘要时出错",
    "chinese_title": "AI just proved Erdos Problem #124",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46051332",
    "title": "Building road signs at home using a Cricut Machine",
    "url": "https://annanay.dev/build-a-signboard/",
    "summary": "生成摘要时出错",
    "chinese_title": "Building road signs at home using a Cricut Machine",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46079073",
    "title": "Language is primarily a tool for communication rather than thought (2024) [pdf]",
    "url": "https://gwern.net/doc/psychology/linguistics/2024-fedorenko.pdf",
    "summary": "生成摘要时出错",
    "chinese_title": "Language is primarily a tool for communication rather than thought (2024) [pdf]",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46050302",
    "title": "1964 Recompiling Engine Documentation (2001) [pdf]",
    "url": "https://emudev.org/docs/1964-recompiling-engine-documentation.pdf",
    "summary": "生成摘要时出错",
    "chinese_title": "1964 Recompiling Engine Documentation (2001) [pdf]",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46077136",
    "title": "The Math of Why You Can't Focus at Work",
    "url": "https://justoffbyone.com/posts/math-of-why-you-cant-focus-at-work/",
    "summary": "生成摘要时出错",
    "chinese_title": "The Math of Why You Can't Focus at Work",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46090794",
    "title": "Europe's New War on Privacy",
    "url": "https://unherd.com/2025/11/europes-new-war-on-privacy/",
    "summary": "生成摘要时出错",
    "chinese_title": "Europe's New War on Privacy",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46092056",
    "title": "Dilution vs. Risk taking: Capital gains taxes and entrepreneurs",
    "url": "https://www.nber.org/papers/w34512",
    "summary": "生成摘要时出错",
    "chinese_title": "Dilution vs. Risk taking: Capital gains taxes and entrepreneurs",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46095523",
    "title": "Why Fears of a Trillion-Dollar AI Bubble Are Growing",
    "url": "https://www.bloomberg.com/news/articles/2025-11-24/why-ai-bubble-concerns-loom-as-openai-microsoft-meta-ramp-up-spending",
    "summary": "生成摘要时出错",
    "chinese_title": "Why Fears of a Trillion-Dollar AI Bubble Are Growing",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46089980",
    "title": "Framework Computer Now Sponsoring LVFS / Fwupd Development",
    "url": "https://www.phoronix.com/news/Framework-Sponsoring-LVFS",
    "summary": "生成摘要时出错",
    "chinese_title": "Framework Computer Now Sponsoring LVFS / Fwupd Development",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46091532",
    "title": "Nobara Project: Fedora Linux with user-friendly fixes added to it",
    "url": "https://nobaraproject.org/",
    "summary": "生成摘要时出错",
    "chinese_title": "Nobara Project: Fedora Linux with user-friendly fixes added to it",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46045207",
    "title": "WinApps: Run Windows apps as if they were a part of the native Linux OS",
    "url": "https://github.com/winapps-org/winapps",
    "summary": "生成摘要时出错",
    "chinese_title": "WinApps: Run Windows apps as if they were a part of the native Linux OS",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46093132",
    "title": "Parkrun is an unwitting British public-health success",
    "url": "https://www.economist.com/britain/2025/10/24/parkrun-is-an-unwitting-british-public-health-success",
    "summary": "生成摘要时出错",
    "chinese_title": "Parkrun is an unwitting British public-health success",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46081188",
    "title": "Imgur geo-blocked the UK, so I geo-unblocked my network",
    "url": "https://blog.tymscar.com/posts/imgurukproxy/",
    "summary": "生成摘要时出错",
    "chinese_title": "Imgur geo-blocked the UK, so I geo-unblocked my network",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46013269",
    "title": "The risk of round numbers and sharp thresholds in clinical practice",
    "url": "https://www.nature.com/articles/s41746-025-02079-y",
    "summary": "生成摘要时出错",
    "chinese_title": "The risk of round numbers and sharp thresholds in clinical practice",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46079785",
    "title": "Don't tug on that, you never know what it might be attached to (2016)",
    "url": "https://blog.plover.com/2016/07/01/#tmpdir",
    "summary": "生成摘要时出错",
    "chinese_title": "Don't tug on that, you never know what it might be attached to (2016)",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46097126",
    "title": "Zillow Removes Climate Risk Scores from Home Listings",
    "url": "https://www.nytimes.com/2025/11/30/climate/zillow-climate-risk-scores-homes.html",
    "summary": "生成摘要时出错",
    "chinese_title": "Zillow Removes Climate Risk Scores from Home Listings",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46088236",
    "title": "Major AI conference flooded with peer reviews written by AI",
    "url": "https://www.nature.com/articles/d41586-025-03506-6",
    "summary": "生成摘要时出错",
    "chinese_title": "Major AI conference flooded with peer reviews written by AI",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46094606",
    "title": "Qwen3-VL can scan two-hour videos and pinpoint nearly every detail",
    "url": "https://the-decoder.com/qwen3-vl-can-scan-two-hour-videos-and-pinpoint-nearly-every-detail/",
    "summary": "生成摘要时出错",
    "chinese_title": "Qwen3-VL can scan two-hour videos and pinpoint nearly every detail",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46083051",
    "title": "A first look at Django's new background tasks",
    "url": "https://roam.be/notes/2025/a-first-look-at-djangos-new-background-tasks/",
    "summary": "生成摘要时出错",
    "chinese_title": "A first look at Django's new background tasks",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46043318",
    "title": "Build Your Own Router with URLPattern()",
    "url": "https://jschof.dev/posts/2025/11/build-your-own-router/",
    "summary": "生成摘要时出错",
    "chinese_title": "Build Your Own Router with URLPattern()",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46055091",
    "title": "Plinko PIR Tutorial",
    "url": "https://vitalik.eth.limo/general/2025/11/25/plinko.html",
    "summary": "生成摘要时出错",
    "chinese_title": "Plinko PIR Tutorial",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46042562",
    "title": "Magicians of the Miniature (2014)",
    "url": "http://nzpetesmatteshot.blogspot.com/2014/12/magicians-of-miniature.html",
    "summary": "生成摘要时出错",
    "chinese_title": "Magicians of the Miniature (2014)",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46089347",
    "title": "Compiled ZX Spectrum Basic and Z88DK Added to Online Retro IDE",
    "url": "https://retrogamecoders.com/zx-spectrum-basic-z88dk/",
    "summary": "生成摘要时出错",
    "chinese_title": "Compiled ZX Spectrum Basic and Z88DK Added to Online Retro IDE",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46033872",
    "title": "Generating Cats with learned lookup tables",
    "url": "https://aschrein.github.io/jekyll/update/2025/11/23/generating_cats2.html",
    "summary": "生成摘要时出错",
    "chinese_title": "Generating Cats with learned lookup tables",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46080364",
    "title": "So you wanna build a local RAG?",
    "url": "https://blog.yakkomajuri.com/blog/local-rag",
    "summary": "生成摘要时出错",
    "chinese_title": "So you wanna build a local RAG?",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46087737",
    "title": "It's Always the Process, Stupid",
    "url": "https://its.promp.td/its-always-the-process-stupid/",
    "summary": "生成摘要时出错",
    "chinese_title": "It's Always the Process, Stupid",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46084535",
    "title": "Every mathematician has only a few tricks (2020)",
    "url": "https://mathoverflow.net/questions/363119/every-mathematician-has-only-a-few-tricks",
    "summary": "生成摘要时出错",
    "chinese_title": "Every mathematician has only a few tricks (2020)",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46076642",
    "title": "SQLite as an Application File Format",
    "url": "https://sqlite.org/appfileformat.html",
    "summary": "生成摘要时出错",
    "chinese_title": "SQLite as an Application File Format",
    "chinese_summary": "生成摘要时出错"
  }
]