[
  {
    "id": "44604050",
    "title": "lsr: ls with io_uring",
    "url": "https://tangled.sh/@rockorager.dev/lsr",
    "summary": "`lsr` is a new `ls` utility that leverages io_uring for potentially improved performance on Linux systems by batching syscalls. It's written in Zig and requires Zig 0.14.0 for installation. Installation involves using the `zig build` command with the desired optimization level and prefix.\n\n`lsr` offers common `ls` functionalities, including options for displaying all files (`-a`), almost all files (`-A`), controlling output format (columns, one per line), enabling colors, sorting, displaying icons, and showing extended file metadata (`-l`).\n\nBenchmarks reveal that `lsr` can outperform other `ls` implementations, including `ls`, `eza`, `lsd`, `uutils`, and `busybox ls`, especially when dealing with larger numbers of files. These benchmarks compare execution time (using hyperfine) and the number of syscalls (using strace). The results show that `lsr` generally exhibits lower execution times and significantly fewer syscalls, particularly as the number of files increases, highlighting the efficiency gains from io_uring. However, the io_uring benefits are only available on Linux.\n",
    "chinese_title": "lsr：使用io_uring的ls",
    "chinese_summary": "`lsr` 是一款新的 `ls` 工具，它利用 io_uring 通过批量处理系统调用来潜在地提升 Linux 系统上的性能。它用 Zig 编写，需要 Zig 0.14.0 才能安装。 安装需要使用带有期望优化级别和前缀的 `zig build` 命令。\n\n`lsr` 提供了常见的 `ls` 功能，包括显示所有文件 (`-a`)、几乎所有文件 (`-A`)、控制输出格式（列、每行一个）、启用颜色、排序、显示图标以及显示扩展文件元数据 (`-l`) 等选项。\n\n基准测试表明，`lsr` 可以胜过其他 `ls` 实现，包括 `ls`、`eza`、`lsd`、`uutils` 和 `busybox ls`，尤其是在处理大量文件时。这些基准测试比较了执行时间（使用 hyperfine）和系统调用次数（使用 strace）。结果表明，`lsr` 通常表现出更低的执行时间和显著更少的系统调用，尤其是在文件数量增加时，突出了 io_uring 带来的效率提升。然而，io_uring 的优势仅在 Linux 上可用。"
  },
  {
    "id": "44606803",
    "title": "DuckDuckGo now lets you hide AI-generated images in search results",
    "url": "https://techcrunch.com/2025/07/18/duckduckgo-now-lets-you-hide-ai-generated-images-in-search-results/",
    "summary": "DuckDuckGo has introduced a new feature that allows users to filter out AI-generated images from their search results. This feature addresses user feedback about AI images obstructing the search for authentic content. Users can toggle the \"AI images\" filter in the Images tab after conducting a search, choosing to either \"show\" or \"hide\" AI-generated content. The filter can also be enabled in the general search settings.\n\nDuckDuckGo acknowledges the increasing prevalence of low-quality AI-generated media (\"AI slop\") and employs manually curated open-source blocklists like uBlockOrigin's \"nuclear\" list and uBlacklist Huge AI Blocklist to identify and filter AI images. While the filter isn't perfect, it significantly reduces the number of AI images displayed.\n\nDuckDuckGo plans to add more filters in the future. The article notes DuckDuckGo's example search of \"baby peacock\" references Google's past controversy of prioritizing AI-generated images over real ones in search results.\n",
    "chinese_title": "DuckDuckGo 现在允许你隐藏搜索结果中的 AI 生成图像",
    "chinese_summary": "DuckDuckGo推出新功能，过滤搜索结果中的AI生成图像。此功能旨在解决用户反馈AI图像妨碍搜索真实内容的问题。用户可以在图片标签页搜索后切换“AI图像”过滤器，选择“显示”或“隐藏”AI生成内容。该过滤器也可以在通用搜索设置中启用。\n\nDuckDuckGo承认低质量AI生成媒体（“AI垃圾”）日益普遍，并采用手动管理的开源黑名单，如uBlockOrigin的“nuclear”列表和uBlacklist Huge AI Blocklist，来识别和过滤AI图像。虽然该过滤器并不完美，但它能显著减少显示的AI图像数量。\n\nDuckDuckGo计划未来添加更多过滤器。文章指出，DuckDuckGo“小孔雀”的示例搜索参考了谷歌过去在搜索结果中优先显示AI生成图像而非真实图像的争议。"
  },
  {
    "id": "44569032",
    "title": "Trying Guix: A Nixer's Impressions",
    "url": "https://tazj.in/blog/trying-guix",
    "summary": "This article details a Nix user's first experience trying Guix, focusing on the practical challenges and differences encountered when attempting to replicate a standard desktop environment on a less common CPU architecture. The author acknowledges a strong bias toward Nix due to extensive experience.\n\nKey takeaways include:\n\n*   **Political Considerations:** Guix's strict adherence to free software necessitates the use of \"nonguix\" to enable common hardware like wireless internet, which immediately impacts the technical setup.\n*   **Architectural Differences:** Guix tightly integrates the CLI with a system profile containing all packages and modules from channels, unlike Nix's more modular approach where nixpkgs is imported as a large data structure. This makes version switching slower in Guix.\n*   **Documentation & Onboarding:** Guix boasts superior documentation compared to Nix, but requires familiarity with Scheme. The \"nonguix\" situation further complicates onboarding due to a lack of resources.\n*   **Performance:** Guix evaluation is significantly slower than Nix, especially noticeable on the author's low-performance laptop.\n*   **Init System:** Guix uses Shepherd, an init system written in Scheme, instead of systemd.\n*   **Profile-wide Installs:** Guix seems to favor profile-wide installations of packages, like Emacs packages, rather than Nix's approach of creating isolated environments with helpers.\n\nThe author concludes that while Guix presents challenges, its coherent ecosystem and use of Lisp are intriguing. They plan to continue experimenting with Guix to achieve feature parity with their existing NixOS setup and find a faster iteration workflow.\n",
    "chinese_title": "尝试 Guix：一位 Nix 用户的印象",
    "chinese_summary": "本文详细介绍了Nix用户首次尝试Guix的经历，重点关注在较不常见的CPU架构上复制标准桌面环境时遇到的实际挑战和差异。作者承认由于丰富的经验，对Nix有很强的偏见。\n\n主要要点包括：\n\n*   **政治考量：** Guix严格遵守自由软件，因此需要使用\"nonguix\"来启用常见的硬件，如无线互联网，这直接影响了技术设置。\n*   **架构差异：** 与Nix将nixpkgs作为大型数据结构导入的更模块化的方法不同，Guix将CLI与包含来自频道的所有软件包和模块的系统配置文件紧密集成。这使得Guix中的版本切换速度较慢。\n*   **文档与入门：** Guix的文档比Nix更出色，但需要熟悉Scheme。\"nonguix\"的情况由于缺乏资源而进一步使入门复杂化。\n*   **性能：** Guix的评估速度明显慢于Nix，在作者的低性能笔记本电脑上尤其明显。\n*   **Init系统：** Guix使用Shepherd（一个用Scheme编写的init系统）而不是systemd。\n*   **Profile全局安装：** Guix似乎更喜欢软件包的profile全局安装，例如Emacs软件包，而不是Nix创建具有帮助程序的隔离环境的方法。\n\n作者总结说，虽然Guix提出了挑战，但其连贯的生态系统和Lisp的使用令人着迷。他们计划继续尝试Guix，以实现与其现有NixOS设置的功能对等，并找到更快的迭代工作流程。"
  },
  {
    "id": "44603066",
    "title": "CP/M creator Gary Kildall's memoirs released as free download",
    "url": "https://spectrum.ieee.org/cpm-creator-gary-kildalls-memoirs-released-as-free-download",
    "summary": "The article announces the release of Gary Kildall's memoirs as a free download. Kildall, the creator of the CP/M operating system, is presented as a pioneer of the start-up culture. The article suggests his story highlights his contribution to this entrepreneurial spirit. The article also includes a photo of Randi Klett (presumably related to Kildall), and credits Tom Munnecke/Getty Images for the photo, and The Kildall Family/Computer History Museum for the journal displayed. The article is written by Tekla S. Perry, a former IEEE Spectrum editor.\n",
    "chinese_title": "CP/M 创始人 Gary Kildall 回忆录免费下载发布",
    "chinese_summary": "文章宣布免费下载加里·基尔代尔的回忆录。基尔代尔是CP/M操作系统的创造者，文章将其视为创业文化的先驱。文章暗示他的故事突出了他对这种创业精神的贡献。文章还包含一张兰迪·克莱特（推测与基尔代尔有关）的照片，并注明照片来源为Tom Munnecke/Getty Images，显示的期刊来源为The Kildall Family/Computer History Museum。文章由前IEEE Spectrum编辑Tekla S. Perry撰写。"
  },
  {
    "id": "44604453",
    "title": "Exposing the Unseen: Mapping MCP Servers Across the Internet",
    "url": "https://www.knostic.ai/blog/mapping-mcp-servers-study",
    "summary": "Knostic researchers discovered a significant number of insecure MCP (Meta-Control Protocol) servers exposed to the internet. Using Shodan and custom Python tools, they identified 1,862 servers, verifying that a sample of 119 granted access to internal tool listings without authentication.\n\nThe research revealed several key issues:\n\n*   **Lack of Security:** All tested servers were insecure, with many showing instability and bugs, indicating a low level of technological maturity. The MCP specification itself often lacks default authentication requirements.\n*   **Exposure of Capabilities:** The servers openly revealed their internal tools and functionality to anyone sending a protocol-compliant handshake request.\n*   **Early Adoption Stage:** The relatively low number of exposed servers suggests the technology is still in the early stages of adoption.\n\nThe researchers employed a fingerprinting method using Shodan, leveraging protocol markers, transport signals, endpoint paths, and technology fingerprints. They iteratively refined their search filters based on server banners and identified patterns. Verification involved sending a read-only `tools/list` request to confirm server functionality without triggering any actions.\n\nThe findings highlight a significant security concern, as organizations risk exposing sensitive functionality due to insecure MCP deployments. The research suggests that security may be addressed only after widespread exploitation, mirroring the patterns seen with other emerging technologies. The study focused on identifying exposed servers and adhered to ethical research practices by avoiding any actions that could alter data or incur costs.\n",
    "chinese_title": "揭露隐匿：互联网上 MCP 服务器的地图绘制",
    "chinese_summary": "诺斯替研究人员发现大量不安全的MCP（元控制协议）服务器暴露在互联网上。他们使用Shodan和自定义Python工具，识别出1862台服务器，并验证了其中119台允许未经身份验证访问内部工具列表。\n\n该研究揭示了几个关键问题：\n\n*   **缺乏安全性：** 所有测试的服务器都不安全，许多服务器表现出不稳定和漏洞，表明技术成熟度较低。 MCP规范本身通常缺乏默认的身份验证要求。\n*   **能力暴露：** 这些服务器向任何发送符合协议的握手请求的人公开其内部工具和功能。\n*   **早期采用阶段：** 暴露的服务器数量相对较少，表明该技术仍处于早期采用阶段。\n\n研究人员使用Shodan采用了一种指纹识别方法，利用协议标记、传输信号、端点路径和技术指纹。他们根据服务器标语迭代地完善了搜索过滤器并识别了模式。验证过程包括发送只读的`tools/list`请求，以确认服务器功能，而不会触发任何操作。\n\n研究结果突显了一个重要的安全问题，因为组织机构由于不安全的MCP部署而面临暴露敏感功能的风险。该研究表明，安全性可能只有在广泛的利用之后才能得到解决，这与其他新兴技术的发展模式相似。 该研究侧重于识别暴露的服务器，并遵守道德研究规范，避免采取任何可能更改数据或产生费用的行动。"
  },
  {
    "id": "44602532",
    "title": "When Root Meets Immutable: OpenBSD Chflags vs. Log Tampering",
    "url": "https://rsadowski.de/posts/2025/openbsd-immutable-system-logs/",
    "summary": "This article details how to achieve immutable logging in OpenBSD to meet ISO 27001 compliance, which requires protecting log information from tampering, even by root users. It argues that while ISO 27001 doesn't explicitly demand immutable logs, the standard's requirement for tamper-proof logs essentially necessitates it.\n\nThe author demonstrates how OpenBSD's `chflags` command, specifically the `sappnd` (system append-only) and `schg` (system immutable) flags, can be used to secure logs. Regular log files are set to `sappnd`, allowing them to grow but preventing modification or deletion. Rotated logs are moved to an archive directory and set to `schg`, making them completely immutable.\n\nThe challenge is that even root cannot remove these flags unless the system is running at a low security level. To automate log rotation, the article proposes a solution using `/etc/rc.securelevel`, a script that runs during boot before the security level increases. This script removes the flags, rotates logs using `newsyslog`, moves old logs to `/var/log/archive`, then resets the flags, rendering archived logs immutable. This setup provides a root-tamper-proof logging solution within OpenBSD, satisfying ISO 27001's implicit requirement for log integrity.\n",
    "chinese_title": "Root权限遇上不可变性：OpenBSD Chflags对抗日志篡改",
    "chinese_summary": "本文详细介绍了如何在OpenBSD中实现不可篡改的日志记录，以满足ISO 27001合规性要求，该合规性要求保护日志信息免受篡改，即使是root用户也不例外。文章认为，虽然ISO 27001没有明确要求不可篡改的日志，但该标准对防篡改日志的要求实际上使其成为必要。\n\n作者演示了如何使用OpenBSD的`chflags`命令，特别是`sappnd` (系统追加) 和 `schg` (系统不可变) 标志来保护日志。常规日志文件被设置为`sappnd`，允许它们增长但防止修改或删除。轮换后的日志被移动到一个存档目录并设置为`schg`，使其完全不可变。\n\n挑战在于，即使是root用户也无法删除这些标志，除非系统以较低的安全级别运行。为了自动化日志轮换，文章提出了一个使用`/etc/rc.securelevel`的解决方案，该脚本在安全级别提高之前启动期间运行。此脚本删除标志，使用`newsyslog`轮换日志，将旧日志移动到`/var/log/archive`，然后重置标志，使存档的日志不可变。这种设置在OpenBSD中提供了一个root用户无法篡改的日志记录解决方案，满足了ISO 27001对日志完整性的隐含要求。"
  },
  {
    "id": "44601023",
    "title": "Fully homomorphic encryption and the dawn of a private internet",
    "url": "https://bozmen.io/fhe",
    "summary": "This article explores Fully Homomorphic Encryption (FHE), a revolutionary technology enabling computations on encrypted data without decryption. This would allow for a \"Privacy by default\" internet, where user data remains encrypted throughout its lifecycle, addressing the vulnerability of data \"in use.\"\n\nCurrently, FHE is computationally intensive, with significant overhead in processing speed and storage size, making it impractical for most applications. However, the article highlights the rapid pace of FHE development, with performance improving dramatically (8x faster per year), suggesting an impending \"inflection point\" where FHE becomes viable for applications like encrypted cloud computing, LLM inference, and confidential blockchain smart contracts.\n\nThe article explains FHE's workings, highlighting lattice-based cryptography and the Learning With Errors (LWE) problem, emphasizing its quantum resistance. A key challenge in FHE is noise management during homomorphic operations (especially multiplications). The \"bootstrapping\" technique, invented by Craig Gentry, reduces noise and enables unlimited additions and multiplications, making FHE Turing complete.\n\nThe piece contrasts FHE with other encryption methods, highlighting its unique ability to protect data at rest, in transit, and, crucially, in use. It also provides a toy implementation of Paillier HE, a simpler form of encryption with additive homomorphism, to illustrate the core principles. The ultimate vision is a future where data breaches are minimized, and user privacy is enhanced through widespread adoption of FHE.\n",
    "chinese_title": "全同态加密与隐私互联网的曙光",
    "chinese_summary": "全同态加密 (FHE)：实现隐私保护的互联网"
  },
  {
    "id": "44561516",
    "title": "Hundred Rabbits – Low-tech living while sailing the world",
    "url": "https://100r.co/site/home.html",
    "summary": "Hundred Rabbits, a pair living a low-tech lifestyle while sailing the world, shares their monthly updates from January to June 2025. The updates cover their projects, boat maintenance, community involvement, and book club selections.\n\n**Projects:** They've been busy with software and creative projects including:\n*   **Uxn ecosystem:** Updates to Uxntal documentation, porting Modal to Uxn, working on \"Turnip Complete\" (an Uxn implementation guide), and improvements to the HTML5 Uxn emulator.\n*   **Games:** Releasing Oquonie on the Playdate catalog, working on Flickjam (a game jam based on Flickgame), and converting Oquonie's assets to 1-bit.\n*   **Website:** Updating 100r.co with new pages and information, improving Rabbit Waves with new pages on first aid, and releasing a printable zine on Morse code and signal flags.\n*   **Other Tools:** Releasing Nebu (a spreadsheet editor and desktop calendar), improvements to M291 and Turye.\n\n**Boat Maintenance:** They tackled various tasks, including hauling out Pino for scrubbing and repainting, correcting a propeller wobble, battling with the wheel quadrant, redoing Teapot's gelcoat, installing replacement solar panels, and airing out moldy lockers.\n\n**Community:** They participated in Goblin Week, met up with Merveillans on Blakely Island, offered advice and lent tools to other boaters, and expressed gratitude for their community.\n\n**Book Club:** They listed the books they're reading each month, including titles like \"Ill Met By Moonlight\", \"Artemis\", \"The Goldfinch\", and \"How Do You Live?\".\n",
    "chinese_title": "百兔号 – 低技术航海环游世界",
    "chinese_summary": "百兔，一对过着低技术生活方式并航行世界的夫妇，分享他们2025年1月至6月的月度更新。更新内容涵盖他们的项目、船只维护、社区参与以及读书俱乐部选书。\n\n**项目：** 他们一直忙于软件和创意项目，包括：\n*   **Uxn 生态系统：** Uxntal 文档更新、将 Modal 移植到 Uxn、开发 “Turnip Complete”（Uxn 实现指南）以及改进 HTML5 Uxn 模拟器。\n*   **游戏：** 在 Playdate 目录上发布 Oquonie，开发 Flickjam（基于 Flickgame 的游戏创作挑战赛），并将 Oquonie 的资源转换为 1-bit。\n*   **网站：** 使用新页面和信息更新 100r.co，使用关于急救的新页面改进 Rabbit Waves，以及发布关于摩尔斯电码和信号旗的可打印杂志。\n*   **其他工具：** 发布 Nebu（电子表格编辑器和桌面日历）、改进 M291 和 Turye。\n\n**船只维护：** 他们完成了各种任务，包括将 Pino 拖出进行擦洗和重新喷漆、纠正螺旋桨摆动、与舵轮象限作斗争、重做 Teapot 的凝胶涂层、安装更换的太阳能电池板以及通风发霉的储物柜。\n\n**社区：** 他们参与了 Goblin Week，在 Blakely Island 与 Merveillans 会面，为其他船员提供建议和借用工具，并对他们的社区表示感谢。\n\n**读书俱乐部：** 他们列出了每个月阅读的书籍，包括《月光之下》、《阿忒弥斯》、《金翅雀》和《你想活出怎样的人生？》等书名。"
  },
  {
    "id": "44571549",
    "title": "HathiTrust Digital Library – books online",
    "url": "https://www.hathitrust.org/",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "HathiTrust数字图书馆 - 在线书籍",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "44605946",
    "title": "Dear valued user, You have reached the error page for the error page",
    "url": "https://imgur.com/a/2H7HVcU",
    "summary": "This error page from Imgur indicates a problem with the user's browser configuration, specifically that JavaScript is disabled. The primary message delivered is a request for the user to enable JavaScript to allow the Imgur website to function correctly. Essentially, the user is seeing this page because Imgur relies on JavaScript to deliver its intended functionality and without it, the website cannot operate as expected. The page itself highlights the core message prominently: Imgur requires JavaScript. There's no other content beyond that instruction and the implication that the site's magic, referring to its content and features, is inaccessible without JavaScript enabled.\n",
    "chinese_title": "尊敬的用户，您已进入错误页面的错误页面。",
    "chinese_summary": "此Imgur错误页面表明用户的浏览器配置存在问题，特别是JavaScript被禁用。主要信息是请求用户启用JavaScript，以使Imgur网站能够正常运行。本质上，用户看到此页面是因为Imgur依赖JavaScript来提供其预期功能，如果没有它，网站就无法按预期运行。页面本身突出显示了核心信息：Imgur需要JavaScript。除此之外没有其他内容，暗示该网站的魔力（指其内容和功能）在未启用JavaScript的情况下无法访问。"
  },
  {
    "id": "44566510",
    "title": "The Art of Roland-Garros",
    "url": "https://www.garros.gallery/",
    "summary": "\"The Art of Roland-Garros\" showcases all of the iconic posters created for the Roland-Garros tournament throughout the years. The site acts as a fan gallery celebrating the art associated with the prestigious tennis event. It features a chronological display of the posters, starting from 2025 and going back to 1980, attributing each poster to the artist who created it, and offering a \"Purchase\" option. Featured artists include renowned names such as Marc-Antoine Mathieu (2025), Paul Rousteau (2024), Louise Sartor (2022), Joan Miró (1991), Pierre Alechinsky (1988), and many others. The displayed collection highlights the diverse artistic styles and interpretations brought to the tournament's visual identity over several decades. The page concludes with a disclaimer clarifying that all posters are copyrighted by the respective artists and the Fédération Française de Tennis, and that the site is an independent fan gallery not officially affiliated with either entity.\n",
    "chinese_title": "罗兰·加洛斯艺术",
    "chinese_summary": "罗兰-加洛斯艺术展：回顾历年赛事经典海报。该网站作为一个粉丝画廊，展示与这项著名网球赛事相关的艺术作品，按时间顺序陈列自2025年至1980年的海报，并标注每张海报的创作者，提供“购买”选项。参展艺术家包括马克-安托万·马蒂厄（2025）、保罗·鲁斯托（2024）、路易丝·萨托（2022）、胡安·米罗（1991）、皮埃尔·阿列钦斯基（1988）等众多知名人士。展出的作品集突显了数十年来为赛事视觉形象带来的多样艺术风格和诠释。页面末尾声明所有海报的版权归各自艺术家和法国网球联合会所有，并且本网站是一个独立的粉丝画廊，未与任何一方正式关联。"
  },
  {
    "id": "44603267",
    "title": "Psilocybin decreases depression and anxiety in cancer patients (2016)",
    "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC5367557/",
    "summary": "This 2016 study published in the Journal of Psychopharmacology investigated the effects of psilocybin on depression and anxiety in 51 cancer patients with life-threatening diagnoses. The study used a randomized, double-blind, cross-over design, comparing a very low dose of psilocybin (1 or 3 mg/70 kg) to a high dose (22 or 30 mg/70 kg) administered in counterbalanced sequence with 5 weeks between sessions and a 6-month follow-up.\n\nThe results showed that the high dose of psilocybin produced substantial and sustained decreases in both clinician- and self-rated measures of depressed mood and anxiety. Participants also experienced increased quality of life, life meaning, optimism, and decreased death anxiety. These positive changes were sustained at the 6-month follow-up, with approximately 80% of participants showing clinically significant reductions in depression and anxiety.\n\nParticipants attributed improvements in their attitudes about life, mood, relationships, and spirituality to the high-dose experience, with over 80% reporting moderately or greater increased well-being and life satisfaction. Community observers also noted corresponding positive changes. The intensity of the mystical-type experience during the psilocybin session was found to mediate the effect of the psilocybin dose on the therapeutic outcomes. The study highlights the potential of psilocybin as a treatment for psychological distress in cancer patients.\n",
    "chinese_title": "裸盖菇素减轻癌症患者的抑郁和焦虑（2016）",
    "chinese_summary": "这项2016年发表在《精神药理学杂志》上的研究调查了赛洛西宾对51名患有威胁生命的诊断的癌症患者的抑郁和焦虑的影响。该研究采用随机、双盲、交叉设计，比较了极低剂量的赛洛西宾（1或3毫克/70公斤）和高剂量（22或30毫克/70公斤），以平衡的顺序给药，两次疗程间隔5周，并进行6个月的随访。\n\n结果表明，高剂量的赛洛西宾显著且持续地降低了临床医生和自我评估的抑郁情绪和焦虑。参与者还体验到生活质量、生命意义、乐观情绪的提高以及死亡焦虑的降低。这些积极变化在6个月的随访中得以维持，约80%的参与者在抑郁和焦虑方面表现出临床意义上的显著降低。\n\n参与者将他们对生活、情绪、人际关系和灵性的态度的改善归因于高剂量体验，超过80%的人报告幸福感和生活满意度中等或更高程度的提高。社区观察员也注意到相应的积极变化。研究发现，赛洛西宾疗程中神秘体验的强度介导了赛洛西宾剂量对治疗效果的影响。该研究突出了赛洛西宾作为癌症患者心理困扰治疗方法的潜力。"
  },
  {
    "id": "44605618",
    "title": "ICE Is Getting Unprecedented Access to Medicaid Data",
    "url": "https://www.wired.com/story/ice-access-medicaid-data/",
    "summary": "A new information exchange agreement allows ICE unprecedented access to the personal data of nearly 80 million Medicaid recipients. The agreement grants ICE officials login credentials to the Centers for Medicare and Medicaid Services (CMS) database (T-MSIS), containing sensitive medical information, including diagnoses, procedures, addresses, and potentially banking data and social security numbers (though later specified to include only sex, ethnicity, and race).\n\nThe stated purpose is to identify and locate \"aliens in the United States,\" not to combat fraud or misuse of Medicaid funds, contradicting claims from HHS and DHS spokespeople that the data sharing is focused on preventing illegal immigrants from receiving benefits meant for law-abiding citizens. Critics, like former ICE director John Sandweg, warn of a chilling effect, deterring eligible individuals from seeking healthcare due to fear of immigration enforcement.\n\nThe ACLU argues the data sharing violates the Privacy Act and that CMS is surrendering data to ICE without proper justification. Cybersecurity experts raise concerns about potential violations if ICE's use of the data goes beyond the scope defined in the CMS's System of Records Notice (SORN). The agreement allows ICE to retain data indefinitely and share it with unspecified recipients.\n\nThis move follows increasing data sharing between agencies for immigration enforcement purposes, including previous revelations about ICE access to the ORR database tracking unaccompanied minors. Experts and advocates emphasize this will erode trust in government and force vulnerable individuals to choose between healthcare and the risk of deportation.\n",
    "chinese_title": "美国移民及海关执法局正以前所未有的程度获取医疗补助数据",
    "chinese_summary": "一项新的信息交换协议允许美国移民和海关执法局（ICE）前所未有地获取近8000万医疗补助（Medicaid）领取者的个人数据。该协议授予ICE官员访问医疗保险和医疗补助服务中心（CMS）数据库（T-MSIS）的登录凭据，该数据库包含敏感的医疗信息，包括诊断、程序、地址，以及潜在的银行数据和社会安全号码（但后来明确仅包括性别、种族和族裔）。\n\n声明的目的在于识别和定位“在美国的外国人”，而不是打击医疗补助基金的欺诈或滥用行为，这与美国卫生与公众服务部（HHS）和国土安全部（DHS）发言人声称的数据共享旨在防止非法移民获得合法公民应得的福利的说法相矛盾。包括前ICE局长约翰·桑德维格在内的批评人士警告说，这会产生寒蝉效应，由于担心移民执法，会阻止符合条件的人寻求医疗保健。\n\n美国公民自由联盟（ACLU）认为，数据共享违反了《隐私法》，CMS在没有充分理由的情况下将数据交给了ICE。网络安全专家对潜在的违规行为表示担忧，如果ICE对数据的使用超出了CMS系统记录通知（SORN）中定义的范围。该协议允许ICE无限期地保留数据，并与未指定的接收者共享数据。\n\n在此之前，各机构之间为移民执法目的而进行的数据共享日益增多，包括此前曝光的ICE访问追踪无人陪伴未成年人的ORR数据库。专家和倡导者强调，这将削弱对政府的信任，并迫使弱势群体在医疗保健和被驱逐出境的风险之间做出选择。"
  },
  {
    "id": "44568761",
    "title": "15 Years of Building Jefit",
    "url": "https://www.jefit.com/our-story",
    "summary": "Ying's article chronicles the 15-year journey of building Jefit, a workout planning and tracking app. Starting as a personal project to address workout tracking frustrations, Jefit evolved into a social workout platform driven by user feedback and a need for accountability. Initially bootstrapped in North Carolina with a small loan, Jefit focused on providing better tools for purposeful training.\n\nTo fuel growth, Ying made a risky move to Silicon Valley, rebuilding the team and navigating challenges like remote work. The company prioritizes a tight-knit team culture centered on training, user feedback, and continuous improvement.\n\nDespite facing setbacks, including user loss during COVID lockdowns and rejection from VC firms, Jefit maintained year-over-year growth. A commitment to quality and addressing product issues remained core.\n\nMarking its 15th anniversary, Jefit is launching a modernized platform with a refreshed interface, faster logging, improved progress reports, new goal-setting tools, and smarter workouts. Underneath, infrastructure upgrades promise enhanced speed, security, and a foundation for AI-driven features.\n\nYing expresses gratitude to Jefit's 13 million users for their loyalty and contributions, emphasizing the shared belief in discipline and long-term effort. The article concludes with a call to action, inviting users and supporters to embrace the grind together as Jefit embarks on its next chapter.\n",
    "chinese_title": "Jefit十五年发展历程",
    "chinese_summary": "盈的文章记录了Jefit这款健身计划与追踪App长达15年的发展历程。Jefit最初是为解决健身追踪痛点而生的个人项目，后来在用户反馈和对监督需求的驱动下，发展成为一个社交健身平台。最初在北卡罗来纳州依靠小额贷款进行自筹资金，Jefit专注于为有目的的训练提供更好的工具。\n\n为了推动增长，盈冒险搬到硅谷，重建团队并应对远程工作等挑战。公司重视以训练、用户反馈和持续改进为中心的紧密团队文化。\n\n尽管面临挫折，包括疫情封锁期间的用户流失和风险投资公司的拒绝，Jefit仍保持了同比增长。对质量的承诺和解决产品问题仍然是核心。\n\n在成立15周年之际，Jefit推出了一个现代化的平台，具有全新的界面、更快的记录速度、改进的进度报告、新的目标设定工具和更智能的锻炼。底层的基础设施升级承诺提供更快的速度、更高的安全性以及人工智能驱动功能的基础。\n\n盈对Jefit的1300万用户的忠诚和贡献表示感谢，并强调了对自律和长期努力的共同信念。文章最后发出了行动号召，邀请用户和支持者一起迎接挑战，共同开启Jefit的下一个篇章。"
  },
  {
    "id": "44563867",
    "title": "Row Polymorphic Programming",
    "url": "https://www.stranger.systems/posts/by-slug/row-polymorphic-programming.html",
    "summary": "This article introduces row polymorphism as a technique for handling messy, real-world data in statically typed languages like Idris. Row polymorphism allows you to write generic code that operates on records (or \"row types\") based on the presence of specific fields, rather than on interface implementations. This is particularly useful when dealing with data structures derived from schemas, such as those found in databases or spreadsheets.\n\nThe article contrasts row types with standard record types, highlighting the flexibility of row types to be defined by a schema, a data structure describing the columns and their types. The article showcases how to perform operations like accessing columns by name and constructing new row types by concatenating schemas.\n\nA practical example involving furniture placement in rooms illustrates the benefits of row polymorphism. Instead of defining separate `Room` and `Furniture` data types with an `Area` interface, the article demonstrates writing a single `area` function that works on any row type containing `length` and `width` fields of type `Double`. The code examples use lists to represent schemas, rows, and tables, illustrating how to implement row polymorphism in Idris.\n\nThe article concludes by discussing the pros and cons of row polymorphism, contrasting it with proof-of-intentionality. It suggests that row polymorphism is beneficial for tasks dealing with messy data (like frontend work or business logic) and is less useful for low-level systems programming. It also posits that row polymorphism can provide a more flexible and natural way to type code initially written for dynamically typed languages.\n",
    "chinese_title": "行多态编程",
    "chinese_summary": "本文介绍了行多态性，作为一种在Idris等静态类型语言中处理混乱、真实世界数据的技术。行多态性允许你编写泛型代码，基于特定字段的存在而非接口实现来操作记录（或“行类型”）。这在处理从模式派生的数据结构时尤其有用，例如数据库或电子表格中找到的那些。\n\n本文将行类型与标准记录类型进行对比，突出了行类型可以通过模式（一种描述列及其类型的数据结构）定义的灵活性。本文展示了如何执行诸如按名称访问列以及通过连接模式构造新的行类型之类的操作。\n\n一个关于房间家具摆放的实际例子说明了行多态性的优势。文章没有定义单独的具有`Area`接口的`Room`和`Furniture`数据类型，而是演示了编写一个单一的`area`函数，该函数适用于任何包含`length`和`width`字段（类型为`Double`）的行类型。代码示例使用列表来表示模式、行和表，说明了如何在Idris中实现行多态性。\n\n文章最后讨论了行多态性的优缺点，并将其与意图证明进行了对比。它认为行多态性对于处理混乱数据（如前端工作或业务逻辑）的任务是有益的，而对于底层系统编程则不太有用。它还认为，行多态性可以为最初为动态类型语言编写的代码提供一种更灵活和自然的方式来输入类型。"
  },
  {
    "id": "44606374",
    "title": "H-1B program grew 81 percent from 2011 to 2022",
    "url": "https://twitter.com/USTechWorkers/status/1945999773825196492",
    "summary": "This article, titled \"H-1B program grew 81 percent from 2011 to 2022,\" appears to be inaccessible. The provided content indicates that JavaScript is required to view the content on x.com (formerly Twitter), where the article seems to reside. Therefore, a proper summary of the article's main points and key information is impossible without access to the original source. The available text only describes the website's error message and related legal and corporate information.\n",
    "chinese_title": "H-1B项目从2011年至2022年增长了81%。",
    "chinese_summary": "题为“H-1B项目从2011年到2022年增长了81%”的这篇文章似乎无法访问。提供的内容表明，需要JavaScript才能在x.com（原Twitter）上查看内容，而该文章似乎位于该网站上。因此，在无法访问原始来源的情况下，无法对文章的主要观点和关键信息进行适当的总结。可用的文本仅描述了网站的错误信息以及相关的法律和公司信息。"
  },
  {
    "id": "44604328",
    "title": "NYPD bypassed facial recognition ban to ID pro-Palestinian student protester",
    "url": "https://www.thecity.nyc/2025/07/18/nypd-fdny-clearview-ai-ban-columbia-palestinian-protest/",
    "summary": "This article from THE CITY details how the FDNY circumvented NYPD's facial recognition ban to identify Zuhdi Ahmed, a pro-Palestinian protester at Columbia University, accused of throwing a rock at a pro-Israeli protester.\n\nA fire marshal used FDNY's access to Clearview AI and DMV records, typically unavailable to NYPD, to identify Ahmed, who was subsequently charged with a hate crime, later reduced to a misdemeanor. The case was eventually dismissed by a judge who raised concerns about government surveillance exceeding legal boundaries.\n\nThe NYPD is restricted by its own 2020 policy and the POST Act, which requires transparency regarding surveillance technologies, but the FDNY, as a separate agency, isn't bound by the same limitations. This raises concerns about potential loopholes and the circumvention of privacy protections.\n\nThe incident sparked outrage from privacy advocates, who argue the NYPD is utilizing questionable surveillance practices by relying on other agencies. City Council members are now considering new legislation to close these loopholes and expand the POST Act to cover all city agencies. The article also shares the personal toll the ordeal took on Ahmed, highlighting his fear and isolation.\n",
    "chinese_title": "纽约警察绕过面部识别禁令，锁定亲巴勒斯坦学生抗议者身份",
    "chinese_summary": "纽约市消防局绕过纽约市警察局面部识别禁令，识别出哥伦比亚大学亲巴勒斯坦抗议者祖迪·艾哈迈德，他被指控向亲以色列抗议者扔石头。\n\n一名消防队长利用纽约市消防局对Clearview AI和车辆管理局记录的访问权限（通常纽约市警察局无法获得），识别出艾哈迈德，后者随后被指控犯有仇恨罪，后降为轻罪。该案件最终被一名法官驳回，法官对政府监视超出法律界限表示担忧。\n\n纽约市警察局受到其自身2020年政策和《POST法案》的限制，《POST法案》要求对监视技术保持透明，但纽约市消防局作为一个独立的机构，不受相同的限制。这引发了对潜在漏洞和规避隐私保护的担忧。\n\n该事件激怒了隐私倡导者，他们认为纽约市警察局通过依赖其他机构，正在利用有问题的监视手段。市议员们现在正在考虑新的立法，以堵塞这些漏洞并将《POST法案》扩展到涵盖所有城市机构。文章还分享了这起事件给艾哈迈德带来的个人损失，突出了他的恐惧和孤立感。"
  },
  {
    "id": "44569019",
    "title": "Inspect ANSI control codes and escape sequences",
    "url": "https://ansi.tools",
    "summary": "This document appears to be a data record, likely the output of a tool or script designed to inspect ANSI control codes and escape sequences within a text string. The main focus is on analyzing and characterizing the ANSI escape sequences present in the input string.\n\nThe provided examples, like \"ls/ezablockstest runhyperlinksoctal8-bitcommandsstylesmixedcolors,\" are the inputs being analyzed. The subsequent data points describe the characteristics found in those inputs.\n\nThe key features analyzed include:\n\n*   **length:** The length of the input string (which is 0 in the provided extract).\n*   **rows/columns:** The dimensions of the text when interpreted in a terminal or similar display.\n*   **invert, grid:** Boolean flags likely indicating whether the ANSI sequences involve inverting colors or drawing a grid.\n*   **count:** The number of occurrences of specific codes.\n*   **duplicates:** Whether there are duplicate ANSI escape sequences.\n*   **sort, code, mnemonic, description, plain text, map position, newlines, greedy:** These fields suggest a structured analysis, perhaps involving sorting, categorizing by ANSI code, providing mnemonics and descriptions of the codes, extracting the plain text, mapping their positions, and analyzing how they handle newlines or greedily consume characters.\n\nEssentially, this data captures the result of parsing and analyzing ANSI escape sequences within a string, providing metadata about the types of sequences, their frequency, and other characteristics. The provided examples highlight specific ANSI-related functionalities like hyperlinks, octal color codes, 8-bit commands, styles, and mixed color usage.\n",
    "chinese_title": "检查ANSI控制码和转义序列",
    "chinese_summary": "该文档似乎是一份数据记录，可能是用于检查文本字符串中 ANSI 控制码和转义序列的工具或脚本的输出。其主要关注点在于分析和描述输入字符串中存在的 ANSI 转义序列。\n\n提供的示例，如“ls/ezablockstest runhyperlinksoctal8-bitcommandsstylesmixedcolors”，是正在被分析的输入。随后的数据点描述了在这些输入中发现的特征。\n\n分析的关键特征包括：\n\n*   **length:** 输入字符串的长度（在提供的提取中为 0）。\n*   **rows/columns:** 文本在终端或类似显示器中解释时的尺寸。\n*   **invert, grid:** 布尔标志，可能指示 ANSI 序列是否涉及反转颜色或绘制网格。\n*   **count:** 特定代码的出现次数。\n*   **duplicates:** 是否存在重复的 ANSI 转义序列。\n*   **sort, code, mnemonic, description, plain text, map position, newlines, greedy:** 这些字段表明一种结构化的分析，可能涉及排序、按 ANSI 代码分类、提供代码助记符和描述、提取纯文本、映射其位置以及分析它们如何处理换行符或贪婪地消耗字符。\n\n本质上，这份数据捕获了解析和分析字符串中 ANSI 转义序列的结果，提供了关于序列类型、频率和其他特征的元数据。提供的示例突出了特定的 ANSI 相关功能，如超链接、八进制颜色代码、8 位命令、样式和混合颜色使用。"
  },
  {
    "id": "44596472",
    "title": "My experience with Claude Code after two weeks of adventures",
    "url": "https://sankalp.bearblog.dev/my-claude-code-experience-after-2-weeks-of-usage/",
    "summary": "Sankalp details his two-week experience with Claude Code (CC) after switching from Cursor, another AI-powered coding assistant. He initially used Cursor extensively, leveraging its API access for code generation, understanding codebases, and asking questions. However, rate limiting pushed him towards Claude Code.\n\nHe found CC, accessed via a $20 subscription for Sonnet 4, to be effective 90% of the time. He later upgraded to the $200 Claude Max subscription for unlimited Sonnet 4 and Opus 4 access. The majority of his work with CC was on Python and Ruby + Typescript codebases with specs and e2e tests, enabling a feedback loop for debugging.\n\nHis workflow evolved from simple typing to utilizing commands, particularly after discovering Shift+Tab for switching between plan mode (Opus) and auto-edit mode (Sonnet 4). He highlights the importance of context management, using files within the `.claude` folder to document changes and restarting chats upon compaction. He also found the resume feature a week into using the tool.\n\nSankalp observed that Sonnet felt better in CC than Cursor, likely due to post-training and superior \"tool call\" selection, as well as more efficient context management. CC also utilizes \"subagents\" for better context handling. While Cursor's search was faster, CC enables multi-threaded task execution.\n\nHe shares tips such as using `!` for bash commands, discovering file @-mentioning, and leveraging the memorize function for custom instructions. He finds Sonnet sufficient for most tasks but switches to Opus for difficult bugs. He also expresses interest in custom commands, automating frontend development, and exploring multi-agent systems. Ultimately, he considers CC a powerful tool despite a steeper learning curve compared to Cursor.\n",
    "chinese_title": "两个星期探索后，我的Claude Code使用体验",
    "chinese_summary": "Sankalp 详细介绍了他在从 Cursor (另一款 AI 驱动的代码助手) 切换到 Claude Code (CC) 后，为期两周的使用体验。他最初广泛使用 Cursor，利用其 API 访问权限进行代码生成、理解代码库和提出问题。然而，速率限制促使他转向 Claude Code。\n\n他发现通过每月 20 美元的 Sonnet 4 订阅访问的 CC，在 90% 的情况下都是有效的。 后来，他升级到每月 200 美元的 Claude Max 订阅，以获得无限的 Sonnet 4 和 Opus 4 访问权限。 他与 CC 的大部分工作都在 Python 和 Ruby + Typescript 代码库上进行，这些代码库带有规范和 e2e 测试，从而实现了调试的反馈循环。\n\n他的工作流程从简单的打字演变为利用命令，尤其是在发现 Shift+Tab 可以在计划模式 (Opus) 和自动编辑模式 (Sonnet 4) 之间切换之后。 他强调了上下文管理的重要性，使用 `.claude` 文件夹中的文件来记录更改，并在压缩时重新启动聊天。 他还在使用该工具一周后发现了恢复功能。\n\nSankalp 观察到，在 CC 中 Sonnet 的表现比在 Cursor 中更好，这可能是由于后训练和更出色的“工具调用”选择，以及更有效的上下文管理。 CC 还利用“子代理”来更好地处理上下文。 虽然 Cursor 的搜索速度更快，但 CC 能够执行多线程任务。\n\n他分享了一些技巧，例如使用 `!` 执行 bash 命令，发现文件 @提及，以及利用记忆功能进行自定义指令。 他发现 Sonnet 足以完成大多数任务，但在处理困难的 bug 时会切换到 Opus。 他还对自定义命令、自动化前端开发和探索多代理系统表达了兴趣。 最终，他认为 CC 是一款功能强大的工具，尽管与 Cursor 相比，学习曲线更为陡峭。"
  },
  {
    "id": "44595811",
    "title": "All AI models might be the same",
    "url": "https://blog.jxmo.io/p/there-is-only-one-model",
    "summary": "This article explores the \"Platonic Representation Hypothesis\" (PRH), which proposes that as AI models grow larger and more sophisticated, they converge towards learning similar, underlying representations of the world. The author supports this idea by drawing parallels between AI's compression capabilities and its ability to generalize, suggesting that there's a singular, optimal way to compress and represent data.\n\nThe author presents evidence for the PRH from diverse areas, including:\n\n*   **Language Modeling:** Demonstrating that better language models achieve better compression, hinting at a shared understanding of the world.\n*   **Embedding Inversion:** Discussing the challenge of reconstructing input text from neural network embeddings and showcasing a method called \"vec2vec\" to map between different embedding spaces without direct correspondence.\n*   **Mechanistic Interpretability:** Highlighting research that identifies remarkably similar functionalities (\"circuits\") in different models and the potential of Sparse Autoencoders (SAEs) to discover overlapping features.\n\nThe article argues that the PRH has practical implications. It suggests that a universal embedding inverter could be built, which can translate between different models and even potentially decode ancient texts or animal languages. The author concludes by emphasizing the philosophical and practical significance of the PRH, anticipating that further research will uncover even more similarities between AI models as they continue to evolve.\n",
    "chinese_title": "所有人工智能模型可能都是一样的",
    "chinese_summary": "本文探讨“柏拉图表征假说”(PRH)，该假说认为随着人工智能模型变得更大更复杂，它们会趋于学习相似的、对世界的底层表征。作者通过将人工智能的压缩能力与其泛化能力进行类比来支持这一观点，暗示存在一种独特的、最佳的压缩和表示数据的方式。\n\n作者从多个领域提出了支持PRH的证据，包括：\n\n*   **语言建模：** 证明更好的语言模型能实现更好的压缩，暗示了一种对世界的共同理解。\n*   **嵌入反演：** 讨论了从神经网络嵌入重建输入文本的挑战，并展示了一种名为“vec2vec”的方法，该方法可以在不同的嵌入空间之间进行映射，而无需直接对应。\n*   **机制可解释性：** 强调了识别不同模型中非常相似的功能（“电路”）的研究，以及稀疏自编码器 (SAEs) 发现重叠特征的潜力。\n\n文章认为PRH具有实际意义。它表明可以构建一个通用的嵌入反演器，该反演器可以在不同的模型之间进行转换，甚至可以潜在地解码古代文本或动物语言。作者最后强调了PRH的哲学和实践意义，并预计随着人工智能模型的不断发展，未来的研究将揭示它们之间更多的相似之处。"
  },
  {
    "id": "44588319",
    "title": "Perfume reviews",
    "url": "https://gwern.net/blog/2025/perfume",
    "summary": "This article is a personal account of the author's exploration into the world of perfume, particularly focusing on \"avant-garde\" fragrances. The author describes their experience with sampling a variety of perfumes, noting both what they enjoyed and what they disliked. Ultimately, after this period of experimentation, the author settled on two specific perfumes which they purchased for themselves: Acqua di Sale and Kyoto Incense. The article essentially summarizes the author's journey from dabbling in perfume samples to making informed choices about fragrances they wanted to personally own.\n",
    "chinese_title": "香水测评",
    "chinese_summary": "本文是作者对香水世界，特别是“前卫”香水探索的个人叙述。作者描述了他们尝试各种香水的经历，记录了他们喜欢和不喜欢的地方。最终，经过这段实验期，作者选定了两款他们购买的特定香水：Acqua di Sale和Kyoto Incense。本文主要概括了作者从尝试香水样品到对他们想要亲自拥有的香水做出明智选择的旅程。"
  },
  {
    "id": "44607252",
    "title": "Starbase injury rates outpace rivals as SpaceX chases its Mars moonshot",
    "url": "https://techcrunch.com/2025/07/18/starbase-injury-rates-outpace-rivals-as-spacex-chases-its-mars-moonshot/",
    "summary": "This TechCrunch article investigates the high injury rates at SpaceX's Starbase facility in Texas, where the company is developing its Starship rocket. According to OSHA data, Starbase's Total Recordable Incident Rate (TRIR) in 2024 was significantly higher than both the average for space vehicle manufacturing and aerospace manufacturing as a whole. The article highlights that Starbase's injury rate has been consistently elevated since 2019, despite improvements in safety processes across the industry.\n\nWhile SpaceX's other manufacturing facilities generally have lower TRIRs, they still often exceed industry averages. The article notes that of 14 OSHA inspections at SpaceX in the last four years, six involved accidents and injuries at Starbase, including serious incidents like amputations and crane collapses.\n\nThe piece points out that NASA relies on Starship for its upcoming lunar missions and has clauses in its contracts with SpaceX to address major safety breaches. Despite the high TRIR, NASA maintains that it's in regular contact with SpaceX to ensure safety. The article compares Starbase's TRIR to those of other rocket manufacturers, like ULA and Blue Origin, revealing Starbase's higher injury rate. The article also mentions a debate within the safety community regarding the reliability of TRIR as a measure of safety performance.\n",
    "chinese_title": "SpaceX追逐火星登月目标之际，星际基地的受伤率超过竞争对手。",
    "chinese_summary": "TechCrunch文章调查显示SpaceX星舰基地事故率高企：德州星舰基地开发项目事故频发，2024年总记录事故率远高于航天器及航空航天制造业平均水平，且自2019年以来居高不下。SpaceX其他工厂事故率虽较低，但仍常超行业平均。过去四年14次OSHA检查中，6次涉及星舰基地事故，包括截肢和起重机倒塌等严重事故。NASA依赖星舰执行登月任务，合同包含应对重大安全事故条款。虽事故率高企，NASA称与SpaceX保持联系以确保安全。文章对比星舰基地与ULA和蓝色起源等火箭制造商的事故率，揭示星舰基地事故率更高，并提及安全界对总记录事故率作为安全绩效指标可靠性的争论。"
  },
  {
    "id": "44568594",
    "title": "DIY Telescope Mods That Transformed My Astrophotography",
    "url": "https://www.youtube.com/watch?v=Efmzr_K4ApQ",
    "summary": "The article, titled \"DIY Telescope Mods That Transformed My Astrophotography,\" focuses on improving astrophotography results through self-made modifications to a telescope. However, the provided content is irrelevant to the title and topic. Instead, it's simply the standard YouTube footer information including copyright, contact, creator information, privacy policy, terms, and other platform-related data.\n\nTherefore, based on the content provided, it's impossible to summarize the astrophotography-related modifications. The content does not offer any information about specific modifications, their impact, or the reasons for implementing them. Essentially, the title promises information about DIY telescope upgrades for astrophotography, but the content delivers unrelated boilerplate text from YouTube.\n",
    "chinese_title": "改造我的天文望远镜，提升我的天体摄影水平",
    "chinese_summary": "文章标题为“DIY望远镜改装提升我的天文摄影效果”，本应聚焦于通过自行改造望远镜来改善天文摄影效果。然而，提供的内容与标题和主题无关。实际上，它只是标准的YouTube页脚信息，包括版权、联系方式、创作者信息、隐私政策、条款以及其他平台相关数据。\n\n因此，基于提供的内容，无法总结与天文摄影相关的改装。内容没有提供关于具体改装、它们的影响或实施原因的任何信息。本质上，标题承诺提供关于DIY望远镜升级以用于天文摄影的信息，但内容提供的却是来自YouTube的无关样板文字。"
  },
  {
    "id": "44569278",
    "title": "TCP-in-UDP Solution (eBPF)",
    "url": "https://blog.mptcp.dev/2025/07/14/TCP-in-UDP.html",
    "summary": "This article introduces a novel TCP-in-UDP solution implemented with eBPF to overcome network middleboxes that block or modify TCP extensions like MPTCP. The solution tunnels TCP connections inside UDP packets without adding extra data per packet or requiring a VPN.\n\nThe core idea is to reorder the TCP header to resemble a UDP header, effectively converting TCP packets into UDP while preserving essential information like sequence and acknowledgment numbers. The Urgent Pointer is sacrificed due to its rare usage and middlebox interference.\n\nThe article details challenges encountered in a highly optimized Linux network stack, including accessing all necessary packet data (SKB), managing GRO/TSO/GSO features that interfere with per-packet translation, and accurately calculating checksums.  The solution disables hardware offload accelerations and software segmentation. The article also emphasizes the importance of correctly updating checksums when switching between TCP and UDP, using eBPF helpers and a TC ACT_CSUM action as a workaround for a kernel limitation.\n\nFinally, the article addresses the need to manage MTU/MSS settings due to the change from TCP to UDP, potentially requiring adjustments to avoid IP fragmentation. The conclusion highlights the easy deployment of the eBPF program on client and server sides, offering a practical method to bypass network restrictions.\n",
    "chinese_title": "基于eBPF的TCP over UDP 方案",
    "chinese_summary": "本文介绍了一种使用 eBPF 实现的新型 TCP-in-UDP 解决方案，旨在克服网络中间盒对 MPTCP 等 TCP 扩展的阻断或修改。该方案将 TCP 连接封装在 UDP 数据包中，无需增加每个数据包的额外数据或 VPN。\n\n核心思想是重新排列 TCP 头部，使其类似于 UDP 头部，从而有效地将 TCP 数据包转换为 UDP 数据包，同时保留序列号和确认号等关键信息。由于紧急指针的使用频率较低且易受中间盒干扰，因此将其舍弃。\n\n本文详细介绍了在高优化的 Linux 网络栈中遇到的挑战，包括访问所有必需的数据包数据 (SKB)、管理干扰每个数据包转换的 GRO/TSO/GSO 功能以及准确计算校验和。该解决方案禁用了硬件卸载加速和软件分段。本文还强调了在 TCP 和 UDP 之间切换时正确更新校验和的重要性，并使用 eBPF 助手和 TC ACT_CSUM 操作作为内核限制的解决方法。\n\n最后，本文讨论了由于从 TCP 更改为 UDP 而导致的 MTU/MSS 设置管理需求，可能需要调整以避免 IP 分片。结论强调了 eBPF 程序在客户端和服务器端的易于部署性，提供了一种绕过网络限制的实用方法。"
  },
  {
    "id": "44600594",
    "title": "NIH is cheaper than the wrong dependency",
    "url": "https://lewiscampbell.tech/blog/250718.html",
    "summary": "This article argues that relying on external dependencies in coding is often more costly than it appears, and that the \"Not Invented Here\" (NIH) principle can be a valid approach in certain situations. It challenges the common assumption that dependencies provide free functionality, highlighting hidden costs like learning curves, breaking changes, deployment complexities (e.g., containerization), and potential security risks.\n\nThe article uses Tigerbeetle as an example, a financial database written with zero dependencies to avoid these problems. It then introduces a framework for evaluating dependencies based on five key categories: Ubiquity (availability), Stability (frequency of breaking changes), Depth (functionality provided), Ergonomics (ease of use), and Watertightness (abstraction quality). Dependency peddlers usually focus on ergonomics, ignoring other costs.\n\nThe author illustrates the framework with examples of \"good\" dependencies, such as POSIX system calls, ECMA-48 Terminal Control Codes, and the Web Platform. These are considered good because they score well across all categories: they are widely available, stable, provide deep functionality, and offer reasonable abstractions. The article leaves the evaluation of \"bad\" dependencies as an exercise for the reader, encouraging critical thinking about the true costs and benefits of each dependency choice. The core message is to evaluate dependencies holistically, considering not just the immediate benefits, but also the long-term costs and complexities they introduce.\n",
    "chinese_title": "与其用错误的依赖，不如自己造轮子（NIH)",
    "chinese_summary": "依赖的代价：为何“非我发明”原则有时是合理的"
  },
  {
    "id": "44604692",
    "title": "Show HN: Mock FedCM Integrations",
    "url": "https://mockfedcm.com/",
    "summary": "MockFedCM is a free and simple tool for developers to test and debug FedCM (Federated Credentials Management) integrations. It provides both a mock Relying Party (RP) and Identity Provider (IdP), allowing developers to simulate authentication flows and validate user experiences without needing a real-world production environment. This makes it easy to debug implementations and understand the FedCM workflow within Chromium-based browsers. Importantly, the tool is explicitly intended for testing purposes only and should not be used in production environments.\n",
    "chinese_title": "展示HN：模拟联邦凭据管理集成",
    "chinese_summary": "MockFedCM：用于测试和调试FedCM集成的免费简易工具，提供模拟的依赖方(RP)和身份提供方(IdP)，允许开发者模拟认证流程并验证用户体验，无需真实的生产环境。这便于调试实现并在基于Chromium的浏览器中理解FedCM工作流程。请注意，该工具仅用于测试目的，不应在生产环境中使用。"
  },
  {
    "id": "44605610",
    "title": "The Number go up rule: Why America refuses to fix anything",
    "url": "https://www.thebignewsletter.com/p/the-number-go-up-rule-why-america",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "数字上涨法则：为何美国拒绝修复任何事物",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "44561895",
    "title": "Extending That XOR Trick to Billions of Rows",
    "url": "https://nochlin.com/blog/extending-that-xor-trick",
    "summary": "This article explains how the XOR trick, useful for finding missing numbers in a list, can be generalized to handle thousands of missing IDs in large datasets using Invertible Bloom Filters (IBFs). The author builds the concept from the XOR trick, introducing partitioning and hash functions to handle more than one or two missing numbers.\n\nThe article highlights the limitations of naive partitioning and introduces the concept of symmetric difference, using hash accumulators to detect unreliable XOR results. This leads to the core idea of IBFs: a robust data structure for set reconciliation.\n\nIBFs consist of cells with accumulators for `idSum`, `hashSum`, and `count`. They support `Encode`, `Subtract`, and `Decode` operations. The `Subtract` operation cancels out identical values, focusing on the symmetric difference. The `Decode` operation iteratively recovers values by identifying \"pure\" cells. The size of the IBF is determined by the expected size of the symmetric difference.\n\nThe article provides a Python implementation of an IBF. It concludes by positioning IBFs within the broader context of \"set reconciliation\" and mentions alternative approaches like error-correction codes. The author provides references and \"Further Reading\" section with links to advanced papers regarding IBLTs, multi-party set reconciliation, simple set sketching, and practical rateless set reconciliation.\n",
    "chinese_title": "将 XOR 技巧扩展到数十亿行",
    "chinese_summary": "本文解释了如何将异或技巧（XOR trick）推广到使用可逆布隆过滤器（IBFs）处理大型数据集中数千个缺失ID的情况。异或技巧常用于查找列表中的缺失数字。作者从异或技巧的概念出发，引入分区和哈希函数来处理多个缺失数字。\n\n文章强调了简单分区的局限性，并介绍了对称差的概念，利用哈希累加器来检测不可靠的异或结果。这引出了IBFs的核心思想：一种用于集合协调的强大数据结构。\n\nIBFs由包含`idSum`、`hashSum`和`count`累加器的单元格组成。它们支持`Encode`、`Subtract`和`Decode`操作。`Subtract`操作会消除相同的值，从而专注于对称差。`Decode`操作通过识别“纯”单元格来迭代恢复值。IBF的大小由对称差的预期大小决定。\n\n文章提供了一个IBF的Python实现。最后，文章将IBFs定位在更广泛的“集合协调”范畴内，并提到了错误纠正码等替代方法。作者提供了参考文献和“延伸阅读”部分，其中包含指向有关IBLT、多方集合协调、简单集合草图和实用无率集合协调的高级论文的链接。"
  },
  {
    "id": "44599549",
    "title": "My favorite use-case for AI is writing logs",
    "url": "https://newsletter.vickiboykis.com/archive/my-favorite-use-case-for-ai-is-writing-logs/",
    "summary": "This article highlights the author's appreciation for JetBrains' Full Line Code Completion (FLCC) feature in PyCharm and GoLand, particularly its utility in generating effective logs for debugging and production. The author emphasizes the cognitive overhead of manually writing logs, especially when dealing with complex data structures. FLCC intelligently infers log completions based on surrounding code, improving clarity and conciseness.\n\nThe article details the technical implementation of FLCC, focusing on the constraints and optimizations required for an on-device model. Key aspects include:\n\n*   **Model Training:** A GPT-2-style transformer model (later switched to Llama2) is trained on a subset of \"The Stack\" code dataset, with preprocessing steps to remove comments and handle indentation.\n*   **Quantization and Optimization:** The model is quantized to INT8 and served as an ONNX RT artifact, enabling CPU inference and reducing memory footprint.\n*   **Inference:** Beam search is used to generate code completions, with caching strategies to improve performance.\n\nThe author stresses that FLCC's focus on a specific task (code completion) allows for a smaller, more efficient model compared to general-purpose LLMs. The article concludes by highlighting the value of both large and small AI models, emphasizing the potential for specialized AI solutions like FLCC to enhance developer productivity. The author also notes the thoughtfulness of the user experience, as the generated logs are often concise and useful enough to be kept in production code.\n",
    "chinese_title": "我最喜欢的AI应用是编写日志。",
    "chinese_summary": "本文重点介绍了作者对JetBrains PyCharm和GoLand中全行代码补全(FLCC)功能的赞赏，特别是其在生成有效的调试和生产日志方面的效用。作者强调了手动编写日志的认知负担，尤其是在处理复杂数据结构时。FLCC能够基于周围的代码智能地推断日志补全，从而提高清晰度和简洁性。\n\n文章详细介绍了FLCC的技术实现，重点介绍了设备端模型所需的约束和优化。关键方面包括：\n\n*   **模型训练：** 使用GPT-2风格的Transformer模型（后来切换到Llama2）在“The Stack”代码数据集的子集上进行训练，并进行预处理步骤以删除注释和处理缩进。\n*   **量化和优化：** 该模型被量化为INT8，并作为ONNX RT工件提供服务，从而实现CPU推理并减少内存占用。\n*   **推理：** 使用束搜索来生成代码补全，并采用缓存策略来提高性能。\n\n作者强调，与通用LLM相比，FLCC专注于特定任务（代码补全）使其能够使用更小、更高效的模型。文章最后强调了大型和小型AI模型的价值，并强调了像FLCC这样的专业AI解决方案在提高开发者生产力方面的潜力。作者还指出用户体验的周到性，因为生成的日志通常足够简洁和有用，可以保留在生产代码中。"
  },
  {
    "id": "44565763",
    "title": "The End of Windows 10: a toolkit for community repair groups",
    "url": "https://therestartproject.org/end-of-windows-10-toolkit-for-repair-groups/",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "Windows 10 的终结：社区维修小组工具包",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "44605398",
    "title": "GH Killing Command Palette for \"low usage\"",
    "url": "https://github.com/orgs/community/discussions/166528",
    "summary": "This GitHub Community post from July 17, 2025, expresses strong opposition to GitHub's plan to remove the Command Palette feature due to perceived low usage. Users argue that the Command Palette is a highly valuable tool for keyboard-driven navigation, boosting productivity and accessibility, especially for users with motor impairments.\n\nThe core complaint revolves around GitHub's handling of the feature. It was tucked away behind a \"feature preview\" flag without promotion, leading to low awareness and consequently, low adoption. Furthermore, the feature was automatically disabled for some users who had previously enabled it, further hindering its uptake.  Users argue that these factors, rather than a lack of inherent value, are the reason for the low usage.\n\nCommenters highlight the Command Palette's effectiveness in quickly switching between repositories and pages, a functionality not easily replicated by other means.  They point to similar features in other popular platforms like Slack and Atlassian, emphasizing the Command Palette's usefulness as a standard feature. Several users express that they only recently discovered the feature and now rely on it heavily.\n\nAlternative solutions like browser bookmarks, Raycast, and user scripts are suggested, but they are seen as less comprehensive than the Command Palette.  Many users urge GitHub to reconsider the removal, promote the feature, and give it a chance to gain wider adoption before sunsetting it. They feel that its current state doesn't reflect its potential value to the GitHub community.\n",
    "chinese_title": "因“低使用率”而移除 GH Killing 命令面板",
    "chinese_summary": "这份2025年7月17日发布的GitHub社区帖子强烈反对GitHub移除命令面板功能的计划，原因是他们认为使用率低。用户认为命令面板是键盘驱动导航的宝贵工具，可以提高生产力和可访问性，尤其对于有运动障碍的用户而言。\n\n核心抱怨围绕着GitHub对该功能的处理方式。该功能被隐藏在“功能预览”标志后，没有宣传，导致知晓率低，进而导致采用率低。此外，该功能还会自动禁用一些之前启用它的用户，进一步阻碍了其推广。用户认为，导致使用率低的原因是这些因素，而非功能本身缺乏价值。\n\n评论者强调了命令面板在快速切换仓库和页面方面的效率，这种功能很难通过其他方式复制。他们提到了Slack和Atlassian等其他流行平台中的类似功能，强调了命令面板作为标准功能的实用性。一些用户表示，他们最近才发现该功能，现在非常依赖它。\n\n帖子中提出了浏览器书签、Raycast和用户脚本等替代方案，但这些方案不如命令面板全面。许多用户敦促GitHub重新考虑移除计划，推广该功能，并在将其停用之前，给它一个机会获得更广泛的采用。他们认为，该功能目前的状态并不能反映它对GitHub社区的潜在价值。"
  },
  {
    "id": "44595492",
    "title": "ChatGPT agent: bridging research and action",
    "url": "https://openai.com/index/introducing-chatgpt-agent/",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "ChatGPT智能体：连接研究与实践",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "44600574",
    "title": "Fixing a Direct3D9 bug in Far Cry (2018)",
    "url": "https://houssemnasri.github.io/2018/07/07/farcry-d3d9-bug/",
    "summary": "This article details the discovery and fix of a long-standing bug in the 2004 game Far Cry, specifically broken water reflections on systems newer than Windows XP. The bug manifested as landmasses failing to reflect in water, significantly degrading the visual quality compared to the original experience.\n\nThe author, after noticing the issue, used the PIX graphics debugger to analyze the rendering process on both working (XP) and broken (Windows 10) systems. The investigation revealed that Direct3D9's handling of Clip Planes, a feature used to customize the view frustum, was the root cause. This feature is now emulated on modern hardware due to its rare usage.\n\nThe debugging process showed that the texture used for water reflections was rendered differently between Windows XP and Windows 10, even when using the same PIX capture. The author discovered the game used clip planes to prevent underwater models from appearing in the water reflections. Disabling clip planes entirely fixed the landmass reflections but introduced underwater artifacts.\n\nThe author theorized a regression in the D3D9 implementation stemming from the Windows Vista display driver model (WDDM). The fix involved saving and reapplying the requested clip planes before each draw call. This seemingly simple solution completely resolved the broken water reflections without a performance penalty.\n\nThe author admits that the exact cause of the clip plane invalidation remains unknown, but the implemented workaround is effective and efficient. The source code for the fix has been released on GitHub, allowing others to use it as a reference.\n",
    "chinese_title": "修复孤岛惊魂(2018)中的Direct3D9漏洞",
    "chinese_summary": "本文详述了2004年游戏《孤岛惊魂》中一个长期存在的bug的发现与修复，具体而言，是在Windows XP之后的新系统上水面反射失效的问题。该bug表现为陆地无法在水中反射，与原始体验相比，视觉质量显著下降。\n\n作者在注意到这个问题后，使用PIX图形调试器分析了在正常运行（XP）和损坏（Windows 10）系统上的渲染过程。调查显示，Direct3D9对剪裁平面（用于自定义视锥体的功能）的处理是根本原因。由于其罕见的使用，此功能现在在现代硬件上被模拟。\n\n调试过程表明，即使使用相同的PIX捕获，Windows XP和Windows 10之间用于水面反射的纹理渲染方式也不同。作者发现游戏使用剪裁平面来防止水下模型出现在水面反射中。完全禁用剪裁平面修复了陆地反射，但也引入了水下伪影。\n\n作者推测，D3D9实现中的回归源于Windows Vista显示驱动程序模型（WDDM）。 修复方案包括在每次绘制调用之前保存并重新应用所请求的剪裁平面。 这个看似简单的解决方案彻底解决了水面反射失效的问题，且没有性能损失。\n\n作者承认剪裁平面失效的确切原因仍然未知，但所实施的解决方法是有效且高效的。 修复程序的源代码已在GitHub上发布，允许其他人将其用作参考。"
  },
  {
    "id": "44568147",
    "title": "A look at IBM's short-lived \"butterfly\" ThinkPad 701 of 1995",
    "url": "https://www.fastcompany.com/91356463/ibm-thinkpad-701-butterfly-keyboard",
    "summary": "The Fast Company article \"A look at IBM's short-lived \"butterfly\" ThinkPad 701 of 1995\" highlights the iconic and innovative design of the IBM ThinkPad 701, particularly its unique \"butterfly\" keyboard. Launched in 1995, the ThinkPad 701 was groundbreaking because it managed to fit a full-size keyboard into a remarkably compact laptop chassis.\n\nThe article emphasizes the engineering ingenuity behind the design: the keyboard was split into two interlocking pieces that would automatically extend and retract as the laptop was opened and closed. This allowed for a comfortable typing experience within a smaller footprint.\n\nWhile lauded for its innovation, the ThinkPad 701 was relatively short-lived, partly due to its complexity and the emergence of other design approaches that achieved similar goals with less intricate mechanisms. Despite its brief market presence, the article argues that the ThinkPad 701 has achieved legendary status among tech enthusiasts and collectors for its bold and memorable design. It represents a period of experimentation and creative problem-solving in the early days of laptop development and showcases IBM's commitment to pushing the boundaries of what was possible. The article concludes that the ThinkPad 701 remains a testament to the power of innovative design and its lasting impact on the evolution of portable computing.\n",
    "chinese_title": "对IBM昙花一现的1995年“蝴蝶”ThinkPad 701的回顾",
    "chinese_summary": "《快公司》文章“回顾IBM昙花一现的1995年‘蝴蝶’ThinkPad 701”重点介绍了IBM ThinkPad 701标志性和创新性的设计，尤其是其独特的“蝴蝶”键盘。 ThinkPad 701于1995年推出，具有开创性意义，因为它成功地将全尺寸键盘装入了一个非常紧凑的笔记本电脑机箱中。\n\n这篇文章强调了该设计背后的工程独创性：键盘被分成两个相互锁定的部分，它们会在笔记本电脑打开和关闭时自动伸展和收缩。这使得在较小的占地面积内也能获得舒适的打字体验。\n\n虽然ThinkPad 701因其创新而备受赞誉，但其生命周期相对较短，部分原因是其复杂性以及其他以不那么复杂的机制实现类似设计目标的方法的出现。尽管其市场存在时间很短，但文章认为，ThinkPad 701凭借其大胆而令人难忘的设计，在科技爱好者和收藏家中获得了传奇般的地位。它代表了笔记本电脑发展初期的一个实验和创造性解决问题的时期，并展示了IBM致力于突破可能性的界限。文章最后总结道，ThinkPad 701仍然证明了创新设计的力量及其对便携式计算发展的持久影响。"
  },
  {
    "id": "44594156",
    "title": "Mistral Releases Deep Research, Voice, Projects in Le Chat",
    "url": "https://mistral.ai/news/le-chat-dives-deep",
    "summary": "Mistral AI has released significant updates to its Le Chat AI assistant, making it more powerful and versatile. Key additions include:\n\n*   **Deep Research (Preview):** This mode transforms Le Chat into a structured research assistant, enabling it to analyze complex topics, gather credible sources, and generate reference-backed reports.\n*   **Voice Mode:** Powered by the new Voxtral model, this allows users to interact with Le Chat using voice commands for hands-free use.\n*   **Natively Multilingual Reasoning:** Leveraging the Magistral reasoning model, Le Chat now provides thoughtful answers and can code-switch between languages mid-sentence.\n*   **Projects:** This feature organizes conversations into context-rich folders, enabling users to group related chats, upload files, and maintain specific tool settings within each project.\n*   **Advanced Image Editing:** In partnership with Black Forest Labs, Le Chat now offers direct image editing capabilities with prompts like \"remove the object,\" preserving characters and details across edits.\n\nThese features are designed to enhance research capabilities, improve natural interaction through voice, support multilingual reasoning, provide organizational tools, and expand creative possibilities. Users can access these new functionalities on the Le Chat web platform and mobile apps. Mistral AI is also offering Le Chat Enterprise for organizational solutions and has open job positions.\n",
    "chinese_title": "Mistral 在 Le Chat 发布深度研究、语音和项目",
    "chinese_summary": "Mistral AI发布Le Chat AI助手重大更新，使其更强大且用途更广。主要新增功能包括：\n\n*   **深度研究（预览版）：** 此模式将Le Chat转变为结构化的研究助手，使其能够分析复杂主题、收集可靠来源并生成带有参考文献的报告。\n*   **语音模式：** 由新的Voxtral模型驱动，允许用户使用语音命令与Le Chat交互，实现免提使用。\n*   **原生多语言推理：** 利用Magistral推理模型，Le Chat现在可以提供深思熟虑的答案，并且可以在句子中间切换语言。\n*   **项目：** 此功能将对话组织到上下文丰富的文件夹中，使用户能够对相关聊天进行分组、上传文件并在每个项目中维护特定的工具设置。\n*   **高级图像编辑：** 与Black Forest Labs合作，Le Chat现在提供直接图像编辑功能，例如“移除物体”，并在编辑过程中保留角色和细节。\n\n这些功能旨在增强研究能力，通过语音改善自然交互，支持多语言推理，提供组织工具，并扩展创造性可能性。用户可以在Le Chat Web平台和移动应用程序上访问这些新功能。 Mistral AI还为组织解决方案提供Le Chat Enterprise，并提供开放职位。"
  },
  {
    "id": "44569367",
    "title": "RisingWave: An Open‑Source Stream‑Processing and Management Platform",
    "url": "https://github.com/risingwavelabs/risingwave",
    "summary": "RisingWave is an open-source stream processing and management platform designed for real-time data analysis, offering a cost-effective and user-friendly experience. It leverages a Postgres-compatible SQL interface and DataFrame-style Python interface, allowing users to ingest millions of events per second, perform real-time joins and analysis, and deliver fresh results to Apache Iceberg or other systems.\n\nRisingWave integrates stream processing, storage, and open-format persistence, supporting ingestion, real-time processing, and delivery. Its key advantages include PostgreSQL compatibility for seamless integration, S3 as primary storage for high performance and dynamic scaling, elastic disk cache for reduced latency and cost, and native Apache Iceberg support for efficient data lake integration.\n\nThe platform excels in use cases like streaming analytics, event-driven applications, real-time data enrichment, and feature engineering. It offers deployment options through RisingWave Cloud, Docker, and Kubernetes.\n\nRisingWave prioritizes ease of use and cost-efficiency by eliminating manual state tuning and optimizing for complex queries. The project welcomes community contributions and is licensed under Apache License 2.0. Usage statistics are collected anonymously to improve the product, with an option to opt-out.\n",
    "chinese_title": "RisingWave：一个开源的流处理和管理平台",
    "chinese_summary": "RisingWave 是一个开源的流处理和管理平台，专为实时数据分析而设计，提供经济高效且用户友好的体验。它利用兼容 Postgres 的 SQL 接口和 DataFrame 风格的 Python 接口，允许用户每秒摄取数百万个事件，执行实时连接和分析，并将最新结果交付到 Apache Iceberg 或其他系统。\n\nRisingWave 集成了流处理、存储和开放格式持久化，支持摄取、实时处理和交付。它的主要优势包括：PostgreSQL 兼容性以实现无缝集成，S3 作为主要存储以实现高性能和动态扩展，弹性磁盘缓存以降低延迟和成本，以及原生 Apache Iceberg 支持以实现高效的数据湖集成。\n\n该平台擅长流式分析、事件驱动应用、实时数据丰富和特征工程等用例。它提供通过 RisingWave Cloud、Docker 和 Kubernetes 进行部署的选项。\n\nRisingWave 优先考虑易用性和成本效益，通过消除手动状态调优和优化复杂查询来实现。该项目欢迎社区贡献，并根据 Apache License 2.0 获得许可。匿名收集使用情况统计信息以改进产品，并提供退出选项。"
  },
  {
    "id": "44606646",
    "title": "LibreOffice slams Microsoft for locking in Office users w/ complex file formats",
    "url": "https://www.neowin.net/news/libreoffice-calls-out-microsoft-for-using-complex-file-formats-to-lock-in-office-users/",
    "summary": "LibreOffice is accusing Microsoft of intentionally using unnecessarily complex file formats within its Microsoft 365 (Office) suite to lock users into its ecosystem. The core of the argument revolves around the use of XML, a markup language intended to foster interoperability. While both LibreOffice (using ODF - .odt, .ods) and Microsoft (using OOXML - .docx, .xlsx) employ XML within their respective file formats, LibreOffice claims that Microsoft's implementation is excessively intricate.\n\nLibreOffice argues that Microsoft's XML schema is so complex, with deeply nested structures, unintuitive naming conventions, and numerous optional elements, that it acts as a barrier to entry for other developers. This complexity makes it difficult for competing office suites to fully and accurately interpret and work with Microsoft Office files.\n\nLibreOffice likens this to a railway system with public tracks but a control system so convoluted that only one company's trains can operate on it. They assert that even simple sentences become mazes of nested tags, making parsing difficult for anyone outside of Microsoft.\n\nFurthermore, LibreOffice connects this file format lock-in to Microsoft's push for Windows 11, suggesting that the upgrade is not driven by genuine technical necessity but rather to further entrench users within the Microsoft ecosystem. As a result, LibreOffice is actively encouraging users to migrate to Linux and LibreOffice as an alternative.\n",
    "chinese_title": "LibreOffice抨击微软利用复杂文件格式锁定Office用户",
    "chinese_summary": "LibreOffice指责微软故意在其Microsoft 365 (Office)套件中使用不必要地复杂的文件格式，以将用户锁定在其生态系统中。 争论的核心在于XML的使用，这是一种旨在促进互操作性的标记语言。 虽然LibreOffice（使用ODF - .odt, .ods）和Microsoft（使用OOXML - .docx, .xlsx）都在各自的文件格式中使用XML，但LibreOffice声称微软的实现过于复杂。\n\nLibreOffice认为，微软的XML模式非常复杂，具有深度嵌套的结构、不直观的命名约定和大量的可选元素，这构成了其他开发者进入的障碍。 这种复杂性使得竞争的办公套件难以完全准确地解释和使用Microsoft Office文件。\n\nLibreOffice将此比作一个拥有公共轨道的铁路系统，但其控制系统过于复杂，只有一家公司的火车才能在其上运行。 他们断言，即使是简单的句子也变成了嵌套标签的迷宫，使得微软以外的任何人都难以解析。\n\n此外，LibreOffice将这种文件格式锁定与微软推动Windows 11联系起来，暗示这种升级并非出于真正的技术必要性，而是为了进一步将用户嵌入微软生态系统中。 因此，LibreOffice正积极鼓励用户迁移到Linux和LibreOffice作为替代方案。"
  },
  {
    "id": "44603218",
    "title": "Servo Web Engine Further Tuning Performance",
    "url": "https://www.phoronix.com/news/Servo-June-2025-Highlights",
    "summary": "The Servo open-source web layout engine has made significant progress in its development, as outlined in the latest monthly status update. Key advancements include performance optimizations and further work on incremental layout handling. The engine is becoming more suitable for embedding into other software, evidenced by ongoing work on the Servoshell demo.\n\nSpecific features and improvements highlighted in the update are: support for viewport meta tags and scroll events in the DOM, barebones IndexedDB support, and improvements to abort handling via `AbortController`.\n\nNotably, experimental multi-process mode is now functioning on Microsoft Windows. The DevTools are becoming more capable with added functionality. Furthermore, Servo now supports screen reader functionality within its basic Servoshell browser UI, enhancing accessibility. There's also continued progress on WebDriver server support, aiming to automate Servo. More detailed information is available on the Servo.org blog.\n",
    "chinese_title": "Servo Web引擎性能进一步调优",
    "chinese_summary": "Servo网页排版引擎开源项目在开发上取得了显著进展，最新的月度状态更新中对此进行了概述。主要进展包括性能优化以及增量布局处理方面的进一步工作。该引擎越来越适合嵌入到其他软件中，Servoshell演示项目的持续工作证明了这一点。\n\n更新中强调的特定功能和改进包括：支持视口meta标签和DOM中的滚动事件、基本的IndexedDB支持，以及通过`AbortController`改进中止处理。\n\n值得注意的是，实验性的多进程模式现在可以在Microsoft Windows上运行。DevTools的功能随着新增功能变得更加强大。此外，Servo现在在其基本的Servoshell浏览器UI中支持屏幕阅读器功能，从而增强了可访问性。WebDriver服务器支持也在不断进展，旨在实现Servo的自动化。更多详细信息可在Servo.org博客上找到。"
  },
  {
    "id": "44604827",
    "title": "French villages have no more drinking water. The reason? PFAS pollution",
    "url": "https://www.lemonde.fr/en/environment/article/2025/07/18/these-french-villages-have-no-more-drinking-water-the-reason-pfas-pollution_6743479_114.html",
    "summary": "A record-breaking PFAS contamination has left nearly 3,500 residents across 16 rural villages in eastern France without safe drinking water since July 10. The contamination, affecting 12 villages in the Ardennes and 4 in the Meuse region, has led to a surge in bottled water purchases. Residents are being forced to rely on bottled water due to the high concentrations of these \"forever chemicals,\" also referred to as \"pfffasses\" by some residents, in their tap water. Supermarket managers are reporting significant increases in bottled water sales as a result of the ban on tap water consumption.\n",
    "chinese_title": "法国村庄饮用水告罄：全氟辛烷磺酸污染是主因",
    "chinese_summary": "创纪录PFAS污染致法国东部16村庄近3500居民饮水告急"
  },
  {
    "id": "44605884",
    "title": "Gmail Outage",
    "url": "https://downdetector.com/status/gmail/",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "Gmail 服务中断",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "44595824",
    "title": "Run TypeScript code without worrying about configuration",
    "url": "https://tsx.is/",
    "summary": "The article introduces `tsx` (TypeScript Execute), a Node.js enhancement designed to simplify running TypeScript code. It acts as a direct replacement for `node` but understands and executes TypeScript files directly, eliminating the need for complex configurations.\n\nKey features of `tsx` include:\n\n*   **Seamless TypeScript Execution:** `tsx` provides sensible defaults for running TypeScript, making it easy for beginners.\n*   **CJS/ESM Interoperability:** It handles both CommonJS and ES Modules seamlessly, resolving the common `ERR_REQUIRE_ESM` error.\n*   **Watch Mode:** A built-in watch mode automatically re-runs the script whenever the file is saved, improving developer productivity.\n\nThe article explains that `tsx` was created to address the fragmentation of the Node.js ecosystem caused by the introduction of ES Modules, especially given the complexities and lack of ESM support in tools like `ts-node`. `tsx` supports `tsconfig.json` paths and aims to simplify the developer experience by handling both CommonJS and ESM modules without manual configuration.\n\nFinally, the article mentions the project's reliance on user donations and encourages companies using `tsx` to become sponsors to ensure its continued maintenance and development.\n",
    "chinese_title": "无需担心配置，即可运行 TypeScript 代码",
    "chinese_summary": "本文介绍了 `tsx` (TypeScript Execute)，一个旨在简化 TypeScript 代码运行的 Node.js 增强工具。它可以直接替代 `node`，无需复杂的配置即可直接理解和执行 TypeScript 文件。\n\n`tsx` 的主要特点包括：\n\n*   **无缝 TypeScript 执行：** `tsx` 提供了合理的 TypeScript 运行默认配置，让初学者也能轻松上手。\n*   **CJS/ESM 互操作性：** 它无缝处理 CommonJS 和 ES Modules，解决了常见的 `ERR_REQUIRE_ESM` 错误。\n*   **监听模式：** 内置的监听模式可以在文件保存时自动重新运行脚本，从而提高开发人员的效率。\n\n本文解释说，`tsx` 的创建是为了解决 Node.js 生态系统因引入 ES Modules 而产生的碎片化问题，特别是考虑到像 `ts-node` 这样的工具中存在的复杂性和缺乏 ESM 支持的情况。 `tsx` 支持 `tsconfig.json` 路径，旨在通过处理 CommonJS 和 ESM 模块而无需手动配置来简化开发人员的体验。\n\n最后，本文提到该项目依赖于用户的捐赠，并鼓励使用 `tsx` 的公司成为赞助商，以确保其持续的维护和开发。"
  },
  {
    "id": "44606889",
    "title": "Ukrainian hackers wipe databases at Russia's Gazprom in major cyberattack",
    "url": "https://kyivindependent.com/ukrainian-intel-hackers-hit-gazproms-network-infrastructure-sources-say-07-2025/",
    "summary": "Ukrainian military intelligence (HUR) reportedly conducted a large-scale cyberattack against Russian energy giant Gazprom on July 17, 2025, according to a HUR source speaking to the Kyiv Independent. The alleged attack targeted Gazprom's network infrastructure, which Ukraine claims supports Russia's war effort.\n\nThe HUR source stated that the attack destroyed large volumes of data, installed damaging custom software, and disabled access for nearly 20,000 system administrators. Backup copies of key databases were also reportedly wiped. Approximately 390 Gazprom subsidiary companies and branches, including Gazprom Teplo Energo, Gazprom Obl Energo, and Gazprom Energozbyt, were impacted.\n\nThe attackers reportedly destroyed clusters of powerful servers running 1C software (used for document management and analytics), disabled operating systems, and damaged the BIOS of numerous devices, requiring physical repairs.\n\nGazprom and Russian authorities have not publicly commented on the alleged incident. The Kyiv Independent could not independently verify the claims.\n",
    "chinese_title": "乌克兰黑客大规模网络攻击，抹去俄气公司数据库",
    "chinese_summary": "据《基辅独立报》报道，乌克兰军事情报局（HUR）消息人士透露，HUR于2025年7月17日对俄罗斯能源巨头俄罗斯天然气工业股份公司（Gazprom）发动了一场大规模网络攻击。 据称，此次攻击针对的是俄罗斯天然气工业股份公司的网络基础设施，乌克兰方面声称该基础设施为俄罗斯的战争行动提供支持。\n\n该HUR消息人士称，此次攻击摧毁了大量数据，安装了具有破坏性的定制软件，并禁用了近2万名系统管理员的访问权限。 据报道，关键数据库的备份副本也被擦除。 大约390家俄罗斯天然气工业股份公司的子公司和分支机构受到影响，包括Gazprom Teplo Energo、Gazprom Obl Energo和Gazprom Energozbyt。\n\n据报道，攻击者摧毁了运行1C软件（用于文档管理和分析）的强大服务器集群，禁用了操作系统，并损坏了大量设备的BIOS，需要进行物理维修。\n\n俄罗斯天然气工业股份公司和俄罗斯当局尚未公开评论这起所谓的事件。《基辅独立报》无法独立证实这些说法。"
  },
  {
    "id": "44603365",
    "title": "The Most Powerful Server Embiggens a Bit with Power11",
    "url": "https://www.nextplatform.com/2025/07/16/the-worlds-most-powerful-server-embiggens-a-bit-with-power11/",
    "summary": "This article dissects IBM's new Power11 processor and its impact on the Power Systems server line, specifically the high-end Power E1180. The Power11 is essentially a refined Power10, born from manufacturing challenges and delays that forced IBM to adapt its roadmap. Initial plans for Power10 were derailed by GlobalFoundries' process abandonment, leading IBM to Samsung.\n\nThe Power11 boasts the same 18 billion transistors and 16 cores as the Power10 but activates all 16 cores (Power10 often disabled one due to yields). It offers configurations with varying core counts (4 to 15) in single and dual-chip modules (SCMs and DCMs) with frequencies up to 4.2 GHz. A special \"eSCM\" offers increased I/O.\n\nThe Power E1180 server, powered by Power11, is similar to the E1080, notably featuring DDR5 memory as standard (upgradeable from DDR4 on E1080). It supports up to 256 cores and 64 TB of memory across four nodes. The article highlights IBM's innovative OpenCAPI Memory Interface (OMI), enabling flexible memory options.\n\nThe piece compares the Power E1180's capabilities to AMD and Intel servers, emphasizing the balance between compute, memory, and I/O in IBM's system. It suggests a future \"xDCM\" to further boost core count by reconfiguring memory/I/O ports for NUMA links, enhancing virtualization capabilities. The article concludes with a table comparing the specifications of the last three generations of top-end Power Systems machines based on Power9, Power10, and Power11 processors, and how the theoretical Power E1185 and Power E1185X might compare.\n",
    "chinese_title": "最强服务器因Power11变得更强大",
    "chinese_summary": "本文剖析IBM新Power11处理器及其对Power Systems服务器产品线，特别是高端Power E1180的影响。Power11本质上是精进版的Power10，它诞生于制造挑战和延误，迫使IBM调整其路线图。最初的Power10计划因GlobalFoundries放弃工艺而受挫，导致IBM转向三星。\n\nPower11与Power10一样，拥有180亿个晶体管和16个核心，但激活了所有16个核心（Power10通常会因良率问题而禁用一个）。它提供具有不同核心数量（4到15个）的单芯片模块（SCM）和双芯片模块（DCM）配置，频率高达4.2 GHz。一种特殊的“eSCM”提供增强的I/O。\n\n由Power11驱动的Power E1180服务器与E1080类似，尤其以DDR5内存作为标准配置（可从E1080上的DDR4升级）。它支持高达256个核心和64 TB的内存，分布在四个节点上。本文重点介绍了IBM创新的OpenCAPI内存接口（OMI），从而实现灵活的内存选项。\n\n文章将Power E1180的功能与AMD和Intel服务器进行了比较，强调了IBM系统中计算、内存和I/O之间的平衡。它暗示了一种未来的“xDCM”，通过重新配置内存/I/O端口以用于NUMA链接，进一步提高核心数量，从而增强虚拟化能力。文章最后提供了一个表格，比较了基于Power9、Power10和Power11处理器的最新三代高端Power Systems机器的规格，以及理论上的Power E1185和Power E1185X可能的比较。"
  },
  {
    "id": "44574107",
    "title": "Claude Code Unleashed",
    "url": "https://ymichael.com/2025/07/15/claude-code-unleashed",
    "summary": "This article details the author's experience using Claude Code and the development of Terragon, a system for managing multiple Claude Code agents running in the cloud. The author emphasizes the significant productivity gains achieved by offloading coding tasks to background agents, especially with Anthropic's \"Claude Max\" subscription which provides effectively unlimited usage.\n\nThe article highlights the challenges of running multiple agents locally using git worktrees, citing context switching and resource contention as major drawbacks. Terragon solves this by providing fresh cloud environments for each task, enabling parallel execution and seamless task creation, making it easier to investigate bugs, prototype features, and perform code cleanup.\n\nThe author's workflow now involves a hybrid approach: Terragon handles most initial task execution, while local development focuses on reviewing, testing, and refining the agent's work. They've identified tasks like exploration, one-shot fixes, boilerplate generation, and context-heavy debugging as particularly well-suited for background agents.\n\nKey learnings include understanding the model's strengths and weaknesses, knowing when to abandon unproductive tasks, and managing the increased context switching that comes with parallel workflows. The author emphasizes that using agents isn't a replacement for developer skill, but rather a tool for enhancing productivity and focusing on tasks requiring human judgment. They are excited about the future of background agents and how they are changing the way software development work is approached.\n",
    "chinese_title": "克劳德代码释放",
    "chinese_summary": "本文详细介绍了作者使用Claude Code的经验，以及Terragon的开发，Terragon是一个用于管理在云端运行的多个Claude Code代理的系统。作者强调了通过将编码任务卸载到后台代理所获得的显著生产力提升，尤其是Anthropic的“Claude Max”订阅，该订阅实际上提供了无限的使用量。\n\n本文重点介绍了使用git工作树在本地运行多个代理所面临的挑战，指出上下文切换和资源争用是主要的缺点。Terragon通过为每个任务提供全新的云环境来解决这个问题，从而实现并行执行和无缝任务创建，使得调查错误、原型化功能和执行代码清理变得更加容易。\n\n作者现在的工作流程涉及一种混合方法：Terragon处理大多数初始任务执行，而本地开发则侧重于审查、测试和改进代理的工作。他们已经确定了诸如探索、一次性修复、样板生成和上下文密集型调试等任务，特别适合后台代理。\n\n主要经验包括了解模型的优点和缺点，知道何时放弃无效率的任务，以及管理并行工作流程带来的增加的上下文切换。作者强调，使用代理并不能取代开发人员的技能，而是提高生产力并专注于需要人为判断的任务的工具。他们对后台代理的未来以及它们如何改变软件开发工作的方式感到兴奋。"
  },
  {
    "id": "44605171",
    "title": "The EU can be shut down with a few keystrokes",
    "url": "https://www.bitecode.dev/p/the-eu-can-be-shut-down-with-a-few",
    "summary": "This article argues that the EU is dangerously dependent on US-controlled technology, specifically Operating Systems, SaaS platforms, and Chips, making it vulnerable to a digital shutdown by the US. The author contends that while Europe has excellent infrastructure, its reliance on US services for email, chat, authentication, file storage, and even OS and hardware creates a \"dark dependency hole.\"\n\nThe article highlights that a US executive order could effectively cripple the EU by cutting off access to essential services, potentially affecting everything from banking and domain names to emails, documents, and computing power. The author points out that many European businesses and institutions are unknowingly reliant on US-based services through their partners and supply chains, creating a cascade effect in case of a shutdown.\n\nTo address this vulnerability, the author proposes several steps, including: mandating the use of EU-controlled software and hardware by government agencies; isolating critical data and processing from foreign infrastructure; educating citizens about the importance of digital sovereignty; restricting the use of foreign third-party authentication for essential services; supporting local tech alternatives with significant incentives; and promoting Free and Open Source Software (FOSS). The author argues that investing in European technological independence would not only mitigate the risk of a US shutdown but also boost the economy and attract talent.\n",
    "chinese_title": "只需几下按键，欧盟即可被关闭。",
    "chinese_summary": "欧盟面临美国数字封锁风险：技术依赖下的“黑暗依赖黑洞”"
  },
  {
    "id": "44604759",
    "title": "UC divests hedge funds as CIO criticizes high fees, low returns",
    "url": "https://www.pionline.com/institutional-investors/endowments-foundations/pi-university-california-hedge-funds-endowment-asset-allocation/",
    "summary": "The University of California (UC) has divested from hedge funds due to high fees and low returns, a decision spurred by criticism from Chief Investment Officer Jagdeep Singh Bachher. The move is part of a broader strategy that also includes trimming the UC pension fund's exposure to private markets. The information was reported by Pensions & Investments on July 16, 2025.\n\nThe article also notes related industry news, including:\n\n*   Franklin Templeton hiring Rich Nuzum from Mercer to lead a new Outsourced Chief Investment Officer (OCIO) initiative.\n*   CalPERS appointing a PGGM pension fund executive as head of private debt.\n*   Pensions & Investments accepting surveys for its annual Largest Hedge Fund Managers report.\n*   Man Group choosing a CIO and making a small reduction in headcount as part of a business reshaping.\n",
    "chinese_title": "加州大学撤资对冲基金，首席投资官批评高收费、低回报。",
    "chinese_summary": "加州大学因高额费用和低回报撤资对冲基金，此举源于首席投资官Jagdeep Singh Bachher的批评。该举措是更广泛战略的一部分，也包括削减加州大学养老基金在私募市场的投资。此消息由《养老金与投资》于2025年7月16日报道。\n\n文章还提到相关行业新闻，包括：\n\n*   富兰克林邓普顿聘请美世的Rich Nuzum领导一项新的外包首席投资官（OCIO）计划。\n*   加州公务员退休基金（CalPERS）任命PGGM养老基金的一位高管担任私募债务主管。\n*   《养老金与投资》正在接受年度最大对冲基金经理报告的调查。\n*   英仕曼集团选择了一位首席投资官，并作为业务重塑的一部分小幅裁员。"
  },
  {
    "id": "44593972",
    "title": "Self-taught engineers often outperform (2024)",
    "url": "https://michaelbastos.com/blog/why-self-taught-engineers-often-outperform",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "自学成才的工程师通常表现更出色（2024）",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "44556318",
    "title": "Show HN: PlutoFilter- A single-header, zero-allocation image filter library in C",
    "url": "https://github.com/sammycage/plutofilter",
    "summary": "PlutoFilter is a single-header, zero-allocation image filter library written in C. It offers fast and chainable image effects compatible with SVG and CSS filter semantics, ensuring consistent visual effects across platforms.\n\nInstallation is simple: include the header file. To include the implementation, define `PLUTOFILTER_IMPLEMENTATION` in one `.c` or `.cpp` file before including the header. Defining `PLUTOFILTER_BUILD_STATIC` before including the header declares all functions as static, preventing symbol collisions when embedding.\n\nThe library provides various image filters, including Gaussian Blur, Color Transform (Grayscale, Sepia, Saturate, Brightness, Contrast, Opacity, Invert, Hue Rotate, Luminance to Alpha, LinearRGB to sRGB, sRGB to LinearRGB), Blend modes (Normal, Multiply, Screen, etc.), and Composite modes (Over, In, Out, etc.). Each filter is applied via dedicated functions, taking input and output surfaces as arguments. The `plutofilter_color_transform` function applies a 5x4 color transformation matrix for complex color adjustments. Examples are provided for each filter showcasing their effects with different parameter values.\n\nA roadmap includes future additions like Morphology, Diffuse Lighting, and more. The library avoids dynamic memory allocation, making it efficient for resource-constrained environments.\n",
    "chinese_title": "Show HN: PlutoFilter - 一个 C 语言的单头文件、零内存分配图像滤镜库",
    "chinese_summary": "PlutoFilter是一个单头文件、零内存分配的C语言图像滤镜库。它提供快速且可链式调用的图像特效，兼容SVG和CSS滤镜语义，确保跨平台视觉效果一致。\n\n安装简单：包含头文件即可。要包含实现，在包含头文件之前在一个`.c`或`.cpp`文件中定义`PLUTOFILTER_IMPLEMENTATION`。在包含头文件之前定义`PLUTOFILTER_BUILD_STATIC`会将所有函数声明为静态函数，防止嵌入时出现符号冲突。\n\n该库提供各种图像滤镜，包括高斯模糊、颜色变换（灰度、棕褐色、饱和度、亮度、对比度、不透明度、反相、色相旋转、亮度到Alpha、线性RGB到sRGB、sRGB到线性RGB）、混合模式（普通、正片叠底、滤色等）以及合成模式（覆盖、内、外等）。每个滤镜都通过专用函数应用，并将输入和输出表面作为参数。`plutofilter_color_transform`函数应用一个5x4颜色变换矩阵，用于复杂的颜色调整。每个滤镜都提供了示例，展示了它们在不同参数值下的效果。\n\n路线图包括未来增加的功能，例如形态学、漫反射光照等。该库避免动态内存分配，使其在资源受限的环境中高效运行。"
  },
  {
    "id": "44603865",
    "title": "Fair software licensing group brands Microsoft EU concessions 'stalling tactic'",
    "url": "https://www.theregister.com/2025/07/18/cispe_microsoft_concessions/",
    "summary": "In July 2025, Microsoft reached an agreement with the Cloud Infrastructure Services Providers in Europe (CISPE), offering European cloud providers more flexibility in deploying Microsoft software on their infrastructure, including pay-as-you-go licensing and customer privacy agreements. This addresses a formal competition complaint filed with the European Commission two years prior. CISPE highlights the benefits of increased choice and the ability to use existing licenses on European platforms.\n\nHowever, the Coalition for Fair Software Licensing dismissed the concessions as a \"stalling tactic\" designed to maintain Microsoft's market dominance through restrictive licensing practices. Key criticism centers on the continued technical tie-in between Entra ID (formerly Azure Active Directory) and Microsoft 365, limiting ID management choices.\n\nNicky Stewart of the Open Cloud Coalition echoed the sentiment, arguing that the deal is a \"bilateral deal\" and doesn't address the core problem of Microsoft's licensing practices, which distort competition for the majority of UK and EU customers. Market-wide antitrust remedies are deemed necessary for fair pricing and real choice.\n\nThe article also references previous concessions made by Microsoft in 2022 under pressure from the European Commission, including Flexible Virtualization and changes to licensing subscriptions. While CISPE sees progress, critics view these as insufficient to level the playing field.\n",
    "chinese_title": "公平软件许可组织称微软欧盟让步为“拖延战术”",
    "chinese_summary": "2025年7月，微软与欧洲云基础设施服务提供商协会(CISPE)达成协议，为欧洲云提供商在自身基础设施上部署微软软件提供更大的灵活性，包括按需付费许可和客户隐私协议。此举旨在解决两年前向欧盟委员会提出的正式竞争申诉。CISPE强调了增加选择以及在欧洲平台上使用现有许可的益处。\n\n然而，公平软件许可联盟认为这些让步是一种“拖延战术”，旨在通过限制性许可做法来维持微软的市场主导地位。主要的批评集中在Entra ID（前身为Azure Active Directory）与Microsoft 365之间持续的技术捆绑，限制了身份管理的选择。\n\n开放云联盟的Nicky Stewart也表达了同样的看法，认为该协议是“双边协议”，并未解决微软许可做法的核心问题，即这种做法扭曲了英国和欧盟大多数客户的竞争。为了实现公平定价和真正选择，有必要采取全市场的反垄断补救措施。\n\n文章还提到了微软在2022年受欧盟委员会压力下做出的先前让步，包括灵活虚拟化和许可订阅变更。尽管CISPE认为取得了进展，但批评者认为这些不足以创造公平的竞争环境。"
  },
  {
    "id": "44592413",
    "title": "Hand: open-source Robot Hand",
    "url": "https://github.com/pollen-robotics/AmazingHand",
    "summary": "The \"Hand: open-source Robot Hand\" project aims to create a low-cost, dexterous, and expressive humanoid robotic hand suitable for robots like Reachy2. Licensed under Apache 2.0 and Creative Commons Attribution 4.0, the Amazing Hand features 8 degrees of freedom, 4 fingers with flexible shells, and integrated actuators, eliminating the need for external cables. It's designed to be 3D printable, weighs approximately 400g, and has a target cost below €200.\n\nThe hand is driven by parallel mechanisms using Feetech SCS0009 servos, offering control via a serial bus driver (Waveshare + Python) or Arduino + Feetech TTL Linker. The project provides build resources like a Bill of Materials (BOM), CAD files (STL, STEP, Onshape), and assembly guides. Calibration scripts are available for both Python and Arduino.\n\nWhile variations in real-world angles are acknowledged due to manufacturing tolerances, the project leverages the smart capabilities of the SCS0009 servos for advanced control. The project encourages community contributions and offers instructions for basic demo software, along with more advanced demonstrations and configuration tools.\n\nFuture development plans include designing a custom PCB for power supply and serial hub functions, testing prehensive tasks, improving hand-closing behavior with motor feedback, exploring different finger lengths or a fifth finger, investigating STS3032 motors, adding compliant links with springs, and incorporating fingertip sensors for smarter control. Community support is available via a Discord channel, and the project thanks contributors like Steve N'Guyen, Pierre Rouanet, Augustin Crampette, and Matthieu Lapeyre.\n",
    "chinese_title": "手: 开源机器人手",
    "chinese_summary": "“Hand: 开源机器人手”项目旨在创建一个低成本、灵巧且富有表现力的人形机器人手，适用于像Reachy2这样的机器人。该奇妙之手在Apache 2.0和Creative Commons Attribution 4.0许可下发布，具有8个自由度、带有柔性外壳的4个手指，以及集成的执行器，无需外部电缆。它被设计为可3D打印，重量约为400克，目标成本低于200欧元。\n\n该手由使用Feetech SCS0009舵机的并联机构驱动，可通过串行总线驱动程序（Waveshare + Python）或Arduino + Feetech TTL Linker进行控制。该项目提供构建资源，如物料清单（BOM）、CAD文件（STL、STEP、Onshape）和组装指南。 Python和Arduino都有可用的校准脚本。\n\n虽然由于制造公差，实际角度存在差异，但该项目利用SCS0009舵机的智能功能进行高级控制。该项目鼓励社区贡献，并提供基本演示软件的说明，以及更高级的演示和配置工具。\n\n未来的发展计划包括设计用于电源和串行集线器功能的定制PCB、测试综合任务、通过电机反馈改进手部闭合行为、探索不同的手指长度或第五根手指、研究STS3032电机、添加带有弹簧的柔顺连杆，以及加入指尖传感器以实现更智能的控制。可通过Discord频道获得社区支持，该项目感谢Steve N'Guyen、Pierre Rouanet、Augustin Crampette和Matthieu Lapeyre等贡献者。"
  },
  {
    "id": "44554530",
    "title": "Stone blocks from the Lighthouse of Alexandria recovered from seafloor",
    "url": "https://archaeologymag.com/2025/07/lighthouse-of-alexandria-rises-again/",
    "summary": "The article announces the recovery of stone blocks from the legendary Lighthouse of Alexandria from the seafloor. While details are scarce, this discovery signifies a major archaeological breakthrough in understanding one of the Seven Wonders of the Ancient World. It suggests potential insights into the lighthouse's construction, architecture, and eventual destruction.\n\nThe article also mentions another, unrelated, archaeological find: that the 2025 excavation of the Antikythera shipwreck has revealed ancient shipbuilding secrets. This separate discovery points to advancements in our understanding of ancient maritime technology and shipbuilding practices. The Antikythera shipwreck is famous for yielding the Antikythera mechanism, an ancient analog computer. Therefore, further discoveries from the site promise to be highly significant for understanding ancient technology and engineering.\n\nIn essence, the article highlights two significant archaeological developments: the recovery of remains from the Lighthouse of Alexandria and new insights into ancient shipbuilding gleaned from the Antikythera shipwreck excavation. Both findings contribute to a richer understanding of the ancient world's technological capabilities and cultural heritage.\n",
    "chinese_title": "从海底寻回的亚历山大灯塔石块",
    "chinese_summary": "文章宣布从海底寻回亚历山大灯塔的石块。虽然细节尚不清楚，但这一发现标志着在了解古代世界七大奇迹之一方面取得了重大的考古突破，并暗示着可能深入了解灯塔的建造、建筑和最终的损毁。\n\n文章还提到了另一项无关的考古发现：2025年安提凯瑟拉沉船的挖掘工作揭示了古代造船的秘密。这一单独的发现表明我们对古代航海技术和造船实践的理解有所进步。安提凯瑟拉沉船因出土了安提凯瑟拉机械装置（一种古代模拟计算机）而闻名。因此，该遗址的进一步发现有望对理解古代技术和工程具有重要意义。\n\n本质上，这篇文章强调了两项重要的考古进展：亚历山大灯塔遗骸的寻回和从安提凯瑟拉沉船挖掘中获得的对古代造船的新见解。这两项发现都有助于更深入地了解古代世界的技术能力和文化遗产。"
  },
  {
    "id": "44592377",
    "title": "My bank keeps on undermining anti-phishing education",
    "url": "http://moritz-mander.de/blog/my_bank_keeps_on_undermining_anti-phishing_education/",
    "summary": "This article details the author's frustration with their German Sparkasse bank's promotional email and website for the \"Wero-Win Weeks\" prize draw, arguing they resemble phishing scams and undermine anti-phishing education efforts.\n\nThe email, promoting a chance to win money by using the Wero payment system, includes a link to a website (\"gewinnen-mit-wero.de\") unrelated to the bank's primary domain. The author points out several red flags: the generic domain, lack of context for the prize draw, the use of Let's Encrypt SSL certification instead of a major provider, and a registration form requesting sensitive information (name, birth date, IBAN, email) instead of integrating directly into the bank's app.\n\nThe author argues this type of promotion normalizes suspicious behavior, making it harder for users to distinguish legitimate communication from actual phishing attempts. They cite past instances of the bank sending similar suspicious-looking communications, like an SMS with a short link.\n\nPossible solutions include integrating the prize draw into the bank's app or using a subdomain of the bank's official website (sparkasse.de) for the promotional campaign. The author also references the German government's efforts to create a standardized online presence with a common domain (gov.de) to combat similar issues.\n\nFinally, the article suggests the bank's practices could even create legal issues. Citing rulings where banks had to refund phishing victims, the author argues that the bank's confusing promotion could make it difficult to prove \"gross negligence\" on the part of a customer who falls victim to a similar phishing scam. The author concludes by imploring financial institutions to prioritize usable security and avoid undermining phishing education efforts.\n",
    "chinese_title": "我的银行一直在破坏反钓鱼教育。",
    "chinese_summary": "本文详述了作者对其德国储蓄银行（Sparkasse）“Wero-Win Weeks”抽奖活动的促销邮件和网站感到沮丧，认为它们类似于网络钓鱼诈骗，并破坏了反网络钓鱼教育工作。\n\n该邮件推广通过使用Wero支付系统赢得金钱的机会，其中包含指向一个与银行主域名无关的网站（“gewinnen-mit-wero.de”）的链接。作者指出了几个危险信号：通用域名、缺乏抽奖活动的背景信息、使用Let's Encrypt SSL证书而不是主要提供商，以及一个注册表格，要求提供敏感信息（姓名、出生日期、IBAN、电子邮件），而不是直接集成到银行的应用程序中。\n\n作者认为，这种类型的促销活动使可疑行为正常化，使得用户更难以区分合法通信和实际的网络钓鱼尝试。他们引用了该银行过去发送类似的可疑通信的例子，例如包含短链接的短信。\n\n可能的解决方案包括将抽奖活动整合到银行的应用程序中，或者使用银行官方网站（sparkasse.de）的子域名进行促销活动。作者还提到了德国政府为创建一个具有通用域名（gov.de）的标准化在线形象以应对类似问题所做的努力。\n\n最后，文章暗示银行的做法甚至可能造成法律问题。作者援引银行不得不退还网络钓鱼受害者损失的裁决，认为银行令人困惑的促销活动可能会使证明客户在遭遇类似网络钓鱼诈骗时存在“重大过失”变得困难。作者最后恳请金融机构优先考虑可用安全性，避免破坏网络钓鱼教育工作。"
  },
  {
    "id": "44599711",
    "title": "Astronomers Discover Rare Distant Object in Sync with Neptune",
    "url": "https://pweb.cfa.harvard.edu/news/astronomers-discover-rare-distant-object-sync-neptune",
    "summary": "Astronomers have discovered a rare Trans-Neptunian Object (TNO) that is in a stable, synchronized orbit with Neptune. This TNO, dubbed 2022 VX166, is a \"2:3 resonance\" object, meaning it orbits the Sun twice for every three orbits Neptune makes. This type of orbital resonance is relatively common among TNOs, but 2022 VX166 is unique because it's a \"high-inclination\" object, orbiting at a significant angle (about 30 degrees) relative to the plane of the solar system where most planets reside.\n\nThe significance of this discovery lies in the rarity of finding a high-inclination TNO in this specific orbital resonance with Neptune. These objects provide valuable insights into the early solar system's formation and evolution. The gravitational interactions between Neptune and these resonant TNOs likely played a crucial role in sculpting the outer solar system.\n\nThe discovery was made using the Dark Energy Camera (DECam) on the Víctor M. Blanco 4-meter Telescope in Chile. By precisely tracking the object's movements, astronomers were able to determine its orbital parameters and confirm its resonant relationship with Neptune. The researchers believe that studying these rare high-inclination resonant objects can help constrain models of planetary migration and the early dynamics of the solar system, shedding light on how the planets settled into their current positions.\n",
    "chinese_title": "天文学家发现与海王星同步的罕见遥远天体",
    "chinese_summary": "天文学家发现一颗罕见的跨海王星天体，其轨道与海王星保持稳定的同步共振。这颗名为2022 VX166的跨海王星天体是一个“2:3共振”天体，意味着海王星每绕太阳运行三圈，它就绕太阳运行两圈。这种轨道共振在跨海王星天体中相对常见，但2022 VX166的独特之处在于它是一颗“高倾角”天体，其轨道与大多数行星所在的太阳系平面呈显著角度（约30度）。\n\n这项发现的意义在于，在这种特定的轨道共振中发现高倾角跨海王星天体的罕见性。这些天体为早期太阳系的形成和演化提供了宝贵的见解。海王星与这些共振跨海王星天体之间的引力相互作用可能在塑造外太阳系方面发挥了关键作用。\n\n这项发现是利用位于智利的Víctor M. Blanco 4米望远镜上的暗能量相机（DECam）完成的。通过精确跟踪该天体的运动，天文学家能够确定其轨道参数并确认其与海王星的共振关系。研究人员认为，研究这些罕见的高倾角共振天体有助于约束行星迁移和太阳系早期动力学的模型，从而揭示行星是如何 settling 到当前位置的。"
  },
  {
    "id": "44562076",
    "title": "The Pigeon River Is Perched, Which Is Geologically Bad News (2020)",
    "url": "https://princegeology.com/the-pigeon-river-is-perched-which-is-geologically-bad-news-for-it/",
    "summary": "This article discusses the imminent (in geologic terms) stream capture of the Pigeon River by Hominy Creek, a tributary of the French Broad River, near Canton, North Carolina. The Pigeon River valley is \"perched\" about 400 feet higher than the French Broad valley, creating the potential for the lower French Broad system to capture the Pigeon's flow.\n\nThe headwaters of Hominy Creek are only about 1,500 feet from the Pigeon River, with a subtle drainage divide of just 20 feet. The author suggests that a canal could easily connect the two river systems. When the stream capture occurs naturally, it will result in significant rapids and a gorge as the Pigeon's water descends 400 feet to the French Broad.\n\nThe article explains how Hominy Creek has been advancing into the Pigeon River system, inverting the normal branching patterns of tributaries, creating a \"grapnel\" shape. This is facilitated by a weak zone in the bedrock, likely a fault or fractured area, that allows for easier erosion.\n\nWhile the exact cause is difficult to pinpoint, the difference in size and geology between the two rivers likely plays a role. The larger French Broad River can erode its valley more effectively, potentially leaving the Pigeon \"stranded\" at a higher elevation. The author acknowledges the timeline for this capture is uncertain, but notes even a large flood of the Pigeon River could trigger stream capture in the \"geo-future.\"\n",
    "chinese_title": "鸽子河悬于高处，地质灾难预兆 (2020)",
    "chinese_summary": "本文探讨了在坎顿（北卡罗来纳州附近）的鸽子河即将被法国宽河的支流霍米尼溪袭夺（地质学意义上）的可能性。鸽子河谷比法国宽河谷高出约400英尺，这为较低的法国宽河系统袭夺鸽子河的流量创造了条件。\n\n霍米尼溪的源头距离鸽子河仅约1500英尺，分水岭仅有20英尺的细微落差。作者认为，一条运河可以很容易地连接这两个河流系统。当河流袭夺自然发生时，鸽子河的水下降400英尺至法国宽河，将产生巨大的激流和峡谷。\n\n文章解释了霍米尼溪如何侵入鸽子河系统，颠倒了支流正常的分支模式，形成了“抓钩”形状。这得益于基岩中的一个薄弱地带，可能是断层或断裂区域，这使得侵蚀更容易。\n\n虽然确切原因难以确定，但两条河流之间的大小和地质差异可能发挥作用。较大的法国宽河可以更有效地侵蚀其河谷，可能使鸽子河“滞留”在较高的海拔。作者承认这种袭夺的时间表尚不确定，但指出即使鸽子河发生一次大洪水，也可能在“地质未来”引发河流袭夺。"
  },
  {
    "id": "44598254",
    "title": "Anthropic tightens usage limits for Claude Code without telling users",
    "url": "https://techcrunch.com/2025/07/17/anthropic-tightens-usage-limits-for-claude-code-without-telling-users/",
    "summary": "Anthropic has quietly tightened usage limits for its Claude Code service, causing frustration and confusion among users, particularly those on the $200-a-month Max plan. Users are encountering a \"Claude usage limit reached\" message much sooner than expected, without any prior announcement or clear explanation from Anthropic. This has led to speculation about subscription downgrades or inaccurate usage tracking.\n\nAn Anthropic representative acknowledged the issues and slower response times but offered no further details. Users are struggling to continue their projects due to the sudden restrictions, finding that alternatives don't match Claude Code's capabilities.\n\nThe situation is compounded by broader network issues at Anthropic, with API users reporting overload errors. A key source of frustration stems from Anthropic's tiered pricing system, which promises higher usage limits but doesn't guarantee a specific level of access, leaving users unable to reliably plan their usage. The Max plan, while popular for its high usage potential, is viewed by some as potentially unsustainable for Anthropic. Users are primarily asking for increased transparency and clearer communication regarding usage limits. The lack of communication is eroding user confidence.\n",
    "chinese_title": "Anthropic收紧Claude Code使用限制，未告知用户",
    "chinese_summary": "Anthropic悄然收紧Claude Code使用限制，引发用户不满和困惑，尤其是每月200美元Max套餐用户。用户比预期更早遇到“Claude使用量已达上限”提示，且Anthropic未事先通知或明确解释。这导致人们猜测订阅降级或使用量跟踪不准确。\n\nAnthropic代表承认存在问题和响应速度变慢，但未提供更多细节。由于突然的限制，用户难以继续项目，并发现替代方案无法与Claude Code的功能相媲美。\n\nAnthropic的网络问题也加剧了这种情况，API用户报告出现过载错误。用户不满的关键在于Anthropic的分级定价系统，该系统承诺更高的使用限制，但未保证具体的访问级别，导致用户无法可靠地规划其使用情况。Max套餐虽然因其高使用潜力而受欢迎，但一些人认为Anthropic可能无法持续提供支持。用户主要要求提高透明度，并就使用限制进行更清晰的沟通。缺乏沟通正在削弱用户信心。"
  },
  {
    "id": "44600512",
    "title": "USB-C hubs and my slow descent into madness (2021)",
    "url": "https://overengineer.dev/blog/2021/04/25/usb-c-hub-madness/",
    "summary": "This article is a rant about the author's frustrating experiences with USB-C hubs since 2018, triggered by a recent near-disastrous hub failure. The author, an Apple MacBook Pro user with limited ports, purchased three different hubs (Satechi, ICY BOX, and Anker) and found them all to be flawed.\n\nThe Satechi hubs suffered from HDMI cut-outs and unreliable Ethernet connections, ultimately dying completely. Disassembly revealed they were rebranded Gopod products, likely available much cheaper. The ICY BOX hubs, also plagued by Ethernet issues (downgrading to 100baseTX), offered terrible customer support and one nearly caused a fire due to overheating. These hubs were also identified as rebranded Dongguan Kingtron products.\n\nA recurring issue was the Realtek RTL8153 Ethernet chip used in both hubs. The author details widespread complaints about this chip's unreliability on macOS, including connection drops and speed downgrades, issues they also experienced. They criticize Realtek for not providing updated macOS drivers to address these problems.\n\nFinally, the author purchased an Anker PowerExpand 8-in-1 hub. While initially functional, the presence of, yet again, the Realtek RTL8153 chip and the impulse to dismantle the device \"for science\" led them to pen the article, fueled by a growing cynicism towards USB-C hub quality and branding practices. The author states that manufacturers often rebrand cheap, unreliable products from other companies, resulting in overpriced hubs with poor performance.\n",
    "chinese_title": "USB-C 集线器与我逐渐崩溃的疯狂（2021）",
    "chinese_summary": "本文作者吐槽自2018年以来使用USB-C扩展坞的糟糕体验，起因是最近一次险些酿成灾难的扩展坞故障。作为端口有限的Apple MacBook Pro用户，作者购买了三个不同的扩展坞（Satechi、ICY BOX和Anker），但都发现它们存在缺陷。\n\nSatechi扩展坞存在HDMI信号中断和以太网连接不可靠的问题，最终彻底报废。拆解后发现它们是Gopod的贴牌产品，很可能可以用更低的价格买到。ICY BOX扩展坞也受到以太网问题的困扰（降级到100baseTX），客户支持很差，而且有一个差点因过热而引起火灾。这些扩展坞也被确认为东莞劲拓的贴牌产品。\n\n一个反复出现的问题是，这两个扩展坞都使用了Realtek RTL8153以太网芯片。作者详细介绍了关于这款芯片在macOS上不可靠的大量投诉，包括连接中断和速度降级，作者也遇到了这些问题。他们批评Realtek没有提供更新的macOS驱动程序来解决这些问题。\n\n最后，作者购买了一个Anker PowerExpand 8合1扩展坞。虽然最初功能正常，但同样是Realtek RTL8153芯片的存在以及出于“科学”原因拆卸设备的冲动促使他们写下了这篇文章，并且越发愤世嫉俗地看待USB-C扩展坞的质量和品牌营销行为。作者表示，制造商经常贴牌销售来自其他公司的廉价、不可靠的产品，导致价格过高且性能不佳的扩展坞。"
  },
  {
    "id": "44605561",
    "title": "Psychedelic mushroom molecule just showed signs of slowing aging",
    "url": "https://twitter.com/bryan_johnson/status/1943824432419811437",
    "summary": "The article, titled \"Psychedelic mushroom molecule just showed signs of slowing aging,\" is inaccessible due to JavaScript being disabled. The content provided is a standard message from X.com (formerly Twitter) indicating the website cannot function properly without JavaScript enabled. Therefore, **it's impossible to provide a summary of the article's content because the article itself is not visible.** The error message implies the content discusses research suggesting a molecule found in psychedelic mushrooms may have anti-aging properties. However, without seeing the actual article, this remains speculative.\n",
    "chinese_title": "迷幻蘑菇分子显示出延缓衰老迹象",
    "chinese_summary": "由于JavaScript被禁用，标题为“迷幻蘑菇分子显示出减缓衰老迹象”的文章无法访问。提供的内容是来自X.com（前身为Twitter）的标准消息，表明网站在未启用JavaScript的情况下无法正常运行。因此，**无法提供文章内容的摘要，因为文章本身不可见。** 该错误消息暗示内容讨论了一项研究，该研究表明在迷幻蘑菇中发现的一种分子可能具有抗衰老特性。然而，在未看到实际文章的情况下，这仍然是推测性的。"
  },
  {
    "id": "44573524",
    "title": "Modular Interpreters and Visitors in Rust with Extensible Variants and CGP",
    "url": "https://contextgeneric.dev/blog/extensible-datatypes-part-2/",
    "summary": "This article, the second in a series on using CGP (Composable Generics Programming) in Rust, focuses on leveraging extensible variants for building modular interpreters and visitors. It addresses the limitations of the traditional visitor pattern, specifically its closed nature that hinders extensibility when dealing with evolving data structures like abstract syntax trees or serialization formats. The core problem is the tight coupling between the data structure (e.g., a MathExpr enum) and the functions that operate on it (e.g., an `eval` function), leading to the \"expression problem\" where adding new variants requires modifying existing code.\n\nThe solution presented uses CGP to decouple evaluation logic from the concrete enum definition. This is achieved by defining expression types like `Plus`, `Times`, and `Literal` as independent structs parameterized by a generic `Expr` type. A `Computer` trait is introduced as a CGP component, embodying pure computation that transforms input into output. Each expression type then has a corresponding provider (e.g., `EvalAdd`, `EvalMultiply`, `EvalLiteral`) that implements the `Computer` trait. These providers operate generically, relying on the context to handle sub-expressions and ensuring type safety through trait bounds.\n\nFinally, a concrete `MathExpr` enum is defined, but instead of directly embedding expression structures, it wraps the independent structs. This design allows each provider to be developed and composed independently, leading to a modular and extensible interpreter that avoids the limitations of the traditional visitor pattern and effectively solves the expression problem. The key takeaway is the increased flexibility and maintainability achieved by decoupling the implementation of each variant from the concrete enum definition.\n",
    "chinese_title": "Rust中可扩展变体与CGP的模块化解释器和访问者",
    "chinese_summary": "本文是关于在 Rust 中使用 CGP（可组合泛型编程）的系列文章的第二篇，重点介绍如何利用可扩展变体来构建模块化解释器和访问者。它解决了传统访问者模式的局限性，特别是其封闭性，这种封闭性阻碍了在处理诸如抽象语法树或序列化格式等不断演变的数据结构时的可扩展性。核心问题是数据结构（例如，MathExpr 枚举）与操作它的函数（例如，`eval` 函数）之间的紧密耦合，从而导致“表达式问题”，即添加新的变体需要修改现有代码。\n\n所提出的解决方案使用 CGP 将评估逻辑与具体的枚举定义分离。这是通过将诸如 `Plus`、`Times` 和 `Literal` 之类的表达式类型定义为由泛型 `Expr` 类型参数化的独立结构来实现的。引入 `Computer` trait 作为 CGP 组件，体现将输入转换为输出的纯计算。然后，每个表达式类型都有一个对应的提供者（例如，`EvalAdd`、`EvalMultiply`、`EvalLiteral`），它们实现了 `Computer` trait。这些提供者以泛型方式运行，依靠上下文来处理子表达式，并通过 trait 边界确保类型安全。\n\n最后，定义了一个具体的 `MathExpr` 枚举，但它没有直接嵌入表达式结构，而是包装了独立的结构。这种设计允许每个提供者独立开发和组合，从而产生一个模块化和可扩展的解释器，避免了传统访问者模式的局限性，并有效地解决了表达式问题。关键在于通过将每个变体的实现与具体的枚举定义分离，从而提高了灵活性和可维护性。"
  },
  {
    "id": "44596275",
    "title": "Apple Intelligence Foundation Language Models Tech Report 2025",
    "url": "https://machinelearning.apple.com/research/apple-foundation-models-tech-report-2025",
    "summary": "The Apple Intelligence Foundation Language Models Tech Report 2025 introduces two new multilingual, multimodal foundation language models powering Apple Intelligence features: an on-device model (~3B parameters) and a scalable server model.\n\nThe on-device model is optimized for Apple silicon using techniques like KV-cache sharing and 2-bit quantization-aware training. The server model utilizes a novel Parallel-Track Mixture-of-Experts (PT-MoE) transformer, combining track parallelism, sparse computation, and interleaved global–local attention for high quality and cost-effectiveness on Apple's Private Cloud Compute platform.\n\nBoth models are trained on large-scale multilingual and multimodal datasets obtained through responsible web crawling, licensed corpora, and synthetic data, then refined with supervised fine-tuning and reinforcement learning. This allows them to support more languages, understand images, and execute tool calls. Benchmarks show performance matching or surpassing comparable open-source models.\n\nA new Swift-centric Foundation Models framework enables developers to easily integrate these models' capabilities (guided generation, constrained tool calling, LoRA adapter fine-tuning) into their applications. The models incorporate Responsible AI safeguards like content filtering and locale-specific evaluation, and prioritize user privacy through innovations like Private Cloud Compute.\n\nThis report details updates introduced in June 2025, building upon initial models presented in July 2024 and first showcased at the 2024 Worldwide Developers Conference. These models are specialized for everyday tasks such as text refinement, notification management, image generation, and in-app actions.\n",
    "chinese_title": "苹果智能基础语言模型技术报告2025",
    "chinese_summary": "Apple智能基金会语言模型技术报告2025介绍了两个全新的多语言、多模态基金会语言模型，为Apple智能功能提供支持：一个设备端模型（约30亿参数）和一个可扩展的服务器模型。\n\n设备端模型针对Apple芯片进行了优化，采用了诸如KV缓存共享和2位量化感知训练等技术。服务器模型利用了一种新颖的并行轨道混合专家(PT-MoE) Transformer，结合了轨道并行、稀疏计算和交错的全局-局部注意力，从而在Apple的私有云计算平台上实现高质量和成本效益。\n\n这两个模型都经过大规模多语言和多模态数据集的训练，这些数据集通过负责任的网页爬取、许可语料库和合成数据获得，然后通过监督微调和强化学习进行改进。这使得它们能够支持更多语言，理解图像并执行工具调用。基准测试表明，其性能与同类开源模型相当或超越。\n\n一个以Swift为中心的新基金会模型框架使开发人员可以轻松地将这些模型的功能（引导生成、约束工具调用、LoRA适配器微调）集成到他们的应用程序中。这些模型结合了负责任的AI安全措施，如内容过滤和特定于地区的评估，并通过私有云计算等创新来优先考虑用户隐私。\n\n本报告详细介绍了2025年6月推出的更新，它建立在2024年7月发布的初始模型以及在2024年全球开发者大会上首次展示的模型之上。这些模型专门用于日常任务，例如文本优化、通知管理、图像生成和应用内操作。"
  },
  {
    "id": "44599325",
    "title": "23andMe is out of bankruptcy and it still hasn’t substantially changed its ways",
    "url": "https://www.washingtonpost.com/technology/2025/07/17/23andme-bankruptcy-privacy/",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "23andMe已摆脱破产，但其行事方式并未发生实质性改变。",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "44605405",
    "title": "Britain is lowering the voting age to 16. It's getting a mixed reaction",
    "url": "https://apnews.com/article/uk-voting-age-16-criticism-debate-f85d8675acbf4bd9ceece51135c369e5",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "英国将投票年龄降至16岁，各方反应不一。",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "44599334",
    "title": "Mammals Evolved into Ant Eaters 12 Times Since Dinosaur Age, Study Finds",
    "url": "https://news.njit.edu/mammals-evolved-ant-eaters-12-times-dinosaur-age-study-finds",
    "summary": "A new study reveals that mammals have independently evolved into ant-eating specialists, also known as myrmecophages, at least 12 separate times since the age of dinosaurs. This repeated evolution highlights the success and adaptability of this dietary niche. The study likely investigated the evolutionary history and relationships of various mammal lineages known to consume ants and termites, using genetic or morphological data (or both) to reconstruct their evolutionary trees and pinpoint when and how often myrmecophagy arose independently.\n\nThe findings suggest that ant and termite colonies provide a reliable and abundant food source that has repeatedly incentivized different mammal groups to develop the specific adaptations required for myrmecophagy. These adaptations typically include strong claws for digging, long, sticky tongues for capturing insects, and reduced or absent teeth. The convergence of different mammal lineages on these similar traits provides a compelling example of convergent evolution, where unrelated species independently evolve similar characteristics in response to similar environmental pressures.\n",
    "chinese_title": "研究发现：自恐龙时代以来，哺乳动物进化成食蚁兽共12次",
    "chinese_summary": "一项新研究表明，自恐龙时代以来，哺乳动物至少独立演化成食蚁专家（也称为食蚁兽）12次。这种重复演化突显了这种饮食生态位的成功和适应性。该研究可能调查了已知以蚂蚁和白蚁为食的各种哺乳动物谱系的进化历史和关系，使用遗传或形态数据（或两者）来重建它们的进化树，并确定食蚁行为独立出现的何时以及频率。\n\n研究结果表明，蚂蚁和白蚁群落提供了一种可靠且丰富的食物来源，这反复激励了不同的哺乳动物群体发展出食蚁行为所需的特定适应能力。这些适应能力通常包括用于挖掘的强壮爪子、用于捕获昆虫的长而粘的舌头，以及减少或缺失的牙齿。不同哺乳动物谱系在这些相似特征上的趋同，为趋同进化提供了一个引人注目的例子，即不相关的物种独立进化出相似的特征以应对相似的环境压力。"
  },
  {
    "id": "44560943",
    "title": "On doing hard things",
    "url": "https://parv.bearblog.dev/kayaking/",
    "summary": "This article recounts the author's unexpected journey into kayaking, highlighting the challenges and rewards of pursuing a physically demanding activity despite a lack of natural aptitude. Initially struggling with capsizing and coordination, the author found something compelling in the process of learning and improving.\n\nThe piece emphasizes that progress in kayaking, and perhaps in life, isn't always linear or readily apparent. It’s characterized by incremental improvements, a deeper understanding of the environment, and a growing comfort with failure. The author appreciates the meditative quality of the sport and the supportive environment fostered by their team captain.\n\nDespite never becoming a top performer, the author eventually made the varsity team and participated in an inter-tertiary race, marking significant personal achievements. The experience taught the author to embrace looking foolish in public, a valuable lesson applicable beyond the sport itself. The article concludes by framing kayaking as a metaphor for life, where persistent effort in the face of difficulty can lead to unexpected growth and a unique appreciation for the journey, even without achieving ultimate success. The author also touches upon the importance of valuing \"almost-stories\" as much as success stories, acknowledging the inherent dignity in persevering despite challenges.\n",
    "chinese_title": "做难事",
    "chinese_summary": "本文讲述了作者出人意料地开始皮划艇运动的经历，强调了在缺乏天赋的情况下追求一项对体能要求极高的活动的挑战和回报。起初，作者在翻船和协调性方面困难重重，但在学习和进步的过程中发现了一些引人入胜的东西。\n\n文章强调，皮划艇运动的进步，或许人生的进步，并非总是线性的或显而易见的。它以渐进式的提高、对环境更深入的理解以及对失败越来越坦然为特征。作者欣赏这项运动的冥想品质以及他们的队长营造的支持性环境。\n\n尽管从未成为顶尖选手，但作者最终进入了校队并参加了大学间比赛，这标志着重要的个人成就。这次经历教会了作者欣然接受在公共场合出丑，这是一个适用于运动之外的宝贵教训。文章最后将皮划艇运动比作人生，在面对困难时坚持不懈的努力可以带来意想不到的成长和对旅程的独特欣赏，即使没有取得最终的成功。作者还谈到了重视“差一点成功的故事”与成功故事同等重要的意义，承认在挑战中坚持不懈的内在尊严。"
  },
  {
    "id": "44584372",
    "title": "Ex-Waymo engineers launch Bedrock Robotics to automate construction",
    "url": "https://techcrunch.com/2025/07/16/ex-waymo-engineers-launch-bedrock-robotics-with-80m-to-automate-construction/",
    "summary": "Bedrock Robotics, founded by ex-Waymo and Segment engineers, has emerged from stealth mode with $80 million in funding from Eclipse and 8VC to develop self-driving kits for retrofitting construction and worksite vehicles. Led by CEO Boris Sofman, formerly of Waymo's self-driving truck program and Anki Robotics, Bedrock aims to upgrade existing vehicle fleets with sensors and AI, enabling them to understand project goals, adapt to conditions, and operate around the clock.\n\nThe company is targeting the construction industry, with testing underway in Arkansas, Arizona, Texas, and California in collaboration with Sundt Construction, Zachry Construction Corporation, Champion Site Prep Inc., and Capitol Aggregates Inc.\n\nBedrock is part of a growing trend of autonomous vehicle startups applying self-driving technology to off-road environments. The article mentions several other companies in this space, including Pronto (which recently acquired SafeAI), Kodiak Robotics, Polymath Robotics, Overland AI, Potential, and Forterra. The broader off-road autonomy sector is described as fragmented.\n\nThe article also mentions TechCrunch Disrupt 2025 which will take place in San Francisco, October 27-29, 2025 and features heavy hitters from tech and VC delivering insight to fuel startup growth.\n",
    "chinese_title": "前Waymo工程师创办Bedrock Robotics，以实现建筑自动化",
    "chinese_summary": "由前Waymo和Segment工程师创立的Bedrock Robotics公司，带着Eclipse和8VC提供的8000万美元资金，从隐身模式中走出，致力于为改造建筑和工地车辆开发自动驾驶套件。在首席执行官Boris Sofman（曾任Waymo自动驾驶卡车项目和Anki Robotics高管）的领导下，Bedrock旨在通过传感器和人工智能升级现有车队，使其能够理解项目目标、适应环境并在全天候运营。\n\n该公司瞄准建筑行业，目前正在阿肯色州、亚利桑那州、德克萨斯州和加利福尼亚州与Sundt Construction、Zachry Construction Corporation、Champion Site Prep Inc.和Capitol Aggregates Inc.合作进行测试。\n\nBedrock是众多将自动驾驶技术应用于越野环境的自动驾驶汽车初创公司中的一员。文章提到了该领域的其他几家公司，包括Pronto（最近收购了SafeAI）、Kodiak Robotics、Polymath Robotics、Overland AI、Potential和Forterra。更广泛的越野自动驾驶领域被描述为分散的。\n\n文章还提到了将于2025年10月27日至29日在旧金山举行的TechCrunch Disrupt 2025大会，届时来自科技界和风险投资界的重要人物将分享见解，助力初创企业发展。"
  },
  {
    "id": "44582662",
    "title": "Show HN: Improving search ranking with chess Elo scores",
    "url": "https://www.zeroentropy.dev/blog/improving-rag-with-elo-scores",
    "summary": "This \"Show HN\" post highlights an attempt to improve the performance of Retrieval Augmented Generation (RAG) systems by leveraging Elo scores. The core idea is to use Elo, a rating system commonly used in chess, to evaluate and rank the relevance and accuracy of documents retrieved by the RAG system.\n\nThe author likely proposes using Elo to compare different documents based on their ability to answer a given query accurately. A document that consistently provides better answers than others against the same queries would have a higher Elo rating.\n\nThis ranking mechanism could then be integrated into the RAG pipeline in several ways, such as:\n\n*   **Prioritizing higher-Elo documents:** When multiple documents are retrieved, the system could prioritize documents with higher Elo scores when generating the final answer.\n*   **Filtering low-Elo documents:** Documents with Elo scores below a certain threshold could be filtered out to reduce noise and improve the accuracy of the generated response.\n*   **Using Elo scores as a weighting factor:** The Elo score could be used as a weighting factor in a scoring function that determines the relevance of each document to the query.\n\nThe expected benefit is improved RAG performance in terms of accuracy, relevance, and coherence by ensuring that the system focuses on the most reliable and informative documents. The implementation would require a mechanism to evaluate document quality against a set of queries, likely using a ground truth dataset and an evaluation metric. The post is likely showcasing a novel approach to document ranking within a RAG context.\n",
    "chinese_title": "Show HN: 使用国际象棋等级分提高搜索排名",
    "chinese_summary": "这个“Show HN”帖子重点介绍了一种利用Elo评分提高检索增强生成（RAG）系统性能的尝试。核心思想是使用Elo（一种常用于国际象棋的评分系统）来评估和排序RAG系统检索到的文档的相关性和准确性。\n\n作者可能建议使用Elo来比较不同文档在准确回答给定查询方面的能力。针对相同查询，始终提供比其他文档更好答案的文档将具有更高的Elo评分。\n\n这种排名机制可以以多种方式集成到RAG流程中，例如：\n\n*   **优先处理高Elo文档：** 当检索到多个文档时，系统可以在生成最终答案时优先处理具有较高Elo评分的文档。\n*   **过滤低Elo文档：** 可以过滤掉Elo评分低于特定阈值的文档，以减少噪声并提高生成响应的准确性。\n*   **将Elo评分用作权重因子：** Elo评分可用作评分函数中的权重因子，该函数确定每个文档与查询的相关性。\n\n预期的好处是通过确保系统专注于最可靠和信息丰富的文档，从而提高RAG在准确性、相关性和连贯性方面的性能。 该实施将需要一种评估文档针对一系列查询质量的机制，可能使用真实数据集和评估指标。 该帖子很可能展示了一种在RAG环境中进行文档排名的新颖方法。"
  },
  {
    "id": "44605189",
    "title": "Temporal context of eye contact influences perceptions of communicative intent",
    "url": "https://royalsocietypublishing.org/doi/10.1098/rsos.250277",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "眼神交流的时间背景影响对沟通意图的感知",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "44599405",
    "title": "Running Linux on my Amiga 4000",
    "url": "http://sandervanderburg.blogspot.com/2025/01/running-linux-on-my-amiga-4000.html",
    "summary": "This blog post details the author's journey to running Linux on an Amiga 4000 in 2025, motivated by both nostalgia and a connection between their Amiga experiences and their eventual adoption of Linux. The author recounts the decline of the Amiga platform after Commodore's demise and their transition to PCs running MS-DOS and Windows. Initially unimpressed by the instability and resource-intensive nature of Windows 95, they discovered Linux through PC magazines and the DOS UAE emulator.\n\nTheir first hands-on experience with Linux in 1999, thanks to a cousin studying Computer Science, impressed them with its multitasking, command-line interface, powerful filesystem, security features, modularity, and available applications. They highlight the collaborative development model of Linux, involving Linus Torvalds, the GNU project, and various community efforts.\n\nThe author faced challenges installing Linux on their home computer due to driver issues. During this process, they discovered Linux's portability to various architectures, including the Amiga. Now with a 68040-equipped Amiga 4000, they revisit the idea of running Linux on it. The post ends by noting that the actively developed Debian distribution still maintains an m68k port and getting started with Linux on the Amiga can be a challenge due to lack of readily available distrobutions.\n",
    "chinese_title": "Running Linux on my Amiga 4000",
    "chinese_summary": "This blog post details the author's journey to running Linux on an Amiga 4000 in 2025, motivated by both nostalgia and a connection between their Amiga experiences and their eventual adoption of Linux. The author recounts the decline of the Amiga platform after Commodore's demise and their transition to PCs running MS-DOS and Windows. Initially unimpressed by the instability and resource-intensive nature of Windows 95, they discovered Linux through PC magazines and the DOS UAE emulator.\n\nTheir first hands-on experience with Linux in 1999, thanks to a cousin studying Computer Science, impressed them with its multitasking, command-line interface, powerful filesystem, security features, modularity, and available applications. They highlight the collaborative development model of Linux, involving Linus Torvalds, the GNU project, and various community efforts.\n\nThe author faced challenges installing Linux on their home computer due to driver issues. During this process, they discovered Linux's portability to various architectures, including the Amiga. Now with a 68040-equipped Amiga 4000, they revisit the idea of running Linux on it. The post ends by noting that the actively developed Debian distribution still maintains an m68k port and getting started with Linux on the Amiga can be a challenge due to lack of readily available distrobutions.\n"
  },
  {
    "id": "44599984",
    "title": "Louisiana cancels $3B coastal repair funded by oil spill settlement",
    "url": "https://apnews.com/article/louisiana-coastal-restoration-gulf-oil-spill-affaae2877bf250f636a633a14fbd0c7",
    "summary": "生成摘要时出错",
    "chinese_title": "Louisiana cancels $3B coastal repair funded by oil spill settlement",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44586530",
    "title": "Metaflow: Build, Manage and Deploy AI/ML Systems",
    "url": "https://github.com/Netflix/metaflow",
    "summary": "生成摘要时出错",
    "chinese_title": "Metaflow：构建、管理和部署AI/ML系统",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44601045",
    "title": "Linux and Secure Boot certificate expiration",
    "url": "https://lwn.net/SubscriberLink/1029767/08f1d17c020e8292/",
    "summary": "生成摘要时出错",
    "chinese_title": "Linux and Secure Boot certificate expiration",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44588491",
    "title": "“Reading Rainbow” was created to combat summer reading slumps",
    "url": "https://www.smithsonianmag.com/smithsonian-institution/to-combat-summer-reading-slumps-this-timeless-childrens-television-show-tried-to-bridge-the-literacy-gap-with-the-magic-of-stories-180986984/",
    "summary": "\"Reading Rainbow,\" the beloved children's program hosted by LeVar Burton, premiered on PBS in 1983 to combat the \"summer slide,\" a decline in literacy skills among children during summer break. The show ran for 23 years, won numerous awards, and is seen as a key example of a program promoting literacy, reading comprehension, and the joy of storytelling.\n\nEach episode featured Burton introducing a children’s book and its subject matter through real-world field trips, followed by a reading of the book by a celebrity. The program also incorporated children's book reviews.\n\nThe show's creation originated at WNED-TV in Buffalo, New York, where Tony Buttino, Barbara Irwin, and Pam Johnson collaborated. They sought a host who could genuinely connect with children and found that person in LeVar Burton. Despite an initial rejection of their proposal, the team persevered and eventually partnered with Great Plains National to secure funding for the show.\n\n“Reading Rainbow” was highly successful, praised by teachers as the best educational program, and inspired a lifelong love of reading in its viewers. It stood out for its unique format of combining book illustrations with Burton's real-life adventures, showcasing diverse people and places. According to Irwin, \"no series did it any better than ‘Reading Rainbow’ did.\"\n",
    "chinese_title": "“Reading Rainbow” was created to combat summer reading slumps",
    "chinese_summary": "\"Reading Rainbow,\" the beloved children's program hosted by LeVar Burton, premiered on PBS in 1983 to combat the \"summer slide,\" a decline in literacy skills among children during summer break. The show ran for 23 years, won numerous awards, and is seen as a key example of a program promoting literacy, reading comprehension, and the joy of storytelling.\n\nEach episode featured Burton introducing a children’s book and its subject matter through real-world field trips, followed by a reading of the book by a celebrity. The program also incorporated children's book reviews.\n\nThe show's creation originated at WNED-TV in Buffalo, New York, where Tony Buttino, Barbara Irwin, and Pam Johnson collaborated. They sought a host who could genuinely connect with children and found that person in LeVar Burton. Despite an initial rejection of their proposal, the team persevered and eventually partnered with Great Plains National to secure funding for the show.\n\n“Reading Rainbow” was highly successful, praised by teachers as the best educational program, and inspired a lifelong love of reading in its viewers. It stood out for its unique format of combining book illustrations with Burton's real-life adventures, showcasing diverse people and places. According to Irwin, \"no series did it any better than ‘Reading Rainbow’ did.\"\n"
  },
  {
    "id": "44586723",
    "title": "I want an iPhone Mini-sized Android phone (2022)",
    "url": "https://smallandroidphone.com/",
    "summary": "生成摘要时出错",
    "chinese_title": "I want an iPhone Mini-sized Android phone (2022)",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44601296",
    "title": "This month in Servo: network inspector, a11y first steps, WebDriver, and more",
    "url": "https://servo.org/blog/2025/07/17/this-month-in-servo/",
    "summary": "生成摘要时出错",
    "chinese_title": "This month in Servo: network inspector, a11y first steps, WebDriver, and more",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44590678",
    "title": "NINA: Rebuilding the original AIM, AOL Desktop, Yahoo and ICQ platforms",
    "url": "https://nina.chat/",
    "summary": "生成摘要时出错",
    "chinese_title": "NINA: Rebuilding the original AIM, AOL Desktop, Yahoo and ICQ platforms",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44589384",
    "title": "Xbox Hacks: The A20 (2021)",
    "url": "https://connortumbleson.com/2021/07/19/the-xbox-and-a20-line/",
    "summary": "生成摘要时出错",
    "chinese_title": "Xbox Hacks: The A20 (2021)",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44597537",
    "title": "ICE's Supercharged Facial Recognition App of 200M Images",
    "url": "https://www.404media.co/inside-ices-supercharged-facial-recognition-app-of-200-million-images/",
    "summary": "生成摘要时出错",
    "chinese_title": "ICE's Supercharged Facial Recognition App of 200M Images",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44591988",
    "title": "Retro gaming YouTuber Once Were Nerd sued and raided by the Italian government",
    "url": "https://www.androidauthority.com/once-were-nerd-youtuber-copyright-lawsuit-3577995/",
    "summary": "生成摘要时出错",
    "chinese_title": "Retro gaming YouTuber Once Were Nerd sued and raided by the Italian government",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44572954",
    "title": "A 1960s schools experiment that created a new alphabet",
    "url": "https://www.theguardian.com/education/2025/jul/06/1960s-schools-experiment-created-new-alphabet-thousands-children-unable-to-spell",
    "summary": "生成摘要时出错",
    "chinese_title": "A 1960s schools experiment that created a new alphabet",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44590189",
    "title": "Wttr: Console-oriented weather forecast service",
    "url": "https://github.com/chubin/wttr.in",
    "summary": "生成摘要时出错",
    "chinese_title": "Wttr: Console-oriented weather forecast service",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44567857",
    "title": "LLM Inevitabilism",
    "url": "https://tomrenner.com/posts/llm-inevitabilism/",
    "summary": "生成摘要时出错",
    "chinese_title": "LLM Inevitabilism",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44578143",
    "title": "Six Years of Gemini",
    "url": "https://geminiprotocol.net/news/2025_06_20.gmi",
    "summary": "生成摘要时出错",
    "chinese_title": "Six Years of Gemini",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44556997",
    "title": "Archaeologists discover tomb of first king of Caracol",
    "url": "https://uh.edu/news-events/stories/2025/july/07102025-caracol-chase-discovery-maya-ruler.php",
    "summary": "生成摘要时出错",
    "chinese_title": "Archaeologists discover tomb of first king of Caracol",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44606184",
    "title": "Valve confirms credit card companies pressured it to delist certain adult games",
    "url": "https://www.pcgamer.com/software/platforms/valve-confirms-credit-card-companies-pressured-it-to-delist-certain-adult-games-from-steam/",
    "summary": "生成摘要时出错",
    "chinese_title": "Valve confirms credit card companies pressured it to delist certain adult games",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44604365",
    "title": "ACA health insurance will cost the average person 75% more next year",
    "url": "https://www.npr.org/sections/shots-health-news/2025/07/18/nx-s1-5471281/aca-health-insurance-premiums-obamacare-bbb-kff",
    "summary": "生成摘要时出错",
    "chinese_title": "ACA health insurance will cost the average person 75% more next year",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44601562",
    "title": "Why is AI so slow to spread?",
    "url": "https://www.economist.com/finance-and-economics/2025/07/17/why-is-ai-so-slow-to-spread-economics-can-explain",
    "summary": "生成摘要时出错",
    "chinese_title": "Why is AI so slow to spread?",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44545708",
    "title": "Scanned piano rolls database",
    "url": "http://www.pianorollmusic.org/rolldatabase.php",
    "summary": "生成摘要时出错",
    "chinese_title": "Scanned piano rolls database",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44583171",
    "title": "Altermagnets: The first new type of magnet in nearly a century",
    "url": "https://www.newscientist.com/article/2487013-weve-discovered-a-new-kind-of-magnetism-what-can-we-do-with-it/",
    "summary": "生成摘要时出错",
    "chinese_title": "Altermagnets: The first new type of magnet in nearly a century",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44578070",
    "title": "LLM Daydreaming",
    "url": "https://gwern.net/ai-daydreaming",
    "summary": "生成摘要时出错",
    "chinese_title": "LLM Daydreaming",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44591605",
    "title": "Parsing Protobuf Like Never Before",
    "url": "https://mcyoung.xyz/2025/07/16/hyperpb/",
    "summary": "生成摘要时出错",
    "chinese_title": "Parsing Protobuf Like Never Before",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44549089",
    "title": "What's happening to reading?",
    "url": "https://www.newyorker.com/culture/open-questions/whats-happening-to-reading",
    "summary": "生成摘要时出错",
    "chinese_title": "What's happening to reading?",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44569540",
    "title": "Game of trees hub",
    "url": "https://gothub.org/",
    "summary": "生成摘要时出错",
    "chinese_title": "Game of trees hub",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44547105",
    "title": "Show HN: 0xDEAD//TYPE – A fast-paced typing shooter with retro vibes",
    "url": "https://0xdeadtype.theden.sh/",
    "summary": "生成摘要时出错",
    "chinese_title": "Show HN: 0xDEAD//TYPE – A fast-paced typing shooter with retro vibes",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44565806",
    "title": "Roman dodecahedron: 12-sided object has baffled archaeologists for centuries",
    "url": "https://www.livescience.com/archaeology/romans/roman-dodecahedron-a-mysterious-12-sided-object-that-has-baffled-archaeologists-for-centuries",
    "summary": "生成摘要时出错",
    "chinese_title": "Roman dodecahedron: 12-sided object has baffled archaeologists for centuries",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44555924",
    "title": "Writing a competitive BZip2 encoder in Ada from scratch in a few days (2024)",
    "url": "https://gautiersblog.blogspot.com/2024/11/writing-bzip2-encoder-in-ada-from.html",
    "summary": "生成摘要时出错",
    "chinese_title": "Writing a competitive BZip2 encoder in Ada from scratch in a few days (2024)",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44573193",
    "title": "What's going on with gene therapies?",
    "url": "https://nehalslearnings.substack.com/p/whats-going-on-with-gene-therapies",
    "summary": "生成摘要时出错",
    "chinese_title": "What's going on with gene therapies?",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44576312",
    "title": "Claude for Financial Services",
    "url": "https://www.anthropic.com/news/claude-for-financial-services",
    "summary": "生成摘要时出错",
    "chinese_title": "Claude for Financial Services",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44585543",
    "title": "Signs of autism could be encoded in the way you walk",
    "url": "https://www.sciencealert.com/signs-of-autism-could-be-encoded-in-the-way-you-walk",
    "summary": "生成摘要时出错",
    "chinese_title": "Signs of autism could be encoded in the way you walk",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44541662",
    "title": "MARS.EXE → COM (2021)",
    "url": "https://chaos.if.uj.edu.pl/~wojtek/MARS.COM/",
    "summary": "生成摘要时出错",
    "chinese_title": "MARS.EXE → COM (2021)",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44560123",
    "title": "From engineer to manager: A practical guide to your first months in leadership",
    "url": "https://humansinsystems.com/blog/new-manager-essentials-a-practical-guide-to-your-first-months",
    "summary": "生成摘要时出错",
    "chinese_title": "From engineer to manager: A practical guide to your first months in leadership",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44541088",
    "title": "Running a million-board chess MMO in a single process",
    "url": "https://eieio.games/blog/a-million-realtime-chess-boards-in-a-single-process/",
    "summary": "生成摘要时出错",
    "chinese_title": "Running a million-board chess MMO in a single process",
    "chinese_summary": "生成摘要时出错"
  }
]