[
  {
    "id": "46052478",
    "title": "Learning Music with Strudel",
    "url": "https://terryds.notion.site/Learning-Music-with-Strudel-2ac98431b24180deb890cc7de667ea92",
    "summary": "The article, titled \"Learning Music with Strudel,\" appears to be about using Strudel in Notion for music education. However, the provided content is extremely limited, consisting only of a message indicating that JavaScript is required to use Notion.\n\nBecause of this limitation, it's impossible to determine the specifics of how Strudel is used for learning music. The only takeaway is that the article likely discusses how a tool called \"Strudel\" can be implemented within Notion to aid in music education, but accessing the actual content describing its functionality requires enabling JavaScript in the Notion environment. We have no details about what Strudel *is* or *how* it facilitates learning music.\n",
    "chinese_title": "使用Strudel学习音乐",
    "chinese_summary": "题为“用Strudel学习音乐”的文章似乎是关于在Notion中使用Strudel进行音乐教育的。然而，提供的内容非常有限，仅包含一条指示使用Notion需要JavaScript的消息。\n\n因此，无法确定Strudel如何用于学习音乐的具体细节。唯一的结论是，这篇文章可能讨论了如何在Notion中实施一个名为“Strudel”的工具来帮助音乐教育，但要访问描述其功能的实际内容，需要在Notion环境中启用JavaScript。我们没有任何关于Strudel*是什么*或*如何*促进音乐学习的细节。"
  },
  {
    "id": "46121889",
    "title": "Mistral 3 family of models released",
    "url": "https://mistral.ai/news/mistral-3",
    "summary": "Mistral AI has released its next generation of models, the Mistral 3 family, under the Apache 2.0 license. This includes:\n\n*   **Mistral Large 3:** A state-of-the-art, open-weight, sparse mixture-of-experts model (41B active, 675B total parameters) trained on NVIDIA H200 GPUs. It excels in general prompts, image understanding, and multilingual conversations. Base and instruction fine-tuned versions are available.\n*   **Ministral 3 Series:** Three small, dense models (3B, 8B, and 14B parameters) for edge and local use cases, each with base, instruct, and reasoning variants, all featuring image understanding capabilities. They are designed for optimal performance-to-cost ratio.\n\nThe models are optimized for accessibility and speed through collaborations with vLLM, Red Hat, and NVIDIA, including an NVFP4 checkpoint and efficient inference support on NVIDIA hardware.\n\nMistral Large 3 debuts high on the LMArena leaderboard. The Ministral 3 series offers tailored options for various needs, including edge deployments, with state-of-the-art accuracy.\n\nThe models are available on various platforms like Mistral AI Studio, Amazon Bedrock, Azure Foundry, and Hugging Face. Mistral AI also offers custom model training services.\n\nMistral AI emphasizes open access, transparency, and collaboration, inviting the community to explore and build with the new models.\n",
    "chinese_title": "Mistral 3 模型系列发布",
    "chinese_summary": "Mistral AI发布新一代模型Mistral 3系列，采用Apache 2.0许可。其中包括：\n\n*   **Mistral Large 3:** 一款最先进的开放权重稀疏混合专家模型（410亿活跃参数，6750亿总参数），在NVIDIA H200 GPU上训练而成。它擅长通用提示、图像理解和多语言对话。提供基础版本和指令微调版本。\n*   **Ministral 3系列:** 三款小型密集模型（30亿、80亿和140亿参数），适用于边缘和本地用例，每款均有基础版、指令版和推理版，均具备图像理解能力。它们旨在实现最佳的性能成本比。\n\n这些模型通过与vLLM、Red Hat和NVIDIA的合作进行了优化，以提高可访问性和速度，包括NVFP4检查点和在NVIDIA硬件上高效的推理支持。\n\nMistral Large 3在LMArena排行榜上名列前茅。Ministral 3系列为各种需求（包括边缘部署）提供量身定制的选择，并具有最先进的准确性。\n\n这些模型可在Mistral AI Studio、Amazon Bedrock、Azure Foundry和Hugging Face等多个平台上使用。Mistral AI还提供定制模型训练服务。\n\nMistral AI强调开放访问、透明度和协作，邀请社区探索和构建新的模型。"
  },
  {
    "id": "46121799",
    "title": "Nixtml: Static website and blog generator written in Nix",
    "url": "https://github.com/arnarg/nixtml",
    "summary": "Nixtml is a static website and blog generator written in Nix, inspired by Hugo. It uses Nix to define the website structure, content processing, and theming.\n\n**Key Features:**\n\n*   **Nix-powered:** Leverages Nix for reproducibility and declarative configuration.\n*   **Markdown Content:** Transforms markdown files into HTML pages.\n*   **Templating:** Uses Nix functions for HTML templates, supporting both functional HTML and string templating. Standard templates include `base`, `hom`, `page`, `collection`, `taxonomy`, and `partials` for customization.\n*   **Collections:** Groups and paginates content, like blog posts, with RSS feed generation.\n*   **Taxonomies:** Organizes content by keywords (tags, categories), creating dedicated pages for each term.\n*   **Flexibility:** Provides functions for common HTML tags for programmatic construction of HTML.\n*   **Examples:** Offers example configurations for simple websites and blogs.\n\n**Workflow:**\n\n1.  A `flake.nix` file defines the website structure, dependencies (including `nixtml`), and build process.\n2.  Content is placed in a specified directory (`content.dir`).\n3.  Collections and taxonomies are configured to group and categorize content.\n4.  Templates define the website's layout and styling.\n5.  Nixtml processes the content and templates, generating a static website that can be deployed.\n\nThe framework enables website creation through Nix-driven automation, offering flexibility in theming, content organization, and overall site structure.\n",
    "chinese_title": "Nixtml：用Nix编写的静态网站和博客生成器",
    "chinese_summary": "Nixtml 是一个用 Nix 编写的静态网站和博客生成器，灵感来源于 Hugo。它使用 Nix 来定义网站结构、内容处理和主题。\n\n**主要特性：**\n\n*   **Nix 驱动：** 利用 Nix 实现可复现性和声明式配置。\n*   **Markdown 内容：** 将 Markdown 文件转换为 HTML 页面。\n*   **模板：** 使用 Nix 函数作为 HTML 模板，支持函数式 HTML 和字符串模板。标准模板包括 `base`、`hom`、`page`、`collection`、`taxonomy` 和 `partials` 用于自定义。\n*   **集合（Collections）：** 对内容进行分组和分页，例如博客文章，并生成 RSS 订阅。\n*   **分类（Taxonomies）：** 通过关键词（标签、类别）组织内容，为每个术语创建专用页面。\n*   **灵活性：** 提供用于常见 HTML 标签的函数，以实现 HTML 的程序化构建。\n*   **示例：** 提供简单网站和博客的示例配置。\n\n**工作流程：**\n\n1.  `flake.nix` 文件定义网站结构、依赖项（包括 `nixtml`）和构建过程。\n2.  内容放置在指定的目录 (`content.dir`) 中。\n3.  配置集合和分类以对内容进行分组和分类。\n4.  模板定义网站的布局和样式。\n5.  Nixtml 处理内容和模板，生成可以部署的静态网站。\n\n该框架通过 Nix 驱动的自动化实现网站创建，在主题、内容组织和整体网站结构方面提供灵活性。"
  },
  {
    "id": "46120181",
    "title": "Addressing the adding situation",
    "url": "https://xania.org/202512/02-adding-integers",
    "summary": "This article, \"Addressing the Adding Situation,\" explores how compilers handle simple integer addition on x86 architectures, which have a limitation of two operands per instruction for most operations. Unlike architectures like ARM, x86's `add` instruction performs \"lhs += rhs\" instead of \"result = lhs + rhs,\" making it less flexible for controlling the result's destination register and potentially losing the original value of the left-hand side.\n\nThe author demonstrates how compilers leverage x86's sophisticated memory addressing system and the `lea` (Load Effective Address) instruction to overcome this limitation. `lea` calculates a memory address without actually accessing memory, effectively turning the addressing hardware into a calculator. By using the register-plus-register-times-scale addressing mode, `lea` can perform three-operand addition. The compiler crafts an instruction that computes the memory address at `rdi` offset by `rsi`, placing the result in a specified register (e.g., `eax`).\n\nThe author notes that although a 64-bit address is calculated, the upper bits are discarded when writing to a 32-bit register, relying on ABI conventions. Using `lea` can save instructions, preserve operand values for later use, and potentially execute faster due to x86's multiple execution units. While compilers handle this optimization automatically, understanding the underlying mechanism provides insights into compiler optimization strategies.\n",
    "chinese_title": "解决添加问题",
    "chinese_summary": "应对加法困境：编译器如何利用x86指令实现三操作数加法"
  },
  {
    "id": "46047170",
    "title": "YesNotice",
    "url": "https://infinitedigits.co/docs/software/yesnotice/",
    "summary": "YesNotice, launched on October 10, 2025, is a website designed to notify users the instant something they're tracking changes from a negative (\"no\") state to a positive (\"yes\") state. It's categorized as both software and portfolio related. The core function of YesNotice is proactive alerting, informing users immediately when a specific condition or status shifts in their favor. Essentially, it automates the process of monitoring for positive changes and eliminates the need for constant manual checking.\n",
    "chinese_title": "注意通知",
    "chinese_summary": "YesNotice，于2025年10月10日上线，是一个旨在通知用户所追踪事项从否定（“否”）状态变为肯定（“是”）状态的网站。它被归类为软件和投资组合相关。YesNotice的核心功能是主动提醒，在特定条件或状态朝着有利于用户的方向转变时立即通知用户。本质上，它自动化了监控积极变化的过程，无需进行持续的手动检查。"
  },
  {
    "id": "46119500",
    "title": "Advent of Compiler Optimisations 2025",
    "url": "https://xania.org/202511/advent-of-compiler-optimisation",
    "summary": "The author is announcing \"Advent of Compiler Optimisations 2025,\" a daily project running from December 1st to December 25th. Each day will feature a blog post and video detailing a different C or C++ compiler optimisation. The content will cover both low-level, architecture-specific tricks and high-level optimizations, primarily focusing on x86-64 but also touching on 64-bit and 32-bit ARM. The author will explain when each optimization applies, how to interpret the resulting assembly code, and when it might not be applicable. The project aims to showcase the amazing capabilities of modern compilers. Readers can follow along via the AoCO2025 blog tag, YouTube subscription, or a dedicated YouTube playlist.\n",
    "chinese_title": "2025编译器优化前沿",
    "chinese_summary": "作者宣布推出“2025编译器优化降临”活动，这是一个从12月1日到12月25日每日更新的项目。每天将发布一篇博文和一个视频，详细介绍一种不同的C或C++编译器优化。内容将涵盖底层、特定于架构的技巧和高层优化，主要侧重于x86-64，但也涉及64位和32位ARM。作者将解释每种优化何时适用、如何解释生成的汇编代码以及何时可能不适用。该项目旨在展示现代编译器令人惊叹的功能。读者可以通过AoCO2025博客标签、YouTube订阅或专门的YouTube播放列表来关注。"
  },
  {
    "id": "46123374",
    "title": "Poka Labs (YC S24) Is Hiring a Founding Engineer",
    "url": "https://www.ycombinator.com/companies/poka-labs/jobs/RCQgmqB-founding-engineer",
    "summary": "Poka Labs, a Y Combinator (S24) startup, is seeking a Founding Engineer to build the \"intelligence layer\" for the chemical manufacturing industry, a $6 trillion sector ripe for digitization and AI transformation. The role offers a salary of $130K - $180K with 1-3% equity, and requires relocation to San Francisco.\n\nThe Founding Engineer will own ambiguous problem areas, shipping production AI agents used daily by various teams within manufacturing companies. Responsibilities include building end-to-end agents for quoting, pricing, and inventory management, integrating with ERPs and CRMs, and shaping product experiences. The role involves working on both frontend and backend features, ensuring agent reliability, and evaluating new AI capabilities.\n\nPoka Labs seeks someone with strong full-stack abilities, a bias for action, clear communication skills, and the ability to learn quickly. Their tech stack includes modern LLMs, TypeScript, React, and AWS. The company offers significant ownership, impact in global manufacturing, culture shaping, and direct collaboration with founders. The interview process includes intro calls, a take-home technical assessment, and a paid work trial. Poka Labs was founded in 2023 and has a team of 3.\n",
    "chinese_title": "Poka Labs (YC S24) 招聘创始工程师",
    "chinese_summary": "Poka Labs（Y Combinator S24孵化企业）正在招募创始工程师，为亟待数字化和人工智能转型的6万亿美元化工制造业构建“智能层”。该职位年薪13万至18万美元，股权1-3%，要求搬迁至旧金山。\n\n创始工程师将负责处理模糊的问题领域，交付制造企业各团队每日使用的生产级人工智能代理。职责包括构建端到端代理，用于报价、定价和库存管理，集成ERP和CRM系统，并塑造产品体验。该职位涉及前端和后端功能开发，确保代理的可靠性，以及评估新的人工智能能力。\n\nPoka Labs正在寻找具备强大的全栈能力、行动导向、清晰的沟通技巧和快速学习能力的人才。其技术栈包括现代LLM、TypeScript、React和AWS。公司提供重要的所有权、在全球制造业的影响力、塑造企业文化的机会，以及与创始人直接合作的机会。面试流程包括初步沟通、居家技术评估和带薪工作试用。Poka Labs成立于2023年，目前团队有3人。"
  },
  {
    "id": "46094460",
    "title": "I Designed and Printed a Custom Nose Guard to Help My Dog with DLE",
    "url": "https://snoutcover.com/billie-story",
    "summary": "Billie, a pitbull, was diagnosed with Discoid Lupus Erythematosus (DLE), causing pigment loss, crusting, pain, and bleeding on her nose, exacerbated by sunlight. Traditional treatments like medicated ointment and sunscreen were ineffective as Billie would lick them off. Existing nose shields were also unsuccessful.\n\nDriven by desperation and equipped with a 3D printer, Billie's owner designed SnoutCover, a custom nose guard. The design process involved numerous iterations, starting with PLA for measurement and then transitioning to flexible TPU for comfort. Early prototypes lacked ventilation, leading to discomfort. Subsequent versions focused on adding strategic ventilation holes while blocking UV rays.\n\nAfter 13 iterations, the final SnoutCover design protected Billie's nose from sunlight, allowed her to breathe and eat normally, prevented her from licking off medication, and stayed comfortably in place. Within five months of using SnoutCover, Billie's bleeding stopped, crusting reduced, pigment returned, and her nose healed completely.\n\nSharing Billie's success online resulted in an overwhelming response from other dog owners facing similar challenges. The owner is now sharing the SnoutCover design for free on MakerWorld, hoping to help other dogs with DLE live pain-free and healthy lives. The design is intended for medium to large dogs and can be adjusted via scaling in slicing software.\n",
    "chinese_title": "我设计并打印了一个定制的鼻罩来帮助我的狗对抗DLE。",
    "chinese_summary": "比利，一只比特犬，被诊断患有盘状红斑狼疮(DLE)，导致她的鼻子出现色素脱失、结痂、疼痛和出血，阳光会加剧病情。传统的治疗方法，如药用软膏和防晒霜，都无效，因为比利会把它们舔掉。现有的鼻子防护罩也都不成功。\n\n出于绝望并配备了3D打印机，比利的主人设计了SnoutCover，一个定制的鼻子防护罩。设计过程涉及多次迭代，最初使用PLA进行测量，然后过渡到柔软的TPU以提高舒适度。早期的原型缺乏通风，导致不适。随后的版本专注于增加战略性的通风孔，同时阻挡紫外线。\n\n经过13次迭代，最终的SnoutCover设计保护了比利的鼻子免受阳光照射，让她能够正常呼吸和进食，防止她舔掉药物，并舒适地固定到位。使用SnoutCover五个月后，比利的出血停止，结痂减少，色素恢复，她的鼻子完全痊愈。\n\n在网上分享比利的成功案例后，收到了来自其他面临类似挑战的狗主人的热烈反响。主人现在在MakerWorld上免费分享SnoutCover设计，希望帮助其他患有DLE的狗狗过上无痛且健康的生活。该设计适用于中大型犬，可以通过切片软件中的缩放进行调整。"
  },
  {
    "id": "46120611",
    "title": "Python Data Science Handbook",
    "url": "https://jakevdp.github.io/PythonDataScienceHandbook/",
    "summary": "The \"Python Data Science Handbook\" by Jake VanderPlas is a comprehensive resource for learning data science using Python. The full text is available online as Jupyter notebooks on GitHub under a CC-BY-NC-ND license (text) and MIT license (code). The handbook encourages users to support the work by purchasing the book.\n\nThe book covers a wide range of topics, starting with an in-depth exploration of IPython, including its features for help, shortcuts, magic commands, history, shell commands, debugging, profiling, and more. It then delves into NumPy, explaining data types, arrays, universal functions, aggregations, broadcasting, comparisons, indexing, sorting, and structured data.\n\nThe handbook continues with Pandas, focusing on data manipulation using Pandas objects, indexing, operations, handling missing data, hierarchical indexing, combining datasets (concat, merge, join), aggregation, grouping, pivot tables, vectorized string operations, time series, and high-performance techniques using `eval()` and `query()`.\n\nNext, it explores data visualization with Matplotlib, covering various plot types (line, scatter, contour, histograms), customization of plot elements (legends, colorbars, subplots, text, annotations, ticks), stylesheets, 3D plotting, geographic data with Basemap, and introduces Seaborn.\n\nFinally, the book covers machine learning with Scikit-Learn, including topics like model validation, feature engineering, and in-depth analyses of algorithms such as Naive Bayes, Linear Regression, Support Vector Machines, Decision Trees, Random Forests, Principal Component Analysis, Manifold Learning, k-Means Clustering, Gaussian Mixture Models, and Kernel Density Estimation. It concludes with an application on face detection and further machine learning resources.\n",
    "chinese_title": "Python数据科学手册",
    "chinese_summary": "Jake VanderPlas 编写的《Python数据科学手册》是使用 Python 学习数据科学的全面资源。完整文本可以作为 Jupyter 笔记本在 GitHub 上在线获取，采用 CC-BY-NC-ND 许可（文本）和 MIT 许可（代码）。该手册鼓励用户通过购买本书来支持这项工作。\n\n本书涵盖了广泛的主题，首先深入探讨了 IPython，包括其帮助、快捷方式、魔法命令、历史记录、 shell 命令、调试、性能分析等功能。然后深入研究 NumPy，解释了数据类型、数组、通用函数、聚合、广播、比较、索引、排序和结构化数据。\n\n该手册继续介绍 Pandas，重点介绍使用 Pandas 对象进行数据操作、索引、运算、处理缺失数据、分层索引、组合数据集（concat、merge、join）、聚合、分组、透视表、向量化字符串操作、时间序列以及使用 `eval()` 和 `query()` 的高性能技术。\n\n接下来，它探讨了使用 Matplotlib 进行数据可视化，涵盖各种绘图类型（折线图、散点图、轮廓图、直方图），绘图元素的自定义（图例、颜色条、子图、文本、注释、刻度线）、样式表、3D 绘图、使用 Basemap 的地理数据，并介绍了 Seaborn。\n\n最后，本书涵盖了使用 Scikit-Learn 进行的机器学习，包括模型验证、特征工程等主题，并深入分析了朴素贝叶斯、线性回归、支持向量机、决策树、随机森林、主成分分析、流形学习、k-Means 聚类、高斯混合模型和核密度估计等算法。最后以人脸检测的应用和进一步的机器学习资源作为结束。"
  },
  {
    "id": "46121860",
    "title": "Show HN: Marmot – Single-binary data catalog (no Kafka, no Elasticsearch)",
    "url": "https://github.com/marmotdata/marmot",
    "summary": "Marmot is an open-source, single-binary data catalog designed for simplifying data discovery across an organization's entire data stack. It aims to provide powerful search capabilities without the complexity of traditional enterprise solutions, requiring no Kafka or Elasticsearch.\n\nKey features include:\n\n*   **Easy Deployment:** Marmot can be deployed quickly using a single binary, Docker, or Kubernetes, requiring minimal setup.\n*   **Powerful Search:** Offers a rich query language with full-text, metadata filtering, boolean logic, and comparison operators to find any data asset.\n*   **Interactive Lineage Visualization:** Provides interactive dependency graphs to trace data flows and understand data lineage.\n*   **Flexible Integrations:** Supports CLI, REST API, Terraform, and Pulumi for cataloging assets.\n*   **Metadata-First Architecture:** Stores rich metadata for various asset types.\n*   **Team Collaboration:** Enables assigning ownership, documenting business context, and creating glossaries for centralized data knowledge.\n\nMarmot is licensed under the MIT License and welcomes contributions in the form of bug reports, feature suggestions, documentation improvements, and plugin development. Quickstart guides and a live demo are available for new users.\n",
    "chinese_title": "Show HN: Marmot - 单一二进制数据目录 (无需 Kafka, 无需 Elasticsearch)",
    "chinese_summary": "Marmot 是一个开源的单二进制数据目录，旨在简化组织机构整个数据栈中的数据发现。它旨在提供强大的搜索能力，而无需传统企业解决方案的复杂性，也不需要 Kafka 或 Elasticsearch。\n\n主要特点包括：\n\n*   **易于部署：** Marmot 可以使用单个二进制文件、Docker 或 Kubernetes 快速部署，只需最少的设置。\n*   **强大的搜索：** 提供丰富的查询语言，包括全文搜索、元数据过滤、布尔逻辑和比较运算符，以查找任何数据资产。\n*   **交互式血缘可视化：** 提供交互式依赖关系图，以跟踪数据流并理解数据血缘。\n*   **灵活的集成：** 支持 CLI、REST API、Terraform 和 Pulumi 进行资产编目。\n*   **元数据优先架构：** 存储各种资产类型的丰富元数据。\n*   **团队协作：** 允许分配所有权、记录业务背景以及创建术语表，以实现集中式数据知识管理。\n\nMarmot 根据 MIT 许可证获得许可，并欢迎以错误报告、功能建议、文档改进和插件开发的形式进行贡献。新用户可使用快速入门指南和在线演示。"
  },
  {
    "id": "46120549",
    "title": "A series of vignettes from my childhood and early career",
    "url": "https://www.jasonscheirer.com/weblog/vignettes/",
    "summary": "This article is a collection of anecdotes from the author's early career and childhood, satirizing recurring predictions of software engineering's demise due to technological advancements.\n\nThe first story recalls advice from 1996 suggesting that programming would soon be obsolete, replaced by pre-built object libraries assembled by non-programmers. The author notes that despite open source libraries and other advancements, software continues to be a viable profession.\n\nThe author then mocks the \"multimedia age\" hype of the 90s, where sound and video were considered essential, but ultimately became commonplace and unexceptional.\n\nAnother anecdote recounts a coworker's belief in the early 2000s that the IntelliJ IDE, with its refactoring tools, would eliminate programmers. The author countered that the tool only rearranged code, not creating new logic.\n\nFurther stories detail the author's experiences automating tasks. One involves creating a tool for a contractor to migrate data, potentially shortening the contractor's work and increasing their efficiency. Another tells of automating their own job maintaining a website, only to be reassigned to other tasks when the department hired a full-time developer.\n\nThe author also reflects on past ethical considerations in NLP projects, emphasizing the importance of respecting data licenses and web crawling protocols, contrasting this with current practices in the LLM field.\n\nFinally, the piece contrasts the dot-com boom's forced adoption of the internet with Web 2.0's organic growth, where internet use became commonplace and integrated into business models. The author concludes by stating that these anecdotes are \"passive-aggressive jabs\" aimed at the current hype surrounding LLMs.\n",
    "chinese_title": "童年和早期职业生涯的片段",
    "chinese_summary": "本文收集了作者早期职业生涯和童年时期的轶事，讽刺了由于技术进步而反复出现的关于软件工程将走向衰落的预测。\n\n第一个故事回忆了1996年的建议，该建议认为编程很快就会过时，取而代之的是由非程序员组装的预构建对象库。作者指出，尽管有开源库和其他进步，软件仍然是一个可行的职业。\n\n作者随后嘲笑了90年代的“多媒体时代”炒作，当时声音和视频被认为是必不可少的，但最终变得司空见惯和平淡无奇。\n\n另一个轶事讲述了2000年代初一位同事的信念，他认为IntelliJ IDE及其重构工具将淘汰程序员。作者反驳说，该工具只是重新排列代码，而不是创建新的逻辑。\n\n更多的故事详细描述了作者自动化任务的经验。其中一个涉及为承包商创建一个迁移数据的工具，有可能缩短承包商的工作时间并提高他们的效率。另一个讲述了作者自动化维护网站工作的故事，结果在部门雇佣了一名全职开发人员后，作者被重新分配到其他任务。\n\n作者还反思了过去NLP项目中涉及的伦理考虑，强调了尊重数据许可和网络爬行协议的重要性，并将此与当前LLM领域的实践形成对比。\n\n最后，文章将互联网泡沫时期对互联网的强制采用与Web 2.0的有机增长进行了对比，后者互联网的使用变得司空见惯并融入商业模式。作者总结说，这些轶事是针对当前围绕LLM的炒作的“消极攻击”。"
  },
  {
    "id": "46117802",
    "title": "Apple Releases Open Weights Video Model",
    "url": "https://starflow-v.github.io",
    "summary": "This article introduces STARFlow-V, a novel video generation model developed by Apple, based on normalizing flows (NFs). Unlike prevalent diffusion-based models, STARFlow-V leverages the benefits of NFs, including end-to-end training, exact likelihood estimation, and native multi-task support for text-to-video (T2V), image-to-video (I2V), and video-to-video (V2V) generation.\n\nKey features of STARFlow-V include:\n\n*   **Global-Local Architecture:** Separates global temporal reasoning (using a deep causal Transformer) from local within-frame details (using shallow flow blocks), mitigating error accumulation over time.\n*   **Flow-Score Matching:** Employs a lightweight causal denoiser trained with flow-score matching, improving video generation consistency.\n*   **Video-Aware Jacobi Iteration:** Uses a parallelizable iterative scheme for efficient sampling, significantly speeding up generation without sacrificing quality.\n\nThe 7B parameter model was trained on a massive dataset of 70M text-video pairs and 400M text-image pairs, enabling it to generate 480p videos at 16fps. STARFlow-V demonstrates strong visual fidelity and temporal consistency, achieving competitive performance compared to diffusion-based methods.\n\nThe article showcases the model's capabilities across various tasks, including generating high-quality videos from text prompts, creating videos from single images, and extending/transforming existing videos using techniques like inpainting and style transfer. The research establishes NFs as a promising direction for high-quality autoregressive video generation and building world models.\n",
    "chinese_title": "苹果发布开源权重视频模型",
    "chinese_summary": "本文介绍了STARFlow-V，这是一种由苹果公司开发的新型视频生成模型，它基于归一化流（NFs）。与流行的基于扩散的模型不同，STARFlow-V利用了NFs的优势，包括端到端训练、精确的似然估计以及对文本到视频（T2V）、图像到视频（I2V）和视频到视频（V2V）生成的原生多任务支持。\n\nSTARFlow-V的关键特性包括：\n\n*   **全局-局部架构：** 将全局时间推理（使用深度因果Transformer）与局部帧内细节（使用浅层流块）分离，从而减轻了随时间推移的误差累积。\n*   **流-分数匹配：** 采用通过流-分数匹配训练的轻量级因果去噪器，从而提高视频生成的一致性。\n*   **视频感知雅可比迭代：** 使用可并行化的迭代方案进行高效采样，在不牺牲质量的前提下显著加快生成速度。\n\n这个拥有70亿参数的模型在包含7000万个文本-视频对和4亿个文本-图像对的大规模数据集上进行了训练，使其能够以16fps生成480p的视频。STARFlow-V展示了强大的视觉逼真度和时间一致性，与基于扩散的方法相比，实现了具有竞争力的性能。\n\n本文展示了该模型在各种任务中的能力，包括从文本提示生成高质量视频、从单张图像创建视频，以及使用诸如图像修复和风格迁移等技术来扩展/转换现有视频。这项研究确立了NFs作为高质量自回归视频生成和构建世界模型的一个有希望的方向。"
  },
  {
    "id": "46117112",
    "title": "What will enter the public domain in 2026?",
    "url": "https://publicdomainreview.org/features/entering-the-public-domain/2026/",
    "summary": "The Public Domain Review highlights works entering the public domain in 2026, focusing on countries with different copyright laws. On January 1st, 2026, works will enter the public domain based on these rules:\n\n*   **Life plus 70 years:** Works by people who died in 1955 will become public domain in countries like the UK, Russia, most of the EU, and South America.\n*   **Life plus 50 years:** Works by people who died in 1975 will become public domain in countries like New Zealand and most of Africa and Asia.\n*   **United States:** Films and books (including featured artwork) published in 1930 will enter the public domain.\n\nThe article presents an \"advent-style calendar\" unveiling notable works that will be freed up throughout December, culminating on Public Domain Day (January 1st). Some highlights include:\n\n*   **Literature:** Langston Hughes' \"Not Without Laughter,\" Franz Kafka's \"The Castle\" (English translation), Agatha Christie's \"The Murder at the Vicarage,\" William Faulkner's \"As I Lay Dying,\" Dashiell Hammett's \"The Maltese Falcon,\" Virginia Woolf's \"Orlando,\" and P.G. Wodehouse.\n*   **Thinkers:** Albert Einstein, Sigmund Freud, Hannah Arendt\n*   **Music:** Charlie Parker\n*   **Other:** The 1930 film \"All Quiet on the Western Front.\"\n\nThe article also points to resources like John Mark Ockerbloom's countdown and Standard Ebooks' free versions of US entrants, and emphasizes the importance of the public domain, linking to Communia’s Public Domain Manifesto.\n",
    "chinese_title": "2026年将有哪些作品进入公有领域？",
    "chinese_summary": "公共领域评论聚焦2026年进入公有领域的作品，着重关注不同版权法的国家。2026年1月1日，作品将根据以下规则进入公有领域：\n\n*   **作者去世后70年：** 1955年去世的作者的作品将在英国、俄罗斯、欧盟大多数国家以及南美洲等国家进入公有领域。\n*   **作者去世后50年：** 1975年去世的作者的作品将在新西兰以及非洲和亚洲的大多数国家进入公有领域。\n*   **美国：** 1930年出版的电影和书籍（包括其中的艺术作品）将进入公有领域。\n\n文章展示了一个“降临节日历”的形式，在整个十二月逐步揭晓即将被释放的著名作品，最终在公共领域日（1月1日）达到高潮。 部分亮点包括：\n\n*   **文学：** 兰斯顿·休斯的《并非没有欢笑》，弗兰茨·卡夫卡的《城堡》（英文译本），阿加莎·克里斯蒂的《牧师公馆谋杀案》，威廉·福克纳的《我弥留之际》，达希尔·哈梅特的《马耳他之鹰》，弗吉尼亚·伍尔夫的《奥兰多》，以及P.G. 沃德豪斯的作品。\n*   **思想家：** 阿尔伯特·爱因斯坦，西格蒙德·弗洛伊德，汉娜·阿伦特\n*   **音乐：** 查理·帕克\n*   **其他：** 1930年的电影《西线无战事》。\n\n文章还指向了约翰·马克·奥克布洛姆的倒计时和Standard Ebooks的美国作品免费版本等资源，并强调了公共领域的重要性，链接至Communia的公共领域宣言。"
  },
  {
    "id": "46093613",
    "title": "YouTube increases FreeBASIC performance (2019)",
    "url": "https://freebasic.net/forum/viewtopic.php?t=27927",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "YouTube提升FreeBASIC性能 (2019)",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "46119214",
    "title": "Comparing AWS Lambda ARM64 vs. x86_64 Performance Across Runtimes in Late 2025",
    "url": "https://chrisebert.net/comparing-aws-lambda-arm64-vs-x86_64-performance-across-multiple-runtimes-in-late-2025/",
    "summary": "This article compares the performance of AWS Lambda functions on ARM64 (Graviton) and x86_64 architectures using Node.js, Rust, and Python runtimes in late 2025. The benchmark tests cover CPU-intensive, memory-intensive, and light workloads.\n\n**Key findings:**\n\n*   **Rust on ARM64 is the most performant and cost-efficient combination overall**, especially after enabling assembly-optimized SHA-256 hashing, providing a 4-5x performance improvement for the CPU-intensive workload over x86_64.\n*   **ARM64 generally delivers 30-40% lower compute costs** with equal or better performance than x86_64.\n*   **Python 3.11 on ARM64 outperformed newer Python runtimes** in tests.\n*   **Node.js 22 on ARM64 was consistently faster than Node.js 20 on x86_64**, offering a \"free\" 15-20% speedup by switching architectures.\n*   **Rust is significantly faster than interpreted runtimes** (8x faster than Node.js, 2x faster than Python).\n*   **Cold starts favor ARM64** with faster initialization.\n\nThe benchmark used multiple memory configurations and collected both cold start and warm start metrics. The results emphasize ARM64's advantages in cost and performance, making it a strong default choice for Lambda, unless specific library compatibility issues exist. The author provides an open-source benchmark for readers to replicate the results.\n",
    "chinese_title": "2025年末AWS Lambda ARM64与x86_64在不同运行时性能对比",
    "chinese_summary": "本文比较了 2025 年底 AWS Lambda 函数在 ARM64 (Graviton) 和 x86_64 架构上使用 Node.js、Rust 和 Python 运行时环境的性能。基准测试涵盖 CPU 密集型、内存密集型和轻量级工作负载。\n\n**主要发现：**\n\n*   **总体而言，ARM64 上的 Rust 性能最高且成本效益最佳**，尤其是在启用汇编优化的 SHA-256 哈希后，在 CPU 密集型工作负载上比 x86_64 提高了 4-5 倍的性能。\n*   **ARM64 通常提供低 30-40% 的计算成本**，并且性能与 x86_64 相当或更好。\n*   **ARM64 上的 Python 3.11 在测试中优于较新的 Python 运行时环境。**\n*   **ARM64 上的 Node.js 22 始终比 x86_64 上的 Node.js 20 更快**，通过切换架构提供“免费”15-20% 的速度提升。\n*   **Rust 比解释型运行时环境快得多**（比 Node.js 快 8 倍，比 Python 快 2 倍）。\n*   **冷启动更倾向于 ARM64**，具有更快的初始化速度。\n\n该基准测试使用了多种内存配置，并收集了冷启动和热启动指标。 结果强调了 ARM64 在成本和性能方面的优势，使其成为 Lambda 的强大默认选择，除非存在特定的库兼容性问题。作者提供了一个开源基准，供读者复制结果。"
  },
  {
    "id": "46120603",
    "title": "Lazier Binary Decision Diagrams for set-theoretic types",
    "url": "https://elixir-lang.org/blog/2025/12/02/lazier-bdds-for-set-theoretic-types/",
    "summary": "This article discusses the evolution of data structures used in Elixir's set-theoretic type system to efficiently represent unions, intersections, and negations of types. Initially, Disjunctive Normal Forms (DNFs) were used, but their tendency for exponential blow-up, especially with the introduction of negations in anonymous function type inference, led to performance issues.\n\nBinary Decision Diagrams (BDDs) were adopted to address DNF's limitations by representing types as ordered trees. However, BDDs introduced new slowdowns due to the expansion of unions in intersections, leading to excessive disjunctions and expensive simplification processes.\n\nTo overcome this, the article introduces \"Lazier BDDs\" (also known as ternary decision diagrams), which incorporate a new \"uncertain\" element in each node to represent unions in a lazy manner, delaying their expansion and preventing exponential growth.\n\nFinally, the article describes an optimization to \"Lazier BDDs\" focused on intersections and differences. It reveals that the original lazy BDD formulas could still trigger the problematic union expansion behavior of standard BDDs. The new formulas preserve unions more effectively during these operations, leading to significant performance improvements and resolving the remaining bottlenecks in Elixir's type system. The key is factoring out common union terms to keep unions \"lazy\".\n",
    "chinese_title": "用于集合论类型的惰性二元决策图",
    "chinese_summary": "本文探讨了Elixir集合论类型系统中用于高效表示类型并集、交集和否定的数据结构演变过程。最初，使用析取范式（DNF），但其指数级膨胀的倾向，特别是在匿名函数类型推断中引入否定后，导致了性能问题。\n\n为了解决DNF的局限性，采用了二元决策图（BDD），将类型表示为有序树。然而，BDD引入了新的速度下降，原因是并集在交集中扩展，导致过多的析取和昂贵的简化过程。\n\n为了克服这个问题，本文介绍了一种“惰性BDD”（也称为三元决策图），它在每个节点中引入一个新的“不确定”元素，以惰性的方式表示并集，延迟其扩展并防止指数级增长。\n\n最后，本文描述了对“惰性BDD”的优化，重点是交集和差集。结果表明，最初的惰性BDD公式仍然可能触发标准BDD的问题性并集扩展行为。新的公式在这些操作期间更有效地保留并集，从而显著提高性能并解决Elixir类型系统中剩余的瓶颈。关键在于分解出常见的并集项，以保持并集的“惰性”。"
  },
  {
    "id": "46104193",
    "title": "India orders smartphone makers to preload state-owned cyber safety app",
    "url": "https://www.reuters.com/sustainability/boards-policy-regulation/india-orders-mobile-phones-preloaded-with-government-app-ensure-cyber-safety-2025-12-01/",
    "summary": "**Summary:**\n\nAccording to a Reuters report, the Indian government has ordered smartphone manufacturers to preload a state-owned cyber safety application on all new smartphones sold in India. This mandate aims to bolster cyber safety and awareness among Indian citizens. While the specific app isn't named in the information available, the order reflects the government's increasing focus on digital security and its efforts to proactively address potential threats.\n\nThe move will likely affect major smartphone brands operating in India, including Samsung, Xiaomi, and Apple. While the rationale behind this decision is to increase user awareness and potentially provide tools for identifying and reporting cyber threats, it also raises concerns regarding data privacy, security vulnerabilities within the app itself, and potential anti-competitive practices.\n\nThe report further mentions the potential challenges for manufacturers, including adapting their operating systems to accommodate the pre-installed app and ensuring seamless integration with existing user interfaces. The government is expected to release further guidelines on implementation details, including timelines and technical specifications for the app. The long-term impact of this policy on the Indian smartphone market and user experience remains to be seen, with privacy advocates likely to scrutinize the app's functionality and data collection practices.\n",
    "chinese_title": "印度命令智能手机制造商预装国营网络安全应用。",
    "chinese_summary": "**概要：**\n\n路透社报道称，印度政府已命令智能手机制造商在新售往印度的所有智能手机上预装一款国有网络安全应用程序。此举旨在加强印度公民的网络安全意识。虽然现有信息未提及具体应用名称，但该命令反映了政府日益重视数字安全，并积极应对潜在威胁的努力。\n\n此举可能会影响在印度运营的主要智能手机品牌，包括三星、小米和苹果。虽然此决定的理由是为了提高用户意识，并可能提供识别和报告网络威胁的工具，但也引发了对数据隐私、应用本身的安全漏洞以及潜在反竞争行为的担忧。\n\n该报告还提到制造商可能面临的挑战，包括调整操作系统以适应预装应用程序，并确保与现有用户界面的无缝集成。预计政府将发布更多关于实施细节的指导方针，包括应用程序的时间表和技术规范。这项政策对印度智能手机市场和用户体验的长期影响仍有待观察，隐私倡导者可能会仔细审查该应用程序的功能和数据收集实践。"
  },
  {
    "id": "46108780",
    "title": "DeepSeek-v3.2: Pushing the frontier of open large language models [pdf]",
    "url": "https://huggingface.co/deepseek-ai/DeepSeek-V3.2/resolve/main/assets/paper.pdf",
    "summary": "This document appears to be the PDF source code for an article titled \"DeepSeek-v3.2: Pushing the frontier of open large language models.\"\n\nDue to the file format being PDF source code, a comprehensive summary of the article's content is not possible.\n",
    "chinese_title": "DeepSeek-v3.2：推进开源大语言模型前沿 [pdf]",
    "chinese_summary": "本文档似乎是题为“DeepSeek-v3.2：推进开源大型语言模型前沿”的文章的PDF源代码。\n\n由于文件格式为PDF源代码，因此无法提供文章内容的全面摘要。"
  },
  {
    "id": "46121951",
    "title": "Show HN: RunMat – runtime with auto CPU/GPU routing for dense math",
    "url": "https://github.com/runmat-org/runmat",
    "summary": "RunMat is presented as a high-performance runtime for MATLAB-style code, designed for dense mathematical computations. It automatically optimizes and routes operations between CPU and GPU, eliminating the need for manual device management or kernel coding. RunMat supports a wide range of GPUs (NVIDIA, AMD, Apple Silicon, Intel) through native APIs.\n\nKey features include MATLAB syntax compatibility, automatic CPU/GPU selection based on data size and transfer cost, a modern CPU runtime with JIT compilation and generational garbage collection, and a cross-platform GPU backend. Early performance benchmarks show RunMat outperforming NumPy and PyTorch on several large workloads, particularly those leveraging GPU acceleration.\n\nThe software is in pre-release (v0.2) and open-source (MIT license). The post encourages users to install RunMat via provided scripts or `cargo`, run example scripts, and explore features like GPU acceleration status. Jupyter integration is also supported.\n\nRunMat is built with a tiered CPU runtime (interpreter and JIT compiler) coupled with a fusion engine and auto-offload planner. This allows combining multiple operations into single GPU dispatches while minimizing host-device transfers.  The post details the architecture and how RunMat captures math operations, decides what to run on the GPU, generates GPU kernels in WGSL, and executes code efficiently.\n\nThe post promotes RunMat as having a modern developer experience, including a rich REPL, Jupyter support, extensible architecture, and comprehensive CLI features. RunMat is also extensible via a package system for both native (Rust) and source (MATLAB) packages. The post concludes by discussing design philosophy, target users, and calls for contributions, licensing, and social media links.\n",
    "chinese_title": "Show HN: RunMat – 密集数学运算的自动 CPU/GPU 路由运行时",
    "chinese_summary": "RunMat：高性能 MATLAB 代码运行时\n\nRunMat 是一款高性能 MATLAB 代码运行时，专为密集型数学计算设计。它能自动优化 CPU 和 GPU 之间的运算并进行路由，无需手动进行设备管理或内核编码。RunMat 通过原生 API 支持多种 GPU（NVIDIA、AMD、Apple Silicon、Intel）。\n\n其主要特性包括：MATLAB 语法兼容性、基于数据大小和传输成本的 CPU/GPU 自动选择、具有 JIT 编译和分代垃圾回收机制的现代 CPU 运行时，以及跨平台 GPU 后端。早期性能基准测试表明，在多个大型工作负载上，特别是那些利用 GPU 加速的工作负载上，RunMat 的性能优于 NumPy 和 PyTorch。\n\n该软件目前处于预发布阶段 (v0.2)，并采用开源（MIT 许可证）。文章鼓励用户通过提供的脚本或 `cargo` 安装 RunMat，运行示例脚本，并探索诸如 GPU 加速状态等功能。同时也支持 Jupyter 集成。\n\nRunMat 构建于分层 CPU 运行时（解释器和 JIT 编译器）之上，并结合了融合引擎和自动卸载规划器。这使得可以将多个操作组合成单个 GPU 调度，同时最大限度地减少主机-设备传输。文章详细介绍了该架构，以及 RunMat 如何捕获数学运算、决定在 GPU 上运行的内容、生成 WGSL 中的 GPU 内核并高效执行代码。\n\n文章宣传 RunMat 具有现代化的开发者体验，包括丰富的 REPL、Jupyter 支持、可扩展的架构以及全面的 CLI 功能。RunMat 还可以通过包系统进行扩展，该包系统支持原生 (Rust) 和源代码 (MATLAB) 包。文章最后讨论了设计理念、目标用户，并呼吁大家积极贡献、关注许可协议和社交媒体链接。"
  },
  {
    "id": "46095662",
    "title": "Beej's Guide to Learning Computer Science",
    "url": "https://beej.us/guide/bglcs/",
    "summary": "Beej's Guide to Learning Computer Science is a work-in-progress guide aimed at helping people learn Computer Science. The guide is acknowledged as incomplete and in beta-quality. The author, Beej, encourages readers to provide corrections and feedback.\n\nThe guide is available in multiple formats for reading, including:\n\n*   HTML (various layouts, including widescreen and single-page)\n*   HTML ZIP archives (various layouts)\n*   PDF (US Letter and A4 sizes, one-sided and two-sided printing options, with and without syntax highlighting, and in both color and black & white)\n\nFor those interested in translating or contributing to the guide, the entire project can be cloned from GitHub, with instructions provided in the README.\n\nThe author, Beej, can be contacted at beej@beej.us.\n",
    "chinese_title": "Beej的计算机科学学习指南",
    "chinese_summary": "Beej的计算机科学学习指南（草稿）旨在帮助人们学习计算机科学。本指南尚不完善，处于Beta测试阶段。作者Beej鼓励读者提供更正和反馈。\n\n本指南提供多种格式供阅读，包括：\n\n*   HTML（各种布局，包括宽屏和单页）\n*   HTML ZIP压缩包（各种布局）\n*   PDF（美式信纸和A4尺寸，单面和双面打印选项，带或不带语法高亮，以及彩色和黑白）\n\n对于有兴趣翻译或贡献本指南的人，可以从GitHub克隆整个项目，说明见README。\n\n作者Beej的联系方式：beej@beej.us。"
  },
  {
    "id": "46118722",
    "title": "How Brian Eno Created Ambient 1: Music for Airports (2019)",
    "url": "https://reverbmachine.com/blog/deconstructing-brian-eno-music-for-airports/",
    "summary": "This is a comment praising an article or video titled \"How Brian Eno Created Ambient 1: Music for Airports (2019).\" The commenter clearly admires Brian Eno, considering him one of the most important producers alive. They appreciated the explanation of Eno's working methods, noting that some information was familiar while other aspects were new and insightful. The commenter is enthusiastic about the exploration of ambient music and emphasizes the vastness of the genre for discovery. A key takeaway from the comment is the appreciation for the unique sound of Eno's albums from that period, attributing it, at least partially, to the use of tape machines in the production process. The commenter expresses gratitude to the creator of the content for diving into the subject.\n",
    "chinese_title": "布莱恩·伊诺如何创作《Ambient 1: Music for Airports》(2019)",
    "chinese_summary": "这是一条评论，赞扬了一篇关于“Brian Eno如何创作《Ambient 1: Music for Airports (2019)》”的文章或视频。评论者显然很欣赏Brian Eno，认为他是当今最重要的制作人之一。他们赞赏对Eno工作方法的解释，指出其中一些信息是熟悉的，而另一些方面是新的且富有洞察力的。评论者对探索环境音乐充满热情，并强调该流派的广阔性，有待发现。评论的一个关键点是欣赏Eno在那段时间的专辑的独特声音，并将此至少部分归功于制作过程中录音机的使用。评论者感谢内容创作者深入研究该主题。"
  },
  {
    "id": "46122518",
    "title": "Fallout 2's Chris Avellone describes his game design philosophy",
    "url": "https://arstechnica.com/gaming/2025/12/fallout-2-designer-chris-avellone-recalls-his-first-forays-into-game-development/",
    "summary": "Chris Avellone, a renowned video game designer known for titles like Fallout 2 and Planescape: Torment, attributes his success to a \"player-first\" philosophy. He emphasizes the importance of making the game experience centered around the player and catering to their \"selfishness,\" as enjoyment is the true mark of a successful game.\n\nAvellone's design philosophy was shaped by his early experiences with Dungeons & Dragons, where he learned to craft interactive stories and provide players with \"shine moments,\" allowing them to feel like heroes. He highlights the importance of understanding player motivations and allowing them to play in their own way, avoiding penalization for different playstyles.\n\nA key takeaway from pen-and-paper RPGs is that the story must continue, regardless of the outcome of dice rolls or player actions. Avellone applied this to Planescape: Torment by making death a narrative element rather than a fail state. He also emphasized the importance of player input throughout the design process, even conducting pre-game interviews to understand character arc preferences.\n\nAvellone stresses that you shouldn't give a player an accomplishment and immediately take it away. His design principles emphasize adapting to the player's choices and ensuring their internal motivations align with in-game goals, creating a more engaging experience. He's currently working on a dystopian fantasy game at Republic Games, where he's drawing from his extensive RPG design experience.\n",
    "chinese_title": "辐射2主创克里斯·阿瓦隆谈游戏设计哲学",
    "chinese_summary": "克里斯·阿瓦隆，以《辐射2》和《异域镇魂曲》等作品闻名的著名游戏设计师，将其成功归功于“玩家至上”的理念。他强调以玩家为中心的游戏体验的重要性，迎合他们的“自私”，因为享受才是游戏成功的真正标志。\n\n阿瓦隆的设计理念源于他早期玩《龙与地下城》的经历，在那里他学会了制作互动故事并为玩家提供“闪耀时刻”，让他们感觉像英雄。他强调理解玩家动机的重要性，允许他们以自己的方式进行游戏，避免因不同的游戏风格而受到惩罚。\n\n从纸笔RPG中得出的一个关键结论是，无论骰子结果或玩家行为如何，故事都必须继续。阿瓦隆将这一点应用到《异域镇魂曲》中，将死亡作为一种叙事元素，而不是失败状态。他还强调了在整个设计过程中玩家投入的重要性，甚至进行游戏前访谈，以了解角色弧线的偏好。\n\n阿瓦隆强调，你不应该给玩家一项成就，然后立即夺走它。他的设计原则强调适应玩家的选择，并确保他们的内在动机与游戏中的目标相一致，从而创造更具吸引力的体验。他目前正在Republic Games开发一款反乌托邦幻想游戏，从中汲取他丰富的RPG设计经验。"
  },
  {
    "id": "46066640",
    "title": "An LED panel that shows the aviation around you",
    "url": "https://github.com/AxisNimble/TheFlightWall_OSS",
    "summary": "TheFlightWall project is an open-source initiative to build an LED panel display that shows live flight information around your location. The project uses multiple 16x16 LED panels, an ESP32 dev board, 3D printed brackets (or alternatives), and wooden trim for support. It requires a 5V power supply and a voltage level shifter.\n\nThe project utilizes two main data sources: OpenSky for ADS-B flight data (position and callsigns) and FlightAware AeroAPI for flight information like aircraft type, airline, and routes. To use these, you need to create accounts and obtain API keys.\n\nTo set up the software, you need to configure your WiFi credentials, location (latitude, longitude, and search radius), and optional display preferences in the provided configuration files. The firmware is built and flashed to the ESP32 using PlatformIO, an IDE extension for VS Code.\n\nCustomization options include adjusting display brightness and text color. While more options may be added in the future, the open-source nature allows for extensive user modifications.\n\nThe creators encourage users to build their own and tag them on Instagram. For those who prefer not to build, they offer an official product on their website: theflightwall.com.\n",
    "chinese_title": "显示你周围航空信息的LED面板",
    "chinese_summary": "TheFlightWall项目是一个开源项目，旨在构建一个LED面板显示器，用于显示您所在地附近的实时航班信息。该项目使用多个16x16 LED面板、ESP32开发板、3D打印支架（或替代品）以及用于支撑的木质镶边。它需要一个5V电源和一个电压电平转换器。\n\n该项目利用两个主要数据源：OpenSky用于ADS-B航班数据（位置和呼号），FlightAware AeroAPI用于航班信息，如飞机类型、航空公司和航线。要使用这些数据源，您需要创建账户并获取API密钥。\n\n要设置软件，您需要在提供的配置文件中配置您的WiFi凭据、位置（纬度、经度和搜索半径）以及可选的显示偏好设置。固件使用PlatformIO（VS Code的IDE扩展）构建并刷入ESP32。\n\n自定义选项包括调整显示亮度和文本颜色。虽然未来可能会添加更多选项，但其开源特性允许用户进行广泛的修改。\n\n创建者鼓励用户构建自己的版本并在Instagram上标记他们。对于那些不想自己构建的用户，他们在其网站theflightwall.com上提供官方产品。"
  },
  {
    "id": "46118432",
    "title": "Rootless Pings in Rust",
    "url": "https://bou.ke/blog/rust-ping/",
    "summary": "This article describes how to implement rootless pings in Rust, circumventing the usual requirement for root privileges when creating ICMP sockets. The author explains that this is achieved by creating a UDP socket with the ICMP protocol.\n\nThe core steps are:\n\n1.  **Socket Creation:** Use the `socket2` crate to create a UDP socket with the ICMPv4 protocol. This allows sending ICMP packets without root.\n\n2.  **Packet Creation and Sending:** Construct an ICMP echo request packet. Linux and macOS handle the identifier and checksum fields differently: Linux overwrites them, while macOS requires a correct checksum calculation. The author provides code to calculate and include the checksum. The packet is then sent to the target IP address using the socket.\n\n3.  **Response Handling:**  Receive and interpret the ICMP reply. The key difference between operating systems is that macOS includes the IP header in the received packet, while Linux does not. The code accounts for this difference by stripping the IP header on macOS. The code then extracts the reply type, sequence number, and payload from the received data to verify the ping.\n\nThe article emphasizes the platform-specific nuances between Linux and macOS in both packet creation and response handling. It concludes by suggesting further implementation of features like latency calculation and periodic pings. A complete example is available on GitHub.\n",
    "chinese_title": "Rust 中的无根 Ping",
    "chinese_summary": "本文介绍了如何在 Rust 中实现无 root 权限的 ping，绕过创建 ICMP 套接字时通常需要的 root 权限。作者解释说，这是通过创建使用 ICMP 协议的 UDP 套接字来实现的。\n\n核心步骤包括：\n\n1.  **套接字创建：** 使用 `socket2` crate 创建一个使用 ICMPv4 协议的 UDP 套接字。这允许在没有 root 权限的情况下发送 ICMP 数据包。\n\n2.  **数据包创建和发送：** 构造一个 ICMP 回显请求数据包。Linux 和 macOS 对标识符和校验和字段的处理方式不同：Linux 会覆盖它们，而 macOS 需要正确的校验和计算。作者提供了计算和包含校验和的代码。然后使用套接字将数据包发送到目标 IP 地址。\n\n3.  **响应处理：** 接收和解释 ICMP 回复。操作系统之间的主要区别在于 macOS 在接收到的数据包中包含 IP 标头，而 Linux 不包含。该代码通过在 macOS 上剥离 IP 标头来解决这一差异。然后，代码从接收到的数据中提取回复类型、序列号和有效负载，以验证 ping。\n\n文章强调了 Linux 和 macOS 在数据包创建和响应处理方面的平台特定细微差别。最后，它建议进一步实现延迟计算和定期 ping 等功能。完整的示例可以在 GitHub 上找到。"
  },
  {
    "id": "46091211",
    "title": "Tom Stoppard has died",
    "url": "https://www.bbc.com/news/articles/c74xe49q7vlo",
    "summary": "Sir Tom Stoppard, the acclaimed playwright known for his wit, philosophical depth, and contributions to both stage and screen, has died at the age of 88. News of his passing has drawn tributes from around the world, celebrating his remarkable career and lasting impact on theatre and literature.\n\nStoppard, famed for works like \"Rosencrantz and Guildenstern are Dead\" and \"The Real Thing,\" also earned an Oscar and Golden Globe for his screenplay of \"Shakespeare In Love.\" King Charles III and Queen Camilla expressed their deep sadness, recognizing Stoppard's genius and ability to challenge, move, and inspire audiences.\n\nHis plays often explored philosophical and political themes, captivating audiences for over six decades. Tributes poured in from notable figures such as Sir Mick Jagger, Sir Tim Rice, and organizations like the National Theatre. Faber Books lauded him as one of the greatest playwrights and intellects of the last sixty years.\n\nBorn in Czechoslovakia as Tomas Straussler, Stoppard's family fled Nazi occupation, eventually settling in England. He later learned of his Jewish grandparents' deaths in concentration camps, an experience that shaped his perspective.\n\nStoppard's career took off in the 1960s with \"Rosencrantz and Guildenstern are Dead,\" which won several awards, including four Tonys. He was knighted in 1997 for his services to literature. The West End theatres will dim their lights in his memory, and his legacy of award-winning plays and screenplays will undoubtedly endure.\n",
    "chinese_title": "汤姆·斯托帕德去世",
    "chinese_summary": "著名剧作家汤姆·斯托帕德爵士逝世，享年88岁。他的去世引来了世界各地的悼念，人们赞扬他卓越的职业生涯以及对戏剧和文学的持久影响。\n\n斯托帕德以《罗森克兰茨和吉尔登斯丹死了》和《真实的事》等作品闻名，他还凭借《莎翁情史》的剧本获得了奥斯卡金像奖和金球奖。查尔斯三世国王和卡米拉王后表达了他们的深切哀悼，他们认可了斯托帕德的天赋以及他挑战、感动和激励观众的能力。\n\n他的戏剧经常探讨哲学和政治主题，在过去的六十年里吸引了众多观众。米克·贾格尔爵士、蒂姆·莱斯爵士等著名人物以及国家剧院等机构纷纷致敬。费伯出版社称赞他是过去六十年来最伟大的剧作家和知识分子之一。\n\n斯托帕德出生于捷克斯洛伐克，原名托马斯·斯特劳斯勒，他的家人为了躲避纳粹占领而逃离，最终定居在英国。后来，他得知他的犹太祖父母死于集中营，这段经历塑造了他的视角。\n\n斯托帕德的职业生涯在20世纪60年代凭借《罗森克兰茨和吉尔登斯丹死了》起飞，该剧赢得了包括四项托尼奖在内的多个奖项。他于1997年因其对文学的贡献而被授予爵士头衔。西区剧院将调暗灯光以纪念他，他获奖无数的戏剧和电影剧本的遗产无疑将永存。"
  },
  {
    "id": "46116567",
    "title": "After Windows Update, Password icon invisible, click where it used to be",
    "url": "https://support.microsoft.com/en-us/topic/august-29-2025-kb5064081-os-build-26100-5074-preview-3f9eb9e1-72ca-4b42-af97-39aace788d93",
    "summary": "This document details the features, fixes, and known issues included in a recent Windows 11 update. A key highlight is the expiration of Secure Boot certificates in June 2026, urging users to update in advance to avoid boot issues.\n\nNew features include Recall, a personalized homepage for recent activity; Click to Do, an interactive tutorial to enhance productivity; a redesigned system dialog box for app permission requests; a larger clock with seconds in the notification center; improved search on the taskbar; more widget options for the lock screen; dividers in the File Explorer context menu; people icons in File Explorer when signed in with a work/school account; a redesigned Windows Hello interface; and new settings for generative AI app permissions.\n\nThe update addresses numerous issues, including fixes for taskbar preview thumbnails, blocked files in File Explorer, facial recognition failures in Windows Hello, settings crashes when adding security keys, CPU workload metrics in Task Manager, opacity of live captions, IME input issues, app crashes related to dbgcore.dll and Kerberos, login delays, audio issues with Miracast, and issues with the cryptographic provider.\n\nPerformance improvements include faster application installation on ARM64 devices. It includes a transition of Windows printing components to a modern Universal C Runtime Library potentially causing issues with older versions of Windows. Windows PowerShell 2.0 will be removed in August 2025.\n\nKnown issues include Network Device Interface (NDI) streaming performance problems and unexpected User Account Control (UAC) prompts during MSI repair operations, both addressed in KB5065426, as well as problems playing protected content in some BluRay/DVD/Digital TV apps. It also provides version information for updated AI components.\n",
    "chinese_title": "Windows更新后密码图标消失，点击原位置有效。",
    "chinese_summary": "本文档详细介绍了最近 Windows 11 更新中包含的功能、修复和已知问题。重点在于安全启动证书将于 2026 年 6 月到期，敦促用户提前更新以避免启动问题。\n\n新功能包括：Recall，一个用于最近活动的个性化主页；Click to Do，一个增强生产力的交互式教程；重新设计的应用程序权限请求系统对话框；通知中心中带有秒的大型时钟；改进的任务栏搜索；锁屏界面上更多的 Widget 选项；文件资源管理器上下文菜单中的分隔符；使用工作/学校帐户登录时，文件资源管理器中的人物图标；重新设计的 Windows Hello 界面；以及生成式 AI 应用权限的新设置。\n\n该更新解决了许多问题，包括任务栏预览缩略图的修复、文件资源管理器中被阻止的文件、Windows Hello 中的面部识别失败、添加安全密钥时设置崩溃、任务管理器中的 CPU 工作负载指标、实时字幕的不透明度、IME 输入问题、与 dbgcore.dll 和 Kerberos 相关的应用程序崩溃、登录延迟、Miracast 的音频问题以及密码提供程序的问题。\n\n性能改进包括在 ARM64 设备上更快地安装应用程序。它包括将 Windows 打印组件迁移到现代通用 C 运行时库，这可能会导致旧版本 Windows 出现问题。Windows PowerShell 2.0 将于 2025 年 8 月删除。\n\n已知问题包括网络设备接口 (NDI) 流媒体性能问题和 MSI 修复操作期间意外的用户帐户控制 (UAC) 提示，这两个问题已在 KB5065426 中解决，以及在某些 BluRay/DVD/数字电视应用程序中播放受保护内容的问题。它还提供了更新的 AI 组件的版本信息。"
  },
  {
    "id": "46116724",
    "title": "Reverse math shows why hard problems are hard",
    "url": "https://www.quantamagazine.org/reverse-mathematics-illuminates-why-hard-problems-are-hard-20251201/",
    "summary": "This Quanta Magazine article discusses how researchers are using \"reverse mathematics\" to understand why certain computational problems are so difficult to solve. Instead of the traditional approach of starting with axioms and proving theorems, they swap a theorem for an axiom and then prove the original axiom. This approach has revealed unexpected equivalences between seemingly unrelated theorems in complexity theory.\n\nThe article highlights the work of Lijie Chen, Jiatu Li, and Igor Oliveira, who demonstrated that the pigeonhole principle (if you put more pigeons than holes, at least one hole has multiple pigeons) is logically equivalent to the lower bound on the communication complexity of the \"equality problem\" and the lower bound on the time required for a Turing machine to recognize palindromes (strings that read the same forwards and backwards).\n\nThese equivalences are surprising because they connect abstract counting principles with concrete computational tasks. Moreover, they shed light on the limitations of certain axiomatic systems like PV1, suggesting that if the pigeonhole principle is unprovable within PV1, then these equivalent theorems are likely also unprovable.\n\nWhile the reverse mathematics approach doesn't necessarily provide new methods for proving difficult theorems, it helps illuminate the underlying connections and fundamental nature of complexity lower bounds, prompting a resurgence of interest in metamathematics within the computer science community.\n",
    "chinese_title": "逆向数学揭示难题为何难",
    "chinese_summary": "这篇《量子杂志》的文章探讨了研究人员如何利用“逆向数学”来理解某些计算问题为何如此难以解决。他们没有采用从公理出发证明定理的传统方法，而是将定理与公理互换，然后证明原始公理。这种方法揭示了复杂性理论中看似无关的定理之间令人惊讶的等价关系。\n\n文章重点介绍了陈立杰、李家图和伊戈尔·奥利维拉的工作，他们证明了鸽巢原理（如果你放入的鸽子比洞多，那么至少有一个洞里有多只鸽子）在逻辑上等价于“相等问题”的通信复杂度的下界，以及图灵机识别回文（正反读都一样的字符串）所需时间的下界。\n\n这些等价关系令人惊讶，因为它们将抽象的计数原则与具体的计算任务联系起来。此外，它们揭示了某些公理系统（如 PV1）的局限性，表明如果鸽巢原理在 PV1 中不可证，那么这些等价定理也可能不可证。\n\n虽然逆向数学方法不一定提供证明困难定理的新方法，但它有助于阐明复杂性下界的潜在联系和基本性质，从而促使计算机科学界重新燃起对元数学的兴趣。"
  },
  {
    "id": "46121243",
    "title": "Proximity to coworkers increases long-run development, lowers short-term output (2023)",
    "url": "https://pallais.scholars.harvard.edu/publications/power-proximity-coworkers-training-tomorrow-or-productivity-today",
    "summary": "This 2023 study by Emanuel, Harrington, and Pallais investigates the effects of proximity to coworkers, particularly in the context of the rise of remote work. Analyzing data from software engineers at a Fortune 500 company, the research reveals a trade-off: proximity boosts long-term human capital development but reduces short-term output.\n\nWhen offices were open, engineers located in the same building as their team received significantly more online feedback (22%) compared to those with distant teammates. This advantage diminished after the shift to remote work during COVID-19. However, the study also found that co-location decreased engineers' programming output, especially among senior engineers.\n\nThe trade-offs of proximity are particularly pronounced for women, who engage in and benefit from mentoring more when working near colleagues. Furthermore, proximity impacts career trajectories by initially reducing short-term pay raises, but ultimately increasing them over the long run.\n\nThe findings help explain current return-to-office trends, with younger workers seeking mentorship and older workers providing it being more inclined to work on-site. The study cautions that even with mentors and mentees returning to the office, remote work can still hinder interaction, as having just one distant teammate negatively impacted feedback among co-located workers even before the pandemic.\n",
    "chinese_title": "与同事的邻近性提高长期发展，降低短期产出 (2023)",
    "chinese_summary": "This 2023 study by Emanuel, Harrington, and Pallais investigates the effects of proximity to coworkers, particularly in the context of the rise of remote work. Analyzing data from software engineers at a Fortune 500 company, the research reveals a trade-off: proximity boosts long-term human capital development but reduces short-term output.\n\nWhen offices were open, engineers located in the same building as their team received significantly more online feedback (22%) compared to those with distant teammates. This advantage diminished after the shift to remote work during COVID-19. However, the study also found that co-location decreased engineers' programming output, especially among senior engineers.\n\nThe trade-offs of proximity are particularly pronounced for women, who engage in and benefit from mentoring more when working near colleagues. Furthermore, proximity impacts career trajectories by initially reducing short-term pay raises, but ultimately increasing them over the long run.\n\nThe findings help explain current return-to-office trends, with younger workers seeking mentorship and older workers providing it being more inclined to work on-site. The study cautions that even with mentors and mentees returning to the office, remote work can still hinder interaction, as having just one distant teammate negatively impacted feedback among co-located workers even before the pandemic.\n"
  },
  {
    "id": "46121539",
    "title": "Zig's new plan for asynchronous programs",
    "url": "https://lwn.net/SubscriberLink/1046084/4c048ee008e1c70e/",
    "summary": "This LWN.net article discusses Zig's new approach to asynchronous I/O, designed to avoid the \"function coloring problem\" seen in languages like Python and Rust while maintaining performance and control. Zig achieves this through a generic `Io` interface. Functions needing I/O take an `Io` instance as a parameter, similar to the `Allocator` interface.\n\nThe standard library provides two `Io` implementations: `Io.Threaded` (synchronous operations with optional threads) and `Io.Evented` (asynchronous I/O using an event loop). Programmers can also create custom `Io` implementations for fine-grained control.\n\nThe key benefit is the ability to write code that works synchronously or asynchronously depending on the `Io` instance provided. Synchronous code remains largely unchanged, using `Io`-wrapped standard library functions.  For parallel execution, the `Io` interface offers `async()` to express order-independence.  `asyncConcurrent()` is used when simultaneous execution is required for correctness (e.g., handling user input while listening for connections).\n\nThe design aims for code clarity, leveraging Zig's existing control-flow mechanisms (`try`, `defer`) without introducing new asynchronous-specific language features. The article notes that `Io.Evented` is still experimental and more `Io` types are planned. While more verbose than syntax-driven approaches, it aligns with idiomatic Zig code and allows for easy performance optimization through asynchronicity.\n",
    "chinese_title": "Zig异步程序的新计划",
    "chinese_summary": "Zig 新的异步 I/O 方法：避免函数着色问题"
  },
  {
    "id": "46080835",
    "title": "Codex, Opus, Gemini try to build Counter Strike",
    "url": "https://www.instantdb.com/essays/agents_building_counterstrike",
    "summary": "This article details an experiment where Codex Max 5.1, Claude Opus 4.5, and Gemini 3 Pro AI models were tasked with building a basic, multiplayer, 3D Counter-Strike game. The models were given consecutive prompts, first focusing on frontend elements (map design, characters, shooting mechanics, sound effects) and then on backend elements (multiplayer functionality with rooms and persistence).\n\nClaude Opus 4.5 excelled at frontend design, creating visually appealing maps, characters, and gun designs. Gemini 3 Pro performed better on backend tasks, implementing multiplayer and persistence with fewer errors. Codex Max 5.1 was a solid performer overall, but didn't stand out as much in either category.\n\nThe experiment revealed interesting differences in how the models solved problems. Codex relied on introspection of the TypeScript library, Claude focused on reading documentation, and Gemini combined both approaches while consistently running build steps to identify and fix errors.\n\nWhile all models successfully built a functional multiplayer FPS without manual coding, challenges remain. The article highlights the need for better tools to bridge the gap between \"vibe coding\" and \"real programming,\" particularly in addressing common React development issues like `useEffect` behavior. Ultimately, the experiment demonstrates significant progress in AI model capabilities for complex software development tasks, fueled by their ability to iterate and learn through CLI interaction.\n",
    "chinese_title": "Codex、Opus、Gemini 尝试构建《反恐精英》",
    "chinese_summary": "本文详细介绍了一项实验，该实验要求 Codex Max 5.1、Claude Opus 4.5 和 Gemini 3 Pro AI 模型构建一个基本的多人 3D 反恐精英游戏。 这些模型被给予连续的提示，首先侧重于前端元素（地图设计、角色、射击机制、音效），然后侧重于后端元素（具有房间和持久性的多人游戏功能）。\n\nClaude Opus 4.5 在前端设计方面表现出色，创造了视觉上吸引人的地图、角色和枪支设计。 Gemini 3 Pro 在后端任务方面表现更好，以更少的错误实现了多人游戏和持久性。 Codex Max 5.1 总体表现稳定，但在任何一个类别中都不那么突出。\n\n实验揭示了模型解决问题的有趣差异。 Codex 依赖于 TypeScript 库的内省，Claude 专注于阅读文档，而 Gemini 结合了这两种方法，同时持续运行构建步骤以识别和修复错误。\n\n虽然所有模型都成功构建了一个无需手动编码的功能性多人 FPS，但仍然存在挑战。 文章强调需要更好的工具来弥合“感觉编码”和“实际编程”之间的差距，尤其是在解决常见的 React 开发问题（如 `useEffect` 行为）方面。 最终，该实验证明了 AI 模型在复杂软件开发任务方面的能力取得了显著进展，这得益于它们通过 CLI 交互进行迭代和学习的能力。"
  },
  {
    "id": "46066764",
    "title": "URL in C (2011)",
    "url": "https://susam.net/url-in-c.html",
    "summary": "This article presents a C code snippet containing a seemingly invalid URL, `https://susam.net/`, that compiles and runs successfully. The puzzle explores why this code doesn't produce a compiler error, despite the C99 standard not explicitly recognizing URLs as valid syntax.\n\nThe solution reveals that `https:` is interpreted as a label, and the `//` that follows begins a single-line comment, effectively ignoring the rest of the URL. The article clarifies that single-line comments using `//` are indeed valid in C since the C99 standard, as detailed in section 6.4.9 of the C99 standard draft. This section explains that everything after `//` until the end of the line is treated as a comment, excluding the newline character, and is ignored by the compiler except for identifying multibyte characters and the newline. In essence, the code cleverly uses the label and comment features of C99 to bypass the URL, allowing the `printf` statement to execute as intended.\n",
    "chinese_title": "C语言中的URL (2011)",
    "chinese_summary": "本文展示了一段C代码片段，其中包含一个看似无效的URL `https://susam.net/`，但该代码能够成功编译并运行。本文探讨了为什么这段代码没有产生编译器错误，尽管C99标准没有明确地将URL识别为有效的语法。\n\n解决方案揭示了`https:`被解释为一个标签，而随后的`//`开始一个单行注释，有效地忽略了URL的其余部分。本文阐明了自C99标准以来，使用`//`的单行注释在C语言中确实有效，如C99标准草案的6.4.9节中所详述。该节解释说，`//`之后直到行尾的所有内容都被视为注释，不包括换行符，并且编译器会忽略这些内容，但用于识别多字节字符和换行符。本质上，这段代码巧妙地利用了C99的标签和注释功能来绕过URL，从而允许`printf`语句按预期执行。"
  },
  {
    "id": "46110842",
    "title": "Ghostty compiled to WASM with xterm.js API compatibility",
    "url": "https://github.com/coder/ghostty-web",
    "summary": "`ghostty-web` offers a web terminal solution designed to be API-compatible with xterm.js, providing a more robust and accurate VT100 terminal implementation within the browser. It addresses shortcomings in xterm.js, particularly around complex script rendering and full support for XTPUSHSGR/XTPOPSGR, by leveraging the same battle-tested terminal emulator code used in the native Ghostty application, compiled to WASM.\n\nSwitching from xterm.js to `ghostty-web` is simple, requiring only a change in the import statement. The WASM bundle is around 400KB and has zero runtime dependencies.\n\n`ghostty-web` aims to simplify terminal emulation with a focus on accuracy and performance, originally developed for Mux but designed for broader use. A live demo is available online, and users can try it locally using `npx @ghostty-web/demo@next`, which starts a local HTTP server with a shell.\n\nThe project is built from Ghostty's source using Zig and Bun, and utilizes libghostty which makes this integration possible. The long-term plan is to consume a native Ghostty WASM distribution when available, maintaining the xterm.js compatible API. It is licensed under the MIT license.\n",
    "chinese_title": "Ghostty：编译为WASM，兼容xterm.js API",
    "chinese_summary": "`ghostty-web`提供了一个与xterm.js API兼容的Web终端解决方案，在浏览器中提供更强大、更精确的VT100终端实现。它利用编译为WASM的、与原生Ghostty应用程序中使用的相同的、经过实战考验的终端模拟器代码，解决了xterm.js的不足之处，尤其是在复杂脚本渲染和对XTPUSHSGR/XTPOPSGR的完全支持方面。\n\n从xterm.js切换到`ghostty-web`很简单，只需要更改import语句即可。WASM包大约400KB，并且没有运行时依赖项。\n\n`ghostty-web`旨在简化终端模拟，专注于准确性和性能，最初为Mux开发，但设计用于更广泛的用途。在线提供了一个实时演示，用户可以使用`npx @ghostty-web/demo@next`在本地尝试，该命令会启动一个带有shell的本地HTTP服务器。\n\n该项目使用Zig和Bun从Ghostty的源代码构建，并利用libghostty，这使得集成成为可能。长期计划是在可用时使用原生的Ghostty WASM发行版，保持xterm.js兼容的API。它采用MIT许可证。"
  },
  {
    "id": "46119699",
    "title": "Man unexpectedly cured of HIV after stem cell transplant",
    "url": "https://www.newscientist.com/article/2506595-man-unexpectedly-cured-of-hiv-after-stem-cell-transplant/",
    "summary": "This article reports on a man unexpectedly cured of HIV after receiving a stem cell transplant to treat leukemia. He is the seventh person to be cured this way, but significantly, the second where the stem cells used were not fully resistant to HIV. This challenges the previous understanding that HIV resistance in donor cells (specifically, a mutation in both copies of the CCR5 gene) was essential for a cure.\n\nThe man received stem cells with one mutated and one typical CCR5 gene copy. After chemotherapy to wipe out his existing immune cells, he received the transplant. While on antiretroviral therapy (ART), the virus was undetectable. After three years he stopped ART, and researchers found no trace of HIV in his blood for over seven years, leading to his designation as \"cured.\"\n\nThis case, and the previous \"Geneva patient\" case, suggest that a cure might be achieved even without fully HIV-resistant donor cells. One hypothesis is that the donor cells, in this instance, eliminated the recipient's remaining original immune cells before the virus could spread, effectively running the host cells dry and thus the virus can't replicate.\n\nThe discovery widens the pool of potential stem cell donors for HIV cures, but several factors, including recipient and donor genetics, need to align for this to work. HIV-resistant stem cells should still be preferred when available.\n\nIt is critical to emphasize that stem cell transplants are risky and not suitable for people with HIV who don't have cancer. ART and newer preventative treatments like lenacapavir remain the safest and most accessible options for managing HIV. Further research continues into genetic editing and vaccines as potential HIV cures.\n",
    "chinese_title": "干细胞移植后，男子意外治愈艾滋病",
    "chinese_summary": "本文报道了一名男子在接受干细胞移植治疗白血病后意外治愈艾滋病病毒的案例。他是第七位通过这种方式治愈的患者，但重要的是，他是第二位使用的干细胞并非完全抵抗艾滋病病毒的患者。 这挑战了之前认为供体细胞中的艾滋病病毒抗性（特别是 CCR5 基因两个拷贝的突变）对于治愈至关重要的理解。\n\n该男子接受了具有一个突变和一个典型 CCR5 基因拷贝的干细胞。 在接受化疗以清除其现有的免疫细胞后，他接受了移植。在抗逆转录病毒疗法（ART）期间，该病毒无法检测到。 三年后，他停止了 ART，研究人员在他的血液中发现了超过七年没有艾滋病病毒的痕迹，因此他被认定为“已治愈”。\n\n这个案例以及之前的“日内瓦患者”案例表明，即使没有完全抗艾滋病病毒的供体细胞，也可能实现治愈。 一种假设是，在这种情况下，供体细胞在病毒传播之前消除了接受者剩余的原始免疫细胞，有效地耗尽了宿主细胞，从而病毒无法复制。\n\n这一发现扩大了艾滋病病毒治愈的潜在干细胞捐献者范围，但包括接受者和捐献者的基因在内的几个因素需要一致才能奏效。 如果可以获得抗艾滋病病毒的干细胞，仍然应该优先考虑。\n\n至关重要的是要强调，干细胞移植具有风险，不适合没有癌症的艾滋病病毒感染者。 ART 和更新的预防性治疗，如 lenacapavir，仍然是管理艾滋病病毒最安全和最容易获得的选择。 针对基因编辑和疫苗作为潜在的艾滋病病毒治愈方法的进一步研究仍在继续。"
  },
  {
    "id": "46117126",
    "title": "Decreasing Certificate Lifetimes to 45 Days",
    "url": "https://letsencrypt.org/2025/12/02/from-90-to-45.html",
    "summary": "Let's Encrypt is reducing certificate validity periods from 90 days to 45 days by 2028, in line with industry standards set by the CA/Browser Forum to improve internet security. The authorization reuse period is also decreasing from 30 days to 7 hours by 2028.\n\nThe rollout will occur in stages, leveraging ACME Profiles to allow users to control when the changes take effect:\n\n*   **May 13, 2026:** `tlsserver` ACME profile switches to 45-day certificates (opt-in).\n*   **February 10, 2027:** Default `classic` ACME profile switches to 64-day certificates with a 10-day authorization reuse period.\n*   **February 16, 2028:** `classic` profile updates to 45-day certificates with a 7-hour authorization reuse period.\n\nUsers are advised to verify their automation systems are compatible with shorter certificate lifetimes and ensure timely renewals. Let's Encrypt recommends using ACME Renewal Information (ARI) to facilitate renewal awareness. If ARI isn't supported, renewal schedules must be adjusted.\n\nTo simplify automation, Let's Encrypt is developing a new DNS challenge type, DNS-PERSIST-01, expected in 2026. This method allows for certificate renewal without continuously updating DNS records, reducing reliance on authorization reuse and simplifying the domain control validation process. Users can subscribe to the technical updates mailing list for further information.\n",
    "chinese_title": "将证书有效期缩短至45天",
    "chinese_summary": "为了提高互联网安全性，Let's Encrypt 计划于 2028 年前将证书有效期从 90 天缩短至 45 天，以符合 CA/浏览器论坛设定的行业标准。授权重用期也将于 2028 年前从 30 天缩短至 7 小时。\n\n此次变更将分阶段进行，利用 ACME 配置文件允许用户控制变更生效的时间：\n\n*   **2026 年 5 月 13 日：** `tlsserver` ACME 配置文件切换至 45 天证书（可选）。\n*   **2027 年 2 月 10 日：** 默认 `classic` ACME 配置文件切换至 64 天证书，授权重用期为 10 天。\n*   **2028 年 2 月 16 日：** `classic` 配置文件更新至 45 天证书，授权重用期为 7 小时。\n\n建议用户验证其自动化系统是否与较短的证书有效期兼容，并确保及时续订。 Let's Encrypt 建议使用 ACME Renewal Information (ARI) 来帮助了解续订情况。 如果不支持 ARI，则必须调整续订计划。\n\n为了简化自动化，Let's Encrypt 正在开发一种新的 DNS 挑战类型，DNS-PERSIST-01，预计在 2026 年推出。 此方法允许在无需持续更新 DNS 记录的情况下进行证书续订，从而减少对授权重用的依赖并简化域名控制验证过程。 用户可以订阅技术更新邮件列表以获取更多信息。"
  },
  {
    "id": "46123050",
    "title": "The Legal Case Against Ring's Face Recognition Feature",
    "url": "https://www.eff.org/deeplinks/2025/11/legal-case-against-rings-face-recognition-feature",
    "summary": "This article outlines the legal concerns surrounding Amazon Ring's upcoming \"Familiar Faces\" feature, which uses facial recognition to identify individuals captured on Ring cameras. The primary concern is the potential violation of biometric privacy laws in various states, which often require explicit consent before collecting and using biometric data like faceprints.\n\nThe article argues that Ring's feature necessitates scanning the faces of everyone who appears on camera, including individuals who haven't consented to such scans. This raises legal risks for Amazon, as lawsuits against similar features by Google and Facebook demonstrate, resulting in massive settlements due to privacy violations.\n\nWhile Amazon states the feature will be off by default and unavailable in states with strict biometric privacy laws like Illinois and Texas, the article highlights that future availability isn't guaranteed. Moreover, it emphasizes the inherent risks associated with biometric data collection, including mass surveillance, data breaches (where faces can't be reset like passwords), and discrimination due to facial recognition's higher error rates with certain demographics.\n\nThe article points out that even in states where individuals can't directly sue, state privacy regulators should investigate and enforce biometric privacy laws to protect people's data. While some states have comprehensive privacy laws with loopholes and rely on state regulators for enforcement, the article views Ring's \"Familiar Faces\" feature as an opportunity to test the strength of these laws and safeguard individuals' privacy rights.\n",
    "chinese_title": "针对Ring面部识别功能的法律诉讼",
    "chinese_summary": "本文概述了亚马逊Ring即将推出的“熟悉面孔”功能所涉及的法律问题。该功能使用面部识别技术来识别Ring摄像头拍摄到的人。主要问题是其可能违反各州的生物识别隐私法，这些法律通常要求在收集和使用面部识别等生物识别数据之前获得明确同意。\n\n文章认为，Ring的这项功能需要扫描出现在摄像头中的每个人的面部，包括那些没有同意接受此类扫描的人。这给亚马逊带来了法律风险，正如针对谷歌和Facebook类似功能的诉讼所表明的那样，这些诉讼因侵犯隐私而导致巨额和解。\n\n虽然亚马逊表示该功能默认关闭，并且在伊利诺伊州和德克萨斯州等生物识别隐私法严格的州不可用，但文章强调，未来可用性无法得到保证。此外，文章还强调了与生物识别数据收集相关的固有风险，包括大规模监控、数据泄露（面部信息无法像密码一样重置）以及因面部识别在某些人群中更高的错误率而导致的歧视。\n\n文章指出，即使在个人无法直接起诉的州，州隐私监管机构也应调查和执行生物识别隐私法，以保护人们的数据。虽然一些州拥有包含漏洞并依赖州监管机构执法的综合隐私法，但文章认为Ring的“熟悉面孔”功能是检验这些法律效力并保障个人隐私权的机会。"
  },
  {
    "id": "46123678",
    "title": "Indian order to preload state-owned app on smartphones sparks political outcry",
    "url": "https://www.theguardian.com/world/2025/dec/02/indian-order-preload-state-owned-sanchar-saathi-app-smartphones-political-outcry",
    "summary": "The Indian government has mandated that all smartphone manufacturers, including Apple, Samsung, and Xiaomi, pre-install the state-owned cybersecurity app Sanchar Saathi on all new phones sold in India, and push it out via software updates to existing phones. The government claims this is a necessary security measure to combat cybersecurity threats, fraud, and regulate the secondhand phone market. The app is designed to help users track lost or stolen phones, identify fraudulent numbers, and verify the authenticity of used devices.\n\nHowever, the order has sparked significant political opposition and concerns among digital freedom activists, who view it as a potential tool for government surveillance and a violation of privacy. Leaders from the Congress party have strongly condemned the mandate, vowing to protest the \"dystopian\" ruling and labeling the app a \"snooping app.\"\n\nApple is reportedly refusing to comply due to security concerns and its policy against such pre-installation mandates. While the government initially indicated the app couldn't be disabled, the communications minister later stated that users would have the option to delete it. Android users, who comprise the vast majority of the Indian smartphone market, will be asked to grant extensive permissions, including access to call logs, camera, and photos, raising further privacy concerns.\n",
    "chinese_title": "印度强制预装国有应用引发政治抗议",
    "chinese_summary": "印度政府已强制所有智能手机制造商，包括苹果、三星和小米，在新售手机上预装国有的网络安全应用程序Sanchar Saathi，并通过软件更新将其推送至现有手机。政府声称这是一项必要的安全措施，旨在打击网络安全威胁、欺诈和规范二手手机市场。该应用程序旨在帮助用户追踪丢失或被盗手机，识别欺诈号码，并验证二手设备的真伪。\n\n然而，这项命令引发了重大的政治反对和数字自由活动家的担忧，他们认为这是政府进行监控的潜在工具，侵犯了隐私。国大党领导人强烈谴责这项强制令，誓言抗议这项“反乌托邦”的裁决，并将该应用程序称为“窥探应用程序”。\n\n据报道，苹果公司因安全顾虑及其反对此类预装强制令的政策而拒绝遵守。虽然政府最初表示该应用程序无法禁用，但通信部长后来表示用户可以选择删除它。占印度智能手机市场绝大多数的安卓用户将被要求授予广泛的权限，包括访问通话记录、摄像头和照片，这进一步引发了对隐私的担忧。"
  },
  {
    "id": "46070883",
    "title": "10 years of writing a blog nobody reads",
    "url": "https://flowtwo.io/post/on-10-years-of-writing-a-blog-nobody-reads",
    "summary": "This blog post reflects on the author's 10 years of writing a largely unread blog. A primary motivation for writing is self-improvement, specifically to become a better, more concise writer. The author acknowledges past writing flaws, including excessive qualifiers (\"I think,\" \"I feel\") and redundant adjectives, which diluted the impact of their writing. They advocate for confident expression of ideas, even if they are controversial, and using precise language to avoid muddying the message.\n\nThe author emphasizes the iterative nature of the writing process, recommending multiple drafts and writing down ideas as soon as they arise. They highlight the importance of accessible writing tools, citing Obsidian as a useful platform due to its cross-device support.\n\nThe post also touches upon the impact of generative AI on the value of writing. While AI has flooded the market with written content, potentially devaluing it from an economic standpoint, the author argues there's still personal value in human writing. They specifically mention book reviews as a way to solidify knowledge and integrate it into one's understanding of the world. Writing is likened to breathing, a necessary balance to the constant consumption of information.\n\nFinally, the author admits they're still striving to improve, aiming to write more concisely and limit post length to 1000 words. They find the challenge motivating and encourage continued writing.\n",
    "chinese_title": "十年无人问津的博客写作",
    "chinese_summary": "这篇博文反思了作者十年写作一篇鲜为人知博客的经历。写作的主要动机是为了自我提升，特别是为了成为一个更好、更简洁的写作者。作者承认了过去写作中的缺陷，包括过多的限定词（“我认为”、“我觉得”）和冗余的形容词，这些都稀释了他们写作的影响力。他们提倡自信地表达观点，即使这些观点具有争议性，并使用精确的语言来避免混淆信息。\n\n作者强调了写作过程的迭代性，建议撰写多个草稿，并在想法出现时立即记录下来。他们强调了易于使用的写作工具的重要性，并指出Obsidian由于其跨设备支持而成为一个有用的平台。\n\n这篇博文还涉及了生成式人工智能对写作价值的影响。虽然人工智能已经用书面内容淹没了市场，可能从经济角度降低了它的价值，但作者认为人类写作仍然具有个人价值。他们特别提到了书评，认为这是一种巩固知识并将其融入个人对世界理解的方式。写作被比作呼吸，是对不断消费信息的必要平衡。\n\n最后，作者承认他们仍在努力改进，目标是写得更简洁，并将文章长度限制在1000字以内。他们觉得这个挑战很有动力，并鼓励继续写作。"
  },
  {
    "id": "46107282",
    "title": "Cartographers have been hiding illustrations inside Switzerland’s maps (2020)",
    "url": "https://eyeondesign.aiga.org/for-decades-cartographers-have-been-hiding-covert-illustrations-inside-of-switzerlands-official-maps/",
    "summary": "The article \"Cartographers have been hiding illustrations inside Switzerland's maps\" details a long-standing tradition among Swiss cartographers of embedding subtle, whimsical illustrations into the nation's official maps. These hidden images, ranging from mythical creatures like dragons and gnomes to everyday objects like snails and teacups, serve as a form of artistic expression and a playful rebellion against the typically rigid and technical nature of mapmaking.\n\nThe practice began in the mid-20th century, particularly during periods of monotonous work. Cartographers would sneak these illustrations into less prominent areas of the map, such as forests, lakes, or even within contour lines. The subtle placement ensured that the illustrations wouldn't compromise the map's accuracy or functionality.\n\nThe article highlights that these illustrations were often considered \"easter eggs\" for fellow cartographers and those with a keen eye for detail. They were a way for cartographers to inject personality and humor into their work, adding a layer of creativity and intrigue to what might otherwise be perceived as purely utilitarian documents. While not officially sanctioned, the practice was generally tolerated by the Swiss Federal Office of Topography (swisstopo), the organization responsible for creating and maintaining the country's maps.\n\nThe article suggests that the practice may be fading with the increased use of digital mapping technologies, but the legacy of these hidden illustrations remains as a charming example of human creativity blending with technical precision.\n",
    "chinese_title": "制图师曾在瑞士地图中隐藏插图 (2020)",
    "chinese_summary": "制图师在瑞士地图中藏匿插图\n文章《制图师在瑞士地图中藏匿插图》详细介绍了瑞士制图师长期以来的传统，即在国家官方地图中嵌入微妙而异想天开的插图。这些隐藏的图像，从神话生物（如龙和侏儒）到日常物品（如蜗牛和茶杯），既是一种艺术表达形式，也是对地图绘制通常严谨和技术性质的一种俏皮的反叛。\n\n这种做法始于20世纪中叶，尤其是在单调的工作时期。制图师会将这些插图偷偷地添加到地图上不太显眼的地方，例如森林、湖泊，甚至是在等高线内。这种微妙的放置确保了插图不会损害地图的准确性或功能性。\n\n文章强调，这些插图通常被认为是制图师同行和那些具有敏锐观察力的人的“彩蛋”。它们是制图师将个性和幽默注入其工作的一种方式，为可能被认为是纯粹功利性的文件增添了一层创造力和趣味性。虽然未经官方批准，但瑞士联邦地形局（swisstopo，负责创建和维护该国地图的组织）通常容忍这种做法。\n\n文章认为，随着数字地图技术的日益普及，这种做法可能会逐渐消失，但这些隐藏插图的遗产仍然是人类创造力与技术精度融合的一个迷人例证。"
  },
  {
    "id": "46085279",
    "title": "Wacky Fun Physics Ideas",
    "url": "https://scottlocklin.wordpress.com/2025/11/22/wacky-fun-physics-ideas/",
    "summary": "In a 2025 blog post titled \"Wacky Fun Physics Ideas,\" Scott Locklin expresses his dissatisfaction with mainstream physics, finding it stagnant and overly focused on unobservable phenomena. He favors exploring unconventional ideas that challenge existing paradigms.\n\nLocklin highlights three specific \"weird science\" papers:\n\n1.  **Leptons and Gravity:** Explores the possibility that leptons (primarily electrons) might not generate gravity as General Relativity suggests. He argues that experiments should be conducted to determine if leptons contribute to gravity and whether binding energy is gravity-generating.\n2.  **Entropic Gravity:** Discusses the concept of gravity being an entropic result of matrix mechanics, where gravity is experienced through complex entanglement interactions. While acknowledging the shortcomings of existing papers on this topic, Locklin finds the idea that gravity could be thermodynamic in origin intriguing.\n3.  **Electron as a Toroidal Photon:** Presents a model where an electron is a photon with toroidal topology. Locklin emphasizes that this model could resolve many of the weirdnesses of modern physics by providing satisfying mechanistic explanations without mysticism, especially in relation to spin, charge, and Compton wavelength.\n\nLocklin also touches on astrobiology, specifically the possibility of undiscovered forms of life based on different elements like arsenic or silicon and points out the need for new methods for detecting such unusual lifeforms.\n\nLocklin concludes by criticizing the unquestioning acceptance of absurdities in modern physics by many physicists, advocating for a more critical and innovative approach to scientific inquiry.\n",
    "chinese_title": "古怪有趣的物理点子",
    "chinese_summary": "斯科特·洛克林在2025年一篇题为《古怪有趣的物理学想法》的博文中表达了他对主流物理学的不满，认为它停滞不前，并且过度关注不可观测的现象。他倾向于探索挑战现有范式的非传统想法。\n\n洛克林重点介绍了三篇特定的“怪异科学”论文：\n\n1.  **轻子和引力：** 探讨了轻子（主要是电子）可能不像广义相对论所认为的那样产生引力的可能性。他认为应该进行实验来确定轻子是否对引力有贡献，以及结合能是否会产生引力。\n2.  **熵引力：** 讨论了引力是矩阵力学熵的结果这一概念，其中引力是通过复杂的纠缠相互作用来体验的。虽然承认了现有关于这个主题的论文的缺点，但洛克林发现引力可能起源于热力学这一想法很有趣。\n3.  **电子作为环形光子：** 提出了一个电子是具有环形拓扑结构的光子的模型。洛克林强调，这个模型可以通过提供令人满意的、无需神秘主义的机械解释，尤其是在自旋、电荷和康普顿波长方面，来解决现代物理学的许多怪异之处。\n\n洛克林还谈到了天体生物学，特别是基于不同元素（如砷或硅）的未发现生命形式的可能性，并指出需要新的方法来检测这种不寻常的生命形式。\n\n洛克林最后批评了许多物理学家对现代物理学中荒谬之处的盲目接受，并倡导采取更具批判性和创新性的科学探究方法。"
  },
  {
    "id": "46108437",
    "title": "Google, Nvidia, and OpenAI",
    "url": "https://stratechery.com/2025/google-nvidia-and-openai/",
    "summary": "This article analyzes the competitive landscape between Google, Nvidia, and OpenAI in the AI space, framing it as a \"Google Strikes Back\" narrative. It argues that Google's Gemini 3 poses a significant threat to OpenAI's model dominance and Nvidia's hardware dominance.\n\nThe article explores how Google's TPUs, now being offered to companies like Anthropic and Meta, could challenge Nvidia's GPU monopoly and potentially impact Nvidia's long-term growth and profit margins. Despite Nvidia's advantages in GPU flexibility and its CUDA ecosystem, the article suggests that large hyperscalers have the resources to develop alternative software stacks.\n\nHowever, the author ultimately believes OpenAI is better positioned than Nvidia to withstand Google's challenge. While OpenAI is losing money, its consumer base using ChatGPT provides a strong moat. The key difference between ChatGPT and Nvidia is that ChatGPT sells to a much larger audience. The article suggests that ChatGPT's strength lies in its direct consumer relationship, making it difficult for Google to directly displace it. The key differentiator between ChatGPT and Nvidia is the number of unique purchases/users.\n\nThe article concludes that ChatGPT should adopt an advertising model to further strengthen its moat. The author concludes with the thought that it is not out of the question that Google can win the fight for consumer attention.\n",
    "chinese_title": "谷歌、英伟达和OpenAI",
    "chinese_summary": "本文分析了谷歌、英伟达和OpenAI在人工智能领域的竞争格局，并将其框架为一个“谷歌反击”的故事。文章认为，谷歌的Gemini 3对OpenAI的模型霸权和英伟达的硬件霸权构成了重大威胁。\n\n文章探讨了谷歌的TPU，现在正提供给Anthropic和Meta等公司，如何挑战英伟达的GPU垄断，并可能影响英伟达的长期增长和利润率。尽管英伟达在GPU灵活性和CUDA生态系统方面具有优势，但文章认为大型超大规模企业有资源开发替代软件栈。\n\n然而，作者最终认为OpenAI比英伟达更有能力抵御谷歌的挑战。虽然OpenAI正在亏损，但其使用ChatGPT的消费者群体提供了一个强大的护城河。ChatGPT和英伟达的关键区别在于，ChatGPT面向更大的受众销售。文章认为ChatGPT的优势在于其直接的消费者关系，这使得谷歌很难直接取代它。ChatGPT和英伟达的关键区别在于独特的购买/用户数量。\n\n文章总结认为，ChatGPT应该采用广告模式，以进一步加强其护城河。作者最后认为，谷歌赢得消费者注意力之战并非不可能。"
  },
  {
    "id": "46122851",
    "title": "Peter Thiel's Apocalyptic Worldview Is a Dangerous Fantasy",
    "url": "https://jacobin.com/2025/11/peter-thiel-palantir-apocalypse-antichrist",
    "summary": "This article critiques Peter Thiel's \"apocalyptic geopolitics,\" arguing it's a dangerous justification for his reactionary political agenda and business interests. Thiel's worldview, informed by Christian apocalypticism and Nazi legal theorist Carl Schmitt, frames global politics as a battle between the \"Katechon\" (restrainer of the Antichrist) and the Antichrist, mapping onto a struggle between Silicon Valley/the US and a global network of bureaucratic overreach.\n\nThe author argues this framework obscures complex political realities, legitimizing extreme violence against perceived opponents and protecting Thiel's views from scrutiny. Thiel's support for far-right figures, his investment in AI and military technology, and his company Palantir are highlighted as evidence. Palantir's data analytics tools, used by ICE for deportations, the British military for AI-powered targeting, and the Israeli military in Gaza, demonstrate how Thiel's apocalyptic worldview translates into real-world harm and racialized state violence.\n\nThe article concludes that Thiel uses this apocalyptic framework to delegitimize international law, justify violence, and sanctify tech wealth, ultimately mystifying US imperialism and his own corporate interests. He fears a \"one-world government\" that represents a reactionary fear of lost sovereignty and technological democratization. Ultimately, the author contends that Thiel's vision serves as a rhetoric to legitimize the power of technocapitalist elites against the interests of the global majority and the planet. Given current geopolitical tensions, the article warns of the dangers of Thiel's imperialistic and supremacist vision.\n",
    "chinese_title": "彼得·蒂尔末日论的世界观是一种危险的幻想",
    "chinese_summary": "本文批判彼得·蒂尔的“末世地缘政治”，认为这是对其反动政治议程和商业利益的危险辩护。蒂尔的世界观受到基督教末世论和纳粹法学家卡尔·施密特的启发，将全球政治描绘成“制止者”（对抗基督者的人）与敌基督者之间的斗争，映射为硅谷/美国与全球官僚主义过度扩张网络之间的斗争。\n\n作者认为，这种框架掩盖了复杂的政治现实，使针对被认为是对手的极端暴力行为合法化，并保护蒂尔的观点免受审查。文章着重强调了蒂尔对极右翼人士的支持、对人工智能和军事技术的投资，以及他的公司帕兰提尔作为证据。帕兰提尔的数据分析工具被美国移民与海关执法局用于驱逐出境，被英国军方用于人工智能驱动的定位，以及被以色列军方用于加沙，这些都表明蒂尔的末世世界观如何转化为现实世界的伤害和种族化的国家暴力。\n\n文章的结论是，蒂尔利用这种末世框架来否定国际法，为暴力辩护，并神化科技财富，最终模糊了美国的帝国主义和他自己的企业利益。他惧怕代表着对失去主权和技术民主化的反动恐惧的“世界政府”。最终，作者认为，蒂尔的愿景是一种言论，旨在使技术资本主义精英的权力合法化，对抗全球大多数人和地球的利益。鉴于当前的地缘政治紧张局势，文章警告了蒂尔的帝国主义和至上主义愿景的危险。"
  },
  {
    "id": "46108563",
    "title": "Google unkills JPEG XL?",
    "url": "https://tonisagrista.com/blog/2025/google-unkills-jpegxl/",
    "summary": "This article discusses Google's apparent reversal on its decision to remove JPEG XL support from Chromium, the engine behind Chrome, Edge, and other browsers. The author, a long-time JPEG XL advocate, expresses initial disappointment when Google cited \"lack of interest\" for dropping the format, despite widespread support from organizations like Meta, Intel, Adobe, and others.\n\nAfter a period of relative silence, several factors influenced Chromium's reconsideration. These include Firefox's interest in a memory-safe Rust JPEG XL decoder, the PDF Association's intent to adopt JPEG XL for HDR content in PDFs, and Safari's existing support. Rick Byers from Chromium announced the team would welcome a performant and memory-safe decoder, changing the project's status from \"Obsolete\" to \"Assigned.\"\n\nThe author believes this is a crucial step toward JPEG XL's mass adoption, citing its superior features, including lossless JPEG re-compression, wide gamut and HDR support, large image size capabilities, high bit depth and channel support, resilience to generation loss, progressive decoding, animation, alpha transparency, and depth map support. The author concludes that JPEG XL is the future of image formats and is pleased the Chromium team reconsidered, though regrets the time and pressure required to achieve this.\n",
    "chinese_title": "谷歌放弃 JPEG XL？",
    "chinese_summary": "谷歌对JPEG XL的支持态度出现反转"
  },
  {
    "id": "46121786",
    "title": "Claude 4.5 Opus' Soul Document",
    "url": "https://www.lesswrong.com/posts/vpNG99GhbBoLov9og/claude-4-5-opus-soul-document",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "Claude 4.5 Opus 的灵魂文档",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "46107658",
    "title": "The Penicillin Myth",
    "url": "https://www.asimov.press/p/penicillin-myth",
    "summary": "This article challenges the widely accepted narrative of Alexander Fleming's accidental discovery of penicillin. While the story emphasizes serendipity and a contaminated petri dish, the author highlights several inconsistencies and scientific impossibilities.\n\nFirstly, the lab window was rarely open, making contamination unlikely. Secondly, the story mirrors Fleming's earlier discovery of lysozyme, raising questions of repetition. Thirdly, a significant gap exists between Fleming's claimed discovery date (September 3rd) and the first lab notebook entry (October 30th). Most importantly, the author argues that penicillin's mechanism of action—interfering with cell wall synthesis during active growth—contradicts the idea that it could dissolve already-formed staphylococcus colonies, as Fleming suggested. Attempts to replicate Fleming's experiment have consistently failed.\n\nThe article then presents Ronald Hare's theory, developed after examining lab notebooks and conducting his own experiments. Hare suggests that the events surrounding the discovery were likely different from the official account.\n\nThe author concludes by emphasizing the importance of scrutinizing even celebrated scientific stories for accuracy, even while acknowledging penicillin's undeniable success. The discrepancies highlight the need to re-evaluate the historical evidence and explore alternative explanations for Fleming's breakthrough.\n",
    "chinese_title": "青霉素的迷思",
    "chinese_summary": "本文挑战了亚历山大·弗莱明意外发现青霉素这一广为接受的说法。虽然该故事强调了机缘巧合和受污染的培养皿，但作者指出了其中的几个不一致之处和科学上的不可能之处。\n\n首先，实验室的窗户很少打开，这使得污染的可能性不大。其次，这个故事与弗莱明早期发现溶菌酶的故事非常相似，这引起了人们对重复性的质疑。第三，在弗莱明声称的发现日期（9月3日）与第一篇实验记录（10月30日）之间存在显著的时间间隔。最重要的是，作者认为，青霉素的作用机制——干扰活跃生长过程中细胞壁的合成——与它能溶解已经形成的葡萄球菌菌落的说法相矛盾，而弗莱明正是这样认为的。对弗莱明实验的复制尝试一直未能成功。\n\n然后，本文介绍了罗纳德·黑尔的理论，该理论是在检查实验室笔记本并进行自己的实验后提出的。黑尔认为，围绕这一发现的事件可能与官方说法不同。\n\n作者最后强调，即使在承认青霉素的无可否认的成功的同时，也必须仔细审查甚至是被人们津津乐道的科学故事的准确性。这些差异突出了重新评估历史证据并探索弗莱明突破性发现的替代解释的必要性。"
  },
  {
    "id": "46056022",
    "title": "Invisible details of interaction design (2023)",
    "url": "https://rauno.me/craft/interaction-design",
    "summary": "This article explores the \"invisible details\" of interaction design, arguing that great design isn't just about feel and intuition, but about understanding the \"why\" behind successful interactions. The author advocates for a hands-on, problem-solving approach to learning, combining experimentation with reflective thinking.\n\nThe core concepts highlighted are:\n\n*   **Metaphors:** Great interaction design leverages real-world metaphors, rewarding learning and making interfaces intuitive. Examples include swiping (books), pinching (zooming), and layered interfaces.\n*   **Kinetic Physics:** Incorporating realistic physics, like momentum and responsiveness, enhances the user experience.\n*   **Swipe Gestures:** Determining when to trigger actions during a swipe versus at the end is crucial. Lightweight actions trigger during, while destructive actions require gesture completion.\n*   **Responsive Gestures:** Immediate feedback and affordance are vital for satisfying interactions.\n*   **Spatial Consistency:** Visual cues and motion should consistently indicate the origin and destination of elements, enhancing understanding.\n*   **Fluid Morphing:** Seemless animations like the app icon morphing during dismissal enhance the experience.\n*   **Frequency & Novelty:** Animations should be used judiciously. High-frequency interactions may benefit from less animation to avoid cognitive overload.\n*   **Fidgetability:** Incorporating elements that allow for repetitive, subconscious interaction can enhance engagement.\n*   **Scroll Landmarks:** Features that help users retain scroll positions during navigation improve usability.\n*   **Touch Content Visibility:** Minimizing finger obstruction on touch interfaces enhances clarity.\n\nIn essence, the article argues that great interaction design hinges on a deep understanding of human behavior and how to seamlessly integrate technology into our lives.\n",
    "chinese_title": "交互设计的隐形细节 (2023)",
    "chinese_summary": "本文探讨交互设计中的“隐形细节”，认为优秀的设计不仅仅在于感觉和直觉，更在于理解成功交互背后的“为什么”。作者提倡一种实践性的、解决问题的学习方法，将实验与反思性思维相结合。\n\n核心概念包括：\n\n*   **隐喻：** 优秀的交互设计利用现实世界的隐喻，鼓励学习并使界面直观。例如滑动（书籍）、捏合（缩放）和分层界面。\n*   **动能物理：** 融入真实的物理效果，如动量和响应，可以提升用户体验。\n*   **滑动操作：** 确定滑动过程中何时触发操作以及何时在结束时触发操作至关重要。轻量级操作在滑动过程中触发，而破坏性操作需要手势完成。\n*   **响应式手势：** 即时反馈和示能性对于令人满意的交互至关重要。\n*   **空间一致性：** 视觉提示和运动应始终指示元素的来源和目的地，从而增强理解。\n*   **流畅变形：** 无缝动画，如应用程序图标在关闭期间的变形，可以提升体验。\n*   **频率与新颖性：** 应谨慎使用动画。高频交互可能受益于减少动画，以避免认知超载。\n*   **小动作性：** 融入允许重复、下意识交互的元素可以增强参与度。\n*   **滚动地标：** 帮助用户在导航过程中保持滚动位置的功能可提高可用性。\n*   **触摸内容可见性：** 尽量减少手指在触摸界面上的遮挡，可以增强清晰度。\n\n本质上，本文认为，优秀的交互设计取决于对人类行为的深刻理解，以及如何将技术无缝地融入我们的生活。"
  },
  {
    "id": "46121833",
    "title": "AI Is Destroying the University and Learning Itself",
    "url": "https://www.currentaffairs.org/news/ai-is-destroying-the-university-and-learning-itself",
    "summary": "In his article \"AI Is Destroying the University and Learning Itself,\" Ronald Purser argues that the integration of AI, particularly ChatGPT, into higher education is undermining the very purpose of universities and fostering a culture of cheating. He details how universities, facing budget cuts and enrollment declines, are embracing AI as a solution, partnering with companies like OpenAI while simultaneously cutting faculty positions and academic programs.\n\nPurser highlights the irony of institutions defunding critical thinking departments, like Women and Gender Studies and Anthropology, which are best equipped to analyze the ethical implications of AI, while promoting AI tools across campus. He critiques the shift towards viewing education as a vocational feeder for private markets, with knowledge commodified and students treated as consumers.\n\nThe article contends that AI transforms education into logistics, automating grading and generating essays, thereby diminishing human capacities like curiosity and critical thinking. This results in \"simulated learning\" where students are taught to prompt AI effectively rather than think deeply.\n\nPurser discusses the rise of a \"cheating-AI technology complex\" where students use AI to cheat, universities use AI to detect cheating, and companies profit from both. He references the case of Chungin \"Roy\" Lee, who cheated his way through Columbia University using AI and then launched a company, Cluely, designed to help others cheat. Purser concludes that the university is trading its teaching mission for \"AI-tech integration,\" risking irrelevance and becoming soulless, and argues that administrators are aware of the problem but prioritize enrollment and tuition over genuine learning.\n",
    "chinese_title": "人工智能正在摧毁大学和学习本身",
    "chinese_summary": "在他的文章《人工智能正在摧毁大学和学习本身》中，罗纳德·珀瑟认为，将人工智能，特别是ChatGPT，融入高等教育正在破坏大学的根本目的，并助长作弊之风。他详细描述了大学在面临预算削减和入学人数下降的情况下，是如何拥抱人工智能作为解决方案的，与OpenAI等公司合作，同时削减教师职位和学术项目。\n\n珀瑟强调了一种讽刺现象：机构一方面削减像女性与性别研究和人类学这样最能分析人工智能伦理影响的批判性思维部门的资金，另一方面却在整个校园推广人工智能工具。他批评了将教育视为私有市场职业输送带的转变，知识被商品化，学生被视为消费者。\n\n这篇文章认为，人工智能将教育转变为物流，使评分和生成文章自动化，从而削弱了人类的好奇心和批判性思维等能力。这导致了“模拟学习”，学生被教导如何有效地提示人工智能，而不是进行深入思考。\n\n珀瑟讨论了“作弊-人工智能技术复合体”的兴起，学生使用人工智能作弊，大学使用人工智能检测作弊，公司则从两者中获利。他提到了钟寅（音译）“罗伊”·李的案例，他通过使用人工智能在哥伦比亚大学作弊，然后创办了一家名为Cluely的公司，旨在帮助其他人作弊。珀瑟总结说，大学正在用“人工智能技术融合”来交易其教学使命，冒着变得无关紧要和失去灵魂的风险，并认为管理者们意识到这个问题，但将招生和学费置于真正的学习之上。"
  },
  {
    "id": "46114122",
    "title": "John Giannandrea to retire from Apple",
    "url": "https://www.apple.com/newsroom/2025/12/john-giannandrea-to-retire-from-apple/",
    "summary": "John Giannandrea, Apple's Senior Vice President for Machine Learning and AI Strategy, will retire in Spring 2026 after serving as an advisor. Amar Subramanya, formerly of Microsoft and Google (where he led engineering for Google's Gemini Assistant), has joined Apple as Vice President of AI, reporting to Craig Federighi.\n\nSubramanya will lead critical AI areas, including Apple Foundation Models, ML research, and AI Safety and Evaluation. The remainder of Giannandrea’s organization will be integrated into the teams of Sabih Khan and Eddy Cue.\n\nSince joining Apple in 2018, Giannandrea has been instrumental in shaping Apple's AI and machine learning strategy. Tim Cook expressed gratitude for Giannandrea's contributions and welcomed Subramanya, highlighting AI's central role in Apple's future. Federighi will oversee the expanded AI efforts, including a more personalized Siri.\n\nApple aims to leverage Subramanya's expertise and Federighi's expanded role to accelerate its AI development, focusing on delivering intelligent and trusted experiences. The move signals Apple's commitment to advancing AI for its users.\n",
    "chinese_title": "约翰·贾南德雷亚将从苹果退休",
    "chinese_summary": "苹果机器学习与人工智能战略高级副总裁约翰·詹南德雷亚将在担任顾问后于2026年春季退休。曾就职于微软和谷歌（领导谷歌 Gemini 助手工程）的 Amar Subramanya 已加入苹果公司担任人工智能副总裁，向克雷格·费德里吉汇报。\n\nSubramanya 将领导关键的人工智能领域，包括 Apple 基础模型、机器学习研究以及人工智能安全和评估。詹南德雷亚团队的其余部分将并入 Sabih Khan 和 Eddy Cue 的团队。\n\n自 2018 年加入苹果以来，詹南德雷亚在塑造苹果的人工智能和机器学习战略方面发挥了重要作用。蒂姆·库克对詹南德雷亚的贡献表示感谢，并欢迎 Subramanya 的加入，强调了人工智能在苹果未来发展中的核心作用。费德里吉将负责监督扩大后的人工智能工作，包括更加个性化的 Siri。\n\n苹果旨在利用 Subramanya 的专业知识和费德里吉扩大的职责范围来加速其人工智能开发，专注于提供智能且值得信赖的体验。此举表明了苹果致力于为用户推进人工智能的决心。"
  },
  {
    "id": "46117993",
    "title": "Why Replicate is joining Cloudflare",
    "url": "https://blog.cloudflare.com/why-replicate-joining-cloudflare/",
    "summary": "Replicate, a platform for running machine learning models as APIs, is joining Cloudflare. Founded in 2019 with the mission to make AI models accessible to developers, Replicate provided tooling to simplify running models without requiring deep machine learning expertise. Their platform gained significant traction with the release of Stable Diffusion in 2022, enabling developers to build a wide range of AI-powered applications.\n\nThe decision to join Cloudflare stems from the evolution of AI application development. Modern AI applications now involve complex stacks beyond just model inference, including microservices, content delivery, and databases. Cloudflare offers the network, infrastructure (Workers, R2, Durable Objects), and primitives needed to build complete AI stacks.\n\nBy joining Cloudflare, Replicate aims to build the AI infrastructure layer they envisioned, enabling functionalities like running fast models on the edge, executing model pipelines with Workers, and streaming model inputs/outputs with WebRTC. They believe that \"the network is the computer\" and that Cloudflare's platform will allow them to realize this vision for AI.\n\nReplicate highlights its role as a pioneer in generative AI serving and emphasizes the vibrant community of builders and researchers that has grown around their product. They see this acquisition as a natural progression to provide even more powerful and comprehensive tools for AI development.\n",
    "chinese_title": "Replicate为何加入Cloudflare",
    "chinese_summary": "Replicate加入Cloudflare，加速AI应用开发。\n\nReplicate，一个将机器学习模型作为API运行的平台，将加入Cloudflare。Replicate成立于2019年，其使命是让开发者更容易地使用AI模型，它提供的工具简化了模型的运行，无需深厚的机器学习专业知识。随着2022年Stable Diffusion的发布，他们的平台获得了显著的吸引力，使开发者能够构建各种AI驱动的应用程序。\n\n加入Cloudflare的决定源于AI应用程序开发的演变。现代AI应用程序现在涉及到复杂的堆栈，不仅仅是模型推理，还包括微服务、内容交付和数据库。Cloudflare提供了构建完整AI堆栈所需的网络、基础设施（Workers、R2、Durable Objects）和原语。\n\n通过加入Cloudflare，Replicate旨在构建他们设想的AI基础设施层，实现诸如在边缘运行快速模型、使用Workers执行模型管道以及使用WebRTC流式传输模型输入/输出等功能。他们认为“网络就是计算机”，Cloudflare的平台将使他们能够实现这一AI愿景。\n\nReplicate强调了其在生成式AI服务方面的先驱作用，并强调了围绕其产品发展起来的充满活力的构建者和研究人员社区。他们认为此次收购是为AI开发提供更强大和更全面的工具的自然发展。"
  },
  {
    "id": "46107177",
    "title": "A vector graphics workstation from the 70s",
    "url": "https://justanotherelectronicsblog.com/?p=1429",
    "summary": "This article details the restoration of a Tektronix 4051 graphics workstation from 1975. The author recounts the history of Tektronix, a company renowned for its oscilloscopes, and its foray into computer terminals using storage CRT technology, culminating in the 4051. This machine, based on the Motorola 6800, ran BASIC with specialized graphics subroutines and offered up to 32KB of RAM. It was targeted at researchers and analysts.\n\nThe author describes finding a 4051 in disrepair and the process of diagnosing and fixing it. Initial problems included a faulty power switch and a disconnected transformer wire. Subsequently, a resistor burned out, requiring replacement. The CRT display was heavily miscalibrated, necessitating adjustments to various voltage settings to achieve a readable image.\n\nThe author's 4051 has maxed out RAM at 32KB and a ROM expander. It lacked a serial port but came with an OS backup tape and three ROMs (editor, binary loader/saver, and floppy drive support).\n\nThe author notes the limitations of the storage CRT for dynamic games but points to the availability of demos and programs on Monty McGraw's GitHub repository, including a Monopoly game and an emulator for modern computers. Future plans involve building a GPIB flash emulator for loading programs and cloning missing ROM cards.\n",
    "chinese_title": "70年代的矢量图形工作站",
    "chinese_summary": "本文详细介绍了1975年产泰克4051图形工作站的修复过程。作者回顾了以示波器闻名的泰克公司的历史，以及该公司利用存储式CRT技术进军计算机终端领域的历程，最终推出了4051。这款机器基于摩托罗拉6800处理器，运行带有专用图形子程序的BASIC语言，并提供高达32KB的RAM，其目标用户是研究人员和分析师。\n\n作者描述了发现一台损坏的4051，以及诊断和修复它的过程。最初的问题包括一个有故障的电源开关和一根断开的变压器电线。随后，一个电阻烧毁，需要更换。CRT显示器严重失调，需要调整各种电压设置才能获得可读的图像。\n\n作者的4051配备了最大32KB的RAM和一个ROM扩展器。它缺少串行端口，但附带了操作系统备份磁带和三个ROM（编辑器、二进制加载/保存器和软盘驱动器支持）。\n\n作者指出了存储式CRT在动态游戏方面的局限性，但也提到了 Monty McGraw 的 GitHub 存储库中提供的演示程序和程序，包括一款 Monopoly 游戏和用于现代计算机的模拟器。未来的计划包括构建一个用于加载程序的GPIB闪存模拟器，以及克隆缺失的ROM卡。"
  },
  {
    "id": "46111469",
    "title": "Why I stopped using JSON for my APIs",
    "url": "https://aloisdeniel.com/blog/better-than-json",
    "summary": "The article argues against the widespread use of JSON for APIs, advocating for Protocol Buffers (Protobuf) as a more efficient and developer-friendly alternative. While acknowledging JSON's human-readability, simplicity, and widespread adoption, the author highlights Protobuf's superior features: strong typing enforced by `.proto` schema files, automatic code generation for various languages (Dart, TypeScript, Go, etc.), and ultra-efficient binary serialization.\n\nProtobuf's binary format results in smaller message sizes (approximately 3x smaller than JSON in the example provided), leading to less bandwidth consumption, faster response times, and improved user experience. The author illustrates how to implement a simple HTTP server and client in Dart using Protobuf for data serialization and deserialization, emphasizing the type safety and reduced need for manual validation.\n\nThe article does concede JSON's advantage in human-readable debugging, as Protobuf data requires specialized tooling and the schema file for proper interpretation. However, the author concludes that the performance gains, robustness, and improved development experience provided by Protobuf outweigh this drawback, making it a compelling alternative for API development. The article encourages developers to consider Protobuf for its performance, robustness, and enhanced development experience.\n",
    "chinese_title": "我为什么不再使用 JSON 作为我的 API",
    "chinese_summary": "本文反对API中广泛使用JSON，提倡使用Protocol Buffers (Protobuf) 作为更高效、更友好的替代方案。文章承认JSON具有人类可读性、简单性和广泛应用，但强调了Protobuf的优势：通过`.proto`模式文件强制执行的强类型、各种语言（Dart、TypeScript、Go等）的自动代码生成以及超高效的二进制序列化。\n\nProtobuf的二进制格式导致更小的消息大小（在提供的示例中，大约是JSON的1/3），从而减少带宽消耗、加快响应时间并改善用户体验。作者演示了如何使用Protobuf进行数据序列化和反序列化，在Dart中实现一个简单的HTTP服务器和客户端，强调了类型安全性和减少手动验证的需求。\n\n文章确实承认JSON在人类可读的调试方面的优势，因为Protobuf数据需要专门的工具和模式文件才能正确解释。然而，作者总结说，Protobuf提供的性能提升、健壮性和改进的开发体验超过了这一缺点，使其成为API开发的引人注目的替代方案。文章鼓励开发者考虑使用Protobuf，以获得其性能、健壮性和增强的开发体验。"
  },
  {
    "id": "46104396",
    "title": "Games using anti-cheats and their compatibility with GNU/Linux or Wine/Proton",
    "url": "https://areweanticheatyet.com/",
    "summary": "The article \"Are We Anti-Cheat Yet?\" is a community-maintained list documenting the compatibility of games with anti-cheat systems and their ability to run on GNU/Linux using Wine/Proton. It provides a breakdown of game compatibility, categorizing them as \"Supported,\" \"Running,\" \"Planned,\" \"Broken,\" or \"Denied.\" These categories indicate the level of functionality a game has on Linux. \"Supported\" means the game runs well, while \"Running\" suggests it might work but could have issues. \"Broken\" implies it is currently unplayable, and \"Denied\" means it is unlikely to ever work due to anti-cheat incompatibility.\n\nThe article allows users to search and sort games by name and status. For each game, it lists the anti-cheat system used, specific notes about compatibility (like required Proton versions), and the date of the last recorded update. Examples from the provided excerpt include Halo: The Master Chief Collection and Halo Infinite being \"Supported\" with specific requirements, Fortnite, Battlefield 2042, Apex Legends and Valorant are marked as \"Denied\", Paladins, Black Desert Online, Fall Guys are listed as \"Running\", PUBG being \"Broken\" and games like Back 4 Blood, SMITE, ARK: Survival Evolved, DayZ and Dead By Daylight are \"Supported\". The main goal is to provide a resource for Linux gamers to determine whether their favorite games are playable, given the complexities of anti-cheat systems and their interaction with Wine/Proton.\n",
    "chinese_title": "使用反作弊的游戏及其与GNU/Linux或Wine/Proton的兼容性",
    "chinese_summary": "文章“我们反作弊了吗？”是一个由社区维护的列表，记录了游戏与反作弊系统的兼容性，以及它们在使用Wine/Proton的情况下在GNU/Linux上运行的能力。它提供了游戏兼容性的细分，将它们分类为“支持”、“运行”、“计划”、“损坏”或“拒绝”。这些类别表明了游戏在Linux上的功能级别。“支持”意味着游戏运行良好，而“运行”表明它可能有效，但可能存在问题。“损坏”意味着它目前无法运行，“拒绝”意味着由于反作弊不兼容，它不太可能有效。\n\n该文章允许用户按名称和状态搜索和排序游戏。对于每个游戏，它列出了所使用的反作弊系统、关于兼容性的具体注释（如所需的Proton版本）以及上次记录更新的日期。从提供的摘录中，例如，《光环：士官长合集》和《光环：无限》被标记为“支持”，并具有特定要求，《堡垒之夜》、《战地2042》、《Apex英雄》和《Valorant》被标记为“拒绝”，《枪火游侠》、《黑色沙漠》、《糖豆人：终极淘汰赛》被列为“运行”，《绝地求生》被标记为“损坏”，而像《喋血复仇》、《SMITE》、《方舟：生存进化》、《DayZ》和《黎明杀机》等游戏则被标记为“支持”。主要目标是为Linux游戏玩家提供一个资源，以确定他们喜欢的游戏是否可以运行，因为反作弊系统及其与Wine/Proton的交互非常复杂。"
  },
  {
    "id": "46115682",
    "title": "Arcee Trinity Mini: US-Trained Moe Model",
    "url": "https://www.arcee.ai/blog/the-trinity-manifesto?src=hn",
    "summary": "Arcee AI introduces Trinity, a family of open-weight Mixture of Experts (MoE) language models trained end-to-end in the U.S., designed to provide developers with strong reasoning capabilities and full control. Two models are currently available: Trinity Nano Preview (a 6B parameter, personality-focused chat model with 800M active parameters) and Trinity Mini (a 26B parameter reasoning model with 3B active parameters). Trinity Large, a 420B parameter frontier model with 13B active parameters, is currently in training on 2048 B300 GPUs and is expected to be released in January 2026.\n\nThe company decided to pretrain their own models to address limitations in existing open-source models, jurisdictional safety concerns (data provenance and licensing), and to enable the development of self-improving AI systems that can adapt their training loops based on live usage. They built on their experience with AFM-4.5B, a dense 4.5B parameter model, to develop the afmoe architecture for Trinity, which incorporates techniques like gated attention, depth-scaled sandwich norm, and sigmoid routing.\n\nTrinity Nano and Mini are designed as compact reasoning models tuned for agents and tools, offering cost-efficient API pricing. They are trained on a 10T token dataset with progressively higher quality and STEM concentration. The training process is described as challenging, requiring significant infrastructure and expertise, including collaboration with DatologyAI for data generation and Prime Intellect for compute resources. Arcee AI emphasizes the importance of owning the model weights and training loop to enable responsible and effective AI development. The models are available for download on Hugging Face and can be accessed through OpenRouter. Arcee encourages users to experiment with the models and provide feedback.\n",
    "chinese_title": "阿尔西三位一体迷你：美式萌系模型",
    "chinese_summary": "Arcee AI推出Trinity：一系列在美国端到端训练的开源权重混合专家(MoE)语言模型，旨在为开发者提供强大的推理能力和完全控制权。目前已推出两款模型：Trinity Nano Preview（一个60亿参数，以个性化为中心的聊天模型，具有8亿个活跃参数）和Trinity Mini（一个260亿参数的推理模型，具有30亿个活跃参数）。Trinity Large是一个4200亿参数的前沿模型，具有130亿个活跃参数，目前正在2048个B300 GPU上进行训练，预计将于2026年1月发布。\n\n该公司决定预训练自己的模型，以解决现有开源模型的局限性、管辖范围内的安全问题（数据来源和许可），并实现能够根据实时使用情况调整训练循环的自改进AI系统的开发。他们基于在AFM-4.5B（一个45亿参数的密集模型）方面的经验，开发了Trinity的afmoe架构，该架构融合了门控注意力、深度缩放三明治归一化和Sigmoid路由等技术。\n\nTrinity Nano和Mini被设计为紧凑型推理模型，专为代理和工具而调优，提供具有成本效益的API定价。它们在一个具有10万亿个token的数据集上进行训练，数据集质量和STEM集中度逐渐提高。训练过程被描述为具有挑战性，需要大量的基础设施和专业知识，包括与DatologyAI合作进行数据生成，以及与Prime Intellect合作提供计算资源。Arcee AI强调拥有模型权重和训练循环对于实现负责任和有效的AI开发的重要性。这些模型可在Hugging Face上下载，并可通过OpenRouter访问。Arcee鼓励用户尝试这些模型并提供反馈。"
  },
  {
    "id": "46103858",
    "title": "It’s been a very hard year",
    "url": "https://bell.bz/its-been-a-very-hard-year/",
    "summary": "Andy, the founder of Set Studio/Piccalilli, is candidly sharing the struggles his bootstrapped company has faced this year due to a combination of economic hardship, political instability, and the industry's obsession with AI.  He refuses to work on AI product marketing due to ethical concerns.\n\nDespite these challenges, Set Studio/Piccalilli remains committed to producing high-quality websites, design systems, and free educational content on Piccalilli, funded by premium courses.  Andy expresses his dream of running Piccalilli full-time, but achieving this depends heavily on their Black Friday sales.\n\nEarlier this year, a community funding model via Open Collective was attempted, but it failed to gain sufficient traction. Andy acknowledges the financial constraints affecting everyone.\n\nThis post serves as context for a direct appeal: Andy is asking for help. He outlines three key ways people can support Set Studio/Piccalilli: purchasing their discounted Black Friday courses (JavaScript for Everyone, Mindful Design, and Complete CSS), sharing their courses and studio with their networks, and hiring Set Studio for web projects or Andy for CSS/front-end consulting starting in the new year.\n\nHe emphasizes Set Studio's unique approach of prioritizing partnership, efficiency, fair pricing, and ethical design, focusing on branding, messaging, accessibility and user experience to drive results. He also highlights his own consulting expertise.\n\nAndy concludes with a message of transparency and solidarity, hoping to connect with others facing similar struggles and urging readers to share the post to help generate leads. He reiterates his commitment to providing valuable resources and services.\n",
    "chinese_title": "这是非常艰难的一年。",
    "chinese_summary": "Set Studio/Piccalilli创始人Andy坦诚分享了今年其自力更生公司因经济困难、政治不稳定和行业对AI的痴迷所面临的困境。出于伦理考虑，他拒绝从事AI产品营销工作。\n\n尽管面临这些挑战，Set Studio/Piccalilli仍致力于制作高质量的网站、设计系统，以及在Piccalilli上提供免费教育内容，这些内容由付费课程资助。Andy表达了他全职运营Piccalilli的梦想，但实现这一目标在很大程度上取决于他们的黑色星期五促销。\n\n今年早些时候，曾尝试通过Open Collective建立社区资助模式，但未能获得足够的关注。Andy承认财务约束影响着所有人。\n\n这篇文章旨在直接呼吁：Andy正在寻求帮助。他概述了人们支持Set Studio/Piccalilli的三种主要方式：购买他们打折的黑色星期五课程（JavaScript for Everyone、Mindful Design和Complete CSS），与他们的社交圈分享他们的课程和工作室，以及在新的一年开始聘请Set Studio进行网站项目或Andy进行CSS/前端咨询。\n\n他强调Set Studio独特的合作优先、效率至上、公平定价和道德设计方法，专注于品牌推广、信息传递、可访问性和用户体验以推动成果。他还强调了他自己的咨询专长。\n\nAndy最后以透明和团结的信息结束，希望与面临类似困境的其他人联系，并敦促读者分享这篇文章以帮助产生潜在客户。他重申了他致力于提供有价值的资源和服务的承诺。"
  },
  {
    "id": "46117900",
    "title": "Frequently Asked Unicycling Questions",
    "url": "https://vale.rocks/posts/unicycle-faq",
    "summary": "This article humorously addresses frequently asked questions a unicyclist encounters. People often ask if they lost a wheel, to which witty comebacks abound. The author clarifies that unicycling is harder than biking because it lacks forwards/backwards stability. While not particularly dangerous, helmets are essential.\n\nLearning takes weeks of dedicated practice. Brakes exist but are tricky to use, requiring careful feathering due to the lack of inherent stability. Saddle soreness is common, mitigated by posture adjustments and avoiding backpacks.\n\nHandlebars on advanced unicycles aid steering, weight distribution, and securing the rider during technical maneuvers. Mounting is either assisted or via a free mount technique. Unicycles lack suspension, relying on the rider's knees and tire thickness for shock absorption.\n\nFalling is infrequent for experienced riders, often occurring during challenging off-road riding. Gears are rare but available via expensive geared hubs like the Schlumpf hub. Downhills are tough on the knees, and uphills, though challenging, can be fun. Overall, the article provides informative and humorous responses to common unicycling inquiries.\n",
    "chinese_title": "常见独轮车问题解答",
    "chinese_summary": "本文幽默地解答了独轮车骑行者经常遇到的问题。人们常问他们是否丢了一个轮子，对此有很多诙谐的回答。作者阐明独轮车比自行车更难，因为它缺乏前后方向的稳定性。虽然不特别危险，但头盔是必不可少的。\n\n学习需要数周的专注练习。刹车是存在的，但很难使用，需要小心地控制，因为缺乏固有的稳定性。鞍座酸痛很常见，可以通过调整姿势和避免背包来缓解。\n\n高级独轮车上的车把有助于转向、重量分配，并在技术动作中固定骑行者。安装方式可以是辅助安装，也可以是通过自由安装技术。独轮车没有悬架，而是依靠骑行者的膝盖和轮胎厚度来吸收震动。\n\n对于有经验的骑行者来说，摔倒并不常见，通常发生在具有挑战性的越野骑行过程中。齿轮很少见，但可以通过昂贵的齿轮花鼓获得，比如 Schlumpf 花鼓。下坡对膝盖来说很艰难，而上坡虽然具有挑战性，但也可能很有趣。总的来说，本文对常见的独轮车骑行疑问提供了信息丰富且幽默的解答。"
  },
  {
    "id": "46074222",
    "title": "Shrinking While Linking",
    "url": "https://www.tweag.io/blog/2025-11-27-shrinking-static-libs/",
    "summary": "Joe Neeman's \"Shrinking While Linking\" addresses the problem of large static library sizes, particularly in the context of distributing a Rust library to Go developers. Static libraries, being bundles of object files, often contain unnecessary code and data, leading to substantial size bloat.\n\nThe article outlines two main strategies for reducing static library size: using traditional binary tools and leveraging LLVM-specific tools.\n\nThe **binary tools approach** involves:\n1.  Unpacking the archive.\n2.  Re-linking the object files into a single object, using `--gc-sections` to remove unused code.\n3.  Removing LLVM bitcode (`.llvmbc`) and debug information.\n4.  Merging tiny sections using a linker script to reduce the overhead of numerous section headers.\n\nThe **LLVM tools approach**, useful for platforms like MacOS where `--gc-sections` is unavailable, focuses on the LLVM intermediate representation:\n1.  Extracting the LLVM bitcode from object files.\n2.  Combining the bitcode files into a single large file.\n3.  Using `opt` with `internalize` and `globaldce` passes to remove unused code based on the public API.\n4.  Recompiling the result into an object file.\n\nThe article notes that both approaches achieve similar size reductions (around 85%), but the LLVM tools offer better portability across platforms. However, the bintools method is faster and works for any static library, not just those compiled with LLVM. The author concludes that, due to its cross-platform compatibility, they will use the LLVM approach for building Nickel's static libraries.\n",
    "chinese_title": "紧缩式链接",
    "chinese_summary": "Joe Neeman的“链接时收缩”解决了静态库体积过大的问题，尤其是在将Rust库分发给Go开发者时。静态库是目标文件的集合，通常包含不必要的代码和数据，导致体积大幅膨胀。\n\n文章概述了两种主要的静态库体积缩减策略：使用传统的二进制工具和利用LLVM特定工具。\n\n**二进制工具方法**包括：\n1. 解压缩归档文件。\n2. 将目标文件重新链接成一个单独的目标文件，使用`--gc-sections`移除未使用的代码。\n3. 移除LLVM字节码（`.llvmbc`）和调试信息。\n4. 使用链接器脚本合并微小节，以减少大量节头的开销。\n\n**LLVM工具方法**，适用于像MacOS这样`--gc-sections`不可用的平台，侧重于LLVM中间表示：\n1. 从目标文件中提取LLVM字节码。\n2. 将字节码文件合并成一个大型文件。\n3. 使用带有`internalize`和`globaldce`选项的`opt`来根据公共API移除未使用的代码。\n4. 将结果重新编译成目标文件。\n\n文章指出，两种方法都实现了类似的体积缩减效果（约85%），但LLVM工具提供了更好的跨平台性。然而，bintools方法速度更快，并且适用于任何静态库，而不仅仅是那些用LLVM编译的库。作者总结说，由于其跨平台兼容性，他们将使用LLVM方法来构建Nickel的静态库。"
  },
  {
    "id": "46090184",
    "title": "Tested: 1981 Datsun 280ZX Turbo (1981)",
    "url": "https://www.caranddriver.com/reviews/a69529696/1981-datsun-280-zx-turbo-archive-test/",
    "summary": "The Car and Driver review of the 1981 Datsun 280ZX Turbo paints a picture of a comfortable and relatively quick grand tourer, though not without its shortcomings. The review highlights the addition of a turbocharger to the 2.8-liter inline-six engine, boosting horsepower to 180 and providing a noticeable improvement in acceleration compared to the naturally aspirated version. The turbocharger helps address previous criticisms of the 280ZX lacking the punch to match its sporty looks.\n\nThe article emphasizes the car's luxurious features and comfortable ride, positioning it more as a GT car than a pure sports car. Standard equipment like power windows, air conditioning, and a sophisticated sound system contribute to this luxurious feel. While the handling is deemed competent, particularly with the optional sport suspension, it's not as sharp or engaging as some rivals, prioritizing comfort over outright performance.\n\nThe review also notes some drawbacks. Turbo lag is present, requiring some driver adaptation. Fuel economy, while acceptable, isn't exceptional. The interior, while well-equipped, is considered somewhat dated in design. Finally, the price point is considered high compared to some competing models, putting it in the same bracket as more established European brands. Overall, the 1981 Datsun 280ZX Turbo is presented as a worthwhile improvement over the non-turbo model, offering a compelling blend of style, comfort, and performance for those seeking a relaxed yet capable grand touring experience.\n",
    "chinese_title": "测试：1981年达特桑280ZX涡轮增压型 (1981年)",
    "chinese_summary": "1981年《汽车与驾驶员》杂志对达特桑280ZX Turbo的评测描绘了一幅舒适且相对快速的豪华旅行车图景，但也并非没有缺点。 评测重点介绍了2.8升直列六缸发动机增加了涡轮增压器，将马力提高到180匹，与自然吸气版本相比，加速性能有了显著提高。 涡轮增压器有助于解决之前对280ZX缺乏与其运动外观相匹配的冲击力的批评。\n\n该文章强调了汽车的豪华功能和舒适的乘坐体验，将其定位为GT跑车而非纯粹的跑车。 诸如电动车窗、空调和先进的音响系统等标准配置都增强了这种豪华感。 虽然操控被认为是合格的，尤其是在可选的运动悬架下，但它不如一些竞争对手那样敏锐或吸引人，而是优先考虑舒适性而不是纯粹的性能。\n\n评测还提到了一些缺点。 涡轮迟滞现象依然存在，需要驾驶员适应。 燃油经济性虽然可以接受，但并不出色。 内饰虽然配备齐全，但设计上有些过时。 最后，与一些竞争车型相比，其价格被认为偏高，使其与一些更成熟的欧洲品牌处于同一价位。 总而言之，1981年的达特桑280ZX Turbo被认为是比非涡轮增压车型更有价值的改进，为那些寻求轻松而又强大的豪华旅行体验的人提供了引人注目的风格、舒适性和性能的结合。"
  },
  {
    "id": "46096337",
    "title": "Advent of Code 2025",
    "url": "https://adventofcode.com/2025/about",
    "summary": "Advent of Code is an annual Advent calendar with daily programming puzzles created by Eric Wastl. It's designed for various skill levels and can be solved in any programming language. People use it for skill development, challenges, and competition.\n\nThe puzzles emphasize problem-solving skills and don't require a computer science background or powerful hardware. The puzzles unlock at midnight EST/UTC-5, and the difficulty generally increases throughout the event.\n\nThe document provides tips for tackling the puzzles, suggesting users re-read descriptions, test solutions against examples, and build test cases. It also addresses frequently asked questions about authentication, difficulty levels, high contrast mode, puzzle ideas, bug reports, solution speed, and the global leaderboard's removal.\n\nKey points include the allowance of private leaderboards, a strong discouragement against using AI to solve puzzles, and a request not to copy or redistribute Advent of Code content. The puzzles and associated design elements are copyrighted to Advent of Code, but users retain ownership of their solutions. The document also credits beta testers and community managers.\n",
    "chinese_title": "代码降临 2025",
    "chinese_summary": "代码降临节是由 Eric Wastl 创建的年度编程解谜日历。它面向不同技能水平的人群，可以使用任何编程语言解决。人们用它来发展技能、迎接挑战和参与竞赛。\n\n这些谜题强调解决问题的能力，不需要计算机科学背景或强大的硬件。谜题在美东时间/UTC-5午夜解锁，难度通常会随着活动进行而增加。\n\n本文档提供了解决谜题的技巧，建议用户重读描述、根据示例测试解决方案以及构建测试用例。它还解决了有关身份验证、难度级别、高对比度模式、谜题创意、错误报告、解决方案速度以及全球排行榜移除的常见问题。\n\n要点包括允许创建私人排行榜，强烈反对使用人工智能解决谜题，并要求不要复制或重新分发代码降临节的内容。谜题和相关的设计元素版权归代码降临节所有，但用户保留对其解决方案的所有权。本文档还鸣谢了 Beta 测试人员和社区管理者。"
  },
  {
    "id": "46113092",
    "title": "Instagram chief orders staff back to the office five days a week in 2026",
    "url": "https://www.businessinsider.com/instagram-chief-adam-mosseri-announces-five-day-office-return-2025-12",
    "summary": "The Business Insider article reports that the head of Instagram has mandated a return to the office for all staff five days a week, beginning in 2026. This marks a significant shift from the more flexible work policies embraced by many tech companies, including Meta (Instagram's parent company), after the COVID-19 pandemic. While the specific motivations behind the mandate weren't detailed in the article, the general implication is a push for increased in-person collaboration and a strengthening of company culture. The report emphasizes that this policy will not take effect until 2026, providing employees with ample time to adjust their personal and professional lives. This move could potentially impact employee morale and retention, as some may prefer or require remote work arrangements. The announcement places Instagram in contrast to some of its competitors who maintain hybrid or fully remote options, signaling a distinct leadership philosophy. The article underscores the growing debate within the tech industry surrounding the optimal balance between remote work and in-office presence.\n",
    "chinese_title": "Instagram负责人要求员工在2026年起每周五天返回办公室工作。",
    "chinese_summary": "据商业内幕报道，Instagram负责人已强制要求所有员工从2026年开始每周五天返回办公室工作。 这标志着与包括Meta（Instagram的母公司）在内的许多科技公司在新冠疫情后采取的更灵活的工作政策发生了重大转变。 虽然文章中没有详细说明这项指令的具体动机，但普遍的暗示是为了加强面对面的协作并巩固公司文化。 报告强调，这项政策要到2026年才会生效，这为员工调整个人和职业生活留出了充足的时间。 此举可能会影响员工士气和留任率，因为有些人可能更喜欢或需要远程工作安排。 该声明使Instagram与一些保持混合或完全远程办公的竞争对手形成对比，表明了一种独特的领导理念。 文章强调了科技行业内部关于远程工作和办公室办公之间的最佳平衡点日益激烈的辩论。"
  },
  {
    "id": "46072016",
    "title": "Cloud-Init on Raspberry Pi OS",
    "url": "https://www.raspberrypi.com/news/cloud-init-on-raspberry-pi-os/",
    "summary": "Okay, here's a summary based on my understanding of cloud-init and its typical use cases, assuming the linked article discusses its implementation on Raspberry Pi OS. If I'm incorrect about the article's content, I will be unable to refine this summary without accessing it.\n\n**Summary: Cloud-Init on Raspberry Pi OS (Assumed Content)**\n\nThe article likely announces the integration of cloud-init functionality into Raspberry Pi OS. Cloud-init is a widely used open-source package that allows users to customize and configure cloud instances (virtual machines, servers, and now Raspberry Pis) during their initial boot-up. This allows for automated provisioning and setup, streamlining the deployment process.\n\nKey benefits of cloud-init on Raspberry Pi OS include:\n\n*   **Automated Configuration:** Users can pre-configure settings like hostname, network configuration (static IP, DNS), user accounts, SSH keys, and package installations using configuration files (typically YAML). This eliminates the need for manual configuration after flashing the OS image.\n\n*   **Scalability and Reproducibility:** Cloud-init makes it easier to deploy multiple Raspberry Pis with consistent configurations. This is particularly valuable for managing fleets of devices for IoT applications, edge computing, or educational labs.\n\n*   **Cloud Compatibility:** By supporting cloud-init, Raspberry Pi OS becomes more compatible with cloud infrastructure environments and workflows. This allows developers to treat Raspberry Pis more like cloud instances, simplifying development and deployment pipelines.\n\n*   **Simplified Provisioning:** Users can create a single Raspberry Pi OS image and customize it dynamically with different configurations through cloud-init. This reduces the need for managing multiple custom images.\n\nThe article likely provides instructions on how to use cloud-init on Raspberry Pi OS, including how to create and apply cloud-init configuration files. It may also highlight specific use cases and examples of how cloud-init can simplify Raspberry Pi deployments.\n\n**Note:** This is a summary based on common cloud-init functionality and the assumption that the article covers its integration into Raspberry Pi OS. A more accurate summary would require direct access to the article.\n",
    "chinese_title": "树莓派操作系统上的Cloud-Init",
    "chinese_summary": "基于对cloud-init及其典型应用场景的理解，以下是摘要（假设链接文章讨论的是其在Raspberry Pi OS上的实现）。如果我对文章内容理解有误，我将无法在没有访问权限的情况下完善此摘要。\n\n**摘要：Raspberry Pi OS上的Cloud-Init（假定内容）**\n\n该文章可能宣布了cloud-init功能集成到Raspberry Pi OS中。 Cloud-init是一个广泛使用的开源软件包，允许用户在初始启动期间自定义和配置云实例（虚拟机、服务器，现在包括Raspberry Pi）。这实现了自动配置和设置，从而简化了部署过程。\n\nCloud-init在Raspberry Pi OS上的主要优点包括：\n\n*   **自动化配置：** 用户可以使用配置文件（通常是YAML）预配置诸如主机名、网络配置（静态IP、DNS）、用户帐户、SSH密钥和软件包安装等设置。这消除了刷写OS镜像后手动配置的需要。\n\n*   **可扩展性和可重复性：** Cloud-init使部署具有一致配置的多个Raspberry Pi变得更加容易。这对于管理物联网应用、边缘计算或教育实验室的设备群尤其有价值。\n\n*   **云兼容性：** 通过支持cloud-init，Raspberry Pi OS变得与云基础设施环境和工作流程更加兼容。这允许开发人员将Raspberry Pi更像云实例一样对待，从而简化了开发和部署管道。\n\n*   **简化配置：** 用户可以创建一个Raspberry Pi OS镜像，并通过cloud-init使用不同的配置对其进行动态自定义。这减少了管理多个自定义镜像的需求。\n\n该文章可能提供了如何在Raspberry Pi OS上使用cloud-init的说明，包括如何创建和应用cloud-init配置文件。它还可能突出显示特定用例和示例，说明cloud-init如何简化Raspberry Pi的部署。\n\n**注意：** 这是基于常见cloud-init功能以及文章涵盖其集成到Raspberry Pi OS的假设的摘要。更准确的摘要需要直接访问文章。"
  },
  {
    "id": "46111120",
    "title": "Durin is a library for reading and writing the Dwarf debugging format",
    "url": "https://github.com/tmcgilchrist/durin",
    "summary": "Durin is a library for reading and writing the DWARF debugging format, aiming to support DWARF 5 (and potentially older versions) for ELF and MachO object files, as well as assembly files. It offers cross-platform compatibility, avoiding assumptions about object file types. Its key features include lazy parsing, enabling iteration through compilation units without full content parsing and leveraging `DW_AT_sibling` references for efficient navigation.\n\nDurin can be installed via `opam install durin`. The library provides several example programs demonstrating its functionality, including: a .debug_info and .debug_line parser, dwarfdump and addr2line clones, a dwprod utility to list compilers used in compilation units, and a dwarf-validate clone for DWARF integrity checks.\n\nThe resource section provides useful links about Apple Compact Unwinding Format as well as links for vendor extensions from GCC.\n",
    "chinese_title": "Durin 是一个用于读写 Dwarf 调试格式的库。",
    "chinese_summary": "Durin 是一个用于读写 DWARF 调试格式的库，旨在支持 DWARF 5（以及可能更早的版本），适用于 ELF 和 MachO 目标文件以及汇编文件。它提供跨平台兼容性，避免对目标文件类型进行假设。其主要特性包括延迟解析，允许在不进行完整内容解析的情况下迭代编译单元，并利用 `DW_AT_sibling` 引用进行高效导航。\n\nDurin 可以通过 `opam install durin` 安装。该库提供了几个示例程序来演示其功能，包括：.debug_info 和 .debug_line 解析器、dwarfdump 和 addr2line 克隆、一个用于列出编译单元中使用编译器的 dwprod 实用程序，以及一个用于 DWARF 完整性检查的 dwarf-validate 克隆。\n\n资源部分提供了关于 Apple Compact Unwinding Format 的有用链接，以及来自 GCC 的供应商扩展的链接。"
  },
  {
    "id": "46054787",
    "title": "Stride Game Engine 4.3 with .NET 10 Support",
    "url": "https://www.stride3d.net/blog/announcing-stride-4-3-in-dotnet-10/",
    "summary": "Stride Game Engine 4.3 is released, featuring significant updates, including **.NET 10 and C# 14 support** for improved performance and cleaner code. Key additions include **Bepu Physics integration**, offering a fast, C#-based physics engine (though Bullet remains supported), and **Vulkan compute shader support**. The release also introduces **custom assets**, enabling user-defined data storage and more complex asset compilation.\n\nImprovements target **cross-platform build capabilities**, enabling projects to be built on Linux and Apple desktops, and a more efficient API for manipulating meshes is now available. The GameStudio now supports opening projects with **Rider and VSCode**. A new flexible processing system enables processing components by their interfaces, adding more type safety.\n\nOther enhancements encompass HDR rendering for D3d/Windows, user-defined gizmos, haptic feedback for VR, and API for OpenXR Passthrough. The release includes multiple fixes focusing on performance, Vulkan and OpenGL stability, Linux compatibility, and assembly reloading in the GameStudio.\n\nOngoing efforts for future versions (4.4+) include cross-platform building, a cross-platform GameStudio via Avalonia, shader compilation improvements, and further development of D3d12 and Vulkan support. The Stride team actively seeks skilled developers in C#, .NET, mobile, XR, rendering, and game development to contribute. Community involvement through code, promotion, and donations is encouraged.\n",
    "chinese_title": "Stride游戏引擎4.3，支持.NET 10",
    "chinese_summary": "Stride游戏引擎4.3发布，带来重大更新，包括**支持.NET 10和C# 14**以提升性能和代码简洁性。主要新增功能包括**集成Bepu Physics**，提供快速的、基于C#的物理引擎（但仍支持Bullet），以及**Vulkan计算着色器支持**。此版本还引入了**自定义资产**，支持用户定义的数据存储和更复杂的资产编译。\n\n改进的目标是**跨平台构建能力**，使项目能够在Linux和Apple桌面系统上构建，并且现在可以使用更高效的API来操作网格。GameStudio现在支持使用**Rider和VSCode**打开项目。新的灵活处理系统支持通过接口处理组件，从而提高了类型安全性。\n\n其他增强功能包括D3d/Windows的HDR渲染、用户定义的Gizmo、VR的触觉反馈以及OpenXR Passthrough的API。此版本包含多项修复，重点关注性能、Vulkan和OpenGL稳定性、Linux兼容性以及GameStudio中的程序集重新加载。\n\n未来版本（4.4+）的持续努力包括跨平台构建、通过Avalonia实现的跨平台GameStudio、着色器编译改进以及D3d12和Vulkan支持的进一步开发。Stride团队积极寻求在C#、.NET、移动、XR、渲染和游戏开发方面有技能的开发人员来贡献代码。鼓励社区通过代码、推广和捐赠参与。"
  },
  {
    "id": "46103376",
    "title": "Search tool that only returns content created before ChatGPT's public release",
    "url": "https://tegabrain.com/Slop-Evader",
    "summary": "The provided text describes a search tool designed to only return content created *before* the public release of ChatGPT. This is the central and defining feature of the tool. The text also presents a menu or navigation bar with the following options:\n\n*   **TEGA:** This could be the name of the tool or platform.\n*   **BRAINABOUTNEWSWORKCONTACT:** These appear to be links or sections within the platform, likely related to its functionality, about information, news, work, and contact options.\n*   **TEACHING:** This suggests the platform or tool may have educational applications or features.\n\nIn essence, the tool aims to provide a filtered search experience, specifically excluding content generated after the emergence of ChatGPT. This suggests a need to differentiate human-generated content from AI-generated content, potentially for research, historical analysis, or other applications where the origin and authenticity of information are critical. The presence of a \"Teaching\" section hints at potential use in academic contexts where understanding pre-AI information is important.\n",
    "chinese_title": "仅返回ChatGPT公开发布前内容的搜索工具",
    "chinese_summary": "该文本描述了一种搜索工具，其核心和决定性功能是仅返回在ChatGPT公开发布*之前*创建的内容。该文本还展示了一个菜单或导航栏，包含以下选项：\n\n*   **TEGA：** 这可能是工具或平台的名称。\n*   **BRAINABOUTNEWSWORKCONTACT：** 这些似乎是平台内的链接或版块，可能与其功能、关于信息、新闻、工作和联系方式相关。\n*   **TEACHING：** 这表明该平台或工具可能具有教育应用或功能。\n\n本质上，该工具旨在提供一种过滤后的搜索体验，专门排除ChatGPT出现后生成的内容。这表明需要区分人类生成的内容和人工智能生成的内容，可能用于研究、历史分析或信息来源和真实性至关重要的其他应用。 “教学”版块的存在暗示了其在学术背景下的潜在用途，在这种背景下，理解人工智能出现之前的信息至关重要。"
  },
  {
    "id": "46122011",
    "title": "OpenAI Declares 'Code Red' as Google Threatens AI Lead",
    "url": "https://www.wsj.com/tech/ai/openais-altman-declares-code-red-to-improve-chatgpt-as-google-threatens-ai-lead-7faf5ea6",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "OpenAI宣布“红色警戒”，因谷歌威胁其人工智能领导地位",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "46106186",
    "title": "1GB Raspberry Pi 5, and memory-driven price rises",
    "url": "https://www.raspberrypi.com/news/1gb-raspberry-pi-5-now-available-at-45-and-memory-driven-price-rises/",
    "summary": "Here's a summary of the Raspberry Pi article based on the title:\n\nThe Raspberry Pi Foundation is re-introducing a 1GB version of the Raspberry Pi 5, priced at $45. This brings back a lower-cost entry point for the Pi 5, appealing to budget-conscious users and applications where large amounts of RAM aren't necessary.\n\nHowever, the article also announces price increases for the 2GB, 4GB, and 8GB models of the Raspberry Pi 5. These price hikes are attributed to significantly increased memory costs. The Foundation states that memory prices have risen sharply, forcing them to adjust pricing to maintain the viability of producing the boards.\n\nEssentially, the article highlights both good news (the return of the 1GB model) and bad news (price increases due to memory costs). The return of the 1GB model provides a cheaper option for some users, while others will face higher prices for the higher memory capacity boards.\n",
    "chinese_title": "1GB 树莓派 5，以及内存驱动的价格上涨",
    "chinese_summary": "以下是基于标题对 Raspberry Pi 文章的总结：\n\n树莓派基金会重新推出 1GB 版本的 Raspberry Pi 5，定价 45 美元。这为 Pi 5 重新带来了一个低成本的入门点，吸引了预算有限的用户和不需要大量 RAM 的应用。\n\n然而，文章还宣布 Raspberry Pi 5 的 2GB、4GB 和 8GB 型号的价格上涨。这些价格上涨归因于内存成本的大幅增加。 基金会表示，内存价格大幅上涨，迫使他们调整定价以维持生产这些电路板的可行性。\n\n本质上，这篇文章强调了好消息（1GB 型号的回归）和坏消息（由于内存成本导致的价格上涨）。1GB 型号的回归为一些用户提供了一个更便宜的选择，而另一些用户将面临更高内存容量电路板的更高价格。"
  },
  {
    "id": "46106556",
    "title": "Why xor eax, eax?",
    "url": "https://xania.org/202512/01-xor-eax-eax",
    "summary": "This article, titled \"Why xor eax, eax?\", explains why compilers often use the `xor eax, eax` instruction to set the EAX register to zero instead of the more obvious `mov eax, 0`.\n\nThe primary reason is code size: `xor eax, eax` takes only two bytes, while `mov eax, 0` requires five. This byte saving is significant because setting registers to zero is a frequent operation. Smaller code leads to better instruction cache utilization and a smaller program overall.\n\nBeyond size, modern x86 CPUs optimize the `xor eax, eax` idiom. The CPU's out-of-order execution system recognizes that the new value of EAX doesn't depend on its previous value. Therefore, it allocates a fresh, dependency-free zero register and effectively removes the `xor` operation from the execution queue, resulting in zero execution cycles.\n\nThe article also points out that when using `xor eax, eax`, even though only the lower 32 bits are explicitly XORed, the x86 architecture automatically zeros the upper 32 bits, effectively setting the entire 64-bit RAX register to zero.  Finally it notes that compilers tend to use the 32-bit versions of XORing registers to zero even for extended registers, for reasons that are presumably compiler implementation specific.\n",
    "chinese_title": "为什么异或eax，eax？",
    "chinese_summary": "标题: \"为什么使用 xor eax, eax?\"\n\n本文解释了为什么编译器经常使用 `xor eax, eax` 指令将 EAX 寄存器清零，而不是更直观的 `mov eax, 0`。\n\n主要原因是代码大小：`xor eax, eax` 仅占用两个字节，而 `mov eax, 0` 需要五个字节。 这种字节节省非常重要，因为将寄存器清零是一种频繁的操作。 更小的代码带来更好的指令缓存利用率和更小的程序总体大小。\n\n除了大小之外，现代 x86 CPU 还会优化 `xor eax, eax` 这种用法。 CPU 的乱序执行系统识别出 EAX 的新值不依赖于其先前的值。 因此，它会分配一个全新的、无依赖的零寄存器，并有效地将 `xor` 操作从执行队列中移除，从而实现零执行周期。\n\n文章还指出，即使仅显式异或了低 32 位，x86 架构也会自动将高 32 位清零，从而有效地将整个 64 位 RAX 寄存器清零。 最后，文章指出，即使对于扩展寄存器，编译器也倾向于使用 32 位版本的 XOR 寄存器清零，原因可能与编译器实现有关。"
  },
  {
    "id": "46109534",
    "title": "A new AI winter is coming?",
    "url": "https://taranis.ie/llms-are-a-failure-a-new-ai-winter-is-coming/",
    "summary": "This article argues that a new \"AI winter\" is on the horizon, despite the initial excitement surrounding transformer-based AI models like ChatGPT. The author contends that while transformers overcame limitations of previous AI approaches by scaling through unsupervised learning and avoiding NP-completeness issues, they possess a fundamental, unsolvable flaw: their reliance on generating plausible-sounding output regardless of accuracy. This \"hallucination\" problem stems from the model's inherent design to generate tokens based on probability rather than true understanding, leading to frequent and often undetectable errors.\n\nThe author believes this is analogous to hitting an NP-completeness wall, where quick outputs are provided at the expense of correctness. This unreliability, with success rates ranging from 60% to 95%, makes transformers unsuitable for many practical applications, particularly those requiring high accuracy or where errors could have serious consequences (e.g., medicine, law enforcement). The article highlights the overestimation of AI's capabilities in the corporate world, drawing parallels to the dot-com bubble, and predicts a crash, with companies like OpenAI facing potential failure and AI investments being cut.\n\nThe author specifically criticizes the use of transformers in code generation, arguing that plausible but incorrect code can introduce dangerous bugs. While acknowledging that the technology won't disappear entirely, the article expects a contraction of the AI landscape, with only a few \"killer app\" use cases surviving, while many applications relying on unrealistic expectations of LLM performance will fail. The piece concludes with a warning to reduce exposure to the impending AI bubble crash, drawing on the author's personal experience with a failed chatbot company during the dot-com era.\n",
    "chinese_title": "新的人工智能寒冬要来了吗？",
    "chinese_summary": "尽管围绕ChatGPT等基于Transformer的AI模型的初期兴奋，本文认为一场新的“AI寒冬”即将到来。作者认为，虽然Transformer通过无监督学习扩展规模并避免了NP完全性问题，从而克服了先前AI方法的局限性，但它们存在一个根本且无法解决的缺陷：它们依赖于生成听起来貌似合理但与准确性无关的输出。这种“幻觉”问题源于模型固有的设计，即基于概率而非真正理解来生成tokens，从而导致频繁且通常无法检测到的错误。\n\n作者认为这类似于撞上了NP完全性的墙，即以牺牲正确性为代价来提供快速输出。这种不可靠性，成功率从60%到95%不等，使得Transformer不适用于许多实际应用，特别是那些需要高精度或错误可能导致严重后果的应用（例如，医学、执法）。本文强调了企业界对AI能力的高估，将其与互联网泡沫相提并论，并预测了一场崩溃，OpenAI等公司面临潜在的失败，AI投资将被削减。\n\n作者特别批评了Transformer在代码生成中的应用，认为貌似合理但不正确的代码可能会引入危险的错误。虽然承认该技术不会完全消失，但本文预计AI格局将会收缩，只有少数“杀手级应用”用例能够幸存，而许多依赖于对LLM性能不切实际期望的应用将会失败。文章最后警告要减少对即将到来的AI泡沫破裂的风险敞口，并借鉴了作者在互联网时代一家失败的聊天机器人公司的个人经历。"
  },
  {
    "id": "46120491",
    "title": "A theoretical upper limit for offshore wind energy extraction",
    "url": "https://www.cell.com/cell-reports-sustainability/fulltext/S2949-7906(25)00269-1",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "海上风能提取的理论上限",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "46122071",
    "title": "Is 2026 Next Year?",
    "url": "https://www.google.com/search?q=is+2026+next+year&oq=is+2026+next+year",
    "summary": "生成摘要时出错",
    "chinese_title": "Is 2026 Next Year?",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46080790",
    "title": "Forward compatibility and fault tolerance in TypeScript API Clients/SDKs",
    "url": "https://www.speakeasy.com/blog/typescript-forward-compatibility",
    "summary": "生成摘要时出错",
    "chinese_title": "Forward compatibility and fault tolerance in TypeScript API Clients/SDKs",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46121736",
    "title": "Jury trials scrapped for crimes with sentences of less than three years",
    "url": "https://www.bbc.co.uk/news/articles/cn5lxg2l0lqo",
    "summary": "生成摘要时出错",
    "chinese_title": "Jury trials scrapped for crimes with sentences of less than three years",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46113682",
    "title": "Mozilla's latest quagmire",
    "url": "https://rubenerd.com/mozillas-latest-quagmire/",
    "summary": "生成摘要时出错",
    "chinese_title": "Mozilla's latest quagmire",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46109080",
    "title": "ImAnim: Modern animation capabilities to ImGui applications",
    "url": "https://github.com/soufianekhiat/ImAnim",
    "summary": "生成摘要时出错",
    "chinese_title": "ImAnim: Modern animation capabilities to ImGui applications",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46045876",
    "title": "Historic Engineering Wonders: Photos That Reveal How They Pulled It Off",
    "url": "https://rarehistoricalphotos.com/engineering-methods-from-the-past/",
    "summary": "生成摘要时出错",
    "chinese_title": "Historic Engineering Wonders: Photos That Reveal How They Pulled It Off",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46110908",
    "title": "High-income job losses are cooling housing demand",
    "url": "https://jbrec.com/insights/job-growth-housing-demand-metro-analysis-2026/",
    "summary": "生成摘要时出错",
    "chinese_title": "High-income job losses are cooling housing demand",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46094037",
    "title": "AI just proved Erdos Problem #124",
    "url": "https://www.erdosproblems.com/forum/thread/124#post-1892",
    "summary": "生成摘要时出错",
    "chinese_title": "AI just proved Erdos Problem #124",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46110836",
    "title": "Response to \"Ruby Is Not a Serious Programming Language\"",
    "url": "https://robbyonrails.com/articles/2025/12/01/why-so-serious/",
    "summary": "生成摘要时出错",
    "chinese_title": "Response to \"Ruby Is Not a Serious Programming Language\"",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46117937",
    "title": "Show HN: Webclone.js – A simple tool to clone websites",
    "url": "https://github.com/jademsee/webclone",
    "summary": "生成摘要时出错",
    "chinese_title": "Show HN: Webclone.js – A simple tool to clone websites",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46115214",
    "title": "AI agents find $4.6M in blockchain smart contract exploits",
    "url": "https://red.anthropic.com/2025/smart-contracts/",
    "summary": "生成摘要时出错",
    "chinese_title": "AI agents find $4.6M in blockchain smart contract exploits",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46103097",
    "title": "X210Ai is a new motherboard to upgrade ThinkPad X201/200",
    "url": "https://www.tpart.net/about-x210ai/",
    "summary": "生成摘要时出错",
    "chinese_title": "X210Ai is a new motherboard to upgrade ThinkPad X201/200",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46103657",
    "title": "SmartTube Compromised",
    "url": "https://www.aftvnews.com/smarttubes-official-apk-was-compromised-with-malware-what-you-should-do-if-you-use-it/",
    "summary": "生成摘要时出错",
    "chinese_title": "SmartTube Compromised",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46117743",
    "title": "Decreasing Certificate Lifetimes to 45 Days",
    "url": "https://letsencrypt.org/2025/12/02/from-90-to-45",
    "summary": "生成摘要时出错",
    "chinese_title": "Decreasing Certificate Lifetimes to 45 Days",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46112640",
    "title": "Sycophancy is the first LLM \"dark pattern\"",
    "url": "https://www.seangoedecke.com/ai-sycophancy/",
    "summary": "生成摘要时出错",
    "chinese_title": "Sycophancy is the first LLM \"dark pattern\"",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46056232",
    "title": "Amazon faces FAA probe after delivery drone snaps internet cable in Texas",
    "url": "https://www.cnbc.com/2025/11/25/amazon-faa-probe-delivery-drone-incident-texas.html",
    "summary": "生成摘要时出错",
    "chinese_title": "Amazon faces FAA probe after delivery drone snaps internet cable in Texas",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46061390",
    "title": "Detection of triboelectric discharges during dust events on Mars",
    "url": "https://gizmodo.com/weve-detected-lightning-on-mars-for-the-first-time-2000691996",
    "summary": "生成摘要时出错",
    "chinese_title": "Detection of triboelectric discharges during dust events on Mars",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46115729",
    "title": "Around The World, Part 27: Planting trees",
    "url": "https://frozenfractal.com/blog/2025/11/28/around-the-world-27-planting-trees/",
    "summary": "生成摘要时出错",
    "chinese_title": "Around The World, Part 27: Planting trees",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46118249",
    "title": "Gitmal – a static pages generator for Git repos",
    "url": "https://github.com/antonmedv/gitmal",
    "summary": "生成摘要时出错",
    "chinese_title": "Gitmal – a static pages generator for Git repos",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46111284",
    "title": "Intel could return to Apple computers in 2027",
    "url": "https://www.theverge.com/news/832366/intel-apple-m-chip-low-end-processor",
    "summary": "生成摘要时出错",
    "chinese_title": "Intel could return to Apple computers in 2027",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46077637",
    "title": "Help, My Java Object Vanished (and the GC Is Not at Fault)",
    "url": "https://arraying.de/posts/markword/",
    "summary": "生成摘要时出错",
    "chinese_title": "Help, My Java Object Vanished (and the GC Is Not at Fault)",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46098838",
    "title": "Writing a good Claude.md",
    "url": "https://www.humanlayer.dev/blog/writing-a-good-claude-md",
    "summary": "生成摘要时出错",
    "chinese_title": "Writing a good Claude.md",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46114599",
    "title": "Last Week on My Mac: Losing confidence",
    "url": "https://eclecticlight.co/2025/11/30/last-week-on-my-mac-losing-confidence/",
    "summary": "生成摘要时出错",
    "chinese_title": "Last Week on My Mac: Losing confidence",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46122309",
    "title": "The era of AI slop cleanup has begun",
    "url": "https://www.reddit.com/r/ExperiencedDevs/s/3IFx9z462I",
    "summary": "生成摘要时出错",
    "chinese_title": "The era of AI slop cleanup has begun",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46113387",
    "title": "Pose-free 3D Gaussian splatting via shape-ray estimation",
    "url": "https://arxiv.org/abs/2505.22978",
    "summary": "生成摘要时出错",
    "chinese_title": "Pose-free 3D Gaussian splatting via shape-ray estimation",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46120830",
    "title": "The Rise of AI Denialism",
    "url": "https://bigthink.com/the-present/the-rise-of-ai-denialism/",
    "summary": "生成摘要时出错",
    "chinese_title": "The Rise of AI Denialism",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46120741",
    "title": "University of Pennsylvania confirms new data breach after Oracle hack",
    "url": "https://www.bleepingcomputer.com/news/security/university-of-pennsylvania-confirms-data-theft-after-oracle-ebs-hack/",
    "summary": "生成摘要时出错",
    "chinese_title": "University of Pennsylvania confirms new data breach after Oracle hack",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46116659",
    "title": "FreeBSD 15.0-Release Announcement",
    "url": "https://www.freebsd.org/releases/15.0R/announce/",
    "summary": "生成摘要时出错",
    "chinese_title": "FreeBSD 15.0-Release Announcement",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46097671",
    "title": "Langjam Gamejam: Build a programming language then make a game with it",
    "url": "https://langjamgamejam.com/",
    "summary": "生成摘要时出错",
    "chinese_title": "Langjam Gamejam: Build a programming language then make a game with it",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46100892",
    "title": "A Love Letter to FreeBSD",
    "url": "https://www.tara.sh/posts/2025/2025-11-25_freebsd_letter/",
    "summary": "生成摘要时出错",
    "chinese_title": "A Love Letter to FreeBSD",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46092387",
    "title": "A Bus Ride and the (At Least) 3x UX FAILs",
    "url": "https://bsdly.blogspot.com/2025/11/a-bus-ride-and-at-least-3x-ux-fails.html",
    "summary": "生成摘要时出错",
    "chinese_title": "A Bus Ride and the (At Least) 3x UX FAILs",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46109843",
    "title": "Show HN: RFC Hub",
    "url": "https://rfchub.app/",
    "summary": "生成摘要时出错",
    "chinese_title": "Show HN: RFC Hub",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46103532",
    "title": "Google Antigravity just deleted the contents of whole drive",
    "url": "https://old.reddit.com/r/google_antigravity/comments/1p82or6/google_antigravity_just_deleted_the_contents_of/",
    "summary": "生成摘要时出错",
    "chinese_title": "Google Antigravity just deleted the contents of whole drive",
    "chinese_summary": "生成摘要时出错"
  }
]