[
  {
    "id": "43630388",
    "title": "Hardening the Firefox Front End with Content Security Policies",
    "url": "https://attackanddefense.dev/2025/04/09/hardening-the-firefox-frontend-with-content-security-policies.html",
<<<<<<< Updated upstream
    "summary": "This article details efforts to harden the Firefox user interface against Cross-Site Scripting (XSS) and other injection attacks by leveraging Content Security Policies (CSPs).  The Firefox UI, built using web technologies like HTML, CSS, and JavaScript, is vulnerable to attacks similar to those targeting web applications.  A key vulnerability exploited in the Pwn2Own 2022 contest involved malicious inline event handlers in the Firefox UI.\n\nTo address this, developers have been systematically removing inline event handlers from the primary UI file, browser.xhtml. Over 600 inline event handlers have been rewritten, replacing them with event listeners defined in separate JavaScript files. This change is crucial because CSPs can then be implemented to restrict script execution, effectively blocking inline scripts unless explicitly allowed using 'unsafe-inline' (which, in this case, is being avoided).\n\nThe article highlights the progress made, showcasing a reduction in inline event handlers over time. It also provides guidance for developers on how to replace inline event handlers correctly, addressing nuances like `return false;` and `this` within event handlers.\n\nLooking ahead, the team plans to expand CSP implementation to other parts of the Firefox UI, including windows like the \"About Firefox\" dialog.  The ultimate goal is to completely block dynamic code execution (like `eval`) to create a more secure and resilient Firefox.  The recent changes significantly raise the bar for attackers, potentially breaking existing exploit chains. This work will be shipped with Firefox 138.\n",
    "chinese_title": "使用内容安全策略强化 Firefox 前端",
    "chinese_summary": "增强 Firefox 用户界面防御跨站脚本攻击的努力"
  },
  {
    "id": "43624220",
    "title": "Apache ECharts",
    "url": "https://echarts.apache.org/en/index.html",
    "summary": "This article introduces Apache ECharts, a declarative framework designed for quickly building web-based data visualizations. The core focus is on its ability to facilitate the rapid construction of interactive charts and graphs within web environments. The article highlights ECharts' utility by providing a framework that allows developers to create visually appealing and functional data representations.\n\nThe main takeaway is the recommendation to cite a specific research paper in all instances where ECharts is utilized. The provided information explicitly encourages citation in a wide range of contexts, including research projects, product development, publications, presentations, and educational activities. This citation serves as a formal acknowledgement of ECharts and its contribution to the field of web-based visualization. The cited paper is from Visual Informatics in 2018 and is available in PDF format.\n",
    "chinese_title": "Apache ECharts",
    "chinese_summary": "要求：\n1. 只提供一个准确的中文翻译\n2. 直接输出翻译，无需解释或多选项\n3. 保持原文的含义和风格\n4. 如果是标题，保持简洁明了\n\n原文：\n本文介绍了Apache ECharts，一个用于快速构建基于Web的数据可视化的声明式框架。其核心在于它能够在Web环境中快速构建交互式图表。文章通过提供一个框架来突出ECharts的实用性，该框架允许开发人员创建视觉上吸引人且功能强大的数据呈现。\n\n主要内容是建议在所有使用ECharts的情况下引用一篇特定的研究论文。所提供的信息明确鼓励在各种情况下进行引用，包括研究项目、产品开发、出版物、演示和教育活动。这种引用是对ECharts及其对基于Web的视觉化领域贡献的正式认可。被引论文发表于2018年的《视觉信息学》，并以PDF格式提供。"
  },
  {
    "id": "43629307",
    "title": "The best programmers I know",
    "url": "https://endler.dev/2025/best-programmers/",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "我所认识的最优秀的程序员",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "43627646",
    "title": "PostgreSQL Full-Text Search: Fast When Done Right (Debunking the Slow Myth)",
    "url": "https://blog.vectorchord.ai/postgresql-full-text-search-fast-when-done-right-debunking-the-slow-myth",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "PostgreSQL 全文搜索：正确使用时速度快（揭穿“慢”的谬论）",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "43629887",
    "title": "'Sun-Like' Stars",
    "url": "https://www.centauri-dreams.org/2025/04/08/on-sun-like-stars/",
    "summary": "This article discusses the ambiguity surrounding the term \"Sun-like\" when applied to stars in exoplanetary science. Author Paul Gilster highlights the confusion that arises as the definition of \"Sun-like\" shifts depending on the context, particularly when communicating scientific findings to the public.\n\nThe core issue revolves around whether \"Sun-like\" refers strictly to G-class stars (like our Sun), or if it encompasses a broader range of stars, including K-class and even F-class stars. Gilster explains that while the Sun (G-class) has a well-defined lifetime and temperature range, the term is often expanded to include stars with slightly different masses and temperatures. Some scientists even broaden the definition to include FGK-type stars, while others consider all main-sequence stars.\n\nThe article emphasizes the importance of clear terminology, especially in news releases and public communication, as different definitions drastically affect estimations of how many stars might have Earth-like planets. For instance, if \"Sun-like\" is defined as only G-class stars, a statement like \"one Earth-class planet around every Sun-like star\" would mean only about 7% of the stars in the Milky Way. Including FGK stars, it could be 22%, and even more if including red dwarfs.\n\nThe author stresses the need for exoplanet researchers to be precise with their language to avoid misleading the public, which can influence funding and support for scientific endeavors. The article also touches upon the related ambiguity of the term \"Earth-like\" and the challenges in finding habitable worlds, and the comments echo the article's concern with definitions.\n",
    "chinese_title": "类似太阳的恒星",
    "chinese_summary": "要求：\n1. 只提供一个准确的中文翻译\n2. 直接输出翻译结果，无需解释或多个选项\n3. 保持原文的含义和风格\n4. 如果是标题，保持简洁清晰\n\n原文翻译：\n“类太阳”恒星的定义模糊性"
  },
  {
    "id": "43625474",
    "title": "Obituary for Cyc",
    "url": "https://yuxi-liu-wired.github.io/essays/posts/cyc/",
    "summary": "This article serves as an obituary for the Cyc project, Douglas Lenat's ambitious 40-year endeavor to build artificial general intelligence (AGI) based on symbolic logic and common sense knowledge. The core idea was to create a massive knowledge base of facts and rules, the \"knowledge pump,\" which would then enable machine learning and autonomous scientific discovery.  Despite significant investment ($200 million, 2,000 person-years), Cyc never achieved its goal.\n\nThe article traces Lenat's journey, starting with his PhD work on automated mathematical discovery with the Automated Mathematician (AM) and EURISKO. These systems, though demonstrating initial promise, suffered from intellectual exhaustion, leading Lenat to believe in the need for a comprehensive knowledge base. Cyc, launched in 1985, was designed to be that knowledge base.\n\nThe article highlights Cyc's failure in the context of its commercial applications and a historical overview of AI. Cyc, despite its significant size, primarily found uses in expert systems and data integration, performing similarly to established corporations. The project was academically insular, facing difficulties in external use and benchmark performance.  The secretive nature of Cyc, coupled with Lenat's consistent rejection of alternative AI approaches, contributed to its isolation.  As of 2025, Cyc had not achieved general intelligence, leading the article to declare it a significant setback for the symbolic-logical approach to AI. The obituary also briefly discusses Lenat's AM project, providing more details on the background and context of his work on automated discovery, as well as some of the key problems associated with this approach.\n",
    "chinese_title": "Cyc 讣告",
    "chinese_summary": "要求：\n1. 只提供一个准确的中文翻译\n2. 直接输出翻译结果，无需解释或多个选项\n3. 保持原文的含义和风格\n4. 如果是标题，保持简洁明了\n\n原文：\n这篇文章是针对Cyc项目的讣告，Cyc是道格拉斯·莱纳特雄心勃勃的、历时40年的项目，旨在基于符号逻辑和常识知识构建通用人工智能（AGI）。其核心思想是创建一个庞大的事实和规则知识库，即“知识泵”，从而实现机器学习和自主科学发现。尽管投入巨大（2亿美元，2000人年），Cyc从未实现其目标。\n\n文章追溯了莱纳特的历程，始于他在自动化数学家（AM）和EURISKO方面的博士研究。这些系统虽然最初展现了前景，但最终陷入了智力枯竭，这促使莱纳特相信需要一个全面的知识库。Cyc于1985年启动，旨在成为那个知识库。\n\n文章在商业应用和人工智能历史概述的背景下，重点介绍了Cyc的失败。尽管Cyc规模庞大，但主要用于专家系统和数据集成，其表现与 established 公司类似。该项目在学术上相对孤立，难以进行外部使用和基准测试。Cyc的保密性，加上莱纳特始终拒绝其他人工智能方法，助长了其孤立。截至2025年，Cyc尚未实现通用智能，因此文章宣布其为符号逻辑人工智能方法的一个重大挫折。这篇讣告还简要讨论了莱纳特的AM项目，提供了关于其在自动化发现方面工作的背景和更多细节，以及与这种方法相关的一些关键问题。"
  },
  {
    "id": "43627758",
    "title": "Show HN: DrawDB – open-source online database diagram editor (a retro)",
    "url": "https://www.drawdb.app/",
    "summary": "This Show HN post announces **DrawDB**, an open-source online database diagram editor and SQL generator. The core functionality of DrawDB revolves around enabling users to visually design database schemas, likely through a drag-and-drop interface for creating tables, defining relationships, and specifying data types. The tool then generates SQL scripts from these diagrams, streamlining the database creation process.\n\nThe post is likely very simple, primarily acting as an introduction and announcement. The provided content emphasizes the accessibility of DrawDB by highlighting it as an online application requiring JavaScript. The mention of SQL generation suggests that DrawDB aims to be a practical tool for developers, simplifying database schema design and deployment. It is implied the interface itself is user-friendly given that it’s a diagram editor.\n",
    "chinese_title": "Show HN：DrawDB – 开源在线数据库图表编辑器（复古）",
    "chinese_summary": "**DrawDB 介绍**\n\nDrawDB 是一款开源的在线数据库图表编辑器和 SQL 生成器。其核心功能是让用户能够直观地设计数据库模式，很可能通过拖放界面来创建表、定义关系和指定数据类型。然后，该工具会从这些图表中生成 SQL 脚本，简化数据库创建过程。\n\n该帖子很可能非常简单，主要起到介绍和发布的作用。内容强调了 DrawDB 的易用性，将其定位为需要 JavaScript 的在线应用程序。提到 SQL 生成表明 DrawDB 旨在成为开发人员的实用工具，简化数据库模式设计和部署。鉴于它是一个图表编辑器，界面本身暗示是用户友好的。"
  },
  {
    "id": "43620279",
    "title": "Brazil's government-run payments system has become dominant",
    "url": "https://www.economist.com/the-americas/2025/04/03/brazils-government-run-payments-system-has-become-dominant",
    "summary": "Brazil's government-run digital payment system, Pix, has rapidly become the dominant payment method in the country. Launched in November 2020 by the Central Bank of Brazil (BCB) amidst the COVID-19 pandemic, Pix offered instantaneous, free, and easy-to-use transactions, utilizing national ID numbers, phone numbers, or QR codes for money transfers.\n\nIts popularity surged, eclipsing both cash and card payments by 2024. The volume of transactions skyrocketed from 9 billion in 2021 to 63 billion in 2024, with a total value of 26 trillion reais ($4.5 trillion) moved. This rapid adoption rate is unprecedented globally. The article suggests that while Pix has revitalized Brazil's banking sector, it also raises concerns about the central bank's growing influence.\n",
    "chinese_title": "巴西政府运营的支付系统已占据主导地位",
    "chinese_summary": "巴西政府运营的数字支付系统Pix迅速成为该国主要的支付方式。该系统由巴西中央银行（BCB）于2020年11月，即新冠疫情期间推出，提供即时、免费且易于使用的交易，通过使用国家身份证号码、电话号码或二维码进行转账。\n\n到2024年，其受欢迎程度飙升，超越了现金和刷卡支付。交易量从2021年的90亿笔猛增至2024年的630亿笔，总价值达26万亿雷亚尔（4.5万亿美元）。这种快速采用率在全球范围内前所未有。文章指出，虽然Pix振兴了巴西的银行业，但也引发了对中央银行日益增长的影响力的担忧。"
  },
  {
    "id": "43597264",
    "title": "Linux Kernel Defence Map – Security Hardening Concepts",
    "url": "https://github.com/a13xp0p0v/linux-kernel-defence-map",
    "summary": "This article introduces the \"Linux Kernel Defence Map,\" a graphical representation designed to help navigate the complex world of Linux kernel security hardening. Created by a13xp0p0v, the map visualizes relationships between vulnerability classes, exploitation techniques, bug detection mechanisms, and defense technologies, including those built into the kernel and those that are out-of-tree or hardware-dependent. The map includes Common Weakness Enumeration (CWE) numbers for vulnerability classes.\n\nThe map, written in the DOT language, is intended to aid in understanding kernel security documentation and source code. It is available on GitHub, Codeberg, and GitFlic. The article also mentions a kernel-hardening-checker tool, also created by the author, that automatically checks kernel security configuration settings.\n\nThe map focuses on kernel security hardening and doesn't cover attack surface reduction, userspace security, or Linux Security Modules (LSM). The article provides links to relevant resources such as \"Grsecurity features,\" the State of Kernel Self Protection, and a few other references for further reading on the subject. The map is for Linux kernel v6.10.\n",
    "chinese_title": "Linux内核防御地图 – 安全强化概念",
    "chinese_summary": "Linux 内核防御地图"
  },
  {
    "id": "43620141",
    "title": "Tailscale has raised $160M",
    "url": "https://tailscale.com/blog/series-c",
    "summary": "Tailscale, a networking company, has secured $160 million USD ($230 million CAD) in its Series C funding round, led by Accel with participation from CRV, Insight Partners, Heavybit, and Uncork Capital. This round also includes existing angel investor George Kurtz (CEO of Crowdstrike) and new investor Anthony Casalena (CEO of Squarespace).\n\nThe article explains that this funding will be used to accelerate Tailscale's growth and expand its focus on \"identity-first networking,\" a concept that prioritizes user identity over IP addresses for secure connections. This approach aims to simplify networking and address the limitations of traditional methods like VPNs and firewalls.\n\nTailscale aims to make networking easier, allowing users to securely connect to their applications, teammates, and services without the complexities of traditional network configurations. They are targeting markets like AI infrastructure, where companies face challenges connecting GPUs and securing workloads across different cloud environments. Leading AI companies such as Perplexity, Mistral, and Cohere are already using Tailscale. Other companies like Instacart, SAP, and Duolingo are also leveraging the platform.\n\nThe investment will be used to expand engineering and product teams, further improve free support for free customers, and maintain backward compatibility. Tailscale's goal is to simplify networking for everyone, from startups to Fortune 500 companies and even individual users.\n",
    "chinese_title": "Tailscale 融资 1.6 亿美元",
    "chinese_summary": "需求：\n1. 仅提供一个准确的中文翻译\n2. 直接输出翻译结果，无需解释或多个选项\n3. 保持原文含义和风格\n4. 如为标题，保持简洁明了\n\n原文：\n\nTailscale，一家网络公司，在C轮融资中获得了1.6亿美元美元（2.3亿美元加元），该轮融资由Accel领投，CRV、Insight Partners、Heavybit和Uncork Capital参投。本轮融资还包括现有天使投资人George Kurtz（Crowdstrike首席执行官）和新投资人Anthony Casalena（Squarespace首席执行官）。\n\n文章解释说，这笔资金将用于加速Tailscale的增长，并扩大其对“身份优先网络”的关注，这一概念优先考虑用户身份而非IP地址以实现安全连接。这种方法旨在简化网络，并解决传统方法（如VPN和防火墙）的局限性。\n\nTailscale的目标是简化网络，允许用户安全地连接到他们的应用程序、团队成员和服务，而无需传统网络配置的复杂性。他们正在瞄准人工智能基础设施等市场，这些市场的公司面临着连接GPU和保护跨不同云环境工作负载的挑战。Perplexity、Mistral和Cohere等领先的人工智能公司已经在使用Tailscale。Instacart、SAP和Duolingo等其他公司也在利用该平台。\n\n这笔投资将用于扩大工程和产品团队，进一步改进对免费客户的免费支持，并保持向后兼容性。Tailscale的目标是简化所有人的网络，从初创公司到财富500强公司，甚至个人用户。"
=======
    "summary": "This article details Firefox's efforts to harden its user interface (UI) against injection attacks, particularly Cross-Site Scripting (XSS) vulnerabilities. The Firefox UI, built with web technologies like HTML, CSS, and JavaScript, is susceptible to these attacks, just like regular web applications. To mitigate this, Firefox is implementing Content Security Policies (CSPs) to restrict script execution.\n\nThe primary focus is on the `browser.xhtml` file, the core of the Firefox UI. The development team has already removed over 600 inline event handlers from this file by replacing them with event listeners defined in separate JavaScript files, effectively blocking potential XSS exploits that rely on inline script execution. The process involves identifying and replacing inline event handlers (e.g., `<button onclick=\"...\">`) with `addEventListener` calls in external JavaScript files. The article highlights important nuances to consider when making this change, specifically the use of `event.preventDefault()` and the behavior of `this` within inline event handlers.\n\nLooking ahead, Firefox plans to extend CSP implementation to other UI elements and even more restrictive policies to block dynamic code execution entirely. This strategy significantly strengthens Firefox's security posture, raising the barrier for attackers and potentially breaking existing exploit chains. The mitigation for the changes made to the browser.xhtml file will be shipped with Firefox 138.\n",
    "chinese_title": "使用内容安全策略强化 Firefox 前端",
    "chinese_summary": "要求：\n1. 只提供一个准确的中文翻译\n2. 直接输出翻译结果，无需解释或多选项\n3. 保持原文的含义和风格\n4. 如果是标题，保持简洁清晰\n\n原文：\n\n本文详述了 Firefox 为增强其用户界面 (UI) 以抵御注入攻击，特别是跨站点脚本 (XSS) 漏洞所做的努力。Firefox 的用户界面使用 HTML、CSS 和 JavaScript 等 Web 技术构建，因此和普通 Web 应用程序一样容易受到这些攻击。为了缓解这一问题，Firefox 正在实施内容安全策略 (CSP) 以限制脚本执行。\n\n主要关注点是 `browser.xhtml` 文件，它是 Firefox 用户界面的核心。开发团队已经从该文件中移除了 600 多个内联事件处理程序，用在单独的 JavaScript 文件中定义的事件监听器代替它们，从而有效地阻止了依赖内联脚本执行的潜在 XSS 漏洞利用。该过程涉及识别和替换内联事件处理程序（例如，`<button onclick=\"...\">`）为外部 JavaScript 文件中的 `addEventListener` 调用。本文重点介绍了进行此更改时需要考虑的重要细节，特别是 `event.preventDefault()` 的使用以及 `this` 在内联事件处理程序中的行为。\n\n展望未来，Firefox 计划将 CSP 实施扩展到其他 UI 元素，甚至采用更严格的策略来完全阻止动态代码执行。这项策略显著增强了 Firefox 的安全态势，提高了攻击者的门槛，并可能破坏现有的漏洞利用链。对 browser.xhtml 文件所做的更改的缓解措施将随 Firefox 138 一起发布。"
>>>>>>> Stashed changes
  }
]