[
  {
    "id": "45900425",
    "title": "Show HN: I built a synth for my daughter",
    "url": "https://bitsnpieces.dev/posts/a-synth-for-my-daughter/",
    "summary": "This \"Show HN\" post details a maker's journey in building a portable, step-sequencer synthesizer for his daughter's third birthday. Inspired by her fascination with switches and knobs on a Montessori board, he aimed to create a tactile and creative music toy.\n\nHe started with an Arduino Inventors Kit and worked his way through building a basic MIDI controller on a breadboard. He then integrated a SAM2695 synth module and a small OLED screen for visual feedback, including a dancing panda. Development was aided by the Wokwi microcontroller simulator.\n\nFacing challenges with available enclosures, he learned CAD and 3D-printed a custom enclosure. He initially hand-wired the circuit on a solderable breadboard but moved to designing a custom PCB using Fusion 360 after experiencing fragility issues. He addressed power supply problems by switching to a three-battery setup with an Adafruit Miniboost.\n\nThe final synth has four sliders controlling notes in a looping sequence, tempo/volume/scale/pitch controls, and a custom enclosure. The daughter enjoys using it, and the creator notes areas for improvement, like screen lag, and plans to upgrade to an ESP32.\n\nHe contemplates the potential of turning the project into a real product, acknowledging regulatory, financial, and manufacturing hurdles. He's considering open-sourcing the design for makers or launching a Kickstarter campaign and seeks advice from those with experience in small-run hardware production.\n",
    "chinese_title": "展示一下：我为女儿做了一个合成器",
    "chinese_summary": "这个“Show HN”帖子详细讲述了一位创客为女儿三岁生日制作便携式步进音序合成器的过程。受女儿对蒙特梭利板上的开关和旋钮的喜爱启发，他旨在创造一个触觉和创造性的音乐玩具。\n\n他从Arduino Inventors Kit开始，逐步在面包板上构建了一个基本的MIDI控制器。然后，他集成了一个SAM2695合成器模块和一个用于视觉反馈的小型OLED屏幕，包括一只跳舞的熊猫。开发过程得到了Wokwi微控制器模拟器的帮助。\n\n面对现有外壳的挑战，他学习了CAD并3D打印了一个定制外壳。最初，他在可焊接面包板上手工接线电路，但在遇到脆弱性问题后，转而使用Fusion 360设计定制PCB。他通过切换到带有Adafruit Miniboost的三节电池设置来解决了电源问题。\n\n最终的合成器有四个滑块控制循环序列中的音符，节奏/音量/音阶/音高控制，以及一个定制外壳。女儿喜欢使用它，创作者注意到了一些需要改进的地方，例如屏幕延迟，并计划升级到ESP32。\n\n他正在考虑将该项目转化为真正的产品的潜力，但也承认存在监管、财务和制造方面的障碍。他正在考虑开源设计供创客使用，或者发起Kickstarter活动，并向有小型硬件生产经验的人寻求建议。"
  },
  {
    "id": "45954560",
    "title": "Google is killing the open web, part 2",
    "url": "https://wok.oblomov.eu/tecnologia/google-killing-open-web-2/",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "谷歌正在扼杀开放网络，第二部分",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "45953702",
    "title": "Replicate is joining Cloudflare",
    "url": "https://replicate.com/blog/replicate-cloudflare",
    "summary": "Replicate, a platform for sharing and running AI models via API, is joining Cloudflare. According to the announcement, Replicate will operate as a distinct brand but benefit from Cloudflare's resources and faster infrastructure. The existing API and deployed models will continue to function as before.\n\nThe acquisition is driven by a shared vision of building the fundamental infrastructure for AI applications. Replicate's work in defining standards for models (with Cog) and creating a platform for their deployment are seen as foundational primitives, similar to a distributed operating system for AI in the cloud. Cloudflare's robust network, including offerings like Workers, Durable Objects, and R2, are seen as complementary components for this AI infrastructure.\n\nThe goal is to build higher-level AI abstractions, facilitating model orchestration, real-time inference, and edge deployment. Replicate chose Cloudflare because of its developer-centric approach and success in building a strong enterprise business. Just as Cloudflare is the default for web app development, the combined forces aim to become the default platform for building AI applications.\n",
    "chinese_title": "Replicate 加入 Cloudflare",
    "chinese_summary": "Replicate，一个通过API分享和运行AI模型的平台，将加入Cloudflare。根据公告，Replicate将作为一个独立的品牌运营，但会受益于Cloudflare的资源和更快的基础设施。现有的API和已部署的模型将继续像以前一样运行。\n\n此次收购是受构建AI应用的基础设施的共同愿景驱动。Replicate在定义模型标准（使用Cog）和创建模型部署平台方面的工作被视为基础原语，类似于云中AI的分布式操作系统。Cloudflare强大的网络，包括Workers、Durable Objects和R2等产品，被视为AI基础设施的互补组件。\n\n目标是构建更高层次的AI抽象，促进模型编排、实时推理和边缘部署。Replicate选择Cloudflare是因为其以开发者为中心的方法以及在构建强大的企业业务方面的成功。正如Cloudflare是Web应用程序开发的默认选择一样，两者的结合旨在成为构建AI应用程序的默认平台。"
  },
  {
    "id": "45953452",
    "title": "FreeMDU: Open-source Miele appliance diagnostic tools",
    "url": "https://github.com/medusalix/FreeMDU",
    "summary": "FreeMDU is an open-source project providing hardware and software tools for communicating with Miele appliances via their optical diagnostic interface, offering an alternative to Miele's proprietary MDU software. This interface, present in most Miele devices since 1996, allows for diagnostics and home automation integration.\n\nThe project consists of three main components: a protocol library, a terminal-based user interface (TUI) for diagnostics and testing, and firmware for a communication adapter that integrates with Home Assistant via MQTT.\n\nWhile the project is experimental and carries the risk of damaging appliances if misused, it currently supports several appliance/board combinations, identified by their software ID. The article provides a table listing supported combinations. Adding support for new devices involves determining the software ID.\n\nTo get started, users need the Rust toolchain installed and a built communication adapter. Depending on the use case, users can flash the adapter with the \"home\" firmware in either bridge or standalone mode for device diagnostics/testing, home automation integration, or custom tool development. The TUI application is used for diagnostics and testing, while the protocol crate can be used to implement custom software.\n\nFreeMDU is an independent project not affiliated with Miele and is licensed under the Apache 2.0 or MIT license. Contributions are welcome and will be dual-licensed under the same terms.\n",
    "chinese_title": "FreeMDU：开源Miele电器诊断工具",
    "chinese_summary": "FreeMDU：通过光学诊断接口与Miele电器通信的开源软硬件工具"
  },
  {
    "id": "45954640",
    "title": "Project Gemini",
    "url": "https://geminiprotocol.net/",
    "summary": "Project Gemini is presented as a new internet technology aiming to create a lightweight online space for interconnected text documents, prioritizing reader privacy, attention, and bandwidth. It's described as a timeless concept, not necessarily innovative or disruptive, but rather offering respite from the perceived over-disruption of the internet. Gemini's focus is on documents being simply documents, not aiming to change the world or destroy existing technologies. The text encourages readers to explore the official resources, including the FAQ, a video overview, news, documentation, history, and known software related to the project. Finally, it states that all content on geminiprotocol.net is CC BY-NC-ND 4.0 licensed.\n",
    "chinese_title": "双子座计划",
    "chinese_summary": "双子星计划旨在创建轻量级在线空间，用于互联文本文档，优先考虑读者隐私、注意力和带宽。 它被描述为一个永恒的概念，不一定是创新或颠覆性的，而是从互联网过度颠覆中提供喘息之机。 Gemini的重点是文档就是文档，不旨在改变世界或破坏现有技术。 该文本鼓励读者探索官方资源，包括常见问题解答、视频概述、新闻、文档、历史记录和与该项目相关的已知软件。 最后，它声明 geminiprotocol.net 上的所有内容均已获得 CC BY-NC-ND 4.0 许可。"
  },
  {
    "id": "45954626",
    "title": "WBlock: A New Ad-Blocker for Safari",
    "url": "https://github.com/0xCUB3/wBlock",
    "summary": "WBlock is a new, free, and open-source Safari ad-blocker for macOS, iOS, and iPadOS. It utilizes Safari's declarative content blocking API for efficient performance, boasting a ~40MB RAM footprint at idle. It uses Protocol Buffers and LZ4 compression for storage.\n\nKey features include a 750,000 rule capacity across five Safari extensions, support for AdGuard-syntax custom filter lists, and a userscript engine implementing the Greasemonkey API. Users can also use an Element Zapper feature for manual element removal (macOS only).\n\nWBlock offers comprehensive blocking capabilities including network request blocking, cookie and local storage filtering, CSS injection, script blocking, and pop-up/redirect prevention. Users can configure auto-update intervals, manage whitelists, and utilize regional filter support.\n\nThe technical architecture emphasizes performance with asynchronous I/O, streaming serialization, and adherence to web standards. It also uses `SafariConverterLib` and `AdGuard Scriptlets` for rule conversion and advanced blocking.\n\nThe FAQ addresses common concerns, emphasizing wBlock's performance benefits, custom filter list support, userscript functionality on iOS, configurable update frequency, and comparison to other ad blockers like uBlock Origin Lite, AdGuard, and Wipr.\n",
    "chinese_title": "WBlock：一款Safari的新广告拦截器",
    "chinese_summary": "WBlock：一款适用于macOS、iOS和iPadOS的全新免费开源Safari广告拦截器。它利用Safari的声明式内容拦截API实现高效性能，空闲时仅占用约40MB内存。它使用Protocol Buffers和LZ4压缩进行存储。\n\n主要功能包括五个Safari扩展中75万条规则容量、支持AdGuard语法的自定义过滤规则列表，以及实现Greasemonkey API的用户脚本引擎。用户还可以使用元素移除功能手动删除元素（仅限macOS）。\n\nWBlock提供全面的拦截功能，包括网络请求拦截、Cookie和本地存储过滤、CSS注入、脚本拦截以及弹窗/重定向阻止。用户可以配置自动更新间隔、管理白名单并使用区域过滤支持。\n\n技术架构强调性能，采用异步I/O、流式序列化并遵循Web标准。它还使用`SafariConverterLib`和`AdGuard Scriptlets`进行规则转换和高级拦截。\n\n常见问题解答涵盖了常见问题，重点介绍了WBlock的性能优势、自定义过滤规则列表支持、iOS上的用户脚本功能、可配置的更新频率以及与其他广告拦截器（如uBlock Origin Lite、AdGuard和Wipr）的比较。"
  },
  {
    "id": "45796932",
    "title": "Celtic Code: Drawing Knots with Python",
    "url": "https://2earth.github.io/website/20250202.html",
    "summary": "This article, \"Celtic Code: Drawing Knots with Python,\" details Tom Ruddell's project to create a web app that programmatically generates Celtic knots using Python. It begins with a brief overview of the Celtic people, their history, and the significance of knots in their culture, noting the utility and symbolic meaning of knots across various societies and time periods.\n\nThe core of the article then shifts to the technical process of coding the knot generator. Ruddell outlines the steps involved, starting with creating a grid (tile and barrier arrays) to define the knot's structure. He explains how barriers are placed to guide the knot's path and how the number of adjacent barriers is used to determine each tile's type (corner, straight, bend, diagonal). Using a compass system, the program calculates entry and exit directions for each tile. A key challenge is placing bend tiles, which involves determining their handedness and using lookup tables to find the correct entry/exit points.\n\nFinally, the program draws the graphic using the Pillow library, creating line strokes for a visual effect. The program identifies crossing points and applies \"over-crossings\" to create the characteristic interwoven appearance of Celtic knots, drawing each \"over\" section twice. While acknowledging limitations in the method, the author highlights its simplicity and effectiveness. The article provides links to the web app and source code.\n",
    "chinese_title": "凯尔特密码：用Python绘制结",
    "chinese_summary": "本文“凯尔特密码：用Python绘制绳结”详细介绍了Tom Ruddell的项目，该项目旨在创建一个用Python以编程方式生成凯尔特绳结的Web应用程序。文章首先简要概述了凯尔特民族、他们的历史以及绳结在其文化中的重要性，并指出绳结在不同社会和时期的实用性和象征意义。\n\n文章的核心随后转向绳结生成器的编码技术过程。Ruddell概述了所涉及的步骤，首先创建网格（瓦片和屏障数组）以定义绳结的结构。他解释了如何放置屏障以引导绳结的路径，以及如何使用相邻屏障的数量来确定每个瓦片的类型（角、直、弯曲、对角）。程序使用罗盘系统计算每个瓦片的入口和出口方向。一个关键的挑战是放置弯曲瓦片，这涉及到确定它们的手性，并使用查找表来找到正确的入口/出口点。\n\n最后，程序使用Pillow库绘制图形，创建线条笔触以产生视觉效果。程序识别交叉点并应用“上跨”，以创建凯尔特绳结特有的交织外观，每个“上跨”部分绘制两次。作者在承认该方法存在局限性的同时，强调了它的简单性和有效性。文章提供了Web应用程序和源代码的链接。"
  },
  {
    "id": "45952824",
    "title": "Ned: ImGui Text Editor with GL Shaders",
    "url": "https://github.com/nealmick/ned",
    "summary": "Ned is a retro-style, feature-rich text editor built with Dear ImGui, designed for both standalone use and embedding in other ImGui applications. It boasts OpenGL shader effects for visual customization, including static noise, burn-in, screen curvature, bloom, and vignetting, with themes like Amber and Solarized.\n\nKey features include Tree Sitter syntax highlighting for over 15 languages, LSP integration for advanced language support (clangd, gopls, pyright, TypeScript), a terminal emulator based on suckless st.c, and optional custom lexers. Ned supports multi-cursor editing, text bookmarks, and Copilot-like autocomplete via OpenRouter, utilizing various LLMs. A unique \"rainbow mode\" cursor aids visibility.\n\nThe project is available for macOS (Intel/ARM), Windows x64, and Debian. Windows support is still under testing. Build instructions are provided for each platform, including dependency management. Ned can be embedded into other ImGui applications using the ned_embed library, adding file exploration, a terminal, emoji support, themes, and other features.\n\nNed also has an AI agent leveraging OpenRouter and a specialized model (Morph) for fast and accurate code edits, and supports multi-cursor functionality for efficient text manipulation.\n",
    "chinese_title": "Ned：带GL Shader的ImGui文本编辑器",
    "chinese_summary": "Ned：一款复古风格、功能丰富的文本编辑器，使用Dear ImGui构建，既可独立使用，也可嵌入到其他ImGui应用程序中。它拥有用于视觉定制的OpenGL着色器效果，包括静态噪声、烧录、屏幕曲率、辉光和渐晕，并提供Amber和Solarized等主题。\n\n主要功能包括支持超过15种语言的Tree Sitter语法高亮、用于高级语言支持的LSP集成（clangd、gopls、pyright、TypeScript）、基于suckless st.c的终端模拟器，以及可选的自定义词法分析器。Ned支持多光标编辑、文本书签，以及通过OpenRouter实现的类似Copilot的自动补全，利用各种LLM。独特的“彩虹模式”光标有助于提高可见性。\n\n该项目适用于macOS（Intel/ARM）、Windows x64和Debian。Windows支持仍在测试中。提供了针对每个平台的构建说明，包括依赖管理。Ned可以使用ned_embed库嵌入到其他ImGui应用程序中，从而添加文件浏览、终端、表情符号支持、主题和其他功能。\n\nNed还拥有一个利用OpenRouter和专用模型（Morph）的AI代理，用于快速准确的代码编辑，并支持多光标功能以实现高效的文本操作。"
  },
  {
    "id": "45954210",
    "title": "WeatherNext 2: Our most advanced weather forecasting model",
    "url": "https://blog.google/technology/google-deepmind/weathernext-2/",
    "summary": "WeatherNext 2, the latest AI weather forecasting model from Google DeepMind and Google Research, offers faster, more accurate, and higher-resolution global weather predictions. It generates hundreds of possible weather scenarios in under a minute using a single TPU, significantly outperforming the previous WeatherNext model in 99.9% of variables and lead times.\n\nA key innovation is the Functional Generative Network (FGN) architecture, which injects 'noise' to produce physically realistic and interconnected forecasts, particularly useful for predicting complex weather systems.\n\nWeatherNext 2 data is now accessible through Earth Engine and BigQuery. Additionally, an early access program is available on Google Cloud’s Vertex AI for custom model inference. Google has already integrated WeatherNext technology into Search, Gemini, Pixel Weather, and Google Maps Platform's Weather API, with plans to incorporate it into Google Maps.\n\nGoogle aims to empower researchers, developers, and businesses by providing powerful tools and open data to address complex problems and drive future innovations in weather forecasting. They are actively researching ways to further improve the model, including integrating new data sources and expanding access.\n",
    "chinese_title": "WeatherNext 2: 我们最先进的天气预报模型",
    "chinese_summary": "WeatherNext 2：谷歌最新AI天气预报模型，更快、更准、更高分辨率的全球预测\n\n谷歌DeepMind和Google Research推出的最新AI天气预报模型WeatherNext 2，提供更快、更准、更高分辨率的全球天气预测。它使用单个TPU在一分钟内生成数百种可能的天气情景，在99.9%的变量和提前期上显著优于之前的WeatherNext模型。\n\n一项关键创新是功能生成网络（FGN）架构，该架构注入“噪声”以产生物理上真实且相互关联的预测，尤其适用于预测复杂的天气系统。\n\nWeatherNext 2数据现在可通过Earth Engine和BigQuery访问。此外，Google Cloud的Vertex AI上提供早期访问计划，用于自定义模型推理。谷歌已将WeatherNext技术集成到搜索、Gemini、Pixel Weather和Google Maps Platform的天气API中，并计划将其纳入Google Maps。\n\n谷歌旨在通过提供强大的工具和开放数据，帮助研究人员、开发者和企业解决复杂问题，并推动天气预报领域的未来创新。他们正在积极研究进一步改进模型的方法，包括整合新的数据源和扩大访问范围。"
  },
  {
    "id": "45822953",
    "title": "C++ implementation of SIP, ICE, TURN and related protocols",
    "url": "https://github.com/resiprocate/resiprocate",
    "summary": "The document describes the reSIProcate project, a collection of C++ libraries and applications implementing SIP, ICE, TURN, and related protocols. Key components include:\n\n*   **resip library:** A comprehensive SIP stack (RFC3261).\n*   **dum library:** A high-level SIP library for user agents (no media).\n*   **recon library:** A high-level SIP UA library with media stack integration.\n*   Applications: SIP Proxy (rePro), STUN/TURN server (reTurn), Music-on-hold server (MOHParkServer), and a B2BUA server (reConServer).\n*   **reTurn library:** STUN/TURN client.\n*   **tfm library:** A SIP-based SIP framework\n\nThe document provides detailed CMake instructions for building the project on both *nix and Windows systems. On *nix, it outlines both in-tree and out-of-tree build processes, unit testing, and required/optional packages. On Windows, it covers building using the Visual Studio GUI and the CMake command line, including specific instructions for building with sipXtapi media support. It also explains how to use Ninja build system via Visual Studio GUI.\n\nThe document emphasizes the use of CMake variables for configuring build options (e.g., enabling c-ares support) and touches on future considerations like creating installation packages.\n",
    "chinese_title": "SIP、ICE、TURN及相关协议的C++实现",
    "chinese_summary": "本文档介绍了reSIProcate项目，这是一个实现了SIP、ICE、TURN及相关协议的C++库和应用程序集合。关键组件包括：\n\n*   **resip库：** 一个全面的SIP协议栈（RFC3261）。\n*   **dum库：** 一个用于用户代理的高级SIP库（无媒体）。\n*   **recon库：** 一个集成了媒体堆栈的高级SIP UA库。\n*   应用程序：SIP代理（rePro），STUN/TURN服务器（reTurn），保持音乐服务器（MOHParkServer），以及一个B2BUA服务器（reConServer）。\n*   **reTurn库：** STUN/TURN客户端。\n*   **tfm库：** 一个基于SIP的SIP框架。\n\n本文档提供了在*nix和Windows系统上构建项目的详细CMake说明。在*nix系统上，它概述了内部构建和外部构建过程、单元测试以及必需/可选的软件包。在Windows系统上，它涵盖了使用Visual Studio GUI和CMake命令行进行构建，包括使用sipXtapi媒体支持进行构建的具体说明。它还解释了如何通过Visual Studio GUI 使用Ninja构建系统。\n\n本文档强调使用CMake变量来配置构建选项（例如，启用c-ares支持），并涉及创建安装包等未来考虑事项。"
  },
  {
    "id": "45874597",
    "title": "Show HN: Reverse perspective camera for OpenGL (Three.js)",
    "url": "https://github.com/bntre/reverse-perspective-threejs",
    "summary": "This \"Show HN\" post introduces a custom OpenGL projection matrix (implemented in Three.js) that enables a smooth transition between direct perspective, orthographic projection, and reverse perspective views. This creates a radical visual effect similar to, but more extreme than, a Dolly Zoom.\n\nThe key idea is manipulating the frustum shape based on an inclination angle (p) of a single projection ray.  Positive 'p' yields direct perspective, 'p=0' yields orthographic projection, and negative 'p' yields reverse perspective. Importantly, the camera position becomes less relevant; the frustum transformation is what matters.\n\nA \"focus plane\" is introduced within the near and far clip planes, maintaining a constant size during projection changes.  The projection matrix is defined assuming the camera is at the center of this focus plane, and 'p' is the tangent of the projection ray's angle passing through (1, 0, 0).\n\nThe post provides the specific form of the projection matrix and links to the `updateProjectionMatrix()` function in the GitHub repository for implementation details.  It also references Song Ho Ahn's article on projection matrices for further information. The demo, video, and repository link are included. The demo uses animated models from Three.js examples (Michelle and Littlest Tokyo) but doesn't include the models directly in the repository; they are loaded at runtime.\n",
    "chinese_title": "Show HN: 用于 OpenGL (Three.js) 的反向透视相机",
    "chinese_summary": "这个“Show HN”帖子介绍了一种自定义的OpenGL投影矩阵（在Three.js中实现），它可以在直接透视、正交投影和反向透视视图之间平滑过渡。这会产生一种激进的视觉效果，类似于但比推拉变焦更极端。\n\n关键思想是基于单条投影光线的倾斜角 (p) 来操纵视锥体的形状。正 'p' 产生直接透视，'p=0' 产生正交投影，负 'p' 产生反向透视。重要的是，相机位置变得不那么重要；视锥体的变换才是关键。\n\n在近裁剪面和远裁剪面之间引入了一个“焦点平面”，在投影变化期间保持恒定大小。假定相机位于此焦点平面的中心，并且 'p' 是通过 (1, 0, 0) 的投影光线角度的正切值，以此定义投影矩阵。\n\n该帖子提供了投影矩阵的具体形式，并链接到 GitHub 存储库中的 `updateProjectionMatrix()` 函数以获取实现细节。它还引用了 Song Ho Ahn 关于投影矩阵的文章以获取更多信息。 演示、视频和存储库链接都包含在内。演示使用了 Three.js 示例中的动画模型（Michelle 和 Littlest Tokyo），但并未直接将模型包含在存储库中；它们是在运行时加载的。"
  },
  {
    "id": "45819731",
    "title": "Deploying Temporal on AWS ECS with Terraform",
    "url": "https://papnori.github.io/posts/temporal-ecs-terraform/",
    "summary": "This article provides a comprehensive guide on deploying Temporal workers on AWS ECS (Elastic Container Service) with Terraform, offering a cost-effective and scalable alternative to Kubernetes. It emphasizes using ECS with Fargate for serverless container management, reducing infrastructure costs by approximately 70% while maintaining resilience and reliability.\n\nThe guide covers key architecture components like VPC (Virtual Private Cloud), subnets (public and private), VPC endpoints, Internet Gateway, NAT Gateway, Amazon ECR (Elastic Container Registry), AWS Secrets Manager, ECS Cluster and Fargate, and Amazon CloudWatch for observability and auto-scaling. It also explains how data flows through the system, from client trigger to task execution and monitoring.\n\nThe setup involves storing Temporal Cloud or self-hosted Temporal Server credentials securely in AWS Secrets Manager and utilizing Terraform for infrastructure management. The Terraform project structure is organized into `bootstrap`, `global`, `live`, and `modules` directories. Auto-scaling is configured via CloudWatch alarms on CPU usage. The article highlights the benefits of this architecture, including resilience, security, cost-efficiency, scalability, and maintainability. Finally, the article lays out the prerequisites for the setup and guides the user through the process.\n",
    "chinese_title": "使用 Terraform 在 AWS ECS 上部署 Temporal",
    "chinese_summary": "本文全面介绍了如何使用 Terraform 在 AWS ECS（Elastic Container Service）上部署 Temporal workers，提供了一种经济高效且可扩展的 Kubernetes 替代方案。它强调使用 ECS 与 Fargate 进行无服务器容器管理，在保持弹性和可靠性的同时，可降低约 70% 的基础设施成本。\n\n本指南涵盖了关键的架构组件，例如 VPC（Virtual Private Cloud）、子网（公共和私有）、VPC 终端节点、互联网网关、NAT 网关、Amazon ECR（Elastic Container Registry）、AWS Secrets Manager、ECS 集群和 Fargate 以及用于可观测性和自动扩展的 Amazon CloudWatch。它还解释了数据如何在系统中流动，从客户端触发到任务执行和监控。\n\n该设置包括将 Temporal Cloud 或自托管的 Temporal Server 凭证安全地存储在 AWS Secrets Manager 中，并利用 Terraform 进行基础设施管理。Terraform 项目结构被组织成 `bootstrap`、`global`、`live` 和 `modules` 目录。自动扩展通过 CloudWatch 警报根据 CPU 使用率进行配置。本文重点介绍了该架构的优势，包括弹性、安全性、成本效益、可扩展性和可维护性。最后，本文列出了设置的先决条件，并指导用户完成整个过程。"
  },
  {
    "id": "45845060",
    "title": "Craft Chrome Devtools Protocol (CDP) commands with the new command editor",
    "url": "https://developer.chrome.com/blog/cdp-command-editor",
    "summary": "This article introduces the new Chrome DevTools Protocol (CDP) command editor, designed to simplify the process of crafting and sending CDP commands directly within Chrome DevTools. The CDP allows developers to remotely debug and interact with a running Chrome browser.\n\nThe key benefits of the new editor include:\n\n*   **Autocompletion:** Provides suggestions for available CDP commands.\n*   **Parameter Autofilling:** Automatically displays the required and optional parameters for a chosen command, eliminating the need to consult CDP documentation.\n*   **Simplified Parameter Input:** Offers dropdowns for enum and boolean values and allows easy addition and deletion of array and object parameters.\n*   **Inline Documentation:** Hovering over commands or parameters displays a description and link to online documentation.\n*   **Real-time Error Checking:** Provides immediate feedback if an entered parameter value is of an incorrect type.\n*   **Modify and Resend:** Allows for quick modification and re-sending of previously executed commands.\n*   **Copy as JSON:** Offers a one-click way to copy the CDP command as a JSON string.\n\nThe new editor is intended to streamline the workflow of using the CDP, making it more accessible and efficient for developers to test and control Chrome browser behavior. The DevTools team encourages users to provide feedback and feature requests.\n",
    "chinese_title": "使用全新命令编辑器编写 Chrome Devtools Protocol (CDP) 命令",
    "chinese_summary": "本文介绍新的 Chrome DevTools 协议 (CDP) 命令编辑器，旨在简化在 Chrome DevTools 中直接编写和发送 CDP 命令的过程。CDP 允许开发者远程调试并与正在运行的 Chrome 浏览器进行交互。\n\n新编辑器的主要优势包括：\n\n*   **自动补全：** 提供可用 CDP 命令的建议。\n*   **参数自动填充：** 自动显示所选命令的必需和可选参数，无需查阅 CDP 文档。\n*   **简化参数输入：** 为枚举和布尔值提供下拉菜单，并允许轻松添加和删除数组及对象参数。\n*   **内联文档：** 将鼠标悬停在命令或参数上时，会显示描述和指向在线文档的链接。\n*   **实时错误检查：** 如果输入的参数值类型不正确，会立即提供反馈。\n*   **修改和重发：** 允许快速修改和重新发送先前执行的命令。\n*   **复制为 JSON：** 提供一键将 CDP 命令复制为 JSON 字符串的方式。\n\n新编辑器旨在简化使用 CDP 的工作流程，使其更易于访问和更高效，方便开发者测试和控制 Chrome 浏览器行为。DevTools 团队鼓励用户提供反馈和功能请求。"
  },
  {
    "id": "45952428",
    "title": "Giving C a Superpower",
    "url": "https://hwisnu.bearblog.dev/giving-c-a-superpower-custom-header-file-safe_ch/",
    "summary": "This article introduces `safe_c.h`, a custom C header file designed to bring safety and convenience features from C++ and Rust to C programming. It addresses common C pitfalls like memory leaks, buffer overflows, and error handling complexities.\n\nThe header provides RAII (Resource Acquisition Is Initialization) semantics using compiler-specific cleanup attributes, ensuring resources are released even on early returns or errors. It introduces \"smart pointers\" like `UniquePtr` for automatic memory management and `SharedPtr` for thread-safe shared resources with automated reference counting.\n\nTo tackle buffer overflows, `safe_c.h` implements type-safe, auto-growing vectors and non-owning string views and spans. Vectors automate memory management for dynamic arrays, while views and spans provide zero-cost references to substrings or array slices, avoiding unnecessary allocations.\n\nThe article also addresses C's messy error handling with Rust-inspired `Result` types, forcing explicit error handling. Combined with RAII, it simplifies cleanup and prevents resource leaks. Contracts via `requires()` and `ensures()` make function preconditions and postconditions explicit and verifiable. Finally, it replaces unsafe functions like `strcpy` with safer, bounds-checked alternatives to prevent buffer overflows. The author emphasizes that `safe_c.h` empowers C developers with increased safety and modern features, while maintaining the language's flexibility and performance. The article highlights the benefits through the author's experience building `cgrep`, a high-performance grep clone.\n",
    "chinese_title": "赋予C语言超能力",
    "chinese_summary": "本文介绍了`safe_c.h`，一个自定义的C头文件，旨在将C++和Rust中的安全性和便利性功能引入C编程。它解决了常见的C语言缺陷，如内存泄漏、缓冲区溢出和复杂的错误处理。\n\n该头文件利用编译器特定的清理属性提供RAII（资源获取即初始化）语义，确保即使在提前返回或发生错误时也能释放资源。它引入了“智能指针”，如用于自动内存管理的`UniquePtr`和用于线程安全共享资源并具有自动引用计数的`SharedPtr`。\n\n为了解决缓冲区溢出问题，`safe_c.h`实现了类型安全、自动增长的向量以及非拥有的字符串视图和跨度。向量自动管理动态数组的内存，而视图和跨度提供对子字符串或数组切片的零成本引用，避免了不必要的分配。\n\n本文还介绍了受Rust启发的`Result`类型来解决C语言混乱的错误处理问题，强制进行显式错误处理。与RAII结合使用，简化了清理工作并防止了资源泄漏。通过`requires()`和`ensures()`实现的契约使函数的前提条件和后置条件显式且可验证。最后，它用更安全、边界检查的替代方案取代了不安全的函数（如`strcpy`），以防止缓冲区溢出。作者强调，`safe_c.h`赋予了C语言开发者更高的安全性和现代化的功能，同时保持了该语言的灵活性和性能。本文通过作者构建的高性能grep克隆程序`cgrep`的经验突出了这些优势。"
  },
  {
    "id": "45950720",
    "title": "Building a Simple Search Engine That Works",
    "url": "https://karboosx.net/post/4eZxhBon/building-a-simple-search-engine-that-actually-works",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "构建一个有效的简易搜索引擎",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "45955077",
    "title": "Living my best Sun Microsystems ecosystem life in 2025",
    "url": "https://www.osnews.com/story/143570/living-my-best-sun-microsystems-ecosystem-life-in-2025/",
    "summary": "This article details the author's deep fascination with the Sun Microsystems ecosystem of the late 2000s and his acquisition and restoration of a Sun Ultra 45 workstation, a dual UltraSPARC IIIi machine from 2006. He laments missing the opportunity to fully experience Sun's ecosystem during its peak and aims to recreate that experience in 2025.\n\nThe author received the Ultra 45 as a generous donation from Adriaan de Groot, a KDE e.V. board member, and thanks both Adriaan and KDE for the gift. The machine is a unique pre-production model formerly used by KDE for Solaris development. The author outlines the initial upgrades made to the Ultra 45, including adding a second processor and upgrading the RAM to 8GB. He details the challenges faced with RAM compatibility and the necessity of using Sun-branded memory.\n\nThe article also compares the Ultra 45 to its predecessor, the Sun Blade 2500, highlighting the relatively modest upgrades and the missed opportunity for a more significant advancement in SPARC workstation technology. Despite its age, the author expresses excitement about exploring the Sun ecosystem using this machine, particularly with plans to install a Sun Flash Accelerator card and a SunPCi IIIpro card for running Windows within Solaris. He appreciates the unique history and the small details, such as the \"KDE project\" sticker, that make his pre-production Ultra 45 special.\n",
    "chinese_title": "2025年，我沉浸在Sun Microsystems生态系统中，享受着美好生活",
    "chinese_summary": "本文详细介绍了作者对2000年代末Sun Microsystems生态系统的深深着迷，以及他获取并修复Sun Ultra 45工作站（一台2006年的双UltraSPARC IIIi机器）的过程。他遗憾错过了在Sun鼎盛时期充分体验其生态系统的机会，并计划在2025年重现那种体验。\n\n作者收到的Ultra 45是KDE e.V.董事会成员Adriaan de Groot慷慨捐赠的，他感谢Adriaan和KDE的这份礼物。这台机器是一台独特的预生产型号，以前由KDE用于Solaris开发。作者概述了对Ultra 45进行的初步升级，包括添加第二个处理器并将RAM升级到8GB。他详细介绍了RAM兼容性方面面临的挑战以及使用Sun品牌内存的必要性。\n\n本文还将Ultra 45与其前身Sun Blade 2500进行了比较，突出了相对适度的升级以及SPARC工作站技术错过了一次更重大进步的机会。尽管年代久远，作者对使用这台机器探索Sun生态系统感到兴奋，特别是计划安装Sun Flash Accelerator卡和SunPCi IIIpro卡，以便在Solaris中运行Windows。他很欣赏其独特的历史和一些小细节，例如“KDE project”贴纸，这些都使他的预生产Ultra 45变得特别。"
  },
  {
    "id": "45945587",
    "title": "Heretic: Automatic censorship removal for language models",
    "url": "https://github.com/p-e-w/heretic",
    "summary": "Heretic is a tool for automatically removing censorship from transformer-based language models without requiring extensive post-training. It utilizes an enhanced directional ablation technique (abliteration) coupled with a TPE-based parameter optimizer (Optuna) to achieve this. The process is fully automated and aims to minimize both refusals to \"harmful\" prompts and the KL divergence from the original model, preserving the model's original intelligence.\n\nHeretic's unsupervised operation rivals the quality of manually created abliterations, achieving similar refusal suppression with lower KL divergence, indicating less damage to the model's capabilities. It supports most dense models and various MoE architectures. Usage is straightforward, requiring a Python environment and a simple `pip install` command.\n\nThe core innovation lies in the parametrized directional ablation. The tool identifies relevant matrices within the transformer layers and orthogonalizes them with respect to \"refusal directions\" computed from the difference-of-means between \"harmful\" and \"harmless\" prompts. Optimization parameters control the ablation weight kernel's shape and position, allowing for a highly flexible approach to improve the compliance/quality tradeoff. The use of a floating-point refusal direction index allows linear interpolation between directions, expanding the search space for optimal performance. Ablation parameters are also chosen independently for each component (attention/MLP).\n\nWhile acknowledging prior art in abliteration techniques, Heretic is written from scratch. The tool is licensed under the GNU Affero General Public License.\n",
    "chinese_title": "异端：用于语言模型的自动审查移除",
    "chinese_summary": "Heretic：一种自动去除Transformer语言模型审查的工具，无需大量后续训练。它利用增强型定向消融技术（abliteration）与基于TPE的参数优化器（Optuna）来实现这一点。该过程完全自动化，旨在最大限度地减少对“有害”提示的拒绝，并最大限度地减少与原始模型的KL散度，从而保留模型的原始智能。\n\nHeretic的无监督操作可与手动创建的abliteration质量相媲美，在实现类似拒绝抑制的同时，具有更低的KL散度，表明对模型能力的损害更小。它支持大多数密集模型和各种MoE架构。使用方法简单，只需一个Python环境和一个简单的`pip install`命令即可。\n\n核心创新在于参数化的定向消融。该工具识别Transformer层中的相关矩阵，并根据从“有害”和“无害”提示之间的均值差异计算出的“拒绝方向”对它们进行正交化。优化参数控制消融权重核的形状和位置，从而实现高度灵活的方法来改善合规性/质量权衡。浮点拒绝方向索引的使用允许在方向之间进行线性插值，从而扩大了最佳性能的搜索空间。消融参数也针对每个组件（注意力/MLP）独立选择。\n\n虽然承认先前在abliteration技术上的研究，但Heretic是从头开始编写的。该工具以GNU Affero通用公共许可证授权。"
  },
  {
    "id": "45837259",
    "title": "A file format uncracked for 20 years",
    "url": "https://landaire.net/a-file-format-uncracked-for-20-years/",
    "summary": "The author details their attempt to reverse engineer the .lin file format used in the original Splinter Cell (2002) on the Xbox, a format that has remained largely uncracked for 20 years. Motivated by a desire to explore cut content, they backed up their game disc and started analyzing the .lin files.\n\nThe author initially identified the basic structure of the .lin files, noting zlib-compressed data chunks and a potential file table. They successfully wrote a tool to decompress the archives and discovered data sizes related to textures and buffers. However, difficulties arose when trying to parse the file table, which seemed to contain an excessive number of files with incorrect offsets.\n\nThrough debugging the game in the xemu emulator, the author located the functions responsible for file opening, reading, and decompression. They found that the game reads data linearly in 0x4000-byte chunks, ignoring seek commands, making the .lin format behave more like a linear stream of data. Further investigation revealed that Unreal Engine Package files exist in sequence.\n\nThe core issue remains the file table and its discrepancies. The author concludes that to properly read the files, one must assume no seeking and address the offset issues, which are likely related to how the data is loaded and managed during runtime.\n",
    "chinese_title": "二十年未破解的文件格式",
    "chinese_summary": "作者详细描述了他们尝试逆向工程 Xbox 原版《细胞分裂》(2002) 中使用的 .lin 文件格式的过程，该格式在 20 年来一直未被破解。出于探索被删减内容的渴望，他们备份了游戏光盘并开始分析 .lin 文件。\n\n作者最初识别了 .lin 文件的基本结构，注意到 zlib 压缩的数据块和一个潜在的文件表。他们成功编写了一个工具来解压缩这些文件，并发现了与纹理和缓冲区相关的数据大小。然而，在尝试解析文件表时遇到了困难，该文件表似乎包含大量具有错误偏移量的文件。\n\n通过在 xemu 模拟器中调试游戏，作者找到了负责文件打开、读取和解压缩的函数。他们发现游戏以 0x4000 字节的块线性读取数据，忽略 seek 命令，使得 .lin 格式更像是一个线性数据流。进一步的调查显示，虚幻引擎包文件按顺序存在。\n\n核心问题仍然是文件表及其差异。作者得出结论，要正确读取文件，必须假设没有 seek 操作，并解决偏移量问题，这可能与运行时数据的加载和管理方式有关。"
  },
  {
    "id": "45885768",
    "title": "Listen to Database Changes Through the Postgres WAL",
    "url": "https://peterullrich.com/listen-to-database-changes-through-the-postgres-wal",
    "summary": "This article explores how to listen for database changes in Postgres using the Write-Ahead Log (WAL) as an alternative to `pg_notify`, which can become a performance bottleneck in high-throughput databases.\n\nThe WAL is a log of every database change, enabling functionalities like replication, backups, and Change Data Capture (CDC). To use the WAL for CDC, the `wal_level` must be set to `logical`, which stores changes in a high-level format, but may incur more overhead.\n\nThe article introduces Publications, which specify which tables and operations (inserts, updates, deletes) to track. Replication Slots are created to maintain a separate copy of the WAL for the listener, ensuring no data loss. Temporary replication slots are automatically deleted when the listener disconnects, preventing disk space issues, but can miss events if the listener is offline. Persistent replication slots guarantee no data loss but allow only one connection.\n\nThe article provides migration code snippets for creating a publication and a persistent replication slot. Creating both of these needs to be done in separate migrations. The first creates the publication that defines what tables to listen to, and the second creates a named replication slot for the listener.\n",
    "chinese_title": "通过Postgres WAL监听数据库变更",
    "chinese_summary": "本文探讨了如何使用预写式日志(WAL)监听Postgres数据库中的更改，以此作为`pg_notify`的替代方案，因为在高吞吐量数据库中，`pg_notify`可能会成为性能瓶颈。\n\nWAL记录了每次数据库更改，从而实现复制、备份和变更数据捕获(CDC)等功能。要将WAL用于CDC，必须将`wal_level`设置为`logical`，这将以高级格式存储更改，但可能会产生更多开销。\n\n本文介绍了Publication，它指定要跟踪哪些表和操作（插入、更新、删除）。创建复制槽是为了为监听器维护一个单独的WAL副本，确保不会丢失数据。临时复制槽在监听器断开连接时会自动删除，从而避免磁盘空间问题，但如果监听器离线，可能会错过事件。持久复制槽保证不会丢失数据，但只允许一个连接。\n\n本文提供了用于创建publication和持久复制槽的迁移代码片段。创建这两者需要在单独的迁移中完成。第一个创建定义要监听哪些表的publication，第二个为监听器创建一个命名复制槽。"
  },
  {
    "id": "45924417",
    "title": "Fastmcpp (Fastmcp for C++)",
    "url": "https://github.com/0xeb/fastmcpp",
    "summary": "Fastmcpp is a high-performance C++ implementation of the Model Context Protocol (MCP), mirroring the functionality of the Python fastmcp library. It supports core MCP features like tool management, resource handling, prompts, and JSON Schema validation, making it suitable for building MCP servers and clients with native performance.\n\nFastmcpp offers multiple transport layers, including STDIO, HTTP (SSE), and WebSocket, and includes middleware for request/response processing. It's cross-platform, supporting Windows, Linux, and macOS.\n\nBuilding fastmcpp requires a C++17 compiler, CMake 3.20+, and the nlohmann/json library (automatically fetched). Optional dependencies include libcurl (for HTTP POST streaming) and cpp-httplib and easywsclient (for HTTP/WebSocket servers and clients). The project provides examples demonstrating basic usage, such as creating STDIO and HTTP servers, and HTTP clients.\n\nThe project structure consists of include directories with public headers, a source directory, a GoogleTest-based test suite, and example programs. Contributions are welcome, with guidelines emphasizing passing tests, adhering to code style, and updating documentation. It is licensed under Apache 2.0, and contributions can be directed to the Github issue tracker. The current version is 2.13.0 and is considered a Beta.\n",
    "chinese_title": "Fastmcpp (C++ 快速 MCP)",
    "chinese_summary": "Fastmcpp 是模型上下文协议 (MCP) 的高性能 C++ 实现，镜像了 Python fastmcp 库的功能。它支持工具管理、资源处理、提示和 JSON Schema 验证等核心 MCP 功能，使其适用于构建具有原生性能的 MCP 服务器和客户端。\n\nFastmcpp 提供多种传输层，包括 STDIO、HTTP (SSE) 和 WebSocket，并包含用于请求/响应处理的中间件。它具有跨平台性，支持 Windows、Linux 和 macOS。\n\n构建 fastmcpp 需要 C++17 编译器、CMake 3.20+ 和 nlohmann/json 库（自动获取）。可选依赖项包括 libcurl（用于 HTTP POST 流）、cpp-httplib 和 easywsclient（用于 HTTP/WebSocket 服务器和客户端）。该项目提供了演示基本用法的示例，例如创建 STDIO 和 HTTP 服务器，以及 HTTP 客户端。\n\n项目结构包括带有公共头文件的 include 目录、一个源目录、一个基于 GoogleTest 的测试套件和示例程序。欢迎贡献，指南强调通过测试、遵守代码风格和更新文档。它采用 Apache 2.0 许可，贡献可以通过 Github issue tracker 进行。当前版本为 2.13.0，被认为是 Beta 版本。"
  },
  {
    "id": "45949352",
    "title": "PicoIDE – An open IDE/ATAPI drive emulator",
    "url": "https://picoide.com/",
    "summary": "PicoIDE is an open-source hardware and firmware project created by Ian Scott that emulates IDE/ATAPI devices. It functions as both an ATAPI CD-ROM and an IDE fixed hard drive emulator. PicoIDE supports various image formats for CD-ROMs (.bin/.cue or .iso) and hard drives (.img/.hda/.vhd/.hdf). It features built-in CD audio output through a 3.5\" jack and an MPC-2 header.\n\nThe device supports PIO modes 0-4 and multi-word DMA modes 0-2 for data transfer. Additionally, there's an option for a front panel or 3.5\" drive bay enclosure which includes a 1.3\" OLED screen (128x64), 4-way navigation buttons, WiFi connectivity for remote control and image management, and an RGB activity LED.\n",
    "chinese_title": "PicoIDE – 一个开源 IDE/ATAPI 驱动器模拟器",
    "chinese_summary": "PicoIDE是由Ian Scott创建的开源硬件和固件项目，用于模拟IDE/ATAPI设备。它既可以作为ATAPI CD-ROM模拟器，也可以作为IDE固定硬盘模拟器。PicoIDE支持CD-ROM的多种镜像格式（.bin/.cue或.iso）以及硬盘的多种镜像格式（.img/.hda/.vhd/.hdf）。它具有通过3.5毫米插孔和MPC-2接头实现的内置CD音频输出功能。\n\n该设备支持PIO模式0-4和多字DMA模式0-2进行数据传输。此外，还可以选择前面板或3.5英寸驱动器托架外壳，其中包括一个1.3英寸OLED屏幕（128x64）、四向导航按钮、用于远程控制和镜像管理的WiFi连接以及RGB活动指示灯。"
  },
  {
    "id": "45950396",
    "title": "A 1961 Relay Computer Running in the Browser",
    "url": "https://minivac.greg.technology/",
    "summary": "This webpage presents a browser-based simulator of the Minivac 601, a relay-based analog computer originally released in 1961. The simulator allows users to interact with a virtual version of this historical computing device directly within their web browser. The implication is that users can learn about and experiment with the fundamentals of computing logic and machine learning principles that were present in early computing technology without requiring access to a physical Minivac 601. The page recommends a desktop view, suggesting that the simulator may not be fully optimized for mobile devices at this time. Therefore, the main point is to offer a readily accessible, interactive learning experience centered around a simulated 1961 relay computer.\n",
    "chinese_title": "在浏览器中运行的1961年继电器计算机",
    "chinese_summary": "本网页展示了一款基于浏览器的Minivac 601模拟器，这是一款最初于1961年发布的基于继电器的模拟计算机。该模拟器允许用户直接在其网络浏览器中与该历史计算设备的虚拟版本进行交互。这意味着用户可以了解并实验早期计算技术中存在的计算逻辑和机器学习原理的基础知识，而无需访问实物Minivac 601。本页面建议使用桌面视图，表明该模拟器目前可能尚未针对移动设备进行完全优化。因此，主要目的是提供围绕模拟的1961年继电器计算机为中心的、易于访问的交互式学习体验。"
  },
  {
    "id": "45947639",
    "title": "The fate of \"small\" open source",
    "url": "https://nolanlawson.com/2025/11/16/the-fate-of-small-open-source/",
    "summary": "Nolan Lawson reflects on the impact of Large Language Models (LLMs) on the open-source ecosystem, specifically the fate of \"small, low-value\" libraries like his own `blob-util`. He notes that LLMs can now easily generate code for common tasks, reducing the need for such libraries and their associated dependencies.\n\nLawson acknowledges the potential benefits of this shift, such as faster development and more robust code. However, he also laments the loss of the educational aspect. Libraries like `blob-util` often served as learning tools, teaching developers fundamental JavaScript concepts beyond just solving a specific problem. He also questions the value of just putting documentation in an llms.txt file for an LLM.\n\nHe believes that while LLMs are making certain types of open-source projects obsolete, particularly utility libraries, they don't negate the need for open source entirely. He proposes that the future of open source lies in larger, more complex, and niche projects that LLMs can't readily reproduce. He cites his work on memory leak detection as an example of a valuable area where novel research and creative techniques are still essential.\n\nLawson remains optimistic, highlighting the continued development of new JavaScript frameworks despite LLMs' proficiency with existing ones. He concludes that LLMs have reshaped the landscape, but there's still ample opportunity for innovation and contribution in the open-source world, especially for projects that push boundaries and require human ingenuity.\n",
    "chinese_title": "“小型”开源的命运",
    "chinese_summary": "诺兰·劳森反思大型语言模型（LLM）对开源生态系统的影响，特别是像他自己的`blob-util`这样“小型、低价值”库的命运。他指出，LLM现在可以轻松地为常见任务生成代码，从而减少对此类库及其相关依赖项的需求。\n\n劳森承认这种转变的潜在好处，例如更快的开发和更强大的代码。然而，他也感叹教育方面的损失。像`blob-util`这样的库通常是学习工具，教开发者超越解决特定问题的基本JavaScript概念。他还质疑仅将文档放在LLM的llms.txt文件中有什么价值。\n\n他认为，虽然LLM正在使某些类型的开源项目过时，特别是实用程序库，但它们并没有完全否定对开源的需求。他提出，开源的未来在于更大、更复杂、更小众的项目，这些项目LLM无法轻易复制。他以他在内存泄漏检测方面的工作为例，说明了新颖的研究和创造性技术仍然至关重要的有价值的领域。\n\n劳森仍然保持乐观，强调尽管LLM精通现有的JavaScript框架，但新的JavaScript框架仍在不断开发。他总结说，LLM已经重塑了格局，但在开源世界中仍然有充足的创新和贡献机会，特别是对于那些突破界限并需要人类创造力的项目。"
  },
  {
    "id": "45946865",
    "title": "I finally understand Cloudflare Zero Trust tunnels",
    "url": "https://david.coffee/cloudflare-zero-trust-tunnels",
    "summary": "This article explains Cloudflare Zero Trust tunnels and Warp, contrasting them with Tailscale and outlining their benefits, such as connecting private networks, exposing services publicly or privately, and adding granular access control. It clarifies the roles of Cloudflared (tunnel creation) and Warp Client (client connection and policy enforcement).\n\nThe core concept revolves around Tunnels (entry/exit points to networks created by Cloudflared), Routes (directing traffic to specific tunnels, enabling private network access through Warp), and Targets (defining protected infrastructure, enabling access policies). The author uses the example of exposing a Home Assistant instance to illustrate these concepts.  Public access is enabled via DNS records pointing to Argo Tunnels. Private network access (e.g., 192.168.1.3) is achieved via Warp routes, which requires the Warp client to be connected.\n\nAccess Policies are crucial for defining who can access protected resources. The author demonstrates how to require specific login methods or bypass login when connected through Warp.\n\nFinally, the article covers Warp client deployment and enrollment, highlighting settings to control client behavior, including allowed users, login methods, and protocol settings. Key is the Warp authentication identity setting to allow bypassing login screens for already enrolled users. The author emphasizes the importance of securing enrollment policies.\n",
    "chinese_title": "我终于理解了Cloudflare Zero Trust 隧道。",
    "chinese_summary": "本文阐述了 Cloudflare Zero Trust 隧道和 Warp，并将其与 Tailscale 进行对比，概述了它们的优势，例如连接私有网络、公开或私有地暴露服务以及添加精细的访问控制。文章阐明了 Cloudflared（隧道创建）和 Warp Client（客户端连接和策略执行）的角色。\n\n核心概念围绕隧道（由 Cloudflared 创建的网络入口/出口点）、路由（将流量导向特定隧道，从而通过 Warp 实现私有网络访问）和目标（定义受保护的基础设施，从而启用访问策略）展开。作者以暴露 Home Assistant 实例为例来说明这些概念。 通过指向 Argo 隧道的 DNS 记录启用公共访问。 通过 Warp 路由实现私有网络访问（例如，192.168.1.3），这需要 Warp 客户端连接。\n\n访问策略对于定义谁可以访问受保护的资源至关重要。 作者演示了如何要求特定的登录方法，或在通过 Warp 连接时绕过登录。\n\n最后，本文介绍了 Warp 客户端的部署和注册，重点介绍了用于控制客户端行为的设置，包括允许的用户、登录方法和协议设置。 关键是 Warp 身份验证身份设置，允许为已注册的用户绕过登录屏幕。 作者强调了保护注册策略的重要性。"
  },
  {
    "id": "45955367",
    "title": "You can now buy pre-owned Ford vehicles on Amazon",
    "url": "https://www.theverge.com/news/821258/ford-amazon-auto-online-sales-certified-preowned",
    "summary": "Ford is now selling certified pre-owned vehicles on Amazon's new online car buying site, Amazon Autos, joining Hyundai as the second brand on the platform. Starting today, customers in Los Angeles, Seattle, and Dallas can browse, finance, and purchase these vehicles online, with in-person pickup at local Ford dealerships.\n\nUnlike Hyundai's broader initial launch, Ford's offering is initially limited to these three cities, but Amazon anticipates expansion soon. Ford dealerships will retain control over pricing, service, and delivery, positioning Amazon as an intermediary connecting customers to these dealerships. Amazon aims to attract dealers by offering access to its vast user base of over 310 million active customers.\n\nThe vehicles sold on Amazon are certified pre-owned and backed by Ford's warranties, roadside assistance, and Ford Rewards points. Ford emphasizes that all vehicles listed have been inspected and reconditioned.\n\nThis move aims to improve the car buying experience, as many people find the traditional dealership experience frustrating. It contrasts with the direct-to-consumer (DTC) model pioneered by Tesla, which bypasses dealerships. However, laws in many states restrict manufacturers from selling directly to consumers, though this is beginning to change.\n",
    "chinese_title": "你现在可以在亚马逊上购买二手福特汽车了。",
    "chinese_summary": "福特现已在亚马逊新推出的在线汽车购买网站Amazon Autos上销售认证二手车，成为继现代之后第二个入驻该平台的品牌。从今天开始，洛杉矶、西雅图和达拉斯的客户可以在线浏览、融资和购买这些车辆，并在当地福特经销商处提货。\n\n与现代最初更广泛的发布不同，福特的销售最初仅限于这三个城市，但亚马逊预计很快会扩展。福特经销商将保留对定价、服务和交付的控制权，亚马逊的角色定位为连接客户与这些经销商的中间人。亚马逊旨在通过提供访问其超过3.1亿活跃用户的庞大用户群来吸引经销商。\n\n在亚马逊上销售的车辆均为认证二手车，并享有福特的保修、道路救援和福特奖励积分。福特强调，所有列出的车辆都经过了检查和翻新。\n\n此举旨在改善购车体验，因为许多人觉得传统的经销商体验令人沮丧。这与特斯拉开创的直销模式（DTC）形成对比，后者绕过了经销商。然而，许多州的法律限制制造商直接向消费者销售，尽管这种情况正在开始改变。"
  },
  {
    "id": "45948254",
    "title": "The Pragmatic Programmer: 20th Anniversary Edition (2023)",
    "url": "https://www.ahalbert.com/technology/2023/12/19/the_pragmatic_programmer.html",
    "summary": "Armand Halbert reviews the 20th Anniversary Edition of \"The Pragmatic Programmer,\" highlighting its continued relevance for modern software engineers. The book, aimed at both beginners and experienced developers mentoring juniors, provides actionable advice applicable to software development and beyond.\n\nHalbert emphasizes the book's structure, particularly the use of concise \"tips\" attached to the physical book for easy reference. He summarizes key concepts from the first three chapters. Chapter 1 stresses responsibility, adaptability, and continuous learning, highlighting the importance of communication and addressing \"broken windows\" in code. Chapter 2 focuses on pragmatic approaches like the DRY (Don't Repeat Yourself) principle, orthogonality, and the use of tracer bullets for iterative development. He slightly disagrees with the \"no final decisions\" tip, cautioning against over-abstraction. Chapter 3 covers essential tools and debugging strategies, advocating for plain text knowledge storage, command shell mastery, and systematic debugging techniques like the \"binary chop\" method. Chapter 4, starting with the idea that software can't be perfect, introduces the concept of Design by Contract.\n\nOverall, the review positions the book as a valuable resource for software engineers at all stages, providing practical advice and timeless principles for effective and responsible software development.\n",
    "chinese_title": "实用程序员：20周年纪念版 (2023)",
    "chinese_summary": "阿芒·哈尔伯特评述《程序员修炼之道》20周年纪念版，强调其对现代软件工程师的持续价值。本书面向初学者和指导新人的资深开发者，提供适用于软件开发及其他领域的实用建议。\n\n哈尔伯特强调了本书的结构，特别是便于参考的、附在实体书上的简洁“提示”。他总结了前三章的关键概念。第一章强调责任、适应性和持续学习，突出沟通的重要性以及解决代码中的“破窗效应”。第二章侧重于实用方法，如 DRY（不要重复自己）原则、正交性以及使用示踪弹进行迭代开发。他对“没有最终决定”的提示略有异议，告诫人们不要过度抽象。第三章涵盖了基本工具和调试策略，提倡使用纯文本存储知识、精通命令行 shell，以及像“二分法”这样的系统调试技术。第四章从软件不可能完美这一理念出发，介绍了契约式设计。\n\n总而言之，该评论将本书定位为适合所有阶段软件工程师的宝贵资源，为高效和负责任的软件开发提供实用的建议和永恒的原则。"
  },
  {
    "id": "45948311",
    "title": "Why Castrol Honda Superbike crashes on (most) modern systems",
    "url": "https://seri.tools/blog/castrol-honda-superbike/",
    "summary": "This article details the author's debugging process of a 1998 PC game, Castrol Honda Superbike World Champions, which crashes on modern Windows systems but runs fine on older ones like Windows 98 and XP.\n\nThe author discovers the crash stems from a buffer overflow vulnerability in the game's DirectInput device enumeration code. The game allocates space for only 8 DirectInput devices, but enumerates all devices (keyboards, mice, LED controllers, etc.) connected to the system. When more than 8 devices are present, the game writes out of bounds, corrupting memory and causing a crash.\n\nThe author identifies the vulnerable callback function used by DirectInput and pinpoints the specific lines of code where the overflow occurs. The article highlights that the game only needs DirectInput for joysticks, and a simple fix would be to filter the device enumeration to only include joysticks.\n\nTo resolve the issue, the author creates a custom DLL shim that intercepts the `DirectInputCreateA` function. The shim then modifies the call to `EnumDevices` to filter for only joystick-type devices and also limits the number of processed joysticks to eight. This prevents the buffer overflow and allows the game to run correctly on modern systems.\n\nThe author also delves into extreme optimization techniques to minimize the size of the shim DLL, highlighting the various compiler and linker flags used to achieve a final size of just 2 KiB. A pre-compiled DLL is made available on the article's accompanying Github page. The author leaves True Color rendering issues in the game unaddressed.\n",
    "chinese_title": "为什么嘉实多本田超级摩托车在（多数）现代系统上崩溃",
    "chinese_summary": "本文详细介绍了作者对1998年PC游戏《嘉实多本田超级摩托车世界冠军赛》的调试过程。该游戏在现代Windows系统上崩溃，但在Windows 98和XP等旧系统上运行良好。\n\n作者发现崩溃源于游戏DirectInput设备枚举代码中的缓冲区溢出漏洞。游戏仅为8个DirectInput设备分配空间，但会枚举连接到系统的所有设备（键盘、鼠标、LED控制器等）。当设备数量超过8个时，游戏会越界写入，破坏内存并导致崩溃。\n\n作者确定了DirectInput使用的易受攻击的回调函数，并查明了溢出发生的特定代码行。文章强调，游戏只需要DirectInput用于操纵杆，一个简单的修复方法是过滤设备枚举，仅包括操纵杆。\n\n为了解决这个问题，作者创建了一个自定义DLL垫片，拦截`DirectInputCreateA`函数。然后，该垫片修改了对`EnumDevices`的调用，以仅过滤操纵杆类型的设备，并将处理的操纵杆数量限制为8个。这可以防止缓冲区溢出，并使游戏能够在现代系统上正确运行。\n\n作者还深入研究了极限优化技术，以最大限度地减小垫片DLL的大小，重点介绍了用于实现最终大小仅为2 KiB的各种编译器和链接器标志。文章配套的Github页面上提供了预编译的DLL。作者没有解决游戏中True Color渲染问题。"
  },
  {
    "id": "45945784",
    "title": "FPGA Based IBM-PC-XT",
    "url": "https://bit-hack.net/2025/11/10/fpga-based-ibm-pc-xt/",
    "summary": "This article details a hobby project to recreate an IBM-PC-XT using an FPGA and a mix of original and modern components, with the goal of playing the EGA version of Monkey Island 1. The project leverages a low-power NEC V20 CPU, 1MB SRAM, and an icesugar-pro FPGA board. The custom-designed hardware includes PS/2 connectors for keyboard and mouse, a Micro SD card for fixed disk access, a YM3014B DAC for Adlib audio, and a piezo speaker.\n\nThe author describes the development process, starting with a bus controller for the V20 CPU implemented in Verilog. They discuss the memory management scheme, which involves loading the BIOS into FPGA block RAM and using a separate block RAM for video memory. A key challenge was implementing fixed disk access via an SPI controller and an option ROM for handling BIOS INT13H calls, as well as emulating the system in software.\n\nThe author tackled PS/2 mouse support by creating a PS/2 to Serial mouse bridge within the FPGA, using logic analyzer captures to understand the PS/2 protocol. Audio was enhanced by emulating hard disk seeking sounds and integrating Jose Tejada's open-source YM3812 implementation for Adlib audio, feeding it into the YM3014 DAC. The project included support for CGA and EGA graphics, a USB to UART bridge, and custom acrylic panels for enclosure. Source code, schematics, and Gerber files are available on GitHub.\n",
    "chinese_title": "基于FPGA的IBM-PC-XT",
    "chinese_summary": "本文详细介绍了一个使用FPGA和新旧组件混合重建IBM-PC-XT的业余项目，其目标是运行EGA版本的《猴岛小英雄1》。该项目利用了低功耗NEC V20 CPU、1MB SRAM以及icesugar-pro FPGA板。定制硬件包括用于键盘和鼠标的PS/2接口、用于固定磁盘访问的Micro SD卡、用于Adlib音频的YM3014B DAC以及压电扬声器。\n\n作者描述了开发过程，从用Verilog实现的V20 CPU总线控制器开始。他们讨论了内存管理方案，包括将BIOS加载到FPGA块RAM中，并使用单独的块RAM作为显存。一个关键的挑战是实现通过SPI控制器和option ROM进行固定磁盘访问，以处理BIOS INT13H调用，以及在软件中模拟系统。\n\n作者通过在FPGA内创建PS/2到串行鼠标桥接器来解决PS/2鼠标支持问题，并使用逻辑分析仪捕获来理解PS/2协议。通过模拟硬盘寻道声音并集成Jose Tejada的开源YM3812实现Adlib音频（并将其馈送到YM3014 DAC）来增强音频效果。该项目包括对CGA和EGA图形、USB到UART桥接器以及定制丙烯酸面板外壳的支持。源代码、原理图和Gerber文件可在GitHub上找到。"
  },
  {
    "id": "45948792",
    "title": "Neuroscientists track the neural activity underlying an “aha”",
    "url": "https://www.quantamagazine.org/how-your-brain-creates-aha-moments-and-why-they-stick-20251105/",
    "summary": "This article explores the neuroscience behind \"aha\" moments, or insights, and how they boost memory. Neuroscientist Maxi Becker used Mooney images (high-contrast, obscured pictures) and fMRI to track brain activity during these moments. The study revealed increased activity in the ventral occipitotemporal cortex (VOTC), amygdala, and hippocampus when participants correctly identified hidden objects in the images, particularly when the experience felt certain and emotionally positive. The hippocampus, known as the brain's \"mismatch detector,\" plays a key role in recognizing the shift from a meaningless image to a meaningful one.\n\nThe research also investigated the \"insight-memory advantage,\" finding that participants better remembered Mooney images they had experienced insightful moments with. Increased activity in the VOTC and hippocampus during the initial insight predicted better memory retention. This suggests that significant brain activity during insight makes the experience more salient, leading to better encoding in long-term memory.\n\nWhile insights create stronger memories, the article notes they aren't always correct, with participants experiencing \"aha\" moments even when misidentifying the images. The article concludes by discussing the potential applications of understanding insight, particularly in education and understanding creativity. Researcher Yuhua Yu is exploring the role of insight in creativity and other domains, such as psychotherapy, meditation, and psychedelic experiences. The overall goal is to understand how to leverage insight to improve learning and creative problem-solving.\n",
    "chinese_title": "神经科学家追踪“顿悟”背后的神经活动",
    "chinese_summary": "本文探讨了“顿悟”时刻或洞察力背后的神经科学原理，以及它们如何增强记忆力。神经科学家马克西·贝克尔使用穆尼图像（高对比度、模糊的图片）和功能磁共振成像技术来追踪这些时刻的大脑活动。研究表明，当参与者正确识别出图像中隐藏的物体时，特别是当这种体验感觉确定且情绪积极时，腹侧枕颞皮层（VOTC）、杏仁核和海马体的活动会增加。海马体，被称为大脑的“失配探测器”，在识别图像从无意义到有意义的转变中起着关键作用。\n\n该研究还调查了“顿悟-记忆优势”，发现参与者能够更好地记住他们有过顿悟时刻的穆尼图像。最初顿悟期间VOTC和海马体活动的增加预示着更好的记忆保持。这表明，顿悟期间显著的大脑活动使体验更加突出，从而导致在长期记忆中更好地编码。\n\n虽然顿悟会产生更强的记忆，但文章指出它们并不总是正确的，参与者即使错误地识别图像也会体验到“顿悟”时刻。文章最后讨论了理解顿悟的潜在应用，特别是在教育和理解创造力方面。研究人员于玉华正在探索顿悟在创造力和其他领域中的作用，如心理治疗、冥想和迷幻体验。总体目标是了解如何利用顿悟来改善学习和创造性问题解决。"
  },
  {
    "id": "45947301",
    "title": "Z3 API in Python: From Sudoku to N-Queens in Under 20 Lines (2015)",
    "url": "https://ericpony.github.io/z3py-tutorial/guide-examples.htm",
    "summary": "This article is a tutorial on using the Z3 API in Python (Z3Py), a high-performance theorem prover from Microsoft Research. It covers the basics of Z3Py, including creating integer, real, and Boolean variables, defining constraints, and using the `solve` function to find solutions. The tutorial also explains how to simplify formulas, traverse expressions, and work with arbitrarily large numbers, rational numbers, and irrational algebraic numbers.\n\nIt demonstrates how to configure the Z3 environment using `set_option` and highlights common mistakes, such as treating Python integers as Z3 rationals. The tutorial then explores Boolean logic, showcasing operators like `And`, `Or`, `Not`, `Implies`, and `If`.\n\nA section on Solvers explains the Z3 solver API, including adding constraints, checking satisfiability (`check`), and using `push` and `pop` to manage assertions. It also covers traversing constraints, collecting performance statistics, and inspecting models using `model()`.\n\nArithmetic capabilities are detailed, including the automatic coercion of integers to reals and simplification transformations using the `simplify` function. The article introduces bit-vectors for machine arithmetic and covers signed/unsigned operators like `ULT`, `ULE`, `UGT`, `UGE`, `UDiv`, `URem`, and `LShR`.\n\nFinally, the tutorial introduces uninterpreted functions and constants, illustrating how to define and use them in constraint solving, along with evaluating expressions within a model using the `evaluate` method. The tutorial aims to provide a comprehensive introduction to Z3Py's core features for solving a wide range of problems.\n",
    "chinese_title": "Python中的Z3 API：20行内搞定数独到N皇后问题 (2015)",
    "chinese_summary": "本文是一篇关于在 Python 中使用 Z3 API (Z3Py) 的教程，Z3Py 是来自微软研究院的高性能定理证明器。它涵盖了 Z3Py 的基础知识，包括创建整数、实数和布尔变量，定义约束以及使用 `solve` 函数查找解决方案。本教程还介绍了如何简化公式、遍历表达式以及处理任意大的数字、有理数和无理代数数。\n\n它演示了如何使用 `set_option` 配置 Z3 环境，并强调了常见的错误，例如将 Python 整数视为 Z3 有理数。然后，本教程探讨了布尔逻辑，展示了诸如 `And`、`Or`、`Not`、`Implies` 和 `If` 等运算符。\n\n关于求解器的章节解释了 Z3 求解器 API，包括添加约束、检查可满足性 (`check`) 以及使用 `push` 和 `pop` 管理断言。它还涵盖了遍历约束、收集性能统计信息以及使用 `model()` 检查模型。\n\n详细介绍了算术能力，包括整数到实数的自动强制转换以及使用 `simplify` 函数进行的简化转换。本文介绍了用于机器算术的位向量，并涵盖了有符号/无符号运算符，如 `ULT`、`ULE`、`UGT`、`UGE`、`UDiv`、`URem` 和 `LShR`。\n\n最后，本教程介绍了未解释的函数和常量，说明了如何在约束求解中定义和使用它们，以及使用 `evaluate` 方法在模型中评估表达式。本教程旨在为解决各种问题的 Z3Py 核心功能提供全面的介绍。"
  },
  {
    "id": "45825413",
    "title": "Fourier Transforms",
    "url": "https://www.continuummechanics.org/fourierxforms.html",
    "summary": "This article is a critical look at the application and interpretation of Fourier Transforms (FFTs), particularly in the context of periodic data like that from rotating machinery or tires. The author argues that FFTs are often misused and misinterpreted, leading to erroneous conclusions.\n\nThe core point is that an FFT is fundamentally a curve-fitting process, specifically a multi-variable linear regression of sine and cosine functions to a given dataset. Therefore, it shouldn't be treated as a tool with \"metaphysical abilities\" to reveal hidden truths. Just because an FFT produces a harmonic at a specific frequency doesn't automatically mean the object was actually vibrating at that frequency.\n\nThe author uses a simple linear regression example (fitting a line to a quadratic function) to illustrate how easily misinterpretations can arise from curve-fitting results. He then explains the mathematical basis of FFTs, highlighting the key equations for calculating the amplitude and phase lag of each harmonic.\n\nSeveral examples are presented, showing the FFT of basic functions like sine waves. These examples demonstrate that the FFT results can be complex and misleading if the data doesn't contain an integer number of cycles or if \"zeroes\" are added to the end of the signal. The article emphasizes the importance of understanding the limitations of FFTs and considering the full time signal when interpreting the results. Ignoring phase lag information is also pointed out as a potential source of misinterpretation. The overall message is to use FFTs with caution and critical thinking, recognizing them as a form of curve-fitting rather than a magical insight generator.\n",
    "chinese_title": "傅里叶变换",
    "chinese_summary": "对傅里叶变换(FFT)应用和解读的批判性审视：以旋转机械或轮胎等周期性数据为例。作者认为FFT常被误用和误解，导致错误的结论。\n\n核心观点是，FFT本质上是一个曲线拟合过程，具体来说，是对给定数据集进行正弦和余弦函数的多变量线性回归。因此，不应将其视为具有“神秘能力”来揭示隐藏真相的工具。仅仅因为FFT在特定频率上产生谐波，并不意味着该对象实际上在该频率上振动。\n\n作者使用一个简单的线性回归例子（用直线拟合二次函数）来说明曲线拟合结果如何容易产生误解。然后，他解释了FFT的数学基础，强调了计算每个谐波的幅度和相位滞后的关键公式。\n\n文章展示了几个例子，包括正弦波等基本函数的FFT。这些例子表明，如果数据不包含整数个周期，或者在信号末尾添加了“零”，则FFT结果可能复杂且具有误导性。文章强调了理解FFT局限性的重要性，并在解释结果时考虑完整的时域信号。忽略相位滞后信息也被指出是误解的潜在来源。总而言之，要谨慎和批判性地使用FFT，将其视为一种曲线拟合形式，而不是神奇的洞察力产生器。"
  },
  {
    "id": "45952890",
    "title": "Are you stuck in movie logic?",
    "url": "https://usefulfictions.substack.com/p/are-you-stuck-in-movie-logic",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "你是否陷入了电影逻辑？",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "45950553",
    "title": "Mixing Is the Heartbeat of Deep Lakes. At Crater Lake, It's Slowing Down",
    "url": "https://www.quantamagazine.org/mixing-is-the-heartbeat-of-deep-lakes-at-crater-lake-its-slowing-down-20251114/",
    "summary": "This article discusses the slowing down of lake mixing in deep lakes, focusing on Crater Lake in Oregon as a prime example. Lake mixing, a crucial process driven by wind, temperature, and salinity, acts like a heartbeat, distributing oxygen and nutrients throughout the water column. However, climate change, with its warming temperatures and longer summers, is disrupting this process.\n\nAt Crater Lake, scientists have observed the water becoming clearer, which paradoxically indicates a problem. Warmer surface water temperatures lead to thinner warm water layers, reducing phytoplankton populations and thus increasing water clarity. More significantly, the article details that warmer nights are weakening the summer shallow mixing, and warmer winters are reducing the reverse stratification process that mixes the lake to the bottom. These changes lead to stratification, preventing oxygen and nutrient distribution.\n\nThe article highlights the importance of long-term data sets, such as the one from Crater Lake dating back to 1886, in understanding these changes. Similar mixing issues have been observed in Italian lakes, where a lack of oxygen at the bottom has transformed the biological communities. Crater Lake serves as a \"canary in the coal mine,\" allowing researchers to study the impact of climate change on lake physics and potentially mitigate the consequences. Scientists are now emphasizing the need for a collaborative approach to studying lakes globally, as the impact of reduced mixing can lead to fish kills, algal blooms, and invasive species.\n",
    "chinese_title": "深湖的混合是其命脉，火山口湖的混合正在减缓。",
    "chinese_summary": "本文探讨了深水湖泊混合减缓的现象，并以俄勒冈州的火山口湖为例。湖泊混合是一个由风、温度和盐度驱动的关键过程，如同心脏跳动，将氧气和养分分布到整个水体中。然而，气候变化，伴随着气温升高和夏季延长，正在扰乱这一过程。\n\n在火山口湖，科学家观察到湖水变得更加清澈，但这反常地表明存在问题。较暖的表层水温导致较薄的暖水层，减少浮游植物种群，从而提高水的透明度。更重要的是，本文详细说明了较暖的夜晚正在削弱夏季的浅层混合，而较暖的冬季正在减少将湖水混合到底部的逆层化过程。这些变化导致分层现象，阻止氧气和养分的分布。\n\n本文强调了长期数据集的重要性，例如火山口湖自1886年以来的数据，以便了解这些变化。在意大利湖泊中也观察到了类似的混合问题，底部缺氧已经改变了生物群落。火山口湖就像“煤矿里的金丝雀”，让研究人员可以研究气候变化对湖泊物理的影响，并有可能减轻后果。科学家们现在强调需要采取合作的方式来研究全球湖泊，因为混合减少的影响可能导致鱼类死亡、藻类大量繁殖和入侵物种。"
  },
  {
    "id": "45953202",
    "title": "GCC 16 considering changing default to C++20",
    "url": "https://inbox.sourceware.org/gcc/aQj1tKzhftT9GUF4@redhat.com/",
    "summary": "The article discusses the possibility of GCC 16 changing its default language standard to C++20. The provided content is a captcha screen asking the user to verify they are not a robot before proceeding, implying the full article is behind this verification. Therefore, without access to the full article, the only concrete information is the **title suggesting GCC 16 is contemplating switching its default C++ standard to C++20.**  We can infer that this is a significant consideration with potential implications for developers using GCC as their compiler. The actual details and reasons behind this consideration are unavailable due to the captcha.\n",
    "chinese_title": "GCC 16 考虑将默认标准更改为 C++20",
    "chinese_summary": "GCC 16 可能将默认语言标准更改为 C++20 的探讨。"
  },
  {
    "id": "45955115",
    "title": "App Lets ICE Track Vehicles and Owners Across the Country",
    "url": "https://www.404media.co/this-app-lets-ice-track-vehicles-and-owners-across-the-country/",
    "summary": "A new app called Mobile Companion allows Immigration and Customs Enforcement (ICE) officers to instantly scan license plates, adding them to a database of billions of records detailing vehicle locations nationwide. This data, sourced from Motorola Solutions and Thomson Reuters, can be combined with driver's license information, credit header data, marriage records, vehicle ownership details, and voter registrations, enabling ICE to predict vehicle movements and collect face scans for facial recognition.\n\nThe app integrates with a desktop application called Vehicle Manager for analyzing and managing license plate data. Motorola, through its Vigilant Solutions and Digital Recognition Network (DRN) subsidiaries, uses fixed and mobile cameras, including those crowdsourced from repo men, to collect license plate data. Thomson Reuters' CLEAR platform enriches this data with comprehensive public and proprietary information, despite their claim that Mobile Companion has no relation to CLEAR.\n\nWhile Thomson Reuters markets CLEAR for uses like rescuing abducted children and catching criminals, it doesn't highlight its use by ICE for deportation efforts. ICE continues to spend millions on Thomson Reuters for license plate reader data to aid in arrests and asset forfeiture. The Department of Homeland Security (DHS) and Motorola did not respond to requests for comment.\n",
    "chinese_title": "应用让美国移民及海关执法局追踪全国车辆和车主",
    "chinese_summary": "一款名为“移动伴侣”的新应用允许移民及海关执法局 (ICE) 官员即时扫描车牌，并将它们添加到包含全国各地车辆位置信息的数十亿条记录数据库中。这些数据来源于摩托罗拉解决方案和汤森路透，可以与驾驶执照信息、信用头数据、结婚记录、车辆所有权详情和选民登记信息相结合，使 ICE 能够预测车辆动向并收集面部扫描信息用于面部识别。\n\n该应用与名为“车辆管理器”的桌面应用程序集成，用于分析和管理车牌数据。摩托罗拉通过其 Vigilant Solutions 和 Digital Recognition Network (DRN) 子公司，使用固定和移动摄像头（包括从收车人员处众包的摄像头）来收集车牌数据。汤森路透的 CLEAR 平台利用全面的公共和专有信息来丰富这些数据，尽管他们声称“移动伴侣”与 CLEAR 无关。\n\n虽然汤森路透将 CLEAR 定位于解救被绑架儿童和抓捕罪犯等用途，但它并未强调 ICE 将其用于驱逐出境工作。ICE 继续花费数百万美元从汤森路透购买车牌读取器数据，以协助逮捕和没收资产。国土安全部 (DHS) 和摩托罗拉均未回复置评请求。"
  },
  {
    "id": "45949655",
    "title": "A new chapter begins for EV batteries with the expiry of key LFP patents",
    "url": "https://www.shoosmiths.com/insights/articles/a-new-chapter-begins-for-ev-batteries-with-the-expiry-of-key-lfp-patents",
    "summary": "The expiry of key patents for Lithium Iron Phosphate (LFP) battery chemistry in 2022 has opened up the EV market, allowing broader access to this cost-effective, safe, and less toxic battery technology. While Tesla initially signaled the trend, LFP adoption is accelerating across Western markets, also gaining traction in renewable energy storage.\n\nHowever, this isn't a free-for-all. While the core LFP chemistry is now public, companies are securing patents around secondary innovations like energy density enhancement, safety improvements, and fast-charging capabilities. Companies like CATL, BYD, and Tesla hold relevant patents in this area. Companies entering this space face potential infringement risks related to secondary patents covering additives, coatings, and production methods, necessitating careful Freedom-to-Operate (FTO) analysis.\n\nBeyond patents, challenges remain. LFP batteries' lower material value poses recycling challenges, particularly with upcoming EU regulations requiring recycled lithium content. Western manufacturers are also heavily reliant on Chinese suppliers for key materials and manufacturing expertise. Furthermore, infrastructure like charging stations need improvement to promote EV adoption.\n\nThe patent expiry marks the beginning of a new phase of innovation. Competitive advantage now lies in further technological advancements, requiring strategic patent and trade secret protection, alongside strategic partnerships. EV companies will have to navigate a landscape where effective IP protection strategies are key to success.\n",
    "chinese_title": "关键磷酸铁锂专利到期，电动汽车电池迎来新篇章。",
    "chinese_summary": "磷酸铁锂电池关键专利于2022年到期，为电动汽车市场打开了大门，使这种经济高效、安全且毒性较低的电池技术得以更广泛地应用。 特斯拉最初引领了这一趋势，而磷酸铁锂的采用正在整个西方市场加速，并在可再生能源存储领域也获得了关注。\n\n然而，这并非完全自由。 虽然核心的磷酸铁锂化学成分现在是公开的，但各公司正在围绕能量密度提升、安全性改进和快速充电能力等二次创新申请专利。 宁德时代、比亚迪和特斯拉等公司在该领域拥有相关专利。 进入该领域的公司面临着与添加剂、涂层和生产方法相关的二次专利侵权风险，因此需要进行谨慎的运营自由度（FTO）分析。\n\n除了专利之外，仍然存在挑战。 磷酸铁锂电池较低的材料价值给回收带来挑战，特别是考虑到即将出台的欧盟法规要求回收锂含量。 西方制造商也严重依赖中国供应商的关键材料和制造技术。 此外，充电站等基础设施需要改进，以促进电动汽车的普及。\n\n专利到期标志着创新新阶段的开始。 竞争优势现在在于进一步的技术进步，这需要战略性专利和商业秘密保护，以及战略伙伴关系。 电动汽车公司将不得不应对一个有效的知识产权保护策略是成功的关键的局面。"
  },
  {
    "id": "45947770",
    "title": "Supercookie: Browser Fingerprinting via Favicon (2021)",
    "url": "https://github.com/jonasstrehle/supercookie",
    "summary": "This article describes \"Supercookie,\" a novel browser fingerprinting technique that utilizes favicons to create a persistent and difficult-to-clear unique identifier for website visitors. Unlike traditional tracking methods using cookies, this method leverages the browser's favicon cache (F-Cache) and circumvents common anti-tracking measures like incognito mode, VPNs, ad blockers, and clearing browser data.\n\nThe technique works by exploiting the way browsers request favicons. If a favicon for a specific URL path isn't in the F-Cache, the browser requests it from the server. By strategically delivering or not delivering favicons for different subpaths, the server can create a unique pattern (the supercookie) for each browser based on which favicons are requested. This pattern can be reconstructed upon subsequent visits, identifying the user even after clearing cookies and employing privacy tools.\n\nThe article highlights the vulnerability of major browsers like Chrome, Firefox, Safari, and Edge, including their mobile versions. It explains how the attack can be scaled to distinguish a large number of users. Mitigation strategies currently involve manually deleting the favicon cache files. The author emphasizes that the demonstration and source code are for educational purposes, aiming to raise awareness about favicon-based tracking possibilities. The project has gained attention from various tech news outlets and security experts.\n",
    "chinese_title": "Supercookie：通过网站图标进行浏览器指纹识别 (2021)",
    "chinese_summary": "本文描述了一种名为“超级Cookie”的新型浏览器指纹识别技术，该技术利用网站图标（favicon）为网站访问者创建一个持久且难以清除的唯一标识符。与使用Cookie的传统跟踪方法不同，此方法利用浏览器的网站图标缓存（F-Cache），并绕过常见的反跟踪措施，如隐身模式、VPN、广告拦截器和清除浏览器数据。\n\n该技术通过利用浏览器请求网站图标的方式来工作。如果特定URL路径的网站图标不在F-Cache中，浏览器会向服务器请求。通过策略性地传递或不传递不同子路径的网站图标，服务器可以根据请求了哪些网站图标，为每个浏览器创建一个唯一的模式（超级Cookie）。该模式可以在后续访问中重建，即使在清除Cookie和使用隐私工具后也能识别用户。\n\n本文重点介绍了Chrome、Firefox、Safari和Edge等主流浏览器（包括其移动版本）的漏洞。它解释了如何扩展攻击以区分大量用户。目前的缓解策略包括手动删除网站图标缓存文件。作者强调，演示和源代码仅用于教育目的，旨在提高人们对基于网站图标的跟踪可能性的认识。该项目已引起多家科技新闻媒体和安全专家的关注。"
  },
  {
    "id": "45948058",
    "title": "I have recordings proving Coinbase knew about breach months before disclosure",
    "url": "https://jonathanclark.com/posts/coinbase-breach-timeline.html",
    "summary": "In January 2025, the author experienced a sophisticated scam where attackers possessed detailed personal information, including their social security number and exact Bitcoin balance, suggesting a data breach at Coinbase. They immediately reported the incident to Coinbase, providing a detailed technical analysis of the phishing email, including suspicious email headers indicating it originated from Amazon SES instead of Coinbase's secure channels, and a recording of the fraudulent call. Despite acknowledging the report as \"super robust,\" Coinbase failed to investigate or respond to the author's critical question about how the attackers obtained their sensitive data.\n\nFour months later, in May 2025, Coinbase publicly disclosed a breach where cybercriminals bribed overseas customer support contractors at TaskUs in India to steal customer data. The compromised information included names, addresses, SSN digits, IDs, account balances, and transaction histories. Coinbase estimated the financial impact at $180-400 million.\n\nThe author argues that Coinbase knew about the breach months before the public disclosure, as their experience in January and subsequent report provided concrete evidence of compromised data being actively used. They criticize Coinbase for outsourcing security-sensitive roles, failing to detect the breach earlier, providing inadequate responses to user reports, and potentially delaying the disclosure. The author also highlights the sophisticated nature of the scam, including the use of a Google Voice number, attempts to get them to move funds to Coinbase Wallet, and SMS flooding to hide security alerts.\n",
    "chinese_title": "我有录音证明Coinbase在披露前数月就知道违规行为。",
    "chinese_summary": "2025年1月，作者遭遇了一起复杂的诈骗，攻击者掌握了详细的个人信息，包括社保号码和准确的比特币余额，这表明Coinbase发生了数据泄露。作者立即向Coinbase报告了该事件，并提供了钓鱼邮件的详细技术分析，包括可疑的邮件头，表明邮件源自亚马逊SES而非Coinbase的安全渠道，以及欺诈电话的录音。尽管Coinbase承认该报告“非常有力”，但却未调查或回应作者关于攻击者如何获取其敏感数据的关键问题。\n\n四个月后，即2025年5月，Coinbase公开披露了一起数据泄露事件，网络罪犯贿赂了印度TaskUs的海外客户支持承包商，以窃取客户数据。泄露的信息包括姓名、地址、社保号码数字、身份证、账户余额和交易历史。Coinbase估计财务影响为1.8亿至4亿美元。\n\n作者认为，Coinbase在公开披露前几个月就知道该漏洞，因为他们1月份的经历和随后的报告提供了具体证据，表明被盗数据正在被积极使用。作者批评Coinbase外包安全敏感职位、未能更早地发现漏洞、对用户报告的回复不足以及可能延迟披露。作者还强调了诈骗的复杂性，包括使用Google Voice号码、试图让作者将资金转移到Coinbase Wallet，以及使用短信轰炸来隐藏安全警报。"
  },
  {
    "id": "45944296",
    "title": "Anthropic’s paper smells like bullshit",
    "url": "https://djnn.sh/posts/anthropic-s-paper-smells-like-bullshit/",
    "summary": "The article criticizes a recently published report by AI research company Anthropic, regarding a supposed cyber espionage operation by a Chinese state-sponsored group (GTG-1002) leveraging their AI assistant, Claude, for penetration testing. The author, \"djnn,\" argues the report lacks crucial technical details and verifiable evidence, rendering it useless for security professionals aiming to detect or prevent similar attacks.\n\nThe core complaint is the absence of Indicators of Compromise (IoCs), TTPs, and other specific markers that would allow security teams to validate the claims and protect their networks. The author finds assertions like Claude independently executing 80-90% of tactical operations unsubstantiated and questions the tooling used, the type of data extracted, and the nature of affected systems.\n\n\"djnn\" emphasizes that attribution to a Chinese state-affiliated group without providing supporting details is irresponsible and could have diplomatic implications. They suspect the report's primary purpose is to promote Anthropic's AI-powered security solutions, highlighting a concluding paragraph that encourages security teams to \"experiment with applying AI for defense.\"\n\nIn conclusion, the author views the report as a \"pathetic excuse\" and a \"shameless attempt at selling more of their product,\" lacking ethical consideration for providing actionable intelligence and relying on hype over substance. \"djnn\" calls for the industry to demand higher standards from tech companies, particularly regarding fact-based evidence and verifiable information in cybersecurity reports.\n",
    "chinese_title": "Anthropic 的论文闻起来像坨屎。",
    "chinese_summary": "该文章批评了人工智能研究公司Anthropic最近发布的一份报告，该报告声称一个中国官方背景的组织（GTG-1002）利用他们的AI助手Claude进行渗透测试，实施了一起所谓的网络间谍活动。作者“djnn”认为，该报告缺乏关键的技术细节和可验证的证据，使其对于旨在检测或预防类似攻击的安全专业人员毫无用处。\n\n核心的抱怨是缺乏入侵指标（IoCs）、战术、技术和程序（TTPs）以及其他具体的标记，这些本可以帮助安全团队验证声明并保护他们的网络。作者发现诸如Claude独立执行80-90%战术行动之类的说法毫无根据，并质疑所使用的工具、提取的数据类型以及受影响系统的性质。\n\n“djnn”强调，在没有提供支持细节的情况下将行为归因于中国官方背景的组织是不负责任的，并可能产生外交影响。他们怀疑该报告的主要目的是为了推广Anthropic的AI驱动的安全解决方案，并特别指出了鼓励安全团队“尝试应用AI进行防御”的结尾段落。\n\n总而言之，作者认为该报告是“可悲的借口”和“无耻的推销产品的行为”，缺乏提供可操作情报的伦理考量，并且依赖炒作而非实质。“djnn”呼吁业界要求科技公司提高标准，尤其是在网络安全报告中提供基于事实的证据和可验证的信息方面。"
  },
  {
    "id": "45941596",
    "title": "AirPods libreated from Apple's ecosystem",
    "url": "https://github.com/kavishdevar/librepods",
    "summary": "LibrePods is a project aiming to unlock the full potential of Apple's AirPods on non-Apple devices, specifically Android and Linux. It allows users to access features typically locked within the Apple ecosystem, such as noise control modes, ear detection, battery status, and customizable transparency modes.\n\nCurrently, AirPods Pro (2nd Gen) are fully supported, while other models have varying levels of functionality. The software offers customizations like renaming AirPods and modifying long-press actions. Some advanced features, like hearing aid customization and multi-device connectivity, require a Bluetooth Device Identification (DID) hook, achieved by mimicking an Apple device ID.\n\nOn Android, LibrePods generally requires a rooted device with Xposed due to a Bluetooth stack issue, although ColorOS/OxygenOS 16 users can access basic features without root. The DID hook is enabled through Xposed. The project is under active development, with a new Linux version in progress.\n\nKey points include:\n\n*   **Brings AirPods features to Android and Linux.**\n*   **Requires root on Android (generally) for full functionality.**\n*   **Offers noise control, ear detection, battery status, and more.**\n*   **Includes advanced features via Bluetooth DID hook.**\n*   **Free and open-source under the GNU GPL v3 license.**\n",
    "chinese_title": "AirPods挣脱了苹果生态",
    "chinese_summary": "LibrePods：旨在解锁AirPods在非苹果设备上的全部潜力，尤其是在安卓和Linux系统上。它允许用户访问通常锁定在苹果生态系统中的功能，例如噪声控制模式、入耳检测、电池状态和可定制的通透模式。\n\n目前，AirPods Pro (第二代) 得到完全支持，而其他型号的功能支持程度各不相同。该软件提供诸如重命名AirPods和修改长按操作等自定义选项。诸如助听器自定义和多设备连接等一些高级功能，需要通过模拟苹果设备ID来实现蓝牙设备识别 (DID) 钩子。\n\n在安卓系统上，由于蓝牙协议栈问题，LibrePods通常需要已root的设备并安装Xposed框架才能运行，不过ColorOS/OxygenOS 16用户无需root即可访问基本功能。DID钩子通过Xposed启用。该项目正在积极开发中，新的Linux版本也在开发中。\n\n要点包括：\n\n*   **将AirPods功能引入安卓和Linux。**\n*   **安卓系统上通常需要root才能实现全部功能。**\n*   **提供噪声控制、入耳检测、电池状态等功能。**\n*   **通过蓝牙DID钩子提供高级功能。**\n*   **根据GNU GPL v3许可证免费开源。**"
  },
  {
    "id": "45953556",
    "title": "Russia's Kinzhal Missiles Are Too Fast to Shoot, So Ukraine Jams Them with Music",
    "url": "https://www.trenchart.us/p/to-jam-russias-mach-57-kinzhal-missiles",
    "summary": "This article details Ukraine's innovative approach to neutralizing Russia's Kinzhal missiles, which are known for their hypersonic speed making them difficult to intercept with traditional missile defense systems like the Patriot. Ukraine is employing its Lima EW electronic warfare system to jam and spoof the Kinzhal's satellite navigation signals.\n\nInstead of simply disrupting the signals, the Ukrainian Night Watch unit replaces them with a popular patriotic anthem, \"Our Father Is Bandera.\" While any random signal could theoretically cause navigational errors, using the anthem serves a dual purpose: disrupting the missile's guidance and making a symbolic statement against Russian propaganda that vilifies Bandera.\n\nBy replacing the correct GPS signals with the anthem, the Kinzhals become disoriented and veer off course, potentially missing their intended targets by hundreds of yards. Recent evidence points to at least one Kinzhal impacting far from its intended target near Starokostyantyniv. The article highlights the effectiveness of this tactic, claiming that the Night Watch unit has taken down approximately a dozen Kinzhals in the past two weeks using this method.\n",
    "chinese_title": "俄罗斯“匕首”导弹速度太快无法拦截，乌克兰用音乐干扰",
    "chinese_summary": "乌克兰干扰“匕首”导弹的新策略：用爱国歌曲误导导航"
  },
  {
    "id": "45949326",
    "title": "Britney Spears' Guide to Semiconductor Physics (2000)",
    "url": "https://britneyspears.ac/lasers.htm",
    "summary": "This webpage, titled \"Britney Spears' Guide to Semiconductor Physics,\" is a satirical or humorous take on physics education, presented under the guise of Britney Spears, the pop star, being an expert in semiconductor physics. It's implied, and highly probable, that Britney Spears has nothing to do with the content.\n\nThe site covers fundamental topics in semiconductor physics, including:\n\n*   **Semiconductor Basics:** Crystal structures, semiconductor junctions, and concepts like quantum wells.\n*   **Radiative Recombination and Carrier Transport:** Important processes in semiconductors related to light emission.\n*   **Density of States:** A key concept in understanding the energy levels within a semiconductor.\n*   **Laser Technology:** Specifically edge-emitting lasers and Vertical Cavity Surface Emitting Lasers (VCSELs).\n*   **Photonic Crystals:** Advanced structures used to control light propagation.\n*   **Semiconductor Fabrication:** Crystal growth, fabrication, photolithography and processing techniques.\n\nThe website also includes supplementary materials such as a scientific calculator, a \"Lip-glossary of Semiconductor Terms\", Britney Spears-themed wallpapers, and links to other sections like picture galleries, lyrics, chat, and \"Britney Gossip.\"\n\nThe site is actually part of Splung.com Physics, a website designed for physics students, and the author is looking for collaborators to expand the site with interactive components. The tone is playful, likely intending to engage students through the unexpected association with a pop icon while presenting factual information.\n",
    "chinese_title": "布兰妮·斯皮尔斯半导体物理指南 (2000)",
    "chinese_summary": "名为“布兰妮·斯皮尔斯半导体物理学指南”的网页，是对物理教育的一种讽刺或幽默解读，以流行歌星布兰妮·斯皮尔斯为半导体物理学专家的名义呈现。 隐含且极有可能的是，布兰妮·斯皮尔斯与该内容毫无关系。\n\n该网站涵盖半导体物理学的基本主题，包括：\n\n*   **半导体基础：** 晶体结构、半导体结以及量子阱等概念。\n*   **辐射复合与载流子传输：** 半导体中与光发射相关的重要过程。\n*   **态密度：** 理解半导体内部能级的关键概念。\n*   **激光技术：** 特别是边发射激光器和垂直腔表面发射激光器 (VCSEL)。\n*   **光子晶体：** 用于控制光传播的先进结构。\n*   **半导体制造：** 晶体生长、制造、光刻和加工技术。\n\n该网站还包括补充材料，如科学计算器、“半导体术语唇彩词汇表”、布兰妮·斯皮尔斯主题壁纸，以及图片库、歌词、聊天和“布兰妮八卦”等其他部分的链接。\n\n该网站实际上是为物理系学生设计的 Splung.com Physics 网站的一部分，作者正在寻找合作者来扩展该网站的互动组件。 语气轻松活泼，可能旨在通过与流行偶像的出人意料的联系来吸引学生，同时呈现事实信息。"
  },
  {
    "id": "45947761",
    "title": "Dark Pattern Games",
    "url": "https://www.darkpattern.games",
    "summary": "Dark pattern games use deliberately manipulative design choices to negatively impact players while benefiting the game developer. These aren't just unintentional design flaws; they are purposeful tactics designed to exploit player psychology. The core principle is to trick or pressure players into actions that they might not otherwise take, such as spending real money, playing for longer than intended, or sharing the game with others.\n\nThese tactics can manifest in various forms. Examples include using artificial scarcity to create a fear of missing out (FOMO), implementing deceptive pricing strategies, making in-game purchases seem easier or more necessary than they actually are, and obscuring important information about the true cost or time commitment involved in progressing through the game. Essentially, game developers use these design tricks to maximize profits or engagement at the expense of player enjoyment and potentially, financial well-being.\n",
    "chinese_title": "暗黑模式游戏",
    "chinese_summary": "恶意游戏设计利用刻意操控的设计选择，在让玩家遭受负面影响的同时，使游戏开发者获益。这些并非无意的设计缺陷，而是旨在利用玩家心理的有目的的策略。其核心原则是欺骗或迫使玩家采取他们可能不愿采取的行动，例如花费真金白银、游戏时间超出预期或与他人分享游戏。\n\n这些策略可以表现为多种形式。例如，利用人为稀缺性来制造错失恐惧症（FOMO），实施欺骗性定价策略，使游戏内购买看起来比实际更容易或更必要，以及掩盖有关游戏进展所涉及的真实成本或时间投入的重要信息。本质上，游戏开发者使用这些设计技巧来最大限度地提高利润或参与度，但代价是玩家的乐趣，甚至可能是财务健康。"
  },
  {
    "id": "45809524",
    "title": "Quest for Permissively Licensed PDF Library in C#",
    "url": "https://duerrenberger.dev/blog/2025/11/04/quest-for-permissively-licensed-pdf-library-in-csharp/",
    "summary": "This article details the author's quest to find a permissively licensed C# PDF rendering library that doesn't rely on a full browser engine. The author emphasizes the difficulty of layouting and styling in PDF creation, which often leads to using browser engines like Chromium.\n\nThe article outlines desirable features for a PDF solution: DOM representation, layout/styling capabilities, PDF format writing, and format translation. While many libraries can write PDFs, few offer layout and styling under a permissive license.\n\nQuestPDF is highlighted as a promising, modern library with an MIT license for its code, though the project license differentiates between free and commercial use.\n\nThe author then provides an exhaustive list of PDF-related libraries, categorized by their functionality (DOM, Layout, PDF Renderer, Browser Engine), along with license information and suitability for the author's goals. Libraries like MigraDoc, PdfPig, LiteHtmlSharp, HTML Agility Pack, PDFSharp, and various HTML-to-PDF converters are assessed.\n\nUltimately, MigraDoc is identified as the best fit, despite its limitations in advanced styling and potential memory usage. While not perfect, it offers a \"good enough\" solution for many common PDF export scenarios. The author notes the surprising lack of strong, permissively licensed PDF rendering contenders in the open-source world and expresses interest in creating glue code to facilitate interoperability between existing .NET PDF libraries.\n",
    "chinese_title": "C#中寻找许可宽松的PDF库",
    "chinese_summary": "本文详细介绍了作者寻找一个不依赖完整浏览器引擎的、许可证宽松的 C# PDF 渲染库的探索过程。作者强调了 PDF 创建中布局和样式设计的难度，这通常导致人们使用像 Chromium 这样的浏览器引擎。\n\n文章概述了一个理想的 PDF 解决方案应具备的特性：DOM 表示、布局/样式功能、PDF 格式写入和格式转换。虽然许多库可以写入 PDF，但很少有库在宽松许可下提供布局和样式设计。\n\nQuestPDF 被强调为一个有前景的现代库，其代码采用 MIT 许可证，但项目许可区分了免费和商业用途。\n\n作者随后提供了一个详尽的 PDF 相关库列表，按其功能（DOM、布局、PDF 渲染器、浏览器引擎）进行分类，并附带许可证信息以及是否适合作者的目标。MigraDoc、PdfPig、LiteHtmlSharp、HTML Agility Pack、PDFSharp 以及各种 HTML 到 PDF 转换器等库都经过了评估。\n\n最终，MigraDoc 被确定为最合适的选择，尽管它在高级样式设计和潜在内存使用方面存在局限性。虽然不完美，但它为许多常见的 PDF 导出场景提供了“足够好”的解决方案。作者指出，在开源世界中，令人惊讶地缺乏强大的、许可证宽松的 PDF 渲染竞争者，并表示有兴趣创建胶水代码以促进现有 .NET PDF 库之间的互操作性。"
  },
  {
    "id": "45944969",
    "title": "Garbage collection is useful",
    "url": "https://dubroy.com/blog/garbage-collection-is-useful/",
    "summary": "This devlog recounts how knowledge of garbage collection, specifically the principles from the paper \"A Unified Theory of Garbage Collection,\" proved useful in solving a problem related to incremental parsing with Ohm and ProseMirror.\n\nThe author was working on a system where text document edits in ProseMirror need to be synchronized with the original text document, leveraging Ohm's incremental parsing and transform capabilities. The challenge was efficiently identifying which nodes from the old parsed document were no longer present after an edit, without traversing the entire document, which would negate the benefits of incremental parsing.\n\nInitially, the approach mirrored tracing garbage collection by iterating over the entire new document to identify live nodes and determine the difference from the previous document's nodes.  However, inspired by \"A Unified Theory of Garbage Collection,\" which posits tracing and reference counting as dual approaches, the author implemented a reference counting mechanism.\n\nInstead of tracing live objects, they focused on \"anti-matter\" (dead objects). Upon creating a new document after an edit, the reference count of the old root node (and subsequently its children) is decremented recursively. This efficiently identifies the nodes no longer in use, allowing for targeted updates without needing to traverse the entire document. This reference counting approach mirrors a reference counting garbage collector and successfully addressed the performance bottleneck of the original implementation.\n",
    "chinese_title": "垃圾回收很有用",
    "chinese_summary": "此开发日志讲述了垃圾回收的知识，特别是论文《垃圾回收的统一理论》中的原则，如何被证明在解决与Ohm和ProseMirror增量解析相关的问题中是有用的。\n\n作者正在开发一个系统，该系统需要将ProseMirror中文本文档的编辑与原始文本文档同步，并利用Ohm的增量解析和转换功能。面临的挑战是如何有效地识别编辑后旧解析文档中不再存在的节点，而无需遍历整个文档，否则将抵消增量解析的好处。\n\n最初，该方法模仿追踪垃圾回收，通过迭代整个新文档来识别活动节点，并确定与先前文档节点的差异。然而，受到《垃圾回收的统一理论》的启发，该理论认为追踪和引用计数是对偶方法，作者实现了一种引用计数机制。\n\n他们没有追踪活动对象，而是专注于“反物质”（死亡对象）。在编辑后创建新文档时，旧根节点（以及随后的其子节点）的引用计数会递归地递减。这有效地识别了不再使用的节点，从而可以进行有针对性的更新，而无需遍历整个文档。这种引用计数方法模仿了引用计数垃圾收集器，并成功解决了原始实现中的性能瓶颈。"
  },
  {
    "id": "45947822",
    "title": "Linux mode setting, from the comfort of OCaml",
    "url": "https://roscidus.com/blog/blog/2025/11/16/libdrm-ocaml/",
    "summary": "This article introduces libdrm-ocaml, an OCaml library providing a more user-friendly interface to the Linux Kernel Mode Setting (KMS) API for configuring display settings. The author demonstrates how to use libdrm-ocaml interactively within a REPL (like utop) to query and modify display configurations.\n\nThe article walks through the process of discovering available graphics devices, listing resources like connectors, CRTCs (CRT Controllers), encoders, framebuffers, and CRTC planes. It details how to retrieve information about connected monitors, supported modes, and resource properties. The author explains the relationships between these resources, providing a simplified diagram for clarity.\n\nThe author showcases how to enable atomic mode setting to access additional properties, highlighting the importance of handling optional values using OCaml's `Option` type. They also explain how framebuffers provide image data to CRTCs and touch on the concept of CRTC planes, which allow combining multiple framebuffers for display.\n\nThe article briefly mentions making changes to the display configuration using non-atomic and atomic mode setting. It touches on using \"dumb buffers\" and alludes to 3D rendering using the API, indicating the potential for more advanced graphics manipulation. The article offers insight into the underlying KMS API, even for readers unfamiliar with OCaml. Finally, the author provides instructions on how to install and run the code examples.\n",
    "chinese_title": "用 OCaml 轻松设置 Linux 模式",
    "chinese_summary": "本文介绍 libdrm-ocaml，一个 OCaml 库，它为配置显示设置提供了一个更友好的 Linux 内核模式设置 (KMS) API 接口。作者演示了如何在 REPL (例如 utop) 中以交互方式使用 libdrm-ocaml 来查询和修改显示配置。\n\n本文介绍了发现可用图形设备、列出连接器、CRTC（CRT 控制器）、编码器、帧缓冲和 CRTC 平面等资源的过程。它详细介绍了如何检索有关已连接监视器、支持模式和资源属性的信息。作者解释了这些资源之间的关系，并提供了一个简化的图表以方便理解。\n\n作者展示了如何启用原子模式设置以访问其他属性，并强调了使用 OCaml 的 `Option` 类型处理可选值的重要性。他们还解释了帧缓冲如何向 CRTC 提供图像数据，并简要介绍了 CRTC 平面的概念，该概念允许组合多个帧缓冲进行显示。\n\n本文简要提到了使用非原子和原子模式设置来更改显示配置。它涉及使用“哑缓冲区”，并暗示使用该 API 进行 3D 渲染，表明其具有进行更高级图形操作的潜力。即使对于不熟悉 OCaml 的读者，本文也提供了对底层 KMS API 的深入了解。最后，作者提供了有关如何安装和运行代码示例的说明。"
  },
  {
    "id": "45936460",
    "title": "Our investigation into the suspicious pressure on Archive.today",
    "url": "https://adguard-dns.io/en/blog/archive-today-adguard-dns-block-demand.html",
    "summary": "This article details AdGuard DNS's investigation into suspicious pressure exerted on Archive.today (Archive.is). AdGuard was contacted by the Web Abuse Association Defense (WAAD), a newly formed French organization, demanding they block Archive.today due to alleged refusal to remove illegal content, threatening legal action under French law.\n\nSuspecting foul play, AdGuard contacted Archive.today directly, who promptly removed the cited content and claimed they had never received prior notifications. Archive.today also revealed a pattern of \"serial\" complaints targeting the site.\n\nAdGuard's investigation into WAAD revealed that the organization was recently registered, lacked substantial public information, and had a minimal online presence. Further, the \"bailiff reports\" provided by WAAD as evidence were mostly created in August 2025, not 2023 as claimed. However, two of the bailiff reports were ordered in 2023 by someone whose name matched a person Archive.today wrote about in 2024. In that case, the complaint came from what looked like a real lawyer - but the domain was registered on the same day the complaint was sent, containing only a redirect to the lawyer's page.\n\nAdGuard concludes that the complaints against Archive.today appear suspicious and potentially involve impersonation. They are filing an official complaint with the French police, citing the penalty for false reports under French law. The article also notes the timing of these events coincides with an FBI investigation into Archive.today, potentially related to CSAM, though no direct connection is confirmed.\n",
    "chinese_title": "对 Archive.today 可疑压力的调查",
    "chinese_summary": "AdGuard DNS调查Archive.today受可疑压力事件。AdGuard收到一个新成立的法国组织Web Abuse Association Defense (WAAD)的联系，对方要求其屏蔽Archive.today，理由是后者拒绝删除非法内容，并威胁将根据法国法律采取法律行动。\n\nAdGuard怀疑存在不正当行为，直接联系了Archive.today，后者迅速删除了引用的内容，并声称从未收到过事先通知。Archive.today还透露存在针对该网站的“连续”投诉模式。\n\nAdGuard对WAAD的调查显示，该组织最近才注册，缺乏实质性的公开信息，且在线存在感极低。此外，WAAD提供的作为证据的“执达吏报告”大多创建于2025年8月，而非声称的2023年。然而，有两份执达吏报告是2023年由某人订购的，此人的名字与Archive.today在2024年写到的人相符。在这种情况下，投诉似乎来自一位真正的律师，但该域名是在发送投诉的同一天注册的，仅包含一个重定向到律师页面的链接。\n\nAdGuard得出结论，针对Archive.today的投诉似乎存在可疑之处，可能涉及冒名顶替。他们正在向法国警方提起正式投诉，理由是根据法国法律对虚假报告的处罚。文章还指出，这些事件发生的时间恰逢FBI对Archive.today进行调查，可能与CSAM有关，但尚未确认直接联系。"
  },
  {
    "id": "45815948",
    "title": "Measuring the doppler shift of WWVB during a flight",
    "url": "https://greatscottgadgets.com/2025/10-31-receiving-wwvb-with-hackrf-pro/",
    "summary": "This article details the author's exploration of using the WWVB 60 kHz time signal as a frequency reference and a fun radio project. The author highlights the advantages of WWVB over alternatives like GPSDOs, including its indoor usability and simpler design. He also discusses the benefits of using HackRF Pro for this project, specifically its more accurate TCXO compared to HackRF One.\n\nThe article describes the design and development of \"Teewee,\" a small active loopstick antenna for receiving WWVB, and the challenges faced in mitigating interference, particularly from nearby electronic devices. The author explains the characteristics of the WWVB signal, including its ASK and BPSK modulation.\n\nThe most exciting part of the project involved measuring the Doppler shift of WWVB during a flight across Canada. By analyzing the captured WWVB frequency over time, the author was able to observe the Doppler effect caused by the aircraft's motion relative to the transmitter. Confirmation was achieved by correlating the observed Doppler shift with ADSB flight data, revealing a small frequency offset due to the HackRF Pro's TCXO. The author was unable to get the same data on the return flight due to interference from the avionics.\n\nThe author concludes by inviting readers to build their own Teewee antenna, emphasizing its compatibility with HackRF Pro and mentioning some limited success with HackRF One.\n",
    "chinese_title": "飞行中测量WWVB的多普勒频移",
    "chinese_summary": "本文详细介绍了作者探索使用WWVB 60 kHz时间信号作为频率参考和趣味无线电项目的过程。作者强调了WWVB相对于GPSDO等替代方案的优势，包括其室内可用性和更简单的设计。他还讨论了使用HackRF Pro进行此项目的优势，特别是其TCXO比HackRF One更准确。\n\n文章描述了“Teewee”的设计和开发，这是一种用于接收WWVB的小型有源环形天线，以及在减轻干扰（特别是来自附近电子设备的干扰）方面面临的挑战。作者解释了WWVB信号的特性，包括其ASK和BPSK调制。\n\n该项目最令人兴奋的部分是测量加拿大境内飞行期间WWVB的多普勒频移。通过分析捕获的WWVB随时间变化的频率，作者能够观察到飞机相对于发射器运动引起的多普勒效应。通过将观察到的多普勒频移与ADSB飞行数据相关联，确认了该效应，并揭示了由于HackRF Pro的TCXO引起的微小频率偏移。由于航空电子设备的干扰，作者无法在返程航班上获得相同的数据。\n\n作者最后邀请读者构建自己的Teewee天线，强调其与HackRF Pro的兼容性，并提到使用HackRF One取得的一些有限成功。"
  },
  {
    "id": "45952982",
    "title": "Goto Considered Harmless",
    "url": "https://bramadityaw.github.io/blog/posts/goto/",
    "summary": "This article, \"Goto Considered Harmless,\" challenges the long-held belief that `goto` statements are inherently bad programming practice, popularized by Edsger Dijkstra. The author argues that the historical context of Dijkstra's concerns is crucial and that modern programming languages mitigate the problems he highlighted.\n\nThe author references a video showcasing `goto` statements in the Linux kernel, defending their use with the argument that opinions about `goto` are often religious rather than technical. Dijkstra's original concern stemmed from the observation that excessive `goto` usage made code difficult to follow, hindering a programmer's ability to understand the execution flow. He advocated for structured programming with constructs like `if` and `while` to create a more predictable and traceable execution path.\n\nThe article's central point is that modern languages, unlike those available during Dijkstra's time, have restrictions on `goto` usage that address his concerns. Specifically, the author demonstrates with a C example that `goto` statements can only jump to labels within the same procedure, preventing the chaotic, unrestricted jumps Dijkstra feared. This limitation preserves procedural abstractions and allows for structured programming practices, even with the presence of `goto`. Therefore, the author concludes that `goto`, in its modern, constrained form, is no longer as harmful as it once was considered.\n",
    "chinese_title": "Goto 被认为无害",
    "chinese_summary": "\"Goto Considered Harmless\" 这篇文章挑战了埃德斯格·迪科斯彻推广的长期以来认为 `goto` 语句本质上是不良编程实践的观点。作者认为，迪科斯彻担忧的历史背景至关重要，并且现代编程语言减轻了他所强调的问题。\n\n作者引用了一个展示 Linux 内核中 `goto` 语句的视频，并辩称关于 `goto` 的观点通常是宗教式的而非技术性的，以此来捍卫它们的使用。迪科斯彻最初的担忧源于观察到过度使用 `goto` 会使代码难以理解，从而妨碍程序员理解执行流程的能力。他提倡使用结构化编程，使用 `if` 和 `while` 等结构来创建更可预测和可追踪的执行路径。\n\n文章的中心论点是，与迪科斯彻时代可用的语言不同，现代语言对 `goto` 的使用有限制，从而解决了他的担忧。具体来说，作者用一个 C 语言的例子证明，`goto` 语句只能跳转到同一过程中的标签，从而防止了迪科斯彻担心的混乱、不受限制的跳转。这种限制保留了过程抽象，并允许结构化编程实践，即使存在 `goto`。因此，作者得出结论，`goto` 以其现代的、受约束的形式，不再像曾经被认为的那样有害。"
  },
  {
    "id": "45947810",
    "title": "Open-source Zig book",
    "url": "https://www.zigbook.net",
    "summary": "This is a description of Zigbook, an open-source book designed to teach the Zig programming language. It emphasizes that learning Zig is more than just learning syntax; it's about adopting a new philosophy of software development. The book promises a transformative learning experience.\n\nKey aspects highlighted:\n\n*   **Focus:** Learning the Zig programming language and its underlying software development philosophy.\n*   **Approach:** Project-based learning.\n*   **Content:** The book contains 61 chapters.\n*   **Creation:** Written by @zigbookzsh.\n*   **\"Zero AI\":** Suggesting the content is human-written and not AI-generated.\n*   **Website:** zigbook.net.\n*   **Execution command:** `zig build zigbook`\n*   **Interaction:** Provides an interactive terminal environment for learning.\n",
    "chinese_title": "开源Zig书籍",
    "chinese_summary": "以下是关于Zigbook的介绍，它是一本开源书籍，旨在教授Zig编程语言。本书强调学习Zig不仅仅是学习语法，更重要的是采纳一种新的软件开发哲学。本书承诺带来一场变革性的学习体验。\n\n重点内容：\n\n*   **重点：** 学习Zig编程语言及其底层软件开发哲学。\n*   **方法：** 基于项目的学习。\n*   **内容：** 本书包含61章。\n*   **作者：** @zigbookzsh。\n*   **“零AI”：** 暗示内容由人工编写，而非AI生成。\n*   **网站：** zigbook.net。\n*   **执行命令：** `zig build zigbook`\n*   **互动：** 提供交互式终端环境以供学习。"
  },
  {
    "id": "45952672",
    "title": "The evolution of rationality: How chimps process conflicting evidence",
    "url": "https://arstechnica.com/science/2025/11/the-evolution-of-rationality-how-chimps-process-conflicting-evidence/",
    "summary": "This article explores research by Jan M. Engelmann and colleagues on the evolution of rationality, specifically how chimpanzees process conflicting evidence and revise their beliefs. The researchers conducted five experiments involving food puzzles to assess chimpanzees' ability to make rational decisions.\n\nThe initial experiments showed that chimps could change their choices based on new evidence, especially when weak initial evidence was followed by strong counter-evidence. Later experiments revealed more complex cognitive abilities. Chimpanzees considered all available options, demonstrating a basic understanding of evidence hierarchy. They also recognized redundant evidence, suggesting they create mental representations of the information. Most impressively, the final experiment demonstrated that chimpanzees could understand \"second-order evidence,\" recognizing when evidence might be misleading and adjusting their choices accordingly.\n\nAcross all experiments, the chimps followed the evidence significantly above chance, indicating a degree of rationality. Engelmann argues that rationality exists on a spectrum, with chimpanzees exhibiting rudimentary forms, and more advanced reflective rationality seen in chimps and potentially bonobos. While he believes humans possess a \"social rationality\" through collaborative discussion, he also acknowledges that social influences can sometimes lead to irrationality. Interestingly, preliminary research suggests chimpanzees are less susceptible to social irrationality, as they only follow the decisions of other chimps with superior evidence. The study provides crucial insight into the evolutionary origins of rational thought.\n",
    "chinese_title": "理性的演变：黑猩猩如何处理冲突证据",
    "chinese_summary": "本文探讨了Jan M. Engelmann及其同事关于理性进化的研究，特别是黑猩猩如何处理冲突证据并修正其信念。研究人员进行了五项涉及食物谜题的实验，以评估黑猩猩做出理性决策的能力。\n\n最初的实验表明，黑猩猩可以根据新的证据改变他们的选择，尤其是在微弱的初始证据之后出现强烈的反证时。后来的实验揭示了更复杂的认知能力。黑猩猩考虑了所有可用的选项，展示了对证据层级的基本理解。他们还认识到冗余证据，表明他们创建了信息的心理表征。最令人印象深刻的是，最后的实验表明黑猩猩可以理解“二阶证据”，认识到证据可能具有误导性，并相应地调整他们的选择。\n\n在所有实验中，黑猩猩遵循证据的程度显著高于偶然，表明存在一定程度的理性。Engelmann认为，理性存在于一个谱系中，黑猩猩表现出初级形式，而更高级的反射性理性则出现在黑猩猩以及可能倭黑猩猩身上。虽然他认为人类通过协作讨论拥有“社会理性”，但他也承认社会影响有时会导致非理性。有趣的是，初步研究表明黑猩猩不太容易受到社会非理性的影响，因为它们只遵循拥有更优证据的其他黑猩猩的决定。该研究为理性思维的进化起源提供了重要的见解。"
  },
  {
    "id": "45880643",
    "title": "\"Snarky\"; \"Snark\"",
    "url": "https://notoneoffbritishisms.com/2025/10/13/snarky-snark/",
    "summary": "This article explores the definition, etymology, and rise in popularity of the words \"snarky\" and \"snark.\" It begins by defining \"snarky\" as sarcastic, impertinent, or irreverent and \"snark\" as a noun or verb referring to mocking irreverence and sarcasm. The author notes a significant increase in the use of both words in recent decades, citing examples from the 1990s.\n\nThe piece then delves into the origins of the word \"snark.\" While some believe it stems from Lewis Carroll's poem, the article clarifies that it has roots in Scottish and Shetland dialects, where \"snark\" meant to snore, fret, or grumble. It also notes a connection to \"nark,\" meaning an annoying person. The first cited uses of \"snark\" as a verb and \"snarky\" as an adjective are traced back to the early 20th century writings of E. Nesbit. Further British examples from the early 1900s are cited, before the word crossed the Atlantic to appear in American literature around 1915.\n\nThe article specifies that \"snark\" as a noun didn't emerge until the late 1980s. Finally, it suggests that the recent popularity of \"snarky\" may be due to its sound resembling a combination of \"sarcastic\" and \"snarl,\" aligning with the current cultural climate.\n",
    "chinese_title": "讽刺",
    "chinese_summary": "本文探讨了“snarky”和“snark”这两个词的定义、词源以及流行度的上升。文章首先将“snarky”定义为讽刺的、无礼的或不敬的，而“snark”则作为名词或动词，指代嘲弄的不敬和讽刺。作者指出，近几十年来，这两个词的使用量显著增加，并引用了20世纪90年代的例子。\n\n接下来，文章深入研究了“snark”一词的起源。虽然有些人认为它源于刘易斯·卡罗尔的诗歌，但文章澄清说，它起源于苏格兰和设得兰群岛的方言，在这些方言中，“snark”的意思是打鼾、烦躁或抱怨。文章还指出了它与“nark”（意为讨厌的人）的联系。文章追溯了“snark”作为动词和“snarky”作为形容词的首次使用，均可追溯到20世纪初伊迪丝·内斯比特的作品中。文章还引用了20世纪初的其他英国例子，之后该词跨越大西洋，大约在1915年出现在美国文学作品中。\n\n文章明确指出，“snark”作为名词直到20世纪80年代后期才出现。最后，文章认为“snarky”最近的流行可能归因于其发音类似于“sarcastic”（讽刺的）和“snarl”（咆哮）的组合，与当前的文化氛围相符。"
  },
  {
    "id": "45936999",
    "title": "Lithium vs. Lettuce",
    "url": "https://ambrook.com/offrange/photo-essay/lithium-v-lettuce",
    "summary": "This article explores the looming conflict between agriculture and lithium mining in California's Imperial Valley, a region that produces a significant portion of the US's winter produce. The Imperial Valley, despite its agricultural productivity, faces economic challenges like high unemployment.\n\nThe valley's agricultural success is attributed to the All-American Canal, providing on-demand water. However, it's also home to the Salton Sea, an ecological disaster caused by agricultural runoff. Farmers like Trevor Tagg struggle with rising costs and regulations, leading to farm closures and a lack of young people entering the industry. He laments the decline of agriculture due to California's policies.\n\nMeanwhile, the region is on the cusp of a lithium mining boom, with companies like Controlled Thermal Resources (CTR) aiming to extract lithium from geothermal brine beneath the Salton Sea. This \"white gold rush\" has the potential to transform the region's economy, but also raises concerns about the impact on existing industries and the labor market, as exemplified by beekeeper Bryan Ashurst's concerns.\n\nWhile lithium mining promises economic benefits and cleaner extraction methods (like CTR's closed-loop system), uncertainty remains regarding its impact on the local community, water resources, and the future of Imperial Valley's agricultural heritage. The article highlights the tension between feeding the nation and fueling the electric vehicle revolution, questioning whether both can coexist sustainably in this unique desert landscape.\n",
    "chinese_title": "锂与莴苣",
    "chinese_summary": "加州帝王谷：农业与锂矿开采的潜在冲突"
  },
  {
    "id": "45944906",
    "title": "Vintage Large Language Models",
    "url": "https://owainevans.github.io/talk-transcript.html",
    "summary": "This article introduces the concept of \"Vintage Large Language Models\" (LLMs), which are LLMs trained on data available only up to a specific historical date. The author argues that these models offer valuable opportunities for scientific, epistemic, and humanistic explorations.\n\nScientifically, vintage LLMs can be used to backtest forecasting methods and explore the potential for AI-driven scientific invention. By training a model on data up to a certain date (e.g., 2019 or 1600), researchers can assess its ability to predict subsequent events or reinvent known inventions based on available historical knowledge.\n\nHumanistically, vintage LLMs can simulate conversations with people from the past, offering a unique interactive experience and a new perspective on historical knowledge. Furthermore, these models can explore counterfactual intellectual histories by combining knowledge from different cultures or examining the surprisingness of historical breakthroughs.\n\nThe article acknowledges significant challenges in creating vintage LLMs, including the need for massive, contamination-free datasets and the high cost of training. Solutions discussed include leveraging synthetic data to augment limited historical datasets, chronological training with forking to reduce training costs, and outsourcing functions to contemporary LLMs while preventing information leakage. Compartmentalized LLMs, trained on all data but with date annotations, are also proposed as a complementary approach.\n\nIn conclusion, the concept of vintage LLMs presents a unique avenue for exploring the development of knowledge over time and testing AI capabilities in a historical context, offering exciting possibilities for both scientific and humanistic research.\n",
    "chinese_title": "复古大型语言模型",
    "chinese_summary": "本文介绍了“复古大型语言模型”(LLMs)的概念，该模型是在仅截至特定历史日期的数据上训练的 LLMs。作者认为，这些模型为科学、认知和人文探索提供了宝贵的机会。\n\n在科学方面，复古 LLMs 可用于回溯测试预测方法，并探索人工智能驱动的科学发明的潜力。通过在截至特定日期（例如，2019年或1600年）的数据上训练模型，研究人员可以评估其预测后续事件或根据可用的历史知识重新发明已知发明的能力。\n\n在人文方面，复古 LLMs 可以模拟与过去人物的对话，提供独特的互动体验和对历史知识的新视角。此外，这些模型可以通过结合来自不同文化的知识或检查历史突破的惊人程度来探索反事实的知识史。\n\n文章承认创建复古 LLMs 存在重大挑战，包括需要海量、无污染的数据集以及高昂的训练成本。讨论的解决方案包括利用合成数据来扩充有限的历史数据集、使用分叉进行按时间顺序的训练以降低训练成本，以及将功能外包给当代 LLMs，同时防止信息泄露。在所有数据上训练但带有日期注释的隔离式 LLMs 也被提出作为一种补充方法。\n\n总之，复古 LLMs 的概念为探索知识随时间的演变以及在历史背景下测试人工智能能力提供了一条独特的途径，为科学和人文研究提供了令人兴奋的可能性。"
  },
  {
    "id": "45947633",
    "title": "The government has no plan for America’s 300 billion pennies",
    "url": "https://www.theatlantic.com/ideas/2025/11/pennies-circulation-mint/684935/",
    "summary": "Caity Weaver's article, \"The government has no plan for America’s 300 billion pennies,\" explores the surprising and seemingly unplanned cessation of penny production in the United States. Despite the U.S. Mint stopping the minting of pennies, there's no strategy for dealing with the estimated 300 billion pennies already in circulation.\n\nWeaver, who previously researched the costly and illogical persistence of penny production, reveals that the decision to stop minting pennies was made without considering the consequences. The government hasn't provided any guidance on how cash transactions will work without pennies, nor does it have a plan to remove existing pennies from circulation.\n\nThe author contrasts this lack of planning with Canada's smooth phasing out of its penny, which included a public information campaign, recycling initiatives, and redemption for face value. U.S. pennies, primarily made of zinc, pose recycling challenges due to zinc's low value and the toxic smelting process.\n\nWeaver highlights the psychological burden of pennies, which are often unused and represent an environmental hazard. The government's inaction mirrors its historical approach of making pennies \"Americans' problem.\" The article concludes with the alarming possibility that the Mint could resume penny production in the future, perpetuating the \"Perpetual Penny Paradox.\"\n",
    "chinese_title": "政府对美国3000亿枚便士没有计划",
    "chinese_summary": "凯蒂·韦弗的文章《政府对美国三千亿枚便士毫无计划》探讨了美国出人意料且似乎未经计划的停止生产便士的行为。尽管美国铸币局已经停止铸造便士，但对于如何处理估计已在流通中的3000亿枚便士，却没有任何策略。\n\n韦弗此前曾研究过便士生产的昂贵和不合逻辑的持续性，她揭示了停止铸造便士的决定是在没有考虑后果的情况下做出的。政府没有就如何在没有便士的情况下进行现金交易提供任何指导，也没有计划将现有的便士从流通中移除。\n\n作者将这种缺乏计划的做法与加拿大平稳淘汰便士的做法进行了对比，后者包括公众宣传活动、回收计划和按面值兑换。美国的便士主要由锌制成，由于锌的价值较低以及有毒的冶炼过程，给回收带来了挑战。\n\n韦弗强调了便士的心理负担，它们经常未被使用，并代表着一种环境危害。政府的不作为反映了其历史上让便士成为“美国人的问题”的做法。文章以铸币局未来可能恢复便士生产的令人担忧的可能性作为结尾，这将使“永久便士悖论”永久存在。"
  },
  {
    "id": "45945750",
    "title": "De Bruijn Numerals",
    "url": "https://text.marvinborner.de/2023-08-22-22.html",
    "summary": "This article introduces \"de Bruijn numerals,\" a novel encoding of natural numbers in pure lambda calculus using nested de Bruijn indices: `<n>_d = λ^{S(n)}n`. While elegant, these numerals, like other encodings of the form `λ^{k_n}E_n` where `k_n` increases indefinitely with `n`, lack an \"adequate\" numeral system, specifically, a zero? function. This limitation prevents direct conversion to other numeral systems.\n\nDespite this drawback, the article explores arithmetic operations with de Bruijn numerals. The successor (`succ`) and predecessor (`pred`) functions are defined and proven, along with a self-contained addition function (`add`) that leverages de Bruijn shifting in an elegant way. The article also discusses how to combine de Bruijn numerals with Church numerals, defining a conversion function and demonstrating multiplication.\n\nA key practical application is presented in handling Church n-tuples. De Bruijn numerals provide a method for element selection in tuples without needing an increasing number of abstractions. This allows for functions like `push`, `pop`, and `move` which are difficult to implement directly with Church lists. The article concludes by emphasizing the potential for discovering new operations for de Bruijn numerals and referencing a Forth-like language implementation using this tuple encoding. Ultimately, while not a universally convertible numeral system, de Bruijn numerals offer unique advantages in specific lambda calculus manipulations.\n",
    "chinese_title": "德布鲁因数",
    "chinese_summary": "本文介绍了“de Bruijn数”，这是一种使用嵌套de Bruijn索引在纯lambda演算中对自然数进行的新颖编码：`<n>_d = λ^{S(n)}n`。 虽然很优雅，但这些数，像其他形式为`λ^{k_n}E_n`的编码（其中`k_n`随着`n`无限增加）一样，缺乏一个“充分”的数制，具体来说，缺乏一个zero?函数。 这种限制阻碍了直接转换为其他数制。\n\n尽管有这个缺点，本文探讨了de Bruijn数的算术运算。 定义并证明了后继（`succ`）和前驱（`pred`）函数，以及一个以优雅的方式利用de Bruijn移位的自包含加法函数（`add`）。 本文还讨论了如何将de Bruijn数与Church数结合，定义了一个转换函数并演示了乘法。\n\n一个关键的实际应用是处理Church n-元组。 De Bruijn数提供了一种在元组中选择元素的方法，而无需增加抽象的数量。 这使得像`push`，`pop`和`move`这样的函数成为可能，而这些函数很难直接用Church列表实现。 本文最后强调了发现de Bruijn数的新运算的潜力，并引用了一种使用这种元组编码的类似Forth的语言实现。 最终，虽然不是一个普遍可转换的数制，但de Bruijn数在特定的lambda演算操作中提供了独特的优势。"
  },
  {
    "id": "45885410",
    "title": "Waiting for SQL:202y: Group by All",
    "url": "http://peter.eisentraut.org/blog/2025/11/11/waiting-for-sql-202y-group-by-all",
    "summary": "This article discusses the proposed \"GROUP BY ALL\" feature in the upcoming SQL:202y standard, designed to simplify `GROUP BY` clauses in SQL queries. The author argues that manually specifying columns in `GROUP BY` is often redundant and error-prone, particularly when the select list clearly indicates the grouping columns.\n\n`GROUP BY ALL` automatically groups by all non-aggregate columns in the `SELECT` statement. For instance, `SELECT a, avg(b) FROM t1 GROUP BY ALL;` becomes `SELECT a, avg(b) FROM t1 GROUP BY a;`.\n\nThe article highlights the limitations: `GROUP BY ALL` only handles cases where grouping is straightforward and avoids ambiguity when aggregate functions are mixed with other ungrouped columns. It explicitly doesn't address complex scenarios where the desired grouping is unclear, leaving it to the user to specify.\n\nThe author warns about potential risks similar to `SELECT *`, where adding columns to the select list can inadvertently change the grouping behavior. Therefore, caution and thoughtful application, especially in complex queries, are advised.\n\nSeveral database systems, including Oracle, PostgreSQL, Databricks, DuckDB, BigQuery, and Snowflake, have already implemented or are planning to implement `GROUP BY ALL`. Oracle also played a key role in the standard proposal. PostgreSQL implemented it rapidly after the standardization decision.\n",
    "chinese_title": "等待SQL:202y：全部按组分组",
    "chinese_summary": "本文探讨了即将到来的 SQL:202y 标准中提议的 \"GROUP BY ALL\" 特性，该特性旨在简化 SQL 查询中的 `GROUP BY` 子句。作者认为，手动在 `GROUP BY` 中指定列通常是冗余且容易出错的，尤其是在选择列表清楚地指示分组列时。\n\n`GROUP BY ALL` 自动按 `SELECT` 语句中的所有非聚合列进行分组。 例如，`SELECT a, avg(b) FROM t1 GROUP BY ALL;` 变为 `SELECT a, avg(b) FROM t1 GROUP BY a;`。\n\n本文强调了其局限性：`GROUP BY ALL` 仅处理分组简单的情况，并避免在聚合函数与其他未分组列混合时出现歧义。它明确不处理所需的 grouping 不明确的复杂场景，而是留给用户来指定。\n\n作者警告了与 `SELECT *` 类似的潜在风险，即向选择列表添加列可能会无意中改变分组行为。 因此，建议谨慎和周全地应用，尤其是在复杂的查询中。\n\n包括 Oracle、PostgreSQL、Databricks、DuckDB、BigQuery 和 Snowflake 在内的多个数据库系统已经实施或计划实施 `GROUP BY ALL`。 Oracle 也在标准提案中发挥了关键作用。 PostgreSQL 在标准化决定后迅速实施了它。"
  },
  {
    "id": "45948463",
    "title": "Call Me Maybe: Eavesdropping encrypted LTE calls with ReVoLTE (2020)",
    "url": "https://montsecure.com/research/revolte-attack/",
    "summary": "The 2020 paper \"Call Me Maybe: Eavesdropping Encrypted LTE Calls With ReVoLTE\" details a vulnerability in the LTE network protocol that allows attackers to eavesdrop on encrypted phone calls. Researchers from Ruhr-Universität Bochum and New York University Abu Dhabi discovered and exploited a logical flaw related to the reuse of keystream in the LTE encryption.\n\nThe core problem lies in how the confidentiality keys (KeNB) are derived and managed in LTE. The researchers demonstrated that in certain scenarios, particularly after handover procedures between base stations, the same KeNB value can be reused for multiple connections. This, in turn, leads to the reuse of the keystream used for encryption, compromising the confidentiality of the call.\n\nThe researchers developed a tool called ReVoLTE to automate the exploitation of this vulnerability. ReVoLTE allows attackers to passively monitor LTE traffic, identify when keystream reuse occurs, and decrypt the subsequent encrypted voice data. The paper showcases practical attacks demonstrating the feasibility of eavesdropping on real-world LTE calls.\n\nThe findings highlighted a critical security weakness in the LTE standard implementation, raising concerns about the privacy and security of cellular communications. The researchers provided recommendations to mitigate the vulnerability, focusing on improving the KeNB derivation process to prevent keystream reuse and enhance overall security. The research emphasized the importance of thorough security analysis and testing in modern communication protocols to safeguard against potential eavesdropping attacks.\n",
    "chinese_title": "也许呼叫我：使用ReVoLTE窃听加密LTE通话 (2020)",
    "chinese_summary": "2020年论文《叫我可能：使用ReVoLTE窃听加密的LTE通话》详细介绍了LTE网络协议中的一个漏洞，该漏洞允许攻击者窃听加密的电话通话。来自波鸿鲁尔大学和纽约大学阿布扎比分校的研究人员发现并利用了与LTE加密中密钥流重用相关的逻辑缺陷。\n\n核心问题在于LTE中保密密钥（KeNB）的推导和管理方式。研究人员证明，在某些情况下，特别是在基站之间的切换过程之后，同一个KeNB值可能会被多个连接重用。这反过来会导致用于加密的密钥流的重用，从而损害通话的保密性。\n\n研究人员开发了一种名为ReVoLTE的工具来自动利用此漏洞。ReVoLTE允许攻击者被动地监控LTE流量，识别密钥流重用何时发生，并解密后续加密的语音数据。该论文展示了实际攻击，证明了窃听真实世界LTE通话的可行性。\n\n这些发现突显了LTE标准实施中的一个关键安全弱点，引发了人们对蜂窝通信的隐私和安全的担忧。研究人员提出了缓解该漏洞的建议，重点是改进KeNB推导过程，以防止密钥流重用并提高整体安全性。该研究强调了在现代通信协议中进行彻底的安全分析和测试的重要性，以防止潜在的窃听攻击。"
  },
  {
    "id": "45947374",
    "title": "Decoding Leibniz Notation (2024)",
    "url": "https://www.spakhm.com/leibniz",
    "summary": "Slava Akhmechet's \"Decoding Leibniz Notation\" aims to clarify the often-confusing Leibniz notation for derivatives. The author begins with the historical motivation, explaining Leibniz's concept of infinitesimally small quantities represented by 'dx' and 'df(x)', where the derivative is seen as their quotient. However, 'dx' is not a value that can be canceled but rather an operator.\n\nThe article then transitions to the modern interpretation, where df(x)/dx is treated as a single symbol representing the derivative function f', not a quotient. It emphasizes that no actual division occurs.\n\nThe author delves into the representation of the second derivative in Leibniz notation, highlighting the algebraic liberties taken for convenience, like writing d²f(x)/dx² instead of the more verbose d(df(x)/dx)/dx. He points out that dx² is not (dx)² literally, but a symbolic representation of the second derivative process, and d² is not squaring d.\n\nThe piece further explores common liberties and ambiguities in the notation, especially concerning evaluating the derivative at a specific point 'a'. He notes the common practice of omitting the \"x=a\" part of the notation (df(x)/dx | x=a) and simplifying df(x)/dx to df/dx, even though these substitutions are technically incorrect.\n\nFinally, the article discusses the even greater liberties taken by scientists and engineers, who often implicitly treat variables as functions of time and manipulate the notation accordingly, as seen in related rates problems. The author recommends practical problem-solving as the best way to understand this usage.\n",
    "chinese_title": "莱布尼茨记号解读 (2024)",
    "chinese_summary": "Slava Akhmechet 的《解读莱布尼茨记号》旨在阐明常令人困惑的导数莱布尼茨记号。作者首先从历史动机入手，解释了莱布尼茨关于无穷小量的概念，即用“dx”和“df(x)”表示，其中导数被视为它们的商。然而，“dx”并不是一个可以被约分的值，而是一个算子。\n\n文章随后过渡到现代解释，将 df(x)/dx 视为代表导函数 f' 的单一符号，而不是一个商。它强调实际上并没有发生除法。\n\n作者深入探讨了莱布尼茨记号中二阶导数的表示方法，强调了为了方便而采取的代数自由，例如用 d²f(x)/dx² 代替更冗长的 d(df(x)/dx)/dx。他指出，dx² 并非字面意义上的 (dx)²，而是二阶导数过程的符号表示，而 d² 并非 d 的平方。\n\n文章进一步探讨了该记号中常见的自由性和模糊性，特别是关于在特定点“a”处评估导数。他注意到省略记号 (df(x)/dx | x=a) 中“x=a”部分的常见做法，并将 df(x)/dx 简化为 df/dx，即使这些替换在技术上是不正确的。\n\n最后，文章讨论了科学家和工程师们所采取的更大的自由，他们经常隐含地将变量视为时间的函数并相应地操纵该记号，如在相关变化率问题中所见。作者建议通过实际解决问题作为理解这种用法的最佳途径。"
  },
  {
    "id": "45820358",
    "title": "Shell Grotto, Margate",
    "url": "https://en.wikipedia.org/wiki/Shell_Grotto,_Margate",
    "summary": "The Shell Grotto in Margate, Kent, is an ornate underground structure adorned with approximately 4.6 million seashells, covering about 2,000 square feet of mosaic. Discovered around 1835 and opened to the public in 1837, the grotto's age, creators, and purpose remain unknown, sparking numerous theories ranging from a rich man's folly to a connection with ancient societies.\n\nThe structure consists of a winding passageway leading to a rectangular chamber, both meticulously decorated with shells like mussels, cockles, whelks, and limpets. While most shells are local, some may have been sourced from further afield.\n\nThe grotto's origin is debated, with possibilities including a medieval chalk mine reworked in the 17th or 18th century. Over the years, it has faced challenges such as damage from World War II and water penetration. It is currently a Grade I-listed building and tourist attraction featuring a museum, cafe, and gift shop.\n\nEfforts to preserve the grotto include the formation of the Friends of the Shell Grotto and restoration projects in partnership with Historic England. It has also been featured in novels and other cultural depictions.\n",
    "chinese_title": "马盖特贝壳岩洞",
    "chinese_summary": "马盖特贝壳岩洞，肯特郡，是一个装饰华丽的地下建筑，镶嵌着大约460万个贝壳，覆盖了约2000平方英尺的马赛克。岩洞大约在1835年被发现，于1837年向公众开放，其年代、建造者和目的仍然未知，引发了众多理论，从富人的心血来潮到与古代社会的联系。\n\n该结构由一条通往矩形房间的蜿蜒通道组成，两者都用贻贝、鸟蛤、峨螺和帽贝等贝壳精心装饰。虽然大多数贝壳是当地的，但有些可能来自更远的地方。\n\n岩洞的起源尚有争议，可能性包括在17或18世纪改建的中世纪白垩矿。多年来，它面临着挑战，如二战造成的破坏和渗水。目前它是一级保护建筑和旅游景点，设有博物馆、咖啡馆和礼品店。\n\n保护岩洞的努力包括成立贝壳岩洞之友协会，以及与英格兰历史建筑及古迹委员会合作的修复项目。它还出现在小说和其他文化作品中。"
  },
  {
    "id": "45944337",
    "title": "Brimstone: ES2025 JavaScript engine written in Rust",
    "url": "https://github.com/Hans-Halverson/brimstone",
    "summary": "Brimstone is a new JavaScript engine written in Rust, aiming for full ECMAScript compatibility. Currently a work in progress, it boasts >97% compliance with the test262 test suite and incorporates features up to ES2024, as well as Stage 4 proposals from the Feb. 2025 TC39 meeting.\n\nKey features include a bytecode VM inspired by V8's Ignition, a compacting garbage collector (written with unsafe Rust), a custom RegExp engine, and a custom parser. Brimstone is designed with minimal external dependencies, using ICU4X for internationalization.\n\nWhile not yet production-ready, Brimstone can be built and run using standard `cargo` commands. JavaScript files are executed via the `bs` executable. Testing relies heavily on integration test suites, especially test262, with a custom test runner available via `cargo brimstone-test`. Unit and snapshot tests use `cargo test`.\n\nThe engine currently lacks support for SharedArrayBuffer and Atomics.\n",
    "chinese_title": "硫磺石：用 Rust 编写的 ES2025 JavaScript 引擎",
    "chinese_summary": "硫磺火 (Brimstone) 是一个用 Rust 编写的全新 JavaScript 引擎，旨在实现完全的 ECMAScript 兼容性。目前仍在开发中，它拥有超过 97% 的 test262 测试套件兼容性，并整合了高达 ES2024 的特性，以及来自 2025 年 2 月 TC39 会议的 Stage 4 提案。\n\n主要特性包括一个受 V8 的 Ignition 启发的字节码 VM、一个压缩垃圾收集器（使用 unsafe Rust 编写）、一个自定义 RegExp 引擎和一个自定义解析器。硫磺火 (Brimstone) 的设计尽可能减少外部依赖，并使用 ICU4X 进行国际化。\n\n虽然尚未准备好用于生产环境，但可以使用标准的 `cargo` 命令构建和运行硫磺火 (Brimstone)。JavaScript 文件通过 `bs` 可执行文件执行。测试主要依赖于集成测试套件，尤其是 test262，通过 `cargo brimstone-test` 提供自定义测试运行器。单元和快照测试使用 `cargo test`。\n\n该引擎目前缺少对 SharedArrayBuffer 和 Atomics 的支持。"
  },
  {
    "id": "45860516",
    "title": "Show HN: Spam classifier in Go using Naive Bayes",
    "url": "https://github.com/igomez10/nspammer",
    "summary": "This \"Show HN\" post introduces `nspammer`, a Go implementation of a Naive Bayes spam classifier. The library enables text classification by training on labeled datasets (spam/not spam) and classifying new messages. It uses the Naive Bayes algorithm with Laplace smoothing to handle unseen words and zero probabilities.\n\nKey features include a simple API for training and classification, with functions `NewSpamClassifier` and `Classify`. The post provides a basic usage example demonstrating how to create a classifier, train it on a small dataset, and classify a new message.\n\nThe post explains the Naive Bayes algorithm used: calculating prior probabilities, building a vocabulary, counting word occurrences, and using log probabilities to avoid underflow during classification. Laplace smoothing, using the formula `P(word|class) = (count + α) / (total + α × vocabulary_size)`, addresses the issue of unseen words.\n\nThe library includes support for the Kaggle Spam Mails Dataset, downloadable using the `./init.sh` script (requiring Kaggle CLI).  The post also details how to run the test suite (`go test -v`), which includes simple examples, real-world dataset evaluation, and accuracy measurements.\n",
    "chinese_title": "Show HN：用朴素贝叶斯算法实现的Go语言垃圾邮件分类器",
    "chinese_summary": "此“Show HN”帖子介绍`nspammer`，一个用Go语言实现的朴素贝叶斯垃圾邮件分类器。该库通过在带标签的数据集（垃圾邮件/非垃圾邮件）上训练，并对新消息进行分类，来实现文本分类。它使用带有拉普拉斯平滑的朴素贝叶斯算法来处理未见过的单词和零概率。\n\n主要功能包括一个简单的API用于训练和分类，包含`NewSpamClassifier`和`Classify`函数。帖子提供了一个基本的使用示例，演示了如何创建一个分类器，在一个小型数据集上训练它，以及如何分类一条新消息。\n\n帖子解释了所使用的朴素贝叶斯算法：计算先验概率，构建词汇表，统计词语出现次数，并使用对数概率来避免分类期间的下溢。拉普拉斯平滑，使用公式`P(word|class) = (count + α) / (total + α × vocabulary_size)`，解决了未见过的单词的问题。\n\n该库包含对Kaggle垃圾邮件数据集的支持，可以使用`./init.sh`脚本下载（需要Kaggle CLI）。 帖子还详细介绍了如何运行测试套件（`go test -v`），其中包括简单的例子、真实世界数据集评估以及准确性测量。"
  },
  {
    "id": "45938785",
    "title": "Trellis AI (YC W24) Is Hiring: Streamline access to life-saving therapies",
    "url": "https://www.ycombinator.com/companies/trellis-ai/jobs/f4GWvH0-forward-deployed-engineer-full-time",
    "summary": "Trellis AI, a Y Combinator W24 startup, is hiring a Forward Deployed Engineer to help streamline healthcare paperwork and accelerate patient access to life-saving therapies. They use AI agents to automate document intake, prior authorizations, and appeals, processing billions of dollars in therapies annually across all 50 states. Think of them as the \"Stripe of healthcare billing and reimbursements.\"\n\nThe role involves designing and implementing AI systems for healthcare decision-making, building 24/7 AI co-workers, and developing production-grade AI systems within their evaluation suite.\n\nTrellis seeks candidates with full-stack development experience, expertise in Python, Go, ML/NLP libraries (PyTorch, TensorFlow, Transformers), and relational/non-relational databases (especially Postgres). Proactivity, fast-learning ability, and experience with data/ML infrastructure are essential. Open source contributions and cloud platform/containerization (AWS, Azure, GCP, Docker, Kubernetes) experience are a plus.\n\nTrellis highlights real impact, working with industry experts, being at the forefront of AI in healthcare, direct customer engagement, extreme ownership, a world-class team, and incredible growth (10x revenue increase recently). Trellis AI aims to reduce time to treatment (by over 90%), improve approval and reimbursement rates, and enhance drug program performance. Founded in 2024 with a team of 25, Trellis automates healthcare paperwork using AI trained on millions of clinical data points.\n",
    "chinese_title": "Trellis AI (YC W24) 招聘：简化救生疗法的获取途径",
    "chinese_summary": "Trellis AI，一家 Y Combinator W24 孵化的初创公司，正在招聘一名前置部署工程师，以帮助简化医疗保健文书工作并加速患者获得救生疗法。他们使用人工智能代理来自动化文档录入、事先授权和申诉，每年处理价值数十亿美元的疗法，覆盖美国所有 50 个州。可以把他们看作是“医疗保健账单和报销领域的 Stripe”。\n\n该职位涉及设计和实施用于医疗保健决策的人工智能系统，构建 24/7 全天候人工智能同事，以及在其评估套件中开发生产级人工智能系统。\n\nTrellis 正在寻找具有全栈开发经验、精通 Python、Go、机器学习/自然语言处理库（PyTorch、TensorFlow、Transformers）以及关系/非关系数据库（尤其是 Postgres）的候选人。积极主动、快速学习能力以及数据/机器学习基础设施经验至关重要。开源贡献和云平台/容器化（AWS、Azure、GCP、Docker、Kubernetes）经验是加分项。\n\nTrellis 强调实际影响、与行业专家合作、走在医疗保健人工智能前沿、直接客户互动、高度责任感、世界一流的团队以及令人难以置信的增长（近期收入增长了 10 倍）。 Trellis AI 旨在缩短治疗时间（超过 90%）、提高批准和报销率并增强药物计划的性能。 Trellis 成立于 2024 年，拥有一支 25 人的团队，利用基于数百万临床数据点训练的人工智能来自动化医疗保健文书工作。"
  },
  {
    "id": "45949247",
    "title": "Goldman Sachs asks in biotech Report: Is curing patients a sustainable business? (2018)",
    "url": "https://www.cnbc.com/2018/04/11/goldman-asks-is-curing-patients-a-sustainable-business-model.html",
    "summary": "In a 2018 report titled \"The Genome Revolution,\" Goldman Sachs analysts questioned the long-term sustainability of gene therapy companies that aim to cure diseases with \"one-shot\" treatments. Analyst Salveen Richter noted that while cures are beneficial for patients and society, they could pose a challenge to biotech firms seeking sustained revenue streams, as they disrupt the recurring revenue model typical of chronic therapies.\n\nThe report cited Gilead Sciences' hepatitis C treatments as a case study. While achieving high cure rates and generating peak sales of $12.5 billion in 2015, sales subsequently declined as the treatable patient pool dwindled. The report also points out that cures for infectious diseases reduce transmission, further shrinking the potential patient base. Cancer, where the incident pool remains more stable, presents less of a sustainability risk for cure-based therapies.\n\nTo address this potential challenge, the report suggested three strategies for biotech companies: focusing on large markets like hemophilia, targeting disorders with high incidence rates like spinal muscular atrophy, and emphasizing constant innovation and portfolio expansion to offset declining revenues from previous cure-based treatments.\n",
    "chinese_title": "高盛生物科技报告发问：治愈病人是可持续的生意吗？(2018)",
    "chinese_summary": "高盛在2018年一份题为《基因组革命》的报告中，分析师质疑了旨在用“一次性”疗法治愈疾病的基因治疗公司能否实现长期可持续发展。分析师Salveen Richter指出，虽然治愈对患者和社会有益，但它们可能会对寻求持续收入来源的生物科技公司构成挑战，因为它们颠覆了慢性疗法典型的重复性收入模式。\n\n该报告引用吉利德科学公司的丙型肝炎疗法作为案例研究。虽然实现了高治愈率，并在2015年创造了125亿美元的峰值销售额，但随着可治疗患者群体的减少，销售额随后下降。该报告还指出，传染病的治愈会减少传播，进一步缩小潜在的患者群体。癌症的发病率相对稳定，因此基于治愈疗法的可持续性风险较小。\n\n为了应对这一潜在挑战，该报告为生物科技公司提出了三项策略：关注像血友病这样的大型市场，瞄准像脊髓性肌萎缩症这样高发病率的疾病，以及强调持续创新和投资组合扩张，以抵消先前基于治愈疗法所带来的收入下降。"
  },
  {
    "id": "45947444",
    "title": "What if you don't need MCP at all?",
    "url": "https://mariozechner.at/posts/2025-11-02-what-if-you-dont-need-mcp/",
    "summary": "This article argues against the over-reliance on monolithic MCP (Multi-Tool Calling Protocol) servers for agentic tasks, particularly for browser automation. The author proposes a simpler, more composable approach using Bash scripts and Puppeteer Core.\n\nThe core idea is that agents can effectively utilize existing knowledge of code and Bash to interact with the browser using minimal, purpose-built tools. Instead of using large MCP servers like Playwright MCP or Chrome DevTools MCP, which have many tools and consume a significant amount of context tokens, the author suggests a small set of tools: start the browser, navigate to a URL, execute JavaScript, and take a screenshot.\n\nThe author provides the code for these tools, demonstrating their simplicity. The advantages of this approach include: reduced context usage (the README describing the tools is much smaller than MCP server descriptions), improved composability (agents can save outputs to files for later processing), easier customization, and the ability to easily add new tools.\n\nAs an example of adding a new tool, the article demonstrates how to add a \"Pick\" tool for interactive element selection using only a handful of code. This allows humans to directly point out elements for the agent to interact with, simplifying tasks like web scraping. The author emphasizes that this approach mirrors the benefits of Anthropic's skills system, offering progressive disclosure and making tools accessible through simple instructions.\n",
    "chinese_title": "如果根本不需要MCP呢？",
    "chinese_summary": "本文反对过度依赖于单体MCP（多工具调用协议）服务器来执行智能体任务，尤其是在浏览器自动化方面。作者提出了一种更简单、更具可组合性的方法，即使用Bash脚本和Puppeteer Core。\n\n其核心思想是，智能体可以有效地利用已有的代码和Bash知识，通过最少且专门构建的工具与浏览器进行交互。作者建议使用一组小型工具，而不是使用大型MCP服务器（如Playwright MCP或Chrome DevTools MCP，它们拥有许多工具并消耗大量的上下文tokens）：启动浏览器、导航到URL、执行JavaScript以及截取屏幕截图。\n\n作者提供了这些工具的代码，展示了它们的简洁性。这种方法的优点包括：减少上下文使用量（描述这些工具的README远小于MCP服务器的描述），提高可组合性（智能体可以将输出保存到文件中以供后续处理），更容易定制，以及能够轻松添加新工具。\n\n作为添加新工具的示例，本文演示了如何仅用少量代码添加一个用于交互式元素选择的“Pick”工具。这允许人们直接指出要与智能体交互的元素，从而简化了诸如网络抓取之类的任务。作者强调，这种方法反映了Anthropic技能系统的优势，提供了渐进式披露，并通过简单的指令使工具易于访问。"
  },
  {
    "id": "45943979",
    "title": "Maybe you’re not trying",
    "url": "https://usefulfictions.substack.com/p/maybe-youre-not-actually-trying",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "也许你没有尽力。",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "45876884",
    "title": "Run Nix Based Environments in Kubernetes",
    "url": "https://flox.dev/kubernetes/",
    "summary": "This article introduces Flox, a system designed to streamline Kubernetes deployments by eliminating the need for container image rebuilds and promoting reproducible environments. Flox leverages Nix to create declarative, immutable environments that can be shared across development, CI/CD, and production Kubernetes clusters, regardless of architecture (x86 and ARM).\n\nThe core concept is to replace the traditional build-push-pull image pipeline with a declarative Flox environment definition. This definition specifies dependencies that resolve to hash-addressed packages stored in a node-local cache, avoiding large image transfers and enabling faster, more predictable deployments. Key benefits include:\n\n*   **Reproducibility:** Ensures consistent environments across the entire software development lifecycle.\n*   **Security:** Reduces the attack surface, provides SBOMs by default, and facilitates atomic rollbacks.\n*   **Operational Simplicity:** Integrates with existing Kubernetes infrastructure and GitOps workflows.\n*   **Faster Deployments:** Eliminates image rebuilds and registry round trips.\n\nFlox utilizes a custom containerd shim to activate Flox environments within containers at startup, leveraging existing Kubernetes primitives. It addresses challenges in various domains like AI/ML, data science, and platform engineering by providing consistent, secure, and reproducible environments without the overhead of container images. It also simplifies debugging by allowing teams to recreate the exact production runtime locally.\n",
    "chinese_title": "在 Kubernetes 中运行基于 Nix 的环境",
    "chinese_summary": "本文介绍了 Flox，该系统旨在通过消除容器镜像重建的需要并促进可重现的环境，从而简化 Kubernetes 部署。Flox 利用 Nix 创建声明式的、不可变的环境，这些环境可以在开发、CI/CD 和生产 Kubernetes 集群之间共享，无论架构如何（x86 和 ARM）。\n\n核心概念是用声明式的 Flox 环境定义来替换传统的构建-推送-拉取镜像管道。该定义指定了解析为存储在节点本地缓存中的哈希寻址软件包的依赖项，从而避免了大型镜像传输，并实现了更快、更可预测的部署。主要优势包括：\n\n*   **可重现性：** 确保整个软件开发生命周期中的环境一致。\n*   **安全性：** 减少攻击面，默认提供 SBOM，并促进原子回滚。\n*   **运维简洁性：** 与现有 Kubernetes 基础设施和 GitOps 工作流程集成。\n*   **更快的部署：** 消除镜像重建和注册表往返。\n\nFlox 利用自定义 containerd shim 在启动时激活容器内的 Flox 环境，利用现有的 Kubernetes 原语。它通过提供一致、安全且可重现的环境，而无需容器镜像的开销，从而解决了人工智能/机器学习、数据科学和平台工程等各个领域的挑战。它还允许团队在本地重新创建精确的生产运行时，从而简化了调试。"
  },
  {
    "id": "45952795",
    "title": "Republican push to make U.S. census surveys voluntary alarms statisticians",
    "url": "https://www.science.org/content/article/republican-push-make-u-s-census-surveys-voluntary-alarms-statisticians",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "Republican push to make U.S. census surveys voluntary alarms statisticians",
    "chinese_summary": "Unable to access the article link.\n"
  },
  {
    "id": "45950542",
    "title": "From Zero to 35M: The struggles of scaling Laravel with Octane",
    "url": "https://www.galahadsixteen.com/blog/from-zero-to-35m-the-struggles-of-scaling-laravel-with-octane",
    "summary": "生成摘要时出错",
    "chinese_title": "From Zero to 35M: The struggles of scaling Laravel with Octane",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45953773",
    "title": "Gigantic VHS videotape hoard of videos being given away for free",
    "url": "https://www.tomshardware.com/software/video-editing-graphic-design/gigantic-vhs-videotape-hoard-of-thousands-of-videos-stored-in-mcdonalds-boxes-being-given-away-for-free-internet-archive-looks-set-to-claim-the-tapes-of-u-s-news-output-spanning-2004-09",
    "summary": "生成摘要时出错",
    "chinese_title": "Gigantic VHS videotape hoard of videos being given away for free",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45795778",
    "title": "Writing a DOS Clone in 2019",
    "url": "https://medium.com/@andrewimm/writing-a-dos-clone-in-2019-70eac97ec3e1",
    "summary": "生成摘要时出错",
    "chinese_title": "Writing a DOS Clone in 2019",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45945202",
    "title": "Running the \"Reflections on Trusting Trust\" Compiler (2023)",
    "url": "https://research.swtch.com/nih",
    "summary": "生成摘要时出错",
    "chinese_title": "Running the \"Reflections on Trusting Trust\" Compiler (2023)",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45945200",
    "title": "Production-Grade Container Deployment with Podman Quadlets – Larvitz Blog",
    "url": "https://blog.hofstede.it/production-grade-container-deployment-with-podman-quadlets/index.html",
    "summary": "生成摘要时出错",
    "chinese_title": "Production-Grade Container Deployment with Podman Quadlets – Larvitz Blog",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45941443",
    "title": "The inconceivable types of Rust: How to make self-borrows safe (2024)",
    "url": "https://blog.polybdenum.com/2024/06/07/the-inconceivable-types-of-rust-how-to-make-self-borrows-safe.html",
    "summary": "生成摘要时出错",
    "chinese_title": "The inconceivable types of Rust: How to make self-borrows safe (2024)",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45893471",
    "title": "Runit Linux: Complete Guide to Unix Init Scheme with Service Supervision",
    "url": "https://codelucky.com/runit-linux-init-service-supervision/",
    "summary": "生成摘要时出错",
    "chinese_title": "Runit Linux: Complete Guide to Unix Init Scheme with Service Supervision",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45949485",
    "title": "An Open-Source HDMI Keyboard/Video/Mouse (KVM) Switch",
    "url": "https://github.com/thatoddmailbox/kvm",
    "summary": "生成摘要时出错",
    "chinese_title": "An Open-Source HDMI Keyboard/Video/Mouse (KVM) Switch",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45939938",
    "title": "Archimedes – A Python toolkit for hardware engineering",
    "url": "https://pinetreelabs.github.io/archimedes/blog/2025/introduction.html",
    "summary": "生成摘要时出错",
    "chinese_title": "Archimedes – A Python toolkit for hardware engineering",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45944951",
    "title": "PgFirstAid: PostgreSQL function for improving stability and performance",
    "url": "https://github.com/randoneering/pgFirstAid",
    "summary": "生成摘要时出错",
    "chinese_title": "PgFirstAid: PostgreSQL function for improving stability and performance",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45939431",
    "title": "Things that aren't doing the thing",
    "url": "https://strangestloop.io/essays/things-that-arent-doing-the-thing",
    "summary": "生成摘要时出错",
    "chinese_title": "Things that aren't doing the thing",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45953568",
    "title": "Geothermal energy might be the baseload revolution we've been looking for",
    "url": "https://www.newyorker.com/magazine/2025/11/24/why-the-time-has-finally-come-for-geothermal-energy",
    "summary": "生成摘要时出错",
    "chinese_title": "Geothermal energy might be the baseload revolution we've been looking for",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45945960",
    "title": "Dissecting Flock Safety: The Cameras Tracking You Are a Security Nightmare [video]",
    "url": "https://www.youtube.com/watch?v=uB0gr7Fh6lY",
    "summary": "生成摘要时出错",
    "chinese_title": "Dissecting Flock Safety: The Cameras Tracking You Are a Security Nightmare [video]",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45938427",
    "title": "Mag Wealth (2024)",
    "url": "https://saul.pw/mag/wealth/",
    "summary": "生成摘要时出错",
    "chinese_title": "Mag Wealth (2024)",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45836848",
    "title": "Origin and Evolution of the Globstar",
    "url": "https://mergify.com/blog/origin-and-evolution-of-the-globstar",
    "summary": "生成摘要时出错",
    "chinese_title": "Origin and Evolution of the Globstar",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45901257",
    "title": "Extreme Moon: The Major Lunar Standstill of 2024-2025",
    "url": "https://griffithobservatory.org/extreme-moon-the-major-lunar-standstills-of-2024-2025/",
    "summary": "生成摘要时出错",
    "chinese_title": "Extreme Moon: The Major Lunar Standstill of 2024-2025",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45930151",
    "title": "AI World Clocks",
    "url": "https://clocks.brianmoore.com/",
    "summary": "生成摘要时出错",
    "chinese_title": "AI World Clocks",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45947827",
    "title": "Adding an imaginary unit to a finite field",
    "url": "https://www.johndcook.com/blog/2025/11/16/finite-field-i/",
    "summary": "生成摘要时出错",
    "chinese_title": "Adding an imaginary unit to a finite field",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45950408",
    "title": "People are using iPad OS features on their iPhones",
    "url": "https://idevicecentral.com/ios-customization/how-to-enable-ipad-features-like-multitasking-stage-manager-on-iphone-via-mobilegestalt/",
    "summary": "生成摘要时出错",
    "chinese_title": "People are using iPad OS features on their iPhones",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45944056",
    "title": "UK's first small nuclear power station to be built in north Wales",
    "url": "https://www.bbc.com/news/articles/c051y3d7myzo",
    "summary": "生成摘要时出错",
    "chinese_title": "UK's first small nuclear power station to be built in north Wales",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45868660",
    "title": "Alchemy",
    "url": "https://joshcollinsworth.com/blog/alchemy",
    "summary": "生成摘要时出错",
    "chinese_title": "Alchemy",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45945955",
    "title": "JavaScript Engines Benchmarks",
    "url": "https://ivankra.github.io/javascript-zoo/",
    "summary": "生成摘要时出错",
    "chinese_title": "JavaScript Engines Benchmarks",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45949641",
    "title": "Coherent Synchrotron Radiation by Excitation of SPPs on Near-Critical CNT",
    "url": "https://arxiv.org/abs/2507.04561",
    "summary": "生成摘要时出错",
    "chinese_title": "Coherent Synchrotron Radiation by Excitation of SPPs on Near-Critical CNT",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45944941",
    "title": "Where Educational Technology Fails: A seventh-grader's perspective",
    "url": "https://micahblachman.beehiiv.com/p/where-educational-technology-fails",
    "summary": "生成摘要时出错",
    "chinese_title": "Where Educational Technology Fails: A seventh-grader's perspective",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45922907",
    "title": "Holes (1970) [pdf]",
    "url": "https://rintintin.colorado.edu/~vancecd/phil375/Lewis1.pdf",
    "summary": "This document is a PDF file, likely created using Microsoft Word 2013. The file's metadata indicates it was created and modified on September 5, 2019.\n\nUnfortunately, the content of the PDF is mostly binary data, representing the compressed information of the document. There is a title present \"Holes (1970)\", but the rest of the text in the document is code. It is impossible to determine the subject or content of the article based on the provided raw PDF code. I am unable to provide a summary without the readable text content of the \"Holes (1970)\" article.\n",
    "chinese_title": "Holes (1970) [pdf]",
    "chinese_summary": "This document is a PDF file, likely created using Microsoft Word 2013. The file's metadata indicates it was created and modified on September 5, 2019.\n\nUnfortunately, the content of the PDF is mostly binary data, representing the compressed information of the document. There is a title present \"Holes (1970)\", but the rest of the text in the document is code. It is impossible to determine the subject or content of the article based on the provided raw PDF code. I am unable to provide a summary without the readable text content of the \"Holes (1970)\" article.\n"
  },
  {
    "id": "45821328",
    "title": "JVM exceptions are weird: a decompiler perspective",
    "url": "https://purplesyringa.moe/blog/jvm-exceptions-are-weird-a-decompiler-perspective/",
    "summary": "生成摘要时出错",
    "chinese_title": "JVM exceptions are weird: a decompiler perspective",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45891066",
    "title": "Show HN: Unflip – a puzzle game about XOR patterns of squares",
    "url": "https://unflipgame.com/",
    "summary": "生成摘要时出错",
    "chinese_title": "Show HN: Unflip – a puzzle game about XOR patterns of squares",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45903404",
    "title": "Steam Machine",
    "url": "https://store.steampowered.com/sale/steammachine",
    "summary": "生成摘要时出错",
    "chinese_title": "Steam Machine",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45936262",
    "title": "One Handed Keyboard",
    "url": "https://github.com/htx-studio/One-Handed-Keyboard",
    "summary": "生成摘要时出错",
    "chinese_title": "One Handed Keyboard",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45954528",
    "title": "Trump-Licensed Presidential Seal Beer Pong Set, Bible Could Violate Federal Law",
    "url": "https://www.forbes.com/sites/zacheverson/2025/11/14/trump-beer-pong-lee-greenwood-presidential-seal-bible/",
    "summary": "生成摘要时出错",
    "chinese_title": "Trump-Licensed Presidential Seal Beer Pong Set, Bible Could Violate Federal Law",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45838894",
    "title": "A Man Who Rescued Faulkner",
    "url": "https://www.theatlantic.com/magazine/2025/12/malcolm-cowley-american-literature/684606/",
    "summary": "This article explores the life and career of Malcolm Cowley, a prominent literary critic and editor who played a crucial role in shaping the landscape of 20th-century American literature. Cowley was a keen talent scout, discovering and promoting writers like John Cheever, Alfred Kazin, Jack Kerouac, and Ken Kesey. However, his most significant contribution was resurrecting William Faulkner's career. He recognized the interconnectedness of Faulkner's Yoknapatawpha novels and championed their publication, leading to Faulkner's widespread recognition and eventual Nobel Prize.\n\nCowley aimed to elevate American writing, advocating for its recognition as a distinct tradition separate from British literature. He believed in understanding literature within its social and historical context, contrasting with the New Criticism's focus on purely textual analysis. His own experiences as a member of the \"Lost Generation\" in Paris after World War I shaped his understanding of American writers grappling with identity and heritage.\n\nWhile Cowley's early political leanings led to some missteps regarding Stalinist Russia, his later work focused on analyzing the postwar cultural scene. He observed changes in literary criticism and the democratization of readership. Cowley valued literature that engaged with the complexities of the American experience and sought the \"Great American Novel,\" ultimately seeing Herman Melville's *Moby-Dick* as fulfilling that role. Despite not achieving the same critical acclaim as Edmund Wilson, Cowley's deep understanding of American identity and his championing of American writers cemented his legacy as a vital figure in literary history.\n",
    "chinese_title": "A Man Who Rescued Faulkner",
    "chinese_summary": "This article explores the life and career of Malcolm Cowley, a prominent literary critic and editor who played a crucial role in shaping the landscape of 20th-century American literature. Cowley was a keen talent scout, discovering and promoting writers like John Cheever, Alfred Kazin, Jack Kerouac, and Ken Kesey. However, his most significant contribution was resurrecting William Faulkner's career. He recognized the interconnectedness of Faulkner's Yoknapatawpha novels and championed their publication, leading to Faulkner's widespread recognition and eventual Nobel Prize.\n\nCowley aimed to elevate American writing, advocating for its recognition as a distinct tradition separate from British literature. He believed in understanding literature within its social and historical context, contrasting with the New Criticism's focus on purely textual analysis. His own experiences as a member of the \"Lost Generation\" in Paris after World War I shaped his understanding of American writers grappling with identity and heritage.\n\nWhile Cowley's early political leanings led to some missteps regarding Stalinist Russia, his later work focused on analyzing the postwar cultural scene. He observed changes in literary criticism and the democratization of readership. Cowley valued literature that engaged with the complexities of the American experience and sought the \"Great American Novel,\" ultimately seeing Herman Melville's *Moby-Dick* as fulfilling that role. Despite not achieving the same critical acclaim as Edmund Wilson, Cowley's deep understanding of American identity and his championing of American writers cemented his legacy as a vital figure in literary history.\n"
  },
  {
    "id": "45941563",
    "title": "When UPS charged me a $684 tariff on $355 of vintage computer parts",
    "url": "http://oldvcr.blogspot.com/2025/11/when-ups-charged-me-684-tariff-on-355.html",
    "summary": "生成摘要时出错",
    "chinese_title": "When UPS charged me a $684 tariff on $355 of vintage computer parts",
    "chinese_summary": "生成摘要时出错"
  }
]