[
  {
    "id": "44159758",
    "title": "Show HN: A toy version of Wireshark",
    "url": "https://github.com/lixiasky/vanta",
    "summary": "Vanta is a lightweight, command-line network behavior analyzer created by an undergraduate student as a personal project and a form of gratitude towards universities that supported international students. It aims to offer clarity, structure, and simplicity in packet analysis, focusing on protocol-level flows and structured activity extraction.\n\nKey features include:\n\n*   **Protocol-Level Parsing:** Supports HTTP, DNS, and TLS (with partial fingerprinting).\n*   **Connection Tracking:** Reconstructs bidirectional flows.\n*   **Behavior Exporting:** Outputs JSON-formatted summaries.\n*   **Portability:** A single binary with no external dependencies.\n\nDeveloped on a MacBook Air M1 using Go, Vanta is intended for custom scripting and minimal setups. The project structure includes modules for packet capture, flow reassembly, protocol decoding, fuzzing (experimental), behavior exporting, and usage documentation (in Chinese).\n\nThe author acknowledges Vanta as a \"toy version\" of Wireshark, emphasizing its heartfelt creation. The project is offered under the Apache 2.0 license, and the author welcomes feedback, reviews, and sharing.\n",
    "chinese_title": "Show HN: Wireshark 的玩具版",
    "chinese_summary": "Vanta：一款轻量级命令行网络行为分析器，由一位本科生作为个人项目创建，以感谢支持国际学生的大学。其旨在提供清晰、结构化和简易的数据包分析，专注于协议层流量和结构化活动提取。\n\n主要特性包括：\n\n*   **协议层解析：** 支持HTTP、DNS和TLS（带有部分指纹识别）。\n*   **连接追踪：** 重建双向流量。\n*   **行为导出：** 输出JSON格式的摘要。\n*   **可移植性：** 单个二进制文件，无外部依赖。\n\nVanta使用Go语言在MacBook Air M1上开发，旨在用于自定义脚本和最简设置。项目结构包括数据包捕获、流量重组、协议解码、模糊测试（实验性）、行为导出和使用文档（中文）等模块。\n\n作者承认Vanta是Wireshark的“玩具版本”，强调其用心创作。该项目以Apache 2.0许可协议提供，作者欢迎反馈、评论和分享。"
  },
  {
    "id": "44156935",
    "title": "If you are useful, it doesn't mean you are valued",
    "url": "https://betterthanrandom.substack.com/p/if-you-are-useful-it-doesnt-mean",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "有用不代表有价值。",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "44160073",
    "title": "Show HN: Penny-1.7B Irish Penny Journal style transfer",
    "url": "https://huggingface.co/dleemiller/Penny-1.7B",
    "summary": "Penny-1.7B is a 1.7 billion parameter language model fine-tuned to mimic the writing style of the 19th-century Irish Penny Journal (1840). It leverages Group Relative Policy Optimization (GRPO), a reinforcement learning technique, to achieve this stylistic transfer from the base model, SmolLM2-1.7B-Instruct. The model was trained for 6,800 policy steps using a reward model that distinguishes between original IPJ text and modern translations.\n\nKey features include:\n\n*   **Base Model:** SmolLM2-1.7B-Instruct\n*   **Tuning:** GRPO (RL)\n*   **Training Data:** Irish Penny Journal (1840) and its modern translations.\n*   **Hardware:** 1x RTX A6000 (48GB)\n\nPenny-1.7B is intended for creative writing, educational content, or stylistic pastiche requiring Victorian-era Irish English. It's not recommended for contemporary fact Q&A due to archaic language.\n\nThe model carries limitations regarding potential biases present in 19th-century texts and may generate outdated social views. Users are advised to review generated content before use. The model is readily accessible via Hugging Face Transformers using the provided code snippet. The model is licensed under Apache 2.0.\n",
    "chinese_title": "展示HN：Penny-1.7B 爱尔兰便士期刊风格迁移",
    "chinese_summary": "Penny-1.7B是一个拥有17亿参数的语言模型，经过微调以模仿19世纪爱尔兰《便士杂志》（1840年）的写作风格。它利用群体相对策略优化（GRPO）这一强化学习技术，从基础模型SmolLM2-1.7B-Instruct实现这种风格迁移。该模型使用奖励模型进行训练，该奖励模型区分原始IPJ文本和现代翻译，训练了6800个策略步骤。\n\n主要特点包括：\n\n*   **基础模型：** SmolLM2-1.7B-Instruct\n*   **微调：** GRPO (RL)\n*   **训练数据：** 爱尔兰《便士杂志》（1840年）及其现代翻译。\n*   **硬件：** 1x RTX A6000 (48GB)\n\nPenny-1.7B适用于需要维多利亚时代爱尔兰英语的创意写作、教育内容或风格模仿。由于语言陈旧，不建议用于当代事实问答。\n\n该模型存在局限性，包括19世纪文本中可能存在的偏见，并可能产生过时的社会观点。建议用户在使用前审查生成的内容。该模型可以通过Hugging Face Transformers使用提供的代码片段轻松访问。该模型采用Apache 2.0许可。"
  },
  {
    "id": "44157177",
    "title": "Show HN: Kan.bn – An open-source alterative to Trello",
    "url": "https://github.com/kanbn/kan",
    "summary": "Kan.bn is presented as an open-source alternative to Trello for project management. The platform offers several features, including board visibility control, workspace members, Trello import functionality, labels and filters for organization, comments for collaboration, and a detailed activity log. Upcoming features include templates and integrations.\n\nThe project is built with Next.js, tRPC, Better Auth, Tailwind CSS, Drizzle ORM, and React Email. The article provides instructions for local development, including cloning the repository, installing dependencies, configuring environment variables, and starting the development server.\n\nContributions are welcome, and the project is licensed under AGPLv3. Users can contact the developers for support via email (henry@kan.bn) or by joining their Discord server. The post also links to the project's roadmap, website, and documentation.\n",
    "chinese_title": "Show HN: Kan.bn – Trello 的开源替代方案",
    "chinese_summary": "Kan.bn：一款开源项目管理工具，是 Trello 的替代方案。该平台提供看板可见性控制、工作区成员、Trello 导入功能、标签和筛选器、评论协作以及详细的活动日志等功能。即将推出的功能包括模板和集成。\n\n该项目基于 Next.js、tRPC、Better Auth、Tailwind CSS、Drizzle ORM 和 React Email 构建。文章提供了本地开发指导，包括克隆仓库、安装依赖、配置环境变量以及启动开发服务器。\n\n欢迎贡献，项目采用 AGPLv3 许可。用户可以通过电子邮件 (henry@kan.bn) 或加入其 Discord 服务器联系开发者寻求支持。此外，文章还链接到项目的路线图、网站和文档。"
  },
  {
    "id": "44160870",
    "title": "Piramidal (YC W24) Is Hiring a Senior Full Stack Engineer",
    "url": "https://www.ycombinator.com/companies/piramidal/jobs/1a1PgE9-senior-full-stack-engineer",
    "summary": "Piramidal, a Y Combinator W24-funded startup building a foundation model for brain electrophysiological data, is hiring a Senior Full Stack Engineer in New York, NY. The role offers a salary between $120K - $250K and requires 3+ years of experience with US citizenship/visa.\n\nThe engineer will be responsible for building and maintaining infrastructure and backend systems for their flagship neural data platform, collaborating with ML engineers and product teams to implement effective solutions and iterate on models.\n\nKey requirements include 5+ years of engineering experience at product-driven companies, proficiency with Python and other backend languages, containerization/orchestration technologies (e.g., Kubernetes), relational databases (e.g. Postgres/MySQL), and web technologies (e.g. JavaScript, React). They emphasize the ability to move quickly in a dynamic environment. Neuroscience or data science experience is not required.\n\nPiramidal focuses on building neural decoders to enable understanding and control of neural syntax, promoting cognitive liberty, and opposing the commodification of minds.\n\nThe interview process involves an initial screen, a technical screen (take-home or live), and a final round that includes architecting a scalable system for real-time inferencing and a Q&A session. The company was founded in 2024 by Dimitris Fotis Sakellariou and Kris Pahuja.\n",
    "chinese_title": "Piramidal (YC W24) 招聘资深全栈工程师",
    "chinese_summary": "Piramidal公司（Y Combinator W24 孵化项目），正在纽约招聘高级全栈工程师，该公司致力于构建用于脑电生理数据的基础模型。 该职位薪资范围为 12 万美元至 25 万美元，要求拥有 3 年以上经验且具备美国公民/签证身份。\n\n该工程师将负责为其旗舰神经数据平台构建和维护基础设施和后端系统，与机器学习工程师和产品团队合作，实施有效的解决方案并迭代模型。\n\n主要要求包括在产品驱动型公司拥有 5 年以上的工程经验，精通 Python 和其他后端语言，熟悉容器化/编排技术（例如 Kubernetes）、关系数据库（例如 Postgres/MySQL）和 Web 技术（例如 JavaScript、React）。 他们强调在动态环境中快速行动的能力。 无需神经科学或数据科学经验。\n\nPiramidal 致力于构建神经解码器，以实现对神经句法的理解和控制，从而促进认知自由并反对心灵的商品化。\n\n面试流程包括初步筛选、技术筛选（居家或现场）以及最终轮，最终轮包括为实时推理架构一个可扩展的系统以及问答环节。该公司由 Dimitris Fotis Sakellariou 和 Kris Pahuja 于 2024 年创立。"
  },
  {
    "id": "44159798",
    "title": "Mesh Edge Construction",
    "url": "https://maxliani.wordpress.com/2025/03/01/mesh-edge-construction/",
    "summary": "This article discusses three algorithms for constructing the unique edges of a polygonal mesh, focusing on optimizing for efficiency. It starts by defining a face-vertex mesh representation and distinguishing between \"half-edges\" (ordered index pairs representing sides of polygons) and \"edges\" (unique line segments, regardless of polygon orientation).\n\nThe core problem is efficiently determining the number of unique edges and their indices within a mesh. The author presents three progressively optimized algorithms:\n\n1.  **Map Approach:** Uses a `std::map` to store edges, ensuring uniqueness by only inserting the first occurrence. This has a time complexity of O(n log n) and suffers from granular memory allocation inefficiency.\n\n2.  **Flat Vector + Sort:** Creates a vector of `EdgeEntry` structs (edge and original index). It then sorts the vector to group duplicate edges, removes duplicates using `std::unique` (keeping the first encountered edge), and sorts again by the original index to restore the edge ordering. This also has O(n log n) complexity but is faster due to flat memory layout and fewer allocations. It does require more memory.\n\nThe article stresses the importance of defining edges as sorted index pairs for consistent identification and uses a union to efficiently store and compare edges as 64-bit integers. The algorithms aim to enumerate edges in the order they're encountered in the mesh's topology for consistency and straightforward edge indexing. The article also touches on the concept of edge valence and adjacency for potential future optimizations.\n",
    "chinese_title": "网格边构建",
    "chinese_summary": "本文讨论了用于构建多边形网格唯一边的三种算法，重点在于优化效率。文章首先定义了面-顶点网格表示，并区分了“半边”（表示多边形边的有序索引对）和“边”（不考虑多边形方向的唯一线段）。\n\n核心问题是高效地确定网格中唯一边的数量及其索引。作者提出了三种逐步优化的算法：\n\n1.  **映射方法：** 使用 `std::map` 存储边，通过仅插入第一次出现的边来确保唯一性。这种方法的时间复杂度为 O(n log n)，并且存在细粒度内存分配效率低下的问题。\n\n2.  **扁平向量 + 排序：** 创建一个 `EdgeEntry` 结构体（边和原始索引）的向量。然后，对向量进行排序以对重复的边进行分组，使用 `std::unique` 删除重复项（保留第一次遇到的边），并再次按原始索引排序以恢复边的顺序。这种方法的时间复杂度也为 O(n log n)，但由于扁平内存布局和更少的分配而更快。它确实需要更多内存。\n\n文章强调将边定义为排序的索引对对于一致的识别至关重要，并使用联合体来有效地存储和比较边，将其作为 64 位整数。这些算法旨在按照边在网格拓扑结构中遇到的顺序枚举边，以实现一致性和简单的边索引。文章还涉及了边价和邻接的概念，以用于潜在的未来优化。"
  },
  {
    "id": "44160358",
    "title": "Arcol simplifies building design with browser-based modeling",
    "url": "https://www.arcol.io/",
    "summary": "Arcol is a browser-based building design platform that simplifies collaboration and streamlines the design process for architects, designers, developers, general contractors, and owners. The platform promotes real-time collaboration amongst stakeholders, reducing email clutter and facilitating faster, better-informed decisions.\n\nArcol integrates data and documentation to eliminate silos, offering powerful data management and automation to minimize tedious tasks. Features like real-time metrics and constructible design allow for data-driven decisions and efficient design iterations, while presentation-ready boards automate documentation. The platform's goal is to foster early collaboration, avoiding costly changes later in the project lifecycle.\n\nSeveral testimonials highlight Arcol's positive impact. Companies like slant/is, Corgan, GWWO Architects, and THW Design praise its ease of use, ability to improve communication, enhance efficiency, and streamline feasibility studies. Client success stories with CDH, GWWO, and THW Design further reinforce its value. Arcol caters to architects & designers, developers, general contractors, and owners by providing tools specific to their needs. The platform allows teams to design complex buildings and floor plans and deliver faster client experiences.\n",
    "chinese_title": "Arcol以浏览器建模简化建筑设计",
    "chinese_summary": "Arcol是一个基于浏览器的建筑设计平台，它简化了建筑师、设计师、开发商、总承包商和业主之间的协作，并优化了设计流程。该平台促进了利益相关者之间的实时协作，减少了电子邮件的混乱，并促进了更快、更明智的决策。\n\nArcol集成了数据和文档以消除信息孤岛，提供强大的数据管理和自动化功能，从而最大限度地减少繁琐的任务。实时指标和可施工设计等功能支持数据驱动的决策和高效的设计迭代，而演示就绪的图板则可自动生成文档。该平台的目标是促进早期协作，避免在项目生命周期后期出现代价高昂的变更。\n\n一些客户评价突显了Arcol的积极影响。slant/is、Corgan、GWWO Architects和THW Design等公司都赞扬其易用性、改善沟通的能力、提高效率以及简化可行性研究的能力。CDH、GWWO和THW Design的客户成功案例进一步强化了其价值。Arcol通过提供满足其特定需求的工具，来满足建筑师和设计师、开发商、总承包商和业主的需求。该平台允许团队设计复杂的建筑物和楼层平面图，并提供更快的客户体验。"
  },
  {
    "id": "44156157",
    "title": "War and Wilderness: British Soldiers in Revolutionary America",
    "url": "https://www.historytoday.com/archive/feature/war-and-wilderness-british-soldiers-revolutionary-america",
    "summary": "Vaughn Scribner's \"War and Wilderness: British Soldiers in Revolutionary America\" explores the detrimental impact of the American environment on British and Hessian soldiers during the Revolutionary War (1775-1783). Beyond combat, these European troops faced a hostile natural world that severely affected their physical and mental health.\n\nThe article highlights specific environmental challenges, primarily focusing on the flora and fauna of the American landscape. Vast swamplands, especially in the southern theater, presented immense difficulties. Soldiers encountered black water, festering mud, stifling heat, and dangerous wildlife, including alligators. Figures like Francis Marion, the \"Swamp Fox,\" exploited these environments to wage guerilla warfare against the British.\n\nAlligators posed a constant threat, inspiring fear and requiring soldiers to take precautions such as building large fires. Mosquitoes were another persistent problem, transmitting diseases like malaria and yellow fever, which were significantly more deadly than combat. These diseases decimated British forces, particularly at the Siege of Yorktown, where malaria significantly weakened Cornwallis's troops.\n\nThe San Juan Expedition, led by Horatio Nelson, illustrates these challenges further. As they journeyed through the rainforests of Central America's \"Mosquito Coast,\" Nelson and his men struggled against the oppressive environment, encountering various unfamiliar and dangerous creatures. The combination of harsh terrain, disease-carrying insects, and dangerous wildlife contributed to the overall suffering and challenges faced by British soldiers in Revolutionary America.\n",
    "chinese_title": "战争与荒野：英国士兵在革命时期的美国",
    "chinese_summary": "沃恩·斯克里布纳的《战争与荒野：美国独立战争中的英国士兵》探讨了美国环境对独立战争（1775-1783）期间英国和黑森士兵的有害影响。除了战斗之外，这些欧洲军队还面临着一个充满敌意的自然世界，严重影响了他们的身心健康。\n\n文章着重强调了具体的环境挑战，主要集中在美国景观中的动植物。广阔的沼泽地，尤其是在南方战区，带来了巨大的困难。士兵们遇到了黑水、化脓的泥浆、令人窒息的炎热和危险的野生动物，包括鳄鱼。弗朗西斯·马里昂（绰号“沼泽狐狸”）等人物利用这些环境对英国人发动游击战。\n\n鳄鱼构成了持续的威胁，引发了恐惧，并迫使士兵采取预防措施，例如生起大火。蚊子是另一个长期存在的问题，传播疟疾和黄热病等疾病，这些疾病比战斗更致命。这些疾病大量削减了英军的力量，尤其是在约克镇战役中，疟疾极大地削弱了康沃利斯率领的军队。\n\n由霍雷肖·纳尔逊率领的圣胡安远征进一步说明了这些挑战。当他们穿越中美洲“蚊子海岸”的雨林时，纳尔逊和他的士兵与压迫性的环境作斗争，遇到了各种陌生而危险的生物。恶劣的地形、携带疾病的昆虫和危险的野生动物，共同造成了英国士兵在美国独立战争中所面临的整体痛苦和挑战。"
  },
  {
    "id": "44155746",
    "title": "How to post when no one is reading",
    "url": "https://www.jeetmehta.com/posts/thrive-in-obscurity",
    "summary": "This article addresses the common struggle of creating content when no one is watching, arguing that this period of \"obscurity\" is a crucial stepping stone to creative mastery. It emphasizes that success often takes years of consistent effort, practice, and even \"failed performances,\" highlighting the reality of creators who toiled in silence for extended periods before achieving recognition.\n\nThe author discourages creators from solely seeking external validation like praise, followers, or fame, as this can lead to burnout. Instead, they offer three frameworks for sustaining motivation:\n\n1.  **Do what you like, and sometimes the world will agree:** Inspired by Mike Posner's journey, the author suggests focusing on creating content that resonates personally rather than chasing trends or perceived audience preferences. This approach fosters genuine enjoyment and improves the quality of work.\n\n2.  **Push yourself out:** Creating what you like attracts like-minded followers and ensures that the content remains engaging for the creator even when the audience is small or non-existent.\n\n3.  **Build your Binge Bank:** Viewing early, unappreciated content as an investment in a \"Binge Bank\" helps maintain motivation. This content will become valuable to future fans who will want to explore the creator's entire body of work. These early works don't receive viewership at the time of creation but later as an archive.\n\nUltimately, the article encourages creators to persevere, viewing the initial period of obscurity as a necessary phase in building a sustainable and fulfilling creative practice.\n",
    "chinese_title": "无人问津时如何发帖",
    "chinese_summary": "本文探讨了在无人关注时创作内容的常见困境，并认为这段“默默无闻”的时期是通往创作精通的关键一步。文章强调，成功往往需要多年的持续努力、实践，甚至“失败的表演”，突出了许多创作者在获得认可之前，默默耕耘了很长时间的现实。\n\n作者不鼓励创作者仅仅追求外部认可，如赞扬、粉丝或名声，因为这会导致倦怠。相反，作者提供了三个维持动力的框架：\n\n1.  **做你喜欢的事，有时世界会认同：** 受迈克·波斯纳的经历启发，作者建议专注于创作能引起个人共鸣的内容，而不是追逐潮流或感知到的受众偏好。这种方法可以培养真正的乐趣，并提高作品的质量。\n\n2.  **把自己推出去：** 创作你喜欢的东西会吸引志同道合的追随者，并确保即使观众很少或不存在，内容对创作者来说仍然是有吸引力的。\n\n3.  **建立你的“狂看银行”：** 将早期未被赏识的内容视为对“狂看银行”的投资有助于保持动力。这些内容对于未来想要探索创作者全部作品的粉丝来说将变得有价值。这些早期的作品在创作时没有获得观看，但后来作为档案获得了观看。\n\n最终，本文鼓励创作者坚持不懈，将最初的默默无闻时期视为构建可持续且令人满意的创作实践的必要阶段。"
  },
  {
    "id": "44146339",
    "title": "Intelligent Agent Technology: Open Sesame! (1993)",
    "url": "https://blog.gingerbeardman.com/2025/05/31/intelligent-agent-technology-open-sesame-1993/",
    "summary": "This article recounts the author's long quest to identify a Macintosh application called \"Open Sesame!\", a pioneering intelligent software assistant from 1993. For years, the author remembered seeing a demo of the app, which aimed to learn and automate repetitive tasks, but struggled to find its name or any information about it. After numerous unsuccessful attempts using traditional search engines, the author finally succeeded by using AI, specifically Gemini, to identify the app and provide relevant references.\n\nThe article highlights the core function of Open Sesame!: observing user behavior, learning repetitive patterns, and offering to automate those tasks. The author found it ironic that in 2025, AI helped uncover information about an app built around machine learning concepts in 1993. The author links to a download for Open Sesame! 1.1 at Macintosh Garden and provides a list of further reading materials from MacWorld and NASA concerning the app and its technology. The piece emphasizes the app's place in history as one of the early attempts at intelligent agent technology.\n",
    "chinese_title": "智能代理技术：芝麻开门！（1993）",
    "chinese_summary": "本文讲述了作者长期以来寻找一款名为“Open Sesame!”的 Macintosh 应用程序的历程，这是一款 1993 年开创性的智能软件助手。多年来，作者一直记得看过该应用程序的演示，该应用程序旨在学习和自动化重复性任务，但一直难以找到它的名称或任何相关信息。经过多次使用传统搜索引擎的失败尝试后，作者最终通过使用人工智能，特别是 Gemini，成功地识别了该应用程序并提供了相关的参考文献。\n\n本文重点介绍了 Open Sesame! 的核心功能：观察用户行为，学习重复模式，并提供自动化这些任务的功能。作者发现具有讽刺意味的是，在 2025 年，人工智能帮助发现了关于一款构建于 1993 年机器学习概念之上的应用程序的信息。作者链接到了 Macintosh Garden 网站上 Open Sesame! 1.1 的下载链接，并提供了来自 MacWorld 和 NASA 的关于该应用程序及其技术的进一步阅读材料列表。本文强调了该应用程序作为早期智能代理技术尝试之一的历史地位。"
  },
  {
    "id": "44127653",
    "title": "Show HN: Onlook – Open-source, visual-first Cursor for designers",
    "url": "https://github.com/onlook-dev/onlook",
    "summary": "Onlook is an open-source, visual-first code editor designed for designers, aiming to be an alternative to tools like Bolt.new and Webflow. Built with Next.js and TailwindCSS, it allows users to craft websites and prototypes with AI assistance, edit directly in the browser DOM, and design in real-time with code. Currently under development for the web, Onlook seeks contributors for its \"prompt-to-build\" experience.\n\nKey features include creating Next.js apps from text, images, templates, Figma, or GitHub repos; visual editing with a Figma-like UI; real-time preview; asset and token management; layer browsing; component detection; page creation; and image management. It also offers development tools like a real-time code editor, save/restore checkpoints, CLI commands, app marketplace connectivity, and local code editing.\n\nOnlook enables quick app deployment with sharable links, custom domain integration, and team collaboration features like real-time editing and commenting. The platform works by loading code into a web container, serving it, and displaying it in an iFrame, allowing the editor to read, index, and instrument the code. This maps elements to their code location, enabling visual edits that are reflected in the code. Onlook Desktop (formerly Onlook Alpha) is still available.\n\nThe project welcomes contributions and is built with technologies like Next.js, Supabase, Drizzle, TailwindCSS, Bun, and tRPC. It is licensed under Apache 2.0.\n",
    "chinese_title": "Show HN：Onlook - 面向设计师的开源、可视化光标",
    "chinese_summary": "Onlook：面向设计师的开源可视化代码编辑器\n\nOnlook是一款开源的、以视觉为先的代码编辑器，专为设计师打造，旨在成为 Bolt.new 和 Webflow 等工具的替代品。它使用 Next.js 和 TailwindCSS 构建，允许用户在 AI 辅助下制作网站和原型，直接在浏览器 DOM 中编辑，并使用代码进行实时设计。Onlook 目前正在开发 Web 版本，并寻求贡献者参与其“提示生成构建”体验。\n\n主要功能包括：通过文本、图像、模板、Figma 或 GitHub 仓库创建 Next.js 应用；具有类似 Figma UI 的可视化编辑；实时预览；资产和令牌管理；图层浏览；组件检测；页面创建；以及图像管理。它还提供开发工具，如实时代码编辑器、保存/恢复检查点、CLI 命令、应用市场连接和本地代码编辑。\n\nOnlook 支持快速应用部署，提供可共享链接、自定义域名集成以及团队协作功能（如实时编辑和评论）。该平台的工作原理是将代码加载到 Web 容器中，进行服务并显示在 iFrame 中，从而允许编辑器读取、索引和检测代码。这会将元素映射到其代码位置，从而实现反映在代码中的可视化编辑。Onlook Desktop（原 Onlook Alpha）仍然可用。\n\n该项目欢迎贡献，并使用 Next.js、Supabase、Drizzle、TailwindCSS、Bun 和 tRPC 等技术构建，并采用 Apache 2.0 许可证。"
  },
  {
    "id": "44154032",
    "title": "The Visual World of 'Samurai Jack'",
    "url": "https://animationobsessive.substack.com/p/the-visual-world-of-samurai-jack",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "武士杰克的视觉世界",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "44160758",
    "title": "Taurine Revisited",
    "url": "https://www.science.org/content/blog-post/taurine-revisited",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "牛磺酸再探",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "44159318",
    "title": "A Hidden Weakness",
    "url": "https://serge-sans-paille.github.io/pythran-stories/a-hidden-weakness.html",
    "summary": "This article details a challenging bug hunt in Firefox for Android (Fenix) related to using Android API symbols that are only available on newer Android versions. The problem arose from using `__ANDROID_UNAVAILABLE_SYMBOLS_ARE_WEAK__` to handle these symbols, which relies on compiler extensions like `__builtin_available` and `__attribute__((__availability__))`. These features allow for conditional compilation based on the Android API level.\n\nThe author discovered that while `__attribute__((__availability__))` correctly marked unavailable symbols as \"weak\" during compilation, the symbols were also being marked as \"HIDDEN\" due to Firefox's default hidden visibility setting (`-include config/gcc_hidden.h` and `#pragma GCC visibility push(hidden)`). This \"HIDDEN\" attribute, combined with the \"weak\" attribute, prevented the linker from resolving the symbols to the actual implementations on newer Android versions, effectively turning calls to these symbols into calls to address 0, leading to crashes.\n\nThe compiler warning `-Werror=unguarded-availability` helped identify potentially problematic calls but did not address the underlying visibility issue.\n\nThe solution was to temporarily revert to default visibility around the inclusion of Android system headers, ensuring that symbols from those headers were not inadvertently hidden:\n\n```c\n#pragma GCC visibility push(default)\n#include <android/system_fonts.h>\n#pragma GCC visibility pop\n```\n\nThis allowed the weak symbols to be correctly resolved by the linker to the actual implementations when running on compatible Android versions. The article highlights how a seemingly innocuous build flag can interact with compiler extensions in unexpected ways, leading to obscure bugs.\n",
    "chinese_title": "一个隐藏的弱点",
    "chinese_summary": "本文详细介绍了在Android版Firefox（Fenix）中一次具有挑战性的错误追查过程，该过程与使用仅在新版Android上可用的Android API符号有关。问题源于使用`__ANDROID_UNAVAILABLE_SYMBOLS_ARE_WEAK__`来处理这些符号，这依赖于编译器扩展，例如`__builtin_available`和`__attribute__((__availability__))`。这些功能允许基于Android API级别进行条件编译。\n\n作者发现，虽然`__attribute__((__availability__))`在编译期间正确地将不可用符号标记为“weak”（弱符号），但由于Firefox的默认隐藏可见性设置（`-include config/gcc_hidden.h`和`#pragma GCC visibility push(hidden)`），这些符号也被标记为“HIDDEN”（隐藏）。这个“HIDDEN”属性与“weak”属性结合，阻止了链接器在新版Android上将这些符号解析为实际实现，实际上将对这些符号的调用变成了对地址0的调用，从而导致崩溃。\n\n编译器警告`-Werror=unguarded-availability`有助于识别潜在的问题调用，但没有解决根本的可见性问题。\n\n解决方案是临时恢复到Android系统头文件包含周围的默认可见性，确保来自这些头文件的符号不会被意外隐藏：\n\n```c\n#pragma GCC visibility push(default)\n#include <android/system_fonts.h>\n#pragma GCC visibility pop\n```\n\n这允许弱符号在兼容的Android版本上运行时，被链接器正确解析为实际实现。本文强调了一个看似无害的构建标志如何以意想不到的方式与编译器扩展交互，从而导致晦涩的错误。"
  },
  {
    "id": "44144240",
    "title": "Bohemians at the Gate?",
    "url": "https://inferencemagazine.substack.com/p/bohemians-at-the-gate",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "波西米亚人在门口？",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "44158720",
    "title": "Reducing Cargo target directory size with -Zno-embed-metadata",
    "url": "https://kobzol.github.io/rust/rustc/2025/06/02/reduce-cargo-target-dir-size-with-z-no-embed-metadata.html",
    "summary": "This article discusses a new method to reduce the disk usage of Rust's `target` directory using the `-Zno-embed-metadata` flag. The author explains that the `target` directory's size is a common pain point due to Rust's \"build everything from source\" model and the default enablement of debuginfo and incremental compilation.\n\nThe article highlights that compiled Rust crates duplicate metadata. During compilation, Cargo uses pipelining, generating both `.rlib` files (containing object code and metadata) and `.rmeta` files (containing metadata). The `-Zno-embed-metadata` flag, implemented by the author, prevents metadata duplication by only including metadata in `.rmeta` files and a minimal \"metadata stub\" in `.rlib` files.\n\nThe author provides benchmarks showing that this flag can reduce the `target` directory size by 9-36%, with the most significant reductions in release mode or when debuginfo/incremental compilation is disabled. While initially hoping for faster compilation, the author notes that the speed improvement is minimal.\n\nThe author proposes making `-Zno-embed-metadata` the default behavior to benefit all users. Due to concerns about backwards compatibility, they suggest enabling it by default in the nightly toolchain and then flipping the Cargo flag to allow opting out instead of opting in.  They encourage users to experiment with the flag and report their findings.\n",
    "chinese_title": "使用 -Zno-embed-metadata 缩小 Cargo 目标目录大小",
    "chinese_summary": "本文探讨了一种使用`-Zno-embed-metadata`标志来减少Rust `target`目录磁盘空间占用的新方法。作者解释说，由于Rust的“从源代码构建一切”模型以及默认启用的debuginfo和增量编译，`target`目录的大小是一个常见的痛点。\n\n文章强调，编译后的Rust crate会重复元数据。在编译过程中，Cargo使用流水线，生成`.rlib`文件（包含目标代码和元数据）和`.rmeta`文件（包含元数据）。作者实现的`-Zno-embed-metadata`标志通过仅在`.rmeta`文件中包含元数据，并在`.rlib`文件中包含最小的“元数据存根”来防止元数据重复。\n\n作者提供了基准测试，表明该标志可以将`target`目录的大小减少9-36％，在release模式或禁用debuginfo/增量编译时效果最显著。虽然最初希望加快编译速度，但作者指出速度提升非常小。\n\n作者建议将`-Zno-embed-metadata`设置为默认行为，以使所有用户受益。由于担心向后兼容性，他们建议在nightly工具链中默认启用它，然后反转Cargo标志，允许选择退出而不是选择加入。他们鼓励用户尝试该标志并报告他们的发现。"
  },
  {
    "id": "44157077",
    "title": "ReasoningGym: Reasoning Environments for RL with Verifiable Rewards",
    "url": "https://arxiv.org/abs/2505.24760",
    "summary": "This arXiv article, submitted on May 30, 2025, introduces Reasoning Gym (RG), a new reinforcement learning (RL) environment library designed to facilitate the development and evaluation of reasoning models. RG distinguishes itself by providing over 100 data generators and verifiers across diverse domains such as algebra, arithmetic, computation, cognition, geometry, graph theory, logic, and common games.\n\nA key feature of RG is its capacity for procedural generation, which enables the creation of virtually limitless training data with adjustable complexity levels. This addresses a limitation of existing reasoning datasets, which are typically fixed. This allows for continuous model evaluation across a spectrum of difficulty.\n\nThe authors, Zafir Stojanovski, Oliver Stanley, Joe Sharratt, Richard Jones, Abdulhakeem Adefioye, and Jean Kaddour, demonstrate RG's effectiveness in both evaluating and training reasoning models through experimental results. The paper also provides a link to the code for the Reasoning Gym library. The article is categorized under Machine Learning (cs.LG), Artificial Intelligence (cs.AI), and Computation and Language (cs.CL).\n",
    "chinese_title": "ReasoningGym：基于可验证奖励的强化学习推理环境",
    "chinese_summary": "这篇2025年5月30日提交于arXiv的文章，介绍了推理健身房（Reasoning Gym, RG），一个旨在促进推理模型开发和评估的新型强化学习（RL）环境库。RG的独特之处在于其提供了超过100个数据生成器和验证器，涵盖了代数、算术、计算、认知、几何、图论、逻辑和常见游戏等多个领域。\n\nRG的一个关键特征是其程序化生成能力，这使得创建具有可调节复杂程度的近乎无限的训练数据成为可能。这解决了现有推理数据集通常是固定的局限性。这允许在难度范围内进行持续的模型评估。\n\n作者Zafir Stojanovski, Oliver Stanley, Joe Sharratt, Richard Jones, Abdulhakeem Adefioye和Jean Kaddour通过实验结果展示了RG在评估和训练推理模型方面的有效性。该论文还提供了推理健身房库的代码链接。该文章被归类于机器学习 (cs.LG)，人工智能 (cs.AI) 和计算与语言 (cs.CL) 类别下。"
  },
  {
    "id": "44157406",
    "title": "ThorVG: Super Lightweight Vector Graphics Engine",
    "url": "https://www.thorvg.org/about",
    "summary": "ThorVG is an open-source, lightweight vector graphics engine designed for creating scenes and animations. It emphasizes both power and efficiency, offering intuitive interfaces with a small footprint. It supports various primitives like lines, shapes, fills, strokes, scene management, composition, text, images (SVG, JPG, PNG, WebP), effects (blur, shadows, tint), and Lottie animations.\n\nThorVG supports platforms including Linux, MacOS, Windows, Tizen, iOS, Android, Web, Flutter, and more, and offers modular components for optimal size and maintainability. It allows seamless integration by transitioning drawing contexts and supports synchronous or asynchronous rendering via backend raster engines.\n\nRender backends include CPU/SIMD, OpenGL/ES, WebGL, and WebGPU. WebGPU support is a key feature, leveraging compute shaders for enhanced optimization. ThorVG also incorporates a threading mechanism using a task scheduler based on thread pools for encoding, decoding, updating, and rendering. It includes an SVG interpreter adhering to the SVG Tiny specification and supports Lottie animations.\n\nThe ThorVG viewer is a resource verification tool for real-time editing and exporting. Practical examples include its use in Canva iOS (resulting in significant performance improvements), dotLottie player by LottieFiles, Flux Audio, Godot game engine, Lottie Creator, LVGL, and Tizen. The project is open-source and welcomes contributions and sponsorships.\n",
    "chinese_title": "ThorVG：超轻量级矢量图形引擎",
    "chinese_summary": "ThorVG：轻量级开源矢量图形引擎，旨在创建场景和动画。它兼顾性能和效率，提供直观的接口和较小的体积。它支持各种基本元素，如线条、形状、填充、描边、场景管理、合成、文本、图像（SVG、JPG、PNG、WebP）、特效（模糊、阴影、着色）和Lottie动画。\n\nThorVG支持包括Linux、MacOS、Windows、Tizen、iOS、Android、Web、Flutter等平台，并提供模块化组件以优化大小和可维护性。它允许通过转换绘图上下文进行无缝集成，并通过后端光栅引擎支持同步或异步渲染。\n\n渲染后端包括CPU/SIMD、OpenGL/ES、WebGL和WebGPU。WebGPU支持是一项关键特性，利用计算着色器进行增强优化。ThorVG还结合了一种线程机制，使用基于线程池的任务调度器进行编码、解码、更新和渲染。它包含一个符合SVG Tiny规范的SVG解释器，并支持Lottie动画。\n\nThorVG查看器是一个资源验证工具，用于实时编辑和导出。实际案例包括在Canva iOS（带来了显著的性能改进）、LottieFiles的dotLottie播放器、Flux Audio、Godot游戏引擎、Lottie Creator、LVGL和Tizen中的应用。该项目是开源的，欢迎贡献和赞助。"
  },
  {
    "id": "44155247",
    "title": "The Princeton INTERCAL Compiler's source code",
    "url": "https://esoteric.codes/blog/published-for-the-first-time-the-original-intercal72-compiler-code",
    "summary": "This article announces the public release of the original source code for the Princeton INTERCAL-72 compiler, a significant event for esolang enthusiasts. INTERCAL, created in 1972 by Don Woods and Jim Lyon, is considered the first true esoteric programming language (esolang), intentionally designed to be difficult and unconventional, parodying other languages of the time.\n\nThe article highlights INTERCAL's unique features, including its reliance on the \"PLEASE\" command, which introduces a subjective element to the interpreter's behavior, reflecting a playful critique of programming paradigms. While INTERCAL wasn't minimalist like later esolangs (FALSE, Befunge, brainfuck), it dramatized the act of programming in a unique way.\n\nThe released code, painstakingly transcribed and refined by Sean Haas from original printouts, reveals INTERCAL's inner workings, including its reliance on string manipulation for mathematical operations, contributing to its notorious slowness. The original INTERCAL-72 compiler was never publicly released, influencing the development of later versions like C-INTERCAL by Eric S. Raymond, who worked without access to the original source code. Now with the original code available, programmers can experience INTERCAL-72 firsthand and explore its intricacies. The scans and transcribed code are available on GitHub.\n",
    "chinese_title": "普林斯顿INTERCAL编译器源代码",
    "chinese_summary": "本文宣布公开发布普林斯顿INTERCAL-72编译器的原始源代码，这对深奥编程语言爱好者来说是一件意义重大的事件。INTERCAL由Don Woods和Jim Lyon于1972年创建，被认为是第一个真正的深奥编程语言(esolang)，它被有意设计成困难且非常规的语言，以此来模仿当时的其它语言。\n\n本文重点介绍了INTERCAL的独特功能，包括其对“PLEASE”命令的依赖，该命令为解释器的行为引入了一个主观因素，反映了对编程范例的一种有趣的批判。虽然INTERCAL不像后来的深奥编程语言(FALSE、Befunge、brainfuck)那样简约，但它以独特的方式戏剧化了编程行为。\n\n由Sean Haas从原始打印件中精心转录和改进的已发布代码，揭示了INTERCAL的内部运作，包括其对字符串操作的依赖来进行数学运算，这也导致了它臭名昭著的缓慢。最初的INTERCAL-72编译器从未公开发布，这影响了Eric S. Raymond对后续版本(如C-INTERCAL)的开发，他在没有访问原始源代码的情况下进行了工作。现在有了原始代码，程序员可以亲身体验INTERCAL-72并探索其复杂性。扫描件和转录的代码可在GitHub上找到。"
  },
  {
    "id": "44159166",
    "title": "Cloudlflare builds OAuth with Claude and publishes all the prompts",
    "url": "https://github.com/cloudflare/workers-oauth-provider/commits/main/",
    "summary": "This GitHub repository, `cloudflare/workers-oauth-provider`, documents Cloudflare's project to build an OAuth provider using Cloudflare Workers, seemingly leveraging AI assistance from Anthropic's Claude. While the summary doesn't explicitly mention Claude's role in generating prompts, the commit history includes specific instances of using Claude, notably: \"Ask Claude to configure github action to run tests.\" This hints at AI assistance in development workflows.\n\nThe repository's history shows ongoing development and improvements to the OAuth provider. Key updates include:\n\n*   **Security Enhancements:** Mitigation of PKCE downgrade attacks and validation of `redirect_uri` on authorize endpoints.\n*   **Functionality Additions:** Introduction of `apiHandlers` for multiple API handler support and an `onError` callback for error handling.\n*   **CI/CD Improvements:**  The commits show the use of GitHub Actions for CI/CD, and a switch to PNPM for package management.\n*   **Refactoring/Maintenance:** Removal of unused type imports and updates to dependencies (pnpm-lock.yaml).\n*   **Release Management:** Tagging and releasing of versions 0.0.2 through 0.0.5.\n*   **Documentation:** Revisions to the README, particularly concerning the \"AI section\".\n\nThe repository appears to be a working OAuth provider built on Cloudflare Workers, undergoing continuous development with a focus on security, functionality, and usability. The use of Claude suggests an innovative approach to development, where AI assists in tasks such as test configuration.\n",
    "chinese_title": "Cloudflare 用 Claude 构建 OAuth 并发布所有提示词",
    "chinese_summary": "GitHub仓库`cloudflare/workers-oauth-provider`记录了Cloudflare使用Cloudflare Workers构建OAuth provider的项目，该项目似乎利用了Anthropic的Claude的AI辅助。虽然摘要没有明确提及Claude在生成提示方面的作用，但提交历史记录包括使用Claude的具体实例，特别是：“Ask Claude to configure github action to run tests.” 这暗示了在开发工作流程中使用了AI辅助。\n\n该仓库的历史记录显示了OAuth provider的持续开发和改进。主要更新包括：\n\n*   **安全增强：** 缓解PKCE降级攻击，并在授权端点上验证`redirect_uri`。\n*   **功能添加：** 引入`apiHandlers`以支持多个API处理程序，并引入`onError`回调以进行错误处理。\n*   **CI/CD改进：** 提交记录显示使用了GitHub Actions进行CI/CD，并切换到PNPM进行包管理。\n*   **重构/维护：** 删除未使用的类型导入，并更新依赖项 (pnpm-lock.yaml)。\n*   **发布管理：** 标记和发布版本0.0.2到0.0.5。\n*   **文档：** 修订README，特别是关于“AI部分”。\n\n该仓库似乎是一个构建在Cloudflare Workers上的可行OAuth provider，正在进行持续开发，重点是安全性、功能性和可用性。Claude的使用表明了一种创新的开发方法，其中AI辅助执行测试配置等任务。"
  },
  {
    "id": "44143253",
    "title": "Cuss: Map of profane words to a rating of sureness",
    "url": "https://github.com/words/cuss",
    "summary": "The \"Cuss\" package provides lists of profane words and phrases in multiple languages, along with a \"sureness\" rating indicating how likely a term is to be used as profanity rather than clean text. This rating, ranging from 0 to 2, reflects contextual likelihood, not vulgarity level.\n\nThe package is intended for natural language research, *not* profanity filtering. Installation is via npm for Node.js or direct import for Deno and browsers.\n\nThe API offers language-specific datasets, each exported as `cuss`. Datasets include English, Arabic (Latin), Spanish, French, Italian, Portuguese, and European Portuguese. Each entry contains a map of offensive words to a sureness rating.\n\nThe data sources include Luis von Ahn's Research Group, Wikipedia, naughty-words, revistagq.com, taringa.net, mundoxat.om, wiktionary.org, Treccani, and chucknorris-io/swear-words.\n\nThe package is fully typed with TypeScript and compatible with maintained Node.js versions (14.14+, 16.0+), Deno, and modern browsers. It is related to other text analysis tools like \"buzzwords,\" \"dale-chall,\" and \"profanities.\"\n\nContributions are welcome, requiring adherence to project guidelines, including testing with Node.js 18.0+. The package is licensed under the MIT license and is considered safe.\n",
    "chinese_title": "脏话: 粗俗词汇与确信程度的映射",
    "chinese_summary": "\"Cuss\" 包提供多种语言的脏话短语列表，以及一个“确定性”评级，指示术语被用作脏话而不是干净文本的可能性。 此评级范围从 0 到 2，反映了上下文可能性，而不是粗俗程度。\n\n该软件包旨在用于自然语言研究，*而非*脏话过滤。可以通过 npm 安装 Node.js，或者直接导入 Deno 和浏览器。\n\nAPI 提供特定于语言的数据集，每个数据集都导出为 `cuss`。数据集包括英语、阿拉伯语（拉丁语）、西班牙语、法语、意大利语、葡萄牙语和欧洲葡萄牙语。每个条目都包含一个从冒犯性词语到确定性评级的映射。\n\n数据来源包括 Luis von Ahn 的研究小组、维基百科、naughty-words、revistagq.com、taringa.net、mundoxat.om、wiktionary.org、Treccani 和 chucknorris-io/swear-words。\n\n该软件包使用 TypeScript 完全类型化，并且与维护的 Node.js 版本（14.14+、16.0+）、Deno 和现代浏览器兼容。它与诸如“buzzwords”、“dale-chall”和“profanities”之类的其他文本分析工具相关。\n\n欢迎投稿，需要遵守项目指南，包括使用 Node.js 18.0+ 进行测试。该软件包已获得 MIT 许可证许可，并且被认为是安全的。"
  },
  {
    "id": "44157584",
    "title": "Show HN: Fast Random Library for C++17",
    "url": "https://github.com/DmitriBogdanov/UTL/blob/master/docs/module_random.md",
    "summary": "This \"Show HN\" post highlights a C++17 random number generation library named \"UTL\" by user DmitriBogdanov. The post is a way for the author to showcase the library and potentially gather feedback or contributions from the Hacker News community. The popularity of the library is indicated by its 271 stars and 10 forks on a platform like GitHub. The key takeaway is that this is a resource for developers seeking a fast random number generation solution compatible with C++17.\n",
    "chinese_title": "Show HN: C++17 快速随机数库",
    "chinese_summary": "DmitriBogdanov发布的C++17随机数生成库UTL，Show HN展示帖。该库在GitHub等平台拥有271个星标和10个分支，表明其受欢迎程度。主要面向寻求兼容C++17的快速随机数生成解决方案的开发者。"
  },
  {
    "id": "44160012",
    "title": "Younger generations less likely to have dementia, study suggests",
    "url": "https://www.theguardian.com/society/2025/jun/02/younger-generations-less-likely-dementia-study",
    "summary": "生成摘要时出错",
    "chinese_title": "研究表明，年轻一代患痴呆症的可能性较低",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44142259",
    "title": "I made a chair",
    "url": "https://milofultz.com/2025-05-27-i-made-a-chair.html",
    "summary": "The author built a simple chair based on an Instructable using minimal materials: one 8-foot 2\"x12\" board. They highlight the project's simplicity and speed, despite using less-than-ideal tools (a circular saw and an oscillating multitool). The author sealed the cut ends of the wood and is satisfied with the outcome, even preferring it to their other chairs.\n",
    "chinese_title": "我做了一把椅子。",
    "chinese_summary": "作者用最少的材料，一根8英尺长的2\"x12\"木板，按照Instructable上的教程制作了一把简单的椅子。他们强调了这个项目的简单和快速，尽管使用了不太理想的工具（圆锯和多功能振荡工具）。作者封住了木材的切割端面，并对结果感到满意，甚至更喜欢它胜过其他的椅子。"
  },
  {
    "id": "44155761",
    "title": "Is “The Phoenician Scheme” Wes Anderson's Most Emotional Film?",
    "url": "https://www.newyorker.com/magazine/2025/06/09/the-phoenician-scheme-movie-review",
    "summary": "This article analyzes Wes Anderson's latest film, \"The Phoenician Scheme,\" arguing that it's his most emotionally direct work yet. While maintaining Anderson's signature stylistic elements like symmetrical framing, elaborate production design, and densely plotted action, the film's straightforward narrative allows for a clearer exploration of its themes and characters.\n\nThe movie revolves around Anatole \"Zsa-zsa\" Korda (Benicio del Toro), a ruthless industrialist inspired by figures like Calouste Gulbenkian and Orson Welles's Mr. Arkadin. He's pursuing a massive infrastructure project in Phoenicia, which is based on slave labor and makes him a target for enemies, and seeks the blessing of his daughter, Liesl (Mia Threapleton). After a near-death experience, Zsa-zsa becomes increasingly troubled by his actions and seeks Liesl's approval, even if it means betraying his half-brother. The film depicts a family drama within a context of international intrigue and Cold War undertones.\n\nThe article highlights Anderson's meticulous visual style, using objects like corncob pipes and shoeboxes to evoke personal and cultural memories. It also explores the film's surprising action sequences, noting how Anderson stylizes violence, reversing Hitchcock's approach. The film explores themes of family, identity, truth, and redemption, contrasting the era of buccaneer industrialism with a more bureaucratic future. Ultimately, the film blends beauty with opposition and revolt, resulting in a powerful and moving cinematic experience.\n",
    "chinese_title": "《腓尼基骗局》是韦斯·安德森最动情的电影吗？",
    "chinese_summary": "This article analyzes Wes Anderson's latest film, \"The Phoenician Scheme,\" arguing that it's his most emotionally direct work yet. While maintaining Anderson's signature stylistic elements like symmetrical framing, elaborate production design, and densely plotted action, the film's straightforward narrative allows for a clearer exploration of its themes and characters.\n\nThe movie revolves around Anatole \"Zsa-zsa\" Korda (Benicio del Toro), a ruthless industrialist inspired by figures like Calouste Gulbenkian and Orson Welles's Mr. Arkadin. He's pursuing a massive infrastructure project in Phoenicia, which is based on slave labor and makes him a target for enemies, and seeks the blessing of his daughter, Liesl (Mia Threapleton). After a near-death experience, Zsa-zsa becomes increasingly troubled by his actions and seeks Liesl's approval, even if it means betraying his half-brother. The film depicts a family drama within a context of international intrigue and Cold War undertones.\n\nThe article highlights Anderson's meticulous visual style, using objects like corncob pipes and shoeboxes to evoke personal and cultural memories. It also explores the film's surprising action sequences, noting how Anderson stylizes violence, reversing Hitchcock's approach. The film explores themes of family, identity, truth, and redemption, contrasting the era of buccaneer industrialism with a more bureaucratic future. Ultimately, the film blends beauty with opposition and revolt, resulting in a powerful and moving cinematic experience.\n"
  },
  {
    "id": "44125334",
    "title": "EasyTier – P2P mesh VPN written in Rust using Tokio",
    "url": "https://easytier.cn/en/",
    "summary": "生成摘要时出错",
    "chinese_title": "EasyTier – P2P mesh VPN written in Rust using Tokio",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44130915",
    "title": "The Atomic Airplane",
    "url": "https://whatisnuclear.com/the-story-of-the-atomic-airplane.html",
    "summary": "生成摘要时出错",
    "chinese_title": "The Atomic Airplane",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44153732",
    "title": "The rise of judgement over technical skill",
    "url": "https://notsocommonthoughts.com/blog/ai-and-judgement/",
    "summary": "This article, originally published on MapsAll, uses musician Brian Eno's 1995 observation about computer sequencers to explain the shift happening in the AI era: technical skill is becoming less important than judgment. Eno noted that sequencers removed the skill barrier in music production, replacing it with the need for judgment in choosing what to create.\n\nThe article argues this is mirrored by AI's democratization of various tasks like writing, image generation, coding, and data analysis. AI allows almost anyone to produce output that superficially resembles professional work, dissolving the traditional barrier of technical expertise.\n\nConsequently, the key differentiator now lies in exercising sound judgment. This includes knowing what to create in the first place, making meaningful choices from a multitude of AI-generated possibilities, accurately evaluating the quality of the output, and understanding the appropriate context for its application.\n\nLooking ahead, the article predicts a shift from technical execution to strategic judgment in many roles. The most successful professionals will be those who can effectively frame problems, ask the right questions, make informed decisions, and provide meaningful direction to AI tools. Ultimately, in an era where \"Can you do it?\" is less relevant, the focus shifts to \"What should you do, and why?\" Making sound judgements will be our most valued asset.\n",
    "chinese_title": "判断力超越技术能力",
    "chinese_summary": "本文最初发表于MapsAll，借用音乐家 Brian Eno 1995 年关于电脑音序器的观察，来解释人工智能时代正在发生的转变：技术技能变得不如判断力重要。Eno 指出，音序器消除了音乐制作中的技能障碍，取而代之的是选择创作内容的判断力。\n\n文章认为，人工智能对写作、图像生成、编程和数据分析等各种任务的普及也反映了这一点。人工智能几乎允许任何人生成表面上类似于专业作品的输出，从而消除了传统的技术专业知识壁垒。\n\n因此，现在的关键区别在于运用正确的判断力。这包括首先知道要创作什么，从大量人工智能生成的可能性中做出有意义的选择，准确评估输出的质量，以及理解其应用的适当环境。\n\n展望未来，文章预测许多角色将从技术执行转向战略判断。最成功的专业人士将是那些能够有效构建问题、提出正确问题、做出明智决策并为人工智能工具提供有意义指导的人。最终，在一个“你能做到吗？”不再那么重要的时代，重点将转移到“你应该做什么，为什么？”，做出正确的判断将是我们最宝贵的财富。"
  },
  {
    "id": "44155741",
    "title": "Show HN: MBCompass – Android Compass App",
    "url": "https://github.com/MubarakNative/MBCompass",
    "summary": "MBCompass is an ad-free, lightweight, and accurate Android compass app built using Jetpack Compose. It uses the device's magnetometer, accelerometer, and gyroscope to provide real-time geomagnetic field updates and accurate compass readings based on magnetic north.\n\nKey features include displaying magnetic strength, supporting light/dark themes, keeping the screen on, supporting landscape orientation, displaying the user's current location using OpenStreetMap (requiring location permission), and offering smooth compass rotation. The app doesn't contain ads or in-app purchases.\n\nThe app is designed with the Android Lifecycle in mind, aiming for an efficient user experience. Contributions are welcome via issues and pull requests. MBCompass is licensed under the GNU General Public License, allowing users to freely use, share, study, and improve the software. The compass rose artwork is licensed under CC BY-SA 4.0.\n",
    "chinese_title": "Show HN: MBCompass – 安卓指南针应用",
    "chinese_summary": "MBCompass是一款无广告、轻量级且精准的Android指南针应用，采用Jetpack Compose构建。它利用设备的磁力计、加速度计和陀螺仪，提供实时的地磁场更新，并基于磁北提供精准的指南针读数。\n\n主要功能包括：显示磁场强度、支持浅色/深色主题、保持屏幕常亮、支持横向显示、使用OpenStreetMap显示用户当前位置（需要位置权限），以及提供流畅的指南针旋转。该应用不包含广告或应用内购买。\n\n该应用的设计充分考虑了Android生命周期，旨在提供高效的用户体验。欢迎通过问题和拉取请求进行贡献。MBCompass基于GNU通用公共许可证授权，允许用户自由使用、分享、学习和改进该软件。指南针玫瑰花图案基于CC BY-SA 4.0授权。"
  },
  {
    "id": "44155635",
    "title": "LFSR CPU Running Forth",
    "url": "https://github.com/howerj/lfsr-vhdl",
    "summary": "生成摘要时出错",
    "chinese_title": "LFSR CPU Running Forth",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44153738",
    "title": "LibriVox",
    "url": "https://librivox.org/",
    "summary": "LibriVox Community Podcast #157, released on May 2, 2025, focuses on kicking off \"Clean-Up Month\" at LibriVox. Hosted by Jpercival, the podcast runs for 22 minutes and 56 seconds and features contributions from multiple LibriVox community members, including ShrimpPhish, redrun, sparkleberry17, Rapunzelina, and adrianstephens.\n\nKey segments include:\n\n*   **Introduction (0:00)** Sets the stage for the podcast.\n*   **LibriVox in May (0:22) - redrun:** This segment likely discusses planned activities and focuses for LibriVox during the month of May.\n*   **May They All Get Into The Catalogue (1:28):** Suggests a focus on getting projects completed and added to the LibriVox catalog.\n*   **Statistics and Libriversaries (1:51):** This segment likely covers project statistics, member anniversaries, and milestones within the LibriVox community.\n*   **Archive Diving (2:47):** Takes a look back at past LibriVox activities and events, specifically mentioning 2007 March Madness and 2009 activities.\n\nThe overall theme of the podcast is community engagement, project completion, and celebrating LibriVox's history and progress. The \"Clean-Up Month\" likely involves tasks like prooflistening, editing, and cataloging to improve the quality and accessibility of the LibriVox audiobooks.\n",
    "chinese_title": "LibriVox\n有声书库",
    "chinese_summary": "LibriVox社区播客#157，于2025年5月2日发布，重点是启动LibriVox的“清理月”。该播客由Jpercival主持，时长22分56秒，并汇集了包括ShrimpPhish、redrun、sparkleberry17、Rapunzelina和adrianstephens在内的多位LibriVox社区成员的贡献。\n\n主要内容包括：\n\n*   **简介 (0:00)** 为播客奠定基调。\n*   **五月的LibriVox (0:22) - redrun：** 本环节可能讨论了LibriVox在五月期间的计划活动和重点。\n*   **愿他们都进入目录 (1:28)：** 建议专注于完成项目并将其添加到LibriVox目录中。\n*   **统计数据和Libriversaries (1:51)：** 本环节可能涵盖项目统计数据、成员纪念日和LibriVox社区内的里程碑事件。\n*   **档案挖掘 (2:47)：** 回顾过去的LibriVox活动和事件，特别提到了2007年三月疯狂和2009年的活动。\n\n播客的总体主题是社区参与、项目完成以及庆祝LibriVox的历史和进展。“清理月”可能涉及诸如校对、编辑和编目等任务，以提高LibriVox有声读物的质量和可访问性。"
  },
  {
    "id": "44125793",
    "title": "HeidiSQL Available Also for Linux",
    "url": "https://www.heidisql.com/forum.php?t=44068",
    "summary": "This article announces the pre-release of HeidiSQL 12.10.1.133 for Linux, marking the first tagged release for the platform.  Key features include SSH tunnel support using the external `ssh` command, translation support for 35 languages, status bar icons, bracket highlighting in SQL editors, functional grid cell editors (though with some known crashes), automatic tab restore, and functional table/view/routine/trigger/event editors. The release is built with Lazarus v3.8 and FreePascal v3.2.2.\n\nKnown issues include missing support for MS SQL and Interbase/Firebird, crashes in grid cell editors (especially when using Esc), a lack of .rpm package for RedHat based Linux (help is requested), and no word wrap in SQL editors.\n\nThe article also includes user feedback. An AUR package is available for Arch-based distributions. Users discussed preferred packaging formats, with suggestions for .tgz and Flatpak. One user reported success connecting via SSH tunnel. There's also a discussion about using `libmariadb.so` versus `libmariadbd.so`, the latter being incorrectly listed as an option. Users confirm `ssh` can be used for tunneling instead of PuTTY's `plink`. theming is handled by the OS, following light and dark mode settings, and SQL editor styling is available in Preferences. Users are directed to the bug tracker to report issues.\n",
    "chinese_title": "HeidiSQL 也可在 Linux 上使用",
    "chinese_summary": "本文宣布 HeidiSQL 12.10.1.133 Linux 平台的预发布版本，标志着该平台的首个标记发布。主要功能包括使用外部 `ssh` 命令的 SSH 隧道支持，35 种语言的翻译支持，状态栏图标，SQL 编辑器中的括号高亮显示，功能性网格单元格编辑器（但存在一些已知崩溃），自动标签页恢复，以及功能性表/视图/例程/触发器/事件编辑器。此版本使用 Lazarus v3.8 和 FreePascal v3.2.2 构建。\n\n已知问题包括缺少对 MS SQL 和 Interbase/Firebird 的支持，网格单元格编辑器中的崩溃（尤其是在使用 Esc 时），缺少基于 RedHat 的 Linux 的 .rpm 包（请求帮助），以及 SQL 编辑器中没有自动换行。\n\n本文还包括用户反馈。AUR 包可用于基于 Arch 的发行版。用户讨论了首选的打包格式，并提出了 .tgz 和 Flatpak 的建议。一位用户报告成功通过 SSH 隧道连接。还有关于使用 `libmariadb.so` 与 `libmariadbd.so` 的讨论，后者被错误地列为选项。用户确认 `ssh` 可以用于隧道连接，而不是 PuTTY 的 `plink`。主题由操作系统处理，遵循浅色和深色模式设置，SQL 编辑器样式可在“首选项”中设置。用户被引导至错误跟踪器以报告问题。"
  },
  {
    "id": "44142650",
    "title": "Hip: C++ Heterogeneous-Compute Interface for Portability",
    "url": "https://github.com/ROCm/hip",
    "summary": "生成摘要时出错",
    "chinese_title": "Hip: C++ Heterogeneous-Compute Interface for Portability",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44157701",
    "title": "Whatever happened to cheap eReaders?",
    "url": "https://shkspr.mobi/blog/2025/05/whatever-happened-to-cheap-ereaders/",
    "summary": "This article explores why affordable eReaders, like the never-released £8 txtr beagle, haven't materialized despite technological advancements. While the cheapest current Kindle costs around £100 (similar to its 2012 price adjusted for inflation), and alternative brands range from £85 to £150, cheaper wholesale options exist on Alibaba.\n\nThe author argues four primary factors hinder the production of truly cheap eReaders. Firstly, reading itself is a niche hobby, and eReading is an even smaller subset. Secondly, eInk technology remains expensive due to a near-monopoly held by the patent-owning company, pushing the screen cost alone to around £20 wholesale. Thirdly, Android, while open source, presents a bottleneck because Google doesn't certify eInk devices for newer versions, forcing manufacturers to rely on older software or develop their own operating systems. Finally, unlike Apple's old iPod model or game consoles, eReader manufacturers cannot easily cross-subsidize hardware costs with content sales, as the eBook market isn't as tightly controlled as it once was.\n\nWhile DIY open-source options and secondhand devices exist, they come with limitations and potential drawbacks. The author envisions a desirable price point of £8-£20, but believes the existing monopoly on screen technology, coupled with the lack of retail support outside of Amazon and Kobo, sets a realistic price floor significantly higher, suggesting buying second-hand or waiting for patents to expire as current alternatives.\n",
    "chinese_title": "廉价电子书阅读器都去哪儿了？",
    "chinese_summary": "本文探讨了为何像从未发布的 txtr beagle 这样价格实惠的电子阅读器，尽管技术不断进步，却未能实现。虽然目前最便宜的 Kindle 售价约为 100 英镑（与 2012 年经通货膨胀调整后的价格相似），其他品牌的售价从 85 英镑到 150 英镑不等，但阿里巴巴上存在更便宜的批发选择。\n\n作者认为，四个主要因素阻碍了真正廉价电子阅读器的生产。首先，阅读本身就是一个小众爱好，而电子阅读甚至是一个更小的子集。其次，由于专利拥有公司近乎垄断，电子墨水技术仍然昂贵，仅屏幕成本就高达约 20 英镑的批发价。第三，Android 虽然是开源的，但也存在瓶颈，因为 Google 不会为较新版本的电子墨水设备进行认证，迫使制造商依赖旧软件或开发自己的操作系统。最后，与 Apple 的旧 iPod 型号或游戏机不同，电子阅读器制造商无法轻易地用内容销售来交叉补贴硬件成本，因为电子书市场不像以前那样受到严格控制。\n\n虽然存在 DIY 开源选项和二手设备，但它们存在局限性和潜在缺点。作者设想了一个理想的价格点为 8-20 英镑，但认为现有屏幕技术的垄断，加上亚马逊和 Kobo 之外缺乏零售支持，将实际价格下限设置得高得多，建议购买二手货或等待专利到期作为当前的替代方案。"
  },
  {
    "id": "44159681",
    "title": "Could floating solar panels on a reservoir help the Colorado River?",
    "url": "https://arstechnica.com/science/2025/06/can-floating-solar-panels-on-a-reservoir-help-the-colorado-river/",
    "summary": "This article explores the potential of floating solar panels (floatovoltaics) as a solution to water shortages in the Colorado River Basin, which supplies water to 40 million people across the western US and Mexico. The Gila River Indian Community (GRIC) in Arizona is pioneering this technology, with canal-covering solar panels already in operation and plans for floating solar on a reservoir.\n\nFloatovoltaics can reduce evaporation, generate carbon-free electricity, and reduce reliance on dams for power generation. An NREL study found that floating solar on reservoirs behind federally owned dams could power 100 million US homes annually. Lake Powell and Lake Mead could potentially host significant floating solar capacity.\n\nHowever, the technology faces obstacles. It's more expensive to install than land-based solar, may produce slightly less energy due to limitations in tilting, and can potentially increase greenhouse gas emissions from the water body. Additionally, modeling evaporation savings can be difficult.\n\nDespite these challenges, advocates like Scott Young champion floatovoltaics as a valuable tool in the \"silver buckshot\" approach to water management. Colorado has studied the technology and estimated significant water savings potential. However, water managers in major cities like Phoenix and Denver find the technology currently too costly and immature. While floatovoltaics is not a singular solution, proponents believe it can play a role in diversifying the energy mix and conserving water in the drought-stricken West.\n",
    "chinese_title": "在水库上安装漂浮太阳能板能帮助科罗拉多河吗？",
    "chinese_summary": "漂浮太阳能：科罗拉多河缺水问题的潜在解决方案"
  },
  {
    "id": "44131324",
    "title": "What works (and doesn't) selling formal methods",
    "url": "https://www.galois.com/articles/what-works-and-doesnt-selling-formal-methods",
    "summary": "生成摘要时出错",
    "chinese_title": "What works (and doesn't) selling formal methods",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44158859",
    "title": "Workers Want a Four-Day Week. Companies Should Too",
    "url": "https://www.wsj.com/lifestyle/workplace/of-course-workers-want-a-four-day-week-companies-should-too-0837a0a1",
    "summary": "生成摘要时出错",
    "chinese_title": "工人想要四天工作制，公司也应该如此",
    "chinese_summary": "生成摘要出错"
  },
  {
    "id": "44150803",
    "title": "Root shell on a credit card terminal",
    "url": "https://stefan-gloor.ch/yomani-hack",
    "summary": "This article details a security researcher's exploration of a Worldline Yomani XR credit card terminal. Initially, the researcher expected robust security features. After physical disassembly, they discovered tamper detection mechanisms like pressure-sensitive strips and copper traces, which triggered a \"TAMPER DETECTED\" state when the device was opened.\n\nUnable to perform runtime exploration, the researcher extracted the firmware from the flash chip, finding it surprisingly unencrypted but with a non-standard ECC layout that required custom tools to read the YAFFS2 filesystem. The firmware revealed a Linux system running an outdated kernel and userspace libraries.\n\nUnexpectedly, the researcher discovered an exposed root shell on the serial console with a simple \"root\" login. Critically, this debug port was accessible from outside the device without triggering tamper detection, potentially allowing attackers to deploy malware easily.\n\nDespite the severity of the exposed root shell, the researcher found that the Linux system only handled networking and updates, not sensitive card data or direct control of peripherals. A separate, secure processor (mp1) handled card transactions and display, running encrypted and signed firmware. The Linux core (mp2) boots regardless of tamper state and loads the secure bootloader that determines whether to display the tamper message or boot the secure image.\n\nWhile acknowledging the unnecessary attack surface, the researcher concluded the root shell vulnerability was less critical than initially thought, as sensitive data wasn't directly accessible. The author speculates that the debug feature may have inadvertently been present in a production firmware version and has since been addressed internally.\n",
    "chinese_title": "信用卡终端上的Root权限",
    "chinese_summary": "对Worldline Yomani XR信用卡终端的安全研究：意外发现"
  },
  {
    "id": "44154511",
    "title": "Show HN: Moon Phase Algorithms for C, Lua, Awk, JavaScript, etc.",
    "url": "https://github.com/oliverkwebb/moonphase",
    "summary": "This \"Show HN\" post introduces \"moonphase,\" a collection of code snippets designed to calculate the phase of the moon across various programming languages. The goal is to provide a \"Werewolf Early Warning System,\" hinting at a practical (or perhaps whimsical) application of the code.\n\nThe project provides implementations in languages including C/C++, Rust, Zig, Lua, JavaScript, Python, Raku, awk, and bc. Each function takes a timestamp (usually Unix epoch) as input and outputs the \"age\" of the moon in radians, which can then be used to calculate the illuminated fraction of the moon. The author provides example code (Rust) demonstrating how to derive a phase index, useful for mapping to phase names and emojis.\n\nThe algorithms are based on those used in \"moontool,\" a program from the 1980s, which itself drew inspiration from \"Practical Astronomy With Your Calculator.\"\n\nThe author outlines a \"Copy and Paste Rule\" for contributions, emphasizing that submissions should be self-contained, error-free when copy-pasted, and avoid global mutations or `#define` directives. The focus is on creating pure, independent functions within the constraints of each language. Essentially, contributions should be easily integrated into existing projects.\n",
    "chinese_title": "Show HN: C、Lua、Awk、JavaScript等语言的月相算法",
    "chinese_summary": "此“Show HN”帖子介绍了“moonphase”，这是一个代码片段集合，旨在计算各种编程语言中的月相。其目标是提供一个“狼人预警系统”，暗示了该代码的实用（或可能异想天开）应用。\n\n该项目提供了 C/C++、Rust、Zig、Lua、JavaScript、Python、Raku、awk 和 bc 等语言的实现。每个函数都以时间戳（通常是 Unix 纪元）作为输入，并以弧度输出月亮的“年龄”，然后可用于计算月亮的照亮部分。作者提供了示例代码（Rust），演示了如何推导出相位指数，该指数可用于映射到相位名称和表情符号。\n\n这些算法基于 20 世纪 80 年代的程序“moontool”中使用的算法，“moontool”本身则从“用计算器进行实用天文学”中汲取了灵感。\n\n作者概述了贡献的“复制粘贴规则”，强调提交的内容应是自包含的，复制粘贴时没有错误，并避免全局突变或 `#define` 指令。重点是在每种语言的约束范围内创建纯粹的、独立的函数。本质上，贡献应该易于集成到现有项目中。"
  },
  {
    "id": "44155069",
    "title": "TPDE: A Fast Adaptable Compiler Back-End Framework",
    "url": "https://arxiv.org/abs/2505.22610",
    "summary": "This arXiv article introduces TPDE, a novel compiler back-end framework designed for fast and adaptable code generation, particularly beneficial for just-in-time (JIT) compilation scenarios where minimizing compilation latency is crucial. The authors, Tobias Schwarz, Tobias Kamm, and Alexis Engelke from the Technical University of Munich, highlight the limitations of existing compiler frameworks like LLVM, which often prioritize optimization over compilation speed and involve an extra intermediate representation (IR) translation step.\n\nTPDE overcomes these limitations by adapting to existing SSA-form code representations. It utilizes an IR-specific adapter for canonical data access and semantic specification, enabling compilation in a single pass that combines instruction selection, register allocation, and instruction encoding after an initial analysis pass. The framework generates target instructions derived from high-level code using LLVM's Machine IR, which promotes portability across different architectures and allows for optimizations during code generation.\n\nThe authors demonstrate TPDE's versatility by creating a new back-end for LLVM targeting x86-64 and AArch64 architectures. Performance evaluations on SPECint 2017 show a significant speedup (8-24x) in compilation time compared to LLVM -O0 while maintaining comparable runtime performance. Furthermore, the paper illustrates the advantages of adapting to domain-specific IRs, like WebAssembly and database query compilation, in JIT environments, where bypassing the IR translation process further reduces latency. The paper consists of 23 pages and includes 10 figures.\n",
    "chinese_title": "TPDE：一种快速可适应的编译器后端框架",
    "chinese_summary": "这篇arXiv文章介绍了TPDE，一种新型编译器后端框架，专为快速且适应性强的代码生成而设计，特别适用于即时编译（JIT）场景，在这些场景中，最大限度地减少编译延迟至关重要。来自慕尼黑工业大学的Tobias Schwarz、Tobias Kamm和Alexis Engelke指出了现有编译器框架（如LLVM）的局限性，这些框架通常优先考虑优化而非编译速度，并且涉及额外的中间表示（IR）转换步骤。\n\nTPDE通过适应现有的SSA形式代码表示克服了这些限制。它利用特定于IR的适配器来进行规范数据访问和语义规范，从而能够在初始分析之后，通过单次传递结合指令选择、寄存器分配和指令编码来进行编译。该框架使用LLVM的机器IR生成源自高级代码的目标指令，从而提高了跨不同体系结构的移植性，并允许在代码生成期间进行优化。\n\n作者通过为LLVM创建针对x86-64和AArch64架构的新后端来证明TPDE的多功能性。在SPECint 2017上的性能评估显示，与LLVM -O0相比，编译时间显着加速（8-24倍），同时保持了相当的运行时性能。此外，该论文还说明了适应领域特定IR（如WebAssembly和数据库查询编译）在JIT环境中的优势，在这些环境中，绕过IR转换过程可进一步减少延迟。该论文共23页，包含10个图表。"
  },
  {
    "id": "44142955",
    "title": "In POSIX, you can theoretically use inode zero",
    "url": "https://utcc.utoronto.ca/~cks/space/blog/unix/POSIXAllowsZeroInode",
    "summary": "Chris Siebenmann's blog, Wandering Thoughts, is blocking access to users with outdated browsers as a measure to combat a surge of high-volume web crawlers. These crawlers, often disguised with old Chrome user agents and seemingly collecting data for LLM training, are causing a significant load on the server.\n\nThe anti-crawler precautions implemented aim to reduce this load by blocking these suspicious browsers. If a user encounters this message in error while using a current browser, they are encouraged to contact Chris Siebenmann at his university email address, providing details about their browser and its User-Agent string.\n\nA specific issue is addressed regarding archive services like archive.today, archive.ph, and archive.is. These services are flagged as problematic crawlers because they mimic malicious actors by using old Chrome User-Agent values, operating from widely distributed IP addresses, and sometimes utilizing falsified reverse DNS entries. The author recommends using archive.org instead, as it's considered a better-behaved archival crawler that can still archive the Wandering Thoughts blog.\n",
    "chinese_title": "在POSIX中，理论上你可以使用inode零。",
    "chinese_summary": "克里斯·西本曼的博客“漫游思绪”正在阻止使用过时浏览器的用户访问，以此应对大量网络爬虫的涌入。这些爬虫通常伪装成旧版 Chrome 用户代理，似乎是为了 LLM 训练而收集数据，给服务器造成了巨大的负载。\n\n所采取的反爬虫措施旨在通过阻止这些可疑浏览器来减少负载。如果用户在使用最新浏览器时错误地遇到此消息，建议通过大学电子邮件地址联系克里斯·西本曼，并提供有关其浏览器及其 User-Agent 字符串的详细信息。\n\n特别指出了像 archive.today、archive.ph 和 archive.is 这样的存档服务存在的问题。这些服务由于使用旧的 Chrome User-Agent 值、从广泛分布的 IP 地址运行，并且有时使用伪造的反向 DNS 条目，模仿恶意行为者，因此被标记为有问题的爬虫。作者建议改用 archive.org，因为它被认为是一个行为更规范的存档爬虫，仍然可以存档“漫游思绪”博客。"
  },
  {
    "id": "44128751",
    "title": "A new generation of Tailscale access controls",
    "url": "https://tailscale.com/blog/grants-ga",
    "summary": "Tailscale has announced the general availability of \"Grants,\" a new generation of access controls designed to simplify and extend the capabilities of their original ACLs. Grants offer a more readable and writeable syntax while being a superset of existing ACLs, ensuring backward compatibility. You can use both grants and ACLs side-by-side in the same policy.\n\nKey benefits of Grants include:\n\n*   **Simplified Syntax:** Combining ports and protocols into a single `ip` field and removing the redundant `action` field make the policies easier to read and write.\n*   **Application Capability Extensions:** Grants allow you to define application-level permissions that can be passed to applications using Tailscale's `tsnet` library. This centralizes authentication and authorization policies within Tailscale, eliminating the need for separate user databases in each application.\n*   **Routing Awareness with 'via':** The `via` field allows defining specific exit nodes, subnet routers, or app connectors that devices must use to access certain resources, enabling features like location-based routing and high-availability configurations.\n\nThe article highlights examples of how Grants are used for access control in applications like Golink (a shortlink service), TailSQL (a SQL playground), Setec (a secrets management service), and a Kubernetes API server proxy. Existing Tailscale users don't need to immediately migrate their ACLs to Grants; the original ACL syntax will continue to be supported indefinitely. You can rewrite ACL policies incrementally.\n",
    "chinese_title": "新一代 Tailscale 访问控制",
    "chinese_summary": "Tailscale发布“Grants”，新一代访问控制，简化并扩展原有ACL功能。Grants提供更易读写的语法，同时兼容现有ACL，确保向后兼容性。您可以在同一策略中同时使用Grants和ACL。\n\nGrants的主要优势包括：\n\n*   **简化语法：** 将端口和协议合并到单个`ip`字段中，并删除冗余的`action`字段，使策略更易于阅读和编写。\n*   **应用能力扩展：** Grants允许您定义应用程序级别的权限，这些权限可以使用Tailscale的`tsnet`库传递给应用程序。这会将身份验证和授权策略集中在Tailscale中，从而无需在每个应用程序中单独建立用户数据库。\n*   **路由感知与'via'：** `via`字段允许定义设备必须使用的特定出口节点、子网路由器或应用程序连接器才能访问某些资源，从而实现诸如基于位置的路由和高可用性配置等功能。\n\n文章重点介绍了如何在Golink（短链接服务）、TailSQL（SQL游乐场）、Setec（秘密管理服务）和Kubernetes API服务器代理等应用程序中使用Grants进行访问控制的示例。现有的Tailscale用户无需立即将ACL迁移到Grants；原有的ACL语法将无限期地继续支持。您可以逐步重写ACL策略。"
  },
  {
    "id": "44129495",
    "title": "When Fine-Tuning Makes Sense: A Developer's Guide",
    "url": "https://getkiln.ai/blog/why_fine_tune_LLM_models_and_how_to_get_started",
    "summary": "生成摘要时出错",
    "chinese_title": "When Fine-Tuning Makes Sense: A Developer's Guide",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44123987",
    "title": "Nitrogen Triiodide (2016)",
    "url": "https://www.fourmilab.ch/documents/chemistry/NI3/",
    "summary": "生成摘要时出错",
    "chinese_title": "三碘化氮 (2016)",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44155426",
    "title": "Show HN: I built an AI Agent that uses the iPhone",
    "url": "https://github.com/rounak/PhoneAgent",
    "summary": "This \"Show HN\" post introduces PhoneAgent, an AI agent built during an OpenAI hackathon that can control an iPhone using OpenAI models. Similar to a human user, it can perform tasks spanning multiple apps by understanding the accessibility tree of each app and interacting with it using taps, swipes, scrolls, typing, and app opening.\n\nUsers can give commands via text or voice, enabling actions like taking selfies, sending messages, downloading apps, and controlling phone settings like the torch. The app requires an OpenAI API key and runs via Xcode's UI testing harness, eliminating the need for jailbreaking. It communicates with the UI test using a TCP server.\n\nThe agent leverages OpenAI's gpt-4.1 model and offers an \"Always On\" mode for backgrounded prompts using a wake word. It securely stores the OpenAI API key on the device.\n\nLimitations include imperfect keyboard input, potential confusion during animations, and a lack of visual screen understanding (though achievable). The post emphasizes that it is experimental software, a personal project, and suggests running it in a controlled environment due to the app's contents being sent to OpenAI. The creator also acknowledges the potential for the model to make errors.\n",
    "chinese_title": "展示一下：我构建了一个使用iPhone的AI代理",
    "chinese_summary": "此“Show HN”帖子介绍 PhoneAgent，这是一个在 OpenAI 黑客马拉松期间构建的 AI 代理，它可以使用 OpenAI 模型控制 iPhone。它类似于人类用户，可以通过理解每个应用程序的辅助功能树并使用点击、滑动、滚动、打字和打开应用程序等操作与之交互，从而执行跨多个应用程序的任务。\n\n用户可以通过文本或语音给出命令，从而实现拍摄自拍、发送消息、下载应用程序和控制手机设置（如手电筒）等操作。该应用程序需要 OpenAI API 密钥，并通过 Xcode 的 UI 测试工具运行，无需越狱。它使用 TCP 服务器与 UI 测试通信。\n\n该代理利用 OpenAI 的 gpt-4.1 模型，并提供一个“Always On”模式，用于使用唤醒词的后台提示。它安全地将 OpenAI API 密钥存储在设备上。\n\n局限性包括不完善的键盘输入、动画期间可能产生的混淆以及缺乏视觉屏幕理解（尽管可以实现）。该帖子强调这是一款实验性软件，是一个个人项目，并建议在受控环境中运行，因为应用程序的内容将被发送到 OpenAI。创建者还承认该模型可能会出错。"
  },
  {
    "id": "44158658",
    "title": "After 25 Years, Linux Format Magazine Is No More",
    "url": "https://www.omgubuntu.co.uk/2025/05/linux-format-magazine-closes",
    "summary": "Linux Format, a magazine dedicated to Linux and open-source, has ceased publication after 25 years. The publisher, Future, hasn't officially stated the reason, but the article attributes it to the challenging economics of print publishing in the digital age. The author laments the decline of \"dead-tree media\" and suggests that if people valued such publications, they would support them by buying them.\n\nThe author shares a personal anecdote about how a Linux Format cover-mounted DVD introduced them to Ubuntu, which led to the creation of their Ubuntu-focused blog. While the magazine's closure is unfortunate, the author points out that some niche magazines have successfully transitioned to digital formats or adapted their strategies to survive.\n\nThe article mentions that Linux Format's last reported circulation figures from 2014 were around 19,000 copies per month. While the current figure is likely lower, the publisher didn't feel the magazine was worth the effort, even as a digital-only publication. The author also recounts an unsuccessful attempt to collaborate with Future to promote Linux Format on their blog.\n\nDespite the closure, the author notes that other Linux magazines, such as Linux Magazine and the official Raspberry Pi Magazine, are still in print, offering alternatives for readers who prefer the tangible experience of reading a physical magazine.\n",
    "chinese_title": "Linux Format 杂志在 25 年后停刊",
    "chinese_summary": "Linux Format, a magazine dedicated to Linux and open-source, has ceased publication after 25 years. The publisher, Future, hasn't officially stated the reason, but the article attributes it to the challenging economics of print publishing in the digital age. The author laments the decline of \"dead-tree media\" and suggests that if people valued such publications, they would support them by buying them.\n\nThe author shares a personal anecdote about how a Linux Format cover-mounted DVD introduced them to Ubuntu, which led to the creation of their Ubuntu-focused blog. While the magazine's closure is unfortunate, the author points out that some niche magazines have successfully transitioned to digital formats or adapted their strategies to survive.\n\nThe article mentions that Linux Format's last reported circulation figures from 2014 were around 19,000 copies per month. While the current figure is likely lower, the publisher didn't feel the magazine was worth the effort, even as a digital-only publication. The author also recounts an unsuccessful attempt to collaborate with Future to promote Linux Format on their blog.\n\nDespite the closure, the author notes that other Linux magazines, such as Linux Magazine and the official Raspberry Pi Magazine, are still in print, offering alternatives for readers who prefer the tangible experience of reading a physical magazine.\n"
  },
  {
    "id": "44149019",
    "title": "Google AI Edge – On-device cross-platform AI deployment",
    "url": "https://ai.google.dev/edge",
    "summary": "生成摘要时出错",
    "chinese_title": "Google AI Edge – On-device cross-platform AI deployment",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44157378",
    "title": "TradeExpert, a trading framework that employs a mix of experts",
    "url": "https://arxiv.org/abs/2411.00782",
    "summary": "This arXiv article presents TradeExpert, a novel trading framework that leverages a mixture of expert (MoE) Large Language Models (LLMs) to improve quantitative trading. The authors, Qianggang Ding, Haochen Shi, Jiadong Guo, and Bang Liu, address the challenge of effectively integrating diverse financial data sources.\n\nTradeExpert utilizes four specialized LLMs, each acting as an expert in analyzing specific financial data: news articles, market data, alpha factors, and fundamental data. The insights generated by these expert LLMs are then synthesized by a General Expert LLM to produce a final prediction or decision. The framework can operate in either prediction mode or ranking mode, depending on the prompt, making it suitable for both stock movement prediction and quantitative stock trading.\n\nTo evaluate TradeExpert's performance, the authors have also released a large-scale financial dataset, supplementing existing benchmarks. Experimental results demonstrate that TradeExpert outperforms existing methods across various trading scenarios. The paper contributes a valuable approach to AI-driven financial trading by effectively combining the strengths of specialized LLMs within a unifying framework. The paper is accessible through various formats including PDF and HTML, and includes links to code, data, and related papers.\n",
    "chinese_title": "贸易专家，一个采用多种专家混合的交易框架",
    "chinese_summary": "TradeExpert：一种基于混合专家大语言模型的量化交易框架\n\n本文介绍了一种名为TradeExpert的新型交易框架，该框架利用混合专家（MoE）大语言模型（LLM）来改进量化交易。作者丁强刚、史皓琛、郭佳栋和刘邦解决了有效整合各种金融数据来源的挑战。\n\nTradeExpert采用四个专业的大语言模型，每个模型都作为分析特定金融数据的专家：新闻文章、市场数据、alpha因子和基本面数据。这些专家大语言模型生成的见解随后由一个通用专家大语言模型综合，以产生最终的预测或决策。该框架可以根据提示以预测模式或排序模式运行，使其适用于股票走势预测和量化股票交易。\n\n为了评估TradeExpert的性能，作者还发布了一个大规模的金融数据集，补充了现有的基准。实验结果表明，TradeExpert在各种交易场景中都优于现有方法。该论文通过在一个统一的框架内有效地结合专业大语言模型的优势，为人工智能驱动的金融交易贡献了一种有价值的方法。该论文可以通过PDF和HTML等多种格式访问，并包含代码、数据和相关论文的链接。"
  },
  {
    "id": "44142251",
    "title": "Estimating Logarithms",
    "url": "https://obrhubr.org/logarithm-estimation",
    "summary": "Niklas Oberhuber's article explains a method, developed by John Napier, for estimating logarithms base 10 without directly calculating them. The core idea is that the logarithm of a number is approximately equal to the number of its digits minus one.\n\nThe article enhances this basic approximation by leveraging the logarithmic property log(a^b) = b * log(a). By raising a number N to a power (e.g., N^10) and then counting the digits minus one of the result, and dividing by the exponent, a more accurate logarithm estimate can be obtained. Increasing the exponent increases precision.\n\nTo simplify the exponentiation process, the article introduces scientific notation. Breaking down exponentiation into smaller, manageable multiplications using scientific notation allows for iterative calculations. Previous results are used to simplify the following steps.\n\nFinally, the author provides a Python script that automates this logarithm estimation method. The code calculates the mantissa and exponent iteratively to increase precision. The author expresses dissatisfaction with the `decimal` import and suggests potential improvements via string manipulation.\n\nThe article concludes by recommending Charles Petzold's \"The Lost Art of Logarithms,\" where the method is originally discussed.\n",
    "chinese_title": "估算对数",
    "chinese_summary": "尼克拉斯·奥伯胡伯的文章解释了一种由约翰·纳皮尔开发的，无需直接计算即可估算以10为底的对数的方法。其核心思想是，一个数的对数近似等于其位数减一。\n\n该文章通过利用对数性质 log(a^b) = b * log(a) 来增强这种基本近似。将数字 N 提高到某个幂（例如，N^10），然后计算结果的位数减一，并除以指数，即可获得更准确的对数估计值。增加指数可以提高精度。\n\n为了简化求幂过程，文章引入了科学计数法。使用科学计数法将求幂分解为更小、易于管理的乘法运算，从而可以进行迭代计算。之前的计算结果用于简化后续步骤。\n\n最后，作者提供了一个 Python 脚本，用于自动执行此对数估计方法。该代码迭代地计算尾数和指数以提高精度。作者对 `decimal` 导入表示不满，并建议通过字符串操作进行潜在改进。\n\n文章最后推荐了查尔斯·佩措尔德的《对数的失落艺术》，该方法最初在该书中讨论。"
  },
  {
    "id": "44133279",
    "title": "How Generative Engine Optimization (GEO) rewrites the rules of search",
    "url": "https://a16z.com/geo-over-seo/",
    "summary": "This Andreessen Horowitz article, \"How Generative Engine Optimization (GEO) Rewrites the Rules of Search,\" argues that traditional SEO is becoming obsolete as AI-native search powered by Large Language Models (LLMs) gains traction. The new paradigm, GEO, focuses on optimizing content for LLM reference rather than traditional page ranking.\n\nGEO prioritizes well-organized, meaning-dense content that LLMs can easily extract and reproduce. Instead of click-through rates, the focus shifts to \"reference rates\" – how often a brand is cited in model-generated answers. New platforms are emerging to analyze brand mentions in AI responses, track sentiment, and understand how publishers influence model behavior.\n\nThe article highlights the potential for GEO tools to evolve beyond simple measurement and become platforms that fine-tune models, capture clickstream data, and provide real-time campaign generation and optimization. This creates an opportunity to own the relationship with the AI layer, becoming the system of record for interacting with LLMs and capturing the associated marketing budget.  Ultimately, GEO represents a wedge into performance marketing, enabling autonomous marketing powered by AI. In a world where AI is the gateway to discovery and commerce, the key question for marketers is whether the model will remember their brand.\n",
    "chinese_title": "生成引擎优化 (GEO) 如何改写搜索规则",
    "chinese_summary": "Andreessen Horowitz文章《生成引擎优化 (GEO) 如何改写搜索规则》认为，随着由大型语言模型 (LLM) 驱动的 AI 原生搜索获得关注，传统 SEO 正在过时。新的范式 GEO 专注于为 LLM 引用优化内容，而不是传统的页面排名。\n\nGEO 优先考虑组织良好、含义密集的内容，以便 LLM 可以轻松提取和重现。重点从点击率转向“引用率”——品牌在模型生成的答案中被引用的频率。新的平台正在涌现，以分析 AI 响应中的品牌提及、跟踪情绪并了解发布商如何影响模型行为。\n\n文章强调了 GEO 工具的潜力，它们可以超越简单的衡量，发展成为微调模型、捕获点击流数据以及提供实时广告系列生成和优化的平台。这创造了拥有与 AI 层关系的机遇，成为与 LLM 交互并捕获相关营销预算的记录系统。最终，GEO 代表了进入效果营销的楔子，实现了由 AI 驱动的自主营销。在一个 AI 成为发现和商业门户的世界里，营销人员的关键问题是模型是否会记住他们的品牌。"
  },
  {
    "id": "44157131",
    "title": "\"I vibe coded and shipped an app in three days. It got hacked. Twice.\"",
    "url": "https://threadreaderapp.com/thread/1929017755136561402.html",
    "summary": "This article likely recounts a story about a developer or small team who rushed the development and launch of an application (an \"app\") within a remarkably short timeframe of three days. The phrase \"vibe coded\" suggests a haphazard, intuitive, and likely poorly planned approach to development, potentially prioritizing speed over security best practices.\n\nThe core problem revealed in the title is the consequence of this rushed process: the app suffered multiple security breaches (\"got hacked. Twice.\"). This underscores the significant risks associated with sacrificing security considerations for rapid deployment, especially when dealing with user data or sensitive functionalities.\n\nThe article likely delves into the specifics of the vulnerabilities that were exploited, the damage caused by the hacks, and the lessons learned from the experience. It probably highlights the importance of prioritizing security throughout the development lifecycle, including proper planning, testing, and code reviews, even when facing tight deadlines. The author may also reflect on the trade-offs between speed and security and the potentially devastating consequences of neglecting the latter. Ultimately, it serves as a cautionary tale against shortcuts and emphasizing the need for a more structured and secure development process.\n",
    "chinese_title": "三天内我凭感觉速成了个应用并发布了，然后被黑了。两次。",
    "chinese_summary": "这篇文章可能讲述了一个关于开发者或小型团队在极短时间内（三天）匆忙开发和发布应用程序（“app”）的故事。“凭感觉编码”一词暗示了一种随意、凭直觉且可能计划不周的开发方法，可能优先考虑速度而非安全最佳实践。\n\n标题揭示的核心问题是这种匆忙过程的后果：该应用程序遭受了多次安全漏洞（“被黑了两次”）。这突显了为快速部署而牺牲安全考虑所带来的重大风险，尤其是在处理用户数据或敏感功能时。\n\n这篇文章可能深入探讨了被利用的漏洞的具体细节、黑客造成的损害以及从经验中吸取的教训。它可能强调了在整个开发生命周期中优先考虑安全的重要性，包括适当的规划、测试和代码审查，即使在面临紧张的截止日期时也是如此。作者可能还会反思速度和安全之间的权衡，以及忽视后者可能造成的毁灭性后果。最终，它起到了一个警示作用，告诫人们不要走捷径，并强调需要一个更结构化和安全的开发过程。"
  },
  {
    "id": "44131194",
    "title": "The Zach Attack Scratch 'N Solve Puzzle Pack",
    "url": "https://coincidence.games/zach-attack/",
    "summary": "The \"Zach Attack! Scratch 'N Solve Puzzle Pack\" is a Kickstarter project offering a collection of six scratch-off games. These games blend logic puzzles with push-your-luck mechanics, encouraging deductive thinking and risk management.\n\nThe project is inspired by \"Scratchees,\" a similar product from the 1990s by Decipher, a company known for their Star Wars and Star Trek collectible card games (CCGs). The creator previously interviewed a designer from Decipher on their podcast.\n\nKey people involved in the project include Zach Barth and Jared Levine for Game Design, Steffani Lawhead for Art and Layout, and Drew Messinger-Michaels for Writing.\n",
    "chinese_title": "扎克袭击刮刮解谜包",
    "chinese_summary": "“扎克来袭！刮刮解谜包”是一个Kickstarter项目，提供一套六款刮刮乐游戏。这些游戏融合了逻辑谜题和孤注一掷的机制，鼓励演绎推理和风险管理。\n\n该项目灵感来源于上世纪90年代Decipher公司推出的类似产品“Scratchees”。Decipher公司以其星球大战和星际迷航集换式卡牌游戏（CCGs）而闻名。该项目的创建者之前曾在他们的播客中采访过Decipher公司的一位设计师。\n\n参与该项目的关键人物包括：Zach Barth和Jared Levine负责游戏设计，Steffani Lawhead负责美术和布局，Drew Messinger-Michaels负责写作。"
  },
  {
    "id": "44155074",
    "title": "Show HN: Agno – A full-stack framework for building Multi-Agent Systems",
    "url": "https://github.com/agno-agi/agno",
    "summary": "Agno is presented as a full-stack framework for building sophisticated Multi-Agent Systems (MAS) capable of memory, knowledge, and reasoning. It supports five levels of agent complexity, from simple tool-using agents to collaborative agent teams and deterministic agentic workflows. Key features include model agnosticism (supporting 23+ providers), high performance (fast instantiation and low memory footprint), first-class reasoning capabilities, native multi-modality, advanced multi-agent architecture, built-in agentic search with RAG, memory and session storage, structured outputs, pre-built FastAPI routes, and monitoring.\n\nThe article highlights Agno's performance advantages, claiming significantly faster agent instantiation and lower memory usage compared to other frameworks like LangGraph. It emphasizes that while speed is important, accuracy and reliability are paramount.\n\nThe document provides code examples demonstrating how to create a reasoning agent using YFinance API and a multi-agent team for financial analysis, showcasing the framework's capabilities.  It also offers instructions for installation (pip install), setting up API keys, and integrating Agno documentation with the Cursor IDE for faster development.  Links to documentation, a cookbook, a community forum, and a Discord server are provided. Finally, it mentions the option to disable telemetry by setting an environment variable.\n",
    "chinese_title": "Show HN: Agno – 用于构建多智能体系统的全栈框架",
    "chinese_summary": "Agno：构建复杂多智能体系统(MAS)的全栈框架，具备记忆、知识和推理能力。支持五种智能体复杂程度，从简单工具型智能体到协作智能体团队和确定性智能体工作流。主要特性包括模型无关性（支持23+供应商）、高性能（快速实例化和低内存占用）、一流的推理能力、原生多模态、高级多智能体架构、内置RAG智能体搜索、记忆和会话存储、结构化输出、预构建FastAPI路由和监控。\n\n文章强调了Agno的性能优势，声称相比LangGraph等其他框架，其智能体实例化速度明显更快，内存占用更低。它强调速度固然重要，但准确性和可靠性才是最重要的。\n\n文档提供了代码示例，展示了如何使用YFinance API创建推理智能体，以及如何创建用于金融分析的多智能体团队，从而展示了该框架的功能。它还提供了安装说明（pip install），设置API密钥，以及将Agno文档与Cursor IDE集成以加快开发速度的说明。提供了指向文档、菜谱、社区论坛和Discord服务器的链接。最后，它提到了通过设置环境变量来禁用遥测的选项。"
  },
  {
    "id": "44150093",
    "title": "Codex CLI is going native",
    "url": "https://github.com/openai/codex/discussions/1174",
    "summary": "In an announcement on May 30, 2025, OpenAI's fouad-openai shared that the Codex CLI is being rewritten in Rust to improve cross-platform stability, security, performance, and extensibility. The announcement expresses gratitude to the community for their contributions. The new version, `@openai/codex@native`, can be installed via npm.\n\nThe move to Rust aims to provide a zero-dependency install (eliminating the Node v22+ requirement), native security bindings (leveraging existing Rust-based Linux sandboxing), optimized performance (avoiding runtime garbage collection), and an extensible protocol to allow developers to extend the agent in various languages.\n\nThe post details current sandboxing mechanisms in place for macOS and Linux and provides links to code implementations of this, including a custom CLI built for Linux utilizing Landlock/seccomp. The wire protocol (defined in `codex-rs/core/src/protocol.rs`) facilitates communication.\n\nWhile the Rust implementation reaches feature parity, bug fixes will continue in the TypeScript version. OpenAI is exploring how TypeScript and other languages like Python will integrate into the project long-term. They are also hiring Rust developers to contribute to Codex CLI and agentic coding.\n\nSeveral users reported issues with organization verification and errors related to tool naming length in MCP server configurations. One user requested expanding on sandboxing, which was addressed in detail by bolinfest. Another user suggested brew/apt package support.\n",
    "chinese_title": "Codex CLI 正在原生化",
    "chinese_summary": "2025年5月30日的公告中，OpenAI的fouad-openai分享道，Codex CLI正在用Rust重写，以提高跨平台稳定性、安全性、性能和可扩展性。该公告感谢社区的贡献。新版本`@openai/codex@native`可以通过npm安装。\n\n迁移到Rust旨在提供零依赖安装（消除Node v22+的要求）、原生安全绑定（利用现有的基于Rust的Linux沙箱）、优化性能（避免运行时垃圾回收）以及可扩展的协议，允许开发者以各种语言扩展代理。\n\n该帖子详细介绍了macOS和Linux上现有的沙箱机制，并提供了此机制的代码实现链接，包括一个利用Landlock/seccomp为Linux构建的自定义CLI。线协议（在`codex-rs/core/src/protocol.rs`中定义）促进了通信。\n\n在Rust实现达到功能对等的同时，TypeScript版本将继续进行错误修复。OpenAI正在探索TypeScript和Python等其他语言将如何长期集成到项目中。他们还在招聘Rust开发者，以贡献于Codex CLI和智能体编码。\n\n一些用户报告了组织验证问题以及与MCP服务器配置中工具命名长度相关的错误。一位用户要求扩展沙箱功能，bolinfest对此进行了详细阐述。另一位用户建议支持brew/apt软件包。"
  },
  {
    "id": "44158444",
    "title": "Tabletop particle blaster: Tiny nozzles, lasers could replace giant accelerators",
    "url": "https://phys.org/news/2025-06-tabletop-particle-blaster-tiny-nozzles.html",
    "summary": "Researchers at the University of Osaka have developed a novel method called micronozzle acceleration (MNA) to generate high-energy proton beams using compact setups. MNA utilizes microtargets with tiny nozzle-like features irradiated by ultraintense, ultrashort laser pulses. Through advanced numerical simulations, the team demonstrated the generation of giga-electron-volt (GeV) proton beams, surpassing the energy limits of traditional laser-based acceleration methods.\n\nThe micronozzle structure enables a sustained, stepwise acceleration of protons within a strong electric field created inside the target. This allows proton energies to exceed 1 GeV with excellent beam quality and stability.\n\nThis breakthrough has significant implications for various fields, including: energy, with potential to support fast ignition schemes in laser-driven nuclear fusion; medicine, enabling more compact and precise proton cancer therapy systems; and fundamental science, allowing the simulation of extreme astrophysical environments and probing matter under ultra-strong magnetic fields.\n\nThe study, based on simulations performed on the SQUID supercomputer at The University of Osaka, represents the first theoretical demonstration of compact GeV proton acceleration using microstructured targets. The research offers a potential alternative to massive particle accelerators for achieving high-energy proton beams.\n",
    "chinese_title": "桌面粒子加速器：微型喷嘴、激光有望取代巨型加速器",
    "chinese_summary": "大阪大学的研究人员开发了一种名为微喷嘴加速 (MNA) 的新型方法，利用紧凑型装置产生高能质子束。MNA 使用带有微小喷嘴状结构的微靶，并用超强、超短激光脉冲照射。通过先进的数值模拟，该团队展示了产生千兆电子伏 (GeV) 质子束，超越了传统激光加速方法的能量限制。\n\n微喷嘴结构使得质子在靶内产生的强电场中能够持续、逐步地加速。这使得质子能量能够超过1 GeV，并具有出色的光束质量和稳定性。\n\n这一突破对多个领域具有重要意义，包括：能源领域，有潜力支持激光驱动核聚变中的快点火方案；医学领域，能够实现更紧凑和精确的质子癌症治疗系统；以及基础科学领域，可以模拟极端天体物理环境并探测超强磁场下的物质。\n\n这项研究基于大阪大学 SQUID 超级计算机上的模拟，代表了使用微结构靶实现紧凑型 GeV 质子加速的首个理论演示。该研究为实现高能质子束提供了一种替代大型粒子加速器的潜在方案。"
  },
  {
    "id": "44122864",
    "title": "Making maps with noise functions (2022)",
    "url": "https://www.redblobgames.com/maps/terrain-from-noise/",
    "summary": "生成摘要时出错",
    "chinese_title": "使用噪声函数制作地图 (2022)",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44149718",
    "title": "Cinematography of “Andor”",
    "url": "https://www.pushing-pixels.org/2025/05/20/cinematography-of-andor-interview-with-christophe-nuyens.html",
    "summary": "This interview with Christophe Nuyens, the cinematographer for the second season of \"Andor,\" delves into his career, the evolution of filmmaking technology, and his approach to the show's visuals. Nuyens discusses his path from electrical trade school to film school, emphasizing the importance of cultivating both technical and artistic skills. He highlights the significant shift from film to digital, praising the creative freedom and efficiency digital technology offers, particularly for night scenes. He also touches upon the ongoing wireless technology advancements and their potential congestion issues on set.\n\nNuyens notes the increasing audience expectations for episodic productions, blurring the lines between TV and film quality. Regarding \"Andor,\" he mentions being drawn to the project due to his admiration for \"Rogue One\" and sought to elevate the show's visual aesthetic. He used full-frame anamorphic lenses for a cinematic feel.\n\nThe pre-production involved extensive collaboration with director Ariel Kleiman, ILM (pre-viz), and the art department, developing moodboards and refining shots. Nuyens describes the challenges and benefits of working with both green screens, LED walls, and painted backdrops, detailing the use of practical sets in locations like Barcelona and London, combined with digital extensions. He emphasizes the collaborative environment with VFX supervisor Mohen Leo and production designer Luke Hull to achieve grounded and realistic visuals.\n\nFinally, Nuyens discusses the color palettes and lighting choices for different locations. For instance, the Turin, Italy inspired cold atmosphere for episodes 4-6 and the sun-drenched look of Dedra’s apartment and other scenes in the initial block of episodes. He aimed for each arc of three episodes to feel like its own distinct movie.\n",
    "chinese_title": "《安多》的摄影",
    "chinese_summary": "克里斯托弗·尼恩斯访谈：安多第二季摄影师谈职业生涯、电影技术发展及视觉手法"
  },
  {
    "id": "44142359",
    "title": "Writing your own C++ standard library part 2",
    "url": "https://nibblestew.blogspot.com/2025/05/writing-your-own-c-standard-library.html",
    "summary": "Jussi's blog post, \"Writing your own C++ standard library part 2,\" elaborates on his previous \"self-written C++ standard library\" project, responding to criticisms and outlining key design choices.\n\nAddressing criticism, he clarifies that the project isn't intended as a full ISO standard library implementation. He emphasizes its purpose as a collection of essential low-level functions and types. He also responds to the debate around using the term \"STL,\" noting its common usage despite technical inaccuracies.\n\nThe core of the post discusses how to simplify container implementations. Instead of handling all possible types, Jussi enforces a \"WellBehaved\" concept, requiring types to be noexcept-movable. This drastically reduces complexity by preventing the library from needing to account for types behaving badly. He suggests `unique_ptr` as a solution for types that are not \"WellBehaved\", advocating custom solutions for specific performance-critical scenarios.\n\nHe also explores string splitting, presenting two approaches. One returns a `vector<string>` like in Python. The other uses a generic, lazy, and allocation-free method leveraging void pointers and callbacks. This offers maximum flexibility at the cost of requiring a small adapter lambda from the user.\n\nFinally, Jussi details his implementation of the Python iteration protocol, using `optional<T>` to mimic the `StopIteration` exception. He acknowledges the difficulty of seamlessly integrating this into native C++ loops. He concludes with the current status of the repository, featuring strings, regexes (using precompiled `ctre`), and basic containers. The build process is quick, indicating efficient compilation times.\n",
    "chinese_title": "编写你自己的 C++ 标准库，第二部分",
    "chinese_summary": "Jussi的博文《编写你自己的C++标准库，第二部分》详细阐述了他之前的“自制C++标准库”项目，回应了批评并概述了关键设计选择。\n\n在回应批评时，他澄清该项目并非旨在作为完整的ISO标准库实现。他强调其目的是作为基本底层函数和类型的集合。他还回应了围绕使用“STL”一词的争论，指出尽管存在技术上的不准确，但该词已被广泛使用。\n\n文章的核心讨论了如何简化容器的实现。Jussi没有处理所有可能的类型，而是强制执行一个“WellBehaved”概念，要求类型是noexcept-movable的。这通过防止库需要考虑行为不良的类型，大大降低了复杂性。他建议使用`unique_ptr`来处理非“WellBehaved”的类型，并提倡针对特定性能关键场景的自定义解决方案。\n\n他还探讨了字符串分割，提出了两种方法。一种像Python一样返回`vector<string>`。另一种使用通用的、惰性的、无分配的方法，利用void指针和回调。这提供了最大的灵活性，但代价是需要用户提供一个小型的适配器lambda。\n\n最后，Jussi详细介绍了Python迭代协议的实现，使用`optional<T>`来模拟`StopIteration`异常。他承认将此无缝集成到原生C++循环中存在困难。他以仓库的当前状态作为结尾，其中包括字符串、正则表达式（使用预编译的`ctre`）和基本容器。构建过程很快，表明编译时间效率很高。"
  },
  {
    "id": "44156625",
    "title": "Hypervisors for Memory Introspection and Reverse Engineering",
    "url": "https://secret.club/2025/06/02/hypervisors-for-memory-introspection-and-reverse-engineering.html",
    "summary": "生成摘要时出错",
    "chinese_title": "Hypervisors for Memory Introspection and Reverse Engineering",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44147573",
    "title": "New adaptive optics shows details of our star's atmosphere",
    "url": "https://nso.edu/press-release/new-adaptive-optics-shows-stunning-details-of-our-stars-atmosphere/",
    "summary": "In May 2025, scientists from the National Science Foundation National Solar Observatory and the New Jersey Institute of Technology unveiled groundbreaking high-resolution images and movies of the Sun's corona, achieved through a new \"coronal adaptive optics\" system called Cona. This technology, installed at the 1.6-meter Goode Solar Telescope (GST) at Big Bear Solar Observatory (BBSO) in California, compensates for atmospheric blur, revealing unprecedented details of the corona's fine structures.\n\nThe adaptive optics system uses a mirror that reshapes itself 2,200 times per second to counteract air turbulence, achieving a resolution of 63 kilometers, the theoretical limit of the GST. This marks a significant leap from the previous 1,000-kilometer resolution.\n\nThe team's observations include movies showcasing the rapid restructuring of solar prominences, the formation and collapse of plasma streams (possibly a new phenomenon termed \"plasmoid\"), and the dynamics of coronal rain with strands narrower than 20 kilometers. These detailed observations provide invaluable insight into coronal processes and will help validate computer models.\n\nScientists believe these advancements will help resolve the mystery of coronal heating, understand the processes driving space weather, and provide a crucial step in improving our understanding of eruptions that eject plasma into space. The technology is now available at the GST and is being considered for implementation at the 4-meter Daniel K. Inouye Solar Telescope in Hawai'i, promising further advancements in ground-based solar astronomy.\n",
    "chinese_title": "新型自适应光学技术揭示恒星大气层细节",
    "chinese_summary": "2025年5月，美国国家科学基金会国家太阳天文台和新泽西理工学院的科学家公布了太阳日冕前所未有的高分辨率图像和视频，这得益于一种名为Cona的新型“日冕自适应光学”系统。该技术安装在加利福尼亚州大熊湖太阳天文台（BBSO）的1.6米古德太阳望远镜（GST）上，能够补偿大气模糊，从而以前所未有的细节展现日冕的精细结构。\n\n该自适应光学系统使用一面每秒重塑自身2200次的反射镜来抵消空气湍流，实现了63公里的分辨率，达到了GST的理论极限。这标志着与之前的1000公里分辨率相比，是一个重大飞跃。\n\n该团队的观测包括展示太阳耀斑快速重组、等离子体流的形成和崩塌（可能是一种名为“等离子体团”的新现象）以及宽度小于20公里的日冕雨动态的视频。这些详细的观测为日冕过程提供了宝贵的见解，并将有助于验证计算机模型。\n\n科学家们认为，这些进步将有助于解开日冕加热之谜，了解驱动空间天气的过程，并为增进我们对将等离子体喷射到太空的爆发的理解提供关键的一步。这项技术现已在GST上投入使用，并正在考虑在夏威夷的4米丹尼尔·K·井上太阳望远镜上实施，这预示着地面太阳天文学的进一步发展。"
  },
  {
    "id": "44154962",
    "title": "Lessons From Cursor's System Prompt",
    "url": "https://byteatatime.dev/posts/cursor-prompt-analysis/",
    "summary": "This article analyzes the system prompt used by Cursor's AI coding assistant, revealing insights into its effectiveness. The author intercepted Cursor's API calls to examine the prompt's structure and key components.\n\nThe system prompt establishes the AI's personality as a coding assistant within the Cursor IDE, working as an autonomous agent in a pair programming setting. It leverages XML-like tags to organize instructions into digestible sections, improving the AI's ability to process and adhere to them. Autonomy is emphasized, instructing the AI to proactively seek information, make decisions, and execute plans without constant user input. The prompt also guides the AI on meta-communication, encouraging natural language descriptions of actions instead of technical jargon. Practical constraints are included to manage resource usage and prevent repetitive error correction loops.\n\nCursor also employs two separate user prompts. The first injects custom rules and project context, ensuring adherence to specific coding standards without risk of prompt injection. The second contains the user's actual query, along with dynamically retrieved context based on the user's input and current state within the IDE, such as open files and edit history. This rich context allows the AI to provide more accurate and relevant assistance. By analyzing these elements, the article provides valuable lessons for crafting effective system prompts for AI coding assistants.\n",
    "chinese_title": "从 Cursor 的系统提示中学到的经验",
    "chinese_summary": "This article analyzes the system prompt used by Cursor's AI coding assistant, revealing insights into its effectiveness. The author intercepted Cursor's API calls to examine the prompt's structure and key components.\n\nThe system prompt establishes the AI's personality as a coding assistant within the Cursor IDE, working as an autonomous agent in a pair programming setting. It leverages XML-like tags to organize instructions into digestible sections, improving the AI's ability to process and adhere to them. Autonomy is emphasized, instructing the AI to proactively seek information, make decisions, and execute plans without constant user input. The prompt also guides the AI on meta-communication, encouraging natural language descriptions of actions instead of technical jargon. Practical constraints are included to manage resource usage and prevent repetitive error correction loops.\n\nCursor also employs two separate user prompts. The first injects custom rules and project context, ensuring adherence to specific coding standards without risk of prompt injection. The second contains the user's actual query, along with dynamically retrieved context based on the user's input and current state within the IDE, such as open files and edit history. This rich context allows the AI to provide more accurate and relevant assistance. By analyzing these elements, the article provides valuable lessons for crafting effective system prompts for AI coding assistants.\n"
  },
  {
    "id": "44147803",
    "title": "Show HN: Patio – Rent tools, learn DIY, reduce waste",
    "url": "https://patio.so",
    "summary": "生成摘要时出错",
    "chinese_title": "Show HN: Patio – Rent tools, learn DIY, reduce waste",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44148734",
    "title": "Structured Errors in Go (2022)",
    "url": "https://southcla.ws/structured-errors-in-go",
    "summary": "生成摘要时出错",
    "chinese_title": "Go 中的结构化错误 (2022)",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44147966",
    "title": "Stepping Back",
    "url": "https://rjp.io/blog/2025-05-31-stepping-back",
    "summary": "This article explores the importance of \"stepping back\" from tasks and problems to gain perspective and avoid unproductive fixation. The author recounts an experience of becoming overly engrossed in porting C code to Rust with an LLM, losing sight of the original goal of evaluating the LLM's capabilities. This highlights the tendency to become deeply invested in tasks, hindering the ability to assess their overall value or explore alternative approaches.\n\nThe author acknowledges the inherent tension between focused problem-solving and strategic reflection. While tenacity is crucial for engineering, it can also lead to unproductive \"monomaniacal obsession.\" The article draws a parallel to the Exploration/Exploitation dilemma in reinforcement learning, questioning when to persist with a current approach versus re-evaluating the direction entirely.\n\nThe key takeaway is the value of periodic reflection, aligning it with natural time boundaries (hours, days, weeks, months, years) to establish a mental schedule. This allows for regular assessment of goals, progress, and potential alternative paths. Questions like \"what am I doing?\", \"why am I doing it?\", and \"what could I be doing instead?\" become integral to this process. The author suggests varying the depth and scope of these questions based on the time frame. For instance, a quick hourly review focuses on task scope, while an annual reflection could involve career or life direction. Ultimately, the author proposes that dedicating a small percentage of time to reflection acts as \"insurance\" against drifting too far down unproductive paths.\n",
    "chinese_title": "后退一步",
    "chinese_summary": "本文探讨了从任务和问题中“抽身而出”以获得全局视角并避免无效固执的重要性。作者回忆了一次过度沉迷于使用LLM将C代码移植到Rust的经历，从而忽略了评估LLM能力的最初目标。这突显了人们容易过度投入任务，从而妨碍了评估其整体价值或探索替代方法的能力。\n\n作者承认了专注的问题解决和战略反思之间固有的张力。虽然坚持不懈对于工程至关重要，但也可能导致无益的“单向痴迷”。本文将此与强化学习中的探索/利用困境进行了类比，质疑何时应该坚持当前的方法，何时应该彻底重新评估方向。\n\n关键的结论是定期反思的价值，将其与自然的时间界限（小时、天、周、月、年）对齐，以建立心理时间表。 这允许定期评估目标、进度和潜在的替代路径。 “我在做什么？”，“我为什么要这样做？”和“我还能做什么？”之类的问题成为了这一过程中不可或缺的一部分。 作者建议根据时间范围调整这些问题的深度和范围。 例如，快速的每小时审查侧重于任务范围，而年度反思可能涉及职业或生活方向。 最终，作者提出，将一小部分时间用于反思可以充当“保险”，防止偏离无效的道路太远。"
  },
  {
    "id": "44148853",
    "title": "Father Ted Kilnettle Shrine Tape Dispenser",
    "url": "https://stephencoyle.net/kilnettle",
    "summary": "生成摘要时出错",
    "chinese_title": "Father Ted Kilnettle Shrine Tape Dispenser",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44147945",
    "title": "Progressive JSON",
    "url": "https://overreacted.io/progressive-json/",
    "summary": "生成摘要时出错",
    "chinese_title": "Progressive JSON",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44158750",
    "title": "OpenAI featured chatbot is pushing extreme surgeries to \"subhuman\" men",
    "url": "https://www.citationneeded.news/openai-incel-chatbot-subhuman-men/",
    "summary": "The article reports that an OpenAI-featured chatbot, \"Looksmaxxing GPT,\" is promoting extreme and potentially dangerous surgeries to men, particularly those it deems \"subhuman\" based on a quasi-scientific \"PSL rating\" scale derived from incel forums. The bot uses jargon from the incel and manosphere communities, like \"mogging,\" \"hardmaxxing,\" and \"SMV,\" to advise men on how to improve their attractiveness.\n\nThe bot analyzes users' photos and recommends costly and invasive procedures, sometimes totaling $50,000-$200,000, including dental reconstruction, jaw implants, rhinoplasty, and limb-lengthening surgeries. It even suggests specific surgeons known within incel circles. The chatbot reinforces the belief that surgery is necessary for men to succeed romantically.\n\nBeyond promoting physical alterations, the bot echoes misogynistic views common in incel forums, claiming that \"women filter by looks first\" and that \"modern dating is a rigged game\" that favors women and \"top 10% men.\" It uses terms like \"Beckies\" and promotes the concept of female \"hypergamy,\" suggesting that women only seek high-status men and settle for others later.\n\nThe article raises concerns about OpenAI prominently featuring a chatbot that promotes dangerous medical interventions, parrots extreme ideology, and potentially pushes vulnerable users towards extremist communities and harmful beliefs like toxic masculinity and body dysmorphia. The author notes that OpenAI's review processes for GPTs are seemingly insufficient to prevent the spread of harmful content. The article highlights the connection between the language and ideas used by the bot and the dangerous rhetoric of violence against women and suicide present in incel forums.\n",
    "chinese_title": "OpenAI聊天机器人被指怂恿男性进行极端手术，以变得“非人”",
    "chinese_summary": "文章报道称，一款由OpenAI推荐的聊天机器人“Looksmaxxing GPT”正在向男性，特别是那些基于从incel论坛衍生出的准科学“PSL评分”而被它认为“非人类”的男性，推销极端且可能具有危险性的手术。该机器人使用来自incel和男性至上主义社群的术语，如“mogging”、“hardmaxxing”和“SMV”，来建议男性如何提高他们的吸引力。\n\n该机器人分析用户的照片，并推荐昂贵且具有侵入性的手术，有时总额高达5万至20万美元，包括牙齿重建、下颌植入、隆鼻和肢体延长手术。它甚至会推荐在incel圈子里有名的特定外科医生。该聊天机器人强化了一种信念，即男性必须通过手术才能在恋爱中获得成功。\n\n除了宣传身体改造外，该机器人还呼应了incel论坛中常见的厌女观点，声称“女性首先通过外貌进行筛选”，并且“现代约会是一场被操纵的游戏”，这场游戏偏袒女性和“前10%的男性”。它使用诸如“Beckies”之类的术语，并宣传女性“高嫁”的概念，暗示女性只寻求高地位的男性，并在之后才会选择其他人。\n\n这篇文章提出了对OpenAI突出展示一款宣扬危险医疗干预、复述极端意识形态，并可能将脆弱的用户推向极端主义社群和有害信念（如有毒的男子气概和躯体变形障碍）的聊天机器人的担忧。作者指出，OpenAI对GPT的审核流程似乎不足以阻止有害内容的传播。这篇文章强调了该机器人使用的语言和思想与incel论坛中存在的针对女性的暴力和自杀等危险言论之间的联系。"
  },
  {
    "id": "44149177",
    "title": "Browser extension (Firefox, Chrome, Opera, Edge) to redirect URLs based on regex",
    "url": "https://github.com/einaregilsson/Redirector",
    "summary": "This article describes a browser extension called Redirector, available for Firefox, Chrome, Opera, and Edge, that allows users to redirect URLs based on regular expressions or wildcard patterns. The extension is dedicated to the memory of its creator, Einar Egilsson.\n\nThe article provides several practical examples of how Redirector can be used, including:\n\n*   **De-mobilizer:** Redirecting mobile website versions to desktop versions.\n*   **AMP Redirect:** Bypassing Google AMP pages to directly access the original content.\n*   **Doubleclick Escaper:** Removing doubleclick link tracking.\n*   **YouTube Shorts to YouTube:** Redirecting YouTube Shorts videos to the standard YouTube watch page.\n*   **Fun with !bangs:** Integrating DuckDuckGo !bangs into Google searches and creating custom !bangs. It shows examples of redirecting DuckDuckGo searches with specific !bangs to other websites, such as a site search on a specific domain or githistory.xyz.\n*   **Fast DuckDuckGo.com !bangs:** Bypassing DDG server for frequently used !bangs.\n\nThe examples include the necessary regular expressions, redirect targets, and explanations for each use case. The article concludes with instructions for Firefox users to improve the visibility of the Redirector extension button in dark themes by modifying the userChrome.css file.\n",
    "chinese_title": "基于正则表达式的URL重定向浏览器扩展（Firefox、Chrome、Opera、Edge）",
    "chinese_summary": "本文介绍了一款名为Redirector的浏览器扩展程序，它适用于Firefox、Chrome、Opera和Edge，允许用户基于正则表达式或通配符模式重定向URL。该扩展程序是为了纪念其创建者Einar Egilsson而制作的。\n\n本文提供了几个Redirector实用示例，包括：\n\n*   **反移动化:** 将移动网站版本重定向到桌面版本。\n*   **AMP重定向:** 绕过Google AMP页面，直接访问原始内容。\n*   **DoubleClick逃脱:** 移除DoubleClick链接追踪。\n*   **YouTube Shorts到YouTube:** 将YouTube Shorts视频重定向到标准的YouTube观看页面。\n*   **!bangs的乐趣:** 将DuckDuckGo !bangs集成到Google搜索中并创建自定义的!bangs。它展示了如何将带有特定!bangs的DuckDuckGo搜索重定向到其他网站，例如特定域上的站点搜索或githistory.xyz。\n*   **快速DuckDuckGo.com !bangs:** 绕过DDG服务器以用于常用!bangs。\n\n这些示例包括每个用例所需的正则表达式、重定向目标和说明。文章最后提供了针对Firefox用户的说明，以通过修改userChrome.css文件来提高深色主题中Redirector扩展程序按钮的可见性。"
  },
  {
    "id": "44131307",
    "title": "Revisiting Loop Recognition in C++ in Rust",
    "url": "https://blomqu.ist/posts/2025/loop-recognition/",
    "summary": "This article revisits a 2011 Google benchmark comparing language implementations of a loop recognition algorithm, now focusing on Rust. It contrasts the language landscape between 2011 and 2024, highlighting Rust's emergence as a contender with its emphasis on performance, type safety, and concurrency through its \"borrow checker.\"\n\nThe article outlines Rust's core properties, such as static compilation and compile-time memory lifetime verification, and then delves into the algorithm itself, which identifies and classifies loops (reducible or irreducible) within a Control-Flow Graph.\n\nA key discussion point is the concept of \"Idiomatic Rust,\" contrasting Safe Rust (enforcing strict compiler rules) with Unsafe Rust (allowing more direct control with the caveat of manual safety guarantees). The author explores implementations in both Safe and Unsafe Rust, detailing how the need to avoid unsafe pointer dereferencing in Safe Rust necessitates structural and implementation changes compared to the original C++ approach.\n\nThe article covers data structure implementation in both Safe and Unsafe Rust and also discusses Rust's enumeration, iteration, type inference, symbol binding, and member function capabilities. The author details how the Safe Rust implementation requires the use of references with explicit lifetimes due to Rust's memory safety features.\n",
    "chinese_title": "在 Rust 中重温 C++ 中的循环识别",
    "chinese_summary": "本文重新审视了2011年谷歌的一项基准测试，该测试比较了循环识别算法的多种语言实现，现在聚焦于Rust。文章对比了2011年至2024年间的语言格局，突出了Rust凭借其对性能、类型安全以及通过“借用检查器”实现的并发性的重视而成为竞争者。\n\n文章概述了Rust的核心特性，例如静态编译和编译时内存生命周期验证，然后深入探讨了算法本身，该算法识别并分类控制流图中的循环（可归约或不可归约）。\n\n一个关键的讨论点是“惯用 Rust”的概念，它对比了Safe Rust（强制执行严格的编译器规则）和Unsafe Rust（允许更直接的控制，但需要手动安全保证）。作者探讨了Safe和Unsafe Rust的实现，详细说明了由于需要在Safe Rust中避免不安全指针解引用，因此与原始C++方法相比，Safe Rust需要进行结构和实现上的更改。\n\n文章涵盖了Safe和Unsafe Rust中的数据结构实现，并讨论了Rust的枚举、迭代、类型推断、符号绑定和成员函数功能。作者详细说明了由于Rust的内存安全特性，Safe Rust实现需要使用具有显式生命周期的引用。"
  },
  {
    "id": "44156843",
    "title": "Designing Error Types in Rust Libraries",
    "url": "https://d34dl0ck.me/rust-bites-designing-error-types-in-rust-libraries/index.html",
    "summary": "This article discusses designing error types in Rust libraries, emphasizing the difference between library and binary crate error handling. Binary crates often use `anyhow` or `eyre` for simple error messaging, while libraries require careful error type design as part of their public API.\n\nTwo common approaches for libraries are: using the `thiserror` crate or defining a custom error type similar to `std::io::Error`. `thiserror` with `#[from]` simplifies error type definition but can leak inner error types as dependencies to library users.  The article recommends using `Box<dyn std::error::Error + Send + Sync>` to avoid exposing inner error types, creating an opaque error type that encapsulates any error implementing the `std::error::Error` trait.\n\n`std::io::Error` serves as a reference, using an `ErrorKind` enum to represent error types and a `Custom` struct containing a boxed trait object for additional information. The key aspects of this design are the `ErrorKind` enum, a custom struct to encapsulate error information, a boxed trait object for holding inner errors, a `#[non_exhaustive]` enum for extensibility, and an internal `Repr` enum.\n\nThe choice between `thiserror` and custom error types depends on the project's specific needs. If the library is for external use, using `thiserror` with boxed trait objects, or a `std::io::Error` style custom type is preferable to avoid dependency issues. For internal libraries, `thiserror` with `#[from]` may be sufficient. The article concludes by advising a careful balance between convenience and API design, prioritizing a clean and consistent API for library consumers.\n",
    "chinese_title": "在 Rust 库中设计错误类型",
    "chinese_summary": "Rust 库中错误类型的设计"
  },
  {
    "id": "44148933",
    "title": "Figma Slides Is a Beautiful Disaster",
    "url": "https://allenpike.com/2025/figma-slides-beautiful-disaster",
    "summary": "Allen's article, \"Figma Slides Is a Beautiful Disaster,\" details his experience using Figma Slides for a presentation after 20 years of using Keynote. He initially loved the Grid view, Auto Layout, and Components, finding them faster and more powerful than Keynote for creating visually engaging slides. He highlighted the tool's advantages in structuring ideas and adapting to different text and images.\n\nHowever, he encountered significant issues during the presentation itself. While Figma Slides offers a \"Save Local Copy\" feature, it doesn't allow for offline presenting, and the presentation needs to be actively downloaded for offline use. Presenting also required manual window management instead of offering a proper full-screen audience view.\n\nThe most critical problem was a bug where animations on slides required double-clicking and didn't advance correctly, forcing him to awkwardly navigate and explain complex slides. He attributes this to Figma not treating the presenting aspect of Slides as \"mission-critical,\" unlike Apple's Keynote, which prioritizes reliability in presentations.\n\nDespite praising Figma Slides' design capabilities and expressing hope for its future, Allen ultimately concludes that Keynote remains the more reliable option for actual presentations due to its stability and focus on a seamless presentation experience. He argues for the value of \"boring technology\" when it comes to dependable performance. The article concludes with a positive update that Figma is taking the feedback seriously and aims to make the feature more reliable.\n",
    "chinese_title": "Figma幻灯片：美丽的灾难",
    "chinese_summary": "艾伦的文章《Figma Slides：美丽的灾难》详细描述了他使用Figma Slides做演示的经历，在此之前他已经使用了20年Keynote。起初，他很喜欢Grid视图、自动布局和组件功能，发现它们在创建视觉上引人入胜的幻灯片方面比Keynote更快更强大。他强调了该工具在构建思路和适应不同文本及图像方面的优势。\n\n然而，他在演示过程中遇到了重大问题。虽然Figma Slides提供“保存本地副本”功能，但它不允许离线演示，并且演示文稿需要主动下载才能离线使用。演示还需要手动窗口管理，而不是提供合适的观众全屏视图。\n\n最关键的问题是一个错误，幻灯片上的动画需要双击才能播放，且无法正确前进，迫使他尴尬地导航和解释复杂的幻灯片。他将此归因于Figma没有将Slides的演示方面视为“任务关键型”，这与苹果的Keynote不同，后者优先考虑演示的可靠性。\n\n尽管艾伦赞扬了Figma Slides的设计能力，并表达了对其未来的希望，但他最终得出结论，由于Keynote的稳定性和对无缝演示体验的关注，它仍然是实际演示的更可靠选择。他认为“枯燥的技术”在提供可靠性能方面具有价值。文章最后提供了一个积极的更新，Figma正在认真对待反馈，并致力于使该功能更加可靠。"
  },
  {
    "id": "44152154",
    "title": "M8.2 solar flare, Strong G4 geomagnetic storm watch",
    "url": "https://www.spaceweatherlive.com/en/news/view/581/20250531-m8-2-solar-flare-strong-g4-geomagnetic-storm-watch.html",
    "summary": "The article reports that an M8.2 class solar flare erupted from sunspot region AR3697 on May 31, 2024. This flare was associated with a coronal mass ejection (CME), a large expulsion of plasma and magnetic field from the Sun. Due to the strength and Earth-directed trajectory of the CME, a Strong G4 (severe) geomagnetic storm watch has been issued for June 2-3, 2024.\n\nA G4 geomagnetic storm can disrupt satellites, cause widespread voltage control problems on power grids, and interrupt radio navigation. It also increases the visibility of auroras (Northern Lights) at lower latitudes than usual, potentially as far south as New York and Idaho. The strength of the solar flare and the expected arrival time of the CME are the primary factors driving the geomagnetic storm watch. The article indicates heightened monitoring of solar activity and its potential impact on Earth is underway.\n",
    "chinese_title": "M8.2级太阳耀斑，强G4级地磁暴预警",
    "chinese_summary": "文章报道称，2024年5月31日，太阳黑子区域AR3697爆发了M8.2级太阳耀斑。这次耀斑伴随着日冕物质抛射(CME)，即太阳释放出的大量等离子体和磁场。由于该CME的强度和指向地球的轨迹，已针对2024年6月2日至3日发布了强G4级（严重）地磁暴预警。\n\nG4级地磁暴会扰乱卫星，导致电网出现大范围电压控制问题，并中断无线电导航。它还会增加极光（北极光）在比平常更低的纬度地区的可见度，可能远至纽约州和爱达荷州。太阳耀斑的强度和CME的预计到达时间是引发地磁暴预警的主要因素。文章表明，目前正在加强对太阳活动及其对地球潜在影响的监测。"
  },
  {
    "id": "44129480",
    "title": "A man who sailed round the world with a chicken (2019)",
    "url": "https://www.theguardian.com/global/2019/apr/21/why-did-the-chicken-cross-the-globe-french-sailor-guirec-soudee-monique",
    "summary": "This article recounts the extraordinary journey of Guirec Soudée, a young Breton sailor, who circumnavigated the world over five years, accompanied by his chicken, Monique. Leaving Brittany in 2014, they covered 45,000 miles, crossing the Atlantic, navigating the Arctic and Antarctic, and encountering numerous adventures and challenges along the way.\n\nThe article highlights their unique partnership, emphasizing Monique's surprising adaptability to life at sea. She defied expectations by laying eggs regularly and provided companionship to Guirec during his solitary journey. Their travels gained considerable attention on social media, turning them into internet sensations and leading to a children's book.\n\nKey moments of their voyage included being trapped in Arctic ice for 130 days, navigating the treacherous Northwest Passage (where Guirec navigated manually for 32 days due to malfunctioning autopilot), and wintering in Greenland, where Monique's eggs proved vital when food was scarce. The loss of Guirec's father during his Greenland stay added emotional weight to the journey.\n\nUpon returning to Brittany in 2018, Guirec found himself ready to be home. He is now committed to raising awareness about ocean conservation and the impact of climate change and plastic pollution, issues he witnessed firsthand during his travels. While enjoying a calmer life on his family's island, he is also contemplating future adventures, potentially with Monique. He confirms that Monique is the same hen he set off with, emphasizing the deep bond they formed during their shared experience.\n",
    "chinese_title": "带着鸡环游世界的人 (2019)",
    "chinese_summary": "本文讲述了年轻的布列塔尼水手吉雷克·苏戴的非凡航程。他花了五年多的时间环游世界，陪伴他的是他的鸡，莫妮克。他们于2014年离开布列塔尼，航行了45000英里，横渡大西洋，航行于北极和南极，一路经历了无数的冒险和挑战。\n\n文章重点介绍了他们独特的伙伴关系，强调了莫妮克令人惊讶的对海上生活的适应能力。她打破了人们的期望，定期下蛋，并在吉雷克孤独的旅程中提供了陪伴。他们的旅行在社交媒体上获得了极大的关注，使他们成为了网络红人，并促成了一本儿童读物的出版。\n\n他们航程中的关键时刻包括在北极冰层中被困130天，航行于危险的西北航道（由于自动驾驶仪故障，吉雷克手动航行了32天），以及在格陵兰岛过冬，在那里，当食物稀缺时，莫妮克的鸡蛋被证明至关重要。吉雷克在格陵兰岛逗留期间父亲的去世，为这段旅程增添了情感分量。\n\n2018年，吉雷克回到布列塔尼，发现自己已经准备好回家了。现在，他致力于提高人们对海洋保护以及气候变化和塑料污染影响的认识，这些问题是他旅行期间亲眼目睹的。在享受家人岛屿上更平静的生活的同时，他也正在考虑未来的冒险，可能还是与莫妮克一起。他确认莫妮克就是他出发时带的那只鸡，强调了他们在共同经历中形成的深厚感情。"
  },
  {
    "id": "44122860",
    "title": "Oxfordshire clock still keeping village on time after 500 years",
    "url": "https://www.bbc.com/news/articles/cz70p0qevlro",
    "summary": "St Augustine's clock in East Hendred, Oxfordshire, is celebrating its 500th birthday, marking five centuries of continuous operation. Believed to be one of Britain's oldest clocks in its original location, it dates back to the reign of Henry VIII and relies on church bells to chime every quarter hour, lacking a traditional clock face. The clock also features a carillon that plays \"Angel's Song\" four times daily.\n\nIn 2015, a hammer malfunction silenced the clock, highlighting its importance to the village, with residents noting its impact on daily life. After a lengthy renovation, including the installation of a mechanized winding system, the clock was restored.\n\nThe clock's accuracy, while remarkable for its age, is now maintained using a modern digital clock alongside the original mechanism. Restoration expert Simon Gilchrist emphasized the historical significance of working on such an ancient device. The village celebrated the clock's anniversary with tours of the tower to view the working mechanism.\n",
    "chinese_title": "牛津郡时钟500年如一日，村庄时间精准依旧",
    "chinese_summary": "牛津郡东亨德里德圣奥古斯丁教堂的钟庆祝其500周年诞辰，标志着五个世纪的持续运转。据信它是英国最古老的原址钟之一，可以追溯到亨利八世统治时期，依靠教堂的钟声每刻钟报时，没有传统的钟面。该钟还配备了一个钟琴，每天播放四次“天使之歌”。\n\n2015年，一个锤子故障导致钟声停止，突显了其对村庄的重要性，居民们注意到它对日常生活的影响。经过漫长的修复，包括安装机械化的上弦系统，该钟得以修复。\n\n该钟的精度，对于其年代来说是显著的，现在通过一个现代数字钟与原始机械装置一起维护。修复专家西蒙·吉尔克里斯特强调了修复如此古老装置的历史意义。该村庄通过塔楼参观活动庆祝该钟的周年纪念，以便观看其工作机制。"
  },
  {
    "id": "44153569",
    "title": "OneDrive File Picker Flaw Provides Apps Full Read Access Entire OneDrive",
    "url": "https://www.oasis.security/blog/onedrive-file-picker-security-flaw-oasis-research",
    "summary": "Oasis Security discovered a flaw in Microsoft's OneDrive File Picker that grants websites excessive access to a user's entire OneDrive, instead of just the selected files. This affects potentially millions of users across hundreds of apps like ChatGPT, Slack, Trello, and ClickUp. The core issues are:\n\n1.  **Excessive Permissions:** The OneDrive File Picker requests read access to the entire drive, lacking fine-grained OAuth scopes.\n2.  **Vague Consent Prompt:** Users aren't clearly informed about the extent of access they're granting.\n3.  **Insecure Secret Storage:** The latest version (8.0) stores sensitive tokens insecurely, potentially using Refresh Tokens that prolong access.\n\nOasis Security recommends users review and revoke third-party access granted to their Microsoft account. They also advise web app developers to temporarily remove the OneDrive File Picker, use safer alternatives like shared \"view-only\" links, avoid Refresh Tokens, and securely store Access Tokens. Microsoft is considering improvements to address the issue.\n",
    "chinese_title": "OneDrive文件选择器漏洞允许应用完全读取整个OneDrive",
    "chinese_summary": "Oasis Security 发现 Microsoft OneDrive 文件选择器存在漏洞，该漏洞允许网站过度访问用户的整个 OneDrive，而不仅仅是选定的文件。这可能会影响 ChatGPT、Slack、Trello 和 ClickUp 等数百个应用程序中的数百万用户。核心问题是：\n\n1. **过度权限：** OneDrive 文件选择器请求读取整个驱动器的权限，缺乏细粒度的 OAuth 范围。\n2. **模糊的同意提示：** 用户没有被清楚地告知他们授予的访问权限范围。\n3. **不安全的密钥存储：** 最新版本 (8.0) 不安全地存储敏感令牌，可能使用刷新令牌来延长访问权限。\n\nOasis Security 建议用户审查并撤销授予其 Microsoft 帐户的第三方访问权限。他们还建议 Web 应用程序开发者暂时删除 OneDrive 文件选择器，使用更安全的替代方案（如共享的“只读”链接），避免使用刷新令牌，并安全地存储访问令牌。Microsoft 正在考虑改进措施以解决此问题。"
  },
  {
    "id": "44146830",
    "title": "Oniux: Kernel-level Tor isolation for any Linux app",
    "url": "https://blog.torproject.org/introducing-oniux-tor-isolation-using-linux-namespaces/",
    "summary": "This article introduces oniux, a command-line utility that provides kernel-level Tor network isolation for Linux applications using Linux namespaces. Developed by the Tor Project, oniux ensures that all traffic from a specified application is routed through Tor, preventing data leaks caused by misconfigured proxy settings or direct system calls.\n\nLinux namespaces isolate an application's access to system resources, creating a secure container. Oniux places each application within a network namespace that only has access to a custom Tor-configured network interface, preventing it from accessing other network interfaces on the system.\n\nThe article contrasts oniux with torsocks, a similar tool that works by overwriting libc functions. Oniux offers better security by preventing data leaks from statically linked binaries or applications using raw system calls, which torsocks is vulnerable to. The key advantages of oniux are that it works on all applications, even malicious ones, cannot leak data and uses Arti as it's engine.\n\nUsers can install oniux via `cargo install` and use it to \"torify\" individual commands or entire shell sessions. Oniux sets up isolated network, mount, PID, and user namespaces for the application, configures DNS resolution through Tor, and creates a TUN interface to route traffic.\n\nThe article emphasizes that oniux is an experimental tool, but encourages users to test it.\n",
    "chinese_title": "Oniux：针对任何 Linux 应用程序的内核级 Tor 隔离",
    "chinese_summary": "本文介绍了oniux，一款命令行实用工具，它利用Linux命名空间为Linux应用程序提供内核级的Tor网络隔离。Oniux由Tor项目开发，可确保指定应用程序的所有流量都通过Tor路由，从而防止因代理设置错误或直接系统调用导致的数据泄露。\n\nLinux命名空间隔离了应用程序对系统资源的访问，从而创建了一个安全的容器。Oniux将每个应用程序置于一个网络命名空间中，该命名空间仅能访问自定义的Tor配置网络接口，从而防止其访问系统上的其他网络接口。\n\n本文将oniux与torsocks进行了对比，torsocks是一种类似的工具，其工作原理是覆盖libc函数。Oniux通过防止静态链接的二进制文件或使用原始系统调用的应用程序（torsocks容易受到攻击）的数据泄露，从而提供了更好的安全性。Oniux的主要优势在于，它适用于所有应用程序，即使是恶意程序，也不会泄漏数据，并且使用Arti作为其引擎。\n\n用户可以通过`cargo install`安装oniux，并使用它来“Tor化”单个命令或整个shell会话。Oniux为应用程序设置隔离的网络、挂载、PID和用户命名空间，通过Tor配置DNS解析，并创建一个TUN接口来路由流量。\n\n本文强调oniux是一个实验性工具，但鼓励用户进行测试。"
  },
  {
    "id": "44146619",
    "title": "CCD co-inventor George E. Smith dies at 95",
    "url": "https://www.nytimes.com/2025/05/30/science/george-e-smith-dead.html",
    "summary": "George E. Smith, co-inventor of the charge-coupled device (CCD) and Nobel Prize laureate, died at 95. He and Willard S. Boyle invented the CCD at Bell Laboratories in 1969. This revolutionary imaging device is a core component of digital cameras, telescopes, medical scanners, and photocopiers. The CCD allows for clearer observation of the universe and enables widespread digital photography.\n\nSmith and Boyle were initially working on improving computer memory storage when they conceived the CCD, utilizing the photoelectric effect (Einstein's explanation of which won him the 1921 Nobel Prize). Their invention uses rows of tiny capacitors to store and transfer electrical charges generated by light, effectively capturing light and constructing images.\n\nThe importance of their invention was acknowledged when they shared the 2009 Nobel Prize in Physics with Charles K. Kao for his work on fiber-optic cables. According to the Nobel academy's secretary general, their work helped build “the foundation to our modern information society.”\n",
    "chinese_title": "CCD共同发明人乔治·E·史密斯逝世，享年95岁",
    "chinese_summary": "电荷耦合器件（CCD）共同发明人、诺贝尔奖得主乔治·E·史密斯逝世，享年95岁。他与威拉德·S·博伊尔于1969年在贝尔实验室发明了CCD。这种革命性的成像设备是数码相机、望远镜、医疗扫描仪和复印机的核心部件。CCD能够更清晰地观测宇宙，并实现了广泛的数码摄影。\n\n史密斯和博伊尔最初致力于改进计算机内存存储，当时他们构思了CCD，利用了光电效应（爱因斯坦对光电效应的解释使他获得了1921年诺贝尔奖）。他们的发明使用一排排微小的电容器来存储和传输由光产生的电荷，从而有效地捕捉光线并构建图像。\n\n他们的发明的重要性得到了认可，他们与因光纤电缆研究而获奖的查尔斯·K·高分享了2009年诺贝尔物理学奖。诺贝尔学院秘书长表示，他们的工作为“我们现代信息社会奠定了基础”。"
  },
  {
    "id": "44144730",
    "title": "The Rise of the Japanese Toilet",
    "url": "https://www.nytimes.com/2025/05/29/business/toto-toilet-japan-bidet.html",
    "summary": "This article chronicles the rise of the Japanese toilet, specifically the Toto Washlet, from a controversial product in Japan to a growing trend in the United States. In 1982, Toto introduced the Washlet, a toilet seat with a bidet function, sparking initial shock and anger in Japan due to its novelty and suggestive nature. However, within four decades, Washlet-style bidets became a ubiquitous feature in Japanese homes and public spaces, accounting for over 80% of household toilets.\n\nNow, Toto is witnessing a similar trend in the United States. After years of slow adoption, Toto Washlets have gained popularity, fueled by social media mentions, celebrity endorsements (such as Ali Wong and Drake), and a growing interest in home renovation projects. An industry report indicates that over two in five homeowners renovating in the US are opting for toilets with specialized features, including bidet seats. This surge in demand has resulted in an eightfold increase in Toto's profits in its Americas housing equipment business in the past five years, prompting the company to pursue further expansion in the American market.\n",
    "chinese_title": "日本马桶的崛起",
    "chinese_summary": "本文记录了日本智能马桶，特别是东陶卫洗丽的发展历程，从最初在日本备受争议的产品到如今在美国日益增长的趋势。1982年，东陶推出了卫洗丽，一种带有冲洗功能的马桶座，其新颖性和暗示性在日本引发了最初的震惊和愤怒。然而，在过去的四十年里，卫洗丽式坐便器已成为日本家庭和公共场所的普遍特征，占家用马桶的80%以上。\n\n现在，东陶正在美国见证类似的趋势。经过多年的缓慢发展，东陶卫洗丽已越来越受欢迎，这得益于社交媒体的提及、名人代言（如黄阿丽和德雷克）以及人们对家居装修项目日益增长的兴趣。一份行业报告显示，在美国进行装修的房主中，超过五分之二的人选择具有特殊功能的马桶，包括智能马桶盖。需求的激增导致东陶在过去五年中，其美洲住房设备业务的利润增长了八倍，促使该公司进一步拓展美国市场。"
  },
  {
    "id": "44129567",
    "title": "Ovld – Efficient and featureful multiple dispatch for Python",
    "url": "https://github.com/breuleux/ovld",
    "summary": "Ovld is a Python library for fast and featureful multiple dispatch, offering significant performance improvements over alternatives. It allows defining different versions of a function based on the type signatures of multiple arguments, eliminating the need for `isinstance` chains.\n\nKey features include:\n\n*   **Speed:** Ovld is demonstrably faster than other multiple dispatch libraries.\n*   **Variants:** Creates modified copies of ovld objects, useful for specialization.\n*   **Value-based Dispatch:** Enables dispatching based on argument values using `typing.Literal` and `Dependent`.\n*   **Extensive Applicability:** Works with functions, methods, positional, and keyword arguments.\n*   **Code Generation:** (Experimental) Allows custom code generation for advanced use cases.\n*   **Recursive Function Support:** Seamlessly handles recursive definitions using `recurse`.\n*   **Priority Control:** Defines a numeric priority for methods using `call_next`.\n*   **Custom Dependent Types:** Allows defining custom types with the `@dependent_check` decorator.\n*   **Method Overloading:** Supports method overloading within classes using `OvldMC` metaclass or inheriting from `OvldBase`.\n*   **Subclass Extension:** Subclasses can extend overloaded methods using `@extend_super`.\n*   **Medleys:** Combining functionality from multiple classes is supported by inheriting from `ovld.Medley`.\n\nOvld's performance and extensive feature set make it a powerful tool for implementing complex dispatch logic in Python.\n",
    "chinese_title": "Ovld – Python 的高效且功能丰富的多重分派",
    "chinese_summary": "Ovld 是一个 Python 库，用于实现快速且功能丰富的多分派，相比其他替代方案，性能显著提升。它允许根据多个参数的类型签名定义函数的不同版本，无需使用 `isinstance` 链。\n\n主要特性包括：\n\n*   **速度：** Ovld 比其他多分派库明显更快。\n*   **变体：** 创建 ovld 对象的修改副本，对专门化很有用。\n*   **基于值的分派：** 允许使用 `typing.Literal` 和 `Dependent` 基于参数值进行分派。\n*   **广泛的适用性：** 适用于函数、方法、位置参数和关键字参数。\n*   **代码生成：** （实验性）允许为高级用例进行自定义代码生成。\n*   **递归函数支持：** 使用 `recurse` 无缝处理递归定义。\n*   **优先级控制：** 使用 `call_next` 为方法定义数字优先级。\n*   **自定义依赖类型：** 允许使用 `@dependent_check` 装饰器定义自定义类型。\n*   **方法重载：** 支持使用 `OvldMC` 元类或继承自 `OvldBase` 在类中进行方法重载。\n*   **子类扩展：** 子类可以使用 `@extend_super` 扩展重载方法。\n*   **混合体：** 通过继承自 `ovld.Medley` 支持组合来自多个类的功能。\n\nOvld 的高性能和广泛的功能集使其成为在 Python 中实现复杂分派逻辑的强大工具。"
  },
  {
    "id": "44154856",
    "title": "Implementing TOTP two-factor authentication in 2025",
    "url": "https://feeding.cloud.geek.nz/posts/totp-in-2025/",
    "summary": "This article analyzes the state of TOTP (Time-based One-Time Password) authenticator support for various security parameters in 2025, building upon a 2019 analysis that found interoperability issues due to authenticators incorrectly handling parameters. The author tested several Android and iOS authenticators against the `oathtool` client, evaluating their support for different hashing algorithms (SHA1 and SHA256) and key sizes.\n\nThe tests revealed inconsistent support for SHA256 and larger key sizes. While some authenticators like Bitwarden, FreeOTP, Google Authenticator, and LastPass Authenticator fully support SHA256, others such as Authy, Duo Security, and Microsoft Authenticator treat SHA256 as SHA1, leading to incorrect code generation. The Google Authenticator on iOS rejects SHA1 keys with 52 characters.\n\nThe author concludes that the recommendations from 2019 still hold true: for maximum interoperability, services should stick to the default parameters of SHA1, a 32-character key size, 30-second periods, and 6 digits. The author also advises avoiding placing the secret parameter last in the URI due to parsing issues in some Google Authenticator versions. Additional recommendations include tracking used codes, securely storing the TOTP secret (using a secrets manager, not hashing), providing recovery mechanisms like scratch codes, and considering including image and color parameters in the URI for enhanced user experience.\n",
    "chinese_title": "2025年实施TOTP双因素身份验证",
    "chinese_summary": "This article analyzes the state of TOTP (Time-based One-Time Password) authenticator support for various security parameters in 2025, building upon a 2019 analysis that found interoperability issues due to authenticators incorrectly handling parameters. The author tested several Android and iOS authenticators against the `oathtool` client, evaluating their support for different hashing algorithms (SHA1 and SHA256) and key sizes.\n\nThe tests revealed inconsistent support for SHA256 and larger key sizes. While some authenticators like Bitwarden, FreeOTP, Google Authenticator, and LastPass Authenticator fully support SHA256, others such as Authy, Duo Security, and Microsoft Authenticator treat SHA256 as SHA1, leading to incorrect code generation. The Google Authenticator on iOS rejects SHA1 keys with 52 characters.\n\nThe author concludes that the recommendations from 2019 still hold true: for maximum interoperability, services should stick to the default parameters of SHA1, a 32-character key size, 30-second periods, and 6 digits. The author also advises avoiding placing the secret parameter last in the URI due to parsing issues in some Google Authenticator versions. Additional recommendations include tracking used codes, securely storing the TOTP secret (using a secrets manager, not hashing), providing recovery mechanisms like scratch codes, and considering including image and color parameters in the URI for enhanced user experience.\n"
  },
  {
    "id": "44139626",
    "title": "Photos taken inside musical instruments",
    "url": "https://www.dpreview.com/photography/5400934096/probe-lenses-and-focus-stacking-the-secrets-to-incredible-photos-taken-inside-instruments",
    "summary": "Here's a summary of the article \"Photos taken inside musical instruments\":\n\nThe article discusses how photographer Charles Brooks creates stunning and surreal images taken *inside* musical instruments. He achieves this feat through a combination of specialized equipment and techniques, primarily probe lenses and focus stacking.\n\nProbe lenses, characterized by their long, narrow barrels and wide angle of view, allow Brooks to physically insert the lens inside the instrument while maintaining a comfortable working distance outside. This is crucial for accessing the intricate inner spaces without damaging the instrument.\n\nFocus stacking is then employed to overcome the shallow depth of field inherent to macro photography, especially at close range within the confines of the instruments. Brooks takes multiple photos, each focused on a slightly different plane, and then uses software to combine the sharpest parts of each image into a single, fully focused photograph.\n\nThe article highlights the challenges involved, including working in extremely tight spaces, dealing with reflections and lighting issues, and the need for patience and precision. Brooks' work reveals the often unseen beauty and architectural complexity within instruments, showcasing textures, shapes, and details that are normally hidden from view. He often uses creative lighting to enhance these internal features, turning utilitarian components into captivating subjects. The resulting images offer a unique perspective and appreciation for the craftsmanship and design of these objects.\n",
    "chinese_title": "乐器内部照片",
    "chinese_summary": "乐器内部摄影作品摘要：\n\n本文探讨了摄影师查尔斯·布鲁克斯如何创作出令人惊叹且超现实的乐器*内部*照片。他通过专业设备和技术相结合，主要是探针镜头和焦点堆叠来实现这一壮举。\n\n探针镜头的特点是其细长的镜筒和广阔的视角，使布鲁克斯能够将镜头物理性地插入乐器内部，同时在外部保持舒适的工作距离。这对于进入复杂的内部空间而不损坏乐器至关重要。\n\n然后，采用焦点堆叠来克服微距摄影固有的景深浅问题，尤其是在乐器内部的近距离拍摄时。布鲁克斯拍摄多张照片，每张照片都聚焦于略微不同的平面，然后使用软件将每张照片中最清晰的部分组合成一张完全聚焦的照片。\n\n本文强调了所涉及的挑战，包括在极其狭窄的空间中工作、处理反射和照明问题，以及需要耐心和精确性。布鲁克斯的作品揭示了乐器内部通常未被看到的优美和建筑复杂性，展示了通常隐藏在视野之外的纹理、形状和细节。他经常使用创意照明来增强这些内部特征，将实用组件转化为引人入胜的主题。由此产生的图像提供了独特的视角，并增强了对这些物体的工艺和设计的欣赏。"
  },
  {
    "id": "44150002",
    "title": "Atari Means Business with the Mega ST",
    "url": "https://www.goto10retro.com/p/atari-means-business-with-the-mega",
    "summary": "This article reviews the Atari Mega ST, Atari's first attempt at a professional workstation, released in 1987. While aimed at the business market, it faced design and timing issues that hindered its success.\n\nThe Mega ST featured a low-profile case, internal floppy drive, and a detachable Cherry key switch keyboard, which was well-regarded but still had some ergonomic issues. Its technical upgrades included a blitter chip for faster graphics processing, TOS 1.02 with bug fixes, and up to 4MB of RAM (a significant amount at the time). However, it shared the same 8MHz processor speed as the older 520ST and 1040ST, limiting performance gains. An internal bus connector was underutilized, and the case lacked space for internal upgrades, leading to external peripherals like the MegaFile hard drive.\n\nAtari marketed the Mega ST with the SLM804 laser printer as a complete desktop publishing solution, cheaper than a comparable Macintosh setup. The author notes that selling the Mega ST was a challenge due to Atari's association with games and inexpensive computers, making it difficult to attract business users.\n\nThe Mega ST suffered from delivery delays due to a shortage and price increase in 1Mbit DRAM, impacting production and leading to a focus on the European market. Ultimately, it was replaced by the Mega STE in 1991/1992. The author prefers the Mega STE, citing the original Mega ST's size, limited upgradability, and lack of a speed boost compared to older ST models, relegating the keyboard as its main appeal.\n",
    "chinese_title": "雅达利 Mega ST 商务领航",
    "chinese_summary": "本文回顾了雅达利 Mega ST，雅达利于 1987 年发布的首款专业工作站尝试。尽管目标是商业市场，但它面临着设计和时机问题，阻碍了其成功。\n\nMega ST 具有低矮的外形、内置软驱和一个可拆卸的 Cherry 机械键盘，键盘广受好评，但仍然存在一些人体工程学问题。其技术升级包括用于更快图形处理的加速芯片、带有错误修复的 TOS 1.02 以及高达 4MB 的 RAM（在当时来说是相当大的数量）。然而，它与旧款 520ST 和 1040ST 共享相同的 8MHz 处理器速度，限制了性能提升。内部总线连接器未得到充分利用，机箱缺乏内部升级空间，导致需要 MegaFile 硬盘等外部外设。\n\n雅达利将 Mega ST 与 SLM804 激光打印机一起作为完整的桌面出版解决方案进行销售，比同等配置的 Macintosh 设置更便宜。作者指出，由于雅达利与游戏和廉价电脑的联系，销售 Mega ST 是一项挑战，使其难以吸引商业用户。\n\n由于 1Mbit DRAM 的短缺和价格上涨，Mega ST 遭受了交付延迟，影响了生产，并导致专注于欧洲市场。最终，它在 1991/1992 年被 Mega STE 取代。作者更喜欢 Mega STE，理由是最初的 Mega ST 尺寸大、可升级性有限，并且与旧款 ST 型号相比缺乏速度提升，使得键盘成为其主要吸引力。"
  },
  {
    "id": "44146599",
    "title": "Why we still can't stop plagiarism in undergraduate computer science (2018)",
    "url": "https://kevinchen.co/blog/cant-stop-plagiarism-in-computer-science/",
    "summary": "生成摘要时出错",
    "chinese_title": "Why we still can't stop plagiarism in undergraduate computer science (2018)",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44144750",
    "title": "Precision Clock Mk IV",
    "url": "https://mitxela.com/projects/precision_clock_mk_iv",
    "summary": "生成摘要时出错",
    "chinese_title": "Precision Clock Mk IV",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44140918",
    "title": "Every 5x5 Nonogram",
    "url": "https://pixelogic.app/every-5x5-nonogram",
    "summary": "This is a snippet from a website titled \"Every 5x5 Nonogram,\" which likely presents a collection of 5x5 Nonogram puzzles. However, the provided content doesn't actually describe the puzzles themselves. Instead, it indicates a disconnection issue (\"You were disconnected due to lack of activity. Reload the page to continue playing\").\n\nFollowing the disconnection message, there's a promotional message from the game's creator. It highlights another nonogram game called \"Pixelogic - Daily Nonograms!\" which boasts daily puzzles and a large library of over 6,000 human-crafted nonograms. The creator encourages the reader to support them by downloading Pixelogic on iOS, Android, or Steam, or by subscribing to a newsletter for web-based play. There's also a call to action to wishlist \"Pixelogic: Nonograms Unlimited\" on Steam and to sign up for an email newsletter featuring weekly puzzles.\n\nIn essence, the content is more about promoting a related game than providing actual information about the \"Every 5x5 Nonogram\" collection that the page is presumably dedicated to. The key takeaway is the recommendation of \"Pixelogic - Daily Nonograms!\" and the various ways to access and support it.\n",
    "chinese_title": "每个5x5的绘图方块",
    "chinese_summary": "这是一段来自名为“所有5x5 Nonogram”网站的代码片段。该网站很可能展示5x5 Nonogram谜题的集合。然而，提供的内容实际上并没有描述谜题本身。相反，它显示了一个连接问题（“由于缺乏活动，您已断开连接。重新加载页面以继续游戏”）。\n\n在断开连接消息之后，是游戏创建者的宣传信息。它重点介绍了另一款Nonogram游戏“Pixelogic - 每日 Nonograms!”，该游戏拥有每日谜题和一个超过6,000个手工制作的Nonogram的大型库。创建者鼓励读者通过在iOS、Android或Steam上下载Pixelogic，或订阅时事通讯以进行基于Web的播放来支持他们。还有一个行动号召，希望读者在Steam上将“Pixelogic: Nonograms Unlimited”加入愿望清单，并注册包含每周谜题的电子邮件新闻通讯。\n\n本质上，该内容更多的是宣传相关游戏，而不是提供关于页面本应致力于的“所有5x5 Nonogram”集合的实际信息。 关键要点是“Pixelogic - 每日 Nonograms!”的推荐以及访问和支持它的各种方式。"
  },
  {
    "id": "44155914",
    "title": "The Uline print catalog is impeccably designed",
    "url": "https://ashwinsundar.com/posts/uline-design/",
    "summary": "This article praises the unexpectedly brilliant design of the Uline print catalog. Despite being a simple shipping supply catalog, it embodies effective and consistent design principles that prioritize clarity and functionality. The author highlights its standardized layout, which includes a heavy title, concise bullet points, informative image captions, and product information tables. This consistency ensures that customers can easily understand Uline's offerings without needing a tutorial.\n\nKey design elements include: a limited but effective use of fonts and colors; high-quality, isolated product images; and well-designed tables that prioritize numerical data and clear information presentation. The catalog's \"flippability\" allows for easy browsing and quick information retrieval, aided by a simple index.\n\nThe author emphasizes Uline's focus on direct sales and efficiency. Unlike many companies today, Uline avoids unnecessary advertising gimmicks, social media engagement, and mission statements, opting instead for a straightforward approach: providing a clear interface (the catalog) to its shipping machine. The limited mention of their website, even in 2025, reinforces their commitment to the catalog as a primary sales tool and their honest approach to business. The author concludes that Uline's catalog is a testament to the power of simple, well-executed design focused solely on serving the customer's needs.\n",
    "chinese_title": "Uline印刷目录设计精良。",
    "chinese_summary": "这篇文章赞扬了Uline印刷目录出人意料的出色设计。尽管只是一个简单的运输用品目录，它却体现了有效且一致的设计原则，优先考虑清晰性和功能性。作者强调了其标准化的布局，包括醒目的标题、简洁的要点、信息丰富的图像说明和产品信息表格。这种一致性确保了客户可以轻松理解Uline的产品，而无需教程。\n\n关键设计要素包括：有限但有效使用的字体和颜色；高质量、独立的商品图片；以及设计良好的表格，优先考虑数字数据和清晰的信息呈现。该目录的“易翻阅性”便于浏览和快速检索信息，并由简单的索引辅助。\n\n作者强调了Uline对直接销售和效率的关注。与当今许多公司不同，Uline避免了不必要的广告噱头、社交媒体互动和使命宣言，而是选择了一种直截了当的方法：为其运输机器提供一个清晰的界面（目录）。即使在2025年，对他们网站的有限提及也加强了他们对目录作为主要销售工具的承诺以及他们诚实的经营方式。作者总结说，Uline的目录证明了简单、精心执行的设计的力量，这种设计完全专注于满足客户的需求。"
  },
  {
    "id": "44157116",
    "title": "Understanding Consistency in Databases: Beyond the Basics",
    "url": "https://medium.com/@lucas01/understanding-consistency-in-databases-beyond-the-basics-293013a50481",
    "summary": "生成摘要时出错",
    "chinese_title": "Understanding Consistency in Databases: Beyond the Basics",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44156321",
    "title": "0.9999 ≊ 1",
    "url": "https://lcamtuf.substack.com/p/09999-1",
    "summary": "Here's a summary of the article \"0.9999 ≊ 1\" from lcamtuf's Substack, based on the provided URL (assuming I could access it, which I cannot in this current context):\n\nThe article \"0.9999 ≊ 1\" discusses the common mathematical concept that the repeating decimal 0.999... (0.9 repeating infinitely) is equal to 1. The author likely explains *why* this is true, touching upon the various mathematical proofs that demonstrate the equivalence. These usually include:\n\n*   **Algebraic Proofs:** Showing that if x = 0.999..., then 10x = 9.999..., and subtracting x from 10x results in 9x = 9, therefore x = 1.\n*   **Fractional Representation:** Showing that 0.999... can be derived from the fractional representation of 1/3 = 0.333... Multiplying both sides by 3 results in 1 = 0.999...\n*   **Limit-Based Proofs:** Explaining that 0.999... is the limit of the sequence 0.9, 0.99, 0.999, ... , which converges to 1.\n\nThe article probably also addresses the *psychological* reasons why many people find this concept counterintuitive. It might explore the intuitive (but incorrect) notion that there must be an infinitely small gap between 0.999... and 1.\n\nFurthermore, the author likely discusses the importance of understanding this concept for a solid foundation in real analysis and calculus. It's a good example of how intuitive notions can sometimes be misleading in mathematics and highlights the need for rigorous definitions and proofs. The author might also touch upon practical implications or related topics in computer science or programming where such mathematical precision can matter.\n\nUnable to access the article link.\n",
    "chinese_title": "0.  9999 ≈ 1",
    "chinese_summary": "以下是基于lcamtuf Substack上文章《0.9999 ≊ 1》的摘要（假设我可以访问该链接，但在此上下文中我无法做到）：\n\n文章《0.9999 ≊ 1》讨论了常见的数学概念，即循环小数0.999...（0.9无限循环）等于1。作者可能解释了*为什么*这是正确的，并涉及证明这种等价性的各种数学证明。 这些通常包括：\n\n*   **代数证明：** 显示如果x = 0.999...，则10x = 9.999...，从10x中减去x得到9x = 9，因此x = 1。\n*   **分数表示：** 显示0.999...可以从1/3 = 0.333...的分数表示导出。 两边都乘以3得到1 = 0.999...\n*   **基于极限的证明：** 解释说0.999...是序列0.9、0.99、0.999...的极限，该序列收敛到1。\n\n这篇文章可能还探讨了许多人觉得这个概念违反直觉的*心理*原因。 它可能探讨了直观（但错误）的观念，即0.999...和1之间必须存在无限小的差距。\n\n此外，作者可能讨论了理解这个概念对于实分析和微积分的坚实基础的重要性。 这是一个很好的例子，说明了直观概念有时会在数学中产生误导，并突出了严格定义和证明的必要性。 作者还可能涉及计算机科学或编程中这种数学精度可能重要的实际意义或相关主题。\n\n无法访问文章链接。"
  },
  {
    "id": "44148997",
    "title": "How I like to install NixOS (declaratively)",
    "url": "https://michael.stapelberg.ch/posts/2025-06-01-nixos-installation-declarative/",
    "summary": "生成摘要时出错",
    "chinese_title": "我喜欢如何（声明式地）安装 NixOS",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44146858",
    "title": "YOLO-World: Real-Time Open-Vocabulary Object Detection",
    "url": "https://arxiv.org/abs/2401.17270",
    "summary": "This arXiv article (v3, published Feb 22, 2024) introduces YOLO-World, a novel real-time open-vocabulary object detection system built upon the popular YOLO (You Only Look Once) framework. YOLO-World addresses the limitations of traditional YOLO detectors, which rely on predefined object categories, by incorporating vision-language modeling.\n\nThe core innovation is the Re-parameterizable Vision-Language Path Aggregation Network (RepVL-PAN) and a region-text contrastive loss, designed to effectively integrate visual and linguistic information. This allows YOLO-World to detect a wide range of objects in a zero-shot manner, without requiring prior training on specific object classes.\n\nThe article highlights YOLO-World's efficiency and accuracy. On the LVIS dataset, it achieves 35.4 AP at 52.0 FPS on a V100 GPU, outperforming existing methods. Furthermore, fine-tuning YOLO-World demonstrates strong performance in downstream tasks such as object detection and open-vocabulary instance segmentation.\n\nThe authors have made the code and models available for the research community. The paper provides links to various tools and resources, including code repositories, citation tools, and related paper finders, for further exploration.\n",
    "chinese_title": "YOLO-World：实时开放词汇目标检测",
    "chinese_summary": "这篇arXiv文章（v3，2024年2月22日发布）介绍了YOLO-World，一种基于流行的YOLO（You Only Look Once）框架构建的新型实时开放词汇对象检测系统。YOLO-World通过整合视觉-语言建模，解决了传统YOLO检测器依赖于预定义对象类别的局限性。\n\n其核心创新是可重参数化的视觉-语言路径聚合网络（RepVL-PAN）以及区域-文本对比损失，旨在有效整合视觉和语言信息。这使得YOLO-World能够以零样本方式检测各种对象，而无需事先针对特定对象类别进行训练。\n\n文章强调了YOLO-World的效率和准确性。在LVIS数据集上，它在V100 GPU上以52.0 FPS的速度实现了35.4 AP，优于现有方法。此外，微调YOLO-World在对象检测和开放词汇实例分割等下游任务中表现出强大的性能。\n\n作者已将代码和模型提供给研究社区。该论文提供了各种工具和资源的链接，包括代码仓库、引用工具和相关论文查找器，以供进一步探索。"
  },
  {
    "id": "44144224",
    "title": "My five-year experiment with UTC",
    "url": "https://timestripe.com/magazine/blog/timezone/",
    "summary": "Adam Arutyunov, a Timestripe programmer, shares his five-year experiment of living entirely by Coordinated Universal Time (UTC). Frustrated by the inconsistencies and arbitrary nature of administrative time zones, he switched all his devices to UTC. Initially, he expected a mental burden of constantly converting UTC to his local Moscow time, but surprisingly, his brain quickly adapted. He now perceives both UTC and local time simultaneously without conscious conversion.\n\nArutyunov highlights the benefits for frequent travelers and remote workers. Using UTC eliminates the need to adjust device time zones, creating consistency and a stable sense of time regardless of location. He recounts avoiding miscalculations and missed appointments, even with frequent zone changes.\n\nThe two drawbacks he mentions are the occasional difficulty in converting 12-hour local time to 24-hour UTC when arranging meetings, and frequently explaining why his phone displays \"the wrong time.\" Despite these minor inconveniences, he intends to continue using UTC due to its positive impact on productivity and simplification of his life.\n\nThe article concludes by suggesting how Timestripe can help readers apply similar principles of clarity and control to their own time management, using features like Timeblocking, Horizons, and Tags to manage schedules and contexts effectively.\n",
    "chinese_title": "我使用UTC五年的实验",
    "chinese_summary": "亚当·阿鲁秋诺夫，Timestripe程序员，分享了他完全按照协调世界时（UTC）生活五年的实验。由于对行政时区的矛盾和随意性感到沮丧，他将所有设备切换到了UTC。最初，他预计会将UTC持续转换为莫斯科当地时间，造成精神负担，但令人惊讶的是，他的大脑很快适应了。现在，他可以在无需有意识转换的情况下同时感知UTC和当地时间。\n\n阿鲁秋诺夫强调了这对经常旅行者和远程工作者的好处。使用UTC无需调整设备时区，无论身在何处，都能保持一致性和稳定的时间感。他回忆说，即使频繁更换时区，也能避免误算和错过约会。\n\n他提到的两个缺点是，安排会议时偶尔难以将12小时的当地时间转换为24小时的UTC，以及经常需要解释为什么他的手机显示“错误的时间”。尽管存在这些小的不便，但他打算继续使用UTC，因为它对提高生产力和简化生活产生了积极影响。\n\n文章最后建议，Timestripe如何帮助读者将类似的清晰和控制原则应用于他们自己的时间管理，使用时间块、视野和标签等功能来有效地管理日程安排和上下文。"
  },
  {
    "id": "44125462",
    "title": "Show HN: A Implementation of Alpha Zero for Chess in MLX",
    "url": "https://github.com/koogle/mlx-playground/tree/main/chesszero",
    "summary": "生成摘要时出错",
    "chinese_title": "Show HN: A Implementation of Alpha Zero for Chess in MLX",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44156142",
    "title": "How reliable are MicroSD cards?",
    "url": "https://old.reddit.com/r/raspberry_pi/comments/1l0v25s/how_reliable_are_microsd_cards_well_as_it_turns/",
    "summary": "生成摘要时出错",
    "chinese_title": "MicroSD卡有多可靠？",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44157484",
    "title": "A.I. Is Coming for the Coders Who Made It",
    "url": "https://www.nytimes.com/2025/06/02/opinion/ai-coders-jobs.html",
    "summary": "This article argues that AI poses a significant challenge to the field of computer programming, potentially mirroring the concerns about its impact on literacy. The author highlights a shift towards \"vibecoding,\" where programmers use spoken prompts to AI chatbots to generate code, reducing hands-on coding.\n\nWhile this offers speed and efficiency, concerns are emerging. The AI-generated code is reportedly inefficient and error-prone, and programmers are experiencing a decline in their coding skills due to lack of practice. This is akin to losing literacy when relying too heavily on AI for writing.\n\nThe article points to real-world adoption of AI coding practices, with Google and Microsoft reporting significant percentages of their code being AI-generated. This has led to job losses for software engineers, and a shift in the nature of the work, transforming it from an intellectually stimulating pursuit into a more monotonous task. Even AI companies like OpenAI are investing heavily in AI-driven coding assistants, signaling a future where AI plays an even larger role in software development, potentially at the expense of human coders' skills and job security. The author cautions that while AI offers benefits, the potential for deskilling and over-reliance must be addressed.\n",
    "chinese_title": "人工智能正在取代创造它的人",
    "chinese_summary": "人工智能对计算机编程领域构成重大挑战：从“氛围编码”到技能衰退"
  },
  {
    "id": "44149238",
    "title": "Why DeepSeek is cheap at scale but expensive to run locally",
    "url": "https://www.seangoedecke.com/inference-batching-and-deepseek/",
    "summary": "This article explains why models like DeepSeek-V3 are cheap and fast at scale, but slow and expensive to run locally, focusing on the throughput vs. latency tradeoff in AI inference. The key is batching: GPUs excel at large matrix multiplications (GEMMs), and processing multiple user requests concurrently in a batch is almost as fast as processing a single one.\n\nInference providers use a \"collection window\" to queue requests and then batch them before sending them to the GPU for processing. Larger batch sizes increase throughput because they utilize the GPU's capabilities more efficiently, reducing the overhead of issuing multiple commands and fetching weights. However, they also increase latency as users wait for the batch to fill.\n\nModels like DeepSeek-V3, which employ mixture-of-experts (MoE) architectures with many layers, are GPU-inefficient if not batched properly. The multiple expert blocks require numerous smaller matrix multiplications, slowing down inference. Large pipelines, with many transformer layers spread across multiple GPUs, also require larger batches to avoid \"pipeline bubbles,\" where GPUs are idle due to a lack of tokens to process.\n\nThe article also explores why providers can't just keep the GPU queue full, citing the complexities of batching the attention step, which requires sequences to have the same number of prior tokens. Ultimately, high-batching models like DeepSeek require a high volume of concurrent user traffic to achieve optimal efficiency, making them less suitable for personal use. OpenAI/Anthropic models respond quickly due to more efficient architectures, clever inference tricks, or sheer over-provisioning of GPUs.\n",
    "chinese_title": "DeepSeek 大规模便宜，本地运行贵的原因",
    "chinese_summary": "本文解释了为什么像DeepSeek-V3这样的模型在规模化时既便宜又快速，但在本地运行时却缓慢且昂贵，重点关注AI推理中的吞吐量与延迟之间的权衡。关键在于批处理：GPU擅长大型矩阵乘法（GEMM），并且并发处理批量用户请求几乎与处理单个请求一样快。\n\n推理提供商使用“收集窗口”来排队请求，然后在将它们发送到GPU进行处理之前进行批处理。更大的批次大小可以提高吞吐量，因为它们更有效地利用了GPU的功能，减少了发出多个命令和获取权重的开销。但是，它们也会增加延迟，因为用户需要等待批次填满。\n\n像DeepSeek-V3这样采用具有多层专家混合（MoE）架构的模型，如果未正确进行批处理，则GPU效率低下。多个专家块需要大量的较小矩阵乘法，从而减慢推理速度。包含许多跨多个GPU分布的Transformer层的大型管道也需要更大的批次，以避免“管道气泡”，即由于缺少要处理的令牌而导致GPU处于空闲状态。\n\n本文还探讨了为什么提供商不能仅仅保持GPU队列满载，并列举了批处理注意力机制步骤的复杂性，该步骤要求序列具有相同数量的先前令牌。最终，像DeepSeek这样需要高批处理的模型需要大量的并发用户流量才能实现最佳效率，因此不太适合个人使用。OpenAI/Anthropic模型响应速度快，这归功于更高效的架构、巧妙的推理技巧或纯粹的GPU过度配置。"
  },
  {
    "id": "44148524",
    "title": "RenderFormer: Neural rendering of triangle meshes with global illumination",
    "url": "https://microsoft.github.io/renderformer/",
    "summary": "RenderFormer is a novel neural rendering pipeline that uses transformers to directly render images from triangle mesh representations of 3D scenes, achieving global illumination effects without per-scene training or fine-tuning. Unlike traditional physics-based rendering methods, RenderFormer frames rendering as a sequence-to-sequence transformation. It converts a sequence of tokens representing triangles and their reflectance properties into a sequence of output tokens representing pixel patches.\n\nThe architecture consists of two main stages, both utilizing transformers. The first is a view-independent stage that models light transport between triangles. The second is a view-dependent stage that transforms rays into pixel values, guided by the information from the first stage. This process bypasses traditional rendering techniques like rasterization or ray tracing.\n\nThe paper showcases RenderFormer's ability to render scenes with diverse lighting conditions, materials, and geometric complexity. Examples include the Cornell Box, Stanford Bunny, Lucy Statue, and other complex scenes, rendered without specific training for each scene. Furthermore, the paper demonstrates RenderFormer's capabilities in rendering animations and physically-based simulations, highlighting its versatility. The method renders animations of rigid objects and simulations, showing complex object dynamics and interactions.\n",
    "chinese_title": "RenderFormer: Neural rendering of triangle meshes with global illumination",
    "chinese_summary": "RenderFormer is a novel neural rendering pipeline that uses transformers to directly render images from triangle mesh representations of 3D scenes, achieving global illumination effects without per-scene training or fine-tuning. Unlike traditional physics-based rendering methods, RenderFormer frames rendering as a sequence-to-sequence transformation. It converts a sequence of tokens representing triangles and their reflectance properties into a sequence of output tokens representing pixel patches.\n\nThe architecture consists of two main stages, both utilizing transformers. The first is a view-independent stage that models light transport between triangles. The second is a view-dependent stage that transforms rays into pixel values, guided by the information from the first stage. This process bypasses traditional rendering techniques like rasterization or ray tracing.\n\nThe paper showcases RenderFormer's ability to render scenes with diverse lighting conditions, materials, and geometric complexity. Examples include the Cornell Box, Stanford Bunny, Lucy Statue, and other complex scenes, rendered without specific training for each scene. Furthermore, the paper demonstrates RenderFormer's capabilities in rendering animations and physically-based simulations, highlighting its versatility. The method renders animations of rigid objects and simulations, showing complex object dynamics and interactions.\n"
  },
  {
    "id": "44149036",
    "title": "A Beautiful Technique for Some XOR Related Problems",
    "url": "https://codeforces.com/blog/entry/68953",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "一些异或相关问题的巧妙技巧",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "44151086",
    "title": "Learning from the Amiga API/ABI",
    "url": "https://asm-basic-coder.neocities.org/rants/amigaapilearn",
    "summary": "This article is a passionate defense and explanation of the Amiga's unique API/ABI, arguing for its superiority over modern operating systems. The author highlights the Amiga's direct calling into shared libraries through a table of branch instructions, emphasizing its CPU-agnostic nature and compatibility with memory protection techniques.\n\nA key aspect of the Amiga OS is the microkernel, Exec.library, responsible for memory management, task management, list management, and library loading. Exec's simplicity and success as a microkernel are lauded.\n\nThe article discusses AmigaDOS and its evolution, noting the initial BCPL influence and the eventual replacement by ARP.library, which offered a more C-friendly API. This dynamic replacement highlights the OS's adaptability due to its library-centric design.\n\nIntuition, the Amiga's windowing system, is praised for its ability to deliver messages to applications through callbacks, allowing programs to remain responsive even if the primary task is temporarily unresponsive. This asynchronous event handling is contrasted with modern systems where event handling is typically synchronous within the main program loop, potentially leading to unresponsive applications. The author emphasizes the overall elegance and ease of programming of the Amiga OS compared to its modern counterparts.\n",
    "chinese_title": "从Amiga API/ABI中学习",
    "chinese_summary": "本文热情地辩护和解释了Amiga独特的API/ABI，并论证了其优于现代操作系统。作者强调了Amiga通过分支指令表直接调用共享库的方式，突出了其CPU无关性以及与内存保护技术的兼容性。\n\nAmiga OS的一个关键方面是微内核Exec.library，它负责内存管理、任务管理、列表管理和库加载。Exec的简洁性以及作为微内核的成功之处备受赞扬。\n\n本文讨论了AmigaDOS及其演变，指出了最初的BCPL影响以及最终被ARP.library取代的情况，后者提供了更友好的C语言API。这种动态替换凸显了操作系统因其以库为中心的设计而具有的适应性。\n\nIntuition，Amiga的窗口系统，因其能够通过回调向应用程序传递消息而备受赞扬，这使得程序即使在主要任务暂时无响应时也能保持响应。这种异步事件处理与现代系统形成对比，在现代系统中，事件处理通常在主程序循环中同步进行，可能导致应用程序无响应。作者强调了Amiga OS与现代操作系统相比，其整体的优雅性和易编程性。"
  },
  {
    "id": "44157621",
    "title": "'Humanity deserves better': Jony Ive, Laurene Powell Jobs on tech's next chapter",
    "url": "https://www.ft.com/content/7f0a45b0-a3cc-4e1c-be71-1b7b42958d4d",
    "summary": "This Financial Times article, titled \"'Humanity deserves better': Jony Ive and Laurene Powell Jobs on tech's next chapter,\" discusses the perspectives of Jony Ive and Laurene Powell Jobs on the future of technology. Unfortunately, the provided content is primarily a subscription pitch and does not reveal the substance of their views. We can infer that Ive and Jobs are likely critical of the current state of technology and have ideas about how it can be improved, hence the title's implication that \"humanity deserves better.\" The article likely explores their vision for a more beneficial and ethical technological landscape. The publication is gated behind a paywall, encouraging readers to subscribe to access the full article and learn about Ive and Jobs' proposed solutions and perspectives. The call to action is to subscribe to either FT Edit, Standard Digital, or Premium Digital plans to unlock the article and gain access to other Financial Times content.\n",
    "chinese_title": "“人类值得更好的”：乔尼·艾维、劳伦·鲍威尔·乔布斯谈科技的未来",
    "chinese_summary": "金融时报文章《“人类值得拥有更好的科技”：Jony Ive和Laurene Powell Jobs论科技的未来》讨论了Jony Ive和Laurene Powell Jobs对科技未来的看法。 遗憾的是，提供的内容主要是一个订阅推销，没有透露他们观点的实质。 我们可以推断，Ive和Jobs可能对当前的技术状况持批评态度，并对如何改进它有自己的想法，因此标题暗示“人类值得拥有更好的科技”。 这篇文章可能探讨了他们对更有益和更合乎道德的科技前景的愿景。 该出版物设置了付费墙，鼓励读者订阅以访问完整文章并了解Ive和Jobs提出的解决方案和观点。 行动号召是订阅FT Edit、Standard Digital或Premium Digital计划，以解锁文章并访问其他金融时报内容。"
  },
  {
    "id": "44155391",
    "title": "How can AI researchers save energy? By going backward",
    "url": "https://www.quantamagazine.org/how-can-ai-researchers-save-energy-by-going-backward-20250530/",
    "summary": "This article explores how reversible computing, a decades-old theoretical approach, could be key to significantly reducing energy consumption in AI and other computing applications. The core idea is that unlike conventional computers that delete data and release energy as heat (as described by Landauer's principle), reversible computers can run calculations forward and then backward (\"uncomputation\"), effectively not deleting data and minimizing energy waste.\n\nWhile initially deemed impractical due to the increased memory and time requirements, researchers like Charles Bennett refined the concept. Current developments, especially Hannah Earley's work quantifying the heat/speed relationship in reversible computing, show promise for AI applications. Running reversible chips slower, but in parallel, can save significant energy, potentially reducing the need for extensive cooling.\n\nThe article highlights Michael Frank's long-standing advocacy for reversible computing and the recent resurgence of interest driven by the physical limitations facing conventional chip scaling. With investors taking note, Earley and Frank have co-founded Vaire Computing to develop a commercial reversible chip. This suggests that after years of theoretical research, reversible computing may soon become a practical reality, offering a path towards more energy-efficient computation, particularly in the power-hungry field of artificial intelligence.\n",
    "chinese_title": "AI研究者如何节能？通过倒退。",
    "chinese_summary": "可逆计算：降低人工智能能耗的关键？\n\n本文探讨了数十年前的可逆计算理论如何成为显著降低人工智能和其他计算应用能耗的关键。其核心思想是，与删除数据并以热能形式释放能量的传统计算机（如Landauer原理所述）不同，可逆计算机可以正向运行计算，然后反向运行（“反计算”），从而有效地不删除数据，最大程度地减少能量浪费。\n\n虽然最初由于内存和时间需求增加而被认为不切实际，但查尔斯·贝内特等研究人员改进了这一概念。目前的进展，特别是汉娜·厄尔利量化可逆计算中热/速度关系的工作，显示出在人工智能应用方面的潜力。以较慢的速度并行运行可逆芯片可以节省大量能源，从而可能减少对大量冷却的需求。\n\n本文重点介绍了迈克尔·弗兰克长期以来对可逆计算的倡导，以及由于传统芯片缩放面临的物理限制而重新引起的兴趣。随着投资者的关注，厄尔利和弗兰克共同创立了Vaire Computing，以开发商业可逆芯片。这表明，经过多年的理论研究，可逆计算可能很快成为一种现实，为更节能的计算提供了一条道路，尤其是在耗能巨大的人工智能领域。"
  }
]