[
  {
    "id": "45963780",
    "title": "Cloudflare Global Network experiencing issues",
    "url": "https://www.cloudflarestatus.com/?t=1",
    "summary": "On November 18, 2025, the Cloudflare Global Network experienced issues causing errors and latency. Cloudflare is actively working to mitigate the impact and restore services to normal levels.\n\nThe incident started around 11:48 UTC, with initial reports of internal service degradation impacting some services intermittently. A fix was implemented around 14:42 UTC, and while dashboard services were restored, work continued to remediate broad application services impact.\n\nThroughout the day, Cloudflare posted numerous updates indicating ongoing efforts to improve the situation, including deploying fixes, monitoring for further issues, and accelerating full recovery. Bot scores were also temporarily impacted during the recovery process. Specifically, WARP access in London was temporarily disabled and then re-enabled as part of the remediation.\n\nAs of the last update, errors and latency are returning to normal levels, and Cloudflare is monitoring the system through recovery. A full post-incident investigation and details will be made available as soon as possible.\n\nScheduled maintenance was also in progress on November 18, 2025, in the SYD (Sydney) and ATL (Atlanta) datacenters, potentially causing slight latency increases for end-users in those regions.\n\nSeveral Cloudflare services experienced Degraded Performance during the incident, including Bot Management, CDN/Cache, Dashboard, Firewall, and Network, and Workers. Partial Outages were also reported in various geographical locations across Africa, Asia, and Europe.\n",
    "chinese_title": "Cloudflare全球网络出现问题",
    "chinese_summary": "2025年11月18日，Cloudflare全球网络出现问题，导致错误和延迟。 Cloudflare正在积极努力减轻影响，并将服务恢复到正常水平。\n\n事件始于UTC时间11:48左右，最初的报告显示内部服务降级间歇性地影响了一些服务。 一个修复方案于UTC时间14:42左右实施，虽然仪表板服务已恢复，但修复广泛应用服务影响的工作仍在继续。\n\n当天，Cloudflare发布了大量更新，表明正在不断努力改善情况，包括部署修复程序、监测其他问题以及加速全面恢复。 在恢复过程中，机器人评分也受到了暂时影响。 具体而言，作为补救措施的一部分，伦敦的WARP访问被暂时禁用然后重新启用。\n\n截至最新更新，错误和延迟正在恢复到正常水平，Cloudflare正在监控系统恢复情况。 一旦可以，将尽快提供完整的事故后调查和详细信息。\n\n2025年11月18日，SYD（悉尼）和ATL（亚特兰大）数据中心也在进行计划维护，这可能会导致这些地区的最终用户略微增加延迟。\n\n在事件期间，多个Cloudflare服务经历了性能下降，包括机器人管理、CDN/缓存、仪表板、防火墙、网络和Workers。 非洲、亚洲和欧洲的各个地理位置也报告了部分中断。"
  },
  {
    "id": "45967211",
    "title": "Gemini 3 Pro Preview Live in AI Studio",
    "url": "https://aistudio.google.com/prompts/new_chat?model=gemini-3-pro-preview",
    "summary": "The provided text announces that a preview of Gemini 3 Pro is available live in AI Studio. It also gives login instructions, advising users to use their Google account. If the user isn't on their personal computer, they are advised to use Guest Mode or Incognito Mode for security. Finally, it provides a link to learn more about Guest Mode and suggests creating a Google account if the user doesn't have one.\n\nIn essence, the text is a sign-in prompt for accessing Gemini 3 Pro within AI Studio, emphasizing security and account access.\n",
    "chinese_title": "AI Studio 中的 Gemini 3 Pro 预览版现已上线",
    "chinese_summary": "Gemini 3 Pro 预览版已在 AI Studio 上线。请使用您的 Google 账号登录。如果您使用的不是个人电脑，建议使用访客模式或无痕模式以确保安全。点击此处了解更多关于访客模式的信息。如果您没有 Google 账号，请创建一个。"
  },
  {
    "id": "45968043",
    "title": "Gemini 3 for developers: New reasoning, agentic capabilities",
    "url": "https://blog.google/technology/developers/gemini-3-developers/",
    "summary": "Gemini 3 Pro, Google's most intelligent model, is now available for developers. It surpasses previous versions in AI benchmarks and excels in coding tasks, particularly agentic workflows. It is accessible through the Gemini API in Google AI Studio and Vertex AI, and also via the new Google Antigravity platform for agentic development.\n\nKey features and capabilities include:\n\n*   **Agentic Coding:** Gemini 3 Pro achieves a high score on Terminal-Bench 2.0, showcasing its tool-use ability to operate a computer. It's integrated into platforms like Google Antigravity, Gemini CLI, and other coding tools.\n*   **Google Antigravity:** A new agentic development platform allowing developers to manage agents across workspaces for faster development, UI iteration, bug fixing, and report generation.\n*   **Gemini API:** A client-side bash tool for shell command suggestions and a hosted server-side bash tool for multi-language code generation. Grounding with Google Search and URL context can be combined with structured outputs.\n*   **Vibe Coding:** Turns natural language into fully interactive apps with a single prompt. Gemini 3 Pro excels on the WebDev Arena leaderboard.\n*   **Multimodal Understanding:** Strong performance in complex image and video reasoning. API allows configurable vision processing for cost and latency control.\n*   **Visual and Spatial Reasoning:** Handles complex document understanding, powers embodied reasoning tasks, and improves screen understanding for computer-use agents.\n*   **Video Reasoning:** Captures rapid action and uses long-context recall for synthesizing narratives.\n\nDevelopers can build with the Gemini API, experience agentic capabilities through various platforms, and \"vibe code\" using Google AI Studio. Google encourages developers to explore the new possibilities Gemini 3 Pro offers and to push the boundaries of AI-powered app development.\n",
    "chinese_title": "为开发者提供的 Gemini 3：新增推理能力和自主代理能力",
    "chinese_summary": "Gemini 3 Pro：谷歌最智能模型现已面向开发者开放。 它在AI基准测试中超越以往版本，并在编码任务（尤其是Agentic工作流）中表现出色。 可通过Google AI Studio和Vertex AI中的Gemini API访问，也可通过新的Google Antigravity平台进行Agentic开发。\n\n主要特性和功能包括：\n\n*   **Agentic编码：** Gemini 3 Pro在Terminal-Bench 2.0上取得了高分，展示了其操作计算机的工具使用能力。 它已集成到Google Antigravity、Gemini CLI和其他编码工具等平台中。\n*   **Google Antigravity：** 一种新的Agentic开发平台，允许开发者跨工作区管理Agent，从而加快开发速度、UI迭代、错误修复和报告生成。\n*   **Gemini API：** 一种用于 shell 命令建议的客户端 bash 工具，以及一种用于多语言代码生成的托管服务器端 bash 工具。 可将 Google 搜索和 URL 上下文与结构化输出相结合。\n*   **Vibe 编码：** 通过单个提示将自然语言转化为完全交互式的应用程序。 Gemini 3 Pro 在 WebDev Arena 排行榜上表现出色。\n*   **多模态理解：** 在复杂的图像和视频推理方面表现出色。 API 允许配置视觉处理以控制成本和延迟。\n*   **视觉和空间推理：** 处理复杂的文档理解，支持具身推理任务，并提高计算机使用Agent的屏幕理解能力。\n*   **视频推理：** 捕捉快速动作并使用长上下文回忆来合成叙述。\n\n开发者可以使用 Gemini API 进行构建，通过各种平台体验 Agentic 功能，并使用 Google AI Studio 进行“Vibe 编码”。 谷歌鼓励开发者探索 Gemini 3 Pro 提供的全新可能性，并突破 AI 驱动的应用程序开发的界限。"
  },
  {
    "id": "45968235",
    "title": "A Day at Hetzner Online in the Falkenstein Data Center",
    "url": "https://www.igorslab.de/en/a-day-at-hetzner-online-in-the-falkenstein-data-center-insights-into-server-technology-cooling-production-rma-and-sustainability/",
    "summary": "This article details a visit to Hetzner Online's extensive data center in Falkenstein, Germany. The author emphasizes the site's impressive scale, industrial precision, and logistical sophistication, likening it to a small industrial area.\n\nThe tour highlights the data center's structured layout, starting with the colocation area where customers manage their own hardware. It then progresses to the midi data centers, noted for their practicality, energy efficiency, and focus on smooth processes. A significant portion of the site is dedicated to in-house server production, prioritizing robust construction and standardized testing procedures, including rigorous hard disk and SSD testing.\n\nThe author also details the rack and open frame system production, emphasizing Hetzner's reliance on functional design and regional suppliers. The decommissioning area demonstrates a meticulous hardware lifecycle process, involving documentation and certified shredding of discarded devices for data security and responsible disposal.\n\nThe article underscores the technical foundation of the data center, including redundant energy supply, sophisticated network connectivity, and free cooling utilizing the Vogtland region's climate, resulting in low PUE values and a stable thermal environment. The author concludes by noting the sheer size of the facility and its impressive organization of production, service, operation, and security.\n",
    "chinese_title": "在法尔肯斯坦数据中心Hetzner Online的一日",
    "chinese_summary": "本文详细介绍了对德国福尔肯斯坦因Hetzner Online大型数据中心的参观。作者强调了该站点令人印象深刻的规模、工业精度和物流复杂性，将其比作一个小型工业区。\n\n参观过程重点介绍了数据中心的结构化布局，首先是客户管理自己硬件的托管区域。然后是中型数据中心，以其务实性、能源效率和对流程流畅性的关注而著称。该站点的大部分区域专门用于内部服务器生产，优先考虑坚固的结构和标准化的测试程序，包括严格的硬盘和固态硬盘测试。\n\n作者还详细介绍了机架和开放式框架系统的生产，强调了Hetzner对功能设计和区域供应商的依赖。退役区域展示了细致的硬件生命周期流程，包括文档记录和废弃设备的认证粉碎，以确保数据安全和负责任的处置。\n\n本文强调了数据中心的技术基础，包括冗余的能源供应、复杂的网络连接，以及利用沃格兰地区气候的免费冷却，从而实现了较低的PUE值和稳定的热环境。作者最后指出该设施的巨大规模以及其在生产、服务、运营和安全方面的令人印象深刻的组织。"
  },
  {
    "id": "45968104",
    "title": "5 Things to Try with Gemini 3 Pro in Gemini CLI",
    "url": "https://developers.googleblog.com/en/5-things-to-try-with-gemini-3-pro-in-gemini-cli/",
    "summary": "This Google Developers Blog post highlights the integration of Gemini 3 Pro into the Gemini CLI, emphasizing its ability to enhance developer productivity in the terminal. Gemini 3 Pro is touted for its superior reasoning, agentic coding capabilities, and advanced tool usage, enabling streamlined workflows.\n\nThe article presents five practical examples of how developers can leverage Gemini 3 Pro in the Gemini CLI:\n\n1.  **Agentic Coding for Building in the Terminal:** Gemini 3 Pro can synthesize diverse information to create functional starting points from rough concepts, exemplified by generating a ready-to-deploy app with 3D graphics.\n2.  **Visual-to-Code Conversion:** By analyzing images of UI sketches, Gemini 3 Pro can generate corresponding HTML, CSS, and JavaScript code.\n3.  **Natural Language Shell Commands:** Gemini 3 Pro can translate natural language into complex shell commands, simplifying tasks like Git Bisect.\n4.  **Automated Documentation Generation:** Gemini 3 Pro can analyze code logic and generate accurate, human-readable documentation.\n5.  **Debugging Performance Issues:** Gemini 3 Pro can orchestrate complex workflows across services like Cloud Run and Snyk to identify and resolve issues, offering code fixes.\n\nThe article encourages developers to upgrade their Gemini CLI version and enable preview features to access Gemini 3 Pro. It concludes by inviting users to explore its potential and share their experiences.\n",
    "chinese_title": "Gemini CLI 中使用 Gemini 3 Pro 的 5 件事",
    "chinese_summary": "此篇 Google 开发者博客文章重点介绍了 Gemini 3 Pro 与 Gemini CLI 的集成，强调其在终端中增强开发者生产力的能力。Gemini 3 Pro 因其卓越的推理、代理式编码能力和高级工具使用而被称赞，从而能够简化工作流程。\n\n文章展示了开发者如何在 Gemini CLI 中利用 Gemini 3 Pro 的五个实用示例：\n\n1.  **在终端中构建的代理式编码：** Gemini 3 Pro 可以综合各种信息，从粗略的概念创建功能性起点，例如生成一个可以随时部署的 3D 图形应用程序。\n2.  **视觉到代码的转换：** 通过分析 UI 草图的图像，Gemini 3 Pro 可以生成相应的 HTML、CSS 和 JavaScript 代码。\n3.  **自然语言 Shell 命令：** Gemini 3 Pro 可以将自然语言翻译成复杂的 shell 命令，从而简化诸如 Git Bisect 之类的任务。\n4.  **自动化文档生成：** Gemini 3 Pro 可以分析代码逻辑并生成准确、易于理解的文档。\n5.  **调试性能问题：** Gemini 3 Pro 可以协调跨 Cloud Run 和 Snyk 等服务的复杂工作流程，以识别和解决问题，并提供代码修复。\n\n文章鼓励开发者升级其 Gemini CLI 版本并启用预览功能以访问 Gemini 3 Pro。最后，它邀请用户探索其潜力并分享他们的经验。"
  },
  {
    "id": "45967999",
    "title": "Gemini 3",
    "url": "https://blog.google/products/gemini/gemini-3/",
    "summary": "Gemini 3, Google's most intelligent AI model, is being released, promising enhanced reasoning, multimodality, and agentic capabilities. It surpasses previous models in AI benchmarks, demonstrating advancements in complex problem-solving, coding, and understanding nuances across various topics.\n\nGemini 3 Pro is currently available in the Gemini app, AI Studio, Vertex AI, and, for the first time, in AI Mode in Search. A more advanced \"Deep Think\" mode, designed for even more complex problems, will be available soon for Google AI Ultra subscribers after further safety evaluations.\n\nThe new model boasts state-of-the-art reasoning and improved contextual understanding, enabling users to learn, build, and plan with greater efficiency. For example, Gemini 3 can help you translate recipes, analyze videos, or write code. This is exemplified through its capabilities in areas such as interactive learning and better agentic coding.\n\nGoogle is also introducing Google Antigravity, an agentic development platform that transforms AI assistance into an active partner for developers, with access to the editor, terminal, and browser. It is also paired with models that can control browsers and perform image editing.\n\nGemini 3 is designed to be more secure and has undergone extensive safety evaluations, with a focus on reducing biases and improving protection against misuse.\n\nThe release of Gemini 3 marks a significant step towards AGI. Additional models within the Gemini 3 series are planned for release in the near future, offering users even more capabilities.\n",
    "chinese_title": "双子星3号",
    "chinese_summary": "谷歌最智能AI模型Gemini 3发布，有望增强推理、多模态和自主能力。它在AI基准测试中超越了以往的模型，展示了在复杂问题解决、编码和理解各种主题的细微差别方面的进步。\n\nGemini 3 Pro目前已在Gemini应用、AI Studio、Vertex AI以及首次在搜索中的AI模式下提供。一种更高级的“深度思考”模式，专为更复杂的问题而设计，将在进一步安全评估后不久提供给Google AI Ultra订阅用户。\n\n该新模型拥有最先进的推理能力和改进的上下文理解能力，使用户能够更高效地学习、构建和规划。例如，Gemini 3可以帮助您翻译食谱、分析视频或编写代码。这体现在其在交互式学习和更好的自主编码等领域的能力中。\n\n谷歌还推出了Google Antigravity，这是一个自主开发平台，将AI助手转变为开发人员的积极合作伙伴，可以访问编辑器、终端和浏览器。它还与可以控制浏览器和执行图像编辑的模型配对。\n\nGemini 3的设计更加安全，并经过了广泛的安全评估，重点是减少偏见和提高防止滥用的保护。\n\nGemini 3的发布标志着迈向AGI的重要一步。Gemini 3系列中的其他模型计划在不久的将来发布，为用户提供更多的功能。"
  },
  {
    "id": "45968065",
    "title": "Google Antigravity, a New Era in AI-Assisted Software Development",
    "url": "https://antigravity.google/blog/introducing-google-antigravity",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "谷歌反重力：人工智能辅助软件开发的新纪元",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "45968611",
    "title": "Strix Halo's Memory Subsystem: Tackling iGPU Challenges",
    "url": "https://chipsandcheese.com/p/strix-halos-memory-subsystem-tackling",
    "summary": "This article delves into the memory subsystem of AMD's Strix Halo APU, focusing on the challenges of balancing CPU and integrated GPU (iGPU) demands in a mobile environment. The Strix Halo features a 32MB Infinity Cache for the iGPU, similar to the RX 7600's architecture, to alleviate bandwidth pressure on the main memory. While the Infinity Cache helps, its latency is slightly higher than discrete GPU implementations. The article notes that the behavior of the Infinity Cache is dynamically controlled by software, potentially tuned via driver updates.\n\nThe CPU side of Strix Halo features 16 Zen 5 cores across two CCDs, connected via TSMC's InFO_oS packaging. While the CCDs have more write bandwidth at the die boundary compared to desktop counterparts, the impact is minimal due to the read-heavy nature of most workloads. Cross-CCX latencies are surprisingly higher than desktop systems, potentially negating any advantages from advanced packaging.\n\nThe article highlights the challenge of shared memory between the CPU and iGPU, leading to potential contention and increased CPU latency under heavy GPU load. Microbenchmarks demonstrate that increased GPU bandwidth demands significantly impact CPU memory latency. Performance monitoring unit (PMU) data reinforces the importance of high CPU cache hitrates on Strix Halo due to potential bandwidth limitations. While CPU-only workloads show minimal impact on latency, gaming with the iGPU reveals a substantial increase.\n\nUltimately, the Strix Halo's memory subsystem faces unique challenges in balancing the performance requirements of both CPU and iGPU within a mobile power envelope.\n",
    "chinese_title": "Strix Halo的内存子系统：应对iGPU挑战",
    "chinese_summary": "AMD Strix Halo APU内存子系统探究：移动环境下的CPU与iGPU性能平衡\n\n本文深入探讨了AMD Strix Halo APU的内存子系统，重点关注移动环境下平衡CPU和集成GPU (iGPU) 需求的挑战。 Strix Halo为iGPU配备了32MB的Infinity Cache，类似于RX 7600的架构，以缓解主内存的带宽压力。 虽然Infinity Cache有所帮助，但其延迟略高于独立GPU的实现。 文章指出，Infinity Cache的行为由软件动态控制，可能通过驱动程序更新进行调整。\n\nStrix Halo的CPU端采用16个Zen 5核心，分布在两个CCD上，通过台积电的InFO_oS封装连接。 虽然与桌面级产品相比，CCD在芯片边界具有更高的写入带宽，但由于大多数工作负载的读取密集型特性，其影响微乎其微。 跨CCX延迟比桌面系统高得令人惊讶，这可能会抵消先进封装带来的任何优势。\n\n文章强调了CPU和iGPU之间共享内存的挑战，导致潜在的争用和在GPU重负载下CPU延迟的增加。 微基准测试表明，增加的GPU带宽需求会显著影响CPU内存延迟。 性能监控单元 (PMU) 数据强化了Strix Halo上高CPU缓存命中率的重要性，原因是潜在的带宽限制。 虽然仅CPU工作负载显示对延迟的影响最小，但使用iGPU进行游戏会显示出显著的增加。\n\n最终，Strix Halo的内存子系统在移动功耗范围内平衡CPU和iGPU的性能需求方面面临着独特的挑战。"
  },
  {
    "id": "45966251",
    "title": "Nearly all UK drivers say headlights are too bright",
    "url": "https://www.bbc.com/news/articles/c1j8ewy1p86o",
    "summary": "A recent study commissioned by the UK's Department for Transport (DfT) reveals that the vast majority of UK drivers (97%) are regularly or sometimes distracted by the brightness of oncoming headlights, with 96% believing some or most headlights are too bright. The Transport Research Laboratory (TRL) study, involving 1,850 drivers, provides \"compelling evidence\" that headlight glare is a significant issue, potentially linked to LED and whiter headlamps that emit more blue light, which can be difficult for human eyes to process at night.\n\nThe research indicates that this glare is impacting driver behavior, with 33% reporting they have reduced or stopped driving at night, and another 22% wishing to drive less at night but unable to do so. The government plans to include new measures in its upcoming Road Safety Strategy to address these concerns.\n\nStakeholders, including the RAC and The College of Optometrists, welcome the findings and urge the DfT to take action. The RAC emphasizes the need to balance high-performing headlights with the potential for glare, while The College of Optometrists calls for immediate steps and more detailed research into potential changes to headlight regulations.\n",
    "chinese_title": "几乎所有英国司机都认为车头灯太亮。",
    "chinese_summary": "英国交通部委托的最新研究显示，绝大多数英国司机（97%）经常或有时会因对面来车前灯的亮度而分心，96%的人认为部分或大多数前灯过于明亮。运输研究实验室（TRL）对1850名司机进行的研究提供了“令人信服的证据”，表明前灯眩光是一个重要问题，可能与LED和更白的头灯有关，这些头灯会发出更多的蓝光，而人眼在夜间很难处理这些蓝光。\n\n该研究表明，这种眩光正在影响驾驶员的行为，33%的人表示他们已经减少或停止夜间驾驶，另有22%的人希望减少夜间驾驶但无法做到。政府计划在其即将发布的道路安全战略中纳入新措施，以解决这些担忧。\n\n包括英国皇家汽车俱乐部（RAC）和验光师学院在内的利益相关者对调查结果表示欢迎，并敦促英国交通部采取行动。英国皇家汽车俱乐部强调，需要在高性能前灯和潜在的眩光之间取得平衡，而验光师学院则呼吁立即采取措施，并对前灯法规的潜在变化进行更详细的研究。"
  },
  {
    "id": "45968091",
    "title": "Google Brings Gemini 3 AI Model to Search and AI Mode",
    "url": "https://blog.google/products/search/gemini-3-search-ai-mode/",
    "summary": "On November 18, 2025, Google introduced Gemini 3, its most advanced AI model, directly into Google Search via the AI Mode. Gemini 3 boasts state-of-the-art reasoning, multimodal understanding, and agentic capabilities, enabling Search to grasp deeper nuances and deliver more relevant and credible results.\n\nThe integration enhances Search's query fan-out technique, allowing it to uncover more relevant web content by better understanding user intent. Furthermore, Google will enhance automatic model selection in Search with Gemini 3, intelligently routing complex queries to this advanced model while utilizing faster models for simpler tasks. This will initially be available to Google AI Pro and Ultra subscribers in the U.S.\n\nA key feature of Gemini 3 is its ability to generate bespoke user interfaces. By dynamically creating visual layouts, including interactive tools and simulations tailored to the user's query, it provides a more engaging and actionable experience. Examples include interactive simulations for understanding complex physics concepts or custom-built loan calculators for mortgage research.\n\nCurrently, Gemini 3 Pro is available to Google AI Pro and Ultra subscribers in the U.S. by selecting \"Thinking\" in AI Mode. Google plans to expand access to Gemini 3 in AI Mode to all users in the U.S. soon, with increased limits for premium subscribers. The article emphasizes Google's commitment to refining the experience and encourages user feedback on the interactive tools and simulations within Search.\n",
    "chinese_title": "谷歌将 Gemini 3 AI 模型引入搜索和 AI 模式",
    "chinese_summary": "2025年11月18日，谷歌将最先进的AI模型Gemini 3通过AI模式直接引入谷歌搜索。 Gemini 3拥有最先进的推理、多模态理解和代理能力，使搜索能够掌握更深层次的细微差别，并提供更相关、更可信的结果。\n\n此次集成增强了搜索的查询扇出技术，通过更好地理解用户意图，从而发现更多相关的网络内容。此外，谷歌将利用Gemini 3增强搜索中的自动模型选择，智能地将复杂查询路由到此高级模型，同时利用更快的模型处理更简单的任务。这项功能最初将向美国的Google AI Pro和Ultra订阅者开放。\n\nGemini 3的一项关键功能是其生成定制用户界面的能力。通过动态创建视觉布局，包括为用户查询量身定制的交互式工具和模拟，它提供了更具吸引力和可操作性的体验。例如，用于理解复杂物理概念的交互式模拟或用于抵押贷款研究的定制贷款计算器。\n\n目前，美国的Google AI Pro和Ultra订阅者可以通过在AI模式下选择“思考”来使用Gemini 3 Pro。 谷歌计划很快将AI模式下的Gemini 3的访问权限扩展到美国的所有用户，并为高级订阅者增加使用限制。文章强调了谷歌致力于改进体验，并鼓励用户对搜索中的交互式工具和模拟提供反馈。"
  },
  {
    "id": "45968362",
    "title": "Solving a Million-Step LLM Task with Zero Errors",
    "url": "https://arxiv.org/abs/2511.09030",
    "summary": "This arXiv paper, submitted in November 2025, presents \"MAKER,\" a novel system that successfully solves a task requiring over one million LLM steps with zero errors. The authors (Elliot Meyerson et al.) address the limitation of current LLMs, which struggle with long-range tasks due to persistent error rates, citing the Towers of Hanoi benchmark as an example where performance degrades after a few hundred steps.\n\nMAKER achieves this breakthrough by employing a strategy of *extreme task decomposition*, breaking the overall problem into numerous small, focused subtasks handled by individual \"microagents.\" This modularity enables efficient error correction at each step through a multi-agent voting scheme. The authors argue that this combination of extreme decomposition and error correction is key to scaling LLM-based processes.\n\nThe paper suggests that instead of solely focusing on improving the inherent capabilities of individual LLMs, a more effective approach to solving complex, large-scale problems (akin to those faced by organizations and societies) lies in developing *massively decomposed agentic processes (MDAPs)* like MAKER. The paper is 14 pages long (29 with references and appendix) and is categorized under Artificial Intelligence, Computation and Language, and Multiagent Systems.\n",
    "chinese_title": "以零错误解决百万步大型语言模型任务",
    "chinese_summary": "这篇2025年11月提交的 arXiv 论文介绍了“MAKER”，一种新型系统，它成功地解决了需要超过一百万个 LLM 步骤且零错误的任务。作者（Elliot Meyerson 等）指出当前 LLM 的局限性，即由于持续的错误率，它们难以处理长程任务，并以汉诺塔基准测试为例，说明性能在几百步后会下降。\n\nMAKER 通过采用*极端任务分解*策略实现了这一突破，将整个问题分解为众多由各个“微代理”处理的小型、专注的子任务。这种模块化设计使得可以通过多代理投票方案在每个步骤进行高效的错误纠正。作者认为，极端分解和错误纠正的结合是扩展基于 LLM 的流程的关键。\n\n该论文表明，与其仅仅关注提高单个 LLM 的固有能力，不如开发像 MAKER 这样的*大规模分解的代理过程（MDAP）*，这是一种更有效的解决复杂、大规模问题（类似于组织和社会面临的问题）的方法。该论文共14页（包含参考文献和附录共29页），被归类为人工智能、计算与语言以及多智能体系统。"
  },
  {
    "id": "45966435",
    "title": "Short Little Difficult Books",
    "url": "https://countercraft.substack.com/p/short-little-difficult-books",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "短小难读的书",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "45962654",
    "title": "How Quake.exe got its TCP/IP stack",
    "url": "https://fabiensanglard.net/quake_chunnel/index.html",
    "summary": "This article delves into the technical ingenuity behind how Quake, released in 1996, achieved cross-platform compatibility between DOS and Windows 95, particularly focusing on its TCP/IP networking capabilities.\n\nInitially, id Software used the DJGPP compiler, a GCC port, to create a single executable, `quake.exe`, compatible with both operating systems. This was accomplished by leveraging DJGPP's DPMI client, which could run on both DOS and Windows 95 DPMI servers, effectively bridging the gap between the two environments.\n\nFor multiplayer, DOS Quake primarily relied on IPX, requiring a DOS TSR. TCP/IP was difficult due to the lack of a built-in stack in DOS, and required a costly TSR.\n\nWindows 95 presented a different challenge and opportunity. While `quake.exe` could run in a DOS-box, a third method, using `q95.bat`, unlocked the Windows 95 TCP/IP stack. This was achieved through Mpath Interactive's \"Chunnel\" technology, which was licensed to id Software.\n\nThe \"Chunnel\" consisted of several components: `qlaunch.exe`, `quakeudp.dll`, `genvxd.dll`, and `mgenvxd.vxd`. `quakeudp.dll` acted as the bridge to Microsoft's TCP/UDP/IP stack (`wsock32.dll`). A virtual device driver, `GENVXD.VXD`, communicated with win32 via interrupt 0x48. Mpath provided code for BSD socket functions. This complex system allowed the DOS executable to use Windows 95's networking.\n\nThis complex setup became obsolete when id moved to win32-exclusive binaries like `winquake.exe`, directly accessing `wsock32.dll`.\n",
    "chinese_title": "Quake.exe 如何获得它的 TCP/IP 协议栈",
    "chinese_summary": "本文深入探讨了1996年发布的《雷神之锤》如何在DOS和Windows 95之间实现跨平台兼容的技术独创性，特别是关注其TCP/IP网络功能。\n\n最初，id Software使用DJGPP编译器（GCC的一个移植版本）创建了一个单一的可执行文件`quake.exe`，该文件与两种操作系统都兼容。这是通过利用DJGPP的DPMI客户端实现的，该客户端可以在DOS和Windows 95 DPMI服务器上运行，从而有效地弥合了这两个环境之间的差距。\n\n对于多人游戏，DOS版《雷神之锤》主要依赖于IPX，需要一个DOS TSR。TCP/IP由于DOS中缺少内置协议栈而难以实现，并且需要昂贵的TSR。\n\nWindows 95提出了不同的挑战和机遇。虽然`quake.exe`可以在DOS-box中运行，但通过使用`q95.bat`的第三种方法解锁了Windows 95的TCP/IP协议栈。这是通过Mpath Interactive的“Chunnel”技术实现的，id Software获得了该技术的许可。\n\n“Chunnel”由几个组件组成：`qlaunch.exe`、`quakeudp.dll`、`genvxd.dll`和`mgenvxd.vxd`。`quakeudp.dll`充当了连接到微软TCP/UDP/IP协议栈(`wsock32.dll`)的桥梁。一个虚拟设备驱动程序`GENVXD.VXD`通过中断0x48与win32通信。Mpath提供了BSD socket函数的代码。这个复杂的系统允许DOS可执行文件使用Windows 95的网络。\n\n当id转向win32独占二进制文件（如`winquake.exe`）并直接访问`wsock32.dll`时，这种复杂的设置就变得过时了。"
  },
  {
    "id": "45965060",
    "title": "Do Not Put Your Site Behind Cloudflare If You Don't Need To",
    "url": "https://huijzer.xyz/posts/123/do-not-put-your-site-behind-cloudflare-if-you-dont",
    "summary": "This article argues against using Cloudflare for websites that don't genuinely need it, highlighting the risks of relying on centralized services. The author points to a recent Cloudflare outage that brought down numerous sites, even small ones with low traffic, to illustrate this single point of failure.\n\nThey contend that many users adopt Cloudflare primarily out of fear of DDoS attacks, but argue that such attacks are unlikely to target small, insignificant sites. The author emphasizes the hypocrisy of advocating for a decentralized web while simultaneously relying on a centralized service like Cloudflare.\n\nThe article proposes a simpler, more decentralized alternative: setting up a second server at a different location and using round-robin DNS to distribute traffic. This approach provides redundancy in case one server goes down, without depending on a single point of failure like Cloudflare. The author encourages users to \"face their fears\" and host their sites directly on the internet, accepting the possibility of downtime rather than relying on potentially unreliable centralized services. In essence, the message is: avoid unnecessary complexity and centralization by only using Cloudflare if truly required.\n",
    "chinese_title": "不需要就不要把你的网站放在Cloudflare后面",
    "chinese_summary": "本文反对为那些并不真正需要的网站使用Cloudflare，强调了依赖中心化服务的风险。作者以最近一次Cloudflare宕机导致大量网站（包括流量很小的网站）瘫痪为例，说明了这种单点故障的弊端。\n\n他们认为，许多用户采用Cloudflare主要是出于对DDoS攻击的恐惧，但他们辩称，这种攻击不太可能针对小型、无关紧要的网站。作者强调了倡导去中心化网络，同时又依赖于像Cloudflare这样的中心化服务的虚伪性。\n\n文章提出了一种更简单、更去中心化的替代方案：在不同的位置设置第二个服务器，并使用轮询DNS来分配流量。这种方法在服务器宕机时提供冗余，而无需依赖像Cloudflare这样的单点故障。作者鼓励用户“直面恐惧”，直接将他们的网站托管在互联网上，接受宕机的可能性，而不是依赖于可能不可靠的中心化服务。本质上，信息是：避免不必要的复杂性和中心化，仅在真正需要时才使用Cloudflare。"
  },
  {
    "id": "45968461",
    "title": "Show HN: Optimizing LiteLLM with Rust – When Expectations Meet Reality",
    "url": "https://github.com/neul-labs/fast-litellm",
    "summary": "Fast LiteLLM is a Rust-based acceleration layer designed to significantly boost the performance of the LiteLLM library (a unified interface for interacting with various LLMs). It achieves this through optimized Rust implementations for key LiteLLM functionalities like token counting, request routing, rate limiting, and connection management, offering performance improvements ranging from 2x to 20x.\n\nThe package integrates seamlessly into existing LiteLLM projects with a simple `pip install` and import statement. Upon import, `fast_litellm` automatically monkey patches LiteLLM's performance-critical functions, replacing them with the Rust implementations. This requires zero configuration.\n\nThe architecture leverages PyO3 to create Python extensions from Rust code. Features include automatic fallback to Python in case of issues, built-in feature flags for safe deployments, performance monitoring, and support for gradual feature rollouts (canary deployments). The underlying data structures are thread-safe, using DashMap for concurrency.\n\nThe documentation highlights various guides and references for understanding the architecture, utilizing feature flags, and monitoring performance. Contribution guidelines are also provided for developers interested in contributing to the project. It is licensed under the MIT License.\n",
    "chinese_title": "Show HN: 用 Rust 优化 LiteLLM – 当期望遭遇现实",
    "chinese_summary": "Fast LiteLLM 是一个基于 Rust 的加速层，旨在显著提升 LiteLLM 库（一个用于与各种 LLM 交互的统一接口）的性能。它通过针对 LiteLLM 的关键功能（如 token 计数、请求路由、速率限制和连接管理）的优化 Rust 实现来实现这一点，性能提升范围从 2 倍到 20 倍不等。\n\n该软件包通过简单的 `pip install` 和 import 语句无缝集成到现有的 LiteLLM 项目中。导入后，`fast_litellm` 会自动 monkey patch LiteLLM 的性能关键函数，将其替换为 Rust 实现。这无需任何配置。\n\n该架构利用 PyO3 从 Rust 代码创建 Python 扩展。功能包括：在出现问题时自动回退到 Python、用于安全部署的内置功能标志、性能监控，以及对逐步功能发布（金丝雀部署）的支持。底层数据结构是线程安全的，使用 DashMap 实现并发。\n\n文档重点介绍了各种指南和参考资料，以帮助理解架构、利用功能标志和监控性能。还提供了贡献指南，供有兴趣为项目做出贡献的开发者使用。它采用 MIT 许可证。"
  },
  {
    "id": "45963583",
    "title": "The Miracle of Wörgl",
    "url": "https://scf.green/story-of-worgl-and-others/",
    "summary": "The article explores the positive impact of complementary currencies through historical examples, focusing on the \"Miracle of Wörgl\" and the medieval cathedral-building era.\n\nWörgl, Austria, during the Great Depression, successfully eliminated unemployment by introducing a local currency backed by deposited funds. This currency, known as \"stamp scrip,\" circulated rapidly, funding infrastructure projects, stimulating the local economy, and increasing tax revenue. Six neighboring villages replicated this success, attracting international attention. However, the Austrian central bank, fearing a loss of control, banned the currency, leading to economic hardship and social unrest.\n\nProfessor Irving Fisher, impressed by Wörgl, advocated for similar measures in the US to combat the Great Depression. While he found support in the FDR administration, President Roosevelt ultimately prohibited \"emergency currencies\" out of fear of decentralization.\n\nThe article then highlights the widespread prosperity in Western Europe during the Central Middle Ages, attributed to the use of local currencies to fund the construction of over 1,000 cathedrals. Communities printed their own money, hired workers, and stimulated local economies. The cathedrals, funded by citizens, became long-term revenue generators through tourism.\n\nThe article concludes by pointing to other examples of complementary currencies and their positive impacts, emphasizing that while prohibited in the past, they are now largely legal, as evidenced by the rise of cryptocurrencies. The overarching theme is that local currencies can stimulate economies, create jobs, and empower communities when properly implemented.\n",
    "chinese_title": "沃格尔的奇迹",
    "chinese_summary": "本文通过历史案例，探讨了互补货币的积极影响，重点关注“沃尔格奇迹”和中世纪大教堂建造时代。\n\n在大萧条时期，奥地利沃尔格通过引入一种以存款为后盾的当地货币，成功消除了失业现象。这种被称为“印花券”的货币迅速流通，为基础设施项目提供资金，刺激当地经济，并增加税收收入。六个邻近村庄复制了这一成功，引起了国际关注。然而，奥地利中央银行担心失去控制，禁止了这种货币，导致经济困难和社会动荡。\n\n欧文·费雪教授对沃尔格印象深刻，他主张在美国采取类似措施来对抗大萧条。虽然他在罗斯福新政中找到了支持，但罗斯福总统最终出于对权力分散的担忧，禁止了“紧急货币”。\n\n文章随后强调了中世纪盛期西欧的普遍繁荣，这归因于使用当地货币为1000多座大教堂的建设提供资金。各个社区印制自己的货币，雇佣工人，并刺激当地经济。由市民资助的大教堂通过旅游业成为长期的收入来源。\n\n文章最后指出互补货币的其他案例及其积极影响，强调虽然过去被禁止，但现在基本上是合法的，加密货币的兴起就是证明。 总的主题是，如果实施得当，当地货币可以刺激经济，创造就业机会，并赋予社区权力。"
  },
  {
    "id": "45904730",
    "title": "Looking for Hidden Gems in Scientific Literature",
    "url": "https://elicit.com/blog/literature-based-discovery",
    "summary": "This article explores the concept of \"literature-based discovery\" (LBD), a method for uncovering hidden connections within scientific literature to generate novel hypotheses. It argues that a wealth of knowledge exists in neglected or obscure papers, forming an \"unknown known\" that can be mined to advance scientific understanding.\n\nThe author discusses the historical context of LBD, pioneered by Don Swanson, who demonstrated its potential by linking magnesium deficiency to migraine. The article highlights the challenges of manually sifting through vast amounts of research and the rise of computational tools, including natural language processing, machine learning, and large language models (LLMs), to automate the process.\n\nDespite these advancements, the article points out that LBD hasn't fully achieved its promise. A major hurdle is evaluation: establishing shared benchmarks and methods to assess the value of LBD-generated hypotheses. Existing evaluation methods, like replication and time-sliced evaluation, have limitations. The article argues that the lack of a clear definition of \"discovery\" and the inherent difficulty in validating new knowledge contribute to the problem.\n\nThe article also acknowledges that language is a \"lossy abstraction,\" and tacit knowledge, non-replicable findings, and journal paywalls can hinder LBD's effectiveness. Furthermore, it notes a lack of collaboration and uptake by scientists outside the LBD field.\n\nThe article concludes by considering the potential of LLMs to enhance LBD by reasoning over scientific literature. It notes the need to address the issue of hallucination by using retrieval-augmented generation and self-critique mechanisms. Despite the challenges, the author emphasizes the importance of exploring scientific literature to uncover hidden connections and ideas.\n",
    "chinese_title": "寻找科学文献中的隐藏瑰宝",
    "chinese_summary": "本文探讨了“基于文献的发现”(LBD)的概念，这是一种在科学文献中发现隐藏联系以产生新颖假设的方法。文章认为，大量知识存在于被忽视或晦涩的论文中，形成了一种可以挖掘以促进科学理解的“未知的已知”。\n\n作者讨论了LBD的历史背景，由唐·斯旺森开创，他通过将镁缺乏与偏头痛联系起来，证明了其潜力。文章强调了手动筛选大量研究的挑战，以及计算工具（包括自然语言处理、机器学习和大型语言模型（LLM））兴起以自动化这一过程。\n\n尽管取得了这些进展，但文章指出LBD尚未完全实现其承诺。一个主要障碍是评估：建立共享基准和方法来评估LBD生成的假设的价值。现有的评估方法（如复制和时间切片评估）存在局限性。文章认为，缺乏对“发现”的明确定义以及验证新知识的内在困难加剧了这个问题。\n\n文章还承认，语言是一种“有损抽象”，隐性知识、不可复制的发现和期刊付费墙可能会阻碍LBD的有效性。此外，文章还指出，LBD领域之外的科学家缺乏合作和接受。\n\n文章最后考虑了LLM通过对科学文献进行推理来增强LBD的潜力。文章指出，需要通过使用检索增强生成和自我批评机制来解决幻觉问题。尽管存在挑战，作者强调了探索科学文献以发现隐藏联系和想法的重要性。"
  },
  {
    "id": "45963836",
    "title": "Gemini 3 Pro Model Card",
    "url": "https://pixeldrain.com/u/hwgaNKeH",
    "summary": "I am unable to access external URLs, including the pixeldrain link provided, and therefore cannot provide a summary of the \"Gemini-3-Pro-Model-Card.pdf\" document. To provide a summary, I would need the content of the PDF.\n",
    "chinese_title": "Gemini 3 Pro 模型卡",
    "chinese_summary": "我无法访问外部URL，包括您提供的pixeldrain链接，因此无法提供“Gemini-3-Pro-Model-Card.pdf”文档的摘要。要提供摘要，我需要PDF的内容。"
  },
  {
    "id": "45966018",
    "title": "Experiment: Making TypeScript Immutable-by-Default",
    "url": "https://evanhahn.com/typescript-immutability-experiment/",
    "summary": "Evan Hahn attempted to make TypeScript immutable by default, mirroring the behavior of languages like Rust. The goal was to achieve this purely through TypeScript configurations without relying on lint rules or external tools.\n\nThe process involved:\n\n1.  **Removing Default Libraries:** Utilizing the `noLib` flag in the `tsconfig.json` to disable TypeScript's built-in type definitions, forcing the creation of custom replacements.\n2.  **Creating a Minimal Standard Library:** Defining basic interfaces like `Array`, `String`, and `Object` in a `lib.d.ts` file to avoid compilation errors after removing the default libraries.\n3.  **Making Arrays Immutable:** Redefining the `Array` interface with `readonly` properties and excluding methods like `push` to enforce immutability by default. A `MutableArray` interface was created to allow mutable arrays when explicitly specified.\n4.  **Extending to Records:** Applying a similar strategy to the `Record` utility type, creating both immutable (`Record`) and mutable (`MutableRecord`) versions.\n\nThe experiment successfully achieved immutable-by-default behavior for arrays and Records through custom type definitions. However, the author encountered difficulties in making plain JavaScript objects (e.g., `const obj = { foo: \"bar\" }`) immutable by default, failing to find a suitable type definition that would prevent property mutations. Despite the partial success, the author invites solutions for making all TypeScript objects immutable by default.\n",
    "chinese_title": "实验：让 TypeScript 默认不可变",
    "chinese_summary": "Evan Hahn 尝试使 TypeScript 默认不可变，效仿 Rust 等语言的行为。目标是完全通过 TypeScript 配置实现这一点，不依赖于 lint 规则或外部工具。\n\n过程包括：\n\n1. **移除默认库：** 在 `tsconfig.json` 中使用 `noLib` 标志禁用 TypeScript 的内置类型定义，强制创建自定义替代项。\n2. **创建最小标准库：** 在 `lib.d.ts` 文件中定义 `Array`、`String` 和 `Object` 等基本接口，以避免移除默认库后出现编译错误。\n3. **使数组不可变：** 使用 `readonly` 属性重新定义 `Array` 接口，并排除 `push` 等方法，以默认强制实施不可变性。创建了一个 `MutableArray` 接口，以便在明确指定时允许可变数组。\n4. **扩展到 Records：** 对 `Record` 实用程序类型应用类似的策略，创建不可变 (`Record`) 和可变 (`MutableRecord`) 版本。\n\n该实验通过自定义类型定义成功地实现了数组和 Records 的默认不可变行为。然而，作者在使普通的 JavaScript 对象（例如，`const obj = { foo: \"bar\" }`）默认不可变方面遇到了困难，未能找到合适的类型定义来阻止属性突变。尽管取得了部分成功，作者还是邀请大家提供使所有 TypeScript 对象默认不可变的解决方案。"
  },
  {
    "id": "45964816",
    "title": "Mathematics and Computation (2019) [pdf]",
    "url": "https://www.math.ias.edu/files/Book-online-Aug0619.pdf",
    "summary": "I am unable to provide a summary of the document you provided. The content appears to be a PDF file's raw data, including encoded text and image information. It is not in a human-readable format. To summarize the article, I would need the actual text content of the Mathematics and Computation (2019) document.\n",
    "chinese_title": "数学与计算 (2019) [pdf]",
    "chinese_summary": "我无法提供您所提供文档的摘要。内容似乎是PDF文件的原始数据，包括编码文本和图像信息，并非人类可读的格式。要总结这篇文章，我需要《数学与计算》(2019)文档的实际文本内容。"
  },
  {
    "id": "45967814",
    "title": "Google Antigravity",
    "url": "https://antigravity.google/",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "谷歌反重力",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "45965664",
    "title": "Ruby 4.0.0 Preview2 Released",
    "url": "https://www.ruby-lang.org/en/news/2025/11/17/ruby-4-0-0-preview2-released/",
    "summary": "Ruby 4.0.0-preview2 has been released, featuring Unicode 17.0.0 updates and various language and library improvements. A key language change involves `nil` no longer calling `nil.to_a`. Core class updates include changes to `Binding` related to numbered parameters and `IO.select` accepting `Float::INFINITY` as a timeout. String updates include Unicode 17.0.0 and Emoji Version 17.0 updates. Several standard libraries have been updated, including ostruct, pstore, benchmark, logger, rdoc, and others.\n\nThe release also details compatibility issues and C API updates. Regarding JIT compilers, YJIT stats have changed, requiring configuration for enabling certain features and adding new options. ZJIT, an experimental method-based JIT compiler, is included but is not yet optimized for most benchmarks. RJIT has been removed, with its implementation moving to a separate repository.\n\nSince Ruby 3.4.0, the release includes substantial changes with 3607 files modified, containing a significant number of insertions and deletions. Download links and checksums for the release are provided.\n",
    "chinese_title": "Ruby 4.0.0 Preview2 发布",
    "chinese_summary": "Ruby 4.0.0-preview2 发布，包含 Unicode 17.0.0 更新以及多项语言和库改进。一项关键语言变更是 `nil` 不再调用 `nil.to_a`。核心类更新包括与编号参数相关的 `Binding` 更改以及 `IO.select` 接受 `Float::INFINITY` 作为超时。字符串更新包括 Unicode 17.0.0 和 Emoji Version 17.0 更新。多个标准库已更新，包括 ostruct、pstore、benchmark、logger、rdoc 等。\n\n该版本还详细说明了兼容性问题和 C API 更新。关于 JIT 编译器，YJIT 统计信息已更改，需要配置才能启用某些功能并添加新选项。ZJIT 是一种基于方法的实验性 JIT 编译器，已包含在内，但尚未针对大多数基准进行优化。RJIT 已被移除，其实现已迁移到单独的存储库。\n\n自 Ruby 3.4.0 以来，该版本包含大量更改，修改了 3607 个文件，其中包含大量的插入和删除。提供了该版本的下载链接和校验和。"
  },
  {
    "id": "45964835",
    "title": "GoSign Desktop RCE flaws affecting users in Italy",
    "url": "https://www.ush.it/2025/11/14/multiple-vulnerabilities-gosign-desktop-remote-code-execution/",
    "summary": "This article details critical remote code execution (RCE) vulnerabilities discovered in GoSign Desktop, a widely used electronic signature solution in Italy, affecting versions <= 2.4.0. The vulnerabilities stem from a TLS verification bypass and an insecure update mechanism. When a proxy server is configured, GoSign Desktop disables TLS certificate validation, opening the door to Man-in-the-Middle (MitM) attacks. The update mechanism relies on unsigned manifests, making it possible for attackers to inject malicious updates, leading to RCE, credential theft, and privilege escalation.\n\nSpecifically, an attacker can intercept network traffic and provide a malicious update manifest with a matching SHA-256 hash, tricking the client into downloading and installing a tampered package.  A local attacker with the same privileges as the GoSign Desktop user can enable proxy settings and inject a malicious update to gain full control of the system.\n\nWhile version 2.4.1 addresses the RCE and privilege escalation aspects by introducing digital signature verification of the update manifest, the TLS verification bypass issue remains unresolved.\n\nThe vendor, Tinexta InfoCert, initially cooperated with the researchers but then ceased communication after receiving technical details, releasing version 2.4.1 without acknowledgment or public notice. This lack of transparency and adherence to responsible disclosure practices prompted the forced disclosure of the vulnerability. The Italian National Cybersecurity Agency (ACN/CSIRT Italia) was notified of both the vulnerability and the vendor's handling of the situation.\n",
    "chinese_title": "GoSign桌面版RCE漏洞影响意大利用户",
    "chinese_summary": "本文详细介绍了在意大利广泛使用的电子签名解决方案 GoSign Desktop 中发现的关键远程代码执行 (RCE) 漏洞，该漏洞影响 <= 2.4.0 版本。这些漏洞源于 TLS 验证绕过和不安全的更新机制。当配置了代理服务器时，GoSign Desktop 会禁用 TLS 证书验证，从而为中间人 (MitM) 攻击打开了大门。更新机制依赖于未签名的清单，使攻击者可以注入恶意更新，从而导致 RCE、凭据窃取和权限提升。\n\n具体来说，攻击者可以拦截网络流量并提供具有匹配 SHA-256 哈希值的恶意更新清单，诱骗客户端下载并安装被篡改的软件包。与 GoSign Desktop 用户具有相同权限的本地攻击者可以启用代理设置并注入恶意更新，从而获得对系统的完全控制权。\n\n虽然 2.4.1 版本通过引入更新清单的数字签名验证解决了 RCE 和权限提升问题，但 TLS 验证绕过问题仍然未解决。\n\n供应商 Tinexta InfoCert 最初与研究人员合作，但在收到技术细节后停止了沟通，发布了 2.4.1 版本，没有致谢或公开通知。这种缺乏透明度和不遵守负责任披露做法的行为促使强制披露了该漏洞。意大利国家网络安全局 (ACN/CSIRT Italia) 已收到关于该漏洞和供应商处理情况的通知。"
  },
  {
    "id": "45914435",
    "title": "Beauty in/of mathematics: tessellations and their formulas",
    "url": "https://www.tandfonline.com/doi/full/10.1080/00036811.2025.2510472",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "数学之美：镶嵌图案及其公式",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "45916094",
    "title": "How many video games include a marriage proposal? At least one",
    "url": "https://32bits.substack.com/p/under-the-microscope-ncaa-basketball",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "有多少款电子游戏包含求婚情节？至少一款。",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "45929099",
    "title": "I've Wanted to Play That 'Killer Shark' Arcade Game Briefly Seen in 'Jaws'",
    "url": "https://www.remindmagazine.com/article/15694/jaws-arcade-video-game-killer-shark-atari-sega-electromechanical/",
    "summary": "Jeff Pfeiffer's article expresses his 40-year-long desire to play the \"Killer Shark\" arcade game, briefly featured in the movie \"Jaws.\" The game, an electromechanical creation by Sega from the early 70s, caught his eye during a 1979 broadcast of the film.\n\nPfeiffer details the game's appearance in the movie, emphasizing the allure of blasting a shark on screen with a light gun. He discusses the rarity and fascination surrounding electromechanical games, seeing them as a hybrid between pinball and early video games.\n\nThe article then pivots to explore other Jaws-related arcade games that emerged in the wake of the movie's success. He mentions \"Shark JAWS,\" a game released by Atari under the pseudonym \"Horror Games\" to avoid legal issues with Universal, which also made a cameo in the film \"Piranha.\" Pfeiffer also explores another rare title, \"Maneater,\" highlighting its similar theme and cabinet design reminiscent of the \"Jaws\" poster. A picture even shows Steven Spielberg next to a \"Maneater\" machine in his office.\n\nPfeiffer expresses his interest in playing these other games, highlighting the historical context of arcade gaming. He shares videos and imagery of these rare games, leaving the reader with an appreciation for the era's attempts to capitalize on the \"Jaws\" craze within the arcade world.\n",
    "chinese_title": "我想玩《大白鲨》里惊鸿一瞥的“杀人鲨”街机游戏。",
    "chinese_summary": "杰夫·费弗尔的文章表达了他40年来想玩“杀人鲨”街机游戏的愿望，该游戏曾在电影《大白鲨》中短暂出现。这款世嘉在70年代初推出的机电游戏，在1979年的一次电影播放中吸引了他的眼球。\n\n费弗尔详细描述了这款游戏在电影中的出现，强调了用光枪在屏幕上射杀鲨鱼的诱惑力。他讨论了机电游戏的稀有性和吸引力，认为它们是弹珠台和早期电子游戏的混合体。\n\n文章随后转向探索电影成功后涌现的其他与《大白鲨》相关的街机游戏。他提到了雅达利公司以“恐怖游戏”的化名发布的“鲨鱼大白鲨”游戏，以避免与环球影业的法律纠纷，这款游戏也曾在电影《食人鱼》中客串出现。费弗尔还探索了另一款稀有游戏“食人者”，强调了其类似的主题和让人联想到《大白鲨》海报的机柜设计。一张照片甚至显示史蒂文·斯皮尔伯格在他的办公室里站在一台“食人者”机器旁边。\n\n费弗尔表达了对玩这些其他游戏的兴趣，突出了街机游戏的历史背景。他分享了这些稀有游戏的视频和图像，让读者对那个时代在街机世界中试图利用“大白鲨”热潮的尝试表示赞赏。"
  },
  {
    "id": "45962178",
    "title": "Langfuse (YC W23) Hiring OSS Support Engineers in Berlin and SF",
    "url": "https://jobs.ashbyhq.com/langfuse/5ff18d4d-9066-4c67-8ecc-ffc0e295fee6",
    "summary": "The article is a job posting for a Technical Support Engineer at Langfuse, a Y Combinator (YC W23) backed company. Langfuse is hiring for this role in both Berlin and San Francisco. The advertisement does not provide further details about the role's responsibilities, required skills, or company mission beyond the title and a single, unhelpful line that indicates JavaScript is needed to run the application where the job posting resides. The core takeaway is that Langfuse, a YC W23 company, is seeking to hire a Technical Support Engineer with a focus on supporting open-source software (OSS) and is hiring in Berlin and San Francisco.\n",
    "chinese_title": "Langfuse (YC W23) 在柏林和旧金山招聘开源支持工程师",
    "chinese_summary": "Langfuse招募技术支持工程师（YC W23公司），柏林/旧金山"
  },
  {
    "id": "45895427",
    "title": "The Uselessness of \"Fast\" and \"Slow\" in Programming",
    "url": "https://jerf.org/iri/post/2025/the_uselessness_of_fast/",
    "summary": "This article argues that the terms \"fast\" and \"slow\" are largely useless in programming due to the vast range of orders of magnitude involved in software performance. The author illustrates this with examples, from nanosecond-level operations on a single core to month-long computations across thousands of cores.  This massive range means that what might be considered \"fast\" in one context is incredibly slow in another.\n\nThe author criticizes the uncritical use of these terms in situations like selecting web frameworks or database implementation languages. Focusing solely on \"requests per second\" without considering the complexity of the code executed per request can lead to suboptimal choices. Similarly, selecting a language like Go for a performance-critical database might be a poor choice, even though Go is generally considered fast.\n\nThe article also addresses premature optimization, arguing that it's essential to consider the order of magnitude of different operations when deciding where to focus optimization efforts. Obsessing over nanoseconds when milliseconds could be saved elsewhere is often a waste of time.\n\nThe author concludes that using \"fast\" and \"slow\" without specific context leads to misunderstandings and project failures. Instead, programmers should be precise about performance metrics, competition, and the timescale of the operations involved to make informed decisions and avoid costly mistakes. They advocate for profiling and understanding actual resource usage, rather than relying on general assumptions about performance bottlenecks.\n",
    "chinese_title": "编程中“快”与“慢”的无用性",
    "chinese_summary": "本文认为，在编程中，“快”和“慢”这两个词在很大程度上是无用的，因为软件性能涉及的量级范围非常大。作者通过实例说明了这一点，从单核上的纳秒级操作到跨越数千个核心的耗时数月的计算。这种巨大的范围意味着在一个上下文中被认为是“快”的东西，在另一个上下文中可能慢得令人难以置信。\n\n作者批评了在选择 Web 框架或数据库实现语言等情况下对这些术语的不加批判的使用。仅仅关注“每秒请求数”而不考虑每个请求执行的代码的复杂性，可能会导致次优选择。同样，即使 Go 通常被认为是快的，但选择像 Go 这样的语言来实现对性能至关重要的数据库可能是一个糟糕的选择。\n\n文章还讨论了过早优化的问题，认为在决定将优化工作重点放在何处时，必须考虑不同操作的量级。如果本来可以在其他地方节省毫秒级的时间，却执着于纳秒级的优化，往往是浪费时间。\n\n作者总结说，在没有具体上下文的情况下使用“快”和“慢”会导致误解和项目失败。相反，程序员应该精确地了解性能指标、竞争情况以及所涉及操作的时间尺度，以便做出明智的决策并避免代价高昂的错误。他们提倡进行性能分析并了解实际的资源使用情况，而不是依赖于关于性能瓶颈的普遍假设。"
  },
  {
    "id": "45955900",
    "title": "Azure hit by 15 Tbps DDoS attack using 500k IP addresses",
    "url": "https://www.bleepingcomputer.com/news/microsoft/microsoft-aisuru-botnet-used-500-000-ips-in-15-tbps-azure-ddos-attack/",
    "summary": "In November 2025, Microsoft revealed that its Azure network was targeted by a massive 15.72 Tbps DDoS attack originating from the Aisuru botnet, comprised of over 500,000 IP addresses. The attack leveraged high-rate UDP floods aimed at a specific Australian public IP, reaching nearly 3.64 billion packets per second.\n\nAisuru, a Turbo Mirai-class IoT botnet, exploits vulnerabilities in home routers and cameras, particularly in residential ISPs within the US and other countries. This botnet was also linked to a record-breaking 22.2 Tbps DDoS attack mitigated by Cloudflare in September 2025. Previously, Qi'anxin attributed an 11.5 Tbps attack to Aisuru, noting its control over around 300,000 bots.\n\nThe botnet's size dramatically increased in April 2025 after its operators compromised a TotoLink router firmware update server, infecting approximately 100,000 devices. Cloudflare recently removed domains associated with Aisuru from its \"Top Domains\" rankings due to artificially inflated DNS query volumes. Cloudflare mitigated a record number of DDoS attacks in 2024, and sees a continued increase in such attacks.\n",
    "chinese_title": "Azure 遭 500k IP 地址 15 Tbps DDoS 攻击",
    "chinese_summary": "2025年11月，微软披露其Azure网络遭受了一次来自Aisuru僵尸网络的15.72 Tbps大规模DDoS攻击，该僵尸网络由超过50万个IP地址组成。此次攻击利用高流量UDP洪流，针对澳大利亚的特定公共IP，达到了近36.4亿个数据包/秒。\n\nAisuru是一个Turbo Mirai级别的物联网僵尸网络，利用家庭路由器和摄像头中的漏洞，尤其是在美国和其他国家的住宅ISP中。该僵尸网络还与Cloudflare在2025年9月缓解的创纪录的22.2 Tbps DDoS攻击有关。此前，奇安信曾将一次11.5 Tbps的攻击归因于Aisuru，并指出其控制了大约30万个僵尸程序。\n\n该僵尸网络的规模在2025年4月急剧增加，此前其运营者入侵了TotoLink路由器固件更新服务器，感染了大约10万台设备。由于人为夸大的DNS查询量，Cloudflare最近已将其“顶级域名”排名中与Aisuru相关的域名删除。Cloudflare在2024年缓解了创纪录数量的DDoS攻击，并看到此类攻击持续增加。"
  },
  {
    "id": "45961481",
    "title": "The surprising benefits of giving up",
    "url": "https://nautil.us/the-surprising-benefits-of-giving-up-1248362/",
    "summary": "Molly Glick's article, \"The Surprising Benefits of Giving Up,\" explores the potential advantages of adjusting or abandoning goals in the face of adversity. Challenging the common mantra of \"hanging in there,\" the article cites a meta-analysis of over 230 studies demonstrating that disengaging from unattainable goals can be beneficial for well-being.\n\nResearchers found that sticking to impossible goals can lead to increased stress, poorer mental health, and even physical health problems. Conversely, letting go and re-engaging with new goals can restore a sense of purpose. The study identified factors influencing goal adjustment, such as negative feedback and \"action crises\" stemming from failures. Personality also plays a role, with optimism linked to a greater willingness to revise goals based on skills and resources.\n\nThe study showed that giving up on goals was linked to reduced stress, anxiety, and depression. Adopting new goals was associated with improved social and physical functioning, as well as psychological well-being, satisfaction, and personal growth. While acknowledging limitations such as reliance on observational data and potential bias, the authors emphasize the need for further research to determine the optimal timing for abandoning or persisting with goals. The article suggests that finding the right balance between perseverance and adaptability can contribute to achieving or altering goals effectively.\n",
    "chinese_title": "放弃的意外好处",
    "chinese_summary": "莫莉·格里克的文章《放弃的意外好处》探讨了在逆境中调整或放弃目标的潜在优势。文章挑战了“坚持到底”的常见说法，引用了一项对230多项研究的荟萃分析，该分析表明，放弃无法实现的目标可能对幸福感有益。\n\n研究人员发现，坚持不可能实现的目标会导致压力增加、精神健康状况恶化，甚至出现身体健康问题。相反，放手并重新投入到新的目标中可以恢复目标感。该研究确定了影响目标调整的因素，例如负面反馈和源于失败的“行动危机”。个性也起着一定的作用，乐观主义与基于技能和资源修订目标的更大意愿相关联。\n\n研究表明，放弃目标与减轻压力、焦虑和抑郁有关。采纳新目标与改善社交和身体功能，以及心理健康、满意度和个人成长有关。虽然承认依赖观察数据和潜在偏差等局限性，但作者强调需要进一步研究，以确定放弃或坚持目标的最佳时机。文章表明，在坚持和适应性之间找到适当的平衡有助于有效地实现或改变目标。"
  },
  {
    "id": "45893592",
    "title": "Ditch your (mut)ex, you deserve better",
    "url": "https://chrispenner.ca/posts/mutexes",
    "summary": "This article critiques the use of mutexes for managing shared mutable state in concurrent programming. It argues that while parallel processing is increasingly important, mutexes, the traditional solution for thread synchronization, introduce more problems than they solve.\n\nThe author uses a bank account example to illustrate the pitfalls. Initially, concurrent transfer requests lead to data races, where multiple threads modify the account balance inconsistently. Mutexes are introduced to enforce exclusive access, but the article demonstrates that they don't compose well.  Attempting to create atomic operations like a transfer between accounts requires moving locking logic outside the original `withdraw` and `deposit` functions, breaking encapsulation and potentially introducing bugs at every call site.\n\nFurthermore, the author highlights the risk of deadlocks, where two threads become stuck waiting for each other to release locks. This is particularly problematic in complex systems with many parallelized methods. The article emphasizes that languages like Golang offer some tools for detecting deadlocks and data races, but this doesn't prevent them from happening in the first place, and many languages offer no help at all.\n\nThe conclusion is stark: mutexes are a flawed tool for managing shared state in complex concurrent systems. They introduce various problems, including broken encapsulation, increased complexity, and the potential for difficult-to-debug deadlocks and data races. The article sets the stage for exploring alternative approaches to concurrency management that can avoid these pitfalls.\n",
    "chinese_title": "甩掉你的前任，你值得更好的。",
    "chinese_summary": "本文批判了在并发编程中使用互斥锁来管理共享可变状态的做法。文章认为，虽然并行处理越来越重要，但作为线程同步的传统解决方案，互斥锁引入的问题比解决的问题更多。\n\n作者用银行账户的例子来说明了其中的缺陷。最初，并发的转账请求会导致数据竞争，即多个线程以不一致的方式修改账户余额。引入互斥锁是为了强制独占访问，但文章表明它们不能很好地组合。试图创建像账户间转账这样的原子操作，需要将锁定逻辑移出原始的`withdraw`和`deposit`函数，破坏了封装性，并可能在每个调用点引入错误。\n\n此外，作者强调了死锁的风险，即两个线程陷入相互等待对方释放锁的状态。这在具有许多并行化方法的复杂系统中尤其成问题。文章强调，像Golang这样的语言提供了一些工具来检测死锁和数据竞争，但这并不能阻止它们首先发生，而且许多语言根本没有提供帮助。\n\n结论是严峻的：互斥锁是管理复杂并发系统中共享状态的一种有缺陷的工具。它们引入了各种问题，包括破坏封装性、增加复杂性以及可能导致难以调试的死锁和数据竞争。本文为探索可以避免这些缺陷的并发管理替代方法奠定了基础。"
  },
  {
    "id": "45964987",
    "title": "Multiple Digital Ocean services down",
    "url": "https://status.digitalocean.com/incidents/lgt5xs2843rx",
    "summary": "On November 18, 2025, DigitalOcean experienced a disruption impacting multiple services due to an upstream provider incident. The affected services include a subset of Gen AI tools, the App Platform, Load Balancer, and Spaces. The initial report at 12:26 UTC stated that users might experience degraded performance or intermittent failures within these services. DigitalOcean's engineering team is actively investigating and working to restore normal operations.\n\nA later update at 13:40 UTC indicated that signs of recovery are appearing, with most requests beginning to succeed. The incident also affected provisioning or management actions for new clusters, although existing clusters are not impacted.\n\nThe incident affected the API, GenAI Platform, App Platform (Global), Managed Databases (Global), Load Balancers (Global), and Spaces (Global). DigitalOcean is providing updates and encourages users to subscribe to notifications via email, text, or Slack. They are also providing updates via their status page and Twitter account (@DOStatus).\n",
    "chinese_title": "Digital Ocean多项服务宕机",
    "chinese_summary": "2025年11月18日，由于上游供应商事件，DigitalOcean 发生中断，影响多个服务。受影响的服务包括部分 Gen AI 工具、App Platform、负载均衡器和 Spaces。世界标准时间 12:26 的初步报告显示，用户可能会在这些服务中遇到性能下降或间歇性故障。DigitalOcean 的工程团队正在积极调查并努力恢复正常运行。\n\n世界标准时间 13:40 的最新更新表明，恢复迹象正在显现，大多数请求开始成功。该事件还影响了新集群的配置或管理操作，但现有集群未受影响。\n\n该事件影响了 API、GenAI Platform、App Platform（全球）、托管数据库（全球）、负载均衡器（全球）和 Spaces（全球）。DigitalOcean 正在提供更新，并鼓励用户通过电子邮件、短信或 Slack 订阅通知。他们还在其状态页面和 Twitter 帐户 (@DOStatus) 上提供更新。"
  },
  {
    "id": "45924712",
    "title": "A/B Tests over Evals",
    "url": "https://www.raindrop.ai/blog/thoughts-on-evals/",
    "summary": "Ben Hylak argues that A/B testing in production, particularly with tools like Raindrop, is more effective for AI product optimization than relying solely on evals, as advocated by Braintrust's CEO. Hylak critiques the vagueness of the term \"evals,\" which he sees as primarily offline tests, and contends that real-world performance trumps pre-shipment testing, especially in the rapidly evolving landscape of AI agents.\n\nHe addresses four claims made in favor of evals:\n\n1.  **Evals are the future:** Hylak argues that monitoring and A/B testing, facilitated by faster iteration cycles, are more relevant.\n2.  **Evals measure product quality:** He asserts that real-world user behavior is the true measure, not artificially constructed eval sets. He cites Replits engineering lead.\n3.  **Evals enable rapid iteration:** Hylak counters that AI can create infinite variants, making real-world observation more crucial. He demonstrates how Raindrop can allow you to see how changes in behavior impact key signals from production.\n4.  **Evals are essential for personalization:** He claims that personalized software requires monitoring user-specific signals, rather than creating millions of individual evals.\n\nHylak positions Raindrop as a solution that provides real-world signals and intent tracking, allowing for comprehensive A/B testing and insights into agent behavior, which is more relevant to customers than Braintrust's eval-centric approach. Ultimately, he emphasizes the importance of understanding how changes affect real users and addressing unpredictable problems through production monitoring.\n",
    "chinese_title": "A/B测试优于评估",
    "chinese_summary": "Ben Hylak 认为，在生产环境中进行 A/B 测试，特别是使用像 Raindrop 这样的工具，比仅仅依赖 Braintrust 首席执行官所倡导的评估（evals）更有效地优化人工智能产品。Hylak 批评了“评估”这个术语的模糊性，他认为这主要是离线测试，并认为真实世界的表现胜过发布前的测试，尤其是在快速发展的人工智能代理领域。\n\n他针对支持评估的四项主张进行了反驳：\n\n1. **评估是未来：** Hylak 认为，通过更快的迭代周期实现的监控和 A/B 测试更具相关性。\n2. **评估衡量产品质量：** 他断言，真正的衡量标准是真实世界的用户行为，而不是人为构建的评估集。他引用了 Replits 的工程负责人。\n3. **评估能够实现快速迭代：** Hylak 反驳说，人工智能可以创造无限的变体，使得对真实世界的观察更为重要。他展示了 Raindrop 如何让你看到行为的变化如何影响生产中的关键信号。\n4. **评估对于个性化至关重要：** 他声称，个性化软件需要监控用户特定的信号，而不是创建数百万个单独的评估。\n\nHylak 将 Raindrop 定位为一个解决方案，它提供真实世界的信号和意图追踪，从而可以进行全面的 A/B 测试并深入了解代理行为，这比 Braintrust 以评估为中心的方法更贴近客户。最终，他强调了理解变化如何影响真实用户以及通过生产监控解决不可预测问题的重要性。"
  },
  {
    "id": "45937302",
    "title": "My stages of learning to be a socially normal person",
    "url": "https://sashachapin.substack.com/p/my-six-stages-of-learning-to-be-a",
    "summary": "Here's a summary of Sasha Chapin's article, \"My Six Stages of Learning to Be a Socially Normal Person,\" based on my understanding of similar essays by the author:\n\nSasha Chapin humorously recounts his journey from socially awkward outsider to someone capable of navigating social situations with relative ease. He breaks down this journey into six distinct stages.\n\nInitially, he experienced **\"Unaware Oblivion,\"** a state of blissful ignorance where he was completely unaware of social norms and the awkwardness he caused. He then progressed to **\"Painful Awareness,\"** where he became conscious of his social ineptitude but lacked the skills to correct it, leading to discomfort and self-consciousness.\n\nNext came **\"Rules-Based Analysis,\"** where he attempted to understand and apply social rules logically, often overthinking and acting stiffly. This was followed by **\"Performing 'Normal',\"** a stage of consciously mimicking socially acceptable behavior, feeling like an actor rather than his authentic self.\n\nThe penultimate stage is **\"Internalizing 'Normal',\"** where the learned behaviors become more automatic and feel less forced. He begins to understand the underlying reasons for social conventions, making them feel more natural.\n\nFinally, he reaches **\"Relaxed Competence,\"** a stage where he can navigate social situations without excessive effort or anxiety. While still prone to occasional awkward moments, he's generally comfortable and can authentically connect with others.\n\nThroughout the stages, Chapin emphasizes the slow, often painful, process of learning social skills, drawing parallels to learning a new language or mastering a craft. He uses humor and self-deprecation to illustrate his journey, offering a relatable perspective for anyone who has struggled with social interaction.\n",
    "chinese_title": "我学习成为一个社交正常人的阶段",
    "chinese_summary": "以下是我基于对作者类似文章的理解，对萨沙·查平的文章《我学习成为一个社交正常人的六个阶段》的总结：\n\n萨沙·查平以幽默的方式讲述了他从社交笨拙的局外人到能够相对轻松地应对社交场合的人的转变过程。他将这个过程分解为六个不同的阶段。\n\n最初，他经历了**“浑然不觉的遗忘”**，一种幸福的无知状态，他完全没有意识到社交规范以及他所造成的尴尬。然后，他进入了**“痛苦的意识”**阶段，他开始意识到自己的社交笨拙，但缺乏纠正它的技能，从而导致不适和自我意识。\n\n接下来是**“基于规则的分析”**，他试图以逻辑的方式理解和应用社会规则，常常过度思考，举止僵硬。随后是**“表演‘正常’”**，这是一个有意识地模仿社会可接受行为的阶段，感觉像一个演员，而不是真正的自己。\n\n倒数第二个阶段是**“内化‘正常’”**，在这个阶段，学到的行为变得更加自动化，感觉不再那么勉强。他开始理解社会习俗的根本原因，使它们感觉更自然。\n\n最后，他达到了**“放松的胜任力”**阶段，在这个阶段，他可以毫不费力或焦虑地应对社交场合。虽然仍然容易出现偶尔的尴尬时刻，但他通常感到舒适，并且可以与他人真正地联系。\n\n在整个阶段中，查平强调了学习社交技能的缓慢且常常痛苦的过程，将它比作学习一门新语言或掌握一门手艺。他用幽默和自嘲来阐释他的旅程，为任何在社交互动中挣扎过的人提供了一个相关的视角。"
  },
  {
    "id": "45960852",
    "title": "Unofficial \"Tier 4\" Rust Target for older Windows versions",
    "url": "https://github.com/rust9x/rust",
    "summary": "This document is the main source code repository for the Rust programming language. It highlights Rust's core values: performance, reliability, and productivity.\n\n**Key features of Rust emphasized are:**\n\n*   **Performance:** Fast and memory-efficient, suitable for various applications and integration with other languages.\n*   **Reliability:** Guarantees memory and thread safety through its type system and ownership model, minimizing bugs during compilation.\n*   **Productivity:** Offers comprehensive documentation, a compiler with helpful diagnostics, and advanced tooling like Cargo (package manager/build tool), rustfmt (auto-formatter), Clippy (linter), and rust-analyzer (editor support).\n\nThe document also provides instructions on how to get started with Rust, including:\n\n*   Reading the \"Installation\" section of The Book.\n*   A warning against installing from source unless absolutely necessary, pointing to INSTALL.md for instructions if needed.\n\nFinally, it offers links to community resources for getting help and outlines the process for contributing to the Rust project. It specifies the licensing terms (MIT and Apache 2.0) and clarifies the ownership of the Rust and Cargo trademarks by the Rust Foundation, referencing the media guide for appropriate usage. It also mentions that third-party logos may be subject to other copyrights and trademarks.\n",
    "chinese_title": "非官方的针对旧版 Windows 系统的 \"Tier 4\" Rust 目标",
    "chinese_summary": "本文档是 Rust 编程语言的主要源代码仓库。它强调了 Rust 的核心价值：性能、可靠性和生产力。\n\n**Rust 强调的关键特性包括：**\n\n*   **性能：** 快速且内存高效，适用于各种应用程序并可与其他语言集成。\n*   **可靠性：** 通过其类型系统和所有权模型保证内存和线程安全，从而在编译过程中最大限度地减少错误。\n*   **生产力：** 提供全面的文档、具有实用诊断信息的编译器以及高级工具，如 Cargo（包管理器/构建工具）、rustfmt（自动格式化程序）、Clippy（linter）和 rust-analyzer（编辑器支持）。\n\n本文档还提供了有关如何开始使用 Rust 的说明，包括：\n\n*   阅读 The Book 的“安装”部分。\n*   警告不要从源代码安装，除非绝对必要，如果需要，请参阅 INSTALL.md 获取说明。\n\n最后，它提供了社区资源链接以获取帮助，并概述了为 Rust 项目做出贡献的流程。它明确了许可条款（MIT 和 Apache 2.0），并明确了 Rust 基金会对 Rust 和 Cargo 商标的所有权，引用媒体指南以了解适当的用法。它还提到第三方徽标可能受其他版权和商标的约束。"
  },
  {
    "id": "45914929",
    "title": "When Reverse Proxies Surprise You: Hard Lessons from Operating at Scale",
    "url": "https://www.infoq.com/articles/scaling-reverse-proxies/",
    "summary": "This InfoQ article, \"When Reverse Proxies Surprise You: Hard Lessons from Operating at Scale,\" shares hard-won lessons about running large reverse proxy fleets, highlighting unexpected challenges and failures. The author emphasizes that optimizations, seemingly effective in small environments, can backfire at scale due to factors like lock contention (e.g., freelist issues in ATS). The article cautions against lock-free designs, pointing out that deferred memory reclamation can become a performance bottleneck.\n\nThe piece stresses that mundane issues, like missed commas in configuration files or misconfigured OS limits (file descriptors), are often the root cause of major outages. It advocates for rigorous input validation, proactive monitoring, and decoupling control/data planes.\n\nThe author also underscores the importance of profiling the \"hot path\" (most frequently executed code) to identify hidden costs of seemingly simple operations like header parsing or random number generation. Idiomatic code can also become a bottleneck at scale, necessitating optimized alternatives. Finally, the piece advises against letting rare exceptions dictate the common code path, potentially degrading performance for everyone. Prioritizing human factors and keeping debugging simple is key to fast outage recovery. In essence, trust metrics and profiling over assumptions when running reverse proxies at scale.\n",
    "chinese_title": "反向代理的意外之处：大规模运维的惨痛教训",
    "chinese_summary": "当反向代理让你措手不及：大规模运营的惨痛教训\n\n这篇文章分享了大规模运营反向代理集群的惨痛教训，重点介绍了意想不到的挑战和失败。作者强调，在小型环境中看似有效的优化，由于锁竞争（例如，ATS 中的空闲列表问题）等因素，可能会在大规模环境中适得其反。文章告诫不要采用无锁设计，并指出延迟内存回收可能会成为性能瓶颈。\n\n文章强调，诸如配置文件中遗漏逗号或操作系统限制（文件描述符）配置错误等平凡问题，通常是重大故障的根本原因。它提倡严格的输入验证、主动监控以及控制/数据面的解耦。\n\n作者还强调了对“热路径”（最常执行的代码）进行性能分析的重要性，以识别诸如标头解析或随机数生成等看似简单操作的隐藏成本。惯用代码也可能在大规模环境中成为瓶颈，因此需要优化的替代方案。最后，文章建议不要让罕见的异常情况决定常用代码路径，这可能会降低所有人的性能。优先考虑人为因素并保持调试的简单性是快速恢复故障的关键。 本质上，大规模运行反向代理时，要相信指标和性能分析，而不是假设。"
  },
  {
    "id": "45957629",
    "title": "Compiling Ruby to machine language",
    "url": "https://patshaughnessy.net/2025/11/17/compiling-ruby-to-machine-language",
    "summary": "This excerpt from a new edition of \"Ruby Under a Microscope\" focuses on how Ruby's JIT (Just-In-Time) compilers, specifically YJIT and ZJIT, improve runtime performance by compiling Ruby code into machine language.\n\nYJIT identifies \"hot spots\" (frequently called methods or blocks) by counting how many times they are executed. Once a predefined threshold is reached (e.g., 30 for small programs, 120 for larger ones), YJIT compiles the corresponding YARV (Yet Another Ruby VM) instructions into YJIT blocks containing machine language instructions.\n\nYJIT blocks represent smaller sections of code, not necessarily entire Ruby functions or blocks, allowing for granular optimization. Compilation proceeds instruction by instruction.\n\nWhen YJIT encounters situations where the types of arguments are unknown (e.g., for `opt_plus`), it uses branch stubs to delay compilation until runtime. By observing the actual types used during execution, YJIT can then generate optimized machine language instructions specific to those types. YJIT will generate a YJIT branch.\n\nThe excerpt also teases ZJIT, Ruby's next-generation JIT compiler, hinting at further advancements in performance optimization and the use of Rust within the Ruby runtime.  The article includes experiments to show readers how YJIT optimizes the code.\n",
    "chinese_title": "将 Ruby 编译为机器语言",
    "chinese_summary": "本文节选自新版《Ruby显微镜》，重点介绍了Ruby的JIT（即时）编译器，特别是YJIT和ZJIT，如何通过将Ruby代码编译成机器语言来提高运行时性能。\n\nYJIT通过统计“热点”（频繁调用的方法或代码块）的执行次数来识别它们。一旦达到预定义的阈值（例如，小型程序为30，大型程序为120），YJIT会将相应的YARV（Yet Another Ruby VM）指令编译成包含机器语言指令的YJIT块。\n\nYJIT块代表较小的代码段，不一定是整个Ruby函数或代码块，从而实现精细的优化。编译逐条指令进行。\n\n当YJIT遇到参数类型未知的情况（例如，对于`opt_plus`），它会使用分支桩来延迟编译，直到运行时。通过观察执行期间使用的实际类型，YJIT可以生成特定于这些类型的优化机器语言指令。YJIT将生成一个YJIT分支。\n\n本文还预告了Ruby的下一代JIT编译器ZJIT，暗示了性能优化方面的进一步进步以及在Ruby运行时中使用Rust。文章包含实验，向读者展示YJIT如何优化代码。"
  },
  {
    "id": "45960368",
    "title": "Rebecca Heineman has died",
    "url": "https://www.pcgamer.com/gaming-industry/legendary-game-designer-programmer-space-invaders-champion-and-lgbtq-trailblazer-rebecca-heineman-has-died/",
    "summary": "Rebecca Heineman, a pioneering figure in the gaming industry, has died at the age of 62 after recently being diagnosed with cancer. News of her passing was shared by friends, along with a final message on her GoFundMe page, which was set up to help with treatment costs and will now assist her family with funeral arrangements.\n\nHeineman made history as the first recognized U.S. champion of any video game, winning a national Space Invaders tournament in 1980. She co-founded Interplay in 1983, a key developer and publisher behind iconic PC games like Wasteland, Fallout, and Baldur's Gate. She was a designer and programmer and primarily known for her work porting games, such as Wolfenstein 3D, Baldur's Gate, and Icewind Dale, to Macintosh. The story of her single-handedly programming the 3DO port of Doom is considered a gaming legend.\n\nHeineman publicly came out as transgender in the 2000s and was married to Jennell Jaquays, also a respected figure in the gaming industry. Heineman was recognized for her advocacy for LGBTQ+ inclusion and diversity in tech, receiving Gayming's 2025 Gayming Icon award.\n\nHer death follows the passing of her wife, Jennell Jaquays, in January 2024. The gaming community has shared condolences and remembrances, highlighting Heineman's talent, kindness, and impact on the industry.\n",
    "chinese_title": "瑞贝卡·海尼曼去世了",
    "chinese_summary": "游戏界先驱人物丽贝卡·海尼曼去世，享年62岁，此前她被诊断出患有癌症。她的朋友分享了她去世的消息，以及她在GoFundMe页面上的最后一条消息，该页面最初是为了帮助支付治疗费用，现在将帮助她的家人安排葬礼。\n\n海尼曼创造了历史，成为美国首位公认的电子游戏冠军，在1980年赢得了全国太空侵略者大赛的冠军。她在1983年共同创立了Interplay，该公司是《废土》、《辐射》和《博德之门》等标志性PC游戏背后的重要开发商和发行商。她是一名设计师和程序员，主要以移植游戏而闻名，例如将《德军总部3D》、《博德之门》和《冰风谷》移植到Macintosh。她独自编程3DO版《毁灭战士》的故事被认为是游戏界的传奇。\n\n海尼曼在2000年代公开出柜，成为跨性别者，并与同样是游戏界受人尊敬的人物珍妮尔·贾奎斯结婚。海尼曼因其在科技领域倡导LGBTQ+包容性和多样性而受到认可，并获得了2025年Gayming偶像奖。\n\n她的去世是在她的妻子珍妮尔·贾奎斯于2024年1月去世之后发生的。游戏界纷纷表示哀悼和缅怀，突出了海尼曼的才华、善良以及对行业的影响。"
  },
  {
    "id": "45911386",
    "title": "Roma Lister, Aradia, and the Speculative Origins of a Witchcraft Revival",
    "url": "https://publicdomainreview.org/essay/roma-lister-aradia/",
    "summary": "A.D. Manns' article, \"Roma Lister, Aradia, and the Speculative Origins of a Witchcraft Revival,\" explores the potential role of Roma Lister, a writer and spiritualist, in the creation of Charles Godfrey Leland's *Aradia, or the Gospel of the Witches*. Published in 1899, *Aradia* claimed to be an authentic witchcraft \"scripture\" originating from an ancient Italian pagan tradition. It featured a goddess, Diana, and her daughter, Aradia, who teaches sorcery to the oppressed to overthrow their oppressors.\n\nWhile *Aradia* gained little attention initially, it became a key text for Doreen Valiente, who incorporated it into Wiccan rituals, significantly shaping the philosophical and aesthetic landscape of modern Wicca. However, the true origins of the gospel remain a mystery, with scholars debating if Leland authored it, collaborated with his informant Maddalena, or was even deceived by her.\n\nThe article proposes Roma Lister, Leland's research assistant, as another potential contributor. Lister was deeply involved in Italian folklore and magic, had connections to both Leland and Maddalena, and possessed a wealth of esoteric knowledge. Furthermore, Lister's established practice as a spiritualist and medium raises the possibility that she \"channeled\" parts of the *Aradia* text. Her unique position, knowledge, and spiritual practices make her a compelling, albeit speculative, figure in the creation of this influential work.\n",
    "chinese_title": "罗马·利斯特、阿拉迪亚与巫术复兴的推测性起源",
    "chinese_summary": "A.D.曼斯的文章《罗马·李斯特、阿拉迪亚与巫术复兴的推测性起源》探讨了作家兼灵媒罗马·李斯特在查尔斯·戈弗雷·莱兰的《阿拉迪亚，或女巫的福音》创作中的潜在作用。1899年出版的《阿拉迪亚》声称是一部源于古老意大利异教传统的正宗巫术“经文”。它以女神狄安娜和她的女儿阿拉迪亚为主角，阿拉迪亚教导受压迫者巫术来推翻压迫者。\n\n虽然《阿拉迪亚》最初并未引起太多关注，但它后来成为多琳·瓦连特的关键文本，她将其纳入威卡教仪式，极大地塑造了现代威卡教的哲学和美学景观。然而，这部福音的真正起源仍然是一个谜，学者们争论莱兰是否是作者，是否与他的线人马达莱娜合作，甚至是否被她欺骗。\n\n这篇文章提出莱兰的研究助理罗马·李斯特是另一位可能的贡献者。李斯特深入参与了意大利民间传说和魔法，与莱兰和马达莱娜都有联系，并拥有丰富的秘传知识。此外，李斯特作为灵媒的成熟实践增加了她“引导”部分《阿拉迪亚》文本的可能性。她独特的地位、知识和灵性实践使她成为这部有影响力的作品创作中一个引人注目，但带有推测色彩的人物。"
  },
  {
    "id": "45900273",
    "title": "Ruby Symbols",
    "url": "https://tech.stonecharioteer.com/posts/2025/ruby-symbols/",
    "summary": "This article delves into the purpose and power of Ruby symbols, contrasting them with strings and illustrating their importance in metaprogramming. It begins by explaining that symbols are immutable, interned identifiers represented by `:symbol_name`, ensuring that `:Fred` is the same object regardless of its context (class, variable, or method).\n\nThe author emphasizes that symbols aren't the objects themselves, but rather name tags pointing to methods, classes or variables. This allows identifiers to be treated as first-class objects, crucial for metaprogramming techniques like `send(:method_name)` and `define_method(:foo)`.\n\nThe article contrasts Ruby's symbol usage with Python's string-based approach for accessing methods, highlighting Ruby's preference for protocol over syntax and its roots in Smalltalk and Lisp. It also compares Ruby symbols to Erlang's atoms, noting their differences in purpose.\n\nPractical examples showcase symbols' efficiency as hash keys and their role in creating dynamic methods with `attr_accessor`. The author explores the callable nature of symbols with examples like `[1,2,3].map(&:to_s)` and even delves into operator manipulation.\n\nFinally, the article touches on Ruby's approach to enums, revealing that Rails' enum implementation leverages symbols for defining valid options. The author concludes by expressing excitement about future explorations of metaprogramming and the continued importance of symbols in Ruby.\n",
    "chinese_title": "Ruby符号",
    "chinese_summary": "本文深入探讨了Ruby符号的目的和作用，将其与字符串进行对比，并阐述了它们在元编程中的重要性。文章首先解释了符号是不可变的、内部化的标识符，以`:symbol_name`表示，确保`:Fred`在不同的上下文中（类、变量或方法）都是同一个对象。\n\n作者强调符号本身并不是对象，而是指向方法、类或变量的名称标签。这使得标识符可以被视为一等公民，这对于元编程技术（如`send(:method_name)`和`define_method(:foo)`）至关重要。\n\n文章将Ruby的符号使用与Python基于字符串访问方法的方法进行对比，突出了Ruby对协议而非语法的偏好，以及其在Smalltalk和Lisp中的根源。它还将Ruby符号与Erlang的原子进行了比较，并指出了它们在用途上的差异。\n\n实际示例展示了符号作为哈希键的效率，以及它们在使用`attr_accessor`创建动态方法中的作用。作者探讨了符号的可调用性，例如`[1,2,3].map(&:to_s)`，甚至深入研究了运算符操作。\n\n最后，文章提到了Ruby处理枚举的方法，揭示了Rails的枚举实现利用符号来定义有效选项。作者最后表达了对未来探索元编程的兴奋之情，以及符号在Ruby中持续的重要性。"
  },
  {
    "id": "45968192",
    "title": "PSA syncthing-fork has changed owners",
    "url": "https://forum.syncthing.net/t/does-anyone-know-why-syncthing-fork-is-no-longer-available-on-github/25661?page=2",
    "summary": "This PSA addresses concerns surrounding the change of ownership of the \"syncthing-fork\" app. The author urges users to avoid spreading baseless theories about nefarious intent, emphasizing that there's no evidence to suggest any malicious activity targeting users. They express concern for the original owner, Catfriend1, thanking them for their contributions to the community.\n\nThe post advises a \"wait and see\" approach, suggesting that users focus on contributing to the project and coordinating efforts, referencing @nel0x as a potential point of contact.\n\nThe author dismisses potential concerns by pointing out:\n\n*   Battery issues have always been present.\n*   The significant changes in v2 could naturally lead to technical issues or increased user awareness of existing problems.\n*   The deletion or privatization of associated accounts doesn't align with the pattern of account breaches for malicious purposes, which would typically involve maintaining appearances.\n*   The open-source nature of the app allows for community review and verification of changes, with some users already actively auditing recent updates. They thank @katedickey for their work.\n\nEssentially, the author believes the situation is likely benign and encourages a calm, proactive approach focused on community collaboration and app scrutiny, rather than spreading unsubstantiated fears.\n",
    "chinese_title": "PSA：Syncthing-fork 已更换所有者",
    "chinese_summary": "本公告旨在消除围绕“syncthing-fork”应用所有权变更的疑虑。作者敦促用户避免散布关于恶意意图的毫无根据的猜测，强调没有证据表明存在针对用户的恶意活动。他们对原作者Catfriend1表示关切，并感谢他们对社区的贡献。\n\n该帖子建议采取“观望”态度，建议用户专注于为项目做贡献和协调工作，并提及@nel0x作为潜在的联系人。\n\n作者通过以下几点消除了潜在的担忧：\n\n*   电池问题一直存在。\n*   v2中的重大变化自然会导致技术问题或增加用户对现有问题的关注。\n*   关联帐户的删除或私有化不符合恶意目的的帐户泄露模式，通常恶意泄露会保持表面上的完整。\n*   该应用程序的开源性质允许社区审查和验证更改，一些用户已经在积极审计最近的更新。他们感谢@katedickey的工作。\n\n总而言之，作者认为情况可能是良性的，并鼓励采取冷静、积极的态度，专注于社区协作和应用程序审查，而不是散布未经证实的恐惧。"
  },
  {
    "id": "45954640",
    "title": "Project Gemini",
    "url": "https://geminiprotocol.net/",
    "summary": "Project Gemini aims to create a lightweight online space focused on text-based documents, prioritizing reader privacy, attention, and bandwidth. It envisions an interconnected electronic library, treating documents as a fundamental concept rather than an afterthought. Unlike projects focused on innovation or disruption, Gemini offers a simpler, more focused online experience, providing a respite from the complexities and distractions of the modern internet. The project isn't designed to replace existing technologies but rather to offer an alternative. The official website, geminiprotocol.net, provides more information through an FAQ, a video overview, news, documentation, and a history of the project, as well as a list of Gemini software. All content on the website is licensed under CC BY-NC-ND 4.0.\n",
    "chinese_title": "双子座计划",
    "chinese_summary": "双子座计划旨在创建一个轻量级的在线空间，专注于基于文本的文档，优先考虑读者的隐私、注意力和带宽。它设想一个互联的电子图书馆，将文档视为一个基本概念，而非事后补充。与专注于创新或颠覆的项目不同，双子座提供更简单、更专注的在线体验，提供一个从现代互联网的复杂性和干扰中解脱出来的场所。该项目并非旨在取代现有技术，而是提供一种替代方案。官方网站 geminiprotocol.net 通过常见问题解答、视频概述、新闻、文档和项目历史记录以及 Gemini 软件列表提供更多信息。网站上的所有内容均以 CC BY-NC-ND 4.0 许可协议发布。"
  },
  {
    "id": "45959780",
    "title": "Show HN: Parqeye – A CLI tool to visualize and inspect Parquet files",
    "url": "https://github.com/kaushiksrini/parqeye",
    "summary": "Parqeye is a command-line tool designed to help users inspect and visualize Parquet files directly from their terminal. It offers features like interactive data browsing with keyboard navigation, a schema explorer for inspecting column types and nested structures, and a metadata viewer for file-level information (version, creator, encoding). Users can also examine row group statistics and data distribution across groups.\n\nThe tool provides a tab-based interface allowing easy switching between data visualization, schema exploration, metadata viewing, and row group inspection. Installation is straightforward through direct download of pre-built binaries, building from source using Cargo, or installing directly from crates.io if you use Rust. Parqeye is released under the MIT License and was inspired by csvlens. Future development plans include lazy/streaming loading for larger files, filtering columns by value in the visualization tab, and the ability to read Parquet files from cloud storage like S3.\n",
    "chinese_title": "Show HN: Parqeye – 一个可视化和检查 Parquet 文件的 CLI 工具",
    "chinese_summary": "Parqeye 是一个命令行工具，旨在帮助用户直接从终端检查和可视化 Parquet 文件。它提供诸如使用键盘导航的交互式数据浏览、用于检查列类型和嵌套结构的模式浏览器以及用于文件级别信息（版本、创建者、编码）的元数据查看器等功能。用户还可以检查行组统计信息和跨组的数据分布。\n\n该工具提供一个基于选项卡的界面，可以轻松地在数据可视化、模式探索、元数据查看和行组检查之间切换。可以通过直接下载预构建的二进制文件、使用 Cargo 从源代码构建或直接从 crates.io 安装（如果您使用 Rust）来直接进行安装。Parqeye 在 MIT 许可下发布，其灵感来自 csvlens。未来的开发计划包括用于更大文件的惰性/流式加载、在可视化选项卡中按值过滤列以及读取来自 S3 等云存储的 Parquet 文件的能力。"
  },
  {
    "id": "45900425",
    "title": "Show HN: I built a synth for my daughter",
    "url": "https://bitsnpieces.dev/posts/a-synth-for-my-daughter/",
    "summary": "This \"Show HN\" post details the creation of a portable step-sequencer synthesizer built as a gift for the author's daughter. The synth features four sliders controlling notes in a looping sequence, an onboard synth module with a speaker, controls for tempo, volume, scale, pitch, and instrument, an OLED screen with visual feedback, and a custom 3D-printed enclosure.\n\nThe author, with no prior hardware experience, used this project as a learning opportunity, delving into microcontrollers, CAD, PCB design, and 3D printing. They started with an Arduino, potentiometers, and MIDI, progressing to an onboard synth module and an OLED screen. Challenges included limited RAM and laggy screen updates. Wokwi was used for virtual circuit building and testing.\n\nThe enclosure was designed using Fusion 360 and 3D-printed. Initial hand-wiring proved fragile, leading to the design and fabrication of a custom PCB through JLCPCB. Power supply issues with the initial 4 AA battery setup were addressed by switching to 3 AA batteries and an Adafruit Miniboost.\n\nThe author reflects on the project's success with their daughter and explores the potential for a small-scale product. They acknowledge the challenges of bringing a product to market, including regulatory hurdles, manufacturing costs, and the need for upfront capital. Future steps may include a more polished open-source version or a Kickstarter campaign. They invite feedback from individuals with experience in bringing small-run hardware to market.\n",
    "chinese_title": "展示一下：我为女儿做了个合成器",
    "chinese_summary": "这个“Show HN”帖子详细介绍了作者为一个女儿制作的便携式步进音序器合成器的过程。这个合成器具有四个滑块，用于控制循环序列中的音符；一个带有扬声器的板载合成器模块；用于控制速度、音量、音阶、音高和乐器的控制钮；一个带有视觉反馈的OLED屏幕；以及一个定制的3D打印外壳。\n\n作者没有硬件经验，将这个项目作为学习机会，深入研究了微控制器、CAD、PCB设计和3D打印。他们从Arduino、电位器和MIDI开始，逐步发展到板载合成器模块和OLED屏幕。挑战包括有限的RAM和滞后的屏幕更新。Wokwi被用于虚拟电路构建和测试。\n\n外壳使用Fusion 360设计并3D打印。最初的手工接线被证明很脆弱，导致通过JLCPCB设计和制造了定制PCB。最初的4节AA电池供电设置存在电源问题，通过切换到3节AA电池和一个Adafruit Miniboost解决了这个问题。\n\n作者反思了这个项目在其女儿身上的成功，并探索了小规模产品的潜力。他们承认将产品推向市场的挑战，包括监管障碍、制造成本和对前期资金的需求。未来的步骤可能包括一个更完善的开源版本或Kickstarter活动。他们邀请有小型硬件产品上市经验的人士提供反馈。"
  },
  {
    "id": "45930438",
    "title": "Raccoons are showing early signs of domestication",
    "url": "https://www.scientificamerican.com/article/raccoons-are-showing-early-signs-of-domestication/",
    "summary": "This article discusses research suggesting raccoons living in urban environments are showing early signs of domestication, specifically a shorter snout. The study, based on analyzing nearly 20,000 raccoon photos from iNaturalist, found that urban raccoons have snouts 3.5% shorter than their rural counterparts. This observation aligns with the \"domestication syndrome,\" where animals adapting to human environments exhibit physical and behavioral changes like reduced fear and altered morphology.\n\nThe article explains that domestication isn't always initiated by humans selectively breeding animals. It can begin when animals adapt to human-created environments, like trash-filled urban areas. Animals that are less fearful and better behaved around humans are more successful at accessing these resources and passing on their traits.\n\nThe shorter snout is linked to the \"neural crest cell\" hypothesis, which suggests mutations affecting these cells during embryonic development can lead to various domestication traits, including a shorter face and dampened fear responses. While further research is needed, this study provides evidence that wild animals, like raccoons, are evolving in response to living near humans. Researchers plan to investigate genetics and stress hormones to further explore the differences between urban and rural raccoons. The article concludes by advocating for the importance of supporting science journalism to ensure the continuation of impactful research and reporting.\n",
    "chinese_title": "浣熊正显现出早期驯化的迹象。",
    "chinese_summary": "城市浣熊或已现早期驯化迹象：一项研究发现城市浣熊的鼻子变短，文章探讨了相关研究。该研究分析了iNaturalist上的近两万张浣熊照片，发现城市浣熊的鼻子比乡村浣熊短3.5%。这一现象与“驯化综合征”相符，即动物在适应人类环境时，会表现出身体和行为上的变化，例如恐惧感降低和形态改变。\n\n文章解释说，驯化并不总是由人类选择性育种动物引起的。它可能始于动物适应人类创造的环境，如充满垃圾的城市地区。对人类恐惧感较小、行为更好的动物更容易获得这些资源并传递其特征。\n\n鼻子变短与“神经嵴细胞”假说有关，该假说认为，影响胚胎发育过程中这些细胞的突变可能导致各种驯化特征，包括面部变短和恐惧反应减弱。虽然还需要进一步的研究，但这项研究提供了证据，表明浣熊等野生动物正在进化，以适应在人类附近生活。研究人员计划调查遗传学和应激激素，以进一步探索城市和乡村浣熊之间的差异。文章最后倡导支持科学新闻，以确保具有影响力的研究和报道得以延续。"
  },
  {
    "id": "45959795",
    "title": "Windows 11 adds AI agent that runs in background with access to personal folders",
    "url": "https://www.windowslatest.com/2025/11/18/windows-11-to-add-an-ai-agent-that-runs-in-background-with-access-to-personal-folders-warns-of-security-risk/",
    "summary": "This article from Windows Latest discusses Microsoft's new experimental \"Agent Workspace\" feature in Windows 11, designed to integrate AI agents directly into the operating system. This feature allows AI agents to run in the background with their own isolated workspace, user account, and desktop. Critically, when enabled, these agents gain access to \"Known folders\" such as Desktop, Documents, Pictures, Music, and Videos, enabling them to perform tasks on the user's behalf.\n\nThe article explains that Agent Workspace is currently optional and off by default, available to Windows Insiders in the Dev and Beta Channels. It draws a comparison to ChatGPT's Agents, highlighting the goal of enabling AI to perform tasks autonomously like booking trips or managing files. While Microsoft claims this setup offers security and control through runtime isolation and scoped authorization, the article raises concerns about potential security risks, especially considering the access agents have to personal files.\n\nThe author contrasts Agent Workspace with Windows Sandbox, noting that while both offer isolation, Sandbox doesn't access personal user folders. The article emphasizes that enabling Agent Workspace grants the AI agents read and write access to specified user folders. Furthermore, the author points out the potential for performance issues due to agents constantly running in the background and the need for them to access user-installed applications. The article concludes by noting the feature's announcement followed criticism of Microsoft's AI push, and that the company insists it will continue to pursue AI integration, even as they promise to continue improving Windows for power users.\n",
    "chinese_title": "Windows 11新增AI代理，后台运行并可访问个人文件夹",
    "chinese_summary": "Windows 11中的AI代理工作区：潜在风险与自主性"
  },
  {
    "id": "45960922",
    "title": "LeJEPA: Provable and Scalable Self-Supervised Learning Without the Heuristics",
    "url": "https://arxiv.org/abs/2511.08544",
    "summary": "This arXiv article, \"LeJEPA: Provable and Scalable Self-Supervised Learning Without the Heuristics,\" introduces LeJEPA, a novel self-supervised learning approach based on Joint-Embedding Predictive Architectures (JEPAs). The authors, Randall Balestriero and Yann LeCun, present a comprehensive theory of JEPAs and propose a theoretically grounded training objective called Sketched Isotropic Gaussian Regularization (SIGReg).\n\nLeJEPA aims to address the ad-hoc nature of existing JEPAs by providing a principled framework. It identifies the isotropic Gaussian distribution as optimal for JEPA embeddings to minimize downstream prediction risk. SIGReg is then introduced to constrain embeddings towards this ideal distribution.\n\nThe benefits of LeJEPA include: a single trade-off hyperparameter, linear time and memory complexity, stability across different architectures and domains, the elimination of heuristics (like stop-gradient and teacher-student models), and a distributed training-friendly implementation.\n\nThe paper demonstrates LeJEPA's effectiveness across numerous datasets and architectures, achieving strong performance (e.g., 79% with a ViT-H/14 on ImageNet-1k linear evaluation). The authors highlight the simplicity and theoretical foundation of LeJEPA, hoping to promote self-supervised pre-training as a core area of AI research. A GitHub repository containing the code is provided.\n",
    "chinese_title": "LeJEPA：无需启发式的可证明且可扩展的自监督学习",
    "chinese_summary": "这篇arXiv文章“LeJEPA：无需启发式的可证明且可扩展的自监督学习”介绍了LeJEPA，一种基于联合嵌入预测架构（JEPA）的新型自监督学习方法。作者Randall Balestriero和Yann LeCun提出了关于JEPAs的全面理论，并提出了一个基于理论的训练目标，称为草图化各向同性高斯正则化（SIGReg）。\n\nLeJEPA旨在通过提供一个有原则的框架来解决现有JEPAs的临时性。它确定各向同性高斯分布是JEPA嵌入的最佳选择，以最大限度地降低下游预测风险。然后引入SIGReg来约束嵌入朝向这个理想的分布。\n\nLeJEPA的优势包括：单一的权衡超参数、线性时间和内存复杂度、跨不同架构和领域的稳定性、消除启发式方法（如停止梯度和教师-学生模型）以及分布式训练友好的实现。\n\n该论文展示了LeJEPA在众多数据集和架构上的有效性，实现了强大的性能（例如，在ImageNet-1k线性评估中使用ViT-H/14达到79%）。作者强调了LeJEPA的简单性和理论基础，希望将自监督预训练推广为人工智能研究的核心领域。提供了包含代码的GitHub存储库。"
  },
  {
    "id": "45958717",
    "title": "Run ancient UNIX on modern hardware",
    "url": "https://github.com/felipenlunkes/run-ancient-unix",
    "summary": "This document provides a guide to running ancient UNIX versions on modern systems like Linux, macOS, and FreeBSD using emulators and virtual machines. It supports UNIX versions for the PDP-11 (v1, v5, v7, and 2.11BSD) through the SIMH simulator, and Version 7 UNIX ported to x86 via QEMU.\n\nThe guide covers the necessary software requirements, including SIMH, QEMU, Bash, Python, wget, and Git, and provides installation instructions for Debian, Ubuntu, Fedora, FreeBSD, NetBSD, and OpenBSD. It details how to clone the repository, run the provided `run.sh` script, and install the required disk images.  It also mentions a Python frontend (RAU.py) for a more user-friendly experience, though only compatible with GNOME for now.\n\nThe document outlines the specific boot procedures for each UNIX version. Version 1 requires typing \"root\" at the login prompt. Version 5 requires typing \"unix\" at the \"@\" prompt, then \"root\" at the login. Version 7 needs \"boot\" followed by \"hp(0,0)unix\", and finally logging in as root. 2.11BSD requires simply pressing ENTER at the \"Boot from\" prompt.  It concludes by explaining how to end each simulation. The document also includes licensing and credit information for the various components used.\n",
    "chinese_title": "在现代硬件上运行古老的UNIX",
    "chinese_summary": "本指南介绍如何使用模拟器和虚拟机在现代系统（如Linux、macOS和FreeBSD）上运行古老的UNIX版本。它支持通过SIMH模拟器运行的PDP-11 UNIX版本（v1、v5、v7和2.11BSD），以及通过QEMU移植到x86的Version 7 UNIX。\n\n本指南涵盖必要的软件要求，包括SIMH、QEMU、Bash、Python、wget和Git，并提供Debian、Ubuntu、Fedora、FreeBSD、NetBSD和OpenBSD的安装说明。它详细说明了如何克隆存储库、运行提供的`run.sh`脚本，以及安装所需的磁盘镜像。它还提到一个Python前端（RAU.py），以提供更友好的用户体验，但目前仅与GNOME兼容。\n\n本指南概述了每个UNIX版本的特定启动过程。Version 1需要在登录提示符下键入“root”。Version 5需要在“@”提示符下键入“unix”，然后在登录时键入“root”。Version 7需要“boot”后跟“hp(0,0)unix”，最后以root身份登录。2.11BSD只需要在“Boot from”提示符下按ENTER键。最后，它解释了如何结束每个模拟。该文档还包括所使用各种组件的许可和致谢信息。"
  },
  {
    "id": "45954210",
    "title": "WeatherNext 2: Our most advanced weather forecasting model",
    "url": "https://blog.google/technology/google-deepmind/weathernext-2/",
    "summary": "Google's DeepMind and Google Research have introduced WeatherNext 2, a highly advanced AI weather forecasting model. This model generates forecasts eight times faster and with higher resolution (up to 1-hour increments) than its predecessor. It can produce hundreds of possible weather scenarios in under a minute using a single TPU, a task that would take hours on traditional supercomputers. WeatherNext 2 surpasses the original WeatherNext model in 99.9% of variables and lead times.\n\nThe improved performance comes from a new AI modeling approach called Functional Generative Network (FGN), which injects noise directly into the model, resulting in realistic and interconnected forecasts. This is especially valuable for predicting \"marginals\" (individual weather elements) and \"joints\" (complex, interconnected systems).\n\nWeatherNext 2's forecast data is now available in Earth Engine and BigQuery, and there's an early access program on Google Cloud's Vertex AI. Google has already integrated WeatherNext technology to improve weather forecasts in Search, Gemini, Pixel Weather, and Google Maps Platform's Weather API, with Google Maps integration coming soon. Google plans to expand access to WeatherNext 2 further, integrating new data sources, and empowering researchers, developers, and businesses.\n",
    "chinese_title": "WeatherNext 2：我们最先进的天气预报模型",
    "chinese_summary": "谷歌DeepMind与谷歌研究院推出WeatherNext 2，一种高度先进的AI天气预报模型。该模型生成预报的速度比其前代产品快八倍，分辨率更高（最高可达1小时增量）。它可以在不到一分钟的时间内使用单个TPU生成数百种可能的天气情景，这项任务在传统超级计算机上需要花费数小时。WeatherNext 2在99.9%的变量和提前期方面超越了原始WeatherNext模型。\n\n性能的提升源于一种名为功能生成网络（FGN）的全新AI建模方法，该方法直接将噪声注入模型，从而产生逼真且相互关联的预报。这对于预测“边缘变量”（个别天气要素）和“联合变量”（复杂的、相互关联的系统）尤其有价值。\n\nWeatherNext 2的预报数据现已在Earth Engine和BigQuery中提供，并且Google Cloud的Vertex AI上有一个早期访问计划。谷歌已经集成了WeatherNext技术，以改善搜索、Gemini、Pixel Weather和Google Maps Platform的Weather API中的天气预报，Google Maps集成即将推出。谷歌计划进一步扩展对WeatherNext 2的访问权限，集成新的数据源，并赋能研究人员、开发者和企业。"
  },
  {
    "id": "45963001",
    "title": "Comparing Android Alternatives: Lineage OS, ∕E∕OS, and Graphene OS",
    "url": "https://kevinboone.me/lineage-eos-graphene.html",
    "summary": "This article compares three open-source Android-derived firmwares: Lineage OS, /e/OS, and Graphene OS, highlighting their similarities and differences in terms of privacy, security, and convenience. All are based on AOSP and require similar installation skills.\n\n**Lineage OS:** The oldest and most established, Lineage offers a minimal, bloat-free experience with good battery life. It doesn't include Google Play Services or MicroG, requiring users to find their own services and apps. While providing decent privacy, it lacks advanced security hardening and uses the Chromium WebView implementation which has minor privacy leaks. It is a good choice for technically proficient users who prioritize privacy and a clean OS, using apps that do not need Google services.\n\n**/e/OS:** A derivative of Lineage, /e/OS focuses on simplicity and fixes some minor privacy leaks. It's associated with Murena, a commercial service provider. It includes MicroG for easier commercial app installation, but this won't suit everyone. Being derived from Lineage, it is slightly less up-to-date. It's a good option for users wanting an improved privacy and less bloatware who might use Murena's services, providing a gentler introduction to de-Googling.\n\n**Graphene OS:** Different from the other two, Graphene emphasizes security hardening and supports only a limited number of Google Pixel devices. The installation process is similar to installing stock Android. It offers auditing and attestation services for strong security against attacks. It uniquely allows running real Google Play Services within a privacy sandbox, giving granular permission control. However, the security hardening can cause quirks and incompatibilities with certain hardware. The platform does not encourage modification. It is suitable for users with high-security needs who want to run commercial apps safely, willing to deal with side effects.\n\nIn conclusion, the article suggests that any of the three options are an improvement over the vendor's default firmware, but users should consider their needs for privacy, compatibility, and convenience to choose the best fit.\n",
    "chinese_title": "Android替代系统的比较：Lineage OS、/E/OS和Graphene OS",
    "chinese_summary": "本文比较了三个基于安卓的开源固件：Lineage OS、/e/OS 和 Graphene OS，重点介绍了它们在隐私、安全和便利性方面的异同。它们都基于 AOSP，并且需要相似的安装技能。\n\n**Lineage OS：** 作为最老牌的系统，Lineage 提供了极简、无预装软件且电池续航良好的体验。它不包含 Google Play 服务或 MicroG，需要用户自行寻找服务和应用程序。虽然提供了不错的隐私性，但它缺乏高级安全强化，并使用存在轻微隐私泄露的 Chromium WebView 实现。对于注重隐私和纯净操作系统，且使用的应用程序不需要 Google 服务的技术熟练型用户来说，这是一个不错的选择。\n\n**/e/OS：** /e/OS 是 Lineage 的一个衍生版本，专注于简洁性并修复了一些轻微的隐私泄露问题。它与商业服务提供商 Murena 相关联。它包含 MicroG，方便安装商业应用程序，但这并不适合所有人。由于衍生自 Lineage，它的更新略微滞后。对于想要改善隐私和减少预装软件，并且可能使用 Murena 服务的用户来说，这是一个不错的选择，为去谷歌化提供了一个更温和的入门方式。\n\n**Graphene OS：** 与前两者不同，Graphene 强调安全强化，并且仅支持有限数量的 Google Pixel 设备。安装过程与安装原生 Android 类似。它提供审计和证明服务，以实现强大的安全性来抵御攻击。它独特地允许在隐私沙箱中运行真正的 Google Play 服务，从而实现细粒度的权限控制。然而，安全强化可能会导致某些硬件出现问题和不兼容。该平台不鼓励修改。它适合具有高安全性需求，希望安全运行商业应用程序，并且愿意接受副作用的用户。\n\n总而言之，本文认为这三个选项中的任何一个都比厂商的默认固件更好，但用户应考虑他们对隐私、兼容性和便利性的需求，以选择最合适的方案。"
  },
  {
    "id": "45955565",
    "title": "How when AWS was down, we were not",
    "url": "https://authress.io/knowledge-base/articles/2025/11/01/how-we-prevent-aws-downtime-impacts",
    "summary": "This article details how Authress, a company providing authentication and authorization services, maintains a five-nines (99.999%) SLA even when relying on potentially unreliable infrastructure and services like AWS, particularly in regions like us-east-1 that are prone to outages.\n\nThe author emphasizes that uptime is critical for Authress as a failure on their end directly impacts their customers' applications. They illustrate this point by examining how a seemingly simple architecture can quickly become unreliable due to inherent failure rates of components and third-party services. The article highlights that even AWS services don't guarantee a five-nines SLA.\n\nThe core of the article revolves around calculating the required reliability of third-party dependencies and the role of retries in achieving desired uptime. Through probability equations, the author demonstrates how many retries are needed based on the failure rate of a third-party component. However, they also emphasize the importance of the retry handler's reliability, as it too can contribute to overall failure.\n\nThe article concludes that a highly reliable retry handler is essential, but even then, there's a limit to the number of retries that can be performed before the retry handler itself violates the SLA. It establishes that a third-party service must have a minimum level of reliability for it to be used safely within Authress's architecture to maintain their five-nines SLA.\n",
    "chinese_title": "当AWS宕机时，我们如何幸免于难",
    "chinese_summary": "Authress 如何在不可靠基础设施上实现 99.999% SLA\n\n或者\n\nAuthress：如何在不可靠基础设施上实现 99.999% 的 SLA"
  },
  {
    "id": "45953977",
    "title": "Show HN: ESPectre – Motion detection based on Wi-Fi spectre analysis",
    "url": "https://github.com/francescopace/espectre",
    "summary": "ESPectre is an experimental motion detection system using Wi-Fi spectral analysis (CSI) with Home Assistant integration, offering a privacy-respecting alternative to cameras and microphones. It uses existing 2.4GHz Wi-Fi routers and inexpensive ESP32-S3 devices (~€10) to detect movement by analyzing disturbances in Wi-Fi signals.\n\nInstead of machine learning, ESPectre employs a mathematical approach, extracting 10 statistical, spatial, and temporal features from CSI data in real-time. This eliminates the need for ML training and enables out-of-the-box movement detection, while the extracted features lay a foundation for future ML enhancements like people counting or activity recognition.\n\nSetup requires basic command-line knowledge and ESP-IDF skills, taking around 30-45 minutes for initial setup. The sensor listens to Wi-Fi signal changes caused by movement, working through walls without requiring wearables or router modifications.\n\nThe system is designed with privacy in mind, collecting only anonymous data about Wi-Fi channel characteristics, not personal information. However, ethical use is emphasized, requiring user consent and responsible deployment to avoid non-consensual monitoring.\n\nThe system architecture utilizes a 2-state (IDLE/MOTION) segmentation model with optional filtering and feature extraction applied to the CSI data. Multiple sensors can be deployed across different rooms, each publishing to separate MQTT topics for individual monitoring and automation within Home Assistant.\n",
    "chinese_title": "Show HN: ESPectre – 基于 Wi-Fi 频谱分析的运动检测",
    "chinese_summary": "ESPectre 是一款实验性的运动检测系统，它利用 Wi-Fi 频谱分析（CSI）并与 Home Assistant 集成，提供了一种尊重隐私的摄像头和麦克风替代方案。它使用现有的 2.4GHz Wi-Fi 路由器和廉价的 ESP32-S3 设备（约 10 欧元），通过分析 Wi-Fi 信号的扰动来检测运动。\n\nESPectre 没有采用机器学习，而是采用数学方法，实时从 CSI 数据中提取 10 个统计、空间和时间特征。这消除了对 ML 训练的需求，并实现了开箱即用的运动检测，同时提取的特征也为未来 ML 增强功能（如人数统计或活动识别）奠定了基础。\n\n设置需要基本的命令行知识和 ESP-IDF 技能，首次设置大约需要 30-45 分钟。该传感器监听由运动引起的 Wi-Fi 信号变化，可以穿透墙壁工作，无需可穿戴设备或路由器修改。\n\n该系统在设计时考虑了隐私，仅收集有关 Wi-Fi 通道特征的匿名数据，不收集个人信息。然而，我们强调道德使用，需要用户同意和负责任的部署，以避免未经同意的监控。\n\n系统架构采用 2 状态（空闲/运动）分割模型，并可选择对 CSI 数据应用过滤和特征提取。多个传感器可以部署在不同的房间中，每个传感器发布到单独的 MQTT 主题，以便在 Home Assistant 中进行单独监控和自动化。"
  },
  {
    "id": "45938517",
    "title": "Show HN: Continuous Claude – run Claude Code in a loop",
    "url": "https://github.com/AnandChowdhary/continuous-claude",
    "summary": "Continuous Claude is a CLI tool designed to automate multi-step coding projects by running Claude Code in a continuous loop. It addresses the limitations of one-shot AI coding tools by maintaining persistent context across iterations, allowing for self-criticism and progressive improvement.\n\nThe tool operates by creating branches, running Claude Code to generate commits, creating pull requests, monitoring CI checks, and merging on success (or discarding on failure). A shared Markdown file (`SHARED_TASK_NOTES.md`) acts as external memory, enabling Claude to track progress and maintain context between runs. This promotes self-improvement as the system learns through iteration.\n\nInspired by GitHub Next's Continuous AI, Continuous Claude facilitates specialized agents for development, testing, and refactoring, and also draws parallels to economic concepts like \"radiation of probabilities\" for fault tolerance. It can be used for tasks like fixing post-update breaking changes or managing large refactoring tasks over multiple pull requests.\n\nThe CLI tool, installable via a provided script, requires Claude Code, GitHub CLI, and jq. Users can specify prompts, maximum runs or cost, repository details, and other configurations. Parallel execution is supported using Git worktrees. The tool automates the PR lifecycle, streamlining code changes through to merged commits with continuous feedback and improvement.\n",
    "chinese_title": "展示HN：持续克劳德 – 循环运行克劳德代码",
    "chinese_summary": "Continuous Claude：通过持续循环运行 Claude Code 来自动化多步骤编码项目的 CLI 工具。它通过在迭代过程中保持持久上下文来解决一次性 AI 编码工具的局限性，从而实现自我批评和渐进式改进。\n\n该工具通过创建分支、运行 Claude Code 生成提交、创建拉取请求、监控 CI 检查，并在成功时合并（或在失败时丢弃）来运作。一个共享的 Markdown 文件 (`SHARED_TASK_NOTES.md`) 充当外部记忆，使 Claude 能够跟踪进度并在运行之间保持上下文。这促进了自我改进，因为系统通过迭代学习。\n\n受 GitHub Next 的 Continuous AI 启发，Continuous Claude 促进了开发、测试和重构的专业代理，并且还借鉴了经济学概念，如“概率辐射”来实现容错。它可以用于诸如修复更新后出现的重大更改或通过多个拉取请求管理大型重构任务等任务。\n\n该 CLI 工具可通过提供的脚本安装，需要 Claude Code、GitHub CLI 和 jq。用户可以指定提示、最大运行次数或成本、存储库详细信息和其他配置。支持使用 Git 工作区进行并行执行。该工具自动化了 PR 生命周期，通过持续的反馈和改进，简化了代码更改直至合并提交。"
  },
  {
    "id": "45890170",
    "title": "Practice answers with yourself. I made a thing that I didn't want to pay for",
    "url": "https://look.imwithstupid.fun",
    "summary": "This article describes a simple, likely web-based, application the author created for practicing answers to questions. The author mentions they built this tool because they didn't want to pay for a similar existing solution.\n\nThe application centers around recording yourself using a camera. Functionality includes:\n\n*   **Camera Selection:** Users can select from available cameras connected to their device.\n*   **Camera Refresh:** A button allows refreshing the list of available cameras, likely to handle situations where a camera is connected after the application loads.\n*   **Recording Storage & Playback:** Recorded videos are saved and can be accessed and reviewed within the application in \"Your Recordings\".\n*   **Empty State:** The application indicates when there are no recordings yet and encourages users to start recording.\n\nIn essence, it's a DIY video recording tool designed specifically for practicing and reviewing answers, providing basic camera controls and recording management.\n",
    "chinese_title": "和自己练习回答。我做了一个不想花钱的东西。",
    "chinese_summary": "本文介绍了一个简单的，可能是基于网络的，作者创建的用于练习问题回答的应用程序。作者提到，他们构建这个工具是因为不想为类似的现有解决方案付费。\n\n该应用程序的核心是使用摄像头录制自己。功能包括：\n\n*   **摄像头选择：** 用户可以从连接到其设备的可用摄像头中进行选择。\n*   **摄像头刷新：** 一个按钮允许刷新可用摄像头的列表，可能用于处理在应用程序加载后连接摄像头的情况。\n*   **录制存储与回放：** 录制的视频会被保存，并可以在应用程序内的“我的录制”中访问和查看。\n*   **空状态：** 应用程序会在没有录制内容时进行提示，并鼓励用户开始录制。\n\n本质上，这是一个DIY视频录制工具，专为练习和回顾答案而设计，提供基本的摄像头控制和录制管理。"
  },
  {
    "id": "45954140",
    "title": "Aldous Huxley predicts Adderall and champions alternative therapies",
    "url": "https://angadh.com/inkhaven-7",
    "summary": "This article discusses Aldous Huxley's final lecture at MIT, where he championed non-pharmacological methods for self-actualization, or realizing one's \"desirable potentialities.\" He advocates for alternative therapies like Alexander Technique and Gestalt therapy, arguing they can psychologically cultivate positive qualities, contrasting this with genetic engineering or pharmacological enhancements like Adderall (which the author suggests Huxley predicted).\n\nHuxley believed these therapies are effective because they are adaptable to individual personalities, aligning with his view that there's no single ideal human type. He draws parallels between the Three Yogas of the Bhagavad Gita and William Sheldon's somatotypes, though the author finds this comparison tenuous. He also connects Gestalt therapy's imaginative training to strategies for managing anxiety.\n\nThe author, an educator, resonates with Huxley's call for personalized education that caters to individual variations, criticizing the current standardized system. While impressed by Huxley's eloquence, the author questions if the lecture has a clear thesis, describing it more as a survey of techniques supported by anecdotal evidence and influential endorsements. The next post will delve into Huxley's perspective on the role of the humanities in self-actualization and will also include the author's concluding thoughts.\n",
    "chinese_title": "阿道司·赫胥黎预言阿得拉，并提倡替代疗法。",
    "chinese_summary": "本文探讨了阿道司·赫胥黎在麻省理工学院的最后一次讲座，他在讲座中提倡非药物的自我实现方法，或实现个人“理想的潜能”。他提倡亚历山大技巧和格式塔疗法等替代疗法，认为它们可以从心理上培养积极的品质，这与基因工程或 Adderall 等药物增强形成对比（作者认为赫胥黎对此有所预见）。\n\n赫胥黎认为这些疗法之所以有效，是因为它们适应个人性格，这与他认为不存在单一理想人类类型的观点相符。他将《薄伽梵歌》中的三种瑜伽与威廉·谢尔顿的体型联系起来，尽管作者认为这种比较站不住脚。他还将格式塔疗法的想象力训练与管理焦虑的策略联系起来。\n\n作者是一位教育家，他对赫胥黎呼吁的迎合个体差异的个性化教育产生了共鸣，并批评了当前的标准化体系。作者对赫胥黎的口才印象深刻，但质疑该讲座是否有一个明确的论点，更多地将其描述为对各种技术的调查，这些技术得到轶事证据和有影响力人士的支持。下一篇文章将深入探讨赫胥黎关于人文学科在自我实现中的作用的观点，并包括作者的结论性思考。"
  },
  {
    "id": "45955889",
    "title": "A new book about the origins of Effective Altruism",
    "url": "https://newrepublic.com/article/202433/happened-effective-altruism",
    "summary": "This article explores the origins and evolution of Effective Altruism (EA) through an interview with David Edmonds, author of \"Death in a Shallow Pond,\" a book about the movement's origins. EA began with Peter Singer's influential \"drowning child\" thought experiment, arguing for a moral obligation to alleviate suffering globally, regardless of proximity. Inspired by Singer, Oxford philosophers Toby Ord and Will MacAskill launched Giving What We Can and 80,000 Hours, organizations aimed at maximizing impact through charitable giving and career choices.\n\nEdmonds emphasizes Singer's foundational role, highlighting his utilitarian perspective that prioritizes maximizing well-being for all, even at personal sacrifice. The movement's growth attracted diverse individuals, including Silicon Valley figures, and expanded its focus to areas like animal rights and long-term existential risks.\n\nThe article discusses criticisms of EA, including its individualistic approach to systemic problems and potential for neglecting structural inequalities. Edmonds counters that EA proponents are open to supporting structural change if it proves more effective than direct charitable donations.\n\nRecent scandals, particularly the involvement of Sam Bankman-Fried, who was convicted of fraud, have damaged EA's reputation. However, Edmonds believes the movement is learning from these experiences and moving towards greater diversification of funding and a broader alignment of values. He suggests that EA is navigating an increasingly polarized political landscape by remaining pragmatic and focusing on its core mission of effectively improving lives.\n",
    "chinese_title": "有效利他主义起源新书",
    "chinese_summary": "本文通过对《浅池之死》作者大卫·埃德蒙兹的采访，探讨了有效利他主义（EA）的起源和演变。《浅池之死》是一本关于该运动起源的书。有效利他主义始于彼得·辛格颇具影响力的“溺水儿童”思想实验，该实验认为，无论距离远近，我们都有道义上的义务去减轻全球范围内的苦难。受辛格的启发，牛津大学哲学家托比·奥德和威尔·麦卡斯基尔发起了“尽我所能”和“八万小时”这两个组织，旨在通过慈善捐赠和职业选择来实现影响力的最大化。\n\n埃德蒙兹强调了辛格的基础性作用，突出了他功利主义的观点，即优先为所有人最大限度地提高福祉，即使是以个人牺牲为代价。该运动的壮大吸引了包括硅谷人士在内的不同个体，并将其关注点扩展到动物权利和长期存在的风险等领域。\n\n本文讨论了对有效利他主义的批评，包括其解决系统性问题的个人主义方法以及可能忽视结构性不平等的问题。埃德蒙兹反驳说，有效利他主义的支持者愿意支持结构性变革，如果它被证明比直接慈善捐赠更有效。\n\n最近的丑闻，特别是因欺诈罪被定罪的萨姆·班克曼-弗里德的参与，损害了有效利他主义的声誉。然而，埃德蒙兹认为，该运动正在从这些经验中学习，并朝着资金更加多元化和价值观更广泛统一的方向发展。他认为，有效利他主义正在通过保持务实和专注于其有效改善生活这一核心使命，在一个日益两极分化的政治环境中航行。"
  },
  {
    "id": "45953883",
    "title": "Jeff Bezos creates A.I. startup where he will be co-chief executive",
    "url": "https://www.nytimes.com/2025/11/17/technology/bezos-project-prometheus.html",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "杰夫·贝佐斯创建人工智能初创公司，并将担任联合首席执行官。",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "45888805",
    "title": "Show HN: Reversing a Cinema Camera's Peripherals Port",
    "url": "https://3nt3.de/blog/reversing-fs7-comms",
    "summary": "This \"Show HN\" post details the author's project of reverse-engineering the peripherals port on a Sony PXW-FS7 cinema camera to add custom buttons. Frustrated by the inaccessibility of certain buttons when not using the camera's side grip, the author embarked on a mission to create a custom solution.\n\nUsing an oscilloscope and later a logic analyzer, they discovered the camera uses a UART-like serial protocol at 9600 baud, utilizing an open-drain bus. By analyzing the signal changes when buttons on the grip were pressed, they identified unique identifiers for each button.\n\nInitially, they used an STM32 F-Series board to simulate the button presses. They wrote Rust code to send the correct byte sequences to the camera, effectively emulating the grip's functionality.\n\nTo create a more practical solution, the author designed a custom PCB based on a WCH32V003 microcontroller due to its low cost. The PCB was designed to fit on the camera's top handle crossbar. After overcoming several hardware issues like floating reset and ground pins, the author successfully ported the Rust code to the WCH32V003.\n\nFinally, they designed a 3D-printed housing and clamp to mount the PCB to a 15mm camera rod, making the custom buttons accessible on the top handle. The project is still ongoing, with future plans to address issues with the audio jack and potentially reverse-engineer more button IDs. The Git repository with code is also included.\n",
    "chinese_title": "展示HN：逆向一台电影摄影机的外围端口",
    "chinese_summary": "这个“Show HN”帖子详细介绍了作者逆向工程索尼PXW-FS7电影摄影机外围端口，以添加自定义按钮的项目。由于不使用相机侧手柄时某些按钮难以触及，作者开始了一项创建自定义解决方案的任务。\n\n他们使用示波器，后来又使用逻辑分析仪，发现该相机使用类似UART的串行协议，波特率为9600，并使用开漏总线。通过分析握柄上的按钮被按下时的信号变化，他们识别出每个按钮的唯一标识符。\n\n最初，他们使用 STM32 F 系列板来模拟按钮按下。他们编写了 Rust 代码以将正确的字节序列发送到相机，从而有效地模拟了握柄的功能。\n\n为了创建更实用的解决方案，作者基于低成本的 WCH32V003 微控制器设计了一个自定义 PCB。该PCB的设计目的是安装在相机的顶部手柄横杆上。在克服了几个硬件问题，如浮动复位和接地引脚后，作者成功地将 Rust 代码移植到 WCH32V003。\n\n最后，他们设计了一个 3D 打印的外壳和夹具，将 PCB 安装到 15 毫米的相机杆上，从而使自定义按钮可以在顶部手柄上使用。该项目仍在进行中，未来的计划包括解决音频插孔的问题，并可能逆向工程更多的按钮 ID。代码的 Git 存储库也包含在内。"
  },
  {
    "id": "45944158",
    "title": "Astrophotographer snaps skydiver falling in front of the sun",
    "url": "https://www.iflscience.com/the-fall-of-icarus-you-have-never-seen-an-astrophotography-picture-like-this-81570",
    "summary": "Astrophotographer Andrew McCarthy and skydiver Gabriel C. Brown collaborated to create a stunning image titled \"The Fall of Icarus,\" showing Brown skydiving in front of the sun. The image, captured in hydrogen alpha light, reveals the sun's turbulent hydrogen layer and neatly silhouettes Brown against the bubbling surface, perfectly framed between sunspots.\n\nThe collaboration was born out of a conversation between McCarthy and Brown about incorporating skydiving into astrophotography. The process was meticulously planned, involving coordinated communication between McCarthy, Brown, and a paramotor pilot to align the jump with the sun for the perfect shot. McCarthy used multiple cameras and guided the pilot based on the shadow's position, making adjustments to the aircraft's trajectory. It took six attempts, with several malfunctions hindering the initial tries, before they achieved the desired alignment. The final result is described as a \"masterpiece\" and \"phenomenal piece,\" showcasing the intersection of astrophotography and skydiving. Limited edition prints of McCarthy's astrophotography are available for purchase on his website.\n",
    "chinese_title": "天文摄影师拍到跳伞者在太阳前坠落",
    "chinese_summary": "天体摄影师Andrew McCarthy和跳伞运动员Gabriel C. Brown合作创作了一幅名为“伊卡洛斯之陨”的惊艳照片，展示了Brown在太阳前跳伞的景象。这张照片在氢α光下拍摄，揭示了太阳湍流的氢层，并将Brown的身影整齐地勾勒在沸腾的表面上，完美地镶嵌在太阳黑子之间。\n\n这次合作源于McCarthy和Brown之间关于将跳伞融入天体摄影的对话。整个过程经过精心策划，涉及McCarthy、Brown和一名动力滑翔伞飞行员之间的协调沟通，以便将跳伞与太阳对齐，从而获得完美的照片。McCarthy使用了多个相机，并根据阴影的位置引导飞行员，调整飞机的飞行轨迹。他们尝试了六次，最初几次由于多次故障而受阻，最终才实现了所需的对齐。最终的结果被描述为“杰作”和“非凡的作品”，展示了天体摄影和跳伞的交汇。McCarthy天体摄影的限量版印刷品可在他的网站上购买。"
  },
  {
    "id": "45950408",
    "title": "People are using iPad OS features on their iPhones",
    "url": "https://idevicecentral.com/ios-customization/how-to-enable-ipad-features-like-multitasking-stage-manager-on-iphone-via-mobilegestalt/",
    "summary": "This article details how to enable iPadOS features like Stage Manager and multitasking on iPhones by exploiting a recently discovered sandbox escape vulnerability. The exploit allows users to modify the `MobileGestalt.Plist` file, which contains device configuration information, including device type and supported features.\n\nDeveloper Duy Tran demonstrated this by enabling iPad features on an iPhone 17 Pro Max. The exploit, affecting iOS versions up to iOS 26.1 and iOS 26.2 Beta 1, leverages a crafted database to bypass sandbox restrictions and write to normally protected paths, including the `MobileGestalt.Plist` file.\n\nThe process involves obtaining the `MobileGestalt.Plist` file (using an Xcode app to read the file), identifying specific encrypted keys within the file that control iPad-specific features (like \"Device is an iPad\"), and then modifying these keys to activate the desired functionalities. A crucial step involves finding the offset of the encrypted key \"DeviceClassNumber\" within the `libmobilegestalt.dylib` file using a custom SwiftUI app that dlopens the dylib. A Python script, based on Duy's previous work, is then used to write the correct iPad device class to the plist, adding the required iPad feature keys to the CacheExtra section.\n\nThe author provides code snippets for both the SwiftUI app used to find the offset and the Python script modifications to enable the iPad features. The process can be unstable, requiring multiple attempts. After successful modification and reboot, iPad features become accessible on the iPhone. The article also includes instructions for setting up the necessary Python environment.\n",
    "chinese_title": "人们正在iPhone上使用iPad OS的功能。",
    "chinese_summary": "本文详细介绍了如何通过利用最近发现的沙盒逃逸漏洞，在 iPhone 上启用 iPadOS 功能（如台前调度和多任务处理）。该漏洞允许用户修改 `MobileGestalt.Plist` 文件，该文件包含设备配置信息，包括设备类型和支持的功能。\n\n开发者 Duy Tran 通过在一台 iPhone 17 Pro Max 上启用 iPad 功能演示了这一点。该漏洞影响 iOS 版本高达 iOS 26.1 和 iOS 26.2 Beta 1，利用精心制作的数据库绕过沙盒限制，并写入通常受保护的路径，包括 `MobileGestalt.Plist` 文件。\n\n该过程包括获取 `MobileGestalt.Plist` 文件（使用 Xcode 应用程序读取该文件），识别文件中控制 iPad 特定功能（如“Device is an iPad”）的特定加密密钥，然后修改这些密钥以激活所需的功能。一个关键步骤是使用自定义 SwiftUI 应用程序（该程序会 dlopens 该 dylib），在 `libmobilegestalt.dylib` 文件中找到加密密钥“DeviceClassNumber”的偏移量。然后，使用基于 Duy 之前工作的 Python 脚本将正确的 iPad 设备类别写入 plist，并将所需的 iPad 功能密钥添加到 CacheExtra 部分。\n\n作者提供了用于查找偏移量的 SwiftUI 应用程序和用于启用 iPad 功能的 Python 脚本修改的代码片段。该过程可能不稳定，需要多次尝试。成功修改和重启后，iPad 功能可在 iPhone 上访问。本文还包括设置必要 Python 环境的说明。"
  },
  {
    "id": "45950408",
    "title": "People are using iPad OS features on their iPhones",
    "url": "https://idevicecentral.com/ios-customization/how-to-enable-ipad-features-like-multitasking-stage-manager-on-iphone-via-mobilegestalt/",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "人们正在 iPhone 上使用 iPad OS 的功能。",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "45953568",
    "title": "The time has finally come for geothermal energy",
    "url": "https://www.newyorker.com/magazine/2025/11/24/why-the-time-has-finally-come-for-geothermal-energy",
    "summary": "This article highlights the growing potential of geothermal energy, drawing on Iceland's success as a prime example. Iceland, once heavily reliant on fossil fuels, now derives over a quarter of its electricity from geothermal sources. The article explains the basic process of harnessing geothermal energy, from shallow wells for direct heating to deeper wells for electricity generation using steam-powered turbines.\n\nThe story delves into the Iceland Deep Drilling Project (I.D.D.P.), which accidentally tapped into magma, creating the hottest and most powerful geothermal well in the world, albeit one that ultimately failed due to corrosion. While challenges exist, particularly in the upfront costs and longevity of wells, the article emphasizes that geothermal energy is a carbon-free, 24/7, weather-independent energy source.\n\nDespite being historically overlooked, geothermal energy is experiencing a resurgence, with significant investments from tech companies like Google, Meta, Microsoft, and Amazon. The article notes the increasing bipartisan support, with both the Biden and Trump administrations offering incentives. It also underscores the importance of learning from past research, like the Los Alamos project in the 1970s, which explored geothermal systems beyond volcanic areas. Overall, the article champions geothermal energy as an affordable and enduring solution for meeting humanity's energy needs, drawing a contrast to fossil fuels and other less sustainable options.\n",
    "chinese_title": "地热能源的时代终于来临",
    "chinese_summary": "本文重点介绍了地热能源日益增长的潜力，并以冰岛的成功为例。冰岛曾经严重依赖化石燃料，现在超过四分之一的电力来自地热资源。文章解释了利用地热能的基本过程，从用于直接供暖的浅层井到用于使用蒸汽动力涡轮机发电的深层井。\n\n故事深入探讨了冰岛深层钻探项目（I.D.D.P.），该项目意外地钻探到岩浆，创造了世界上最热、最强大的地热井，尽管该井最终因腐蚀而失效。尽管存在挑战，尤其是在前期成本和井的寿命方面，但文章强调地热能是一种无碳、全天候、不受天气影响的能源。\n\n尽管历史上被忽视，但地热能正在复兴，谷歌、Meta、微软和亚马逊等科技公司进行了大量投资。文章指出，两党支持日益增加，拜登和特朗普政府都提供了激励措施。它还强调了学习过去研究的重要性，例如 20 世纪 70 年代洛斯阿拉莫斯项目，该项目探索了火山地区以外的地热系统。总而言之，本文倡导将地热能作为满足人类能源需求的经济且持久的解决方案，并将其与化石燃料和其他可持续性较差的选择形成对比。"
  },
  {
    "id": "45967654",
    "title": "Widespread Cloudflare outage blamed on mysterious traffic spike",
    "url": "https://arstechnica.com/tech-policy/2025/11/widespread-cloudflare-outage-blamed-on-mysterious-traffic-spike/",
    "summary": "A widespread Cloudflare outage on Tuesday morning disrupted access to major platforms like X and ChatGPT, impacting a significant portion of the internet. Cloudflare initially cited an \"internal service degradation\" but later attributed the issue to a spike in unusual traffic that overloaded a configuration file managing threat traffic, causing a software crash. The company clarified that the incident was not the result of an attack.\n\nWhile a fix was implemented, some customers experienced continued issues, and services were expected to fully return to normal within hours. The outage also impacted other services like Amazon, Spotify, Zoom, Uber, and Azure, according to DownDetector.\n\nCloudflare acknowledged the severity of the outage, apologized for the disruption, and committed to learning from the incident. A blog post with more details is expected later in the day. This event follows other recent major outages, including an Amazon Web Services (AWS) disruption last month, highlighting concerns about the internet's fragility due to reliance on a few key service providers. Cloudflare's stock price briefly dropped by 3% during the outage.\n",
    "chinese_title": "广泛的Cloudflare中断归咎于神秘的流量激增",
    "chinese_summary": "周二上午，Cloudflare大范围中断导致X和ChatGPT等主要平台无法访问，影响了互联网的很大一部分。Cloudflare最初称之为“内部服务降级”，但后来将问题归因于异常流量激增，导致管理威胁流量的配置文件过载，引发软件崩溃。该公司澄清说，该事件并非攻击所致。\n\n虽然已实施修复，但一些客户仍然遇到问题，预计服务将在数小时内完全恢复正常。根据DownDetector的数据，此次中断还影响了亚马逊、Spotify、Zoom、Uber和Azure等其他服务。\n\nCloudflare承认此次中断的严重性，对中断表示歉意，并承诺从事件中吸取教训。预计当天晚些时候会发布一篇包含更多细节的博客文章。继上个月亚马逊网络服务（AWS）中断之后，此次事件再次引发了人们对互联网脆弱性的担忧，因为互联网依赖于少数关键服务提供商。Cloudflare的股价在中断期间短暂下跌了3%。"
  },
  {
    "id": "45901379",
    "title": "“One Student One Chip” Course Homepage",
    "url": "https://ysyx.oscc.cc/docs/en/",
    "summary": "The \"One Student One Chip\" v24.07 course homepage provides resources for learning about processor design, RISC-V instruction set, and related tools. Live teaching sessions begin in September 2025. The course is structured into stages (F, E, D, C, B, A, S), each covering specific topics with estimated completion times ranging from 0 to 20 hours. These estimates assume an \"intermediate-level\" learner with coding and debugging experience. Beginners should expect to spend significantly more time.\n\nLearning resources include course handouts, slides, and videos accessible via icons. The course uses C language programming extensively and explores hardware description languages, Linux system usage, and the process from C code to tapeout-ready layout. Specific tasks include installing Logisim, understanding digital circuits, building a simple RISC-V processor, debugging, and exploring advanced concepts like caching and virtual memory. The course also emphasizes practical application through projects like PA1 and NEMU implementation.\n\nThe page offers guidance on asking smart questions and troubleshooting page loading issues. It also links to past course homepages and external resources such as books and lectures from other institutions. A record of past events, including workshops and forums, provides context and insights into the program's development. Students can report errors or ask questions by emailing Yu Zihao.\n",
    "chinese_title": "一人一芯课程主页",
    "chinese_summary": "“一生一芯”v24.07课程主页提供处理器设计、RISC-V指令集及相关工具的学习资源。直播教学将于2025年9月开始。课程分为多个阶段（F、E、D、C、B、A、S），每个阶段涵盖特定主题，预计完成时间为0到20小时。这些预估时间基于具有编码和调试经验的“中级”学习者。初学者预计需要花费更多时间。\n\n学习资源包括课程讲义、幻灯片和视频，可通过图标访问。本课程广泛使用C语言编程，并探索硬件描述语言、Linux系统使用以及从C代码到可用于流片的版图的过程。具体任务包括安装Logisim、理解数字电路、构建简单的RISC-V处理器、调试以及探索缓存和虚拟内存等高级概念。本课程还通过PA1和NEMU实现等项目来强调实际应用。\n\n该页面提供关于如何提出有效问题和解决页面加载问题的指南，并链接到往期课程主页和外部资源，如书籍和其他机构的讲座。过去的活动记录，包括研讨会和论坛，提供了有关该项目发展的背景和见解。学生可以通过发送电子邮件给余子豪来报告错误或提问。"
  },
  {
    "id": "45952890",
    "title": "Are you stuck in movie logic?",
    "url": "https://usefulfictions.substack.com/p/are-you-stuck-in-movie-logic",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "你是否陷入了电影逻辑？",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "45954638",
    "title": "How to escape the Linux networking stack",
    "url": "https://blog.cloudflare.com/so-long-and-thanks-for-all-the-fish-how-to-escape-the-linux-networking-stack/",
    "summary": "Chris Branch's article, \"How to Escape the Linux Networking Stack,\" details Cloudflare's journey to overcome limitations in the Linux networking stack while implementing soft-unicast, a method for sharing IP addresses between machines. The core problem revolves around ensuring that TCP connections using soft-unicast addresses don't collide with other processes binding to the same addresses, especially when using Netfilter (iptables) for source NAT.\n\nThe initial approach of relying on Netfilter's conntrack caused issues where connections could be silently rewritten to invalid ports, disrupting soft-unicast functionality. Moving to a solution of terminating and proxying connections via local sockets was viable but introduced resource overhead and latency.\n\nThe article explores several attempts to reconcile packet rewriting and bound sockets. One involved using Netlink to manipulate conntrack entries, which proved inefficient due to the overhead of Netlink and the need to manually manage connection timeouts. A more promising solution leverages the `TCP_REPAIR` and `TCP_FASTOPEN` socket options to create \"connected\" sockets without a full handshake, preventing other processes from binding to the same addresses.\n\nHowever, even this faced challenges. Packets intended for forwarding were being routed locally due to Linux's routing rules. This was addressed by manipulating routing rules to prioritize forwarding marked packets. Finally, early demux, an optimization that looks up local sockets early in packet processing, interfered with the intended routing. The solution involved disabling `tcp_early_demux`, followed by performance evaluation.\n",
    "chinese_title": "如何逃离 Linux 网络栈",
    "chinese_summary": "Chris Branch's article, \"How to Escape the Linux Networking Stack,\" details Cloudflare's journey to overcome limitations in the Linux networking stack while implementing soft-unicast, a method for sharing IP addresses between machines. The core problem revolves around ensuring that TCP connections using soft-unicast addresses don't collide with other processes binding to the same addresses, especially when using Netfilter (iptables) for source NAT.\n\nThe initial approach of relying on Netfilter's conntrack caused issues where connections could be silently rewritten to invalid ports, disrupting soft-unicast functionality. Moving to a solution of terminating and proxying connections via local sockets was viable but introduced resource overhead and latency.\n\nThe article explores several attempts to reconcile packet rewriting and bound sockets. One involved using Netlink to manipulate conntrack entries, which proved inefficient due to the overhead of Netlink and the need to manually manage connection timeouts. A more promising solution leverages the `TCP_REPAIR` and `TCP_FASTOPEN` socket options to create \"connected\" sockets without a full handshake, preventing other processes from binding to the same addresses.\n\nHowever, even this faced challenges. Packets intended for forwarding were being routed locally due to Linux's routing rules. This was addressed by manipulating routing rules to prioritize forwarding marked packets. Finally, early demux, an optimization that looks up local sockets early in packet processing, interfered with the intended routing. The solution involved disabling `tcp_early_demux`, followed by performance evaluation.\n"
  },
  {
    "id": "45962444",
    "title": "PayPal bans Linux users with a GPU name containing the string \"Apple M1\"",
    "url": "https://vt.social/@lina/115568401302718163",
    "summary": "The article reports that PayPal is reportedly banning users of Asahi Linux, a Linux distribution specifically designed to run on Apple Silicon (like the M1 chip). The basis for these bans appears to be related to the identification of their GPU, which contains the string \"Apple M1\". This suggests PayPal is incorrectly associating these Linux users with Apple's macOS and potentially applying some restriction based on that misidentification. The report originates from Asahi Lina, a prominent figure in the Asahi Linux community. The tweet/post mentions \"PayPal is banning Asahi Linux users\" and highlights the issue of being identified with an \"Apple M1\" GPU.\n",
    "chinese_title": "PayPal 禁止 GPU 名称包含 \"Apple M1\" 的 Linux 用户。",
    "chinese_summary": "The article reports that PayPal is reportedly banning users of Asahi Linux, a Linux distribution specifically designed to run on Apple Silicon (like the M1 chip). The basis for these bans appears to be related to the identification of their GPU, which contains the string \"Apple M1\". This suggests PayPal is incorrectly associating these Linux users with Apple's macOS and potentially applying some restriction based on that misidentification. The report originates from Asahi Lina, a prominent figure in the Asahi Linux community. The tweet/post mentions \"PayPal is banning Asahi Linux users\" and highlights the issue of being identified with an \"Apple M1\" GPU.\n"
  },
  {
    "id": "45963450",
    "title": "Researchers develop air-powered robots that move in sync without electronics",
    "url": "https://www.ox.ac.uk/news/2025-11-14-researchers-develop-air-powered-robots-move-sync-without-electronics",
    "summary": "生成摘要时出错",
    "chinese_title": "Researchers develop air-powered robots that move in sync without electronics",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45960893",
    "title": "Core Devices keeps stealing our work",
    "url": "https://rebble.io/2025/11/17/core-devices-keeps-stealing-our-work.html",
    "summary": "生成摘要时出错",
    "chinese_title": "Core Devices keeps stealing our work",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45967945",
    "title": "Welcome to Google Antigravity [video]",
    "url": "https://www.youtube.com/watch?v=SVCBA-pBgt0",
    "summary": "生成摘要时出错",
    "chinese_title": "Welcome to Google Antigravity [video]",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45963350",
    "title": "AI slop security engineering: Okta's NextJS-0auth troubles",
    "url": "https://joshua.hu/ai-slop-okta-nextjs-0auth-security-vulnerability",
    "summary": "生成摘要时出错",
    "chinese_title": "AI slop security engineering: Okta's NextJS-0auth troubles",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45955407",
    "title": "Why don't people return their shopping carts?",
    "url": "https://behavioralscientist.org/why-dont-people-return-their-shopping-carts-a-somewhat-scientific-investigation/",
    "summary": "生成摘要时出错",
    "chinese_title": "Why don't people return their shopping carts?",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45966665",
    "title": "Latest Servo release hints at a real Rust alternative to Chromium",
    "url": "https://www.theregister.com/2025/11/18/servo_002_arrives/",
    "summary": "生成摘要时出错",
    "chinese_title": "Latest Servo release hints at a real Rust alternative to Chromium",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45935687",
    "title": "A graph explorer of the Epstein emails",
    "url": "https://epstein-doc-explorer-1.onrender.com/",
    "summary": "生成摘要时出错",
    "chinese_title": "A graph explorer of the Epstein emails",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45949655",
    "title": "A new chapter begins for EV batteries with the expiry of key LFP patents",
    "url": "https://www.shoosmiths.com/insights/articles/a-new-chapter-begins-for-ev-batteries-with-the-expiry-of-key-lfp-patents",
    "summary": "生成摘要时出错",
    "chinese_title": "A new chapter begins for EV batteries with the expiry of key LFP patents",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45965606",
    "title": "The Smartphone Killed the Xbox",
    "url": "https://ravi64.com/the-smartphone-killed-the-xbox/",
    "summary": "生成摘要时出错",
    "chinese_title": "The Smartphone Killed the Xbox",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45957402",
    "title": "Show HN: PrinceJS – 19,200 req/s Bun framework in 2.8 kB (built by a 13yo)",
    "url": "https://princejs.vercel.app",
    "summary": "生成摘要时出错",
    "chinese_title": "Show HN: PrinceJS – 19,200 req/s Bun framework in 2.8 kB (built by a 13yo)",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45958815",
    "title": "Ion: Modern System Shell in Rust",
    "url": "https://github.com/redox-os/ion",
    "summary": "生成摘要时出错",
    "chinese_title": "Ion: Modern System Shell in Rust",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45953452",
    "title": "FreeMDU: Open-source Miele appliance diagnostic tools",
    "url": "https://github.com/medusalix/FreeMDU",
    "summary": "生成摘要时出错",
    "chinese_title": "FreeMDU: Open-source Miele appliance diagnostic tools",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45895490",
    "title": "Implementing Wordle in LibreOffice with JavaScript Macros",
    "url": "https://bojidar-bg.dev/blog/2025-11-11-wordle-libreoffice/",
    "summary": "生成摘要时出错",
    "chinese_title": "Implementing Wordle in LibreOffice with JavaScript Macros",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45949102",
    "title": "An overly aggressive mock can work fine, but break much later",
    "url": "https://nedbatchelder.com/blog/202511/why_your_mock_breaks_later.html",
    "summary": "生成摘要时出错",
    "chinese_title": "An overly aggressive mock can work fine, but break much later",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45950720",
    "title": "Building a Simple Search Engine That Works",
    "url": "https://karboosx.net/post/4eZxhBon/building-a-simple-search-engine-that-actually-works",
    "summary": "生成摘要时出错",
    "chinese_title": "Building a Simple Search Engine That Works",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45961185",
    "title": "RDMA-Rust: Why another RDMA wrapper",
    "url": "https://rdma-rust.github.io/2025/11/16/why-another-rdma-wrapper/",
    "summary": "生成摘要时出错",
    "chinese_title": "RDMA-Rust: Why another RDMA wrapper",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45960293",
    "title": "I caught Google Gemini using my data and then covering it up",
    "url": "https://unbuffered.stream/gemini-personal-context/",
    "summary": "生成摘要时出错",
    "chinese_title": "I caught Google Gemini using my data and then covering it up",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45968910",
    "title": "Microsoft warns that Windows 11's agentic AI could install malware on your PC",
    "url": "https://www.windowscentral.com/microsoft/windows-11/microsoft-warns-security-risks-agentic-os-windows-11-xpia-malware",
    "summary": "生成摘要时出错",
    "chinese_title": "Microsoft warns that Windows 11's agentic AI could install malware on your PC",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45956176",
    "title": "An official atlas of North Korea",
    "url": "https://www.cartographerstale.com/p/an-official-atlas-of-north-korea",
    "summary": "生成摘要时出错",
    "chinese_title": "An official atlas of North Korea",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45965387",
    "title": "Cloudflare down: Facebook and X among apps not working in major internet outage",
    "url": "https://metro.co.uk/2025/11/18/parts-internet-stops-working-globally-major-network-goes-24738666/",
    "summary": "生成摘要时出错",
    "chinese_title": "Cloudflare down: Facebook and X among apps not working in major internet outage",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45893879",
    "title": "My kind of REPL (2023)",
    "url": "https://ianthehenry.com/posts/my-kind-of-repl/",
    "summary": "生成摘要时出错",
    "chinese_title": "My kind of REPL (2023)",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45954560",
    "title": "Google is killing the open web, part 2",
    "url": "https://wok.oblomov.eu/tecnologia/google-killing-open-web-2/",
    "summary": "生成摘要时出错",
    "chinese_title": "Google is killing the open web, part 2",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45968386",
    "title": "Blender 5.0 Released with Better Vulkan Support, HDR on Wayland",
    "url": "https://www.phoronix.com/news/Blender-5.0-Released",
    "summary": "生成摘要时出错",
    "chinese_title": "Blender 5.0 Released with Better Vulkan Support, HDR on Wayland",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45952824",
    "title": "Ned: ImGui Text Editor with GL Shaders",
    "url": "https://github.com/nealmick/ned",
    "summary": "生成摘要时出错",
    "chinese_title": "Ned: ImGui Text Editor with GL Shaders",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45909525",
    "title": "Temporal Dithering of NeoPixels on an ATtiny412",
    "url": "http://sarah.alroe.dk/2025/NeoInf/",
    "summary": "生成摘要时出错",
    "chinese_title": "Temporal Dithering of NeoPixels on an ATtiny412",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45953702",
    "title": "Replicate is joining Cloudflare",
    "url": "https://replicate.com/blog/replicate-cloudflare",
    "summary": "生成摘要时出错",
    "chinese_title": "Replicate is joining Cloudflare",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45955921",
    "title": "EEG-based neurofeedback in athletes and non-athletes",
    "url": "https://www.mdpi.com/2306-5354/12/11/1202",
    "summary": "生成摘要时出错",
    "chinese_title": "EEG-based neurofeedback in athletes and non-athletes",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45922997",
    "title": "Our dogs' diversity can be traced back to the Stone Age",
    "url": "https://www.bbc.com/news/articles/ce9d7j89ykro",
    "summary": "生成摘要时出错",
    "chinese_title": "Our dogs' diversity can be traced back to the Stone Age",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45966773",
    "title": "3.5B Accounts: Complete WhatsApp Directory Retrieved and Evaluated",
    "url": "https://www.heise.de/en/news/3-5-Billion-Accounts-Complete-WhatsApp-Directory-Retrieved-and-Evaluated-11083244.html",
    "summary": "生成摘要时出错",
    "chinese_title": "3.5B Accounts: Complete WhatsApp Directory Retrieved and Evaluated",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45948311",
    "title": "Why Castrol Honda Superbike crashes on (most) modern systems",
    "url": "https://seri.tools/blog/castrol-honda-superbike/",
    "summary": "生成摘要时出错",
    "chinese_title": "Why Castrol Honda Superbike crashes on (most) modern systems",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45952428",
    "title": "Giving C a superpower: custom header file (safe_c.h)",
    "url": "https://hwisnu.bearblog.dev/giving-c-a-superpower-custom-header-file-safe_ch/",
    "summary": "生成摘要时出错",
    "chinese_title": "Giving C a superpower: custom header file (safe_c.h)",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45941596",
    "title": "AirPods libreated from Apple's ecosystem",
    "url": "https://github.com/kavishdevar/librepods",
    "summary": "LibrePods is an open-source project aiming to unlock the full potential of Apple AirPods on non-Apple devices, specifically Android. It provides access to features normally locked within the Apple ecosystem, such as noise control modes, adaptive transparency, ear detection, battery status, and hearing aid customization.\n\nThe software is primarily tested and fully supported on AirPods Pro (2nd and 3rd Gen) and AirPods Max. Basic features should work on other AirPods models. Key features include noise control, automatic music pausing with ear detection, accurate battery readings, head gesture call answering, conversational awareness, hearing aid configuration, and multi-device connectivity (up to two devices). Some advanced features like transparency mode customization and hearing aid require enabling the Bluetooth DID (Device Identification) hook, which simulates an Apple device.\n\nOn Android, a rooted device with the Xposed framework is generally required due to limitations in the Android Bluetooth stack, although ColorOS/OxygenOS 16 users can access basic features without root. Enabling the DID hook grants access to multi-device connectivity and accessibility settings like customized transparency and hearing aid configurations. Users can also rename their AirPods and customize long-press actions.\n\nThe project is under development for Linux as well. The project is licensed under the GNU General Public License v3.\n",
    "chinese_title": "AirPods libreated from Apple's ecosystem",
    "chinese_summary": "LibrePods is an open-source project aiming to unlock the full potential of Apple AirPods on non-Apple devices, specifically Android. It provides access to features normally locked within the Apple ecosystem, such as noise control modes, adaptive transparency, ear detection, battery status, and hearing aid customization.\n\nThe software is primarily tested and fully supported on AirPods Pro (2nd and 3rd Gen) and AirPods Max. Basic features should work on other AirPods models. Key features include noise control, automatic music pausing with ear detection, accurate battery readings, head gesture call answering, conversational awareness, hearing aid configuration, and multi-device connectivity (up to two devices). Some advanced features like transparency mode customization and hearing aid require enabling the Bluetooth DID (Device Identification) hook, which simulates an Apple device.\n\nOn Android, a rooted device with the Xposed framework is generally required due to limitations in the Android Bluetooth stack, although ColorOS/OxygenOS 16 users can access basic features without root. Enabling the DID hook grants access to multi-device connectivity and accessibility settings like customized transparency and hearing aid configurations. Users can also rename their AirPods and customize long-press actions.\n\nThe project is under development for Linux as well. The project is licensed under the GNU General Public License v3.\n"
  },
  {
    "id": "45952614",
    "title": "Things I don't like in configuration languages",
    "url": "https://medv.io/blog/things-i-dont-like-in-configuration-languages",
    "summary": "生成摘要时出错",
    "chinese_title": "Things I don't like in configuration languages",
    "chinese_summary": "生成摘要时出错"
  }
]