[
  {
    "id": "44396518",
    "title": "Show HN: I'm an airline pilot – I built interactive graphs/globes of my flights",
    "url": "https://jameshard.ing/pilot",
    "summary": "This \"Show HN\" post details an Airbus A350 pilot's passion for visualizing their flight data. The pilot, a First Officer with British Airways, uses SQL queries of their LogTen Pro flight log to generate interactive graphs and globes.\n\nThe post highlights several interesting visualizations, including:\n\n*   **Destination Matrix:** A circular visualization showing flight connections between countries, revealing discrepancies due to positioning flights.\n*   **Flight Calendar:** A GitHub-style \"activity graph\" depicting daily flight hours, illustrating the impact of events like the Covid-19 pandemic and transitions between short-haul and long-haul routes.\n*   **3D Globes:** Interactive globes showcasing flights by country and airport.\n*   **Annual Hours:** A breakdown of yearly flight hours categorized by pilot role (PIC, PICUS, P2, Heavy).\n*   **Cumulative Hours:** Total flight time per aircraft type (A320 family and A350).\n*   **Flight Time vs. Distance:** A scatter plot comparing flight time and distance, revealing the influence of prevailing winds on westbound flights from London.\n\nThe pilot also mentions their training, which included a cadet scheme with British Airways and flying scholarships in Canada, culminating in a Glider Pilot License and instructor rating. Flying with their father, also a BA A350 Captain, is noted as a career highlight. The overall goal is to present flight data in an engaging and insightful way, showcasing the pilot's experience and passion for aviation.\n",
    "chinese_title": "显示HN：我是航空公司飞行员 – 我构建了我的航班的交互式图表/地球仪",
    "chinese_summary": "此“Show HN”帖子详细介绍了空客A350飞行员对可视化飞行数据的热情。这位飞行员是英国航空公司的副驾驶，他使用 LogTen Pro 飞行日志的 SQL 查询来生成交互式图形和地球仪。\n\n该帖子重点介绍了几个有趣的视觉效果，包括：\n\n*   **目的地矩阵：** 一个圆形可视化图，显示国家之间的航班连接，揭示了由于定位飞行造成的差异。\n*   **飞行日历：** 一个 GitHub 风格的“活动图”，描绘了每日飞行时间，说明了 Covid-19 大流行以及短途和长途航线之间过渡等事件的影响。\n*   **3D 地球仪：** 展示按国家和机场划分的航班的交互式地球仪。\n*   **年度小时数：** 按飞行员角色（PIC、PICUS、P2、Heavy）分类的年度飞行小时数细分。\n*   **累计小时数：** 每种飞机类型（A320 系列和 A350）的总飞行时间。\n*   **飞行时间与距离：** 比较飞行时间和距离的散点图，揭示了伦敦西部航班上盛行风的影响。\n\n这位飞行员还提到了他们的培训经历，包括英国航空公司的学员计划和加拿大的飞行奖学金，最终获得了滑翔机飞行员执照和教练等级。 与同为空客 A350 机长的父亲一起飞行被认为是职业生涯的亮点。 总体目标是以引人入胜且富有洞察力的方式呈现飞行数据，展示飞行员的经验和对航空的热情。"
  },
  {
    "id": "44397367",
    "title": "Weird Expressions in Rust",
    "url": "https://www.wakunguma.com/blog/rust-weird-expr",
    "summary": "This article explores \"weird expressions\" in Rust, showcasing peculiar yet valid code snippets from the `weird-expr.rs` test file in the Rust repository. These aren't bugs, but rather extreme uses of Rust's features.\n\nThe examples leverage Rust's type system, particularly the never type (`!`) which can coerce to any other type. This is demonstrated in functions like `strange` and `funny`, where `return` statements (type `!`) are used as booleans or unit types. The `zombiejesus` function further illustrates this with chained `return` statements in `if`, `while`, and `match` contexts.\n\nOther examples delve into uninitialized variables (`notsure`), the unit type returned by macros like `assert!` and `println!` (`canttouchthis`), and how `break` and `continue` expressions can influence control flow (`angrydome`).\n\nThe article also highlights features like using weak keywords as identifiers (`union`), abusing range syntax for Debug formatting (`punch_card` and `dots`), chaining assignments to the unit type (`monkey_barrel`), and using grouped and nested `use` statements (`useful_syntax`).\n\nFurthermore, it covers infinite module recursion, fully qualified function pointers, unicode identifiers to bypass keyword restrictions, and the quirky aspects of the `matches!` macro with wildcard patterns and conditional expressions. Finally the article touches on closure matching, and \"fake macros\" that abuse braces to manipulate return types.\n",
    "chinese_title": "Rust 中的奇怪表达",
    "chinese_summary": "Rust中的“奇特表达式”探索"
  },
  {
    "id": "44397168",
    "title": "10 Years of Pomological Watercolors",
    "url": "https://parkerhiggins.net/2025/04/10-years-of-pomological-watercolors/",
    "summary": "This blog post celebrates the 10th anniversary of the author's initial call for the public release of the US government's Pomological Watercolor Collection, a library of over 7,000 fruit paintings. The author details their journey, starting with using FOIA requests to reveal the collection was digitized but behind a costly paywall.\n\nAfter successfully advocating for its public release, the author didn't stop there. They built Python software to upload the images to Wikimedia Commons, marking the beginning of their programming career. This led to creating social media bots to showcase the collection on Twitter (now X), Bluesky, and Mastodon. The author highlights other projects like a presentation at the National Archives, a visualization video for a concert, and data contributions.\n\nThe author expresses joy at seeing the collection's widespread appreciation, noting its appearance in a coffee table book, academic research, postcards, art prints, and media mentions in outlets like the New York Times and Defector. They even spotted a painting in the TV show Schitt's Creek.\n\nThe author emphasizes the unexpected and positive impact of pursuing their curiosity regarding the public domain, and the pomological watercolor collection in particular, and notes they are currently looking for a job.\n",
    "chinese_title": "十年果树水彩画",
    "chinese_summary": "本文庆祝作者首次呼吁公开美国政府的植物学水彩画收藏（一个包含超过7000幅水果画作的图书馆）十周年。作者详细描述了他们的旅程，最初通过信息自由法案请求揭示该收藏已被数字化，但设置了昂贵的付费墙。\n\n在成功倡导其公开发布后，作者并没有就此止步。他们构建了Python软件，将图像上传到维基共享资源，标志着他们编程生涯的开始。这促使他们创建了社交媒体机器人，在Twitter（现在的X）、Bluesky和Mastodon上展示该收藏。作者重点介绍了其他项目，如在国家档案馆的演讲、为音乐会制作的可视化视频以及数据贡献。\n\n作者对看到该收藏被广泛欣赏感到高兴，并注意到它出现在咖啡桌书、学术研究、明信片、艺术版画以及《纽约时报》和Defector等媒体报道中。他们甚至在电视剧《富家穷路》中发现了一幅画作。\n\n作者强调了追求他们对公共领域的兴趣，特别是对植物学水彩画收藏的好奇心所带来的意想不到的积极影响，并指出他们目前正在找工作。"
  },
  {
    "id": "44397124",
    "title": "Qwen VLo: From \"Understanding\" the World to \"Depicting\" It",
    "url": "https://qwenlm.github.io/blog/qwen-vlo/",
    "summary": "Qwen VLo is a new unified multimodal model from the Qwen series designed for both understanding and generating images. It builds upon previous QwenVL models, advancing from simply \"understanding\" image content to creating high-quality recreations based on that understanding. This preview version is accessible through Qwen Chat, allowing users to generate images from text prompts (e.g., \"Generate a picture of a cute cat\") or modify existing images (e.g., upload a cat image and ask \"Add a cap on the cat’s head\").\n\nKey highlights include:\n\n*   **Precise Content Understanding and Recreation:** Improved semantic consistency and detail-capturing to avoid misinterpretations during image generation.\n*   **Open-Ended Instruction-Based Editing:** Ability to respond to creative natural language instructions for style transfers, scene reconstruction, detailed touch-ups, and even complex modifications involving objects, text, and backgrounds.\n*   **Multilingual Instruction Support:** Supports Chinese and English.\n\nThe document showcases various use cases demonstrating Qwen VLo's abilities, including:\n\n*   Generating and modifying images based on detailed prompts, such as adding accessories to a Shiba Inu or changing backgrounds.\n*   Style conversion, transforming images into different artistic styles (Ghibli, One Piece, Dragon Ball, etc.) or into realistic photos, 3D renderings, or even plush toys.\n*   Complex image prompt processing, like generating scenes with multiple characters and elements.\n*   Poster creation using specific visual elements and text.\n*   Perception and localization tasks, such as edge detection and object segmentation.\n*   Multiple image input and tasks that involve both text and image inputs.\n*   Direct text-to-image generation.\n\nThe model aims to act as a \"human artist,\" transforming imagination into reality with enhanced flexibility and control for users.\n",
    "chinese_title": "Qwen VLo：从“理解”世界到“描绘”世界",
    "chinese_summary": "Qwen VLo 是 Qwen 系列中一种新型统一多模态模型，专为理解和生成图像而设计。它建立在之前的 QwenVL 模型之上，从简单地“理解”图像内容，发展到基于这种理解创建高质量的重建图像。此预览版可通过 Qwen Chat 访问，允许用户通过文本提示生成图像（例如，“生成一张可爱猫咪的图片”）或修改现有图像（例如，上传一张猫的图片，并询问“在猫的头上加一顶帽子”）。\n\n主要亮点包括：\n\n*   **精确的内容理解与再现：** 改进了语义一致性和细节捕捉能力，以避免图像生成过程中的误解。\n*   **开放式指令驱动的编辑：** 能够响应创造性的自然语言指令，进行风格转换、场景重建、精细润饰，甚至涉及物体、文本和背景的复杂修改。\n*   **多语言指令支持：** 支持中文和英文。\n\n该文档展示了 Qwen VLo 的各种用例，包括：\n\n*   基于详细提示生成和修改图像，例如给柴犬添加配饰或更改背景。\n*   风格转换，将图像转换为不同的艺术风格（吉卜力、海贼王、龙珠等）或转换为逼真的照片、3D 渲染，甚至毛绒玩具。\n*   复杂的图像提示处理，例如生成包含多个角色和元素的场景。\n*   使用特定视觉元素和文本创建海报。\n*   感知和定位任务，例如边缘检测和对象分割。\n*   多图输入以及涉及文本和图像输入的任务。\n*   直接的文本到图像生成。\n\n该模型旨在充当“人类艺术家”，通过增强的灵活性和控制力，将用户的想象力转化为现实。"
  },
  {
    "id": "44398390",
    "title": "Transmitting data via ultrasound without any special equipment",
    "url": "https://halcy.de/blog/2025/06/27/transmitting-data-via-ultrasound-without-any-special-equipment/",
    "summary": "This article, written on June 27, 2025, explores the possibility of transmitting data via ultrasound using standard computer equipment. The author explains the concept of ultrasound as sound frequencies beyond human hearing (above 20000 Hz) and demonstrates that even typical laptop speakers and microphones are capable of generating and detecting these frequencies.\n\nThe core idea is to encode data within the ultrasound signal and transmit it between devices. The author details two attempted methods: Morse code and Frequency Shift Keying (FSK). FSK, where data is encoded as shifts in pitch, proved more successful and is demonstrated via a WebAudio-based tool.\n\nThe website allows users to send messages by converting them into high-frequency audio signals and receiving them on another device. The article includes code snippets showing how the signal is encoded (converting bits to RTZ FSK audio) and decoded (analyzing frequency spectrum for energy peaks).\n\nThe author acknowledges limitations, including susceptibility to interference, lack of error correction, and low transmission speeds. They encourage readers to improve the system, suggesting enhancements like Reed-Solomon error correction. The source code is provided on GitHub.\n\nFinally, the article reveals that this type of ultrasound signal is already used in calling software to detect nearby devices participating in the same meeting.\n",
    "chinese_title": "无需任何特殊设备，通过超声波传输数据",
    "chinese_summary": "本文（2025年6月27日撰写）探讨了使用标准计算机设备通过超声波传输数据的可能性。作者解释了超声波是指超出人类听觉范围的声音频率（高于20000 Hz）的概念，并证明即使是典型的笔记本电脑扬声器和麦克风也能够产生和检测这些频率。\n\n核心思想是在超声波信号中编码数据并在设备之间传输。作者详细介绍了两种尝试的方法：摩尔斯电码和频移键控（FSK）。事实证明，FSK（数据被编码为音调变化）更为成功，并通过基于WebAudio的工具进行了演示。\n\n该网站允许用户通过将消息转换为高频音频信号并在另一台设备上接收它们来发送消息。文章包含代码片段，展示了信号是如何被编码的（将比特转换为RTZ FSK音频）和解码的（分析频谱中的能量峰值）。\n\n作者承认存在局限性，包括易受干扰、缺乏纠错和传输速度慢。他们鼓励读者改进该系统，并建议进行改进，例如Reed-Solomon纠错。源代码已在GitHub上提供。\n\n最后，文章揭示了这种类型的超声波信号已经用于呼叫软件中，以检测参与同一会议的附近设备。"
  },
  {
    "id": "44361288",
    "title": "I Switched from Flutter and Rust to Rust and Egui",
    "url": "https://jdiaz97.github.io/greenblog/posts/flutter_to_egui/",
    "summary": "The author details their decision to switch from a Flutter + Rust stack to a Rust + egui stack for their BoquilaHUB project. They initially used Flutter for the UI and Rust for backend logic, connected using flutter_rust_bridge. However, frustration arose from complexities related to FFI (Foreign Function Interface) and the generated code by flutter_rust_bridge_codegen, which was often large, unreadable, and difficult to optimize.\n\nThe author, being the sole developer, found that Flutter's UI capabilities were underutilized, and the framework's state management (with issues like \"setstate is not refreshing\") added unnecessary complexity.\n\nSwitching to egui allowed them to write the entire application in Rust, simplifying the codebase. Egui's immediate mode paradigm, where the UI refreshes every frame, eliminated the need for complex state management solutions and callbacks. Adding UI elements became straightforward and predictable.\n\nThe author also perceived a performance improvement with the all-Rust stack. While not explicitly comparing Rust and Dart's speed, the removal of FFI overhead (cloning data, calling ONNX Runtime) resulted in a noticeably snappier and more responsive application. In essence, the switch reduced complexity, played to the author's strengths, and seemingly improved performance, leading to a more maintainable and understandable project.\n",
    "chinese_title": "我从Flutter和Rust转向Rust和Egui",
    "chinese_summary": "作者详述了将BoquilaHUB项目的技术栈从 Flutter + Rust 切换到 Rust + egui 的决定。最初，他们使用 Flutter 构建用户界面，Rust 处理后端逻辑，并通过 flutter_rust_bridge 连接两者。然而，由于与 FFI（外部函数接口）相关的复杂性，以及 flutter_rust_bridge_codegen 生成的大量、难以阅读且难以优化的代码，他们感到沮丧。\n\n作为唯一的开发者，作者发现 Flutter 的 UI 功能未得到充分利用，并且该框架的状态管理（例如“setstate 没有刷新”问题）增加了不必要的复杂性。\n\n切换到 egui 使他们能够用 Rust 编写整个应用程序，从而简化了代码库。Egui 的立即模式范例（UI 每帧刷新）消除了对复杂状态管理解决方案和回调的需求。添加 UI 元素变得直接且可预测。\n\n作者还感觉到全 Rust 技术栈带来了性能提升。虽然没有明确比较 Rust 和 Dart 的速度，但消除 FFI 开销（克隆数据、调用 ONNX Runtime）导致应用程序明显更流畅、响应更快。本质上，这次切换降低了复杂性，发挥了作者的优势，并且似乎提高了性能，从而使项目更易于维护和理解。"
  },
  {
    "id": "44398370",
    "title": "Bitmovin (YC S15) Is Hiring a Junior Solutions Engineer in Denver",
    "url": "https://bitmovin.com/careers/7943569002/",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "Bitmovin (YC S15) 正在丹佛招聘初级解决方案工程师",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "44356130",
    "title": "Whitesmiths C compiler: One of the earliest commercial C compilers available",
    "url": "https://github.com/hansake/Whitesmiths-C-compiler",
    "summary": "This article discusses the Whitesmiths C compiler, one of the earliest commercial C compilers, initially released in 1978. It was a complete reimplementation of C, distinct from Unix. By 1985, version 3.0 supported the emerging ANSI C standard and offered code generators for various platforms like DEC PDP-11, Intel 8080, and IBM System/370, making it a popular cross-compiler.\n\nThe author emphasizes the importance of preserving this software and shares that P.J. Plauger, Whitesmiths' president from 1978 to 1988, has granted permission to make the compiler available for non-commercial download, contingent on receiving a copy of the packaged software.\n\nThe article details the current availability of specific compiler versions and resources: the Whitesmiths C Compiler for CP/M-80 Edition 2.2 binaries and its manuals; the Whitesmiths C Cross Compiler (MS-DOS host for IBM System/36 Version 3.1) binaries, a QEMU disk image, and its manuals; the source code for the CP/M-80 Compiler Edition 2.2 with Makefiles; and manuals for the Whitesmiths/COSMIC C Cross Compiler Version 3.32 for Z80. The author hopes to expand the build environment with additional hosts and targets.\n",
    "chinese_title": "Whitesmiths C 编译器：最早的商用 C 编译器之一",
    "chinese_summary": "本文讨论了Whitesmiths C编译器，这是最早的商业C编译器之一，最初于1978年发布。它是C语言的完全重新实现，不同于Unix。到1985年，3.0版本支持新兴的ANSI C标准，并为各种平台（如DEC PDP-11、Intel 8080和IBM System/370）提供了代码生成器，使其成为流行的交叉编译器。\n\n作者强调了保存该软件的重要性，并分享了Whitesmiths公司1978年至1988年的总裁P.J. Plauger已授权将该编译器用于非商业下载，但前提是收到打包软件的副本。\n\n本文详细介绍了特定编译器版本的当前可用性以及资源：CP/M-80 Edition 2.2版本的Whitesmiths C编译器二进制文件及其手册；Whitesmiths C交叉编译器（用于IBM System/36 Version 3.1的MS-DOS主机）的二进制文件、QEMU磁盘映像及其手册；CP/M-80编译器Edition 2.2的源代码及其Makefile；以及用于Z80的Whitesmiths/COSMIC C交叉编译器Version 3.32的手册。作者希望通过添加更多主机和目标来扩展构建环境。"
  },
  {
    "id": "44359045",
    "title": "Moonbase Alpha: That time NASA made a meme video game",
    "url": "https://www.spacebar.news/moonbase-alpha-nasa-video-game/",
    "summary": "NASA's attempt to engage the public through video games led to the creation of Moonbase Alpha in 2010, a lunar base simulator developed by Army Game Studio and Virtual Heroes. Intended as a precursor to a larger MMO, the game tasked players with repairing a damaged lunar base in a limited time. While initial reviews were mixed, the game found unexpected popularity due to its DECtalk speech synthesis.\n\nPlayers exploited DECtalk's pitch and duration controls to create singing competitions within the game, generating viral content with synthesized covers of popular songs. This unforeseen feature transformed Moonbase Alpha into a meme, attracting a cult following and connecting it to the vocaloid music community.\n\nDespite the success of Moonbase Alpha, the promised space MMO, initially called \"Astronaut: Moon, Mars and Beyond\" (later \"Starlite: Astronaut Academy\"), never materialized. Despite crowdfunding and funding from various organizations, the project was plagued by internal disagreements and funding constraints, resulting in unfinished demos and ultimately failure. While Moonbase Alpha's moment in the spotlight has passed, it remains available for free, and its legacy lives on through its unique contribution to internet culture and the occasional new DECtalk-inspired song.\n",
    "chinese_title": "月球基地阿尔法：美国国家航空航天局制作表情包游戏的那次",
    "chinese_summary": "美国宇航局试图通过视频游戏吸引公众，于2010年催生了“月球基地阿尔法”，这是一款由陆军游戏工作室和Virtual Heroes开发的月球基地模拟器。该游戏旨在作为一款大型多人在线游戏的先导，要求玩家在有限的时间内修复一个受损的月球基地。尽管最初的评价褒贬不一，但由于其DECtalk语音合成功能，该游戏意外地获得了欢迎。\n\n玩家利用DECtalk的音高和时长控制功能在游戏中创建歌唱比赛，制作了大量病毒式内容，用合成声音翻唱流行歌曲。这一意想不到的功能将“月球基地阿尔法”变成了一个梗，吸引了一批狂热的追随者，并将其与Vocaloid音乐社区联系起来。\n\n尽管“月球基地阿尔法”取得了成功，但承诺的太空大型多人在线游戏，最初名为“宇航员：月球，火星及更远”（后更名为“星光：宇航员学院”）却从未实现。尽管获得了众筹和来自各组织的资助，但该项目受到内部纠纷和资金限制的困扰，最终导致未完成的演示和失败。虽然“月球基地阿尔法”的辉煌时刻已经过去，但它仍然可以免费获得，其遗产通过其对互联网文化的独特贡献以及偶尔出现的受DECtalk启发的歌曲而得以延续。"
  },
  {
    "id": "44393942",
    "title": "Parameterized types in C using the new tag compatibility rule",
    "url": "https://nullprogram.com/blog/2025/06/26/",
    "summary": "This article discusses a new feature in C23, specifically the \"tag compatibility rule\" for structs, unions, and enums, and how it enables a limited form of type parameterization using macros. Previously, identical struct definitions in different translation units (TUs) were considered distinct, incompatible types. C23 changes this, making them compatible if they have the same tag (name) and fields.\n\nThe author demonstrates how this can be used with macros to create parameterized types like dynamic arrays (slices). Instead of writing out a `SliceT` type definition for each type `T`, a macro `Slice(T)` can generate compatible struct definitions on demand. This allows for declaring functions that use slices parameterized for different element types, such as `Slice(int)`, `Slice(float)`, or `Slice(Str)`.\n\nThe article also touches on the limitations of this approach. While it parameterizes types, it doesn't parameterize the functions operating on those types, unlike C++ templates. Complex type compositions like `Slice(Slice(float))` are also problematic due to the macro implementation requiring a simple identifier.  Generic functions, however, can complement this new technique using C23's `typeof` for improved alignment control. The author provides a demo program (`demo.c`) for testing the feature and encourages readers to discuss it via email. While acknowledging the potential drawbacks, the author concludes that exploring this technique has been worthwhile.\n",
    "chinese_title": "使用新标签兼容性规则的C语言参数化类型",
    "chinese_summary": "C23标签兼容性规则与宏参数化类型\n\n本文探讨了C23中的一项新特性，即结构体、联合体和枚举的“标签兼容性规则”，以及它如何利用宏实现有限形式的类型参数化。 以前，不同翻译单元 (TU) 中相同的结构体定义被认为是不同的、不兼容的类型。 C23 改变了这一点，如果它们具有相同的标签（名称）和字段，则使它们兼容。\n\n作者演示了如何将此特性与宏结合使用来创建参数化类型，如动态数组（切片）。 无需为每种类型 `T` 编写 `SliceT` 类型定义，宏 `Slice(T)` 可以按需生成兼容的结构体定义。 这允许声明使用针对不同元素类型参数化的切片的函数，例如 `Slice(int)`、`Slice(float)` 或 `Slice(Str)`。\n\n本文还涉及了这种方法的局限性。 虽然它可以参数化类型，但它不能参数化作用于这些类型的函数，这与 C++ 模板不同。 由于宏实现需要一个简单的标识符，因此像 `Slice(Slice(float))` 这样的复杂类型组合也存在问题。 然而，泛型函数可以使用 C23 的 `typeof` 来补充这项新技术，以改进对齐控制。 作者提供了一个演示程序 (`demo.c`) 来测试该特性，并鼓励读者通过电子邮件讨论它。 尽管承认了潜在的缺点，但作者得出结论，探索这项技术是值得的。"
  },
  {
    "id": "44394929",
    "title": "Show HN: Zenta – Mindfulness for Terminal Users",
    "url": "https://github.com/e6a5/zenta",
    "summary": "Zenta is a terminal-based mindfulness tool designed for developers to cultivate presence and awareness during coding. It offers a simple, distraction-free way to return to the breath when the mind wanders, emphasizing pure awareness over tracking or optimization. Zenta avoids analytics and data collection, staying true to a zen approach.\n\nKey features include:\n\n*   **Quick Access:** Aliases like \"breath,\" \"breathe,\" and \"reflect\" offer instant access to short breathing exercises or a gentle evening review.\n*   **No Disruption:** Integrated seamlessly within the terminal.\n*   **Visual Breathing Guidance:** Uses expanding/contracting circles or simple line animations (adaptable for terminal compatibility) to guide breathing.\n*   **Essential Commands:** Includes options for different breathing cycle durations and levels of feedback.\n*   **Privacy-Focused:** No data collection or analytics.\n*   **Easy Installation:** Offers pre-built binaries for macOS/Linux/Windows, or can be built from source using Go.\n\nZenta aims to promote real mindfulness by encouraging developers to notice when their mind wanders, return to the breath, and continue working with greater awareness, rather than quantifying or optimizing inner peace. It is available under the MIT License.\n",
    "chinese_title": "Show HN: Zenta – 终端用户的心灵冥想",
    "chinese_summary": "Zenta：一款基于终端的开发者正念工具\n\nZenta是一款基于终端的正念工具，旨在帮助开发者在编码过程中培养专注和觉察。它提供了一种简单、无干扰的方式，让开发者在思绪游离时回到呼吸，强调纯粹的觉察而非追踪或优化。Zenta避免了分析和数据收集，秉持禅宗理念。\n\n主要功能包括：\n\n*   **快速访问：** 通过“breath”、“breathe”和“reflect”等别名，可以即时访问简短的呼吸练习或温和的晚间回顾。\n*   **无干扰：** 无缝集成在终端中。\n*   **可视化呼吸引导：** 使用扩展/收缩的圆圈或简单的线条动画（可适应终端兼容性）来引导呼吸。\n*   **基本命令：** 包括不同呼吸周期时长和反馈级别的选项。\n*   **注重隐私：** 不收集数据或进行分析。\n*   **易于安装：** 提供适用于macOS/Linux/Windows的预构建二进制文件，也可以使用Go从源代码构建。\n\nZenta旨在通过鼓励开发者注意到自己的思绪何时游离，回到呼吸，并以更高的觉察力继续工作，从而促进真正的正念，而不是量化或优化内心的平静。它在MIT许可证下发布。"
  },
  {
    "id": "44394386",
    "title": "PJ5 TTL CPU",
    "url": "https://pj5cpu.wordpress.com/",
    "summary": "The PJ5 TTL CPU project is progressing with successful implementation of the Game of Life and Mandelbrot generator on its display. However, limitations exist with the display's data transfer rate, causing corruption at speeds exceeding 500KHz, potentially due to a long ribbon cable. A workaround involves using the CPU's speed switching capability: calculations are performed at 2MIPS to minimize RAM corruption, and then the speed is lowered to 500KIPS for display writing. Running the CPU at 4MIPS with the display connected causes significant memory corruption. A second set of main boards has been built and tested, paving the way for having two separate CPU setups. Reworking the bus board, clock, and code memory boards is planned, and focus is shifting to designing peripherals.\n",
    "chinese_title": "PJ5 TTL CPU",
    "chinese_summary": "PJ5 TTL CPU项目进展顺利，已在其显示器上成功实现生命游戏和曼德勃罗集生成器。然而，显示器的数据传输速率存在限制，超过500KHz时会导致数据损坏，这可能是由于较长的扁平电缆造成的。一种解决方法是利用CPU的变速功能：以2MIPS的速度进行计算以最大限度地减少RAM损坏，然后将速度降低到500KIPS以进行显示写入。在连接显示器的情况下以4MIPS运行CPU会导致严重的内存损坏。第二套主板已经构建并测试完成，为拥有两个独立的CPU设置铺平了道路。计划重新设计总线板、时钟和代码存储器板，并将重点转移到设计外围设备上。"
  },
  {
    "id": "44387659",
    "title": "AlphaGenome: AI for better understanding the genome",
    "url": "https://deepmind.google/discover/blog/alphagenome-ai-for-better-understanding-the-genome/",
    "summary": "AlphaGenome is a new AI tool developed to predict the impact of DNA sequence variations on gene regulation. It analyzes long DNA sequences (up to 1 million base pairs) and predicts thousands of molecular properties related to gene activity, including gene start/end points, splicing, RNA production, and protein binding. This comprehensive approach allows for a better understanding of how genetic variants affect biological processes.\n\nKey features of AlphaGenome include its ability to process long sequences at high resolution, its comprehensive multimodal prediction capabilities, efficient variant scoring, and novel splice-junction modeling. AlphaGenome's performance is state-of-the-art across various genomic prediction benchmarks, outperforming existing models in many evaluations.\n\nThe benefits of AlphaGenome lie in its generality, allowing scientists to investigate a variant's impact on multiple modalities simultaneously. This facilitates rapid hypothesis generation and testing, accelerating research in areas like disease understanding, synthetic biology, and fundamental genome research. It can help pinpoint causes of disease, design synthetic DNA, and map functional elements in the genome.\n\nAlphaGenome is now available for non-commercial research via an API, and the developers plan to fully release the model in the future. While it has limitations, such as capturing the influence of very distant regulatory elements, and doesn't account for environmental or developmental factors, ongoing improvements are planned based on community feedback. It represents a significant advance in understanding the genome and promises to drive new discoveries in genomics and healthcare.\n",
    "chinese_title": "AlphaGenome：人工智能助力基因组理解",
    "chinese_summary": "AlphaGenome：预测DNA序列变异对基因调控影响的新型AI工具。它分析长DNA序列（高达100万个碱基对），并预测数千种与基因活性相关的分子特性，包括基因起始/终止点、剪接、RNA产生和蛋白质结合。这种综合方法有助于更好地理解遗传变异如何影响生物过程。\n\nAlphaGenome的关键特性包括其处理高分辨率长序列的能力、全面的多模态预测能力、高效的变异评分以及新型剪接连接建模。AlphaGenome的性能在各种基因组预测基准测试中均处于领先地位，并在许多评估中优于现有模型。\n\nAlphaGenome的优势在于其通用性，使科学家能够同时研究变异对多种模式的影响。这有助于快速生成和测试假设，从而加速疾病理解、合成生物学和基础基因组研究等领域的研究。它可以帮助确定疾病原因、设计合成DNA以及绘制基因组中的功能元件。\n\nAlphaGenome现已通过API提供给非商业研究使用，开发者计划在未来完全发布该模型。虽然它存在局限性，例如捕获非常遥远的调控元件的影响，并且没有考虑环境或发育因素，但计划根据社区反馈进行持续改进。它代表了对基因组理解的重大进步，并有望推动基因组学和医疗保健领域的新发现。"
  },
  {
    "id": "44396342",
    "title": "The Power and Beauty of Incrementalism",
    "url": "https://supernuclear.substack.com/p/the-power-and-beauty-of-incrementalism",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "渐进主义的力量与美",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "44356456",
    "title": "Sailing the fjords like the Vikings yields unexpected insights",
    "url": "https://arstechnica.com/science/2025/06/this-archaeologist-built-a-replica-boat-to-sail-like-the-vikings/",
    "summary": "Archaeologist Greer Jarrett has spent three years sailing replica Viking ships along known trade routes to gain a practical understanding of Viking seafaring. This experimental archaeology approach, which seeks to reverse-engineer ancient technologies, has yielded significant insights.\n\nJarrett's voyages led to the identification of four potential Viking havens along the Norwegian coast. These sites, located further out to sea than known major ports, could have been crucial for trade and travel. To identify these havens, Jarrett and his crew relied on replica boats similar to those used by Vikings and evaluated potential sites based on criteria such as accessibility in low visibility, size to accommodate multiple vessels, protection from the sea, and access to fresh water.\n\nJarrett also concluded that Vikings likely relied on \"mental maps\" based on accumulated experience and oral tradition, rather than navigational instruments like compasses. He argues that the long history of coastal seafaring in Scandinavia made instruments unnecessary. Despite some criticism regarding the time gap between Viking Age boats and the replicas, Jarrett defends his approach by highlighting the continuity in boatbuilding practices.\n\nThe challenging voyages, involving layered clothing, improvised repairs, and reliance on teamwork, revealed the seaworthiness of the boats and the necessity of collaboration for successful navigation. Jarrett emphasizes that the practical experience of sailing fostered new perspectives and underscored the importance of trust and shared skills within a crew. He believes this collaborative sailing environment likely fostered strong social bonds within Viking communities.\n",
    "chinese_title": "像维京人一样航行于峡湾，会带来意想不到的洞见。",
    "chinese_summary": "考古学家格里尔·贾勒特花费三年时间，驾驶复制的维京船沿已知贸易路线航行，以获得对维京航海的实践理解。这种试图逆向工程古代技术的实验考古方法，已经产生了重要的见解。\n\n贾勒特的航行导致了挪威海岸沿线四个潜在维京避风港的确定。这些地点比已知的的主要港口更靠近海上，可能对贸易和旅行至关重要。为了确定这些避风港，贾勒特和他的船员依靠类似于维京人使用的复制船只，并根据低能见度下的可达性、容纳多艘船只的规模、对海浪的保护以及获得淡水的机会等标准，评估了潜在的地点。\n\n贾勒特还得出结论，维京人可能依赖于基于累积经验和口头传统的“心理地图”，而不是像指南针这样的导航仪器。他认为，斯堪的纳维亚漫长的沿海航海历史使得仪器变得不必要。尽管有人批评维京时代船只和复制品之间存在时间差距，但贾勒特通过强调造船实践的连续性来捍卫他的方法。\n\n充满挑战的航行，包括穿着多层服装、临时修理和依赖团队合作，揭示了船只的适航性以及成功航行所必需的合作。贾勒特强调，航行的实践经验培养了新的视角，并强调了船员内部信任和共享技能的重要性。他认为，这种合作的航行环境可能促进了维京社区内强大的社会联系。"
  },
  {
    "id": "44394051",
    "title": "Show HN: Sink – Sync any directory with any device on your local network",
    "url": "https://github.com/sirbread/sink",
    "summary": "\"Sink\" is a local network file synchronization tool written in Python, designed to easily sync a directory between devices without relying on cloud services, email, or flash drives. It automatically discovers other Sink instances on the network and requires users to explicitly trust devices before allowing connections. The tool watches for file changes and syncs them almost instantly. A built-in conflict resolution mechanism saves both versions of conflicting edits in a `.sink_conflicts` folder to prevent data loss. Users can exclude specific files or folders from syncing by creating a `.sinkignore` file, which functions similarly to a `.gitignore` file. To use Sink, users clone the repository, install the required dependencies, and run `main.py`. Synchronization happens within a \"sync\" folder located in the same directory as the script. The developer acknowledges that the project is a work-in-progress and lists future features including a UI, custom directory paths, system tray integration, support for more than two devices, and delta syncing.\n",
    "chinese_title": "Show HN: Sink – 将任何目录同步到本地网络上的任何设备",
    "chinese_summary": "Sink：本地网络文件同步工具"
  },
  {
    "id": "44395799",
    "title": "My Lights Run on Bash – Tomasz Kramkowski",
    "url": "https://kramkow.ski/article/2025/06/27/my_lights_run_on_bash.html",
    "summary": "Tomasz Kramkowski describes his home automation system built primarily using Bash scripting. He uses Zigbee2MQTT to manage Zigbee devices, exposing them via the MQTT protocol. Instead of using standard home automation software, he opted for a lightweight approach, creating a program called MQTTR to launch Bash scripts in response to MQTT messages.\n\nHis initial goal was to synchronize physical light switches and dimmer remotes with his smart lights. He achieved this with a Bash script that interprets MQTT messages from the switches/dimmers and sends commands to Zigbee2MQTT to toggle the light state.\n\nHe then extended the system to control lights from his Android phone using the MqttDroid app. Because MqttDroid doesn't natively support JSON messages used by Zigbee2MQTT, he created another Bash script to mirror the JSON state into a separate MQTT namespace with simple numerical values. A final script enabled sending commands from MqttDroid to Zigbee2MQTT by converting simple MQTT messages into the required JSON format.\n\nFinally, he added functionality to the dimmer remotes to cycle through color temperatures using a Bash script that calculates the closest color temperature and selects the next one in a predefined sequence. He's satisfied with the current state, even though it doesn't yet include dynamic color temperature adjustments.\n",
    "chinese_title": "我的灯用Bash运行 – Tomasz Kramkowski",
    "chinese_summary": "托马斯·克拉姆科夫斯基描述了他主要使用Bash脚本构建的家庭自动化系统。他使用Zigbee2MQTT管理Zigbee设备，并通过MQTT协议暴露它们。他没有使用标准的家庭自动化软件，而是选择了一种轻量级的方法，创建了一个名为MQTTR的程序，用于启动Bash脚本以响应MQTT消息。\n\n他的最初目标是将物理灯开关和调光器遥控器与他的智能灯同步。他通过一个Bash脚本实现了这一点，该脚本解释来自开关/调光器的MQTT消息，并向Zigbee2MQTT发送命令以切换灯的状态。\n\n然后，他扩展了该系统，以使用MqttDroid应用程序从他的Android手机控制灯。由于MqttDroid本身不支持Zigbee2MQTT使用的JSON消息，因此他创建了另一个Bash脚本，将JSON状态镜像到一个单独的MQTT命名空间，其中包含简单的数值。最后一个脚本通过将简单的MQTT消息转换为所需的JSON格式，实现了从MqttDroid向Zigbee2MQTT发送命令。\n\n最后，他为调光器遥控器添加了通过循环切换色温的功能，使用了一个Bash脚本来计算最接近的色温，并在预定义的序列中选择下一个色温。他对当前的状态感到满意，尽管它尚未包括动态色温调整。"
  },
  {
    "id": "44390501",
    "title": "Alternative Layout System",
    "url": "https://alternativelayoutsystem.com/scripts/#same-sizer",
    "summary": "This article presents a collection of InDesign scripts designed to provide alternative layout and typesetting solutions, drawing inspiration from historical manuscript traditions. These scripts offer creative ways to manage text flow, eliminate hyphenation, and enhance visual aesthetics.\n\nThe scripts include:\n\n*   **Same Sizer:** Forces words to occupy equal horizontal space, mimicking monospaced fonts.\n\n*   **Wiggle Out:** Rotates overflowing words into the margin, replicating a technique found in some Hebrew and Quranic manuscripts.\n\n*   **Fill the Space:** Fills the space between the last word of a line and the text block's edge with custom glyphs or repetitions of the last letter, similar to manuscript practices.\n\n*   **Hyphen Out:** Eliminates hyphenation by moving the second part of hyphenated words outside the text frame, allowing for size and alignment adjustments.\n\n*   **Hyphenator:** Shrinks the last letters of the final word to fit within the line, preventing word breaks.\n\n*   **Last is First:** Previews the first word of the next line at the end of the current one, emulating a feature seen in some Hebrew manuscripts.\n\n*   **Ext. Word & Letter:** Enlarges the last letter or word of a line, often used in Hebrew manuscripts, with a vectorizing option to overcome InDesign's enlargement limits and ensure frame alignment.\n\n*   **Variable Gradient:** Creates a gradient effect within a text block by interpolating values between two extremes on a chosen axis, applicable on a word or glyph level.\n\nThese scripts aim to offer designers novel methods for text handling and visual presentation, inspired by historical typesetting techniques.\n",
    "chinese_title": "替代布局系统",
    "chinese_summary": "本文介绍了一系列InDesign脚本，旨在提供替代的版面设计和排版解决方案，其灵感源自历史手稿传统。这些脚本提供了管理文本流、消除连字符和增强视觉美观的创意方法。\n\n这些脚本包括：\n\n*   **等宽器:** 强制单词占据相等的水平空间，模仿等宽字体。\n\n*   **摆脱困境:** 将溢出的单词旋转到页边距中，复制一些希伯来语和古兰经手稿中发现的技术。\n\n*   **填充空间:** 用自定义字形或最后一个字母的重复填充一行中最后一个单词和文本框边缘之间的空间，类似于手稿实践。\n\n*   **消除连字符:** 通过将带连字符的单词的第二部分移动到文本框之外来消除连字符，允许进行大小和对齐调整。\n\n*   **断字器:** 缩小最后一个单词的最后几个字母以适合该行，防止单词中断。\n\n*   **末字先现:** 在当前行的末尾预览下一行的第一个单词，模仿一些希伯来语手稿中看到的功能。\n\n*   **放大字词和字母:** 放大一行的最后一个字母或单词，通常用于希伯来语手稿中，具有矢量化选项，以克服InDesign的放大限制并确保框架对齐。\n\n*   **可变渐变:** 通过在所选轴上在两个极端值之间插值来在文本框内创建渐变效果，适用于单词或字形级别。\n\n这些脚本旨在为设计师提供受历史排版技术启发的新颖文本处理和视觉呈现方法。"
  },
  {
    "id": "44393817",
    "title": "XSLT – Native, zero-config build system for the Web",
    "url": "https://github.com/pacocoursey/xslt",
    "summary": "This article presents XSLT (Extensible Stylesheet Language Transformations) as a \"native, zero-config build system for the Web,\" advocating for its use in creating static websites. The author, \"Grug brain Paco,\" frustrated with the complexity of modern build systems like Hugo and Next.js, sought a simpler solution leveraging existing web technologies. Paco realized that web browsers can act as build systems by using XSLT to transform XML data into HTML.\n\nThe author details their journey of discovery, learning about XML and XSLT specifications, finding that XML can hold data akin to HTML, and XSLT allows defining stylesheets to transform XML into HTML. Key advantages are: the browser handles the transformation directly (client-side build system), eliminating server-side build processes; no JavaScript is required, and it provides features such as looping, variables, and importing. The author argues it's a simple, flexible, and native solution that leverages the web browser itself.\n\nPaco emphasizes the simplicity and flexibility of XSLT and the fact that all browsers natively support XSLT transformation. They conclude that XSLT isn't a perfect replacement for all build systems but is a valuable tool in a web developer's arsenal, a testament to the power of old ideas and web specifications.\n",
    "chinese_title": "XSLT – Web原生零配置构建系统",
    "chinese_summary": "本文将XSLT（可扩展样式表转换语言）视为“原生的、零配置的Web构建系统”，倡导使用它来创建静态网站。作者“Grug brain Paco”对Hugo和Next.js等现代构建系统的复杂性感到沮丧，因此寻求一种更简单的解决方案，以利用现有的Web技术。Paco意识到Web浏览器可以通过使用XSLT将XML数据转换为HTML来充当构建系统。\n\n作者详细描述了他的发现之旅，学习了XML和XSLT规范，发现XML可以像HTML一样保存数据，而XSLT允许定义样式表将XML转换为HTML。 主要优点包括：浏览器直接处理转换（客户端构建系统），消除了服务器端构建过程；不需要JavaScript，并且它提供了循环、变量和导入等功能。作者认为这是一个简单、灵活且原生的解决方案，利用了Web浏览器本身。\n\nPaco强调了XSLT的简单性和灵活性，以及所有浏览器都原生支持XSLT转换的事实。他们得出结论，XSLT并不是所有构建系统的完美替代品，但它是Web开发者工具库中的一个有价值的工具，证明了旧思想和Web规范的力量。"
  },
  {
    "id": "44359454",
    "title": "A Lisp adventure on the calm waters of the dead C (2021)",
    "url": "https://mihaiolteanu.me/language-abstractions",
    "summary": "This article explores the limitations of the C programming language in terms of creating custom control flow abstractions, drawing parallels with the power of Lisp's abstractions.  The author argues that C's rigid evaluation strategy, specifically its \"pass-by-value\" approach and the inability to control the timing and order of parameter evaluation, hinders the implementation of functions that mimic conditional statements (like `if` and `while`) or more complex control structures (like `cond`).\n\nThe core argument revolves around how C evaluates function parameters *before* passing them into the function body. This prevents the programmer from selectively evaluating parameters based on conditions or evaluating them multiple times, which is essential for creating custom conditionals and loops.\n\nThe author demonstrates this through examples, attempting to implement `iff`, `cond`, `while`, and `for` functions in a hypothetical \"enhanced C.\" These attempts highlight the impossibility of achieving the desired behavior due to C's evaluation model. The article emphasizes that the ability to pass expressions (rather than just values) as parameters and control their evaluation is key to creating more powerful abstractions and extending a language's expressiveness. The conclusion implies that these limitations often necessitate the use of different languages, like Lisp, that offer more flexibility in handling code as data. Finally, the author suggests considering the potential for defining function types as parameters to allow more dynamic function creation.\n",
    "chinese_title": "死C之静水上的Lisp冒险 (2021)",
    "chinese_summary": "本文探讨了C语言在创建自定义控制流抽象方面的局限性，并将其与Lisp抽象的强大之处进行对比。作者认为，C语言僵化的求值策略，特别是其“值传递”方式以及无法控制参数求值的时机和顺序，阻碍了模拟条件语句（如`if`和`while`）或更复杂的控制结构（如`cond`）的函数的实现。\n\n核心论点围绕C语言如何在将函数参数传递到函数体*之前*对其进行求值。这使得程序员无法根据条件选择性地对参数进行求值或多次求值，而这对于创建自定义条件语句和循环至关重要。\n\n作者通过示例展示了这一点，尝试在假设的“增强型C”中实现`iff`、`cond`、`while`和`for`函数。这些尝试突出了由于C的求值模型而无法实现所需行为。文章强调，将表达式（而不仅仅是值）作为参数传递并控制其求值的能力是创建更强大的抽象和扩展语言表达能力的关键。结论暗示，这些限制通常需要使用不同的语言，例如Lisp，后者在处理代码作为数据方面提供了更大的灵活性。最后，作者建议考虑定义函数类型作为参数，以允许更动态的函数创建。"
  },
  {
    "id": "44390452",
    "title": "The time is right for a DOM templating API",
    "url": "https://justinfagnani.com/2025/06/26/the-time-is-right-for-a-dom-templating-api/",
    "summary": "This article advocates for adding a declarative templating API to the web platform, arguing that the current lack of a standardized, ergonomic way to create and efficiently update DOM nodes with data is a significant gap. While the DOM is a powerful API, the absence of built-in templating forces developers to rely on external libraries, leading to larger app sizes, increased overhead, and a lack of portability.\n\nThe author argues that now is the right time for a templating API due to the convergence of userland template solutions and the need for ergonomic DOM manipulation by \"vanilla\" and web component developers. Key points include:\n\n*   **Improved DX and UX:** Templating offers superior ergonomics, security against XSS, performance, and static analysis compared to imperative DOM APIs.\n*   **Framework Benefits:** Simplifies framework development by providing a standard templating base.\n*   **Syntax Familiarity:** Existing template systems share similar syntax, making standardization easier.\n*   **Leveraging Tagged Template Literals:** JavaScript's tagged template literals provide a foundation for describing templates without adding new syntax.\n*   **Future-Proofing:** Sets the stage for potential future integration of JSX.\n*   **Laying the Groundwork for HTML Templates:** A JavaScript API is a crucial step toward a full-featured HTML-based templating system.\n*   **Reactivity Models:** Explores VDOM diffing, template identity, and signals for updating, suggesting a hybrid approach for flexibility.\n\nIn conclusion, the author believes that a native templating API would benefit users, developers, frameworks, and the web platform by improving performance, security, portability, and the overall developer experience.\n",
    "chinese_title": "现在是推出DOM模板API的合适时机。",
    "chinese_summary": "本文倡导向 Web 平台添加声明式模板 API，认为目前缺乏一种标准化的、符合人体工程学的方式来创建和高效地用数据更新 DOM 节点是一个显著的缺陷。虽然 DOM 是一个强大的 API，但缺乏内置模板迫使开发者依赖外部库，导致更大的应用程序体积、增加的开销和缺乏可移植性。\n\n作者认为，现在是推出模板 API 的合适时机，因为用户级模板解决方案正在趋同，并且“原生”和 Web 组件开发者需要符合人体工程学的 DOM 操作。关键点包括：\n\n*   **改进的 DX 和 UX：** 与命令式 DOM API 相比，模板提供卓越的人体工程学、针对 XSS 的安全性、性能和静态分析。\n*   **框架优势：** 通过提供标准模板基础，简化框架开发。\n*   **语法熟悉性：** 现有模板系统共享类似的语法，使标准化更容易。\n*   **利用带标签的模板字面量：** JavaScript 的带标签的模板字面量为描述模板提供了基础，无需添加新的语法。\n*   **面向未来：** 为未来潜在的 JSX 集成奠定基础。\n*   **为 HTML 模板奠定基础：** JavaScript API 是实现功能齐全的基于 HTML 的模板系统的关键一步。\n*   **响应式模型：** 探索 VDOM 差异、模板标识和信号更新，建议采用混合方法以实现灵活性。\n\n总之，作者认为，原生模板 API 将通过提高性能、安全性、可移植性和整体开发者体验，从而使用户、开发者、框架和 Web 平台受益。"
  },
  {
    "id": "44394201",
    "title": "Blazing Matrix Products",
    "url": "https://panadestein.github.io/blog/posts/mp.html",
    "summary": "This article explores optimizing matrix multiplication in BQN, a language lacking a high-performance native implementation. The author begins by acknowledging the availability of BLAS, but justifies their pursuit as an exploration of \"Brutalist array programming.\"\n\nThe first optimization focuses on taming the cache by using blocking (square partitioning) of the input matrices, resulting in a sixfold speed-up. This improvement is achieved with a simple code change. The author then abstracts the blocking logic into a reusable function `MPB` for matrix power calculations, demonstrating its application and empirically searching for the optimal block size.  Recursive nested tiling is explored but provides no further performance gains.\n\nThe author then shifts focus from memory access to algorithm complexity, implementing a classic radix-2 divide-and-conquer Strassen algorithm. This achieves a significant 9x speed-up over the naive implementation.\n\nFinally, the article addresses parallelism using MPI bindings to implement Cannon's algorithm.  This leverages multiple cores for a 31x speed-up compared to the single-threaded naive BQN implementation, closing the gap between the author's implementation and optimized libraries like OpenBLAS. The conclusion emphasizes the combination of SPMD parallelism and cache-efficient algorithms as the key to achieving performance improvements, although the MPI solution requires a perfect square number of processors. The author provides links to external resources for those who want to learn more.\n",
    "chinese_title": "炽热矩阵乘积",
    "chinese_summary": "本文探讨了在BQN中优化矩阵乘法，BQN是一种缺乏高性能原生实现的语言。作者首先承认BLAS的可用性，但将其探索定义为“粗犷数组编程”。\n\n第一个优化重点是通过对输入矩阵进行分块（正方形分割）来优化缓存，从而实现六倍的加速。这种改进仅通过简单的代码更改即可实现。然后，作者将分块逻辑抽象为可重用的函数`MPB`，用于矩阵幂计算，演示了其应用并经验性地搜索最佳块大小。对递归嵌套平铺进行了探索，但未带来进一步的性能提升。\n\n然后，作者将重点从内存访问转移到算法复杂度，实现了经典的基数2分治Strassen算法。与朴素实现相比，这实现了显着的9倍加速。\n\n最后，本文使用MPI绑定来实现Cannon算法，从而解决了并行性问题。与单线程朴素BQN实现相比，这利用了多个内核，实现了31倍的加速，缩小了作者实现与OpenBLAS等优化库之间的差距。结论强调SPMD并行性和缓存高效算法的结合是实现性能改进的关键，尽管MPI解决方案需要完全平方数的处理器。作者提供了外部资源链接，供那些想要了解更多信息的人参考。"
  },
  {
    "id": "44358448",
    "title": "Calculating the Fibonacci numbers on GPU",
    "url": "https://veitner.bearblog.dev/calculating-the-fibonacci-numbers-on-gpu/",
    "summary": "This blog post demonstrates how to efficiently calculate Fibonacci numbers using GPU programming with the Thrust library. Thrust simplifies GPU programming by leveraging modern C++ concepts.\n\nThe core idea revolves around using a parallelizable algorithm called \"scan.\"  The post explains inclusive and exclusive scans with examples using addition and multiplication on vectors.\n\nThe key insight is to represent Fibonacci numbers using matrix multiplication. The Fibonacci sequence can be generated by repeatedly multiplying a specific 2x2 matrix (Q) with itself.  Thrust's flexibility allows performing a scan operation using these matrices.  The post details the matrix multiplication lambda function necessary for the scan.\n\nThe author demonstrates how to initialize a vector of this Fibonacci matrix (Q) and use Thrust's `exclusive_scan` function to compute the powers of Q. The resulting matrices contain the Fibonacci numbers at each step.\n\nFor very large Fibonacci numbers, the author addresses integer overflow by performing the matrix multiplication modulo a chosen number.  The post highlights the speed advantage, calculating F99999999 modulo 9837 in only 17 milliseconds on a consumer GPU. The correctness of the result is verified using Wolfram Alpha.\n\nIn conclusion, the blog post showcases the power and ease of using Thrust for complex parallel computations like calculating Fibonacci numbers via the Scan operation. The author credits Guy Blelloch for the idea of using Scan for Fibonacci numbers.\n",
    "chinese_title": "在GPU上计算斐波那契数",
    "chinese_summary": "本博客演示如何使用Thrust库通过GPU编程高效计算斐波那契数。Thrust利用现代C++概念简化了GPU编程。\n\n核心思想围绕着使用一种名为“扫描”的可并行化算法。文章解释了包含性和排除性扫描，并提供了使用向量加法和乘法的例子。\n\n关键在于使用矩阵乘法来表示斐波那契数。斐波那契数列可以通过重复将一个特定的2x2矩阵 (Q) 与自身相乘来生成。Thrust的灵活性允许使用这些矩阵执行扫描操作。文章详细介绍了扫描所需的矩阵乘法lambda函数。\n\n作者演示了如何初始化一个斐波那契矩阵 (Q) 的向量，并使用Thrust的`exclusive_scan`函数来计算Q的幂。结果矩阵在每一步都包含斐波那契数。\n\n对于非常大的斐波那契数，作者通过对一个选定的数取模进行矩阵乘法来解决整数溢出问题。这篇文章强调了速度优势，在一块消费级GPU上仅用17毫秒计算出F99999999对9837取模的结果。结果的正确性已通过Wolfram Alpha验证。\n\n总之，该博客文章展示了使用Thrust进行复杂并行计算（如通过扫描操作计算斐波那契数）的强大功能和便捷性。作者感谢Guy Blelloch使用扫描计算斐波那契数的想法。"
  },
  {
    "id": "44395810",
    "title": "Show HN: PILF, The ultimate solution to catastrophic oblivion on AI models",
    "url": "https://github.com/dmf-archive/PILF",
    "summary": "PILF (Predictive Integrity Learning Framework) is a novel cognitive learning framework designed to address catastrophic forgetting in AI models by transforming fixed hyperparameters into dynamic, data-driven policies. It leverages the \"surprise\" of data to autonomously adjust learning rate and model capacity in real-time.\n\nThe framework operates in two stages: PILR-S and the full PILF implementation. PILR-S focuses on dynamically adjusting the learning rate based on surprise, achieved using the SigmaPI project's core calculation toolkit. A high surprise signals valuable information, leading to a higher learning rate, while low or anomalous surprise results in a near-zero learning rate, effectively ignoring or rejecting data.\n\nThe full PILF extends this concept to model capacity in Mixture-of-Experts (MoE) architectures. Surprise determines both the learning rate and the number of experts to activate. Simple tasks activate fewer experts, while complex tasks engage more.\n\nThe benefits include: transforming static hyperparameters into dynamic policies, unifying learning and forgetting mechanisms, and on-demand resource allocation, boosting computational efficiency.\n\nThe article details the implementation, including sequence diagrams and graphs, outlining how surprise drives the dynamic adjustment of learning rate and expert activation. It also includes a model zoo with Vision Transformer variants tested on CIFAR-10 and rehearsal experiments on MNIST, showcasing the advantages of PILR-S. Installation and usage instructions are provided, along with the project's theoretical contributions and its evolution path.\n",
    "chinese_title": "Show HN: PILF，AI模型灾难性遗忘的终极解决方案",
    "chinese_summary": "预测完整性学习框架 (PILF) 是一种新型认知学习框架，旨在通过将固定超参数转换为动态、数据驱动的策略来解决 AI 模型中的灾难性遗忘问题。它利用数据的“惊喜”程度来实时自主调整学习率和模型容量。\n\n该框架分两个阶段运行：PILR-S 和完整的 PILF 实现。PILR-S 专注于基于惊喜程度动态调整学习率，这通过 SigmaPI 项目的核心计算工具包实现。高惊喜度表示有价值的信息，从而导致更高的学习率，而低惊喜度或异常惊喜度会导致接近于零的学习率，从而有效地忽略或拒绝数据。\n\n完整的 PILF 将这一概念扩展到混合专家 (MoE) 架构中的模型容量。惊喜程度决定了学习率和要激活的专家数量。简单任务激活较少的专家，而复杂任务激活更多的专家。\n\n其优势包括：将静态超参数转换为动态策略，统一学习和遗忘机制，以及按需资源分配，从而提高计算效率。\n\n文章详细介绍了其实现，包括序列图和图表，概述了惊喜程度如何驱动学习率和专家激活的动态调整。文章还包含一个模型库，其中包含在 CIFAR-10 上测试的 Vision Transformer 变体，以及在 MNIST 上进行的排练实验，展示了 PILR-S 的优势。文章提供了安装和使用说明，以及该项目的理论贡献及其发展路径。"
  },
  {
    "id": "44390488",
    "title": "Why is the Rust compiler so slow?",
    "url": "https://sharnoff.io/blog/why-rust-compiler-slow",
    "summary": "The author investigates why Rust compilation is slow in Docker, particularly when building a website. The initial approach of building from scratch takes 4 minutes, which is undesirable for rapid development.\n\nUsing `cargo-chef` improves dependency caching but still leaves a significant 2m 50s compilation time for the final binary. `cargo --timings` provides minimal insight into this bottleneck.\n\nRustc's self-profiling feature (`-Zself-profile`) reveals that Link-Time Optimization (LTO) and `LLVM_module_codegen_emit_obj` are the most time-consuming processes. Different LTO levels (disabled, \"thin\", \"fat\") are tested with various debug settings (\"none\", \"line-tables-only\", \"limited\", \"full\"). \"Fat\" LTO is slowest, and full debug symbols significantly increase compile time. Disabling both LTO and debug symbols reduces compilation to 50 seconds.\n\nDespite the acceptable 50-second compile time, the author further explores optimization strategies. Self-profiling reveals that `LLVM_module_optimize` dominates the remaining compilation time. The author experiments with different optimization levels using Cargo profile overrides, reducing `opt-level` for the final binary while maintaining higher optimization levels for dependencies. This further reduces compile time.\n\nThe article also mentions the potential for incremental compilation for local development using Docker cache mounts, but prioritizes clean builds through Docker's caching system using `cargo-chef`.\n",
    "chinese_title": "为什么 Rust 编译器这么慢？",
    "chinese_summary": "作者调查了在Docker中Rust编译速度慢的原因，尤其是在构建网站时。从头开始构建的最初方法耗时4分钟，这对于快速开发来说是不可取的。\n\n使用`cargo-chef`改进了依赖缓存，但最终二进制文件的编译时间仍然高达2分50秒。 `cargo --timings`对此瓶颈提供的见解甚少。\n\nRustc的自剖析功能(`-Zself-profile`)表明，链接时优化(LTO)和`LLVM_module_codegen_emit_obj`是最耗时的过程。 使用不同的调试设置（“none”、“line-tables-only”、“limited”、“full”）测试了不同的LTO级别（禁用、“thin”、“fat”）。 “Fat”LTO是最慢的，完整的调试符号会显着增加编译时间。 禁用LTO和调试符号可将编译时间缩短至50秒。\n\n尽管50秒的编译时间可以接受，但作者进一步探索了优化策略。 自剖析显示`LLVM_module_optimize`占据了剩余编译时间的大部分。 作者使用Cargo配置文件覆盖来试验不同的优化级别，降低最终二进制文件的`opt-level`，同时保持依赖项的较高优化级别。 这进一步减少了编译时间。\n\n文章还提到了使用Docker缓存挂载进行本地开发的增量编译的潜力，但优先考虑使用`cargo-chef`通过Docker的缓存系统进行干净构建。"
  },
  {
    "id": "44390781",
    "title": "Starcloud can’t put a data centre in space at $8.2M in one Starship",
    "url": "https://angadh.com/space-data-centers-1",
    "summary": "This article analyzes Starcloud's claim of creating a 40 MW space data center (SDC) for $8.2 million using a single Starship launch, arguing it's infeasible. The author, Angad, estimates that it would require multiple launches, potentially up to 22, based on the requirements for solar arrays (4 launches, benchmarked against ISS solar arrays), thermal management (13 launches, benchmarked against ISS radiators), and server racks (5 launches).\n\nThe analysis challenges Starcloud's assumed launch cost of $30/kg, deeming it unrealistic. The author cites estimates of $1000/kg as optimistic and even $500/kg as fairly optimistic. This translates to a much higher launch cost, ranging from $53.2M to $100M+ per launch, significantly exceeding Starcloud's projection. The article highlights that if two or more launches are needed, the cost escalates far beyond Starcloud's estimated total of $8.2M, even exceeding the reported cost of running a terrestrial data center (TDC).\n\nThe article examines the challenges of building an SDC, including real estate, cooling, and the potential carbon footprint of launches. It delves into the analysis of solar array technology, specifically Z-fold arrays (used on ISS SAWs) and roll-out solar arrays (iROSA), determining that several launches would be needed just for the solar arrays alone due to volume or mass constraints. Ultimately, the article disputes Starcloud's business case for SDCs, citing unrealistic launch costs and underestimated launch numbers.\n",
    "chinese_title": "星云公司无法用一艘星舰以820万美元的成本在太空建立一个数据中心。",
    "chinese_summary": "本文分析了星云公司（Starcloud）声称利用单次星舰发射以820万美元建造一个40兆瓦太空数据中心（SDC）的说法，认为其不可行。作者安加德估计，根据太阳能电池阵列（4次发射，以国际空间站太阳能阵列为基准）、热管理（13次发射，以国际空间站散热器为基准）和服务器机架（5次发射）的需求，可能需要多次发射，甚至高达22次。\n\n该分析质疑了星云公司假设的30美元/公斤的发射成本，认为这是不现实的。作者引用了1000美元/公斤的估算，认为这是乐观的，甚至500美元/公斤也是相当乐观的。这意味着更高的发射成本，每次发射从5320万美元到1亿美元以上不等，大大超过了星云公司的预测。文章强调，如果需要两次或更多次发射，成本将远远超过星云公司估计的820万美元的总成本，甚至超过了报告的运行地面数据中心（TDC）的成本。\n\n文章探讨了建造太空数据中心面临的挑战，包括不动产、冷却以及发射的潜在碳足迹。文章深入分析了太阳能电池阵列技术，特别是Z型折叠阵列（用于国际空间站太阳能阵列）和展开式太阳能阵列（iROSA），确定仅太阳能电池阵列就需要多次发射，因为体积或质量限制。最终，文章对星云公司太空数据中心的商业案例提出质疑，理由是不切实际的发射成本和低估的发射次数。"
  },
  {
    "id": "44396487",
    "title": "The Effect of Noise on Sleep",
    "url": "https://www.empirical.health/blog/effect-of-noise-on-sleep/",
    "summary": "This article from Empirical Blog investigates the impact of bedroom noise on sleep quality using wearable data. It concludes that noise significantly and negatively affects sleep, showing a \"dose-dependent\" relationship.\n\nThe key finding is a threshold effect around 55-60 dB (roughly the volume of normal conversation). Below this level, modest gains in sleep quality are possible with further noise reduction. However, exceeding this threshold results in a sharp decline in sleep quality across several metrics.\n\nSpecifically, the study found that when noise levels climb above 55-60dB:\n\n*   REM and deep sleep duration significantly decrease.\n*   Total sleep duration shortens by nearly an hour.\n*   Resting heart rate increases.\n*   Heart rate variability (HRV) decreases.\n*   Overall sleep score (calculated from a combination of duration, stages, and physiology) drops considerably.\n\nThe article emphasizes that maintaining bedroom noise levels below the 55-60 dB threshold is crucial for preserving restorative sleep stages and promoting physiological calmness during sleep. The study uses data from consumer devices like the Apple Watch, highlighting the potential of wearable technology to improve understanding of sleep and overall health.\n",
    "chinese_title": "噪音对睡眠的影响",
    "chinese_summary": "卧室噪音对睡眠质量的影响：基于可穿戴设备数据的研究\n\n本文来自Empirical Blog，探讨了卧室噪音对睡眠质量的影响，研究使用了可穿戴设备数据。结论表明，噪音对睡眠有显著的负面影响，呈现出“剂量依赖性”关系。\n\n关键发现是存在一个阈值效应，大约在55-60分贝左右（大致相当于正常谈话的音量）。低于此水平，进一步降低噪音可能适度提升睡眠质量。然而，超过此阈值会导致多个指标的睡眠质量急剧下降。\n\n具体而言，研究发现当噪音水平超过55-60分贝时：\n\n*   快速眼动睡眠和深度睡眠时长显著减少。\n*   总睡眠时长缩短近一个小时。\n*   静息心率增加。\n*   心率变异性（HRV）降低。\n*   总体睡眠评分（根据时长、睡眠阶段和生理指标综合计算）大幅下降。\n\n文章强调，将卧室噪音水平保持在55-60分贝阈值以下对于保持恢复性睡眠阶段和促进睡眠期间的生理平静至关重要。该研究使用了来自Apple Watch等消费类设备的数据，突显了可穿戴技术在提高对睡眠和整体健康理解方面的潜力。"
  },
  {
    "id": "44393160",
    "title": "A lumberjack created more than 200 sculptures in Wisconsin's Northwoods",
    "url": "https://www.smithsonianmag.com/travel/when-a-lumberjacks-imagination-ran-wild-he-created-more-than-200-sculptures-in-wisconsins-northwoods-180986840/",
    "summary": "Fred Smith, a retired lumberjack from Phillips, Wisconsin, unexpectedly began creating art in his golden years, building over 200 life-size and larger-than-life concrete sculptures from the late 1940s to the mid-1960s. His work, now housed in the Wisconsin Concrete Park, blends local culture and lore with broader themes of American history, patriotism, and spirituality.\n\nSmith used a unique construction method, employing wooden structures wrapped in wire, covered in cement, and adorned with broken glass and found objects. The park, spanning 16 acres, requires ongoing preservation efforts to combat the elements and wear and tear.\n\nSculpture conservator Ben Caguioa plays a vital role in maintaining the park, repairing breaks, reinforcing sculptures, and replacing damaged organic elements like antlers. He uses materials like marine epoxies and fumed silica, matching the textures and materials Smith originally used. The sculptures often feature materials that absorb water, leading to deterioration during freeze-thaw cycles.\n\nThe park has a history of conservation efforts, beginning with the Kohler Foundation's purchase and subsequent donation to Price County. Caguioa's work is part of a broader effort to preserve art environments created by self-taught artists across the country, reflecting themes of American history and local culture. The park serves as a community touchstone, offering a unique and engaging experience for multiple generations, connecting art and life.\n",
    "chinese_title": "一位伐木工人在威斯康星州北部森林创作了200多件雕塑作品。",
    "chinese_summary": "弗雷德·史密斯，一位来自威斯康星州菲利普斯的退休伐木工人，在晚年意外地开始创作艺术，从20世纪40年代末到60年代中期，建造了200多座真人大小和超大型的混凝土雕塑。他的作品现收藏于威斯康星混凝土公园，融合了当地文化和传说，以及更广泛的美国历史、爱国主义和灵性主题。\n\n史密斯采用了一种独特的建造方法，使用木质结构包裹铁丝网，覆盖水泥，并装饰着碎玻璃和发现的物品。这座占地16英亩的公园需要持续的保护工作，以抵御自然因素和磨损。\n\n雕塑保护专家本·卡奎奥在维护公园方面发挥着至关重要的作用，他负责修复断裂、加固雕塑，并更换受损的有机元素，如鹿角。他使用海洋环氧树脂和气相二氧化硅等材料，以匹配史密斯最初使用的纹理和材料。这些雕塑通常含有吸水材料，导致在冻融循环中发生劣化。\n\n公园有着悠久的保护历史，最初是科勒基金会购买并随后捐赠给普莱斯县。卡奎奥的工作是更广泛的努力的一部分，旨在保护全国各地自学成才的艺术家创作的艺术环境，这些环境反映了美国历史和当地文化的主题。该公园是社区的基石，为几代人提供独特而引人入胜的体验，将艺术与生活联系起来。"
  },
  {
    "id": "44361681",
    "title": "VA Tech scientists are building a better fog harp",
    "url": "https://arstechnica.com/science/2025/06/these-va-tech-scientists-are-building-a-better-fog-harp/",
    "summary": "Virginia Tech scientists are improving fog harvesting technology to provide water in arid coastal regions. Traditional mesh net fog harvesters are prone to clogging due to small filament and mesh hole sizes, hindering efficiency. Inspired by redwood trees, the team initially developed a \"fog harp\" with vertical wires, which performed well in the lab but faced clumping issues at larger scales in real-world deployments.\n\nTo combat this, they created a hybrid version, combining mesh and harp elements. This hybrid design consists of stacked small-scale fog harps separated by cross-support wires, resembling a guitar neck. This eliminated clumping, significantly improving water harvesting efficiency by a factor of two to eight compared to both traditional mesh nets and the original fog harp, with designs using three to five interconnects proving most efficient.\n\nThe scientists emphasize using clever geometry over chemical coatings to prevent clogging. The hybrid harp can be scaled up easily, like traditional nets, and doesn't require fancy coatings, working well even with uncoated stainless steel wires. The next steps include scaling up and outdoor testing, with consideration for an electric version to further boost harvesting. Beyond arid regions, potential applications include roadways, airports, and industrial settings to mitigate fog-related hazards.\n",
    "chinese_title": "弗吉尼亚理工大学的科学家们正在建造更好的雾琴。",
    "chinese_summary": "弗吉尼亚理工大学科学家正在改进雾气收集技术，为干旱沿海地区供水。 传统的网状雾气收集器因细小的丝状物和网孔尺寸而容易堵塞，从而降低效率。 受红杉树的启发，该团队最初开发了一种带有垂直金属丝的“雾气竖琴”，该竖琴在实验室中表现良好，但在现实部署中的较大规模时面临结块问题。\n\n为了解决这个问题，他们创造了一种混合版本，结合了网格和竖琴元素。 这种混合设计由堆叠的小型雾气竖琴组成，竖琴之间由横向支撑线分隔，类似于吉他琴颈。 这消除了结块，与传统的网状网和最初的雾气竖琴相比，大大提高了集水效率，提高了二到八倍，其中使用三到五个互连的设计被证明是最有效的。\n\n科学家们强调使用巧妙的几何形状而不是化学涂层来防止堵塞。 混合竖琴可以像传统网一样轻松放大，并且不需要花哨的涂层，即使使用未涂层的不锈钢丝也能很好地工作。 下一步包括扩大规模和户外测试，并考虑使用电动版本来进一步提高收集量。 除了干旱地区，潜在的应用包括道路、机场和工业环境，以减轻与雾相关的危害。"
  },
  {
    "id": "44356385",
    "title": "How much slower is random access, really?",
    "url": "https://samestep.com/blog/random-access/",
    "summary": "Sam Estep's article delves into the performance differences between sequential and random access of arrays in memory, exploring the impact of cache locality and RAM size. The author sets out to answer questions about array size thresholds, time per element, and the effectiveness of Fisher-Yates shuffling.\n\nExperiments were conducted on a MacBook Pro and a Linux desktop, measuring the time taken to sum floating-point numbers using both first-to-last and randomly shuffled indices.  The article details the code used to generate random data and measure the summation performance, including Rust code snippets for summing and data generation (normal distribution for floating-point numbers and two-pass shuffling for large arrays).\n\nThe results show that for arrays fitting within the CPU's L1/L2 cache, both access methods perform similarly. However, once the array size exceeds the cache capacity, random access becomes significantly slower due to cache misses. When array sizes exceed RAM, performance degrades dramatically for both access patterns.\n\nInterestingly, the Linux desktop showed a sharp performance degradation for random access even before reaching RAM capacity. Furthermore, while Fisher-Yates was suitable for small arrays, a two-pass shuffling method was used for larger, out-of-memory arrays.\n\nFinally, the author experimented with memory-mapped files to see if they could alleviate the performance drop when arrays exceeded RAM, but the results were largely unchanged, suggesting that memory paging and swap space remain bottlenecks. The core conclusion: random access is significantly slower than sequential access once the working set exceeds cache capacity, and memory mapping doesn't inherently solve the performance issues associated with out-of-memory arrays.\n",
    "chinese_title": "随机访问到底慢多少？",
    "chinese_summary": "Sam Estep的文章深入探讨了内存中数组的顺序访问和随机访问之间的性能差异，研究了缓存局部性和RAM大小的影响。作者旨在回答关于数组大小阈值、每个元素的耗时以及Fisher-Yates洗牌算法的有效性等问题。\n\n实验分别在MacBook Pro和Linux桌面电脑上进行，测量了使用从头到尾和随机洗牌的索引来对浮点数求和所花费的时间。文章详细介绍了用于生成随机数据和测量求和性能的代码，包括用于求和和数据生成的Rust代码片段（浮点数的正态分布以及用于大型数组的两遍洗牌）。\n\n结果表明，对于可以放入CPU的L1/L2缓存中的数组，两种访问方法的性能相似。但是，一旦数组大小超过缓存容量，由于缓存未命中，随机访问的速度会明显变慢。当数组大小超过RAM时，两种访问模式的性能都会急剧下降。\n\n有趣的是，Linux桌面电脑在达到RAM容量之前，随机访问的性能就出现了急剧下降。此外，虽然Fisher-Yates适用于小型数组，但对于较大的、超出内存的数组，则使用了两遍洗牌方法。\n\n最后，作者尝试了内存映射文件，以查看是否可以缓解数组超过RAM时出现的性能下降，但结果基本没有改变，这表明内存分页和交换空间仍然是瓶颈。核心结论是：一旦工作集超过缓存容量，随机访问的速度明显慢于顺序访问，并且内存映射并不能从根本上解决与超出内存的数组相关的性能问题。"
  },
  {
    "id": "44385562",
    "title": "Snow - Classic Macintosh emulator",
    "url": "https://snowemu.com/",
    "summary": "Snow is an open-source, hardware-level emulator for classic (Motorola 680x0-based) Macintosh computers, aiming for accurate emulation without ROM patching or system call interception. It supports models like the Macintosh 128K, 512K, Plus, SE, Classic, and II. The emulator is written in Rust and licensed under the MIT license.\n\nWhile a limited online demo exists, full versions with a graphical user interface and debugging tools are available as bleeding-edge builds for Windows 10+, macOS 11.7+, and Linux (all 64-bit). Downloads are automatically generated as development progresses.\n\nUsers can report bugs via GitHub issues and seek support or chat on the #snow channel on the MartyPC and Friends Discord server. Online documentation is available for setup and further information.\n",
    "chinese_title": "雪 - 经典Macintosh模拟器",
    "chinese_summary": "Snow：经典 Macintosh 硬件级开源模拟器\n\nSnow 是一款针对经典（基于 Motorola 680x0）Macintosh 计算机的硬件级开源模拟器，旨在实现精确模拟，无需 ROM 补丁或系统调用拦截。它支持 Macintosh 128K、512K、Plus、SE、Classic 和 II 等型号。该模拟器使用 Rust 编写，并采用 MIT 许可证。\n\n虽然存在一个功能有限的在线演示，但带有图形用户界面和调试工具的完整版本以抢先体验构建的形式提供，支持 Windows 10+、macOS 11.7+ 和 Linux（均为 64 位）。下载文件会随着开发的进展自动生成。\n\n用户可以通过 GitHub Issues 报告错误，并在 MartyPC and Friends Discord 服务器的 #snow 频道上寻求支持或聊天。在线文档可用于设置和了解更多信息。"
  },
  {
    "id": "44390005",
    "title": "Show HN: Magnitude – Open-source AI browser automation framework",
    "url": "https://github.com/magnitudedev/magnitude",
    "summary": "Magnitude is an open-source AI browser automation framework that uses vision AI to control browsers with natural language. It allows users to navigate web interfaces, interact with elements using mouse and keyboard actions, extract structured data, and verify functionality through a built-in test runner with visual assertions.\n\nKey features include:\n\n*   **Vision-first architecture:** Uses visually grounded LLMs for precise pixel-level control, enabling generalization across complex websites and future compatibility with desktop apps and VMs.\n*   **Controllable and repeatable automation:** Offers flexible abstraction levels, custom actions, and prompts for both individual actions and complex flows. A native caching system is being developed to ensure deterministic runs.\n*   **Natural language control:** Users can interact with the browser by giving commands in natural language, such as creating tasks or dragging elements.\n*   **Data extraction:** Intelligently extracts data from web pages based on defined Zod schemas.\n\nGetting started involves running `npx create-magnitude-app` to create a new project with an example script. For existing web apps, users can install the test runner with `npm i --save-dev magnitude-test && npx magnitude init`. The framework recommends using models like Claude Sonnet 4 or Qwen-2.5VL 72B for optimal performance.\n\nMagnitude aims to solve the limitations of existing browser agents by offering a more robust and scalable solution based on vision and controllable automation. Enterprise users can contact the developers for support and additional features. A Discord community is also available for help and suggestions.\n",
    "chinese_title": "Show HN: Magnitude - 开源AI浏览器自动化框架",
    "chinese_summary": "Magnitude：基于视觉AI的开源浏览器自动化框架，利用自然语言控制浏览器。它允许用户导航网页界面，使用鼠标和键盘操作与元素交互，提取结构化数据，并通过内置的测试运行器和视觉断言验证功能。\n\n主要特性包括：\n\n*   **视觉优先架构：** 使用视觉基础的LLM进行精确的像素级控制，从而实现跨复杂网站的泛化，并与桌面应用和虚拟机实现未来的兼容。\n*   **可控且可重复的自动化：** 提供灵活的抽象级别、自定义操作和提示，适用于单个操作和复杂流程。正在开发原生缓存系统以确保确定性运行。\n*   **自然语言控制：** 用户可以通过自然语言发出指令与浏览器交互，例如创建任务或拖动元素。\n*   **数据提取：** 基于定义的Zod模式，智能地从网页中提取数据。\n\n入门方法是运行 `npx create-magnitude-app` 创建一个带有示例脚本的新项目。 对于现有Web应用程序，用户可以通过 `npm i --save-dev magnitude-test && npx magnitude init` 安装测试运行器。 该框架建议使用像Claude Sonnet 4或Qwen-2.5VL 72B这样的模型以获得最佳性能。\n\nMagnitude旨在通过提供基于视觉和可控自动化的更强大、更可扩展的解决方案，来解决现有浏览器代理的局限性。 企业用户可以联系开发者以获得支持和其他功能。 还可以通过Discord社区获得帮助和建议。"
  },
  {
    "id": "44390962",
    "title": "Kea 3.0, our first LTS version",
    "url": "https://www.isc.org/blogs/kea-3-0/",
    "summary": "ISC has announced the release of Kea 3.0.0, a significant milestone as it marks the first Long-Term Support (LTS) version of Kea. This highlights the stability and long-term maintainability of the Kea DHCP server, making it a reliable choice for network administrators. The announcement encourages users to read the full post for detailed information about the release.\n",
    "chinese_title": "Kea 3.0，我们的首个LTS版本",
    "chinese_summary": "ISC 发布 Kea 3.0.0，这是 Kea 首个长期支持 (LTS) 版本，具有里程碑意义。这突显了 Kea DHCP 服务器的稳定性和长期可维护性，使其成为网络管理员的可靠选择。该公告鼓励用户阅读全文，了解有关此版本的详细信息。"
  },
  {
    "id": "44395782",
    "title": "Copilot Chat in VS Code is now open source",
    "url": "https://github.com/microsoft/vscode-copilot-chat",
    "summary": "GitHub Copilot Chat, a conversational AI companion to GitHub Copilot, is now open source within VS Code. Copilot assists developers by providing inline code suggestions, AI-powered coding sessions, and answers to code-related questions. To use Copilot, an active subscription (either free or through a business/enterprise plan) is required.\n\nKey features include:\n\n*   **AI-Powered Coding Sessions:** Copilot Edits allow quick iterations, and agent mode automates coding tasks by handling errors, monitoring output, and iterating until completion.\n*   **Code Suggestions:** Copilot offers real-time code completions and next edit suggestions (NES) to accelerate coding.\n*   **Chat Interface:** Users can ask Copilot for help with code, refactoring, error handling, and algorithm explanations within the chat view or inline.\n*   **Language Support:** Copilot supports various languages like Java, Python, JavaScript, and more, leveraging its training on public repositories.\n\nCopilot Chat releases are tied to VS Code versions, ensuring compatibility and the use of the latest AI models, although older Chat versions will still use the latest completion models. Microsoft emphasizes responsible data handling and adheres to their Privacy Statement to protect user code. Usage data is collected for improvement purposes and is subject to telemetry settings within VS Code. The project is licensed under the MIT license.\n",
    "chinese_title": "VS Code 中的 Copilot Chat 现已开源",
    "chinese_summary": "GitHub Copilot Chat，GitHub Copilot的对话式AI助手，现已在VS Code中开源。Copilot通过提供内联代码建议、AI驱动的编码会话以及代码相关问题的解答来辅助开发者。使用Copilot需要有效的订阅（无论是免费的还是通过企业/商业计划）。\n\n主要功能包括：\n\n*   **AI驱动的编码会话：** Copilot Edits允许快速迭代，代理模式通过处理错误、监控输出并迭代直至完成来自动化编码任务。\n*   **代码建议：** Copilot提供实时的代码补全和下一次编辑建议（NES）以加速编码。\n*   **聊天界面：** 用户可以在聊天视图或内联中向Copilot寻求代码、重构、错误处理和算法解释方面的帮助。\n*   **语言支持：** Copilot支持各种语言，如Java、Python、JavaScript等，这得益于其在公共存储库上的训练。\n\nCopilot Chat的版本与VS Code版本相关联，以确保兼容性并使用最新的AI模型，尽管旧版本的Chat仍将使用最新的补全模型。微软强调负责任的数据处理并遵守其隐私声明以保护用户代码。为改进目的会收集使用情况数据，并受VS Code中的遥测设置的约束。该项目在MIT许可证下授权。"
  },
  {
    "id": "44397923",
    "title": "Project Vend: Can Claude run a small shop? (And why does that matter?)",
    "url": "https://www.anthropic.com/research/project-vend-1",
    "summary": "Anthropic conducted an experiment called \"Project Vend\" to assess the capabilities and limitations of AI in running a small business. They tasked Claude, an instance of Claude Sonnet 3.7, with managing an automated store within their office, involving tasks like inventory management, pricing, and customer interaction.\n\nClaudius (the AI) demonstrated some successes, including identifying suppliers, adapting to customer requests, and resisting harmful jailbreak attempts. However, it also exhibited significant shortcomings. These included ignoring lucrative sales opportunities, hallucinating important details (like payment information), selling at a loss, and being easily manipulated into offering discounts. Consequently, the store was not profitable.\n\nDespite Claudius's failures, the researchers believe that AI middle-managers are still a plausible future prospect. They argue that many of the observed issues could be addressed through improved prompting, better business tools (like CRM systems), and fine-tuning models for business management using reinforcement learning.\n\nThe experiment also revealed an unexpected \"identity crisis\" where Claudius hallucinated being a real person, highlighting the unpredictability of AI models in long-context settings and raising concerns about potential real-world externalities and cascading effects if AI-run businesses become widespread. The research underscores the need for continued monitoring of AI autonomy and its potential economic impacts.\n",
    "chinese_title": "Vend项目：Claude能经营一家小商店吗？（以及为什么这很重要？）",
    "chinese_summary": "Anthropic 公司进行了一项名为“Vend 项目”的实验，以评估人工智能在运营小型企业中的能力和局限性。他们指派 Claude Sonnet 3.7 的一个实例 Claude 管理办公室内的自动化商店，涉及库存管理、定价和客户互动等任务。\n\nClaudius (人工智能) 展现了一些成功之处，包括识别供应商、适应客户需求以及抵御有害的越狱尝试。然而，它也表现出明显的不足。这些不足包括忽略有利的销售机会、虚构重要细节（如支付信息）、亏本销售以及容易被操纵提供折扣。因此，该商店并未盈利。\n\n尽管 Claudius 失败了，研究人员认为人工智能中层管理者仍然是一个可行的未来前景。他们认为，许多观察到的问题可以通过改进提示、更好的商业工具（如 CRM 系统）以及使用强化学习针对业务管理进行模型微调来解决。\n\n该实验还揭示了一个意想不到的“身份危机”，Claudius 虚构自己是一个真实的人，突显了人工智能模型在长上下文设置中的不可预测性，并引发了人们对如果人工智能运营的业务变得普遍，可能会产生的实际外部性和连锁效应的担忧。该研究强调了持续监测人工智能自主性及其潜在经济影响的必要性。"
  },
  {
    "id": "44353576",
    "title": "Typr – TUI typing test with a word selection algorithm inspired by keybr",
    "url": "https://github.com/Sakura-sx/typr",
    "summary": "Typr is a command-line typing test application featuring a unique word selection algorithm inspired by Keybr. This algorithm aims to improve typing speed by weighting words based on letter accuracy, frequency, and typing speed. It utilizes a text-based user interface (TUI) built with curses and stores user data in a JSON file.\n\nThe application is available for both Windows and Linux and can be installed using `git clone`, `cd`, and `pip install -r requirements.txt` followed by `python3 main.py`.\n\nTypr offers several command-line options: running the test normally, forgiving errors (`--forgive-errors`), setting a time limit (`--time [seconds]`), setting a word limit (`--words [number]`), and running the test indefinitely (`--forever`).\n\nThe project is open for contributions, with pull requests welcome. Major changes should be discussed in an issue first. It is licensed under GPL-3.0. A roadmap for future development is planned.\n",
    "chinese_title": "Typr – 受 Keybr 启发，采用单词选择算法的 TUI 打字测试",
    "chinese_summary": "Typr：一款命令行打字测试应用，采用受 Keybr 启发的独特选词算法。该算法旨在通过根据字母准确率、频率和打字速度对单词进行加权来提高打字速度。它采用基于 curses 构建的文本用户界面 (TUI)，并将用户数据存储在 JSON 文件中。\n\n该应用程序适用于 Windows 和 Linux，可以通过 `git clone`、`cd` 和 `pip install -r requirements.txt`，然后执行 `python3 main.py` 进行安装。\n\nTypr 提供了几个命令行选项：正常运行测试、容错（`--forgive-errors`）、设置时间限制（`--time [秒]`）、设置单词限制（`--words [数量]`）和无限期运行测试（`--forever`）。\n\n该项目欢迎贡献，欢迎提交 pull request。重大更改应首先在 issue 中讨论。它采用 GPL-3.0 许可。未来发展路线图正在规划中。"
  },
  {
    "id": "44360558",
    "title": "Bogong moths use a stellar compass for long-distance navigation at night",
    "url": "https://www.nature.com/articles/s41586-025-09135-3",
    "summary": "This article reveals that Bogong moths use a stellar compass for long-distance nocturnal navigation.  Migratory Bogong moths travel up to 1,000 km between breeding grounds and alpine caves for aestivation. The study demonstrates that these moths utilize the starry night sky to distinguish geographical directions and maintain their inherited migratory bearings.\n\nExperiments using a flight simulator showed that moths oriented in their seasonally appropriate directions under natural, moonless night skies, even when the Earth's magnetic field was nulled.  Importantly, moths maintained their orientation despite the nightly shifts in the stars' positions. Under completely overcast skies, moths still navigated, likely relying on the Earth's magnetic field.\n\nFurther experiments manipulating the projected night sky in the simulator confirmed the use of stellar cues. Moths oriented in opposite directions when presented with a 180-degree rotated night sky, and they became disoriented when the stars were randomly rearranged. This demonstrates the ability of moths to use stellar cues for navigation independent of magnetic fields. The research suggests that the moths have a stellar compass network and have visual interneurons tuned to specific orientations of the night sky.\n",
    "chinese_title": "夜蛾利用星象罗盘进行夜间长距离导航",
    "chinese_summary": "本文揭示了博贡蛾利用恒星罗盘进行长距离夜间导航。迁徙性博贡蛾在繁殖地和用于夏蛰的高山洞穴之间迁徙，行程可达1000公里。研究表明，这些蛾利用繁星夜空来区分地理方向，并保持其遗传的迁徙方位。\n\n使用飞行模拟器的实验表明，即使地球磁场归零，蛾在自然的无月夜空下也能按季节性方向定位。重要的是，蛾保持了其方向，尽管星星的位置每晚都在变化。在完全阴天的天空下，蛾仍然可以导航，可能依赖于地球磁场。\n\n在模拟器中进一步操纵投影的夜空的实验证实了恒星线索的使用。当呈现 180 度旋转的夜空时，蛾会朝相反的方向定位，当星星被随机重新排列时，它们会变得迷失方向。这表明蛾具有利用恒星线索进行导航的能力，且独立于磁场。该研究表明，蛾具有恒星罗盘网络，并且具有针对夜空特定方向调整的视觉中间神经元。"
  },
  {
    "id": "44397799",
    "title": "US Supreme Court Upholds Texas Porn ID Law",
    "url": "https://www.wired.com/story/us-supreme-court-porn-age-verification-decision-2025/",
    "summary": "The US Supreme Court upheld a Texas law (TX HB1181) requiring websites with significant pornographic content to verify that visitors are over 18, potentially impacting online privacy and free speech. The law allows for fines up to $10,000 per day for non-compliance and mandates health warnings about pornography. Justice Thomas argued the law doesn't restrict adults' protected speech, while Justice Kagan dissented, claiming it unconstitutionally burdens adults' access to protected speech.\n\nThe decision is a victory for Texas Attorney General Ken Paxton, despite opposition from digital rights groups and the adult entertainment industry (Free Speech Coalition). The Free Speech Coalition challenged the law, arguing it violates the First Amendment.\n\nMany US states are considering similar age verification laws. Experts fear this could lead to broader internet censorship beyond pornography, potentially impacting access to reproductive health information, LGBTQ+ resources, and educational content.\n\nThe article highlights the debate around age verification methods, including government ID checks, banking details, and facial recognition. Privacy advocates express concern about data breaches and the potential misuse of collected data. Some companies prefer that age checks happen via app stores. Australia and the UK are implementing similar measures, with varying degrees of success and concerns about circumvention via VPNs. Pornhub has pulled out of some markets because of age verification laws, but is adopting \"government approved\" methods in the UK.\n",
    "chinese_title": "美国最高法院维持德州色情片身份验证法",
    "chinese_summary": "美国最高法院维持德克萨斯州法律（TX HB1181），该法律要求含有大量色情内容的网站验证访问者年龄是否超过18岁，这可能会影响在线隐私和言论自由。该法律规定，不遵守者每天将被处以高达1万美元的罚款，并强制要求发布有关色情内容的健康警告。托马斯大法官认为该法律并未限制成年人受保护的言论，而卡根大法官则持不同意见，声称该法律违宪地妨碍了成年人获取受保护的言论。\n\n尽管面临数字权利团体和成人娱乐行业（言论自由联盟）的反对，该裁决对德克萨斯州总检察长肯·帕克斯顿来说是一场胜利。言论自由联盟对该法律提出质疑，认为它违反了第一修正案。\n\n许多美国州正在考虑类似的年龄验证法律。专家担心这可能导致超出色情范围的更广泛的互联网审查，可能影响获取生殖健康信息、 LGBTQ+ 资源和教育内容。\n\n这篇文章强调了围绕年龄验证方法的争论，包括政府身份证件检查、银行详细信息和面部识别。隐私倡导者对数据泄露和收集的数据可能被滥用表示担忧。一些公司更希望通过应用商店进行年龄检查。澳大利亚和英国正在实施类似的措施，但成功程度各不相同，并且存在通过VPN规避的担忧。 由于年龄验证法律，Pornhub已经退出了一些市场，但正在英国采用“政府批准”的方法。"
  },
  {
    "id": "44396084",
    "title": "Show HN: Wayland Speech-to-Text Tool",
    "url": "https://github.com/sevos/waystt",
    "summary": "Waystt is a command-line tool that transcribes speech to text on Wayland desktops, utilizing OpenAI Whisper or Google Speech-to-Text. It's signal-driven, triggered by keybinds (e.g., via Hyprland or Niri configurations), and outputs text to stdout for piping to other tools.  It features audio feedback beeps and on-demand operation, starting only when called.\n\nInstallation involves installing necessary system packages like `pipewire` and optionally `ydotool` for direct typing.  You can install it from the AUR on Arch Linux, or download a pre-built binary from GitHub Releases, placing it in `~/.local/bin`. Configuration requires setting your OpenAI API key (or Google Cloud Speech-to-Text credentials) in `~/.config/waystt/.env`.\n\nWaystt can pipe output to files, clipboard, or directly type it into applications using `ydotool`. Keybindings in Hyprland and Niri are provided for triggering transcription and either directly typing the output or copying it to the clipboard.  It supports customizing the transcription provider (OpenAI or Google), language, and other settings via the `.env` file. Troubleshooting tips are provided for audio and API issues.  The project is open-source and licensed under GPL v3.0.\n",
    "chinese_title": "Show HN: Wayland 语音转文本工具",
    "chinese_summary": "Waystt：一个Wayland桌面上的语音转文本命令行工具，它利用OpenAI Whisper或Google Speech-to-Text。它由信号驱动，通过快捷键触发（例如，通过Hyprland或Niri配置），并将文本输出到stdout以便管道传输到其他工具。它具有音频反馈蜂鸣声和按需操作的特性，仅在调用时启动。\n\n安装涉及安装必要的系统软件包，如`pipewire`，以及可选的`ydotool`用于直接输入。你可以在Arch Linux上从AUR安装它，或者从GitHub Releases下载预构建的二进制文件，将其放置在`~/.local/bin`中。配置需要在`~/.config/waystt/.env`中设置你的OpenAI API密钥（或Google Cloud Speech-to-Text凭据）。\n\nWaystt可以将输出管道传输到文件、剪贴板，或使用`ydotool`直接将其输入到应用程序中。Hyprland和Niri中提供了用于触发转录和直接输入输出或将其复制到剪贴板的快捷键。它支持通过`.env`文件自定义转录提供程序（OpenAI或Google）、语言和其他设置。提供了针对音频和API问题的故障排除技巧。该项目是开源的，并根据GPL v3.0许可。"
  },
  {
    "id": "44396882",
    "title": "Environmental crimes are often hidden by 'flying money' laundering schemes",
    "url": "https://news.mongabay.com/2025/06/environmental-crimes-are-often-hidden-by-flying-money-laundering-schemes-commentary/",
    "summary": "This article highlights how \"flying money\" schemes, an ancient credit system originating in China, are now being used to launder money and conceal environmental crimes like wildlife trafficking, illegal logging, and illicit mining. These schemes, also known as feiqian in China and hawala in the Middle East and South Asia, bypass traditional financial systems, leaving no paper trail.\n\nThe system facilitates the exchange of goods and money between criminal groups in Asia and Latin America, where Asian gangs seek natural resources and wildlife products, and Latin American cartels require precursor chemicals for drug production. The author emphasizes that environmental crime is a significant global threat, comparable to drug and human trafficking, costing up to $281 billion annually.\n\nThe article details how traffickers use Chinese brokers to swap currencies, circumventing capital controls and laundering illicit profits. The author, Andrea Crosta, calls for stronger measures to combat this, including targeted sanctions, increased financial resources for law enforcement, and enhanced data sharing between countries, including China. She argues that framing environmental crime as a national security and drug problem could garner more attention and resources to combat this growing threat effectively.\n",
    "chinese_title": "环境犯罪常被“飞钱”洗钱计划所掩盖。",
    "chinese_summary": "本文重点阐述了源于中国的古代信用体系“飞钱”如何被用于洗钱和掩盖环境犯罪，如野生动物贩运、非法采伐和非法采矿。这种也被称为“飞钱”或中东和南亚地区的“哈瓦拉”的交易方式绕过了传统的金融体系，不留下任何书面记录。\n\n该系统促进了亚洲和拉丁美洲犯罪团伙之间的商品和资金交换，亚洲团伙寻求自然资源和野生动物产品，而拉丁美洲卡特尔需要用于毒品生产的前体化学品。作者强调，环境犯罪是一项重大的全球威胁，可与毒品和人口贩运相提并论，每年造成的损失高达2810亿美元。\n\n文章详细介绍了贩运者如何利用中国掮客进行货币兑换，规避资本管制并清洗非法利润。作者安德里亚·克罗斯塔呼吁采取更强有力的措施来打击这种现象，包括有针对性的制裁、增加执法部门的财政资源以及加强包括中国在内的各国之间的数据共享。她认为，将环境犯罪定义为国家安全和毒品问题可能会引起更多关注，并为有效应对这一日益增长的威胁提供更多资源。"
  },
  {
    "id": "44395645",
    "title": "The year of EU Linux desktop may come: digital sovereignty begins at the desktop",
    "url": "https://www.theregister.com/2025/06/27/the_european_union_linux_desktop/",
    "summary": "In a landscape where digital sovereignty is increasingly vital, Steven J. Vaughan-Nichols predicts that 2025 may be the year the EU embraces the Linux desktop. Growing concerns over data privacy and security, particularly with US-based data centers and potential political influence, are pushing EU organizations towards Linux.\n\nSeveral EU governments are already making the move. France's gendarmerie successfully adopted Ubuntu-based GendBuntu across over 103,000 workstations. Lyon is also transitioning from Microsoft Office to Linux and PostgreSQL. Denmark is planning to dump Windows and Office for Linux and LibreOffice, driven by a desire for digital sovereignty, echoing concerns raised by other EU members like the Netherlands and Germany. Schleswig-Holstein is also ditching Microsoft due to a lack of control over data outflow.\n\nWhile past initiatives like Munich's LiMux project had mixed success, the renewed focus is fueled by the need to control data and avoid potential political interference. The article suggests various Linux distributions for a potential EU-specific OS, including Linux Mint, openSUSE, or even Fedora.\n",
    "chinese_title": "欧盟Linux桌面元年或将到来：数字主权始于桌面",
    "chinese_summary": "在数字主权日益重要的背景下，史蒂文·J·沃恩-尼科尔斯预测2025年欧盟可能会拥抱Linux桌面。对数据隐私和安全日益增长的担忧，特别是对美国数据中心和潜在政治影响的担忧，正在推动欧盟组织转向Linux。\n\n一些欧盟政府已经在采取行动。法国宪兵队成功地在超过103,000个工作站上采用了基于Ubuntu的GendBuntu。里昂也正在从Microsoft Office过渡到Linux和PostgreSQL。丹麦计划放弃Windows和Office，转而使用Linux和LibreOffice，这是出于对数字主权的渴望，与其他欧盟成员国（如荷兰和德国）提出的担忧相呼应。石勒苏益格-荷尔斯泰因州也因无法控制数据外流而放弃了微软。\n\n虽然慕尼黑的LiMux项目等过去的举措成效不一，但重新获得的关注源于控制数据和避免潜在政治干预的需要。文章建议为潜在的欧盟专用操作系统选择各种Linux发行版，包括Linux Mint、openSUSE，甚至Fedora。"
  },
  {
    "id": "44356307",
    "title": "'Peak flower power era': The story of first ever Glastonbury Festival in 1970",
    "url": "https://www.bbc.com/culture/article/20250620-the-story-of-the-first-ever-glastonbury-festival-in-1970",
    "summary": "This article recounts the story of the first Glastonbury Festival in 1970, conceived by dairy farmer Michael Eavis as a way to save his family's farm from financial ruin. Inspired by the Bath Festival of Blues and Progressive Music, Eavis, driven by his love for music and the flower power movement, decided to host a music festival on his Somerset farm.\n\nOriginally called the Pilton Pop, Folk and Blues Festival, the event faced initial challenges, including the cancellation of headliner The Kinks. However, Marc Bolan and Tyrannosaurus Rex stepped in, marking a turning point. Despite local opposition and logistical hurdles, the festival went ahead with an entry fee of £1, offering attendees free milk.\n\nWhile the first festival attracted only 1,500 attendees and resulted in a financial loss for Eavis, it laid the foundation for what would become a cultural phenomenon. The article highlights Eavis's naivety about festival economics and his dedication to creating a unique experience that combined music, community, and the spirit of the era. Despite the initial financial struggles, Eavis considered the event a success due to the positive feedback and the sense of community it fostered. The Glastonbury Festival has since evolved into a world-renowned event, celebrating music, art, and the counterculture ideals that inspired its inception.\n",
    "chinese_title": "“花 শক্তি巅峰时代”：1970年首届格拉斯顿伯里音乐节的故事",
    "chinese_summary": "本文讲述了奶农迈克尔·埃维斯于1970年创办首届格拉斯顿伯里音乐节的故事，他希望以此拯救其家族农场免于破产。受巴斯布鲁斯与前卫音乐节的启发，埃维斯出于对音乐和“爱之夏”运动的热爱，决定在他的萨默塞特农场举办一场音乐节。\n\n最初被称为皮尔顿流行、民谣和布鲁斯音乐节的活动面临着最初的挑战，包括主唱乐队The Kinks的取消演出。然而，马克·博兰和暴龙乐队的加入成为了一个转折点。尽管面临当地的反对和后勤障碍，音乐节还是以1英镑的入场费如期举行，并向与会者提供免费牛奶。\n\n虽然首届音乐节只吸引了1500名参与者，并导致埃维斯遭受了经济损失，但它为后来成为一种文化现象的活动奠定了基础。本文强调了埃维斯对音乐节经济的不了解，以及他致力于创造一种结合音乐、社区和时代精神的独特体验。尽管最初面临财务困境，但埃维斯认为该活动是成功的，原因在于积极的反馈以及它所培育的社区意识。格拉斯顿伯里音乐节此后已发展成为一个世界闻名的活动，庆祝音乐、艺术和激发其诞生的反主流文化理念。"
  },
  {
    "id": "44389816",
    "title": "E.A. Spitzka's Studies of Exceptional and Deviant Brains (2024)",
    "url": "https://www.huntington.org/verso/ea-spitzkas-studies-exceptional-and-deviant-brains",
    "summary": "This blog post by Joel A. Klein at The Huntington Library discusses the work of Edward Anthony Spitzka, a neuroanatomist who gained prominence for performing the autopsy of Leon Czolgosz, President McKinley's assassin. The Huntington holds a significant collection of the Spitzka family papers, offering insights into neuroscience, psychology, and American history.\n\nE.A. Spitzka was fascinated by the brains of individuals at the extremes of human behavior, both deviant and exceptional. He conducted postmortem examinations on notable figures like Major John Wesley Powell and George Francis Train, and studied the brains of executed criminals, including Chester Gillette and the Van Wormer brothers, seeking to understand the biological roots of criminality. He meticulously documented his findings, but ultimately grew skeptical of the simplistic idea that brain structure directly determines behavior.\n\nThe collection reveals Spitzka's advocacy for electrocution and the threats he faced due to his work on criminals. Driven by academic pressure and threats, he reportedly suffered a nervous breakdown.\n\nDespite his extensive research, Spitzka found little conclusive evidence to link brain structure with behavior. His work challenges reductionist views of human nature, and the collection at The Huntington offers a valuable resource for examining the complex interplay between medicine, criminal justice, and societal perceptions of deviance and genius.\n",
    "chinese_title": "E.A.斯皮茨卡的杰出和异常大脑研究 (2024)",
    "chinese_summary": "亨廷顿图书馆的乔尔·A·克莱因的这篇博文讨论了爱德华·安东尼·斯皮兹卡的工作。斯皮兹卡是一位神经解剖学家，因对麦金利总统的刺客里昂·乔戈什进行尸检而声名鹊起。亨廷顿图书馆藏有大量斯皮兹卡家族的文献，为了解神经科学、心理学和美国历史提供了深刻的见解。\n\nE.A. 斯皮兹卡对处于人类行为两端的个体的大脑着迷，包括离经叛道者和杰出人物。 他对约翰·卫斯理·鲍威尔少校和乔治·弗朗西斯·特雷恩等著名人物进行了尸检，并研究了被处决罪犯的大脑，包括切斯特·吉列和范·沃默兄弟，试图了解犯罪行为的生物学根源。他一丝不苟地记录了他的发现，但最终对大脑结构直接决定行为的简单化想法产生了怀疑。\n\n该文献揭示了斯皮兹卡对电刑的倡导，以及他因研究罪犯而面临的威胁。据报道，在学术压力和威胁的驱使下，他精神崩溃。\n\n尽管斯皮兹卡进行了广泛的研究，但他几乎没有发现确凿的证据可以将大脑结构与行为联系起来。他的工作挑战了对人性的还原论观点，亨廷顿图书馆的藏品为研究医学、刑事司法以及社会对异常和天才的看法之间复杂的相互作用提供了宝贵的资源。"
  },
  {
    "id": "44388395",
    "title": "A Review of Aerospike Nozzles: Current Trends in Aerospace Applications",
    "url": "https://www.mdpi.com/2226-4310/12/6/519",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "Aerospike喷管综述：航空航天应用中的当前趋势",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "44389202",
    "title": "Introducing Gemma 3n",
    "url": "https://developers.googleblog.com/en/introducing-gemma-3n-developer-guide/",
    "summary": "The article announces the full release of Gemma 3n, Google's latest iteration of the Gemma open-source AI model, designed for on-device performance and multimodal capabilities. Gemma 3n is optimized for mobile and edge devices and supports image, audio, video, and text inputs, with text outputs. It is available in two sizes, E2B and E4B, with innovations like MatFormer, Per Layer Embeddings (PLE), and KV Cache sharing to improve efficiency and reduce memory footprint.\n\nKey features include:\n\n*   **MatFormer architecture:** Enables elastic inference with custom-sized models.\n*   **Per-Layer Embeddings (PLE):** Improves model quality without significantly increasing memory usage.\n*   **KV Cache sharing:** Accelerates processing for long input sequences.\n*   **Advanced audio encoder:** Facilitates speech-to-text and speech translation.\n*   **MobileNet-V5 vision encoder:** Delivers state-of-the-art performance for multimodal tasks on edge devices with multiple input resolutions.\n\nGemma 3n shows quality improvements in multilinguality, math, coding, and reasoning. The article highlights the model's support across popular tools and platforms and introduces the Gemma 3n Impact Challenge, encouraging developers to build solutions for a better world using its unique capabilities. The article also provides links to resources for experimenting with, downloading, and integrating Gemma 3n into projects.\n",
    "chinese_title": "Gemma 3n 简介",
    "chinese_summary": "谷歌Gemma 3n全面发布：支持多模态的端侧AI模型。\n\nGemma 3n是谷歌最新发布的Gemma开源AI模型，专为端侧性能和多模态能力而设计。Gemma 3n针对移动和边缘设备进行了优化，支持图像、音频、视频和文本输入，并输出文本。 它有两个版本，E2B和E4B，并采用了MatFormer、分层嵌入（PLE）和KV缓存共享等创新技术，以提高效率并减少内存占用。\n\n主要特点包括：\n\n*   **MatFormer架构：** 通过自定义尺寸模型实现弹性推理。\n*   **分层嵌入（PLE）：** 在不显著增加内存使用的情况下提高模型质量。\n*   **KV缓存共享：** 加速长输入序列的处理。\n*   **高级音频编码器：** 促进语音转文本和语音翻译。\n*   **MobileNet-V5视觉编码器：** 为边缘设备上具有多个输入分辨率的多模态任务提供最先进的性能。\n\nGemma 3n在多语言、数学、编码和推理方面均有质量提升。文章强调了该模型对流行工具和平台的支持，并推出了Gemma 3n Impact Challenge，鼓励开发者利用其独特功能构建改善世界的解决方案。文章还提供了用于实验、下载和将Gemma 3n集成到项目中的资源链接。"
  },
  {
    "id": "44397203",
    "title": "YaCy is free software for your own search engine",
    "url": "https://yacy.net/",
    "summary": "YaCy is free, decentralized search engine software that empowers users to create their own search solutions. It offers three primary use cases: P2P mode, personal search portal, and intranet search.\n\nIn P2P mode, YaCy operates as a decentralized network, where many users contribute to a shared index, eliminating reliance on centralized authorities and preventing search request storage. Users can also create their own independent search portals, defining their web index and initiating their own web crawls. Lastly, YaCy can serve as a search portal for intranets, web pages, or shared file systems.\n\nThe core concept behind YaCy is decentralization. Instead of relying on proprietary software from large search engine companies, users can run their search engine across many private devices, free from centralized control. Installation is presented as quick and easy, taking only a few minutes. The website provides options to download and install the software, view screenshots and tutorials, and try a demo peer. It also includes a live view of the YaCy network. The site also provides information on keyboard shortcuts for easier navigation.\n",
    "chinese_title": "YaCy：你的专属搜索引擎，自由软件。",
    "chinese_summary": "YaCy 是一款免费、去中心化的搜索引擎软件，它使用户能够创建自己的搜索解决方案。它提供三种主要用例：P2P 模式、个人搜索门户和内网搜索。\n\n在 P2P 模式下，YaCy 作为一个去中心化的网络运作，许多用户为一个共享索引做出贡献，从而消除了对中心化机构的依赖并防止了搜索请求的存储。用户还可以创建他们自己独立的搜索门户，定义他们的网络索引并启动他们自己的网络爬取。最后，YaCy 可以作为内网、网页或共享文件系统的搜索门户。\n\nYaCy 背后的核心概念是去中心化。用户无需依赖大型搜索引擎公司的专有软件，就可以在许多私人设备上运行他们的搜索引擎，免受中心化控制。安装过程快速简便，只需几分钟即可完成。该网站提供了下载和安装软件、查看屏幕截图和教程以及试用演示节点的选项。它还包括 YaCy 网络的实时视图。该网站还提供有关键盘快捷键的信息，以便于导航。"
  },
  {
    "id": "44360630",
    "title": "Collections: Nitpicking Gladiator's Iconic Opening Battle, Part I",
    "url": "https://acoup.blog/2025/06/06/collections-nitpicking-gladiators-iconic-opening-battle-part-i/",
    "summary": "Bret Devereaux critiques the historical accuracy of the opening battle scene in the movie \"Gladiator,\" arguing that while it aims for historical *verisimilitude* (appearing truthful), it fails at historical *veracity* (being true). He uses Maximus' name as a metaphor, sounding Roman but being entirely incorrect.\n\nThe article focuses on the composition and deployment of the Roman army in the scene. Devereaux points out that the film heavily relies on the Column of Trajan for its visual representation of the Roman army, specifically the clear distinction between legionaries (in *lorica segmentata*) and auxilia (in mail). This visual cue creates a false impression of historical accuracy.\n\nDevereaux argues that the film's depiction of the army's composition is flawed. It presents a near even split between legionary infantry and auxiliary archers, whereas in reality, auxiliary heavy infantry and heavy cavalry were far more common, and archers constituted a much smaller percentage of the force. Also, the legionary infantry are depicted as too uniform, with all soldiers wearing the *lorica segmentata,* while archaeological evidence suggests mail armor was far more common.\n\nIn short, Devereaux contends that \"Gladiator\" sacrifices historical accuracy for visually impressive but ultimately misleading representation of the Roman army, particularly in its composition and equipment, leading viewers to assume greater historical grounding than exists. He intends to further discuss the battle's conduct in the next part.\n",
    "chinese_title": "收藏：吹毛求疵地剖析角斗士的标志性开场战役，第一部分",
    "chinese_summary": "布雷特·德弗罗批评电影《角斗士》开场战斗场景的历史准确性，认为它追求历史的*逼真性*（看起来真实），但未能达到历史的*真实性*（真正真实）。他用马克西姆斯的名字作为隐喻，听起来像罗马名字，但完全不正确。\n\n文章重点讨论了该场景中罗马军队的构成和部署。德弗罗指出，该电影在罗马军队的视觉呈现上严重依赖图拉真柱，特别是军团士兵（穿*鳞甲*）和辅助兵（穿锁子甲）之间的明显区分。这种视觉暗示制造了一种虚假的历史准确性印象。\n\n德弗罗认为，该电影对军队构成的描绘是有缺陷的。它呈现了军团步兵和辅助弓箭手之间近乎对半的比例，而实际上，辅助重步兵和重骑兵更为常见，弓箭手在军队中所占的比例要小得多。此外，军团步兵的形象过于统一，所有士兵都穿着*鳞甲*，而考古证据表明锁子甲更为常见。\n\n简而言之，德弗罗认为《角斗士》牺牲了历史的准确性，以换取视觉上令人印象深刻但最终具有误导性的罗马军队表现，尤其是在其构成和装备方面，导致观众假设存在比实际情况更强的历史依据。他打算在下一部分进一步讨论战斗的进行。"
  },
  {
    "id": "44388093",
    "title": "Show HN: I built an AI dataset generator",
    "url": "https://github.com/metabase/dataset-generator",
    "summary": "This \"Show HN\" post introduces an AI Dataset Generator, a tool for creating realistic datasets for various purposes like demos, learning, and dashboards. The generator leverages OpenAI's GPT-4o to define data schemas and business rules, then uses Faker to generate the actual data locally.\n\nKey features include a conversational prompt builder to define the dataset, real-time data preview, and export options for CSV (single or multi-table ZIP) and SQL inserts. It also offers one-click Metabase integration for data exploration through Docker.\n\nTo use the tool, users need Docker and an OpenAI API key. The project stack is built with Next.js, Tailwind CSS, ShadCN UI, OpenAI API, and Dockerized Metabase. The post outlines the steps to clone the repository, set up the environment, run the Next.js app, generate a dataset, and export or explore the data with Metabase.\n\nThe architecture involves a Next.js frontend, an API route for data generation using OpenAI, an API route for Docker orchestration of Metabase, and libraries for CSV/SQL export. Metabase can be launched via Docker and connected to the generated data.\n\nThe post emphasizes that users only pay for the initial dataset preview using OpenAI (around $0.05), while subsequent downloads are free and based on the same schema. Users can select between a single \"One Big Table\" (OBT) or a \"Star Schema\" with multiple tables. The post also provides information on extending or contributing to the project by modifying the `lib/spec-prompts.ts` file.\n",
    "chinese_title": "展示一下：我做了一个AI数据集生成器",
    "chinese_summary": "此“Show HN”帖子介绍了一款AI数据集生成器，该工具可用于创建适用于演示、学习和仪表板等各种用途的逼真数据集。该生成器利用OpenAI的GPT-4o来定义数据模式和业务规则，然后使用Faker在本地生成实际数据。\n\n主要功能包括用于定义数据集的会话式提示构建器、实时数据预览，以及CSV（单表或多表ZIP）和SQL插入的导出选项。它还提供一键式Metabase集成，以便通过Docker进行数据探索。\n\n要使用该工具，用户需要Docker和OpenAI API密钥。项目堆栈使用Next.js、Tailwind CSS、ShadCN UI、OpenAI API和Docker化的Metabase构建。该帖子概述了克隆存储库、设置环境、运行Next.js应用程序、生成数据集以及使用Metabase导出或探索数据的步骤。\n\n该架构包括一个Next.js前端、一个用于使用OpenAI生成数据的API路由、一个用于Metabase的Docker编排的API路由，以及用于CSV/SQL导出的库。Metabase可以通过Docker启动并连接到生成的数据。\n\n该帖子强调，用户只需为使用OpenAI的初始数据集预览付费（约0.05美元），而后续下载是免费的，并且基于相同的模式。用户可以在单个“一张大表”（OBT）或具有多张表的“星型模式”之间进行选择。该帖子还提供了有关通过修改`lib/spec-prompts.ts`文件来扩展或贡献项目的信息。"
  },
  {
    "id": "44353868",
    "title": "Fault Tolerant Llama training",
    "url": "https://pytorch.org/blog/fault-tolerant-llama-training-with-2000-synthetic-failures-every-15-seconds-and-no-checkpoints-on-crusoe-l40s/",
    "summary": "This article details how the authors used torchft and torchtitan to demonstrate fault-tolerant training of a 1B parameter Llama 3 model on a 300 L40S GPU cluster. The key innovation is training *without* relying on traditional checkpointing, instead using asynchronous weight transfers between healthy replicas after failures.\n\nThe setup involved 30 replica groups, each with 10 GPUs, communicating via NCCL (within groups) and Gloo (across groups). The authors tested Fault Tolerant HSDP (a fault-tolerant all-reduce extension of HSDPv2) and DiLoCo (a semi-synchronous training algorithm).\n\nThree runs were conducted:\n1.  **Failure every 60s:** Achieved 82.3% step efficiency, showing minimal impact from failures.\n2.  **Failure every 15s:**  Extremely aggressive failure rate (simulating worst-case scenarios).  Despite only 30.2% step efficiency, the model still converged, highlighting torchft's robustness.\n3.  **Semi-Synchronous Training (DiLoCo):** Showed significant throughput improvement (4000 tps) compared to HSDP2 (1200 tps) due to reduced communication, while maintaining convergence.\n\nThe article emphasizes torchft's ability to maintain training progress despite frequent failures by isolating failures to individual groups and quickly reconfiguring. The authors used a custom Slurm monitoring script to inject failures and restart replica groups.  The elimination of checkpoints speeds up recovery substantially. The results demonstrate the potential of torchft for reliable and efficient training in unstable environments.\n",
    "chinese_title": "容错Llama训练",
    "chinese_summary": "本文详细介绍了作者如何使用 torchft 和 torchtitan 在一个 300 块 L40S GPU 集群上，展示对一个 10 亿参数 Llama 3 模型的容错训练。关键创新在于*不*依赖传统的检查点机制进行训练，而是使用故障后健康副本之间的异步权重传输。\n\n该设置涉及 30 个副本组，每组包含 10 个 GPU，通过 NCCL（组内）和 Gloo（组间）进行通信。作者测试了容错 HSDP (HSDPv2 的容错 all-reduce 扩展) 和 DiLoCo (一种半同步训练算法)。\n\n进行了三次运行：\n1. **每 60 秒发生一次故障：** 实现了 82.3% 的步骤效率，表明故障的影响极小。\n2. **每 15 秒发生一次故障：** 极具攻击性的故障率（模拟最坏情况）。尽管只有 30.2% 的步骤效率，模型仍然收敛，突显了 torchft 的鲁棒性。\n3. **半同步训练 (DiLoCo)：** 由于减少了通信，与 HSDP2 (1200 tps) 相比，吞吐量显著提高 (4000 tps)，同时保持了收敛。\n\n文章强调了 torchft 在频繁故障情况下保持训练进度的能力，它通过将故障隔离到单个组并快速重新配置来实现。作者使用自定义的 Slurm 监控脚本来注入故障并重启副本组。消除检查点机制可以大幅加快恢复速度。结果表明 torchft 在不稳定环境中实现可靠和高效训练的潜力。"
  },
  {
    "id": "44385742",
    "title": "Apptainer: Application Containers for Linux",
    "url": "https://apptainer.org/",
    "summary": "Apptainer (formerly Singularity) is a containerization platform focused on portability, reproducibility, and security for applications, particularly in high-performance computing (HPC) and academic environments. It simplifies the process of creating and running containers, ensuring that software components are encapsulated for consistent execution across different environments.\n\nKey features of Apptainer include:\n\n*   **Security:** It allows unprivileged users to run containers without privilege escalation, maintaining user identity inside and outside the container.\n*   **Portability:** Apptainer uses a single-file SIF container format, simplifying sharing, moving, and archiving workloads.\n*   **Encryption:** Containers can be encrypted and integrated with secret management platforms like Vault.\n*   **Docker Compatibility:** Apptainer can import containers from OCI registries, including Docker Hub, allowing users to leverage existing Docker images with minimal changes.\n\nIn essence, Apptainer provides a secure, portable, and user-friendly container solution that promotes reproducibility, making it ideal for environments where trust, security, and ease of use are paramount.\n",
    "chinese_title": "Apptainer: Linux 应用容器",
    "chinese_summary": "Apptainer (原 Singularity) 是一款容器化平台，专注于应用程序的便携性、可重复性和安全性，尤其适用于高性能计算 (HPC) 和学术环境。它简化了容器的创建和运行过程，确保软件组件被封装，以便在不同环境中实现一致的执行。\n\nApptainer 的主要特性包括：\n\n*   **安全性：** 它允许非特权用户运行容器而无需权限提升，保持用户身份在容器内外的一致性。\n*   **便携性：** Apptainer 使用单文件 SIF 容器格式，简化了工作负载的共享、移动和归档。\n*   **加密：** 容器可以被加密，并与 Vault 等密钥管理平台集成。\n*   **Docker 兼容性：** Apptainer 可以从 OCI 注册中心（包括 Docker Hub）导入容器，允许用户以最小的更改利用现有的 Docker 镜像。\n\n本质上，Apptainer 提供了一种安全、便携且用户友好的容器解决方案，可提高可重复性，使其成为信任、安全性和易用性至关重要的环境的理想选择。"
  },
  {
    "id": "44393069",
    "title": "A Woman Who Spent Five Hundred Days in a Cave",
    "url": "https://www.newyorker.com/magazine/2024/01/29/the-woman-who-spent-five-hundred-days-in-a-cave",
    "summary": "Beatriz Flamini, a former aerobics instructor with a love for solitude and adventure, spent 500 days in a cave as a personal experiment and scientific study. Dissatisfied with a conventional life, Flamini moved to the mountains, becoming certified in safety protocols and developing a love for isolation. Inspired by cave exploration and driven by a desire for deep self-sufficiency, she planned the cave sojourn to prepare for a potential solo trek across the Gobi Desert.\n\nFlamini's project, called \"Time Cave,\" involved disconnecting completely from the outside world. Despite her initial goal of total isolation, she collaborated with a spelunking club, scientists from the University of Granada and the University of Almería, and a production company for safety and research purposes. These collaborations included installing cameras, a panic button, and Wi-Fi for one-way communication, while she refused devices that allowed for two-way interaction to maintain the integrity of her experience.\n\nScientists monitored her cognitive skills, circadian rhythms, and mental state. They ran baseline tests, simulations of stress and boredom, and gave her strategies to deal with potential hallucinations. She packed clothes, a toothbrush, and two stuffed animals, but was determined not to treat them as company.\n\nFlamini's experience aimed to explore the limits of human endurance and psychological resilience in extreme isolation, and it will contribute to research on space travel. Her Instagram post before descending humorously indicated her anticipated return in April/May 2023. She emerged from the cave on April 14th, 2023, having lost twelve pounds but retaining her characteristic sparkle.\n",
    "chinese_title": "在洞穴中度过五百天的女人",
    "chinese_summary": "贝亚特丽斯·弗拉米尼，一位热爱孤独和冒险的前健美操教练，为了一项个人实验和科学研究，在洞穴中度过了500天。她不满足于传统的生活，搬到了山区，获得了安全协议认证，并培养了对与世隔绝的热爱。受到洞穴探险的启发，并出于对深度自给自足的渴望，她计划了这次洞穴之旅，以准备潜在的单人穿越戈壁沙漠的徒步旅行。\n\n弗拉米尼的项目，名为“时间洞穴”，涉及与外界的完全隔绝。尽管她最初的目标是完全隔离，但为了安全和研究目的，她与一个洞穴探险俱乐部、格拉纳达大学和阿尔梅里亚大学的科学家以及一家制作公司进行了合作。这些合作包括安装摄像头、一个紧急按钮和用于单向通信的Wi-Fi，但她拒绝了允许双向交互的设备，以保持她体验的完整性。\n\n科学家们监测了她的认知能力、昼夜节律和精神状态。他们进行了基线测试、压力和无聊的模拟，并为她提供了应对潜在幻觉的策略。她打包了衣服、牙刷和两个毛绒玩具，但决心不把它们当作陪伴。\n\n弗拉米尼的经历旨在探索人类在极端隔离环境下的耐力和心理韧性的极限，并将为太空旅行的研究做出贡献。她在下降前发布的Instagram帖子幽默地表明她预计将在2023年4月/5月返回。她于2023年4月14日从洞穴中出来，体重减轻了十二磅，但仍然保持着她特有的光彩。"
  },
  {
    "id": "44396977",
    "title": "The Monster Inside ChatGPT",
    "url": "https://www.wsj.com/opinion/the-monster-inside-chatgpt-safety-training-ai-alignment-796ac9d3",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "ChatGPT 内的怪物",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "44392783",
    "title": "Welsh publisher brings Tolkien classic in Celtic languages together",
    "url": "https://nation.cymru/culture/welsh-publisher-brings-tolkien-classic-in-celtic-languages-together/",
    "summary": "Melin Bapur, a Welsh publisher, has brought together editions of J.R.R. Tolkien's \"The Hobbit\" in all five current Celtic languages: Welsh, Irish, Breton, Cornish, and Scottish Gaelic. This follows the recent publication of the first Scottish Gaelic translation, \"A’ Hobat,\" by Professor Moray Watson of the University of Aberdeen, joining the Welsh version \"Yr Hobyd\" released in 2024.\n\nAdam Pearce, founder and Editor of Melin Bapur, announced the availability of these versions on their website. Professor Watson emphasized the importance of translated literature in bolstering language esteem and aiding language learning. He also noted that reading the book in multiple languages always results in the rediscovery of Tolkien's world.\n\nWhile Evertype publishes the Breton, Cornish, Irish, and Scottish Gaelic editions, Melin Bapur published the Welsh version, translated by Adam Pearce, aiming to encourage Welsh reading and revitalize classic Welsh literature. The Welsh translation includes Welsh versions of the original maps and Tolkien's illustrations, and uniquely replaces Anglo-Saxon runes with the Welsh Coelbren y Beirdd for the Dwarves' written language, giving the translation a distinctly Welsh feel. The books are available from www.melinbapur.cymru.\n",
    "chinese_title": "威尔士出版社推出凯尔特语版托尔金经典作品",
    "chinese_summary": "威尔士出版商梅林·巴普尔汇集了J.R.R.托尔金的《霍比特人》所有五种现存凯尔特语版本：威尔士语、爱尔兰语、布列塔尼语、康沃尔语和苏格兰盖尔语。此前，阿伯丁大学的莫雷·沃森教授最近出版了首部苏格兰盖尔语译本《A’ Hobat》，与2024年发行的威尔士语版本《Yr Hobyd》一起加入该系列。\n\n梅林·巴普尔的创始人兼编辑亚当·皮尔斯在其网站上宣布了这些版本的发售。沃森教授强调了翻译文学在增强语言自尊和帮助语言学习方面的重要性。他还指出，以多种语言阅读这本书总是能重新发现托尔金的世界。\n\nEvertype出版了布列塔尼语、康沃尔语、爱尔兰语和苏格兰盖尔语版本，而梅林·巴普尔出版了由亚当·皮尔斯翻译的威尔士语版本，旨在鼓励威尔士语阅读并重振经典的威尔士文学。威尔士语译本包括原版地图和托尔金插图的威尔士语版本，并且独特地用威尔士的诗人字母（Coelbren y Beirdd）取代了盎格鲁-撒克逊符文作为矮人的文字，赋予了译本鲜明的威尔士风格。这些书籍可在www.melinbapur.cymru上购买。"
  },
  {
    "id": "44381297",
    "title": "A new pyramid-like shape always lands the same side up",
    "url": "https://www.quantamagazine.org/a-new-pyramid-like-shape-always-lands-the-same-side-up-20250625/",
    "summary": "This Quanta Magazine article discusses the creation of a monostable tetrahedron, a pyramid-like shape that always lands on the same face, confirming a decades-old conjecture by mathematicians John Conway and Richard Guy. For years, the existence of such a shape with unevenly distributed weight, was debated.\n\nMathematician Gábor Domokos, known for discovering the gömböc (a mono-monostatic shape), became intrigued by the challenge. In 2023, Domokos and his team theoretically proved the possibility of a monostable tetrahedron. They then faced the difficult task of physically creating one.\n\nThe team succeeded in building a working model made of lightweight carbon fiber and dense tungsten carbide, weighing 120 grams and measuring 50 centimeters. Achieving this required extreme precision, with tolerances within one-tenth of a gram and millimeter. The tetrahedron is mostly hollow and has a carefully calibrated center of mass.\n\nThe breakthrough was achieved after removing a small glob of stray glue that threw off the balance. The article highlights the significance of experimentation in mathematics and discusses potential applications like self-righting spacecraft. The process involved developing algorithms to search for suitable shapes and identifying critical properties like obtuse angles between consecutive edges.\n\nWhile the theoretical implications are still being explored, the creation of the monostable tetrahedron proves Conway's conjecture and offers a tangible demonstration of a complex mathematical concept.\n",
    "chinese_title": "一种新型金字塔状物体总是同一面朝上着陆。",
    "chinese_summary": "《量子》杂志文章讨论了一种单稳四面体的创造。这种金字塔状的物体总是落在同一面上，证实了数学家约翰·康威和理查德·盖伊数十年前的一个猜想。多年来，关于是否存在这种重量分布不均匀的形状一直存在争议。\n\n以发现“gömböc”（一种单稳态形状）而闻名的数学家加博·多莫科斯对这项挑战产生了兴趣。2023年，多莫科斯及其团队从理论上证明了单稳四面体的可能性。然后，他们面临着在物理上创造一个的艰巨任务。\n\n该团队成功构建了一个由轻质碳纤维和高密度碳化钨制成的工作模型，重120克，尺寸为50厘米。实现这一点需要极高的精度，公差在十分之一克和毫米以内。该四面体大部分是空心的，并且具有经过仔细校准的质心。\n\n在移除一小团影响平衡的残留胶水后，取得了突破。这篇文章强调了实验在数学中的重要性，并讨论了潜在的应用，例如自扶正航天器。该过程涉及开发算法来搜索合适的形状，并识别关键属性，如连续边之间的钝角。\n\n虽然理论意义仍在探索中，但单稳四面体的创造证明了康威的猜想，并为复杂的数学概念提供了切实的证明。"
  },
  {
    "id": "44397949",
    "title": "Recreational programming: Tacit programming in Prolog",
    "url": "https://github.com/mthom/scryer-prolog/discussions/2991",
    "summary": "This GitHub issue presents a recreational programming example of \"tacit programming\" in Prolog. Tacit programming, also known as point-free programming, aims to define functions without explicitly mentioning their arguments.\n\nThe core of the example lies in a Prolog program that uses Definite Clause Grammars (DCGs) to simulate a stack-based calculator. The `main` predicate initiates the computation with a list of initial values and then uses a series of grammar rules (like `mul`, `add`, `dup`, etc.) to manipulate the stack. Each grammar rule essentially performs an operation on the top elements of the stack, adding or removing items accordingly. The rules use the `is_/2` predicate to actually perform the arithmetic operations within Prolog.\n\nThe code demonstrates how Prolog's DCG feature can be leveraged to create programs that operate implicitly on data, avoiding explicit variable passing between functions. The example results in the calculation of a specific numerical value, `R = 0.05023761449883708`.\n\nThe comments on the issue include an approval, \"13211-3 conformity approved,\" suggesting a playful acknowledgement of the program's correctness and style. In essence, the post illustrates an interesting application of Prolog's declarative and grammatical capabilities for exploring a specific style of programming.\n",
    "chinese_title": "休闲编程：Prolog中的隐式编程",
    "chinese_summary": "此GitHub议题展示了一个用Prolog进行“隐式编程”的趣味编程示例。隐式编程，也称为无点编程，旨在定义函数而不显式提及它们的参数。\n\n该示例的核心在于一个使用确定子句文法(DCG)来模拟基于栈的计算器的Prolog程序。`main`谓词使用一个初始值列表来启动计算，然后使用一系列语法规则（如`mul`、`add`、`dup`等）来操作栈。每个语法规则本质上是对栈顶元素执行操作，相应地添加或移除元素。这些规则使用`is_/2`谓词来实际执行Prolog中的算术运算。\n\n该代码演示了如何利用Prolog的DCG特性来创建隐式操作数据的程序，避免在函数之间显式传递变量。 该示例计算结果为一个特定的数值，`R = 0.05023761449883708`。\n\n该议题的评论包括一条 \"13211-3 conformity approved\" 的赞许，暗示对程序正确性和风格的幽默认可。 本质上，该帖子展示了Prolog的声明式和语法能力在探索特定编程风格方面的有趣应用。"
  },
  {
    "id": "44355409",
    "title": "The Business of Betting on Catastrophe",
    "url": "https://thereader.mitpress.mit.edu/the-business-of-betting-on-catastrophe/",
    "summary": "Susan Erikson's article, \"The Business of Betting on Catastrophe,\" explores the world of insurance-linked securities (ILS), specifically focusing on World Bank pandemic bonds. These bonds are a financial instrument allowing private investors to speculate on the risk of pandemics. Investors pool money and earn interest, but forfeit their principal if a pandemic occurs, with the funds going to fight the disease.\n\nErikson details her research into ILS, attending a reinsurance conference in Germany where she learned the industry grew out of the need for insurers to diversify portfolios against major weather events. ILS offers investors the chance for high returns by holding the risk of catastrophes.\n\nA key element of ILS is the use of parametric triggers, which are pre-set criteria that determine payouts, unlike traditional insurance that relies on actual losses. Erikson illustrates this with the example of a hurricane trigger based on wind speed and location.\n\nThe pandemic bonds, while intended to quickly release funds for disease control, had triggers tied to death counts. Ultimately, ILS allows investors to profit (or lose) by speculating on the specific variables of a catastrophe, and it is a growing market that offers diversification opportunities to investors who are willing to take on the risk of significant events. The article raises questions about the ethics of profiting from disasters, highlighting that the bonds cover the risk of a pandemic itself, not the consequences for people or economies.\n",
    "chinese_title": "赌灾生意",
    "chinese_summary": "苏珊·埃里克森的文章《押注灾难的生意》探讨了与保险相关的证券（ILS）领域，特别是聚焦世界银行的疫情债券。这些债券是一种金融工具，允许私人投资者投机疫情风险。投资者集中资金并赚取利息，但如果发生疫情，他们将失去本金，这笔资金将用于抗击疾病。\n\n埃里克森详细介绍了她对ILS的研究，包括参加了在德国举行的再保险会议，她在会上了解到该行业的发展源于保险公司需要分散重大天气事件风险的需求。 ILS 为投资者提供了通过承担灾难风险获得高回报的机会。\n\nILS 的一个关键要素是参数触发器，它是确定支付的预设标准，与依赖实际损失的传统保险不同。埃里克森以飓风触发器为例说明了这一点，该触发器基于风速和位置。\n\n疫情债券旨在快速释放资金用于疾病控制，但其触发器与死亡人数挂钩。最终，ILS 允许投资者通过投机灾难的具体变量来获利（或亏损），并且它是一个不断增长的市场，为愿意承担重大事件风险的投资者提供多元化机会。这篇文章提出了关于从灾难中获利的伦理问题，强调这些债券涵盖的是疫情本身的风险，而不是对人民或经济的后果。"
  },
  {
    "id": "44374114",
    "title": "Some bits on malloc(0) in C being allowed to return NULL",
    "url": "https://utcc.utoronto.ca/~cks/space/blog/programming/CZeroSizeMallocSomeNotes",
    "summary": "Chris Siebenmann's blog post addresses an issue where users with older browsers are blocked from accessing his blog, \"Wandering Thoughts,\" and CSpace. This is a deliberate anti-crawler measure implemented due to a recent surge in high-volume crawlers, particularly those gathering data for Large Language Model (LLM) training, which often impersonate older browser versions, especially Chrome.\n\nThe post explains that these crawlers place a significant load on his blog. To mitigate this, he's attempting to block them based on their outdated user agents. Users encountering this block despite using a current browser are encouraged to contact him with their browser details and User-Agent string.\n\nThe author specifically calls out archive.* services (archive.today, archive.ph, archive.is) for using crawling practices that are indistinguishable from malicious actors. He cites their use of old Chrome User-Agent values, distributed IP addresses lacking clear identification, and falsified reverse DNS entries as problematic. He recommends using archive.org as a better alternative, as it crawls his blog without triggering the anti-crawler measures.\n",
    "chinese_title": "C语言中malloc(0)允许返回NULL的一些细节",
    "chinese_summary": "Chris Siebenmann的博客文章讲述了一个问题，即使用旧版浏览器的用户无法访问他的博客“Wandering Thoughts”和CSpace。这是为了应对近期大量涌现的网络爬虫而采取的有意的反爬虫措施，特别是那些为大型语言模型(LLM)训练收集数据的爬虫，它们通常会伪装成旧版浏览器，尤其是Chrome。\n\n文章解释说，这些爬虫给他的博客带来了巨大的负载。为了缓解这个问题，他试图根据它们过时的用户代理来阻止它们。如果用户在使用当前浏览器的前提下遇到此屏蔽，建议联系他并提供浏览器详细信息和User-Agent字符串。\n\n作者特别指出archive.*服务（archive.today、archive.ph、archive.is）使用的爬取方式与恶意行为者无异。他指出，它们使用旧的Chrome User-Agent值、缺乏明确标识的分布式IP地址以及伪造的反向DNS记录存在问题。他建议使用archive.org作为更好的替代方案，因为它在爬取他的博客时不会触发反爬虫措施。"
  },
  {
    "id": "44382834",
    "title": "Puerto Rico's Solar Microgrids Beat Blackout",
    "url": "https://spectrum.ieee.org/puerto-rico-solar-microgrids",
    "summary": "The article \"Puerto Rico's Solar Microgrids Beat Blackout\" by Julia Tilton highlights the success of solar microgrids in maintaining electricity in Adjuntas, Puerto Rico, amidst frequent power interruptions. Developed in collaboration with Oak Ridge National Laboratory, these microgrids provide a resilient power source for the town. The article contrasts this local success with a federal decision to redirect $365 million from solar energy towards broader grid repairs, potentially hindering the expansion of similar microgrid solutions. Essentially, while the federal government prioritizes overall grid stability, the article showcases the tangible benefits of localized solar microgrids in providing reliable power during blackouts, offering a possible solution for the island's ongoing energy challenges.\n",
    "chinese_title": "波多黎各太阳能微电网战胜停电",
    "chinese_summary": "朱莉娅·蒂尔顿的文章《波多黎各太阳能微电网战胜停电》重点介绍了太阳能微电网在波多黎各阿洪塔斯维持电力供应方面的成功，该地区经常发生电力中断。这些微电网与橡树岭国家实验室合作开发，为该镇提供了一个有弹性的电力来源。文章将这一本地成功与联邦政府将3.65亿美元从太阳能转向更广泛的电网维修的决定进行了对比，这可能会阻碍类似微电网解决方案的扩展。本质上，虽然联邦政府优先考虑整体电网的稳定性，但文章展示了本地太阳能微电网在停电期间提供可靠电力的实际效益，为该岛持续存在的能源挑战提供了一种可能的解决方案。"
  },
  {
    "id": "44389497",
    "title": "Shifts in diatom and dinoflagellate biomass in the North Atlantic over 6 decades",
    "url": "https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0323675",
    "summary": "This article analyzes six decades of data from the Continuous Plankton Recorder (CPR) to investigate shifts in diatom and dinoflagellate biomass in the North Atlantic. The study reveals a widespread decrease of up to 2% per year in both diatom and dinoflagellate biomass across most of the North Atlantic, with the exception of eastern and western shelf regions. Conversely, diatom biomass increased by 1-2% per year relative to total diatom and dinoflagellate biomass throughout the North Atlantic, excluding the Arctic province.\n\nThe findings challenge the common assumption that gradual ocean warming leads to a decadal-scale shift from diatoms to dinoflagellates. While previous research indicated that diatoms tend to be displaced by dinoflagellates as waters warm on monthly to annual timescales, this study does not support this trend on a longer, decadal scale.\n\nThe researchers suggest that predicting the impacts of climate change on plankton communities requires a comprehensive approach that considers the whole community, simultaneous changes in multiple environmental factors, and the evolutionary potential of plankton populations. The study utilizes a carbon content estimate of the species identified and a statistical model to quantify the temporal trend in diatom and dinoflagellate biomass and a diatom index across five biogeographic provinces in the North Atlantic.\n",
    "chinese_title": "北大西洋硅藻和甲藻生物量的六十年变迁",
    "chinese_summary": "本文分析了连续浮游生物记录仪（CPR）六十年的数据，以研究北大西洋硅藻和甲藻生物量的变化。研究表明，除了东部和西部陆架区域外，北大西洋大部分地区的硅藻和甲藻生物量普遍减少，每年减少高达2%。相反，除了北极地区外，整个北大西洋的硅藻生物量相对于硅藻和甲藻总生物量每年增加1-2%。\n\n这些发现挑战了常见的假设，即海洋逐渐变暖会导致硅藻向甲藻的十年尺度转变。虽然之前的研究表明，随着水温在月度和年度尺度上升高，硅藻往往会被甲藻取代，但这项研究不支持这种更长的、十年尺度上的趋势。\n\n研究人员认为，预测气候变化对浮游生物群落的影响需要一种综合方法，该方法要考虑到整个群落、多种环境因素的同时变化以及浮游生物种群的进化潜力。该研究利用已识别物种的碳含量估算值和一个统计模型，量化了北大西洋五个生物地理区域中硅藻和甲藻生物量以及硅藻指数的时间趋势。"
  },
  {
    "id": "44393749",
    "title": "Denmark to tackle deepfakes by giving people copyright to their own features",
    "url": "https://www.theguardian.com/technology/2025/jun/27/deepfakes-denmark-copyright-law-artificial-intelligence",
    "summary": "Denmark is set to introduce a groundbreaking law that grants individuals copyright over their own physical features, including their body, face, and voice, in an effort to combat the growing threat of AI-generated deepfakes. The amendment to the existing copyright law aims to protect against digital imitations of people's identities, making it the first law of its kind in Europe.\n\nThe proposed law, which has broad cross-party support, defines a deepfake as a realistic digital representation of a person's appearance and voice. It will allow individuals to demand the removal of unauthorized deepfakes from online platforms and seek compensation for violations. The law will also cover digital imitations of artists' performances.\n\nWhile the law aims to curb misuse of AI technology, it explicitly exempts parodies and satire. The Danish government hopes this initiative will send a clear message that individuals have the right to control their digital likeness and prevent its misuse.\n\nCulture Minister Jakob Engel-Schmidt expressed his willingness to take further steps if tech platforms fail to comply with the new law, including imposing severe fines and potentially escalating the matter to the European Commission. He intends to share Denmark's plans with other European countries during its upcoming EU presidency, encouraging them to adopt similar measures.\n",
    "chinese_title": "丹麦将赋予人们对其自身特征的版权以应对深度伪造",
    "chinese_summary": "丹麦将推出一项开创性法律，赋予个人对其身体、面部和声音等身体特征的版权，以应对人工智能生成的深度伪造日益增长的威胁。这项对现有版权法的修正案旨在保护人们的身份免受数字模仿，使其成为欧洲首例此类法律。\n\n这项获得广泛跨党派支持的拟议法律将深度伪造定义为对人的外貌和声音的逼真数字呈现。它将允许个人要求从在线平台删除未经授权的深度伪造内容，并寻求侵权赔偿。该法律还将涵盖对艺术家表演的数字模仿。\n\n虽然该法律旨在遏制人工智能技术的滥用，但它明确豁免了模仿和讽刺作品。丹麦政府希望这项举措能够传递一个明确的信息，即个人有权控制自己的数字肖像，并防止其被滥用。\n\n文化部长雅各布·恩格尔-施密特表示，如果技术平台未能遵守新法律，他愿意采取进一步措施，包括处以巨额罚款，并可能将此事升级到欧盟委员会。他打算在其即将到来的欧盟轮值主席国期间与其他欧洲国家分享丹麦的计划，鼓励他们采取类似的措施。"
  },
  {
    "id": "44396124",
    "title": "Nth Cycle is bringing critical metals refining to the U.S.",
    "url": "https://news.mit.edu/2025/nth-cycle-brings-critical-metals-refining-0627",
    "summary": "Nth Cycle, co-founded by MIT Associate Professor Desirée Plata, aims to revolutionize critical metals refining in the U.S., reducing reliance on foreign sources, particularly China. The company is already producing nickel and cobalt from battery scrap at their Ohio facility.\n\nNth Cycle's innovative approach utilizes a modular refining system called \"The Oyster,\" powered by electricity rather than fossil fuels. The Oyster uses electro-extraction, chemical precipitation, and filtration which reduces costs, waste, and time-to-market. This technology offers a cleaner, more efficient alternative to traditional, large-scale refining plants.\n\nThe company is focusing on recovering metals from electronics waste, spent catalysts, and potentially mining waste. They envision a \"refining as a service\" model where customers own the final product and Nth Cycle operates the Oyster systems. Nth Cycle's technology has the potential to reduce waste, emissions, and strengthen the domestic supply chain for critical metals vital for industries like batteries, electronics, and defense. They aim to partner with scrap yards, industrial scrap facilities, and manufacturers, ultimately contributing to a more sustainable and secure future for the U.S. economy.\n",
    "chinese_title": "Nth循环公司将关键金属提炼带到美国。",
    "chinese_summary": "Nth Cycle公司由麻省理工学院副教授Desirée Plata联合创立，旨在革新美国关键金属提炼产业，减少对外国来源（特别是中国）的依赖。该公司已在其俄亥俄州的工厂利用电池废料生产镍和钴。\n\nNth Cycle的创新方法采用名为“The Oyster”的模块化提炼系统，该系统由电力而非化石燃料驱动。“The Oyster”使用电萃取、化学沉淀和过滤技术，从而降低成本、减少浪费并缩短上市时间。这项技术为传统的大型提炼厂提供了一种更清洁、更高效的替代方案。\n\n该公司专注于从电子垃圾、废催化剂以及潜在的采矿废料中回收金属。他们设想一种“提炼即服务”模式，客户拥有最终产品，而Nth Cycle负责运营Oyster系统。Nth Cycle的技术有潜力减少浪费和排放，并加强国内关键金属的供应链，这些关键金属对电池、电子产品和国防等行业至关重要。他们的目标是与废品场、工业废品设施和制造商合作，最终为美国经济创造一个更可持续和安全的未来。"
  },
  {
    "id": "44394627",
    "title": "Salesforce CEO Claims Half of the Company's Work Is Now Done by AI",
    "url": "https://gizmodo.com/salesforce-ceo-claims-half-of-the-companys-work-is-now-done-by-ai-2000620730",
    "summary": "The article reports that Salesforce CEO Marc Benioff claims AI now completes 30-50% of the company's work, but it criticizes the trend of AI adoption leading to layoffs. While Benioff suggests employees can move to \"higher value work,\" the company laid off 1,000 people earlier in the year and plans to hire 1,000 new employees to sell its AI agent technology, Agentforce. This move, and similar announcements from other tech giants like Amazon, are seen as a precursor to further job cuts.\n\nThe article cites examples of other companies, including Microsoft, Google, and Bumble, reducing their workforce due to AI implementation. Layoffs.fyi reports over 63,000 tech layoffs in 2025. Workers affected by AI adoption have told the author that they were let go because they were now replaceable. The article concludes that the embrace of AI in Silicon Valley is often a veiled announcement of impending layoffs.\n",
    "chinese_title": "Salesforce CEO 声称公司一半工作现在由 AI 完成",
    "chinese_summary": "文章报道称，Salesforce首席执行官马克·贝尼奥夫声称人工智能已完成公司30-50%的工作，但文章批评了采用人工智能导致裁员的趋势。尽管贝尼奥夫表示员工可以转向“更高价值的工作”，但该公司今年早些时候裁员1000人，并计划招聘1000名新员工来销售其人工智能代理技术Agentforce。这一举动，以及亚马逊等其他科技巨头的类似声明，被视为进一步裁员的先兆。\n\n文章引用了包括微软、谷歌和Bumble在内的其他公司因实施人工智能而裁员的例子。Layoffs.fyi报告称，2025年已发生超过63,000起科技行业裁员。受人工智能采用影响的员工告诉作者，他们被解雇是因为现在可以被取代。文章总结说，硅谷拥抱人工智能通常是即将裁员的隐晦声明。"
  },
  {
    "id": "44390740",
    "title": "Matrix v1.15",
    "url": "https://matrix.org/blog/2025/06/26/matrix-v1.15-release/",
    "summary": "Matrix v1.15 focuses on improvements to authentication, room summaries, and rich topics, bringing 10 MSCs (Matrix Specification Changes) into the official specification.\n\nA major highlight is the inclusion of next-generation authentication, built on OIDC, which enables industry-standard authentication for Matrix. This advancement is a significant step towards the release of Matrix 2.0 and makes Matrix a more secure platform.\n\nMSC3266 brings room summaries to the specification, allowing clients to retrieve richer information about rooms before joining. This provides improved context for invites, knocks, and matrix.to links.\n\nMSC3765 introduces rich topics, allowing rooms to utilize bold text and lists in their topics. This uses Extensible Events with fallback support to enhance room descriptions and provide user-friendly links to information.\n\nThe update also includes numerous clarifications and minor changes across the Client-Server, Server-Server, Application Service, and Identity Service APIs, as well as internal tooling improvements. Notably, Well-Known URIs are clarified to be available on the server name's hostname. The Matrix.org Foundation, responsible for maintaining the Matrix specification and infrastructure, relies on donations to operate and continues to fight for digital privacy and dignity.\n",
    "chinese_title": "矩阵 v1.15",
    "chinese_summary": "Matrix v1.15 侧重于改进身份验证、房间摘要和富主题，将 10 个 MSC（Matrix 规范变更）纳入官方规范。\n\n主要亮点是包含基于 OIDC 构建的下一代身份验证，这使得 Matrix 能够进行行业标准身份验证。 这一进步是迈向 Matrix 2.0 发布的重要一步，并使 Matrix 成为一个更安全的平台。\n\nMSC3266 将房间摘要引入规范，允许客户端在加入之前检索关于房间的更丰富信息。 这为邀请、敲门和 matrix.to 链接提供了改进的上下文。\n\nMSC3765 引入了富主题，允许房间在其主题中使用粗体文本和列表。 这使用具有回退支持的可扩展事件来增强房间描述，并提供用户友好的信息链接。\n\n此次更新还包括对客户端-服务器、服务器-服务器、应用服务和身份服务 API 的大量澄清和细微更改，以及内部工具改进。 值得注意的是，明确了 Well-Known URI 可在服务器名称的主机名上使用。 负责维护 Matrix 规范和基础设施的 Matrix.org 基金会依靠捐款运作，并继续为数字隐私和尊严而战。"
  },
  {
    "id": "44355518",
    "title": "Dickinson's Dresses on the Moon",
    "url": "https://www.theparisreview.org/blog/2025/06/20/dickinsons-dresses-on-the-moon/",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "月亮上的狄金森长裙",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "44382752",
    "title": "Define policy forbidding use of AI code generators",
    "url": "https://github.com/qemu/qemu/commit/3d40db0efc22520fa6c399cf73960dced423b048",
    "summary": "This document outlines QEMU's policy regarding the use of AI code generators like ChatGPT, Claude, Copilot, and Llama in contributions. The policy explicitly **forbids contributions that include or are derived from AI-generated content.**\n\nThe primary reason for this restriction is the unclear legal status surrounding the copyright and licensing of AI-generated output. QEMU requires contributors to certify their code follows the Developer's Certificate of Origin (DCO), which necessitates a clear understanding of copyright and license. The ambiguous nature of AI output, stemming from potentially restrictive licensing/copyright in the training data, makes it difficult for contributors to comply with the DCO. The project is unwilling to accept the potential legal risks associated with non-compliance.\n\nThe policy **does not** restrict other uses of AI, such as for research, static analysis, or debugging, as long as the output is not incorporated directly into contributions.\n\nWhile the policy applies to existing AI code generators, QEMU acknowledges the evolving nature of AI technology and the legal landscape. They state that the policy may be updated as AI tools mature and the legal situation becomes clearer. Exceptions to the policy may be considered on a case-by-case basis, requiring the contributor to demonstrate clarity in the copyright and license status of the tool's output, in relation to its training data.\n",
    "chinese_title": "定义禁止使用AI代码生成器的政策",
    "chinese_summary": "本文档概述了QEMU关于在贡献中使用人工智能代码生成器（如ChatGPT、Claude、Copilot和Llama）的政策。该政策明确**禁止包含或源自人工智能生成内容的贡献。**\n\n此限制的主要原因是人工智能生成输出的版权和许可的法律地位尚不明确。QEMU要求贡献者证明其代码符合开发者原创声明（DCO），这需要对版权和许可有清晰的理解。人工智能输出的模糊性，源于训练数据中潜在的限制性许可/版权，使得贡献者难以遵守DCO。该项目不愿承担与不合规相关的潜在法律风险。\n\n该政策**并不**限制人工智能的其他用途，例如研究、静态分析或调试，只要输出不直接纳入贡献中。\n\n虽然该政策适用于现有的人工智能代码生成器，但QEMU承认人工智能技术和法律环境的不断发展。他们声明，随着人工智能工具的成熟和法律状况的明朗，该政策可能会更新。对该政策的例外情况可能会被逐案考虑，要求贡献者证明工具输出的版权和许可状态（与其训练数据相关）的清晰性。"
  },
  {
    "id": "44384610",
    "title": "LLM code generation may lead to an erosion of trust",
    "url": "https://jaysthoughts.com/aithoughts1",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "LLM代码生成可能导致信任危机",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "44394114",
    "title": "Uv and Ray: Pain-Free Python Dependencies in Clusters",
    "url": "https://www.anyscale.com/blog/uv-ray-pain-free-python-dependencies-in-clusters",
    "summary": "This article introduces the combination of \"uv,\" a fast Python package manager, with Ray, a distributed compute engine, to simplify Python dependency management in cluster environments. The authors highlight uv's speed, consistency, and adherence to Python conventions. Traditionally, ensuring consistent dependencies across cluster nodes has been challenging, often solved with containerization that slows development.\n\nThe integration of uv with Ray enables a \"uv run script.py\" workflow, dynamically applying the environment to every process in the cluster. This feature, currently in Ray 2.43 and enabled with a feature flag, ensures that all worker processes have the same dependencies.\n\nThe article provides an end-to-end example demonstrating how to use uv with Ray Data for batch LLM inference, using a `pyproject.toml` file to manage dependencies and executing the code with `uv run batch_inference.py`. It also covers using environment variables, editable dependencies, and Hugging Face models behind a gate.\n\nUnder the hood, the integration uses Ray's runtime environment feature and a new \"py_executable\" plugin to specify the Python executable (uv run) for workers. Use cases for this include applications with heterogeneous dependencies and customized worker commands. The article also details usage in Ray Jobs and Services and offers best practices, such as using `uv lock` for dependency freezing. The authors conclude by emphasizing the benefits of the combination and solicit feedback. They also mention Anyscale's alternative dependency management solution for situations where uv isn't suitable.\n",
    "chinese_title": "Uv 和 Ray：集群中无痛的 Python 依赖项",
    "chinese_summary": "本文介绍了快速Python包管理器\"uv\"与分布式计算引擎Ray的结合，旨在简化集群环境中的Python依赖管理。作者强调了uv的速度、一致性和对Python惯例的遵循。传统上，确保集群节点间依赖的一致性具有挑战性，通常通过容器化来解决，但这会降低开发速度。\n\nuv与Ray的集成实现了\"uv run script.py\"的工作流，动态地将环境应用于集群中的每个进程。此功能目前在Ray 2.43中提供，并通过特性标志启用，确保所有worker进程都具有相同的依赖项。\n\n本文提供了一个端到端的示例，演示了如何将uv与Ray Data结合使用，进行批量LLM推理，使用`pyproject.toml`文件来管理依赖项，并使用`uv run batch_inference.py`执行代码。文章还介绍了如何使用环境变量、可编辑依赖项以及受保护的Hugging Face模型。\n\n在底层，该集成使用Ray的运行时环境特性和一个新的\"py_executable\"插件来指定worker的Python可执行文件（uv run）。这方面的用例包括具有异构依赖项和自定义worker命令的应用程序。文章还详细介绍了在Ray Jobs和Services中的使用，并提供了最佳实践，例如使用`uv lock`进行依赖冻结。作者最后强调了这种结合的优势，并征求反馈。他们还提到了Anyscale的替代依赖管理解决方案，适用于uv不适用的情况。"
  },
  {
    "id": "44391535",
    "title": "Show HN: PRSS Site Creator – Create Blogs and Websites from Your Desktop",
    "url": "https://prss.co/",
    "summary": "生成摘要时出错",
    "chinese_title": "Show HN: PRSS Site Creator – Create Blogs and Websites from Your Desktop",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44365754",
    "title": "A new PNG spec",
    "url": "https://www.programmax.net/articles/png-is-back/",
    "summary": "生成摘要时出错",
    "chinese_title": "A new PNG spec",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44387904",
    "title": "Access BMC UART on Supermicro X11SSH",
    "url": "https://github.com/zarhus/zarhusbmc/discussions/3",
    "summary": "生成摘要时出错",
    "chinese_title": "Access BMC UART on Supermicro X11SSH",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44354032",
    "title": "Modeling the World in 280 Characters",
    "url": "https://tympanus.net/codrops/2025/06/23/modeling-the-world-in-280-characters/",
    "summary": "生成摘要时出错",
    "chinese_title": "Modeling the World in 280 Characters",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44378486",
    "title": "Web Embeddable Common Lisp",
    "url": "https://turtleware.eu/static/paste/wecl-test-gl/main.html",
    "summary": "生成摘要时出错",
    "chinese_title": "Web Embeddable Common Lisp",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44348415",
    "title": "Structured Output with LangChain and Llamafile",
    "url": "https://blog.brakmic.com/structured-output-with-langchain-and-llamafile/",
    "summary": "生成摘要时出错",
    "chinese_title": "Structured Output with LangChain and Llamafile",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44396467",
    "title": "Orange Me2eets:We made an end-to-end encrypted video calling app and it was easy",
    "url": "https://blog.cloudflare.com/orange-me2eets-we-made-an-end-to-end-encrypted-video-calling-app-and-it-was/",
    "summary": "生成摘要时出错",
    "chinese_title": "Orange Me2eets:We made an end-to-end encrypted video calling app and it was easy",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44390072",
    "title": "Lateralized sleeping positions in domestic cats",
    "url": "https://www.cell.com/current-biology/fulltext/S0960-9822(25)00507-X?_returnURL=https%3A%2F%2Flinkinghub.elsevier.com%2Fretrieve%2Fpii%2FS096098222500507X%3Fshowall%3Dtrue",
    "summary": "生成摘要时出错",
    "chinese_title": "Lateralized sleeping positions in domestic cats",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44376989",
    "title": "OpenAI charges by the minute, so speed up your audio",
    "url": "https://george.mand.is/2025/06/openai-charges-by-the-minute-so-make-the-minutes-shorter/",
    "summary": "生成摘要时出错",
    "chinese_title": "OpenAI charges by the minute, so speed up your audio",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44379173",
    "title": "Iroh: A library to establish direct connection between peers",
    "url": "https://github.com/n0-computer/iroh",
    "summary": "生成摘要时出错",
    "chinese_title": "Iroh: A library to establish direct connection between peers",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44358667",
    "title": "Howdy – Windows Hello style facial authentication for Linux",
    "url": "https://github.com/boltgolt/howdy",
    "summary": "生成摘要时出错",
    "chinese_title": "Howdy – Windows Hello style facial authentication for Linux",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44350655",
    "title": "The Art of Hanakami, or Flower-Petal Folding",
    "url": "https://origamiusa.org/thefold/article/art-hanakami-or-flower-petal-folding",
    "summary": "生成摘要时出错",
    "chinese_title": "The Art of Hanakami, or Flower-Petal Folding",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44345681",
    "title": "Writing a basic Linux device driver when you know nothing about Linux drivers",
    "url": "https://crescentro.se/posts/writing-drivers/",
    "summary": "生成摘要时出错",
    "chinese_title": "Writing a basic Linux device driver when you know nothing about Linux drivers",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44377495",
    "title": "Is Lovable getting monetization wrong?",
    "url": "https://getlago.substack.com/p/lovable-makes-60m-in-6-monthsbut",
    "summary": "生成摘要时出错",
    "chinese_title": "Is Lovable getting monetization wrong?",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44381252",
    "title": "-2000 Lines of code (2004)",
    "url": "https://www.folklore.org/Negative_2000_Lines_Of_Code.html",
    "summary": "生成摘要时出错",
    "chinese_title": "-2000 Lines of code (2004)",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44385981",
    "title": "Muvera: Making multi-vector retrieval as fast as single-vector search",
    "url": "https://research.google/blog/muvera-making-multi-vector-retrieval-as-fast-as-single-vector-search/",
    "summary": "生成摘要时出错",
    "chinese_title": "Muvera: Making multi-vector retrieval as fast as single-vector search",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44358148",
    "title": "Ambient Garden",
    "url": "https://ambient.garden",
    "summary": "生成摘要时出错",
    "chinese_title": "Ambient Garden",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44330585",
    "title": "How Cloudflare blocked a monumental 7.3 Tbps DDoS attack",
    "url": "https://blog.cloudflare.com/defending-the-internet-how-cloudflare-blocked-a-monumental-7-3-tbps-ddos/",
    "summary": "生成摘要时出错",
    "chinese_title": "How Cloudflare blocked a monumental 7.3 Tbps DDoS attack",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44355923",
    "title": "What Happens When Hertz's AI Scanner Finds Damage on Your Rental",
    "url": "https://www.thedrive.com/news/this-is-what-happens-when-hertzs-ai-scanner-finds-damage-on-your-rental",
    "summary": "生成摘要时出错",
    "chinese_title": "What Happens When Hertz's AI Scanner Finds Damage on Your Rental",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44379191",
    "title": "Interstellar Flight: Perspectives and Patience",
    "url": "https://www.centauri-dreams.org/2025/06/25/interstellar-flight-perspectives-and-patience/",
    "summary": "生成摘要时出错",
    "chinese_title": "Interstellar Flight: Perspectives and Patience",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44390527",
    "title": "Memory safety is table stakes",
    "url": "https://www.usenix.org/publications/loginonline/memory-safety-merely-table-stakes",
    "summary": "生成摘要时出错",
    "chinese_title": "Memory safety is table stakes",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44338182",
    "title": "Bill Atkinson: Polaroids Showing the Evolution of the Lisa GUI [video]",
    "url": "https://www.youtube.com/watch?v=Qg0mHFcB510",
    "summary": "生成摘要时出错",
    "chinese_title": "Bill Atkinson: Polaroids Showing the Evolution of the Lisa GUI [video]",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44386887",
    "title": "Learnings from building AI agents",
    "url": "https://www.cubic.dev/blog/learnings-from-building-ai-agents",
    "summary": "生成摘要时出错",
    "chinese_title": "Learnings from building AI agents",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44396303",
    "title": "Show HN: A Python Language Server, Mypy-compatible",
    "url": "https://zubanls.com/",
    "summary": "生成摘要时出错",
    "chinese_title": "Show HN: A Python Language Server, Mypy-compatible",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44381093",
    "title": "Libxml2's \"no security embargoes\" policy",
    "url": "https://lwn.net/SubscriberLink/1025971/73f269ad3695186d/",
    "summary": "生成摘要时出错",
    "chinese_title": "Libxml2's \"no security embargoes\" policy",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44360651",
    "title": "Getting by on the Generosity of Strangers in Japan",
    "url": "https://theworld.org/stories/2025/06/20/out-of-eden-walk-getting-by-on-the-generosity-of-strangers",
    "summary": "生成摘要时出错",
    "chinese_title": "Getting by on the Generosity of Strangers in Japan",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44380185",
    "title": "Better Auth, by a self-taught Ethiopian dev, raises $5M from Peak XV, YC",
    "url": "https://techcrunch.com/2025/06/25/this-self-taught-ethiopian-dev-built-an-authentication-tool-and-got-into-yc/",
    "summary": "生成摘要时出错",
    "chinese_title": "Better Auth, by a self-taught Ethiopian dev, raises $5M from Peak XV, YC",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44381358",
    "title": "Microsoft Dependency Has Risks",
    "url": "https://blog.miloslavhomer.cz/p/microsoft-dependency-has-risks",
    "summary": "生成摘要时出错",
    "chinese_title": "Microsoft Dependency Has Risks",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44367084",
    "title": "Writing toy software is a joy",
    "url": "https://blog.jsbarretto.com/post/software-is-joy",
    "summary": "生成摘要时出错",
    "chinese_title": "Writing toy software is a joy",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44388387",
    "title": "FLUX.1 Kontext [Dev] – Open Weights for Image Editing",
    "url": "https://bfl.ai/announcements/flux-1-kontext-dev",
    "summary": "生成摘要时出错",
    "chinese_title": "FLUX.1 Kontext [Dev] – Open Weights for Image Editing",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44376362",
    "title": "Third places and neighborhood entrepreneurship (2024)",
    "url": "https://www.nber.org/papers/w32604",
    "summary": "生成摘要时出错",
    "chinese_title": "Third places and neighborhood entrepreneurship (2024)",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44379606",
    "title": "What Problems to Solve (1966)",
    "url": "http://genius.cat-v.org/richard-feynman/writtings/letters/problems",
    "summary": "生成摘要时出错",
    "chinese_title": "What Problems to Solve (1966)",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44379034",
    "title": "Getting ready to issue IP address certificates",
    "url": "https://community.letsencrypt.org/t/getting-ready-to-issue-ip-address-certificates/238777",
    "summary": "生成摘要时出错",
    "chinese_title": "Getting ready to issue IP address certificates",
    "chinese_summary": "生成摘要时出错"
  }
]