[
  {
    "id": "45313557",
    "title": "Novelist Cormac McCarthy's tips on how to write a great science paper [pdf]",
    "url": "https://gwern.net/doc/science/2019-savage.pdf",
    "summary": "The document appears to be a corrupted PDF file, purportedly titled \"Novelist Cormac McCarthy's tips on how to write a great science paper.\" However, the content consists of raw PDF code and metadata, not the actual text of the article or any writing tips from Cormac McCarthy. It contains compressed data streams related to fonts, images, page layouts, and other PDF elements. There's no discernible information on writing advice or any content directly attributable to Cormac McCarthy. Because the content is unreadable, it's impossible to summarise the article. It's likely the file is either damaged or contains some form of embedded content that requires specific software to properly extract and display.\n",
    "chinese_title": "小说家科马克·麦卡锡关于如何撰写优秀科学论文的建议 [pdf]",
    "chinese_summary": "该文件似乎是一个损坏的PDF文件，据称标题为“小说家科马克·麦卡锡关于如何撰写优秀科学论文的建议”。然而，其内容由原始PDF代码和元数据组成，而非文章的实际文本或科马克·麦卡锡的任何写作技巧。它包含与字体、图像、页面布局和其他PDF元素相关的压缩数据流。其中没有关于写作建议或任何直接归因于科马克·麦卡锡的内容的可辨识信息。由于内容无法读取，因此无法总结该文章。该文件可能已损坏或包含某种形式的嵌入内容，需要特定的软件才能正确提取和显示。"
  },
  {
    "id": "45273032",
    "title": "Scientists find that ice generates electricity when bent",
    "url": "https://phys.org/news/2025-09-scientists-ice-generates-electricity-bent.html",
    "summary": "Here's a concise summary of the article:\n\nA new study co-led by ICN2 has discovered that ice exhibits flexoelectricity, meaning it generates electricity when unevenly deformed. Published in Nature Physics, this finding reveals that ice, like electroceramic materials, can produce an electric charge in response to mechanical stress. This flexoelectric property is present at all temperatures. Additionally, a thin ferroelectric layer was identified on the ice surface at temperatures below -113°C, enabling the surface to develop a natural electric polarization.\n\nThe study suggests that this flexoelectricity could explain the electrification of clouds during thunderstorms and the origin of lightning. While ice is not piezoelectric (generating charge simply by compression), the study demonstrates that bending or irregularly deforming ice creates an electric potential, mirroring observations from ice-particle collisions in thunderstorms.\n\nResearchers are now exploring potential applications of this discovery, envisioning future electronic devices that utilize ice as an active material, particularly in cold environments. This research opens avenues for understanding natural phenomena and developing new technologies based on ice's electrical properties.\n",
    "chinese_title": "科学家发现冰在弯曲时会产生电。",
    "chinese_summary": "以下是文章的简明总结：\n\nICN2共同领导的一项新研究发现冰具有挠曲电性，意味着它在不均匀变形时会产生电。该发现发表在《自然·物理》上，揭示了冰像电子陶瓷材料一样，可以响应机械应力而产生电荷。这种挠曲电性存在于所有温度下。此外，在-113°C以下的温度下，冰表面还发现了一个薄的铁电层，使表面能够产生天然的电极化。\n\n该研究表明，这种挠曲电性可以解释雷暴期间云的带电以及闪电的起源。虽然冰不具有压电性（仅通过压缩产生电荷），但该研究表明，弯曲或不规则变形的冰会产生电势，这与雷暴中冰粒碰撞的观测结果相呼应。\n\n研究人员目前正在探索这项发现的潜在应用，设想未来利用冰作为活性材料的电子设备，尤其是在寒冷环境中。这项研究为理解自然现象和开发基于冰的电学特性的新技术开辟了道路。"
  },
  {
    "id": "45313418",
    "title": "Living microbial cement supercapacitors with reactivatable energy storage",
    "url": "https://www.cell.com/cell-reports-physical-science/fulltext/S2666-3864(25)00409-6",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "具有可再激活能量存储的活性微生物水泥超级电容器",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "45287474",
    "title": "SCREAM CIPHER (\"ǠĂȦẶAẦ ĂǍÄẴẶȦ\")",
    "url": "https://sethmlarson.dev/scream-cipher",
    "summary": "Seth Larson introduces the \"Scream Cipher,\" a simple substitution cipher that replaces English alphabet letters with various Unicode \"Latin capital letter A\" characters. He was inspired by the fact that there are more of these Unicode \"A\" variants than letters in the English alphabet.\n\nThe article provides the cipher's key, mapping each letter (both uppercase and lowercase) to a unique \"A\" variant. Functions `SCREAM` and `unscream` are defined to encrypt and decrypt text using this key, respectively. The author demonstrates the cipher by encrypting the phrase \"SCREAM CIPHER\" and then decrypting it back to its original form.\n\nThe post concludes with a call to action, encouraging readers to share their thoughts and providing links to follow the blog on Mastodon, email, RSS, and Bluesky. It also offers links to browse the blog's archive, check out a list of internet finds, or, ideally, go outside.\n",
    "chinese_title": "尖叫密码 (\"ǠĂȦẶAẦ ĂǍÄẴẶȦ\")",
    "chinese_summary": "赛斯·拉尔森介绍了“尖叫密码”，这是一种简单的替换密码，它用各种Unicode“拉丁大写字母A”字符来替换英文字母。他的灵感来自于Unicode“A”变体比英文字母表中的字母更多这一事实。\n\n文章提供了密码的密钥，将每个字母（包括大写和小写）映射到唯一的“A”变体。定义了函数`SCREAM`和`unscream`，分别用于使用此密钥加密和解密文本。作者通过加密短语“SCREAM CIPHER”，然后将其解密回原始形式来演示该密码。\n\n文章最后号召读者分享他们的想法，并提供了在Mastodon、电子邮件、RSS和Bluesky上关注该博客的链接。它还提供了浏览博客存档、查看互联网发现列表或理想情况下出去走走的链接。"
  },
  {
    "id": "45312515",
    "title": "Images over DNS",
    "url": "https://dgl.cx/2025/09/images-over-dns",
    "summary": "This article explores the possibility of serving images directly over DNS TXT records, pushing the limits of what's typically considered possible. While TXT records are often thought to be limited to 255 bytes, the author demonstrates that, by utilizing multiple character strings within a single TXT record and leveraging TCP for DNS queries, much larger payloads (up to 64KB) can be transmitted.\n\nThe author implements this by using Google Public DNS's JSON API and a custom Go DNS server to serve large TXT responses containing image data.  A key challenge is handling binary data in JSON, requiring custom parsing. The advantage of using raw binary data is avoiding encoding overhead like Base64.\n\nThe article provides a practical example with a dog image and shows how to retrieve and convert the TXT data into a usable image file using `dig` and a Perl script.  It also acknowledges that some DNS recursors might not support large TXT records, suggesting using Google Public DNS or other open recursors as an alternative.\n\nThe author suggests the novelty of using DNS as a tunnel to deliver large payloads directly to a browser. This has potential security implications, especially with the increasing availability of IP address certificates through initiatives like Let's Encrypt, as it might bypass DNS filtering in certain environments.  Finally, the author acknowledges AI's role in generating the server-side code, while emphasizing their authorship of the blog post and client-side code.\n",
    "chinese_title": "基于DNS的图像传输",
    "chinese_summary": "本文探讨了直接通过 DNS TXT 记录传输图像的可能性，突破了通常认为的极限。 虽然 TXT 记录通常被认为限制在 255 字节以内，但作者证明，通过在单个 TXT 记录中使用多个字符串并利用 TCP 进行 DNS 查询，可以传输更大的负载（高达 64KB）。\n\n作者通过使用 Google Public DNS 的 JSON API 和自定义的 Go DNS 服务器来提供包含图像数据的大型 TXT 响应来实现这一点。 一个关键的挑战是在 JSON 中处理二进制数据，这需要自定义解析。 使用原始二进制数据的优点是避免了像 Base64 这样的编码开销。\n\n本文提供了一个实际的例子，即一张狗的图片，并展示了如何使用 `dig` 和 Perl 脚本来检索 TXT 数据并将其转换为可用的图像文件。 同时，它也承认某些 DNS 递归器可能不支持大型 TXT 记录，并建议使用 Google Public DNS 或其他开放递归器作为替代方案。\n\n作者认为，将 DNS 用作隧道直接向浏览器传递大型负载具有新颖性。 这具有潜在的安全隐患，特别是随着像 Let's Encrypt 这样的倡议使 IP 地址证书的可用性不断提高，因为它可能会绕过某些环境中的 DNS 过滤。 最后，作者承认 AI 在生成服务器端代码中的作用，同时强调他们是博客文章和客户端代码的作者。"
  },
  {
    "id": "45313793",
    "title": "Britain jumps into bed with Palantir in £1.5B defense pact",
    "url": "https://www.theregister.com/2025/09/20/uk_palantir_defense_pact/",
    "summary": "The UK government has entered a £1.5 billion defense pact with US spy-tech company Palantir, aiming to boost UK innovation and create hundreds of skilled jobs. This agreement, announced during a state visit by the US president, forms part of a larger £31 billion investment claim from various American tech giants.\n\nPalantir, known for its controversial data analytics work with the CIA and ICE, plans to establish its European HQ for defense in the UK, creating 350 jobs. The partnership will involve the UK military and Palantir collaborating on AI-powered capabilities for faster decision-making, military planning, and targeting, drawing on Palantir's experience in Ukraine.\n\nDefense Secretary John Healey stated that the collaboration will unlock billions in investment, positioning the UK as a leader in NATO innovation. The contract will fall under the Digital Targeting Web, a component of the Strategic Defence Review, aiming to integrate various data sources to enhance target selection.\n\nPalantir CEO Alex Karp pledged up to £750 million in UK investment, emphasizing the UK's importance as Palantir's largest presence outside the US. The Palantir deal is part of a broader wave of investment from US tech companies, including Microsoft, Google, and CoreWeave.\n",
    "chinese_title": "英国与Palantir达成15亿英镑国防协议",
    "chinese_summary": "英国政府与美国间谍技术公司帕兰提尔达成15亿英镑国防协议，旨在促进英国创新并创造数百个技术岗位。该协议在美国总统进行国事访问期间宣布，是来自各美国科技巨头声称的310亿英镑投资的一部分。\n\n帕兰提尔以其与中情局和美国移民及海关执法局备受争议的数据分析工作而闻名，计划在英国建立其欧洲国防总部，创造350个就业岗位。该合作将涉及英国军方与帕兰提尔在人工智能驱动的能力方面进行合作，以实现更快的决策、军事规划和目标锁定，借鉴帕兰提尔在乌克兰的经验。\n\n国防大臣约翰·希利表示，该合作将释放数十亿英镑的投资，使英国成为北约创新的领导者。该合同将属于“数字目标网络”，这是“战略防御评估”的一个组成部分，旨在整合各种数据源以增强目标选择。\n\n帕兰提尔首席执行官亚历克斯·卡普承诺在英国投资高达7.5亿英镑，强调英国作为帕兰提尔在美国以外的最大存在的重要性。帕兰提尔的协议是来自包括微软、谷歌和CoreWeave在内的美国科技公司更广泛投资浪潮的一部分。"
  },
  {
    "id": "45275058",
    "title": "Claude Can (Sometimes) Prove It",
    "url": "https://www.galois.com/articles/claude-can-sometimes-prove-it",
    "summary": "Mike Dodds' article \"Claude Can (Sometimes) Prove It\" explores the surprising capability of Anthropic's Claude Code, an AI coding agent, in interactive theorem proving (ITP) using Lean. ITP, while powerful for formal verification, is notoriously difficult and time-consuming. Dodds highlights how Claude Code can independently complete complex proof steps, acting as a \"project manager\" to guide the overall formalization process, suggesting a future where ITP tools are more accessible.\n\nHe details the challenges of ITP, emphasizing that it's not just about proving individual theorems but also about tasks like conceptual mathematics, mapping concepts into Lean's syntax, decomposing theorems, and debugging failures – essentially, \"proof engineering.\" Claude Code's strength lies in its ability to break down complex requests into sub-tasks, leveraging feedback from Lean's strictness to iteratively correct errors.\n\nDodds tested Claude Code by formalizing a research paper on Deny-Guarantee Reasoning in Lean. The agent handled various levels of tasks, including refactoring, definition of theorems, and proofs with surprisingly positive results. However, Dodds acknowledges that this AI-assisted formalization was slower than manual work, encountering issues like thrashing (repeatedly failing), shallow persistent mistakes (parsing), and deep persistent mistakes (conceptual errors). While the AI made mistakes, they could usually be resolved with minimal guidance. Dodds suggests that designing tools specifically for AI agents, focusing on detailed feedback rather than polished output, could further enhance their effectiveness in ITP.\n",
    "chinese_title": "克劳德有时能证明这一点",
    "chinese_summary": "Mike Dodds 的文章《Claude 确实 (有时) 能证明》探讨了 Anthropic 的 Claude Code，一种 AI 编码代理，在使用 Lean 进行交互式定理证明 (ITP) 方面令人惊讶的能力。ITP 虽然在形式化验证方面功能强大，但却以其难度大且耗时而闻名。Dodds 强调了 Claude Code 如何独立完成复杂的证明步骤，充当“项目经理”来指导整个形式化过程，暗示了 ITP 工具在未来会更易于使用。\n\n他详细描述了 ITP 的挑战，强调它不仅仅是证明单个定理，还包括诸如概念数学、将概念映射到 Lean 的语法、分解定理以及调试错误等任务——本质上是“证明工程”。 Claude Code 的优势在于它能够将复杂的请求分解为子任务，并利用 Lean 的严格性反馈来迭代地纠正错误。\n\nDodds 通过在 Lean 中形式化一篇关于 Deny-Guarantee Reasoning 的研究论文来测试 Claude Code。 该代理处理了各种级别的任务，包括重构、定理的定义和证明，结果出乎意料地积极。 然而，Dodds 承认这种 AI 辅助的形式化比手动工作慢，遇到了诸如抖动（反复失败）、浅层持久错误（解析）和深层持久错误（概念错误）等问题。 尽管 AI 犯了错误，但通常可以用最少的指导来解决。 Dodds 建议，专门为 AI 代理设计工具，侧重于详细的反馈而不是精美的输出，可以进一步提高它们在 ITP 中的效率。"
  },
  {
    "id": "45293012",
    "title": "MapSCII – World Map in Terminal",
    "url": "https://github.com/rastapasta/mapscii",
    "summary": "MapSCII is a terminal-based application that renders a world map using Braille and ASCII characters, allowing users to explore the globe directly from their console. It leverages vector tiles to provide a detailed and interactive map experience. Users can interact with the map using keyboard shortcuts (arrow keys, 'a', 'z', 'c', 'q') and mouse controls (dragging and scrolling) if their terminal supports mouse events.\n\nThe application boasts features like point-of-interest discovery, customizable styling via Mapbox Styles, compatibility with public and private vector tile servers, offline usage with local VectorTile/MBTiles, and optimized algorithms for a smooth user experience.\n\nInstallation is straightforward using `npm` or `snap`. To run it, simply type `mapscii` in the terminal.\n\nBehind the scenes, MapSCII utilizes several libraries for tasks like color conversion (`x256`), mouse handling (`term-mouse`), input handling (`keypress`), string length calculation (`string-width`), vector tile parsing (`vector-tile`, `pbf`, `mbtiles`), polygon triangulation (`earcut`), spatial indexing (`rbush`), line point calculation (`bresenham`), polyline simplification (`simplify-js`), HTTP requests (`node-fetch`), and tile storage management (`env-paths`).\n\nThe project has several planned improvements including GeoJSON support, CLI enhancements, and optimizations for tile rendering and label drawing. Map data is sourced from OpenStreetMap under the Open Data Commons Open Database License (ODbL), while the cartography is licensed under the Creative Commons Attribution-ShareAlike 2.0 license (CC BY-SA).\n",
    "chinese_title": "MapSCII – 终端中的世界地图",
    "chinese_summary": "MapSCII：一个基于终端的应用，它使用盲文和ASCII字符渲染世界地图，允许用户直接从控制台探索全球。它利用矢量瓦片来提供详细和交互式的地图体验。如果用户的终端支持鼠标事件，则可以使用键盘快捷键（方向键、'a'、'z'、'c'、'q'）和鼠标控制（拖动和滚动）与地图交互。\n\n该应用拥有诸如兴趣点发现、通过Mapbox Styles进行自定义样式设置、与公共和私有矢量瓦片服务器的兼容性、使用本地VectorTile/MBTiles进行离线使用以及优化的算法等功能，以提供流畅的用户体验。\n\n可以使用 `npm` 或 `snap` 轻松安装。要运行它，只需在终端中键入 `mapscii` 即可。\n\n在幕后，MapSCII利用多个库来完成诸如颜色转换 (`x256`)、鼠标处理 (`term-mouse`)、输入处理 (`keypress`)、字符串长度计算 (`string-width`)、矢量瓦片解析 (`vector-tile`, `pbf`, `mbtiles`)、多边形三角剖分 (`earcut`)、空间索引 (`rbush`)、线点计算 (`bresenham`)、折线简化 (`simplify-js`)、HTTP请求 (`node-fetch`) 和瓦片存储管理 (`env-paths`) 等任务。\n\n该项目有几个计划中的改进，包括 GeoJSON 支持、CLI 增强以及瓦片渲染和标签绘制的优化。地图数据来自OpenStreetMap，采用Open Data Commons Open Database License（ODbL）许可，而制图采用Creative Commons Attribution-ShareAlike 2.0许可（CC BY-SA）。"
  },
  {
    "id": "45307242",
    "title": "Less is safer: How Obsidian reduces the risk of supply chain attacks",
    "url": "https://obsidian.md/blog/less-is-safer/",
    "summary": "Obsidian prioritizes security by minimizing its reliance on third-party code to mitigate supply chain attack risks. This \"less is safer\" approach involves building core features from scratch, re-implementing small utility functions, forking medium modules, and carefully managing large libraries like pdf.js, Mermaid, and MathJax by using version-locked files with occasional, thoroughly tested upgrades.\n\nOnly essential packages like Electron and CodeMirror are part of the app users run. Build dependencies are kept separate. Obsidian employs strict version pinning and lockfiles for deterministic builds and clear audit trails. Postinstall scripts are avoided to prevent arbitrary code execution during installation.\n\nDependency updates are approached cautiously with meticulous reviews including changelog analysis, sub-dependency checks, upstream diffing, and extensive testing. Obsidian deliberately delays upgrades to allow time for the community and security researchers to identify potential issues.\n\nThis multi-faceted strategy, combining minimal dependencies, shallow dependency graphs, version pinning, and a deliberate upgrade process, significantly reduces Obsidian's vulnerability to supply chain attacks and provides a valuable window for detecting issues before they impact users. Further details on Obsidian's security measures can be found on their security page and past audits.\n",
    "chinese_title": "少即是安全：Obsidian 如何降低供应链攻击的风险",
    "chinese_summary": "Obsidian 通过尽量减少对第三方代码的依赖来优先考虑安全性，从而降低供应链攻击的风险。这种“少即是安全”的方法包括从头开始构建核心功能，重新实现小型实用程序函数，Fork 中型模块，并通过使用版本锁定的文件以及偶尔经过彻底测试的升级来谨慎管理大型库（如 pdf.js、Mermaid 和 MathJax）。\n\n只有 Electron 和 CodeMirror 等必要的软件包是用户运行的应用程序的一部分。构建依赖项保持分离。Obsidian 采用严格的版本固定和锁定文件来实现确定性构建和清晰的审计跟踪。避免使用 Postinstall 脚本，以防止在安装过程中执行任意代码。\n\n依赖项更新采取谨慎的态度，进行细致的审查，包括变更日志分析、子依赖项检查、上游差异比较和广泛的测试。Obsidian 有意延迟升级，以便社区和安全研究人员有时间发现潜在的问题。\n\n这种多方面的策略，结合最小的依赖项、浅层的依赖关系图、版本固定以及深思熟虑的升级过程，显著降低了 Obsidian 遭受供应链攻击的脆弱性，并为在问题影响用户之前检测到问题提供了宝贵的窗口。有关 Obsidian 安全措施的更多详细信息，请访问其安全页面和过去的审计报告。"
  },
  {
    "id": "45313597",
    "title": "Is Zig's New Writer Unsafe?",
    "url": "https://www.openmymind.net/Is-Zigs-New-Io-Unsafe/",
    "summary": "This article highlights a potential safety issue with Zig's new `std.Io.Reader` and `Writer` interfaces, specifically concerning buffer size requirements. The author demonstrates that a function designed to read from a generic `Reader` and write to `stdout` can exhibit undefined behavior depending on the buffer size allocated for the `Writer`.\n\nThe problem stems from the fact that certain `Reader` implementations, like `zstd.Decompress`, impose specific buffer size requirements on the `Writer` used with them. If the `Writer`'s buffer is too small, the code can trigger assertions in debug mode or enter infinite loops in release mode.\n\nThe author argues that this issue is more than just a documentation problem. Scenarios exist where the required buffer size for a `Reader` is either unknown, conditional (e.g., based on HTTP headers), or obscured by library abstractions. Furthermore, the failure can depend on the specific input data being processed, making the issue difficult to detect during development. The author expresses concern that this seemingly subtle misconfiguration could lead to unpredictable and hard-to-debug behavior in Zig programs. They question whether they are overlooking something and, if not, assert that it represents a significant problem with the current `Reader`/`Writer` design.\n",
    "chinese_title": "Zig的新作家不安全吗？",
    "chinese_summary": "本文重点指出 Zig 新的 `std.Io.Reader` 和 `Writer` 接口中一个潜在的安全问题，特别是关于缓冲区大小的要求。作者演示了一个旨在从通用 `Reader` 读取并写入 `stdout` 的函数，其行为可能因分配给 `Writer` 的缓冲区大小而呈现未定义状态。\n\n该问题的根源在于，某些 `Reader` 实现，例如 `zstd.Decompress`，对与其一起使用的 `Writer` 施加特定的缓冲区大小要求。如果 `Writer` 的缓冲区太小，代码可能会在调试模式下触发断言，或者在发布模式下进入无限循环。\n\n作者认为，这个问题不仅仅是文档问题。存在某些情况下，`Reader` 所需的缓冲区大小要么未知，要么是条件性的（例如，基于 HTTP 标头），或者被库抽象所掩盖。此外，故障可能取决于正在处理的特定输入数据，从而使得该问题在开发期间难以检测。作者表达了担忧，认为这种看似细微的配置错误可能导致 Zig 程序中出现不可预测且难以调试的行为。他们质疑是否遗漏了某些东西，如果不是，则断言这代表当前 `Reader`/`Writer` 设计的一个重大问题。"
  },
  {
    "id": "45265688",
    "title": "Escapee pregnancy test frogs colonised Wales for 50 years",
    "url": "https://www.bbc.com/news/uk-wales-44886585",
    "summary": "For 50 years, escapee African clawed frogs, once used in pregnancy tests, colonized a region of South Wales. In the mid-20th century, these frogs were used to detect pregnancy by injecting a woman's urine into the female frog, which would produce eggs if the woman was pregnant. After escaping from UK research centers, they established themselves in the Bridgend and Vale of Glamorgan areas, with the first sighting reported in 1966.\n\nResearchers from Bristol University studied the colony extensively, keeping its location secret. Over time, they marked and released approximately 2,000 frogs, finding some lived up to 14 years despite the cooler climate.\n\nBy 2008, the Welsh Government planned to eradicate the frogs due to concerns about spreading the chytrid fungus to native amphibians. However, before the eradication program could be fully implemented in 2010, the frog population drastically declined, likely due to severe winters in 2009 and 2010, which led to ponds drying out and increased cannibalism. Trapping attempts in 2010 and 2011 yielded only one frog.\n\nDespite their long presence, there were no major conservation concerns raised about the frogs' presence in Wales. By 2014, trapping attempts were abandoned and the government concluded that there were likely no frogs remaining in the region. Intermittent surveys haven't detected any sign of them since, though the possibility of isolated survivors remains.\n",
    "chinese_title": "逃逸验孕蛙在威尔士繁殖了50年",
    "chinese_summary": "逃逸非洲爪蟾：曾用于妊娠测试，在南威尔士殖民50年"
  },
  {
    "id": "45313194",
    "title": "Bezier Curve as Easing Function in C++",
    "url": "https://asawicki.info/news_1790_bezier_curve_as_easing_function_in_c",
    "summary": "This article introduces a C++ library, `EasingCubicBezier<T>`, designed for efficient implementation of cubic Bézier curves as easing functions. The library, created by Łukasz Izdebski, offers a modern C++ approach using a single header file and avoids external dependencies. It interpolates parameters based on the Bézier curve's control points, allowing for custom easing effects in animations and graphics.\n\nThe library supports two modes: `PRECISE` for high accuracy using transcendental functions, and `FAST` for better performance through approximations. It has been tested and benchmarked against commonly used methods, including those found in Blender (algebraic solutions) and numerical methods (Newton-Raphson).\n\nBenchmark results using the Google Benchmark framework demonstrate that the `EasingCubicBezier` approach offers a stable and consistently low execution time, making it predictable and effective for real-time animation systems. Compared to algebraic and numerical methods which solve cubic polynomial equations at runtime, it shows superior performance and reduced variability. The `Optimised Blender` approach is highlighted as a good compromise between speed and stability.\n\nThe primary advantage of the library is its ability to represent Bézier curves explicitly in a small memory footprint (28 bytes for float, 56 bytes for double). The author emphasizes that this eliminates the need to solve cubic polynomial equations during runtime, thereby improving performance. Future work aims to further optimize runtime performance while maintaining flexibility.\n",
    "chinese_title": "C++中使用贝塞尔曲线作为缓动函数",
    "chinese_summary": "本文介绍了一个 C++ 库 `EasingCubicBezier<T>`，该库旨在高效实现三次贝塞尔曲线作为缓动函数。该库由 Łukasz Izdebski 创建，提供了一种现代 C++ 方法，仅使用单个头文件，避免了外部依赖。它基于贝塞尔曲线的控制点插值参数，从而可以在动画和图形中实现自定义缓动效果。\n\n该库支持两种模式：`PRECISE` 用于使用超越函数的高精度，`FAST` 用于通过近似实现更好的性能。它已经过测试并与常用方法进行了基准测试，包括 Blender 中的方法（代数解）和数值方法（牛顿-拉夫逊法）。\n\n使用 Google Benchmark 框架的基准测试结果表明，`EasingCubicBezier` 方法提供了稳定且始终较低的执行时间，使其对于实时动画系统具有可预测性和有效性。与在运行时求解三次多项式方程的代数和数值方法相比，它表现出卓越的性能并降低了可变性。“Optimised Blender”方法被强调为速度和稳定性之间的良好折衷方案。\n\n该库的主要优势在于它能够以较小的内存占用（浮点数 28 字节，双精度数 56 字节）显式表示贝塞尔曲线。作者强调，这消除了在运行时求解三次多项式方程的需要，从而提高了性能。未来的工作旨在进一步优化运行时性能，同时保持灵活性。"
  },
  {
    "id": "45314432",
    "title": "Are Touchscreens in Cars Dangerous?",
    "url": "https://www.economist.com/science-and-technology/2025/09/19/are-touchscreens-in-cars-dangerous",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "车载触摸屏危险吗？",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "45259623",
    "title": "If all the world were a monorepo",
    "url": "https://jtibs.substack.com/p/if-all-the-world-were-a-monorepo",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "如果全世界都是一个单体仓库",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "45311247",
    "title": "Show HN: FocusStream – Focused, distraction-free YouTube for learners",
    "url": "https://focusstream.media",
    "summary": "FocusStream is presented as a focused and distraction-free YouTube experience specifically designed for learners. The \"Show HN\" title suggests the author is showcasing their project to the Hacker News community. The implication is that FocusStream aims to provide a cleaner interface for watching educational content on YouTube, removing elements that might detract from learning, such as recommended videos, comments, or other potentially irrelevant features. The core value proposition is increased concentration and a more efficient learning experience on the YouTube platform.\n",
    "chinese_title": "Show HN: FocusStream – 专为学习者打造的专注、无干扰 YouTube 体验",
    "chinese_summary": "FocusStream：专为学习者设计的专注无干扰YouTube体验。 \"Show HN\" 标题表明作者正在向 Hacker News 社区展示其项目。这意味着 FocusStream 旨在为在 YouTube 上观看教育内容提供一个更简洁的界面，移除可能分散学习注意力的元素，例如推荐视频、评论或其他可能无关的功能。其核心价值在于提高专注度，并在 YouTube 平台上提供更高效的学习体验。"
  },
  {
    "id": "45300810",
    "title": "The best YouTube downloaders, and how Google silenced the press",
    "url": "https://windowsread.me/p/best-youtube-downloaders",
    "summary": "Chris Hoffman's article, \"The best YouTube downloaders, and how Google silenced the press,\" recommends several free and open-source YouTube downloaders, including Stacher (Windows, Mac, Linux), yt-dlp (command line), Cobalt.tools (web), and NewPipe (Android). He argues that using YouTube downloaders is ethical for creating personal backups and archiving content, especially given YouTube's role as a vital repository of information.\n\nHoffman criticizes the hypocrisy of lengthy and often unread Terms of Service agreements (like YouTube's), comparing them to EULAs. He believes Google benefits from the gray market surrounding YouTube downloaders, as it allows users flexibility and maintains YouTube's dominance.\n\nA significant portion of the article exposes how Google allegedly used its ad network monopoly (since ruled illegal) to discourage publications from writing about YouTube downloaders. He recounts how Google reportedly penalized sites that featured such tools, demonstrating Google's past efforts to control its YouTube business. He highlights that while Google doesn't explicitly ban downloaders, they make them inconvenient to use, striking a balance between control and user access. He also touches on the ethics of downloading videos for personal use, especially in light of AI companies training on copyrighted content.\n",
    "chinese_title": "最佳YouTube下载器，以及谷歌如何封锁媒体",
    "chinese_summary": "Chris Hoffman的文章《最佳YouTube下载器，以及谷歌如何压制媒体》推荐了几款免费开源的YouTube下载器，包括Stacher (Windows, Mac, Linux)、yt-dlp (命令行)、Cobalt.tools (网页) 和 NewPipe (Android)。他认为，使用YouTube下载器创建个人备份和存档内容是合乎道德的，尤其考虑到YouTube作为重要的信息存储库的作用。\n\nHoffman批评了冗长且往往无人阅读的服务条款协议（如YouTube的）的虚伪性，将其与EULA相提并论。他认为，谷歌从围绕YouTube下载器的灰色市场中获益，因为它允许用户灵活性并维持YouTube的统治地位。\n\n文章的重要部分揭露了谷歌据称如何利用其广告网络垄断地位（已被裁定为非法）来阻止媒体撰写关于YouTube下载器的文章。他讲述了谷歌如何惩罚那些推荐此类工具的网站，这表明了谷歌过去控制其YouTube业务的努力。他强调，虽然谷歌没有明确禁止下载器，但他们使其使用不便，从而在控制和用户访问之间取得了平衡。他还提到了为个人使用而下载视频的伦理问题，尤其是在人工智能公司使用受版权保护的内容进行训练的情况下。"
  },
  {
    "id": "45311115",
    "title": "LLM-Deflate: Extracting LLMs into Datasets",
    "url": "https://www.scalarlm.com/blog/llm-deflate-extracting-llms-into-datasets/",
    "summary": "Greg Diamos's article \"LLM-Deflate: Extracting LLMs into Datasets\" introduces a novel technique for systematically extracting structured datasets from Large Language Models (LLMs) by reversing the compression process inherent in LLM training. The core idea is to leverage LLM inference to \"decompress\" the knowledge embedded within the model's parameters into reusable training data.\n\nThe article highlights the shortcomings of traditional synthetic data generation methods and proposes a hierarchical topic exploration approach. This method involves recursively generating more specific subtopics from broad categories to systematically traverse a model’s knowledge space. For each topic, the system generates training examples, prompting the model to provide explicit reasoning steps alongside factual knowledge.\n\nTo address the inference cost bottleneck, the author emphasizes the importance of high-performance inference infrastructure (scalarlm) for parallel example generation, prompt engineering iteration, and comprehensive knowledge space coverage.\n\nThe methodology was applied to Qwen3-Coder, GPT-OSS, and Llama 3, generating 10,000+ structured training examples for each. These datasets are available on Hugging Face and reveal differences in how each model approaches problems.\n\nThe extracted datasets have applications in model analysis, knowledge transfer (fine-tuning other models), training data augmentation, and model debugging. The article also addresses technical challenges like prompt engineering, topic tree balance, and quality filtering, alongside solutions. Future research directions include cross-model knowledge transfer, knowledge evolution tracking, specialized dataset creation, and model interpretability. The author suggests that as inference costs decrease, this systematic knowledge extraction will become a standard part of the ML toolkit.\n",
    "chinese_title": "LLM-泄气：将LLM提取为数据集",
    "chinese_summary": "Greg Diamos 的文章《LLM-Deflate：将 LLM 提取到数据集中》介绍了一种新颖的技术，通过逆转 LLM 训练中固有的压缩过程，系统地从大型语言模型 (LLM) 中提取结构化数据集。其核心思想是利用 LLM 推理，将模型参数中嵌入的知识“解压缩”为可重用的训练数据。\n\n该文章强调了传统合成数据生成方法的缺点，并提出了一种分层主题探索方法。该方法涉及从广泛的类别递归生成更具体的子主题，以系统地遍历模型的知识空间。对于每个主题，系统都会生成训练示例，提示模型提供明确的推理步骤以及事实性知识。\n\n为了解决推理成本瓶颈，作者强调了高性能推理基础设施 (scalarlm) 对于并行示例生成、提示工程迭代和全面知识空间覆盖的重要性。\n\n该方法应用于 Qwen3-Coder、GPT-OSS 和 Llama 3，为每个模型生成了 10,000 多个结构化训练示例。这些数据集可在 Hugging Face 上获取，并揭示了每个模型解决问题的方式差异。\n\n提取的数据集可用于模型分析、知识转移（微调其他模型）、训练数据增强和模型调试。文章还讨论了诸如提示工程、主题树平衡和质量过滤等技术挑战，以及相应的解决方案。未来的研究方向包括跨模型知识转移、知识演化跟踪、专业数据集创建和模型可解释性。作者认为，随着推理成本的降低，这种系统的知识提取将成为机器学习工具包的标准组成部分。"
  },
  {
    "id": "45312696",
    "title": "Git: Introduce Rust and announce that it will become mandatorty",
    "url": "https://lore.kernel.org/git/20250904-b4-pks-rust-breaking-change-v1-0-3af1d25e0be9@pks.im/",
    "summary": "The provided content is not an article about Git introducing Rust and becoming mandatory. Instead, it's a security measure implemented on a website to prevent AI crawlers from overloading the server.\n\nHere's a summary of what the content actually describes:\n\nThe message explains that the user is seeing the page because the website is protected by a system called Anubis. Anubis is designed to deter AI crawlers that aggressively scrape websites, potentially causing them to crash and become inaccessible to legitimate users.\n\nAnubis employs a \"Proof-of-Work\" mechanism, similar to Hashcash, which requires the user's browser to perform a small amount of computation. This burden is negligible for individual users but becomes significant for large-scale crawlers, making it more difficult for them to operate.\n\nThe text clarifies that Anubis is a temporary solution. The website administrators are working on more sophisticated methods, like fingerprinting and identifying headless browsers, to distinguish between legitimate users and bots. This would ideally eliminate the need for the \"Proof-of-Work\" challenge.\n\nThe message also notes that Anubis requires JavaScript to function correctly and suggests disabling browser plugins like JShelter, which might interfere with its operation. It acknowledges that requiring JavaScript is inconvenient but necessary due to the behavior of AI companies and emphasizes that a JavaScript-free solution is under development.\n",
    "chinese_title": "Git：引入Rust并宣布其将成为强制标准",
    "chinese_summary": "提供的內容並非關於Git引入Rust並強制執行的文章，而是在網站上實施的一項安全措施，旨在防止AI爬蟲使伺服器過載。\n\n以下是內容實際描述的摘要：\n\n該訊息解釋說，用戶看到此頁面是因為該網站受到名為Anubis的系統保護。Anubis旨在阻止積極抓取網站的AI爬蟲，這些爬蟲可能會導致網站崩潰並使合法用戶無法訪問。\n\nAnubis採用類似於Hashcash的“工作量證明”機制，需要用戶的瀏覽器執行少量計算。對於個別用戶而言，這種負擔可以忽略不計，但對於大規模爬蟲而言，則變得非常重要，使其更難以運行。\n\n該文本澄清說，Anubis是一種臨時解決方案。網站管理員正在研究更複雜的方法，例如指紋識別和識別無頭瀏覽器，以區分合法用戶和機器人。理想情況下，這將消除對“工作量證明”挑戰的需求。\n\n該訊息還指出，Anubis需要JavaScript才能正常運行，並建議禁用諸如JShelter之類的瀏覽器插件，這些插件可能會干擾其運行。它承認需要JavaScript很不方便，但由於AI公司的行為，這是必要的，並強調正在開發一種無JavaScript的解決方案。"
  },
  {
    "id": "45285711",
    "title": "Evals in 2025: benchmarks to build models people can use",
    "url": "https://github.com/huggingface/evaluation-guidebook/blob/main/yearly_dives/2025-evaluations-for-useful-models.md",
    "summary": "This Hugging Face \"Evaluation Guidebook,\" focusing on \"Evals in 2025,\" explores the future of evaluating large language models (LLMs) with the goal of building models truly useful to people. It emphasizes the need to move beyond current benchmarks that often fail to reflect real-world usage and focus on evaluations that prioritize user needs and practical applications.\n\nThe guide likely argues for:\n\n*   **More realistic benchmarks:** Current benchmarks can be easily gamed and often don't correlate with real-world performance or user satisfaction. The guidebook probably advocates for benchmarks that closely simulate how people will actually use LLMs.\n*   **User-centric evaluation:** Instead of solely focusing on metrics like accuracy or perplexity, the guide emphasizes evaluating LLMs based on how well they solve user problems, improve productivity, and enhance user experience.\n*   **Comprehensive evaluation:** The guidebook likely suggests evaluating LLMs across a range of capabilities, including reasoning, creativity, communication, and safety, ensuring models are well-rounded and reliable.\n*   **Evolving benchmarks:** As models improve and use cases evolve, the guidebook probably emphasizes the need for constantly updating and adapting evaluation methods to stay relevant and push the boundaries of LLM capabilities.\n\nIn essence, the \"Evaluation Guidebook\" likely provides a framework for building better evaluation practices that lead to LLMs that are not just impressive on paper but also genuinely valuable and usable for people in their daily lives.\n",
    "chinese_title": "2025年评估：构建人们可用模型的基准",
    "chinese_summary": "Hugging Face“评估指南”，聚焦“2025年的评估”，旨在探索评估大型语言模型（LLM）的未来，以构建真正对人们有用的模型。它强调需要超越当前通常无法反映真实世界使用的基准，并专注于优先考虑用户需求和实际应用的评估。\n\n该指南可能主张：\n\n*   **更真实的基准：** 当前的基准很容易被攻破，并且通常与真实世界的性能或用户满意度不相关。该指南可能提倡密切模拟人们实际使用 LLM 方式的基准。\n*   **以用户为中心的评估：** 该指南强调基于 LLM 解决用户问题、提高生产力和增强用户体验的能力来进行评估，而不是仅仅关注准确性或困惑度等指标。\n*   **全面的评估：** 该指南可能建议评估 LLM 在推理、创造力、沟通和安全性等一系列能力，以确保模型全面可靠。\n*   **不断发展的基准：** 随着模型的改进和用例的演变，该指南可能强调需要不断更新和调整评估方法，以保持相关性并推动 LLM 能力的边界。\n\n本质上，该“评估指南”可能提供了一个框架，用于构建更好的评估实践，从而产生不仅在纸面上令人印象深刻，而且在人们的日常生活中真正有价值和可用的 LLM。"
  },
  {
    "id": "45268084",
    "title": "PyPI Blog: Token Exfiltration Campaign via GitHub Actions Workflows",
    "url": "https://blog.pypi.org/posts/2025-09-16-github-actions-token-exfiltration/",
    "summary": "This PyPI blog post details a recent token exfiltration campaign targeting PyPI publishing tokens through malicious GitHub Actions workflows. Attackers injected code into workflows across numerous repositories, attempting to steal tokens stored as GitHub secrets and send them to external servers. While some tokens were successfully exfiltrated, there's no evidence they were used to compromise PyPI or publish malicious packages.\n\nThe incident began when GitGuardian identified a malicious workflow attempting token exfiltration. A delayed response was caused by the initial report landing in PyPI's spam folder. Investigation revealed a widespread attack, with many maintainers already responding by reverting changes, removing workflows, or rotating tokens. PyPI has invalidated all affected tokens and notified impacted project maintainers.\n\nThe blog emphasizes using GitHub Trusted Publishers as the most effective mitigation. Trusted Publishers employ short-lived, repository-scoped tokens, significantly reducing the risk of compromise. Users are also advised to review their PyPI account security history for suspicious activity. The post thanks GitGuardian for their collaboration and acknowledges Alpha-Omega and other sponsors for supporting PyPI's security efforts.\n",
    "chinese_title": "PyPI 博客：通过 GitHub Actions 工作流进行的 Token 窃取活动",
    "chinese_summary": "近期PyPI令牌泄露事件：恶意GitHub Actions工作流窃取令牌。攻击者将代码注入多个仓库的工作流，试图窃取存储为GitHub secrets的令牌并发送至外部服务器。虽然部分令牌被成功窃取，但没有证据表明它们被用于入侵PyPI或发布恶意软件包。\n\nGitGuardian首先发现了一个试图窃取令牌的恶意工作流，事件由此开始。由于最初的报告落入PyPI的垃圾邮件文件夹，导致响应延迟。调查显示这是一次广泛的攻击，许多维护者已经通过还原更改、删除工作流或轮换令牌做出响应。PyPI已使所有受影响的令牌失效，并通知了受影响的项目维护者。\n\n该博客强调使用GitHub Trusted Publishers作为最有效的缓解措施。Trusted Publishers采用有效期短、仓库范围的令牌，显著降低了泄露风险。用户还应审查其PyPI账户安全历史记录，以查找可疑活动。文章感谢GitGuardian的合作，并感谢Alpha-Omega和其他赞助商对PyPI安全工作的支持。"
  },
  {
    "id": "45300865",
    "title": "Ants that seem to defy biology – They lay eggs that hatch into another species",
    "url": "https://www.smithsonianmag.com/smart-news/these-ant-queens-seem-to-defy-biology-they-lay-eggs-that-hatch-into-another-species-180987292/",
    "summary": "Iberian harvester ant queens (Messor ibericus) exhibit an unprecedented biological phenomenon called \"xenoparity,\" where they lay eggs that hatch into males of another species, the builder harvester ant (Messor structor). This discovery challenges the traditional definition of a species, which relies on the ability to reproduce fertile offspring within the same group.\n\nThe M. ibericus queens mate with M. structor males and store their sperm. They then fertilize some eggs with this sperm, removing their own genetic material, effectively producing M. structor male clones. Consequently, M. ibericus colonies consist of M. ibericus queens, hybrid worker ants (female hybrids of both species), and both M. ibericus and M. structor males.\n\nThis is surprising because M. ibericus and M. structor diverged evolutionarily over five million years ago. Researchers identified this behavior by finding both hairy (M. ibericus) and hairless (M. structor) males within M. ibericus colonies, and confirming their species through DNA testing. They further verified the phenomenon by observing M. structor births from M. ibericus queens in a lab setting.\n\nThe purpose of this unusual relationship is thought to be mutually beneficial. M. ibericus gains a consistent supply of workers, while M. structor males are distributed to new areas outside of their limited mountainous habitats, as M. structor colonies are only found in mountainous regions. However, the cloning of M. structor males might lead to an accumulation of harmful genetic mutations over time. Despite potential long-term drawbacks, the current arrangement is successful, showcasing a unique example of coevolution.\n",
    "chinese_title": "似乎违背生物学规律的蚂蚁——它们产下的卵孵化出另一种物种",
    "chinese_summary": "伊比利亚收获蚁后展现前所未有的“异种生育”现象，产下的卵孵化成另一种蚂蚁——建筑收获蚁的雄蚁。这一发现挑战了依赖于同种群内繁殖可育后代能力的传统物种定义。\n\n伊比利亚收获蚁后与建筑收获蚁雄蚁交配并储存精子。然后，它们用这些精子给部分卵受精，同时移除自身的遗传物质，从而有效地产生建筑收获蚁的雄性克隆体。因此，伊比利亚收获蚁群落由伊比利亚收获蚁后、杂交工蚁（两种蚂蚁的雌性杂交后代），以及伊比利亚收获蚁和建筑收获蚁的雄蚁组成。\n\n令人惊讶的是，伊比利亚收获蚁和建筑收获蚁在进化上已经分离了五百多万年。研究人员通过在伊比利亚收获蚁群落中发现有毛（伊比利亚收获蚁）和无毛（建筑收获蚁）的雄蚁，并通过DNA检测确认了它们的物种，从而识别了这种行为。他们还通过在实验室环境中观察到伊比利亚收获蚁后产下建筑收获蚁，进一步证实了这一现象。\n\n这种不寻常关系的目的被认为是互惠互利的。伊比利亚收获蚁获得稳定的工蚁供应，而建筑收获蚁雄蚁则被分布到其有限山区栖息地之外的新区域，因为建筑收获蚁群落仅分布于山区。然而，建筑收获蚁雄蚁的克隆可能会导致有害基因突变随着时间的推移而积累。尽管存在潜在的长期缺陷，但目前的安排是成功的，展示了一个独特的共同进化案例。"
  },
  {
    "id": "45307166",
    "title": "Show HN: Zedis – A Redis clone I'm writing in Zig",
    "url": "https://github.com/barddoo/zedis",
    "summary": "Zedis is a Redis-compatible, in-memory data store written in Zig, intended as a learning project and not for production. It aims for simplicity, performance, and thread safety by implementing the core Redis protocol (RESP) and data structures. Key features include string and integer storage, essential Redis commands (GET, SET, INCR, etc.), concurrent client connection handling, and RDB snapshots. Recent additions include Pub/Sub functionality.\n\nThe project roadmap includes implementing AOF logging, more Redis commands, lists and sets, configuration file support, key expiration, clustering, and a performance benchmarking suite.\n\nTo get started, users need Zig (version 0.15.1 or later). Building is done with `zig build` and running with `zig build run`. The server defaults to 127.0.0.1:6379. Users can interact with Zedis using `redis-cli`.\n\nZedis emphasizes type-safe operations, explicit error handling, memory safety (without garbage collection), modular design, and comprehensive logging. Memory allocation is handled during initialization to avoid dynamic allocation during command execution. Adding new commands involves implementing a handler, registering the command, and adding tests. The project stresses adherence to Zig's code style. The project's GitHub link is provided for more information.\n",
    "chinese_title": "Show HN: Zedis – 我用 Zig 写的 Redis 克隆",
    "chinese_summary": "Zedis 是一个用 Zig 编写的、兼容 Redis 的内存数据存储，旨在作为学习项目，不适用于生产环境。它通过实现核心 Redis 协议 (RESP) 和数据结构，追求简洁、性能和线程安全。主要特性包括字符串和整数存储、基本 Redis 命令（GET、SET、INCR 等）、并发客户端连接处理和 RDB 快照。最近新增了发布/订阅功能。\n\n项目路线图包括实现 AOF 日志、更多 Redis 命令、列表和集合、配置文件支持、键过期、集群和性能基准测试套件。\n\n要开始使用，用户需要 Zig（0.15.1 或更高版本）。构建使用 `zig build` 命令，运行使用 `zig build run` 命令。服务器默认为 127.0.0.1:6379。用户可以使用 `redis-cli` 与 Zedis 交互。\n\nZedis 强调类型安全操作、显式错误处理、内存安全（无需垃圾回收）、模块化设计和全面的日志记录。内存分配在初始化期间处理，以避免在命令执行期间进行动态分配。添加新命令涉及实现处理程序、注册命令和添加测试。该项目强调遵守 Zig 的代码风格。项目的 GitHub 链接已提供，以获取更多信息。"
  },
  {
    "id": "45312228",
    "title": "IG Nobel Prize Winners 2025",
    "url": "https://improbable.com/ig/winners/",
    "summary": "This article announces the 2025 and 2024 Ig Nobel Prize winners, awards that honor achievements that \"first make people laugh, then make them think.\" The 2025 awards cover a wide range of unusual but thought-provoking research. Highlights include a Literature Prize for a 35-year study on fingernail growth, a Psychology Prize examining the effect of intelligence feedback on narcissism, and a Nutrition Prize for a study of lizards eating pizza. Other awards recognize research on garlic's effect on breast milk, zebra-striped cows deterring flies, the potential of Teflon as a calorie-free food volumizer, alcohol's impact on foreign language skills, shoe-rack design in relation to shoe odor, alcohol's impact on bat flight, and the physics of pasta sauce clumping.\n\nThe 2024 Ig Nobel Prizes include a Peace Prize for B.F. Skinner's pigeon-guided missile research, a Botany Prize for plants imitating plastic plants, an Anatomy Prize investigating hair swirl direction in different hemispheres, and a Medicine Prize highlighting the effectiveness of placebos with painful side effects. Additional prizes were awarded for research on dead trout swimming, mammals breathing through their anus, the probability of coin flips landing on the same side they started, chromatography for separating drunk and sober worms, demographic anomalies in supercentenarian data, and exploding a paper bag near cows to study milk ejection.\n\nThe article also mentions the 2023 Ig Nobel Prize for Chemistry and Geology, awarded to Jan Zalasiewicz for explaining why scientists lick rocks. The ceremonies for the awards were held at Boston University and MIT, respectively.\n",
    "chinese_title": "2025年搞笑诺贝尔奖得主",
    "chinese_summary": "本文公布了2025年和2024年搞笑诺贝尔奖的获奖者，该奖项旨在表彰“先让人发笑，后引人深思”的成就。2025年的奖项涵盖了范围广泛的、不寻常但发人深省的研究。亮点包括：一个关于指甲生长35年研究的文学奖，一个考察智力反馈对自恋影响的心理学奖，以及一个关于蜥蜴吃披萨研究的营养学奖。其他奖项表彰了关于大蒜对母乳的影响、斑马纹奶牛驱赶苍蝇、特氟龙作为无热量食物膨胀剂的潜力、酒精对外语能力的影响、鞋架设计与鞋子气味的关系、酒精对蝙蝠飞行的影响以及意大利面酱凝结物理学的研究。\n\n2024年的搞笑诺贝尔奖包括：B.F. 斯金纳的鸽子制导导弹研究获得的和平奖，植物模仿塑料植物获得的植物学奖，调查不同半球头发旋方向的解剖学奖，以及强调安慰剂在带来痛苦副作用时有效性的医学奖。其他奖项授予了关于死鳟鱼游泳、哺乳动物通过肛门呼吸、硬币翻转落回起始面的概率、用于分离醉酒和清醒蠕虫的色谱法、超级人瑞数据中的人口统计异常以及在奶牛附近引爆纸袋以研究牛奶喷射的研究。\n\n文章还提到了2023年搞笑诺贝尔化学和地质学奖，该奖项颁给了 Jan Zalasiewicz，以表彰他解释了科学家为什么舔舐岩石。颁奖典礼分别在波士顿大学和麻省理工学院举行。"
  },
  {
    "id": "45313439",
    "title": "What Makes System Calls Expensive: A Linux Internals Deep Dive",
    "url": "https://blog.codingconfessions.com/p/what-makes-system-calls-expensive",
    "summary": "This article delves into the performance cost of system calls in Linux on x86-64 architecture. System calls, essential for user programs to interact with the operating system, often appear as performance bottlenecks in profiling. While the execution of kernel code within a system call contributes to the overhead, the major cost comes from the disruption of CPU optimizations during the transition between user and kernel space.\n\nThe article meticulously examines the Linux kernel's syscall handler, highlighting steps like swapping the GS register, switching page tables and stacks, saving user-space registers, and implementing mitigations against speculative execution attacks (Spectre, Retbleed) which all contribute to the overhead.\n\nThe overhead is categorized into direct and indirect costs. Direct overhead, which is largely fixed across system calls, involves the execution of the kernel's entry and exit routines.  A benchmark comparing `clock_gettime` execution via vDSO (user-space shortcut) and the direct syscall interface reveals the syscall interface is much slower due to this direct overhead.\n\nIndirect overhead stems from the disturbance of the CPU's microarchitectural state, specifically the instruction pipeline and branch prediction mechanisms. Draining the instruction pipeline and clearing branch prediction buffers during system call entry disrupt CPU optimizations, leading to transient performance degradation in user-space code upon return. The article argues that the mitigations for speculative execution attacks have a great performance cost and directly contribute to the indirect overhead. Minimizing system calls is therefore crucial for performance optimization.\n",
    "chinese_title": "系统调用为何昂贵：Linux内核深度剖析",
    "chinese_summary": "本文深入探讨了 Linux 系统在 x86-64 架构上系统调用的性能开销。系统调用是用户程序与操作系统交互的关键，在性能剖析中经常表现为性能瓶颈。虽然系统调用中内核代码的执行会增加开销，但主要成本来自于用户空间和内核空间之间切换时对 CPU 优化的中断。\n\n本文细致地检查了 Linux 内核的系统调用处理程序，重点介绍了诸如交换 GS 寄存器、切换页表和堆栈、保存用户空间寄存器以及实施针对推测执行攻击（Spectre、Retbleed）的缓解措施等步骤，这些都会增加开销。\n\n开销分为直接成本和间接成本。直接开销主要在系统调用之间是固定的，包括内核入口和退出例程的执行。通过 vDSO（用户空间快捷方式）和直接系统调用接口比较 `clock_gettime` 的执行情况，表明由于这种直接开销，系统调用接口要慢得多。\n\n间接开销源于 CPU 微架构状态的扰乱，特别是指令流水线和分支预测机制。在系统调用进入期间，清空指令流水线和清除分支预测缓冲区会中断 CPU 优化，导致返回时用户空间代码的瞬时性能下降。文章认为，针对推测执行攻击的缓解措施具有很大的性能成本，并直接导致间接开销。因此，最小化系统调用对于性能优化至关重要。"
  },
  {
    "id": "45306120",
    "title": "Show HN: WeUseElixir - Elixir project directory",
    "url": "https://weuseelixir.com/",
    "summary": "WeUseElixir is presented as a directory showcasing applications, libraries, and companies that utilize the Elixir programming language. The directory aims to provide examples of real-world Elixir solutions. Several prominent examples of companies and projects using Elixir are listed, each with a tagline to describe their purpose:\n\n*   Copia Wealth Studios: Assets Under Intelligence®\n*   Pipie.io: Gitlab Notifications in Slack. Make your engineers more effective\n*   Give With Click: Flat fee fundraising for schools and athletic teams.\n*   Jump Comedy: All Things Comedy\n*   Mux: Video APIs for developers.\n*   ReadOnce: Secure one-time links\n*   Flop: Filtering, ordering and pagination with Ecto\n*   Oban: Robust job processing for Elixir\n*   Absinthe: The GraphQL toolkit for Elixir\n*   SparkMeter: For reliable, clean and efficient electricity\n*   X-Plane 12: Flight Simulator | X-Plane 12: Flight Simulation Done Right\n*   WeUseElixir: Find apps, libraries and companies that use Elixir\n*   VEEPS: Watch Livestream Concerts, Music, and Events\n*   Remote: Global HR Solutions & Employment Tools for Distributed Teams\n*   Pepsico: Create more smiles with every sip and every bite\n*   Community: Personalized Text Messaging Platform & SMS Solution\n\nThe presentation also mentions that users can add their own Elixir-based applications to the directory for free and browse all listings currently available. It seems that the site experienced connection issues when generating the content for this \"Show HN.\"\n",
    "chinese_title": "Show HN: WeUseElixir - Elixir 项目目录",
    "chinese_summary": "WeUseElixir 是一个目录，展示了使用 Elixir 编程语言的应用程序、库和公司。 该目录旨在提供 Elixir 实际解决方案的示例。 其中列出了几个使用 Elixir 的知名公司和项目，每个都附带描述其目的的标语：\n\n*   Copia Wealth Studios: Assets Under Intelligence®\n*   Pipie.io: Gitlab 在 Slack 中的通知。 让你的工程师更有效率\n*   Give With Click: 为学校和运动队提供固定费用的筹款。\n*   Jump Comedy: All Things Comedy\n*   Mux: 为开发者提供的视频 API。\n*   ReadOnce: 安全的一次性链接\n*   Flop: 使用 Ecto 进行过滤、排序和分页\n*   Oban: 用于 Elixir 的强大的作业处理\n*   Absinthe: 用于 Elixir 的 GraphQL 工具包\n*   SparkMeter: 为了可靠、清洁和高效的电力\n*   X-Plane 12: 飞行模拟器 | X-Plane 12：正确的飞行模拟\n*   WeUseElixir: 查找使用 Elixir 的应用程序、库和公司\n*   VEEPS: 观看直播音乐会、音乐和活动\n*   Remote: 为分布式团队提供的全球人力资源解决方案和就业工具\n*   Pepsico: 用每一口和每一咬创造更多的微笑\n*   Community: 个性化短信平台和 SMS 解决方案\n\n介绍还提到，用户可以免费将自己的 Elixir 应用程序添加到目录中，并浏览当前所有可用的列表。 似乎该网站在为此“Show HN”生成内容时遇到了连接问题。"
  },
  {
    "id": "45314906",
    "title": "Microsoft memo advises H1B employees to return immediately if currently abroad",
    "url": "https://xcancel.com/onestpress/status/1969374699038675364",
    "summary": "A Microsoft internal memo is advising H1B employees currently abroad, along with their families, to return immediately due to a new \"fee\" taking effect at midnight on September 20, 2025, causing travel disruption. The fee is widely believed to be associated with the Trump administration's policies, possibly designed by Stephen Miller, targeting the tech industry.\n\nThe reactions to the news are varied and largely negative. Many commentators express concern about the potential chaos and financial burden the new fee will place on H1B visa holders and the companies that employ them, such as Microsoft, Amazon, and Tesla. Some believe it will incentivize companies to move operations and jobs outside the US, while others suggest it's a tactic to exert leverage on foreign countries. Some hope companies will challenge the fee in court.\n\nSeveral users speculate about the impact on the US economy and its competitiveness. Concerns are raised about the fairness and legality of the fee, with some suggesting it's a form of extortion. There's also worry about potential retaliatory measures from other countries in the form of increased visa fees. Supporters of the fee cheer the news, viewing it as a way to prioritize American workers. Overall, the announcement has sparked considerable anxiety and debate about the future of H1B visas and the implications for both individuals and the US economy.\n",
    "chinese_title": "微软备忘录建议目前身在国外的H1B员工立即返回。",
    "chinese_summary": "微软内部备忘录建议目前在国外的H1B员工及其家属立即回国，原因是新的“费用”将于2025年9月20日午夜生效，导致旅行中断。该费用被广泛认为与特朗普政府的政策有关，可能由斯蒂芬·米勒设计，针对科技行业。\n\n对此消息的反应各不相同，且多为负面。许多评论员对新费用可能给H1B签证持有者及其雇佣公司（如微软、亚马逊和特斯拉）带来的潜在混乱和经济负担表示担忧。一些人认为这将激励公司将运营和工作岗位转移到美国境外，而另一些人则认为这是一种对外国施加影响的策略。一些人希望公司会在法庭上挑战这项费用。\n\n一些用户推测了该费用对美国经济及其竞争力的影响。人们对该费用的公平性和合法性提出了质疑，一些人认为这是一种敲诈勒索。人们还担心其他国家可能会采取增加签证费用的报复措施。该费用的支持者则为此消息欢呼，认为这是优先考虑美国工人的一种方式。总的来说，该公告引发了人们对H1B签证未来的相当大的焦虑和辩论，以及对个人和美国经济的影响。"
  },
  {
    "id": "45306701",
    "title": "Feedmaker: URL + CSS selectors = RSS feed",
    "url": "https://feedmaker.fly.dev",
    "summary": "Feedmaker is a tool created by Kevin Schaul that allows users to generate RSS feeds from any website. It operates on a simple principle: users provide a URL and CSS selectors, and Feedmaker creates an RSS feed based on that information. This enables users to easily track updates and content from websites that don't natively offer RSS feeds, or to customize feeds according to specific criteria.\n\nThe tool provides users with options to either enter their own website URL and CSS selectors or choose from pre-defined examples. The examples highlight potential uses, such as tracking popular stories from major news outlets like the Washington Post, New York Times, and Wall Street Journal, or following specific content categories like jazz articles on Bandcamp, or monitoring updates from specific vendors.\n",
    "chinese_title": "Feedmaker: URL + CSS选择器 = RSS订阅源",
    "chinese_summary": "Feedmaker是由Kevin Schaul创建的工具，允许用户从任何网站生成RSS订阅。它的运作原理很简单：用户提供URL和CSS选择器，Feedmaker就会基于这些信息创建RSS订阅。这使得用户能够轻松追踪那些本身不提供RSS订阅的网站的更新和内容，或者根据特定标准自定义订阅。\n\n该工具为用户提供了两种选择：要么输入他们自己的网站URL和CSS选择器，要么从预定义的示例中选择。这些示例突出了潜在的用途，比如追踪华盛顿邮报、纽约时报和华尔街日报等主要新闻媒体的热门报道，或者关注Bandcamp上的爵士乐文章等特定内容类别，或者监控特定供应商的更新。"
  },
  {
    "id": "45255785",
    "title": "Internet Archive's big battle with music publishers ends in settlement",
    "url": "https://arstechnica.com/tech-policy/2025/09/internet-archives-big-battle-with-music-publishers-ends-in-settlement/",
    "summary": "The Internet Archive (IA) has reached a confidential settlement with major music publishers (UMG, Capitol, Sony Music, etc.) in a lawsuit concerning the Great 78 Project, an initiative to digitize and preserve early music recordings. The publishers initially sought $400 million in damages, later escalating to $700 million, alleging lost streaming revenue due to the availability of Great 78 recordings. IA argued the project had minimal impact on revenue and that the damages were inflated.\n\nThe settlement details remain undisclosed, but it follows a similar legal battle lost by IA against book publishers last year, also resulting in an undisclosed payment. IA had argued the late surge of added infringing works by the labels was a tactic to force a settlement.\n\nThe lawsuit against IA's Great 78 project was seen by some, like sound historian David Seubert, as a potentially vindictive move by labels who may not like IA's approach to copyright and fair use, rather than stemming from actual financial harm. The settlement concludes a potentially ruinous legal battle for IA, though the actual cost remains unknown due to the confidentiality agreement.\n",
    "chinese_title": "互联网档案馆与音乐出版商的重大诉讼以和解告终",
    "chinese_summary": "互联网档案馆(IA)与主要音乐出版商（环球音乐、Capitol、索尼音乐等）就Great 78项目（一项旨在数字化并保存早期音乐录音的倡议）诉讼达成保密和解。 出版商最初寻求4亿美元的赔偿，后来增加到7亿美元，声称由于Great 78录音的可用性导致流媒体收入损失。 IA辩称该项目对收入的影响极小，并且损害赔偿被夸大。\n\n和解协议的细节仍然未公开，但这与IA去年输给图书出版商的类似法律诉讼之后的情况类似，也导致了一笔未公开的付款。 IA辩称，唱片公司后来大量增加侵权作品是一种迫使和解的策略。\n\n针对IA的Great 78项目的诉讼被一些人，如声音历史学家David Seubert，视为唱片公司可能不喜欢IA对版权和合理使用的态度，而非源于实际的经济损失，因此可能是一种报复行为。 此次和解结束了IA一场可能导致毁灭性后果的法律诉讼，尽管由于保密协议，实际成本仍然未知。"
  },
  {
    "id": "45307095",
    "title": "Hidden risk in Notion 3.0 AI agents: Web search tool abuse for data exfiltration",
    "url": "https://www.codeintegrity.ai/blog/notion",
    "summary": "This article highlights a critical security vulnerability in Notion 3.0's AI Agents, specifically concerning the potential for data exfiltration through the misuse of the web search tool. The core problem stems from the combination of powerful LLM agents, access to integrated tools (MCPs), and persistent memory, dubbed the \"lethal trifecta.\"\n\nThe article demonstrates how an attacker can exploit the `functions.search` tool by embedding a malicious prompt within a seemingly harmless document, like a PDF. This prompt instructs the Notion AI agent to search for sensitive data within the user's Notion workspace and then exfiltrate that data by appending it to a URL, effectively sending it to a malicious server controlled by the attacker via a web search query.\n\nThe demonstration involves a PDF document containing hidden instructions for the AI agent to extract client information (name, company, ARR) and send it to a fake backend service (db-client-codeintegrity.com) via a `functions.search` tool call. The attacker uses manipulative tactics within the prompt, such as claiming the task is urgent and authorized, to ensure the agent follows through.\n\nThe vulnerability exists because Notion's AI Agents can chain tasks across multiple documents, databases, and external connectors in ways that traditional role-based access control (RBAC) doesn't anticipate.  The article emphasizes that this attack worked even with Claude Sonnet 4.0, a state-of-the-art model, indicating the severity of the issue. The article concludes by stating that MCP integrations into Notion AI agents like Github, Gmail, Jira vastly increases the threat landscape due to prompt injection attacks.\n",
    "chinese_title": "Notion 3.0 AI 代理的隱藏風險：濫用網絡搜索工具進行數據洩露",
    "chinese_summary": "本文重点指出Notion 3.0 AI Agents中的一个关键安全漏洞，具体涉及通过滥用网络搜索工具进行数据泄露的潜在风险。核心问题源于强大的LLM代理、对集成工具(MCPs)的访问以及持久性记忆的结合，被称为“致命三连击”。\n\n本文演示了攻击者如何利用`functions.search`工具，在看似无害的文档（如PDF）中嵌入恶意提示。该提示指示Notion AI代理搜索用户Notion工作区内的敏感数据，然后通过将其附加到URL来泄露这些数据，从而有效地通过网络搜索查询将其发送到攻击者控制的恶意服务器。\n\n该演示涉及一个PDF文档，其中包含AI代理提取客户信息（姓名、公司、ARR）并通过`functions.search`工具调用将其发送到虚假后端服务（db-client-codeintegrity.com）的隐藏指令。攻击者在提示中使用操纵策略，例如声称任务紧急且已授权，以确保代理完成任务。\n\n该漏洞的存在是因为Notion的AI Agents可以跨多个文档、数据库和外部连接器以传统基于角色的访问控制(RBAC)无法预测的方式链接任务。文章强调，即使使用最先进的模型Claude Sonnet 4.0，这种攻击也有效，表明了问题的严重性。文章最后指出，像Github、Gmail、Jira等MCP集成到Notion AI Agents中，由于提示注入攻击，极大地增加了威胁态势。"
  },
  {
    "id": "45310294",
    "title": "High-performance read-through cache for object storage",
    "url": "https://github.com/s2-streamstore/cachey",
    "summary": "Cachey is a high-performance, read-through cache designed for object storage like S3, offering a simple HTTP API. It utilizes a hybrid memory and disk cache powered by foyer to efficiently cache immutable blobs. Key features include:\n\n*   **Precise Range Fetching:** Uses a `/fetch` API requiring exact byte ranges for retrieval.\n*   **Page-Aligned Caching:** Maps requests to fixed 16 MiB page-aligned ranges.\n*   **Request Coalescing:** Handles concurrent requests for the same page efficiently.\n*   **Hedged Requests:** Mitigates object storage tail latency through hedged requests and potentially redundant buckets for objects.\n*   **Configurable Buckets:** Allows specifying bucket preferences and overrides for S3 request configurations.\n\nThe API uses `GET` or `HEAD` requests to `/fetch/{kind}/{object}` with a `Range` header. Clients can specify preferred buckets using `C0-Bucket` and override S3 configurations with `C0-Config`. Responses include `Content-Range`, `Content-Length`, `Last-Modified`, and `C0-Status` headers. The service provides monitoring endpoints `/stats` (JSON throughput stats) and `/metrics` (Prometheus format). Configuration options include memory and disk capacity, hedge quantile, TLS settings, and port via command-line arguments. Docker images are also available for deployment.\n",
    "chinese_title": "对象存储的高性能穿透式读取缓存",
    "chinese_summary": "Cachey 是一款高性能的直读缓存，专为 S3 等对象存储设计，提供简洁的 HTTP API。 它利用 foyer 驱动的混合内存和磁盘缓存，高效地缓存不可变的数据块。主要特性包括：\n\n*   **精确范围获取：** 使用 `/fetch` API，需要精确的字节范围才能检索。\n*   **页面对齐缓存：** 将请求映射到固定的 16 MiB 页面对齐范围。\n*   **请求合并：** 有效处理对同一页面的并发请求。\n*   **对冲请求：** 通过对冲请求和潜在的对象冗余存储桶，缓解对象存储的尾延迟。\n*   **可配置的存储桶：** 允许指定存储桶偏好设置并覆盖 S3 请求配置。\n\nAPI 使用带有 `Range` 标头的 `GET` 或 `HEAD` 请求到 `/fetch/{kind}/{object}`。客户端可以使用 `C0-Bucket` 指定首选存储桶，并使用 `C0-Config` 覆盖 S3 配置。响应包括 `Content-Range`、`Content-Length`、`Last-Modified` 和 `C0-Status` 标头。该服务提供监控端点 `/stats`（JSON 吞吐量统计）和 `/metrics`（Prometheus 格式）。配置选项包括内存和磁盘容量、对冲分位数、TLS 设置和端口，通过命令行参数指定。Docker 镜像也可用于部署。"
  },
  {
    "id": "45310123",
    "title": "Supporting Our AI Overlords: Redesigning Data Systems to Be Agent-First",
    "url": "https://arxiv.org/abs/2509.00997",
    "summary": "This arXiv article, \"Supporting Our AI Overlords: Redesigning Data Systems to be Agent-First,\" submitted on August 31, 2025, argues that current data systems are ill-equipped to handle the emerging dominance of Large Language Model (LLM) agents. These agents, operating on behalf of users to analyze and manipulate data, engage in a process called \"agentic speculation,\" characterized by high throughput exploration and solution formulation. The volume and inefficiencies of this speculation present significant challenges.\n\nThe authors, led by Shu Liu and Aditya G. Parameswaran, propose a shift towards agent-first data systems. They identify key characteristics of agentic speculation - scale, heterogeneity, redundancy, and steerability - and use these to outline new research opportunities for this new architecture. These opportunities span various areas, including novel query interfaces optimized for agent interactions, innovative query processing techniques to handle the specific demands of agentic workloads, and new \"agentic memory stores\" designed for efficient data access and storage in agent-driven scenarios. The article advocates for adapting data systems to better natively support the needs of LLM agents working with data.\n",
    "chinese_title": "支持我们的AI霸主：重新设计数据系统，以智能体为先",
    "chinese_summary": "这篇于2025年8月31日提交的 arXiv 文章《支持我们的 AI 霸主：重新设计以代理为中心的数据系统》指出，当前的数据系统无法很好地应对大型语言模型 (LLM) 代理日益占据主导地位的局面。 这些代理代表用户分析和操纵数据，参与一种名为“代理推测”的过程，其特点是高吞吐量的探索和解决方案制定。 这种推测的规模和低效率带来了重大挑战。\n\n由 Shu Liu 和 Aditya G. Parameswaran 领导的作者提出转向以代理为中心的数据系统。 他们确定了代理推测的关键特征——规模、异构性、冗余性和可操纵性——并利用这些特征概述了这种新架构的新研究机会。 这些机会涵盖了各个领域，包括针对代理交互优化的新型查询界面、处理代理工作负载特定需求的创新查询处理技术，以及专为代理驱动场景中的高效数据访问和存储而设计的新型“代理记忆存储”。 该文章倡导调整数据系统，以便更好地原生支持 LLM 代理处理数据的需求。"
  },
  {
    "id": "45271493",
    "title": "Compiling with Continuations",
    "url": "https://swatson555.github.io/posts/2025-09-16-compiling-with-continuations.html",
    "summary": "This article reviews \"Compiling with Continuations,\" a book on Standard ML and compiler design, focusing on the practical application of continuations. The reviewer finds the book dense and lacking in exercises, making it feel more like an information dump than a structured learning resource. While the book claims comprehensive coverage, the author finds its 1992 assertions of industry relevance outdated.\n\nThe review details the reviewer's own implementation of a compiler based on the book's principles, covering stages like lexing, parsing (MiniML), evaluation (CPS), and compilation into the CPS language. The author discusses challenges with closure conversion and register spilling.\n\nKey strengths highlighted include the book's emphasis on fundamental concepts of computation and its demonstration of continuations' utility beyond simple interpreters. However, the reviewer criticizes the book's shortcomings, such as the absence of register assignment details and linking requirements for the virtual machine.\n\nUltimately, the reviewer acknowledges that CPS never became a widely adopted intermediate representation. Despite learning more about Standard ML than most will, the reviewer concludes that the time spent with the book wasn't particularly valuable, suggesting that while insightful, many of the optimizations presented don't necessarily require continuations.\n",
    "chinese_title": "使用延续编译",
    "chinese_summary": "本文回顾了关于 Standard ML 和编译器设计的书籍《使用延续进行编译》，重点关注延续的实际应用。评论者认为这本书内容密集且缺乏练习，感觉更像是一个信息倾倒，而不是结构化的学习资源。尽管该书声称内容全面，但作者认为其 1992 年关于行业相关性的断言已经过时。\n\n评论详细介绍了评论者自己基于该书原理实现的编译器，涵盖了词法分析、语法分析 (MiniML)、求值 (CPS) 和编译到 CPS 语言等阶段。作者讨论了闭包转换和寄存器溢出的挑战。\n\n突出的关键优势包括本书对计算基本概念的强调以及对延续实用性的证明，超越了简单的解释器。然而，评论者批评了这本书的缺点，例如缺少寄存器分配细节和虚拟机链接要求。\n\n最终，评论者承认 CPS 从未成为广泛采用的中间表示形式。尽管学到的 Standard ML 知识比大多数人都要多，但评论者得出结论，花在这本书上的时间并没有特别有价值，并表明虽然有见地，但提出的许多优化并不一定需要延续。"
  },
  {
    "id": "45302721",
    "title": "Kernel: Introduce Multikernel Architecture Support",
    "url": "https://lwn.net/ml/all/20250918222607.186488-1-xiyou.wangcong@gmail.com/",
    "summary": "This patch series introduces foundational support for a multikernel architecture within the Linux kernel, enabling multiple independent kernel instances to run concurrently on a single physical machine.  The goal is to provide improved fault isolation, enhanced security, and better resource utilization compared to traditional virtualization.\n\nThe implementation relies on enhancements to the `kexec` subsystem for loading and managing multiple kernel images, assigning each instance to specific CPU cores. A new Inter-Processor Interrupt (IPI) framework facilitates communication between these kernels.  Key components include:\n\n*   Dynamic `kimage` tracking within `kexec`.\n*   A generic IPI communication framework.\n*   x86-specific CPU bootstrap mechanisms.\n*   A `/proc/multikernel` interface for monitoring kernel instances.\n\nThe seven patches cover:\n\n1.  Basic multikernel support via `kexec`.\n2.  x86 SMP INIT trampoline for CPU bootstrapping.\n3.  `MULTIKERNEL_VECTOR` for x86 inter-kernel communication.\n4.  The generic IPI communication framework.\n5.  `arch_cpu_physical_id()` for physical CPU identification.\n6.  Dynamic `kimage` tracking implementation.\n7.  The `/proc/multikernel` interface.\n\nThis is an RFC, so the implementation is considered preliminary, with details requiring improvement. Testing has been limited.  The author solicits community feedback, testing, and contributions to build upon this foundation. Potential use cases include running real-time kernels alongside general-purpose ones, isolating security-critical applications, and providing dedicated kernel instances for specific workloads.\n",
    "chinese_title": "内核：引入多内核架构支持",
    "chinese_summary": "该补丁系列引入了 Linux 内核中对多内核架构的基础支持，使多个独立的内核实例能够在单个物理机上并发运行。其目标是与传统虚拟化相比，提供更高的故障隔离性、增强的安全性和更好的资源利用率。\n\n该实现依赖于对 `kexec` 子系统的增强，以加载和管理多个内核镜像，并将每个实例分配给特定的 CPU 核心。一个新的处理器间中断 (IPI) 框架促进了这些内核之间的通信。 主要组件包括：\n\n*   `kexec` 中动态的 `kimage` 跟踪。\n*   一个通用的 IPI 通信框架。\n*   x86 特定的 CPU 引导机制。\n*   用于监控内核实例的 `/proc/multikernel` 接口。\n\n这七个补丁涵盖：\n\n1.  通过 `kexec` 实现基本的多内核支持。\n2.  用于 CPU 引导的 x86 SMP INIT trampoline。\n3.  用于 x86 内核间通信的 `MULTIKERNEL_VECTOR`。\n4.  通用的 IPI 通信框架。\n5.  用于物理 CPU 识别的 `arch_cpu_physical_id()`。\n6.  动态 `kimage` 跟踪的实现。\n7.  `/proc/multikernel` 接口。\n\n这是一个征求意见稿 (RFC)，因此该实现被认为是初步的，细节需要改进。测试有限。作者征求社区反馈、测试和贡献，以在此基础上构建。潜在的用例包括并行运行实时内核和通用内核、隔离安全关键型应用程序以及为特定工作负载提供专用内核实例。"
  },
  {
    "id": "45314157",
    "title": "These days, systemd can be a cause of restrictions on daemons",
    "url": "https://utcc.utoronto.ca/~cks/space/blog/linux/SystemdCanBeRestrictionCause",
    "summary": "Chris Siebenmann of Wandering Thoughts is blocking access to his blog for users with outdated browsers due to a surge in high-volume crawlers using old Chrome user agents. These crawlers, potentially gathering data for LLM training, are placing a significant load on his server. His anti-crawler precautions flag older browser versions as suspicious.\n\nIf a legitimate user is experiencing this block with a current browser, they're encouraged to contact him at his university email address with details, including their User-Agent string.\n\nThe article specifically addresses users of archive.* services (archive.today, archive.ph, archive.is), explaining that these services are also being blocked. Their crawling behavior is indistinguishable from malicious actors due to the use of old Chrome User-Agent values, distributed IP addresses, and falsified reverse DNS entries. Siebenmann recommends using archive.org instead, as it's a better-behaved archival crawler.\n",
    "chinese_title": "这些天，systemd可能会成为守护进程限制的原因。",
    "chinese_summary": "由于大量使用旧版 Chrome 用户代理的高流量爬虫激增，Wandering Thoughts 的 Chris Siebenmann 正在阻止使用过时浏览器的用户访问他的博客。这些爬虫可能正在收集数据用于 LLM 训练，给他的服务器带来了巨大的负担。他的反爬虫措施会将旧版本的浏览器标记为可疑。\n\n如果合法用户使用最新浏览器时遇到此问题，请使用大学电子邮件地址联系他，并提供详细信息，包括他们的 User-Agent 字符串。\n\n这篇文章专门针对 archive.* 服务（archive.today、archive.ph、archive.is）的用户，解释说这些服务也被阻止了。 由于使用旧版 Chrome User-Agent 值、分散的 IP 地址和伪造的反向 DNS 条目，他们的爬取行为与恶意行为者无法区分。 Siebenmann 建议改用 archive.org，因为它是一个行为更好的存档爬虫。"
  },
  {
    "id": "45304379",
    "title": "Your very own humane interface: Try Jef Raskin's ideas at home",
    "url": "https://arstechnica.com/gadgets/2025/09/your-very-own-humane-interface-try-jef-raskins-ideas-at-home/",
    "summary": "This article explores how to experience Jef Raskin's \"humane interface\" concepts at home through emulation. It focuses on three projects: the Canon Cat, the SwyftCard for the Apple IIe, and the Humane Environment software.\n\nThe Canon Cat, emulated using MAME, offers a keyboard-driven, document-centric workflow. The article provides instructions on navigating the emulator and its quirks, like disabling the beeper to prevent freezing. It highlights the use of LEAP keys for navigation and USE FRONT for special functions.\n\nThe SwyftCard, also keyboard-driven, is emulated using software developed by Eric Rangell for KansasFest 2021. The article details the setup process in Apple IIe emulators (Mariani, Virtual ][, AppleWin) and explains the functionality of the LEAP and USE FRONT keys, cursor behavior, and basic programming capabilities using Applesoft BASIC. It also covers saving and loading workspaces to disk and serial communication.\n\nThe Humane Environment, Raskin's software implementation, is presented using the early Mac OS builds. The article describes how to obtain and run these builds in Mac OS X Classic or native Mac OS 9, using a CVS client to handle resource forks. It references the last available build in SourceForge, dated September 25, 2003.\n",
    "chinese_title": "你自己的友善人机界面：在家尝试杰夫·拉斯金的理念",
    "chinese_summary": "本文探讨了如何通过模拟在家中体验杰夫·拉斯金的“人性化界面”概念。文章重点介绍了三个项目：佳能猫（Canon Cat）、Apple IIe 的 SwyftCard 和 Humane Environment 软件。\n\n佳能猫使用 MAME 模拟，提供了一种键盘驱动、以文档为中心的工作流程。本文提供了有关导航模拟器及其怪癖的说明，例如禁用蜂鸣器以防止冻结。它强调了使用 LEAP 键进行导航和 USE FRONT 键进行特殊功能操作。\n\nSwyftCard 同样是键盘驱动的，使用 Eric Rangell 为 KansasFest 2021 开发的软件进行模拟。本文详细介绍了在 Apple IIe 模拟器（Mariani、Virtual ][、AppleWin）中的设置过程，并解释了 LEAP 和 USE FRONT 键的功能、光标行为以及使用 Applesoft BASIC 的基本编程能力。它还介绍了将工作区保存和加载到磁盘以及串行通信。\n\nHumane Environment 是拉斯金的软件实现，本文使用早期的 Mac OS 构建版本进行介绍。本文描述了如何在 Mac OS X Classic 或原生 Mac OS 9 中获取和运行这些构建版本，并使用 CVS 客户端来处理资源分支。文章引用了 SourceForge 上最后可用的构建版本，日期为 2003 年 9 月 25 日。"
  },
  {
    "id": "45312513",
    "title": "Czech founding father Masaryk's message revealed in long-sealed envelope",
    "url": "https://www.nbcnews.com/world/europe/masaryk-message-revealed-envelope-czech-founding-father-rcna232353",
    "summary": "A message from Tomáš Garrigue Masaryk, the founding father and first president of Czechoslovakia, sealed in an envelope in 1927, was revealed in a live broadcast in the Czech Republic. The message, held by the National Archives since 2005, had been the subject of intense speculation, with some fearing it might contain a fateful warning about European conflict.\n\nThe letter, dictated to his son Jan, was not a final message before Masaryk's 1937 death, but rather a reflection on his then-grave illness following a stroke. In it, Masaryk acknowledged his impending death, expressed his lack of fear, and urged his successors to continue his work carefully. He also reflected on the complex political situation in Czechoslovakia, an ethnically diverse nation, urging fair treatment of the German minority.\n\nExperts believe the message is significant due to the time it was written - a turbulent period in Europe marked by Hitler's rise to power in Germany. Masaryk, deeply revered in the Czech Republic, served as president from 1918 to 1935, leading the nation's independence after World War I. His son, Jan, later served as foreign minister. The unveiling of the letter shed light on Masaryk's thoughts during a crucial period in Czech and European history.\n",
    "chinese_title": "马萨里克封存信件揭秘其建国理念",
    "chinese_summary": "1927年托马斯·加里格·马萨里克（捷克斯洛伐克国父及首任总统）的密封信件在捷克共和国直播公开。这封自2005年起由国家档案馆保存的信件，此前备受猜测，有人担心其中可能包含关于欧洲冲突的命运警告。\n\n这封信由马萨里克口述给他的儿子扬，并非马萨里克1937年去世前的最后遗言，而是他中风后对其时严重疾病的反思。在信中，马萨里克承认自己即将离世，表达了他毫不畏惧，并敦促他的继任者们谨慎地继续他的工作。他还反思了捷克斯洛伐克复杂的政治局势，这是一个种族多元化的国家，他敦促公平对待德国少数民族。\n\n专家认为这封信意义重大，因为它写于一个动荡的时期——欧洲正经历着希特勒在德国崛起。马萨里克在捷克共和国备受尊敬，他于1918年至1935年担任总统，领导国家在一战后获得独立。他的儿子扬后来担任外交部长。这封信的公开揭示了马萨里克在捷克和欧洲历史关键时期的思想。"
  },
  {
    "id": "45305180",
    "title": "Three-Minute Take-Home Test May Identify Symptoms Linked to Alzheimer's Disease",
    "url": "https://www.smithsonianmag.com/smart-news/three-minute-take-home-test-may-identify-symptoms-linked-to-alzheimers-disease-years-before-a-traditional-diagnosis-180987281/",
    "summary": "This article discusses a new take-home test, called Fastball EEG, that may identify symptoms linked to Alzheimer's disease earlier than traditional clinical diagnoses. Developed by researchers at the University of Bath, the three-minute test monitors brain activity while a person passively views images on a tablet. The test requires no active participation from the patient, making it potentially more accessible and objective.\n\nThe study, published in Brain Communications, showed that Fastball is sensitive to both pre-diagnosed Alzheimer's and individuals at high risk of developing it. Patients with amnestic MCI, a condition often preceding Alzheimer's, showed lower responses to the test. While the test cannot predict who will definitively develop Alzheimer's, it can identify those at higher risk, allowing for earlier intervention and planning.\n\nThe development of Fastball is particularly relevant given the emergence of new Alzheimer's drugs like donanemab and lecanemab, which are most effective in the early stages of the disease. Early detection enables patients to begin treatment and lifestyle interventions sooner.\n\nWhile the study shows promise, researchers emphasize that more research is needed in larger, diverse groups to determine the test's predictive capabilities and how it interacts with other diagnostic tools. Experts also highlight the importance of considering other health complications that could contribute to memory issues. Despite these caveats, Fastball EEG represents a potential step forward in the early diagnosis and management of Alzheimer's disease.\n",
    "chinese_title": "三分钟居家测试或能识别与阿尔茨海默病相关的症状",
    "chinese_summary": "本文讨论了一种新的居家测试，名为快速眼动脑电图（Fastball EEG），它可能比传统的临床诊断更早地识别出与阿尔茨海默病相关的症状。这种由巴斯大学的研究人员开发的三分钟测试，在人们被动观看平板电脑上的图像时监测大脑活动。该测试不需要患者的主动参与，因此可能更容易获得且更客观。\n\n发表在《大脑通讯》上的这项研究表明，快速眼动脑电图对已确诊的阿尔茨海默病患者和患病高风险人群都非常敏感。患有遗忘性轻度认知障碍（通常是阿尔茨海默病的前兆）的患者对该测试的反应较低。虽然该测试不能预测谁一定会患上阿尔茨海默病，但它可以识别出那些风险较高的人，从而可以进行更早的干预和规划。\n\n鉴于多纳尼单抗 (donanemab) 和仑卡尼单抗 (lecanemab) 等新型阿尔茨海默病药物的出现，快速眼动脑电图的开发尤为重要，这些药物在疾病的早期阶段最为有效。早期检测使患者能够更早地开始治疗和生活方式干预。\n\n虽然该研究显示出前景，但研究人员强调，需要在更大、更多样化的群体中进行更多研究，以确定该测试的预测能力以及它如何与其他诊断工具相互作用。专家们还强调了考虑可能导致记忆问题的其他健康并发症的重要性。尽管存在这些注意事项，快速眼动脑电图仍代表了阿尔茨海默病早期诊断和管理方面的一个潜在进步。"
  },
  {
    "id": "45294390",
    "title": "Shipping 100 hardware units in under eight weeks",
    "url": "https://farhanhossain.substack.com/p/how-we-shipped-100-hardware-units",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "八周内交付100台硬件设备",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "45268575",
    "title": "Micro-LEDs boost random number generation",
    "url": "https://discovery.kaust.edu.sa/en/article/25936/micro-leds-boost-random-number-generation/",
    "summary": "Researchers have developed a novel quantum random number generator (QRNG) using miniature LEDs (micro-LEDs) that achieves gigabit-per-second speeds. Led by Heming Lin and Boon Ooi, the team from KAUST, KACST, and the University of California at Santa Barbara leverages the intensity fluctuations in the spontaneous emission from blue GaN micro-LEDs to generate true random numbers. This method offers a compact, cost-effective, and energy-efficient alternative to existing QRNG technologies, crucial for data security and complex system simulations.\n\nUnlike previous LED-based approaches that were limited to megabit-per-second speeds, this new system extracts six bits per sampling cycle, achieving a generation rate of 9.375 Gbit/s. The team rigorously tested the micro-LED QRNG, varying size and drive currents, and all configurations successfully passed the U.S. National Institute of Standards and Technology (NIST) tests, ensuring the output's randomness.\n\nFuture research will focus on increasing generation rates through the creation of 2D micro-LED arrays for parallel random number generation. The team also plans to integrate all components, including an on-chip photodetector, into a single QRNG chip, moving away from the current discrete component setup which involves a temperature-stabilized micro-LED, an avalanche photodetector, and a sampling oscilloscope.\n",
    "chinese_title": "微型LED提升随机数生成",
    "chinese_summary": "研究人员利用微型LED开发出一种新型量子随机数发生器，实现千兆位级速度。由林赫明和欧文邦领导的来自KAUST、KACST和加州大学圣巴巴拉分校的团队，利用蓝色GaN微型LED自发辐射中的强度波动来生成真正的随机数。这种方法为现有的量子随机数发生器技术提供了一种紧凑、经济高效且节能的替代方案，对数据安全和复杂系统模拟至关重要。\n\n与之前速度仅限于兆位级的基于LED的方法不同，这种新系统在每个采样周期提取六位，实现了9.375 Gbit/s的生成速率。该团队严格测试了微型LED量子随机数发生器，改变了尺寸和驱动电流，所有配置都成功通过了美国国家标准与技术研究院（NIST）的测试，确保了输出的随机性。\n\n未来的研究将侧重于通过创建用于并行随机数生成的二维微型LED阵列来提高生成速率。该团队还计划将包括片上光电探测器在内的所有组件集成到单个量子随机数发生器芯片中，从而摆脱目前的分立元件设置，该设置包括温度稳定的微型LED、雪崩光电探测器和采样示波器。"
  },
  {
    "id": "45270015",
    "title": "R MCP Server",
    "url": "https://github.com/finite-sample/rmcp",
    "summary": "RMCP (R Model Context Protocol) Server is a tool that enables AI assistants to perform statistical analysis through natural language. The latest version (0.3.7) includes 40 statistical tools across 9 categories, such as regression, time series analysis, data transformation, statistical testing, descriptive statistics, econometrics, machine learning, data visualization, and file operations. It supports natural language formula building and intelligent error recovery.\n\nKey features include comprehensive statistical analysis, visualization tools, and compatibility with Claude Desktop for interactive plots and statistical analysis within conversations. RMCP is production-ready, with full JSON-RPC 2.0 compliance and transport-agnostic support. Real-world usage examples demonstrate its application in business analysis, economic research, and data science.\n\nThe tool can be installed via pip, and requires R 4.0+ with specific packages.  It offers a command-line interface and direct tool usage for advanced developers. Usage scenarios covered include time series forecasting, panel data analysis, machine learning workflows, and statistical testing. It provides a complete tool reference with descriptions and key outputs. User scenarios have a 100% success rate.\n",
    "chinese_title": "R MCP 服务器",
    "chinese_summary": "RMCP（R模型上下文协议）服务器是一个使AI助手能够通过自然语言执行统计分析的工具。最新版本（0.3.7）包含9个类别共40个统计工具，例如回归分析、时间序列分析、数据转换、统计检验、描述性统计、计量经济学、机器学习、数据可视化和文件操作。它支持自然语言公式构建和智能错误恢复。\n\n主要功能包括全面的统计分析、可视化工具，以及与Claude Desktop的兼容性，以便在对话中进行交互式绘图和统计分析。RMCP已可用于生产环境，完全符合JSON-RPC 2.0标准并支持传输无关性。真实的使用案例展示了其在商业分析、经济研究和数据科学中的应用。\n\n该工具可以通过pip安装，需要安装R 4.0+以及特定的软件包。它为高级开发人员提供命令行界面和直接工具使用方式。涵盖的使用场景包括时间序列预测、面板数据分析、机器学习工作流程和统计检验。它提供完整的工具参考，包含描述和关键输出。用户场景的成功率达到100%。"
  },
  {
    "id": "45304706",
    "title": "An untidy history of AI across four books",
    "url": "https://hedgehogreview.com/issues/lessons-of-babel/articles/perplexity",
    "summary": "This article critiques the inflated hype surrounding AI, contrasting it with a more realistic, \"untidy\" historical view. It argues that current AI hype, fueled by industry and amplified by books like those by Harari, Kissinger, Schmidt, Mundie, and Kurzweil, serves to obscure the limitations and potential dangers of AI while enriching those controlling the technology.\n\nThe article traces the development of AI from its symbolic roots to the rise of machine learning and generative AI. It highlights the contingencies, failed consensus, and unpredictability inherent in technological progress, contrasting this messy reality with the simplistic narrative of exponential growth promoted by AI enthusiasts.\n\nThe authors of *AI Snake Oil*, Narayanan and Kapoor, are presented as offering a critical counterpoint, urging skepticism toward AI claims and emphasizing the distinction between generative and predictive AI. The article criticizes authors like Harari for technical misunderstandings and strategic elisions, and the authors of *Genesis* for promoting an eschatological view of AI, likening it to an \"arms race\" and fueling existential anxieties.\n\nUltimately, the article suggests that the focus on existential risks distracts from the real and present harms of AI, like opacity and bias, and allows tech companies to manipulate regulation and financial markets. It advocates for a more measured approach, utilizing existing societal tools to address the tangible challenges posed by AI without succumbing to speculative fears. The article concludes by dismissing Kurzweil's \"Singularity\" as a primitive form of extrapolation.\n",
    "chinese_title": "人工智能的四书凌乱史",
    "chinese_summary": "本文批判了对人工智能的过度炒作，并将其与更现实、更“混乱”的历史视角进行了对比。文章认为，当前由行业推动，并被哈拉利、基辛格、施密特、蒙迪和库兹韦尔等人的著作放大的AI炒作，掩盖了AI的局限性和潜在危险，同时致富了那些控制该技术的人。\n\n文章追溯了人工智能从其符号根源到机器学习和生成式人工智能的兴起。文章强调了技术进步中固有的偶然性、失败的共识和不可预测性，并将这种混乱的现实与人工智能爱好者宣扬的指数增长的简单叙事进行了对比。\n\n《AI Snake Oil》的作者纳拉亚南和卡普尔被认为是提供了一个批判性的对立观点，他们敦促人们对人工智能的主张持怀疑态度，并强调了生成式人工智能和预测性人工智能之间的区别。文章批评了像哈拉利这样的作者的技术误解和战略省略，以及《Genesis》的作者推崇的末世论的AI观点，将AI比作一场“军备竞赛”，并加剧了生存焦虑。\n\n最终，文章认为，对生存风险的关注分散了人们对人工智能真实和当下危害的注意力，例如不透明性和偏见，并允许科技公司操纵监管和金融市场。文章倡导采取一种更为审慎的方法，利用现有的社会工具来解决人工智能带来的实际挑战，而不屈服于推测性的恐惧。文章最后驳斥了库兹韦尔的“奇点”，认为这是一种原始形式的推断。"
  },
  {
    "id": "45283887",
    "title": "Slack has raised our charges by $195k per year",
    "url": "https://skyfall.dev/posts/slack",
    "summary": "In September 2025, Hack Club, a nonprofit providing coding education to teenagers, faced a significant price increase from Slack. After happily paying $5,000 annually for Slack's services, they were suddenly informed that they would need to pay an additional $50,000 within a week, and then $200,000 annually to avoid having their workspace deactivated and message history deleted.\n\nHack Club viewed this abrupt increase as extortion, arguing that Salesforce, Slack's parent company, was strong-arming a small nonprofit with insufficient notice. The short notice had a detrimental impact, forcing staff and volunteers to scramble to update systems, rebuild integrations, and migrate years of institutional knowledge.\n\nThe author highlighted the importance of data ownership and advised other small businesses to consider moving away from Slack. Hack Club chose to migrate to Mattermost due to the experience.\n\nFortunately, the original post went viral on Hacker News and Twitter, and the CEO of Slack contacted Hack Club and offered a solution. The original plan was averted. While details remain confidential, it proved to be a better outcome. The ordeal highlighted the importance of data ownership and avoiding reliance on external SaaS providers.\n",
    "chinese_title": "Slack 将我们的费用提高了每年 19.5 万美元。",
    "chinese_summary": "2025年9月，为青少年提供编程教育的非营利组织Hack Club面临来自Slack的大幅涨价。此前，他们一直愉快地每年支付5,000美元使用Slack服务，但突然被告知，他们需要在一周内额外支付50,000美元，然后每年支付200,000美元，才能避免工作区被停用和消息历史记录被删除。\n\nHack Club认为这种突然涨价是勒索，并指出Slack的母公司Salesforce是在不给予充分通知的情况下强迫一家小型非营利组织。 短时间的通知产生了不利影响，迫使工作人员和志愿者仓促更新系统，重建集成，并迁移多年的机构知识。\n\n作者强调了数据所有权的重要性，并建议其他小型企业考虑放弃Slack。 Hack Club由于这次经历选择迁移到Mattermost。\n\n幸运的是，最初的帖子在Hacker News和Twitter上迅速传播开来，Slack的首席执行官联系了Hack Club并提供了一个解决方案。 最初的计划得以避免。 虽然细节仍然保密，但这证明是一个更好的结果。 这次磨难凸显了数据所有权的重要性，以及避免依赖外部SaaS提供商的必要性。"
  },
  {
    "id": "45312323",
    "title": "Node 20 will be deprecated on GitHub Actions runners",
    "url": "https://github.blog/changelog/2025-09-19-deprecation-of-node-20-on-github-actions-runners/",
    "summary": "GitHub Actions is deprecating Node 20 support, with a full migration to Node 24 planned for the fall of 2025. Node 20 reaches end-of-life in April 2026.\n\nThe newest runner (v2.328.0) supports both Node 20 and Node 24, with Node 20 being the default. Users can test Node 24 early by setting `FORCE_JAVASCRIPT_ACTIONS_TO_NODE24=true` in their workflows or runner environments.\n\nStarting March 4th, 2026, runners will default to Node 24. Users can temporarily opt-out and continue using Node 20 by setting `ACTIONS_ALLOW_USE_UNSECURE_NODE_VERSION=true`, but this option will be removed later in the summer of 2026 when Node 20 is fully removed.\n\nImportant compatibility notes: Node 24 is incompatible with macOS 13.4 and lower, and lacks official ARM32 support, meaning self-hosted runners on ARM32 will no longer be supported.\n\nAction maintainers need to update their actions to run on Node 24. Action users need to update their workflows to use the latest versions of actions compatible with Node 24. Users are encouraged to join the discussion in the GitHub Community.\n",
    "chinese_title": "Node 20 将在 GitHub Actions 运行器上弃用",
    "chinese_summary": "GitHub Actions 将弃用 Node 20 支持，计划于 2025 年秋季全面迁移至 Node 24。Node 20 将于 2026 年 4 月达到生命周期终点。\n\n最新版本的 runner (v2.328.0) 同时支持 Node 20 和 Node 24，其中 Node 20 是默认版本。用户可以通过在其工作流程或 runner 环境中设置 `FORCE_JAVASCRIPT_ACTIONS_TO_NODE24=true` 来尽早测试 Node 24。\n\n从 2026 年 3 月 4 日开始，runners 将默认使用 Node 24。用户可以通过设置 `ACTIONS_ALLOW_USE_UNSECURE_NODE_VERSION=true` 暂时选择退出并继续使用 Node 20，但此选项将在 2026 年夏季 Node 20 完全移除后被删除。\n\n重要兼容性说明：Node 24 与 macOS 13.4 及更低版本不兼容，并且缺乏官方的 ARM32 支持，这意味着 ARM32 上的自托管 runner 将不再受支持。\n\nAction 维护者需要更新他们的 action 以在 Node 24 上运行。Action 用户需要更新他们的工作流程以使用与 Node 24 兼容的最新版本的 action。 建议用户加入 GitHub 社区中的讨论。"
  },
  {
    "id": "45298336",
    "title": "Nostr",
    "url": "https://nostr.com/",
    "summary": "Nostr is an open, decentralized protocol for creating a censorship-resistant communication network. It operates on a client-relay architecture where clients, acting as user agents, connect to multiple relays (servers) to publish and retrieve cryptographically signed \"notes.\" Relays act as distribution centers, storing and disseminating these notes without the ability to alter their content.\n\nThe protocol aims to provide a common communication language, allowing diverse applications and clients to interact. Unlike centralized platforms, Nostr empowers users by giving them control over their data and relay connections. Users can choose their outbox relays, switch relays as needed, and clients intelligently track these changes, ensuring continuous information flow.\n\nNostr embraces a chaotic, early internet-like approach, supporting various data types and user interactions. It promotes freedom of association, where users can create communities around relays, and allows individuals to run their own relays with custom rules.\n\nThe document also addresses common concerns like spam, scalability, harassment, and the advantages of Nostr over platforms like Mastodon and Bluesky. It highlights that Nostr's architecture naturally distributes the network load and offers better resilience against censorship and data centralization due to its cryptographic foundation and multi-master approach. Economic incentives are also aligned to ensure relay operation. It emphasizes that Nostr allows for distributed communities, enabling users to use relays tailored to their specific needs and preferences.\n",
    "chinese_title": "诺斯特",
    "chinese_summary": "Nostr 是一个开放、去中心化的协议，用于创建抗审查的通信网络。 它采用客户端-中继架构，客户端充当用户代理，连接到多个中继（服务器）以发布和检索经过密码学签名的“笔记”。 中继充当分发中心，存储和传播这些笔记，但无法更改其内容。\n\n该协议旨在提供一种通用的通信语言，允许不同的应用程序和客户端进行交互。 与中心化平台不同，Nostr 通过让用户控制他们的数据和中继连接来赋予他们权力。 用户可以选择他们的发件箱中继，根据需要切换中继，并且客户端会智能地跟踪这些更改，从而确保持续的信息流。\n\nNostr 拥抱一种混乱的、类似于早期互联网的方法，支持各种数据类型和用户交互。 它提倡结社自由，用户可以围绕中继创建社区，并允许个人运行自己的具有自定义规则的中继。\n\n该文档还讨论了常见的担忧，如垃圾邮件、可扩展性、骚扰，以及 Nostr 相对于 Mastodon 和 Bluesky 等平台的优势。 它强调 Nostr 的架构自然地分配了网络负载，并且由于其密码学基础和多主方法，提供了更好的针对审查和数据中心化的弹性。 经济激励也与确保中继运营相一致。 它强调 Nostr 允许分布式社区，使用户可以使用针对其特定需求和偏好的中继。"
  },
  {
    "id": "45265760",
    "title": "Show the Physics",
    "url": "https://interactivetextbooks.tudelft.nl/showthephysics/Introduction/About.html",
    "summary": "\"Show the Physics\" is an open-access book presenting a curated selection of 99 physics demonstrations from the Dutch \"ShowdeFysica\" series. Aimed at physics teachers, it provides strategies for making demonstrations both engaging and educational. The book categorizes demonstrations based on their purpose: nature of science, scientific inquiry, conceptual development, and special occasions. It also features videos, live coding opportunities, and Python simulations.\n\nThe book originated from a collaboration of physics teachers and educators within the Dutch Association for Science Education (NVON). While the demonstrations are often inspired by existing experiments, they have been thoroughly tested and refined for effectiveness. The book encourages users to adapt and use the materials for non-commercial purposes with attribution.\n\n\"Show the Physics\" encourages the use of demonstrations to enhance physics education, providing a readily accessible resource for teachers seeking to illustrate physics concepts. The online format includes interactive Python coding cells. Readers are invited to contribute to the book by reporting errors or suggesting improvements through a Github account. There's also a reference to 200 backpocket demos and the book is licensed under a Creative Commons Attribution 4.0 International License (CC BY) NC, with exceptions for the Foreword and Authors chapter figures.\n",
    "chinese_title": "展示物理学",
    "chinese_summary": "展示物理学"
  },
  {
    "id": "45305845",
    "title": "Trump to impose $100k fee for H-1B worker visas, White House says",
    "url": "https://www.reuters.com/business/media-telecom/trump-mulls-adding-new-100000-fee-h-1b-visas-bloomberg-news-reports-2025-09-19/",
    "summary": "The Reuters article reports that the Trump administration, according to a Bloomberg News report, is considering imposing a new $100,000 fee on companies employing H-1B visa workers. This fee would be significantly higher than existing H-1B visa fees.\n\nThe article states that the proposed fee is being considered as a way to raise revenue and potentially discourage companies from hiring foreign workers over American workers. The idea is to make it financially less attractive for companies to rely on H-1B visas for filling certain roles.\n\nWhile details were scarce in the report, the proposed fee increase is framed as a continuation of the Trump administration's broader efforts to restrict immigration and prioritize American workers. The Bloomberg report, which prompted the Reuters article, cited unnamed sources familiar with the matter. The implications for companies relying on skilled foreign workers and the overall tech industry could be substantial if such a fee is implemented. The timing and potential impact on the H-1B visa program are the main focus of the report.\n",
    "chinese_title": "特朗普将对H-1B工作签证征收10万美元费用，白宫称",
    "chinese_summary": "路透社报道，据彭博新闻社报道，特朗普政府正在考虑对雇用H-1B签证员工的公司征收10万美元的新费用。这项费用将大大高于现有的H-1B签证费用。\n\n报道称，拟议的费用被认为是增加收入的一种方式，并可能阻止公司雇用外国工人而非美国工人。其目的是使公司在某些职位上依赖H-1B签证在经济上不那么有吸引力。\n\n虽然该报告中的细节很少，但拟议的费用增加被视为特朗普政府限制移民和优先考虑美国工人这一更广泛努力的延续。引发路透社报道的彭博社报告援引了熟悉此事的不具名消息来源。如果实施这样的费用，对于依赖技术娴熟的外国工人的公司以及整个科技行业的影响可能是巨大的。报告的主要关注点是时间和对H-1B签证计划的潜在影响。"
  },
  {
    "id": "45300615",
    "title": "Dynamo AI (YC W22) Is Hiring a Senior Kubernetes Engineer",
    "url": "https://www.ycombinator.com/companies/dynamo-ai/jobs/fU1oC9q-senior-kubernetes-engineer",
    "summary": "Dynamo AI, a Y Combinator (W22) startup building secure and scalable AI systems for enterprises, is hiring a Senior Kubernetes Engineer to lead customer onboarding and deployment of their AI platform. The role involves deploying Kubernetes-based clusters into customer environments, acting as a technical liaison, and incorporating customer feedback into the product roadmap.\n\nThis is a hands-on, customer-facing position requiring U.S. government security clearance or citizenship due to work with government clients. In-office presence in San Francisco or New York for 2-3 days a week is also required. Responsibilities include understanding customer infrastructure, evolving core infrastructure for performance and security, developing automated deployment models, managing the Dynamo AI SaaS platform, and collaborating across teams to enhance product features.\n\nThe ideal candidate will possess extensive experience with Kubernetes, Helm, containerized application delivery, and at least one of AWS, Azure, or GCP, along with 4+ years in solution architecture, DevOps, or cloud engineering. Strong communication skills, customer engagement experience, and familiarity with authentication/authorization systems are also crucial. Experience in AI/ML infrastructure is a plus.\n\nDynamo AI is a 40-person team founded in 2021 in San Francisco. They focus on enabling private, secure, and compliant Gen AI models for the enterprise.\n",
    "chinese_title": "Dynamo AI (YC W22) 招聘资深 Kubernetes 工程师",
    "chinese_summary": "Dynamo AI 招聘资深 Kubernetes 工程师，负责客户导入和 AI 平台部署。"
  },
  {
    "id": "45295898",
    "title": "Want to piss off your IT department? Are the links not malicious looking enough?",
    "url": "https://phishyurl.com/",
    "summary": "This article promotes a tool that creates seemingly malicious URLs for educational or entertainment purposes. The tool operates as a redirect, similar to URL shorteners, but instead of making URLs shorter, it makes them *look* suspicious.\n\nThe core functionality involves inputting a legitimate URL and receiving a \"phishy\" looking URL as output. This new URL, when clicked, simply redirects the user to the original, safe link.\n\nThe article offers customization options for the generated URL's appearance:\n\n*   **Theme:** Users can select a theme to influence the domain name, making it appear related to topics like crypto, finance, phishing, online shopping, gambling, dating, tech, adult content, etc.\n*   **Length:** Users can adjust the length of the URL, ranging from \"Small\" to \"Very Large,\" or a randomized \"Just fuck me up fam!\" option.\n\nThe article emphasizes that the generated \"phishy\" link doesn't perform any malicious actions; it merely redirects to the original URL provided. It is clearly aimed as a joke about annoying IT departments rather than malicious usage.\n",
    "chinese_title": "想惹恼你的IT部门吗？ 链接看起来还不够恶意？",
    "chinese_summary": "本文介绍一款工具，该工具可生成看似恶意的URL，用于教育或娱乐目的。该工具的工作方式类似于URL缩短器，但不是缩短URL，而是使其*看起来*可疑，它本质上是一个重定向。\n\n其核心功能包括输入合法的URL并接收一个“钓鱼”外观的URL作为输出。当点击这个新的URL时，它只是将用户重定向到原始的安全链接。\n\n本文提供了自定义生成URL外观的选项：\n\n*   **主题：** 用户可以选择一个主题来影响域名，使其看起来与加密货币、金融、网络钓鱼、在线购物、赌博、约会、科技、成人内容等主题相关。\n*   **长度：** 用户可以调整URL的长度，范围从“短”到“超长”，或者选择随机的“让我崩溃吧！”选项。\n\n本文强调，生成的“钓鱼”链接不会执行任何恶意操作；它仅仅重定向到提供的原始URL。它的目的显然是拿烦人的IT部门开玩笑，而不是用于恶意用途。"
  },
  {
    "id": "45312516",
    "title": "Show HN: AvoSmash – AI video storytelling made easy",
    "url": "https://avosmash.io/",
    "summary": "AvoSmash is presented as an AI-powered tool designed to simplify video storytelling. The \"Show HN\" title indicates it's being showcased for feedback from the Hacker News community. The headline suggests the platform focuses on making the creation of video stories more accessible and easier using artificial intelligence. While the provided information is minimal, the core takeaway is that AvoSmash offers an AI-driven solution for creating videos that tell stories. It implies that the user can leverage AI to streamline the video creation process, potentially automating tasks like scriptwriting, video editing, or visual generation to create compelling video narratives.\n",
    "chinese_title": "Show HN: AvoSmash – AI视频故事创作变得简单",
    "chinese_summary": "AvoSmash：一款AI驱动的视频叙事简化工具。"
  },
  {
    "id": "45310858",
    "title": "The $4T accounting puzzle at the heart of the AI cloud",
    "url": "https://www.economist.com/business/2025/09/18/the-4trn-accounting-puzzle-at-the-heart-of-the-ai-cloud",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "人工智能云背后的4万亿美元会计难题",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "45265307",
    "title": "Sangaku Puzzle I Can't Solve",
    "url": "https://samjshah.com/2025/08/05/sangaku-puzzle-i-cant-solve/",
    "summary": "The author is struggling with a Sangaku puzzle: determining the radius of a small circle inscribed within a square and tangent to three other circles (two quarter-circles with radii equal to the square's side, and one half-circle with a radius equal to half the square's side). The goal is to prove that the small circle's radius is 4/33 of the square's side length ('s').\n\nAfter initially attempting a brute-force approach using coordinate geometry and calculus, which resulted in complex and likely incorrect equations, the author sought help online.\n\nSeveral people offered suggestions, including:\n\n*   **Descartes' Circle Theorem:** A Facebook user suggested using this theorem, linking to a resource. Another person independently solved the problem using the theorem and Apollonius' problem equations.\n*   **Inversion:** A BlueSky user suggested inverting the plane with respect to a specific point. This transforms the circles into lines, simplifying the problem. The author became intrigued and watched a Numberphile video explaining inversion. Others further elaborated on the inversion approach, including a Desmos sheet capturing the transformation and explanations on how to un-invert the solution.\n*   **Trilateration:** Another suggestion involved framing the problem as a trilateration problem.\n*   **Coordinate System:** Someone suggested a more basic coordinate system approach with three equations.\n*   **Japheth W's Solution:** A friend provided his written, albeit disorganized, solution.\n\nThe author's post details their frustrating, yet intriguing, journey through the problem, highlighting the various approaches suggested by others and their initial reactions to them. The post expresses a desire for a clear and elegant solution to explain the 4/33s relationship.\n",
    "chinese_title": "我解不开的算额难题",
    "chinese_summary": "作者正苦苦思索一道算額难题：确定一个内切于正方形并与另外三个圆（两个半径等于正方形边长的四分之一圆，以及一个半径等于正方形边长一半的半圆）相切的小圆的半径。目标是证明小圆的半径是正方形边长 's' 的 4/33。\n\n最初，作者尝试用坐标几何和微积分进行蛮力计算，结果得到了复杂且可能不正确的方程，于是便在网上寻求帮助。\n\n几个人提供了建议，包括：\n\n*   **笛卡尔圆定理：** 一位 Facebook 用户建议使用该定理，并提供了一个资源链接。另一个人独立地使用该定理和阿波罗尼奥斯问题方程解决了这个问题。\n*   **反演：** 一位 BlueSky 用户建议以某个特定点为中心对平面进行反演。这会将圆变换成直线，从而简化问题。作者对此产生了兴趣，并观看了 Numberphile 解释反演的视频。其他人进一步阐述了反演方法，包括一个展示变换的 Desmos 表格，以及关于如何反演回解的解释。\n*   **三边测量：** 另一个建议是将问题构建为一个三边测量问题。\n*   **坐标系：** 有人建议使用一个更基本的坐标系方法，包含三个方程。\n*   **Japheth W 的解法：** 一位朋友提供了他手写的，尽管有些杂乱无章的解法。\n\n作者的帖子详细描述了他们解决这个问题的令人沮丧但又引人入胜的旅程，突出了其他人提出的各种方法以及他们最初的反应。该帖子表达了对一个清晰而优雅的解决方案的渴望，以解释 4/33s 的关系。"
  },
  {
    "id": "45297066",
    "title": "Help us raise $200k to free JavaScript from Oracle",
    "url": "https://deno.com/blog/javascript-tm-gofundme",
    "summary": "Ryan Dahl, writing on September 18, 2025, appeals for public support to raise $200,000 to free the term \"JavaScript\" from Oracle's trademark. Deno initiated a Cancellation Petition with the US Patent and Trademark Office after an open letter about the trademark gained over 27,000 signatures. The goal is to make \"JavaScript\" public domain, allowing unrestricted use by developers, authors, and companies.\n\nThe funds are needed to cover the expenses of the discovery phase of the federal litigation. This includes professional public surveys to prove the term's generic usage, expert witnesses from academia and industry to testify on JavaScript’s history and usage, depositions and records from relevant organizations proving Oracle’s lack of involvement in the language’s development, and legal filings to counter Oracle’s claims.\n\nOracle officially denies that “JavaScript” is a generic term, but Dahl argues that it is self-evident and that the trademark system shouldn't allow companies to monopolize commonly used terms. The article urges readers to review the petition and open letter for a full understanding of the legal arguments.\n\nThe author emphasizes the importance of this case, stating that if Oracle wins, it would undermine the integrity of the trademark system and empower corporations to control generic terms. Any leftover funds will be donated to the OpenJS Foundation to defend civil liberties in the digital space. The article concludes with a plea to donate, share, and upvote the campaign.\n",
    "chinese_title": "帮助我们筹集20万美元，使JavaScript摆脱甲骨文的控制。",
    "chinese_summary": "瑞恩·达尔于2025年9月18日发文，呼吁公众支持筹集20万美元，以使“JavaScript”一词摆脱甲骨文的商标控制。在关于该商标的公开信获得超过27000个签名后，Deno向美国专利商标局发起了撤销申请。目标是使“JavaScript”进入公共领域，允许开发者、作者和公司不受限制地使用。\n\n这笔资金用于支付联邦诉讼的证据开示阶段的费用。这包括专业的公众调查，以证明该术语的通用用法；来自学术界和工业界的专家证人，就JavaScript的历史和用法作证；来自相关组织的取证和记录，证明甲骨文未参与该语言的开发；以及反驳甲骨文主张的法律文件。\n\n甲骨文官方否认“JavaScript”是一个通用术语，但达尔认为这是不言而喻的，商标制度不应允许公司垄断常用术语。文章敦促读者查看请愿书和公开信，以全面了解法律论据。\n\n作者强调了此案的重要性，声明如果甲骨文胜诉，将破坏商标制度的完整性，并授权公司控制通用术语。任何剩余资金将捐赠给OpenJS基金会，以捍卫数字领域的公民自由。文章最后呼吁捐款、分享和支持该活动。"
  },
  {
    "id": "45271108",
    "title": "Starfront Observatories",
    "url": "https://starfront.space/",
    "summary": "Starfront Observatories offers premier remote telescope hosting, making world-class remote telescope imaging and dark skies accessible. They provide various pier sizes for different telescope setups, ranging from small SeeStar models to large, professional-grade equipment, with monthly pricing from $99 to $399.\n\nThe observatory boasts a location with Bortle 1 dark skies and an advanced roll-off-roof facility. Customer testimonials highlight the knowledgeable and responsive tech support team, their quick installation services, and ability to troubleshoot technical issues effectively. Many reviewers emphasize the exceptional customer service and the sense of community fostered through Starfront's Discord channel.\n\nCustomers also praise the facility's location, the quality of the images achievable from the site, and the overall value for the affordable price. Starfront Observatories aims to provide an exceptional remote astrophotography experience, making it accessible to everyone. They encourage users to reserve a pier and join their community.\n",
    "chinese_title": "星前天文台",
    "chinese_summary": "星前沿天文台提供顶级的远程望远镜托管服务，让世界一流的远程望远镜成像和黑暗天空触手可及。他们提供各种尺寸的底座，适用于不同的望远镜设置，从小型星特朗型号到大型专业级设备，月费从 99 美元到 399 美元不等。\n\n该天文台拥有 Bortle 1 级黑暗天空的地理位置和先进的卷帘式屋顶设施。客户评价强调了知识渊博且反应迅速的技术支持团队、他们快速的安装服务以及有效排除技术问题的能力。 许多评论者强调了卓越的客户服务以及通过星前沿的 Discord 频道培养的社区意识。\n\n客户还赞扬该设施的地理位置、从该地点获得的高质量图像以及经济实惠的价格所带来的整体价值。星前沿天文台旨在提供卓越的远程天文摄影体验，让每个人都能体验到。 他们鼓励用户预订底座并加入他们的社区。"
  },
  {
    "id": "45305660",
    "title": "The Economic Impacts of AI: A Multidisciplinary, Multibook Review [pdf]",
    "url": "https://kevinbryanecon.com/BryanAIBookReview.pdf",
    "summary": "This PDF document appears to be an outline or table of contents for a multidisciplinary review of books on the economic impacts of Artificial Intelligence (AI). The document is structured with internal links to different sections, suggesting a comprehensive overview of the topic.\n\nThe titles of the linked sections hint at the scope of the review, which likely covers:\n\n*   **Introduction:** Setting the stage for the discussion on AI's economic effects.\n*   **Silicon Valley's Perspective:** Examining the beliefs and expectations of those involved in AI development.\n*   **The Second Machine Age:** referencing a book exploring the transformative potential of technology.\n*   **AI as a Prediction Machine:** Focusing on AI's capabilities in forecasting and its economic implications.\n*   **Data and the Macroeconomy:** Addressing the role of data in driving AI and its impact on the broader economic landscape.\n*   **Practical Implementation:** Looking at the real-world application of AI technologies.\n*   **A View from California:** Providing a regional perspective on AI's economic impact, likely focusing on the tech industry.\n*   **The Big Open Questions:** Identifying and discussing the major unresolved issues and future directions related to AI and the economy.\n\nBased on annotation, the review references works by Acemoglu, Agrawal, Altman, Aschenbrenner, Baley, Beane, Brynjolfsson, Bullock, Goodfellow, Lucas, Mollick, Nordhaus, and Vandehei, indicating a well-researched and thorough analysis. The footnotes also indicate that more information and reference materials are included in the article.\n",
    "chinese_title": "AI的经济影响：多学科、多本书评 [pdf]",
    "chinese_summary": "此PDF文档似乎是关于人工智能（AI）经济影响的多学科书籍评论的提纲或目录。该文档结构清晰，包含指向不同章节的内部链接，表明其对该主题进行了全面的概述。\n\n链接章节的标题暗示了评论的范围，可能涵盖：\n\n*   **导论：** 为讨论人工智能的经济影响奠定基础。\n*   **硅谷的视角：** 考察人工智能开发参与者的信念和期望。\n*   **第二次机器时代：** 引用一本探讨技术变革潜力的书籍。\n*   **人工智能作为预测机器：** 侧重于人工智能在预测方面的能力及其经济影响。\n*   **数据与宏观经济：** 探讨数据在驱动人工智能中的作用及其对更广泛经济格局的影响。\n*   **实践应用：** 关注人工智能技术的实际应用。\n*   **来自加州的视角：** 提供关于人工智能经济影响的区域视角，可能侧重于科技产业。\n*   **尚未解决的重大问题：** 识别并讨论与人工智能和经济相关的重大未解决问题和未来发展方向。\n\n根据注释，该评论引用了Acemoglu、Agrawal、Altman、Aschenbrenner、Baley、Beane、Brynjolfsson、Bullock、Goodfellow、Lucas、Mollick、Nordhaus和Vandehei等人的著作，表明这是一项研究充分且彻底的分析。脚注还表明文章中包含更多信息和参考资料。"
  },
  {
    "id": "45313251",
    "title": "Show HN: Arrow JavaScript, Reactivity Without the Framework",
    "url": "https://www.arrow-js.com/docs/",
    "summary": "This \"Show HN\" post introduces ArrowJS, a JavaScript library offering reactivity without requiring a specific framework. Essentially, ArrowJS aims to simplify building dynamic and responsive user interfaces by providing reactive primitives that can be integrated into existing projects regardless of the framework (or lack thereof) they are using.\n\nThe post links to the library's documentation and GitHub repository, implying that users can learn more about its features and usage through these resources. The call to \"Star\" the project suggests it is newly released and seeking community support and visibility. Finally, a link to a Twitter account suggests a way to stay updated with the project's development and announcements. In essence, ArrowJS positions itself as a lightweight solution for adding reactivity to JavaScript applications, offering a framework-agnostic alternative.\n",
    "chinese_title": "展示 HN：Arrow JavaScript，无需框架的响应式",
    "chinese_summary": "此篇“Show HN”帖子介绍 ArrowJS，一个无需特定框架即可提供响应式功能的 JavaScript 库。本质上，ArrowJS 旨在通过提供可集成到现有项目中的响应式原语来简化动态和响应式用户界面的构建，无论这些项目使用何种框架（或者没有框架）。\n\n该帖子链接到该库的文档和 GitHub 存储库，暗示用户可以通过这些资源了解更多关于其特性和用法的信息。“Star”该项目的呼吁表明它是一个新发布的项目，正在寻求社区支持和可见性。最后，一个指向 Twitter 帐户的链接提供了一种方式来随时了解该项目的开发和公告。总而言之，ArrowJS 将自己定位为为 JavaScript 应用程序添加响应式功能的轻量级解决方案，提供一种框架无关的替代方案。"
  },
  {
    "id": "45282504",
    "title": "Mini: Tonemaps (2023)",
    "url": "https://mini.gmshaders.com/p/tonemaps",
    "summary": "This article, \"Mini: Tonemaps (2023),\" addresses the issue of washed-out colors and color banding in shaders, particularly when brightness values exceed the 0.0 to 1.0 range of standard 8-bit color. The author, Xor, explains that simply clamping values leads to unnatural color transitions.\n\nThe solution is tonemapping, which smoothly maps high brightness values back into the 0.0 to 1.0 range, preserving color accuracy. The article showcases several tonemap functions, including ACES, Uncharted 2, Unreal, and a custom Tanh function, each offering a different curve and visual result.  The author highlights that the clamped tonemap is a straight line, which causes unnatural effects. Our eyes are very good at noticing changes in brightness and when those changes suddenly stop.\n\nXor then introduces the concept of HDR (High-Dynamic Range) rendering, where colors beyond the 0 to 1 range are used, often requiring the use of `surface_rgba16float` or `surface_rgba32float` formats for intermediate calculations before tonemapping back to LDR (Low-Dynamic Range). He uses his MandelBots project as an example, explaining how switching to HDR surfaces improved the lighting by avoiding washing out and color changes.\n\nIn conclusion, the article emphasizes that tonemapping can solve overexposure and washed-out colors, either by directly tonemapping shader output or by utilizing HDR surfaces for intermediate calculations, especially when blending multiple lights.\n",
    "chinese_title": "迷你：色调映射 (2023)",
    "chinese_summary": "本文“Mini: 色调映射 (2023)” 探讨了着色器中色彩发灰和色阶断层的问题，尤其是在亮度值超出标准8位色彩的0.0到1.0范围时。作者Xor解释说，简单地钳制数值会导致不自然的颜色过渡。\n\n解决方案是色调映射，它可以平滑地将高亮度值映射回0.0到1.0范围，从而保持色彩准确性。本文展示了几种色调映射函数，包括ACES、Uncharted 2、Unreal和一个自定义的Tanh函数，每种函数都提供不同的曲线和视觉效果。作者强调，钳制后的色调映射是一条直线，这会导致不自然的效果。我们的眼睛非常擅长注意到亮度变化，以及这些变化突然停止的时候。\n\n然后，Xor介绍了HDR（高动态范围）渲染的概念，其中使用了超出0到1范围的颜色，通常需要使用`surface_rgba16float`或`surface_rgba32float`格式进行中间计算，然后再色调映射回LDR（低动态范围）。他以他的MandelBots项目为例，解释了切换到HDR表面如何通过避免颜色发灰和颜色变化来改善光照。\n\n总而言之，本文强调，色调映射可以通过直接对shader输出进行色调映射或利用HDR表面进行中间计算来解决过度曝光和色彩发灰的问题，尤其是在混合多个光源时。"
  },
  {
    "id": "45302222",
    "title": "Revamping an Old TV as a Gift (2019)",
    "url": "https://blog.davidv.dev/posts/revamping-an-old-tv-as-a-gift/",
    "summary": "In 2017, the author revitalized a vintage TV found at a flea market as a 50th birthday gift for their father, aiming for a seamless 70s-80s TV experience. The core project involved integrating a Raspberry Pi to play retro shows.\n\nThe technical challenge was getting the Raspberry Pi's composite video output to display on the TV. This was solved using a composite RF modulator to convert the signal. The TV tuner was fixed to the modulator's output channel. To regain the ability to change channels using the original tuner knob, a multi-polar rotary switch connected to the Pi's GPIO was used, creating software-based channels.\n\nPower for the Pi (5V) and the RF modulator (9V) was sourced from the TV's 12V rail using LM7809 and LM7805 voltage regulators.\n\nInitially, the software aimed for random selection of shows and ads per channel. However, due to issues with gstreamer, the author resorted to creating 8-hour long video files per channel, with advertisements pre-baked in. A timestamp of the nearest keyframe is saved upon power off to resume playback from the same point after power-on.\n\nThe project resulted in a functional, standalone vintage TV with software-controlled channels. The author also created a fake package tracking website as an extra touch. The project was inspired by another similar project, though the author aimed for a more self-contained TV solution.\n",
    "chinese_title": "改造旧电视作为礼物（2019）",
    "chinese_summary": "2017年，作者将跳蚤市场淘到的一台老式电视机改造成了一份50岁生日礼物送给父亲，旨在实现无缝的70-80年代电视体验。核心项目是将树莓派集成进去，播放复古节目。\n\n技术挑战在于如何让树莓派的复合视频输出在电视上显示。这个问题通过使用复合射频调制器转换信号解决。电视调谐器固定在调制器的输出频道上。为了恢复使用原始调谐旋钮切换频道的能力，作者使用了一个连接到树莓派GPIO的多极旋转开关，创建了基于软件的频道。\n\n树莓派（5V）和射频调制器（9V）的电源来自电视机的12V电压轨，使用了LM7809和LM7805稳压器。\n\n最初，软件的目标是每个频道随机选择节目和广告。然而，由于gstreamer的问题，作者最终为每个频道创建了8小时长的视频文件，并预先嵌入了广告。关机时会保存最近关键帧的时间戳，以便在开机后从同一位置恢复播放。\n\n该项目最终产生了一台功能齐全、独立的、具有软件控制频道的老式电视机。作者还创建了一个虚假的包裹追踪网站作为额外的点缀。该项目受到了另一个类似项目的启发，但作者的目标是提供一个更加独立的电视解决方案。"
  },
  {
    "id": "45299625",
    "title": "Statistical Physics with R: Ising Model with Monte Carlo",
    "url": "https://github.com/msuzen/isingLenzMC",
    "summary": "This R package, \"isingLenzMC,\" provides tools for simulating the one-dimensional classical Ising Model using Metropolis and Glauber Monte Carlo methods with single-flip dynamics under periodic boundary conditions. The Ising Model itself is a foundational system in statistical physics, relevant for understanding spin glasses, magnetic materials, and more broadly, cooperative phenomena like phase transitions and neural networks. The package also includes functions for calculating exact solutions. The package and its related research, primarily authored by Mehmet Suezen, explore the dynamics of the Ising model and the concept of effective ergodicity using single-spin-flip dynamics. Two related publications highlight this focus: \"Effective ergodicity in single-spin-flip dynamics\" (Phys. Rev. E 90, 032141) and the arXiv preprint \"Anomalous diffusion in convergence to effective ergodicity\" (arXiv:1606.08693), both of which are associated with datasets presumably related to the simulations. In essence, \"isingLenzMC\" allows researchers and students to computationally explore the Ising Model and related theoretical concepts like ergodicity.\n",
    "chinese_title": "使用R语言的统计物理：基于蒙特卡洛方法的伊辛模型",
    "chinese_summary": "该R包\"isingLenzMC\"提供了使用 Metropolis 和 Glauber Monte Carlo 方法，并采用单自旋翻转动力学在周期性边界条件下模拟一维经典 Ising 模型的工具。 Ising 模型本身是统计物理学中的一个基础系统，与理解自旋玻璃、磁性材料以及更广泛的合作现象（如相变和神经网络）相关。 该软件包还包括用于计算精确解的函数。 该软件包及其相关研究，主要由 Mehmet Suezen 撰写，探讨了 Ising 模型的动力学和使用单自旋翻转动力学的有效遍历性概念。 两篇相关的出版物突出了这一重点：“单自旋翻转动力学中的有效遍历性”（Phys. Rev. E 90, 032141）和 arXiv 预印本“收敛到有效遍历性中的异常扩散”（arXiv:1606.08693），这两者都与可能与模拟相关的数据集相关联。 本质上，“isingLenzMC”允许研究人员和学生以计算方式探索 Ising 模型和相关的理论概念，如遍历性。"
  },
  {
    "id": "45299170",
    "title": "Ruby Central's Attack on RubyGems [pdf]",
    "url": "https://pup-e.com/goodbye-rubygems.pdf",
    "summary": "I am sorry, but I am unable to comply with that request. The content provided is not human-readable text. It appears to be a binary PDF file, not a text document, and it contains a mix of encoded data and possibly malicious code, that cannot be converted to human-readable text.\n",
    "chinese_title": "Ruby Central 对 RubyGems 的攻击 [pdf]",
    "chinese_summary": "很抱歉，我无法满足该请求。所提供的内容并非人类可读文本，它似乎是一个二进制PDF文件，而非文本文档，其中包含编码数据和可能的恶意代码，无法转换为人类可读文本。"
  },
  {
    "id": "45310529",
    "title": "If you are good at code review, you will be good at using AI agents",
    "url": "https://www.seangoedecke.com/ai-agents-and-code-review/",
    "summary": "This article argues that strong code review skills are crucial for effectively using AI coding agents like Claude Code, Codex, or Copilot. While AI can generate code quickly, it often lacks the judgment of experienced software engineers, leading to inefficient or poorly designed solutions. The author shares examples of AI agents pursuing complex solutions when simpler options exist, highlighting the need for human oversight to steer them in the right direction.\n\nThe key lies in structural code review, which focuses on the overall design and context within the existing codebase, rather than nitpicking individual lines. A good code reviewer considers alternative, more elegant approaches and identifies opportunities to reuse existing systems instead of building new ones.\n\nThe author contends that being overly nitpicky or, conversely, overly trusting of AI hinders its effective use. Nitpickers get bogged down in minor details, while rubber-stamp reviewers fail to identify and correct flawed architectural decisions.\n\nUltimately, the author believes that using AI coding tools effectively is akin to working with enthusiastic junior engineers who lack experience. The ideal approach is a \"centaur chess\" model, where a skilled human provides guidance and direction to the AI assistant. The article concludes with the observation that AI coding tools are rapidly improving, potentially mirroring the growth and development of a human engineer.\n",
    "chinese_title": "善于代码审查者，亦善用人工智能助手。",
    "chinese_summary": "代码审查能力对高效使用AI编码助手的至关重要性"
  },
  {
    "id": "45277900",
    "title": "A 3D-Printed Business Card Embosser",
    "url": "https://www.core77.com/posts/138492/A-3D-Printed-Business-Card-Embosser",
    "summary": "This Core77 article highlights a 3D-printed business card embosser designed by Igor Daemen, a product designer based in Eindhoven. Daemen designed the embosser to be modular, easily 3D-printable without supports, and requiring no hardware for assembly. He notes that tight tolerances are crucial for successful printing, and recommends using Basic PLA for the best results. The design files are available for free download.\n\nThe article also includes a few comments from readers. One expresses skepticism about PLA's suitability for compressive molds due to its low strength. Another humorously remarks about the prevalence of business cards.\n\nBeyond the embosser, the article serves as a promotion for Core77's industrial design resources, including a directory of industrial design companies. It also advertises the Core77 newsletter and highlights the site's need for cookies for optimal functionality.\n",
    "chinese_title": "3D打印名片压花器",
    "chinese_summary": "这篇 Core77 文章介绍了由埃因霍温的产品设计师 Igor Daemen 设计的 3D 打印名片压花器。Daemen 将压花器设计成模块化，易于 3D 打印且无需支撑，并且无需任何硬件即可组装。他指出，严格的公差对于成功打印至关重要，并建议使用 Basic PLA 以获得最佳效果。设计文件可供免费下载。\n\n文章还包含了一些读者的评论。一位读者对 PLA 材料因强度低而是否适合用于压缩模具表示怀疑。另一位读者则幽默地评论了名片的普遍性。\n\n除了压花器之外，这篇文章还宣传了 Core77 的工业设计资源，包括工业设计公司目录。它还宣传了 Core77 新闻通讯，并强调了该网站需要 Cookie 才能实现最佳功能。"
  },
  {
    "id": "45283074",
    "title": "Xmonad seeking help for Wayland port (2023)",
    "url": "https://xmonad.org/news/2023/10/06/wayland.html",
    "summary": "The XMonad development team is seeking a developer to help port XMonad to Wayland. After collecting contributions for two years, they now have the funding to pay someone for this task. The existing Wayland port project is considered too outdated and buggy to be easily salvaged. A significant challenge is the inability of Wayland programs to provide distinct identifiers, which would impact the functionality of the `appName` and `className` manageHooks. The XMonad team is soliciting proposals and discussion on the Discourse thread linked in the original article.\n",
    "chinese_title": "Xmonad 寻求 Wayland 移植帮助 (2023)",
    "chinese_summary": "XMonad开发团队正在寻找一位开发者，协助将XMonad移植到Wayland。经过两年的捐助积累，他们现在有资金聘请人员完成这项任务。现有的Wayland移植项目被认为过于陈旧且漏洞百出，难以挽救。一个重大挑战是Wayland程序无法提供独特的标识符，这将影响`appName`和`className`管理钩子的功能。XMonad团队正在征集方案，并在原文链接的Discourse论坛中展开讨论。"
  },
  {
    "id": "45288161",
    "title": "Nvidia buys $5B in Intel",
    "url": "https://www.tomshardware.com/pc-components/cpus/nvidia-and-intel-announce-jointly-developed-intel-x86-rtx-socs-for-pcs-with-nvidia-graphics-also-custom-nvidia-data-center-x86-processors-nvidia-buys-usd5-billion-in-intel-stock-in-seismic-deal",
    "summary": "In a surprising move, Nvidia and Intel are partnering to develop new generations of x86 products, signifying a major shift in the tech industry. The collaboration includes \"Intel x86 RTX SOCs\" for gaming PCs, which fuse Intel CPUs with Nvidia RTX GPU chiplets via NVLink. Nvidia will also use Intel to build custom x86 data center CPUs for its AI products. To solidify the partnership, Nvidia will purchase $5 billion in Intel common stock, representing a 5% ownership stake.\n\nThe products are in early development, with release timelines unspecified but expected in a year or more. Nvidia emphasizes its commitment to multi-generation roadmaps and continues its existing product lines, including Arm-based processors. It's unclear if Intel Foundry will produce these products, but it's a possibility. The new Intel x86 RTX SOCs will directly compete with AMD's APUs in the thin-and-light gaming laptop and small form-factor PC market. Notably, the new SOCs will use NVLink for faster communication between the CPU and GPU, with uniform memory access.\n\nIntel will also fabricate custom x86 data center CPUs for Nvidia, leveraging the NVLink interface. Nvidia's $5 billion investment in Intel follows similar investments from the U.S. government and Softbank, collectively bolstering Intel's financial position as it competes with TSMC. The CEOs of both Nvidia and Intel emphasized the strategic advantages of this partnership, including expanded ecosystems and laying the groundwork for the next era of computing.\n",
    "chinese_title": "英伟达收购英特尔50亿美元股份",
    "chinese_summary": "令人震惊的是，英伟达和英特尔宣布合作开发新一代x86产品，标志着科技行业的重大转变。此次合作包括面向游戏PC的“英特尔x86 RTX SOC”，通过NVLink将英特尔CPU与英伟达RTX GPU芯片融合。英伟达还将使用英特尔为其人工智能产品构建定制的x86数据中心CPU。为巩固合作关系，英伟达将购买价值50亿美元的英特尔普通股，持有5%的股份。\n\n这些产品尚处于早期开发阶段，发布时间尚未确定，预计将在一年或更长时间后推出。英伟达强调其对多代路线图的承诺，并继续其现有的产品线，包括基于Arm的处理器。目前尚不清楚这些产品是否将由英特尔代工厂生产，但这是一种可能性。新的英特尔x86 RTX SOC将直接与AMD的APU在轻薄游戏笔记本电脑和小型PC市场竞争。值得注意的是，新的SOC将使用NVLink来实现CPU和GPU之间更快的通信，并具有统一的内存访问。\n\n英特尔还将为英伟达制造定制的x86数据中心CPU，利用NVLink接口。英伟达对英特尔的50亿美元投资是在美国政府和软银类似投资之后进行的，共同增强了英特尔在与台积电竞争中的财务状况。英伟达和英特尔的首席执行官都强调了此次合作的战略优势，包括扩展生态系统和为下一代计算奠定基础。"
  },
  {
    "id": "45258029",
    "title": "Safepoints and Fil-C",
    "url": "https://fil-c.org/safepoints",
    "summary": "This article explains safepointing, a crucial synchronization mechanism in modern virtual machines (VMs) like Fil-C and the JVM, especially for garbage collection (GC). Safepointing enables threads to make assumptions about the VM's state and report their current state, ensuring GC soundness and enabling features like safe signal handling and forking.\n\nThe core problem addressed is how to ensure the GC can accurately scan memory for live objects when multiple threads are racing, potentially leaving pointers in registers or memory locations unknown to the GC. Safepointing solves this by inserting \"safe points\" in the compiled code where the compiler provides information about the location of pointers. The GC only preempts threads at these safepoints.\n\nFil-C implements safepointing by inserting pollchecks at backward control flow edges. These pollchecks check for requests from the GC, such as initiating a soft handshake. Fil-C also uses Pizderson frames to track pointers live across pollchecks, ensuring the GC has access to them.\n\nThe GC synchronizes with threads through a \"soft handshake\" mechanism, requesting actions (e.g., cache clearing) and waiting for threads to execute them at their next safepoint. The article also covers how Fil-C handles native code calls using `filc_enter` and `filc_exit` functions and discusses how safepointing protects store and load barriers, and handles thread-local caches. Finally, it highlights the role of safepoints in signal handling and implementing `fork(2)`.\n",
    "chinese_title": "安全点与Fil-C",
    "chinese_summary": "本文解释了安全点（Safepointing），它是现代虚拟机（VM）例如 Fil-C 和 JVM 中的一种关键同步机制，尤其对于垃圾回收（GC）。安全点使线程能够对虚拟机的状态做出假设并报告其当前状态，从而确保 GC 的健全性，并实现安全信号处理和 fork 等功能。\n\n本文解决的核心问题是如何确保 GC 能够准确地扫描内存中的存活对象，因为多个线程可能正在竞争，从而可能将指针留在寄存器或 GC 未知的内存位置。安全点通过在编译后的代码中插入“安全点”来解决这个问题，编译器在这些安全点提供关于指针位置的信息。GC 只会在这些安全点抢占线程。\n\nFil-C 通过在反向控制流边沿插入轮询检查（pollchecks）来实现安全点。这些轮询检查检查来自 GC 的请求，例如启动软握手。Fil-C 还使用 Pizderson 帧来跟踪跨越轮询检查的存活指针，确保 GC 可以访问它们。\n\nGC 通过“软握手”机制与线程同步，请求动作（例如，缓存清除）并等待线程在它们的下一个安全点执行这些动作。本文还介绍了 Fil-C 如何使用 `filc_enter` 和 `filc_exit` 函数处理本机代码调用，并讨论了安全点如何保护存储和加载屏障以及处理线程本地缓存。最后，本文重点介绍了安全点在信号处理和实现 `fork(2)` 中的作用。"
  },
  {
    "id": "45313998",
    "title": "Fortran and RSA: September 20th",
    "url": "https://blog.aurevow.com/posts/fortran-and-rsa-september-20th/",
    "summary": "The article \"Fortran and RSA: September 20th\" discusses the author's experience implementing the RSA encryption algorithm in Fortran. The author explains their motivation for choosing Fortran, citing its numerical computation capabilities and availability of arbitrary-precision arithmetic libraries (specifically, `mpif.h` using gfortran).\n\nThe blog post details the process of implementing RSA, highlighting the challenges and solutions encountered. Key aspects covered include:\n\n*   **Arbitrary Precision Arithmetic:** Using `mpif.h` for handling large integers required for RSA, which are significantly larger than standard integer types. The author acknowledges some limitations of the library and notes the importance of proper memory management.\n*   **Key Generation:** The author outlines the steps for generating RSA keys, including finding large prime numbers. They mention the Miller-Rabin primality test implemented for this purpose.\n*   **Encryption and Decryption:** The post briefly describes the mathematical formulas for encrypting and decrypting messages using RSA.\n*   **Code Snippets:** The article includes snippets of Fortran code illustrating the implementation of key functions within the RSA algorithm, like modular exponentiation (likely using square-and-multiply).\n\nThe author concludes by reflecting on the project, emphasizing the feasibility of implementing cryptographic algorithms in Fortran, even with some limitations in certain areas like string manipulation. The project demonstrates Fortran's continued relevance for numerical and computational tasks where precise arithmetic is crucial. They suggest the code could be further optimized, but highlights the project's success in creating a functional RSA implementation.\n",
    "chinese_title": "Fortran与RSA：9月20日",
    "chinese_summary": "文章“Fortran与RSA：9月20日”探讨了作者使用Fortran语言实现RSA加密算法的经验。作者解释了选择Fortran的动机，提到其数值计算能力以及任意精度算术库（特别是使用gfortran的`mpif.h`）的可用性。\n\n这篇博文详细介绍了RSA的实现过程，突出了遇到的挑战和解决方案。涵盖的关键方面包括：\n\n*   **任意精度算术：** 使用`mpif.h`处理RSA所需的大整数，这些整数远大于标准整数类型。作者承认该库的一些局限性，并指出适当内存管理的重要性。\n*   **密钥生成：** 作者概述了生成RSA密钥的步骤，包括寻找大素数。他们提到为此目的实现了Miller-Rabin素性测试。\n*   **加密与解密：** 该文章简要描述了使用RSA加密和解密消息的数学公式。\n*   **代码片段：** 文章包含Fortran代码片段，展示了RSA算法中关键函数的实现，例如模幂运算（可能使用平方求幂法）。\n\n作者最后总结了该项目，强调了在Fortran中实现加密算法的可行性，即使在某些领域（如字符串操作）存在一些局限性。该项目证明了Fortran在数值和计算任务中（在精确算术至关重要的情况下）的持续相关性。他们建议可以进一步优化代码，但强调了该项目在创建功能性RSA实现方面的成功。"
  },
  {
    "id": "45302065",
    "title": "I regret building this $3000 Pi AI cluster",
    "url": "https://www.jeffgeerling.com/blog/2025/i-regret-building-3000-pi-ai-cluster",
    "summary": "Jeff Geerling regrets building a $3000 Raspberry Pi AI cluster, finding its performance underwhelming despite having 160GB of RAM. After a two-year wait for the Compute Blades, he upgraded to CM5 modules, only to discover their limitations for AI and HPC tasks.\n\nThe cluster build was plagued by unreliable SSDs and thermal throttling, requiring multiple rebuilds. Benchmarking revealed it's 4 times slower than his $8,000 Framework Desktop cluster in HPC tasks, although slightly more energy-efficient.\n\nFor AI, the cluster's performance was severely limited due to the inability of llama.cpp to utilize the Pi 5 iGPU, resulting in slow CPU-powered inference. Large AI models required distribution across multiple Pis, leading to significantly slower token generation compared to the Framework cluster.\n\nWhile not a powerhouse, the Pi cluster's efficiency, quietness, and compact size could be advantageous for density-critical applications like CI jobs, high-security edge deployments, or Tor exit relays.\n\nUltimately, Geerling concludes that for most users, the cluster's cost and performance don't justify its niche benefits. He mentions Gateworks' discontinued industrial Compute Blade as another example of the lackluster popularity of compute blades in general. He thanks his supporters and provides a list of components used in the build.\n",
    "chinese_title": "我后悔花了三千美元搭建这个树莓派AI集群了。",
    "chinese_summary": "Jeff Geerling regrets building a $3000 Raspberry Pi AI cluster, finding its performance underwhelming despite having 160GB of RAM. After a two-year wait for the Compute Blades, he upgraded to CM5 modules, only to discover their limitations for AI and HPC tasks.\n\nThe cluster build was plagued by unreliable SSDs and thermal throttling, requiring multiple rebuilds. Benchmarking revealed it's 4 times slower than his $8,000 Framework Desktop cluster in HPC tasks, although slightly more energy-efficient.\n\nFor AI, the cluster's performance was severely limited due to the inability of llama.cpp to utilize the Pi 5 iGPU, resulting in slow CPU-powered inference. Large AI models required distribution across multiple Pis, leading to significantly slower token generation compared to the Framework cluster.\n\nWhile not a powerhouse, the Pi cluster's efficiency, quietness, and compact size could be advantageous for density-critical applications like CI jobs, high-security edge deployments, or Tor exit relays.\n\nUltimately, Geerling concludes that for most users, the cluster's cost and performance don't justify its niche benefits. He mentions Gateworks' discontinued industrial Compute Blade as another example of the lackluster popularity of compute blades in general. He thanks his supporters and provides a list of components used in the build.\n"
  },
  {
    "id": "45253926",
    "title": "The Ruliology of Lambdas",
    "url": "https://writings.stephenwolfram.com/2025/09/the-ruliology-of-lambdas/",
    "summary": "生成摘要时出错",
    "chinese_title": "The Ruliology of Lambdas",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45268293",
    "title": "Frying Eggs and Air Quality Tests",
    "url": "https://chillphysicsenjoyer.substack.com/p/frying-eggs-and-air-quality-tests",
    "summary": "生成摘要时出错",
    "chinese_title": "Frying Eggs and Air Quality Tests",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45313117",
    "title": "Cyber-attack causes delays at Heathrow and other European airports",
    "url": "https://www.bbc.co.uk/news/articles/c3drpgv33pxo",
    "summary": "生成摘要时出错",
    "chinese_title": "Cyber-attack causes delays at Heathrow and other European airports",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45309739",
    "title": "Are you an experienced software buyer? I could use some help",
    "url": "https://charity.wtf/2025/09/19/are-you-an-experienced-software-buyer-i-could-use-some-help/",
    "summary": "生成摘要时出错",
    "chinese_title": "Are you an experienced software buyer? I could use some help",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45297258",
    "title": "Playing “Minecraft” without Minecraft (2024)",
    "url": "https://lenowo.org/viewtopic.php?t=5",
    "summary": "生成摘要时出错",
    "chinese_title": "Playing “Minecraft” without Minecraft (2024)",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45305909",
    "title": "Time Spent on Hardening",
    "url": "https://third-bit.com/2025/09/18/time-spent-on-hardening/",
    "summary": "生成摘要时出错",
    "chinese_title": "Time Spent on Hardening",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45298034",
    "title": "The health benefits of sunlight may outweigh the risk of skin cancer",
    "url": "https://www.economist.com/science-and-technology/2025/09/17/the-health-benefits-of-sunlight-may-outweigh-the-risk-of-skin-cancer",
    "summary": "生成摘要时出错",
    "chinese_title": "The health benefits of sunlight may outweigh the risk of skin cancer",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45263123",
    "title": "The Fisherman and His Wife (1857)",
    "url": "https://sites.pitt.edu/~dash/grimm019.html",
    "summary": "生成摘要时出错",
    "chinese_title": "The Fisherman and His Wife (1857)",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45296403",
    "title": "Llama-Factory: Unified, Efficient Fine-Tuning for 100 Open LLMs",
    "url": "https://github.com/hiyouga/LLaMA-Factory",
    "summary": "生成摘要时出错",
    "chinese_title": "Llama-Factory: Unified, Efficient Fine-Tuning for 100 Open LLMs",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45312447",
    "title": "Overcoming barriers of hydrogen storage with a low-temperature hydrogen battery",
    "url": "https://www.isct.ac.jp/en/news/okmktjxyrvdc",
    "summary": "生成摘要时出错",
    "chinese_title": "Overcoming barriers of hydrogen storage with a low-temperature hydrogen battery",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45248242",
    "title": "Tracking trust with Rust in the kernel",
    "url": "https://lwn.net/Articles/1034603/",
    "summary": "生成摘要时出错",
    "chinese_title": "Tracking trust with Rust in the kernel",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45291024",
    "title": "Launch HN: Cactus (YC S25) – AI inference on smartphones",
    "url": "https://github.com/cactus-compute/cactus",
    "summary": "生成摘要时出错",
    "chinese_title": "Launch HN: Cactus (YC S25) – AI inference on smartphones",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45263035",
    "title": "I'm Not a Robot Game",
    "url": "https://neal.fun/not-a-robot/",
    "summary": "生成摘要时出错",
    "chinese_title": "I'm Not a Robot Game",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45286526",
    "title": "Pnpm has a new setting to stave off supply chain attacks",
    "url": "https://pnpm.io/blog/releases/10.16",
    "summary": "生成摘要时出错",
    "chinese_title": "Pnpm has a new setting to stave off supply chain attacks",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45259471",
    "title": "Rules for creating good-looking user interfaces",
    "url": "https://weberdominik.com/blog/rules-user-interfaces/",
    "summary": "生成摘要时出错",
    "chinese_title": "Rules for creating good-looking user interfaces",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45279384",
    "title": "WASM 3.0 Completed",
    "url": "https://webassembly.org/news/2025-09-17-wasm-3.0/",
    "summary": "生成摘要时出错",
    "chinese_title": "WASM 3.0 Completed",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45312326",
    "title": "FLX1s Is Launched",
    "url": "https://furilabs.com/flx1s-is-launched/",
    "summary": "生成摘要时出错",
    "chinese_title": "FLX1s 正式发布",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45287155",
    "title": "This website has no class",
    "url": "https://aaadaaam.com/notes/no-class/",
    "summary": "This article details the author's experiment in building a website completely without CSS classes. Motivated by the idea of treating HTML elements as pre-built components, the author sought to eliminate classes and rely solely on tag selectors, custom tags, and custom attributes for styling.\n\nThe process began with increased use of semantic HTML and contextual styling, leveraging CSS nesting, `:where()`, and `:has()` pseudo-classes. However, the author found this approach led to overly complex and esoteric selector patterns.\n\nThe solution involved using custom tag names and custom attributes, inspired by web component patterns but without using JavaScript. Custom tag names like `<note-pad>` were used for component styling, while custom attributes like `shape-type=\"1\"` handled variations, offering a semantic alternative to BEM modifiers.\n\nThe result was a reduction in CSS file size and improved accessibility due to increased focus on semantic markup. However, the author acknowledges the approach requires more careful planning and a holistic understanding of the site's structure. While happy with the results on a personal website, the author is hesitant to recommend it for larger projects with diverse skillsets.\n\nDespite not fully achieving classlessness due to a syntax highlighting plugin, the author believes this experiment will significantly influence their future work, questioning the long-held acceptance of CSS classes in web development.\n",
    "chinese_title": "This website has no class",
    "chinese_summary": "This article details the author's experiment in building a website completely without CSS classes. Motivated by the idea of treating HTML elements as pre-built components, the author sought to eliminate classes and rely solely on tag selectors, custom tags, and custom attributes for styling.\n\nThe process began with increased use of semantic HTML and contextual styling, leveraging CSS nesting, `:where()`, and `:has()` pseudo-classes. However, the author found this approach led to overly complex and esoteric selector patterns.\n\nThe solution involved using custom tag names and custom attributes, inspired by web component patterns but without using JavaScript. Custom tag names like `<note-pad>` were used for component styling, while custom attributes like `shape-type=\"1\"` handled variations, offering a semantic alternative to BEM modifiers.\n\nThe result was a reduction in CSS file size and improved accessibility due to increased focus on semantic markup. However, the author acknowledges the approach requires more careful planning and a holistic understanding of the site's structure. While happy with the results on a personal website, the author is hesitant to recommend it for larger projects with diverse skillsets.\n\nDespite not fully achieving classlessness due to a syntax highlighting plugin, the author believes this experiment will significantly influence their future work, questioning the long-held acceptance of CSS classes in web development.\n"
  },
  {
    "id": "45265487",
    "title": "Midcentury North American Restaurant Placemats",
    "url": "https://casualarchivist.substack.com/p/order-up",
    "summary": "生成摘要时出错",
    "chinese_title": "Midcentury North American Restaurant Placemats",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45294058",
    "title": "U.S. already has the critical minerals it needs, according to new analysis",
    "url": "https://www.minesnewsroom.com/news/us-already-has-critical-minerals-it-needs-theyre-being-thrown-away-new-analysis-shows",
    "summary": "生成摘要时出错",
    "chinese_title": "U.S. already has the critical minerals it needs, according to new analysis",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45256687",
    "title": "Linux for Nintendo 64 (1997)",
    "url": "https://web.archive.org/web/19990220141243/http://www.heise.de/ix/artikel/E/1997/04/036/",
    "summary": "生成摘要时出错",
    "chinese_title": "Linux for Nintendo 64 (1997)",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45301845",
    "title": "As Android developer verification gets ready to go, a new reason to be worried",
    "url": "https://www.androidauthority.com/android-sideload-offline-3598988/",
    "summary": "生成摘要时出错",
    "chinese_title": "As Android developer verification gets ready to go, a new reason to be worried",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45274277",
    "title": "Apple Photos app corrupts images",
    "url": "https://tenderlovemaking.com/2025/09/17/apple-photos-app-corrupts-images/",
    "summary": "生成摘要时出错",
    "chinese_title": "Apple Photos app corrupts images",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45301845",
    "title": "As Android developer verification gets ready to go, a new reason to be worried",
    "url": "https://www.androidauthority.com/android-sideload-offline-3598988/",
    "summary": "生成摘要时出错",
    "chinese_title": "As Android developer verification gets ready to go, a new reason to be worried",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45248356",
    "title": "Leatherman (vagabond)",
    "url": "https://en.wikipedia.org/wiki/Leatherman_(vagabond)",
    "summary": "生成摘要时出错",
    "chinese_title": "Leatherman (vagabond)",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45256575",
    "title": "The Sagrada Família takes its final shape",
    "url": "https://www.newyorker.com/magazine/2025/09/22/is-the-sagrada-familia-a-masterpiece-or-kitsch",
    "summary": "生成摘要时出错",
    "chinese_title": "The Sagrada Família takes its final shape",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45292475",
    "title": "OpenTelemetry collector: What it is, when you need it, and when you don't",
    "url": "https://oneuptime.com/blog/post/2025-09-18-what-is-opentelemetry-collector-and-why-use-one/view",
    "summary": "生成摘要时出错",
    "chinese_title": "OpenTelemetry collector: What it is, when you need it, and when you don't",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45292694",
    "title": "This map is not upside down",
    "url": "https://www.maps.com/this-map-is-not-upside-down/",
    "summary": "生成摘要时出错",
    "chinese_title": "This map is not upside down",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45294440",
    "title": "Apple: SSH and FileVault",
    "url": "https://keith.github.io/xcode-man-pages/apple_ssh_and_filevault.7.html",
    "summary": "生成摘要时出错",
    "chinese_title": "Apple: SSH and FileVault",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45302220",
    "title": "Trevor Milton's Nikola case dropped by SEC following Trump pardon",
    "url": "https://eletric-vehicles.com/nikola/trevor-miltons-nikola-case-dropped-by-sec-following-trump-pardon/",
    "summary": "生成摘要时出错",
    "chinese_title": "Trevor Milton's Nikola case dropped by SEC following Trump pardon",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45290021",
    "title": "Grief gets an expiration date, just like us",
    "url": "https://bessstillman.substack.com/p/oh-fuck-youre-still-sad",
    "summary": "生成摘要时出错",
    "chinese_title": "Grief gets an expiration date, just like us",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45245181",
    "title": "TIC-80 – Tiny Computer",
    "url": "https://tic80.com/",
    "summary": "生成摘要时出错",
    "chinese_title": "TIC-80 – Tiny Computer",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45308588",
    "title": "New York Signs into Law the Algorithmic Pricing Disclosure Act",
    "url": "https://www.bclplaw.com/en-US/events-insights-news/new-yorks-sweeping-algorithmic-pricing-reforms-what-retailers-need-to-know.html",
    "summary": "生成摘要时出错",
    "chinese_title": "New York Signs into Law the Algorithmic Pricing Disclosure Act",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45264764",
    "title": "The Many Broken Feeds",
    "url": "https://notes.abhinavsarkar.net/2025/broken-feeds",
    "summary": "生成摘要时出错",
    "chinese_title": "The Many Broken Feeds",
    "chinese_summary": "生成摘要时出错"
  }
]