[
  {
    "id": "43630388",
    "title": "Hardening the Firefox Front End with Content Security Policies",
    "url": "https://attackanddefense.dev/2025/04/09/hardening-the-firefox-frontend-with-content-security-policies.html",
    "summary": "This article discusses the effort to harden the Firefox front end against injection attacks, particularly Cross-Site Scripting (XSS), by leveraging Content Security Policies (CSP). Because the Firefox UI is built using web technologies, it's susceptible to similar vulnerabilities found in web applications.\n\nThe article highlights how a vulnerability chain in Pwn2Own 2022 exploited the creation of JavaScript inline event handlers in the Firefox UI. To mitigate this risk, the Firefox team has been removing inline event handlers from `browser.xhtml`, the main UI document, and replacing them with `addEventListener` calls in separate JavaScript files. CSPs are then used to block the execution of inline scripts by default, significantly hindering XSS attacks that rely on injecting and executing arbitrary code.\n\nOver 600 inline event handlers have been rewritten, demonstrating significant progress in hardening the UI. The article also mentions plans to extend this security measure to other parts of the Firefox UI and to implement more restrictive CSPs, like those already in place for \"about:\" pages.  The ultimate goal is to eliminate all dynamic code execution, including `eval`, within Firefox to create a more secure browsing experience. This proactive approach raises the bar for attackers and makes Firefox more resilient to exploitation.\n",
    "chinese_title": "使用内容安全策略加固 Firefox 前端",
    "chinese_summary": "本文探讨了通过利用内容安全策略 (CSP) 来加强 Firefox 前端防御注入攻击，特别是跨站脚本攻击 (XSS) 的努力。 由于 Firefox UI 是使用 Web 技术构建的，因此它容易受到 Web 应用程序中发现的类似漏洞的影响。\n\n本文重点介绍了 Pwn2Own 2022 中的一个漏洞链如何利用 Firefox UI 中 JavaScript 内联事件处理程序的创建。 为了降低这种风险，Firefox 团队一直在从主 UI 文档 `browser.xhtml` 中删除内联事件处理程序，并用单独 JavaScript 文件中的 `addEventListener` 调用来替换它们。 然后，CSP 用于默认阻止内联脚本的执行，从而显着阻碍了依赖于注入和执行任意代码的 XSS 攻击。\n\n已经重写了 600 多个内联事件处理程序，这表明在加强 UI 方面取得了重大进展。 本文还提到了将此安全措施扩展到 Firefox UI 的其他部分以及实施更严格的 CSP（例如已经为“about:”页面实施的 CSP）的计划。 最终目标是消除 Firefox 中的所有动态代码执行，包括 `eval`，以创建更安全的浏览体验。 这种积极主动的方法提高了攻击者的门槛，并使 Firefox 更具弹性，不易受到攻击。"
  },
  {
    "id": "43624220",
    "title": "Apache ECharts",
    "url": "https://echarts.apache.org/en/index.html",
    "summary": "Apache ECharts is presented as a declarative framework specifically designed for the rapid creation of web-based visualizations. The article emphasizes the framework's utility and encourages users to cite a specified paper, published in Visual Informatics in 2018, whenever ECharts is utilized in various activities including research, development, product creation, reports, publications, education, and patent applications. Essentially, the provided text acts as an introduction to ECharts and a request for proper attribution when the framework is employed.\n",
    "chinese_title": "Apache ECharts",
    "chinese_summary": "Apache ECharts是一个声明式框架，专为快速创建基于Web的可视化图表而设计。文章强调了该框架的实用性，并鼓励用户在研究、开发、产品创建、报告、出版物、教育和专利申请等各种活动中使用ECharts时，引用2018年在Visual Informatics上发表的指定论文。本质上，这段文字是对ECharts的介绍，并要求在使用该框架时进行适当的引用。"
  },
  {
    "id": "43629307",
    "title": "The best programmers I know",
    "url": "https://endler.dev/2025/best-programmers/",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "我所认识的最优秀的程序员",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "43629887",
    "title": "'Sun-Like' Stars",
    "url": "https://www.centauri-dreams.org/2025/04/08/on-sun-like-stars/",
    "summary": "Paul Gilster's article delves into the complexities and ambiguities surrounding the term \"Sun-like\" when discussing exoplanetary research. He begins by recalling his childhood fascination with finding habitable planets around stars similar to our Sun. However, he realized the term \"Sun-like\" lacked a strict definition.\n\nThe article highlights the shifting meaning of \"Sun-like\" as it moves from scientific papers to popular media. While G-class stars, like our Sun, are the primary focus, the definition often expands to include F and K-class stars due to their long lifespans and potential for hosting habitable worlds. Some even stretch it to encompass all Main Sequence stars (OBAFGKM), arguing that these stars are in a stable hydrogen-burning phase suitable for life's development.\n\nGilster emphasizes the importance of clarifying the definition of \"Sun-like\" due to its impact on estimations of habitable planet frequency. It can drastically change the perceived number of potential Earth-class planets, affecting public perception and potentially influencing funding for exoplanet research. The author also draws parallels with the ambiguous term \"Earth-like\" and underscores the need for scientists to be precise in their language when communicating with the public.\n\nThe subsequent comments further elaborate on the uncertainties surrounding habitability, acknowledging our limited understanding of life's requirements and the various challenges that could affect the prevalence of life in the universe.\n",
    "chinese_title": "类太阳恒星",
    "chinese_summary": "保罗·吉尔斯特的文章深入探讨了在讨论系外行星研究时，“类太阳”一词的复杂性和模糊性。他首先回忆了童年时期对寻找围绕类太阳恒星的可居住行星的迷恋。然而，他意识到“类太阳”一词缺乏严格的定义。\n\n文章强调了“类太阳”的含义从科学论文到大众媒体的转变。虽然像太阳一样的G型恒星是主要焦点，但由于它们的长寿命和潜在的宜居世界，该定义经常扩展到包括F型和K型恒星。有些人甚至将其延伸到包括所有主序星（OBAFGKM），认为这些恒星处于适合生命发展的稳定的氢燃烧阶段。\n\n吉尔斯特强调了澄清“类太阳”定义的重要性，因为它会影响对宜居行星频率的估计。它可以极大地改变人们对潜在的地球级行星数量的看法，从而影响公众认知，并可能影响系外行星研究的资金。作者还将“类地”这一模糊术语进行了类比，并强调科学家在与公众交流时需要使用精确的语言。\n\n随后的评论进一步阐述了围绕宜居性的不确定性，承认我们对生命需求的有限理解以及可能影响宇宙中生命普遍存在的各种挑战。"
  },
  {
    "id": "43627646",
    "title": "PostgreSQL Full-Text Search: Fast When Done Right (Debunking the Slow Myth)",
    "url": "https://blog.vectorchord.ai/postgresql-full-text-search-fast-when-done-right-debunking-the-slow-myth",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "PostgreSQL 全文搜索：正确配置，速度飞快（破除缓慢神话）",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "43625474",
    "title": "Obituary for Cyc",
    "url": "https://yuxi-liu-wired.github.io/essays/posts/cyc/",
    "summary": "This obituary chronicles the 40-year journey of Cyc, Douglas Lenat's ambitious project to create artificial general intelligence (AGI) through symbolic logic and a vast knowledge base. It argues that Cyc ultimately failed to achieve its goal.\n\nLenat's earlier work on automated mathematical discovery (AM and EURISKO) convinced him that AGI required a massive foundation of common-sense knowledge. In 1985, he launched Cyc, manually encoding millions of facts and rules. The project amassed roughly 30 million assertions at a cost of $200 million and 2,000 person-years. However, despite repeated predictions of a breakthrough, Cyc never achieved true machine learning or AGI.\n\nThe article highlights Cyc's insularity, noting minimal use in academic AI research and a lack of performance on public benchmarks. While Cycorp, the commercial entity behind Cyc, achieved financial stability through expert systems, data integration, and information retrieval applications, there's no evidence that Cyc's advanced intelligence provided any competitive advantage over traditional methods. The author criticizes Lenat's unwavering adherence to symbolic logic, rejecting alternative AI approaches. The OpenCyc spinoff also failed. The author concludes that Cyc's long-term failure serves as an indictment of the symbolic-logical approach to AI.\n",
    "chinese_title": "Cyc讣告",
    "chinese_summary": "这篇讣告记录了道格拉斯·列纳特雄心勃勃的项目Cyc的四十年历程，该项目旨在通过符号逻辑和庞大的知识库创造通用人工智能（AGI）。文章认为，Cyc最终未能实现其目标。\n\n列纳特早期在自动数学发现（AM和EURISKO）方面的工作使他相信，AGI需要大量的常识知识基础。1985年，他启动了Cyc项目，手动编码了数百万个事实和规则。该项目耗资2亿美元和2000人年，积累了约3000万条断言。然而，尽管多次预测会有突破，Cyc从未实现真正的机器学习或AGI。\n\n文章强调了Cyc的封闭性，指出它在学术界AI研究中的应用极少，并且在公开基准测试中缺乏表现。虽然Cyc背后的商业实体Cycorp通过专家系统、数据集成和信息检索应用程序实现了财务稳定，但没有证据表明Cyc的高级智能比传统方法提供了任何竞争优势。作者批评列纳特坚定地坚持符号逻辑，拒绝其他AI方法。OpenCyc的衍生项目也失败了。作者的结论是，Cyc的长期失败是对AI的符号逻辑方法的控诉。"
  },
  {
    "id": "43620279",
    "title": "Brazil's government-run payments system has become dominant",
    "url": "https://www.economist.com/the-americas/2025/04/03/brazils-government-run-payments-system-has-become-dominant",
    "summary": "In November 2020, Brazil's Central Bank (BCB) launched Pix, a digital payment system that quickly became dominant in the country. Pix offered an instantaneous, free, and easy-to-use payment method at a time when contactless transactions were highly desirable due to the COVID-19 pandemic.\n\nUsers can transfer money using the recipient's national ID, phone number, or a QR code. By 2024, Pix surpassed cash and cards as Brazil's most popular payment technology. Transaction numbers surged from 9 billion in 2021 to 63 billion in 2024, representing 26 trillion reais ($4.5 trillion) in value. Brazil's adoption rate of Pix is unparalleled globally.\n\nWhile Pix has modernized Brazil's banking sector, it also concentrates significant power within the central bank, a potentially worrying aspect mentioned in the article.\n",
    "chinese_title": "巴西政府运营的支付系统已占据主导地位。",
    "chinese_summary": "2020年11月，巴西中央银行（BCB）推出了Pix，这是一种迅速在该国占据主导地位的数字支付系统。在COVID-19疫情期间，非接触式交易需求旺盛，Pix恰好提供了一种即时、免费且易于使用的支付方式。\n\n用户可以使用收款人的国民身份证号、电话号码或二维码进行转账。到2024年，Pix已超过现金和银行卡，成为巴西最受欢迎的支付技术。交易数量从2021年的90亿笔激增至2024年的630亿笔，价值达26万亿雷亚尔（4.5万亿美元）。巴西对Pix的采用率在全球范围内首屈一指。\n\n虽然Pix使巴西的银行部门实现了现代化，但也将大量权力集中在中央银行手中，这是文章中提到的一个潜在令人担忧的方面。"
  },
  {
    "id": "43627758",
    "title": "Show HN: DrawDB – open-source online database diagram editor (a retro)",
    "url": "https://www.drawdb.app/",
    "summary": "This \"Show HN\" post is about DrawDB, an open-source online database diagram editor and SQL generator. The brief description indicates it allows users to visually design database schemas and automatically generate the corresponding SQL code. The message \"You need to enable JavaScript to run this app\" suggests it's a client-side web application built with JavaScript. Essentially, it's a tool aimed at simplifying database design and implementation through visual representation and automated code generation.\n",
    "chinese_title": "Show HN: DrawDB – 开源在线数据库图表编辑器 (复古风)",
    "chinese_summary": "DrawDB：开源在线数据库图表编辑器及SQL生成器。此“Show HN”帖子介绍DrawDB，它允许用户可视化设计数据库模式并自动生成相应的SQL代码。“您需要启用JavaScript才能运行此应用”提示表明它是一个用JavaScript构建的客户端Web应用程序。 本质上，它是一款旨在通过可视化表示和自动代码生成来简化数据库设计和实现的工具。"
  },
  {
    "id": "43597264",
    "title": "Linux Kernel Defence Map – Security Hardening Concepts",
    "url": "https://github.com/a13xp0p0v/linux-kernel-defence-map",
    "summary": "This article introduces the Linux Kernel Defence Map, a graphical representation designed to navigate the complex landscape of Linux kernel security. Created by a13xp0p0v, the map visually connects vulnerability classes (with CWE numbers), exploitation techniques, bug detection mechanisms, and various defence technologies, both in-tree and out-of-tree, including hardware-dependent solutions. The connections illustrate relationships, not necessarily full mitigation.\n\nThe map, written in DOT language for easy Git maintenance, is available on GitHub, Codeberg, and GitFlic. It can be generated using GraphViz. The author emphasizes that the map focuses on kernel security hardening and excludes attack surface reduction, userspace security features, and LSM policies.\n\nFurthermore, the author provides a tool called \"kernel-hardening-checker\" to help users verify and improve their kernel configurations by identifying security hardening options that are often not enabled by default in major distributions.\n\nThe article also lists several key references, including resources on Grsecurity, kernel self-protection, security documentation, mitigation checklists, and research papers analyzing kernel vulnerabilities and their mitigation. The current map version is designed for Linux kernel v6.10.\n",
    "chinese_title": "Linux内核防御图 – 安全加固概念",
    "chinese_summary": "本文介绍了 Linux 内核防御地图，一个旨在导航复杂的 Linux 内核安全领域的图形表示。该地图由 a13xp0p0v 创建，以可视化的方式将漏洞类别（带有 CWE 编号）、利用技术、漏洞检测机制以及各种防御技术（包括内核内和内核外的，以及硬件相关的解决方案）连接起来。 这些连接阐明了关系，不一定表示完全缓解。\n\n该地图使用 DOT 语言编写，便于 Git 维护，可在 GitHub、Codeberg 和 GitFlic 上获取。 它可以使用 GraphViz 生成。作者强调，该地图侧重于内核安全加固，不包括攻击面缩小、用户空间安全功能和 LSM 策略。\n\n此外，作者还提供了一个名为 \"kernel-hardening-checker\" 的工具，以帮助用户验证和改进其内核配置，通过识别主要发行版默认情况下通常未启用的安全加固选项。\n\n本文还列出了几个关键参考文献，包括关于 Grsecurity、内核自我保护、安全文档、缓解清单以及分析内核漏洞及其缓解措施的研究论文的资源。当前地图版本专为 Linux 内核 v6.10 设计。"
  },
  {
    "id": "43620141",
    "title": "Tailscale has raised $160M",
    "url": "https://tailscale.com/blog/series-c",
    "summary": "Tailscale has raised $160 million USD in Series C funding, led by Accel, to accelerate its mission of making networking disappear and building a new internet focused on identity, not just IP addresses. The funding will be used to remove friction, scale the network without complexity, and make identity the core of secure connectivity.\n\nTailscale aims to solve the problem of networking complexity, which has become especially prevalent in the AI industry where connecting GPUs across clouds and securing workloads is challenging. Leading AI companies like Perplexity, Mistral, and Cohere are already using Tailscale. Other notable clients include Instacart, SAP, and Duolingo.\n\nThe company plans to expand its engineering and product teams, invest in free support for free customers, and maintain backward compatibility. This investment allows Tailscale to remain focused on simplifying networking for everyone, from startups to Fortune 500 companies. The round includes participation from existing and new investors, including Accel's Amit Kumar, Anthony Casalena (Squarespace CEO), CRV, Heavybit, Insight, Uncork Capital, and George Kurtz (Crowdstrike CEO). Tailscale believes the network is the right place for security and identity layers and the boundary is shifting from the datacenter to the individual.\n",
    "chinese_title": "Tailscale 融资 1.6 亿美元",
    "chinese_summary": "Tailscale 获 Accel 领投 1.6 亿美元 C 轮融资，加速实现网络隐形化，打造以身份而非 IP 地址为核心的新互联网。该轮融资将用于消除摩擦、在不增加复杂性的前提下扩展网络，并使身份成为安全连接的核心。\n\nTailscale 旨在解决日益复杂的网络问题，这在 AI 行业尤为突出，因为跨云连接 GPU 和保护工作负载极具挑战性。Perplexity、Mistral 和 Cohere 等领先的 AI 公司已在使用 Tailscale。其他知名客户包括 Instacart、SAP 和 Duolingo。\n\n该公司计划扩大其工程和产品团队，投资于免费客户的免费支持，并保持向后兼容性。这项投资使 Tailscale 能够继续专注于简化所有人的网络连接，从初创公司到财富 500 强公司。此轮融资包括现有和新投资者的参与，包括 Accel 的 Amit Kumar、Anthony Casalena（Squarespace 首席执行官）、CRV、Heavybit、Insight、Uncork Capital 和 George Kurtz（Crowdstrike 首席执行官）。Tailscale 认为网络是安全和身份层的最佳位置，边界正在从数据中心转移到个人。"
  }
]