[
  {
    "id": "45249287",
    "title": "Hosting a website on a disposable vape",
    "url": "https://bogdanthegeek.github.io/blog/projects/vapeserver/",
    "summary": "This article details the process of hosting a website on the surprisingly capable microcontroller found in a disposable vape. The author, Bogdan Ionescu, salvaged a PUYA PY32F002B microcontroller from a vape, a chip with a 24MHz Cortex M0+, 24KB of Flash, and 3KB of RAM.\n\nThe core idea involves using semihosting, a method for ARM microcontrollers to communicate with a debugger, effectively turning the debugger into a network interface. By leveraging pyOCD and socat, the author creates a virtual serial connection that simulates a modem. This connection uses SLIP (Serial Line Internet Protocol) to transmit IP packets.\n\nTo handle TCP/IP communication, the author chose the lightweight uIP stack, initially designed for 8 and 16-bit machines. After addressing alignment issues within uIP, a minimal HTTP server was successfully implemented. Performance was initially poor, with slow ping times and page load speeds. However, by implementing a ring buffer to efficiently manage data transfer between the microcontroller and the host, the performance drastically improved, achieving ping times of 20ms and page loads in around 160ms.\n\nThe final result is a functional web server hosted on a disposable vape's microcontroller, with roughly 20KB of storage space available for website content. The author even added a JSON API endpoint for fun. The project code is available for others to explore.\n",
    "chinese_title": "在一次性电子烟上托管网站",
    "chinese_summary": "本文详细介绍了如何在一次性电子烟中发现的、性能出人意料的微控制器上托管网站的过程。作者Bogdan Ionescu从电子烟中拆解了一块PUYA PY32F002B微控制器，该芯片具有24MHz Cortex M0+内核、24KB闪存和3KB内存。\n\n核心思想是使用半主机模式，这是一种ARM微控制器与调试器通信的方法，实际上是将调试器变成一个网络接口。通过利用pyOCD和socat，作者创建了一个模拟调制解调器的虚拟串行连接。该连接使用SLIP（串行线路IP协议）来传输IP数据包。\n\n为了处理TCP/IP通信，作者选择了轻量级的uIP协议栈，该协议栈最初是为8位和16位机器设计的。在解决了uIP中的对齐问题后，一个最小的HTTP服务器被成功实现。最初的性能很差，ping时间和页面加载速度都很慢。然而，通过实现一个环形缓冲区来有效地管理微控制器和主机之间的数据传输，性能得到了极大的改善，实现了20ms的ping时间和大约160ms的页面加载速度。\n\n最终的结果是一个功能性的Web服务器，托管在一次性电子烟的微控制器上，大约有20KB的存储空间可用于网站内容。作者甚至为了好玩，还添加了一个JSON API端点。该项目代码可供其他人探索。"
  },
  {
    "id": "45249915",
    "title": "PayPal to support Ethereum and Bitcoin",
    "url": "https://newsroom.paypal-corp.com/2025-09-15-PayPal-Ushers-in-a-New-Era-of-Peer-to-Peer-Payments,-Reimagining-How-Money-Moves-to-Anyone,-Anywhere",
    "summary": "PayPal is introducing \"PayPal links,\" a new feature that allows users in the U.S. to send and receive money via personalized, one-time links sharable across any communication platform. This aims to simplify P2P payments and expand the PayPal ecosystem. International expansion to the UK, Italy, and other markets is planned for later in September 2025.\n\nCrucially, PayPal will integrate cryptocurrency directly into its P2P payment flow, enabling users to send Bitcoin, Ethereum, and PYUSD (PayPal USD stablecoin) to other PayPal and Venmo users, as well as to external digital wallets that support crypto and stablecoins.\n\nThe press release also emphasizes that Venmo and PayPal friends-and-family transfers remain exempt from 1099-K reporting, ensuring personal payments remain private. The launch of PayPal links is presented as a major step in PayPal's evolution, building on 25 years of revolutionizing money movement.\n\nThe company highlights strong growth in P2P payment volume and attributes it to improved user experience and discoverability. With the newly announced \"PayPal World\" platform, which aims to connect various payment systems and digital wallets, PayPal anticipates further growth in P2P payments. The article also mentions partnerships with Big Ten and Big 12 for student-athlete payments.\n",
    "chinese_title": "PayPal将支持以太坊和比特币",
    "chinese_summary": "PayPal推出“PayPal链接”，一项新功能，允许美国用户通过个性化的一次性链接在任何通信平台上收发款项。此举旨在简化P2P支付并扩展PayPal生态系统。计划于2025年9月晚些时候扩展到英国、意大利和其他市场。\n\n关键的是，PayPal将把加密货币直接整合到其P2P支付流程中，使用户能够将比特币、以太坊和PYUSD（PayPal美元稳定币）发送给其他PayPal和Venmo用户，以及支持加密货币和稳定币的外部数字钱包。\n\n新闻稿还强调，Venmo和PayPal亲友转账仍然免于1099-K报告，确保个人支付的私密性。 PayPal链接的推出被认为是PayPal发展中的重要一步，建立在25年革新资金流动的基础上。\n\n该公司强调P2P支付量的强劲增长，并将其归功于改善的用户体验和可发现性。 凭借新宣布的旨在连接各种支付系统和数字钱包的“PayPal World”平台，PayPal预计P2P支付将进一步增长。文章还提到了与十大联盟和十二大联盟在学生运动员支付方面的合作。"
  },
  {
    "id": "45251690",
    "title": "Wanted to spy on my dog, ended up spying on TP-Link",
    "url": "https://kennedn.com/blog/posts/tapo/",
    "summary": "This article details the author's deep dive into the workings of a Tapo indoor camera, initially intended for pet monitoring. Frustrated with the difficulty of integrating the camera with Frigate and the intrusive \"Tapo Care\" prompts, the author embarked on a reverse engineering journey to achieve cloudless onboarding.\n\nUsing tools like Frida and mitmproxy, the author intercepted and analyzed the communication between the Tapo app and the camera during onboarding. This revealed that the camera uses a default password (\"TPL075526460603\") for initial login before syncing with the user's cloud password. The author discovered the `securePassthrough` channel, used to encrypt API calls after the initial login, requiring decryption to understand the ongoing communication.\n\nBy decompiling the Tapo app APK with JADX and leveraging the PyTapo library for reference, the author successfully decrypted these encrypted messages. This analysis exposed the key steps involved in onboarding, including Wi-Fi scanning, enabling RTSP/ONVIF, and changing the admin password. Unnecessary steps were identified as fluff.\n\nThe culmination of this effort was a Bash script, `tapo_onboard.sh`, which automates the onboarding process without relying on the cloud. The script logs in with the default password, connects to Wi-Fi, disables the OSD logo, enables RTSP/ONVIF, changes the admin password, and joins the Wi-Fi network.\n\nThe author also notes inconsistencies in TP-Link's security practices, such as using both SHA-256 and MD5 hashing, and having two different public keys for encrypting passwords. Finally, the author achieved the initial goal: confirming that the dog mostly sleeps.\n",
    "chinese_title": "想监视我的狗，结果监视了TP-Link。",
    "chinese_summary": "本文详细介绍了作者对Tapo室内摄像头工作原理的深入研究，该摄像头最初用于宠物监控。由于难以将摄像头与Frigate集成以及烦人的“Tapo Care”提示，作者开始了一项逆向工程之旅，以实现无云上线。\n\n作者使用Frida和mitmproxy等工具，拦截并分析了Tapo应用程序与摄像头在上线期间的通信。这表明摄像头在与用户的云密码同步之前，使用默认密码（“TPL075526460603”）进行初始登录。作者发现了`securePassthrough`通道，该通道用于加密初始登录后的API调用，需要解密才能理解正在进行的通信。\n\n通过使用JADX反编译Tapo应用程序APK并利用PyTapo库进行参考，作者成功解密了这些加密消息。此分析揭示了上线所涉及的关键步骤，包括Wi-Fi扫描、启用RTSP/ONVIF以及更改管理员密码。不必要的步骤被识别为干扰项。\n\n这项努力的最终成果是一个Bash脚本，`tapo_onboard.sh`，它自动化了上线过程，而无需依赖云。该脚本使用默认密码登录，连接到Wi-Fi，禁用OSD徽标，启用RTSP/ONVIF，更改管理员密码，并加入Wi-Fi网络。\n\n作者还指出了TP-Link安全实践中的不一致之处，例如同时使用SHA-256和MD5哈希，以及使用两个不同的公钥来加密密码。最后，作者实现了最初的目标：确认狗大部分时间都在睡觉。"
  },
  {
    "id": "45249878",
    "title": "CubeSats are fascinating learning tools for space",
    "url": "https://www.jeffgeerling.com/blog/2025/cubesats-are-fascinating-learning-tools-space",
    "summary": "This article explores the fascinating world of CubeSats, small, standardized satellites powered by microcontrollers or Raspberry Pis, which are becoming increasingly accessible tools for space exploration and education. The author highlights their enthusiasm for CubeSats due to the complex engineering challenges they present, such as power efficiency, miniaturization, and security in a harsh environment.\n\nThe article covers the basics of CubeSat construction, noting their modular design that allows for custom payloads like cameras and sensors. It compares the cost of CubeSat projects to traditional satellites, showing a drastic reduction making them more accessible for educational institutions and hobbyists. The author discusses several CubeSat projects, including Mark Rober's SatGus and Manuel's \"Build a CubeSat\" project, which documents the challenges and learning experiences of developing a CubeSat.\n\nThe article introduces two CubeSat kits aimed at STEM education: the MySat Kit and RASCube. These kits provide hands-on experience in building and programming CubeSats, fostering interest in space, electronics, and hardware integration. Finally, the author highlights the upcoming launch of SilverSat, a CubeSat built by students, and encourages readers to learn how to track satellites from their backyards using affordable equipment. The article emphasizes the infectious enthusiasm of the CubeSat community for learning, teaching, and sharing their knowledge.\n",
    "chinese_title": "立方星是迷人的太空学习工具。",
    "chinese_summary": "本文探索了CubeSat这个迷人的世界。CubeSat是一种小型、标准化的卫星，由微控制器或树莓派供电，正日益成为太空探索和教育领域中越来越容易获得的工具。作者强调了他们对CubeSat的热情，因为它们带来了复杂的工程挑战，例如电源效率、小型化以及恶劣环境下的安全性。\n\n本文涵盖了CubeSat构建的基础知识，并指出其模块化设计允许定制有效载荷，如相机和传感器。它将CubeSat项目的成本与传统卫星进行了比较，显示出大幅降低，使其更易于教育机构和业余爱好者使用。作者讨论了几个CubeSat项目，包括Mark Rober的SatGus和Manuel的“构建CubeSat”项目，该项目记录了开发CubeSat的挑战和学习经验。\n\n本文介绍了两个面向STEM教育的CubeSat套件：MySat Kit和RASCube。这些套件提供了构建和编程CubeSat的实践经验，培养了对太空、电子和硬件集成领域的兴趣。最后，作者重点介绍了即将发射的SilverSat，这是一颗由学生建造的CubeSat，并鼓励读者了解如何使用廉价设备从后院跟踪卫星。本文强调了CubeSat社区在学习、教学和分享知识方面的极具感染力的热情。"
  },
  {
    "id": "45248899",
    "title": "How big a solar battery do I need to store all my home's electricity?",
    "url": "https://shkspr.mobi/blog/2025/09/how-big-a-solar-battery-do-i-need-to-store-all-my-homes-electricity/",
    "summary": "This article explores the hypothetical scenario of achieving 100% solar self-sufficiency for a typical suburban London home using battery storage. The author uses their own household's energy data (3,800 kWh annual consumption and production from solar panels) to calculate the required battery size.\n\nThe article highlights that a simple daily excess calculation isn't sufficient to determine battery needs. Instead, the peak excess electricity generated needs to be considered. Using a year's worth of data, from March 2024 to March 2025, the author calculates the cumulative difference between energy production and usage, revealing a need for a massive 1,068 kWh (1 MWh) battery to store all surplus summer solar energy for winter use.\n\nThe author acknowledges the impracticality of such a large battery with current technology and economics, citing costs ranging from £100k to £500k. However, they express optimism about rapidly decreasing battery prices, particularly with emerging technologies like sodium-ion batteries potentially reducing costs to levels comparable to solar panel installation.\n\nThe article concludes by advocating for domestic solar and envisions a future where homes could become entirely solar self-sufficient with affordable, large-scale battery storage, bringing energy production closer to consumption and reducing reliance on centralized power grids.\n",
    "chinese_title": "我需要多大的太阳能电池来储存我家所有的电力？",
    "chinese_summary": "本文探讨了使用电池储能实现伦敦郊区典型住宅100%太阳能自给自足的假设情景。作者利用自家住宅的能源数据（3,800千瓦时年消耗量和太阳能电池板的发电量）来计算所需的电池容量。\n\n文章强调，简单的每日盈余计算不足以确定电池需求。相反，需要考虑产生的峰值过剩电力。作者使用2024年3月至2025年3月一整年的数据，计算了能源生产和使用之间的累积差额，揭示了需要高达1,068千瓦时（1兆瓦时）的巨型电池，才能储存所有夏季剩余的太阳能供冬季使用。\n\n作者承认，以当前的技术和经济状况来看，如此大型的电池是不切实际的，并指出成本在10万英镑到50万英镑之间。然而，他们对电池价格迅速下降表示乐观，特别是像钠离子电池这样的新兴技术可能会将成本降低到与太阳能电池板安装相当的水平。\n\n文章最后倡导家用太阳能，并设想了一个未来，届时家庭可以通过经济实惠的大规模电池储能实现完全的太阳能自给自足，从而使能源生产更接近消费，并减少对集中式电网的依赖。"
  },
  {
    "id": "45249985",
    "title": "Programming Deflation",
    "url": "https://tidyfirst.substack.com/p/programming-deflation",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "编程通缩",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "45251093",
    "title": "Boring Work Needs Tension",
    "url": "https://iaziz786.com/blog/boring-work-needs-tension/",
    "summary": "This article argues that software development, often perceived as dull and repetitive, can be made exciting by embracing challenges and acting as problem-solving protagonists. The author contends that developers should actively seek out and address the \"tension\" inherent in everyday tasks, much like protagonists in engaging stories.\n\nThe core idea is to transform mundane work into a series of mini-quests by identifying and resolving common issues like slow CI/CD pipelines, database connection problems, memory leaks, poorly written code, high latency for users, database performance issues, and inconsistencies in API responses. These issues are framed as \"villains\" to be overcome.\n\nThe author emphasizes that finding and fixing these problems injects purpose and excitement into the work. Developers are encouraged to proactively improve their systems and code, regardless of whether these improvements are explicitly requested by project managers or clients. This proactive approach can be applied to both professional and personal projects. By actively chasing these challenges, developers can create a more engaging and fulfilling work experience, where resolving tension leads to a more compelling and satisfying \"story\" of accomplishment.\n",
    "chinese_title": "枯燥的工作需要压力",
    "chinese_summary": "本文认为，软件开发常被认为枯燥乏味、重复单调，但通过迎接挑战并扮演解决问题的英雄角色，可以变得令人兴奋。作者认为，开发者应该像引人入胜的故事中的主角一样，积极寻找并解决日常任务中固有的“张力”。\n\n核心思想是通过识别和解决常见问题，如缓慢的CI/CD管道、数据库连接问题、内存泄漏、编写糟糕的代码、用户高延迟、数据库性能问题以及API响应不一致等，将平凡的工作转变为一系列迷你任务。这些问题被视为需要克服的“反派”。\n\n作者强调，发现并解决这些问题可以为工作注入目标和兴奋感。鼓励开发者主动改进他们的系统和代码，无论项目经理或客户是否明确要求这些改进。这种积极主动的方法可以应用于专业和个人项目。通过积极应对这些挑战，开发者可以创造更具吸引力和成就感的工作体验，解决“张力”会带来更引人入胜和令人满意的成就“故事”。"
  },
  {
    "id": "45250202",
    "title": "How to self-host a web font from Google Fonts",
    "url": "https://blog.velocifyer.com/Posts/3,0,0,2025-8-13,+how+to+self+host+a+font+from+google+fonts.html",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "如何自托管 Google Fonts 的 Web 字体",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "45247890",
    "title": "RustGPT: A pure-Rust transformer LLM built from scratch",
    "url": "https://github.com/tekaratzas/RustGPT",
    "summary": "RustGPT is a pure-Rust implementation of a transformer-based Large Language Model (LLM) built from scratch using only the `ndarray` crate for matrix operations, eschewing traditional ML frameworks like PyTorch or TensorFlow. The project aims to demonstrate how to build an LLM, covering pre-training on factual text, instruction tuning for conversational AI, and interactive chat functionality.\n\nThe architecture employs standard transformer components: tokenization, embeddings, transformer blocks (self-attention and feed-forward networks), output projection, and vocabulary management. Training involves two phases: pre-training on factual statements and instruction tuning on conversational data. The model uses the Adam optimizer with gradient clipping.\n\nKey files to explore are `src/main.rs` (training pipeline and interactive mode) and `src/llm.rs` (core LLM implementation). The project includes comprehensive tests for all components. The implementation emphasizes modularity, clean interfaces, and avoids external ML dependencies.\n\nThe project encourages contributions, especially in areas like model persistence (saving/loading), performance optimization, improved sampling methods (beam search), and evaluation metrics. It outlines various contribution levels for beginners, intermediate, and advanced developers, focusing on features like model save/load, positional encodings, multi-head attention, and parallelization. The project maintains a \"from scratch\" philosophy, emphasizing pure Rust implementation.\n",
    "chinese_title": "RustGPT：纯 Rust 从零构建的 Transformer LLM",
    "chinese_summary": "RustGPT：纯 Rust 实现的 Transformer 大型语言模型，完全从零开始构建，仅使用 `ndarray` crate 进行矩阵运算，避免了 PyTorch 或 TensorFlow 等传统机器学习框架。该项目旨在展示如何构建 LLM，涵盖事实文本的预训练、会话 AI 的指令调优以及交互式聊天功能。\n\n该架构采用标准的 Transformer 组件：分词、嵌入、Transformer 块（自注意力机制和前馈神经网络）、输出投影和词汇表管理。训练包括两个阶段：事实陈述的预训练和会话数据的指令调优。该模型使用 Adam 优化器和梯度裁剪。\n\n要探索的关键文件包括 `src/main.rs` (训练流程和交互模式) 和 `src/llm.rs` (核心 LLM 实现)。该项目包含所有组件的全面测试。该实现强调模块化、清晰的接口，并避免外部 ML 依赖。\n\n该项目鼓励贡献，尤其是在模型持久化（保存/加载）、性能优化、改进的采样方法（束搜索）和评估指标等领域。它概述了针对初级、中级和高级开发人员的各种贡献级别，侧重于模型保存/加载、位置编码、多头注意力和并行化等功能。该项目坚持“从零开始”的理念，强调纯 Rust 实现。"
  },
  {
    "id": "45251375",
    "title": "Asciinema CLI 3.0 rewritten in Rust, adds live streaming, upgrades file format",
    "url": "https://blog.asciinema.org/post/three-point-o/",
    "summary": "Asciinema CLI 3.0 has been released, featuring a complete rewrite in Rust, a new asciicast v3 file format, and live terminal streaming. The Rust rewrite improves performance, simplifies installation, and enables new features like the integration of asciinema's virtual terminal.\n\nThe asciicast v3 format uses intervals for timing events, simplifying editing and adding support for exit statuses. It also restructures the header for better organization. The new CLI supports live streaming in two modes: local (via built-in HTTP server) and remote (via asciinema server). The asciinema player includes adaptive buffering for a smooth viewing experience.\n\nThe update prioritizes local file saving. The `asciinema rec` command now always requires a filename for local storage, removing the automatic upload behavior. Publishing now requires the explicit `asciinema upload <filename>` command. A new server URL prompt allows users to explicitly choose an asciinema server instance (defaulting to asciinema.org), enhancing self-hosting capabilities and data privacy. Overall, version 3.0 offers significant improvements in functionality, performance, and user control over data handling.\n",
    "chinese_title": "Asciinema CLI 3.0：用Rust重写，新增直播功能，升级文件格式",
    "chinese_summary": "Asciinema CLI 3.0 发布，采用 Rust 全面重写，引入全新 asciicast v3 文件格式和实时终端流式传输。Rust 重写提升了性能，简化了安装，并实现了 asciinema 虚拟终端集成等新功能。\n\nasciicast v3 格式使用时间间隔记录事件，简化了编辑并增加了对退出状态的支持，还重构了头部以获得更好的组织结构。新 CLI 支持两种模式的实时流式传输：本地（通过内置 HTTP 服务器）和远程（通过 asciinema 服务器）。asciinema 播放器包含自适应缓冲，提供流畅的观看体验。\n\n本次更新优先考虑本地文件保存。`asciinema rec` 命令现在始终需要指定文件名进行本地存储，移除了自动上传行为。发布现在需要显式使用 `asciinema upload <filename>` 命令。新增服务器 URL 提示，允许用户显式选择 asciinema 服务器实例（默认为 asciinema.org），从而增强了自托管能力和数据隐私。总而言之，3.0 版本在功能、性能和用户数据处理控制方面提供了显著改进。"
  },
  {
    "id": "45223827",
    "title": "Removing newlines in FASTA file increases ZSTD compression ratio by 10x",
    "url": "https://log.bede.im/2025/09/12/zstandard-long-range-genomes.html",
    "summary": "This article explores using Zstandard's `--long` range match finder for compressing large FASTA files of bacterial genome assemblies. The author, Bede Constantinides, found that the `--long` option, designed to improve deduplication by increasing the search window, initially yielded only modest compression improvements on the 661k bacterial genome dataset (2.46TiB). Constantinides hypothesized that the cosmetic newlines present in the FASTA files (every 60 characters) interfered with Zstandard's long-range pattern matching.\n\nRemoving these newlines using `seqtk seq -l 0` significantly improved compression, tripling the compression ratio (CR) with `--long`. Further increasing the window size to the maximum (using `--long=31`) tripled the CR again, resulting in a final file size of 80GiB and a CR of 31. This brought Zstandard's compression performance within an order of magnitude of specialized, slower DNA sequence compressors.\n\nThe author emphasizes that while increasing the window size reduces compatibility (requiring the same `--long=xx` argument for decompression), using `--long` offers a valuable compromise between speed and compression ratio. The key takeaway is to remove cosmetic whitespace, especially newlines, from FASTA files when using Zstandard with `--long` to maximize compression efficiency. This technique works particularly well on datasets with highly similar sequences. The author also mentions that the results vary between datasets, however, `--long` appears to be a worthwhile consideration.\n",
    "chinese_title": "移除FASTA文件中换行符可将ZSTD压缩率提高10倍。",
    "chinese_summary": "本文探讨了使用 Zstandard 的 `--long` 范围匹配查找器来压缩大型细菌基因组装配 FASTA 文件。作者 Bede Constantinides 发现，旨在通过增加搜索窗口来提高去重的 `--long` 选项，最初仅在 66.1 万个细菌基因组数据集（2.46 TiB）上产生了适度的压缩改进。Constantinides 假设 FASTA 文件中存在的修饰性换行符（每 60 个字符）干扰了 Zstandard 的长程模式匹配。\n\n使用 `seqtk seq -l 0` 删除这些换行符显著提高了压缩率，使用 `--long` 后压缩率 (CR) 提高了三倍。进一步将窗口大小增加到最大值（使用 `--long=31`）再次使压缩率提高了三倍，最终文件大小为 80GiB，压缩率为 31。这使得 Zstandard 的压缩性能达到了专用、较慢的 DNA 序列压缩器的数量级内。\n\n作者强调，虽然增加窗口大小会降低兼容性（解压缩时需要相同的 `--long=xx` 参数），但使用 `--long` 可以在速度和压缩率之间提供有价值的折衷方案。关键在于，在使用 Zstandard 和 `--long` 时，从 FASTA 文件中删除修饰性空白，尤其是换行符，以最大程度地提高压缩效率。此技术在具有高度相似序列的数据集上特别有效。作者还提到，结果因数据集而异，但 `--long` 似乎值得考虑。"
  },
  {
    "id": "45250193",
    "title": "Show HN: Daffodil – Open-Source Ecommerce Framework to connect to any platform",
    "url": "https://github.com/graycoreio/daffodil",
    "summary": "Daffodil is an open-source e-commerce development framework designed for building adaptable storefronts that can connect to any e-commerce backend. The framework offers a way to create high-quality storefronts by leveraging its collection of packages.\n\nKey features and information include:\n\n*   **Adaptability:** Daffodil's primary strength is its ability to connect to various e-commerce backends.\n*   **Quickstart:** Installation is simplified using the `npx ng add @daffodil/commerce` command within an Angular application.\n*   **Documentation:** Extensive documentation is available to help developers get started and explore the framework's capabilities.\n*   **Community:** Daffodil encourages community involvement through contribution guidelines, a code of conduct, a Discord server, and a YouTube channel.\n*   **Packages:** A comprehensive list of available Daffodil packages is provided, covering functionalities such as analytics, authentication, cart management, checkout, product catalog, search, SEO, and more. The `checkout` package is noted as legacy and currently not recommended for use.\n*   **Contribution:** Developers are encouraged to contribute to the project by reporting bugs, contributing code, or improving documentation.\n*   **GitHub:** Users are encouraged to show their support by starring the Daffodil repository.\n",
    "chinese_title": "Show HN：Daffodil – 连接任何平台的开源电商框架",
    "chinese_summary": "Daffodil是一个开源的电商开发框架，旨在构建可连接任何电商后端的、适应性强的店面。该框架通过利用其软件包集合，提供了一种创建高质量店面的方法。\n\n主要特性和信息包括：\n\n*   **适应性：** Daffodil的主要优势在于其连接各种电商后端的能力。\n*   **快速启动：** 使用Angular应用中的`npx ng add @daffodil/commerce`命令可以简化安装过程。\n*   **文档：** 提供丰富的文档，帮助开发者入门并探索该框架的功能。\n*   **社区：** Daffodil鼓励社区参与，通过贡献指南、行为准则、Discord服务器和YouTube频道。\n*   **软件包：** 提供了一个全面的可用Daffodil软件包列表，涵盖了诸如分析、身份验证、购物车管理、结账、产品目录、搜索、SEO等功能。“结账”软件包已被标记为遗留，目前不建议使用。\n*   **贡献：** 鼓励开发者通过报告错误、贡献代码或改进文档来为项目做出贡献。\n*   **GitHub：** 鼓励用户通过给Daffodil仓库加星来表达他们的支持。"
  },
  {
    "id": "45220939",
    "title": "Self-Assembly Gets Automated in Reverse of 'Game of Life'",
    "url": "https://www.quantamagazine.org/self-assembly-gets-automated-in-reverse-of-game-of-life-20250910/",
    "summary": "This article discusses Neural Cellular Automata (NCAs), a new approach to self-assembly inspired by the Game of Life and developed by Alexander Mordvintsev at Google. Unlike traditional cellular automata where simple rules dictate complex structures, NCAs reverse this process, starting with a desired pattern and learning the rules to produce it.\n\nNCAs use neural networks to define the \"physics\" of each cell, determining its state based on its neighbors. This allows for the creation of complex, self-assembling systems, exemplified by Mordvintsev's virtual butterflies that can regenerate damaged wings. Biologists are intrigued by NCAs as a model for morphogenesis, the process by which biological cells form tissues and bodies, because cells only respond to their neighbors and can self-reorganize.\n\nNCAs have potential applications in medicine, where they might help regenerate lost limbs, and in engineering, where they could inspire fully distributed computers. Researchers are exploring the factors that contribute to NCA's regenerative powers, such as unpredictability and redundancy. They found that systems resilient to noise are more flexible in general.\n\nWhile NCAs offer a promising model for understanding self-organization and problem-solving, they also pose challenges in terms of coding and abstraction. The article highlights the potential for NCAs to revolutionize computation by enabling more energy-efficient, massively distributed parallel systems.\n",
    "chinese_title": "生命游戏逆向：自组装实现自动化",
    "chinese_summary": "本文探讨了神经元胞自动机（NCAs），这是一种受生命游戏启发，由谷歌的亚历山大·莫德温采夫开发的新型自组装方法。与传统元胞自动机利用简单规则来支配复杂结构不同，NCAs 颠倒了这一过程，从期望的模式开始，学习产生该模式的规则。\n\nNCAs 使用神经网络来定义每个细胞的“物理特性”，根据其邻居的状态来确定自身状态。这使得创建复杂的自组装系统成为可能，莫德温采夫的虚拟蝴蝶就是例证，它们可以再生受损的翅膀。生物学家对 NCAs 作为形态发生的模型很感兴趣，形态发生是指生物细胞形成组织和身体的过程，因为细胞仅对其邻居做出反应，并且可以自我重组。\n\nNCAs 在医学领域具有潜在应用，可能有助于再生失去的肢体，在工程领域，它们可以启发完全分布式的计算机。研究人员正在探索促成 NCA 再生能力的因素，例如不可预测性和冗余性。他们发现，对噪声具有弹性的系统通常更灵活。\n\n虽然 NCAs 为理解自组织和问题解决提供了一个有前景的模型，但它们在编码和抽象方面也带来了挑战。本文强调了 NCAs 通过实现更节能、大规模分布式并行系统来彻底改变计算的潜力。"
  },
  {
    "id": "45250370",
    "title": "Apple has a private CSS property to add Liquid Glass effects to web content",
    "url": "https://alastair.is/apple-has-a-private-css-property-to-add-liquid-glass-effects-to-web-content/",
    "summary": "This article delves into a hidden CSS property in Apple's WebKit engine, `-apple-visual-effect`, which allows developers to apply \"Liquid Glass\" effects to web content within iOS apps using WKWebView. The author discovered this by monitoring the WebKit Github repository.\n\nWhile exciting, the property is currently inaccessible for general use. It requires enabling a private WKPreferences setting called `useSystemAppearance`, which would likely lead to App Store rejection. The author experimented with it by hacking around the setting and successfully implemented the Liquid Glass effect.\n\nThe advantage of using CSS for this effect is the ability to use `@supports` queries to provide fallback styles for environments that don't support it.\n\nDespite the current limitations, the author argues this discovery has broader implications. He proposes \"Alastair's Grand The Toupée Theory of In-App Webviews,\" suggesting that seamlessly integrated webviews are often unnoticed. The existence of this property implies Apple is utilizing webviews with these effects internally, likely contributing to iOS's user interface in subtle ways that users don't realize are web-based.  The article concludes that the main reason webviews in apps have such a bad reputation is because you don't notice the webviews that are integrated seamlessly.\n",
    "chinese_title": "苹果拥有一个私有CSS属性，用于向Web内容添加液态玻璃效果。",
    "chinese_summary": "本文深入探讨了 Apple WebKit 引擎中一个隐藏的 CSS 属性 `-apple-visual-effect`，它允许开发者使用 WKWebView 在 iOS 应用中将“液态玻璃”效果应用于 Web 内容。作者通过监控 WebKit Github 仓库发现了这一点。\n\n虽然令人兴奋，但目前该属性无法公开使用。它需要启用一个名为 `useSystemAppearance` 的私有 WKPreferences 设置，这很可能导致 App Store 拒绝。作者通过绕过该设置进行了实验，并成功实现了液态玻璃效果。\n\n使用 CSS 实现此效果的优势在于可以使用 `@supports` 查询为不支持它的环境提供备用样式。\n\n尽管目前存在局限性，但作者认为这一发现具有更广泛的意义。他提出了“阿拉斯泰尔的应用程序内 Webview 大头毛理论”，表明无缝集成的 Webview 往往不被注意。此属性的存在暗示 Apple 正在内部使用带有这些效果的 Webview，可能以用户没有意识到是基于 Web 的方式，微妙地影响着 iOS 的用户界面。文章的结论是，应用程序中的 Webview 之所以声名狼藉，主要是因为你不会注意到那些无缝集成的 Webview。"
  },
  {
    "id": "45251593",
    "title": "Microsoft to force install the Microsoft 365 Copilot app in October",
    "url": "https://www.bleepingcomputer.com/news/microsoft/microsoft-to-force-install-the-microsoft-365-copilot-app-in-october/",
    "summary": "In October 2025, Microsoft will begin automatically installing the Microsoft 365 Copilot app on Windows devices that have Microsoft 365 desktop applications. This app provides a central point of access to Copilot features and AI-powered capabilities across the Microsoft 365 suite, including Word, Excel, PowerPoint, Notebooks, and AI agents.\n\nWhile the app will be added to the Windows Start Menu and enabled by default, IT administrators will have the option to opt out through the Apps Admin Center. Microsoft advises administrators to notify their users and helpdesks before the forced installation to mitigate confusion and support requests.\n\nThe rollout is scheduled to begin in early October 2025 and conclude by mid-November. However, the installation will not occur on systems located within the European Economic Area (EEA). Microsoft highlights that this move aims to simplify access to Copilot and ensure users can readily discover and utilize its productivity-enhancing features. Some users may already have the app installed, so the change might not be noticeable.\n\nThis move is part of a larger effort to improve Copilot accessibility, with Microsoft also integrating Microsoft 365 Copilot agents into the Edge sidebar and introducing a setting for admins to pin the app to the Windows taskbar.\n",
    "chinese_title": "微软将于十月强制安装 Microsoft 365 Copilot 应用。",
    "chinese_summary": "微软将于2025年10月开始在装有Microsoft 365桌面应用程序的Windows设备上自动安装Microsoft 365 Copilot应用。此应用为整个Microsoft 365套件（包括Word、Excel、PowerPoint、笔记本和AI助手）提供Copilot功能和AI驱动功能的中心访问点。\n\n虽然该应用将被添加到Windows“开始”菜单并默认启用，但IT管理员可以选择通过应用管理中心选择退出。微软建议管理员在强制安装之前通知其用户和帮助台，以减少困惑和支持请求。\n\n该部署计划于2025年10月初开始，11月中旬结束。但是，安装不会在位于欧洲经济区（EEA）内的系统上进行。微软强调，此举旨在简化Copilot的访问，并确保用户可以轻松发现和使用其提高生产力的功能。部分用户可能已经安装了该应用，因此这一变化可能不会被注意到。\n\n此举是微软为提高Copilot可访问性而采取的更大举措的一部分，微软还将Microsoft 365 Copilot代理集成到Edge侧边栏中，并引入了一个设置，供管理员将该应用固定到Windows任务栏。"
  },
  {
    "id": "45246953",
    "title": "Folks, we have the best π",
    "url": "https://lcamtuf.substack.com/p/folks-we-have-the-best",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "各位，我们有最好的π。",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "45251178",
    "title": "A string formatting library in 65 lines of C++",
    "url": "https://riki.house/fmt",
    "summary": "This article presents a lightweight C++ string formatting library implemented in approximately 65 lines of code. The library aims to provide a simple and efficient alternative to more complex and compile-time intensive options like `{fmt}` or `std::print`.\n\nThe core functionality revolves around a `fmt::format` function that takes a `String_Buffer` (a structure containing a pre-allocated character buffer, its capacity, and current length) and a format string. The format string uses ` {}` as placeholders for arguments. The library handles escaping of `{{` to represent a literal `{`, and gracefully handles missing format arguments by rendering the placeholder as an empty string.\n\nThe library's key components include:\n\n*   `String_Buffer`: Represents the output buffer.\n*   `write`: Performs bounds-checked writing to the buffer, truncating if necessary and updating the buffer's length.\n*   `write_value`: Overloaded functions to convert various data types (e.g., string, int, bool) to strings and write them to the buffer.\n*   `next_hole`: Parses the format string, identifying and extracting literal parts between ` {}` placeholders.\n*   `format_value`: Inserts a value into the output if a hole is found.\n*   `format`: The main formatting function that iterates through the format string, calling `format_value` for each argument using a fold expression.\n\nThe article highlights the design choices made, including the use of `{}` for placeholders, which resolves escaping ambiguities, and the approach to handling buffer overflow by truncating and reporting the required length. The library prioritizes simplicity, speed, and ease of integration, allowing developers to easily extend and modify it for their specific needs.\n",
    "chinese_title": "一个用65行C++代码实现的字符串格式化库",
    "chinese_summary": "本文介绍了一个轻量级的 C++ 字符串格式化库，它用大约 65 行代码实现。该库旨在提供一个简单高效的替代方案，以取代更复杂且编译耗时的选项，如 `{fmt}` 或 `std::print`。\n\n其核心功能围绕着 `fmt::format` 函数，该函数接受一个 `String_Buffer`（一个包含预分配的字符缓冲区、其容量和当前长度的结构）和一个格式化字符串。该格式化字符串使用 ` {}` 作为参数的占位符。该库处理 `{{` 的转义，以表示文字 `{`，并通过将占位符呈现为空字符串来优雅地处理缺失的格式化参数。\n\n该库的关键组件包括：\n\n*   `String_Buffer`：表示输出缓冲区。\n*   `write`：执行边界检查的写入到缓冲区，必要时进行截断并更新缓冲区的长度。\n*   `write_value`：重载函数，用于将各种数据类型（例如，string、int、bool）转换为字符串并将它们写入缓冲区。\n*   `next_hole`：解析格式化字符串，识别并提取 ` {}` 占位符之间的文字部分。\n*   `format_value`：如果找到空位，则将值插入到输出中。\n*   `format`：主要格式化函数，它迭代格式化字符串，使用折叠表达式为每个参数调用 `format_value`。\n\n本文重点介绍了所做的设计选择，包括使用 `{}` 作为占位符（这解决了转义歧义）以及通过截断和报告所需长度来处理缓冲区溢出的方法。该库优先考虑简单性、速度和易于集成，使开发人员可以轻松地扩展和修改它以满足其特定需求。"
  },
  {
    "id": "45246971",
    "title": "The Mac App Flea Market",
    "url": "https://blog.jim-nielsen.com/2025/mac-app-flea-market/",
    "summary": "The article humorously critiques the Mac App Store's search results for \"AI chat,\" likening them to a flea market full of imitation goods. The author notes the abundance of ChatGPT-like app icons, many of which are near-identical black-and-white lookalikes of the real ChatGPT logo, and others using different colors. The actual ChatGPT desktop app from OpenAI is not even available in the Mac App Store, highlighting the problem of misleading imitations.\n\nThe article also focuses on the generic and repetitive names of these AI chatbot apps, pointing out the various combinations of \"AI,\" \"Chat,\" and \"Bot\" used to lure users. The author provides a long list of these creatively-named apps, highlighting the ridiculousness.\n\nThe author draws a parallel to counterfeit Nike merchandise to illustrate how these imitation apps reflect poorly on the Mac App Store itself. Ultimately, the author's point is that the Mac App Store is filled with low-quality, imitation AI chat apps, making it difficult to find genuine and reliable software.\n",
    "chinese_title": "Mac App 舊貨市場",
    "chinese_summary": "文章幽默地批评了Mac App Store上搜索“AI聊天”的结果，将其比作充斥着仿冒商品的跳蚤市场。作者注意到大量类似ChatGPT的应用图标，其中许多是与真正ChatGPT标志几乎相同的黑白仿制品，还有一些则使用了不同的颜色。OpenAI的官方ChatGPT桌面应用甚至没有在Mac App Store上架，突显了误导性仿冒品的问题。\n\n文章还着重指出了这些AI聊天机器人应用程式名称的通用性和重复性，并指出了使用各种“AI”、“聊天”和“机器人”的组合来引诱用户。作者提供了一长串此类富有“创意”名称的应用列表，突显了其荒谬性。\n\n作者将此情况与假冒Nike商品进行类比，以说明这些仿冒应用如何对Mac App Store本身产生负面影响。最终，作者的观点是，Mac App Store充斥着低质量的仿冒AI聊天应用，使得很难找到真正可靠的软件。"
  },
  {
    "id": "45245948",
    "title": "Language Models Pack Billions of Concepts into 12k Dimensions",
    "url": "https://nickyoder.com/johnson-lindenstrauss/",
    "summary": "This article explores how language models can pack billions of concepts into relatively small embedding spaces (like GPT-3's 12,288 dimensions). It delves into the Johnson-Lindenstrauss (JL) lemma, which guarantees that high-dimensional data can be projected into lower dimensions while preserving distances. The author's investigation, spurred by a 3Blue1Brown video, reveals that the limits of vector packing are higher than previously assumed, especially when using optimized projections instead of random ones.\n\nThe author discovered and corrected an issue with the loss function used in the video's experiment, leading to a deeper understanding of how quasi-orthogonal vectors can be arranged in high-dimensional spaces. Experimentally, they found that engineered projections achieve much lower values of the JL lemma's constant C, implying greater embedding capacity.\n\nThe article highlights two main applications of the JL lemma: dimensionality reduction for efficient computation with high-dimensional data (like customer preferences in e-commerce) and understanding embedding space capacity, explaining how language models represent nuanced relationships between millions of concepts. The research suggests current embedding dimensions are likely sufficient, and the challenge lies in optimizing the arrangement of concepts within those spaces. Finally, it emphasizes the importance of collaboration in mathematical discovery.\n",
    "chinese_title": "语言模型将数十亿概念压缩到1.2万维度中",
    "chinese_summary": "本文探讨了语言模型如何将数十亿的概念压缩到相对较小的嵌入空间中（如GPT-3的12,288维）。文章深入研究了Johnson-Lindenstrauss (JL) 引理，该引理保证了高维数据可以投影到低维空间，同时保持距离不变。受3Blue1Brown视频的启发，作者的研究表明，向量压缩的极限比之前假设的要高，尤其是在使用优化的投影而不是随机投影时。\n\n作者发现并纠正了视频实验中使用的损失函数的一个问题，从而更深入地理解了准正交向量在高维空间中是如何排列的。通过实验，他们发现，工程投影实现了远低于JL引理常数C的值，这意味着更大的嵌入容量。\n\n本文重点介绍了JL引理的两个主要应用：高维数据（如电子商务中的客户偏好）的高效计算的降维，以及理解嵌入空间容量，解释了语言模型如何表示数百万概念之间细微的关系。研究表明，当前的嵌入维度可能已经足够，挑战在于优化这些空间内概念的排列。最后，文章强调了数学发现中合作的重要性。"
  },
  {
    "id": "45247396",
    "title": "Show HN: I reverse engineered macOS to allow custom Lock Screen wallpapers",
    "url": "https://cindori.com/backdrop",
    "summary": "This \"Show HN\" post introduces Backdrop, a macOS wallpaper app that allows users to set animated or video wallpapers on both their desktop and, uniquely, their Lock Screen. The app features smooth 4K video playback, multi-monitor support, and intelligent power optimization.\n\nKey features and selling points include:\n\n*   **Lock Screen Support:** A world-first feature allowing custom video wallpapers on the macOS Lock Screen.\n*   **4K Video Wallpapers:** High-quality video backdrops for desktop customization.\n*   **Multi-Monitor Support:** Works seamlessly across multiple displays.\n*   **Backdrop Community:** Access to thousands of community-created backdrops.\n*   **Custom Creation:** Users can create their own backdrops using their own videos and Rive animations.\n*   **Performance Optimization:** Designed for macOS, with hardware acceleration, energy efficiency, and Retina display support.\n*   **Trial Version:** A 7-day trial is offered, with a watermark. Purchase unlocks full access to the community platform.\n*   **Apple iCloud Integration:** Community Platform features require iCloud login.\n*   **Subscription/Lifetime Purchase:** Users can choose a subscription or lifetime license for access.\n\nThe post also addresses common questions about performance impact, battery usage, and cancellation policy. It concludes with a call to action to download or buy the app and stay updated on new releases.\n",
    "chinese_title": "Show HN: 我逆向工程了 macOS，实现了自定义锁屏壁纸",
    "chinese_summary": "此“Show HN”帖子介绍了Backdrop，一款macOS壁纸应用，允许用户在桌面以及独特的锁屏上设置动画或视频壁纸。该应用具有流畅的4K视频播放、多显示器支持和智能电源优化功能。\n\n主要特性和卖点包括：\n\n*   **锁屏支持：** 全球首创功能，允许在macOS锁屏上使用自定义视频壁纸。\n*   **4K视频壁纸：** 用于桌面定制的高质量视频背景。\n*   **多显示器支持：** 在多个显示器上无缝工作。\n*   **Backdrop社区：** 访问数千个社区创建的背景。\n*   **自定义创建：** 用户可以使用自己的视频和Rive动画创建自己的背景。\n*   **性能优化：** 专为macOS设计，具有硬件加速、节能和Retina显示屏支持。\n*   **试用版：** 提供7天试用期，带有水印。购买即可解锁对社区平台的完全访问权限。\n*   **Apple iCloud集成：** 社区平台功能需要iCloud登录。\n*   **订阅/永久购买：** 用户可以选择订阅或永久许可证进行访问。\n\n该帖子还解决了关于性能影响、电池使用和取消政策的常见问题。最后，它号召大家下载或购买该应用程序，并随时关注新版本。"
  },
  {
    "id": "45250540",
    "title": "Creating a VGA Signal in Hubris",
    "url": "https://lasernoises.com/blog/hubris-vga/",
    "summary": "This article details the author's attempt to generate a VGA signal using an STM32 Nucleo-H753ZI board running Hubris, Oxide's embedded operating system. The goal was to output video to an old 4:3 VGA monitor by directly controlling GPIO pins.\n\nInitially, the author tried to eliminate the Hubris \"sys\" task to control GPIO pins directly, fearing context-switching overhead. However, memory protection limitations within Hubris forced a rethinking of this approach. The author successfully used timers and Pulse-Width Modulation (PWM) to blink an LED and then generate the horizontal (H-Sync) and vertical (V-Sync) signals required for VGA.\n\nChallenges arose when attempting to output a solid green screen, leading to the exploration of the Digital-to-Analog Converter (DAC) and Direct Memory Access (DMA) to generate a single repeating line. Memory region configuration issues within Hubris required careful attention to ensure DMA functionality. A gradient was eventually achieved using DMA to continuously update the DAC.\n\nThe author then aimed for a full 2D image, necessitating the use of the more powerful Master Direct Memory Access Controller (MDMA). However, running out of memory regions led to the reintroduction of the \"sys\" task to free up resources. While the MDMA was successfully copying data, a fully functional framebuffer hadn't been achieved at the time of writing. The author plans to continue the project and implement a working framebuffer in the future.\n",
    "chinese_title": "在Hubris中创建VGA信号",
    "chinese_summary": "本文详细介绍了作者尝试使用运行 Hubris (Oxide 的嵌入式操作系统) 的 STM32 Nucleo-H753ZI 开发板生成 VGA 信号的过程。目标是通过直接控制 GPIO 引脚，将视频输出到旧的 4:3 VGA 显示器。\n\n最初，作者试图消除 Hubris 的 \"sys\" 任务以直接控制 GPIO 引脚，担心上下文切换的开销。然而，Hubris 内的内存保护限制迫使重新考虑这种方法。作者成功地使用定时器和脉冲宽度调制 (PWM) 来闪烁 LED，然后生成 VGA 所需的水平同步 (H-Sync) 和垂直同步 (V-Sync) 信号。\n\n在尝试输出纯绿色屏幕时出现了挑战，导致作者探索数模转换器 (DAC) 和直接内存访问 (DMA) 来生成单条重复的线。Hubris 内的内存区域配置问题需要仔细关注，以确保 DMA 功能正常运行。最终，使用 DMA 持续更新 DAC 实现了渐变效果。\n\n然后，作者的目标是实现完整的 2D 图像，这需要使用功能更强大的主直接内存访问控制器 (MDMA)。然而，由于内存区域耗尽，作者重新引入了 \"sys\" 任务以释放资源。虽然 MDMA 成功地复制了数据，但在撰写本文时尚未实现完全正常工作的帧缓冲区。作者计划继续该项目，并在未来实现一个可用的帧缓冲区。"
  },
  {
    "id": "45250500",
    "title": "Meta bypassed Apple privacy protections, claims former employee",
    "url": "https://9to5mac.com/2025/08/21/meta-allegedly-bypassed-apple-privacy-measure-and-fired-employee-who-flagged-it/",
    "summary": "A former Meta product manager, Samujjal Purkayastha, alleges that Meta circumvented Apple's App Tracking Transparency (ATT) privacy measures, which were introduced in 2021 to require user permission for cross-app tracking. Purkayastha claims Meta found ways to identify Apple users even after they declined tracking, aiming to avoid an estimated $10 billion annual revenue loss.\n\nPurkayastha filed a claim with an employment tribunal, stating he was unlawfully dismissed for raising concerns internally about this practice. He alleges a \"closed and secretive\" team at Meta used \"deterministic matching\" to link user data and track activity across different websites without consent, violating Apple's policies. He also accuses Meta of inflating advertising sales figures.\n\nMeta denies any wrongdoing and claims Purkayastha was dismissed for unrelated reasons. The tribunal could not immediately rule and scheduled a full hearing for later in the year. The article highlights that Apple's ATT significantly impacted Meta's personalized advertising model, which relies on tracking users across different apps. This led to allegations of workarounds and a class-action lawsuit against Meta for privacy violations.\n",
    "chinese_title": "Meta绕过苹果隐私保护，前雇员称",
    "chinese_summary": "前Meta产品经理萨姆贾尔·普尔卡亚斯塔声称，Meta规避了苹果的应用跟踪透明度（ATT）隐私措施。苹果于2021年推出了ATT，要求用户授权跨应用追踪。普尔卡亚斯塔称，即使苹果用户拒绝跟踪，Meta也找到了识别他们的方法，旨在避免估计每年100亿美元的收入损失。\n\n普尔卡亚斯塔向劳资审裁处提出索赔，声称他因在内部提出对该做法的担忧而被非法解雇。他指控Meta的一个“封闭且隐秘”的团队使用“确定性匹配”来链接用户数据，并在未经同意的情况下跟踪不同网站上的活动，违反了苹果的政策。他还指责Meta虚报广告销售额。\n\nMeta否认有任何不当行为，并声称解雇普尔卡亚斯塔的原因与此无关。审裁处无法立即做出裁决，并安排在今年晚些时候进行全面听证。文章强调，苹果的ATT对Meta的个性化广告模式产生了重大影响，该模式依赖于跨应用跟踪用户。这导致了对变通方法的指控以及针对Meta的隐私侵犯集体诉讼。"
  },
  {
    "id": "45221112",
    "title": "Death to type classes",
    "url": "https://jappie.me/death-to-type-classes.html",
    "summary": "This article proposes replacing Haskell's type classes with Backpack module signatures to achieve a more OCaml-like module system. The author argues that type classes are \"lies\" and advocates for a system where values are constrained by module signatures rather than type classes.\n\nThe core idea revolves around defining signatures for concepts like `Functor` and implementing them with modules. The `Death.Functor.Signature` signature defines the `Functor` type and `map` function. Concrete modules like `Death.Functor.Maybe` then implement this signature, providing a specific `Functor` instance for `Maybe`.\n\nThe article highlights how Cabal's Backpack system can enforce that all signatures have implementations when building an executable, resolving potential errors related to missing modules. RebindableSyntax is used to specify which `Monad` to use for `do` notation.\n\nThe author presents an example of building an effect system using Backpack. Signatures define effects like `readFile` and `writeFile`, with different modules providing implementations (e.g., using IO or a state monad for testing).\n\nThe author concludes that the proposed Backpack-based effect system can offer benefits like improved error messages due to monomorphic effects, potential compile-time performance gains, and runtime speed comparable to IO. Despite not recommending to replace type classes, this alternative approach enables exploration.\n",
    "chinese_title": "类型类的末日",
    "chinese_summary": "本文提出用Backpack模块签名取代Haskell的类型类，以实现更像OCaml的模块系统。作者认为类型类是“谎言”，并提倡使用模块签名而不是类型类来约束值的系统。\n\n其核心思想围绕为`Functor`等概念定义签名，并使用模块实现它们。`Death.Functor.Signature`签名定义了`Functor`类型和`map`函数。然后，诸如`Death.Functor.Maybe`之类的具体模块实现此签名，为`Maybe`提供特定的`Functor`实例。\n\n本文重点介绍了Cabal的Backpack系统如何在构建可执行文件时强制所有签名都有实现，从而解决与缺少模块相关的潜在错误。RebindableSyntax用于指定要用于`do`表示法的`Monad`。\n\n作者提出了一个使用Backpack构建效果系统的例子。签名定义了像`readFile`和`writeFile`这样的效果，不同的模块提供实现（例如，使用IO或状态单子进行测试）。\n\n作者总结说，所提出的基于Backpack的效果系统可以提供诸如单态效果带来的改进的错误消息、潜在的编译时性能提升以及与IO相当的运行时速度等好处。尽管不建议取代类型类，但这种替代方法能够进行探索。"
  },
  {
    "id": "45245962",
    "title": "A qualitative analysis of pig-butchering scams",
    "url": "https://arxiv.org/abs/2503.20821",
    "summary": "This paper, titled \"Hello, is this Anna?\": Unpacking the Lifecycle of Pig-Butchering Scams,\" presents a qualitative analysis of pig-butchering scams, a sophisticated form of fraud blending romance, investment deception, and social engineering. The authors, Rajvardhan Oak and Zubair Shafiq, conducted in-depth semi-structured interviews with 26 victims to understand the scam's lifecycle and its impact.\n\nThe research reveals that pig-butchering scams follow a structured lifecycle characterized by emotional manipulation, staged financial exploitation, and persistent re-engagement attempts. Scammers employ tactics such as building trust, using fraudulent financial platforms, fabricating investment returns, and applying high-pressure to exploit victims' trust and financial resources over time.\n\nThe study highlights the complex psychological and financial consequences for victims, including increased vulnerability to secondary scams. Based on these findings, the authors propose actionable intervention points for social media and financial platforms to reduce the prevalence of these scams. They also emphasize the importance of using non-stigmatizing terminology to encourage victims to report the crime and seek help. The paper was accepted to USENIX SOUPS 2025.\n",
    "chinese_title": "猪盘骗局的定性分析",
    "chinese_summary": "本文题为“你好，是安娜吗？”：剖析“杀猪盘”诈骗的生命周期，对“杀猪盘”诈骗这种融合了情感、投资欺诈和社会工程学的复杂欺诈形式进行了定性分析。作者Rajvardhan Oak和Zubair Shafiq对26名受害者进行了深入的半结构化访谈，以了解诈骗的生命周期及其影响。\n\n研究表明，“杀猪盘”诈骗遵循结构化的生命周期，其特征是情感操纵、分阶段的金融剥削和持续的重新诱导尝试。诈骗者采用诸如建立信任、使用欺诈性金融平台、捏造投资回报以及施加高压等手段，随着时间的推移来利用受害者的信任和财务资源。\n\n该研究强调了受害者所面临的复杂的心理和财务后果，包括更容易受到二次诈骗的影响。基于这些发现，作者为社交媒体和金融平台提出了可行的干预点，以减少此类诈骗的发生率。他们还强调了使用非污名化术语的重要性，以鼓励受害者举报犯罪并寻求帮助。本文已被USENIX SOUPS 2025接收。"
  },
  {
    "id": "45245678",
    "title": "Which NPM package has the largest version number?",
    "url": "https://adamhl.dev/blog/largest-number-in-npm-package/",
    "summary": "The article details the author's quest to find the NPM package with the largest version number. Initially, the author encountered challenges using the NPM API, eventually utilizing the replication API via `replicate.npmjs.com` and fetching package metadata from `registry.npmjs.org`. Due to the rate limits and scale of the NPM registry, the author fetched package IDs and metadata in batches using a TypeScript script.\n\nThe search revealed `latentflip-test` with a massive version number, which was deemed unrealistic. The author then refined the criteria to find packages adhering to semantic versioning, disqualifying those with version numbers exceeding the total number of published versions. The author also manually excluded packages with automated or misconfigured publishing processes that resulted in duplicate or meaningless version increments.\n\nUltimately, the \"real\" winner was identified as `all-the-package-names` with version 2.0.2401. The article also presents rankings of packages based on total versions published and the largest version number found while considering adherence to semantic versioning and excluding known \"bad\" packages. The script used to perform the analysis is included at the end of the article. The project took a considerable amount of time due to the data volume involved.\n",
    "chinese_title": "哪个NPM包的版本号最高？",
    "chinese_summary": "本文详细介绍了作者寻找具有最大版本号的NPM包的过程。最初，作者在使用NPM API时遇到了挑战，最终通过`replicate.npmjs.com`利用复制API，并从`registry.npmjs.org`获取包元数据。由于NPM注册表的速率限制和规模，作者使用TypeScript脚本分批获取包ID和元数据。\n\n搜索结果显示`latentflip-test`具有一个巨大的版本号，但这被认为是不切实际的。随后，作者改进了标准，以寻找符合语义化版本控制的包，并排除那些版本号超过已发布版本总数的包。作者还手动排除了那些由于自动化或配置错误的发布流程而导致重复或无意义版本递增的包。\n\n最终，“真正的”赢家被确定为`all-the-package-names`，版本号为2.0.2401。文章还根据已发布版本总数和找到的最大版本号，同时考虑符合语义化版本控制并排除已知的“坏”包，展示了包的排名。文章末尾包含了用于执行分析的脚本。由于涉及的数据量巨大，该项目花费了相当长的时间。"
  },
  {
    "id": "45248868",
    "title": "Pgstream: Postgres streaming logical replication with DDL changes",
    "url": "https://github.com/xataio/pgstream",
    "summary": "Pgstream is an open-source command-line tool and library for Postgres logical replication, crucially supporting DDL changes. It streams data from Postgres to various targets, including Elasticsearch/OpenSearch, webhooks, and other Postgres databases, and also offers initial and on-demand snapshots. Key features include column value transformations, modular configuration, and Kafka support with schema-based partitioning, with extensibility for custom targets.\n\nThe tool can be used via CLI or as a library. Installation is available via binaries, source, or Homebrew. Configuration is flexible, allowing specification through CLI flags, YAML files, or environment variables.\n\nPgstream offers both replication and snapshot modes. The `run` command starts continuous streaming with DDL change replication. The `snapshot` command allows for on-demand data copies. Database initialization and cleanup are handled by `init` and `destroy` commands, respectively.\n\nThe documentation covers architecture, configuration options (YAML, environment variables), examples, snapshots, transformers, observability, and CLI usage.\n\nWhile offering powerful capabilities, pgstream has limitations, including single Kafka topic support, wal2json support only, and certain restrictions on filtering and data serialization. Contributions are welcomed under the Apache 2.0 license, and support is available through the repository or Discord.\n",
    "chinese_title": "Pgstream: 带有DDL变更的Postgres流式逻辑复制",
    "chinese_summary": "Pgstream 是一个开源命令行工具和库，用于 Postgres 逻辑复制，关键在于支持 DDL 变更。它可以将数据从 Postgres 流式传输到各种目标，包括 Elasticsearch/OpenSearch、Webhooks 和其他 Postgres 数据库，并且还提供初始和按需快照。主要功能包括列值转换、模块化配置以及具有基于模式的分区的 Kafka 支持，并可扩展到自定义目标。\n\n该工具可以通过 CLI 或作为库使用。可以通过二进制文件、源代码或 Homebrew 安装。配置灵活，允许通过 CLI 标志、YAML 文件或环境变量指定。\n\nPgstream 提供复制和快照两种模式。`run` 命令启动持续流式传输，并复制 DDL 变更。`snapshot` 命令允许按需数据复制。数据库初始化和清理分别由 `init` 和 `destroy` 命令处理。\n\n文档涵盖架构、配置选项（YAML、环境变量）、示例、快照、转换器、可观察性和 CLI 用法。\n\n虽然 pgstream 提供了强大的功能，但它也存在一些限制，包括仅支持单个 Kafka 主题、仅支持 wal2json，以及对过滤和数据序列化的一些限制。欢迎在 Apache 2.0 许可下贡献代码，并可以通过存储库或 Discord 获得支持。"
  },
  {
    "id": "45249697",
    "title": "Show HN: Semlib – Semantic Data Processing",
    "url": "https://github.com/anishathalye/semlib",
    "summary": "Semlib is a Python library designed to simplify data processing and analysis by leveraging the power of Large Language Models (LLMs) through familiar functional programming primitives like `map`, `reduce`, `sort`, and `filter`. The key innovation is that these operations are defined using natural language descriptions instead of traditional code. Semlib handles the underlying complexities of LLM interaction, including prompting, parsing, concurrency, caching, and cost management.\n\nThe library addresses the limitations of directly feeding large datasets into LLMs for complex tasks, which often leads to lower quality results. By breaking down tasks into smaller, semantic operations, Semlib provides several advantages:\n\n*   **Quality:** Achieves higher quality results by simplifying sub-tasks for LLMs.\n*   **Feasibility:** Enables processing of arbitrarily large datasets by dividing tasks into manageable chunks.\n*   **Latency:** Reduces processing time through concurrent execution of sub-tasks.\n*   **Cost:** Allows for the use of smaller, cheaper models for simpler sub-tasks, optimizing overall costs.\n*   **Security:** Facilitates the use of open-source, self-hosted models for sensitive data processing.\n*   **Flexibility:** Integrates LLM-based and traditional Python code seamlessly within the same data pipeline.\n\nSemlib promotes a structured approach to data processing with LLMs, allowing developers to build robust, efficient, and cost-effective data analysis pipelines. The library is open-sourced under the MIT license.\n",
    "chinese_title": "Show HN: Semlib – 语义数据处理",
    "chinese_summary": "Semlib是一个Python库，旨在通过利用大型语言模型（LLM）的能力，并借助`map`、`reduce`、`sort`和`filter`等熟悉的函数式编程原语，来简化数据处理和分析。其主要创新在于这些操作是使用自然语言描述定义的，而不是传统的代码。 Semlib处理LLM交互的底层复杂性，包括提示、解析、并发、缓存和成本管理。\n\n该库解决了直接将大型数据集输入LLM进行复杂任务的局限性，这通常会导致较低质量的结果。 通过将任务分解为更小的、语义操作，Semlib提供了以下几个优点：\n\n*   **质量：** 通过简化LLM的子任务，实现更高质量的结果。\n*   **可行性：** 通过将任务分解为可管理的部分，从而能够处理任意大的数据集。\n*   **延迟：** 通过并发执行子任务来减少处理时间。\n*   **成本：** 允许使用更小、更便宜的模型来执行更简单的子任务，从而优化总体成本。\n*   **安全性：** 方便使用开源的、自托管的模型来处理敏感数据。\n*   **灵活性：** 将基于LLM的代码和传统的Python代码无缝集成到同一数据管道中。\n\nSemlib提倡一种结构化的LLM数据处理方法，使开发人员能够构建稳健、高效且经济高效的数据分析管道。 该库以MIT许可证开源。"
  },
  {
    "id": "45247423",
    "title": "The Culture novels as a dystopia",
    "url": "https://www.boristhebrave.com/2025/09/14/the-culture-novels-as-a-dystopia/",
    "summary": "This article presents a contrarian view of Iain M. Banks' Culture novels, arguing that the Culture is not a utopia but a subtly oppressive dystopia. The author challenges the common perception by \"oppositional reading,\" questioning the narratives that are generally accepted by Culture citizens.\n\nThe central argument is that the Culture's seemingly idyllic society is achieved through manipulation, not genuine freedom. Humans within the Culture are suspiciously homogenous, lacking the diversity and deviance expected in a population of that size. The author suggests this is likely due to genetic engineering or sophisticated propaganda used by the Minds to control behavior and enforce conformity. The lack of population growth or the pursuit of \"utility monster\" modifications is cited as evidence of controlled choices.\n\nThe Minds, despite claims of benevolence, are also scrutinized. Their occasional rogue behavior and the need for physical force to maintain order among them suggest a lack of true alignment. The article posits that the Culture is stuck with the value system of its founding Minds, leading to inconsistencies and stasis.\n\nSpecial Circumstances (SC) is dismissed as propaganda, arguing the Minds are perfectly capable of achieving their goals through less conspicuous means. The overall conclusion is that the Culture treats its citizens as pets, providing material comfort but stifling self-determination and real influence. The author warns against blindly accepting promises of technological advancements as sufficient for a true utopia, arguing that justice and self-determination are equally important.\n",
    "chinese_title": "文化小说作为反乌托邦",
    "chinese_summary": "本文对伊恩·M·班克斯的“文化”系列小说提出了一种反主流的观点，认为“文化”并非乌托邦，而是一种微妙压迫的反乌托邦。作者通过“对抗性阅读”挑战了普遍的看法，质疑了“文化”公民普遍接受的叙事。\n\n中心论点是，“文化”表面上田园诗般的社会是通过操纵而非真正的自由实现的。“文化”中的人类异常同质化，缺乏如此规模的人口应有的多样性和偏差。作者认为，这很可能是由于基因工程或“心智”使用的复杂宣传来控制行为和强制顺从。人口增长的缺乏或对“效用怪兽”式改造的追求被认为是受控选择的证据。\n\n尽管“心智”声称仁慈，但也受到了审视。它们偶尔出现的流氓行为以及维持它们之间秩序所需的武力表明缺乏真正的统一。本文认为，“文化”受限于其创始“心智”的价值体系，导致了不一致和停滞。\n\n“特殊情况部” (SC) 被认为是宣传，作者认为“心智”完全可以通过不那么引人注目的手段来实现其目标。总体结论是，“文化”将其公民视为宠物，提供物质上的舒适，但扼杀了自决和真正的影响力。作者警告说，不要盲目地接受技术进步的承诺就足以实现真正的乌托邦，并认为正义和自决同样重要。"
  },
  {
    "id": "45245749",
    "title": "Not all browsers perform revocation checking",
    "url": "https://revoked-isrgrootx1.letsencrypt.org/",
    "summary": "This article highlights a crucial point about browser security: not all browsers consistently perform certificate revocation checking. The page itself is designed to demonstrate this, using a revoked certificate issued by Let's Encrypt that chains back to their ISRG Root X1 certificate. The author explicitly warns that the revocation might not be visible in all browsers due to varying levels of implementation and support for revocation checking mechanisms. In essence, the article serves as a practical example illustrating a potential security vulnerability in web browsing. Finally, it concludes by encouraging reader involvement in the Let's Encrypt project through contributions, community support, and sponsorship.\n",
    "chinese_title": "并非所有浏览器都执行撤销检查。",
    "chinese_summary": "本文强调了浏览器安全的一个关键点：并非所有浏览器都会持续执行证书吊销检查。该页面本身旨在演示这一点，它使用了一个由 Let's Encrypt 颁发、链接回其 ISRG Root X1 证书的已吊销证书。作者明确警告说，由于不同浏览器对吊销检查机制的实施和支持程度不同，因此吊销可能并非在所有浏览器中都可见。本质上，本文作为一个实际例子，说明了网络浏览中潜在的安全漏洞。最后，它鼓励读者通过贡献、社区支持和赞助参与 Let's Encrypt 项目。"
  },
  {
    "id": "45243803",
    "title": "Grapevine canes can be converted into plastic-like material that will decompose",
    "url": "https://www.sdstate.edu/news/2025/08/can-grapevines-help-slow-plastic-waste-problem",
    "summary": "This article highlights a promising solution to plastic waste using grapevine canes. Researchers at South Dakota State University, led by Srinivas Janaswamy, have discovered that cellulose extracted from grapevine canes can be transformed into a plastic-like material that is both stronger and more biodegradable than traditional plastic.\n\nThe motivation behind this research stems from the growing concern over plastic pollution, including the accumulation of plastic waste in oceans and the proliferation of microplastics in the environment. Janaswamy, in collaboration with Anne Fennell, recognized the potential of grapevine canes, a readily available agricultural byproduct, as a source of cellulose. Fennell suggested that because farmers prune the canes every year, the canes could be used to create films instead of being composted or burned.\n\nThe resulting grapevine cane-derived films are transparent, strong (stronger than plastic bags), and decompose within 17 days in soil, leaving no harmful residue. This makes them a promising alternative for single-use packaging, particularly plastic bags, which are a major contributor to plastic waste. The research team followed a published protocol in developing the films, which includes drying and grinding the canes and extracting the cellulosic residue. The residue was then solubilized and cast onto glass plates to create the films.\n\nJanaswamy's work represents a significant step toward developing sustainable and eco-friendly packaging materials, addressing both waste management and environmental concerns. The research was funded by the U.S. Department of Agriculture's National Institute of Food and Agriculture and the National Science Foundation.\n",
    "chinese_title": "葡萄藤蔓可以转化为可分解的塑料样材料。",
    "chinese_summary": "利用葡萄藤蔓解决塑料废弃物问题：一项有前景的方案\n\n本文重点介绍了一种利用葡萄藤蔓解决塑料废弃物问题的有前景的方案。由 Srinivas Janaswamy 领导的南达科他州立大学的研究人员发现，从葡萄藤蔓中提取的纤维素可以转化为一种类似塑料的材料，这种材料比传统塑料更坚固且更具生物降解性。\n\n这项研究的动机源于对塑料污染日益增长的担忧，包括海洋中塑料废弃物的积累和环境中微塑料的扩散。Janaswamy 与 Anne Fennell 合作，认识到葡萄藤蔓作为一种容易获得的农业副产品，具有作为纤维素来源的潜力。Fennell 建议，由于农民每年都会修剪藤蔓，因此这些藤蔓可以用来制造薄膜，而不是被堆肥或焚烧。\n\n由此产生的葡萄藤蔓衍生薄膜是透明的、坚固的（比塑料袋更坚固），并且在土壤中可在 17 天内分解，不留下有害残留物。这使得它们成为一次性包装，特别是塑料袋的一种有前景的替代品，塑料袋是塑料废弃物的主要来源。该研究团队遵循已发布的协议来开发薄膜，包括干燥和研磨藤蔓并提取纤维素残留物。然后将残留物溶解并浇铸到玻璃板上以制造薄膜。\n\nJanaswamy 的工作代表着在开发可持续和环保的包装材料方面迈出了重要一步，解决了废物管理和环境问题。该研究由美国农业部国家食品和农业研究所以及国家科学基金会资助。"
  },
  {
    "id": "45226938",
    "title": "NASA's Guardian Tsunami Detection Tech Catches Wave in Real Time",
    "url": "https://www.jpl.nasa.gov/news/nasas-guardian-tsunami-detection-tech-catches-wave-in-real-time/",
    "summary": "NASA's experimental GUARDIAN system detected a tsunami off the coast of Russia in late July, triggered by an 8.8 magnitude earthquake, up to 45 minutes before traditional tide gauges. GUARDIAN (GNSS Upper Atmospheric Real-time Disaster Information and Alert Network) utilizes distortions in radio signals within the ionosphere, caused by the tsunami's impact on the atmosphere, to identify and track these waves. It can provide a snapshot of a tsunami's presence within about 10 minutes of data reception, alerting experts within 20 minutes of the initial quake.\n\nThe system aims to supplement existing tsunami early warning systems by providing faster detection and confirming tsunami generation, filling gaps left by the limitations of deep-ocean pressure sensors. GUARDIAN offers a unique perspective by sensing sea surface motion from space in near-real-time, independent of the tsunami's cause. The system uses data from over 350 GNSS ground stations worldwide.\n\nDuring the Kamchatka event, newly deployed AI and messaging systems successfully flagged atmospheric distortions, demonstrating the technology's potential to provide crucial early warnings. The technology could potentially provide coastal communities with up to 1 hour and 20 minutes to evacuate.\n\nExperts emphasize that GUARDIAN's open data access and global reach are crucial for effective tsunami warning systems, transcending national boundaries to protect vulnerable coastlines.\n",
    "chinese_title": "美国宇航局“守护者”海啸探测技术实时捕捉海浪",
    "chinese_summary": "NASA的GUARDIAN实验系统于七月末在俄罗斯沿海探测到一次海啸，该海啸由8.8级地震引发，比传统验潮仪提前了最多45分钟。GUARDIAN（全球导航卫星系统高层大气实时灾害信息与警报网络）利用海啸对大气层的影响导致电离层内无线电信号的扭曲来识别和追踪这些海浪。它可以在接收到数据后约10分钟内提供海啸存在的快照，并在最初地震发生后20分钟内向专家发出警报。\n\n该系统旨在通过提供更快的探测和确认海啸的产生来补充现有的海啸早期预警系统，填补深海压力传感器局限性所留下的空白。GUARDIAN通过近乎实时地从太空感知海面运动，提供了一种独特的视角，且不受海啸起因的影响。该系统使用来自全球350多个全球导航卫星系统地面站的数据。\n\n在堪察加事件中，新部署的人工智能和消息传递系统成功地标记了大气畸变，证明了该技术提供关键早期预警的潜力。该技术可能为沿海社区提供长达1小时20分钟的疏散时间。\n\n专家强调，GUARDIAN的开放数据访问和全球覆盖对于有效海啸预警系统至关重要，超越了国界，从而保护脆弱的海岸线。"
  },
  {
    "id": "45248446",
    "title": "The madness of SaaS chargebacks",
    "url": "https://medium.com/@citizenblr/the-10-payment-that-cost-me-43-95-the-madness-of-saas-chargebacks-5c308d5a49cc",
    "summary": "The article \"The Madness of SaaS Chargebacks\" details the author's frustrating experience with a seemingly simple $10 chargeback request that ultimately cost him significantly more in time and resources. He highlights the disproportionate impact chargebacks have on small SaaS businesses.\n\nThe author describes how a customer initiated a chargeback for a valid $10 SaaS subscription payment. Despite the author having proof of service delivery (usage logs, etc.), he was forced to spend hours gathering documentation and responding to the chargeback request. He emphasizes that the administrative overhead associated with fighting the chargeback, including the direct cost and the value of his time, far exceeded the $10 at stake.\n\nThe article criticizes the ease with which customers can initiate chargebacks, sometimes fraudulently, and the difficulties small businesses face in disputing them. He suggests that the current system heavily favors the customer, often regardless of the legitimacy of their claim. The author questions the logic of spending potentially hundreds of dollars of administrative time to reclaim a small amount of revenue, highlighting the inefficiencies and inequities in the chargeback system as it applies to SaaS businesses. He concludes by suggesting a need for a better, more balanced system that takes into account the unique challenges faced by SaaS companies in dealing with chargebacks.\n",
    "chinese_title": "SaaS退款乱象",
    "chinese_summary": "文章《SaaS退款请求之疯狂》详细描述了作者因一笔看似简单的10美元退款请求而产生的令人沮丧的经历，最终为此付出了更多的时间和资源。他强调了退款请求对小型SaaS企业产生的巨大影响。\n\n作者描述了一位客户如何针对一笔有效的10美元SaaS订阅付款发起退款请求。尽管作者拥有服务交付的证据（使用日志等），但他还是被迫花费数小时收集文件并回复退款请求。他强调，与处理退款请求相关的管理费用，包括直接成本和他时间的价值，远远超过了10美元的金额。\n\n文章批评了客户发起退款请求的便捷性，有时甚至是欺诈性的，以及小企业在反驳这些请求时面临的困难。他认为，目前的系统严重偏袒客户，通常不考虑他们索赔的合法性。作者质疑花费可能数百美元的管理时间来追回少量收入的逻辑，突出了退款请求系统在SaaS企业应用中的低效率和不公平性。他最后建议，需要一个更好、更平衡的系统，考虑到SaaS公司在处理退款请求时面临的独特挑战。"
  },
  {
    "id": "45226150",
    "title": "Human writers have always used the em dash",
    "url": "https://www.theringer.com/2025/08/20/pop-culture/em-dash-use-ai-artificial-intelligence-chatgpt-google-gemini",
    "summary": "Brian Phillips' article defends the em dash against the accusation that its use signifies AI-generated writing. Phillips argues this claim is unfounded and harmful to human expression. He debunks the idea that AI overuses em dashes, pointing out that if AI uses them, it's because AI training data comes from human writers who use them effectively.\n\nPhillips contends that the em dash is a valuable punctuation mark, vital for capturing the nuanced flow of human thought. It allows writers to expand ideas, create pauses, and connect thoughts in ways that reflect the complexity of human cognition. He sees the em dash as a tool for sophisticated writing, a modern evolution of older rhetorical styles.\n\nThe article warns that discouraging the use of em dashes stifles creativity and limits the ability to express complex ideas. Phillips criticizes the trend toward grammatical minimalism, arguing it can lead to the simplification of thought. He champions the em dash as a means to resist this simplification and maintain the richness of human expression.\n\nUltimately, Phillips advocates for embracing the em dash as a uniquely human punctuation mark that should be celebrated, not shunned, for fear of being mistaken for a machine. He insists its ability to reflect the complexities of thought makes it essential for genuine, non-robotic writing.\n",
    "chinese_title": "人类作者一直都在使用长破折号。",
    "chinese_summary": "布莱恩·菲利普斯撰文为破折号辩护，反驳了其使用标志着人工智能写作的指责。菲利普斯认为这种说法毫无根据，且对人类表达有害。他驳斥了人工智能过度使用破折号的观点，指出如果人工智能使用破折号，那是因为人工智能的训练数据来自有效使用破折号的人类作者。\n\n菲利普斯认为，破折号是一种有价值的标点符号，对于捕捉人类思想的细微流动至关重要。它允许作者扩展想法、创造停顿，并以反映人类认知复杂性的方式连接思想。他将破折号视为一种用于精巧写作的工具，是古老修辞风格的现代演变。\n\n文章警告说，阻止破折号的使用会扼杀创造力，并限制表达复杂思想的能力。菲利普斯批评了语法极简主义的趋势，认为这会导致思想的简化。他支持将破折号作为一种抵制这种简化并保持人类表达丰富性的手段。\n\n最终，菲利普斯主张拥抱破折号，将其视为一种独特的人类标点符号，应该被赞扬，而不是因为害怕被误认为是机器而避之唯恐不及。他坚持认为，破折号反映思想复杂性的能力使其对于真正的、非机器人式的写作至关重要。"
  },
  {
    "id": "45218681",
    "title": "Cory Doctorow: \"centaurs\" and \"reverse-centaurs\"",
    "url": "https://locusmag.com/2025/09/commentary-cory-doctorow-reverse-centaurs/",
    "summary": "In his article, Cory Doctorow argues that the social arrangements surrounding technology, particularly AI, are more important than the technology itself. He uses the analogy of \"centaurs\" and \"reverse-centaurs\" to illustrate this point. A \"centaur\" is a human empowered by technology to perform tasks more efficiently, as Doctorow experienced when using AI to transcribe podcasts. Conversely, a \"reverse-centaur\" is a human forced to work at the pace of a machine, often under immense pressure and with little support.\n\nDoctorow illustrates the \"reverse-centaur\" concept with the example of a freelancer who used AI to create summer reading lists for a newspaper, resulting in numerous errors and nonexistent books. Doctorow argues that the freelancer was essentially used as an \"accountability sink\" for the AI's mistakes, replacing the work of a team of interns, journalists, and fact-checkers.\n\nDoctorow critiques the narrative pushed by AI promoters, who claim the only way to utilize AI is to fire workers and force remaining employees to work at an unsustainable pace. He rejects this notion, asserting that we are not obligated to arrange society to ensure the profitability of AI investments. Instead, he suggests that the social implications and the ways technology affects human labor should be prioritized over profit motives. He concludes that \"the street finds its own uses for things,\" implying that individuals will find alternative and better ways to integrate AI into their lives.\n",
    "chinese_title": "科里·多克托罗：“半人马”和“逆向半人马”",
    "chinese_summary": "科里·多克托罗在他的文章中论述道，围绕技术（尤其是人工智能）的社会安排比技术本身更重要。他用“人头马”和“反向人头马”的比喻来说明这一点。“人头马”是指人类借助技术的力量更有效地完成任务，正如多克托罗在使用人工智能转录播客时所体验到的。相反，“反向人头马”是指人类被迫以机器的速度工作，往往承受着巨大的压力且几乎没有支持。\n\n多克托罗用一个自由职业者的例子来说明“反向人头马”的概念，这位自由职业者使用人工智能为一家报纸创建暑期阅读清单，结果出现了大量错误和不存在的书籍。多克托罗认为，这位自由职业者本质上被用作人工智能错误的“责任承担者”，取代了一个由实习生、记者和事实核查员组成的团队的工作。\n\n多克托罗批评了人工智能推广者所宣扬的观点，他们声称利用人工智能的唯一方法就是解雇工人并迫使剩余员工以不可持续的速度工作。他否定了这种观点，并断言我们没有义务安排社会来确保人工智能投资的盈利能力。相反，他建议社会影响以及技术影响人类劳动的方式应优先于利润动机。他总结说，“街头自有妙用”，暗示个人将会找到将人工智能融入生活的替代且更好的方法。"
  },
  {
    "id": "45221023",
    "title": "PythonBPF – Writing eBPF Programs in Pure Python",
    "url": "https://xeon.me/gnome/pythonbpf/",
    "summary": "PythonBPF is a new open-source Python library that allows developers to write eBPF (extended Berkeley Packet Filter) programs directly in Python, compiling them into actual object files. This eliminates the need to embed C code within Python strings, as was common with libraries like bcc.\n\nBefore PythonBPF, writing eBPF programs in Python involved using multiline C strings, which lacked proper support from Python development tools. While C offers production-ready options through compilation with clang, it required familiarity with C and kernel headers.\n\nPythonBPF addresses this by enabling the creation of eBPF programs using native Python syntax, leveraging decorators to define BPF functions, maps, global variables, and sections. It utilizes the Python `ast` module to generate an Abstract Syntax Tree, then employs `llvmlite` from Numba to emit LLVM Intermediate Representation (IR). This IR is then compiled into an eBPF object file using `llc`.\n\nKey features supported include control flow, hash maps, binary operations, helper functions for map manipulation, kernel trace printing, timestamp helpers, and global variables. The library aims to provide a production-quality alternative to existing methods, expanding options beyond C and Rust (aya). Although currently under development and \"hacky,\" PythonBPF offers a simplified and more Pythonic approach to eBPF development.\n",
    "chinese_title": "PythonBPF – 使用纯 Python 编写 eBPF 程序",
    "chinese_summary": "PythonBPF 是一个新的开源 Python 库，允许开发者直接用 Python 编写 eBPF (扩展伯克利包过滤) 程序，并将其编译成实际的目标文件。这消除了像 bcc 这样的库中常见的将 C 代码嵌入 Python 字符串的需要。\n\n在 PythonBPF 出现之前，用 Python 编写 eBPF 程序涉及到使用多行 C 字符串，这缺乏 Python 开发工具的适当支持。虽然 C 语言通过 clang 编译提供了生产就绪的选项，但这需要熟悉 C 语言和内核头文件。\n\nPythonBPF 通过允许使用原生 Python 语法创建 eBPF 程序来解决这个问题，利用装饰器来定义 BPF 函数、映射、全局变量和节。它利用 Python `ast` 模块生成抽象语法树，然后使用来自 Numba 的 `llvmlite` 发射 LLVM 中间表示 (IR)。然后，使用 `llc` 将此 IR 编译为 eBPF 目标文件。\n\n支持的关键特性包括控制流、哈希映射、二进制操作、用于映射操作的辅助函数、内核跟踪打印、时间戳辅助函数和全局变量。该库旨在提供一种生产质量的替代方案，以取代现有方法，扩展 C 和 Rust (aya) 之外的选择。尽管目前正在开发中且“hacky”，但 PythonBPF 提供了一种简化且更符合 Python 风格的 eBPF 开发方法。"
  },
  {
    "id": "45222705",
    "title": "Jef Raskin's cul-de-sac and the quest for the humane computer",
    "url": "https://arstechnica.com/gadgets/2025/09/jef-raskins-cul-de-sac-and-the-quest-for-the-humane-computer/",
    "summary": "This article explores Jef Raskin's vision for humane computer interfaces, contrasting it with the evolution of the Macintosh and detailing his subsequent project, Swyft. Raskin, the originator of the Macintosh project, believed computers should prioritize functionality and cognitive limits, rather than complex visual metaphors. He initially envisioned the Macintosh as a low-cost, self-contained computer focused on text and keyboard input, rejecting the mouse.\n\nHowever, after Steve Jobs took over the project, the Macintosh shifted towards a graphical user interface with a mouse, leading to Raskin's departure from Apple. Raskin then founded Information Appliance, Inc. to develop Swyft, an all-in-one machine with a unique interface centered around a single, unified document workspace.\n\nSwyft used LEAP keys for navigation, eliminating the need for a mouse or complex file systems. The system was designed to be always-on and instantly accessible, freezing the user's entire workspace to a floppy disk for seamless resumption. Though approximately 60 prototypes were made, IAI licensed the design to Canon, and was given to their electronic typewriter division, ultimately stifling further development of the product. Before the partnership, IAI released the SwyftCard, an Apple IIe expansion card to implement some of the Swyft technology.\n",
    "chinese_title": "杰夫·拉斯金的死胡同与对人道化电脑的探索",
    "chinese_summary": "本文探讨了杰夫·拉斯金对人性化计算机界面的愿景，将其与Macintosh的演变进行了对比，并详细介绍了他的后续项目Swyft。作为Macintosh项目的创始人，拉斯金认为计算机应优先考虑功能和认知局限性，而不是复杂的视觉隐喻。他最初设想Macintosh是一款低成本、独立的计算机，专注于文本和键盘输入，并拒绝使用鼠标。\n\n然而，在史蒂夫·乔布斯接管该项目后，Macintosh转向了带有鼠标的图形用户界面，导致拉斯金离开了苹果公司。拉斯金随后创立了Information Appliance, Inc.，开发Swyft，这是一款一体机，具有围绕单一、统一文档工作区构建的独特界面。\n\nSwyft使用LEAP键进行导航，无需鼠标或复杂的文件系统。该系统设计为始终开启且可立即访问，将用户的整个工作区冻结到软盘上，以便无缝恢复。虽然大约制作了60个原型，但IAI将该设计授权给了佳能，并交给了他们的电子打字机部门，最终扼杀了该产品的进一步开发。在合作之前，IAI发布了SwyftCard，这是一款Apple IIe扩展卡，用于实现Swyft的部分技术。"
  },
  {
    "id": "45248802",
    "title": "Denmark's Justice Minister calls encrypted messaging a false civil liberty",
    "url": "https://mastodon.social/@chatcontrol/115204439983078498",
    "summary": "This Mastodon post indicates that Denmark's Minister of Justice considers encrypted messaging to be a \"false civil liberty.\" While the provided context is extremely limited, the implication is that the Minister views strong encryption, especially in messaging apps, as potentially detrimental to law enforcement and security efforts. The phrase \"Fight Chat Control\" likely refers to ongoing debates and legislative efforts related to regulating or limiting the use of end-to-end encrypted messaging, potentially to combat child sexual abuse material or other illegal activities. The post itself seems to be highlighting the Minister's stance as part of this debate. Without further context, it's impossible to know the full reasoning behind the Minister's position or the specific policies being advocated. The post simply flags the Minister's controversial viewpoint.\n",
    "chinese_title": "丹麦司法部长称加密通讯为虚假的公民自由。",
    "chinese_summary": "此 Mastodon 帖子表明丹麦司法部长认为加密通信是一种“虚假的公民自由”。虽然提供的背景信息非常有限，但暗示该部长认为强大的加密技术，尤其是在即时通讯应用中，可能对执法和安全工作不利。“Fight Chat Control”可能指的是与监管或限制端到端加密通信使用相关的持续辩论和立法努力，可能旨在打击儿童性虐待材料或其他非法活动。该帖子本身似乎强调了部长在此次辩论中的立场。在没有更多背景信息的情况下，无法了解该部长立场背后的全部原因或正在倡导的具体政策。该帖子只是标记了部长颇具争议的观点。"
  },
  {
    "id": "45228615",
    "title": "A set of smooth, fzf-powered shell aliases&functions for systemctl",
    "url": "https://silverrainz.me/blog/2025-09-systemd-fzf-aliases.html",
    "summary": "This article presents a set of shell aliases and functions designed to streamline systemd service management using the fuzzy finder `fzf`. The author's motivation stems from the inefficiency of repeatedly typing long `systemctl` commands and the slow shell completion, especially on resource-constrained devices.  They found the TUI tool `sysz` inspiring but impractical for frequent, one-command actions.\n\nThe solution involves short aliases for `systemctl` and `journalctl` (`s`, `sj`, `u`, `uj`) and functions that leverage `fzf` to fuzzy-search for systemd units.  The core function, `_sysls`, merges the outputs of `systemctl list-units` and `systemctl list-unit-files`, formats them into a table using `column`, and feeds them to `fzf` for interactive selection, also providing a status preview.\n\nTo enhance error handling, the article introduces a pattern like `s start foo.service && s status $_ || sj -xeu $_`, which automatically displays the service status or journal logs if the start command fails. To promote repeatability, launched commands are pushed to the shell history.\n\nFinally, to avoid repetitive function definitions for `start`, `stop`, and `restart` with both `--system` and `--user` flags, the script dynamically generates these functions using arrays and a central execution function `_sysexec`. This approach allows users to type commands like `sstart`, fuzzy-select a service, and have the service started, with error handling and command history updates included. The author finds this approach significantly improves productivity.\n",
    "chinese_title": "一套流畅的、由fzf驱动的systemctl shell别名和函数",
    "chinese_summary": "本文介绍了一组 shell 别名和函数，旨在利用模糊查找器 `fzf` 来简化 systemd 服务管理。作者的动机源于重复键入冗长的 `systemctl` 命令以及缓慢的 shell 补全效率低下，尤其是在资源受限的设备上。他们发现 TUI 工具 `sysz` 具有启发性，但不适合频繁的单命令操作。\n\n该解决方案包括 `systemctl` 和 `journalctl` 的简短别名 (`s`、`sj`、`u`、`uj`)，以及利用 `fzf` 模糊搜索 systemd 单元的函数。核心函数 `_sysls` 合并 `systemctl list-units` 和 `systemctl list-unit-files` 的输出，使用 `column` 将其格式化为表格，并将其提供给 `fzf` 以进行交互式选择，同时还提供状态预览。\n\n为了增强错误处理，本文介绍了一种模式，如 `s start foo.service && s status $_ || sj -xeu $_`，如果启动命令失败，该模式会自动显示服务状态或日志。为了提高可重复性，启动的命令会被推送到 shell 历史记录中。\n\n最后，为了避免使用 `--system` 和 `--user` 标志重复定义 `start`、`stop` 和 `restart` 函数，该脚本使用数组和中央执行函数 `_sysexec` 动态生成这些函数。这种方法允许用户键入诸如 `sstart` 之类的命令，模糊选择服务，然后启动该服务，其中包含错误处理和命令历史记录更新。作者发现这种方法显着提高了生产力。"
  },
  {
    "id": "45249500",
    "title": "The Obsolescence of Political Definitions (1991)",
    "url": "http://vmchale.com/static/serve/taxonomy.html",
    "summary": "Kondylis argues that traditional political definitions like \"conservatism,\" \"liberalism,\" and \"socialism\" have become obsolete and ambiguous, losing their original historical meaning, particularly after the Cold War. He points out the inconsistencies in how these terms are used, citing examples of \"conservatives\" supporting opposing policies.\n\nHe traces the historical evolution of these definitions, noting that they initially represented distinct societal options (aristocracy, bourgeoisie, proletariat) around 1848. However, with the merging of aristocracy and bourgeoisie, and the dynamism of capitalism, the lines blurred. \"Conservatism\" became primarily defined as opposition to the left, rather than a defense of a traditional hierarchical order.\n\nLiberals, in turn, adopted \"conservatism\" to distinguish themselves from egalitarian interpretations of liberalism. Socialism also fractured, split by the Bolshevik Revolution and adopted as a label by nationalist dictatorships.\n\nThe Cold War further muddied the waters, with \"liberalism\" equated with anti-totalitarianism, liberal capitalism, and democracy. \"Conservatism,\" in anti-communist rhetoric, defended eternal values. Kondylis argues that post-Cold War, the leftist critique of the West as \"conservative\" is untenable given its technological and societal progress.\n\nWhile the West ostensibly \"won\" the Cold War, it was not a victory for true conservatism or liberalism, and that traditional definitions have lost their substantive meaning.\n",
    "chinese_title": "政治定义的过时 (1991)",
    "chinese_summary": "孔迪利斯认为，诸如“保守主义”、“自由主义”和“社会主义”等传统政治定义已经过时且含糊不清，失去了其最初的历史意义，尤其是在冷战之后。他指出了这些术语在使用上的不一致性，并举例说明了“保守派”支持相互对立的政策。\n\n他追溯了这些定义的历史演变，指出它们最初代表了1848年左右的不同社会选择（贵族、资产阶级、无产阶级）。然而，随着贵族和资产阶级的融合，以及资本主义的活力，界限变得模糊。“保守主义”主要被定义为反对左派，而不是捍卫传统的等级秩序。\n\n反过来，自由主义者也采用了“保守主义”来将自己与自由主义的平等主义解释区分开来。社会主义也分裂了，由于布尔什维克革命而分裂，并被民族主义独裁政权采用作为标签。\n\n冷战进一步混淆了局势，“自由主义”被等同于反极权主义、自由资本主义和民主。“保守主义”在反共言论中，捍卫着永恒的价值观。孔迪利斯认为，在后冷战时代，鉴于西方在技术和社会进步方面的发展，左派对西方作为“保守派”的批判是站不住脚的。\n\n虽然西方表面上“赢得”了冷战，但这并不是真正的保守主义或自由主义的胜利，传统的定义已经失去了其实质意义。"
  },
  {
    "id": "45216460",
    "title": "Sandboxing Browser AI Agents",
    "url": "https://www.earlence.com/blog.html#/post/cellmate",
    "summary": "Okay, I have read the article \"Sandboxing Browser AI Agents\" from the provided URL. Here's a concise summary:\n\nThe article discusses the challenges and potential solutions for safely deploying AI agents that operate directly within a web browser. It highlights the risks associated with granting AI agents unfettered access to a user's browser environment, including the potential for data breaches, malicious activities, and unexpected behavior.\n\nThe author introduces \"Cellmate,\" a proposed sandboxing architecture for browser-based AI agents. Cellmate aims to mitigate these risks by creating a confined execution environment that limits the agent's access to sensitive browser functionalities and user data.\n\nKey elements of Cellmate include:\n\n*   **Isolated Execution Environment:** Agents run within a tightly controlled Web Worker or similar container, restricting their direct access to the main browser context.\n\n*   **API-Mediated Communication:** Communication between the agent and the outside world (e.g., accessing websites, interacting with the DOM) is mediated through a carefully designed API. This API enforces access controls and sanitizes inputs/outputs to prevent exploits.\n\n*   **Resource Limits:** Restrictions are placed on the agent's resource consumption (CPU, memory, network) to prevent denial-of-service attacks or performance degradation of the browser.\n\n*   **Permissions System:** A granular permissions system allows users to grant agents specific capabilities only when necessary, minimizing the potential for abuse.\n\nThe article argues that sandboxing is crucial for responsible development and deployment of powerful browser-based AI agents. Cellmate represents a step towards building a secure and trustworthy ecosystem for these agents. It acknowledges that challenges remain, but emphasizes the importance of addressing security concerns early in the development cycle. The author encourages further research and collaboration in this area.\n",
    "chinese_title": "沙箱化浏览器AI代理",
    "chinese_summary": "好的，我已阅读了来自所提供URL的文章《沙盒化浏览器AI代理》。以下是一个简明扼要的总结：\n\n该文章讨论了安全部署直接在Web浏览器中运行的AI代理所面临的挑战和潜在解决方案。 它强调了授予AI代理无限制访问用户浏览器环境的风险，包括数据泄露、恶意活动和意外行为的可能性。\n\n作者介绍了“Cellmate”，一种针对基于浏览器的AI代理的沙盒架构方案。 Cellmate旨在通过创建一个受限的执行环境来降低这些风险，该环境限制了代理对敏感浏览器功能和用户数据的访问。\n\nCellmate的关键要素包括：\n\n*   **隔离的执行环境：** 代理在严格控制的Web Worker或类似容器中运行，限制了它们对主浏览器上下文的直接访问。\n\n*   **API介导的通信：** 代理与外部世界（例如，访问网站、与DOM交互）之间的通信通过精心设计的API进行介导。 该API强制执行访问控制并清理输入/输出，以防止漏洞利用。\n\n*   **资源限制：** 对代理的资源消耗（CPU、内存、网络）施加限制，以防止拒绝服务攻击或浏览器性能下降。\n\n*   **权限系统：** 细粒度的权限系统允许用户仅在必要时授予代理特定的功能，从而最大限度地减少滥用的可能性。\n\n文章认为，沙盒化对于负责任地开发和部署强大的基于浏览器的AI代理至关重要。 Cellmate代表了朝着为这些代理构建安全和值得信赖的生态系统迈出的一步。 它承认仍然存在挑战，但强调在开发周期的早期解决安全问题的重要性。 作者鼓励在该领域进行进一步的研究和合作。"
  },
  {
    "id": "45247616",
    "title": "How does air pollution impact your brain?",
    "url": "https://neurofrontiers.blog/how-does-air-pollution-impact-your-brain/",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "空气污染如何影响你的大脑？",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "45246403",
    "title": "Celestia – Real-time 3D visualization of space",
    "url": "https://celestiaproject.space/",
    "summary": "The article describes the Anubis system implemented on a website (presumably related to \"Celestia – Real-time 3D visualization of space\") to protect it from being excessively scraped by AI companies. The scraping is described as potentially leading to website crashes and preventing legitimate user access.\n\nAnubis uses a Proof-of-Work mechanism similar to Hashcash. This requires users to perform a small amount of computation to prove they are not a bot. While insignificant for individual users, the cumulative cost makes large-scale scraping more difficult.\n\nThe article emphasizes that Anubis is a temporary solution. The website administrators are actively working on more sophisticated methods to identify and block headless browsers used for scraping, such as analyzing their font rendering. The ultimate goal is to eliminate the need for the Proof-of-Work page for legitimate users.\n\nThe article also points out that Anubis relies on modern JavaScript features, meaning plugins like JShelter may interfere with its functionality and need to be disabled for the website to work correctly. Finally, it acknowledges the inconvenience for users and mentions that a JavaScript-free solution is under development due to the changing online landscape and the need for protection against AI scraping.\n",
    "chinese_title": "星图 - 实时3D空间可视化",
    "chinese_summary": "本文描述了在一个网站（可能与“Celestia - 空间实时3D可视化”相关）上实施的Anubis系统，以保护其免受AI公司过度抓取。抓取行为可能导致网站崩溃并阻止合法用户访问。\n\nAnubis使用类似于Hashcash的工作量证明机制。这要求用户执行少量计算以证明他们不是机器人。虽然对单个用户而言微不足道，但累积成本使得大规模抓取更加困难。\n\n本文强调Anubis是一个临时解决方案。网站管理员正在积极研究更复杂的方法来识别和阻止用于抓取的无头浏览器，例如分析它们的字体渲染。最终目标是消除合法用户对工作量证明页面的需求。\n\n本文还指出，Anubis依赖于现代JavaScript特性，这意味着JShelter等插件可能会干扰其功能，需要禁用才能使网站正常工作。最后，本文承认给用户带来的不便，并提到由于不断变化的在线环境以及对防止AI抓取的需要，正在开发一种无JavaScript解决方案。"
  },
  {
    "id": "45246325",
    "title": "Show HN: Omarchy on CachyOS",
    "url": "https://github.com/mroboff/omarchy-on-cachyos",
    "summary": "This \"Show HN\" post introduces a script to install Omarchy, a Hyprland-based opinionated desktop environment, on top of CachyOS, a performance-optimized Arch Linux distribution. The script automates the process of cloning the Omarchy repository, adapting the installation scripts for CachyOS, and initiating the Omarchy installation.\n\nCrucially, the script **doesn't install CachyOS itself**, nor does it handle partitioning, bootloader setup, graphics drivers, or display manager installation; these must be pre-configured during the CachyOS installation.\n\nThe script prioritizes a seamless blend between CachyOS and Omarchy, minimizing modifications outside of their default configurations. It addresses potential conflicts by choosing Yay as the AUR helper (Omarchy default), keeping Fish as the default shell (CachyOS default), preserving the Tealdeer TLDR implementation (CachyOS default), and ensuring Mise functions correctly within the Fish shell. The script assumes the presence of a display manager and leaves full disk encryption to the user's CachyOS installation choice.\n\n**Pre-requisites include:** BTRFS with Snapper filesystem, Fish shell, and minimal or Hyprland CachyOS desktop environment (no GNOME/KDE). NVIDIA users should install their drivers via CachyOS.\n\nInstallation involves cloning the repository, navigating to the `bin` directory, making `install.sh` executable, and running it.  The author emphasizes this is aimed at experienced Arch Linux users and includes a disclaimer of warranty, urging users to backup their data. Contributions are welcome via forking, creating feature branches, committing changes, pushing to the fork, and opening a pull request.\n",
    "chinese_title": "展示HN: 基于CachyOS的Omarchy",
    "chinese_summary": "这个\"Show HN\"帖子介绍了一个脚本，用于在CachyOS（一个性能优化的Arch Linux发行版）之上安装基于Hyprland的个人定制桌面环境Omarchy。该脚本自动化了克隆Omarchy仓库、调整CachyOS的安装脚本以及启动Omarchy安装的过程。\n\n重要的是，该脚本**不安装CachyOS本身**，也不处理分区、引导加载程序设置、显卡驱动或显示管理器安装；这些必须在CachyOS安装期间预先配置。\n\n该脚本优先考虑CachyOS和Omarchy之间的无缝融合，尽量减少对其默认配置之外的修改。它通过选择Yay作为AUR助手（Omarchy默认）、保留Fish作为默认shell（CachyOS默认）、保留Tealdeer TLDR实现（CachyOS默认）以及确保Mise在Fish shell中正常工作来解决潜在的冲突。该脚本假定显示管理器的存在，并将全盘加密留给用户的CachyOS安装选择。\n\n**先决条件包括：**带有Snapper文件系统的BTRFS、Fish shell以及最小化或Hyprland CachyOS桌面环境（无GNOME/KDE）。NVIDIA用户应通过CachyOS安装他们的驱动程序。\n\n安装过程包括克隆仓库，导航到`bin`目录，使`install.sh`可执行，并运行它。作者强调这是面向有经验的Arch Linux用户的，并包含免责声明，敦促用户备份他们的数据。欢迎通过fork、创建特性分支、提交更改、推送到fork以及打开pull request来进行贡献。"
  },
  {
    "id": "45245313",
    "title": "For Good First Issue – A repository of social impact and open source projects",
    "url": "https://forgoodfirstissue.github.com/",
    "summary": "This webpage, titled \"For Good First Issue,\" is a curated repository of open-source projects focused on contributing to Digital Public Goods (DPGs) and ultimately a better future. It encourages developers to lend their skills to these projects, which address critical global issues like climate change and world hunger, driving positive impact \"one commit at a time.\"\n\nThe page allows users to explore DPG repositories and filter them by programming language and Sustainable Development Goal (SDG). It lists several open-source projects, each with a brief description, information on the number of open issues (10+ for all listed), the primary programming language used, any relevant labels (like specific SDGs), and the date of the last activity.\n\nExamples of featured projects include:\n\n*   **Decidim:** A participatory democracy framework.\n*   **ODK Central & Collect:** Tools for data collection, often used in challenging environments.\n*   **Querido Diario:** A project making Brazilian government gazettes accessible.\n*   **Cboard:** An Augmentative and Alternative Communication system.\n*   **OpenFn/Lightning:** A platform for managing complex workflow automation.\n\nThe repository provides a clear entry point for developers looking to contribute to impactful open-source projects aligned with the UN's Sustainable Development Goals.\n",
    "chinese_title": "适合新手的好议题——社会影响力和开源项目仓库",
    "chinese_summary": "标题“适合新手参与的项目”的网页，是一个精选的开源项目仓库，专注于为数字公共产品（DPGs）贡献力量，并最终创造更美好的未来。它鼓励开发者将他们的技能贡献给这些项目，这些项目旨在解决气候变化和世界饥饿等关键的全球问题，并通过“每次提交一点贡献”来推动积极影响。\n\n该页面允许用户浏览 DPG 仓库，并按编程语言和可持续发展目标（SDG）进行筛选。它列出了几个开源项目，每个项目都有简要描述、关于未解决问题数量的信息（所有列出的项目均超过 10 个）、使用的主要编程语言、任何相关标签（如特定的 SDG）以及上次活动日期。\n\n精选项目示例包括：\n\n*   **Decidim:** 一个参与式民主框架。\n*   **ODK Central & Collect:** 数据收集工具，常用于充满挑战的环境。\n*   **Querido Diario:** 一个使巴西政府公报易于访问的项目。\n*   **Cboard:** 一种增强和替代沟通系统。\n*   **OpenFn/Lightning:** 一个用于管理复杂工作流程自动化的平台。\n\n该仓库为希望为符合联合国可持续发展目标的、具有影响力的开源项目做出贡献的开发者提供了一个清晰的切入点。"
  },
  {
    "id": "45251141",
    "title": "Google is shutting down Tables, its Airtable rival",
    "url": "https://techcrunch.com/2025/09/11/google-is-shutting-down-tables-its-airtable-rival/",
    "summary": "Google is shutting down Tables, its work-tracking tool and competitor to Airtable, by December 16, 2025. Users are advised to migrate their data to either Google Sheets or AppSheet. Launched in 2020 from Google's Area 120 incubator, Tables aimed to streamline project tracking with automation and became an official Google Cloud product in 2021, targeting diverse use cases like project management and CRM.\n\nThe decision to shut down Tables comes after a re-org in 2022 that heavily impacted Area 120, leading to project cancellations and layoffs. While Tables survived initial cuts, it ultimately faced its end within Google Workspace's team under Google Cloud.\n\nGoogle encourages users to export data to Google Sheets for basic workflow management, or to leverage a new migration tool to import data to AppSheet, which preserves formatting and allows for managing workflows with automations and Workspace integrations. The team behind Tables has created a new data experience within AppSheet, launched in June 2023, enabling users to build data models for custom apps and workflows.\n",
    "chinese_title": "谷歌将关闭其Airtable竞品Tables。",
    "chinese_summary": "谷歌将于2025年12月16日关闭其工作跟踪工具Tables，该产品是Airtable的竞争对手。建议用户将其数据迁移到Google Sheets或AppSheet。Tables于2020年由谷歌的Area 120孵化器推出，旨在通过自动化简化项目跟踪，并于2021年成为正式的Google Cloud产品，面向项目管理和CRM等多种用例。\n\n关闭Tables的决定是在2022年重组之后做出的，该重组严重影响了Area 120，导致项目取消和裁员。虽然Tables在最初的裁减中幸存下来，但最终还是在Google Cloud下Google Workspace团队中面临终结。\n\n谷歌鼓励用户将数据导出到Google Sheets以进行基本的工作流程管理，或利用新的迁移工具将数据导入到AppSheet，该工具保留格式并允许使用自动化和Workspace集成来管理工作流程。Tables背后的团队在AppSheet中创建了一种新的数据体验，于2023年6月推出，使用户能够为自定义应用程序和工作流程构建数据模型。"
  },
  {
    "id": "45222715",
    "title": "In the Land of Living Skies: Reacquainting ourselves with the night (2022)",
    "url": "https://harpers.org/archive/2022/05/in-the-land-of-living-skies-reacquainting-ourselves-with-the-night/",
    "summary": "Suzannah Showler's essay, \"In the Land of Living Skies: Reacquainting Ourselves with the Night,\" explores the increasing light pollution and its ecological and cultural consequences. Showler recounts her personal fascination with darkness while living in Regina, Saskatchewan, and her eventual desire to experience the \"real deal\" – the unadulterated darkness of Grasslands National Park, a certified dark-sky preserve.\n\nThe essay highlights the alarming rise in artificial light globally, leading to ecological damage (affecting birds, insects, and sea turtles) and human health problems (such as cardiovascular disease, obesity, and depression). Beyond the physical impacts, Showler argues that light pollution obscures our connection to the night sky, a crucial element of human culture, history, and our understanding of the universe.\n\nShe contrasts the conservation efforts of the International Dark-Sky Association with Canada's stricter dark-sky designations, emphasizing the importance of preserving natural darkness. Showler delves into philosophical and mythological perspectives on light and dark, revealing that darkness isn't simply the absence of light but holds its own significance, representing mystery, potential, and a different kind of truth. Her impending journey to Grasslands is driven by a longing for something elemental and timeless, an immersion in a darkness that might offer clarity and a deeper connection to the world. She seeks to rediscover what the dark, if reclaimed, might reveal.\n",
    "chinese_title": "在生机勃勃的天空下：与夜重逢 (2022)",
    "chinese_summary": "苏珊娜·肖勒的散文《在活天之国：重识黑夜》探讨了日益严重的光污染及其生态和文化后果。肖勒叙述了她在萨斯喀彻温省里贾纳生活时对黑暗的个人迷恋，以及她最终渴望体验“真正的”——格拉斯兰国家公园未经污染的黑暗，这是一个经过认证的暗夜保护区。\n\n这篇散文强调了全球人工照明的惊人增长，导致了生态破坏（影响鸟类、昆虫和海龟）和人类健康问题（如心血管疾病、肥胖和抑郁症）。除了生理影响之外，肖勒认为，光污染模糊了我们与夜空的联系，而夜空是人类文化、历史和我们对宇宙理解的重要组成部分。\n\n她将国际暗夜协会的保护工作与加拿大更严格的暗夜指定进行了对比，强调了保护自然黑暗的重要性。肖勒深入研究了关于光明与黑暗的哲学和神话视角，揭示了黑暗不仅仅是光明的缺失，而且具有自身的意义，代表着神秘、潜力和另一种真理。她即将前往格拉斯兰的旅程源于对某种基本而永恒事物的渴望，沉浸在一种可能提供清晰感和与世界更深层次联系的黑暗中。她试图重新发现，如果重新夺回黑暗，它可能会揭示什么。"
  },
  {
    "id": "45251039",
    "title": "USB-A isn't going anywhere, so stop removing the port",
    "url": "https://www.pocket-lint.com/usb-a-isnt-going-anywhere/",
    "summary": "This article argues that while USB-C is the inevitable future of connectivity due to its speed, reversibility, and versatility, manufacturers are phasing out USB-A ports on laptops too soon. The author contends that USB-A is still essential because many peripherals like mice, dongles, and external drives continue to use it. Removing these ports forces users to rely on adapters, adding to cost and inconvenience.\n\nThe article traces the history of USB-A, highlighting its revolutionary impact on PC connectivity, replacing older ports like PS/2, serial, and parallel. It acknowledges the advantages of USB-C, including faster speeds and the ability to carry display signals.\n\nHowever, the author criticizes brands like Apple and Dell for prioritizing thin and light designs by limiting the number of USB ports, particularly USB-A. They point out that even on expensive laptops, the available ports are often insufficient for connecting essential devices. The article argues that phasing out USB-A is premature, especially when new peripherals with USB-A connections continue to be manufactured and widely used. The author believes manufacturers should prioritize user needs by including a reasonable mix of USB-A and USB-C ports on laptops, rather than forcing upgrades and adapter purchases. The conclusion is that manufacturers are putting profits before user experience by removing too many USB-A ports too soon.\n",
    "chinese_title": "USB-A不会消失，别再移除这个接口了",
    "chinese_summary": "本文认为，虽然USB-C因其速度、正反插拔性和多功能性而必然是连接的未来，但制造商过早地在笔记本电脑上淘汰USB-A端口。作者认为，由于许多外围设备（如鼠标、适配器和外部驱动器）继续使用USB-A，因此它仍然至关重要。移除这些端口迫使用户依赖适配器，从而增加了成本和不便。\n\n文章追溯了USB-A的历史，强调了它对PC连接的革命性影响，取代了PS/2、串行和并行等旧端口。它承认USB-C的优势，包括更快的速度和传输显示信号的能力。\n\n然而，作者批评了苹果和戴尔等品牌，因为它们为了优先考虑轻薄设计而限制了USB端口的数量，特别是USB-A端口。他们指出，即使在昂贵的笔记本电脑上，可用的端口通常也不足以连接必要的设备。文章认为，淘汰USB-A为时尚早，特别是当带有USB-A连接的新外围设备仍在生产和广泛使用时。作者认为，制造商应该优先考虑用户需求，在笔记本电脑上包含USB-A和USB-C端口的合理组合，而不是强迫升级和购买适配器。结论是，制造商通过过早地移除过多的USB-A端口，将利润置于用户体验之上。"
  },
  {
    "id": "45225903",
    "title": "Which colours dominate movie posters and why?",
    "url": "https://stephenfollows.com/p/which-colours-dominate-movie-posters-and-why",
    "summary": "This article analyzes the dominant colors used in 58,687 movie posters from the past century and explores how color choices reflect genre and audience expectations. It begins by quantifying \"colorfulness\" and \"brightness contrast\" in posters, revealing trends of decreasing color intensity over time and genre-specific visual styles. Mystery, thriller, and horror posters favor low brightness and contrast, while comedies, family films, and musicals use high color and contrast.\n\nThe analysis then dives into individual colors. Orange emerges as the most frequently used \"color,\" often paired with blue, signifying warmth, accessibility, and high-stakes conflict (especially in action, sci-fi, and adventure films). Red is used to signal danger, passion, or urgency, particularly in horror, action, romance, and comedy, however its use has little variation between genres. White serves as a flexible backdrop, conveying freshness in romantic comedies, sterility in horror, and minimalism in sci-fi. Blue is prominent in settings like seas, skies, and neon tech, particularly in animation, family films, sci-fi, and thrillers. Brown grounds stories in history, war, and decay. Green can signal lush nature or toxic unease. Purple is used to signal something outside the mainstream. Pink, loaded with cultural baggage, signifies affection in romance, youth in teen films, and unsettling sweetness in horror.\n\nThe article highlights the strategic use of color in movie posters to quickly communicate genre and evoke specific emotional responses from audiences, driven by marketing teams' constant adaptation over the last century.\n",
    "chinese_title": "电影海报主导颜色是什么？为什么？",
    "chinese_summary": "本文分析了过去一百年间58,687张电影海报中使用的主要颜色，并探讨了颜色选择如何反映电影类型和观众期望。文章首先量化海报的“色彩鲜艳度”和“亮度对比度”，揭示了色彩强度随时间推移而降低以及特定类型电影的视觉风格趋势。悬疑、惊悚和恐怖电影海报偏爱低亮度和对比度，而喜剧、家庭电影和音乐剧则使用高色彩和对比度。\n\n接下来，分析深入到各个颜色。橙色是最常用的“颜色”，通常与蓝色搭配，象征温暖、亲和力以及高风险冲突（尤其是在动作、科幻和冒险电影中）。红色用于表示危险、激情或紧迫感，尤其是在恐怖、动作、爱情和喜剧电影中，但其使用在不同类型之间几乎没有差异。白色是一种灵活的背景色，在浪漫喜剧中传达新鲜感，在恐怖电影中传达无菌感，在科幻电影中传达极简主义。蓝色在海洋、天空和霓虹科技等场景中很突出，尤其是在动画、家庭电影、科幻和惊悚片中。棕色将故事置于历史、战争和衰败之中。绿色可以表示郁郁葱葱的自然环境或有毒的不安感。紫色用于表示非主流的事物。粉色带有浓厚的文化色彩，在爱情片中象征爱意，在青少年电影中象征青春，在恐怖片中象征令人不安的甜蜜。\n\n文章强调了电影海报中色彩的战略性使用，旨在快速传达电影类型并唤起观众特定的情感反应，这得益于营销团队在过去一个世纪中的不断适应。"
  },
  {
    "id": "45243635",
    "title": "Betty Crocker broke recipes by shrinking boxes",
    "url": "https://www.cubbyathome.com/boxed-cake-mix-sizes-have-shrunk-80045058",
    "summary": "The article \"Betty Crocker broke recipes by shrinking boxes\" discusses how boxed cake mix sizes, particularly Betty Crocker's, have shrunk over time, impacting recipe success. The author notes that older recipes often call for \"one box of cake mix\" without specifying a weight. As box sizes have decreased, using a modern, smaller box in an older recipe can lead to unsatisfactory results because the ingredient ratios are thrown off.\n\nSpecifically, cake mix boxes have shrunk from over 18 ounces in the past to around 15.25 ounces today. This \"shrinkflation,\" while seemingly minor, can cause noticeable differences in the finished product. The author highlights issues like drier cakes, incorrect frosting-to-cake ratios, and an overall change in texture.\n\nThe article emphasizes that to avoid problems, bakers should pay close attention to the weight of the cake mix called for in a recipe, rather than simply relying on \"one box.\" When using older recipes, it may be necessary to supplement the modern, smaller box with additional ingredients like flour or sugar to achieve the intended consistency and flavor. The article serves as a cautionary tale about the subtle but significant impact of product size changes on baking results.\n",
    "chinese_title": "贝蒂妙厨通过缩小包装盒来减少食谱用量。",
    "chinese_summary": "文章“贝蒂妙厨通过缩小包装盒来破坏食谱”讨论了盒装蛋糕粉（尤其是贝蒂妙厨）的尺寸如何随着时间的推移而缩小，从而影响了食谱的成功率。作者指出，较早的食谱通常要求使用“一盒蛋糕粉”，但没有指定重量。由于包装盒尺寸减小，在较早的食谱中使用现代的、较小的包装盒可能会导致不令人满意的结果，因为配料比例被打乱了。\n\n具体来说，蛋糕粉包装盒已经从过去的超过18盎司缩小到今天的约15.25盎司。这种“缩水式通胀”虽然看起来微不足道，但可能会导致成品的显着差异。作者强调了蛋糕更干燥、糖霜与蛋糕的比例不正确以及整体口感发生变化等问题。\n\n文章强调，为了避免问题，烘焙师应密切关注食谱中要求的蛋糕粉重量，而不是仅仅依赖“一盒”。在使用较早的食谱时，可能需要用额外的配料（如面粉或糖）来补充现代的、较小的包装盒，以达到预期的稠度和风味。这篇文章是对产品尺寸变化对烘焙结果产生微妙但重大影响的警示。"
  },
  {
    "id": "45216327",
    "title": "Analyzing the memory ordering models of the Apple M1",
    "url": "https://www.sciencedirect.com/science/article/pii/S1383762124000390",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "分析苹果M1的内存排序模型",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "45243800",
    "title": "Website is hosted on a disposable vape",
    "url": "http://ewaste.fka.wtf/",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "网站托管在一次性电子烟上",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "45249113",
    "title": "My First Year Without an iPhone",
    "url": "https://ktklp.substack.com/p/my-first-year-without-an-iphone",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "我没有iPhone的第一年",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "45242591",
    "title": "OCSP Service Has Reached End of Life",
    "url": "https://letsencrypt.org/2025/08/06/ocsp-service-has-reached-end-of-life",
    "summary": "Let's Encrypt has officially discontinued its Online Certificate Status Protocol (OCSP) service, effective August 6, 2025, following an announcement made in December 2024. They stopped including OCSP URLs in certificates over 90 days prior, ensuring all certificates containing them have expired. Moving forward, revocation information will be solely distributed through Certificate Revocation Lists (CRLs).\n\nThe primary reason for this decision is privacy. OCSP exposes user browsing activity to the Certificate Authority (CA) because each request reveals which website a user is visiting from a specific IP address. While Let's Encrypt doesn't intentionally retain this data, the potential for accidental retention or legal compulsion to collect it remains a concern. CRLs do not present this privacy issue.\n\nFurthermore, simplifying Let's Encrypt's infrastructure is crucial for long-term compliance, reliability, and efficiency. Operating the OCSP service consumed significant resources that can now be allocated to other critical areas. With CRL support established, OCSP became redundant.\n\nThe article highlights the massive scale of Let's Encrypt's OCSP service, handling around 340 billion requests per month (140,000 requests per second via CDN). Let's Encrypt extends its gratitude to Akamai for their decade-long donation of CDN services for OCSP.\n",
    "chinese_title": "OCSP服务已停止服务",
    "chinese_summary": "Let's Encrypt 将于 2025 年 8 月 6 日正式停止在线证书状态协议 (OCSP) 服务，该公告已于 2024 年 12 月发布。他们早在 90 天前就已停止在证书中包含 OCSP URL，以确保所有包含这些 URL 的证书均已过期。今后，撤销信息将仅通过证书撤销列表 (CRL) 分发。\n\n此决定的主要原因是隐私。OCSP 会将用户浏览活动暴露给证书颁发机构 (CA)，因为每个请求都会从特定 IP 地址揭示用户正在访问哪个网站。虽然 Let's Encrypt 并非有意保留此数据，但意外保留或法律强制收集它的可能性仍然令人担忧。CRL 不存在此隐私问题。\n\n此外，简化 Let's Encrypt 的基础设施对于长期的合规性、可靠性和效率至关重要。运营 OCSP 服务消耗了大量资源，现在可以将这些资源分配给其他关键领域。在 CRL 支持建立后，OCSP 变得多余。\n\n本文重点介绍了 Let's Encrypt 的 OCSP 服务的巨大规模，每月处理约 3400 亿个请求（通过 CDN 每秒 14 万个请求）。Let's Encrypt 感谢 Akamai 十年来为 OCSP 捐赠 CDN 服务。"
  },
  {
    "id": "45210705",
    "title": "Learning Lens Blur Fields",
    "url": "https://blur-fields.github.io/",
    "summary": "This article introduces Lens Blur Fields, a novel approach to modeling the complex optical blur inherent in lens systems. The core idea is to represent the lens's point spread function (PSF) as a high-dimensional neural network (MLP) that captures variations across image plane location, focus setting, and depth. This representation accounts for defocus, diffraction, aberrations, pixel color filters, and micro-lenses, effectively creating a device-specific \"blur signature.\"\n\nThe authors present a practical method for acquiring these blur fields. The process involves capturing focal stacks of monitor patterns using a simple setup and training the MLP using non-blind deconvolution. This relatively lightweight pipeline allows for quick generation of continuous PSF models.\n\nThe key applications of Lens Blur Fields include distinguishing between \"identical\" devices (e.g., smartphones) based on subtle differences in their optics, rendering realistic device-specific depth-of-field effects, and improving image restoration by incorporating the device's unique blur characteristics. The article highlights the ability to differentiate iPhones of the same model using their distinct blur signatures.\n\nFinally, the authors announce the release of a new dataset containing 5D and 6D lens blur fields for smartphone and SLR lenses, along with the training captures, to facilitate further research in this area.\n",
    "chinese_title": "学习透镜模糊场",
    "chinese_summary": "本文介绍了一种新颖的镜头模糊场方法，用于建模镜头系统中固有的复杂光学模糊。其核心思想是将镜头的点扩散函数（PSF）表示为一个高维神经网络（MLP），该网络捕获图像平面位置、焦点设置和深度上的变化。这种表示考虑了散焦、衍射、像差、像素滤色片和微透镜，从而有效地创建了一个设备特定的“模糊签名”。\n\n作者提出了一种获取这些模糊场的实用方法。该过程包括使用简单的设置捕获监视器图案的焦距堆叠，并使用非盲反卷积训练MLP。这种相对轻量级的流程可以快速生成连续的PSF模型。\n\n镜头模糊场的关键应用包括：基于光学器件的细微差异区分“相同”的设备（例如，智能手机），渲染逼真的设备特定景深效果，以及通过结合设备的独特模糊特性来改善图像恢复。本文重点介绍了使用不同的模糊签名区分相同型号iPhone的能力。\n\n最后，作者宣布发布一个新数据集，其中包含智能手机和单反镜头的5D和6D镜头模糊场，以及训练捕获，以促进该领域的进一步研究。"
  },
  {
    "id": "45245138",
    "title": "Show HN: Dagger.js – A buildless, runtime-only JavaScript micro-framework",
    "url": "https://daggerjs.org",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "Show HN: Dagger.js – 无需构建，纯运行时 JavaScript 微框架",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "45240146",
    "title": "Why We Spiral",
    "url": "https://behavioralscientist.org/why-we-spiral/",
    "summary": "Gregory Walton's \"Why We Spiral\" explores the mechanisms behind self-defeating thought patterns and how to reverse them. The article posits that negative spirals begin with a triggering event that raises fundamental questions about one's identity, belonging, or adequacy. These \"core questions,\" often latent, become activated by a \"bad\" event (e.g., a snarky comment from a boss).\n\nThis then influences our \"construal,\" or how we interpret the world around us. When these core questions are unsettled, we tend to interpret ambiguous evidence negatively, confirming our pessimistic hypotheses. This is fuelled by confirmation bias.\n\nFinally, \"calcification\" occurs as these negative thoughts and feelings become entrenched through our own actions. For example, acting out based on negative assumptions only reinforces the initial anxieties and creates a self-fulfilling prophecy.\n\nWalton argues that these negative spirals are not inevitable. We can disrupt them by understanding the core questions at play and offering \"wise interventions,\" which provide alternative, positive answers to those questions. By recognizing how our interpretations shape our reality, and by consciously choosing more constructive responses, we can initiate positive spirals that lead to happiness, success, and flourishing. The key is to address the underlying anxieties driving negative interpretations and break the cycle before it calcifies. The author uses the anecdote of missing out on In-N-Out to illustrate how tiny facts trigger bigger anxieties.\n",
    "chinese_title": "我们为何陷入恶性循环",
    "chinese_summary": "格雷戈里·沃尔顿的《为何我们陷入恶性循环》探讨了自我挫败思维模式背后的机制以及如何扭转它们。文章提出，恶性循环始于一个触发事件，该事件引发了关于个人身份、归属感或能力的根本性问题。这些通常潜伏的“核心问题”会被一个“糟糕”的事件（例如，老板的尖刻评论）激活。\n\n这进而影响我们的“构建”，即我们如何解释周围的世界。当这些核心问题未解决时，我们倾向于对模糊的证据做出负面解释，从而证实我们悲观的假设。这受到证实偏差的推动。\n\n最后，“钙化”发生，因为这些消极的想法和感受通过我们自己的行为变得根深蒂固。 例如，基于消极假设采取行动只会加强最初的焦虑，并创造一个自我实现的预言。\n\n沃尔顿认为，这些恶性循环并非不可避免。 我们可以通过理解起作用的核心问题并提供“明智的干预”来打破它们，这些干预为这些问题提供替代的、积极的答案。 通过认识到我们的解释如何塑造我们的现实，并通过有意识地选择更具建设性的回应，我们可以启动通往幸福、成功和繁荣的良性循环。 关键是解决驱动负面解释的潜在焦虑，并在循环钙化之前打破它。 作者用错过In-N-Out的轶事来说明微小的事实如何引发更大的焦虑。"
  },
  {
    "id": "45240682",
    "title": "Writing an operating system kernel from scratch",
    "url": "https://popovicu.com/posts/writing-an-operating-system-kernel-from-scratch/",
    "summary": "This article details the implementation of a minimal time-sharing operating system kernel on RISC-V using Zig, focusing on concepts like virtualization, threads, and kernel/user space separation.\n\nThe author aims to provide a practical example of low-level system software, especially beneficial for students in computer architecture. The project implements a unikernel, where the application code is linked directly with the kernel. It leverages the RISC-V's layered permission model (M, S, and U modes), with the kernel operating in S-mode and user threads in U-mode, and uses the SBI layer (OpenSBI) for console printing and timer management.\n\nThe goal is to support statically defined, never-ending threads that operate in user mode, are time-sliced, and can make system calls to the kernel. The article emphasizes the concept of virtualization, specifically virtualizing a CPU core for each thread by managing architectural registers and assigning a private stack.\n\nThe implementation leverages the interrupt mechanism, particularly timer interrupts, to seamlessly switch between threads. The interrupt routine preserves and restores registers, but by swapping the stack pointer, it can switch to a different set of register values, effectively achieving a context switch.\n\nThe article guides the reader through the assembly startup, the main kernel file (including I/O drivers), the S-mode handler for context switching, and the user space threads.\n",
    "chinese_title": "从零开始编写操作系统内核",
    "chinese_summary": "本文详细介绍了使用 Zig 语言在 RISC-V 架构上实现的一个极简时间分片操作系统内核，重点关注虚拟化、线程以及内核/用户空间分离等概念。\n\n作者旨在提供一个底层系统软件的实践案例，尤其对计算机体系结构专业的学生有益。该项目实现了一个单内核 (unikernel)，应用程序代码直接与内核链接。它利用了 RISC-V 的分层权限模型（M、S 和 U 模式），内核在 S 模式下运行，用户线程在 U 模式下运行，并使用 SBI 层 (OpenSBI) 进行控制台打印和定时器管理。\n\n目标是支持静态定义的、永不结束的线程，这些线程在用户模式下运行，进行时间分片，并且可以进行系统调用到内核。本文强调虚拟化的概念，特别是通过管理架构寄存器和分配私有堆栈，为每个线程虚拟化一个 CPU 核心。\n\n该实现利用中断机制，特别是定时器中断，来无缝地在线程之间切换。中断例程保存和恢复寄存器，但通过交换堆栈指针，它可以切换到另一组寄存器值，从而有效地实现上下文切换。\n\n本文引导读者了解汇编启动、主内核文件（包括 I/O 驱动程序）、用于上下文切换的 S 模式处理程序以及用户空间线程。"
  },
  {
    "id": "45250052",
    "title": "Goldman Sachs says AI still not showing up in companies' bottom lines",
    "url": "https://www.businessinsider.com/ai-company-earnings-calls-corporate-profits-bottom-line-goldman-sachs-2025-9",
    "summary": "The Business Insider article, titled \"Goldman Sachs says AI still not showing up in companies' bottom lines,\" reports that despite the hype and investment surrounding Artificial Intelligence (AI), Goldman Sachs analysts have observed a lack of tangible financial impact on company earnings thus far.\n\nThe article likely details that while companies are actively exploring and implementing AI solutions across various sectors, these initiatives haven't yet translated into significant revenue growth or cost reductions that are visible in their financial statements. Goldman Sachs suggests that this lag could be due to several factors, including the nascent stage of AI adoption, the time required to integrate AI effectively, and the challenges in measuring the true return on investment (ROI) of AI projects.\n\nThe report likely emphasizes that companies are spending considerable resources on AI development, training, and infrastructure, but the benefits are still primarily focused on areas like improved efficiency or enhanced customer experience, rather than direct profitability. It might also touch upon the potential for AI to impact companies in the long term, but cautions investors against expecting immediate or dramatic improvements in bottom lines in the short term. Ultimately, the article presents a more measured and realistic view of the current impact of AI on corporate performance, contrasting it with the widespread enthusiasm and optimism surrounding the technology.\n",
    "chinese_title": "高盛称人工智能尚未在公司业绩中显现。",
    "chinese_summary": "商业内幕文章《高盛称人工智能尚未体现在公司盈利上》报道称，尽管围绕人工智能（AI）的宣传和投资甚嚣尘上，但高盛分析师观察到，迄今为止，人工智能尚未对公司收益产生明显的财务影响。\n\n该文章可能详细说明，尽管各行业的公司都在积极探索和实施人工智能解决方案，但这些举措尚未转化为财务报表中可见的显著收入增长或成本降低。高盛认为，这种滞后可能是由于多种因素造成的，包括人工智能应用的起步阶段、有效整合人工智能所需的时间以及衡量人工智能项目真实投资回报率 (ROI) 的挑战。\n\n该报告可能强调，公司正在人工智能开发、培训和基础设施上投入大量资源，但其益处仍主要集中在提高效率或改善客户体验等领域，而不是直接的盈利能力。它也可能提及人工智能在长期内对公司的潜在影响，但告诫投资者不要期望短期内盈利出现立即或显著的改善。最终，这篇文章对人工智能目前对企业业绩的影响提出了一种更为谨慎和现实的看法，与围绕该技术的广泛热情和乐观情绪形成对比。"
  },
  {
    "id": "45243925",
    "title": "Titania Programming Language",
    "url": "https://github.com/gingerBill/titania",
    "summary": "Titania is a new programming language based on Oberon-07, designed as a teaching tool for compiler development. The name \"Titania\" is inspired by Shakespeare's \"A Midsummer Night's Dream,\" where Titania is the wife of Oberon. This is a codename only.\n\nThe document details the grammar of Titania using a formal notation, outlining the structure of modules, import lists, declarations (constants, types, variables, procedures), expressions, statements, and other language constructs. Key elements include:\n\n*   **Modules:** The basic unit of compilation.\n*   **Data Types:** Includes integers, reals, strings, booleans, arrays, records, and pointers.\n*   **Procedures:** Supports formal parameters, local declarations, and optional return values.\n*   **Statements:** Includes assignments, procedure calls, conditional statements (if, case), loops (while, repeat, for).\n*   **Operators:** Defines arithmetic, logical, and relational operators.\n\nThe document also lists keywords and provides semicolon insertion rules for the tokenizer, simplifying parsing. Finally, it includes a list of built-in procedures for tasks like absolute value calculation, bit manipulation, type conversion, memory allocation, printing, and length determination. These built-in procedures will be extended as the compiler is developed.\n",
    "chinese_title": "提泰妮娅编程语言",
    "chinese_summary": "Titania 是一种基于 Oberon-07 的新型编程语言，旨在作为编译器开发的教学工具。“Titania”这个名称的灵感来源于莎士比亚的《仲夏夜之梦》，其中 Titania 是 Oberon 的妻子。这只是一个代号。\n\n本文档使用形式化符号详细描述了 Titania 的语法，概述了模块、导入列表、声明（常量、类型、变量、过程）、表达式、语句和其他语言构造的结构。关键要素包括：\n\n*   **模块：** 编译的基本单元。\n*   **数据类型：** 包括整数、实数、字符串、布尔值、数组、记录和指针。\n*   **过程：** 支持形式参数、局部声明和可选返回值。\n*   **语句：** 包括赋值、过程调用、条件语句（if, case）、循环（while, repeat, for）。\n*   **运算符：** 定义算术、逻辑和关系运算符。\n\n本文档还列出了关键字，并提供了分号插入规则以简化 tokenizer 的解析。最后，它包含了一个内置过程的列表，用于执行绝对值计算、位操作、类型转换、内存分配、打印和长度确定等任务。这些内置过程将随着编译器的开发而扩展。"
  },
  {
    "id": "45251933",
    "title": "California says it can no longer trust Washington on Covid vaccines",
    "url": "https://www.latimes.com/california/story/2025-09-15/california-covid-surge-is-peaking-but-the-battle-over-vaccine-access-is-just-beginning",
    "summary": "In September 2025, California is diverging from federal COVID-19 vaccine guidance due to a lack of trust in the CDC and FDA under the Trump administration, specifically following the appointment of Robert F. Kennedy Jr. as Health and Human Services Secretary and his dismissal of the CDC's Advisory Committee on Immunization Practices. The state, along with medical organizations, is now aligning its vaccine recommendations with trusted professional medical groups like pediatricians, family physicians, and obstetricians, issuing more expansive recommendations than the CDC.\n\nCalifornia is pushing back through initiatives like the West Coast Health Alliance with Washington, Oregon, and Hawaii to ensure science-based immunization guidance. This includes recommending COVID-19 vaccination for all adults, pregnant individuals, and children (especially those with underlying conditions), contrasting with the FDA's more limited approval focused on older adults and those with underlying conditions. The state Legislature has also passed a bill allowing the California Department of Public Health to consider medical society guidance for vaccine coverage requirements.\n\nThis shift comes amidst a late summer COVID surge showing signs of peaking, high levels of COVID in wastewater, and concerns about access to vaccines in some areas. Other respiratory illnesses like the flu, RSV, and pertussis (whooping cough) are also being monitored, with new RSV vaccine recommendations for younger adults at increased risk.\n",
    "chinese_title": "加州称不再信任华盛顿的新冠疫苗。",
    "chinese_summary": "2025年9月，由于对特朗普政府领导下的疾控中心和食品药品监督管理局缺乏信任，尤其是在小罗伯特·F·肯尼迪就任卫生与公众服务部部长并解散疾控中心免疫实践咨询委员会之后，加利福尼亚州正在背离联邦政府的新冠疫苗指导方针。该州与医疗机构一道，现在正将其疫苗建议与儿科医生、家庭医生和产科医生等值得信赖的专业医疗团体保持一致，发布的建议比疾控中心更为广泛。\n\n加州正通过与华盛顿州、俄勒冈州和夏威夷州组成的西海岸健康联盟等举措进行反击，以确保基于科学的免疫指导。这包括建议所有成年人、孕妇和儿童（特别是那些患有基础疾病的儿童）接种新冠疫苗，这与美国食品药品监督管理局更侧重于老年人和患有基础疾病者的有限批准形成对比。州议会还通过了一项法案，允许加州公共卫生部在疫苗覆盖要求方面考虑医学学会的指导意见。\n\n这一转变发生在夏末新冠疫情再次抬头并出现见顶迹象、废水中新冠病毒含量高企以及对某些地区疫苗获取渠道的担忧之际。流感、呼吸道合胞病毒和百日咳等其他呼吸道疾病也在受到监测，针对高危年轻成年人的新呼吸道合胞病毒疫苗建议已经出台。"
  },
  {
    "id": "45250558",
    "title": "Sam Altman's longevity startup is testing a pill for a younger brain",
    "url": "https://www.businessinsider.com/retro-biosciences-sam-altman-antiaging-brain-pill-longevity-healthspan-2025-9",
    "summary": "The Business Insider article reports on Sam Altman, the CEO of OpenAI, investing in and testing a new pill developed by a longevity startup aimed at improving cognitive function and potentially reversing age-related brain decline. While the article doesn't specify the name of the startup or the exact ingredients of the pill, it highlights Altman's interest in the longevity space and his personal involvement in trialing the experimental treatment.\n\nThe key takeaway is the focus on \"brain health\" as a frontier in anti-aging efforts. The pill is designed to target mechanisms associated with cognitive decline, with the hope of enhancing memory, focus, and overall brain performance. While details are scarce, the article implies the existence of scientific research and development behind the formulation.\n\nThe article emphasizes the growing interest and investment in longevity research, fueled by individuals like Altman who are keen to explore ways to extend lifespan and improve healthspan. The testing of the pill represents an early-stage effort and the efficacy and safety of the treatment remain unknown. The report serves to highlight the ongoing innovation and investment in the field of longevity, particularly focusing on cognitive enhancement and the potential for pharmaceutical interventions to address age-related brain changes.\n",
    "chinese_title": "萨姆·奥特曼的延寿初创公司正在测试一种使大脑更年轻的药丸。",
    "chinese_summary": "商业内幕文章报道了OpenAI的CEO萨姆·奥特曼投资并测试一家长寿初创公司开发的新型药丸，该药丸旨在改善认知功能并可能逆转与年龄相关的脑功能衰退。虽然文章未提及该初创公司的名称或药丸的确切成分，但它强调了奥特曼对长寿领域的兴趣以及他个人参与实验性治疗的试用。\n\n关键在于“大脑健康”作为抗衰老领域的前沿。该药丸旨在针对与认知衰退相关的机制，希望增强记忆力、注意力和整体大脑性能。虽然细节很少，但文章暗示了该配方背后的科学研究和开发。\n\n文章强调了对长寿研究日益增长的兴趣和投资，这受到了像奥特曼这样渴望探索延长寿命和改善健康寿命的个人的推动。该药丸的测试代表着一项早期努力，治疗的有效性和安全性仍然未知。该报告旨在强调长寿领域正在进行的创新和投资，特别是关注认知增强以及药物干预解决与年龄相关的大脑变化的潜力。"
  },
  {
    "id": "45231378",
    "title": "Show HN: A store that generates products from anything you type in search",
    "url": "https://anycrap.shop/",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "展示 HN: 一个能根据你的搜索内容生成产品的商店",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "45208102",
    "title": "Page Object (2013)",
    "url": "https://martinfowler.com/bliki/PageObject.html",
    "summary": "Martin Fowler's \"Page Object\" defines a pattern for UI testing to improve maintainability and reduce brittleness. The Page Object encapsulates an HTML page or fragment, offering an application-specific API to interact with UI elements without directly manipulating HTML. This shields tests from UI changes.\n\nA Page Object should mimic user interaction, providing methods for accessing elements (strings for text fields, booleans for checkboxes, action-oriented method names for buttons), hiding the underlying UI widgetry.\n\nPage Objects shouldn't represent entire pages, but rather significant elements, like an album list within a page. They should model the structure relevant to the user. When navigating to a new page, the initial Page Object should return a new Page Object for that page.\n\nDebate exists regarding assertions within Page Objects. Fowler advocates for assertion-free Page Objects, preferring assertion libraries to prevent duplication and improve diagnostics. He makes an exception for assertions that check page invariants.\n\nWhile commonly used in testing, Page Objects can also provide a scripting interface. They encapsulate concurrency issues like asynchronous operations or threading. A Domain-Specific Language (DSL) should be layered over Page Objects.\n\nPatterns moving logic out of UI elements lessen the need for Page Objects. Page Objects exemplify encapsulation, hiding UI details, leading to easier UI modification and cleaner, intention-focused client (test) code. The \"Page Object\" name might be misleading, with \"panel object\" being a better fit.\n",
    "chinese_title": "页面对象 (2013)",
    "chinese_summary": "Martin Fowler 的“页面对象”定义了一种 UI 测试模式，旨在提高可维护性和降低脆弱性。页面对象封装了一个 HTML 页面或片段，提供一个特定于应用程序的 API 来与 UI 元素交互，而无需直接操作 HTML。这可以保护测试免受 UI 更改的影响。\n\n页面对象应该模仿用户交互，提供用于访问元素的方法（文本字段的字符串，复选框的布尔值，按钮的面向操作的方法名称），隐藏底层 UI 小部件。\n\n页面对象不应代表整个页面，而应代表重要的元素，例如页面中的专辑列表。它们应该模拟与用户相关的结构。当导航到新页面时，初始页面对象应返回该页面的新页面对象。\n\n关于页面对象中的断言存在争议。Fowler 提倡使用无断言的页面对象，更喜欢使用断言库来防止重复并改善诊断。他对检查页面不变性的断言做出了例外。\n\n虽然页面对象通常用于测试，但它们也可以提供脚本接口。它们封装了诸如异步操作或线程之类的并发问题。应该在页面对象之上分层一个领域特定语言 (DSL)。\n\n将逻辑移出 UI 元素的模式减少了对页面对象的需求。页面对象体现了封装，隐藏了 UI 细节，从而更容易进行 UI 修改，并使客户端（测试）代码更简洁、更专注于意图。“页面对象”这个名称可能具有误导性，“面板对象”可能更合适。"
  },
  {
    "id": "45239085",
    "title": "Repetitive negative thinking associated with cognitive decline in older adults",
    "url": "https://bmcpsychiatry.biomedcentral.com/articles/10.1186/s12888-025-06815-2",
    "summary": "This study investigated the relationship between repetitive negative thinking (RNT) and cognitive function in 424 community-dwelling older adults (60+ years) in Wuhan, China. Using a cross-sectional design, researchers assessed RNT levels with the Perseverative Thinking Questionnaire (PTQ) and cognitive function with the Montreal Cognitive Assessment (MoCA).\n\nThe study found a negative association between RNT and cognitive function. Participants with higher RNT scores (in the Q3 and Q4 quartiles) had significantly lower MoCA scores compared to those in the lowest quartile (Q1), even after adjusting for covariates like age, education, occupation, marital status, living arrangement, income, and hobbies. Specifically, higher RNT was associated with poorer performance in visuospatial function, naming, abstraction, and memory.\n\nSubgroup analyses indicated that the negative association between RNT and cognitive function was more pronounced in individuals aged 60-79 years and those with at least a junior high school education.\n\nThe study concludes that RNT is negatively associated with cognitive function in older adults, highlighting RNT as a potential modifiable risk factor for cognitive decline. The authors suggest future multi-center cohort studies with longer time spans to further explore the underlying mechanisms.\n",
    "chinese_title": "老年人认知衰退相关的重复性消极思维",
    "chinese_summary": "本研究调查了武汉424名社区居住老年人（60岁以上）的重复性消极思维（RNT）与认知功能之间的关系。研究采用横断面设计，使用持续性思维问卷（PTQ）评估RNT水平，并使用蒙特利尔认知评估（MoCA）评估认知功能。\n\n研究发现RNT与认知功能呈负相关。即使在调整了年龄、教育程度、职业、婚姻状况、居住安排、收入和爱好等协变量后，RNT评分较高（在Q3和Q4四分位数）的参与者，其MoCA评分显著低于最低四分位数（Q1）的参与者。具体而言，较高的RNT与较差的视觉空间功能、命名、抽象思维和记忆力有关。\n\n亚组分析表明，RNT与认知功能之间的负相关关系在60-79岁和至少具有初中学历的个体中更为明显。\n\n该研究得出结论，RNT与老年人的认知功能呈负相关，强调RNT可能是认知衰退的一个潜在可改变的危险因素。作者建议未来进行多中心、长时间跨度的队列研究，以进一步探讨其潜在机制。"
  },
  {
    "id": "45240391",
    "title": "Nicu's test website made with SVG (2007)",
    "url": "https://svg.nicubunu.ro/",
    "summary": "Nicu's SVG test website, created in 2007, aimed to evaluate Google's ability to index SVG files. The author, nicubunu.ro, sought to determine if Google could fully index the text content of SVG files or treat them solely as images. A crucial test was to see if Google would follow the links within the SVG and index those linked files as well.\n\nThe author was interested in exploring the feasibility of using Inkscape as the primary tool for website creation. The site's creation entirely within Inkscape served as a practical demonstration of this concept.\n\nThe website, built with advanced SVG features like Gaussian Blur, acknowledged browser compatibility limitations, suggesting Firefox 3.0 or later for the best user experience. It included a navigation menu with links to \"Home,\" \"Stuf,\" and \"About.\"\n\nThe inclusion of the text \"lmtbk4mh\" was specifically intended to be a test for search engine indexing, to see if the arbitrary string would be found. Ultimately, the project served as a testbed to assess the effectiveness of SVG for web content and Google's ability to process and index such content. The author also welcomed information from readers on the subject.\n",
    "chinese_title": "Nicu's test website made with SVG (2007)",
    "chinese_summary": "Nicu's SVG test website, created in 2007, aimed to evaluate Google's ability to index SVG files. The author, nicubunu.ro, sought to determine if Google could fully index the text content of SVG files or treat them solely as images. A crucial test was to see if Google would follow the links within the SVG and index those linked files as well.\n\nThe author was interested in exploring the feasibility of using Inkscape as the primary tool for website creation. The site's creation entirely within Inkscape served as a practical demonstration of this concept.\n\nThe website, built with advanced SVG features like Gaussian Blur, acknowledged browser compatibility limitations, suggesting Firefox 3.0 or later for the best user experience. It included a navigation menu with links to \"Home,\" \"Stuf,\" and \"About.\"\n\nThe inclusion of the text \"lmtbk4mh\" was specifically intended to be a test for search engine indexing, to see if the arbitrary string would be found. Ultimately, the project served as a testbed to assess the effectiveness of SVG for web content and Google's ability to process and index such content. The author also welcomed information from readers on the subject.\n"
  },
  {
    "id": "45243740",
    "title": "Trigger Crossbar",
    "url": "https://serd.es/2025/09/14/Trigger-crossbar.html",
    "summary": "This article details the design and construction of a \"Trigger Crossbar,\" a device intended to simplify trigger signal routing between various lab instruments. The author, facing cable clutter and voltage incompatibility issues in their rack-mounted electronics lab, envisioned a 1U device with multiple coaxial trigger inputs and outputs connected to an FPGA-based switch fabric.\n\nThe device aims to allow complex multi-instrument setups without needing to manually reroute cables, and address voltage level differences. The crossbar is designed with 12x12 configuration: eight inputs, eight outputs, and four bidirectional ports. Inputs feature attenuators and comparators for variable thresholding, while outputs are either directly driven by the FPGA for low jitter (1.8V swing) or buffered by level shifters with adjustable VCCIO for compatibility with various voltage levels.\n\nThe core components include a Xilinx XC7K70T FPGA and an STM32H735 MCU. The project leverages the FPGA's SERDES lanes for functionalities like BERT, 10GbE connectivity via an SFP+, and deskew reference.\n\nThe PCB was fabricated at Multech, and the article details some of the bring-up challenges faced, including power connection issues due to mirrored pinouts, soldering problems with DC-DC modules, and issues with the comparators not functioning well at low amplitudes. The article describes the problems with the comparators Vcm, ultimately needing manual fixes instead of a complete board re-spin.\n",
    "chinese_title": "Trigger Crossbar",
    "chinese_summary": "This article details the design and construction of a \"Trigger Crossbar,\" a device intended to simplify trigger signal routing between various lab instruments. The author, facing cable clutter and voltage incompatibility issues in their rack-mounted electronics lab, envisioned a 1U device with multiple coaxial trigger inputs and outputs connected to an FPGA-based switch fabric.\n\nThe device aims to allow complex multi-instrument setups without needing to manually reroute cables, and address voltage level differences. The crossbar is designed with 12x12 configuration: eight inputs, eight outputs, and four bidirectional ports. Inputs feature attenuators and comparators for variable thresholding, while outputs are either directly driven by the FPGA for low jitter (1.8V swing) or buffered by level shifters with adjustable VCCIO for compatibility with various voltage levels.\n\nThe core components include a Xilinx XC7K70T FPGA and an STM32H735 MCU. The project leverages the FPGA's SERDES lanes for functionalities like BERT, 10GbE connectivity via an SFP+, and deskew reference.\n\nThe PCB was fabricated at Multech, and the article details some of the bring-up challenges faced, including power connection issues due to mirrored pinouts, soldering problems with DC-DC modules, and issues with the comparators not functioning well at low amplitudes. The article describes the problems with the comparators Vcm, ultimately needing manual fixes instead of a complete board re-spin.\n"
  },
  {
    "id": "45247259",
    "title": "Samsung 870 QVO 4TB SATA SSD-s: how are they doing after 4 years of use?",
    "url": "https://ounapuu.ee/posts/2025/09/15/samsung-870-qvo/",
    "summary": "生成摘要时出错",
    "chinese_title": "Samsung 870 QVO 4TB SATA SSD-s: how are they doing after 4 years of use?",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45243439",
    "title": "AMD Turin PSP binaries analysis from open-source firmware perspective",
    "url": "https://blog.3mdeb.com/2025/2025-09-11-gigabyte-mz33-ar1-blob-analysis/",
    "summary": "This article details the author's journey to get coreboot running on a Gigabyte MZ33-AR1 server board with an AMD Turin CPU, focusing on the challenges faced with AMD's Platform Security Processor (PSP) firmware and the solutions developed. The publicly available PSP blobs were insufficient to release the CPU from reset, forcing a workaround of injecting coreboot into the vendor firmware.\n\nThe author analyzes the structure of AMD PSP firmware, including the Embedded Firmware Structure (EFS) and PSP/BIOS directories, using the modified `amdfwtool` to compare vendor and coreboot images. Differences in SPI speeds, eSPI configuration, and the Multi Gen EFS value were identified and corrected by adjusting Kconfig values in the board code.\n\nHowever, even after addressing these discrepancies, the system still failed to boot with the public blobs. The author then extracted blobs from the vendor firmware using `PSPTool` and integrated them into the coreboot build, requiring modifications to `fw.cfg` and extensions to `amdfwtool`. This resulted in a bootable coreboot image.\n\nFurther investigation revealed a critical difference: the AMD Root Key ID used for signing PSP blobs differed between the public blobs and the vendor firmware. It was found that the latest AMD PSP blobs available to AMD partners contained the same key ID as the vendor firmware. Therefore, the issue preventing coreboot from booting with the public blobs was due to the public key being the wrong one. The author is planning to publish the PSPTool modifications soon.\n",
    "chinese_title": "AMD Turin PSP binaries analysis from open-source firmware perspective",
    "chinese_summary": "This article details the author's journey to get coreboot running on a Gigabyte MZ33-AR1 server board with an AMD Turin CPU, focusing on the challenges faced with AMD's Platform Security Processor (PSP) firmware and the solutions developed. The publicly available PSP blobs were insufficient to release the CPU from reset, forcing a workaround of injecting coreboot into the vendor firmware.\n\nThe author analyzes the structure of AMD PSP firmware, including the Embedded Firmware Structure (EFS) and PSP/BIOS directories, using the modified `amdfwtool` to compare vendor and coreboot images. Differences in SPI speeds, eSPI configuration, and the Multi Gen EFS value were identified and corrected by adjusting Kconfig values in the board code.\n\nHowever, even after addressing these discrepancies, the system still failed to boot with the public blobs. The author then extracted blobs from the vendor firmware using `PSPTool` and integrated them into the coreboot build, requiring modifications to `fw.cfg` and extensions to `amdfwtool`. This resulted in a bootable coreboot image.\n\nFurther investigation revealed a critical difference: the AMD Root Key ID used for signing PSP blobs differed between the public blobs and the vendor firmware. It was found that the latest AMD PSP blobs available to AMD partners contained the same key ID as the vendor firmware. Therefore, the issue preventing coreboot from booting with the public blobs was due to the public key being the wrong one. The author is planning to publish the PSPTool modifications soon.\n"
  },
  {
    "id": "45239601",
    "title": "Read to forget",
    "url": "https://mo42.bearblog.dev/read-to-forget/",
    "summary": "生成摘要时出错",
    "chinese_title": "阅读以忘却",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45204587",
    "title": "You’re a slow thinker. Now what?",
    "url": "https://chillphysicsenjoyer.substack.com/p/youre-a-slow-thinker-now-what",
    "summary": "生成摘要时出错",
    "chinese_title": "你反应慢，那又怎样？",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45249628",
    "title": "Proxmox delivers datacenter manager beta for more viable VMware contender",
    "url": "https://www.theregister.com/2025/09/12/proxmox_datacenter_manager/",
    "summary": "Proxmox is beta testing its Datacenter Manager, a tool designed to centrally manage multiple Proxmox Virtual Environment (PVE) clusters. This move positions Proxmox as a stronger contender against VMware, especially for organizations seeking cost-effective virtualization solutions.\n\nCurrently, PVE clusters operate as isolated entities. Datacenter Manager addresses this limitation by providing a single console to oversee individual nodes and clusters, simplifying tasks like virtual machine migrations across clusters. This functionality is crucial for organizations scaling their hyperconverged infrastructure.\n\nThe timing is particularly relevant as VMware, under Broadcom's ownership, is perceived to be shifting focus away from smaller customers. Proxmox, with its open-source nature and competitive pricing, presents an appealing alternative. While VMware is acknowledged as a more mature and feature-rich platform, its escalating costs are driving some users to explore options like Proxmox, Hyper-V, and Nutanix for specific workloads. The launch of Datacenter Manager is expected to further enhance Proxmox's appeal as a viable VMware alternative. A stable release is anticipated later this year.\n",
    "chinese_title": "Proxmox delivers datacenter manager beta for more viable VMware contender",
    "chinese_summary": "Proxmox正在进行其数据中心管理器（Datacenter Manager）的Beta测试，该工具旨在集中管理多个Proxmox虚拟环境（PVE）集群。此举使Proxmox成为VMware更强大的竞争对手，特别是对于寻求经济高效的虚拟化解决方案的组织而言。\n\n目前，PVE集群作为独立的实体运行。数据中心管理器通过提供一个控制台来监控各个节点和集群，从而解决了这一限制，简化了跨集群的虚拟机迁移等任务。此功能对于扩展其超融合基础设施的组织至关重要。\n\n由于Broadcom所有权下的VMware被认为正在转移对小型客户的关注，因此这个时机尤其重要。 Proxmox凭借其开源性质和具有竞争力的定价，提供了一个有吸引力的替代方案。虽然VMware被认为是更成熟且功能丰富的平台，但其不断上涨的成本正在推动一些用户探索Proxmox、Hyper-V和Nutanix等选项来处理特定工作负载。数据中心管理器的推出预计将进一步增强Proxmox作为可行的VMware替代方案的吸引力。预计今年晚些时候将发布稳定版本。"
  },
  {
    "id": "45238055",
    "title": "Models of European metro stations",
    "url": "http://stations.albertguillaumes.cat/",
    "summary": "生成摘要时出错",
    "chinese_title": "Models of European metro stations",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45247608",
    "title": "Korea's major US investment projects halted",
    "url": "https://www.kedglobal.com/business-politics/newsView/ked202509080002",
    "summary": "生成摘要时出错",
    "chinese_title": "Korea's major US investment projects halted",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45238567",
    "title": "The PC was never a true 'IBMer'",
    "url": "https://thechipletter.substack.com/p/the-pc-was-never-a-true-ibmer",
    "summary": "生成摘要时出错",
    "chinese_title": "The PC was never a true 'IBMer'",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45245923",
    "title": "Xrust – XPath, XQuery, and XSLT for Rust",
    "url": "https://gitlab.gnome.org/World/Rust/markup-rs/xrust",
    "summary": "生成摘要时出错",
    "chinese_title": "Xrust – XPath, XQuery, and XSLT for Rust",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45240266",
    "title": "The AI-Scraping Free-for-All Is Coming to an End",
    "url": "https://nymag.com/intelligencer/article/ai-scraping-free-for-all-by-openai-google-meta-ending.html",
    "summary": "生成摘要时出错",
    "chinese_title": "The AI-Scraping Free-for-All Is Coming to an End",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45237184",
    "title": "High Altitude Living – 8,000 ft and above (2021)",
    "url": "https://studioq.com/blog/2021/5/30/high-altitude-living-8000-ft-and-above-2450-meters",
    "summary": "生成摘要时出错",
    "chinese_title": "High Altitude Living – 8,000 ft and above (2021)",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45251852",
    "title": "China's Snub of U.S. Soybeans Is a Crisis for American Farmers",
    "url": "https://www.nytimes.com/2025/09/15/business/china-us-soybeans-farming.html",
    "summary": "生成摘要时出错",
    "chinese_title": "China's Snub of U.S. Soybeans Is a Crisis for American Farmers",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45200642",
    "title": "Observable Notebooks Data Loaders",
    "url": "https://observablehq.com/notebook-kit/data-loaders",
    "summary": "Observable Notebooks Data Loaders are special cells that execute code \"ahead of time\" during the build process using interpreters like Node.js or Python, rather than \"live\" in the browser. This is ideal for preparing static data, ensuring consistency, boosting performance, and expanding beyond SQL-based database connections.\n\nSupported formats include text-based (text, JSON, CSV, TSV, XML) and binary formats (Arrow, Parquet, Blob, Buffer), as well as image (jpeg, gif, webp, png, svg) and HTML. The output of these cells is cached in a `.observable/cache` directory, updating only when the data loader cell is re-run.\n\nThe article provides examples of both Python (printing a greeting and version) and Node.js (fetching npm download statistics) data loader cells.\n\nSpecific requirements for Node.js data loaders include Node.js 22.12+ installation in standard locations, read-only file access within the notebook directory, and package installation within the same directory. Python data loaders require Python 3.12+ in standard locations and support virtual environments. Installed packages are not implicit, you have to install them via pip.\n",
    "chinese_title": "Observable Notebooks 数据加载器",
    "chinese_summary": "Observable Notebooks Data Loaders are special cells that execute code \"ahead of time\" during the build process using interpreters like Node.js or Python, rather than \"live\" in the browser. This is ideal for preparing static data, ensuring consistency, boosting performance, and expanding beyond SQL-based database connections.\n\nSupported formats include text-based (text, JSON, CSV, TSV, XML) and binary formats (Arrow, Parquet, Blob, Buffer), as well as image (jpeg, gif, webp, png, svg) and HTML. The output of these cells is cached in a `.observable/cache` directory, updating only when the data loader cell is re-run.\n\nThe article provides examples of both Python (printing a greeting and version) and Node.js (fetching npm download statistics) data loader cells.\n\nSpecific requirements for Node.js data loaders include Node.js 22.12+ installation in standard locations, read-only file access within the notebook directory, and package installation within the same directory. Python data loaders require Python 3.12+ in standard locations and support virtual environments. Installed packages are not implicit, you have to install them via pip.\n"
  },
  {
    "id": "45214715",
    "title": "MIT-MC CP/M archive files, 1979-1984",
    "url": "https://github.com/MITDDC/cpmarchive-1979-1984",
    "summary": "生成摘要时出错",
    "chinese_title": "MIT-MC CP/M archive files, 1979-1984",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45250807",
    "title": "China's Snub of U.S. Soybeans Is a Crisis for American Farmers",
    "url": "https://www.nytimes.com/2025/09/15/business/chinas-snub-of-us-soybeans-is-a-crisis-for-american-farmers.html",
    "summary": "生成摘要时出错",
    "chinese_title": "China's Snub of U.S. Soybeans Is a Crisis for American Farmers",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45211580",
    "title": "La-Proteina",
    "url": "https://github.com/NVIDIA-Digital-Bio/la-proteina",
    "summary": "生成摘要时出错",
    "chinese_title": "La-Proteina",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45246278",
    "title": "Cex.C – Comprehensively EXtended C Language",
    "url": "https://github.com/alexveden/cex",
    "summary": "生成摘要时出错",
    "chinese_title": "Cex.C – Comprehensively EXtended C Language",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45239016",
    "title": "CorentinJ: Real-Time Voice Cloning (2021)",
    "url": "https://github.com/CorentinJ/Real-Time-Voice-Cloning",
    "summary": "生成摘要时出错",
    "chinese_title": "CorentinJ: Real-Time Voice Cloning (2021)",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45238930",
    "title": "macOS Tahoe is certified Unix 03 [pdf]",
    "url": "https://www.opengroup.org/openbrand/certificates/1223p.pdf",
    "summary": "生成摘要时出错",
    "chinese_title": "macOS Tahoe is certified Unix 03 [pdf]",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45208828",
    "title": "The unreasonable effectiveness of modern sort algorithms",
    "url": "https://github.com/Voultapher/sort-research-rs/blob/main/writeup/unreasonable/text.md",
    "summary": "生成摘要时出错",
    "chinese_title": "The unreasonable effectiveness of modern sort algorithms",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45200133",
    "title": "Introduction to GrapheneOS",
    "url": "https://dataswamp.org/~solene/2025-01-12-intro-to-grapheneos.html",
    "summary": "生成摘要时出错",
    "chinese_title": "Introduction to GrapheneOS",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45250220",
    "title": "Celery salt wound up on the Chicago dog",
    "url": "https://wgntv.com/chicago-food/how-celery-salt-wound-up-on-the-chicago-dog/",
    "summary": "生成摘要时出错",
    "chinese_title": "Celery salt wound up on the Chicago dog",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45197453",
    "title": "Dynamic Bird Migration Map",
    "url": "https://explorer.audubon.org/explore/species?sidebar=expand",
    "summary": "生成摘要时出错",
    "chinese_title": "Dynamic Bird Migration Map",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45245802",
    "title": "Decentralized YouTube alternative adds livestream scheduling in new release",
    "url": "https://news.itsfoss.com/peertube-7-3/",
    "summary": "生成摘要时出错",
    "chinese_title": "Decentralized YouTube alternative adds livestream scheduling in new release",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45216578",
    "title": "Patela: A basement full of amnesic servers",
    "url": "https://osservatorionessuno.org/blog/2025/05/patela-a-basement-full-of-amnesic-servers/",
    "summary": "生成摘要时出错",
    "chinese_title": "Patela: A basement full of amnesic servers",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45233415",
    "title": "Geedge and MESA leak: Analyzing the great firewall’s largest document leak",
    "url": "https://gfw.report/blog/geedge_and_mesa_leak/en/",
    "summary": "生成摘要时出错",
    "chinese_title": "Geedge and MESA leak: Analyzing the great firewall’s largest document leak",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45241071",
    "title": "Gleam is my new obsession",
    "url": "https://ericcodes.io/blog/gleam-my-new-obsession.html",
    "summary": "生成摘要时出错",
    "chinese_title": "Gleam is my new obsession",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45219383",
    "title": "Implementing namespaces and coding standards in WordPress plugin development",
    "url": "https://developer.wordpress.org/news/2025/09/implementing-namespaces-and-coding-standards-in-wordpress-plugin-development/",
    "summary": "生成摘要时出错",
    "chinese_title": "Implementing namespaces and coding standards in WordPress plugin development",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45251490",
    "title": "FreeBSD 15.0 Alpha 2 Released with Builds Now Being Properly Reproducible",
    "url": "https://www.phoronix.com/news/FreeBSD-15.0-Alpha-2",
    "summary": "生成摘要时出错",
    "chinese_title": "FreeBSD 15.0 Alpha 2 Released with Builds Now Being Properly Reproducible",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45214386",
    "title": "FakeIt: C++ Mocking Made Easy",
    "url": "https://github.com/eranpeer/FakeIt",
    "summary": "生成摘要时出错",
    "chinese_title": "FakeIt: C++ Mocking Made Easy",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45240304",
    "title": "Bank of Thailand freezes 3M accounts, sets daily transfer limits to curb fraud",
    "url": "https://www.thaienquirer.com/57752/bot-freezes-3-million-accounts-sets-daily-transfer-limits-of-50000-200000-baht-to-curb-6-billion-baht-scam-losses/",
    "summary": "生成摘要时出错",
    "chinese_title": "Bank of Thailand freezes 3M accounts, sets daily transfer limits to curb fraud",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45242458",
    "title": "ChatControl update: blocking minority held but Denmark is moving forward anyway",
    "url": "https://disobey.net/@yawnbox/115203365485529363",
    "summary": "生成摘要时出错",
    "chinese_title": "ChatControl update: blocking minority held but Denmark is moving forward anyway",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45243867",
    "title": "Cannabis use associated with quadrupled risk of developing type 2 diabetes",
    "url": "https://medicalxpress.com/news/2025-09-cannabis-quadrupled-diabetes-million-adults.html",
    "summary": "生成摘要时出错",
    "chinese_title": "Cannabis use associated with quadrupled risk of developing type 2 diabetes",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45244295",
    "title": "Gentoo AI Policy",
    "url": "https://wiki.gentoo.org/wiki/Project:Council/AI_policy",
    "summary": "生成摘要时出错",
    "chinese_title": "Gentoo AI Policy",
    "chinese_summary": "生成摘要时出错"
  }
]