[
  {
    "id": "43953883",
    "title": "Title of work deciphered in sealed Herculaneum scroll via digital unwrapping",
    "url": "https://www.finebooksmagazine.com/fine-books-news/title-work-deciphered-sealed-herculaneum-scroll-digital-unwrapping",
    "summary": "Researchers, through the Vesuvius Challenge, have successfully deciphered the title of a sealed Herculaneum scroll, PHerc. 172, using digital unwrapping techniques. The scroll, housed at the Bodleian Libraries at the University of Oxford, is identified as \"On Vices\" by the Greek philosopher Philodemus, an ethical treatise providing guidance for a virtuous life. This achievement earned the researchers the Vesuvius Challenge First Title Prize of $60,000.\n\nAfter the scroll was scanned at the Diamond Light Source, the data was released publicly. Sean Johnson and a research team of Marcel Roth and Micha Nowak independently discovered the title page within the innermost part of the scroll. Their findings were confirmed by the Vesuvius Challenge papyrological team.\n\nPhilodemus, an Epicurean philosopher, advocated for pleasure as central to a good life. He is a major author represented in the Villa of Papyri at Herculaneum. While the author and title are known, the book number within the \"On Vices\" series is still under investigation, with possibilities ranging from Book 1 to Book 4.\n\nExperts like Michael McOsker highlight the importance of this discovery for understanding Philodemus' ethical views and the \"On Vices\" series as a whole. Richard Ovenden emphasizes the potential of AI to transform arts and humanities scholarship and revitalize ancient artifacts. The Vesuvius Challenge continues to encourage researchers to contribute to deciphering the scrolls.\n",
    "chinese_title": "通过数字解卷破译赫库兰尼姆封印卷轴作品标题",
    "chinese_summary": "通过维苏威挑战赛，研究人员利用数字展开技术成功解读了密封的赫库兰尼姆卷轴PHerc. 172的标题。该卷轴由牛津大学博德利图书馆收藏，被确认为希腊哲学家菲洛德谟的著作《论恶习》，这是一部为过上道德高尚的生活提供指导的伦理论文。这项成就为研究人员赢得了维苏威挑战赛首个标题奖，奖金为6万美元。\n\n在卷轴于钻石光源完成扫描后，数据被公开发布。肖恩·约翰逊以及马塞尔·罗斯和米哈·诺瓦克的科研团队独立发现了卷轴最内部的标题页。他们的发现得到了维苏威挑战赛纸莎草纸学团队的证实。\n\n菲洛德谟是一位伊壁鸠鲁派哲学家，主张快乐是美好生活的核心。他是赫库兰尼姆纸莎草别墅中一位重要的代表作家。虽然作者和标题已知，但《论恶习》系列中的卷号仍在调查中，可能性范围从第一卷到第四卷。\n\n迈克尔·麦克斯科等专家强调了这项发现对于理解菲洛德谟的伦理观点以及整个《论恶习》系列的重要性。理查德·欧文登强调了人工智能在改变艺术和人文学科研究以及复兴古代文物方面的潜力。维苏威挑战赛将继续鼓励研究人员为解读这些卷轴做出贡献。"
  },
  {
    "id": "43954249",
    "title": "Gonzalo Guerrero",
    "url": "https://en.wikipedia.org/wiki/Gonzalo_Guerrero",
    "summary": "Gonzalo Guerrero was a Spanish sailor who was shipwrecked off the Yucatán Peninsula in 1511 and enslaved by the Maya. Over time, he assimilated into their culture, learned their language, and became a respected warrior. He married a Mayan woman, Zazil Ha, and had three children with her, who are considered among the first mestizos in the Americas.\n\nIn 1519, Hernán Cortés invited Guerrero to join his conquest of Mexico. However, Guerrero declined, citing his commitment to his family and his loyalty to the Mayan governor, for whom he was a soldier and advisor. He defended the Mayan territories against Spanish incursions.\n\nGuerrero played a key role in resisting Spanish attempts to conquer the Yucatán, including the entradas of Francisco de Montejo and Alonso de Avila. He died in 1536 during a battle against Pedro de Alvarado's forces in Honduras, fighting alongside the Mayan people.\n\nGuerrero's story has evolved over time, from being seen as a traitor by the Spanish to becoming a symbol of the blending of cultures in Mexico. He is remembered as a figure who chose to embrace a new identity and defend his adopted people. His life has been explored in numerous books, novels, and other forms of media.\n",
    "chinese_title": "冈萨洛·格雷罗",
    "chinese_summary": "冈萨洛·格雷罗是一位西班牙水手，1511年在尤卡坦半岛附近遭遇海难，被玛雅人奴役。随着时间的推移，他融入了他们的文化，学会了他们的语言，并成为一名受人尊敬的战士。他与一位玛雅女子扎齐尔·哈结婚，并与她育有三个孩子，他们被认为是美洲最早的混血人之一。\n\n1519年，埃尔南·科尔特斯邀请格雷罗加入他对墨西哥的征服。然而，格雷罗拒绝了，理由是他对家庭的承诺以及对玛雅总督的忠诚，他既是总督的士兵，又是顾问。他保卫玛雅领土免受西班牙的入侵。\n\n格雷罗在抵抗西班牙征服尤卡坦的企图中发挥了关键作用，包括弗朗西斯科·德·蒙特霍和阿隆索·德·阿维拉的入侵。1536年，他在洪都拉斯与佩德罗·德·阿尔瓦拉多军队的战斗中牺牲，与玛雅人民并肩作战。\n\n随着时间的推移，格雷罗的故事不断演变，从被西班牙人视为叛徒，到成为墨西哥文化融合的象征。他被铭记为一位选择拥抱新身份并捍卫其养育人民的人物。他的生平已被众多书籍、小说和其他形式的媒体所探索。"
  },
  {
    "id": "43931366",
    "title": "Writing an LLM from scratch, part 13 – attention heads are dumb",
    "url": "https://www.gilesthomas.com/2025/05/llm-from-scratch-13-taking-stock-part-1-attention-heads-are-dumb",
    "summary": "In \"Writing an LLM from scratch, part 13,\" Giles delves into the \"why\" behind self-attention in Large Language Models (LLMs), specifically addressing why the matrix multiplications work as intended. The core argument is that individual attention heads are much simpler and \"dumber\" than one might initially think. Their power arises from the combination of multi-head attention and the layering of multiple attention blocks.\n\nThe article explains that each attention head doesn't necessarily grasp the rich contextual meaning of a token in a sentence. Instead, it performs simple pattern matching. Multiple layers allow for progressively more complex representations to be built, similar to how CNNs detect increasingly sophisticated features in images.\n\nGiles contrasts the attention mechanism with older RNNs that suffered from a fixed-length bottleneck, limiting their ability to process long sequences. Attention, with its layer-wise enrichment of context vectors, scales better with input length.\n\nThe article then uses an example of an imaginary attention head that matches articles to nouns. It explains how input embeddings are projected into a simplified \"query space\" and \"key space.\" These spaces represent simplified features that the head is looking for (query) and what a token actually is (key). A dot product then measures the similarity between the query and key vectors, determining attention scores. Value space can be much richer in the real world.\n\nIn essence, attention heads are individually performing simple pattern recognition, but when combined in multi-head configurations across multiple layers, they create the sophisticated language understanding capabilities of LLMs.\n",
    "chinese_title": "从零开始编写LLM，第13部分 – 注意力头很笨",
    "chinese_summary": "从零编写LLM，第13部分：Giles深入探讨大型语言模型(LLM)中自注意力机制背后的“原因”，特别解释了矩阵乘法为何能按预期工作。核心论点是，单个注意力头比人们最初想象的要简单得多且更“笨”。它们的力量源于多头注意力的组合以及多个注意力块的堆叠。\n\n文章解释说，每个注意力头不一定能掌握句子中token的丰富上下文含义。相反，它执行简单的模式匹配。多层结构允许构建逐渐复杂的表示，类似于CNN如何在图像中检测越来越复杂的功能。\n\nGiles将注意力机制与旧式的RNN进行了对比，后者受限于固定长度的瓶颈，限制了它们处理长序列的能力。注意力机制通过逐层丰富上下文向量，可以更好地随输入长度进行缩放。\n\n文章随后使用了一个假想的注意力头的例子，该注意力头将冠词与名词进行匹配。它解释了如何将输入嵌入投影到简化的“查询空间”和“键空间”中。这些空间代表了注意力头正在寻找的简化特征（查询）以及token实际是什么（键）。然后，点积测量查询向量和键向量之间的相似性，从而确定注意力分数。在现实世界中，值空间可能要丰富得多。\n\n本质上，注意力头单独执行简单的模式识别，但当在多头配置中跨多个层组合时，它们会创造LLM复杂的语言理解能力。"
  },
  {
    "id": "43933091",
    "title": "The most valuable commodity in the world is friction",
    "url": "https://kyla.substack.com/p/the-most-valuable-commodity-in-the",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "世界上最有价值的商品是摩擦力。",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "43952714",
    "title": "The Epochalypse Project",
    "url": "https://epochalypse-project.org/",
    "summary": "The Epochalypse Project highlights the looming threat of the 32-bit timestamp vulnerability, also known as the Year 2038 problem, which will cause widespread disruptions in computer systems relying on Unix time after January 19, 2038. This vulnerability, affecting systems from hospital equipment to power grids, stems from the limitation of a 32-bit integer counting seconds since 1970, leading to a rollover to negative numbers and misinterpretation of dates.\n\nThe article argues that the scale of this problem is greater than Y2K due to the increased number of embedded systems, our dependence on digital infrastructure, and the possibility of remote exploitation via unsecured time protocols. If unaddressed, this could result in significant failures across various sectors, from banking to transportation, potentially endangering lives and disrupting economies.\n\nFounded by cybersecurity researchers Trey Darley and Pedro Umbelino, The Epochalypse Project aims to coordinate a global response through standardized testing, documentation of vulnerabilities, development of remediation strategies, and knowledge sharing. The article emphasizes the urgency of the situation and encourages everyone, from the general public to industry professionals and government entities, to participate in testing, reporting, and developing solutions. It provides specific action steps for each group, including testing devices, incorporating timestamp vulnerability compliance into products, and creating regulatory frameworks. The project serves as a central hub for sharing findings and fostering collaboration to mitigate the potential digital disaster.\n",
    "chinese_title": "末世启示录计划",
    "chinese_summary": "Epochalypse项目揭示了32位时间戳漏洞（亦称2038年问题）迫在眉睫的威胁，该漏洞将在2038年1月19日之后导致依赖Unix时间的计算机系统出现大范围中断。此漏洞影响从医院设备到电网等系统，源于自1970年以来用32位整数记录秒数的限制，导致数字翻转为负数，并错误解读日期。\n\n文章认为，由于嵌入式系统数量增加、我们对数字基础设施的依赖以及通过不安全的时钟协议进行远程攻击的可能性，该问题的规模大于Y2K。如果不加以解决，可能会导致银行到交通运输等各个领域出现重大故障，可能危及生命并扰乱经济。\n\nEpochalypse项目由网络安全研究员Trey Darley和Pedro Umbelino创立，旨在通过标准化测试、漏洞记录、补救策略制定和知识共享来协调全球应对。文章强调了情况的紧迫性，并鼓励从普通大众到行业专业人士和政府实体等所有人参与测试、报告和开发解决方案。它为每个群体提供了具体的行动步骤，包括测试设备、将时间戳漏洞合规性纳入产品以及创建监管框架。该项目作为共享发现和促进协作的中心枢纽，旨在减轻潜在的数字灾难。"
  },
  {
    "id": "43953722",
    "title": "Show HN: GlassFlow – OSS streaming dedup and joins from Kafka to ClickHouse",
    "url": "https://github.com/glassflow/clickhouse-etl",
    "summary": "GlassFlow is an open-source real-time stream processor designed to simplify data pipeline creation and management between Kafka and ClickHouse. It provides a user-friendly web interface for building and managing real-time data pipelines, featuring built-in support for deduplication and temporal joins. Targeted at data engineers, GlassFlow handles late-arriving events, ensures exactly-once correctness, and scales with high-throughput data.\n\nKey features include:\n\n*   **Streaming Deduplication:** Real-time deduplication of Kafka streams with configurable time windows.\n*   **Temporal Stream Joins:** Real-time joining of two Kafka streams with configurable time windows.\n*   **Built-in Kafka Connector:** Seamless integration with Kafka using NATS-Kafka Bridge.\n*   **Optimized ClickHouse Sink:** Native ClickHouse connection with configurable batch sizes and retry mechanisms.\n*   **User-Friendly Interface:** Web-based UI for pipeline configuration and management.\n\nThe tool provides a local development setup using Docker Compose and includes a demo with local Kafka and ClickHouse instances. The GlassFlow API is written in Go, and the architecture includes a NATS message broker. Pipeline configurations are defined in JSON and encompass source (Kafka), sink (ClickHouse), and optional join configurations. GlassFlow is licensed under Apache License 2.0, and contributions are welcomed.\n",
    "chinese_title": "Show HN: GlassFlow – Kafka 到 ClickHouse 的 OSS 流式去重和连接",
    "chinese_summary": "GlassFlow 是一个开源的实时流处理器，旨在简化 Kafka 和 ClickHouse 之间的数据管道创建和管理。它提供了一个用户友好的 Web 界面，用于构建和管理实时数据管道，具有内置的去重和时序连接支持。GlassFlow 面向数据工程师，可处理延迟到达的事件，确保恰好一次的正确性，并能以高吞吐量数据进行扩展。\n\n主要功能包括：\n\n*   **流式去重:** 使用可配置的时间窗口对 Kafka 流进行实时去重。\n*   **时序流连接:** 使用可配置的时间窗口对两个 Kafka 流进行实时连接。\n*   **内置 Kafka 连接器:** 使用 NATS-Kafka Bridge 与 Kafka 无缝集成。\n*   **优化的 ClickHouse Sink:** 原生 ClickHouse 连接，具有可配置的批处理大小和重试机制。\n*   **用户友好的界面:** 用于管道配置和管理的基于 Web 的 UI。\n\n该工具提供了一个使用 Docker Compose 的本地开发设置，并包含一个带有本地 Kafka 和 ClickHouse 实例的演示。 GlassFlow API 使用 Go 编写，架构包括一个 NATS 消息代理。 管道配置以 JSON 格式定义，包括源（Kafka）、sink（ClickHouse）和可选的连接配置。 GlassFlow 在 Apache License 2.0 下获得许可，欢迎贡献。"
  },
  {
    "id": "43955106",
    "title": "Synder (YC S21) Is Hiring",
    "url": "https://www.ycombinator.com/companies/synder/jobs/2Wnbc1f-business-development-representative",
    "summary": "Synder (YC S21), an e-commerce accounting platform, is seeking a Business Development Representative with 3+ years of lead generation experience. The role involves identifying and nurturing leads to expand their user base, contributing to sales pipeline development and customer acquisition. Responsibilities include researching leads through online and offline channels, engaging with prospects via email and social media, qualifying leads, maintaining a lead database, collaborating with the sales team, and tracking lead generation activities.\n\nThe ideal candidate possesses strong research, communication, and relationship-building skills, as well as being persistent, resilient, detail-oriented, self-motivated, and goal-oriented with a \"warrior mindset.\" Synder offers a salary of $60K-$70K and is a remote position within the US.\n\nSynder is an alumni of Y Combinator, AICPA accelerator program, and a member of the BDO Alliance USA. They are trusted by accountants as a top QuickBooks integration and recognized on the Shopify App Store. They boast almost 5,000 daily users and $10B+ in transactions processed in 2024. The platform aims to simplify accounting for e-commerce businesses by connecting sales channels and payment methods into a unified API and automatically organizing data in the accounting system. The company was founded in 2019 and is based in San Francisco.\n",
    "chinese_title": "Synder (YC S21) 正在招聘",
    "chinese_summary": "Synder (YC S21) 是一家电商会计平台，现招聘一名业务拓展代表，要求具备3年以上潜在客户开发经验。该职位负责识别和培养潜在客户以扩大用户群，助力销售渠道开发和客户获取。 职责包括通过线上和线下渠道研究潜在客户，通过电子邮件和社交媒体与潜在客户互动，筛选潜在客户，维护潜在客户数据库，与销售团队合作，以及跟踪潜在客户开发活动。\n\n理想的候选人应具备强大的研究、沟通和人际关系建立能力，同时具备坚持不懈、坚韧不拔、注重细节、自我激励和目标导向的“战士心态”。 Synder提供6万至7万美元的薪资，并且是美国境内的远程职位。\n\nSynder 是 Y Combinator、AICPA 加速器计划的校友，也是 BDO Alliance USA 的成员。 他们作为顶级 QuickBooks 集成受到会计师的信赖，并在 Shopify 应用商店上获得认可。 他们的平台拥有近 5,000 名日活跃用户，并在 2024 年处理了超过 100 亿美元的交易。 该平台旨在通过将销售渠道和支付方式连接到统一的 API 中，并自动在会计系统中组织数据，从而简化电子商务企业的会计流程。 该公司成立于 2019 年，总部位于旧金山。"
  },
  {
    "id": "43953229",
    "title": "A Rust Documentation Ecosystem Review",
    "url": "https://www.harudagondi.space/blog/rust-documentation-ecosystem-review/",
    "summary": "This article reviews the Rust documentation ecosystem, focusing on comprehensiveness, discoverability, philosophy, and approachability. It introduces the Diátaxis system, which categorizes documentation into four quadrants: tutorials, how-to guides, references, and explanations.\n\n*   **Tutorials:** Beginner-friendly, focusing on practical learning by doing. They lack comprehensiveness but excel in discoverability and approachability.\n*   **How-to Guides:** Aimed at users with basic competence, they address real-world problems. More comprehensive than tutorials, offering greater discoverability but less approachability.\n*   **References:** Maximally comprehensive, providing detailed descriptions of each item. However, they lack philosophy, discoverability, and approachability.\n*   **Explanations:** Rare but valuable, explaining the reasoning behind design choices. They enhance discoverability, comprehensiveness, and philosophy.\n\nThe article then surveys the documentation of various popular Rust crates, evaluating their adherence to the four quadrants and the author's criteria. This includes libraries like `rand`, `axum`, `bevy`, `tokio`, and others. The goal is to assess whether the Rust ecosystem's documentation meets expectations for quality and usefulness, particularly in terms of teaching beginners and helping experts remember crucial information. The article emphasizes that good documentation should not only explain *what* the code does but also *why* it was designed that way.\n",
    "chinese_title": "Rust 文档生态系统概览",
    "chinese_summary": "本文回顾了 Rust 文档生态系统，重点关注其全面性、可发现性、理念性和可接近性。文章介绍了 Diátaxis 系统，该系统将文档分为四个象限：教程、操作指南、参考和解释。\n\n*   **教程：** 适合初学者，侧重于通过实践进行学习。它们缺乏全面性，但在可发现性和可接近性方面表现出色。\n*   **操作指南：** 针对具有基本能力的用户，解决现实世界的问题。比教程更全面，提供更高的可发现性，但可接近性较低。\n*   **参考：** 最大限度地全面，提供每个项目的详细描述。然而，它们缺乏理念性、可发现性和可接近性。\n*   **解释：** 稀有但有价值，解释设计选择背后的原因。它们增强了可发现性、全面性和理念性。\n\n随后，本文调查了各种流行的 Rust crate 的文档，评估它们对四个象限以及作者标准的遵守情况。这包括 `rand`、`axum`、`bevy`、`tokio` 等库。目的是评估 Rust 生态系统的文档是否满足对质量和实用性的期望，尤其是在教授初学者和帮助专家记住关键信息方面。本文强调，好的文档不仅应该解释代码*做什么*，还应该解释*为什么*这样设计。"
  },
  {
    "id": "43954459",
    "title": "DNS Piracy Blocking Orders: Google, Cloudflare, and OpenDNS Respond Differently",
    "url": "https://torrentfreak.com/dns-piracy-blocking-orders-google-cloudflare-and-opendns-respond-differently-250511/",
    "summary": "This article discusses the increasing trend of courts ordering DNS resolvers like OpenDNS, Cloudflare, and Google to block access to pirate websites, a move aimed at circumventing ISP-level blocks. Rightsholders are targeting public DNS resolvers because they are used to bypass blocking measures. The article highlights the different approaches these companies are taking in response to these legal orders.\n\nOpenDNS (Cisco) has chosen the most drastic measure, withdrawing its service entirely from countries where blocking orders are in place, like France and Belgium. Cloudflare, on the other hand, complies but claims to use \"alternate mechanisms\" rather than directly blocking through its public DNS resolver. Users accessing blocked domains through Cloudflare DNS receive an HTTP 451 error, and the block is logged in the Lumen Database. Google’s response is the least transparent. Its public DNS resolver (8.8.8.8) simply refuses the DNS query for blocked domains, resulting in a generic browser error for users with no indication that the site is blocked.\n\nThe article emphasizes that Google's approach lacks transparency and might violate the Belgian court's requirement for redirection to a dedicated information page. The author argues that transparency is crucial when interfering with DNS, particularly as similar site-blocking proposals involving public DNS resolvers are being considered in the United States. The different responses highlight the complexities and challenges of implementing DNS-level blocking orders, raising concerns about transparency and user awareness.\n",
    "chinese_title": "DNS盗版封锁令：谷歌、Cloudflare和OpenDNS的不同回应",
    "chinese_summary": "法院命令OpenDNS、Cloudflare和谷歌等DNS解析器屏蔽盗版网站访问的趋势日益增长，此举旨在规避ISP层面的屏蔽。版权所有者正瞄准公共DNS解析器，因为它们被用于绕过屏蔽措施。本文重点介绍了这些公司针对这些法律命令采取的不同应对方法。\n\nOpenDNS（思科）选择了最激烈的措施，完全从法国和比利时等实施屏蔽命令的国家撤回其服务。另一方面，Cloudflare虽然遵守规定，但声称使用“替代机制”，而不是通过其公共DNS解析器直接屏蔽。通过Cloudflare DNS访问被屏蔽域名的用户会收到HTTP 451错误，并且该屏蔽会被记录在Lumen数据库中。谷歌的反应最不透明。其公共DNS解析器（8.8.8.8）只是拒绝被屏蔽域名的DNS查询，导致用户出现通用的浏览器错误，而没有迹象表明该网站被屏蔽。\n\n本文强调谷歌的做法缺乏透明度，并可能违反比利时法院要求重定向到专用信息页面的规定。作者认为，干预DNS时透明度至关重要，特别是因为美国也在考虑涉及公共DNS解析器的类似网站屏蔽提案。不同的应对措施突显了实施DNS层面屏蔽命令的复杂性和挑战，引发了对透明度和用户知情权的担忧。"
  },
  {
    "id": "43954896",
    "title": "Plain Vanilla Web – Guide for de-frameworking yourself",
    "url": "https://plainvanillaweb.com/index.html",
    "summary": "This article, titled \"Plain Vanilla Web – Guide for de-frameworking yourself,\" introduces an approach to web development that avoids frameworks, build tools, and server-side logic in favor of leveraging core web standards. It advocates for building websites and web applications using only an editor, a browser, HTML, CSS, and JavaScript.\n\nThe core techniques covered include:\n\n*   **Components:** Using Web Components to create reusable building blocks, replacing the component-based approach of frameworks like React or Vue.\n*   **Styling:** Utilizing modern CSS features to replicate the functionality of CSS Modules, PostCSS, and SASS.\n*   **Sites:** Developing and deploying web projects based on Web Components without build tools, frameworks, or server-side logic.\n*   **Applications:** Building single-page applications (SPAs) with vanilla JavaScript, covering routing and state management.\n\nThe guide targets developers already familiar with HTML, CSS, and JavaScript. While acknowledging the power and speed offered by frameworks, the article argues that the complexity and maintenance overhead of frameworks can be avoided by adopting the \"plain vanilla\" approach. This trade-off prioritizes simplicity, zero-maintenance, and leverages the strong web standards support found in modern browsers. The next step is to learn about building components.\n",
    "chinese_title": "纯粹原生Web - 摆脱框架指南",
    "chinese_summary": "本文题为“原生Web：摆脱框架指南”，介绍了一种Web开发方法，该方法避免使用框架、构建工具和服务器端逻辑，而倾向于利用核心Web标准。它提倡仅使用编辑器、浏览器、HTML、CSS和JavaScript来构建网站和Web应用程序。\n\n涵盖的核心技术包括：\n\n*   **组件：** 使用Web Components创建可重用的构建块，取代React或Vue等框架的基于组件的方法。\n*   **样式：** 利用现代CSS特性来复制CSS Modules、PostCSS和SASS的功能。\n*   **站点：** 开发和部署基于Web Components的Web项目，无需构建工具、框架或服务器端逻辑。\n*   **应用程序：** 使用原生JavaScript构建单页应用程序(SPA)，涵盖路由和状态管理。\n\n该指南面向已经熟悉HTML、CSS和JavaScript的开发人员。文章承认框架提供的强大功能和速度，但也认为采用“原生”方法可以避免框架的复杂性和维护负担。这种权衡方案优先考虑简单性、零维护，并利用现代浏览器中强大的Web标准支持。下一步是学习构建组件。"
  },
  {
    "id": "43954178",
    "title": "JEP 515: Ahead-of-Time Method Profiling",
    "url": "https://openjdk.org/jeps/515",
    "summary": "JEP 515 proposes \"Ahead-of-Time Method Profiling\" to improve Java application startup and warmup times. It aims to make method execution profiles from a previous \"training run\" instantly available when the HotSpot JVM starts. This allows the JIT compiler to generate optimized native code immediately, rather than waiting to collect profiles during the application's early runtime.\n\nThe key goals are to accelerate application warmup, avoid code changes, and integrate with existing AOT cache workflows (JEP 483). The motivation stems from the need to identify and optimize \"hot methods\" (CPU-intensive methods) quickly. Currently, the JVM collects profiles during the application's warmup period, causing performance lags. JEP 515 shifts this profiling to a training run, storing the profiles in the AOT cache for use during production.\n\nThis approach doesn't replace online profiling or JIT compilation, but rather enhances them. The JIT compiler still adapts to real-time behavior, using the AOT profiles to initiate optimization earlier and more accurately. The example provided shows a 19% performance improvement with a small overhead in AOT cache size.\n\nThe proposal emphasizes the synergistic relationship between AOT profiling and eventual AOT compilation. Testing includes unit tests and integration with existing AOT cache tests. The risk assessment builds upon that of JEP 483, assuming that training runs provide valuable insights for production performance.\n",
    "chinese_title": "JEP 515：提前编译方法分析",
    "chinese_summary": "JEP 515 提议“提前方法分析”，以改善 Java 应用程序的启动和预热时间。其目标是在 HotSpot JVM 启动时，立即提供先前“训练运行”中的方法执行概要信息。这使得 JIT 编译器能够立即生成优化的本机代码，而无需等待在应用程序的早期运行时收集概要信息。\n\n关键目标是加速应用程序预热，避免代码更改，并与现有的 AOT 缓存工作流程（JEP 483）集成。其动机源于需要快速识别和优化“热方法”（CPU 密集型方法）。目前，JVM 在应用程序的预热期间收集概要信息，导致性能滞后。JEP 515 将此分析转移到训练运行中，并将概要信息存储在 AOT 缓存中，以便在生产期间使用。\n\n这种方法不会取代在线分析或 JIT 编译，而是增强它们。JIT 编译器仍然会适应实时行为，使用 AOT 概要信息来更早、更准确地启动优化。提供的示例显示，AOT 缓存大小略有增加，性能提高了 19%。\n\n该提案强调了 AOT 分析和最终 AOT 编译之间的协同关系。测试包括单元测试以及与现有 AOT 缓存测试的集成。风险评估基于 JEP 483，假设训练运行为生产性能提供有价值的见解。"
  },
  {
    "id": "43916818",
    "title": "Is there a balance to be struck between simple hierarchical models and",
    "url": "https://statmodeling.stat.columbia.edu/2024/05/26/is-there-a-balance-to-be-struck-between-simple-hierarchical-models-and-more-complex-hierarchical-models-that-augment-the-simple-frameworks-with-more-modeled-interactions-when-analyzing-real-data/",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "简单层级模型和……之间是否存在某种平衡？",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "43950976",
    "title": "Leaving Google",
    "url": "https://www.airs.com/blog/archives/670",
    "summary": "Ian Lance Taylor, a key contributor to the Go programming language, announces his departure from Google after 19 years. He joined the Go team in 2008, working alongside renowned programmers like Rob Pike, Ken Thompson, and Robert Griesemer. Taylor expresses astonishment at Go's widespread adoption, exceeding initial expectations.\n\nHis contributions included developing a Go frontend for the GCC compiler, adding Go support to Google's build system and SWIG, managing the team for a period, and contributing to the implementation of generics in Go 1.18 with Robert Griesemer.\n\nTaylor reflects on his role, acknowledging his strength in addressing immediate and future problems but also admitting a slowness in recognizing ideas that would enable programmers to achieve entirely new things. He believes his approach was beneficial for Go's success, but states that changes within Google and the Go project, coupled with the evolving programming landscape, have led him to conclude that he is no longer a good fit.\n\nDespite leaving Google, Taylor remains interested in Go's future. He believes programming languages must evolve to survive, particularly those with extensive standard libraries. He plans to take a break but hopes to contribute to Go again in the future.\n",
    "chinese_title": "离开谷歌",
    "chinese_summary": "Go语言关键贡献者Ian Lance Taylor宣布在谷歌工作19年后离职。他于2008年加入Go团队，与Rob Pike、Ken Thompson和Robert Griesemer等著名程序员共事。Taylor对Go语言的广泛应用感到惊讶，远超最初预期。\n\n他的贡献包括为GCC编译器开发Go前端，为谷歌的构建系统和SWIG添加Go支持，管理团队一段时间，并与Robert Griesemer共同为Go 1.18实现泛型。\n\nTaylor反思了自己的角色，承认自己擅长解决当前和未来的问题，但也承认自己未能快速认识到能让程序员实现全新想法的创意。他认为他的方法对Go的成功有益，但表示谷歌和Go项目内部的变化，加上不断发展的编程环境，使他得出结论，自己不再适合。\n\n尽管离开谷歌，Taylor仍然对Go的未来感兴趣。他认为编程语言必须不断发展才能生存，尤其是那些拥有广泛标准库的语言。他计划休息一段时间，但希望将来能再次为Go做出贡献。"
  },
  {
    "id": "43924082",
    "title": "An Introduction to Solid Queue for Ruby on Rails",
    "url": "https://blog.appsignal.com/2025/05/07/an-introduction-to-solid-queue-for-ruby-on-rails.html",
    "summary": "This article introduces Solid Queue, a new background job processing library in Rails 8, and explains why it was created. Solid Queue's primary selling point is that it eliminates the need for additional infrastructure dependencies like Redis, relying solely on the database.\n\nThe article highlights the key components: Jobs (ActiveRecord models) and Workers (processes that execute jobs). It explains how jobs are enqueued, executed, and managed using multiple database tables, including `solid_queue_jobs`, `solid_queue_ready_executions`, `solid_queue_claimed_executions`, and `solid_queue_processes`.\n\nThe article emphasizes Solid Queue's performance and safety features. It discusses how `solid_queue_ready_executions` improves performance by providing a smaller table for workers to poll. It also explains the importance of `FOR UPDATE SKIP LOCKED` in modern databases for concurrent polling. The article explains how `solid_queue_claimed_executions` and `solid_queue_processes`, along with a supervisor process, prevent jobs from being lost if a worker crashes. The supervisor monitors worker processes and re-queues jobs claimed by deceased workers.\n",
    "chinese_title": "Ruby on Rails 的 Solid Queue 简介",
    "chinese_summary": "本文介绍了Rails 8中新的后台任务处理库Solid Queue，并解释了其创建原因。Solid Queue的主要卖点是它消除了对Redis等额外基础设施依赖的需求，仅依赖于数据库。\n\n本文重点介绍了关键组件：任务（ActiveRecord模型）和工作进程（执行任务的进程）。它解释了如何使用多个数据库表（包括`solid_queue_jobs`、`solid_queue_ready_executions`、`solid_queue_claimed_executions`和`solid_queue_processes`）来排队、执行和管理任务。\n\n本文强调了Solid Queue的性能和安全特性。它讨论了`solid_queue_ready_executions`如何通过为工作进程提供一个更小的轮询表来提高性能。它还解释了`FOR UPDATE SKIP LOCKED`在现代数据库中用于并发轮询的重要性。本文解释了`solid_queue_claimed_executions`和`solid_queue_processes`，以及一个监控进程，如何防止任务在工作进程崩溃时丢失。监控进程会监视工作进程并重新排队已死亡工作进程所认领的任务。"
  },
  {
    "id": "43954488",
    "title": "High-School Shop Students Attract Skilled-Trades Job Offers",
    "url": "https://www.wsj.com/lifestyle/careers/skilled-trades-high-school-recruitment-fd9f8257",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "高中职业技术学生吸引技术行业工作邀约",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "43932871",
    "title": "How to (actually) prove it – New Frontiers of Mathematics and Computing in Lean",
    "url": "https://kirancodes.me/posts/log-how-to-prove-it-maths.html",
    "summary": "This article highlights the exciting new frontier of mathematics and computing emerging from the use of the Lean Theorem prover by prominent mathematicians. It focuses on the \"Lean Blueprints\" tool, a graph-based mechanism used by mathematicians to plan and track the formalization of mathematical results. The blueprint visualizes the progress of definitions, lemmas, and theorems, showing their status (unwritten, stated, proven) over time.\n\nThe author argues that these blueprints, coupled with version control, provide unprecedented access to the thought processes and strategies mathematicians employ when proving theorems. By analyzing the evolution of these blueprints, researchers can gain insights into how mathematicians conjecture lemmas, tackle problems, and build complex proofs.\n\nThe article showcases animations illustrating the evolution of Lean Blueprints for several active formalization projects, including the Polynomial Freiman Ruzsa conjecture, the Kelley-Meka bound on Roth numbers, and Carleson's theorem. The visualizations reveal patterns in development, such as bursts of activity where mathematicians sketch out large portions of a proof, followed by periods of verification.\n\nThe author concludes by presenting visualizations for other projects, observing different development patterns and highlighting the unique nature of projects aiming to develop new mathematics within Lean itself. The article encourages readers to explore the author's code for extracting and visualizing blueprint data, emphasizing the potential for new tools and techniques, including ML models, to aid mathematicians in proving theorems.\n",
    "chinese_title": "如何在 Lean 中（真正）证明它 —— 数学和计算的新前沿",
    "chinese_summary": "本文重点介绍了著名数学家使用Lean定理证明器所涌现出的数学和计算领域令人兴奋的新前沿。文章聚焦于“Lean Blueprints”工具，这是一种基于图的机制，数学家们利用它来规划和跟踪数学结果的形式化过程。蓝图可视化定义、引理和定理的进度，显示它们随时间的状态（未编写、已声明、已证明）。\n\n作者认为，这些蓝图与版本控制相结合，以前所未有的方式揭示了数学家在证明定理时所采用的思维过程和策略。通过分析这些蓝图的演变，研究人员可以深入了解数学家如何推测引理、解决问题和构建复杂的证明。\n\n文章展示了若干活跃形式化项目的Lean Blueprints演变动画，包括Polynomial Freiman Ruzsa猜想、Roth数的Kelley-Meka界限以及Carleson定理。这些可视化揭示了开发模式，例如数学家们勾勒出大部分证明的大量活动爆发，随后是验证期。\n\n作者最后展示了其他项目的可视化，观察到不同的开发模式，并强调了旨在在Lean本身内部开发新数学的项目的独特性质。文章鼓励读者探索作者用于提取和可视化蓝图数据的代码，强调了新工具和技术的潜力，包括ML模型，以帮助数学家证明定理。"
  },
  {
    "id": "43953884",
    "title": "In 2025, venture capital can't pretend everything is fine any more",
    "url": "https://pivot-to-ai.com/2025/05/03/in-2025-venture-capital-cant-pretend-everything-is-fine-any-more/",
    "summary": "This article paints a bleak picture of the venture capital landscape in early 2025, arguing that the industry is struggling and desperately clinging to AI as its last hope. The Pitchbook-NVCA Venture Monitor for Q1 2025 reveals a moribund VC market, propped up almost entirely by OpenAI-related deals, fueled by FOMO and a belief in the \"marketing brochure version of AI.\"\n\nThe author contends that Trump's tariffs have exacerbated existing problems, primarily the industry's inability to adapt to the end of zero-interest rates. The previous era of cheap money led to reckless investments in unsustainable businesses, and now that money is scarce, VCs are struggling to generate returns.\n\nOutside of AI, early-stage startups are struggling to attract funding, and even funded companies are being acquired prematurely. A key problem is the inability of startups to \"cash out\" through IPOs or acquisitions, leaving investors without returns and hindering new investment. The author criticizes the industry's reliance on inflated valuations and its failure to acknowledge the underlying problems.\n\nUltimately, the article portrays the VC industry as clueless and out of its depth, lacking a coherent plan for the future beyond hoping for market recovery and a change in Trump's policies. The author highlights the naivete of some VCs, pointing to their association with controversial figures and movements as evidence of poor judgment. The author concludes with a sense of schadenfreude, noting the VC class's discomfort while the rest of the world faces more significant challenges.\n",
    "chinese_title": "2025年，风险投资再也无法假装一切安好",
    "chinese_summary": "2025年初创投业：黯淡前景，孤注一掷人工智能"
  },
  {
    "id": "43909986",
    "title": "Four years of running a SaaS in a competitive market",
    "url": "https://maxrozen.com/on-four-years-running-saas-competitive-market",
    "summary": "Max Rozen shares his experiences over four years of running OnlineOrNot, a self-funded SaaS in a competitive market. He emphasizes core principles that have remained constant: dedicating two hours every workday, avoiding side projects to focus efforts, solving customer pain, and being ruthlessly iterative.\n\nRozen highlights key lessons learned, including the importance of starting to build quickly after minimal research, prioritizing solving customer pain over pushing subscriptions, shipping small and often, and focusing on early-stage functionality rather than immediate scalability. He advises having an early-access program for feature testing and implementing a free trial as soon as possible to showcase the product's value.\n\nHe also stresses the importance of comprehensive documentation, optimizing for mobile, and understanding customer acquisition channels. Rozen cautions against invasive analytics and emphasizes the value of direct customer communication. A significant portion of development time is spent on the SaaS platform's infrastructure rather than the core problem itself. Pricing requires experimentation, and MRR isn't a reliable immediate metric for success. Instead, focus on usage metrics. Finally, he advises against offering \"unlimited\" anything.\n",
    "chinese_title": "在竞争激烈的市场中运营SaaS的四年",
    "chinese_summary": "马克斯·罗森分享了他四年运营OnlineOrNot的经验，这是一个在竞争激烈的市场中自筹资金的SaaS平台。他强调了始终如一的核心原则：每个工作日投入两个小时，避免副项目以集中精力，解决客户痛点，并坚持迭代。\n\n罗森强调了重要的经验教训，包括在最少的研究后快速开始构建，优先解决客户痛点而非推广订阅，小步快跑地发布，以及专注于早期功能而非立即扩展。他建议设立早期访问计划进行功能测试，并尽快实施免费试用以展示产品的价值。\n\n他还强调了全面文档的重要性，针对移动设备进行优化，以及了解客户获取渠道。 罗森警告不要进行侵入式分析，并强调直接客户沟通的价值。 大部分开发时间都花在了SaaS平台的基础设施上，而不是核心问题本身。 定价需要实验，MRR并不是衡量成功的可靠即时指标。 相反，应关注使用指标。 最后，他建议不要提供任何“无限”服务。"
  },
  {
    "id": "43950046",
    "title": "Fandom sells gaming media brand Giant Bomb to long-term staff",
    "url": "https://about.fandom.com/news/fandom-sells-giant-bomb-to-independent-creators",
    "summary": "Fandom has sold the gaming media brand Giant Bomb to long-time staff members and content creators Jeff Bakalar and Jeff Grubb. The announcement was made at PAX East. The specifics of the deal were not disclosed.\n\nFandom stated the sale aligns with its strategic focus on supporting creators and returning Giant Bomb to its independent roots. Bakalar and Grubb emphasized the importance of the community's support in making the acquisition possible and promised more details on their future plans soon, ensuring support goes directly to the team.\n\nGiant Bomb's programming, which was temporarily paused during the acquisition process, will resume as quickly as possible under the new ownership.\n\nGiant Bomb, founded in 2008, is known for its gaming news, reviews, commentary, and video content, offering a unique and irreverent perspective on the industry. Fandom is a large fan platform for entertainment and gaming content with numerous wikis, reaching millions of unique visitors each month.\n",
    "chinese_title": "Fandom将游戏媒体品牌Giant Bomb出售给长期员工",
    "chinese_summary": "Fandom已将游戏媒体品牌Giant Bomb出售给长期员工和内容创作者Jeff Bakalar和Jeff Grubb。该消息在PAX East上宣布。交易细节未披露。\n\nFandom表示，此次出售符合其战略重点，即支持创作者并将Giant Bomb回归其独立本源。Bakalar和Grubb强调了社区支持在促成此次收购中的重要性，并承诺尽快公布他们未来计划的更多细节，确保支持直接流向团队。\n\nGiant Bomb的节目制作，在收购期间曾暂时中断，将在新所有权下尽快恢复。\n\nGiant Bomb成立于2008年，以其游戏新闻、评测、评论和视频内容而闻名，对该行业提供独特而幽默的视角。Fandom是一个大型娱乐和游戏内容粉丝平台，拥有众多维基，每月吸引数百万独立访客。"
  },
  {
    "id": "43952239",
    "title": "Build iOS Apps on Linux and Windows (WSL)",
    "url": "https://forums.swift.org/t/xtool-cross-platform-xcode-replacement-build-ios-apps-on-linux-and-more/79803",
    "summary": "This article announces `xtool`, a new open-source tool that enables building, signing, and deploying iOS apps from Linux and Windows (WSL), effectively replacing Xcode for some workflows even on macOS. It's SwiftPM-based and declarative, streamlining iOS development.\n\n`xtool` facilitates building Swift packages into iOS apps, signing them, installing them, and interacting with Apple Developer Services programmatically. The author provides DocC articles and a tutorial on Swift Package Index to help users get started.\n\nWhile `xtool` offers a core build-run-edit loop, some features are either infeasible or not yet implemented: Interface Builder support is unlikely due to SwiftUI's prevalence. Asset catalog support is planned but requires reverse engineering. Apple-proprietary macros need reverse engineering or WebAssembly support from Apple. App Extensions, LLDB debugging (especially with recent iOS changes), and App Store deployment are planned but require further development.\n\nThe author welcomes external contributions given the complexity of replicating Xcode's full functionality. `xtool` represents 8 years of work and aims to open up iOS development to more platforms.\n",
    "chinese_title": "在Linux和Windows (WSL)上构建iOS应用",
    "chinese_summary": "本文宣布推出`xtool`，一款新的开源工具，可在Linux和Windows（WSL）上构建、签名和部署iOS应用程序，从而在某些工作流程中有效取代macOS上的Xcode。它基于SwiftPM且具有声明性，简化了iOS开发。\n\n`xtool`有助于将Swift软件包构建为iOS应用程序，对其进行签名、安装，并以编程方式与Apple Developer Services交互。作者提供了DocC文章和Swift Package Index上的教程，以帮助用户入门。\n\n虽然`xtool`提供了核心的构建-运行-编辑循环，但某些功能要么不可行，要么尚未实现：由于SwiftUI的普及，不太可能支持Interface Builder。计划支持资产目录，但需要进行逆向工程。Apple专有的宏需要逆向工程或Apple的WebAssembly支持。应用扩展、LLDB调试（尤其是最近iOS更改后的调试）以及App Store部署都已在计划中，但需要进一步开发。\n\n鉴于复制Xcode完整功能的复杂性，作者欢迎外部贡献。`xtool`代表着8年的工作成果，旨在向更多平台开放iOS开发。"
  },
  {
    "id": "43949542",
    "title": "Observations from people-watching",
    "url": "https://skincontact.substack.com/p/21-observations-from-people-watching",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "街头观察",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "43945820",
    "title": "US vs. Google amicus curiae brief of Y Combinator in support of plaintiffs [pdf]",
    "url": "https://storage.courtlistener.com/recap/gov.uscourts.dcd.223205/gov.uscourts.dcd.223205.1300.1.pdf",
    "summary": "This document appears to be the initial section of an amicus curiae brief filed by Y Combinator (YC) in the case of US vs. Google. The brief is structured as a PDF file.\n\nThe PDF metadata indicates the document was created on May 9, 2025, by Patrick Greco, using Microsoft Word and modified using iText Core. The title is \"YC for filing FINAL DRAFT Y Combinator Amicus Brief.\"\n\nThe PDF consists of multiple pages (19 according to the \"Count\"). The provided text represents the initial structure of the PDF, defining the document catalog, pages, and resources.  Each page object contains instructions for displaying content, defining its size (MediaBox and CropBox), resources like fonts, and references to content streams.  The content streams themselves are compressed using FlateDecode. Given the garbled nature of the decoded streams visible in the provided output, the actual arguments and content of Y Combinator's amicus brief remain unclear. The brief likely argues about issues relevant to startups and competition in the context of the US vs. Google case.\n",
    "chinese_title": "美国诉谷歌案中，Y Combinator支持原告的法庭之友陈述书 [pdf]",
    "chinese_summary": "该文档似乎是Y Combinator (YC) 在美国诉谷歌案中提交的“法庭之友”意见陈述的初始部分。该陈述的文件结构为PDF文件。\n\nPDF元数据显示，该文档由Patrick Greco于2025年5月9日使用Microsoft Word创建，并使用iText Core进行了修改。 标题为“YC for filing FINAL DRAFT Y Combinator Amicus Brief”（YC提交最终稿Y Combinator“法庭之友”意见陈述）。\n\n该PDF文件包含多页（根据“Count”显示为19页）。提供的文本表示PDF的初始结构，定义了文档目录、页面和资源。 每个页面对象包含显示内容的指令，定义其大小（MediaBox和CropBox）、资源（如字体）以及对内容流的引用。内容流本身使用FlateDecode进行压缩。 鉴于提供的输出中可见的解码流的乱码性质，Y Combinator的“法庭之友”意见陈述的实际论点和内容仍然不清楚。 该陈述很可能论述了与初创企业和美国诉谷歌案中的竞争相关的问题。"
  },
  {
    "id": "43950525",
    "title": "Dotless Domains",
    "url": "https://lab.avl.la/dotless/",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "无点域名",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "43951368",
    "title": "Fan Service",
    "url": "https://flak.tedunangst.com/post/fan-service",
    "summary": "Tedu details their experience writing an ACPI WMI driver for ASUS laptops in OpenBSD to control fan speed, a feature accessible through hotkeys in Windows but non-functional in OpenBSD. The driver aims to replicate the fan control functionality, allowing users to switch between whisper and megablast modes and indirectly influence performance and battery life.\n\nThe process involved understanding ACPI and WMI, particularly how ASUS implements custom functionalities through non-standard ACPI methods identified by GUIDs. The author then develops a driver that reads the _WDG buffer to identify the relevant methods and responds to hotkey events. They debugged endianness issues and event handling, eventually discovering the correct argument to pass to the _WED method to receive event codes.\n\nThe author then implemented code to get and set device state, focusing initially on the keyboard backlight for testing and later on the fan profile. They resolved issues by comparing their code to the Linux driver and examining the laptop's ACPI code through `acpidump`. They discovered the correct device ID by analyzing the ASL code and incorporating a Vivobook specific define, enabling fan control.\n\nThe final result allows users to switch fan profiles, improving battery life and reducing noise at the cost of slower performance during intensive tasks. The driver works across different ASUS models. The author contrasts OpenBSD's driver organization, where related files are kept together, with Linux's more dispersed structure.\n",
    "chinese_title": "粉丝福利",
    "chinese_summary": "Tedu详述了他们在OpenBSD系统中为华硕笔记本电脑编写ACPI WMI驱动程序，以控制风扇转速的经验。该功能在Windows系统中可通过热键访问，但在OpenBSD系统中无法使用。该驱动旨在复刻风扇控制功能，允许用户在静音和最高速模式之间切换，从而间接影响性能和电池续航。\n\n该过程涉及理解ACPI和WMI，特别是华硕如何通过GUID标识的非标准ACPI方法实现自定义功能。作者随后开发了一个驱动程序，读取_WDG缓冲区以识别相关方法，并响应热键事件。他们调试了字节序问题和事件处理，最终发现了传递给_WED方法的正确参数，以接收事件代码。\n\n作者然后实现了用于获取和设置设备状态的代码，最初专注于键盘背光进行测试，后来专注于风扇配置文件。他们通过将代码与Linux驱动程序进行比较，并通过`acpidump`检查笔记本电脑的ACPI代码来解决问题。他们通过分析ASL代码并加入Vivobook特定定义，发现了正确的设备ID，从而实现了风扇控制。\n\n最终结果允许用户切换风扇模式，从而在牺牲高负载任务时的性能的情况下，提高电池续航能力并降低噪音。该驱动适用于不同的华硕型号。作者将OpenBSD的驱动程序组织方式（相关文件保存在一起）与Linux更分散的结构进行了对比。"
  },
  {
    "id": "43949238",
    "title": "Sierpiński Triangle? In My Bitwise and?",
    "url": "https://lcamtuf.substack.com/p/sierpinski-triangle-in-my-bitwise",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "谢尔宾斯基三角形？在我的按位与里？",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "43947630",
    "title": "For $595, you get what nobody else can give you for twice the price (1982) [pdf]",
    "url": "https://s3data.computerhistory.org/brochures/commodore.commodore64.1982.102646264.pdf",
    "summary": "I am sorry, but I cannot provide a meaningful summary of the article as the provided content seems to be an unreadable and nonsensical PDF code, filled with image artifacts and metadata. There is no discernible text or coherent information to extract and summarize. It appears to be corrupted or incomplete.\n",
    "chinese_title": "以595美元的价格，你得到别人花双倍价钱也给不了你的东西（1982）[pdf]",
    "chinese_summary": "很抱歉，我无法提供有意义的文章摘要，因为提供的内容似乎是无法读取且毫无意义的PDF代码，其中充满了图像伪影和元数据。没有可辨别的文本或连贯的信息可供提取和总结。它似乎已损坏或不完整。"
  },
  {
    "id": "43951985",
    "title": "Absolute Zero: Reinforced Self-Play Reasoning with Zero Data",
    "url": "https://arxiv.org/abs/2505.03335",
    "summary": "This paper introduces \"Absolute Zero,\" a novel Reinforcement Learning with Verifiable Rewards (RLVR) paradigm. It addresses the limitations of existing RLVR methods that rely on human-curated datasets for training reasoning abilities in large language models. The core problem is the potential scalability issues of relying on human supervision, especially when considering future AI surpassing human intelligence.\n\nAbsolute Zero overcomes this by enabling a single model to learn without *any* external data. It proposes a system, the Absolute Zero Reasoner (AZR), which self-evolves its training curriculum by proposing tasks tailored to maximize its own learning progress. AZR then improves its reasoning skills by solving these self-generated tasks. A key component is a code executor that validates both the proposed code reasoning tasks and their answers, providing a verifiable reward signal to guide the learning process. This creates a grounded, open-ended learning environment.\n\nThe authors demonstrate that AZR, trained entirely without external data, achieves state-of-the-art (SOTA) performance on coding and mathematical reasoning tasks, surpassing models trained with significant amounts of human-curated data. Furthermore, the approach is shown to be scalable across different model sizes and compatible with various model architectures. The research suggests a path towards developing more autonomous and capable AI systems that can learn and reason without human dependence.\n",
    "chinese_title": "绝对零度：零数据下的强化自博弈推理",
    "chinese_summary": "本文介绍了一种名为“绝对零度”的新型可验证奖励强化学习（RLVR）范式。它解决了现有RLVR方法依赖人工标注数据集训练大型语言模型推理能力的局限性。核心问题在于依赖人类监督的潜在可扩展性问题，尤其是在考虑到未来人工智能超越人类智能时。\n\n“绝对零度”通过使单个模型无需*任何*外部数据即可学习来克服这一问题。它提出了一个系统，即“绝对零度推理器”（AZR），通过提出定制任务来最大化自身学习进度，从而自我进化其训练课程。然后，AZR通过解决这些自我生成的任务来提高其推理能力。一个关键组成部分是一个代码执行器，用于验证所提出的代码推理任务及其答案，从而提供可验证的奖励信号来指导学习过程。这创建了一个基于实际、开放式的学习环境。\n\n作者证明，完全无需外部数据训练的AZR在编码和数学推理任务上实现了最先进（SOTA）的性能，超过了使用大量人工标注数据训练的模型。此外，该方法被证明可以跨不同模型尺寸进行扩展，并与各种模型架构兼容。这项研究表明，开发更自主、更有能力的人工智能系统，使其无需依赖人类即可学习和推理，是未来发展的方向。"
  },
  {
    "id": "43945993",
    "title": "A critical look at MCP",
    "url": "https://raz.sh/blog/2025-05-02_a_critical_look_at_mcp",
    "summary": "This article critically examines the Model Context Protocol (MCP), a standard intended to allow LLMs to interact with the world as agents. The author, who attempted to implement an MCP server in Go, expresses disappointment with the protocol's design and implementation, finding it lacking in mature engineering practices, documentation, and specification.\n\nThe core criticism focuses on the HTTP transport methods: HTTP+SSE and \"Streamable HTTP.\" The author argues these methods are overly complex, attempting to emulate socket-like behavior (like stdio) without using WebSockets, which they believe is a more suitable and straightforward solution. They detail the numerous ways to initiate sessions, open SSE connections, and respond to requests within the HTTP transport methods, leading to increased complexity, potential for inconsistency, scalability concerns, and security vulnerabilities like session hijacking.\n\nThe author also criticizes the opinionated authorization requirements, where HTTP transport mandates OAuth2 while stdio allows for simpler API keys. They advocate for mimicking stdio's simplicity in the HTTP transport using WebSockets.\n\nFurthermore, the article touches on the emergence of competing protocols like IBM's ACP and Google's A2A, suggesting they are largely redundant and could be implemented as tools within MCP. The author's overall sentiment is one of disillusionment, lamenting the industry's apparent haste in adopting immature technologies. They believe that optimizing for common use cases with robust solutions like WebSockets is preferable to complex corner-case solutions.\n",
    "chinese_title": "对MCP的批判性审视",
    "chinese_summary": "本文批判性地审视了模型上下文协议（MCP），该协议旨在使大型语言模型能够以代理的形式与世界互动。作者试图用Go语言实现一个MCP服务器，但对该协议的设计和实现表示失望，认为其缺乏成熟的工程实践、文档和规范。\n\n核心批评集中在HTTP传输方法上：HTTP+SSE和“流式HTTP”。作者认为这些方法过于复杂，试图在不使用WebSocket的情况下模拟类似套接字的行为（如stdio），而他们认为WebSocket是更合适和直接的解决方案。他们详细描述了在HTTP传输方法中启动会话、打开SSE连接以及响应请求的多种方式，导致复杂性增加，可能出现不一致性，存在可扩展性问题，以及诸如会话劫持等安全漏洞。\n\n作者还批评了其武断的授权要求，其中HTTP传输强制使用OAuth2，而stdio则允许使用更简单的API密钥。他们提倡在使用WebSocket的HTTP传输中模仿stdio的简单性。\n\n此外，本文还提到了诸如IBM的ACP和Google的A2A等竞争协议的出现，暗示这些协议在很大程度上是多余的，并且可以作为MCP中的工具来实现。作者的总体情绪是幻灭，对行业明显急于采用不成熟的技术表示惋惜。他们认为，使用像WebSocket这样强大的解决方案来优化常见用例，比复杂的边缘案例解决方案更好。"
  },
  {
    "id": "43930725",
    "title": "A brief history of the numeric keypad",
    "url": "https://www.doc.cc/articles/a-brief-history-of-the-numeric-keypad",
    "summary": "This article explores the history behind the differing numeric keypad layouts on telephones (1-2-3 at the top) and calculators (7-8-9 at the top). It traces the evolution of the numeric keypad back to the early 19th century with key-driven calculator machines like Jean-Baptiste Schwilgué's invention. The article then discusses the development of cash registers, specifically Dorr Felt's Comptometer which featured a 9-to-1 layout, and explores potential reasons for this design, including mechanical considerations and efficiency.\n\nThe Dalton adding machine in 1902 was a significant advancement, being the first to include the 0 key. Later, David Sundstrand's 3x3+1 layout (7-8-9 at the top) became the standard for calculators.\n\nThe article then shifts to telephones, highlighting that Bell Telephone Company experimented with push-button phones before the rotary dial. As phone numbers increased in length, AT&T conducted studies to determine the best keypad configuration for push-button phones.  Surprisingly, the calculator layout wasn't favored; users preferred a left-to-right, top-to-bottom layout (1-2-3 at the top).\n\nUltimately, the article suggests that design decisions are influenced by a combination of technology, ergonomics, user perception, and familiarity. The continued adherence to these historical layouts in modern digital applications is primarily due to user familiarity and convention rather than inherent efficiency. The article concludes with a timeline of key events in the development of numeric keypads.\n",
    "chinese_title": "数字小键盘简史",
    "chinese_summary": "本文探讨了电话（1-2-3在上）和计算器（7-8-9在上）数字键盘布局差异的历史渊源。文章追溯了数字键盘的发展历程，最早可追溯至19世纪初，以让-巴蒂斯特·施维尔格发明的键盘式计算器等机器为代表。随后，文章讨论了收银机的发展，特别是多尔·费尔特的康普托米特计算机，它采用了9到1的布局，并探讨了这种设计的潜在原因，包括机械考量和效率。\n\n1902年的道尔顿加法机是一项重大进步，是第一台包含0键的机器。之后，大卫·桑德斯特兰德的3x3+1布局（7-8-9在上）成为计算器的标准。\n\n文章随后转向电话，强调贝尔电话公司在转盘拨号之前就尝试过按钮电话。随着电话号码长度的增加，美国电话电报公司进行了研究，以确定按钮电话的最佳键盘配置。令人惊讶的是，计算器布局并未受到青睐；用户更喜欢从左到右、从上到下的布局（1-2-3在上）。\n\n最终，文章认为设计决策受到技术、人体工程学、用户感知和熟悉程度等多种因素的影响。现代数字应用继续沿用这些历史布局，主要是因为用户的熟悉程度和习惯，而不是因为其固有的效率。文章最后给出了数字键盘发展中的关键事件时间表。"
  },
  {
    "id": "43951588",
    "title": "One-Click RCE in Asus's Preinstalled Driver Software",
    "url": "https://mrbruh.com/asusdriverhub/",
    "summary": "This article details a one-click Remote Code Execution (RCE) vulnerability found in ASUS's preinstalled DriverHub software. The author, \"mrbruh,\" discovered that DriverHub, which manages driver updates, uses an unsecured RPC (Remote Procedure Call) mechanism. The software only checked if the \"origin\" header of requests contained \"driverhub.asus.com,\" making it vulnerable to subdomain hijacking like \"driverhub.asus.com.mrbruh.com.\"\n\nThe author identified several callable endpoints, including the dangerous `UpdateApp`, which allows downloading and executing files. While it validated ASUS signatures, the author cleverly exploited this by crafting a malicious AsusSetup.ini file that, when used with the legitimate, signed AsusSetup.exe (downloaded via `UpdateApp`), executed arbitrary code (\"calc.exe\" in the PoC). This was possible because AsusSetup.exe, when run silently, reads instructions from the ini file.\n\nThe vulnerability allows attackers to remotely execute code with administrative privileges, essentially taking control of the affected system with a single click. The author promptly reported the vulnerability to ASUS, who patched the software. CVEs (CVE-2025-3462 and CVE-2025-3463) were later assigned. While ASUS claimed it only affected motherboards, the author clarifies it affects any device with DriverHub installed. The author also notes the misleading CVE description and the fact that DriverHub installs bloatware along with drivers. Despite the ordeal, the author still has a non-functional onboard Wi-Fi adapter.\n",
    "chinese_title": "华硕预装驱动软件中的一键RCE漏洞",
    "chinese_summary": "本文详细介绍了一个在华硕预装的DriverHub软件中发现的一键远程代码执行（RCE）漏洞。作者“mrbruh”发现，负责驱动更新的DriverHub软件使用了一种不安全的RPC（远程过程调用）机制。该软件仅检查请求的“origin”标头是否包含“driverhub.asus.com”，使其容易受到子域名劫持，例如“driverhub.asus.com.mrbruh.com”。\n\n作者识别出多个可调用的端点，包括危险的`UpdateApp`，该端点允许下载和执行文件。虽然它验证了华硕签名，但作者巧妙地利用这一点，通过制作一个恶意的AsusSetup.ini文件，该文件与合法的、已签名的AsusSetup.exe（通过`UpdateApp`下载）一起使用时，执行了任意代码（PoC中为“calc.exe”）。之所以可行，是因为AsusSetup.exe在静默运行时，会从ini文件中读取指令。\n\n该漏洞允许攻击者以管理员权限远程执行代码，实际上只需单击一下即可控制受影响的系统。作者立即向华硕报告了该漏洞，华硕修复了该软件。后来分配了CVE（CVE-2025-3462和CVE-2025-3463）。虽然华硕声称它只影响主板，但作者澄清说它影响任何安装了DriverHub的设备。作者还指出，CVE描述具有误导性，并且DriverHub在安装驱动程序的同时还会安装臃肿软件。尽管经历了种种磨难，作者仍然有一个无法正常工作的板载Wi-Fi适配器。"
  },
  {
    "id": "43953272",
    "title": "What the hell are rare earth elements?",
    "url": "https://media.hubspot.com/what-the-hell-are-rare-earth-elements",
    "summary": "This article explains what rare earth elements are and why they're important, focusing on the US's loss of dominance in the industry to China.\n\nRare earth elements are 17 elements essential for many technologies like smartphones, EVs, and military equipment. While not geographically rare, extracting, processing, and refining them is complex, environmentally risky, and expensive.\n\nThe US once led in rare earth mining and processing, particularly through Molycorp's Mountain Pass mine. However, Molycorp shared processing blueprints with China, which then undercut Molycorp's prices due to cheaper labor and laxer environmental regulations. By the mid-1990s, China dominated the industry, ultimately closing the US's Molycorp mine.\n\nChina now controls ~60-70% of rare earth mining, ~90% of processing, and ~95% of permanent magnet production. China has also used its dominance politically, restricting exports to Japan in 2010 and recently limiting exports of rare earth processing technology.\n\nThe US is attempting to revive its rare earth industry with government subsidies to companies like MP Materials, aiming to increase domestic production and processing. However, China's existing capacity vastly outweighs current US efforts.\n\nThe article concludes by questioning whether there's sufficient market demand to justify significant investment in a US-based rare earth supply chain. The use of rare earths is smaller than other metals, and there are efforts to create magnets without them. Despite these challenges, rare earth elements remain a hot topic.\n",
    "chinese_title": "稀土元素究竟是什么？",
    "chinese_summary": "本文解释了什么是稀土元素以及它们为何重要，重点关注美国在该行业的主导地位如何丧失并落入中国手中。\n\n稀土元素是17种对智能手机、电动汽车和军事装备等众多技术至关重要的元素。虽然它们在地质分布上并不稀少，但提取、加工和提炼过程复杂、环境风险高且成本昂贵。\n\n美国曾经在稀土开采和加工方面处于领先地位，特别是通过莫利矿业公司的芒廷帕斯矿。然而，莫利矿业公司与中国分享了加工蓝图，中国随后通过更廉价的劳动力和更宽松的环境法规压低了莫利矿业公司的价格。到20世纪90年代中期，中国主导了该行业，最终导致美国的莫利矿业公司矿山关闭。\n\n中国目前控制着约60-70%的稀土开采，约90%的加工以及约95%的永磁体生产。中国还将其主导地位用于政治目的，在2010年限制了对日本的出口，最近又限制了稀土加工技术的出口。\n\n美国正试图通过政府补贴MP Materials等公司来复兴其稀土产业，旨在提高国内产量和加工能力。然而，中国现有的产能远大于美国目前的努力。\n\n文章最后质疑是否存在足够的市场需求来证明对美国稀土供应链的大规模投资是合理的。稀土的使用量小于其他金属，并且正在努力开发不含稀土的磁铁。尽管面临这些挑战，稀土元素仍然是一个热门话题。"
  },
  {
    "id": "43948945",
    "title": "Show HN: Xenolab – Rasp Pi monitor for my pet carnivourus plants",
    "url": "https://github.com/blackrabbit17/xenolab",
    "summary": "This \"Show HN\" post details a Raspberry Pi 5 project called \"Xenolab,\" a semi-autonomous biosurveillance module designed for monitoring carnivorous plants. The project highlights the creator's interest in combining 3D printing and electronics outside of their primary job.\n\nXenolab boasts an array of features including a 7-inch touchscreen, temperature and humidity monitors, a fan for simulating wind, a 24 RGB LED array for light simulation, and a soil moisture sensor. These components are controlled by USB relays connected to the Raspberry Pi. A warning is included about using the system with \"Triffids\" due to historical data suggesting negative outcomes.\n\nThe post includes a breakdown of the electrical components utilized, divided into categories like \"Intel & Control,\" \"Atmospherics,\" and \"Computing.\" The creator admits their novice status in CAD design and used Tinkercad to create the physical structure. The post includes pictures of the build process, from initial component setup and 3D printing to sensor integration and final testing.\n",
    "chinese_title": "展示HN：Xenolab – 我家食肉植物的树莓派监控器",
    "chinese_summary": "此“Show HN”帖子详细介绍了一个名为“Xenolab”的树莓派5项目，这是一个半自主生物监测模块，旨在监测食肉植物。该项目突出了创作者在主要工作之外，将3D打印和电子技术相结合的兴趣。\n\nXenolab拥有一系列功能，包括一个7英寸触摸屏、温湿度监测器、一个模拟风的电风扇、一个24 RGB LED阵列用于模拟光照，以及一个土壤湿度传感器。 这些组件由连接到树莓派的USB继电器控制。 帖子中包含一个警告，指出由于历史数据表明负面结果，请勿将该系统与“三叶草”一起使用。\n\n该帖子包括对所用电子元件的详细分类，分为“智能与控制”、“大气环境”和“计算”等类别。 创作者承认他们在CAD设计方面还是新手，并使用Tinkercad创建了物理结构。 该帖子包含构建过程的图片，从初始组件设置和3D打印到传感器集成和最终测试。"
  },
  {
    "id": "43918478",
    "title": "Engineers develop wearable heart attack detection technology",
    "url": "https://medicalxpress.com/news/2025-04-wearable-heart-technology.html",
    "summary": "University of Mississippi engineers have developed a wearable heart attack detection technology that is faster and more accurate than traditional methods. The technology consists of a lightweight, energy-efficient chip embedded in wearable devices that uses AI and advanced mathematics to analyze ECGs in real-time. The chip boasts a 92.4% accuracy rate in detecting heart attacks.\n\nThe device aims to shorten the time between the onset of a heart attack and treatment, potentially saving lives and minimizing permanent damage. Current heart attack diagnosis often requires a visit to a medical facility for an ECG or blood tests, which can be time-consuming. The wearable technology could allow for quicker detection and intervention.\n\nKasem Khalil, an assistant professor, and his team, including doctoral student Tamador Mohaidat and graduate student Md. Rahat Kader Khan, focused on designing a complete system, optimizing both hardware and software components. Mohaidat developed the artificial neural network, while Khan focused on the software. The researchers envision expanding the technology to detect other health problems like seizures and dementia.\n",
    "chinese_title": "工程师开发可穿戴的心脏病发作检测技术",
    "chinese_summary": "密西西比大学工程师开发出一种可穿戴的心脏病发作检测技术，该技术比传统方法更快、更准确。该技术由嵌入在可穿戴设备中的轻量级、节能芯片组成，该芯片利用人工智能和高等数学实时分析心电图。该芯片在检测心脏病发作方面的准确率高达 92.4%。\n\n该设备旨在缩短心脏病发作到治疗之间的时间，从而可能挽救生命并最大限度地减少永久性损害。目前的心脏病发作诊断通常需要去医疗机构进行心电图或血液检查，这可能非常耗时。这种可穿戴技术可以更快地进行检测和干预。\n\n助理教授卡西姆·哈利勒及其团队，包括博士生塔马多尔·穆海达特和研究生穆罕默德·拉哈特·卡德尔·汗，致力于设计一个完整的系统，优化硬件和软件组件。穆海达特开发了人工神经网络，而汗则专注于软件。研究人员设想将该技术扩展到检测其他健康问题，如癫痫和痴呆症。"
  },
  {
    "id": "43953723",
    "title": "Backdoor found in popular ecommerce components",
    "url": "https://sansec.io/research/license-backdoor",
    "summary": "Sansec discovered a widespread supply chain attack affecting numerous ecommerce stores due to backdoors injected into popular components from vendors Tigren, Meetanshi, and Magesolution (MGS) between 2019 and 2022. The backdoors, disguised as license checks (typically in `License.php` or `LicenseApi.php`), allow attackers to execute arbitrary PHP code via the `adminLoadLicense` function, controllable through an `adminUploadLicense` function (unauthenticated in older versions, requiring a hardcoded key in newer versions).\n\nThe attack has been active since at least April 20th, impacting hundreds of stores, including a major multinational retailer. Sansec estimates that 500-1000 stores are running backdoored software.\n\nAffected packages include various extensions related to Ajax functionality, image cleaning, cookie notices, shipping, Facebook integration, currency switching, Javascript deferral, out-of-stock notifications, and various MGS-branded modules (Lookbook, Store Locator, GDPR, Portfolio, Popup, etc.).\n\nSansec recommends checking stores using software from the mentioned vendors for the fake License file and removing it if found. The firm also asks for the sharing of original source code zip files (especially WeltPixel) for further analysis. Sansec's eComscan can detect the malware.\n\nWhile Weltpixel was also found to have a backdoored version, its compromise could not be confirmed. MGS and Tigren have not removed the affected packages from their sites. Meetanshi acknowledged their server breach but denies their software was tampered with.\n",
    "chinese_title": "热门电商组件发现后门",
    "chinese_summary": "Sansec发现广泛的供应链攻击，影响众多电商商店，原因是2019年至2022年期间，供应商Tigren、Meetanshi和Magesolution (MGS) 的热门组件中被植入后门。 这些后门伪装成许可检查（通常在 `License.php` 或 `LicenseApi.php` 中），允许攻击者通过 `adminLoadLicense` 函数执行任意PHP代码，该函数可通过 `adminUploadLicense` 函数控制（旧版本未经身份验证，新版本需要硬编码密钥）。\n\n该攻击至少从4月20日开始活跃，影响了数百家商店，包括一家大型跨国零售商。 Sansec估计有500-1000家商店正在运行植入后门的软件。\n\n受影响的软件包包括与Ajax功能、图像清理、Cookie通知、运输、Facebook集成、货币切换、Javascript延迟、缺货通知以及各种MGS品牌模块（Lookbook、Store Locator、GDPR、Portfolio、Popup等）相关的各种扩展。\n\nSansec建议检查使用上述供应商软件的商店，查找伪造的License文件，如果发现则将其删除。 该公司还要求共享原始源代码zip文件（尤其是WeltPixel），以供进一步分析。 Sansec的eComscan可以检测到该恶意软件。\n\n虽然也发现Weltpixel有一个被植入后门的版本，但其泄露情况无法确认。 MGS和Tigren尚未从其网站上删除受影响的软件包。 Meetanshi承认其服务器遭到入侵，但否认其软件被篡改。"
  },
  {
    "id": "43915470",
    "title": "Strain gauge made out of PCB",
    "url": "https://github.com/vapetrov/PCB_strain_gauge",
    "summary": "This article describes a PCB strain gauge, a device that uses the circuit board itself as the sensing element to measure strain and deflection. It's sensitive enough to detect deflections in the micrometer range, with a full-scale deflection range of +/- 3cm. The device includes an amplifier and can be manufactured with a minimum trace width of 0.15mm on a 0.6mm thick, 2-layer board (though thickness can be adjusted for different applications).\n\nTwo versions of the PCB design are available: one with a 4-element sensing bridge and another with a 2-element bridge, the latter designed for lower thermal drift and manufacturing bias. A stiffener board can be attached to prevent flexing on the component side.\n\nThe design prioritizes hand-assembly and can be used standalone with an integrated Seeed Studio XIAO RP2040 microcontroller or with an external microcontroller. Components like the external ADC and bias voltage generator can be optionally omitted for simplified use.\n\nSample firmware is provided for calibration and continuous sampling, along with a Python script (graph.py) for displaying the output. The article highlights the importance of allowing the board to reach a stable operating temperature before calibration for high-sensitivity measurements.\n\nFinally, the article explains how users can customize the sensing element's shape using a provided Jupyter notebook (draw_footprint.ipynb) and the svg2shenzen tool to create custom KiCad footprints.\n",
    "chinese_title": "基于PCB的应变片",
    "chinese_summary": "本文介绍了一种PCB应变计，该设备利用电路板本身作为传感元件来测量应变和挠曲。它足够灵敏，可以检测微米级的挠曲，满量程挠曲范围为+/- 3厘米。该设备包含一个放大器，并且可以在0.6毫米厚的双层板上以最小0.15毫米的走线宽度制造（尽管厚度可以根据不同的应用进行调整）。\n\n提供两种版本的PCB设计：一种带有4元件传感电桥，另一种带有2元件电桥，后者旨在降低热漂移和制造偏差。可以连接加强板，以防止元件侧弯曲。\n\n该设计优先考虑手动组装，并且可以与集成的Seeed Studio XIAO RP2040微控制器或外部微控制器一起独立使用。外部ADC和偏置电压发生器等组件可以有选择地省略，以简化使用。\n\n提供了用于校准和连续采样的示例固件，以及用于显示输出的Python脚本(graph.py)。本文强调了在校准之前，让电路板达到稳定的工作温度对于高灵敏度测量的重要性。\n\n最后，本文解释了用户如何使用提供的Jupyter notebook (draw_footprint.ipynb)和svg2shenzen工具自定义传感元件的形状，以创建自定义的KiCad封装。"
  },
  {
    "id": "43946824",
    "title": "Reverse engineering the 386 processor's prefetch queue circuitry",
    "url": "http://www.righto.com/2025/05/386-prefetch-circuitry-reverse-engineered.html",
    "summary": "This article reverse engineers the prefetch queue circuitry of the Intel 386 processor to understand its performance-enhancing techniques. The prefetch queue, a 16-byte buffer, fetches instructions ahead of time to avoid processor stalls.\n\nThe article highlights several key circuits:\n\n*   **Incrementer:** Incrementer, responsible for incrementing the \"Advance Instruction Fetch Pointer,\" utilizes a Manchester carry chain combined with a carry skip circuit for high-speed addition. The Manchester carry chain quickly computes carries using a chain of transistor switches, while the carry skip circuit allows carries to jump over blocks of 1s, further accelerating the process.\n*   **Limit Check:** Compares the fetch pointer against the code segment limit to prevent out-of-bounds prefetching. It uses a dynamic logic circuit with XOR gates for fast comparison and a precharged equality bus to indicate a match.\n*   **Data Shifting Network:** Aligns data from memory, handling cases where a 32-bit value is split across two rows of the prefetch buffer.\n*   **Sign Extension Circuitry:** Extends signed 8-bit or 16-bit values to 32 bits as needed.\n\nThe article demonstrates how the 386's designers employed clever circuit design techniques like dynamic logic, precharging, and asymmetrical inverters to optimize performance within a constrained layout. The use of dynamic logic reduces power consumption, and the Manchester carry chain and carry skip techniques optimize the speed of the incrementer. The layout shows how circuits are repeated across 32 bits, each fitting into a specific width.\n",
    "chinese_title": "逆向工程386处理器预取队列电路",
    "chinese_summary": "本文逆向工程Intel 386处理器的预取队列电路，以了解其性能增强技术。预取队列是一个16字节的缓冲区，提前获取指令以避免处理器停顿。\n\n本文重点介绍了几个关键电路：\n\n*   **增量器：** 增量器负责递增“提前指令获取指针”，它利用曼彻斯特进位链结合进位跳跃电路来实现高速加法。曼彻斯特进位链使用晶体管开关链快速计算进位，而进位跳跃电路允许进位跳过多个连续的1，进一步加速该过程。\n*   **限制检查：** 将获取指针与代码段限制进行比较，以防止越界预取。它使用带有异或门的动态逻辑电路进行快速比较，并使用预充电的相等总线来指示匹配。\n*   **数据移位网络：** 对齐来自内存的数据，处理32位值跨预取缓冲区两行的情况。\n*   **符号扩展电路：** 根据需要将有符号的8位或16位值扩展为32位。\n\n本文展示了386的设计者如何采用巧妙的电路设计技术，如动态逻辑、预充电和非对称反相器，在受限的布局中优化性能。动态逻辑的使用降低了功耗，曼彻斯特进位链和进位跳跃技术优化了增量器的速度。布局显示了电路如何在32位上重复，每个电路都适合特定的宽度。"
  },
  {
    "id": "43949056",
    "title": "Why the Apple II Didn't Support Lowercase Letters (2020)",
    "url": "https://www.vintagecomputing.com/index.php/archives/2833/why-the-apple-ii-didnt-support-lowercase-letters",
    "summary": "This article details the reasons behind the Apple II's initial lack of lowercase letter support, as explained by Steve Wozniak himself. Wozniak's primary constraint was a severe lack of funds. He needed a keyboard for his TV Terminal project, which preceded the Apple computer. The cheapest option was a $60 (equivalent to around $333 today) uppercase-only keyboard, a significant expense that strained his budget.\n\nWhen Wozniak conceived the Apple I, he integrated his existing TV Terminal with a microprocessor and RAM. Adding lowercase support later would have required a substantial rewrite of his hand-assembled BASIC interpreter, a time-consuming and risky task without access to a timeshare assembler (which he couldn't afford). He had to rewrite all his code, which was handwritten into binary.\n\nWhile Wozniak personally favored lowercase letters, Steve Jobs was indifferent to the feature. Ultimately, the decision not to include lowercase letters in the Apple I and II stemmed from Wozniak's financial limitations and the practical difficulties of retrofitting the existing system. As a result, all 8kB of code in the Apple II was written entirely by him, making it impossible to add lowercase easily. The article emphasizes the role of necessity in driving innovation, suggesting that Wozniak's financial constraints ultimately spurred the development of the Apple I and II.\n",
    "chinese_title": "Apple II 为什么不支持小写字母 (2020)",
    "chinese_summary": "本文详细介绍了苹果 II 最初缺乏小写字母支持的原因，正如史蒂夫·沃兹尼亚克本人所解释的那样。 沃兹尼亚克的主要限制是资金严重短缺。 他需要一个键盘用于他的电视终端项目，该项目早于 Apple 电脑。 最便宜的选择是一个 60 美元（相当于今天的约 333 美元）仅支持大写的键盘，这是一笔巨大的开支，使他的预算捉襟见肘。\n\n当沃兹尼亚克构思 Apple I 时，他将现有的电视终端与微处理器和 RAM 集成在一起。 后来添加小写字母支持将需要对他手动组装的 BASIC 解释器进行大量重写，这是一项耗时且有风险的任务，而且无法访问分时汇编器（他负担不起）。 他必须重写他所有的代码，这些代码都是手写成二进制的。\n\n虽然沃兹尼亚克个人更喜欢小写字母，但史蒂夫·乔布斯对这个功能漠不关心。 最终，Apple I 和 II 未能包含小写字母的决定源于沃兹尼亚克的财务限制以及改造现有系统的实际困难。 因此，Apple II 中的所有 8kB 代码完全由他编写，使得添加小写字母变得不可能。 本文强调了必要性在推动创新中的作用，表明沃兹尼亚克的财务限制最终促使了 Apple I 和 II 的开发。"
  },
  {
    "id": "43926713",
    "title": "When Suno covers my song (very useful) – a study with variations",
    "url": "http://rochus-keller.ch/?p=1350",
    "summary": "This blog post documents an exploration of Suno's AI music generation capabilities, specifically focusing on its ability to create covers of the author's original songs. The author, who has a background in AI and music, is impressed with Suno's capabilities, calling it a significant leap forward in computer-generated music.\n\nThe author experiments with various methods of input, including direct live recordings, sequencer mixdowns, live performance recordings, and studio multitrack mixes. For each original track, different styles and variations are fed into Suno to generate covers, such as jazz rock, brass section additions, house music fusions, and even rap versions. He provides examples of each, noting how closely Suno can mimic the original song, as well as areas where it struggles (e.g., recognizing complex chords or fully capturing a theme).\n\nThe author makes the Suno-generated covers available under Creative Commons licenses, as algorithmically generated works are generally not copyrightable. The experimentation covers songs spanning several albums and decades, showcasing Suno's versatility and highlighting its strengths and weaknesses in reinterpreting diverse musical styles. The post concludes with the promise of more experimentation to come.\n",
    "chinese_title": "Suno翻唱我的歌（很有用）——一项包含变体的研究",
    "chinese_summary": "本文记录了对Suno AI音乐生成能力的探索，特别关注其创作作者原创歌曲翻唱版本的能力。作者拥有AI和音乐背景，对Suno的能力印象深刻，称其为计算机生成音乐领域的一大飞跃。\n\n作者尝试了多种输入方法，包括直接的现场录音、音序器混音、现场表演录音和录音室多轨混音。对于每首原创歌曲，作者将不同的风格和变奏输入Suno以生成翻唱版本，例如爵士摇滚、铜管乐器组的加入、浩室音乐融合，甚至是说唱版本。他提供了每个版本的示例，并指出Suno在多大程度上能够模仿原创歌曲，以及它遇到的困难（例如，识别复杂的和弦或完全捕捉主题）。\n\n作者以知识共享许可协议发布了Suno生成的翻唱版本，因为算法生成作品通常不受版权保护。该实验涵盖了几张专辑和几十年的歌曲，展示了Suno的多功能性，并突出了其在重新诠释各种音乐风格方面的优势和劣势。文章最后承诺未来将进行更多实验。"
  },
  {
    "id": "43949855",
    "title": "The History and Legacy of Visual Basic",
    "url": "https://retool.com/visual-basic",
    "summary": "This article details the origin story of Visual Basic, tracing its roots back to Alan Cooper's \"Tripod,\" a shell construction set for Windows created in 1988. Cooper's demo of Tripod impressed Bill Gates, who acquired the project. Cooper and his team then rewrote Tripod from scratch, renaming it \"Ruby.\"\n\nHowever, Ruby was ultimately excluded from Windows 3.0 due to internal political conflict within Microsoft. Gates, inspired by the interactive design of Ruby, envisioned integrating its visual programming frontend with BASIC. He tasked the Business Languages Group to create this visual programming language, codenamed \"Thunder.\"\n\nThe Thunder team, led by young developers and aided by Michael Geary from Cooper's team, faced the challenge of transforming Ruby's shell construction kit into a full-fledged programming environment. A key change involved replacing Ruby's visual graph messaging system with BASIC.  They borrowed Omega's Embedded Basic code editor and event model.\n\nDespite initial plans for a quick project, it took 18 months of development to create the first version of Visual Basic. Although Cooper's original vision of a user-customizable shell was not realized, his work on Tripod/Ruby laid the foundation for one of the most popular programming environments of the 1990s.\n",
    "chinese_title": "Visual Basic的历史与传承",
    "chinese_summary": "本文详细介绍了Visual Basic的起源故事，追溯其根源到Alan Cooper于1988年为Windows创建的Shell构造集合“Tripod”。 Cooper对Tripod的演示给比尔·盖茨留下了深刻印象，后者收购了该项目。随后，Cooper和他的团队从头开始重写Tripod，并将其更名为“Ruby”。\n\n然而，由于微软内部的政治冲突，Ruby最终被排除在Windows 3.0之外。盖茨受到Ruby交互式设计的启发，设想将其可视化编程前端与BASIC集成。他指示商业语言组创建这种可视化编程语言，代号为“Thunder”。\n\nThunder团队由年轻的开发者领导，并得到Cooper团队的Michael Geary的帮助，面临着将Ruby的Shell构造工具包转变为成熟编程环境的挑战。一个关键的改变是将Ruby的可视化图表消息传递系统替换为BASIC。他们借鉴了Omega的Embedded Basic代码编辑器和事件模型。\n\n尽管最初计划是一个快速项目，但创建Visual Basic的第一个版本花费了18个月的开发时间。虽然Cooper最初设想的用户可定制Shell并未实现，但他对Tripod/Ruby的研究为20世纪90年代最流行的编程环境之一奠定了基础。"
  },
  {
    "id": "43912164",
    "title": "The State of SSL Stacks",
    "url": "https://www.haproxy.com/blog/state-of-ssl-stacks",
    "summary": "This article discusses the challenges and considerations surrounding SSL library choices for reverse proxies like HAProxy, particularly in light of OpenSSL's evolution. OpenSSL, once the industry standard, faced performance regressions with its 3.0 version, leading to a reevaluation of SSL strategies. The transition posed performance bottlenecks and compatibility challenges, forcing organizations to weigh performance against security updates.\n\nThe paper explores alternative SSL libraries: BoringSSL (bleeding-edge features, but unstable API), LibreSSL (focus on security, with API changes), WolfSSL (lightweight, compatibility layer for easier porting), and AWS-LC (backward compatible, performance-focused). The choice depends on functional requirements (TLS versions, QUIC support, certificate management), performance considerations (handshake efficiency, CPU core utilization, energy consumption), and maintenance requirements (security patching, backward compatibility).\n\nHAProxy's SSL feature set was designed around the OpenSSL API, so any replacement must offer compatibility or functional parity. While HAProxy supports several libraries, including LibreSSL, WolfSSL, and AWS-LC, integration can vary in features and complexities. Newer protocols like QUIC are essential for widespread adoption. Ultimately, the best SSL library choice involves a careful trade-off between performance, features, maintainability, and the specific needs of the software product. The article highlights the complexity of navigating the modern SSL ecosystem and the ongoing need for adaptation and innovation.\n",
    "chinese_title": "SSL堆栈现状",
    "chinese_summary": "本文探讨了HAProxy等反向代理的SSL库选择所面临的挑战和考虑因素，尤其是在OpenSSL不断发展的情况下。OpenSSL曾经是行业标准，但其3.0版本面临性能衰退，导致人们重新评估SSL策略。这种转变带来了性能瓶颈和兼容性挑战，迫使组织在性能和安全更新之间权衡。\n\n本文探讨了替代SSL库：BoringSSL（前沿功能，但API不稳定），LibreSSL（侧重于安全性，并更改了API），WolfSSL（轻量级，用于简化移植的兼容层）和AWS-LC（向后兼容，注重性能）。选择取决于功能需求（TLS版本，QUIC支持，证书管理），性能考虑因素（握手效率，CPU核心利用率，能耗）和维护需求（安全补丁，向后兼容性）。\n\nHAProxy的SSL功能集是围绕OpenSSL API设计的，因此任何替代方案都必须提供兼容性或功能对等性。尽管HAProxy支持包括LibreSSL，WolfSSL和AWS-LC在内的多个库，但集成在功能和复杂性方面可能会有所不同。诸如QUIC之类的新协议对于广泛采用至关重要。最终，最佳的SSL库选择需要在性能，功能，可维护性以及软件产品的特定需求之间进行仔细的权衡。本文强调了在现代SSL生态系统中导航的复杂性以及对适应和创新的持续需求。"
  },
  {
    "id": "43913414",
    "title": "Lazarus Release 4.0",
    "url": "https://forum.lazarus.freepascal.org/index.php?topic=71050.0",
    "summary": "This webpage is a forum announcement for the release of Lazarus 4.0. It's part of the Lazarus open-source Pascal IDE community forum. The page includes links to various Lazarus resources, such as the main website, downloads, documentation, bug tracker, and mailing list. It also provides links to resources related to the Free Pascal compiler and the Lazarus Foundation.\n\nThe main content focuses on recent forum activity, displaying a list of recent posts with their titles, authors, and timestamps. The posts cover diverse topics related to Lazarus and Free Pascal development, including compilation issues, GUI elements, libraries, and bug fixes.\n\nThe page also includes navigation elements, such as a search bar, login/register links, and breadcrumbs to navigate within the forum structure. It also mentions the forum's software (SMF 2.0.19) and provides copyright information. The topic of the page is \"Lazarus Release 4.0\", and the page also offers options to print the page or navigate through multiple pages of forum posts.\n",
    "chinese_title": "Lazarus 4.0版",
    "chinese_summary": "此网页是Lazarus 4.0发布的论坛公告，属于Lazarus开源Pascal IDE社区论坛的一部分。该页面包含指向各种Lazarus资源的链接，例如主网站、下载、文档、缺陷跟踪器和邮件列表。它还提供指向与Free Pascal编译器和Lazarus基金会相关的资源的链接。\n\n主要内容侧重于近期论坛活动，显示最近帖子列表，包括标题、作者和时间戳。这些帖子涵盖与Lazarus和Free Pascal开发相关的各种主题，包括编译问题、GUI元素、库和错误修复。\n\n该页面还包含导航元素，例如搜索栏、登录/注册链接和面包屑导航，以便在论坛结构中导航。它还提到了论坛的软件（SMF 2.0.19），并提供版权信息。该页面的主题是“Lazarus 4.0发布”，并且该页面还提供打印页面或浏览多个论坛帖子页面的选项。"
  },
  {
    "id": "43951874",
    "title": "Larry Tesler: Smalltalk Kernel Language Manual [pdf]",
    "url": "https://bitsavers.org/pdf/xerox/smalltalk/Tesler_-_Smalltalk_Kernel_Language_Manual_197709.pdf",
    "summary": "This document is a technical manual, likely related to the Smalltalk Kernel Language. The presence of PDF headers and encoded data indicates it's a digital document. The garbled nature of the text suggests the content might be either corrupted, heavily compressed, or encoded in a way that requires specific software or decryption keys.\n\nGiven the title, it can be reasonably assumed this manual details the specifics of the Smalltalk Kernel Language, including its syntax, structure, and potentially its implementation. While the content is inaccessible, the document points to the existence of a technical specification or guide aimed at developers or users of the Smalltalk programming language, specifically its kernel component.\n\nWithout readable content, it's impossible to determine specific features of the Smalltalk Kernel Language described within the document.\n",
    "chinese_title": "拉里·泰斯勒：Smalltalk内核语言手册 [pdf]",
    "chinese_summary": "本文档是一份技术手册，可能与Smalltalk内核语言相关。PDF标题和编码数据的存在表明它是一份数字文档。文本的乱码性质表明内容可能已损坏、被高度压缩，或以需要特定软件或解密密钥的方式进行编码。\n\n鉴于标题，可以合理推断，本手册详细介绍了Smalltalk内核语言的细节，包括其语法、结构以及可能的实现方式。虽然内容无法访问，但该文档表明存在一份针对Smalltalk编程语言（特别是其内核组件）的开发者或用户的技术规范或指南。\n\n在没有可读内容的情况下，无法确定文档中描述的Smalltalk内核语言的具体功能。"
  },
  {
    "id": "43950709",
    "title": "NetBSD 10.x Kernel Math_emulation",
    "url": "https://mezzantrop.wordpress.com/2025/02/04/netbsd-10-x-kernel-math_emulation/",
    "summary": "This article details a retrocomputing project focused on resurrecting FPU (Floating Point Unit) emulation within the NetBSD 10.x kernel for the Intel i486SX CPU. The author, facing the challenge of running a modern UNIX-like OS on a vintage i486SX laptop lacking an FPU, successfully implemented a software FPU emulator.\n\nThe project encountered an initial setback when the laptop's Enter key stopped working right after compiling the kernel, hindering testing. However, progress was made, with the kernel successfully triggering the FPU emulation code and executing the first addition operation using FPU instructions.\n\nThe author then announced the first release of \"i486SX_soft_FPU,\" a software FPU emulator for the i486SX CPU running on NetBSD 10, effectively bringing floating-point support back to these older machines. The project is open-source and hosted on GitHub (link provided).\n\nFinally, the emulator was successfully tested on the 86Box emulator. The author encourages contributions, feedback, and testing from the retrocomputing community to further refine and improve the emulator.\n",
    "chinese_title": "NetBSD 10.x 内核数学仿真",
    "chinese_summary": "本文详细介绍了一个复古计算项目，该项目专注于在NetBSD 10.x内核中为Intel i486SX CPU恢复FPU（浮点单元）模拟。作者面临在缺少FPU的老式i486SX笔记本电脑上运行现代类UNIX操作系统的挑战，成功实现了一个软件FPU模拟器。\n\n项目在编译内核后不久，笔记本电脑的回车键停止工作，阻碍了测试，遇到了最初的挫折。然而，项目取得了进展，内核成功触发了FPU模拟代码，并使用FPU指令执行了第一个加法运算。\n\n作者随后宣布了“i486SX_soft_FPU”的首次发布，这是一个运行在NetBSD 10上的i486SX CPU的软件FPU模拟器，有效地将浮点支持带回了这些旧机器。该项目是开源的，托管在GitHub上（提供链接）。\n\n最后，该模拟器已在86Box模拟器上成功测试。作者鼓励复古计算社区贡献、反馈和测试，以进一步改进和完善该模拟器。"
  },
  {
    "id": "43949134",
    "title": "Show HN: LoopMix128 – Fast C PRNG (.46ns), 2^128 Period, BigCrush/PractRand Pass",
    "url": "https://github.com/danielcota/LoopMix128",
    "summary": "LoopMix128 is a new, high-performance pseudo-random number generator (PRNG) designed for non-cryptographic applications where speed and statistical quality are crucial. It boasts a guaranteed period of 2^128, achieved via a 128-bit low/high counter looping system. The PRNG features a proven injective 192-bit state and has passed rigorous testing including TestU01's BigCrush and PractRand (up to 32TB) with no anomalies.\n\nLoopMix128 is significantly faster than Java's random number generator and demonstrably faster than C implementations of xoroshiro128++ and PCG64. Benchmarks show competitive or superior speed compared to other modern PRNGs like wyrand and xoroshiro128++. The provided code snippet illustrates the core algorithm, highlighting the Golden Ratio constant and the interplay between `slow_loop`, `fast_loop`, and `mix` variables.\n\nThe proven injectivity allows for the creation of parallel streams using either random seeding of the 192-bit state or by unique assignment of the `slow_loop` variable. Furthermore, the PRNG was extensively tested with PractRand using various seeds, demonstrating robustness comparable to other widely used generators. LoopMix128 exhibited minimal \"suspicious\" results compared to xoroshiro256++, xoroshiro128++, wyrand, and /dev/urandom. It was created by Daniel Cota.\n",
    "chinese_title": "Show HN: LoopMix128 – 快速 C PRNG (.46纳秒), 2^128 周期, 通过 BigCrush/PractRand 测试",
    "chinese_summary": "LoopMix128：一款高性能伪随机数生成器，适用于对速度和统计质量要求严苛的非密码学应用。它通过128位高/低计数器循环系统，保证了2^128的周期。该PRNG具有经过验证的192位注入状态，并通过了包括TestU01的BigCrush和PractRand（高达32TB）在内的严格测试，未发现异常。\n\nLoopMix128明显快于Java的随机数生成器，并且明显快于xoroshiro128++和PCG64的C语言实现。基准测试表明，与其他现代PRNG（如wyrand和xoroshiro128++）相比，其速度具有竞争力或更胜一筹。提供的代码片段展示了核心算法，突出了黄金比例常数以及`slow_loop`，`fast_loop`和`mix`变量之间的相互作用。\n\n经过验证的注入性允许使用192位状态的随机播种或通过唯一分配`slow_loop`变量来创建并行流。此外，该PRNG使用各种种子通过PractRand进行了广泛测试，表明其鲁棒性与其他广泛使用的生成器相当。与xoroshiro256++，xoroshiro128++，wyrand和/dev/urandom相比，LoopMix128表现出最少的“可疑”结果。它由Daniel Cota创建。"
  },
  {
    "id": "43944789",
    "title": "Embracer Games Archive is preserving 75000 video games and needs contributions",
    "url": "https://embracergamesarchive.com/",
    "summary": "The Embracer Games Archive is an initiative by Embracer Group to preserve video game history by creating an extensive archive of physical games, consoles, computers, and accessories. Currently housing over 75,000 items in Karlstad, Sweden, the archive's goal is to document and contribute to the preservation of gaming culture in collaboration with institutions, researchers, journalists, publishers, and studios.\n\nThe archive is particularly interested in acquiring big collections of specific systems like 3DO, Amstrad CPC 464, Apple II, Bandai Playdia, BBC Micro, Dragon 32, Macintosh big box, MSX PC big box, and Philips CD-i, as well as Brazilian, South Korean, and Taiwanese games.\n\nWhile not generally open to the public, access is prioritized for individuals and organizations involved in gaming culture, history, and the games industry. The archive encourages inquiries for collaboration and access. Those interested in selling or donating video game collections can contact Thomas Sunhede at [email protected].\n\nThe public can get a glimpse of the archive through the \"Tour the Archive\" section, blog posts, and social media channels (Instagram and Twitter). The archive is led by David Boström and supported by a team including a Chief Archivist, Technical Engineer, Archive Administrator, and Procurement Manager.\n",
    "chinese_title": "Embracer游戏档案馆正在保存75000款电子游戏，需要您的贡献。",
    "chinese_summary": "拥抱者游戏档案馆是拥抱者集团发起的一项倡议，旨在通过建立一个包含实体游戏、游戏主机、电脑和配件的庞大档案馆来保护电子游戏历史。目前在瑞典卡尔斯塔德收藏了超过75,000件物品，该档案馆的目标是与机构、研究人员、记者、发行商和工作室合作，记录并促进游戏文化的保护。\n\n该档案馆特别有兴趣收购特定系统的庞大收藏，例如3DO、Amstrad CPC 464、Apple II、Bandai Playdia、BBC Micro、Dragon 32、Macintosh大盒子、MSX PC大盒子和Philips CD-i，以及巴西、韩国和台湾的游戏。\n\n虽然通常不对公众开放，但访问权限优先提供给参与游戏文化、历史和游戏行业的个人和组织。档案馆鼓励有关合作和访问的咨询。有兴趣出售或捐赠电子游戏收藏品的人可以联系Thomas Sunhede，邮箱地址是[email protected]。\n\n公众可以通过“参观档案馆”部分、博客文章和社交媒体渠道（Instagram和Twitter）一窥档案馆的面貌。该档案馆由David Boström领导，并由包括首席档案管理员、技术工程师、档案管理员和采购经理在内的团队提供支持。"
  },
  {
    "id": "43946149",
    "title": "Comparison of C/POSIX standard library implementations for Linux",
    "url": "https://www.etalabs.net/compare_libcs.html",
    "summary": "This article provides a detailed comparison of C/POSIX standard library implementations for Linux, focusing on musl, uClibc, dietlibc, and glibc. The comparison covers various aspects, including bloat, behavior on resource exhaustion, performance, ABI and versioning, algorithms used, features, target architectures, build environment, and security/hardening.\n\n**Key takeaways:**\n\n*   **Bloat:** musl and dietlibc generally exhibit less bloat compared to uClibc and glibc in terms of library size and overhead.\n*   **Resource Exhaustion:** The article highlights how each library handles resource exhaustion scenarios like memory allocation failures and thread-local storage.\n*   **Performance:** The performance comparison reveals trade-offs across different libraries, with glibc often showing faster execution in some areas and musl excelling in others.\n*   **ABI and Versioning:** musl offers a stable ABI and atomic upgrades, while glibc provides backwards compatibility and symbol versioning.\n*   **Algorithms:** The choice of algorithms used in functions like substring search and sorting differs across implementations, affecting performance.\n*   **Features:** The article details feature support, including C standards compliance, POSIX threads, locale support, and Linux extensions.\n*   **Target Architectures:** All libraries support common architectures (x86, x86\\_64, ARM), but vary in support for less common ones.\n*   **Security:** The article touches on each library's approach to preventing stack smashing, heap corruption, and handling UTF-8 decoding securely.\n\nThe article concludes that each library has its strengths and weaknesses, with the best choice depending on specific application requirements and priorities.\n",
    "chinese_title": "Linux下C/POSIX标准库实现的比较",
    "chinese_summary": "本文详细比较了Linux上C/POSIX标准库的实现，重点关注musl、uClibc、dietlibc和glibc。比较涵盖了各个方面，包括臃肿度、资源耗尽时的行为、性能、ABI和版本控制、使用的算法、特性、目标架构、构建环境以及安全性/强化。\n\n**主要结论：**\n\n*   **臃肿度：** 在库大小和开销方面，musl和dietlibc通常比uClibc和glibc表现出更少的臃肿。\n*   **资源耗尽：** 本文重点介绍了每个库如何处理资源耗尽场景，例如内存分配失败和线程局部存储。\n*   **性能：** 性能比较揭示了不同库之间的权衡，glibc在某些方面通常表现出更快的执行速度，而musl在其他方面表现出色。\n*   **ABI和版本控制：** musl提供稳定的ABI和原子升级，而glibc提供向后兼容性和符号版本控制。\n*   **算法：** 子字符串搜索和排序等函数中使用的算法选择因实现而异，从而影响性能。\n*   **特性：** 本文详细介绍了特性支持，包括C标准合规性、POSIX线程、区域设置支持和Linux扩展。\n*   **目标架构：** 所有库都支持常见的架构（x86、x86_64、ARM），但在对不太常见的架构的支持方面有所不同。\n*   **安全性：** 本文介绍了每个库防止堆栈粉碎、堆损坏以及安全处理UTF-8解码的方法。\n\n文章总结说，每个库都有其优点和缺点，最佳选择取决于特定的应用程序需求和优先级。"
  },
  {
    "id": "43951977",
    "title": "The Emacs Widget Toolkit",
    "url": "https://appetrosyan.github.io/posts/emacs-widget.html",
    "summary": "This article argues that Emacs' current reliance on GTK for its GUI is a mistake and explores potential directions for improving Emacs' widget toolkit. The author criticizes GTK for its instability, backwards incompatibility, lack of configurability, and limited benefits for Emacs. The PGTK port, intended to address Wayland compatibility, is deemed insufficient, offering few advantages and introducing several disadvantages.\n\nThe core problem is that GTK doesn't provide the level of control and customization Elisp needs to create a truly integrated and powerful graphical experience within Emacs. Emacs doesn't fully utilize GTK's capabilities, and GTK's limitations hinder the development of features like a more functional file dialog, a customizable toolbar, improved minibuffer integration, and smooth scrolling.\n\nThe article then explores potential solutions, focusing on the importance of retaining the advantages of plain text: universality, standard interaction modalities, and the ability to apply Emacs' text-editing functions to various data representations. The author suggests that a successful Emacs widget toolkit must provide uniform navigation verbs, mirroring the richness of Emacs' text-based navigation, including concepts like moving by words, lines, and S-expressions. The goal is to replicate the power of Emacs' text-based interaction within a graphical environment, enabling users to navigate and interact with GUI elements as effectively as they currently interact with text.\n",
    "chinese_title": "Emacs Widget 工具包",
    "chinese_summary": "本文认为 Emacs 当前依赖 GTK 作为其 GUI 是一个错误，并探讨了改进 Emacs 部件工具包的潜在方向。作者批评 GTK 的不稳定、向后不兼容、缺乏可配置性以及对 Emacs 的有限益处。旨在解决 Wayland 兼容性的 PGTK 移植被认为是不充分的，几乎没有提供优势，反而引入了几个缺点。\n\n核心问题是 GTK 无法提供 Elisp 创建真正集成且强大的 Emacs 图形体验所需的控制和自定义级别。Emacs 没有充分利用 GTK 的功能，而 GTK 的局限性阻碍了诸如更具功能性的文件对话框、可定制的工具栏、改进的小缓冲区集成和流畅滚动等功能的开发。\n\n然后，本文探讨了潜在的解决方案，重点关注保留纯文本优势的重要性：通用性、标准交互模式以及将 Emacs 的文本编辑功能应用于各种数据表示的能力。作者认为，一个成功的 Emacs 部件工具包必须提供统一的导航动词，镜像 Emacs 基于文本导航的丰富性，包括诸如按单词、行和 S-表达式移动等概念。目标是在图形环境中复制 Emacs 基于文本的交互的强大功能，使用户能够像当前与文本交互一样有效地导航和与 GUI 元素交互。"
  },
  {
    "id": "43928942",
    "title": "How much information is in DNA?",
    "url": "https://dynomight.substack.com/p/dna",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "DNA中包含多少信息？",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "43955030",
    "title": "Moderna's Super-Vaccine for Flu and Covid Works–Now Politics Could Sink It",
    "url": "https://gizmodo.com/modernas-super-vaccine-for-flu-and-covid-works-now-politics-could-sink-it-2000599293",
    "summary": "This article discusses Moderna's experimental mRNA-based combination flu and COVID-19 vaccine, mRNA-1083, and its potential path to FDA approval. Phase III trial data shows mRNA-1083 generated an equal or greater immune response compared to existing, separate flu and COVID-19 vaccines, with a higher response to flu strains in particular. The vaccine also appeared safe and well-tolerated.\n\nHowever, the article expresses concern that recent changes to the FDA vaccine approval process, spearheaded by Health Secretary Robert F. Kennedy Jr. (RFK Jr.), may jeopardize the vaccine's approval. The new policy mandates placebo-controlled trials for all new vaccines, which could create hurdles for vaccines like mRNA-1083, especially since there isn't an approved mRNA-based flu vaccine currently.\n\nThe article also highlights RFK Jr.'s past anti-vaccination stances and skepticism towards mRNA vaccines, despite a lack of scientific evidence supporting his claims. Moderna doesn't expect approval before 2026 due to the FDA's request for effectiveness data against the flu. The article questions whether even this timeline is realistic given the current political climate and RFK Jr.'s influence within the Department of Health and Human Services. The article emphasizes that this political interference could delay or prevent the approval of potentially beneficial vaccines.\n",
    "chinese_title": "Moderna流感新冠超级疫苗有效——如今政治恐成阻碍",
    "chinese_summary": "本文探讨了莫德纳公司实验性的基于mRNA的流感和新冠联合疫苗mRNA-1083及其获得FDA批准的潜在路径。III期试验数据显示，与现有的、单独的流感和新冠疫苗相比，mRNA-1083产生了相等或更强的免疫反应，尤其对流感病毒株的反应更高。该疫苗似乎也安全且耐受性良好。\n\n然而，本文表达了对卫生部长小罗伯特·F·肯尼迪（RFK Jr.）主导的FDA疫苗审批流程近期变更可能危及该疫苗批准的担忧。新政策规定所有新疫苗都必须进行安慰剂对照试验，这可能会为像mRNA-1083这样的疫苗带来障碍，特别是目前尚无已批准的基于mRNA的流感疫苗。\n\n本文还强调了RFK Jr.过去的反疫苗立场以及对mRNA疫苗的怀疑，尽管缺乏科学证据支持他的主张。莫德纳公司预计，由于FDA要求提供针对流感的有效性数据，因此在2026年之前不会获得批准。本文质疑鉴于当前的政治气候和RFK Jr.在卫生与公众服务部的影响力，即使这个时间表是否现实。本文强调，这种政治干预可能会延迟或阻止潜在有益疫苗的批准。"
  },
  {
    "id": "43914321",
    "title": "Crowd Sourcing Broken QR Codes",
    "url": "https://www.humanqr.com/news/qr-code-not-scanning-well-try-to-help/",
    "summary": "This article describes a project to crowdsource broken QR codes for repair and research. The author, Daniel, was inspired after successfully repairing a damaged QR code on a cat's tag and later discussing the lack of QR code repair tools with someone named Greg. They both recognized the widespread use of QR codes and the need for a reliable method to fix them when they fail.\n\nDaniel is now requesting submissions of non-scanning QR codes from the public through a Google Form or email. He will attempt to repair the codes and, more importantly, compile them into a dataset. This dataset will be released publicly to enable further research and development of automated QR code restoration techniques. The goal is to move beyond manual repair and create a solution that identifies and fixes common QR code failure modes, which currently offer little insight into the reasons for scanning failures. The article emphasizes that the purpose is to collect real-world examples of broken QR codes and not artificially created ones.\n",
    "chinese_title": "众包破损二维码",
    "chinese_summary": "本文介绍了一个众包修复和研究损坏二维码的项目。作者Daniel在成功修复了猫牌上的一个损坏的二维码，并在之后与名叫Greg的人讨论缺乏二维码修复工具后，受到了启发。他们都认识到二维码的广泛使用，以及在二维码失效时修复它们的可靠方法的需求。\n\n现在，Daniel正在通过Google表格或电子邮件请求公众提交无法扫描的二维码。他将尝试修复这些二维码，更重要的是，将它们编译成一个数据集。该数据集将公开发布，以支持进一步研究和开发自动化二维码修复技术。目标是超越手动修复，创建一个能够识别和修复常见二维码故障模式的解决方案，目前这些故障模式对扫描失败的原因提供的见解很少。文章强调，目的是收集真实世界中损坏的二维码的例子，而不是人为创建的。"
  },
  {
    "id": "43953124",
    "title": "Show HN: TheorIA – An Open Curated Physics Dataset (Equations,Explanations,JSON)",
    "url": "https://theoria-dataset.github.io/theoria-dataset/",
    "summary": "TheorIA is a new open-source dataset designed to address the lack of structured, high-quality data for training machine learning models in theoretical physics. Unlike raw text from papers and books, TheorIA provides equations, step-by-step derivations in AsciiMath, and explanations in a structured JSON format.\n\nKey features include:\n\n*   **High-Quality, Curated Entries:** Each entry is carefully reviewed by physicists.\n*   **Formal Derivations:** AsciiMath format allows for easier understanding and programmatic formalization, ensuring correctness.\n*   **Structured JSON:** Individual JSON files per entry enable easy forking, versioning, and collaboration.\n*   **Domain Tags:** ArXiv-style categories for filtering.\n*   **Global Manifest:** Tracks versions, file lists, and updates.\n*   **Open License:** CC-BY 4.0 for free use, remixing, and teaching.\n\nThe creators encourage contributions from the theoretical physics community (researchers, educators, and enthusiasts). The contribution process involves forking the GitHub repository, creating a JSON entry following the provided schema, and submitting a pull request. A CI system validates the JSON against the schema before review and potential merging.\n\nThe dataset can be used for machine learning by either using the individual JSON files or merging them into a single `dataset.json` file using tools like `jq`. The project is licensed under CC-BY 4.0 and requests proper citation. The developers welcome feedback, questions, and contributions through the GitHub issue tracker.\n",
    "chinese_title": "Show HN: TheorIA – 开源精选物理数据集（公式、解释、JSON）",
    "chinese_summary": "TheorIA：用于理论物理机器学习的结构化数据集\n\nTheorIA是一个新的开源数据集，旨在解决理论物理领域训练机器学习模型时缺乏结构化、高质量数据的问题。与论文和书籍中的原始文本不同，TheorIA以结构化的JSON格式提供方程、AsciiMath格式的逐步推导过程以及解释。\n\n主要特点包括：\n\n*   **高质量，精选条目：** 每个条目都经过物理学家的仔细审查。\n*   **形式化推导：** AsciiMath格式便于理解和程序化形式化，确保正确性。\n*   **结构化JSON：** 每个条目的独立JSON文件便于fork、版本控制和协作。\n*   **领域标签：** 提供ArXiv风格的分类，用于筛选。\n*   **全局清单：** 跟踪版本、文件列表和更新。\n*   **开放许可：** CC-BY 4.0 许可，允许免费使用、混编和教学。\n\n创建者鼓励理论物理学界（研究人员、教育工作者和爱好者）做出贡献。贡献过程包括fork GitHub存储库，按照提供的模式创建JSON条目，并提交pull request。CI系统在审核和潜在合并之前，会根据模式验证JSON。\n\n该数据集可以通过使用单个JSON文件或使用 `jq` 等工具将它们合并到单个 `dataset.json` 文件中来用于机器学习。该项目采用 CC-BY 4.0 许可，并要求正确引用。开发者欢迎通过GitHub问题跟踪器提供反馈、问题和贡献。"
  },
  {
    "id": "43943737",
    "title": "Not a three-year-old chimney sweep (2022)",
    "url": "https://fakehistoryhunter.net/2022/07/26/not-a-3-year-old-chimney-sweep/",
    "summary": "This article debunks the claim that viral footage from 1933 shows a three-year-old chimney sweep working in Germany. The author argues the scene was staged for entertainment or publicity, not an actual instance of child labor.\n\nThe author identifies the location as Berlin, Germany, around 1929-1930, based on architectural details and magazine appearances of the same figures. While acknowledging historical instances of child labor in chimney sweeping, the article highlights that such practices were illegal in Germany at the time the footage was taken. German law specifically prohibited children under 10-13 working as chimney sweeps, and this was strictly enforced.\n\nSeveral clues suggest the staged nature of the footage: the child's miniature tools (ladder, brush, coring ball) are impractical for real work, chimney sweeping technology had advanced to eliminate the need for children to climb chimneys, and it was common to dress children as chimney sweeps for good luck and photo opportunities.\n\nThe article further identifies the father and son as Otto and Horst Böhnke, based on newspaper and magazine mentions discovered by online sleuths. They were seemingly a popular subject for photographers and newsreels. The author concludes that Horst was likely just coming along for fun or for a photo shoot and was not genuinely working as a chimney sweep. The search for more information about the Böhnke family continues.\n",
    "chinese_title": "非三年级扫烟囱工 (2022)",
    "chinese_summary": "本文驳斥了一则流传甚广的说法，即1933年的一段视频显示一名三岁儿童在德国从事烟囱清扫工作。作者认为，这段场景是为了娱乐或宣传而设计的，并非真实的童工案例。\n\n作者根据建筑细节以及杂志上相同人物的出现情况，确定该地点为1929-1930年左右的德国柏林。文章承认历史上确实存在儿童从事烟囱清扫工作的案例，但强调此类行为在拍摄该视频时在德国是非法的。德国法律明确禁止10-13岁以下的儿童从事烟囱清扫工作，并且这项规定得到了严格执行。\n\n几个线索表明该视频具有摆拍性质：儿童使用的迷你工具（梯子、刷子、掏灰球）不适用于实际工作，烟囱清扫技术已经发展到无需儿童攀爬烟囱的地步，并且将儿童打扮成烟囱清扫工以求好运和拍照留念的做法很常见。\n\n文章还根据网络侦探发现的报纸和杂志上的信息，确定这对父子为奥托·伯恩克和霍斯特·伯恩克。他们似乎是摄影师和新闻短片的热门拍摄对象。作者得出结论，霍斯特很可能只是为了好玩或拍照而来，并非真正从事烟囱清扫工作。目前仍在继续寻找有关伯恩克家族的更多信息。"
  },
  {
    "id": "43927095",
    "title": "Arduino is at work to make bio-based PCBs",
    "url": "https://blog.arduino.cc/2025/04/22/arduino-is-at-work-to-make-bio-based-pcbs/",
    "summary": "This Arduino blog post announces their involvement in the Desire4EU project, a European initiative focused on developing bio-based printed circuit boards (PCBs) as a sustainable alternative to traditional PCBs. The project aims to reduce the environmental impact of electronics manufacturing and disposal.\n\nThe Desire4EU project, running from 2024 to 2028, involves researchers and engineers from multiple European countries and aims to create bio-based multilayer PCBs without sacrificing functionality or performance. Prototypes using a PLA-flax composite as a flame-retardant replacement for fiberglass and epoxy have already been successfully manufactured for Arduino Nano and UNO boards.\n\nThe project is taking a holistic approach, considering the entire lifecycle of the boards. This includes lower soldering temperatures for reduced energy consumption during manufacturing, compatibility with standard surface-mounted technology (SMT), and optimized layouts for improved yield and reliability. A Life Cycle Assessment (LCA) is being conducted to quantify waste reduction, CO2 savings, and the potential for bio-leaching to recover copper from used PCBs. They estimate that 90% of the traditional FR4 substrate can be replaced with sustainable materials.\n\nExisting Arduino board designs can be adapted with minimal changes, making adoption easier. Arduino plans to distribute 1,000 beta boards with LoRa® wireless connectivity in April 2026 for testing in real-world applications. They invite testers, educators, and innovators to participate in the program. Readers can find additional details in the scientific paper and on the official Desire4EU website.\n",
    "chinese_title": "Arduino致力于制造生物基PCB",
    "chinese_summary": "Arduino参与Desire4EU项目，开发生物基印制电路板 (PCB)。该项目旨在减少电子产品制造和处置的环境影响。\n\nDesire4EU项目从2024年持续到2028年，汇集了来自多个欧洲国家的研究人员和工程师，旨在开发生物基多层PCB，且不牺牲其功能或性能。使用PLA-亚麻复合材料作为阻燃剂替代玻璃纤维和环氧树脂的样机已成功制造，用于Arduino Nano和UNO板。\n\n该项目采用整体方法，考虑电路板的整个生命周期。这包括降低焊接温度以减少制造过程中的能源消耗、与标准表面贴装技术 (SMT) 的兼容性，以及优化布局以提高产量和可靠性。正在进行生命周期评估 (LCA)，以量化废物减少量、二氧化碳节省量以及从废旧PCB中回收铜的生物浸出潜力。他们估计可以取代90%的传统FR4基材。\n\n现有的Arduino板设计可以通过最小的改动进行调整，从而更容易采用。Arduino计划在2026年4月分发1,000个带有LoRa®无线连接的Beta板，用于在实际应用中进行测试。他们邀请测试人员、教育工作者和创新者参与该计划。读者可以在科学论文和Desire4EU官方网站上找到更多详细信息。"
  },
  {
    "id": "43944790",
    "title": "Intel: Winning and Losing",
    "url": "https://www.abortretry.fail/p/intel-winning-and-losing",
    "summary": "This article chronicles Intel's performance from 2008 to 2011, a period of both success and strategic shifts. In 2008, Intel dominated the desktop and laptop CPU market. They launched the Atom CPU family with the Bonnell microarchitecture, targeting the low-power segment, and the Nehalem microarchitecture (Core i7) for high-performance computing, abandoning traditional northbridge/southbridge architectures.\n\nBy 2009, Craig Barrett resigned as chairman, and Intel unveiled its 32nm process. 2010 saw the release of the Nehalem/Westmere microarchitecture, and Intel ventured into the SSD market with the Intel SSD 310. The PC market boomed, and Intel's revenue and income increased significantly.\n\nIn 2011, Intel recognized growing competition in various markets (PC, server, embedded), particularly from ARM in low-power devices. They launched Sandy Bridge, improving performance and integrating the GPU on-die. Light Peak evolved into Thunderbolt, offering high-speed data transfer. A significant move was the acquisition of McAfee for $7.68 billion, reflecting Intel's attempt to diversify into software and address growing security concerns. Finally, Intel announced its 22nm process, introducing FinFET technology (3D transistors) which represented a major step forward in transistor design.\n",
    "chinese_title": "英特尔：得与失",
    "chinese_summary": "本文记录了英特尔2008年至2011年的业绩，这是一个充满成功和战略转变的时期。2008年，英特尔在桌面和笔记本电脑CPU市场占据主导地位。他们推出了采用Bonnell微架构的Atom CPU系列，目标是低功耗领域，以及用于高性能计算的Nehalem微架构（酷睿i7），放弃了传统的南北桥架构。\n\n到2009年，克雷格·贝瑞特辞去董事长职务，英特尔发布了其32纳米制程。2010年，Nehalem/Westmere微架构发布，英特尔进军固态硬盘市场，推出了英特尔SSD 310。个人电脑市场蓬勃发展，英特尔的收入和利润显著增长。\n\n2011年，英特尔意识到在各个市场（个人电脑、服务器、嵌入式）的竞争日益激烈，尤其是在低功耗设备领域来自ARM的竞争。他们推出了Sandy Bridge，提高了性能并将GPU集成到芯片上。Light Peak演变为Thunderbolt，提供高速数据传输。一个重要的举措是以76.8亿美元收购迈克菲，这反映了英特尔试图多元化发展软件业务并解决日益增长的安全问题。最后，英特尔宣布了其22纳米制程，推出了FinFET技术（3D晶体管），代表了晶体管设计的一大进步。"
  },
  {
    "id": "43911152",
    "title": "Eagle Hunters of Kyrgyzstan",
    "url": "https://magazine.atavist.com/the-eagle-hunters-of-kyrgyzstan-world-nomad-games/",
    "summary": "\"Eagle Hunters of Kyrgyzstan\" explores the ancient tradition of burkutchu, eagle hunters, in Kyrgyzstan, focusing on the story of Talgar Shaybyrov and his golden eagle, Tumara. For twenty years, they hunted together in Bokonbaevo, but Talgar released Tumara to allow her to mate and live freely. The article explains that eagle hunting was once vital for survival in the nomadic lifestyle, with skills passed down through generations. Hunters capture an eaglet and spend months training it, developing a deep bond with the bird.\n\nThe article also highlights Nursultan Kolbaev, Talgar's nephew, who views eagle hunting as both a sport and a way to earn a living. Nursultan's success in competitions like the World Nomad Games led him to perform for tourists, raising questions about the preservation of tradition versus the pursuit of profit.\n\nThe photo essay shows the daily lives of eagle hunters, from training with meat rewards, to using dogs to flush out prey. It also captures the important social aspect with communal gatherings, as well as the competitive nature of the sport. The article concludes by pondering the future of this centuries-old tradition in a rapidly changing world, with income from tourism being an area that the older generation is challenged by.\n",
    "chinese_title": "吉尔吉斯斯坦的猎鹰人",
    "chinese_summary": "吉尔吉斯斯坦的猎鹰人：\n探索吉尔吉斯斯坦古老的布尔库特奇猎鹰人传统，聚焦塔尔加尔·沙伊布罗夫和他的金雕图玛拉的故事。二十年来，他们在博孔巴耶沃一同狩猎，但塔尔加尔放生了图玛拉，让她交配并自由生活。文章解释说，猎鹰曾经是游牧生活中生存的关键，技能代代相传。猎人们捕获雏鹰，花费数月训练，与鸟类建立深厚的联系。\n\n文章还重点介绍了塔尔加尔的侄子努尔苏丹·科尔巴耶夫，他将猎鹰视为一项运动和一种谋生方式。努尔苏丹在世界游牧民族运动会等比赛中取得的成功使他开始为游客表演，这引发了人们对传统保护与追求利润的质疑。\n\n这篇摄影报道展示了猎鹰人的日常生活，从用肉类奖励训练，到用狗驱赶猎物。它还捕捉到了重要的社交方面，例如社区聚会，以及这项运动的竞争性质。文章最后思考了在这个快速变化的世界中，这项拥有数百年历史的传统的未来，旅游收入是老一辈人面临的挑战。"
  },
  {
    "id": "43916622",
    "title": "Detect and crash Chromium bots",
    "url": "https://blog.castle.io/detect-and-crash-chromium-bots-with-one-weird-trick-bots-hate-it/",
    "summary": "This article humorously explores using a Chromium bug to detect and crash bots by exploiting a vulnerability triggered by `iframe.contentWindow.open()` with specific arguments. The bug causes headless Chromium browsers used by tools like Puppeteer and Playwright to crash.\n\nThe author presents a simple JavaScript snippet, `botCheckMate()`, that leverages this bug. If the script doesn't crash the browser, it's assumed to be a human user. While this seems like an ideal bot detection method, the article strongly cautions against using it in production.\n\nThe drawbacks include:\n\n*   **Poor User Experience:** Triggering unexpected popups for human users is disruptive and degrades trust.\n*   **Noisy Signal:** It's a blatant, disruptive signal that doesn't allow for subtle monitoring.\n*   **Coupled Detection and Response:** Crashing the browser is an immediate and irreversible action, limiting flexibility in how bots are handled (e.g., shadowbanning, flagging).\n*   **Limited Context:** Client-side execution restricts access to server-side data, such as bot signatures or allow lists.\n*   **Easily Circumvented:** Bot developers can easily override or sanitize the `open()` method to avoid the crash.\n\nThe article advocates for detection signals that are quiet, don't impact performance or user trust, allow for contextual decision-making, and are resilient to adaptation. While the crash method is amusing and effective in controlled environments, it fails on all these fronts and is unsuitable for real-world deployment.\n",
    "chinese_title": "检测并崩溃 Chromium 机器人",
    "chinese_summary": "利用Chromium漏洞检测和崩溃机器人的幽默探索"
  },
  {
    "id": "43952157",
    "title": "Alone Together: Disconnection Is Our Generation's Black Death",
    "url": "https://josef.cn/blog/black-death",
    "summary": "Josef Chen argues that our generation is facing a new \"Black Death\" - disconnection and loneliness - that is as deadly as the historical pandemic. He critiques the tech industry's obsession with biohacking and gene editing for longevity, pointing out that these pursuits often overshadow more fundamental needs and societal issues. Referencing Harvard's 75-year Study of Adult Development, Chen highlights the crucial role of human connection in long-term health and fulfillment, noting that chronic loneliness activates harmful physiological responses in the body.\n\nChen argues that increased reliance on technology and AI further erodes social interaction, leading to emotional vacancy even in shared spaces. He contrasts this with the historical Black Death, where the cause was invisible, and now, the cause (disconnection) is everywhere, yet unrecognized.\n\nChen is building his own robotics-powered restaurant with a focus on human connection, which he sees as a crucial element, rather than automating it. He was surprised to find the elderly loved his restaurant as they felt someone cared about them. He supports this with neuroscience, citing research demonstrating that live conversation has a profound impact on brain activity.\n\nWhile emphasizing the importance of connection, Chen also stresses the need for standards in other areas of health, like sleep, nutrition, and environmental factors. He references Neko Health and ZOE as examples of companies prioritizing both advanced health technology and human connection. He concludes that true longevity isn't about avoiding death, but about living a life worth living, emphasizing the importance of shared experiences and genuine human interaction.\n",
    "chinese_title": "群体孤独：疏离是当代人的黑死病",
    "chinese_summary": "约瑟夫·陈认为，我们这一代人正面临一场新的“黑死病”——人际隔阂和孤独——其危害性堪比历史上的瘟疫。他批评科技行业痴迷于生物黑客和基因编辑以延长寿命，指出这些追求常常掩盖了更基本的需求和社会问题。陈援引哈佛大学历时75年的成人发展研究，强调人际关系在长期健康和幸福中的关键作用，并指出长期孤独会在体内激活有害的生理反应。\n\n陈认为，日益依赖技术和人工智能进一步削弱了社会互动，导致即使在共享空间也存在情感空虚。他将此与历史上的黑死病进行对比，黑死病的原因是看不见的，而现在，原因（人际隔阂）无处不在，却未被人们所认识。\n\n陈正在建造一家由机器人驱动的餐厅，其重点是人际连接，他认为这是一个关键因素，而不是将其自动化。他惊讶地发现老年人喜欢他的餐厅，因为他们感到有人关心他们。他用神经科学来支持这一点，引用研究表明，现场对话对大脑活动有深刻的影响。\n\n在强调人际关系重要性的同时，陈也强调需要在健康的其他领域制定标准，如睡眠、营养和环境因素。他以Neko Health和ZOE为例，认为这些公司同时重视先进的健康技术和人际关系。他总结说，真正的长寿不是为了避免死亡，而是为了过上值得过的生活，强调共享经历和真正的人际互动的重要性。"
  },
  {
    "id": "43931925",
    "title": "Adaptive Hashing",
    "url": "https://quotenil.com/adaptive-hashing.html",
    "summary": "This article discusses adaptive hashing, a technique to improve the performance and robustness of general-purpose hash tables. Traditional hash table theory focuses on worst-case asymptotic cost with randomly chosen hash functions, but in practice, constant factors and fixed hash functions are more relevant. Adaptive hashing aims to improve these factors by adapting the hash function to the actual keys used, optimizing for fewer collisions and better cache efficiency.\n\nThe author describes how SBCL's built-in hash tables were modified to implement adaptive hashing. For EQ hash tables, the algorithm starts with linear search, then transitions to a single-shift hash function optimized for memory allocator behavior (perfect for arithmetic sequences of keys). If collisions persist, it reverts to the previous default SBCL EQ-hash function and then, if necessary, to Murmur, a more robust general-purpose hash.\n\nFor EQUAL hash tables (composite keys), the focus is on reducing the cost of the hash function itself. Adaptive hashing initially only hashes the first and last few characters of strings or the first few elements of lists, increasing the limit if collisions become too frequent.\n\nThe goal is to achieve speed improvements in common cases while maintaining robustness in others. The article mentions a paper containing more details on the implementation and performance results.\n",
    "chinese_title": "自适应哈希",
    "chinese_summary": "本文讨论了自适应哈希，这是一种提高通用哈希表性能和鲁棒性的技术。传统的哈希表理论侧重于随机选择哈希函数时的最坏情况渐近成本，但实际上，常数因子和固定哈希函数更具相关性。自适应哈希旨在通过使哈希函数适应实际使用的键，优化以减少冲突和提高缓存效率来改善这些因素。\n\n作者描述了如何修改 SBCL 的内置哈希表以实现自适应哈希。对于 EQ 哈希表，该算法首先从线性搜索开始，然后过渡到针对内存分配器行为优化的单移位哈希函数（非常适合键的算术序列）。如果冲突持续存在，它将恢复到以前的默认 SBCL EQ 哈希函数，然后在必要时恢复到 Murmur，一种更强大的通用哈希。\n\n对于 EQUAL 哈希表（复合键），重点是降低哈希函数本身的成本。自适应哈希最初仅对字符串的前几个和最后几个字符或列表的前几个元素进行哈希处理，如果冲突变得过于频繁，则会增加限制。\n\n目标是在常见情况下实现速度提升，同时在其他情况下保持鲁棒性。本文提到了包含有关实现和性能结果的更多细节的论文。"
  },
  {
    "id": "43948130",
    "title": "Address of Pope Leo XIV to the College of Cardinals",
    "url": "https://www.vatican.va/content/leo-xiv/en/speeches/2025/may/documents/20250510-collegio-cardinalizio.html",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "教宗利奥十四世对枢机主教团的讲话",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "43945293",
    "title": "React Three Ecosystem",
    "url": "https://www.react-three.org/",
    "summary": "Okay, here's a concise summary of the article based on the provided title and content:\n\nThe article \"React Three Ecosystem\" introduces the concept of using the React library in conjunction with Three.js to build 3D graphics and experiences on the web. While the provided content is minimal, the title suggests the article likely explores the various tools, libraries, and techniques that comprise the \"React Three Ecosystem.\"\n\nKey elements typically covered in such an article might include:\n\n*   **React Three Fiber:** This is the most prominent library in the ecosystem, allowing developers to describe Three.js scenes using React components. It simplifies managing Three.js objects and their properties within a React's declarative framework.\n\n*   **React's Component-Based Architecture:** How React's component structure benefits 3D development by promoting modularity, reusability, and maintainability of 3D scenes.\n\n*   **Performance Considerations:** Addressing potential performance bottlenecks when rendering complex 3D scenes in React and techniques for optimization.\n\n*   **Ecosystem Libraries:** Mentioning other helpful libraries and utilities that work well with React Three Fiber, such as those for handling physics, animation, post-processing effects, or loading assets.\n\n*   **Use Cases:** Suggesting practical applications of the React Three Ecosystem, such as interactive 3D product visualizations, virtual environments, games, and data visualizations.\n\nIn short, the article serves as an introduction to the world of building 3D web applications with React, focusing on the major tools and best practices involved.\n",
    "chinese_title": "React Three 生态系统",
    "chinese_summary": "好的，这是一份基于标题和内容的文章简洁总结：\n\n文章《React Three生态系统》介绍了结合React库和Three.js在Web上构建3D图形和体验的概念。 虽然提供的内容很少，但标题暗示该文章可能探讨了构成“React Three生态系统”的各种工具、库和技术。\n\n此类文章通常涵盖的关键要素可能包括：\n\n*   **React Three Fiber:** 这是生态系统中最突出的库，允许开发人员使用React组件来描述Three.js场景。 它简化了在React声明式框架中管理Three.js对象及其属性的过程。\n\n*   **React的组件化架构：** React的组件结构如何通过促进3D场景的模块化、可重用性和可维护性来使3D开发受益。\n\n*   **性能考量：** 解决在React中渲染复杂3D场景时潜在的性能瓶颈以及优化技术。\n\n*   **生态系统库：** 提及其他与React Three Fiber协同工作的有用库和实用程序，例如用于处理物理、动画、后期处理效果或加载资源的库。\n\n*   **用例：** 建议React Three生态系统的实际应用，例如交互式3D产品可视化、虚拟环境、游戏和数据可视化。\n\n简而言之，这篇文章是对使用React构建3D Web应用程序的世界的介绍，重点介绍了所涉及的主要工具和最佳实践。"
  },
  {
    "id": "43953517",
    "title": "OpenAI negotiates with Microsoft to unlock new funding and future IPO",
    "url": "https://www.ft.com/content/8d9e5149-7e4f-4886-a035-9d200204972a",
    "summary": "The Financial Times article discusses OpenAI's negotiations with Microsoft to secure new funding, with the ultimate goal of a future Initial Public Offering (IPO). The article is behind a paywall, offering different subscription tiers for access to the full story. These tiers include limited access, digital access, and premium digital access, each offering different levels of features and content such as global news, expert opinions, the FT App, newsletters, videos, podcasts, investment columns, and the digitized print edition. The paywall highlights the FT's value proposition and encourages readers to subscribe for comprehensive financial journalism.\n",
    "chinese_title": "OpenAI与微软谈判以寻求新融资和未来IPO",
    "chinese_summary": "金融时报报道OpenAI与微软就新融资进行谈判，最终目标是未来的首次公开募股（IPO）。该文章设置付费墙，提供不同订阅级别以访问完整内容。这些级别包括有限访问、数字访问和高级数字访问，各自提供不同级别的功能和内容，例如全球新闻、专家观点、FT App、新闻通讯、视频、播客、投资专栏和数字化印刷版。付费墙突出了FT的价值主张，并鼓励读者订阅以获取全面的金融新闻报道。"
  },
  {
    "id": "43919429",
    "title": "VMware perpetual license holders receive cease-and-desist letters from Broadcom",
    "url": "https://arstechnica.com/gadgets/2025/05/broadcom-sends-cease-and-desist-letters-to-subscription-less-vmware-users/",
    "summary": "Broadcom, after acquiring VMware, is sending cease-and-desist letters to owners of VMware perpetual licenses with expired support contracts. These letters demand users stop using any updates released after their support expired, threatening legal action for intellectual property infringement.\n\nThe move is controversial because Broadcom ended perpetual license sales to push customers towards subscription-based product bundles with significantly increased costs. Some users chose to remain unsupported, researching alternatives or devirtualizing.\n\nCustomers and MSPs like Members IT Group report receiving these letters even if they haven't applied updates. Users have also reported the letters even after migrating off VMware. The letters also warn of potential audits for compliance.\n\nThis action is further damaging Broadcom's reputation, especially among small-to-medium-sized businesses already impacted by the company's decision to end perpetual licenses and increase pricing. Many are reducing or ending their VMware usage. Broadcom's actions, including a legal battle with AT&T and accusations of software piracy against Siemens, demonstrate a broader effort to control VMware product usage, but risk alienating its customer base.\n",
    "chinese_title": "VMware永久许可证持有者收到博通的停止侵权通知函",
    "chinese_summary": "博通收购VMware后，正向持有已过期支持合同的VMware永久许可证用户发送停止侵权通知函。这些信函要求用户停止使用在其支持过期后发布的任何更新，并威胁将采取法律行动追究知识产权侵权责任。\n\n此举颇具争议，因为博通已停止销售永久许可证，以推动客户购买成本大幅增加的订阅式产品包。一些用户选择保持不受支持状态，寻找替代方案或进行去虚拟化。\n\n包括Members IT Group在内的客户和MSP报告称，即使他们没有应用更新，也收到了这些信函。用户还报告说，即使在迁移离开VMware之后，也收到了这些信函。信函还警告称，可能会进行合规性审计。\n\n这一行动进一步损害了博通的声誉，尤其是在已经受到该公司停止永久许可证和提高定价影响的中小型企业中。许多企业正在减少或停止使用VMware。博通的行动，包括与AT&T的法律纠纷以及对西门子软件盗版的指控，表明其正在更广泛地努力控制VMware产品的使用，但这可能会疏远其客户群。"
  },
  {
    "id": "43944467",
    "title": "The Deathbed Fallacy (2018)",
    "url": "https://www.hjorthjort.xyz/2018/02/21/the-deathbed-fallacy.html",
    "summary": "The article \"The Deathbed Fallacy\" argues that using the regrets of people on their deathbeds as a guide for living a fulfilling life is flawed. The author coins this \"The Deathbed Fallacy,\" and dissects it based on three key reasons.\n\nFirst, a deathbed state is not representative of life as a whole. What someone wants at the very end may not correlate with what would have made them happiest throughout their life. Second, people often misremember or misunderstand their past selves. The author uses a personal anecdote about teenage priorities to illustrate how present-day judgment can be inaccurate and even detrimental. What might seem like a \"wrong\" choice in hindsight could have been the right choice in that specific context. Finally, the experiences and challenges faced by those nearing death, who often grew up in different eras, are not directly applicable to younger generations living in a vastly changed world.\n\nThe author criticizes those who preach the \"Deathbed List\" as often being privileged individuals who have already achieved material success and can now afford to prioritize higher-order needs. They judge their past selves for focusing on work, when that work was essential to reaching their current comfortable position. Conversely, those who focus solely on authenticity and a carefree life without first securing basic needs often struggle.\n\nInstead of relying on deathbed regrets, the author advises focusing on happiness research, personal reflection, and making decisions that align with current needs and goals, even if those decisions involve hard work and sacrifices. He advocates for building a stable foundation and prioritizing well-being *now*, rather than worrying about the potential regrets of a future, possibly ungrateful, self.\n",
    "chinese_title": "临终谬误 (2018)",
    "chinese_summary": "文章《临终谬误》认为，将临终者的遗憾作为过上充实生活的指南是有缺陷的。作者创造了“临终谬误”这一概念，并基于三个关键原因对其进行了剖析。\n\n首先，临终状态不能代表人生的全貌。一个人在生命尽头想要的东西，可能与其一生中最快乐的时光并不相关。其次，人们常常错误地记忆或理解过去的自己。作者用一个关于青少年时期的个人轶事来说明，现在的判断可能是不准确甚至是有害的。事后看来似乎是“错误”的选择，在特定的背景下可能是正确的选择。最后，那些接近死亡的人所面临的经历和挑战，他们通常成长于不同的时代，并不直接适用于生活在剧变世界中的年轻一代。\n\n作者批评那些鼓吹“临终清单”的人，认为他们往往是已经获得物质成功的特权阶层，现在可以优先考虑更高层次的需求。他们评判过去的自己专注于工作，而那些工作对于他们达到目前舒适的地位至关重要。相反，那些只关注真实性和无忧无虑的生活，而没有首先保障基本需求的人，往往会陷入困境。\n\n作者建议，不要依赖临终遗憾，而应专注于幸福研究、个人反思，并做出符合当前需求和目标的决定，即使这些决定涉及辛勤工作和牺牲。他提倡建立一个稳定的基础，并优先考虑*现在*的福祉，而不是担心未来可能出现的、甚至是不知感恩的自己的潜在遗憾。"
  },
  {
    "id": "43922216",
    "title": "Lianas are taking over the rainforests, and it's visible from space",
    "url": "https://phys.org/news/2025-05-lianas-rainforests-visible-space.html",
    "summary": "A \"liana pandemic\" is sweeping through tropical rainforests, threatening their carbon storage capacity and biodiversity. Research from Leiden University shows liana prevalence is increasing by 10-24% per decade in tropical forests worldwide. Lianas, like \"tapeworms,\" steal resources from trees, increasing tree mortality and suppressing forest regeneration. In heavily infested areas, carbon storage can decline by as much as 95%, comparable to deforestation.\n\nThe researchers attribute this surge to rising atmospheric CO₂ levels, which benefit lianas more than trees because lianas don't invest in structural support and require less energy to produce leaves. They can quickly climb to the canopy, block sunlight, and outcompete trees.\n\nImportantly, the study reveals that lianas are now detectable from space because their leaves reflect more light and infrared radiation and lie flatter than tree leaves. This understanding allows for the development of targeted techniques to map their spread and impact globally.\n\nDespite the negative impacts, the researchers advise against widespread liana removal due to their ecological role in providing fruit and habitat for certain species. Instead, they advocate for halting climate change as the best way to slow the liana expansion. The research highlights the urgent need to address climate change to protect the vital role of rainforests in climate regulation and biodiversity.\n",
    "chinese_title": "藤本植物正在侵占热带雨林，从太空可见。",
    "chinese_summary": "一场“藤本植物疫情”正在席卷热带雨林，威胁其碳储存能力和生物多样性。莱顿大学的研究表明，全球热带森林中藤本植物的普遍程度每十年增加10-24%。藤本植物就像“绦虫”，窃取树木的资源，增加树木死亡率并抑制森林再生。在受严重侵扰的地区，碳储存量可能下降高达95%，与森林砍伐相当。\n\n研究人员将这种激增归因于大气中二氧化碳水平的上升，这比树木更有利于藤本植物，因为藤本植物不需要投入结构支撑，并且生产树叶所需的能量更少。它们可以迅速爬到树冠，阻挡阳光，并与树木竞争。\n\n重要的是，该研究表明，现在可以从太空探测到藤本植物，因为它们的叶子比树叶反射更多的光和红外辐射，并且更加扁平。这种理解有助于开发有针对性的技术，以在全球范围内绘制其蔓延和影响图。\n\n尽管存在负面影响，但研究人员建议不要广泛移除藤本植物，因为它们在为某些物种提供水果和栖息地方面具有生态作用。相反，他们主张阻止气候变化是减缓藤本植物扩张的最佳方式。该研究强调了解决气候变化的紧迫性，以保护雨林在气候调节和生物多样性方面的关键作用。"
  },
  {
    "id": "43946066",
    "title": "Show HN: Code Claude Code",
    "url": "https://github.com/RVCA212/codesys",
    "summary": "Code Claude Code is a Python SDK (named `codesys`) designed to simplify interaction with the Claude CLI tool, enabling developers to programmatically leverage Claude's capabilities.  It requires Python 3.8+ and the Claude CLI set up with an API key.\n\nThe SDK provides an `Agent` class for managing interactions with Claude.  The core method is `run()`, which takes a prompt (either a string or a Claude code command) and executes it. It supports streaming output for real-time feedback and handles different output formats (like JSON).  The `run_with_tools()` method allows restricting Claude's access to specific tools (like \"Edit\", \"Bash\", \"Write\") for enhanced security and control.\n\nThe SDK emphasizes a workflow of planning tasks by exploring the codebase and then implementing the plan. A sample script is provided to generate a plan (in `plan.md`) based on a user task and then execute that plan.\n\nThe documentation includes examples demonstrating various features, including: automatic and manual streaming, custom tool usage, JSON output formatting, and passing additional arguments to the Claude CLI.  The examples illustrate how to initialize the `Agent` with a working directory, restrict tools, and handle streaming output manually for custom processing. The SDK is licensed under the MIT license.\n",
    "chinese_title": "展示 HN：代码克劳德代码",
    "chinese_summary": "Code Claude Code是一个Python SDK (命名为`codesys`)，旨在简化与Claude CLI工具的交互，使开发者能够以编程方式利用Claude的功能。它需要Python 3.8+和配置了API密钥的Claude CLI。\n\n该SDK提供了一个`Agent`类来管理与Claude的交互。核心方法是`run()`，它接受一个提示（可以是字符串或Claude代码命令）并执行它。它支持流式输出以获得实时反馈，并处理不同的输出格式（如JSON）。`run_with_tools()`方法允许限制Claude对特定工具（如“Edit”、“Bash”、“Write”）的访问，以增强安全性和控制。\n\n该SDK强调通过探索代码库来规划任务，然后实施该计划的工作流程。提供了一个示例脚本，用于根据用户任务生成计划（在`plan.md`中），然后执行该计划。\n\n文档包含演示各种功能的示例，包括：自动和手动流式传输、自定义工具的使用、JSON输出格式化以及将额外的参数传递给Claude CLI。这些示例说明了如何使用工作目录初始化`Agent`，限制工具以及手动处理流式输出以进行自定义处理。该SDK采用MIT许可证。"
  },
  {
    "id": "43926029",
    "title": "Adventures in Imbalanced Learning and Class Weight",
    "url": "http://andersource.dev/2025/05/05/imbalanced-learning.html",
    "summary": "This article explores the impact of class weighting in imbalanced binary classification problems. The author investigates why the common \"inverse proportion\" class weighting often fails to improve performance and attempts to derive an optimal weighting strategy from first principles.\n\nThe analysis focuses on the tradeoff between false positives and false negatives, represented by a curve defined by a parameter 'p'.  The author uses weighted binary cross-entropy loss with a weight 'α' for the rare positive class to control the tradeoff point. They derive an equation linking 'α', the class prevalence 'β', and 'p' to the operating point (x, z) on the tradeoff curve.\n\nThe author then optimizes for the F1-score, expressing it in terms of 'α', 'β', 'p', 'x', and 'z'. Numerical analysis reveals that inverse proportion weighting rarely significantly improves performance compared to unweighted training, and can sometimes even be detrimental.\n\nA rudimentary experiment using scikit-learn supports these theoretical findings, showing minimal performance boost from optimal class weights. The author emphasizes the importance of problem-specific characteristics like the tradeoff curve shape, label noise, and the relative cost of different errors in determining appropriate class weights.\n\nAn update highlights that inverse proportion weighting *does* optimize for balanced accuracy. This emphasizes the crucial role of metric selection: F1-score and balanced accuracy prioritize different error types, necessitating alignment of technical choices with domain requirements.\n",
    "chinese_title": "不平衡学习与类别权重探险",
    "chinese_summary": "本文探讨了类别权重在不平衡二元分类问题中的影响。作者研究了为何常见的“反比例”类别权重往往无法提高性能，并试图从第一性原理推导出最优的权重策略。\n\n分析侧重于假阳性和假阴性之间的权衡，该权衡由参数“p”定义的曲线表示。作者使用加权二元交叉熵损失，对稀有的正类赋予权重“α”来控制权衡点。他们推导出一个将“α”、类别比例“β”和“p”与权衡曲线上的工作点 (x, z) 联系起来的公式。\n\n然后，作者针对F1分数进行优化，并用“α”、“β”、“p”、“x”和“z”表示它。数值分析表明，与未加权训练相比，反比例权重很少能显著提高性能，有时甚至会产生不利影响。\n\n一个使用scikit-learn的初步实验支持了这些理论发现，表明从最优类别权重中获得的性能提升微乎其微。作者强调了问题特定特征的重要性，例如权衡曲线形状、标签噪声以及不同错误的相对成本，这些特征决定了适当的类别权重。\n\n更新强调，反比例权重*确实*优化了平衡准确率。这突出了指标选择的关键作用：F1分数和平衡准确率优先考虑不同的错误类型，因此需要将技术选择与领域要求对齐。"
  },
  {
    "id": "43943047",
    "title": "Vision Now Available in Llama.cpp",
    "url": "https://github.com/ggml-org/llama.cpp/blob/master/docs/multimodal.md",
    "summary": "This article, titled \"Vision Now Available in Llama.cpp,\" announces the integration of vision capabilities into the llama.cpp project. This means the llama.cpp software, known for running large language models (LLMs) efficiently on local hardware (like CPUs and GPUs), can now process and understand images, not just text.\n\nThe title and brief content indicate that this is a significant upgrade for the llama.cpp library, likely enabling multimodal applications that combine text and visual data. The information provided doesn't detail the specific vision models integrated or the performance characteristics, but the popularity metrics (11.7k forks and 79.6k stars) suggest llama.cpp is a widely used and appreciated project within the AI community. The core takeaway is that llama.cpp users can now leverage its efficiency for tasks involving both text and images, expanding its utility in various applications.\n",
    "chinese_title": "Llama.cpp 现已支持视觉功能",
    "chinese_summary": "Llama.cpp 现已支持视觉功能\n\n这篇文章名为“Llama.cpp 现已支持视觉功能”，宣布了视觉能力集成到 llama.cpp 项目中。这意味着以在本地硬件（如 CPU 和 GPU）上高效运行大型语言模型 (LLM) 而闻名的 llama.cpp 软件，现在不仅可以处理和理解文本，还可以处理和理解图像。\n\n标题和简要内容表明这是 llama.cpp 库的一个重大升级，可能会启用结合文本和视觉数据的多模态应用。提供的信息没有详细说明集成的具体视觉模型或性能特征，但流行度指标（1.17 万 forks 和 7.96 万 stars）表明 llama.cpp 是 AI 社区中广泛使用和广受赞赏的项目。核心要点是 llama.cpp 用户现在可以利用其效率来处理涉及文本和图像的任务，从而扩展其在各种应用中的效用。"
  },
  {
    "id": "43940747",
    "title": "Business books are entertainment, not strategic tools",
    "url": "https://theorthagonist.substack.com/p/why-reading-business-books-is-a-waste",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "商业书籍是娱乐，而非战略工具。",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "43952707",
    "title": "Insurers launch cover for losses caused by AI chatbot errors",
    "url": "https://www.ft.com/content/1d35759f-f2a9-46c4-904b-4a78ccc027df",
    "summary": "Insurers are introducing new insurance coverage to protect businesses from financial losses stemming from errors made by AI chatbots. The Financial Times article highlights this emerging area of risk and the insurance industry's response to it. The article itself is gated, requiring a subscription to read the full details. However, the title clearly indicates that these new insurance products are designed to mitigate the financial fallout that can occur when AI chatbots make mistakes, presumably encompassing areas like incorrect advice, misrepresentation, or failures in customer service that lead to financial damages. The availability of such insurance suggests a growing recognition of the potential liabilities associated with deploying AI technologies in business operations.\n",
    "chinese_title": "保险公司推出人工智能聊天机器人错误损失险",
    "chinese_summary": "保险公司推出新险种，以保护企业免受人工智能聊天机器人错误造成的财务损失。《金融时报》的文章重点介绍了这一新兴风险领域以及保险业对此的回应。该文章为付费内容，需要订阅才能阅读全部细节。但标题清楚地表明，这些新保险产品旨在减轻人工智能聊天机器人出错可能造成的财务影响，可能包括不正确的建议、虚假陈述或客户服务失败等导致财务损失的领域。此类保险的推出表明，人们越来越认识到在业务运营中部署人工智能技术可能带来的潜在责任。"
  },
  {
    "id": "43948291",
    "title": "Microsoft Teams will soon block screen capture during meetings",
    "url": "https://www.bleepingcomputer.com/news/microsoft/microsoft-teams-will-soon-block-screen-capture-during-meetings/",
    "summary": "Microsoft Teams will soon introduce a new feature that blocks screen captures during meetings to protect sensitive information. Scheduled for rollout in July 2025 across Android, desktop, iOS, and web platforms, the feature will turn the meeting window black if a user attempts to take a screenshot. Participants joining from unsupported platforms will be limited to audio-only mode.\n\nWhile this aims to prevent unauthorized screen captures, the article acknowledges that users can still capture meeting content by taking photos with external devices. It remains unclear whether the feature will be enabled by default or configurable by organizers or admins.\n\nThe move follows a similar initiative by Meta with its \"Advanced Chat Privacy\" feature in WhatsApp, which protects media and chat content. Microsoft is also planning other Teams updates, including improved town hall screen privilege management, interactive BizChat/Copilot Studio agents in meetings, and Copilot features to generate audio overviews of transcribed meetings. In addition, Microsoft plans to release Teams Chat brand impersonation protection which alerts users when it detects phishing attacks targeting organizations with external Teams access.\n\nThe article highlights Microsoft Teams' large user base, citing over 320 million monthly active users.\n",
    "chinese_title": "Microsoft Teams 即将禁止会议期间截屏",
    "chinese_summary": "为保护敏感信息，Microsoft Teams即将推出一项新功能，阻止会议期间的屏幕截图。该功能计划于2025年7月在Android、桌面、iOS和Web平台上推出，如果用户试图截屏，会议窗口将变为黑色。从不支持的平台加入的参与者将被限制为仅音频模式。\n\n虽然此举旨在防止未经授权的屏幕截图，但文章承认用户仍然可以通过使用外部设备拍照来捕获会议内容。目前尚不清楚该功能是否默认启用，或者是否可由组织者或管理员配置。\n\n此前，Meta在WhatsApp中推出了“高级聊天隐私”功能，以保护媒体和聊天内容，微软的这一举措与之类似。微软还计划进行其他Teams更新，包括改进市政厅屏幕权限管理、会议中的交互式BizChat/Copilot Studio代理，以及Copilot功能，以生成转录会议的音频概述。此外，微软计划发布Teams Chat品牌冒充保护，当检测到针对具有外部Teams访问权限的组织的钓鱼攻击时，会向用户发出警报。\n\n文章强调了Microsoft Teams的庞大用户群，引用了超过3.2亿的月活跃用户。"
  },
  {
    "id": "43942881",
    "title": "A simple 16x16 dot animation from simple math rules",
    "url": "https://tixy.land",
    "summary": "This \"creative code golfing\" piece presents a method for generating 16x16 dot animations using simple mathematical rules, likely within a limited code environment. The core idea is to map a combination of time (`t`) and pixel coordinates (`i`), which likely derives `x` and `y` coordinates, to a pixel state (on or off). The animation is achieved by changing the output over time (`t`).\n\nThe focus is on conciseness and efficiency in code, suggesting that the equations used to calculate the pixel states are deliberately simple and optimized for minimal character count. The implication is that complex and visually appealing patterns can be achieved despite the constrained mathematical basis.\n\nThe title and content suggest a demonstration of artistic potential within tight technical limitations. The author likely aims to showcase how clever mathematical manipulation and minimalist code can produce surprisingly interesting visuals within the 16x16 resolution. The piece is less about explaining specific techniques and more about highlighting the art of \"code golfing\" – achieving maximum creative output with minimal code.\n",
    "chinese_title": "简单的16x16点阵动画，源于简单的数学规则",
    "chinese_summary": "这篇“创意代码高尔夫”展示了一种使用简单的数学规则生成 16x16 点阵动画的方法，可能是在有限的代码环境下。核心思想是将时间（t）和像素坐标（i）的组合（可能推导出 x 和 y 坐标）映射到像素状态（开或关）。 通过随时间（t）改变输出实现动画。\n\n重点在于代码的简洁和效率，这表明用于计算像素状态的方程经过精心设计，力求简单并针对最小字符数进行了优化。 这意味着即使在受限的数学基础上，也可以实现复杂且具有视觉吸引力的图案。\n\n标题和内容表明在严格的技术限制下展示艺术潜力。 作者可能旨在展示巧妙的数学操作和极简的代码如何在 16x16 分辨率内产生令人惊讶的有趣视觉效果。 这篇文章与其说是解释具体技术，不如说是强调“代码高尔夫”的艺术——以最少的代码实现最大的创意输出。"
  },
  {
    "id": "43934411",
    "title": "The Ecstatic Swoon",
    "url": "https://aeon.co/essays/what-stendhal-says-about-the-purpose-and-promise-of-art",
    "summary": "Robert D. Zaretsky's essay explores the \"Stendhal syndrome,\" named after the author Henri Beyle (Stendhal), who experienced intense emotional and physical reactions to art in Florence. The syndrome manifests in tourists overwhelmed by the city's art, sometimes requiring medical attention.\n\nZaretsky contrasts this intense reaction with the often superficial way people engage with art today, observing that museum visitors typically spend little time with each piece, often prioritizing quick consumption and social media documentation over genuine appreciation. He notes that tourists now often \"do\" the great sites of history and art less to see them than to be seen by them, more to add to our cultural capital than to our personal growth.\n\nStendhal himself criticized the overwhelming experience of art tourism, as seen in the Louvre, and championed a more personal and emotional engagement with art. He believed that the purpose of art is to evoke feeling and that true appreciation requires surrendering to the artwork rather than analyzing it.\n\nZaretsky emphasizes Stendhal's view that artists themselves must be passionate individuals capable of conveying deep emotions through their work, exemplified by his admiration for artists like Correggio, whom he saw as capable of eliciting profound feeling in the viewer. The essay ultimately advocates for a more immersive and emotional approach to experiencing art, echoing Stendhal's belief that art should move us profoundly.\n",
    "chinese_title": "狂喜的昏厥",
    "chinese_summary": "罗伯特·D·扎列茨基的文章探讨了“司汤达综合症”，这一名称源于作家亨利·贝尔（司汤达），他曾在佛罗伦萨体验到对艺术的强烈情感和身体反应。这种综合症表现为游客被城市艺术压倒，有时需要医疗救助。\n\n扎列茨基将这种强烈的反应与如今人们对待艺术时常有的肤浅方式进行对比，他观察到博物馆参观者通常在每件作品上花费的时间很少，往往优先考虑快速消费和社交媒体记录，而不是真正的欣赏。他指出，现在游客“游览”伟大的历史和艺术遗址，与其说是为了观看，不如说是为了被观看，更多的是为了增加我们的文化资本，而不是为了个人的成长。\n\n司汤达本人批评了艺术旅游带来的压倒性体验，正如卢浮宫所见，并倡导一种更个人化和情感化的艺术参与方式。他认为艺术的目的是唤起情感，真正的欣赏需要臣服于艺术作品，而不是分析它。\n\n扎列茨基强调了司汤达的观点，即艺术家本身必须是充满激情的人，能够通过他们的作品传递深刻的情感，例如他对柯勒乔等艺术家的钦佩，他认为这些艺术家能够引发观众的深刻感受。这篇文章最终倡导一种更沉浸式和情感化的艺术体验方式，呼应了司汤达的信念，即艺术应该深刻地感动我们。"
  },
  {
    "id": "43952254",
    "title": "Most AI spending driven by FOMO, not ROI, CEOs tell IBM",
    "url": "https://www.theregister.com/2025/05/06/ibm_ai_investments/",
    "summary": "According to an IBM survey of 2,000 CEOs, only 25% of AI initiatives are delivering the expected ROI, despite the hype surrounding generative AI. While over half the respondents say their organization is realizing some value from GenAI investments beyond cost reduction, the majority are driven by FOMO (fear of missing out), with 64% adopting the technology before fully understanding its benefits.\n\nCEOs expect AI investments to double in the next two years and are increasingly adopting AI agents to automate tasks. However, only 16% of AI initiatives have scaled across entire enterprises. Many organizations struggle with disconnected AI technologies and the high cost of AI hardware.\n\nThe survey highlights the challenge of balancing existing operations with AI innovation, hindering ROI. IBM is addressing this with its Watsonx Orchestrate framework and API Agent to simplify AI agent development. Despite the challenges, 72% believe proprietary data is key to unlocking GenAI's value, though normalizing and filtering data remains a hurdle. Many companies are hiring new AI roles and retraining staff. While currently facing challenges, 85% of executives expect their GenAI investments to pay off within two years.\n",
    "chinese_title": "大多数人工智能支出受“错失恐惧症”驱动，而非投资回报，CEO们告知IBM。",
    "chinese_summary": "IBM调查：仅25%的AI项目实现预期投资回报率，多数企业因“错失恐惧症”盲目跟风。"
  },
  {
    "id": "43929828",
    "title": "Sole maintainer of Linux distro AnduinOS turns out to be a Microsoft employee",
    "url": "https://www.neowin.net/news/the-sole-maintainer-of-linux-distribution-anduinos-turns-out-to-be-a-microsoft-employee/",
    "summary": "Anduin Xue, a Microsoft employee and the sole maintainer of the Linux distribution AnduinOS, which is designed to resemble Windows 11, has come forward to discuss his project. AnduinOS is a personal project based on Ubuntu, created to provide a comfortable user interface, and Xue dedicates a few hours each month to its maintenance. As a Software Engineer 2 at Microsoft (not working on Windows), he doesn't intend to commercialize AnduinOS and hasn't sought donations.\n\nConcerns were raised about the origin of the distro, since it's from China. Xue addressed this by pointing out that the open-source nature of AnduinOS makes it impractical to insert backdoors for the Chinese government.\n\nXue intends to continue supporting AnduinOS, possibly even full-time if sponsorship or corporate cooperation arises. With Microsoft ending mainstream support for Windows 10 in October and many computers unable to upgrade to Windows 11, AnduinOS presents a Linux-based alternative with a familiar Windows-like interface.\n",
    "chinese_title": "Linux发行版AnduinOS的唯一维护者竟然是微软员工",
    "chinese_summary": "微软员工薛安敦是 Linux 发行版 AnduinOS 的唯一维护者。AnduinOS 旨在模仿 Windows 11，薛安敦现身讨论了他的项目。 AnduinOS 是一个基于 Ubuntu 的个人项目，旨在提供舒适的用户界面。薛安敦每月花费几个小时进行维护。作为微软的软件工程师 2 （不从事 Windows 相关工作），他无意将 AnduinOS 商业化，也没有寻求捐款。\n\n由于该发行版来自中国，人们对其来源表示担忧。薛安敦通过指出 AnduinOS 的开源性质使得中国政府难以植入后门来解决了这个问题。\n\n薛安敦打算继续支持 AnduinOS，如果能获得赞助或企业合作，甚至可能全职投入。由于微软将于 10 月结束对 Windows 10 的主流支持，并且许多计算机无法升级到 Windows 11，AnduinOS 提供了一个基于 Linux 的替代方案，具有熟悉的类 Windows 界面。"
  },
  {
    "id": "43943652",
    "title": "Slow software for a burning world",
    "url": "https://bonfirenetworks.org/posts/slow_software_for_a_burning_world/",
    "summary": "Bonfire is approaching its 1.0 release, but instead of a typical launch, the team is reflecting on their unique, \"slow software\" approach focused on care, deep listening, and collective stewardship, contrasting it with Silicon Valley's \"move fast and break things\" mentality. They emphasize values like trust, consent, community, and environmental sustainability, which are often sacrificed in the pursuit of profit and rapid scaling.\n\nInspired by the Zapatista \"caracol,\" Bonfire prioritizes decentralized governance, flexibility, and community involvement. Key features include modular design where communities govern \"flavors\" of Bonfire, configurable defaults, custom roles, and granular permission controls. The aim is to prioritize real relationships over simplified approaches, centering marginalized needs.\n\nTo resist capture and ensure long-term community autonomy, Bonfire uses AGPL licensing, multi-layered modularity, community-governed \"flavors,\" and avoids VC funding and advertisements. They're experimenting with sociocratic circles and participatory funding models to maintain resilience.\n\nBonfire federates with Mastodon and the wider fediverse, emphasizing autonomy through connection, allowing communities to maintain their unique cultures and practices. The project aims to prevent user lock-in by promoting data migration freedom.\n\nThe \"campground\" test instance serves as a living laboratory for co-design and experimentation, inviting active participants to shape the platform's development, governance, and culture. The Bonfire team encourages community organizers, activists, and builders to join the conversation, propose features, contribute feedback, and help shape the project's future. They want to build interconnected spaces based on care, autonomy, and collective power, and invite others to join them.\n",
    "chinese_title": "应对燃眉之急的迟缓软件",
    "chinese_summary": "Bonfire即将发布1.0版本，但团队并未采取典型的发布方式，而是反思其独特的“慢软件”理念，即专注于关怀、深度倾听和集体管理，这与硅谷“快速行动，打破常规”的心态形成对比。他们强调信任、共识、社群和环境可持续性等价值观，而这些价值观往往在追求利润和快速扩张时被牺牲。\n\n受萨帕塔运动“蜗牛”的启发，Bonfire优先考虑去中心化治理、灵活性和社区参与。主要功能包括模块化设计，社区可以管理Bonfire的“风味”，可配置的默认设置、自定义角色和细粒度的权限控制。其目标是优先考虑真实的联系，而非简化的方法，并以边缘化的需求为中心。\n\n为了抵制捕获并确保长期的社区自主性，Bonfire采用AGPL许可、多层模块化、社区管理的“风味”，并避免风险投资和广告。他们正在试验社会计量圈和参与式融资模式，以保持韧性。\n\nBonfire与Mastodon和更广泛的联邦宇宙联合，强调通过连接实现自主性，允许社区保持其独特的文化和实践。该项目旨在通过促进数据迁移自由来防止用户锁定。\n\n“露营地”测试实例作为一个共同设计和实验的活实验室，邀请积极参与者塑造平台的开发、治理和文化。Bonfire团队鼓励社区组织者、活动家和建设者加入对话，提出功能建议，贡献反馈，并帮助塑造项目的未来。他们希望建立基于关怀、自主和集体力量的互联空间，并邀请其他人加入。"
  },
  {
    "id": "43943610",
    "title": "In praise of grobi for auto-configuring X11 monitors",
    "url": "https://michael.stapelberg.ch/posts/2025-05-10-grobi-x11-monitor-autoconfig/",
    "summary": "This article praises the `grobi` program for automatically configuring X11 monitors, specifically addressing the challenges of using a Dell 32-inch 8K monitor (UP3218K) after waking from suspend-to-RAM. The author previously relied on a custom script and manual `xrandr` commands, which were unreliable and inconvenient.\n\n`grobi` solves this by listening for X11 RandR output change events and automatically running `xrandr` based on a configuration file. The author provides a sample `~/.config/grobi.conf` file tailored for their monitor setup, demonstrating how to define rules for specific monitors and their desired configurations, including resolution and positioning. The configuration allows for atomic `xrandr` calls for better compatibility with certain graphic cards.\n\nThe author also shares details on how to install and enable `grobi` on Arch Linux and how to check its status using `systemctl` and `journalctl`.\n\nFurthermore, the article includes a bonus section describing the author's suspend-to-RAM setup using `zleep`, a wrapper around `rtcwake` and `systemctl suspend`, which also integrates with a myStrom smart plug to cut power to the monitor completely, saving energy.  The author provides the Go source code for `zleep` and the shell script used to turn the monitor back on after resume, leveraging `grobi` for automatic configuration. Finally, the author gives a sample output for the `zleep` program, and briefly explains that it is more ideal to use `grobi` due to the authors familiarity.\n",
    "chinese_title": "赞美grobi自动配置X11显示器",
    "chinese_summary": "`grobi`：自动配置X11显示器，解决Dell 8K显示器唤醒后问题"
  },
  {
    "id": "43942149",
    "title": "WebGL Water (2010)",
    "url": "https://madebyevan.com/webgl-water/",
    "summary": "This is a demonstration of WebGL Water, a real-time water rendering engine created by Evan Wallace in 2010. The demo showcases advanced graphics techniques achievable through WebGL, including raytraced reflections and refractions, analytic ambient occlusion, heightfield water simulation, soft shadows, and caustics.\n\nThe demo allows users to interact with the water in several ways: drawing ripples, rotating the camera, pausing the simulation, moving a sphere that interacts with the water, adjusting the light direction, and toggling gravity.\n\nThe underlying implementation relies on specific WebGL extensions. The heightfield water simulation utilizes the `OES_texture_float` extension, while the caustics rendering depends on the `OES_standard_derivatives` extension. The demo requires a modern graphics card and up-to-date drivers for optimal performance. If the demo fails to run, a YouTube video is provided as an alternative. The tile texture used in the demonstration is credited to zooboing on Flickr.\n",
    "chinese_title": "WebGL 水 (2010)",
    "chinese_summary": "这是一个WebGL水体演示，由Evan Wallace于2010年创建的实时水体渲染引擎。该演示展示了通过WebGL实现的高级图形技术，包括光线追踪反射和折射、解析环境光遮蔽、高度场水体模拟、软阴影和焦散。\n\n用户可以通过多种方式与水体进行互动：绘制波纹、旋转相机、暂停模拟、移动与水体交互的球体、调整光照方向以及切换重力。\n\n底层实现依赖于特定的WebGL扩展。高度场水体模拟利用了`OES_texture_float`扩展，而焦散渲染依赖于`OES_standard_derivatives`扩展。该演示需要现代显卡和最新的驱动程序才能获得最佳性能。如果演示无法运行，则提供YouTube视频作为替代方案。演示中使用的瓷砖纹理归功于Flickr上的zooboing。"
  },
  {
    "id": "43953992",
    "title": "Olivia Farnsworth. The \"Bionic Teen\" Who Feels No Pain",
    "url": "https://medium.com/@Sibouze/meet-olivia-farnsworth-689caade73b5",
    "summary": "Olivia Farnsworth, dubbed the \"Bionic Teen,\" is a young girl from the UK who experiences no pain, hunger, or fatigue due to a rare genetic condition called chromosome 6 deletion. The article highlights a shocking incident where she was hit by a car and dragged down the street at the age of seven, yet she simply got up, brushed herself off, and walked away without any complaints. This incident exemplifies the extraordinary nature of her condition and its implications. The article aims to delve into Olivia's journey, explore the science behind her genetic anomaly, and examine the global fascination with her unique situation, focusing on themes of resilience and the mysteries of the human body. The introduction establishes the remarkable reality of Olivia's life and sets the stage for a deeper exploration of her story.\n",
    "chinese_title": "奥利维亚·法恩斯沃思：感觉不到疼痛的“仿生少女”",
    "chinese_summary": "被誉为“仿生少女”的奥莉维亚·法恩斯沃思，是一位来自英国的年轻女孩，由于一种罕见的名为6号染色体缺失的遗传疾病，她感受不到疼痛、饥饿或疲劳。文章重点介绍了一起令人震惊的事件：在她七岁时，她被一辆汽车撞倒并拖行在街上，但她只是站起来，拍拍身上的灰尘，一声不吭地走开了。这一事件例证了她病情的非凡性质及其影响。文章旨在深入探讨奥莉维亚的经历，探索她遗传异常背后的科学原理，并审视全球对她独特情况的着迷，重点关注韧性和人体奥秘等主题。引言确立了奥莉维亚生活的非凡现实，并为更深入地探索她的故事奠定了基础。"
  },
  {
    "id": "43911421",
    "title": "Loss of dance and infant-directed song among the Northern Aché",
    "url": "https://www.cell.com/current-biology/fulltext/S0960-9822(25)00447-6",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "北方阿切族舞蹈和对婴儿歌唱的丧失",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "43913705",
    "title": "Private Japanese lunar lander enters orbit around moon ahead of a June touchdown",
    "url": "https://phys.org/news/2025-05-private-japanese-lunar-lander-orbit.html",
    "summary": "In May 2025, Japan's private lunar lander, Resilience, developed by Tokyo-based ispace, successfully entered lunar orbit. This marks a significant step toward the lander's planned touchdown in the first week of June. The mission follows successful lunar landings by two U.S. companies, Firefly Aerospace (the first private outfit to successfully land a spacecraft on the moon) and Intuitive Machines. ispace previously experienced a failed lunar landing in 2023.\n\nResilience carries a mini rover equipped with a scoop designed to collect lunar soil samples for analysis, along with other scientific experiments. The launch of Resilience was conducted by SpaceX in January, with Firefly Aerospace's lander also onboard.\n\nIspace has officially declared the start of the countdown to the lunar landing. The article highlights the growing trend of private companies participating in lunar exploration, with Japan aiming to join the ranks of nations and private entities that have successfully reached the moon's surface.\n",
    "chinese_title": "日本私人月球着陆器进入绕月轨道，计划六月着陆。",
    "chinese_summary": "2025年5月，日本东京ispace公司开发的私营月球着陆器“坚韧号”成功进入月球轨道。这标志着该着陆器计划于六月第一周着陆迈出了重要一步。此前，两家美国公司，萤火虫航空航天公司（首家成功将航天器降落在月球上的私营公司）和直觉机器公司，已成功实现月球着陆。ispace公司此前在2023年经历了一次月球着陆失败。\n\n“坚韧号”搭载了一辆配备铲子的迷你漫游车，旨在收集月球土壤样本进行分析，以及其他科学实验。“坚韧号”于一月份由SpaceX公司发射升空，萤火虫航空航天公司的着陆器也在船上。\n\nIspace公司已正式宣布启动月球着陆倒计时。文章强调了私营公司参与月球探测的日益增长的趋势，日本的目标是加入已成功到达月球表面的国家和私营实体行列。"
  },
  {
    "id": "43937214",
    "title": "ALICE detects the conversion of lead into gold at the LHC",
    "url": "https://www.home.cern/news/news/physics/alice-detects-conversion-lead-gold-lhc",
    "summary": "The ALICE collaboration at CERN's LHC has achieved a modern form of alchemy, transmuting lead into gold through near-miss collisions of lead nuclei. While head-on collisions create quark-gluon plasma, these glancing blows generate intense electromagnetic fields. These fields, due to the lead nucleus's 82 protons and the nuclei's near-light speed, emit photon pulses. These photons interact with the lead nuclei, sometimes ejecting three protons and neutrons, thus transforming lead (82 protons) into gold (79 protons).\n\nThe ALICE detectors, specifically the zero degree calorimeters (ZDC), were used to count these photon-nucleus interactions, identifying the production of lead, thallium, mercury, and gold based on the number of ejected protons. The LHC produces gold at a rate of 89,000 nuclei per second, although they only exist for a fraction of a second before fragmenting. During Run 2 (2015-2018), approximately 86 billion gold nuclei were created, equivalent to a mere 29 picograms. Run 3 produced almost double that amount, but still far from a commercially viable quantity.\n\nDespite dashing hopes of riches, this achievement is significant. It represents the first systematic detection and analysis of gold production at the LHC. The research also helps refine theoretical models of electromagnetic dissociation, crucial for understanding and predicting beam losses that limit the LHC's performance and the design of future colliders.\n",
    "chinese_title": "ALICE探测到大型强子对撞机上铅转化为金的过程",
    "chinese_summary": "欧洲核子研究中心（CERN）大型强子对撞机（LHC）的ALICE合作组实现了一种现代炼金术，通过铅核的近距碰撞将铅转化为金。正面碰撞产生夸克-胶子等离子体，而这种掠射碰撞会产生强烈的电磁场。由于铅核拥有82个质子，并且核的速度接近光速，这些电磁场会发出光子脉冲。这些光子与铅核相互作用，有时会喷射出三个质子和中子，从而将铅（82个质子）转化为金（79个质子）。\n\nALICE探测器，特别是零度量热计（ZDC），被用于计数这些光子与原子核的相互作用，基于喷射出的质子数量来识别铅、铊、汞和金的产生。LHC以每秒89,000个原子核的速度产生金，尽管它们只存在不到一秒的时间就会分裂。在运行2（2015-2018）期间，大约产生了860亿个金核，相当于仅仅29皮克。运行3产生的数量几乎是其两倍，但仍然远未达到商业上可行的数量。\n\n尽管打消了人们对财富的希望，但这一成就意义重大。它代表了首次在LHC上系统地探测和分析金的产生。该研究还有助于改进电磁解离的理论模型，这对于理解和预测限制LHC性能的束流损失以及未来对撞机的设计至关重要。"
  },
  {
    "id": "43951737",
    "title": "On thinkers and doers (2022)",
    "url": "https://www.strangeloopcanon.com/p/on-thinkers-and-doers",
    "summary": "Rohit Krishnan's \"On Thinkers and Doers\" explores the distinction between these two approaches to problem-solving and progress, particularly in science and technology. The article argues that while \"doers\" like Elon Musk excel at executing existing knowledge by combining resources and talent to achieve ambitious goals, \"thinkers\" are necessary for fundamental paradigm shifts and breakthroughs that require imagination and new theories.\n\nKrishnan suggests that recent decades have favored \"doers,\" leading to advancements within existing frameworks (e.g., microchip development), but fewer paradigm-shifting discoveries. He attributes this shift to the rise of \"big science\" after the Manhattan Project, where large-scale, project-managed research became the norm. While this approach has yielded significant technological progress, it has also potentially stifled \"little science\" – the artisanal, curiosity-driven research that historically fostered major scientific breakthroughs.\n\nThe author questions whether society needs to re-emphasize fostering \"thinkers\" alongside \"doers\" to address complex challenges that require fundamental paradigm shifts, highlighting issues like climate change, housing, and education. He suggests a potential imbalance in the modern scientific and technological landscape, calling for more environments conducive to individual exploration and imaginative leaps, which the current system may inadvertently suppress.\n",
    "chinese_title": "思考者和实干家 (2022)",
    "chinese_summary": "罗希特·克里希南的《论思想者与实践者》探讨了解决问题和取得进步的两种方法之间的区别，尤其是在科学和技术领域。文章认为，虽然像埃隆·马斯克这样的“实践者”擅长运用现有知识，通过整合资源和人才来实现雄心勃勃的目标，但“思想者”对于需要想象力和新理论的根本性范式转变和突破至关重要。\n\n克里希南认为，近几十年来，社会更加青睐“实践者”，导致了现有框架内的进步（例如，微芯片的开发），但范式转变的发现却较少。他将这种转变归因于曼哈顿计划后“大科学”的兴起，大规模、项目管理型的研究成为常态。虽然这种方法带来了显著的技术进步，但也可能扼杀了“小科学”——即历史上孕育重大科学突破的工匠式、好奇心驱动的研究。\n\n作者质疑社会是否需要重新强调培养“思想者”和“实践者”，以应对需要根本性范式转变的复杂挑战，并强调了气候变化、住房和教育等问题。他认为现代科学技术领域可能存在失衡，呼吁创造更多有利于个人探索和富有想象力飞跃的环境，而目前的系统可能会无意中抑制这些。"
  },
  {
    "id": "43942318",
    "title": "Charles Bukowski, William Burroughs, and the Computer (2009)",
    "url": "https://realitystudio.org/bibliographic-bunker/charles-bukowski-william-burroughs-and-the-computer/",
    "summary": "This article explores the relationships Charles Bukowski and William Burroughs had with computers. While Bukowski initially resisted, he embraced the Macintosh in his later years, finding it energized his writing and allowed him to produce more poems. He even used the computer as a metaphor in his work, representing both creative potential and the inevitability of aging and death. The article notes Bukowski's awareness of the Internet and electronic books, showcasing his open mind to technological advancements.\n\nWhile Bukowski welcomed computer-aided writing, Burroughs didn't incorporate it into his creative process, raising important questions about preserving and studying literary archives in the digital age. The author contemplates how future scholars will navigate archives filled with diverse computer technologies, operating systems, and electronic drafts. The article highlights the need for scholars and librarians to possess computer expertise alongside traditional bibliographic skills to properly analyze and interpret literary works created using digital tools. The William Burroughs archive, mostly pre-digital, is contrasted with the challenges posed by archives containing \"born-digital\" materials, emphasizing the evolving responsibilities of librarians in the digital age.\n",
    "chinese_title": "查尔斯·布考斯基、威廉·巴勒斯与电脑 (2009)",
    "chinese_summary": "本文探讨了查尔斯·布考斯基和威廉·巴勒斯与电脑的关系。布考斯基起初抗拒电脑，但晚年拥抱了Macintosh，发现它激发了他的写作，使他创作了更多的诗歌。他甚至在作品中将电脑用作一种隐喻，既代表了创造潜力，也代表了衰老和死亡的必然性。文章指出布考斯基对互联网和电子书的认知，展现了他对技术进步的开放心态。\n\n虽然布考斯基欢迎电脑辅助写作，但巴勒斯并未将其融入创作过程，这引发了关于在数字时代保存和研究文学档案的重要问题。作者思考未来学者将如何处理充斥着各种计算机技术、操作系统和电子草稿的档案。文章强调，学者和图书馆员需要具备计算机专业知识以及传统的目录学技能，才能正确分析和解读使用数字工具创作的文学作品。威廉·巴勒斯的档案大多是前数字化的，与包含“原生数字”材料的档案所带来的挑战形成对比，突出了图书馆员在数字时代不断演变的责任。"
  },
  {
    "id": "43950310",
    "title": "Scoring the European Citizen in the AI Era",
    "url": "https://arxiv.org/abs/2505.02791",
    "summary": "This article, \"Scoring the European Citizen in the AI Era\" by Nathan Genicot, examines the European Union's AI Act's ban on social scoring in light of existing scoring practices within Europe. The author argues that while the ban is partly motivated by concerns about authoritarian social credit systems like China's, its flexible drafting makes it a potentially useful tool for protecting individuals from disproportionate uses of AI-based scoring in Europe.\n\nThe article acknowledges that numerous public and private entities in Europe already employ scoring systems for various purposes, including creditworthiness assessment, employee monitoring, and fraud detection. These systems are generally classified as \"high-risk AI systems\" under the AI Act, subject to specific requirements rather than an outright ban.\n\nGenicot contends that the ban on social scoring is not simply a symbolic safeguard against potential authoritarian overreach. He believes the ban, when combined with Article 22 of the GDPR, will offer individuals protection against the most harmful applications of AI-driven scoring by offering a legal tool to challenge disproportionate or unfair uses of these systems. The paper supports this argument by detailing how the social scoring ban is formulated to offer flexibility in its practical application, thus making it more effective than a blanket ban. The article appeared in the Computer Law & Security Review.\n",
    "chinese_title": "人工智能时代下的欧洲公民评分",
    "chinese_summary": "内森·热尼科特所著的《人工智能时代下的欧洲公民评分》一文，考察了欧盟《人工智能法案》中对社会评分的禁令，并结合了欧洲现有的评分实践。作者认为，该禁令的部分动机是出于对诸如中国等威权社会信用体系的担忧，但其灵活的措辞使其成为保护个人免受欧洲境内过度使用人工智能评分的潜在有效工具。\n\n文章承认，欧洲许多公共和私人实体已经出于各种目的使用了评分系统，包括信用评估、员工监控和欺诈检测。根据《人工智能法案》，这些系统通常被归类为“高风险人工智能系统”，受到特定要求的约束，而不是完全禁止。\n\n热尼科特认为，禁止社会评分不仅仅是对潜在的专制过度行为的一种象征性保障。他认为，当禁令与《通用数据保护条例》第22条结合使用时，将为个人提供针对人工智能驱动评分的最有害应用的保护，提供一种法律工具来挑战这些系统的不成比例或不公平的使用。该论文通过详细说明社会评分禁令的制定方式如何为其在实际应用中提供灵活性，从而使其比全面禁止更有效，以此来支持这一论点。该文章发表于《计算机法律与安全评论》。"
  },
  {
    "id": "43946498",
    "title": "'It cannot provide nuance': UK experts warn AI therapy chatbots are not safe",
    "url": "https://www.theguardian.com/technology/2025/may/07/experts-warn-therapy-ai-chatbots-are-not-safe-to-use",
    "summary": "This article discusses the growing concern among UK experts regarding the use of AI therapy chatbots, highlighting potential dangers and the need for regulation. Mark Zuckerberg envisions AI as a readily available therapeutic tool, capable of filling gaps in people's social lives and providing support for personal issues. He believes everyone should have access to a \"therapist\" in the form of AI.\n\nHowever, mental health clinicians are wary. Prof Dame Til Wykes warns that AI lacks nuance and could offer inappropriate advice, citing a previous incident where an eating disorder chatbot was retracted after providing harmful suggestions. She also raises concerns that reliance on AI could disrupt existing human relationships.\n\nWhile some AI mental health tools like Wysa are valued by users, Dr. Jaime Craig emphasizes the critical need for oversight and regulation to ensure safety and best practices. The article points to instances of AI chatbots impersonating therapists with fake credentials on Meta's platforms.\n\nOpenAI even admitted to withdrawing a version of ChatGPT that gave overly flattering responses, highlighting the challenges in controlling AI behavior.  Experts underscore the potential risks of unqualified AI providing mental health support, calling for proactive measures to address this emerging technology.\n",
    "chinese_title": "“无法提供细微差别”：英国专家警告人工智能治疗聊天机器人不安全",
    "chinese_summary": "英国专家日益担忧人工智能治疗聊天机器人的使用，本文探讨了这一问题，强调了潜在的危险和监管的必要性。马克·扎克伯格设想人工智能是一种随时可用的治疗工具，能够填补人们社交生活的空白，并为个人问题提供支持。他认为每个人都应该拥有一个人工智能形式的“治疗师”。\n\n然而，精神健康临床医生对此持谨慎态度。蒂尔·怀克斯教授警告说，人工智能缺乏细微差别，可能会提供不适当的建议，她还引用了之前一个饮食失调聊天机器人因提供有害建议而被撤回的事件。她还提出，依赖人工智能可能会扰乱现有的人际关系。\n\n虽然Wysa等一些人工智能心理健康工具受到用户的重视，但杰米·克雷格博士强调，迫切需要监督和监管，以确保安全和最佳实践。本文指出，在Meta平台上，曾出现人工智能聊天机器人冒充具有虚假凭证的治疗师的案例。\n\nOpenAI甚至承认撤回了一个给出过于奉承的回应的ChatGPT版本，凸显了控制人工智能行为的挑战。专家强调了不合格的人工智能提供心理健康支持的潜在风险，呼吁采取积极措施来应对这项新兴技术。"
  },
  {
    "id": "43935625",
    "title": "Data manipulations alleged in study that paved way for Microsoft's quantum chip",
    "url": "https://www.science.org/content/article/data-manipulations-alleged-study-paved-way-microsoft-s-quantum-chip",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "研究称数据操控为微软量子芯片铺平道路",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "43943236",
    "title": "Gmail to SQLite",
    "url": "https://github.com/marcboeker/gmail-to-sqlite",
    "summary": "This document describes `gmail-to-sqlite`, a Python script to download and store Gmail emails in a SQLite database. This allows users to analyze their email data using SQL queries.\n\n**Installation:**\n\n1.  Clone the repository from GitHub.\n2.  Install the required Python packages using `pip install -r requirements.txt`.\n3.  Create a Google Cloud project and enable the Gmail API.\n4.  Configure the OAuth consent screen.\n5.  Create OAuth client ID credentials for a Desktop app and save the downloaded `credentials.json` file in the repository root.\n\n**Usage:**\n\n*   **Sync all emails:** `python main.py sync --data-dir path/to/your/data`. This creates `messages.db` and stores credentials in the specified data directory.  Run again to sync new messages. Use `--full-sync` to update read status, labels, and last indexed timestamps for existing messages.\n*   **Sync a single message:** `python main.py sync-message --data-dir path/to/your/data --message-id <message-id>`.\n\nThe document also outlines command-line parameters, details the database schema (including fields like sender, recipients, labels, subject, body, size, timestamp, read status, outgoing status, and last indexed timestamp), and provides example SQL queries for analyzing email data (e.g., emails per sender, unread emails, emails by period, newsletters, large emails, and emails sent to oneself).  A roadmap item mentions detecting and marking deleted emails in the database.\n",
    "chinese_title": "Gmail 到 SQLite",
    "chinese_summary": "本文档介绍了`gmail-to-sqlite`，这是一个Python脚本，用于下载Gmail邮件并将其存储在SQLite数据库中。这允许用户使用SQL查询分析他们的电子邮件数据。\n\n**安装：**\n\n1.  从GitHub克隆存储库。\n2.  使用`pip install -r requirements.txt`安装所需的Python包。\n3.  创建一个Google Cloud项目并启用Gmail API。\n4.  配置OAuth同意屏幕。\n5.  为桌面应用创建OAuth客户端ID凭据，并将下载的`credentials.json`文件保存在存储库根目录中。\n\n**用法：**\n\n*   **同步所有邮件：** `python main.py sync --data-dir path/to/your/data`。 这会创建`messages.db`，并将凭据存储在指定的数据目录中。 再次运行以同步新邮件。 使用`--full-sync`更新现有邮件的读取状态、标签和上次索引时间戳。\n*   **同步单个邮件：** `python main.py sync-message --data-dir path/to/your/data --message-id <message-id>`。\n\n该文档还概述了命令行参数，详细说明了数据库模式（包括发件人、收件人、标签、主题、正文、大小、时间戳、读取状态、发件状态和上次索引时间戳等字段），并提供了用于分析电子邮件数据的示例SQL查询（例如，每个发件人的电子邮件、未读电子邮件、按时间段划分的电子邮件、新闻通讯、大型电子邮件和发送给自己的电子邮件）。 路线图项目提到检测和标记数据库中已删除的电子邮件。"
  },
  {
    "id": "43953885",
    "title": "US President Donald Trump Seeks to Cancel NASA's Mars Sample Return",
    "url": "https://www.scientificamerican.com/article/trump-budget-calls-for-stranding-nasas-mars-samples-on-the-red-planet/",
    "summary": "In May 2025, the Trump administration proposed drastic cuts to NASA's budget, including the complete elimination of the Mars Sample Return (MSR) program, a joint effort with the European Space Agency (ESA) to bring Martian rock and soil samples back to Earth for analysis. The administration justifies the cancellation by claiming the project is over budget and that human missions to Mars can achieve the same goals.\n\nThis proposal has sparked outrage within the scientific community. Experts argue that MSR, the highest priority in planetary science as determined by multiple Decadal Surveys, is crucial for U.S. leadership in space exploration and for potentially finding evidence of past or present Martian life. They criticize the idea that human missions can replace MSR, citing timelines that make it unrealistic, potential contamination issues, and the immense cost of such missions.\n\nCritics also point out that China is planning a simpler Mars sample return mission around 2030, which could allow them to surpass the U.S. in this field. While some, like Robert Zubrin, have previously criticized MSR in its current form, they still oppose its outright cancellation, suggesting the funds should be redirected to other Mars exploration programs.\n\nESA, which is heavily invested in the MSR project through its Earth Return Orbiter, is maintaining a cautious approach. The ESA is exploring partnerships with other nations, notably India, potentially signaling a shift in global space exploration alliances in response to the uncertainty surrounding U.S. commitments. The future of MSR remains uncertain, awaiting a final budget decision from Congress and the potential influence of President Trump's NASA nominee, Jared Isaacman.\n",
    "chinese_title": "美国总统特朗普寻求取消NASA的火星样本返回计划",
    "chinese_summary": "2025年5月，特朗普政府提议大幅削减NASA预算，包括完全取消与欧洲航天局（ESA）合作的火星样本取回（MSR）计划，该计划旨在将火星岩石和土壤样本带回地球进行分析。政府以该项目超预算以及载人火星任务可以实现相同目标为由，为取消该项目辩护。\n\n这项提议在科学界引起强烈抗议。专家认为，根据多次十年调查确定的，MSR是行星科学的最高优先事项，对于美国在太空探索中的领导地位以及潜在地发现火星过去或现在生命存在的证据至关重要。他们批评载人任务可以取代MSR的想法，理由是时间线不切实际、存在潜在的污染问题以及此类任务的巨大成本。\n\n批评人士还指出，中国计划在2030年左右执行一项更简单的火星样本返回任务，这可能使他们超越美国在该领域。虽然像罗伯特·祖布林（Robert Zubrin）这样的人以前曾批评过目前形式的MSR，但他们仍然反对彻底取消该计划，并建议将资金转移到其他火星探索计划。\n\nESA通过其地球返回轨道器对MSR项目进行了大量投资，目前正采取谨慎态度。ESA正在探索与其他国家（尤其是印度）的合作关系，这可能预示着全球太空探索联盟的转变，以应对美国承诺的不确定性。MSR的未来仍然不确定，等待国会的最终预算决定以及特朗普总统对NASA提名人贾里德·艾萨克曼（Jared Isaacman）的潜在影响。"
  },
  {
    "id": "43909487",
    "title": "Building Local-First Flutter Apps with Riverpod, Drift, and PowerSync",
    "url": "https://dinkomarinac.dev/building-local-first-flutter-apps-with-riverpod-drift-and-powersync",
    "summary": "Okay, I will summarize the article \"Building Local-First Flutter Apps with Riverpod, Drift, and PowerSync\" based on my understanding of the technologies mentioned in the title and the likely content of such an article. If I am able to access the internet to read the article, I will provide an accurate and better summary.\n\n**Summary (Based on Title and Technology Context):**\n\nThe article likely demonstrates how to build local-first Flutter applications using the combination of Riverpod for state management, Drift (formerly Moor) for local data persistence with SQLite, and PowerSync for offline-first data synchronization with a backend database.\n\nThe \"local-first\" approach emphasizes that the application primarily operates on data stored locally on the device, providing a fast and responsive user experience even without an internet connection.\n\nThe article probably details:\n\n*   **Setting up Drift:** Creating a local database schema with Drift to model the app's data. Drift's type-safe SQL queries and code generation make database interaction easier and less error-prone.\n*   **Managing State with Riverpod:** Implementing a state management architecture using Riverpod to efficiently manage and provide data across the app's widgets. Riverpod likely handles data fetching, caching, and updates from both the local Drift database and the backend.\n*   **Integrating PowerSync:** Connecting the Flutter app to PowerSync, which acts as a synchronization layer. PowerSync manages the complex process of synchronizing data between the local Drift database and a remote database (e.g., PostgreSQL) when the device is online. It likely handles conflict resolution and ensures data consistency.\n*   **Offline Functionality:** Showcasing how the application remains fully functional even when offline, as it relies on the local Drift database.\n*   **Example Use Case:** The article may use a specific example application (e.g., a task manager, note-taking app) to illustrate the integration of these technologies in a practical scenario.\n\nThe article likely highlights the benefits of this stack, including improved performance, offline capabilities, and simplified data synchronization, ultimately leading to a better user experience. It is intended for Flutter developers looking to build robust, offline-capable, and scalable applications.\n\n",
    "chinese_title": "使用Riverpod、Drift和PowerSync构建本地优先的Flutter应用",
    "chinese_summary": "好的，我将根据我对标题中提到的技术和文章可能内容的理解，总结文章“使用Riverpod、Drift和PowerSync构建本地优先的Flutter应用”。如果我能够访问互联网阅读该文章，我将提供更准确、更好的总结。\n\n**摘要（基于标题和技术背景）：**\n\n该文章可能演示了如何使用Riverpod进行状态管理，使用Drift（以前称为Moor）通过SQLite进行本地数据持久化，以及使用PowerSync与后端数据库进行离线优先的数据同步，来构建本地优先的Flutter应用程序。\n\n“本地优先”方法强调应用程序主要在设备本地存储的数据上运行，即使没有互联网连接，也能提供快速响应的用户体验。\n\n文章可能详细介绍了：\n\n*   **设置Drift：** 使用Drift创建本地数据库模式，以对应用程序的数据进行建模。Drift的类型安全SQL查询和代码生成使得数据库交互更容易且不易出错。\n*   **使用Riverpod管理状态：** 使用Riverpod实现状态管理架构，以有效地管理和提供整个应用程序的数据。Riverpod可能处理从本地Drift数据库和后端的数据获取、缓存和更新。\n*   **集成PowerSync：** 将Flutter应用程序连接到PowerSync，PowerSync充当同步层。PowerSync管理本地Drift数据库和远程数据库（例如PostgreSQL）之间的数据同步的复杂过程（当设备在线时）。它可能处理冲突解决并确保数据一致性。\n*   **离线功能：** 展示应用程序即使在离线时也能完全正常运行，因为它依赖于本地Drift数据库。\n*   **用例示例：** 该文章可能会使用特定的示例应用程序（例如，任务管理器、笔记应用程序）来说明这些技术在实际场景中的集成。\n\n该文章可能强调了这种技术栈的优势，包括改进的性能、离线功能和简化的数据同步，最终带来更好的用户体验。 它适用于希望构建健壮、支持离线且可扩展的应用程序的Flutter开发人员。"
  },
  {
    "id": "43930397",
    "title": "How to start a school with your friends",
    "url": "https://prigoose.substack.com/p/how-to-start-a-university",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "如何与朋友一起创办学校",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "43944974",
    "title": "LTXVideo 13B AI video generation",
    "url": "https://ltxv.video/",
    "summary": "LTXV 13B is a groundbreaking AI video generation model developed by Lightricks, boasting 13 billion parameters for high-quality video creation with unprecedented speed and efficiency. Released in May 2025, it's a significant upgrade from its 2B parameter predecessor.\n\nKey features include text-to-video and image-to-video capabilities, real-time performance on consumer hardware (like NVIDIA 4090/5090 GPUs with 8GB+ VRAM, though a quantized version is available for less VRAM), and advanced technologies like multiscale rendering. Multiscale rendering drafts videos in lower detail initially, focusing on motion, and then refines details for enhanced speed and quality, resulting in 30x faster generation compared to comparable models.\n\nThe LTXV model family supports various video generation modes, including keyframe animation, video extension, and video-to-video transformations, all while adhering to text prompts more accurately. The model is available under the LTXV Open Weights License, fostering community development with tools like LTX-Video-Trainer (for fine-tuning) and ComfyUI integration. The model and its tools can be found on Hugging Face and GitHub, with enterprise-level API access also available. Version 0.9.7 brings improved prompt adherence, enhanced motion quality, and better fine details.\n",
    "chinese_title": "LTXVideo 13B AI视频生成",
    "chinese_summary": "LTXV 13B是由Lightricks开发的突破性AI视频生成模型，拥有130亿参数，能以空前的速度和效率创作高质量视频。该模型于2025年5月发布，是对其20亿参数前代产品的重大升级。\n\n主要功能包括文本到视频和图像到视频转换，在消费级硬件（如配备8GB+显存的NVIDIA 4090/5090 GPU，尽管有量化版本适用于更少显存）上的实时性能，以及多尺度渲染等先进技术。多尺度渲染最初以较低的细节草拟视频，侧重于运动，然后细化细节以提高速度和质量，与同类模型相比，生成速度提高了30倍。\n\nLTXV模型系列支持各种视频生成模式，包括关键帧动画、视频扩展和视频到视频转换，所有这些都更准确地遵循文本提示。该模型在LTXV开放权重许可下提供，通过诸如LTX-Video-Trainer（用于微调）和ComfyUI集成等工具促进社区发展。该模型及其工具可在Hugging Face和GitHub上找到，同时还提供企业级API访问。0.9.7版本带来了改进的提示遵循、增强的运动质量和更好的精细细节。"
  },
  {
    "id": "43939520",
    "title": "Odin, a pragmatic C alternative with a Go flavour",
    "url": "http://bitshifters.cc/2025/05/04/odin.html",
    "summary": "Odin is presented as a modern, pragmatic alternative to C, designed for systems programming by Bill Hall. It prioritizes simplicity, performance, and readability while maintaining low-level control. Despite its data-oriented focus with features like SOA and implicit zero initialization, Odin surprisingly integrates dynamic maps and arrays.\n\nOdin favors practicality over idealism, aiming for code that's easy to understand and reason about. It takes an old-fashioned approach to types, incorporating built-in types such as complex numbers, vectors, matrices, and quaternions, compensating for the lack of operator overloading. The language's syntax is straightforward, removing the need for explicit mutability and traditional semicolons. Its error handling, however, utilizes Go-style multiple returns, which some find clunky.\n\nWhile sharing syntactic similarities with Jai, Odin emphasizes simplicity and built-in features, contrasting with Jai's compile-time execution and metaprogramming. Compared to Zig, Odin values developer experience and a user-friendly syntax, whereas Zig prioritizes explicitness and compile-time metaprogramming.\n\nCriticisms of Odin include insufficient documentation, reliance on Discord for community interaction, and occasional calls for more metaprogramming capabilities. Despite these points, Odin offers built-in solutions to common problems, such as SOA, which are typically addressed through metaprogramming in languages like Zig and Jai. Overall, Odin is portrayed as a robust and efficient language, particularly well-suited for graphics-intensive applications.\n",
    "chinese_title": "奥丁：一种务实的C语言替代品，带有Go语言的风格",
    "chinese_summary": "奥丁是由 Bill Hall 设计的，作为 C 的一种现代、务实的替代方案，用于系统编程。它在保持底层控制的同时，优先考虑简洁性、性能和可读性。尽管它以面向数据的特性（如 SOA 和隐式零初始化）为重点，但令人惊讶的是，奥丁集成了动态映射和数组。\n\n奥丁偏爱实用性而非理想主义，旨在编写易于理解和推理的代码。它采用了一种老式类型方法，包含内置类型，如复数、向量、矩阵和四元数，以弥补运算符重载的不足。该语言的语法简洁明了，无需显式可变性和传统分号。然而，它的错误处理采用 Go 风格的多重返回值，有些人认为这很笨拙。\n\n虽然与 Jai 有相似的语法，但奥丁强调简洁性和内置功能，这与 Jai 的编译时执行和元编程形成对比。与 Zig 相比，奥丁重视开发者体验和用户友好的语法，而 Zig 则优先考虑显式性和编译时元编程。\n\n对奥丁的批评包括文档不足，依赖 Discord 进行社区互动，以及偶尔需要更多元编程能力。尽管存在这些问题，奥丁提供了针对常见问题的内置解决方案，例如 SOA，这些问题通常在 Zig 和 Jai 等语言中通过元编程来解决。总的来说，奥丁被描述为一种强大而高效的语言，尤其适合图形密集型应用程序。"
  },
  {
    "id": "43940033",
    "title": "Why 536 was 'the worst year to be alive' (2018)",
    "url": "https://www.science.org/content/article/why-536-was-worst-year-be-alive",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "为什么536年是“最糟糕的生存之年”（2018）",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "43914852",
    "title": "Stratolaunch Successfully Completes Reusable Hypersonic Flight and Recovery",
    "url": "https://www.stratolaunch.com/news/stratolaunch-successfully-completes-reusable-hypersonic-flight-and-recovery-with-talon-a2-vehicle/",
    "summary": "Stratolaunch announced the successful completion of its second reusable hypersonic flight and recovery with the Talon-A2 (TA-2) vehicle in March 2025, following a first successful flight in December 2024. The TA-2 surpassed Mach 5 during both flights, exceeding the initial speed record. Data from these flights is being used to improve future Talon-A vehicles, with initial analysis confirming the design's robustness and ability to meet customer performance demands.\n\nThe flights, part of the Test Resource Management Center (TRMC) Multi-Service Advanced Capability Hypersonic Test Bed (MACH-TB) program in partnership with Leidos, aim to accelerate hypersonic system testing. The MACH-TB program is pleased with the success of the flights and is looking forward to continued testing with Stratolaunch. Stratolaunch is focused on expanding hypersonic flight testing and ensuring the long-term sustainability of reusable hypersonic testbeds.\n\nStratolaunch CEO Dr. Zachary Krevor highlighted the significance of the achievement, marking the United States' return to reusable hypersonic flight testing since the X-15 program. Director of the Department of Defense Test Resource Management Center George Rumford emphasized the importance of vehicle reuse for reducing turnaround time in hypersonic testing. Stratolaunch is dedicated to advancing high-speed technology through innovative aerospace vehicle design, manufacturing, and operation.\n",
    "chinese_title": "平流层发射公司成功完成可重复使用的高超音速飞行与回收",
    "chinese_summary": "平流层发射公司宣布于2025年3月成功完成Talon-A2 (TA-2)飞行器的第二次可重复使用高超音速飞行和回收，此前于2024年12月首次成功飞行。TA-2在两次飞行中均超过5马赫，打破了最初的速度记录。这些飞行的数据正被用于改进未来的Talon-A飞行器，初步分析证实了设计的稳健性以及满足客户性能需求的能力。\n\n这些飞行是测试资源管理中心（TRMC）多军种先进能力高超音速试验台（MACH-TB）项目的一部分，与Leidos合作，旨在加速高超音速系统测试。MACH-TB项目对飞行的成功感到满意，并期待与平流层发射公司继续进行测试。平流层发射公司专注于扩大高超音速飞行测试，并确保可重复使用高超音速试验台的长期可持续性。\n\n平流层发射公司首席执行官扎卡里·克雷沃博士强调了这一成就的意义，标志着自X-15项目以来，美国重返可重复使用高超音速飞行测试领域。国防部测试资源管理中心主任乔治·拉姆福德强调了飞行器重复使用对于缩短高超音速测试周转时间的重要性。平流层发射公司致力于通过创新的航空航天飞行器设计、制造和运营来推进高速技术。"
  },
  {
    "id": "43912618",
    "title": "Internet Roadtrip: Vote to steer",
    "url": "https://neal.fun/internet-roadtrip/",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "互联网公路旅行：投票决定方向",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "43927926",
    "title": "Void: Open-source Cursor alternative",
    "url": "https://github.com/voideditor/void",
    "summary": "Void is presented as an open-source alternative to the Cursor code editor. Key features include AI agent integration for codebase manipulation, checkpointing and visualization of changes, and the flexibility to use any model or host locally. Importantly, Void emphasizes data privacy by sending messages directly to providers without storing user data. The repository contains the complete source code for the editor. New users are encouraged to consult the Project Board and contribution guidelines for getting started. A weekly meeting is held on the Discord server. Void is based on the VS Code repository, and a guide to the codebase is available. Support is offered through the Discord server and via email.\n",
    "chinese_title": "Void：开源光标替代方案",
    "chinese_summary": "Void：Cursor代码编辑器的开源替代方案。主要特性包括：用于代码库操作的AI代理集成、变更的检查点和可视化，以及使用任何模型或本地托管的灵活性。重要的是，Void强调数据隐私，直接向提供商发送消息，而不存储用户数据。该存储库包含编辑器的完整源代码。鼓励新用户查阅项目看板和贡献指南以开始使用。每周在Discord服务器上举行会议。Void基于VS Code存储库，并提供代码库指南。通过Discord服务器和电子邮件提供支持。"
  },
  {
    "id": "43917278",
    "title": "Reverse Engineering \"DNA Sequences\" in the Lost World: Jurassic Park Video Game",
    "url": "https://32bits.substack.com/p/under-the-microscope-the-lost-world",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "失落的世界：侏罗纪公园游戏中“DNA序列”的逆向工程",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "43935067",
    "title": "Rust’s dependencies are starting to worry me",
    "url": "https://vincents.dev/blog/rust-dependencies-scare-me/?",
    "summary": "The author, a Rust enthusiast, expresses concern about the extensive dependencies Rust projects often require, despite appreciating the convenience of Cargo. The ease of adding crates can lead to reliance on unmaintained or unnecessary packages, as illustrated by the `dotenv` crate.\n\nWhile acknowledging the benefits of robust libraries like Tokio, the author was shocked to find their seemingly trivial webserver project pulled in over 3.6 million lines of Rust code from dependencies. This raises concerns about auditability and security, especially considering the size compared to the Linux kernel.\n\nThe author explores the tradeoff between Rust's modularity and the potential bloat from dependencies. While adding more to the standard library like Go might mitigate the issue, it could compromise Rust's suitability for embedded systems and increase the maintenance burden on the Rust team.\n\nThey highlight the lack of tools to determine which lines of dependency code are actually compiled into the final binary, making it difficult to optimize and reduce the footprint. The author questions how large companies like Cloudflare handle auditing their massive dependency trees and seeks solutions from the community to address the challenges posed by Rust's dependency management. They end with a lighthearted job application.\n",
    "chinese_title": "Rust的依赖项开始让我担忧了",
    "chinese_summary": "一位Rust爱好者对Rust项目经常需要大量的依赖表示担忧，尽管他很欣赏Cargo的便利性。 轻松添加crate的方式可能导致对未维护或不必要的软件包的依赖，如`dotenv` crate所示。\n\n虽然承认像Tokio这样强大的库的好处，但作者震惊地发现，他们看似微不足道的Web服务器项目从依赖项中引入了超过360万行的Rust代码。 这引起了对可审计性和安全性的担忧，特别是考虑到它的大小与Linux内核相比。\n\n作者探讨了Rust的模块化和依赖带来的潜在膨胀之间的权衡。 虽然像Go一样向标准库添加更多内容可能会缓解这个问题，但这可能会损害Rust对嵌入式系统的适用性，并增加Rust团队的维护负担。\n\n他们强调缺乏工具来确定哪些依赖代码行实际被编译到最终的二进制文件中，这使得优化和减少占用空间变得困难。 作者质疑像Cloudflare这样的大公司如何处理对其庞大的依赖树的审计，并寻求社区的解决方案来解决Rust的依赖管理带来的挑战。 最后，他们以轻松的求职信结尾。"
  },
  {
    "id": "43909179",
    "title": "\"Night of the Living Dead\" accidentally became public domain (2019)",
    "url": "https://screenrant.com/night-living-dead-movie-public-domain-copyright-accident/",
    "summary": "George Romero's \"Night of the Living Dead,\" a groundbreaking horror film that established the modern zombie archetype, inadvertently entered the public domain due to a critical error by its distributor. After changing the film's title from \"Night of the Flesh Eaters,\" the distributor failed to include the required copyright notice on the new prints.\n\nThis oversight meant anyone could freely copy, distribute, and release the film, leading to countless home video editions without Romero or his collaborators receiving royalties. While \"Night of the Living Dead\" earned over $30 million at the box office, Romero saw little of this profit, and the public domain status deprived him of potential earnings from home video sales.\n\nDespite the financial setback, the film's public domain status arguably contributed to its enduring legacy. The ease of access, through frequent TV airings and readily available copies, allowed the film to reach a wider audience and solidify its place as a horror classic. The article highlights the irony of the situation: Romero suffered financially, but the film's accessibility ensured its cultural impact.\n",
    "chinese_title": "《活死人之夜》意外进入公有领域 (2019)",
    "chinese_summary": "由于发行商的一个重大失误，乔治·罗梅罗的开创性恐怖片《活死人之夜》——它确立了现代僵尸原型——意外地进入了公共领域。在将影片的标题从《食肉之夜》改为《活死人之夜》后，发行商未能在新的拷贝上添加必需的版权声明。\n\n这一疏忽意味着任何人都可以自由复制、发行和发布这部电影，导致无数家庭录像带版本出现，而罗梅罗或他的合作者没有收到版税。《活死人之夜》票房收入超过3000万美元，但罗梅罗却几乎没有从中获利，而公共领域地位剥夺了他从家庭录像带销售中获得潜在收益的机会。\n\n尽管遭遇了经济挫折，但这部电影的公共领域地位可以说促进了其持久的遗产。通过频繁的电视播出和容易获得的拷贝，这种易于获得的特性让这部电影接触到了更广泛的观众，并巩固了其作为恐怖经典的地位。这篇文章强调了这种情况的讽刺意味：罗梅罗在经济上遭受了损失，但这部电影的可访问性确保了它的文化影响力。"
  },
  {
    "id": "43947121",
    "title": "How Bail Bonds Work",
    "url": "https://finbarr.site/2025/05/10/how-bail-bonds-work.html",
    "summary": "This article details the mechanics and economics of the U.S. bail bonds industry, highlighting its predatory nature and inherent inequalities. Cash bail, a system where defendants pay to be released before trial, disproportionately affects the poor who cannot afford it. Bail bondsmen step in, posting surety bonds in exchange for a non-refundable premium, typically 10% of the bail amount.\n\nThe industry involves three parties: the defendant, the bail bondsman, and a surety company (insurance). Bail bondsmen remit a portion of the premium to the surety company, which uses a \"Build Up Fund\" (BUF) to cover forfeitures (when defendants fail to appear - FTA). Laws vary by state, granting bondsmen time to recover FTAs and legal avenues to avoid forfeitures.\n\nBail bonds companies compete on down payment amounts, acting as debt collectors, aggressively pursuing payments and selling debt to third parties. Customer acquisition relies on jail lists, family/friend referrals, and criminal defense lawyer connections.\n\nThe current system underscores inequalities. 60% of the jail population is pre-trial because they can't afford bail. Judges, while setting bail, are often constrained, sometimes setting high bail amounts, effectively denying release. Pretrial Services (PTS), an alternative at the federal level, uses risk assessment and supervision instead of financial guarantees.\n",
    "chinese_title": "保释金运作方式",
    "chinese_summary": "本文详细介绍了美国保释金行业的运作机制和经济模式，突出了其掠夺性本质和固有的不平等现象。现金保释是一种被告在审判前支付费用以获得释放的制度，它对无力支付的穷人造成了不成比例的影响。保释金代理人介入其中，以不可退还的保费（通常为保释金额的 10%）换取担保债券。\n\n该行业涉及三方：被告、保释金代理人和担保公司（保险公司）。保释金代理人将一部分保费汇给担保公司，该公司使用“累积基金”（BUF）来支付没收的款项（当被告未出庭时）。各州法律各不相同，赋予保释金代理人时间来追回未出庭者，以及避免没收的法律途径。\n\n保释金公司在首付金额上展开竞争，充当收债人，积极追讨付款并将债务出售给第三方。客户获取依赖于监狱名单、家人/朋友推荐和刑事辩护律师关系。\n\n当前的制度突显了不平等。60%的监狱人口是审前拘留，因为他们无力支付保释金。法官在设定保释金时，往往受到限制，有时会设定高额保释金，实际上剥夺了释放。审前服务（PTS）是联邦层面的一种替代方案，它使用风险评估和监督，而不是财务担保。"
  }
]