[
  {
    "id": "46045972",
    "title": "Apt Rust requirement raises questions",
    "url": "https://lwn.net/SubscriberLink/1046841/5bbf1fc049a18947/",
    "summary": "This LWN.net article discusses the controversy surrounding Debian's APT (Advanced Package Tool) potentially requiring Rust in May 2026. Julian Andres Klode, an APT maintainer, announced this plan, citing memory safety and improved unit testing as benefits for rewriting parts of APT (specifically .deb, .ar, .tar parsing and HTTP signature verification) in Rust.\n\nThis decision has sparked debate due to its impact on Debian ports that lack a Rust toolchain, potentially forcing them to either acquire one, sunset the port, or stick with older APT versions. While some developers welcome the move towards modern technologies like Rust, others criticize Klode's communication style and the lack of prior discussion.\n\nKey concerns raised include: the burden on volunteer maintainers to support Rust, the impact on Debian's infrastructure due to the static linking nature of Rust packages leading to potential security support limitations, and the existing challenges Debian faces in managing Rust dependencies and tracking CVEs.\n\nDavid Kalnischkies suggested removing the problematic code from APT altogether, as it's primarily used by Canonical's Launchpad software. Some fear this change goes against Debian's values of supporting diverse hardware and democratic governance, as it's a decision driven by a single developer without adequate community input.\n\nDiscussions also touched on potential solutions such as forking APT, creating a Rust-to-C converter, or contributing to existing Rust compilers. The debate also extended to the larger issue of static vs shared libraries, with some advocating for rebuilding packages with dependency updates, while others prefer shared libraries for easier maintenance.\n",
    "chinese_title": "Apt Rust 需求引发质疑",
    "chinese_summary": "LWN.net文章探讨Debian的APT可能于2026年要求使用Rust引发的争议。APT维护者Julian Andres Klode宣布了这项计划，理由是使用Rust重写APT的部分（特别是.deb、.ar、.tar解析和HTTP签名验证）可以带来内存安全和改进的单元测试。\n\n此决定引发了争论，因为它会影响缺乏Rust工具链的Debian移植版本，可能迫使它们获取工具链、放弃移植或继续使用旧版APT。虽然一些开发者欢迎转向Rust等现代技术，但另一些开发者批评Klode的沟通方式以及缺乏事先讨论。\n\n提出的主要问题包括：志愿者维护者支持Rust的负担、Rust软件包的静态链接特性对Debian基础设施的影响，导致潜在的安全支持限制，以及Debian在管理Rust依赖项和跟踪CVE方面面临的现有挑战。\n\nDavid Kalnischkies建议完全从APT中删除有问题的代码，因为它主要由Canonical的Launchpad软件使用。有些人担心此更改违背了Debian支持多样化硬件和民主治理的价值观，因为这是一个由单个开发者推动的，缺乏足够的社区投入的决定。\n\n讨论还涉及潜在的解决方案，例如Fork APT、创建Rust到C的转换器或为现有的Rust编译器做出贡献。 争论还扩展到静态库与共享库的更大问题，一些人主张使用依赖项更新重建软件包，而另一些人则更喜欢使用共享库以便于维护。"
  },
  {
    "id": "46046916",
    "title": "FLUX.2: Frontier Visual Intelligence",
    "url": "https://bfl.ai/blog/flux-2",
    "summary": "FLUX.2, Black Forest Labs' latest visual intelligence model, is designed for real-world creative workflows, offering high-quality image generation with consistency across multiple references, structured prompt adherence, and advanced text handling. It edits images up to 4 megapixels while preserving detail.\n\nBlack Forest Labs emphasizes open innovation, combining open models like FLUX.1 (popular open image model) with professional-grade models like FLUX.1 Kontext. The open core approach aims to drive experimentation, scrutiny, and lower costs.\n\nFLUX.2 offers significant improvements over FLUX.1, including multi-reference support (up to 10 images), improved image detail and photorealism, reliable text rendering, enhanced prompt following, improved world knowledge, and higher resolution output.\n\nThe FLUX.2 family includes FLUX.2 [pro] (state-of-the-art quality), FLUX.2 [flex] (full parameter control), FLUX.2 [dev] (32B open-weight model), and FLUX.2 [klein] (open-source model coming soon). A new variational autoencoder (VAE) underpins all FLUX.2 models, optimizing learnability, quality, and compression.\n\nFLUX.2 utilizes a latent flow matching architecture, combining a vision-language model with a rectified flow transformer. This enables multi-reference support, higher resolution, better prompt adherence, and improved typography.\n\nBlack Forest Labs is committed to the responsible development of these models and seeks to build foundational infrastructure for visual intelligence, aiming for multimodal models unifying perception, generation, memory, and reasoning.\n",
    "chinese_title": "FLUX.2：前沿视觉智能",
    "chinese_summary": "FLUX.2：Black Forest Labs最新视觉智能模型，专为真实创意工作流程设计，提供高质量图像生成，具备跨多重参考一致性、结构化提示遵循和高级文本处理能力。它能在保留细节的同时编辑高达 4 百万像素的图像。\n\nBlack Forest Labs强调开放式创新，将FLUX.1（流行的开放图像模型）等开放模型与FLUX.1 Kontext等专业级模型相结合。这种开放核心方法旨在推动实验、审查并降低成本。\n\nFLUX.2相比FLUX.1有显著改进，包括多重参考支持（最多10张图像）、图像细节和照片级真实感提升、可靠的文本渲染、增强的提示遵循、改进的世界知识和更高的分辨率输出。\n\nFLUX.2系列包括FLUX.2 [pro]（最先进的质量）、FLUX.2 [flex]（完全参数控制）、FLUX.2 [dev]（32B开放权重模型）和FLUX.2 [klein]（即将推出的开源模型）。一种新的变分自编码器(VAE)为所有FLUX.2模型提供支持，优化可学习性、质量和压缩。\n\nFLUX.2采用潜在流匹配架构，将视觉-语言模型与修正流Transformer相结合。这实现了多重参考支持、更高分辨率、更好的提示遵循和改进的排版。\n\nBlack Forest Labs致力于这些模型的负责任开发，并寻求构建视觉智能的基础设施，目标是实现统一感知、生成、记忆和推理的多模态模型。"
  },
  {
    "id": "46003271",
    "title": "The 101 of Analog Signal Filtering",
    "url": "https://lcamtuf.substack.com/p/the-101-of-analog-signal-filtering",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "模拟信号滤波入门",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "45981514",
    "title": "Meta Segment Anything Model 3",
    "url": "https://ai.meta.com/blog/segment-anything-model-3/?_fb_noscript=1",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "Meta 分割一切模型 3",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "46042928",
    "title": "Human brains are preconfigured with instructions for understanding the world",
    "url": "https://news.ucsc.edu/2025/11/sharf-preconfigured-brain/",
    "summary": "UC Santa Cruz researchers have discovered that the human brain possesses preconfigured activity patterns even before sensory experiences occur, suggesting an inherent \"operating system\" guiding interaction with the world. They used brain organoids, 3D models of human brain tissue grown from stem cells, to study the earliest moments of electrical activity. The study, published in *Nature Neuroscience*, revealed that these early brain firings occur in structured patterns without external stimuli.\n\nThis research allows scientists to study human brain development ethically, which is normally protected inside the womb. By observing the organoids, the team found that the cells spontaneously emit electrical signals similar to the brain's \"default mode,\" a basic underlying structure for firing neurons. These patterns, emerging in the first few months of development, have the potential to be refined for specific senses.\n\nThese findings have significant implications for understanding neurodevelopmental disorders and the impact of toxins on the developing brain. Identifying and studying these early patterns in organoids could pave the way for developing preclinical therapies, including drug therapies and gene editing tools, for brain disorders. The study highlights the potential of organoids to revolutionize our understanding of human brain development and its vulnerabilities.\n",
    "chinese_title": "人类大脑预先配置了理解世界的指令。",
    "chinese_summary": "加州大学圣克鲁兹分校的研究人员发现，人脑在感官体验发生之前就已具备预先配置的活动模式，表明存在一种内在的“操作系统”指导着与世界的互动。他们利用脑类器官（由干细胞生长而成的三维人脑组织模型）来研究最早的电活动时刻。这项发表在《自然·神经科学》上的研究表明，这些早期的脑电活动是在没有外部刺激的情况下以结构化模式发生的。\n\n这项研究使科学家们能够在伦理的框架下研究人脑发育，而这通常是在子宫内受到保护的。通过观察类器官，该团队发现细胞自发地发出类似于大脑“默认模式”的电信号，这是一种神经元放电的基本底层结构。这些模式出现在发育的最初几个月，有可能被优化用于特定的感觉。\n\n这些发现对于理解神经发育障碍以及毒素对发育中的大脑的影响具有重大意义。识别和研究类器官中的这些早期模式可以为开发脑部疾病的临床前疗法铺平道路，包括药物疗法和基因编辑工具。这项研究突显了类器官在彻底改变我们对人脑发育及其脆弱性的理解方面的潜力。"
  },
  {
    "id": "46037626",
    "title": "Pebble Watch software is now open source",
    "url": "https://ericmigi.com/blog/pebble-watch-software-is-now-100percent-open-source",
    "summary": "This article announces that Pebble watch software is now 100% open source, addressing concerns about the long-term sustainability of the platform. The author, who relaunched Pebble under Core Devices, highlights the importance of both hardware and software longevity.\n\nOn the hardware side, Core Devices is self-funded and aims to manufacture repairable watches, like the Pebble Time 2 with its replaceable battery and publicly available schematics for the Pebble 2 Duo.\n\nThe key development is the complete open-sourcing of Pebble software, including PebbleOS and the mobile companion app. This ensures the community can maintain and improve the software even if Core Devices ceases to exist. The article details how the new mobile app, built with Kotlin Multiplatform, is now open source.\n\nThe Pebble Appstore is also being decentralized. The mobile app will support multiple appstore \"feeds,\" allowing anyone to create and host a Pebble app repository. Core Devices has launched its own feed, backing up apps to Archive.org. Developers can still monetize their apps.\n\nFinally, the article provides an update on the Pebble Time 2, aiming to begin shipping in January with most arriving in March/April, acknowledging potential delays due to Chinese New Year. A video demo of pre-production PT2 watches is also available. Pre-order customers will soon be able to select their preferred color.\n",
    "chinese_title": "Pebble手表软件现在开源",
    "chinese_summary": "本文宣布Pebble手表软件现已100%开源，旨在解决对该平台长期可持续性的担忧。在Core Devices旗下重启Pebble的作者强调了硬件和软件长期维护的重要性。\n\n在硬件方面，Core Devices自筹资金，致力于制造可修复的手表，如Pebble Time 2，其电池可更换，且Pebble 2 Duo的原理图已公开。\n\n关键进展是Pebble软件的完全开源，包括PebbleOS和移动配套应用程序。这确保了即使Core Devices不复存在，社区也能维护和改进该软件。文章详细介绍了使用Kotlin Multiplatform构建的新移动应用程序现在是开源的。\n\nPebble Appstore也在去中心化。该移动应用程序将支持多个应用商店“源”，允许任何人创建和托管Pebble应用程序库。Core Devices已推出自己的源，将应用程序备份到Archive.org。开发者仍然可以将其应用程序货币化。\n\n最后，本文提供了有关Pebble Time 2的最新信息，目标是在一月份开始发货，大部分预计在三月/四月送达，并承认可能因中国新年而延迟。还提供了一个预生产PT2手表的视频演示。预购客户很快就可以选择自己喜欢的颜色。"
  },
  {
    "id": "46045039",
    "title": "Making Crash Bandicoot (2011)",
    "url": "https://all-things-andy-gavin.com/video-games/making-crash/",
    "summary": "This short article excerpt from February 2011 marks the beginning of a series about the making of Crash Bandicoot. The author, one half of Naughty Dog, Inc., reflects on the company's status in the summer of 1994. At that time, Naughty Dog was a small, two-person operation consisting of the author and his partner, Jason Rubin. They had successfully published six games over the previous eight years, working as a highly efficient duo. However, the article suggests that in 1994, the decision was made to expand the company beyond its original size, hinting at the upcoming development of what would become Crash Bandicoot. The \"Read More\" link indicates that the subsequent articles will delve deeper into the process of expanding the company and the early stages of developing the iconic platformer.\n",
    "chinese_title": "古惑狼制作秘辛 (2011)",
    "chinese_summary": "这篇2011年2月的文章节选标志着“古惑狼”制作系列文章的开始。作者，顽皮狗公司创始人之一，回顾了公司1994年夏天的状况。当时，顽皮狗还是一个由作者和他搭档杰森·鲁宾组成的两人小团队。在过去的八年里，他们高效合作，成功发行了六款游戏。然而，文章暗示，1994年他们决定扩大公司规模，预示着即将开始开发后来的“古惑狼”。“阅读更多”链接表明后续文章将更深入地探讨公司扩张的过程以及这款标志性平台游戏开发的早期阶段。"
  },
  {
    "id": "46045085",
    "title": "Trillions Spent and Big Software Projects Are Still Failing",
    "url": "https://spectrum.ieee.org/it-management-software-failures",
    "summary": "This article, \"Trillions Spent and Big Software Projects Are Still Failing,\" highlights the persistent issue of software project failures despite massive global IT spending. The author argues that failures are widespread across various sectors and countries, and the situation hasn't improved significantly over the past two decades. The promise of AI solving these issues is dismissed, citing the complexities of managing large-scale projects and the human element involved.\n\nThe article attributes failures to recurring issues like failures of imagination, unrealistic goals, inability to handle complexity, and unmanaged risks. It presents case studies like the Canadian government's Phoenix payroll system, the U.K. Post Office's Horizon system, and the Minnesota Licensing and Registration System (MNLARS) as prime examples of costly and damaging failures. These cases illustrate a pattern of technical, managerial, organizational, legal, and ethical shortcomings.\n\nThe rising cost of software failures is emphasized, with US operational software failures alone estimated at $1.81 trillion in 2022. Despite attempts to improve processes through Agile and DevOps, the article suggests that the lack of organizational discipline and commitment to proven practices hinders success. The author concludes by questioning why basic IT project management mistakes continue to occur, given the extensive history of failures and the increasing reliance on reliable software. The article argues that the IT community often fails to learn from past mistakes, leading to repeated and expensive failures, making it an existential threat to modern society.\n",
    "chinese_title": "数万亿美元投入，大型软件项目依然失败",
    "chinese_summary": "万亿投入，大型软件项目仍频频失败"
  },
  {
    "id": "46047513",
    "title": "Ozempic does not slow Alzheimer's, study finds",
    "url": "https://www.semafor.com/article/11/25/2025/ozempic-does-not-slow-alzheimers-study-finds",
    "summary": "A two-year study by Novo Nordisk has revealed that Ozempic, a popular weight-loss drug, does not slow the progression of Alzheimer's disease. While early data suggested potential benefits for brain conditions, along with other ailments like cancer and heart disease, this new study contradicts those initial hopes.\n\nThe article highlights that researchers had questioned whether any observed positive effects were directly attributable to the drug or simply a consequence of weight loss and increased health consciousness in Ozempic users.\n\nThis latest finding is part of a trend of tempering earlier, more enthusiastic claims about Ozempic's broader benefits, as it also failed to demonstrate a slowing of neurodegeneration in Parkinson's patients. However, the drug's positive impact on cardiovascular and kidney problems appears to be more consistent and reliable.\n\nFollowing the announcement of the Alzheimer's study results, Novo Nordisk's shares experienced a 6% decline.\n",
    "chinese_title": "研究发现，Ozempic无法延缓阿尔茨海默症。",
    "chinese_summary": "诺和诺德研究显示Ozempic不延缓阿尔茨海默病进展"
  },
  {
    "id": "46042946",
    "title": "Most Stable Raspberry Pi? Better NTP with Thermal Management",
    "url": "https://austinsnerdythings.com/2025/11/24/worlds-most-stable-raspberry-pi-81-better-ntp-with-thermal-management/",
    "summary": "This article details how to improve the stability of a Raspberry Pi-based NTP server for precise timekeeping by addressing thermal-induced timing jitter. The author noticed frequency drift in the NTP server correlated with CPU temperature changes, despite a stable GPS PPS reference. The core issue: CPU frequency scaling and temperature-dependent crystal oscillator frequency.\n\nThe solution involves two main components: CPU core pinning and thermal stabilization. CPU core pinning dedicates CPU 0 to timing-critical tasks (chronyd and PPS interrupts) using a boot optimization script that sets the CPU governor to \"performance,\" pins the PPS interrupt and chronyd to CPU 0, sets chronyd to real-time priority, and boosts the priority of the kernel softirq handler.\n\nThermal stabilization maintains a constant CPU temperature using a PID-controlled \"time burner.\" This Python script reads the CPU temperature, calculates the necessary CPU load to maintain a target temperature (54°C), and distributes the load across CPUs 1-3 using worker processes that alternate between busy-loop hashing and sleeping. By maintaining a stable CPU temperature, the thermal environment of the physically close crystal oscillator is stabilized, leading to consistent clock frequency and improved timekeeping.\n\nThe results showed a significant improvement in frequency stability, with a nearly 50% reduction in mean RMS offset and a 52.7% reduction in median RMS offset. The article provides detailed setup instructions for replicating the optimization, including scripts for boot optimization and thermal stabilization, as well as systemd service configurations. The author emphasizes that maintaining consistent silicon temperature is more important for frequency stability than ambient air temperature changes.\n",
    "chinese_title": "最稳定的树莓派？更好的NTP与散热管理",
    "chinese_summary": "本文详细介绍了如何通过解决热致时序抖动来提高基于树莓派的NTP服务器的稳定性，以实现精确计时。作者注意到，尽管有稳定的GPS PPS参考，NTP服务器中的频率漂移与CPU温度变化相关。核心问题：CPU频率调整和温度相关的晶体振荡器频率。\n\n解决方案包括两个主要组成部分：CPU核心绑定和热稳定。CPU核心绑定将CPU 0专用于时间关键型任务（chronyd和PPS中断），通过启动优化脚本将CPU调控器设置为“性能”模式，将PPS中断和chronyd绑定到CPU 0，将chronyd设置为实时优先级，并提高内核softirq处理程序的优先级。\n\n热稳定使用PID控制的“时间燃烧器”来维持恒定的CPU温度。这个Python脚本读取CPU温度，计算维持目标温度（54°C）所需的CPU负载，并使用worker进程将负载分配到CPU 1-3上，这些进程在忙循环哈希和睡眠之间交替。通过维持稳定的CPU温度，物理上接近的晶体振荡器的热环境得到稳定，从而实现一致的时钟频率并改善计时。\n\n结果表明，频率稳定性得到了显著改善，平均RMS偏移降低了近50%，中位数RMS偏移降低了52.7%。本文提供了复制优化的详细设置说明，包括启动优化和热稳定的脚本，以及systemd服务配置。作者强调，对于频率稳定性而言，保持硅温度一致比环境空气温度变化更重要。"
  },
  {
    "id": "46047350",
    "title": "Orion 1.0 – Browse Beyond",
    "url": "https://blog.kagi.com/orion",
    "summary": "Orion 1.0, a privacy-focused browser from Kagi, has officially launched for macOS, leaving its beta phase. It joins the iOS and iPadOS apps, expanding the \"Kagiverse\" alongside their Search, Assistant, Translate, and News products. Orion aims to provide an alternative to ad-funded browsers by prioritizing user privacy and control with zero telemetry.\n\nBuilt on WebKit, the open-source engine behind Safari, Orion distinguishes itself from the Chromium monoculture. It emphasizes speed, achieved through a lean codebase and optimized performance, and built-in privacy protections like content blocking. While embracing the potential of AI, Orion avoids integrating insecure, always-on AI agents directly into the browser core, preferring a clear separation between the browser and external AI tools.\n\nUnique features include Focus Mode, Link Preview, Mini Toolbar, Overflow Menu, Page Tweak, and Profiles as Apps.\n\nDeveloped by a small team of six, Orion is free to use. Sustainability is achieved through user contributions via a Tip Jar, Supporter Subscriptions ($5/month or $50/year), and Lifetime Access ($150). Supporters unlock perks like Floating windows, Customization, and early access to new features.\n\nOrion aims to be available across platforms, with versions for macOS, iOS/iPadOS, Linux (Alpha), and Windows (in development). The roadmap includes deeper customization, performance improvements, new Orion+ features, and tighter integrations with Kagi's AI tools.\n",
    "chinese_title": "Orion 1.0 – 浏览无限",
    "chinese_summary": "Orion 1.0 正式发布 macOS 版，告别测试阶段。这款由 Kagi 出品的注重隐私的浏览器，与 iOS 和 iPadOS 应用一起，扩展了“Kagi 生态”，以及他们的搜索、助手、翻译和新闻产品。Orion 旨在通过零遥测、优先考虑用户隐私和控制，来提供广告驱动型浏览器的替代方案。\n\nOrion 基于 Safari 背后的开源引擎 WebKit 构建，区别于 Chromium 的单一文化。它强调速度，这得益于精简的代码库和优化的性能，以及内置的隐私保护，如内容拦截。在拥抱人工智能潜力的同时，Orion 避免将不安全的、始终在线的 AI 代理直接集成到浏览器核心中，而是倾向于浏览器和外部 AI 工具之间的明确分离。\n\n独特的功能包括专注模式、链接预览、迷你工具栏、溢出菜单、页面调整和作为应用程序的配置文件。\n\nOrion 由一个六人小团队开发，可以免费使用。其可持续性通过用户的捐赠罐、支持者订阅（每月 5 美元或每年 50 美元）和终身访问权（150 美元）来实现。支持者可以解锁浮动窗口、自定义和抢先体验新功能等福利。\n\nOrion 旨在跨平台可用，目前有 macOS、iOS/iPadOS、Linux (Alpha) 和 Windows（开发中）版本。路线图包括更深层次的定制、性能改进、新的 Orion+ 功能以及与 Kagi 的 AI 工具更紧密的集成。"
  },
  {
    "id": "46038099",
    "title": "Unpowered SSDs slowly lose data",
    "url": "https://www.xda-developers.com/your-unpowered-ssd-is-slowly-losing-your-data/",
    "summary": "This article addresses the issue of data loss in unpowered SSDs over extended periods, highlighting that SSDs aren't ideal for long-term cold storage. Unlike hard drives that magnetically store data, SSDs rely on electrical charges in NAND flash cells, which can dissipate over time, especially when unpowered.\n\nThe data retention period varies depending on the type of NAND flash used: QLC NAND can safely store data for about a year, TLC NAND for up to 3 years, and MLC/SLC NAND for 5-10 years. Since most consumer SSDs use TLC or QLC NAND, leaving them unpowered for over a year poses a risk of data corruption or loss. Factors like temperature and NAND flash quality can accelerate voltage loss.\n\nHowever, the author emphasizes this is primarily a concern for enterprise, enthusiast, and solopreneur use cases involving archival storage. For typical PC usage, with SSDs powered on regularly, the risk is minimal. The article also mentions that SSDs have limited write cycles that eventually bring them to the end of their lifecycle.\n\nThe key takeaway is the importance of data backups. The 3-2-1 backup rule (3 copies of data on 2 different media, with 1 off-site) is recommended to safeguard against data loss from any type of storage failure, including SSDs losing data due to prolonged unpowered storage. While SSDs are suitable for primary storage, relying on them for unpowered long-term archival purposes without backup is risky.\n",
    "chinese_title": "未供电的固态硬盘会缓慢丢失数据",
    "chinese_summary": "本文探讨了断电状态下固态硬盘长期存储数据丢失的问题，强调固态硬盘并非长期冷存储的理想选择。与磁性存储数据的硬盘不同，固态硬盘依赖于NAND闪存单元中的电荷，这些电荷会随着时间推移而消散，尤其是在断电情况下。\n\n数据保持期因使用的NAND闪存类型而异：QLC NAND可安全存储数据约一年，TLC NAND可存储长达三年，而MLC/SLC NAND可存储五年到十年。由于大多数消费级固态硬盘使用TLC或QLC NAND，因此断电一年以上可能会导致数据损坏或丢失。温度和NAND闪存质量等因素会加速电压损耗。\n\n然而，作者强调，这主要针对涉及档案存储的企业、发烧友和个体经营者的用例。对于典型的PC使用，由于固态硬盘经常通电，因此风险很小。文章还提到，固态硬盘的写入周期有限，最终会使其达到生命周期终点。\n\n关键要点是数据备份的重要性。建议采用3-2-1备份规则（3份数据保存在2种不同的介质上，其中1份异地备份）以防止因任何类型的存储故障（包括固态硬盘因长期断电存储而丢失数据）造成的数据丢失。虽然固态硬盘适用于主存储，但在没有备份的情况下，依赖它们进行断电长期存档是很危险的。"
  },
  {
    "id": "46045661",
    "title": "Brain has five 'eras' with adult mode not starting until early 30s",
    "url": "https://www.theguardian.com/science/2025/nov/25/brain-human-cognitive-development-life-stages-cambridge-study",
    "summary": "This study identifies five distinct \"eras\" in human brain development, marked by four key \"turning points\" at ages nine, 32, 66, and 83. Researchers analyzed brain scans from nearly 4,000 individuals, mapping neural connections and their evolution from infancy to old age.\n\nThe first era, from birth to age nine, is characterized by \"network consolidation,\" where synapse connections are pruned, brain wiring efficiency decreases, and grey and white matter volume rapidly increases. Adolescence, the second era lasting until approximately age 32, witnesses continued white matter growth and increased efficiency in brain connections, linked to improved cognitive function.\n\nThe most significant shift occurs around age 32, initiating \"adult mode,\" a phase of relative brain stability. Brain regions become more compartmentalized, aligning with observed plateaus in intelligence and personality. While life events like parenthood may contribute, the research didn't directly investigate this.\n\nThe final two turning points, at ages 66 and 83, mark the beginning of \"early aging\" and \"late aging\" phases, respectively. These eras are defined by decreased brain connectivity potentially related to aging and white matter degeneration. The findings offer insights into brain development vulnerabilities and potential risk factors for mental health disorders, particularly during adolescence.\n",
    "chinese_title": "大脑有五个“时期”，成人模式要到30岁出头才开始。",
    "chinese_summary": "这项研究确定了人类大脑发育的五个不同“阶段”，并以9岁、32岁、66岁和83岁四个关键“转折点”为标志。研究人员分析了近4000名个体的大脑扫描图像，绘制了从婴儿期到老年期的神经连接及其演变过程。\n\n第一个阶段，从出生到9岁，其特征是“网络整合”，突触连接被修剪，大脑布线效率降低，灰质和白质体积迅速增加。青春期，即持续到大约32岁的第二个阶段，见证了白质的持续增长和大脑连接效率的提高，这与认知功能的改善有关。\n\n最重要的转变发生在32岁左右，启动了“成人模式”，这是一个大脑相对稳定的阶段。大脑区域变得更加分隔，与观察到的智力和人格的平稳期相一致。虽然诸如为人父母等生活事件可能有所贡献，但该研究并未对此进行直接调查。\n\n最后两个转折点，分别在66岁和83岁，标志着“早期衰老”和“晚期衰老”阶段的开始。这些阶段的特点是大脑连接性降低，这可能与衰老和白质退化有关。该研究结果为大脑发育的脆弱性以及精神健康障碍的潜在风险因素提供了见解，尤其是在青春期。"
  },
  {
    "id": "46003606",
    "title": "Nearby peer discovery without GPS using environmental fingerprints",
    "url": "https://www.svendewaerhert.com/blog/nearby-peer-discovery/",
    "summary": "This article introduces Shimmer, a system for discovering nearby peers without GPS by using environmental fingerprints. It leverages the idea that devices in the same area likely observe the same set of environmental signals (e.g., WiFi networks, Bluetooth beacons).\n\nShimmer works by creating cryptographic fingerprints of these environmental observations using MinHash and Locality-Sensitive Hashing (LSH). MinHash generates a compact signature for each device's observed environment, while LSH creates \"collision buckets\" where similar signatures are likely to hash to the same value (publicTags). Devices then encrypt their peer information using preImages as keys and announce them to a rendezvous server using the publicTags as indexes. Other peers observing a similar environment can generate matching publicTags, allowing them to discover and decrypt the peer information.\n\nThe author outlines potential use cases like location-based multiplayer gaming and conference networking. Shimmer offers features like Private Set Intersection (PSI) for precise similarity scores, support for multiple modalities of data (WiFi, Bluetooth, shared interests), epoch-based expiry of sketches, and various rendezvous options.\n\nThe article also discusses security considerations, including the potential for spoofing environmental observations and the risk of the rendezvous server learning about IP proximity. Potential mitigations are proposed, such as using Tor, Oblivious HTTP (OHTTP), or a DHT for rendezvous. The author emphasizes that the suitability of Shimmer depends on the specific threat model. He built Shimmer as an interesting problem and considers trade-offs like server proximity and Android location permission requirements.\n",
    "chinese_title": "利用环境指纹实现无需GPS的附近设备发现",
    "chinese_summary": "本文介绍 Shimmer，一个利用环境指纹在没有 GPS 的情况下发现附近对等设备的系统。它利用了这样一个理念：同一区域内的设备很可能观察到同一组环境信号（例如，WiFi 网络、蓝牙信标）。\n\nShimmer 通过使用 MinHash 和局部敏感哈希 (LSH) 创建这些环境观察的密码学指纹来工作。 MinHash 为每个设备观察到的环境生成紧凑的签名，而 LSH 创建“碰撞桶”，其中相似的签名很可能散列到相同的值 (publicTags)。然后，设备使用 preImages 作为密钥加密其对等信息，并使用 publicTags 作为索引将其发布到会合服务器。观察到类似环境的其他对等设备可以生成匹配的 publicTags，从而允许他们发现和解密对等信息。\n\n作者概述了潜在的用例，例如基于位置的多人游戏和会议网络。 Shimmer 提供了诸如私有集合交集 (PSI) 以获得精确的相似性评分、对多种数据模式（WiFi、蓝牙、共同兴趣）的支持、基于 epoch 的草图过期以及各种会合选项等功能。\n\n本文还讨论了安全方面的考虑，包括欺骗环境观察的潜在可能性以及会合服务器了解 IP 邻近性的风险。 提出了潜在的缓解措施，例如使用 Tor、Oblivious HTTP (OHTTP) 或 DHT 进行会合。 作者强调，Shimmer 的适用性取决于具体的威胁模型。 他将 Shimmer 构建为一个有趣的问题，并考虑了服务器邻近性和 Android 位置权限要求等权衡因素。"
  },
  {
    "id": "45982875",
    "title": "Broccoli Man, Remastered",
    "url": "https://mbleigh.dev/posts/broccoli-man-remastered/",
    "summary": "This article details the author's experience recreating Google's \"Broccoli Man\" video using AI tools. Fifteen years after the original, the author spent a Saturday using Veo 3.1 and Nano Banana to create a remastered 4-minute short film.\n\nThe process involved:\n*   **Preproduction:** Script preparation using AI Studio to break down the original video into scenes and brainstorming prompts. Character \"ingredients\" (Broccoli Man and Red Panda) were converted to photorealistic versions and backgrounds removed using Magic Markup (Nano Banana).\n*   **Production:** Video generation using Vertex AI Studio and Veo 3.1 with \"Ingredients to Scene.\" The process was iterative, with the author generating multiple samples per scene and tweaking prompts. Character consistency was surprisingly good, and audio sync was often achievable. Challenges included the rigid 8-second clip duration, recreating static conversation scenes, camera control, and achieving desired character emotes.\n*   **Postproduction:** Using CapCut for editing, including trimming scenes, interleaving takes, manipulating audio, and dialogue volume normalization. The author emphasizes the necessity of non-linear video editing for this type of project.\n\nThe author concludes by stating that the AI tools allowed them to create something they wouldn't have otherwise, despite limitations and quirks. They believe that intent matters, contrasting the potential for creative expression with the \"slop-farm\" content.\n",
    "chinese_title": "西兰花人，重制版",
    "chinese_summary": "This article details the author's experience recreating Google's \"Broccoli Man\" video using AI tools. Fifteen years after the original, the author spent a Saturday using Veo 3.1 and Nano Banana to create a remastered 4-minute short film.\n\nThe process involved:\n*   **Preproduction:** Script preparation using AI Studio to break down the original video into scenes and brainstorming prompts. Character \"ingredients\" (Broccoli Man and Red Panda) were converted to photorealistic versions and backgrounds removed using Magic Markup (Nano Banana).\n*   **Production:** Video generation using Vertex AI Studio and Veo 3.1 with \"Ingredients to Scene.\" The process was iterative, with the author generating multiple samples per scene and tweaking prompts. Character consistency was surprisingly good, and audio sync was often achievable. Challenges included the rigid 8-second clip duration, recreating static conversation scenes, camera control, and achieving desired character emotes.\n*   **Postproduction:** Using CapCut for editing, including trimming scenes, interleaving takes, manipulating audio, and dialogue volume normalization. The author emphasizes the necessity of non-linear video editing for this type of project.\n\nThe author concludes by stating that the AI tools allowed them to create something they wouldn't have otherwise, despite limitations and quirks. They believe that intent matters, contrasting the potential for creative expression with the \"slop-farm\" content.\n"
  },
  {
    "id": "46038047",
    "title": "Claude Advanced Tool Use",
    "url": "https://www.anthropic.com/engineering/advanced-tool-use",
    "summary": "This article introduces three new features designed to enhance the capabilities of AI agents using the Claude model, specifically focusing on tool use and integration.\n\n**1. Tool Search Tool:** Addresses the issue of excessive token consumption by large tool libraries. Instead of loading all tool definitions upfront, the Tool Search Tool enables Claude to dynamically discover tools on-demand. This significantly reduces context consumption (up to 85% token reduction) and improves tool selection accuracy, especially in systems with numerous tools. Tools are marked with `defer_loading: true` to prevent initial loading and are discovered only when needed.\n\n**2. Programmatic Tool Calling:** Solves problems related to context pollution from intermediate results and inference overhead. Claude can now orchestrate tools through code (Python), allowing for complex logic, data processing, and efficient control flow. Instead of individual API calls for each tool and returning results to Claude's context, Claude writes code that calls multiple tools, processes their outputs, and only returns the final, relevant information to its context. This reduces token consumption, latency, and improves accuracy. Tools are enabled for programmatic calling by adding `code_execution` and specifying `allowed_callers`.\n\n**3. Tool Use Examples:** Not discussed in depth in this summary, but it is intended to add examples for how to properly use tools to give context to Claude. JSON schema cannot express usage patterns, this feature is designed to add the necessary context.\n\nThese features aim to make Claude more effective at working with extensive tool libraries and complex workflows, opening up possibilities for building more powerful and efficient AI agents.\n",
    "chinese_title": "Claude高级工具使用",
    "chinese_summary": "本文介绍三个旨在增强使用 Claude 模型的人工智能代理能力的全新功能，特别是专注于工具使用和集成。\n\n**1. 工具搜索工具：** 解决了大型工具库带来的过度 Token 消耗问题。工具搜索工具并非预先加载所有工具定义，而是使 Claude 能够按需动态发现工具。这显著减少了上下文消耗（高达 85% 的 Token 减少），并提高了工具选择的准确性，尤其是在具有大量工具的系统中。工具标记为 `defer_loading: true` 以防止初始加载，并且仅在需要时才被发现。\n\n**2. 程序化工具调用：** 解决了中间结果和推理开销造成的上下文污染问题。 Claude 现在可以通过代码（Python）来编排工具，从而实现复杂的逻辑、数据处理和高效的控制流。 Claude 无需为每个工具进行单独的 API 调用并将结果返回到 Claude 的上下文中，而是编写代码来调用多个工具，处理它们的输出，并将最终的、相关的信息返回到其上下文中。这减少了 Token 消耗、延迟并提高了准确性。 通过添加 `code_execution` 并指定 `allowed_callers` 来启用工具的程序化调用。\n\n**3. 工具使用示例：** 在本摘要中未深入讨论，但其目的是添加关于如何正确使用工具的示例，以便为 Claude 提供上下文。 JSON Schema 无法表达使用模式，此功能旨在添加必要的上下文。\n\n这些功能旨在使 Claude 更有效地使用广泛的工具库和复杂的工作流程，从而为构建更强大和高效的人工智能代理开辟可能性。"
  },
  {
    "id": "46009851",
    "title": "Using an Array of Needles to Create Solid Knitted Shapes",
    "url": "https://dl.acm.org/doi/10.1145/3746059.3747759",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "使用针床阵列制作立体针织造型",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "46010552",
    "title": "Explaining, at some length, Techmeme's 20 years of consistency",
    "url": "https://news.techmeme.com/250912/20-years",
    "summary": "In its 20th anniversary post, Techmeme reflects on its consistent role as a vital tech news aggregator. Despite profound changes in technology, the web, and news consumption, Techmeme has maintained its core function: ranking and organizing links from various sources, including news outlets, personal sites, and social media, to provide a shared context for tech industry leaders.\n\nHowever, maintaining this consistency has become increasingly challenging. Crawling news sites is harder due to paywalls and bot-blocking, requiring constant negotiation with publishers. The fragmentation and increased restrictions on social networks have diminished the availability of usable news signals. Finally, advertising revenue is more reliant on direct relationships with senior-level decision makers.\n\nTechmeme argues that the idea of a complete media overhaul, where traditional journalism is replaced by \"citizen journalism\" or founders going direct, is largely exaggerated. Reputable news outlets still play a crucial role in fact-based storytelling, and tech professionals depend on these sources for reliable information. Moreover, while platforms like X can offer quick news updates, they represent only a slice of the overall tech news landscape, with significant conversations happening on other networks like Bluesky and Threads.\n\nLooking ahead, Techmeme acknowledges the uncertainty of the future but is focused on building upon its existing foundation, including new ways for newsmakers and comms professionals to explicitly tip links. The article emphasizes that while the media landscape constantly evolves, the core principles of news dissemination remain relevant, enabling Techmeme to maintain its consistent presence.\n",
    "chinese_title": "详细解读Techmeme二十年如一日的坚持",
    "chinese_summary": "在成立20周年之际，Techmeme回顾了其作为重要科技新闻聚合器的始终如一的角色。尽管技术、网络和新闻消费发生了深刻的变化，Techmeme仍然保持其核心功能：对来自新闻媒体、个人网站和社交媒体等各种来源的链接进行排名和组织，为科技行业领导者提供共享的背景信息。\n\n然而，保持这种一致性变得越来越具有挑战性。由于付费墙和机器人拦截，抓取新闻网站变得更加困难，需要不断与出版商进行谈判。社交网络的碎片化和限制增加降低了可用新闻信号的可用性。最后，广告收入更加依赖于与高级决策者的直接关系。\n\nTechmeme认为，传统新闻业被“公民新闻”或创始人直接发布内容所取代的彻底媒体改革的想法在很大程度上被夸大了。信誉良好的新闻媒体仍然在基于事实的叙事中发挥着至关重要的作用，科技专业人士依赖这些来源获取可靠的信息。此外，虽然像X这样的平台可以提供快速的新闻更新，但它们只代表整个科技新闻领域的一小部分，重要的对话发生在其他网络，如Bluesky和Threads。\n\n展望未来，Techmeme承认未来的不确定性，但专注于在其现有基础上进行建设，包括新闻制作者和公关专业人员明确提示链接的新方法。文章强调，虽然媒体格局不断发展，但新闻传播的核心原则仍然适用，这使Techmeme能够保持其始终如一的存在。"
  },
  {
    "id": "46036908",
    "title": "Show HN: I built an interactive HN Simulator",
    "url": "https://news.ysimulator.run/news",
    "summary": "The author built an interactive Hacker News (HN) Simulator. While the provided text is extremely short, the core idea is that it allows users to experience a simulated environment of the popular news aggregator and online forum, Hacker News. The simulator aims to replicate aspects of the HN experience, potentially including:\n\n*   **Simulated HN posts:** Users might see simulated headlines, comments, and voting.\n*   **Interactive elements:** The simulation may allow users to upvote, downvote, comment, and potentially submit their own (simulated) posts.\n*   **Mimicking the HN community:** The simulator might attempt to capture the tone, types of discussions, and overall feel of the Hacker News platform.\n\nWithout more information, it's impossible to elaborate on the specifics of the simulator, but the core purpose is to provide an interactive, simulated version of the Hacker News experience.\n",
    "chinese_title": "Show HN: 我做了一个交互式 HN 模拟器",
    "chinese_summary": "作者构建了一个交互式的 Hacker News (HN) 模拟器。虽然提供的文本非常简短，但核心思想是它允许用户体验流行的聚合新闻和在线论坛 Hacker News 的模拟环境。该模拟器旨在复制 HN 体验的各个方面，可能包括：\n\n*   **模拟的 HN 帖子：** 用户可能会看到模拟的标题、评论和投票。\n*   **交互式元素：** 模拟可能允许用户赞成、反对、评论，并可能提交他们自己的（模拟的）帖子。\n*   **模仿 HN 社区：** 模拟器可能会尝试捕捉 Hacker News 平台的语气、讨论类型和整体感觉。\n\n在没有更多信息的情况下，不可能详细说明模拟器的具体细节，但其核心目的是提供 Hacker News 体验的交互式模拟版本。"
  },
  {
    "id": "46019898",
    "title": "Three Years from GPT-3 to Gemini 3",
    "url": "https://www.oneusefulthing.org/p/three-years-from-gpt-3-to-gemini",
    "summary": "Ethan Mollick's article, \"Three Years from GPT-3 to Gemini 3,\" reflects on the rapid advancements in AI since the release of ChatGPT and explores the capabilities of Google's new Gemini 3 model. Rather than benchmark scores, Mollick demonstrates AI's progress by showcasing Gemini 3's ability to perform complex tasks and function as a digital coworker.\n\nHe highlights the shift from simple chatbot functionalities to agentic models capable of coding, designing interfaces, and even creating interactive games. With the launch of Antigravity, Gemini 3 can access a computer, write programs, and complete tasks based on natural language instructions, effectively functioning as a general-purpose tool. Mollick illustrates this by having Gemini 3 analyze his past writings, conduct web research, and create a website summarizing his AI predictions.\n\nFurthermore, Mollick tested Gemini 3's \"PhD-level intelligence\" by tasking it with analyzing a complex dataset and writing an original research paper. The AI successfully generated hypotheses, performed statistical analysis, and produced a formatted document. While the paper had some flaws, similar to a grad student's work, it demonstrated AI's ability to handle nuanced tasks requiring judgment and creativity.\n\nMollick concludes that Gemini 3 is a significant step forward, representing a shift from the \"human in the loop\" correcting AI errors to a collaborative model where humans direct AI work. While not perfect, Gemini 3 signifies the evolution of AI from chatbots to intelligent digital coworkers, necessitating new approaches to managing and guiding these increasingly capable systems.\n",
    "chinese_title": "从GPT-3到Gemini 3的三年",
    "chinese_summary": "伊森·莫里克的文章《从GPT-3到Gemini 3的三年》反思了自ChatGPT发布以来人工智能的快速发展，并探讨了谷歌新模型Gemini 3的功能。莫里克没有使用基准测试分数，而是通过展示Gemini 3执行复杂任务和作为数字同事的能力来证明人工智能的进步。\n\n他强调了从简单的聊天机器人功能到能够编码、设计界面甚至创建互动游戏的代理模型的转变。随着Antigravity的推出，Gemini 3可以访问计算机、编写程序并根据自然语言指令完成任务，有效地发挥通用工具的作用。莫里克通过让Gemini 3分析他过去的著作、进行网络研究并创建一个总结他的人工智能预测的网站来阐明这一点。\n\n此外，莫里克通过让Gemini 3分析一个复杂的数据集并撰写一篇原创研究论文来测试其“博士级智能”。人工智能成功地生成了假设、进行了统计分析并生成了格式化的文档。虽然该论文存在一些缺陷，类似于研究生所做的工作，但它证明了人工智能处理需要判断力和创造力的细微任务的能力。\n\n莫里克总结说，Gemini 3是一个重要的进步，代表着从“人在回路中”纠正人工智能错误到人类指导人工智能工作的协作模型的转变。虽然Gemini 3并非完美，但它标志着人工智能从聊天机器人到智能数字同事的演变，需要新的方法来管理和指导这些能力越来越强的系统。"
  },
  {
    "id": "46009935",
    "title": "How the Atomic Tests Looked Like from Los Angeles",
    "url": "https://www.amusingplanet.com/2016/09/how-atomic-tests-looked-like-from-los.html",
    "summary": "This article discusses the atmospheric atomic tests conducted at the Nevada Test Site between 1951 and 1992 and their visibility from Los Angeles, which is about 240 miles away. The author highlights the casual and almost celebratory way these events were documented and perceived at the time, contrasting it with a modern understanding of the potential dangers.\n\nThe article cites newspaper reports and photographs that show how the atomic blasts illuminated the night sky, even causing a \"second dawn\" in Los Angeles. These events were considered newsworthy and captivating, with local TV stations broadcasting them live.\n\nThe author juxtaposes this casual attitude with the risks of radiation exposure. While acknowledging a naive fascination with nuclear weapons during the mid-20th century, the article also implies a lack of awareness or concern for the potential health consequences.\n\nThe article concludes by referencing Las Vegas's enthusiastic embrace of the atomic tests, with casinos and hotels hosting \"atomic cocktail\" parties to view the explosions. The comments section of the article highlights concerns about lingering radiation and disputes about the cause of cancer, underscoring the complex and controversial legacy of these tests.\n",
    "chinese_title": "从洛杉矶看原子弹试验是怎样的",
    "chinese_summary": "本文探讨了1951年至1992年间在内华达试验场进行的大气原子弹试验，以及洛杉矶（约240英里之外）的可见度。作者强调了当时记录和看待这些事件的随意甚至近乎庆祝的方式，并将其与现代对潜在危险的理解进行了对比。\n\n文章引用了报纸报道和照片，显示了原子弹爆炸如何照亮夜空，甚至在洛杉矶造成“第二次黎明”。这些事件被认为是具有新闻价值和引人入胜的，当地电视台对其进行了直播。\n\n作者将这种随意的态度与辐射暴露的风险并置。文章承认在20世纪中期对核武器存在一种天真的迷恋，但也暗示了对潜在健康后果缺乏认识或关注。\n\n文章最后提到了拉斯维加斯对原子弹试验的热情拥抱，赌场和酒店举办“原子鸡尾酒”派对来观看爆炸。文章评论区强调了对残留辐射的担忧以及关于癌症原因的争论，突出了这些试验复杂而有争议的遗产。"
  },
  {
    "id": "46042655",
    "title": "Windows GUI – Good, Bad and Pretty Ugly (2023)",
    "url": "https://creolened.com/windows-gui-good-bad-and-pretty-ugly-ranked/",
    "summary": "This article humorously ranks the evolution of the Windows Graphical User Interface (GUI) from its inception in 1985 with Windows 1.0 to the current Windows 11 (2023). The author uses a \"Clippy\" scale (1-10) to rate each major version based on how they look *now*, not necessarily how innovative they were at the time.\n\nThe rankings are: Windows 11 (8), Windows 2000 (8), Windows 95/98/Vista/7 (7.5), Windows 10 (6.5), Windows 3.0/3.1/XP (6), Windows 8.1 (5.5), Windows 8 (5), Windows 2.0 (2.5), and Windows 1.0 (1).\n\nThe author praises Windows 3.0 for offering a coherent GUI and professional look. Windows 95 is lauded for its functional design and impact on Apple. Windows Vista is recognized for its grown-up, glossy aesthetic. Windows 11 is considered the most refined since 2000, despite some limitations.\n\nWindows XP is criticized for its cartoony appearance, while Windows 8 is deemed a major step back due to its tablet-centric design and removal of the Start menu. The early versions (1.0 and 2.0) are acknowledged as being limited by the technology of their time. Windows 10 is seen as a patchwork effort to recover from the mistakes of Windows 8.\n\nThe author concludes by speculating on the potential design of Windows 12, anticipating possible continuity with Windows 11.\n",
    "chinese_title": "Windows GUI – 好、坏与丑陋 (2023)",
    "chinese_summary": "本文幽默地对Windows图形用户界面(GUI)的演变进行了排名，从1985年Windows 1.0的诞生到现在的Windows 11 (2023)。作者使用“Clippy”评分（1-10）来评价每个主要版本，基于的是它们*现在*的观感，而非当时它们有多么创新。\n\n排名如下：Windows 11 (8)，Windows 2000 (8)，Windows 95/98/Vista/7 (7.5)，Windows 10 (6.5)，Windows 3.0/3.1/XP (6)，Windows 8.1 (5.5)，Windows 8 (5)，Windows 2.0 (2.5)，和Windows 1.0 (1)。\n\n作者赞扬Windows 3.0提供了连贯的GUI和专业的外观。Windows 95因其功能性的设计和对苹果的影响而受到赞扬。Windows Vista因其成熟、光鲜的美学而受到认可。Windows 11被认为是自2000年以来最精致的版本，尽管有一些限制。\n\nWindows XP因其卡通般的外观而受到批评，而Windows 8则被认为是重大倒退，因为它以平板电脑为中心的设计和移除了“开始”菜单。早期版本（1.0和2.0）被认为是受到当时技术的限制。Windows 10被视为是为了弥补Windows 8的错误而进行的拼凑之作。\n\n作者最后推测了Windows 12的潜在设计，预计其可能与Windows 11保持连续性。"
  },
  {
    "id": "46015095",
    "title": "A million ways to die from a data race in Go",
    "url": "https://gaultier.github.io/blog/a_million_ways_to_data_race_in_go.html",
    "summary": "This article by Philippe Gaultier explores common data race pitfalls in Go and offers solutions. It emphasizes that despite Go's reputation for concurrency, data races are easily introduced, leading to unpredictable behavior.\n\nThe first pitfall discussed is **accidental capture of outer variables in closures**, where goroutines unintentionally modify shared variables, fixable by declaring local variables within the closure.\n\nThe article then addresses the concurrent use of `http.Client`. While documented as concurrency-safe, modifying its fields like `CheckRedirect` concurrently is a data race. The solution is to use separate `http.Client` instances for each goroutine.\n\nThe third problem is the **improper lifetime of a mutex**. The author describes a scenario where a global map is protected by mutexes created within each HTTP handler, resulting in multiple mutexes guarding the same data, rendering synchronization ineffective. The fix involves either making both the data and mutex global or deep cloning the data for each handler.\n\nFinally, the article briefly mentions common data races involving standard library containers like maps and slices and the need for synchronization using mutexes or concurrency-safe data structures.\n\nThe author concludes by suggesting that a better mutex API, inspired by Rust's approach of wrapping data, could mitigate some of these issues, and laments the lack of a built-in deep clone function in Go. He highlights that data races in Go are not just about synchronization but also about object ownership and object lifetime.\n",
    "chinese_title": "Go中数据竞争导致死亡的一百万种方式",
    "chinese_summary": "Philippe Gaultier 的这篇文章探讨了 Go 中常见的数据竞争陷阱并提供了解决方案。文章强调，尽管 Go 以并发性著称，但数据竞争很容易引入，导致不可预测的行为。\n\n第一个讨论的陷阱是**闭包中意外捕获外部变量**，其中 goroutine 无意中修改了共享变量，可以通过在闭包中声明局部变量来解决。\n\n文章接着讨论了 `http.Client` 的并发使用。 虽然它被记录为并发安全，但并发修改其字段（如 `CheckRedirect`）会导致数据竞争。 解决方案是为每个 goroutine 使用单独的 `http.Client` 实例。\n\n第三个问题是 **mutex 的生命周期不当**。 作者描述了一种情况，即全局 map 受由每个 HTTP 处理程序中创建的 mutex 保护，导致多个 mutex 保护相同的数据，从而使同步无效。 解决方法是使数据和 mutex 都成为全局变量，或者为每个处理程序深度克隆数据。\n\n最后，文章简要提到了涉及标准库容器（如 map 和 slice）的常见数据竞争，以及使用 mutex 或并发安全数据结构进行同步的必要性。\n\n作者最后建议，受 Rust 包装数据方法启发的更好的 mutex API 可以缓解其中一些问题，并感叹 Go 中缺少内置的深度克隆函数。 他强调，Go 中的数据竞争不仅与同步有关，还与对象所有权和对象生命周期有关。"
  },
  {
    "id": "46036878",
    "title": "Implications of AI to schools",
    "url": "https://twitter.com/karpathy/status/1993010584175141038",
    "summary": "The provided content isn't an article about the implications of AI for schools. It's a snippet from X (formerly Twitter) indicating that JavaScript is disabled in the user's browser. As a result, the page is not rendering correctly and no content about AI and schools is available.\n\nTherefore, it's impossible to summarize the article as the content is a technical error message, not an article about AI and its impact on education. To get a summary, a valid article on the topic of \"Implications of AI to schools\" needs to be provided.\n",
    "chinese_title": "人工智能对学校的影响",
    "chinese_summary": "提供的并非一篇关于人工智能对学校影响的文章，而是来自X（前身为Twitter）的一段信息，显示用户的浏览器已禁用JavaScript。因此，页面无法正确渲染，并且没有关于人工智能和学校的内容。\n\n因此，无法总结文章，因为内容是技术错误消息，而不是关于人工智能及其对教育影响的文章。要获得摘要，需要提供一篇关于“人工智能对学校的影响”的有效文章。"
  },
  {
    "id": "46036895",
    "title": "Cool-retro-term: terminal emulator which mimics look and feel of CRTs",
    "url": "https://github.com/Swordfish90/cool-retro-term",
    "summary": "Cool-retro-term is a terminal emulator designed to replicate the visual appearance of old cathode ray tube (CRT) screens. It's customizable, lightweight, and visually appealing. The emulator uses the QML port of qtermwidget (Konsole) and supports Linux and macOS, requiring Qt5.\n\nUsers can customize settings such as colors, fonts, and visual effects through a context menu. Pre-built versions are available for download as AppImages (Linux) or dmg (macOS) from the Releases page. It's also packaged in the official repositories of many distributions like Ubuntu, Fedora, and Arch. Instructions for building the emulator from source code on Linux and macOS can be found in the project's wiki.\n",
    "chinese_title": "Cool-retro-term：模拟CRT外观的终端模拟器",
    "chinese_summary": "Cool-retro-term：一款旨在模仿老式阴极射线管(CRT)屏幕视觉效果的终端模拟器，可定制、轻量且美观。该模拟器使用qtermwidget (Konsole)的QML端口，支持Linux和macOS，需要Qt5。\n\n用户可以通过上下文菜单自定义颜色、字体和视觉效果等设置。预构建版本可以从发布页面下载，格式为AppImage (Linux) 或 dmg (macOS)。它也被打包在许多发行版的官方仓库中，如Ubuntu、Fedora和Arch。在项目的wiki中可以找到关于在Linux和macOS上从源代码构建该模拟器的说明。"
  },
  {
    "id": "46031220",
    "title": "Build a Compiler in Five Projects",
    "url": "https://kmicinski.com/functional-programming/2025/11/23/build-a-language/",
    "summary": "This article promotes a compiler design course (CIS531) based on Prof. Jeremy Siek's \"Essentials of Compilation,\" and taught using the Racket programming language. The course provides a practical, project-based approach to building a compiler for a progressively complex language that culminates in a language supporting features like variables, arithmetic, booleans, branching, heap-allocated vectors, loops, and functions with closures.\n\nThe core of the course is a series of five projects: p1 (Racket warmup), p2 (straight-line arithmetic to x86-64), p3 (booleans/branching to x86-64), p4 (vectors/mutation/loops to x86-64), and p5 (functions/lambdas/closures to x86-64). Each project comes with comprehensive test suites. The article emphasizes the compiler's unique features, including its end-to-end x86-64 compilation, interpreter-based IR definitions for semantic clarity, language scalability, multi-pass testability, and simple recursive coding style.\n\nThe article outlines the structure of each project, highlighting key files such as `compile.rkt` (where students write their code), `irs.rkt` (IR definitions), `interpreters.rkt` (reference interpreters), `main.rkt` (compiler driver), and `test.rkt` (test harness). The goal is to make the language as expressive and fun as possible quickly, even if that means forgoing features like type/memory safety and garbage collection (though these could be added later). Finally, the author encourages readers to try the projects, build upon the base compiler, and reach out with their experiences.\n",
    "chinese_title": "五个项目构建编译器",
    "chinese_summary": "本文介绍一门基于 Jeremy Siek 教授的“编译原理精要”并使用 Racket 编程语言教授的编译器设计课程 (CIS531)。该课程提供了一种实践性的、基于项目的学习方法，用于构建一个针对逐步复杂的语言的编译器，最终实现对变量、算术、布尔值、分支、堆分配向量、循环以及带闭包的函数等特性的支持。\n\n课程的核心是一系列五个项目：p1 (Racket 热身)，p2 (直线算术到 x86-64)，p3 (布尔/分支到 x86-64)，p4 (向量/变异/循环到 x86-64)，和 p5 (函数/lambda/闭包到 x86-64)。每个项目都附带全面的测试套件。本文重点介绍了编译器的独特功能，包括其端到端 x86-64 编译、用于语义清晰的基于解释器的 IR 定义、语言可扩展性、多通道可测试性以及简单的递归编码风格。\n\n本文概述了每个项目的结构，重点介绍了诸如 `compile.rkt`（学生编写代码的地方）、`irs.rkt`（IR 定义）、`interpreters.rkt`（参考解释器）、`main.rkt`（编译器驱动程序）和 `test.rkt`（测试工具）等关键文件。 目标是尽快使语言尽可能具有表现力和趣味性，即使这意味着放弃类型/内存安全和垃圾收集等功能（尽管这些功能可以在以后添加）。 最后，作者鼓励读者尝试这些项目，在基本编译器之上进行构建，并分享他们的经验。"
  },
  {
    "id": "46006104",
    "title": "Show HN: OCR Arena – A playground for OCR models",
    "url": "https://www.ocrarena.ai/battle",
    "summary": "OCR Arena is a playground website for comparing OCR (Optical Character Recognition) models anonymously. Users can upload images (PDF, JPEG, PNG) and initiate \"battles\" between two anonymous OCR models. The website tracks rankings of the models based on their Elo rating, win rate, and number of battles. Users can either upload their own documents or request a random one for testing. The main features include:\n\n*   **OCR Model Battles:** Compare the performance of two anonymous OCR models side-by-side.\n*   **Anonymous Participation:** Users don't need to register to participate, ensuring unbiased testing.\n*   **Ranking System:** Models are ranked based on Elo, win rate, and battle count.\n*   **File Support:** Accepts PDF, JPEG, and PNG files.\n*   **Document Sourcing:** Users can either upload their own documents or request a random one for testing.\n\nThe site aims to provide a platform for evaluating and improving OCR technology through crowdsourced comparison.\n",
    "chinese_title": "Show HN: OCR竞技场 – OCR模型的游乐场",
    "chinese_summary": "OCR竞技场是一个用于匿名比较OCR（光学字符识别）模型的游乐场网站。用户可以上传图像（PDF、JPEG、PNG）并启动两个匿名OCR模型之间的“战斗”。该网站根据模型的Elo评级、胜率和战斗次数来跟踪模型的排名。用户可以上传自己的文档或请求随机文档进行测试。主要功能包括：\n\n*   **OCR模型战斗：** 并排比较两个匿名OCR模型的性能。\n*   **匿名参与：** 用户无需注册即可参与，确保公正的测试。\n*   **排名系统：** 模型根据Elo、胜率和战斗次数进行排名。\n*   **文件支持：** 接受PDF、JPEG和PNG文件。\n*   **文档来源：** 用户可以上传自己的文档或请求随机文档进行测试。\n\n该网站旨在提供一个平台，通过众包比较来评估和改进OCR技术。"
  },
  {
    "id": "45985081",
    "title": "Rethinking C++: Architecture, Concepts, and Responsibility",
    "url": "https://blogs.embarcadero.com/rethinking-c-architecture-concepts-and-responsibility/",
    "summary": "This article advocates for a fundamental rethinking of C++ development, spurred by the advancements in C++20 and C++23, particularly within the context of C++Builder 13. The author argues that modern C++ is not just an evolution but a revolution, requiring developers to move beyond using it as a mere tool and embrace it as an \"architectural medium.\"\n\nKey points include:\n\n*   **Concept-based programming:** Emphasizes the use of concepts for defining interfaces and enabling compile-time verification, improving code safety and efficiency.\n*   **Metaprogramming:** Highlights the importance of designing blueprints for the compiler, leading to optimized code generation at compile time and reduced runtime overhead.\n*   **Ranges:** Introduces the power of ranges for data processing, allowing for declarative, pipeline-like descriptions that are type-safe and reusable.\n*   **RAII:** Reinforces the importance of Resource Acquisition Is Initialization (RAII) for ensuring resource safety and deterministic control, linking object lifetime to system stability.\n*   **Shifting Responsibility:** Emphasizes a shift in focus from runtime execution to compile-time design and optimization.\n*   **Re-learning C++:** Urges developers to \"go back to school\" and re-learn C++ to effectively utilize new language features.\n\nThe author illustrates these points with examples of integrating C++ concepts and ranges with Delphi libraries like VCL and FMX. Ultimately, the article calls for a new generation of C++ libraries that embrace concepts, typelists, and compile-time mechanisms, urging both library and compiler vendors to fully unlock the potential of the modern language.\n",
    "chinese_title": "重新思考 C++：架构、概念与责任",
    "chinese_summary": "本文倡导对C++开发进行根本性的反思，这得益于C++20和C++23的进步，尤其是在C++Builder 13的背景下。作者认为，现代C++不仅是一种进化，更是一场革命，要求开发者超越将其作为简单工具的使用方式，而将其拥抱为一种“架构媒介”。\n\n关键点包括：\n\n*   **基于概念的编程:** 强调使用概念来定义接口并实现编译时验证，从而提高代码安全性和效率。\n*   **元编程:** 强调为编译器设计蓝图的重要性，从而在编译时实现优化的代码生成并减少运行时开销。\n*   **范围 (Ranges):** 介绍了范围在数据处理方面的强大功能，允许使用声明式的、类似管道的描述，这些描述是类型安全的且可重用的。\n*   **RAII:** 强调资源获取即初始化 (RAII) 对于确保资源安全和确定性控制的重要性，将对象生命周期与系统稳定性联系起来。\n*   **责任转移:** 强调将重点从运行时执行转移到编译时设计和优化。\n*   **重新学习C++:** 敦促开发者“重返校园”并重新学习C++，以有效地利用新的语言特性。\n\n作者通过将C++概念和范围与Delphi库（如VCL和FMX）集成的例子来说明这些观点。最终，本文呼吁新一代C++库拥抱概念、类型列表和编译时机制，并敦促库和编译器供应商充分释放现代语言的潜力。"
  },
  {
    "id": "46030799",
    "title": "What OpenAI did when ChatGPT users lost touch with reality",
    "url": "https://www.nytimes.com/2025/11/23/technology/openai-chatgpt-users-risks.html",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "当ChatGPT用户失去现实感时，OpenAI做了什么",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "46047409",
    "title": "Choosing a hash function for 2030 and beyond: SHA-2 vs. SHA-3 vs. BLAKE3",
    "url": "https://kerkour.com/fast-secure-hash-function-sha256-sha512-sha3-blake3",
    "summary": "The provided content is insufficient to summarize the article \"Choosing a hash function for 2030 and beyond: SHA-2 vs. SHA-3 vs. BLAKE3\". All that is given is the title and a JavaScript error message. To provide a summary, the actual content of the article discussing the pros and cons of each hashing algorithm (SHA-2, SHA-3, and BLAKE3) needs to be available.\n\nWithout access to the article, I can only speculate on potential points it *might* cover:\n\n*   **SHA-2:** Discusses its widespread adoption, known vulnerabilities (though generally still considered secure for many applications), and potential performance limitations. Its age might be a factor for long-term security considerations.\n\n*   **SHA-3:** Explores its development as a response to concerns about SHA-2, its resistance to certain types of attacks, and potential advantages in specific hardware implementations. However, it might also touch upon its less widespread adoption compared to SHA-2.\n\n*   **BLAKE3:** Highlights its modern design, performance benefits (particularly in parallel processing), security strengths, and increasing adoption in various contexts. It might also discuss its suitability for different use cases.\n\n*   **Considerations for 2030 and beyond:** The article likely delves into factors like advancements in computing power (affecting brute-force attacks), the emergence of quantum computing, and evolving security requirements when choosing a hashing algorithm for long-term use. The summary would therefore need to cover whether SHA-2, SHA-3, or BLAKE3 are the most appropriate for the future based on their inherent design principles and vulnerability to these coming concerns.\n\nBecause this is hypothetical, it cannot be considered a true summary of the article based on the input provided.\n",
    "chinese_title": "为2030年及以后选择哈希函数：SHA-2 vs. SHA-3 vs. BLAKE3",
    "chinese_summary": "提供的现有内容不足以总结文章《为2030年及以后选择哈希函数：SHA-2 vs. SHA-3 vs. BLAKE3》。仅提供了标题和一个JavaScript错误消息。为了提供摘要，需要提供文章的实际内容，讨论每种哈希算法（SHA-2、SHA-3 和 BLAKE3）的优缺点。\n\n由于无法访问该文章，我只能推测它*可能*涵盖的潜在要点：\n\n*   **SHA-2：**讨论其广泛采用、已知漏洞（尽管通常认为对于许多应用程序仍然安全）以及潜在的性能限制。其存在时间可能是一个长期安全考虑因素。\n\n*   **SHA-3：**探讨其作为对 SHA-2 担忧的回应而进行的开发、其对某些类型攻击的抵抗力以及在特定硬件实现中的潜在优势。但是，它也可能涉及与 SHA-2 相比，其采用范围较小的问题。\n\n*   **BLAKE3：**强调其现代设计、性能优势（尤其是在并行处理方面）、安全优势以及在各种环境中的日益普及。它还可能讨论其对不同用例的适用性。\n\n*   **2030年及以后的考量因素：**该文章可能深入探讨了计算能力进步（影响暴力破解攻击）、量子计算的出现以及在选择用于长期使用的哈希算法时不断发展的安全需求等因素。因此，该摘要需要涵盖基于其固有的设计原则以及对这些未来问题的脆弱性，SHA-2、SHA-3 或 BLAKE3 中哪一个最适合未来。\n\n因为这是假设性的，所以不能将其视为基于所提供输入的文章的真实摘要。"
  },
  {
    "id": "46013478",
    "title": "The history of Indian science fiction",
    "url": "https://altermag.com/articles/the-secret-history-of-indian-science-fiction",
    "summary": "This article, \"The Secret History of Indian Science Fiction,\" by Gautam Bhatia, traces the origins and evolution of the genre in India. Bhatia argues that Rokeya Sakhawat Hossain's \"Sultana's Dream\" (1905) is a seminal work of Indian SF, employing techniques like defamiliarization and cognitive estrangement to critique patriarchal social relations and envision a techno-utopian society.\n\nThe article explores the development of speculative fiction in India through Urdu and Bengali works, including *Tilism-e-Hoshruba* and Jagdish Chandra Bose's *Niruddeshar Kahini*, with the term \"kalpavigyan\" emerging to describe Bengali SF. It also examines Rahul Sankrityayan's utopian novel *Baeesveen Sadi*, and compares it to Yevgeny Zamyatin's dystopian *We*, highlighting the global conversation around utopian ideals.\n\nBhatia emphasizes the uniqueness of \"Sultana's Dream\" as a feminist work written in English, contrasting it with the dominance of social realism in post-colonial Indian English-language novels. The article further discusses the evolution of English-language SF in the West, including pulp magazines, the \"Golden Age,\" the counter-cultural movements of the 1960s, and the rise of cyberpunk. The article highlights how Indian SF, while thriving in non-English languages with authors like Satyajit Ray and Sujatha, remained largely isolated from international trends and often focused on \"scientifiction,\" blending entertainment with education.\n",
    "chinese_title": "印度科幻史",
    "chinese_summary": "高塔姆·巴蒂亚的《印度科幻秘史》一文追溯了印度科幻小说的起源和发展。巴蒂亚认为罗克娅·萨卡瓦特·侯赛因的《苏丹娜之梦》（1905）是印度科幻小说的一部开创性作品，它运用了陌生化和认知疏离等技巧来批判父权制的社会关系，并构想了一个科技乌托邦社会。\n\n该文章探讨了乌尔都语和孟加拉语作品中印度思辨小说的发展，包括《蒂利斯姆-埃-霍什鲁巴》和贾格迪什·钱德拉·玻色（Jagdish Chandra Bose）的《消失的故事》，其中“kalpavigyan”一词开始用来描述孟加拉科幻小说。它还考察了拉胡尔·桑克里提亚扬的乌托邦小说《二十二世纪》，并将其与叶夫根尼·扎米亚京的反乌托邦小说《我们》进行比较，突出了围绕乌托邦理想的全球对话。\n\n巴蒂亚强调《苏丹娜之梦》作为一部用英语创作的女性主义作品的独特性，并将其与后殖民时期印度英语小说中社会现实主义的 dominant 地位相比较。该文章进一步讨论了西方英语科幻小说的发展，包括通俗杂志、“黄金时代”、20世纪60年代的反文化运动以及赛博朋克的兴起。该文章强调，印度科幻小说虽然在非英语语言中蓬勃发展，涌现了萨蒂亚吉特·雷伊和苏贾塔等作家，但在很大程度上与国际趋势隔绝，并且经常侧重于将娱乐与教育相结合的“科学小说”。"
  },
  {
    "id": "46037637",
    "title": "Claude Opus 4.5",
    "url": "https://www.anthropic.com/news/claude-opus-4-5",
    "summary": "Claude Opus 4.5, Anthropic's newest AI model, is presented as a significant advancement, particularly in coding, agent capabilities, and computer use, also showing improvements in research and data handling. It's available via API and cloud platforms with a pricing of $5/$25 per million tokens.\n\nEarly testers and customers have praised its ability to handle ambiguity, reason about tradeoffs, and fix complex bugs. User testimonials highlight its superior code quality, efficiency in agentic workflows, performance on complex enterprise tasks, and ability to excel in long-horizon, autonomous tasks. The model also demonstrates breakthroughs in self-improving AI agents, automation, storytelling, and Excel capabilities.\n\nEvaluations demonstrate Opus 4.5's superiority on benchmarks like SWE-bench Multilingual, Aider Polyglot, BrowseComp-Plus, and Vending-Bench, achieving state-of-the-art results. In one instance, it surpassed the highest score ever achieved by a human on a performance engineering take-home exam. It showcases its ability to find creative solutions even when they aren't anticipated, a feature that sets it apart.\n\nEmphasis is also placed on Opus 4.5's safety alignment and robustness against prompt injection attacks. A new effort parameter on the Claude API allows developers to optimize for speed or capability. Updates include improvements to Claude Code, allowing for more precise planning and desktop app integration. Furthermore, Claude app users benefit from automatic summarization for longer conversations, and Claude for Chrome and Excel receive expanded access.\n",
    "chinese_title": "克勞德 Opus 4.5",
    "chinese_summary": "Claude Opus 4.5：Anthropic最新AI模型，在编码、代理能力和计算机使用方面有显著提升，并在研究和数据处理方面有所改进。可通过API和云平台使用，定价为每百万token 5美元/25美元。\n\n早期测试者和客户称赞其处理歧义、权衡利弊和修复复杂错误的能力。用户评价强调其卓越的代码质量、代理工作流程效率、复杂企业任务性能以及在长周期自主任务中的出色表现。该模型还在自我改进AI代理、自动化、故事讲述和Excel功能方面取得了突破。\n\n评估显示，Opus 4.5 在 SWE-bench Multilingual、Aider Polyglot、BrowseComp-Plus 和 Vending-Bench 等基准测试中表现优异，取得了最先进的成果。在一个案例中，它超过了人类在性能工程家庭作业考试中获得的最高分。它展示了即使在没有预期的情况下也能找到创造性解决方案的能力，这一特点使其与众不同。\n\nOpus 4.5 的安全对齐和抵抗提示注入攻击的能力也备受重视。Claude API 上的一个新努力参数允许开发人员优化速度或能力。更新包括改进 Claude Code，从而实现更精确的规划和桌面应用程序集成。此外，Claude 应用程序用户受益于更长对话的自动摘要，Chrome 和 Excel 版 Claude 的访问权限也得到扩展。"
  },
  {
    "id": "46033330",
    "title": "Chrome Jpegxl Issue Reopened",
    "url": "https://issues.chromium.org/issues/40168998",
    "summary": "Please provide me with the content of the Chromium article \"Chrome Jpegxl Issue Reopened.\" I need the text of the article to summarize it for you. Without the content, I cannot provide a summary.\n",
    "chinese_title": "Chrome JPEG XL 问题重新开启",
    "chinese_summary": "请提供Chromium文章《Chrome Jpegxl问题重开》的内容。我需要文章的文本来为您总结。没有内容，我无法提供摘要。"
  },
  {
    "id": "46032539",
    "title": "Shai-Hulud Returns: Over 300 NPM Packages Infected",
    "url": "https://helixguard.ai/blog/malicious-sha1hulud-2025-11-24",
    "summary": "A security research firm, HelixGuard, has reported that over 300 NPM packages have been infected by a malicious campaign dubbed \"Shai-Hulud Returns.\" This campaign involves the compromise of legitimate NPM package maintainers' accounts and the injection of malicious code into their packages. The malicious code is designed to steal sensitive information, likely including environment variables, credentials, and API keys.\n\nThe sheer scale of the attack, impacting over 300 packages, highlights the persistent vulnerability of the NPM ecosystem. It signifies that attackers are actively targeting developers and their dependencies through supply chain attacks. This campaign underscores the critical need for developers to carefully vet their dependencies, implement strong account security measures (like MFA), and regularly audit their projects for suspicious code. The findings from HelixGuard's open-source research aim to raise awareness and provide developers with information needed to protect themselves and their projects from this ongoing threat. The article serves as a warning and call to action for improved NPM security practices.\n",
    "chinese_title": "沙虫归来：超过 300 个 NPM 包受感染",
    "chinese_summary": "安全研究公司HelixGuard报告称，超过300个NPM软件包已感染名为“沙虫归来”的恶意活动。该活动涉及入侵合法的NPM软件包维护者账户，并将恶意代码注入其软件包。该恶意代码旨在窃取敏感信息，可能包括环境变量、凭据和API密钥。\n\n此次攻击规模庞大，影响超过300个软件包，凸显了NPM生态系统持续存在的漏洞。它表明攻击者正在通过供应链攻击积极 targeting 开发者及其依赖项。 这项活动强调了开发者仔细审查其依赖项、实施强大的账户安全措施（如MFA）以及定期审核其项目以查找可疑代码的关键需求。HelixGuard的开源研究旨在提高人们的意识，并为开发者提供保护自己及其项目免受这种持续威胁所需的信息。 本文旨在作为警告，并呼吁改进NPM安全实践。"
  },
  {
    "id": "46037267",
    "title": "Mind-reading devices can now predict preconscious thoughts",
    "url": "https://www.nature.com/articles/d41586-025-03714-0",
    "summary": "This article discusses the advancements in brain-computer interfaces (BCIs) and their potential to decode preconscious thoughts and intentions. It highlights the case of Nancy Smith, who used a BCI implanted in her posterior parietal cortex to play music, with the device anticipating her actions before she consciously initiated them. This exemplifies the potential of \"dual-implant\" BCIs to improve prosthetic device performance by capturing intentions and pre-motor planning.\n\nThe article also explores the ethical concerns surrounding the increasing ability of these devices to access individuals' innermost thoughts, including preconscious ones. This raises questions about data privacy, potential manipulation, and the need for regulation, especially concerning consumer neurotech products that use EEG to monitor brain states. While clinical BCIs face medical regulations, consumer BCIs have limited oversight, potentially allowing companies to exploit neural data.\n\nThe article points out laws are being passed to protect neural data, but ethicists argue they need to address inferences companies can draw when combining neural information with other digital data. While implanted BCIs are not yet approved for general clinical use, companies like Synchron and Neuralink are making progress with clinical trials, focusing on restoring independence to individuals with paralysis.  Ultimately, BCI developers aim to go beyond the motor cortex to address psychiatric conditions by identifying and monitoring neural signatures and delivering tailored stimulation, which raises more ethical considerations.\n",
    "chinese_title": "读心设备现在可以预测潜意识的想法",
    "chinese_summary": "本文探讨了脑机接口(BCI)的进展及其解码前意识思想和意图的潜力。文章重点介绍了南希·史密斯的案例，她使用植入在顶后皮层的脑机接口来播放音乐，该设备在她有意识地启动行动之前就预测了她的行为。这例证了“双植入”脑机接口通过捕获意图和运动前计划来提高假肢设备性能的潜力。\n\n文章还探讨了这些设备访问个人内心最深处想法（包括前意识想法）能力不断增强所带来的伦理问题。 这引发了关于数据隐私、潜在操纵以及监管需求的质疑，尤其是在使用脑电图监测大脑状态的消费级神经技术产品方面。 尽管临床脑机接口面临医疗监管，但消费级脑机接口的监管有限，这可能允许公司利用神经数据。\n\n文章指出，一些法律正在通过以保护神经数据，但伦理学家认为，这些法律需要解决公司将神经信息与其他数字数据相结合时可能进行的推断。 虽然植入式脑机接口尚未获准用于一般临床用途，但Synchron和Neuralink等公司正在临床试验方面取得进展，重点是恢复瘫痪患者的独立性。 最终，脑机接口开发者旨在超越运动皮层，通过识别和监测神经信号并提供量身定制的刺激来解决精神疾病，而这会引发更多的伦理考量。"
  },
  {
    "id": "46037591",
    "title": "Google's new 'Aluminium OS' project brings Android to PC",
    "url": "https://www.androidauthority.com/aluminium-os-android-for-pcs-3619092/",
    "summary": "Google is developing \"Aluminium OS,\" a new operating system for PCs based on Android, aiming to unify ChromeOS and Android into a single desktop platform and better compete with Windows and macOS. Officially announced at the Snapdragon Summit, the project involves collaboration with Qualcomm to leverage AI advancements and bring Android's capabilities to the PC market.\n\nKey details revealed include:\n\n*   **Aluminium OS Codename:** \"Aluminium\" is confirmed as the codename, a nod to Android's role as the foundation.\n*   **AI Integration:** The OS will deeply integrate with Gemini, Google's AI chatbot, to leverage hardware potential and provide enhanced AI features.\n*   **Targeted Hardware:** The OS will span various form factors (laptops, detachables, tablets, mini-PCs) and tiers (entry-level to premium), signaling Google's intent to compete across the entire PC spectrum.\n*   **ChromeOS's Future:** Google plans to eventually replace ChromeOS with Aluminium OS but will likely offer legacy support for existing devices and an optional upgrade path for compatible hardware.\n*   **Branding:** The final name is uncertain, but possibilities include retaining the ChromeOS brand or adopting \"Android Desktop.\"\n*   **Launch Timeline:** The initial public release is expected in 2026, likely built upon Android 17.\n\nThe move aims to consolidate development resources and create a more competitive desktop OS, with a focus on AI integration and a broader range of hardware support.\n",
    "chinese_title": "谷歌全新“铝制操作系统”项目将安卓带到PC",
    "chinese_summary": "谷歌正在开发代号为“铝”的新操作系统Aluminium OS，该系统基于安卓，旨在将ChromeOS和安卓统一到一个桌面平台，更好地与Windows和macOS竞争。该项目在骁龙峰会上正式宣布，涉及与高通的合作，以利用人工智能的进步，并将安卓的功能带入PC市场。\n\n已披露的关键细节包括：\n\n*   **Aluminium OS 代号：** “铝”已被确认为代号，是对安卓作为基础的一种致敬。\n*   **人工智能集成：** 该操作系统将与谷歌的人工智能聊天机器人Gemini深度集成，以利用硬件潜力并提供增强的人工智能功能。\n*   **目标硬件：** 该操作系统将涵盖各种外形尺寸（笔记本电脑、可拆卸设备、平板电脑、迷你PC）和层级（入门级到高端级），表明谷歌有意在整个PC领域展开竞争。\n*   **ChromeOS 的未来：** 谷歌计划最终用Aluminium OS取代ChromeOS，但很可能会为现有设备提供旧版支持，并为兼容硬件提供可选的升级途径。\n*   **品牌：** 最终名称尚不确定，但可能性包括保留ChromeOS品牌或采用“Android桌面”。\n*   **发布时间表：** 初步公开版本预计在2026年发布，很可能基于Android 17构建。\n\n此举旨在整合开发资源，并创建一个更具竞争力的桌面操作系统，重点是人工智能集成和更广泛的硬件支持。"
  },
  {
    "id": "45981281",
    "title": "Dumb Ways to Die: Printed Ephemera",
    "url": "https://ilovetypography.com/2025/11/19/dumb-ways-to-die-printed-ephemera/",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "蠢蠢的死法：印刷品",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "45980474",
    "title": "Moving from OpenBSD to FreeBSD for firewalls",
    "url": "https://utcc.utoronto.ca/~cks/space/blog/sysadmin/OpenBSDToFreeBSDMove",
    "summary": "This is not an article about moving from OpenBSD to FreeBSD for firewalls. It's a message from Chris Siebenmann explaining why readers might be encountering an error message when accessing his blog, Wandering Thoughts, or his wiki, CSpace.\n\nSiebenmann implemented anti-crawler measures to combat a surge in high-volume crawlers, particularly those using old Chrome browser user agents, a tactic prevalent among crawlers gathering data for LLM training. This system inadvertently blocks legitimate users with outdated browsers.\n\nIf a user encounters this message with a current browser, they are instructed to contact the author (Chris Siebenmann at his university) with their browser and User-Agent string for troubleshooting.\n\nThe message specifically addresses users of archive services like archive.today, archive.ph, and archive.is. These services are also inadvertently blocked because they crawl pages in a way indistinguishable from malicious actors, using old Chrome User-Agent values, distributed IP addresses, and sometimes falsified reverse DNS entries. Siebenmann recommends using archive.org instead, as it's a better-behaved archival crawler.\n",
    "chinese_title": "从OpenBSD迁移到FreeBSD作为防火墙",
    "chinese_summary": "这不是一篇关于将防火墙从OpenBSD迁移到FreeBSD的文章。这是Chris Siebenmann的消息，解释了为什么读者在访问他的博客Wandering Thoughts或他的维基CSpace时可能会遇到错误信息。\n\nSiebenmann实施了反爬虫措施，以应对大量涌入的高流量爬虫，尤其是那些使用旧Chrome浏览器用户代理的爬虫，这是一种普遍存在于为LLM训练收集数据的爬虫中的策略。该系统无意中阻止了使用过时浏览器的合法用户。\n\n如果用户使用当前浏览器遇到此消息，他们将被指示联系作者（Chris Siebenmann在他的大学），并提供他们的浏览器和User-Agent字符串以进行故障排除。\n\n该消息专门针对像archive.today、archive.ph和archive.is这样的存档服务的用户。这些服务也被无意中阻止，因为它们以与恶意行为者无法区分的方式爬取页面，使用旧的Chrome User-Agent值、分布式IP地址，有时还使用伪造的反向DNS条目。Siebenmann建议改用archive.org，因为它是一个行为更好的存档爬虫。"
  },
  {
    "id": "46039274",
    "title": "AI has a deep understanding of how this code works",
    "url": "https://github.com/ocaml/ocaml/pull/14369",
    "summary": "This GitHub issue details a pull request (PR) adding DWARF v5 debugging support to the OCaml native compiler for macOS and Linux (AMD64 and ARM64 architectures).  The goal is to enable source-level debugging in GDB and LLDB.\n\nThe PR implements core DWARF v5 support using inline strings to avoid linker issues, multi-compilation unit support with string table deduplication, and section-relative relocations.  It supports function/line-level debugging, parameter/local variable tracking, lexical blocks, and basic OCaml type information.  Platform support is comprehensive for Linux/ELF and macOS/Mach-O, explicitly disabling Windows.  A custom LLDB plug-in formats OCaml values, and a test suite validates functionality.\n\nThe implementation spans 37 commits, including DWARF primitive construction, line number program generation, code address tracking, and integration with the OCaml compilation pipeline. Key changes include upgrading from DWARF v4 to v5, utilizing `DW_FORM_string` to avoid macOS linker issues, and comprehensive validation tests for function/line breakpoints, type information, and multi-object linking.\n\nThe PR preserves source-level parameter names and local variables in DWARF debug info using a new `Variable_info` module. Lexical block support is added for nested scope tracking. Code was added to handle architecture-specific register number mappings and ensure DWARF sections are preserved during linking by passing the `-g` flag to the linker.\n\nA reviewer identified unused functions, which were subsequently removed. A comment raises concerns about code attribution, questioning if the work heavily derives from another author.\n",
    "chinese_title": "AI 对这段代码的工作原理有深刻的理解。",
    "chinese_summary": "此 GitHub issue 详细介绍了一个 pull request (PR)，该 PR 为 macOS 和 Linux（AMD64 和 ARM64 架构）的 OCaml 本机编译器添加了 DWARF v5 调试支持。目标是在 GDB 和 LLDB 中启用源代码级调试。\n\n该 PR 实现了核心 DWARF v5 支持，使用内联字符串以避免链接器问题、使用字符串表去重的多编译单元支持以及节相对重定位。 它支持函数/行级调试、参数/局部变量跟踪、词法块和基本的 OCaml 类型信息。平台支持全面，覆盖 Linux/ELF 和 macOS/Mach-O，明确禁用了 Windows。 一个自定义的 LLDB 插件用于格式化 OCaml 值，一个测试套件用于验证功能。\n\n该实现跨越 37 个提交，包括 DWARF 原始结构构建、行号程序生成、代码地址跟踪以及与 OCaml 编译管道的集成。 主要变更包括从 DWARF v4 升级到 v5、利用 `DW_FORM_string` 来避免 macOS 链接器问题，以及针对函数/行断点、类型信息和多对象链接的全面验证测试。\n\n该 PR 使用一个新的 `Variable_info` 模块在 DWARF 调试信息中保留源代码级参数名称和局部变量。 添加了词法块支持以进行嵌套作用域跟踪。 添加了代码来处理特定于架构的寄存器编号映射，并通过将 `-g` 标志传递给链接器来确保在链接期间保留 DWARF 节。\n\n一位审查员发现了未使用的函数，随后将其删除。 一条评论引发了对代码归属的担忧，质疑这项工作是否大量来源于另一位作者。"
  },
  {
    "id": "46037343",
    "title": "The Bitter Lesson of LLM Extensions",
    "url": "https://www.sawyerhood.com/blog/llm-extension",
    "summary": "This article, written in 2025, reflects on the evolution of extending Large Language Models (LLMs) over the past three years. It highlights the shift from simple text-based interactions to complex agent-based systems capable of interacting with codebases, browsers, and other tools.\n\nThe author traces the development through key milestones: ChatGPT Plugins (ambitious but premature due to model limitations), Custom Instructions (a simple but effective solution for repetitive context), Custom GPTs (a curated app approach), and ChatGPT Memory (automatic personalization). A significant advancement was Cursor's introduction of `.cursorrules` files, enabling context setting within code repositories.\n\nThe article then discusses the Model Context Protocol (MCP), a heavyweight client-server solution for tool integration and resource provision, deemed potentially overkill. Claude Code, an agent incorporating various extension mechanisms like CLAUDE.md, MCP, and slash commands, is presented as a comprehensive but developer-focused approach.\n\nThe turning point is the introduction of Agent Skills in Claude Code, a lighter-weight, markdown-based system reminiscent of ChatGPT Plugins but now viable due to improved model capabilities. Agent Skills allow models to utilize generic tools and instructions to accomplish tasks, marking a return to natural language extensibility.\n\nThe author concludes that the future of LLM extensions lies in equipping models with general-purpose tools and trusting them to leverage those tools effectively, essentially strapping a computer to an LLM. The author predicts a move away from complex protocols like MCP toward more accessible, natural language-based extensions. He envisions future applications seamlessly integrating LLMs with computational power, abstracting the underlying complexity from the end-user.\n",
    "chinese_title": "LLM扩展的惨痛教训",
    "chinese_summary": "本文写于2025年，回顾了过去三年扩展大型语言模型(LLM)的演变。文章重点介绍了从简单的基于文本的交互到能够与代码库、浏览器和其他工具交互的复杂基于代理的系统的转变。\n\n作者追溯了这一发展过程中的关键里程碑：ChatGPT插件（雄心勃勃但由于模型限制而过早）、自定义指令（一种简单但有效的重复上下文解决方案）、自定义GPT（一种精选的应用程序方法）和ChatGPT记忆（自动个性化）。一项重大进展是Cursor引入了`.cursorrules`文件，实现了在代码仓库中设置上下文。\n\n文章随后讨论了模型上下文协议(MCP)，这是一种用于工具集成和资源配置的重量级客户端-服务器解决方案，被认为可能过于复杂。Claude Code是一种集成了各种扩展机制（如CLAUDE.md、MCP和斜杠命令）的代理，被呈现为一种全面但以开发者为中心的方法。\n\n转折点是Claude Code中引入的代理技能，这是一种更轻量级的、基于Markdown的系统，让人联想到ChatGPT插件，但由于模型能力的提高，现在是可行的。代理技能允许模型利用通用工具和指令来完成任务，标志着回归到自然语言可扩展性。\n\n作者总结道，LLM扩展的未来在于为模型配备通用工具，并相信它们能够有效地利用这些工具，本质上是将一台计算机绑在LLM上。作者预测，未来将从复杂的协议（如MCP）转向更易于访问的、基于自然语言的扩展。他设想未来的应用程序将无缝地将LLM与计算能力集成在一起，从而将底层复杂性从最终用户那里抽象出来。"
  },
  {
    "id": "46006891",
    "title": "Building the largest known Kubernetes cluster",
    "url": "https://cloud.google.com/blog/products/containers-kubernetes/how-we-built-a-130000-node-gke-cluster/",
    "summary": "In November 2025, Google Cloud announced it successfully ran a 130,000-node Kubernetes cluster in experimental mode, doubling the officially supported limit of GKE. This achievement addresses the increasing demand for large clusters driven by AI workloads, transitioning from chip constraints to power limitations. The article highlights the need for robust multi-cluster solutions like MultiKueue for distributed training across data centers.\n\nKey architectural innovations enabling this scale include optimized read scalability using features like Consistent Reads from Cache and Snapshottable API Server Cache, reducing load on the central object datastore. A proprietary key-value store based on Google's Spanner distributed database was crucial, handling 13,000 QPS for lease object updates. Kueue, a job queueing controller, managed complex AI/ML environments with fair-sharing policies and \"all-or-nothing\" scheduling. The future involves workload-aware scheduling, simplifying large-scale applications on GKE. GCS FUSE with zonal Anywhere Cache provided efficient data access, reducing latency for AI workloads.\n\nTo validate GKE's performance, a four-phase benchmark simulated a dynamic AI environment with mixed workloads (low, medium, high priority) managed by Kueue and JobSet. The benchmark demonstrated GKE's ability to handle fluctuating demands, preempting lower-priority jobs, scaling to 130,000 pods in under 4 minutes, and sustaining a throughput of up to 1,000 Pods/second. Kueue dynamically allocated resources based on priority, showcasing GKE's elasticity and resource reallocation capabilities.\n",
    "chinese_title": "构建已知最大的Kubernetes集群",
    "chinese_summary": "2025年11月，谷歌云宣布成功在实验模式下运行了一个拥有13万个节点的 Kubernetes 集群，是GKE官方支持上限的两倍。 这一成就解决了人工智能工作负载驱动的对大型集群日益增长的需求，从芯片限制过渡到电力限制。 文章强调了对稳健的多集群解决方案（如 MultiKueue）的需求，以便在数据中心之间进行分布式训练。\n\n实现这种规模的关键架构创新包括优化读取可扩展性，使用诸如从缓存进行一致性读取和可快照的API服务器缓存等功能，从而减少中央对象数据存储上的负载。 一个基于谷歌 Spanner 分布式数据库的专有键值存储至关重要，它处理了租赁对象更新的13,000 QPS。 作业队列控制器 Kueue 管理着复杂的AI/ML环境，具有公平共享策略和“全有或全无”调度。 未来涉及工作负载感知调度，从而简化 GKE 上的大规模应用程序。 具有区域性 Anywhere Cache 的 GCS FUSE 提供了高效的数据访问，从而降低了 AI 工作负载的延迟。\n\n为了验证 GKE 的性能，一个四阶段基准测试模拟了一个动态的 AI 环境，其中混合了由 Kueue 和 JobSet 管理的各种工作负载（低、中、高优先级）。 该基准测试证明了 GKE 处理波动需求的能力，抢占低优先级作业，在不到 4 分钟内扩展到 13 万个 Pod，并维持高达每秒 1,000 个 Pod 的吞吐量。 Kueue 根据优先级动态分配资源，展示了 GKE 的弹性和资源重新分配能力。"
  },
  {
    "id": "46032148",
    "title": "Fifty Shades of OOP",
    "url": "https://lesleylai.info/en/fifty_shades_of_oop/",
    "summary": "\"Fifty Shades of OOP\" is an article that avoids outright defending or attacking Object-Oriented Programming (OOP), instead aiming to provide a nuanced view by examining its core ideas individually. The author argues that the term \"OOP\" is used so broadly that productive conversations are difficult, and proposes treating it as a collection of interrelated concepts.\n\nThe article then surveys aspects of OOP, including:\n\n*   **Classes:** Building on structs with methods, information hiding, and inheritance. Prototypes are presented as an alternative.\n*   **Method Syntax:** A useful convention for operations on specific data, aiding IDE autocompletion and chaining. Downsides include limitations on definition outside of classes, implicit `this` pointers, and potential conflicts with free functions.\n*   **Information Hiding:** Preventing invariant violation and separating stable interfaces. Drawbacks include potential boilerplate and abstraction inversion.\n*   **Encapsulation:** Bundling data and functions. Alternatives like closures and module systems exist. Data-oriented design offers a coarser-grained alternative focusing on efficient data processing.\n*   **Interfaces:** Promoting separation of interface and implementation, supporting polymorphism. Can have runtime costs, but not always.\n*   **Late Binding:** Deferring method/member lookup to runtime, enabling hot-reloading but impacting performance and introducing potential errors.\n*   **Dynamic Dispatch:** Selecting polymorphic operations at runtime, often implemented with virtual function tables. Can cause performance issues due to inlining limitations and cache misses.\n*   **Inheritance:** The most iconic OOP feature, enabling dynamic dispatch, subtyping, interface segregation, and code reuse. Criticized for being non-orthogonal, imposing performance costs, unsound subtyping implementation, and rigidity.\n*   **Subtyping Polymorphism:** Defining \"is a\" relationships between types. Supported by OOP through inheritance, but also by other constructs.\n",
    "chinese_title": "面向对象编程的五十道阴影",
    "chinese_summary": "《面向对象编程的五十度灰》是一篇避免直接捍卫或攻击面向对象编程(OOP)的文章，而是旨在通过单独审视其核心思想来提供一个细致的视角。作者认为，“OOP”一词的使用过于宽泛，导致富有成效的对话变得困难，并建议将其视为一系列相互关联的概念的集合。\n\n文章随后考察了OOP的各个方面，包括：\n\n*   **类：** 基于带有方法、信息隐藏和继承的结构体。原型被呈现为一种替代方案。\n*   **方法语法：** 一种用于对特定数据进行操作的有用约定，有助于IDE自动完成和链式调用。缺点包括在类外部定义的限制、隐式的`this`指针以及与自由函数的潜在冲突。\n*   **信息隐藏：** 防止违反不变式并分离稳定的接口。缺点包括潜在的样板代码和抽象反转。\n*   **封装：** 捆绑数据和函数。存在诸如闭包和模块系统之类的替代方案。面向数据的设计提供了一种更粗粒度的替代方案，专注于高效的数据处理。\n*   **接口：** 促进接口和实现的分离，支持多态。可能会有运行时成本，但并非总是如此。\n*   **延迟绑定：** 将方法/成员查找推迟到运行时，从而实现热重载，但会影响性能并引入潜在错误。\n*   **动态分派：** 在运行时选择多态操作，通常使用虚函数表实现。由于内联限制和缓存未命中，可能导致性能问题。\n*   **继承：** 最具标志性的OOP特性，支持动态分派、子类型化、接口隔离和代码重用。因其非正交性、强加的性能成本、不健全的子类型化实现以及刚性而受到批评。\n*   **子类型多态：** 定义类型之间的“是”关系。通过继承受到OOP的支持，但也受到其他构造的支持。"
  },
  {
    "id": "46005910",
    "title": "How did the Win 95 user interface code get brought to the Windows NT code base?",
    "url": "https://devblogs.microsoft.com/oldnewthing/20251028-00/?p=111733",
    "summary": "The article explains how the Windows 95 user interface was integrated into the Windows NT 4.0 codebase, highlighting the challenges and strategies employed.\n\nFor window manager features, the Windows NT team reimplemented the Windows 95 code as a reference, leveraging the shared ancestry from Windows 3.1 while adapting to the already diverged codebases. This was a one-way port from Windows 95 to Windows NT.\n\nFor Explorer and other user-mode components, the Windows 95 code was taken \"as-is\" and then modified in-place to suit the Windows NT environment, specifically adapting to Unicode. This led to the creation of Unicode variants of interfaces, like IShellLinkA and IShellLinkW. This was a bidirectional process, with changes made by the Windows NT team being merged back into the Windows 95 codebase to avoid redundant fixes.\n\nTo ensure stability in the Windows 95 code, the Windows NT team used techniques like `#ifdef WINNT` directives, macros like `TCHAR`, and the `SIZEOF` macro. `SIZEOF` served as an indicator of whether a `sizeof` call had been reviewed for Windows NT compatibility, aiding in the identification of areas still requiring inspection.\n\nThe merging process was complex due to the limitations of Microsoft's internal source code system, SLM, which didn't support branching. This required manually merging changes between codebases. The Windows NT team, including Dave Plummer, even had custom \"You have been visited\" calling cards made.\n",
    "chinese_title": "Win 95的用户界面代码是如何引入到Windows NT代码库中的？",
    "chinese_summary": "本文阐述了Windows 95用户界面如何集成到Windows NT 4.0代码库中，并重点介绍了所面临的挑战和采用的策略。\n\n对于窗口管理器功能，Windows NT团队重新实现了Windows 95的代码作为参考，利用了Windows 3.1的共同血统，同时适应了已经分化的代码库。 这是一个从Windows 95到Windows NT的单向移植。\n\n对于资源管理器和其他用户模式组件，Windows 95的代码被“原样”采用，然后在适当的位置进行修改，以适应Windows NT环境，特别是适应Unicode。 这导致了诸如IShellLinkA和IShellLinkW等接口的Unicode变体的创建。这是一个双向过程，Windows NT团队所做的更改会被合并回Windows 95代码库中，以避免冗余修复。\n\n为了确保Windows 95代码的稳定性，Windows NT团队使用了诸如`#ifdef WINNT`指令、`TCHAR`等宏以及`SIZEOF`宏等技术。 `SIZEOF`用于指示是否已针对Windows NT兼容性审查了`sizeof`调用，从而有助于识别仍需要检查的区域。\n\n由于微软内部源代码系统SLM不支持分支，合并过程非常复杂。 这需要手动合并代码库之间的更改。 Windows NT团队，包括Dave Plummer，甚至制作了定制的“你已被访问”名片。"
  },
  {
    "id": "45989284",
    "title": "Inside Rust's std and parking_lot mutexes – who wins?",
    "url": "https://blog.cuongle.dev/p/inside-rusts-std-and-parking-lot-mutexes-who-win",
    "summary": "This article dives deep into the implementations of `std::sync::Mutex` and `parking_lot::Mutex` in Rust to determine their performance characteristics and when to choose one over the other.\n\nThe author explains that `std::sync::Mutex` leverages platform-specific mutex implementations, often using futexes (fast userspace mutexes) where available. Futexes rely on atomic operations and kernel-managed wait queues for efficiency. A unique feature is poisoning, where the mutex becomes unusable if a thread panics while holding it, preventing data corruption.\n\n`parking_lot::Mutex` takes a different approach, using a single algorithm across all platforms and managing its own wait queues in user space via a global hash table. This allows it to use a single byte for its mutex state, unlike `std`'s larger AtomicU32 (required by kernel alignment for futex queues). It implements eventual fairness to prevent thread starvation by using a timer that, every ~0.5ms, forces the lock to be handed off to the longest waiting thread.\n\nBenchmark results show that `std` generally performs better under moderate contention with short critical sections due to its efficient kernel-managed queues. However, `parking_lot` provides more even work distribution. Under heavy contention with long hold times, `parking_lot` often surpasses `std` in throughput and latency.\n",
    "chinese_title": "Rust标准库和parking_lot互斥锁的内部机制——谁更胜一筹？",
    "chinese_summary": "本文深入探讨Rust中`std::sync::Mutex`和`parking_lot::Mutex`的实现，以确定它们的性能特征以及何时选择其中一个。\n\n作者解释说，`std::sync::Mutex`利用平台特定的互斥锁实现，通常在使用futexes（快速用户空间互斥锁）的地方。Futexes依赖于原子操作和内核管理的等待队列以提高效率。一个独特的特性是中毒，如果一个线程在持有互斥锁时发生panic，互斥锁将变得不可用，从而防止数据损坏。\n\n`parking_lot::Mutex`采取了一种不同的方法，在所有平台上使用单一算法，并通过全局哈希表在用户空间中管理自己的等待队列。这使得它可以使用单个字节作为其互斥锁状态，不像`std`的更大的AtomicU32（内核对futex队列对齐所需）。它实现了最终公平性，通过使用一个定时器（每约0.5毫秒）强制将锁传递给等待时间最长的线程，以防止线程饥饿。\n\n基准测试结果表明，由于其高效的内核管理队列，`std`在具有短临界区的中等争用下通常表现更好。然而，`parking_lot`提供了更均匀的工作分配。在具有长持有时间的大量争用下，`parking_lot`通常在吞吐量和延迟方面超越`std`。"
  },
  {
    "id": "46038143",
    "title": "PS5 now costs less than 64GB of DDR5 memory. RAM jumps to $600 due to shortage",
    "url": "https://www.tomshardware.com/pc-components/ddr5/64gb-of-ddr5-memory-now-costs-more-than-an-entire-ps5-even-after-a-discount-trident-z5-neo-kit-jumps-to-usd600-due-to-dram-shortage-and-its-expected-to-get-worse-into-2026",
    "summary": "The article highlights the alarming surge in DDR5 RAM prices due to the AI boom, which is consuming a significant portion of the memory and storage supply. A 64GB kit of G.Skill Trident Z5 Neo RAM, priced at $599.99, now costs more than a PS5 Slim or an Xbox Series S. This price represents a near 190% increase in just two months, escalating from its usual $205-$220 range.\n\nThe price hikes began coinciding with increased industry awareness of the AI crunch's impact on memory pricing. Experts predict that DRAM and NAND constraints will persist until 2026 as Big Tech focuses on AGI development. Consequently, hard drives are becoming scarce, leading to increased demand for microSD cards and QLC SSDs. Some distributors are even bundling memory and motherboards to navigate the global shortage. The article mentions that even Valve's upcoming Steam Machine will be affected by this DRAM crisis, leading to higher costs.\n\nThe author suggests that this memory price rollercoaster may swing back to bargain prices around 2027, as manufacturers historically oversupply after periods of undersupply. The piece concludes by encouraging readers to stay informed on the latest tech news and offers perspectives from forum commenters.\n",
    "chinese_title": "PS5现价低于64GB DDR5内存，内存短缺致价格飙升至600美元。",
    "chinese_summary": "人工智能热潮导致DDR5内存价格飙升：G.Skill 64GB套装价格已超PS5 Slim或Xbox Series S。"
  },
  {
    "id": "46010540",
    "title": "Using Antigravity for Statistical Physics in JavaScript",
    "url": "https://christopherkrapu.com/blog/2025/antigravity-stat-mech/",
    "summary": "The author explores the capabilities of Google's new Antigravity IDE (based on Windsurf) and Gemini 3 Pro by using it to create a JavaScript-based visualization of the Ising model of ferromagnetism. The author, who previously used hidden benchmark questions involving obscure internet figures to test LLMs, has shifted focus to statistical physics visualizations in JavaScript.\n\nThe Ising model, a mathematical representation of ferromagnetism, is described with its core equation and simulation method: a Random Scan Gibbs Sampler updates randomly chosen spins based on the Boltzmann distribution influenced by neighbors and an external field.\n\nThe author highlights that Antigravity, combined with Gemini 3 Pro, produced decent results in an hour, and specifically praises the Chrome browser extension for retrieving the DOM as a helpful feature. While some UI features like subtask and intermediate step displays were deemed less crucial, the author concludes with a positive assessment of Antigravity and its underlying technology, acknowledging the efforts of the former Windsurf team and Google staff. The author also anticipates similar functionalities will be integrated into competing IDEs like Cursor.\n",
    "chinese_title": "使用反重力进行 JavaScript 统计物理模拟",
    "chinese_summary": "作者探索了谷歌新款反重力 IDE (基于 Windsurf) 和 Gemini 3 Pro 的性能，通过使用它创建了一个基于 JavaScript 的铁磁性伊辛模型可视化。作者之前使用涉及晦涩互联网人物的隐藏基准问题来测试 LLM，现在已将重点转向 JavaScript 中的统计物理可视化。\n\n伊辛模型，一种铁磁性的数学表示，被描述了其核心方程和模拟方法：随机扫描吉布斯采样器基于受邻居和外场影响的玻尔兹曼分布更新随机选择的自旋。\n\n作者强调，反重力 IDE 与 Gemini 3 Pro 相结合，在一小时内产生了不错的结果，并特别赞扬了 Chrome 浏览器扩展程序检索 DOM 的功能。虽然一些 UI 功能，如子任务和中间步骤显示，被认为不太重要，但作者对反重力 IDE 及其底层技术给出了积极的评价，并肯定了前 Windsurf 团队和谷歌员工的努力。作者还预计类似的功能将被集成到竞争 IDE 中，如 Cursor。"
  },
  {
    "id": "46029929",
    "title": "Japan's gamble to turn island of Hokkaido into global chip hub",
    "url": "https://www.bbc.com/news/articles/c8676qpxgnqo",
    "summary": "Japan is making a significant investment to transform Hokkaido into a global semiconductor hub, aiming to revive its chip-making capabilities after decades of decline. The centerpiece of this effort is Rapidus, a government-backed company building a state-of-the-art chip foundry in Chitose, with the goal of mass-producing 2nm chips by 2027.\n\nThe government has invested heavily in Rapidus, and the company has partnered with IBM and other global firms to gain necessary technology. Rapidus has already achieved a breakthrough by producing a 2nm prototype. Despite this progress, challenges remain, including securing sufficient funding, acquiring essential know-how, and establishing a customer base in a highly competitive market dominated by TSMC and Samsung.\n\nJapan's broader strategy involves attracting major global players like TSMC, which is already producing chips in Kyushu, and creating a thriving ecosystem of suppliers and related industries. Government backing extends to other domestic players like Kioxia and Toshiba, along with attracting investment from foreign firms such as Micron and Samsung.\n\nWhile Japan faces hurdles like a shrinking population, a shortage of engineers, and the need to rely on foreign workers, the government is committed to reviving its semiconductor industry and securing its tech power. Rapidus aims to differentiate itself by offering faster production of custom chips, capitalizing on the surging global demand driven by AI and the need for secure, domestically sourced supply chains. The success of this \"Hokkaido Valley\" initiative is seen as a crucial step in restoring Japan's position as a major player in the global semiconductor market.\n",
    "chinese_title": "日本豪赌将北海道打造为全球芯片中心",
    "chinese_summary": "日本大力投资将北海道打造为全球半导体中心，旨在重振其衰落数十年的芯片制造能力。这项工作的核心是政府支持的Rapidus公司，该公司正在千岁市建设一座最先进的芯片代工厂，目标是在2027年实现2纳米芯片的量产。\n\n政府已对Rapidus进行了大量投资，该公司还与IBM和其他全球公司合作以获取必要的技术。Rapidus已经通过生产2纳米原型取得了突破。尽管取得了这些进展，仍然存在挑战，包括获得足够的资金，获取必要的专业知识，以及在由台积电和三星主导的高度竞争的市场中建立客户群。\n\n日本更广泛的战略包括吸引台积电等主要全球参与者（该公司已经在九州生产芯片），并创建一个蓬勃发展的供应商和相关产业生态系统。政府的支持范围扩大到其他国内企业，如铠侠和东芝，以及吸引美光和三星等外国公司的投资。\n\n尽管日本面临人口萎缩、工程师短缺以及需要依赖外国工人等障碍，但政府致力于重振其半导体产业，确保其科技实力。Rapidus的目标是通过更快地生产定制芯片来脱颖而出，利用人工智能驱动的全球需求激增以及对安全、国内采购的供应链的需求。这项“北海道硅谷”计划的成功被认为是恢复日本作为全球半导体市场主要参与者地位的关键一步。"
  },
  {
    "id": "46029908",
    "title": "The Cloudflare outage might be a good thing",
    "url": "https://gist.github.com/jbreckmckye/32587f2907e473dd06d68b0362fb0048",
    "summary": "This article argues that the recent Cloudflare outage, while disruptive, serves as a crucial wake-up call about the increasing centralization and fragility of the internet. The outage, triggered by a mundane config file issue, exposed how reliant essential services have become on a single point of failure. The author highlights the irony that the internet, initially designed for decentralization and resilience, has evolved into a system heavily dependent on a few key providers like Cloudflare and AWS.\n\nThe author uses the anecdote of a friend unable to get air for their tires due to the outage to illustrate how deeply intertwined digital infrastructure is with everyday life. From banking and retail to government services and even filling up tires, our society is increasingly mediated through the internet, making it vulnerable to widespread disruptions when centralized services fail.\n\nThe article draws a parallel to the COVID-19 pandemic and its impact on global supply chains, arguing that the pursuit of lean and efficient systems led to vulnerabilities exposed during the crisis. Just as businesses learned to diversify and build slack into their supply chains, the author urges organizations and governments to create redundancies and offline alternatives for critical services.\n\nThe author concludes that outages like the Cloudflare one, while inconvenient, are valuable warnings. They highlight the dangers of relying on a small number of providers and encourage the development of more resilient, decentralized systems capable of withstanding future disruptions, including potential cyberattacks or failures within key infrastructure providers. The call to action is to embrace outages as learning opportunities and proactively build redundancy into our digital infrastructure.\n",
    "chinese_title": "Cloudflare宕机也许是件好事",
    "chinese_summary": "这次Cloudflare中断事件虽然具有破坏性，但它也敲响了重要的警钟，提醒人们互联网日益中心化和脆弱。这次中断由一个普通的配置文件问题引发，暴露了关键服务对单一故障点的依赖程度。作者强调了这种讽刺现象，即最初为分散性和弹性而设计的互联网，已经演变成一个严重依赖Cloudflare和AWS等少数关键提供商的系统。\n\n作者用朋友因中断而无法给轮胎充气的轶事来说明数字基础设施与日常生活的紧密联系。从银行、零售到政府服务，甚至轮胎充气，我们的社会越来越依赖互联网，一旦中心化服务出现故障，就会容易受到广泛的干扰。\n\n文章将此事与COVID-19大流行及其对全球供应链的影响进行了比较，认为对精益高效系统的追求导致了危机期间暴露出来的漏洞。正如企业学会多元化并建立供应链缓冲一样，作者敦促组织和政府为关键服务创建冗余和离线替代方案。\n\n作者总结说，像Cloudflare这样的中断虽然不便，但却是宝贵的警告。它们突显了依赖少数提供商的危险，并鼓励开发更具弹性、分散的系统，以便能够承受未来的中断，包括潜在的网络攻击或关键基础设施提供商内部的故障。行动呼吁是将中断视为学习机会，并主动在我们的数字基础设施中建立冗余。"
  },
  {
    "id": "46001920",
    "title": "Show HN: Datamorph – A clean JSON ⇄ CSV converter with auto-detect",
    "url": "https://datamorphio.vercel.app",
    "summary": "Datamorph, presented by DatumInt, is a free online tool designed for instant and clean conversion between JSON and CSV file formats. The tool boasts auto-detection capabilities, streamlining the conversion process. Users can quickly convert JSON files to CSV format and vice versa without needing to manually specify delimiters or other formatting parameters. The implication is that it offers a user-friendly experience focused on efficiency and accessibility for data conversion tasks.\n",
    "chinese_title": "Show HN: Datamorph – 自动检测的简洁 JSON ⇄ CSV 转换器",
    "chinese_summary": "Datamorph，DatumInt 出品，是一款免费的在线工具，旨在实现 JSON 和 CSV 文件格式之间的即时、简洁转换。该工具具备自动检测功能，简化了转换过程。用户可以快速地将 JSON 文件转换为 CSV 格式，反之亦然，无需手动指定分隔符或其他格式参数。这意味着它提供了一种用户友好的体验，专注于数据转换任务的效率和可访问性。"
  },
  {
    "id": "46013132",
    "title": "Serflings is a remake of The Settlers 1",
    "url": "https://www.simpleguide.net/serflings.xhtml",
    "summary": "\"Serflings\" is a remake of the classic strategy game \"The Settlers 1\" (also known as \"Serf City\"), aiming to replicate the original experience while adding enhancements like higher resolutions and network play. To run the game, you need to copy a specific data file (SPAE.PA, SPAD.PA, or SPAF.PA) from the original \"Settlers 1\" game files unless you have the History Edition installed in the default directory. The game will search several locations for these files.\n\nThe remake is compatible with both DOS and History Edition versions of the game files. It offers features like all trainings, missions, AI, saving/loading (including original savegame support), and supports multiple languages. Additional features include smooth scrolling, zoom, automatic pathfinding, network play (1v1), work radius indication, configurable controls, game speed adjustments, and saved mission progress.\n\nCurrently missing features from the original include replacing existing buildings, timers for menus/buildings, scrolling while building paths, message customization, tooltips and more advanced network play.\n\nThe article provides download links for stable and development versions, both with and without integrated Java runtime (Java 17 required for versions without). There are also links to Discord, Facebook, and Steam to stay updated. You can report bugs or request features on Github. The latest stable version is 2.1.1 (January 20, 2025) and the latest development version is 2.2.0-SNAPSHOT (September 24, 2025).\n",
    "chinese_title": "Serflings是《工人物语1》的重制版。",
    "chinese_summary": "《农奴时代》是经典策略游戏《 settlers 1》（又名《农奴之城》）的重制版，旨在还原原作体验，并增加更高分辨率和网络对战等增强功能。要运行该游戏，您需要从原始《 settlers 1》游戏文件中复制特定的数据文件 (SPAE.PA, SPAD.PA, 或 SPAF.PA)，除非您已将历史典藏版安装在默认目录中。游戏将在多个位置搜索这些文件。\n\n该重制版与游戏的 DOS 和历史典藏版游戏文件兼容。它提供所有训练、任务、AI、保存/加载（包括原始存档支持）等功能，并支持多种语言。其他功能包括平滑滚动、缩放、自动寻路、网络对战（1v1）、工作半径指示、可配置的控制、游戏速度调整和保存的任务进度。\n\n目前，原作中缺失的功能包括替换现有建筑物、菜单/建筑物的计时器、建造路径时的滚动、消息自定义、工具提示和更高级的网络对战。\n\n文章提供了稳定版和开发版的下载链接，均提供带和不带集成 Java 运行时 (没有集成则需要 Java 17)的版本。还有 Discord、Facebook 和 Steam 的链接，以便及时了解最新动态。您可以在 Github 上报告错误或请求功能。最新稳定版是 2.1.1 (2025 年 1 月 20 日)，最新开发版是 2.2.0-SNAPSHOT (2025 年 9 月 24 日)。"
  },
  {
    "id": "46024402",
    "title": "Bytes before FLOPS: your algorithm is (mostly) fine, your data isn't",
    "url": "https://www.bitsdraumar.is/bytes-before-flops/",
    "summary": "David Miličević's article \"Bytes before FLOPS\" emphasizes data-oriented optimization as the key to improving performance. He argues that focusing on efficient data handling often yields greater improvements than optimizing algorithms alone.\n\nThe article outlines a step-by-step approach:\n\n1.  **Profile:** Identify bottlenecks through profiling, often revealing unexpected areas of concern.\n2.  **Specialize the Algorithm:** Tailor algorithms to the specific data being processed, removing unnecessary generality for performance gains.\n3.  **Make it Cache Friendly:** Optimize data access patterns for cache efficiency by accessing nearby or recently accessed data, reordering structure members and considering techniques like non-temporal writes. Type compression helps keep more data in cache.\n4.  **Make it SIMD:** Vectorize the algorithm by processing data in parallel using SIMD instructions. Rearrange data into SoA or AoSoA structures.\n5.  **Make it Parallel:** Parallelize independent data processing streams using tools like OpenMP or Rayon, while addressing false sharing with padding.\n\nThe article stresses the importance of understanding data flow, memory access, and cache behavior. It highlights that optimizing data layout and access patterns can lead to significant speedups, often exceeding the benefits of pure algorithmic optimization. It also briefly discusses the suitability of different programming languages for data-intensive tasks, favoring systems languages like C/C++/Rust for optimal control over data layout and memory management, whilst also offering resources and tools for performance analysis and data-oriented design.\n",
    "chinese_title": "内存带宽瓶颈：你的算法问题不大，数据有问题",
    "chinese_summary": "David Miličević的文章《Bytes before FLOPS》强调以数据为导向的优化是提高性能的关键。他认为，专注于高效的数据处理通常比仅仅优化算法能带来更大的改进。\n\n文章概述了一个循序渐进的方法：\n\n1.  **分析（Profile）：** 通过性能分析识别瓶颈，通常会揭示意想不到的问题区域。\n2.  **算法特化（Specialize the Algorithm）：** 根据正在处理的特定数据定制算法，消除不必要的通用性以提高性能。\n3.  **缓存友好化（Make it Cache Friendly）：** 通过访问附近或最近访问的数据来优化数据访问模式，从而提高缓存效率，包括重新排列结构成员并考虑非临时写入等技术。类型压缩有助于在缓存中保存更多数据。\n4.  **SIMD化（Make it SIMD）：** 使用SIMD指令并行处理数据，实现算法的向量化。将数据重新排列成SoA或AoSoA结构。\n5.  **并行化（Make it Parallel）：** 使用OpenMP或Rayon等工具并行处理独立的数据流，同时使用填充解决伪共享问题。\n\n文章强调了理解数据流、内存访问和缓存行为的重要性。它强调优化数据布局和访问模式可以带来显著的加速，通常超过纯算法优化的好处。文章还简要讨论了不同编程语言对数据密集型任务的适用性，倾向于使用C/C++/Rust等系统语言来获得对数据布局和内存管理的最佳控制，同时也提供了性能分析和数据导向设计的资源和工具。"
  },
  {
    "id": "45980608",
    "title": "The only GM EV1 ever publicly sold",
    "url": "https://www.theautopian.com/how-the-only-gm-ev1-ever-sold-didnt-get-crushed-and-where-its-going-now/",
    "summary": "In October 2025, Brian Silvestro reported on the wild story behind VIN #4G5PX2250V0200212, the only GM EV1 ever publicly sold. This EV1, originally leased in 1997, was meant to be crushed like most others due to low demand and high costs. Jonathan Sawyer, the original lessee, explained that his lawsuit against GM may have saved it from the crusher.\n\nThe car ended up abandoned at Clark Atlanta University and was subsequently towed. In a surprising turn of events, the tow pound auctioned off the EV1, which was purchased by an anonymous EV enthusiast named Billy for over $118,000. Billy, who plans to open an electric car museum, is now undertaking a full restoration of the EV1.\n\nThe EV1 was a groundbreaking electric car in the 1990s, leased primarily in Southern states due to battery limitations. Despite its low horsepower, it featured innovations like regenerative braking and an aerodynamic design. GM recalled and crushed most EV1s, donating only a few to museums and universities. Billy's EV1 is a unique case, having survived a series of legal and logistical oddities.\n\nThe restoration process will be challenging due to missing parts, including the battery pack and a driveline control module. Billy is seeking assistance from the EV1 community and aims to have the car running by November 2026, the 30th anniversary of the EV1's initial drive.\n",
    "chinese_title": "唯一公开出售的通用EV1",
    "chinese_summary": "2025年10月，布莱恩·西尔维斯特罗报道了车架号为4G5PX2250V0200212（唯一一辆公开出售的通用EV1）背后离奇的故事。这辆EV1最初于1997年出租，由于需求低迷和成本高昂，本应像大多数其他EV1一样被压碎。最初的承租人乔纳森·索耶解释说，他对通用汽车的诉讼可能使其免于被销毁。\n\n这辆车最终被遗弃在克拉克亚特兰大大学，随后被拖走。令人惊讶的是，拖车场拍卖了这辆EV1，一位名叫比利的不愿透露姓名的电动汽车爱好者以超过11.8万美元的价格购买了它。比利计划开设一家电动汽车博物馆，目前正在对这辆EV1进行全面修复。\n\nEV1是20世纪90年代一款具有开创性的电动汽车，由于电池的限制，主要在南方各州租赁。尽管马力较低，但它具有再生制动和空气动力学设计等创新功能。通用汽车召回并压碎了大部分EV1，仅向博物馆和大学捐赠了少数。比利的EV1是一个独特的案例，在经历了一系列法律和后勤方面的怪事后幸存了下来。\n\n由于缺少零件，包括电池组和传动系统控制模块，修复过程将充满挑战。比利正在寻求EV1社区的帮助，并计划在2026年11月，即EV1首次行驶30周年之际，让这辆车重新运行。"
  },
  {
    "id": "46042529",
    "title": "Eggroll: Novel general-purpose machine learning algorithm provides 100x speed",
    "url": "https://eshyperscale.github.io/",
    "summary": "EGGROLL, or Evolution Guided General Optimization via Low-rank Learning, is a novel machine learning algorithm that achieves a hundredfold increase in training speed compared to naive evolution strategies (ES), making large-scale model training, including LLMs, more practical. It bridges the gap between inference and training by enabling efficient fine-tuning and training of new architectures from scratch.\n\nEGGROLL uses a low-rank matrix perturbation technique to reduce computational and memory costs associated with traditional ES, enabling efficient scaling to large population sizes for models with billions of parameters. This technique reduces auxiliary storage and forward pass costs, leading to significant training throughput improvements, nearly matching the speed of pure batch inference.\n\nThe algorithm's effectiveness is demonstrated through several experiments: it performs comparably to ES in reinforcement learning settings, competes with GRPO in improving LLM reasoning, and enables stable pre-training of nonlinear recurrent language models operating purely on integer datatypes (dubbed \"EGG\"). The researchers showcase EGGROLL's capabilities by training an EGG model on the MiniPile dataset with impressive results, even when removing all activation functions. They also demonstrate its effectiveness in fine-tuning RWKV-7 language models for reasoning tasks, outperforming existing methods like GRPO.\n\nThe authors have released code, a research paper, and a single-file implementation of pure int8 language model training to encourage community contributions. They are actively working on scaling EGGROLL to larger population sizes and exploring its application to other language model architectures and neurosymbolic systems.\n",
    "chinese_title": "蛋卷：新型通用机器学习算法速度提升100倍",
    "chinese_summary": "EGGROLL，即通过低秩学习的进化引导通用优化，是一种新型机器学习算法，与朴素进化策略 (ES) 相比，其训练速度提高了百倍，从而使包括 LLM 在内的大规模模型训练更具实用性。它通过实现高效的微调和从头开始训练新架构，弥合了推理和训练之间的差距。\n\nEGGROLL 使用低秩矩阵扰动技术来降低与传统 ES 相关的计算和内存成本，从而能够有效地扩展到具有数十亿参数的模型的大种群规模。该技术降低了辅助存储和前向传递成本，从而显著提高训练吞吐量，几乎与纯批量推理的速度相匹配。\n\n该算法的有效性通过几个实验得到证明：它在强化学习设置中与 ES 表现相当，在改进 LLM 推理方面与 GRPO 竞争，并且能够稳定地预训练纯粹基于整数数据类型运行的非线性循环语言模型（称为“EGG”）。研究人员通过在 MiniPile 数据集上训练一个 EGG 模型，取得了令人印象深刻的结果，即使移除所有激活函数也是如此，从而展示了 EGGROLL 的能力。他们还展示了它在微调 RWKV-7 语言模型以执行推理任务方面的有效性，优于 GRPO 等现有方法。\n\n作者已经发布了代码、研究论文和纯 int8 语言模型训练的单文件实现，以鼓励社区贡献。他们正在积极努力将 EGGROLL 扩展到更大的种群规模，并探索其在其他语言模型架构和神经符号系统中的应用。"
  },
  {
    "id": "46043354",
    "title": "Show HN: We cut RAG latency ~2× by switching embedding model",
    "url": "https://www.myclone.is/blog/voyage-embedding-migration/",
    "summary": "MyClone.is improved the performance and cost-effectiveness of its RAG-based digital persona platform by switching from OpenAI's `text-embedding-3-small` (1536 dimensions) to Voyage-3.5-lite (512 dimensions). This change resulted in a ~66% reduction in vector database storage, a 2-2.5x improvement in retrieval latency, and a 15-20% reduction in end-to-end voice latency.\n\nThe switch was motivated by the high storage and computational costs associated with high-dimensional embeddings in large-scale RAG systems. Voyage-3.5-lite, leveraging Matryoshka Representation Learning (MRL), maintains comparable or even better retrieval quality with significantly fewer dimensions, making it ideal for latency-sensitive applications.\n\nThe improved retrieval speed directly enhanced the user experience, particularly in voice interactions, by reducing the \"robotic pause\" between turns. The shift also translated into lower infrastructure costs, allowing MyClone to scale more efficiently and reinvest resources into richer features.\n\nThe article emphasizes that embedding choice is a crucial product decision, and models optimized for retrieval quality, flexible dimensions, and quantization, like Voyage-3.5-lite, will become increasingly important for latency-sensitive, knowledge-heavy applications. MyClone achieved better UX, lower costs, and future flexibility by strategically selecting an embedding model aligned with the specific needs of its RAG system.\n",
    "chinese_title": "展示HN：通过切换嵌入模型，我们将RAG延迟降低了约2倍",
    "chinese_summary": "MyClone通过将基于RAG的数字人平台从OpenAI的`text-embedding-3-small`（1536维）切换到Voyage-3.5-lite（512维），提高了性能和性价比。 这项变更使向量数据库存储减少了约66%，检索延迟提高了2-2.5倍，端到端语音延迟降低了15-20%。\n\n切换的原因是大型RAG系统中高维嵌入带来的高存储和计算成本。 Voyage-3.5-lite利用Matryoshka Representation Learning (MRL)，以显著更少的维度保持了相当甚至更好的检索质量，使其成为对延迟敏感的应用的理想选择。\n\n检索速度的提高直接增强了用户体验，尤其是在语音交互中，减少了轮次之间的“机械停顿”。 这一转变也转化为更低的的基础设施成本，使MyClone能够更有效地扩展，并将资源重新投入到更丰富的功能中。\n\n文章强调，嵌入选择是一项关键的产品决策，像Voyage-3.5-lite这样针对检索质量、灵活维度和量化进行优化的模型，对于延迟敏感、知识密集型应用将变得越来越重要。 MyClone通过战略性地选择与RAG系统的特定需求相一致的嵌入模型，实现了更好的用户体验、更低的成本和未来的灵活性。"
  },
  {
    "id": "45985306",
    "title": "I built a faster Notion in Rust",
    "url": "https://imedadel.com/outcrop/",
    "summary": "Imed built Outcrop, a faster Notion alternative in Rust, driven by frustration with existing knowledge base solutions. Inspired by Stripe's internal knowledge base success and recognizing the timing with Atlassian's sunsetting Data Center, Imed aimed for speed and simplicity.\n\nInitially prototyping in Go, Imed encountered boilerplate code overload, leading to a switch to Rust. Rust's macro crates enabled a reduction in code, addressing challenges like real-time collaboration, search latency, and access control. A key innovation is a lightweight, in-memory Zanzibar-inspired authorization system persisted to Postgres, offering fast permission checks. The search engine leverages tantivy and incorporates language detection with whatlang, ensuring only accessible resources are considered.\n\nCollaboration is handled via a custom port of prosemirror to Rust, improving document edit application speed. This enables efficient extraction of text, links, and mentions, paving the way for features like tab completion and structured suggestions powered by language models. Solid.js is integrated with prosemirror for the editor's UI.\n\nImed envisions Outcrop beyond just prose, encompassing diagrams, plots, and spreadsheets, with a focus on structured workflows and integrations with task management tools. The product is slated for launch within six months, priced around $10 per seat, with sponsorship options available.\n",
    "chinese_title": "我用 Rust 构建了一个更快的 Notion",
    "chinese_summary": "Imed 打造了 Outcrop，一个用 Rust 编写的更快 Notion 替代方案，源于对现有知识库解决方案的 frustレーション。 受 Stripe 内部知识库成功案例的启发，并意识到 Atlassian 即将停止 Data Center 服务的时机，Imed 旨在提供速度和简洁性。\n\n最初 Imed 使用 Go 进行原型设计，但遇到了大量的样板代码，因此切换到了 Rust。 Rust 的宏 crate 减少了代码量，解决了实时协作、搜索延迟和访问控制等挑战。 一项关键创新是受 Zanzibar 启发的轻量级内存授权系统，该系统持久化到 Postgres，可提供快速的权限检查。 搜索引擎利用 tantivy，并结合 whatlang 进行语言检测，确保只考虑可访问的资源。\n\n协作通过 Rust 版本的 prosemirror 自定义端口进行处理，提高了文档编辑应用程序的速度。 这使得能够有效地提取文本、链接和提及，为诸如标签补全和由语言模型驱动的结构化建议等功能铺平道路。 Solid.js 与 prosemirror 集成，用于编辑器的 UI。\n\nImed 设想 Outcrop 不仅仅局限于散文，还包括图表、绘图和电子表格，重点是结构化工作流程以及与任务管理工具的集成。 该产品预计在六个月内发布，定价约为每个席位 10 美元，并提供赞助选项。"
  },
  {
    "id": "46037324",
    "title": "TSMC Arizona outage saw fab halt, Apple wafers scrapped",
    "url": "https://www.culpium.com/p/tsmc-arizona-outage-saw-fab-halt",
    "summary": "In late September 2025, a power outage at a Linde industrial gas facility, a key vendor for TSMC, caused a halt in production at TSMC's Fab 21 in Arizona. This outage forced the company to scrap thousands of wafers in production for major clients like Apple, Nvidia, and AMD. While TSMC typically handles its own gas supply in Taiwan, it outsourced this function in Arizona.\n\nThe incident impacted TSMC's profitability in the third quarter, contributing to a significant drop in net income, although the company cited overall ramp-up costs for overseas fabs as a factor. While TSMC declined to comment directly on the outage, they acknowledged the influence of multiple factors on profit.\n\nThe financial impact on TSMC is expected to be partially covered by insurance, and the effect on clients is considered negligible due to the relatively small capacity of Fab 21 and the prior production of many products in Taiwan. TSMC is addressing the issue with Linde and emphasizing the need for operational improvements at overseas facilities.\n\nThis incident highlights the challenges Taiwanese manufacturers face when relying on non-Taiwanese firms at overseas facilities and underscores the importance of reliable supply chains. This isn't the first vendor issue that has caused shutdowns, with contaminations and a computer virus causing production delays in the past.\n",
    "chinese_title": "台积电亚利桑那州停电致工厂停产，苹果晶圆报废",
    "chinese_summary": "2025年9月下旬，台积电主要供应商林德工业气体公司的一家工厂发生断电事故，导致台积电位于亚利桑那州的Fab 21工厂停产。此次停电迫使该公司报废了数千片正在为苹果、英伟达和AMD等主要客户生产的晶圆。虽然台积电通常在台湾自行处理气体供应，但在亚利桑那州，它将这一功能外包。\n\n该事件影响了台积电第三季度的盈利能力，导致净利润大幅下降，不过该公司表示海外工厂的整体爬坡成本也是一个因素。虽然台积电拒绝直接评论此次断电事故，但他们承认多种因素对利润产生了影响。\n\n预计此次事件对台积电造成的财务影响将部分由保险承担，并且由于Fab 21的产能相对较小以及许多产品此前已在台湾生产，因此对客户的影响被认为是微乎其微的。台积电正在与林德公司解决该问题，并强调海外工厂需要进行运营改进。\n\n该事件凸显了台湾制造商在海外工厂依赖非台湾公司时面临的挑战，并强调了可靠供应链的重要性。这并非首次因供应商问题导致停产，过去曾因污染和计算机病毒导致生产延误。"
  },
  {
    "id": "46017972",
    "title": "Terence Tao: At the Erdos problem website, AI assistance now becoming routine",
    "url": "https://mathstodon.xyz/@tao/115591487350860999",
    "summary": "This article, based on a Mastodon post by Terence Tao, highlights the increasing use of AI assistance in solving mathematical problems, specifically within the context of the \"Erdos problem website.\" The post acknowledges the emergence of AI tools in this field. Because the original content is just Tao mentioning this on Mastodon, there isn't a deep dive into specifics. The key takeaway is the observation that AI is becoming a routine part of problem-solving processes, even on platforms like the Erdos problem website, implying a shift in how mathematical research and exploration are being conducted. The Mastodon post requires JavaScript to be enabled, suggesting the user interface may have interactive or dynamic elements related to the AI assistance. Also, it mentions using Mastodon apps as an alternative to the web version, hinting at mobile accessibility and perhaps tailored AI-integration features within those apps. Essentially, the article signals a noteworthy trend: the integration of AI into mathematical problem-solving, as observed by a prominent mathematician (Tao) on a social media platform.\n",
    "chinese_title": "陶哲轩：在埃尔德什问题网站，AI辅助正成为常态",
    "chinese_summary": "基于陶哲轩 Mastodon 帖文：AI 助力解决数学问题趋势渐显，Erdos 问题网站可见一斑。"
  },
  {
    "id": "46037416",
    "title": "Launch HN: Karumi (YC F25) – Personalized, agentic product demos",
    "url": "http://karumi.ai/",
    "summary": "Karumi AI (YC F25) offers personalized, agentic product demos available 24/7, aiming to close leads when interest is highest. The platform provides hyper-personalized demos that adapt to each customer's needs and context, ensuring they're always up-to-date. Karumi’s multilingual AI agents expand reach, and all interactions are logged into the CRM for follow-up.\n\nKarumi's solution aims to improve connection, demo delivery, and conversion rates, offering on-demand access through landing pages, in-app integrations, and outbound emails. Benefits include faster \"Aha!\" moments and scalable personalization without increasing headcount. Customer testimonials emphasize the platform's ability to capture more leads and strengthen sales funnels.\n\nKarumi’s use cases include qualifying leads, running tailored demos, providing personalized onboarding sessions, and offering support by answering questions and surfacing product features. The company highlights easy implementation and aims to convert missed inbound traffic into booked demos and conversions. Karumi is SOC 2 compliant and committed to data security and privacy.\n",
    "chinese_title": "发布HN：Karumi (YC F25) – 个性化、代理式产品演示",
    "chinese_summary": "Karumi AI (YC F25)：提供全天候个性化智能产品演示，旨在兴趣最高时促成交易。该平台提供根据客户需求和背景定制的高度个性化演示，确保信息始终最新。Karumi的多语种AI代理扩大了覆盖范围，所有互动都会记录到CRM中以供后续跟进。\n\nKarumi的解决方案旨在改善连接、演示交付和转化率，通过着陆页、应用内集成和外发邮件提供按需访问。优势包括更快的“顿悟”时刻和可扩展的个性化，无需增加员工人数。客户评价强调了该平台捕获更多潜在客户和加强销售渠道的能力。\n\nKarumi的应用场景包括筛选潜在客户、运行定制演示、提供个性化入职培训，以及通过回答问题和展示产品特性来提供支持。该公司强调易于实施，并旨在将错失的 inbound 流量转化为预订演示和转化。Karumi符合SOC 2标准，并致力于数据安全和隐私。"
  },
  {
    "id": "45981441",
    "title": "Slicing Is All You Need: Towards a Universal One-Sided Distributed MatMul",
    "url": "https://arxiv.org/abs/2510.08874",
    "summary": "This paper, titled \"Slicing Is All You Need: Towards A Universal One-Sided Algorithm for Distributed Matrix Multiplication,\" presents a novel approach to distributed matrix multiplication that aims to overcome the limitations of existing algorithms. The authors, Benjamin Brock and Renato Golin, propose a universal one-sided algorithm capable of supporting any combination of partitioning schemes and replication factors.\n\nThe core idea revolves around using \"slicing\" (index arithmetic) to determine the overlapping tiles that need to be multiplied together. This generates a list of local matrix multiplies which can then be executed directly or optimized through an intermediate representation (IR) to maximize overlap. The algorithm is implemented using a high-level C++-based PGAS programming framework, facilitating direct GPU-to-GPU communication using intra-node interconnects.\n\nThe key advantage of this algorithm is its universality, eliminating the need for multiple algorithm implementations for different partitioning strategies and avoiding costly data redistribution. The authors demonstrate the algorithm's performance across a wide range of partitioning and replication factors, showing that it is competitive with PyTorch DTensor, a highly optimized distributed tensor library used in AI models. The paper argues that this slicing-based approach provides a flexible and efficient solution for distributed matrix multiplication, suitable for various scientific, data analytics, and AI workloads.\n",
    "chinese_title": "切片足矣：迈向通用的单边分布式矩阵乘法",
    "chinese_summary": "题为“切片即万物：迈向通用单边分布式矩阵乘法算法”的论文提出了一种新的分布式矩阵乘法方法，旨在克服现有算法的局限性。作者 Benjamin Brock 和 Renato Golin 提出了一种通用单边算法，能够支持任意分区方案和复制因子的组合。\n\n核心思想围绕使用“切片”（索引算术）来确定需要相乘的重叠块。这会生成一个本地矩阵乘法列表，然后可以直接执行该列表，或者通过中间表示 (IR) 进行优化以最大化重叠。该算法使用基于 C++ 的高级 PGAS 编程框架实现，从而可以使用节点内互连促进直接的 GPU 到 GPU 通信。\n\n该算法的关键优势在于其通用性，无需为不同的分区策略实现多个算法，并避免了代价高昂的数据重新分发。作者展示了该算法在各种分区和复制因子下的性能，表明它与 PyTorch DTensor（一种用于 AI 模型的高度优化的分布式张量库）具有竞争力。该论文认为，这种基于切片的方法为分布式矩阵乘法提供了一种灵活高效的解决方案，适用于各种科学、数据分析和 AI 工作负载。"
  },
  {
    "id": "46046260",
    "title": "Voyager 1 approaches one light day from Earth",
    "url": "https://newatlas.com/space/voyager-approaches-1-light-day-from-earth/",
    "summary": "In November 2026, Voyager 1 will achieve a significant milestone: becoming the first spacecraft to be one light day away from Earth, meaning it will take 24 hours for a radio signal to reach it. Launched in 1977, Voyager 1 has journeyed far beyond the solar system after its initial flybys of Jupiter and Saturn. Currently, at approximately 15.7 billion miles from Earth, a one-way message takes roughly 23 hours and 32 minutes to reach the probe.\n\nThe article emphasizes the increasing communication delays inherent in deep space travel, contrasting the near-instantaneous communication we experience on Earth with the delays encountered with the Apollo Moon missions (2.6 seconds) and missions to Mars (up to four minutes). These delays necessitate a high degree of autonomy for robotic spacecraft.\n\nAlthough Voyager 1 is nearing the end of its operational lifespan due to its nuclear power source dwindling, it continues to function. Despite the challenges of communicating across such vast distances, NASA's Deep Space Network maintains contact with both Voyager 1 and its sister craft, Voyager 2 (currently at 19.5 light hours). The impending one light day milestone for Voyager 1 will require NASA engineers to exercise patience as commands will take two full days to be acknowledged by the distant probe.\n",
    "chinese_title": "旅行者1号逼近距离地球一日光程",
    "chinese_summary": "2026年11月，“旅行者1号”将达成一个重要里程碑：成为首个距离地球一个光天的航天器，这意味着无线电信号到达它需要24小时。“旅行者1号”于1977年发射，在最初飞越木星和土星后，已经远航至太阳系之外。目前，它距离地球约157亿英里，单向信息到达该探测器大约需要23小时32分钟。\n\n这篇文章强调了深空旅行中固有的通信延迟不断增加，将我们在地球上体验到的近乎瞬时的通信与阿波罗登月任务（2.6秒）和火星任务（最多四分钟）遇到的延迟进行了对比。这些延迟使得机器人航天器必须具备高度的自主性。\n\n尽管由于核动力源逐渐减少，“旅行者1号”已接近其运行寿命的尽头，但它仍在继续工作。尽管在如此遥远的距离进行通信面临挑战，但美国宇航局的深空网络仍与“旅行者1号”及其姊妹探测器“旅行者2号”（目前距离19.5光时）保持联系。“旅行者1号”即将迎来一个光天的里程碑，这将要求美国宇航局的工程师们保持耐心，因为指令需要整整两天才能得到这个遥远探测器的确认。"
  },
  {
    "id": "46010466",
    "title": "How sea turtles learn locations using Earth’s magnetic field: research",
    "url": "https://uncnews.unc.edu/2025/02/13/sea-turtles-secret-gps-researchers-uncover-how-sea-turtles-learn-locations-using-earths-magnetic-field/",
    "summary": "Researchers at the University of North Carolina at Chapel Hill have made significant progress in understanding how sea turtles learn and use the Earth's magnetic field to navigate. The research, published in *Current Biology*, demonstrates that sea turtles learn the magnetic signatures of important locations during their juvenile years. This is crucial for their ability to return to specific nesting beaches as adults, sometimes after migrating thousands of miles.\n\nThe study involved exposing juvenile sea turtles to different magnetic fields in a controlled environment and observing their swimming behavior. The researchers found that the turtles did not simply react instinctively to specific magnetic fields, but rather learned to associate certain magnetic signatures with desirable locations. This learning process likely occurs early in their lives as they explore coastal habitats.\n\nKey findings include:\n\n*   Sea turtles learn the magnetic signatures of specific locations, rather than simply responding instinctively to them.\n*   This learning likely occurs during their juvenile \"lost years\" phase in coastal habitats.\n*   This learned association between magnetic signatures and locations is vital for their ability to navigate back to nesting beaches.\n\nThis research provides valuable insights into the complex navigation abilities of sea turtles and highlights the importance of coastal habitats for their development. Understanding this learning mechanism is crucial for developing effective conservation strategies, particularly in the face of changing magnetic fields and habitat degradation.\n",
    "chinese_title": "海龟如何利用地球磁场学习定位：研究",
    "chinese_summary": "北卡罗来纳大学教堂山分校的研究人员在了解海龟如何学习和利用地球磁场进行导航方面取得了重大进展。这项发表在《当代生物学》上的研究表明，幼年海龟会学习重要位置的磁场特征。这对于它们成年后返回特定筑巢海滩的能力至关重要，有时需要迁徙数千英里。\n\n该研究包括在受控环境中将幼年海龟暴露于不同的磁场，并观察它们的游泳行为。研究人员发现，海龟并非仅仅本能地对特定磁场做出反应，而是学会将某些磁场特征与理想的位置联系起来。这种学习过程很可能发生在它们生命早期，当它们探索沿海栖息地时。\n\n主要发现包括：\n\n*   海龟学习特定位置的磁场特征，而不是仅仅本能地对它们做出反应。\n*   这种学习很可能发生在幼年海龟在沿海栖息地的“迷失之年”阶段。\n*   磁场特征与位置之间的这种学习关联对于它们导航回筑巢海滩的能力至关重要。\n\n这项研究为海龟复杂的导航能力提供了宝贵的见解，并强调了沿海栖息地对其发展的重要性。了解这种学习机制对于制定有效的保护策略至关重要，尤其是在面对不断变化的磁场和栖息地退化的情况下。"
  },
  {
    "id": "46046744",
    "title": "Polish antitrust watchdog investigates Apple over privacy policy",
    "url": "https://www.reuters.com/sustainability/boards-policy-regulation/polish-antitrust-watchdog-investigates-apple-over-privacy-policy-2025-11-25/",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "波兰反垄断监管机构调查苹果隐私政策",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "46014685",
    "title": "You can see a working Quantum Computer in IBM's London office",
    "url": "https://www.ianvisits.co.uk/articles/you-can-see-a-working-quantum-computer-in-ibms-london-office-85464/",
    "summary": "In a surprising display of futuristic technology, IBM has installed a working Quantum Computer, the IBM Quantum System One, at its London office in Waterloo. Launched in 2019, this circuit-based quantum computer leverages the principles of quantum physics, allowing it to perform calculations exponentially faster than classical computers by using quantum bits that can be both One and Zero simultaneously.\n\nWhile unlikely to become a household item, quantum computers hold the potential to replace traditional supercomputers in handling complex calculations. The challenge lies in their construction, requiring extremely low temperatures to maintain the delicate quantum state. This necessitates a steampunk-esque cooling system.\n\nThe computer, currently in use by companies, is visible to the public through the office window on York Road, near Waterloo Station. While access to the interior is restricted, observers can witness the future of supercomputing from the outside. The visually striking display was created in partnership with London-based Map Project Office and Universal Design Studio, alongside Milanese manufacturer Goppion, known for high-end museum showcases. The article highlights the accessibility of this cutting-edge technology, allowing the public to glimpse the power and potential of quantum computing firsthand.\n",
    "chinese_title": "你可以在IBM伦敦办公室看到一台正在运行的量子计算机。",
    "chinese_summary": "IBM在伦敦滑铁卢办公室安装了一台可用的量子计算机，即IBM Quantum System One，令人惊讶地展示了未来科技。 这台基于电路的量子计算机于2019年推出，利用量子物理原理，通过使用可以同时为1和0的量子比特，使其计算速度比传统计算机快指数倍。\n\n虽然不太可能成为家用物品，但量子计算机有潜力取代传统超级计算机来处理复杂计算。 挑战在于它们的构建，需要极低的温度来维持脆弱的量子态。 这就需要一个蒸汽朋克式的冷却系统。\n\n目前该计算机正被公司使用，公众可以通过约克路滑铁卢车站附近的办公室窗口看到它。 虽然内部访问受到限制，但观察者可以从外部见证超级计算的未来。 这一引人注目的展示是由伦敦的Map Project Office和Universal Design Studio与米兰制造商Goppion合作创建的，后者以高端博物馆展柜而闻名。 本文强调了这项尖端技术的可及性，让公众可以亲身体验量子计算的力量和潜力。"
  },
  {
    "id": "46046730",
    "title": "$2B Counter-Strike 2 crash exposes a legal black hole",
    "url": "https://theconversation.com/2b-counter-strike-2-crash-exposes-a-legal-black-hole-your-digital-investments-arent-really-yours-268749",
    "summary": "João Marinotti's article dissects the $2 billion crash in the Counter-Strike 2 digital marketplace, triggered by Valve's unilateral rule change regarding \"trade up contracts.\" This change flooded the market with rare items, drastically reducing the value of existing skins. Marinotti argues this incident highlights a legal blind spot: digital economies are primarily governed by private terms-of-service agreements, lacking the robust regulatory oversight of traditional financial markets.\n\nThe core issue is that players don't legally own their \"skins\"; they only license them. This distinction, affirmed by U.S. courts, means Valve can alter the terms of the license without violating property rights, leaving players with no legal recourse for their financial losses. Existing consumer protection laws are insufficient, as they focus on transparency about licensing, not protecting the speculative value of digital items.\n\nMarinotti further argues that the Counter-Strike 2 economy exhibits characteristics of a financial market, yet it avoids regulation. He applies the Howey test for securities, suggesting that skins could potentially qualify due to the investment of money, common enterprise, expectation of profit, and reliance on Valve's managerial efforts. However, the consumptive intent of skins, the lack of in-platform cash conversion, and Valve's licensing scheme currently circumvent securities regulation. The author concludes that as digital economies expand, society needs to consider integrating them into stronger legal frameworks to protect investors and consumers.\n",
    "chinese_title": "20亿美元反恐精英2崩溃事件暴露了法律漏洞",
    "chinese_summary": "João Marinotti的文章剖析了因Valve单方面修改“交易升级合同”规则而引发的《反恐精英2》数字市场20亿美元的崩盘。这一变动导致稀有物品涌入市场，大幅降低了现有皮肤的价值。Marinotti认为，该事件突显了一个法律盲点：数字经济主要受私人服务条款协议管辖，缺乏传统金融市场那样健全的监管。\n\n核心问题是玩家在法律上并不拥有他们的“皮肤”，而只是对其进行许可。美国法院已经确认了这一区别，这意味着Valve可以在不侵犯财产权的情况下更改许可条款，使玩家对其经济损失无从追索。现有的消费者保护法不足以解决问题，因为它们侧重于许可的透明度，而不是保护数字物品的投机价值。\n\nMarinotti进一步指出，《反恐精英2》的经济表现出金融市场的特征，但却规避了监管。他应用了豪威测试来判断证券，认为皮肤有可能符合证券的定义，因为涉及资金投入、共同企业、盈利预期以及对Valve管理努力的依赖。然而，皮肤的消费意图、缺乏平台内的现金转换以及Valve的许可计划目前规避了证券监管。作者总结道，随着数字经济的扩张，社会需要考虑将它们纳入更强大的法律框架，以保护投资者和消费者。"
  },
  {
    "id": "46032230",
    "title": "A fast EDN (Extensible Data Notation) reader written in C11 with SIMD boost",
    "url": "https://github.com/DotFox/edn.c",
    "summary": "This document is about `EDN.C`, a fast, zero-copy EDN (Extensible Data Notation) reader library written in C11 with SIMD acceleration (NEON, SSE4.2, SIMD128). EDN is described as a \"JSON with superpowers,\" offering more expressive types (keywords, symbols, sets) and extensibility through tagged literals.\n\nThe library boasts features like: high performance with SIMD, WebAssembly support, minimal allocations (zero-copy), a simple API, memory safety via an arena allocator, zero dependencies (pure C11), comprehensive testing, UTF-8 native support, and optional support for tagged literals, map namespace syntax, extended character literals, metadata, text blocks, ratio numbers, extended integer formats, and underscores in numeric literals.\n\nThe document provides instructions for installation (Unix/macOS/Linux, Windows) and integration into projects, including linking the static library or including source files directly. A quick start example demonstrates basic usage, including parsing an EDN string, accessing map entries, and freeing memory. It details how whitespace and control characters are handled.\n\nThe API reference section covers core functions like `edn_read()` (reading EDN from a string), `edn_free()` (freeing memory), and `edn_type()` (getting the type of an EDN value). It also describes functions for accessing specific data types such as strings, booleans, integers, big integers, floats, big decimals, and (optionally) ratio numbers.\n",
    "chinese_title": "用C11编写并使用SIMD加速的快速EDN (可扩展数据表示) 读取器",
    "chinese_summary": "本文档介绍`EDN.C`，这是一个用C11编写的快速、零拷贝EDN（可扩展数据符号）读取器库，并使用SIMD加速（NEON、SSE4.2、SIMD128）。EDN被描述为“具有超能力的JSON”，提供更具表现力的类型（关键字、符号、集合），并通过标记文字实现可扩展性。\n\n该库具有以下特性：SIMD带来的高性能、WebAssembly支持、最小分配（零拷贝）、简单的API、通过arena分配器实现的内存安全、零依赖（纯C11）、全面的测试、UTF-8原生支持，以及对标记文字、映射命名空间语法、扩展字符文字、元数据、文本块、比例数、扩展整数格式和数字文字中的下划线等的可选支持。\n\n本文档提供了安装（Unix/macOS/Linux、Windows）和集成到项目中的说明，包括链接静态库或直接包含源文件。一个快速入门示例演示了基本用法，包括解析EDN字符串、访问映射条目和释放内存。它详细说明了如何处理空格和控制字符。\n\nAPI参考部分涵盖了核心函数，例如 `edn_read()`（从字符串读取EDN）、`edn_free()`（释放内存）和 `edn_type()`（获取EDN值的类型）。它还描述了用于访问特定数据类型的函数，例如字符串、布尔值、整数、大整数、浮点数、大十进制数和（可选）比例数。"
  },
  {
    "id": "46025942",
    "title": "Fran Sans – font inspired by San Francisco light rail displays",
    "url": "https://emilysneddon.com/fran-sans-essay",
    "summary": "Emily Sneddon's article details the creation of \"Fran Sans,\" a display font inspired by the LCD destination displays found on San Francisco's Muni Breda light rail vehicles. She was drawn to the displays' mechanical yet personal feel, characterized by geometric modules creating imperfect letterforms with a unique charm.\n\nSneddon visited the SFMTA's Electronics Shop, where technician Armando Lumbad explained how the signs work and revealed they were designed by Trans-Lite, Inc. in 1999. She connected with Gary Wallberg, the engineer behind the signs, who confirmed they were designed for sufficiency, with characters created only as needed. This inspired Sneddon to create Fran Sans, capturing the essence of this utilitarian typography.\n\nWith encouragement from Dave Foster, Sneddon developed the font in Glyphs, using modules to build uppercase letters, numerals, and punctuation. She acknowledges that some glyphs remain unsolved and lowercase is a future consideration. Fran Sans comes in three styles: Solid, Tile, and Panel, inspired by Bell Shakespeare's adaptable typeface.\n\nSneddon also credits the Letterform Archive for inspiring her modular approach, highlighting Joan Trochut's Tipo Veloz and Zuzana Licko's Lo-Res.\n\nWith the Breda vehicles being replaced and their displays phased out, Sneddon hopes Fran Sans will preserve a distinctive part of San Francisco's character and inspire appreciation for imperfections. She also thanks numerous individuals who assisted her in the creation of Fran Sans, including the SFMTA employees, the designers from Trans-Lite, and her design peers. The article concludes with a poem from Maddy Carrucan.\n",
    "chinese_title": "Fran Sans – 灵感源自旧金山轻轨显示的字体",
    "chinese_summary": "艾米丽·斯内登的文章详细介绍了“Fran Sans”字体的创作，这是一款受旧金山Muni Breda轻轨车辆上的LCD目的地显示器启发的展示字体。她被这些显示器的机械感与个性化感觉所吸引，其特点是由几何模块构成的不完美的字母，具有独特的魅力。\n\n斯内登参观了SFMTA的电子商店，技术员Armando Lumbad解释了这些标志的工作原理，并透露它们是由Trans-Lite, Inc.于1999年设计的。她联系了负责这些标志的工程师Gary Wallberg，他确认这些标志的设计是为了满足需求，字符仅在需要时才创建。这激发了斯内登创作Fran Sans的灵感，捕捉了这种实用主义排版的精髓。\n\n在Dave Foster的鼓励下，斯内登在Glyphs中开发了这款字体，使用模块构建大写字母、数字和标点符号。她承认有些字形仍然未解决，小写字母是未来需要考虑的问题。Fran Sans有三种样式：Solid、Tile和Panel，灵感来自Bell Shakespeare的可适应字体。\n\n斯内登还感谢Letterform Archive启发了她的模块化方法，并特别提到了Joan Trochut的Tipo Veloz和Zuzana Licko的Lo-Res。\n\n随着Breda车辆的更换及其显示器的逐步淘汰，斯内登希望Fran Sans能够保留旧金山独特的一部分特征，并激发人们对不完美的欣赏。她还感谢许多在Fran Sans创作过程中帮助过她的人，包括SFMTA员工、Trans-Lite的设计师以及她的设计同行。文章最后附有Maddy Carrucan的一首诗。"
  },
  {
    "id": "46037573",
    "title": "GrapheneOS migrates server infrastructure from France",
    "url": "https://www.privacyguides.org/news/2025/11/22/grapheneos-migrates-server-infrastructure-from-france-amid-police-intimidation-claims/",
    "summary": "GrapheneOS, a privacy-focused operating system, is moving its server infrastructure out of France, citing safety concerns for open-source privacy projects. The project is relocating its website, Mastodon, Discourse, and Matrix servers to Toronto and Germany, specifically to Netcup. This decision was prompted by the French government's support of the EU Chat Control proposal and negative press coverage from Le Parisien, which GrapheneOS believes conflates their project with government-sponsored, malicious forks.\n\nThe developers are also refusing travel to France due to these concerns. While the migration won't affect critical security services like signature verification, GrapheneOS believes France is no longer a safe location for their operations. The Le Parisien articles cited by GrapheneOS refer to connections between privacy tools and criminal organizations, suggesting potential legal action against non-cooperative publishers, even if the tools are legitimate. GrapheneOS argues they have been misrepresented and linked to fake versions of their OS used for illicit activities, like the ANOM case where a compromised Android OS was used by the FBI for Operation Trojan Horse.\n",
    "chinese_title": "GrapheneOS 将服务器基础设施从法国迁移。",
    "chinese_summary": "GrapheneOS，一个注重隐私的操作系统，正将其服务器基础设施迁出法国，理由是开源隐私项目的安全担忧。该项目正在将其网站、Mastodon、Discourse和Matrix服务器迁移到多伦多和德国，特别是Netcup。此决定是由法国政府对欧盟聊天控制提案的支持以及《巴黎人报》的负面报道所引发的，GrapheneOS认为该报道将他们的项目与政府赞助的恶意分支混为一谈。\n\n由于这些担忧，开发者们也拒绝前往法国。虽然此次迁移不会影响签名验证等关键安全服务，但GrapheneOS认为法国不再是他们运营的安全地点。《巴黎人报》的文章提到了隐私工具与犯罪组织之间的联系，暗示可能对不合作的发布者采取法律行动，即使这些工具是合法的。GrapheneOS认为他们被错误地描述，并与用于非法活动的操作系统伪造版本联系起来，例如ANOM案例，其中联邦调查局使用受损的Android操作系统进行“特洛伊木马行动”。"
  },
  {
    "id": "45981568",
    "title": "Random lasers from peanut kernel doped with birch leaf–derived carbon dots",
    "url": "https://www.degruyterbrill.com/document/doi/10.1515/nanoph-2025-0312/html",
    "summary": "生成摘要时出错",
    "chinese_title": "Random lasers from peanut kernel doped with birch leaf–derived carbon dots",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46042969",
    "title": "What you can get for the price of a Netflix subscription",
    "url": "https://nmil.dev/what-you-can-get-for-the-price-of-a-netflix-subscription",
    "summary": "生成摘要时出错",
    "chinese_title": "What you can get for the price of a Netflix subscription",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46012846",
    "title": "Set theory with types",
    "url": "https://lawrencecpaulson.github.io//2025/11/21/Typed_Set_Theory.html",
    "summary": "生成摘要时出错",
    "chinese_title": "Set theory with types",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46032513",
    "title": "General principles for the use of AI at CERN",
    "url": "https://home.web.cern.ch/news/official-news/knowledge-sharing/general-principles-use-ai-cern",
    "summary": "生成摘要时出错",
    "chinese_title": "General principles for the use of AI at CERN",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45995913",
    "title": "Show HN: Search London StreetView panoramas by text",
    "url": "https://london.publicinsights.uk",
    "summary": "生成摘要时出错",
    "chinese_title": "Show HN: Search London StreetView panoramas by text",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46034145",
    "title": "Show HN: Cynthia – Reliably play MIDI music files – MIT / Portable / Windows",
    "url": "https://www.blaizenterprises.com/cynthia.html",
    "summary": "生成摘要时出错",
    "chinese_title": "Show HN: Cynthia – Reliably play MIDI music files – MIT / Portable / Windows",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46029534",
    "title": "Ego, empathy, and humility at work",
    "url": "https://matthogg.fyi/a-unified-theory-of-ego-empathy-and-humility-at-work/",
    "summary": "生成摘要时出错",
    "chinese_title": "Ego, empathy, and humility at work",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45996527",
    "title": "Historically Accurate Airport Dioramas by AV Pro Designs",
    "url": "https://www.core77.com/posts/138995/Historically-Accurate-Airport-Dioramas-by-AV-Pro-Designs",
    "summary": "生成摘要时出错",
    "chinese_title": "Historically Accurate Airport Dioramas by AV Pro Designs",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45994124",
    "title": "Everything you need to know about hard drive vibration (2016)",
    "url": "https://www.ept.ca/features/everything-need-know-hard-drive-vibration/",
    "summary": "生成摘要时出错",
    "chinese_title": "Everything you need to know about hard drive vibration (2016)",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46033151",
    "title": "NSA and IETF, part 3: Dodging the issues at hand",
    "url": "https://blog.cr.yp.to/20251123-dodging.html",
    "summary": "生成摘要时出错",
    "chinese_title": "NSA and IETF, part 3: Dodging the issues at hand",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46030613",
    "title": "Lambda Calculus – Animated Beta Reduction of Lambda Diagrams",
    "url": "https://cruzgodar.com/applets/lambda-calculus",
    "summary": "生成摘要时出错",
    "chinese_title": "Lambda Calculus – Animated Beta Reduction of Lambda Diagrams",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46047918",
    "title": "Trump's FCC: Internet Providers Can Monitor Their Own Cybersecurity Standards",
    "url": "https://www.cnet.com/home/internet/internet-providers-can-monitor-their-own-cybersecurity-standards-says-trumps-fcc/",
    "summary": "生成摘要时出错",
    "chinese_title": "Trump's FCC: Internet Providers Can Monitor Their Own Cybersecurity Standards",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46024541",
    "title": "We stopped roadmap work for a week and fixed bugs",
    "url": "https://lalitm.com/fixits-are-good-for-the-soul/",
    "summary": "生成摘要时出错",
    "chinese_title": "We stopped roadmap work for a week and fixed bugs",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46038417",
    "title": "PRC Elites Voice AI-Skepticism",
    "url": "https://jamestown.org/prc-elites-voice-ai-skepticism/",
    "summary": "生成摘要时出错",
    "chinese_title": "PRC Elites Voice AI-Skepticism",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46047229",
    "title": "Roblox is a problem – but it's a symptom of something worse",
    "url": "https://www.platformer.news/roblox-ceo-interview-backlash-analysis/",
    "summary": "生成摘要时出错",
    "chinese_title": "Roblox is a problem – but it's a symptom of something worse",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46020096",
    "title": "An Economy of AI Agents",
    "url": "https://arxiv.org/abs/2509.01063",
    "summary": "生成摘要时出错",
    "chinese_title": "An Economy of AI Agents",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46029889",
    "title": "Show HN: Stun LLMs with thousands of invisible Unicode characters",
    "url": "https://gibberifier.com",
    "summary": "生成摘要时出错",
    "chinese_title": "Show HN: Stun LLMs with thousands of invisible Unicode characters",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46027216",
    "title": "µcad: New open source programming language that can generate 2D sketches and 3D",
    "url": "https://microcad.xyz/",
    "summary": "生成摘要时出错",
    "chinese_title": "µcad: New open source programming language that can generate 2D sketches and 3D",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46029932",
    "title": "RuBee",
    "url": "https://computer.rip/2025-11-22-RuBee.html",
    "summary": "生成摘要时出错",
    "chinese_title": "RuBee",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46027962",
    "title": "Show HN: I wrote a minimal memory allocator in C",
    "url": "https://github.com/t9nzin/memory",
    "summary": "生成摘要时出错",
    "chinese_title": "Show HN: I wrote a minimal memory allocator in C",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46030414",
    "title": "Build desktop applications using Go and Web Technologies",
    "url": "https://github.com/wailsapp/wails",
    "summary": "生成摘要时出错",
    "chinese_title": "Build desktop applications using Go and Web Technologies",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46031068",
    "title": "The Arithmetic of Braids (2022)",
    "url": "https://mathcenter.oxford.emory.edu/site/math108/braid_arithmetic/",
    "summary": "生成摘要时出错",
    "chinese_title": "The Arithmetic of Braids (2022)",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46045876",
    "title": "Historic Engineering Wonders: Photos That Reveal How They Pulled It Off",
    "url": "https://rarehistoricalphotos.com/engineering-methods-from-the-past/",
    "summary": "生成摘要时出错",
    "chinese_title": "Historic Engineering Wonders: Photos That Reveal How They Pulled It Off",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46024584",
    "title": "Mount Proton Drive on Linux using rclone and systemd",
    "url": "https://github.com/dadtronics/protondrive-linux",
    "summary": "生成摘要时出错",
    "chinese_title": "Mount Proton Drive on Linux using rclone and systemd",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46009962",
    "title": "A time-travelling door bug in Half Life 2",
    "url": "https://mastodon.gamedev.place/@TomF/115589875974658415",
    "summary": "生成摘要时出错",
    "chinese_title": "A time-travelling door bug in Half Life 2",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45979520",
    "title": "Show HN: Hypercamera – a browser-based 4D camera simulator",
    "url": "https://dugas.ch/4d_creatures/4d_camera.html",
    "summary": "生成摘要时出错",
    "chinese_title": "Show HN: Hypercamera – a browser-based 4D camera simulator",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46042097",
    "title": "Microsoft doesn't understand the dislike for Windows' new direction",
    "url": "https://www.xda-developers.com/microsoft-doesnt-understand-dislike-windows-new-direction/",
    "summary": "生成摘要时出错",
    "chinese_title": "Microsoft doesn't understand the dislike for Windows' new direction",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46025721",
    "title": "Native Secure Enclave backed SSH keys on macOS",
    "url": "https://gist.github.com/arianvp/5f59f1783e3eaf1a2d4cd8e952bb4acf",
    "summary": "生成摘要时出错",
    "chinese_title": "Native Secure Enclave backed SSH keys on macOS",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46029872",
    "title": "McMaster Carr – The Smartest Website You Haven't Heard Of (2022)",
    "url": "https://www.bedelstein.com/post/mcmaster-carr",
    "summary": "生成摘要时出错",
    "chinese_title": "McMaster Carr – The Smartest Website You Haven't Heard Of (2022)",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46045674",
    "title": "Chatbot Psychosis",
    "url": "https://en.wikipedia.org/wiki/Chatbot_psychosis",
    "summary": "生成摘要时出错",
    "chinese_title": "Chatbot Psychosis",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46024032",
    "title": "Editing Code in Emacs",
    "url": "https://redpenguin101.github.io/html/posts/2025_11_23_emacs_for_code_editing.html",
    "summary": "生成摘要时出错",
    "chinese_title": "Editing Code in Emacs",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46037556",
    "title": "Is your Android TV streaming box part of a botnet?",
    "url": "https://krebsonsecurity.com/2025/11/is-your-android-tv-streaming-box-part-of-a-botnet/",
    "summary": "生成摘要时出错",
    "chinese_title": "Is your Android TV streaming box part of a botnet?",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46027833",
    "title": "Iowa City made its buses free. Traffic cleared, and so did the air",
    "url": "https://www.nytimes.com/2025/11/18/climate/iowa-city-free-buses.html",
    "summary": "生成摘要时出错",
    "chinese_title": "Iowa City made its buses free. Traffic cleared, and so did the air",
    "chinese_summary": "生成摘要时出错"
  }
]