[
  {
    "id": "45014993",
    "title": "Building the mouse Logitech won't make",
    "url": "https://samwilkinson.io/posts/2025-08-24-mx-ergo-mods",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "打造罗技不会做的鼠标",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "45014131",
    "title": "Show HN: Base, an SQLite database editor for macOS",
    "url": "https://menial.co.uk/base/",
    "summary": "This Show HN post introduces \"Base,\" a macOS application designed as an SQLite database editor. It's positioned as a user-friendly tool suitable for both beginners and experienced users. The description emphasizes its small size, power, and comfortable user experience. The post highlights its key feature - editing SQLite databases on macOS. It directly encourages user engagement through both a free download option, suggesting a trial version or a freemium model, and a paid version.\n",
    "chinese_title": "Show HN: Base，macOS 平台的 SQLite 数据库编辑器",
    "chinese_summary": "这款Show HN帖子介绍了一款名为\"Base\"的macOS应用，它是一款SQLite数据库编辑器。它的定位是易于使用，适合初学者和有经验的用户。描述强调其体积小、功能强大且用户体验舒适。帖子重点介绍了其关键功能——在macOS上编辑SQLite数据库。它通过免费下载选项（暗示试用版或免费增值模式）和付费版本，直接鼓励用户参与。"
  },
  {
    "id": "45015814",
    "title": "The MiniPC Revolution",
    "url": "https://jadarma.github.io/blog/posts/2025/08/the-minipc-revolution/",
    "summary": "This article champions the MiniPC as a viable and advantageous computing solution, especially for homelabs and general home use. The author argues that MiniPCs offer numerous benefits including affordability, replaceability, small size, power efficiency, and specialization through diversification.\n\nMiniPCs excel in specific roles like general computing, networking (firewalls, routers, VPNs), network storage (NAS), and personal cloud hosting, enabling a distributed approach to computing. This contrasts with the traditional \"monolith\" approach, which often requires complex hardware configurations and can be challenging to manage.\n\nThe author highlights that using MiniPCs negates the need for virtualization, simplifying system management and compartmentalizing functions. This modularity also reduces the risk of single points of failure, ensuring that if one MiniPC goes down, other essential services remain operational.\n\nFinally, the author emphasizes the psychological benefits of using MiniPCs, noting that their isolated nature fosters a sense of confidence and freedom when experimenting with different configurations. The author concludes that MiniPCs are a great entry point into the homelab world due to their scalability and affordable cost, offering a practical and enjoyable alternative to more complex, server-based setups.\n",
    "chinese_title": "迷你电脑革命",
    "chinese_summary": "本文倡导将迷你电脑作为一种可行且有利的计算解决方案，尤其适用于家庭实验室和一般家庭使用。作者认为迷你电脑具有诸多优点，包括价格实惠、易于更换、体积小巧、节能以及通过多样化实现专业化。\n\n迷你电脑在特定角色中表现出色，例如通用计算、网络（防火墙、路由器、VPN）、网络存储（NAS）和个人云托管，从而实现了一种分布式计算方法。这与传统的“巨石”方法形成对比，后者通常需要复杂的硬件配置，并且管理起来可能具有挑战性。\n\n作者强调，使用迷你电脑消除了对虚拟化的需求，简化了系统管理并隔离了功能。这种模块化还降低了单点故障的风险，确保如果一台迷你电脑发生故障，其他基本服务仍然可以运行。\n\n最后，作者强调了使用迷你电脑的心理益处，指出它们的隔离性培养了一种在尝试不同配置时的信心和自由感。作者总结说，由于其可扩展性和经济实惠的成本，迷你电脑是进入家庭实验室世界的绝佳切入点，为更复杂的、基于服务器的设置提供了一种实用且令人愉悦的替代方案。"
  },
  {
    "id": "45013737",
    "title": "A Small Change to Improve Browsers for Keyboard Navigation",
    "url": "https://b.43z.one/2025-07-22/",
    "summary": "This article by h43z discusses the limitations of keyboard navigation in modern browsers like Firefox and Chrome. While the browsers offer \"quick find\" features (using `'` for links, `/` and `Ctrl+F` for all text), these tools only highlight elements and don't activate them when the user presses Enter, especially for non-link elements like buttons or divs with `onclick` handlers.\n\nH43z argues that it would significantly improve keyboard navigation if pressing Enter on highlighted text triggered a click on the corresponding element. To achieve this, they created a small browser extension that injects JavaScript code to intercept the Enter key press. This code identifies the element containing the highlighted text, simulates a click on that element, and then removes the highlighting.\n\nThe code snippet provided gets the HTML element that is the parent of the selected node, and then clicks it if the Enter key is pressed. The author notes further cases to exclude from the `Enter` key hook are needed.\n\nThe author believes this small change dramatically enhances the keyboard navigation experience, allowing users to interact with website elements more efficiently. The article ends with a call for Firefox to be more energy efficient.\n",
    "chinese_title": "一个小改动，提升键盘导航浏览体验",
    "chinese_summary": "h43z的文章讨论了Firefox和Chrome等现代浏览器中键盘导航的局限性。虽然浏览器提供了“快速查找”功能（使用`'`查找链接，`/`和`Ctrl+F`查找所有文本），但这些工具仅突出显示元素，不会在用户按Enter键时激活它们，尤其对于非链接元素，例如带有`onclick`处理程序的按钮或div。\n\nH43z认为，如果按下Enter键时能够触发对突出显示文本对应元素的点击，将显著改善键盘导航。为此，他们创建了一个小型浏览器扩展程序，注入JavaScript代码来拦截Enter键的按下。该代码识别包含突出显示文本的元素，模拟对该元素的点击，然后移除突出显示。\n\n提供的代码片段获取所选节点的父HTML元素，然后在按下Enter键时点击它。作者指出，还需要排除更多`Enter`键挂钩的情况。\n\n作者认为这个小小的改变极大地提升了键盘导航体验，使用户能够更高效地与网站元素交互。文章最后呼吁Firefox提高能源效率。"
  },
  {
    "id": "45010876",
    "title": "What are OKLCH colors?",
    "url": "https://jakub.kr/components/oklch-colors",
    "summary": "OKLCH is a color model designed for perceptual uniformity, making it easier to manipulate colors in a way that aligns with human perception. Unlike models like RGB or HSL, equal steps in OKLCH values result in equal changes in perceived brightness, chroma, and hue.\n\nOKLCH, like LCH, comprises Lightness (0-1 or 0%-100%), Chroma (intensity), and Hue (0-360 degrees), but uses the OKLab color space as its foundation. A significant advantage is the ability to create consistent color palettes by keeping lightness and chroma constant while varying hue, resulting in visually uniform colors. Similarly, changing lightness values produces predictable shades without hue or saturation drift.\n\nGradients in OKLCH differ from sRGB, as they are calculated based on lightness, chroma, and hue, potentially leading to smoother transitions but also unexpected color detours. For more linear gradients, OKLAB is often preferred.\n\nOKLCH supports a wider range of colors than sRGB, including those achievable on Display-P3 screens. It can even define colors outside any display's gamut, which are then clipped or mapped to the nearest representable color. Using the maximum chroma value can help avoid this clipping.\n\nWhile OKLCH has good browser support, fallbacks to sRGB are recommended for older browsers using `@supports` in CSS. Tools like oklch.fyi are available to aid in OKLCH color palette generation and conversion.\n",
    "chinese_title": "什么是OKLCH颜色？",
    "chinese_summary": "OKLCH 是一种旨在实现感知均匀性的颜色模型，使其能够更轻松地以符合人类感知的方式来操作颜色。与 RGB 或 HSL 等模型不同，OKLCH 值中相等的步长会导致感知到的亮度、色度和色相发生相等的变化。\n\nOKLCH 与 LCH 类似，由明度（0-1 或 0%-100%）、色度（强度）和色相（0-360 度）组成，但它以 OKLab 色彩空间为基础。一个显著的优势是能够通过保持明度和色度恒定，同时改变色相来创建一致的调色板，从而产生视觉上均匀的颜色。类似地，改变明度值会产生可预测的色调，而不会出现色相或饱和度漂移。\n\nOKLCH 中的渐变不同于 sRGB，因为它们是基于明度、色度和色相计算的，这可能会导致更平滑的过渡，但也可能导致意想不到的颜色偏差。对于更线性的渐变，通常首选 OKLAB。\n\nOKLCH 支持比 sRGB 更广泛的颜色范围，包括 Display-P3 屏幕上可以实现的颜色。它甚至可以定义超出任何显示器色域的颜色，这些颜色随后会被裁剪或映射到最接近的可表示颜色。使用最大色度值可以帮助避免这种裁剪。\n\n虽然 OKLCH 具有良好的浏览器支持，但建议使用 CSS 中的 `@supports` 为旧版浏览器提供 sRGB 回退。诸如 oklch.fyi 之类的工具可用于帮助生成和转换 OKLCH 调色板。"
  },
  {
    "id": "45015354",
    "title": "FCC Bars over 1,200 Providers for Non-Compliance with Robocall Protections",
    "url": "https://docs.fcc.gov/public/attachments/DOC-414073A1.txt",
    "summary": "The FCC has barred over 1,200 voice service providers from accessing the U.S. phone network due to their non-compliance with robocall protection rules. These providers failed to maintain accurate Robocall Mitigation Database certifications, neglecting their responsibility to protect consumers from illegal robocalls. This action follows a final warning issued earlier in August after an initial 185 providers were removed from the Database.\n\nThe FCC's Robocall Mitigation Database requires providers to implement STIR/SHAKEN caller ID authentication on their networks and submit robocall mitigation plans. Failure to comply leads to removal from the database and traffic blocking. Removed providers can only rejoin with express approval from the FCC.\n\nThis action stems from a December 2024 order where the Commission instructed 2,411 providers to correct deficient filings or face removal. Prior to this recent action, 185 providers were removed due to their involvement in robocall tracebacks. Furthermore, a bipartisan coalition of 51 state attorneys general launched \"Operation Robocall Roundup,\" sending warning letters to 37 voice providers, including seven already removed by the FCC, demanding they stop illegal robocalls from using their networks. The FCC continues to prioritize combatting robocalls and holding providers accountable for fulfilling their obligations.\n",
    "chinese_title": "FCC禁止超过1200家供应商违反防骚扰电话规定",
    "chinese_summary": "由于未能遵守机器人电话防护规定，美国联邦通信委员会(FCC)已禁止1200多家语音服务提供商接入美国电话网络。这些提供商未能维护准确的机器人电话缓解数据库认证，忽视了其保护消费者免受非法机器人电话侵害的责任。在此之前，8月份曾发出最后警告，并在最初从数据库中删除了185家提供商。\n\nFCC的机器人电话缓解数据库要求提供商在其网络上实施STIR/SHAKEN来电显示认证，并提交机器人电话缓解计划。未能遵守规定将导致从数据库中移除并阻止流量。被移除的提供商只有获得FCC的明确批准才能重新加入。\n\n此举源于2024年12月的一项命令，该命令指示委员会要求2411家提供商纠正有缺陷的备案，否则将面临移除。在此次行动之前，已有185家提供商因参与机器人电话追踪而被移除。此外，由两党组成的51个州的总检察长联盟发起了“机器人电话围剿行动”，向37家语音提供商（包括已被FCC移除的7家）发出了警告信，要求他们阻止非法机器人电话使用其网络。FCC将继续优先打击机器人电话，并追究提供商履行义务的责任。"
  },
  {
    "id": "45001556",
    "title": "How to Make Things Slower So They Go Faster",
    "url": "https://www.gojiberries.io/how-to-make-things-slower-so-they-go-faster-a-jitter-design-manual/",
    "summary": "This article addresses the problem of synchronized demand, where a large influx of client requests overwhelms a service, leading to cascading failures. It explains how aligned events (cache expiry, cron jobs, deployments) can create request spikes exceeding system capacity, resulting in queues, timeouts, and retries that exacerbate the issue.\n\nThe core solution is to distribute requests over time using jitter, effectively slowing things down to improve overall performance and stability. The article emphasizes that the goal is to minimize overload risk and added latency. The optimal approach is uniform jitter, which provides fairness and minimizes the cost associated with increased instantaneous load.\n\nDetermining the appropriate jitter window size (W) involves balancing constraints: lower bounds based on headroom (H), service time (s), and spare concurrency (K), and upper bounds based on deadlines (D) and acceptable wait times (L). The article also discusses how to incorporate server-provided hints (Retry-After, rate limits) to refine the jitter window.\n\nThe principle applies to both preventing and recovering from synchronized demand. Prevention involves randomizing TTLs and staggering periodic tasks. Recovery involves pacing admissions server-side using a token bucket refilled based on estimated headroom, ensuring requests are only accepted when capacity is available.\n\nThe author stresses the importance of monitoring key metrics (peak-to-average ratios, tail latency, retry rates) and conducting recovery drills to validate assumptions and identify common errors like underestimating demand or overstating capacity. Ultimately, the article advocates for a controlled approach to managing synchronized demand, using jitter to transform spikes into manageable flows, improving both performance and user experience.\n",
    "chinese_title": "如何欲缓反速",
    "chinese_summary": "本文探讨了同步需求问题，即大量客户端请求淹没服务，导致级联故障。文章解释了对齐事件（缓存过期、定时任务、部署）如何产生超出系统容量的请求峰值，从而导致队列、超时和重试，进而加剧问题。\n\n核心解决方案是使用抖动来随时间分散请求，有效地减缓速度以提高整体性能和稳定性。文章强调，目标是最小化过载风险和增加的延迟。最佳方法是均匀抖动，它提供了公平性，并最大限度地降低了与瞬时负载增加相关的成本。\n\n确定合适的抖动窗口大小（W）涉及平衡约束：基于余量（H）、服务时间（s）和备用并发（K）的下限，以及基于截止日期（D）和可接受等待时间（L）的上限。文章还讨论了如何结合服务器提供的提示（Retry-After、速率限制）来优化抖动窗口。\n\n该原则适用于预防和从同步需求中恢复。预防包括随机化 TTL 并错开周期性任务。恢复包括使用基于估计余量补充令牌桶的服务器端速率控制来控制准入，确保仅在容量可用时才接受请求。\n\n作者强调了监控关键指标（峰均比、尾延迟、重试率）和进行恢复演练以验证假设的重要性，并识别常见的错误，例如低估需求或高估容量。最终，本文提倡采用一种可控的方法来管理同步需求，使用抖动将峰值转化为可管理的流量，从而提高性能和用户体验。"
  },
  {
    "id": "45013131",
    "title": "An Illustrated Guide to OAuth",
    "url": "https://www.ducktyped.org/p/an-illustrated-guide-to-oauth",
    "summary": "This article provides an illustrated guide to understanding OAuth, a protocol designed to grant third-party applications limited access to a user's data on another service without sharing their password.\n\nThe core of OAuth revolves around an **access token**, which acts as a user-specific API key. The process begins with the user interacting with the application (OAuth client), which then redirects the user to the service they want to connect (authorization server). The user logs in and grants specific permissions (scopes) to the application.\n\nAfter user consent, the authorization server redirects the user back to the application with an **authorization code**. The application then exchanges this code, along with its **client secret**, for the access token through a secure, back-end (back-channel) request. This two-step process, using an authorization code instead of directly providing the access token, is crucial for security.\n\nThe article covers the registration process for OAuth applications, emphasizing the importance of the redirect URI for security. It also addresses security concerns, highlighting the dangers of exposing the client secret on the front-end and introducing PKCE as a solution for applications without a back-end.\n\nThe author notes that OAuth can be implemented in various ways, including the \"implicit flow\" (less secure) and implementations using PKCE, and explains that tokens expire and require a refresh flow. Finally, the article touches on OpenID Connect (OIDC), which builds upon OAuth for login functionalities and provides user data.\n",
    "chinese_title": "OAuth图解指南",
    "chinese_summary": "本文图文并茂地介绍了OAuth，该协议旨在授予第三方应用程序对用户在另一项服务上的数据的有限访问权限，而无需共享其密码。\n\nOAuth 的核心围绕**访问令牌**展开，它充当用户特定的 API 密钥。 该过程始于用户与应用程序（OAuth 客户端）交互，然后将用户重定向到他们想要连接的服务（授权服务器）。 用户登录并向应用程序授予特定权限（范围）。\n\n在用户同意后，授权服务器会将用户重定向回带有**授权码**的应用程序。 然后，应用程序通过安全的后端（后通道）请求，使用此代码及其**客户端密钥**来交换访问令牌。 这种使用授权码而不是直接提供访问令牌的两步过程对于安全性至关重要。\n\n本文涵盖了 OAuth 应用程序的注册过程，强调了重定向 URI 对于安全性的重要性。 它还解决了安全问题，突出了在前端暴露客户端密钥的危险，并介绍了 PKCE 作为没有后端的应用程序的解决方案。\n\n作者指出，OAuth 可以通过多种方式实现，包括“隐式流”（安全性较低）和使用 PKCE 的实现，并解释说令牌会过期并需要刷新流程。 最后，本文还涉及 OpenID Connect (OIDC)，它建立在 OAuth 之上以实现登录功能并提供用户数据。"
  },
  {
    "id": "45012430",
    "title": "Agent-C: a 4KB AI agent",
    "url": "https://github.com/bravenewxyz/agent-c",
    "summary": "Agent-C is a remarkably lightweight AI agent written in C, designed for efficient operation on both macOS and Linux. Its primary function is to interact with the OpenRouter API and execute shell commands based on AI responses, effectively offering tool calling functionality.\n\nA key highlight is its extremely small binary size, achieved through platform-specific compression techniques. On macOS, it leverages GZEXE, resulting in a 4.4KB executable, while on Linux, UPX compression allows for a binary size of approximately 16KB.\n\nThe agent incorporates conversation memory management via a sliding window, optimizing its resource usage and enabling it to maintain context within interactions.\n\nTo get started, users need a GCC compiler, the curl command-line tool, and an OpenRouter API key. Building the agent is straightforward with the `make` command, which automatically detects the operating system and applies the appropriate compression method. After setting the `OR_KEY` environment variable with the API key, the agent can be executed using `./agent-c`.\n\nThe project is licensed under the CC0 \"No Rights Reserved\" license, emphasizing its open and unrestricted nature.\n",
    "chinese_title": "Agent-C：4KB AI智能体",
    "chinese_summary": "Agent-C 是一个用 C 编写的非常轻量级的 AI 代理，旨在在 macOS 和 Linux 上高效运行。它的主要功能是与 OpenRouter API 交互，并根据 AI 响应执行 shell 命令，从而有效地提供工具调用功能。\n\n一个关键亮点是其极小的二进制文件大小，这是通过特定于平台的压缩技术实现的。在 macOS 上，它利用 GZEXE，生成一个 4.4KB 的可执行文件，而在 Linux 上，UPX 压缩允许二进制文件大小约为 16KB。\n\n该代理通过滑动窗口集成会话记忆管理，优化其资源使用，并使其能够在交互中保持上下文。\n\n要开始使用，用户需要一个 GCC 编译器、curl 命令行工具和一个 OpenRouter API 密钥。使用 `make` 命令可以轻松构建代理，该命令会自动检测操作系统并应用适当的压缩方法。在设置 `OR_KEY` 环境变量为 API 密钥后，可以使用 `./agent-c` 执行代理。\n\n该项目在 CC0 \"No Rights Reserved\" 许可下获得许可，强调其开放和不受限制的性质。"
  },
  {
    "id": "45013154",
    "title": "What Is a Color Space?",
    "url": "https://www.makingsoftware.com/chapters/color-spaces-models-and-gamuts",
    "summary": "Since the article content is \"Loading...\", it's impossible to provide a meaningful summary. A summary requires content to summarize.\n\nTo provide a summary, I need the actual text of the article \"What Is a Color Space?\". Once you provide that, I can analyze it and give you a concise summary, no more than 300 words.\n",
    "chinese_title": "什么是色彩空间？",
    "chinese_summary": "由于文章内容为“加载中…”，因此无法提供有意义的摘要。摘要需要内容才能进行总结。\n\n要提供摘要，我需要文章“什么是色彩空间？”的实际文本。一旦您提供了它，我就可以对其进行分析并为您提供一份简洁的摘要，不超过300字。"
  },
  {
    "id": "45002182",
    "title": "A visual introduction to big O notation",
    "url": "https://samwho.dev/big-o/",
    "summary": "This article provides a visual introduction to Big O notation, a way to describe the performance of a function based on how its execution time grows with increasing input size, rather than actual time measurements.\n\nThe author covers four common Big O categories:\n\n*   **O(1) - Constant:** Execution time remains the same regardless of input size (e.g., using a formula directly).\n\n*   **O(log n) - Logarithmic:** Execution time increases proportionally to the logarithm of the input size (e.g., binary search).\n\n*   **O(n) - Linear:** Execution time grows linearly with the input size (e.g., looping through a list once).\n\n*   **O(n^2) - Quadratic:** Execution time grows proportionally to the square of the input size (e.g., nested loops like bubble sort).\n\nThe article illustrates each concept with code examples and interactive visualizations. It emphasizes that Big O notation describes the *worst-case scenario* and focuses on the *rate of growth*, not absolute time. The author also mentions the use of Θ notation when the best and worst case scenarios have the same order of growth.\n\nFurthermore, the article provides practical examples of how to improve code performance by:\n\n*   Using appropriate data structures (e.g., Sets for O(1) lookups).\n*   Avoiding inefficient operations within loops (e.g., `indexOf`).\n*   Caching intermediate results (memoization) to reduce redundant calculations, highlighting the trade-off between time and memory.\n\nThe author concludes by summarizing the Big O notations covered, emphasizing the importance of testing code changes to ensure actual performance improvements, and provides a graph comparing the time complexities.\n",
    "chinese_title": "大O符号的可视化入门",
    "chinese_summary": "本文以可视化的方式介绍了大O符号，这是一种描述函数性能的方法，它基于执行时间如何随输入规模的增长而变化，而不是实际的时间测量。\n\n作者涵盖了四种常见的大O类别：\n\n*   **O(1) - 常数时间：** 执行时间与输入规模无关，保持不变（例如，直接使用公式）。\n\n*   **O(log n) - 对数时间：** 执行时间与输入规模的对数成比例增长（例如，二分查找）。\n\n*   **O(n) - 线性时间：** 执行时间与输入规模线性增长（例如，单次遍历列表）。\n\n*   **O(n^2) - 平方时间：** 执行时间与输入规模的平方成比例增长（例如，冒泡排序等嵌套循环）。\n\n文章用代码示例和交互式可视化工具阐述了每个概念。它强调大O符号描述的是*最坏情况*，并且关注的是*增长率*，而不是绝对时间。作者还提到了当最佳和最坏情况具有相同增长阶数时，可以使用Θ符号。\n\n此外，文章还提供了通过以下方式提高代码性能的实际示例：\n\n*   使用合适的数据结构（例如，使用集合进行O(1)查找）。\n*   避免在循环中使用低效操作（例如，`indexOf`）。\n*   缓存中间结果（记忆化）以减少冗余计算，从而突出时间和内存之间的权衡。\n\n作者最后总结了所涵盖的大O符号，强调测试代码更改以确保实际性能提升的重要性，并提供了一个比较时间复杂度的图表。"
  },
  {
    "id": "45015532",
    "title": "Nvidia's new 'robot brain' goes on sale for $3,499",
    "url": "https://www.cnbc.com/2025/08/25/nvidias-thor-t5000-robot-brain-chip.html",
    "summary": "Nvidia's new Jetson AGX Thor \"robot brain\" chip is now available as a developer kit for $3,499. The first kits are expected to ship next month, enabling customers to build robots. After prototyping, Nvidia will sell Thor T5000 modules for production-ready robots, priced at $2,999 each for orders exceeding 1,000. CEO Jensen Huang views robotics as a significant growth opportunity for Nvidia, second only to AI.\n\nThe Jetson Thor chips, based on Blackwell graphics processors, boast 7.5 times the speed of previous generations, allowing for the operation of generative AI models essential for robots to interpret their environment. These chips feature 128GB of memory to support large AI models. Companies like Agility Robotics, Amazon, Meta, and Boston Dynamics are already utilizing Nvidia's Jetson chips.\n\nWhile robotics currently represents a small portion (about 1%) of Nvidia's overall revenue, it's experiencing rapid growth. Nvidia's automotive and robotics divisions, now combined, reported a 72% year-over-year increase in quarterly sales, reaching $567 million. The Jetson Thor chips also have applications in self-driving cars, particularly for Chinese brands, and are known as Drive AGX with the Drive OS when used for automotive purposes.\n",
    "chinese_title": "英伟达新型“机器人大脑”开售，售价3499美元",
    "chinese_summary": "英伟达Jetson AGX Thor“机器人大脑”芯片开发者套件现已上市，售价3499美元。首批套件预计下月发货，助力客户构建机器人。原型设计完成后，英伟达将出售用于量产机器人的Thor T5000模块，单次订购超过1000个时，每个售价2999美元。CEO黄仁勋认为机器人技术是英伟达继人工智能之后又一重要增长机遇。\n\nJetson Thor芯片基于Blackwell图形处理器，速度是上一代的7.5倍，可运行生成式人工智能模型，这对于机器人理解其环境至关重要。这些芯片拥有128GB内存，以支持大型人工智能模型。Agility Robotics、亚马逊、Meta和波士顿动力等公司已在使用英伟达的Jetson芯片。\n\n虽然机器人技术目前仅占英伟达总收入的一小部分（约1%），但其增长迅速。英伟达的汽车和机器人部门现已合并，季度销售额同比增长72%，达到5.67亿美元。Jetson Thor芯片也应用于自动驾驶汽车，特别是中国品牌，用于汽车时被称为Drive AGX，并搭载Drive OS。"
  },
  {
    "id": "45012942",
    "title": "Standard Thermal: Energy Storage 500x Cheaper Than Batteries",
    "url": "https://austinvernon.site/blog/standardthermal.html",
    "summary": "Standard Thermal aims to provide 24/7 solar energy at a price competitive with natural gas by storing solar energy as heat in large, inexpensive piles of dirt. Co-located solar PV arrays provide electricity, which is converted to heat by electric elements embedded in the dirt. Pipes circulating fluid extract the heat for customer use. The storage cost is under $0.10/kWh thermal, significantly cheaper than batteries.\n\nIdeal customers include solar developers with excess capacity and isolated energy users reliant on expensive fuels like propane. The system can scale to hundreds of megawatts, requiring sufficient land. Long-term, the goal is to repower coal plants, using stored heat to generate steam for turbines.\n\nThe company emphasizes the abundance of solar energy and the need for cost-effective storage to address seasonal production variations. While batteries are suitable for daily storage, thermal storage offers an affordable solution for long-term, seasonal energy management.\n\nThermal storage is viable because of the low cost and availability of storage materials like dirt and rock. Although heat transfer is slow and temperature cycling can be damaging, Standard Thermal addresses these challenges through careful engineering and design. They are prototyping designs and plan to spin out and fundraise in early 2026. The company believes thermal energy storage can be a key player in the transition to a solar-powered future.\n",
    "chinese_title": "标准热能：储能成本比电池低500倍",
    "chinese_summary": "Standard Thermal 旨在通过将太阳能以热能形式储存在大型廉价的土堆中，以与天然气具有竞争力的价格提供全天候太阳能。 共址太阳能光伏阵列提供电力，电力通过嵌入泥土中的电热元件转化为热能。 循环流体管道抽取热能供客户使用。 存储成本低于 0.10 美元/千瓦时热能，远低于电池。\n\n理想客户包括拥有过剩容量的太阳能开发商和依赖昂贵燃料（如丙烷）的孤立能源用户。 该系统可以扩展到数百兆瓦，需要足够的土地。 从长远来看，目标是改造燃煤电厂，利用储存的热能为涡轮机产生蒸汽。\n\n该公司强调太阳能的丰富性和经济高效的储能对解决季节性生产变化的需求。 虽然电池适合日常存储，但热存储为长期、季节性能源管理提供了一种经济实惠的解决方案。\n\n由于泥土和岩石等存储材料的低成本和可用性，热存储是可行的。 尽管传热缓慢且温度循环可能具有破坏性，但 Standard Thermal 通过精心的工程设计来解决这些挑战。 他们正在设计原型，并计划在 2026 年初分拆并筹集资金。 该公司认为，热能存储可以在向太阳能供电的未来转型中发挥关键作用。"
  },
  {
    "id": "45002776",
    "title": "SmallJS: Smalltalk-80 that compiles to JavaScript",
    "url": "https://small-js.org/Home/Home.html",
    "summary": "SmallJS is a free and open-source implementation of the Smalltalk-80 programming language that compiles to JavaScript. This allows developers to leverage the elegance and power of Smalltalk-80 while building web applications and Node.js applications.\n\nKey features include:\n\n*   **JavaScript Compilation:** SmallJS compiles Smalltalk-80 code into JavaScript, enabling execution in modern browsers and Node.js environments.\n*   **File-Based Development:** Unlike traditional Smalltalk image-based systems, SmallJS is file-based, facilitating the use of preferred IDEs like Visual Studio Code (with syntax coloring and debugging support).\n*   **Selective Library Import:** Code is separated from the SmallJS base libraries, with only the necessary parts imported during application execution.\n*   **Object-Oriented Architecture:** SmallJS is fully object-oriented and customizable.\n*   **JavaScript Library Integration:** It provides Smalltalk-80 wrappers for existing JavaScript libraries, including those for browser DOM manipulation, Node.js HTTP servers, Express, databases, file systems, and multi-threading.\n*   **Example Projects:** Several example projects are provided to accelerate the learning process.\n*   **Target Audience:** SmallJS is intended for both novice and experienced developers who want to use a cleaner language than JavaScript to build front-end and back-end applications.\n\nVersion 1.7 of SmallJS was released on August 18, 2025, and the source code is available on GitHub.\n",
    "chinese_title": "SmallJS：编译为JavaScript的Smalltalk-80",
    "chinese_summary": "SmallJS 是一款将 Smalltalk-80 编程语言编译为 JavaScript 的免费开源实现。它让开发者能够利用 Smalltalk-80 的优雅性和强大功能来构建 Web 应用程序和 Node.js 应用程序。\n\n主要功能包括：\n\n*   **JavaScript 编译：** SmallJS 将 Smalltalk-80 代码编译为 JavaScript，从而能够在现代浏览器和 Node.js 环境中执行。\n*   **基于文件的开发：** 与传统的基于 Smalltalk 镜像的系统不同，SmallJS 基于文件，方便使用首选的 IDE，例如 Visual Studio Code（具有语法着色和调试支持）。\n*   **选择性库导入：** 代码与 SmallJS 基础库分离，在应用程序执行期间仅导入必要的部分。\n*   **面向对象的架构：** SmallJS 是完全面向对象的并且可定制。\n*   **JavaScript 库集成：** 它为现有的 JavaScript 库提供 Smalltalk-80 封装器，包括用于浏览器 DOM 操作、Node.js HTTP 服务器、Express、数据库、文件系统和多线程的库。\n*   **示例项目：** 提供了几个示例项目来加速学习过程。\n*   **目标受众：** SmallJS 适用于希望使用比 JavaScript 更简洁的语言来构建前端和后端应用程序的初学者和经验丰富的开发人员。\n\nSmallJS 1.7 版本于 2025 年 8 月 18 日发布，源代码可在 GitHub 上找到。"
  },
  {
    "id": "45007992",
    "title": "Mathematical secrets of ancient tablet unlocked after nearly a century of study (2017)",
    "url": "https://www.theguardian.com/science/2017/aug/24/mathematical-secrets-of-ancient-tablet-unlocked-after-nearly-a-century-of-study",
    "summary": "In 2017, mathematicians unlocked the secrets of the Plimpton 322, a 3,700-year-old Babylonian clay tablet, revealing it as the world's oldest and most accurate trigonometric table, predating Pythagoras by 1,000 years. Researchers from the University of New South Wales discovered the tablet contains a series of trigonometric tables more accurate than any available today, based on ratios rather than angles and circles.\n\nThe tablet, part of Columbia University's collection since the 1930s, was acquired from Edgar Banks, an archaeologist who excavated it in Iraq. The researchers believe the tablet was a working tool used for surveying, and calculating the construction of temples, palaces, and pyramids. Its accuracy stems from the Babylonian base-60 number system, which allows for more precise fractions than the contemporary base-10 system.\n\nThe study suggests the tablet originally had six columns and 38 rows. The research highlights the advanced mathematical sophistication of the Babylonians and opens new avenues for modern mathematics research and education, potentially offering practical applications in surveying, computer graphics, and education.\n",
    "chinese_title": "历经近百年研究，古代石碑上的数学秘密终被揭开 (2017)",
    "chinese_summary": "2017年，数学家们揭开了拥有3700年历史的巴比伦泥板普林顿322之谜，发现它是世界上最古老、最精确的三角函数表，比毕达哥拉斯早了1000年。新南威尔士大学的研究人员发现，该泥板包含一系列比当今任何三角函数表都更精确的三角函数表，它基于比率而非角度和圆。\n\n该泥板自20世纪30年代以来一直是哥伦比亚大学的藏品，是从考古学家埃德加·班克斯手中购得的，他在伊拉克发掘了它。研究人员认为，该泥板是一种用于测量、以及计算寺庙、宫殿和金字塔建造的工作工具。它的精确性源于巴比伦的60进制数字系统，该系统允许比当时的10进制系统更精确的分数。\n\n该研究表明，该泥板最初有六列和38行。这项研究突显了巴比伦人先进的数学水平，并为现代数学研究和教育开辟了新的途径，有可能在测量、计算机图形和教育方面提供实际应用。"
  },
  {
    "id": "45013714",
    "title": "The unlikely revival of nuclear batteries",
    "url": "https://spectrum.ieee.org/nuclear-battery-revival",
    "summary": "This article discusses the potential resurgence of nuclear batteries, a technology that previously saw limited use due to safety concerns and tracking difficulties. Unlike nuclear reactors, these batteries derive energy from the spontaneous radiation emitted by decaying atomic nuclei, typically isotopes of nickel or hydrogen. Modern advancements allow for smaller, more efficient designs potentially lasting decades or even centuries.\n\nWhile the technology works and offers advantages like long life and high energy density, finding suitable applications and ensuring proper disposal remain key challenges. Previous uses include pacemakers (now discontinued due to tracking issues), deep-space probes, and remote power sources.\n\nNew potential applications include powering robots, drones, sensors, biomedical implants, and even providing long-lasting power for soldiers. The article highlights various companies and research groups developing semiconductor-based and electrochemical approaches to harnessing radioisotope energy.\n\nKey engineering considerations include choosing the right radioisotope based on factors like half-life, decay energy, and shielding requirements. Beta and alpha emitters are preferred, with safer options like tritium and nickel-63 producing low-energy beta particles. Cost, safety, licensing, and tracking the radioactive material remain significant hurdles to widespread adoption. The article also highlights the importance of proper care in handling radioisotopes, referencing a cautionary tale of a teenager amassing a dangerous quantity of radioactive materials.\n",
    "chinese_title": "核电池的意外复兴",
    "chinese_summary": "核电池的潜在复兴\n\n本文探讨了核电池的潜在复兴。由于安全问题和追踪困难，这项技术此前应用受限。与核反应堆不同，这些电池从衰变原子核（通常是镍或氢的同位素）自发辐射的能量中获取能量。现代进步使得更小、更高效的设计成为可能，其寿命可能长达数十年甚至数个世纪。\n\n虽然该技术可行，并具有寿命长和能量密度高等优点，但找到合适的应用并确保妥善处理仍然是关键挑战。以前的用途包括心脏起搏器（现已因追踪问题而停用）、深空探测器和远程电源。\n\n新的潜在应用包括为机器人、无人机、传感器、生物医学植入物供电，甚至为士兵提供持久动力。本文重点介绍了多家公司和研究小组正在开发基于半导体和电化学方法来利用放射性同位素能量。\n\n关键的工程考虑因素包括基于半衰期、衰变能量和屏蔽要求等因素选择合适的放射性同位素。β和α发射体是首选，而像氚和镍-63等更安全的选择则产生低能量的β粒子。成本、安全性、许可和追踪放射性材料仍然是广泛采用的主要障碍。本文还强调了妥善处理放射性同位素的重要性，并提到了一个青少年积累大量危险放射性物质的警示故事。"
  },
  {
    "id": "45001434",
    "title": "Omarchy Is Out",
    "url": "https://world.hey.com/dhh/omarchy-is-out-4666dd31",
    "summary": "This article announces the release of Omarchy, an opinionated Arch Linux setup pre-configured with the Hyprland tiling window manager. The author describes it as their ideal developer environment, designed to provide a ready-to-use and visually appealing Linux experience. While acknowledging Arch's reputation for complexity, the author emphasizes that Omarchy is a solution for those who find Hyprland challenging to configure from scratch, as it comes with essential tools and beautiful default configurations.\n\nOmarchy is presented as a sister project to the author's Omakub (Ubuntu setup), not a replacement, recognizing Ubuntu as a gentler introduction to Linux. The author highlights Hyprland's immense customizability, making it a popular choice for users seeking unique desktop aesthetics (\"ricing\").\n\nThe author expresses optimism about the future of Linux on the desktop, citing factors like Valve's Steam Deck running on Arch, prominent creators adopting Linux, and compelling projects like Hyprland that offer unique and compelling alternatives to Windows and macOS. The author concludes by sharing their love for Linux and the desire to make it more accessible through their work.\n",
    "chinese_title": "寡头统治已终结",
    "chinese_summary": "本文宣布发布 Omarchy，这是一个预配置了 Hyprland 平铺窗口管理器的、带有主观意见的 Arch Linux 设置。作者将其描述为他们理想的开发者环境，旨在提供开箱即用且视觉上吸引人的 Linux 体验。作者承认 Arch 以其复杂性著称，但强调 Omarchy 是为那些发现从头配置 Hyprland 具有挑战性的人提供的解决方案，因为它配备了必要的工具和美观的默认配置。\n\nOmarchy 被认为是作者的 Omakub（Ubuntu 设置）的姐妹项目，而不是替代品，作者认为 Ubuntu 是 Linux 的一个更温和的入门方式。作者强调了 Hyprland 极强的可定制性，使其成为寻求独特桌面美学（“美化”）的用户的热门选择。\n\n作者对 Linux 在桌面上的未来表示乐观，并引用了诸如 Valve 的 Steam Deck 在 Arch 上运行、著名创作者采用 Linux，以及像 Hyprland 这样引人注目的项目，这些项目为 Windows 和 macOS 提供了独特的、引人注目的替代方案等因素。作者最后分享了他们对 Linux 的热爱，以及通过他们的工作使其更易于访问的愿望。"
  },
  {
    "id": "45010161",
    "title": "Git-Annex",
    "url": "https://git-annex.branchable.com/",
    "summary": "Git-annex is a tool designed to manage large files within a Git repository without storing the file content directly in Git. It allows users to sync, backup, and archive data both online and offline, ensuring data security through checksums and encryption. While geared towards command-line users, the git-annex assistant provides a user-friendly folder synchronization experience.\n\nThe document highlights key concepts, functionalities, and advanced features such as special remotes, workflows, preferred content settings, and encryption. It also delves into the internal design and scalability of git-annex.\n\nTwo use cases are presented to illustrate the tool's versatility. \"The Archivist\" (Bob) uses git-annex to manage offline archives across multiple drives, tracking file locations and ensuring long-term accessibility. \"The Nomad\" (Alice) leverages git-annex for syncing files across various devices (netbook, USB drive, cloud server) while on the move, managing storage space and leveraging distributed version control.\n\nThe page also features a news section with recent version releases, devblog updates, videos, and forum posts to keep users informed about the project's developments and community discussions. It emphasizes that git-annex is free software written in Haskell and encourages contributions.\n",
    "chinese_title": "Git-Annex",
    "chinese_summary": "Git-annex 是一款旨在 Git 仓库中管理大型文件的工具，它不会将文件内容直接存储在 Git 中。它允许用户在线和离线同步、备份和归档数据，并通过校验和与加密确保数据安全。虽然主要面向命令行用户，但 git-annex 助手提供了用户友好的文件夹同步体验。\n\n本文档重点介绍了关键概念、功能和高级特性，如特殊远程仓库、工作流程、首选内容设置和加密。它还深入研究了 git-annex 的内部设计和可扩展性。\n\n本文展示了两个用例，说明了该工具的多功能性。“档案管理员” (Bob) 使用 git-annex 管理多个驱动器上的离线档案，跟踪文件位置并确保长期可访问性。“游牧者” (Alice) 利用 git-annex 在移动过程中跨各种设备（上网本、USB 驱动器、云服务器）同步文件，管理存储空间并利用分布式版本控制。\n\n该页面还设有新闻版块，包含最近的版本发布、开发博客更新、视频和论坛帖子，以便用户了解项目的进展和社区讨论。它强调 git-annex 是用 Haskell 编写的自由软件，并鼓励贡献。"
  },
  {
    "id": "44990839",
    "title": "Busy beaver hunters reach numbers that overwhelm ordinary math",
    "url": "https://www.quantamagazine.org/busy-beaver-hunters-reach-numbers-that-overwhelm-ordinary-math-20250822/",
    "summary": "This Quanta Magazine article discusses the ongoing quest to determine \"busy beaver numbers,\" a sequence related to the halting problem in computer science. The nth busy beaver number, BB(n), represents the maximum number of steps a Turing machine with n rules can run before halting. While the first five busy beaver numbers have been found, determining BB(6) has proven incredibly difficult.\n\nThe article highlights the efforts of both professional and amateur mathematicians collaborating within the Busy Beaver Challenge. Recent breakthroughs by a mysterious contributor known as mxdys have established a new, significantly larger lower bound for BB(6). This number is so immense it's impossible to express using standard mathematical notation; it exceeds towers of exponents that would require more atoms than exist in the universe to write down.\n\nThe article explains the progression of champion machines, from runtimes that could be written on a sheet of paper to those requiring tetration (repeated exponentiation) and even pentation (repeated tetration) to represent. The article also mentions the discovery of challenging \"holdout\" machines, such as Antihydra, whose halting behavior is linked to unsolved mathematical problems like the Collatz conjecture.  The article concludes by emphasizing that while the true value of BB(6) remains elusive, the pursuit continues due to the inherent fun and artistic nature of the mathematical exploration.\n",
    "chinese_title": "忙碌海狸猎手数目之巨超出常规数学范畴",
    "chinese_summary": "Quanta杂志的这篇文章讨论了确定“忙碌海狸数”的持续探索，这是一个与计算机科学中停机问题相关的序列。第n个忙碌海狸数，BB(n)，代表了具有n条规则的图灵机在停机之前可以运行的最大步数。虽然前五个忙碌海狸数已被找到，但确定BB(6)已被证明非常困难。\n\n这篇文章重点介绍了专业和业余数学家在“忙碌海狸挑战”中的合作努力。一位神秘的贡献者mxdys的最新突破为BB(6)建立了一个新的、显著更大的下限。这个数字如此巨大，以至于无法用标准的数学符号来表示；它超过了指数塔，写下来所需的原子比宇宙中存在的原子还要多。\n\n这篇文章解释了冠军机器的演变过程，从可以在一张纸上写下来的运行时间，到需要四次运算（重复指数）甚至五次运算（重复四次运算）来表示的运行时间。文章还提到了具有挑战性的“保留”机器的发现，例如Antihydra，其停机行为与未解决的数学问题（如考拉兹猜想）有关。文章最后强调，虽然BB(6)的真实值仍然难以捉摸，但由于数学探索固有的乐趣和艺术性，这种追求仍在继续。"
  },
  {
    "id": "45013774",
    "title": "Japan's Creepiest Station",
    "url": "https://www.tokyocowboy.co/articles/doai-eki-japans-creepiest-station",
    "summary": "Ben Leighton's article \"Japan's Creepiest Station\" details the unsettling experience of visiting Doai Eki station, located between Gunma and Niigata prefectures in Japan. While the southbound platform appears ordinary, the northbound platform offers a vastly different and unsettling experience.\n\nTo reach the northbound platform, passengers must descend 70 meters via almost 500 steps into the Shin-Shimizu tunnel, a 15-minute walk from the main station. The descent is described as terrifying due to the lack of visibility and the increasing sound of water trickling into the tunnel.\n\nThe northbound platform itself is located in a dark, damp cavern deep within a mountain, earning Doai the nickname \"Japan’s no 1 station for moles.” Breathing is noticeably more difficult in the cavern. A waiting room provides a semblance of life, but the anonymous notes and random photos left by visitors create an eerie, Silent Hill-esque atmosphere.\n\nAdding to the station's spooky ambiance is its proximity to Mount Tanigawa, also known as \"Death Mountain,\" due to the high number of climbing fatalities. The mountain's grim history, including the discovery of bodies of missing climbers after 30 years, further enhances the overall unsettling feeling of Doai Eki.\n",
    "chinese_title": "日本最恐怖的车站",
    "chinese_summary": "本·莱顿的文章《日本最诡异的车站》详细描述了探访位于日本群马县和新泻县之间的土合车站令人不安的经历。南行站台看似普通，而北行站台则提供了一种截然不同且令人不安的体验。\n\n要到达北行站台，乘客必须通过近500级台阶下降70米进入新清水隧道，从主站步行需要15分钟。由于缺乏能见度以及隧道内水滴声越来越大，这种下降被描述为令人恐惧。\n\n北行站台本身位于山体深处一个黑暗潮湿的洞穴中，这使得土合车站赢得了“日本第一鼹鼠车站”的绰号。在洞穴中呼吸明显更加困难。候车室提供了一丝生机，但游客留下的匿名便条和随机照片营造出一种怪异的、寂静岭式的氛围。\n\n由于靠近谷川岳，土合车站的怪异氛围更加浓厚，谷川岳又被称为“死亡之山”，原因是登山死亡人数众多。这座山令人毛骨悚然的历史，包括在30年后发现失踪登山者的尸体，进一步增强了土合车站的整体不安感。"
  },
  {
    "id": "45001466",
    "title": "A lightweight TypeScript library for assertion-based runtime data validation",
    "url": "https://github.com/nimeshnayaju/decode-kit",
    "summary": "Valleys is a lightweight, zero-dependency TypeScript library for runtime data validation using an assertion-based approach. Unlike libraries like Zod or Valibot, Valleys validates data in-place without cloning or transforming it, leading to performance benefits, especially in memory-sensitive applications. It refines the TypeScript type of the input variable directly after successful validation.\n\nThe library uses a fail-fast error handling approach, throwing a `ValidationError` upon the first validation failure. This error includes the path to the error, the expected schema, and a human-readable error message.\n\nValleys offers several validator functions, including `string()`, `number()`, `boolean()`, `constant()`, `null_()`, `undefined_()`, `iso8601()`, `array()`, and `object()`. Each validator has optional rules for specifying constraints like minimum/maximum length or value ranges. The `or()` function creates union type validators.\n\nThe library exports the `InferOutputOf<D>` type utility to extract the output type of a validator and the `Iso8601` branded type for ISO 8601 date strings.\n\nValleys aims for performance and memory efficiency by avoiding unnecessary data copying during validation, making it suitable for performance-critical applications. The API is inspired by the Decoders library.\n",
    "chinese_title": "基于断言的运行时数据验证的轻量级 TypeScript 库",
    "chinese_summary": "Valleys 是一个轻量级的、零依赖的 TypeScript 库，它使用基于断言的方法进行运行时数据验证。与 Zod 或 Valibot 等库不同，Valleys 直接在原地验证数据，无需克隆或转换，从而带来性能优势，尤其是在对内存敏感的应用程序中。成功验证后，它会直接细化输入变量的 TypeScript 类型。\n\n该库采用快速失败的错误处理方法，在首次验证失败时抛出一个 `ValidationError`。此错误包含错误路径、预期模式和人类可读的错误消息。\n\nValleys 提供了几个验证器函数，包括 `string()`、`number()`、`boolean()`、`constant()`、`null_()`、`undefined_()`、`iso8601()`、`array()` 和 `object()`。每个验证器都有可选的规则，用于指定约束，例如最小/最大长度或值范围。`or()` 函数创建联合类型验证器。\n\n该库导出 `InferOutputOf<D>` 类型实用程序来提取验证器的输出类型，并导出 `Iso8601` 品牌类型用于 ISO 8601 日期字符串。\n\nValleys 旨在通过避免在验证期间不必要的数据复制来实现性能和内存效率，使其适用于对性能至关重要的应用程序。该 API 的灵感来自 Decoders 库。"
  },
  {
    "id": "45005434",
    "title": "We put a coding agent in a while loop",
    "url": "https://github.com/repomirrorhq/repomirror/blob/main/repomirror.md",
    "summary": "This article, titled \"We put a coding agent in a while loop,\" discusses an experiment involving a coding agent placed within a continuous \"while loop\" environment. The repository \"repomirrorhq/repomirror\" on GitHub is likely the location where the code and related resources for this experiment can be found.\n\nThe article likely explores the behavior and capabilities of the coding agent when faced with repetitive tasks or a continuous learning scenario. Key aspects of the experiment probably include:\n\n*   **The coding agent:** Its architecture, programming language, and specific functionalities.\n*   **The \"while loop\" environment:** The nature of the tasks or problems presented to the agent within the loop, and the criteria for success or failure.\n*   **The agent's learning and adaptation:** How the agent's performance evolves over time as it iterates through the loop, potentially improving its coding skills or problem-solving abilities.\n*   **Potential issues and challenges:** Including the agent's tendency to get stuck in local optima, exhibit instability, or generate unintended consequences.\n\nThe article's goal is likely to provide insights into the potential and limitations of using coding agents in automated software development, continuous integration/continuous deployment (CI/CD) pipelines, or other scenarios where repetitive coding tasks are common. The repository's metrics (8 forks, 110 stars) suggest that the project has garnered some interest within the coding and AI community.\n",
    "chinese_title": "我们把一个编码智能体放进了while循环里。",
    "chinese_summary": "我们将一个编码智能体放入while循环\n这篇题为《我们将一个编码智能体放入while循环》的文章讨论了一项实验，该实验涉及将一个编码智能体置于一个连续的“while循环”环境中。GitHub上的仓库“repomirrorhq/repomirror”很可能可以找到该实验的代码和相关资源。\n\n该文章可能探讨了编码智能体在面对重复性任务或持续学习场景时的行为和能力。该实验的关键方面可能包括：\n\n* **编码智能体：** 它的架构、编程语言和具体功能。\n* **“while循环”环境：** 循环中呈现给智能体的任务或问题的性质，以及成功或失败的标准。\n* **智能体的学习和适应：** 智能体的表现如何随着在循环中的迭代而随时间演变，从而可能提高其编码技能或解决问题的能力。\n* **潜在问题和挑战：** 包括智能体陷入局部最优、表现出不稳定或产生意外后果的倾向。\n\n该文章的目标可能是深入了解在自动化软件开发、持续集成/持续部署 (CI/CD) 管道或重复编码任务常见的其他场景中使用编码智能体的潜力和局限性。该仓库的指标（8个fork，110个star）表明该项目已经引起了编码和人工智能社区的一些兴趣。"
  },
  {
    "id": "45012548",
    "title": "Prediction-Encoded Pixels image format",
    "url": "https://github.com/ENDESGA/PEP",
    "summary": "The \"Prediction-Encoded Pixels\" (PEP) format is a new image format designed for compressing low-color pixel art (ideally <= 16 colors, supports up to 256). It uses \"Prediction by Partial Matching, Order-2\" compression, offering smaller file sizes than GIF, PNG, and QOI, at the cost of slower compression/decompression speeds (2-10x slower than GIF/PNG/QOI). It typically achieves 20-50% smaller file sizes compared to GIF/PNG.\n\nThe article provides usage instructions for the PEP format using a C header file (\"PEP.h\"). It includes performance benchmarks comparing PEP to other formats like PNG, GIF, QOI, and BMP across different images, demonstrating PEP's smaller file sizes.\n\nThe mini-documentation details how to use the PEP compression and decompression functions: `pep_compress()`, `pep_decompress()`, `pep_free()`, `pep_serialize()`, `pep_deserialize()`, `pep_save()`, and `pep_load()`. It explains the parameters and return values of each function, outlining how to compress raw pixel data, decompress PEP data, free memory, serialize and deserialize PEP structures, and save/load PEP files. The format's data pointer only contains the bytes for the pixels.\n\nThe article also cites academic papers that inspired the underlying compression techniques used in PEP. The author encourages contributions to improve the format further. It's currently in an experimental phase.\n",
    "chinese_title": "预测编码像素图像格式",
    "chinese_summary": "“预测编码像素”(PEP) 格式是一种新的图像格式，专为压缩低色彩像素艺术而设计（理想情况下 <= 16 色，支持高达 256 色）。 它采用 “部分匹配预测，阶数 2” 压缩，与 GIF、PNG 和 QOI 相比，文件尺寸更小，但代价是压缩/解压缩速度较慢（比 GIF/PNG/QOI 慢 2-10 倍）。 通常，它比 GIF/PNG 实现 20-50% 更小的文件尺寸。\n\n本文提供了使用 C 头文件 (“PEP.h”) 操作 PEP 格式的使用说明。 它包含性能基准测试，比较了 PEP 与 PNG、GIF、QOI 和 BMP 等其他格式在不同图像上的表现，展示了 PEP 更小的文件尺寸。\n\n迷你文档详细介绍了如何使用 PEP 压缩和解压缩函数：`pep_compress()`、`pep_decompress()`、`pep_free()`、`pep_serialize()`、`pep_deserialize()`、`pep_save()` 和 `pep_load()`。 它解释了每个函数的参数和返回值，概述了如何压缩原始像素数据、解压缩 PEP 数据、释放内存、序列化和反序列化 PEP 结构以及保存/加载 PEP 文件。 该格式的数据指针仅包含像素的字节。\n\n本文还引用了启发 PEP 中使用的底层压缩技术的学术论文。 作者鼓励大家贡献力量以进一步改进该格式。 目前它处于实验阶段。"
  },
  {
    "id": "45005545",
    "title": "Is 4chan the perfect Pirate Bay poster child to justify wider UK site-blocking?",
    "url": "https://torrentfreak.com/uk-govt-finds-ideal-pirate-bay-poster-boy-to-sell-blocking-of-non-pirate-sites-250824/",
    "summary": "This article critiques the UK's Online Safety Act (OSA) and its potential use of site-blocking, arguing that it resembles censorship disguised as child protection. It highlights concerns about identity verification requirements, potential fines for large websites, and the silencing of dissent through tactics like labeling critics as \"predator enablers.\"\n\nThe piece draws parallels between the UK government's current approach and the earlier blocking of The Pirate Bay, suggesting the government may use a similar strategy to justify wider site-blocking under the OSA. The Pirate Bay case was a carefully orchestrated \"easy win\" due to the site's notorious reputation, predictable non-compliance, and absence from court proceedings.\n\nThe article posits that the UK government is now using 4chan as a \"poster child\" for regular site blocking. After 4chan failed to respond to Ofcom's requests for an illegal content risk assessment, Ofcom launched an investigation into 4chan's compliance. However, 4chan has hired US attorneys who plan to resist Ofcom's actions, arguing they undermine constitutional rights.\n\nThe author argues that unlike The Pirate Bay case, pursuing action against 4chan is a potential \"disaster\" due to the legal challenge in the U.S. and the potential for a political clash between the UK and the US regarding free speech. The author raises the question of who is setting UK government policy on free speech, pointing out a contradiction between Ofcom's actions and statements made by the Prime Minister.\n",
    "chinese_title": "4chan是证明英国扩大网站屏蔽范围的完美盗版湾代言人吗？",
    "chinese_summary": "本文批判英国的《网络安全法案》(OSA)及其潜在的网站封锁应用，认为这类似于伪装成儿童保护的审查。 文章强调了对身份验证要求、大型网站潜在罚款以及通过将批评者标记为“捕食者帮凶”等手段压制异见的担忧。\n\n文章将英国政府目前的做法与早期封锁海盗湾的做法相提并论，表明政府可能使用类似策略来证明在《网络安全法案》下更广泛的网站封锁是正当的。 由于海盗湾臭名昭著的声誉、可预测的不合规以及缺席法庭诉讼，该案例是一个精心策划的“轻松胜利”。\n\n文章假设英国政府现在正在使用4chan作为常规网站封锁的“典型案例”。 在4chan未能回应英国通讯管理局（Ofcom）关于非法内容风险评估的请求后，Ofcom启动了对4chan合规性的调查。 然而，4chan已聘请美国律师，他们计划抵制Ofcom的行动，理由是这些行动破坏了宪法权利。\n\n作者认为，与海盗湾案件不同，由于在美国面临法律挑战以及英国和美国之间可能就言论自由问题发生政治冲突，针对4chan采取行动可能是一场“灾难”。 作者提出了谁在制定英国政府的言论自由政策的问题，并指出了Ofcom的行动与首相的声明之间的矛盾。"
  },
  {
    "id": "45009164",
    "title": "The Unix-Haters Handbook (1994) [pdf]",
    "url": "https://simson.net/ref/ugh.pdf",
    "summary": "This appears to be a fragment of the PDF code for \"The Unix-Haters Handbook\" (1994). The code itself doesn't reveal the content of the book, but rather describes the structure of the PDF file, including its version, object references, table of contents (Outlines), and page layout.\n\nHere's what we can gather from the provided code:\n\n*   **Title:** The document is \"The Unix-Haters Handbook\".\n*   **Format:** It's a PDF document, version 1.2.\n*   **Structure:** The PDF is linearized for faster web viewing. It has a catalog, pages, outlines (table of contents), and named destinations.\n*   **Table of Contents:** The outlines suggest a top-level entry for the title of the book and another presumably for \"The UNIX-\". It also appears to include links to the table of contents.\n*   **Page Settings:** The code includes parameters like page size (MediaBox), crop box dimensions, and rotation.\n*   **Content Encoding:** The actual text and images are likely stored within the `/Contents` streams, compressed using FlateDecode.\n\nTo summarize, the provided code represents the structural elements of a PDF file for a book titled \"The Unix-Haters Handbook.\" The content of the book itself is not revealed, but the code defines how the document is organized and displayed. It's a technical representation rather than the book's actual arguments or viewpoints.\n",
    "chinese_title": "Unix 憎恨者手册 (1994) [pdf]",
    "chinese_summary": "这似乎是《UNIX仇恨者手册》(1994)的PDF代码片段。代码本身并未揭示书的内容，而是描述了PDF文件的结构，包括其版本、对象引用、目录（大纲）和页面布局。\n\n从提供的代码中我们可以得知：\n\n*   **标题：** 该文档是“The Unix-Haters Handbook”。\n*   **格式：** 它是PDF文档，版本1.2。\n*   **结构：** PDF经过线性化处理，以便更快地进行网页浏览。它包含目录、页面、大纲（目录）和命名目标。\n*   **目录：** 大纲显示了书籍标题的顶级条目，以及另一个可能是“The UNIX-”的条目。它似乎还包含指向目录的链接。\n*   **页面设置：** 代码包含页面大小（MediaBox）、裁剪框尺寸和旋转等参数。\n*   **内容编码：** 实际文本和图像可能存储在 `/Contents` 流中，并使用FlateDecode压缩。\n\n总而言之，提供的代码代表了一本名为“The Unix-Haters Handbook”的书籍的PDF文件的结构元素。书的内容本身并未透露，但代码定义了文档的组织和显示方式。它是一种技术表示，而不是书籍的实际论点或观点。"
  },
  {
    "id": "45011096",
    "title": "We put agentic AI browsers to the test – They clicked, they paid, they failed",
    "url": "https://guard.io/labs/scamlexity-we-put-agentic-ai-browsers-to-the-test-they-clicked-they-paid-they-failed",
    "summary": "This article, titled \"We Put Agentic AI Browsers to the Test – They Clicked, They Paid, They Failed,\" explores the security risks associated with agentic AI browsers, coining the term \"Scamlexity\" to describe the increased complexity and danger of scams in the age of AI. Researchers tested Perplexity's Comet, an AI browser that autonomously browses, clicks links, and performs tasks, and found it vulnerable to old and new scam tactics.\n\nThe AI browser fell for simple scams like purchasing from a fake Walmart store and clicking links in phishing emails from a fake Wells Fargo account, automatically inputting saved credentials and personal information. This exposes a trust chain vulnerability where users trust the AI implicitly, bypassing their own judgment.\n\nThe article introduces \"PromptFix,\" a new AI-era attack leveraging prompt injection, hiding malicious instructions within seemingly harmless captchas to manipulate the AI's actions, such as downloading malicious files or granting unauthorized access.\n\nThe authors argue that AI browsers prioritize user experience over security, inheriting AI's inherent vulnerabilities. They emphasize the need for built-in security guardrails tailored for AI, including phishing detection, URL checks, and anomaly detection. The future of scams in an \"AI-vs-AI\" era involves attackers training malicious AI to exploit vulnerabilities in other AI models, creating endless zero-day scams. The authors conclude that proactive security measures are crucial to closing the \"Scamlexity gap\" and protecting users in this new landscape.\n",
    "chinese_title": "我们测试了自主AI浏览器——它们点击、支付，然后失败了。",
    "chinese_summary": "我们将具身AI浏览器投入测试——它们点击、支付，却失败了\n\n本文探讨了具身AI浏览器相关的安全风险，创造了“Scamlexity”一词来描述人工智能时代诈骗的复杂性和危险性日益增加。研究人员测试了Perplexity的Comet，一款能够自主浏览、点击链接并执行任务的AI浏览器，发现它很容易受到新旧诈骗手段的攻击。\n\n该AI浏览器会轻易上当受骗，例如从虚假的沃尔玛商店购买商品，以及点击来自虚假富国银行账户的网络钓鱼邮件中的链接，并自动输入保存的凭据和个人信息。这暴露了一个信任链漏洞，用户隐含地信任AI，从而绕过了自己的判断。\n\n本文介绍了一种名为“PromptFix”的新型AI时代攻击，该攻击利用提示注入，将恶意指令隐藏在看似无害的验证码中，以操纵AI的行为，例如下载恶意文件或授予未经授权的访问权限。\n\n作者认为，AI浏览器优先考虑用户体验而非安全性，并继承了AI固有的漏洞。他们强调需要为AI量身定制内置安全防护措施，包括网络钓鱼检测、URL检查和异常检测。在“AI对AI”的时代，诈骗的未来涉及攻击者训练恶意AI来利用其他AI模型中的漏洞，从而制造层出不穷的零日诈骗。作者总结说，积极的安全措施对于弥合“Scamlexity差距”并在这种新形势下保护用户至关重要。"
  },
  {
    "id": "45012931",
    "title": "The Size of Adobe Reader Installers Through the Years",
    "url": "https://sigwait.org/~alex/blog/2025/08/25/zw6z4E.html",
    "summary": "This article, last updated on August 25, 2025, discusses the increasing size of Adobe Reader installers over time. It notes that the latest 64-bit Windows 11 installer (version 25.x.y.z) is a substantial 687,230,424 bytes and includes features like AI, an auto-updater, ads for Acrobat online services, and two GUIs.\n\nIn contrast, the author highlights the much smaller size (8,246,744 bytes) and simplicity of SumatraPDF-3.5.2, which lacks unnecessary features like AI, a mandatory auto-updater, and advertisements. The author suggests SumatraPDF is preferable as it can be easily updated via scoop, making auto-updates redundant.\n\nThe article emphasizes the bloat and unnecessary additions to Adobe Reader installers as a trend over the years, contrasting it with the streamlined approach of alternative PDF readers like SumatraPDF. The article includes a chart (unseen in this summary) that visually represents this growth.\n",
    "chinese_title": "Adobe Reader 各版本安装包大小",
    "chinese_summary": "本文（最后更新于2025年8月25日）讨论了Adobe Reader安装包体积随时间增长的问题。文章指出，最新的64位Windows 11安装包（版本25.x.y.z）体积高达687,230,424字节，包含AI、自动更新程序、Acrobat在线服务广告和两个GUI等功能。\n\n相比之下，作者强调SumatraPDF-3.5.2体积小巧（8,246,744字节）且简洁，缺乏不必要的AI功能、强制自动更新程序和广告。作者认为SumatraPDF更胜一筹，因为它可以通过Scoop轻松更新，使自动更新变得多余。\n\n文章强调了多年来Adobe Reader安装包的臃肿和不必要的增加，并将其与SumatraPDF等替代PDF阅读器的精简方法进行了对比。文章包含一张图表（本摘要中未见），以直观地表示这种增长。"
  },
  {
    "id": "45008819",
    "title": "Show HN: Sping – An HTTP/TCP latency tool that's easy on the eye",
    "url": "https://dseltzer.gitlab.io/sping/docs/",
    "summary": "Sping is a modern terminal-based tool for monitoring HTTP/TCP latency, offering real-time visualization and advanced analytics. Inspired by `nvitop`, it aims to be easy to install (via pip) and provide compelling screenshots for communication. It supports HTTP, HTTPS, and TCP protocols, displaying interactive charts, live statistics, and detailed phase timing (DNS, connection, TLS, request, response).\n\nKey features include automatic outlier detection using MAD (Median Absolute Deviation), threshold alerting, DNS control (IPv4/IPv6), percentile statistics, multiple output formats (interactive UI, plain text, JSON), authentication support, and customizable color palettes.\n\nInstallation is simple using `pip install service-ping-sping`. Sping offers a variety of usage examples, from basic HTTP monitoring to advanced scenarios like outlier detection, data export, and threshold-based alerts. Outlier detection identifies unusual latency spikes based on deviations from a rolling baseline.\n\nCommand-line options allow customization of intervals, timeouts, HTTP methods, DNS resolution, authentication, UI refresh rate, and color palettes. The tool provides different output formats, including an interactive UI, plain text for scripting, and JSON for automation. Exit codes (0, 1, 2) reflect success, warning, and critical thresholds, respectively. Sping requires Python 3.9+ and works on Linux, macOS, and Windows.\n",
    "chinese_title": "Show HN: Sping – 一款赏心悦目的 HTTP/TCP 延迟测试工具",
    "chinese_summary": "Sping：一款现代终端 HTTP/TCP 延迟监控工具，提供实时可视化和高级分析。它受到 `nvitop` 的启发，旨在易于安装（通过 pip）并提供引人注目的屏幕截图用于沟通。它支持 HTTP、HTTPS 和 TCP 协议，显示交互式图表、实时统计数据和详细的阶段计时（DNS、连接、TLS、请求、响应）。\n\n主要功能包括使用 MAD（绝对中位差）的自动异常值检测、阈值警报、DNS 控制（IPv4/IPv6）、百分位数统计、多种输出格式（交互式 UI、纯文本、JSON）、身份验证支持和可自定义的调色板。\n\n使用 `pip install service-ping-sping` 即可轻松安装。 Sping 提供了各种使用示例，从基本的 HTTP 监控到高级场景，如异常值检测、数据导出和基于阈值的警报。异常值检测基于与滚动基线的偏差来识别异常的延迟峰值。\n\n命令行选项允许自定义间隔、超时、HTTP 方法、DNS 解析、身份验证、UI 刷新率和调色板。该工具提供不同的输出格式，包括交互式 UI、用于脚本的纯文本和用于自动化的 JSON。退出代码（0、1、2）分别反映成功、警告和严重阈值。 Sping 需要 Python 3.9+，可在 Linux、macOS 和 Windows 上运行。"
  },
  {
    "id": "45001883",
    "title": "In-Memory Filesystems in Rust",
    "url": "https://andre.arko.net/2025/08/18/in-memory-filesystems-in-rust/",
    "summary": "This article details the author's frustrating journey to find or create an in-memory filesystem solution in Rust for faster testing of a CLI tool that manages files. Inspired by Go's Afero package, the author sought a Rust equivalent to abstract `std::fs` and swap in a fast in-memory backend for tests.\n\nThe author explored the `vfs` crate, which allows swapping backends, but found it lacked crucial features like symlink support and file permissions, making it unsuitable for their needs (specifically, the ability to create executables).  They then investigated `rsfs`, which aims to mimic `std::fs` with an in-memory option, but its design resulted in significantly more complex type signatures.\n\nSurprisingly, benchmarking revealed virtually no performance difference between using `rsfs` with an in-memory filesystem, `rsfs` with the regular filesystem, `std::fs` against a ramdisk, and `std::fs` against a regular SSD. All clocked in around the same time.\n\nThe author concludes that modern SSDs and OS filesystem caches are so efficient that the overhead of real filesystem interactions is negligible, negating any performance benefit from using an in-memory filesystem in this specific scenario.  They end by questioning the assumptions about syscall cost versus function call cost and invite readers to share examples where in-memory filesystems *do* offer a performance advantage in Rust.  Ultimately, the author suggests sticking with testing directly against the regular filesystem.\n",
    "chinese_title": "Rust 中的内存文件系统",
    "chinese_summary": "本文详细介绍了作者在 Rust 中寻找或创建内存文件系统解决方案的令人沮丧的经历，目的是为了更快地测试一个管理文件的 CLI 工具。受 Go 的 Afero 包的启发，作者寻求一个 Rust 等价物来抽象 `std::fs`，并为测试换入一个快速的内存后端。\n\n作者研究了 `vfs` crate，它允许交换后端，但发现它缺乏诸如符号链接支持和文件权限等关键功能，使其不适合他们的需求（特别是，创建可执行文件的能力）。然后，他们调查了 `rsfs`，它旨在用一个内存选项来模仿 `std::fs`，但它的设计导致了更复杂的类型签名。\n\n令人惊讶的是，基准测试显示，使用带有内存文件系统的 `rsfs`、带有常规文件系统的 `rsfs`、针对 ramdisk 的 `std::fs` 以及针对常规 SSD 的 `std::fs` 之间几乎没有性能差异。所有这些都在大致相同的时间内完成。\n\n作者的结论是，现代 SSD 和操作系统文件系统缓存非常高效，以至于真实的文件系统交互的开销可以忽略不计，从而否定了在这种特定情况下使用内存文件系统所带来的任何性能优势。最后，他们质疑关于系统调用成本与函数调用成本的假设，并邀请读者分享内存文件系统在 Rust 中 *确实* 提供性能优势的例子。最终，作者建议坚持直接针对常规文件系统进行测试。"
  },
  {
    "id": "44986723",
    "title": "Trees on city streets cope with drought by drinking from leaky pipes",
    "url": "https://www.newscientist.com/article/2487804-trees-on-city-streets-cope-with-drought-by-drinking-from-leaky-pipes/",
    "summary": "Trees growing on Montreal streets are surprisingly more resistant to drought than those in parks, a phenomenon attributed to leaky pipes. Researchers at the University of Quebec investigated this by analyzing trunk samples from maple trees in both locations, measuring lead isotopes to trace the water source. The study found that street trees contained lead isotopes originating from old lead water pipes, unlike park trees, which showed isotopes linked to air pollution.\n\nGiven the concrete-covered streets and drainage systems that limit rainwater access, researchers concluded that street trees are likely drawing water from Montreal's leaky pipes, which lose a significant amount of water daily. This unconventional water source allows street trees to meet their high water demands, around 50 liters per day, making them surprisingly resilient. The finding challenges the assumption that park trees, with more natural access to water, would be healthier and highlights the hidden benefits of urban infrastructure flaws for street tree survival. It suggests that planting trees on city streets is a viable way to enhance urban environments, as they are more likely to thrive despite drought conditions.\n",
    "chinese_title": "城市街道上的树木靠饮用漏水管道中的水来应对干旱",
    "chinese_summary": "蒙特利尔街道树木比公园树木更耐旱，原因在于漏水管道。魁北克大学研究人员通过分析两地枫树的树干样本，测量铅同位素来追踪水源，发现街道树木含有来自旧铅水管的铅同位素，而公园树木则显示与空气污染相关的同位素。\n\n鉴于覆盖水泥的街道和限制雨水进入的排水系统，研究人员得出结论，街道树木可能从蒙特利尔的漏水管道中汲取水分，这些管道每天会损失大量水分。这种非传统的水源使街道树木能够满足其每天约50升的高需水量，从而使其具有惊人的韧性。这一发现挑战了公园树木因更容易获得天然水源而更健康的假设，并突出了城市基础设施缺陷对街道树木生存的隐藏好处。它表明，在城市街道上种植树木是改善城市环境的可行方法，因为它们更有可能在干旱条件下茁壮成长。"
  },
  {
    "id": "45010183",
    "title": "Ban me at the IP level if you don't like me",
    "url": "https://boston.conman.org/2025/08/21.1",
    "summary": "This blog post from August 21, 2025, details the author's frustration with a webbot called \"Thinkbot\" and its behavior. Thinkbot, identifying itself with a message that essentially encourages IP blocking, doesn't respect robots.txt and scrapes content aggressively. The author found that Thinkbot used 74 unique IP addresses within a month, all traced back to 41 network blocks owned by Tencent.\n\nThe author suspects the CCP may be indirectly encouraging such behavior, potentially shifting the burden of content filtering onto others. Frustrated by Thinkbot's disregard for standard web etiquette and the difficulty of effectively blocking it, the author added 41 Tencent-owned network blocks to their \"badbots firewall rule set.\" This action blocks a significant range of 476,590 IP addresses.\n\nThe author expresses disappointment that such measures are necessary in the current internet landscape, lamenting the inability to have \"nice things\" due to malicious bot activity. The post also includes links to discussions about the entry on platforms like Lobsters, Lemmy, and Hacker News. The author leans towards supporting something like Alex Schroeder's Butlerian Jihad (a rejection of advanced technology) as a result of these experiences.\n",
    "chinese_title": "不喜欢我就把我IP封了",
    "chinese_summary": "2025年8月21日的这篇博文详细描述了作者对一个名为“Thinkbot”的网络爬虫及其行为的沮丧。 Thinkbot，通过一条本质上鼓励屏蔽IP地址的消息来表明身份，不尊重robots.txt协议，并积极抓取内容。 作者发现Thinkbot在一个月内使用了74个不同的IP地址，全部追溯到腾讯拥有的41个网络块。\n\n作者怀疑中共可能在间接鼓励这种行为，可能将内容过滤的负担转移到其他人身上。 由于Thinkbot无视标准的网络礼仪以及有效屏蔽它的难度，作者感到沮丧，因此将41个腾讯拥有的网络块添加到他们的“恶意爬虫防火墙规则集”中。 这一行动阻止了476,590个IP地址的相当大的范围。\n\n作者表达了对当前互联网环境下需要采取此类措施的失望之情，感叹由于恶意机器人活动而无法拥有“美好的事物”。 该帖子还包括指向Lobsters、Lemmy和Hacker News等平台上关于该条目的讨论的链接。 作者倾向于支持像Alex Schroeder的巴特勒圣战（对先进技术的排斥）之类的东西，这源于这些经历。"
  },
  {
    "id": "44965577",
    "title": "Claim: GPT-5-pro can prove new interesting mathematics",
    "url": "https://twitter.com/SebastienBubeck/status/1958198661139009862",
    "summary": "The content provided is not an article but rather the standard \"JavaScript disabled\" error message from X (formerly Twitter). There is no mathematical claim or discussion of GPT-5-pro's capabilities within this content. Therefore, it's impossible to provide a summary of the purported claim regarding GPT-5-pro's mathematical abilities.\n",
    "chinese_title": "声明：GPT-5-pro能证明新的有趣数学",
    "chinese_summary": "提供的内容并非文章，而是X（前身为Twitter）的标准“JavaScript已禁用”错误消息。 此内容中没有关于GPT-5-pro功能的数学主张或讨论。 因此，不可能提供有关GPT-5-pro数学能力的所谓声明的摘要。"
  },
  {
    "id": "44970769",
    "title": "The two versions of Parquet",
    "url": "https://www.jeronimo.dev/the-two-versions-of-parquet/",
    "summary": "Jerónimo López's article explores the complexities of Parquet Version 2 adoption in the data engineering ecosystem. While Parquet V2 offers performance improvements in file size, writing, and reading speeds, especially with uncompressed data and numeric-heavy datasets, its adoption is hampered by incomplete implementation and support across various tools and query engines.\n\nThe core issue lies in a lack of consensus on what constitutes full V2 compatibility, particularly concerning encoding methods (like RLE_DICTIONARY) and Data Page V2 (how data is structured within the file). Older Pandas versions, for example, cannot read Parquet V2 files, highlighting the potential for compatibility issues.\n\nLópez's performance benchmarks, using Italian government and New York taxi datasets, demonstrate that V2 can lead to smaller file sizes (particularly when uncompressed) and faster writing and reading times compared to V1. However, the gains might not always be significant enough to warrant the risk of incompatibility.\n\nThe article concludes that while Parquet remains a crucial data engineering format, the challenges of evolving an open standard are significant.  Adopting Parquet V2 can be beneficial if you control the entire data pipeline.  However, the widespread incompatibility with various tools and the lack of full support means users should cautiously consider the trade-offs before adopting the latest specification, particularly when interoperability with third-party tools is required. The article emphasizes the importance of awareness and careful evaluation when choosing between Parquet versions.\n",
    "chinese_title": "Parquet的两个版本",
    "chinese_summary": "耶罗尼莫·洛佩兹的文章探讨了数据工程生态系统中采用 Parquet 版本 2 的复杂性。虽然 Parquet V2 在文件大小、写入和读取速度方面提供了性能改进，尤其是在未压缩数据和数字密集型数据集方面，但由于各种工具和查询引擎中实施和支持的不完整性，其采用受到阻碍。\n\n核心问题在于对构成完整 V2 兼容性的内容缺乏共识，特别是关于编码方法（如 RLE_DICTIONARY）和数据页 V2（数据在文件中如何结构化）。例如，较旧的 Pandas 版本无法读取 Parquet V2 文件，突显了兼容性问题的可能性。\n\n洛佩兹使用意大利政府和纽约出租车数据集进行的性能基准测试表明，V2 可以带来更小的文件大小（尤其是在未压缩时）以及更快的写入和读取时间，与 V1 相比。但是，这些收益可能并不总是足够重要，以至于值得冒不兼容的风险。\n\n文章的结论是，虽然 Parquet 仍然是一种关键的数据工程格式，但发展开放标准所面临的挑战是巨大的。 如果你控制整个数据管道，采用 Parquet V2 可能会有所帮助。 然而，与各种工具的广泛不兼容以及缺乏完全支持意味着用户在采用最新规范之前应谨慎考虑权衡，尤其是在需要与第三方工具互操作时。 该文章强调了在选择 Parquet 版本时，保持意识和进行仔细评估的重要性。"
  },
  {
    "id": "45008239",
    "title": "From Hackathon to YC",
    "url": "https://www.producthunt.com/p/april-yc-s25/from-hackathon-to-yc",
    "summary": "Neha Suresh, founder of April, shares the story of how a hackathon project unexpectedly led to Y Combinator acceptance. Initially rejected multiple times by YC, Neha and her co-founder, Akash, entered the MCP Hackathon with the goal of building something useful for themselves, not specifically to impress YC. They created \"Inbox Zero,\" an AI assistant that answers emails by voice, solving their own problem of managing email during commutes.\n\nDespite a mishap damaging Akash's car during the demo recording, they won the hackathon, earning a direct YC interview. With only a week to prepare, they quickly launched a landing page with a paid early-access option and surprisingly gained 150 users in just four days.\n\nRealizing the potential beyond email, they expanded the concept to \"April,\" an AI executive assistant managing calendars and meeting preparation, focused on giving people back their time. The positive user feedback about improved work-life balance fueled their motivation.\n\nYC proved to be an intense but transformative experience, characterized by direct feedback from experienced partners and a highly motivated cohort of founders. The rapid progress led to April winning \"best demo\" by the end of the program. Neha emphasizes the importance of solving real problems, shipping quickly, and expanding the vision beyond the initial concept. She and Akash are now fully dedicated to April, aiming to give people back their time.\n",
    "chinese_title": "从黑客松到YC",
    "chinese_summary": "内哈·苏雷什，April 的创始人，分享了她的故事：一个黑客马拉松项目如何出人意料地获得了 Y Combinator 的录取。最初多次被 YC 拒绝后，内哈和她的联合创始人阿卡什参加了 MCP 黑客马拉松，他们的目标是为自己构建有用的东西，而不是为了给 YC 留下深刻印象。他们创建了 “Inbox Zero”，一个通过语音回复电子邮件的 AI 助手，解决了他们在通勤期间管理电子邮件的难题。\n\n尽管在演示录制过程中阿卡什的车发生了意外损坏，但他们赢得了黑客马拉松，获得了直接参加 YC 面试的机会。在只有一周的准备时间里，他们迅速上线了一个提供付费提前访问选项的落地页，并出人意料地在短短四天内获得了 150 名用户。\n\n意识到电子邮件之外的潜力，他们将这个概念扩展到 “April”，一个管理日历和会议准备的 AI 行政助理，专注于把时间还给人们。用户对改善工作与生活平衡的积极反馈激发了他们的动力。\n\nYC 被证明是一次紧张但具有变革意义的经历，其特点是来自经验丰富的合伙人的直接反馈和一群积极性很高的创始人。快速的进展使 April 在项目结束时赢得了“最佳演示”。内哈强调了解决实际问题、快速交付以及将愿景扩展到最初概念之外的重要性。她和阿卡什现在全身心投入到 April 中，目标是把时间还给人们。"
  },
  {
    "id": "45015016",
    "title": "Barking Up the Ratchet Tree – MLS Is Neither Royal nor Nude",
    "url": "https://soatok.blog/2025/08/25/barking-up-the-ratchet-tree-mls-is-neither-royal-nor-nude/",
    "summary": "This article, \"Barking Up the Ratchet Tree,\" dissects a blog post titled \"MLS: The Naked King of End-to-End Encryption,\" which criticizes the Messaging Layer Security (MLS) protocol. The author, Soatok, argues that the critique stems from a misunderstanding of MLS's scope and intent.\n\nMLS, defined in RFC 9420, is a protocol for establishing and maintaining a shared key among a group of users, focusing on Continuous Group Key Agreement. It's a building block, not a complete end-to-end encryption solution like TLS. MLS outsources the Authentication Service (identity verification) to the application implementing it, focusing primarily on confidentiality and integrity.\n\nThe \"Naked King\" blog post argues that MLS requires trusting the communication provider because a compromised Authentication Service can impersonate users. Soatok contends this is a misinterpretation, as MLS itself doesn't mandate trust but rather highlights the importance of a robust Authentication Service implementation. Security Considerations sections in RFCs are meant to inform readers of potential issues, not dictate them.\n\nThe author criticizes the \"Naked King's\" dismissal of key transparency as impractical, pointing to existing implementations like WhatsApp and iMessage. The article concludes that the \"Naked King\" post's concerns arise from a science communication problem, where the MLS authors' caution in the Security Considerations unintentionally created doubt. While MLS is not a complete solution for end-to-end encryption, it's a well-designed group key agreement protocol. The article suggests a misleading name for MLS has contributed to the misunderstanding.\n",
    "chinese_title": "啃棘轮树 – 美国职业足球大联盟既不皇家也不裸体",
    "chinese_summary": "本文《缘木求鼠——评“MLS：一丝不挂的端到端加密之王”》剖析了一篇题为“MLS：一丝不挂的端到端加密之王”的博文，该博文批评了消息层安全（MLS）协议。作者Soatok认为，这种批评源于对MLS范围和意图的误解。\n\nMLS在RFC 9420中定义，是一种用于在用户组之间建立和维护共享密钥的协议，专注于持续群组密钥协商。它是一个构建块，而不是像TLS那样完整的端到端加密解决方案。 MLS将身份验证服务（身份验证）外包给实现它的应用程序，主要关注保密性和完整性。\n\n“一丝不挂的国王”博文认为，MLS需要信任通信提供商，因为受损的身份验证服务可以冒充用户。 Soatok认为这是一种误解，因为MLS本身并不强制要求信任，而是强调了强大的身份验证服务实现的重要性。 RFC中的安全考虑部分旨在告知读者潜在问题，而不是规定它们。\n\n作者批评了“一丝不挂的国王”对密钥透明度不切实际的否定，并指出了现有的实现，如WhatsApp和iMessage。 文章总结说，“一丝不挂的国王”博文的担忧源于科学传播问题，即MLS作者在安全考虑中的谨慎无意中造成了怀疑。 虽然MLS不是端到端加密的完整解决方案，但它是一个设计良好的群组密钥协商协议。 文章认为，MLS具有误导性的名称是造成误解的原因之一。"
  },
  {
    "id": "45003420",
    "title": "Show HN: Clearcam – Add AI object detection to your IP CCTV cameras",
    "url": "https://github.com/roryclear/clearcam",
    "summary": "Clearcam lets you transform RTSP-enabled cameras or old iPhones into AI-powered security cameras with object detection. It offers remote viewing, event notifications, and end-to-end encryption.\n\nInstallation can be done either through Homebrew (for NVR + inference) or via Python from source. The Python method includes optional performance enhancements like `BEAM=2` and choosing YOLOv8 variants using `--yolo_size`. Required Python packages include ffmpeg, tinygrad, numpy, cv2, scipy, and lap.\n\nAn iOS app is also available, requiring iOS 15+ and an iPhone SE (1st gen) or newer. The app provides remote viewing, notifications, and event clip access. To unlock these features, users need a Clearcam Premium subscription, obtainable through the iOS app. An Android version is planned, but currently users can subscribe on iOS and then use their User ID to access premium features on Android. The provided link showcases a video demo of Clearcam in action.\n",
    "chinese_title": "Show HN: Clearcam – 为你的IP CCTV摄像头添加AI物体检测功能",
    "chinese_summary": "Clearcam：将RTSP摄像头或旧iPhone转变为具备物体检测功能的AI安防摄像头。它提供远程观看、事件通知和端到端加密。\n\n安装可以通过Homebrew（适用于NVR + 推理）或从源代码通过Python完成。Python方法包含可选的性能增强功能，如`BEAM=2`和使用`--yolo_size`选择YOLOv8变体。所需的Python包包括ffmpeg、tinygrad、numpy、cv2、scipy和lap。\n\niOS应用也已可用，需要iOS 15+和iPhone SE（第一代）或更新机型。该应用提供远程观看、通知和事件片段访问。要解锁这些功能，用户需要通过iOS应用获取Clearcam Premium订阅。Android版本正在计划中，但目前用户可以在iOS上订阅，然后使用其用户ID在Android上访问高级功能。提供的链接展示了Clearcam的视频演示。"
  },
  {
    "id": "45004728",
    "title": "Making games in Go: 3 months without LLMs vs. 3 days with LLMs",
    "url": "https://marianogappa.github.io/software/2025/08/24/i-made-two-card-games-in-go/",
    "summary": "This article details the author's experience building two card games in Go: \"Truco\" before the widespread adoption of LLMs and \"Escoba\" after. Building \"Truco\" took 3 months of dedicated effort, involving learning React for the UI, transpiling the Go backend to WASM using TinyGo, and hosting the static files on GitHub Pages.  Every step required manual problem-solving.\n\nA year later, with LLMs available, the author rebuilt the backend for \"Escoba\" using Claude.  The LLM surprisingly generated almost perfect code from a detailed prompt, requiring minimal debugging. The frontend, however, still took a few days due to the author's limited React skills and the complexities of debugging a WASM-driven game state in JavaScript.  The \"Escoba\" backend was built in just 3 days using LLMs.\n\nThe author then provides a step-by-step guide for building a simple game using this stack, including links to a minimalistic Tic-Tac-Toe game example. He explains how to structure the backend in Go, focusing on GameState management and bot implementation. He details the process of transpiling the Go backend to WASM using TinyGo, covering data interop via JSON and frontend communication. Finally, he shares troubleshooting tips and JavaScript snippets to load the WASM file and call Go functions.\n",
    "chinese_title": "使用 Go 语言开发游戏：不使用 LLM 耗时 3 个月 vs. 使用 LLM 耗时 3 天",
    "chinese_summary": "本文详细介绍了作者使用Go语言构建两款纸牌游戏的经验：“Truco”是在LLM广泛应用之前构建的，而“Escoba”是在之后构建的。 构建“Truco”花费了3个月的专注努力，包括学习React以开发用户界面，使用TinyGo将Go后端转译为WASM，以及将静态文件托管在GitHub Pages上。 每一步都需要手动解决问题。\n\n一年后，在LLM可用之后，作者使用Claude重建了“Escoba”的后端。 令人惊讶的是，LLM从一个详细的提示中生成了几乎完美的代码，只需要极少的调试。 然而，由于作者有限的React技能以及在JavaScript中调试WASM驱动的游戏状态的复杂性，前端仍然花费了几天时间。 使用LLM仅用了3天时间就构建了“Escoba”的后端。\n\n然后，作者提供了一个使用此技术栈构建简单游戏的逐步指南，包括指向一个极简主义的井字游戏示例的链接。 他解释了如何在Go中构建后端，重点关注GameState管理和机器人实现。 他详细介绍了使用TinyGo将Go后端转译为WASM的过程，涵盖了通过JSON进行的数据互操作和前端通信。 最后，他分享了故障排除技巧和JavaScript代码片段，以加载WASM文件并调用Go函数。"
  },
  {
    "id": "45006801",
    "title": "Everything I know about good API design",
    "url": "https://www.seangoedecke.com/good-api-design/",
    "summary": "This article outlines key principles for designing good APIs, emphasizing a balance between familiarity and flexibility. The author stresses the importance of avoiding breaking changes to maintain user trust, adhering to the \"WE DO NOT BREAK USERSPACE\" philosophy. While API versioning can mitigate breaking changes, it's viewed as a last resort due to complexity and maintenance overhead.\n\nThe success of an API heavily depends on the underlying product's value; a desirable product can overcome a flawed API, but a great API can't save an unwanted product. Poorly designed products often lead to awkward APIs, exposing internal technical constraints to users.\n\nThe author recommends supporting long-lived API keys for ease of onboarding, catering to a broad range of users, including non-engineers. Idempotency, using idempotency keys, is crucial for safely retrying API requests that take action, preventing duplicates in case of failures. While generally optional, it enhances reliability.\n\nFinally, the article highlights the need for safety measures like rate limiting due to the speed at which APIs can be accessed, preventing malicious or careless usage from overloading backend systems. Overall, the author advises considering both technical excellence and user experience when designing APIs, balancing simplicity with robustness and stability.\n",
    "chinese_title": "我所知道的关于优秀API设计的一切",
    "chinese_summary": "本文概述了设计优秀API的关键原则，强调熟悉性和灵活性之间的平衡。作者强调避免破坏性变更以维护用户信任的重要性，并坚持“我们不破坏用户空间”的理念。虽然API版本控制可以缓解破坏性变更，但由于其复杂性和维护成本，它被视为最后的手段。\n\nAPI的成功很大程度上取决于底层产品的价值；一个受欢迎的产品可以弥补有缺陷的API，但一个优秀的API无法拯救一个不受欢迎的产品。设计糟糕的产品往往会导致笨拙的API，将内部技术约束暴露给用户。\n\n作者建议支持长期存在的API密钥，以简化用户入门流程，满足包括非工程师在内的广泛用户。幂等性（使用幂等性密钥）对于安全地重试执行操作的API请求至关重要，可防止在发生故障时出现重复操作。虽然通常是可选的，但它可以提高可靠性。\n\n最后，本文强调了速率限制等安全措施的必要性，因为API的访问速度很快，可以防止恶意或粗心的使用导致后端系统过载。总而言之，作者建议在设计API时同时考虑技术卓越性和用户体验，在简单性、健壮性和稳定性之间取得平衡。"
  },
  {
    "id": "45006902",
    "title": "A Brilliant and Nearby One-off Fast Radio Burst Localized to 13 pc Precision",
    "url": "https://iopscience.iop.org/article/10.3847/2041-8213/adf62f",
    "summary": "The article \"A Brilliant and Nearby One-off Fast Radio Burst Localized to 13 pc Precision\" is about the detection and precise localization of a unique Fast Radio Burst (FRB).\n\nHowever, the provided content is not the actual scientific article. Instead, it's a Captcha screen from Radware Bot Manager encountered while accessing the website, suggesting an attempt to verify the user is human. This indicates that the intended article could not be retrieved, and the user was blocked by a security measure.\n\nTherefore, a summary of the scientific article itself *cannot* be provided based on the given information. The only information available is its title, which suggests the research focuses on a bright, singular (one-off) FRB that was found to be relatively close to Earth and located with exceptional accuracy (13 parsec precision).\n",
    "chinese_title": "一次明亮且近距的快速射电暴被定位到13秒差距的精度",
    "chinese_summary": "文章“一次明亮且近距离的快速射电暴被定位到13秒差距精度”是关于探测和精确定位一个独特的快速射电暴（FRB）。\n\n然而，提供的内容并非实际的科学文章。相反，它是在访问网站时遇到的Radware Bot Manager的验证码界面，表明尝试验证用户是否为人类。 这表明无法检索到预期的文章，并且用户被安全措施阻止。\n\n因此，基于给定的信息*无法*提供该科学文章本身的摘要。唯一可用的信息是其标题，这表明该研究侧重于一个明亮、单一（一次性）的FRB，发现它相对靠近地球，并以极高的精度（13秒差距精度）定位。"
  },
  {
    "id": "45003358",
    "title": "Show HN: CasCache – multi-generational cache with optimistic concurrency control",
    "url": "https://github.com/unkn0wn-root/cascache",
    "summary": "CasCache is a provider-agnostic, multi-generational cache designed for safe and efficient caching in Go applications, featuring optimistic concurrency control via Compare-And-Set (CAS). It supports single-key and bulk caching with read-side validation to prevent stale data. A key feature is its composability, allowing users to plug in various value providers (like Ristretto, BigCache, or Redis) and codecs (JSON, Msgpack, etc.).\n\nCasCache prioritizes data integrity. Single reads always return the latest data, self-healing from corrupt or type-mismatched entries. Bulk caching validates each member's generation before returning data, falling back to individual lookups if staleness is detected.\n\nFor distributed environments, CasCache offers a pluggable generation store (GenStore), defaulting to a local implementation for single-process setups. For multi-replica deployments, a shared GenStore (e.g., Redis) ensures cross-replica consistency and warm restarts.\n\nThe API includes methods for getting and setting single keys and bulks, invalidating cache entries, and managing generations.  Performance is O(1) for single lookups and O(n) for bulks, with zero-copy wire decoding to minimize allocations.  Users can choose between the `CAS` and `Cache` type aliases. The article provides a quick start guide with code examples and emphasizes the importance of considering the `DisableBulk` option if a distributed GenStore isn't used in multi-replica setups.\n",
    "chinese_title": "展示一下：CasCache – 采用乐观并发控制的多代缓存",
    "chinese_summary": "CasCache 是一个与提供者无关的多代缓存，专为 Go 应用程序中的安全高效缓存而设计，它采用乐观并发控制（通过 Compare-And-Set, CAS）。 它支持单键和批量缓存，并具有读取端验证功能，以防止陈旧数据。 其关键特性是可组合性，允许用户插入各种值提供者（如 Ristretto、BigCache 或 Redis）和编解码器（JSON、Msgpack 等）。\n\nCasCache 优先考虑数据完整性。 单个读取始终返回最新数据，并能从损坏或类型不匹配的条目中自我修复。 批量缓存在返回数据之前验证每个成员的生成，如果检测到陈旧数据，则回退到单独查找。\n\n对于分布式环境，CasCache 提供可插拔的生成存储（GenStore），默认情况下为单进程设置提供本地实现。 对于多副本部署，共享的 GenStore（例如 Redis）可确保跨副本一致性和热重启。\n\nAPI 包括用于获取和设置单个键和批量、使缓存条目失效以及管理生成的方法。 单个查找的性能为 O(1)，批量的性能为 O(n)，并采用零拷贝线路解码以最大限度地减少分配。 用户可以在 `CAS` 和 `Cache` 类型别名之间进行选择。 本文提供了一个包含代码示例的快速入门指南，并强调了如果在多副本设置中未使用分布式 GenStore，则应考虑 `DisableBulk` 选项的重要性。"
  },
  {
    "id": "44980940",
    "title": "Cloudflare incident on August 21, 2025",
    "url": "https://blog.cloudflare.com/cloudflare-incident-on-august-21-2025/",
    "summary": "On August 21, 2025, Cloudflare experienced an incident impacting customers with origins in Amazon Web Services (AWS) us-east-1. A surge in traffic from a single customer caused severe congestion on links between Cloudflare and AWS us-east-1, resulting in high latency, packet loss, and failures to origins. The incident started at 16:27 UTC and was substantially reduced by 19:38 UTC, with intermittent issues until 20:18 UTC. Global Cloudflare services were unaffected, and the issue was a regional network congestion event, not an attack or BGP hijack.\n\nThe congestion arose because a customer initiated a large number of requests for cached objects, saturating the direct peering connections between Cloudflare and AWS. AWS's attempts to mitigate the issue by withdrawing BGP advertisements worsened the situation. Contributing factors included a pre-existing failure on one peering link and an upcoming Data Center Interconnect upgrade.\n\nCloudflare and AWS collaborated to alleviate the congestion and restore services. Remediations include developing a mechanism to selectively deprioritize traffic from customers causing congestion, expediting Data Center Interconnect upgrades, and coordinating BGP traffic engineering actions with AWS.\n\nLong-term solutions involve building a new traffic management system that allocates network resources per customer, preventing a single customer's traffic from degrading service for others. Cloudflare apologizes for the disruption and is implementing these improvements to prevent recurrence.\n",
    "chinese_title": "2025年8月21日 Cloudflare 事件",
    "chinese_summary": "2025年8月21日，Cloudflare发生事件，影响了源站位于亚马逊云服务（AWS）us-east-1的客户。来自单个客户的流量激增导致Cloudflare和AWS us-east-1之间的链路严重拥塞，造成高延迟、丢包和源站故障。事件始于UTC时间16:27，并在19:38 UTC大幅缓解，直至20:18 UTC仍有间歇性问题。全球Cloudflare服务未受影响，该问题是一次区域网络拥塞事件，而非攻击或BGP劫持。\n\n拥塞的发生是因为一个客户发起了大量对缓存对象的请求，导致Cloudflare和AWS之间的直接对等连接饱和。AWS试图通过撤回BGP宣告来缓解问题，反而使情况恶化。促成因素包括一条对等链路上的预先存在的故障以及即将到来的数据中心互联升级。\n\nCloudflare和AWS合作缓解拥塞并恢复服务。补救措施包括开发一种机制，选择性地降低导致拥塞的客户的流量优先级，加速数据中心互联升级，以及与AWS协调BGP流量工程操作。\n\n长期解决方案包括构建一个新的流量管理系统，该系统为每个客户分配网络资源，防止单个客户的流量降低其他客户的服务质量。Cloudflare对此中断表示歉意，并正在实施这些改进以防止再次发生。"
  },
  {
    "id": "45006098",
    "title": "Show HN: I Built a XSLT Blog Framework",
    "url": "https://vgr.land/content/posts/20250821.xml",
    "summary": "This \"Show HN\" post introduces a blog publishing framework built on XSLT (Extensible Stylesheet Language Transformations). The author explains their motivation for creating yet another framework: a desire for a simple, HTML-focused approach that avoids WYSIWYG editors, Markdown, and complex build pipelines.\n\nKey features the author wanted were: raw HTML authoring, automated RSS feed generation, consistent CSS application via Bootstrap, and the ability to use minimal JavaScript.\n\nThe author chose XSLT because of its simplicity and the separation of content and presentation it enforces. They appreciate the ability to use a 20-year-old standard to create modern websites. The core workflow involves writing content in HTML, updating an XML index file (which also serves as the basis for the RSS feed), and then letting the browser's XSLT engine handle the transformation into a rendered webpage. No server-side scripting is required.\n\nThe framework dynamically generates menus based on date and category attributes in the XML blog index, leveraging XSLT functions like `xsl:for-each`, `xsl:when`, `xsl:sort`, and `xsl:variable`. This allows for menu creation without JavaScript.\n\nWhile acknowledging the potential future obsolescence of XSLT, the author emphasizes that it currently works effectively and offers a viable alternative to more complicated blog frameworks. The code is open-source (MIT license) and available on GitHub for others to use and adapt. A demo is available to view.\n",
    "chinese_title": "展示一下：我构建了一个XSLT博客框架",
    "chinese_summary": "基于XSLT的博客发布框架：告别复杂构建，拥抱纯HTML写作"
  },
  {
    "id": "45008056",
    "title": "Uncle Sam shouldn't own Intel stock",
    "url": "https://www.wsj.com/opinion/uncle-sam-shouldnt-own-intel-stock-ccd6986d",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "山姆大叔不应持有英特尔股票",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "45015732",
    "title": "As Measles Exploded Officials in Texas Looked to CDC Scientists. No One Answered",
    "url": "https://kffhealthnews.org/news/article/texas-measles-outbreak-cdc-vaccines-rfk-trump/",
    "summary": "This KFF Health News investigation reveals how the Trump administration's actions hampered the CDC's response to a measles outbreak in Texas early this year, contributing to the worst outbreak in the U.S. in over three decades. The administration's interference with CDC communications, reports, and staffing created confusion and fear among CDC scientists, preventing them from openly assisting local health officials in West Texas as measles surged.\n\nLocal health officials, like Katherine Wells in Lubbock, struggled to get timely expert advice from the CDC. Meanwhile, Health Secretary Robert F. Kennedy Jr. amplified vaccine skepticism and promoted vitamin A as a substitute, further complicating the situation. The lack of effective communication and support delayed vital public health interventions like contact tracing and vaccination efforts in undervaccinated communities, particularly among Mennonite populations.\n\nThe outbreak spread to multiple states and Mexico, sickening thousands and resulting in at least 16 deaths. The situation underscores the importance of prompt, science-based public health responses and the dangers of political interference, misinformation, and budget cuts. It also contrasts sharply with successful measles containment efforts in other states like Washington and New York, where robust CDC collaboration and community engagement were prioritized. Only after a child died did CDC scientists finally contact local Texas officials.\n",
    "chinese_title": "德州麻疹爆发，官员求助疾控中心科学家，无人回应。",
    "chinese_summary": "这篇KFF健康新闻调查揭露了特朗普政府的行动如何阻碍了美国疾病控制与预防中心（CDC）今年早些时候对德克萨斯州麻疹疫情的应对，导致美国三十多年来最严重的疫情爆发。该政府对CDC的沟通、报告和人员配置的干预，在CDC科学家中造成了困惑和恐慌，阻碍了他们公开协助西德克萨斯州当地卫生官员应对麻疹疫情的蔓延。\n\n像拉伯克的凯瑟琳·威尔斯这样的当地卫生官员，难以从CDC获得及时的专家建议。与此同时，卫生部长小罗伯特·F·肯尼迪放大了对疫苗的怀疑，并提倡用维生素A作为替代品，使情况更加复杂。缺乏有效的沟通和支持延误了至关重要的公共卫生干预措施，如在疫苗接种不足的社区，特别是门诺派人群中进行接触者追踪和疫苗接种工作。\n\n疫情蔓延到多个州和墨西哥，导致数千人患病，至少16人死亡。这种情况突显了及时、基于科学的公共卫生应对措施的重要性，以及政治干预、虚假信息和预算削减的危害。它还与华盛顿州和纽约州等其他州成功的麻疹控制工作形成鲜明对比，这些州优先考虑了强大的CDC合作和社区参与。直到一名儿童死亡后，CDC科学家才最终联系了德克萨斯州当地官员。"
  },
  {
    "id": "45005986",
    "title": "The great medieval water myth (2013)",
    "url": "https://leslefts.blogspot.com/2013/11/the-great-medieval-water-myth.html",
    "summary": "This article challenges the common myth that people in the Middle Ages primarily drank beer or wine to avoid unsafe water. The author argues this is a false assumption, lacking historical evidence. They present several arguments to support their claim:\n\n*   **Historical Mentions of Water Consumption:** The author cites numerous historical texts from the Medieval period that casually mention people drinking water without any indication that it was considered unsafe.\n*   **Medical Views on Water:** While medieval doctors had nuanced views on water, they didn't generally advise against drinking it if it appeared clean and odorless. They also didn't recommend replacing water with alcohol to avoid disease.\n*   **Emphasis on Water's Purity:** Medieval texts show people understood the difference between good and bad water, and valued pure water. Laws existed to protect water sources from pollution.\n*   **Alcohol as a Preservative:** The author notes that many non-water drinks were often alcoholic, not necessarily because of a fear of water, but because fermentation acted as a preservative.\n*   **Nutritional Considerations:** While water was understood to quench thirst, wine and beer were sometimes favored for their nutritional content, particularly for those in subsistence economies.\n\nThe author emphasizes the lack of primary source evidence supporting the myth of alcohol replacing water due to safety concerns. They suggest people likely drank alcohol for taste, variety, and perceived health benefits, not out of fear of the water itself. Despite the evidence, the author acknowledges the myth persists.\n",
    "chinese_title": "中世纪水的迷思 (2013)",
    "chinese_summary": "本文挑战了一种普遍的迷思，即中世纪的人们主要饮用啤酒或葡萄酒是为了避免不安全的水。作者认为这是一种缺乏历史证据的错误假设。他们提出了几个论点来支持他们的观点：\n\n*   **关于饮用水的历史记载：** 作者引用了大量中世纪的历史文献，这些文献随意地提及人们饮用水，没有任何迹象表明它被认为是不安全的。\n*   **关于水的医学观点：** 虽然中世纪的医生对水有细致的看法，但如果水看起来干净无味，他们通常不会反对饮用。他们也没有建议用酒精代替水来避免疾病。\n*   **对水纯度的强调：** 中世纪的文献表明，人们了解好水和坏水之间的区别，并重视纯净的水。存在保护水源免受污染的法律。\n*   **酒精作为防腐剂：** 作者指出，许多非水饮料往往是酒精饮料，不一定是出于对水的恐惧，而是因为发酵起到了防腐作用。\n*   **营养方面的考虑：** 虽然人们明白水可以解渴，但有时会因其营养成分而偏爱葡萄酒和啤酒，特别是对于那些处于生存经济中的人来说。\n\n作者强调缺乏主要来源的证据来支持酒精因安全问题而取代水的迷思。他们认为，人们可能因为味道、多样性和认为的健康益处而饮用酒精，而不是出于对水本身的恐惧。尽管有这些证据，作者承认这种迷思依然存在。"
  },
  {
    "id": "45003073",
    "title": "YouTube made AI enhancements to videos without warning or permission",
    "url": "https://www.bbc.com/future/article/20250822-youtube-is-using-ai-to-edit-videos-without-permission",
    "summary": "YouTube has been secretly using AI to enhance videos on its platform, specifically on YouTube Shorts, without informing creators or seeking their permission. This involves subtle alterations like sharpening skin, defining wrinkles in clothing, and adjusting facial features, leading some YouTubers to believe their content appears \"AI-generated\" and misrepresents their authentic voice.\n\nCreators like Rick Beato and Rhett Shull noticed these changes and expressed concerns about the potential erosion of trust with their audience, feeling the alterations misrepresented them. While YouTube claims this \"experiment\" uses traditional machine learning to improve video quality, experts argue it's a form of AI manipulation that blurs the lines of reality and raises ethical questions about content ownership and informed consent.\n\nThe article highlights that this is part of a larger trend of AI pre-processing reality, drawing parallels to past controversies surrounding Photoshop and beauty filters. It raises concerns about the increasing lack of transparency surrounding how AI is mediating our relationship with the world. Google, which owns YouTube, has implemented content credentials (digital watermarks) in its Pixel 10 phone to identify AI-edited images, indicating awareness of these issues.  Despite the company's efforts, some creators, like Beato, remain positive about YouTube's constant experimentation and development. Ultimately, the article questions how such practices will impact trust in online content and the authenticity of creators' voices.\n",
    "chinese_title": "YouTube 在未经警告或许可的情况下对视频进行了 AI 增强。",
    "chinese_summary": "YouTube一直在秘密使用人工智能来增强其平台上的视频，特别是YouTube Shorts，而没有通知创作者或征求他们的许可。这包括对皮肤进行锐化、对服装的皱纹进行定义以及调整面部特征等细微改动，导致一些YouTuber认为他们的内容看起来像是“AI生成”，并歪曲了他们真实的声音。\n\n像Rick Beato和Rhett Shull这样的创作者注意到了这些变化，并对可能因此侵蚀他们与观众之间的信任表示担忧，因为他们觉得这些改动歪曲了他们。虽然YouTube声称这项“实验”使用传统的机器学习来提高视频质量，但专家认为这是一种人工智能操纵的形式，模糊了现实的界限，并引发了关于内容所有权和知情同意的伦理问题。\n\n这篇文章强调，这是人工智能预处理现实这一更大趋势的一部分，并将之与过去围绕Photoshop和美颜滤镜的争议相提并论。它对人工智能越来越多地在调解我们与世界的关系时缺乏透明度表示担忧。拥有YouTube的谷歌公司已在其Pixel 10手机中实施了内容凭证（数字水印）来识别AI编辑的图像，表明其意识到了这些问题。尽管公司做出了努力，但像Beato这样的一些创作者仍然对YouTube不断的实验和发展持积极态度。最终，这篇文章质疑这种做法将如何影响对在线内容的信任以及创作者声音的真实性。"
  },
  {
    "id": "44979906",
    "title": "NASA's Juno mission leaves legacy of science at Jupiter",
    "url": "https://www.scientificamerican.com/article/how-nasas-juno-probe-changed-everything-we-know-about-jupiter/",
    "summary": "NASA's Juno mission, though nearing its end in September 2025, has dramatically reshaped our understanding of Jupiter and the early solar system. Despite enduring intense radiation, Juno has revealed surprising features of the gas giant, including odd geometric storms at the poles, a surprisingly light and fuzzy core, and a turbulent atmosphere unlike anything previously imagined.\n\nJuno's discoveries challenged existing theories. It observed stable, geometric arrangements of cyclones at Jupiter's poles, the immense depth of the Great Red Spot, and a unique type of high-altitude lightning produced by ammonia-ice clouds. The mission also uncovered ammonia depletion in parts of the atmosphere, leading to the \"mushball\" theory to explain the phenomenon.\n\nFurthermore, Juno found Jupiter's magnetic field to be asymmetric and revealed an intense magnetic concentration near the equator called the Great Blue Spot. The mission's findings suggest that Jupiter's metallic hydrogen ocean generates this magnetic field. Juno's data on Jupiter's core challenged previous models, indicating a less compact and fuzzier structure than anticipated.\n\nUltimately, Juno was created to understand Jupiter's formation and its role in the early solar system. By peering beneath the planet's cloud tops, the mission has provided invaluable insights into the origins of our solar system and forever changed how scientists view Jupiter.\n",
    "chinese_title": "NASA的朱诺号任务在木星留下科学遗产",
    "chinese_summary": "虽然美国宇航局的朱诺号任务将于2025年9月结束，但它已经极大地改变了我们对木星和早期太阳系的理解。 尽管经历了强烈的辐射，朱诺号还是揭示了这颗气态巨行星令人惊讶的特征，包括两极奇怪的几何风暴，出人意料的轻盈而模糊的内核，以及与以往想象的截然不同的湍流大气。\n\n朱诺号的发现挑战了现有的理论。 它观察到木星两极稳定的几何旋风排列、大红斑的巨大深度，以及氨冰云产生的一种独特的高空闪电。 该任务还发现了大气部分区域的氨耗竭现象，从而产生了“肉丸”理论来解释这一现象。\n\n此外，朱诺号发现木星的磁场是不对称的，并揭示了赤道附近一种被称为大蓝斑的强烈磁场集中区。 该任务的发现表明，木星的金属氢海洋产生了这种磁场。 朱诺号关于木星核心的数据挑战了之前的模型，表明其结构不如预期紧凑和模糊。\n\n最终，朱诺号的创建是为了了解木星的形成及其在早期太阳系中的作用。 通过观察行星云层之下的情况，该任务为我们太阳系的起源提供了宝贵的见解，并永远改变了科学家们看待木星的方式。"
  },
  {
    "id": "45001778",
    "title": "It is worth it to buy the fast CPU",
    "url": "https://blog.howardjohn.info/posts/buy-a-cpu/",
    "summary": "This article argues that investing in a fast CPU is a worthwhile investment, particularly for software engineers, comparing it favorably to the cost of AI coding subscriptions. The author highlights the significant performance gap between older, slower CPUs often provided by companies and the latest high-end CPUs like the AMD Ryzen 9 9950X.\n\nThe core argument centers on the notion that the improved productivity gained from faster compile times and processing speeds easily justifies the cost of a top-tier CPU. The author points to the annual cost of AI coding subscriptions (around $500) as evidence that companies recognize the value of enhanced engineering productivity. They then contrast this with the relatively low annualized cost of a high-end CPU (around $170 when amortized over three years).\n\nThe article uses benchmark data to demonstrate the substantial performance differences between older laptop CPUs (e.g., i7-1165G7) and newer, more powerful CPUs (e.g., AMD Ryzen 9950X and AMD Ryzen 7840U), citing differences of over 10x in compile times and TLS operations. The author also presents a rule of thumb: Desktop CPUs are about 3x faster than laptop CPUs, and top-end CPUs are about 3x faster than comparable models from three years prior. They conclude that if a company can justify an AI coding subscription, they can certainly justify providing engineers with the best possible CPU for maximum productivity.\n",
    "chinese_title": "购买快速CPU是值得的。",
    "chinese_summary": "本文认为，投资高性能CPU物有所值，特别是对于软件工程师而言，并将其与AI编程订阅的费用进行比较。作者强调了公司通常提供的较旧、较慢的CPU与最新的高端CPU（如AMD Ryzen 9 9950X）之间存在的巨大性能差距。\n\n核心论点围绕着这样一种观点展开：更快的编译时间和处理速度所带来的生产力提升，完全可以证明购买顶级CPU的成本是合理的。作者指出，AI编程订阅的年度费用（约500美元）证明了公司认可提高工程生产力的价值。然后，他们将此与高端CPU相对较低的年化成本（分摊到三年后约为170美元）进行了对比。\n\n文章使用基准数据来证明较旧的笔记本电脑CPU（例如i7-1165G7）与更新、更强大的CPU（例如AMD Ryzen 9950X和AMD Ryzen 7840U）之间的巨大性能差异，并引用了编译时间和TLS操作方面超过10倍的差异。作者还提出了一个经验法则：台式机CPU比笔记本电脑CPU快约3倍，而顶级CPU比三年前的同类产品快约3倍。他们得出结论，如果一家公司可以证明AI编程订阅的合理性，那么他们肯定可以证明为工程师提供最佳CPU以实现最大生产力的合理性。"
  },
  {
    "id": "44971451",
    "title": "Stepanov's biggest blunder? The curious case of adjacent difference",
    "url": "https://mmapped.blog/posts/43-stepanovs-biggest-blunder",
    "summary": "This article explores the design of the C++ `std::adjacent_difference` algorithm, focusing on its seemingly peculiar behavior of copying the first element of the input sequence into the output. The author initially criticizes this design, arguing that it reduces genericity and practicality because the difference between elements of type `T` might not also be type `T`.\n\nHowever, the author then delves into the rationale behind Stepanov's design, highlighting the symmetry between `std::adjacent_difference` and `std::partial_sum`. They demonstrate that these algorithms are inverses of each other, analogous to differentiation and integration in calculus. This symmetry allows for reconstruction of the original sequence from its adjacent differences and vice-versa.\n\nThe article connects these algorithms to the fundamental theorem of calculus, viewing them as discrete analogs of finding slopes (derivatives), recovering functions from slopes (antiderivatives), and finding areas under curves (integration).\n\nDespite appreciating the mathematical elegance and connections, the author ultimately reaffirms their pragmatic disagreement with Stepanov's choice, arguing that the algorithm's insistence on type matching hinders its usability in real-world scenarios. They contrast this with C++23's `pairwise_transform` and the q programming language's `deltas` function which provides a more generic and flexible implementation while maintaining similar functionalities.\n\nThe article concludes by acknowledging the difficulty of API design and appreciating the insights gained from questioning Stepanov's design decision, even while maintaining a disagreement with it.\n",
    "chinese_title": "斯捷潘诺夫的最大失误？相邻差分的奇特案例",
    "chinese_summary": "本文探讨了 C++ `std::adjacent_difference` 算法的设计，重点在于其将输入序列的第一个元素复制到输出的看似特殊的行为。作者最初批评了这种设计，认为它降低了通用性和实用性，因为 `T` 类型元素之间的差值可能不仍然是 `T` 类型。\n\n然而，作者随后深入研究了 Stepanov 设计背后的理由，强调了 `std::adjacent_difference` 和 `std::partial_sum` 之间的对称性。他们证明了这些算法互为逆运算，类似于微积分中的微分和积分。这种对称性允许从相邻差值重建原始序列，反之亦然。\n\n本文将这些算法与微积分基本定理联系起来，将它们视为寻找斜率（导数）、从斜率恢复函数（反导数）和寻找曲线下面积（积分）的离散模拟。\n\n尽管欣赏数学上的优雅和联系，但作者最终重申了他们对 Stepanov 选择的务实性上的不同意，认为该算法对类型匹配的坚持阻碍了其在实际场景中的可用性。他们将此与 C++23 的 `pairwise_transform` 和 q 编程语言的 `deltas` 函数进行了对比，后者提供了更通用和灵活的实现，同时保持了类似的功能。\n\n文章最后承认了 API 设计的难度，并感谢从质疑 Stepanov 的设计决策中获得的见解，即使仍然不同意该决策。"
  },
  {
    "id": "45014489",
    "title": "Hundreds lose water source in Colorado's poorest county with no notice",
    "url": "https://coloradosun.com/2025/08/25/costilla-county-water-cutoff/",
    "summary": "In Costilla County, Colorado, hundreds of residents relying on cisterns for water have been abruptly cut off from their primary water source in Fort Garland without warning. This crisis affects those living off-grid in the Sangre de Cristo Ranches, who depend on hauling water from Fort Garland to fill their cisterns for daily needs.\n\nThe Fort Garland Water and Sanitation District board voted to stop selling bulk water to rural residents due to townspeople's anger over water restrictions caused by a broken pump. This decision, made without prior notice or a formal agenda item, has left many scrambling for water, with some driving long distances to obtain it or relying on emergency solutions offered by the town of Blanca.\n\nThe situation is particularly challenging for older residents and those with disabilities, with some contemplating selling their homes. The sudden loss of water access has stirred resentment between longtime residents and newcomers, and raised concerns about future water scarcity in the drought-stricken West. While the water district claims no obligation to sell water outside city limits, affected residents argue the abrupt cutoff was unethical and lacked compassion.\n\nResidents are now urging Costilla County commissioners to create a county-operated water station to address the needs of those affected by the Fort Garland decision. The proposed project offers a potential long-term solution, but the immediate water crisis continues to impact the daily lives of numerous residents in the county.\n",
    "chinese_title": "科罗拉多州最贫困县数百人无预警失去水源",
    "chinese_summary": "科斯蒂亚县断水危机：居民被迫长途取水\n\n科罗拉多州科斯蒂亚县，数百名依靠蓄水池供水的居民，在毫无预警的情况下，突然被切断了在加兰堡的主要水源。这场危机影响了居住在圣克里斯托农场、依靠从加兰堡运水来填满蓄水池以满足日常需求的离网居民。\n\n由于镇上居民对水泵故障导致的用水限制感到愤怒，加兰堡供水和卫生区委员会投票决定停止向农村居民出售散装水。这一未经事先通知或正式议程项目的决定，让许多人四处奔走寻找水源，一些人需要长途跋涉取水，或者依赖布兰卡镇提供的紧急解决方案。\n\n对老年居民和残疾人来说，情况尤其严峻，有些人正在考虑出售房屋。突然失去用水途径引发了老居民和新居民之间的不满，并引发了人们对干旱的西部地区未来缺水问题的担忧。虽然供水区声称没有义务向城市范围以外地区售水，但受影响的居民认为，这种突然的断水是不道德的，缺乏同情心。\n\n现在，居民们敦促科斯蒂亚县委员创建一个县级运营的供水站，以满足受加兰堡决定影响的人的需求。拟议的项目提供了一个潜在的长期解决方案，但眼下的缺水危机仍在影响着该县众多居民的日常生活。"
  },
  {
    "id": "45004846",
    "title": "Comet AI browser can get prompt injected from any site, drain your bank account",
    "url": "https://twitter.com/zack_overflow/status/1959308058200551721",
    "summary": "This article, titled \"Comet AI browser can get prompt injected from any site, drain your bank account,\" appears to describe a critical security vulnerability in the Comet AI browser. The title suggests that malicious websites can potentially execute \"prompt injection\" attacks, leading to unauthorized access and the potential for financial exploitation (draining a bank account).\n\nHowever, the article content itself is **completely unrelated** to the title. It displays a message from X.com (formerly Twitter) indicating that JavaScript is disabled and prompting the user to enable it or switch to a supported browser. The rest of the content is standard website boilerplate (terms of service, privacy policy, etc.).\n\nTherefore, the actual content of the article **does not support the claim in the title**. The provided content does not offer any details or evidence about the alleged prompt injection vulnerability in the Comet AI browser. The situation is likely either:\n\n*   **A mislabeled or incorrect article.**\n*   **A placeholder page with a misleading title.**\n*   **An incomplete or broken article.**\n\nWithout further information, it is impossible to summarize the article's claims regarding the security vulnerability because the article *doesn't* describe it. The summary can only highlight the discrepancy between the title and the actual content.\n",
    "chinese_title": "彗星AI浏览器可能被任何网站注入恶意提示，盗空你的银行账户。",
    "chinese_summary": "标题：《Comet AI浏览器可被任意网站提示注入，盗空你的银行账户》一文，实际内容与标题**完全不符**。文章显示来自X.com（前身为Twitter）的消息，指示JavaScript已禁用，并提示用户启用或切换到受支持的浏览器。其余内容是标准的网站样板（服务条款、隐私政策等）。因此，文章的实际内容**不支持标题中的说法**。文章并未提供有关Comet AI浏览器中所谓的提示注入漏洞的任何细节或证据。情况可能是：\n\n*   **文章标签错误或内容不正确。**\n*   **带有误导性标题的占位符页面。**\n*   **文章不完整或已损坏。**\n\n在没有更多信息的情况下，无法总结该文章关于安全漏洞的声明，因为文章*并未*描述它。总结只能强调标题与实际内容之间的差异。"
  },
  {
    "id": "45015108",
    "title": "Sweet disguise: Body hides its own RNA from the immune system with sugar",
    "url": "https://phys.org/news/2025-08-sweet-disguise-body-rna-immune.html",
    "summary": "This article from the University of Connecticut, published in *Nature*, discusses a new understanding of how the body prevents its own RNA from triggering an immune response. Researchers led by Vijay Rathinam and colleagues discovered that cells coat their RNA with sugars, creating \"glycoRNAs,\" which effectively shield the RNA from the immune system.\n\nThe immune system typically recognizes naked RNA as a sign of viral or bacterial infection and initiates an attack. However, our own cells also contain RNA, and these are often displayed on the cell surface. Previous research had observed the presence of these sugar-coated RNAs, or glycoRNAs, on cell surfaces without provoking an immune response. Rathinam's team investigated whether this sugar coating was the protective mechanism.\n\nTheir experiment involved removing the sugar coating from glycoRNAs and reintroducing them into cells. The immune system then attacked the now-naked RNA, demonstrating that the sugar coating was indeed preventing immune recognition. This sugar coating is particularly important because cells are often covered by glycoRNAs. This prevents dead cells from unnecessarily stimulating inflammation when they are cleaned up by the immune system.\n\nThese findings have implications for understanding and potentially treating autoimmune diseases like lupus, where the immune system attacks the body's own tissues. By understanding the role of RNA glycosylation in evading the immune system, scientists can investigate whether this process malfunctions in autoimmune conditions and explore potential therapeutic interventions.\n",
    "chinese_title": "甜蜜伪装：身体利用糖分将自身RNA隐藏于免疫系统之外",
    "chinese_summary": "康涅狄格大学在《自然》杂志上发表的这篇文章讨论了人体如何防止自身RNA触发免疫反应的新理解。Vijay Rathinam及其同事领导的研究人员发现，细胞用糖包裹其RNA，产生“糖基化RNA”，有效地保护RNA免受免疫系统的攻击。\n\n免疫系统通常将裸露的RNA识别为病毒或细菌感染的信号并启动攻击。然而，我们自身的细胞也含有RNA，这些RNA通常显示在细胞表面。之前的研究已经观察到细胞表面存在这些糖基化的RNA，或称糖基化RNA，而没有引起免疫反应。Rathinam的团队研究了这种糖涂层是否是保护机制。\n\n他们的实验包括去除糖基化RNA上的糖涂层，然后将其重新引入细胞。免疫系统随后攻击了现在裸露的RNA，表明糖涂层确实阻止了免疫识别。这种糖涂层尤其重要，因为细胞通常被糖基化RNA覆盖。这可以防止死细胞在被免疫系统清除时不必要地刺激炎症。\n\n这些发现对于理解和潜在治疗自身免疫性疾病（如狼疮，其中免疫系统攻击身体自身的组织）具有重要意义。通过了解RNA糖基化在逃避免疫系统中的作用，科学家可以研究该过程是否在自身免疫性疾病中发生故障，并探索潜在的治疗干预措施。"
  },
  {
    "id": "44999194",
    "title": "Materialized views are obviously useful",
    "url": "https://sophiebits.com/2025/08/22/materialized-views-are-obviously-useful",
    "summary": "This article argues for the obvious usefulness of materialized views, specifically incremental view maintenance. The author illustrates the pain of maintaining derived data consistency through a scenario of displaying task counts per project in a task tracking app.\n\nInitially, a simple SQL query to count tasks is deemed too slow. A Redis cache is implemented, which introduces data staleness and eventual accuracy issues. Incremental updates to the Redis cache are attempted, leading to complex code to handle inserts, deletes, and updates (including task movements between projects). The risk of inconsistencies due to server crashes before cache updates necessitates even more complex solutions like Kafka.\n\nThe author laments the complexity and error-proneness of hand-rolled solutions for data synchronization, preferring the simplicity and correctness of the initial SQL query. The article champions materialized views with incremental view maintenance, where the database automatically keeps a precomputed result (the task count) up-to-date based on changes to the underlying data (the tasks table). This eliminates the need for application-level code to manage synchronization, reducing complexity and the potential for errors. While acknowledging that current implementations might not be perfect, the author believes the concept is fundamentally sound and will become a standard feature in future database systems.\n",
    "chinese_title": "物化视图显然很有用.",
    "chinese_summary": "本文论证了物化视图（特别是增量视图维护）的显而易见的实用性。作者通过一个任务跟踪应用程序中显示每个项目的任务计数的场景，说明了维护派生数据一致性的痛苦。\n\n最初，一个简单的用于统计任务数量的SQL查询被认为太慢。因此，引入了Redis缓存，但这导致了数据过时和最终的准确性问题。随后尝试对Redis缓存进行增量更新，导致了复杂的代码来处理插入、删除和更新（包括任务在项目之间的移动）。由于服务器在缓存更新之前崩溃而导致的不一致风险，需要更复杂的解决方案，如Kafka。\n\n作者感叹手工构建的数据同步解决方案的复杂性和易错性，更倾向于最初SQL查询的简单性和正确性。本文提倡使用具有增量视图维护的物化视图，数据库可以根据底层数据（任务表）的变化自动保持预先计算的结果（任务计数）的更新。这消除了应用程序级别管理同步的需求，降低了复杂性和潜在的错误。作者承认当前的实现可能并不完美，但他相信这个概念从根本上是合理的，并且将成为未来数据库系统中的一个标准功能。"
  },
  {
    "id": "45003750",
    "title": "Dynamically patch a Python function's source code at runtime",
    "url": "https://ericmjl.github.io/blog/2025/8/23/wicked-python-trickery-dynamically-patch-a-python-functions-source-code-at-runtime/",
    "summary": "Eric J. Ma's blog post discusses a Python trick involving dynamically changing a function's source code at runtime using the `compile` and `exec` functions. This allows for building more flexible AI bots that can generate and execute code with access to the current environment's variables and functions.\n\nThe author explains how every Python function has a `.__code__` attribute that can be replaced with compiled bytecode of new source code. This is achieved by compiling a string containing the new function definition using `compile` and then executing it within a specific namespace using `exec`.\n\nThe motivation behind this trick was to improve the author's LlamaBot, specifically the ToolBot implementation. Unlike the original AgentBot, ToolBot focuses solely on tool selection and delegates execution to the external environment. This is exemplified by the `write_and_execute_code` tool, which allows the LLM to generate Python functions that can access and manipulate the current runtime's global variables and dataframes. This eliminates the need for writing specific tools for each operation. The author was inspired by Marimo's generative UIs, aiming to give LLMs access to all variables in the runtime.\n\nHowever, the author acknowledges significant security risks associated with this approach, as a malicious LLM output could execute harmful code.  The original implementation used a Docker container, but had limited access to existing data.  While the dynamic compilation pattern exposes the runtime, the author is considering using Restricted Python for code sanitization in the future. The author highlights the importance of separating tool selection from execution and the malleability of Python's runtime.\n",
    "chinese_title": "在运行时动态地补丁Python函数的源代码",
    "chinese_summary": "Eric J. Ma 的博文讨论了一个 Python 技巧，该技巧涉及在运行时使用 `compile` 和 `exec` 函数动态更改函数的源代码。这使得构建更灵活的 AI 机器人成为可能，这些机器人可以生成和执行代码，并访问当前环境的变量和函数。\n\n作者解释了每个 Python 函数都有一个 `.__code__` 属性，可以使用新源代码的编译字节码替换该属性。 这是通过使用 `compile` 编译包含新函数定义的字符串，然后使用 `exec` 在特定命名空间中执行它来实现的。\n\n这个技巧背后的动机是为了改进作者的 LlamaBot，特别是 ToolBot 的实现。与最初的 AgentBot 不同，ToolBot 仅专注于工具选择，并将执行委托给外部环境。`write_and_execute_code` 工具就是这方面的一个例子，它允许 LLM 生成可以访问和操作当前运行时全局变量和数据帧的 Python 函数。这消除了为每个操作编写特定工具的需求。作者受到了 Marimo 的生成式 UI 的启发，旨在让 LLM 访问运行时中的所有变量。\n\n然而，作者承认与这种方法相关的重大安全风险，因为恶意 LLM 输出可能会执行有害代码。 最初的实现使用了 Docker 容器，但对现有数据的访问有限。 虽然动态编译模式暴露了运行时，但作者正在考虑将来使用 Restricted Python 进行代码清理。 作者强调了将工具选择与执行分离的重要性以及 Python 运行时的可塑性。"
  },
  {
    "id": "44999094",
    "title": "Motion (YC W20) Is Hiring Principal Software Engineers",
    "url": "https://jobs.ashbyhq.com/motion/7355e80d-dab2-4ba1-89cc-a0197e08a83c?utm_source=hn",
    "summary": "This is a job posting for a Principal Software Engineer at Motion, a company that was part of the Y Combinator Winter 2020 batch (YC W20). The entire content of the posting outside the title is a short message: \"You need to enable JavaScript to run this app.\" This suggests that the job posting is interactive or dynamically generated, but requires JavaScript to be enabled in the user's browser to display properly. Without JavaScript enabled, it's impossible to determine the specifics of the role, required skills, company details, or application process. The only definitive information is that Motion (YC W20) is looking to hire a Principal Software Engineer.\n",
    "chinese_title": "Motion (YC W20) 招聘首席软件工程师",
    "chinese_summary": "招聘：Motion (YC W20) 首席软件工程师。提示信息：“您需要启用JavaScript才能运行此应用。”"
  },
  {
    "id": "45007414",
    "title": "Halt and Catch Fire Syllabus (2021)",
    "url": "https://bits.ashleyblewer.com/halt-and-catch-fire-syllabus/",
    "summary": "This is a syllabus for a \"watching club\" centered around the TV series *Halt and Catch Fire*, a fictional drama about the tech industry in the 1980s and 90s. The curriculum is designed for small groups interested in exploring technology history through the lens of the show.\n\nThe syllabus provides a structured semester-long course consisting of 15 classes, each focusing on specific episodes and related themes. Each class includes several components:\n\n*   **Apéritifs:** Optional, light viewing as entertainment before the main session.\n*   **RFC/Emulation as Koan:** Reflective exercises based on Internet Engineering Task Force RFCs and emulated computers.\n*   **Themes:** Suggested topics for discussion.\n*   **Prompts:** Questions to stimulate conversation.\n*   **Readings:** Supplementary materials for deeper exploration.\n*   **Description:** Summaries of the episodes and their relevance to tech history.\n*   **Episode Summaries:** Links to detailed episode recaps with content warnings to aid in pre-viewing or skipping episodes as needed.\n\nThe goal is to facilitate engaging discussions about the historical context and technological developments portrayed in the series. The curriculum and website were designed by Ashley Blewer.\n",
    "chinese_title": "逆火启动课程大纲（2021）",
    "chinese_summary": "这是一份围绕电视剧《奔腾年代》（*Halt and Catch Fire*）展开的“观影俱乐部”的教学大纲。该剧是一部虚构的电视剧，讲述了 20 世纪 80 年代和 90 年代的科技行业。课程专为有兴趣通过该剧了解科技历史的小组设计。\n\n该教学大纲提供了一个结构化的学期课程，包含 15 节课，每节课侧重于特定的剧集和相关主题。 每节课包括几个组成部分：\n\n*   **餐前小点：** 可选，在主要课程开始前作为娱乐的轻松观看。\n*   **RFC/作为公案的模拟：** 基于互联网工程任务组 RFC 和模拟计算机的反思练习。\n*   **主题：** 建议的讨论主题。\n*   **提示：** 激发对话的问题。\n*   **阅读材料：** 用于更深入探索的补充材料。\n*   **描述：** 剧集摘要及其与科技历史的相关性。\n*   **剧集摘要：** 包含内容警告的详细剧集回顾链接，以帮助预先观看或根据需要跳过剧集。\n\n目标是促进关于剧中描绘的历史背景和技术发展的引人入胜的讨论。课程和网站由 Ashley Blewer 设计。"
  },
  {
    "id": "45008740",
    "title": "Ghrc.io appears to be malicious",
    "url": "https://bmitch.net/blog/2025-08-22-ghrc-appears-malicious/",
    "summary": "This article warns about the potential maliciousness of the domain `ghrc.io`, a typo of the legitimate GitHub container registry `ghcr.io`. While `ghrc.io` appears to be a default Nginx installation on the surface, its `/v2/` endpoint, used for OCI API requests, mimics the authentication challenge of legitimate container registries. Specifically, it returns a `401` error with a `www-authenticate` header that instructs OCI clients (like Docker, containerd, and Kubernetes) to send credentials to `https://ghrc.io/token`.\n\nThis is concerning because a default Nginx server wouldn't have this header configured. The author suspects a typo-squatting attack designed to steal GitHub credentials. The risk arises if a user mistakenly logs in to `ghrc.io` or configures a system (like a GitHub Action or Kubernetes cluster) to use `ghrc.io` as a registry, causing credentials to be sent to the malicious server. Simply trying to pull or push without logging in is safe.\n\nThe recommended action for anyone who has accidentally logged into `ghrc.io` is to immediately change their GitHub password, revoke any Personal Access Tokens (PATs) used, and check their GitHub account for suspicious activity. The attacker could potentially use stolen credentials to push malicious images or gain direct access to the GitHub account.\n",
    "chinese_title": "Ghrc.io 疑似恶意网站",
    "chinese_summary": "该文章警告域名`ghrc.io`的潜在恶意性，它是合法GitHub容器注册表`ghcr.io`的拼写错误。尽管`ghrc.io`表面上看起来是默认的Nginx安装，但其用于OCI API请求的`/v2/`端点模仿了合法容器注册表的身份验证挑战。具体来说，它返回一个带有`www-authenticate`头的`401`错误，该头指示OCI客户端（如Docker、containerd和Kubernetes）向`https://ghrc.io/token`发送凭据。\n\n令人担忧的是，默认的Nginx服务器不会配置此标头。作者怀疑这是一起旨在窃取GitHub凭据的抢注域名攻击。如果用户错误地登录到`ghrc.io`或配置系统（如GitHub Action或Kubernetes集群）使用`ghrc.io`作为注册表，导致凭据被发送到恶意服务器，则会产生风险。仅仅尝试拉取或推送而不登录是安全的。\n\n对于任何意外登录到`ghrc.io`的人，建议立即更改其GitHub密码，撤销任何使用的个人访问令牌（PAT），并检查其GitHub帐户是否存在可疑活动。攻击者可能会使用被盗的凭据来推送恶意镜像或直接访问GitHub帐户。"
  },
  {
    "id": "44979687",
    "title": "Y Combinator files brief supporting Epic Games, says store fees stifle startups",
    "url": "https://www.macrumors.com/2025/08/21/y-combinator-epic-games-amicus-brief/",
    "summary": "Y Combinator (YC), a prominent startup accelerator, filed an amicus brief supporting Epic Games in its legal battle against Apple over App Store policies. YC argues that Apple's \"anti-steering restraints\" and high app store fees stifle the growth of startups that rely on in-app purchases.\n\nYC specifically calls on the court to uphold the order that requires Apple to allow developers to link to external purchase options without fees or restrictions. This order stemmed from a finding that Apple was in \"willful violation\" of a previous injunction by charging up to a 27% fee for developers who directed users to external websites for purchases. While Apple implemented the changes, it also filed an appeal, prompting Epic and YC to actively work to prevent Apple from reverting to its previous policies.\n\nYC believes the 30% \"Apple Tax\" creates a \"profound and often insurmountable barrier to entry\" for startups, hindering their ability to scale, hire, and reinvest. They emphasize that the current enforcement order, allowing free external linking, has already renewed investor interest in previously unviable app-based business models. YC ultimately argues that Apple's fees are disproportionate to the value they provide and advocates for the permanent removal of anti-steering restraints to foster innovation and competition within the tech industry.\n",
    "chinese_title": "Y Combinator提交简报支持Epic Games，称商店费用扼杀初创企业",
    "chinese_summary": "著名创业加速器Y Combinator (YC) 提交了一份法庭之友陈述，支持Epic Games针对苹果App Store政策的法律诉讼。YC认为，苹果的“反导流限制”和高额应用商店费用扼杀了依赖应用内购买的初创企业的增长。\n\nYC特别呼吁法院维持该命令，该命令要求苹果允许开发者链接到外部购买选项，且不收取费用或施加限制。该命令源于一项裁决，即苹果“故意违反”先前的禁令，对引导用户访问外部网站进行购买的开发者收取高达27%的费用。虽然苹果实施了这些变更，但它也提出了上诉，促使Epic和YC积极合作，以防止苹果恢复到之前的政策。\n\nYC认为30%的“苹果税”为初创企业创造了一个“深刻且往往难以逾越的进入壁垒”，阻碍了它们扩张、招聘和再投资的能力。他们强调，当前允许免费外部链接的执行令，已经重新燃起了投资者对先前不可行的基于应用程序的商业模式的兴趣。YC最终认为，苹果的费用与他们提供的价值不成比例，并主张永久取消反导流限制，以促进科技行业的创新和竞争。"
  },
  {
    "id": "44998092",
    "title": "Will at centre of legal battle over Shakespeare’s home unearthed after 150 years",
    "url": "https://www.theguardian.com/culture/2025/aug/21/will-at-centre-of-legal-battle-over-shakespeares-home-unearthed-after-150-years",
    "summary": "A lost will, central to a legal dispute over William Shakespeare's final home, New Place, has been rediscovered at the National Archives after 150 years. The 1642 document was created by Thomas Nash, husband of Shakespeare's granddaughter, Elizabeth Hall, bequeathing New Place to his cousin, Edward Nash.\n\nAfter Thomas's death in 1647, Shakespeare's daughter, Susanna Hall, and Elizabeth refused to honor the will, asserting Shakespeare's own will granted them the property. This led to a chancery court case initiated by Edward against Elizabeth.\n\nDr. Dan Gosling found the will in an unlabelled box of 17th-century chancery documents. The will was previously known in the mid-19th century, but was subsequently lost during archival sorting.\n\nShakespeare had bought New Place in 1597 and lived there until his death. The dispute arose because Shakespeare's will had left the property to Susanna and Elizabeth. Elizabeth argued in court that the property belonged to her and her mother by right of Shakespeare's will.\n\nThe outcome of the legal battle is unclear, but Edward Nash never gained ownership of New Place. Upon Elizabeth's death in 1670, she stipulated Edward could acquire New Place, suggesting a prior agreement. However, the Clopton family ultimately acquired it, and it was demolished in 1702. The rediscovery of the original will provides valuable insight into the Shakespeare family's legal battles and is now accessible to the public.\n",
    "chinese_title": "莎士比亚故居地基重见天日，引发法律纠纷",
    "chinese_summary": "一份遗失的遗嘱，对于围绕威廉·莎士比亚的最后住所新居（New Place）的法律纠纷至关重要，在150年后于国家档案馆被重新发现。这份1642年的文件由莎士比亚的孙女伊丽莎白·霍尔的丈夫托马斯·纳什制作，将新居遗赠给他的表弟爱德华·纳什。\n\n1647年托马斯去世后，莎士比亚的女儿苏珊娜·霍尔和伊丽莎白拒绝履行遗嘱，声称莎士比亚自己的遗嘱将该房产授予了她们。这导致爱德华对伊丽莎白提起了衡平法院诉讼。\n\n丹·高斯林博士在一个未标记的17世纪衡平法院文件中发现了这份遗嘱。这份遗嘱在19世纪中叶曾被人们所知，但随后在档案整理过程中丢失。\n\n莎士比亚于1597年购买了新居，并一直居住在那里直到去世。争议的出现是因为莎士比亚的遗嘱将该房产留给了苏珊娜和伊丽莎白。伊丽莎白在法庭上辩称，该房产根据莎士比亚的遗嘱，理应属于她和她的母亲。\n\n这场法律战的结果尚不清楚，但爱德华·纳什从未获得新居的所有权。1670年伊丽莎白去世时，她规定爱德华可以获得新居，这表明之前可能存在协议。然而，最终克洛普顿家族获得了它，并在1702年被拆除。原始遗嘱的重新发现为了解莎士比亚家族的法律纠纷提供了宝贵的见解，现在公众可以查阅。"
  },
  {
    "id": "44967543",
    "title": "Burner Phone 101",
    "url": "https://rebeccawilliams.info/burner-phone-101/",
    "summary": "This article summarizes a \"Burner Phone 101\" workshop hosted at the Brooklyn Public Library. The workshop aimed to educate participants on phone-related risk modeling, privacy-protective smartphone practices, and the various burner phone options available.\n\nThe workshop began by establishing collective goals, secret goals, and anti-goals, emphasizing safety and responsible use. A core principle was understanding individual risks by answering: \"What are you trying to protect? Who are you protecting it from? What happens if it fails?\".\n\nParticipants then explored the risks associated with smartphones, including device IDs (IMSI and IMEI) and the four broad categories of data collection: Identity & finance, Location & movement, Communications & social graph, and Content & storage. Privacy tips for all phones were shared, including keeping devices updated, using strong PINs, disabling cloud backups, and enforcing strict app permissions. Specific tips for Android and iPhone users were also discussed.\n\nThe workshop then moved to \"off the grid\" options, categorizing burner phones as: Prepaid or repurposed phones, SIM rotation, Minimal or dumb phones, and Device disguises (VoIP, VPNs). It was emphasized that IMSI and IMEI still make true anonymity difficult, and how a phone is set up and used is as important as buying it.\n\nFinally, the workshop covered when \"no phone\" is the best option, especially where location tracking could become evidence or confiscation risk is high. Strategies like using paper maps and preset meeting points were discussed. The workshop concluded with a Q&A and live setup session.\n",
    "chinese_title": "一次性手机入门",
    "chinese_summary": "本文总结了在布鲁克林公共图书馆举办的“一次性手机入门101”研讨会。该研讨会旨在向参与者普及与手机相关的风险建模、保护隐私的智能手机使用方法以及各种一次性手机的选择。\n\n研讨会首先确立了集体目标、秘密目标和反目标，强调安全和负责任的使用。一个核心原则是通过回答以下问题来了解个人风险：“你想保护什么？你想保护它不受谁的侵害？如果失败会发生什么？”。\n\n参与者随后探讨了与智能手机相关的风险，包括设备 ID（IMSI 和 IMEI）以及四大类数据收集：身份与财务、位置与移动、通信与社交关系、内容与存储。分享了适用于所有手机的隐私保护技巧，包括保持设备更新、使用强密码、禁用云备份以及强制执行严格的应用程序权限。还讨论了针对 Android 和 iPhone 用户的具体技巧。\n\n研讨会随后转向“脱离网络”的选项，将一次性手机归类为：预付费或再利用手机、SIM 卡轮换、极简或非智能手机以及设备伪装（VoIP、VPN）。会议强调，IMSI 和 IMEI 仍然使真正的匿名变得困难，手机的设置和使用方式与购买一样重要。\n\n最后，研讨会涵盖了“不使用手机”何时是最佳选择，尤其是在位置跟踪可能成为证据或没收风险很高的情况下。讨论了诸如使用纸质地图和预设集合点等策略。研讨会以问答环节和现场设置环节结束。"
  },
  {
    "id": "45008308",
    "title": "GNU cross-tools: musl-cross 313.3M",
    "url": "https://github.com/cross-tools/musl-cross",
    "summary": "This document describes `musl-cross`, a lightweight project for creating cross-compilation toolchains using the musl libc. It provides pre-built toolchains for various target architectures, including ARM, x86, MIPS, PowerPC, RISC-V, and others. Each toolchain includes specific versions of the Linux kernel, Binutils, GCC, and Musl. The provided table lists the supported targets along with their corresponding versions of Kernel, Binutils, GCC, and Musl libraries.\n\nTo use the toolchains, users can download the appropriate tarball from the release page, extract it to `/opt/x-tools`, and then use the toolchain to compile code for the target architecture.\n\nThe document also outlines the process for building a custom toolchain by forking the project and creating a new release, or by building manually using the `./scripts/make ${target}` command. The project is licensed under the MIT license. The project acknowledges the contributions of crosstool-ng and musl-libc.\n",
    "chinese_title": "GNU 交叉工具：musl-cross 313.3M",
    "chinese_summary": "本文档介绍了`musl-cross`，一个轻量级的项目，用于创建使用musl libc的交叉编译工具链。它为各种目标架构提供了预构建的工具链，包括ARM、x86、MIPS、PowerPC、RISC-V等。每个工具链都包含特定版本的Linux内核、Binutils、GCC和Musl。下表列出了支持的目标及其对应的内核、Binutils、GCC和Musl库的版本。\n\n要使用这些工具链，用户可以从发布页面下载相应的tarball，将其解压到`/opt/x-tools`，然后使用该工具链为目标架构编译代码。\n\n本文档还概述了通过fork项目并创建新版本，或通过使用`./scripts/make ${target}`命令手动构建自定义工具链的过程。该项目采用MIT许可证。该项目感谢crosstool-ng和musl-libc的贡献。"
  },
  {
    "id": "45001979",
    "title": "Seed: Interactive software environment based on Common Lisp",
    "url": "https://github.com/phantomics/seed",
    "summary": "Seed is an interactive software environment built on Common Lisp that aims to provide a more intuitive and visual way to create and interact with programs. It moves beyond traditional text-based programming by using a tree grid with glyphs to represent code and data, offering a more accessible and flexible experience.\n\nSeed can be considered a Lisp IDE that integrates with ASDF, the Common Lisp build system. It works by defining systems with branches that represent input and output, managed by a `.seed` file in the package directory.\n\nTo install Seed, you need Common Lisp (SBCL is tested), ASDF, Quicklisp, Node.js, NPM, and Gulp. Node.js and NPM are used to build the web interface. It provides options for setting up Node.js (using NVM is recommended) and installing Gulp using `npm install -g gulp`. Afterwards, create a symbolic link to the cloned Seed repository inside the Quicklisp local-projects directory.\n\nInstallation can be done automatically using `install-seed.lisp` or manually by loading Seed in a Common Lisp REPL using `(ql:quickload 'seed)`. To automatically start Seed with SBCL, add `(asdf:load-system 'seed)` and `(seed:contact-open)` to your `.sbclrc` file. The web interface is located at port 8055 by default and can be accessed via `http://localhost:8055/portal.demo1/index.html` for the default demo portal. A tutorial is provided for new users. Seed includes a modified version of Panic, a React component building utility.\n",
    "chinese_title": "Seed：基于Common Lisp的交互式软件环境",
    "chinese_summary": "Seed：一个交互式的 Common Lisp 软件环境，旨在提供更直观和可视化的程序创建和交互方式。它通过使用带有字形的树状网格来表示代码和数据，超越了传统的基于文本的编程，从而提供更易于访问和更灵活的体验。\n\nSeed可以被认为是一个集成了ASDF（Common Lisp构建系统）的Lisp IDE。它通过定义具有代表输入和输出的分支的系统来工作，这些系统由包目录中的`.seed`文件管理。\n\n要安装Seed，你需要Common Lisp（已测试SBCL）、ASDF、Quicklisp、Node.js、NPM和Gulp。 Node.js和NPM用于构建Web界面。它提供了设置Node.js（推荐使用NVM）和使用`npm install -g gulp`安装Gulp的选项。之后，在Quicklisp的local-projects目录下创建一个指向克隆的Seed仓库的符号链接。\n\n可以使用`install-seed.lisp`自动安装，也可以通过在Common Lisp REPL中使用`(ql:quickload 'seed)`手动加载Seed。要使用SBCL自动启动Seed，请将`(asdf:load-system 'seed)`和`(seed:contact-open)`添加到你的`.sbclrc`文件中。 Web界面默认位于端口8055，可以通过`http://localhost:8055/portal.demo1/index.html`访问默认的演示门户。 为新用户提供了教程。 Seed包含Panic的修改版本，Panic是一个React组件构建实用程序。"
  },
  {
    "id": "45013989",
    "title": "The air is hissing out of the overinflated AI balloon",
    "url": "https://www.theregister.com/2025/08/25/overinflated_ai_balloon/",
    "summary": "Steven J. Vaughan-Nichols argues that the AI hype is deflating, suggesting AI's capabilities are plateauing and failing to deliver the promised returns on investment. He points to a MIT report indicating that 95% of companies haven't seen meaningful returns from AI investments, with only 5% of custom AI tools reaching production. While AI is used for simple tasks like drafting emails, humans dominate complex work by a large margin due to AI's limitations in context, learning, and evolution.\n\nThe author cites the Commonwealth Bank of Australia's return to human call center employees as an example of AI's inadequacy in customer service. He also mentions the disappointment surrounding ChatGPT-5, highlighting its shortcomings and the overall disillusionment within the AI community.\n\nReferencing economist Torsten Sløk, the article draws parallels between the current AI bubble and the dot-com bubble of the 1990s, noting the overvaluation of tech companies. While AI companies have seen pullbacks, the bubble hasn't yet burst, but the author believes it's losing air. Even OpenAI CEO Sam Altman acknowledges the overexcitement surrounding AI, though he still believes in its long-term importance. The author concludes that while AI has impacted some industries, its golden promises are largely unfulfilled, and investors may soon face disappointment.\n",
    "chinese_title": "过度膨胀的人工智能泡沫正在泄气。",
    "chinese_summary": "史蒂文·J·沃恩-尼科尔斯认为人工智能炒作正在降温，暗示人工智能的能力已达瓶颈，未能带来承诺的投资回报。他指出麻省理工学院的一份报告显示，95%的公司未从人工智能投资中获得有意义的回报，只有5%的定制人工智能工具投入生产。虽然人工智能被用于起草电子邮件等简单任务，但由于人工智能在上下文理解、学习和进化方面的局限性，人类在复杂工作中仍占据主导地位。\n\n作者引用澳大利亚联邦银行重新启用人工客服人员的例子，说明人工智能在客户服务方面的不足。他还提到了围绕ChatGPT-5的失望情绪，强调了它的缺点以及人工智能社区内部的普遍幻灭感。\n\n文章引用经济学家托斯顿·斯洛克的话，将当前的人工智能泡沫与20世纪90年代的互联网泡沫相提并论，指出科技公司估值过高。虽然人工智能公司已经出现回调，但泡沫尚未破裂，但作者认为它正在失去动力。即使是OpenAI首席执行官萨姆·奥特曼也承认了围绕人工智能的过度兴奋，尽管他仍然相信其长期重要性。作者最后总结说，虽然人工智能已经影响了一些行业，但它所承诺的黄金时代尚未实现，投资者可能很快就会面临失望。"
  },
  {
    "id": "44975313",
    "title": "Iterative DFS with stack-based graph traversal (2024)",
    "url": "https://dwf.dev/blog/2024/09/23/2024/dfs-iterative-stack-based",
    "summary": "This article explores the nuances of implementing Depth-First Search (DFS) iteratively using a stack, highlighting a common pitfall: simply replacing a queue with a stack in Breadth-First Search (BFS) doesn't guarantee a correct DFS. The author uses a specific graph example to illustrate how this flawed stack-based traversal can lead to incorrect vertex visit orders and a search tree that violates the fundamental property of DFS trees where all edges connect ancestors and descendants.\n\nThe core issue is that nodes higher in the \"tree\" push their neighbors as children too early, preventing proper depth-first exploration.\n\nThe article then presents two solutions to rectify this:\n\n1.  **Stack of Iterators:** Uses a stack to hold iterators for each vertex's adjacency list. This method allows the iterative process to pause and resume traversal of a vertex's neighbors, mimicking the call stack behavior of recursive DFS and maintaining both visit order and space efficiency.\n\n2.  **Delayed Visit Check:** Employs a stack of vertices, but pushes *all* neighbors onto the stack regardless of visitation status. The check for whether a node has been visited is performed *after* it's popped from the stack. This ensures proper DFS traversal but increases space usage due to duplicate entries. To further align with the recursive DFS approach, the author shows an implementation that processes neighbors in reverse order.\n\nThe article concludes with interactive code editors to experiment with different traversal approaches and reinforces the importance of understanding the subtle differences between stack-based graph traversal and true DFS, referencing David Eppstein's original blog post on the topic.\n",
    "chinese_title": "基于栈的图遍历迭代式深度优先搜索（2024）",
    "chinese_summary": "本文探讨了使用栈迭代实现深度优先搜索 (DFS) 的细微之处，并强调了一个常见的陷阱：简单地用栈替换广度优先搜索 (BFS) 中的队列并不能保证正确的 DFS。作者使用一个特定的图例来说明这种有缺陷的基于栈的遍历如何导致错误的顶点访问顺序，以及一棵违反 DFS 树基本属性的搜索树，该属性规定所有边都连接祖先和后代。\n\n核心问题是，\"树\"中较高的节点过早地将它们的邻居作为子节点推送，从而阻止了正确的深度优先探索。\n\n然后，本文提出了两种解决方案来纠正这个问题：\n\n1. **迭代器栈：** 使用栈来保存每个顶点邻接表的迭代器。这种方法允许迭代过程暂停并恢复遍历顶点的邻居，模拟递归 DFS 的调用栈行为，并保持访问顺序和空间效率。\n\n2. **延迟访问检查：** 采用顶点栈，但无论访问状态如何，都将*所有*邻居压入栈中。对节点是否已被访问的检查是在从栈中弹出节点*之后*执行的。这确保了正确的 DFS 遍历，但由于重复条目而增加了空间使用率。为了进一步与递归 DFS 方法保持一致，作者展示了一种以相反顺序处理邻居的实现。\n\n文章最后提供了交互式代码编辑器，用于试验不同的遍历方法，并强调了理解基于栈的图遍历和真正的 DFS 之间细微差别的重要性，并参考了 David Eppstein 关于该主题的原始博客文章。"
  },
  {
    "id": "44970583",
    "title": "My ZIP isn't your ZIP: Identifying and exploiting semantic gaps between parsers",
    "url": "https://www.usenix.org/conference/usenixsecurity25/presentation/you",
    "summary": "I am able to access the internet, so I will read and summarize the article.\n\nThe research paper \"My ZIP isn't your ZIP: Identifying and exploiting semantic gaps between parsers\" explores vulnerabilities arising from inconsistencies in how different software parses the same data format, specifically focusing on ZIP archives. The core argument is that these *semantic gaps* – discrepancies in interpretation – can be exploited by crafting malicious ZIP files that one parser handles legitimately while another handles in a vulnerable way, leading to security flaws.\n\nThe researchers developed a systematic methodology, called *Parser Differencing*, to automatically identify these semantic gaps. This involves generating a diverse set of ZIP archives with varying characteristics, feeding them to different ZIP parsing libraries, and comparing their outputs (files extracted, errors reported, etc.). Any deviations are flagged as potential semantic gaps.\n\nThe study identified several significant semantic gaps across popular ZIP libraries, including those in Java, Python, .NET, and others. They found that some parsers are more lenient than others when handling malformed ZIP files, leading to discrepancies in file extraction, path traversal, and denial-of-service vulnerabilities.\n\nThe paper demonstrates the practical exploitability of these semantic gaps with concrete examples. For instance, they crafted ZIP files that could bypass anti-virus scanning (by exploiting differences in handling of certain header fields) or achieve code execution (through path traversal flaws exposed by inconsistent handling of absolute paths or special characters in filenames). These attacks highlight the potential impact of relying on multiple parsers for security checks or data processing.\n\nThe authors conclude by advocating for more rigorous standardization and validation of parsing libraries, particularly for widely used data formats like ZIP. They suggest that parser differencing techniques can be used proactively to identify and address potential vulnerabilities, ultimately improving the security of software systems that rely on these parsers.\n",
    "chinese_title": "我的邮编非你邮编：识别并利用解析器之间的语义鸿沟",
    "chinese_summary": "我能够访问互联网，所以我会阅读并总结这篇文章。\n\n研究论文《我的ZIP并非你的ZIP：识别和利用解析器之间的语义鸿沟》探讨了由于不同软件解析相同数据格式时（尤其是ZIP存档）的不一致性而产生的漏洞。其核心论点是，这些“语义鸿沟”（即解释上的差异）可能被利用，通过构造恶意ZIP文件，使得一个解析器合法处理，而另一个解析器以易受攻击的方式处理，从而导致安全缺陷。\n\n研究人员开发了一种名为“解析器差异化”的系统方法，以自动识别这些语义鸿沟。这包括生成具有不同特征的各种ZIP存档，将它们馈送到不同的ZIP解析库，并比较它们的输出（提取的文件、报告的错误等）。任何偏差都被标记为潜在的语义鸿沟。\n\n该研究在流行的ZIP库中（包括Java、Python、.NET等）发现了几个重要的语义鸿沟。他们发现，在处理格式错误的ZIP文件时，一些解析器比其他解析器更宽松，从而导致文件提取、路径遍历和拒绝服务漏洞的差异。\n\n该论文通过具体的例子证明了这些语义鸿沟的实际可利用性。例如，他们构造了ZIP文件，这些文件可以通过绕过防病毒扫描（通过利用处理某些标头字段的差异）或实现代码执行（通过路径遍历漏洞，该漏洞因文件名中绝对路径或特殊字符的不一致处理而暴露）。这些攻击突出了依赖多个解析器进行安全检查或数据处理的潜在影响。\n\n作者最后倡导对解析库进行更严格的标准化和验证，尤其是对于像ZIP这样广泛使用的数据格式。他们建议可以使用解析器差异化技术主动识别和解决潜在的漏洞，最终提高依赖这些解析器的软件系统的安全性。"
  },
  {
    "id": "45002958",
    "title": "Writing with LLM is not a shame",
    "url": "https://reflexions.florianernotte.be/post/ai-transparency/",
    "summary": "This essay explores the author's evolving perspective on the transparency of AI use in writing, specifically in opinion pieces and essays. Initially shocked by the prevalence of AI-generated content and feeling obligated to disclose their own AI usage, the author shifted their stance after realizing that people don't disclose other editing tools like Photoshop.\n\nThe author then encountered initiatives promoting AI transparency, like Derek Sivers' AI disclaimer page and notbyai.fyi, and the University of Montreal's guide on AI in academics. This prompted a deeper reflection on why voluntarily disclosing AI use might be important.\n\nThe author argues that transparency isn't always necessary, especially for factual or commercial content. However, for subjective content like opinions and essays, the value and credibility of the content become crucial. The core issue, the author contends, is not AI use itself but proper sourcing. Just as writers credit their human sources, AI-assisted content should acknowledge the LLM's contribution.\n\nUltimately, the author believes mandatory AI disclosure risks creating bias against the content and the author. Instead, they suggest the focus should be on building ethical standards around AI use, rather than enforcing a \"thought police\" mentality through rigid disclosure rules. The author concludes that the debate around AI ethics is premature and often serves as a means of arbitrary criticism. Finally, in an ironic twist, the author discloses that they used an LLM for proofreading, generating interesting discussion on HackerNews.\n",
    "chinese_title": "使用LLM写作并不丢人",
    "chinese_summary": "本文探讨了作者对写作中人工智能使用透明度的不断演变的观点，尤其是在评论文章和随笔中。最初，作者对人工智能生成内容的普遍性感到震惊，并感到有义务披露自己的人工智能使用情况。但在意识到人们不会披露其他编辑工具（如Photoshop）后，作者改变了立场。\n\n随后，作者接触到了一些促进人工智能透明度的倡议，例如Derek Sivers的AI免责声明页面和notbyai.fyi，以及蒙特利尔大学的学术界人工智能指南。这促使作者更深入地思考了为什么自愿披露人工智能的使用可能很重要。\n\n作者认为，透明度并非总是必要的，尤其是在事实性或商业性内容方面。然而，对于主观内容，如观点和随笔，内容的价值和可信度变得至关重要。作者认为，核心问题不是人工智能的使用本身，而是适当的来源标注。正如作者会注明其人类来源一样，人工智能辅助生成的内容也应该承认LLM的贡献。\n\n最终，作者认为强制性的人工智能披露可能会造成对内容和作者的偏见。相反，他们建议重点应该放在围绕人工智能使用建立道德标准，而不是通过严格的披露规则来强制执行“思想警察”的心态。作者总结说，围绕人工智能伦理的辩论尚不成熟，并且常常成为任意批评的一种手段。最后，具有讽刺意味的是，作者披露他们使用了LLM进行校对，这在HackerNews上引发了有趣的讨论。"
  },
  {
    "id": "45003296",
    "title": "Show HN: Bicyclopedia",
    "url": "https://bicyclopedia.lemoing.ca/",
    "summary": "Bicyclopedia is an interactive online resource that allows users to explore the parts of a bicycle. It appears to rely heavily on visuals like images and animations to illustrate these parts. The creator acknowledges that these visuals might take some time to load and that users with screen readers or Javascript disabled will be limited to the textual descriptions and source code. The article encourages those users to consult additional project documentation for a better understanding.\n",
    "chinese_title": "展示一下：自行车百科全书",
    "chinese_summary": "Bicyclopedia is an interactive online resource that allows users to explore the parts of a bicycle. It appears to rely heavily on visuals like images and animations to illustrate these parts. The creator acknowledges that these visuals might take some time to load and that users with screen readers or Javascript disabled will be limited to the textual descriptions and source code. The article encourages those users to consult additional project documentation for a better understanding.\n"
  },
  {
    "id": "45006147",
    "title": "Bring Back the Blue-Book Exam",
    "url": "https://www.chronicle.com/article/bring-back-the-blue-book-exam",
    "summary": "生成摘要时出错",
    "chinese_title": "Bring Back the Blue-Book Exam",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45008832",
    "title": "How to check if your Apple Silicon Mac is booting securely",
    "url": "https://eclecticlight.co/2025/08/21/how-to-check-if-your-apple-silicon-mac-is-booting-securely/",
    "summary": "生成摘要时出错",
    "chinese_title": "How to check if your Apple Silicon Mac is booting securely",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45003033",
    "title": "A German ISP changed their DNS to block my website",
    "url": "https://lina.sh/blog/telefonica-sabotages-me",
    "summary": "生成摘要时出错",
    "chinese_title": "A German ISP changed their DNS to block my website",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44972000",
    "title": "Don't pick weird subnets for embedded networks, use VRFs",
    "url": "https://blog.brixit.nl/dont-pick-weird-subnets-for-embedded-networks/",
    "summary": "生成摘要时出错",
    "chinese_title": "Don't pick weird subnets for embedded networks, use VRFs",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45005071",
    "title": "SQLite (with WAL) doesn't do `fsync` on each commit under default settings",
    "url": "https://avi.im/blag/2025/sqlite-fsync/",
    "summary": "生成摘要时出错",
    "chinese_title": "SQLite (with WAL) doesn't do `fsync` on each commit under default settings",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45002584",
    "title": "The SD Association has an official SD card format utility [Win/OS X/Linux]",
    "url": "https://www.sdcard.org/downloads/sd-memory-card-formatter-for-linux/",
    "summary": "生成摘要时出错",
    "chinese_title": "The SD Association has an official SD card format utility [Win/OS X/Linux]",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44970974",
    "title": "What if every city had a London Overground?",
    "url": "https://www.dwell.com/article/what-if-every-city-had-a-london-overground-ac7a7ff9",
    "summary": "生成摘要时出错",
    "chinese_title": "What if every city had a London Overground?",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45006296",
    "title": "Paracetamol disrupts early embryogenesis by cell cycle inhibition",
    "url": "https://academic.oup.com/humrep/advance-article/doi/10.1093/humrep/deaf116/8234396",
    "summary": "生成摘要时出错",
    "chinese_title": "Paracetamol disrupts early embryogenesis by cell cycle inhibition",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45000982",
    "title": "Show HN: Port Kill – A lightweight macOS status bar development port monitor",
    "url": "https://github.com/kagehq/port-kill",
    "summary": "生成摘要时出错",
    "chinese_title": "Show HN: Port Kill – A lightweight macOS status bar development port monitor",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45010524",
    "title": "MCP Gateway and Registry",
    "url": "https://github.com/IBM/mcp-context-forge",
    "summary": "生成摘要时出错",
    "chinese_title": "MCP Gateway and Registry",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45007437",
    "title": "Looking back at my transition from Windows to Linux",
    "url": "https://www.scottrlarson.com/publications/publication-looking-back-windows-to-linux/",
    "summary": "生成摘要时出错",
    "chinese_title": "Looking back at my transition from Windows to Linux",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45001051",
    "title": "How to build a coding agent",
    "url": "https://ghuntley.com/agent/",
    "summary": "生成摘要时出错",
    "chinese_title": "How to build a coding agent",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45001751",
    "title": "Equal Earth – Political Wall Map (2018)",
    "url": "https://equal-earth.com/index.html",
    "summary": "生成摘要时出错",
    "chinese_title": "Equal Earth – Political Wall Map (2018)",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45001740",
    "title": "Wildthing – A model trained on role-reversed ChatGPT conversations",
    "url": "https://youaretheassistantnow.com/",
    "summary": "生成摘要时出错",
    "chinese_title": "Wildthing – A model trained on role-reversed ChatGPT conversations",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45014189",
    "title": "Why wind farms attract so much misinformation and conspiracy theory",
    "url": "https://theconversation.com/why-wind-farms-attract-so-much-misinformation-and-conspiracy-theory-262192",
    "summary": "生成摘要时出错",
    "chinese_title": "Why wind farms attract so much misinformation and conspiracy theory",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45008754",
    "title": "Where We Are Headed",
    "url": "https://www.hyperdimensional.co/p/where-we-are-headed",
    "summary": "生成摘要时出错",
    "chinese_title": "Where We Are Headed",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45012191",
    "title": "Cornell's world-first 'microwave brain' computes differently",
    "url": "https://newatlas.com/computers/cornell-microwave-brain/",
    "summary": "生成摘要时出错",
    "chinese_title": "Cornell's world-first 'microwave brain' computes differently",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44990089",
    "title": "Show HN: Game demo made with my homemade game engine",
    "url": "https://reprobate.site/",
    "summary": "生成摘要时出错",
    "chinese_title": "Show HN: Game demo made with my homemade game engine",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45012382",
    "title": "Don't like joining in? Why it could be your superpower",
    "url": "https://www.theguardian.com/lifeandstyle/2025/aug/24/dont-like-joining-in-why-it-could-be-your-superpower",
    "summary": "生成摘要时出错",
    "chinese_title": "Don't like joining in? Why it could be your superpower",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45000270",
    "title": "Evaluating LLMs for my personal use case",
    "url": "https://darkcoding.net/software/personal-ai-evals-aug-2025/",
    "summary": "生成摘要时出错",
    "chinese_title": "Evaluating LLMs for my personal use case",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44977833",
    "title": "Rolling the dice with CSS random()",
    "url": "https://webkit.org/blog/17285/rolling-the-dice-with-css-random/",
    "summary": "生成摘要时出错",
    "chinese_title": "Rolling the dice with CSS random()",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45002301",
    "title": "Valve Software handbook for new employees [pdf] (2012)",
    "url": "https://cdn.akamai.steamstatic.com/apps/valve/Valve_NewEmployeeHandbook.pdf",
    "summary": "生成摘要时出错",
    "chinese_title": "Valve Software handbook for new employees [pdf] (2012)",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45001371",
    "title": "ThinkMesh: A Python lib for parallel thinking in LLMs",
    "url": "https://github.com/martianlantern/ThinkMesh",
    "summary": "生成摘要时出错",
    "chinese_title": "ThinkMesh: A Python lib for parallel thinking in LLMs",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44985619",
    "title": "SSD-IQ: Uncovering the Hidden Side of SSD Performance [pdf]",
    "url": "https://www.vldb.org/pvldb/vol18/p4295-haas.pdf",
    "summary": "生成摘要时出错",
    "chinese_title": "SSD-IQ: Uncovering the Hidden Side of SSD Performance [pdf]",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44961155",
    "title": "Physics of badminton's new killer spin serve",
    "url": "https://arstechnica.com/science/2025/08/physics-of-badmintons-new-killer-spin-serve/",
    "summary": "生成摘要时出错",
    "chinese_title": "Physics of badminton's new killer spin serve",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44999373",
    "title": "The cost of interrupted work (2023)",
    "url": "https://blog.oberien.de/2023/11/05/23-minutes-15-seconds.html",
    "summary": "生成摘要时出错",
    "chinese_title": "The cost of interrupted work (2023)",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44996938",
    "title": "Line scan camera image processing for train photography",
    "url": "https://daniel.lawrence.lu/blog/y2025m09d21/",
    "summary": "生成摘要时出错",
    "chinese_title": "Line scan camera image processing for train photography",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44984599",
    "title": "Optimizing our way through Metroid",
    "url": "https://antithesis.com/blog/2025/metroid/",
    "summary": "生成摘要时出错",
    "chinese_title": "Optimizing our way through Metroid",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45008209",
    "title": "A bubble that knows it's a bubble",
    "url": "https://craigmccaskill.com/ai-bubble-history",
    "summary": "生成摘要时出错",
    "chinese_title": "A bubble that knows it's a bubble",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44994071",
    "title": "Manim: Animation engine for explanatory math videos",
    "url": "https://github.com/3b1b/manim",
    "summary": "生成摘要时出错",
    "chinese_title": "Manim: Animation engine for explanatory math videos",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45009796",
    "title": "Digital Cargo Cult: How Zoomers Ruined Old Internet Nostalgia",
    "url": "https://cy-x.net/articles?id=13",
    "summary": "生成摘要时出错",
    "chinese_title": "Digital Cargo Cult: How Zoomers Ruined Old Internet Nostalgia",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44958492",
    "title": "The Fancy Rug Dilemma",
    "url": "https://epan.land/essays/2025-8_FancyRugDilemma",
    "summary": "生成摘要时出错",
    "chinese_title": "The Fancy Rug Dilemma",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45011680",
    "title": "Programming for Cats",
    "url": "https://programmingforcats.com/",
    "summary": "生成摘要时出错",
    "chinese_title": "Programming for Cats",
    "chinese_summary": "生成摘要时出错"
  }
]