[
  {
    "id": "44863487",
    "title": "Wikimedia Foundation Challenges UK Online Safety Act Regulations",
    "url": "https://wikimediafoundation.org/news/2025/08/11/wikimedia-foundation-challenges-uk-online-safety-act-regulations/",
    "summary": "The Wikimedia Foundation legally challenged the UK's Online Safety Act (OSA) Categorisation Regulations, arguing they threaten Wikipedia and its volunteer contributors. The Foundation believes the regulations, specifically Category 1 duties, could undermine contributor privacy and safety, expose Wikipedia to manipulation, and divert resources. They argue that requiring identity verification, for example, could lead to data breaches and persecution for volunteers.\n\nThe High Court of Justice dismissed the challenge on August 11, 2025. However, the court emphasized that Ofcom and the UK government have a responsibility to protect Wikipedia during the OSA's implementation and indicated potential legal repercussions if they fail to do so. The court suggested Ofcom find a flexible interpretation of the rules or that Parliament amend them.\n\nThe legal challenge was initiated due to concerns that the OSA's stringent obligations, designed for high-risk commercial sites, would be inappropriately applied to Wikipedia. A volunteer Wikipedia editor, User:Zzuuzz, joined the challenge, highlighting the threat to individual contributors' rights. While not challenging the entire OSA, the Foundation focused specifically on the categorization regulations.\n\nThe Foundation remains committed to finding solutions to protect Wikipedia. They highlight Wikipedia's importance as a public good, its reliance on volunteer moderation, and its significant usage in the UK, including its role in preserving cultural heritage and languages like Welsh. Ofcom's first categorization decisions are expected this summer.\n",
    "chinese_title": "维基媒体基金会质疑英国网络安全法案条例",
    "chinese_summary": "维基媒体基金会就英国《网络安全法案》(OSA)分类条例提起法律挑战，认为其威胁维基百科及其志愿贡献者。基金会认为，该条例，特别是第一类义务，可能会损害贡献者的隐私和安全，使维基百科面临操纵，并转移资源。他们认为，例如，要求身份验证可能会导致数据泄露和对志愿者的迫害。\n\n高等法院于2025年8月11日驳回了这项挑战。然而，法院强调，Ofcom（英国通信管理局）和英国政府有责任在《网络安全法案》实施过程中保护维基百科，并指出如果他们未能做到这一点，可能会面临法律后果。法院建议Ofcom对规则进行灵活解释，或由议会对其进行修改。\n\n发起这项法律挑战的原因在于，人们担心《网络安全法案》为高风险商业网站设计的严格义务会被不恰当地应用于维基百科。一位维基百科志愿编辑，用户：Zzuuzz，加入了这项挑战，强调了对个人贡献者权利的威胁。虽然没有挑战整个《网络安全法案》，但基金会特别关注分类条例。\n\n基金会仍然致力于寻找保护维基百科的解决方案。他们强调了维基百科作为公共产品的重要性，它对志愿者管理的依赖，以及它在英国的广泛使用，包括它在保护文化遗产和威尔士语等语言方面的作用。Ofcom的首次分类决定预计将于今年夏季公布。"
  },
  {
    "id": "44865560",
    "title": "GitHub is no longer independent at Microsoft after CEO resignation",
    "url": "https://www.theverge.com/news/757461/microsoft-github-thomas-dohmke-resignation-coreai-team-transition",
    "summary": "GitHub will no longer operate as an independent company within Microsoft after the resignation of CEO Thomas Dohmke. Dohmke, who served as CEO for nearly four years, is leaving to pursue startup opportunities. His departure marks a significant shift as Microsoft will not be replacing the CEO position and will integrate GitHub into its CoreAI organization.\n\nCoreAI is a new Microsoft engineering group, led by former Meta executive Jay Parikh, focused on building an AI platform and tools for both Microsoft and its customers. This group also includes Microsoft’s platform and tools division and Dev Div teams. Parikh envisions this platform becoming an \"AI agent factory\" for enterprises.\n\nDohmke's memo to GitHub employees stated that GitHub's leadership team will continue its mission as part of Microsoft’s CoreAI organization. He will remain through the end of 2025 to assist with the transition.\n\nThe move signifies a change in Microsoft's approach to GitHub, ending its separate operational status since being acquired in 2018. Dohmke's recent Decoder appearance highlighted his focus on competition and GitHub's future role in software development, making his departure to potentially create AI competition noteworthy.\n",
    "chinese_title": "微软CEO辞职后，GitHub不再独立。",
    "chinese_summary": "在CEO Thomas Dohmke辞职后，GitHub将不再作为微软内部的独立公司运营。担任CEO近四年的Dohmke离职，寻求创业机会。他的离职标志着一个重大转变，微软将不再填补CEO职位，并将GitHub整合到其CoreAI组织中。\n\nCoreAI是微软新成立的工程部门，由前Meta高管Jay Parikh领导，专注于为微软及其客户构建AI平台和工具。该部门还包括微软的平台和工具部门以及Dev Div团队。Parikh设想将该平台发展成为企业的“AI Agent工厂”。\n\nDohmke在给GitHub员工的备忘录中表示，GitHub的领导团队将继续其使命，作为微软CoreAI组织的一部分。他将留任到2025年底，协助过渡。\n\n此举标志着微软对GitHub的策略发生了变化，结束了自2018年收购以来GitHub的独立运营状态。Dohmke最近在Decoder节目中的露面强调了他对竞争以及GitHub未来在软件开发中角色的关注，这使得他离职去创造潜在的AI竞争显得引人注目。"
  },
  {
    "id": "44864134",
    "title": "I tried every todo app and ended up with a .txt file",
    "url": "https://www.al3rez.com/todo-txt-journey",
    "summary": "Alireza Bashiri details his journey through numerous productivity apps (Notion, Todoist, Things 3, etc.) only to return to a simple `todo.txt` file. He found that these apps, while initially appealing, either became too complex, expensive, or distracting, ultimately hindering rather than helping his productivity.\n\nHis breaking point came when a dead phone forced him to use a sticky note, proving the effectiveness of a simple list. Now, his system revolves around a single text file updated daily with tasks and notes. Scheduled items have times listed, and sub-bullets provide context. Completed tasks are deleted or updated with progress notes.\n\nBashiri emphasizes the benefits of this minimalist approach: constant visibility, instant accessibility, AI integration for faster entry (optional), speed of task addition, easy searchability, complete ownership, honesty, and future-proof simplicity. He argues that true productivity lies in dumping tasks, regularly checking the list, and executing them, not in complex app features.\n\nHe addresses common questions about reminders (using a calendar), projects (using notes), collaboration (using work tools), and mobile access (using Dropbox sync with any text editor). He concludes that the best productivity system is the one you consistently use, and encourages readers to try his text file method for a week, emphasizing the power of simplicity.\n",
    "chinese_title": "我试遍了所有待办事项应用，最后还是用回了.txt文件。",
    "chinese_summary": "阿利雷扎·巴希里详细讲述了他使用众多效率应用（Notion、Todoist、Things 3等）的历程，最终回归简单的`todo.txt`文件。他发现这些应用虽然最初很有吸引力，但要么变得过于复杂、昂贵或分散注意力，最终阻碍而非帮助了他的效率。\n\n他的转折点是手机没电迫使他使用便签纸，这证明了简单列表的有效性。现在，他的系统围绕着一个每日更新的任务和笔记的文本文件展开。计划好的项目会列出时间，子弹头提供上下文。完成的任务会被删除或更新进度说明。\n\n巴希里强调了这种极简主义方法的好处：持续的可见性、即时可访问性、人工智能集成以加快录入速度（可选）、快速添加任务、易于搜索、完全所有权、诚实以及面向未来的简洁性。他认为，真正的效率在于倾倒任务、定期检查列表并执行它们，而不是复杂的应用程序功能。\n\n他解决了关于提醒（使用日历）、项目（使用笔记）、协作（使用工作工具）和移动访问（使用Dropbox与任何文本编辑器同步）的常见问题。他总结说，最好的效率系统是你始终如一使用的系统，并鼓励读者尝试他的文本文件方法一周，强调了简单性的力量。"
  },
  {
    "id": "44863242",
    "title": "OpenSSH Post-Quantum Cryptography",
    "url": "https://www.openssh.com/pq.html",
    "summary": "This OpenSSH document discusses the implementation of post-quantum cryptography to defend against \"store now, decrypt later\" attacks facilitated by future quantum computers. OpenSSH, since version 9.0, supports post-quantum key agreement algorithms by default, initially `sntrup761x25519-sha512`, and more recently `mlkem768x25519-sha256` which is the default scheme in OpenSSH 10.0. OpenSSH 10.1 will warn users when connecting with non-post-quantum algorithms, a warning that can be disabled using the `WarnWeakCrypto` option.\n\nThe document addresses the urgency of adopting post-quantum cryptography despite the lack of currently existing quantum computers that can break current encryption, highlighting the risk of attackers storing encrypted data today to decrypt later. While signature algorithms are also vulnerable to quantum computing attacks, they don't pose the same immediate risk as key agreement algorithms.\n\nThe document also acknowledges concerns about the newness of these post-quantum algorithms and defends their selection by explaining they have good safety margins and are implemented as \"hybrids,\" combining post-quantum algorithms with classical ones, ensuring the hybrid algorithm remains secure even if the post-quantum component is compromised. It advises users receiving warnings to update their SSH server to a version supporting these algorithms or selectively disable the warning.\n",
    "chinese_title": "OpenSSH 后量子密码学",
    "chinese_summary": "OpenSSH文档探讨了后量子密码学的实现，以防御未来量子计算机促成的“先存储，后解密”攻击。自9.0版本起，OpenSSH默认支持后量子密钥协商算法，最初是`sntrup761x25519-sha512`，最近是`mlkem768x25519-sha256`，后者是OpenSSH 10.0中的默认方案。当用户使用非后量子算法连接时，OpenSSH 10.1将发出警告，该警告可以使用`WarnWeakCrypto`选项禁用。\n\n该文档阐述了采用后量子密码学的紧迫性，尽管目前尚不存在能够破解当前加密技术的量子计算机，但强调了攻击者今天存储加密数据以便以后解密的风险。虽然签名算法也容易受到量子计算攻击，但它们不像密钥协商算法那样构成同样的直接风险。\n\n该文档还承认了对这些新后量子算法的担忧，并通过解释它们具有良好的安全裕度，并被实现为“混合”模式来捍卫其选择，即将后量子算法与经典算法相结合，确保即使后量子组件受到损害，混合算法仍然安全。它建议收到警告的用户将其SSH服务器更新到支持这些算法的版本，或有选择地禁用该警告。"
  },
  {
    "id": "44864680",
    "title": "36B solar mass black hole at centre of the Cosmic Horseshoe gravitational lens",
    "url": "https://academic.oup.com/mnras/article/541/4/2853/8213862?login=false",
    "summary": "Okay, I have read the article \"36B solar mass black hole at centre of the Cosmic Horseshoe gravitational lens\" from the provided URL. Here's a summary:\n\nThis research paper presents evidence for a supermassive black hole (SMBH) with an estimated mass of 36 billion solar masses located at the center of the galaxy responsible for creating the \"Cosmic Horseshoe,\" a well-known gravitational lens. The study leverages high-resolution imaging from the Hubble Space Telescope and other telescopes, combined with sophisticated lens modeling techniques, to analyze the lensed images of a background source galaxy.\n\nThe key finding is the unusually high mass of the lensing galaxy's central SMBH. This conclusion is derived from the detailed analysis of the lens configuration and the relative positions of the lensed images. By meticulously modeling the mass distribution of the lensing galaxy, including both its stellar component and the dark matter halo, the researchers were able to constrain the mass of the SMBH.\n\nThe unusually large SMBH mass suggests that either these ultramassive black holes are more common than previously thought, or that the lensing galaxy has experienced an unusual accretion history that allowed it to grow to such a substantial size. The authors note that the observed quasar activity and star formation in the lensing galaxy may have contributed to the growth of the SMBH.\n\nThis discovery is significant because it provides valuable insights into the co-evolution of galaxies and their central black holes, particularly in the most massive systems. The study highlights the power of gravitational lensing as a tool for probing the properties of distant galaxies and their central SMBHs, which are often too faint to be studied directly. Further observations and modeling are needed to confirm these findings and investigate the formation mechanisms that could have led to such a massive black hole.\n",
    "chinese_title": "宇宙马蹄铁引力透镜中心的36B太阳质量黑洞",
    "chinese_summary": "好的，我已经阅读了来自所提供URL的文章“宇宙马蹄引力透镜中心360亿太阳质量的黑洞”。以下是摘要：\n\n该研究论文提出了证据，表明位于造成“宇宙马蹄”这一著名引力透镜的星系中心存在一个估计质量为360亿太阳质量的超大质量黑洞（SMBH）。该研究利用哈勃太空望远镜和其他望远镜的高分辨率成像，结合复杂的透镜建模技术，来分析背景源星系的透镜图像。\n\n关键发现是透镜星系中心SMBH的质量异常之高。这个结论来自于对透镜结构和透镜图像相对位置的详细分析。通过精心模拟透镜星系的质量分布，包括其恒星成分和暗物质晕，研究人员得以约束SMBH的质量。\n\n这个异常巨大的SMBH质量表明，要么这些超大质量黑洞比之前认为的更常见，要么透镜星系经历了不寻常的吸积历史，使其能够增长到如此巨大的尺寸。作者指出，在透镜星系中观察到的类星体活动和恒星形成可能促进了SMBH的增长。\n\n这项发现意义重大，因为它为星系及其中心黑洞的共同演化提供了宝贵的见解，尤其是在最大质量的系统中。该研究突出了引力透镜作为探测遥远星系及其中心SMBH的属性的工具的力量，这些SMBH通常太暗而无法直接研究。还需要进一步的观测和建模来证实这些发现，并研究可能导致如此巨大的黑洞形成的机制。"
  },
  {
    "id": "44866587",
    "title": "Trellis (YC W24) Is Hiring: Automate Prior Auth in Healthcare",
    "url": "https://www.ycombinator.com/companies/trellis/jobs/Cv3ZwXh-forward-deployed-engineers-all-levels-august-2025",
    "summary": "Trellis (YC W24) is hiring Forward Deployed Engineers (All Levels) to automate prior authorization and streamline healthcare paperwork using AI. This San Francisco-based startup, spun out of Stanford AI lab and backed by YC and others, helps healthcare providers treat more patients faster by automating document intake, prior authorizations, and appeals.\n\nFDEs at Trellis will work directly with healthcare providers and pharmaceutical companies to understand their operational challenges and implement AI-powered solutions. Responsibilities include technical implementation (building AI workflows and data pipelines), customer collaboration, data engineering (processing complex healthcare data), product development (building custom interfaces), and strategic planning.\n\nTrellis seeks candidates who are passionate about AI and healthcare data, want to make a measurable impact, and are comfortable wearing multiple hats. The company touts a world-class team and offers extreme ownership opportunities.\n\nTrellis's AI agent is trained on millions of clinical data points to convert unstructured documents into structured data in EHRs, leading to benefits such as reduced treatment time, improved authorization rates, and enhanced drug program performance. The company aims to tackle the administrative costs that account for over 20% of US healthcare spending.\n",
    "chinese_title": "Trellis (YC W24) 招聘：自动化医疗预授权",
    "chinese_summary": "Trellis (YC W24) 正在招聘前线部署工程师（所有级别），利用人工智能自动化预先授权流程并简化医疗保健文书工作。这家位于旧金山的初创公司由斯坦福大学人工智能实验室衍生而来，并获得 YC 等机构的支持，通过自动化文件接收、预先授权和申诉，帮助医疗保健提供商更快地治疗更多患者。\n\nTrellis 的前线部署工程师将直接与医疗保健提供商和制药公司合作，了解他们的运营挑战并实施人工智能驱动的解决方案。职责包括技术实施（构建人工智能工作流程和数据管道）、客户协作、数据工程（处理复杂的医疗保健数据）、产品开发（构建定制界面）和战略规划。\n\nTrellis 正在寻找对人工智能和医疗保健数据充满热情、希望产生可衡量的影响并且能够胜任多项工作的候选人。该公司拥有一支世界一流的团队，并提供极高的自主权机会。\n\nTrellis 的人工智能代理接受了数百万个临床数据点的训练，可以将非结构化文档转换为 EHR 中的结构化数据，从而带来缩短治疗时间、提高授权率和增强药物计划表现等益处。该公司的目标是解决占美国医疗保健支出 20% 以上的行政成本问题。"
  },
  {
    "id": "44864185",
    "title": "Claude Code is all you need",
    "url": "https://dwyer.co.za/static/claude-code-is-all-you-need.html",
    "summary": "This article is about the author's experience using Claude Code, Anthropic's terminal-based coding tool, and how it has replaced GPT in their workflow. The author praises Claude Code for its seamless integration with existing workflows, ease of use, and effectiveness. They describe several projects they've built with Claude Code, including an \"autonomous startup builder,\" a SplitWise replacement, an AI poster maker, and more.\n\nA key point is the author's \"vibe coding\" approach, where they develop software primarily through interaction with the AI model, focusing on the desired functionality rather than directly writing or editing code. They illustrate this with a SplitWise clone, demonstrating how a detailed specification file can result in a fully working CRUD application with minimal effort.\n\nThe author emphasizes the importance of providing detailed input to the model and using the \"dangerously skip permissions\" flag. They also discuss the \"autonomous startup builder\" project, where Claude Code was given a VPS and instructions to develop a startup idea. While the resulting server monitoring app was somewhat misguided, the author was impressed by the tool's ability to configure a full-stack web application with minimal human input.\n\nThe author ran into a snag when Anthropic's usage policy flagged the startup for automatically publishing content without human oversight, leading to the account getting blocked.\n",
    "chinese_title": "Claude Code，你只需它就够了。",
    "chinese_summary": "本文讲述了作者使用Anthropic的终端编码工具Claude Code的经验，以及它如何在他们的工作流程中取代了GPT。作者赞扬了Claude Code与现有工作流程的无缝集成、易用性和有效性。他们描述了使用Claude Code构建的几个项目，包括一个“自主创业公司构建器”、一个SplitWise替代品、一个AI海报制作工具等等。\n\n一个关键点是作者的“氛围编码”方法，即他们主要通过与AI模型的交互来开发软件，专注于所需的功能，而不是直接编写或编辑代码。他们用一个SplitWise克隆来说明这一点，展示了一个详细的规范文件如何能够以最小的努力产生一个完全可用的CRUD应用程序。\n\n作者强调了向模型提供详细输入以及使用“危险地跳过权限”标志的重要性。他们还讨论了“自主创业公司构建器”项目，在该项目中，Claude Code被赋予了一个VPS和开发创业想法的指令。虽然由此产生的服务器监控应用程序有些误导，但作者对该工具在最少的人工输入下配置完整的全栈Web应用程序的能力印象深刻。\n\n作者遇到了一个障碍，Anthropic的使用政策标记了该创业公司未经人工监督自动发布内容，导致帐户被阻止。"
  },
  {
    "id": "44865997",
    "title": "The Joy of Mixing Custom Elements, Web Components, and Markdown",
    "url": "https://deanebarker.net/tech/blog/custom-elements-markdown/",
    "summary": "This article explores the synergy between Markdown and Custom Elements (Web Components) to create richer and more complex web content. The author highlights Markdown's simplicity in replacing complicated HTML with easier-to-read and write syntax.  While Markdown allows mixing with HTML, it doesn't solve the problem of repeatable, complex components. This is where Custom Elements come in.\n\nCustom Elements, a web standard supported by modern browsers, allow developers to define custom HTML tags that can output complex DOM structures from simple markup.  Essentially, they act as HTML macros, simplifying the source code while producing intricate outputs. The author demonstrates how a simple `<subscribe-to />` tag can be used within a Markdown document, and a Custom Element definition will expand this tag into a fully functional subscription form on the client-side.\n\nThe author emphasizes that Markdown handles text formatting, while Custom Elements handle more complex UI elements, resulting in a powerful combination.  The article also discusses the need for preprocessing Markdown to work around limitations with self-closing tags and multi-line attributes in Custom Elements.  Furthermore, the author delves into the idea of creating a mini-language using Markdown preprocessing, but cautions against over-complicating the process. Finally, the author touches on language design within Custom Elements, emphasizing the importance of minimizing the information required from editors and maximizing code efficiency. While processing markdown server-side is common, the author also mentions the possibility of doing it client-side.\n",
    "chinese_title": "混合自定义元素、Web Components 和 Markdown 的乐趣",
    "chinese_summary": "本文探讨了 Markdown 和自定义元素（Web Components）之间的协同作用，以创建更丰富、更复杂的 Web 内容。作者强调了 Markdown 在用更易读写的语法替代复杂 HTML 方面的简洁性。虽然 Markdown 允许与 HTML 混合使用，但它并没有解决可重复使用的复杂组件的问题。这就是自定义元素发挥作用的地方。\n\n自定义元素是一种受现代浏览器支持的 Web 标准，它允许开发者定义自定义 HTML 标签，这些标签可以通过简单的标记输出复杂的 DOM 结构。本质上，它们充当 HTML 宏，简化源代码，同时产生复杂输出。作者演示了如何在 Markdown 文档中使用简单的 `<subscribe-to />` 标签，并通过自定义元素定义将此标签扩展为客户端上功能完整的订阅表单。\n\n作者强调，Markdown 处理文本格式，而自定义元素处理更复杂的 UI 元素，从而形成强大的组合。文章还讨论了预处理 Markdown 的必要性，以解决自定义元素中自闭合标签和多行属性的限制。此外，作者还深入探讨了使用 Markdown 预处理创建微型语言的想法，但警告不要过度复杂化该过程。最后，作者谈到了自定义元素中的语言设计，强调了最大限度地减少编辑器所需的信息和最大限度地提高代码效率的重要性。虽然在服务器端处理 Markdown 很常见，但作者也提到了在客户端执行此操作的可能性。"
  },
  {
    "id": "44863409",
    "title": "Pricing Pages – A Curated Gallery of Pricing Page Designs",
    "url": "https://pricingpages.design/",
    "summary": "This article is a curated gallery of pricing page designs, showcasing various companies and their approaches to presenting their pricing models. The gallery highlights different design elements and strategies used in pricing pages, including:\n\n*   **Pricing Models:** Usage-based, custom pricing, tiered pricing, monthly/annual toggles.\n*   **Design Elements:** Stacked cards, standard tables, comparison tables, feature checkmarks, feature lists, usage-based calculators.\n*   **Industries:** The showcased companies span various industries, including AI & Machine Learning, Content & Media, Design & Creative, Developer Tools & Infrastructure, Business & Productivity, Fintech & Financial Services, and HR & Recruiting.\n\nThe article essentially provides a collection of real-world examples of pricing pages to inspire designers and businesses looking to create or improve their own pricing pages. Each entry includes the company name, a brief description of the design or pricing model used, and a link to the live pricing page. The article points out the various approaches one could take when designing a pricing page based on these live examples.\n",
    "chinese_title": "定价页面 - 精选定价页面设计图库",
    "chinese_summary": "本文精选了一系列定价页面设计案例，展示了不同公司呈现其定价模式的方式。该合集突出了定价页面中使用的各种设计元素和策略，包括：\n\n*   **定价模式：** 基于使用量、定制定价、分层定价、月度/年度切换。\n*   **设计元素：** 堆叠卡片、标准表格、对比表格、功能复选标记、功能列表、基于使用量的计算器。\n*   **行业：** 展示的公司涵盖多个行业，包括人工智能与机器学习、内容与媒体、设计与创意、开发者工具与基础设施、商业与效率、金融科技与金融服务以及人力资源与招聘。\n\n本文主要提供了一系列真实的定价页面示例，旨在为希望创建或改进自身定价页面的设计师和企业提供灵感。每个条目都包含公司名称、对所用设计或定价模式的简要描述以及指向实际定价页面的链接。本文根据这些实际案例指出了设计定价页面时可以采用的各种方法。"
  },
  {
    "id": "44866500",
    "title": "The Value of Institutional Memory",
    "url": "https://timharford.com/2025/05/the-value-of-institutional-memory/",
    "summary": "Tim Harford's article \"The Value of Institutional Memory\" highlights the importance of organizations retaining and utilizing their collective knowledge. He begins with the anecdote of a dredging crew unknowingly removing a canal plug due to lost historical records, illustrating the potential consequences of institutional amnesia.\n\nHarford provides several examples of how failing to preserve institutional memory can lead to significant problems. He cites Volkswagen's repeated emissions test cheating scandals and the Space Shuttle disasters of Challenger and Columbia, where similar errors occurred due to the forgetting of past lessons. He also discusses Lockheed's TriStar airliner, demonstrating how a lack of continuous production led to a loss of expertise and increased costs.\n\nHarford identifies several factors contributing to institutional forgetfulness: employee turnover, deterioration of physical archives, obsolescence of digital formats, and deliberate erasure of records. He points to the UK's Windrush scandal and the deletion of US government web pages as examples of intentional forgetting with detrimental consequences.\n\nThe article emphasizes that even organizations striving to preserve information can struggle. It concludes by urging organizations to actively combat institutional amnesia to avoid repeating past mistakes and losing valuable knowledge.\n",
    "chinese_title": "制度记忆的价值",
    "chinese_summary": "蒂姆·哈福德的文章《机构记忆的价值》强调了组织保留和利用其集体知识的重要性。他以一个疏浚团队因丢失历史记录而无意中移除运河塞的轶事开头，说明了机构失忆症的潜在后果。\n\n哈福德提供了几个未能保存机构记忆导致重大问题的例子。他引用了大众汽车屡次发生的排放测试作弊丑闻以及挑战者号和哥伦比亚号航天飞机灾难，这些事件中都由于忘记了过去的教训而发生了类似的错误。他还讨论了洛克希德公司的三星客机，证明了缺乏持续生产导致专业知识的丧失和成本的增加。\n\n哈福德指出了导致机构健忘症的几个因素：员工流动、物理档案的退化、数字格式的过时以及有意识地删除记录。他指出英国的“疾风一代”丑闻和美国政府网页的删除是有意遗忘并造成有害后果的例子。\n\n文章强调，即使是努力保存信息的组织也可能面临困难。文章最后敦促组织积极对抗机构失忆症，以避免重蹈覆辙并失去宝贵的知识。"
  },
  {
    "id": "44861106",
    "title": "The Chrome VRP Panel has decided to award $250k for this report",
    "url": "https://issues.chromium.org/issues/412578726",
    "summary": "The Chrome Vulnerability Reward Program (VRP) panel has awarded $250,000 for a security report submitted regarding the Chromium project. This indicates the report detailed a vulnerability of significant importance or complexity within the Chromium codebase. The large reward suggests the vulnerability could have potentially led to serious security consequences if exploited. While the specifics of the vulnerability are not detailed in the provided title and content, the announcement highlights the ongoing commitment of the Chrome VRP to incentivizing security research and rewarding responsible disclosure of security flaws within the Chromium browser. This program plays a crucial role in identifying and mitigating potential security risks before they can be exploited in the wild, thus enhancing the overall security and stability of Chrome for its users. The high reward also reinforces the effectiveness of bug bounty programs in attracting skilled security researchers and fostering a collaborative approach to software security.\n",
    "chinese_title": "Chrome VRP小组决定为这份报告奖励25万美元。",
    "chinese_summary": "Chrome漏洞奖励计划（VRP）小组已为一份关于Chromium项目的安全报告颁发了25万美元的奖金。这表明该报告详细描述了Chromium代码库中一个非常重要或复杂的漏洞。巨额奖励表明，如果该漏洞被利用，可能会导致严重的安全性后果。虽然所提供的标题和内容中没有详细说明该漏洞的具体细节，但该公告强调了Chrome VRP持续致力于激励安全研究，并奖励对Chromium浏览器中安全漏洞的负责任披露。该计划在识别和缓解潜在的安全风险方面发挥着关键作用，从而在这些风险在野外被利用之前，增强了Chrome的整体安全性和稳定性，使其用户受益。高额奖励也再次证明了漏洞赏金计划在吸引熟练的安全研究人员以及促进软件安全协作方法方面的有效性。"
  },
  {
    "id": "44864467",
    "title": "Designing Software in the Large",
    "url": "https://dafoster.net/articles/2025/07/22/designing-software-in-the-large/",
    "summary": "This article summarizes key concepts from \"A Philosophy of Software Design,\" focusing on managing complexity in large software systems for maintainability. Complexity arises from dependencies and obscurity, both hindering understanding and modification.\n\nDependencies occur when code cannot be understood in isolation, contributing to change amplification and cognitive load. Key contributors to dependency-complexity include: duplication, exceptions, inheritance, and temporal decomposition. The antidote is cohesive code achieved through deep modules – modules with small interfaces offering substantial functionality.\n\nObscurity stems from unclear or hidden information, leading to unknown unknowns and increased cognitive load. Contributors include vague names, inconsistency, inadequate documentation, and certain uses of indirection. The solution is obvious code characterized by precise names, consistency, thorough documentation, and clean formatting.\n\nThe article stresses a strategic mindset, advocating for proactive investment in clean design and problem-solving rather than a purely tactical approach focused solely on feature completion. This involves actively reducing complexity introduced during development. The central takeaway is that working code is insufficient; maintaining low complexity is essential for long-term software maintainability.\n",
    "chinese_title": "大规模软件设计",
    "chinese_summary": "本文总结了《软件设计哲学》中的关键概念，重点关注大型软件系统中为实现可维护性而进行的复杂度管理。复杂度源于依赖性和晦涩性，两者都会阻碍理解和修改。\n\n当代码无法独立理解时，就会产生依赖性，从而导致变更放大和认知负荷。依赖性复杂度的主要因素包括：重复、异常、继承和时序分解。解药是内聚的代码，通过深度模块实现——具有小接口并提供实质性功能的模块。\n\n晦涩性源于不清晰或隐藏的信息，导致未知的未知和增加的认知负荷。其影响因素包括：模糊的名称、不一致性、不充分的文档以及某些间接用法。解决方案是显而易见的代码，其特点是精确的名称、一致性、详尽的文档和清晰的格式。\n\n本文强调了一种战略思维，提倡积极投资于清晰的设计和问题解决，而不是仅仅关注功能完成的纯粹战术方法。这包括积极减少开发过程中引入的复杂度。核心要点是，能工作的代码是不够的；保持低复杂度对于长期的软件可维护性至关重要。"
  },
  {
    "id": "44862414",
    "title": "Faster substring search with SIMD in Zig",
    "url": "https://aarol.dev/posts/zig-simd-substr/",
    "summary": "This article details the author's exploration into using SIMD (Single Instruction, Multiple Data) to accelerate substring search in Zig, achieving significant performance improvements over the standard library's `std.mem.indexOf`.\n\nThe author implements a SIMD-friendly algorithm based on Wojciech Muła's work, which involves comparing the first and last characters of the \"needle\" (substring to search for) against 32-byte blocks of the \"haystack\" (text to search within) using SIMD registers.  This identifies potential matches and significantly reduces the number of full substring comparisons needed.\n\nBenchmarks using the entire text of Moby Dick show a 59% speed improvement and an 80% reduction in CPU cycles compared to `std.mem.indexOf`.\n\nThe article then explores optimizing character selection to reduce branch misses, by selecting the rarest characters in the needle instead of the first and last. This further improves performance by 9% and significantly reduces branch misses.\n\nFinally, the author discusses adapting the code to AVX-512, a newer SIMD instruction set that processes 64 bytes at a time. While unable to test it directly, the author expects a significant speedup. The author also analyzes performance on smaller strings, surprisingly finding that the SIMD algorithm is still faster, though the absolute time difference is small.\n\nThe conclusion emphasizes the effectiveness of SIMD for substring searching in Zig and highlights potential areas for further improvement.\n",
    "chinese_title": "Zig中使用SIMD实现更快的子字符串搜索",
    "chinese_summary": "本文详细介绍了作者探索使用SIMD（单指令多数据流）加速 Zig 中子字符串搜索的过程，相比于标准库的 `std.mem.indexOf`，性能得到了显著提升。\n\n作者基于 Wojciech Muła 的工作实现了一种 SIMD 友好的算法，该算法使用 SIMD 寄存器，将“needle”（要搜索的子字符串）的第一个和最后一个字符与“haystack”（要搜索的文本）的 32 字节块进行比较。这可以识别潜在的匹配项，并显著减少所需的完整子字符串比较次数。\n\n使用完整《白鲸记》文本的基准测试表明，与 `std.mem.indexOf` 相比，速度提高了 59%，CPU 周期减少了 80%。\n\n随后，本文探讨了优化字符选择以减少分支预测错误的方法，即选择 needle 中最稀有的字符而不是第一个和最后一个字符。 这使性能进一步提高了 9%，并显著减少了分支预测错误。\n\n最后，作者讨论了将代码适配到 AVX-512（一种更新的 SIMD 指令集，每次处理 64 字节）的情况。虽然无法直接测试，但作者预计会有显著的速度提升。作者还分析了在较小字符串上的性能，令人惊讶地发现 SIMD 算法仍然更快，尽管绝对时间差很小。\n\n结论强调了 SIMD 在 Zig 中进行子字符串搜索的有效性，并突出了未来可以改进的潜在领域。"
  },
  {
    "id": "44829783",
    "title": "Porting to OS/2 – GitPius",
    "url": "https://gitpi.us/article-archive/porting-to-os2/",
    "summary": "This article details Microrim's conversion of its R:BASE System V database manager from DOS to OS/2 in 1987. Facing a tight deadline from IBM's upcoming OS/2 announcement, Microrim committed to demonstrating a working OS/2 version. The company aimed to leverage OS/2's 16MB memory to overcome DOS's limitations and enhance performance.\n\nMicrorim's strategy involved a two-stage process: first, a language conversion from FORTRAN to C, and then the actual DOS to OS/2 port. The shift to C was necessitated by the lack of FORTRAN compilers for OS/2. They used Rapidtech Systems' FORTRix-C translator to accelerate this process, followed by manual refinement.\n\nThe OS/2 conversion itself was undertaken by a single engineer over three months, made easier by R:BASE System V's modular design and well-structured code. Microrim opted for a direct port, taking immediate advantage of OS/2's larger memory and multitasking capabilities, rather than a \"family application\" that would run on both DOS and OS/2 but limit features.  They prioritized a separate OS/2 application to fully exploit the new OS's capabilities.  A decision was made to use the standard math library, sacrificing some speed on systems without a math coprocessor for increased accuracy. Finally, Microrim built its own configuration control system within R:BASE to manage updates across both DOS and OS/2 versions.\n",
    "chinese_title": "移植到OS/2 – GitPius",
    "chinese_summary": "本文详细介绍了Microrim公司1987年将其R:BASE System V数据库管理系统从DOS移植到OS/2的過程。面对IBM即将发布的OS/2公告的紧迫期限，Microrim承诺展示一个可用的OS/2版本。该公司旨在利用OS/2的16MB内存来克服DOS的限制并提高性能。\n\nMicrorim的策略涉及一个两阶段的过程：首先，将语言从FORTRAN转换为C，然后是实际的DOS到OS/2移植。由于OS/2缺乏FORTRAN编译器，因此必须转换为C。他们使用Rapidtech Systems的FORTRix-C翻译器来加速这个过程，然后进行手动完善。\n\nOS/2的移植本身由一位工程师在三个月内完成，R:BASE System V的模块化设计和结构良好的代码使移植变得更加容易。Microrim选择直接移植，立即利用OS/2更大的内存和多任务处理能力，而不是选择“家族应用程序”，后者虽然可以在DOS和OS/2上运行，但会限制功能。他们优先考虑一个单独的OS/2应用程序，以充分利用新操作系统的功能。他们决定使用标准数学库，牺牲一些在没有数学协处理器系统上的速度来提高准确性。最后，Microrim在R:BASE中构建了自己的配置控制系统，以管理DOS和OS/2版本之间的更新。"
  },
  {
    "id": "44861521",
    "title": "AOL to discontinue dial-up internet",
    "url": "https://www.nytimes.com/2025/08/11/business/aol-dial-up-internet.html",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "AOL将停止拨号上网服务",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "44865916",
    "title": "UI vs. API. vs. UAI",
    "url": "https://www.joshbeckman.org/blog/practicing/ui-vs-api-vs-uai",
    "summary": "Josh Beckman's blog post \"UI vs. API vs. UAI\" introduces the concept of User Agent Interface (UAI) alongside the more established User Interface (UI) and Application Programming Interface (API). He argues that UAI design is emerging as a critical consideration due to the increasing use of AI agents (like LLMs) to perform tasks on behalf of humans.\n\nThe author emphasizes that all three interfaces (UI, API, and UAI) should be considered equally important in application development. When building features, developers need to consciously design them to be accessible and understandable through all three interfaces. Furthermore, changes to the underlying application logic should not unintentionally degrade any of the interfaces.\n\nA key principle is to centralize business logic in the underlying application rather than embedding it within any single interface. This ensures consistency across all interfaces. Interface-specific presentation and interaction patterns can differ legitimately, but the core functionality should be defined centrally.\n\nThe author uses the example of a reservation system that doesn't allow weekend bookings. Instead of implementing a UI-specific date picker that blocks weekends, the restriction should be defined in the application's core logic. Then, both the UI and the UAI can access that definition and present it appropriately within their respective interfaces.\n\nIn short, Beckman advocates for a holistic approach to interface design, ensuring features are accessible, consistent, and well-defined across UI, API, and the emerging UAI to cater to both human and AI users.\n",
    "chinese_title": "UI 与 API 与 UAI",
    "chinese_summary": "乔什·贝克曼的博客文章《UI vs. API vs. UAI》介绍了用户代理接口（UAI）的概念，与更成熟的用户界面（UI）和应用程序编程接口（API）并列。他认为，由于人工智能代理（如大型语言模型）越来越多地代表人类执行任务，UAI设计正逐渐成为一个关键的考量因素。\n\n作者强调，在应用程序开发中，所有三种接口（UI、API 和 UAI）都应被视为同等重要。在构建功能时，开发人员需要有意识地设计它们，使其可以通过所有三种接口访问和理解。此外，底层应用程序逻辑的更改不应无意中降低任何接口的质量。\n\n一个关键原则是将业务逻辑集中在底层应用程序中，而不是嵌入到任何单个接口中。这确保了所有接口的一致性。特定于接口的呈现和交互模式可以合法地不同，但核心功能应集中定义。\n\n作者使用一个不允许周末预订的预订系统作为例子。与其实现一个阻止周末的 UI 特定日期选择器，不如在应用程序的核心逻辑中定义该限制。然后，UI 和 UAI 都可以访问该定义，并在各自的接口中适当地呈现它。\n\n简而言之，贝克曼提倡一种全面的接口设计方法，确保功能在 UI、API 和新兴的 UAI 中都是可访问、一致且定义明确的，以满足人类和 AI 用户的需求。"
  },
  {
    "id": "44866677",
    "title": "Apache Iceberg V3 Spec new features for more efficient and flexible data lakes",
    "url": "https://opensource.googleblog.com/2025/08/whats-new-in-iceberg-v3.html",
    "summary": "This article announces the Apache Iceberg V3 specification, highlighting new features that aim to bridge the gap between data lakes and data warehouses. The key improvements focus on efficiency and flexibility for large-scale datasets.\n\n**Deletion Vectors:** V3 introduces binary deletion vectors, implemented using Roaring bitmaps, to efficiently handle row-level deletes. This method attaches a bitmap to each data file, indicating deleted rows, significantly improving query performance compared to previous positional delete file approaches.\n\n**Default Column Values:** V3 simplifies schema evolution by allowing default values to be specified when adding new columns. This eliminates the need for costly and disruptive backfills, making schema changes instantaneous and non-disruptive.\n\n**Enhanced Data Types and Lineage:** The V3 specification expands Iceberg's capabilities with improved row-level lineage tracking for auditing and CDC pipelines.  It also introduces richer data types including VARIANT for semi-structured data, GEOMETRY/GEOGRAPHY for geospatial analysis, and nanosecond-precision timestamps.\n\nCollectively, these V3 features contribute to building a more efficient, flexible, and open data lakehouse architecture, enabling faster data operations and eliminating the traditional trade-offs between data lakes and data warehouses. Google highlights its support and contribution to the Iceberg project and encourages users to explore BigLake tables for Apache Iceberg in BigQuery for a managed Iceberg experience.\n",
    "chinese_title": "Apache Iceberg V3规范：提升数据湖效率与灵活性",
    "chinese_summary": "本文宣布 Apache Iceberg V3 规范，重点介绍旨在弥合数据湖和数据仓库之间差距的新功能。 主要改进侧重于大规模数据集的效率和灵活性。\n\n**删除向量：** V3 引入了二进制删除向量，使用 Roaring 位图实现，以有效处理行级删除。 此方法将位图附加到每个数据文件，指示已删除的行，与以前的位置删除文件方法相比，显著提高了查询性能。\n\n**默认列值：** V3 允许在添加新列时指定默认值，从而简化了模式演变。 这消除了对昂贵且具有破坏性的回填的需求，从而使模式更改变得即时且非破坏性。\n\n**增强的数据类型和沿袭：** V3 规范通过改进的行级沿袭跟踪（用于审计和 CDC 管道）扩展了 Iceberg 的功能。 它还引入了更丰富的数据类型，包括用于半结构化数据的 VARIANT、用于地理空间分析的 GEOMETRY/GEOGRAPHY 以及纳秒级精度的时间戳。\n\n总而言之，这些 V3 功能有助于构建更高效、更灵活和更开放的数据湖仓架构，从而实现更快的数据操作并消除数据湖和数据仓库之间的传统权衡。 Google 强调了其对 Iceberg 项目的支持和贡献，并鼓励用户探索 BigQuery 中的 BigLake 表（用于 Apache Iceberg），以获得托管的 Iceberg 体验。"
  },
  {
    "id": "44824811",
    "title": "A simple pixel physics simulator in Rust using Macroquad",
    "url": "https://github.com/gale93/sbixel",
    "summary": "This article introduces \"Sbixel,\" a simple pixel physics simulator written in Rust using the Macroquad game engine. The author created it as a learning project and highlights the ease and awesomeness of Macroquad.\n\nSbixel employs a \"sector\" system to optimize performance by focusing simulation on active pixel areas. All simulation settings are configurable in `src/def.rs`. The author explicitly states this project is a basic learning sandbox with limited ambitions for further development.\n\nHowever, a loose \"TODO\" list includes potential improvements like upgrading the water simulation, improving sand/water interaction, rendering pixels only in active sectors, refactoring the pixel processing logic, and potentially adding gas simulation and static objects. The author welcomes contributions from others.\n\nThe article provides instructions on how to get started: ensure Rust is installed, then run the project using `cargo run`. The author encourages exploration and experimentation with the code. The command `cargo run --release` is suggested for improved performance.\n",
    "chinese_title": "使用 Macroquad 在 Rust 中实现的简单像素物理模拟器",
    "chinese_summary": "本文介绍了“Sbixel”，一个用 Rust 语言编写的简单像素物理模拟器，它使用了 Macroquad 游戏引擎。作者将其作为学习项目创建，并强调了 Macroquad 的便捷性和强大之处。\n\nSbixel 采用“扇区”系统来优化性能，通过将模拟集中在活跃像素区域。所有模拟设置都可以在 `src/def.rs` 中进行配置。作者明确表示，这个项目是一个基础学习沙盒，对进一步开发的期望有限。\n\n然而，一个宽松的“TODO”列表包括潜在的改进，例如升级水模拟、改进沙/水交互、仅在活跃扇区中渲染像素、重构像素处理逻辑，以及可能添加气体模拟和静态对象。作者欢迎其他人的贡献。\n\n本文提供了入门指南：确保已安装 Rust，然后使用 `cargo run` 运行项目。作者鼓励探索和试验代码。建议使用 `cargo run --release` 命令以提高性能。"
  },
  {
    "id": "44862583",
    "title": "Mistral Integration Improved in Llama.cpp",
    "url": "https://github.com/ggml-org/llama.cpp/pull/14737",
    "summary": "This article discusses an improvement to the integration of Mistral models with llama.cpp. The current process of converting Mistral models to GGUF (the format used by llama.cpp) is inefficient, requiring conversion to Hugging Face format first, which can introduce errors. The update aims to address this by allowing direct conversion from Hugging Face to GGUF, and register the Mistral architecture natively in llama.cpp.\n\nKey improvements include a new script, `convert_mistral_to_gguf.py`, for direct conversion and native support for Mistral models. It also recommends using the `mistral-common` library for tokenization, accessible via a FastAPI REST API, to ensure accuracy. Users are advised to use the `/completions` route of the llama.cpp server with `return_tokens=True` for optimal integration. Multimodality is currently not supported.\n\nThe discussion involves feedback from the llama.cpp community, including suggestions to store the sliding window attention size in the GGUF file and to merge the new conversion script into the existing `convert_hf_to_gguf.py` for easier maintenance and user experience. The author addresses concerns about code duplication and explains the rationale behind the separate file, also working to resolve CI errors related to pydantic version conflict and pillow conflict. There is also an interesting addition in audio model support using Voxtral models.\n",
    "chinese_title": "Llama.cpp 中 Mistral 集成得到改进",
    "chinese_summary": "本文讨论了改进 Mistral 模型与 llama.cpp 集成的方案。目前将 Mistral 模型转换为 GGUF（llama.cpp 使用的格式）的过程效率低下，需要先转换为 Hugging Face 格式，这可能会引入错误。本次更新旨在解决这个问题，允许直接从 Hugging Face 转换为 GGUF，并在 llama.cpp 中原生注册 Mistral 架构。\n\n主要改进包括用于直接转换的新脚本 `convert_mistral_to_gguf.py` 以及对 Mistral 模型的原生支持。它还建议使用 `mistral-common` 库进行分词，可通过 FastAPI REST API 访问，以确保准确性。建议用户使用 llama.cpp 服务器的 `/completions` 路由，并设置 `return_tokens=True` 以实现最佳集成。目前不支持多模态。\n\n讨论包括来自 llama.cpp 社区的反馈，包括将滑动窗口注意力大小存储在 GGUF 文件中，以及将新的转换脚本合并到现有的 `convert_hf_to_gguf.py` 中，以便于维护和改善用户体验的建议。作者解决了关于代码重复的问题，并解释了单独文件的理由，同时努力解决与 pydantic 版本冲突和 pillow 冲突相关的 CI 错误。此外，还有一个使用 Voxtral 模型支持音频模型的有趣补充。"
  },
  {
    "id": "44862861",
    "title": "A Global Look at Teletext",
    "url": "https://text-mode.org/?p=23643",
    "summary": "This article provides a global overview of teletext, tracing its origins and evolution across different countries and standards. Beginning in the UK in the 1970s with Ceefax and ORACLE, the article explains how the World System Teletext (WST) standard, known for its blocky graphics, became widely adopted in Europe. It then contrasts WST with the French Antiope standard, which offered more sophisticated graphics and challenged American dominance in technology.\n\nThe article details the development of Telidon in Canada and its vector graphics, and the complex situation in the USA, where multiple standards competed before the adoption of NAPLPS. It argues that NAPLPS, while considered a US invention, heavily relied on publicly funded research from France and Canada.\n\nThe article explores the political and cultural significance of teletext in Europe, highlighting its adoption by public service broadcasters and its use in countries like Yugoslavia. It also touches on the delayed adoption in the Eastern Bloc, including the Soviet Union, and mentions unique instances of independent teletext broadcasting in Russia.\n\nFurthermore, it addresses the challenges of adapting WST to different languages, especially those with non-Latin scripts, and contrasts this with Japan's advanced JTES standard, which was designed to support large character sets, customizable fonts, and even sound. In conclusion, the article emphasizes the diverse approaches to teletext around the world, reflecting different technological capabilities, political agendas, and cultural needs.\n",
    "chinese_title": "全球图文电视概览",
    "chinese_summary": "本文概述了图文电视的全球概况，追溯了其在不同国家和标准下的起源和演变。文章从20世纪70年代英国的Ceefax和ORACLE开始，解释了以其块状图形而闻名的世界系统图文电视（WST）标准如何在欧洲被广泛采用。随后，文章将WST与法国的Antiope标准进行了对比，后者提供了更复杂的图形，并挑战了美国在技术领域的主导地位。\n\n文章详细介绍了加拿大Telidon的开发及其矢量图形，以及美国复杂的局势，在那里，多种标准在NAPLPS被采用之前展开竞争。文章认为，NAPLPS虽然被认为是美国的发明，但严重依赖于法国和加拿大的公共资助研究。\n\n文章探讨了图文电视在欧洲的政治和文化意义，强调了公共服务广播公司对其的采用，以及其在南斯拉夫等国家的使用。文章还提到了东欧集团（包括苏联）的延迟采用，并提到了俄罗斯独立图文电视广播的独特案例。\n\n此外，文章还探讨了将WST适应不同语言（尤其是那些使用非拉丁字母的语言）的挑战，并将其与日本先进的JTES标准进行了对比，后者旨在支持大型字符集、可定制字体甚至声音。总而言之，文章强调了世界各地对图文电视的不同方法，反映了不同的技术能力、政治议程和文化需求。"
  },
  {
    "id": "44860139",
    "title": "Vanishing from Hyundai’s data network",
    "url": "http://techno-fandom.org/~hobbit/cars/ev/offnet.html",
    "summary": "The author details their process of disconnecting their Hyundai Kona EV from Hyundai's Bluelink data network due to privacy concerns and the desire to prevent remote tracking or interference. They refused Bluelink activation at the dealership and sought to physically disable the car's cellular communication.\n\nTheir initial step was disabling the car's microphone in the headliner to prevent eavesdropping. After some research, they identified the cellular modem within the car's audio/visual head unit. The author then carefully removed the head unit by disassembling dash panels.\n\nOnce on the bench, they located the Continental-made cell modem daughterboard. They physically disconnected the antenna leads, effectively severing the car's cellular connection. The author considered removing the entire daughterboard, but kept it because it also handled Sirius XM (receive-only) and the P-CAN connection, which provides vehicle data display on the head unit.\n\nAfter reassembling and reinstalling the head unit, it functioned normally without any warnings about the missing cell modem. A minor issue with date/time settings was resolved with a hard reset. The previously functional BlueLink button on the rearview mirror became inoperable. The author successfully achieved their goal of making their car \"go dark\" and disconnecting it from Hyundai's data network.\n",
    "chinese_title": "从现代汽车数据网络中消失",
    "chinese_summary": "由于隐私顾虑以及防止远程追踪或干预的意愿，作者详细描述了其断开现代 Kona EV 与现代 Bluelink 数据网络连接的过程。他们在经销商处拒绝激活 Bluelink，并寻求物理禁用汽车的蜂窝通信。\n\n他们最初的步骤是禁用车顶内衬中的麦克风，以防止窃听。经过一番研究，他们确定了汽车音频/视频主机内的蜂窝调制解调器。然后，作者小心地拆卸仪表板面板，移除了主机。\n\n在工作台上，他们找到了 Continental 制造的蜂窝调制解调器子板。他们物理断开了天线引线，有效地切断了汽车的蜂窝连接。作者曾考虑移除整个子板，但保留了它，因为它还处理 Sirius XM（仅接收）和 P-CAN 连接，后者提供在主机上显示的车辆数据。\n\n重新组装并重新安装主机后，其功能正常，没有任何关于缺少蜂窝调制解调器的警告。通过硬重置解决了日期/时间设置的小问题。后视镜上之前可以使用的 BlueLink 按钮变得无法操作。作者成功实现了让他们的汽车“进入黑暗模式”并断开与现代数据网络连接的目标。"
  },
  {
    "id": "44864803",
    "title": "Apple brings OpenAI's GPT-5 to iOS and macOS",
    "url": "https://arstechnica.com/ai/2025/08/apple-brings-openais-gpt-5-to-ios-and-macos/",
    "summary": "This article by Samuel Axon discusses Apple's anticipated integration of OpenAI's GPT-5 model into its iOS 26, iPadOS 26, and macOS Tahoe 26 operating systems, expected to be released around September. While GPT-5 is already available on platforms like GitHub Copilot and Microsoft's Copilot, its arrival on Apple devices will upgrade the existing ChatGPT integration within iOS.\n\nThe article highlights the significant improvements GPT-5 offers over its predecessor, including a purported 80% reduction in hallucinations and a new system where the model automatically chooses between reasoning-optimized and non-reasoning modes based on the user's prompt. The article poses questions about how this new system will be implemented within iOS, particularly for free vs. paid ChatGPT users, and whether Apple will allow manual model selection.\n\nWhile Apple primarily relies on its own \"Apple Intelligence\" models for most AI-related features, it allows users to refer prompts to ChatGPT when Apple's models are insufficient. GPT-5, with its vastly larger parameter size compared to Apple's local models, promises significantly enhanced capabilities.\n\nThe article concludes by suggesting that while the immediate integration of GPT-5 may not dramatically alter the existing ChatGPT implementation, Apple has future AI plans that could bring more significant changes in subsequent OS updates.\n",
    "chinese_title": "苹果将 OpenAI 的 GPT-5 带到 iOS 和 macOS。",
    "chinese_summary": "塞缪尔·阿克松的这篇文章讨论了苹果公司预期将OpenAI的GPT-5模型集成到其iOS 26、iPadOS 26和macOS Tahoe 26操作系统中，预计将于9月份左右发布。虽然GPT-5已经在GitHub Copilot和微软Copilot等平台上可用，但它在苹果设备上的到来将升级iOS中现有的ChatGPT集成。\n\n这篇文章强调了GPT-5相对于其前代的显著改进，包括据称幻觉减少了80%以及一种新的系统，该系统允许模型根据用户的提示自动选择推理优化模式和非推理模式。 这篇文章提出了关于这种新系统将如何在iOS中实施的问题，特别是对于免费和付费ChatGPT用户，以及苹果是否允许手动模型选择。\n\n虽然苹果主要依靠其自己的“苹果智能”模型来实现大多数与人工智能相关的功能，但它允许用户在苹果模型不足时将提示提交给ChatGPT。 与苹果的本地模型相比，GPT-5具有更大的参数规模，有望显著增强其功能。\n\n文章最后暗示，虽然GPT-5的立即集成可能不会大幅改变现有的ChatGPT实现，但苹果拥有未来的AI计划，可能会在随后的操作系统更新中带来更重大的变化。"
  },
  {
    "id": "44822730",
    "title": "Millau Viaduct",
    "url": "https://www.fosterandpartners.com/projects/millau-viaduct",
    "summary": "The Millau Viaduct, located in southern France, is presented as an example of successful architectural integration into infrastructure design. Created through close collaboration between architects and structural engineers, it completes a crucial missing link in the A75 autoroute, providing a high-speed route from Paris to the Mediterranean.\n\nThe article highlights that the bridge's design prioritizes elegance and minimal environmental impact over simply celebrating the river crossing. Its cable-stayed, masted structure allows for optimal span and transparency.\n\nThe Millau Viaduct broke several records upon completion, including the highest pylons and road bridge deck, and surpassing the Eiffel Tower as France's tallest structure. Its design features, like the A-frame column splits accommodating deck expansion, contribute to both structural integrity and visual appeal. The tapered columns minimize their visual impact on the landscape, creating a light and sleek design that harmonizes with its surroundings, effectively acting as \"environmental sculpture.\" Finally, the article provides links to other projects of the same design firm.\n",
    "chinese_title": "米约高架桥",
    "chinese_summary": "位于法国南部的米约高架桥，是建筑成功融入基础设施设计的典范。它由建筑师和结构工程师紧密合作打造而成，完成了A75高速公路中至关重要的缺失环节，提供了从巴黎到地中海的高速通道。\n\n本文强调，该桥的设计优先考虑优雅和最小的环境影响，而非单纯地庆祝河流的跨越。其斜拉索、桅杆式结构实现了最佳跨度和透明度。\n\n米约高架桥在竣工时打破了多项纪录，包括最高的桥塔和公路桥面，并超越埃菲尔铁塔成为法国最高的建筑物。其设计特点，如适应桥面膨胀的A型框架柱分裂，既保证了结构完整性，又提升了视觉吸引力。锥形柱最大限度地减少了它们对景观的视觉影响，创造了一种轻盈而流畅的设计，与周围环境和谐统一，有效地充当了“环境雕塑”。最后，本文还提供了同一设计公司的其他项目链接。"
  },
  {
    "id": "44862542",
    "title": "GPT-OSS-120B runs on just 8GB VRAM & 64GB+ system RAM",
    "url": "https://old.reddit.com/r/LocalLLaMA/comments/1mke7ef/120b_runs_awesome_on_just_8gb_vram/",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "GPT-OSS-120B仅需8GB显存和64GB+系统内存即可运行",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "44860847",
    "title": "Going faster than memcpy",
    "url": "https://squadrick.dev/journal/going-faster-than-memcpy",
    "summary": "This article details an exploration into optimizing memory copy operations beyond the standard `memcpy` for a high-performance pub-sub system called Shadesmar. Profiling revealed that `memcpy` was a significant bottleneck for large messages.\n\nThe author dissected the glibc's `memcpy` implementation (`__memmove_avx_unaligned_erms`), noting its use of `memmove` for handling overlapping memory regions, Enhanced REP MOVS (ERMS) for optimized looping, AVX vectorization for 32-byte copies, and handling of unaligned pointers.\n\nSeveral alternative memory copy methods were implemented and benchmarked: basic REP MOVSB using assembly, aligned AVX copy, stream aligned AVX copy (skipping cache), and stream aligned AVX copy with prefetching. Loop unrolling and multithreading using a custom `Copier` interface were also investigated.\n\nThe `Copier` interface in Shadesmar allows for custom memory transfer implementations, initially intended for cross-device (CPU-GPU) data transfers. An `MTCopier` adapter was created to add multithreading support to any `Copier`.\n\nThe benchmarking results showed that `std::memcpy` generally provided the best overall performance, adapting well to hardware. The streaming prefetching copy performed well for larger copies (>1MB). Unrolled AVX copies dominated for small to medium sizes. The author concluded that unless specific alignment requirements are met and performance is critical, sticking to `std::memcpy` is the best approach.\n",
    "chinese_title": "超越 memcpy 的速度",
    "chinese_summary": "本文详细探讨了对高性能发布-订阅系统Shadesmar中超越标准`memcpy`的内存复制操作的优化。性能分析表明，`memcpy`是大消息的主要瓶颈。\n\n作者剖析了glibc的`memcpy`实现 (`__memmove_avx_unaligned_erms`)，注意到其使用`memmove`处理重叠内存区域，增强型REP MOVS (ERMS) 进行优化循环，AVX向量化实现32字节复制，以及对未对齐指针的处理。\n\n实现了几种替代的内存复制方法并进行了基准测试：使用汇编的基本REP MOVSB，对齐的AVX复制，流式对齐的AVX复制（跳过缓存），以及流式对齐的AVX复制并带预取。 还研究了循环展开和使用自定义`Copier`接口进行多线程处理。\n\nShadesmar中的`Copier`接口允许自定义内存传输实现，最初旨在用于跨设备（CPU-GPU）数据传输。 创建了一个`MTCopier`适配器，以将多线程支持添加到任何`Copier`。\n\n基准测试结果表明，`std::memcpy`通常提供最佳的整体性能，能很好地适应硬件。 流式预取复制在大尺寸复制（>1MB）时表现良好。 展开的AVX复制在中小型尺寸时占据优势。 作者得出的结论是，除非满足特定的对齐要求且性能至关重要，否则坚持使用`std::memcpy`是最佳方法。"
  },
  {
    "id": "44862112",
    "title": "Hand-picked selection of articles on AI fundamentals/concepts",
    "url": "https://aman.ai/primers/ai/",
    "summary": "This article presents a curated collection of resources covering fundamental concepts in Artificial Intelligence, encompassing the entire machine learning pipeline from model building to deployment and evaluation.\n\nIt's organized into several key areas: **Algorithms/Architecture**, spanning classical ML (Linear Regression, SVMs) to advanced deep learning (GANs, Transformers, Diffusion Models); **Data/Training**, addressing data preprocessing, model initialization, training techniques (Gradient Descent, Regularization), and fine-tuning strategies; **Speech, Vision, and NLP**, detailing techniques and models specific to these modalities; **Multimodal**, focusing on Vision-Language Models; **Models**, listing various prominent AI models like BERT, GPT, CLIP, and LLaMA; **Offline/Online Evaluation**, covering metrics and A/B testing; **MLOps**, addressing data drift, tooling, and testing; **On-Device AI**, exploring model compression and privacy; **Project Planning**, including frameworks for goal setting and project management; and a **Miscellaneous** section encompassing debugging tips, mathematical foundations, and practical considerations.\n\nThe collection aims to provide comprehensive knowledge, from basic concepts to advanced techniques like parameter efficient fine-tuning and distributed training. The resource list also highlights specific tasks like Named Entity Recognition and Machine Translation, as well as relevant benchmarks. It also provides insight on topics such as detecting hallucinations and mitigating them in LLMs. Finally, the article includes valuable practical elements like interview questions and debugging advice, making it a useful guide for both learning and practical application in the field of AI.\n",
    "chinese_title": "人工智能基础概念精选文章",
    "chinese_summary": "本文精选了一系列资源，涵盖人工智能的基础概念，包括从模型构建到部署和评估的整个机器学习流程。\n\n其组织结构分为几个关键领域：**算法/架构**，涵盖从经典机器学习（线性回归、支持向量机）到高级深度学习（GAN、Transformer、扩散模型）；**数据/训练**，涉及数据预处理、模型初始化、训练技巧（梯度下降、正则化）和微调策略；**语音、视觉和自然语言处理**，详细介绍特定于这些模态的技术和模型；**多模态**，重点关注视觉-语言模型；**模型**，列出各种著名的AI模型，如BERT、GPT、CLIP和LLaMA；**离线/在线评估**，涵盖指标和A/B测试；**MLOps**，解决数据漂移、工具和测试问题；**设备端AI**，探索模型压缩和隐私；**项目规划**，包括目标设定和项目管理框架；以及一个**杂项**部分，涵盖调试技巧、数学基础和实际考虑。\n\n该系列旨在提供全面的知识，从基本概念到高级技术，如参数高效微调和分布式训练。资源列表还重点介绍了诸如命名实体识别和机器翻译等特定任务，以及相关基准。它还提供了关于检测幻觉和在大型语言模型中缓解幻觉等主题的见解。最后，本文包括有价值的实践元素，如面试问题和调试建议，使其成为学习和人工智能领域实际应用的有用指南。"
  },
  {
    "id": "44863585",
    "title": "Operation Costs in CPU Clock Cycles (2016)",
    "url": "http://ithare.com/infographics-operation-costs-in-cpu-clock-cycles/",
    "summary": "This article by \"No Bugs\" Hare provides a guide to understanding the relative costs of common CPU operations in clock cycles, aiming to prevent \"premature pessimization\" in code. The infographic presented gives ballpark figures for operation costs on modern x86/x64 CPUs (with similar patterns expected on ARM Cortex A and SPARC), acknowledging that specific timings vary based on CPU model, compiler, and program specifics.\n\nThe article covers ALU/FPU operations (register-register only), with \"simple\" operations like ADD/MOV taking less than a cycle due to parallelism. Integer multiplication/division are more expensive, with multiplication costing 1-7 cycles and division 12-44. Floating-point operations also vary in cost, with division being the most expensive. Vector operations (SSE/AVX/ARM Neon) allow for parallel processing of data.\n\nBranching (if statements) carries a cost of 1-2 cycles if the CPU predicts correctly, but a misprediction can stall the CPU for 10-20 cycles. Memory access speeds vary drastically based on cache level (L1 being fastest, RAM being slowest), emphasizing the importance of data locality. Memory writes are often less expensive than reads. Code locality is also important, and can be improved through inlining and the use of `__builtin_expect()`.\n\nThe article also discusses NUMA (Non-Uniform Memory Access) architectures, common in multi-socket servers, where accessing memory on a different socket adds significant latency (100-300 cycles). Finally, it touches on atomic operations like CAS (Compare-And-Swap), which are significantly slower than regular memory accesses due to synchronization requirements, costing around 15-30 cycles on a single core, and much more in NUMA configurations.\n",
    "chinese_title": "CPU时钟周期内的操作成本 (2016)",
    "chinese_summary": "“No Bugs” Hare 的这篇文章提供了一份指南，旨在帮助理解常见 CPU 操作在时钟周期中的相对成本，以避免代码中的“过早悲观优化”。其中提供的图表给出了现代 x86/x64 CPU 上操作成本的大致数字（预计 ARM Cortex A 和 SPARC 上也具有相似的模式），并承认具体时序因 CPU 型号、编译器和程序细节而异。\n\n文章涵盖了 ALU/FPU 操作（仅限于寄存器间），由于并行性，像 ADD/MOV 这样的“简单”操作消耗不到一个周期。整数乘法/除法成本更高，乘法花费 1-7 个周期，除法花费 12-44 个周期。浮点运算的成本也各不相同，其中除法成本最高。向量运算（SSE/AVX/ARM Neon）允许并行处理数据。\n\n分支（if 语句）如果 CPU 预测正确，则消耗 1-2 个周期，但预测错误可能会使 CPU 停顿 10-20 个周期。内存访问速度因缓存级别（L1 最快，RAM 最慢）而异，突出了数据局部性的重要性。内存写入通常比读取便宜。代码局部性也很重要，可以通过内联和使用 `__builtin_expect()` 来改善。\n\n文章还讨论了 NUMA（非一致性内存访问）架构，这种架构在多路服务器中很常见，访问不同插槽上的内存会增加显著的延迟（100-300 个周期）。最后，它提到了原子操作，如 CAS（比较并交换），由于同步要求，原子操作比常规内存访问慢得多，在单核上花费约 15-30 个周期，在 NUMA 配置中则更多。"
  },
  {
    "id": "44864419",
    "title": "Meta Leaks Part 1: Israel and Meta",
    "url": "https://archive.org/details/meta_leaks_part_1",
    "summary": "The \"Meta Leaks Part 1: Israel and Meta\" document, hosted on the Internet Archive, appears to be a leaked collection of information (likely in EPUB format among others). The metadata suggests it focuses on the relationship between Israel and the social media company Meta.\n\nKey information from the metadata includes:\n\n*   **Title:** Meta Leaks Part 1: Israel and Meta\n*   **Source:** Uploaded to Internet Archive by \"icw_nru\" on August 11, 2025.\n*   **Format:** Available in multiple formats including EPUB, PDF, and plain text (OCR).\n*   **Topics:** Categorized under \"icw\" and \"meta.\"\n*   **Ocr:** OCR (Optical Character Recognition) was performed on the document, suggesting it may have originally been a scanned document or image-based file. This means the text is searchable and copyable.\n*   **Flagging:** The document can be flagged for issues like graphic violence, hate speech, or misinformation.\n\nThe existence of the document itself suggests that information regarding the connection between Israel and Meta has been leaked. Without accessing and analyzing the contents of the document, it's impossible to elaborate on the specifics of the relationship or the nature of the leaks. The availability of multiple download options, including text-based formats, indicates that the information is accessible for further scrutiny and analysis.\n",
    "chinese_title": "Meta泄密第一部分：以色列与Meta",
    "chinese_summary": "“Meta泄露第一部分：以色列与Meta”文档，托管于互联网档案馆，似乎是一份泄露的信息集合（可能包含EPUB格式）。元数据显示，该文档主要关注以色列与社交媒体公司Meta之间的关系。\n\n元数据中的关键信息包括：\n\n*   **标题：** Meta泄露第一部分：以色列与Meta\n*   **来源：** 2025年8月11日由“icw_nru”上传至互联网档案馆。\n*   **格式：** 提供多种格式，包括EPUB、PDF和纯文本（OCR）。\n*   **主题：** 归类于“icw”和“meta”下。\n*   **OCR：** 文档进行了OCR（光学字符识别），表明其最初可能是一份扫描文档或基于图像的文件。这意味着文本可搜索和复制。\n*   **标记：** 该文档可以被标记为存在诸如图形暴力、仇恨言论或虚假信息等问题。\n\n该文档本身的存在表明，有关以色列与Meta之间联系的信息已被泄露。在未访问和分析文档内容的情况下，无法详细说明该关系的具体细节或泄露的性质。提供包括基于文本格式在内的多种下载选项，表明该信息可供进一步审查和分析。"
  },
  {
    "id": "44858892",
    "title": "Compiling a Lisp: Lambda lifting",
    "url": "https://bernsteinbear.com/blog/compiling-a-lisp-12/",
    "summary": "Max Bernstein's blog post discusses his journey through the Ghuloum tutorial on compiling a Lisp, specifically focusing on closure conversion (initially misidentified as lambda lifting). He rewrites the compiler in Python for clarity, omitting the S-expression reader and instruction encoding.\n\nThe core of the post details the implementation of closure conversion, a process that transforms lambdas by:\n\n1.  Tracking bound and free variables.\n2.  Allocating code objects for lambdas.\n3.  Capturing the outside environment (free variables) within the closure.\n\nThe `LambdaConverter` class manages this, maintaining a dictionary of labels and recursively traversing the program's abstract syntax tree. `convert` method handles different expression types (constants, variables, `if` statements, `lambda` expressions, and `let` expressions), updating bound and free variable sets as needed.  `lambda` expressions are transformed into `closure` forms, referencing code objects and listing their free variables. `let` expressions require careful handling of binding scope. Function calls are also converted to \"funcall\" operations except for built-in primitives.\n\nThe article then shifts to compiling the `closure` and `funcall` forms into assembly. Compiling closures involves allocating space on the heap for the code pointer and free variables, tagging the closure, and bumping the heap pointer. Compiling `funcall` requires saving space on the stack, compiling arguments, adjusting the stack pointer, performing the call through the closure pointer, and restoring the stack. The assembly code uses inline comments for clarity. He highlights the challenges of stack adjustment calculations and closure tagging/untagging.\n",
    "chinese_title": "编译Lisp：Lambda提升",
    "chinese_summary": "Max Bernstein的博文讲述了他学习Ghuloum Lisp编译器教程的经历，特别关注闭包转换（最初误认为是Lambda提升）。为了清晰起见，他用Python重写了编译器，省略了S表达式读取器和指令编码。\n\n博文的核心详细介绍了闭包转换的实现，这是一个通过以下方式转换lambda的过程：\n\n1. 跟踪绑定变量和自由变量。\n2. 为lambda分配代码对象。\n3. 在闭包中捕获外部环境（自由变量）。\n\n`LambdaConverter`类管理这一点，维护一个标签字典并递归地遍历程序的抽象语法树。`convert`方法处理不同的表达式类型（常量、变量、`if`语句、`lambda`表达式和`let`表达式），并根据需要更新绑定变量和自由变量集。`lambda`表达式被转换为`closure`形式，引用代码对象并列出它们的自由变量。`let`表达式需要小心处理绑定作用域。函数调用也被转换为“funcall”操作，但内置的原始函数除外。\n\n文章随后转向将`closure`和`funcall`形式编译为汇编代码。编译闭包涉及在堆上为代码指针和自由变量分配空间，标记闭包，并增加堆指针。编译`funcall`需要保存栈上的空间，编译参数，调整栈指针，通过闭包指针执行调用，并恢复栈。汇编代码使用内联注释以提高清晰度。他强调了栈调整计算以及闭包标记/取消标记的挑战。"
  },
  {
    "id": "44865655",
    "title": "Beloved by bands and bank robbers, the Ford Transit turns 60",
    "url": "https://www.bbc.com/news/articles/c0j97xegz5no",
    "summary": "The Ford Transit, a ubiquitous van beloved by tradespeople, bands, and even bank robbers, is celebrating its 60th anniversary. Introduced in 1965, it revolutionized the van market with its spaciousness, power, and practicality, quickly becoming a staple for businesses and a symbol of freedom for touring bands like Led Zeppelin and The Damned.\n\nThe Transit's versatility and speed also attracted criminal elements, earning it the tongue-in-cheek title of \"Britain's most wanted van\" in the 1970s. While originally manufactured in the UK, production shifted to Turkey in 2013 to reduce costs, a move that sparked controversy. Despite this, Ford emphasizes the Transit's British heritage, highlighting ongoing engineering, design, and engine production in the UK.\n\nToday, Ford is focused on the future of the Transit, particularly electric models and software integration to improve efficiency and reduce running costs. The company believes the core needs of van users remain the same - reliability, versatility, and affordability - but the means of achieving them are evolving. However, increasing competition in the van market poses a challenge to the Transit's dominance, potentially weakening brand loyalty that was once a key factor in its success.\n",
    "chinese_title": "乐队和银行劫匪都爱它，福特全顺迎来60周年",
    "chinese_summary": "福特全顺：广受欢迎的厢型车迎来60周年\n\n深受工匠、乐队甚至银行劫匪喜爱的福特全顺厢型车迎来60周年纪念。自1965年问世以来，它以其宽敞的空间、强大的动力和实用性彻底改变了厢型车市场，迅速成为企业的必备品，也是齐柏林飞艇乐队和诅咒乐队等巡演乐队的自由象征。\n\n全顺的多功能性和速度也吸引了犯罪分子，在20世纪70年代为它赢得了“英国最受通缉的厢型车”这一略带戏谑的称号。虽然最初在英国生产，但为了降低成本，2013年生产转移到土耳其，这一举动引发了争议。尽管如此，福特强调全顺的英国血统，突出其在英国持续进行的工程、设计和发动机生产。\n\n如今，福特专注于全顺的未来，特别是电动车型和软件集成，以提高效率并降低运营成本。该公司认为，厢型车用户的核心需求保持不变——可靠性、多功能性和可负担性——但实现这些目标的手段正在不断发展。然而，厢型车市场日益激烈的竞争对全顺的统治地位构成了挑战，可能会削弱曾经是其成功的关键因素的品牌忠诚度。"
  },
  {
    "id": "44860908",
    "title": "Generic Containers in C: Safe Division Using Maybe",
    "url": "https://uecker.codeberg.page/2025-08-10.html",
    "summary": "This article explores the implementation of a \"Maybe\" type in C for handling potential errors in computations, specifically focusing on safe integer division. Inspired by Haskell's Maybe, this approach uses a struct with a boolean `ok` flag and a value, indicating whether a computation was successful. Macros are defined for creating \"Just\" (successful) and \"Nothing\" (error) Maybe instances.\n\nThe article highlights the importance of error checking beyond simple division by zero, pointing out the undefined behavior in C when dividing `INT_MIN` by -1. An initial, flawed attempt at a \"safe_divide\" function is presented, and its assembly code is analyzed using GCC's signed integer overflow sanitizer. The sanitizer reveals a hidden code path leading to a trap instruction, demonstrating the function's incompleteness.\n\nAfter correcting the error check to account for the `INT_MIN` case, the resulting assembly code no longer triggers the sanitizer, proving that the `safe_divide` function is now indeed safe from integer overflow and division by zero, at least as determined statically by the compiler and its sanitizers.\n\nThe author suggests that this approach, while limited, can be a useful tool for ensuring the safety of specific parts of C code, particularly when combined with other techniques like using VLAs and variably modified types for bounds checking. The article concludes by inviting readers to explore an experimental library and share ideas for improving the approach.\n",
    "chinese_title": "C 语言中的泛型容器：使用 Maybe 实现安全除法",
    "chinese_summary": "在C语言中实现“Maybe”类型以处理潜在计算错误，特别是安全整数除法的探索。受Haskell的Maybe启发，该方法使用一个包含布尔`ok`标志和值的结构体，指示计算是否成功。定义了用于创建“Just”（成功）和“Nothing”（错误）Maybe实例的宏。\n\n本文强调了错误检查的重要性，不仅仅是简单的除以零，还指出了在C语言中用`INT_MIN`除以-1时的未定义行为。文章展示了一个最初有缺陷的“safe_divide”函数，并使用GCC的带符号整数溢出清理器分析了其汇编代码。清理器揭示了一条导致陷阱指令的隐藏代码路径，表明该函数不完整。\n\n在修正了错误检查以考虑`INT_MIN`的情况后，生成的汇编代码不再触发清理器，证明了`safe_divide`函数现在确实能够避免整数溢出和除以零的错误，至少由编译器及其清理器静态确定。\n\n作者认为，虽然这种方法有限，但它可以成为确保C代码特定部分安全性的有用工具，特别是与使用VLA和可变修改类型进行边界检查等其他技术结合使用时。文章最后邀请读者探索一个实验性库，并分享改进该方法的想法。"
  },
  {
    "id": "44865140",
    "title": "Ford Aims for Revolution with $30k Electric Truck",
    "url": "https://www.thedrive.com/news/ford-aims-for-revolution-with-30000-electric-truck",
    "summary": "Ford is planning to launch an affordable, mid-sized electric truck in 2027, targeting a starting price of around $30,000. This truck, similar in footprint to the Ford Maverick but with more interior space comparable to a Toyota RAV4, won't replace the Maverick and is intended to have BlueCruise capability. Ford aims to achieve a 0-60 mph time similar to an EcoBoost Mustang (4.5 seconds). Production will take place at the Louisville Assembly Plant in Kentucky, utilizing advanced manufacturing techniques.\n\nThe truck will be built on a new \"Universal EV Platform\" with a 400-volt architecture and lithium-iron phosphate batteries from Ford's BlueOval Battery Park. Ford intends to offer over-the-air software updates for continuous improvements. A key feature mentioned is potential for a Chevy Avalanche-style cargo pass-through between the cab and bed.\n\nFord's vision extends beyond this truck, with the Universal EV Platform designed to underpin a variety of vehicles, from small cars to three-row SUVs. The \"Universal EV Production System\" will assemble vehicles in three separate sections (front, rear, and battery/structural) before final assembly, enabling efficient production of different vehicle types on the same platform. This approach aims to reduce parts, fasteners, workstations, and assembly time, ultimately driving down costs. Ford claims the cost of owning this EV will be lower than a three-year-old Tesla Model Y.\n",
    "chinese_title": "福特计划推出三万美元电动卡车，力求变革",
    "chinese_summary": "福特计划于2027年推出一款价格亲民的中型电动卡车，目标起售价约为3万美元。这款卡车在尺寸上与福特 Maverick 相似，但内部空间更大，堪比丰田 RAV4。它不会取代 Maverick，并计划具备 BlueCruise 功能。 福特的目标是使其0-60英里/小时的加速时间与 EcoBoost Mustang 相似（4.5 秒）。 生产将在肯塔基州路易斯维尔组装厂进行，采用先进的制造技术。\n\n该卡车将基于新的“通用电动汽车平台”构建，采用 400 伏架构和来自福特 BlueOval 电池园的磷酸铁锂电池。 福特计划提供无线软件更新，以实现持续改进。 提到的一个关键特性是，可能在驾驶室和货箱之间设置类似于雪佛兰 Avalanche 风格的货物通道。\n\n福特的愿景超越了这款卡车，通用电动汽车平台旨在支撑各种车辆，从小型汽车到三排 SUV。 “通用电动汽车生产系统”将在最终组装之前，将车辆组装成三个独立的部分（前部、后部和电池/结构），从而可以在同一平台上高效生产不同类型的车辆。 这种方法旨在减少零件、紧固件、工作站和组装时间，最终降低成本。 福特声称这款电动汽车的拥有成本将低于一辆车龄三年的特斯拉 Model Y。"
  },
  {
    "id": "44863323",
    "title": "Show HN: 1 Million Rows",
    "url": "https://1mrows.pages.dev",
    "summary": "This \"Show HN\" post introduces \"1 Million Rows,\" a lightning-fast management tool designed for handling large datasets. The primary focus is on its ability to efficiently manage and display 1 million rows of data, a demo of which is available.\n\nThe post highlights various use cases for the tool, ranging from common project management and sales funnel tracking to more specific applications like employee onboarding, market research, and even social media management. It positions \"1 Million Rows\" as a versatile solution adaptable to different business needs.\n\nA detailed roadmap outlines planned features across three phases. Phase 1 focuses on core functionalities like customizable lists/tables, role-based access, real-time updates, status tracking, filtering, and audit trails. Phase 2 introduces features like notification systems, reminders, discussion spaces, Kanban views, time tracking, dependency tracking, Markdown document creation, and file attachments. Phase 3 aims to add AI features, mobile apps, collaborative editing, dashboards, integrations, a plugin platform, Excel imports, computed columns, and scheduled reports.\n\nThe post actively encourages user feedback and participation in shaping the tool's development. It emphasizes the importance of user suggestions and invites users to connect for discussions and further refinement of the platform. Ultimately, it aims to create a powerful and user-driven data management tool capable of handling vast amounts of information.\n",
    "chinese_title": "展示HN：一百万行",
    "chinese_summary": "此\"Show HN\"帖子介绍\"1 Million Rows\"，一款专为处理大型数据集而设计的闪电般快速的管理工具。其主要焦点在于高效管理和显示一百万行数据的能力，并提供了一个演示。\n\n该帖子重点介绍了该工具的各种用例，从常见的项目管理和销售漏斗跟踪，到更具体的应用，如员工入职、市场调研，甚至社交媒体管理。它将\"1 Million Rows\"定位为一种适用于不同业务需求的多功能解决方案。\n\n一份详细的路线图概述了跨三个阶段的计划功能。第一阶段侧重于核心功能，如可定制的列表/表格、基于角色的访问、实时更新、状态跟踪、筛选和审计跟踪。第二阶段引入了诸如通知系统、提醒、讨论空间、看板视图、时间跟踪、依赖关系跟踪、Markdown文档创建和文件附件等功能。第三阶段旨在增加人工智能功能、移动应用程序、协作编辑、仪表板、集成、插件平台、Excel导入、计算列和计划报告。\n\n该帖子积极鼓励用户反馈和参与，以塑造该工具的开发。它强调用户建议的重要性，并邀请用户联系进行讨论和进一步完善平台。最终，其目标是创建一个强大且用户驱动的数据管理工具，能够处理大量信息。"
  },
  {
    "id": "44826208",
    "title": "Optimizing My Disk Usage Program",
    "url": "https://healeycodes.com/optimizing-my-disk-usage-program",
    "summary": "This article details performance optimizations made to `dumac`, a fast disk usage program for macOS. Building upon a previous version that utilized `getattrlistbulk` for speed, the author addressed feedback regarding thread scheduling overhead and inode lock contention.\n\nThe initial version used Tokio, spawning many threads for each directory processed, leading to unnecessary overhead and inter-thread communication. Switching to Rayon's work-stealing thread pool eliminated this, reusing threads and reducing syscalls, resulting in a ~28% performance improvement. Instruments confirmed fewer threads and context switches.\n\nFurther optimization targeted the sharded hash-set used for deduplicating inodes (hard links). The initial sharding logic (`inode % SHARD_COUNT`) caused lock contention due to the sequential nature of inode allocation within directories. By shifting the inode value (`inode >> 8`) before modulo, the author grouped consecutive inodes into the same shard, significantly reducing lock collisions (from an average of 176.66 to 4.66 observed lock collisions). This improved temporal locality and minimized inter-shard contention. While various hash functions were tested, this simple bit-shifting approach yielded comparable performance. The author chose shifting by 8 based on the assumption that most directories contain fewer than 256 files. This inode sharding refinement resulted in an additional ~5% performance gain.\n",
    "chinese_title": "优化我的磁盘使用程序",
    "chinese_summary": "本文详细介绍了对 macOS 上的快速磁盘使用程序 `dumac` 所做的性能优化。 该程序之前的版本使用 `getattrlistbulk` 来提高速度，作者在本文中针对线程调度开销和 inode 锁竞争方面的反馈进行了改进。\n\n最初的版本使用了 Tokio，为每个处理的目录生成许多线程，导致不必要的开销和线程间通信。 切换到 Rayon 的工作窃取线程池消除了这个问题，复用了线程并减少了系统调用，从而带来了约 28% 的性能提升。 Instruments 确认了更少的线程和上下文切换。\n\n进一步的优化针对用于对 inode（硬链接）进行重复数据删除的分片哈希集。 最初的分片逻辑 (`inode % SHARD_COUNT`) 由于目录内 inode 分配的顺序性而导致了锁竞争。 通过在取模之前移动 inode 值 (`inode >> 8`)，作者将连续的 inode 分组到同一个分片中，从而显着减少了锁冲突（观察到的锁冲突从平均 176.66 次减少到 4.66 次）。 这提高了时间局部性并最大限度地减少了分片间的竞争。 虽然测试了各种哈希函数，但这种简单的位移方法产生了相当的性能。 作者选择移动 8 位，基于大多数目录包含少于 256 个文件的假设。 这种 inode 分片改进带来了额外的约 5% 的性能提升。"
  },
  {
    "id": "44858645",
    "title": "Flowers of Fealty: Commemoration of the Christening of Elisabeth of Hesse (1598)",
    "url": "https://publicdomainreview.org/collection/christening-of-lady-elisabeth-of-hesse/",
    "summary": "The \"Flowers of Fealty: Commemoration of the Christening of Elisabeth of Hesse (1598)\" article, based on materials held by the Bayerische Staatsbibliothek, likely focuses on the historical significance and visual record of the christening ceremony of Elisabeth of Hesse in 1598. The core subject is the analysis of the celebratory book or commemorative material produced for the occasion.\n\nIt probably examines the symbolism and allegorical meaning conveyed through the artwork and text accompanying the event. The \"Flowers of Fealty\" title suggests a thematic connection between the flowers depicted and the loyalty owed to Elisabeth and her family.\n\nThe article likely explores the political and social context surrounding the christening, highlighting its importance as a symbolic event solidifying family alliances and demonstrating the power and prestige of the Hessian ruling house. It would analyze the specific content of the commemorative book, detailing who commissioned it, who contributed to it (artists, writers), and for whom it was intended.\n\nUltimately, the article aims to provide insights into how such christenings were celebrated and documented in the late 16th century, contributing to a broader understanding of courtly life, religious practices, and artistic patronage during the period. The focus on the Bayerische Staatsbibliothek's collection indicates that the article relies heavily on the primary source material held within that library, offering a unique and informed perspective.\n",
    "chinese_title": "忠诚之花：纪念黑森的伊丽莎白受洗 (1598)",
    "chinese_summary": "《忠诚之花：黑森的伊丽莎白洗礼纪念（1598）》一文，基于巴伐利亚州立图书馆所藏资料，可能着重于1598年黑森的伊丽莎白洗礼仪式的历史意义和视觉记录。其核心主题是对为该场合制作的庆典书籍或纪念材料的分析。\n\n该文可能探讨了通过伴随该事件的艺术品和文本所传达的象征意义和寓言含义。“忠诚之花”的标题表明了所描绘的花朵与对伊丽莎白及其家族应尽的忠诚之间的主题联系。\n\n该文很可能探讨了洗礼仪式周围的政治和社会背景，强调其作为巩固家族联盟和展示黑森统治家族权力与声望的象征性事件的重要性。它将分析纪念册的具体内容，详细说明是谁委托制作的，谁为此做出了贡献（艺术家、作家），以及它的预期读者。\n\n最终，该文旨在深入了解16世纪末此类洗礼是如何庆祝和记录的，从而有助于更广泛地理解当时的宫廷生活、宗教习俗和艺术赞助。对巴伐利亚州立图书馆藏品的关注表明，该文严重依赖于该图书馆内所藏的原始资料，提供了独特而知情的视角。"
  },
  {
    "id": "44821848",
    "title": "Lists and Lists: Basics of Lisp through interactive fiction (1996)",
    "url": "https://eblong.com/zarf/zweb/lists/",
    "summary": "The webpage snippet describes \"Lists and Lists: Basics of Lisp through interactive fiction,\" a 1996 interactive fiction game designed to teach fundamental concepts of the Lisp programming language. The game is likely presented within a web browser using Parchment, a Javascript-based interpreter for interactive fiction. The title hints at a core focus on lists, a fundamental data structure in Lisp. The introductory text also provides links related to general interactive fiction information, such as \"How to play IF\" and a link back to \"Zarf's IF,\" suggesting Zarf is the creator or a significant figure in the interactive fiction community. The game itself requires Javascript to function, indicating that it's designed to be run within a web browser. In essence, \"Lists and Lists\" aims to make learning Lisp more engaging by framing it within the interactive fiction genre.\n",
    "chinese_title": "列表与列表：通过互动小说学习Lisp基础 (1996)",
    "chinese_summary": "该网页片段描述了1996年的互动小说游戏《Lists and Lists: Basics of Lisp through interactive fiction》，该游戏旨在教授Lisp编程语言的基本概念。该游戏很可能使用Parchment（一个基于Javascript的互动小说解释器）在网络浏览器中呈现。标题暗示了其核心关注点在于列表，这是Lisp中的一种基本数据结构。介绍性文字还提供了与一般互动小说信息相关的链接，例如“如何玩IF”以及指向“Zarf's IF”的链接，表明Zarf是创作者或是互动小说社区中的重要人物。游戏本身需要Javascript才能运行，表明它是设计为在网络浏览器中运行的。“Lists and Lists”本质上旨在通过将其置于互动小说类型中，使学习Lisp更具吸引力。"
  },
  {
    "id": "44866208",
    "title": "Wikipedia loses challenge against Online Safety Act verification rules",
    "url": "https://www.bbc.com/news/articles/cjr11qqvvwlo",
    "summary": "Wikipedia's parent organization, the Wikimedia Foundation, has lost its legal challenge against the UK's Online Safety Act rules that could force the online encyclopedia to verify the identities of its users. The Foundation argued that the regulations, designed for large social media platforms, are too broad and could inadvertently apply to Wikipedia, threatening the privacy and safety of its volunteer editors.\n\nSpecifically, the Wikimedia Foundation feared being classified as \"Category 1\" under the Act, which would necessitate user verification or require them to significantly restrict UK access or disable key features. The government maintained it had considered and reasonably rejected exempting Wikipedia.\n\nWhile the court rejected Wikimedia's arguments in this judicial review, the Foundation emphasizes that the ruling also acknowledged the responsibility of Ofcom and the UK government to protect Wikipedia. The judgment also allows for potential future legal challenges should Ofcom classify Wikipedia as Category 1 or if the regulations prevent Wikipedia from operating. Legal experts suggest the door remains open for Wikipedia to be exempt from the strictest rules upon review. Ofcom acknowledges the court's judgment and will continue its work related to categorizing services under the Online Safety Act.\n",
    "chinese_title": "维基百科败诉，未能推翻《网络安全法案》验证规则",
    "chinese_summary": "维基百科的母公司维基媒体基金会针对英国《网络安全法案》规则发起的法律挑战失败，该规则可能迫使这家在线百科全书验证其用户的身份。基金会认为，这些为大型社交媒体平台设计的法规过于宽泛，可能会无意中适用于维基百科，从而威胁到其志愿者编辑的隐私和安全。\n\n具体而言，维基媒体基金会担心根据该法案被归类为“第一类”，这将需要用户验证，或要求他们大幅限制英国境内的访问或禁用关键功能。政府坚称，它已经考虑过并且合理地拒绝了豁免维基百科。\n\n虽然法院在此次司法审查中驳回了维基媒体的论点，但基金会强调，裁决也承认了英国通信管理局(Ofcom)和英国政府保护维基百科的责任。该判决还允许未来可能提出的法律挑战，如果英国通信管理局将维基百科归类为第一类，或者如果这些法规妨碍维基百科的运营。法律专家认为，在审查后，维基百科仍有可能免受最严格规则的约束。英国通信管理局承认法院的判决，并将继续其与根据《网络安全法案》对服务进行分类相关的工作。"
  },
  {
    "id": "44865731",
    "title": "Ford reveals breakthrough process for lower priced EVs",
    "url": "https://www.theverge.com/ford-motor-company/757243/ford-ev-truck-breakthrough-model-t",
    "summary": "Ford is betting on a new \"universal\" vehicle platform and manufacturing process to produce lower-priced EVs, aiming for a \"Model T moment\" in the electric vehicle market. The company plans to build a family of low-cost EVs, starting with a $30,000 mid-sized pickup truck in 2027 at its Kentucky assembly plant. Ford expects to lose over $5 billion on EVs and software this year, highlighting the urgency of this initiative.\n\nThe new platform will be scalable for various vehicle types and feature software-defined systems with over-the-air updates. It will use more affordable and durable lithium iron phosphate (LFP) batteries. The manufacturing process will shift from a traditional assembly line to an \"assembly tree\" with multiple simultaneous lines converging. This new process involves 20% fewer parts, 25% fewer fasteners, and 40% fewer workstations, resulting in a 15% faster assembly time. Ford estimates lower ownership costs compared to a three-year-old Tesla Model Y.\n\nThe \"universal\" platform is the result of a three-year \"skunkworks\" project in Silicon Valley. It promises a simpler wiring network and reduced battery costs by adopting cheaper LFP batteries. The battery will be a structural component serving as the vehicle's floor, enhancing handling and interior space. The new truck is promised to have more passenger space than a Toyota RAV4 and a bed large enough for a surfboard.\n\nThe \"assembly tree\" manufacturing method involves three sub-assemblies running simultaneously, replacing numerous smaller parts with a single aluminum unicasting. The process also aims to improve worker ergonomics through automation and kit-based workstations. While requiring a $2 billion investment in the Kentucky plant, the new process will require fewer workers, potentially leading to buyouts or transfers but no anticipated layoffs. The concept of cheaper EVs is critical to Ford's future, especially with slowing demand and challenges in making EV investments profitable.\n",
    "chinese_title": "福特发布降低电动汽车价格的突破性工艺",
    "chinese_summary": "福特押宝全新“通用”汽车平台和制造工艺，以生产价格更低的电动汽车，旨在电动汽车市场实现“T型车时刻”。该公司计划打造一系列低成本电动汽车，从2027年在其肯塔基州组装厂生产的3万美元中型皮卡开始。福特预计今年在电动汽车和软件方面的亏损将超过50亿美元，凸显了这项举措的紧迫性。\n\n新平台将可扩展，适用于各种车型，并配备支持空中更新的软件定义系统。它将使用更经济耐用的磷酸铁锂（LFP）电池。制造过程将从传统的装配线转变为具有多条同时汇聚的生产线的“装配树”。这个新过程减少了20%的零件、25%的紧固件和40%的工作站，从而使组装时间缩短了15%。福特预计拥有成本将低于一辆三年车龄的特斯拉Model Y。\n\n该“通用”平台是硅谷一个为期三年的“臭鼬工厂”项目的成果。它承诺采用更简单的布线网络，并通过采用更便宜的磷酸铁锂电池来降低电池成本。电池将作为结构部件，充当车辆的地板，从而增强操控性和内部空间。新款卡车有望拥有比丰田RAV4更大的乘客空间以及一个足以容纳冲浪板的货箱。\n\n“装配树”制造方法涉及三个子装配同时运行，用单个铝铸件取代许多较小的零件。该过程还旨在通过自动化和基于工具包的工作站来改善工人的工作效率。虽然需要在肯塔基州工厂投资20亿美元，但新流程将需要更少的工人，可能会导致买断或调动，但预计不会裁员。廉价电动汽车的概念对于福特的未来至关重要，尤其是在需求放缓以及使电动汽车投资盈利面临挑战的情况下。"
  },
  {
    "id": "44858067",
    "title": "One Million Screenshots",
    "url": "https://onemillionscreenshots.com/?q=random",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "一百万张截图",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "44861780",
    "title": "Self-Guaranteeing Promises",
    "url": "https://stephango.com/self-guarantee",
    "summary": "This article introduces the concept of \"self-guaranteeing promises,\" which are commitments that are verifiable and irreversible, requiring no trust in a third party. The author contrasts these with typical promises, like terms of service or corporate structures, which can be changed or reversed.\n\nKey examples are provided: \"file-over-app\" functionality, where you can directly use your files in other applications without exporting, and \"stainless steel,\" where its resistance to water is an inherent, testable quality. These contrast with unenforceable promises made by companies regarding data privacy or governance, which are subject to change and outside your control.\n\nThe article argues that even open source doesn't guarantee freedom, as data can still be locked in proprietary formats. While acknowledging the inherent ambiguity of any tool's future due to technological changes, business failures, or evolving needs, the author advocates for choosing tools that make self-guaranteeing promises. By selecting tools with inherent, testable qualities that ensure continued accessibility and control, users can mitigate the risks associated with relying solely on promises that can be broken.\n",
    "chinese_title": "自我担保承诺",
    "chinese_summary": "本文介绍了“自我担保承诺”的概念，即无需信任第三方、可验证且不可逆转的承诺。作者将其与典型的承诺（如服务条款或公司结构）进行对比，后者可以被更改或撤销。\n\n文中提供了关键示例：“文件覆盖应用”功能，您无需导出即可在其他应用程序中直接使用文件；以及“不锈钢”，其耐水性是一种内在的、可测试的品质。这些与公司在数据隐私或治理方面做出的不可执行的承诺形成对比，因为这些承诺可能会发生变化且超出您的控制范围。\n\n文章认为，即使是开源也不能保证自由，因为数据仍然可能被锁定在专有格式中。虽然承认任何工具的未来都存在固有的不确定性，因为技术变革、业务失败或不断变化的需求，但作者提倡选择做出自我担保承诺的工具。通过选择具有内在的、可测试的品质的工具，以确保持续的可访问性和控制权，用户可以降低仅仅依赖于可能被打破的承诺所带来的风险。"
  },
  {
    "id": "44860832",
    "title": "Graham: Synchronizing Clocks by Leveraging Local Clock Properties (2022) [pdf]",
    "url": "https://www.usenix.org/system/files/nsdi22-paper-najafi_1.pdf",
    "summary": "This research paper, \"Graham: Synchronizing Clocks by Leveraging Local Clock Properties (2022),\" explores a novel approach to clock synchronization. It focuses on utilizing properties of local clocks within a system to achieve accurate and efficient synchronization, as opposed to relying solely on external time sources.\n\nThe central idea is that individual clocks, despite potential inaccuracies or drifts, possess certain predictable characteristics. By modeling and analyzing these local behaviors, the system can compensate for errors and improve synchronization. The Graham method likely involves algorithms that take into account factors such as clock drift rate, stability, and historical performance.\n\nThe paper likely delves into the details of the proposed synchronization algorithm, outlining how it collects and processes local clock data. It potentially describes the mathematical models used to represent clock behavior and how these models are applied to correct timing discrepancies. The document probably analyzes the method's performance in terms of accuracy, resilience to clock failures, and communication overhead. Evaluation metrics likely include synchronization error bounds, convergence time, and message complexity.\n",
    "chinese_title": "格雷厄姆：利用本地时钟属性同步时钟 (2022) [pdf]",
    "chinese_summary": "本研究论文《Graham：利用本地时钟属性进行时钟同步（2022）》探索了一种新颖的时钟同步方法。它侧重于利用系统内本地时钟的属性来实现准确高效的同步，而不是仅仅依赖外部时间源。\n\n其核心思想是，尽管单个时钟可能存在不准确或漂移，但它们具有某些可预测的特性。通过建模和分析这些本地行为，系统可以补偿误差并改善同步。Graham 方法可能涉及考虑时钟漂移率、稳定性以及历史性能等因素的算法。\n\n该论文可能深入探讨了所提出的同步算法的细节，概述了其如何收集和处理本地时钟数据。它可能描述了用于表示时钟行为的数学模型，以及如何应用这些模型来纠正时间差异。该文档可能分析了该方法在准确性、对时钟故障的弹性以及通信开销方面的性能。评估指标可能包括同步误差界限、收敛时间和消息复杂度。"
  },
  {
    "id": "44833607",
    "title": "The enduring puzzle of static electricity",
    "url": "https://pubs.aip.org/physicstoday/article/78/8/54/3355922/The-enduring-puzzle-of-static-electricityEven",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "静电之谜",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "44855079",
    "title": "Try and",
    "url": "https://ygdp.yale.edu/phenomena/try-and",
    "summary": "This article explores the linguistic phenomenon of \"try and\" followed by a bare verb form, a construction where \"and\" replaces the more standard \"to\" infinitive (e.g., \"try and eat\" instead of \"try to eat\"). While often considered prescriptively incorrect, this usage is common in both British and American English, with origins dating back to the late 1500s.\n\nThe article highlights that \"try and\" doesn't behave like typical coordination. Evidence for this includes: the allowance of question word movement from the second verb phrase (unlike true coordination), the inability to reorder the verbs, the impossibility of using \"both\" before \"try and,\" and the \"bare form condition,\" requiring both \"try\" and the following verb to be uninflected (though this condition varies dialectally). Furthermore, \"try\" cannot be separated from \"and\" by adverbs or negation, and ellipsis of the verb phrase is not allowed.\n\nThe article provides evidence of dialectal variation: while the bare form condition is generally upheld, some dialects allow for parallel inflected forms of both verbs, while others permit inflections only on \"try\".\n\nFinally, the text discusses other instances of pseudo-coordination, like \"be sure and,\" \"mind and,\" and the use of \"and\" with motion verbs like \"come and\" and \"go and,\" noting that motion verb pseudo-coordination differs syntactically and semantically from \"try and.\" For example, go and typically entails that the event it describes has been completed.\n",
    "chinese_title": "试试看",
    "chinese_summary": "本文探讨了“try and”后接原形动词的语言现象，这种结构中“and”取代了更标准的“to”不定式（例如，“try and eat”代替“try to eat”）。虽然通常被认为是规范上不正确的用法，但这种用法在英国和美国英语中都很常见，其起源可以追溯到16世纪末。\n\n本文强调“try and”的行为不像典型的并列连词。 证据包括：允许疑问词从第二个动词短语中移位（与真正的并列连词不同），无法重新排序动词，无法在“try and”之前使用“both”，以及“原形形式条件”，要求“try”和后面的动词都不能屈折变化（尽管此条件因方言而异）。此外，“try”不能被副词或否定词与“and”分开，并且不允许动词短语的省略。\n\n本文提供了方言差异的证据：虽然原形形式条件通常得到维持，但一些方言允许两个动词的平行屈折形式，而另一些方言只允许“try”上的屈折变化。\n\n最后，本文讨论了其他伪并列结构，如“be sure and”、“mind and”，以及“and”与运动动词（如“come and”和“go and”）的用法，并指出运动动词的伪并列在句法和语义上与“try and”不同。 例如，“go and”通常意味着它所描述的事件已经完成。"
  },
  {
    "id": "44858154",
    "title": "1910: The year the modern world lost its mind",
    "url": "https://www.derekthompson.org/p/1910-the-year-the-modern-world-lost",
    "summary": "Derek Thompson's article, \"1910: The Year the Modern World Lost Its Mind,\" explores the parallels between the early 20th century and the 21st century regarding technological change, societal anxiety, and the human condition. He draws heavily from Philipp Blom's \"The Vertigo Years,\" focusing on the year 1910 as a turning point.\n\nThe article highlights how rapid advancements in transportation (cars, airplanes, bicycles) led to widespread anxiety and a feeling that the world was spinning out of control. This \"speed\" was perceived as unnatural, particularly for women who embraced newfound freedom through cycling, sparking moral panic. This era also saw a surge in \"American Nervousness\" (neurasthenia), primarily affecting white-collar workers overwhelmed by technology and the accelerating pace of life. Mental hospital admissions skyrocketed during this period.\n\nThe article also delves into how this societal upheaval influenced art. Artists like Stravinsky (The Rite of Spring), Kandinsky (abstract art), and Picasso (primitivism) reacted against modernity by drawing inspiration from pre-modern styles and themes. They sought to capture something ancient and genuine about humanity amidst the novelty and alienation of the modern age. The rise of abstract art coincided with the popularization of photography, which diminished the value of purely representational art.\n\nFinally, Thompson touches upon the intellectual climate of 1910, highlighting the work of Max Weber and Sigmund Freud, whose theories grappled with the shifting understanding of human nature in the face of rapid societal changes.\n",
    "chinese_title": "1910年：现代世界精神失常之年",
    "chinese_summary": "德里克·汤普森的文章《1910：现代世界失去理智之年》探讨了20世纪初和21世纪在技术变革、社会焦虑和人类境况方面的相似之处。他大量借鉴了菲利普·布洛姆的《眩晕年代》，重点关注1910年这个转折点。\n\n文章强调，交通运输（汽车、飞机、自行车）的快速发展如何导致了普遍的焦虑和一种世界失控的感觉。这种“速度”被认为是不自然的，特别是对于那些通过骑自行车拥抱新自由的女性来说，引发了道德恐慌。这个时代还出现了“美国神经症”（神经衰弱）的激增，主要影响了被技术和加速的生活节奏压垮的白领工人。在此期间，精神病院的入院人数激增。\n\n文章还深入探讨了这种社会动荡如何影响艺术。斯特拉文斯基（《春之祭》）、康定斯基（抽象艺术）和毕加索（原始主义）等艺术家通过从前现代风格和主题中汲取灵感来对抗现代性。他们试图在现代的新奇和异化中捕捉到关于人类的古老而真实的东西。抽象艺术的兴起恰逢摄影的普及，这降低了纯粹具象艺术的价值。\n\n最后，汤普森谈到了1910年的知识氛围，重点介绍了马克斯·韦伯和西格蒙德·弗洛伊德的作品，他们的理论致力于应对在快速社会变革面前对人性的转变理解。"
  },
  {
    "id": "44833899",
    "title": "Fitzgerald's Follies",
    "url": "https://libertiesjournal.com/articles/fitzgeralds-follies/",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "菲茨杰拉德的闹剧",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "44855690",
    "title": "GPT-OSS vs. Qwen3 and a detailed look how things evolved since GPT-2",
    "url": "https://magazine.sebastianraschka.com/p/from-gpt-2-to-gpt-oss-analyzing-the",
    "summary": "This article by Sebastian Raschka analyzes OpenAI's new open-weight LLMs, gpt-oss-20b and gpt-oss-120b, comparing them to GPT-2 and other modern architectures like Qwen3. It highlights architectural advancements made since GPT-2, focusing on aspects like removing dropout, replacing absolute positional embeddings with RoPE, switching from GELU to Swish/SwiGLU activation functions, and incorporating Mixture-of-Experts (MoE) modules.\n\nThe article emphasizes the shift from Multi-Head Attention (MHA) to Grouped Query Attention (GQA) for efficiency and the use of sliding window attention in gpt-oss, alternating between full context and limited window attention. It notes that while these models use similar base architectures to other LLMs, data and algorithm tweaks are crucial. The author also discusses the trade-offs between model width and depth and briefly mentions attention biases and sinks and benchmarks against GPT-5. The sliding window size of 128 tokens in gpt-oss is remarkably small, and the article points out that sliding-window attention was already used in GPT-3.\n",
    "chinese_title": "GPT-OSS对比Qwen3，以及GPT-2以来发展历程的详细回顾",
    "chinese_summary": "Sebastian Raschka的这篇文章分析了OpenAI最新开源权重的大语言模型gpt-oss-20b和gpt-oss-120b，并将它们与GPT-2以及其他现代架构（如Qwen3）进行了比较。文章重点介绍了自GPT-2以来取得的架构进步，例如移除dropout，用RoPE替换绝对位置嵌入，从GELU切换到Swish/SwiGLU激活函数，以及整合混合专家（MoE）模块。\n\n文章强调了为提高效率，从多头注意力（MHA）到分组查询注意力（GQA）的转变，以及gpt-oss中滑动窗口注意力的使用，在完整上下文和有限窗口注意力之间交替。文章指出，虽然这些模型与其他大语言模型使用相似的基础架构，但数据和算法调整至关重要。作者还讨论了模型宽度和深度之间的权衡，并简要提到了注意力偏差和汇聚点，以及与GPT-5的基准测试。gpt-oss中128个token的滑动窗口尺寸非常小，文章指出滑动窗口注意力已在GPT-3中使用。"
  },
  {
    "id": "44866698",
    "title": "Reddit will block the Internet Archive",
    "url": "https://www.theverge.com/news/757538/reddit-internet-archive-wayback-machine-block-limit",
    "summary": "Reddit is blocking the Internet Archive's Wayback Machine from accessing most of its content due to concerns that AI companies are scraping data from the archive in violation of Reddit's platform policies. The block will prevent the Wayback Machine from indexing post detail pages, comments, and profiles, limiting it to only archiving the Reddit.com homepage.\n\nReddit spokesperson Tim Rathschmidt stated that the decision was made to protect Redditors and their data, as Reddit believes AI companies are scraping the Wayback Machine to access Reddit content, including deleted content, against their policies. Reddit has previously expressed concerns to the Internet Archive about scraping issues.\n\nThis move follows Reddit's recent history of restricting access to its data for scrapers, especially AI companies. Reddit has previously made deals with companies like Google and OpenAI to provide data for search and AI training, and has started charging search engines for crawling its data. The controversial API changes in 2023 were also justified by Reddit as a measure to prevent AI model training through API abuse. Reddit has even sued Anthropic for allegedly scraping its content. The Internet Archive has not yet responded to a request for comment.\n",
    "chinese_title": "Reddit 将屏蔽互联网档案馆。",
    "chinese_summary": "由于担心人工智能公司违反Reddit平台政策，从互联网档案馆的网络时光机抓取数据，Reddit正在阻止该网络时光机访问其大部分内容。此举将阻止网络时光机索引帖子详情页、评论和用户资料，使其仅能存档Reddit.com主页。\n\nReddit发言人Tim Rathschmidt表示，该决定是为了保护Reddit用户及其数据，因为Reddit认为人工智能公司正在抓取网络时光机，以访问违反其政策的Reddit内容，包括已删除的内容。Reddit此前已向互联网档案馆表达了对抓取问题的担忧。\n\n在此之前，Reddit最近一直在限制抓取工具，尤其是人工智能公司对其数据的访问。Reddit此前已与谷歌和OpenAI等公司达成协议，为其搜索和人工智能训练提供数据，并已开始向搜索引擎收取抓取其数据的费用。2023年备受争议的API更改也被Reddit辩解为是为了防止通过API滥用进行人工智能模型训练的措施。Reddit甚至起诉了Anthropic，指控其抓取内容。互联网档案馆尚未对置评请求作出回应。"
  },
  {
    "id": "44860757",
    "title": "AI: Great Expectations",
    "url": "https://rodneybrooks.com/ai-great-expectations/",
    "summary": "Rodney Brooks revisits a 1988 article he wrote on the cyclical nature of AI hype, contrasting past expectations with present realities. In 1988, he observed that AI, encompassing expert systems, robots, and neural networks, consistently faced inflated expectations followed by more modest real-world success. He emphasized that AI is not magic, but rather a collection of tools and methodologies for tackling problems previously unsolvable by conventional programming.\n\nLooking back 37 years later, Brooks notes his younger self's optimism about AI was well-founded, yet acknowledges the persistent cycle of hype and disillusionment in the field. He highlights two specific predictions he previously deemed overly optimistic: Edmund Berkeley's 1949 vision of machines as stenographers, translators, and psychiatrists, and a 1962 prediction by Bernard Widrow that neural nets would allow users to converse with computers in English and that it would \"write programs for us\". While aspects of these predictions have materialized decades later, Brooks maintains that, at the time, they were significantly overblown, requiring vastly more computational power and research than initially envisioned. He concludes that AI development is a gradual process of unlocking complex processes one by one, leading to a constant flow of practical applications, a sentiment he found exciting then and now.\n",
    "chinese_title": "人工智能：美好期望",
    "chinese_summary": "罗德尼·布鲁克斯重温了他1988年撰写的一篇关于人工智能炒作周期性的文章，将过去的期望与现在的现实进行了对比。1988年，他观察到，包括专家系统、机器人和神经网络在内的人工智能，总是面临着被夸大的期望，随后是更为温和的现实世界的成功。他强调，人工智能不是魔法，而是一系列工具和方法，用于解决以前传统编程无法解决的问题。\n\n回首37年后，布鲁克斯指出，年轻时的自己对人工智能的乐观是有根据的，但也承认该领域持续存在的炒作和幻灭周期。他强调了他之前认为过于乐观的两个具体预测：埃德蒙·伯克利1949年关于机器成为速记员、翻译和精神科医生的愿景，以及伯纳德·威德罗1962年关于神经网络将允许用户用英语与计算机交谈并“为我们编写程序”的预测。虽然这些预测的某些方面在几十年后已经实现，但布鲁克斯坚持认为，当时这些预测被严重夸大了，需要比最初设想的更多的计算能力和研究。他总结说，人工智能的发展是一个逐步解锁复杂过程的过程，从而不断产生实际应用，这种观点无论当时还是现在都让他感到兴奋。"
  },
  {
    "id": "44863335",
    "title": "Israel's Leviathan signs $35B natural gas supply deal with Egypt",
    "url": "https://www.reuters.com/business/energy/israels-leviathan-signs-35-billion-natural-gas-supply-deal-with-egypt-2025-08-07/",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "以色列利维坦与埃及签署350亿美元天然气供应协议",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "44858371",
    "title": "Anti-competitive practices masquerading as security is a dangerous pattern",
    "url": "https://blog.alinelerner.com/i-posted-some-interview-prep-materials-on-linkedin-then-they-deleted-me/",
    "summary": "Aline Lerner, founder of interviewing.io, details her experience of being abruptly locked out of her LinkedIn account after promoting a resource hub containing content critical of LinkedIn. Her profile vanished, her company's followers dropped to zero, and LinkedIn requested a photo ID for verification, citing potential security concerns.\n\nLerner suspects anti-competitive practices are at play, disguised as security measures. She points out that her ability to regain access relied on investor connections, suggesting a flawed system where ordinary users might be permanently banned without explanation. She questions why LinkedIn collects IDs even when a terms of service violation, rather than a security breach, is the issue.\n\nShe argues that LinkedIn's identity management seems inadequate, considering her established presence in the recruiting community and consistent login habits. Lerner contrasts this with interviewing.io's robust identity verification despite being an anonymous platform.\n\nLerner criticizes LinkedIn's process of locking, removing, and then demanding ID without clear explanation or reinstatement, unless the user has connections. She highlights potential violations of principles akin to free speech, due process, and equal treatment under the law. She concludes that LinkedIn seems to be silencing competitors by using claims of security issues.\n",
    "chinese_title": "伪装成安全的反竞争行为是一种危险的模式",
    "chinese_summary": "采访.io创始人Aline Lerner详述了她在推广一个包含批评LinkedIn内容的资源中心后，突然被锁住LinkedIn账户的经历。她的个人资料消失，公司的关注者数量降至零，LinkedIn以潜在的安全问题为由，要求提供照片身份证进行验证。\n\nLerner怀疑这背后存在反竞争行为，伪装成安全措施。她指出，她能恢复访问权限依赖于投资人关系，暗示这是一个有缺陷的系统，普通用户可能在没有任何解释的情况下被永久封禁。她质疑，即使是违反服务条款而非安全漏洞，LinkedIn为何还要收集身份证件。\n\n她认为，考虑到她在招聘社区的知名度和一贯的登录习惯，LinkedIn的身份管理似乎不够完善。Lerner将此与采访.io强大的身份验证形成对比，尽管采访.io是一个匿名平台。\n\nLerner批评了LinkedIn锁定、删除账户然后要求提供身份证件的做法，且没有明确的解释或恢复措施，除非用户有人脉关系。她强调这可能违反了类似于言论自由、正当程序和法律面前人人平等原则。她总结说，LinkedIn似乎在利用所谓的安全问题来压制竞争对手。"
  },
  {
    "id": "44823272",
    "title": "PHP compile time generics: yay or nay?",
    "url": "https://thephp.foundation/blog/2025/08/05/compile-generics/",
    "summary": "This article discusses the possibility of implementing compile-time generics in PHP, a long-sought-after feature. Full runtime generics have proven too complex and slow for PHP's interpreted nature. The PHP Foundation's team, including Larry Garfield and Gina Banyard, is exploring a partial implementation focusing on compile-time type checking for interfaces and abstract classes.\n\nThe proposed approach allows interfaces and abstract classes to declare generic type parameters (e.g., `interface Exporter<Thing>`). Implementing classes would then be required to specify concrete types (e.g., `class WidgetExporter implements Exporter<Widget>`). This \"manual monomorphization\" would enable compile-time type enforcement and caching, offering a significant portion of the benefit of full generics without the associated performance overhead.\n\nThe article highlights potential extensions like allowing generic abstract classes and type declarations for generic properties. It also explores how this approach could be used for typed collections.\n\nMore complex features like variance, trait interactions, and generic functions are discussed as potential future extensions. However, runtime generics (e.g., `$fooExporter = new Exporter<Foo>()`), generic compound types, and full type inference remain significant challenges and are not part of the initial plan. Importantly, the proposed compile-time generics wouldn't hinder future attempts at these more complex features. The article essentially proposes a pragmatic approach to introduce generics incrementally, starting with the parts that are most feasible and provide the most immediate benefit.\n",
    "chinese_title": "PHP编译时泛型：可行还是不可行？",
    "chinese_summary": "PHP编译时泛型的可能性探讨"
  },
  {
    "id": "44859710",
    "title": "TCP Client Self-Connect (2013)",
    "url": "http://sgros.blogspot.com/2013/08/tcp-client-self-connect.html",
    "summary": "This blog post, written in 2013 by Stjepan Groš, explores the phenomenon of a TCP client connecting to itself, specifically using `telnet` to connect to a port on localhost where no server is listening.\n\nThe author demonstrates that repeatedly attempting to connect to a port (e.g., 50000) using `telnet` will initially result in \"Connection refused\" errors. However, eventually, a connection *will* be established with the client connecting to itself, visible through `netstat` and `tcpdump`.\n\nThis occurs because the kernel assigns a random ephemeral port to the `telnet` client for each connection attempt. If, by chance, the kernel assigns the destination port (50000 in this case) as the source port, the client attempts to connect to itself.\n\nThis behavior is technically within the TCP specification, allowing for \"simultaneous open\". The author then delves into the kernel's source code to explain how the TCP state machine handles this self-connect scenario.  Specifically, the code identifies the self-connect case in the `TCP_SYN_SENT` state, moves the socket to `TCP_SYN_RECV`, sends a SYN+ACK, and then sends a final ACK to establish the connection and move the socket to the `ESTABLISHED` state.\n\nThe post concludes with a warning against using ephemeral ports for listening servers due to the potential for such unexpected and difficult-to-debug behavior.  The author emphasizes that this scenario requires the client and server (in this case, effectively the same process) to use the same IP address and the connection attempt to happen during the initial handshake.\n",
    "chinese_title": "TCP客户端自连接 (2013)",
    "chinese_summary": "Stjepan Groš 于 2013 年撰写的这篇博文探讨了一个 TCP 客户端连接到自身的现象，具体来说是使用 `telnet` 连接到 localhost 上没有服务器监听的端口。\n\n作者演示了使用 `telnet` 重复尝试连接到某个端口（例如，50000）最初会导致“Connection refused”错误。但是，最终会建立连接，客户端连接到自身，这可以通过 `netstat` 和 `tcpdump` 看到。\n\n这发生的原因是内核为每次连接尝试为 `telnet` 客户端分配一个随机的临时端口。如果偶然地，内核将目标端口（在本例中为 50000）分配为源端口，则客户端会尝试连接到自身。\n\n从技术上讲，此行为符合 TCP 规范，允许“同时打开”。然后，作者深入研究内核的源代码，以解释 TCP 状态机如何处理这种自连接情况。具体来说，代码在 `TCP_SYN_SENT` 状态中识别出自连接的情况，将套接字移动到 `TCP_SYN_RECV`，发送 SYN+ACK，然后发送最终的 ACK 以建立连接并将套接字移动到 `ESTABLISHED` 状态。\n\n该文章最后警告不要将临时端口用于监听服务器，因为可能会出现这种意外且难以调试的行为。作者强调，这种情况要求客户端和服务器（在这种情况下，实际上是同一个进程）使用相同的 IP 地址，并且连接尝试发生在初始握手期间。"
  },
  {
    "id": "44863860",
    "title": "How to Lie with Statistics",
    "url": "https://en.wikipedia.org/wiki/How_to_Lie_with_Statistics",
    "summary": "\"How to Lie with Statistics,\" written by journalist Darrell Huff and published in 1954, is a popular and accessible introduction to the interpretation and potential misuse of statistics. The book, illustrated by Irving Geis, demonstrates how statistical errors and deliberate manipulations can lead to incorrect conclusions.\n\nIt highlights common pitfalls, such as confusing correlation with causation, improper use of random sampling, and the deceptive use of graphs. Huff explains how visual representations, like line and bar charts, can be distorted to exaggerate differences or mislead the reader about proportional relationships, as seen in pictograms.\n\nIntended for a general audience, the book gained popularity as an introductory textbook for college students in the 1960s and 70s. It has sold over 1.5 million copies in English and has been widely translated, solidifying its place as one of the best-selling statistics books of all time. The book aims to equip readers with the critical thinking skills necessary to evaluate statistical information and identify potential manipulation or misrepresentation.\n",
    "chinese_title": "如何用统计学说谎",
    "chinese_summary": "如何用统计说谎\n\n记者达莱尔·哈夫所著的《如何用统计说谎》出版于1954年，是一本广受欢迎且易于理解的统计学解读和潜在误用入门书籍。该书由欧文·盖斯配图，展示了统计错误和蓄意操纵如何导致错误的结论。\n\n书中重点介绍了常见的陷阱，例如混淆相关性和因果关系、不当使用随机抽样以及图表的欺骗性使用。哈夫解释了折线图和条形图等视觉表现形式如何被扭曲以夸大差异或误导读者对比例关系的理解，如图形文字中可见。\n\n本书面向大众，在20世纪60年代和70年代作为大学生的入门教材而广受欢迎。它以英文售出了超过150万册，并已被广泛翻译，巩固了其作为有史以来最畅销的统计学书籍之一的地位。本书旨在使读者掌握批判性思维技能，从而评估统计信息并识别潜在的操纵或虚假陈述。"
  },
  {
    "id": "44832060",
    "title": "Reflections on Soviet Amateur Photography",
    "url": "https://www.publicbooks.org/strangers-in-the-family-album-reflections-on-soviet-amateur-photography/",
    "summary": "Zeynep Devrim Gürsel reviews *In Visible Presence: Soviet Afterlives in Family Photos* by Oksana Sarkisova and Olga Shevchenko, highlighting the book's significance in understanding Soviet identity formation through amateur photography. Gürsel emphasizes that the book demonstrates how Soviet family albums, despite their seemingly mundane content, were vital in constructing and sustaining an imagined Soviet community.\n\nA key example is the prevalence of group portraits in Red Square, where strangers posed together and later received copies, embedding them into diverse family collections and forging a shared Soviet experience. Sarkisova and Shevchenko's research, based on interviews and analysis of family photo collections across Russia, uncovers a unique aspect of domestic photography: its inclusion of non-kin, reflecting a broader social fabric.\n\nGürsel also praises the book's exploration of censorship and silence, revealing how families grappled with the Soviet past in both visible and invisible ways. The book also demonstrates how photographic images were harnessed by the state for self-legitimization.\n\nThe review concludes by emphasizing the book's broader relevance beyond photography studies. Gürsel argues that *In Visible Presence* offers a new scholarly vision by using images to reveal broader social and political patterns, making it a valuable resource for understanding the complexities of history and memory in the post-Soviet era. The reviewer highlights the book's innovative design, including stills from video interviews and a ribbon marker, which encourages readers to engage deeply with the material.\n",
    "chinese_title": "苏联业余摄影反思",
    "chinese_summary": "泽伊内普·德夫里姆·居尔塞尔评《不可见的在场：家庭照片中的苏联遗存》（作者：奥克萨娜·萨尔基索娃和奥尔加·舍甫琴科），强调该书通过业余摄影理解苏联身份认同形成的重要意义。居尔塞尔强调，该书表明，苏联家庭相册尽管内容看似平凡，但在构建和维系一个想象中的苏联共同体方面至关重要。\n\n一个关键例子是红场上合影的普遍存在，陌生人一起合影，之后收到照片的复制品，这些照片嵌入到不同的家庭收藏中，并形成了共同的苏联体验。萨尔基索娃和舍甫琴科的研究基于对俄罗斯各地家庭照片收藏的访谈和分析，揭示了家庭摄影的一个独特方面：它包含了非亲属，反映了更广泛的社会结构。\n\n居尔塞尔还赞扬了该书对审查和沉默的探索，揭示了家庭如何以可见和不可见的方式处理苏联的过去。该书还展示了国家如何利用摄影图像进行自我合法化。\n\n评论最后强调了该书超越摄影研究的更广泛相关性。居尔塞尔认为，《不可见的在场》通过使用图像揭示更广泛的社会和政治模式，从而提供了一种新的学术视野，使其成为理解后苏联时代历史和记忆复杂性的宝贵资源。评论者强调了该书的创新设计，包括视频访谈的剧照和书签带，这鼓励读者深入研究这些材料。"
  },
  {
    "id": "44864929",
    "title": "Auf Wiedersehen, GitHub",
    "url": "https://github.blog/news-insights/company-news/goodbye-github/",
    "summary": "This article is a biographical introduction of Thomas Dohmke, the CEO of GitHub. It highlights his early interest in software development, stemming from his childhood in Germany, and his career focus on creating tools to improve developer experience. The piece emphasizes his current role at GitHub, where he has been instrumental in the development and release of widely used AI developer tools such as GitHub Copilot, Copilot Workspace, and GitHub Models. It also mentions his credentials as a TED speaker and his PhD in mechanical engineering from the University of Glasgow. The overall focus is on showcasing Dohmke's expertise and contributions to the field of software development, particularly within the realm of AI-powered tools.\n",
    "chinese_title": "再见，GitHub",
    "chinese_summary": "本文是对GitHub首席执行官Thomas Dohmke的传记介绍，重点介绍了他从小在德国对软件开发产生的浓厚兴趣，以及他专注于创建工具以改善开发者体验的职业生涯。文章强调了他目前在GitHub的角色，他在开发和发布广泛使用的AI开发者工具（如GitHub Copilot、Copilot Workspace和GitHub Models）方面发挥了重要作用。文章还提及了他作为TED演讲者的身份，以及他格拉斯哥大学机械工程博士学位。总体重点是展示Dohmke在软件开发领域的专业知识和贡献，尤其是在人工智能驱动工具领域。"
  },
  {
    "id": "44860639",
    "title": "How Does a Blind Model See the Earth?",
    "url": "https://outsidetext.substack.com/p/how-does-a-blind-model-see-the-earth",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "盲人模型如何看待地球？",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "44856935",
    "title": "Show HN: Bolt – A super-fast, statically-typed scripting language written in C",
    "url": "https://github.com/Beariish/bolt",
    "summary": "Bolt is a new, lightweight, and fast, statically-typed scripting language written in C, designed for real-time and embedded applications. It emphasizes performance, small footprint, easy embedding, and type safety.\n\nKey features include:\n\n*   **Speed:** Claims to outperform similar languages with fast compilation speeds (500kloc/thread/second).\n*   **Compact:** Minimal impact on build size.\n*   **Easy Embedding:** Simple API for integration into existing applications.\n*   **Type System:** Rich type system for early error detection, extensible with native code.\n*   **Embed-First Design:** Prioritizes inter-language performance.\n\nIt provides a standard library (with optional modules like file I/O), uses malloc/realloc/free by default (configurable), and embeds picomatch for regex parsing. The project includes example code, tests, and benchmarks.\n\nBolt currently supports x64 architectures and builds with MSVC, GCC, and Clang (with some warnings in GCC/Clang). Contributions are welcome, but the project is opinionated, requiring careful consideration for feature additions. It's licensed under MIT. Note that Bolt is still under development and may have compiler bugs.\n",
    "chinese_title": "Show HN: Bolt – 一款用 C 编写的超快静态类型脚本语言",
    "chinese_summary": "Bolt：一款适用于实时和嵌入式应用的新型轻量快速静态类型脚本语言，由C语言编写。它强调性能、小尺寸、易于嵌入和类型安全。\n\n主要特性包括：\n\n*   **速度：** 声称性能优于同类语言，编译速度快（50万行代码/线程/秒）。\n*   **紧凑：** 对构建尺寸影响极小。\n*   **易于嵌入：** 简单的API，便于集成到现有应用程序中。\n*   **类型系统：** 丰富的类型系统，用于早期错误检测，可通过原生代码扩展。\n*   **嵌入优先设计：** 优先考虑跨语言性能。\n\n它提供了一个标准库（带有可选模块，如文件I/O），默认使用malloc/realloc/free（可配置），并嵌入picomatch用于正则表达式解析。该项目包括示例代码、测试和基准测试。\n\nBolt目前支持x64架构，并可使用MSVC、GCC和Clang构建（GCC/Clang中存在一些警告）。欢迎贡献，但该项目具有主观性，需要仔细考虑功能添加。它采用MIT许可证。请注意，Bolt仍在开发中，可能存在编译器错误。"
  },
  {
    "id": "44833448",
    "title": "Digital Foundry leaves IGN, now independent [video]",
    "url": "https://www.youtube.com/watch?v=tl7bIJ2yu4I",
    "summary": "The video is about Digital Foundry, a well-known team specializing in in-depth technical analysis of video games and hardware, leaving IGN and becoming an independent entity. The provided content snippet appears to be the standard YouTube footer, which includes links to topics like copyright, contacting YouTube, creator resources, advertising, developer information, terms of service, privacy policy, safety guidelines, how YouTube works, testing new features, and information on NFL Sunday Ticket. This footer doesn't give any information about *why* Digital Foundry left IGN or what their plans are as an independent group.\n\n**In short, the video title indicates Digital Foundry has left IGN and is now independent. The provided content is just the standard YouTube boilerplate and offers no further information about the split or Digital Foundry's future.**\n",
    "chinese_title": "Digital Foundry离开IGN，现已独立 [视频]",
    "chinese_summary": "视频内容是关于Digital Foundry这个以深度技术分析视频游戏和硬件而闻名的团队离开IGN并成为独立实体。所提供的内容片段似乎是标准的YouTube页脚，包括版权、联系YouTube、创作者资源、广告、开发者信息、服务条款、隐私政策、安全指南、YouTube运作方式、测试新功能以及NFL Sunday Ticket信息等链接。此页脚未提供任何关于Digital Foundry *为何* 离开IGN或他们作为独立团队的计划的信息。\n\n**简而言之，视频标题表明Digital Foundry已经离开IGN并且现在是独立的。所提供的内容只是标准的YouTube样板文件，没有提供有关分裂或Digital Foundry未来的更多信息。**"
  },
  {
    "id": "44825347",
    "title": "Creating the Longest Possible Ski Jump in “The Games: Winter Challenge”",
    "url": "https://mrwint.github.io/winter/writeup/writeup2.html",
    "summary": "This article details the author's quest to determine the longest possible ski jump distance in the game \"The Games: Winter Challenge.\" Instead of relying on traditional gameplay and tool-assisted methods, the author opts for a binary analysis approach, aiming to understand the game's internal mechanics and simulation logic.\n\nThe article outlines the four phases of a ski jump within the game (ramp descent, jump, flight, and landing) and acknowledges that the game's advice (keeping skis parallel) might not represent the actual optimal strategy due to potential hidden mechanics and emergent behaviors.\n\nThe focus then shifts to reverse-engineering the game's replay file format. By analyzing the file structure and modifying data, the author discovers the initial 14 bytes are a header, followed by a savestate section and an input sequence section.\n\nThe savestate contains player data (suit color), an RNG seed influencing wind, and the initial ski angle. The input sequence is composed of 4-byte blocks, presumably encoding player actions. The author then delves into the game's disassembled code to pinpoint memory locations associated with the savestate (player data, RNG seed, ski jump state data). This provides a direct mapping between replay file data and in-game variables. Further code analysis reveals how the game reads and processes the input data from the replay file, setting the stage for understanding how player actions are interpreted and simulated.\n",
    "chinese_title": "在“冬季挑战赛”中创造最长滑雪跳跃",
    "chinese_summary": "本文详细介绍了作者在游戏《The Games: Winter Challenge》中探索最远跳台滑雪距离的过程。作者没有依赖传统的游戏玩法和工具辅助方法，而是选择了二进制分析方法，旨在了解游戏的内部机制和模拟逻辑。\n\n文章概述了游戏中跳台滑雪的四个阶段（斜坡下降、跳跃、飞行和着陆），并指出由于潜在的隐藏机制和涌现行为，游戏中的建议（保持滑雪板平行）可能并不代表实际的最佳策略。\n\n随后，重点转移到逆向工程游戏的重播文件格式。通过分析文件结构和修改数据，作者发现前14个字节是标头，后跟一个保存状态部分和一个输入序列部分。\n\n保存状态包含玩家数据（服装颜色）、影响风力的 RNG 种子以及初始滑雪角度。输入序列由 4 字节块组成，可能编码了玩家的操作。然后，作者深入研究游戏的反汇编代码，以查明与保存状态相关的内存位置（玩家数据、RNG 种子、跳台滑雪状态数据）。这提供了重播文件数据和游戏内变量之间的直接映射。进一步的代码分析揭示了游戏如何读取和处理重播文件中的输入数据，为理解玩家操作如何被解释和模拟奠定了基础。"
  },
  {
    "id": "44856426",
    "title": "Fight Chat Control",
    "url": "https://fightchatcontrol.eu/",
    "summary": "The \"Fight Chat Control\" campaign opposes the EU's proposed \"Chat Control\" legislation, which would mandate the scanning of all private digital communications, including encrypted messages and photos, for all EU citizens. The campaign argues that this mass surveillance violates fundamental privacy rights, guaranteed by the EU Charter, and undermines digital security.\n\nKey concerns include the automatic scanning of all digital content without suspicion, the weakening of end-to-end encryption which exposes everyone to vulnerabilities, the potential for false positives which could lead to false accusations, and the ineffectiveness of mass surveillance in child protection. Child protection experts warn that such surveillance diverts resources from proven methods and weakens security for everyone, making children less safe.\n\nThe campaign also highlights that EU politicians exempt themselves from the policy under \"professional secrecy\" rules, demanding fairness in privacy rights. They argue the proposal sets a dangerous global precedent for authoritarian governments to implement intrusive surveillance.\n\nThe campaign urges EU citizens to contact their MEPs to voice their opposition, emphasizing that individual messages, photos, and private conversations will be scanned without consent. They provide tools for citizens to customize and send messages to their representatives, highlighting concerns such as privacy rights, breaking encryption, ineffective child protection, undermining democracy, technical issues, and economic impact. The ultimate goal is to halt the legislation and protect privacy and freedom.\n",
    "chinese_title": "反对聊天监控",
    "chinese_summary": "“反对聊天监控”运动反对欧盟提出的“聊天监控”立法，该立法将强制扫描所有欧盟公民的所有私人数字通信，包括加密消息和照片。该运动认为，这种大规模监控侵犯了欧盟宪章保障的基本隐私权，并破坏了数字安全。\n\n主要担忧包括：未经怀疑自动扫描所有数字内容；削弱端到端加密，使所有人面临漏洞；可能出现误报，导致虚假指控；以及大规模监控在儿童保护方面的无效性。儿童保护专家警告说，这种监控会将资源从已证实有效的方法中转移，并削弱所有人的安全性，使儿童更不安全。\n\n该运动还强调，欧盟政客根据“职业保密”规则将自己排除在该政策之外，要求隐私权方面的公平。他们认为，该提案为专制政府实施侵入式监控开创了危险的全球先例。\n\n该运动敦促欧盟公民联系他们的欧洲议会议员，表达他们的反对意见，强调个人消息、照片和私人对话将在未经同意的情况下被扫描。他们为公民提供了定制信息并发送给其代表的工具，强调了隐私权、破坏加密、无效的儿童保护、破坏民主、技术问题和经济影响等问题。最终目标是阻止该立法并保护隐私和自由。"
  },
  {
    "id": "44855157",
    "title": "Show HN: Engineering.fyi – Search across tech engineering blogs in one place",
    "url": "https://engineering.fyi/",
    "summary": "Engineering.fyi is a search engine for tech engineering blogs. Here's a summary of the articles listed:\n\n**AI & LLMs:** A large portion of the articles focus on AI, specifically advancements around OpenAI's GPT models (GPT-5, gpt-oss) and Google's Gemini models. Topics include safety training, model capabilities (reasoning, image-to-video), embedding techniques, conversational AI, and use cases in various domains (coding, medicine, commerce). Google's Veo 3 and its integration with Gemini API, allowing video generation, are also highlighted. Furthermore, the development and use of AI agents using tools like Gemini CLI and ADK is discussed. There's emphasis on using AI to enhance existing workflows, improve code quality (Microsoft Copilot), and automate tasks.\n\n**Cloud & Infrastructure:** Several articles discuss cloud infrastructure topics, including Istio upgrades on Kubernetes at Airbnb, Cloudflare's AI Workers, and building flexible data pipelines. There are also articles on distributed databases on Kubernetes (Airbnb) and API security using Apigee for AI agents.\n\n**Performance & Architecture:** Articles address optimizing performance in React Native (FlashList v2), detecting performance optimization opportunities in Go code (Uber's PerfInsights), and improving code quality with AI-powered code reviews (Microsoft). Netflix shares insights into their live streaming architecture.\n\n**Open Source & Tools:** The collection includes announcements and information about new open-source tools and libraries, such as LangExtract (Google), an AI tool for designing concrete mixes (Meta), and Stanford's Marin foundation model.\n\n**Other Topics:** Some articles address broader topics like AI action plans (US White House, Palantir), the Google Developer Program evolution, and building human-computer interfaces. The Stripe Tax article details a faster jurisdiction resolution system.\n",
    "chinese_title": "Show HN: Engineering.fyi – 一站式搜索技术工程博客",
    "chinese_summary": "Engineering.fyi 是一个技术工程博客搜索引擎。以下是所列文章的摘要：\n\n**AI & LLMs：** 大部分文章关注AI，特别是 OpenAI 的 GPT 模型（GPT-5，gpt-oss）和 Google 的 Gemini 模型方面的进展。主题包括安全训练、模型能力（推理、图像转视频）、嵌入技术、对话式AI，以及在各个领域的用例（编码、医学、商业）。Google 的 Veo 3 及其与 Gemini API 的集成（允许视频生成）也得到了强调。此外，还讨论了使用 Gemini CLI 和 ADK 等工具开发和使用 AI 代理。重点是使用 AI 来增强现有工作流程、提高代码质量（Microsoft Copilot）和自动化任务。\n\n**云 & 基础设施：** 几篇文章讨论了云基础设施主题，包括 Airbnb 上 Kubernetes 的 Istio 升级、Cloudflare 的 AI Workers 以及构建灵活的数据管道。还有关于 Kubernetes 上的分布式数据库（Airbnb）以及使用 Apigee 为 AI 代理提供 API 安全性的文章。\n\n**性能 & 架构：** 文章涉及优化 React Native 中的性能（FlashList v2）、检测 Go 代码中的性能优化机会（Uber 的 PerfInsights）以及使用 AI 驱动的代码审查来提高代码质量（Microsoft）。Netflix 分享了他们直播流媒体架构的见解。\n\n**开源 & 工具：** 该集合包括有关新的开源工具和库的公告和信息，例如 LangExtract（Google）、用于设计混凝土混合料的 AI 工具（Meta）以及斯坦福大学的 Marin 基础模型。\n\n**其他主题：** 一些文章涉及更广泛的主题，例如 AI 行动计划（美国白宫、Palantir）、Google 开发者计划的演变以及构建人机界面。Stripe Tax 的文章详细介绍了一个更快的管辖权解决方案系统。"
  },
  {
    "id": "44858009",
    "title": "Events",
    "url": "https://developer.mozilla.org/en-US/docs/Learn_web_development/Core/Scripting/Events",
    "summary": "This article introduces the concept of events in JavaScript, explaining how they allow web pages to respond to user interactions and other occurrences within the browser. Events are signals fired by the browser when something significant happens, such as a button click, key press, or page load. To react to an event, you attach an *event listener* to it. The recommended way to add event listeners is using the `addEventListener()` method, which takes the event type (e.g., \"click\", \"mouseover\") and a callback function (the *event handler*) as arguments. You can also use `removeEventListener()` to detach event listeners.\n\nThe article also briefly discusses alternative, less preferred methods for handling events: event handler properties (e.g., `element.onclick`) and inline event handlers in HTML (e.g., `<button onclick=\"...\">`), advising against the latter due to maintainability and security concerns.\n\nThe *event object* is introduced as a parameter automatically passed to event handlers, providing extra information about the event. Key properties include `target`, which refers to the element that triggered the event. Finally, the article covers how to prevent the default behavior of an event using `preventDefault()`, such as preventing a form from submitting when validation fails.\n",
    "chinese_title": "活动",
    "chinese_summary": "本文介绍了JavaScript中事件的概念，解释了它们如何使网页响应用户交互和浏览器中发生的其他事件。事件是浏览器在发生重要事情时发出的信号，例如按钮点击、按键或页面加载。要对事件做出反应，你需要将一个*事件监听器*附加到它上面。推荐的添加事件监听器的方法是使用`addEventListener()`方法，该方法接受事件类型（例如，“click”、“mouseover”）和一个回调函数（*事件处理程序*）作为参数。你还可以使用`removeEventListener()`来分离事件监听器。\n\n本文还简要讨论了处理事件的替代方法，但这些方法不太受欢迎：事件处理程序属性（例如，`element.onclick`）和HTML中的内联事件处理程序（例如，`<button onclick=\"...\">`），并建议避免使用后者，因为存在可维护性和安全问题。\n\n*事件对象*被介绍为自动传递给事件处理程序的参数，提供了有关事件的额外信息。关键属性包括`target`，它指的是触发事件的元素。最后，本文介绍了如何使用`preventDefault()`阻止事件的默认行为，例如阻止表单在验证失败时提交。"
  },
  {
    "id": "44861175",
    "title": "A ChatGPT Pro subscription costs 38.6 months of income in low-income countries",
    "url": "https://policykahani.substack.com/p/a-chatgpt-pro-subscription-costs",
    "summary": "The article \"A ChatGPT Pro subscription costs 38.6 months of income in low-income countries\" highlights the significant economic disparity in access to advanced AI tools like ChatGPT Pro. It argues that while a $20 monthly subscription fee may seem reasonable in high-income countries, it represents a substantial financial burden for individuals in low-income countries.\n\nThe author uses data from the World Bank and OpenAI to compare the cost of ChatGPT Pro to average incomes in different countries. They find that in low-income countries, the subscription could cost as much as several years' worth of income, making it prohibitively expensive for most people.\n\nThe article emphasizes that this disparity further exacerbates existing inequalities in access to technology and knowledge. While those in wealthier nations can readily leverage AI tools for education, professional development, and innovation, individuals in low-income countries are effectively excluded, hindering their ability to participate in and benefit from the AI revolution.\n\nThe author suggests that this affordability gap needs to be addressed to ensure equitable access to AI. Possible solutions include tiered pricing models, subsidized access for students and researchers in developing countries, and development of open-source alternatives. The article ultimately calls for a more inclusive approach to AI development and deployment, acknowledging the diverse economic realities across the globe.\n",
    "chinese_title": "ChatGPT Pro订阅费用相当于低收入国家38.6个月的收入。",
    "chinese_summary": "文章《ChatGPT Pro订阅费用在低收入国家相当于38.6个月的收入》突显了在获取ChatGPT Pro等先进人工智能工具方面的巨大经济差距。文章认为，虽然每月20美元的订阅费在高收入国家可能看似合理，但对于低收入国家的人来说，这是一笔巨大的经济负担。\n\n作者利用世界银行和OpenAI的数据，将ChatGPT Pro的费用与不同国家的平均收入进行了比较。他们发现，在低收入国家，该订阅费用可能高达数年的收入，使大多数人望而却步。\n\n文章强调，这种差距进一步加剧了在获取技术和知识方面已存在的不平等。当富裕国家的人们可以轻松利用人工智能工具进行教育、职业发展和创新时，低收入国家的人们实际上被排除在外，阻碍了他们参与人工智能革命并从中受益的能力。\n\n作者建议，需要解决这种支付能力差距，以确保公平地获取人工智能。可能的解决方案包括分级定价模式、为发展中国家的学生和研究人员提供补贴访问，以及开发开源替代方案。文章最终呼吁采取更具包容性的人工智能开发和部署方法，承认全球不同的经济现实。"
  },
  {
    "id": "44863341",
    "title": "Nukes, Nubs And Coners: The Social Hierarchy Aboard A Nuclear Submarine (2020)",
    "url": "https://www.twz.com/34104/nukes-nubs-and-coners-the-unique-social-hierarchy-aboard-a-nuclear-submarine",
    "summary": "Aaron Amick, a retired Navy sonarman, details the social hierarchy aboard a nuclear submarine, focusing on the unique roles and stereotypes of crew members. The journey begins with being a \"NUB\" (Non-Useful Body), a new recruit who must qualify in submarines within 12 months through a rigorous four-phase process involving system knowledge, physical walkthroughs, and oral boards. Successful completion earns them their dolphins and acceptance into the submarine community.\n\nThe crew is then broadly divided into \"Nukes\" and \"Coners.\" Nukes, who work in the engine room, are depicted as intelligent but socially awkward, further categorized into Reactor Operators, Nuclear Electricians, and Nuclear Mechanics, each with distinct quirks and responsibilities. They maintain the nuclear powerplant, ensuring the submarine's propulsion.\n\nConers inhabit the areas forward of the engine room and represent a diverse mix of backgrounds. This group includes Radiomen (message gatekeepers), Quartermasters (navigators), Sonarmen (sound analysts with eccentric personalities), Missile Technicians (nuclear warhead stewards), Auxiliarymen (atmosphere and waste management), Torpedomen (weapons specialists), Cooks (morale boosters through food), Yeomen (paperwork specialists), and the Doc (medic).\n\nAmick emphasizes that despite their individual quirks, the crew functions as a cohesive and effective fighting force. He concludes by highlighting the rewarding nature of submarine service, showcasing how a diverse group can achieve extraordinary feats under challenging conditions.\n",
    "chinese_title": "核潜艇上的等级制度：核手、新兵和角落 (2020)",
    "chinese_summary": "亚伦·阿米克，一位退役海军声呐兵，详细描述了核潜艇上的社会等级，重点介绍了艇员的独特角色和刻板印象。这段旅程始于作为一名“无用之人”(NUB)，一个必须在12个月内通过严格的四阶段流程（包括系统知识、实地考察和口头考核）获得潜艇资格的新兵。成功完成将为他们赢得海豚徽章，并被潜艇社区接受。\n\n艇员大致分为“核动力组”和“非核动力组”。在机舱工作的核动力组被描述为聪明但社交笨拙，进一步分为反应堆操作员、核电工和核机械师，每个人都有独特的怪癖和职责。他们维护核动力装置，确保潜艇的推进。\n\n非核动力组居住在机舱前方的区域，代表着各种不同的背景。该组包括无线电员（信息守门员）、舵手（导航员）、声呐兵（具有古怪个性的声音分析师）、导弹技师（核弹头管理员）、辅机兵（大气和废物管理）、鱼雷兵（武器专家）、厨师（通过食物提高士气）、文书（文件专家）和医务兵（医生）。\n\n阿米克强调，尽管他们各有特点，但艇员作为一个有凝聚力和战斗力的部队发挥作用。他最后强调了潜艇服役的回报性质，展示了多元化的群体如何在充满挑战的条件下取得非凡的成就。"
  },
  {
    "id": "44850260",
    "title": "Curious about the training data of OpenAI's new GPT-OSS models? I was too",
    "url": "https://twitter.com/jxmnop/status/1953899426075816164",
    "summary": "The article, titled \"Curious about the training data of OpenAI's new GPT-OSS models? I was too,\" is inaccessible due to a JavaScript error. The displayed content indicates that JavaScript is disabled in the browser, preventing the full webpage from loading. As a result, the actual content regarding OpenAI's GPT-OSS model training data cannot be retrieved. The visible information includes standard website footer elements like a link to the help center, terms of service, privacy policy, cookie policy, imprint, ad information, and a copyright notice. Without JavaScript enabled, the core article is unavailable for analysis. Therefore, no summary of the training data used for OpenAI's new GPT-OSS models can be provided.\n",
    "chinese_title": "好奇 OpenAI 新 GPT-OSS 模型的训练数据吗？我也是。",
    "chinese_summary": "关于OpenAI新型GPT-OSS模型训练数据的好奇？我也是。但由于JavaScript错误，文章无法访问。显示内容表明浏览器禁用了JavaScript，导致网页无法完整加载。因此，无法检索关于OpenAI的GPT-OSS模型训练数据的实际内容。可见信息包括标准的网站页脚元素，如帮助中心链接、服务条款、隐私政策、Cookie政策、版本说明、广告信息和版权声明。没有启用JavaScript，核心文章不可用，因此无法提供OpenAI新型GPT-OSS模型所用训练数据的摘要。"
  },
  {
    "id": "44848293",
    "title": "A CT scanner reveals surprises inside the 386 processor's ceramic package",
    "url": "https://www.righto.com/2025/08/intel-386-package-ct-scan.html",
    "summary": "This article delves into the intricate internal structure of the Intel 386 processor's ceramic package, revealing surprising complexity through a 3-D CT scan performed by Lumafield. While the exterior appears simple, the scan exposes six layers of internal wiring, effectively a 6-layer ceramic printed circuit board, facilitating the connection between the silicon die and the motherboard. The package features two tiers of gold contacts connected to the die via thin gold bond wires, some pads supporting up to five wires for increased current. This hierarchical interface expands the scale from the die's microscopic circuitry to the chip's pins by a factor of 2500.\n\nThe article highlights the custom design of the package, necessitated by the limitations of standard packages in providing sufficient power. It also reveals nearly invisible wires extending from the sides, used for electroplating the pins during manufacturing.\n\nA key finding is the presence of two separate power and ground networks within the 386: one for I/O and one for the CPU logic. This separation prevents power spikes from the I/O circuits from interfering with the processor's core logic.\n\nFurthermore, the article explores the function of the \"No Connect\" pins, suggesting they were used for testing purposes, with some pins almost fully connected. By tracing the connections, the author has labelled the function of each pin of the 386 die, making this information now available to the public for the first time. The article concludes by discussing Intel's historical challenges with packaging and the evolution from limited pin counts to complex Ball Grid Arrays, emphasizing the 386's package as a significant advancement.\n",
    "chinese_title": "CT扫描仪揭示386处理器陶瓷封装内的惊喜",
    "chinese_summary": "This article delves into the intricate internal structure of the Intel 386 processor's ceramic package, revealing surprising complexity through a 3-D CT scan performed by Lumafield. While the exterior appears simple, the scan exposes six layers of internal wiring, effectively a 6-layer ceramic printed circuit board, facilitating the connection between the silicon die and the motherboard. The package features two tiers of gold contacts connected to the die via thin gold bond wires, some pads supporting up to five wires for increased current. This hierarchical interface expands the scale from the die's microscopic circuitry to the chip's pins by a factor of 2500.\n\nThe article highlights the custom design of the package, necessitated by the limitations of standard packages in providing sufficient power. It also reveals nearly invisible wires extending from the sides, used for electroplating the pins during manufacturing.\n\nA key finding is the presence of two separate power and ground networks within the 386: one for I/O and one for the CPU logic. This separation prevents power spikes from the I/O circuits from interfering with the processor's core logic.\n\nFurthermore, the article explores the function of the \"No Connect\" pins, suggesting they were used for testing purposes, with some pins almost fully connected. By tracing the connections, the author has labelled the function of each pin of the 386 die, making this information now available to the public for the first time. The article concludes by discussing Intel's historical challenges with packaging and the evolution from limited pin counts to complex Ball Grid Arrays, emphasizing the 386's package as a significant advancement.\n"
  },
  {
    "id": "44856101",
    "title": "Diffusion language models are super data learners",
    "url": "https://jinjieni.notion.site/Diffusion-Language-Models-are-Super-Data-Learners-239d8f03a866800ab196e49928c019ac",
    "summary": "生成摘要时出错",
    "chinese_title": "扩散语言模型是超级数据学习者",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44840013",
    "title": "I want everything local – Building my offline AI workspace",
    "url": "https://instavm.io/blog/building-my-offline-ai-workspace",
    "summary": "生成摘要时出错",
    "chinese_title": "我想要一切本地化——构建我的离线AI工作空间",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44822076",
    "title": "Bouncing on trampolines to run eBPF programs",
    "url": "https://bootlin.com/blog/bouncing-on-trampolines-to-run-ebpf-programs/",
    "summary": "This blog post explores the eBPF trampoline, a mechanism designed to optimize the performance of eBPF tracing programs in the Linux kernel. Tracing programs like `fentry` and `fexit` allow monitoring of kernel function execution, but traditional methods like kprobes, which use exceptions, can introduce significant overhead when frequently triggered.\n\nThe eBPF trampoline provides a faster alternative by directly \"calling\" eBPF programs, similar to how kernel functions call each other. However, since eBPF instructions are not native, the trampoline acts as an \"ABI bridge\" between the native architecture and the eBPF ISA, handling calling conventions and data input.\n\nInstead of patching instructions to trigger exceptions, the trampoline dynamically generates architecture-specific code to prepare and execute eBPF programs. For `fentry` programs, the trampoline saves function arguments, calls the eBPF program, restores the arguments, and then returns to the original function.\n\nThe trampoline mechanism extends to more complex scenarios like capturing return values with `fexit`. In these cases, the trampoline can completely replace the original execution order, orchestrating the execution of both `fentry`, the target function, and `fexit`. The article provides examples related to ARM64 trampoline implementations. This allows for efficient and low-overhead monitoring of kernel function entry and exit points by minimizing context switches and exception handling.\n",
    "chinese_title": "Bouncing on trampolines to run eBPF programs",
    "chinese_summary": "This blog post explores the eBPF trampoline, a mechanism designed to optimize the performance of eBPF tracing programs in the Linux kernel. Tracing programs like `fentry` and `fexit` allow monitoring of kernel function execution, but traditional methods like kprobes, which use exceptions, can introduce significant overhead when frequently triggered.\n\nThe eBPF trampoline provides a faster alternative by directly \"calling\" eBPF programs, similar to how kernel functions call each other. However, since eBPF instructions are not native, the trampoline acts as an \"ABI bridge\" between the native architecture and the eBPF ISA, handling calling conventions and data input.\n\nInstead of patching instructions to trigger exceptions, the trampoline dynamically generates architecture-specific code to prepare and execute eBPF programs. For `fentry` programs, the trampoline saves function arguments, calls the eBPF program, restores the arguments, and then returns to the original function.\n\nThe trampoline mechanism extends to more complex scenarios like capturing return values with `fexit`. In these cases, the trampoline can completely replace the original execution order, orchestrating the execution of both `fentry`, the target function, and `fexit`. The article provides examples related to ARM64 trampoline implementations. This allows for efficient and low-overhead monitoring of kernel function entry and exit points by minimizing context switches and exception handling.\n"
  },
  {
    "id": "44825658",
    "title": "Squashing my dumb bugs and why I log build IDs",
    "url": "https://rachelbythebay.com/w/2025/08/03/scope/",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "Squashing my dumb bugs and why I log build IDs",
    "chinese_summary": "Unable to access the article link.\n"
  },
  {
    "id": "44855868",
    "title": "Flintlock – Create and manage the lifecycle of MicroVMs, backed by containerd",
    "url": "https://github.com/liquidmetal-dev/flintlock",
    "summary": "生成摘要时出错",
    "chinese_title": "Flintlock – Create and manage the lifecycle of MicroVMs, backed by containerd",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44866099",
    "title": "Trump's new executive order threatens US scientific freedom",
    "url": "https://www.dw.com/en/trumps-new-executive-order-threatens-us-scientific-freedom/a-73603440",
    "summary": "生成摘要时出错",
    "chinese_title": "Trump's new executive order threatens US scientific freedom",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44850913",
    "title": "How I code with AI on a budget/free",
    "url": "https://wuu73.org/blog/aiguide1.html",
    "summary": "生成摘要时出错",
    "chinese_title": "How I code with AI on a budget/free",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44826001",
    "title": "Dear String-to-Integer Parsers",
    "url": "https://owl.billpg.com/dear-string-to-integer-parsers/",
    "summary": "生成摘要时出错",
    "chinese_title": "Dear String-to-Integer Parsers",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44812613",
    "title": "How Potatoes Evolved",
    "url": "https://www.nhm.ac.uk/discover/news/2025/july/we-finally-solved-the-mystery-of-how-potatoes-evolved.html",
    "summary": "生成摘要时出错",
    "chinese_title": "How Potatoes Evolved",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44852582",
    "title": "Melonking Website",
    "url": "https://melonking.net/",
    "summary": "生成摘要时出错",
    "chinese_title": "Melonking Website",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44864768",
    "title": "Amiga Programming in 2025 with AmiBlitz",
    "url": "https://hackaday.com/2025/08/10/amiga-programming-in-2025-with-amiblitz/",
    "summary": "生成摘要时出错",
    "chinese_title": "Amiga Programming in 2025 with AmiBlitz",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44865073",
    "title": "One-size-fits-all pancreatic cancer vaccine showed promise in early trial",
    "url": "https://www.nbcnews.com/health/cancer/pancreatic-cancer-vaccine-prevents-recurrence-phase-1-clinical-trial-rcna223980",
    "summary": "生成摘要时出错",
    "chinese_title": "One-size-fits-all pancreatic cancer vaccine showed promise in early trial",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44849129",
    "title": "Ch.at – A lightweight LLM chat service accessible through HTTP, SSH, DNS and API",
    "url": "https://ch.at/",
    "summary": "生成摘要时出错",
    "chinese_title": "Ch.at – A lightweight LLM chat service accessible through HTTP, SSH, DNS and API",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44854525",
    "title": "Booting 5000 Erlangs on Ampere One 192-core",
    "url": "https://underjord.io/booting-5000-erlangs-on-ampere-one.html",
    "summary": "生成摘要时出错",
    "chinese_title": "Booting 5000 Erlangs on Ampere One 192-core",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44818501",
    "title": "ECScape: Understanding IAM Privilege Boundaries in Amazon ECS",
    "url": "https://www.sweet.security/blog/ecscape-understanding-iam-privilege-boundaries-in-amazon-ecs",
    "summary": "生成摘要时出错",
    "chinese_title": "ECScape: Understanding IAM Privilege Boundaries in Amazon ECS",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44864592",
    "title": "British backpacker pleads guilty to killing man while drunk on e-scooter",
    "url": "https://www.bbc.com/news/articles/c0e999y7vq2o",
    "summary": "生成摘要时出错",
    "chinese_title": "British backpacker pleads guilty to killing man while drunk on e-scooter",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44810890",
    "title": "Don't “let it crash”, let it heal",
    "url": "https://www.zachdaniel.dev/p/elixir-misconceptions-1",
    "summary": "生成摘要时出错",
    "chinese_title": "Don't “let it crash”, let it heal",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44854035",
    "title": "Writing simple tab-completions for Bash and Zsh",
    "url": "https://mill-build.org/blog/14-bash-zsh-completion.html",
    "summary": "生成摘要时出错",
    "chinese_title": "Writing simple tab-completions for Bash and Zsh",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44853064",
    "title": "Abogen – Generate audiobooks from EPUBs, PDFs and text",
    "url": "https://github.com/denizsafak/abogen",
    "summary": "生成摘要时出错",
    "chinese_title": "Abogen – Generate audiobooks from EPUBs, PDFs and text",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44860000",
    "title": "Flock Now Using AI to Report to Police If Our Movement Patterns Are \"Suspicious\"",
    "url": "https://www.aclu.org/news/national-security/surveillance-company-flock-now-using-ai-to-report-us-to-police-if-it-thinks-our-movement-patterns-are-suspicious",
    "summary": "生成摘要时出错",
    "chinese_title": "Flock Now Using AI to Report to Police If Our Movement Patterns Are \"Suspicious\"",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44866492",
    "title": "v0.dev is now v0.app",
    "url": "https://twitter.com/v0/status/1954942203471831448",
    "summary": "生成摘要时出错",
    "chinese_title": "v0.dev is now v0.app",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44845251",
    "title": "An engineer's perspective on hiring",
    "url": "https://jyn.dev/an-engineers-perspective-on-hiring",
    "summary": "生成摘要时出错",
    "chinese_title": "An engineer's perspective on hiring",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44848782",
    "title": "Debian 13 “Trixie”",
    "url": "https://www.debian.org/News/2025/20250809",
    "summary": "生成摘要时出错",
    "chinese_title": "Debian 13 “Trixie”",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44857100",
    "title": "Conversations remotely detected from cell phone vibrations, researchers report",
    "url": "https://www.psu.edu/news/engineering/story/conversations-remotely-detected-cell-phone-vibrations-researchers-report",
    "summary": "生成摘要时出错",
    "chinese_title": "Conversations remotely detected from cell phone vibrations, researchers report",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44809166",
    "title": "How I use Tailscale",
    "url": "https://chameth.com/how-i-use-tailscale/",
    "summary": "生成摘要时出错",
    "chinese_title": "How I use Tailscale",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44863380",
    "title": "Cybertruck deactivated on road after a cease and desist for using it in a song",
    "url": "https://old.reddit.com/r/CyberStuck/comments/1mmbq9w/lets_go_ahead_and_deactivate_here_looks_like_a/",
    "summary": "生成摘要时出错",
    "chinese_title": "Cybertruck deactivated on road after a cease and desist for using it in a song",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44846281",
    "title": "Show HN: The current sky at your approximate location, as a CSS gradient",
    "url": "https://sky.dlazaro.ca",
    "summary": "生成摘要时出错",
    "chinese_title": "Show HN: The current sky at your approximate location, as a CSS gradient",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44811567",
    "title": "Claude Code IDE integration for Emacs",
    "url": "https://github.com/manzaltu/claude-code-ide.el",
    "summary": "生成摘要时出错",
    "chinese_title": "Claude Code IDE integration for Emacs",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44864268",
    "title": "Google TV operating system struggling to generate revenue",
    "url": "https://thestreamable.com/google-tv-operating-system-struggling",
    "summary": "生成摘要时出错",
    "chinese_title": "Google TV operating system struggling to generate revenue",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44847001",
    "title": "ESP32 Bus Pirate 0.5 – A hardware hacking tool that speaks every protocol",
    "url": "https://github.com/geo-tp/ESP32-Bus-Pirate",
    "summary": "生成摘要时出错",
    "chinese_title": "ESP32 Bus Pirate 0.5 – A hardware hacking tool that speaks every protocol",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44853184",
    "title": "POML: Prompt Orchestration Markup Language",
    "url": "https://github.com/microsoft/poml",
    "summary": "生成摘要时出错",
    "chinese_title": "POML: Prompt Orchestration Markup Language",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44864157",
    "title": "I Scraped 4M Jobs",
    "url": "https://old.reddit.com/r/resumes/comments/1mmy44q/i_scraped_4_million_jobs/",
    "summary": "生成摘要时出错",
    "chinese_title": "I Scraped 4M Jobs",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44824088",
    "title": "People returned to live in Pompeii's ruins, archaeologists say",
    "url": "https://www.bbc.com/news/articles/c62wx23y2v1o",
    "summary": "生成摘要时出错",
    "chinese_title": "People returned to live in Pompeii's ruins, archaeologists say",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44806422",
    "title": "Car has more than 1.2M km on it – and it's still going strong",
    "url": "https://www.cbc.ca/news/canada/nova-scotia/1985-toyota-tercel-high-mileage-1.7597168",
    "summary": "生成摘要时出错",
    "chinese_title": "Car has more than 1.2M km on it – and it's still going strong",
    "chinese_summary": "生成摘要时出错"
  }
]