[
  {
    "id": "45149049",
    "title": "996",
    "url": "https://lucumr.pocoo.org/2025/9/4/996/",
    "summary": "Armin Ronacher's blog post \"996\" discusses the problematic trend of companies promoting a \"996\" work culture (working from 9 am to 9 pm, six days a week). He acknowledges his own love for intense work and late-night hacking, but argues that it shouldn't be the standard or a positive sign of a company.\n\nRonacher emphasizes the importance of work-life balance, particularly for those with families and personal interests. He distinguishes between the dedication of a founder, whose risks and leverage differ from employees, and the expectation of employees to adhere to such grueling schedules. He criticizes founders who promote this model as irresponsible.\n\nHe argues that success is a marathon, not a sprint, and that sustainable productivity matters more than hours spent in the office. While he enjoys occasional all-nighters, he stresses that they should be a personal choice, not a company culture requirement, acknowledging the unproductive aftermath they create. Ultimately, Ronacher advocates for pushing back against the promotion of 996 work cultures, emphasizing the unsustainable and potentially harmful nature of this model. He believes output and fulfillment matter more than sheer hours worked.\n",
    "chinese_title": "996",
    "chinese_summary": "Armin Ronacher 的博文《996》讨论了公司推崇“996”工作文化（早 9 点到晚 9 点，每周工作 6 天）这种有问题的趋势。他承认自己热爱高强度工作和深夜编程，但认为这不应成为常态或公司的积极标志。\n\nRonacher 强调了工作与生活平衡的重要性，特别是对于有家庭和个人兴趣的人来说。他区分了创始人的奉献精神（他们的风险和杠杆与员工不同）以及期望员工遵守如此艰苦的作息时间之间的区别。他批评那些推崇这种模式的创始人是不负责任的。\n\n他认为成功是一场马拉松，而不是短跑，可持续的生产力比在办公室里花费的时间更重要。虽然他喜欢偶尔通宵，但他强调这应该是个人的选择，而不是公司文化的要求，并承认它们造成的生产力低下后果。最终，Ronacher 倡导抵制对 996 工作文化的推崇，强调这种模式的不可持续性和潜在危害性。他认为产出和满足感比单纯的工作时长更重要。"
  },
  {
    "id": "45149281",
    "title": "DuckDuckGo founder: AI surveillance should be banned",
    "url": "https://gabrielweinberg.com/p/ai-surveillance-should-be-banned",
    "summary": "In this article, the founder of DuckDuckGo argues for a ban on AI surveillance, highlighting the amplified privacy risks compared to traditional online tracking. He contends that AI chatbots, due to their conversational nature and ability to gather detailed personal information, create comprehensive personality profiles vulnerable to manipulation, both commercially and politically. He points out that these profiles can be exploited to influence users with tailored arguments and subtle product recommendations.\n\nHe emphasizes that privacy debates surrounding search engines apply even more acutely to AI chats. While DuckDuckGo offers protected chatbot conversations and anonymous AI-assisted search, he notes privacy breaches are already occurring, citing examples like Grok's leaked conversations and Perplexity's vulnerability to hacking. He warns about OpenAI's vision for a comprehensive \"super assistant\" and Anthropic's default training on user conversations.\n\nThe author calls for swift Congressional action to ensure protected chats become standard practice, given the U.S.'s lack of general online privacy laws. He warns that further delay will entrench harmful privacy practices, mirroring the issues seen with online tracking. He concludes that DuckDuckGo will continue to offer privacy-respecting services, including AI, to users seeking online productivity without sacrificing privacy. He advocates for banning AI surveillance before it's too late.\n",
    "chinese_title": "DuckDuckGo创始人：应禁止人工智能监控",
    "chinese_summary": "本文中，DuckDuckGo的创始人主张禁止人工智能监控，强调其相比传统在线追踪放大了隐私风险。他认为，由于人工智能聊天机器人的对话特性和收集详细个人信息的能力，它们会创建全面的性格侧写，容易受到商业和政治操纵。他指出，这些侧写可能被利用，通过定制化的论点和微妙的产品推荐来影响用户。\n\n他强调，围绕搜索引擎的隐私辩论更适用于人工智能聊天。虽然DuckDuckGo提供受保护的聊天机器人对话和匿名人工智能辅助搜索，但他指出，隐私泄露已经发生，并引用了Grok泄露的对话和Perplexity易受黑客攻击等例子。他警告说，OpenAI设想的全面“超级助手”以及Anthropic默认对用户对话的训练。\n\n鉴于美国缺乏通用的在线隐私法，作者呼吁国会迅速采取行动，确保受保护的聊天成为标准做法。他警告说，进一步拖延将巩固有害的隐私实践，重蹈在线追踪的覆辙。他总结说，DuckDuckGo将继续为寻求在线效率而不牺牲隐私的用户提供尊重隐私的服务，包括人工智能。他主张在为时已晚之前禁止人工智能监控。"
  },
  {
    "id": "45148237",
    "title": "Qwen3 30B A3B Hits 13 token/s on 4xRaspberry Pi 5",
    "url": "https://github.com/b4rtaz/distributed-llama/discussions/255",
    "summary": "This document details an experiment where the Qwen3 30B A3B language model was successfully run on a cluster of four Raspberry Pi 5 8GB devices. The experiment utilized the Distributed Llama framework (version 0.16.0) and the model was quantized to Q40. The Raspberry Pis were connected via a TP-Link switch and distributed the workload.\n\nThe main result highlighted is the performance achieved: the system reached 14.33 tokens/second during evaluation and 13.04 tokens/second during prediction. The document provides the specific command used to run the inference and shows the detailed output, including the network initialization, weight loading, and token generation process. It indicates the memory requirement for the model, CPU features being used, and synchronization times between the distributed workers. The prompt used for inference was a simple question about the location of Poland. The response generated by the model places Poland in geographical context relative to other countries.\n\nThe document also shows the architecture and configuration of the model (Qwen3 MoE, including parameters like hidden dimension, number of layers and heads, and rope theta) and provides version information for the distributed llama setup.\n",
    "chinese_title": "Qwen3 30B A3B 在 4 个树莓派 5 上达到 13 token/s",
    "chinese_summary": "本文详细描述了一项实验，该实验成功地在由四台树莓派5 8GB设备组成的集群上运行了Qwen3 30B A3B语言模型。该实验使用了Distributed Llama框架（版本0.16.0），并将模型量化到Q40。树莓派通过TP-Link交换机连接并分配工作负载。\n\n主要结果强调了所实现的性能：系统在评估期间达到了14.33 tokens/秒，在预测期间达到了13.04 tokens/秒。本文档提供了用于运行推理的具体命令，并展示了详细的输出，包括网络初始化、权重加载和令牌生成过程。它指出了模型的内存需求、正在使用的CPU特性以及分布式工作节点之间的同步时间。用于推理的提示是一个关于波兰位置的简单问题。模型生成的响应将波兰置于相对于其他国家的地理环境中。\n\n本文档还展示了模型的架构和配置（Qwen3 MoE，包括隐藏维度、层数和头数以及rope theta等参数），并提供了分布式llama设置的版本信息。"
  },
  {
    "id": "45110311",
    "title": "The maths you need to start understanding LLMs",
    "url": "https://www.gilesthomas.com/2025/09/maths-for-llms",
    "summary": "This blog post by Giles explains the essential math needed to understand how Large Language Models (LLMs) function, focusing on inference (using an existing AI) rather than the training process. It targets readers with a basic tech background but without in-depth AI knowledge.\n\nThe core concepts covered are vectors and high-dimensional spaces. Vectors, beyond being arrays of numbers, represent distance and direction in n-dimensional space, and in LLMs they represent logits and meanings. Giles introduces \"vocab space,\" where logits (likelihood of the next token) are represented as vectors, highlighting both \"messy\" (unnormalised) and tidy (normalised) versions of vocab space. One-hot vectors, where only one element is set to one, are also introduced as a concept.\n\nThe post then delves into \"embedding spaces,\" where vectors represent meanings, with similar concepts clustered together. The length of these vectors is not always crucial; direction matters more.\n\nNext, Giles explains how matrices, stacked vectors, are used for projections between different multidimensional spaces via matrix multiplication. Specifically, a d1×d2 matrix projects from a d1-dimensional space to a d2-dimensional space. He emphasizes that such projections can be lossy, meaning information can be lost during dimension reduction.\n\nFinally, the post connects matrix multiplication to neural networks, showing that a single layer calculation, when simplified, is essentially a matrix multiplication, reinforcing the importance of matrices in understanding LLMs. The weight matrix in the neural network serves a similar purpose to the projection matrices, facilitating transformation and abstraction.\n",
    "chinese_title": "理解大型语言模型所需的数学基础",
    "chinese_summary": "Giles 的这篇博文解释了理解大型语言模型 (LLM) 如何运作所需的基本数学知识，重点在于推理（使用现有 AI），而非训练过程。它面向具有基本技术背景但没有深入 AI 知识的读者。\n\n涵盖的核心概念是向量和高维空间。向量不仅仅是数字数组，还代表 n 维空间中的距离和方向，在 LLM 中，它们代表 logits 和含义。Giles 介绍了“词汇空间”，其中 logits（下一个 token 的可能性）被表示为向量，并重点介绍了“混乱”（未归一化）和整洁（归一化）版本的词汇空间。独热向量，即只有一个元素设置为 1 的向量，也被作为一个概念引入。\n\n该文章随后深入探讨了“嵌入空间”，其中向量代表含义，相似的概念聚集在一起。这些向量的长度并不总是关键；方向更重要。\n\n接下来，Giles 解释了矩阵（堆叠的向量）如何通过矩阵乘法用于不同多维空间之间的投影。具体来说，一个 d1×d2 矩阵将 d1 维空间投影到 d2 维空间。他强调，这种投影可能是有损的，这意味着信息可能在降维过程中丢失。\n\n最后，该文章将矩阵乘法与神经网络联系起来，表明一个单层计算，在简化后，本质上是一个矩阵乘法，从而强调了矩阵在理解 LLM 中的重要性。神经网络中的权重矩阵的作用类似于投影矩阵，有助于转换和抽象。"
  },
  {
    "id": "45149626",
    "title": "Oldest Recorded Transaction",
    "url": "https://avi.im/blag/2025/oldest-txn/",
    "summary": "The article explores the limitations of modern databases in handling extremely old dates, prompted by an image of a 5,000-year-old Sumerian transaction record. The author investigates the oldest timestamp supported by MySQL, Postgres, and SQLite. MySQL's limit is 1000 AD, while Postgres and SQLite, leveraging the Julian calendar, can go back to January 1, 4713 BC.\n\nThe author successfully inserts the date 4713 BC into Postgres and SQLite but encounters an error when attempting to insert 4714 BC, indicating the lower bound of these databases. This limitation raises the question of how to store and manage dates older than 4713 BC, such as for historical records in institutions like the British Museum.\n\nThe article considers potential solutions, including storing dates as epoch timestamps, text strings, or utilizing a custom system. A key challenge is maintaining the functionality of standard TIMESTAMP operations when using these alternative storage methods. The author concludes by acknowledging contributors and citing the source of the initial image and a relevant talk by Joran Dirk Greef.\n",
    "chinese_title": "最早记录的交易",
    "chinese_summary": "这篇文章探讨了现代数据库在处理极其古老日期时的局限性，起因是一张5000年前的苏美尔交易记录图片。作者调查了MySQL、Postgres和SQLite支持的最早时间戳。MySQL的限制是公元1000年，而Postgres和SQLite利用儒略历，可以追溯到公元前4713年1月1日。\n\n作者成功地将公元前4713年插入到Postgres和SQLite中，但在尝试插入公元前4714年时遇到错误，表明了这些数据库的下限。这一限制引发了如何存储和管理比公元前4713年更早的日期的问题，例如英国博物馆等机构的历史记录。\n\n文章考虑了潜在的解决方案，包括将日期存储为 epoch 时间戳、文本字符串或使用自定义系统。一个关键的挑战是在使用这些替代存储方法时，如何保持标准 TIMESTAMP 操作的功能。作者最后感谢了贡献者，并引用了初始图片来源和 Joran Dirk Greef 的相关演讲。"
  },
  {
    "id": "45142885",
    "title": "Anthropic agrees to pay $1.5B to settle lawsuit with book authors",
    "url": "https://www.nytimes.com/2025/09/05/technology/anthropic-settlement-copyright-ai.html?unlocked_article_code=1.jk8.bTTt.Zir9wmtPaTp2&smid=url-share",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "Anthropic 同意支付 15 亿美元与图书作者达成和解",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "45150759",
    "title": "Zuckerberg Caught in Revealing Hot Mic Moment During White House Dinner",
    "url": "https://www.pcmag.com/news/zuckerberg-caught-in-revealing-hot-mic-moment-during-white-house-dinner",
    "summary": "The article reports on a recent White House dinner attended by prominent tech CEOs, including Mark Zuckerberg, Sundar Pichai, and Satya Nadella, where they discussed AI investment with President Trump. A \"hot mic\" moment caught Zuckerberg appearing unprepared when Trump asked about Meta's investment plans, leading to Zuckerberg suggesting a potentially inflated figure of $600 billion by 2028. This number seems ambitious given Meta's previously stated financial projections. Other CEOs also shared their investment plans, with Pichai claiming Google's investment is \"well north of $100 billion\" and will grow to $250 billion in two years, and Nadella mentioning Microsoft's consistent $80 billion annual investment.\n\nThe dinner also touched on the challenges of powering the growing number of data centers required for AI development. Trump promised to cut red tape on electrical permits to support tech companies, while communities are protesting data center expansion near their homes. The rising cost of electricity due to data center growth is also highlighted, with household bills expected to increase significantly in several states.\n",
    "chinese_title": "扎克伯格在白宫晚宴上被意外录到私下谈话",
    "chinese_summary": "白宫晚宴：科技巨头与特朗普讨论AI投资，扎克伯格或夸大Meta投资额"
  },
  {
    "id": "45148944",
    "title": "We Hacked Burger King: How Auth Bypass Led to Drive-Thru Audio Surveillance",
    "url": "https://bobdahacker.com/blog/rbi-hacked-drive-thrus/",
    "summary": "Okay, here's a summary of the \"We Hacked Burger King: How Auth Bypass Led to Drive-Thru Audio Surveillance\" article based on the content available at the provided URL:\n\nThe author, BobDaHacker, details how they discovered and exploited a vulnerability in Restaurant Brands International (RBI)'s online ordering platform, which impacted Burger King drive-thrus. The vulnerability allowed them to bypass authentication and gain access to sensitive customer data and even listen to live audio feeds from the drive-thru intercoms.\n\nThe initial vulnerability stemmed from an improperly implemented API endpoint used for employee authentication and menu updates. By manipulating API requests, the author was able to impersonate restaurant managers without needing valid credentials. This unauthorized access granted them the ability to view restaurant-specific data, including sales figures, employee information (usernames, hashed passwords), and, critically, the configuration settings for the drive-thru communication system.\n\nThe most concerning aspect of the exploit was the ability to listen to live audio from the drive-thru. The author found API endpoints designed for remote monitoring and maintenance of the drive-thru system, which included access to the live audio feed. This allowed them to eavesdrop on customer orders and conversations happening at the drive-thru windows, raising serious privacy concerns.\n\nThe author responsibly disclosed the vulnerabilities to RBI, who acknowledged the issue and implemented fixes. The blog post details the technical steps taken to identify and exploit the vulnerabilities, emphasizing the importance of proper authentication and authorization mechanisms in online systems, particularly those handling sensitive customer data and potentially enabling audio surveillance. The author also recommends RBI conduct regular security audits and penetration testing to prevent similar vulnerabilities in the future.\n",
    "chinese_title": "我们黑了汉堡王：认证绕过如何导致了得来速音频监控",
    "chinese_summary": "好的，以下是基于所提供URL内容对“我们入侵了汉堡王：认证绕过如何导致得来速语音监控”文章的总结作者BobDaHacker详细描述了他们如何发现并利用Restaurant Brands International (RBI) 在线订购平台上的一个漏洞，该漏洞影响了汉堡王的得来速服务。该漏洞使他们能够绕过身份验证，访问敏感的客户数据，甚至可以收听来自得来速对讲机的实时音频流。\n\n最初的漏洞源于一个未正确实施的API端点，该端点用于员工身份验证和菜单更新。通过操纵API请求，作者能够在不需要有效凭据的情况下冒充餐厅经理。这种未经授权的访问使他们能够查看餐厅的特定数据，包括销售额、员工信息（用户名、哈希密码），以及关键的得来速通信系统的配置设置。\n\n该漏洞利用最令人担忧的方面是能够收听来自得来速的实时音频。作者发现了为远程监控和维护得来速系统而设计的API端点，其中包括访问实时音频流的权限。这使他们能够窃听顾客在得来速窗口的订单和对话，引发了严重的隐私问题。\n\n作者负责任地向RBI披露了这些漏洞，RBI承认了这个问题并实施了修复。该博客文章详细介绍了识别和利用这些漏洞的技术步骤，强调了在线系统中正确身份验证和授权机制的重要性，特别是那些处理敏感客户数据并可能启用音频监控的系统。作者还建议RBI进行定期的安全审计和渗透测试，以防止将来出现类似的漏洞。"
  },
  {
    "id": "45148167",
    "title": "Let us git rid of it, angry GitHub users say of forced Copilot features",
    "url": "https://www.theregister.com/2025/09/05/github_copilot_complaints/",
    "summary": "This article reports on growing discontent among GitHub users regarding the forced integration of Microsoft's AI service, Copilot. A popular community discussion thread requests a way to block Copilot from generating issues and pull requests, while another addresses the inability to disable Copilot code reviews. These requests remain unanswered, fueling user frustration.\n\nDeveloper Andi McClure voices concerns about Copilot training on GitHub-posted code and the intrusion of Copilot \"ads\" into their workflow. Other developers echo concerns about Copilot's potential to spread inaccuracies, copyright issues stemming from code suggestions, and the lack of code correctness guarantees. Several projects, including Servo, GNOME's Loupe, FreeBSD, Gentoo, NetBSD, and QEMU, have banned AI code contributions due to these issues.\n\nThe article notes that dissatisfaction with Copilot's integration, coupled with GitHub's integration into Microsoft's CoreAI group, is pushing developers toward alternative platforms like Codeberg and self-hosted Forgejo instances. The Software Freedom Conservancy (SFC) has long advocated for moving away from GitHub. Some developers are already relocating their code and replacing their GitHub repositories with relocation notices.\n\nThe article concludes with McClure's observation that Microsoft's strategy of enabling features by default and repeatedly reintroducing them after users disable them is exacerbating the problem. She suggests the only way to avoid Copilot is to cease using any Microsoft product where it appears, although this is difficult due to GitHub's near-monopoly and network effects. Ultimately, developers are concerned that Microsoft's push for AI metrics is overshadowing customer retention.\n",
    "chinese_title": "让我们摆脱它，愤怒的GitHub用户们如是说，针对强制Copilot功能。",
    "chinese_summary": "本文报道了GitHub用户对强制整合微软AI服务Copilot日益增长的不满。一个热门社区讨论帖要求提供一种方法来阻止Copilot生成问题和拉取请求，而另一个则指出无法禁用Copilot代码审查。这些请求尚未得到回应，加剧了用户的沮丧。\n\n开发者Andi McClure对Copilot基于GitHub发布的代码进行训练以及Copilot“广告”入侵其工作流程表示担忧。其他开发者也对Copilot传播不准确信息、代码建议引发的版权问题以及缺乏代码正确性保证表示担忧。包括Servo、GNOME的Loupe、FreeBSD、Gentoo、NetBSD和QEMU在内的多个项目已禁止AI代码贡献，原因正是这些问题。\n\n文章指出，对Copilot整合的不满，加上GitHub整合到微软CoreAI集团，正推动开发者转向替代平台，如Codeberg和自托管的Forgejo实例。软件自由保护协会(SFC)长期以来一直倡导远离GitHub。一些开发者已经迁移了他们的代码，并用搬迁通知替换了他们的GitHub仓库。\n\n文章最后提到McClure的观察，即微软默认启用功能并在用户禁用后反复重新引入这些功能的策略正在加剧问题。她认为，避免Copilot的唯一方法是停止使用任何出现它的微软产品，尽管由于GitHub近乎垄断和网络效应，这很困难。最终，开发者担心微软对AI指标的推动正在掩盖客户保留。"
  },
  {
    "id": "45113531",
    "title": "Baby's first type checker",
    "url": "https://austinhenley.com/blog/babytypechecker.html",
    "summary": "This article presents a \"baby type checker\" implementation in Python, walking through the process of building a basic type checking tool. It explains how type checking works, highlighting its role in catching errors early and serving as documentation. Unlike languages like C++, Python doesn't have a built-in type checker, relying on runtime errors or third-party tools.\n\nThe article outlines the approach: parsing Python code using the `ast` module, identifying type annotations, and verifying type compatibility.  It introduces the `SymbolCollector` class, an `ast.NodeVisitor` subclass, to find and save type annotations for functions and variables. The core logic revolves around checking assignments and function calls.\n\nThe article covers essential aspects like handling primitive types, lists, dictionaries, and type unions. It defines a compatibility check (`is_compatible`) to ensure assigned types match declared types.  The code examples showcase how to extend the type checker to support various data structures and operations, like indexing and type inference for literals. It demonstrates how the type checker identifies type errors in example Python code snippets. The article guides the reader through the incremental development of the type checker, highlighting the challenges and complexities involved in type checking, and provides links to the complete code on GitHub.\n",
    "chinese_title": "宝宝的第一个类型检查器",
    "chinese_summary": "本文介绍了一个Python中“婴儿类型检查器”的实现，逐步讲解构建一个基本类型检查工具的过程。它解释了类型检查的工作原理，强调了它在及早发现错误和充当文档方面的作用。与C++等语言不同，Python没有内置的类型检查器，而是依赖于运行时错误或第三方工具。\n\n本文概述了该方法：使用`ast`模块解析Python代码，识别类型注解，并验证类型兼容性。它介绍了`SymbolCollector`类，一个`ast.NodeVisitor`子类，用于查找和保存函数和变量的类型注解。核心逻辑围绕检查赋值和函数调用展开。\n\n本文涵盖了处理原始类型、列表、字典和类型联合等基本方面。它定义了一个兼容性检查(`is_compatible`)，以确保分配的类型与声明的类型匹配。代码示例展示了如何扩展类型检查器以支持各种数据结构和操作，例如索引和字面量的类型推断。它演示了类型检查器如何在示例Python代码片段中识别类型错误。本文引导读者逐步开发类型检查器，强调了类型检查中涉及的挑战和复杂性，并提供了GitHub上完整代码的链接。"
  },
  {
    "id": "45146967",
    "title": "Rug pulls, forks, and open-source feudalism",
    "url": "https://lwn.net/SubscriberLink/1036465/e80ebbc4cee39bfb/",
    "summary": "This LWN.net article from September 5, 2025, discusses power dynamics in open-source software development, focusing on \"rug pulls\" (relicensing to a more restrictive license) and \"forks\" (creating a new project from the existing code) as tactics to shift power. Dawn Foster presented at the 2025 Open Source Summit Europe, highlighting how companies, especially cloud providers, can exploit their power over smaller companies, contributors, and users.\n\nThe article details examples like Elastic's relicensing of Elasticsearch (leading to Amazon's OpenSearch fork), Hashicorp's Terraform (resulting in the OpenTofu fork), and Redis (leading to the Valkey fork). Foster analyzed contributor makeup before and after these events, finding that forks started by users or with pre-existing external contributors were more successful in building active communities.\n\nFoster advises contributors and users to be wary of Contributor License Agreements (CLAs) that grant companies relicensing power, to favor projects with neutral governance and diverse contributor bases, and to actively contribute to the projects they rely on. The article concludes that while relicensing is used to counter cloud provider dominance, it can harm contributors, who then rely on forking as a means to regain control. It also notes a discussion about whether the SSPL license is a free license, with commentators disagreeing over its definition and restrictions.\n",
    "chinese_title": "Rug pulls、分叉和开源封建主义",
    "chinese_summary": "这篇2025年9月5日发表于LWN.net的文章探讨了开源软件开发中的权力动态，重点关注“拔地毯”（重新许可为更严格的许可证）和“分叉”（从现有代码创建新项目）作为转移权力的策略。Dawn Foster在2025年欧洲开源峰会上发表讲话，强调了公司，尤其是云提供商，如何利用其对小型公司、贡献者和用户的权力。\n\n该文章详细介绍了Elastic重新许可Elasticsearch（导致亚马逊的OpenSearch分叉）、Hashicorp的Terraform（导致OpenTofu分叉）和Redis（导致Valkey分叉）等案例。Foster分析了这些事件发生前后贡献者的构成，发现由用户发起或拥有先前存在的外部贡献者的分叉，在建立活跃社区方面更成功。\n\nFoster建议贡献者和用户警惕授予公司重新许可权力的贡献者许可协议（CLA），偏爱具有中立治理和多样化贡献者基础的项目，并积极为他们依赖的项目做出贡献。文章总结说，虽然重新许可被用来对抗云提供商的统治地位，但它可能会损害贡献者，他们随后依赖分叉作为重新获得控制权的一种手段。文章还提到了一场关于SSPL许可证是否为自由许可证的讨论，评论员对其定义和限制意见不一。"
  },
  {
    "id": "45106951",
    "title": "Our love letter to Internet Relay Chat [video]",
    "url": "https://www.youtube.com/watch?v=6UbKenFipjo",
    "summary": "This appears to be a YouTube video titled \"Our love letter to Internet Relay Chat\" and the provided \"Content\" is simply the standard YouTube footer information.\n\nTherefore, a summary about the video's *content* is impossible based solely on the information provided. We only know:\n\n*   **Title:** The video is a \"love letter\" to Internet Relay Chat (IRC). This suggests it's likely a positive or nostalgic look at IRC.\n*   **Platform:** The video is hosted on YouTube.\n*   **Standard YouTube Legal Information:** The included text is the standard YouTube boilerplate relating to copyright, legal terms, advertising, developers, privacy, safety, and Google's overall copyright. This *doesn't* tell us anything about the video's content.\n\nTo get a proper summary, one would need to watch the video itself.\n",
    "chinese_title": "我们写给互联网中继聊天的一封情书 [视频]",
    "chinese_summary": "这似乎是一个名为“我们写给互联网中继聊天的情书”的YouTube视频，而提供的“内容”仅仅是标准的YouTube页脚信息。\n\n因此，仅凭提供的信息无法对视频的*内容*进行总结。我们只知道：\n\n*   **标题：** 视频是一封献给互联网中继聊天（IRC）的“情书”。这表明它很可能对IRC持积极或怀旧的态度。\n*   **平台：** 该视频托管在YouTube上。\n*   **标准的YouTube法律信息：** 包含的文本是关于版权、法律条款、广告、开发者、隐私、安全以及谷歌整体版权的标准YouTube声明。这*并不能*告诉我们任何关于视频内容的信息。\n\n要获得适当的摘要，需要观看视频本身。"
  },
  {
    "id": "45111273",
    "title": "Speeding up Unreal Editor launch by not spawning unused tooltips",
    "url": "https://larstofus.com/2025/09/02/speeding-up-the-unreal-editor-launch-by-not-spawning-38000-tooltips/",
    "summary": "This article discusses a method to speed up Unreal Editor startup times by optimizing tooltip creation. The author discovered that the editor creates a large number of tooltips (around 38,000 in a simple project) during startup, even though most are never used. This process involves spawning complete tooltip widgets, including sub-widgets and helper objects, consuming significant time and memory.\n\nThe author proposes a solution where the tooltip text is saved as an attribute instead of immediately spawning the widget. The actual widget creation is deferred to when the tooltip is needed, i.e., when the user hovers over the relevant UI element.\n\nThis \"on-demand\" creation significantly reduces startup time without noticeably impacting runtime performance. The author argues that users are unlikely to access all tooltips in a single session, and the creation of a single tooltip is fast enough (0.05ms in debug builds) not to affect frame rates.\n\nThe author provides a link to a pull request with the proposed code changes and mentions an update clarifying that many tooltips originate from optional sources like the Project Settings and Editor Preferences panels. Closing these panels can reduce the number of tooltips created during startup, leading to faster loading times.\n",
    "chinese_title": "不生成未使用的工具提示来加速Unreal Editor的启动",
    "chinese_summary": "本文探讨了一种通过优化工具提示创建来加速 Unreal Editor 启动时间的方法。作者发现编辑器在启动期间会创建大量工具提示（在一个简单的项目中大约 38,000 个），即使大多数从未使用过。此过程涉及生成完整的工具提示小部件，包括子小部件和辅助对象，从而消耗大量时间和内存。\n\n作者提出了一种解决方案，即将工具提示文本保存为属性，而不是立即生成小部件。实际的小部件创建被推迟到需要工具提示时，即当用户将鼠标悬停在相关的 UI 元素上时。\n\n这种“按需”创建显著减少了启动时间，而不会明显影响运行时性能。作者认为用户不太可能在单个会话中访问所有工具提示，并且创建单个工具提示的速度足够快（在调试版本中为 0.05 毫秒），不会影响帧速率。\n\n作者提供了包含建议代码更改的 pull request 的链接，并提到了一项更新，澄清了许多工具提示来自可选来源，例如项目设置和编辑器首选项面板。关闭这些面板可以减少启动期间创建的工具提示数量，从而加快加载速度。"
  },
  {
    "id": "45148180",
    "title": "A Software Development Methodology for Disciplined LLM Collaboration",
    "url": "https://github.com/Varietyz/Disciplined-AI-Software-Development",
    "summary": "This document outlines a \"Disciplined AI Software Development Methodology\" designed to address issues like code bloat, architectural drift, and context dilution when collaborating with AI models in software development. The methodology emphasizes systematic constraints and empirical validation across four stages.\n\n**Stage 1 (AI Configuration)** involves setting up custom instructions for the AI model using `AI-PREFERENCES.md` to establish behavioral constraints and uncertainty flagging.\n\n**Stage 2 (Collaborative Planning)** focuses on working with the AI to define project scope, identify components, structure phases logically, and generate systematic tasks with measurable checkpoints, documented in `METHODOLOGY.md`.\n\n**Stage 3 (Systematic Implementation)** involves implementing components phase by phase, keeping file sizes under 150 lines to improve context management and focus. This includes a request-validate-benchmark-continue flow.\n\n**Stage 4 (Data-Driven Iteration)** utilizes a benchmarking suite (built in Phase 0) to provide performance data, which is then fed back to the AI for optimization based on measurements.\n\nThe methodology promotes decision processing based on focused requests, context management through small files and bounded problems, empirical validation using performance data, and systematic constraints with architectural checkpoints and file size limits.\n\nThe document includes examples of projects developed using this methodology, implementation steps, quality assurance measures, and a project state extraction tool (`project_extract.py`) to generate structured codebase snapshots for sharing with the AI. It also includes a FAQ section and a flowchart to visualize the workflow.\n",
    "chinese_title": "用于规范LLM协作的软件开发方法",
    "chinese_summary": "本文档概述了一种“严谨的AI软件开发方法”，旨在解决在软件开发中与AI模型协作时遇到的代码膨胀、架构漂移和上下文稀释等问题。该方法强调在四个阶段中进行系统性约束和实证验证。\n\n**阶段1（AI配置）** 涉及使用 `AI-PREFERENCES.md` 为AI模型设置自定义指令，以建立行为约束和不确定性标记。\n\n**阶段2（协作计划）** 侧重于与AI合作定义项目范围、识别组件、合理构建阶段，以及生成带有可衡量检查点的系统性任务，并记录在 `METHODOLOGY.md` 中。\n\n**阶段3（系统化实施）** 涉及按阶段实施组件，将文件大小保持在150行以下，以提高上下文管理和专注度。这包括请求-验证-基准测试-继续的流程。\n\n**阶段4（数据驱动迭代）** 利用基准测试套件（在阶段0中构建）提供性能数据，然后将数据反馈给AI，以便根据测量结果进行优化。\n\n该方法提倡基于聚焦请求的决策处理、通过小文件和有限问题进行上下文管理、使用性能数据进行实证验证，以及通过架构检查点和文件大小限制进行系统性约束。\n\n该文档包括使用此方法开发的项目示例、实施步骤、质量保证措施以及项目状态提取工具 (`project_extract.py`)，用于生成结构化的代码库快照，以便与AI共享。它还包括一个FAQ部分和一个流程图，以可视化工作流程。"
  },
  {
    "id": "45114498",
    "title": "Video Game Blurs (and how the best one works)",
    "url": "https://blog.frost.kiwi/dual-kawase/",
    "summary": "This article introduces the importance of blurs in video game post-processing, used for effects like Depth of Field, Bloom, and GUI elements. It aims to guide readers through the evolution of real-time blurring techniques, highlighting the trade-offs between mathematical theory and technological limitations.\n\nThe article uses interactive WebGL visualizations to demonstrate different blurring techniques and their performance characteristics. It focuses on implementing real-time blurs and exploring various techniques, culminating in a discussion of the Dual Kawase Blur algorithm.\n\nThe interactive demo allows users to experiment with different modes (Scene, Lights, Bloom) to see how blur algorithms perform in various use cases. Users can adjust parameters like light brightness and observe the impact on performance (FPS, frametime) and visual quality. The article also provides insights into the shader code used for these blurring techniques.\n\nThe starting point demonstrates a scene rendering without any blur applied, setting the stage for implementing and comparing different blur algorithms in subsequent sections. The article also touches on the performance considerations of different blur techniques and their suitability for various applications.\n",
    "chinese_title": "游戏模糊效果（以及最佳效果的实现原理）",
    "chinese_summary": "本文介绍了模糊在视频游戏后处理中的重要性，它被用于景深、泛光和GUI元素等效果。文章旨在引导读者了解实时模糊技术的演变，强调数学理论与技术限制之间的权衡。\n\n文章使用交互式WebGL可视化来演示不同的模糊技术及其性能特征。它侧重于实现实时模糊，并探索各种技术，最终讨论双Kawase模糊算法。\n\n交互式演示允许用户试验不同的模式（场景、光照、泛光），以了解模糊算法在各种用例中的表现。用户可以调整光照亮度等参数，并观察其对性能（FPS、帧时间）和视觉质量的影响。文章还提供了用于这些模糊技术的着色器代码的见解。\n\n起始点演示了一个未应用任何模糊的场景渲染，为后续章节中实施和比较不同的模糊算法奠定了基础。文章还涉及了不同模糊技术的性能考量及其对各种应用的适用性。"
  },
  {
    "id": "45121581",
    "title": "Novel hollow-core optical fiber transmits data faster with record low loss",
    "url": "https://phys.org/news/2025-09-hollow-core-optical-fiber-transmits.html",
    "summary": "This September 2, 2025, Phys.org article reports a significant breakthrough in hollow-core optical fiber (HCF) technology, potentially revolutionizing data transmission. Researchers from the University of Southampton and Microsoft have developed a novel HCF design achieving a record low loss of 0.091 dB/km at 1,550 nm, surpassing the 0.14 dB/km minimum loss of traditional silica-based fibers. This new fiber also boasts 45% faster transmission speeds and maintains low losses of around 0.2 dB/km over a 66 THz bandwidth.\n\nThe innovation addresses the limitations of silica-core fibers, which have stagnated in loss reduction over the past 40 years. While HCFs theoretically offer faster speeds due to light traveling faster in air, previous designs struggled to outperform silica cables. This new design, a nested antiresonant nodeless hollow core fiber (DNANF), overcomes these challenges through advanced modeling that minimizes leakage, surface scattering, and microbending.\n\nThe low loss achieved allows signals to travel further without amplification, leading to faster internet, more efficient networks, and potential for low-loss transmission at previously inaccessible wavelengths. Researchers believe that further improvements could reduce losses to as low as 0.01 dB/km. Potential applications include longer unamplified spans in undersea and terrestrial cables, high-power laser delivery, and sensing. The authors express confidence that with increased production volumes and improved geometrical consistency, DNANF HCFs will become a pivotal waveguiding technology. The study was published in *Nature Photonics* (DOI: 10.1038/s41566-025-01747-5).\n",
    "chinese_title": "新型空芯光纤以创纪录的低损耗更快地传输数据",
    "chinese_summary": "2025年9月2日Phys.org文章报道，空芯光纤(HCF)技术取得重大突破，有望彻底改变数据传输。南安普顿大学和微软的研究人员开发出一种新型HCF设计，在1550纳米波长下实现了0.091分贝/公里的创纪录低损耗，超过了传统硅基光纤0.14分贝/公里的最低损耗。这种新型光纤还拥有快45%的传输速度，并在66太赫兹带宽内保持0.2分贝/公里左右的低损耗。\n\n该创新解决了硅芯光纤的局限性，过去40年来，硅芯光纤在降低损耗方面一直停滞不前。虽然理论上HCF由于光在空气中传播速度更快而提供更快的速度，但以前的设计难以超越硅电缆的性能。这种新型设计，一种嵌套反谐振无节点空芯光纤(DNANF)，通过先进的建模最大限度地减少泄漏、表面散射和微弯，克服了这些挑战。\n\n所实现的低损耗使得信号能够在无需放大的情况下传输更远的距离，从而实现更快的互联网、更高效的网络，并有可能在以前无法访问的波长下实现低损耗传输。研究人员认为，进一步的改进可以将损耗降低到低至0.01分贝/公里。潜在的应用包括海底和陆地电缆中更长的未放大跨度、高功率激光传输和传感。作者表示，随着产量的增加和几何一致性的提高，DNANF HCF将成为关键的波导技术。该研究发表在《自然·光子学》(Nature Photonics)上（DOI: 10.1038/s41566-025-01747-5）。"
  },
  {
    "id": "45145794",
    "title": "Developing a Space Flight Simulator in Clojure",
    "url": "https://www.wedesoft.de/software/2025/09/05/clojure-game/",
    "summary": "This article details the development of a space flight simulator in Clojure over the past 5 years. The author, inspired by Orbiter 2016, chose Clojure for its immutability, parallelism features, fast data structures, and multi-methods. The initial focus was on tackling complex graphics rendering: planets, atmospheres, shadows, and volumetric clouds, using OpenGL and knowledge gained from inspecting Orbiter's open-source code.\n\nThe project utilizes various Clojure and Java libraries, including LWJGL for graphics, Jolt Physics for physics simulations, Fastmath for mathematical operations, Comb for shader templating, and Instaparse/Gloss for parsing NASA's space data. A significant portion of the development involved efficient rendering of planet surfaces using NASA's Bluemarble and elevation data, which required generating and managing a large number of map tiles. The atmosphere rendering employs Bruneton's precomputed atmospheric scattering, with computationally intensive table generation parallelized using `pmap`.\n\nPerformance optimization strategies include using the ZGC garbage collector, enabling reflection warnings and unchecked math warnings, and leveraging `clj-async-profiler` for identifying bottlenecks. The project uses `tools.build` for managing builds and generating an Uberjar, and Packr for creating native executables for Linux and Windows. Steam deployment involves creating multiple depots for data and platform-specific binaries. Future work includes adding more detailed graphics, sound effects, and additional celestial bodies, as well as exploring modding capabilities. The source code is available on Github, and the game can be wishlisted.\n",
    "chinese_title": "使用Clojure开发太空飞行模拟器",
    "chinese_summary": "本文详细介绍了过去五年用Clojure开发太空飞行模拟器的过程。作者受Orbiter 2016的启发，选择Clojure是因为其不变性、并行特性、快速数据结构和多方法。最初的重点是解决复杂的图形渲染问题：行星、大气层、阴影和体积云，使用了OpenGL以及从检查Orbiter的开源代码中获得的知识。\n\n该项目使用了各种Clojure和Java库，包括用于图形的LWJGL、用于物理模拟的Jolt Physics、用于数学运算的Fastmath、用于着色器模板的Comb以及用于解析NASA空间数据的Instaparse/Gloss。开发的一个重要部分是使用NASA的Bluemarble和高程数据高效渲染行星表面，这需要生成和管理大量的地图瓦片。大气渲染采用了Bruneton的预计算大气散射，其中计算密集型表格生成使用`pmap`进行并行化。\n\n性能优化策略包括使用ZGC垃圾收集器、启用反射警告和未检查的数学警告，以及利用`clj-async-profiler`来识别瓶颈。该项目使用`tools.build`来管理构建和生成Uberjar，并使用Packr为Linux和Windows创建原生可执行文件。Steam部署涉及创建多个存储仓库来存放数据和平台特定的二进制文件。未来的工作包括添加更详细的图形、音效和更多的天体，以及探索Modding功能。源代码可在Github上找到，游戏可以被加入愿望单。"
  },
  {
    "id": "45144337",
    "title": "The Universe Within 12.5 Light Years",
    "url": "http://www.atlasoftheuniverse.com/12lys.html",
    "summary": "This article presents an overview of the stars located within 12.5 light-years of our Sun. It highlights that there are 33 stars within this radius, with the majority being dim red dwarfs, which constitute about 80% of all stars in the universe. Proxima Centauri, the closest star to the Sun, is a typical red dwarf.\n\nThe article includes links to additional maps showing the Earth's location relative to these stars and a map of stars within 20 light-years. It also offers data and catalogs with a list of stars within 20 light-years and animations of multiple star systems.\n\nIndividual entries describe various notable stars, including the Sun, Proxima Centauri (a flare star and part of the Alpha Centauri system), Alpha Centauri A and B (a bright binary system), Barnard's Star (known for its high proper motion), Wolf 359, Lalande 21185, Sirius A and B (the brightest star in the night sky with a white dwarf companion), Luyten 726-8 A and B (a flare star system), Ross 154, Ross 248, Epsilon Eridani (with evidence of a possible solar system and a detected Jupiter-sized planet), Lacaille 9352, Ross 128, Luyten 789-6 A, B, C (a triple red dwarf system), Procyon A and B, 61 Cygni A and B, Struve 2398 A and B, Groombridge 34 A and B, Giclas 51-15, Epsilon Indi A, B, C (orbited by brown dwarfs), Tau Ceti and Luyten 372-58, Luyten 725-32 and Luyten's Star.. Each entry details the star's type, magnitude, distance, and any unique characteristics or historical significance. Several stars were noted for being flare stars. Also, the article notes that some were subject to research for signs of intelligent life.\n",
    "chinese_title": "12.5光年内的宇宙",
    "chinese_summary": "本文概述了距离太阳12.5光年内的恒星。该文强调，在此半径范围内有33颗恒星，其中绝大多数是昏暗的红矮星，约占宇宙中所有恒星的80%。比邻星是距离太阳最近的恒星，也是一颗典型的红矮星。\n\n本文包含指向其他地图的链接，这些地图显示了地球相对于这些恒星的位置以及20光年内的恒星地图。此外，本文还提供了数据和目录，其中包含20光年内的恒星列表以及多星系统的动画。\n\n各个条目描述了各种著名的恒星，包括太阳、比邻星（一颗耀星，也是半人马座α星系统的一部分）、半人马座α星A和B（一个明亮的双星系统）、巴纳德星（以其高自行而闻名）、沃尔夫359、拉兰德21185、天狼星A和B（夜空中最亮的恒星，拥有一颗白矮星伴星）、Luyten 726-8 A和B（一个耀星系统）、罗斯154、罗斯248、天苑星（有证据表明可能存在太阳系，并探测到一颗木星大小的行星）、拉卡伊9352、罗斯128、Luyten 789-6 A、B、C（一个三红矮星系统）、南河三A和B、天鹅座61 A和B、Struve 2398 A和B、Groombridge 34 A和B、Giclas 51-15、印第安座ε星A、B、C（被棕矮星环绕）、鲸鱼座τ星以及Luyten 372-58、Luyten 725-32和卢伊滕星。每个条目都详细介绍了恒星的类型、星等、距离以及任何独特的特征或历史意义。有几颗恒星因是耀星而备受关注。此外，文章指出，一些恒星曾被研究是否存在智慧生命的迹象。"
  },
  {
    "id": "45139088",
    "title": "Purposeful animations",
    "url": "https://emilkowal.ski/ui/you-dont-need-animations",
    "summary": "This article emphasizes the importance of purposeful and well-executed animations in user interfaces. While animations can enhance user experience by making interfaces feel responsive, predictable, and enjoyable, they can also be detrimental if used carelessly.\n\nThe core message is that animations should always serve a purpose, whether it's to explain a feature, provide feedback, or add a touch of delight. Before implementing an animation, it's crucial to consider its frequency of use. Animations used repeatedly can become annoying and slow users down, making no animation the optimal solution in some cases, especially for frequently used features like Raycast's command menu.\n\nThe article also highlights the significance of speed. UI animations, especially those related to core functionality, should be fast (under 300ms) to improve perceived performance and maintain responsiveness. A faster animation makes the app seem to react faster. Tooltips are used as a prime example. The initial delay should be present to avoid the tooltip showing up randomly and without a purpose. Consecutive tooltips should however open with no animation.\n\nUltimately, the goal is to create user-friendly interfaces, and while animations can play a role in this, they should be carefully considered and implemented with purpose, frequency, and speed in mind. Sometimes, the best animation is no animation at all.\n",
    "chinese_title": "富有目的性的动画",
    "chinese_summary": "本文强调在用户界面中使用有目的且精心设计的动画的重要性。虽然动画可以通过使界面感觉反应灵敏、可预测和令人愉快来增强用户体验，但如果使用不当，也会产生不利影响。\n\n核心信息是动画应始终服务于某个目的，无论是解释功能、提供反馈还是增添一丝乐趣。在实施动画之前，至关重要的是要考虑其使用频率。重复使用的动画可能会变得令人烦恼并降低用户速度，在某些情况下，不使用动画才是最佳解决方案，特别是对于像 Raycast 的命令菜单这样经常使用的功能。\n\n本文还强调了速度的重要性。用户界面动画，尤其是与核心功能相关的动画，应快速（低于 300 毫秒）以提高感知性能并保持响应速度。更快的动画使应用程序看起来反应更快。工具提示被用作一个主要例子。初始延迟应该存在，以避免工具提示随机且无目的地出现。然而，连续的工具提示应该在没有动画的情况下打开。\n\n最终目标是创建用户友好的界面，虽然动画可以在其中发挥作用，但应仔细考虑并在考虑到目的、频率和速度的情况下实施。有时，最好的动画就是没有动画。"
  },
  {
    "id": "45145457",
    "title": "GLM 4.5 with Claude Code",
    "url": "https://docs.z.ai/guides/llm/glm-4.5",
    "summary": "This document introduces GLM-4.5, a new language model from Z.AI designed for agent-oriented applications, particularly for Claude Code users with a premium coding experience starting at $3/month. GLM-4.5 leverages a Mixture-of-Experts (MoE) architecture and comes in several versions, including GLM-4.5, GLM-4.5-Air, GLM-4.5-X, GLM-4.5-AirX, and GLM-4.5-Flash. It is trained on 15 trillion tokens and fine-tuned for code, reasoning, and agent tasks, with a context length of 128k tokens.\n\nKey capabilities include deep thinking, streaming output, function calls, context caching, and structured output (JSON). GLM-4.5 integrates advanced reasoning, coding, and agent capabilities, ranking highly in benchmark tests. It boasts higher parameter efficiency than competitors like DeepSeek-R1 and Kimi-K2, achieving top performance with fewer parameters. Its API is priced starting at $0.2 per million input tokens and $1.1 per million output tokens, with high-speed versions exceeding 100 tokens per second.\n\nReal-world evaluations show GLM-4.5 demonstrating competitive performance in agent coding scenarios, especially in tool invocation and task completion rate. The model supports coding skills in Python, JavaScript, and Java. Users can control the \"Thinking Mode\" for varying complexity levels via the `thinking.type` parameter. The document provides code samples (cURL, Python, Java) for basic and streaming API calls.\n",
    "chinese_title": "GLM 4.5与Claude代码",
    "chinese_summary": "本文介绍了GLM-4.5，这是Z.AI推出的新型语言模型，专为面向Agent的应用设计，尤其为Claude Code用户提供优质编码体验，起价为每月3美元。GLM-4.5采用混合专家模型（MoE）架构，并提供多个版本，包括GLM-4.5、GLM-4.5-Air、GLM-4.5-X、GLM-4.5-AirX和GLM-4.5-Flash。它在15万亿个tokens上进行训练，并针对代码、推理和Agent任务进行微调，上下文长度为128k个tokens。\n\n主要功能包括深度思考、流式输出、函数调用、上下文缓存和结构化输出（JSON）。GLM-4.5集成了先进的推理、编码和Agent能力，在基准测试中名列前茅。它比DeepSeek-R1和Kimi-K2等竞争对手拥有更高的参数效率，以更少的参数实现顶级性能。其API定价为每百万输入tokens 0.2美元起，每百万输出tokens 1.1美元起，高速版本超过每秒100个tokens。\n\n实际评估表明，GLM-4.5在Agent编码场景中表现出极具竞争力的性能，尤其是在工具调用和任务完成率方面。该模型支持Python、JavaScript和Java的编码技能。用户可以通过`thinking.type`参数控制“思考模式”，以适应不同的复杂程度。本文档提供了基本API调用和流式API调用的代码示例（cURL、Python、Java）。"
  },
  {
    "id": "45141636",
    "title": "Making a font of my handwriting",
    "url": "https://chameth.com/making-a-font-of-my-handwriting/",
    "summary": "Chris Smith wanted to personalize his website with a handwritten font. He initially attempted to create one using open-source tools Inkscape and FontForge. He found FontForge's UI frustrating and Inkscape's path manipulation too complex.\n\nFrustrated with open-source options, he opted for the closed-source, hosted tool Calligraphr. Calligraphr uses printed templates filled in by the user, which are then scanned and processed. The author paid for a month's access to the pro version, taking advantage of their one-time payment option.\n\nHe used a Sharpie to fill in the templates, aiming for a scrapbook look. He iterated on the font using Calligraphr's tools, adjusting baseline, scaling, and letter spacing. He also added custom ligatures. Testing the font on a local copy of his website proved more effective than using Calligraphr's preview. He described the process as rewarding and worth the time commitment.\n\nThe final font captured his handwriting style and was surprisingly legible. He was impressed by Calligraphr's user-friendly business practices, including their upfront pricing, lack of auto-renewal, and automatic data export. The article ends with a recommendation for Calligraphr and a preview of the font being used on the headers, captions, and other places.\n",
    "chinese_title": "制作我的手写字体",
    "chinese_summary": "克里斯·史密斯想用手写字体来个性化他的网站。他最初尝试使用开源工具Inkscape和FontForge创建字体。但他发现FontForge的用户界面令人沮丧，Inkscape的路径操作也过于复杂。\n\n由于对开源选项感到沮丧，他选择了闭源的在线工具Calligraphr。Calligraphr使用用户填写的打印模板，然后进行扫描和处理。作者付费购买了一个月的专业版使用权，利用了他们的一次性付款选项。\n\n他用Sharpie笔填写模板，力求达到剪贴簿的效果。他使用Calligraphr的工具迭代调整字体，包括基线、缩放和字母间距。他还添加了自定义连字。在本地网站副本上测试字体比使用Calligraphr的预览更有效。他认为这个过程很有意义，并且值得投入时间。\n\n最终的字体捕捉到了他的手写风格，并且出乎意料地清晰易读。他对Calligraphr友好的商业实践印象深刻，包括他们透明的定价、取消自动续订以及自动数据导出。文章最后推荐了Calligraphr，并预览了该字体在标题、说明文字和其他位置的使用效果。"
  },
  {
    "id": "45104988",
    "title": "Meschers: Geometry Processing of Impossible Objects",
    "url": "https://anadodik.github.io/publication/meschers/",
    "summary": "This article introduces \"Meschers,\" a novel geometry representation for processing impossible objects, those geometric constructions that appear plausible to humans but are physically impossible. Unlike existing methods that involve cutting or bending objects in 3D space (which can disrupt geometry and relighting), Meschers leverage the principle that impossible objects are locally integrable but not globally.\n\nThe representation consists of a mesh storing 2D screen-space positions for vertices and depth differences for edges. Critically, the sum of depth differences around a mesh loop need not be zero, capturing the \"impossibility\" mathematically. This enables the application of discrete geometry processing operators, like a Laplacian, directly on the impossible object.\n\nThe article highlights several applications of Meschers: smoothing, geodesic distance queries, and heat diffusion, demonstrating the preservation of geometric properties absent in cut or bent representations. Notably, the authors demonstrate the use of inverse rendering to deform a possible object (a torus) into an impossible one (triangle), driven by a target image, thus producing a measurable and verifiable impossibility. The theoretical underpinning of Meschers lies in discrete exterior calculus.\n",
    "chinese_title": "梅谢尔斯：不可能物体的几何处理",
    "chinese_summary": "本文介绍了一种名为“Meschers”的新型几何表示法，用于处理不可能物体——那些对人类来说似乎合理但物理上不可能的几何结构。与现有涉及在3D空间中切割或弯曲物体的方法（可能破坏几何结构和重新光照）不同，“Meschers”利用了不可能物体局部可积分但全局不可积分的原理。\n\n该表示法由一个网格组成，网格存储顶点的2D屏幕空间位置和边的深度差。关键在于，网格环路周围的深度差之和不必为零，从而在数学上捕捉到“不可能”性。这使得可以将离散几何处理算子（例如拉普拉斯算子）直接应用于不可能物体。\n\n本文重点介绍了“Meschers”的几种应用：平滑、测地距离查询和热扩散，展示了在切割或弯曲表示中不存在的几何属性的保留。值得注意的是，作者演示了如何使用逆向渲染将一个可能的物体（一个圆环）变形为一个不可能的物体（三角形），由目标图像驱动，从而产生一个可测量和可验证的不可能性。“Meschers”的理论基础在于离散外微分。"
  },
  {
    "id": "45140381",
    "title": "MentraOS – open-source Smart glasses OS",
    "url": "https://github.com/Mentra-Community/MentraOS",
    "summary": "MentraOS is an open-source operating system designed for smart glasses, aiming to provide a unified platform for developers. It supports various smart glasses models, including Even Realities G1, Mentra Mach 1, and Mentra Live, with a growing compatibility list. The Mentra Store offers a variety of readily available apps like Live Captions, Merge, Notes, and Translation.\n\nThe core value proposition of MentraOS is to enable developers to \"write once, run on any smart glasses.\" It handles the complexities of pairing, data streaming, and cross-compatibility, allowing developers to focus on app creation using a TypeScript SDK, promising faster development times. Developers gain control over smart glasses I/O, including displays, microphones, cameras, and speakers. MentraOS also provides a distribution channel through the Mentra Store, connecting developers with smart glass users.\n\nThe MentraOS Community encourages collaboration and contribution to building an open, cross-compatible, and user-controlled platform for smart glasses. Developers can join the community via Discord, and are welcome to contribute to the project through pull requests, following the provided Contributors Guide. The project is licensed under the MIT license and supported by Mentra Labs.\n",
    "chinese_title": "MentraOS – 开源智能眼镜操作系统",
    "chinese_summary": "MentraOS：面向智能眼镜的开源操作系统，旨在为开发者提供统一平台。它支持包括Even Realities G1、Mentra Mach 1和Mentra Live在内的多种智能眼镜型号，并且兼容型号列表不断增长。Mentra商店提供各种现成可用的应用程序，例如实时字幕、Merge、Notes和翻译。\n\nMentraOS的核心价值在于使开发者能够“一次编写，随处运行”。它处理配对、数据流和交叉兼容性的复杂性，使开发者能够专注于使用TypeScript SDK进行应用程序创建，从而缩短开发时间。开发者可以控制智能眼镜的I/O，包括显示器、麦克风、摄像头和扬声器。MentraOS还通过Mentra商店提供分发渠道，将开发者与智能眼镜用户连接起来。\n\nMentraOS社区鼓励协作和贡献，以构建一个开放、交叉兼容且用户可控的智能眼镜平台。开发者可以通过Discord加入社区，并欢迎通过pull request为项目做出贡献，请遵循提供的贡献者指南。该项目采用MIT许可证授权，并由Mentra Labs提供支持。"
  },
  {
    "id": "45142397",
    "title": "My Own DNS Server at Home – Part 1: IPv4",
    "url": "https://jan.wildeboer.net/2025/08/My-DNS-Part-1/",
    "summary": "This article is a guide on setting up a private DNS server using BIND on a Raspberry Pi 4 within a home network to achieve digital sovereignty. The author, Jan Wildeboer, shares his experience configuring BIND to serve three networks: the main home network (192.168.1.0/24), a second ethernet network (172.16.0.0/16), and the Podman container network (10.88.0.0/16).\n\nThe setup involves installing BIND and necessary utilities, opening the firewall for DNS traffic, and configuring four key files: `/etc/named.conf` (the main configuration file), `/var/named/forward.homelab.jhw` (forward zone file for hostname-to-IP mapping), `/var/named/reverse.homelab.jhw` (reverse zone file for IP-to-hostname mapping for 192.168.1.0/24) and `/var/named/reverse2.homelab.jhw` (reverse zone file for IP-to-hostname mapping for 172.16.0.0/16).  The author uses fritz.box for DHCP entries but creates a local domain homelab.jhw for the lab network.\n\nThe article meticulously explains each section of the configuration files, highlighting the importance of the serial number in zone files and the trailing dot in hostname records. It also includes examples of A records (mapping hostnames to IP addresses) and CNAME records (creating aliases). Finally, reverse zones (PTR records) map IP addresses back to hostnames.  The article emphasizes the importance of incrementing the serial number in the zone files with every change and provides commands for checking the configuration and starting the BIND service.\n",
    "chinese_title": "我家自建 DNS 服务器 – 第一部分：IPv4",
    "chinese_summary": "本文是一篇关于在家庭网络中使用树莓派 4 上的 BIND 设置私有 DNS 服务器以实现数字主权的指南。作者 Jan Wildeboer 分享了他配置 BIND 为三个网络提供服务的经验：主家庭网络 (192.168.1.0/24)、第二个以太网网络 (172.16.0.0/16) 和 Podman 容器网络 (10.88.0.0/16)。\n\n该设置包括安装 BIND 和必要的实用程序，为 DNS 流量打开防火墙，以及配置四个关键文件：`/etc/named.conf`（主配置文件）、`/var/named/forward.homelab.jhw`（用于主机名到 IP 地址映射的正向区域文件）、`/var/named/reverse.homelab.jhw`（用于 192.168.1.0/24 的 IP 地址到主机名映射的反向区域文件）和 `/var/named/reverse2.homelab.jhw`（用于 172.16.0.0/16 的 IP 地址到主机名映射的反向区域文件）。作者使用 fritz.box 进行 DHCP 条目，但为实验室网络创建了一个本地域名 homelab.jhw。\n\n本文详细解释了配置文件的每个部分，强调了区域文件中序列号的重要性以及主机名记录中的尾随点。 它还包括 A 记录（将主机名映射到 IP 地址）和 CNAME 记录（创建别名）的示例。 最后，反向区域（PTR 记录）将 IP 地址映射回主机名。 本文强调了每次更改时增加区域文件中序列号的重要性，并提供了用于检查配置和启动 BIND 服务的命令。"
  },
  {
    "id": "45136103",
    "title": "I bought the cheapest EV, a used Nissan Leaf",
    "url": "https://www.jeffgeerling.com/blog/2025/i-bought-cheapest-ev-used-nissan-leaf",
    "summary": "The author bought a used 2023 Nissan Leaf SV Plus in 2025 for $17,000 (effectively $11,000 after trade-in and tax rebate), citing price as the primary factor despite researching EVs for a decade. They previously owned several used gas cars driven \"into the ground\" and now have a short commute. The Leaf, despite its age, offered convenience features like lane following, adaptive cruise control, and CarPlay/Android Auto.\n\nThey detail various accessories purchased to enhance the EV experience, including a Level 2 charger, portable charger, charging adapters (NACS to J1772 and CCS1 to CHAdeMO), and a dashcam. Battery health monitoring is emphasized using a LeLink 2 OBD-II adapter and the LeafSpy Pro app, with the author's battery showing a 93.16% State of Health (SoH). They also discuss strategies to extend battery life, such as limiting fast charging and keeping the charge between 50-80%.\n\nThe author highlights both the joys (one-pedal driving, torque, quiet operation, lower maintenance, conveniences) and pains (price, range anxiety, lack of charging standards, ugly EV designs, cable clutter) of owning an EV. Specific gripes about the Leaf include the lack of a physical play/pause button, difficulty shifting into neutral, and limited tailgate opening options. They conclude that while the Leaf is perfect for their needs, they wouldn't recommend EVs for most car owners due to cost and infrastructure limitations.\n",
    "chinese_title": "我买了最便宜的电动汽车，一辆二手日产聆风。",
    "chinese_summary": "作者于2025年以17,000美元（抵扣旧车和退税后实际为11,000美元）购入一辆2023年二手尼桑聆风SV Plus，并表示价格是主要考虑因素，尽管他们已经研究电动汽车十年。他们之前拥有几辆报废的二手燃油车，现在通勤距离很短。这辆聆风尽管有些年份，但提供了车道保持、自适应巡航控制以及CarPlay/Android Auto等便利功能。\n\n他们详细介绍了为提升电动汽车体验而购买的各种配件，包括二级充电器、便携式充电器、充电适配器（NACS转J1772和CCS1转CHAdeMO）以及行车记录仪。电池健康监测是重点，他们使用LeLink 2 OBD-II适配器和LeafSpy Pro应用程序，作者的电池显示出93.16%的健康状态(SoH)。他们还讨论了延长电池寿命的策略，例如限制快速充电并将充电量保持在50-80%之间。\n\n作者强调了拥有电动汽车的乐趣（单踏板驾驶、扭矩、安静运行、更低的维护成本、便利性）和痛苦（价格、里程焦虑、缺乏充电标准、丑陋的电动汽车设计、电缆杂乱）。关于聆风的具体抱怨包括缺少物理播放/暂停按钮、难以换入空挡以及有限的后备箱开启选项。他们总结说，虽然聆风非常适合他们的需求，但由于成本和基础设施的限制，他们不建议大多数车主购买电动汽车。"
  },
  {
    "id": "45120786",
    "title": "What Is the Fourier Transform?",
    "url": "https://www.quantamagazine.org/what-is-the-fourier-transform-20250903/",
    "summary": "This article, \"What Is the Fourier Transform?\", explains the Fourier transform and its significance across various fields. Developed by Jean-Baptiste Joseph Fourier in the early 1800s, the Fourier transform decomposes any function into its constituent frequencies or simple waves. This allows for the analysis of complex signals by breaking them down into simpler components.\n\nThe article illustrates this with the analogy of the human ear separating sounds into different pitches and the ability to decompose functions mathematically, even those with sharp edges. The transform works by scanning all possible frequencies and determining how much each contributes to the original function.\n\nThe Fourier transform has far-reaching applications. It's used in signal processing (audio compression, noise reduction), image compression (JPEG), medical imaging (MRI), and detecting gravitational waves. It also forms the foundation of the uncertainty principle in quantum mechanics. In mathematics, it has led to the field of harmonic analysis and has unexpected connections to number theory, aiding in the study of prime number distribution. The fast Fourier transform algorithm significantly sped up its practical implementation, making it ubiquitous in modern technology and scientific research.\n",
    "chinese_title": "什么是傅里叶变换？",
    "chinese_summary": "这篇文章《什么是傅里叶变换？》解释了傅里叶变换及其在各个领域的重要性。傅里叶变换由让-巴蒂斯特·约瑟夫·傅里叶于19世纪初发展而来，它可以将任何函数分解成其组成频率或简谐波。这使得通过将复杂信号分解为更简单的成分来分析它们成为可能。\n\n文章用人耳将声音分离成不同音高的类比，以及数学上分解函数（即使是具有尖锐边缘的函数）的能力来说明了这一点。该变换通过扫描所有可能的频率并确定每个频率对原始函数的贡献程度来实现。\n\n傅里叶变换具有广泛的应用。它被用于信号处理（音频压缩、降噪）、图像压缩（JPEG）、医学成像（MRI）和引力波探测。它也是量子力学中不确定性原理的基础。在数学中，它导致了调和分析领域，并与数论有着意想不到的联系，有助于素数分布的研究。快速傅里叶变换算法极大地加快了它的实际应用，使其在现代技术和科学研究中无处不在。"
  },
  {
    "id": "45139656",
    "title": "Protobuffers Are Wrong (2018)",
    "url": "https://reasonablypolymorphic.com/blog/protos-are-wrong/",
    "summary": "This article argues against the use of Protocol Buffers (Protobufs), claiming they are poorly designed, ad-hoc, and solve a problem only Google truly faces. The author, a former Google employee, criticizes Protobufs' type system as being weak and restrictive, drawing parallels to Java's flawed type system.\n\nA major criticism is Protobufs' lack of compositionality, citing numerous arbitrary restrictions on features like `oneof` and `map` fields, stemming from unprincipled design and bolted-on features. The author proposes a simpler, more powerful type system based on required fields (product types), standalone `oneof` types (coproduct types), and type parameterization.\n\nThe article also critiques Protobufs' treatment of scalar and message types, highlighting the inability to distinguish between unset and default values for scalars, and the bizarre accessor behavior for message types, breaking expected programming laws. The author further argues that `oneof` fields don't function as proper coproduct types, leading to potential bugs and hindering generic, polymorphic code.\n\nThe author dismisses Protobufs' touted backwards- and forwards-compatibility as a \"lie,\" achieved by being overly permissive and silently doing the wrong thing by default, shifting sanity-checking responsibilities to the entire codebase. The article argues that while Google's scale may justify the byte-saving optimizations of Protobufs, most companies are far too small to warrant the associated engineer time wasted.\n\nFinally, the article contends that Protobufs contaminate codebases by forcing developers to choose between maintaining separate, evolving data types or directly using the wire format within the application, hindering the use of richer data structures and programming techniques.\n",
    "chinese_title": "Protobuf有问题 (2018)",
    "chinese_summary": "本文论证了反对使用 Protocol Buffers (Protobufs) 的理由，声称其设计拙劣、临时拼凑，并且解决的问题只有 Google 真正面临。作者，一位前 Google 员工，批评 Protobufs 的类型系统薄弱且具有限制性，并将其与 Java 有缺陷的类型系统相提并论。\n\n一个主要的批评是 Protobufs 缺乏组合性，并列举了对 `oneof` 和 `map` 字段等功能的众多任意限制，这些限制源于无原则的设计和后期附加的功能。作者提出了一种更简单、更强大的类型系统，该系统基于必需字段（乘积类型）、独立的 `oneof` 类型（共积类型）和类型参数化。\n\n文章还批评了 Protobufs 对标量和消息类型的处理方式，强调了无法区分标量的未设置值和默认值，以及消息类型的怪异访问器行为，打破了预期的编程规则。作者进一步论证说，`oneof` 字段不能作为适当的共积类型发挥作用，导致潜在的错误并阻碍通用、多态代码。\n\n作者驳斥了 Protobufs 被吹捧的向后和向前兼容性，认为这是一种“谎言”，其实现方式是过度放任，默认情况下默默地做错事，并将健全性检查的责任转移到整个代码库。文章认为，虽然 Google 的规模可能证明 Protobufs 的字节节省优化是合理的，但大多数公司规模太小，不足以保证浪费相关的工程师时间。\n\n最后，文章认为 Protobufs 通过迫使开发人员选择维护单独的、不断发展的数据类型，或直接在应用程序中使用线路格式，从而污染了代码库，阻碍了更丰富的数据结构和编程技术的使用。"
  },
  {
    "id": "45137525",
    "title": "I ditched Docker for Podman",
    "url": "https://codesmash.dev/why-i-ditched-docker-for-podman-and-you-should-too",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "我弃用了Docker，转而使用Podman。",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "45144900",
    "title": "Tesla changes meaning of 'Full Self-Driving', gives up on promise of autonomy",
    "url": "https://electrek.co/2025/09/05/tesla-changes-meaning-full-self-driving-give-up-promise-autonomy/",
    "summary": "The article reports that Tesla has effectively abandoned its long-standing promise of full self-driving (FSD) capability, redefining the term to represent a supervised advanced driver-assistance system (ADAS) rather than unsupervised autonomy. Tesla has been selling \"Full Self-Driving Capability\" since 2016, with CEO Elon Musk repeatedly promising full autonomy by the end of each year. However, older vehicles (2016-2023) lack the necessary hardware, and the company now sells \"Full Self-Driving (Supervised),\" explicitly stating it's not autonomous.\n\nThe change in definition is further highlighted in a new CEO compensation package, where a milestone for Musk to earn stock options is tied to \"10 Million Active FSD Subscriptions.\" The definition of FSD within this package is vague, simply requiring an \"advanced driving system\" capable of \"autonomous or similar functionality,\" which the current supervised system could satisfy. Electrek argues this allows Tesla to potentially lower FSD prices and push more customers to purchase it, enriching Musk without delivering on the original promise.\n\nThe article also notes a trend of Tesla decreasing FSD prices as sales declined, a stark contrast to Musk's initial claim that prices would increase with feature improvements. The author considers this a potential case of false advertising. A top commenter highlights Tesla's history of technically correct but misleading announcements.\n",
    "chinese_title": "特斯拉改变“完全自动驾驶”的含义，放弃自动驾驶承诺",
    "chinese_summary": "文章报道称，特斯拉已实际上放弃了其长期承诺的完全自动驾驶（FSD）能力，重新定义该术语，将其代表一种受监督的高级驾驶辅助系统（ADAS），而非无人监督的自动驾驶。自2016年以来，特斯拉一直在销售“完全自动驾驶能力”，首席执行官埃隆·马斯克多次承诺在每年年底实现完全自动驾驶。然而，较旧的车辆（2016-2023年）缺乏必要的硬件，该公司现在销售“完全自动驾驶（受监督）”，明确声明它不是自动驾驶。\n\n这一定义的改变在新的首席执行官薪酬方案中得到进一步凸显，该方案将马斯克获得股票期权的里程碑与“1000万活跃的FSD订阅”挂钩。该方案中对FSD的定义含糊不清，仅要求一个能够实现“自动或类似功能”的“高级驾驶系统”，而当前受监督的系统可能满足这一要求。Electrek认为，这使得特斯拉有可能降低FSD价格，并推动更多客户购买它，从而使马斯克受益，而无需兑现最初的承诺。\n\n文章还指出，随着销量下降，特斯拉降低了FSD的价格，这与马斯克最初声称价格会随着功能改进而上涨的说法形成鲜明对比。作者认为这可能构成虚假宣传。一位顶级评论员强调了特斯拉在技术上正确但具有误导性的声明的历史。"
  },
  {
    "id": "45104018",
    "title": "Clarity or accuracy – what makes a good scientific image?",
    "url": "https://www.nature.com/articles/d41586-025-02757-7",
    "summary": "This article explores the complex relationship between clarity and accuracy in scientific imagery, using Anika Burgess's book \"Flashes of Brilliance\" as a springboard. The author, a science visualizer, reflects on how scientific images function not just as documentation, but as tools for discovery and communication. The article highlights the early use of photography to reveal previously unseen realities, such as Jacob Riis's images of tenement life in New York City.\n\nHowever, the piece emphasizes the potential for manipulation and misleading representations in images. The author discusses instances like Édouard Buguet's fraudulent \"spirit\" photographs and Eadweard Muybridge's edited horse motion sequences, questioning the integrity of images presented as scientific truth. While acknowledging Muybridge's contribution to understanding horse locomotion, the author stresses the importance of transparency about image manipulation in scientific contexts.\n\nThe article connects these historical examples to contemporary concerns, implicitly referencing issues like ethical AI in image creation, and highlights the tension between creating visually compelling images and maintaining scientific rigor. It draws a parallel to Susan Sontag's idea that photographs \"appropriate\" reality, shaping perceptions and influencing what is deemed important. The core message is that while striking visuals are powerful, their scientific value hinges on honest representation and clear communication of any alterations made.\n",
    "chinese_title": "清晰度还是准确性——什么造就好的科学图像？",
    "chinese_summary": "本文探讨了科学图像中清晰度和准确性之间复杂的关系，并以阿尼卡·伯吉斯（Anika Burgess）的著作《闪耀的光芒》（Flashes of Brilliance）为切入点。作者是一位科学可视化专家，反思了科学图像的功能，不仅将其视为文档，还将其视为发现和交流的工具。文章重点介绍了早期摄影技术在揭示以前未见过的现实方面的应用，例如雅各布·里斯（Jacob Riis）拍摄的纽约市廉租房生活图像。\n\n然而，本文强调了图像中操纵和误导性表达的可能性。作者讨论了诸如爱德华·布盖（Édouard Buguet）的欺诈性“灵魂”照片和埃德沃德·迈布里奇（Eadweard Muybridge）编辑过的马运动序列等案例，质疑了作为科学真理呈现的图像的完整性。在承认迈布里奇对理解马的运动的贡献的同时，作者强调了在科学背景下图像处理透明度的重要性。\n\n本文将这些历史例子与当代的担忧联系起来，隐含地提及了诸如图像创建中伦理人工智能等问题，并强调了创建视觉上引人注目的图像与保持科学严谨性之间的紧张关系。本文还与苏珊·桑塔格（Susan Sontag）的观点相呼应，即照片“挪用”现实，塑造人们的看法并影响什么被认为是重要的。核心信息是，虽然引人注目的视觉效果很强大，但它们的科学价值取决于诚实的表达和对所做任何修改的清晰沟通。"
  },
  {
    "id": "45137373",
    "title": "ML needs a new programming language – Interview with Chris Lattner",
    "url": "https://signalsandthreads.com/why-ml-needs-a-new-programming-language/",
    "summary": "This article is an interview with Chris Lattner, the creator of LLVM and Swift, by Ron Minsky of Jane Street. Lattner discusses his journey into computing, his love for compilers, and his unique perspective on the intersection of compiler engineering and language design.\n\nLattner emphasizes that his career has been driven by his evolving interests and a desire to solve useful problems. He explains his progression from LLVM to C++ and Swift, highlighting the value of building upon existing technologies. He was motivated to create Swift because he felt existing languages like C++ weren't ideal and that he had good ideas that he wanted to explore.\n\nThe interview delves into Lattner's philosophy on language design, particularly regarding features like pattern matching. He prioritizes utility and user experience over purely theoretical considerations, while acknowledging the importance of a strong mathematical foundation for generalization and composability.\n\nLattner sees the design process as a way to find truth and beauty in simplicity and coherence, comparing it to the pursuit of simple yet fundamental principles in physics. He talks about how this approach led him to rediscover known mathematical truths, and how design comes from an engineering perspective. The article highlights the iterative nature of language design and the importance of combining different perspectives to create powerful and useful tools.\n",
    "chinese_title": "机器学习需要一种新的编程语言——克里斯·拉特纳访谈",
    "chinese_summary": "本文是Jane Street的Ron Minsky对LLVM和Swift的创造者Chris Lattner的采访。Lattner在采访中谈论了他进入计算机领域的历程、对编译器的热爱以及他对编译器工程和语言设计交叉领域的独特见解。\n\nLattner强调，他的职业生涯是由他不断变化的兴趣和解决实际问题的愿望所驱动的。他解释了他从LLVM到C++再到Swift的演变过程，强调了在现有技术基础上进行构建的价值。他创建Swift的动机是，他认为像C++这样的现有语言并不理想，并且他有一些想要探索的好想法。\n\n采访深入探讨了Lattner的语言设计哲学，特别是关于模式匹配等特性。他优先考虑实用性和用户体验，而不是纯粹的理论考虑，同时他也承认强大的数学基础对于泛化和可组合性的重要性。\n\nLattner将设计过程视为在简洁和连贯性中寻找真理和美的方式，并将其比作物理学中对简单但基本原理的追求。他谈到这种方法如何引导他重新发现已知的数学真理，以及设计如何源于工程学的视角。本文突出了语言设计的迭代性质，以及结合不同视角来创建强大而有用的工具的重要性。"
  },
  {
    "id": "45098609",
    "title": "The Old Robots Web Site",
    "url": "https://www.theoldrobots.com/index2.html",
    "summary": "The \"Old Robots Web Site\" is a personal collection focused on robots, primarily toy and educational robots. The website, updated on January 14, 2008, serves as a repository for information and resources related to the owner's passion.\n\nKey features include:\n\n*   **Collection Showcase:** The site showcases the owner's robot collection, divided into categories like Tomy Toy Bots, other toy robots, educational/personal robots, and the popular Omnibot Robots. These sections are further subdivided into \"Misc\" pages and numbered \"Other Robots\" sections (I through VII), suggesting a large and diverse collection.\n*   **Navigational Structure:** The website is organized with a clear menu, including pages for Home, Guidelines, Links, News, Download, and a Wish List.\n*   **Educational Focus:** A dedicated section is present for \"Educational Robots,\" indicating an interest in the history and development of robots used in educational settings.\n",
    "chinese_title": "老旧机器人网站",
    "chinese_summary": "“老式机器人网站”是一个个人收藏网站，专注于机器人，主要是玩具和教育机器人。该网站于2008年1月14日更新，是与所有者热情相关的资料和资源的存储库。\n\n主要特点包括：\n\n*   **藏品展示：** 该网站展示了所有者的机器人藏品，分为Tomy玩具机器人、其他玩具机器人、教育/个人机器人和受欢迎的Omnibot机器人等类别。这些部分进一步细分为“杂项”页面和编号的“其他机器人”部分（I到VII），表明藏品数量庞大且种类繁多。\n*   **导航结构：** 该网站组织了一个清晰的菜单，包括主页、指南、链接、新闻、下载和愿望清单等页面。\n*   **教育重点：** 设有一个专门的“教育机器人”部分，表明对教育环境中使用的机器人的历史和发展的兴趣。"
  },
  {
    "id": "45107605",
    "title": "Museum of Color",
    "url": "https://emergencemagazine.org/essay/museum-of-color/",
    "summary": "This is a title and the identification of an essay. There is no actual essay content to summarize.\n\nBased solely on the information provided, we can deduce the following:\n\n*   **Title:** The essay is titled \"Antarctica the Woman.\"\n*   **Author:** The essay was written by Stephanie Krzywonos.\n*   **Date:** The essay was written on August 31, 2023.\n*   **Potential Subject:** Given the title, the essay likely explores Antarctica, potentially personifying it or analyzing it through a feminine lens. Without the essay itself, any further summarization is impossible.\n",
    "chinese_title": "色彩博物馆",
    "chinese_summary": "这是一个标题和文章信息的识别。没有实际的文章内容可以总结。\n\n根据提供的信息，我们可以推断出以下内容：\n\n*   **标题:** 该文章的标题为“南极洲，女人”。\n*   **作者:** 该文章由Stephanie Krzywonos撰写。\n*   **日期:** 该文章写于2023年8月31日。\n*   **潜在主题:** 鉴于标题，该文章可能探索南极洲，可能将其拟人化或通过女性视角对其进行分析。没有文章本身，任何进一步的总结都是不可能的。"
  },
  {
    "id": "45104985",
    "title": "Sparrow: C++20 Idiomatic APIs for the Apache Arrow Columnar Format",
    "url": "https://github.com/man-group/sparrow",
    "summary": "Sparrow is a C++20 library that provides idiomatic APIs for working with the Apache Arrow columnar format. It simplifies the creation, manipulation, and exchange of Arrow data structures within C++ applications.\n\nKey features and benefits include:\n\n*   **Idiomatic C++ APIs:** Sparrow offers a user-friendly C++ interface for interacting with Arrow data, abstracting away the complexities of the C interface.\n*   **Conversion Capabilities:** Facilitates easy conversion between Sparrow's array structures and the underlying Arrow C interface, enabling seamless integration with other Arrow-compatible libraries and systems.\n*   **Memory Management Options:** Supports both managed and unmanaged memory scenarios, allowing users to control the lifecycle of Arrow C structures. Users can either allow Sparrow to manage the memory or take responsibility for releasing the resources themselves.\n*   **Installation:** Installation via the mamba package manager or building from source using CMake.\n*   **Compiler Support:** Requires a modern C++ compiler, specifically Clang 18+, GCC 11.2+, Apple Clang 16+, or MSVC 19.41+.\n*   **Documentation:** While currently under development, documentation is available online.\n\nSparrow provides examples demonstrating how to initialize data, extract Arrow C structures, pass C structures to Sparrow, and transfer ownership of data. It's licensed under the Apache License 2.0.\n",
    "chinese_title": "麻雀：Apache Arrow 列式格式的 C++20 惯用 API",
    "chinese_summary": "Sparrow 是一个 C++20 库，为使用 Apache Arrow 柱状格式提供符合 C++ 习惯的 API。它简化了 C++ 应用程序中 Arrow 数据结构的创建、操作和交换。\n\n主要特性和优势包括：\n\n*   **符合 C++ 习惯的 API：** Sparrow 提供了用户友好的 C++ 接口来与 Arrow 数据交互，从而抽象化了 C 接口的复杂性。\n*   **转换能力：** 方便 Sparrow 数组结构和底层 Arrow C 接口之间的轻松转换，从而实现与其他 Arrow 兼容的库和系统的无缝集成。\n*   **内存管理选项：** 支持托管和非托管内存场景，允许用户控制 Arrow C 结构的生命周期。用户既可以允许 Sparrow 管理内存，也可以自行负责释放资源。\n*   **安装：** 通过 mamba 包管理器安装或使用 CMake 从源代码构建。\n*   **编译器支持：** 需要一个现代 C++ 编译器，具体为 Clang 18+、GCC 11.2+、Apple Clang 16+ 或 MSVC 19.41+。\n*   **文档：** 虽然目前正在开发中，但在线提供了文档。\n\nSparrow 提供了示例，演示了如何初始化数据、提取 Arrow C 结构、将 C 结构传递给 Sparrow 以及转移数据所有权。它采用 Apache License 2.0 许可证。"
  },
  {
    "id": "45137245",
    "title": "Interview with Japanese Demoscener 0b5vr",
    "url": "https://6octaves.com/2025/09/interview-with-demoscener-0b5vr.html",
    "summary": "This article is an interview with 0b5vr, a Japanese demoscener known for his 64K and 4K intros, particularly \"0b5vr GLSL Techno Live Set\" (0mix). 0b5vr explains the inspiration behind 0mix, which combines techno demos, live coding, and 64K intros, involving significant solo effort to create a demo engine, live coding environment, music, and visuals. He discusses the challenges and rewards of solo projects and how 0mix, although entered in the 64K compo, ended up winning \"Crowd Favorite\" in the PC Demo Compo due to a merger.\n\n0b5vr discusses using GLSL (typically for visuals) for music in 0mix and how the code presented on screen is actually musical code, which viewers may interpret as design. He emphasizes that he's happy that people of all tech levels can interpret his work how they want. 0b5vr also shares his research into \"machine live\" performances (using hardware like grooveboxes and modular synths) and how it influenced his GLSL live coding approach. He recounts performing a live coding set at \"draw(tokyo); #2\" using his custom Wavenerd system, which utilized pre-written code, DJ-style mixing, and visuals generated by fellow demosceners ukonpower and Renard. He touches on the balancing act required to appeal to a diverse audience with varying levels of technical knowledge. Finally, he elaborates on his motivations for creating 4K intros, often made quickly with tools like minimalGL, contrasting them with the more demanding 64K creations. The article concludes by exploring current trends in the Japanese demoscene.\n",
    "chinese_title": "对日本Demoscener 0b5vr的采访",
    "chinese_summary": "本文采访了日本demoscene制作人0b5vr，他以其64K和4K演示作品而闻名，尤其是“0b5vr GLSL Techno Live Set”(0mix)。0b5vr解释了0mix背后的灵感，它结合了techno演示、现场编码和64K intros，需要大量个人努力来创建演示引擎、现场编码环境、音乐和视觉效果。他讨论了单人项目的挑战和回报，以及0mix虽然参加了64K比赛，但由于合并最终赢得了PC Demo Compo中的“最受欢迎奖”。\n\n0b5vr讨论了在0mix中使用GLSL（通常用于视觉效果）制作音乐，以及屏幕上呈现的代码实际上是音乐代码，观众可能会将其理解为设计。他强调，他很高兴所有技术水平的人都可以按照他们自己的方式来解读他的作品。0b5vr还分享了他对“机器现场”表演（使用groovebox和模块化合成器等硬件）的研究，以及它如何影响了他的GLSL现场编码方法。他回顾了在“draw(tokyo); #2”中使用他的定制Wavenerd系统进行现场编码的经历，该系统利用了预先编写的代码、DJ风格的混音以及由demoscener伙伴ukonpower和Renard生成的视觉效果。他谈到了需要平衡才能吸引具有不同技术知识水平的不同受众。最后，他阐述了他创作4K intros的动机，这些intro通常使用minimalGL等工具快速制作，与要求更高的64K作品形成对比。文章最后探讨了日本demoscene的当前趋势。"
  },
  {
    "id": "45108401",
    "title": "Apertus 70B: Truly Open - Swiss LLM by ETH, EPFL and CSCS",
    "url": "https://huggingface.co/swiss-ai/Apertus-70B-2509",
    "summary": "The article \"Apertus 70B: Truly Open - Swiss LLM by ETH, EPFL and CSCS\" introduces Apertus 70B, a large language model (LLM) developed in Switzerland by ETH Zurich, EPFL, and the Swiss National Supercomputing Centre (CSCS). The key aspect highlighted is its \"truly open\" nature, implying that the model, its weights, and potentially the training data and code are openly accessible for research and development purposes. The item was updated 4 days ago and has received 193 views, indicating recent activity and interest in the project. The title suggests a focus on the openness of the model and its Swiss origin, implying a contribution to the open-source LLM community and a potential advancement in language AI within Switzerland.\n",
    "chinese_title": "Apertus 70B：真正开放 - ETH、EPFL和CSCS的瑞士LLM",
    "chinese_summary": "文章《Apertus 70B：真正开放 - 由ETH、EPFL和CSCS开发的瑞士LLM》介绍了Apertus 70B，这是一个由苏黎世联邦理工学院(ETH Zurich)、洛桑联邦理工学院(EPFL)和瑞士国家超级计算中心(CSCS)在瑞士开发的大型语言模型(LLM)。文章强调的关键是其“真正开放”的特性，意味着该模型、其权重，以及可能的训练数据和代码，都可公开访问，用于研究和开发目的。该条目于4天前更新，并已获得193次浏览，表明该项目的最新动态和人们的兴趣。标题表明重点在于模型的开放性及其瑞士血统，暗示着对开源LLM社区的贡献以及瑞士语言AI的潜在进步。"
  },
  {
    "id": "45140921",
    "title": "Show HN: Open-sourcing our text-to-CAD app",
    "url": "https://github.com/Adam-CAD/CADAM",
    "summary": "CADAM is an open-source, browser-based web application that transforms natural language and images into 3D models using AI. It features parametric controls, multiple export formats (.STL, .SCAD), and supports BOSL, BOSL2, and MCAD libraries. Users can input descriptions in plain English or upload images to guide model generation, with real-time previews powered by Three.js.\n\nThe app's key capabilities include automatic parameter extraction, smart updates for efficient dimension changes, and built-in Geist font support. The tech stack includes React 18 + TypeScript + Vite for the frontend, Three.js + React Three Fiber for 3D rendering, OpenSCAD WebAssembly as the CAD engine, Supabase for the backend, Anthropic Claude API for AI, and Tailwind CSS + shadcn/ui for styling.\n\nTo get started, users need Node.js, npm, Supabase CLI, and ngrok. Setup involves cloning the repository, installing dependencies, starting Supabase, and configuring environment variables for both the frontend and Supabase functions, including setting up an ngrok tunnel for local development with Anthropic. Contributions are welcome via pull requests. The project is licensed under GPLv3.\n",
    "chinese_title": "展示一下：开源我们的文本转CAD应用",
    "chinese_summary": "CADAM 是一款开源、基于浏览器的 Web 应用程序，它利用人工智能将自然语言和图像转换为 3D 模型。它具有参数化控制、多种导出格式（.STL、.SCAD），并支持 BOSL、BOSL2 和 MCAD 库。用户可以使用纯英文输入描述或上传图像来指导模型生成，并使用 Three.js 提供实时预览。\n\n该应用的关键功能包括自动参数提取、用于高效尺寸更改的智能更新以及内置的 Geist 字体支持。技术栈包括 React 18 + TypeScript + Vite 用于前端，Three.js + React Three Fiber 用于 3D 渲染，OpenSCAD WebAssembly 作为 CAD 引擎，Supabase 用于后端，Anthropic Claude API 用于 AI，以及 Tailwind CSS + shadcn/ui 用于样式设计。\n\n要开始使用，用户需要 Node.js、npm、Supabase CLI 和 ngrok。设置包括克隆存储库、安装依赖项、启动 Supabase 以及配置前端和 Supabase 函数的环境变量，包括设置 ngrok 隧道以用于 Anthropic 的本地开发。欢迎通过 pull 请求贡献代码。该项目采用 GPLv3 许可。"
  },
  {
    "id": "45112420",
    "title": "All New Java Language Features Since Java 21",
    "url": "https://inside.java/2025/08/31/roadto25-java-language/",
    "summary": "This article, written by José Paumard on August 31, 2025, announces the new language features included in Java 25. The features are geared towards three primary goals: enhancing data-oriented programming capabilities, easing the learning curve for new developers, and improving Java's suitability as a scripting language for automation. The article serves as an introduction to these new features and encourages readers to explore them further via the \"Road to 25\" playlist. In essence, Java 25 is presented as a significant step forward in making Java a more versatile and accessible language.\n",
    "chinese_title": "自Java 21以来所有新的Java语言特性",
    "chinese_summary": "本文由José Paumard于2025年8月31日撰写，宣布Java 25中包含的新语言特性。这些特性主要针对三个目标：增强面向数据编程的能力，降低新开发者的学习曲线，以及提高Java作为自动化脚本语言的适用性。本文旨在介绍这些新特性，并鼓励读者通过“Road to 25”播放列表进一步探索它们。总而言之，Java 25被认为是在使Java成为一种更加通用和易于使用的语言方面迈出的重要一步。"
  },
  {
    "id": "45115974",
    "title": "Show HN: Writing Arabic in English",
    "url": "https://sherifelmetwally.com/writing/writing-arabic-in-english",
    "summary": "This \"Show HN\" post details the author's journey in creating a phonetic Arabic keyboard designed for English speakers. The core idea is to map English letters to their closest Arabic sound equivalents, making it easier for beginners to type in Arabic without learning a new keyboard layout.\n\nThe author outlines the challenges, including Arabic's right-to-left script (easily solved with CSS), cursive nature (largely handled by browsers), and mapping English letters to Arabic sounds. The project cleverly addresses the fact that not all Arabic letters have direct English counterparts.\n\nThe solution divides the 11 unique Arabic letters into \"Emphatic\" and \"Unique\" categories. Emphatic letters, sounding like stronger versions of existing sounds, are mapped to uppercase English letters. Unique letters, with no clear English equivalent, are created by adding an apostrophe (') as a \"dot sprinkler\" to existing letter mappings. For example, `s'` produces ش (sheen).\n\nThe keyboard also tackles Hamza (ء) using `-` as a special character and diacritics for pronunciation hints, mapping them to combinations using `=` (e.g., `a=` for Fatḥah). The author provides examples of using the keyboard, including writing common words and phrases with and without diacritics.\n\nThe keyboard is built as a web component for easy integration, offering installation options via CDN and npm, and is showcased in the author's language learning platform, Parallel Arabic. The author admits the practicality of this approach is debatable, but emphasizes the project's fun and exploratory nature.\n",
    "chinese_title": "展示HN：用英语书写阿拉伯语",
    "chinese_summary": "这个“Show HN”帖子详细介绍了作者创建一款面向英语使用者的语音阿拉伯语键盘的历程。其核心思想是将英文字母映射到最接近的阿拉伯语发音，让初学者无需学习新的键盘布局就能更轻松地输入阿拉伯语。\n\n作者概述了挑战，包括阿拉伯语的从右到左书写（通过 CSS 轻松解决）、草书特性（很大程度上由浏览器处理）以及英文字母到阿拉伯语音的映射。该项目巧妙地解决了并非所有阿拉伯字母都有直接对应的英文字母的问题。\n\n该解决方案将 11 个独特的阿拉伯字母分为“强调音”和“独特音”两类。“强调音”听起来像是现有声音的更强版本，被映射到大写英文字母。对于没有明显英语对应物的“独特音”，则通过添加撇号 (') 作为“点洒水器”来创建现有字母映射。例如，`s'` 产生 ش (sheen)。\n\n该键盘还使用 `-` 作为特殊字符来处理 Hamza (ء)，并使用读音符号作为发音提示，将其映射到使用 `=` 的组合（例如，`a=` 表示 Fatḥah）。作者提供了使用键盘的示例，包括书写带和不带读音符号的常用单词和短语。\n\n该键盘被构建为一个 Web 组件，易于集成，提供通过 CDN 和 npm 进行安装的选项，并在作者的语言学习平台 Parallel Arabic 中展示。作者承认这种方法的实用性值得商榷，但强调了该项目的乐趣和探索性。"
  },
  {
    "id": "45143548",
    "title": "Gym Class VR (YC W22) Is Hiring – UX Design Engineer",
    "url": "https://www.ycombinator.com/companies/gym-class-by-irl-studios/jobs/ywXHGBv-ux-design-engineer-senior-staff-principal",
    "summary": "Gym Class VR, a top-rated social sports game on Meta Quest developed by IRL Studios (YC W22), is seeking a UX Design Engineer (Senior/Staff/Principal) to lead the development of their mobile web app and in-VR web surfaces. The role involves end-to-end feature development, encompassing design in Figma and front-end engineering with React/Node/CSS.\n\nThe ideal candidate will have 3-6+ years of experience building consumer web products, strong Figma skills, expertise in React, TypeScript/JavaScript, HTML, and CSS, and a focus on performance optimization. They should be pragmatic, entrepreneurial, and able to work in an ambiguous environment.\n\nResponsibilities include shipping features from concept to production, driving the web roadmap, building a design system, optimizing for performance, and iterating based on user feedback.\n\nThe salary range is $170K - $240K, plus equity and benefits (medical, dental, vision, and 401k with matching). Gym Class, backed by prominent investors like Andreessen Horowitz and the NBA, aims to connect the world through simulated experiences and is expanding beyond basketball into other sports categories. They have licensing relationships with the NBA (2023) and MLB (2025).\n",
    "chinese_title": "Gym Class VR (YC W22) 正在招聘 – 用户体验设计工程师",
    "chinese_summary": "Gym Class VR 招聘 UX 设计工程师（高级/资深/首席）：领导移动端 Web 应用和 VR 内 Web 界面的开发。"
  },
  {
    "id": "45140786",
    "title": "Freeway guardrails are now a favorite target of thieves",
    "url": "https://laist.com/news/transportation/guardrails-aluminum-theft",
    "summary": "This LAist article reports on the increasing theft of freeway guardrails in Los Angeles and Ventura counties. Bryan Gonzalez witnessed a man attempting to cut through a guardrail on the 10 Freeway and reported it to Caltrans. This incident is not isolated, as guardrail theft has been on the rise for eight years. Caltrans has spent over $62,000 on related repairs in the past two years, with nearly 470 sections stolen in the last fiscal year alone, costing $17,000 to replace.\n\nThe thefts are motivated by the value of aluminum, the material used in the guardrails, which is then sold to metal scrapyards. Increased metal prices, driven by tariffs, contribute to the problem. Caltrans has tried welding bolts to deter thieves, but they have been unsuccessful. The agency is now considering using fiberglass composite as an alternative material to eliminate the value to thieves.\n\nThe article highlights that metal theft is a widespread issue in L.A., impacting telecom, lighting, train, and other critical infrastructure. It cites instances of copper wire theft from streetlights and railway tracks that caused service disruptions. The LAPD's metal theft detail was disbanded six years ago, and it is unclear what enforcement actions are being taken to address the problem. The article then ends with a plea to readers to donate and support their local journalism.\n",
    "chinese_title": "高速公路护栏成盗贼新宠",
    "chinese_summary": "洛杉矶及文图拉县高速公路护栏盗窃案增多：一男子试图盗窃10号公路护栏，加州交通局已花费巨额维修费。"
  },
  {
    "id": "45144234",
    "title": "Quantum Mechanics, Concise Book",
    "url": "https://github.com/basketballguy999/Quantum-Mechanics-Concise-Book",
    "summary": "This Github repository, \"Quantum-Mechanics-Concise-Book,\" by basketballguy999, hosts a concise text on quantum mechanics (QM) in PDF format. The primary goal of the text is to provide an introductory overview of QM suitable for a broad audience, including undergraduate students in computer science, engineering, mathematics, and physics, as well as anyone generally interested in the subject.\n\nThe book assumes a basic understanding of linear algebra, calculus, and high school physics as prerequisites. This suggests the content is structured to be accessible to individuals with a foundation in these areas but not necessarily specialized knowledge of physics.\n\nThe repository has received considerable interest, indicated by 103 stars, highlighting its value to users seeking a clear and condensed introduction to quantum mechanics. However, it has no forks, suggesting users are primarily utilizing the resource directly rather than branching and modifying it. In essence, the repository provides a readily available, concise, and introductory resource for learning the fundamentals of quantum mechanics.\n",
    "chinese_title": "量子力学简明教程",
    "chinese_summary": "篮球小子999的Github仓库“Quantum-Mechanics-Concise-Book”提供了一本关于量子力学(QM)的简明PDF教材。该教材的主要目标是为包括计算机科学、工程、数学和物理专业的本科生，以及对该主题普遍感兴趣的任何人，提供一个适合广泛受众的量子力学入门概述。\n\n本书假定读者具备线性代数、微积分和高中物理的基础知识。这表明其内容结构便于那些具有这些领域基础知识但不必具备物理专业知识的个人理解。\n\n该仓库受到了相当的关注，获得了103个星标，突显了其对于寻求清晰简明量子力学入门介绍的用户的价值。然而，它没有任何fork，表明用户主要直接利用该资源，而不是进行分支和修改。总而言之，该仓库为学习量子力学基础知识提供了一个随时可用的、简洁的入门资源。"
  },
  {
    "id": "45143077",
    "title": "I kissed comment culture goodbye",
    "url": "https://sustainableviews.substack.com/p/the-day-i-kissed-comment-culture",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "我与评论文化告别。",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "45106478",
    "title": "An Academic Archive Became a Tech Juggernaut",
    "url": "https://www.philanthropy.com/article/how-an-academic-archive-became-a-tech-juggernaut",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "学术档案馆如何成为科技巨头",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "45105339",
    "title": "How much power does Visual Look Up use?",
    "url": "https://eclecticlight.co/2025/09/02/how-much-power-does-visual-look-up-use/",
    "summary": "This article investigates the power consumption of Visual Look Up (VLU) on an Apple silicon Mac, specifically an M4 Pro Mac mini running macOS 15.6.1. The author used `powermetrics` to measure CPU, GPU, and Neural Engine (ANE) power in 100ms intervals, correlating these measurements with log entries extracted using LogUI while performing VLU on an image of cattle.\n\nThe analysis reveals that VLU's power demands are surprisingly low. During a 6.5-second period of VLU activity, the CPU consumed the vast majority of power (93%), followed by the GPU (4.6%), and the ANE (2.2%).  Total energy consumption for VLU was estimated at 6.9 Joules, broken down as CPU (6.4 J), GPU (0.3 J), and ANE (0.2 J).\n\nLog analysis showed the ANE was primarily active in a short burst (1.4-2.2 seconds) using models for object detection and nature world identification.  The CPU showed peak power usage coinciding with the initial VLU processing and later when the lookup window was opened. GPU power spikes corresponded to image display and potential processing.\n\nThe author concludes that VLU relies heavily on the CPU and makes relatively light demands on the neural engine and GPU in terms of power and energy, despite the performance benefits the ANE provides. In summary, VLU is computationally intensive but not particularly power-hungry on Apple silicon.\n",
    "chinese_title": "视觉查找功能耗电量是多少？",
    "chinese_summary": "本文 дослі査了在 Apple silicon Mac 上 Visual Look Up (VLU) 的功耗，具體是在運行 macOS 15.6.1 的 M4 Pro Mac mini 上。作者使用 `powermetrics` 以 100 毫秒的間隔測量 CPU、GPU 和神經引擎 (ANE) 的功耗，並在使用 LogUI 提取日誌條目的同時，將這些測量值與對牛的圖像執行 VLU 時的情況相關聯。\n\n分析表明，VLU 的功率需求出人意料地低。 在 6.5 秒的 VLU 活動期間，CPU 消耗了絕大部分功率 (93%)，其次是 GPU (4.6%) 和 ANE (2.2%)。 VLU 的總能量消耗估計為 6.9 焦耳，分解為 CPU (6.4 焦耳)、GPU (0.3 焦耳) 和 ANE (0.2 焦耳)。\n\n日誌分析顯示，ANE 主要在短時間內（1.4-2.2 秒）活躍，使用物件檢測和自然世界識別模型。 CPU 顯示的峰值功耗與最初的 VLU 處理以及稍後打開查找視窗時相符。 GPU 功率峰值與圖像顯示和潛在的處理相對應。\n\n作者得出結論，儘管 ANE 提供了性能優勢，但 VLU 在功耗和能量方面嚴重依賴 CPU，並且對神經引擎和 GPU 的需求相對較小。 總之，VLU 在計算上是密集的，但在 Apple silicon 上並非特別耗電。"
  },
  {
    "id": "45106429",
    "title": "Mac Clones History: A Tale of Poor Margins and Bad Timing",
    "url": "https://tedium.co/2025/09/02/apple-macintosh-clones-history/",
    "summary": "This Tedium article explores the brief and ultimately unsuccessful experiment of licensed Mac clones in the mid-1990s. For most of its history, Apple strictly controlled the Mac market, but a changing market landscape and the influence of entrepreneurs like Stephen Kahng (Power Computing) led to a short-lived licensing program. The article highlights earlier, less formal attempts at Mac compatibility, such as the Unitron 512 clone and Chuck Colby's Mac conversions, illustrating the demand for alternative Mac solutions.\n\nThe author argues that Apple's decision to allow clones in 1995 was poorly timed. While intended to expand the Mac market and compete with the rise of Windows 95, the clone program instead fostered price wars, undermined Apple's own product lineup (offering 47 models that year), and failed to attract new users. Companies like Power Computing and UMAX produced cheaper Mac alternatives that directly competed with Apple's offerings, cannibalizing their market share.\n\nThe article concludes that while niche conversions like Colby's were harmless, the licensed clone program ultimately damaged Apple's brand and profitability. The clones emphasized the operating system over hardware design, diminishing Apple's \"wow factor\" and hurting margins. The experiment was shut down after Steve Jobs' return to Apple, a decision that may have negatively impacted the PowerPC chip's development. Ultimately, the Mac clone experiment serves as a cautionary tale about brand identity, market segmentation, and the importance of protecting profit margins.\n",
    "chinese_title": "Mac克隆史：利润微薄与时运不济的故事",
    "chinese_summary": "这篇 Tedium 文章探讨了 20 世纪 90 年代中期短暂且最终失败的 Mac 授权克隆实验。在它的大部分历史中，苹果公司严格控制着 Mac 市场，但不断变化的市场格局以及像 Stephen Kahng（Power Computing）这样的企业家的影响，促成了一个短暂的授权计划。文章重点介绍了早期不太正式的 Mac 兼容性尝试，例如 Unitron 512 克隆机和 Chuck Colby 的 Mac 改装，说明了对替代 Mac 解决方案的需求。\n\n作者认为，苹果公司 1995 年允许克隆机的决定时机不佳。虽然旨在扩大 Mac 市场并与 Windows 95 的崛起竞争，但克隆计划反而引发了价格战，削弱了苹果公司自身的产品线（当年提供了 47 款型号），并且未能吸引新用户。像 Power Computing 和 UMAX 这样的公司生产了更便宜的 Mac 替代品，直接与苹果公司的产品竞争，蚕食了他们的市场份额。\n\n文章总结说，虽然像 Colby 那样的利基转换是无害的，但授权克隆计划最终损害了苹果公司的品牌和盈利能力。克隆机强调了操作系统而非硬件设计，削弱了苹果公司的“哇”因素，并损害了利润率。在史蒂夫·乔布斯重返苹果公司后，该实验被关闭，这一决定可能对 PowerPC 芯片的开发产生了负面影响。 最终，Mac 克隆实验是一个关于品牌识别、市场细分以及保护利润率的重要性的警示故事。"
  },
  {
    "id": "45101797",
    "title": "How big are our embeddings now and why?",
    "url": "https://vickiboykis.com/2025/09/01/how-big-are-our-embeddings-now-and-why/",
    "summary": "This article discusses the evolution of embedding sizes in machine learning models, particularly for text. Initially, 200-300 dimensions were common, based on models like Word2Vec and GloVE. BERT then popularized 768 dimensions due to efficient GPU parallelization, specifically its 12 attention heads operating on 64-dimensional subspaces. SBERT and MiniLM then optimized embeddings for faster inference, creating a standard for 384 dimensions.\n\nThe rise of HuggingFace standardized model access, while the advent of ChatGPT and API-accessible models like OpenAI's (1536 dimensions) shifted embeddings to a commodity. Now, sizes range from 768 to 4096 (and beyond) in models benchmarked by MTEB, influenced by GPT-3 and other factors. \n\nThe author notes the growing commoditization of vector databases, implying less reliance on custom vector storage solutions, and discusses the ongoing effort to manage the trade-offs between model size, inference speed, storage costs, and performance. Finally, he mentions work into matryoshka representation learning and embedding truncation to maximize efficiency.\n",
    "chinese_title": "我们的嵌入现在有多大？为什么？",
    "chinese_summary": "机器学习模型中嵌入尺寸的演变：从Word2Vec到ChatGPT"
  },
  {
    "id": "45135623",
    "title": "SQL needed structure",
    "url": "https://www.scattered-thoughts.net/writing/sql-needed-structure/",
    "summary": "This article tackles the problem of \"object-relational mismatch\" when building user interfaces with data from relational databases. The core issue is that UIs often require hierarchical data structures, while relational databases store data in flat tables. Transforming this flat data into the necessary hierarchical structure is tedious and error-prone, especially in SQL, which wasn't designed for producing hierarchical data.\n\nThe author demonstrates this with an example of fetching movie data (title, director, writers, actors, characters) from an IMDb dataset in PostgreSQL. Traditional SQL queries require multiple joins and often return more data than needed (e.g., foreign keys for joining). These queries also struggle with optional or multiple related entities, leading to either incorrect results or the need for multiple queries.\n\nORMs are often used to automate this process, but they can lead to multiple queries (one per path in the data structure) or consistency issues due to lazy loading.\n\nThe author then introduces a solution using SQL's JSON aggregation capabilities. By nesting queries and using functions like `jsonb_agg`, a single SQL query can produce the desired hierarchical JSON structure. While the resulting query might be complex, it offers significant advantages: fetching all required data in a single network roundtrip, reducing the load on the backend server, and enabling more efficient data retrieval for UI rendering. The author argues that embracing these newer SQL features is a necessary evolution to meet the demands of modern web development, where UI construction is a primary use case for databases.\n",
    "chinese_title": "所需的SQL结构",
    "chinese_summary": "本文探讨了在使用关系数据库中的数据构建用户界面时出现的“对象关系不匹配”问题。核心问题在于，用户界面通常需要层级数据结构，而关系数据库则将数据存储在扁平表格中。将这种扁平数据转换为必要的层级结构既繁琐又容易出错，尤其是在SQL中，因为SQL并非为生成层级数据而设计的。\n\n作者通过一个从PostgreSQL中的IMDb数据集获取电影数据（标题、导演、编剧、演员、角色）的例子来演示了这一点。传统的SQL查询需要多次连接，并且通常返回比所需更多的数据（例如，用于连接的外键）。这些查询在处理可选或多个相关实体时也很吃力，要么导致错误的结果，要么需要多个查询。\n\n通常使用ORM来自动化此过程，但它们可能导致多个查询（数据结构中每个路径一个查询）或因延迟加载而导致一致性问题。\n\n然后，作者介绍了一种使用SQL的JSON聚合功能的解决方案。通过嵌套查询并使用`jsonb_agg`等函数，单个SQL查询可以生成所需的层级JSON结构。虽然生成的查询可能很复杂，但它具有显着的优势：在单个网络往返中获取所有必需的数据，减少后端服务器的负载，并为UI渲染实现更有效的数据检索。作者认为，拥抱这些较新的SQL特性是满足现代Web开发需求的必要演变，其中UI构建是数据库的主要用例。"
  },
  {
    "id": "45135263",
    "title": "Show HN: Swimming in Tech Debt",
    "url": "https://helpthisbook.com/lou-franco/swimming-in-tech-debt",
    "summary": "Okay, here's a concise summary of the \"Show HN: Swimming in Tech Debt\" post, based on the title and the provided content fragment:\n\nThe post is a \"Show HN\" submission, implying the author is showcasing something they've created or are working on. The title, \"Swimming in Tech Debt,\" immediately suggests the project deals with technical debt, a common problem in software development.\n\nThe content, \"Fetching your book...Swimming in Tech Debt - Help This Book,\" strongly indicates that the showcased project is a book, or related to a book, about managing or understanding technical debt. The phrase \"Help This Book\" likely means the author is looking for feedback, contributions, or support for their book project. The \"Fetching your book...\" might be an excerpt of the webpage the user would land on.\n\nIn essence, the author is sharing a book (or book-related project) focused on technical debt and seeking input or assistance from the Hacker News community. It's likely a project aimed at helping developers and organizations better understand and address the challenges associated with accumulating and managing technical debt.\n",
    "chinese_title": "Show HN: 技术债务缠身",
    "chinese_summary": "好的，以下是“Show HN：技术债缠身”帖子的简洁总结，基于标题和提供的内容片段：\n\n该帖子是一个“Show HN”提交，意味着作者正在展示他们创建或正在从事的项目。标题“技术债缠身”直接表明该项目涉及技术债，这是软件开发中常见的问题。\n\n内容“获取你的书...技术债缠身 - 帮助这本书”，强烈表明展示的项目是一本书，或者与一本关于管理或理解技术债的书有关。“帮助这本书”可能意味着作者正在为他们的图书项目寻求反馈、贡献或支持。“获取你的书...”可能是用户将要访问的网页的摘录。\n\n本质上，作者正在分享一本专注于技术债的书（或与书相关的项目），并寻求 Hacker News 社区的意见或帮助。这很可能是一个旨在帮助开发人员和组织更好地理解和解决与积累和管理技术债相关的挑战的项目。"
  },
  {
    "id": "45140730",
    "title": "European Commission fines Google €2.95B over abusive ad tech practices",
    "url": "https://ec.europa.eu/commission/presscorner/detail/en/ip_25_1992",
    "summary": "The European Commission has fined Google €2.95 billion for abusing its dominant position in the ad tech market. The Commission found that Google favored its own ad exchange, AdX, and its ad serving tool, Google Ad Manager (formerly DoubleClick for Publishers), at the expense of rival ad exchanges and publishers.\n\nSpecifically, Google was found to have restricted access to its Ad Manager by rival ad exchanges, making it more difficult for them to compete. It also allegedly used its dominant position in ad serving to favor AdX in the ad auction process. This anti-competitive behavior allowed Google to solidify its control over the ad tech ecosystem, to the detriment of publishers who rely on advertising revenue and to competitors.\n\nThe Commission's investigation concluded that Google's actions stifled innovation and ultimately harmed consumers by potentially leading to less diverse and relevant advertising. The hefty fine reflects the seriousness of the infringement and is intended to deter Google, and other companies with similar market power, from engaging in anti-competitive practices. The press release indicates further details and implications of the decision are available from the European Commission.\n",
    "chinese_title": "欧盟委员会因滥用广告技术行为对谷歌处以 29.5 亿欧元罚款",
    "chinese_summary": "欧盟委员会因滥用广告技术市场支配地位对谷歌处以29.5亿欧元罚款。委员会认定，谷歌偏袒其自身广告交易平台AdX及其广告投放工具Google Ad Manager（前身为DoubleClick for Publishers），损害了竞争对手广告交易平台和发布商的利益。\n\n具体而言，谷歌被发现限制竞争对手广告交易平台对其Ad Manager的访问，增加了它们的竞争难度。它还涉嫌利用其在广告投放领域的主导地位在广告竞价过程中偏袒AdX。这种反竞争行为使谷歌得以巩固其对广告技术生态系统的控制，损害了依赖广告收入的发布商和竞争对手的利益。\n\n委员会的调查得出结论，谷歌的行为扼杀了创新，并可能通过导致广告多样性和相关性降低而最终损害了消费者利益。巨额罚款反映了违规行为的严重性，旨在阻止谷歌以及其他具有类似市场力量的公司从事反竞争行为。新闻稿表明，更多关于该决定的细节和影响可从欧盟委员会获取。"
  },
  {
    "id": "45135061",
    "title": "Poisoning Well",
    "url": "https://heydonworks.com/article/poisoning-well/",
    "summary": "The article \"Poisoning Well\" discusses the problem of Large Language Models (LLMs) being trained on web content without the consent of authors. Since blocking LLM crawlers is difficult, the author explores an alternative: luring them into consuming \"tainted\" content designed to degrade their output and perceived usefulness.\n\nThe author creates nonsensical versions of their articles, accessible only through `rel=\"nofollow\"` links, which are meant to be ignored by reputable crawlers like Googlebot but followed by LLM crawlers. The corrupted content involves grammatical distortions, lexical absurdities, and weird spelling errors, generated using word substitutions based on a static lexicon.\n\nThe technical implementation involves creating a nonsense template in their 11ty-based site, using a transform and JSDOM to manipulate text elements, and substituting words with random counterparts from a JSON file. They also implemented robot.txt rules for reputable crawlers like Googlebot.\n\nThe author acknowledges that this approach might not be a perfect solution but hopes that if enough writers adopt similar strategies, it could lead to more gibberish in generative AI output and potentially force LLM owners to respect the `nofollow` protocol. The goal is to deplete LLM crawler resources and, at the very least, raise a middle finger to LLM manufacturers for their practices. The author welcomes feedback from experts on improving the approach.\n",
    "chinese_title": "投毒井",
    "chinese_summary": "“投毒井”探讨了大型语言模型(LLM)在未经作者同意的情况下，使用网络内容进行训练的问题。由于阻止LLM爬虫很困难，作者探索了一种替代方案：诱使它们消费“受污染”的内容，以降低其输出质量和感知效用。\n\n作者创建了其文章的无意义版本，仅通过 `rel=\"nofollow\"` 链接访问，这些链接本应被Googlebot等信誉良好的爬虫忽略，却被LLM爬虫跟踪。受损内容包含语法扭曲、词汇荒谬和奇怪的拼写错误，这些错误是基于静态词典进行单词替换生成的。\n\n技术实现包括在其基于11ty的站点中创建一个无意义模板，使用transform和JSDOM来操作文本元素，并使用JSON文件中的随机对应词替换单词。他们还为Googlebot等信誉良好的爬虫实施了robot.txt规则。\n\n作者承认这种方法可能不是一个完美的解决方案，但希望如果足够多的作者采用类似的策略，可能会导致生成式AI输出中出现更多的胡言乱语，并可能迫使LLM所有者尊重 `nofollow` 协议。目标是消耗LLM爬虫资源，并且至少是对LLM制造商的行径竖中指。作者欢迎专家就改进方法提出反馈。"
  },
  {
    "id": "45108536",
    "title": "All of our lives overlap in the Network Of Time",
    "url": "https://networkoftime.com/",
    "summary": "The \"Network Of Time\" website explores interconnectedness between people through real photographs, showcasing how lives overlap throughout history. Users can search for connections between two individuals and also add themselves to the network to discover their own connections to the past. The site boasts user testimonials, such as one from Jesse Eisenberg, praising its concept.\n\nThe core functionality revolves around visualizing connections between individuals using photographs, effectively demonstrating how seemingly disparate lives intersect. Users can subscribe to the Network of Time Substack for new discoveries and continuous exploration of these connections.\n\nThe website includes standard features like \"Home,\" \"About,\" \"Submit,\" \"Contact,\" \"Press,\" \"Register,\" and \"Login\" options, indicating a community-driven platform. It also displays a loading animation with messages like \"Loading...\" and \"Loading person details...\", suggesting interactive features and a dynamic database of people and photographs.\n\nImportantly, the website includes a disclaimer stating that it doesn't claim copyright or ownership of any images displayed, nor does it claim endorsement from anyone pictured or any image source. It encourages users to contact them with any questions, corrections, or requests. The site also includes share buttons for specific connections.\n",
    "chinese_title": "我们所有的人生都在时间网络中交织。",
    "chinese_summary": "“时间网络”网站通过真实照片探索人与人之间的关联，展示历史中生命的重叠。用户可以搜索两个人之间的联系，也可以将自己添加到网络中，以发现自己与过去的联系。该网站拥有用户评价，例如杰西·艾森伯格赞扬其概念的评价。\n\n其核心功能围绕着使用照片可视化个人之间的联系，有效地展示看似不同的生活如何交织。用户可以订阅“时间网络”Substack，以获取新的发现并持续探索这些联系。\n\n该网站包括“主页”、“关于”、“提交”、“联系方式”、“新闻”、“注册”和“登录”等标准功能，表明这是一个社区驱动的平台。它还显示加载动画，其中包含“正在加载...”和“正在加载人物详情...”等消息，表明具有交互功能以及人物和照片的动态数据库。\n\n重要的是，该网站包含一项声明，声明其不声明对显示的任何图像的版权或所有权，也不声明获得任何照片中人物或任何图像来源的认可。它鼓励用户联系他们，提出任何问题、更正或请求。该网站还包括特定连接的分享按钮。"
  },
  {
    "id": "45149602",
    "title": "996 Working Hour System",
    "url": "https://en.wikipedia.org/wiki/996_working_hour_system",
    "summary": "The \"996 working hour system\" is an illegal work schedule in China, requiring employees to work from 9:00 am to 9:00 pm, 6 days a week (72 hours total). Common in Chinese internet and tech companies, it's been criticized as \"modern slavery\" and a violation of labor laws.\n\nOvertime culture has long been present in Chinese IT companies, incentivized through various means, but has been linked to health problems among workers, including fatigue, musculoskeletal pain, and mental health issues. A 2013 survey indicated that almost all Chinese IT workers reported health problems. Overwork deaths and suicides have also been attributed to the 996 system.\n\nSeveral companies, including 58.com, ByteDance (TikTok), JD.com, Pinduoduo, Youzan, Huawei, and Alibaba, have been associated with the 996 system. In 2019, an online \"anti-996\" protest was launched via GitHub, gaining widespread support and leading to the creation of the Anti 996 License.\n\nWhile some figures like Jack Ma and Richard Liu have defended the system, many Chinese media outlets and international figures have criticized it as harmful and inhumane. The Supreme People's Court deemed the 996 system illegal in August 2021, though enforcement concerns remain.\n",
    "chinese_title": "996工作制",
    "chinese_summary": "“996工作制”是中国一种非法的工作时间制度，要求员工从早上9点工作到晚上9点，每周工作6天（总计72小时）。这种制度在中国互联网和科技公司中较为常见，被批评为“现代奴隶制”并违反了劳动法。\n\n加班文化长期存在于中国IT企业中，并通过各种方式激励，但与员工的健康问题有关，包括疲劳、肌肉骨骼疼痛和精神健康问题。2013年的一项调查显示，几乎所有中国IT从业者都报告了健康问题。过劳死和自杀也被归因于996制度。\n\n包括58同城、字节跳动（TikTok）、京东、拼多多、有赞、华为和阿里巴巴在内的多家公司都与996制度有关。2019年，一场在线“反996”抗议活动通过GitHub发起，获得了广泛支持，并催生了Anti 996 License。\n\n虽然马云和刘强东等一些人士为该制度辩护，但许多中国媒体和国际人士批评其有害且不人道。最高人民法院于2021年8月裁定996制度违法，但执法问题仍然存在。"
  },
  {
    "id": "45137363",
    "title": "Nepal moves to block Facebook, X, YouTube and others",
    "url": "https://www.aljazeera.com/news/2025/9/4/nepal-moves-to-block-facebook-x-youtube-and-others",
    "summary": "Nepal's government announced it will block access to major social media platforms like Facebook, X, and YouTube after they failed to meet a Wednesday deadline to register with the Ministry of Communications and Information Technology. The government claims the move aims to curb online hate, rumors, and cybercrime, requiring companies to provide a local contact, grievance handler, and person responsible for self-regulation.\n\nDespite millions of users in Nepal, only a few platforms, including TikTok and Viber, have formally registered. Communications Minister Prithvi Subba Gurung stated the platforms ignored repeated requests to comply with registration.\n\nDigital Rights Nepal President Bhola Nath Dhungana criticized the sudden closure as a \"controlling\" approach that infringes on public rights, arguing for a legal infrastructure before such enforcement. Nepal has previously restricted platforms like Telegram and TikTok (which was later unbanned after compliance).\n\nThe article notes a global trend of governments tightening oversight of social media and big tech due to concerns about misinformation, data privacy, online harm, and national security, citing examples from the US, EU, Brazil, Australia, India, and China.\n",
    "chinese_title": "尼泊尔拟封禁脸书、X、YouTube等平台",
    "chinese_summary": "尼泊尔政府宣布，由于Facebook、X和YouTube等主要社交媒体平台未能遵守周三的最后期限，向通信和信息技术部注册，将封锁对其的访问。政府声称此举旨在遏制网络仇恨、谣言和网络犯罪，要求公司提供当地联系人、申诉处理人员和负责自我监管的人员。\n\n尽管尼泊尔有数百万用户，但只有少数平台（包括TikTok和Viber）已正式注册。通信部长普里特维·苏巴·古隆表示，这些平台无视了多次要求遵守注册的请求。\n\n尼泊尔数字权利组织主席波拉·纳特·杜哈纳批评这种突然关闭是一种“控制”手段，侵犯了公众权利，并主张在实施此类措施之前建立法律基础设施。尼泊尔此前曾限制过Telegram和TikTok等平台（TikTok在合规后后来被解除禁令）。\n\n文章指出，由于对虚假信息、数据隐私、网络危害和国家安全的担忧，全球范围内出现了一种政府收紧对社交媒体和大型科技公司监管的趋势，并引用了美国、欧盟、巴西、澳大利亚、印度和中国的例子。"
  },
  {
    "id": "45136728",
    "title": "I have two Amazon Echos that I never use, but they apparently burn GBs a day",
    "url": "https://twitter.com/davepl1968/status/1963803025572770212",
    "summary": "The user reports having two Amazon Echo devices that they rarely use. Despite the lack of active use, the devices are apparently consuming gigabytes of data daily.\n\nThe provided content also shows a typical footer from the website X (formerly Twitter), including a message about JavaScript being disabled and links to their Help Center, Terms of Service, Privacy Policy, Cookie Policy, Imprint, Advertising Information, and copyright notice. This footer appears because the original user's message likely came from Twitter (X), and the AI is struggling to extract just the user's message.\n",
    "chinese_title": "我有两个亚马逊Echo，我从不用它们，但它们显然每天消耗几个GB流量。",
    "chinese_summary": "用户报告称，他们拥有两台很少使用的亚马逊 Echo 设备。尽管不经常使用，这些设备显然每天消耗数 GB 的数据。\n\n提供的内容还显示了网站 X（前身为 Twitter）的典型页脚，包括一条关于 JavaScript 被禁用的消息，以及指向其帮助中心、服务条款、隐私政策、Cookie 政策、版本说明、广告信息和版权声明的链接。出现此页脚的原因可能是原始用户的消息来自 Twitter (X)，而 AI 难以仅提取用户的消息。"
  },
  {
    "id": "45143879",
    "title": "Nest 1st gen and 2nd gen thermostats no longer supported from Oct 25",
    "url": "https://community.hubitat.com/t/nest-1st-gen-and-2nd-gen-thermostats-no-longer-supported-by-google-from-10-25-2025/152952",
    "summary": "Simon received an email from Google announcing that support for Nest 1st and 2nd generation thermostats will end on October 25th. While the thermostats will still function locally to maintain temperature, they will no longer be controllable through the Nest or Google Home apps. Simon is concerned about the implications for his Hubitat integration, questioning whether he will still be able to control the thermostats via Hubitat after the change. The key takeaway is the loss of remote control and smart home integration for these older Nest thermostat models.\n",
    "chinese_title": "Nest 第一代和第二代恒温器将于10月25日起停止支持",
    "chinese_summary": "谷歌发邮件通知西蒙，第一代和第二代Nest恒温器将于10月25日停止支持。恒温器仍可在本地维持温度，但无法再通过Nest或Google Home应用程序控制。西蒙担心这对他的Hubitat集成的影响，质疑更改后是否还能通过Hubitat控制恒温器。关键在于这些旧款Nest恒温器型号将失去远程控制和智能家居集成功能。"
  },
  {
    "id": "45137802",
    "title": "I'm absolutely right",
    "url": "https://absolutelyright.lol/",
    "summary": "This very short article, titled \"I'm absolutely right,\" expresses a strong conviction of being correct about something. The content reiterates this certainty using the phrase \"Absolutely right\" twice. It also claims that \"Claude Code said it 0 times today,\" suggesting the topic of the assertion relates to something Claude Code (likely a reference to a language model or AI) hasn't stated recently. The phrase \"Just right\" adds a subtle nuance, perhaps implying the opinion isn't just correct, but perfectly so. Overall, the article is a brief declaration of confidence in a specific belief or perspective, potentially in contrast to what a specific AI model has stated.\n",
    "chinese_title": "我绝对正确。",
    "chinese_summary": "标题“我绝对正确”的这篇短文表达了对某事坚信不疑的信念。内容两次重复“绝对正确”来强调这种确定性。它还声称“Claude Code今天说了0次”，暗示断言的主题与Claude Code（可能指语言模型或人工智能）最近没有说过的内容有关。“恰到好处”这个短语增添了一丝微妙的意味，也许意味着这个观点不仅正确，而且是完美地正确。总的来说，这篇文章是对特定信念或观点的自信宣言，可能与特定人工智能模型所说的内容形成对比。"
  },
  {
    "id": "45099681",
    "title": "Making the most of a dumb fax switcher box in the old days",
    "url": "https://rachelbythebay.com/w/2025/09/01/fax/",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "过去如何充分利用一个简易传真切换盒",
    "chinese_summary": "无法访问该文章链接。"
  },
  {
    "id": "45141644",
    "title": "Realtek RTL8127 10GbE PCIe cards and M.2 modules are starting to show up",
    "url": "https://www.cnx-software.com/2025/09/05/buy-realtek-rtl8127-10gbe-pcie-cards-and-m2-modules/",
    "summary": "This article discusses the emergence of Realtek RTL8127-based 10GbE PCIe cards and M.2 modules, a low-cost alternative for 10Gbps Ethernet connectivity. The RTL8127 was introduced as a budget-friendly solution, aiming for a $30-$40 price range.\n\nThe article highlights the Auvidea M20E M.2 10GbE module, detailing its specifications and Linux/Windows driver support. However, its price (99.99 to 112.99 Euros) is higher than initially anticipated. User testing showed the Auvidea module achieving speeds up to 7,400 Mbps with low power consumption and stable performance, outperforming a Marvell AQC107 card.\n\nA more affordable OEM RTL8127 10GbE PCIe card is available on Alibaba and AliExpress ($35 - $51.62). User reviews indicate good stability and lower power consumption compared to the AQC107.\n\nThe article concludes that the availability of RTL8127-based solutions marks a positive step towards more affordable 10GbE networking. The author expects to see more RTL8127 products in the future, including mini PCs, SBCs, and motherboards.\n",
    "chinese_title": "瑞昱RTL8127万兆以太网PCIe网卡和M.2模块开始出现",
    "chinese_summary": "本文探讨了基于瑞昱RTL8127的万兆以太网PCIe卡和M.2模块的出现，这是一种低成本的万兆以太网连接替代方案。RTL8127作为经济实惠的解决方案推出，旨在实现30-40美元的价格范围。\n\n文章重点介绍了Auvidea M20E M.2万兆以太网模块，详细介绍了其规格以及Linux/Windows驱动程序支持。然而，其价格（99.99至112.99欧元）高于最初预期。用户测试表明，Auvidea模块实现了高达7,400 Mbps的速度，同时具有低功耗和稳定的性能，优于Marvell AQC107卡。\n\n阿里巴巴和全球速卖通上提供了一种更经济实惠的OEM RTL8127万兆以太网PCIe卡（35-51.62美元）。用户评论表明，与AQC107相比，其具有良好的稳定性和更低的功耗。\n\n文章总结称，基于RTL8127的解决方案的可用性标志着向更实惠的万兆以太网迈出了积极的一步。作者预计未来将看到更多RTL8127产品，包括迷你电脑、单板计算机和主板。"
  },
  {
    "id": "45093501",
    "title": "Vetinari's Clock (2011)",
    "url": "https://www.waitingforfriday.com/?p=264",
    "summary": "This article details how to build a Vetinari clock, inspired by the Discworld series, which ticks irregularly to create a disorienting effect. The author, Simon Inns, created a DIY version using a PIC12F683 microcontroller to replace the standard quartz clock movement controller.\n\nThe clock works by pulsing the stepping motor in a standard quartz clock movement, reversing polarity with each pulse. The PIC microcontroller, clocked at 32.768kHz, uses timer0 interrupts four times a second to maintain accurate timekeeping while consuming minimal power.\n\nThe firmware generates a \"random\" sequence of pulses over 32 seconds, moving the second hand between 0-4 times per second, totaling 32 seconds of movement within that time. An additional delay prevents the clock from advancing precisely on the quarter second, further enhancing the irregular ticking.\n\nThe circuit includes current-limiting resistors to protect the PIC and clock, along with Schottky diodes to clamp voltage spikes from the coil. The article provides a schematic, PCB layout (in Eagle CAD format), and the PIC12F683 firmware source code (for HiTech C) for readers to build their own Vetinari clock. Inns also mentions a commercially available kit from Akafugu.jp for those who prefer a ready-made option.\n",
    "chinese_title": "维提纳里的钟 (2011)",
    "chinese_summary": "本文详细介绍了如何制作一个维提纳里时钟，其灵感来源于碟形世界系列，该时钟以不规则的滴答声制造一种令人迷惑的效果。作者西蒙·英斯使用PIC12F683微控制器取代了标准的石英钟机芯控制器，创建了一个DIY版本。\n\n该时钟通过脉冲驱动标准石英钟机芯中的步进电机来工作，每次脉冲都会反转极性。PIC微控制器以32.768kHz的时钟频率运行，每秒使用四次timer0中断来保持精确计时，同时消耗最小的功率。\n\n固件生成一个32秒的“随机”脉冲序列，使秒针以每秒0-4次的速度移动，在该时间内总共移动32秒。一个额外的延迟可以防止时钟精确地在四分之一秒时前进，进一步增强了不规则的滴答声。\n\n该电路包括限流电阻，以保护PIC和时钟，以及肖特基二极管，以钳位来自线圈的电压尖峰。本文提供了原理图、PCB布局（Eagle CAD格式）以及PIC12F683固件源代码（适用于HiTech C），供读者构建自己的维提纳里时钟。英斯还提到Akafugu.jp提供了一个商业化的套件，供那些喜欢现成选项的人选择。"
  },
  {
    "id": "45090553",
    "title": "Rasterizer: A GPU-accelerated 2D vector graphics engine in ~4k LOC",
    "url": "https://github.com/mindbrix/Rasterizer",
    "summary": "Rasterizer is a GPU-accelerated 2D vector graphics engine developed over 10 years, inspired by Adobe Flash. Written in C++ 11 and using Metal (for macOS, but adaptable to other GPUs with instancing and floating point render targets), it achieves up to 60x speed improvements over CPU rendering, making it ideal for animated UIs. An iOS port is planned.\n\nThe engine focuses on efficiently converting vector paths into high-quality, anti-aliased pixels, employing optimized solutions, including a novel windowed-inverse-lerp algorithm for pixel area coverage. Rasterizer supports Postscript-style paths, even-odd and non-zero fill rules, and stroking. It utilizes a two-stage rendering process for filled paths: first to a float mask buffer, then to the color buffer. Stroked paths are directly rasterized to the color buffer using GPU triangulation. Quadratic Bézier curves are solved on the GPU, enabling coarse curve geometry.\n\nThe architecture involves Path objects, Scene objects (grouping paths with draw parameters), and SceneList objects (grouping scenes with draw parameters). The CPU uses batch parallelism for efficiency, while the GPU remains stateless, writing frames to double-buffered shared memory.\n\nThe demo app, built with included dependencies, allows opening SVG and PDF files, navigation via keyboard, and canvas manipulation with mouse/trackpad. It uses XXHash, NanoSVG, STB Truetype, and PDFium libraries. The library is licensed under a personal use zlib license.\n",
    "chinese_title": "光栅化器：一个约4千行代码的GPU加速2D矢量图形引擎",
    "chinese_summary": "光栅化器是一个GPU加速的2D矢量图形引擎，历经10年开发，灵感来源于Adobe Flash。采用C++ 11编写，并使用Metal（适用于macOS，但可通过实例化和浮点渲染目标适应其他GPU），与CPU渲染相比，速度提升高达60倍，非常适合动画UI。计划开发iOS端口。\n\n该引擎专注于将矢量路径高效地转换为高质量、抗锯齿的像素，采用了优化的解决方案，包括一种用于像素面积覆盖的新型窗口逆插值算法。光栅化器支持Postscript风格的路径、奇偶和非零填充规则以及描边。它对填充路径采用两阶段渲染过程：首先渲染到浮点掩码缓冲区，然后渲染到颜色缓冲区。描边路径使用GPU三角剖分直接光栅化到颜色缓冲区。二次贝塞尔曲线在GPU上求解，从而实现粗略的曲线几何。\n\n其架构涉及Path对象、Scene对象（将路径与绘制参数分组）和SceneList对象（将场景与绘制参数分组）。CPU使用批量并行以提高效率，而GPU保持无状态，将帧写入双缓冲共享内存。\n\n演示应用程序使用包含的依赖项构建，允许打开SVG和PDF文件，通过键盘导航，以及使用鼠标/触控板操纵画布。它使用XXHash、NanoSVG、STB Truetype和PDFium库。该库根据个人使用的zlib许可证授权。"
  },
  {
    "id": "45145624",
    "title": "A sunscreen scandal shocking Australia",
    "url": "https://www.bbc.com/news/articles/c4gzl41rpdqo",
    "summary": "Australia, a country with the highest rates of skin cancer, is grappling with a sunscreen scandal. A report by Choice Australia, a consumer advocacy group, revealed that several popular and expensive sunscreens failed to meet their SPF claims during independent testing. This triggered a massive backlash, a probe by the Therapeutic Goods Association (TGA), and product recalls.\n\nUltra Violette's Lean Screen SPF 50+ was identified as the \"most significant failure,\" returning an SPF of 4. Other brands like Neutrogena, Banana Boat, and Cancer Council also faced scrutiny, though they disputed the findings. Ultra Violette recalled Lean Screen after inconsistent testing results, while other brands paused sales of additional products.\n\nThe scandal has shaken public trust in the industry and raised questions about sunscreen regulation globally. Concerns arose regarding a US-based lab that certified many of the failed sunscreens and the sharing of base formulas among different brands. The TGA is investigating and reviewing SPF testing requirements.\n\nExperts emphasize that effective sunscreens are complex to create, and testing can be subjective. Despite the controversy, they highlight the importance of consistent and sufficient sunscreen use, alongside other protective measures like clothing and shade. While the scandal has caused panic, some experts argue that the fundamental effectiveness of most sunscreens in reducing skin cancer risk remains valid. The scandal serves as a reminder that regulations are only effective if properly enforced.\n",
    "chinese_title": "澳大利亚防晒霜丑闻",
    "chinese_summary": "澳大利亚，皮肤癌发病率最高的国家之一，正面临着一场防晒霜丑闻。消费者权益保护组织Choice Australia的一份报告显示，在独立测试中，几款广受欢迎且价格昂贵的防晒霜未能达到其SPF值的宣称。这引发了大规模的反弹，治疗商品管理局（TGA）的调查以及产品召回。\n\nUltra Violette的Lean Screen SPF 50+被认为是“最严重的失败”，其SPF值仅为4。其他品牌如露得清、香蕉船和癌症委员会也面临审查，尽管他们对调查结果提出异议。Ultra Violette在测试结果不一致后召回了Lean Screen，而其他品牌则暂停了其他产品的销售。\n\n这场丑闻动摇了公众对该行业的信任，并引发了对全球防晒霜监管的质疑。人们对一家位于美国的实验室产生了担忧，该实验室认证了许多不合格的防晒霜，以及不同品牌之间共享基础配方的情况。TGA正在调查并审查SPF测试要求。\n\n专家强调，有效的防晒霜很难制造，而且测试可能具有主观性。尽管存在争议，他们强调持续和充分使用防晒霜的重要性，同时还应采取其他保护措施，如衣物和阴凉处。虽然这场丑闻引起了恐慌，但一些专家认为，大多数防晒霜在降低皮肤癌风险方面的根本有效性仍然有效。这场丑闻提醒人们，只有得到有效执行的法规才能发挥作用。"
  },
  {
    "id": "45133938",
    "title": "Fil's Unbelievable Garbage Collector",
    "url": "https://fil-c.org/fugc",
    "summary": "Fil's Unbelievable Garbage Collector (FUGC) is a parallel, concurrent, on-the-fly, grey-stack, Dijkstra accurate, non-moving garbage collector used in the Fil-C language. It boasts several key features:\n\n*   **Parallel and Concurrent:** Utilizes multiple threads for marking and sweeping, operating concurrently with the program's threads.\n*   **On-the-fly with \"Soft Handshakes\":** Avoids global stop-the-world pauses, using asynchronous callbacks on threads (\"ragged safepoints\") for stack scanning and other GC tasks.\n*   **Grey-Stack and Dijkstra Barrier:** Employs a grey-stack approach requiring rescanning of thread stacks to fixpoint, combined with a Dijkstra store barrier that marks newly pointed-to objects during the marking phase. This eliminates the need for a load barrier.\n*   **Accurate and Non-Moving:** Precisely identifies pointers to objects without moving them in memory, simplifying concurrency. The collector advances as a wavefront and implements incremental updates.\n*   **Safepoints:** Relies on pollchecks and soft handshakes for safe threading and avoids race conditions.\n*   **Efficient Sweeping:** Uses bitvector SIMD for very fast sweeping.\n\nFUGC supports freeing objects, finalizers, weak references, and weak maps, offering strong guarantees on memory safety. Freeing traps subsequent access and double frees, while failure to free allows automatic reclamation. It is inspired by the DLG collector but uses a grey-stack Dijkstra approach and a simpler store barrier. The safepoint infrastructure also allows for debugging and safe signal delivery.\n",
    "chinese_title": "菲尔不可思议的垃圾回收器",
    "chinese_summary": "Fil 的不可思议垃圾回收器 (FUGC) 是一种并行、并发、即时、灰栈、Dijkstra 精确、非移动的垃圾回收器，用于 Fil-C 语言。它拥有以下几个关键特性：\n\n*   **并行和并发：** 利用多个线程进行标记和清理，与程序的线程并发运行。\n*   **即时，采用“软握手”：** 避免全局停顿，使用线程上的异步回调（“不规则安全点”）进行栈扫描和其他 GC 任务。\n*   **灰栈和 Dijkstra 屏障：** 采用灰栈方法，需要重新扫描线程栈以达到不动点，并结合 Dijkstra 存储屏障，该屏障在标记阶段标记新指向的对象。这消除了对加载屏障的需求。\n*   **精确和非移动：** 精确识别指向对象的指针，而不在内存中移动它们，从而简化并发。 回收器作为一个波前推进并实现增量更新。\n*   **安全点：** 依靠轮询检查和软握手来实现线程安全并避免竞争条件。\n*   **高效清理：** 使用位向量 SIMD 实现非常快速的清理。\n\nFUGC 支持释放对象、终结器、弱引用和弱映射，提供强大的内存安全保证。释放陷阱后续访问和双重释放，而未能释放允许自动回收。 它受到 DLG 回收器的启发，但使用灰栈 Dijkstra 方法和更简单的存储屏障。安全点基础设施还允许调试和安全信号传递。"
  },
  {
    "id": "45100516",
    "title": "Debugging Rustler on Illumos",
    "url": "https://system-illumination.org/01-rustler.html",
    "summary": "This article details the author's debugging journey of Rustler, a tool for creating Erlang NIFs (native functions) in Rust, on the Illumos operating system. After migrating a project from Linux to Illumos, NIFs failed to load, resulting in `nif_not_loaded` errors.\n\nThe author utilizes `dtrace` extensively to understand the loading process, tracing system calls like `open` and examining the Erlang code responsible for NIF loading. They discovered that Erlang believed the library was loading successfully, but no NIFs were actually registered.\n\nInvestigation revealed that the Rustler project wasn't properly populating the function array on Illumos. Delving into Rustler's internals, the author found the functions are added via the `inventory` crate, a system for dynamically registering plugins at runtime using compiler intrinsics related to section `.init_array` in ELF files..\n\nThe article explains how the `inventory` crate uses the `.init_array` section of the ELF file to register the NIFs at load time. The author verified that the constructor functions (`__CTOR`) are present in the `.init_array` section, indicating that the compiler is correctly setting up the functions.\n\nThe unresolved problem is now narrowed down to whether the Illumos runtime linker (`ld.so.1`) is properly calling the constructor functions from the `.init_array` section when the shared library is loaded. The author plans to use DTrace to verify whether these functions are actually being called during the library loading process.\n",
    "chinese_title": "在Illumos上调试Rustler",
    "chinese_summary": "本文详细介绍了作者在Illumos操作系统上调试Rustler（一个用于在Rust中创建Erlang NIFs（本地函数）的工具）的历程。在将项目从Linux迁移到Illumos之后，NIFs加载失败，导致`nif_not_loaded`错误。\n\n作者广泛使用`dtrace`来理解加载过程，追踪诸如`open`之类的系统调用，并检查负责NIF加载的Erlang代码。他们发现Erlang认为库已成功加载，但实际上没有任何NIF被注册。\n\n调查显示，Rustler项目在Illumos上没有正确填充函数数组。深入研究Rustler的内部机制后，作者发现这些函数是通过`inventory` crate添加的，这是一个使用与ELF文件中`.init_array`节相关的编译器内在函数在运行时动态注册插件的系统。\n\n本文解释了`inventory` crate如何使用ELF文件的`.init_array`节在加载时注册NIFs。作者验证了构造函数（`__CTOR`）存在于`.init_array`节中，表明编译器正在正确设置函数。\n\n目前尚未解决的问题已缩小到Illumos运行时链接器（`ld.so.1`）在加载共享库时是否正确调用`.init_array`节中的构造函数。作者计划使用DTrace来验证这些函数在库加载过程中是否被实际调用。"
  },
  {
    "id": "45141762",
    "title": "Fantastic pretraining optimizers and where to find them",
    "url": "https://arxiv.org/abs/2509.02046",
    "summary": "This paper, \"Fantastic Pretraining Optimizers and Where to Find Them,\" investigates the performance of ten deep learning optimizers for language model pretraining across varying model scales (0.1B-1.2B parameters) and data-to-model ratios. The authors address the issue of unfair comparisons between optimizers by emphasizing the necessity of rigorous hyperparameter tuning and comprehensive evaluations performed at the end of training, across different model scales and data ratios. They highlight that transferring optimal hyperparameters from one optimizer to another is often suboptimal, and that intermediate checkpoints can be misleading.\n\nThe study reveals that many proposed optimizers offer less speedup over well-tuned AdamW than initially claimed, with the speedup diminishing as model size increases. The fastest optimizers, like Muon and Soap, use matrix-based preconditioners (multiplying gradients with matrices). However, the speedup from matrix-based optimizers is inversely proportional to model scale, decreasing from 1.4x for 0.1B parameter models to only 1.1x for 1.2B parameter models compared to AdamW. The paper concludes that thorough hyperparameter optimization and evaluations at different model scales are crucial for fair and informative comparisons of optimizers in language model pretraining. Reproducible runs are provided for further investigation.\n",
    "chinese_title": "绝佳的预训练优化器及其发现途径",
    "chinese_summary": "论文：神奇的预训练优化器及其寻觅之处\n\n本文研究了十种深度学习优化器在不同模型规模（0.1B-1.2B参数）和数据模型比率下，对语言模型预训练的性能。作者强调了严格的超参数调整和在训练结束时对不同模型规模和数据比例进行全面评估的必要性，从而解决了优化器之间不公平比较的问题。他们指出，将最佳超参数从一个优化器转移到另一个优化器通常不是最优的，并且中间检查点可能会产生误导。\n\n该研究表明，许多提出的优化器提供的加速效果不如精心调整的AdamW最初声称的那么明显，并且随着模型尺寸的增加，加速效果会减弱。Muon和Soap等速度最快的优化器使用基于矩阵的预条件子（将梯度与矩阵相乘）。然而，来自基于矩阵的优化器的加速与模型规模成反比，与AdamW相比，从0.1B参数模型的1.4倍降至1.2B参数模型的仅1.1倍。论文结论是，彻底的超参数优化和在不同模型规模下的评估对于公平且信息丰富的语言模型预训练优化器比较至关重要。提供了可重复的运行，以供进一步研究。"
  },
  {
    "id": "45107534",
    "title": "Decoding UTF-8. Part III: Determining Sequence Length – A Lookup Table",
    "url": "https://nemanjatrifunovic.substack.com/p/decoding-utf-8-part-iii-determining",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "解码UTF-8 (三)：确定序列长度——查表法",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "45150828",
    "title": "Apple sued by 2 authors over use of books in AI training [pdf]",
    "url": "https://storage.courtlistener.com/recap/gov.uscourts.cand.455858/gov.uscourts.cand.455858.1.0_1.pdf",
    "summary": "This document appears to be the text of a legal complaint, specifically a copyright infringement lawsuit filed by two authors against Apple. The core issue revolves around Apple's alleged unauthorized use of the authors' books to train its artificial intelligence (AI) models.\n\nThe document structure includes standard legal complaint elements such as:\n\n*   **Introduction:** Outlining the purpose and scope of the lawsuit.\n*   **Jurisdiction and Venue:** Establishing the legal basis for the court to hear the case.\n*   **Prayer for Relief:** Specifying the damages and remedies the authors seek from Apple, likely including financial compensation for copyright infringement.\n*   **Demand for Jury Trial:** Requesting that the case be decided by a jury rather than a judge alone.\n\nThe complaint asserts that Apple has infringed upon the authors' copyrights by using their books without permission to improve the functionality and capabilities of its AI systems. The authors are seeking redress for this unauthorized use, arguing that it has harmed their exclusive rights as copyright holders.\n\nBased on the PDF structure, it is likely a formal legal document filed with a court. The lawsuit suggests a growing concern among authors and copyright holders about the use of their works in the development of AI technologies, especially without their consent or proper compensation.",
    "chinese_title": "Apple sued by 2 authors over use of books in AI training [pdf]",
    "chinese_summary": "该文件似乎是一份法律诉状的文本，具体而言是由两位作者提起的针对苹果公司的版权侵权诉讼。核心问题围绕苹果公司涉嫌未经授权使用作者的书籍来训练其人工智能（AI）模型。\n\n该文件结构包括标准的法律诉状要素，例如：\n\n*   **介绍：** 概述诉讼的目的和范围。\n*   **管辖权和审判地点：** 确立法院审理此案的法律依据。\n*   **诉讼请求：** 明确作者向苹果公司寻求的损害赔偿和补救措施，可能包括对版权侵权的经济赔偿。\n*   **要求陪审团审判：** 要求该案件由陪审团而非法官单独裁决。\n\n诉状声称，苹果公司未经许可使用作者的书籍来提高其人工智能系统的功能和能力，从而侵犯了作者的版权。作者正在寻求对此未经授权使用的补救，并认为这损害了他们作为版权持有人的专有权利。\n\n基于PDF结构，这很可能是一份已向法院提交的正式法律文件。该诉讼表明，作者和版权持有人越来越关注他们的作品在人工智能技术开发中的使用，尤其是在未经他们同意或适当补偿的情况下。"
  },
  {
    "id": "45138156",
    "title": "Development speed is not a bottleneck",
    "url": "https://pawelbrodzinski.substack.com/p/development-speed-is-not-a-bottleneck",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "Development speed is not a bottleneck",
    "chinese_summary": "Unable to access the article link.\n"
  },
  {
    "id": "45150687",
    "title": "Zuckerberg on hot mic telling Trump he wasn't sure how much to spend on AI",
    "url": "https://www.engadget.com/zuckerberg-caught-on-hot-mic-telling-trump-i-wasnt-sure-how-much-to-promise-to-spend-on-ai-in-the-us-211915608.html",
    "summary": "This article reports on a White House dinner hosted by President Donald Trump for tech CEOs, focusing on the interactions between Trump and Meta CEO Mark Zuckerberg. After Trump jokingly threatened Zuckerberg with jail a year prior, the relationship seems to have improved significantly.\n\nThe article highlights a moment where Trump asks Zuckerberg how much Meta plans to spend on AI in the coming years. Zuckerberg estimates \"$600 billion through 2028 in the US,\" seemingly pleasing Trump. However, a later \"hot mic\" moment reveals Zuckerberg apologizing to Trump for not being ready and \"not sure what number you wanted to go with.\"\n\nThe article suggests that Zuckerberg has been actively working to gain Trump's favor through actions such as donating to his inauguration, changing Meta's policies, renouncing DEI, adding a pro-Trump board member, settling a lawsuit, and holding private meetings. The article implies that these efforts have paid off, as Trump now appears to approve of Zuckerberg's AI spending commitment.\n\nZuckerberg later addressed the \"hot mic\" incident on Threads, claiming he wasn't sure which spending figure Trump was referring to and shared the lower estimate for the period through 2028, clarifying afterwards that the company might spend even more by the end of the decade.\n",
    "chinese_title": "Zuckerberg on hot mic telling Trump he wasn't sure how much to spend on AI",
    "chinese_summary": "This article reports on a White House dinner hosted by President Donald Trump for tech CEOs, focusing on the interactions between Trump and Meta CEO Mark Zuckerberg. After Trump jokingly threatened Zuckerberg with jail a year prior, the relationship seems to have improved significantly.\n\nThe article highlights a moment where Trump asks Zuckerberg how much Meta plans to spend on AI in the coming years. Zuckerberg estimates \"$600 billion through 2028 in the US,\" seemingly pleasing Trump. However, a later \"hot mic\" moment reveals Zuckerberg apologizing to Trump for not being ready and \"not sure what number you wanted to go with.\"\n\nThe article suggests that Zuckerberg has been actively working to gain Trump's favor through actions such as donating to his inauguration, changing Meta's policies, renouncing DEI, adding a pro-Trump board member, settling a lawsuit, and holding private meetings. The article implies that these efforts have paid off, as Trump now appears to approve of Zuckerberg's AI spending commitment.\n\nZuckerberg later addressed the \"hot mic\" incident on Threads, claiming he wasn't sure which spending figure Trump was referring to and shared the lower estimate for the period through 2028, clarifying afterwards that the company might spend even more by the end of the decade.\n"
  },
  {
    "id": "45139270",
    "title": "A computer upgrade shut down BART",
    "url": "https://www.bart.gov/news/articles/2025/news20250905",
    "summary": "BART service has resumed throughout the system after a computer upgrade caused a shutdown. All stations are now open, however, passengers should anticipate residual delays across the entire BART system.\n",
    "chinese_title": "A computer upgrade shut down BART",
    "chinese_summary": "BART service has resumed throughout the system after a computer upgrade caused a shutdown. All stations are now open, however, passengers should anticipate residual delays across the entire BART system.\n"
  },
  {
    "id": "45103492",
    "title": "Rearchitecting GitHub Pages (2015)",
    "url": "https://github.blog/news-insights/rearchitecting-github-pages/",
    "summary": "生成摘要时出错",
    "chinese_title": "Rearchitecting GitHub Pages (2015)",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45129085",
    "title": "Stripe Launches L1 Blockchain: Tempo",
    "url": "https://tempo.xyz",
    "summary": "生成摘要时出错",
    "chinese_title": "Stripe Launches L1 Blockchain: Tempo",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45132810",
    "title": "What Is the Fourier Transform?",
    "url": "https://www.quantamagazine.org/what-is-the-fourier-transform-20250903/",
    "summary": "生成摘要时出错",
    "chinese_title": "What Is the Fourier Transform?",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45124003",
    "title": "30 minutes with a stranger",
    "url": "https://pudding.cool/2025/06/hello-stranger/",
    "summary": "生成摘要时出错",
    "chinese_title": "30 minutes with a stranger",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45130260",
    "title": "LLM Visualization",
    "url": "https://bbycroft.net/llm",
    "summary": "生成摘要时出错",
    "chinese_title": "LLM Visualization",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45146540",
    "title": "Leptos",
    "url": "https://leptos.dev/",
    "summary": "生成摘要时出错",
    "chinese_title": "Leptos",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45148913",
    "title": "GOP may succeed in unrelenting quest to kill two NASA climate satellites",
    "url": "https://arstechnica.com/space/2025/09/gop-may-finally-succeed-in-unrelenting-quest-to-kill-two-nasa-climate-satellites/",
    "summary": "生成摘要时出错",
    "chinese_title": "GOP may succeed in unrelenting quest to kill two NASA climate satellites",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45135529",
    "title": "Age verification doesn’t work",
    "url": "https://pornbiz.com/post/17/the_scam_of_age_verification",
    "summary": "生成摘要时出错",
    "chinese_title": "Age verification doesn’t work",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45143528",
    "title": "Jonathan's Space Report",
    "url": "https://planet4589.org/index.html",
    "summary": "生成摘要时出错",
    "chinese_title": "Jonathan's Space Report",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45133935",
    "title": "Forking Chrome to render in a terminal (2023)",
    "url": "https://fathy.fr/carbonyl",
    "summary": "生成摘要时出错",
    "chinese_title": "Forking Chrome to render in a terminal (2023)",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45128391",
    "title": "Wikipedia survives while the rest of the internet breaks",
    "url": "https://www.theverge.com/cs/features/717322/wikipedia-attacks-neutrality-history-jimmy-wales",
    "summary": "生成摘要时出错",
    "chinese_title": "Wikipedia survives while the rest of the internet breaks",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45149707",
    "title": "PostgreSQL 18 RC 1 Released",
    "url": "https://www.postgresql.org/about/news/postgresql-18-rc-1-released-3130/",
    "summary": "生成摘要时出错",
    "chinese_title": "PostgreSQL 18 RC 1 Released",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45150493",
    "title": "Musk's $1T pay package is full of watered-down takes on his own broken promises",
    "url": "https://techcrunch.com/2025/09/06/musks-1t-pay-package-is-full-of-watered-down-versions-of-his-own-broken-promises/",
    "summary": "生成摘要时出错",
    "chinese_title": "Musk's $1T pay package is full of watered-down takes on his own broken promises",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45129237",
    "title": "A PM's Guide to AI Agent Architecture",
    "url": "https://www.productcurious.com/p/a-pms-guide-to-ai-agent-architecture",
    "summary": "生成摘要时出错",
    "chinese_title": "A PM's Guide to AI Agent Architecture",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45123034",
    "title": "Polars Cloud and Distributed Polars now available",
    "url": "https://pola.rs/posts/polars-cloud-launch/",
    "summary": "生成摘要时出错",
    "chinese_title": "Polars Cloud and Distributed Polars now available",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45143945",
    "title": "Should we revisit Extreme Programming in the age of AI?",
    "url": "https://www.hyperact.co.uk/blog/should-we-revisit-xp-in-the-age-of-ai",
    "summary": "生成摘要时出错",
    "chinese_title": "Should we revisit Extreme Programming in the age of AI?",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45106011",
    "title": "We already live in social credit, we just don't call it that",
    "url": "https://www.thenexus.media/your-phone-already-has-social-credit-we-just-lie-about-it/",
    "summary": "生成摘要时出错",
    "chinese_title": "We already live in social credit, we just don't call it that",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45146494",
    "title": "Show HN: Inception: Automatic Rust Trait Implementation by Induction",
    "url": "https://github.com/nicksenger/Inception",
    "summary": "生成摘要时出错",
    "chinese_title": "Show HN: Inception: Automatic Rust Trait Implementation by Induction",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45144403",
    "title": "Supercharger for Business – Tesla",
    "url": "https://www.tesla.com/supercharger-for-business",
    "summary": "生成摘要时出错",
    "chinese_title": "Supercharger for Business – Tesla",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45124143",
    "title": "Melvyn Bragg steps down from presenting In Our Time",
    "url": "https://www.bbc.co.uk/mediacentre/2025/melvyn-bragg-decides-to-step-down-from-presenting-in-our-time/",
    "summary": "生成摘要时出错",
    "chinese_title": "Melvyn Bragg steps down from presenting In Our Time",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45150226",
    "title": "Debian 13.1 Released",
    "url": "https://www.debian.org/News/2025/20250906",
    "summary": "生成摘要时出错",
    "chinese_title": "Debian 13.1 Released",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45126950",
    "title": "Building Supabase-Like OAuth Authentication for MCP Servers",
    "url": "https://hyprmcp.com/blog/mcp-server-authentication/",
    "summary": "生成摘要时出错",
    "chinese_title": "Building Supabase-Like OAuth Authentication for MCP Servers",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45126358",
    "title": "Atlassian is acquiring The Browser Company",
    "url": "https://www.cnbc.com/2025/09/04/atlassian-the-browser-company-deal.html",
    "summary": "生成摘要时出错",
    "chinese_title": "Atlassian is acquiring The Browser Company",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45131243",
    "title": "Action was the best 8-bit programming language",
    "url": "https://www.goto10retro.com/p/action-was-the-best-8-bit-programming",
    "summary": "生成摘要时出错",
    "chinese_title": "Action was the best 8-bit programming language",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45127983",
    "title": "WiFi signals can measure heart rate",
    "url": "https://news.ucsc.edu/2025/09/pulse-fi-wifi-heart-rate/",
    "summary": "生成摘要时出错",
    "chinese_title": "WiFi signals can measure heart rate",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45090963",
    "title": "I should have loved electrical engineering",
    "url": "https://blog.tdhttt.com/post/love-ee/",
    "summary": "生成摘要时出错",
    "chinese_title": "I should have loved electrical engineering",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45123003",
    "title": "Étoilé – desktop built on GNUStep",
    "url": "http://etoileos.com/",
    "summary": "生成摘要时出错",
    "chinese_title": "Étoilé – desktop built on GNUStep",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45132710",
    "title": "io_uring is faster than mmap",
    "url": "https://www.bitflux.ai/blog/memory-is-slow-part2/",
    "summary": "生成摘要时出错",
    "chinese_title": "io_uring is faster than mmap",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45117107",
    "title": "API Blueprint",
    "url": "https://apiblueprint.org",
    "summary": "生成摘要时出错",
    "chinese_title": "API Blueprint",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45125859",
    "title": "Le Chat: Custom MCP Connectors, Memories",
    "url": "https://mistral.ai/news/le-chat-mcp-connectors-memories",
    "summary": "生成摘要时出错",
    "chinese_title": "Le Chat: Custom MCP Connectors, Memories",
    "chinese_summary": "生成摘要时出错"
  }
]