[
  {
    "id": "45981760",
    "title": "Questions for Cloudflare",
    "url": "https://entropicthoughts.com/questions-for-cloudflare",
    "summary": "This article analyzes Cloudflare's recent outage, focusing on the lack of feedback mechanisms in their system design. While Cloudflare's post-outage analysis highlights control issues, the author argues that the root cause was a failure to understand the system's state. The initial protocol mismatch and delayed resolution stem from a lack of visibility, not a lack of control.\n\nThe author poses critical questions related to Cloudflare's operator interfaces and understanding of system behavior. Specifically, they ask: Does Cloudflare deliberately design operator interfaces? Does Cloudflare actively consider how operators can better understand the system's functionality and failures? The author suggests the Cloudflare blog post implies the answer is \"no\".\n\nThe article then delves into specific scenarios involving Cloudflare's Bot Management system, questioning how it handles timeouts, requests gone from the system, and situations where it's not running. Furthermore, the author probes how Cloudflare manages internal protocol compliance, how operators are alerted to outdated features files, and whether the feature file generator receives feedback on the quality of its output.\n\nFinally, the author inquires about the process for operators to reconfigure request flow and the information they use to make those decisions. They also question the efficacy of observability tools and highlight the problem of misleading information during incidents. Ultimately, the author expresses disappointment with the perceived lack of thoroughness in technical organizations' accident investigations.\n",
    "chinese_title": "针对Cloudflare的问题",
    "chinese_summary": "本文分析了 Cloudflare 近期发生的故障，重点关注其系统设计中反馈机制的缺失。尽管 Cloudflare 在故障后的分析中强调了控制问题，但作者认为根本原因是未能理解系统状态。最初的协议不匹配和延迟解决源于缺乏可见性，而非缺乏控制。\n\n作者提出了与 Cloudflare 运维界面和对系统行为的理解相关的关键问题。具体来说，他们问道：Cloudflare 是否刻意设计运维界面？Cloudflare 是否积极考虑运维人员如何更好地理解系统的功能和故障？作者认为 Cloudflare 的博客文章暗示答案是“否”。\n\n文章随后深入探讨了涉及 Cloudflare 机器人管理系统的具体场景，质疑其如何处理超时、系统内已消失的请求以及未运行的情况。此外，作者还探究了 Cloudflare 如何管理内部协议合规性，运维人员如何收到有关过期功能文件的警报，以及功能文件生成器是否收到关于其输出质量的反馈。\n\n最后，作者询问了运维人员重新配置请求流程的流程以及他们用于做出这些决策的信息。他们还质疑了可观察性工具的有效性，并强调了事件期间误导性信息的问题。最终，作者对技术组织事故调查的彻底性不足表示失望。"
  },
  {
    "id": "45981009",
    "title": "Emoji Evidence Errors Don't Undo a Murder Conviction–People vs. Harmon",
    "url": "https://blog.ericgoldman.org/archives/2025/11/emoji-evidence-errors-dont-undo-a-murder-conviction-people-v-harmon.htm",
    "summary": "This article discusses the case of *People v. Harmon*, where Delarosa's murder conviction was upheld despite an error in how emoji evidence was presented. Delarosa appealed, arguing a Facebook message introduced as evidence, containing emojis indicating he owned a gun, should have been excluded.\n\nThe issue arose because the law enforcement investigator's description of the emojis (\"smiley face emoji and a devil horn emoji\") was ambiguous, as the face-with-tears-of-joy emoji has different connotations than a regular smiley face. The author believes visually depicting the emojis would have been more helpful.\n\nHowever, the crucial error occurred during Delarosa's pre-trial motion to exclude the message. The printout submitted as evidence contained rectangles instead of the actual emojis, failing to adequately inform the judge about their potential impact on the jury (specifically, suggesting a \"glib attitude towards gun violence\"). The appeals court ruled the trial judge couldn't be faulted for denying the motion because the evidence presented was incomplete.\n\nThe author expresses concern that Delarosa was effectively exposed to prejudicial evidence (the message with emojis) without a proper pre-trial challenge. While acknowledging the difficulty of handling vast amounts of evidence, the author highlights the importance of lawyers accurately presenting emoji evidence in court. The correct depiction of emojis may require understanding how they appeared to both sender and recipient, potentially involving recreating the historical technical environment. The opinion, however, did not display either the emojis or the rectangle replacements.\n",
    "chinese_title": "表情符号证据错误并未撤销谋杀罪定罪——人民诉哈蒙案",
    "chinese_summary": "本文讨论了“人民诉哈蒙案”，其中尽管表情符号证据的呈现方式存在错误，德拉罗萨的谋杀定罪仍被维持。德拉罗萨提出上诉，认为作为证据引入的一条Facebook消息（包含指示他拥有一把枪的表情符号）应该被排除在外。\n\n问题的出现是因为执法调查员对表情符号的描述（“笑脸表情符号和一个魔鬼角表情符号”）含糊不清，因为喜极而泣的表情符号与普通的笑脸表情符号具有不同的含义。作者认为以视觉方式描绘表情符号会更有帮助。\n\n然而，关键的错误发生在德拉罗萨的审前动议中，该动议旨在排除这条消息。作为证据提交的打印件包含的是矩形而不是实际的表情符号，未能充分告知法官这些表情符号对陪审团的潜在影响（特别是暗示了一种“对枪支暴力的轻率态度”）。上诉法院裁定，审判法官不应因驳回该动议而受到指责，因为提交的证据不完整。\n\n作者表示担心德拉罗萨实际上在没有适当的审前挑战的情况下暴露于具有偏见性的证据（带有表情符号的消息）。虽然承认处理大量证据的困难，但作者强调了律师在法庭上准确呈现表情符号证据的重要性。表情符号的正确描绘可能需要了解它们在发送者和接收者眼中是如何显示的，可能涉及重现历史技术环境。然而，该判决既没有显示表情符号，也没有显示矩形替代物。"
  },
  {
    "id": "45980760",
    "title": "Launch HN: Mosaic (YC W25) – Agentic Video Editing",
    "url": "https://mosaic.so",
    "summary": "Mosaic, a YC W25 startup, is launching an agentic AI video editing platform. The platform aims to automate and streamline the video editing process, likely by using AI agents to perform tasks such as cutting footage, adding transitions, generating captions, and improving audio. The phrase \"agentic\" implies that the AI can act autonomously and intelligently to achieve specific editing goals, reducing the need for manual intervention. Essentially, Mosaic aims to be an AI-powered assistant that can handle much of the grunt work involved in video editing, allowing creators to focus on the creative aspects of their projects. It is likely targeted at content creators, marketers, and businesses who need to produce video content regularly but want to save time and resources on editing. The launch on Hacker News (\"Launch HN\") suggests that Mosaic is seeking feedback from the tech community and aiming for adoption by early adopters. Given its mention of YC W25, this is a brand new product that is coming out of Y Combinator's Winter 2025 batch.\n",
    "chinese_title": "发布HN：Mosaic (YC W25) – 代理式视频编辑",
    "chinese_summary": "Mosaic推出代理型AI视频编辑平台"
  },
  {
    "id": "45920490",
    "title": "Programming the Commodore 64 with .NET",
    "url": "https://retroc64.github.io/",
    "summary": "RetroC64 brings Commodore 64 programming into the modern .NET ecosystem. It allows developers to build, assemble, run, and debug C64 programs directly within their IDE, eliminating traditional retro development friction.\n\nKey features include:\n\n*   **Zero Friction Development:** Easily emit PRG/D64 files and auto-launch code in the VICE emulator from .NET.\n*   **Fluent Assembler (Asm6502):** Features labels, sections, data blocks, helpers, and source mapping for C#.\n*   **Sprite Tooling:** Convert Skia drawings into C64-compatible sprite bytes automatically.\n*   **SID Tooling:** Load, relocate, and play SID music, including target address and zero-page range configuration.\n*   **Core Helpers:** Offers C64Assembler with Zero-Page allocation, raster IRQ setup, sprite classes, and PRG/D64 image file support for rapid prototyping.\n*   **Debugging:** Integrates with VS Code for debugging C64 code, including register/memory/VIC/SID register inspection, breakpoints, execution control, and disassembly view.\n\nEssentially, RetroC64 provides a suite of tools and libraries to streamline the C64 development process, making it more accessible and efficient for .NET developers. A demo from .NET Conf 2025 showcases its capabilities.\n",
    "chinese_title": "使用 .NET 为 Commodore 64 编程",
    "chinese_summary": "RetroC64将Commodore 64编程带入现代.NET生态系统。它允许开发者直接在其IDE中构建、汇编、运行和调试C64程序，消除了传统复古开发的阻碍。\n\n主要特性包括：\n\n*   **零阻力开发：** 从.NET轻松生成PRG/D64文件并在VICE模拟器中自动启动代码。\n*   **流畅的汇编器 (Asm6502)：** 具有标签、节、数据块、助手和C#的源映射。\n*   **精灵工具：** 自动将Skia绘图转换为C64兼容的精灵字节。\n*   **SID工具：** 加载、重定位和播放SID音乐，包括目标地址和零页范围配置。\n*   **核心助手：** 提供带有零页分配的C64Assembler、光栅IRQ设置、精灵类和PRG/D64镜像文件支持，以实现快速原型设计。\n*   **调试：** 与VS Code集成以调试C64代码，包括寄存器/内存/VIC/SID寄存器检查、断点、执行控制和反汇编视图。\n\n本质上，RetroC64提供了一套工具和库来简化C64开发过程，使其对于.NET开发者来说更易于访问和高效。来自.NET Conf 2025的演示展示了其功能。"
  },
  {
    "id": "45979297",
    "title": "Your Smartphone, Their Rules: App Stores Enable Corporate-Government Censorship",
    "url": "https://www.aclu.org/news/free-speech/app-store-oligopoly",
    "summary": "This ACLU article argues that the dominance of Apple's App Store and Google's Play Store creates a dangerous environment for censorship, as these platforms can be pressured by governments to remove apps that express dissenting views or criticize government actions. The article highlights the removal of apps like ICEBlock and Red Dot, which allowed users to report sightings of ICE agents, as examples of this censorship.\n\nWhile Apple's iOS system only allows apps from its App Store, making it particularly vulnerable to censorship, Google's Android system, traditionally more open to \"sideloading,\" is also becoming increasingly restrictive with its new \"verified developer\" requirement. This change could allow governments to pressure Google into treating developers as \"bad actors,\" effectively cutting off their apps.\n\nThe article contrasts this situation with the EU, where the Digital Markets Act has forced Apple to allow alternative app stores and sideloading. It also points out that while app stores claim to improve security, they often allow apps with surveillance tools and are themselves platforms for surveillance.\n\nThe author advocates for user choice, open standards, and regulatory intervention to disrupt oligopolistic control over software. They suggest alternative app stores like Accrescent and F-Droid, which prioritize privacy and security, and urge readers to support free software and demand tools that use open standards. The article concludes that the device users carry with them should be under their control, not the control of abusive governments or corporations.\n",
    "chinese_title": "你的智能手机，他们的规则：应用商店助长企业-政府审查",
    "chinese_summary": "美国公民自由联盟的这篇文章认为，苹果应用商店和谷歌应用商店的垄断地位为审查制度创造了一个危险的环境，因为这些平台可能会受到政府的压力，移除表达异议或批评政府行为的应用。 文章重点提到了ICEBlock和Red Dot等应用的移除，这些应用允许用户报告移民及海关执法局特工的踪迹，作为这种审查制度的例子。\n\n虽然苹果的iOS系统只允许从其应用商店下载应用，使其特别容易受到审查，但谷歌的安卓系统传统上更开放“侧载”，但随着其新的“验证开发者”要求，也变得越来越严格。 这一变化可能使政府能够向谷歌施压，将开发者视为“不良行为者”，从而有效地切断他们的应用。\n\n文章将这种情况与欧盟进行了对比，在欧盟，数字市场法案已迫使苹果允许替代应用商店和侧载。 它还指出，虽然应用商店声称可以提高安全性，但它们通常允许使用监控工具的应用，并且本身就是监控平台。\n\n作者倡导用户选择、开放标准和监管干预，以打破对软件的寡头垄断控制。 他们建议使用Accrescent和F-Droid等替代应用商店，这些应用商店优先考虑隐私和安全，并敦促读者支持自由软件并要求使用开放标准的工具。 文章总结说，用户随身携带的设备应该由他们自己控制，而不是由滥用权力的政府或公司控制。"
  },
  {
    "id": "45981666",
    "title": "Adventures in Upgrading Proxmox",
    "url": "https://blog.vasi.li/adventures-in-upgrading-proxmox/",
    "summary": "The author recounts their experience upgrading a Proxmox cluster from version 8 to 9, focusing on the challenges encountered on a node running an NVR with a Coral TPU. The initial motivation for the upgrade was to resolve an AppArmor issue affecting Docker containers running inside LXC containers, impacting the deployment of Coolify and Dokploy.\n\nWhile one node upgraded smoothly, the second node, crucial for the NVR, failed after the upgrade. This was due to the Apex TPU drivers, installed as a DKMS module, failing to rebuild for the new kernel, resulting in a non-booting system. The author was able to boot using a previous kernel, but the new kernel consistently kernel panicked with \"unable to mount rootfs on unknown-block(0,0)\".\n\nAfter troubleshooting, the author resolved the boot issue by using `proxmox-boot-tool init` to properly initialize the EFI partition, following a Reddit thread suggestion. This allowed the system to boot with the upgraded kernel.\n\nHowever, the upgrade also broke the Apex TPU drivers, requiring a source code patch to address API changes in the new kernel. The author found a relevant patch online, applied it, rebuilt the driver, and successfully restored functionality to the NVR system, including the Frigate application.\n",
    "chinese_title": "升级Proxmox历险记",
    "chinese_summary": "The author recounts their experience upgrading a Proxmox cluster from version 8 to 9, focusing on the challenges encountered on a node running an NVR with a Coral TPU. The initial motivation for the upgrade was to resolve an AppArmor issue affecting Docker containers running inside LXC containers, impacting the deployment of Coolify and Dokploy.\n\nWhile one node upgraded smoothly, the second node, crucial for the NVR, failed after the upgrade. This was due to the Apex TPU drivers, installed as a DKMS module, failing to rebuild for the new kernel, resulting in a non-booting system. The author was able to boot using a previous kernel, but the new kernel consistently kernel panicked with \"unable to mount rootfs on unknown-block(0,0)\".\n\nAfter troubleshooting, the author resolved the boot issue by using `proxmox-boot-tool init` to properly initialize the EFI partition, following a Reddit thread suggestion. This allowed the system to boot with the upgraded kernel.\n\nHowever, the upgrade also broke the Apex TPU drivers, requiring a source code patch to address API changes in the new kernel. The author found a relevant patch online, applied it, rebuilt the driver, and successfully restored functionality to the NVR system, including the Frigate application.\n"
  },
  {
    "id": "45977744",
    "title": "The $1k AWS Mistake",
    "url": "https://www.geocod.io/code-and-coordinates/2025-11-18-the-1000-aws-mistake/",
    "summary": "Mathias Hansen recounts a $1,000 AWS mistake stemming from unexpected NAT Gateway data transfer charges when moving data to S3 from their ETL platform (Hetzner). Despite confirming free EC2-to-S3 transfers within the same region and free transfers *into* S3, the default VPC setup routes S3 traffic through the NAT Gateway, incurring charges of $0.045 per GB. The culprit was identified through AWS Cost Anomaly Detection, highlighting its importance.\n\nThe solution involves using VPC Gateway Endpoints for S3, which create a direct, free route from the VPC to S3, bypassing the NAT Gateway. Implementing this using Terraform was straightforward.\n\nThe key takeaway is the deceptively complex nature of AWS networking and the necessity of validating assumptions. Even when transfer fees appear to be free, internal routing can lead to unexpected charges. The article emphasizes the importance of using VPC Endpoints for S3 and DynamoDB when using a NAT Gateway, enabling AWS Cost Anomaly Detection, and testing with small datasets before scaling. The author stresses that even experienced AWS users can encounter such issues. The article concludes with a recommendation to audit VPC Endpoint configurations to avoid similar problems and provides links to relevant resources.\n",
    "chinese_title": "价值一千美元的AWS错误",
    "chinese_summary": "Mathias Hansen讲述了一起因意外的NAT网关数据传输费用导致的价值1000美元的AWS错误，该错误源于从其ETL平台(Hetzner)向S3移动数据。 尽管确认了同一区域内的EC2到S3的免费传输以及 *进入* S3的免费传输，但默认的VPC设置仍会将S3流量通过NAT网关路由，从而产生每GB 0.045美元的费用。 罪魁祸首通过AWS成本异常检测被识别出来，突显了其重要性。\n\n解决方案是使用S3的VPC网关端点，该端点创建了从VPC到S3的直接免费路由，绕过了NAT网关。 使用Terraform实现这一点非常简单。\n\n关键的启示是AWS网络的欺骗性复杂性以及验证假设的必要性。 即使传输费用看起来是免费的，内部路由也可能导致意外费用。 本文强调了在使用NAT网关时使用S3和DynamoDB的VPC端点的重要性，启用AWS成本异常检测以及在扩展之前使用小型数据集进行测试。 作者强调，即使是经验丰富的AWS用户也可能遇到此类问题。 文章最后建议审核VPC端点配置以避免类似问题，并提供了相关资源的链接。"
  },
  {
    "id": "45979232",
    "title": "The Peaceful Transfer of Power in Open Source Projects",
    "url": "https://shkspr.mobi/blog/2025/11/the-peaceful-transfer-of-power-in-open-source-projects/",
    "summary": "This article highlights the importance of planning for the succession of leadership in open-source projects, drawing a parallel between historical kingdoms and the common \"Benevolent Dictator For Life\" (BDFL) governance model in OSS. The author argues that the BDFL model, while initially effective, can become problematic if the \"dictator\" becomes tyrannical or incapacitated, leading to project instability.\n\nThe author contrasts negative examples of BDFLs with the Mastodon project's recent, positive approach to leadership transition. Eugen Rochko, Mastodon's CEO, openly addressed the pressures of leadership and the potential for him to be a limiting factor, demonstrating a mature and selfless approach to ensuring the project's continued growth.\n\nThe article criticizes the ego-driven behavior of some founders and calls for OSS project leaders to adopt practices similar to democratic governance, emphasizing the importance of shared responsibility, transparency, and a smooth transfer of power. It urges larger projects, in particular, to establish succession plans to prevent the project from collapsing upon the departure or downfall of its founder. The central message is a plea for project leaders to act maturely and proactively ensure the long-term health and stability of their projects, rather than clinging to power and potentially jeopardizing their future.\n",
    "chinese_title": "开源项目中权力的和平转移",
    "chinese_summary": "本文强调了为开源项目规划领导层继任的重要性，并将历史王国与开源软件中常见的“终身仁慈独裁者”（BDFL）治理模式进行了类比。作者认为，BDFL模式虽然初期有效，但如果“独裁者”变得专横或丧失能力，可能会导致项目不稳定。\n\n作者将BDFL的负面例子与Mastodon项目最近在领导层过渡方面的积极做法进行了对比。Mastodon的首席执行官Eugen Rochko公开承认领导层面临的压力以及他可能成为限制因素的潜力，这表明他采取了一种成熟和无私的方式来确保项目的持续发展。\n\n本文批评了一些创始人的以自我为中心的行为，并呼吁开源项目领导者采取类似于民主治理的做法，强调共同责任、透明度和权力平稳交接的重要性。它尤其敦促大型项目制定继任计划，以防止项目在创始人离开或倒台后崩溃。中心信息是呼吁项目领导者以成熟和积极的态度行事，确保项目的长期健康和稳定，而不是紧抓权力不放，并可能危及其未来。"
  },
  {
    "id": "45967211",
    "title": "Gemini 3",
    "url": "https://blog.google/products/gemini/gemini-3/",
    "summary": "Gemini 3, Google's latest and most intelligent AI model, is being released to enhance reasoning and multimodal capabilities. It's accessible across Google products like the Gemini app, AI Studio, Vertex AI, and AI Mode in Search, with a \"Deep Think\" mode coming soon for Ultra subscribers.\n\nGemini 3 Pro outperforms previous models in reasoning, multimodality, and coding benchmarks, topping the LMArena Leaderboard and achieving state-of-the-art scores in various AI benchmarks, excelling in problem-solving across science and mathematics. The Deep Think mode further enhances Gemini 3's capabilities for solving complex problems.\n\nGemini 3's multimodal reasoning and 1 million-token context window allow users to learn effectively, synthesizing information from text, images, video, audio, and code. Gemini 3 can translate recipes, analyze academic papers, and provide expert-level sports analysis. AI Mode in Search leverages Gemini 3 for immersive visual layouts and interactive tools.\n\nFor developers, Gemini 3 is exceptional at zero-shot generation and excels in agentic coding, outperforming previous models on coding benchmarks. Developers can build with Gemini 3 in Google AI Studio, Vertex AI, Gemini CLI, Google Antigravity, and third-party platforms. Google Antigravity, a new agentic development platform, uses Gemini 3's reasoning and tool use to transform AI assistance. Gemini 3 exhibits improved long-horizon planning, enabling users to manage complex workflows. Gemini Agent in the Gemini app helps Google AI Ultra subscribers organize their Gmail inbox.\n\nGoogle emphasizes that Gemini 3 is its most secure model, undergoing extensive safety evaluations. Gemini 3 is rolling out across various platforms, with additional models planned for the Gemini 3 series.\n",
    "chinese_title": "双子星3号",
    "chinese_summary": "Gemini 3：谷歌最新最智能的AI模型，发布以增强推理和多模态能力。它可在谷歌产品（如 Gemini 应用、AI Studio、Vertex AI 以及搜索中的 AI 模式）中使用，Ultra 订阅用户即将迎来“深度思考”模式。\n\nGemini 3 Pro 在推理、多模态和编码基准测试中优于之前的模型，登顶 LMArena 排行榜，并在各种 AI 基准测试中取得领先成绩，擅长解决科学和数学领域的难题。“深度思考”模式将进一步增强 Gemini 3 解决复杂问题的能力。\n\nGemini 3 的多模态推理能力和 100 万 token 上下文窗口使用户能够有效地学习，从文本、图像、视频、音频和代码中综合信息。 Gemini 3 可以翻译食谱、分析学术论文并提供专家级别的体育分析。搜索中的 AI 模式利用 Gemini 3 实现沉浸式视觉布局和交互式工具。\n\n对于开发者而言，Gemini 3 在零样本生成方面表现出色，并在代理编码方面表现出色，在编码基准测试中优于之前的模型。开发者可以在 Google AI Studio、Vertex AI、Gemini CLI、Google Antigravity 和第三方平台上使用 Gemini 3 进行构建。Google Antigravity 是一个新的代理开发平台，它利用 Gemini 3 的推理和工具使用来转变 AI 辅助。 Gemini 3 表现出改进的长期规划能力，使用户能够管理复杂的工作流程。 Gemini 应用中的 Gemini Agent 可帮助 Google AI Ultra 订阅用户整理他们的 Gmail 收件箱。\n\n谷歌强调 Gemini 3 是其最安全的模型，已接受广泛的安全评估。 Gemini 3 正在各个平台上推出，Gemini 3 系列还将推出更多模型。"
  },
  {
    "id": "45974012",
    "title": "I made a down detector for down detector",
    "url": "https://downdetectorsdowndetector.com",
    "summary": "This article humorously describes a user attempting to create a \"down detector\" specifically for the website Down Detector (downdetector.com). The article presents a simple, self-referential check, mirroring the function of Down Detector itself. The user is waiting for status updates from various regions, presumably to determine if Down Detector is operational in those locations. It shows a basic interface displaying \"Region,\" \"Status,\" \"HTTP,\" and \"Latency\" columns, presumably meant to show the result of the checks. However, the key point is that the checks are still \"Loading,\" indicating the down detector for Down Detector is currently unable to provide a status update. The article highlights the irony of needing a service to check the uptime of a service whose purpose is to check the uptime of other services. It's a brief, likely tongue-in-cheek demonstration of a monitoring tool applied to a website that provides similar monitoring.\n",
    "chinese_title": "我做了一个检测器，用来检测down检测器。",
    "chinese_summary": "用户尝试为Down Detector创建“Down Detector”的幽默描述"
  },
  {
    "id": "45977542",
    "title": "Multimodal Diffusion Language Models for Thinking-Aware Editing and Generation",
    "url": "https://github.com/tyfeld/MMaDA-Parallel",
    "summary": "This paper introduces MMaDA-Parallel, a novel parallel multimodal diffusion framework designed to improve thinking-aware image editing and generation. The authors identified a problem with existing sequential approaches: error propagation can degrade performance, especially when the generated reasoning and final image are misaligned. To analyze this, they created ParaBench, a benchmark for evaluating both text and image outputs.\n\nMMaDA-Parallel addresses the misalignment issue by enabling continuous, bidirectional interaction between text and images throughout the entire denoising process. The model is trained using supervised finetuning and further optimized with Parallel Reinforcement Learning (ParaRL), which applies semantic rewards along the denoising trajectory to enforce cross-modal consistency.\n\nExperiments demonstrate that MMaDA-Parallel significantly improves cross-modal alignment and semantic consistency, achieving a 6.9% improvement in output alignment on ParaBench compared to existing state-of-the-art methods. The authors have released their code and models (MMaDA-Parallel-A and MMaDA-Parallel-M, differing by tokenizer) for the community to use. A quick start guide is provided, along with a warning that the current model is best suited for synthetic environments and may not perform optimally on real-world imagery. The authors plan to expand their training data and refine their models further.\n",
    "chinese_title": "用于思考感知的编辑和生成的多模态扩散语言模型",
    "chinese_summary": "本文介绍了MMaDA-Parallel，一种新颖的并行多模态扩散框架，旨在改进思考感知图像编辑和生成。作者发现现有顺序方法存在一个问题：误差传播会降低性能，尤其是在生成的推理和最终图像不对齐时。为了分析这一点，他们创建了ParaBench，一个用于评估文本和图像输出的基准。\n\nMMaDA-Parallel通过在整个去噪过程中实现文本和图像之间的连续双向交互来解决对齐问题。该模型使用监督微调进行训练，并使用并行强化学习（ParaRL）进一步优化，该方法沿去噪轨迹应用语义奖励，以加强跨模态一致性。\n\n实验表明，MMaDA-Parallel显著提高了跨模态对齐和语义一致性，与现有最先进方法相比，在ParaBench上的输出对齐度提高了6.9%。作者已发布其代码和模型（MMaDA-Parallel-A和MMaDA-Parallel-M，区别在于分词器），供社区使用。提供了一个快速入门指南，并警告说当前模型最适合合成环境，并且可能无法在真实世界图像上达到最佳性能。作者计划扩展他们的训练数据并进一步改进他们的模型。"
  },
  {
    "id": "45981608",
    "title": "Outdated Samsung handset linked to fatal emergency call failure in Australia",
    "url": "https://www.theregister.com/2025/11/18/samsung_emergency_call_failure/",
    "summary": "A Sydney resident's death after their outdated Samsung phone failed to connect to Australia's emergency number, 000, has triggered warnings about the importance of mobile software updates. TPG Telecom, the customer's carrier, confirmed the incident, emphasizing that its network was operational and pointing to the user's device running incompatible software.\n\nSamsung has acknowledged the issue in older devices, listing numerous models requiring updates or replacement to ensure emergency call functionality. TPG had contacted users of affected Samsung models, including Galaxy S7 and Note 5 series, urging them to update. Australian regulations mandate blocking unpatched handsets from networks after a warning period.\n\nTPG CEO Iñaki Berroeta stressed customer safety and urged users to update or replace outdated devices immediately. The incident is being disclosed due to public concern about emergency call reliability. Telstra had also previously warned about potential Triple Zero failures with older, non-upgradeable Samsung devices. TPG has notified relevant authorities and is investigating the incident.\n\nSamsung, in a later statement, expressed condolences and emphasized the importance of keeping devices updated for safety and security. They stated that customers with devices needing updates or replacements have been notified by their carriers. This event follows a prior incident where an Optus firewall update caused emergency call failures, linked to multiple deaths, highlighting the critical importance of reliable emergency communication infrastructure.\n",
    "chinese_title": "澳大利亚一紧急呼叫失败事故疑与过时三星手机有关",
    "chinese_summary": "悉尼居民因三星旧手机无法拨打澳大利亚紧急号码000而死亡，引发了关于移动软件更新重要性的警告。该居民的运营商TPG Telecom已确认此事，强调其网络运行正常，并指出用户设备运行不兼容的软件。\n\n三星已承认旧设备存在此问题，列出了许多需要更新或更换的型号，以确保紧急呼叫功能。TPG已联系受影响的三星型号用户，包括Galaxy S7和Note 5系列，敦促他们更新。澳大利亚法规规定，在警告期过后，将禁止未打补丁的手机接入网络。\n\nTPG首席执行官Iñaki Berroeta强调了客户安全，并敦促用户立即更新或更换过时的设备。由于公众对紧急呼叫可靠性的担忧，该事件被公开。Telstra此前也曾警告过，较旧的、无法升级的三星设备可能会导致三重零呼叫失败。TPG已通知相关部门，并正在调查此事。\n\n三星在后来的声明中表示慰问，并强调了保持设备更新以确保安全的重要性。他们表示，运营商已通知需要更新或更换设备的客户。此前，Optus的防火墙更新曾导致紧急呼叫失败，并与多起死亡事件有关，突显了可靠的紧急通信基础设施的至关重要性。"
  },
  {
    "id": "45978423",
    "title": "Thunderbird Adds Native Microsoft Exchange Email Support",
    "url": "https://blog.thunderbird.net/2025/11/thunderbird-adds-native-microsoft-exchange-email-support/",
    "summary": "Thunderbird's version 145 introduces native support for Microsoft Exchange email via the Exchange Web Services (EWS) protocol, eliminating the need for third-party add-ons. This update streamlines email functionality for users in Exchange environments, including full folder listing, message synchronization, and attachment handling.\n\nSetting up is straightforward, especially for Microsoft 365 or Office 365 users. Thunderbird uses Microsoft's standard OAuth2 sign-in and automatically detects account settings. Users can create a new account in Thunderbird, select \"Exchange,\" and let the application handle the rest.\n\nCurrently, the EWS support is limited to email functionality. Calendar and address book integration are under development for future releases. While EWS is supported now, Microsoft is transitioning to Microsoft Graph. Thunderbird is working on Microsoft Graph support for future compatibility.\n\nThe article outlines supported and unsupported features in a table, covering account setup, message operations, attachments, search & filtering, account hosting, calendar support, address book support, and Microsoft Graph support.\n\nThunderbird aims to become a comprehensive solution for Exchange users, with calendar and contact synchronization on the roadmap. The article encourages users to monitor future releases for updates and directs organization admins to the Mozilla wiki for more information.\n",
    "chinese_title": "Thunderbird新增原生Microsoft Exchange邮件支持",
    "chinese_summary": "雷鸟145版本通过Exchange Web Services (EWS) 协议引入了对 Microsoft Exchange 电子邮件的原生支持，无需第三方插件。此更新简化了 Exchange 环境中用户的电子邮件功能，包括完整的文件夹列表、消息同步和附件处理。\n\n设置过程简单直接，尤其是对于 Microsoft 365 或 Office 365 用户。雷鸟使用 Microsoft 的标准 OAuth2 登录方式，并自动检测帐户设置。用户可以在雷鸟中创建一个新帐户，选择“Exchange”，然后让应用程序处理其余操作。\n\n目前，EWS 支持仅限于电子邮件功能。日历和地址簿集成正在开发中，将在未来版本中发布。虽然现在支持 EWS，但 Microsoft 正在过渡到 Microsoft Graph。雷鸟正在开发 Microsoft Graph 支持，以实现未来的兼容性。\n\n本文以表格形式概述了支持和不支持的功能，涵盖帐户设置、消息操作、附件、搜索与过滤、帐户托管、日历支持、地址簿支持以及 Microsoft Graph 支持。\n\n雷鸟的目标是成为 Exchange 用户的全面解决方案，日历和联系人同步已列入路线图。本文鼓励用户关注未来版本的更新，并指导组织管理员查阅 Mozilla wiki 了解更多信息。"
  },
  {
    "id": "45974869",
    "title": "I just want working RCS messaging",
    "url": "https://wt.gd/i-just-want-my-rcs-messaging-to-work",
    "summary": "In November 2025, the author is frustrated by non-functional RCS messaging on their iPhone 15 Pro, running iOS 26, after working fine until the upgrade. They've spent over a month troubleshooting, facing a blame game between Apple and the carriers (primarily T-Mobile). AppleCare+ has been unhelpful, and the author believes Apple isn't taking accountability.\n\nThe author, an OS agnostic user with a background in troubleshooting MMS issues for carriers on Android, suspects the problem may stem from Apple or Google's Google Jibe, which runs RCS infrastructure. They reference their past experience fixing MMS issues on LineageOS for Verizon due to UAProf decommissioning. They also mention Google's intentional past blockage of RCS on custom Android ROMs.\n\nOn their iPhone, both T-Mobile and US Mobile lines are stuck on \"Waiting for activation…\", but work on other iPhones. The author has performed extensive troubleshooting steps, including resets, network setting adjustments, eSIM reissuance, and even analyzing device logs using `idevicesyslog`. The logs point to a potential issue with \"UserInteractionRequired.xml\" related to T-Mobile's Jibe configuration.\n\nThe author criticizes Apple's customer support for blaming the carriers and refusing to test the eSIM on another device. Google Jibe is never mentioned by Apple, despite being the backend RCS infrastructure.\n\nApple is planning to swap the phone's board as a courtesy, which the author sees as a temporary fix that doesn't address the underlying issue, especially the poor quality of customer service received with AppleCare+. The author's goal is for Apple to investigate and resolve the actual problem for all users, not just offer a quick workaround.\n",
    "chinese_title": "我只想用上能用的RCS消息。",
    "chinese_summary": "2025年11月，作者升级到iOS 26的iPhone 15 Pro后，RCS消息功能失效，对此感到沮丧。之前一切正常，而升级后已经花了一个多月进行故障排除，却面临Apple和运营商（主要是T-Mobile）之间的互相推诿。AppleCare+毫无帮助，作者认为Apple没有承担责任。\n\n作者是一位操作系统无关的用户，拥有在Android上为运营商排除彩信故障的背景，怀疑问题可能源于Apple或Google的Google Jibe，该平台运行RCS基础设施。他们提到了过去因UAProf停用而在LineageOS上为Verizon修复彩信问题的经验。他们还提到Google过去曾有意阻止自定义Android ROM上的RCS。\n\n在他们的iPhone上，T-Mobile和US Mobile两条线路都卡在“等待激活…”状态，但在其他iPhone上可以正常工作。作者进行了广泛的故障排除步骤，包括重置、网络设置调整、eSIM重新发放，甚至使用`idevicesyslog`分析设备日志。日志表明可能存在与T-Mobile的Jibe配置相关的“UserInteractionRequired.xml”问题。\n\n作者批评Apple的客户支持将责任归咎于运营商，并拒绝在另一台设备上测试eSIM。尽管Google Jibe是后端RCS基础设施，但Apple从未提及。\n\nApple计划出于礼貌更换手机主板，作者认为这是一种临时修复，无法解决根本问题，尤其是AppleCare+提供的劣质客户服务。作者的目标是让Apple调查并解决所有用户的实际问题，而不仅仅是提供快速的临时解决方案。"
  },
  {
    "id": "45967814",
    "title": "Google Antigravity",
    "url": "https://antigravity.google/",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "谷歌反重力",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "45912457",
    "title": "The Future of Programming (2013) [video]",
    "url": "https://www.youtube.com/watch?v=8pTEmbeENF4",
    "summary": "The provided information is not an article but a video titled \"The Future of Programming (2013)\" on YouTube. The content listed, however, is the standard YouTube footer information and doesn't relate to the actual video's content. Therefore, it's impossible to summarize the *actual* video content based solely on this information.\n\nWe only know that the video is on YouTube and its title suggests a discussion about the direction programming was heading in 2013.  The footer mentions standard YouTube related items such as:\n\n*   Copyright\n*   Terms of service\n*   Privacy policy\n*   Contact information\n*   Creator resources\n*   Advertising information\n*   New features\n*   NFL Sunday Ticket\n*   Google LLC (copyright)\n\nWithout knowing what the video actually discusses about programming's future, a real summary is impossible. This analysis only describes the metadata associated with the video listing.\n",
    "chinese_title": "编程的未来 (2013) [视频]",
    "chinese_summary": "提供的信息并非文章，而是YouTube上名为“编程的未来 (2013)”的视频。然而，列出的内容是标准的YouTube页脚信息，与视频的实际内容无关。因此，仅凭这些信息无法总结*实际*视频的内容。\n\n我们只知道该视频位于YouTube上，其标题表明讨论的是2013年编程的发展方向。页脚提到标准的YouTube相关项目，例如：\n\n*   版权\n*   服务条款\n*   隐私政策\n*   联系方式\n*   创作者资源\n*   广告信息\n*   新功能\n*   NFL Sunday Ticket\n*   Google LLC（版权）\n\n在不知道视频实际讨论关于编程未来的内容的情况下，真正的摘要是不可能的。此分析仅描述与视频列表相关的元数据。"
  },
  {
    "id": "45978245",
    "title": "Learning to Boot from PXE",
    "url": "https://blog.imraniqbal.org/learning-to-boot-from-pxe/",
    "summary": "The author details their experience setting up PXE network booting on their home network to install NixOS on a new laptop after their USB drive failed. Frustrated with waiting for a new USB, they decided to leverage the laptop's PXE boot option.\n\nThe process involved configuring DHCP on their OPNsense router to provide the necessary information for PXE, including the TFTP server address and boot file. They then enabled TFTP via dnsmasq (accessed via SSH), serving the iPXE bootloader. iPXE was intended to then fetch the NixOS ISO over HTTP.\n\nThe author initially tried to directly boot the ISO using iPXE's `sanboot` feature, but encountered issues with NixOS not finding the ISO image. Realizing this wouldn't work, they switched to using Nix's netboot image generator to create the necessary kernel and initrd files. These files were then served over HTTP via lighttpd (OPNsense's web server). By updating the iPXE script to load the kernel and initrd from the HTTP server, the author successfully booted NixOS over the network.\n\nThe author reflects on their unexpectedly positive experience working with FreeBSD on the OPNsense box and expresses a lingering interest in potentially booting a full graphical environment (KDE) over the network in the future.\n",
    "chinese_title": "学习从PXE启动",
    "chinese_summary": "作者详细描述了在 USB 驱动器损坏后，如何在家庭网络上设置 PXE 网络引导，以便在新笔记本电脑上安装 NixOS 的经历。 由于苦于等待新的 USB 驱动器，他们决定利用笔记本电脑的 PXE 引导选项。\n\n该过程包括在其 OPNsense 路由器上配置 DHCP，以提供 PXE 所需的信息，包括 TFTP 服务器地址和引导文件。 然后，他们通过 dnsmasq（通过 SSH 访问）启用了 TFTP，用于提供 iPXE 引导加载程序。 iPXE 旨在通过 HTTP 获取 NixOS ISO。\n\n作者最初尝试使用 iPXE 的 `sanboot` 功能直接引导 ISO，但遇到 NixOS 无法找到 ISO 镜像的问题。 意识到这行不通后，他们转而使用 Nix 的 netboot 镜像生成器来创建必要的内核和 initrd 文件。 这些文件随后通过 lighttpd（OPNsense 的 Web 服务器）通过 HTTP 提供。 通过更新 iPXE 脚本以从 HTTP 服务器加载内核和 initrd，作者成功地通过网络引导了 NixOS。\n\n作者回顾了他们在 OPNsense 设备上使用 FreeBSD 的意外积极体验，并表达了未来可能通过网络引导完整图形环境（KDE）的持续兴趣。"
  },
  {
    "id": "45981626",
    "title": "Build vs. Buy: What This Week's Outages Should Teach You",
    "url": "https://www.toddhgardner.com/blog/build-vs-buy-outages",
    "summary": "Todd Gardner's article, \"Build vs. Buy: What This Week's Outages Should Teach You,\" uses the cautionary tale of Jurassic Park's disastrous custom software to illustrate the importance of strategically choosing what to build in-house versus what to buy from third-party providers. Recent outages from major infrastructure providers like Cloudflare, GitHub, and AWS highlight the risks of building businesses on abstractions we don't fully understand and can't control.\n\nThe core argument is that if a capability is critical to your business's core function and provides a competitive advantage, you should own it and build it yourself. However, many companies mistakenly focus on building non-essential tools while relying on external providers for crucial infrastructure, leading to a loss of control and potential for devastating outages.\n\nWhile outsourcing infrastructure is sometimes necessary due to expertise or affordability, Gardner cautions against embracing overly complex, opaque platforms. He advocates for building what delivers your unique value and buying simpler solutions for infrastructure if building isn't feasible. Conversely, he recommends buying readily available solutions like analytics, CRM, error monitoring, and SSL certificate management, as these are non-core functions and solved problems.\n\nThe key takeaway is to avoid buying overly complex abstractions that hinder your ability to understand and resolve issues when they arise. The ideal approach is to build what makes you unique, buy what makes you run, and always maintain enough understanding to fix problems when things inevitably break.\n",
    "chinese_title": "自建还是购买：本周故障应该教会你什么",
    "chinese_summary": "托德·加德纳的文章《自建还是购买：本周的故障应该教会你什么》以《侏罗纪公园》灾难性的定制软件为例，说明战略性地选择自建哪些功能以及从第三方供应商购买哪些功能的重要性。Cloudflare、GitHub 和 AWS 等主要基础设施提供商最近发生的故障突显了在不完全理解且无法控制的抽象概念之上构建业务的风险。\n\n核心论点是，如果某项能力对你的业务核心功能至关重要并提供竞争优势，那么你应该拥有它并自行构建。然而，许多公司错误地专注于构建非必要工具，同时依赖外部供应商提供关键基础设施，导致失去控制并可能发生毁灭性故障。\n\n虽然由于专业知识或经济原因，外包基础设施有时是必要的，但加德纳警告不要采用过于复杂、不透明的平台。他主张构建能传递你独特价值的功能，如果构建不可行，则购买更简单的基础设施解决方案。相反，他建议购买现成的解决方案，如分析、CRM、错误监控和 SSL 证书管理，因为这些都是非核心功能且已经解决的问题。\n\n关键在于避免购买过于复杂的抽象概念，这些概念会阻碍你理解和解决问题。理想的方法是构建使你独特的功能，购买使你运行的功能，并始终保持足够的理解能力，以便在问题不可避免地发生时进行修复。"
  },
  {
    "id": "45893007",
    "title": "Ultima VII Revisited",
    "url": "https://github.com/ViridianGames/U7Revisited",
    "summary": "\"Ultima VII: Revisited\" is a project aiming to create a replacement engine for the classic DOS game Ultima VII: The Black Gate. To run it, users need to copy the contents of their original Ultima VII game folder to a specific directory within the project's structure (`/Data/u7`).\n\nThe document details installation instructions for both developers and end-users. For developers, it covers building the project using Meson (cross-platform) and CMake (Windows & Linux), providing specific commands and prerequisites for each platform.\n\nThe document also provides a list of in-game controls, using WASD for movement, Q/E for rotation, and mousewheel for zoom. It explains how to interact with the minimap and NPCs, and also mentions time control keys (+/- on the numpad).\n\nA \"Sandbox Mode\" is described as a debug mode that enables in-game editing and debugging. This mode offers various toggleable debug features, such as NPC pathfinding, a shape editor, Lua debugging, and the ability to manipulate objects within the game world. A list of hotkeys (F1, F7, F8, F9, F10, F11) and functionalities is provided for this mode.\n\nFinally, the author solicits feedback via email (`anthony.salter@gmail.com`) with \"Revisited\" in the subject line. The project's source code is available on GitHub at `github.com/viridiangames`.\n",
    "chinese_title": "重返創世紀七",
    "chinese_summary": "《重访创世纪七：黑石之门》是一个旨在为经典DOS游戏《创世纪七：黑石之门》创建替代引擎的项目。要运行它，用户需要将原始《创世纪七》游戏文件夹的内容复制到项目结构中的特定目录（`/Data/u7`）。\n\n该文档详细介绍了开发者和最终用户的安装说明。对于开发者，它涵盖了使用Meson（跨平台）和CMake（Windows & Linux）构建项目，并为每个平台提供特定的命令和先决条件。\n\n该文档还提供了游戏内控制列表，使用WASD进行移动，Q/E进行旋转，鼠标滚轮进行缩放。它解释了如何与小地图和NPC互动，并提及了时间控制键（小键盘上的+/-）。\n\n“沙盒模式”被描述为一种调试模式，可实现游戏内编辑和调试。此模式提供各种可切换的调试功能，例如NPC寻路、形状编辑器、Lua调试以及在游戏世界中操纵对象的能力。提供了此模式的热键列表（F1、F7、F8、F9、F10、F11）和功能。\n\n最后，作者通过电子邮件（`anthony.salter@gmail.com`）征求反馈意见，邮件主题请注明“Revisited”。该项目的源代码可在GitHub上找到，地址为`github.com/viridiangames`。"
  },
  {
    "id": "45969250",
    "title": "Pebble, Rebble, and a path forward",
    "url": "https://ericmigi.com/blog/pebble-rebble-and-a-path-forward/",
    "summary": "In a 2025 blog post, Eric Migicovsky, founder of Core Devices (relaunching Pebble smartwatches), responds to accusations from Rebble, a non-profit supporting the Pebble community since 2017. He claims Rebble is misleading the community with false accusations.\n\nThe core dispute revolves around the Pebble Appstore data (13,000 apps/faces scraped by Rebble after Fitbit shut it down in 2018). Core Devices believes this data should be freely available and not controlled by Rebble, while Rebble claims 100% ownership.\n\nEric refutes specific accusations: (1) that Core \"stole\" open-source contributions Rebble funded (specifically concerning NimBLE), arguing that Core has significantly contributed to open-source development and that all work is under open licenses. (2) That Core stole Rebble's libpebblecommon library, explaining that Core bought the copyright and incorporated it into the open-source libpebble3. (3) That Core promised Rebble would maintain the developer site. (4) That Core \"scraped\" Rebble's app store, clarifying that he manually browsed watchfaces to select favorites.\n\nEric expresses disappointment in Rebble's actions and questions their motives, particularly concerning their proprietary control over the app store and features like voice-to-text and weather. He fears relying on Rebble as a third-party for critical services.\n\nEric concludes by urging Rebble to open the app store archive, cease claiming ownership of developer data, and prioritize the community's needs. He emphasizes his commitment to an open and sustainable Pebble ecosystem, driven by passion rather than profit.\n",
    "chinese_title": "Pebble、Rebble及未来之路",
    "chinese_summary": "在2025年的一篇博客文章中，Core Devices（正在重新推出 Pebble 智能手表）的创始人 Eric Migicovsky 回应了 Rebble（一个自 2017 年以来一直支持 Pebble 社区的非营利组织）的指控。他声称 Rebble 正在以虚假指控误导社区。\n\n核心争议围绕 Pebble Appstore 数据展开（在 Fitbit 于 2018 年关闭后，Rebble 抓取了 13,000 个应用程序/表盘）。 Core Devices 认为这些数据应该免费提供，不应由 Rebble 控制，而 Rebble 声称拥有 100% 的所有权。\n\nEric 反驳了具体的指控：（1）Core“窃取”了 Rebble 资助的开源贡献（特别是关于 NimBLE），他辩称 Core 为开源开发做出了重大贡献，并且所有工作都在开放许可下进行。（2）Core 窃取了 Rebble 的 libpebblecommon 库，他解释说 Core 购买了版权并将其合并到开源 libpebble3 中。（3）Core 承诺 Rebble 将维护开发者网站。（4）Core“抓取”了 Rebble 的应用商店，他澄清说他是手动浏览表盘来选择收藏的。\n\nEric 对 Rebble 的行为表示失望，并质疑他们的动机，特别是关于他们对应用商店和语音转文本和天气等功能的专有控制。他担心依赖 Rebble 作为关键服务的第三方。\n\nEric 最后敦促 Rebble 开放应用商店存档，停止声称拥有开发者数据，并优先考虑社区的需求。 他强调了他对一个开放和可持续的 Pebble 生态系统的承诺，该生态系统由热情而非利润驱动。"
  },
  {
    "id": "45967079",
    "title": "Show HN: Browser-based interactive 3D Three-Body problem simulator",
    "url": "https://trisolarchaos.com/?pr=O_8(0.6)&n=3&s=5.0&so=0.00&im=rk4&dt=1.00e-4&rt=1.0e-6&at=1.0e-8&bs=0.15&sf=0&sv=0&cm=free&kt=1&st=1&tl=1500&cp=2.5208,1.5125,2.5208&ct=0.0000,0.0000,0.1670",
    "summary": "This \"Show HN\" post introduces a browser-based interactive 3D simulator for exploring the Three-Body Problem, a famous challenge in classical physics.  The simulator allows users to model the gravitational interactions of multiple bodies using Newton's Law of Universal Gravitation, featuring a softening parameter to avoid singularities.\n\nKey features include real-time 3D physics, multiple integration methods (Velocity Verlet for energy conservation and long-term stability, RK4 for short-term accuracy), preset configurations of known three-body orbits (including Figure-8 and Lagrange configurations, as well as more complex orbits from recent research), and user-adjustable parameters.\n\nThe simulator provides tools to analyze orbital behavior, including a timeline playback and the ability to share configurations.  It monitors energy conservation and displays energy drift, providing feedback on simulation accuracy.  The article clarifies that negative total energy is normal in gravitationally bound systems.\n\nBuilt using Three.js and JavaScript, the simulator allows users to experiment with initial conditions, masses, and simulation speeds.  It tracks up to 10,000 frames of simulation history.  Feedback is encouraged to help improve the tool.\n",
    "chinese_title": "Show HN：浏览器端交互式三体问题3D模拟器",
    "chinese_summary": "这个“Show HN”帖子介绍了一个基于浏览器的交互式3D模拟器，用于探索三体问题，这是经典物理学中的一个著名难题。该模拟器允许用户使用牛顿万有引力定律来模拟多个物体的引力相互作用，并具有一个软化参数以避免奇点。\n\n主要功能包括实时3D物理、多种积分方法（速度Verlet用于能量守恒和长期稳定性，RK4用于短期精度）、已知三体轨道的预设配置（包括8字形和拉格朗日配置，以及来自最近研究的更复杂轨道）以及用户可调参数。\n\n该模拟器提供了分析轨道行为的工具，包括时间线回放和共享配置的能力。它监测能量守恒并显示能量漂移，提供有关模拟精度的反馈。文章阐明，在引力束缚系统中，负总能量是正常的。\n\n该模拟器使用Three.js和JavaScript构建，允许用户尝试初始条件、质量和模拟速度。它跟踪最多10,000帧的模拟历史。鼓励提供反馈以帮助改进该工具。"
  },
  {
    "id": "45891346",
    "title": "Itiner-e: A high-resolution dataset of roads of the Roman Empire",
    "url": "https://www.nature.com/articles/s41597-025-06140-z",
    "summary": "The article introduces Itiner-e, a new, comprehensive, and high-resolution open digital dataset of Roman roads spanning the entire Roman Empire. Created by digitizing roads identified from archaeological and historical sources, topographic maps, and remote sensing data, Itiner-e nearly doubles the known length of Roman roads compared to previous resources like the Barrington Atlas-derived datasets. This increase is due to improved coverage, particularly in areas like the Iberian Peninsula, Greece, and North Africa, and a more spatially explicit approach that accounts for geographical features.\n\nKey features of Itiner-e include detailed metadata for each road segment, unique URIs, links to ancient places in Pleiades, and classifications of road certainty. The dataset reveals that only a small percentage (2.737%) of the roads' locations are known with certainty, highlighting the challenges of reconstructing the ancient road network. While main roads are relatively well documented, a significant portion comprises secondary roads, offering potential for future research.\n\nThe article also acknowledges the limitation of lacking comprehensive chronological data for road construction and change. The methodology involved identifying roads in existing literature, locating them using various map and imagery sources, and digitizing them using GIS. Itiner-e aims to improve our understanding of Roman mobility, connectivity, and administration, while also explicitly identifying gaps in current knowledge to guide future research. The dataset is a transformative resource for studies on terrestrial mobility and its impact on the ancient world.\n",
    "chinese_title": "Itiner-e: 罗马帝国道路的高分辨率数据集",
    "chinese_summary": "本文介绍了Itiner-e，一个全新的、全面的、高分辨率的罗马道路开放数字数据集，覆盖整个罗马帝国。它通过数字化从考古和历史资料、地形图和遥感数据中识别出的道路而创建，与巴林顿地图集衍生的数据集等先前资源相比，Itiner-e使已知的罗马道路长度几乎翻了一番。这种增加归功于改进的覆盖范围，特别是在伊比利亚半岛、希腊和北非等地区，以及一种更具空间明确性的方法，考虑了地理特征。\n\nItiner-e的关键特征包括每个路段的详细元数据、唯一的URI、与Pleiades中古代地点的链接以及道路确定性的分类。该数据集显示，只有很小一部分（2.737%）的道路位置被确定无疑，突显了重建古代道路网络的挑战。虽然主要道路的记录相对完善，但很大一部分由次要道路组成，为未来的研究提供了潜力。\n\n本文还承认缺乏关于道路建设和变化的全面年代数据的局限性。该方法涉及识别现有文献中的道路，使用各种地图和图像资料定位它们，并使用GIS对其进行数字化处理。Itiner-e旨在提高我们对罗马交通、连通性和行政管理的理解，同时也明确识别当前知识中的差距，以指导未来的研究。该数据集是研究陆地交通及其对古代世界影响的变革性资源。"
  },
  {
    "id": "45980106",
    "title": "How to Stay Sane in a World That Rewards Insanity",
    "url": "https://www.joanwestenberg.com/p/how-to-stay-sane-in-a-world-that-rewards-insanity",
    "summary": "J.A. Westenberg's article, \"How to Stay Sane in a World That Rewards Insanity,\" explores the phenomenon of extremism as a successful \"growth hack\" in today's society. The author observes that individuals adopting extreme stances often gain attention, community, and influence, while those embracing nuance and reason are comparatively ignored.\n\nWestenberg argues that this trend, while yielding short-term benefits, ultimately leads to a society incapable of adapting, compromising, or acknowledging complexity. Individuals become prisoners of their own brands, unable to change their minds without risking their established identities and communities.\n\nThe article then proposes strategies to maintain sanity in this environment:\n\n1.  **Diversify your information diet:** Actively seek out articulate perspectives you disagree with to understand that intelligent people can hold differing views.\n2.  **Distinguish between stakes and truth:** Recognize that the importance of an issue doesn't validate every claim made about it, and you don't have to defend every argument your side makes.\n3.  **Find communities that reward humility:** Seek out groups that value truth-seeking over tribal loyalty, where changing your mind or admitting ignorance is accepted.\n\nWhile acknowledging the immediate losses associated with resisting extremism, Westenberg emphasizes the long-term gains of maintaining sanity: clear thinking, adaptability, and meaningful relationships. Ultimately, the author suggests that the world only rewards insanity because we're measuring success on a short timeframe, and that sanity offers unlimited potential for long-term growth.\n",
    "chinese_title": "如何在奖励疯狂的世界里保持理智",
    "chinese_summary": "J.A. Westenberg 的文章《如何在奖励疯狂的世界里保持理智》探讨了极端主义作为当今社会一种成功的“增长黑客”现象。作者观察到，采取极端立场的个人往往能获得关注、社群和影响力，而那些拥抱细微差别和理性的人则相对被忽视。\n\nWestenberg 认为，这种趋势虽然会带来短期利益，但最终会导致社会无法适应、妥协或承认复杂性。个人会成为自己品牌的囚徒，如果不冒着失去既定身份和社群的风险，就无法改变自己的想法。\n\n文章随后提出了在这种环境中保持理智的策略：\n\n1.  **多元化你的信息摄取：** 积极寻找你不同意的、有条理的观点，以了解聪明人可以持有不同的看法。\n2.  **区分利害关系和真相：** 认识到问题的重要性并不代表对它的每一个主张都是正确的，而且你没有必要为你的阵营所提出的每一个论点辩护。\n3.  **寻找奖励谦逊的社群：** 寻找重视探求真相胜过部落忠诚，并且接受改变主意或承认无知的群体。\n\nWestenberg 承认抵制极端主义会带来眼前的损失，但他强调了保持理智的长期收益：清晰的思维、适应性和有意义的关系。最终，作者认为世界奖励疯狂只是因为我们用短期的眼光衡量成功，而理智为长期增长提供了无限的潜力。"
  },
  {
    "id": "45978545",
    "title": "Pimped Amiga 500",
    "url": "https://www.pimyretro.org/pimped-amiga-500/",
    "summary": "This article details the author's project of upgrading a vintage Amiga 500 to create their \"dream machine\" from the early '90s. Starting with a cheap Amiga 500, the author restored it from the ground up, focusing on hardware improvements and software installation.\n\nThe key upgrades included installing a GottaGoFast RAM + IDE controller from AmigaStore.eu, adding 8 MB of fast RAM and a 512 MB CompactFlash card for storage. The existing 512KB of slow RAM had previously been modded to convert to 1MB of chip RAM. The author cleaned and restored the Amiga's plastics using Retrobright, and refurbished the metallic shielding with zinc spray paint. The keyboard and mouse were also cleaned and repaired, with the mouse receiving a new button and internal cleaning.\n\nThe floppy drive was cleaned and repaired with a new button. The motherboard received contact spray, and the battery on the memory expansion was replaced with a holder for easier swapping. The author bypassed the included clip connectors and soldered the IDE controller signals directly to the Zorro II connector for a more reliable connection. Adapting the CompactFlash card to fit within the case required modifications including dremeling a hole for the card slot and a custom 5V power connection. A red LED was added to monitor IDE activity alongside the floppy drive indicator.\n\nFor software, the author prepared the OS using Amiberry, emulating the upgraded hardware. They used HDToolBox to define the CompactFlash drive and created partitions for Workbench, applications, games, and data. Workbench 1.3 was installed by manually copying files and editing the startup sequence. Finally, various utilities and programs, sourced from Aminet, Archive.org, and other online repositories, were installed for file management, text editing, compression, disk imaging, image viewing, and system information.\n",
    "chinese_title": "改装过的Amiga 500",
    "chinese_summary": "将老式Amiga 500升级为90年代初的“梦想机器”"
  },
  {
    "id": "45972519",
    "title": "Blender 5.0",
    "url": "https://www.blender.org/download/releases/5-0/",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "Blender 5.0",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "45963670",
    "title": "Gemini 3 Pro Model Card [pdf]",
    "url": "https://storage.googleapis.com/deepmind-media/Model-Cards/Gemini-3-Pro-Model-Card.pdf",
    "summary": "This document appears to be a corrupted or obfuscated PDF file associated with a \"Gemini 3 Pro Model Card.\" The content is not human-readable and consists primarily of encoded data streams. It is impossible to determine the actual contents, purpose, or key information from the provided raw data. It seems to be a model card (intended to document and communicate details about the model) for a model named Gemini 3 Pro, but the content itself is unreadable.\n",
    "chinese_title": "Gemini 3 Pro 模型卡 [pdf]",
    "chinese_summary": "该文档似乎是一个已损坏或混淆的PDF文件，与“Gemini 3 Pro 模型卡”相关。内容无法人工读取，主要由编码数据流组成。 从提供的原始数据来看，无法确定实际内容、目的或关键信息。它似乎是一个名为 Gemini 3 Pro 的模型的模型卡（旨在记录和传达有关模型的详细信息），但内容本身无法阅读。"
  },
  {
    "id": "45973709",
    "title": "Cloudflare outage on November 18, 2025 post mortem",
    "url": "https://blog.cloudflare.com/18-november-2025-outage/",
    "summary": "On November 18, 2025, Cloudflare experienced a significant network outage lasting from 11:20 UTC to 17:06 UTC, resulting in widespread HTTP 5xx errors and impacting services like Turnstile, Workers KV, Dashboard, Email Security, and Access. The root cause was not a cyberattack but a change in database permissions within ClickHouse that led to the Bot Management system's \"feature file\" doubling in size due to duplicate entries. This oversized file, propagated network-wide, exceeded the software's size limit, causing it to fail.\n\nThe issue was initially misdiagnosed as a hyper-scale DDoS attack due to fluctuating system behavior. The root cause was found in how ClickHouse distributed queries, specifically the changes made to user permissions and metadata access. The feature file generation logic did not account for the database changes made to the system table metadata, leading to duplication of rows and thus the rapid increase in feature file size.\n\nRemediation involved stopping the propagation of the bad feature file, replacing it with a known good version, and restarting the core proxy. Although traffic resumed around 14:30 UTC, full recovery, including restarting remaining services, was achieved by 17:06 UTC.\n\nThe incident also exposed vulnerabilities in memory preallocation within the Bot Management system, as the software panicked when encountering the oversized feature file. Cloudflare is now focusing on hardening the ingestion of internally generated configuration files to prevent similar issues in the future.\n",
    "chinese_title": "2025年11月18日 Cloudflare 服务中断事后分析报告",
    "chinese_summary": "2025年11月18日，Cloudflare发生重大网络中断，持续时间从UTC时间11:20至17:06，导致大规模HTTP 5xx错误，并影响Turnstile、Workers KV、Dashboard、Email Security和Access等服务。根本原因并非网络攻击，而是ClickHouse数据库权限变更，导致Bot Management系统的“特征文件”因重复条目而翻倍。这个过大的文件在全网络传播，超出软件的大小限制，导致其故障。\n\n由于系统行为波动，该问题最初被误诊为超大规模DDoS攻击。根本原因在于ClickHouse如何分发查询，特别是对用户权限和元数据访问所做的更改。特征文件生成逻辑没有考虑到对系统表元数据所做的数据库更改，导致行重复，从而导致特征文件大小迅速增加。\n\n补救措施包括停止错误特征文件的传播，用已知良好的版本替换它，并重新启动核心代理。虽然流量在UTC时间14:30左右恢复，但包括重启剩余服务在内的全面恢复在UTC时间17:06完成。\n\n该事件还暴露了Bot Management系统中内存预分配的漏洞，因为软件在遇到过大的特征文件时崩溃。Cloudflare目前正专注于加强内部生成的配置文件的摄取，以防止未来发生类似问题。"
  },
  {
    "id": "45933932",
    "title": "I wrote a Pong game in a 512-byte boot sector",
    "url": "https://akshatjoshi.com/i-wrote-a-pong-game-in-a-512-byte-boot-sector/",
    "summary": "Akshat Joshi details his project of creating a Pong game that fits entirely within a 512-byte boot sector, a challenging constraint due to the limitations of raw x86 assembly, BIOS interrupts, and direct video memory access. He successfully implemented a functional Pong game with features including a player paddle (controlled by W/S), a CPU opponent, a ball with velocity, scoring, a color toggle (C key), and a full reset (R key).\n\nThe game runs in 80x25 text mode, drawing directly to video memory at 0xB800 using `stosw`. The CPU opponent uses a deterministic ball-tracking logic. He achieved efficiency by using direct video memory access, optimizing positioning calculations using `imul`, using BIOS interrupt 0x16 for real-time, non-blocking keyboard input, storing ball velocity in single bytes and reversing on collision, and using the BIOS timer for frame pacing instead of busy-waiting. The color cycling is implemented by incrementing the draw color by 0x10.\n\nThe entire game code, written in assembly, is available on GitHub and can be assembled with NASM and run in QEMU or on older hardware. The article highlights the extreme optimization required to fit a playable game within the stringent 512-byte boot sector limit.\n",
    "chinese_title": "我在512字节的引导扇区中写了一个Pong游戏。",
    "chinese_summary": "Akshat Joshi 详述了他将 Pong 游戏完整塞入 512 字节引导扇区的项目，这是一个极具挑战的约束，因为原始 x86 汇编、BIOS 中断和直接视频内存访问都存在局限性。他成功实现了一个功能齐全的 Pong 游戏，包含以下功能：玩家挡板（由 W/S 控制）、CPU 对手、带速度的球、计分、颜色切换（C 键）和完全重置（R 键）。\n\n该游戏在 80x25 文本模式下运行，使用 `stosw` 直接绘制到 0xB800 的视频内存。CPU 对手使用确定性的球跟踪逻辑。他通过使用直接视频内存访问、使用 `imul` 优化定位计算、使用 BIOS 中断 0x16 进行实时、非阻塞键盘输入、将球的速度存储在单个字节中并在碰撞时反转以及使用 BIOS 定时器进行帧速率控制而不是忙等待来提高效率。颜色循环是通过将绘制颜色递增 0x10 实现的。\n\n整个游戏代码用汇编编写，可在 GitHub 上找到，可以使用 NASM 汇编并在 QEMU 或旧硬件上运行。文章重点介绍了在严格的 512 字节引导扇区限制内放入可玩游戏所需的极致优化。"
  },
  {
    "id": "45899074",
    "title": "Mojo-V: Secret Computation for RISC-V",
    "url": "https://github.com/toddmaustin/mojo-v",
    "summary": "生成摘要时出错",
    "chinese_title": "Mojo-V：RISC-V的秘密计算",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45963780",
    "title": "Cloudflare Global Network experiencing issues",
    "url": "https://www.cloudflarestatus.com/incidents/8gmgl950y3h7",
    "summary": "On November 18, 2025, Cloudflare experienced a global network service degradation, impacting several services including Access, Bot Management, CDN/Cache, Dashboard, Firewall, Network, WARP, and Workers. The incident began around 11:48 UTC, with users potentially experiencing intermittent issues.\n\nCloudflare's team immediately started investigating and working on a fix. Initial remediation attempts involved disabling WARP access in London. Throughout the day, multiple updates were posted as the team worked to restore services and mitigate the impact, including deploying a fix to restore dashboard services.\n\nWhile services gradually recovered, intermittent errors and latency were reported globally. Bot scores were temporarily impacted during the recovery process. The team focused on addressing post-deployment issues and restoring service to application services customers. Cloudflare Access and WARP services recovered, and WARP access in London was re-enabled.\n\nBy 14:42 UTC, a fix was implemented, and the incident was believed to be resolved, although monitoring continued to ensure services returned to normal. By 17:44 UTC, Cloudflare reported services operating normally with no elevated errors or latency. A full post-incident investigation was planned, and users were advised it was safe to re-enable any temporarily disabled Cloudflare services. The incident was officially resolved by 19:28 UTC.\n",
    "chinese_title": "Cloudflare全球网络出现问题",
    "chinese_summary": "2025年11月18日，Cloudflare发生全球网络服务降级事件，影响了包括Access、Bot Management、CDN/Cache、Dashboard、Firewall、Network、WARP和Workers在内的多项服务。事件始于UTC时间11:48左右，用户可能间歇性地遇到问题。\n\nCloudflare团队立即开始调查并着手修复。最初的补救措施包括禁用伦敦的WARP访问。在当天，团队发布了多次更新，努力恢复服务并减轻影响，包括部署修复程序以恢复仪表板服务。\n\n虽然服务逐渐恢复，但全球范围内仍报告了间歇性错误和延迟。在恢复过程中，Bot评分暂时受到影响。团队专注于解决部署后的问题，并恢复对应用程序服务客户的服务。Cloudflare Access和WARP服务已恢复，伦敦的WARP访问已重新启用。\n\n截至UTC时间14:42，修复程序已实施，事件被认为已解决，但持续监控以确保服务恢复正常。截至UTC时间17:44，Cloudflare报告服务运行正常，没有出现异常错误或延迟。计划进行全面的事后调查，并建议用户重新启用任何暂时禁用的Cloudflare服务是安全的。事件于UTC时间19:28正式解决。"
  },
  {
    "id": "45968121",
    "title": "The code and open-source tools I used to produce a science fiction anthology",
    "url": "https://compellingsciencefiction.com/posts/the-code-and-open-source-tools-i-used-to-produce-a-science-fiction-anthology.html",
    "summary": "Joe Stech, a programmer with a full-time job and family, successfully published a science fiction anthology, \"Think Weirder,\" using coding and open-source tools to streamline the publishing process. Faced with the challenge of handling tasks typically performed by publishing departments, he built tools to automate repetitive processes, emphasizing transparency and debuggability through simple file formats.\n\nHe used YAML files and a custom Python CLI tool (\"se.py\") to track and manage hundreds of submitted stories, efficiently organizing metadata, editorial status, and generating anthology compilation statistics. This allowed him to quickly assess the anthology's size, composition, and author representation.\n\nFor typesetting, Stech surprisingly opted for LaTeX, using XeLaTeX and the memoir document class. He appreciated LaTeX's reproducibility, professional typography, customizability, and version control capabilities. He created a custom style package (\"compelling.sty\") to control formatting. A Python script converted various document formats (HTML, PDF, Word) to LaTeX, automating the formatting process.\n\nTo create the ebook, Stech leveraged his LaTeX source and used Pandoc to convert it to EPUB format. He then wrote a post-processing script to modify the EPUB's table of contents to include author bylines, mirroring the print anthology's format.\n\nStech emphasizes the importance of staying organized, reproducible builds, simple file formats, and incremental learning. He suggests this approach is viable for anyone considering publishing a book and encourages readers to reach out with questions.\n",
    "chinese_title": "我用来制作科幻选集的代码和开源工具",
    "chinese_summary": "程序员乔·斯泰克拥有一份全职工作和家庭，但他成功地出版了一本科幻选集《Think Weirder》。他利用编程和开源工具简化了出版流程。面对处理通常由出版部门执行的任务的挑战，他构建了工具来自动化重复性流程，并通过简单的文件格式强调透明性和可调试性。\n\n他使用 YAML 文件和一个自定义的 Python CLI 工具（\"se.py\"）来跟踪和管理数百个提交的故事，高效地组织元数据、编辑状态并生成选集汇编统计数据。这使他能够快速评估选集的规模、构成和作者代表性。\n\n在排版方面，斯泰克出人意料地选择了 LaTeX，使用 XeLaTeX 和 memoir 文档类。他欣赏 LaTeX 的可重复性、专业的排版、可定制性和版本控制功能。他创建了一个自定义样式包（\"compelling.sty\"）来控制格式。一个 Python 脚本将各种文档格式（HTML、PDF、Word）转换为 LaTeX，从而自动化了格式化过程。\n\n为了创建电子书，斯泰克利用他的 LaTeX 源代码，并使用 Pandoc 将其转换为 EPUB 格式。然后，他编写了一个后处理脚本来修改 EPUB 的目录，以包括作者署名，从而与印刷选集的格式保持一致。\n\n斯泰克强调了保持组织性、可重复构建、简单文件格式和增量学习的重要性。他认为这种方法对任何考虑出版书籍的人来说都是可行的，并鼓励读者提出问题。"
  },
  {
    "id": "45913870",
    "title": "Bluetooth Channel Sounding: The Next Leap in Bluetooth Innovation",
    "url": "https://www.embedded.com/bluetooth-channel-sounding-the-next-leap-in-bluetooth-innovation?_gl=1*8e3cij*_gcl_au*MzQwNzM2NDAxLjE3NjMwMzUwNzA.*_ga*NDc3NjU3MDk3LjE3NjMwMzUwNzA.*_ga_ZLV02RYCZ8*czE3NjMwMzUwNjkkbzEkZzAkdDE3NjMwMzUwNjkkajYwJGwwJGgw",
    "summary": "Okay, I have accessed and read the article: \"Bluetooth Channel Sounding: The Next Leap in Bluetooth Innovation.\"\n\nHere's a summary:\n\nThe article discusses Bluetooth Channel Sounding, a new technology set to significantly enhance Bluetooth's capabilities, particularly in location services and device tracking. Channel Sounding allows Bluetooth devices to accurately measure the distance and angle of arrival of signals, resulting in much more precise positioning compared to previous Bluetooth technologies like RSSI-based methods.\n\nThe core benefit is greatly improved accuracy in locating objects and devices. This unlocks a range of new applications, including:\n\n*   **Enhanced indoor navigation:** More precise mapping and wayfinding within buildings.\n*   **Asset tracking:** More reliable tracking of tools, equipment, and other valuable items.\n*   **Spatial awareness in AR/VR:** Enabling more immersive and responsive augmented and virtual reality experiences.\n*   **Keyless entry systems:** More secure and reliable access control for vehicles and buildings.\n\nThe article highlights that channel sounding achieves this accuracy by utilizing a technique to analyze the characteristics of the radio channel between devices. By measuring the time-of-flight and phase of the Bluetooth signal, it can precisely determine the distance and angle of arrival. The author emphasizes that the integration of channel sounding in the upcoming Bluetooth specifications will enable a new wave of innovation, improving the usability and functionality of Bluetooth-enabled devices in various industries. It is projected to provide accuracy at the centimeter level, a considerable improvement over current methods.\n",
    "chinese_title": "蓝牙信道探测：蓝牙创新的下一大步",
    "chinese_summary": "好的，我已经访问并阅读了文章：《蓝牙信道探测：蓝牙创新的下一次飞跃》。\n\n以下是摘要：\n\n文章讨论了蓝牙信道探测，这项新技术将显著增强蓝牙的功能，尤其是在定位服务和设备追踪方面。信道探测使蓝牙设备能够精确测量信号的距离和到达角，从而获得比以前基于 RSSI 的蓝牙技术更精确的定位。\n\n其核心优势在于大大提高了定位物体和设备的准确性。这开启了一系列新的应用，包括：\n\n*   **增强的室内导航：** 在建筑物内进行更精确的地图绘制和路径指引。\n*   **资产追踪：** 更可靠地追踪工具、设备和其他贵重物品。\n*   **AR/VR 中的空间感知：** 实现更具沉浸感和响应性的增强现实和虚拟现实体验。\n*   **无钥匙进入系统：** 为车辆和建筑物提供更安全可靠的访问控制。\n\n文章强调，信道探测通过利用一种分析设备之间无线电信道特征的技术来实现这种精度。 通过测量蓝牙信号的飞行时间和相位，它可以精确地确定距离和到达角。 作者强调，将信道探测集成到即将发布的蓝牙规范中将推动新一轮创新，提高蓝牙设备在各个行业的可用性和功能。 预计它将提供厘米级的精度，与目前的方法相比有了相当大的改进。"
  },
  {
    "id": "45972390",
    "title": "Bild AI (YC W25) is hiring – Make housing affordable",
    "url": "https://www.ycombinator.com/companies/bild-ai/jobs/m2ilR5L-founding-engineer-applied-ai",
    "summary": "Bild AI, a Y Combinator W25 startup, is hiring a Founding Engineer (Applied AI) to help make housing more affordable by improving construction efficiency. The company is tackling complex problems in blueprint reading, cost estimation, and permit applications using computer vision, LLMs, and AI.\n\nThe ideal candidate will have applied experience in CV/ML, be a 0-to-1 builder who's put AI into production, and possess a growth mindset. They should also communicate well, be comfortable with the initial \"schlep\" of an early-stage startup, and ideally have startup/founder experience or a background in construction. Being impact-driven is a plus.\n\nThe role focuses on the AI intelligence layer, shipping prototypes quickly, and improving them based on user feedback.  The company wants someone who is eager to apply the newest computer vision, LLM models, and AI systems.\n\nThe position is based in San Francisco, requiring full-time in-office work. Bild AI is an early-stage company using a model-garden approach to blueprint understanding. They raised funding from top VCs before demo day and have a customer-obsessed product development approach.\n",
    "chinese_title": "Bild AI (YC W25) 招聘 – 让住房变得可负担",
    "chinese_summary": "Bild AI 招聘创始工程师（应用AI），助力提升建筑效率，降低住房成本。该公司是一家 Y Combinator W25 初创公司，正利用计算机视觉、LLMs 和 AI 技术解决蓝图解读、成本估算和许可证申请方面的复杂问题。\n\n理想的候选人需具备 CV/ML 应用经验，是从 0 到 1 的 AI 产品构建者，并拥有成长型思维。他们还应具备良好的沟通能力，能适应早期初创公司的“苦活累活”，最好有创业/创始人经验或建筑行业背景。具有影响力驱动力者优先。\n\n该职位专注于 AI 智能层，快速交付原型，并根据用户反馈进行改进。公司希望求职者渴望应用最新的计算机视觉、LLM 模型和 AI 系统。\n\n该职位位于旧金山，需要全职在办公室工作。Bild AI 是一家采用模型花园方法进行蓝图理解的早期公司。他们在演示日之前获得了顶级风险投资公司的投资，并拥有以客户为中心的产品开发方法。"
  },
  {
    "id": "45974681",
    "title": "Strace-macOS: A clone of the strace command for macOS",
    "url": "https://github.com/Mic92/strace-macos",
    "summary": "`strace-macos` is a system call tracer for macOS, aiming to replicate the functionality of the Linux `strace` command. It utilizes the LLDB debugger API and boasts several advantages over the existing `dtruss` tool, primarily by working with System Integrity Protection (SIP) enabled.\n\nThe tool is currently in Beta, offering features like syscall filtering by name or category, symbolic decoding of arguments (flags, error codes, structs), multiple output formats (JSON Lines, strace-compatible text), color output, and summary statistics. Installation is possible via Nix Flakes or manually using macOS system Python (essential for LLDB bindings).\n\nUsage examples include tracing commands, filtering syscalls (file, network, process), attaching to running processes, and generating summary statistics. The documentation details supported syscall categories (file, network, process, etc.) and provides a comparison with Linux `strace`, highlighting feature parity and areas for future development like negation filtering, regex filtering, path filtering, and follow forks.\n\n`strace-macos` requires macOS 12+ (Monterey or later), ideally on Apple Silicon. Contributions are welcomed, and commercial support is available through the author or Numtide. The core functionality is working, covering process spawning, attaching, syscall capture, argument decoding, symbolic flag decoding, error code decoding, struct decoding, syscall filtering, and output formatting. The project aims for compatibility with Linux `strace` wherever feasible and surpasses `dtruss` by working with SIP and offering richer output.\n",
    "chinese_title": "Strace-macOS：macOS 平台的 strace 命令克隆",
    "chinese_summary": "`strace-macos` 是 macOS 的系统调用跟踪器，旨在复制 Linux `strace` 命令的功能。它利用 LLDB 调试器 API，并比现有的 `dtruss` 工具拥有多个优势，主要是可在启用系统完整性保护 (SIP) 的情况下工作。\n\n该工具目前处于 Beta 版，提供按名称或类别过滤系统调用、参数的符号解码（标志、错误代码、结构体）、多种输出格式（JSON Lines、strace 兼容的文本）、彩色输出和摘要统计等功能。可以通过 Nix Flakes 安装，也可以使用 macOS 系统 Python（LLDB 绑定所必需）手动安装。\n\n使用示例包括跟踪命令、过滤系统调用（文件、网络、进程）、附加到正在运行的进程以及生成摘要统计信息。文档详细介绍了支持的系统调用类别（文件、网络、进程等），并提供了与 Linux `strace` 的比较，强调了功能对等性以及未来开发的领域，如否定过滤、正则表达式过滤、路径过滤和跟踪 fork。\n\n`strace-macos` 需要 macOS 12+（Monterey 或更高版本），最好在 Apple Silicon 上运行。欢迎贡献，并且可以通过作者或 Numtide 获得商业支持。核心功能已经可以工作，涵盖进程生成、附加、系统调用捕获、参数解码、符号标志解码、错误代码解码、结构体解码、系统调用过滤和输出格式化。该项目旨在尽可能与 Linux `strace` 兼容，并且通过在 SIP 下工作和提供更丰富的输出来超越 `dtruss`。"
  },
  {
    "id": "45961886",
    "title": "Google boss says AI investment boom has 'elements of irrationality'",
    "url": "https://www.bbc.com/news/articles/cwy7vrd8k4eo",
    "summary": "In an exclusive interview with the BBC, Alphabet (Google's parent company) CEO Sundar Pichai expressed concerns about \"elements of irrationality\" in the current AI investment boom, echoing fears of a potential bubble similar to the dotcom era. Despite Google's potential to weather such a storm, Pichai warned that no company would be completely immune.\n\nThe article highlights the soaring valuations of AI tech companies, exemplified by Alphabet's shares doubling in seven months and Nvidia's record-breaking $5 trillion valuation. Some analysts are skeptical of the massive deals surrounding OpenAI, raising concerns of a market overshoot.\n\nPichai drew parallels to the internet's early days, acknowledging excess investment but emphasizing AI's profound potential. He also noted the industry's significant energy demands, which are impacting Google's climate targets, requiring action to develop new energy sources.\n\nGoogle is investing heavily in the UK, committing £5 billion to AI infrastructure and research, including DeepMind, and planning to train AI models there, potentially solidifying the UK as an AI superpower.\n\nPichai also addressed the impact of AI on jobs, anticipating societal disruptions and the need for adaptation, emphasizing that those who learn to use AI tools will thrive in their professions. He underscored the necessity for societal adaptation amidst evolving job markets.\n",
    "chinese_title": "谷歌老板称人工智能投资热潮存在“非理性因素”",
    "chinese_summary": "谷歌CEO皮查伊：人工智能投资热潮存在“非理性因素”"
  },
  {
    "id": "45931113",
    "title": "A Rigorous Approach to the Algorithmic Composition of Iannis Xenakis(2009) [pdf]",
    "url": "https://monoskop.org/images/3/38/Hoffmann_Peter_Music_Out_of_Nothing_A_Rigorous_Approach_to_Algorithmic_Composition_by_Iannis_Xenakis_2009.pdf",
    "summary": "The article \"A Rigorous Approach to the Algorithmic Composition of Iannis Xenakis\" likely presents a method for creating music in the style of the composer Iannis Xenakis using algorithms. Xenakis was known for his mathematically driven compositions, often employing stochastic processes, set theory, and game theory to generate musical structures.\n\nThe article probably details the specific algorithms and mathematical models used to emulate Xenakis' compositional techniques. It might discuss how these algorithms are used to generate parameters such as pitch, duration, dynamics, and timbre, mimicking Xenakis' approach to creating complex and often dissonant soundscapes. The paper likely outlines a specific implementation of these algorithms, perhaps using software or programming languages designed for music composition.\n\nA key focus would likely be on how the algorithms translate Xenakis' abstract musical ideas into concrete musical scores or sound files. The article would probably analyze the resulting music, evaluating how successfully the algorithmic approach captures the unique characteristics of Xenakis' style. The rigor mentioned in the title suggests a systematic and well-defined methodology for creating music in Xenakis' style, emphasizing precision and mathematical control over the compositional process. It potentially explores the limitations and challenges of using algorithmic methods to replicate the creativity and expressiveness of a human composer.\n",
    "chinese_title": "伊安尼斯·泽纳基斯算法作曲的严谨方法(2009) [pdf]",
    "chinese_summary": "文章《扬尼斯·泽纳基斯算法作曲的严谨方法》可能介绍了一种使用算法创作扬尼斯·泽纳基斯风格音乐的方法。泽纳基斯以其数学驱动的作曲而闻名，经常采用随机过程、集合论和博弈论来生成音乐结构。\n\n该文章可能详细阐述了用于模仿泽纳基斯作曲技巧的特定算法和数学模型。它可能会讨论这些算法如何用于生成诸如音高、时值、力度和音色等参数，从而模仿泽纳基斯创作复杂且通常不协和的音景的方法。该论文很可能概述了这些算法的特定实现，可能使用专为音乐创作设计的软件或编程语言。\n\n一个关键的重点很可能是算法如何将泽纳基斯抽象的音乐理念转化为具体的乐谱或声音文件。该文章可能会分析由此产生的音乐，评估算法方法在多大程度上成功地捕捉了泽纳基斯风格的独特特征。标题中提到的“严谨”暗示了一种系统且定义明确的方法，用于创作泽纳基斯风格的音乐，强调对作曲过程的精确性和数学控制。它可能探讨了使用算法方法来复制人类作曲家的创造力和表现力的局限性和挑战。"
  },
  {
    "id": "45981858",
    "title": "EU Commission's Digital Omnibus is a major rollback of EU digital protections",
    "url": "https://edri.org/our-work/commissions-digital-omnibus-is-a-major-rollback-of-eu-digital-protections/",
    "summary": "The European Commission's \"Digital Omnibus\" proposals, including the Digital Omnibus and Digital Omnibus on AI, are criticized as a major rollback of EU digital protections, threatening human rights and tech policy. EDRi argues these proposals weaken the GDPR, ePrivacy Directive, and AI Act, effectively dismantling a rules-based system built over decades.\n\nKey criticisms include:\n*   **Weakening ePrivacy:** Shifting device access provisions to the GDPR with broad exceptions allowing data collection without consent.\n*   **Undermining GDPR:** Narrowing the definition of personal data, enabling unchecked use of data for AI training, and weakening automated decision-making safeguards.\n*   **Diluting AI Act:** Allowing exemptions from fundamental AI rules, delaying high-risk requirements, and weakening transparency and accountability.\n\nEDRi contends these changes favor corporate interests, particularly Big Tech, and the US administration, at the expense of individual rights and protections, especially for marginalized communities. They criticize the Commission for circumventing democratic scrutiny and prioritizing industry input over public interest. The Digital Fitness Check further signals a broad deregulation agenda for all digital protections.\n\nEDRi urges the European Council and Parliament to reject these proposals and focus on enforcing existing digital laws. They argue that the EU needs stronger enforcement of digital rights, not weaker rules, to protect people in the digital age.\n",
    "chinese_title": "欧盟委员会数字综合法案是对欧盟数字保护的重大倒退",
    "chinese_summary": "欧盟委员会的“数字综合方案”，包括数字综合方案和人工智能数字综合方案，被批评为对欧盟数字保护的重大倒退，威胁人权和科技政策。EDRi认为这些提案削弱了GDPR、ePrivacy指令和人工智能法案，实际上是在拆除数十年来建立的基于规则的体系。\n\n主要批评包括：\n*   **削弱ePrivacy：** 将设备访问条款转移到GDPR，并设置广泛的例外，允许在未经同意的情况下收集数据。\n*   **破坏GDPR：** 缩小个人数据的定义，使未经检查的数据可用于人工智能培训，并削弱自动化决策的保障。\n*   **稀释人工智能法案：** 允许豁免基本人工智能规则，推迟高风险要求，并削弱透明度和问责制。\n\nEDRi认为，这些改变有利于企业利益，特别是大型科技公司和美国政府，却牺牲了个人权利和保护，尤其是边缘化群体。他们批评欧盟委员会规避民主监督，优先考虑行业投入而非公共利益。“数字适应性检查”进一步预示着对所有数字保护的广泛放松管制议程。\n\nEDRi敦促欧洲理事会和议会否决这些提案，并专注于执行现有的数字法律。他们认为，欧盟需要加强数字权利的执行力度，而不是削弱规则，以保护数字时代的人们。"
  },
  {
    "id": "45970391",
    "title": "OrthoRoute – GPU-accelerated autorouting for KiCad",
    "url": "https://bbenchoff.github.io/pages/OrthoRoute.html",
    "summary": "OrthoRoute is a GPU-accelerated autorouter plugin for KiCad designed to handle complex, high-density PCBs that traditional autorouters struggle with. Developed out of necessity to route a massive backplane with over 8,000 nets and 17,000 pads, the author leveraged KiCad's new IPC API to build a second PCB model within the plugin and implemented a Manhattan Orthogonal Routing Engine.\n\nThe core algorithm is PathFinder, adapted from FPGA routing techniques, treating the PCB as a graph with nodes representing intersections and edges representing traces. The algorithm iteratively routes nets, accounting for congestion and rerouting problematic traces. GPU acceleration via CUDA drastically speeds up the computationally intensive PathFinder algorithm, enabling the routing of complex boards.\n\nChallenges included managing congestion, oscillation, and parameter tuning. The author developed board-adaptive parameters that analyzes the board's characteristics to optimize the PathFinder's behavior, thus addressing the limitations of relying on a single set of parameters.\n\nDue to the size of the target backplane, the autorouting was performed on a rented GPU server and imported back into KiCad. The process, while taking 41 hours, was significantly faster than traditional methods. Despite some DRC (Design Rule Check) issues requiring manual cleanup, OrthoRoute successfully routed the complex backplane.\n\nThe author hopes the modular architecture of OrthoRoute will inspire further development and adaptation for different board types and routing strategies, emphasizing the potential for GPU-accelerated routing in PCB design.\n",
    "chinese_title": "OrthoRoute – 用于KiCad的GPU加速自动布线器",
    "chinese_summary": "OrthoRoute是一款GPU加速的KiCad自动布线插件，旨在处理传统自动布线器难以处理的复杂、高密度PCB。为了布线一个包含超过8,000个网络和17,000个焊盘的大型背板，作者利用KiCad的新IPC API在插件中构建了第二个PCB模型，并实现了一个曼哈顿正交布线引擎。\n\n核心算法是PathFinder，它改编自FPGA布线技术，将PCB视为一个图，节点代表交叉点，边代表走线。该算法迭代地布线网络，考虑拥塞情况并重新布线有问题的走线。通过CUDA进行GPU加速，极大地加快了计算密集型的PathFinder算法，从而能够布线复杂的电路板。\n\n挑战包括管理拥塞、振荡和参数调整。作者开发了板级自适应参数，分析电路板的特性以优化PathFinder的行为，从而解决了依赖单一参数集带来的局限性。\n\n由于目标背板的尺寸很大，自动布线是在租用的GPU服务器上进行的，然后导入回KiCad。该过程虽然耗时41小时，但比传统方法快得多。尽管存在一些需要手动清理的DRC（设计规则检查）问题，但OrthoRoute成功地布线了复杂的背板。\n\n作者希望OrthoRoute的模块化架构能够激发进一步的开发和适应，以用于不同的板类型和布线策略，并强调GPU加速布线在PCB设计中的潜力。"
  },
  {
    "id": "45969909",
    "title": "I am stepping down as the CEO of Mastodon",
    "url": "https://blog.joinmastodon.org/2025/11/my-next-chapter-with-mastodon/",
    "summary": "The founder and CEO of Mastodon is stepping down after nearly 10 years, transferring ownership of the trademark and other assets to the Mastodon non-profit. The decision stems from a desire to ensure the project remains true to its values and avoids the pitfalls of founder-led ventures where egos can derail thriving communities. The CEO acknowledges a degree of self-interest, admitting the role has been stressful and incompatible with their personality. The pressures of being compared to tech billionaires without the resources, coupled with negative user interactions and superficial criticism, have taken a toll.\n\nWhile the CEO is reluctant to evaluate their own legacy, they emphasize the importance of saying \"no\" to maintain focus, even though this may have cost Mastodon publicity opportunities. Their proudest achievement is the project's evolution from a bedroom-coded creation to a thriving, community-centered entity within the broader Fediverse.\n\nDespite stepping down as CEO, the founder will remain involved in an advisory role, driven by a passion for Mastodon and the Fediverse. They view the Fediverse as a crucial alternative to the increasingly dystopian capitalist internet and believe Mastodon is the best hope for bringing this better vision to a wider audience. They believe the organization can continue towards the original vision better with new leadership.\n",
    "chinese_title": "我将卸任Mastodon CEO。",
    "chinese_summary": "Mastodon创始人兼CEO在职近10年后卸任，将商标及其他资产所有权移交给Mastodon非营利组织。此举旨在确保项目坚守其价值观，避免创始人主导的风险，即创始人个人因素可能使蓬勃发展的社群脱轨。该CEO承认存在一定的个人原因，表示该职位压力巨大，与个人性格不符。在缺乏资源的情况下被拿来与科技亿万富翁比较，加上负面的用户互动和肤浅的批评，都带来了很大的压力。\n\n虽然该CEO不愿评价自己的功绩，但强调了说“不”以保持专注的重要性，即使这可能导致Mastodon失去宣传机会。他们最自豪的成就是该项目从卧室里编写的代码发展成为Fediverse中一个蓬勃发展的、以社区为中心的实体。\n\n虽然卸任CEO，但创始人将继续担任顾问角色，源于对Mastodon和Fediverse的热情。他们认为Fediverse是日益反乌托邦式的资本主义互联网的一个重要替代方案，并相信Mastodon是将这一美好愿景带给更广泛受众的最佳希望。他们相信，在新的领导下，该组织能够更好地朝着最初的愿景前进。"
  },
  {
    "id": "45968362",
    "title": "Solving a million-step LLM task with zero errors",
    "url": "https://arxiv.org/abs/2511.09030",
    "summary": "This article, submitted to arXiv on November 12, 2025, introduces MAKER, a novel system designed to overcome the limitations of Large Language Models (LLMs) in executing long, multi-step tasks. While LLMs have shown promise in reasoning and tool use, their persistent error rates hinder their application to complex processes mirroring human or organizational workflows.\n\nMAKER achieves a breakthrough by successfully solving a task requiring over one million LLM steps with zero errors. The key innovation lies in an extreme decomposition of the task into numerous, highly focused subtasks handled by specialized \"microagents.\" This modularity allows for efficient error correction at each step through a multi-agent voting mechanism.\n\nThe authors argue that this approach, termed Massively Decomposed Agentic Processes (MDAPs), offers a more promising path to scaling LLM capabilities for complex, real-world problems than relying solely on the continuous improvement of monolithic LLMs. The paper highlights the potential of MDAPs to efficiently solve problems at the scale of organizations and societies.\n\nThe paper is 14 pages long (29 pages including references and appendix) and is classified under Artificial Intelligence, Computation and Language, and Multiagent Systems. It includes links to resources such as a PDF version of the paper, an experimental HTML version, TeX source, and links to bibliographic tools, code repositories, and demo platforms.\n",
    "chinese_title": "零错误解决百万步LLM任务",
    "chinese_summary": "本文于2025年11月12日提交至arXiv，介绍了MAKER，一种旨在克服大型语言模型（LLMs）在执行漫长、多步骤任务方面的局限性的新型系统。虽然LLMs在推理和工具使用方面展现出了前景，但其持续存在的错误率阻碍了它们在复杂流程中的应用，这些流程需要能镜像人类或组织的工作流程。\n\nMAKER通过成功解决一项需要超过一百万个LLM步骤且零误差的任务，实现了突破。其关键创新在于将任务极端分解为大量由专门的“微代理”处理的高度聚焦的子任务。这种模块化允许通过多代理投票机制在每个步骤进行有效的纠错。\n\n作者认为，这种被称为大规模分解代理过程（MDAPs）的方法，为扩展LLM解决复杂、现实世界问题的能力提供了一条更有希望的途径，而不是仅仅依赖于单片LLM的持续改进。该论文强调了MDAPs在高效解决组织和社会规模问题方面的潜力。\n\n该论文共14页（包括参考文献和附录共29页），并被归类为人工智能、计算与语言以及多代理系统。 它包括指向资源的链接，例如论文的PDF版本、实验性HTML版本、TeX源代码，以及指向书目工具、代码存储库和演示平台的链接。"
  },
  {
    "id": "45980640",
    "title": "Deep Dive into FFmpeg 8.0",
    "url": "https://www.rendi.dev/post/ffmpeg-8-0-part-1-using-whisper-for-native-video-transcription-in-ffmpeg",
    "summary": "This article provides a deep dive into FFmpeg 8.0, focusing on its exciting new native integration with Whisper, OpenAI's open-source speech recognition library. This integration allows users to transcribe video and audio, add subtitles, and extract highlights using a single tool.\n\nThe article covers installing FFmpeg 8.0 with Whisper on Windows, explaining the new Whisper filter parameters (model, language, queue, destination, format), and reviewing benchmarks of Whisper transcription using different models (base, medium, large). It highlights that the base and medium English models also annotate non-speech audio events like music and screaming. The performance benchmarks show the impact of model size and GPU usage on transcription speed.\n\nThe article then explores real-time video stream transcription using HLS, demonstrating how to output SRT subtitles directly to the terminal. Finally, it touches on Voice Activation Detection (VAD) capabilities, discussing its potential for improving transcription accuracy and handling hallucinations, although tests showed no significant speed increase. The provided code snippets showcase how to use FFmpeg commands for tasks like generating SRT files and burning subtitles into videos.\n",
    "chinese_title": "FFmpeg 8.0深度剖析",
    "chinese_summary": "本文深入探讨了FFmpeg 8.0，重点介绍了其与OpenAI开源语音识别库Whisper令人激动的新原生集成。此集成允许用户使用单个工具转录视频和音频、添加字幕以及提取精彩片段。\n\n本文介绍了在Windows上安装带有Whisper的FFmpeg 8.0，解释了新的Whisper滤镜参数（模型、语言、队列、目的地、格式），并回顾了使用不同模型（base、medium、large）进行Whisper转录的基准测试。文章强调，base和medium英语模型还会标注非语音音频事件，如音乐和尖叫。性能基准测试显示了模型大小和GPU使用对转录速度的影响。\n\n本文然后探讨了使用HLS的实时视频流转录，演示了如何将SRT字幕直接输出到终端。最后，本文简要介绍了语音激活检测 (VAD) 功能，讨论了其提高转录准确性和处理幻觉的潜力，尽管测试显示速度没有显著提高。提供的代码片段展示了如何使用FFmpeg命令来执行生成SRT文件和将字幕烧录到视频等任务。"
  },
  {
    "id": "45970338",
    "title": "Show HN: RowboatX – open-source Claude Code for everyday automations",
    "url": "https://github.com/rowboatlabs/rowboat",
    "summary": "RowboatX is an open-source CLI tool inspired by Claude Code that allows users to create and manage background agents with full shell access for everyday automations. It supports various LLM providers like OpenAI, Anthropic, Gemini, Ollama, and others, through a configurable `models.json` file.\n\nKey features include:\n\n*   **Background Agents with Shell Access:** Create agents to perform tasks like generating podcasts from articles using shell commands (including `ffmpeg`).\n*   **MCP Server Integration:** Connect to any MCP (Machine Control Protocol) server to add capabilities to your agents. RowboatX handles the integration process.\n*   **Scheduling and Monitoring:** Schedule agents to run at specific times, monitor their execution status, and inspect their state on the filesystem.\n*   **Manual Execution and Resumption:** Run agents manually with inputs or resume from previous runs using a run ID.\n*   **Easy Configuration:** Configure LLM providers and models in a `models.json` file, including custom baseURLs and headers for OpenAI-compatible hosts.\n\nRowboatX simplifies the creation, management, and execution of automated tasks powered by LLMs and shell scripting. It offers a powerful and flexible approach to automating everyday workflows. The documentation also mentions the existence of a \"Rowboat Classic UI\", implying it's distinct from the CLI-based RowboatX.\n",
    "chinese_title": "Show HN: RowboatX – 日常自动化任务的开源Claude代码",
    "chinese_summary": "RowboatX 是一个受 Claude Code 启发的开源 CLI 工具，它允许用户创建和管理具有完整 Shell 访问权限的后台代理，用于日常自动化任务。它通过可配置的 `models.json` 文件支持各种 LLM 提供商，例如 OpenAI、Anthropic、Gemini、Ollama 等。\n\n主要功能包括：\n\n*   **具有 Shell 访问权限的后台代理：** 创建代理来执行任务，例如使用 Shell 命令（包括 `ffmpeg`）从文章生成播客。\n*   **MCP 服务器集成：** 连接到任何 MCP（机器控制协议）服务器，为您的代理添加功能。RowboatX 处理集成过程。\n*   **调度和监控：** 调度代理在特定时间运行，监控它们的执行状态，并在文件系统上检查它们的状态。\n*   **手动执行和恢复：** 使用输入手动运行代理，或使用运行 ID 从之前的运行恢复。\n*   **轻松配置：** 在 `models.json` 文件中配置 LLM 提供商和模型，包括用于 OpenAI 兼容主机的自定义 baseURL 和标头。\n\nRowboatX 简化了由 LLM 和 Shell 脚本驱动的自动化任务的创建、管理和执行。它提供了一种强大而灵活的方法来自动化日常工作流程。该文档还提到了“Rowboat Classic UI”的存在，这意味着它与基于 CLI 的 RowboatX 不同。"
  },
  {
    "id": "45926141",
    "title": "What I learned about creativity from a man painting on a treadmill (2024)",
    "url": "https://quinnmaclay.com/texts/lets-paint",
    "summary": "This article explores how the author overcame creative blocks and the fear of failure through an unlikely source: John Kilduff's \"Let's Paint TV.\" The author initially found conventional sources of inspiration, like masterpieces, intimidating and discouraging.\n\n\"Let's Paint TV,\" a show featuring Kilduff painting (poorly) while exercising and multitasking amidst chaos like obnoxious callers and technical difficulties, offered a different kind of inspiration. The show's consistent \"failure\" is its core appeal. Kilduff's willingness to persevere despite inevitable disaster demonstrates the importance of the process over the product.\n\nThe author recounts Kilduff's disastrous appearance on \"America's Got Talent\" as further proof of the show's inherent unsuitability for mainstream success, yet Kilduff's continued dedication to the project emphasizes the value of endurance and experimentation, regardless of the outcome.\n\nKilduff's philosophy, as quoted from a Vice interview, underscores that inspiring others isn't about creating perfect art, but about demonstrating the willingness to try, fail, and continue. The author concludes that \"Let's Paint TV\" is a reminder to approach creative endeavors with a lighthearted attitude, embrace failure as a learning opportunity, and find joy in the creative process itself. Ultimately, the show serves as a metaphor for life's challenges, encouraging viewers to persevere and thrive amidst the chaos.\n",
    "chinese_title": "从跑步机上作画的人身上我学到的关于创造力的事 (2024)",
    "chinese_summary": "本文探讨了作者如何通过一个意想不到的来源——约翰·基尔达夫的“让我们画画电视”——克服创作障碍和对失败的恐惧。起初，作者发现传统的灵感来源，如杰作，令人望而却步，倍感沮丧。“让我们画画电视”是一个基尔达夫边运动边（拙劣地）绘画，并在像烦人的来电者和技术困难等混乱中兼顾多项任务的节目，它提供了一种不同的灵感来源。该节目持续的“失败”是其核心吸引力。基尔达夫愿意在不可避免的灾难面前坚持下去，这表明了过程比结果更重要。\n\n作者回顾了基尔达夫在“美国达人秀”上的灾难性亮相，进一步证明了该节目固有的不适合主流成功，然而基尔达夫对该项目的持续投入强调了耐力和实验的价值，无论结果如何。\n\n基尔达夫在Vice采访中引用的哲学强调，激励他人不是创造完美的艺术，而是展示尝试、失败和继续的意愿。作者总结说，“让我们画画电视”提醒人们以轻松的心态对待创作活动，将失败视为学习机会，并在创作过程中找到乐趣。最终，该节目成为了人生挑战的隐喻，鼓励观众在混乱中坚持下去并茁壮成长。"
  },
  {
    "id": "45966251",
    "title": "Nearly all UK drivers say headlights are too bright",
    "url": "https://www.bbc.com/news/articles/c1j8ewy1p86o",
    "summary": "A recent UK government-commissioned study reveals widespread concern among drivers about headlight brightness. According to the Department for Transport (DfT), 97% of drivers surveyed reported being regularly or sometimes distracted by oncoming vehicle headlights, with 96% believing that some or most headlights are too bright. This has led the government to announce that it will further investigate headlight design.\n\nThe study, conducted by the Transport Research Laboratory (TRL), indicates that LED and whiter headlamps may contribute to glare issues. Consequently, a significant portion of drivers (33%) have either reduced or stopped driving at night, while another 22% would prefer to drive less at night but are unable to do so.\n\nTRL's research highlights that LED lights, which are increasingly used in vehicles, are brighter, more concentrated, and emit more blue light, which can be challenging for the human eye at night. The RAC's senior policy officer, Rod Dennis, has welcomed the findings and emphasizes the need for a balance between effective headlights and minimizing glare. Denise Voon of The College of Optometrists advocates for immediate action and further research to modify headlight regulations. The DfT will include new measures in its upcoming Road Safety Strategy to address the problem.\n",
    "chinese_title": "几乎所有英国司机都表示车头灯太亮。",
    "chinese_summary": "英国政府近期委托的一项研究显示，驾驶员普遍担忧前大灯亮度问题。据交通部（DfT）称，97%的受访驾驶员表示经常或有时会受到迎面车辆前大灯的干扰，96%的人认为某些或大多数前大灯过于明亮。因此，政府宣布将进一步调查前大灯设计。\n\n由交通运输研究所（TRL）进行的研究表明，LED和更白的前照灯可能会导致眩光问题。因此，很大一部分驾驶员（33%）已经减少或停止夜间驾驶，而另有22%的人更愿意减少夜间驾驶，但无法做到。\n\nTRL的研究强调，LED灯越来越多地应用于车辆，它们更亮、更集中，并发出更多的蓝光，这在夜间可能对人眼造成挑战。英国皇家汽车俱乐部（RAC）高级政策官员Rod Dennis对调查结果表示欢迎，并强调需要在有效前照灯和最大限度地减少眩光之间取得平衡。验光师学院的Denise Voon主张立即采取行动并进一步研究以修改前照灯法规。交通部将在其即将发布的道路安全战略中纳入新措施以解决该问题。"
  },
  {
    "id": "45964835",
    "title": "GoSign Desktop RCE flaws affecting users in Italy",
    "url": "https://www.ush.it/2025/11/14/multiple-vulnerabilities-gosign-desktop-remote-code-execution/",
    "summary": "This document details a critical Remote Code Execution (RCE) vulnerability found in GoSign Desktop versions 2.4.0 and earlier, a widely used electronic signature solution in Italy. The vulnerability stems from a TLS verification bypass and an insecure update mechanism.\n\nSpecifically, GoSign Desktop disables TLS certificate validation when a proxy is configured, opening the door to Man-in-the-Middle (MitM) attacks. This bypass, combined with an update process that relies on unsigned manifests, allows an attacker to inject malicious updates, leading to arbitrary code execution. Attack scenarios include malicious software installation, credential theft, and privilege escalation. The vulnerability affects Windows, macOS, and Linux versions.\n\nThe vendor, Tinexta InfoCert, initially acknowledged the vulnerability but then ceased communication and released version 2.4.1 without proper disclosure or acknowledgment. While version 2.4.1 addresses the remote code execution through manifest signing, the underlying TLS verification bypass when using a proxy remains unfixed, leaving OAuth secrets vulnerable to interception.\n\nThe researchers used dynamic runtime instrumentation to confirm the disabling of TLS certificate verification.  The advisory includes proof-of-concept code demonstrating the vulnerability. The document highlights the vendor's poor handling of the responsible disclosure process and the potential widespread impact on users in Italy, including public administrations and enterprises.\n",
    "chinese_title": "GoSign桌面版RCE漏洞影响意大利用户",
    "chinese_summary": "本文详细描述了GoSign Desktop 2.4.0及更早版本中发现的一个严重远程代码执行(RCE)漏洞，GoSign Desktop是在意大利广泛使用的电子签名解决方案。该漏洞源于TLS验证绕过和一个不安全的更新机制。\n\n具体来说，当配置了代理时，GoSign Desktop会禁用TLS证书验证，从而为中间人(MitM)攻击敞开了大门。这种绕过，加上依赖于未签名清单的更新过程，使得攻击者可以注入恶意更新，导致任意代码执行。攻击场景包括恶意软件安装、凭据窃取和权限提升。该漏洞影响Windows、macOS和Linux版本。\n\n供应商Tinexta InfoCert最初承认了该漏洞，但随后停止了沟通，并在没有适当披露或确认的情况下发布了2.4.1版本。虽然2.4.1版本通过清单签名解决了远程代码执行问题，但使用代理时底层TLS验证绕过问题仍然未修复，导致OAuth密钥容易被拦截。\n\n研究人员使用动态运行时检测来确认TLS证书验证的禁用。该建议包含证明该漏洞的概念验证代码。本文强调了供应商对负责任披露流程的处理不当，以及对意大利用户（包括公共管理部门和企业）的潜在广泛影响。"
  },
  {
    "id": "45966435",
    "title": "Short Little Difficult Books",
    "url": "https://countercraft.substack.com/p/short-little-difficult-books",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "短小精悍的难题书",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "45890898",
    "title": "Gymkhana's 1978 Subaru Brat with 9,500-RPM Redline, Active Aero Is One Super Ute",
    "url": "https://www.thedrive.com/news/gymkhanas-1978-subaru-brat-with-9500-rpm-redline-and-active-aero-is-one-super-ute",
    "summary": "The article introduces Hoonigan's latest Gymkhana vehicle: the Subaru Brataroo 9500 Turbo, based on a 1978 Subaru BRAT. This heavily modified ute boasts a Vermont SportsCar-built turbocharged 2.0-liter boxer engine producing 670 horsepower and 680 lb-ft of torque, capable of revving to a remarkable 9,500 rpm. It employs a race-derived all-wheel-drive system and a six-speed sequential SADEV gearbox for optimal power delivery and tire-shredding capabilities. Active Aero features prominently, with adjustable wings and flaps designed to enhance cornering, stability at high speeds, and safe landings after jumps. The Brataroo features a striking livery and a massive rear wing. While the carbon fiber interior is said to resemble the original '78 design, no images have been released. The Brataroo will debut in the next Gymkhana episode, \"Aussie Shred,\" on the Hoonigan YouTube channel in early December.\n",
    "chinese_title": "金卡纳改装版1978年斯巴鲁Brat：9500转红线，主动气动，超级皮卡",
    "chinese_summary": "本文介绍了Hoonigan最新的金卡纳战车：斯巴鲁Brataroo 9500 Turbo，该车基于1978年款斯巴鲁BRAT改装而来。 这款经过重度改装的皮卡拥有由Vermont SportsCar打造的涡轮增压2.0升水平对置发动机，可产生670马力和680磅-英尺的扭矩，转速可达惊人的9500转/分。 它采用了源自赛车的全轮驱动系统和一个六速序列式SADEV变速箱，以实现最佳动力传递和轮胎撕裂能力。 主动空气动力学套件非常突出，配备了可调节的翼板和襟翼，旨在增强转弯性能、高速稳定性以及跳跃后的安全着陆。 Brataroo拥有引人注目的涂装和一个巨大的后扰流板。 据称碳纤维内饰与1978年的原始设计相似，但尚未发布任何图片。 Brataroo将于12月初在Hoonigan YouTube频道上的下一集金卡纳剧集“Aussie Shred”中首次亮相。"
  },
  {
    "id": "45980986",
    "title": "EU eases AI, privacy rules as critics warn of caving to Big Tech",
    "url": "https://www.reuters.com/sustainability/boards-policy-regulation/eu-ease-ai-privacy-rules-critics-warn-caving-big-tech-trump-2025-11-19/",
    "summary": "Here's a summary based on the title, assuming the article discusses a softening of AI and privacy rules in the EU:\n\nThe EU is reportedly easing its approach to AI and privacy regulations, prompting criticism that it's caving to pressure from Big Tech companies. While the precise details of these changes are not provided in the title alone, it suggests a shift away from stricter measures initially proposed or implemented. This relaxation could involve weakening enforcement mechanisms, narrowing the scope of regulated activities, or delaying implementation timelines.\n\nCritics are concerned that this move will benefit large technology corporations at the expense of individual privacy and ethical AI development. They fear that by loosening the rules, the EU risks creating a regulatory environment where Big Tech can operate with less oversight and accountability. This shift comes amidst broader political discussions, including a potential return of Donald Trump to power in 2025, which may influence the EU's strategic priorities and willingness to maintain a hard line on tech regulation. The article likely explores the specific amendments being made, the rationale behind them, and the potential consequences for consumers, businesses, and the future of AI governance in Europe.\n",
    "chinese_title": "欧盟放松人工智能、隐私规定，批评者警告向大型科技公司让步",
    "chinese_summary": "据称欧盟正在放松其人工智能和隐私监管，引发了对其屈服于大型科技公司压力的批评。虽然仅从标题无法得知这些改变的具体细节，但这暗示着欧盟正在偏离最初提议或实施的更严格措施。这种放松可能包括削弱执法机制、缩小受监管活动的范围或推迟实施时间表。\n\n批评人士担心，此举将以牺牲个人隐私和合乎道德的人工智能发展为代价，让大型科技公司受益。他们担心，通过放松规则，欧盟可能会创造一种监管环境，让大型科技公司能够在更少的监督和问责制下运营。这一转变正值更广泛的政治讨论之际，包括唐纳德·特朗普可能于2025年重返权力，这可能会影响欧盟的战略重点以及维持对科技监管强硬立场的意愿。文章可能探讨了正在进行的具体修改、修改背后的理由，以及对消费者、企业和欧洲人工智能治理未来的潜在后果。"
  },
  {
    "id": "45980975",
    "title": "Researchers claim 'largest leak ever' after uncovering WhatsApp enumeration flaw",
    "url": "https://www.theregister.com/2025/11/19/whatsapp_enumeration_flaw/",
    "summary": "Researchers at the University of Vienna discovered a WhatsApp enumeration flaw that allowed them to collect data on 3.5 billion users, potentially the \"largest data leak in history.\" By inputting generated phone numbers, they were able to gather user details like phone number, name, and profile picture at a rate of 100 million accounts per hour, exploiting the platform's lack of effective rate limiting.\n\nThe collected data could be used to create a reverse phonebook and reveal sensitive user information from profile text, including sexual orientation, political views, and professional details, potentially impacting individuals in countries where WhatsApp is banned. The researchers also highlighted the potential for misuse by cybercriminals for spam, phishing, and robocall attacks.\n\nThe researchers found that a significant portion of phone numbers from the 2021 Facebook data scrape were still active on WhatsApp. After being notified through the bug bounty program, Meta claimed to have been working on anti-scraping systems, which the researchers confirmed are now effective in blocking the enumeration method. While user messages remained end-to-end encrypted and no non-public data was accessed, the researchers noted Meta's slow initial response, taking nearly a year to address the issue meaningfully. However, they acknowledged that Meta acted promptly once the extent of the problem was realized.\n",
    "chinese_title": "研究人员称发现 WhatsApp 枚举漏洞，造成“史上最大泄露”",
    "chinese_summary": "维也纳大学的研究人员发现了一个 WhatsApp 枚举漏洞，使他们能够收集 35 亿用户的数据，这可能成为“历史上最大的数据泄露事件”。通过输入生成的电话号码，他们能够以每小时 1 亿个帐户的速度收集用户详细信息，如电话号码、姓名和头像，利用了该平台缺乏有效速率限制的缺陷。\n\n收集到的数据可能被用于创建反向电话簿，并泄露来自个人资料文本的敏感用户信息，包括性取向、政治观点和职业细节，这可能会影响在 WhatsApp 被禁止的国家/地区的个人。研究人员还强调了网络犯罪分子可能滥用这些数据进行垃圾邮件、网络钓鱼和自动语音电话攻击的可能性。\n\n研究人员发现，2021 年 Facebook 数据泄露事件中很大一部分电话号码仍然在 WhatsApp 上处于活动状态。在通过漏洞赏金计划收到通知后，Meta 声称一直在开发反爬虫系统，研究人员证实这些系统现在可以有效地阻止枚举方法。虽然用户消息仍然是端到端加密的，并且没有访问任何非公开数据，但研究人员指出 Meta 最初的反应很慢，花费了近一年的时间才对这个问题采取有意义的措施。然而，他们承认，一旦意识到问题的严重性，Meta 立即采取了行动。"
  },
  {
    "id": "45971726",
    "title": "GitHub: Git operation failures",
    "url": "https://www.githubstatus.com/incidents/5q7nmlxz30sk",
    "summary": "On November 18, 2025, GitHub experienced Git operation failures affecting Git Operations and Codespaces. The incident began with degraded availability in Git Operations, which prompted investigation starting at 20:39 UTC. Initial reports at 20:52 UTC mentioned failures specifically with Git HTTP operations. Further updates revealed that all Git operations, including SSH and HTTP, were failing, and Codespaces experienced degraded availability as well.\n\nGitHub identified the likely cause and worked on a fix, deploying it around 21:36 UTC. They began to observe recovery in some areas and continued to provide updates. By 21:55 UTC, Codespaces was operating normally, and GitHub reported full recovery across all services. Git Operations was also operating normally by 21:56 UTC. The incident was resolved at 21:59 UTC, and GitHub promised to share a detailed root cause analysis. Throughout the incident, GitHub provided frequent updates via their status page.\n",
    "chinese_title": "GitHub: Git 操作失败",
    "chinese_summary": "2025年11月18日，GitHub发生Git操作故障，影响Git操作和Codespaces。事件始于Git操作可用性下降，于UTC时间20:39开始调查。UTC时间20:52的初步报告提到Git HTTP操作出现故障。进一步的更新显示，包括SSH和HTTP在内的所有Git操作均失败，Codespaces的可用性也随之降低。\n\nGitHub确定了可能的原因并着手修复，于UTC时间21:36左右部署了修复程序。他们开始观察到一些领域的恢复情况，并继续提供更新。到UTC时间21:55，Codespaces已正常运行，GitHub报告所有服务已完全恢复。Git操作也于UTC时间21:56恢复正常运行。事件于UTC时间21:59解决，GitHub承诺分享详细的根本原因分析。在整个事件过程中，GitHub通过其状态页面提供了频繁的更新。"
  },
  {
    "id": "45911897",
    "title": "Fizz Buzz without conditionals or booleans",
    "url": "https://evanhahn.com/fizz-buzz-without-conditionals-or-booleans/",
    "summary": "Evan Hahn presents a creative solution to the classic Fizz Buzz problem, but with a unique constraint: no booleans, conditionals, or pattern matching. He leverages Python's `itertools.cycle` to generate repeating sequences of empty strings and the words \"Fizz\" and \"Buzz\". These cycling sequences are then combined with the numbers 1 through 100 using `zip`. The core of the solution lies in the `string_mask` function, which replaces the beginning of the number string with \"Fizz\", \"Buzz\", or \"FizzBuzz\" if present; otherwise, it leaves the original number string unchanged.\n\nThe article highlights the ingenuity of achieving Fizz Buzz without typical conditional logic, showcasing a clever use of string manipulation and sequence generation. However, it also acknowledges a limitation: the code breaks down for numbers 10,000 and above due to the `string_mask` function's behavior when the generated string (\"Fizz\", \"Buzz\", etc.) is shorter than the number string. The author concludes by inviting readers to propose alternative solutions, implying that there are likely more robust or elegant approaches to the problem under these specific constraints.\n",
    "chinese_title": "不用条件语句或布尔值的Fizz Buzz",
    "chinese_summary": "埃文·哈恩提出了一种解决经典 Fizz Buzz 问题的创造性方案，但带有一个独特的约束：不使用布尔值、条件语句或模式匹配。他利用 Python 的 `itertools.cycle` 生成重复的空字符串以及单词 \"Fizz\" 和 \"Buzz\" 的序列。然后，这些循环序列与 1 到 100 的数字一起使用 `zip` 函数进行组合。解决方案的核心在于 `string_mask` 函数，如果存在 \"Fizz\"、\"Buzz\" 或 \"FizzBuzz\"，它会将数字字符串的开头替换为这些字符串；否则，它会保持原始数字字符串不变。\n\n这篇文章强调了在没有典型条件逻辑的情况下实现 Fizz Buzz 的巧妙之处，展示了对字符串操作和序列生成的巧妙运用。然而，它也承认一个局限性：由于当生成的字符串（\"Fizz\"、\"Buzz\" 等）短于数字字符串时，`string_mask` 函数的行为会导致代码在 10,000 及以上的数字时失效。作者最后邀请读者提出替代解决方案，暗示在这些特定约束下，可能存在更健壮或更优雅的解决方案。"
  },
  {
    "id": "45963583",
    "title": "The Miracle of Wörgl",
    "url": "https://scf.green/story-of-worgl-and-others/",
    "summary": "\"The Miracle of Wörgl\" explores the impactful history of complementary currencies and their potential to stimulate local economies. The article highlights the Austrian town of Wörgl in 1932, which combatted the Great Depression by issuing its own \"stamp scrip.\" This initiative drastically reduced unemployment, funding infrastructure projects and boosting local business. Six neighboring villages adopted similar systems, attracting international attention. However, the Austrian central bank banned the currency, reverting Wörgl to high unemployment and contributing to social unrest.\n\nThe article then discusses Professor Irving Fisher's recognition of Wörgl's success and his proposal to use \"stamp scrip\" to alleviate the Great Depression in the United States. While FDR initially seemed receptive, he ultimately prohibited complementary currencies fearing decentralization.\n\nThe article further discusses the widespread use of complementary currencies during the Central Middle Ages (1040-1290) in Europe. Communities financed the construction of cathedrals and other structures by issuing their own money, fostering economic growth, creating jobs, and stimulating arts and sciences. These cathedrals, financed by local citizens rather than the church, continue to generate revenue today through tourism.\n\nFinally, the article suggests that complementary currencies, now legal in many countries, have the potential to positively impact communities. It directs readers to further examples of successful implementations.\n",
    "chinese_title": "沃格尔奇迹",
    "chinese_summary": "沃尔格尔的奇迹：探索补充货币及其刺激地方经济的潜力"
  },
  {
    "id": "45973573",
    "title": "Rebecca Heineman – from homelessness to porting Doom (2022)",
    "url": "https://corecursive.com/doomed-to-fail-with-burger-becky/",
    "summary": "This article is a summary of the CoRecursive podcast episode featuring Rebecca \"Burger Becky\" Heineman, a veteran of the video game industry known for her expertise in porting games. It chronicles her journey from a difficult childhood marked by abuse and homelessness to becoming a successful game developer.\n\nThe narrative begins with Heineman's early life, detailing the hardships she faced, including food insecurity, which earned her the nickname \"Burger Becky\". At 15 she left home, and lived behind a dumpster until she got a job and eventually entered and won the Atari Space Invaders tournament, launching her career.\n\nThe article emphasizes her talent for understanding game hardware, which she developed by repairing arcade machines and reverse-engineering Atari 2600 cartridges. Her knowledge of the 6502 processor, used in both the Apple II and the Atari 2600, allowed her to disassemble and modify game code.\n\nHeineman's unique skills led to a job with Avalon Hill, marking her first paid programming role. She quickly gained a reputation for mastering new platforms and became Interplay's go-to person for ports.\n\nThe article then shifts to a story of porting Doom to the 3DO console, but touches on Heineman's expertise and experience leading up to that.\n",
    "chinese_title": "瑞贝卡·海尼曼——从无家可归到移植《毁灭战士》(2022)",
    "chinese_summary": "本文总结了CoRecursive播客节目，该节目以瑞贝卡·“汉堡贝基”·海涅曼为主角，她是一位资深电子游戏行业人士，以其游戏移植方面的专业知识而闻名。文章记录了她从遭受虐待和无家可归的艰难童年到成为一名成功的游戏开发者的历程。\n\n叙述从海涅曼的早年生活开始，详细描述了她所面临的困境，包括食物匮乏，这也使她获得了“汉堡贝基”的绰号。15岁时她离家出走，住在垃圾箱后面，直到她找到工作，最终参加并赢得了雅达利太空侵略者锦标赛，开启了她的职业生涯。\n\n文章强调了她对游戏硬件的理解能力，这是她通过修理街机和逆向工程雅达利2600游戏卡带而培养起来的。她对Apple II和Atari 2600中使用的6502处理器的了解，使她能够反汇编和修改游戏代码。\n\n海涅曼独特的技能使她获得了Avalon Hill的工作，这是她的第一个有偿编程职位。她很快就因精通新平台而声名鹊起，并成为Interplay进行移植的首选人员。\n\n文章随后转向了将《毁灭战士》移植到3DO游戏机的故事，但同时涉及了海涅曼在此之前所拥有的专业知识和经验。"
  },
  {
    "id": "45953001",
    "title": "Chuck Moore: Colorforth has stopped working [video]",
    "url": "https://www.youtube.com/watch?v=MvkGBWXb2oQ#t=22",
    "summary": "The article is a placeholder or stub, consisting solely of a YouTube copyright notice and standard links. It mentions a video titled \"Chuck Moore: Colorforth has stopped working,\" but provides no information about the video's content or context. The only information gleaned is that the video potentially discusses Chuck Moore and his programming language, Colorforth, and possibly addresses issues with it ceasing to function.\n",
    "chinese_title": "查克·摩尔：Colorforth 停止工作了 [视频]",
    "chinese_summary": "此条目为占位符或存根，仅包含YouTube版权声明和标准链接。提及名为“Chuck Moore: Colorforth has stopped working”的视频，但未提供关于该视频内容或背景的任何信息。唯一能获得的信息是该视频可能讨论了查克·摩尔和他的编程语言Colorforth，并可能涉及该语言停止工作的问题。"
  },
  {
    "id": "45900238",
    "title": "Mysterious holes in the Andes may have been an ancient marketplace",
    "url": "https://www.sydney.edu.au/news-opinion/news/2025/11/10/mysterious-holes-in-the-andes-may-have-been-an-ancient-marketplace-new-research-suggests.html",
    "summary": "A new study suggests that the mysterious \"Band of Holes\" (Monte Sierpe) in the Pisco Valley of southern Peru, consisting of over 5000 aligned holes, may have been an ancient marketplace. Researchers from the University of Sydney used drone technology to map the site and discovered numerical patterns in the layout, suggesting an underlying intention in its organization.\n\nIntriguingly, the arrangement of Monte Sierpe is similar to that of an Inca khipu (an ancient accounting device). Soil analysis revealed ancient pollens of maize (corn) and reeds, indicating that people deposited plants in the holes, potentially using baskets for transport.\n\nThese findings suggest that Monte Sierpe was a pre-Inca marketplace where mobile traders, specialists, and others exchanged goods like corn and cotton. The researchers believe the holes acted as a \"social technology\" that brought people together and later evolved into a large-scale accounting system under the Inca Empire.\n\nThe site's strategic location between Inca administrative sites and near a network of pre-Hispanic roads, in a transitional ecological zone, further supports the marketplace theory. The research team suggests the pre-Inca Chincha Kingdom initially used Monte Sierpe for regulated barter and exchange, which later developed into an accounting place under Inca rule. The study highlights the modification of landscapes by past communities to facilitate interaction and trade.\n",
    "chinese_title": "安第斯山脉的神秘洞穴或为古代集市",
    "chinese_summary": "A new study suggests that the mysterious \"Band of Holes\" (Monte Sierpe) in the Pisco Valley of southern Peru, consisting of over 5000 aligned holes, may have been an ancient marketplace. Researchers from the University of Sydney used drone technology to map the site and discovered numerical patterns in the layout, suggesting an underlying intention in its organization.\n\nIntriguingly, the arrangement of Monte Sierpe is similar to that of an Inca khipu (an ancient accounting device). Soil analysis revealed ancient pollens of maize (corn) and reeds, indicating that people deposited plants in the holes, potentially using baskets for transport.\n\nThese findings suggest that Monte Sierpe was a pre-Inca marketplace where mobile traders, specialists, and others exchanged goods like corn and cotton. The researchers believe the holes acted as a \"social technology\" that brought people together and later evolved into a large-scale accounting system under the Inca Empire.\n\nThe site's strategic location between Inca administrative sites and near a network of pre-Hispanic roads, in a transitional ecological zone, further supports the marketplace theory. The research team suggests the pre-Inca Chincha Kingdom initially used Monte Sierpe for regulated barter and exchange, which later developed into an accounting place under Inca rule. The study highlights the modification of landscapes by past communities to facilitate interaction and trade.\n"
  },
  {
    "id": "45968611",
    "title": "Strix Halo's Memory Subsystem: Tackling iGPU Challenges",
    "url": "https://chipsandcheese.com/p/strix-halos-memory-subsystem-tackling",
    "summary": "This article analyzes the memory subsystem of AMD's Strix Halo APU, focusing on how it tackles the challenges of balancing CPU and iGPU demands within a mobile device. Strix Halo features a 32MB Infinity Cache (MALL) acting as the GPU's last-level cache, significantly larger than previous AMD mobile iGPUs. While Infinity Cache latency is slightly higher compared to discrete cards, bandwidth tests show performance close to 1 TB/s. Its behavior is dynamically controlled by software, with caching policies potentially changing on the fly.\n\nThe article also delves into CPU-side memory performance. While the Strix Halo CCDs have higher die-boundary bandwidth for writes compared to desktop counterparts, the impact is minimal due to read-heavy workloads. A single Strix Halo CCD reaches high bandwidth at lower latency than standard GMI-Narrow CCDs, but only after a certain bandwidth load is reached due to LPDDR5X's high baseline latency. The article questions Strix Halo's cross-die latency, finding it higher than desktop systems despite advanced packaging, potentially due to increased latency beyond the die boundary.\n\nFinally, the article examines the challenges of shared memory access between the CPU and GPU. GPU bandwidth load increases CPU memory latency, and Strix Halo may prioritize the GPU under extreme bandwidth demands. In CPU-intensive workloads like Cyberpunk 2077's benchmark, a large gap exists between Strix Halo and desktop systems, highlighting the impact of memory latency. Ultimately, the Strix Halo's CPU cores need excellent cache hitrates to mitigate the memory subsystem's constraints.\n",
    "chinese_title": "猛禽光环的内存子系统：应对iGPU挑战",
    "chinese_summary": "本文分析了AMD Strix Halo APU的内存子系统，重点关注其如何在移动设备中平衡CPU和iGPU需求所面临的挑战。Strix Halo配备了32MB Infinity Cache (MALL)，作为GPU的末级缓存，远大于之前的AMD移动iGPU。虽然Infinity Cache的延迟略高于独立显卡，但带宽测试显示其性能接近1 TB/s。其行为由软件动态控制，缓存策略可能会动态变化。\n\n本文还深入探讨了CPU端的内存性能。虽然Strix Halo CCD的晶片边界写入带宽高于桌面级同类产品，但由于读密集型工作负载，其影响甚微。单个Strix Halo CCD在较低延迟下达到较高带宽，但仅在达到一定带宽负载后才会实现，这是由于LPDDR5X的高基线延迟所致。本文质疑Strix Halo的跨晶片延迟，发现其高于桌面系统，尽管采用了先进的封装，这可能是由于晶片边界之外的延迟增加所致。\n\n最后，本文考察了CPU和GPU之间共享内存访问所面临的挑战。GPU带宽负载会增加CPU内存延迟，并且Strix Halo可能会在极端带宽需求下优先考虑GPU。在CPU密集型工作负载（如Cyberpunk 2077的基准测试）中，Strix Halo与桌面系统之间存在较大差距，突显了内存延迟的影响。最终，Strix Halo的CPU核心需要出色的缓存命中率才能缓解内存子系统的限制。"
  },
  {
    "id": "45970519",
    "title": "Trying out Gemini 3 Pro with audio transcription and a new pelican benchmark",
    "url": "https://simonwillison.net/2025/Nov/18/gemini-3/",
    "summary": "On November 18th, 2025, Google released Gemini 3 Pro. The author, who had preview access, describes it as an upgrade to Gemini 2.5, now competitive with rival models like Claude Sonnet 4.5 and GPT-5.1. Gemini 3 Pro maintains the same knowledge cutoff (January 2025) and accepts 1 million input tokens with 64,000 output tokens, supporting multimodal inputs.\n\nBenchmark results, according to Google, show Gemini 3 Pro scoring slightly higher than Claude Sonnet 4.5 and GPT-5.1 on standard tests. While more expensive than Gemini 2.5 Pro, it's cheaper than Claude Sonnet 4.5.\n\nThe author tested Gemini 3 Pro's multimodal capabilities by analyzing a screenshot of benchmark data, generating accurate alt text and converting it into JSON format.\n\nA larger test involved transcribing a 3-hour 33-minute Half Moon Bay City Council meeting from audio. While the transcription worked, the timestamps were inaccurate. The author also notes that the AI summarized the Spanish instructions from the meeting.\n\nFinally, the author experimented with Gemini 3 Pro's \"thinking level\" using a \"pelican riding a bicycle\" SVG generation prompt. The author upgraded the prompt for a more challenging benchmark, focusing on specific details of a California brown pelican. While all models struggled with the pelican's actual color, Gemini 3 Pro with a high thinking level produced the most accurate image. Examples from GPT-5.1 and Claude Sonnet 4.5 are also provided, highlighting the differences in their outputs.\n",
    "chinese_title": "尝试使用 Gemini 3 Pro 进行音频转录和一个新的 pelican 基准测试",
    "chinese_summary": "2025年11月18日，谷歌发布了Gemini 3 Pro。作者拥有预览权限，称其为Gemini 2.5的升级版，现在可以与Claude Sonnet 4.5和GPT-5.1等竞争模型相媲美。Gemini 3 Pro保持了相同的知识截止日期（2025年1月），接受100万个输入token和64,000个输出token，并支持多模态输入。\n\n根据谷歌的数据，基准测试结果显示，Gemini 3 Pro在标准测试中得分略高于Claude Sonnet 4.5和GPT-5.1。虽然比Gemini 2.5 Pro更贵，但它比Claude Sonnet 4.5便宜。\n\n作者通过分析基准数据的屏幕截图，生成准确的alt文本并将其转换为JSON格式，测试了Gemini 3 Pro的多模态功能。\n\n一项更大的测试涉及将一段3小时33分钟的半月湾市议会会议的音频转录成文字。虽然转录有效，但时间戳不准确。作者还指出，该人工智能总结了会议中的西班牙语指示。\n\n最后，作者使用“鹈鹕骑自行车”的SVG生成提示，测试了Gemini 3 Pro的“思考水平”。作者升级了提示，以进行更具挑战性的基准测试，重点关注加州褐鹈鹕的特定细节。虽然所有模型都在鹈鹕的实际颜色上遇到了困难，但具有高思考水平的Gemini 3 Pro产生了最准确的图像。还提供了GPT-5.1和Claude Sonnet 4.5的示例，突出了它们输出的差异。"
  },
  {
    "id": "45960368",
    "title": "Rebecca Heineman has died",
    "url": "https://www.pcgamer.com/gaming-industry/legendary-game-designer-programmer-space-invaders-champion-and-lgbtq-trailblazer-rebecca-heineman-has-died/",
    "summary": "Rebecca Heineman, a pioneering game developer and the first formally recognized US videogame champion, has died at the age of 62 after being diagnosed with cancer. The news was shared by friends and a final message on her GoFundMe page, which was created to help with treatment costs and will now assist her family with funeral arrangements.\n\nHeineman made a significant impact on the gaming industry, co-founding Interplay in 1983 and contributing to iconic PC games like *Wasteland*, *Fallout*, and *Baldur's Gate*. She was a prominent designer and programmer, notably known for *The Bard's Tale 3: Thief of Fate*. In later years, she gained recognition for her programming work, particularly on ports like the Macintosh versions of *Wolfenstein 3D* and *Baldur's Gate*. Her solo programming of the 3DO *Doom* port is also legendary.\n\nHeineman was a strong advocate for LGBTQ+ inclusion, accessibility, and diversity in tech. She publicly came out as transgender in the 2000s and was married to Jennell Jaquays, another respected figure in the gaming industry, who passed away in 2024. Heineman received Gayming's 2025 Gayming Icon award.\n\nFellow game developers and colleagues have shared condolences and remembrances, highlighting Heineman's brilliance, kindness, and impact on the industry. Heineman requested that donations continue to be made to the GoFundMe to fund her funeral arrangements.\n",
    "chinese_title": "丽贝卡·海涅曼去世",
    "chinese_summary": "先锋游戏开发者、美国首位正式认可的电子游戏冠军丽贝卡·海涅曼因癌症去世，享年62岁。消息由朋友和她在GoFundMe页面上的最后一条消息公布，该页面最初旨在帮助支付治疗费用，现在将协助她的家人处理葬礼事宜。\n\n海涅曼对游戏行业产生了重大影响，于1983年共同创立了Interplay，并为《废土》、《辐射》和《博德之门》等标志性PC游戏做出了贡献。她是一位杰出的设计师和程序员，尤其以《吟游诗人故事3：命运窃贼》而闻名。晚年，她因其编程工作而获得认可，特别是在诸如《德军总部3D》和《博德之门》的Macintosh版本等移植作品上。她独立编程的3DO《毁灭战士》移植版也堪称传奇。\n\n海涅曼是 LGBTQ+ 包容性、可访问性和科技领域多元化的坚定倡导者。她在2000年代公开宣布自己是跨性别者，并与游戏行业另一位受人尊敬的人物珍内尔·雅奎斯结婚，雅奎斯于2024年去世。海涅曼获得了Gayming颁发的2025年Gayming偶像奖。\n\n其他游戏开发者和同事纷纷表达哀悼和怀念之情，强调了海涅曼的才华、善良以及对行业的影响。海涅曼要求继续向 GoFundMe 捐款，以资助她的葬礼事宜。"
  },
  {
    "id": "45962654",
    "title": "How Quake.exe got its TCP/IP stack",
    "url": "https://fabiensanglard.net/quake_chunnel/index.html",
    "summary": "This article details how the game Quake, released in 1996, achieved TCP/IP network support while maintaining compatibility with both DOS and Windows 95 operating systems. Facing a transition from DOS to Windows, id Software created a single executable, `quake.exe`, capable of running on both. This was achieved using the DJGPP DOS extender, which was engineered to work with both DOS and Windows 95 DPMI servers.\n\nFor multiplayer functionality under DOS, Quake used IPX via a TSR (terminate-and-stay-resident program) called PDIPX.EXE. TCP/IP support under DOS was rare and expensive, relying on a commercial TSR.\n\nUnder Windows 95, `quake.exe` ran within a DOS box.  To enable TCP/IP functionality under Windows 95 from DOS Quake, id Software partnered with Mpath Interactive. Mpath provided a technology called \"Chunnel,\" which used a virtual device driver (`GENVXD.VXD`) to create a bridge between the DOS executable and the Windows 95 TCP/IP stack (Winsock). This involved a complex process of marshalling function calls from Quake, passing them through a DPMI client, triggering a software interrupt, and then unmarshalling them in the Windows environment for routing to Winsock. The `q95.bat` script launched Mpath's `qlauncher.exe`, which loaded `quakeudp.dll` (the heart of the Chunnel) and initiated Quake with specific parameters.  Mpath's code remained proprietary, but this solution allowed Quake to utilize TCP/IP networking on Windows 95 while maintaining DOS compatibility.  Later versions of Quake were Win32 exclusive and directly accessed the Winsock API.\n",
    "chinese_title": "Quake.exe 如何获得 TCP/IP 协议栈",
    "chinese_summary": "Quake在DOS和Windows 95下实现TCP/IP网络支持的细节"
  },
  {
    "id": "45969708",
    "title": "Show HN: Guts – convert Golang types to TypeScript",
    "url": "https://github.com/coder/guts",
    "summary": "Guts is a Go library designed to convert Golang types into TypeScript definitions, facilitating consistent type usage across frontend and backend applications. Unlike existing Go-to-TypeScript tools, Guts is intended to be used as a library, offering greater programmatic control and customization over the conversion process.\n\nThe library works by parsing Go packages, traversing the Abstract Syntax Tree (AST) to identify defined types, and then mapping these types to a TypeScript AST. It leverages the official TypeScript compiler (via goja) to ensure generated TypeScript is syntactically correct, semantically valid, and up-to-date with language features.\n\nGuts adopts a minimal conversion approach, allowing developers to further refine the output through mutations. Examples of mutations include converting Go enums to TypeScript string literal types instead of `enum` objects. The tool allows users to preserve comments for improved readability and maintainability.\n\nThe key differentiator of Guts is its programmatic interface, replacing the YAML configuration of command-line tools with code-based configuration. This allows for more dynamic and flexible customization that static generators struggle to support. Examples of how to use the library are provided, showcasing its ease of integration and adaptability.\n",
    "chinese_title": "Show HN: Guts – 将 Golang 类型转换为 TypeScript",
    "chinese_summary": "Guts 是一个 Go 语言库，旨在将 Golang 类型转换为 TypeScript 定义，从而促进前端和后端应用程序之间类型使用的一致性。与现有的 Go 转 TypeScript 工具不同，Guts 旨在作为一个库使用，从而在转换过程中提供更大的程序化控制和自定义。\n\n该库的工作原理是解析 Go 包，遍历抽象语法树 (AST) 以识别定义的类型，然后将这些类型映射到 TypeScript AST。它利用官方 TypeScript 编译器 (通过 goja) 来确保生成的 TypeScript 在语法上正确、语义上有效，并且与语言特性保持同步。\n\nGuts 采用最小转换方法，允许开发人员通过突变进一步完善输出。突变的示例包括将 Go 枚举转换为 TypeScript 字符串字面量类型，而不是 `enum` 对象。该工具允许用户保留注释，以提高可读性和可维护性。\n\nGuts 的主要区别在于其程序化接口，它用基于代码的配置取代了命令行工具的 YAML 配置。这允许更动态和灵活的自定义，这是静态生成器难以支持的。提供了如何使用该库的示例，展示了其易于集成和适应性。"
  },
  {
    "id": "45961481",
    "title": "The surprising benefits of giving up",
    "url": "https://nautil.us/the-surprising-benefits-of-giving-up-1248362/",
    "summary": "Molly Glick's article in Nautilus, \"The Surprising Benefits of Giving Up,\" challenges the conventional wisdom of relentless persistence. The piece highlights research suggesting that adjusting or abandoning unattainable goals can be beneficial for psychological and physical well-being.\n\nA meta-analysis of over 230 studies reveals that \"goal-striving flexibility,\" or the ability to disengage from unproductive goals and re-engage with new ones, is often a more appropriate and beneficial response to challenges. Sticking to impossible goals is linked to increased stress, poorer well-being, and physical health problems.\n\nThe study identified factors influencing the decision to quit, adjust, or pursue goals, including negative feedback, \"action crises,\" and personality traits like optimism. Giving up on goals was linked to reduced stress, anxiety, and depression, while adopting new goals was associated with improved social and physical functioning, as well as a sense of purpose and personal growth.\n\nThe authors acknowledge limitations related to observational data and potential biases. They emphasize the need for further research to determine the optimal timing for rethinking goals, balancing persistence with the need to adjust course.\n",
    "chinese_title": "放弃的意外好处",
    "chinese_summary": "莫莉·格里克在《鹦鹉螺》杂志上发表的文章《放弃的意外好处》挑战了坚持不懈的传统观念。 这篇文章重点介绍了研究，表明调整或放弃无法实现的目标可能有利于心理和身体健康。\n\n一项对230多项研究的荟萃分析显示，“目标追求灵活性”，即从无成效的目标中脱离并重新投入新目标的能力，通常是对挑战更合适、更有益的回应。 坚持不可能实现的目标与压力增加、幸福感下降和身体健康问题有关。\n\n该研究确定了影响放弃、调整或追求目标决定的因素，包括负面反馈、“行动危机”和乐观等性格特征。 放弃目标与压力、焦虑和抑郁的减轻有关，而采纳新目标则与改善的社会和身体功能以及目标感和个人成长有关。\n\n作者承认与观察性数据和潜在偏差相关的局限性。 他们强调需要进一步研究，以确定重新思考目标的最佳时机，在坚持不懈与调整方向的需求之间取得平衡。"
  },
  {
    "id": "45922823",
    "title": "Microsoft-backed Veir is bringing superconductors to data centers",
    "url": "https://techcrunch.com/2025/11/12/microsoft-backed-veir-targets-data-centers-for-its-megawatt-class-superconductors/",
    "summary": "Veir, a Microsoft-backed startup, is adapting its superconducting electrical cables for data centers to address the growing power demands of AI and computing infrastructure. Data center power requirements are rapidly increasing, potentially reaching multi-megawatt racks, which strains existing infrastructure. Veir's technology uses superconducting cables capable of carrying 3 megawatts of low-voltage electricity with zero energy loss, requiring 20 times less space than copper and carrying power five times farther.\n\nSuperconductors need to be cooled to extremely low temperatures, which Veir manages with liquid nitrogen. While the company initially targeted long-distance transmission lines, the slower adoption rate in that sector led them to focus on the faster-moving data center market. They have adapted their technology for the low-voltage needs of data centers.\n\nVeir has built a simulated data center to demonstrate its technology and plans to pilot the cables in data centers next year with a commercial launch expected in 2027. According to Veir's CEO, the AI and data center community is motivated to find solutions and stay ahead due to competitive pressures.\n",
    "chinese_title": "微软支持的Veir公司正将超导体引入数据中心。",
    "chinese_summary": "微软支持的初创公司Veir正在调整其用于数据中心的超导电缆，以应对人工智能和计算基础设施日益增长的电力需求。数据中心的电力需求正在迅速增长，可能达到多兆瓦机架，这给现有基础设施带来了压力。Veir的技术使用超导电缆，能够以零能量损耗传输3兆瓦的低压电力，所需空间比铜缆少20倍，传输距离远五倍。\n\n超导体需要冷却到极低的温度，Veir使用液氮来管理这一过程。虽然该公司最初的目标是长距离输电线路，但由于该领域的采用速度较慢，他们转而专注于发展更快的数据中心市场。他们已经调整了他们的技术以适应数据中心的低压需求。\n\nVeir已经建立了一个模拟数据中心来展示其技术，并计划明年在数据中心试用这些电缆，预计将于2027年进行商业发布。根据Veir的首席执行官表示，由于竞争压力，人工智能和数据中心社区有动力寻找解决方案并保持领先。"
  },
  {
    "id": "45973955",
    "title": "Lucent 7 R/E 5ESS Telephone Switch Rescue (2024)",
    "url": "http://kev009.com/wp/2024/07/Lucent-5ESS-Rescue/",
    "summary": "This article chronicles the author's ambitious project of rescuing a Lucent 7 R/E 5ESS telephone switch from the University of Arizona before its demolition. The author, with the help of his wife, brother, friends, and the University's IT staff, managed to successfully extract the massive switch, which had served the university for approximately 35 years, handling over 20,000 lines and offering ISDN capabilities.\n\nThe switch, consisting of 40 frames, filled two 26' trucks and presented a significant logistical challenge due to its complex internal wiring and cable management system. The author details the switch's architecture, including components like Line Trunk Peripherals, Switching Module Controllers (SMC), Optical Cross Connect Units (OXU), Office Alarm Units (OAU), and the optical packet-switched core called the Communications Module 3 (CM3) or Global Messaging Server 3 (GMS3). The removal process required meticulous work over a five-day period, followed by two days of unloading.\n\nThe next step involves acquiring AC and DC power distribution equipment to power up the system, starting with the Administrative Module (AM), a 3B21D computer running the DMERT/UNIX-RTR operating system. The author plans to \"de-grow\" the disconnected equipment, add back essential components to demonstrate POTS and ISDN functionality, and eventually integrate the switch with other communication and computing equipment. Due to space and power constraints, the system will be reduced in size, resulting in spare parts.\n\nThe author intends to use the salvaged switch as a centerpiece in a future computing and telecommunications museum and welcomes collaboration from anyone interested in working on the project.\n",
    "chinese_title": "朗讯7号 R/E 5ESS电话交换机抢修 (2024)",
    "chinese_summary": "抢救朗讯7 R/E 5ESS电话交换机的纪实：从亚利桑那大学拆迁前夕的拯救行动"
  },
  {
    "id": "45962266",
    "title": "Show HN: A subtly obvious e-paper room air monitor",
    "url": "https://www.nicolin-dora.ch/blog/en-epaper-room-air-monitor-part-1/",
    "summary": "This \"Show HN\" post details the creation of a subtly obvious e-paper room air monitor designed to improve indoor air quality, particularly during colder months when windows are often closed. The author highlights the negative impacts of elevated CO₂ levels and humidity on health and concentration, citing ASHRAE and other research.\n\nThe monitor uses an M5Paper e-ink display, a Sensirion SCD40 sensor (CO₂/temperature/humidity), and an RGB LED for alerts. A Raspberry Pi 4 hosts a dashboard for visualizing air quality trends, and a Telegram bot sends daily summaries to the author's flatmates to encourage proactive air quality management.\n\nThe core idea is to keep the monitor unobtrusive when air quality is good, but make it noticeable (via the LED) when CO₂ or humidity exceeds predefined thresholds. The e-paper display shows current readings and recommendations. The dashboard and Telegram bot provide long-term awareness and motivation for improvement.\n\nThe author plans a second blog post diving into the code, publishing the GitHub repository, and welcomes contributions, including code improvements, 3D case designs, sensor suggestions, and general feedback.\n",
    "chinese_title": "Show HN: 一款巧妙而显眼的电子墨水屏室内空气监测器",
    "chinese_summary": "这篇“Show HN”帖子详细介绍了如何创建一个微妙但显眼的电子墨水屏室内空气质量监测器，旨在改善室内空气质量，尤其是在寒冷月份窗户经常关闭的情况下。作者强调了升高的二氧化碳浓度和湿度对健康和注意力的负面影响，并引用了ASHRAE和其他研究。\n\n该监测器使用M5Paper电子墨水屏、Sensirion SCD40传感器（二氧化碳/温度/湿度）和一个用于警报的RGB LED。 Raspberry Pi 4主机托管一个用于可视化空气质量趋势的仪表板，Telegram机器人每天向作者的室友发送摘要，以鼓励积极的空气质量管理。\n\n核心思想是在空气质量良好时保持监测器的不显眼，但在二氧化碳或湿度超过预定义阈值时使其引人注意（通过LED）。 电子墨水屏显示当前读数和建议。 仪表板和Telegram机器人提供长期的意识和改善的动力。\n\n作者计划发布第二篇博文，深入探讨代码，发布GitHub存储库，并欢迎各种贡献，包括代码改进、3D外壳设计、传感器建议和一般反馈。"
  },
  {
    "id": "45964816",
    "title": "Mathematics and Computation (2019) [pdf]",
    "url": "https://www.math.ias.edu/files/Book-online-Aug0619.pdf",
    "summary": "I am sorry, but I cannot summarize the article. The text that you provided is not directly readable. It appears to be a PDF file's raw content, including encoded image data and object streams. It's a stream of characters, not the actual content of an article. I need the plain text of the article to provide a summary.\n",
    "chinese_title": "数学与计算 (2019) [pdf]",
    "chinese_summary": "很抱歉，我无法总结这篇文章。您提供的文本无法直接阅读。它似乎是PDF文件的原始内容，包括编码的图像数据和对象流。这是一个字符流，而不是文章的实际内容。我需要文章的纯文本才能提供摘要。"
  },
  {
    "id": "45973261",
    "title": "Monotype font licencing shake-down",
    "url": "https://www.insanityworks.org/randomtangent/2025/11/14/monotype-font-licencing-shake-down",
    "summary": "A typography enthusiast, Ameel, recounts his experience with Monotype, who falsely accused his employer of using unlicensed fonts via a LinkedIn inMail shake-down attempt.\n\nMonotype's \"Business Development Representative\" claimed to have detected Monotype font software embedded in the employer's websites/apps without corresponding licenses. Ameel, puzzled because he was unaware of Monotype fonts in use, investigated and found that the employer primarily used the open-source fonts Open Sans, Roboto, Asap, Public Sans, and a custom font (Network Sans). Proxima Nova was used on partner-managed websites, but Monotype doesn't sell licenses for it anymore.\n\nThe Monotype rep's aggressive outreach, messaging multiple employees including those in procurement, mirrored phishing tactics. After being pulled in by procurement due to the potential risk, Ameel discovered that Monotype's claims were based on faulty automated detection software.\n\nThe report incorrectly identified \"Credit Cards\" in the company's apps as a Monotype font. Ameel proved it was actually \"Credit Card\" by K-Type, which has a similar file name to Monotype’s software and it is used to display card number entry fields. Furthermore, while Proxima Nova was used, the design agency managing the website had a valid Adobe license.\n\nAmeel presented his findings to Monotype, but they then tried to claim the company didn’t have a Credit Card license either. Ameel countered, stating they had purchased an Enterprise License directly from K-Type years ago. Since then, Monotype has ceased contact, highlighting the flaws of automated copyright infringement detection and the importance of challenging dubious claims.\n",
    "chinese_title": "Monotype字体授权勒索",
    "chinese_summary": "字体爱好者Ameel讲述了他与Monotype的经历，Monotype通过LinkedIn站内信诈骗式营销，错误指控他的雇主使用了未经授权的字体。\n\nMonotype的“业务拓展代表”声称检测到该雇主的网站/应用程序中嵌入了Monotype字体软件，但没有相应的许可。Ameel感到困惑，因为他不知道正在使用Monotype字体，于是进行了调查，发现该雇主主要使用开源字体Open Sans、Roboto、Asap、Public Sans和一种自定义字体（Network Sans）。合作伙伴管理的网站使用了Proxima Nova，但Monotype已不再出售该字体的许可。\n\nMonotype代表的咄咄逼人的接触方式，向包括采购人员在内的多名员工发送信息，类似于网络钓鱼策略。由于潜在的风险，Ameel被采购部门拉入此事后，发现Monotype的声明是基于有缺陷的自动化检测软件。\n\n该报告错误地将公司应用程序中的“Credit Cards”识别为Monotype字体。Ameel证明它实际上是K-Type的“Credit Card”，该字体与Monotype软件的文件名相似，用于显示卡号输入字段。此外，虽然使用了Proxima Nova，但管理该网站的设计机构拥有有效的Adobe许可证。\n\nAmeel向Monotype提交了他的调查结果，但他们随后试图声称该公司也没有Credit Card的许可证。Ameel反驳说，他们几年前直接从K-Type购买了企业许可证。此后，Monotype停止了联系，凸显了自动化版权侵权检测的缺陷以及质疑可疑声明的重要性。"
  },
  {
    "id": "45966018",
    "title": "Experiment: Making TypeScript immutable-by-default",
    "url": "https://evanhahn.com/typescript-immutability-experiment/",
    "summary": "Evan Hahn attempted to make TypeScript immutable by default, mirroring the behavior of languages like Rust. His goal was to achieve this purely with TypeScript type definitions, without relying on linters or external tools. He successfully made arrays and Records immutable by default, but failed to do so for plain JavaScript objects.\n\nThe experiment involved:\n\n1.  **Obliterating Built-in Libraries:** Using the `noLib` flag in the `tsconfig.json` to prevent TypeScript from using its default type definitions.\n2.  **Creating a Skeleton Standard Library:** Defining basic interfaces for core types like `Array`, `String`, and `Object` in a `lib.d.ts` file.\n3.  **Making Arrays Immutable:** Redefining the `Array` interface with `readonly` property accessors (`readonly [n: number]: T`) to prevent mutation by default, and creating a `MutableArray` interface to allow mutable arrays when needed.\n4.  **Extending to Records:** Similarly, he defined `Record` as immutable by default and created `MutableRecord` for mutable key-value pairs.\n5.  **Failed Attempt with Plain Objects:** He was unable to prevent mutation of plain JavaScript objects using only type definitions.\n\nHahn encourages readers to attempt to solve the problem of making plain objects immutable by default in TypeScript and to share their solutions. He also suggests that lint rules could be used to enforce immutability, but that he was pursuing a \"pure\" type-definition based solution.\n",
    "chinese_title": "实验：让 TypeScript 默认不可变",
    "chinese_summary": "Evan Hahn 尝试让 TypeScript 默认不可变，以模仿 Rust 等语言的行为。他的目标是完全通过 TypeScript 类型定义来实现这一点，而不依赖于 linter 或外部工具。他成功地让数组和 Records 默认不可变，但未能对普通的 JavaScript 对象实现这一点。\n\n该实验包括：\n\n1.  **移除内置库：** 在 `tsconfig.json` 中使用 `noLib` 标志，以阻止 TypeScript 使用其默认类型定义。\n2.  **创建骨架标准库：** 在 `lib.d.ts` 文件中定义核心类型（如 `Array`、`String` 和 `Object`）的基本接口。\n3.  **使数组不可变：** 使用 `readonly` 属性访问器 (`readonly [n: number]: T`) 重新定义 `Array` 接口，以防止默认情况下发生突变，并创建 `MutableArray` 接口以在需要时允许可变数组。\n4.  **扩展到 Records：** 类似地，他将 `Record` 定义为默认不可变，并创建 `MutableRecord` 用于可变的键值对。\n5.  **普通对象尝试失败：** 他无法仅使用类型定义来阻止普通 JavaScript 对象的突变。\n\nHahn 鼓励读者尝试解决使 TypeScript 中普通对象默认不可变的问题，并分享他们的解决方案。他还建议可以使用 lint 规则来强制执行不可变性，但他追求的是一种基于“纯”类型定义的解决方案。"
  },
  {
    "id": "45900425",
    "title": "Show HN: I built a synth for my daughter",
    "url": "https://bitsnpieces.dev/posts/a-synth-for-my-daughter/",
    "summary": "生成摘要时出错",
    "chinese_title": "Show HN: I built a synth for my daughter",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45978813",
    "title": "How do the pros get someone to leave a cult?",
    "url": "https://www.theguardian.com/science/2025/nov/19/how-to-leave-a-cult-experts-intervention",
    "summary": "生成摘要时出错",
    "chinese_title": "How do the pros get someone to leave a cult?",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45930438",
    "title": "Raccoons are showing early signs of domestication",
    "url": "https://www.scientificamerican.com/article/raccoons-are-showing-early-signs-of-domestication/",
    "summary": "生成摘要时出错",
    "chinese_title": "Raccoons are showing early signs of domestication",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45975006",
    "title": "DOE gives Microsoft partner $1B loan to restart Three Mile Island reactor",
    "url": "https://techcrunch.com/2025/11/18/trump-doe-gives-microsoft-partner-1b-loan-to-restart-three-mile-island-reactor/",
    "summary": "生成摘要时出错",
    "chinese_title": "DOE gives Microsoft partner $1B loan to restart Three Mile Island reactor",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45893592",
    "title": "Ditch your mutex, you deserve better",
    "url": "https://chrispenner.ca/posts/mutexes",
    "summary": "生成摘要时出错",
    "chinese_title": "抛弃你的互斥锁，你值得拥有更好的。",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45968059",
    "title": "How long can it take to become a US citizen?",
    "url": "https://usafacts.org/articles/how-long-can-it-take-to-become-a-us-citizen/",
    "summary": "生成摘要时出错",
    "chinese_title": "How long can it take to become a US citizen?",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45929099",
    "title": "I've wanted to play that 'Killer Shark' arcade game briefly seen in 'Jaws'",
    "url": "https://www.remindmagazine.com/article/15694/jaws-arcade-video-game-killer-shark-atari-sega-electromechanical/",
    "summary": "生成摘要时出错",
    "chinese_title": "I've wanted to play that 'Killer Shark' arcade game briefly seen in 'Jaws'",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45919926",
    "title": "When 1+1+1 Equals 1",
    "url": "https://mathenchant.wordpress.com/2024/12/19/when-111-equals-1/",
    "summary": "生成摘要时出错",
    "chinese_title": "When 1+1+1 Equals 1",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45976670",
    "title": "A down detector for down detector's down detector",
    "url": "https://downdetectorsdowndetectorsdowndetector.com/",
    "summary": "生成摘要时出错",
    "chinese_title": "A down detector for down detector's down detector",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45960852",
    "title": "Unofficial \"Tier 4\" Rust Target for older Windows versions",
    "url": "https://github.com/rust9x/rust",
    "summary": "生成摘要时出错",
    "chinese_title": "Unofficial \"Tier 4\" Rust Target for older Windows versions",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45976693",
    "title": "Free interactive tool that shows you how PCIe lanes work on motherboards",
    "url": "https://mobomaps.com",
    "summary": "生成摘要时出错",
    "chinese_title": "Free interactive tool that shows you how PCIe lanes work on motherboards",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45959780",
    "title": "Show HN: Parqeye – A CLI tool to visualize and inspect Parquet files",
    "url": "https://github.com/kaushiksrini/parqeye",
    "summary": "生成摘要时出错",
    "chinese_title": "Show HN: Parqeye – A CLI tool to visualize and inspect Parquet files",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45914929",
    "title": "When Reverse Proxies Surprise You: Hard Lessons from Operating at Scale",
    "url": "https://www.infoq.com/articles/scaling-reverse-proxies/",
    "summary": "生成摘要时出错",
    "chinese_title": "When Reverse Proxies Surprise You: Hard Lessons from Operating at Scale",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45955900",
    "title": "Azure hit by 15 Tbps DDoS attack using 500k IP addresses",
    "url": "https://www.bleepingcomputer.com/news/microsoft/microsoft-aisuru-botnet-used-500-000-ips-in-15-tbps-azure-ddos-attack/",
    "summary": "生成摘要时出错",
    "chinese_title": "Azure hit by 15 Tbps DDoS attack using 500k IP addresses",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45965060",
    "title": "Do not put your site behind Cloudflare if you don't need to",
    "url": "https://huijzer.xyz/posts/123/do-not-put-your-site-behind-cloudflare-if-you-dont",
    "summary": "生成摘要时出错",
    "chinese_title": "Do not put your site behind Cloudflare if you don't need to",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45965664",
    "title": "Ruby 4.0.0 Preview2",
    "url": "https://www.ruby-lang.org/en/news/2025/11/17/ruby-4-0-0-preview2-released/",
    "summary": "生成摘要时出错",
    "chinese_title": "Ruby 4.0.0 Preview2",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45955565",
    "title": "How when AWS was down, we were not",
    "url": "https://authress.io/knowledge-base/articles/2025/11/01/how-we-prevent-aws-downtime-impacts",
    "summary": "生成摘要时出错",
    "chinese_title": "How when AWS was down, we were not",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45953977",
    "title": "Show HN: ESPectre – Motion detection based on Wi-Fi spectre analysis",
    "url": "https://github.com/francescopace/espectre",
    "summary": "生成摘要时出错",
    "chinese_title": "Show HN: ESPectre – Motion detection based on Wi-Fi spectre analysis",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45976832",
    "title": "Exploring the Limits of Large Language Models as Quant Traders",
    "url": "https://nof1.ai/blog/TechPost1",
    "summary": "生成摘要时出错",
    "chinese_title": "Exploring the Limits of Large Language Models as Quant Traders",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45908365",
    "title": "Silverbullet: Personal productivity platform built with Markdown and Lua",
    "url": "https://github.com/silverbulletmd/silverbullet",
    "summary": "生成摘要时出错",
    "chinese_title": "Silverbullet: Personal productivity platform built with Markdown and Lua",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45950408",
    "title": "People are using iPad OS features on their iPhones",
    "url": "https://idevicecentral.com/ios-customization/how-to-enable-ipad-features-like-multitasking-stage-manager-on-iphone-via-mobilegestalt/",
    "summary": "生成摘要时出错",
    "chinese_title": "People are using iPad OS features on their iPhones",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45954140",
    "title": "Aldous Huxley predicts Adderall and champions alternative therapies",
    "url": "https://angadh.com/inkhaven-7",
    "summary": "生成摘要时出错",
    "chinese_title": "Aldous Huxley predicts Adderall and champions alternative therapies",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45916094",
    "title": "How many video games include a marriage proposal? At least one",
    "url": "https://32bits.substack.com/p/under-the-microscope-ncaa-basketball",
    "summary": "生成摘要时出错",
    "chinese_title": "How many video games include a marriage proposal? At least one",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45959795",
    "title": "Windows 11 adds AI agent that runs in background with access to personal folders",
    "url": "https://www.windowslatest.com/2025/11/18/windows-11-to-add-an-ai-agent-that-runs-in-background-with-access-to-personal-folders-warns-of-security-risk/",
    "summary": "生成摘要时出错",
    "chinese_title": "Windows 11 adds AI agent that runs in background with access to personal folders",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45937302",
    "title": "My stages of learning to be a socially normal person",
    "url": "https://sashachapin.substack.com/p/my-six-stages-of-learning-to-be-a",
    "summary": "生成摘要时出错",
    "chinese_title": "My stages of learning to be a socially normal person",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45904730",
    "title": "Looking for Hidden Gems in Scientific Literature",
    "url": "https://elicit.com/blog/literature-based-discovery",
    "summary": "生成摘要时出错",
    "chinese_title": "Looking for Hidden Gems in Scientific Literature",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45977782",
    "title": "Quantum physicists have shrunk and \"de-censored\" DeepSeek R1",
    "url": "https://www.technologyreview.com/2025/11/19/1128119/quantum-physicists-compress-and-deconsor-deepseekr1/",
    "summary": "生成摘要时出错",
    "chinese_title": "Quantum physicists have shrunk and \"de-censored\" DeepSeek R1",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45955889",
    "title": "A new book about the origins of Effective Altruism",
    "url": "https://newrepublic.com/article/202433/happened-effective-altruism",
    "summary": "生成摘要时出错",
    "chinese_title": "A new book about the origins of Effective Altruism",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45914435",
    "title": "Beauty in/of mathematics: tessellations and their formulas",
    "url": "https://www.tandfonline.com/doi/full/10.1080/00036811.2025.2510472",
    "summary": "生成摘要时出错",
    "chinese_title": "Beauty in/of mathematics: tessellations and their formulas",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45931273",
    "title": "Better pre-commit, re-engineered in Rust",
    "url": "https://prek.j178.dev/",
    "summary": "生成摘要时出错",
    "chinese_title": "Better pre-commit, re-engineered in Rust",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45963592",
    "title": "A 'small' vanilla Kubernetes install on NixOS",
    "url": "https://stephank.nl/p/2025-11-17-a-small-vanilla-kubernetes-install-on-nixos.html",
    "summary": "生成摘要时出错",
    "chinese_title": "A 'small' vanilla Kubernetes install on NixOS",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45938517",
    "title": "Show HN: Continuous Claude – run Claude Code in a loop",
    "url": "https://github.com/AnandChowdhary/continuous-claude",
    "summary": "生成摘要时出错",
    "chinese_title": "Show HN: Continuous Claude – run Claude Code in a loop",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45953883",
    "title": "Jeff Bezos creates A.I. startup where he will be co-chief executive",
    "url": "https://www.nytimes.com/2025/11/17/technology/bezos-project-prometheus.html",
    "summary": "生成摘要时出错",
    "chinese_title": "Jeff Bezos creates A.I. startup where he will be co-chief executive",
    "chinese_summary": "生成摘要时出错"
  }
]