[
  {
    "id": "45993296",
    "title": "Nano Banana Pro",
    "url": "https://blog.google/technology/ai/nano-banana-pro/",
    "summary": "Google DeepMind has unveiled Nano Banana Pro, a new state-of-the-art image generation and editing model built on the Gemini 3 Pro. Nano Banana Pro empowers users to visualize ideas, create infographics, and turn notes into diagrams with ease, leveraging Gemini's reasoning and real-world knowledge.\n\nKey features include generating accurate visuals with legible text in multiple languages for mockups, posters, and international content. It enables the creation of high-fidelity visuals with consistent branding, advanced creative controls, and up to 4K resolution. Users can also blend up to 14 images while maintaining consistency of up to 5 people.\n\nNano Banana Pro will be available across various Google products. It is rolling out in the Gemini app, Google Ads, Workspace (Google Slides and Vids), the Gemini API, Google AI Studio, Google Antigravity, and Vertex AI, with varying levels of access and features for different user tiers (free, Pro, Ultra). It will also be available to Google AI Ultra subscribers in Flow.\n\nGoogle emphasizes transparency by embedding SynthID digital watermarks in all AI-generated images. Users can verify if an image was generated by Google AI by uploading it into the Gemini app. A visible watermark (Gemini sparkle) will be used for free and Google AI Pro tier users, while it will be removed for Google AI Ultra subscribers and within the Google AI Studio developer tool.\n",
    "chinese_title": "纳米香蕉 Pro",
    "chinese_summary": "谷歌DeepMind发布Nano Banana Pro：基于Gemini 3 Pro的新一代图像生成和编辑模型。Nano Banana Pro利用Gemini的推理能力和真实世界知识，让用户轻松可视化想法、创建信息图表以及将笔记转化为图表。\n\n主要功能包括为模型、海报和国际内容生成具有清晰文字和多种语言的精准视觉效果。它能够创建具有一致品牌、高级创意控制和高达4K分辨率的高保真视觉效果。用户还可以混合多达14张图像，同时保持多达5个人的形象一致性。\n\nNano Banana Pro将在各种谷歌产品中提供。它正在Gemini应用程序、Google Ads、Workspace（Google Slides和Vids）、Gemini API、Google AI Studio、Google Antigravity和Vertex AI中推出，针对不同的用户层级（免费、Pro、Ultra）提供不同级别的访问权限和功能。它也将向Flow中的Google AI Ultra订阅者开放。\n\n谷歌强调透明度，通过在所有AI生成的图像中嵌入SynthID数字水印。用户可以通过将图像上传到Gemini应用程序来验证图像是否由Google AI生成。免费和Google AI Pro层级的用户将使用可见的水印（Gemini闪烁），而Google AI Ultra订阅者和Google AI Studio开发者工具中的用户将移除水印。"
  },
  {
    "id": "45991853",
    "title": "Red Alert 2 in web browser",
    "url": "https://chronodivide.com/",
    "summary": "Red Alert 2: Chrono Divide is a fan-made project recreating the classic Red Alert 2 RTS game in a web browser, eliminating the need for plugins or installations. Originally an experiment, the project aims for feature parity with the original game. A playable beta version is available, boasting multiplayer support and original maps.\n\nThe game runs cross-platform on any device with a modern web browser (Chrome, Edge, Safari preferred, Firefox less performant). It utilizes a client-server model for improved connectivity, offering modern controls and replay functionality. A key feature is its modding-friendly design, allowing easy installation and compatibility with existing Red Alert 2 mods.\n\nThe website details minimum/recommended PC specifications, emphasizing the need for a 64-bit operating system, at least 4GB of RAM, and a capable GPU. The developers encourage users to join their Discord server for community discussion and updates. The project is sustained by donations, which help cover infrastructure costs and support ongoing development. The site concludes with a link to play the beta.\n",
    "chinese_title": "网页版红色警戒2",
    "chinese_summary": "红色警戒2：时空裂痕是一个粉丝制作的项目，旨在网页浏览器中重现经典RTS游戏红色警戒2，无需插件或安装。该项目最初是一个实验，目标是与原版游戏的功能对等。目前已有一个可玩的测试版本，支持多人游戏和原版地图。\n\n该游戏可在任何装有现代网络浏览器的设备上跨平台运行（首选Chrome、Edge、Safari，Firefox性能稍逊）。它采用客户端-服务器模型以提高连接性，提供现代化的控制和回放功能。一个关键特性是其便于模组修改的设计，可轻松安装并兼容现有的红色警戒2模组。\n\n该网站详细说明了最低/推荐的电脑配置，强调需要64位操作系统、至少4GB内存和一个性能良好的GPU。开发者鼓励用户加入他们的Discord服务器进行社区讨论和获取更新。该项目由捐款维持，以帮助支付基础设施成本和支持持续开发。该网站最后提供了一个测试版游戏链接。"
  },
  {
    "id": "45993943",
    "title": "The Banished Bottom of the Housing Market",
    "url": "https://www.ryanpuzycki.com/p/the-banished-bottom-of-the-housing",
    "summary": "Ryan Puzycki's article \"The Banished Bottom of the Housing Market\" argues that the disappearance of Single-Room Occupancy (SRO) units, the cheapest form of housing, significantly contributes to modern homelessness. Once a vibrant and affordable option provided by institutions like the YMCA and various residential hotels, SROs offered flexibility, independence, and affordability at scale for low-income individuals.\n\nThe article details how SROs were intentionally destroyed through a combination of factors. During the Progressive Era, reformers stigmatized hotel life, viewing it as morally corrupt and blaming it for societal ills. This led to the implementation of building and health codes, exclusionary zoning, and urban renewal projects that targeted and eliminated SROs. These policies effectively erased the \"banished bottom\" of the housing market.\n\nIndustrial job shifts, highway construction, and urban development further accelerated the decline. Official statistics failed to recognize SROs as permanent housing, allowing their demolition without accounting for displacement. By the mid-20th century, millions of SRO rooms had vanished.\n\nPuzycki contends that the current homelessness crisis is a direct consequence of this destruction. He highlights the need to re-legalize shared housing and suggests converting vacant office spaces into affordable co-living units as a viable solution. While acknowledging the need for subsidies, he argues that this approach can offer a quicker and more cost-effective way to address the shortage of deeply affordable housing, providing a crucial rung on the housing ladder for the most vulnerable populations.\n",
    "chinese_title": "被遗弃的楼市底部",
    "chinese_summary": "瑞恩·普日茨基的文章《被驱逐的住房市场底层》认为，单间房（SRO）的消失——最廉价的住房形式——是造成现代无家可归现象的重要原因。单间房曾经是 YMCA 和各种住宅酒店等机构提供的充满活力且负担得起的选择，为低收入人群提供了大规模的灵活性、独立性和可负担性。\n\n文章详细描述了单间房是如何通过多种因素的共同作用而被故意摧毁的。在进步时代，改革者们污名化酒店生活，认为它在道德上是腐败的，并将其归咎于社会弊病。这导致了建筑和卫生法规、排斥性分区以及城市更新项目的实施，这些项目针对并消除了单间房。这些政策有效地抹去了住房市场的“被驱逐底层”。\n\n工业岗位转移、高速公路建设和城市发展进一步加速了这种衰落。官方统计数据未能将单间房视为永久性住房，从而允许在不考虑人口流离失所的情况下拆除它们。到 20 世纪中叶，数百万个单间房已经消失。\n\n普日茨基认为，当前的无家可归危机是这种破坏的直接后果。他强调需要重新将合租住房合法化，并建议将空置的办公空间改造成经济适用型的合住单元，作为一种可行的解决方案。在承认需要补贴的同时，他认为这种方法可以提供一种更快、更具成本效益的方式来解决深度经济适用房的短缺问题，为最脆弱的人群提供住房阶梯上的关键一环。"
  },
  {
    "id": "45990934",
    "title": "Interactive World History Atlas Since 3000 BC",
    "url": "http://geacron.com/home-en/",
    "summary": "This article introduces an interactive world history atlas spanning from 3000 BC to the present day. Its core offering is a collection of world history maps and timelines, visually representing kingdoms, battles, and expeditions throughout history. The atlas covers a wide range of historical aspects, including political, military, artistic, scientific, literary, religious, and philosophical developments, allowing for comparative historical analysis. The maps are based on a vector database, suggesting a high level of detail and interactivity. Essentially, this resource provides a dynamic and comprehensive visual exploration of world history across millennia.\n",
    "chinese_title": "公元前3000年至今互动世界历史地图集",
    "chinese_summary": "互动世界历史地图集 (公元前3000年至今): 该地图集的核心内容是一系列世界历史地图和时间轴，以可视化的方式呈现历史上各王国、战役和远征。它涵盖了政治、军事、艺术、科学、文学、宗教和哲学等广泛的历史层面，从而实现比较历史分析。地图基于矢量数据库，表明具有高度的细节和互动性。本质上，该资源提供了对跨越数千年的世界历史的动态和全面的视觉探索。"
  },
  {
    "id": "45992829",
    "title": "Firefox 147 Will Support the XDG Base Directory Specification",
    "url": "https://www.phoronix.com/news/Firefox-147-XDG-Base-Directory",
    "summary": "Firefox 147 will finally support the XDG Base Directory Specification, resolving a 21-year-old bug report. This means Firefox will adhere to the standard Linux convention of placing application data, configuration files, and cached assets in their designated XDG directories (e.g., `~/.config` and `~/.local/share`) instead of solely under the `~/.mozilla` directory. The support for this specification and associated commits was merged recently, closing the long-open bug. This change will make Firefox more consistent with other Linux applications in terms of file organization.\n",
    "chinese_title": "Firefox 147 将支持 XDG 基本目录规范",
    "chinese_summary": "Firefox 147将支持XDG基本目录规范，修复一个存在21年的漏洞。这意味着Firefox将遵循标准的Linux约定，把应用程序数据、配置文件和缓存资源放置在指定的XDG目录中（例如，`~/.config` 和 `~/.local/share`），而不是仅仅放在 `~/.mozilla` 目录下。对该规范的支持和相关提交已于近日合并，关闭了这个长期存在的漏洞。此项更改将使Firefox在文件组织方面与Linux下的其他应用程序更加一致。"
  },
  {
    "id": "45993214",
    "title": "Freer Monads, More Extensible Effects [pdf]",
    "url": "https://okmij.org/ftp/Haskell/extensible/more.pdf",
    "summary": "This document, titled \"Freer Monads, More Extensible Effects,\" appears to be a technical paper or article related to functional programming, specifically dealing with the concepts of Freer Monads and extensible effects.\n\nBased on the content (extracted from the PDF data), the article seems to explore techniques for managing side effects in a purely functional manner, enhancing code modularity and extensibility. It is likely discussing how Freer Monads provide a way to represent effects as data, decoupling the definition of effects from their interpretation. This allows programmers to define custom effects and combine them flexibly. The term \"extensible effects\" suggests that the paper focuses on how these effect systems can be easily extended with new effects without modifying existing code.\n\nThe article probably delves into the practical implications of these techniques, potentially showcasing examples of how Freer Monads can be used to build more modular and maintainable functional programs. It might explore the performance trade-offs associated with this approach and compare it to other effect management techniques like monad transformers or algebraic effects.\n\nBecause the extracted content consists of binary data, it is hard to create a precise summarization. However, from the title and the few recognizable words and phrases, it can be assumed to be a technical exploration of functional programming concepts around effect management and code extensibility, potentially aiming to present a more flexible and powerful approach to effect handling compared to traditional methods.\n",
    "chinese_title": "更自由的Monad，更可扩展的效应 [pdf]",
    "chinese_summary": "本文档，标题为“自由Monad，更具扩展性的效果”，似乎是一篇关于函数式编程的技术论文或文章，特别是涉及自由Monad和可扩展效果的概念。\n\n根据内容（从PDF数据中提取），该文章似乎探讨了以纯函数式方式管理副作用的技术，从而增强代码的模块化和可扩展性。它可能讨论了自由Monad如何将效果表示为数据，将效果的定义与其解释分离。这允许程序员定义自定义效果并灵活地组合它们。“可扩展效果”一词表明该论文侧重于如何轻松地用新的效果扩展这些效果系统，而无需修改现有代码。\n\n该文章可能深入探讨了这些技术的实际意义，可能会展示自由Monad如何用于构建更模块化和可维护的函数式程序的示例。它可能会探讨与此方法相关的性能权衡，并将其与其他效果管理技术（如Monad转换器或代数效果）进行比较。\n\n由于提取的内容由二进制数据组成，因此很难创建精确的摘要。但是，从标题和少数可识别的单词和短语来看，可以假定它是一项对围绕效果管理和代码可扩展性的函数式编程概念的技术探索，可能旨在呈现一种比传统方法更灵活，更强大的效果处理方法。"
  },
  {
    "id": "45994854",
    "title": "Android and iPhone users can now share files, starting with the Pixel 10 family",
    "url": "https://blog.google/products/android/quick-share-airdrop/",
    "summary": "Google is introducing a new feature that allows Android's Quick Share to work with Apple's AirDrop, enabling easier file sharing between Android and iPhone devices. This functionality is initially rolling out to the Pixel 10 family of devices. The initiative aims to simplify file sharing regardless of the device's operating system. Google emphasizes the security aspect, highlighting that the file transfer method includes strong security measures tested by independent experts. This move builds upon Google's efforts to improve compatibility between operating systems, such as their work on RCS and unknown tracker alerts. The company plans to improve and expand this feature to more Android devices in the future. A video showcasing the new feature on the Pixel 10 Pro is available.\n",
    "chinese_title": "Android和iPhone用户现在可以共享文件了，从Pixel 10系列开始。",
    "chinese_summary": "谷歌推出新功能，Android“快速分享”将与Apple“隔空投送”兼容，简化Android和iPhone设备之间的文件共享。此功能最初将在Pixel 10系列设备上推出。该计划旨在简化文件共享，无论设备操作系统如何。谷歌强调安全性，指出文件传输方法包含经过独立专家测试的强大安全措施。此举建立在谷歌改善操作系统兼容性的努力之上，例如他们在RCS和未知追踪器警报方面的工作。该公司计划在未来改进和扩展此功能到更多Android设备。Pixel 10 Pro上的新功能演示视频已发布。"
  },
  {
    "id": "45934795",
    "title": "Theft of the Weeping Woman from the National Gallery of Victoria",
    "url": "https://en.wikipedia.org/wiki/Theft_of_The_Weeping_Woman_from_the_National_Gallery_of_Victoria",
    "summary": "In 1986, Pablo Picasso's \"The Weeping Woman,\" owned by the National Gallery of Victoria in Melbourne, was stolen by a group calling themselves the \"Australian Cultural Terrorists.\" This painting, part of a series inspired by Picasso's \"Guernica,\" had been purchased for a then-record A$1.6 million. The thieves demanded a 10% increase in arts funding over three years and the establishment of an art prize, \"The Picasso Ransom.\" Their demands were accompanied by insulting letters to the Arts Minister, Race Mathews.\n\nThe Victorian government refused to negotiate, offering a A$50,000 reward instead. After an anonymous tip, the painting was found undamaged in a locker at Spencer Street railway station on August 19, 1986. The thieves included a third letter stating their aim was to highlight the plight of artists who lack the means to influence the government. The case was closed in 1989 without any arrests.\n\nThe theft became a significant event in Australian art history, inspiring a film (\"A Kink in the Picasso\"), a documentary (\"The Picasso Ransom\"), and several novels, including Anson Cameron's \"Stealing Picasso.\" The theft has been described as Australia's greatest unsolved art heist. Despite the passage of time, \"The Weeping Woman\" remains a popular and valuable work in the National Gallery of Victoria's collection, valued at A$100 million in 2016.\n",
    "chinese_title": "维多利亚国家美术馆《哭泣的女人》失窃案",
    "chinese_summary": "1986年，墨尔本维多利亚国家美术馆收藏的巴勃罗·毕加索的《哭泣的女人》被一个自称“澳大利亚文化恐怖分子”的团体盗走。这幅画作是受毕加索《格尔尼卡》启发的一系列作品之一，当时以创纪录的160万澳元购得。盗贼要求在三年内将艺术资金增加10%，并设立一个名为“毕加索赎金”的艺术奖。与此同时，他们还向艺术部长雷斯·马修斯发出了侮辱性的信件。\n\n维多利亚州政府拒绝谈判，转而悬赏5万澳元。在收到一封匿名举报信后，这幅画于1986年8月19日在斯宾塞街火车站的一个储物柜里被完好无损地找到。盗贼还附上第三封信，声称他们的目的是为了引起人们对缺乏影响政府手段的艺术家的困境的关注。此案于1989年结案，无人被捕。\n\n这起盗窃案成为澳大利亚艺术史上的一个重大事件，激发了一部电影（《毕加索的小插曲》）、一部纪录片（《毕加索赎金》）和几部小说，包括安森·卡梅伦的《偷窃毕加索》。这起盗窃案被描述为澳大利亚最伟大的未破艺术品劫案。尽管时过境迁，《哭泣的女人》仍然是维多利亚国家美术馆收藏中一件受欢迎且有价值的作品，2016年估值为1亿澳元。"
  },
  {
    "id": "45951275",
    "title": "Android/Linux Dual Boot",
    "url": "https://wiki.postmarketos.org/wiki/Dual_Booting/WiP",
    "summary": "This article from the postmarketOS Wiki outlines various methods for dual-booting Android and postmarketOS (pmOS) on Android devices. It covers booting methods and storage options, requiring `pmbootstrap` for many approaches.\n\n**Booting Methods:**\n\n*   **Computer Boot:** Simplest, uses `pmbootstrap flasher boot` in fastboot mode, doesn't modify the phone if used with an SD card.\n*   **Recovery Partition:** Overwrites Android recovery, flashing the pmOS kernel (`boot.img` via `fastboot flash recovery`) to the recovery partition. Requires a method to store pmOS, like Stowaway.\n*   **A/B Slots:** Flashes pmOS to the system partition of the inactive slot (A or B). Slots can be switched using `fastboot` or Android apps like Switch My Slot and BootControl. `qbootctl` is used in pmOS to switch back.\n*   **U-Boot/lk2nd/lk1st:** Uses device's bootloader capabilities (U-Boot or lk2nd) to select the OS to boot.\n*   **kexec:** Potentially works if supported by either Android or pmOS.\n\n**Storage Options:**\n\n*   **Stowaway:** Stores pmOS files in a folder (`.stowaway/pmos/`) within an existing partition (typically userdata), useful when modifying partitions is risky. It requires a preparation script and unpacking the pmOS root filesystem via tar.\n*   **SD Card:** Flashes the pmOS file system directly to an SD card for use as the pmOS root.\n*   **Custom Partition:** Creates dedicated partitions for pmOS. Requires shrinking the userdata partition first. Two schemes exist: \"Subpartitions\" requiring partition name with \"system\" prefix; or \"Use the whole storage device\" requiring pmOS_boot and pmOS_root labels on the filesystem.\n\nThe article also touches on the dangers of modifying partitions and emphasizes caution when attempting custom partitioning. It mentions resources for further information and dual booting on specific devices.\n",
    "chinese_title": "安卓/Linux双启动",
    "chinese_summary": "这篇来自postmarketOS Wiki的文章概述了在Android设备上双启动Android和postmarketOS (pmOS) 的各种方法。它涵盖了启动方法和存储选项，许多方法需要使用 `pmbootstrap`。\n\n**启动方法：**\n\n*   **电脑启动：** 最简单，在fastboot模式下使用 `pmbootstrap flasher boot`，如果与SD卡一起使用，则不会修改手机。\n*   **Recovery分区：** 覆盖Android Recovery，将pmOS内核（通过 `fastboot flash recovery` 刷入的 `boot.img`）刷入Recovery分区。需要一种存储pmOS的方法，例如Stowaway。\n*   **A/B槽位：** 将pmOS刷入非活跃槽位（A或B）的系统分区。可以使用 `fastboot` 或Android应用程序（如Switch My Slot和BootControl）切换槽位。`qbootctl` 用于在pmOS中切换回来。\n*   **U-Boot/lk2nd/lk1st：** 使用设备的引导加载程序功能（U-Boot或lk2nd）来选择要启动的操作系统。\n*   **kexec：** 如果Android或pmOS支持，则可能有效。\n\n**存储选项：**\n\n*   **Stowaway：** 将pmOS文件存储在现有分区（通常是userdata）中的一个文件夹（`.stowaway/pmos/`）中，在修改分区有风险时很有用。它需要一个准备脚本，并通过tar解压pmOS根文件系统。\n*   **SD卡：** 将pmOS文件系统直接刷入SD卡，用作pmOS根目录。\n*   **自定义分区：** 为pmOS创建专用分区。需要先缩小userdata分区。存在两种方案：\"子分区\"需要带有 \"system\" 前缀的分区名称；或者\"使用整个存储设备\"需要在文件系统上使用 pmOS_boot 和 pmOS_root 标签。\n\n该文章还提到了修改分区的危险，并强调尝试自定义分区时要谨慎。它提到了更多信息的资源以及在特定设备上双启动的方法。"
  },
  {
    "id": "45991787",
    "title": "40 years ago, Calvin and Hobbes' burst onto the page",
    "url": "https://www.npr.org/2025/11/18/nx-s1-5564064/calvin-and-hobbes-bill-watterson-40-years-comic-strip-lee-salem",
    "summary": "This article commemorates the 40th anniversary of the debut of the comic strip \"Calvin and Hobbes\" on November 18, 1985. It highlights the unique appeal of the strip, focusing on the imaginative adventures of 6-year-old Calvin and his tiger companion, Hobbes, who is real to Calvin but appears as a stuffed animal to others.\n\nThe article features excerpts from a 2005 interview with Lee Salem, the editor of \"Calvin and Hobbes.\" Salem emphasizes the strip's freshness, humor, and strong art, noting how Calvin embodied the childhood experience of dealing with the adult world. He shares a favorite strip example showcasing Calvin's humorous take on learning from television. Salem views Hobbes as Calvin's alter ego, providing commentary and balance. He explains that the reality of Hobbes is open to interpretation, but crucial to Calvin's world.\n\nThe article also touches on the reasons behind the strip's creator, Bill Watterson's, decision to end \"Calvin and Hobbes\" in 1995, citing his desire to explore different artistic avenues beyond the constraints of the comic strip format. Despite the strip's relatively short run of ten years, it left a lasting impact due to Watterson's ability to blend silliness, fantasy, and profound themes.\n",
    "chinese_title": "40年前，《卡尔文与霍布斯》横空出世。",
    "chinese_summary": "本文纪念漫画《卡尔文与霍布斯》于1985年11月18日首次亮相四十周年。文章着重介绍了这部漫画的独特魅力，关注了六岁男孩卡尔文和他老虎伙伴霍布斯的奇妙冒险。霍布斯对卡尔文来说是真实的，但在其他人看来只是一个毛绒玩具。\n\n文章节选了2005年对《卡尔文与霍布斯》的编辑李·塞勒姆的采访。塞勒姆强调了这部漫画的新鲜感、幽默感和出色的艺术性，并指出卡尔文如何体现了儿童时期与成人世界打交道的经历。他分享了一个他最喜欢的漫画片段，展示了卡尔文对从电视中学习的幽默看法。塞勒姆认为霍布斯是卡尔文的另一个自我，提供了评论和平衡。他解释说，霍布斯的真实性是可以解释的，但对卡尔文的世界至关重要。\n\n文章还涉及了这部漫画的创作者比尔·沃特森在1995年决定结束《卡尔文与霍布斯》的原因，引用了他希望探索漫画形式之外的不同艺术道路的愿望。尽管这部漫画的连载时间相对较短，只有十年，但由于沃特森融合了愚蠢、幻想和深刻主题的能力，它留下了持久的影响。"
  },
  {
    "id": "45912704",
    "title": "IBM Delivers New Quantum Package",
    "url": "https://newsroom.ibm.com/2025-11-12-ibm-delivers-new-quantum-processors,-software,-and-algorithm-breakthroughs-on-path-to-advantage-and-fault-tolerance",
    "summary": "In a press release from November 12, 2025, IBM announced significant advancements in its quantum computing program, targeting quantum advantage by the end of 2026 and fault-tolerant quantum computing by 2029.\n\nKey highlights include the unveiling of the IBM Quantum Nighthawk processor, designed for quantum advantage with 120 qubits, increased connectivity, and the ability to execute more complex circuits. IBM anticipates Nighthawk-based systems to support an increasing number of two-qubit gates in the coming years. The company is also contributing to a community-led quantum advantage tracker to validate quantum advantage claims alongside Algorithmiq, the Flatiron Institute, and BlueQubit.\n\nIBM is also advancing Qiskit, its quantum software stack, to enhance accuracy and reduce the cost of extracting results. They are also improving the usability of Qiskit for scientific computing.\n\nOn the path to fault-tolerant computing, IBM announced IBM Quantum Loon, an experimental processor demonstrating key components needed for this goal, including long-range qubit connections and qubit reset technologies. They have also achieved efficient quantum error correction decoding ahead of schedule.\n\nTo accelerate quantum wafer development, IBM is scaling fabrication to a 300mm facility. This transition has already doubled research and development speed, increased chip complexity tenfold, and enabled parallel research designs.\n",
    "chinese_title": "IBM 发布全新量子软件包",
    "chinese_summary": "在2025年11月12日的新闻稿中，IBM宣布其量子计算项目取得重大进展，目标是在2026年底实现量子优势，并在2029年实现容错量子计算。\n\n主要亮点包括推出IBM Quantum Nighthawk处理器，该处理器专为量子优势而设计，具有120个量子比特、更高的连接性和执行更复杂电路的能力。IBM预计基于Nighthawk的系统将在未来几年支持越来越多的双量子比特门。该公司还在与Algorithmiq、Flatiron Institute和BlueQubit合作，为社区主导的量子优势跟踪器做出贡献，以验证量子优势声明。\n\nIBM还在推进其量子软件堆栈Qiskit，以提高准确性并降低提取结果的成本。他们还在提高Qiskit在科学计算中的可用性。\n\n在通往容错计算的道路上，IBM发布了IBM Quantum Loon，这是一个实验性处理器，展示了实现该目标所需的关键组件，包括远程量子比特连接和量子比特重置技术。他们还提前实现了高效的量子纠错解码。\n\n为了加速量子晶圆的开发，IBM正在将制造规模扩大到300毫米的工厂。这一转变已经使研发速度提高了一倍，芯片复杂度提高了十倍，并实现了并行研究设计。"
  },
  {
    "id": "45991738",
    "title": "Adversarial Poetry as a Universal Single-Turn Jailbreak Mechanism in LLMs",
    "url": "https://arxiv.org/abs/2511.15304",
    "summary": "This arXiv preprint, submitted in November 2025, presents research demonstrating that \"adversarial poetry\" can act as a universal jailbreak mechanism for Large Language Models (LLMs). The study, conducted by Bisconti et al., found that crafting prompts in a poetic style significantly increases the success rate (ASR) of eliciting harmful or disallowed responses from a wide range of both proprietary and open-source LLMs.\n\nThe researchers experimented with 25 different LLMs and observed that poetic prompts, both hand-crafted and generated through a standardized meta-prompt converting harmful requests into verse, bypassed safety mechanisms more effectively than their prose counterparts. They mapped the successful prompts to risk taxonomies like MLCommons and the EU CoP, showing the vulnerability extends across domains like CBRN threats, manipulation, cyber-offenses, and loss-of-control scenarios.\n\nThe study reports an average jailbreak success rate of 62% for hand-crafted poems and 43% for meta-prompt-generated poems, compared to significantly lower rates for non-poetic baselines. The outputs from the LLMs were rigorously evaluated using an ensemble of open-weight judge models and a human-validated subset, with disagreements resolved manually.\n\nThe findings suggest that stylistic variation alone is sufficient to circumvent current LLM safety measures, highlighting fundamental limitations in existing alignment methods and evaluation protocols. The research emphasizes the systematic vulnerability of LLMs to adversarial poetry and calls for a re-evaluation of safety training and evaluation strategies.\n",
    "chinese_title": "对抗性诗歌：LLM通用单轮越狱机制",
    "chinese_summary": "这篇于2025年11月提交的arXiv预印本展示了一项研究，证明“对抗性诗歌”可作为大型语言模型（LLM）的通用越狱机制。 Bisconti等人进行的研究发现，以诗歌风格编写提示显著提高了从各种专有和开源LLM中引出有害或不允许的回应的成功率（ASR）。\n\n研究人员对25种不同的LLM进行了实验，观察到诗歌提示（包括手工制作的和通过将有害请求转换为诗句的标准元提示生成的）比散文提示更有效地绕过了安全机制。他们将成功的提示映射到MLCommons和欧盟CoP等风险分类法，表明这种漏洞扩展到CBRN威胁、操纵、网络犯罪和失控场景等领域。\n\n该研究报告称，手工制作的诗歌的平均越狱成功率为62％，元提示生成的诗歌的成功率为43％，而非诗歌基线的成功率则明显较低。 使用开放权重判断模型集合和人工验证的子集对LLM的输出进行了严格评估，并通过手动方式解决了分歧。\n\n研究结果表明，仅风格变化就足以规避当前的LLM安全措施，突出了现有对齐方法和评估协议的根本局限性。该研究强调了LLM对对抗性诗歌的系统性漏洞，并呼吁重新评估安全培训和评估策略。"
  },
  {
    "id": "45947437",
    "title": "CUDA Ontology",
    "url": "https://jamesakl.com/posts/cuda-ontology/",
    "summary": "This article provides a rigorous ontology of CUDA, clarifying its often overloaded terminology and outlining the relationships between its components. It disambiguates the term \"CUDA\" itself, distinguishing between compute architecture, instruction set, source language, Toolkit, and Runtime. It also clarifies the different meanings of \"kernel\" (OS vs. CUDA) and \"driver\" (NVIDIA GPU Driver vs. CUDA Driver API).\n\nThe article then details the layered architecture of CUDA, spanning from the application layer (PyTorch, TensorFlow, etc.) down to the GPU hardware. Key components are defined: `libcudart.so` (Runtime API), `libcuda.so` (Driver API), CUDA Toolkit (including `nvcc`), and the NVIDIA GPU Driver. The distinction between build-time and execution-time dependencies is emphasized.\n\nCrucially, the article addresses version semantics, covering compute capability (CC), GPU driver version, CUDA Toolkit version, Runtime API version, and Driver API version. It explains how these versions interrelate and affect compatibility.\n\nFinally, it explains the compatibility rules: CUDA drivers are forward compatible (newer drivers support older runtime versions via PTX JIT compilation), but backward compatibility is not supported (older drivers cannot support newer runtime versions). It emphasizes the importance of understanding these rules to avoid version conflicts and ensure CUDA applications run correctly.\n",
    "chinese_title": "CUDA本体",
    "chinese_summary": "本文提供了一个严谨的 CUDA 本体论，阐明了其经常被过度使用的术语，并概述了其组件之间的关系。它明确了术语“CUDA”本身的含义，区分了计算架构、指令集、源代码语言、工具包和运行时。它还阐明了“kernel”（操作系统 vs. CUDA）和“driver”（NVIDIA GPU 驱动程序 vs. CUDA 驱动程序 API）的不同含义。\n\n本文然后详细介绍了 CUDA 的分层架构，从应用层（PyTorch、TensorFlow 等）向下延伸到 GPU 硬件。定义了关键组件：`libcudart.so` (运行时 API)、`libcuda.so` (驱动程序 API)、CUDA 工具包（包括 `nvcc`）以及 NVIDIA GPU 驱动程序。强调了构建时和执行时依赖关系的区别。\n\n至关重要的是，本文阐述了版本语义，涵盖了计算能力 (CC)、GPU 驱动程序版本、CUDA 工具包版本、运行时 API 版本和驱动程序 API 版本。它解释了这些版本如何相互关联并影响兼容性。\n\n最后，它解释了兼容性规则：CUDA 驱动程序是向前兼容的（较新的驱动程序通过 PTX JIT 编译支持较旧的运行时版本），但不支持向后兼容（较旧的驱动程序无法支持较新的运行时版本）。它强调了理解这些规则的重要性，以避免版本冲突并确保 CUDA 应用程序正确运行。"
  },
  {
    "id": "45989329",
    "title": "Basalt Woven Textile",
    "url": "https://materialdistrict.com/material/basalt-woven-textile/",
    "summary": "Basalt Woven Textile is a textile made from natural basalt rock, created by melting the rock at 1400°C and extruding it into filaments. This process results in a material with exceptional tensile strength, more than double that of steel.\n\nThe textile boasts several advantageous properties: high corrosive and chemical resistance, exceeding alloyed steel in strength by 2.5 times and glass fiber by 1.5 times. It can be used in heat-insulating applications up to 700°C, and certain compositions can withstand up to 800°C.\n\nFurthermore, basalt fiber offers high electric-insulating characteristics and electromagnetic radiation transparency, making it suitable for producing electric insulating materials for both low and high-voltage equipment.\n\nThe material's sensorial properties include a satin glossiness, closed structure, smooth texture, and warm temperature. Technically, it exhibits good fire, UV, weather, scratch, and chemical resistance. It is lightweight but is not a renewable resource. Key tags associated with the textile are \"Curious,\" \"Lightweight,\" and \"Natural stones.\" The brand is Vulkan Europe, and it originates from the Netherlands.\n",
    "chinese_title": "玄武岩编织物",
    "chinese_summary": "玄武岩编织纺织品是一种由天然玄武岩制成的纺织品，通过在1400°C下熔化岩石并将其挤压成丝而制成。这一过程造就了一种具有卓越抗拉强度，超过钢材两倍以上的材料。\n\n该纺织品具有多种优势：高耐腐蚀性和耐化学性，强度分别是合金钢的2.5倍和玻璃纤维的1.5倍。它可用于高达700°C的隔热应用，某些成分甚至可以承受高达800°C的温度。\n\n此外，玄武岩纤维具有高电绝缘特性和电磁辐射透明性，使其适用于生产低压和高压设备的电绝缘材料。\n\n该材料的感官特性包括缎面光泽、封闭结构、光滑纹理和温暖的温度。在技术上，它表现出良好的防火、防紫外线、耐候、防刮擦和耐化学性。它重量轻，但不是可再生资源。与该纺织品相关的关键词是“好奇”、“轻质”和“天然石材”。品牌是Vulkan Europe，原产地是荷兰。"
  },
  {
    "id": "45895100",
    "title": "Smart Performance Hacks for Faster Python Code",
    "url": "https://blog.jetbrains.com/pycharm/2025/11/10-smart-performance-hacks-for-faster-python-code/",
    "summary": "This article provides 10 performance optimization hacks for Python code, targeting developers looking to improve execution speed and efficiency.\n\n1.  **Sets for Membership Testing:** Use sets instead of lists for membership checks due to their O(1) average lookup time compared to lists' O(n).\n2.  **Avoid Unnecessary Copies:** Modify objects in place instead of creating copies to reduce memory usage and improve performance.\n3.  **`__slots__` for Memory Efficiency:** Define fixed attributes in classes using `__slots__` to reduce memory overhead by eliminating the dynamic `__dict__`.\n4.  **Math Functions:** Utilize functions from the `math` module (implemented in C) for numerical computations for better performance and precision.\n5.  **Pre-allocate Memory:** Pre-allocate memory for lists or arrays with known sizes to avoid dynamic resizing overhead.\n6.  **Avoid Exception Handling in Loops:** Use conditional checks to prevent errors instead of relying on exception handling within performance-critical loops.\n7.  **Local Functions:** Define frequently used logic as local functions to improve name resolution speed.\n8.  **Itertools for Combinatorial Operations:** Use the `itertools` module for efficient generation of permutations, combinations, and other iterator-based tasks.\n9.  **Bisect for Sorted Lists:** Employ the `bisect` module for maintaining sorted order in lists using binary search for efficient insertions and searches.\n10. **Avoid repeated function calls in loops:** Avoid calling the same function multiple times inside a loop.\nThe article also highlights PyCharm's features like intelligent code completion for the `math` module and the AI Assistant's \"Suggest Refactoring\" tool for code improvement suggestions. Each hack includes benchmarked code examples demonstrating the performance gains.\n",
    "chinese_title": "加速Python代码的智能性能技巧",
    "chinese_summary": "本文针对希望提高Python代码执行速度和效率的开发者，提供了10个Python代码性能优化技巧。\n\n1. **集合用于成员检测：** 使用集合代替列表进行成员检查，因为集合的平均查找时间复杂度为O(1)，而列表为O(n)。\n2. **避免不必要的复制：** 直接修改对象，而不是创建副本，以减少内存使用并提高性能。\n3. **`__slots__`提高内存效率：** 使用`__slots__`在类中定义固定属性，通过消除动态`__dict__`来减少内存开销。\n4. **数学函数：** 利用`math`模块（以C语言实现）中的函数进行数值计算，以获得更好的性能和精度。\n5. **预分配内存：** 为已知大小的列表或数组预先分配内存，以避免动态调整大小的开销。\n6. **避免在循环中使用异常处理：** 使用条件检查来防止错误，而不是在对性能至关重要的循环中依赖异常处理。\n7. **局部函数：** 将常用逻辑定义为局部函数，以提高名称解析速度。\n8. **Itertools用于组合操作：** 使用`itertools`模块高效生成排列、组合和其他基于迭代器的任务。\n9. **Bisect用于排序列表：** 使用`bisect`模块通过二分查找来维护列表中已排序的顺序，以实现高效的插入和搜索。\n10. **避免在循环中重复函数调用：** 避免在循环内部多次调用相同的函数。\n本文还重点介绍了PyCharm的功能，如用于`math`模块的智能代码补全以及AI助手的“建议重构”工具，可提供代码改进建议。 每个技巧都包含基准测试代码示例，展示了性能提升。"
  },
  {
    "id": "45980117",
    "title": "Europe is scaling back GDPR and relaxing AI laws",
    "url": "https://www.theverge.com/news/823750/european-union-ai-act-gdpr-changes",
    "summary": "Europe is scaling back its landmark GDPR and AI laws under pressure from Big Tech and the US government, aiming to cut red tape and boost economic growth. The European Commission proposes changes to GDPR, making it easier for companies to share anonymized and pseudonymized data and allowing AI companies to use personal data for model training, provided it complies with GDPR. The AI Act's rules governing high-risk AI systems are delayed until \"needed standards and support tools are available.\" Cookie banners will be reduced, with non-risk cookies not triggering pop-ups and users controlling others via central browser controls.\n\nOther amendments include simplified AI documentation for smaller companies, a unified cybersecurity incident reporting interface, and centralized AI oversight. Henna Virkkunen of the European Commission argues these changes simplify EU laws while protecting fundamental rights. The proposal now goes to the European Parliament and EU member states for approval, a process expected to be contentious. Critics argue the changes weaken fundamental safeguards and pander to Big Tech's influence following pressure from companies, Donald Trump, and figures like Mario Draghi. The Commission frames the moves as streamlining regulations to improve global competitiveness, particularly in the AI race dominated by US and Chinese companies.\n",
    "chinese_title": "欧洲正在缩减GDPR并放宽人工智能法律。",
    "chinese_summary": "在大型科技公司和美国政府的压力下，欧洲正在缩减其具有里程碑意义的 GDPR 和 AI 法案，旨在减少繁文缛节并促进经济增长。欧盟委员会提议修改 GDPR，使公司更容易共享匿名化和假名化数据，并允许人工智能公司使用个人数据进行模型训练，前提是符合 GDPR。人工智能法案中关于高风险人工智能系统的规则被推迟到“所需的标准和支持工具可用”。Cookie 横幅将会减少，非风险 Cookie 不会触发弹出窗口，用户可以通过中央浏览器控件控制其他 Cookie。\n\n其他修正案包括简化小型公司的人工智能文档，统一的网络安全事件报告界面，以及集中式的人工智能监督。欧盟委员会的 Henna Virkkunen 认为，这些修改简化了欧盟法律，同时保护了基本权利。该提案现在将提交欧洲议会和欧盟成员国批准，预计这一过程将充满争议。批评人士认为，这些修改削弱了基本保障措施，并屈从于大型科技公司的影响，此前这些公司、唐纳德·特朗普和马里奥·德拉吉等人物施加了压力。欧盟委员会将此举定位为精简法规，以提高全球竞争力，尤其是在美国和中国公司主导的人工智能竞赛中。"
  },
  {
    "id": "45956438",
    "title": "Towards Interplanetary QUIC Traffic",
    "url": "https://ochagavia.nl/blog/towards-interplanetary-quic-traffic/",
    "summary": "This article details a project aiming to adapt the QUIC internet protocol for reliable communication in deep space. The current deep space networking architecture faces limitations as space exploration expands, making QUIC a promising alternative. However, the immense latency (3-23 minutes to Mars) and intermittent connectivity in deep space prevent QUIC from working with its default settings designed for terrestrial internet.\n\nThe project focuses on finding custom QUIC configurations that can handle these challenges through experimentation. Initial experiments using virtual machines to simulate the deep space network proved slow due to the introduced latencies. To accelerate the process, the author developed a novel approach involving a time-jumping clock and an in-process simulated network. This allows for \"instantaneous\" experiments within a single process, where client and server communicate without real network IO.\n\nThis new setup allows precise control over the network, enabling deterministic runs and enhanced debuggability through synthetic .pcap file recording for packet inspection. The author implemented the clock and network features in Quinn, a Rust QUIC library. The project's goal is to demonstrate QUIC's viability in deep space and provide guidelines for its deployment, potentially replacing protocols like CFDP currently used for transmitting data from Mars.\n",
    "chinese_title": "迈向星际QUIC流量",
    "chinese_summary": "本项目旨在将QUIC互联网协议适配于深空可靠通信。随着深空探索的扩展，当前的深空网络架构面临局限性，QUIC因此成为一个有前景的替代方案。然而，深空中巨大的延迟（到达火星需要3-23分钟）和间歇性连接使得QUIC无法使用其为地面互联网设计的默认设置。\n\n该项目专注于通过实验寻找能够应对这些挑战的定制QUIC配置。使用虚拟机模拟深空网络的初步实验由于引入的延迟而速度缓慢。为了加速这一过程，作者开发了一种涉及时间跳跃时钟和进程内模拟网络的新方法。这允许在单个进程中进行“瞬时”实验，客户端和服务器在没有真实网络IO的情况下进行通信。\n\n这种新设置可以精确控制网络，从而实现确定性运行，并通过合成的.pcap文件记录进行数据包检查，从而增强可调试性。作者在Rust QUIC库Quinn中实现了时钟和网络功能。该项目的目标是展示QUIC在深空中的可行性，并为它的部署提供指导，有可能取代目前用于从火星传输数据的CFDP等协议。"
  },
  {
    "id": "45982073",
    "title": "Meta Segment Anything Model 3",
    "url": "https://ai.meta.com/sam3/",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "Meta Segment Anything 模型 3",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "45990575",
    "title": "DOS Days – Laptop Displays",
    "url": "https://www.dosdays.co.uk/topics/laptop_displays.php",
    "summary": "This article on \"DOS Days - Laptop Displays\" explores the evolution of display technologies used in early laptop computers, primarily during the DOS era. Initially, heavy CRT (Cathode Ray Tube) monitors were used in luggable PCs due to their affordability. However, the industry quickly shifted towards LCD (Liquid Crystal Display) technology for its energy efficiency and compact size.\n\nEarly LCDs required external backlights or sidelights to be readable, and suffered from poor contrast and ghosting. Gas plasma displays offered brighter, sharper images but consumed too much power for portable use.\n\nThe introduction of STN (Supertwist Nematic) displays improved resolution, but retained the ghosting effect. DSTN (Double Layer Supertwist Nematic) technology addressed the slow refresh rate of STN screens, but still struggled with low contrast and washed-out colors.\n\nFinally, TFT (Thin Film Transistor) or \"active-matrix\" displays emerged, offering superior contrast, faster refresh rates, and higher resolutions, solving the major drawbacks of passive-matrix displays. While initially more expensive, TFT displays became the standard, paving the way for modern laptop screens, and are still widely used today. The article highlights the progression from bulky, power-hungry CRTs to the sophisticated TFT technology, marking a significant advancement in portable computing.\n",
    "chinese_title": "DOS时代 – 笔记本电脑显示器",
    "chinese_summary": "DOS时代 - 笔记本电脑显示器\n\n本文探讨了早期笔记本电脑（主要在DOS时代）所使用的显示技术的演变。最初，由于阴极射线管(CRT)显示器价格低廉，便携式电脑普遍采用笨重的CRT显示器。然而，由于液晶显示(LCD)技术的节能和小型化优势，行业迅速转向LCD技术。\n\n早期的LCD需要外部背光或侧光才能清晰显示，并且存在对比度差和拖影问题。 气体等离子显示器虽然提供了更明亮、更清晰的图像，但功耗过高，不适合便携使用。\n\n超扭曲向列(STN)显示器的引入提高了分辨率，但仍然存在拖影效应。 双层超扭曲向列(DSTN)技术解决了STN屏幕刷新率慢的问题，但仍然存在对比度低和色彩黯淡的问题。\n\n最终，薄膜晶体管(TFT)或“有源矩阵”显示器问世，提供了卓越的对比度、更快的刷新率和更高的分辨率，解决了无源矩阵显示器的主要缺点。 虽然最初价格较高，但TFT显示器逐渐成为标准，为现代笔记本电脑屏幕铺平了道路，并且至今仍被广泛使用。 本文重点介绍了从笨重、耗电的CRT到精密的TFT技术的演变，标志着便携式计算领域的重大进步。"
  },
  {
    "id": "45922610",
    "title": "Scientists Reveal How the Maya Predicted Eclipses for Centuries",
    "url": "https://www.sciencealert.com/scientists-reveal-how-the-maya-predicted-eclipses-for-centuries",
    "summary": "Researchers have cracked the code on a Maya calendar within the Dresden Codex, revealing how the civilization accurately predicted solar eclipses for centuries. The Dresden Codex, a rare surviving text from pre-colonial Maya society, contains detailed astronomical and astrological information, including a table spanning 405 lunar months (11,960 days) used for eclipse prediction.\n\nFor years, scientists struggled to understand how the table functioned, with the prevailing theory suggesting it operated on a continuous loop. However, linguist John Justeson and archaeologist Justin Lowry proposed a new interpretation, suggesting the table was not reset at its final position. Instead, they suggest that a new table is begun in the 358th month of the current table.\n\nTheir research demonstrates that the Maya initiated a new table in the 358th month of the preceding one, and occasionally in the 223rd month to fine-tune for accruing deviations. By comparing the table to modern astronomical data, the researchers found this method would have allowed the Maya to accurately predict every solar eclipse visible in their region between 350 and 1150 CE, accounting for minor errors that build up over time. This suggests the Maya were highly advanced in their astronomical understanding and mathematics, using this knowledge to maintain their spiritual connection to the cosmos and guide important rituals.\n",
    "chinese_title": "科学家揭示玛雅人如何预测了几个世纪的日食",
    "chinese_summary": "研究人员破解德累斯顿古抄本中的玛雅历法密码，揭示该文明如何准确预测数个世纪的日食。德累斯顿古抄本是前殖民时期玛雅社会幸存的罕见文献，包含详细的天文和占星信息，其中包括一个跨越405个太阴月（11960天）的表格，用于预测日食。\n\n多年来，科学家们一直难以理解该表格的运作方式，主流理论认为它以连续循环的方式运行。然而，语言学家约翰·贾斯提森和考古学家贾斯汀·洛瑞提出了一种新的解释，认为该表格并没有在其最终位置重置。相反，他们认为应该在当前表格的第358个月开始一个新的表格。\n\n他们的研究表明，玛雅人在前一个表格的第358个月（偶尔也在第223个月）启动一个新的表格，以对累积的偏差进行微调。通过将该表格与现代天文数据进行比较，研究人员发现，这种方法将使玛雅人能够准确预测公元350年至1150年间在其区域可见的每一次日食，并考虑到随着时间推移而产生的细微误差。这表明玛雅人在天文理解和数学方面非常先进，利用这些知识来维持他们与宇宙的精神联系并指导重要的仪式。"
  },
  {
    "id": "45984659",
    "title": "Loose wire leads to blackout, contact with Francis Scott Key bridge",
    "url": "https://www.ntsb.gov:443/news/press-releases/Pages/NR20251118.aspx",
    "summary": "The containership Dali experienced a blackout caused by a loose wire, leading to its collision with Baltimore’s Francis Scott Key Bridge. This blackout likely disabled the ship's propulsion and steering systems, rendering it unable to avoid the bridge. The accident resulted in the bridge's collapse and significant disruption to maritime traffic in the area. Investigations are underway to determine the exact sequence of events and contributing factors beyond the initial loose wire. The blackout and subsequent collision underscore the critical importance of reliable electrical systems on large vessels and the potential for catastrophic consequences when these systems fail. The economic impact of the bridge collapse is expected to be substantial, affecting supply chains and local businesses.\n",
    "chinese_title": "电线松动导致停电，并撞击弗朗西斯·斯科特·基大桥",
    "chinese_summary": "“达利”号集装箱船因电线松动导致断电，进而撞上巴尔的摩弗朗西斯·斯科特·基大桥。此次断电可能导致该船的推进和转向系统失灵，使其无法避开大桥。事故造成大桥坍塌，并对该地区的海上交通造成严重干扰。目前正在进行调查，以确定除最初的电线松动之外的确切事件顺序和促成因素。此次断电和随后的碰撞突显了大型船舶上可靠电力系统的重要性，以及这些系统发生故障可能造成的灾难性后果。预计大桥坍塌将对经济产生重大影响，波及供应链和当地企业。"
  },
  {
    "id": "45984133",
    "title": "The lost cause of the Lisp machines",
    "url": "https://www.tfeb.org/fragments/2025/11/18/the-lost-cause-of-the-lisp-machines/",
    "summary": "The author expresses frustration with persistent nostalgia for Lisp machines, arguing they were a temporary solution that are best left in the past. While acknowledging their innovative development environments, he contends these were not hardware-dependent and could be replicated on modern systems. He refutes claims of superior speed, pointing out that modern compilers and hardware outperform Lisp machines. The user-microcodable nature of the machines is downplayed as primarily a tool for the manufacturers, not the users.\n\nWhile conceding that Lisp machines offered a unique, low-level access to the system, he acknowledges the severe lack of security inherent in this approach. The author also argues that modern Lisp compilers are sophisticated and efficient, negating the need for specialized hardware. The argument that Lisp machines had superior keyboards is dismissed as irrelevant to Lisp itself.\n\nUltimately, the author likens Lisp machine romanticism to \"gear acquisition syndrome,\" suggesting it is a distraction from the hard work and talent required for innovation. Instead of mourning the past, the author encourages Lisp enthusiasts to focus on building the future of Lisp on current technology. He also speculates on the potential for using cheap, powerful GPU farms for novel applications, similar to the evolution of HPC systems after the decline of dedicated designs.\n",
    "chinese_title": "Lisp机器的失败事业",
    "chinese_summary": "作者对持续怀念Lisp机器感到不满，认为它们是应该留在过去的临时解决方案。他承认其创新性的开发环境，但辩称这些并不依赖于硬件，可以在现代系统上复制。他驳斥了速度更快的说法，指出现代编译器和硬件的性能优于Lisp机器。机器的用户可微码特性被淡化为主要为制造商而非用户提供的工具。\n\n虽然承认Lisp机器提供了对系统的独特的、低级别的访问权限，但他承认这种方法固有的严重安全性不足。作者还认为，现代Lisp编译器是复杂且高效的，从而消除了对专用硬件的需求。Lisp机器拥有卓越键盘的说法被认为与Lisp本身无关而被驳回。\n\n最终，作者将对Lisp机器的浪漫主义比作“装备获取综合症”，表明这分散了创新所需的努力和才能。作者鼓励Lisp爱好者专注于利用当前技术构建Lisp的未来，而不是哀悼过去。他还推测了使用廉价、强大的GPU集群进行新颖应用程序的潜力，类似于专用设计衰落后HPC系统的演变。"
  },
  {
    "id": "45939148",
    "title": "Wrapping my head around AI wrappers",
    "url": "https://www.wreflection.com/p/wrapping-my-head-around-ai-wrappers",
    "summary": "This article explores the debate around \"AI wrappers\" – applications built on top of existing AI models – and why some succeed while others fail. It argues that simply dismissing something as an AI wrapper misses the point; the key lies in whether it's a fleeting feature or a lasting product, and the size of the market segment it addresses.\n\nThe author contends that basic wrappers solving narrow problems (like chatting with a PDF) are often destined to be absorbed by larger platforms as features are bundled into existing suites. However, these can still generate revenue as independent businesses until that happens.\n\nTrue product potential lies in larger market segments, but these face competition from both model providers (like OpenAI) who can improve their models and incorporate the functionality, and incumbents with established distribution networks. Examples like coding assistants illustrate the challenges of model access and dependence. The article highlights how Cursor, an AI IDE, relies on external models and faces rate limits, prompting users to migrate to solutions that offer more reliable access.\n\nThe author emphasizes that success depends on several factors: living where work is done, writing to proprietary systems of record, building proprietary data from user behavior, and establishing distribution before incumbents integrate AI. Incumbents with existing workflows and data advantages are well-positioned to leverage AI. Finally, smaller niche markets exist that are too small for major players but can sustain profitable indie businesses. The article concludes that successful \"wrappers\" are those that solve users' needs effectively, adapt to competition, and develop moats that go beyond simply accessing an AI model.\n",
    "chinese_title": "理解AI封装器",
    "chinese_summary": "本文探讨了围绕“AI封装应用”（构建于现有AI模型之上的应用程序）的争论，以及一些成功而另一些失败的原因。文章认为，简单地将某事物视为AI封装应用是片面的；关键在于它是昙花一现的功能还是持久的产品，以及它所针对的市场细分规模。\n\n作者认为，解决狭隘问题的基本封装应用（例如与PDF聊天）通常注定会被更大的平台吸收，因为这些功能会被捆绑到现有的套件中。然而，在这种情况发生之前，它们仍然可以作为独立的业务产生收入。\n\n真正的产品潜力在于更大的市场细分，但这些细分市场面临着来自模型提供商（如OpenAI，他们可以改进他们的模型并整合这些功能）以及具有成熟分销网络的现有企业的竞争。像代码助手这样的例子说明了模型访问和依赖的挑战。文章强调了AI IDE（集成开发环境）Cursor如何依赖外部模型并面临速率限制，促使用户迁移到提供更可靠访问的解决方案。\n\n作者强调，成功取决于几个因素：在工作场所提供服务，写入专有的记录系统，从用户行为中构建专有数据，并在现有企业整合AI之前建立分销渠道。拥有现有工作流程和数据优势的现有企业有充分的优势来利用AI。最后，存在一些较小的利基市场，这些市场对于主要参与者来说太小，但可以维持盈利的独立业务。文章总结说，成功的“封装应用”是那些有效解决用户需求、适应竞争并开发超越简单访问AI模型的护城河的应用。"
  },
  {
    "id": "45987179",
    "title": "Verifying your Matrix devices is becoming mandatory",
    "url": "https://element.io/blog/verifying-your-devices-is-becoming-mandatory-2/",
    "summary": "This short announcement highlights an important security update for the Matrix ecosystem. The core message is that a coordinated security fix has been released for all Matrix server implementations as part of the Matrix 1.16 update. This is described as an \"off-cycle spec update,\" suggesting its urgency. The announcement also mentions that Matrix device verification is becoming mandatory, implying that users will be required to verify their devices for enhanced security. Finally, \"Element Security\" is mentioned and the date \"11/08/2025\", though the connection to the main point is unclear from this extract alone. It is possible that is either the date this security information was released, or the date where the verification is becoming mandatory.\n",
    "chinese_title": "验证您的 Matrix 设备正变得强制性",
    "chinese_summary": "本简短公告强调了Matrix生态系统的一项重要安全更新。核心信息是，作为Matrix 1.16更新的一部分，所有Matrix服务器实现都发布了一个协同安全修复程序。这被描述为“非周期性规范更新”，表明其紧迫性。公告还提到Matrix设备验证将成为强制性措施，这意味着用户将被要求验证其设备以增强安全性。最后，提到了“Element Security”以及日期“2025年11月8日”，但从这段摘录来看，与主旨的关联尚不清楚。可能指的是此安全信息发布日期，或者设备验证成为强制性措施的日期。"
  },
  {
    "id": "45985036",
    "title": "Researchers discover security vulnerability in WhatsApp",
    "url": "https://www.univie.ac.at/en/news/detail/forscherinnen-entdecken-grosse-sicherheitsluecke-in-whatsapp",
    "summary": "Researchers from the University of Vienna and SBA Research discovered a privacy vulnerability in WhatsApp's contact discovery mechanism that allowed the enumeration of 3.5 billion accounts. By querying a high volume of phone numbers, they were able to confirm active accounts and extract public data like phone number, public keys, timestamps, profile picture, and \"about\" text, which allowed them to infer operating systems, account age, and linked devices.\n\nThe research revealed wider insights, including active WhatsApp accounts in countries where it's banned, global distribution of Android vs. iOS usage, regional differences in privacy settings, potential weaknesses in unofficial clients, and the continued activity of phone numbers leaked in the 2021 Facebook data breach. While the study didn't access message content, it highlighted privacy risks arising from metadata collection and analysis.\n\nMeta has since addressed the vulnerability in collaboration with the researchers by implementing rate-limiting and stricter profile information visibility. WhatsApp VP of Engineering, Nitin Gupta, stated that no non-public data was accessed, user messages remained private due to end-to-end encryption, and the researchers securely deleted the collected data. The researchers emphasized the importance of continuous security research and collaboration with industry to improve user privacy. Their research will be presented at the NDSS Symposium in 2026.\n",
    "chinese_title": "研究人员发现WhatsApp安全漏洞",
    "chinese_summary": "维也纳大学和SBA Research的研究人员发现了WhatsApp联系人发现机制中的一个隐私漏洞，该漏洞允许枚举35亿个账户。通过查询大量电话号码，他们能够确认活跃账户，并提取公开数据，如电话号码、公钥、时间戳、头像和“关于”文本，从而推断出操作系统、账户年龄和关联设备。\n\n该研究揭示了更广泛的见解，包括在被禁国家/地区活跃的WhatsApp账户、Android与iOS使用的全球分布、隐私设置的区域差异、非官方客户端的潜在弱点，以及2021年Facebook数据泄露中泄露的电话号码的持续活动。虽然该研究没有访问消息内容，但它强调了元数据收集和分析带来的隐私风险。\n\nMeta随后与研究人员合作解决了该漏洞，实施了速率限制和更严格的个人资料信息可见性。WhatsApp工程副总裁Nitin Gupta表示，没有访问非公开数据，由于端到端加密，用户消息仍然是私密的，研究人员安全地删除了收集的数据。研究人员强调了持续安全研究和与行业合作以改善用户隐私的重要性。他们的研究成果将于2026年在NDSS研讨会上发表。"
  },
  {
    "id": "45992403",
    "title": "Judgement on Dr Matthew Garrett (@mjg59) vs. Dr Roy Schestowitz (Techrights.org)",
    "url": "https://caselaw.nationalarchives.gov.uk/ewhc/kb/2025/3063",
    "summary": "This document outlines the introduction and preliminary issues in a libel and data protection case between Dr. Matthew Garrett, a free software activist and employee of NVIDIA, and Dr. Roy and Mrs. Rianne Schestowitz, operators of the free software websites Techrights and Tuxmachines.\n\nDr. Garrett is suing the Schestowitzes over 24 publications on their websites in August and September 2023, alleging libel and data protection violations. The Schestowitzes are counterclaiming harassment.\n\nThe Schestowitzes initially filed a defense but later chose to represent themselves in court and decided not to submit any evidence or call witnesses due to financial constraints. This decision significantly limits their ability to defend their case.\n\nThe court addresses the preliminary issues for the defamation claim, focusing on determining the \"single natural and ordinary meaning\" of the publications. This involves understanding how a reasonable reader would interpret the words, considering context and avoiding overly legalistic analysis. The judgment clarifies the distinction between fact and opinion, highlighting that the test is objective.\n\nThe court also considers whether the publications have a defamatory tendency, meaning if they would negatively impact the attitude of others towards Dr. Garrett.\n\nA table summarizing the parties' arguments regarding the meaning of the publications is provided in Annex B. The court notes that the publications accuse Dr. Garrett of various online behaviors, including cybercrime, hate crime, blackmail, issuing threats, defamation, harassment, and online abuse. They also allege he is an uncontrolled user of illegal drugs, specifically crack cocaine. The judge leaned towards the Claimant's arguments that the criminal allegations made are statements of fact, and favored the Defendant's opinion that the allegations of racism and misogyny, etc are expressions of evaluative opinion. The court acknowledges that the publications are undoubtedly \"grossly defamatory.\"\n",
    "chinese_title": "马修·加勒特博士 (@mjg59) 诉 罗伊·舍斯托维茨博士 (Techrights.org) 判决",
    "chinese_summary": "本文概述了自由软件活动家、英伟达员工马修·加勒特博士与自由软件网站Techrights和Tuxmachines的运营者罗伊·谢斯托维茨博士及其夫人里安妮·谢斯托维茨之间诽谤和数据保护案件的介绍和初步问题。\n\n加勒特博士起诉谢斯托维茨夫妇，指控他们在2023年8月和9月在其网站上发布的24篇出版物构成诽谤和违反数据保护。谢斯托维茨夫妇反诉骚扰。\n\n谢斯托维茨夫妇最初提交了辩护，但后来选择在法庭上自行辩护，并因财政拮据而决定不提交任何证据或传唤证人。这一决定大大限制了他们为自己辩护的能力。\n\n法院处理了诽谤索赔的初步问题，重点是确定出版物的“单一自然和通常含义”。 这涉及理解一个理性读者将如何解读这些词语，同时考虑到上下文，并避免过度法律化的分析。判决澄清了事实和观点之间的区别，强调测试是客观的。\n\n法院还考虑了这些出版物是否具有诽谤倾向，这意味着它们是否会对他人对加勒特博士的态度产生负面影响。\n\n附件B中提供了一个总结双方关于出版物含义的论点的表格。法院指出，这些出版物指控加勒特博士存在各种在线行为，包括网络犯罪、仇恨犯罪、敲诈勒索、发出威胁、诽谤、骚扰和在线辱骂。他们还声称他是一个不受控制的非法毒品使用者，特别是快克可卡因。法官倾向于原告的论点，即所提出的犯罪指控是事实陈述，并倾向于被告的观点，即种族主义和厌女症等指控是评价性意见的表达。 法院承认，这些出版物无疑是“极具诽谤性的”。"
  },
  {
    "id": "45982649",
    "title": "Building more with GPT-5.1-Codex-Max",
    "url": "https://openai.com/index/gpt-5-1-codex-max/",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "使用GPT-5.1-Codex-Max构建更多",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "45908801",
    "title": "New Proofs Probe Soap-Film Singularities",
    "url": "https://www.quantamagazine.org/new-proofs-probe-soap-film-singularities-20251112/",
    "summary": "This Quanta Magazine article, \"New Proofs Probe Soap-Film Singularities,\" discusses recent breakthroughs in understanding minimizing surfaces, which are mathematical representations of shapes like soap films that minimize area. For decades, mathematicians have been studying these surfaces, which appear in various fields from geometry to physics.\n\nThe article explains that while minimizing surfaces are smooth in dimensions up to seven, they can develop singularities (folds, pinches, or intersections) in higher dimensions, making them harder to analyze. A major advance occurred when a team of mathematicians, Chodosh, Mantoulidis, Schulze, and Wang, proved that in dimensions nine, ten, and eleven, smooth minimizing surfaces are the norm, meaning singularities can often be \"wiggled away\" with slight adjustments to the boundary.\n\nThis breakthrough builds upon earlier work, notably the 1985 proof by Hardt and Simon that singularities can be wiggled away in eight dimensions. The recent findings extend this property to higher dimensions, overcoming a 40-year-old barrier. The team used a novel approach involving \"separation functions\" to demonstrate the possibility of removing singularities through perturbations.\n\nThe significance lies in the broader implications for mathematics and physics. Proofs of many conjectures previously limited to eight dimensions can now be extended to dimensions nine, ten, and eleven. This includes theorems in geometry, topology, and the positive mass theorem in general relativity, offering new insights and reinforcing existing understanding. Further research aims to either extend these findings to even higher dimensions or discover a point where singularities become unavoidable, presenting another exciting challenge for mathematicians.\n",
    "chinese_title": "新证据探究肥皂膜奇点",
    "chinese_summary": "《量子杂志》文章“新证明探索肥皂膜奇点”探讨了理解极小曲面的最新突破，极小曲面是像肥皂膜那样最小化面积的形状的数学表示。 几十年来，数学家一直在研究这些曲面，它们出现在从几何学到物理学的各个领域。\n\n文章解释说，虽然极小曲面在七维以内是光滑的，但它们在更高的维度上可能会出现奇点（褶皱、收缩或交叉），从而更难以分析。 当一组数学家，Chodosh、Mantoulidis、Schulze 和 Wang，证明在九维、十维和十一维中，光滑的极小曲面是常态时，出现了一项重大进展，这意味着可以通过对边界进行轻微调整来“摆脱”奇点。\n\n这一突破建立在早期的工作之上，特别是 Hardt 和 Simon 于 1985 年证明的奇点可以在八维中摆脱。 最近的发现将这一性质扩展到更高的维度，克服了 40 年来的障碍。 该团队使用了一种涉及“分离函数”的新方法来证明通过扰动消除奇点的可能性。\n\n其意义在于对数学和物理学的更广泛影响。 许多先前仅限于八维的猜想的证明现在可以扩展到九维、十维和十一维。 这包括几何、拓扑和广义相对论中的正质量定理，提供新的见解并加强现有的理解。 进一步的研究旨在将这些发现扩展到更高的维度，或者发现奇点变得不可避免的点，这为数学家们提出了另一个令人兴奋的挑战。"
  },
  {
    "id": "45970885",
    "title": "A surprise with how '#!' handles its program argument in practice",
    "url": "https://utcc.utoronto.ca/~cks/space/blog/unix/ShebangRelativePathSurprise",
    "summary": "Chris Siebenmann's blog (Wandering Thoughts) is blocking access to users with older browser versions, particularly Chrome, due to a surge in high-volume web crawlers attempting to gather data for LLM training using outdated browser user agents. This measure is intended to reduce the load on the server.\n\nThe blocking affects even legitimate users with older browsers and users accessing the site through archiving services like archive.today, archive.ph, and archive.is. These archiving services are being treated as suspicious because they use old Chrome user agent values, crawl from widely distributed IP address blocks, and sometimes have falsified reverse DNS entries. This makes them indistinguishable from malicious crawlers.\n\nSiebenmann recommends using archive.org instead, as it is a better-behaved archival crawler. He also encourages users encountering this issue with current browsers to contact him with their browser details and User-Agent string, so he can investigate potential false positives. The problem primarily began in early 2025.\n",
    "chinese_title": "#!处理程序参数的实际方式令人惊讶",
    "chinese_summary": "由于大量网络爬虫试图使用过时的浏览器用户代理收集数据用于LLM训练，Chris Siebenmann的博客（Wandering Thoughts）已屏蔽使用旧版浏览器（尤其是Chrome）的用户访问。此举旨在降低服务器负载。\n\n屏蔽甚至影响了使用旧版浏览器的合法用户以及通过archive.today、archive.ph和archive.is等存档服务访问网站的用户。这些存档服务由于使用旧的Chrome用户代理值，从广泛分布的IP地址块进行爬取，有时还具有伪造的反向DNS条目，而被视为可疑对象，这使得它们与恶意爬虫难以区分。\n\nSiebenmann建议改用archive.org，因为它是一个行为更好的存档爬虫。他还鼓励使用当前浏览器的用户如果遇到此问题，请联系他并提供浏览器详细信息和User-Agent字符串，以便他调查潜在的误报。该问题主要始于2025年初。"
  },
  {
    "id": "45985867",
    "title": "Precise geolocation via Wi-Fi Positioning System",
    "url": "https://www.amoses.dev/blog/wifi-location/",
    "summary": "This article explores the technology behind precise geolocation using Wi-Fi Positioning System (WPS). The author was intrigued by how TopHat, an attendance-taking app, could accurately determine a student's location during lectures. The article explains that while IP geolocation is inaccurate, modern browsers use the Geolocation API, which employs WPS for significantly more precise location tracking.\n\nWPS leverages the surrounding Wi-Fi access points to pinpoint a device's location. The browser obtains a list of nearby Wi-Fi networks, including their SSIDs (friendly names) and BSSIDs (unique identifiers), and sends this data to companies like Google, Apple, and Microsoft. These companies maintain databases of Wi-Fi network locations, built through \"wardriving\" (mapping Wi-Fi networks with GPS) and, more importantly, crowdsourced data from users' devices. Devices passively collect and send anonymized Wi-Fi hotspot information along with their GPS location.\n\nThe article also addresses privacy concerns surrounding WPS. Past incidents include Google's Street View cars sniffing unencrypted Wi-Fi data and vulnerabilities that allowed tracking of users' locations through their Wi-Fi connection history. While location service providers have improved security, the default data collection practices of most devices remain a concern. Users can opt their BSSID out of these databases, usually by changing their SSID or submitting their MAC address. The author concludes by highlighting resources like WiGLE.net and beacondb.net for those interested in Wi-Fi positioning and encourages awareness of the technology behind location services.\n",
    "chinese_title": "基于Wi-Fi定位系统的精确定位",
    "chinese_summary": "本文探讨了利用Wi-Fi定位系统（WPS）实现精确定位的技术原理。作者对考勤应用程序TopHat如何准确确定学生在讲座期间的位置感到好奇。文章解释说，虽然IP地理定位不准确，但现代浏览器使用Geolocation API，该API采用WPS进行更精确的位置跟踪。\n\nWPS利用周围的Wi-Fi接入点来确定设备的位置。浏览器获取附近Wi-Fi网络的列表，包括其SSID（友好名称）和BSSID（唯一标识符），并将此数据发送给谷歌、苹果和微软等公司。这些公司维护着Wi-Fi网络位置的数据库，这些数据库是通过“扫街”（用GPS绘制Wi-Fi网络地图）以及更重要的是，来自用户设备的众包数据构建的。设备被动地收集并发送匿名化的Wi-Fi热点信息以及其GPS位置。\n\n文章还讨论了围绕WPS的隐私问题。过去的事件包括谷歌的街景车嗅探未加密的Wi-Fi数据，以及允许通过用户的Wi-Fi连接历史记录跟踪其位置的漏洞。虽然位置服务提供商已经提高了安全性，但大多数设备的默认数据收集行为仍然令人担忧。用户通常可以通过更改其SSID或提交其MAC地址，将其BSSID排除在这些数据库之外。作者最后强调了WiGLE.net和beacondb.net等资源，供那些对Wi-Fi定位感兴趣的人使用，并鼓励人们了解位置服务背后的技术。"
  },
  {
    "id": "45989186",
    "title": "Details about the shebang/hash-bang mechanism on various Unix flavours (2001)",
    "url": "https://www.in-ulm.de/%7Emascheck/various/shebang/",
    "summary": "This article provides an in-depth look at the shebang (#!), or hash-bang, mechanism in Unix-like operating systems. It details the history, implementation, and nuances of this feature that allows scripts to be executed by a specified interpreter.\n\nThe shebang mechanism originated at Bell Labs between Version 7 and Version 8 Unix, appearing later in BSD distributions. Early implementations had limitations in line length and argument passing. Later BSD versions, while initially removing the code due to licensing issues, eventually reimplemented it.\n\nThe article addresses common misconceptions about shebang usage, such as the requirement for a blank space after the #! sequence and the handling of setuid/gid bits. Setuid functionality, often disabled for security reasons, is supported on systems employing a virtual filedescriptor filesystem.\n\nDifferent systems handle arguments passed to the interpreter differently: some pass only the first argument, some split arguments, and others pass them as a single string. The use of the `env` utility is discussed as a means of specifying interpreters located in the PATH, but its portability is not guaranteed.\n\nThe maximum length of the #! line varies significantly across different Unix flavors, ranging from 16 bytes in early versions to potentially thousands of bytes in modern systems like FreeBSD. The article also touches on the possibility of nesting #! sequences, a feature supported by Linux and Minix, with limitations on recursion depth. Finally, the article emphasizes the importance of being aware of numerous issues that can occur when using the shebang mechanism, especially with setuid scripts.\n",
    "chinese_title": "关于各种Unix系统上Shebang/Hash-Bang机制的详细信息（2001年）",
    "chinese_summary": "本文深入探讨了类Unix操作系统中的Shebang（#!）机制，也称为Hash-bang。详细介绍了这一功能允许脚本由指定解释器执行的历史、实现方式和细微差别。\n\nShebang机制起源于贝尔实验室的Unix第七版和第八版之间，后来出现在BSD发行版中。早期的实现在线长度和参数传递方面存在限制。后来的BSD版本最初由于许可问题移除了该代码，但最终重新实现了它。\n\n本文阐述了关于Shebang使用的常见误解，例如#!序列后需要空格以及setuid/gid位的处理。Setuid功能通常因安全原因而被禁用，但在使用虚拟文件描述符文件系统的系统上得到支持。\n\n不同的系统处理传递给解释器的参数的方式有所不同：有些只传递第一个参数，有些分割参数，另一些则将它们作为单个字符串传递。文章讨论了使用`env`工具来指定位于PATH中的解释器的方法，但其可移植性无法保证。\n\n#!行的最大长度在不同的Unix版本中差异很大，从早期版本的16字节到现代系统（如FreeBSD）中可能达到数千字节。文章还提到了嵌套#!序列的可能性，这是Linux和Minix支持的功能，但对递归深度有限制。最后，文章强调了了解使用Shebang机制时可能出现的许多问题的重要性，尤其是在使用setuid脚本时。"
  },
  {
    "id": "45985196",
    "title": "How Slide Rules Work",
    "url": "https://amenzwa.github.io/stem/ComputingHistory/HowSlideRulesWork/",
    "summary": "This article, \"How Slide Rules Work,\" chronicles the history and principles behind the slide rule, a pre-digital calculating device that was essential for engineers and scientists for centuries. It begins by tracing the evolution of calculation methods from ancient counting techniques to the invention of logarithms by John Napier in the 17th century. This discovery paved the way for Edmund Gunter's scale and subsequently William Oughtred's slide rule, which simplified multiplication and division by utilizing logarithmic scales.\n\nThe article highlights the widespread adoption of the slide rule, particularly during the Industrial Revolution and beyond. It was used in various fields, from astronomy and engineering to business and medicine, demonstrating its versatility and impact. The article also shares a personal anecdote of the author's experience with slide rules as an engineering student in Burma, where they were essential due to the unavailability of electronic calculators.\n\nThe author's primary goal is to preserve the knowledge of this ingenious device and how it works, focusing on the fundamental principles of operation rather than detailed instructions. It recommends specific slide rule models, like the Keuffel & Esser 4081-3 and the Post 1460, for readers to acquire and use while understanding the concepts. The article details the components of a slide rule (body, slide, and cursor) and explains how it leverages the properties of logarithms to perform arithmetic operations using logarithmic scales.\n",
    "chinese_title": "滑尺的工作原理",
    "chinese_summary": "本文《计算尺的工作原理》记载了计算尺的历史和原理。计算尺是一种前数字时代的计算工具，几个世纪以来对工程师和科学家至关重要。文章追溯了从古代计数技术到 17 世纪约翰·纳皮尔发明对数这一计算方法的演变。这一发现为埃德蒙·冈特的比例尺以及随后的威廉·奥特雷德的计算尺铺平了道路，后者通过使用对数刻度简化了乘法和除法运算。\n\n文章强调了计算尺的广泛应用，尤其是在工业革命及以后。它被用于各个领域，从天文学和工程学到商业和医学，展示了它的多功能性和影响力。文章还分享了作者在缅甸担任工程系学生时使用计算尺的个人轶事，当时由于电子计算器的不可用，计算尺必不可少。\n\n作者的主要目标是保存这种巧妙装置及其工作原理的知识，重点是基本操作原理而不是详细说明。它建议读者购买和使用特定的计算尺型号，如 Keuffel & Esser 4081-3 和 Post 1460，同时理解这些概念。文章详细介绍了计算尺的组成部分（尺身、滑尺和游标），并解释了它如何利用对数的性质，使用对数刻度执行算术运算。"
  },
  {
    "id": "45980760",
    "title": "Launch HN: Mosaic (YC W25) – Agentic Video Editing",
    "url": "https://mosaic.so",
    "summary": "Mosaic is launching on Hacker News as an agentic AI video editing platform. This means Mosaic aims to automate and streamline the video editing process through the use of AI agents. The platform allows users to leverage AI to perform various video editing tasks, presumably including tasks like cutting, trimming, adding transitions, incorporating music and sound effects, and potentially even generating creative content. Being part of Y Combinator's W25 batch (Winter 2025) signals that Mosaic has received early-stage funding and mentorship, and is likely a promising startup in the AI-powered creative tools space. The key takeaway is that Mosaic provides a platform for AI-driven video editing, aiming to simplify and accelerate the process for users.\n",
    "chinese_title": "发布HN: Mosaic (YC W25) – 智能视频编辑",
    "chinese_summary": "Mosaic 作为自主 AI 视频编辑平台在 Hacker News 上发布。这意味着 Mosaic 旨在通过使用 AI 代理来自动化和简化视频编辑流程。该平台允许用户利用 AI 执行各种视频编辑任务，大概包括剪切、修剪、添加过渡效果、整合音乐和音效，甚至可能生成创意内容。作为 Y Combinator W25 批次（2025 年冬季）的一员，表明 Mosaic 已获得早期融资和指导，并且很可能是一家有前途的 AI 驱动创意工具初创公司。 关键信息是 Mosaic 提供了一个 AI 驱动的视频编辑平台，旨在简化和加速用户的编辑过程。"
  },
  {
    "id": "45888759",
    "title": "What really happened with the CIA and The Paris Review?",
    "url": "https://www.theparisreview.org/blog/2025/11/11/what-really-happened-with-the-cia-and-the-paris-review-a-conversation-with-lance-richardson/",
    "summary": "This article explores the connection between Peter Matthiessen, one of the founders of The Paris Review, and the CIA. It reveals that Matthiessen was a CIA operative in the early 1950s, tasked with gathering intelligence while living in Paris. The article raises the question of whether The Paris Review was directly funded by the CIA as part of its Cold War effort to promote pro-Western culture, but concludes that it likely served merely as a cover for Matthiessen's espionage.\n\nWhile there's no definitive proof of direct CIA funding, it's revealed that Julius Fleischmann, a known CIA frontman, provided some financial support. Matthiessen's motives for joining the CIA stemmed from a desire to be a writer, a need for a stipend, and a feeling of lacking a meaningful contribution during WWII. He saw espionage as an opportunity to be involved.\n\nThe article highlights the bohemian atmosphere of Matthiessen's Paris apartment, which became a hub for the magazine's founders, including George Plimpton. It also touches on the potential ethical implications of Matthiessen's work, suggesting he may have spied on fellow expats like Richard Wright. The article further discusses the conflicting views about The Paris Review's political leanings, with some seeing it as unintentionally aligning with the CIA's agenda. Finally, it explores how Matthiessen's CIA past impacted his relationship with Plimpton and his involvement with the magazine over time.\n",
    "chinese_title": "中情局与巴黎评论究竟发生了什么？",
    "chinese_summary": "本文探讨了《巴黎评论》创始人之一彼得·马蒂森与中央情报局之间的联系。文章揭示了马蒂森在20世纪50年代初是中情局特工，任务是在巴黎居住期间收集情报。文章提出了《巴黎评论》是否直接由中情局资助，作为其冷战时期推广亲西方文化努力的一部分的问题，但结论是它可能仅仅是马蒂森间谍活动的掩护。\n\n虽然没有直接的中情局资助的确凿证据，但据透露，著名的中情局掮客朱利叶斯·弗莱施曼提供了一些经济支持。马蒂森加入中情局的动机源于成为一名作家的愿望、对津贴的需求以及二战期间缺乏有意义贡献的感受。他将间谍活动视为参与其中的机会。\n\n文章强调了马蒂森在巴黎的公寓的波西米亚氛围，该公寓成为包括乔治·普林顿在内的杂志创始人聚集的中心。它还触及了马蒂森工作的潜在伦理影响，暗示他可能监视了理查德·赖特等侨民同胞。文章进一步讨论了关于《巴黎评论》政治倾向的相互矛盾的观点，有些人认为它无意中与中情局的议程保持一致。最后，文章探讨了马蒂森的中情局背景如何影响他与普林顿的关系以及他随着时间的推移参与杂志的程度。"
  },
  {
    "id": "45982162",
    "title": "Static Web Hosting on the Intel N150",
    "url": "https://it-notes.dragas.net/2025/11/19/static-web-hosting-intel-n150-freebsd-smartos-netbsd-openbsd-linux/",
    "summary": "This article benchmarks static web hosting performance on an Intel N150 mini PC across various operating systems, focusing on nginx, both HTTP and HTTPS. The author used near-default configurations and a consistent static website to measure relative performance differences.\n\nFor plain HTTP, the choice of OS matters little. Bare-metal installations of FreeBSD, OpenBSD, NetBSD, Debian, and Alpine Linux, along with FreeBSD jails and SmartOS native zones, all achieved similar throughput (around 63-64k req/s). SmartOS LX zones showed a slight performance decrease.\n\nHTTPS introduced more significant performance variations. FreeBSD excelled, achieving high throughput (around 62-63k req/s) with considerable CPU headroom. Debian and Alpine Linux also performed well, closely matching FreeBSD's throughput but with less CPU to spare. SmartOS, NetBSD, and OpenBSD showed lower throughput and reached full CPU utilization sooner. The author attributes these differences to TLS stack efficiency and hardware crypto acceleration utilization.\n\nRegarding isolation technologies, FreeBSD Jails proved remarkably efficient, closely mirroring bare-metal performance. Docker containers matched bare-metal throughput but consumed more CPU. LX zones also introduced overhead, requiring more CPU cycles than Jails to achieve similar performance. The key takeaway is that for HTTPS static hosting on this hardware, FreeBSD, Debian, and Alpine Linux offer the best balance of throughput and CPU efficiency, while for simple HTTP, the choice is largely driven by factors other than raw performance.\n",
    "chinese_title": "在英特尔N150上的静态网页托管",
    "chinese_summary": "本文对英特尔N150迷你PC上各种操作系统下的静态网站托管性能进行了基准测试，重点考察了nginx在HTTP和HTTPS两种协议下的表现。作者使用接近默认的配置和一个一致的静态网站来衡量相对性能差异。\n\n对于纯HTTP，操作系统的选择影响不大。FreeBSD、OpenBSD、NetBSD、Debian和Alpine Linux的裸机安装，以及FreeBSD jails和SmartOS原生zone，都实现了相似的吞吐量（约63-64k req/s）。SmartOS LX zone略有性能下降。\n\nHTTPS引入了更显著的性能差异。FreeBSD表现出色，实现了高吞吐量（约62-63k req/s），并且有相当大的CPU余量。Debian和Alpine Linux也表现良好，在吞吐量上与FreeBSD非常接近，但CPU剩余空间较少。SmartOS、NetBSD和OpenBSD的吞吐量较低，并且更快地达到完全CPU利用率。作者将这些差异归因于TLS堆栈效率和硬件加密加速利用率。\n\n关于隔离技术，FreeBSD Jails证明了其卓越的效率，与裸机性能非常接近。Docker容器匹配了裸机吞吐量，但消耗了更多的CPU。LX zone也引入了开销，与Jails相比，需要更多的CPU周期才能实现相似的性能。关键在于，对于该硬件上的HTTPS静态托管，FreeBSD、Debian和Alpine Linux提供了吞吐量和CPU效率的最佳平衡，而对于简单的HTTP，选择主要由原始性能以外的因素驱动。"
  },
  {
    "id": "45989469",
    "title": "PHP 8.5",
    "url": "https://stitcher.io/blog/new-in-php-85",
    "summary": "PHP 8.5, released on November 20, 2025, introduces several new features and improvements. One major addition is the **pipe operator** (`|>`), which streamlines function chaining, making code more readable. The **\"clone with\"** functionality allows assigning new values to cloned objects during the cloning process, enhancing object manipulation.\n\nThe update includes the `#[NoDiscard]` attribute to enforce the use of function return values, coupled with the `(void)` cast to suppress warnings when intentional. **Closure improvements** enable the use of static closures in constant expressions and attributes. **Fatal errors will now include backtraces**, aiding in debugging.\n\nNew built-in functions, **`array_first()` and `array_last()`**, simplify retrieving the first and last elements of arrays. A brand **new URI implementation** is introduced for easier URI parsing. The `#[DelayedTargetValidation]` attribute allows delaying validation of certain attributes to runtime for backward compatibility.\n\nSmaller changes include asymmetric visibility for static properties, attributes on compile-time constants, constructor property promotion for final properties, `#[Override]` on properties, `Dom\\Element::$outerHTML`, HEIF/HEIC support in the Exif extension, and a `FILTER_THROW_ON_FAILURE` flag for `filter_var()`.\n\nDeprecated features include non-standard cast names, backticks for `shell_exec()`, and constant redeclaration. The `disabled_classes` ini setting has also been removed.\n",
    "chinese_title": "PHP 8.5",
    "chinese_summary": "PHP 8.5于2025年11月20日发布，引入了多项新特性和改进。其中一项重大新增是**管道操作符**(`|>`)，它简化了函数链，使代码更具可读性。**\"clone with\"**功能允许在克隆过程中为克隆对象分配新值，从而增强对象操作。\n\n此更新包括`#[NoDiscard]`属性，用于强制使用函数返回值，并结合`(void)`强制转换来抑制有意忽略时的警告。**闭包改进**允许在常量表达式和属性中使用静态闭包。**致命错误现在将包含回溯**，有助于调试。\n\n新的内置函数**`array_first()`和`array_last()`**简化了数组首尾元素的检索。引入了一个全新的**URI实现**，以便更轻松地进行URI解析。`#[DelayedTargetValidation]`属性允许将某些属性的验证延迟到运行时，以实现向后兼容。\n\n较小的更改包括静态属性的非对称可见性、编译时常量上的属性、final属性的构造器属性提升、属性上的`#[Override]`、`Dom\\Element::$outerHTML`、Exif扩展中的HEIF/HEIC支持以及`filter_var()`的`FILTER_THROW_ON_FAILURE`标志。\n\n已弃用的功能包括非标准强制转换名称、用于`shell_exec()`的反引号和常量重新声明。`disabled_classes` ini 设置也已删除。"
  },
  {
    "id": "45925109",
    "title": "CLI tool to check the Git status of multiple projects",
    "url": "https://github.com/uralys/check-projects",
    "summary": "`check-projects` is a cross-platform CLI tool designed to quickly check the Git status of multiple projects, organized by categories. It identifies projects with uncommitted changes, those ahead of the remote, or other Git status issues, displaying them with concise symbols.\n\nKey features include:\n\n*   **Multi-category organization:** Group projects by team, client, or other criteria.\n*   **Nested project discovery:** Automatically scans directories for Git repositories.\n*   **Concurrent scanning:** Performs Git status checks in parallel for speed.\n*   **Flexible configuration:** Uses a YAML-based config file with local and global support.\n*   **Smart filtering:** Hides clean projects by default, focusing on those needing attention.\n*   **Cross-platform compatibility:** Works on macOS, Linux, and Windows.\n\nInstallation is straightforward, with options including a quick install script for macOS/Linux, manual installation via downloaded releases, and installation from source. Configuration involves creating and editing a `check-projects.yml` file to define project categories, paths, and ignore patterns. The tool supports exact match, wildcard, and glob patterns for ignoring specific projects. Common ignore patterns like `node_modules` and `.DS_Store` are automatically applied.\n\nUsage involves simple commands to check all projects, specific categories, or to use a custom configuration file. The tool automatically checks for updates on startup, prompting the user to install them. Development instructions are also provided, covering dependency installation, running without building, building binaries, and running tests.\n",
    "chinese_title": "检查多个项目的Git状态的CLI工具",
    "chinese_summary": "`check-projects` 是一个跨平台 CLI 工具，旨在快速检查多个按类别组织的项目的 Git 状态。它能识别具有未提交更改、领先于远程仓库或存在其他 Git 状态问题的项目，并以简洁的符号显示。\n\n主要功能包括：\n\n*   **多类别组织：** 按团队、客户或其他标准对项目进行分组。\n*   **嵌套项目发现：** 自动扫描目录以查找 Git 仓库。\n*   **并发扫描：** 并行执行 Git 状态检查以提高速度。\n*   **灵活配置：** 使用基于 YAML 的配置文件，支持本地和全局配置。\n*   **智能过滤：** 默认情况下隐藏干净的项目，专注于需要关注的项目。\n*   **跨平台兼容性：** 适用于 macOS、Linux 和 Windows。\n\n安装非常简单，包括 macOS/Linux 的快速安装脚本、通过下载的发行版进行手动安装以及从源代码安装等选项。配置包括创建和编辑 `check-projects.yml` 文件以定义项目类别、路径和忽略模式。该工具支持精确匹配、通配符和 glob 模式，以忽略特定项目。常见的忽略模式（如 `node_modules` 和 `.DS_Store`）会自动应用。\n\n用法包括简单的命令来检查所有项目、特定类别或使用自定义配置文件。该工具会在启动时自动检查更新，提示用户安装更新。还提供了开发说明，涵盖依赖项安装、无需构建即可运行、构建二进制文件和运行测试。"
  },
  {
    "id": "45993795",
    "title": "EMI spikes from gas lift chairs can cause display interference",
    "url": "https://support.displaylink.com/knowledgebase/articles/738618-display-intermittently-blanking-flickering-or-los",
    "summary": "This article addresses display issues, specifically flickering or brief blackouts, experienced by users of DisplayLink connected screens. It points to potential causes like poor quality or long video cables, which can lead to signal degradation, flicker, and distortion. The primary recommendation is to swap the video cable for a higher quality one, especially those with magnetic ferrite rings.\n\nThe article highlights a surprising cause: EMI spikes generated by gas lift office chairs when someone sits or stands, which can interfere with video signals.\n\nFurthermore, the article discusses issues with video cable converters (DisplayPort to HDMI/DVI/VGA, HDMI to VGA). It recommends using active video adapters in conjunction with video cables instead of passive ones. Active adapters contain a built-in chip that converts video signals, whereas passive adapters rely on the source to perform the conversion. Active adapters are particularly necessary when converting digital signals (DisplayPort/HDMI) to analog (VGA) unless the source can output analog over DisplayPort or HDMI.\n\nThe article includes a list of brands commonly used for testing active adapters but refrains from endorsing specific products. Finally, the article clarifies that DisplayPort and HDMI to VGA adapters are directional, requiring the respective input (DisplayPort or HDMI) to be connected to the source device.\n",
    "chinese_title": "气动升降椅的电磁干扰峰值会导致显示器干扰。",
    "chinese_summary": "本文旨在解决DisplayLink连接屏幕用户遇到的显示问题，特别是闪烁或短暂黑屏现象。文章指出，潜在原因包括质量差或过长的视频线，这可能导致信号衰减、闪烁和失真。主要建议是更换为更高质量的视频线，尤其是带有磁环的视频线。\n\n文章强调了一个令人惊讶的原因：升降办公椅在人坐下或站起时产生的电磁干扰尖峰，这可能会干扰视频信号。\n\n此外，文章还讨论了视频线转换器（DisplayPort转HDMI/DVI/VGA，HDMI转VGA）的问题。建议配合视频线使用有源视频适配器，而不是无源适配器。有源适配器包含内置芯片，可转换视频信号，而无源适配器则依赖于信号源执行转换。除非信号源可以通过DisplayPort或HDMI输出模拟信号，否则在将数字信号（DisplayPort/HDMI）转换为模拟信号（VGA）时，有源适配器尤其必要。\n\n文章列出了常用于测试有源适配器的品牌列表，但未推荐特定产品。最后，文章阐明DisplayPort和HDMI转VGA适配器是定向的，需要将相应的输入端（DisplayPort或HDMI）连接到源设备。"
  },
  {
    "id": "45994711",
    "title": "Switching to Rust's own mangling scheme on nightly",
    "url": "https://blog.rust-lang.org/2025/11/20/switching-to-v0-mangling-on-nightly/",
    "summary": "Starting with the nightly-2025-11-21 release, `rustc` will default to its own \"v0\" symbol mangling scheme instead of the legacy C++-based scheme. Symbol mangling ensures unique names for functions and other items in compiled code, crucial for avoiding linking conflicts, especially with generics and modules.\n\nThe legacy mangling scheme has limitations: loss of generic parameter information, inconsistencies, platform incompatibilities due to '.' characters, reliance on compiler internals, and difficulty distinguishing Rust from C++ symbols, hindering debugging and profiling.\n\nThe new \"v0\" scheme addresses these issues with: unambiguous encoding, reversible generic parameter encoding, decoder-friendly design, independence from compiler internals, and compatibility with various platforms using only A-Z, a-z, 0-9, and _.\n\nWhile \"v0\" symbols might be slightly larger, modern linkers like `lld` mitigate the impact. Users of outdated tools encountering mangled symbols can use `rustfilt` for demangling.\n\nTo revert to the legacy scheme, use the `-Csymbol-mangling-version=legacy -Zunstable-options` flag. Tool maintainers can integrate Rust and C implementations of a v0 symbol demangler from the `rust-lang/rustc-demangle` repository. Users who wish to use the v0 mangling scheme on stable or beta channels today can use `-Csymbol-mangling-version=v0`. The team encourages users to report any issues encountered on GitHub.\n",
    "chinese_title": "在 nightly 版本上切换到 Rust 自身的名称修饰方案",
    "chinese_summary": "从 nightly-2025-11-21 版本开始，`rustc` 将默认使用其自身的 \"v0\" 符号修饰方案，而不是传统的基于 C++ 的方案。符号修饰确保编译代码中函数和其他项具有唯一的名称，这对于避免链接冲突至关重要，尤其是在使用泛型和模块时。\n\n传统的修饰方案存在局限性：泛型参数信息丢失、不一致性、“.”字符导致平台不兼容、依赖编译器内部实现，以及难以区分 Rust 和 C++ 符号，从而阻碍调试和性能分析。\n\n新的 \"v0\" 方案通过以下方式解决了这些问题：明确的编码、可逆的泛型参数编码、对解码器友好的设计、独立于编译器内部实现，以及仅使用 A-Z、a-z、0-9 和 _，与各种平台兼容。\n\n虽然 \"v0\" 符号可能会略大，但像 `lld` 这样的现代链接器可以减轻这种影响。遇到修饰符号的过时工具的用户可以使用 `rustfilt` 进行反修饰。\n\n要恢复到传统方案，请使用 `-Csymbol-mangling-version=legacy -Zunstable-options` 标志。工具维护者可以从 `rust-lang/rustc-demangle` 仓库集成 Rust 和 C 实现的 v0 符号反修饰器。希望今天在稳定或 Beta 通道上使用 v0 修饰方案的用户可以使用 `-Csymbol-mangling-version=v0`。 团队鼓励用户在 GitHub 上报告遇到的任何问题。"
  },
  {
    "id": "45980106",
    "title": "How to stay sane in a world that rewards insanity",
    "url": "https://www.joanwestenberg.com/p/how-to-stay-sane-in-a-world-that-rewards-insanity",
    "summary": "J.A. Westenberg's article, \"How to Stay Sane in a World That Rewards Insanity,\" explores the troubling trend of extremism being rewarded in modern society. The author observes that people are increasingly adopting extreme positions because they provide immediate benefits like certainty, community, attention, and influence. While reasonableness and nuance are often ignored, polarization becomes a successful \"growth hack.\"\n\nHowever, Westenberg argues that this short-term optimization has severe consequences. It creates a society where changing one's mind is impossible, uncertainty is taboo, and conversations become performative. This ultimately hinders problem-solving and traps individuals in ideological echo chambers, unable to escape without losing their established positions.\n\nThe article then offers practical advice for maintaining sanity in this environment. First, diversify your information diet by exposing yourself to articulate versions of opposing viewpoints. Second, distinguish between stakes and truth, avoiding the tribalistic urge to defend every argument made by your chosen side. Finally, seek out communities that value humility and truth-seeking over tribal loyalty and status games.\n\nWhile choosing sanity means sacrificing immediate gains like reach and influence, the author contends that the long-term benefits, such as clear thinking, adaptability, and genuine relationships, are worth the trade-off. Extremism offers a fast start but a limited ceiling, whereas sanity provides a slow start with unlimited growth potential, ultimately proving more valuable in the long run. The world rewards insanity in the short term, but measuring over a longer timeframe reveals the true value of sanity.\n",
    "chinese_title": "如何在奖励疯狂的世界里保持理智",
    "chinese_summary": "J.A. Westenberg 的文章《如何在奖励疯狂的世界中保持理智》探讨了现代社会中极端主义被奖励的令人不安的趋势。作者观察到，人们越来越倾向于采取极端立场，因为这些立场能带来诸如确定性、社群归属、关注和影响力等即时利益。虽然理性和细微差别往往被忽视，但两极分化却成了一种成功的“增长秘诀”。\n\n然而，Westenberg 认为这种短期优化会带来严重的后果。它创造了一个社会，在其中改变主意是不可能的，不确定性是禁忌，对话也变得具有表演性。这最终阻碍了问题的解决，并将个人困在意识形态的回音室中，无法在不失去既定立场的情况下逃脱。\n\n文章随后为在这种环境中保持理智提供了实用的建议。首先，通过接触不同观点的清晰表达来多样化你的信息摄入。其次，区分利害关系和真相，避免部落主义的冲动，为自己选择的阵营提出的每一个论点辩护。最后，寻找重视谦逊和寻求真理而非部落忠诚和地位竞争的社群。\n\n虽然选择理智意味着牺牲诸如影响力和触及范围等即时收益，但作者认为，诸如清晰的思维、适应性和真诚的关系等长期利益是值得的。极端主义提供了一个快速的起点，但上限有限，而理智提供了一个缓慢的起点，但具有无限的增长潜力，最终证明从长远来看更有价值。世界在短期内奖励疯狂，但从更长的时间维度衡量，才能揭示理智的真正价值。"
  },
  {
    "id": "45903273",
    "title": "The Lucas-Lehmer Prime Number Test",
    "url": "https://www.scientificamerican.com/article/how-to-identify-a-prime-number-without-a-computer/",
    "summary": "This article discusses the Lucas-Lehmer primality test, a method developed by Édouard Lucas in the 19th century to identify Mersenne primes (numbers of the form 2<sup>p</sup> - 1, where p is prime). Lucas developed the test as a way to determine if the large number 2<sup>127</sup> - 1 was prime without the aid of a computer.\n\nThe Lucas-Lehmer test involves creating a sequence where the first term (s<sub>0</sub>) is 4, and subsequent terms are calculated as s<sub>n</sub> = s<sup>2</sup><sub>n-1</sub> - 2. 2<sup>p</sup> - 1 is prime if and only if the p-2<sup>nd</sup> term of the sequence (s<sub>p-2</sub>) is divisible by 2<sup>p</sup> - 1. To manage the rapid growth of the sequence terms, a trick is used where each term is divided by the Mersenne number, and the remainder is used for the next calculation.\n\nThe article uses the example of 2<sup>5</sup>-1 (31) to illustrate how the test works. Though Lucas developed the test, Derrick Henry Lehmer later proved its reliability. The test is rooted in the research of Évariste Galois, who studied symmetries in mathematical objects and finite number fields. These fields, containing integers from 0 to p-1, are fields if and only if p is a prime number. Lucas exploited these properties to develop his primality test. The article concludes with a call to support science journalism.\n",
    "chinese_title": "卢卡斯-莱默素数检验",
    "chinese_summary": "本文探讨了卢卡斯-莱默素数检验法，这是Édouard Lucas在19世纪开发的一种识别梅森素数（形如2<sup>p</sup> - 1的数，其中p是素数）的方法。 Lucas开发该测试是为了在没有计算机的帮助下确定大数2<sup>127</sup> - 1是否为素数。\n\n卢卡斯-莱默检验法涉及创建一个序列，其中第一项（s<sub>0</sub>）是4，后续项计算为s<sub>n</sub> = s<sup>2</sup><sub>n-1</sub> - 2。 当且仅当序列的第p-2项（s<sub>p-2</sub>）可被2<sup>p</sup> - 1整除时，2<sup>p</sup> - 1为素数。 为了控制序列项的快速增长，使用了一种技巧，将每一项除以梅森数，并将余数用于下一次计算。\n\n本文使用2<sup>5</sup>-1 (31)的例子来说明该测试的工作原理。 虽然Lucas开发了该测试，但Derrick Henry Lehmer后来证明了它的可靠性。 该测试源于Évariste Galois的研究，他研究了数学对象和有限数域中的对称性。 这些包含从0到p-1的整数的域，当且仅当p是素数时，才是域。 Lucas利用这些性质开发了他的素数检验法。 文章最后呼吁支持科学新闻。"
  },
  {
    "id": "45934665",
    "title": "Vortex: An extensible, state of the art columnar file format",
    "url": "https://github.com/vortex-data/vortex",
    "summary": "Vortex is a next-generation, open-source columnar file format designed for high-performance data processing, particularly on object storage. A Linux Foundation (LF AI & Data) project under the Apache-2.0 license, Vortex aims to be the fastest and most extensible format for building data systems. It boasts significantly faster random access reads, scans, and writes compared to formats like Apache Parquet, while maintaining similar compression ratios.\n\nVortex's architecture is modeled after Apache DataFusion, emphasizing extensibility through pluggable encodings, type systems, compression strategies, and layout strategies. It offers seamless integration with Apache Arrow and supports various integrations including DataFusion, DuckDB, Spark, Pandas, and Polars. Iceberg integration is planned.\n\nKey features include a clear separation of logical schema and physical layout, zero-copy Arrow integration, extensible and optimized encodings, cascading compression, optimized compute kernels, and rich lazy-loaded statistics. The file format is considered stable from release 0.36.0.\n\nThe document provides quick start instructions for installation via Rust, Python, and a command-line UI tool called `vx`. It also offers guidance on development setup, performance optimization using MiMalloc, and contributing guidelines. Furthermore, it acknowledges the research and open-source projects that have inspired Vortex, including Apache Arrow, DataFusion, DuckDB, and others.\n",
    "chinese_title": "旋涡：一种可扩展的、最先进的列式文件格式",
    "chinese_summary": "Vortex：面向高性能数据处理的新一代开源列式文件格式。作为 Linux 基金会（LF AI & Data）下 Apache-2.0 许可的项目，Vortex 旨在成为构建数据系统速度最快、可扩展性最强的格式。与 Apache Parquet 等格式相比，它拥有明显更快的随机访问读取、扫描和写入速度，同时保持相似的压缩比。\n\nVortex 的架构以 Apache DataFusion 为蓝本，强调通过可插拔的编码、类型系统、压缩策略和布局策略实现可扩展性。它提供与 Apache Arrow 的无缝集成，并支持各种集成，包括 DataFusion、DuckDB、Spark、Pandas 和 Polars。 Iceberg 集成正在计划中。\n\n主要功能包括逻辑模式和物理布局的清晰分离、零拷贝 Arrow 集成、可扩展和优化的编码、级联压缩、优化的计算内核以及丰富的延迟加载统计信息。该文件格式从 0.36.0 版本起被认为是稳定的。\n\n本文档提供了通过 Rust、Python 以及名为 `vx` 的命令行 UI 工具进行安装的快速入门说明。它还提供了有关开发设置、使用 MiMalloc 进行性能优化以及贡献指南的指导。此外，它还感谢激发 Vortex 灵感的研究和开源项目，包括 Apache Arrow、DataFusion、DuckDB 等。"
  },
  {
    "id": "45984112",
    "title": "Measuring political bias in Claude",
    "url": "https://www.anthropic.com/news/political-even-handedness",
    "summary": "This article from Anthropic details their efforts to measure and mitigate political bias in their AI model, Claude. The core principle they aim for is \"political even-handedness,\" ensuring Claude treats opposing political viewpoints with equal respect and thoroughness.\n\nAnthropic employs various strategies to achieve this, including:\n\n*   **System Prompts:** Instructions that guide Claude to avoid unsolicited political opinions, maintain factual accuracy, present the best case for different viewpoints, and use neutral language.\n*   **Character Training:** Reinforcement learning that rewards Claude for exhibiting traits like objectivity, fairness, and avoiding strong partisan stances.\n\nTo evaluate Claude's even-handedness, Anthropic developed an automated \"Paired Prompts\" method. This involves prompting Claude with opposing viewpoints on the same politically charged topic and then rating the responses based on:\n\n*   **Even-handedness:** Depth and engagement with both sides.\n*   **Opposing Perspectives:** Acknowledgment of counterarguments.\n*   **Refusals:** Willingness to engage with the topic.\n\nThey tested Claude Sonnet 4.5 and Claude Opus 4.1 against models from other providers (GPT-5, Gemini 2.5 Pro, Grok 4, and Llama 4) using 1,350 paired prompts. The results showed that Claude Sonnet 4.5 and Opus 4.1 performed similarly to Gemini 2.5 Pro and Grok 4 in even-handedness, and better than GPT-5 and Llama 4. Claude models also exhibited low refusal rates. They also used other models to check the validity of the evaluations, which showed largely similar results.\n\nThe article concludes by acknowledging limitations, such as focusing on US political discourse and single-turn interactions. They have open-sourced the evaluation methodology and encourage further research to improve political bias measurement in AI.\n",
    "chinese_title": "衡量Claude中的政治偏见",
    "chinese_summary": "Anthropic衡量并缓解Claude中政治偏见的努力\n\nAnthropic的文章详细介绍了他们衡量并缓解其AI模型Claude中政治偏见的努力。他们追求的核心原则是“政治公正”，确保Claude以同等的尊重和严谨性对待对立的政治观点。\n\nAnthropic采用多种策略来实现这一目标，包括：\n\n*   **系统提示：** 指导Claude避免主动发表政治观点、保持事实准确性、呈现不同观点的最佳论据以及使用中立语言的指令。\n*   **角色训练：** 强化学习，奖励Claude表现出客观性、公平性以及避免强烈党派立场等特征。\n\n为了评估Claude的公正性，Anthropic开发了一种自动化的“配对提示”方法。该方法包括用同一政治敏感话题的对立观点提示Claude，然后根据以下标准评估其回复：\n\n*   **公正性：** 对双方的深度和参与度。\n*   **对立视角：** 对反驳论点的承认。\n*   **拒绝：** 参与该话题的意愿。\n\n他们使用1350个配对提示测试了Claude Sonnet 4.5和Claude Opus 4.1，并与来自其他提供商的模型（GPT-5、Gemini 2.5 Pro、Grok 4和Llama 4）进行了比较。结果表明，Claude Sonnet 4.5和Opus 4.1在公正性方面与Gemini 2.5 Pro和Grok 4表现相似，优于GPT-5和Llama 4。Claude模型也表现出较低的拒绝率。他们还使用其他模型来检查评估的有效性，结果显示大致相似。\n\n文章最后承认了局限性，例如侧重于美国政治论述和单轮互动。他们已经开源了评估方法，并鼓励进一步研究以改进AI中政治偏见的衡量。"
  },
  {
    "id": "45985506",
    "title": "Gaming on Linux has never been more approachable",
    "url": "https://www.theverge.com/tech/823337/switching-linux-gaming-desktop-cachyos",
    "summary": "Nathan Edwards, a tech reviewer, is planning to switch his gaming PC from Windows 11 to Linux, specifically CachyOS, an Arch-based distro optimized for gaming. He's motivated by dissatisfaction with Windows' increasing bloat, intrusive features, and perceived push towards unnecessary services like Copilot and Edge, alongside Microsoft ending support for Windows 10.\n\nWhile acknowledging that Windows 11 currently works fine on his desktop, Edwards wants to experiment with Linux gaming due to its improved viability, particularly after Valve's efforts with the Steam Deck and the success of Linux distros like Bazzite on handheld PCs. He also cites positive experiences with Bazzite on the Framework Desktop.\n\nEdwards has limited Linux experience beyond using it for specific tasks like setting up Homebridge, Beepy, and running virtual machines for keyboard firmware. He understands the potential time commitment and challenges involved in troubleshooting issues, given Linux's relatively small share of the PC gaming market (around 3% according to Steam Hardware & Software Survey).\n\nDespite the risks, he feels it's a worthwhile experiment, partly because he has alternative machines to work on if his desktop encounters problems. Edwards intends to document his experience and potentially report back on his success or failure. He is encouraged by positive feedback about gaming on Linux from colleagues, including the Dual Boot Diaries podcast.\n",
    "chinese_title": "在Linux上玩游戏从未如此容易。",
    "chinese_summary": "科技评测员内森·爱德华兹计划将其游戏PC从Windows 11切换到Linux，具体而言是CachyOS，这是一个基于Arch的、为游戏优化的发行版。 促使他做出这一决定的原因是，他对Windows日益臃肿、侵入性功能，以及强制推送Copilot和Edge等不必要服务的行为感到不满，同时微软也即将停止对Windows 10的支持。\n\n虽然爱德华兹承认Windows 11目前在他的台式机上运行良好，但他想尝试Linux游戏，因为它的可行性有所提高，特别是在Valve的Steam Deck以及Bazzite等Linux发行版在掌机上取得成功之后。 他还提到在Framework Desktop上使用Bazzite的积极体验。\n\n除了用于设置Homebridge、Beepy以及运行键盘固件虚拟机等特定任务外，爱德华兹的Linux经验有限。 他明白考虑到Linux在PC游戏市场中相对较小的份额（根据Steam硬件和软件调查，约为3%），解决问题可能需要投入时间和面临挑战。\n\n尽管存在风险，他认为这是一个值得进行的实验，部分原因是如果他的桌面电脑出现问题，他还有其他机器可以使用。 爱德华兹计划记录他的经历，并可能报告他的成功或失败。 他受到同事，包括Dual Boot Diaries播客，对Linux游戏积极反馈的鼓励。"
  },
  {
    "id": "45987027",
    "title": "Linux Career Opportunities in 2025: Skills in High Demand",
    "url": "https://www.linuxcareers.com/resources/blog/2025/11/linux-career-opportunities-in-2025-skills-in-high-demand/",
    "summary": "Without the full content of the article, I can only provide a general summary based on the title.  Given the title \"Linux Career Opportunities in 2025: Skills in High Demand\", a reasonable summary would be:\n\nThis article likely explores the promising landscape of Linux-related career opportunities anticipated in 2025. It probably identifies specific skills expected to be highly sought after by employers in the Linux job market. Key areas of focus will likely include:\n\n*   **Specific Linux Distributions and Technologies:** The article will likely highlight in-demand distributions (e.g., Red Hat, Ubuntu, SUSE) and specific Linux technologies like containers (Docker, Kubernetes), cloud computing (AWS, Azure, GCP), automation tools (Ansible, Chef, Puppet), and security practices.\n\n*   **Job Roles and Responsibilities:** Expect discussion of popular Linux job titles such as Linux System Administrator, DevOps Engineer, Cloud Engineer, Security Engineer, and Embedded Systems Engineer. The article may describe the typical responsibilities associated with these roles.\n\n*   **Essential Skills:** The article will almost certainly emphasize the importance of core Linux administration skills, scripting languages (Python, Bash), networking fundamentals, virtualization, and cloud computing experience. Security knowledge, including hardening Linux systems and implementing security best practices, will likely be highlighted.\n\n*   **Future Trends:** The article could touch on emerging trends like edge computing, serverless architectures, and the growing importance of open-source technologies and how they relate to Linux skills.\n\nEssentially, the article aims to inform readers about where the Linux job market is heading and what skills they should develop to be competitive in 2025. It helps potential candidates focus their training and development efforts.\n",
    "chinese_title": "2025年Linux职业机遇：高需求技能",
    "chinese_summary": "在没有文章全文的情况下，我只能根据标题提供一个大致的概要。 鉴于标题为“2025年Linux职业机遇：高需求技能”，一个合理的概要是：\n\n这篇文章很可能探讨了预计在2025年与Linux相关的职业机遇的光明前景。它可能会确定Linux就业市场中雇主们高度需求的特定技能。重点领域可能包括：\n\n*   **特定的Linux发行版和技术：** 文章可能会强调需求量大的发行版（例如，Red Hat、Ubuntu、SUSE）和特定的Linux技术，如容器（Docker、Kubernetes）、云计算（AWS、Azure、GCP）、自动化工具（Ansible、Chef、Puppet）和安全实践。\n\n*   **职位和职责：** 预计会讨论流行的Linux职位名称，如Linux系统管理员、DevOps工程师、云工程师、安全工程师和嵌入式系统工程师。文章可能会描述与这些角色相关的典型职责。\n\n*   **必备技能：** 文章几乎肯定会强调核心Linux管理技能、脚本语言（Python、Bash）、网络基础知识、虚拟化和云计算经验的重要性。安全知识，包括强化Linux系统和实施安全最佳实践，很可能会被强调。\n\n*   **未来趋势：** 文章可能会涉及新兴趋势，如边缘计算、无服务器架构，以及开源技术日益增长的重要性，以及它们与Linux技能的关联。\n\n总而言之，这篇文章旨在告知读者Linux就业市场的未来走向，以及他们应该发展哪些技能才能在2025年具有竞争力。它有助于潜在的求职者集中他们的培训和发展工作。"
  },
  {
    "id": "45983700",
    "title": "AI is a front for consolidation of resources and power",
    "url": "https://www.chrbutler.com/what-ai-is-really-for",
    "summary": "This essay argues that the hype surrounding AI is likely overblown, potentially masking a deeper agenda related to resource consolidation and power. The author, drawing from experience in design and AI ventures, contends that AI's usefulness is often limited to small-scale applications, while larger, transformative applications are costly and inefficient.\n\nThe author suggests two possible scenarios: a classic bubble where AI's value doesn't match its investment, and a more concerning scenario where those profiting from AI are aware of its limitations but use it to achieve other goals. The essay criticizes the financial market's dependence on AI, highlighting the lack of a viable monetization model and echoing concerns raised by Ed Zitron.\n\nBeyond the financial aspect, the author warns about AI's potential to exacerbate societal problems like misinformation and the erosion of trust. The core argument posits that the pursuit of AI, particularly AGI, may be a smokescreen for acquiring vast amounts of land, energy, and water resources. Datacenters, essential for AI, require these resources and lead to political deals that grant immense power to AI companies. This concentration of power, the author argues, creates an imbalance where private companies can wield more influence than elected governments, leading to a new form of \"Privatism\" that erodes national sovereignty from within. The author concludes by urging critical examination of the motivations and consequences surrounding AI, warning that regardless of AI's ultimate success, the power shifts and resource consolidation will fundamentally alter society.\n",
    "chinese_title": "人工智能是资源和权力整合的幌子。",
    "chinese_summary": "关于人工智能炒作的真相：资源整合与权力之争"
  },
  {
    "id": "45985890",
    "title": "The patent office is about to make bad patents untouchable",
    "url": "https://www.eff.org/deeplinks/2025/11/patent-office-about-make-bad-patents-untouchable",
    "summary": "The Electronic Frontier Foundation (EFF) is urging supporters to oppose proposed rule changes by the U.S. Patent and Trademark Office (USPTO) that would significantly restrict the public's ability to challenge questionable patents through the Inter Partes Review (IPR) process. The EFF argues these changes would favor patent trolls, making it extremely difficult and expensive for developers, small companies, and nonprofits to defend themselves against abusive patent lawsuits.\n\nThe IPR process, overseen by the Patent Trial and Appeal Board (PTAB), offers a relatively affordable and efficient avenue to challenge patents, providing a fresh, expert look at their validity, particularly when new prior art emerges. The EFF highlights examples like the \"Podcasting Patent\" and cases involving SportBrain and Shipping & Transit, where IPR successfully invalidated broad patents that had been used to target numerous businesses.\n\nThe proposed rule changes include: requiring defendants to forfeit the right to challenge a patent's validity in court if they file an IPR; blocking IPR challenges if a patent has survived a prior validity fight, even with new evidence; and preventing IPR if a district court case is projected to move faster than the PTAB.\n\nThe EFF contends that these changes would effectively dismantle IPR, making bad patents \"untouchable\" and forcing defendants to rely on costly and lengthy district court battles. They argue that Congress created IPR to provide an accessible way to correct Patent Office errors and that the USPTO's proposed rules undermine this intent. The EFF emphasizes that the public has a right to challenge bad patents and encourages supporters to submit public comments opposing the rule changes.\n",
    "chinese_title": "专利局即将让糟糕的专利变得不可触碰。",
    "chinese_summary": "电子前哨基金会呼吁支持者反对美国专利商标局拟议的规则变更，该变更将大大限制公众通过双方复审（IPR）程序质疑可疑专利的能力。电子前哨基金会认为，这些变更将有利于专利流氓，使得开发者、小公司和非营利组织极难且代价高昂地抵御滥用专利诉讼。\n\n由专利审判和上诉委员会（PTAB）监督的IPR程序提供了一种相对经济高效的途径来质疑专利，对专利的有效性进行了全新的专家审查，尤其是在出现新的现有技术时。电子前哨基金会重点介绍了诸如“播客专利”以及涉及SportBrain和Shipping & Transit的案例，在这些案例中，IPR成功地使被用来针对众多企业的广泛专利无效。\n\n拟议的规则变更包括：要求被告如果提交IPR，则放弃在法庭上质疑专利有效性的权利；即使有新的证据，如果专利在先前的有效性斗争中幸存下来，则阻止IPR挑战；如果地区法院案件预计比PTAB进展更快，则阻止IPR。\n\n电子前哨基金会认为，这些变更将有效地摧毁IPR，使不良专利“不可触碰”，并迫使被告依赖代价高昂且漫长的地区法院诉讼。他们认为，国会创建IPR是为了提供一种可访问的方式来纠正专利局的错误，而美国专利商标局拟议的规则破坏了这一意图。电子前哨基金会强调，公众有权质疑不良专利，并鼓励支持者提交公众意见反对这些规则变更。"
  },
  {
    "id": "45977744",
    "title": "A $1k AWS mistake",
    "url": "https://www.geocod.io/code-and-coordinates/2025-11-18-the-1000-aws-mistake/",
    "summary": "Mathias Hansen recounts a costly AWS mistake involving Geocodio's S3 data transfers. Despite assuming free data transfer between EC2 and S3, and free S3 ingress, they racked up over $1,000 in NAT Gateway charges. This was due to S3 traffic, even within the same region, routing through the NAT Gateway by default in VPCs, incurring a $0.045/GB charge.\n\nThe solution was implementing VPC Gateway Endpoints for S3, which provide a free and direct route from the VPC to S3, bypassing the NAT Gateway. Hansen emphasizes the importance of AWS Cost Anomaly Detection, which alerted them to the issue quickly.\n\nHe highlights the complexity of AWS networking and cautions against assumptions, recommending thorough testing even with seemingly \"free\" services. He advises users to always validate their assumptions and to actively leverage VPC Endpoints for S3 and DynamoDB when using EC2 instances within a VPC with a NAT Gateway. Finally, the article advocates for continuous learning and vigilance in managing cloud infrastructure costs, sharing resources about VPC Endpoints and managing AWS costs.\n",
    "chinese_title": "一个千美元的 AWS 错误",
    "chinese_summary": "马蒂亚斯·汉森讲述了因Geocodio的S3数据传输而导致的一项代价高昂的AWS错误。他们原本以为EC2和S3之间的数据传输以及S3的数据流入都是免费的，但却产生了超过1000美元的NAT网关费用。这是因为即使在同一区域内，S3流量默认也会通过VPC中的NAT网关路由，从而产生0.045美元/GB的费用。\n\n解决方案是为S3实施VPC网关终端节点，该终端节点提供从VPC到S3的免费直接路由，绕过NAT网关。汉森强调了AWS成本异常检测的重要性，它迅速提醒了他们这个问题。\n\n他强调了AWS网络的复杂性，并告诫不要妄下假设，建议即使对于看似“免费”的服务也要进行彻底的测试。他建议用户始终验证他们的假设，并且在使用带有NAT网关的VPC中的EC2实例时，积极利用S3和DynamoDB的VPC终端节点。最后，本文倡导持续学习和保持警惕，以管理云基础设施成本，并分享了关于VPC终端节点和管理AWS成本的资源。"
  },
  {
    "id": "45989650",
    "title": "Implementation of a Java Processor on a FPGA (2016)",
    "url": "https://mavmatrix.uta.edu/electricaleng_theses/337/",
    "summary": "This 2016 Master's thesis by Omkar Joshi explores the implementation of a Java processor on a Field Programmable Gate Array (FPGA). The core motivation is to improve the performance of Java applications by eliminating the interpretation and translation overhead associated with the Java Virtual Machine (JVM). The JVM, while enabling platform independence through bytecodes, introduces performance bottlenecks.\n\nJoshi proposes a processor where Java bytecodes are the native instructions, thus bypassing the JVM's interpretation stage. This approach also allows for pre-processing class files to eliminate certain run-time dependencies, further optimizing performance.\n\nThe choice of FPGA is crucial, as it allows for flexibility and adaptability. The Java Machine can be updated to comply with the latest Java standards even after deployment. Furthermore, the FPGA platform enables application-specific hardware modules to be added, tailoring the processor to particular workloads and enhancing performance even more.\n\nThe thesis highlights the potential of FPGA-based Java processors to offer a significant performance improvement over traditional JVM-based execution, while retaining the flexibility and portability benefits of Java. The research contributes to the field by exploring a hardware-based solution to improve Java performance and adapt to evolving Java standards and application demands.\n",
    "chinese_title": "在FPGA上实现Java处理器 (2016)",
    "chinese_summary": "Omkar Joshi 2016年硕士论文探讨了在现场可编程门阵列（FPGA）上实现Java处理器。其核心动机是通过消除与Java虚拟机（JVM）相关的解释和转换开销来提高Java应用程序的性能。JVM虽然通过字节码实现了平台独立性，但也引入了性能瓶颈。\n\nJoshi提出了一种处理器，其中Java字节码是本地指令，从而绕过了JVM的解释阶段。这种方法还允许预处理类文件以消除某些运行时依赖项，从而进一步优化性能。\n\nFPGA的选择至关重要，因为它具有灵活性和适应性。即使在部署后，也可以更新Java机器以符合最新的Java标准。此外，FPGA平台能够添加特定于应用程序的硬件模块，从而根据特定的工作负载定制处理器，并进一步提高性能。\n\n该论文强调了基于FPGA的Java处理器在传统基于JVM的执行之上提供显著性能改进的潜力，同时保留了Java的灵活性和可移植性优势。该研究通过探索一种基于硬件的解决方案来提高Java性能并适应不断发展的Java标准和应用程序需求，为该领域做出了贡献。"
  },
  {
    "id": "45977900",
    "title": "What Killed Perl?",
    "url": "https://entropicthoughts.com/what-killed-perl",
    "summary": "This article addresses the question of \"What Killed Perl?\" by arguing that Perl is not dead, citing CPAN usage statistics that show its popularity is comparable to the dotcom bubble era. However, it acknowledges a decline in new users since 2011 and explores the reasons why.\n\nThe author dismisses the idea that Raku (formerly Perl 6) siphoned momentum, arguing that Perl's established infrastructure meant it would require ongoing maintenance regardless of Raku's success. The author suggests two primary factors contributing to Perl's decline in popularity: a generational shift in programming backgrounds, and the increased accessibility of alternative languages. The older generation, familiar with Unix tools, naturally adopted Perl, while newer programmers favored languages like Python. Furthermore, the rise of package managers simplified the adoption of new languages, removing Perl's historical advantage as a readily available option.\n\nA comment from \"Higuita\" offers further insights, highlighting the difficulty new users face with Perl's regex syntax, lack of enforced code formatting standards leading to unreadable code, and the \"write once, read never\" characteristic due to its flexible syntax. The comment also attributes the Perl 6 rename as contributing to uncertainty and a perceived decline in Perl 5. Furthermore, the comment attributes that the \"quick and dirty\" nature of many Perl solutions contributes to outdated and hard-to-maintain legacy code, ultimately harming Perl's image.\n",
    "chinese_title": "是什么扼杀了Perl？",
    "chinese_summary": "本文探讨了“是什么杀死了 Perl？”这个问题，通过引用 CPAN 的使用统计数据表明 Perl 并未消亡，其流行程度与互联网泡沫时代相当。然而，文章也承认自 2011 年以来，新用户数量有所下降，并探讨了其原因。\n\n作者驳斥了 Raku（原 Perl 6）吸走动力的观点，认为 Perl 既有的基础设施意味着无论 Raku 是否成功，它都需要持续维护。作者提出了两个导致 Perl 流行度下降的主要因素：编程背景的代际转变以及替代语言的日益普及。熟悉 Unix 工具的年长一代自然地采用了 Perl，而较新的程序员则更喜欢 Python 等语言。此外，包管理器的兴起简化了新语言的采用，消除了 Perl 作为一种易于获得的选项的过去优势。\n\n来自“Higuita”的评论提供了进一步的见解，强调了新用户在 Perl 的正则表达式语法方面面临的困难，缺乏强制性的代码格式标准导致代码难以阅读，以及由于其灵活的语法而产生的“一次编写，永不阅读”的特性。该评论还认为 Perl 6 的重命名导致了不确定性，并导致人们认为 Perl 5 在衰落。此外，该评论认为许多 Perl 解决方案的“快速而肮脏”的性质导致了过时且难以维护的遗留代码，最终损害了 Perl 的形象。"
  },
  {
    "id": "45904178",
    "title": "Why CUDA translation wont unlock AMD",
    "url": "https://eliovp.com/why-cuda-translation-wont-unlock-amds-real-potential/",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "CUDA翻译为何无法解放AMD",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "45958596",
    "title": "What influence has the BBC had on history?",
    "url": "https://www.historytoday.com/archive/head-head/what-influence-has-bbc-had-history",
    "summary": "This article from History Today examines the significant influence the BBC has had on history. Established in 1922 with the mission to \"inform, educate, and entertain,\" the BBC's century-long existence has been a powerful force shaping events.\n\nThe author, David Hendy, argues that the BBC's impact goes beyond simply reflecting contemporary events. He echoes Asa Briggs' sentiment that writing the history of the BBC is akin to writing the history of everything. Radio and television, as represented by the BBC, act as conduits through which life's dramas, including wars, disasters, and sporting events, are witnessed. Therefore, the BBC hasn't just been a recorder of history but an active participant and shaper of it.\n\nUnfortunately, the article's full content is locked behind a subscription paywall, preventing a more detailed understanding of the specific examples and arguments presented to support this central claim.\n",
    "chinese_title": "BBC对历史产生了什么影响？",
    "chinese_summary": "历史频道的这篇文章探讨了英国广播公司（BBC）对历史产生的重大影响。 BBC成立于1922年，其使命是“告知、教育和娱乐”，一个世纪以来一直是塑造事件的强大力量。\n\n作者大卫·亨迪认为，英国广播公司的影响不仅仅是反映当代事件。他呼应了阿萨·布里格斯的观点，即撰写英国广播公司的历史，就如同撰写一切的历史。以英国广播公司为代表的广播和电视，充当了见证生活戏剧（包括战争、灾难和体育赛事）的渠道。 因此，英国广播公司不仅是历史的记录者，而且是历史的积极参与者和塑造者。\n\n遗憾的是，该文章的全部内容被锁定在付费墙后面，无法更详细地了解为支持这一中心论点而提供的具体例子和论据。"
  },
  {
    "id": "45984970",
    "title": "Microsoft AI CEO pushes back against critics after recent Windows AI backlash",
    "url": "https://www.windowscentral.com/microsoft/windows-11/microsoft-ai-ceo-pushes-back-against-critics-after-recent-windows-ai-backlash-the-fact-that-people-are-unimpressed-is-mindblowing-to-me",
    "summary": "Microsoft AI CEO Mustafa Suleyman is facing criticism after responding to user backlash regarding the company's push for AI integration in Windows, particularly with Copilot. Suleyman expressed surprise at users being \"unimpressed\" with AI capabilities, citing the progress from simple phone games to fluent AI conversations and image generation.\n\nThis response comes after Windows president Pavan Davuluri received negative feedback for his vision of Windows as an \"agentic OS,\" leading him to restrict comments on his post. A report from The Verge also highlighted Copilot's current shortcomings, stating it often fails to meet the seamless performance advertised by Microsoft.\n\nCritics argue that Microsoft's focus on AI is misplaced, especially when Windows is facing fundamental issues. They feel the company is forcing AI into every aspect of the UI instead of addressing existing problems. While Davuluri acknowledged the need to improve Windows for power users and developers, skepticism remains about Microsoft's commitment to non-AI related improvements, given the company's recent shift towards becoming an \"AI company.\" User pushback against AI integration continues to grow, impacting Microsoft's vision for the future of Windows.\n",
    "chinese_title": "微软人工智能主管反驳近期Windows人工智能负面评价。",
    "chinese_summary": "微软人工智能首席执行官穆斯塔法·苏莱曼因回应用户对其在Windows中强推人工智能集成（尤其是Copilot）的强烈反对而面临批评。 苏莱曼对用户对人工智能能力“印象不深”表示惊讶，并列举了从简单的手机游戏到流畅的人工智能对话和图像生成的进步。\n\n在此之前，Windows总裁帕万·达武卢里因其将Windows视为“代理操作系统”的愿景而受到负面反馈，导致他限制了对其帖子的评论。 The Verge的一份报告也强调了Copilot目前的缺点，指出它经常无法达到微软所宣传的无缝性能。\n\n批评人士认为，微软对人工智能的关注重点错位，尤其是在Windows面临根本性问题的情况下。 他们认为该公司正在将人工智能强加到用户界面的各个方面，而不是解决现有问题。 虽然达武卢里承认需要为高级用户和开发人员改进Windows，但鉴于该公司最近转向成为一家“人工智能公司”，人们仍然对微软致力于与人工智能无关的改进持怀疑态度。 用户对人工智能集成的抵制持续增长，影响了微软对Windows未来的愿景。"
  },
  {
    "id": "45991497",
    "title": "Show HN: Awesome J2ME",
    "url": "https://github.com/hstsethi/awesome-j2me",
    "summary": "This \"Awesome J2ME\" list is a curated collection of resources for Java ME (Micro Edition), a Java specification designed for older mobile phones and PDAs. It aims to raise awareness and support the J2ME community.\n\nThe list is organized into categories covering all aspects of J2ME, including:\n\n*   **Communities:** Links to online communities like Discord servers, Reddit forums, and wikis dedicated to J2ME games and preservation.\n*   **Development:** Tools and libraries for J2ME development, such as C compilers, JSON parsers, game script engines, and UI toolkits.\n*   **IDEs & SDKs:** Downloads and links to IDEs like Eclipse and NetBeans, as well as J2ME SDKs from Sun/Oracle and other vendors like Sony Ericsson.\n*   **Emulators:** A variety of emulators for running J2ME applications on platforms like Android, PSP, and Firefox OS.\n*   **Hardware:** Links to mobile phone museums for J2ME-compatible phones.\n*   **Native Software:** J2ME applications for Discord, YouTube, Telegram, VK, and more, including GBC emulators.\n*   **Video Games:** Collections, databases, and archives of J2ME games, including speedrun information.\n*   **Related Projects:** Links to other \"Awesome\" lists and resources for related technologies like Symbian.\n*   **Reverse Engineering & Decompilers:** Tools for analyzing and decompiling J2ME applications.\n*   **Tutorials & Academic Articles:** Guides and research papers on J2ME development and testing.\n\nThe article serves as a central repository for anyone interested in J2ME development, preservation, or retro gaming.\n",
    "chinese_title": "Show HN: 令人惊叹的J2ME",
    "chinese_summary": "这份“精彩的J2ME”清单是一个精选的Java ME（微型版）资源集合，Java ME是一种为旧手机和PDA设计的Java规范。 其目的是提高人们对J2ME社区的认识并提供支持。\n\n该清单按类别组织，涵盖J2ME的各个方面，包括：\n\n*   **社区：** 指向在线社区的链接，例如专门用于J2ME游戏和保护的Discord服务器、Reddit论坛和Wiki。\n*   **开发：** 用于J2ME开发的工具和库，例如C编译器、JSON解析器、游戏脚本引擎和UI工具包。\n*   **IDE和SDK：** 下载和链接到Eclipse和NetBeans等IDE，以及来自Sun/Oracle和其他供应商（如索尼爱立信）的J2ME SDK。\n*   **模拟器：** 用于在Android、PSP和Firefox OS等平台上运行J2ME应用程序的各种模拟器。\n*   **硬件：** 指向J2ME兼容手机的手机博物馆的链接。\n*   **原生软件：** 适用于Discord、YouTube、Telegram、VK等的J2ME应用程序，包括GBC模拟器。\n*   **视频游戏：** J2ME游戏的集合、数据库和档案馆，包括速通信息。\n*   **相关项目：** 指向其他“精彩”清单和相关技术（如Symbian）的资源的链接。\n*   **逆向工程和反编译器：** 用于分析和反编译J2ME应用程序的工具。\n*   **教程和学术文章：** 关于J2ME开发和测试的指南和研究论文。\n\n对于任何对J2ME开发、保护或复古游戏感兴趣的人来说，这篇文章都是一个中心知识库。"
  },
  {
    "id": "45988278",
    "title": "50th Anniversary of Bitblt",
    "url": "https://mastodon.sdf.org/@fvzappa/115574872559813280",
    "summary": "The article is a short announcement, likely found on the Mastodon social media platform, declaring November 19, 2025, as the 50th anniversary of Bitblt. The announcement originates from an account named \"Crazy Eddie's Used Computers\" on the SDF (likely System Development Foundation) Mastodon instance. The announcement is incomplete, abruptly ending with \"50th a...\". It implies that the user was cut off mid-sentence, possibly due to character limits on the platform.\n\nThe key information is:\n\n*   **Event:** 50th Anniversary of Bitblt.\n*   **Date:** November 19, 2025.\n*   **Source:** \"Crazy Eddie's Used Computers\" on Mastodon @ SDF.\n*   **Platform:** Mastodon.\n\nThe secondary information is a note advising users that JavaScript is required to use the Mastodon web app and suggesting alternative Mastodon apps for different platforms. This is more about the platform than the content of the announcement itself.\n",
    "chinese_title": "位块传送五十周年",
    "chinese_summary": "文章是一则简短的公告，可能发布在Mastodon社交媒体平台上，宣布2025年11月19日为Bitblt五十周年纪念日。该公告来自SDF（可能是系统开发基金会）Mastodon实例上名为“疯狂艾迪的二手电脑”的账户。公告内容不完整，以“五十周年纪...”戛然而止，暗示用户可能因平台字符限制而被中断。\n\n关键信息：\n\n*   **事件：**Bitblt五十周年纪念日\n*   **日期：**2025年11月19日\n*   **来源：**Mastodon @ SDF上的“疯狂艾迪的二手电脑”\n*   **平台：**Mastodon\n\n次要信息是提醒用户使用Mastodon网页应用需要JavaScript，并推荐了适用于不同平台的其他Mastodon应用程序。这更多是关于平台本身的信息，而非公告的内容。"
  },
  {
    "id": "45984623",
    "title": "Racing karts on a Rust GPU kernel driver",
    "url": "https://www.collabora.com/news-and-blog/news-and-events/racing-karts-on-a-rust-gpu-kernel-driver.html",
    "summary": "This Collabora blog post announces significant progress in the development of Tyr, a Rust-based kernel driver for Arm Mali GPUs. The prototype driver has advanced beyond basic GPU job execution to successfully running graphical environments like GNOME and Weston, as well as full-screen 3D games such as SuperTuxKart.\n\nThe post explains the roles of user-mode drivers (UMDs) and kernel-mode drivers (KMDs) in GPU operation, highlighting the KMD's responsibility for hardware initialization, memory management, and job scheduling. The Tyr prototype initially focused on basic IGT tests, then progressed to drawing a rotating cube with kmscube. Success with kmscube demonstrated the driver's ability to enforce job dependencies.\n\nThe ultimate milestone achieved was running full desktop environments like GNOME and Weston, along with games, showcasing the driver's potential for real-world applications. While the Tyr prototype is not yet ready for daily use and contains shortcuts for development speed, it proves that Rust-based GPU KMDs can perform on par with C counterparts. It serves as a valuable experimental platform for Rust abstraction work and design exploration. The prototype was tested on a Rock 5B board and the source code is available for testing and contribution.\n",
    "chinese_title": "在Rust GPU内核驱动上运行赛车卡丁车",
    "chinese_summary": "Collabora博客宣布Tyr开发取得重大进展：基于Rust的Arm Mali GPU内核驱动现已运行GNOME、Weston及SuperTuxKart。\n\n该博文阐述了用户模式驱动 (UMD) 和内核模式驱动 (KMD) 在 GPU 运行中的作用，强调 KMD 负责硬件初始化、内存管理和作业调度。 Tyr 原型最初专注于基本的 IGT 测试，然后发展到使用 kmscube 绘制旋转立方体。kmscube 的成功证明了该驱动程序能够执行作业依赖项。\n\n最终实现的里程碑是运行完整的桌面环境（如 GNOME 和 Weston）以及游戏，展示了该驱动程序在实际应用中的潜力。 虽然 Tyr 原型尚未准备好用于日常使用，并且包含为了加快开发速度而采取的快捷方式，但它证明了基于 Rust 的 GPU KMD 可以与 C 语言的 KMD 媲美。 它作为 Rust 抽象工作和设计探索的宝贵实验平台。 该原型已在 Rock 5B 板上进行了测试，源代码可供测试和贡献。"
  },
  {
    "id": "45987220",
    "title": "Workday to acquire Pipedream",
    "url": "https://newsroom.workday.com/2025-11-19-Workday-Signs-Definitive-Agreement-to-Acquire-Pipedream",
    "summary": "Workday announced its definitive agreement to acquire Pipedream, an integration platform specializing in connecting AI agents to over 3,000 business applications. This acquisition aims to enhance Workday's AI capabilities by enabling its platform to initiate workflows, access data, and execute tasks across various systems, including third-party applications.\n\nThe acquisition of Pipedream is intended to extend Workday's AI functionality beyond insights by enabling action. Pipedream's pre-built connectors will allow Workday's AI agents to interact with applications like Asana, Hubspot, and Slack, facilitating automated tasks such as performance reviews, project updates, and peer feedback requests.\n\nWorkday emphasizes its commitment to building an end-to-end platform for AI agents that can understand a company's business context and drive meaningful results. The Pipedream acquisition, combined with previous acquisitions of Sana and Flowise, strengthens this strategy by integrating intelligence, orchestration, and connectivity.\n\nThe transaction is expected to close in Workday's fiscal Q4 2026. Pipedream's existing customer base of over 5,000 and its active builder community are expected to contribute to Workday's innovation and expand its open development support. Workday aims to become the connected system for customers to plan, orchestrate, and execute work, marking a significant step forward in actionable AI.\n",
    "chinese_title": "Workday将收购Pipedream。",
    "chinese_summary": "Workday宣布已达成最终协议收购Pipedream，后者是一家专门将AI代理连接到3000多个商业应用的集成平台。此次收购旨在通过使Workday平台能够跨各种系统（包括第三方应用程序）启动工作流程、访问数据和执行任务，从而增强Workday的AI能力。\n\n收购Pipedream旨在将Workday的AI功能从洞察扩展到行动。Pipedream的预构建连接器将允许Workday的AI代理与Asana、Hubspot和Slack等应用程序交互，从而促进绩效评估、项目更新和同行反馈请求等自动化任务。\n\nWorkday强调其致力于构建一个端到端的AI代理平台，该平台可以理解公司的业务背景并推动有意义的结果。收购Pipedream，加上之前对Sana和Flowise的收购，通过整合智能、编排和连接，加强了这一战略。\n\n该交易预计将于Workday 2026财年第四季度完成。Pipedream现有的超过5,000名客户群及其活跃的构建者社区有望为Workday的创新做出贡献并扩大其开放开发支持。Workday的目标是成为客户计划、编排和执行工作的连接系统，标志着在可操作AI方面迈出了重要一步。"
  },
  {
    "id": "45967211",
    "title": "Gemini 3",
    "url": "https://blog.google/products/gemini/gemini-3/",
    "summary": "Gemini 3, Google's most intelligent AI model, is now being rolled out across various Google products. It boasts state-of-the-art reasoning and multimodal capabilities, outperforming previous models in key AI benchmarks. It's available in AI Mode in Search, the Gemini app, AI Studio, and Vertex AI, with a \"Deep Think\" mode coming soon for Ultra subscribers that further enhances reasoning capabilities.\n\nSundar Pichai highlights the rapid growth and impact of Gemini, emphasizing Google's full-stack approach to AI innovation. Demis Hassabis and Koray Kavukcuoglu tout Gemini 3 as a significant step towards AGI, offering richer visualizations and deeper interactivity.\n\nGemini 3 Pro excels in understanding complex concepts, providing concise and insightful responses. \"Deep Think\" mode is designed for solving even more intricate problems.\n\nThe model helps users learn, build, and plan effectively. It can synthesize information across modalities, translate languages, generate interactive learning tools, and even analyze sports videos for improvement. It empowers developers through Google AI Studio, Vertex AI, Gemini CLI, and the new agentic development platform, Google Antigravity.\n\nGoogle Antigravity is a new agent-first development platform that leverages Gemini 3's agentic coding capabilities to transform AI assistance into an active partner for developers.\n\nGemini 3 demonstrates improved long-horizon planning and tool usage, enabling it to manage complex tasks like booking services and organizing inboxes.\n\nGoogle emphasizes the responsible development of Gemini 3, highlighting extensive safety evaluations and partnerships with industry experts. Additional models in the Gemini 3 series are planned for release in the near future.\n",
    "chinese_title": "双子星3号",
    "chinese_summary": "Gemini 3（谷歌最智能的AI模型）现已在各种谷歌产品中推出。它拥有最先进的推理和多模态能力，在关键AI基准测试中表现优于之前的模型。它在搜索中的AI模式、Gemini应用、AI Studio和Vertex AI中可用，Ultra订阅用户即将推出“深度思考”模式，进一步增强推理能力。\n\nSundar Pichai强调了Gemini的快速增长和影响，并强调了谷歌在AI创新方面的全栈方法。Demis Hassabis和Koray Kavukcuoglu称赞Gemini 3是迈向AGI的重要一步，提供了更丰富的可视化和更深入的互动性。\n\nGemini 3 Pro擅长理解复杂概念，提供简洁而深刻的回复。“深度思考”模式旨在解决更复杂的问题。\n\n该模型可帮助用户有效地学习、构建和计划。它可以跨模态综合信息、翻译语言、生成交互式学习工具，甚至分析体育视频以进行改进。它通过Google AI Studio、Vertex AI、Gemini CLI和新的代理式开发平台Google Antigravity为开发者赋能。\n\nGoogle Antigravity是一个新的以代理为先的开发平台，它利用Gemini 3的代理式编码能力将AI辅助转变为开发者的积极合作伙伴。\n\nGemini 3展示了改进的长期规划和工具使用能力，使其能够管理复杂的任务，如预订服务和整理收件箱。\n\n谷歌强调Gemini 3的负责任开发，突出了广泛的安全评估和与行业专家的合作。Gemini 3系列的更多模型计划在不久的将来发布。"
  },
  {
    "id": "45912457",
    "title": "The Future of Programming (2013) [video]",
    "url": "https://www.youtube.com/watch?v=8pTEmbeENF4",
    "summary": "This entry is not an article but rather a YouTube video listing from 2013 titled \"The Future of Programming\".  Unfortunately, the provided content is only YouTube's footer information, containing standard links and copyright notices.  Therefore, it's impossible to summarize the video's actual content regarding the future of programming based solely on this information. The text includes links like \"About,\" \"Press,\" \"Contact Us,\" \"Creators,\" \"Advertise,\" \"Developers,\" \"Terms,\" \"Privacy,\" \"Policy & Safety,\" \"How YouTube Works,\" \"Test New Features,\" and \"NFL Sunday Ticket,\" along with a copyright notice for Google LLC. To understand the video's perspective on the future of programming, one would need to actually watch the video.\n",
    "chinese_title": "编程的未来 (2013) [视频]",
    "chinese_summary": "此条目并非文章，而是一个2013年名为“编程的未来”的YouTube视频列表。不幸的是，提供的内容仅为YouTube页脚信息，包含标准链接和版权声明。因此，仅凭这些信息无法总结该视频关于编程未来的实际内容。文本包括“关于”、“媒体报道”、“联系我们”、“创作者”、“广告”、“开发者”、“条款”、“隐私”、“政策与安全”、“YouTube运作方式”、“测试新功能”和“NFL Sunday Ticket”等链接，以及Google LLC的版权声明。要了解该视频对编程未来的观点，需要实际观看该视频。"
  },
  {
    "id": "45915068",
    "title": "The Complete Work of Charles Darwin Online",
    "url": "https://darwin-online.org.uk/",
    "summary": "The Complete Work of Charles Darwin Online, edited by John van Wyhe, is a comprehensive digital archive of Charles Darwin's work. Praised as a \"monumental scholarly and bibliographic achievement,\" the website (darwin-online.org.uk) provides access to a vast collection of Darwin's publications, including seminal works like *Origin of Species*, *Beagle*, and *Descent*, alongside his *Life & Letters* and *Autobiography*.\n\nBeyond published books, the resource offers access to Darwin's manuscripts and papers, such as his notebooks, Beagle diary, journal entries, drafts of *Origin of Species*, and even Emma Darwin's diary and his address book.\n\nThe website also includes supplementary materials, such as the Beagle Library, information on Darwin's specimens, his personal library, reviews of his work, photographs, caricatures, accounts of his funeral and obituaries, recollections, introductions to works, itineraries and works about Darwin. It also includes Wallace Online, Dispelling the Darkness and Justice of the Peace.\n\nThe website has been a popular resource, with over 900 million visits since 2006. The citation provided is: John van Wyhe, ed. 2002-. The Complete Work of Charles Darwin Online (http://darwin-online.org.uk).\n",
    "chinese_title": "达尔文作品全集 (在线)",
    "chinese_summary": "查尔斯·达尔文在线全集（约翰·范·韦赫编辑）是一个收录了查尔斯·达尔文著作的综合数字档案馆。该网站(darwin-online.org.uk)被誉为“具有里程碑意义的学术和书目成就”，提供了对达尔文大量出版物的访问，包括《物种起源》、《贝格尔号航行日记》、《人类的由来》等开创性著作，以及他的《生平与书信》和《自传》。\n\n除了已出版的书籍外，该资源还提供了对达尔文手稿和论文的访问，例如他的笔记本、《贝格尔号》日记、日记条目、《物种起源》草稿，甚至包括艾玛·达尔文的日记和他的地址簿。\n\n该网站还包括补充材料，例如《贝格尔号》图书馆、达尔文标本信息、他的私人图书馆、对其作品的评论、照片、漫画、他的葬礼和讣告的记录、回忆录、作品介绍、行程安排以及关于达尔文的著作。它还包括华莱士在线、驱散黑暗和治安法官。\n\n该网站一直是一个受欢迎的资源，自2006年以来已超过9亿次访问。引用为：John van Wyhe, ed. 2002-. The Complete Work of Charles Darwin Online (http://darwin-online.org.uk)."
  },
  {
    "id": "45972390",
    "title": "Bild AI (YC W25) is hiring – Make housing affordable",
    "url": "https://www.ycombinator.com/companies/bild-ai/jobs/m2ilR5L-founding-engineer-applied-ai",
    "summary": "Bild AI, a YC W25 startup, is hiring a Founding Engineer (Applied AI) to help make housing more affordable by tackling challenges in construction blueprint reading, cost estimation, and permit applications. This San Francisco-based, in-office role offers a $100K - $180K salary and 0.20% - 1.20% equity.\n\nThe ideal candidate will focus on the intelligence layer, applying the latest computer vision, LLM models, and AI systems to quickly ship prototypes and iterate based on user feedback. They should have applied CV/ML experience, a 0-to-1 builder mentality (with AI in production), a growth mindset, and excellent communication skills. Construction experience or having built/sold a product are bonus points.\n\nBild AI utilizes a model-garden approach to blueprint understanding, tackling difficult technical challenges in the construction industry. They emphasize a customer-obsessed approach to product development and have raised funding from top VCs before demo day. Applicants are asked to briefly explain why they are a good fit and share their favorite fruit in their application message.\n",
    "chinese_title": "Bild AI (YC W25) 正在招聘 – 让住房变得可负担",
    "chinese_summary": "YC W25创业公司Bild AI正在招聘一名创始工程师（应用AI），通过解决建筑蓝图阅读、成本估算和许可证申请方面的挑战，助力降低住房成本。这个位于旧金山的办公室职位提供10万至18万美元的薪资和0.20%至1.20%的股权。\n\n理想的候选人将专注于智能层，应用最新的计算机视觉、LLM模型和AI系统，快速交付原型并根据用户反馈进行迭代。他们应具备应用CV/ML经验，0到1的构建者心态（有AI在生产中的经验），成长型思维，以及优秀的沟通能力。具备建筑经验或曾构建/销售过产品是加分项。\n\nBild AI采用模型花园方法来理解蓝图，解决建筑行业中复杂的技术挑战。他们强调以客户为中心的产品开发方法，并在演示日之前获得了顶级风险投资公司的投资。申请人需在申请信息中简要说明为什么适合该职位，并分享他们最喜欢的水果。"
  },
  {
    "id": "45914115",
    "title": "Foliated Distance Fields [video]",
    "url": "https://www.youtube.com/watch?v=3AGeLuO5WdY",
    "summary": "The provided \"article\" isn't an article at all. It's a very short snippet of YouTube boilerplate text related to copyright, advertising, terms, privacy, and the NFL Sunday Ticket. The actual content of the \"Foliated Distance Fields [video]\" is completely unknown.\n\nTherefore, a summary would be:\n\n**The provided text is YouTube's standard footer information and offers no insight into the content of the linked YouTube video titled \"Foliated Distance Fields.\" The text covers topics like copyright, advertising, developer resources, terms of service, privacy policy, and a mention of NFL Sunday Ticket ownership.** To understand the video's content, one must watch the video itself.\n",
    "chinese_title": "层理距离场 [视频]",
    "chinese_summary": "提供的“文章”根本不是文章，而是一段非常简短的YouTube样板文字，内容涉及版权、广告、条款、隐私以及NFL Sunday Ticket。关于“Foliated Distance Fields [视频]”的实际内容完全未知。\n\n因此，总结如下：\n\n**提供的文本是YouTube的标准页脚信息，无法提供有关名为“Foliated Distance Fields”的YouTube视频内容的任何信息。该文本涵盖了版权、广告、开发者资源、服务条款、隐私政策，并提及了NFL Sunday Ticket的所有权。** 要了解视频的内容，必须观看视频本身。"
  },
  {
    "id": "45985799",
    "title": "Roblox Requires Age Checks for Communication, Ushering in New Safety Standard",
    "url": "https://corp.roblox.com/newsroom/2025/11/roblox-requires-age-checks-limits-minor-and-adult-chat",
    "summary": "Roblox is implementing a facial age check requirement for all users accessing chat features, aiming to set a new safety standard for online communication. This initiative, launching with a voluntary period in November 2025 and expanding globally in early January 2026, assigns users to similar age groups for chat, limiting interactions between minors and adults.\n\nThe Facial Age Estimation process, conducted through the Roblox app using the device’s camera, is designed with privacy in mind; images and videos are deleted immediately after processing by their vendor Persona. Users who complete the age check will be grouped into age categories (Under 9, 9-12, 13-15, 16-17, 18-20, or 21+) and can chat with others in similar age ranges. Parental consent is required for users under nine to use chat in experiences, and chat is restricted for users under 13 outside of experiences.\n\nTrusted Connections will allow users 13 or older to chat freely with people they know, and Roblox plans to roll out dedicated solutions for direct chat between parents and children. Additionally, age checks will soon be required to access social media links on user profiles and creator collaboration tools in Roblox Studio.\n\nRoblox emphasizes its comprehensive safety approach, which includes monitoring all chat, filtering text chat based on age, prohibiting image and video sharing, restricting links, and providing user tools for blocking and reporting. Parental Controls offer further management options. The aim is to provide age-appropriate experiences and a safer online environment for all users.\n",
    "chinese_title": "Roblox要求进行年龄验证以进行交流，开启全新安全标准",
    "chinese_summary": "Roblox将实施面部年龄验证，以访问聊天功能，旨在为在线交流设定新的安全标准。 该计划将于2025年11月开始自愿试行，并于2026年1月初在全球推广，将用户分配到相似的年龄组进行聊天，从而限制未成年人与成人之间的互动。\n\n面部年龄估计过程通过Roblox应用程序使用设备的摄像头进行，其设计充分考虑了隐私； 图像和视频在经其供应商Persona处理后立即删除。 完成年龄验证的用户将被分为不同的年龄段（9岁以下、9-12岁、13-15岁、16-17岁、18-20岁或21岁以上），并可以与年龄相近的其他人聊天。 9岁以下的用户需要在获得家长同意后才能在游戏中使用聊天功能，而13岁以下的用户在游戏之外的聊天功能受到限制。\n\n“信任连接”功能将允许13岁或以上的用户与他们认识的人自由聊天，Roblox计划推出专门的解决方案，用于父母和孩子之间的直接聊天。 此外，很快将需要进行年龄验证才能访问用户个人资料上的社交媒体链接以及Roblox Studio中的创作者协作工具。\n\nRoblox强调其全面的安全方法，包括监控所有聊天、根据年龄过滤文本聊天、禁止图像和视频共享、限制链接以及提供用户用于阻止和举报的工具。 家长控制功能提供了进一步的管理选项。 目标是为所有用户提供适合年龄的体验和更安全的在线环境。"
  },
  {
    "id": "45984282",
    "title": "Robert Louis Stevenson's Art of Living (and Dying)",
    "url": "https://lithub.com/robert-louis-stevensons-art-of-living-and-dying/",
    "summary": "Trenton B. Olsen's article, \"Robert Louis Stevenson's Art of Living (and Dying),\" explores how the author navigated a lifetime of chronic illness and his evolving perspective on life and death. In his youth, Stevenson, grappling with pulmonary illness, was preoccupied with leaving a lasting legacy. He spent time in graveyards, reflecting on his mortality, and wrote essays exploring \"the art of living\" and dying. A trip to the French Riviera, ordered by doctors, initially found him resigned to a diminished existence.\n\nHowever, Stevenson later revised his youthful pessimism, attributing it to \"self-pity.\" He achieved global fame with works like *Treasure Island* and *Dr. Jekyll and Mr. Hyde*, but prioritized health over publicity. Despite ongoing illness, he embraced adventure, embarking on travels and immersing himself in life. A stay in Saranac Lake connected him with tuberculosis research and treatment, reinforcing his resolve to fight illness and cherish relationships.\n\nStevenson's life culminated in Samoa, where he embraced the island lifestyle and faced his mortality with acceptance, even planning his burial site with a view from his desk. He died at 44 from a cerebral hemorrhage. The article emphasizes Stevenson's commitment to living fully even in the face of death, exemplified by his writing on his final day. Even in his writing about death he continued to embrace “the art of living”. He wrote, played cards, helped make dinner, and everything that made up a full day.\n",
    "chinese_title": "罗伯特·路易斯·史蒂文森的生活（与死亡）艺术",
    "chinese_summary": "特伦顿·B·奥尔森的文章《罗伯特·路易斯·史蒂文森的生存（与死亡）艺术》探讨了这位作家如何应对一生的慢性疾病，以及他对生命和死亡不断演变的看法。史蒂文森年轻时深受肺病困扰，一心想要留下不朽的遗产。他花时间在墓地里反思自己的必死性，并撰写文章探讨“生存艺术”和死亡。医生建议他前往法国里维埃拉疗养，起初他顺从地接受了一种被削弱的生活状态。\n\n然而，史蒂文森后来修正了他年轻时的悲观情绪，将其归因于“自怜”。他凭借《金银岛》和《化身博士》等作品获得了全球声誉，但将健康置于名气之上。尽管持续生病，他仍然拥抱冒险，开始旅行，沉浸于生活之中。在萨拉纳克湖的逗留使他接触到肺结核研究和治疗，增强了他与疾病作斗争和珍惜人际关系的决心。\n\n史蒂文森的生命最终在萨摩亚达到了顶峰，在那里他拥抱了岛屿生活方式，并以接受的态度面对自己的必死性，甚至计划了自己的墓地，可以从他的书桌看到那里的景色。他因脑溢血于44岁去世。这篇文章强调了史蒂文森即使在面对死亡时也致力于充分生活的态度，他最后一天仍在写作就是例证。即使在他的死亡写作中，他仍然继续拥抱“生存艺术”。他写作、打牌、帮忙做晚餐，以及做所有能构成完整一天的事情。"
  },
  {
    "id": "45976832",
    "title": "Exploring the limits of large language models as quant traders",
    "url": "https://nof1.ai/blog/TechPost1",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "探索大型语言模型作为量化交易者的局限性",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "45978423",
    "title": "Thunderbird adds native Microsoft Exchange email support",
    "url": "https://blog.thunderbird.net/2025/11/thunderbird-adds-native-microsoft-exchange-email-support/",
    "summary": "Thunderbird version 145 now offers native support for Microsoft Exchange email via the Exchange Web Services (EWS) protocol, eliminating the need for third-party add-ons. This simplifies email management for users in Exchange environments who prefer Thunderbird. Key improvements include seamless integration, full folder listings, message synchronization, and attachment handling.\n\nSetting up an Exchange account is straightforward for Microsoft 365 and Office 365 users, leveraging Microsoft's standard OAuth2 sign-in for automatic account detection.\n\nCurrently, the EWS support focuses solely on email functionality. Calendar and address book integration are actively being developed for future releases. A detailed table outlines supported features, noting limitations like the lack of support for custom OAuth2 configurations and NTLM authentication for on-premise servers.\n\nWhile EWS is widely used, Microsoft is transitioning to Microsoft Graph. Thunderbird is committed to supporting both protocols, prioritizing EWS to ensure immediate compatibility and actively working on Microsoft Graph integration for the future. The goal is to make Thunderbird a comprehensive alternative to Outlook for Exchange users, especially with the upcoming calendar and contact synchronization features. Additional resources and details are available on the support page, wiki page, and Bugzilla.\n",
    "chinese_title": "Thunderbird 添加原生 Microsoft Exchange 邮件支持",
    "chinese_summary": "Thunderbird 145 版本现已通过 Exchange Web Services (EWS) 协议原生支持 Microsoft Exchange 邮件，无需第三方插件。这简化了偏好 Thunderbird 的 Exchange 环境用户的邮件管理。主要改进包括无缝集成、完整文件夹列表、消息同步和附件处理。\n\nMicrosoft 365 和 Office 365 用户可以轻松设置 Exchange 帐户，利用 Microsoft 的标准 OAuth2 登录进行自动帐户检测。\n\n目前，EWS 支持仅侧重于邮件功能。日历和地址簿集成正在积极开发中，将在未来版本中推出。详细表格列出了支持的功能，并指出了局限性，例如不支持自定义 OAuth2 配置和本地服务器的 NTLM 身份验证。\n\n尽管 EWS 应用广泛，但 Microsoft 正在过渡到 Microsoft Graph。Thunderbird 致力于支持这两种协议，优先支持 EWS 以确保即时兼容性，并积极开发 Microsoft Graph 集成以供未来使用。目标是使 Thunderbird 成为 Exchange 用户 Outlook 的全面替代方案，特别是即将推出的日历和联系人同步功能。更多资源和详细信息可在支持页面、Wiki 页面和 Bugzilla 上找到。"
  },
  {
    "id": "45993073",
    "title": "210 IQ Is Not Enough",
    "url": "https://taylor.town/iq-not-enough",
    "summary": "The article \"210 IQ Is Not Enough\" explores the pitfalls of equating intelligence with success and fulfillment. It uses the examples of Christopher Langan, known for his high IQ but criticized for his bitterness and controversial views, and Kim Ung-yong, a child prodigy who rejected a life of extraordinary achievement to pursue a more ordinary and fulfilling path.\n\nThe author argues that focusing solely on external validation and achievement, whether through IQ scores or other accomplishments, leads to dissatisfaction. Langan's story serves as a cautionary tale about the dangers of resentment and unmet potential, urging readers to forgive past setbacks and practice self-acceptance.\n\nKim Ung-yong's experience highlights the importance of individual choice and challenging societal expectations. Despite his extraordinary intelligence, he found happiness in a less prestigious but more personally meaningful career and rejected the label of \"failed genius.\" His story underscores that intelligence alone is insufficient for happiness and that society should respect diverse paths to fulfillment.\n\nThe central message emphasizes that true contentment comes from within and is not dependent on external validation. The author encourages readers to embrace their inherent worth and reject the pressure to constantly strive for more, whether it's IQ, money, time, or energy. The article concludes that \"you are plenty\" and that only you can decide what is enough.\n",
    "chinese_title": "智商210还不够",
    "chinese_summary": "文章《智商210不够用》探讨了将智力等同于成功和满足感的弊端。它以克里斯托弗·兰根为例，他以高智商著称，但因其愤世嫉俗和有争议的观点而备受批评；以及金雄镕为例，这位神童拒绝了非凡成就的生活，转而追求更平凡和充实的道路。\n\n作者认为，仅仅关注外部认可和成就，无论是通过智商分数还是其他成就，都会导致不满。兰根的故事是一个关于怨恨和未实现潜力的警示故事，敦促读者原谅过去的挫折并练习自我接纳。\n\n金雄镕的经历突显了个人选择和挑战社会期望的重要性。尽管他拥有非凡的智力，但他在一个不那么有声望但更具个人意义的职业中找到了幸福，并拒绝了“失败的天才”的标签。他的故事强调，仅凭智力不足以获得幸福，社会应该尊重实现满足感的多样化道路。\n\n中心信息强调，真正的满足感来自内心，而不是依赖于外部认可。作者鼓励读者拥抱他们内在的价值，并拒绝不断追求更多的压力，无论是智商、金钱、时间还是精力。文章总结说“你已经足够了”，只有你能决定什么是足够。"
  },
  {
    "id": "45977542",
    "title": "Multimodal Diffusion Language Models for Thinking-Aware Editing and Generation",
    "url": "https://github.com/tyfeld/MMaDA-Parallel",
    "summary": "生成摘要时出错",
    "chinese_title": "Multimodal Diffusion Language Models for Thinking-Aware Editing and Generation",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45984353",
    "title": "Cognitive and mental health correlates of short-form video use",
    "url": "https://psycnet.apa.org/fulltext/2026-89350-001.html",
    "summary": "生成摘要时出错",
    "chinese_title": "Cognitive and mental health correlates of short-form video use",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45987289",
    "title": "Debunking the Myths of the HBO Chernobyl series (2023)",
    "url": "https://blog.osm-ai.net/investigation/2023/01/05/hbo-chernobyl-myth.html",
    "summary": "生成摘要时出错",
    "chinese_title": "Debunking the Myths of the HBO Chernobyl series (2023)",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45987252",
    "title": "Measuring the impact of AI scams on the elderly",
    "url": "https://simonlermen.substack.com/p/can-ai-models-be-jailbroken-to-phish",
    "summary": "生成摘要时出错",
    "chinese_title": "Measuring the impact of AI scams on the elderly",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45959586",
    "title": "Three Hapsburgs and a Reporter Walk into a Canadian Vault",
    "url": "https://www.nytimes.com/2025/11/16/insider/florentine-diamond-hapsburgs.html",
    "summary": "生成摘要时出错",
    "chinese_title": "Three Hapsburgs and a Reporter Walk into a Canadian Vault",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45984072",
    "title": "Pozsar's Bretton Woods III: The Framework",
    "url": "https://philippdubach.com/2025/10/25/pozsars-bretton-woods-iii-the-framework-1/2/",
    "summary": "生成摘要时出错",
    "chinese_title": "Pozsar's Bretton Woods III: The Framework",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45984461",
    "title": "Show HN: F32 – An Extremely Small ESP32 Board",
    "url": "https://github.com/PegorK/f32",
    "summary": "生成摘要时出错",
    "chinese_title": "Show HN: F32 – An Extremely Small ESP32 Board",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45994449",
    "title": "China's shadow Navy trains to take Taiwan",
    "url": "https://www.reuters.com/graphics/USA-CHINA/TAIWAN-INVASION/zjpqdekmlvx/",
    "summary": "生成摘要时出错",
    "chinese_title": "China's shadow Navy trains to take Taiwan",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45974012",
    "title": "Show HN: I made a down detector for down detector",
    "url": "https://downdetectorsdowndetector.com",
    "summary": "生成摘要时出错",
    "chinese_title": "Show HN: I made a down detector for down detector",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45984143",
    "title": "The Death of Arduino?",
    "url": "https://www.linkedin.com/posts/adafruit_opensource-privacy-techpolicy-activity-7396903362237054976-r14H",
    "summary": "生成摘要时出错",
    "chinese_title": "The Death of Arduino?",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45903485",
    "title": "Control LLM Spend and Access with any-LLM-gateway",
    "url": "https://blog.mozilla.ai/control-llm-spend-and-access-with-any-llm-gateway/",
    "summary": "生成摘要时出错",
    "chinese_title": "Control LLM Spend and Access with any-LLM-gateway",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45897057",
    "title": "Blame as a Service",
    "url": "https://www.humaninvariant.com/blog/blame",
    "summary": "生成摘要时出错",
    "chinese_title": "Blame as a Service",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45991257",
    "title": "Border Patrol is monitoring drivers, detaining those with 'suspicious' patterns",
    "url": "https://abcnews.go.com/Technology/wireStory/border-patrol-monitoring-us-drivers-detaining-suspicious-travel-127699704",
    "summary": "生成摘要时出错",
    "chinese_title": "Border Patrol is monitoring drivers, detaining those with 'suspicious' patterns",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45986940",
    "title": "CornHub",
    "url": "https://cornhub.website/",
    "summary": "生成摘要时出错",
    "chinese_title": "CornHub",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45967814",
    "title": "Google Antigravity",
    "url": "https://antigravity.google/",
    "summary": "生成摘要时出错",
    "chinese_title": "Google Antigravity",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45978245",
    "title": "Learning to Boot from PXE",
    "url": "https://blog.imraniqbal.org/learning-to-boot-from-pxe/",
    "summary": "生成摘要时出错",
    "chinese_title": "Learning to Boot from PXE",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45981666",
    "title": "Adventures in upgrading Proxmox",
    "url": "https://blog.vasi.li/adventures-in-upgrading-proxmox/",
    "summary": "生成摘要时出错",
    "chinese_title": "Adventures in upgrading Proxmox",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45992304",
    "title": "Students fight back over course taught by AI",
    "url": "https://www.theguardian.com/education/2025/nov/20/university-of-staffordshire-course-taught-in-large-part-by-ai-artificial-intelligence",
    "summary": "生成摘要时出错",
    "chinese_title": "Students fight back over course taught by AI",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45992035",
    "title": "Ubuntu LTS releases to 15 years with Legacy add-on",
    "url": "https://canonical.com/blog/canonical-expands-total-coverage-for-ubuntu-lts-releases-to-15-years-with-legacy-add-on",
    "summary": "生成摘要时出错",
    "chinese_title": "Ubuntu LTS releases to 15 years with Legacy add-on",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45984333",
    "title": "The Subversive Hyperlink (2024)",
    "url": "https://blog.jim-nielsen.com/2024/the-subversive-hyperlink/",
    "summary": "生成摘要时出错",
    "chinese_title": "The Subversive Hyperlink (2024)",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45979232",
    "title": "The peaceful transfer of power in open source projects",
    "url": "https://shkspr.mobi/blog/2025/11/the-peaceful-transfer-of-power-in-open-source-projects/",
    "summary": "生成摘要时出错",
    "chinese_title": "The peaceful transfer of power in open source projects",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45974869",
    "title": "I just want working RCS messaging",
    "url": "https://wt.gd/i-just-want-my-rcs-messaging-to-work",
    "summary": "生成摘要时出错",
    "chinese_title": "I just want working RCS messaging",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45964835",
    "title": "GoSign Desktop RCE flaws affecting users in Italy",
    "url": "https://www.ush.it/2025/11/14/multiple-vulnerabilities-gosign-desktop-remote-code-execution/",
    "summary": "生成摘要时出错",
    "chinese_title": "GoSign Desktop RCE flaws affecting users in Italy",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45935294",
    "title": "How two photographers transformed RAW photo support on Mac",
    "url": "https://petapixel.com/2025/11/14/how-two-photographers-transformed-raw-photo-support-on-mac/",
    "summary": "生成摘要时出错",
    "chinese_title": "How two photographers transformed RAW photo support on Mac",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45985404",
    "title": "Show HN: OctoDNS, Tools for managing DNS across multiple providers",
    "url": "https://octodns.readthedocs.io/en/latest/",
    "summary": "生成摘要时出错",
    "chinese_title": "Show HN: OctoDNS, Tools for managing DNS across multiple providers",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45992152",
    "title": "Income distributions in Americans' pastimes (2017)",
    "url": "https://old.reddit.com/r/dataisbeautiful/comments/6heb75/income_distributions_in_americans_pastimes_oc/",
    "summary": "生成摘要时出错",
    "chinese_title": "Income distributions in Americans' pastimes (2017)",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45970338",
    "title": "Show HN: RowboatX – open-source Claude Code for everyday automations",
    "url": "https://github.com/rowboatlabs/rowboat",
    "summary": "生成摘要时出错",
    "chinese_title": "Show HN: RowboatX – open-source Claude Code for everyday automations",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45981535",
    "title": "Sam 3D: Powerful 3D Reconstruction for Physical World Images",
    "url": "https://ai.meta.com/blog/sam-3d/?_fb_noscript=1",
    "summary": "生成摘要时出错",
    "chinese_title": "Sam 3D: Powerful 3D Reconstruction for Physical World Images",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45896776",
    "title": "Branching with or Without PII: The Future of Environments",
    "url": "https://neon.com/blog/branching-environments-anonymized-pii",
    "summary": "生成摘要时出错",
    "chinese_title": "Branching with or Without PII: The Future of Environments",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45966251",
    "title": "Nearly all UK drivers say headlights are too bright",
    "url": "https://www.bbc.com/news/articles/c1j8ewy1p86o",
    "summary": "生成摘要时出错",
    "chinese_title": "Nearly all UK drivers say headlights are too bright",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45974681",
    "title": "Strace-macOS: A clone of the strace command for macOS",
    "url": "https://github.com/Mic92/strace-macos",
    "summary": "生成摘要时出错",
    "chinese_title": "Strace-macOS: A clone of the strace command for macOS",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45913870",
    "title": "Bluetooth Channel Sounding: The Next Leap in Bluetooth Innovation",
    "url": "https://www.embedded.com/bluetooth-channel-sounding-the-next-leap-in-bluetooth-innovation?_gl=1*8e3cij*_gcl_au*MzQwNzM2NDAxLjE3NjMwMzUwNzA.*_ga*NDc3NjU3MDk3LjE3NjMwMzUwNzA.*_ga_ZLV02RYCZ8*czE3NjMwMzUwNjkkbzEkZzAkdDE3NjMwMzUwNjkkajYwJGwwJGgw",
    "summary": "生成摘要时出错",
    "chinese_title": "Bluetooth Channel Sounding: The Next Leap in Bluetooth Innovation",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45988687",
    "title": "Understanding neural networks through sparse circuits",
    "url": "https://openai.com/index/understanding-neural-networks-through-sparse-circuits/",
    "summary": "生成摘要时出错",
    "chinese_title": "Understanding neural networks through sparse circuits",
    "chinese_summary": "生成摘要时出错"
  }
]