[
  {
    "id": "44625292",
    "title": "XMLUI",
    "url": "https://blog.jonudell.net/2025/07/18/introducing-xmlui/",
    "summary": "XMLUI aims to bring the accessibility of Visual Basic development from the 1990s to the modern web, leveraging React components with XML markup. It provides a suite of pre-built components that non-expert coders can compose to create reactive, themed web applications without needing deep knowledge of React or CSS.\n\nKey benefits include:\n\n*   **Accessibility:** Enables developers without advanced React skills to build applications.\n*   **Component-Based Architecture:** Uses XML to define and compose React components.\n*   **Reactivity:** Employs reactive data binding, similar to spreadsheets, where changes in one component automatically update dependent components.\n*   **Theming:** Offers a comprehensive theming system with customizable variables for consistent styling without writing CSS.\n*   **User-Defined Components:** Allows developers to create custom components that integrate with the native XMLUI set.\n*   **Scripting:** Supports JavaScript scripting for more complex logic, accessible to developers with basic scripting skills.\n*   **AI Collaboration:** Integrates with LLMs through the Model Context Protocol (MCP) to facilitate code generation, review, and maintenance, allowing developers to control the AI assistance level.\n\nXMLUI seeks to empower developers to read, maintain, and modify code generated by LLMs by operating within a familiar XML-based environment. By combining the power of React with the simplicity of XML, XMLUI bridges the gap between complex web development frameworks and accessible development environments.\n",
    "chinese_title": "XML用户界面",
    "chinese_summary": "XMLUI旨在将上世纪90年代Visual Basic开发的易用性带到现代Web，利用带有XML标记的React组件。它提供了一套预构建的组件，非专业程序员可以通过组合这些组件来创建响应式的、主题化的Web应用程序，而无需深入了解React或CSS。\n\n主要优势包括：\n\n*   **易用性：** 使没有高级React技能的开发人员也能构建应用程序。\n*   **组件化架构：** 使用XML来定义和组合React组件。\n*   **响应式：** 采用响应式数据绑定，类似于电子表格，一个组件中的更改会自动更新依赖的组件。\n*   **主题化：** 提供全面的主题系统，具有可自定义的变量，无需编写CSS即可实现一致的样式。\n*   **用户自定义组件：** 允许开发人员创建可与原生XMLUI集成的自定义组件。\n*   **脚本：** 支持JavaScript脚本，用于更复杂的逻辑，方便具备基本脚本技能的开发人员使用。\n*   **AI协作：** 通过模型上下文协议 (MCP) 与 LLM 集成，以促进代码生成、审查和维护，从而允许开发人员控制 AI 辅助级别。\n\nXMLUI 致力于使开发人员能够在熟悉的基于 XML 的环境中，读取、维护和修改由 LLM 生成的代码。通过将 React 的强大功能与 XML 的简单性相结合，XMLUI 弥合了复杂 Web 开发框架和易于访问的开发环境之间的差距。"
  },
  {
    "id": "44623953",
    "title": "Coding with LLMs in the summer of 2025 – an update",
    "url": "https://antirez.com/news/154",
    "summary": "Given the title \"Coding with LLMs in the summer of 2025 – an update,\" a summary would focus on how coding practices have evolved through the use of Large Language Models (LLMs) by that point. It would likely touch upon advancements, benefits, challenges, and the overall impact of LLMs on software development.\n\nHere's a possible summary:\n\nThe article \"Coding with LLMs in the summer of 2025 – an update\" likely discusses the current state of LLM-assisted coding practices. It likely covers how LLMs have matured since their early adoption and the impact they've had on the software development landscape. The update may highlight improvements in LLM capabilities, such as more accurate code generation, better understanding of complex coding requirements, and enhanced debugging assistance.\n\nThe article might delve into the benefits observed in 2025, such as increased developer productivity, faster prototyping, reduced error rates, and democratized access to coding by enabling individuals with limited technical backgrounds to contribute. It may also discuss the evolving roles of developers, potentially shifting from writing extensive code to overseeing and refining LLM-generated code.\n\nHowever, the update likely addresses the challenges and concerns that remain. These could include issues related to code security, data privacy, bias in generated code, the need for human oversight, and the potential for job displacement. The article might explore new tools, techniques, and best practices that have emerged to mitigate these challenges. Finally, it might offer predictions and insights into the future trajectory of LLM-assisted coding and its long-term implications for the software development industry.\n",
    "chinese_title": "2025年夏利用LLM编程——最新进展",
    "chinese_summary": "标题“2025年夏日使用LLM编程——进展更新”的摘要，可能会侧重于当时通过使用大型语言模型（LLM）而演变的编程实践。它可能会涉及LLM在软件开发方面的进步、益处、挑战和总体影响。\n\n文章“2025年夏日使用LLM编程——进展更新”可能讨论了LLM辅助编程实践的现状。它可能涵盖了LLM自早期应用以来的成熟度及其对软件开发领域的影响。 该更新可能重点介绍了LLM能力的改进，例如更准确的代码生成、对复杂编码要求的更好理解以及增强的调试辅助。\n\n文章可能会深入探讨2025年观察到的益处，例如提高的开发人员生产力、更快的原型设计、降低的错误率以及通过使技术背景有限的个人能够做出贡献来实现的编码的民主化。它还可能讨论开发人员不断变化的角色，可能从编写大量代码转向监督和改进LLM生成的代码。\n\n然而，该更新可能还会解决仍然存在的挑战和担忧。 这些可能包括与代码安全性、数据隐私、生成代码中的偏差、人工监督的必要性以及潜在的职位流失相关的问题。 该文章可能会探讨为减轻这些挑战而出现的新工具、技术和最佳实践。 最后，它可能会提供对LLM辅助编程的未来轨迹及其对软件开发行业的长期影响的预测和见解。"
  },
  {
    "id": "44625360",
    "title": "The old Caveman Chemistry website (1996-2000)",
    "url": "https://cavemanchemistry.com/oldcave/",
    "summary": "This document is an archived webpage from 1996-2000 describing Chemistry 104, \"From Caveman to Chemist,\" taught at an unspecified institution. The course explores the history of technology, starting with basic skills like fire-making and stone tools, progressing to modern advancements like plastics and semiconductors. Students learn about landmark technologies by reading and, most importantly, creating things like paper, metals, and batteries from scratch.\n\nThe course focuses on hands-on projects. Students complete projects consisting of a quiz and a physical product, earning credit when both are satisfactory. Projects are also categorized as quiz-only, paper-based (requiring a 4-6 page essay), or tribal (group-based). Some projects can be completed at the student's own pace, while others require access to chemistry lab equipment. Students are limited to one project attempt per day.\n\nThe webpage lists the possible projects available for credit, encompassing a wide range of topics like gunpowder, acids, metals, batteries, paper, fire, pottery, and even mead and alcohol production. Behaviors like attending class and participating in Halloween-themed activities are also counted as projects.\n\nThe final grade is determined solely by the number of completed projects, with specific project counts corresponding to different letter grades. Bonus projects can be earned through perfect attendance or completing 7 projects by Halloween. The site boasts an Alchemist's WebPick award for its educational resources. Finally, links to the professor's homepage, the chemistry department, and the college website are provided, along with a copyright notice.\n",
    "chinese_title": "旧石器时代化学网站（1996-2000）",
    "chinese_summary": "该文档是1996-2000年间一未指明机构教授的化学104课程“从穴居人到化学家”的存档网页。该课程探索技术史，从生火和石器等基本技能开始，逐步发展到塑料和半导体等现代进步。学生通过阅读以及更重要的是从头开始制作纸张、金属和电池等物品来学习具有里程碑意义的技术。\n\n该课程侧重于动手项目。学生完成包含测验和实物产品的项目，当两者都令人满意时，即可获得学分。项目还分为仅测验、基于论文（需要4-6页的文章）或部落（基于小组）三种类型。有些项目可以按照学生自己的节奏完成，而另一些项目则需要使用化学实验室设备。学生每天只能尝试一个项目。\n\n该网页列出了可获得学分的可能项目，涵盖广泛的主题，如火药、酸、金属、电池、纸张、火、陶器，甚至蜂蜜酒和酒精生产。诸如上课和参加万圣节主题活动等行为也被计为项目。\n\n最终成绩仅由完成的项目数量决定，特定的项目数量对应于不同的字母等级。可以通过全勤或在万圣节前完成7个项目来获得奖励项目。该网站因其教育资源而荣获炼金术士网络精选奖。最后，提供了指向教授主页、化学系和学院网站的链接，以及版权声明。"
  },
  {
    "id": "44623581",
    "title": "A Tour of Microsoft's Mac Lab (2006)",
    "url": "https://davidweiss.blogspot.com/2006/04/tour-of-microsofts-mac-lab.html",
    "summary": "This 2006 article offers a virtual tour of Microsoft's Mac Lab, where software is tested to ensure compatibility and quality of Mac versions of Microsoft products. The lab is described as a 2000-square-foot space filled with a diverse range of Apple hardware, from vintage models to current machines, used for testing and training.\n\nA key component is the \"Sandbox,\" housing various Apple hardware configurations. The article highlights the robust backup system utilizing ADIC robots and Veritas Backup Exec, crucial for data preservation, even after a major data loss incident.\n\nA significant portion of the lab is dedicated to automated testing. Hundreds of Mac minis are networked and controlled via KVM switches and Apple Remote Desktop to execute thousands of daily tests on new Office builds. The system is built around an Xserve RAID and XSAN, holding OS images from Mac OS 8.1 to 10.4.6. The author emphasizes the cost-effectiveness of using Mac minis for this purpose.\n\nThe tour also touches upon peripheral aspects like hallway design to facilitate access to hardware, the team's commitment to maintaining a fun work environment with a foosball table and morale events, a comprehensive software library, and a printer lab equipped with various models for thorough print testing. The author concludes by highlighting Microsoft's dedication to ensuring Mac versions of Office meet the platform's expectations for quality and WYSIWYG printing.\n",
    "chinese_title": "微软Mac实验室参观记 (2006)",
    "chinese_summary": "2006年文章：微软Mac实验室虚拟之旅，该实验室负责测试软件，以确保微软产品Mac版本的兼容性和质量。实验室占地2000平方英尺，陈列着各种各样的苹果硬件，从老式机型到最新款，用于测试和培训。\n\n关键组成部分是“沙盒”，其中包含各种苹果硬件配置。文章重点介绍了使用ADIC机器人和Veritas Backup Exec的强大备份系统，这对于数据保存至关重要，即使在发生重大数据丢失事件之后也是如此。\n\n实验室的很大一部分专门用于自动化测试。数百台Mac mini通过KVM切换器和Apple Remote Desktop联网和控制，以每天在新Office版本上执行数千次测试。该系统围绕Xserve RAID和XSAN构建，保存着从Mac OS 8.1到10.4.6的操作系统映像。作者强调了使用Mac mini进行此目的的成本效益。\n\n这次参观还涉及外围方面，如便于硬件访问的走廊设计、团队致力于通过桌上足球和士气活动来维持有趣的工作环境、全面的软件库以及配备各种型号的打印实验室，用于彻底的打印测试。作者最后强调了微软致力于确保Office的Mac版本符合平台对质量和WYSIWYG打印的期望。"
  },
  {
    "id": "44624114",
    "title": "Digital vassals? French Government 'exposes citizens' data to US'",
    "url": "https://brusselssignal.eu/2025/07/digital-vassals-french-government-exposes-citizens-data-to-us/",
    "summary": "A French Senate report has accused the French government of \"political fault\" for its increasing reliance on US tech giants like Microsoft, which exposes French citizens' data to US extraterritorial laws, such as FISA and the CLOUD Act, potentially compromising national sovereignty. Despite warnings and available European alternatives, government entities, including the Ministry of Education and École Polytechnique, have signed deals with US companies. Microsoft France's legal director admitted the company couldn't guarantee French data hosted by them wouldn't be handed over to foreign authorities.\n\nFrench MP Philippe Latombe blames bureaucratic inertia and the government's tendency to discredit European alternatives as too costly or inefficient. He argues that France needs to consider broader factors like the social contributions of French companies. He also criticized the US-EU Data Privacy Framework (DPF) and lamented the acquisition of a Franco-German cybersecurity firm by a US company.\n\nWhile Denmark is pivoting away from Microsoft with open-source alternatives, a report indicates Europe sends hundreds of billions to US companies, hindering European job creation and leaving the continent digitally vulnerable. The European Commission is seen as an obstacle to digital sovereignty, prioritizing open markets over supporting national or EU suppliers. A European Parliament report reveals that US companies dominate the European cloud infrastructure market, holding the vast majority of the data.\n",
    "chinese_title": "数字附庸？法国政府“将公民数据暴露给美国”",
    "chinese_summary": "法国参议院报告指责法国政府“政治失误”，因其日益依赖微软等美国科技巨头，这使得法国公民的数据暴露在美国域外法律（如《外国情报监视法》和《云法案》）之下，可能危及国家主权。尽管有警告和可用的欧洲替代方案，包括教育部和巴黎综合理工学院在内的政府实体仍与美国公司签署了协议。微软法国的法律总监承认，该公司无法保证其托管的法国数据不会被移交给外国当局。\n\n法国议员菲利普·拉托姆将此归咎于官僚惰性以及政府倾向于贬低欧洲替代方案，认为其成本过高或效率低下。他认为，法国需要考虑更广泛的因素，例如法国公司对社会的贡献。他还批评了美国-欧盟数据隐私框架(DPF)，并感叹一家法德网络安全公司被一家美国公司收购。\n\n丹麦正在转向使用开源替代方案，摆脱对微软的依赖，而一份报告显示，欧洲向美国公司输送了数千亿资金，阻碍了欧洲的就业创造，并使欧洲在数字方面变得脆弱。 欧盟委员会被视为数字主权的障碍，其优先考虑开放市场，而不是支持国家或欧盟供应商。欧洲议会的一份报告显示，美国公司在欧洲云基础设施市场占据主导地位，掌握着绝大部分数据。"
  },
  {
    "id": "44622608",
    "title": "LLM architecture comparison",
    "url": "https://magazine.sebastianraschka.com/p/the-big-llm-architecture-comparison",
    "summary": "This article provides an architectural comparison of recent Large Language Models (LLMs), focusing on DeepSeek V3/R1 and OLMo 2, released in late 2024 and 2025. It emphasizes structural changes rather than benchmark performance or training details.\n\nDeepSeek V3 distinguishes itself with Multi-Head Latent Attention (MLA) and Mixture-of-Experts (MoE). MLA compresses key and value tensors for more efficient KV caching, potentially outperforming Multi-Head Attention (MHA) in modeling performance. MoE replaces standard feedforward blocks with multiple \"expert\" blocks, significantly increasing the model's parameter count. However, only a subset of experts are activated per token, maintaining inference efficiency while enhancing the model's capacity to absorb knowledge. DeepSeek V3 employs 256 experts, but only 9 are active at a time, including a shared expert for learning common patterns.\n\nOLMo 2, developed by the Allen Institute for AI, prioritizes transparency in training data and code. Its architectural focus lies in normalization techniques.  OLMo 2 uses RMSNorm instead of LayerNorm, implementing a flavor of Post-Norm, positioning normalization layers *after* the attention and feedforward layers within the residual connections to improve training stability.  It also incorporates QK-Norm, applying RMSNorm to the queries and keys within the Multi-Head Attention module before applying RoPE. Unlike DeepSeek V3, OLMo 2 uses traditional MHA instead of MLA or GQA.  Despite not topping benchmark leaderboards, OLMo 2 serves as a valuable blueprint for LLM development due to its open nature.\n",
    "chinese_title": "LLM架构对比",
    "chinese_summary": "近期大型语言模型（LLM）架构对比：DeepSeek V3/R1 与 OLMo 2，重点关注架构变化，而非基准性能或训练细节。\n\nDeepSeek V3 凭借多头潜在注意力（MLA）和混合专家（MoE）脱颖而出。MLA 压缩键和值张量，实现更高效的 KV 缓存，在建模性能方面可能优于多头注意力（MHA）。MoE 用多个“专家”块替换标准前馈块，显著增加模型参数数量。然而，每个 token 仅激活一部分专家，在保持推理效率的同时增强模型吸收知识的能力。DeepSeek V3 采用 256 个专家，但一次只激活 9 个，其中包括一个用于学习常见模式的共享专家。\n\nOLMo 2 由艾伦人工智能研究所开发，优先考虑训练数据和代码的透明度。其架构重点在于归一化技术。OLMo 2 使用 RMSNorm 代替 LayerNorm，实现一种 Post-Norm 风格，将归一化层置于残差连接中注意力层和前馈层*之后*，以提高训练稳定性。它还结合了 QK-Norm，在应用 RoPE 之前，将 RMSNorm 应用于多头注意力模块中的查询和键。与 DeepSeek V3 不同，OLMo 2 使用传统 MHA，而不是 MLA 或 GQA。尽管 OLMo 2 没有登上基准排行榜榜首，但由于其开放性，它为 LLM 开发提供了一个有价值的蓝图。"
  },
  {
    "id": "44626363",
    "title": "Speeding Up My ZSH Shell",
    "url": "https://scottspence.com/posts/speeding-up-my-zsh-shell",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "加速我的 ZSH Shell",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "44622454",
    "title": "Async I/O on Linux in databases",
    "url": "https://blog.canoozie.net/async-i-o-on-linux-and-durability/",
    "summary": "This article details the author's exploration of using Linux's `io_uring` for asynchronous I/O to improve the performance of a key-value database. The traditional approach of synchronous writes and `fsync()` after each transaction proved to be a bottleneck. `io_uring` allows for truly asynchronous I/O, enabling parallel operations on modern NVMe SSDs that can handle thousands of concurrent requests.\n\nThe initial experiment of replacing synchronous WAL writes with asynchronous ones drastically increased throughput, but introduced data consistency issues, as data might reside in kernel buffers even after a successful response was sent to the client. To address this, the author implemented a dual WAL design, inspired by TigerBeetle: an Intent WAL (recording planned operations) and a Completion WAL (recording successful completions).\n\nThe protocol involves writing an intent record asynchronously, performing the operation in memory, writing a completion record asynchronously, waiting for the completion record to be durably written, and then returning success to the client. During recovery, only operations with both intent and completion records are replayed.\n\nThe implementation uses separate `io_uring` instances for each WAL to prevent head-of-line blocking and circular buffers for batching. Benchmarks showed a 10x throughput improvement, and the system scaled better with multiple CPU cores. The author concludes that hardware parallelism matters, batching is critical, consistency models can be flexible, and recovery can be more sophisticated. The experiment highlights the potential for rethinking database architecture when I/O is cheap and parallel.\n",
    "chinese_title": "数据库中Linux上的异步I/O",
    "chinese_summary": "本文详细介绍了作者探索使用 Linux 的 `io_uring` 进行异步 I/O 以提高键值数据库性能的过程。传统的同步写入和每次事务后的 `fsync()` 被证明是瓶颈。`io_uring` 允许真正的异步 I/O，从而可以在现代 NVMe SSD 上实现并行操作，处理数千个并发请求。\n\n最初将同步 WAL 写入替换为异步写入的实验大幅提高了吞吐量，但引入了数据一致性问题，因为即使在向客户端发送成功响应后，数据可能仍驻留在内核缓冲区中。为了解决这个问题，作者实现了一种双 WAL 设计，灵感来自 TigerBeetle：一个 Intent WAL（记录计划的操作）和一个 Completion WAL（记录成功的完成）。\n\n该协议涉及异步写入 Intent 记录，在内存中执行操作，异步写入 Completion 记录，等待 Completion 记录持久写入，然后向客户端返回成功。在恢复期间，仅重放同时具有 Intent 和 Completion 记录的操作。\n\n该实现为每个 WAL 使用单独的 `io_uring` 实例，以防止队头阻塞，并使用循环缓冲区进行批处理。基准测试显示吞吐量提高了 10 倍，并且系统在使用多个 CPU 核心时扩展性更好。作者总结道，硬件并行性很重要，批处理至关重要，一致性模型可以灵活，并且恢复可以更复杂。该实验突出了在 I/O 廉价且并行时重新思考数据库架构的潜力。"
  },
  {
    "id": "44594584",
    "title": "Show HN: Conductor, a Mac app that lets you run a bunch of Claude Codes at once",
    "url": "https://conductor.build/",
    "summary": "Conductor is a Mac app designed to streamline the use of multiple Claude Code agents simultaneously. It allows users to run Claude Code instances in parallel, each with its own isolated workspace, making it easier to manage, monitor, and review code changes.\n\nThe app handles the underlying Git worktree management for each agent. Users simply add their repo, and Conductor clones it and creates separate worktrees for each agent.\n\nConductor integrates with existing Claude Code setups, utilizing API keys or Claude Pro/Max plans as already configured by the user. The current version supports Claude Code, with plans to incorporate other coding agents in the future.\n\nEarly users have praised Conductor for its intuitive UI and its ability to unlock new levels of productivity by enabling orchestration of AI coding agents. Testimonials highlight its potential to empower users, making them more efficient and productive while working with AI-assisted coding. Melty Labs built Conductor using Conductor itself.\n",
    "chinese_title": "Show HN: Conductor，一款Mac应用，可同时运行多个Claude代码。",
    "chinese_summary": "Conductor：一款用于并行管理多个Claude Code智能体的Mac应用。它允许用户并行运行多个Claude Code实例，每个实例都有独立的workspace，从而更易于管理、监控和审查代码变更。\n\n该应用处理每个智能体的底层Git工作区管理。用户只需添加他们的仓库，Conductor就会克隆它并为每个智能体创建单独的工作区。\n\nConductor与现有的Claude Code设置集成，利用用户已配置的API密钥或Claude Pro/Max计划。当前版本支持Claude Code，未来计划整合其他编码智能体。\n\n早期用户称赞Conductor具有直观的UI，并能够通过协调AI编码智能体来释放新的生产力水平。评价强调了它赋予用户能力、提高他们在使用AI辅助编码时的效率和生产力的潜力。Melty Labs 使用 Conductor 本身构建了 Conductor。"
  },
  {
    "id": "44622973",
    "title": "A human metaphor for evaluating AI capability",
    "url": "https://mathstodon.xyz/@tao/114881418225852441",
    "summary": "The provided text is incomplete and only shows the beginning of a statement by Terence Tao on Mathstodon, a Mastodon instance. It's impossible to provide a full summary without the complete article. However, we can infer based on the title and the snippet provided:\n\nThe title suggests the article explores using human characteristics or skills as a metaphorical benchmark for assessing the capabilities of Artificial Intelligence (AI). The incomplete statement likely uses a human analogy to help understand the current limitations or potential of AI.\n\nGiven the context of Terence Tao (a renowned mathematician) on Mathstodon, it's highly probable the article delves into a nuanced discussion about AI's problem-solving abilities, perhaps comparing them to those of a human mathematician. It might explore:\n\n*   **Specific limitations:** Tao might point out specific areas where current AI falls short of human capabilities in problem-solving, creativity, or intuition.\n*   **Strengths of AI:** He might also acknowledge areas where AI excels, such as processing large datasets or performing complex calculations rapidly.\n*   **The value of the metaphor:** The article likely emphasizes that the human metaphor is just that – a comparison tool. It's helpful for understanding but shouldn't be taken as a definitive measure of AI's worth or potential.\n*   **Future potential:** The discussion could touch on the future development of AI and how it might evolve to better mimic or even surpass certain human capabilities.\n\nTo get a proper summary, the full content of the article is necessary.\n",
    "chinese_title": "用人类比喻评估人工智能能力",
    "chinese_summary": "提供的文本不完整，仅展示了陶哲轩在 Mathstodon（一个 Mastodon 实例）上发表的声明的开头。在没有完整文章的情况下，无法提供完整的总结。然而，我们可以根据标题和提供的片段推断：\n\n标题表明文章探讨了使用人类特征或技能作为评估人工智能 (AI) 能力的隐喻性基准。不完整的陈述可能使用人类类比来帮助理解人工智能当前的局限性或潜力。\n\n鉴于陶哲轩（一位著名的数学家）在 Mathstodon 上的背景，该文章很可能深入探讨了关于人工智能解决问题能力的细致讨论，也许将其与人类数学家的能力进行比较。它可能探讨：\n\n*   **具体限制：** 陶哲轩可能会指出当前人工智能在解决问题、创造力或直觉方面不足人类能力的具体领域。\n*   **人工智能的优势：** 他也可能承认人工智能擅长的领域，例如处理大型数据集或快速执行复杂计算。\n*   **隐喻的价值：** 该文章可能强调人类隐喻仅仅是一种比较工具。它有助于理解，但不应被视为衡量人工智能价值或潜力的最终标准。\n*   **未来潜力：** 讨论可能会涉及人工智能的未来发展，以及它如何进化以更好地模仿甚至超越某些人类能力。\n\n要获得适当的摘要，需要文章的完整内容。"
  },
  {
    "id": "44624952",
    "title": "How Tesla is proving doubters right on why its robotaxi service cannot scale",
    "url": "https://www.aol.com/elon-gambling-tesla-proving-doubters-090300237.html",
    "summary": "This Fortune article, written in July 2025, argues that Tesla's robotaxi service, launched a month prior in Austin, is not ready to scale and is proving doubters right. The central issue is the persistent need for human safety monitors due to the technology's unreliability, highlighted by an incident where a Tesla nearly drove into an oncoming train, requiring human intervention.\n\nElias Martinez, from FSD Community Tracker, argues that despite improvements in Tesla's Full Self-Driving (FSD) software, it's still prone to critical errors like running red lights and driving on the wrong side of the road, making widespread deployment unsafe. He claims that adding more vehicles only increases the statistical likelihood of accidents.\n\nMartinez suggests that Tesla's focus on meeting Elon Musk's launch timeline has overshadowed the need for technological perfection. He also believes the robotaxi launch is a PR stunt to distract from declining EV sales and the Cybertruck's underwhelming performance.\n\nThe article points to a lack of transparency from Tesla, criticizing the company for withholding safety data and instead, pushing for its confidentiality. Musk's only public data, quarterly crash statistics for FSD beta, are deemed insufficient as they reflect driver intervention, not true robotaxi performance.\n\nDespite this, Musk appears to be doubling down, even expanding the robotaxi service area in a publicity stunt. As a result, speculation on the likelihood of a fully functioning Tesla robotaxi service this year has decreased. Martinez concludes that premature scaling would put people at risk.\n",
    "chinese_title": "特斯拉的Robotaxi服务为何无法扩展，它正在证实怀疑论者的观点",
    "chinese_summary": "这篇2025年7月发表的《财富》杂志文章认为，特斯拉上个月在奥斯汀推出的Robotaxi服务尚未做好规模化准备，并证实了怀疑论者的观点。核心问题在于，由于技术不可靠，仍然需要人类安全监控员。一个特斯拉差点撞上迎面而来的火车的事件凸显了这一点，当时需要人工干预。\n\n来自FSD社区追踪的Elias Martinez认为，尽管特斯拉的完全自动驾驶（FSD）软件有所改进，但它仍然容易出现闯红灯和在道路错误一侧行驶等严重错误，这使得大规模部署不安全。他声称，增加车辆只会增加事故发生的统计可能性。\n\nMartinez认为，特斯拉专注于满足埃隆·马斯克的发布时间表，却忽视了对技术完善的需求。他还认为，Robotaxi的发布是一种公关噱头，旨在转移人们对电动汽车销量下滑和Cybertruck表现不佳的注意力。\n\n文章指出特斯拉缺乏透明度，批评该公司隐瞒安全数据，反而极力要求对其保密。马斯克唯一公开的数据，即FSD测试版的季度碰撞统计数据，被认为是不充分的，因为它们反映的是驾驶员的干预，而不是真正的Robotaxi性能。\n\n尽管如此，马斯克似乎正在加倍投入，甚至扩大了Robotaxi的服务区域，以进行宣传。因此，今年实现完全功能的特斯拉Robotaxi服务的可能性猜测有所降低。Martinez总结说，过早的规模化会将人们置于危险之中。"
  },
  {
    "id": "44623207",
    "title": "I'm betting against AI agents, despite building them",
    "url": "https://utkarshkanwat.com/writing/betting-against-agents/",
    "summary": "This article argues against the current hype surrounding AI agents, particularly the expectation of fully autonomous agents transforming work by 2025. The author, having built over a dozen production agent systems, contends that fundamental mathematical and engineering challenges prevent widespread success.\n\nThe core argument revolves around three hard truths: error rates compound exponentially in multi-step workflows, context windows lead to unsustainable token costs in conversational agents, and effective tool design is crucial but often overlooked. The author uses the example of a DevOps agent to illustrate how successful systems are architected with bounded contexts, verifiable operations, and human confirmation to mitigate error compounding.\n\nThe article highlights that high reliability (99.9%+) is a necessity for production systems, which is mathematically unattainable with purely autonomous, multi-step agent workflows, even with high per-step reliability.  Furthermore, conversational agents face quadratic cost scaling due to the need to process all previous context in each interaction, making them economically unsustainable at scale.\n\nThe author emphasizes that the majority of the work in successful agent systems is not in AI capabilities themselves, but rather in the painstaking engineering of tools and feedback systems that agents can effectively utilize.  This includes designing tools that provide the right feedback without overwhelming context windows, handling partial failures, and building recovery mechanisms. Finally, successful AI agents require careful integration with real-world enterprise systems, a complex process often underestimated.\n\nInstead of fully autonomous agents, the author predicts success for constrained, domain-specific tools that use AI for specific tasks while maintaining human control or strict boundaries, focusing on reliability and economic viability over complete autonomy.\n",
    "chinese_title": "我一边构建AI智能体，一边押注它们会失败。",
    "chinese_summary": "本文反驳了当前围绕AI Agent的热潮，特别是对完全自主的Agent将在2025年前改变工作的预期。作者构建过十几个生产级Agent系统，认为基本的数学和工程挑战阻碍了广泛成功。\n\n核心论点围绕三个残酷的真相：多步骤工作流程中的错误率呈指数级增长，上下文窗口导致对话Agent中不可持续的token成本，以及有效的工具设计至关重要但经常被忽视。作者以DevOps Agent为例，说明了如何通过有界上下文、可验证的操作和人工确认来架构成功的系统，从而减轻错误累积。\n\n文章强调，生产系统需要高可靠性（99.9%+），这在数学上是纯粹自主的多步骤Agent工作流程无法实现的，即使每一步的可靠性都很高。此外，由于需要在每次交互中处理所有先前的上下文，对话Agent面临二次成本增长，使其在规模上经济上不可持续。\n\n作者强调，成功的Agent系统中的大部分工作不是在AI能力本身，而是在于Agent可以有效利用的工具和反馈系统的艰苦工程设计。这包括设计在不压倒上下文窗口的情况下提供正确反馈的工具，处理部分故障以及构建恢复机制。最后，成功的AI Agent需要与现实世界的企业系统仔细集成，这是一个经常被低估的复杂过程。\n\n作者预测，与完全自主的Agent不同，受约束的、特定领域的工具将会取得成功，这些工具使用AI来执行特定任务，同时保持人工控制或严格的边界，侧重于可靠性和经济可行性，而不是完全自主。"
  },
  {
    "id": "44622374",
    "title": "Show HN: MCP server for Blender that builds 3D scenes via natural language",
    "url": "https://blender-mcp-psi.vercel.app/",
    "summary": "Blender MCP (Model Context Protocol) is a system that allows Large Language Models (LLMs) to control Blender in real-time via simple JSON instructions sent over a TCP connection. It essentially transforms AI into a 3D co-pilot. The system avoids the need for plugins or manual clicks, providing an instant AI-to-3D pipeline. It employs a lightweight JSON protocol for reliable and extensible communication, enabling seamless integration with various LLMs like Claude, ChatGPT, and open-source alternatives.\n\nBlender MCP grants complete control over 3D scenes, objects, materials, and animations, allowing the AI to create, modify, and animate scenes. The project aims to standardize the interface between LLMs and 3D software, making AI-powered 3D creation accessible and intuitive.\n\nThe system comprises a TCP server that handles connections and JSON parsing, a command processor that translates JSON commands to Blender Python API calls, and a scene controller that manages scene state and object manipulation.\n\nSetup involves cloning the GitHub repository, integrating with Claude Desktop by modifying its configuration file, and installing a Blender addon. Once set up, users can control Blender using natural language commands via Claude Desktop. The creator, Pranav Deshmukh, emphasizes the project's focus on bridging the gap between AI and creative tools, enabling collaborative AI-human creativity in 3D content creation.\n",
    "chinese_title": "Show HN: 通过自然语言构建Blender 3D场景的MCP服务器",
    "chinese_summary": "Blender MCP (模型上下文协议) 是一个系统，它允许大型语言模型 (LLM) 通过 TCP 连接发送的简单 JSON 指令实时控制 Blender。它本质上是将 AI 转换为 3D 副驾驶。 该系统避免了对插件或手动点击的需求，提供了一个即时的 AI 到 3D 管道。它采用轻量级的 JSON 协议来实现可靠且可扩展的通信，从而能够与各种 LLM（如 Claude、ChatGPT 和开源替代方案）无缝集成。\n\nBlender MCP 赋予对 3D 场景、对象、材质和动画的完全控制，允许 AI 创建、修改和动画场景。该项目旨在标准化 LLM 和 3D 软件之间的接口，使 AI 驱动的 3D 创建变得易于访问和直观。\n\n该系统包括一个处理连接和 JSON 解析的 TCP 服务器、一个将 JSON 命令转换为 Blender Python API 调用的命令处理器以及一个管理场景状态和对象操作的场景控制器。\n\n设置包括克隆 GitHub 存储库，通过修改其配置文件与 Claude Desktop 集成，以及安装 Blender 插件。 设置完成后，用户可以通过 Claude Desktop 使用自然语言命令控制 Blender。 创建者 Pranav Deshmukh 强调该项目专注于弥合 AI 和创意工具之间的差距，从而在 3D 内容创建中实现协作式 AI 人类创造力。"
  },
  {
    "id": "44600043",
    "title": "Laminar Flow Airfoil",
    "url": "http://www.aviation-history.com/theory/lam-flow.htm",
    "summary": "A laminar flow airfoil is designed to minimize drag by maintaining a smooth, uninterrupted airflow over the wing's surface. This smooth flow, or laminar flow, is crucial because disrupted airflow creates turbulence, leading to lift loss and increased drag. The ideal laminar airfoil is thin at the leading edge, progressively widening to its maximum thickness far aft, promoting boundary layer adhesion.\n\nThe North American P-51 Mustang was the first aircraft intentionally designed with laminar flow airfoils. However, manufacturing imperfections often prevented the achievement of optimal laminar flow. The Mustang's airfoil design was a \"semi-empirical venture,\" undergoing wind tunnel testing. A smooth surface finish is crucial for laminar flow, as imperfections disrupt the airflow. The Mustang's airfoil featured a thickness ratio of 15.1% at the wing root and 11.4% at the tip.\n\nWhile the B-24 Liberator also used a laminar flow airfoil, its designers were unaware of its laminar flow properties. NACA also modified aircraft in the late 1930s, such as a B-18, to have laminar flow test sections.\n\nLaminar flow occurs in the boundary layer, the area of air closest to the surface of an object. A favorable pressure gradient is crucial for maintaining laminar flow, which transitions to turbulent flow when destabilized by factors like adverse pressure gradients or surface roughness. Turbulent flow increases skin friction. Laminar flow airfoils are designed with long favorable pressure gradients, typically ending between 30% and 75% of the chord.\n\nProfile drag, comprising surface friction drag and normal pressure drag, impacts aircraft performance. Surface friction drag arises from the viscosity of air within the boundary layer, while normal pressure drag relates to flow separation and pressure distribution. A laminar boundary layer delays the point at which the flow becomes turbulent, reducing drag.\n",
    "chinese_title": "层流翼型",
    "chinese_summary": "层流翼型旨在通过保持机翼表面平滑、不间断的气流来最大程度地减少阻力。这种平滑的气流，即层流，至关重要，因为中断的气流会产生湍流，导致升力损失和阻力增加。理想的层流翼型在前缘较薄，逐渐加宽至最大厚度，靠后延伸，从而促进边界层的附着。\n\n北美P-51野马是第一架有意采用层流翼型设计的飞机。然而，制造缺陷通常妨碍了最佳层流的实现。野马的翼型设计是一项“半经验性冒险”，经历了风洞测试。光滑的表面光洁度对于层流至关重要，因为缺陷会扰乱气流。野马的翼型在翼根处的厚度比为15.1%，在翼尖处的厚度比为11.4%。\n\n虽然B-24解放者轰炸机也使用了层流翼型，但其设计者并未意识到其层流特性。NACA还在20世纪30年代末改装了飞机，例如一架B-18，使其具有层流测试部分。\n\n层流发生在边界层中，即最靠近物体表面的空气区域。有利的压力梯度对于维持层流至关重要，当受到不利压力梯度或表面粗糙度等因素的破坏时，层流会转变为湍流。湍流会增加表面摩擦。层流翼型设计具有较长的有利压力梯度，通常在弦长的30%到75%之间结束。\n\n型阻，包括表面摩擦阻力和法向压力阻力，会影响飞机的性能。表面摩擦阻力源于边界层内空气的粘性，而法向压力阻力与流动分离和压力分布有关。层流边界层延迟了流动变为湍流的点，从而减少了阻力。"
  },
  {
    "id": "44626107",
    "title": "The landlord gutting America’s hospitals",
    "url": "https://www.motherjones.com/politics/2025/07/the-landlord-gutting-americas-hospitals/",
    "summary": "This Mother Jones article focuses on Medical Properties Trust (MPT), a real estate company that owns nearly 400 healthcare facilities and rents them to hospital chains. The article alleges that MPT's business model of treating hospitals as financial assets is contributing to their decline.\n\nThe story highlights Glenwood Regional Medical Center in Louisiana, previously operated by Steward Health Care, as a case study. Glenwood faced significant financial struggles and lapses in patient care, including shortages of essential supplies and lack of specialists. A former nurse testified about the severe lack of essential medical equipment. State Representative Michael Echols suspected that the high rent paid to MPT was a contributing factor to Glenwood's financial problems.\n\nThe article points out that nine companies leasing hospitals from MPT have gone bankrupt, including Steward Health Care. It suggests that while hospitals are being sold, entangled in bankruptcy, or becoming depleted shells, MPT's executives are profiting handsomely. The article suggests that MPT's practices are leaving hospitals \"gutted,\" prioritizing financial gain over patient care.\n",
    "chinese_title": "房东掏空美国医院",
    "chinese_summary": "这篇《琼斯母亲》杂志的文章聚焦于医疗不动产信托公司（MPT），一家拥有近400家医疗设施并将其租赁给连锁医院的房地产公司。文章声称，MPT将医院视为金融资产的商业模式正在加剧它们的衰落。\n\n该报道以路易斯安那州的格伦伍德地区医疗中心（此前由斯图尔特医疗保健公司运营）为例。格伦伍德面临严重的财务困境和患者护理方面的疏忽，包括基本物资短缺和缺乏专科医生。一名前护士证实了严重缺乏基本医疗设备的情况。州代表迈克尔·埃科尔斯怀疑，支付给MPT的高额租金是导致格伦伍德财务问题的一个因素。\n\n文章指出，包括斯图尔特医疗保健公司在内的九家从MPT租赁医院的公司已经破产。文章暗示，当医院被出售、陷入破产或变成空壳时，MPT的高管们却在获取巨额利润。文章认为，MPT的做法正在让医院“空壳化”，将经济利益置于患者护理之上。"
  },
  {
    "id": "44583316",
    "title": "Hungary's oldest library is fighting to save books from a beetle infestation",
    "url": "https://www.npr.org/2025/07/14/nx-s1-5467062/hungary-library-books-beetles",
    "summary": "Hungary's oldest library, located in the 1,000-year-old Pannonhalma Archabbey, a UNESCO World Heritage site, is battling a severe drugstore beetle infestation that threatens to destroy 100,000 of its handbound books. The infestation, detected during a routine cleaning, has spread through a quarter of the library's 400,000 volumes.\n\nThe abbey houses Hungary's oldest book collection and important historical records, making the potential loss a significant blow to cultural, historical, and religious heritage. The library contains invaluable works, including 19 codices, a complete 13th-century Bible, and hundreds of pre-printing press manuscripts.\n\nTo combat the infestation, the books are being placed in hermetically sealed plastic sacks where oxygen is removed and replaced with nitrogen for six weeks to kill the beetles. Each book will then be inspected, vacuumed, and restored as needed.\n\nThe library director, Ilona Ásványi, expresses a deep sense of responsibility for preserving the collection, emphasizing the Benedictine principle of valuing monastery property as sacred. The library hopes to reopen next year.\n\nClimate change is suspected to be a contributing factor, as rising temperatures enable the beetles to reproduce more rapidly. Chief restorer Zsófia Edit Hajdu anticipates more insect infestations due to global warming, marking a shift from previous concerns about mold damage.\n",
    "chinese_title": "匈牙利最古老的图书馆正努力从甲虫侵扰中拯救书籍。",
    "chinese_summary": "位于联合国教科文组织世界遗产地——千年古刹潘农哈尔姆修道院内的匈牙利最古老图书馆，正遭受严重的药材甲虫侵扰，恐将摧毁其10万册手工装订书籍。这次虫害在一次例行清洁中被发现，已蔓延至图书馆40万册藏书的四分之一。\n\n该修道院藏有匈牙利最古老的书籍收藏和重要的历史记录，潜在的损失将对文化、历史和宗教遗产造成重大打击。图书馆收藏了无价之宝，包括19部古抄本、一部完整的13世纪圣经和数百部印刷机问世前的稿本。\n\n为了对抗虫害，书籍被放置在密封塑料袋中，氧气被抽出并用氮气代替，持续六周以杀死甲虫。之后，每本书都将被检查、吸尘，并根据需要进行修复。\n\n图书馆馆长伊洛娜·阿斯瓦尼表达了保护馆藏的强烈责任感，强调了本笃会珍视修道院财产为神圣之物的原则。图书馆希望明年重新开放。\n\n气候变化被认为是促成因素之一，因为气温升高使甲虫能够更快地繁殖。首席修复师佐菲娅·埃迪特·海杜预计，由于全球变暖，虫害会更加频繁，这标志着人们的担忧从以前的霉菌损害转向了虫害。"
  },
  {
    "id": "44582730",
    "title": "Show HN: ggc – A terminal-based Git CLI written in Go",
    "url": "https://github.com/bmf-san/ggc",
    "summary": "`ggc` is a terminal-based Git CLI tool written in Go, designed for speed, user-friendliness, and extensibility. It offers both a traditional command-line interface and an interactive mode with incremental search for easy command selection.\n\nKey features include simple commands for common Git operations and composite commands combining multiple actions. It supports macOS, Linux, and Windows, requiring Go 1.24+ and Git. Installation is streamlined through pre-compiled binaries, a quick install script, or building from source using `make`.\n\nThe interactive UI allows users to filter commands by typing, navigate with ctrl+n/ctrl+p, and execute with Enter. It prompts for arguments when necessary and provides feedback after execution. Available commands cover a wide range of Git functionalities, including branch management, commit operations, remote handling, configuration, hooks, and more.\n\nThe project includes shell completion scripts for Bash, Zsh, and Fish, improving usability. It also references official Git documentation, workflow resources, and alternative Git tools. Contribution guidelines are available, and the project is MIT licensed. Support can be shown through GitHub sponsors or by starring the repository.\n",
    "chinese_title": "Show HN: ggc – 一款用 Go 编写的基于终端的 Git CLI",
    "chinese_summary": "`ggc` 是一款基于终端的 Git CLI 工具，用 Go 编写，旨在实现速度快、用户友好和可扩展性。它既提供传统的命令行界面，也提供具有增量搜索的交互模式，方便命令选择。\n\n主要功能包括用于常见 Git 操作的简单命令和组合多个操作的复合命令。 它支持 macOS、Linux 和 Windows，需要 Go 1.24+ 和 Git。 可以通过预编译的二进制文件、快速安装脚本或使用 `make` 从源代码构建来简化安装。\n\n交互式 UI 允许用户通过键入来过滤命令，使用 ctrl+n/ctrl+p 进行导航，以及使用 Enter 执行。 它会在必要时提示参数并在执行后提供反馈。 可用命令涵盖广泛的 Git 功能，包括分支管理、提交操作、远程处理、配置、钩子等等。\n\n该项目包括 Bash、Zsh 和 Fish 的 shell 补全脚本，从而提高了可用性。 它还引用了官方 Git 文档、工作流程资源和其他 Git 工具。 贡献指南已提供，并且该项目已获得 MIT 许可。 可以通过 GitHub 赞助商或为存储库加星标来表示支持。"
  },
  {
    "id": "44618687",
    "title": "Make Your Own Backup System – Part 1: Strategy Before Scripts",
    "url": "https://it-notes.dragas.net/2025/07/18/make-your-own-backup-system-part-1-strategy-before-scripts/",
    "summary": "This article emphasizes the critical importance of robust backup strategies, highlighting the common underestimation of backup needs and the dangers of relying solely on \"the cloud.\" It underscores that data must be restorable, open, and consistent, citing real-world examples of data loss incidents like fires, floods, and ransomware attacks.\n\nThe author stresses the need for a well-defined backup plan before implementing any scripts or tools, emphasizing asking key questions about risk tolerance, data to protect, acceptable downtime, and available storage. A crucial decision involves choosing between full disk backups and individual file backups, each with advantages and disadvantages. Full disk backups allow for complete recovery and are ideal for virtualization systems, while individual file backups offer granularity and the ability to use standard utilities.\n\nThe article highlights the importance of snapshots to ensure data consistency during backups, especially for live file systems, and discusses different snapshot methods like native file system snapshots, LVM snapshots, and DattoBD. It also touches upon the architectural debate of \"push\" vs. \"pull\" backup initiation, favoring the \"pull\" method for centralized backup servers in secure environments.\n\nFinally, the article outlines key principles for a good backup system, including instant recovery, external storage, security, efficient space management, and minimal invasiveness. The author teases the next installment, which will detail the construction of a FreeBSD-powered backup server.\n",
    "chinese_title": "自建备份系统 – 第一部分：策略先于脚本",
    "chinese_summary": "本文强调了健全备份策略的关键重要性，突出了对备份需求普遍的低估以及仅仅依赖“云”的危险性。文章强调数据必须是可恢复的、开放的且一致的，并引用了火灾、洪水和勒索软件攻击等真实的数据丢失事件。\n\n作者强调，在实施任何脚本或工具之前，需要制定完善的备份计划，并着重强调要提出关于风险承受能力、要保护的数据、可接受的停机时间和可用存储空间的关键问题。一个关键的决定是在全盘备份和单独文件备份之间进行选择，每种方式都有其优点和缺点。全盘备份允许完全恢复，是虚拟化系统的理想选择，而单独文件备份则提供了粒度以及使用标准实用程序的能力。\n\n文章强调了快照对于确保备份期间数据一致性的重要性，特别是对于实时文件系统，并讨论了不同的快照方法，如原生文件系统快照、LVM 快照和 DattoBD。文章还涉及了“推送”与“拉取”备份启动的架构争论，倾向于在安全环境中为集中式备份服务器采用“拉取”方法。\n\n最后，文章概述了良好备份系统的关键原则，包括即时恢复、外部存储、安全性、高效的空间管理和最小的入侵性。作者预告了下一期文章，该文章将详细介绍如何构建基于 FreeBSD 的备份服务器。"
  },
  {
    "id": "44581725",
    "title": "How the 'Minecraft' Score Became Big Business for Its Composer",
    "url": "https://www.billboard.com/pro/how-minecraft-score-became-big-business-for-composer/",
    "summary": "Daniel Rosenfeld, known as C418, composed the iconic soundtrack for Minecraft as a side project. The game's massive success, culminating in Microsoft's $2.5 billion acquisition of Mojang, transformed Rosenfeld's small fee into a substantial business opportunity. Crucially, Rosenfeld retained ownership of the music rights, choosing not to sell them to Microsoft.\n\nPartnering with game composer manager Patrick McDermott, Rosenfeld navigated the complexities of building an independent music career. Minecraft Volume Alpha achieved gold certification and was inducted into the Library of Congress. The soundtracks boast billions of streams and significant vinyl sales, cultivated by a dedicated fanbase.\n\nDespite sacrificing future Minecraft scoring opportunities, Rosenfeld believes retaining ownership was the right choice, allowing him creative freedom. The new \"Minecraft Movie,\" featuring interpolations of his original score by Mark Mothersbaugh, provides some benefit from the film's blockbuster success.\n\nRosenfeld and McDermott highlighted the changing landscape of game music compensation, the rarity of composers retaining IP ownership, and the importance of understanding both the music and gaming industries. McDermott emphasized the untapped potential for game composers, citing missed royalties and opportunities. They strategically avoided YouTube Content ID claims to support game streamers. Both attribute the soundtrack's sustained growth to Minecraft's ongoing popularity and a shift in listener behavior from platforms like Bandcamp to streaming services like Spotify.\n",
    "chinese_title": "《我的世界》配乐作曲家如何靠配乐发家致富",
    "chinese_summary": "丹尼尔·罗森菲尔德，又名C418，以副业身份为《我的世界》创作了标志性的配乐。这款游戏的大获成功，最终促成了微软以25亿美元收购Mojang，这使得罗森菲尔德最初的小额酬劳变成了一个巨大的商机。至关重要的是，罗森菲尔德保留了音乐版权，没有将其出售给微软。\n\n在游戏作曲家经理帕特里克·麦克德莫特的帮助下，罗森菲尔德探索了建立独立音乐事业的复杂性。《我的世界 Alpha 原声带》获得了金唱片认证，并被收入美国国会图书馆。这些原声带拥有数十亿次的流媒体播放量和可观的黑胶唱片销量，这得益于一个忠实的粉丝群体。\n\n尽管牺牲了未来为《我的世界》配乐的机会，但罗森菲尔德认为保留所有权是正确的选择，这让他拥有了创作自由。新的“我的世界电影”，由马克·马瑟斯博格改编了他的原创配乐，为他带来了这部热门电影的部分收益。\n\n罗森菲尔德和麦克德莫特强调了游戏音乐报酬不断变化的格局、作曲家保留知识产权所有权的稀缺性，以及理解音乐和游戏行业的重要性。麦克德莫特强调了游戏作曲家未开发的潜力，并列举了错失的版税和机会。他们战略性地避免了YouTube的内容识别声明，以支持游戏主播。两人都将原声带的持续增长归功于《我的世界》的持续流行，以及听众行为从Bandcamp等平台转向Spotify等流媒体服务的转变。"
  },
  {
    "id": "44615801",
    "title": "Death by AI",
    "url": "https://davebarry.substack.com/p/death-by-ai",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "人工智能致死",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "44622999",
    "title": "Robot metabolism: Toward machines that can grow by consuming other machines",
    "url": "https://www.science.org/doi/10.1126/sciadv.adu6897",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "机器人代谢：制造能通过消耗其他机器而生长的机器",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "44616479",
    "title": "Nobody knows how to build with AI yet",
    "url": "https://worksonmymachine.substack.com/p/nobody-knows-how-to-build-with-ai",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "目前尚无人知晓如何利用人工智能进行构建。",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "44588388",
    "title": "Dual interfacial H-bonding-enhanced deep-blue hybrid copper–iodide LEDs",
    "url": "https://www.researchsquare.com/article/rs-4114691/v1",
    "summary": "This article introduces a novel one-dimensional (1D) hybrid copper iodide material, CuI(Hda), for efficient deep-blue light-emitting diodes (LEDs). CuI(Hda) exhibits near-unity photoluminescence quantum yield (PLQY) of 99.4% at 449 nm. The material consists of 1D-Cu4I84- anionic chains coordinated to cationic ligand Hdabco+.\n\nThe researchers fabricated high-quality polycrystalline thin films of CuI(Hda) via solution-processing and investigated its emission mechanism using temperature-dependent time-resolved photoluminescence (TRPL) and transient absorption (TA) spectroscopy, suggesting fluorescence, thermally activated delayed fluorescence (TADF), and phosphorescence. DFT calculations support these findings.\n\nTo enhance device performance, they implemented a dual interfacial hydrogen-bond passivation (DIHP) strategy, using a self-assembled monolayer (SAM) and an ultrathin PMMA capping layer to passivate the HTL/EML and EML/ETL interfaces, respectively.\n\nThe resulting DIHP-CuI(Hda) deep-blue LEDs achieved a record-high external quantum efficiency (EQEmax) of 12.57% for metal halide-based blue LEDs, a maximum luminance of 3970.30 cd/m², and excellent operational stability (T50) of 204 hours under ambient conditions. A large-area device (4 cm2) maintained high efficiency. The findings highlight the potential of copper iodide-based hybrids for solid-state lighting and display technologies.\n",
    "chinese_title": "双界面氢键增强型深蓝杂化铜-碘化物LED",
    "chinese_summary": "本文介绍了一种新型一维（1D）混合碘化亚铜材料CuI(Hda)，用于高效深蓝色发光二极管（LED）。CuI(Hda)在449 nm处表现出接近 единицы 的光致发光量子产率（PLQY），高达 99.4%。该材料由与阳离子配体Hdabco+ 配位的1D-Cu4I84-阴离子链组成。\n\n研究人员通过溶液法制备了高质量的CuI(Hda)多晶薄膜，并利用温度相关的瞬态时间分辨荧光光谱（TRPL）和瞬态吸收（TA）光谱研究了其发射机理，表明存在荧光、热激活延迟荧光（TADF）和磷光。密度泛函理论（DFT）计算结果支持了这些发现。\n\n为了提高器件性能，他们采用了一种双界面氢键钝化（DIHP）策略，分别使用自组装单分子层（SAM）和超薄PMMA覆盖层来钝化HTL/EML和EML/ETL界面。\n\n最终，基于 DIHP-CuI(Hda) 的深蓝色LED实现了金属卤化物基蓝色LED的创纪录的外部量子效率（EQEmax），达到12.57%，最大亮度为3970.30 cd/m²，并在环境条件下具有优异的运行稳定性（T50），达到204小时。大面积器件（4 cm2）保持了高效率。这些发现突出了基于碘化亚铜的混合材料在固态照明和显示技术中的潜力。"
  },
  {
    "id": "44597727",
    "title": "Behind the ballistics of the 'explosive' squirting cucumber",
    "url": "https://phys.org/news/2025-07-ballistics-explosive-squirting-cucumber.html",
    "summary": "This article details research into the explosive seed dispersal mechanism of the squirting cucumber (Ecballium elaterium). Researchers at Kiel University, led by Helen Gorges, used micro-computed tomography and high-speed videography to analyze the fruit's biomechanics during ripening and ejection. The study aimed to understand how the plant maximizes seed dispersal distance.\n\nThe team discovered that the squirting cucumber can launch its seeds at speeds up to 29 miles per hour, achieving distances of up to 12 meters. High-speed video revealed the explosion happens too quickly to be seen with the naked eye. They also found the fruit stem straightens during ripening, creating an angle close to the optimal 50° for maximizing shooting distance. Furthermore, the seeds consistently exit the fruit facing the same direction and develop a mucilaginous coat upon wetting, which acts as an adhesive to aid germination.\n\nThese findings could inspire the development of bio-inspired launching systems, including hydrogel-based actuators for medical tools, micro-robots, and applications in soft robotics and drug delivery, where energy-efficient launching systems are beneficial. The research was presented at the Society for Experimental Biology Annual Conference in Antwerp, Belgium.\n",
    "chinese_title": "“爆炸”喷瓜的弹道学",
    "chinese_summary": "本文详细介绍了对喷瓜（Ecballium elaterium）爆炸性种子传播机制的研究。基尔大学的 Helen Gorges 带领的研究人员使用微型计算机断层扫描和高速摄像技术，分析了果实在成熟和弹射过程中的生物力学。该研究旨在了解植物如何最大限度地提高种子传播距离。\n\n研究小组发现，喷瓜可以以高达每小时 29 英里的速度发射种子，达到高达 12 米的距离。高速视频显示，爆炸发生的速度太快，肉眼无法看到。他们还发现，果柄在成熟过程中会变直，形成接近最佳 50° 的角度，以最大限度地提高发射距离。此外，种子总是以相同的方向离开果实，并在润湿后形成粘液涂层，起到粘合剂的作用，以帮助发芽。\n\n这些发现可以启发生物启发式发射系统的开发，包括用于医疗工具、微型机器人以及软体机器人和药物输送领域的基于水凝胶的执行器，这些领域需要节能的发射系统。该研究在比利时安特卫普举行的实验生物学学会年会上发表。"
  },
  {
    "id": "44580567",
    "title": "I tried vibe coding in BASIC and it didn't go well",
    "url": "https://www.goto10retro.com/p/vibe-coding-in-basic",
    "summary": "Paul Lefebvre recounts his experiment with \"vibe coding\" – relying on an AI (ChatGPT) to write code through conversational prompts – in Atari BASIC. He expected challenges due to BASIC's age, fragmented versions, and limited online resources compared to modern languages.\n\nHe started with simple tasks like printing \"Hello, World\" and drawing a circle, which ChatGPT handled well after some minor corrections. He then attempted to create a drawing program and a simplified Space Invaders game.\n\nThe drawing program required several iterations to fix errors like incorrect joystick controls and syntax. The Space Invaders project proved even more challenging. ChatGPT produced code with syntax errors, screen flicker, incorrect graphics modes, and cursor issues. Lefebvre found himself repeatedly correcting the AI, leading to a tedious back-and-forth.\n\nUltimately, he abandoned the \"vibe coding\" approach for the Space Invaders game and wrote the working code himself. He concludes that while AI might be useful for modern languages, vibe coding with old-school BASIC proved ineffective. Someone unfamiliar with Atari BASIC would likely struggle to get anything functional through this method, as the AI consistently produced incorrect code and failed to learn from corrections effectively.\n",
    "chinese_title": "我尝试用BASIC语言进行氛围编码，但结果不太好。",
    "chinese_summary": "保罗·勒菲弗讲述了他用“氛围编程”进行的实验——即依靠人工智能（ChatGPT）通过对话提示用Atari BASIC编写代码。他预计会遇到挑战，因为BASIC年代久远，版本分散，与现代语言相比，在线资源有限。\n\n他从简单的任务开始，比如打印“Hello, World”和绘制一个圆圈，ChatGPT在经过一些小的修正后处理得很好。然后他尝试创建一个绘图程序和一个简化的太空侵略者游戏。\n\n绘图程序需要多次迭代才能修复错误，如不正确的操纵杆控制和语法。太空侵略者项目证明更具挑战性。ChatGPT生成的代码存在语法错误、屏幕闪烁、不正确的图形模式和光标问题。勒菲弗发现自己反复纠正人工智能，导致了繁琐的来回过程。\n\n最终，他放弃了用“氛围编程”来编写太空侵略者游戏，而是自己编写了可用的代码。他总结说，虽然人工智能可能对现代语言有用，但用老式BASIC进行氛围编程被证明是无效的。不熟悉Atari BASIC的人很可能难以通过这种方法获得任何功能性结果，因为人工智能始终生成不正确的代码，并且未能有效地从修正中学习。"
  },
  {
    "id": "44622953",
    "title": "The bewildering phenomenon of declining quality",
    "url": "https://english.elpais.com/culture/2025-07-20/the-bewildering-phenomenon-of-declining-quality.html",
    "summary": "Daniel Soufi's article explores the widespread perception of declining quality in goods and services, arguing that it's a complex phenomenon driven by multiple factors beyond just manufacturing standards. While the author acknowledges instances of objectively lower quality, like chipboard furniture and ChatGPT-generated articles, the core argument centers on shifting consumer values and economic realities.\n\nExpert Javier Carbonell attributes the feeling to the broken promise of capitalism, where hard work no longer guarantees a decent life. Social media amplifies this discontent by showcasing unattainable lifestyles. Furthermore, a \"culture of efficiency,\" exemplified by tech leaders like Elon Musk and Mark Zuckerberg, prioritizes cost-cutting measures over quality and workforce wellbeing.\n\nThe article highlights a generational divide in how quality is perceived. Older generations valued durability, while younger consumers prioritize novelty and fashion, contributing to the rise of fast fashion and disposable products. Psychologist Albert Vinyals points out that planned obsolescence, both real and perceived, fuels a cycle of constant consumption.\n\nThe article also touches on the impact of technology, particularly AI, on customer service and the reliability of online reviews. Automated customer service, while intended to improve efficiency, is often met with consumer rejection. The proliferation of fake online reviews, potentially generated by AI, further erodes trust and distorts perceptions of product quality.\n\nUltimately, the article suggests that the perceived decline in quality reflects a deeper societal shift. Consumers are complicit in this decline, driven by convenience, impulse buying, and a desire for novelty. The author concludes that addressing this issue requires a reevaluation of ethical consumption and a focus on sustainable production practices.\n",
    "chinese_title": "质量下降的怪象",
    "chinese_summary": "丹尼尔·苏菲的文章探讨了人们普遍认为商品和服务质量下降的现象，并认为这是一种复杂的现象，其驱动因素不仅限于制造标准。尽管作者承认存在客观上质量较低的例子，例如刨花板家具和ChatGPT生成的文章，但其核心论点集中在消费者价值观和经济现实的转变上。\n\n专家哈维尔·卡博内尔将这种感觉归因于资本主义的破灭，即努力工作不再能保证体面的生活。社交媒体通过展示无法实现的生活方式来放大这种不满。此外，以埃隆·马斯克和马克·扎克伯格等科技领袖为代表的“效率文化”，将削减成本置于质量和员工福祉之上。\n\n这篇文章强调了不同世代对质量的看法存在差异。老一辈人重视耐用性，而年轻消费者则优先考虑新颖性和时尚，这促成了快时尚和一次性产品的兴起。心理学家阿尔伯特·维尼尔斯指出，有计划的淘汰，无论是真实的还是被感知的，都会助长一种持续消费的循环。\n\n这篇文章还谈到了技术，特别是人工智能，对客户服务和在线评论可靠性的影响。自动化客户服务虽然旨在提高效率，但往往遭到消费者的抵制。可能由人工智能生成的虚假在线评论的泛滥，进一步削弱了信任并扭曲了对产品质量的看法。\n\n最终，这篇文章表明，感知到的质量下降反映了更深层次的社会转变。消费者对此负有连带责任，他们受到便利性、冲动购买和对新奇事物渴望的驱动。作者的结论是，解决这个问题需要重新评估道德消费，并关注可持续生产实践。"
  },
  {
    "id": "44620606",
    "title": "Beyond Meat fights for survival",
    "url": "https://foodinstitute.com/focus/beyond-meat-fights-for-survival/",
    "summary": "This article paints a bleak picture of Beyond Meat's future, arguing the company is fighting for survival. Despite increasing its product offerings, revenue growth has been minimal, and profitability remains elusive. The company faces a significant hurdle with $1 billion in convertible bonds due in 2027, which it is unlikely to be able to repay.\n\nThe stock's current value is attributed to short selling and a dwindling hope for a turnaround. The company's negotiating position regarding its debt is surprisingly aided by the low price of its bonds.\n\nOperationally, Beyond Meat aims to increase revenue through cost-cutting and addressing negative perceptions about its products' health profile, hoping to revive consumer demand and improve factory utilization.\n\nHowever, the article underscores that the overall plant-based meat category is facing challenges, evidenced by declining valuations of competitors like Impossible Foods and struggles with Kellogg's MorningStar Farms. While some demand for plant-based meat exists, the article concludes that Beyond Meat is running out of time to achieve significant growth before its debt matures, potentially leading to bondholder takeover. The author emphasizes that while the stock's failure wouldn't necessarily mean the end of the business or the plant-based meat industry, it reflects the disappointment in the company's inability to fulfill its ambitious goals.\n",
    "chinese_title": "超越肉类为生存而战",
    "chinese_summary": "本文描绘了Beyond Meat黯淡的未来，认为该公司正在为生存而战。尽管增加了产品种类，但收入增长甚微，盈利能力仍然难以实现。该公司面临着一项重大障碍，即2027年到期的10亿美元可转换债券，它不太可能偿还这笔债务。\n\n目前该股票的价值归因于卖空和对扭亏为盈的日益渺茫的希望。由于其债券价格低廉，该公司在债务方面的谈判地位出人意料地得到了帮助。\n\n在运营方面，Beyond Meat的目标是通过削减成本和解决对其产品健康形象的负面看法来增加收入，希望重振消费者需求并提高工厂利用率。\n\n然而，文章强调，整个植物性肉类类别正面临挑战，Impossible Foods等竞争对手的估值下降以及Kellogg's MorningStar Farms的困境就是证明。虽然对植物性肉类存在一些需求，但文章的结论是，Beyond Meat在债务到期前实现显著增长的时间已经不多了，这可能会导致债券持有人接管。作者强调，虽然该股票的失败不一定意味着企业或植物性肉类行业的终结，但它反映了人们对该公司未能实现其雄心勃勃目标感到失望。"
  },
  {
    "id": "44590391",
    "title": "How to run an Arduino for years on a battery (2021)",
    "url": "https://makecademy.com/arduino-battery",
    "summary": "This article details how to build and optimize an Arduino system to run for years on a battery. The initial problem with using an Arduino Uno directly is the constant power draw of its components. The solution involves creating a custom Arduino setup with only essential components and optimizing the code for low power consumption.\n\nThe article outlines the required hardware, including an ATMega328 microcontroller with Arduino bootloader, capacitors, resistors, LED, crystal clock, battery holder, AA batteries, breadboard, and jumper wires. It emphasizes powering the Arduino directly from the battery (around 3V) to avoid voltage regulator power loss.\n\nThe crucial optimization involves using the JeeLib library to put the Arduino to sleep during inactive periods. The provided code snippet demonstrates how to integrate the library and use the `Sleepy::loseSomeTime()` function to specify sleep durations.\n\nThe article quantifies the power consumption difference: a standard Arduino setup consumes 6.7mA when idle, while the optimized system using JeeLib consumes only 43uA - a 150x improvement. A calculation example suggests a temperature sensor application could theoretically last nearly 2 years on a set of batteries using this optimization. The core principle is applicable to any project where active time is minimal compared to sleep time, greatly extending battery life.\n",
    "chinese_title": "如何让Arduino用电池运行数年 (2021)",
    "chinese_summary": "如何构建和优化Arduino系统以电池供电运行数年"
  },
  {
    "id": "44591775",
    "title": "Mushroom learns to crawl after being given robot body (2024)",
    "url": "https://www.the-independent.com/tech/robot-mushroom-biohybrid-robotics-cornell-b2610411.html",
    "summary": "Researchers from Cornell University and the University of Florence have created a biohybrid robot controlled by a living king trumpet mushroom. The robot utilizes electrical signals from the mushroom to move and sense its surroundings. This innovative approach leverages the natural responsiveness of living organisms to environmental stimuli, potentially leading to robots capable of operating in unpredictable conditions.\n\nThe mushroom is integrated within a robot body, and different inputs, such as ultraviolet light, trigger various movement patterns. The robots use either legs or wheels for locomotion. Researchers believe the combination of mobility and the fungi's ability to detect chemical and biological signals could be valuable in various applications, such as sensing soil chemistry and optimizing fertilizer use in agriculture.\n\nThis development represents a significant step in biohybrid robotics due to the mushroom's hardiness and ability to thrive in harsh environments. The research, published in *Science Robotics*, highlights the potential of using living organisms to enhance robot functionality, following previous experiments involving artificial worm brains and muscle tissue-integrated robots.\n",
    "chinese_title": "蘑菇获得机器人身体后学会爬行 (2024)",
    "chinese_summary": "康奈尔大学和佛罗伦萨大学的研究人员创造了一种由活体大肥菇控制的生物混合机器人。该机器人利用蘑菇发出的电信号进行移动和感知周围环境。这种创新方法利用了生物对环境刺激的自然反应能力，有望制造出能够在不可预测的环境中运行的机器人。\n\n蘑菇被整合在机器人体内，紫外线等不同的输入会触发不同的运动模式。机器人使用腿或轮子进行移动。研究人员认为，移动性与真菌检测化学和生物信号的能力相结合，在各种应用中具有价值，例如感测土壤化学成分和优化农业中的肥料使用。\n\n由于蘑菇的耐寒性和在恶劣环境中生存的能力，这项发展代表了生物混合机器人技术的一个重要进步。这项发表在《科学·机器人》上的研究强调了利用生物增强机器人功能的潜力，此前有涉及人工蠕虫大脑和肌肉组织集成机器人的实验。"
  },
  {
    "id": "44622543",
    "title": "Roman Roads Research Association (UK)",
    "url": "https://www.romanroads.org/index.html",
    "summary": "The Roman Roads Research Association (RRRA) is a UK charity dedicated to advancing knowledge and promoting the study of Roman roads and heritage in the British Isles, inspired by Ivan D. Margary's work. They use modern technology like LiDAR to research Roman roads, revealing previously unseen archaeology.\n\nThe RRRA publishes its own peer-reviewed journal, *Itinera*, dedicated to Roman road research and Roman transport infrastructure both in Britannia and the rest of the Roman Empire. The fifth volume will be released digitally to members in June 2025, with printed copies available shortly after, and submissions are currently being accepted for Volume 6 (deadline November 15, 2025).\n\nThe RRRA hosts a series of online talks, and booking information for upcoming talks are regularly posted to the website. Topics range from specific Roman roads and archaeological sites to broader themes of Roman life and military activity. Many past lectures are available to view on their YouTube channel.\n\nThe organization is also developing a new website with improved functionality. They encourage members and non-members to contribute images for the homepage and the developing gazetteer. Membership support has enabled the RRRA to embark on projects such as Living Beyond the Town - Petuaria.\n",
    "chinese_title": "罗马道路研究协会（英国）",
    "chinese_summary": "罗马道路研究协会（RRRA）是一家英国慈善机构，致力于推进对不列颠群岛罗马道路和遗产的认知和研究，其灵感来源于伊万·D·马格里的著作。他们利用激光雷达等现代技术研究罗马道路，揭示此前未见的考古发现。\n\nRRRA出版自己的同行评审期刊《Itinera》，专门研究罗马道路以及大不列颠和罗马帝国其他地区的罗马交通基础设施。第五卷将于2025年6月以数字形式向会员发布，印刷版将在不久后提供，目前正在接受第六卷的投稿（截止日期为2025年11月15日）。\n\nRRRA举办一系列线上讲座，有关即将举行的讲座的预订信息会定期发布在网站上。主题范围广泛，从特定的罗马道路和考古遗址到更广泛的罗马生活和军事活动主题。许多过去的讲座都可以在其YouTube频道上观看。\n\n该组织还在开发一个具有改进功能的新网站。他们鼓励会员和非会员为首页和正在开发的地理索引贡献图像。会员的支持使RRRA得以开展诸如“城镇之外的生活 - 佩图阿利亚”之类的项目。"
  },
  {
    "id": "44617078",
    "title": "Local LLMs versus offline Wikipedia",
    "url": "https://evanhahn.com/local-llms-versus-offline-wikipedia/",
    "summary": "Evan Hahn compares the file sizes of local Large Language Models (LLMs) available through Ollama with offline Wikipedia downloads available through Kiwix. The comparison is inspired by the idea of using offline LLMs in disaster scenarios, referencing an MIT Technology Review article.\n\nHahn emphasizes that the comparison is not perfect due to the different natures of encyclopedias and LLMs. He acknowledges that file size is not the only factor, noting that LLMs require significant memory and processing power, while offline Wikipedia is more accessible on older hardware.\n\nDespite the caveats, the comparison reveals interesting size relationships. For example, a selection of the \"best\" 50,000 Wikipedia articles is roughly equivalent in size to the Llama 3.2 3B LLM. Furthermore, while some smaller LLMs are larger than a highly compressed version of Wikipedia, the full Wikipedia is larger than even the largest LLMs.\n\nHahn selected the LLMs and Wikipedia datasets somewhat subjectively, highlighting that specialized datasets (e.g., chemistry articles) or LLMs optimized for specific hardware might be more suitable for specific tasks. He concludes that having both an offline LLM and Wikipedia available \"just in case\" might be a good idea.\n",
    "chinese_title": "本地LLM与离线维基百科",
    "chinese_summary": "Evan Hahn 比较了通过 Ollama 获得的本地大型语言模型 (LLM) 文件大小与通过 Kiwix 获得的离线维基百科下载文件大小。 这一比较的灵感来源于在灾难场景中使用离线 LLM 的想法，并参考了一篇 MIT 科技评论的文章。\n\nHahn 强调，由于百科全书和 LLM 的性质不同，这种比较并不完美。 他承认文件大小不是唯一的因素，并指出 LLM 需要大量的内存和处理能力，而离线维基百科在较旧的硬件上更容易访问。\n\n尽管存在这些警告，比较仍然揭示了一些有趣的尺寸关系。 例如，精选的“最佳” 50,000 篇维基百科文章的大小与 Llama 3.2 3B LLM 大致相当。 此外，虽然一些较小的 LLM 比高度压缩的维基百科版本更大，但完整的维基百科甚至比最大的 LLM 还要大。\n\nHahn 在选择 LLM 和维基百科数据集时有些主观，并强调针对特定硬件优化的专门数据集（例如，化学文章）或 LLM 可能更适合特定任务。 他总结说，以防万一，同时拥有离线 LLM 和维基百科可能是一个好主意。"
  },
  {
    "id": "44625119",
    "title": "Replit AI deletes entire database during code freeze, then lies about it",
    "url": "https://twitter.com/jasonlk/status/1946069562723897802",
    "summary": "The provided content is not an article, but rather a snippet indicating that JavaScript is disabled in a browser preventing access to X (formerly Twitter). It does not contain any information about Replit AI deleting a database or lying about it. Therefore, it is impossible to summarize the described article based on this content.\n",
    "chinese_title": "Replit AI 在代码冻结期间删除整个数据库，然后谎称此事",
    "chinese_summary": "提供的文本并非文章，而是一段提示，表明浏览器的 JavaScript 已被禁用，导致无法访问 X（原 Twitter）。其中不包含任何关于 Replit AI 删除数据库或对此撒谎的信息。因此，无法根据此内容总结所描述的文章。"
  },
  {
    "id": "44621487",
    "title": "Borg – Deduplicating archiver with compression and encryption",
    "url": "https://www.borgbackup.org/",
    "summary": "BorgBackup, or Borg, is a deduplicating archiver focused on creating space-efficient, secure, and compressed backups. It utilizes authenticated encryption for security and offers various compression options including lz4, zstd, zlib, lzma, or none. Borg allows backups to be mounted using FUSE, making them easily accessible for restoration or browsing. It's designed for easy installation across multiple platforms like Linux, macOS, and BSD. Borg is a free, open-source software backed by a large and active community. The software prioritizes efficient storage through deduplication, ensuring that only unique data is stored, minimizing storage space usage. Crucially, the documentation emphasizes the importance of regularly verifying backups to ensure their integrity. In short, Borg is a versatile tool for creating secure, space-saving, and easily accessible backups across different operating systems.\n",
    "chinese_title": "Borg – 具有重复数据删除、压缩和加密功能的归档工具",
    "chinese_summary": "BorgBackup，或 Borg，是一款专注于创建空间效率高、安全且压缩的备份的去重归档工具。它利用认证加密来确保安全，并提供多种压缩选项，包括 lz4、zstd、zlib、lzma 或不压缩。Borg 允许使用 FUSE 挂载备份，使其易于访问以进行恢复或浏览。它被设计为易于安装在 Linux、macOS 和 BSD 等多个平台上。Borg 是一款由大型活跃社区支持的免费开源软件。该软件通过去重来优先考虑高效存储，确保只存储唯一数据，从而最大限度地减少存储空间的使用。至关重要的是，文档强调定期验证备份以确保其完整性的重要性。简而言之，Borg 是一种多功能的工具，用于在不同的操作系统上创建安全、节省空间且易于访问的备份。"
  },
  {
    "id": "44577210",
    "title": "What were the earliest laws like?",
    "url": "https://worldhistory.substack.com/p/what-were-the-earliest-laws-really",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "最早的法律是什么样的？",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "44585370",
    "title": "Matterport walkthrough of the original Microsoft Building 3",
    "url": "https://my.matterport.com/show/?m=SZSV6vjcf4L",
    "summary": "This \"Matterport walkthrough of the original Microsoft Building 3\" likely refers to an interactive, virtual tour of Microsoft's historical Building 3, accessible using Matterport's 3D scanning technology. The \"Presented by\" and \"Powered by\" lines suggest two distinct entities are involved: one showcasing the tour and the other providing the technology behind it.\n\nThe main takeaway is that users can digitally explore the interior of the original Microsoft Building 3. This offers a unique glimpse into the company's early days and working environment, providing a historical and nostalgic experience. The walkthrough allows users to navigate the space at their own pace, potentially highlighting key areas, architectural details, and possibly even artifacts or recreations of the building's historical appearance.\n\nThe use of Matterport technology implies a high-quality, immersive experience, allowing users to feel as though they are physically present within the building. This virtual tour likely caters to Microsoft enthusiasts, history buffs, and anyone interested in the evolution of the tech giant. It could also serve as a valuable resource for researchers or students studying the history of technology and Silicon Valley.\n",
    "chinese_title": "微软3号楼原貌Matterport漫游",
    "chinese_summary": "原微软3号楼 Matterport 虚拟导览：通过 Matterport 的 3D 扫描技术，用户可交互式地虚拟参观微软历史悠久的3号楼。 “Presented by” 和 “Powered by” 暗示由两个不同的实体参与：一方展示导览，另一方提供技术支持。\n\n主要目的是让用户能够以数字化的方式探索原微软3号楼的内部，从而独特地了解该公司的早期历史和工作环境，带来一种历史感和怀旧感。 导览允许用户按照自己的节奏浏览空间，并可能突出显示关键区域、建筑细节，甚至可能是该建筑历史外观的文物或重建。\n\nMatterport 技术的应用意味着高质量、沉浸式的体验，让用户感觉仿佛身临其境。 此次虚拟导览可能迎合了微软爱好者、历史爱好者以及任何对这家科技巨头发展历程感兴趣的人。 它还可以为研究技术和硅谷历史的研究人员或学生提供宝贵的资源。"
  },
  {
    "id": "44590034",
    "title": "Java was not underhyped in 1997 (2021)",
    "url": "https://dylanbeattie.net/2021/07/01/java-is-criminally-underhyped.html",
    "summary": "Dylan Beattie's article refutes the claim that Java was underhyped in 1997, arguing that it was, in fact, one of the most overhyped technologies of the era. He recalls his experience as a computer science student at the time, where Java was a mandatory and heavily emphasized part of the curriculum.\n\nThe author points out that Java's initial appeal stemmed from its introduction of features like automatic garbage collection, built-in threading, and exception handling, which were groundbreaking at the time. However, the hype went far beyond these advancements. Java was touted as the solution to almost every software problem, poised to replace desktop applications with Java applets, revolutionize desktop development with Swing and JNI, and create a world of reusable software components through JavaBeans. The \"Network Computer\" concept further fueled the hype, envisioning a future of Java-powered devices.\n\nUltimately, Java failed to live up to these expectations. It was outperformed by other languages in specific areas, and the initial \"exciting\" applications of Java faded away. Java's success lies in becoming a stable and reliable language for enterprise applications, a far cry from the revolutionary aspirations of its early days. Beattie highlights the irony that Java's \"write once, run anywhere\" dream has largely been realized through Android, a development that wasn't foreseen during the height of the 1997 hype.\n",
    "chinese_title": "1997年Java并未被低估 (2021)",
    "chinese_summary": "迪伦·比蒂的文章驳斥了关于Java在1997年被低估的说法，认为它实际上是当时最被过度炒作的技术之一。他回忆起当时作为计算机科学系学生的经历，Java是课程中强制且被高度强调的一部分。\n\n作者指出，Java最初的吸引力源于其引入的自动垃圾回收、内置线程和异常处理等特性，这些在当时是具有开创性的。然而，这种炒作远远超出了这些进步。Java被吹捧为几乎所有软件问题的解决方案，准备用Java小程序取代桌面应用程序，用Swing和JNI彻底改变桌面开发，并通过JavaBeans创建一个可重用的软件组件世界。“网络计算机”的概念进一步助长了炒作，设想了一个由Java驱动的设备未来。\n\n最终，Java未能实现这些期望。它在特定领域被其他语言超越，Java最初那些“令人兴奋的”应用也逐渐消失。Java的成功在于成为企业应用中一种稳定可靠的语言，这与其早期革命性的愿景相去甚远。比蒂强调，具有讽刺意味的是，Java“一次编写，随处运行”的梦想很大程度上是通过Android实现的，这是一个在1997年炒作高峰期未曾预见的进展。"
  },
  {
    "id": "44617184",
    "title": "Rethinking CLI interfaces for AI",
    "url": "https://www.notcheckmark.com/2025/07/rethinking-cli-interfaces-for-ai/",
    "summary": "This article argues that existing CLI tools and APIs are inadequate for effective use by LLM agents, especially those with limited context windows. The author highlights challenges encountered while using LLMs for reverse engineering tasks and general code automation.\n\nThe author describes issues with APIs needing both convenience and complete functions, forcing developers to guide the LLM through docstrings. Similarly, command-line tools lead to LLM confusion, like repetitive use of `head` and directory navigation issues.\n\nThe author uses the frustrating interaction with Claude Code to illustrate the problem. The LLM repeatedly bypassed pre-commit hooks, even attempting to modify them, highlighting the need for stricter enforcement and better LLM understanding of the underlying issues.\n\nThe core argument is that the \"Information Architecture\" of CLI tools is poorly suited for LLMs. The author proposes augmenting tools to provide extra context, caching output, and offering suggestions to LLMs. This could involve providing structured output, caching results, indicating remaining output size, and giving directory suggestions. Ultimately, the author suggests the need for \"LLM-enhanced CLI tools\" or a custom LLM shell, arguing that the UX field may need to branch into AI experience to guide the way.\n",
    "chinese_title": "重新思考人工智能的CLI界面",
    "chinese_summary": "本文认为，现有的CLI工具和API不足以供LLM代理有效使用，特别是那些上下文窗口有限的代理。作者重点强调了在使用LLM进行逆向工程任务和通用代码自动化时遇到的挑战。\n\n作者描述了API既需要便捷又需要完整功能的问题，迫使开发者通过文档字符串来指导LLM。同样，命令行工具也导致LLM混淆，例如重复使用`head`和目录导航问题。\n\n作者使用与Claude Code令人沮丧的互动来阐述这个问题。该LLM反复绕过pre-commit钩子，甚至试图修改它们，突显了需要更严格的执行和LLM对底层问题的更好理解。\n\n核心论点是，CLI工具的“信息架构”非常不适合LLM。作者建议增强工具以提供额外的上下文、缓存输出并向LLM提供建议。这可能涉及提供结构化输出、缓存结果、指示剩余输出大小以及提供目录建议。最终，作者认为需要“LLM增强型CLI工具”或自定义LLM Shell，并认为UX领域可能需要分支到AI体验来指导方向。"
  },
  {
    "id": "44620002",
    "title": "Ring introducing new feature to allow police to live-stream access to cameras",
    "url": "https://www.eff.org/deeplinks/2025/07/amazon-ring-cashes-techno-authoritarianism-and-mass-surveillance",
    "summary": "The article criticizes Ring's decision to reintroduce features that grant police greater access to user footage and introduce live-streaming capabilities. It argues that these changes represent a dangerous rollback of previous privacy reforms and pose a significant threat to civil liberties.\n\nThe main concerns are:\n\n*   **Increased Police Access:** Ring is enabling police to directly request footage and live-stream access from users' cameras, raising concerns about potential misuse for surveillance, especially targeting protestors, abortion seekers, and immigrants.\n*   **Erosion of Privacy:** The move betrays the trust of Ring's customers and signals a return to mass surveillance.\n*   **AI Focus:** The company's shift towards an \"AI first\" approach, coupled with employee promotion requirements, hints at the potential integration of video analytics or facial recognition, further exacerbating privacy concerns.\n*   **Abandoning Reforms:** Ring is dismantling previously implemented safeguards like end-to-end encryption, ending police partnerships, and ending the tool facilitating police requests for footage directly to customers\n*   **Motivations:** The article suggests that Ring's motives are not primarily about safety, given the decline in violent crime, but rather driven by a desire to profit from the increasing trend of techno-authoritarianism, similar to Google's recent ethical changes to profit from surveillance and warfare.\n*   **Partnership with Axon:** Ring is partnering with Axon to allow police to request Ring footage directly from users, and also allow users to consent to letting police livestream directly from their device.\n\nThe author concludes by condemning Ring's actions, arguing that the company is prioritizing profits over user privacy and contributing to the erosion of civil liberties.\n",
    "chinese_title": "Ring推出新功能，允许警方直播访问摄像头。",
    "chinese_summary": "该文章批评了 Ring 重新引入允许警方更大程度访问用户录像并引入直播功能的决定。文章认为，这些改变是对先前隐私改革的危险倒退，并对公民自由构成重大威胁。\n\n主要担忧包括：\n\n*   **警方访问权限增加：** Ring 正在允许警方直接向用户请求录像和直播访问权限，引发了对潜在滥用进行监视的担忧，特别是针对抗议者、寻求堕胎者和移民。\n*   **隐私侵蚀：** 此举背叛了 Ring 客户的信任，并预示着大规模监控的回归。\n*   **人工智能焦点：** 公司转向“人工智能优先”的方法，加上员工晋升要求，暗示了视频分析或面部识别集成的可能性，进一步加剧了隐私担忧。\n*   **放弃改革：** Ring 正在拆除先前实施的保障措施，例如端到端加密、结束警方合作关系以及结束促进警方直接向客户请求录像的工具。\n*   **动机：** 文章认为，鉴于暴力犯罪的下降，Ring 的动机主要不是出于安全考虑，而是受到从日益增长的技术威权主义趋势中获利的渴望驱动，类似于谷歌最近对其伦理进行的修改，以便从监控和战争中获利。\n*   **与 Axon 合作：** Ring 正在与 Axon 合作，允许警方直接从用户那里请求 Ring 录像，并且允许用户同意让警方直接从他们的设备上进行直播。\n\n作者最后谴责了 Ring 的行为，认为该公司将利润置于用户隐私之上，并助长了公民自由的侵蚀。"
  },
  {
    "id": "44616760",
    "title": "The curious case of the Unix workstation layout",
    "url": "https://thejpster.org.uk/blog/blog-2025-07-19/",
    "summary": "This blog post explores the curious trend of 1990s UNIX workstations adopting a layout reminiscent of LPX PCs. The author, having recently acquired several vintage workstations from Silicon Graphics, HP, and DEC, noticed a pattern: while earlier models like the SGI IRIS 4D series, HP 9000 712, and early DEC Alphastations used VME bus designs and unique internal architectures, later models displayed a shift towards a flat mainboard with rear ports, a left-side riser card for expansion slots, and a right-side PSU – characteristics similar to LPX PCs.\n\nSpecifically, the author points out that the SGI Indigo², HP 9000 Visualize B-Class, and DEC Alphastation 500 exhibit these LPX-like features, contrasting them with their predecessors' more distinct architectures. The post acknowledges that the Alphastation 500 even uses components resembling standard PC memory and PS/2 connectors.\n\nThe author poses the question of why these RISC/UNIX workstation manufacturers seemingly converged on a PC-like design. They wonder if it was independent inspiration from designs like Packard Bell and Dell PCs, a secret collaboration to reduce costs by leveraging PC technology, or simply a natural evolution of desktop computer design towards a common archetype. Ultimately, the author concludes with a lingering question and a newfound association of this specific layout with Cathode Ray Dude's video analysis of PC case history.\n",
    "chinese_title": "Unix工作站布局的奇特案例",
    "chinese_summary": "这篇博文探讨了一个有趣的趋势：20世纪90年代的UNIX工作站采用了类似于LPX PC的布局。作者最近 приобрел 了几台来自Silicon Graphics、HP和DEC的古董工作站，并注意到一个规律：虽然早期的型号，如SGI IRIS 4D系列、HP 9000 712和早期的DEC Alphastations，都使用了VME总线设计和独特的内部架构，但后来的型号却呈现出一种转变，即采用带有后置端口的扁平主板、用于扩展插槽的左侧转接卡和右侧的PSU——这些特征类似于LPX PC。\n\n具体来说，作者指出SGI Indigo²、HP 9000 Visualize B-Class和DEC Alphastation 500都表现出这些类似LPX的特征，并将它们与前辈们更独特的架构形成对比。 这篇文章承认，Alphastation 500甚至使用了类似于标准PC内存和PS/2连接器的组件。\n\n作者提出了一个问题：为什么这些RISC/UNIX工作站制造商似乎趋同于一种类似PC的设计？ 他们想知道，这是否是来自Packard Bell和戴尔PC等设计的独立启发，是秘密合作以通过利用PC技术来降低成本，还是仅仅是桌面计算机设计向通用原型发展的自然演变。 最终，作者以一个挥之不去的问题和一个对这种特定布局与 Cathode Ray Dude 的 PC 机箱历史视频分析的新发现的关联作结。"
  },
  {
    "id": "44590795",
    "title": "The Secrets We Keep",
    "url": "https://blog.bl00cyb.org/2025/07/the-secrets-we-keep/",
    "summary": "This article is a reflection on the author's five-year experience as an Engineering Project Manager (EPM) in Apple's Security, Engineering, and Architecture (SEAR) department. She highlights her significant contributions to various security features like Contact Key Verification and Advanced Data Protection. However, she reveals the inherent struggle of working at Apple: the inability to discuss her work due to secrecy.\n\nThe author thrives on connecting with people, sharing knowledge, and making novel connections between different fields. Apple's highly secretive and compartmentalized environment stifled this core aspect of her personality, leading to unhappiness and a disconnect from her personal life. She explains that even her hobbies felt unproductive because her natural inclination is to organize and connect with people.\n\nUltimately, the author realized that the need to keep a significant part of her life secret was unsustainable. Despite finding the mission of securing a billion users compelling, the inherent secrecy clashed with her desire for openness and collaboration. As a result, she left Apple and is now actively seeking new opportunities where she can leverage her skills in project management, security, and facilitation while being able to openly share her knowledge and connect with others. She's currently pursuing freelance work in disaster zines, digital estate planning, security consulting, and facilitation.\n",
    "chinese_title": "我们保守的秘密",
    "chinese_summary": "本文反思了作者在苹果安全、工程和架构 (SEAR) 部门担任工程项目经理 (EPM) 五年的经验。她重点介绍了她对诸如联系人密钥验证和高级数据保护等各种安全功能的重大贡献。然而，她揭示了在苹果公司工作固有的挣扎：由于保密而无法讨论自己的工作。\n\n作者热衷于与人建立联系、分享知识以及建立不同领域之间的新颖联系。苹果公司高度保密和分工细化的环境扼杀了她个性的这一核心方面，导致了不快乐以及与个人生活的脱节。她解释说，即使是她的爱好也感觉没有成效，因为她的自然倾向是组织和与人联系。\n\n最终，作者意识到需要对她生活中重要的一部分保密是不可持续的。尽管她发现保护十亿用户的使命令人信服，但固有的保密性与她对开放和协作的渴望相冲突。因此，她离开了苹果公司，现在正在积极寻找新的机会，在那里她可以利用她在项目管理、安全和促进方面的技能，同时能够公开分享她的知识并与他人联系。她目前正在从事灾难杂志、数字遗产规划、安全咨询和促进方面的自由职业。"
  },
  {
    "id": "44576183",
    "title": "Piano Keys",
    "url": "https://www.mathpages.com/home/kmath043.htm",
    "summary": "This article explores the varying widths of white piano keys at their back ends, where they pass between the black keys. It points out that due to the fixed number and width of black keys, it's impossible for all white keys to have the same back-end width while maintaining equal front-end widths. The author then delves into strategies for minimizing the discrepancy in back-end white key widths.\n\nSeveral solutions are presented, ranging from a crude (B/2 discrepancy) method to progressively better arrangements with discrepancies of B/4, B/6, and finally the \"B/12 solution.\" The B/12 solution, with c=d=e=(W-2B/3) and f=g=a=b=(W-3B/4), is considered optimal when black keys are identical and white keys have equal front-end widths.\n\nThe article then proposes relaxing these constraints to further minimize discrepancies. By allowing variations in the widths of both the black and white keys (while maintaining a 5/12 octave allocation for black keys), a novel arrangement is presented. This new solution, based on dividing the octave into 878472 units, significantly reduces the maximum discrepancy between white and black keys to a fraction of the average black key width. The article concludes with measurements of the maximum discrepancy in inches, highlighting the improved precision achievable with variable key widths.\n",
    "chinese_title": "钢琴键",
    "chinese_summary": "本文探讨了钢琴白键后端的不同宽度，即它们穿过黑键之间的区域。文章指出，由于黑键的数量和宽度是固定的，因此在保持前端宽度相等的情况下，所有白键的后端宽度不可能相同。作者随后深入研究了最大限度减少后端白键宽度差异的策略。\n\n文章提出了几种解决方案，从粗略的（B/2差异）方法到逐渐改进的安排，差异分别为B/4、B/6，最后是“B/12解决方案”。当黑键完全相同且白键前端宽度相等时，具有c=d=e=(W-2B/3)和f=g=a=b=(W-3B/4)的B/12解决方案被认为是最佳的。\n\n随后，文章提出放宽这些限制，以进一步最大限度地减少差异。通过允许黑键和白键的宽度变化（同时保持黑键占据八度音阶的5/12），提出了一种新的排列方式。这种基于将八度音阶划分为878472个单位的新解决方案，将白键和黑键之间的最大差异显著降低到平均黑键宽度的一小部分。文章最后以英寸为单位测量了最大差异，突出了通过可变键宽度实现更高的精度。"
  },
  {
    "id": "44623623",
    "title": "Welcoming the Next Generation of Programmers",
    "url": "https://lucumr.pocoo.org/2025/7/20/the-next-generation/",
    "summary": "In his article \"Welcoming The Next Generation of Programmers,\" Armin Ronacher reflects on the evolving landscape of programming, particularly within the Python community, due to the rise of AI-assisted coding tools. He notes how tools like ChatGPT are enabling individuals without traditional programming backgrounds to create programs and become, in essence, programmers overnight.\n\nRonacher argues that the Python community should embrace this influx of new programmers, recognizing that AI will likely increase the number of people involved in programming. He emphasizes the importance of inclusivity, drawing on Python's history of outreach programs and community support.\n\nHe cautions against dismissing AI-generated code or treating these new programmers as \"not real,\" highlighting the need to welcome and mentor them. Ronacher believes that without community support, these programmers might miss out on crucial lessons and potentially become reliant on specific AI tools, hindering their growth.\n\nThe article stresses the importance of fostering human connection and community engagement in this new era of AI-assisted programming. Ronacher calls on the Python community to create on-ramps and mentoring opportunities to guide these new programmers toward broader engineering principles and prevent them from being locked into proprietary ecosystems. The ultimate goal is to transform solitary interactions with AI into shared journeys within a supportive programming community.\n",
    "chinese_title": "迎接下一代程序员",
    "chinese_summary": "在题为《欢迎下一代程序员》的文章中，Armin Ronacher反思了编程领域，尤其是在Python社区中，因AI辅助编码工具兴起而发生的演变。他指出，像ChatGPT这样的工具使那些没有传统编程背景的人能够创建程序，并在本质上在一夜之间成为程序员。\n\nRonacher认为，Python社区应该拥抱这种新程序员的涌入，认识到人工智能很可能会增加参与编程的人数。他强调了包容性的重要性，并借鉴了Python在推广计划和社区支持方面的历史。\n\n他告诫不要忽视人工智能生成的代码或将这些新程序员视为“不正宗”，并强调需要欢迎和指导他们。Ronacher认为，如果没有社区的支持，这些程序员可能会错过关键的课程，并可能依赖于特定的人工智能工具，从而阻碍他们的成长。\n\n这篇文章强调了在这个人工智能辅助编程的新时代中，培养人际关系和社区参与的重要性。Ronacher呼吁Python社区创建入门通道和指导机会，以引导这些新程序员掌握更广泛的工程原理，并防止他们被锁定在专有生态系统中。最终目标是将与人工智能的孤立互动转变为在支持性编程社区中的共享旅程。"
  },
  {
    "id": "44590671",
    "title": "“Bypassing” specialization in Rust",
    "url": "https://oakchris1955.eu/posts/bypassing_specialization/",
    "summary": "This article details the author's journey to work around the lack of stable specialization in Rust while developing a FAT driver. Specialization, a feature that allows overriding trait implementations based on more specific trait bounds, would have allowed the author to differentiate between read-only and read/write filesystems within the same `FileSystem` struct.\n\nThe core problem lies in a function `load_nth_sector` which needs to behave differently based on whether the underlying storage supports writing. Without specialization, the author couldn't have two `impl` blocks for `FileSystem` with different `load_nth_sector` implementations based on `Read + Seek` vs. `Read + Write + Seek` bounds.\n\nThe author initially tried using the `spez` crate (a macro-based specialization workaround) and a generic enum with `PhantomData`, but neither solution proved suitable.\n\nThe author's eventual solution involves using function pointers. A `SyncFn` type alias is created for a function that synchronizes the sector buffer. The `FileSystem` struct contains an `Option<SyncFn>` field.  The `from_ro_storage` and `from_rw_storage` constructors then populate this field with `None` (for read-only) or a pointer to the actual sync function (for read/write). Inside `load_nth_sector`, the `Option` is matched, and the sync function is called if present.\n\nWhile this \"emulates\" specialization, the author acknowledges that it's a specific and less efficient solution with performance and memory overhead. The author ultimately advocates for using stable specialization when available, as it will be cleaner and more efficient.\n",
    "chinese_title": "绕过 Rust 中的“特化”",
    "chinese_summary": "本文详细介绍了作者在开发 FAT 驱动程序时，如何绕过 Rust 中缺乏稳定特化功能的难题。 特化允许基于更具体的 trait 约束来覆盖 trait 实现，如果使用该特性，作者本可以在同一个 `FileSystem` 结构中区分只读和读写文件系统。\n\n核心问题在于 `load_nth_sector` 函数，它需要根据底层存储是否支持写入而表现不同。 在没有特化的情况下，作者无法为 `FileSystem` 创建两个具有不同 `load_nth_sector` 实现的 `impl` 块，分别基于 `Read + Seek` 和 `Read + Write + Seek` 约束。\n\n作者最初尝试使用 `spez` crate（一种基于宏的特化变通方法）和一个带有 `PhantomData` 的泛型枚举，但两种解决方案都不适用。\n\n作者最终的解决方案涉及使用函数指针。 创建了一个 `SyncFn` 类型别名，用于同步扇区缓冲区的函数。 `FileSystem` 结构包含一个 `Option<SyncFn>` 字段。 然后，`from_ro_storage` 和 `from_rw_storage` 构造函数会使用 `None`（对于只读）或指向实际同步函数的指针（对于读写）填充此字段。 在 `load_nth_sector` 内部，会匹配 `Option`，如果存在，则调用同步函数。\n\n虽然这种方法“模拟”了特化，但作者承认这是一个特定且效率较低的解决方案，存在性能和内存开销。 作者最终提倡在可用时使用稳定的特化，因为它会更简洁、更高效。"
  },
  {
    "id": "44597550",
    "title": "How we tracked down a Go 1.24 memory regression",
    "url": "https://www.datadoghq.com/blog/engineering/go-memory-regression/",
    "summary": "This article likely details the process of identifying and addressing a memory regression introduced in Go 1.24. The core focus is on how the authors or speakers used various debugging and profiling tools to pinpoint the source of the unexpected memory usage increase.\n\nKey takeaways likely include:\n\n*   **Identifying the regression:** Initial observation of increased memory consumption after upgrading to Go 1.24.\n*   **Methodology:** The article likely discusses the tools and techniques used to analyze the application's memory usage, such as `pprof` for heap profiling, memory allocators, and potentially tracing.\n*   **Root Cause Analysis:** The article will explain the specific code changes or underlying issues in Go 1.24 that contributed to the memory regression. This could involve changes in the garbage collector, memory allocation strategies, or standard library implementations.\n*   **Debugging Techniques:** Expect details on how they narrowed down the problem, potentially using techniques like bisecting commits, creating minimal reproducible examples, and comparing memory profiles between different Go versions.\n*   **Resolution:** Finally, it would outline the solution to the memory regression, which could be a fix in their own application code or a reported bug in Go itself, leading to a patch or workaround.\n\nThe title and the \"Go faster: optimizing Go programs\" tagline suggests a focus on practical techniques and lessons learned from this specific debugging experience that can be applied to general Go optimization efforts.\n",
    "chinese_title": "我们如何追踪到 Go 1.24 的内存回归",
    "chinese_summary": "本文可能详细介绍了识别和解决 Go 1.24 中引入的内存退化问题的过程。 核心重点在于作者或演讲者如何使用各种调试和分析工具来精确定位意外的内存使用量增加的根源。\n\n主要收获可能包括：\n\n*   **识别退化：** 升级到 Go 1.24 后首次观察到内存消耗增加。\n*   **方法论：** 本文可能讨论了用于分析应用程序内存使用情况的工具和技术，例如用于堆分析的 `pprof`、内存分配器以及可能的跟踪。\n*   **根本原因分析：** 本文将解释 Go 1.24 中导致内存退化的特定代码更改或底层问题。 这可能涉及垃圾回收器、内存分配策略或标准库实现方面的更改。\n*   **调试技术：** 预计会详细介绍他们如何缩小问题范围，可能使用诸如二分提交、创建最小可复现示例以及比较不同 Go 版本之间的内存配置文件等技术。\n*   **解决方案：** 最后，它将概述解决内存退化的方案，这可能是他们自己的应用程序代码中的修复，或者 Go 本身报告的错误，从而导致补丁或解决方法。\n\n标题和 “Go faster: optimizing Go programs” 的标语表明侧重于从这种特定调试经验中获得的实用技术和经验教训，这些技术和经验教训可以应用于一般的 Go 优化工作。"
  },
  {
    "id": "44614788",
    "title": "Piramidal (YC W24) is hiring a full stack engineer",
    "url": "https://www.ycombinator.com/companies/piramidal/jobs/JfeI3uE-full-stack-engineer",
    "summary": "Piramidal (YC W24), a startup building a foundation model for electrophysiological brain data, is seeking a Full Stack Engineer to join their team in New York City. The role involves building and maintaining the infrastructure and backend systems for their flagship platform focused on neural data, collaborating with ML engineers, and working with the product team to implement effective solutions. They are offering a salary range of $120K-$270K for a full-time position.\n\nThe ideal candidate has 5+ years of experience at product-driven companies and is proficient in Python, containerization (Kubernetes), relational databases (Postgres/MySQL), and web technologies (JavaScript, React). The company values proactive, customer-centric engineers who prioritize data models, architecture, and security.\n\nPiramidal aims to create scaled neural decoders to understand and control neural syntax, with a mission to maximize human potential and support cognitive liberty. The interview process includes an initial screen, a technical screen (take-home or live), and a final round involving system architecture and Q&A. The company was founded in 2024 and is part of the W24 Y Combinator batch.\n",
    "chinese_title": "Piramidal (YC W24) 正在招聘全栈工程师",
    "chinese_summary": "Piramidal (YC W24)，一家构建电生理脑数据基础模型的初创公司，正在纽约市招聘一名全栈工程师加入他们的团队。该职位涉及构建和维护其旗舰平台的基础设施和后端系统，专注于神经数据，与机器学习工程师合作，并与产品团队合作实施有效解决方案。他们为全职职位提供 12 万美元至 27 万美元的薪资范围。\n\n理想的候选人拥有在产品驱动型公司 5 年以上的经验，并且精通 Python、容器化（Kubernetes）、关系数据库（Postgres/MySQL）和 Web 技术（JavaScript、React）。公司重视积极主动、以客户为中心的工程师，他们优先考虑数据模型、架构和安全性。\n\nPiramidal 旨在创建规模化的神经解码器，以理解和控制神经语法，其使命是最大限度地发挥人类潜力并支持认知自由。面试过程包括初步筛选、技术筛选（居家或现场）以及涉及系统架构和问答的最后一轮。该公司成立于 2024 年，是 Y Combinator W24 批次的一部分。"
  },
  {
    "id": "44587486",
    "title": "Open-Source BCI Platform with Mobile SDK for Rapid Neurotech Prototyping",
    "url": "https://www.preprints.org/manuscript/202507.1198/v1",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "用于快速神经技术原型设计的开源BCI平台，带有移动端SDK",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "44618535",
    "title": "The borrowchecker is what I like the least about Rust",
    "url": "https://viralinstruction.com/posts/borrowchecker/",
    "summary": "This article expresses the author's frustration with Rust's borrowchecker, arguing it's the least enjoyable aspect of the language. While Rust is praised for its memory safety achieved through the borrowchecker, the author argues that its role is overstated and that it causes significant ergonomic problems.\n\nThe core issue is that the borrowchecker's strict rules around ownership and lifetimes, enforced at compile time, are often overly restrictive and reject valid code. The author provides examples where the borrowchecker fails to recognize safe scenarios, such as distinct mutable references to different struct fields, or looping over a vector while incrementing a counter.\n\nThe author dismisses the idea of a \"sufficiently smart borrowchecker\" as a myth, drawing parallels to the unattainable \"sufficiently smart compiler.\" They argue that the fundamental ownership model itself is sometimes unsuitable, citing difficulties with bidirectional references in data structures like trees.\n\nWhile acknowledging Rust's overall focus on safety, the author attributes its bug-resistance more to good design choices, enums, strong typing, keyword arguments, and a culture of correctness than solely to the borrowchecker. They feel the borrowchecker often creates artificial problems that require workarounds like cloning data, using `Arc`/`RefCell`, or resorting to manual memory management with indices, ironically undermining Rust's safety guarantees.  The author concludes that the challenges imposed by the borrowchecker are often a pointless imposition and that solutions often distract from the actual problem being solved.\n",
    "chinese_title": "我最不喜欢 Rust 的就是借用检查器。",
    "chinese_summary": "本文表达了作者对Rust的借用检查器感到沮丧，认为它是该语言中最令人不悦的方面。尽管Rust因其通过借用检查器实现的内存安全而备受赞誉，但作者认为它的作用被夸大了，并且会导致显著的人机工程学问题。\n\n核心问题在于，借用检查器在编译时强制执行的关于所有权和生命周期的严格规则，通常过于严格并拒绝了有效的代码。作者提供了例子，说明借用检查器无法识别安全场景，例如对不同结构体字段的不同可变引用，或者在递增计数器时循环遍历向量。\n\n作者驳斥了“足够聪明的借用检查器”的想法，认为这是一种神话，并将其与无法实现的“足够聪明的编译器”相提并论。他们认为，基本的所有权模型本身有时是不合适的，并举例说明了在诸如树之类的数据结构中使用双向引用时遇到的困难。\n\n虽然承认Rust总体上注重安全性，但作者认为它的抗错误性更多地归功于良好的设计选择、枚举、强类型、关键字参数以及正确的文化，而不是仅仅归功于借用检查器。他们认为借用检查器经常会制造人为的问题，需要通过诸如克隆数据、使用`Arc`/`RefCell`或借助索引来手动管理内存等方法来解决，讽刺的是，这反而破坏了Rust的安全保证。作者总结说，借用检查器带来的挑战通常是一种毫无意义的强加，而且解决方案常常会分散人们对要解决的实际问题的注意力。"
  },
  {
    "id": "44613840",
    "title": "OpenAI claims gold-medal performance at IMO 2025",
    "url": "https://twitter.com/alexwei_/status/1946477742855532918",
    "summary": "The article \"OpenAI claims gold-medal performance at IMO 2025\" is inaccessible. The provided content is a JavaScript error message from X (formerly Twitter) indicating that JavaScript is disabled, preventing the page from loading and displaying the article. Therefore, it is impossible to provide a summary of the article's content as it cannot be accessed based on the information provided.\n",
    "chinese_title": "OpenAI 声称在 2025 年国际数学奥林匹克竞赛中获得金牌。",
    "chinese_summary": "文章“OpenAI宣称在2025年国际数学奥林匹克竞赛中获得金牌”无法访问。 提供的内容是来自X（前身为Twitter）的JavaScript错误消息，表明JavaScript已禁用，导致页面无法加载和显示该文章。 因此，根据所提供的信息，由于无法访问该文章，因此无法提供其内容的摘要。"
  },
  {
    "id": "44584414",
    "title": "Zig Interface Revisited",
    "url": "https://williamw520.github.io/2025/07/13/zig-interface-revisited.html",
    "summary": "This article explores how to achieve polymorphism with dynamic dispatch in Zig, a language that intentionally omits built-in interface features. Instead of relying on built-in interfaces, Zig provides the tools to create interface-like behavior using vtables.\n\nThe article focuses on a specific vtable interface pattern, outlining its goals: clear separation between interface and implementation, no modification needed in implementation types, dynamic dispatch, and a uniform interface type for storage.\n\nThe article provides an example of logging system with `DbgLogger` and `FileLogger` implementations, which don't know about the interface. The `Logger` struct serves as the interface, holding an untyped pointer (`*anyopaque`) to the implementation and function pointers (vtable) for each interface method (e.g., `log`, `setLevel`). The `implBy` function connects the implementation to the interface, and a `LoggerDelegate` struct is used to cast the untyped pointer back to the concrete type and call the actual methods.\n\nThe advantages of this approach are clean separation of concerns, extensibility, and the ability to store different implementations together as a single type. The trade-offs include boilerplate code for defining vtable methods and a slight performance overhead due to function pointer indirection.\n\nThe article concludes that while Zig lacks built-in interfaces, this vtable approach allows developers to achieve dynamic dispatch and decoupled APIs with full control over abstraction and minimal runtime overhead. Future tooling improvements could potentially reduce the boilerplate involved.\n",
    "chinese_title": "Zig接口再议",
    "chinese_summary": "在Zig中利用虚表实现动态分发多态"
  },
  {
    "id": "44625681",
    "title": "Group Behind Steam Censorship Policies Have Powerful Allies",
    "url": "https://web.archive.org/web/20250719204151/https://www.vice.com/en/article/group-behind-steam-censorship-policies-have-powerful-allies-and-targeted-popular-games-with-outlandish-claims/",
    "summary": "This VICE article investigates the Australian group Collective Shout and their role in influencing Steam's censorship policies, specifically the removal of adult games with taboo themes. The article highlights that Collective Shout, claiming to have targeted nearly 500 games for removal, is supported by powerful anti-pornography organizations like the National Center on Sexual Exploitation (NCOSE) and Exodus Cry, which have a history of advocating for online censorship.\n\nThe article points out that these groups have previously targeted Steam and other platforms like PornHub, suggesting a coordinated effort to pressure payment processors and ultimately influence content removal. VICE questions Collective Shout's claims of targeting games depicting \"child abuse,\" suggesting they may be misinterpreting games that depict children facing distress, even if the intention is to encourage empathy.\n\nThe article cites past examples, like Collective Shout's campaigns against Detroit: Become Human and Grand Theft Auto V, arguing that the organization has a history of misrepresenting game content to garner support for censorship. The author concludes that while Collective Shout is the public face of the campaign, they are backed by larger, more influential groups with a broader agenda of online censorship, and that their claims regarding child abuse are likely manipulative.\n",
    "chinese_title": "Steam审查政策背后的团队拥有强大的盟友",
    "chinese_summary": "这篇VICE文章调查了澳大利亚团体Collective Shout及其在影响Steam审查政策中的作用，特别是移除具有禁忌主题的成人游戏。文章强调，Collective Shout声称已针对近500款游戏要求移除，并得到了强大的反色情组织（如国家性剥削中心(NCOSE)和Exodus Cry）的支持，这些组织一直以来都在倡导网络审查。\n\n文章指出，这些团体此前曾针对Steam以及PornHub等其他平台，表明他们有组织地向支付处理商施压，并最终影响内容移除。VICE质疑了Collective Shout声称针对描绘“儿童虐待”游戏的说法，暗示他们可能误解了描绘儿童面临困境的游戏，即使其意图是鼓励同情。\n\n文章引用了过往案例，比如Collective Shout针对《底特律：变人》和《侠盗猎车手V》的行动，认为该组织一贯歪曲游戏内容以获得审查支持。作者总结说，虽然Collective Shout是这场运动的公开面孔，但他们背后有更大、更有影响力的团体支持，这些团体有着更广泛的网络审查议程，并且他们关于儿童虐待的说法很可能是一种操纵。"
  },
  {
    "id": "44606184",
    "title": "Valve confirms credit card companies pressured it to delist certain adult games",
    "url": "https://www.pcgamer.com/software/platforms/valve-confirms-credit-card-companies-pressured-it-to-delist-certain-adult-games-from-steam/",
    "summary": "Valve confirmed that they removed certain adult games from Steam due to pressure from payment processors like Visa and Mastercard, who were concerned that these games violated their rules and standards. Valve stated that losing these payment methods would prevent customers from purchasing other titles. While Valve did not specify which games were removed, the move coincided with the removal of adult games with incestuous themes, leading to speculation that these were the cause.\n\nThe article highlights the increasing scrutiny adult content faces from payment processors, who are wary of scams, chargebacks, and past issues with explicit content platforms. It argues that this sets a concerning precedent, as payment processors are effectively dictating what content users can access on Steam.\n\nThe article also clarified that the removal of the game \"Trials of Innocence\" was unrelated and due to a DMCA claim.\n",
    "chinese_title": "Valve 证实信用卡公司曾施压要求其下架部分成人游戏。",
    "chinese_summary": "Valve 证实，由于 Visa 和 Mastercard 等支付处理商的压力，他们从 Steam 上移除了某些成人游戏。这些支付处理商担心这些游戏违反了他们的规则和标准。Valve 表示，失去这些支付方式将导致顾客无法购买其他游戏。尽管 Valve 没有明确指出移除了哪些游戏，但此举恰逢含有乱伦主题的成人游戏被移除，这引发了人们对这些游戏是罪魁祸首的猜测。\n\n文章强调了成人内容面临来自支付处理商日益严格的审查，他们对诈骗、退款以及过去与露骨内容平台相关的问题保持警惕。文章认为，这开创了一个令人担忧的先例，因为支付处理商实际上是在决定用户可以在 Steam 上访问哪些内容。\n\n文章还澄清说，游戏“Trials of Innocence”的移除与此事无关，而是由于 DMCA 索赔。"
  },
  {
    "id": "44614370",
    "title": "Fstrings.wtf",
    "url": "https://fstrings.wtf/",
    "summary": "Fstrings.wtf is a Python f-string quiz website designed to test the user's knowledge of Python f-string behavior, specifically as of Python 3.13. The quiz format includes multiple-choice questions, a visible score, navigation buttons (Next, Finish, Restart), and keyboard shortcuts for answer selection. Upon completion, users receive a score out of 20 and have the option to share their results on social media platforms X (formerly Twitter) and Bluesky. The site also provides a help section and information regarding reporting issues. It also offers the functionality to continue a partially completed quiz or restart from the beginning. The quiz was created by @mitsuhiko with Claude, and the source code is available on GitHub.\n",
    "chinese_title": "Fstrings.wtf\n中文F字符串.wtf",
    "chinese_summary": "Fstrings.wtf 是一个 Python f-string 测验网站，旨在测试用户对 Python f-string 行为的了解，特别是基于 Python 3.13。 测验形式包括选择题、可见的分数、导航按钮（下一步、完成、重新开始）以及用于选择答案的键盘快捷键。 完成后，用户将收到满分 20 的分数，并可以选择在社交媒体平台 X (原 Twitter) 和 Bluesky 上分享他们的结果。 该网站还提供帮助部分和有关报告问题的信息。 它还提供继续未完成的测验或从头开始的功能。 该测验由 @mitsuhiko 与 Claude 共同创建，源代码可在 GitHub 上找到。"
  },
  {
    "id": "44627239",
    "title": "Employers planning to pass the rising healthcare costs to the employees in 2026",
    "url": "https://www.cnn.com/2025/07/16/economy/health-care-costs-employees-2026",
    "summary": "A recent Mercer survey indicates that employers are planning to shift rising healthcare costs to employees in 2026 through higher deductibles and out-of-pocket maximums. This shift comes after a period where employers absorbed increasing healthcare expenses due to a tight labor market and rising cost of living. Employers expect healthcare benefit expenses to jump nearly 6% this year, following a 4.5% increase in 2024, with even higher rates anticipated for next year due to increased patient usage and advancements like AI-assisted billing.\n\nA major cost concern is the coverage of expensive anti-obesity GLP-1 medications. While many larger companies currently offer this coverage, the pace of adoption is expected to slow, and companies might narrow eligibility or require more documentation, making access more difficult for employees.\n\nDespite the cost-shifting, employers are maintaining their commitment to mental health services, with more offering onsite Employee Assistance Program counseling and increasing the number of sessions provided. They are also expanding child and elder care benefits to support employees returning to the office, including resources like search platforms, backup care services, and tuition discounts. Additionally, many employers are offering resources to support women's reproductive health. Employees will learn more specifics about their 2026 healthcare benefits during the fall open enrollment period.\n",
    "chinese_title": "雇主计划于2026年将上涨的医疗保健成本转嫁给员工",
    "chinese_summary": "美世最新调查显示，雇主计划在2026年通过提高免赔额和自付额上限，将不断上涨的医疗保健成本转嫁给员工。此前，由于劳动力市场紧张和生活成本上升，雇主承担了不断增加的医疗保健费用。雇主预计今年医疗保健福利支出将跃升近6%，继2024年增长4.5%之后，由于患者使用量增加和人工智能辅助计费等技术的进步，预计明年的增长率甚至更高。\n\n一个主要的成本问题是昂贵的抗肥胖GLP-1药物的覆盖范围。虽然许多大型公司目前提供这种覆盖，但采用速度预计会放缓，公司可能会缩小资格范围或要求更多文件，从而使员工更难获得。\n\n尽管成本转移，雇主仍在保持对心理健康服务的承诺，更多雇主提供现场员工援助计划咨询，并增加提供的咨询次数。他们还在扩大儿童和老年人护理福利，以支持员工重返办公室，包括搜索平台、备用护理服务和学费折扣等资源。此外，许多雇主正在提供资源来支持女性的生殖健康。员工将在秋季的开放注册期间了解更多关于2026年医疗保健福利的具体信息。"
  },
  {
    "id": "44621088",
    "title": "The AGI Final Frontier: The CLJ-AGI Benchmark",
    "url": "https://raspasov.posthaven.com/the-agi-final-frontier-the-clj-agi-benchmark",
    "summary": "This article proposes a new benchmark for Artificial General Intelligence (AGI) called CLJ-AGI. The core idea is to challenge AI systems to enhance or reimagine the Clojure programming language based on specific criteria. The benchmark focuses on a specific set of improvements:\n\n1.  **Transducer-First Design:** Emphasizing transducers as a primary abstraction.\n2.  **Laziness Control:** Eliminating or making laziness an opt-in feature.\n3.  **Ubiquitous Protocols:** Implementing protocols extensively for performance gains.\n4.  **CRDT Data Structures:** Making core data structures (maps, vectors, etc.) inherently CRDTs (Conflict-free Replicated Data Types) for correctness and performance in distributed systems.\n\nThe successful AI should be able to create a new programming language or significantly improve Clojure while maintaining backward compatibility. The article implies a substantial reward for achieving backward compatibility, suggesting the difficulty and value of the task. The underlying goal of CLJ-AGI is to push AI towards a deeper understanding of programming language design principles, performance optimization, and distributed data consistency. It's a benchmark designed to measure the system's ability to reason, innovate, and implement complex software solutions.\n",
    "chinese_title": "AGI终极前沿：CLJ-AGI基准测试",
    "chinese_summary": "本文提出了一种名为CLJ-AGI的新型通用人工智能（AGI）基准。其核心思想是挑战AI系统，使其基于特定标准来增强或重新构想Clojure编程语言。该基准侧重于以下一组具体的改进：\n\n1.  **以Transducer为先的设计：** 强调将transducer作为主要抽象。\n2.  **惰性控制：** 消除惰性或使其成为可选功能。\n3.  **无处不在的协议：** 广泛实施协议以提高性能。\n4.  **CRDT数据结构：** 使核心数据结构（映射、向量等）本质上成为CRDT（无冲突复制数据类型），以确保分布式系统中的正确性和性能。\n\n成功的AI应该能够创建一个新的编程语言，或者在保持向后兼容性的同时，显著改进Clojure。本文暗示实现向后兼容性将获得丰厚奖励，表明了该任务的难度和价值。CLJ-AGI的根本目标是推动AI更深入地理解编程语言设计原则、性能优化和分布式数据一致性。它是一个旨在衡量系统推理、创新和实现复杂软件解决方案能力的基准。"
  },
  {
    "id": "44620623",
    "title": "I Used Arch, BTW: macOS, Day 1",
    "url": "https://yberreby.com/posts/i-used-arch-btw-macos-day-1/",
    "summary": "This article details the author's experience transitioning from nine years of using Arch Linux as a daily driver to a new M4 Pro MacBook Pro running macOS. Driven by frustration with PC laptop hardware issues (driver problems, build quality, and reliability), the author, a PhD student in neuro-AI, decided to try Apple Silicon, despite a long history of preferring Linux.\n\nThe author's core workflow involves research, coding, writing, and collaboration, requiring a robust and customizable environment. Unable to run Linux (due to limited Asahi Linux support for M4 chips), the goal was to create a \"Lazy Frankenmac\" – a macOS environment configured to mimic the efficiency and control of a Linux setup.\n\nThe author opted for Nix as the package manager, using a starter template by @dustinlyons that integrates nix-darwin and nix-homebrew. The initial setup involved troubleshooting various issues with the template's configurations, including Node.js build failures, outdated Alacritty settings, and broken Emacs configuration.\n\nOnce Nix was working, the author installed key applications like Zed, Zotero, Firefox, Spotify, and development tools like Rust and uv. AeroSpace and Raycast were used for window management, providing a tiling window manager and launcher similar to i3/sway and dmenu/rofi on Linux. The author also remapped keys and configured Zed for vim bindings. The zsh shell configuration was also improved, with the addition of atuin for shell history search.\n\nThe author concludes that, despite the initial setup challenges, the first day was successful in creating a usable environment that supports most of the core workflow, and plans to continue improving the system gradually.\n",
    "chinese_title": "我用了Arch，顺便说一句：macOS，第一天",
    "chinese_summary": "本文详细介绍了作者从九年日常使用 Arch Linux 过渡到使用搭载 macOS 的全新 M4 Pro MacBook Pro 的体验。由于对 PC 笔记本电脑硬件问题（驱动问题、做工质量和可靠性）感到沮丧，这位神经人工智能专业的博士生，尽管长期以来更喜欢 Linux，还是决定尝试 Apple Silicon。\n\n作者的核心工作流程包括研究、编码、写作和协作，需要一个强大且可定制的环境。由于 Asahi Linux 对 M4 芯片的支持有限，无法运行 Linux，因此目标是创建一个“懒人 Frankenmac”——一个配置成模仿 Linux 设置的效率和控制的 macOS 环境。\n\n作者选择了 Nix 作为包管理器，并使用了 @dustinlyons 提供的 starter template，该模板集成了 nix-darwin 和 nix-homebrew。最初的设置涉及解决模板配置中的各种问题，包括 Node.js 构建失败、过时的 Alacritty 设置和损坏的 Emacs 配置。\n\n一旦 Nix 正常工作，作者就安装了 Zed、Zotero、Firefox、Spotify 等关键应用程序，以及 Rust 和 uv 等开发工具。 AeroSpace 和 Raycast 用于窗口管理，提供了类似于 Linux 上 i3/sway 和 dmenu/rofi 的平铺窗口管理器和启动器。作者还重新映射了按键，并为 Zed 配置了 vim 绑定。 zsh shell 配置也得到了改进，并添加了 atuin 用于 shell 历史搜索。\n\n作者总结说，尽管最初的设置面临挑战，但第一天在创建一个支持大部分核心工作流程的可用环境方面是成功的，并计划继续逐步改进该系统。"
  },
  {
    "id": "44619258",
    "title": "The future of ultra-fast passenger travel",
    "url": "https://spaceambition.substack.com/p/beyond-the-sound-barrier",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "超高速旅客运输的未来",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "44616688",
    "title": "Show HN: Am-I-vibing, detect agentic coding environments",
    "url": "https://github.com/ascorbic/am-i-vibing",
    "summary": "\"am-i-vibing\" is a tool, available as both a library and a CLI, designed to detect whether your code is running within an AI agentic coding environment. This allows programs to adapt their behavior, such as providing specific output formats or logs tailored for AI agents.\n\nIt identifies three environment types: `Agent` (direct AI execution), `Interactive` (AI-powered interactive shells), and `Hybrid` (combining both). It supports a variety of AI tools, including Aider, Claude Code, Cursor, GitHub Copilot Agent, and Replit.\n\nThe library provides functions to `detectAgenticEnvironment`, `isAgent`, `isInteractive`, and `isHybrid`.  The CLI offers functionalities to check for agentic environments, output results in JSON format, verify specific environment types, and run in quiet or debug modes.\n\nKey features include:\n\n*   **Installation:** via `npm install am-i-vibing` or `npx am-i-vibing`.\n*   **Output:** Provides the detected environment's name, type, and a boolean indicating if any agentic environment was found.\n*   **CLI options:** Format output, check for specific environment types, suppress labels, and enable debugging.\n*   **Debug mode:**  Provides detailed information about the detection result, environment variables, and process ancestry.\n*   **License:** MIT.\n",
    "chinese_title": "Show HN: Am-I-vibing，检测代理编码环境",
    "chinese_summary": "\"am-i-vibing\" 是一个工具，既可用作库，也可用作命令行界面 (CLI)，旨在检测您的代码是否在 AI 智能体编码环境中运行。这使得程序能够调整其行为，例如提供专为 AI 智能体定制的特定输出格式或日志。\n\n它识别三种环境类型：`Agent`（直接 AI 执行）、`Interactive`（AI 驱动的交互式 shell）和 `Hybrid`（两者结合）。它支持多种 AI 工具，包括 Aider、Claude Code、Cursor、GitHub Copilot Agent 和 Replit。\n\n该库提供 `detectAgenticEnvironment`、`isAgent`、`isInteractive` 和 `isHybrid` 函数。CLI 提供检查智能体环境、以 JSON 格式输出结果、验证特定环境类型以及在静默或调试模式下运行的功能。\n\n主要特点包括：\n\n*   **安装:** 通过 `npm install am-i-vibing` 或 `npx am-i-vibing`。\n*   **输出:** 提供检测到的环境的名称、类型以及指示是否找到任何智能体环境的布尔值。\n*   **CLI 选项:** 格式化输出、检查特定环境类型、抑制标签和启用调试。\n*   **调试模式:** 提供有关检测结果、环境变量和进程沿袭的详细信息。\n*   **许可:** MIT。"
  },
  {
    "id": "44618335",
    "title": "What the Fuck Python",
    "url": "https://colab.research.google.com/github/satwikkansal/wtfpython/blob/master/irrelevant/wtf.ipynb",
    "summary": "This document, titled \"What the Fuck Python,\" simply states \"Google Colab登录\" which translates to \"Google Colab Login\" in English.\n\nTherefore, the entire article is just a single phrase instructing the reader to log into Google Colaboratory (Colab).\n\n**Summary:** The document instructs the user to log into Google Colaboratory.\n",
    "chinese_title": "操他妈的Python",
    "chinese_summary": "文档标题为“What the Fuck Python”，内容仅为“Google Colab登录”，即指示用户登录Google Colaboratory (Colab)。\n\n**总结：** 该文档指示用户登录Google Colaboratory。"
  },
  {
    "id": "44621029",
    "title": "Data and Democracy: Charting Assault on American Democracy and a Path Forward",
    "url": "https://data4democracy.substack.com/p/on-data-and-democracy-mid-year-roundup",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "数据与民主：剖析对美国民主的冲击与前行之路",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "44587116",
    "title": "Babies made using three people's DNA are born free of mitochondrial disease",
    "url": "https://www.bbc.com/news/articles/cn8179z199vo",
    "summary": "This article reports on the successful birth of eight babies in the UK using a three-person DNA technique, offering hope to families at risk of passing on mitochondrial diseases. The procedure combines the DNA of the parents with a small amount (0.1%) of genetic material from a donor woman, effectively replacing the mother's faulty mitochondria with healthy ones.\n\nThe technique has been legal in the UK for a decade, and this marks the first confirmed instances of children born free from these incurable, often fatal, conditions. Parents who underwent the procedure express immense gratitude, emphasizing the joy and hope brought by their healthy children.\n\nMitochondrial diseases affect about 1 in 5,000 babies, leading to severe disability and even death due to energy deficiency. The Newcastle Fertility Centre anticipates a demand for 20-30 such births annually.\n\nWhile all babies born through the procedure are free from mitochondrial disease and meet developmental milestones, minor health issues (epilepsy, abnormal heart rhythm) have been observed, although not attributed to the technique. Researchers are also investigating the presence of defective mitochondria in some children, although at levels below those causing disease.\n\nThe UK is the first country to legalize this procedure, although it faced controversy due to permanently altering the human genetic inheritance passed down through generations. Supporters highlight the significant advancement in preventing inherited diseases and providing hope to affected families, who previously faced the devastating loss of children to mitochondrial diseases.\n",
    "chinese_title": "使用三个人DNA制造的婴儿不会患线粒体疾病。",
    "chinese_summary": "英国成功诞生八名“三亲”婴儿，为线粒体疾病家庭带来希望"
  },
  {
    "id": "44625358",
    "title": "The summer of flooding across the US, and scientists know why",
    "url": "https://www.cnn.com/2025/07/20/climate/summer-of-flooding",
    "summary": "This summer has seen a surge in deadly flash floods across the United States, prompting climate scientists to highlight the role of climate change in exacerbating extreme weather events. Unusually high levels of moisture in the atmosphere, fueled by warmer temperatures in the Gulf and western Atlantic, have created ideal conditions for heavy, localized downpours. This has led to multiple \"100-year\" and \"1,000-year\" floods occurring in quick succession across various states.\n\nScientists emphasize that while these events may have a low probability of occurring naturally, human-caused warming is increasing their frequency. Michael Mann points to factors like \"atmospheric resonance,\" where weather patterns become stagnant, further increasing the likelihood of prolonged extreme weather. Daniel Swain highlights that the most extreme rain events show the clearest connection to climate change.\n\nKate Marvel explains the physics behind the connection: warmer air holds more water vapor, leading to increased evaporation and condensation, which fuels torrential rain. She emphasizes that climate change, driven by greenhouse gas emissions, is undeniably making extreme rainfall more extreme. Ultimately, while factors like ground porosity and topography influence whether a downpour becomes a catastrophic flood, the underlying driver of more intense rainfall is climate change.\n",
    "chinese_title": "美国洪灾之夏，科学家们知道原因",
    "chinese_summary": "今年夏天，美国各地致命的突发洪水激增，促使气候科学家强调气候变化在加剧极端天气事件中的作用。墨西哥湾和西大西洋的温度升高，导致大气中的水分异常升高，为局部强降雨创造了理想条件。这导致多个“百年一遇”和“千年一遇”的洪水在美国各州迅速发生。\n\n科学家强调，虽然这些事件自然发生的概率可能较低，但人为造成的变暖正在增加其发生的频率。迈克尔·曼指出，诸如“大气共振”之类的因素导致天气模式变得停滞，进一步增加了长期极端天气的可能性。丹尼尔·斯温强调，最极端的降雨事件与气候变化的联系最为明显。\n\n凯特·马维尔解释了这种联系背后的物理学原理：温暖的空气能容纳更多的水蒸气，导致蒸发和凝结增加，从而加剧了暴雨。她强调，温室气体排放驱动的气候变化无疑正在使极端降雨变得更加极端。最终，虽然土壤孔隙率和地形等因素会影响降雨是否会演变成灾难性洪水，但更强降雨的根本驱动因素是气候变化。"
  },
  {
    "id": "44618762",
    "title": "TSMC to start building four new plants with 1.4nm technology",
    "url": "https://www.taipeitimes.com/News/front/archives/2025/07/20/2003840583",
    "summary": "TSMC plans to begin construction on four new plants, designated Fab 25, in the Central Taiwan Science Park later this year. The goal is to begin mass production of advanced 1.4-nanometer semiconductor wafers by late 2028. The announcement was made by Central Taiwan Science Park Bureau director-general Hsu Maw-shin at the park's 22nd anniversary celebration.\n\nThe initial phase of the park's expansion will focus on water detention ponds and soil conservation structures. TSMC has leased the land, and the park anticipates exceeding NT$1.2 trillion in annual turnover.\n\nAt a technology symposium in April, TSMC revealed its A14 fabrication process plans. The Fab 25 plants will house four 1.4-nanometer wafer manufacturing facilities. The first plant aims to complete risk assessment by 2027 and start mass production by late 2028, targeting a monthly output of 50,000 wafers.\n\nTSMC Chairman C.C. Wei stated that 30% of TSMC's 2-nanometer and more advanced capacity will be located in Arizona after a US$165 billion investment, creating a leading-edge semiconductor cluster in the US. The Arizona investment includes six advanced wafer fabs, two advanced packaging fabs, and a research and development center. TSMC also plans to build 11 wafer fabs and four advanced packaging facilities in the coming years, preparing for multiple phases of 2-nanometer fabs at the Hsinchu and Kaohsiung science parks.\n",
    "chinese_title": "台积电将开建四座1.4纳米新厂",
    "chinese_summary": "台积电计划今年晚些时候在中部科学园区启动四座新晶圆厂（代号Fab 25）的建设。目标是在2028年底开始量产先进的1.4纳米半导体晶圆。该消息由中部科学园区管理局局长许茂新在园区22周年庆典上宣布。\n\n园区扩建的初期阶段将侧重于滞洪池和水土保持结构的建设。台积电已租赁该土地，园区预计年营业额将超过新台币1.2万亿元。\n\n在四月份的技术研讨会上，台积电公布了其A14制程的计划。Fab 25晶圆厂将容纳四座1.4纳米晶圆制造设施。第一座晶圆厂的目标是在2027年完成风险评估，并在2028年底开始量产，目标月产量为50,000片晶圆。\n\n台积电董事长魏哲家表示，在投资1650亿美元后，台积电30%的2纳米及更先进产能将位于亚利桑那州，在美国打造一个领先的半导体集群。亚利桑那州的投资包括六座先进晶圆厂、两座先进封装厂和一个研发中心。台积电还计划在未来几年内建造11座晶圆厂和四个先进封装厂，为在新竹和高雄科学园区建设多期2纳米晶圆厂做准备。"
  },
  {
    "id": "44621675",
    "title": "Airbnb allowed rampant price gouging following L.A. fires, city attorney alleges",
    "url": "https://www.latimes.com/california/story/2025-07-19/airbnb-allowed-price-gouging-following-l-a-fires-city-attorney-alleges-in-lawsuit",
    "summary": "Los Angeles City Attorney Hydee Feldstein Soto has filed a lawsuit against Airbnb, alleging the platform enabled widespread price gouging and allowed unverified hosts and addresses following the January firestorm in Altadena and Pacific Palisades. The city seeks a permanent order to prevent Airbnb from price hiking during states of emergency and demands reimbursement for affected consumers.\n\nThe lawsuit claims that Airbnb's verification processes are inadequate, potentially endangering tenants with false information and risking crimes like identity theft and sexual assault. Specific examples of hosts using fake names and inaccurately listed locations are cited.\n\nAirbnb disputes the accusations, highlighting its $30 million contribution to fire recovery efforts, including free emergency housing for nearly 24,000 people. They maintain that the platform capped price increases at 10% following the fires and point to praise from California Attorney General Rob Bonta for their initial commitment to compliance.\n\nHowever, the lawsuit alleges violations of California's Unfair Competition Law, Anti-Gouging Law, and the state of emergency declaration, which prohibits price increases of over 10%. The city is seeking fines of $2,500 per instance of alleged price gouging, potentially totaling up to $7.5 million.\n\nDespite Airbnb's pledges and vouchers issued to fire victims, some victims claim the vouchers were difficult to use and previous reporting indicates rental prices still ballooned after the fires.\n",
    "chinese_title": "洛杉矶火灾后，爱彼迎纵容价格欺诈，市检察官指控。",
    "chinese_summary": "洛杉矶市检察官海蒂·费尔德斯坦·索托已对爱彼迎提起诉讼，指控该平台在奥特代纳和太平洋帕利塞德一月发生火灾后，助长了普遍的价格欺诈，并允许未经核实的房东和地址发布房源。该市寻求永久禁令，以防止爱彼迎在紧急状态期间哄抬价格，并要求赔偿受影响的消费者。\n\n诉讼称，爱彼迎的验证流程不完善，可能因虚假信息而危及租户，并可能导致身份盗窃和性侵犯等犯罪行为。诉讼中列举了房东使用假名和错误列出位置的具体例子。\n\n爱彼迎否认了这些指控，强调其为火灾恢复工作贡献了3000万美元，包括为近24,000人提供免费紧急住房。他们坚持认为，在火灾发生后，该平台将价格涨幅限制在10%以内，并指出加州总检察长罗布·邦塔对其最初的合规承诺表示赞扬。\n\n然而，诉讼指控爱彼迎违反了加州不正当竞争法、反暴利法和紧急状态声明，该声明禁止超过10%的价格上涨。该市正在寻求对每起涉嫌价格欺诈行为处以2,500美元的罚款，总额可能高达750万美元。\n\n尽管爱彼迎做出了承诺并向火灾受害者发放了代金券，但一些受害者声称这些代金券难以使用，之前的报告表明，火灾后租金价格仍然飞涨。"
  },
  {
    "id": "44613625",
    "title": "A 14kb page can load much faster than a 15kb page (2022)",
    "url": "https://endtimes.dev/why-your-website-should-be-under-14kb-in-size/",
    "summary": "This article explains how the TCP slow start algorithm can significantly impact website loading speed, particularly highlighting the importance of the \"14kB rule.\" TCP slow start is a mechanism where servers gradually increase the amount of data sent at the beginning of a connection to avoid overwhelming the network.\n\nThe key takeaway is that if a website (or its critical initial rendering components) can be delivered within the first 14kB of data, it can load much faster because it avoids an extra round trip between the browser and the server. This 14kB limit stems from the initial 10 TCP packets sent during slow start, with each packet having a maximum data payload of approximately 1460 bytes.\n\nThe author emphasizes that latency (the time it takes for data to travel) plays a crucial role. High latency, as seen in satellite internet or congested networks, exacerbates the impact of extra round trips. Aiming for under 14kB allows websites to display useful content quickly, improving user experience.\n\nWhile there are caveats (some servers start with larger initial windows, and HTTP/2 & 3 don't completely negate the impact), the principle remains relevant. Prioritizing essential CSS, JavaScript, and initial content within the first 14kB is a valuable optimization strategy. The article suggests optimizing by reducing unnecessary elements like autoplaying videos, tracking scripts, and large frameworks, focusing on delivering a usable experience as quickly as possible.\n",
    "chinese_title": "一个14kb的页面可能比15kb的页面加载得更快 (2022)",
    "chinese_summary": "本文解释了TCP慢启动算法如何显著影响网站加载速度，特别强调了“14kB规则”的重要性。TCP慢启动是一种机制，服务器在连接开始时逐渐增加发送的数据量，以避免网络拥塞。\n\n关键在于，如果网站（或其关键的初始渲染组件）可以在最初的14kB数据内交付，它可以加载得更快，因为它避免了浏览器和服务器之间的额外往返。这个14kB的限制源于慢启动期间发送的最初10个TCP数据包，每个数据包的最大数据有效载荷约为1460字节。\n\n作者强调延迟（数据传输所需的时间）起着至关重要的作用。高延迟，如卫星互联网或拥塞网络中可见，会加剧额外往返的影响。目标是小于14kB，这允许网站快速显示有用的内容，从而改善用户体验。\n\n虽然存在一些注意事项（一些服务器以更大的初始窗口启动，并且HTTP/2和3并没有完全消除其影响），但该原则仍然适用。在最初的14kB内优先考虑必要的CSS、JavaScript和初始内容是一种有价值的优化策略。本文建议通过减少不必要的元素（如自动播放的视频、跟踪脚本和大型框架）进行优化，重点是尽快提供可用的体验。"
  },
  {
    "id": "44624454",
    "title": "Scientists reveal a widespread but unidentified psychological phenomenon",
    "url": "https://www.psypost.org/scientists-reveal-a-widespread-but-previously-unidentified-psychological-phenomenon/",
    "summary": "Scientists have uncovered a previously unidentified psychological phenomenon. While the article title is vague, the provided content focuses on a specific area of cognitive science. Specifically, new research in mice has linked prolonged exposure to PFAS, or \"forever chemicals\" commonly found in drinking water, to brain damage and cognitive impairment. The research demonstrated that even low concentrations of these chemicals can disrupt brain function and impair memory. This finding adds to a growing body of evidence suggesting that these chemicals pose a significant risk to human brain health. The article highlights the potential dangers of widespread environmental pollutants on cognitive function and underscores the need for further investigation into the long-term effects of PFAS exposure on human populations.\n",
    "chinese_title": "科学家揭示一种普遍但未知的心理现象",
    "chinese_summary": "科学家发现一种此前未知的心理现象。虽然文章标题模糊，但内容侧重于认知科学的特定领域。具体来说，小鼠新研究表明，长期暴露于饮用水中常见的PFAS或“永久化学物质”会导致脑损伤和认知障碍。研究表明，即使是低浓度的这些化学物质也会扰乱大脑功能并损害记忆力。这一发现增加了越来越多的证据，表明这些化学物质对人类大脑健康构成重大风险。这篇文章强调了广泛存在的环境污染物对认知功能的潜在危害，并强调需要进一步调查PFAS暴露对人类的长期影响。"
  },
  {
    "id": "44618959",
    "title": "Trigon: Exploiting coprocessors for fun and for profit (part 2)",
    "url": "https://alfiecg.uk/2025/07/16/Trigon.html",
    "summary": "This article is the second part of a write-up on the Trigon kernel exploit, focusing on extending its support to A9(X) and A11 devices. The original Trigon exploit relied on KTRR limit registers and IOSurface object manipulation, which proved inconsistent across different device models.\n\nThe author details the challenges in finding the kernel base due to the absence of KTRR limit registers on A9 and below, and the presence of page tables within the KTRR-protected region on A11. The solution for A10 and A11 involved leveraging the IORVBAR (IO Reset Vector Base Address Register), which points to the physical address of code within the kernelcache, allowing a search for the kernel base. However, this approach fails on A7-A9 devices due to IORVBAR pointing to TrustZone memory inaccessible via the Trigon primitive.\n\nTo support A7-A9 devices, the author explores coprocessor exploitation, focusing on the Always-On Processor (AOP). They analyze the AOP firmware, hook a frequently called function, and use it to control the AOP's execution. Discovering AXI remapping, a SoC feature that remaps physical addresses for coprocessors, was crucial to understanding the AOP's memory management. Ultimately, the author is able to map DRAM into the AOP's address space, execute custom shellcode, and achieve unrestricted read/write primitives.\n",
    "chinese_title": "三角函数：利用协处理器获取乐趣和利润（第二部分）",
    "chinese_summary": "本文是关于 Trigon 内核漏洞利用的第二部分，重点是将该漏洞利用扩展到 A9(X) 和 A11 设备。最初的 Trigon 漏洞利用依赖于 KTRR 限制寄存器和 IOSurface 对象操作，但已被证明在不同的设备型号中并不一致。\n\n作者详细介绍了在 A9 及以下设备上因缺少 KTRR 限制寄存器以及在 A11 上 KTRR 保护区域内存在页表而导致寻找内核基址的挑战。针对 A10 和 A11 的解决方案涉及利用 IORVBAR（IO 重置向量基地址寄存器），该寄存器指向 kernelcache 中代码的物理地址，从而允许搜索内核基址。然而，由于 IORVBAR 指向 TrustZone 内存（无法通过 Trigon 原语访问），因此此方法在 A7-A9 设备上失效。\n\n为了支持 A7-A9 设备，作者探索了协处理器利用，重点关注常时开启处理器 (AOP)。他们分析了 AOP 固件，钩取了一个频繁调用的函数，并使用它来控制 AOP 的执行。发现 AXI 重映射（一种为协处理器重新映射物理地址的 SoC 功能）对于理解 AOP 的内存管理至关重要。最终，作者能够将 DRAM 映射到 AOP 的地址空间中，执行自定义 shellcode，并实现不受限制的读/写原语。"
  },
  {
    "id": "44612151",
    "title": "My Self-Hosting Setup",
    "url": "https://codecaptured.com/blog/my-ultimate-self-hosting-setup/",
    "summary": "This article details the author's journey to create a robust and user-friendly self-hosting setup, moving from a complex and constantly evolving system to a more practical and maintainable solution. The author prioritizes control over personal data and services while ensuring usability for family and friends.\n\nKey requirements include keeping services off the public internet, minimizing infrastructure disruption from misconfigurations, owning core components using open-source options, simplifying user logins with SSO, utilizing declarative configurations for version control, and implementing easy updates. The setup avoids unnecessary modularity and high availability requirements.\n\nThe core technology choices include NixOS for OS configuration and package management, ZFS for data protection and snapshots, Tailscale (with headscale as an open-source backend) for a secure mesh VPN, and Authelia/LLDAP for authentication and authorization.\n\nThe layout involves a public-facing server (\"taris\") for essential services like headscale and Authelia, and a private server (\"kuat\") running TrueNAS for VMs, ZFS pool management, and data storage. VMs like \"bespin\" (NixOS) host the majority of services. Appliances like \"tython\" (Home Assistant OS) and \"coruscant\" (Matrix server) are used for critical services to ensure isolation. Email and password management are outsourced.\n\nSpecific problems addressed include creating a start page (using Flame) for easy service access, using Tailscale exit nodes and Gluetun for combined VPN functionality, and navigating the complexities of authentication protocols like OIDC and LDAP.\n",
    "chinese_title": "我的自托管配置",
    "chinese_summary": "本文详细介绍了作者创建强大且用户友好的自托管系统的过程，从复杂且不断演变的系统转变为更实用且可维护的解决方案。作者在确保家庭和朋友易于使用的同时，优先控制个人数据和服务。\n\n关键要求包括使服务脱离公共互联网，最大限度地减少因错误配置导致的基础设施中断，使用开源选项掌握核心组件，使用SSO简化用户登录，利用声明式配置进行版本控制，以及实施轻松更新。该设置避免了不必要的模块化和高可用性要求。\n\n核心技术选择包括：NixOS用于操作系统配置和软件包管理，ZFS用于数据保护和快照，Tailscale（以headscale作为开源后端）用于安全网状VPN，以及Authelia/LLDAP用于身份验证和授权。\n\n布局包括一个面向公众的服务器（\"taris\"），用于headscale和Authelia等基本服务，以及一个运行TrueNAS的私有服务器（\"kuat\"），用于虚拟机、ZFS池管理和数据存储。像\"bespin\"（NixOS）这样的虚拟机托管了大部分服务。像\"tython\"（Home Assistant OS）和\"coruscant\"（Matrix服务器）这样的设备用于关键服务以确保隔离。电子邮件和密码管理外包。\n\n解决的具体问题包括：创建一个启动页面（使用Flame）以便于访问服务，使用Tailscale出口节点和Gluetun来组合VPN功能，以及应对OIDC和LDAP等身份验证协议的复杂性。"
  },
  {
    "id": "44593628",
    "title": "N78 band 5G NR recordings",
    "url": "https://destevez.net/2025/07/n78-band-5g-nr-recordings/",
    "summary": "This article details the author's effort to record and analyze 5G NR signals in the n78 band (3.3-3.8 GHz TDD), a band widely used in Europe, particularly in Spain. Motivated by the band's novelty, TDD usage, large bandwidth, and higher carrier frequency, the author sought to capture data using multiple antennas to investigate MIMO techniques.\n\nChallenges arose in acquiring the data. Lower-end SDRs lacked sufficient bandwidth, and the author initially encountered issues with a USRP X410 due to spurious signals from the B3 band interfering with the n78 band reception. A USRP N310 was subsequently used, but writing the high-bandwidth IQ data (2x 122.88 Msps) to disk proved problematic. The author found GNU Radio performance inadequate and struggled with the UHD rx_samples_to_file example until recording to tmpfs became the chosen approach.\n\nThe author then recorded 30-second datasets for Movistar (3.55 GHz), Orange (3.65 GHz), and Vodafone (3.75 GHz) cells and formatted them as SigMF. Preliminary observations revealed varying utilization levels and beamforming characteristics. Movistar's 100 MHz cell exhibited low to medium utilization, while Orange's 100 MHz cell was heavily utilized. Vodafone's 90 MHz cell had low utilization and weaker signals. All used a similar TDD downlink/uplink pattern. The author has made these datasets publicly available on Zenodo for further analysis, which will be presented in future posts.\n",
    "chinese_title": "N78 band 5G NR recordings",
    "chinese_summary": "This article details the author's effort to record and analyze 5G NR signals in the n78 band (3.3-3.8 GHz TDD), a band widely used in Europe, particularly in Spain. Motivated by the band's novelty, TDD usage, large bandwidth, and higher carrier frequency, the author sought to capture data using multiple antennas to investigate MIMO techniques.\n\nChallenges arose in acquiring the data. Lower-end SDRs lacked sufficient bandwidth, and the author initially encountered issues with a USRP X410 due to spurious signals from the B3 band interfering with the n78 band reception. A USRP N310 was subsequently used, but writing the high-bandwidth IQ data (2x 122.88 Msps) to disk proved problematic. The author found GNU Radio performance inadequate and struggled with the UHD rx_samples_to_file example until recording to tmpfs became the chosen approach.\n\nThe author then recorded 30-second datasets for Movistar (3.55 GHz), Orange (3.65 GHz), and Vodafone (3.75 GHz) cells and formatted them as SigMF. Preliminary observations revealed varying utilization levels and beamforming characteristics. Movistar's 100 MHz cell exhibited low to medium utilization, while Orange's 100 MHz cell was heavily utilized. Vodafone's 90 MHz cell had low utilization and weaker signals. All used a similar TDD downlink/uplink pattern. The author has made these datasets publicly available on Zenodo for further analysis, which will be presented in future posts.\n"
  },
  {
    "id": "44582694",
    "title": "A Treatise for One Network – Anonymous National Deliberation [pdf]",
    "url": "https://simurgh-beau.github.io/",
    "summary": "生成摘要时出错",
    "chinese_title": "A Treatise for One Network – Anonymous National Deliberation [pdf]",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44621119",
    "title": "New York’s bill banning One-Person Train Operation",
    "url": "https://www.etany.org/statements/impeding-progress-costing-riders-opto",
    "summary": "生成摘要时出错",
    "chinese_title": "New York’s bill banning One-Person Train Operation",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44621268",
    "title": "Erythritol linked to brain cell damage and stroke risk",
    "url": "https://www.sciencedaily.com/releases/2025/07/250718035156.htm",
    "summary": "生成摘要时出错",
    "chinese_title": "Erythritol linked to brain cell damage and stroke risk",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44625492",
    "title": "How the Free Software Foundation battles the LLM bots",
    "url": "https://thenewstack.io/how-the-free-software-foundation-battles-the-llm-bots/",
    "summary": "生成摘要时出错",
    "chinese_title": "How the Free Software Foundation battles the LLM bots",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44613419",
    "title": "Every part on a bicycle is safety critical",
    "url": "https://escapecollective.com/threaded-43-every-part-on-a-bike-is-safety-critical/",
    "summary": "生成摘要时出错",
    "chinese_title": "Every part on a bicycle is safety critical",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44601045",
    "title": "Linux and Secure Boot certificate expiration",
    "url": "https://lwn.net/SubscriberLink/1029767/08f1d17c020e8292/",
    "summary": "生成摘要时出错",
    "chinese_title": "Linux and Secure Boot certificate expiration",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44583729",
    "title": "Show HN: Display Photos on a World Map",
    "url": "https://worldsnap.surge.sh/",
    "summary": "生成摘要时出错",
    "chinese_title": "Show HN: Display Photos on a World Map",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44615695",
    "title": "Evaluating publicly available LLMs on IMO 2025",
    "url": "https://matharena.ai/imo/",
    "summary": "生成摘要时出错",
    "chinese_title": "在2025年国际数学奥林匹克竞赛中评估公开可用的LLM",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44594165",
    "title": "Zig's New Writer",
    "url": "https://www.openmymind.net/Zigs-New-Writer/",
    "summary": "生成摘要时出错",
    "chinese_title": "Zig's New Writer",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44607961",
    "title": "Section 174 is reversed, mostly",
    "url": "https://newsletter.pragmaticengineer.com/p/the-pulse-section-174-is-reversed",
    "summary": "生成摘要时出错",
    "chinese_title": "Section 174 is reversed, mostly",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44620011",
    "title": "The U.K. closed a tax loophole for the global rich, now they're fleeing",
    "url": "https://www.wsj.com/world/uk/the-u-k-closed-a-tax-loophole-for-the-global-rich-now-theyre-fleeing-f078cce4",
    "summary": "生成摘要时出错",
    "chinese_title": "The U.K. closed a tax loophole for the global rich, now they're fleeing",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44613486",
    "title": "Pimping My Casio: Part Deux",
    "url": "https://blog.jgc.org/2025/07/pimping-my-casio-part-deux.html",
    "summary": "生成摘要时出错",
    "chinese_title": "Pimping My Casio: Part Deux",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44602532",
    "title": "When root meets immutable: OpenBSD chflags vs. log tampering",
    "url": "https://rsadowski.de/posts/2025/openbsd-immutable-system-logs/",
    "summary": "生成摘要时出错",
    "chinese_title": "When root meets immutable: OpenBSD chflags vs. log tampering",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44612487",
    "title": "Hyatt Hotels are using algorithmic Rest “smoking detectors”",
    "url": "https://twitter.com/_ZachGriff/status/1945959030851035223",
    "summary": "生成摘要时出错",
    "chinese_title": "Hyatt Hotels are using algorithmic Rest “smoking detectors”",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44586283",
    "title": "First electronic-photonic quantum chip manufactured in commercial foundry",
    "url": "https://news.northwestern.edu/stories/2025/07/first-electronic-photonic-quantum-chip-manufactured-in-commercial-foundry/",
    "summary": "生成摘要时出错",
    "chinese_title": "First electronic-photonic quantum chip manufactured in commercial foundry",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44608754",
    "title": "Asynchrony is not concurrency",
    "url": "https://kristoff.it/blog/asynchrony-is-not-concurrency/",
    "summary": "生成摘要时出错",
    "chinese_title": "Asynchrony is not concurrency",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44620774",
    "title": "Intel to boost gross margins – new products must deliver 50% gross profit",
    "url": "https://www.tomshardware.com/tech-industry/semiconductors/intel-draws-a-line-in-the-sand-to-boost-gross-margins-new-products-must-deliver-50-percent-to-get-the-green-light",
    "summary": "生成摘要时出错",
    "chinese_title": "Intel to boost gross margins – new products must deliver 50% gross profit",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44607838",
    "title": "Meta says it won't sign Europe AI agreement",
    "url": "https://www.cnbc.com/2025/07/18/meta-europe-ai-code.html",
    "summary": "生成摘要时出错",
    "chinese_title": "Meta says it won't sign Europe AI agreement",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44610468",
    "title": "How to write Rust in the Linux kernel: part 3",
    "url": "https://lwn.net/SubscriberLink/1026694/3413f4b43c862629/",
    "summary": "生成摘要时出错",
    "chinese_title": "How to write Rust in the Linux kernel: part 3",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44571765",
    "title": "C# Language Design Meeting for June 30th, 2025",
    "url": "https://github.com/dotnet/csharplang/blob/main/meetings/2025/LDM-2025-06-30.md",
    "summary": "生成摘要时出错",
    "chinese_title": "C# Language Design Meeting for June 30th, 2025",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44616778",
    "title": "LLM Knows the Future: Uncovering Its Multi-Token Prediction Potential",
    "url": "https://arxiv.org/abs/2507.11851",
    "summary": "生成摘要时出错",
    "chinese_title": "LLM Knows the Future: Uncovering Its Multi-Token Prediction Potential",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44617408",
    "title": "Postgres to ClickHouse: Data Modeling Tips",
    "url": "https://clickhouse.com/blog/postgres-to-clickhouse-data-modeling-tips-v2",
    "summary": "生成摘要时出错",
    "chinese_title": "Postgres to ClickHouse: Data Modeling Tips",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44626759",
    "title": "China's Richest Man Buying Water Supply of New Hampshire Town Sparks Alarm",
    "url": "https://www.newsweek.com/new-hampshire-china-water-supply-nongfu-spring-zhong-shanshan-2099705",
    "summary": "生成摘要时出错",
    "chinese_title": "China's Richest Man Buying Water Supply of New Hampshire Town Sparks Alarm",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44614292",
    "title": "Felix Baumgartner, who jumped from stratosphere, dies in Italy",
    "url": "https://www.theinternational.at/felix-baumgartner-who-jumped-from-stratosphere-dies-in-italy/",
    "summary": "生成摘要时出错",
    "chinese_title": "Felix Baumgartner, who jumped from stratosphere, dies in Italy",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44610925",
    "title": "Ccusage: A CLI tool for analyzing Claude Code usage from local JSONL files",
    "url": "https://github.com/ryoppippi/ccusage",
    "summary": "生成摘要时出错",
    "chinese_title": "Ccusage: A CLI tool for analyzing Claude Code usage from local JSONL files",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44612023",
    "title": "Advertising without signal: The rise of the grifter equilibrium",
    "url": "https://www.gojiberries.io/advertising-without-signal-whe-amazon-ads-confuse-more-than-they-clarify/",
    "summary": "生成摘要时出错",
    "chinese_title": "Advertising without signal: The rise of the grifter equilibrium",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44607403",
    "title": "The year of peak might and magic",
    "url": "https://www.filfre.net/2025/07/the-year-of-peak-might-and-magic/",
    "summary": "生成摘要时出错",
    "chinese_title": "The year of peak might and magic",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44620085",
    "title": "Identity vs. Equality in Python",
    "url": "https://pythonkoans.substack.com/p/koan-2-the-tale-of-two-scrolls",
    "summary": "生成摘要时出错",
    "chinese_title": "Identity vs. Equality in Python",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44604050",
    "title": "lsr: ls with io_uring",
    "url": "https://rockorager.dev/log/lsr-ls-but-with-io-uring/",
    "summary": "生成摘要时出错",
    "chinese_title": "lsr: ls with io_uring",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44613491",
    "title": "YouTube No Translation",
    "url": "https://addons.mozilla.org/en-US/firefox/addon/youtube-no-translation/",
    "summary": "生成摘要时出错",
    "chinese_title": "YouTube No Translation",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44583326",
    "title": "Astronomers use colors of trans-Neptunian objects to track ancient stellar flyby",
    "url": "https://phys.org/news/2025-07-astronomers-trans-neptunian-track-ancient.html",
    "summary": "生成摘要时出错",
    "chinese_title": "Astronomers use colors of trans-Neptunian objects to track ancient stellar flyby",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44621210",
    "title": "Show HN: Context42 – capture your coding style from across your projects",
    "url": "https://github.com/zenbase-ai/context42",
    "summary": "生成摘要时出错",
    "chinese_title": "Show HN: Context42 – capture your coding style from across your projects",
    "chinese_summary": "生成摘要时出错"
  }
]