[
  {
    "id": "45937989",
    "title": "Linux on the Fujitsu Lifebook U729",
    "url": "https://borretti.me/article/linux-on-the-fujitsu-lifebook-u729",
    "summary": "This article details the author's experience using Linux on a refurbished Fujitsu Lifebook U729. They praise the laptop as a delightful and functional device for Linux, highlighting its small size, lightweight design, solid build quality, good keyboard, and out-of-the-box hardware compatibility.\n\nThe main challenge was disabling Secure Boot, which was initially greyed out in the BIOS. The author solved this by first installing Windows 11 (which came pre-installed), updating Fujitsu-specific drivers through Windows Update, and then updating the BIOS using the DeskUpdate tool provided by Fujitsu. This updated BIOS enabled the Secure Boot disable option.\n\nThe author also discovered and disabled the \"Absolute Persistence\" corporate spyware in the BIOS.\n\nThe article confirms that Wi-Fi, Bluetooth, sound (using PipeWire), display brightness control, touchscreen, and webcam all function flawlessly with Linux (NixOS specifically) without requiring additional configuration. The microphone and fingerprint sensor were not tested.\n\nFinally, the author provides notes on accessing the BIOS (F2) and boot menu (F12) during startup. The article concludes with links to the Fujitsu product page and data sheet.\n",
    "chinese_title": "富士通 Lifebook U729 上的 Linux",
    "chinese_summary": "本文详细介绍了作者在翻新的富士通 Lifebook U729 上使用 Linux 的体验。作者称赞这款笔记本电脑是一款令人愉快且功能强大的 Linux 设备，并强调了其小巧的尺寸、轻巧的设计、坚固的构建质量、良好的键盘以及开箱即用的硬件兼容性。\n\n主要挑战是禁用 Secure Boot，该选项最初在 BIOS 中显示为灰色。作者通过以下方式解决了这个问题：首先安装 Windows 11（预装），通过 Windows Update 更新富士通特定的驱动程序，然后使用富士通提供的 DeskUpdate 工具更新 BIOS。更新后的 BIOS 启用了禁用 Secure Boot 的选项。\n\n作者还在 BIOS 中发现并禁用了“Absolute Persistence”企业间谍软件。\n\n本文证实，Wi-Fi、蓝牙、声音（使用 PipeWire）、显示屏亮度控制、触摸屏和网络摄像头都可以在 Linux（特别是 NixOS）上完美运行，无需额外配置。麦克风和指纹传感器未经测试。\n\n最后，作者提供了有关启动时访问 BIOS (F2) 和启动菜单 (F12) 的说明。文章最后提供了指向富士通产品页面和数据表的链接。"
  },
  {
    "id": "45936460",
    "title": "Our investigation into the suspicious pressure on Archive.today",
    "url": "https://adguard-dns.io/en/blog/archive-today-adguard-dns-block-demand.html",
    "summary": "This article details an investigation into suspicious pressure being exerted on Archive.today. AdGuard DNS, a service allowing users to bypass paywalls, was contacted by the \"Web Abuse Association Defense\" (WAAD), a newly formed French organization claiming to fight child pornography. WAAD demanded AdGuard block Archive.today for allegedly refusing to remove illegal content.\n\nAdGuard found the request strange and, upon further investigation, discovered inconsistencies. WAAD's website lacked details, its online presence was minimal, and its stated timeline didn't align with provided \"bailiff reports.\" Archive.today promptly removed the flagged content and stated they hadn't received previous notifications. They also hinted at a \"serial\" complaint campaign.\n\nThe investigation revealed WAAD's registration was recent and easily done anonymously. The \"bailiff reports,\" used as evidence by WAAD, were mostly created recently, not in 2023 as WAAD claimed. Two reports from 2023 were linked to a real lawyer who appeared to be impersonated by WAAD.\n\nAdGuard concludes that the complaints are highly suspicious, potentially orchestrated to harm Archive.today, possibly impersonating a real person. They highlight that French law penalizes false reports. AdGuard will file an official complaint with the French police, citing potential criminal behavior. The investigation coincides with reports of an FBI investigation into Archive.today's owner, potentially related to CSAM, adding to the suspicious circumstances.\n",
    "chinese_title": "对Archive.today可疑压力的调查",
    "chinese_summary": "本文详细调查了一起针对Archive.today的可疑压力事件。AdGuard DNS（一项允许用户绕过付费墙的服务）收到了一个名为“Web Abuse Association Defense”（WAAD，网络滥用协会防御）的新成立的法国组织的联系，该组织声称致力于打击儿童色情。WAAD要求AdGuard屏蔽Archive.today，理由是其拒绝删除非法内容。\n\nAdGuard认为这一要求很奇怪，并经过进一步调查，发现了不一致之处。WAAD的网站缺乏细节，其在线存在感极低，并且其声明的时间线与提供的“法警报告”不符。Archive.today迅速删除了被标记的内容，并表示他们之前没有收到过相关通知。他们还暗示存在“连续”投诉活动。\n\n调查显示，WAAD的注册时间很短，并且很容易匿名进行。“法警报告”被WAAD用作证据，但大多数都是最近创建的，而不是像WAAD声称的那样在2023年创建的。2023年的两份报告与一位真正的律师有关，WAAD似乎冒充了他。\n\nAdGuard得出结论，这些投诉非常可疑，可能是为了损害Archive.today而精心策划的，并且可能冒充了真实的人物。他们强调，法国法律会惩罚虚假报告。AdGuard将向法国警方提起正式投诉，理由是存在潜在的犯罪行为。这项调查恰逢有关FBI正在调查Archive.today所有者的报道，可能与CSAM有关，这增加了可疑的情况。"
  },
  {
    "id": "45938723",
    "title": "Windhawk Windows classic theme mod for Windows 11",
    "url": "https://windhawk.net/mods/classic-theme-enable",
    "summary": "This article, based on the title and the minimal provided content, likely discusses a modification (mod) for Windows 11 using Windhawk. The specific purpose of the mod is to bring back or emulate the classic Windows theme. Since the only visible content is \"WindhawkYou need to enable JavaScript to run this app.\", it suggests that the actual content of the article, likely code, instructions, or further explanations, is hidden and requires JavaScript to be enabled in the user's browser.\n\nTherefore, the core idea is: **A Windhawk mod exists (or is being presented) that aims to recreate the look and feel of the classic Windows theme within the Windows 11 operating system.** The article itself is likely unavailable without enabling JavaScript.\n",
    "chinese_title": "适用于 Windows 11 的 Windhawk Windows 经典主题修改",
    "chinese_summary": "本文可能讨论一个使用Windhawk修改Windows 11的mod，旨在恢复或模拟经典Windows主题。由于仅显示“WindhawkYou need to enable JavaScript to run this app.”，表明文章的实际内容，可能是代码、说明或进一步解释，被隐藏，需要启用JavaScript才能查看。\n\n核心思想是：**存在（或正在展示）一个Windhawk mod，旨在Windows 11中重现经典Windows主题的外观和感觉。** 启用JavaScript后可能才能访问该文章。"
  },
  {
    "id": "45938027",
    "title": "Weighting an average to minimize variance",
    "url": "https://www.johndcook.com/blog/2025/11/12/minimum-variance/",
    "summary": "This article addresses the problem of optimally allocating investments across multiple independent assets to minimize portfolio volatility. Starting with two assets, A and B (where A is more volatile), it demonstrates that a mix of both assets, weighted towards the less volatile asset (B), is the optimal strategy. The article derives the optimal allocation weight, `t`, for asset X (the more volatile one) based on the variances of X and Y (the less volatile one): `t = Var(Y) / (Var(X) + Var(Y))`. This shows that the lower the variance of Y, the smaller the allocation to X.\n\nThe problem is then generalized to `n` independent assets (Xi). Using Lagrange multipliers, the article arrives at a formula for the optimal allocation weight `ti` for each asset: `ti = 1/Var(Xi) / (Σ 1/Var(Xj))`, where the summation is over all `j` from 1 to `n`. This equation reveals that the optimal weight for each asset is inversely proportional to its variance and normalized by the sum of inverse variances across all assets. The denominator is noted as the (n-1)st elementary symmetric polynomial in n variables. In essence, to minimize variance, allocate more capital to assets with lower volatility.\n",
    "chinese_title": "最小化方差的平均加权",
    "chinese_summary": "本文探讨了如何在多个独立资产间进行最优投资配置以最小化投资组合波动性的问题。首先以两个资产A和B（A波动性更大）为例，证明了将两者混合，并向波动性较小的资产B倾斜是最佳策略。本文推导出了资产X（波动性较大的资产）的最优配置权重`t`，其基于X和Y（波动性较小的资产）的方差：`t = Var(Y) / (Var(X) + Var(Y))`。这表明Y的方差越小，X的配置越少。\n\n然后，问题被推广到`n`个独立资产（Xi）。使用拉格朗日乘数法，本文得出了每个资产的最优配置权重`ti`的公式：`ti = 1/Var(Xi) / (Σ 1/Var(Xj))`，其中求和是对所有`j`从1到`n`进行的。该公式表明，每个资产的最优权重与其方差成反比，并由所有资产的逆方差之和进行归一化。分母被称为n个变量中的第(n-1)个基本对称多项式。本质上，为了最小化方差，应将更多的资金配置给波动性较低的资产。"
  },
  {
    "id": "45872519",
    "title": "The Nature of the Beast: Charles Le Brun's Human-Animal Hybrids (1806)",
    "url": "https://publicdomainreview.org/collection/le-brun-human-animal-hybrids/",
    "summary": "\"The Nature of the Beast: Charles Le Brun's Human-Animal Hybrids (1806)\" likely examines Charles Le Brun's (a prominent French painter and art theorist of the 17th century) drawings and theories regarding the connections between human and animal physiognomy, often depicted as hybrids.\n\nThe article likely analyzes Le Brun's comparative studies of human faces and animal features, investigating how he sought to correlate external appearances with internal character traits, a core principle of physiognomy. It probably explores the historical and intellectual context of Le Brun's work, including the prevailing scientific and philosophical ideas about the \"Great Chain of Being\" and the relationship between humans and animals during his time.\n\nThe article's focus on \"Human-Animal Hybrids\" suggests that Le Brun didn't just compare, but actively depicted figures blending human and animal characteristics to embody specific personality traits or moral qualities. The fact that the publication year is 1806 suggests a re-evaluation or rediscovery of Le Brun's work at this time. The article might explore why there was a renewed interest in these ideas nearly a century and a half after his death.\n\nUltimately, this research likely explores how Le Brun’s theories and artistic renderings attempted to visually represent the complex relationship between human nature and the animal kingdom, providing insights into the cultural understanding of morality, beauty, and social hierarchy during the Baroque period and potentially its revival in the early 19th century.\n",
    "chinese_title": "野兽的本性：夏尔·勒布伦的人兽混合体 (1806)",
    "chinese_summary": "野兽的本性：夏尔·勒布伦的人兽混合体（1806）"
  },
  {
    "id": "45935503",
    "title": "TCP, the workhorse of the internet",
    "url": "https://cefboud.com/posts/tcp-deep-dive-internals/",
    "summary": "This article explains the importance of TCP (Transmission Control Protocol) as the \"workhorse\" of the internet, enabling reliable data transfer despite the unreliable nature of the underlying network. TCP operates at the transport layer and shields developers from issues like packet loss, corruption, duplication, and reordering by handling retransmission, checksums, and other reliability mechanisms.\n\nThe article highlights flow control, which prevents overwhelming the receiver's buffer, and congestion control, which prevents network collapse. It demonstrates a basic TCP server in C that echoes client input and a simple HTTP server using TCP.\n\nThe article delves into the structure of a TCP segment, explaining key fields like source/destination ports, sequence and acknowledgment numbers (for reliability), and flags (SYN, ACK, FIN, RST for connection management). The sequence and acknowledgment numbers are pivotal for reassembling packets in order. The flags are used for creating, maintaining, and tearing down a TCP connection. Finally, the checksum ensures data integrity, and the window size is the primary method of flow control.\n\nThe article concludes by emphasizing the remarkable reliability of the internet, made possible by the dedicated individuals who have contributed to its development and continuous improvement.\n",
    "chinese_title": "TCP，互联网的基石",
    "chinese_summary": "本文阐述了TCP（传输控制协议）作为互联网“主力军”的重要性，它能够在底层网络不可靠的情况下实现可靠的数据传输。TCP在传输层运行，通过处理重传、校验和及其他可靠性机制，使开发者免受丢包、损坏、重复和重排序等问题的困扰。\n\n本文重点介绍了流量控制，它可以防止接收方缓冲区溢出，以及拥塞控制，它可以防止网络崩溃。文中展示了一个用C语言编写的基本TCP服务器，用于回显客户端输入，以及一个使用TCP的简单HTTP服务器。\n\n本文深入探讨了TCP段的结构，解释了关键字段，如源/目标端口、序列号和确认号（用于可靠性）以及标志位（SYN、ACK、FIN、RST用于连接管理）。序列号和确认号对于按顺序重组数据包至关重要。这些标志位用于创建、维护和关闭TCP连接。最后，校验和确保了数据完整性，窗口大小是流量控制的主要方法。\n\n本文最后强调了互联网的卓越可靠性，这得益于致力于其开发和持续改进的个人。"
  },
  {
    "id": "45938785",
    "title": "Trellis AI (YC W24) Is Hiring: Streamline access to life-saving therapies",
    "url": "https://www.ycombinator.com/companies/trellis-ai/jobs/f4GWvH0-forward-deployed-engineer-full-time",
    "summary": "Trellis AI (YC W24), a spinout from Stanford AI Lab, is hiring a Forward Deployed Engineer to help streamline access to life-saving therapies. They build AI agents that automate healthcare paperwork, like document intake, prior authorizations, and appeals, impacting patients in all 50 states. The company is backed by YC, General Catalyst, and others.\n\nThe role involves designing and implementing AI systems for healthcare decision-making, building 24/7 AI co-workers, and developing production-grade AI systems with robust evaluation frameworks. They seek someone with full-stack experience, proficiency in Python, Go, and ML/NLP libraries, experience with databases, and a proactive, fast-learning attitude. Experience with cloud platforms and open-source contributions are a plus.\n\nTrellis aims to be the \"Stripe of healthcare billing,\" helping providers treat more patients faster by eliminating pre-service paperwork. They reduce time to treatment by over 90%, improve approval and reimbursement rates, and enhance drug program performance. The company has seen 10x revenue growth in the past few months and claims significant market share in its niche. The team is comprised of high achievers and emphasizes real-world impact, customer engagement, and extreme ownership.\n",
    "chinese_title": "Trellis AI (YC W24) 招聘：简化获取救生疗法的途径",
    "chinese_summary": "Trellis AI (YC W24)，一家从斯坦福人工智能实验室分离出来的公司，正在招聘一名前置部署工程师，以帮助简化获取救生疗法的途径。 他们构建人工智能代理来自动化医疗保健文书工作，如文件录入、事先授权和申诉，影响遍及美国所有 50 个州的患者。该公司由 YC、General Catalyst 等机构投资。\n\n该职位涉及为医疗保健决策设计和实施人工智能系统，构建 24/7 全天候人工智能同事，以及开发具有强大评估框架的生产级人工智能系统。 他们希望招聘具备全栈经验、精通 Python、Go 和 ML/NLP 库，具有数据库经验，以及积极主动、快速学习态度的人才。 具有云平台经验和开源贡献者优先。\n\nTrellis 的目标是成为“医疗保健账单领域的 Stripe”，通过消除服务前文书工作，帮助供应商更快地治疗更多患者。 他们将治疗时间缩短 90% 以上，提高批准和报销率，并提高药物项目的绩效。 该公司在过去几个月中实现了 10 倍的收入增长，并声称在其细分市场中占据了相当大的市场份额。 团队由高成就者组成，并强调实际影响、客户参与和极致所有权。"
  },
  {
    "id": "45938698",
    "title": "The Mighty Simplex (2023)",
    "url": "https://galileo-unbound.blog/2023/05/03/the-mighty-simplex/",
    "summary": "\"The Mighty Simplex\" explores the significance and applications of the simplex in various fields, from geometry and materials science to machine learning and optimization. The article emphasizes the simplex's simplicity, symmetry, and efficiency as a fundamental geometric structure. It begins by defining the simplex in d-dimensions as a figure with d+1 vertices, highlighting regular simplexes (equilateral) and their properties.\n\nThe piece then delves into practical applications, showcasing how simplexes are used to represent alloy compositions using barycentric coordinates, crystallographic orientations, and in modeling ecosystem dynamics using replicator equations. It also discusses the Dantzig simplex algorithm for linear programming, where the optimal solution is found by iteratively moving between vertices of a polytope.\n\nFinally, the article introduces the Nelder-Mead (amoeba) algorithm, a nonlinear minimization technique that uses a dynamically adjusting simplex to \"crawl\" through hyperspace, seeking the minimum of a nonlinear objective function. The author emphasizes the simplex's versatility and importance across different disciplines, painting it as a powerful tool for representation, analysis, and optimization.\n",
    "chinese_title": "强大的单纯形 (2023)",
    "chinese_summary": "强大的单纯形\n探讨了单纯形在几何学、材料科学、机器学习和优化等各个领域的重要性和应用。文章强调了单纯形作为基本几何结构的简洁性、对称性和高效性。文章首先将d维单纯形定义为具有d+1个顶点的图形，并重点介绍了正单纯形（等边）及其性质。\n\n随后，文章深入探讨了实际应用，展示了如何使用重心坐标表示合金成分、晶体学取向，以及使用复制方程建模生态系统动力学。文章还讨论了用于线性规划的Dantzig单纯形算法，该算法通过在多面体的顶点之间迭代移动来找到最优解。\n\n最后，文章介绍了Nelder-Mead（变形虫）算法，这是一种非线性最小化技术，它使用动态调整的单纯形在超空间中“爬行”，寻找非线性目标函数的最小值。作者强调了单纯形在不同学科中的多功能性和重要性，将其描绘成一种用于表示、分析和优化的强大工具。"
  },
  {
    "id": "45930151",
    "title": "AI World Clocks",
    "url": "https://clocks.brianmoore.com/",
    "summary": "AI World Clocks is a website showcasing analog clocks generated by nine different AI models every minute. The website creator, Brian Moore, was inspired by Matthew Rayfield.\n\nEach AI model receives the prompt: \"Create HTML/CSS of an analog clock showing ${time}. Include numbers (or numerals) if you wish, and have a CSS animated second hand. Make it responsive and use a white background. Return ONLY the HTML/CSS code with no markdown formatting.\" They are given 2000 tokens to fulfill this request.\n\nThe website displays these AI-generated clocks, updating them every minute. It's currently in a \"Loading...\" and \"Generating AI Clocks...\" state, indicating that the clocks are being actively generated. Brian Moore can also be found on Instagram.\n",
    "chinese_title": "人工智能世界时钟",
    "chinese_summary": "AI世界时钟是一个网站，每分钟展示由九个不同AI模型生成的模拟时钟。该网站的创建者Brian Moore受到了Matthew Rayfield的启发。\n\n每个AI模型都会收到提示：“创建显示${time}的模拟时钟的HTML/CSS。如果需要，可以包含数字（或数字符号），并设置CSS动画秒针。使其具有响应性并使用白色背景。仅返回HTML/CSS代码，不包含Markdown格式。” 它们被赋予2000个tokens来完成此请求。\n\n该网站显示这些AI生成的时钟，每分钟更新一次。目前处于“加载中...”和“生成AI时钟中...”的状态，表明时钟正在积极生成。Brian Moore也可以在Instagram上找到。"
  },
  {
    "id": "45935729",
    "title": "Messing with scraper bots",
    "url": "https://herman.bearblog.dev/messing-with-bots/",
    "summary": "This article details the author's experiment in retaliating against scraper bots that are excessively crawling and DDoSing websites, particularly malicious bots searching for vulnerabilities.  Frustrated with simply blocking these bots, the author explored methods of wasting their resources and misleading them.\n\nInitially, the author created a Markov chain babbler trained on `.php` files to generate realistic-looking but fake PHP code to serve to bots requesting such files. The goal was to waste the bot's time and potentially trick the human operator into thinking they found an exploit.  However, serving large, generated files proved resource-intensive.\n\nThe author then shifted to a static site approach for increased efficiency. They created a \"garbage server\" that serves random paragraphs from Frankenstein, creating a spiderweb of internal links to saturate crawlers. They also developed a static server that serves different real `.php` files from memory upon request for bots seeking `.php` exploits.\n\nDespite the fun and effectiveness, the author cautions against using such tactics on websites reliant on Google indexing.  There's a risk that Googlebot could accidentally crawl the \"babbler\" endpoints and flag the site as spam.  However, serving fake PHP files is considered safer since Googlebot ignores non-HTML pages, and only malicious bots would be searching for them.\n\nAs a compromise, the author placed a hidden, \"nofollow\" link to the babbler on his blog to specifically target the malicious scrapers, and monitors his outbound transfer budget.  The project was a learning experience, yielding knowledge about Markov chains and scraper bots, despite its somewhat adversarial nature.\n",
    "chinese_title": "戏弄爬虫机器人",
    "chinese_summary": "对抗恶意爬虫：一项实验报告"
  },
  {
    "id": "45839834",
    "title": "Strap Rail",
    "url": "https://www.construction-physics.com/p/strap-rail",
    "summary": "This article explores the history of strap rail, a railway technology briefly popular in the early United States. In contrast to Britain's expensive, solid iron rail tracks, the US adopted strap rail: a thin iron plate attached to a wooden timber. This design drastically reduced iron usage, making it significantly cheaper to build railways in a capital-scarce, iron-limited, and sparsely populated US. By 1840, strap rail constituted two-thirds of the US's 3,000 miles of railway.\n\nHowever, the initial cost savings came with long-term drawbacks. Strap rail decayed rapidly due to moisture, insects, and mold, leading to high maintenance costs. Moreover, the iron straps would often curl up, causing derailments. Consequently, strap rail's popularity waned. New York banned its use for public railroads in 1847, mandating conversion to iron rails.\n\nWhile generally phased out by 1860, strap rail found continued use in horse-drawn streetcars (due to their lighter weight) and on some private, industrial railways until the rise of electric streetcars and more robust railway systems. The article concludes by highlighting how technological development is shaped by the interplay of problem-solving efforts and the specific constraints of the environment, exemplified by the rise and fall of strap rail in the early US. It also touches on an even cheaper but more ephemeral technology, the pole road, used for logging.\n",
    "chinese_title": "绑带轨道",
    "chinese_summary": "本文探讨了带状铁轨的历史，这是一种早期在美国曾短暂流行的铁路技术。与英国昂贵的实心铁轨不同，美国采用了带状铁轨：一种固定在木材上的薄铁板。这种设计大大减少了铁的使用，使得在资金匮乏、铁资源有限且人口稀少的美国，建设铁路的成本显著降低。到1840年，带状铁轨占美国3000英里铁路的三分之二。\n\n然而，最初的成本节省带来了长期的弊端。带状铁轨由于潮湿、昆虫和霉菌而迅速腐烂，导致高昂的维护成本。此外，铁条经常卷曲，导致脱轨。因此，带状铁轨的受欢迎程度下降。纽约州于1847年禁止将其用于公共铁路，强制转换为铁轨。\n\n虽然带状铁轨在1860年左右基本被淘汰，但由于其重量较轻，它在马拉街车和一些私人工业铁路中继续使用，直到电动街车和更强大的铁路系统出现。文章最后强调，技术发展是如何受到问题解决努力和特定环境制约因素相互作用的影响的，带状铁轨在美国早期的兴衰就是一个例证。文章还提到了另一种更便宜但更短暂的技术——用于伐木的杆道。"
  },
  {
    "id": "45936262",
    "title": "One Handed Keyboard",
    "url": "https://github.com/htx-studio/One-Handed-Keyboard",
    "summary": "This document describes the open-source design for a one-handed mechanical keyboard, developed in response to a request from a person whose daughter lost the use of her right hand. The keyboard aims to improve computer accessibility and typing speed.\n\nKey features:\n\n*   **One-handed design:** Allows for operation with a single hand.\n*   **Integrated Trackball:** Includes a trackball for mouse control, minimizing hand movement between keyboard and mouse.\n*   **QMK Firmware:** Uses QMK firmware for customization and advanced features.\n*   **Open-Source Hardware and Software:** Hardware designs (PCB layouts in KiCad EDA format), firmware source code, and 3D models are all available on GitHub and Gitee.\n*   **Multiple Keyboard Options:** The project includes designs for left-handed and right-handed versions, in both larger hot-swappable and smaller soldered configurations.\n*   **Detailed Manufacturing Guide:** Provides detailed instructions for PCB fabrication, 3D printing, and assembly, including BOMs for both large and small keyboard variants.\n*   **Uses STM32G431CBU6 microcontroller.**\n\nThe repository contains documentation, firmware, hardware design files, and 3D models. The guide covers PCB specifications, printing materials, hardware components (screws, bearings, switches), and assembly instructions, including how to flash the firmware. Special considerations are given to the orientation of the flex cable connectors, ALPS switch installation, and small sub-PCB connectivity. The project emphasizes ease of customization and modification.\n",
    "chinese_title": "单手键盘",
    "chinese_summary": "本文档介绍了一款单手机械键盘的开源设计，该设计是为了响应一位女儿失去右手功能的用户的需求而开发的。该键盘旨在提高计算机可访问性和打字速度。\n\n主要特点：\n\n*   **单手设计：** 允许单手操作。\n*   **集成轨迹球：** 包含一个轨迹球用于鼠标控制，最大限度地减少手在键盘和鼠标之间的移动。\n*   **QMK固件：** 使用QMK固件进行自定义和高级功能。\n*   **开源硬件和软件：** 硬件设计（KiCad EDA格式的PCB布局）、固件源代码和3D模型均可在GitHub和Gitee上找到。\n*   **多种键盘选项：** 该项目包括左手和右手版本的的设计，包括较大的热插拔配置和较小的焊接配置。\n*   **详细的制造指南：** 提供PCB制造、3D打印和组装的详细说明，包括大型和小型键盘变体的BOM清单。\n*   **使用STM32G431CBU6微控制器。**\n\n该存储库包含文档、固件、硬件设计文件和3D模型。该指南涵盖PCB规格、打印材料、硬件组件（螺钉、轴承、开关）和组装说明，包括如何刷写固件。特别考虑了柔性电缆连接器的方向、ALPS开关安装和小子PCB的连接。该项目强调易于定制和修改。"
  },
  {
    "id": "45935342",
    "title": "Designing a Language (2017)",
    "url": "https://cs.lmu.edu/~ray/notes/languagedesignnotes/",
    "summary": "This article serves as a guide for individuals interested in designing their own programming language. It emphasizes that language design is an iterative process involving defining requirements, designing the language, implementing it, and then testing and refining based on feedback.\n\nThe author stresses the importance of having a solid foundation in programming paradigms, language concepts (like scope, typing, concurrency), and familiarity with existing languages like Python, Smalltalk, Javascript and others. Studying various languages helps understand different design choices and their trade-offs. Resources like classic papers, online courses, and language comparisons are recommended for preparation.\n\nThe article presents a checklist of considerations before starting the design, including identifying the target audience, determining the language's purpose (practical, esoteric, etc.), choosing a paradigm (OO, functional, etc.), and selecting a concurrency model.\n\nA significant portion of the article focuses on choosing a starter set of features.  It poses a series of detailed questions about functions, type systems, expressions, control flow, and concurrency support to help guide the feature selection process.  \n\nFinally, the article introduces the concept of abstract syntax trees (ASTs) as a way to structurally organize language features, using JavaScript's EsTree specification as an example. The author highlights the importance of defining the AST node types, their relationships, and properties. The article suggests learning and researching the areas where understanding is lacking.\n",
    "chinese_title": "设计一门语言 (2017)",
    "chinese_summary": "本文旨在为有兴趣设计自有编程语言的个人提供指导。它强调语言设计是一个迭代过程，包括定义需求、设计语言、实现语言，然后根据反馈进行测试和改进。\n\n作者强调了拥有扎实的编程范式、语言概念（如作用域、类型、并发）基础，以及熟悉现有语言（如Python、Smalltalk、Javascript等）的重要性。研究各种语言有助于理解不同的设计选择及其权衡。建议通过经典论文、在线课程和语言比较等资源进行准备。\n\n本文在开始设计之前，列出了一系列需要考虑的事项，包括确定目标受众、确定语言的用途（实用、深奥等）、选择范式（OO、函数式等）以及选择并发模型。\n\n文章的很大一部分集中在选择起始功能集上。它提出了一系列关于函数、类型系统、表达式、控制流和并发支持的详细问题，以帮助指导功能选择过程。\n\n最后，文章介绍了抽象语法树（AST）的概念，作为一种结构化组织语言功能的方法，并以JavaScript的EsTree规范为例。作者强调了定义AST节点类型、它们的关系和属性的重要性。 文章建议学习和研究缺乏理解的领域。"
  },
  {
    "id": "45825121",
    "title": "Streaming AI agent desktops with gaming protocols",
    "url": "https://blog.helix.ml/p/technical-deep-dive-on-streaming",
    "summary": "Luke Marsden and Chris Sterry detail their journey of using the Moonlight gaming protocol to stream AI agent desktops to users at Helix Code. They needed a solution for low-latency, GPU-accelerated desktop streaming to browsers and native clients, enabling users to interact with AI agents running in containerized Linux environments.\n\nWhile Moonlight offered speed, efficiency, and network resilience, it was designed for single-player gaming, posing a challenge for their multi-user agent access requirement. The initial workaround, \"apps mode,\" involved a \"kickoff session\" hack to start the agent before a user connected, but it resulted in single-user sessions and the potential for multiple conflicting agent instances.\n\nThe solution came in the form of Wolf's \"lobbies mode,\" explicitly designed for multiplayer gaming. This allows multiple clients to connect to the same agent session, eliminating the need for the kickoff hack and enabling true multi-user interaction. Currently, they are migrating to lobbies mode, which solves core architectural problems.\n\nDespite some remaining bugs, like input scaling issues and video corruption on certain clients, the long-term vision involves multiple users viewing the same agent, native client support, and proper mobile client streaming with pre-configured resolutions.\n\nThe article highlights the importance of streaming protocols for visual AI agents and emphasizes that although a protocol might be technically capable, its underlying assumptions can create engineering challenges. The authors also underscore the value of open-source contributions and community support in solving unique technical problems.\n",
    "chinese_title": "使用游戏协议的流式AI智能体桌面",
    "chinese_summary": "Luke Marsden 和 Chris Sterry 详细介绍了他们使用 Moonlight 游戏协议将 AI 代理桌面流式传输给 Helix Code 用户的历程。他们需要一种低延迟、GPU 加速的桌面流式传输解决方案，以便向浏览器和原生客户端提供服务，从而使用户能够与在容器化 Linux 环境中运行的 AI 代理进行交互。\n\n虽然 Moonlight 提供了速度、效率和网络弹性，但它最初是为单人游戏设计的，这给他们的多用户代理访问需求带来了挑战。 最初的解决方法是“应用模式”，其中包含一个“启动会话”的技巧，以便在用户连接之前启动代理，但这会导致单用户会话，并可能导致多个冲突的代理实例。\n\n解决方案以 Wolf 的“大厅模式”的形式出现，该模式专为多人游戏而设计。这允许多个客户端连接到同一个代理会话，无需启动技巧，并实现真正的多用户交互。目前，他们正在迁移到大厅模式，这解决了核心的架构问题。\n\n尽管仍存在一些错误，例如输入缩放问题和某些客户端上的视频损坏，但长期愿景包括多个用户查看同一个代理、原生客户端支持以及具有预配置分辨率的正确移动客户端流式传输。\n\n这篇文章强调了流式传输协议对于可视化 AI 代理的重要性，并强调即使协议在技术上可行，其底层假设也可能带来工程挑战。作者还强调了开源贡献和社区支持在解决独特技术问题方面的价值。"
  },
  {
    "id": "45924483",
    "title": "Lawmakers want to ban VPNs",
    "url": "https://www.eff.org/deeplinks/2025/11/lawmakers-want-ban-vpns-and-they-have-no-idea-what-theyre-doing",
    "summary": "This article argues against proposed laws in Wisconsin and similar efforts in other regions (Michigan, UK) that aim to ban or block VPNs (Virtual Private Networks) in the name of protecting children online. The core issue is that these laws, intended to enforce age verification for accessing certain content, are seen as privacy violations and technically infeasible.\n\nThe article explains that VPNs mask users' locations, making it impossible for websites to determine a user's actual location (e.g., within Wisconsin) and thus comply with a VPN ban targeting specific regions. Lawmakers are seeking to expand the definition of \"harmful to minors\" to censor diverse educational materials, sex education resources, art, and even award-winning literature. The potential consequences are dire: websites might block VPN users worldwide to avoid legal issues in one state, harming legitimate users.\n\nThe piece emphasizes that VPNs are essential for businesses, students, vulnerable populations (domestic abuse survivors, journalists, LGBTQ+ individuals), and anyone seeking privacy. Blocking VPNs would force users to submit personal information (IDs, biometric data) to websites without privacy protection, creating a data breach risk. The article also points out that technically savvy individuals will circumvent VPN bans, rendering the laws ineffective.\n\nUltimately, the author argues that banning VPNs is not a solution to online safety, but rather an attack on digital privacy and freedom. It encourages people, particularly those in Wisconsin, to contact their representatives and oppose the proposed legislation.\n",
    "chinese_title": "立法者想禁用VPN。",
    "chinese_summary": "本文反对威斯康星州拟议的以及其他地区（密歇根州、英国）类似的法律，这些法律以保护儿童在线安全为名，旨在禁止或阻止VPN（虚拟专用网络）。核心问题在于，这些旨在强制执行访问某些内容时的年龄验证的法律，被视为侵犯隐私且技术上不可行。\n\n文章解释说，VPN可以掩盖用户的位置，使网站无法确定用户的实际位置（例如，在威斯康星州内），从而无法遵守针对特定地区的VPN禁令。立法者试图扩大“对未成年人有害”的定义，以审查各种教育材料、性教育资源、艺术，甚至获奖文学作品。潜在的后果是可怕的：网站可能会阻止全球VPN用户，以避免在一个州的法律问题，从而损害合法用户。\n\n文章强调，VPN对于企业、学生、弱势群体（家庭暴力幸存者、记者、LGBTQ+人士）以及任何寻求隐私的人来说至关重要。阻止VPN将迫使用户在没有隐私保护的情况下向网站提交个人信息（身份证、生物识别数据），从而造成数据泄露风险。文章还指出，精通技术的个人将规避VPN禁令，从而使这些法律失效。\n\n最终，作者认为，禁止VPN不是解决在线安全问题的方案，而是对数字隐私和自由的攻击。它鼓励人们，特别是威斯康星州的人们，联系他们的代表并反对拟议的立法。"
  },
  {
    "id": "45887262",
    "title": "A new Google model is nearly perfect on automated handwriting recognition",
    "url": "https://generativehistory.substack.com/p/has-google-quietly-solved-two-of",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "谷歌新模型在自动手写识别方面接近完美。",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "45937816",
    "title": "How to tolerate annoying things",
    "url": "https://psyche.co/guides/how-to-respond-to-annoying-things-with-greater-ease",
    "summary": "This article, \"How to Tolerate Annoying Things,\" likely focuses on strategies for emotional regulation to manage frustration and irritation caused by annoying situations or people. Based on the title and context, the core concept is improving one's ability to handle stressful situations without escalating into negative emotional states.\n\nThe mention of \"EMOTION REGULATION\" highlights that the article will likely cover techniques to consciously influence and manage one's emotional experience. This could involve identifying triggers, recognizing early signs of annoyance, and employing coping mechanisms.\n\nThe inclusion of \"The interplay between breath and emotion – and how to access itVideo by Dr Tracey Marks\" suggests a key focus on the connection between physiological responses (specifically breathing) and emotional states. Dr. Marks' video likely explains how controlled breathing techniques can be used to regulate the nervous system and reduce feelings of annoyance, anxiety, or anger. This implies that the article advocates for using breathwork as a tool for emotional regulation in the face of annoying stimuli.\n\nIn summary, the article likely advocates for emotional regulation techniques, specifically highlighting the power of breathwork, to help individuals better tolerate annoying things and manage their emotional responses in a healthy and constructive way. It probably explains the connection between breathing and emotions and teaches practical breathing exercises to de-escalate annoyance.\n",
    "chinese_title": "如何忍受烦人的事情",
    "chinese_summary": "这篇文章《如何容忍烦人事》可能侧重于情绪调节策略，以管理由烦人情况或人物引起的沮丧和烦躁。根据标题和语境，其核心概念是提高人们处理压力情况的能力，避免升级为负面情绪状态。\n\n提及“情绪调节”表明文章很可能涵盖有意识地影响和管理自身情绪体验的技巧。这可能包括识别触发因素、识别烦躁的早期迹象以及运用应对机制。\n\n包含“呼吸与情绪之间的相互作用——以及如何获取它，翠西·马克斯博士的视频”表明文章重点关注生理反应（特别是呼吸）与情绪状态之间的联系。马克斯博士的视频很可能解释了如何利用受控的呼吸技巧来调节神经系统，并减少烦躁、焦虑或愤怒的感觉。这意味着文章提倡使用呼吸法作为一种情绪调节工具，以应对烦人的刺激。\n\n总而言之，这篇文章很可能提倡情绪调节技巧，特别是强调呼吸法的力量，以帮助人们更好地容忍烦人事，并以健康和建设性的方式管理自己的情绪反应。它可能解释了呼吸和情绪之间的联系，并教授实用的呼吸练习以缓解烦躁情绪。"
  },
  {
    "id": "45808407",
    "title": "Unofficial Microsoft Teams client for Linux",
    "url": "https://github.com/IsmaelMartinez/teams-for-linux",
    "summary": "This article describes an unofficial Microsoft Teams client for Linux, offering a native desktop experience with enhanced Linux integration compared to the web version. Key features include system notifications, system tray integration, custom backgrounds, screen sharing, and multiple account profiles. It emphasizes that it's an independent project and notes limitations stem from the underlying Teams web app.\n\nInstallation is facilitated through dedicated Debian/Ubuntu and RHEL/Fedora package repositories, with detailed instructions provided. Users can also download distribution packages from GitHub Releases (AppImage, deb, rpm, snap, tar.gz). Documentation covers installation, configuration, troubleshooting, multiple profiles, and custom backgrounds.\n\nThe article highlights the importance of security, noting that Electron's built-in sandboxing features are disabled for full Teams functionality. It recommends system-level sandboxing options like Flatpak, Snap, Firejail, AppArmor, or SELinux for improved isolation.\n\nThe project welcomes contributions, provides links to a Matrix chat for support, and encourages bug reporting. It operates under the GPL-3.0 license. Finally, the article touches on the project's history and credits the source of the icons used.\n",
    "chinese_title": "Linux平台的非官方Microsoft Teams客户端",
    "chinese_summary": "本文介绍了一个非官方的 Linux 版 Microsoft Teams 客户端，它提供了比网页版更优化的 Linux 集成原生桌面体验。主要功能包括系统通知、系统托盘集成、自定义背景、屏幕共享和多账户配置文件。文章强调这是一个独立项目，并指出其局限性源于底层的 Teams Web 应用。\n\n可以通过专门的 Debian/Ubuntu 和 RHEL/Fedora 包存储库轻松安装，并提供了详细说明。用户还可以从 GitHub Releases 下载发行包 (AppImage、deb、rpm、snap、tar.gz)。文档涵盖安装、配置、故障排除、多配置文件和自定义背景。\n\n文章强调了安全性的重要性，指出由于需要完整的 Teams 功能，Electron 的内置沙盒功能已被禁用。它建议使用系统级沙盒选项，如 Flatpak、Snap、Firejail、AppArmor 或 SELinux，以提高隔离性。\n\n该项目欢迎贡献，提供了一个 Matrix 聊天链接以提供支持，并鼓励报告错误。它在 GPL-3.0 许可下运行。最后，文章还提到了该项目的历史，并注明了所用图标的来源。"
  },
  {
    "id": "45793920",
    "title": "Can text be made to sound more than just its words? (2022)",
    "url": "https://arxiv.org/abs/2202.10631",
    "summary": "This article, \"Hidden bawls, whispers, and yelps: can text be made to sound more than just its words?\" by Pataca and Costa, explores the idea of embedding visual representations of paralinguistic qualities (loudness, pitch, duration) into text to enhance captions and improve comprehension beyond the literal words spoken. The authors propose that captions, which typically represent speech neutrally, lose valuable nuances conveyed through vocal prosody.\n\nTheir model maps vocal prosody to visual dimensions of typography: loudness to font-weight, pitch to baseline shift, and duration to letter-spacing. This creates \"speech-modulated typography.\" An evaluation tested whether participants could match this visually enhanced text to its original audio, presenting it amongst similar alternatives.\n\nThe study involved 117 participants who achieved an average accuracy of 65% in identifying the correct audio, regardless of whether the text modulation was presented statically or animated. Participants' comments indicated diverse mental models of how the typography reflected speech. The paper concludes that visually modulating typography based on vocal prosody can improve understanding of spoken content, offering a potential method for enriching captions and making them a more accurate representation of speech. The article was published in IEEE Transactions on Affective Computing.\n",
    "chinese_title": "文字能否超越字面意义，传递更多信息？(2022)",
    "chinese_summary": "帕塔卡和科斯塔的文章《隐藏的哭喊、低语和尖叫：文字能否超越其字面意义发出更多声音？》探讨了将副语言特征（响度、音高、持续时间）的视觉表现形式嵌入文本中，以增强字幕并提高对所说内容的理解，使其超越字面意义。作者认为，通常以中性方式呈现语音的字幕会丢失通过声音韵律传达的重要细微差别。\n\n他们的模型将声音韵律映射到排版的视觉维度：响度对应字体粗细，音高对应基线偏移，持续时间对应字母间距。这创造了“语音调节排版”。一项评估测试了参与者是否能将这种视觉增强的文本与其原始音频相匹配，并在相似的备选项中呈现。\n\n该研究涉及117名参与者，他们在识别正确音频方面的平均准确率为65%，无论文本调制是以静态还是动画形式呈现。参与者的评论表明，对于排版如何反映语音，存在不同的心理模型。该论文得出结论：基于声音韵律对排版进行视觉调制可以提高对口语内容的理解，为丰富字幕并使其更准确地表达语音提供了一种潜在的方法。该文章发表在《IEEE情感计算汇刊》上。"
  },
  {
    "id": "45932962",
    "title": "Go's Sweet 16",
    "url": "https://go.dev/blog/16years",
    "summary": "In its 16th anniversary blog post, the Go team highlighted the advancements in the Go language and its ecosystem over the past year, particularly with Go 1.24 and 1.25 releases. Key improvements include the `testing/synctest` package for simplified concurrent code testing, enhancements to the `testing` package for benchmarks and cleanup, container-aware scheduling for improved parallelism in containers, and a new flight recorder for production system diagnostics.\n\nSecurity remained a focus, with positive results from a security audit of Go's native cryptography packages and CAVP certification, paving the way for FIPS 140-3 compliance. The `os.Root` API enhances file system access security.\n\nUnder-the-hood improvements featured a redesigned map implementation for better performance and the experimental Green Tea garbage collector, promising significant reductions in garbage collection overhead.\n\nBeyond the language, the team emphasized Go's development platform, with ongoing gopls language server releases, including new analyzers, refactoring tools, and an experimental Model Context Protocol (MCP) server for AI assistants. Automatic code modernizers were introduced to help developers adopt newer idioms.\n\nGo's involvement in the AI space was highlighted, with the release of the official Go SDK for MCP, in collaboration with Anthropic, and the Agent Development Kit (ADK) for Go from Google.\n\nLooking ahead, the team is focusing on developer productivity, Green Tea garbage collector general availability, SIMD hardware support, and improvements to core libraries like `encoding/json` and `net/http`. They also plan to scale Go's development processes and involve the contributor community more deeply.\n",
    "chinese_title": "Go语言十六岁了",
    "chinese_summary": "Go 团队 16 周年博文回顾了过去一年 Go 语言及其生态系统的发展，特别是 Go 1.24 和 1.25 版本的发布。主要改进包括用于简化并发代码测试的 `testing/synctest` 包，对 `testing` 包中基准测试和清理的增强，用于改进容器中并行性的容器感知调度，以及用于生产系统诊断的新飞行记录器。\n\n安全性仍然是重点，Go 原生密码学软件包的安全审计和 CAVP 认证取得了积极成果，为符合 FIPS 140-3 标准铺平了道路。`os.Root` API 增强了文件系统访问安全性。\n\n底层改进包括重新设计的 map 实现以获得更好的性能，以及实验性的 Green Tea 垃圾回收器，有望显著降低垃圾回收开销。\n\n除了语言本身，该团队还强调了 Go 的开发平台，持续发布 gopls 语言服务器，包括新的分析器、重构工具和一个用于 AI 助手的实验性模型上下文协议 (MCP) 服务器。引入了自动代码现代化工具，以帮助开发人员采用较新的习惯用法。\n\nGo 在 AI 领域的参与受到关注，与 Anthropic 合作发布了官方 Go SDK for MCP，以及 Google 的 Go 代理开发工具包 (ADK)。\n\n展望未来，该团队正专注于提高开发人员的生产力、Green Tea 垃圾回收器的全面可用性、SIMD 硬件支持，以及改进 `encoding/json` 和 `net/http` 等核心库。他们还计划扩展 Go 的开发流程并更深入地让贡献者社区参与进来。"
  },
  {
    "id": "45845782",
    "title": "Löb and Möb: Loops in Haskell (2013)",
    "url": "https://github.com/quchen/articles/blob/master/loeb-moeb.md",
    "summary": "The 2013 Haskell article \"Löb and Möb: Loops in Haskell\" by quchen explores techniques for achieving recursion and loop-like behavior in Haskell, particularly focusing on how to handle situations where the recursive call needs access to the result of the overall computation. It introduces the `löb` and `mü` (often written as `m`) combinators, which provide elegant solutions to these problems without resorting to explicit mutable references or other potentially less purely functional approaches.\n\nThe core idea revolves around the concept of \"tying the knot\" - essentially creating a cyclic dependency where a function needs its own result before it's fully computed. `löb` allows you to define a function that receives its own result as input, enabling complex calculations that depend on the final outcome. `mü`, closely related to `löb`, is often more useful when working with recursive data structures, where each element might depend on information calculated in other parts of the structure.\n\nThe article likely delves into the implementation of these combinators, demonstrating their derivation and highlighting their properties. It probably presents practical examples demonstrating the use of `löb` and `mü` in scenarios such as defining circular data structures, implementing fixpoint computations, or resolving dependencies in a graph.\n\nIn essence, the article advocates for using `löb` and `mü` as powerful tools for expressing recursive and cyclic computations within the constraints of Haskell's purity, providing a more declarative and elegant approach compared to imperative looping constructs.\n",
    "chinese_title": "Löb与Möb：Haskell中的循环 (2013)",
    "chinese_summary": "2013年Haskell文章《Löb and Möb：Haskell中的循环》探讨了在Haskell中实现递归和类循环行为的技术，特别关注如何处理递归调用需要访问整体计算结果的情况。它介绍了`löb`和`mü`（通常写作`m`）组合子，这些组合子为这些问题提供了优雅的解决方案，而无需诉诸显式可变引用或其他可能不太纯粹的函数式方法。\n\n其核心思想围绕着“系结”的概念——本质上是创建一个循环依赖，即一个函数在完全计算完成之前需要它自身的结果。`löb`允许你定义一个接收自身结果作为输入的函数，从而实现依赖于最终结果的复杂计算。`mü`与`löb`密切相关，但在处理递归数据结构时通常更有用，因为每个元素可能依赖于结构的其他部分计算出的信息。\n\n这篇文章可能深入探讨了这些组合子的实现，演示了它们的推导并强调了它们的属性。它可能提出了实际示例，演示了如何在诸如定义循环数据结构、实现不动点计算或解析图中的依赖关系等场景中使用`löb`和`mü`。\n\n本质上，这篇文章倡导使用`löb`和`mü`作为强大的工具，在Haskell的纯函数式约束内表达递归和循环计算，与命令式循环结构相比，提供了一种更具声明性和优雅性的方法。"
  },
  {
    "id": "45928492",
    "title": "'No One Lives Forever' turns 25 and you still can't buy it legitimately",
    "url": "https://www.techdirt.com/2025/11/13/no-one-lives-forever-turns-25-you-still-cant-buy-it-legitimately/",
    "summary": "The article highlights the 25th anniversary of the video game \"No One Lives Forever,\" a critically acclaimed spy-themed first-person shooter. Despite its popularity and the nostalgia surrounding it, the game remains unavailable for legitimate purchase or download. This unfortunate situation is due to complex licensing issues and ownership disputes that have plagued the title for years, preventing its re-release or digital distribution. The author expresses a wistful hope that perhaps, someday, the game will be available again, even if it takes until Bobby Bonilla's infamous deferred contract with the New York Mets expires. The overall tone is a mix of celebration for the game's legacy and frustration at its continued unavailability.\n",
    "chinese_title": "《绝世女特务》25周年，你仍然无法合法购买它",
    "chinese_summary": "文章重点介绍了备受好评的间谍题材第一人称射击游戏“绝命保镖”25周年纪念。尽管该游戏广受欢迎并充满怀旧之情，但仍然无法通过合法途径购买或下载。这种不幸的局面是由于多年来困扰该游戏复杂的许可问题和所有权纠纷造成的，从而阻止了它的重新发布或数字发行。作者表达了一种惆怅的希望，也许有一天，这款游戏会再次上市，即使要等到博比·邦尼拉与纽约大都会队那份臭名昭著的延期合同到期。整体基调是对游戏遗产的庆祝以及对其持续无法获得的沮丧。"
  },
  {
    "id": "45932798",
    "title": "SSL Configuration Generator",
    "url": "https://ssl-config.mozilla.org/",
    "summary": "This article introduces the \"Mozilla SSL Configuration Generator,\" a tool designed to help users create optimal SSL configurations for their web servers. The tool, requiring JavaScript to function, aims to simplify the often complex process of setting up secure HTTPS connections.\n\nThe core purpose is to generate tailored SSL configurations based on user input, ensuring a balance between security, compatibility, and performance. By using the generator, users can avoid common configuration errors that could expose their websites to vulnerabilities. It likely provides options to select specific server software (like Apache, Nginx, etc.) and intended use cases (like modern, intermediate, or old client support).\n\nEssentially, the Mozilla SSL Configuration Generator is a valuable resource for web administrators and developers seeking to implement robust and secure HTTPS configurations, saving them time and effort while minimizing the risk of misconfiguration. The mention of \"Copy\" suggests the tool outputs a configuration file or text that users can then copy and paste into their server's configuration.\n",
    "chinese_title": "SSL配置生成器",
    "chinese_summary": "本文介绍“Mozilla SSL配置生成器”，该工具旨在帮助用户为其Web服务器创建最佳SSL配置。该工具需要JavaScript才能运行，旨在简化通常复杂的安全HTTPS连接设置过程。\n\n其核心目的是根据用户输入生成定制的SSL配置，确保安全性、兼容性和性能之间的平衡。通过使用该生成器，用户可以避免常见的配置错误，这些错误可能会使他们的网站暴露于漏洞之下。它可能提供选择特定服务器软件（如Apache、Nginx等）和预期用例（如现代、中级或旧客户端支持）的选项。\n\n本质上，Mozilla SSL配置生成器对于寻求实施强大而安全的HTTPS配置的Web管理员和开发人员来说是一项宝贵的资源，它可以节省他们的时间和精力，同时最大限度地降低配置错误的风险。“复制”一词表明该工具会输出一个配置文件或文本，用户可以将该文件或文本复制并粘贴到其服务器的配置中。"
  },
  {
    "id": "45923188",
    "title": "HipKittens: Fast and furious AMD kernels",
    "url": "https://hazyresearch.stanford.edu/blog/2025-11-09-hk",
    "summary": "This article introduces HipKittens (HK), a new collection of C++ embedded programming primitives designed to simplify and accelerate AMD kernel development for AI. The authors highlight the significant performance gap between theoretical peak performance of AMD GPUs and what's currently achieved in AI workloads due to immature AMD software. Existing solutions like AITER, PyTorch, and compilers (Triton, Mojo, TileLang) often underperform or lack necessary features. This forces reliance on hand-optimized assembly, hindering widespread adoption.\n\nHipKittens aims to bridge this gap by providing opinionated primitives that allow developers to write performant AMD kernels without resorting to low-level assembly. The authors draw on their previous work, ThunderKittens for NVIDIA, and demonstrate that tile-based abstractions can generalize across different GPU architectures.\n\nThe core findings show that while the tile abstraction is general, the underlying memory access patterns and scheduling strategies need to be architecture-specific. HK achieves significant performance improvements, outperforming AMD's own baselines, including hand-optimized AITER kernels, in attention forwards, GEMM, and attention backwards passes.  The authors emphasize that HK kernels are readable and modifiable.\n\nThe article concludes by advocating for multi-silicon AI, stressing the importance of open hardware and making AMD GPUs more accessible to the AI community. They believe HipKittens is a step towards realizing the full potential of diverse hardware in AI.\n",
    "chinese_title": "HipKittens：快速且激烈的AMD内核",
    "chinese_summary": "本文介绍HipKittens (HK)，一种新型C++嵌入式编程原语集合，旨在简化和加速AMD内核的AI开发。作者强调，由于AMD软件的不成熟，AMD GPU的理论峰值性能与当前AI工作负载中所达到的性能之间存在显著差距。现有的解决方案（如AITER、PyTorch和编译器（Triton、Mojo、TileLang））通常性能不佳或缺乏必要的功能，这迫使人们依赖手工优化的汇编代码，阻碍了广泛采用。\n\nHipKittens旨在通过提供带有明确倾向的原语来弥合这一差距，使开发人员无需借助底层汇编即可编写高性能的AMD内核。作者借鉴了他们之前为NVIDIA开发的ThunderKittens，并证明基于tile的抽象可以推广到不同的GPU架构。\n\n核心发现表明，虽然tile抽象具有通用性，但底层的内存访问模式和调度策略需要针对特定架构。HK实现了显著的性能提升，在注意力前向传递、GEMM和注意力反向传递中，优于AMD自己的基线，包括手工优化的AITER内核。作者强调，HK内核具有可读性和可修改性。\n\n文章最后倡导多芯片AI，强调开放硬件的重要性，并使AMD GPU更容易被AI社区所接受。他们认为HipKittens是朝着在AI中充分发挥多样化硬件潜力的重要一步。"
  },
  {
    "id": "45788564",
    "title": "Color Comparison Between E Ink's Spectra 6 and ChLCD",
    "url": "https://iris-opt.com/en/blog/eink-spectra6-vs-chlcd/",
    "summary": "This article compares two color e-paper technologies: E Ink's Spectra 6 and IRIS Optronics' ChLCD, focusing on their color performance and suitability for various applications.\n\nSpectra 6 utilizes ACeP technology with microcups containing red, blue, yellow, and white ink particles, blended to create six standard colors. ChLCD, on the other hand, uses three layers of liquid crystals (RGB) to reproduce over 16 million colors, offering a richer and more accurate color gamut.\n\nThe comparison reveals that Spectra 6 struggles with certain colors like cyan and magenta, exhibiting less accurate gradients and reduced saturation. In contrast, ChLCD demonstrates superior color accuracy, finer details, and higher saturation across the color spectrum, making it better suited for applications like human portraits, food images, and fashion advertising where color fidelity is crucial.\n\nBeyond color, the article highlights ChLCD's wider operating temperature range (-20°C to 70°C) due to its liquid crystal technology, making it ideal for outdoor displays facing extreme weather conditions. It also boasts a significantly faster refresh rate (1-2 seconds) compared to Spectra 6 (around 15 seconds). Furthermore, leveraging existing LCD manufacturing processes, ChLCD is positioned for cost-effective production of large-size displays, potentially reaching 100-inch screens.\n\nIn conclusion, the article positions ChLCD as the superior technology for color accuracy, outdoor durability, refresh rate, and large-scale production, making it a more compelling choice for various applications.\n",
    "chinese_title": "E Ink Spectra 6 与 ChLCD 的颜色对比",
    "chinese_summary": "本文比较了两种彩色电子纸技术：E Ink 的 Spectra 6 和 IRIS Optronics 的 ChLCD，重点关注它们的色彩表现和对各种应用的适用性。\n\nSpectra 6 采用 ACeP 技术，利用包含红、蓝、黄、白墨水颗粒的微杯混合生成六种标准颜色。另一方面，ChLCD 使用三层液晶 (RGB) 来再现超过 1600 万种颜色，提供更丰富、更准确的色域。\n\n比较表明，Spectra 6 在处理青色和品红色等特定颜色时存在困难，表现出不太准确的渐变和较低的饱和度。相比之下，ChLCD 在整个色谱中都表现出卓越的色彩准确度、更精细的细节和更高的饱和度，使其更适合于人像、食物图像和时尚广告等对色彩保真度至关重要的应用。\n\n除了颜色之外，文章还强调了 ChLCD 凭借其液晶技术而具有的更宽的工作温度范围（-20°C 至 70°C），使其成为应对极端天气条件的户外显示器的理想选择。与 Spectra 6（约 15 秒）相比，它还拥有显着更快的刷新率（1-2 秒）。此外，ChLCD 利用现有的 LCD 制造工艺，有望以具有成本效益的方式生产大尺寸显示器，甚至可达到 100 英寸屏幕。\n\n总之，本文将 ChLCD 定位为在色彩准确性、户外耐用性、刷新率和大规模生产方面都更胜一筹的技术，使其成为各种应用更具吸引力的选择。"
  },
  {
    "id": "45931403",
    "title": "All praise to the lunch ladies",
    "url": "https://bittersoutherner.com/issue-no-12/all-praise-to-the-lunch-ladies",
    "summary": "Jennifer Justus's \"All Praise to the Lunch Ladies\" is a heartfelt tribute to school cafeteria workers and the crucial role they play in children's lives, exemplified by her grandmother, Beulah Culpepper, a lunch lady in rural Georgia. The author recalls her grandmother's dedication to feeding children, even bending the rules to ensure no child went hungry, and highlights the challenges and complexities of school food programs.\n\nThe article explores the broader landscape of school nutrition, including the impact of government funding, regulations, and political debates. It showcases modern-day \"lunch heroes\" like Stephanie Dillard, who advocate for healthier, locally-sourced meals, and Lisa Seiber-Garland, who creatively navigates funding cuts to provide nutritious options. The piece highlights the struggle to balance scratch cooking with budget constraints and the frustrating cuts in federal funding for farm-to-school programs, ultimately impacting access to fresh, healthy food for students.\n\nThe piece emphasizes the importance of universal free meals, as provided in some states like California, to eliminate stigma and ensure all children have access to nutritious food. It also mentions advocates like Alice Waters and Dan Giusti, who are working to revolutionize school food. The article underscores the cafeteria's role as the \"heart of the school,\" recognizing the dedication and resourcefulness of lunch ladies who tirelessly provide essential nourishment and care to students.\n",
    "chinese_title": "午餐阿姨，赞美你们！",
    "chinese_summary": "珍妮弗·贾斯特斯的作品《一切赞美都献给午餐阿姨们》是一篇衷心的致敬之作，献给学校食堂工作人员以及她们在孩子们生活中所扮演的关键角色，她的祖母比尤拉·卡尔佩珀就是佐治亚州农村的一位午餐阿姨。作者回忆起她的祖母致力于喂饱孩子们的奉献精神，甚至变通规则以确保没有孩子饿肚子，并强调了学校食品计划的挑战和复杂性。\n\n文章探讨了学校营养的更广阔领域，包括政府资助、法规和政治辩论的影响。它展示了现代“午餐英雄”，如斯蒂芬妮·迪拉德，她倡导更健康、本地采购的膳食；以及丽莎·塞伯-加兰，她创造性地应对资金削减，以提供营养丰富的选择。文章强调了在预算限制下平衡从零开始烹饪的斗争，以及联邦对农场到学校计划资金令人沮丧的削减，最终影响了学生获得新鲜、健康食品的机会。\n\n文章强调了普遍免费膳食的重要性，例如加利福尼亚州等一些州提供的免费膳食，以消除污名，并确保所有儿童都能获得营养食品。文章还提到了艾丽丝·沃特斯和丹·朱斯蒂等倡导者，他们正在努力彻底改变学校食品。文章强调了食堂作为“学校中心”的作用，并认可午餐阿姨们的奉献精神和足智多谋，她们不知疲倦地为学生提供必要的营养和关怀。"
  },
  {
    "id": "45885699",
    "title": "Blending SQL and Python with Sqlorm",
    "url": "https://hyperflask.dev/blog/2025/11/11/blending-sql-and-python-with-sqlorm/",
    "summary": "This article introduces SQLORM, a Python ORM library created to address specific design preferences not fully met by SQLAlchemy, the author's preferred ORM. SQLORM prioritizes direct SQL usage, detaching objects from sessions, and focusing on plain object mapping.\n\nKey features and design choices include:\n\n*   **SQL-centric Approach:** Encourages writing raw SQL queries within Python functions using docstrings for templating and parameter escaping.\n*   **Detached Objects:** Allows fetching from one database and inserting into another using the same object instance, avoiding session attachment.\n*   **Active Record Pattern:** Uses a `Model` class for basic CRUD operations, reducing boilerplate code.\n*   **Context-Managed Connections:** Leverages context managers for handling database connections and transactions via an `Engine` class.\n*   **Dynamic Columns:** Supports defining model columns using Python annotations for type checking and DDL generation, but doesn't require upfront declaration.\n*   **Read/Write Separation:** Facilitates patterns like reading from a replica database and writing to the primary, as models are not bound to a specific engine.\n\nSQLORM provides utilities for building SQL statements, fetching related rows, and hydrating objects from query results. The library aims to stay close to DB-API principles and includes features for handling relationships, lazy loading, and column types. It also offers Flask integration and comprehensive documentation.\n",
    "chinese_title": "使用 Sqlorm 融合 SQL 和 Python",
    "chinese_summary": "SQLORM：一个注重直接SQL、对象脱离会话且专注于纯对象映射的Python ORM库。\n\n主要特性和设计选择包括：\n\n*   **以SQL为中心的方法：** 鼓励在Python函数中使用docstrings编写原始SQL查询，用于模板化和参数转义。\n*   **分离对象：** 允许从一个数据库获取数据并插入到另一个数据库，使用相同的对象实例，避免会话依附。\n*   **活动记录模式：** 使用`Model`类进行基本的CRUD操作，减少样板代码。\n*   **上下文管理连接：** 利用上下文管理器，通过`Engine`类处理数据库连接和事务。\n*   **动态列：** 支持使用Python注解定义模型列，用于类型检查和DDL生成，但不需要预先声明。\n*   **读/写分离：** 促进诸如从副本数据库读取数据并写入主数据库的模式，因为模型不绑定到特定的引擎。\n\nSQLORM提供了用于构建SQL语句、获取相关行和从查询结果中填充对象的实用程序。 该库旨在尽可能贴近DB-API原则，并包含用于处理关系、延迟加载和列类型的功能。它还提供Flask集成和全面的文档。"
  },
  {
    "id": "45816208",
    "title": "History and use of the Estes AstroCam 110",
    "url": "https://www.dembrudders.com/history-and-use-of-the-estes-astrocam-110.html",
    "summary": "This article on 2Modeler.com details the history and use of the Estes AstroCam 110, a popular model rocket camera. It begins by contrasting the convenience of modern digital photography with the complexities of film photography, setting the stage for understanding the advancements offered by the AstroCam 110.\n\nThe article then chronicles the history of Estes' rocketry cameras, starting with the Camroc, which used a single, round black-and-white film disc that required darkroom handling. The Camroc was followed by the Cineroc movie camera. It highlights the engineering challenges involved in capturing quality images from a flying rocket, emphasizing the need for fast shutter speeds and high-speed film to combat blurring.\n\nThe AstroCam 110, introduced in 1979, represented a significant upgrade. It utilized Kodak's 110 film cartridge, enabling color photography and simplifying film handling for rocketeers. The article notes that embracing this common film format, Estes could eventually retire its film sales and processing service. However, the smaller film format resulted in a noticeable decrease in image quality compared to the Camroc.\n\nThe article also describes the camera's operation, the mechanics of film advancement, and the method of triggering the shutter during parachute ejection. Finally, the author shares personal experiences using the AstroCam 110 and experimenting with modifications, such as the \"Lookdown-AstroCam,\" which allowed the rocket itself to be captured in the photo.\n",
    "chinese_title": "Estes AstroCam 110 的历史与应用",
    "chinese_summary": "这篇2Modeler.com上的文章详细介绍了埃斯特斯AstroCam 110型火箭相机的历史和使用方法。文章首先将现代数码摄影的便利性与胶片摄影的复杂性进行对比，为理解AstroCam 110所提供的进步奠定了基础。\n\n然后，文章回顾了埃斯特斯火箭相机的历史，从使用需要暗房处理的单张圆形黑白胶片的Camroc相机开始。Camroc之后是Cineroc电影摄影机。文章强调了从飞行火箭上拍摄高质量图像所涉及的工程挑战，突出了需要快速快门速度和高速胶片来对抗模糊。\n\n1979年推出的AstroCam 110代表了一次重大升级。它使用了柯达的110胶卷盒，实现了彩色摄影，并简化了火箭爱好者的胶卷处理过程。文章指出，通过采用这种常见的胶卷格式，埃斯特斯最终可以停止其胶卷销售和冲洗服务。然而，与Camroc相比，较小的胶卷格式导致图像质量明显下降。\n\n文章还描述了相机的操作、胶卷推进的机械原理，以及在降落伞弹出期间触发快门的方法。最后，作者分享了使用AstroCam 110的个人经历以及对改装的尝试，例如“Lookdown-AstroCam”，它可以将火箭本身拍摄到照片中。"
  },
  {
    "id": "45935763",
    "title": "Spec-Driven Development: The Waterfall Strikes Back",
    "url": "https://marmelab.com/blog/2025/11/12/spec-driven-development-waterfall-strikes-back.html",
    "summary": "François Zaninotto's article \"Spec-Driven Development: The Waterfall Strikes Back\" critiques the emerging practice of Spec-Driven Development (SDD) in the age of AI coding assistants. SDD aims to provide structure by generating detailed specifications in Markdown before coding, but Zaninotto argues it's a step backward, reminiscent of the Waterfall model's heavy documentation.\n\nHe highlights drawbacks of SDD, including context blindness (missing existing functions), \"Markdown madness\" (overly verbose specifications), systematic bureaucracy (excessive design process), faux Agile practices, doubled code review efforts, a false sense of security (agents not always following specs), and diminishing returns in large, existing codebases.\n\nZaninotto believes SDD tries to remove developers from the process, mistakenly assuming they're mere executors. He argues that software development is non-deterministic and that SDD, like No Code tools, still requires specialized expertise.\n\nHe advocates for an Agile approach using \"Natural Language Development,\" where developers break down complex requirements into simple ones, letting coding agents build iteratively based on natural language instructions. This \"Lean Startup\" inspired method focuses on testing risky assumptions with simple experiments, allowing for rapid development and adaptation. Zaninotto concludes that SDD is a missed opportunity to empower developers with AI and natural language, hindering their potential like confining combustion engines to locomotives. He suggests focusing on richer visual interactions to improve coding agents further.\n",
    "chinese_title": "规范驱动开发：瀑布模型的反击",
    "chinese_summary": "弗朗索瓦·扎尼诺托的文章《规格驱动开发：瀑布模型的反击》批判了人工智能编码助手时代新兴的规格驱动开发（SDD）实践。SDD旨在通过在编码前以Markdown格式生成详细规范来提供结构，但扎尼诺托认为这是一种倒退，让人联想到瀑布模型繁重的文档工作。\n\n他强调了SDD的缺点，包括上下文盲视（遗漏现有函数）、“Markdown疯狂症”（过于冗长的规范）、系统官僚主义（过度的设计流程）、伪敏捷实践、双倍的代码审查工作、虚假的安全感（代理并非总是遵循规范）以及在大型现有代码库中的收益递减。\n\n扎尼诺托认为SDD试图将开发人员从过程中移除，错误地认为他们只是执行者。他认为软件开发是非确定性的，并且SDD，就像无代码工具一样，仍然需要专门的专业知识。\n\n他提倡使用“自然语言开发”的敏捷方法，即开发人员将复杂的需求分解为简单的需求，让编码代理基于自然语言指令迭代构建。这种受“精益创业”启发的的的方法侧重于通过简单的实验测试有风险的假设，从而实现快速开发和适应。扎尼诺托总结说，SDD错失了利用人工智能和自然语言赋能开发人员的机会，阻碍了他们的潜力，就像将内燃机限制在机车上一样。他建议专注于更丰富的视觉交互，以进一步改进编码代理。"
  },
  {
    "id": "45936964",
    "title": "Kagi Bloopers – Search Results Gone Wrong",
    "url": "https://help.kagi.com/kagi/bloopers/",
    "summary": "The \"Kagi Bloopers – Search Results Gone Wrong\" article is a lighthearted look at instances where the Kagi search engine delivered unexpected or humorous results instead of the intended information. The article acknowledges the complexity of building a search engine and admits that, despite their best efforts, mistakes happen. The article presents a collection of these \"bloopers,\" showcasing specific search queries and the amusing results they yielded. Examples include searches for \"NZ Dollar to US,\" \"Hacker,\" \"1337 in French,\" \"Half pony,\" \"1Password password generator,\" \"Corporation,\" \"Pop OS,\" and \"NAD amplifiers.\" These bloopers originated from various platforms like Discord, Mastodon, and X (formerly Twitter). The article encourages users who have encountered similar funny results to share them with the Kagi team. The overall tone is self-aware and humorous, aiming to entertain readers while implicitly highlighting the ongoing efforts to improve search accuracy.\n",
    "chinese_title": "Kagi失误 – 搜索结果出错",
    "chinese_summary": "Kagi爆笑失误：搜寻结果出错集锦"
  },
  {
    "id": "45861463",
    "title": "Driving TFEL with RP2040: Offloading the CPU step by step (2021)",
    "url": "https://www.zephray.me/post/rpi_pico_driving_el/",
    "summary": "This article details a project where the author explores driving a Planar EL640.480-AM TFEL display with an RP2040 microcontroller, aiming to offload tasks from the CPU. The TFEL panel uses a monochrome STN LCD interface, presenting a challenge in finding suitable controllers.\n\nThe author starts with a fully bit-banged approach, directly controlling GPIO pins, but finds it consumes all CPU cycles and is slow. Next, the data transmission is offloaded to the RP2040's PIO (Programmable Input/Output) using two state machines for the dual-scan display. Ensuring synchronization between these state machines proves crucial for a glitch-free image.\n\nThe next step involves using DMA (Direct Memory Access) to feed data to the PIO, further reducing CPU load. Initially, a blocking DMA transfer is implemented, but the CPU still waits for DMA completion. To free up CPU time, DMA interrupts are introduced. An interrupt handler is created to generate HVSync signals and initiate DMA for the next line. This reduces CPU usage to approximately 48%.\n\nFinally, the author pushes the project further by utilizing the PIO to generate the HVsync signals as well, using the PIO's down counter functionality, completely removing the CPU from the timing loop. The PIO handles both data output and sync signal generation, interrupting the CPU only at the end of the frame, maximizing CPU availability for other tasks.\n",
    "chinese_title": "用RP2040驱动TFEL：逐步卸载CPU (2021)",
    "chinese_summary": "本文详细介绍了一个项目，作者探索使用RP2040微控制器驱动Planar EL640.480-AM TFEL显示屏，旨在减轻CPU的负担。TFEL面板使用单色STN LCD接口，这给寻找合适的控制器带来了挑战。\n\n作者首先采用完全位操作的方式，直接控制GPIO引脚，但发现这会消耗所有CPU周期并且速度很慢。接下来，数据传输被卸载到RP2040的PIO（可编程输入/输出），使用两个状态机来处理双扫描显示。确保这些状态机之间的同步对于无故障图像至关重要。\n\n下一步涉及使用DMA（直接内存访问）向PIO提供数据，进一步降低CPU负载。最初，实现了阻塞DMA传输，但CPU仍然需要等待DMA完成。为了释放CPU时间，引入了DMA中断。创建了一个中断处理程序来生成HVSync信号并启动下一行的DMA。这会将CPU使用率降低到大约48%。\n\n最后，作者通过利用PIO生成HVsync信号，以及使用PIO的向下计数器功能，进一步推进了项目，完全将CPU从定时循环中移除。PIO处理数据输出和同步信号生成，仅在帧结束时中断CPU，从而最大限度地提高CPU的可用性以执行其他任务。"
  },
  {
    "id": "45933497",
    "title": "No Leak, No Problem – Bypassing ASLR with a ROP Chain to Gain RCE",
    "url": "https://modzero.com/en/blog/no-leak-no-problem/",
    "summary": "This blog post details the process of finding and exploiting a stack-based buffer overflow vulnerability in the INSTAR IN-8401 2K+ IP camera to achieve unauthenticated remote code execution (RCE).\n\nThe author begins by extracting the camera's firmware using a UART interface, bypassing the initial login prompt with the U-Boot bootloader and an `init=/bin/sh` trick. This allows access to the filesystem for analysis.\n\nThe camera's web interface uses a `lighttpd` web server, which forwards requests to `fcgi_server` and `ipc_server`. The author focuses on these two binaries for vulnerability research, using a combination of fuzzing, static, and dynamic analysis with a gdb debugging setup.\n\nThe vulnerability is discovered in `fcgi_server` within the basic authentication handler. A custom Base64 decoding function copies the decoded result into a fixed-size (516 bytes) stack buffer. By sending an overly long Base64 encoded string in the username field of the HTTP basic authentication, the author triggers a stack buffer overflow, overwriting the return address. The program crashes with the PC register containing \"AAAA\" (0x41414140). The author plans to develop a ROP chain to bypass ASLR and achieve RCE in the next post.\n",
    "chinese_title": "无泄漏，无问题——通过ROP链绕过ASLR以获取RCE",
    "chinese_summary": "本文详细介绍了如何寻找和利用INSTAR IN-8401 2K+ IP摄像头中基于栈的缓冲区溢出漏洞，以实现未经身份验证的远程代码执行(RCE)。\n\n作者首先使用UART接口提取摄像头的固件，并通过U-Boot引导加载程序和一个`init=/bin/sh`技巧绕过初始登录提示。这允许访问文件系统进行分析。\n\n摄像头的Web界面使用`lighttpd` Web服务器，该服务器将请求转发到`fcgi_server`和`ipc_server`。作者专注于对这两个二进制文件进行漏洞研究，结合使用模糊测试、静态分析和动态分析以及gdb调试设置。\n\n该漏洞在`fcgi_server`的基本身份验证处理程序中被发现。自定义的Base64解码函数将解码结果复制到固定大小（516字节）的栈缓冲区中。通过在HTTP基本身份验证的用户名字段中发送过长的Base64编码字符串，作者触发了栈缓冲区溢出，覆盖了返回地址。程序崩溃，PC寄存器包含“AAAA”（0x41414140）。作者计划在下一篇文章中开发ROP链以绕过ASLR并实现RCE。"
  },
  {
    "id": "45930598",
    "title": "Structured outputs on the Claude Developer Platform",
    "url": "https://www.claude.com/blog/structured-outputs-on-the-claude-developer-platform",
    "summary": "This article, titled \"Structured outputs on the Claude Developer Platform,\" highlights a guide focused on building AI agents for financial services using Claude on AWS Bedrock. It showcases how teams at institutions like NBIM and Brex are leveraging this platform to develop reliable AI agents. The article promotes learning more about this approach, suggesting it offers valuable insights into building effective AI applications within the financial sector.\n",
    "chinese_title": "Claude开发者平台上的结构化输出",
    "chinese_summary": "Claude开发者平台上的结构化输出"
  },
  {
    "id": "45833047",
    "title": "Random Font – a typographic experiment exploring randomness [pdf]",
    "url": "https://www.ilcovile.it/scritti/COVILE_834_Reprint_Random_Font.pdf",
    "summary": "This document appears to be the raw content of a PDF file, specifically one titled \"Random Font – a typographic experiment exploring randomness.\" Because it's in raw PDF format, the text is heavily encoded and includes a large amount of binary data. This makes a direct human-readable summary from the supplied text impossible.\n\nHowever, given the title, we can infer the following about the article:\n\n*   **Subject:** The article likely discusses an experiment involving a font created or modified using random elements.\n*   **Focus:** The focus is probably on the design process, the aesthetics of the resulting font, and the implications of using randomness in typography.\n*   **Potential Topics:** The article *might* cover:\n    *   The technical methods used to generate randomness in the font (e.g., programming, algorithms).\n    *   Examples of how the random font looks and performs in different contexts.\n    *   The artistic or conceptual reasoning behind the experiment.\n    *   A discussion of the legibility and usability of the font.\n\nWithout a decoded version of the PDF text, a more detailed and accurate summary isn't possible.\n",
    "chinese_title": "随机字体 – 探索随机性的排印实验 [pdf]",
    "chinese_summary": "该文档似乎是PDF文件的原始内容，特别是名为“随机字体 – 探索随机性的排版实验”的文件。由于其为原始PDF格式，文本经过大量编码，包含大量二进制数据。这使得从所提供的文本中直接生成人类可读的摘要变得不可能。\n\n然而，根据标题，我们可以推断出关于该文章的以下信息：\n\n*   **主题：** 文章可能讨论一项实验，涉及使用随机元素创建或修改的字体。\n*   **焦点：** 焦点可能在于设计过程、结果字体的美学以及在排版中使用随机性的意义。\n*   **潜在主题：** 文章 *可能* 涵盖：\n    *   在字体中生成随机性的技术方法（例如，编程、算法）。\n    *   随机字体的外观和在不同上下文中的表现示例。\n    *   实验背后的艺术或概念推理。\n    *   对字体的可读性和可用性的讨论。\n\n在没有PDF文本的解码版本的情况下，无法生成更详细和准确的摘要。"
  },
  {
    "id": "45926224",
    "title": "Winamp clone in Swift for macOS",
    "url": "https://github.com/mgreenwood1001/winamp",
    "summary": "This article introduces \"Winamp macOS,\" a native macOS application aiming to recreate the classic Winamp experience for modern Macs. It supports MP3 and FLAC playback, features a Winamp-inspired user interface, and offers playlist management via M3U files.\n\nKey features include full playback controls, a spectrum analyzer, a 10-band equalizer, a file browser with drag-and-drop support, and multiple oscilloscope visualizations. Notably, it integrates Milkdrop, complete with fullscreen mode and lyrics overlay.\n\nThe application requires macOS 13.0 or later and Xcode 15.0 or later for building. The article provides instructions for building using Xcode, Swift Package Manager and a shell script.\n\nThe project is licensed under the MIT License, encouraging users to use and modify the code freely. The developer also provides a \"Buy Me a Coffee\" link for those who wish to support the project's development. In summary, Winamp macOS is a modern recreation of a classic audio player, offering a nostalgic experience with contemporary features for macOS users.\n",
    "chinese_title": "macOS 平台的 Swift 版 Winamp 克隆",
    "chinese_summary": "本文介绍了“Winamp macOS”，这是一款原生 macOS 应用程序，旨在为现代 Mac 重现经典的 Winamp 体验。它支持 MP3 和 FLAC 播放，具有受 Winamp 启发的用户界面，并通过 M3U 文件提供播放列表管理。\n\n主要功能包括完整的播放控制、频谱分析仪、10 段均衡器、带有拖放支持的文件浏览器以及多种示波器可视化效果。值得注意的是，它集成了 Milkdrop，并提供全屏模式和歌词叠加功能。\n\n该应用程序需要 macOS 13.0 或更高版本以及 Xcode 15.0 或更高版本才能构建。本文提供了使用 Xcode、Swift Package Manager 和 Shell 脚本进行构建的说明。\n\n该项目采用 MIT 许可证，鼓励用户自由使用和修改代码。开发者还提供了一个“Buy Me a Coffee”链接，供希望支持项目开发的人使用。总而言之，Winamp macOS 是对经典音频播放器的现代重塑，为 macOS 用户提供怀旧体验和当代功能。"
  },
  {
    "id": "45875188",
    "title": "Edward Burtynsky's Warning",
    "url": "https://www.theatlantic.com/magazine/2025/12/edward-burtynsky-photographs/684604/",
    "summary": "Edward Burtynsky, a Canadian photographer known for documenting \"altered landscapes\" showcasing the impact of human exploitation, photographed a massive tire-disposal site in California in 1999. He found the scene, with millions of tires stacked high, both surreal and strangely beautiful. However, shortly after his visit, the site caught fire, burning for a month and creating a significant environmental hazard as molten oil risked contaminating the surrounding soil and water.\n\nBurtynsky's work, while sometimes visually striking, often serves as a warning about the consequences of human activity on the environment. Since 2012, he has also dedicated time to photographing pristine landscapes to inspire hope. He recently visited Shark Bay, Australia, a UNESCO World Heritage Site famed for its stromatolites, ancient rock structures formed by microorganisms. These stromatolites, considered the oldest-known fossils, predate many human inventions, including the tire. Burtynsky photographed Shark Bay from the air, ensuring he left the untouched landscape undisturbed. The article highlights Burtynsky's contrasting photographic subjects, revealing both the destructive impact of humanity and the enduring beauty of untouched nature.\n",
    "chinese_title": "爱德华·伯汀斯基的警告",
    "chinese_summary": "爱德华·伯汀斯基是一位以拍摄记录人类活动影响下的“改变地貌”而闻名的加拿大摄影师。1999年，他拍摄了加利福尼亚州一个巨大的轮胎处理场。数百万轮胎堆积如山的景象既超现实又有一种奇异的美感。然而，在他访问后不久，该地点发生火灾，持续燃烧了一个月，融化的油料可能污染周围的土壤和水源，造成了严重的环境危害。\n\n伯汀斯基的作品虽然有时在视觉上引人注目，但往往是对人类活动对环境造成后果的警告。自2012年以来，他还抽出时间拍摄原始景观，以激发人们的希望。他最近参观了澳大利亚的鲨鱼湾，这是一个以叠层石而闻名的联合国教科文组织世界遗产地，叠层石是由微生物形成的古老岩石结构。这些叠层石被认为是已知最古老的化石，比包括轮胎在内的许多人类发明还要古老。伯汀斯基从空中拍摄了鲨鱼湾，以确保他没有干扰这片未受破坏的景观。本文重点介绍了伯汀斯基对比鲜明的摄影主题，揭示了人类的破坏性影响和未受破坏的自然环境的持久美丽。"
  },
  {
    "id": "45937038",
    "title": "IncusOS",
    "url": "https://discuss.linuxcontainers.org/t/announcing-incusos/25139",
    "summary": "IncusOS, a modern, immutable operating system designed specifically for running Incus, is now generally available after a year of development. Built on a minimal Debian 13 base, it features atomic A/B updates, UEFI Secure Boot, and TPM 2.0 for enhanced security. It utilizes Zabbly builds of the Linux kernel, ZFS, and Incus for the latest stable versions. The system is managed entirely through the Incus API using TLS client certificates or OIDC authentication, offering a locked-down environment with no shell access.\n\nIncusOS is intended for bare metal servers but can be tested in virtual machines. Custom images tailored for specific behaviors and trusted certificates are created through an online image customizer, as there is no interactive installation.\n\nThe development team plans weekly stable builds including Linux kernel bugfixes, Incus and Debian bugfixes. Future features include Linstor support, additional system services like Netbird, and a complete Incus deployment and management system through the web UI, eliminating the need for TLS client certificates. The ultimate goal is to automate the deployment of the entire Incus stack with recommended support services.\n\nThe team encourages users to test IncusOS, especially on hardware capable of running Windows 11, keeping the Secure Boot and TPM 2.0 requirements in mind. There's a dedicated forum category and a GitHub repository for bugs and feature requests.\n",
    "chinese_title": "IncusOS",
    "chinese_summary": "IncusOS，一款专为运行 Incus 而设计的现代、不可变操作系统，经过一年的开发现已正式发布。它基于最小化的 Debian 13 构建，具有原子 A/B 更新、UEFI 安全启动和 TPM 2.0 以增强安全性。它使用 Linux 内核、ZFS 和 Incus 的 Zabbly 构建版本以获得最新的稳定版本。该系统完全通过使用 TLS 客户端证书或 OIDC 身份验证的 Incus API 进行管理，提供了一个没有 shell 访问权限的锁定环境。\n\nIncusOS 旨在用于裸机服务器，但可以在虚拟机中进行测试。通过在线镜像定制器创建为特定行为和受信任证书量身定制的自定义镜像，因为没有交互式安装。\n\n开发团队计划每周进行稳定构建，包括 Linux 内核错误修复、Incus 和 Debian 错误修复。未来的功能包括 Linstor 支持、额外的系统服务（如 Netbird）以及通过 Web UI 实现的完整 Incus 部署和管理系统，从而无需 TLS 客户端证书。最终目标是自动化整个 Incus 堆栈的部署以及推荐的支持服务。\n\n团队鼓励用户测试 IncusOS，尤其是在能够运行 Windows 11 的硬件上，请牢记安全启动和 TPM 2.0 要求。有一个专门的论坛类别和一个 GitHub 存储库用于提交错误和功能请求。"
  },
  {
    "id": "45929921",
    "title": "A race condition in Aurora RDS",
    "url": "https://hightouch.com/blog/uncovering-a-race-condition-in-aurora-rds",
    "summary": "Hightouch encountered a race condition bug in Amazon Aurora RDS while attempting to upgrade their database infrastructure to handle increased event processing load after the October 20th AWS outage.\n\nThe upgrade plan involved adding a read replica, upgrading an existing replica, initiating a failover to the upgraded replica, upgrading the original writer, and removing the temporary replica. However, the failover failed repeatedly, reverting almost immediately.\n\nInvestigation revealed the problem: During the failover, Aurora briefly allowed both the original writer and the promoted replica to process writes concurrently. The shared storage layer rejected these simultaneous write operations, causing both instances to crash. This indicated a race condition between demoting the original writer and promoting the replica.\n\nTo confirm the hypothesis, Hightouch scaled down writing services and successfully executed the failover. They escalated the issue to AWS, which confirmed the bug was related to an internal signaling issue in the demotion process, causing the old writer to remain unchanged after the attempted failover.\n\nThe mitigation involved pausing writers before an intentional failover. Hightouch successfully upsized their cluster and implemented monitoring for unexpected writer role changes.\n\nKey takeaways include the importance of preparing for unexpected states during migrations, the value of robust observability for detecting issues, the benefits of isolating component impact in distributed systems, and the limitations of staging environments in replicating production-level bugs.\n",
    "chinese_title": "Aurora RDS 中的竞争条件",
    "chinese_summary": "Hightouch在尝试升级Amazon Aurora RDS数据库基础设施，以应对10月20日AWS中断后增加的事件处理负载时，遇到了竞态条件缺陷。\n\n升级计划包括增加一个只读副本，升级一个现有副本，启动故障转移到升级后的副本，升级原始写入器，以及移除临时副本。然而，故障转移反复失败，几乎立即回滚。\n\n调查显示问题在于：在故障转移期间，Aurora短暂地允许原始写入器和晋升的副本同时处理写入操作。共享存储层拒绝了这些并发的写入操作，导致两个实例崩溃。这表明在降级原始写入器和晋升副本之间存在竞态条件。\n\n为了验证该假设，Hightouch缩减了写入服务，并成功执行了故障转移。他们将问题升级到AWS，AWS确认该缺陷与降级过程中的一个内部信号问题有关，导致旧的写入器在尝试故障转移后保持不变。\n\n缓解措施包括在有意故障转移之前暂停写入器。Hightouch成功地扩大了集群规模，并实施了对意外写入器角色变更的监控。\n\n主要经验包括：在迁移过程中为意外状态做好准备的重要性，用于检测问题的强大可观测性的价值，隔离分布式系统中组件影响的好处，以及分期环境在复制生产级别缺陷方面的局限性。"
  },
  {
    "id": "45929511",
    "title": "The disguised return of EU Chat Control",
    "url": "https://reclaimthenet.org/the-disguised-return-of-the-eus-private-message-scanning-plot",
    "summary": "Okay, here's a summary of the ReclaimTheNet.org article \"The disguised return of EU Chat Control\" based on the information I can infer from the title and general knowledge of the topic:\n\nThe article likely discusses the European Union's efforts to implement measures that would allow for the scanning of private communications, often framed as a way to combat child sexual abuse material (CSAM). The \"disguised return\" likely refers to a situation where, after previous proposals for \"Chat Control\" faced significant pushback and criticism over privacy concerns, the EU is attempting to introduce similar measures under a different guise or through modified legislation.\n\nThe core argument is likely that these new proposals, despite potentially being presented differently, still pose a threat to user privacy and freedom of expression. The article probably argues that the EU's goal of combating CSAM is valid, but the proposed methods of mass surveillance of private communications are disproportionate, ineffective, and open to abuse. It will likely discuss concerns about false positives, the potential chilling effect on legitimate communication, and the erosion of encryption.\n\nFurthermore, the article probably emphasizes that even with safeguards and oversight mechanisms in place, the risk of abuse and misuse of such powers remains significant. It likely calls for alternative solutions that focus on targeted investigations and prevention, rather than mass surveillance. It may also suggest that the EU is attempting to circumvent or ignore previous concerns raised by privacy advocates and experts regarding the potential harms of mass scanning of private messages. The title suggests the article is critical of the EU's approach and views it as a problematic re-emergence of previously rejected ideas.\n",
    "chinese_title": "欧盟聊天监控的变相回归",
    "chinese_summary": "好的，以下是基于标题和我对该主题的了解，对ReclaimTheNet.org文章“欧盟聊天控制的伪装回归”的总结：\n\n该文章可能讨论了欧盟为实施允许扫描私人通信的措施而做出的努力，这些措施通常被描述为打击儿童性虐待材料（CSAM）的一种方式。“伪装回归”可能指的是这样一种情况：在之前的“聊天控制”提案因隐私问题面临重大阻力和批评后，欧盟试图以不同的形式或通过修改后的立法引入类似的措施。\n\n核心论点可能是，这些新的提案，尽管可能以不同的方式呈现，仍然对用户隐私和言论自由构成威胁。这篇文章可能认为，欧盟打击CSAM的目标是合理的，但大规模监视私人通信的拟议方法是不成比例的、无效的，并且容易被滥用。它可能会讨论对误报、对合法通信的潜在寒蝉效应以及加密的侵蚀的担忧。\n\n此外，该文章可能强调，即使有了保障措施和监督机制，滥用这些权力的风险仍然很大。它可能呼吁采取替代解决方案，重点关注有针对性的调查和预防，而不是大规模监控。它也可能暗示，欧盟试图规避或忽视隐私倡导者和专家先前提出的关于大规模扫描私人信息可能造成的危害的担忧。标题表明该文章对欧盟的做法持批评态度，并认为这是先前被拒绝的想法的重现，存在问题。"
  },
  {
    "id": "45809972",
    "title": "Async Mutexes",
    "url": "https://matklad.github.io/2025/11/04/on-async-mutexes.html",
    "summary": "This article explores a potential contradiction in the author's language design beliefs regarding concurrency and mutexes. The author initially believed that single-threaded, concurrent programming obviates the need for mutexes because data races are impossible. However, the author recognizes that mutual exclusion is a logical property, requiring explicit annotations even in single-threaded environments to prevent unintended non-atomic operations due to misplaced `.await` calls. This leans towards explicit async/await models like Kotlin's.\n\nThe author then highlights a contradiction in their own work on TigerBeetle, a system relying on implicit exclusion provided by a single thread. TigerBeetle utilizes callbacks reacting to IO events, mutating shared state. Enforcing explicit locking (mutexes) around all callbacks accessing shared state, like in the Compaction process, would likely lead to a single, global lock around all state accessed within the event loop - effectively reimplementing the implicit locking behavior.\n\nThe author concludes by observing that there are two distinct paradigms for structuring concurrent programs. Async/await systems typically presuppose a CSP (Communicating Sequential Processes) style, where threads are mostly independent and share little data. TigerBeetle, however, utilizes a state machine/actor style, focused on a large amount of shared state evolving in discrete steps in response to IO events. Furthermore, the use of manual callbacks in TigerBeetle mitigates the risk of accidentally introducing concurrency within critical sections, as new concurrency requires explicit continuation functions with rigorous state assertions.\n",
    "chinese_title": "异步互斥锁",
    "chinese_summary": "本文探讨了作者在并发和互斥锁方面的语言设计理念中潜在的矛盾。作者最初认为，单线程并发编程消除了对互斥锁的需求，因为数据竞争是不可能的。然而，作者意识到互斥是一种逻辑属性，即使在单线程环境中也需要显式注解，以防止因`.await`调用位置不当而导致意外的非原子操作。这倾向于像 Kotlin 这样的显式 async/await 模型。\n\n作者随后强调了自己在 TigerBeetle 上的工作中所存在的矛盾。TigerBeetle 是一个依赖于单线程提供的隐式互斥的系统。TigerBeetle 利用回调函数来响应 IO 事件，从而改变共享状态。围绕所有访问共享状态的回调函数强制执行显式锁定（互斥锁），就像在 Compaction 过程中那样，很可能导致围绕事件循环中访问的所有状态的单一全局锁——实际上是重新实现了隐式锁定行为。\n\n作者最后观察到，构建并发程序有两种截然不同的范式。Async/await 系统通常假定一种 CSP（通信顺序进程）风格，其中线程大多是独立的，并且共享少量数据。然而，TigerBeetle 采用了一种状态机/Actor 风格，专注于大量共享状态，这些状态响应 IO 事件以离散的步骤演变。此外，在 TigerBeetle 中使用手动回调函数降低了在关键部分意外引入并发的风险，因为新的并发需要具有严格状态断言的显式延续函数。"
  },
  {
    "id": "45928709",
    "title": "Manganese is Lyme disease's double-edge sword",
    "url": "https://news.northwestern.edu/stories/2025/11/manganese-is-lyme-diseases-double-edge-sword",
    "summary": "This article presents two seemingly disparate pieces of information:\n\n1. **The title suggests that manganese has a complex and potentially harmful role in Lyme disease.** It hints that while manganese might offer some benefit, it also carries a risk or negative consequence. Understanding this duality is likely crucial for treating Lyme disease effectively. The specifics of this \"double-edged sword\" effect would be elaborated upon in the article itself.\n\n2. **The article mentions Northwestern University's graduation events are scheduled for 2026, specifically on October 28, 2025.** This is seemingly unrelated to Lyme disease and manganese, suggesting the article might be a combination of separate news items or a poorly focused piece.\n\nWithout the full article, it's impossible to determine the connection (if any) between these two points. It's possible the graduation date is simply extraneous information attached to the title about manganese and Lyme disease.\n",
    "chinese_title": "锰是莱姆病的双刃剑",
    "chinese_summary": "本文呈现两个看似无关的信息：\n\n1.  **标题暗示锰在莱姆病中扮演着复杂且可能有害的角色。** 它暗示锰可能提供一些益处，但同时也带来风险或负面后果。 理解这种双重性对于有效治疗莱姆病至关重要。 这种“双刃剑”效应的具体细节将在文章中详细阐述。\n\n2.  **文章提到西北大学的毕业典礼定于2026年，具体时间是2025年10月28日。** 这似乎与莱姆病和锰无关，表明这篇文章可能是不同新闻项目的组合，或者是一篇重点不明确的文章。\n\n在没有全文的情况下，无法确定这两点之间是否存在关联（如果有）。 毕业日期可能只是附加在关于锰和莱姆病标题上的无关信息。"
  },
  {
    "id": "45876742",
    "title": "Show HN: Tiny Diffusion – A character-level text diffusion model from scratch",
    "url": "https://github.com/nathan-barry/tiny-diffusion",
    "summary": "\"Tiny Diffusion\" is a character-level text diffusion model for text generation, built from scratch and based on the nanoGPT architecture. Trained on the Tiny Shakespeare dataset, it boasts a small footprint of only 10.7 million parameters, allowing for local experimentation. The repository provides pre-trained weights and scripts for training, text generation, and visualizing the diffusion process.\n\nKey features and takeaways:\n\n*   **Character-level generation:** Operates on individual characters rather than words.\n*   **Small parameter count:** Enables training and inference on modest hardware.\n*   **Pre-trained model:** Ready to use out-of-the-box for text generation.\n*   **Training script:** Users can retrain the model on the same data.\n*   **Visualization tools:** Offers animations to understand the diffusion process, including a \"Game of Life\" inspired experiment.\n*   **Easy setup:** Uses `uv` for dependency management and provides simple commands for training, sampling, and visualization.\n*   **MIT License:** Openly licensed for modification and distribution.\n",
    "chinese_title": "Show HN: Tiny Diffusion – 从零开始的字符级文本扩散模型",
    "chinese_summary": "Tiny Diffusion：基于nanoGPT架构从零构建的字符级文本扩散模型，用于文本生成。 它在Tiny Shakespeare数据集上进行训练，仅包含1070万个参数，占用空间小，便于本地实验。 该仓库提供预训练权重和脚本，用于训练、文本生成和扩散过程可视化。\n\n主要特性和要点：\n\n*   **字符级生成：** 基于单个字符而非单词进行操作。\n*   **小参数量：** 能够在配置一般的硬件上进行训练和推理。\n*   **预训练模型：** 开箱即用，可直接用于文本生成。\n*   **训练脚本：** 用户可以在相同数据上重新训练模型。\n*   **可视化工具：** 提供动画以了解扩散过程，包括一个受“生命游戏”启发的实验。\n*   **易于设置：** 使用 `uv` 进行依赖管理，并提供简单的命令用于训练、采样和可视化。\n*   **MIT许可证：** 采用开放许可，允许修改和分发。"
  },
  {
    "id": "45809722",
    "title": "Continuous Architecture: A decade of designing for change",
    "url": "https://continuousarchitecture.com/2025/11/04/a-decade-of-ca/",
    "summary": "This article reflects on the decade since Continuous Architecture (CA) was introduced, emphasizing its enduring relevance in today's fast-paced technological landscape. CA prioritizes a continuous flow of value and adapts to the evolving demands of software delivery, shifting from comprehensive modeling to a continuous stream of decisions.\n\nThe author highlights the increased importance of architecture due to agile and DevOps practices and the rise of independent components like microservices. This necessitates a shift from single-architect approaches to distributed architectural work.\n\nThe core of the article revisits the six principles of CA:\n\n1.  **Architect products:** Focus on long-term value and customer needs over project-specific solutions.\n2.  **Focus on quality attributes:** Prioritize non-functional requirements like security and scalability.\n3.  **Delay design decisions:** Base decisions on facts, not assumptions, but avoid deferring for too long.\n4.  **Architect for change:** Embrace loosely coupled, small components like microservices.\n5.  **Architect for build, test, deploy, and operate:** Consider the entire delivery pipeline, not just development.\n6.  **Model the organisation of your teams:** Apply Conway's Law to align team structures with system design.\n\nThe author concludes that these principles remain valid and foundational, having successfully navigated the rise of cloud, DevOps, and microservices. The current challenge lies in consistent implementation across organizations to maximize the benefits of Continuous Architecture.\n",
    "chinese_title": "持续架构：为变革而设计的十年",
    "chinese_summary": "本文回顾了持续架构(CA)提出十年以来的发展，强调了它在当今快节奏技术环境中的持久 relevance。CA优先考虑价值的持续流动，并适应软件交付不断变化的需求，从全面的建模转向持续的决策流。\n\n作者强调，由于敏捷和DevOps实践以及微服务等独立组件的兴起，架构的重要性日益增加。这需要从单一架构方法转变为分布式架构工作。\n\n本文的核心内容回顾了CA的六项原则：\n\n1.  **架构产品：** 关注长期价值和客户需求，而不是特定于项目的解决方案。\n2.  **关注质量属性：** 优先考虑诸如安全性和可扩展性等非功能性需求。\n3.  **延迟设计决策：** 基于事实而非假设做出决策，但避免过度推迟。\n4.  **为变更而架构：** 拥抱松散耦合的小组件，如微服务。\n5.  **为构建、测试、部署和运营而架构：** 考虑整个交付流程，而不仅仅是开发。\n6.  **对团队组织进行建模：** 应用康威定律，使团队结构与系统设计保持一致。\n\n作者总结说，这些原则仍然有效且具有基础性，并已成功地经历了云计算、DevOps和微服务的兴起。当前的挑战在于在各个组织中始终如一地实施这些原则，以最大限度地发挥持续架构的优势。"
  },
  {
    "id": "45813186",
    "title": "Ucs-Detect",
    "url": "https://ucs-detect.readthedocs.io/intro.html",
    "summary": "`ucs-detect` is a command-line tool that automatically tests the Unicode support level of terminal emulators, focusing on Wide characters, Emoji ZWJ sequences, Emoji VS-16 sequences, and Zero-Width/combining characters across supported languages. It uses the Query Cursor Position terminal sequence and compares the terminal's output with the `wcwidth` library specification to detect discrepancies.\n\nThe tool identifies potential problems arising from differing Unicode support levels between terminal emulators and libraries, which can lead to display issues with East Asian languages and complex character combinations.\n\n`ucs-detect` allows users to save detailed YAML reports of test results. It also includes a large dataset of Universal Declaration of Human Rights (UDHR) translations to test language-specific script rendering. The results of testing on various terminals are available in the repository, though users are encouraged to submit pull requests to update these results.\n\nThe article provides usage instructions, including how to install, run tests, update existing test data, and submit new terminal results. Furthermore, it outlines how to analyze problems through interactive debugging using the `--stop-at-error` argument. The tool has been developed with features improving over time (like Emoji and DEC Private Modes detection), and continues to evolve with community contributions.\n",
    "chinese_title": "Ucs-Detect\n统一码检测",
    "chinese_summary": "`ucs-detect` 是一个命令行工具，可自动测试终端模拟器的 Unicode 支持级别，重点关注宽字符、Emoji ZWJ 序列、Emoji VS-16 序列以及受支持语言中的零宽度/组合字符。它使用查询光标位置终端序列，并将终端的输出与 `wcwidth` 库规范进行比较，以检测差异。\n\n该工具可识别终端模拟器和库之间 Unicode 支持级别不同而可能产生的问题，这些问题会导致东亚语言和复杂字符组合的显示问题。\n\n`ucs-detect` 允许用户保存测试结果的详细 YAML 报告。它还包含一个大型的《世界人权宣言》(UDHR) 翻译数据集，用于测试特定于语言的脚本渲染。各种终端的测试结果可在存储库中找到，但鼓励用户提交 pull request 以更新这些结果。\n\n本文提供了使用说明，包括如何安装、运行测试、更新现有测试数据以及提交新的终端结果。此外，它还概述了如何使用 `--stop-at-error` 参数通过交互式调试来分析问题。该工具不断发展，功能也在不断改进（例如 Emoji 和 DEC 私有模式检测），并随着社区的贡献持续发展。"
  },
  {
    "id": "45930284",
    "title": "Minisforum Stuffs Entire Arm Homelab in the MS-R1",
    "url": "https://www.jeffgeerling.com/blog/2025/minisforum-stuffs-entire-arm-homelab-ms-r1",
    "summary": "The Minisforum MS-R1, powered by the Cix CD8180 Arm SoC, aims to compete with Apple's M1 Mac mini and other mini PCs but presents a mixed bag of results. It boasts a 12-core Arm CPU, Mali G720 iGPU, PCIe slot, NVMe storage, WiFi 6E, and ample ports. While the hardware is impressive and the system is quiet, its performance is inconsistent and its energy efficiency is poor, especially at idle.\n\nThe iGPU performance is decent, but Vulkan support is lacking. CPU performance benchmarks are competitive with older Arm Dev Kits but fall short of the M1. A significant issue is poor DGEMM performance due to an instruction set mismatch, which impacts memory access speed.\n\nThe MS-R1 shines with 64GB of RAM, making it suitable for local AI, although RAM speed impacts performance. Networking is strong with dual 10Gbps NICs and fast WiFi 6E. A dedicated GPU upgrade via the PCIe slot improves AI and gaming performance, though driver compatibility can be problematic.\n\nThe BIOS is feature-rich but still has \"Beta\" labels. The machine supports Proxmox virtualization, although unofficially. While the MS-R1 has homelab potential due to its expansion options, its $500-600 price tag makes it a questionable value proposition compared to Intel, AMD, or Apple's M-series Macs. The review concludes that while the MS-R1 is an interesting attempt to shake up the Arm desktop market, it needs firmware fixes, driver mainlining, and better Windows support to be truly competitive.\n",
    "chinese_title": "Minisforum 将整个 Arm 家庭实验室塞进 MS-R1",
    "chinese_summary": "Minisforum MS-R1：搭载Cix CD8180 Arm SoC，旨在与苹果M1 Mac mini及其他迷你PC竞争，但结果喜忧参半。它拥有12核Arm CPU、Mali G720 iGPU、PCIe插槽、NVMe存储、WiFi 6E和丰富的端口。虽然硬件令人印象深刻且系统安静，但其性能不稳定，能效较差，尤其是在空闲时。\n\niGPU性能尚可，但Vulkan支持不足。CPU性能基准测试与较早的Arm开发套件相当，但逊于M1。一个重要问题是由于指令集不匹配导致的DGEMM性能不佳，这影响了内存访问速度。\n\nMS-R1的亮点在于其64GB内存，使其适合本地AI，但内存速度会影响性能。凭借双10Gbps NIC和快速WiFi 6E，网络性能出色。通过PCIe插槽升级独立显卡可提高AI和游戏性能，但驱动程序兼容性可能存在问题。\n\nBIOS功能丰富，但仍带有“Beta”标签。该机器支持Proxmox虚拟化，尽管是非官方的。虽然MS-R1因其扩展选项而具有家庭实验室潜力，但其500-600美元的价格使其与英特尔、AMD或苹果M系列Mac相比，价值主张值得怀疑。评测总结认为，虽然MS-R1是撼动Arm桌面市场的一次有趣尝试，但它需要固件修复、驱动程序主线化以及更好的Windows支持才能真正具有竞争力。"
  },
  {
    "id": "45821402",
    "title": "GEN-0 / Embodied Foundation Models That Scale with Physical Interaction",
    "url": "https://generalistai.com/blog/nov-04-2025-GEN-0",
    "summary": "This article introduces GEN-0, a new class of embodied foundation models designed for multimodal training directly on raw physical interaction data to advance robotics. GEN-0 aims to establish scaling laws for robot intelligence, similar to those seen in LLMs, by scaling multimodal model training in the robotics domain itself.\n\nKey features of GEN-0 include Harmonic Reasoning, which allows the model to seamlessly think and act, and an architecture designed to capture human-level reflexes and physical commonsense. The models have been tested on various robots, demonstrating cross-embodiment capabilities. A significant achievement is the creation of a large-scale robotics dataset, currently at 270,000 hours of real-world manipulation data and growing rapidly.\n\nThe research highlights several important findings: GEN-0 models exhibit strong scaling laws, where more pretraining data and compute predictably improve downstream performance. A phase transition is observed at 7B parameters, where larger models demonstrate continued improvement while smaller models exhibit ossification (weights unable to absorb new information). Pretraining data quality and diversity are crucial, influencing model characteristics and downstream task performance. Data mixtures can be A/B tested to optimize pretraining.\n",
    "chinese_title": "GEN-0 / 具身基础模型：随物理交互扩展",
    "chinese_summary": "本文介绍了GEN-0，一种新型具身基础模型，旨在直接基于原始物理交互数据进行多模态训练，以推动机器人技术发展。GEN-0的目标是通过在机器人领域扩展多模态模型训练，从而建立类似于大型语言模型（LLM）的机器人智能扩展定律。\n\nGEN-0的关键特性包括和谐推理，使模型能够无缝地思考和行动，以及一种旨在捕捉人类水平的反射和物理常识的架构。这些模型已经在各种机器人上进行了测试，展示了跨具身能力。一项重要的成就是创建了一个大规模的机器人数据集，目前包含27万小时的真实世界操作数据，并且还在迅速增长。\n\n该研究强调了几个重要的发现：GEN-0模型表现出强大的扩展定律，即更多的预训练数据和计算能力可以预测性地提高下游性能。在70亿参数时观察到一个相变，更大的模型表现出持续的改进，而较小的模型则表现出僵化（权重无法吸收新信息）。预训练数据的质量和多样性至关重要，影响着模型的特性和下游任务的性能。可以通过A/B测试来优化数据混合的预训练效果。"
  },
  {
    "id": "45797689",
    "title": "Awk Technical Notes (2023)",
    "url": "https://maximullaris.com/awk_tech_notes.html",
    "summary": "This article by Volodymyr Gubarkov delves into interesting technical aspects of AWK, highlighting its design choices and parsing intricacies. A key feature is AWK's lack of garbage collection (GC), influencing design decisions like the inability to return arrays from functions. Instead, arrays are passed and modified within function scopes for deterministic memory management. The article points out that all variables are global by default, with local variables defined through function parameters, a design choice that, while regretted by Brian Kernighan, works well.\n\nThe article also discusses AWK's \"autovivification\" feature, allowing implicit declaration of variables based on their usage. It then dives into parsing details, revealing that `$` is a unary operator applicable to expressions, and can even be on the left-hand side of assignments. The article also explains the unusual behavior of function calls, where spaces are disallowed before parentheses for user-defined functions due to AWK's string concatenation rules.\n\nThe piece sheds light on how built-in functions are treated as part of the grammar, leading to restrictions on naming user-defined functions or variables after them. The article concludes with a discussion of the ERE vs. DIV lexing ambiguity and solutions for parsing regular expressions. Overall, the article illustrates AWK's design as a terse, productive language, optimized for one-liners, which has led to some ad-hoc syntax and parsing quirks.\n",
    "chinese_title": "Awk技术笔记 (2023)",
    "chinese_summary": "Volodymyr Gubarkov 的这篇文章深入探讨了 AWK 有趣的技术细节，重点介绍了它的设计选择和解析复杂性。一个关键特性是 AWK 缺乏垃圾回收 (GC)，这影响了诸如无法从函数返回数组之类的设计决策。相反，为了确定性的内存管理，数组在函数范围内传递和修改。文章指出，默认情况下所有变量都是全局的，局部变量通过函数参数定义，这种设计选择虽然令 Brian Kernighan 后悔，但效果很好。\n\n文章还讨论了 AWK 的“自动激活”特性，允许基于变量的使用隐式声明变量。然后，文章深入探讨了解析细节，揭示了 `$` 是一个适用于表达式的一元运算符，甚至可以在赋值语句的左侧。文章还解释了函数调用的不寻常行为，由于 AWK 的字符串连接规则，在用户自定义函数之前的括号前不允许有空格。\n\n文章阐明了内置函数如何被视为语法的一部分，从而导致对用户自定义函数或变量以其命名施加限制。文章最后讨论了 ERE 与 DIV 词法分析的歧义以及解析正则表达式的解决方案。总的来说，这篇文章说明了 AWK 的设计是一种简洁、高效的语言，针对单行代码进行了优化，这也导致了一些临时的语法和解析怪癖。"
  },
  {
    "id": "45928912",
    "title": "Being poor vs. being broke",
    "url": "https://blog.ctms.me/posts/2025-11-14-being-poor-or-being-broke/",
    "summary": "This article distinguishes between being \"broke\" and being \"poor,\" arguing that they are fundamentally different experiences often misunderstood by those who haven't experienced poverty. Being broke is a temporary financial hardship where money is tight but basic needs are still met. Being poor, however, is a perpetual state of financial instability with no end in sight, where even minor setbacks have devastating consequences.\n\nThe author critiques common advice given to poor people, arguing that it's geared towards those who are broke and have the capacity to improve their situation with short-term sacrifices. They highlight that poor people often already make these sacrifices, stretching every resource to its limit.\n\nThe author illustrates the difference with the example of car repairs, explaining that while a broke person might save money by doing the repairs themselves, a poor person may lack the $300 needed for parts. They also refute the notion that poor people are lazy or unskilled, pointing out that many are forced to spend significant time and effort fixing things themselves, cooking from scratch, and juggling limited resources.\n\nThe piece concludes by highlighting the inadequacy of advice like \"cook at home\" for people struggling to access basic necessities like food, emphasizing the vast chasm between the experience of being broke and the relentless, inescapable reality of being poor.\n",
    "chinese_title": "贫穷与身无分文",
    "chinese_summary": "本文区分了“身无分文”和“贫穷”这两种状态，认为它们是本质上不同的经历，经常被那些没有经历过贫困的人所误解。“身无分文”是一种暂时的经济困难，资金紧张但基本需求仍能得到满足。然而，“贫穷”是一种永无止境的经济不稳定状态，即使是微小的挫折也会造成毁灭性的后果。\n\n作者批判了向穷人提出的常见建议，认为这些建议是针对那些身无分文且有能力通过短期牺牲来改善自身处境的人。他们强调，穷人往往已经做出了这些牺牲，将每项资源都用到极限。\n\n作者用汽车维修的例子说明了这两者之间的区别，解释说，一个身无分文的人可能会通过自己修理来省钱，而一个穷人可能缺乏购买零件所需的300美元。他们还驳斥了穷人懒惰或缺乏技能的观点，指出许多人被迫花费大量时间和精力来自己修理东西、从零开始做饭和利用有限的资源。\n\n文章最后强调，对于那些难以获得食物等基本生活必需品的人来说，像“在家做饭”这样的建议是不足的，强调了“身无分文”的经历与“贫穷”这种无情的、无法逃避的现实之间的巨大鸿沟。"
  },
  {
    "id": "45927210",
    "title": "Linear algebra explains why some words are effectively untranslatable",
    "url": "https://aethermug.com/posts/linear-algebra-explains-why-some-words-are-effectively-untranslatable",
    "summary": "Marco Giancotti argues that the concept of untranslatable words can be understood through the lens of linear algebra. He draws an analogy between expressing concepts in different languages and changing the basis of a vector in linear algebra.\n\nHe posits that concepts are abstract objects in our minds, and words are the \"coordinates\" used to represent them in a specific language (the \"basis\"). Just as a vector's numerical representation changes when the basis is altered, a concept's verbal representation changes when translated into a different language.\n\nGiancotti argues that \"untranslatable\" words arise because some languages have single words for concepts that require multiple words to express accurately in another. Like choosing a suitable basis in linear algebra simplifies calculations, certain languages provide more concise and readily available \"basis vectors\" (words) for specific concepts.\n\nHe identifies two key reasons for practical untranslatability: communication cost and precision. Explaining a complex concept with many words takes time and increases the risk of introducing unintended nuances. Additionally, the finite number of words in a language limits precision, similar to the limited decimal places in a computer, forcing us to \"quantize\" our concepts. This quantization results in a loss of nuance during translation, making perfect equivalence often impossible. This analogy explains why some words are, in practice, effectively untranslatable.\n",
    "chinese_title": "线性代数解释了为何有些词语实际上无法翻译。",
    "chinese_summary": "马可·詹科蒂认为，不可译词的概念可以通过线性代数的视角来理解。他将用不同语言表达概念类比为线性代数中改变向量的基底。\n\n他认为概念是我们脑海中的抽象客体，而词语则是用于在特定语言（即“基底”）中表达它们的“坐标”。正如向量的数值表示在基底改变时会发生变化一样，概念的语言表达在翻译成不同语言时也会发生变化。\n\n詹科蒂认为，“不可译”的词语之所以会出现，是因为某些语言用单个词来表达的概念，在另一种语言中需要多个词才能准确表达。就像在线性代数中选择合适的基底可以简化计算一样，某些语言为特定概念提供了更简洁、更易于使用的“基向量”（词语）。\n\n他指出了实际不可译性的两个关键原因：沟通成本和精确度。用许多词语解释一个复杂的概念既耗时，又增加了引入意外细微差别的风险。此外，一种语言中词语的有限数量限制了精确度，类似于计算机中有限的小数位数，迫使我们“量化”我们的概念。这种量化导致在翻译过程中细微差别的损失，使得完美的等价往往是不可能的。这个类比解释了为什么在实践中，有些词语实际上是不可译的。"
  },
  {
    "id": "45916525",
    "title": "Launch HN: Tweeks (YC W25) – Browser extension to deshittify the web",
    "url": "https://www.tweeks.io/onboarding",
    "summary": "Tweeks is a Chrome browser extension designed to \"deshittify\" the web, giving users more control over their online experience. The extension allows users to customize websites using natural language prompts and pre-built scripts, enabling them to remove distractions, personalize feeds, and implement custom branding and theming.\n\nThe onboarding process involves installing the extension from the Chrome Web Store and then following a setup walkthrough. Tweeks provides an \"Inspiration Library\" with example tweaks that users can add with a single click once the extension is installed.\n\nKey features include:\n\n*   **Focus Mode:** Removes distracting elements like sidebars, trends, and recommendations on platforms like LinkedIn, X (Twitter), and YouTube.\n*   **Feed Personalization:** Allows users to filter and control their social media feeds by hiding ads and filtering posts by date and engagement.\n*   **Custom Branding & Theming:** Enables users to redesign websites with custom themes, like turning Google into a 1970s command-line interface.\n\nThe extension works on any website and offers a preview mode to visualize changes before implementation. The Launch HN post encourages users to install the extension to unlock live demos and complete the setup.\n",
    "chinese_title": "发布 HN: Tweeks (YC W25) – 浏览器扩展程序，让网页不再糟糕",
    "chinese_summary": "Tweeks：一款让你“净化”网络的Chrome浏览器扩展程序，赋予用户更多在线体验的控制权。该扩展程序允许用户使用自然语言提示和预置脚本自定义网站，从而移除干扰、个性化信息流并实现自定义品牌和主题。\n\n安装过程包括从Chrome网上应用店安装该扩展程序，然后按照设置引导进行操作。Tweeks提供一个“灵感库”，其中包含示例调整，用户安装扩展程序后只需单击一下即可添加。\n\n主要功能包括：\n\n*   **专注模式：** 移除 LinkedIn、X (Twitter) 和 YouTube 等平台上的侧边栏、热点和推荐等分散注意力的元素。\n*   **信息流个性化：** 允许用户过滤和控制他们的社交媒体信息流，通过隐藏广告并按日期和互动过滤帖子。\n*   **自定义品牌和主题：** 允许用户使用自定义主题重新设计网站，例如将 Google 变成 20 世纪 70 年代的命令行界面。\n\n该扩展程序适用于任何网站，并提供预览模式，以便在实施前可视化更改。“发布 HN”帖子鼓励用户安装该扩展程序以解锁实时演示并完成设置。"
  },
  {
    "id": "45866366",
    "title": "Operating Margins",
    "url": "https://fi-le.net/margin/",
    "summary": "This article, \"Operating Margins,\" explores the factors influencing company profitability by analyzing operating margins across various industries and countries. It defines operating margin as a company's income divided by revenue, representing the percentage of revenue left as cash.\n\nThe article highlights that high margins often correlate with larger companies, granting them pricing power. It categorizes companies based on margin drivers: \"Straight-Up Monopolies\" (e.g., toll roads, stock exchanges, ports) benefit from regulation and limited resources, achieving high average margins. \"Quasi-Monopolies\" (e.g., Nvidia, Mastercard) face high barriers to entry due to capital intensity. \"Weird Monopolies\" (e.g., cement, cruise lines) maintain margins through strategies like undercutting competitors or building strong industry relationships. Franchisors and companies selling branded goods (e.g., Pizza, LVMH, Beverages) show surprisingly strong margins. Companies with \"Good Unit Economics\" (e.g., Dietary Supplements, Tool Manufacturers, Banks) create high value relative to raw material costs.\n\nA cross-country comparison reveals significant variations in average operating margins, potentially influenced by resource availability, industry mix, accounting standards, and the prevalence of venture-backed startups (e.g., Israel's negative average). The author concludes that understanding operating margins is crucial for assessing the health and strategic positioning of businesses.\n",
    "chinese_title": "营业利润率",
    "chinese_summary": "运营利润率\n\n本文《运营利润率》通过分析不同行业和国家的运营利润率，探讨影响公司盈利能力的因素。文章将运营利润率定义为公司收入除以营收，代表剩余现金占营收的百分比。\n\n文章强调，高利润率通常与规模较大的公司相关，赋予它们定价权。文章根据利润率驱动因素将公司分为几类：“绝对垄断企业”（例如，收费公路、证券交易所、港口）受益于监管和有限的资源，从而实现较高的平均利润率。“准垄断企业”（例如，英伟达、万事达）由于资本密集度高而面临较高的进入壁垒。“怪异垄断企业”（例如，水泥、邮轮）通过削价竞争或建立强大的行业关系等策略来维持利润率。特许经营商和销售品牌商品的公司（例如，披萨、路威酩轩、饮料）表现出出人意料的强劲利润率。“良好单位经济效益”的公司（例如，膳食补充剂、工具制造商、银行）创造了相对于原材料成本而言的高价值。\n\n一项跨国比较揭示了平均运营利润率的显著差异，这可能受到资源可用性、行业组合、会计准则以及风险投资支持的初创企业（例如，以色列的负平均值）的普及程度的影响。作者总结认为，理解运营利润率对于评估企业的健康状况和战略定位至关重要。"
  },
  {
    "id": "45835337",
    "title": "Hiring the Joker",
    "url": "https://quarter--mile.com/hiring-the-joker",
    "summary": "Okay, based on the provided title and minimal content, it's impossible to provide a robust summary. However, I can infer some possibilities and offer a *speculative* summary based on the context:\n\n**Speculative Summary:**\n\nGiven the title \"Hiring the Joker,\" the article likely explores the *theoretical* implications and potential dangers of hiring someone with a chaotic, unpredictable, and potentially malevolent personality, represented by the Joker character. It could be a cautionary tale, a thought experiment, or a satirical piece.\n\nPossible themes explored could include:\n\n*   **Risk Assessment:** Analyzing the extreme risks associated with hiring someone who lacks ethical boundaries or has a history of instability.\n*   **Company Culture:** Considering the devastating impact a chaotic individual could have on team morale, productivity, and the overall work environment.\n*   **Legal and Ethical Implications:** Discussing the legal liabilities and ethical dilemmas that could arise from employing someone with questionable motives and potentially dangerous behavior.\n*   **Management Challenges:** Examining the difficulty, if not impossibility, of managing or controlling someone who actively seeks to disrupt order and create chaos.\n*   **Satire:** Using the extreme example of the Joker to highlight flaws in current hiring practices or workplace dynamics.\n\nThe links provided (Home, Subscribe, Contact, Writing Club, Questions) suggest it's part of a blog or website that focuses on writing, offering community and potentially prompts. The article likely aims to be thought-provoking and perhaps humorous in its exploration of a highly unusual hiring scenario.\n\n**Important Note:** This is a heavily inferred summary due to the lack of actual article content. The real article could be completely different.\n",
    "chinese_title": "雇佣小丑",
    "chinese_summary": "**推测性概要：**\n\n鉴于标题“雇佣小丑”，文章可能探讨雇佣一个性格混乱、难以预测、且可能怀有恶意的个体（以小丑角色为代表）的*理论*影响和潜在危险。 这可能是一个警示故事、一个思想实验或一篇讽刺文章。\n\n可能探讨的主题包括：\n\n*   **风险评估：** 分析与雇佣一个缺乏道德底线或有不稳定历史的人相关的极端风险。\n*   **公司文化：** 考虑一个混乱的个体可能对团队士气、生产力和整体工作环境造成的毁灭性影响。\n*   **法律和伦理影响：** 讨论因雇用一个动机可疑且可能存在危险行为的人而可能产生的法律责任和伦理困境。\n*   **管理挑战：** 考察管理或控制一个积极寻求扰乱秩序和制造混乱的人的难度，甚至是不可能性。\n*   **讽刺：** 使用小丑的极端例子来突出当前招聘实践或工作场所动态中的缺陷。\n\n提供的链接（首页、订阅、联系方式、写作俱乐部、问题）表明它是一个专注于写作的博客或网站的一部分，提供社区和可能的提示。 该文章可能旨在通过探索一个非常不寻常的招聘场景来引发思考，甚至带有一些幽默。\n\n**重要提示：** 由于缺乏实际文章内容，这是一个高度推断的概要。 真实的文章可能完全不同。"
  },
  {
    "id": "45821154",
    "title": "Incus-OS: Immutable Linux OS to run Incus as a hypervisor",
    "url": "https://linuxcontainers.org/incus-os/",
    "summary": "IncusOS is an immutable Linux operating system designed specifically for running Incus as a hypervisor. It prioritizes security and reliability through features like UEFI Secure Boot, TPM 2.0 measurements, and full disk encryption. Updates are atomic, employing an A/B partition scheme for easy reversion if issues arise. The OS is locked down, offering management solely through an authenticated REST API, making it ideal for infrastructure focused on Incus.\n\nKey features include automatic local ZFS pool, support for various storage technologies (Fiber Channel, NVME-over-TCP, iSCSI, Clustered LVM, Ceph), and advanced networking capabilities like VLAN-aware bridging, link aggregation, LLDP, enterprise proxy support, robust NTP, remote logging, OVS/OVN support, and Tailscale integration.\n\nIncusOS, built on Debian 13 with custom Incus and kernel builds, can also host Operations Center and Migration Manager. It leverages systemd for image building, updates, and disk encryption. Two update channels are offered: \"stable\" (weekly updates) and \"testing\" (daily updates). Automatic updates occur every 6 hours, staging OS updates for the next reboot and performing short API downtime to apply application updates. The project is developed on Github under the Apache 2.0 license, consisting of mkosi configuration files and Go code for OS management.\n",
    "chinese_title": "Incus-OS：运行Incus作为虚拟机监控程序的不可变Linux操作系统",
    "chinese_summary": "IncusOS是一款不可变的Linux操作系统，专为运行Incus作为虚拟机管理程序而设计。它通过UEFI安全启动、TPM 2.0测量和全盘加密等功能，优先考虑安全性和可靠性。更新是原子性的，采用A/B分区方案，以便在出现问题时轻松回滚。该操作系统已锁定，仅通过经过身份验证的REST API进行管理，使其成为专注于Incus的基础设施的理想选择。\n\n主要特性包括自动本地ZFS池、对各种存储技术的支持（光纤通道、NVME-over-TCP、iSCSI、集群LVM、Ceph）以及高级网络功能，如VLAN感知桥接、链路聚合、LLDP、企业代理支持、强大的NTP、远程日志记录、OVS/OVN支持和Tailscale集成。\n\nIncusOS基于Debian 13构建，具有定制的Incus和内核版本，还可以托管运营中心和迁移管理器。它利用systemd进行镜像构建、更新和磁盘加密。提供两个更新通道：“stable”（每周更新）和“testing”（每日更新）。自动更新每6小时进行一次，为下次重启暂存操作系统更新，并执行短暂的API停机时间以应用应用程序更新。该项目在Github上以Apache 2.0许可开发，由mkosi配置文件和用于操作系统管理的Go代码组成。"
  },
  {
    "id": "45929358",
    "title": "Bitchat for Gaza – messaging without internet",
    "url": "https://updates.techforpalestine.org/bitchat-for-gaza-messaging-without-internet/",
    "summary": "Bitchat is a new messaging app designed to provide secure communication, particularly for Palestinians in Gaza, even without internet access. Developed as an \"Israel-proof\" alternative, Bitchat allows users to connect directly via Bluetooth, creating a mesh network where each phone relays messages, extending communication range. The app features full encryption, ensuring privacy, and doesn't require accounts, phone numbers, SIM cards, or email addresses. It also supports relaying messages globally when internet is available.\n\nA key feature is Geohash channels, enabling location-based chats for neighborhood and community communication, essential for checking on safety and coordinating efforts. The app has been validated by T4P (Tech for Palestine) as a secure and resilient tool after extensive testing. Bitchat's popularity has surged in regions facing internet shutdowns due to civil unrest.\n\nThe article highlights the vulnerability of Palestinians who are reliant on Israeli infrastructure for telecommunications, emphasizing how deliberate blackouts and surveillance can disrupt communication and expose users to targeting. Bitchat addresses these issues by offering decentralized, encrypted communication independent of centralized servers and eliminating reliance on traditional networks susceptible to censorship or shutdown. It also does not allow for private data to be exposed to parties like Meta, and subsequently Israel, like WhatsApp does. The article encourages users to download Bitchat from app stores, customize their username, and regularly clear messages for added security. It also mentions Gaza Online and their renewable eSIMs that can be paired with Bitchat to maximize communication capabilities during network disruptions.\n",
    "chinese_title": "加沙碧聊——无需网络的通讯",
    "chinese_summary": "Bitchat：一款专为加沙巴勒斯坦人设计的无网安全通讯应用"
  },
  {
    "id": "45926469",
    "title": "AGI fantasy is a blocker to actual engineering",
    "url": "https://www.tomwphillips.co.uk/2025/11/agi-fantasy-is-a-blocker-to-actual-engineering/",
    "summary": "This article argues that the prevalent belief in Artificial General Intelligence (AGI) within Silicon Valley, particularly among figures associated with OpenAI, is detrimental to responsible and effective engineering practices in AI development. The author contends that the \"AGI fantasy\" drives environmentally damaging and exploitative practices in the pursuit of ever-larger language models.\n\nThe article highlights the mindset of key individuals like Elon Musk and Ilya Sutskever, who see AGI as either a savior or a threat to humanity. This belief, combined with the perceived success of scaling language models like GPT-2, justifies the enormous resources poured into building massive data centers powered by polluting energy sources. The author criticizes the reliance on the \"pure language\" hypothesis, which posits that AGI can emerge solely from language training, leading to unchecked data consumption and exploitative labor practices to manage model outputs.\n\nFurthermore, the article challenges the expected value (EV) arguments used to justify AGI development, claiming the values and probabilities used are subjective and ignore the immediate negative externalities, such as environmental damage and worker exploitation. The author advocates for a more pragmatic approach, urging technologists to drop the AGI fantasy and instead focus on developing AI solutions tailored for specific problems, using smaller, more efficient models, and carefully considering cost-benefit analyses. The core argument is that chasing the AGI dream blinds researchers to the real-world costs and prevents them from engaging in responsible and effective engineering practices.\n",
    "chinese_title": "AGI幻想阻碍实际工程",
    "chinese_summary": "本文认为，硅谷，特别是与 OpenAI 相关的人物中普遍存在的对通用人工智能（AGI）的信仰，不利于人工智能开发中负责任和有效的工程实践。作者认为，“AGI 幻想”驱动了对日益庞大的语言模型的追求，导致了破坏环境和剥削性的实践。\n\n文章重点介绍了埃隆·马斯克和伊利亚·苏茨克维等关键人物的心态，他们将 AGI 视为人类的救星或威胁。这种信念，加上对 GPT-2 等语言模型扩展成功的认识，为投入巨额资源建设由污染性能源驱动的大型数据中心提供了理由。作者批评了对“纯语言”假设的依赖，该假设认为 AGI 可以仅从语言训练中产生，从而导致不受控制的数据消耗和剥削性的劳动实践来管理模型输出。\n\n此外，文章质疑了用于证明 AGI 开发合理的预期价值（EV）论证，声称所使用的价值和概率是主观的，并且忽略了直接的负外部性，例如环境破坏和工人剥削。作者倡导一种更务实的方法，敦促技术人员放弃 AGI 幻想，转而专注于开发针对特定问题的 AI 解决方案，使用更小、更高效的模型，并仔细考虑成本效益分析。核心论点是，追逐 AGI 梦想会蒙蔽研究人员对现实世界成本的认识，并阻止他们从事负责任和有效的工程实践。"
  },
  {
    "id": "45934209",
    "title": "Zig GUI from Scratch",
    "url": "https://www.vogt.world/zig-gui-from-scratch-part-1/",
    "summary": "In the first part of a planned series, the author details their journey to build a cross-platform desktop GUI application from scratch using Zig. Driven by a desire for challenge, learning, and creative coding, the project prioritizes understanding the underlying systems over quick solutions using existing frameworks.\n\nThe tech stack includes Zig for its novelty and comptime capabilities, WebAssembly for web targets with native compilation for other platforms, OpenGL/WebGL for rendering, and SDL2 for window management across Linux, macOS, and Windows. The application architecture uses comptime imports of platform-specific modules (app, platform, glade, js) to handle differences between web and native environments, especially the limitations of WebAssembly.\n\nA key aspect is creating a consistent API across platforms using \"duck-typed modules\" to ensure code reusability. The author uses `zig-js`, a library, to facilitate communication between Zig and JavaScript, particularly for passing complex types like vertex arrays for WebGL rendering. The article then covers a simple \"hello canvas color\" example, highlighting the initial steps of creating a window and clearing the color buffer in both native (macOS) and web environments.\n\nFuture improvements include better management of WebGL context methods, code generation of OpenGL bindings, and streamlining the development workflow between web and native builds.\n",
    "chinese_title": "从零开始的 Zig GUI",
    "chinese_summary": "作者在一系列计划文章的第一部分中，详细介绍了他们使用 Zig 从头开始构建跨平台桌面 GUI 应用程序的旅程。出于对挑战、学习和创造性编码的渴望，该项目优先考虑理解底层系统，而非使用现有框架的快速解决方案。\n\n技术栈包括 Zig，因其新颖性和编译时计算能力；WebAssembly，用于 Web 目标，并为其他平台进行原生编译；OpenGL/WebGL，用于渲染；以及 SDL2，用于跨 Linux、macOS 和 Windows 的窗口管理。应用程序架构使用平台特定模块（app、platform、glade、js）的编译时导入来处理 Web 和原生环境之间的差异，特别是 WebAssembly 的限制。\n\n一个关键方面是使用“鸭子类型模块”创建跨平台的一致 API，以确保代码可重用性。作者使用 `zig-js` 库来促进 Zig 和 JavaScript 之间的通信，特别是用于传递复杂类型，例如用于 WebGL 渲染的顶点数组。文章接着介绍了一个简单的“hello canvas color”示例，重点介绍了在原生 (macOS) 和 Web 环境中创建窗口和清除颜色缓冲区的初始步骤。\n\n未来的改进包括更好地管理 WebGL 上下文方法、代码生成 OpenGL 绑定，以及简化 Web 和原生构建之间的开发工作流程。"
  },
  {
    "id": "45911396",
    "title": "The Pen and the Spade: The Poems of Seamus Heaney",
    "url": "https://literaryreview.co.uk/the-pen-the-spade-2",
    "summary": "Given the title \"The Pen and the Spade: The Poems of Seamus Heaney\" and the content \"Ballads of the Blitz,\" the article likely explores Seamus Heaney's poetry, focusing on poems that relate to or evoke the Blitz, the period of intense aerial bombing of Britain during World War II.\n\nThe article's central theme likely analyzes how Heaney uses his poetic voice (the \"pen\") to explore and interpret the experiences and impact of the Blitz. It may examine specific poems that touch on themes of destruction, resilience, loss, fear, and the human spirit in the face of adversity. The \"spade\" in the title suggests an investigation into the deeper layers of history and personal experience that Heaney unearths through his poetry.\n\nThe article may also discuss Heaney's stylistic choices in depicting the Blitz, such as his use of imagery, metaphor, and rhythm to convey the atmosphere of war. It could potentially explore the historical context of the Blitz and how Heaney's poems contribute to our understanding of this period, perhaps highlighting personal or familial connections to the event that might inform his work. Ultimately, the article seeks to illuminate how Heaney, through his powerful and evocative language, transforms the historical event of the Blitz into compelling poetry.\n",
    "chinese_title": "笔与锹：谢默斯·希尼诗选",
    "chinese_summary": "钢笔与铁锹：谢默斯·希尼诗选——文章可能探讨谢默斯·希尼的诗歌，重点关注与二战期间英国遭受猛烈空袭的“闪电战”相关或引发“闪电战”联想的诗歌，如《闪电战歌谣》。\n\n文章的中心主题可能分析希尼如何运用其诗歌声音（“钢笔”）来探索和诠释闪电战的经历和影响。它可能考察触及破坏、韧性、损失、恐惧以及面对逆境的人类精神等主题的具体诗歌。“铁锹”在标题中暗示着对希尼通过其诗歌挖掘的更深层历史和个人经历的调查。\n\n文章也可能讨论希尼在描绘闪电战时的风格选择，例如他如何运用意象、隐喻和节奏来传达战争的气氛。它可能会探讨闪电战的历史背景，以及希尼的诗歌如何帮助我们理解这一时期，或许会突出与该事件相关的个人或家庭联系，这些联系可能会影响他的作品。最终，文章旨在阐明希尼如何通过其强大而富有表现力的语言，将闪电战这一历史事件转化为引人入胜的诗歌。"
  },
  {
    "id": "45928873",
    "title": "Moving Back to a Tiling WM – XMonad",
    "url": "https://wssite.vercel.app/blog/moving-back-to-a-tiling-wm-xmonad",
    "summary": "This article details the author's return to using a tiling window manager, specifically XMonad, after a period with Gnome. The author emphasizes the advantages of XMonad, particularly its configurability in Haskell, which allows for a strongly typed and modular setup. The article outlines the author's XMonad configuration, organized into modules for keybindings, layouts, preferences, themes, and xmobar, making it easily portable.\n\nKey elements of the configuration include per-workspace layouts, which restrict the available layouts for each workspace, and a custom topbar that displays window titles. The author highlights the type safety in XMonad's keybindings, ensuring fewer errors. The use of submaps for keybindings allows for creating chords with descriptions, enhancing discoverability. The xmobar configuration is also written in Haskell and included in the project, facilitating a complete desktop environment. Visual icons are used to represent the current layout.\n\nThe article covers setting up XMonad using Stack, a Haskell package manager, providing an installation script and explaining the build process. Finally, the author describes the implementation of scratchpads for commonly used applications like terminal, Kanboard, CalibreWeb, and Anki, enabling quick access and resumption of tasks. The author also provides a link to a discussion page for further questions.\n",
    "chinese_title": "回到平铺窗口管理器 – XMonad",
    "chinese_summary": "本文详细介绍了作者在使用 Gnome 一段时间后，回归使用平铺窗口管理器 XMonad 的经历。作者强调了 XMonad 的优势，特别是其在 Haskell 中的可配置性，从而实现了强类型和模块化的设置。文章概述了作者的 XMonad 配置，该配置组织成用于键绑定、布局、偏好设置、主题和 xmobar 的模块，使其易于移植。\n\n配置的关键要素包括每个工作区的布局，它限制了每个工作区可用的布局，以及显示窗口标题的自定义顶栏。作者强调了 XMonad 键绑定中的类型安全，确保更少的错误。使用子映射进行键绑定可以创建带有描述的和弦，从而增强可发现性。xmobar 配置也用 Haskell 编写并包含在项目中，从而促进了完整的桌面环境。使用视觉图标来表示当前布局。\n\n文章涵盖了使用 Haskell 包管理器 Stack 设置 XMonad 的过程，提供了安装脚本并解释了构建过程。最后，作者描述了用于常用应用程序（如终端、Kanboard、CalibreWeb 和 Anki）的暂存区的实现，从而可以快速访问和恢复任务。作者还提供了讨论页面的链接，以便进一步提问。"
  },
  {
    "id": "45926037",
    "title": "Magit manuals are available online again",
    "url": "https://github.com/magit/magit/issues/5472",
    "summary": "The article reports that the online Magit manuals, specifically located at magit.vc and emacsair.me, were temporarily unavailable. A user, \"ador,\" raised the issue (#5472) on November 4, 2025, noting their inability to access the Magit website to view tutorials, despite Magit functioning within their Emacs environment. The issue was later closed, implying that the problem has been resolved and the websites are now accessible. The article also mentions Magit's GitHub repository, highlighting its popularity with 6.9k stars and 842 forks.\n",
    "chinese_title": "Magit 手册再次上线",
    "chinese_summary": "在线Magit手册（位于magit.vc和emacsair.me）暂时无法访问。用户“ador”于2025年11月4日提出了该问题（#5472），表示尽管Magit在其Emacs环境中运行正常，但无法访问Magit网站查看教程。该问题随后被关闭，意味着问题已解决，网站现在可以访问。文章还提到了Magit的GitHub仓库，强调其受欢迎程度，拥有6.9k个星标和842个Fork。"
  },
  {
    "id": "45885677",
    "title": "Xqerl – Erlang XQuery 3.1 Processor",
    "url": "https://zadean.github.io/xqerl/",
    "summary": "Xqerl is an actively developed Erlang XQuery 3.1 processor and XML database designed for embedding into Erlang/Elixir applications or use as a standalone. It compiles XQuery code to BEAM and leverages REST for external communication via user-defined endpoints. While not yet stable, it passes a high percentage of XQuery and XPath test cases.\n\nKey features include serialization, higher-order functions, and XQuery Update Facility 3.0. Notable omissions are schema awareness, typed data features, and full-text extension. Xqerl prioritizes specification compliance and turning XQuery code into scalable Erlang applications through ahead-of-time compilation.\n\nTo use Xqerl, compile XQuery modules with `xqerl:compile(FileName)` and execute them using `xqerl:run(ModuleAtom, ContextMap)`. Data is loaded and deleted using `xqldb_dml:insert_doc` and `xqldb_dml:delete_doc` respectively.\n\nBuilding is done with `rebar3`. The project welcomes contributions in the form of code, documentation, tutorials, and issue reporting. Contact the project on Twitter (@xqerl) or the xqerl.slack.com workspace. Future developments include a query-rewrite phase, a cost-based implementation, moving atomic operations to Rust NIFs, and the addition of indexes.\n",
    "chinese_title": "Xqerl – Erlang XQuery 3.1 处理器",
    "chinese_summary": "Xqerl是一个积极开发的Erlang XQuery 3.1处理器和XML数据库，旨在嵌入到Erlang/Elixir应用程序中或作为独立应用使用。它将XQuery代码编译为BEAM字节码，并利用REST通过用户定义的端点进行外部通信。虽然尚未稳定，但它通过了很高比例的XQuery和XPath测试用例。\n\n主要功能包括序列化、高阶函数和XQuery Update Facility 3.0。值得注意的缺失包括模式识别、类型化数据功能和全文扩展。Xqerl优先考虑规范的符合性，并通过提前编译将XQuery代码转化为可扩展的Erlang应用程序。\n\n要使用Xqerl，请使用`xqerl:compile(FileName)`编译XQuery模块，并使用`xqerl:run(ModuleAtom, ContextMap)`执行它们。数据分别使用`xqldb_dml:insert_doc`和`xqldb_dml:delete_doc`进行加载和删除。\n\n构建使用`rebar3`完成。该项目欢迎以代码、文档、教程和问题报告的形式提供的贡献。请通过Twitter (@xqerl)或xqerl.slack.com工作区联系该项目。未来的开发包括查询重写阶段、基于成本的实现、将原子操作转移到Rust NIF以及添加索引。"
  },
  {
    "id": "45903404",
    "title": "Steam Machine",
    "url": "https://store.steampowered.com/sale/steammachine",
    "summary": "This page appears to be the landing page, or a section within the Steam platform related to \"Steam Machine.\" The content highlights several key aspects of Steam:\n\n*   **Core Functionality:** It provides access to the Steam store, exploration queue, wishlists, the points shop, news, and statistics.\n\n*   **Community Features:** Links to community forums, the workshop (presumably for user-generated content), the Steam market, and live streams are prominent.\n\n*   **Support and Information:** There are links to \"About\" and \"Customer Support\" sections, suggesting Valve provides information and assistance related to their services, including Steam Machine (if that's still a relevant product).\n\n*   **Account Management:** Options for installing Steam and logging in are available.\n\n*   **Language Selection:** A comprehensive list of languages is provided, allowing users to browse the platform in their preferred language. It also includes a link to report translation issues, showing that Steam actively maintains and improves its localization.\n\nIn essence, it's a typical Steam page providing navigation to various parts of the platform, from purchasing games and engaging with the community, to accessing support and managing account settings, with a specific title indicating a possible focus on the Steam Machine (though the absence of further details on the device suggests the page is a general navigation hub).\n",
    "chinese_title": "Steam Machine\n蒸汽机",
    "chinese_summary": "此页面似乎是Steam平台关于“Steam Machine”的着陆页或一个版块。内容突出了Steam的几个关键方面：\n\n*   **核心功能：** 提供Steam商店、探索队列、愿望单、点数商店、新闻和统计数据的访问入口。\n\n*   **社区功能：** 显著展示了社区论坛、创意工坊（可能是用户生成内容）、Steam市场和直播的链接。\n\n*   **支持和信息：** 提供“关于”和“客服支持”版块的链接，表明Valve提供与其服务相关的信息和帮助，包括Steam Machine（如果它仍然是一个相关的产品）。\n\n*   **账号管理：** 提供安装Steam和登录的选项。\n\n*   **语言选择：** 提供全面的语言列表，允许用户以其首选语言浏览平台。 它还包括报告翻译问题的链接，表明Steam积极维护和改进其本地化。\n\n总而言之，这是一个典型的Steam页面，提供访问平台各个部分的导航，从购买游戏和参与社区，到访问支持和管理账户设置，特定的标题表明可能专注于Steam Machine（尽管缺少关于该设备的更多细节表明该页面是一个通用的导航中心）。"
  },
  {
    "id": "45935491",
    "title": "Google must pay German price comparison platform 465M euros in damages",
    "url": "https://www.reuters.com/legal/litigation/google-must-pay-german-price-comparison-platform-465-mln-euros-damages-court-2025-11-14/",
    "summary": "Google has been ordered by a German court to pay €465 million ($508.5 million USD) in damages to price comparison website PriceRunner. The lawsuit stemmed from claims that Google abused its market dominance by unfairly favoring its own shopping services in search results, thereby disadvantaging PriceRunner and other competitors.\n\nThe court agreed with PriceRunner, finding that Google's practice violated antitrust laws. PriceRunner argued that Google’s actions led to a significant loss of traffic and revenue for its platform. This case echoes a similar 2017 European Commission ruling against Google for similar anti-competitive behavior, which resulted in a €2.4 billion fine.\n\nWhile Google has stated its intention to appeal the German court's decision, this ruling adds to the growing pressure on the tech giant regarding its handling of competition within its search engine. PriceRunner's CEO has indicated that they intend to pursue further compensation for ongoing damages caused by Google's practices. The case highlights the ongoing scrutiny and legal challenges faced by major tech companies regarding potential antitrust violations and the impact of their market power on smaller competitors.\n",
    "chinese_title": "谷歌必须向德国比价平台支付4.65亿欧元赔偿金",
    "chinese_summary": "德国法院判决谷歌向比价网站PriceRunner赔偿4.65亿欧元（合5.085亿美元）。该诉讼源于谷歌涉嫌滥用市场支配地位，在搜索结果中不公平地偏袒自身购物服务，从而损害PriceRunner和其他竞争对手的利益。\n\n法院赞同PriceRunner的观点，认定谷歌的做法违反了反垄断法。PriceRunner认为谷歌的行为导致其平台流量和收入大幅损失。此案与2017年欧盟委员会因类似的反竞争行为对谷歌处以24亿欧元罚款的裁决相似。\n\n虽然谷歌表示打算对德国法院的判决提出上诉，但这项裁决进一步增加了这家科技巨头在处理搜索引擎内部竞争方面所面临的压力。PriceRunner的首席执行官表示，他们计划就谷歌的持续行为造成的损失寻求进一步赔偿。该案件凸显了大型科技公司在潜在的反垄断违规行为以及其市场力量对小型竞争对手的影响方面所面临的持续审查和法律挑战。"
  },
  {
    "id": "45934940",
    "title": "I can't recommend Grafana anymore",
    "url": "https://henrikgerdes.me/blog/2025-11-grafana-mess/",
    "summary": "This article details the author's evolving experience with Grafana products, starting with early success and ending with frustration and a reluctance to recommend them. Initially, Grafana, Loki, and Prometheus were a good fit for a small company's containerized environment, especially compared to the resource-heavy Elastic stack.\n\nAs the author moved to a Kubernetes environment, the need for long-term storage led to adopting Mimir and the Grafana Agent for remote writing. However, Grafana's rapid changes became a recurring theme, including transitions to Grafana Agent Flow, the introduction and deprecation of Grafana OnCall, numerous Helm chart updates, and the Angular to React migration that broke dashboards.\n\nThe introduction of Grafana Alloy, the \"all-in-one\" solution, was initially promising but lacked full feature parity with established standards like the kube-prometheus community's Prometheus Operator and its CRDs. Further complicating matters, Mimir 3.0 introduced Apache Kafka as a dependency.\n\nThe author's core complaint is that Grafana's relentless pace of change and frequent deprecations create instability and maintenance burdens. They feel this drive for innovation is driven by career goals within Grafana, and doesn't align with the need for a stable, \"boring\" monitoring solution that most companies require. While acknowledging the technical merits of Grafana products, the author concludes they can no longer confidently recommend them due to the constant flux and the increasing complexity. They now long for OTEL to become stable and provide a more flexible backend solution to avoid frequent monitoring setup overhauls.\n",
    "chinese_title": "我不再推荐 Grafana 了",
    "chinese_summary": "本文详细描述了作者使用 Grafana 产品不断演变的经历，从早期的成功开始，到最终的沮丧和不愿推荐。最初，Grafana、Loki 和 Prometheus 非常适合一家小型公司的容器化环境，尤其是与资源密集型的 Elastic Stack 相比。\n\n随着作者转向 Kubernetes 环境，对长期存储的需求促使其采用了 Mimir 和 Grafana Agent 进行远程写入。然而，Grafana 的快速变化成为一个反复出现的主题，包括过渡到 Grafana Agent Flow、Grafana OnCall 的引入和弃用、大量的 Helm chart 更新，以及导致仪表盘失效的 Angular 到 React 的迁移。\n\n“一体化”解决方案 Grafana Alloy 的推出，最初令人充满希望，但与 kube-prometheus 社区的 Prometheus Operator 及其 CRD 等既定标准相比，它缺乏完整的功能对等性。更复杂的是，Mimir 3.0 引入了 Apache Kafka 作为依赖项。\n\n作者的核心抱怨是，Grafana 不断加快的变革步伐和频繁的弃用带来了不稳定性和维护负担。他们认为，这种对创新的驱动是由 Grafana 内部的职业目标驱动的，与大多数公司所需的稳定、“无聊”的监控解决方案的需求不符。虽然承认 Grafana 产品在技术上的优点，但作者最终表示，由于不断的变动和日益增加的复杂性，他们无法再自信地推荐它们。他们现在渴望 OTEL 变得稳定，并提供更灵活的后端解决方案，以避免频繁的监控设置大修。"
  },
  {
    "id": "45937302",
    "title": "My six stages of learning to be a socially normal person",
    "url": "https://sashachapin.substack.com/p/my-six-stages-of-learning-to-be-a",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "我学习成为一个社交正常人的六个阶段",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "45926263",
    "title": "EDE: Small and Fast Desktop Environment (2014)",
    "url": "https://edeproject.org/",
    "summary": "EDE (Equinox Desktop Environment) is presented as a small and fast desktop environment designed to be responsive and light on system resources. It aims to provide users with a familiar look and feel. The environment is compatible with a variety of operating systems including Linux, BSD variants, Solaris, Minix, Zaurus, and even the XBox. The article directs users to download version 2.1 of EDE, or browse older releases. It highlights recent updates including resolved Bugzilla issues and a blog post titled \"Autumn cleanup\". Finally, the article offers navigation links to various sections of the EDE website, including Home, News Archive, About, Gallery, Wiki, and a link to report bugs.\n",
    "chinese_title": "EDE：小型快速桌面环境 (2014)",
    "chinese_summary": "EDE（Equinox桌面环境）是一个小型快速的桌面环境，旨在提供快速响应和轻量级的系统资源占用。它致力于为用户提供熟悉的外观和感觉。该环境兼容多种操作系统，包括Linux、BSD变种、Solaris、Minix、Zaurus，甚至XBox。文章引导用户下载EDE 2.1版本，或浏览旧版本。文章重点介绍了近期更新，包括已解决的Bugzilla问题和一篇名为“秋季清理”的博客文章。最后，文章提供了EDE网站各版块的导航链接，包括主页、新闻存档、关于、图库、Wiki以及一个报告错误的链接。"
  },
  {
    "id": "45925971",
    "title": "Mullvad VPN present And Then? (Chat Control is back on the menu)",
    "url": "https://mullvad.net/en/blog/mullvad-vpn-present-and-then",
    "summary": "Mullvad VPN is highlighting the renewed push for \"Chat Control\" in the EU, warning of its potential for mass surveillance, AI scanning of private data, and mandatory ID requirements for messaging. They've released a video series called \"And Then?\" to illustrate the consequences of unchecked surveillance and remind people of the proposal's corrupt origins.\n\nThe article details the history of Chat Control, starting with Ashton Kutcher's organization, Thorn, advocating for scanning devices for child sexual abuse material (CSAM). EU Commissioner Ylva Johansson then presented a proposal that was widely criticized for violating EU law and human rights. Concerns were raised by the Council of Minister's legal service, the European Parliament's Data Protection Board, the UN Human Rights Council, and numerous experts, who warned of mass surveillance and self-censorship.\n\nThe article reveals connections between Thorn, the EU Commission, and \"children's rights organizations\" that lobbied for Chat Control. It also accuses Europol of wanting unlimited access to data, even unfiltered and innocent material. Despite the European Parliament voting against the proposal, the Council of the EU is still considering it. The EU Commission has also launched \"Going Dark\" and \"ProtectEU\" initiatives, aiming for access to private conversations under the guise of fighting organized crime.\n\nMullvad VPN urges people to demand transparency from politicians and protect privacy, warning that the EU risks total mass surveillance, security threats, and zero privacy if Chat Control or similar proposals are enacted. The article emphasizes that non-European intelligence services are involved in the process, using arguments originally employed by Ashton Kutcher and Ylva Johansson. Ultimately, the future of privacy in the EU depends on public action.\n",
    "chinese_title": "Mullvad VPN 出现，然后呢？（聊天监控卷土重来）",
    "chinese_summary": "Mullvad VPN 强调欧盟再度推动“聊天控制”，警告其可能导致大规模监控、AI扫描私人数据以及强制性消息认证。他们发布了一个名为“然后呢？”的视频系列，以阐述不受约束的监控带来的后果，并提醒人们该提案腐败的根源。\n\n文章详细介绍了“聊天控制”的历史，从阿什顿·库彻的组织Thorn倡导扫描设备以查找儿童性虐待材料（CSAM）开始。欧盟专员伊娃·约翰逊随后提出了一项因违反欧盟法律和人权而受到广泛批评的提案。部长理事会法律服务部门、欧洲议会数据保护委员会、联合国人权理事会以及众多专家都提出了担忧，他们警告说这会导致大规模监控和自我审查。\n\n文章揭示了Thorn、欧盟委员会和游说“聊天控制”的“儿童权利组织”之间的联系。文章还指责欧洲刑警组织想要无限访问数据，甚至包括未经筛选和无辜的材料。尽管欧洲议会投票反对该提案，但欧盟理事会仍在考虑该提案。欧盟委员会还启动了“走向黑暗”和“保护欧盟”倡议，旨在以打击有组织犯罪为幌子获取私人对话。\n\nMullvad VPN 敦促人们要求政治家提高透明度并保护隐私，警告说，如果“聊天控制”或类似提案获得通过，欧盟将面临全面大规模监控、安全威胁和零隐私的风险。文章强调，非欧洲情报机构也参与其中，并使用了最初由阿什顿·库彻和伊娃·约翰逊提出的论点。最终，欧盟隐私的未来取决于公众行动。"
  },
  {
    "id": "45924619",
    "title": "RegreSQL: Regression Testing for PostgreSQL Queries",
    "url": "https://boringsql.com/posts/regresql-testing-queries/",
    "summary": "RegreSQL is a tool designed to bring PostgreSQL's robust regression testing methodology to application queries, aiming to catch both correctness bugs and performance regressions before they hit production. It addresses the common issue of SQL query testing being overlooked, with developers often relying on ORMs or integration tests that don't directly test SQL behavior and performance under schema changes or index modifications.\n\nRegreSQL treats SQL queries as strings and uses regression testing: writing queries, providing input data, and verifying that future changes don't break expectations. Beyond basic correctness, it tracks performance baselines, detects query plan regressions like sequential scans, and enables experimentation with schema and query changes.\n\nKey features include:\n\n*   **Basic Regression Testing:** Validates query results against expected data.\n*   **Performance Regression Testing:** Tracks query execution time and flags common bad patterns (e.g., sequential scans, nested loops).\n*   **ORM Integration:** Catches performance issues in ORM-generated SQL using SQLAlchemy's event system.\n*   **Test Data Management:** Provides a declarative YAML-based fixture system for creating consistent, reproducible test data, including features for realistic data generation at scale.\n\nBy using RegreSQL, developers can systematically test their SQL queries, improving code quality and preventing performance problems from reaching production environments.\n",
    "chinese_title": "RegreSQL: Regression Testing for PostgreSQL Queries",
    "chinese_summary": "RegreSQL is a tool designed to bring PostgreSQL's robust regression testing methodology to application queries, aiming to catch both correctness bugs and performance regressions before they hit production. It addresses the common issue of SQL query testing being overlooked, with developers often relying on ORMs or integration tests that don't directly test SQL behavior and performance under schema changes or index modifications.\n\nRegreSQL treats SQL queries as strings and uses regression testing: writing queries, providing input data, and verifying that future changes don't break expectations. Beyond basic correctness, it tracks performance baselines, detects query plan regressions like sequential scans, and enables experimentation with schema and query changes.\n\nKey features include:\n\n*   **Basic Regression Testing:** Validates query results against expected data.\n*   **Performance Regression Testing:** Tracks query execution time and flags common bad patterns (e.g., sequential scans, nested loops).\n*   **ORM Integration:** Catches performance issues in ORM-generated SQL using SQLAlchemy's event system.\n*   **Test Data Management:** Provides a declarative YAML-based fixture system for creating consistent, reproducible test data, including features for realistic data generation at scale.\n\nBy using RegreSQL, developers can systematically test their SQL queries, improving code quality and preventing performance problems from reaching production environments.\n"
  },
  {
    "id": "45872066",
    "title": "Scientists Produce Powerhouse Pigment Behind Octopus Camouflage",
    "url": "https://today.ucsd.edu/story/scientists-produce-powerhouse-pigment-behind-octopus-camouflage",
    "summary": "生成摘要时出错",
    "chinese_title": "Scientists Produce Powerhouse Pigment Behind Octopus Camouflage",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45917875",
    "title": "Nano Banana can be prompt engineered for nuanced AI image generation",
    "url": "https://minimaxir.com/2025/11/nano-banana-prompts/",
    "summary": "生成摘要时出错",
    "chinese_title": "Nano Banana can be prompt engineered for nuanced AI image generation",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45908938",
    "title": "Android developer verification: Early access starts",
    "url": "https://android-developers.googleblog.com/2025/11/android-developer-verification-early.html",
    "summary": "生成摘要时出错",
    "chinese_title": "Android developer verification: Early access starts",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45925950",
    "title": "GNOME 50 completes the migration to Wayland, dropping X11 backend code",
    "url": "https://linuxiac.com/gnome-50-ends-the-x11-era-after-decades/",
    "summary": "生成摘要时出错",
    "chinese_title": "GNOME 50 completes the migration to Wayland, dropping X11 backend code",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45934978",
    "title": "Statistical Process Control According to W. Edwards Deming",
    "url": "https://www.thomas-huehn.com/deming/",
    "summary": "生成摘要时出错",
    "chinese_title": "Statistical Process Control According to W. Edwards Deming",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45929052",
    "title": "Germany to ban Huawei from future 6G network",
    "url": "https://www.bloomberg.com/news/articles/2025-11-13/germany-to-ban-huawei-from-future-6g-network-in-sovereignty-push",
    "summary": "生成摘要时出错",
    "chinese_title": "Germany to ban Huawei from future 6G network",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45931552",
    "title": "Anthropic Rides an Artificial Wave",
    "url": "https://berryvilleiml.com/2025/11/14/houston-we-have-a-problem-anthropic-rides-an-artificial-wave/",
    "summary": "生成摘要时出错",
    "chinese_title": "Anthropic Rides an Artificial Wave",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45934912",
    "title": "Reservoir: Smart electric water heater",
    "url": "https://www.reservoirhome.com/",
    "summary": "生成摘要时出错",
    "chinese_title": "Reservoir: Smart electric water heater",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45935329",
    "title": "Lua 5.5.0 (rc1) has been released for testing",
    "url": "https://www.lua.org/work/doc/readme.html#changes",
    "summary": "Lua 5.5.0 Release Candidate 1 is available for testing. Lua is a lightweight, embeddable scripting language developed at PUC-Rio, freely available under the MIT license.\n\nThe document covers installation, changes, licensing, and provides a reference manual. Lua is distributed in source form and needs to be built. Instructions are given for Unix-like systems using \"make.\" The Makefile controls the build and install process, with customization options for platform, build, and features available. Lua can also be built on other systems, requiring manual project setup for the library, interpreter, and compiler.\n\nKey changes in Lua 5.5 since Lua 5.4 include: declarations for global variables, read-only for-loop variables, decimal printing of floats, more levels for constructors, `table.create`, expanded `utf8.offset` return, external strings, new library functions, incremental major collections, compact arrays (60% less memory), dynamic loading of 'readline', static binaries (reuse of original memory), dump/undump reuses all strings, and auxiliary buffer reuses buffer.\n\nInstallation creates 'bin', 'include', 'lib', 'man', and 'share' directories. Customization is possible by editing Makefiles or `src/luaconf.h`. The license allows for commercial use without cost, requiring only copyright attribution.\n",
    "chinese_title": "Lua 5.5.0 (rc1) 已发布供测试",
    "chinese_summary": "Lua 5.5.0 Release Candidate 1 is available for testing. Lua is a lightweight, embeddable scripting language developed at PUC-Rio, freely available under the MIT license.\n\nThe document covers installation, changes, licensing, and provides a reference manual. Lua is distributed in source form and needs to be built. Instructions are given for Unix-like systems using \"make.\" The Makefile controls the build and install process, with customization options for platform, build, and features available. Lua can also be built on other systems, requiring manual project setup for the library, interpreter, and compiler.\n\nKey changes in Lua 5.5 since Lua 5.4 include: declarations for global variables, read-only for-loop variables, decimal printing of floats, more levels for constructors, `table.create`, expanded `utf8.offset` return, external strings, new library functions, incremental major collections, compact arrays (60% less memory), dynamic loading of 'readline', static binaries (reuse of original memory), dump/undump reuses all strings, and auxiliary buffer reuses buffer.\n\nInstallation creates 'bin', 'include', 'lib', 'man', and 'share' directories. Customization is possible by editing Makefiles or `src/luaconf.h`. The license allows for commercial use without cost, requiring only copyright attribution.\n"
  },
  {
    "id": "45846534",
    "title": "Writerdeck.org",
    "url": "http://www.writerdeck.org/",
    "summary": "生成摘要时出错",
    "chinese_title": "Writerdeck.org",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45934481",
    "title": "A structural regular expression engine for Rust",
    "url": "https://www.sminez.dev/match-it-again-sam/",
    "summary": "生成摘要时出错",
    "chinese_title": "A structural regular expression engine for Rust",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45935398",
    "title": "Ohm Editor",
    "url": "https://ohmjs.org/editor/",
    "summary": "生成摘要时出错",
    "chinese_title": "Ohm Editor",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45819556",
    "title": "A Common Semiconductor Just Became a Superconductor",
    "url": "https://www.sciencedaily.com/releases/2025/10/251030075105.htm",
    "summary": "生成摘要时出错",
    "chinese_title": "A Common Semiconductor Just Became a Superconductor",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45925890",
    "title": "Show HN: Encore – Type-safe back end framework that generates infra from code",
    "url": "https://github.com/encoredev/encore",
    "summary": "生成摘要时出错",
    "chinese_title": "Show HN: Encore – Type-safe back end framework that generates infra from code",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45926350",
    "title": "Google Releases CodeWiki",
    "url": "https://codewiki.google/",
    "summary": "生成摘要时出错",
    "chinese_title": "Google Releases CodeWiki",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45876487",
    "title": "Raycore: GPU accelerated and modular ray intersections",
    "url": "https://makie.org/website/blogposts/raycore/",
    "summary": "生成摘要时出错",
    "chinese_title": "Raycore: GPU accelerated and modular ray intersections",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45922420",
    "title": "What happened with the CIA and The Paris Review?",
    "url": "https://www.theparisreview.org/blog/2025/11/11/what-really-happened-with-the-cia-and-the-paris-review-a-conversation-with-lance-richardson/",
    "summary": "生成摘要时出错",
    "chinese_title": "What happened with the CIA and The Paris Review?",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45934260",
    "title": "VisiData – open-source spreadsheet for the terminal",
    "url": "https://www.visidata.org/",
    "summary": "生成摘要时出错",
    "chinese_title": "VisiData – open-source spreadsheet for the terminal",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45926779",
    "title": "I think nobody wants AI in Firefox, Mozilla",
    "url": "https://manualdousuario.net/en/mozilla-firefox-window-ai/",
    "summary": "生成摘要时出错",
    "chinese_title": "I think nobody wants AI in Firefox, Mozilla",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45875618",
    "title": "Honda: 2 years of ml vs 1 month of prompting - heres what we learned",
    "url": "https://www.levs.fyi/blog/2-years-of-ml-vs-1-month-of-prompting/",
    "summary": "生成摘要时出错",
    "chinese_title": "Honda: 2 years of ml vs 1 month of prompting - heres what we learned",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45935786",
    "title": "Tesla Releases FSD Crash Data That Appears More Honest",
    "url": "https://www.forbes.com/sites/bradtempleton/2025/11/14/tesla-finally-releases-fsd-crash-data-that-appears-more-honest/",
    "summary": "生成摘要时出错",
    "chinese_title": "Tesla Releases FSD Crash Data That Appears More Honest",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45903325",
    "title": "Steam Frame",
    "url": "https://store.steampowered.com/sale/steamframe",
    "summary": "生成摘要时出错",
    "chinese_title": "Steam Frame",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45934416",
    "title": "AMD GPUs Go Brrr",
    "url": "https://hazyresearch.stanford.edu/blog/2025-11-09-amd-brr",
    "summary": "生成摘要时出错",
    "chinese_title": "AMD GPUs Go Brrr",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45931224",
    "title": "Genergo: Propellantless space-propulsion system",
    "url": "https://www.satcom.digital/news/genergo-an-italian-company-builds-the-worlds-first-known-propellantless-space-propulsion-system-flight-tested-and-validated-on-orbit",
    "summary": "生成摘要时出错",
    "chinese_title": "Genergo: Propellantless space-propulsion system",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45927435",
    "title": "Oracle hit hard in Wall Street's tech sell-off over its AI bet",
    "url": "https://www.ft.com/content/583e9391-bdd0-433e-91e0-b1b93038d51e",
    "summary": "生成摘要时出错",
    "chinese_title": "Oracle hit hard in Wall Street's tech sell-off over its AI bet",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45929247",
    "title": "Meeting notes between Forgejo and the Dutch government via Git commits",
    "url": "https://codeberg.org/forgejo/sustainability/pulls/137/files",
    "summary": "生成摘要时出错",
    "chinese_title": "Meeting notes between Forgejo and the Dutch government via Git commits",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45922850",
    "title": "How to Get a North Korea / Antarctica VPS",
    "url": "https://blog.lyc8503.net/en/post/asn-5-worldwide-servers/",
    "summary": "生成摘要时出错",
    "chinese_title": "How to Get a North Korea / Antarctica VPS",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45912698",
    "title": "Checkout.com hacked, refuses ransom payment, donates to security labs",
    "url": "https://www.checkout.com/blog/protecting-our-merchants-standing-up-to-extortion",
    "summary": "生成摘要时出错",
    "chinese_title": "Checkout.com hacked, refuses ransom payment, donates to security labs",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45935396",
    "title": "Adding Customizable Frame Contrast to KDE Plasma",
    "url": "https://akselmo.dev/posts/frame-contrast-settings/",
    "summary": "生成摘要时出错",
    "chinese_title": "Adding Customizable Frame Contrast to KDE Plasma",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45936111",
    "title": "NATO Ended Russia's Estonian Air Incursions",
    "url": "https://themilitaryanalyst.com/2025/11/13/the-real-story-how-nato-ended-russias-estonian-air-incursions/",
    "summary": "生成摘要时出错",
    "chinese_title": "NATO Ended Russia's Estonian Air Incursions",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45934447",
    "title": "AI note-taking startup Fireflies was really two guys typing notes by hand",
    "url": "https://www.pcgamer.com/software/ai/usd1-billion-ai-company-co-founder-admits-that-its-usd100-a-month-transcription-service-was-originally-two-guys-surviving-on-pizza-and-typing-out-notes-by-hand/",
    "summary": "生成摘要时出错",
    "chinese_title": "AI note-taking startup Fireflies was really two guys typing notes by hand",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45916037",
    "title": "SIMA 2: An agent that plays, reasons, and learns with you in virtual 3D worlds",
    "url": "https://deepmind.google/blog/sima-2-an-agent-that-plays-reasons-and-learns-with-you-in-virtual-3d-worlds/",
    "summary": "生成摘要时出错",
    "chinese_title": "SIMA 2: An agent that plays, reasons, and learns with you in virtual 3D worlds",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45926439",
    "title": "Nvidia is gearing up to sell servers instead of just GPUs and components",
    "url": "https://www.tomshardware.com/tech-industry/artificial-intelligence/jp-morgan-says-nvidia-is-gearing-up-to-sell-entire-ai-servers-instead-of-just-ai-gpus-and-componentry-jensens-master-plan-of-vertical-integration-will-boost-profits-purportedly-starting-with-vera-rubin",
    "summary": "生成摘要时出错",
    "chinese_title": "Nvidia is gearing up to sell servers instead of just GPUs and components",
    "chinese_summary": "生成摘要时出错"
  }
]