[
  {
    "id": "43772311",
    "title": "How a 20 year old bug in GTA San Andreas surfaced in Windows 11 24H2",
    "url": "https://cookieplmonster.github.io/2025/04/23/gta-san-andreas-win11-24h2-bug/",
    "summary": "This article details the investigation of a bug in Grand Theft Auto: San Andreas that surfaced in Windows 11 24H2, causing the Skimmer seaplane to disappear from the game or send the player flying into the sky. The author, the creator of SilentPatch (a mod that fixes bugs in the game), initially dismissed the reports but confirmed the issue on a Windows 11 24H2 virtual machine.\n\nThe investigation revealed that the bug stemmed from an uninitialized wheel scale value in the game's data file (vehicles.ide) for the Skimmer. Due to an oversight, the Skimmer's definition was missing wheel scale parameters, causing the game to read garbage values from the stack, which, until Windows 11 24H2, coincidentally led to usable but incorrect gameplay.\n\nThe root cause traced back to how the game loaded vehicle data. The function CFileLoader::LoadVehicleObject used sscanf to parse the vehicles.ide file, and assumed all parameters are always present. Since Skimmer's entry omitted the wheel scale values, the related variables remained uninitialized, and garbage data would be read in their place. Prior to Windows 11 24H2, the default values produced by uninitialized data resulted in (incorrect) stable gameplay, while the update now produces numbers that cause out-of-bounds physics calculations and crashes.\n\nThe author provides a fix for SilentPatch, which involves providing default values for the missing wheel scale parameters during the file loading process, and explains how the game erroneously used the prior wheel scale values defined on the car above it, but that this behavior was still coincidently stable until Windows 11 24H2. The article concludes by highlighting the unusual nature of the bug, questioning why it remained hidden for so long before being triggered by a specific Windows update.\n",
    "chinese_title": "GTA圣安地列斯20年老Bug如何在Windows 11 24H2中浮出水面",
    "chinese_summary": "本文详细调查了侠盗猎车手：圣安地列斯在Windows 11 24H2中出现的一个漏洞，该漏洞导致水上飞机Skimmer从游戏中消失或将玩家抛向空中。SilentPatch（一款修复游戏漏洞的模组）的作者最初对这些报告不以为然，但在Windows 11 24H2虚拟机上确认了该问题。\n\n调查显示，该漏洞源于游戏中Skimmer的车辆数据文件（vehicles.ide）中未初始化的车轮比例值。由于疏忽，Skimmer的定义缺少车轮比例参数，导致游戏从堆栈中读取垃圾值，直到Windows 11 24H2，这些值巧合地导致了可用但不正确的游戏体验。\n\n根本原因追溯到游戏加载车辆数据的方式。CFileLoader::LoadVehicleObject函数使用sscanf解析vehicles.ide文件，并假定所有参数始终存在。由于Skimmer的条目省略了车轮比例值，因此相关变量保持未初始化状态，并将在其位置读取垃圾数据。在Windows 11 24H2之前，未初始化数据产生的默认值导致了（不正确的）稳定游戏体验，而现在更新后产生数字导致了超出范围的物理计算和崩溃。\n\n作者为SilentPatch提供了一个修复方案，该方案包括在文件加载过程中为缺少的车轮比例参数提供默认值，并解释了游戏如何错误地使用了上面车辆定义的先前车轮比例值，但这种行为在Windows 11 24H2之前仍然巧合地稳定。文章最后强调了该漏洞的异常性质，质疑为什么它在被特定的Windows更新触发之前隐藏了这么长时间。"
  },
  {
    "id": "43773563",
    "title": "Launch HN: Cua (YC X25) – Open-Source Docker Container for Computer-Use Agents",
    "url": "https://github.com/trycua/cua",
    "summary": "Cua (Computer-Use Agent) is an open-source framework that allows AI agents to control full operating systems within high-performance virtual containers. It leverages Apple's Virtualization.Framework to achieve up to 97% native speed on Apple Silicon and supports any vision language model.\n\nKey features include:\n\n*   **High-Performance Virtualization:** Creates and runs macOS/Linux virtual machines with near-native speed.\n*   **Computer-Use Interface & Agent:** Enables AI systems to observe and control these virtual environments, interacting with applications, browsing, coding, and performing complex workflows.\n\nBenefits of using Cua:\n\n*   **Security & Isolation:** Runs agents in isolated environments.\n*   **Performance:** Near-native speed on Apple Silicon.\n*   **Flexibility:** Supports macOS and Linux.\n*   **Reproducibility:** Creates consistent environments.\n*   **LLM Integration:** Supports various LLM providers.\n\nThe framework offers different installation options, including a Lume CLI for VM management only, a full installation for agent capabilities, and an option to build from source for nightly features. Several libraries are provided within the monorepo: Lume, Computer, and Agent.\n\nCua encourages contributions and provides comprehensive documentation and demos to facilitate usage. It is licensed under the MIT License.\n",
    "chinese_title": "启动HN：Cua (YC X25) – 用于计算机使用代理的开源Docker容器",
    "chinese_summary": "Cua (计算机使用代理): 一个开源框架，允许 AI 代理在高性能虚拟容器中控制完整的操作系统。它利用 Apple 的 Virtualization.Framework，在 Apple Silicon 上实现高达 97% 的原生速度，并支持任何视觉语言模型。\n\n主要特性包括：\n\n*   **高性能虚拟化：** 创建并运行具有接近原生速度的 macOS/Linux 虚拟机。\n*   **计算机使用接口与代理：** 使 AI 系统能够观察和控制这些虚拟环境，与应用程序交互、浏览、编码并执行复杂的工作流程。\n\n使用 Cua 的优势：\n\n*   **安全与隔离：** 在隔离环境中运行代理。\n*   **性能：** 在 Apple Silicon 上接近原生速度。\n*   **灵活性：** 支持 macOS 和 Linux。\n*   **可复现性：** 创建一致的环境。\n*   **LLM 集成：** 支持各种 LLM 提供商。\n\n该框架提供不同的安装选项，包括仅用于虚拟机管理的 Lume CLI、用于代理功能的完整安装，以及用于夜间构建特性的从源代码构建选项。Monorepo 中提供了几个库：Lume、Computer 和 Agent。\n\nCua 鼓励贡献，并提供全面的文档和演示来方便使用。它采用 MIT 许可证。"
  },
  {
    "id": "43773813",
    "title": "AI Horseless Carriages",
    "url": "https://koomen.dev/essays/horseless-carriages/",
    "summary": "Without the actual content of the \"AI Horseless Carriages | koomen.dev\" article, I can only provide a general summary based on the title. It's likely that the article discusses the evolution and implications of self-driving cars, using the analogy of early automobiles being called \"horseless carriages.\"\n\nHere's a plausible summary:\n\nThe article, titled \"AI Horseless Carriages,\" likely explores the development and future of autonomous vehicles, drawing parallels to the early days of automobiles which were initially referred to as \"horseless carriages.\" It probably discusses how artificial intelligence is revolutionizing transportation, similar to how the internal combustion engine replaced horses.\n\nThe author likely examines the challenges and opportunities presented by AI-powered vehicles. This could include discussions about the technological hurdles that need to be overcome, such as improving sensor accuracy, handling unpredictable situations, and ensuring safety and reliability.\n\nThe article might also address the societal impact of self-driving cars, including potential changes to employment, urban planning, and transportation infrastructure. It could explore ethical considerations, such as how autonomous vehicles should be programmed to make decisions in accident scenarios and how to address issues of liability.\n\nFinally, the article likely touches on the long-term vision for AI in transportation, envisioning a future where self-driving cars are commonplace, leading to safer, more efficient, and more accessible transportation systems. The analogy to \"horseless carriages\" emphasizes that the current perception of self-driving cars is just the beginning of a transformative shift in how we think about and utilize transportation.\n",
    "chinese_title": "人工智能无人驾驶汽车",
    "chinese_summary": "人工智能无马马车：对自动驾驶汽车发展与影响的探讨"
  },
  {
    "id": "43770445",
    "title": "MinC Is Not Cygwin",
    "url": "https://minc.commandlinerevolution.nl/english/home.html",
    "summary": "MinC is a Unix emulator for Windows, designed specifically to allow vocational education students to learn Linux without the complexities of virtualization. It leverages OpenBSD 6.1 code, running a small kernel directly on Windows (excluding Win95 and Win98). This allows for near-native speed execution of OpenBSD software on a Windows machine. Essentially, MinC provides a way to run OpenBSD on Windows without needing a virtual machine.\n",
    "chinese_title": "MinC并非Cygwin",
    "chinese_summary": "MinC：一款Windows下的Unix模拟器，专为职业教育学生设计，让他们无需复杂的虚拟化就能学习Linux。它利用OpenBSD 6.1代码，直接在Windows上运行小型内核（不包括Win95和Win98）。这使得OpenBSD软件在Windows机器上可以接近原生速度运行。本质上，MinC提供了一种在Windows上运行OpenBSD的方式，而无需虚拟机。"
  },
  {
    "id": "43774169",
    "title": "Tarpit ideas – what are tarpit ideas and how to avoid them (2023) [video]",
    "url": "https://www.ycombinator.com/library/Ij-tarpit-ideas-what-are-tarpit-ideas-how-to-avoid-them",
    "summary": "This Y Combinator video on \"Tarpit Ideas\" defines them as startup concepts that sound good on the surface but are fundamentally flawed and likely to trap entrepreneurs in a long, fruitless effort. The video emphasizes that these ideas often appeal to people with limited startup experience.\n\nThe video likely outlines common characteristics of tarpit ideas. These might include:\n\n*   **Solving a problem that doesn't truly exist or isn't painful enough for users to pay for a solution.** They might address needs that are already adequately met or problems that users are willing to tolerate.\n\n*   **Relying on unproven or difficult-to-scale technologies.** Ideas that require breakthroughs in technology or depend on rapidly changing landscapes can be highly risky.\n\n*   **Facing extreme competition or regulatory hurdles.** Entering a saturated market or navigating complex regulations can significantly hinder growth.\n\n*   **Requiring significant capital investment before validating the idea.** Building a complex product or acquiring a large user base before proving product-market fit can lead to wasted resources.\n\nTo avoid tarpit ideas, the video likely suggests:\n\n*   **Thorough customer validation:** Talking to potential customers, understanding their needs, and validating the problem before building anything.\n\n*   **Starting small and iterating quickly:** Building a minimum viable product (MVP) to test assumptions and gather feedback.\n\n*   **Focusing on a niche market:** Targeting a specific group of users with a focused solution.\n\n*   **Being open to pivoting:** Willing to change the idea based on customer feedback and market realities.\n\nIn essence, the video advises entrepreneurs to be highly critical of their own ideas, validate assumptions early, and prioritize solving real problems for paying customers.\n",
    "chinese_title": "焦油坑想法——什么是焦油坑想法以及如何避免它们（2023）[视频]",
    "chinese_summary": "这期Y Combinator关于“泥潭创业点子”的视频将其定义为表面上听起来不错，但本质上有缺陷，并且可能使创业者陷入漫长而徒劳的努力中的创业概念。 该视频强调，这些想法通常会吸引创业经验有限的人。\n\n该视频可能概述了泥潭创业点子的常见特征。 这些可能包括：\n\n*   **解决一个并不真正存在的问题，或者用户并不愿意为解决方案付费的痛点。** 它们可能解决已经被充分满足的需求，或者用户愿意容忍的问题。\n\n*   **依赖未经证实或难以扩展的技术。** 需要技术突破或依赖快速变化领域的想法可能风险很高。\n\n*   **面临激烈的竞争或监管障碍。** 进入饱和的市场或应对复杂的法规可能会严重阻碍增长。\n\n*   **在验证想法之前需要大量的资本投资。** 在证明产品与市场契合度之前构建复杂的产品或获取庞大的用户群可能导致资源浪费。\n\n为了避免泥潭创业点子，该视频可能建议：\n\n*   **彻底的客户验证：** 在构建任何东西之前，与潜在客户交谈，了解他们的需求并验证问题。\n\n*   **从小处着手并快速迭代：** 构建最小可行产品（MVP）来测试假设并收集反馈。\n\n*   **专注于利基市场：** 针对具有针对性解决方案的特定用户群。\n\n*   **乐于改变方向：** 愿意根据客户反馈和市场现实改变想法。\n\n本质上，该视频建议创业者对其自身的想法持高度批判态度，尽早验证假设，并优先考虑为付费客户解决实际问题。"
  },
  {
    "id": "43772503",
    "title": "Automated Antenna Design with Evolutionary Algorithms [pdf] (2006)",
    "url": "https://ntrs.nasa.gov/api/citations/20060024675/downloads/20060024675.pdf",
    "summary": "This PDF appears to be the start of a document titled \"Automated Antenna Design with Evolutionary Algorithms\" from 2006. Unfortunately, the provided content is primarily metadata and compressed image data (CCITTFaxDecode), offering no readable text detailing the article's content. Therefore, a proper summary based on the actual research presented is impossible. It can only be inferred from the title that the document discusses using evolutionary algorithms (a type of optimization technique) to automate the design of antennas. It's likely to cover the challenges in antenna design, the application of evolutionary algorithms to overcome these challenges, and potentially present specific examples or results of this automated design process.\n",
    "chinese_title": "基于进化算法的自动化天线设计 [pdf] (2006)",
    "chinese_summary": "这份PDF似乎是2006年一篇题为《利用进化算法的自动化天线设计》的文档的开头。遗憾的是，提供的内容主要是元数据和压缩图像数据(CCITTFaxDecode)，没有详细描述文章内容的任何可读文本。因此，无法根据实际研究内容提供恰当的摘要。只能从标题推断该文档讨论了使用进化算法（一种优化技术）来自动化天线设计。它可能涵盖天线设计中的挑战、进化算法在克服这些挑战中的应用，并可能展示这种自动化设计过程的具体示例或结果。"
  },
  {
    "id": "43773537",
    "title": "The Danglepoise",
    "url": "https://www.sallery.co.uk/danglepoise",
    "summary": "In \"The Danglepoise,\" published in 2025, the author details their journey to create custom, motorized, rise-and-fall pendant lights. Dissatisfied with the flimsiness of modern fixtures and unable to find suitable antique or matching lights, they embarked on a DIY project fueled by a love for electric motors.\n\nThe author's initial research led to exploring slip rings for powering the lamp while allowing it to move, but the high cost of quality mains-rated slip rings prompted a design rethink. They opted for a system using a steel cable wound around a motor-driven drum, with custom 3D-printed clips to manage the lamp's flex cable in a zig-zag pattern.\n\nThe mechanical design incorporates a stepper motor with a brake for precise positioning and holding, despite its higher energy consumption. An ESP32-based TinyPICO microcontroller was chosen for electronics, allowing for wifi control and status indication.\n\nThe electronic design includes separate PCBs for mains voltage components (power supply, relay, fuse) and low-voltage control (motor driver, microcontroller). The system needs a 24V power supply for the brake, a 5V regulator for the microcontroller, and a motor driver chip for smooth and quiet stepper motor control. The author prioritizes safety by using a high-quality, encapsulated mains power supply.\n",
    "chinese_title": "悬秤",
    "chinese_summary": "在2025年出版的《吊灯奇谭》中，作者详细描述了他们创造定制的、电动升降吊灯的旅程。由于对现代灯具的脆弱感到不满，并且无法找到合适的古董灯或配套灯，他们出于对电动机的热爱，开始了DIY项目。\n\n作者最初的研究 направлено на изследване на плъзгащите пръстени за захранване на лампата, позволявайки ѝ да се движи, но високата цена на качествените плъзгащи пръстени, оценени за работа с електрическа мрежа, предизвика преосмисляне на дизайна. Те се спряха на система, използваща стоманен кабел, навит около задвижван от мотор барабан, с персонализирани 3D отпечатани скоби за управление на гъвкавия кабел на лампата в зигзагообразен модел.\n\n机械设计采用了带有制动器的步进电机，用于精确定位和保持，尽管其能耗较高。 选择基于ESP32的TinyPICO微控制器进行电子控制，从而实现wifi控制和状态指示。\n\n电子设计包括用于主电压组件（电源、继电器、保险丝）和低电压控制（电机驱动器、微控制器）的独立PCB。 该系统需要一个24V电源来为制动器供电，一个5V稳压器来为微控制器供电，以及一个电机驱动器芯片来实现平稳安静的步进电机控制。 作者优先考虑安全性，使用高质量的封装式主电源。"
  },
  {
    "id": "43773977",
    "title": "I won't be vibe coding anymore: a noob's perspective",
    "url": "https://varunraghu.com/why-i-wont-be-vibe-coding-anymore/",
    "summary": "This article, written in April 2025, expresses a coder's disillusionment with \"vibe coding\" – heavily relying on AI to build applications. The author, a self-described \"noob,\" initially embraced AI tools to overcome the frustration of writing poor code and struggling with basic concepts. They found the AI helped them build functional apps quickly.\n\nHowever, the author experienced an epiphany during a sleepless night. They realized they hadn't learned anything new in weeks despite building \"useful apps.\" This led to the conclusion that the core value of coding lies not in the finished product, but in the process of problem-solving, critical thinking, and the personal effort invested.\n\nThe author draws an analogy between coding and writing, emphasizing the importance of the creative process and the individual's approach to tackling challenges. They fear that over-reliance on AI will rob them of these fundamental learning experiences.\n\nUltimately, the author decides to \"break up\" with vibe coding and return to writing code themselves, even if it's \"shitty,\" slow, and deliberate. They prioritize the learning process and the development of their own skills over the convenience and speed of AI-generated code. The piece champions the personal investment and learning inherent in the traditional coding experience.\n",
    "chinese_title": "我不再凭感觉编程了：一个菜鸟的视角",
    "chinese_summary": "本文写于2025年4月，表达了一位程序员对“氛围编码”——即过度依赖人工智能构建应用程序——的幻灭感。作者自称“菜鸟”，最初拥抱人工智能工具是为了克服编写糟糕代码和难以理解基本概念的挫败感。他们发现人工智能帮助他们快速构建功能性应用程序。\n\n然而，作者在一个不眠之夜体验到顿悟。他们意识到，尽管构建了“有用的应用程序”，但几周来他们什么都没学到。这让他们得出结论：编码的核心价值不在于最终产品，而在于解决问题、批判性思维以及个人投入的过程。\n\n作者将编码与写作进行类比，强调了创造过程和个人应对挑战方式的重要性。他们担心过度依赖人工智能会剥夺他们这些基本的学习体验。\n\n最终，作者决定与“氛围编码”分手，回到自己编写代码的状态，即使代码“很烂”，速度很慢，需要深思熟虑。他们优先考虑学习过程和自身技能的发展，而不是人工智能生成的代码所带来的便利和速度。这篇文章赞扬了传统编码体验中固有的个人投入和学习。"
  },
  {
    "id": "43770821",
    "title": "How ZGC allocates memory for the Java heap",
    "url": "https://joelsiks.com/posts/zgc-heap-memory-allocation/",
    "summary": "This article provides a deep dive into how ZGC, a garbage collector in OpenJDK, allocates memory for the Java heap. The heap is divided into logical regions called pages, categorized as Small (2MB), Medium (32MB), and Large (dynamically sized, over 4MB). The Page Allocator manages these pages, maintaining partitions representing subsets of the heap. NUMA systems can have multiple partitions, each corresponding to a NUMA node for improved memory access speed.\n\nZGC uniquely separates physical and virtual memory to combat fragmentation. Virtual memory is over-reserved (up to 16x or 32x the maximum heap size) to increase the likelihood of finding contiguous memory ranges. When pages are freed, ZGC actively defragments the heap by re-mapping physical memory to new virtual addresses.\n\nThe Mapped Cache stores ranges of mapped memory that are not in use by any page, using a self-balancing binary search tree for efficient management. It uses intrusive storage to avoid dynamic memory allocation and speeds up searches for contiguous memory during allocations.\n\nMemory allocation involves claiming capacity, securing physical memory, and potentially using virtual memory from the Mapped Cache. The allocation process prioritizes obtaining contiguous memory from the cache, followed by increasing capacity (committing new memory), and finally harvesting smaller ranges from the cache if necessary. If capacity can't be increased, the allocation will prioritize harvesting existing mapped memory that is available.\n",
    "chinese_title": "ZGC 如何为 Java 堆分配内存",
    "chinese_summary": "本文深入探讨了OpenJDK中垃圾收集器ZGC如何为Java堆分配内存。堆被划分为称为页面的逻辑区域，分为小型（2MB）、中型（32MB）和大型（动态大小，超过4MB）三类。页面分配器管理这些页面，维护代表堆子集的多个分区。NUMA系统可以有多个分区，每个分区对应一个NUMA节点，以提高内存访问速度。\n\nZGC独特地分离了物理内存和虚拟内存，以对抗碎片化。虚拟内存被过度预留（最高可达最大堆大小的16倍或32倍），以增加找到连续内存范围的可能性。当页面被释放时，ZGC通过将物理内存重新映射到新的虚拟地址来主动整理堆。\n\n映射缓存存储了未被任何页面使用的已映射内存范围，使用自平衡二叉搜索树进行高效管理。它使用侵入式存储来避免动态内存分配，并加快分配期间搜索连续内存的速度。\n\n内存分配涉及声明容量、获取物理内存，并可能使用来自映射缓存的虚拟内存。分配过程优先从缓存中获取连续内存，然后增加容量（提交新内存），最后在必要时从缓存中收集较小的范围。如果无法增加容量，分配将优先收集可用的现有映射内存。"
  },
  {
    "id": "43770615",
    "title": "Collatz's Ant",
    "url": "https://gbragafibra.github.io/2025/01/08/collatz_ant2.html",
    "summary": "This article explores a visualization of Collatz sequences using a modified version of Langton's Ant, termed \"Collatz's Ant.\" The ant's movement is determined by the Collatz function: if a number is even, the ant turns 90º clockwise; if odd, it turns 90º counter-clockwise. The ant moves forward one unit after each step.\n\nThe author initially used a version where the cell state is flipped at each step, but later presented a non-flipping version that simply increments a counter at each visited coordinate for clearer visualization and to avoid ambiguity.\n\nThe study reveals a correlation between the visual \"landscapes\" generated by Collatz's Ant and the stopping times of the corresponding sequences. Similar landscapes tend to have similar (or identical) stopping times, although the converse is not necessarily true. The article demonstrates that sequences with shared subsequences (as indicated by the `intersect1d` function in the provided Python code) result in similar landscapes.\n\nFurthermore, the article illustrates how sequences that converge after a certain number of Collatz steps also exhibit landscape similarities, often with rotations of 90º, 180º, or more. The degree of similarity diminishes as the difference in steps between the converging sub-trajectories increases, with only larger-scale common characteristics remaining after a significant number of steps (e.g., 300).\n",
    "chinese_title": "考拉兹蚁",
    "chinese_summary": "本文探讨了使用改进的兰顿蚂蚁（称为“考拉兹蚂蚁”）可视化考拉兹序列的方法。蚂蚁的移动由考拉兹函数决定：如果数字为偶数，蚂蚁顺时针旋转90º；如果为奇数，蚂蚁逆时针旋转90º。蚂蚁每走一步前进一个单位。\n\n作者最初使用了每步翻转单元格状态的版本，但后来提出了一个非翻转版本，该版本只是在每个访问的坐标处递增一个计数器，以便更清晰地可视化并避免歧义。\n\n该研究揭示了考拉兹蚂蚁生成的视觉“地形”与相应序列的停止时间之间的相关性。相似的地形往往具有相似（或相同）的停止时间，尽管反之不一定成立。文章表明，具有共享子序列的序列（如提供的Python代码中的`intersect1d`函数所示）会产生相似的地形。\n\n此外，本文还说明了在一定数量的考拉兹步骤后收敛的序列也会表现出地形相似性，通常伴随90º、180º或更大的旋转。随着收敛子轨迹之间步骤差异的增加，相似程度会降低，经过大量步骤（例如，300步）后，仅留下更大规模的共同特征。"
  },
  {
    "id": "43743399",
    "title": "How MOS 6502 Illegal Opcodes Work (2008)",
    "url": "https://www.pagetable.com/?p=39",
    "summary": "This article explains how illegal opcodes on the MOS 6502 processor work by examining the processor's internal architecture and instruction decoding process. Unlike CPUs using microcode, the 6502 uses a 130x21 bit PLA (Programmable Logic Array) to interpret instructions. Each line in the PLA compares the opcode and the current clock cycle (T1-T6), firing if they match and triggering specific CPU actions.\n\nThe opcodes are structured to allow generalization of behavior, meaning certain PLA lines can fire for multiple similar opcodes, executing a shared task like fetching an address byte. Illegal opcodes arise because these undefined instructions can still trigger existing PLA lines designed for valid instructions.\n\nThe article uses the example of opcode $AF (LAX absolute) to illustrate this. $AF doesn't have dedicated PLA lines, but its bitfield triggers lines intended for $AD (LDA abs) and $AE (LDX abs) during specific cycles (T1, T2, T4). In cycle T3, it triggers *both* LDA and LDX lines, causing the processor to load the fetched value into both the accumulator (A) and the X register simultaneously, effectively creating the \"LAX\" instruction.\n\nThe article also explains the \"KIL\" (halt) opcodes. These occur when no valid instruction line fires across all clock cycles (T1-T7), preventing the T bitfield from resetting. This halts the CPU and disables interrupts because interrupt requests are delayed until instruction completion (T reset), which never happens. Therefore, understanding how illegal opcodes interact with the 6502's PLA can reveal insights into the CPU's internal design and potentially uncover other undocumented behaviors.\n",
    "chinese_title": "MOS 6502非法操作码的工作原理 (2008)",
    "chinese_summary": "本文通过研究MOS 6502处理器的内部架构和指令解码过程，解释了该处理器上非法操作码的工作原理。与使用微代码的CPU不同，6502使用一个130x21位的PLA（可编程逻辑阵列）来解释指令。PLA中的每一行都比较操作码和当前时钟周期（T1-T6），如果它们匹配，则触发并启动特定的CPU动作。\n\n操作码的结构允许行为的泛化，这意味着某些PLA行可以为多个相似的操作码触发，执行诸如获取地址字节之类的共享任务。非法操作码的出现是因为这些未定义的指令仍然可以触发为有效指令设计的现有PLA行。\n\n本文以操作码$AF（LAX绝对寻址）为例来说明这一点。$AF没有专用的PLA行，但它的位域在特定周期（T1、T2、T4）触发为$AD（LDA绝对寻址）和$AE（LDX绝对寻址）设计的行。在周期T3中，它会*同时*触发LDA和LDX行，导致处理器将获取的值同时加载到累加器（A）和X寄存器中，从而有效地创建“LAX”指令。\n\n本文还解释了“KIL”（停止）操作码。当所有时钟周期（T1-T7）中都没有有效的指令行触发时，就会发生这种情况，从而阻止T位域复位。这会停止CPU并禁用中断，因为中断请求会被延迟到指令完成（T复位）为止，而这种情况永远不会发生。因此，了解非法操作码如何与6502的PLA交互可以揭示对CPU内部设计的见解，并可能发现其他未记录的行为。"
  },
  {
    "id": "43769289",
    "title": "Beer on Board in the Age of Sail (2017)",
    "url": "https://blog.library.si.edu/blog/2017/08/02/beer-board-age-sail/",
    "summary": "Julia Blakely's \"Beer on Board in the Age of Sail\" explores the historical significance of beer as a staple beverage for seafarers, particularly in the Age of Sail. The article traces the origins of beer brewing back to ancient civilizations and highlights its importance on ships, where it provided nutrition, calories, and a safer alternative to potentially contaminated water.\n\nThe article details the rations provided to sailors, referencing the British Royal Navy's records and figures like Samuel Pepys. It emphasizes that the beer consumed was often \"small beer,\" low in alcohol content. The piece also explores the role of beer in preventing scurvy, citing James Cook's voyages and the use of spruce beer, a practice adopted from Native Americans, as a source of vitamin C.\n\nThe shift from beer to rum in certain regions, the prohibition of alcohol in the US Navy, and the historical context of beer production in early America are discussed. The article highlights Louis Pasteur's contributions to beer preservation through pasteurization. Finally, the author touches upon the maritime origins of some common English phrases and encourages readers to explore the Smithsonian Libraries' collections to further investigate the intertwined histories of beer and the sea.\n",
    "chinese_title": "帆船时代的船上啤酒 (2017)",
    "chinese_summary": "朱莉娅·布莱克利的《风帆时代的船上啤酒》探讨了啤酒作为航海者主食饮料的历史意义，尤其是在风帆时代。 文章追溯了啤酒酿造的起源，可追溯到古代文明，并强调了啤酒在船只上的重要性，它提供了营养、卡路里，并且是潜在污染水的更安全替代品。\n\n文章详细介绍了提供给水手的配给，参考了英国皇家海军的记录和塞缪尔·佩皮斯等人物。 它强调消费的啤酒通常是酒精含量低的“淡啤酒”。 文章还探讨了啤酒在预防坏血病中的作用，引用了詹姆斯·库克的海上航行以及使用云杉啤酒（一种源自美洲原住民的实践）作为维生素C的来源。\n\n文章讨论了某些地区从啤酒到朗姆酒的转变、美国海军对酒精的禁令以及早期美国啤酒生产的历史背景。 文章重点介绍了路易斯·巴斯德通过巴氏消毒法对啤酒保鲜的贡献。 最后，作者谈到了某些常见英语短语的航海起源，并鼓励读者探索史密森尼学会图书馆的藏品，以进一步调查啤酒和海洋相互交织的历史。"
  },
  {
    "id": "43773976",
    "title": "Show HN: Moose – OSS framework to build analytical back ends with ClickHouse",
    "url": "https://docs.fiveonefour.com/moose",
    "summary": "Moose is an open-source framework designed to simplify the creation of analytical backends using ClickHouse. It allows developers to define data models in TypeScript or Python, automatically generating the necessary data ingestion, storage, and API infrastructure. This approach aims to address the common pain points of building analytical backends, such as tool fragmentation, schema drift, and complex development workflows.\n\nKey benefits of using Moose include type-safe data models, streamlined streaming and batch ingestion, real-time stream processing, in-database transformations, and simplified API creation. By defining data models in code, Moose eliminates the need to manually update database schemas, APIs, and message formats.\n\nMoose also offers a local development environment that can be spun up with a single command, enabling rapid iteration and testing. This local environment mirrors the production environment, minimizing configuration and setup. Features like hot reloading allow developers to see changes reflected instantly across the entire stack.\n\nThe framework is modular and configurable, with ClickHouse as the default OLAP database, and Redpanda and Temporal optionally integrated for event streaming and workflow orchestration. Planned extensions include support for other data warehouses like Snowflake, Databricks, and BigQuery, as well as other event streaming platforms. Moose is designed for applications like user-facing analytics, BI, data warehouses, data migrations, event streaming, and ETL workloads.\n",
    "chinese_title": "Show HN: Moose – 用 ClickHouse 构建分析后端的开源框架",
    "chinese_summary": "Moose是一个开源框架，旨在简化使用ClickHouse创建分析后端的过程。它允许开发者使用TypeScript或Python定义数据模型，自动生成必要的数据摄取、存储和API基础设施。这种方法旨在解决构建分析后端时常见的痛点，例如工具碎片化、模式漂移和复杂的开发工作流程。\n\n使用Moose的主要优势包括类型安全的数据模型、简化的流式和批量摄取、实时流处理、数据库内转换以及简化的API创建。通过在代码中定义数据模型，Moose消除了手动更新数据库模式、API和消息格式的需求。\n\nMoose还提供了一个本地开发环境，可以通过单个命令启动，从而实现快速迭代和测试。此本地环境镜像生产环境，最大限度地减少配置和设置。热重载等功能允许开发人员立即看到整个堆栈中反映的变化。\n\n该框架是模块化和可配置的，以ClickHouse作为默认的OLAP数据库，并可选择集成Redpanda和Temporal用于事件流和工作流编排。计划中的扩展包括支持其他数据仓库，如Snowflake、Databricks和BigQuery，以及其他事件流平台。Moose专为用户界面分析、BI、数据仓库、数据迁移、事件流和ETL工作负载等应用而设计。"
  },
  {
    "id": "43771816",
    "title": "Show HN: Advanced-Alchemy – A framework agnostic library for SQLAlchemy",
    "url": "https://github.com/litestar-org/advanced-alchemy",
    "summary": "Advanced Alchemy is a SQLAlchemy companion library designed to simplify and optimize database interactions in Python applications. It provides both synchronous and asynchronous repositories with common CRUD operations and optimized bulk operations. It integrates with popular web frameworks like Litestar, FastAPI, Flask, Starlette, and Sanic, offering helpers and extensions for seamless integration.\n\nKey features include:\n\n*   Repositories with common CRUD and bulk operations\n*   Services to simplify repository interactions and type conversions\n*   Alembic configuration and CLI tools\n*   Utility base classes with audit columns and primary keys\n*   Built-in file object data type with storage backend support\n*   Optimized JSON types, including Oracle JSON type\n*   Support for UUID6/7 and Nano ID\n*   Tested support for multiple database backends like SQLite, Postgres, MySQL, Oracle, Google Spanner, DuckDB, and Microsoft SQL Server.\n\nThe library offers repository and service classes for simplified data access and manipulation, illustrated through code examples showcasing operations like creating multiple users, paginated data retrieval, and record deletion. The focus is on providing a robust and flexible solution for integrating SQLAlchemy into various Python projects, particularly web applications, while improving developer experience and performance. The project welcomes contributions and offers support through Discord and GitHub discussions.\n",
    "chinese_title": "展示HN：高级炼金术 – SQLAlchemy的与框架无关的库",
    "chinese_summary": "高级炼金术 (Advanced Alchemy) 是一个 SQLAlchemy 伴侣库，旨在简化和优化 Python 应用程序中的数据库交互。它提供同步和异步仓库，具有常见的 CRUD 操作和优化的批量操作。它与流行的 Web 框架（如 Litestar、FastAPI、Flask、Starlette 和 Sanic）集成，提供助手和扩展程序以实现无缝集成。\n\n主要功能包括：\n\n*   具有常见 CRUD 和批量操作的仓库\n*   简化仓库交互和类型转换的服务\n*   Alembic 配置和 CLI 工具\n*   具有审计列和主键的实用程序基类\n*   内置文件对象数据类型，支持存储后端\n*   优化的 JSON 类型，包括 Oracle JSON 类型\n*   支持 UUID6/7 和 Nano ID\n*   经过测试，支持多种数据库后端，如 SQLite、Postgres、MySQL、Oracle、Google Spanner、DuckDB 和 Microsoft SQL Server。\n\n该库提供仓库和服务类，以简化数据访问和操作，并通过代码示例展示了诸如创建多个用户、分页数据检索和记录删除等操作。重点是提供一个强大而灵活的解决方案，用于将 SQLAlchemy 集成到各种 Python 项目（尤其是 Web 应用程序）中，同时改善开发人员体验和性能。该项目欢迎贡献，并通过 Discord 和 GitHub 讨论提供支持。"
  },
  {
    "id": "43747186",
    "title": "Lessons learned operating petabyte-scale ClickHouse clusters: Part II",
    "url": "https://www.tinybird.co/blog-posts/what-i-learned-operating-clickhouse-part-ii",
    "summary": "This article, the second in a series about operating petabyte-scale ClickHouse clusters, focuses on handling read traffic and related operational challenges. It stresses the importance of considering both reads and writes, as ingestion (writes) directly impacts read performance through the number of parts in a table.\n\nThe article covers handling different traffic types (real-time, long-running queries, and backfills), suggesting strategies like using different replicas and application-level load balancing to avoid impacting real-time query latency. Query design is crucial; the author emphasizes optimizing queries by filtering on sorting key columns first, using PREWHERE, and deferring complex operations. Settings like `max_threads`, `max_memory`, and `max_bytes_before_external_group_by` are also discussed.\n\nBackfilling materialized views is highlighted as a potentially problematic area, with the author advising against using `POPULATE` due to data duplication risks. Instead, using a Null table and adjusting batch sizes are recommended.\n\nMonitoring is critical, with emphasis on tracking queries, ZooKeeper/S3 errors, replication lag, and queue lengths. The author highlights key system tables (`system.query_log`, `system.processes`, `system.part_log`) as essential for troubleshooting.\n\nFinally, the author touches on miscellaneous points like the default table deletion behavior, potential issues with materialized views and specific column types, and the importance of carefully managing `ON CLUSTER` operations. Altinity's knowledge base is recommended as a valuable resource for ClickHouse management.\n",
    "chinese_title": "操作 Petabyte 级 ClickHouse 集群的经验教训：第二部分",
    "chinese_summary": "本文是关于运营 PB 级 ClickHouse 集群系列文章的第二篇，重点介绍处理读取流量及相关运维挑战。文章强调了同时考虑读取和写入的重要性，因为摄取（写入）会通过表中的数据分片数量直接影响读取性能。\n\n文章涵盖了处理不同流量类型（实时查询、长时间运行查询和回填），并提出了诸如使用不同副本和应用层负载均衡等策略，以避免影响实时查询延迟。查询设计至关重要；作者强调通过首先按排序键列进行过滤、使用 PREWHERE 以及延迟复杂操作来优化查询。文中还讨论了 `max_threads`、`max_memory` 和 `max_bytes_before_external_group_by` 等设置。\n\n文章重点介绍了回填物化视图可能存在的问题，并建议不要使用 `POPULATE`，因为存在数据重复的风险。相反，建议使用 Null 表并调整批处理大小。\n\n监控至关重要，重点是跟踪查询、ZooKeeper/S3 错误、复制延迟和队列长度。作者强调了关键系统表（`system.query_log`、`system.processes`、`system.part_log`）对于故障排除至关重要。\n\n最后，作者还提到了诸如默认表删除行为、物化视图和特定列类型可能存在的问题以及谨慎管理 `ON CLUSTER` 操作的重要性等杂项。Altinity 的知识库被推荐为 ClickHouse 管理的宝贵资源。"
  },
  {
    "id": "43768421",
    "title": "Native visionOS platform support",
    "url": "https://github.com/godotengine/godot/pull/105628",
    "summary": "This article discusses a proposed contribution to the Godot game engine: native support for Apple's visionOS platform. The contribution, spearheaded by Apple's visionOS engineering team, aims to allow Godot games to run natively on Vision Pro, both in planar windows and through immersive VR experiences using a new visionOS VR Plugin.\n\nThe contribution is structured in three incremental PRs: the first, detailed here, adds the native visionOS platform, largely reusing code from the existing iOS platform by creating a shared \"apple_embedded\" driver. Subsequent PRs will add Swift compilation support for immersive scenes and introduce the Vision Pro VR plugin.\n\nThe authors highlight the extensive testing performed using the Platformer demo project, confirming functionality on both iOS and visionOS with Metal rendering. They also acknowledge some missing functionality like dynamic DPI metrics and automated visionOS icon creation, inviting community contributions.\n\nThe article raises questions regarding documentation tooling and testing of certain features like plugin embedding, archive/IPA export, and direct deployment via ios_deploy.\n\nCommunity members have expressed enthusiasm for the contribution, while also raising concerns about the potential proliferation of platforms and the maintenance burden. Suggestions include unifying the iOS-derived platforms under a single \"ios\" platform within Godot's codebase and using macros for platform-specific code exclusions.\n",
    "chinese_title": "原生 visionOS 平台支持",
    "chinese_summary": "本文讨论了一项拟议的对 Godot 游戏引擎的贡献：原生支持 Apple 的 visionOS 平台。这项贡献由 Apple 的 visionOS 工程团队主导，旨在让 Godot 游戏能够在 Vision Pro 上原生运行，无论是在平面窗口中，还是通过使用新的 visionOS VR 插件实现沉浸式 VR 体验。\n\n这项贡献分为三个增量 PR：第一个 PR（本文详细介绍）添加了原生 visionOS 平台，主要通过创建共享的 \"apple_embedded\" 驱动程序来重用现有 iOS 平台的代码。后续的 PR 将添加对沉浸式场景的 Swift 编译支持，并引入 Vision Pro VR 插件。\n\n作者强调了使用 Platformer 演示项目进行的大量测试，确认了在 iOS 和 visionOS 上使用 Metal 渲染的功能。他们还承认缺少一些功能，如动态 DPI 指标和自动 visionOS 图标创建，并邀请社区贡献。\n\n本文提出了关于文档工具以及某些功能（如插件嵌入、archive/IPA 导出以及通过 ios_deploy 直接部署）的测试的问题。\n\n社区成员对这项贡献表示热情，同时也对平台可能激增和维护负担表示担忧。建议包括将 iOS 衍生的平台统一在 Godot 代码库中的单个 \"ios\" 平台下，并使用宏来排除特定于平台的代码。"
  },
  {
    "id": "43769478",
    "title": "Pixel is a unit of length and area",
    "url": "https://www.nayuki.io/page/pixel-is-a-unit-of-length-and-area",
    "summary": "The article explores the inconsistent use of \"pixel\" as both a unit of length and area in digital imaging, leading to mathematical contradictions when applying dimensional analysis. When calculating area, multiplying pixel length by pixel height should result in square pixels (pixel²), but colloquial usage often treats pixels as dimensionless units where pixel² = pixel = 1.\n\nThe author proposes two imperfect solutions to reconcile this tension:\n\n1.  **Define the pixel as a square:** A pixel is defined as a square with a physical size dependent on the device, and \"pixel-side\" or \"√pixel\" is introduced as the linear unit representing its width and height.\n2.  **Treat the pixel as a unit of length:** In this approach, all area measurements must be expressed as square pixels, avoiding the \"megapixel\" abbreviation in favor of writing out the full number of square pixels or using awkward terms like square kilopixels.\n\nThe author notes that the pixel's non-metric nature and limited involvement in complex calculations mitigate the severity of this inconsistency. The issue mainly highlights the imperfections in common terminology and the deviation from the consistent unit behavior expected in scientific calculations. The author draws an analogy with the conflation of pounds as units of mass and force, contrasting it with the metric system's clear separation of kilograms and newtons.\n",
    "chinese_title": "像素是一种长度和面积的单位。",
    "chinese_summary": "本文探讨了数字成像中“像素”作为长度和面积单位使用时出现的不一致性，导致在应用量纲分析时产生数学矛盾。在计算面积时，像素长度乘以像素高度应得到平方像素（像素²），但口语习惯通常将像素视为无量纲单位，其中像素² = 像素 = 1。\n\n作者提出了两个并不完美的解决方案来调和这种矛盾：\n\n1.  **将像素定义为正方形：** 将像素定义为具有物理尺寸的正方形，该尺寸取决于设备，并引入“像素边长”或“√像素”作为表示其宽度和高度的线性单位。\n2.  **将像素视为长度单位：** 在这种方法中，所有面积测量必须表示为平方像素，避免使用“百万像素”的缩写，而是写出平方像素的完整数字或使用诸如平方千像素之类的笨拙术语。\n\n作者指出，像素的非公制性质以及其在复杂计算中参与程度有限减轻了这种不一致性的严重性。该问题主要突出了常见术语的不完善以及与科学计算中预期的一致单位行为的偏差。作者将此与磅作为质量和力单位的混淆进行类比，并将其与公制系统中千克和牛顿的明确分离进行对比。"
  },
  {
    "id": "43766200",
    "title": "Atuin Desktop: Runbooks That Run",
    "url": "https://blog.atuin.sh/atuin-desktop-runbooks-that-run/",
    "summary": "Atuin Desktop aims to solve the problem of fragmented and unreliable infrastructure workflows by providing a local-first, executable runbook editor for terminal workflows. The current solutions rely on out-of-date documentation, Slack threads, and individual shell histories, leading to inconsistencies and difficulty in repeating tasks.\n\nAtuin Desktop allows users to create repeatable, shareable, and reliable workflows by combining documentation with executable code. It offers features like script blocks, embedded terminals, database clients, and Prometheus charts within a single interface, eliminating context switching. Runbooks are dynamic with Jinja-style templating, and autocomplete from shell history enables instant recall. It is local-first and CRDT-powered, syncing and sharing via Atuin Hub.\n\nThe Atuin team is already using Atuin Desktop for releasing their CLI, migrating infrastructure, spinning up environments, and managing database queries. Future plans include team accounts for enhanced collaboration and automatic runbook generation from shell history. Atuin Desktop promises to replace copy-pasting from Notion and Slack with an organized and efficient way to manage infrastructure and operations.\n",
    "chinese_title": "Atuin Desktop: 可执行的行动手册",
    "chinese_summary": "Atuin Desktop 旨在解决碎片化和不可靠的基础设施工作流程问题，它提供了一个本地优先的、可执行的终端工作流程手册编辑器。当前解决方案依赖于过时的文档、Slack 讨论串以及个人的 shell 历史记录，导致不一致性和任务重复执行的困难。\n\nAtuin Desktop 允许用户通过将文档与可执行代码相结合，来创建可重复、可共享且可靠的工作流程。它在一个界面中提供了脚本块、嵌入式终端、数据库客户端和 Prometheus 图表等功能，消除了上下文切换。手册具有 Jinja 风格的模板进行动态更新，并且来自 shell 历史记录的自动完成功能可以实现即时调用。它是本地优先的，并由 CRDT 提供支持，通过 Atuin Hub 进行同步和共享。\n\nAtuin 团队已经在使用 Atuin Desktop 来发布他们的 CLI、迁移基础设施、启动环境以及管理数据库查询。未来的计划包括用于增强协作的团队帐户，以及从 shell 历史记录自动生成手册。Atuin Desktop 承诺用一种有组织且高效的方式来管理基础设施和运营，从而取代从 Notion 和 Slack 复制粘贴的方式。"
  },
  {
    "id": "43734911",
    "title": "Solidjs: Simple and performant reactivity for building user interfaces",
    "url": "https://www.solidjs.com/",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "Solidjs: 构建用户界面的简单高性能响应式方案",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "43770337",
    "title": "Apple and Meta fined millions for breaching EU law",
    "url": "https://ca.finance.yahoo.com/news/apple-fined-570-million-meta-094701712.html",
    "summary": "The EU has fined Apple 500 million euros and Meta 200 million euros for violating the Digital Markets Act (DMA), landmark legislation aimed at curbing the power of Big Tech. This marks the first sanctions under the DMA, introduced in 2023. The EU Commission found that Apple restricted app developers from directing users to cheaper deals outside the App Store and that Meta's \"pay-or-consent\" model for Facebook and Instagram users breached the DMA, as it was in place up to November 2024.\n\nApple and Meta have criticized the decisions and plan to challenge the fines. Apple argues the EU is unfairly targeting them, while Meta claims the decision disadvantages American businesses and forces an inferior service. The EU maintains it's enforcing clear rules and that all companies operating within the EU must comply with its laws and respect European values.\n\nThe fines are considered modest compared to past EU antitrust penalties. The EU competition watchdog said Apple must remove the imposed restrictions and Meta's new version will be assesed to determine if it is DMA compliant. The companies have two months to comply or face further fines. While Apple avoided a fine in a separate browser options investigation, it was still charged with hindering sideloading. Meta's Marketplace also had it's DMA designation dropped as the number of users fell below the required threshold. The EU is encouraged by a U.S. court judgment against Google's ad tech practices and is urged to continue investigations into Google and X.\n",
    "chinese_title": "苹果和Meta因违反欧盟法律被处以数百万美元罚款",
    "chinese_summary": "欧盟因违反《数字市场法案》(DMA) 对苹果处以 5 亿欧元罚款，对 Meta 处以 2 亿欧元罚款。该法案旨在遏制大型科技公司的权力，是具有里程碑意义的立法。这是 2023 年推出 DMA 后的首次制裁。欧盟委员会发现，苹果限制应用程序开发商引导用户到 App Store 以外的更便宜的交易，并且 Meta 针对 Facebook 和 Instagram 用户的“付费或同意”模式违反了 DMA，因为该模式一直持续到 2024 年 11 月。\n\n苹果和 Meta 批评了这些决定，并计划对罚款提出质疑。苹果辩称，欧盟对其进行不公平的针对，而 Meta 声称该决定不利于美国企业，并迫使其提供劣质服务。欧盟坚称，它正在执行明确的规则，所有在欧盟运营的公司都必须遵守其法律并尊重欧洲价值观。\n\n与欧盟过去的反垄断处罚相比，这些罚款被认为是适度的。欧盟竞争监管机构表示，苹果必须取消实施的限制，Meta 的新版本将被评估以确定是否符合 DMA。两家公司有两个月的时间遵守规定，否则将面临进一步的罚款。虽然苹果在另一项浏览器选项调查中避免了罚款，但仍被指控阻碍侧载。Meta 的 Marketplace 也因用户数量低于所需阈值而取消了 DMA 认定。欧盟受到美国法院对谷歌广告技术行为判决的鼓舞，并被敦促继续调查谷歌和 X。"
  },
  {
    "id": "43770228",
    "title": "Sixty Years On, We Still Dream of the Arrow",
    "url": "https://watershedmagazine.com/features/sixty-years-on-we-still-dream-of-the-arrow/",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "六十年后，我们仍梦想着箭。",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "43739374",
    "title": "Understand Your Dependencies",
    "url": "https://deps.dev/",
    "summary": "This appears to be a partial representation of the Open Source Insights tool, suggesting a focus on understanding software dependencies. The tool likely helps developers and security professionals:\n\n*   **Visualize and analyze software dependencies:** Open Source Insights likely provides a way to see the full chain of dependencies within a software project, including direct and transitive dependencies.\n*   **Identify potential risks:** This analysis allows users to identify potential security vulnerabilities, licensing issues, or other risks associated with the included open-source components.\n*   **Manage and control dependencies:** By providing insights into these dependencies, the tool aids in making informed decisions about which libraries and components to include in a project and how to manage their versions.\n*   **Enable JavaScript is a core requirement:** This suggests that the tool is web-based and utilizes JavaScript for interactive functionality and data visualization.\n\nWithout further information, it's difficult to elaborate, but the primary purpose of Open Source Insights is to offer a comprehensive understanding of the open-source dependencies used in a project, empowering users to make informed decisions about security, licensing, and maintenance.\n",
    "chinese_title": "了解您的依赖关系",
    "chinese_summary": "这似乎是开源洞察工具的部分展示，表明其重点在于理解软件依赖关系。该工具可能帮助开发者和安全专业人员：\n\n*   **可视化和分析软件依赖关系：** 开源洞察可能提供了一种查看软件项目中完整依赖链的方式，包括直接和传递依赖。\n*   **识别潜在风险：** 这种分析允许用户识别潜在的安全漏洞、许可问题或与包含的开源组件相关的其他风险。\n*   **管理和控制依赖关系：** 通过提供对这些依赖关系的洞察，该工具帮助用户在决定项目中包含哪些库和组件以及如何管理其版本时做出明智的决策。\n*   **启用JavaScript是核心\n\n在没有更多信息的情况下，很难详细说明，但开源洞察的主要目的是提供对项目中使用的开源依赖关系的全面理解，使使用者能够在安全性、许可和维护方面做出明智的决策。"
  },
  {
    "id": "43769461",
    "title": "Why Does My eBPF Program Work on One Kernel but Fail on Another?",
    "url": "https://ebpfchirp.substack.com/p/why-does-my-ebpf-program-work-on",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "为什么我的eBPF程序在一个内核上工作却在另一个内核上失败？",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "43770446",
    "title": "Geocoding APIs compared: Pricing, free tiers and terms of use",
    "url": "https://www.bitoff.org/geocoding-apis-comparison/",
    "summary": "This article compares several geocoding APIs based on pricing, free tiers, and terms of use, aiming to help readers choose the most suitable option for their projects. It examines HERE, Google Maps Platform, Azure Maps, OpenCage, TomTom Maps, LocationIQ, and Nominatim, focusing on the number of free requests, rate limits, and cost per 1,000 requests. The author emphasizes that the comparison is neutral, as their company, Superface, provides a universal API client that works with multiple geocoding APIs without favoring any single provider.\n\nThe article highlights the strengths and weaknesses of each API in terms of cost. Azure Maps and Google Maps are noted as more expensive options, while OpenCage and LocationIQ offer fixed-price monthly plans, with LocationIQ having a more generous free tier and cheaper plans for higher usage. TomTom Maps is presented as a cost-effective option for uneven usage, offering a large number of free requests daily without a monthly subscription. HERE is suitable for high-volume usage before needing an enterprise plan. Finally, Nominatim is presented as a free, community-driven option best for small, non-commercial projects. The author concludes that LocationIQ provides a very competitive offering at scale, TomTom is well suited to lower volume/inconsistent usage, and HERE can be ideal for very high usage at a stable price point. The article also includes resources for further research and a note about a recent update.\n",
    "chinese_title": "地理编码API对比：定价、免费额度和使用条款",
    "chinese_summary": "本文对比了几种地理编码API，包括定价、免费层级和使用条款，旨在帮助读者为其项目选择最合适的选项。它考察了HERE、Google Maps Platform、Azure Maps、OpenCage、TomTom Maps、LocationIQ和Nominatim，重点关注免费请求数量、速率限制和每1000次请求的成本。作者强调该比较是中立的，因为其公司Superface提供一个通用的API客户端，可以与多个地理编码API配合使用，而不偏袒任何单一供应商。\n\n文章强调了每种API在成本方面的优缺点。Azure Maps和Google Maps被认为是更昂贵的选择，而OpenCage和LocationIQ提供固定价格的月度计划，其中LocationIQ具有更慷慨的免费层级和更便宜的更高使用量计划。TomTom Maps被认为是适用于不均衡使用的具有成本效益的选项，每天提供大量免费请求，无需每月订阅。HERE适用于需要企业计划之前的大量使用。最后，Nominatim被认为是一个免费的、社区驱动的选项，最适合小型非商业项目。作者得出结论，LocationIQ在大规模使用时提供了极具竞争力的产品，TomTom非常适合低容量/不一致的使用，而HERE可能是以稳定的价格实现非常高使用量的理想选择。文章还包括供进一步研究的资源以及关于最近更新的说明。"
  },
  {
    "id": "43765011",
    "title": "Sapphire: Rust based package manager for macOS",
    "url": "https://github.com/alexykn/sapphire",
    "summary": "Sapphire is a new, experimental package manager for macOS, written in Rust and inspired by Homebrew. Currently in alpha and potentially unstable, it aims to manage both command-line tools (Formulae) and desktop applications (Casks). It's currently ARM-only, with potential x86 support in the future.\n\nThe project consists of `sapphire-core` (the core library handling package management logic) and `sapphire-cli` (the command-line interface).\n\nKey features currently implemented include bottle and cask installation/uninstallation, parallel downloads/installs, automatic dependency resolution, and initial support for building Formulae from source.\n\nThe roadmap includes `upgrade`, `cleanup`, `reinstall`, and `init` commands, prefix isolation, and ongoing bug fixes.\n\nBasic usage involves commands like `sapphire --help`, `update`, `search`, `info`, `install`, and `uninstall`. Building from source requires a Rust toolchain and involves cloning the repository and running `cargo build --release`.\n\nContributions are welcome, particularly in testing, bug reporting, test coverage, and CLI improvements. The project is licensed under the BSD-3-Clause license. Be aware that it is alpha software with no guarantees.\n",
    "chinese_title": "蓝宝石：基于 Rust 的 macOS 包管理器",
    "chinese_summary": "Sapphire：macOS 平台的新型实验性软件包管理器，使用 Rust 编写，灵感来源于 Homebrew。目前处于 Alpha 阶段，可能不稳定，旨在管理命令行工具（Formulae）和桌面应用程序（Casks）。目前仅支持 ARM 架构，未来可能支持 x86 架构。\n\n该项目由 `sapphire-core`（处理软件包管理逻辑的核心库）和 `sapphire-cli`（命令行界面）组成。\n\n目前已实现的关键功能包括 bottle 和 cask 的安装/卸载、并行下载/安装、自动依赖关系解析，以及初步支持从源代码构建 Formulae。\n\n路线图包括 `upgrade`、`cleanup`、`reinstall` 和 `init` 命令、前缀隔离以及持续的错误修复。\n\n基本用法涉及 `sapphire --help`、`update`、`search`、`info`、`install` 和 `uninstall` 等命令。从源代码构建需要 Rust 工具链，包括克隆存储库并运行 `cargo build --release`。\n\n欢迎贡献，尤其是在测试、错误报告、测试覆盖率和 CLI 改进方面。该项目采用 BSD-3-Clause 许可证。请注意，它是 Alpha 软件，不提供任何保证。"
  },
  {
    "id": "43769936",
    "title": "The Gruen Transfer is consuming the internet",
    "url": "https://sebs.website/blog/the%20gruen-transfer-is-consuming-the-internet",
    "summary": "Sebastian David Lees' blog post, \"The Gruen Transfer is consuming the internet,\" discusses how the Gruen Transfer, the deliberate disorientation of consumers to encourage impulse purchases, has expanded from physical stores to online spaces. He explains how platforms like Facebook, initially designed for simple updates, have become cluttered with ads and irrelevant content, leading users to lose focus and \"doom scroll.\"\n\nThis phenomenon extends beyond social media, impacting website design, where intentional complexity and \"UX dark patterns\" are used to hinder users from completing specific tasks, like deleting accounts or canceling subscriptions. Lees argues that this unnecessary complexity might eventually become detrimental, suggesting a \"Laffer Curve of web design\" where increased friction negatively impacts the user experience.\n\nHe highlights the EU's legislation requiring equal ease for subscribing and unsubscribing from services, advocating for \"complexity\" as a measure for legislation to protect consumers. Lees concludes by lamenting the pervasive nature of the Gruen Transfer, wishing for similar regulations to be applied to everyday experiences like shopping in physical stores.\n",
    "chinese_title": "格林效应席卷互联网",
    "chinese_summary": "塞巴斯蒂安·戴维·李斯博文“格鲁恩效应正在吞噬互联网”探讨了格鲁恩效应（即故意让消费者迷失方向以鼓励冲动消费）如何从实体店扩展到线上空间。他解释了诸如Facebook等最初旨在进行简单更新的平台，如何变得充斥着广告和无关内容，导致用户失去焦点并“末日滚动”。\n\n这种现象超越了社交媒体，影响了网站设计，其中故意采用的复杂性和“UX黑暗模式”会阻碍用户完成特定任务，例如删除帐户或取消订阅。李斯认为，这种不必要的复杂性最终可能会产生不利影响，并提出了一个“网络设计的拉弗曲线”，其中摩擦力的增加会对用户体验产生负面影响。\n\n他强调了欧盟立法要求订阅和取消订阅服务同样容易，并主张将“复杂性”作为立法保护消费者的衡量标准。李斯最后感叹格鲁恩效应的普遍性，希望类似的法规也能应用于日常生活中的体验，比如在实体店购物。"
  },
  {
    "id": "43746868",
    "title": "Physicists Designed a Quantum Rubik's Cube and Found the Best Way to Solve It",
    "url": "https://www.sciencealert.com/physicists-designed-a-quantum-rubiks-cube-and-found-the-best-way-to-solve-it",
    "summary": "Physicists at the University of Colorado Boulder have designed a \"quantum Rubik's cube,\" a permutation puzzle that, unlike the classical Rubik's cube with its finite combinations, possesses infinite possible states due to the introduction of quantum superpositions. In this quantum version, a tile can be both moved and not moved simultaneously.\n\nThe researchers tested this concept on a simplified 2x2 grid puzzle with blue and green tiles, tasking classical, quantum, and combined solvers to arrange the tiles into a solved state. The classical solver could only swap adjacent tiles, the quantum solver could only use superpositions, and the combined solver could use either.\n\nThe combined solver, unsurprisingly, performed best, solving the puzzle in fewer moves on average. While the classical solver could sometimes reach the solution in fewer moves than the quantum solver, its average was higher due to occasional lengthy solutions. The quantum solver demonstrated more consistent, though slightly longer, solutions.\n\nThe key difference lies in the quantum advantage: The classical solver has to rely on the random collapse of superpositions into a solved state, while the quantum solver can directly manipulate these superpositions. The team also created a 3D version of the puzzle. While practical quantum puzzles could be built using ultracold atoms, the main purpose is theoretical exploration for mathematicians.\n",
    "chinese_title": "物理学家设计出量子魔方并找到了最佳解法",
    "chinese_summary": "科罗拉多大学博尔德分校的物理学家设计了一种“量子魔方”，这是一种置换谜题，与经典魔方有限的组合不同，它由于引入了量子叠加而具有无限可能的态。在这个量子版本中，一个方块可以同时处于移动和不移动的状态。\n\n研究人员在一个简化的2x2蓝色和绿色方块拼图中测试了这个概念，他们要求经典、量子和组合求解器将方块排列成已解决的状态。经典求解器只能交换相邻的方块，量子求解器只能使用叠加态，而组合求解器可以使用两者。\n\n不出所料，组合求解器的表现最好，平均步数更少。虽然经典求解器有时可以用比量子求解器更少的步数达到解决方案，但由于偶尔出现冗长的解决方案，其平均值更高。量子求解器表现出更一致，但稍长的解决方案。\n\n关键的区别在于量子优势：经典求解器必须依赖于叠加态随机坍缩成已解决的状态，而量子求解器可以直接操纵这些叠加态。该团队还创建了一个3D版本的拼图。虽然实际的量子拼图可以使用超冷原子构建，但其主要目的是为数学家进行理论探索。"
  },
  {
    "id": "43747283",
    "title": "Restoring Old Software for Child Learning Safety",
    "url": "https://rietta.com/blog/child-learning-with-old-software/",
    "summary": "This article discusses the author's endeavor to restore old software, particularly educational games from the Windows 3.1 and DOS eras, for their children's learning. Concerned about the risks of modern web applications and excessive internet exposure, the author aims to provide a safer, publisher-independent learning environment.\n\nThe author's approach involves restoring old software from original media or shareware archives using a QEMU virtual machine on a Linux host. They highlight the user interface advantages of older software, citing WordPerfect 6 as an example of its discoverability and focus.\n\nA key example is the DOS game \"1st Math,\" which the author's 4-year-old enjoys. The author appreciates how the game promotes counting, number recognition, and fine motor skills through keyboard interaction, a stark contrast to the tap-and-swipe nature of modern iPad games. They also discuss the benefits of \"Freight Depot\" for developing keyboard skills.\n\nThe author's long-term goal is to create a dedicated \"old computer\" setup for their children, free from the dangers of the internet, advertising, and cyberbullying. They also intend to contribute to software preservation efforts by digitizing and making available old educational content. The author concludes by inviting feedback from other parents about their approaches to children's educational software, and with a humorous aside about the game SkiFree.\n",
    "chinese_title": "恢复旧软件，保障儿童学习安全",
    "chinese_summary": "本文探讨了作者致力于恢复旧软件的努力，特别是Windows 3.1和DOS时代的教育游戏，以供其子女学习。作者担心现代Web应用程序的风险以及过度接触互联网的问题，旨在提供一个更安全、独立于出版商的学习环境。\n\n作者的方法包括在Linux主机上使用QEMU虚拟机，从原始介质或共享软件档案中恢复旧软件。他们强调了旧软件的用户界面优势，并以WordPerfect 6为例，说明其易发现性和专注性。\n\n一个关键的例子是DOS游戏“1st Math”，作者的4岁孩子非常喜欢。作者赞赏该游戏如何通过键盘互动来促进计数、数字识别和精细运动技能，这与现代iPad游戏的点击和滑动特性形成鲜明对比。他们还讨论了“Freight Depot”在培养键盘技能方面的益处。\n\n作者的长期目标是为孩子们创建一个专用的“旧电脑”设置，使其免受互联网、广告和网络欺凌的危害。他们还打算通过数字化和提供旧的教育内容，为软件保存工作做出贡献。作者最后邀请其他家长分享他们对儿童教育软件的方法，并幽默地提到了游戏SkiFree。"
  },
  {
    "id": "43766715",
    "title": "CSS Hell",
    "url": "https://csshell.com/",
    "summary": "The provided content \"CSS Hell\" appears to be a placeholder indicating a problem with a web application. It simply states \"CSS Hell\" as a title and then informs the user that JavaScript is required to run the application.\n\nTherefore, there is no actual article content to summarize. The page isn't presenting information about the pitfalls of CSS or best practices. It is merely signaling a problem where JavaScript, a fundamental technology for many web applications, is disabled or not functioning correctly in the user's browser.\n",
    "chinese_title": "CSS 地狱",
    "chinese_summary": "提供的“CSS 地狱”内容似乎是一个占位符，表明 Web 应用程序存在问题。它仅将“CSS 地狱”作为标题，然后告知用户需要 JavaScript 才能运行该应用程序。\n\n因此，没有实际的文章内容可供总结。该页面没有介绍 CSS 的陷阱或最佳实践。它仅仅是在发出一个信号，表明 JavaScript（许多 Web 应用程序的一项基本技术）在用户的浏览器中被禁用或未正常运行。"
  },
  {
    "id": "43763688",
    "title": "ClickHouse gets lazier and faster: Introducing lazy materialization",
    "url": "https://clickhouse.com/blog/clickhouse-gets-lazier-and-faster-introducing-lazy-materialization",
    "summary": "This article introduces lazy materialization, a new optimization in ClickHouse that significantly improves query performance, especially for Top N queries. Lazy materialization delays reading column data until it's absolutely necessary during query execution. This means ClickHouse only loads the columns needed for immediate operations like sorting, deferring the rest. This is especially effective when combined with LIMIT clauses, as much of the data in larger columns may never need to be read.\n\nThe article highlights ClickHouse's existing I/O optimization stack, which includes columnar storage, sparse primary indexes, secondary data-skipping indexes, projections, and PREWHERE clauses. These techniques reduce I/O by skipping unnecessary columns and pruning irrelevant data granules and rows. Lazy materialization complements these existing optimizations by ensuring that even after filtering, only the minimum required column data is loaded at each step.\n\nA real-world example using the Amazon customer reviews dataset demonstrates the impact. A query retrieving top 5-star ebook reviews, initially taking 219 seconds with a full scan, improves drastically as each optimization layer is enabled. Lazy materialization played a key role in minimizing I/O by deferring the loading of large text columns (product_title, review_headline, review_body) until after sorting and applying the LIMIT clause. The article detailed how columnar storage is crucial for enabling this deferred I/O optimization.\n",
    "chinese_title": "ClickHouse变得更懒更高效：引入延迟物化",
    "chinese_summary": "本文介绍了延迟物化，ClickHouse 中的一项新的优化技术，它能显著提升查询性能，尤其是在 Top N 查询中。 延迟物化会延迟读取列数据，直到查询执行期间绝对必要时才读取。 这意味着 ClickHouse 只加载用于排序等即时操作所需的列，而推迟加载其余列。 这与 LIMIT 子句结合使用时尤其有效，因为较大列中的许多数据可能永远不需要读取。\n\n本文重点介绍了 ClickHouse 现有的 I/O 优化堆栈，其中包括列式存储、稀疏主键索引、二级数据跳过索引、投影和 PREWHERE 子句。 这些技术通过跳过不必要的列和修剪不相关的数据粒度和行来减少 I/O。 延迟物化是对这些现有优化的补充，它可以确保即使在过滤之后，也只在每个步骤加载所需的最小列数据。\n\n一个使用亚马逊客户评论数据集的真实示例展示了其影响。 一个检索排名最高的五星级电子书评论的查询，最初需要 219 秒才能完成完整扫描，但随着每个优化层的启用，其性能得到了显著提高。 延迟物化在最大限度地减少 I/O 方面发挥了关键作用，它将大型文本列（product_title、review_headline、review_body）的加载推迟到排序和应用 LIMIT 子句之后。 本文详细介绍了列式存储对于启用这种延迟 I/O 优化至关重要。"
  },
  {
    "id": "43746532",
    "title": "Demystifying decorators: They don't need to be cryptic",
    "url": "https://www.thepythoncodingstack.com/p/demystifying-python-decorators",
    "summary": "This article demystifies Python decorators by breaking down the concept into manageable parts, focusing on closures and decorator introduction in the first two sections.\n\nPart 1 explains closures by illustrating how to keep track of arguments passed to a function, `print()`, without using global variables. It demonstrates the limitations of local and global variables, and introduces the concept of a closure: an inner function accessing variables from its enclosing function's scope. This allows a function to access data that persists across multiple calls, enabling \"communication\" between calls. The article shows how to access the closed-over data using the `.__closure__` attribute, albeit in a less direct manner.\n\nPart 2 builds on the understanding of closures to introduce decorators. It highlights how the earlier code already embodies aspects of a decorator, which enhances the functionality of a function. The article then refactors the code to create a reusable decorator that can be applied to any function, not just `print()`. This is achieved by: renaming the outer function to `store_arguments()`, adding a `func` parameter to the outer function to represent the function to be decorated, and allowing the inner function to accept any number of arguments. The article leads towards creating a more generic and reusable decorator, paving the way for more advanced decorator features to be discussed in subsequent parts.\n",
    "chinese_title": "揭秘装饰器：它们不必晦涩难懂",
    "chinese_summary": "本文旨在通过将概念分解为易于理解的部分来揭开Python装饰器的神秘面纱，前两部分重点介绍闭包和装饰器入门。\n\n第一部分解释了闭包，通过演示如何在不使用全局变量的情况下跟踪传递给函数 `print()` 的参数来说明。它展示了局部变量和全局变量的局限性，并介绍了闭包的概念：一个内部函数访问其封闭函数作用域中的变量。这使得函数可以访问在多次调用中持续存在的数据，从而实现调用之间的“通信”。文章展示了如何使用 `.__closure__` 属性访问封闭数据，尽管方式不太直接。\n\n第二部分以对闭包的理解为基础，介绍装饰器。它强调了之前的代码已经体现了装饰器的各个方面，即增强函数的功能。然后，文章重构了代码，创建了一个可重用的装饰器，可以应用于任何函数，而不仅仅是 `print()`。这通过以下方式实现：将外部函数重命名为 `store_arguments()`，向外部函数添加一个 `func` 参数来表示要装饰的函数，并允许内部函数接受任意数量的参数。文章引导读者创建一个更通用和可重用的装饰器，为后续部分讨论更高级的装饰器特性铺平了道路。"
  },
  {
    "id": "43774187",
    "title": "WhatsApp defends 'optional' AI tool that cannot be turned off",
    "url": "https://www.bbc.com/news/articles/cd7vzw78gz9o",
    "summary": "WhatsApp is facing criticism for its new AI feature, Meta AI, which is embedded in the messaging service but cannot be removed, despite being labeled \"optional.\" The feature appears as a blue circle on the Chats screen and provides a chatbot powered by Llama 4 to answer user questions.\n\nUsers have expressed frustration on social media about the inability to disable the feature. Privacy advocates like Dr. Kris Shrishak accuse Meta of exploiting its market position and using people as test subjects for AI, claiming the AI models are a privacy violation due to data scraping, including potentially pirated books.\n\nMeta defends the feature, stating it is \"entirely optional\" and that user feedback is being considered. They also clarify that Meta AI can only read messages shared directly with the chatbot, and that personal chats remain end-to-end encrypted.\n\nHowever, concerns remain about data privacy and the use of personal information to train AI models. The Information Commissioner's Office is monitoring Meta AI's technology and data usage, particularly regarding the data of children. Users are advised to be cautious about the information they share with Meta AI, as it could be retained and used by the AI. The article also touches on a controversy surrounding Meta's alleged use of pirated books to train its AI models.\n",
    "chinese_title": "WhatsApp 辩称无法关闭的“可选”人工智能工具",
    "chinese_summary": "WhatsApp因其新的AI功能Meta AI而面临批评，该功能嵌入消息服务中但无法移除，尽管其被标记为“可选”。该功能在聊天屏幕上显示为一个蓝色圆圈，并提供由Llama 4驱动的聊天机器人来回答用户问题。\n\n用户在社交媒体上表达了对无法禁用该功能的沮丧。像Kris Shrishak博士这样的隐私倡导者指责Meta利用其市场地位，并将人们用作AI的测试对象，声称AI模型由于数据抓取（包括潜在的盗版书籍）而侵犯隐私。\n\nMeta为该功能辩护，称其“完全可选”，并表示正在考虑用户反馈。他们还澄清说，Meta AI只能读取直接与聊天机器人共享的消息，并且个人聊天仍然是端到端加密的。\n\n然而，人们仍然担心数据隐私以及使用个人信息来训练AI模型的问题。信息专员办公室正在监控Meta AI的技术和数据使用情况，特别是关于儿童的数据。建议用户对与Meta AI共享的信息保持谨慎，因为它可能被AI保留和使用。文章还涉及了围绕Meta涉嫌使用盗版书籍来训练其AI模型的一项争议。"
  },
  {
    "id": "43763614",
    "title": "Algebraic Semantics for Machine Knitting",
    "url": "https://uwplse.org/2025/03/31/Algebraic-Knitting.html",
    "summary": "Nat Hurtig's blog post explores the challenge of developing formal semantics for machine knitting, aiming to enable automated analysis and optimization like those used in traditional programming languages. Unlike traditional languages, machine knitting lacks rigorous semantics, hindering tasks like compiler optimization and program equivalence checking.\n\nThe post highlights the complexities introduced by the 3D nature of knitting, where over/under crossings of strands can create dependencies and prevent operations from commuting, even without direct data dependencies. Existing semantics based on knot theory, while mathematically rigorous, are not directly usable by computers due to their reliance on continuous deformations.\n\nThe author proposes leveraging algebraic topology, specifically the braid group, as a potential solution. The braid group uses algebraic structures to represent topological objects, like strands crossing each other, in a way that computers can process. The braid group uses generators and relations to define when two braids are equivalent.\n\nThe ultimate goal is to create a system where computers can reason about the behavior of machine knitting programs, leading to automated optimization, error checking, and other benefits similar to those enjoyed by traditional programming languages. The post draws interesting parallels between machine knitting, quantum computing, and the challenges of reasoning about spatial relationships in computation.\n",
    "chinese_title": "机器编织的代数语义",
    "chinese_summary": "Nat Hurtig的博文探讨了为电脑针织开发形式语义的挑战，旨在实现类似于传统编程语言中的自动化分析和优化。与传统语言不同，电脑针织缺乏严谨的语义，阻碍了编译器优化和程序等价性检查等任务。\n\n该博文强调了针织的3D特性带来的复杂性，其中线段的上下交叉会产生依赖关系，并阻止操作交换，即使没有直接的数据依赖性。现有的基于纽结理论的语义，虽然在数学上很严谨，但由于其依赖于连续形变，计算机无法直接使用。\n\n作者提出利用代数拓扑，特别是辫群，作为一种潜在的解决方案。辫群使用代数结构来表示拓扑对象，例如相互交叉的线段，以一种计算机可以处理的方式。辫群使用生成元和关系来定义何时两个辫子是等价的。\n\n最终目标是创建一个系统，让计算机可以推理电脑针织程序的行为，从而实现自动化优化、错误检查以及其他与传统编程语言类似的优势。该博文将电脑针织、量子计算以及计算中关于空间关系推理的挑战进行了有趣的类比。"
  },
  {
    "id": "43766255",
    "title": "Onyx (YC W24) Is Hiring for ML Engineer",
    "url": "https://www.ycombinator.com/companies/onyx/jobs/3Se5ptG-machine-learning-engineer",
    "summary": "Onyx, a Y Combinator (W24) backed startup developing an open-source GenAI platform, is seeking a Machine Learning Engineer to join their team in San Francisco. Onyx aims to be the \"knowledge layer on top of LLMs,\" improving agent and knowledge retrieval capabilities to solve complex QA and RAG problems.\n\nThe role involves evaluating and implementing advanced techniques like LLM-based knowledge graphs, advanced RAG, LLM agents, and information retrieval algorithms. The engineer will also contribute to user experience enhancements through personalized search, SME suggestions, and building a semantic understanding of organizational priorities. Collaboration with founders and the Head of AI will be key in shaping product direction and AI/ML engineering strategy.\n\nSuccessful candidates will have 3+ years of AI/ML experience, proficiency in PyTorch/Tensorflow, NLP models, and a strong software engineering background, including web frameworks and relational databases. Knowledge of Typescript/React/NextJS, Python, and Postgres is a bonus, as is interest in technical blogging.\n\nThe interview process includes a phone screen, ML interview, practical coding interview, and a compensated in-person work trial.\n\nOnyx has raised a $10M seed round led by Khosla Ventures and First Round Capital, and counts Netflix, Ramp, and Applied Intuition among its customers, with strong open source users like Roku, Zendesk, and L3Harris. They are building a platform that connects to company documents and apps, providing a centralized place for users to ask questions.\n",
    "chinese_title": "Onyx (YC W24) 招聘机器学习工程师",
    "chinese_summary": "Onyx，一家由 Y Combinator (W24) 支持的初创公司，正在开发一个开源的 GenAI 平台，现于旧金山招聘机器学习工程师。Onyx 旨在成为“LLM 之上的知识层”，提升代理和知识检索能力，以解决复杂的 QA 和 RAG 问题。\n\n该职位涉及评估和实施先进技术，如基于 LLM 的知识图谱、高级 RAG、LLM 代理和信息检索算法。工程师还将通过个性化搜索、SME 建议以及构建对组织优先事项的语义理解，为用户体验的提升做出贡献。与创始人和 AI 负责人的合作将在塑造产品方向和 AI/ML 工程战略方面发挥关键作用。\n\n成功的候选人将拥有 3 年以上的 AI/ML 经验，精通 PyTorch/Tensorflow、NLP 模型，并具有扎实的软件工程背景，包括 Web 框架和关系数据库。 熟悉 Typescript/React/NextJS、Python 和 Postgres 者优先考虑，对技术博客感兴趣者亦佳。\n\n面试流程包括电话面试、ML 面试、实际编码面试和有偿的现场工作试用。\n\nOnyx 已获得由 Khosla Ventures 和 First Round Capital 领投的 1000 万美元种子轮融资，其客户包括 Netflix、Ramp 和 Applied Intuition，并拥有像 Roku、Zendesk 和 L3Harris 这样的强大的开源用户。他们正在构建一个连接到公司文档和应用程序的平台，为用户提供一个集中的提问场所。"
  },
  {
    "id": "43763967",
    "title": "Show HN: Rowboat – Open-source IDE for multi-agent systems",
    "url": "https://github.com/rowboatlabs/rowboat",
    "summary": "Rowboat is an open-source IDE designed to streamline the creation and deployment of multi-agent systems. Powered by OpenAI's Agents SDK, it allows users to rapidly prototype and build these systems, often within minutes. The core functionality centers around a copilot that translates natural language ideas into functional multi-agent workflows.\n\nKey features include the ability to connect to MCP (Multi-Computer Programs) servers and import tools, and integration options using either an HTTP API or a Python SDK. This allows developers to seamlessly incorporate Rowboat-created agents into existing applications.\n\nThe quickstart guide provides instructions on setting up Rowboat using Docker after cloning the GitHub repository. The demo highlights the ease of creating multi-agent assistants with MCP tools. The provided code snippets showcase both the HTTP API (using `curl`) and the Python SDK for interacting with agents, demonstrating how to send messages and receive responses. Rowboat aims to simplify the often complex process of building multi-agent systems by providing a user-friendly IDE and flexible integration options.\n",
    "chinese_title": "Show HN: Rowboat – 多智能体系统的开源IDE",
    "chinese_summary": "Rowboat：简化多智能体系统创建和部署的开源IDE。它由OpenAI的Agents SDK驱动，使用户能够快速原型设计和构建这些系统，通常只需几分钟。其核心功能围绕着一个能将自然语言想法转化为功能性多智能体工作流程的副驾驶展开。\n\n主要功能包括连接到MCP（多计算机程序）服务器和导入工具的能力，以及使用HTTP API或Python SDK的集成选项。这使开发人员能够无缝地将Rowboat创建的智能体集成到现有应用程序中。\n\n快速入门指南提供了克隆GitHub存储库后使用Docker设置Rowboat的说明。该演示突出了使用MCP工具轻松创建多智能体助手的过程。提供的代码片段展示了HTTP API（使用`curl`）和Python SDK，用于与智能体交互，演示了如何发送消息和接收响应。Rowboat旨在通过提供用户友好的IDE和灵活的集成选项，简化通常复杂的多智能体系统构建过程。"
  },
  {
    "id": "43771645",
    "title": "How I Blog with Obsidian, Hugo, GitHub, and Cloudflare – Zero Cost, Fully Owned",
    "url": "https://ingau.me/blog/how-i-write-my-blogs-in-obsidian-and-publish-instantly/",
    "summary": "This blog post details a workflow for writing and publishing blog posts using Obsidian, Hugo, GitHub, and Cloudflare Pages, emphasizing a zero-cost, fully-owned system. The author describes how they use Obsidian for writing due to its local-first model and distraction-free interface, syncing notes across devices via iCloud.\n\nThe publishing process involves Hugo with the Bear Blog theme for a fast and minimal website, deployed via GitHub and Cloudflare Pages. This setup provides full control, avoiding subscriptions, vendor lock-in, and platform dependency.\n\nThe setup process includes:\n\n1.  Installing Hugo and creating a new site with the Bear Blog theme.\n2.  Connecting Obsidian by opening the Hugo site's content/blog folder as an Obsidian vault, allowing direct writing into the Hugo directory.\n3.  Using a consistent front matter template in Obsidian posts, including a `draft` flag for easy toggling.\n4.  Previewing posts locally using Hugo's server with draft visibility (`hugo server -D`).\n5.  Connecting the local Hugo site to a GitHub repository.\n6.  Setting up Cloudflare Pages, connecting it to the GitHub repository, and configuring build settings (`hugo --minify` command and `public` output directory).\n\nThe publishing workflow involves writing in Obsidian, changing `draft: true` to `draft: false` when ready, committing, and pushing to GitHub. Cloudflare Pages automatically detects changes and rebuilds the site. The author highlights the initial setup effort but praises the subsequent frictionless, cost-free, and self-owned workflow.\n",
    "chinese_title": "我如何使用 Obsidian、Hugo、GitHub 和 Cloudflare 搭建博客 —— 零成本，完全自主",
    "chinese_summary": "本文详细介绍了一种使用Obsidian、Hugo、GitHub和Cloudflare Pages编写和发布博客文章的工作流程，重点强调零成本、完全自主的系统。作者描述了他们如何使用Obsidian进行写作，因为它采用本地优先模式和无干扰界面，并通过iCloud在设备间同步笔记。\n\n发布过程涉及使用Hugo和Bear Blog主题来搭建快速且简洁的网站，并通过GitHub和Cloudflare Pages进行部署。这种设置提供了完全控制，避免了订阅、厂商锁定和平台依赖。\n\n设置过程包括：\n\n1. 安装Hugo并使用Bear Blog主题创建一个新站点。\n2. 通过将Hugo站点的content/blog文件夹作为Obsidian库打开来连接Obsidian，允许直接写入Hugo目录。\n3. 在Obsidian文章中使用一致的Front Matter模板，包括一个`draft`标志以便于切换。\n4. 使用Hugo的服务器和草稿可见性(`hugo server -D`)在本地预览文章。\n5. 将本地Hugo站点连接到GitHub存储库。\n6. 设置Cloudflare Pages，将其连接到GitHub存储库，并配置构建设置（`hugo --minify`命令和`public`输出目录）。\n\n发布工作流程包括在Obsidian中写作，准备就绪后将`draft: true`更改为`draft: false`，提交并推送到GitHub。Cloudflare Pages会自动检测更改并重建站点。作者强调了初始设置的投入，但赞扬了随后的无摩擦、免费且自主的工作流程。"
  },
  {
    "id": "43740803",
    "title": "Subnanosecond Flash Memory",
    "url": "https://www.nature.com/articles/s41586-025-08839-w",
    "summary": "This article reports on the development of a subnanosecond flash memory utilizing a two-dimensional (2D) Dirac graphene-channel and a 2D-enhanced hot-carrier-injection mechanism. The research addresses the need for faster non-volatile memory in the age of AI, overcoming the speed limitations of existing flash memory and the volatility of SRAM.\n\nThe key innovation lies in using the atomically thin properties of 2D materials to optimize the horizontal electric field (Ey) distribution, leading to enhanced hot-carrier injection (2D-HCI). The study demonstrates that graphene and tungsten diselenide (WSe2) exhibit material-dependent hot-carrier injection behaviors. Graphene facilitates both electron and hole injection due to its Dirac nature, while WSe2 primarily supports hole injection.\n\nThe graphene-based flash memory achieved a program speed of 400 picoseconds at a low program voltage of 5V, with robust endurance over 5.5 × 10^6 cycles. The improved Ey-assisted program efficiency increases the injection current.\n\nThe research contrasts the 2D-HCI mechanism with the limitations of silicon-based flash memory, where the electric field acceleration is less efficient. A quasi-2D model is used to explain how the thin-body channel of 2D materials enhances the electric field distribution, leading to superior injection efficiency. The findings demonstrate that flash memory can surpass the speed of volatile SRAM.\n",
    "chinese_title": "亚纳秒闪存",
    "chinese_summary": "本文报道了一种利用二维狄拉克石墨烯通道和二维增强热载流子注入机制的亚纳秒闪存的开发。该研究旨在满足人工智能时代对更快非易失性存储器的需求，克服现有闪存的速度限制和SRAM的易失性。\n\n主要创新在于利用二维材料的原子级薄特性来优化水平电场（Ey）分布，从而增强热载流子注入（2D-HCI）。研究表明，石墨烯和二硒化钨（WSe2）表现出材料依赖性的热载流子注入行为。由于其狄拉克特性，石墨烯促进电子和空穴的注入，而WSe2主要支持空穴注入。\n\n基于石墨烯的闪存以5V的低编程电压实现了400皮秒的编程速度，并在超过5.5 × 10^6次循环中表现出强大的耐久性。改进的Ey辅助编程效率提高了注入电流。\n\n该研究将二维热载流子注入机制与硅基闪存的局限性进行了对比，硅基闪存的电场加速效率较低。使用准二维模型来解释二维材料的薄体通道如何增强电场分布，从而实现卓越的注入效率。研究结果表明，闪存可以超越易失性SRAM的速度。"
  },
  {
    "id": "43764805",
    "title": "Confirmation of Breslow's hypothesis: A carbene stable in liquid water",
    "url": "https://www.science.org/doi/10.1126/sciadv.adr9681",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "布雷斯洛假设的证实：一种在液态水中稳定的卡宾",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "43764439",
    "title": "π0.5: A VLA with open-world generalization",
    "url": "https://pi.website/blog/pi05",
    "summary": "This article introduces π0.5, a new Vision-Language-Action (VLA) model designed for improved open-world generalization in robotics. Unlike previous models that perform well in controlled environments, π0.5 demonstrates the ability to generalize to entirely new and \"messy\" environments like homes, enabling robots to perform complex tasks such as cleaning or tidying up in unseen locations.\n\nThe key innovation behind π0.5 is co-training on heterogeneous data, combining diverse sources including robotic demonstrations, multimodal web data (image captioning, object detection), verbal instructions, and data from various robot types. This approach allows the model to learn both physical skills and semantic understanding of tasks. The article highlights that the right mixture of these data sources acts as a \"curriculum,\" enabling generalization across different levels of abstraction.\n\nExperiments show that π0.5 outperforms models trained without certain data sources, particularly excelling in identifying new objects and performing tasks in out-of-distribution environments.  A scaling study demonstrates that performance improves with the number of training environments, reaching levels comparable to models trained directly on the test environment after exposure to around 100 diverse training locations.\n\nπ0.5 utilizes a hierarchical approach, first generating a high-level textual action and then selecting appropriate low-level motor commands using a flow-matching action expert. The model's capabilities are showcased in videos demonstrating long-horizon tasks in new homes, its robustness to environmental changes and human interference, and its ability to follow language commands at varying levels of detail.\n",
    "chinese_title": "π0.5：具有开放世界泛化能力的大规模视觉语言模型",
    "chinese_summary": "本文介绍π0.5，一种新型视觉-语言-动作(VLA)模型，旨在提高机器人领域中开放世界泛化能力。与先前在受控环境中表现良好的模型不同，π0.5展示了泛化到全新且“混乱”环境（如家庭）的能力，使机器人能够在未见过的地点执行清洁或整理等复杂任务。\n\nπ0.5背后的关键创新在于异构数据上的协同训练，结合了包括机器人演示、多模态网络数据（图像描述、物体检测）、口头指令和来自各种机器人类型的数据等多种来源。 这种方法使模型能够学习物理技能和对任务的语义理解。 文章强调，这些数据源的正确混合充当了一个“课程”，实现了跨不同抽象层次的泛化。\n\n实验表明，π0.5优于未经过某些数据源训练的模型，尤其擅长识别新物体并在分布外环境中执行任务。 一项规模研究表明，性能随着训练环境数量的增加而提高，在接触约100个不同的训练地点后，性能达到了与直接在测试环境中训练的模型相当的水平。\n\nπ0.5采用分层方法，首先生成高级文本动作，然后使用流匹配动作专家选择适当的低级运动命令。 该模型的能力通过视频展示，视频展示了其在新家中执行长期任务、对环境变化和人为干扰的鲁棒性，以及遵循不同详细程度的语言命令的能力。"
  },
  {
    "id": "43763814",
    "title": "Show HN: Morphik – Open-source RAG that understands PDF images, runs locally",
    "url": "https://github.com/morphik-org/morphik-core",
    "summary": "Morphik is an open-source RAG (Retrieval Augmented Generation) alternative designed for complex, visual documents like PDFs and videos, allowing developers to ingest, search, transform, and manage unstructured data. Key features include multimodal search powered by techniques like ColPali to understand visual content, knowledge graph generation for domain-specific applications, fast metadata extraction (bounding boxes, labeling, etc.), and integrations with tools like Google Suite, Slack, and Confluence. It also offers cache-augmented generation for faster responses.\n\nUsers can get started with a free tier offering 200 pages and 100 queries via a paid service or self-host the open-source version. The Python SDK and REST API simplify document ingestion and querying with code examples provided. The Morphik Console offers a web-based interface for interacting with data, and access is also available via MCP.\n\nContributions are welcome through bug reports, feature requests, and pull requests. Some features, specifically those within the \"ee\" namespace like Morphik Console, are exclusive to the paid version and are not open source.\n",
    "chinese_title": "展示HN：Morphik – 理解PDF图像且本地运行的开源RAG",
    "chinese_summary": "Morphik：面向复杂视觉文档的开源RAG替代方案，专为PDF和视频等设计，允许开发者摄取、搜索、转换和管理非结构化数据。主要功能包括：由ColPali等技术驱动的多模态搜索，以理解视觉内容；为特定领域应用生成知识图谱；快速元数据提取（边界框、标签等）；以及与Google Suite、Slack和Confluence等工具的集成。它还提供缓存增强生成，以加快响应速度。\n\n用户可以通过付费服务或自托管开源版本开始使用，免费层提供200页和100个查询。Python SDK和REST API简化了文档摄取和查询，并提供代码示例。Morphik控制台提供了一个基于Web的界面来与数据交互，也可以通过MCP访问。\n\n欢迎通过错误报告、功能请求和Pull Request进行贡献。某些功能，特别是\"ee\"命名空间内的功能（如Morphik控制台），仅限于付费版本，不开源。"
  },
  {
    "id": "43768362",
    "title": "We Have Made No Progress Toward AGI",
    "url": "https://www.mindprison.cc/p/no-progress-toward-agi-llm-braindead-unreliable",
    "summary": "This article argues that Large Language Models (LLMs) have made no real progress toward Artificial General Intelligence (AGI), despite appearances. It claims LLMs are fundamentally \"braindead\" statistical models, not reasoning machines. The author cites Anthropic's research using \"attribution graphs\" to peek inside LLM reasoning processes, revealing a complex web of heuristics and memorized patterns instead of genuine algorithmic understanding.\n\nKey points include:\n\n*   **LLMs don't reason like humans:** Internal processes don't resemble human reasoning, and LLM explanations for their outputs are often fabricated (\"hallucinated\").\n*   **\"Chain-of-thought\" is unreliable:** These steps are learned patterns, not actual representations of the model's internal thinking.\n*   **AI agents are not a solution:** LLMs can hallucinate tool usage, corrupting the entire data pipeline.\n*   **LLM architecture tweaks are isolated:** Improvements can have unintended negative side effects, with newer models sometimes performing worse on specific tasks.\n*   **LLMs can't construct hard rules:** They only determine what is \"probably\" right based on past data, requiring constant retraining.\n*   **Progress is just scaling:** Improvement is achieved through massive scaling of statistical models, not through actual intelligence.\n*   **Current benchmarks are misleading:** They don't capture real-world performance.\n*   **Focus on efficiency:** Progress toward AGI should be measured by capability relative to data and training effort, with a decrease in both being a positive sign. No modal collapse in closed systems.\n\nThe author concludes that the pursuit of AGI needs to shift away from simply scaling statistical models and towards architectures that demonstrate true understanding and reasoning capabilities.\n",
    "chinese_title": "我们尚未在通用人工智能方面取得任何进展",
    "chinese_summary": "本文认为，尽管表面看来如此，大型语言模型（LLMs）在实现通用人工智能（AGI）方面并未取得实质性进展。文章声称，LLMs本质上是“脑死亡”的统计模型，而非推理机器。作者引用了Anthropic的研究，该研究使用“归因图”来窥探LLM的推理过程，揭示了一个由启发式和记忆模式组成的复杂网络，而非真正的算法理解。\n\n关键点包括：\n\n*   **LLMs的推理方式不像人类：** 内部过程不像人类推理，LLM对其输出的解释通常是捏造的（“幻觉”）。\n*   **“思维链”不可靠：** 这些步骤是学习到的模式，并非模型内部思考的真实表征。\n*   **人工智能代理并非解决方案：** LLMs可能会产生工具使用方面的幻觉，从而破坏整个数据管道。\n*   **LLM架构调整是孤立的：** 改进可能会产生意想不到的负面副作用，较新的模型有时在特定任务上的表现更差。\n*   **LLMs无法构建硬性规则：** 它们只能根据过去的数据来确定什么是“可能”正确的，需要不断地重新训练。\n*   **进步仅仅是规模化：** 改进是通过大规模扩展统计模型来实现的，而不是通过真正的智能。\n*   **当前的基准具有误导性：** 它们不能捕捉现实世界的表现。\n*   **关注效率：** 衡量AGI的进展应该以能力相对于数据和训练工作的效率来衡量，数据和训练工作量的减少是一个积极的信号。封闭系统中没有模态崩溃。\n\n作者的结论是，追求AGI需要从简单地扩展统计模型转向能够展示真正理解和推理能力的架构。"
  },
  {
    "id": "43764915",
    "title": "Ping, You've Got Whale: AI detection system alerts ships of whales in their path",
    "url": "https://www.biographic.com/ping-youve-got-whale/",
    "summary": "WhaleSpotter, an AI-powered whale detection system, aims to reduce whale deaths from ship collisions by providing real-time alerts to ship captains. The system uses heat-sensing cameras and machine learning to identify whale spouts and relay the information to experts, who then forward validated alerts to ships, allowing them to change course.\n\nDeveloped by Daniel Zitterbart at Woods Hole Oceanographic Institution, WhaleSpotter has significantly improved since its 2019 inception, with over 51,000 marine mammal detections in 2024. A key challenge lies in equipping large container ships, which are major contributors to whale fatalities. By adapting the technology, the system can now reliably spot whales up to 6 kilometers away from these larger vessels.\n\nWhile not yet providing real-time alerts to container ships, testing on Matson Navigation Company's ships in Hawai'i, Alaska, and the U.S. west coast has shown promising results. Zitterbart emphasizes the importance of human validation to avoid false alarms, as the system is intended for marine conservation, aiming for zero false positives to maintain the attention of ship captains. Other AI systems exist, but WhaleSpotter distinguishes itself by prioritizing human oversight.\n\nMarine biologist John Calambokidis highlights real-time detection as a crucial, yet underutilized, strategy for whale conservation. As WhaleSpotter expands, its developers hope that broader adoption will enable real-time information sharing, ultimately saving more whales from ship strikes, especially endangered species like the North Atlantic right whale.\n",
    "chinese_title": "鲸声提示：人工智能检测系统提醒船只注意航线上的鲸鱼",
    "chinese_summary": "鲸鱼观察者：利用人工智能的鲸鱼探测系统，旨在通过向船长提供实时警报，减少因船舶碰撞导致的鲸鱼死亡。该系统采用热感摄像机和机器学习技术来识别鲸鱼喷水，并将信息传递给专家，专家再将验证后的警报转发给船舶，使其能够改变航向。\n\n该系统由伍兹霍尔海洋研究所的丹尼尔·齐特巴特开发，自2019年启动以来，鲸鱼观察者已显著改进，2024年探测到超过51,000次海洋哺乳动物。一个关键挑战在于装备大型集装箱船，这些船只是导致鲸鱼死亡的主要因素。通过改进技术，该系统现在能够可靠地探测到距离这些大型船只6公里以内的鲸鱼。\n\n虽然尚未向集装箱船提供实时警报，但在夏威夷、阿拉斯加和美国西海岸的马逊航运公司的船舶上进行的测试已显示出可喜的成果。齐特巴特强调人工验证的重要性，以避免误报，因为该系统的目的是为了海洋保护，力求零误报以保持船长的注意力。虽然存在其他人工智能系统，但鲸鱼观察者因优先考虑人工监督而脱颖而出。\n\n海洋生物学家约翰·卡拉姆博基迪斯强调实时探测是鲸鱼保护的一项关键但未被充分利用的策略。随着鲸鱼观察者的扩展，其开发人员希望更广泛的应用能够实现实时信息共享，最终使更多的鲸鱼免遭船舶撞击，特别是像北大西洋露脊鲸这样的濒危物种。"
  },
  {
    "id": "43767058",
    "title": "Meaning Machine – Visualize how LLMs break down and simulate meaning",
    "url": "https://meaning-machine.streamlit.app",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "意义机器 - 可视化大型语言模型如何分解和模拟意义",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "43764076",
    "title": "I should have loved biology too",
    "url": "https://nehalslearnings.substack.com/p/i-should-have-loved-biology-too",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "我本该也热爱生物学的。",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "43769482",
    "title": "Open Source Projects Receive Funding to Reclaim the Public Internet",
    "url": "https://nlnet.nl/news/2025/20250422-announcement-grants-CommonsFund.html",
    "summary": "This article announces that 42 free and open-source projects have received funding from the NGI Zero Commons Fund to advance a public-oriented internet. These projects span a wide range of areas, from open hardware and operating systems to educational tools and communication platforms.\n\nExamples of funded projects include:\n\n*   **Hardware:** Solar FemtoTX motherboard (low-power, solar-powered motherboard), MNT Reform Touch (open hardware tablet), FuseSoC-compatible Web Catalog (package manager for chip designs).\n*   **Operating Systems/Firmware:** bcachefs (next-gen Linux filesystem), KDE Plasma Gestures (multi-touch gestures for Plasma Desktop), Maemo Leste (secure mobile Linux distro).\n*   **Educational:** ClassQuiz (privacy-friendly quizzing for schools), Federating pedagogical immersive experiences & Flock XR (augmented reality for kids).\n*   **Communication/Collaboration:** Podlibre (podcast creation), PeerTube enhancements (decentralized video platform), Livebook (interactive notebook application).\n*   **Other:** LiberaForms (end-to-end encrypted forms), Open Terms Archive (tracking evolution of terms and conditions).\n* LLM2FPGA (run LLMs locally on FPGAs)\n\nThe funding aims to support projects that contribute to reclaiming the public nature of the internet, focusing on transparency, privacy, security, and community benefit. The article also explains how applicants can determine which funding round they applied for.\n",
    "chinese_title": "开源项目获资助，以重塑公共互联网。",
    "chinese_summary": "本文宣布，42个免费和开源项目已获得NGI Zero Commons基金的资助，以推进以公众为导向的互联网。这些项目涵盖了广泛的领域，从开放硬件和操作系统到教育工具和通信平台。\n\n资助项目示例包括：\n\n*   **硬件：**Solar FemtoTX主板（低功耗、太阳能供电主板），MNT Reform Touch（开放硬件平板电脑），FuseSoC兼容的Web目录（芯片设计软件包管理器）。\n*   **操作系统/固件：**bcachefs（下一代Linux文件系统），KDE Plasma手势（Plasma桌面多点触控手势），Maemo Leste（安全移动Linux发行版）。\n*   **教育：**ClassQuiz（学校隐私友好的测验），联合教学沉浸式体验&Flock XR（儿童增强现实）。\n*   **通信/协作：**Podlibre（播客创作），PeerTube增强（去中心化视频平台），Livebook（交互式笔记本应用程序）。\n*   **其他：**LiberaForms（端到端加密表单），Open Terms Archive（追踪条款和条件演变）。\n* LLM2FPGA（在FPGA上本地运行LLM）\n\n该基金旨在支持有助于重塑互联网公共属性的项目，重点关注透明度、隐私、安全性以及社区利益。本文还解释了申请人如何确定他们申请的资助轮次。"
  },
  {
    "id": "43745410",
    "title": "Mike Wood, Whose LeapFrog Toys Taught a Generation, Dies at 72",
    "url": "https://www.nytimes.com/2025/04/19/business/michael-c-wood-dead.html",
    "summary": "Mike Wood, the founder of LeapFrog Enterprises, has died at 72. Driven by his own son's early struggles with reading, Wood created an electronic toy that helped children learn letter sounds by squeezing plastic letters. This idea, inspired by musical greeting cards, led to the creation of LeapFrog and its flagship product, the LeapPad. Introduced in 1999, the LeapPad was a runaway success, becoming the best-selling toy of the 2000 holiday season and transforming LeapFrog into one of the fastest-growing toy companies. Wood's invention had a significant impact, teaching a generation of children to read.\n",
    "chinese_title": "迈克·伍德，跃蛙玩具创始人，启蒙一代人，去世，享年72岁",
    "chinese_summary": "leapFrog Enterprises创始人迈克·伍德去世，享年72岁。受儿子早期阅读困难的启发，伍德发明了一种电子玩具，通过挤压塑料字母帮助孩子们学习字母发音。这个灵感源于音乐贺卡的创意，催生了LeapFrog及其旗舰产品LeapPad的诞生。 LeapPad于1999年推出，一炮而红，成为2000年假日季最畅销的玩具，并将LeapFrog转变为增长最快的玩具公司之一。伍德的发明产生了重大影响，教会了一代儿童阅读。"
  },
  {
    "id": "43733495",
    "title": "Can rotation solve the Hubble Puzzle?",
    "url": "https://academic.oup.com/mnras/article/538/4/3038/8090496?login=false",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "旋转能解决哈勃难题吗？",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "43735882",
    "title": "The Last of Their Kind",
    "url": "https://nautil.us/the-last-of-their-kind-1204387/",
    "summary": "Elena Kazamia's article \"The Last of Their Kind\" explores the desperate efforts to resurrect the northern white rhino population, which is functionally extinct with only two remaining individuals, Najin and Fatu. The article details the history of the northern white rhino's decline due to poaching and the attempts by zoos to breed them.\n\nThe primary focus is on the BioRescue project, led by Thomas Hildebrandt, which uses advanced reproductive technologies like in-vitro fertilization (IVF) and gene editing to create northern white rhino embryos from Fatu's eggs and cryopreserved sperm from deceased males. These embryos are intended to be implanted into southern white rhino surrogates.\n\nThe article highlights the challenges and setbacks faced, including the death of a surrogate carrying a northern white rhino fetus. It also discusses the partnership with Colossal Biosciences, a company known for its efforts to \"resurrect\" extinct species using ancient DNA, to enhance genetic diversity in the embryos.\n\nThe piece raises ethical questions about the focus on resurrecting one species when other conservation efforts and species also desperately need resources and protection. The article also touches on the differences between northern and southern white rhinos, emphasizing the importance of restoring the northern white rhino to its specific ecological niche in northern Africa.\n",
    "chinese_title": "最后的遗族",
    "chinese_summary": "埃琳娜·卡扎米亚的文章《最后的物种》探讨了为复活北方白犀牛种群所做的绝望努力，该种群实际上已经功能性灭绝，仅存两只个体，分别是纳金和法图。文章详细介绍了北方白犀牛因偷猎而数量下降的历史以及动物园试图繁殖它们的努力。\n\n文章主要关注由托马斯·希尔德布兰特领导的“生物救援”项目，该项目利用体外受精（IVF）和基因编辑等先进的生殖技术，从法图的卵子和已故雄性的冷冻精子中创造北方白犀牛胚胎。这些胚胎计划植入南方白犀牛代孕体内。\n\n文章强调了所面临的挑战和挫折，包括一只携带北方白犀牛胎儿的代孕死亡。文章还讨论了与Colossal Biosciences公司的合作，该公司以利用古代DNA“复活”已灭绝物种而闻名，旨在增强胚胎的遗传多样性。\n\n文章提出了伦理问题，即当其他保护工作和物种也迫切需要资源和保护时，关注复活一个物种是否值得。文章还谈到了北方白犀牛和南方白犀牛之间的差异，强调了将北方白犀牛恢复到其在北非特定生态位的的重要性。"
  },
  {
    "id": "43766728",
    "title": "How to quickly charge your smartphone: fast charging technologies in detail",
    "url": "https://eb43.github.io/articles/fast-charging-technologies-in-detail.html",
    "summary": "This article, \"How to quickly charge your smartphone: fast charging technologies in detail\" by Eugen Barilyuk, published on April 22, 2025, aims to explain how to rapidly charge smartphones. It likely delves into the technical aspects of fast charging technologies.\n\nWhile the precise details are unavailable without access to the full article, we can infer the probable topics covered based on the title. The article likely discusses various fast charging standards, perhaps differentiating between them and outlining their individual charging speeds, voltage, and amperage capabilities. It might explore common standards like Qualcomm's Quick Charge, USB Power Delivery (USB-PD), and proprietary solutions from manufacturers like Samsung's Adaptive Fast Charging or OnePlus' Warp Charge.\n\nThe article could also elaborate on the technical principles behind fast charging, such as how devices communicate with chargers to negotiate optimal charging parameters. It's probable that safety considerations are addressed, including the role of temperature control and over-voltage protection in preventing damage to the battery or device during fast charging. Finally, the article likely discusses the compatibility of different chargers and devices, explaining whether certain chargers will work with specific smartphones and whether using a non-compatible charger might impact charging speeds or even pose risks.\n",
    "chinese_title": "如何快速给智能手机充电：快充技术详解",
    "chinese_summary": "《如何快速为智能手机充电：快充技术详解》（作者：Eugen Barilyuk，发表于2025年4月22日），旨在解释如何快速为智能手机充电，并可能深入探讨快充技术的技术层面。\n\n虽然在无法访问全文的情况下无法获得确切的细节，但我们可以根据标题推断出可能涵盖的主题。文章可能讨论各种快速充电标准，或许会区分它们，并概述它们各自的充电速度、电压和电流能力。它可能会探讨常见的标准，如高通的 Quick Charge、USB 电源传输 (USB-PD) 以及来自三星自适应快速充电或 OnePlus Warp Charge 等制造商的专有解决方案。\n\n文章也可能详细阐述快速充电背后的技术原理，例如设备如何与充电器通信以协商最佳充电参数。很可能涉及安全注意事项，包括温度控制和过压保护在防止快速充电期间损坏电池或设备方面的作用。最后，文章可能讨论不同充电器和设备的兼容性，解释某些充电器是否适用于特定智能手机，以及使用不兼容的充电器是否会影响充电速度甚至构成风险。"
  },
  {
    "id": "43761633",
    "title": "The raccoons who made computer magazine ads great",
    "url": "https://technologizer.com/home/2025/04/22/pc-connection-ads-raccoons/",
    "summary": "This article explores the unique marketing strategy of PC Connection, a mail-order computer product company that rose to prominence in the 1980s and 90s through memorable advertisements featuring anthropomorphic raccoons. In a market saturated with catalog-style ads, PC Connection differentiated itself with illustrations by Erick Ingraham, depicting raccoons engaged in everyday activities, from running a bakery to playing baseball, often set in rural New England scenes.\n\nThe idea originated from a desire to make computers less intimidating, spearheaded by PC Connection founders Patricia Gallup and David Hall, and executed by the ad agency Church and Main. The raccoons, initially chosen for their dexterous paws, became the company's mascots, symbolizing adaptability and innovation. Copywriter David Blistein accompanied the illustrations with humorous text, emphasizing PC Connection's small-town values and customer service.\n\nThese ads, which appeared in popular computer magazines like PC Magazine, became highly anticipated by readers.  PC Connection also offered premiums featuring the raccoon characters to customers who met spending thresholds, further enhancing brand recognition. While the raccoon ads faded from PC Connection's marketing in the early 2000s, they remain a memorable and effective example of creative advertising in the early days of personal computing. The article also touches on the company's founding and its focus on customer support, contributing to its success.\n",
    "chinese_title": "让电脑杂志广告更精彩的浣熊们",
    "chinese_summary": "本文探讨了PC Connection独特的营销策略。这家邮购电脑产品公司在20世纪80年代和90年代凭借以拟人化浣熊为特色的令人难忘的广告而声名鹊起。在充斥着目录式广告的市场中，PC Connection凭借Erick Ingraham的插图脱颖而出，这些插图描绘了浣熊从事日常活动，从经营面包店到打棒球，场景通常设置在新英格兰乡村。\n\n这个想法源于让电脑不那么令人生畏的愿望，由PC Connection的创始人Patricia Gallup和David Hall带头，并由广告公司Church and Main执行。浣熊最初因其灵巧的爪子而被选中，后来成为公司的吉祥物，象征着适应性和创新。文案撰稿人David Blistein为这些插图配上了幽默的文字，强调了PC Connection的小镇价值观和客户服务。\n\n这些广告出现在《PC Magazine》等流行的电脑杂志上，深受读者期待。PC Connection还向达到消费门槛的客户提供以浣熊角色为特色的赠品，进一步提高了品牌认知度。虽然浣熊广告在21世纪初从PC Connection的营销中淡出，但它们仍然是个人电脑早期创意广告的一个令人难忘且有效的例子。本文还提到了公司的创立及其对客户支持的关注，这为其成功做出了贡献。"
  },
  {
    "id": "43764101",
    "title": "Are polynomial features the root of all evil? (2024)",
    "url": "https://alexshtf.github.io/2024/01/21/Bernstein.html",
    "summary": "This article challenges the common belief that high-degree polynomial features are inherently problematic in machine learning, arguing that they are often unfairly maligned due to misconceptions and improper usage. The author contends that high-degree polynomials can be effectively controlled with standard machine learning tools like regularization when used correctly.\n\nThe first misconception addressed is the choice of basis. The standard polynomial basis (1, x, x^2, ...) is identified as a key culprit for instability and overfitting. The author introduces alternative polynomial bases like Chebyshev and Legendre polynomials, commonly used in approximation theory. However, these are optimized for interpolation, not fitting noisy data.\n\nThe article champions the Bernstein basis as a superior choice for machine learning. The Bernstein basis polynomials, used in computer graphics, offer several advantages: all coefficients share the same \"units,\" making them easier to regularize, and the polynomial function is a weighted average of these coefficients.\n\nThe second misconception concerns the Weierstrass approximation theorem. The theorem states polynomials can approximate continuous functions within an interval, implying the need to normalize input features to lie within a specific range (e.g., [0, 1]) when using polynomial features.\n\nThe article demonstrates these concepts by fitting a sine-like function to noisy data using various polynomial bases, highlighting the instability of the standard, Chebyshev, and Legendre bases, and the stability and regularization-friendliness of the Bernstein basis. It concludes that with proper representation and normalization, high-degree polynomials can be powerful and controllable non-linear features.\n",
    "chinese_title": "多项式特征是万恶之源吗？(2024)",
    "chinese_summary": "本文挑战了一种普遍的观点，即高阶多项式特征在机器学习中本质上是有问题的。文章认为，由于误解和不当使用，它们常常被不公平地诋毁。作者认为，如果使用得当，高阶多项式可以通过诸如正则化等标准的机器学习工具有效地控制。\n\n首先要解决的误解是基的选择。标准多项式基（1, x, x^2, ...）被认为是导致不稳定和过拟合的关键原因。作者介绍了一些替代的多项式基，例如在逼近理论中常用的切比雪夫和勒让德多项式。然而，这些基针对插值进行了优化，而不是拟合噪声数据。\n\n本文推崇伯恩斯坦基作为机器学习的更优选择。伯恩斯坦基多项式在计算机图形学中使用，具有几个优点：所有系数共享相同的“单位”，使其更容易正则化，并且多项式函数是这些系数的加权平均值。\n\n第二个误解涉及维尔斯特拉斯逼近定理。该定理指出，多项式可以在一个区间内逼近连续函数，这意味着在使用多项式特征时，需要将输入特征归一化，使其位于特定范围内（例如[0, 1]）。\n\n本文通过使用各种多项式基将正弦函数拟合到噪声数据来演示这些概念，突出了标准基、切比雪夫基和勒让德基的不稳定性，以及伯恩斯坦基的稳定性和易于正则化。文章最后得出结论，通过适当的表示和归一化，高阶多项式可以成为强大且可控的非线性特征。"
  },
  {
    "id": "43761998",
    "title": "Abusing DuckDB-WASM by making SQL draw 3D graphics (Sort Of)",
    "url": "https://www.hey.earth/posts/duckdb-doom",
    "summary": "This article details an experiment where the author built a rudimentary 3D game engine, specifically a text-based Doom clone, using DuckDB-WASM, an analytical database, for core game logic instead of conventional JavaScript. The entire game world, including the map, player position, enemy/bullet locations, and game settings, resides within DuckDB tables. Player movement, bullet physics, and collision detection are all handled via SQL queries (UPDATE and DELETE statements).\n\nThe rendering is achieved by defining a SQL VIEW named `render_3d_frame` that performs raycasting using recursive CTEs. This view calculates wall distances, heights, and then assembles the text-based 3D scene using string aggregation. JavaScript is used to glue everything together, handle keyboard input, run the game loop, fetch the background frame from the SQL view, manage sprites (bullets, enemies), and perform a Z-buffer check to determine if sprites should be drawn over the wall at a particular screen column.\n\nThe author discusses several challenges encountered: loading DuckDB-WASM correctly, SQL dialect differences (AUTOINCREMENT vs SEQUENCE), query planner limitations when using table functions (generate_series), async/setInterval race conditions, and implementing Z-buffer logic for sprites. The solution to these problems range from refactoring the SQL to be more planner friendly to adding a processing lock to the async main loop.\n\nThe final result is a playable game running at approximately 6-7 FPS. While unconventional, the project demonstrates the unexpected power of SQL and DuckDB-WASM for tasks outside their intended purpose. The core lesson is that it is possible to perform complex state management and rendering with SQL, albeit with performance considerations.\n",
    "chinese_title": "利用 DuckDB-WASM 通过 SQL 绘制 3D 图形（某种程度上）",
    "chinese_summary": "本文详细介绍了一个实验，作者使用 DuckDB-WASM（一种分析型数据库）构建了一个简陋的 3D 游戏引擎，具体来说是一个基于文本的 Doom 克隆版，用于核心游戏逻辑，而非传统的 JavaScript。整个游戏世界，包括地图、玩家位置、敌人/子弹位置和游戏设置，都存储在 DuckDB 表格中。玩家移动、子弹物理和碰撞检测都通过 SQL 查询（UPDATE 和 DELETE 语句）来处理。\n\n渲染是通过定义一个名为 `render_3d_frame` 的 SQL 视图来实现的，该视图使用递归 CTE 执行光线投射。此视图计算墙壁距离、高度，然后使用字符串聚合组装基于文本的 3D 场景。 JavaScript 用于将所有内容粘合在一起，处理键盘输入，运行游戏循环，从 SQL 视图获取背景帧，管理精灵（子弹、敌人），并执行 Z 缓冲区检查以确定精灵是否应在特定屏幕列上绘制在墙上。\n\n作者讨论了遇到的几个挑战：正确加载 DuckDB-WASM、SQL 方言差异（AUTOINCREMENT 与 SEQUENCE）、使用表函数（generate_series）时的查询计划器限制、async/setInterval 竞争条件以及实现精灵的 Z 缓冲区逻辑。这些问题的解决方案包括重构 SQL 以使其对计划器更加友好，以及向异步主循环添加处理锁。\n\n最终结果是一个可玩的，以大约 6-7 FPS 运行的游戏。虽然非常规，但该项目展示了 SQL 和 DuckDB-WASM 在其预期用途之外的任务方面的出人意料的能力。核心教训是，可以使用 SQL 执行复杂的状态管理和渲染，尽管需要考虑性能。"
  },
  {
    "id": "43746202",
    "title": "The Rise and Fall of Toys 'R' Us (2018)",
    "url": "https://www.history.com/articles/toys-r-us-closing-legacy",
    "summary": "Erin Blakemore's \"Inside the Rise and Fall of Toys ‘R’ Us\" details the evolution of the iconic toy retailer from its inception to its eventual demise. Founded by Charles Lazarus in 1948 as Children's Bargain Town, specializing in baby goods, it transitioned to toys as Lazarus recognized recurring customer needs. In 1957, the company rebranded as Toys ‘R’ Us, pioneering the big-box toy store concept, taking a supermarket-style approach with vast selections at low prices, effectively becoming the first \"category killer.\"\n\nToys ‘R’ Us capitalized on the post-war baby boom and a growing toy industry, fueled by television advertising and iconic toys like Barbie and Mr. Potato Head. The company leveraged its size to negotiate lower prices, driving smaller competitors out of business and dominating the market, controlling 25% of the world's toy market at its peak.\n\nHowever, several factors contributed to its downfall. These included the rise of e-commerce, evolving toy preferences, a leveraged buyout in 2005, and increasingly dated stores. Ironically, the big-box model it helped create also contributed to its demise, with competitors like Wal-Mart and Amazon offering similar products at lower prices. The company's attempt to compete by cutting back on its toy selection and focusing on price ultimately diminished the magic that had initially made Toys ‘R’ Us successful, leading to its bankruptcy in 2017.\n",
    "chinese_title": "玩具反斗城的兴衰 (2018)",
    "chinese_summary": "艾琳·布莱克莫尔的《玩具反斗城兴衰内幕》详细讲述了这家标志性玩具零售商从创立到最终倒闭的演变过程。它由查尔斯·拉扎勒斯于1948年创立，最初名为儿童廉价商品城，专门经营婴儿用品，后来随着拉扎勒斯意识到顾客的重复需求，转型为玩具销售。1957年，公司更名为玩具反斗城，开创了大型玩具商店的概念，采取超市式经营方式，以低廉的价格提供大量选择，有效地成为了第一个“品类杀手”。\n\n玩具反斗城充分利用了战后婴儿潮和玩具行业的增长，并受到电视广告和芭比娃娃、土豆先生等标志性玩具的推动。该公司利用其规模优势来谈判更低的价格，将规模较小的竞争对手挤出市场，并占据了主导地位，在其鼎盛时期控制了全球玩具市场25%的份额。\n\n然而，多种因素促成了它的衰落，包括电子商务的兴起、玩具偏好的演变、2005年的杠杆收购以及日益过时的门店。具有讽刺意味的是，它所帮助创建的大型商店模式也导致了它的 demise，沃尔玛和亚马逊等竞争对手以更低的价格提供类似的产品。该公司试图通过削减玩具选择和专注于价格来参与竞争，最终削弱了最初使玩具反斗城成功的魔力，导致其在2017年破产。"
  },
  {
    "id": "43763565",
    "title": "Hyperwood – Open-Source Furniture",
    "url": "https://hyperwood.org/",
    "summary": "Hyperwood is an open-source furniture system inspired by \"Small is Beautiful\" and Autoprogettazione, designed to allow anyone to create robust furniture from simple wooden slats with minimal tools and locally sourced materials. It aims to empower DIY enthusiasts, designers, and small manufacturers.\n\nThe core of Hyperwood lies in algorithmic generation of personalized construction plans and optimized material lists, promoting accessibility, sustainability, and waste reduction in furniture building. While currently more suitable for individuals with programming knowledge due to the specialized tools, the long-term vision is to create graphical user interfaces (GUIs) that will broaden its accessibility to a wider audience. In essence, Hyperwood provides a method for creating custom furniture in a sustainable and efficient way, prioritizing local resources and user empowerment.\n",
    "chinese_title": "超木 - 开源家具",
    "chinese_summary": "Hyperwood是一个开源家具系统，灵感来源于“小即是美”和Autoprogettazione，旨在让任何人都能用简单的木条，最少的工具和本地采购的材料创造出坚固的家具。它旨在赋能DIY爱好者、设计师和小制造商。\n\nHyperwood的核心在于个性化施工计划和优化材料清单的算法生成，从而促进家具制造的可及性、可持续性和减少浪费。虽然目前由于专业工具的原因，更适合具备编程知识的个人，但其长期愿景是创建图形用户界面（GUI），从而扩大其对更广泛受众的可访问性。本质上，Hyperwood提供了一种以可持续和高效的方式创建定制家具的方法，优先考虑本地资源和用户赋权。"
  },
  {
    "id": "43769201",
    "title": "The Ghosts of Gaelic",
    "url": "https://www.historytoday.com/archive/behind-times/ghosts-gaelic",
    "summary": "Duncan Sneddon's \"The Ghosts of Gaelic\" examines the state of the Gaelic language and culture in Scotland, particularly in light of the 2005 Gaelic Language Act and the upcoming Scottish Languages Bill. While Gaelic is spoken by a small but growing percentage of the population and efforts are underway to promote it, the language faces existential threats due to the dominance of English and socio-economic challenges in Gaelic-speaking communities.\n\nThe article delves into the complex relationship between Gaelic culture and English, using the example of James Macpherson's Ossian cycle. Macpherson's popular, but controversial, translations of Gaelic legends brought international attention to Scottish heritage but were later criticised for inauthenticity. Sneddon argues that Ossian, while significant, should not overshadow the broader and older Gaelic tradition of the Finn Cycle. This oral tradition, featuring narratives of Fionn mac Cumhail and his warriors, has been actively maintained and documented by institutions like the Irish Folklore Commission and the School of Scottish Studies.\n\nSneddon emphasises the need to shift away from an anglophone-centric view and allow Gaelic communities to preserve and express their culture in their own language. He argues that for the Scottish Languages Bill to truly succeed, it must prioritize the needs of Gaelic and Scots-speaking communities, particularly through funding and community-based language planning. While Gaelic education and broadcasting have seen progress, similar support is crucial for community development to ensure the survival and future vitality of the Gaelic language and its rich cultural heritage.\n",
    "chinese_title": "盖尔语的幽灵",
    "chinese_summary": "邓肯·斯内登的《盖尔语的幽灵》考察了苏格兰盖尔语语言和文化的现状，尤其是在2005年盖尔语语言法案和即将出台的苏格兰语言法案的背景下。虽然盖尔语的使用者占人口比例较小但正在增长，并且正在努力推广它，但由于英语的优势以及盖尔语社区面临的社会经济挑战，该语言面临着生存威胁。\n\n这篇文章深入探讨了盖尔文化和英语之间复杂的关系，并以詹姆斯·麦克弗森的奥西安诗篇为例。麦克弗森对盖尔语传说的广受欢迎但备受争议的翻译，为苏格兰的传统带来了国际关注，但后来因其不真实性而受到批评。斯内登认为，奥西安虽然意义重大，但不应掩盖芬恩循环更广泛和更古老的盖尔语传统。这个口头传统，以芬恩·麦克库米尔和他的战士的叙述为特色，已被爱尔兰民间传说委员会和苏格兰研究学院等机构积极维护和记录。\n\n斯内登强调需要摆脱以英语为中心的观点，让盖尔语社区用自己的语言保护和表达他们的文化。他认为，为了使苏格兰语言法案真正成功，它必须优先考虑盖尔语和苏格兰语社区的需求，特别是通过资金和基于社区的语言规划。虽然盖尔语教育和广播已经取得进展，但类似的支持对于社区发展至关重要，以确保盖尔语及其丰富的文化遗产的生存和未来活力。"
  },
  {
    "id": "43765832",
    "title": "Classic Computer Replicas",
    "url": "https://obsolescence.dev/index.html",
    "summary": "This short article excerpt highlights a \"classic computer replica.\" The key points are:\n\n*   It focuses on a specific early computer.\n*   This computer is notable for being \"the first interactive computer - with a keyboard.\"\n*   The keyboard is described as \"exotic\" because it doesn't use a standard alphanumeric layout, suggesting a unique or unusual input method.\n*   The call to action \"Continue Reading\" implies the article provides more details about this computer, its keyboard, and its historical significance.\n\nIn essence, the excerpt teases the reader with the concept of a very early interactive computer that used a non-alphanumeric keyboard, inviting them to learn more.\n",
    "chinese_title": "经典电脑复刻",
    "chinese_summary": "这篇短文摘录重点介绍了一款“经典计算机复制品”。要点如下：\n\n*   它聚焦于一款特定的早期计算机。\n*   这款计算机因是“第一台带有键盘的交互式计算机”而闻名。\n*   该键盘被描述为“奇特的”，因为它没有使用标准的字母数字布局，表明它采用了一种独特或不寻常的输入方法。\n*   “继续阅读”的号召性用语暗示这篇文章提供了更多关于这台计算机、它的键盘以及它的历史意义的细节。\n\n本质上，这段摘录以一台使用非字母数字键盘的非常早期的交互式计算机的概念来吸引读者，邀请他们了解更多信息。"
  },
  {
    "id": "43767944",
    "title": "Projects for Old OS X",
    "url": "https://jonathanalland.com/old-osx-projects.html",
    "summary": "This website, \"Projects for Old OS X,\" chronicles the author's journey back to older macOS versions and their efforts to make these systems usable in the modern era. Frustrated with modern macOS, the author provides a collection of projects aimed at fixing broken functionality, enhancing capabilities, and improving the overall experience on older versions of OS X.\n\nThe projects are categorized into several areas: Fixed Dashboard Widgets (Weather, Unit Converter, Translation), Web Browsing & Internet (Chromium Legacy Downloader, Legacy Mac Proxy, Transmission, Apple Mail Security Fix), Audio & Video (QuickTime tweaks, FFusion codec support, helper apps for opening various video and image formats, video downloader, media subscription preference pane), Games & Emulators (OpenEmu Lite, Dolphin for Legacy OS X, Steam API Emulator), System Tweaks (SIMBL, Snow Leopard window controls, emoji update), Miscellaneous Apps (SyncThing, Side Button Enabler), and Bugfixes for Other People's Apps (Pages '09, CodeRunner).\n\nThese projects range from updating widgets with new APIs to patching security vulnerabilities and providing compatibility with modern codecs and file formats. The author often provides modified versions of existing software, ensuring compatibility and addressing limitations of older macOS versions. Downloads are provided for each project, and source code is often included or available upon request. The target OS versions generally range from OS X 10.4 to 10.14, with a focus on OS X 10.9 (Mavericks).\n",
    "chinese_title": "适用于旧版 OS X 的项目",
    "chinese_summary": "“旧版OS X项目”网站记录了作者重返旧版macOS的历程，以及他们为使这些系统在现代可用所做的努力。由于对现代macOS感到失望，作者提供了一系列项目，旨在修复损坏的功能、增强功能以及改善旧版OS X的整体体验。\n\n这些项目分为几个领域：修复的Dashboard小部件（天气、单位转换器、翻译）、网页浏览和互联网（Chromium Legacy Downloader、Legacy Mac Proxy、Transmission、Apple Mail安全修复）、音频和视频（QuickTime调整、FFusion编解码器支持、用于打开各种视频和图像格式的辅助应用程序、视频下载器、媒体订阅首选项窗格）、游戏和模拟器（OpenEmu Lite、Dolphin for Legacy OS X、Steam API模拟器）、系统调整（SIMBL、Snow Leopard窗口控件、表情符号更新）、杂项应用程序（SyncThing、Side Button Enabler）以及针对他人应用程序的错误修复（Pages '09、CodeRunner）。\n\n这些项目范围从使用新API更新小部件到修补安全漏洞以及提供与现代编解码器和文件格式的兼容性。作者经常提供现有软件的修改版本，以确保兼容性并解决旧版macOS的限制。每个项目都提供下载，并且通常包含源代码或应要求提供。目标操作系统版本通常为OS X 10.4至10.14，重点是OS X 10.9 (Mavericks)。"
  },
  {
    "id": "43763225",
    "title": "Supabase raises $200M Series D at $2B valuation",
    "url": "https://finance.yahoo.com/news/exclusive-supabase-raises-200-million-112154867.html",
    "summary": "Supabase, an open-source application development platform, has raised a $200 million Series D funding round at a $2 billion valuation, led by Accel. The round also included participation from Coatue, Y Combinator, Craft Ventures, Felicis, and notable angels like Kevin Weil (OpenAI), Guillermo Rauch (Vercel), and Taylor Otwell (Laravel).\n\nAccel's investment involved a dedicated effort, with partners traveling to New Zealand to meet co-founder and CEO Paul Copplestone. Accel believes Supabase has the potential to become a dominant force in the database layer, supporting the popular Postgres database system as an alternative to Firebase.\n\nSupabase aims to be a comprehensive backend solution for developers, including \"vibe coders\" (those using AI tools), and is currently used by two million developers managing over 3.5 million databases. Vercel's CEO, Guillermo Rauch, highlights the synergy between vibe coding and Supabase's easy-to-use, accessible platform.\n\nFounded in 2020 and fully remote, Supabase actively fosters a global community, with a significant portion of its employees being former founders themselves. The company encourages collaboration through initiatives like launch weeks and in-person meetups in cities worldwide. The name \"Supabase\" was chosen partly as a playful reference to the Nicki Minaj song \"Super Bass.\"\n",
    "chinese_title": "Supabase以20亿美元估值融资2亿美元D轮",
    "chinese_summary": "开源应用开发平台Supabase在Accel领投的D轮融资中筹集了2亿美元，估值达20亿美元。Coatue、Y Combinator、Craft Ventures、Felicis以及著名天使投资人（如OpenAI的Kevin Weil、Vercel的Guillermo Rauch和Laravel的Taylor Otwell）也参与了本轮融资。\n\nAccel为此进行了专门的努力，合伙人前往新西兰会见联合创始人兼首席执行官Paul Copplestone。Accel认为Supabase有潜力成为数据库层面的主导力量，支持流行的Postgres数据库系统，作为Firebase的替代方案。\n\nSupabase旨在成为开发人员（包括使用人工智能工具的“vibe coders”）的全面后端解决方案，目前有两百万开发者使用它来管理超过350万个数据库。Vercel的首席执行官Guillermo Rauch强调了vibe coding与Supabase易于使用、易于访问的平台之间的协同作用。\n\nSupabase成立于2020年，完全远程办公，积极培育全球社区，其很大一部分员工本身就是前创始人。该公司通过诸如发布周和全球城市线下聚会等活动来鼓励合作。“Supabase”这个名字的选择，部分原因是对Nicki Minaj歌曲“Super Bass”的戏仿。"
  },
  {
    "id": "43765207",
    "title": "Can a single AI model advance any field of science?",
    "url": "https://www.lanl.gov/media/publications/1663/1269-earl-lawrence-ai",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "单个AI模型能推动任何科学领域的发展吗？",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "43765207",
    "title": "Can a single AI model advance any field of science?",
    "url": "https://www.lanl.gov/media/publications/1663/1269-earl-lawrence-ai",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "单个AI模型能否推动任何科学领域的发展？",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "43764771",
    "title": "The complex origin story of domestic cats",
    "url": "https://phys.org/news/2025-04-complex-story-domestic-cats-tunisia.html",
    "summary": "Two new large-scale studies challenge previous assumptions about the origin and spread of domestic cats in Europe, suggesting a more complex and recent history than previously thought. Both studies point to Tunisia as the likely origin.\n\nOne study, led by the University of Rome Tor Vergata, analyzed ancient cat genomes from across Europe and Anatolia. Their findings suggest domestic cats only appeared in Europe around the 1st century CE, much later than previously believed. They identified two waves of introduction: one bringing wildcats from Northwest Africa to Sardinia around the 2nd century BCE, and another introducing cats genetically similar to modern domestic lines during the Roman Imperial period.\n\nThe second study, led by the University of Exeter, analyzed archaeological bones and genetic data, concluding that domestic cats were present in Europe by the early first millennium BCE, predating the height of Roman expansion. They also identified Tunisia as the origin point. Both studies highlight the role of cultural and religious factors in the domestication and translocation of cats, pointing to their veneration in ancient Egypt and their association with goddesses in Greek/Roman and Norse mythology.\n\nBoth studies also documented the impact of domestic cats on European wildcat populations, suggesting a decline due to competition, disease, and hybridization. Overall, the research suggests that cats didn't simply follow early farmers, but arrived in Europe in multiple waves, driven by human cultural practices, trade, and religious beliefs, challenging the long-held view of a primarily commensal relationship. The studies underscore the limitations of relying solely on mitochondrial DNA markers in understanding feline domestication.\n",
    "chinese_title": "家猫的复杂起源",
    "chinese_summary": "两项新大型研究挑战了先前关于欧洲家猫起源和传播的假设，表明其历史比先前认为的更为复杂和近期。两项研究都指向突尼斯作为可能的起源地。\n\n一项由罗马第二大学领导的研究分析了来自欧洲和安纳托利亚的古代猫基因组。他们的发现表明，家猫直到公元1世纪左右才出现在欧洲，比之前认为的要晚得多。他们确定了两次引入浪潮：一次是公元前2世纪左右将非洲西北部的野猫带到撒丁岛，另一次是在罗马帝国时期引入与现代家猫品系基因相似的猫。\n\n第二项由埃克塞特大学领导的研究分析了考古骨骼和遗传数据，得出结论认为，家猫在公元前一千年初就已经存在于欧洲，早于罗马扩张的鼎盛时期。他们还确定突尼斯为起源地。两项研究都强调了文化和宗教因素在猫的驯化和迁移中的作用，指出它们在古埃及受到崇拜，并且与希腊/罗马和挪威神话中的女神有关。\n\n两项研究还记录了家猫对欧洲野猫种群的影响，表明由于竞争、疾病和杂交，数量有所下降。总的来说，这项研究表明，猫不仅仅是跟随早期农民而来，而是通过人类文化习俗、贸易和宗教信仰，分多个浪潮抵达欧洲，挑战了长期以来主要以共生关系为主的观点。这些研究强调了仅依靠线粒体DNA标记来理解猫科动物驯化的局限性。"
  },
  {
    "id": "43732416",
    "title": "More details for London's new Roman Basilica museum revealed",
    "url": "https://www.ianvisits.co.uk/articles/more-details-for-londons-new-roman-basilica-museum-revealed-80470/",
    "summary": "A new museum showcasing Roman London's history is planned for the City of London, following the discovery of significant Roman basilica ruins during pre-construction excavations for a skyscraper. The developer is reworking their plans to incorporate the museum into the building's basement.\n\nThe original development plans involved a tower above a public hall, with a 5th-floor viewing terrace. The discovery of the Roman ruins has led to internal redesigns. The basement, initially intended for facilities and cycle parking, will now house the museum. This change necessitates moving these facilities to street level and a reduction in the tower's height due to adjustments in the concrete core.\n\nThe museum will be accessible via lifts or stairs from the public hall. The exhibition will feature an immersive display of the Roman basilica remains and their historical context. A glass floor will be installed above the actual ruins for preservation, allowing visitors to view them from above. An education space and a long corridor for displaying artifacts are also planned.\n\nThe museum, curated in partnership with the London Museum, will be free to enter. The addition of the museum is expected to benefit the cafes and restaurants planned for the building's ground-floor public hall. The revised plans are currently under review by the City of London.\n",
    "chinese_title": "伦敦新建罗马巴西利卡博物馆更多细节披露",
    "chinese_summary": "伦敦市计划新建一座博物馆，展示罗马伦敦的历史。此前，在一座摩天大楼的施工前挖掘过程中，发现了重要的罗马巴西利卡遗址。开发商正在修改方案，将博物馆纳入大楼的地下室。\n\n最初的开发计划包括一座位于公共大厅上方的塔楼，以及一个位于五楼的观景平台。罗马遗址的发现导致了内部的重新设计。最初计划用于设施和自行车停车的地下室，现在将容纳博物馆。这一改变需要将这些设施移至地面层，并由于混凝土核心的调整而降低塔楼的高度。\n\n博物馆将通过电梯或楼梯从公共大厅进入。展览将以沉浸式的方式展示罗马巴西利卡遗迹及其历史背景。为了保护遗址，将在实际遗址上方安装玻璃地板，让游客可以从上方观看。还计划设置一个教育空间和一个用于展示文物的长走廊。\n\n该博物馆与伦敦博物馆合作策划，将免费入场。博物馆的增加预计将有利于计划在大楼底层公共大厅开设的咖啡馆和餐厅。修订后的计划目前正在接受伦敦市的审查。"
  },
  {
    "id": "43763291",
    "title": "Surprises in Logic (2016)",
    "url": "https://math.ucr.edu/home/baez/surprises.html",
    "summary": "John Baez's \"Surprises in Logic\" explores the limitations of mathematical proof, particularly regarding complexity. The article centers on Chaitin's incompleteness theorem, which states that there exists a complexity barrier, a number L, such that we cannot prove that any specific bit string has a Kolmogorov complexity (shortest program length) exceeding L.  The article notes that while arbitrarily complex things exist, proving their complexity exceeds a certain threshold is impossible.\n\nThe author discusses the paradox by providing an approximate size for L, estimating it to be a few kilobytes for a reasonable programming language and system of math. He notes Bruce Smith's estimation and muses about the possibility of a small program creating a video that depicts the evolution of computing culminating in itself.\n\nBaez explains the proof of Chaitin's theorem, highlighting the role of Peano arithmetic and the concept of a program U that searches for proofs of complexity exceeding a given number. He explores Smith's reservations about implementing this in C due to the lack of well-defined semantics regarding machine size.\n\nFinally, the article touches on the Kritchman-Raz proof of Gödel's second incompleteness theorem, using a rigorous version of the surprise examination paradox and Chaitin's incompleteness theorem. This approach demonstrates that if a system of math can prove its own consistency, it is not actually consistent. The article is simplified to make the complex concepts understandable.\n",
    "chinese_title": "逻辑中的惊喜 (2016)",
    "chinese_summary": "约翰·巴埃兹的《逻辑中的惊奇》探讨了数学证明的局限性，尤其是在复杂性方面。 文章以蔡廷不完备性定理为中心，该定理指出存在一个复杂性屏障，一个数字 L，使得我们无法证明任何特定的位串的柯尔莫哥洛夫复杂性（最短程序长度）超过 L。 文章指出，虽然任意复杂的事物存在，但证明它们的复杂性超过某个阈值是不可能的。\n\n作者通过提供 L 的近似大小来讨论这个悖论，估计对于一个合理的编程语言和数学系统来说，L 大约是几千字节。 他提到了 Bruce Smith 的估计，并思考了一个小程序创建一个视频，描述计算的演变最终达到它本身的可能性。\n\n巴埃兹解释了蔡廷定理的证明，强调了皮亚诺算术的作用以及程序 U 的概念，该程序 U 搜索超过给定数字的复杂性证明。 他探讨了 Smith 对用 C 实现此功能的保留意见，原因是缺乏关于机器大小的明确定义的语义。\n\n最后，文章提到了 Kritchman-Raz 对哥德尔第二不完备性定理的证明，使用了惊喜考试悖论和蔡廷不完备性定理的严格版本。 这种方法表明，如果一个数学系统能够证明其自身的一致性，那么它实际上是不一致的。 这篇文章被简化，以使复杂的概念易于理解。"
  },
  {
    "id": "43732767",
    "title": "Native American names extend earthquake history of northeastern North America",
    "url": "https://phys.org/news/2025-04-native-american-earthquake-history-northeastern.html",
    "summary": "Seismologist John Ebel suggests incorporating Native American knowledge, specifically place names and oral histories, to extend the recorded earthquake history of northeastern North America beyond the past 400 years of written records. Ebel presented his ideas at the Seismological Society of America's Annual Meeting, emphasizing the potential to better understand earthquake hazards in the region.\n\nEbel highlights examples like Moodus, Connecticut, derived from an Algonquian word meaning \"place of noises,\" where unexplained \"booms\" have been reported for centuries and modern seismology has identified earthquake swarms. Another example is Mount Nashoba near Boston, which translates to \"hill that shakes\" in a Native American language, aligning with the area's regular small earthquake activity.\n\nEbel proposes that researching tribes with words for \"earthquake,\" such as the Seneca, Cayuga, Natick, and Mi'kmaq, can indicate frequent seismic events in their territories. He advocates for interdisciplinary collaboration between seismologists and ethnologists to analyze Native American languages and narratives, potentially enabling estimations of earthquake intensity based on descriptions within these stories. Using such collaboration, the earthquake record can be expanded beyond the 400 years of European records.\n",
    "chinese_title": "美洲原住民名称延伸北美东北部地震历史",
    "chinese_summary": "地震学家约翰·埃贝尔建议结合美洲原住民的知识，特别是地名和口述历史，以扩展北美东北部有记录的地震历史，使其超出过去400年的书面记录范围。埃贝尔在美国地震学会年会上提出了他的想法，强调了更好地了解该地区地震灾害的潜力。\n\n埃贝尔强调了一些例子，如康涅狄格州的穆杜斯（Moodus），这个名字源于阿尔冈昆语，意思是“噪音之地”，几个世纪以来，那里一直有无法解释的“巨响”报告，而现代地震学已经确定了地震群。另一个例子是波士顿附近的纳肖巴山（Mount Nashoba），在一种美洲原住民语言中，它的意思是“震动的山”，这与该地区经常发生的小地震活动相吻合。\n\n埃贝尔提出，研究塞内卡、卡尤加、纳提克和米克马克等拥有“地震”一词的部落，可以表明其领土内频繁发生地震事件。他提倡地震学家和民族学家进行跨学科合作，分析美洲原住民的语言和叙事，从而有可能根据这些故事中的描述来估计地震烈度。通过这种合作，可以将地震记录扩展到欧洲记录的400年之外。"
  },
  {
    "id": "43762409",
    "title": "Show HN: I open-sourced my AI toy company that runs on ESP32 and OpenAI realtime",
    "url": "https://github.com/akdeb/ElatoAI",
    "summary": "This \"Show HN\" post introduces ElatoAI, an open-source project creating an AI toy company powered by an ESP32 microcontroller and OpenAI's real-time API. It enables real-time, uninterrupted speech-to-speech conversations with custom AI agents globally.\n\nThe project consists of three main components: a Next.js frontend for agent creation and device management, a Deno edge server for handling WebSocket communication and OpenAI API calls, and an ESP32 IoT client for audio processing and interaction. Key features include custom agent creation, customizable voices, secure WebSockets, server-side voice activity detection, Opus audio compression, and global edge performance.\n\nThe post details the DIY hardware design, including setup instructions for Supabase, Next.js frontend, Deno server, and ESP32 Arduino client. It outlines the tech stack, architecture, and PlatformIO configuration. The project boasts sub-second latency, high-quality audio via Opus codec, and up to 10 minutes of continuous conversation. Security is ensured through secure WebSockets, optional API key encryption, and Supabase's authentication and row-level security.\n\nLimitations include a 3-4 second cold start, a 10-minute conversation limit, and the absence of speech interruption detection on the ESP32. The project encourages contributions focusing on interruption detection, Arduino IDE support, and tool calling. It is licensed under the MIT License, and contributors are welcome.\n",
    "chinese_title": "展示一下HN：我开源了我的AI玩具公司，它基于ESP32和OpenAI实时运行",
    "chinese_summary": "“Show HN”帖子介绍ElatoAI：一个开源AI玩具公司，由ESP32微控制器和OpenAI实时API驱动。它能够与全球定制AI代理进行实时、不间断的语音对话。\n\n该项目由三个主要部分组成：用于代理创建和设备管理的Next.js前端，用于处理WebSocket通信和OpenAI API调用的Deno边缘服务器，以及用于音频处理和交互的ESP32 IoT客户端。主要功能包括定制代理创建、可定制的声音、安全的WebSocket、服务器端语音活动检测、Opus音频压缩和全球边缘性能。\n\n该帖子详细介绍了DIY硬件设计，包括Supabase、Next.js前端、Deno服务器和ESP32 Arduino客户端的设置说明。它概述了技术栈、架构和PlatformIO配置。该项目具有亚秒级延迟，通过Opus编解码器实现高质量音频，以及长达10分钟的连续对话。通过安全的WebSocket、可选的API密钥加密和Supabase的身份验证和行级安全性来确保安全。\n\n局限性包括3-4秒的冷启动、10分钟的对话限制以及ESP32上缺少语音中断检测。该项目鼓励大家贡献，重点是中断检测、Arduino IDE支持和工具调用。它以MIT许可证授权，欢迎贡献者。"
  },
  {
    "id": "43763223",
    "title": "David Tong Lectures on Theoretical Physics",
    "url": "https://www.damtp.cam.ac.uk/user/tong/books.html",
    "summary": "David Tong's popular lecture notes on theoretical physics have evolved into a series of textbooks published by Cambridge University Press. He encourages purchasing the books despite the availability of the free lecture notes because they offer expanded content, improved explanations, and corrected details (like the spelling of \"Schwarzschild\"). Notably, the paperback versions are priced affordably. Four books are currently available.\n\nThe text emphasizes the high regard the books have garnered within the physics community. Prominent physicists, including Nobel Laureate Frank Wilczek, Lisa Randall, Juan Maldacena, Nathan Seiberg, Sandip Trivedi, Sean Carroll, and Rajesh Gopakumar, offer glowing reviews. They praise Tong's clear, engaging writing style, his ability to convey both technical details and fundamental principles, and the books' comprehensive coverage of undergraduate and graduate curriculum. Several reviewers draw comparisons to the classic Landau and Lifshitz series, suggesting Tong's books could become similarly influential and essential for physicists. The reviews highlight the books' ability to provide instruction, insight, joy, and to reveal the interconnectedness of physics concepts.\n",
    "chinese_title": "戴维·佟理论物理讲义",
    "chinese_summary": "戴维·唐的理论物理学讲义广受欢迎，现已发展成剑桥大学出版社出版的一系列教科书。他鼓励购买这些书，尽管有免费的讲义可供使用，因为这些书提供了扩展的内容、改进的解释以及更正的细节（例如“Schwarzschild”的拼写）。值得注意的是，平装版价格实惠。目前有四本书可供选择。\n\n这些书在物理学界广受好评。包括诺贝尔奖获得者弗兰克·维尔泽克、丽莎·蓝道尔、胡安·马尔达西纳、内森·塞伯格、桑迪普·特里维迪、肖恩·卡罗尔和拉杰什·戈帕库马尔等著名物理学家都给予了高度评价。他们称赞唐清晰、引人入胜的写作风格，他传达技术细节和基本原理的能力，以及这些书对本科生和研究生课程的全面覆盖。一些评论员将这些书与经典的朗道和栗弗席兹系列相提并论，认为唐的书籍可能同样具有影响力，对物理学家来说必不可少。评论强调了这些书提供指导、洞察力、乐趣以及揭示物理概念之间相互联系的能力。"
  },
  {
    "id": "43748486",
    "title": "The effect of deactivating Facebook and Instagram on users' emotional state",
    "url": "https://www.nber.org/papers/w33697",
    "summary": "This NBER working paper, \"The Effect of Deactivating Facebook and Instagram on Users’ Emotional State,\" investigates the impact of social media deactivation on emotional well-being. The study, conducted through two large randomized experiments before the 2020 U.S. election, found that deactivating Facebook for six weeks led to a 0.060 standard deviation improvement in an index measuring happiness, depression, and anxiety compared to a control group who deactivated for only one week. Similarly, deactivating Instagram for six weeks resulted in a 0.041 standard deviation improvement.\n\nExploratory analysis suggests that the positive effect of Facebook deactivation was more pronounced among individuals over 35, while the positive effect of Instagram deactivation was primarily observed in women under 25.\n\nNotably, the paper includes extensive acknowledgements and disclosures, revealing that many of the authors have ties to Meta (Facebook's parent company) through past employment, consulting work, research funding, honoraria, event attendance, or stock ownership. This raises potential conflict-of-interest considerations regarding the study's findings.\n",
    "chinese_title": "停用脸书和照片墙对用户情绪状态的影响",
    "chinese_summary": "停用Facebook和Instagram对用户情绪状态的影响\nNBER工作论文《停用Facebook和Instagram对用户情绪状态的影响》研究了社交媒体停用对情绪健康的影响。该研究通过2020年美国大选前的两项大型随机实验进行，发现停用Facebook六周会导致衡量幸福感、抑郁和焦虑的指标比仅停用一周的对照组提高0.060个标准差。同样，停用Instagram六周导致该指标提高0.041个标准差。\n\n探索性分析表明，Facebook停用的积极影响在35岁以上的人群中更为明显，而Instagram停用的积极影响主要在25岁以下的女性中观察到。\n\n值得注意的是，该论文包含了大量的致谢和披露信息，表明许多作者通过以往的雇佣关系、咨询工作、研究经费、酬金、参加活动或股票所有权与Meta（Facebook的母公司）有关联。这引发了关于研究结果潜在的利益冲突考量。"
  },
  {
    "id": "43766979",
    "title": "Show HN: Durable Python Workflows",
    "url": "https://github.com/autokitteh/autokitteh",
    "summary": "AutoKitteh is a developer platform for workflow automation and orchestration, offering a code-based alternative to no/low-code solutions. Built upon Temporal, it simplifies durable workflow execution in Python, Starlark, and soon JavaScript, abstracting away much of the underlying infrastructure complexity. It can be self-hosted or used as a managed cloud iPaaS (currently in beta).\n\nKey features include a scalable \"serverless\" platform, an API-first architecture (gRPC/HTTP), and built-in integrations with services like Slack, GitHub, Twilio, ChatGPT, Gemini, and Gmail.\n\nAutoKitteh handles the complexities of building reliable and scalable workflows, enabling developers to focus on business logic. It offers features such as secure API integrations, user-friendly management and debugging, automated recovery without state loss, built-in durability, and readiness for large-scale deployments.\n\nThe platform provides a CLI, a VS Code extension, and a web UI for managing workflows. Getting started is outlined in a quickstart guide, which covers installation, server setup, project creation, and a resilience demo.\n\nThe open-source AutoKitteh server is designed for self-hosted environments. To learn more about the cloud iPaaS beta, users can contact meow@autokitteh.com. Build instructions and requirements are detailed in the document.\n",
    "chinese_title": "Show HN: 持久化 Python 工作流",
    "chinese_summary": "AutoKitteh是一个工作流自动化和编排的开发者平台，提供了一种基于代码的替代方案，以取代无代码/低代码解决方案。它构建于Temporal之上，简化了Python、Starlark以及即将推出的JavaScript中的持久性工作流执行，抽象掉了许多底层基础设施的复杂性。它可以自托管或用作托管云iPaaS（目前处于测试阶段）。\n\n主要功能包括可扩展的“无服务器”平台、API优先架构（gRPC/HTTP）以及与Slack、GitHub、Twilio、ChatGPT、Gemini和Gmail等服务的内置集成。\n\nAutoKitteh处理构建可靠且可扩展的工作流的复杂性，使开发人员能够专注于业务逻辑。它提供安全API集成、用户友好的管理和调试、无状态丢失的自动恢复、内置持久性以及大规模部署准备等功能。\n\n该平台提供CLI、VS Code扩展程序和Web UI来管理工作流。快速入门指南概述了如何开始，涵盖安装、服务器设置、项目创建和弹性演示。\n\n开源的AutoKitteh服务器专为自托管环境而设计。要了解有关云iPaaS测试版的更多信息，用户可以联系meow@autokitteh.com。文档中详细说明了构建说明和要求。"
  },
  {
    "id": "43745987",
    "title": "Verus: Verified Rust for low-level systems code",
    "url": "https://github.com/secure-foundations/verus",
    "summary": "Verus is a tool that enables developers to verify the correctness of Rust code by writing specifications, which Verus then statically checks using powerful solvers. This ensures that the code will always satisfy the specifications without needing runtime checks. Although Verus supports a subset of Rust, it expands verification capabilities, especially for low-level systems code involving raw pointers.\n\nCurrently under active development, Verus may have broken or missing features, and its documentation is incomplete. Users are encouraged to seek assistance on the Zulip channel. Despite its ongoing development, Verus has been utilized in various industry and academic projects, with research papers published about it.\n\nTo get started, users can try Verus in their browser via the Verus Playground or install it for more complex development. The documentation includes a tutorial, API documentation, and a guide for verifying concurrent code. Resources like publications, projects, tutorial materials, and examples are available to showcase Verus in action.\n\nContributions to Verus are welcomed, and users can report issues or start discussions on GitHub or join the Zulip channel for real-time assistance. Verus uses GitHub discussions for feature requests and GitHub issues for actionable bugs. The project is grateful to Zulip for sponsoring free hosting and to Johanna Polzin for her contribution to the design of the Verus Logo.\n",
    "chinese_title": "Verus：用于底层系统代码的验证Rust",
    "chinese_summary": "Verus 是一个工具，它使开发者能够通过编写规范来验证 Rust 代码的正确性，然后 Verus 使用强大的求解器静态地检查这些规范。这确保了代码始终满足规范，而无需运行时检查。虽然 Verus 支持 Rust 的一个子集，但它扩展了验证能力，尤其是在涉及原始指针的底层系统代码方面。\n\nVerus 目前正在积极开发中，可能存在损坏或缺失的功能，且其文档尚不完整。我们鼓励用户在 Zulip 频道上寻求帮助。尽管 Verus 还在不断开发中，但它已被用于各种行业和学术项目中，并发表了相关的研究论文。\n\n要开始使用，用户可以通过 Verus Playground 在浏览器中尝试 Verus，或者安装它以进行更复杂的开发。文档包括一个教程、API 文档和一个用于验证并发代码的指南。出版物、项目、教程材料和示例等资源可用于展示 Verus 的实际应用。\n\n我们欢迎对 Verus 的贡献，用户可以在 GitHub 上报告问题或发起讨论，或者加入 Zulip 频道以获得实时帮助。Verus 使用 GitHub 讨论来处理功能请求，并使用 GitHub 问题来处理可操作的错误。该项目感谢 Zulip 赞助免费托管，并感谢 Johanna Polzin 对 Verus 徽标设计的贡献。"
  },
  {
    "id": "43774236",
    "title": "IAM Role Trust Policies: Misconfigurations Hiding in Plain Sight",
    "url": "https://www.token.security/blog/iam-role-trust-policies-misconfigurations-hiding-in-plain-sight",
    "summary": "This blog post highlights the often overlooked and easily misconfigured nature of IAM role trust policies in AWS, arguing they are a significant source of privilege escalation risks. The author points out the lack of clear and comprehensive documentation on trust policies as a contributing factor to these misconfigurations. The post identifies two common and dangerous mistakes:\n\n1.  **Trusting all principals within the role's account:** Using `arn:aws:iam::<account_id>:root` in a trust policy effectively grants *any* IAM principal within that account (users, roles, Lambda functions, etc.) the ability to assume the role, bypassing the intention of restricting access. This creates an easy privilege escalation path if an attacker gains access to any identity in the account with `sts:AssumeRole` permissions.\n\n2.  **Assuming an AND relationship between multiple principals:** When combining different principal types (e.g., an AWS account and a service principal) within the same \"Principal\" section, AWS evaluates them as a logical OR, not AND. This means that *either* principal can assume the role independently. For example, mistakenly believing a trust policy allows only EC2 instances from a specific account to assume a role, when it actually allows *any* EC2 instance in the local account *or* any principal in the specified account to assume it.\n\nThe article emphasizes that these subtle mistakes can have severe security implications and advocates for a better understanding of trust policy nuances to properly secure IAM roles. The author promises a subsequent post focusing on common mistakes in cross-account trust relationships.\n",
    "chinese_title": "IAM角色信任策略：明目张胆的错误配置",
    "chinese_summary": "这篇博文强调了AWS中IAM角色信任策略经常被忽视且容易配置错误的特性，认为它们是权限提升风险的重要来源。作者指出，缺乏关于信任策略的清晰和全面的文档是导致这些配置错误的一个因素。该文章指出了两个常见且危险的错误：\n\n1.  **信任角色账户内的所有主体：** 在信任策略中使用`arn:aws:iam::<account_id>:root`实际上授予了该账户内的 *任何* IAM主体（用户、角色、Lambda函数等）承担该角色的能力，绕过了限制访问的意图。如果攻击者获得账户中任何具有`sts:AssumeRole`权限的身份的访问权限，这将创建一个简单的权限提升路径。\n\n2.  **假定多个主体之间是AND关系：** 当在同一“Principal”部分中组合不同的主体类型（例如，AWS账户和某个服务主体）时，AWS会将它们评估为逻辑OR，而不是AND。这意味着 *任何一个* 主体都可以独立承担该角色。例如，错误地认为信任策略仅允许特定账户中的EC2实例承担角色，而实际上它允许本地账户中的 *任何* EC2实例 *或* 指定账户中的 *任何* 主体承担该角色。\n\n该文章强调，这些细微的错误可能会产生严重的安全性影响，并倡导更好地理解信任策略的细微差别，以正确保护IAM角色。作者承诺后续文章将重点关注跨账户信任关系中的常见错误。"
  },
  {
    "id": "43765084",
    "title": "How long does it take to create a new habit? (2015)",
    "url": "https://thelogicaloptimist.com/index.php/2015/10/25/the-21-day-myth-create-new-habit/",
    "summary": "This 2015 article addresses the popular myth that it takes 21 days to form a new habit, debunking it by referencing research published in the European Journal of Social Psychology. While the 21-day idea originated from Dr. Maxwell Maltz's observations, it wasn't research-based, and the statement was often simplified.\n\nThe study by Lally et al. (\"How habits are formed\") followed 96 people for 12 weeks, revealing that habit formation is a longer process, ranging from 2 to 8 months, with an average of 66 days. The duration depends on the habit, the individual, and their circumstances.\n\nImportantly, the study found that missing an opportunity to perform the new behavior doesn't significantly hinder the habit formation process.\n\nThe author argues against adhering to strict timelines like the 21-day rule or even the 66-day average. They emphasize that individual experiences vary, and dedication to the desired change is the most critical factor. The author advises focusing on the \"why\" behind the habit change, believing that personal commitment and control over one's behavior are more important than adhering to a specific timeframe. Ultimately, creating new habits should be driven by individual motivation rather than arbitrary deadlines.\n",
    "chinese_title": "养成一个新习惯需要多久？(2015)",
    "chinese_summary": "本文（2015年）驳斥了广为流传的“养成一个新习惯需要21天”这一说法，并引用了发表在《欧洲社会心理学杂志》上的研究成果来证明其谬误。尽管“21天”的说法源于马克斯韦尔·马尔茨医生的观察，但它并非基于研究，且该说法常常被简化。\n\nLally等人发表的“习惯是如何形成的”的研究对96人进行了12周的跟踪，结果表明习惯的形成是一个更长的过程，从2个月到8个月不等，平均为66天。持续时间取决于习惯、个人及其所处环境。\n\n重要的是，该研究发现，错过一次执行新行为的机会并不会显著阻碍习惯的形成过程。\n\n作者反对固守像“21天规则”甚至“66天平均时间”这样的严格时间表。他们强调，个人经历各不相同，而对渴望改变的投入才是最重要的因素。作者建议关注习惯改变背后的“原因”，认为个人承诺和对自身行为的控制比坚持特定时间框架更重要。最终，培养新习惯应该由个人动机驱动，而不是任意设定的截止日期。"
  },
  {
    "id": "43770618",
    "title": "Commission Finds Apple and Meta in Breach of the Digital Markets Act",
    "url": "https://ec.europa.eu/commission/presscorner/detail/en/ip_25_1085",
    "summary": "The European Commission has preliminarily found that Apple and Meta are in breach of the Digital Markets Act (DMA), a landmark EU law aimed at curbing the market power of tech giants. While the exact details are still emerging and further investigation is required, the initial findings suggest that Apple and Meta have failed to adequately comply with the DMA's requirements.\n\nThe DMA focuses on preventing \"gatekeepers\" (dominant online platforms) from engaging in anti-competitive practices. The specific violations alleged against Apple and Meta likely pertain to these core principles. For example, Apple may be found to be restricting app developers' ability to communicate freely with their users and offer alternative payment options outside of the App Store. Meta's potential violations may involve unfair data usage practices or restrictions on interoperability with competing social media platforms.\n\nIf the Commission ultimately concludes that Apple and Meta have breached the DMA, they could face significant financial penalties, including fines of up to 10% of their global annual turnover. More importantly, they could be forced to make substantial changes to their business practices to ensure fair competition and user choice within the digital market. The investigations are ongoing, and both companies have the opportunity to respond to the Commission's preliminary findings and argue their case. This represents a significant step in the EU's efforts to regulate Big Tech and promote a more competitive digital landscape.\n",
    "chinese_title": "委员会认定苹果和Meta违反《数字市场法》",
    "chinese_summary": "欧盟委员会初步认定苹果和Meta违反了《数字市场法案》(DMA)，这是一项旨在遏制科技巨头市场力量的欧盟里程碑式法律。尽管具体细节仍在浮出水面，仍需进一步调查，但初步调查结果表明，苹果和Meta未能充分遵守DMA的要求。\n\nDMA的重点是防止“看门人”（占主导地位的在线平台）从事反竞争行为。对苹果和Meta提出的具体违规指控可能与这些核心原则有关。例如，苹果可能被认定为限制应用程序开发者与用户自由沟通以及在App Store之外提供替代支付选项的能力。Meta的潜在违规行为可能涉及不公平的数据使用行为或限制与竞争性社交媒体平台的互操作性。\n\n如果欧盟委员会最终认定苹果和Meta违反了DMA，它们可能面临巨额罚款，包括高达其全球年度营业额10%的罚款。更重要的是，它们可能被迫对其商业行为进行重大调整，以确保数字市场中的公平竞争和用户选择。调查仍在进行中，两家公司都有机会回应欧盟委员会的初步调查结果并为其辩护。这代表了欧盟监管大型科技公司并促进更具竞争力的数字环境方面迈出的重要一步。"
  },
  {
    "id": "43760262",
    "title": "The many ways tarrifs will hit electronics",
    "url": "https://spectrum.ieee.org/tariffs-electronics-prices",
    "summary": "This article, \"The Many Ways Tariffs Will Hit Your Electronics,\" features an interview with IPC chief economist Shawn DuBravac about the impact of tariffs on the consumer electronics industry. Published in IEEE Spectrum on April 16, 2025, the interview anticipates discussing the multifaceted ways tariffs will affect the production and pricing of electronics.\n\nWhile the article preview doesn't provide specific details on the ways tariffs will impact electronics, it signals that the interview will likely explore:\n\n*   **Increased costs:** Tariffs, as taxes on imported goods, directly increase the cost of components and finished products.\n*   **Supply chain disruptions:** Tariffs can disrupt established supply chains, forcing companies to seek alternative sources or relocate production.\n*   **Impact on consumers:** Increased costs will likely be passed on to consumers in the form of higher prices for electronic devices.\n*   **Competitive landscape:** Tariffs can shift the competitive landscape, potentially favoring domestic producers or companies located in countries not subject to the tariffs.\n*   **Economic consequences:** Broader economic consequences, such as reduced trade and investment, could also be discussed.\n\nThe interview aims to provide insights into how tariffs will reshape the electronics industry.\n",
    "chinese_title": "关税冲击电子产品的多重方式",
    "chinese_summary": "关税冲击电子产品的多种方式：专访IPC首席经济学家肖恩·杜布拉瓦克\n\n本文《关税冲击电子产品的多种方式》刊登于IEEE Spectrum，2025年4月16日。文章专访了IPC首席经济学家肖恩·杜布拉瓦克，探讨关税对消费电子行业的影响。专访预计将讨论关税影响电子产品生产和定价的多个方面。\n\n虽然文章预览未提供关税影响电子产品的具体细节，但预示着访谈可能探讨以下内容：\n\n*   **成本增加：** 关税作为对进口商品的税收，直接增加了零部件和成品的价格。\n*   **供应链中断：** 关税会扰乱既定的供应链，迫使公司寻找替代来源或迁移生产。\n*   **对消费者的影响：** 成本增加可能会以电子设备价格上涨的形式转嫁给消费者。\n*   **竞争格局：** 关税会改变竞争格局，可能有利于国内生产商或位于未受关税影响的国家的公司。\n*   **经济后果：** 还可能讨论更广泛的经济后果，例如贸易和投资减少。\n\n本次专访旨在深入了解关税将如何重塑电子行业。"
  },
  {
    "id": "43764783",
    "title": "The Truth about Atlantis (2019)",
    "url": "https://talesoftimesforgotten.com/2019/03/26/the-truth-about-atlantis/",
    "summary": "This article debunks the popular belief in the existence of Atlantis, citing a significant percentage of Americans who believe in the lost civilization. It argues that Atlantis is pure fiction, originating from Plato's dialogues, specifically \"Timaios\" and \"Kritias.\"\n\nThe article explains that Plato introduces the story of Atlantis through the character of Kritias, who claims to have heard it from Solon, who in turn heard it from Egyptian priests. The story describes Atlantis as a powerful island nation that attacked Europe and Asia before being destroyed by earthquakes and floods.\n\nThe author refutes the idea that Plato wouldn't invent such a story, highlighting his penchant for using fictional narratives to illustrate philosophical points, referencing examples from \"Republic\" and \"Symposium.\" They argue that the story of Atlantis shares thematic similarities with other fictional tales attributed to Plato, such as its setting in extremely ancient times.\n\nFurthermore, the author challenges the credibility of Plato's alleged sources. The character Kritias, a member of the Thirty Tyrants, a brutal oligarchic regime, narrates the story, which raises questions about its historical accuracy. The narrative context of the dialogues is also likely fictional. The author concludes that the belief in Atlantis persists due to its romantic appeal, despite being demonstrably a product of Plato's imagination.\n",
    "chinese_title": "亚特兰蒂斯真相 (2019)",
    "chinese_summary": "本文旨在驳斥关于亚特兰蒂斯存在的普遍说法，指出相当比例的美国人相信这个失落的文明。文章论证亚特兰蒂斯纯属虚构，起源于柏拉图的对话录，特别是《蒂迈欧篇》和《克里提亚斯篇》。\n\n文章解释说，柏拉图通过克里提亚斯这个人物引入了亚特兰蒂斯的故事，克里提亚斯声称是从梭伦那里听说的，而梭伦又是从埃及祭司那里听说的。这个故事将亚特兰蒂斯描述为一个强大的岛国，它曾袭击欧洲和亚洲，最终被地震和洪水摧毁。\n\n作者驳斥了柏拉图不会编造这种故事的观点，强调他倾向于使用虚构叙事来阐明哲学观点，并引用了《理想国》和《会饮篇》中的例子。他们认为，亚特兰蒂斯的故事与其他归因于柏拉图的虚构故事有着主题上的相似之处，例如都设定在极其古老的时代。\n\n此外，作者质疑柏拉图所谓的信息来源的可信度。故事由三十僭主之一，一个残酷的寡头政权的成员克里提亚斯叙述，这引发了对其历史准确性的质疑。对话录的叙事背景也可能是虚构的。作者的结论是，对亚特兰蒂斯的信仰之所以持续存在，是因为它具有浪漫的吸引力，尽管它显然是柏拉图想象力的产物。"
  },
  {
    "id": "43759073",
    "title": "Attacking My Landlord's Boiler",
    "url": "https://blog.videah.net/attacking-my-landlords-boiler/",
    "summary": "This blog post details the author's project to remotely control their landlord's boiler to overcome the limitations of the existing thermostat. Frustrated by uneven heating and lack of automation, the author bypassed the need for landlord approval and an electrician by exploiting the existing radio communication between the thermostat and boiler.\n\nInitially, the author researched the thermostat's model, discovering it communicated in the 868MHz range. After unsuccessful attempts to reverse-engineer the protocol using cheaper microcontrollers, they opted for a \"replay attack,\" recording and rebroadcasting the thermostat's signals to control the boiler directly.\n\nThey used an RTL-SDR to visualize the radio packets and a HackRF One (a clone purchased inexpensively) to transmit the recorded \"on\" and \"off\" signals. By recording the signals sent by the thermostat, they were able to \"yell back\" commands using the HackRF and turn the boiler on and off.\n\nThe author then integrated the HackRF with their Home Assistant server by creating a simple web server and using `curl` commands to send the recorded signals. This allowed them to automate the heating based on factors like room temperature, sleep schedule, and location.\n\nDespite considering the HackRF overkill for a simple on/off switch, the author prioritized functionality and reliability. They are now able to remotely and automatically control their apartment's heating. Finally, the blog explains the UK's Online Safety Act and the author's decision to remove the comment section to avoid potentially ruinous fines.\n",
    "chinese_title": "攻击我房东的锅炉",
    "chinese_summary": "本文详细介绍了作者远程控制房东锅炉的项目，旨在克服现有温控器的局限性。由于对供暖不均和缺乏自动化感到沮丧，作者利用温控器和锅炉之间现有的无线电通信绕过了房东批准和电工的需求。\n\n最初，作者研究了温控器的型号，发现它在 868MHz 范围内通信。在使用更便宜的微控制器逆向工程协议失败后，他们选择了“重放攻击”，记录并重新广播温控器的信号以直接控制锅炉。\n\n他们使用 RTL-SDR 可视化无线电数据包，并使用 HackRF One（一款廉价购买的克隆产品）来传输记录的“开启”和“关闭”信号。通过记录温控器发送的信号，他们能够使用 HackRF“喊回去”命令，并打开和关闭锅炉。\n\n然后，作者通过创建一个简单的 Web 服务器并使用 `curl` 命令发送记录的信号，将 HackRF 与他们的 Home Assistant 服务器集成。这使得他们能够根据房间温度、睡眠时间表和位置等因素自动控制供暖。\n\n尽管作者认为 HackRF 对于一个简单的开关来说过于强大，但他们优先考虑了功能和可靠性。他们现在能够远程和自动控制他们公寓的供暖。最后，该博客解释了英国的《在线安全法案》以及作者决定删除评论区以避免潜在的灾难性罚款。"
  },
  {
    "id": "43765748",
    "title": "Show HN: Dosidicus – A digital pet with a simple neural network",
    "url": "https://github.com/ViciousSquid/Dosidicus",
    "summary": "Dosidicus is a digital pet \"Tamagotchi\" that incorporates a simple neural network, allowing it to learn and adapt its behavior. This research project, available on GitHub, focuses on visualizing and understanding neural networks and Hebbian learning. The squid autonomously makes decisions based on its needs (hunger, sleepiness, etc.), using a simulated vision cone to find food.\n\nThe neural network at its core allows the squid to form associations, and its weights are adjusted through Hebbian learning. Experiences stored in short-term and long-term memory also play a role in decision-making. Interestingly, Dosidicus can even generate new neurons (neurogenesis) in response to its environment.\n\nThe project includes a comprehensive needs management system, tracking factors like hunger, sleepiness, happiness, and cleanliness, which impact the squid's health. Neglecting these needs can lead to sickness and death. Additionally, Dosidicus features seven personality types that influence its behavior and allows users to customize the environment with decorations. Debug tools are available to directly view and edit the squid's internal states.\n",
    "chinese_title": "展示HN: Dosidicus – 一款拥有简单神经网络的电子宠物",
    "chinese_summary": "Dosidicus：一款结合了简单神经网络的电子宠物“拓麻歌子”，使其能够学习并适应行为。这个开源于GitHub的研究项目，专注于神经网络和赫布学习的可视化与理解。该鱿鱼基于其需求（饥饿、困倦等）自主做出决策，并使用模拟的视觉锥体寻找食物。\n\n其核心的神经网络使鱿鱼能够形成关联，并通过赫布学习调整权重。存储在短期和长期记忆中的经验也在决策中发挥作用。有趣的是，Dosidicus甚至可以根据环境生成新的神经元（神经发生）。\n\n该项目包含一个全面的需求管理系统，追踪饥饿、困倦、快乐和清洁度等影响鱿鱼健康的因素。忽视这些需求会导致生病和死亡。此外，Dosidicus具有七种影响其行为的性格类型，并允许用户使用装饰品自定义环境。调试工具可用于直接查看和编辑鱿鱼的内部状态。"
  },
  {
    "id": "43734938",
    "title": "Pike – a dynamic programming language with a syntax similar to Java and C",
    "url": "https://pike.lysator.liu.se/",
    "summary": "This article introduces Pike, a dynamic programming language with a Java and C-like syntax, designed for ease of learning, rapid data manipulation, and quick execution due to its powerful built-in data types. It's available under the GNU GPL, GNU LGPL, and MPL licenses, making it free for almost any use.\n\nRecent news highlights include announcements of Pike developer meet-ups in Linköping, Sweden, for Q1 and Q2 of 2025. Also announced is the release of Pike 8.0 release 16 (build 8.0.1956), with source code and binary builds for MacOS, Linux, and Windows available for download. Furthermore, the Pike Conference 2024 was held in Linköping in early November. Finally, the release of Pike 9.0.9 Beta, the second beta of the Pike 9.0 series, intended as the next stable version, is announced with a link to download the distribution.\n",
    "chinese_title": "Pike – 一种语法类似于 Java 和 C 的动态编程语言",
    "chinese_summary": "本文介绍 Pike，一种具有 Java 和 C 类似语法的动态编程语言，它易于学习、数据处理速度快，并且由于其强大的内置数据类型而能够快速执行。它在 GNU GPL、GNU LGPL 和 MPL 许可下发布，几乎可以免费用于任何用途。\n\n最新消息包括宣布将于 2025 年第一季度和第二季度在瑞典林雪平举行 Pike 开发者聚会。同时宣布发布 Pike 8.0 release 16（构建版本 8.0.1956），其源代码和适用于 MacOS、Linux 和 Windows 的二进制构建版本均可供下载。此外，Pike 2024 大会于 11 月初在林雪平举行。最后，宣布发布 Pike 9.0.9 Beta，即 Pike 9.0 系列的第二个 Beta 版本，旨在成为下一个稳定版本，并提供下载发行版的链接。"
  },
  {
    "id": "43757341",
    "title": "101 BASIC Computer Games",
    "url": "https://github.com/maurymarkowitz/101-BASIC-Computer-Games",
    "summary": "This document describes a collection of BASIC computer game programs from the 1975 book \"101 BASIC Computer Games\" by David Ahl, published by Digital Equipment Corp. It's important to note that this collection is *different* from the more famous \"BASIC Computer Games\" (BCG) book also by Ahl, with several unique games.\n\nThe document highlights the diversity of BASIC dialects used in the book. The code spans incompatible versions, including Dartmouth BASIC, HP BASIC, BASIC-PLUS, and EduSystem BASIC. Identifying the correct dialect for each game is a challenge as it's often not specified.\n\nThe collection serves as a valuable example of early BASIC programming styles, showcasing differences in syntax, statement separation, and shorthand commands. The programs were converted using OCR and AI tools, with relatively few errors due to the good print quality of the original book.\n\nA main motivation for creating this collection is to provide sample code for improving RetroBASIC, aiming to allow these programs to run correctly without modification.\n\nThe document provides a detailed listing of the games, including their name, description, page number in the book, and the likely BASIC dialect used. The games cover a wide range of genres, from strategy games like NIM and CHECKR to simulations like HMRABI and STOCK, to simple arcade games like SLOTS and GUNNER. The variety underscores the resourcefulness of early computer game developers.\n",
    "chinese_title": "101个基本电脑游戏",
    "chinese_summary": "本文档介绍了一系列来自1975年由Digital Equipment Corp.出版的David Ahl著作《101个BASIC电脑游戏》一书中的BASIC电脑游戏程序。需要注意的是，本合集与Ahl所著的更为著名的《BASIC电脑游戏》（BCG）一书*不同*，包含几个独特的游戏。\n\n本文档重点介绍了该书中使用的BASIC方言的多样性。代码跨越了不兼容的版本，包括Dartmouth BASIC、HP BASIC、BASIC-PLUS和EduSystem BASIC。由于通常未指定，因此识别每个游戏的正确方言是一项挑战。\n\n本合集是早期BASIC编程风格的一个宝贵例子，展示了语法、语句分隔和速记命令的差异。这些程序使用OCR和AI工具进行转换，由于原书的良好印刷质量，错误相对较少。\n\n创建本合集的主要动机是为改进RetroBASIC提供示例代码，旨在使这些程序无需修改即可正确运行。\n\n本文档提供了游戏的详细列表，包括游戏名称、描述、在书中的页码以及可能使用的BASIC方言。游戏涵盖了广泛的类型，从NIM和CHECKR等策略游戏到HMRABI和STOCK等模拟游戏，再到SLOTS和GUNNER等简单的街机游戏。这种多样性强调了早期电脑游戏开发者的智慧。"
  },
  {
    "id": "43737916",
    "title": "Libro: a command-line tool to track your books",
    "url": "https://github.com/mkaz/libro",
    "summary": "Libro is a command-line tool designed to track your reading history, storing data locally in a SQLite database. It offers commands for adding books (`libro add`), displaying books read by year (`libro show --year` or `libro report`), showing book details by ID (`libro show`), and generating reports on reading habits by year or author (`libro report --author`). The tool presents this data in a formatted table and bar graph format.\n\nLibro supports importing reading history from a Goodreads export CSV file. On its first run, Libro creates a `libro.db` file in a location determined by a hierarchy: command-line `--db` flag, current directory, `LIBRO_DB` environment variable, or the platform's data directory.\n\nThe database schema includes a `Books` table with fields for ID, title, author, pages, publication year, and genre (Fiction/Nonfiction), and a `Reviews` table with fields for ID, book ID, date read, rating, and review.\n\nInstallation is done via `pip install libro-book` or by cloning the GitHub repository and using `pip install -e .`.\n",
    "chinese_title": "Libro：一个用于追踪书籍的命令行工具",
    "chinese_summary": "Libro是一个命令行工具，旨在追踪你的阅读历史，并将数据本地存储在SQLite数据库中。它提供添加书籍(`libro add`)、按年份显示已读书籍(`libro show --year` 或 `libro report`)、按ID显示书籍详情(`libro show`)，以及按年份或作者生成阅读习惯报告(`libro report --author`)等命令。该工具以格式化的表格和条形图形式呈现这些数据。\n\nLibro支持从Goodreads导出CSV文件导入阅读历史。首次运行时，Libro会在一个由以下优先级决定的位置创建一个`libro.db`文件：命令行`--db`标志、当前目录、`LIBRO_DB`环境变量或平台的data目录。\n\n数据库模式包含一个`Books`表，其中包含ID、标题、作者、页数、出版年份和类型（小说/非小说）等字段，以及一个`Reviews`表，其中包含ID、书籍ID、阅读日期、评分和评论等字段。\n\n可以通过`pip install libro-book`或克隆GitHub仓库并使用`pip install -e .`来完成安装。"
  },
  {
    "id": "43760625",
    "title": "Does RL Incentivize Reasoning in LLMs Beyond the Base Model?",
    "url": "https://limit-of-rlvr.github.io/",
    "summary": "Yang Yue is researching how to incentivize reasoning in large language models (LLMs) and multimodal large language models (MLLMs). His research focuses on:\n\n*   **Developing new paradigms for incentivizing reasoning:** He's exploring novel methods to encourage LLMs/MLLMs to reason more effectively.\n*   **Generalized World Models:** He's working on creating models that can better understand and represent the world around them.\n*   **Generalization of Visual Language Alignment (VLA):** He aims to improve how LLMs connect visual and textual information, making them more robust and adaptable.\n\nYang is actively seeking collaborators within companies that provide:\n\n*   **Freedom for fundamental research:** He desires the ability to delve into challenging, foundational questions.\n*   **Abundant resources:** He needs access to the necessary computational power, data, and expertise.\n*   **Strong technical atmosphere:** He values being in an environment with other talented researchers.\n\nHe is also interested in a Ph.D. visit. The article essentially is a call for collaboration, outlining his research interests and the kind of environment he seeks.\n",
    "chinese_title": "强化学习能否激励大语言模型产生超出基础模型的推理能力？",
    "chinese_summary": "杨越正在研究如何激励大型语言模型（LLMs）和多模态大型语言模型（MLLMs）进行推理。他的研究重点包括：\n\n*   **开发激励推理的新范式：** 他正在探索鼓励LLMs/MLLMs更有效推理的新方法。\n*   **广义世界模型：** 他致力于创建能够更好地理解和表示周围世界的模型。\n*   **视觉语言对齐（VLA）的泛化：** 他的目标是改进LLMs连接视觉和文本信息的方式，使其更具鲁棒性和适应性。\n\n杨越积极寻求与以下公司内的合作者：\n\n*   **提供基础研究的自由：** 他渴望能够深入研究具有挑战性的基础问题。\n*   **拥有丰富的资源：** 他需要获得必要的计算能力、数据和专业知识。\n*   **具有强大的技术氛围：** 他重视与才华横溢的研究人员共事的环境。\n\n他还对博士访问感兴趣。 这篇文章本质上是一份合作邀约，概述了他的研究兴趣和他所寻求的环境。"
  },
  {
    "id": "43735378",
    "title": "Making a smart bike dumb so it works again",
    "url": "https://francisco.io/blog/making-a-smart-bike-dumb-work-again/",
    "summary": "Francisco inherited a \"smart\" bike with lights that only worked through an app, but the company went bankrupt rendering the app useless. He initially used a cheap, easily stolen, store-bought light. Determined to make the bike's integrated lights functional again, he decided to hack a solution.\n\nHis goals were: avoid permanent damage, utilize his 3D printer, keep the existing lights, upgrade to USB-C charging, make swapping components easy, and prevent fire hazards. He found the internal battery and light connectors inside the bike's frame. He then purchased a USB-C charging board for 3.7V LiPo batteries with connectors for both battery and load.\n\nHe soldered wires to the existing light connectors and the charging board, creating a new circuit. This new circuit was housed in a custom 3D-printed cover. To enhance safety, he shrink-wrapped all exposed connections, taped the connectors, and added a resistor.\n\nThe hack connected the front and back lights, so a single button press now activates both. The modified bike can now be charged with USB-C. Francisco concludes that sometimes the simplest solutions are the best.\n",
    "chinese_title": "让智能自行车变笨，让它重新运转",
    "chinese_summary": "弗朗西斯科继承了一辆带灯的“智能”自行车，但灯只能通过应用程序控制，而该公司已经破产，导致该应用程序毫无用处。他最初使用了一个廉价的、容易被盗的、商店购买的车灯。为了让自行车自带的灯重新亮起来，他决定自己动手破解。\n\n他的目标是：避免永久性损坏、利用他的3D打印机、保留现有的灯、升级到USB-C充电、使组件更换变得容易，以及防止火灾隐患。他在自行车车架内找到了内部电池和灯的连接器。然后，他购买了一个用于3.7V锂聚合物电池的USB-C充电板，该充电板带有电池和负载的连接器。\n\n他将电线焊接到现有的灯连接器和充电板上，创建了一个新的电路。这个新电路被放置在一个定制的3D打印外壳中。为了提高安全性，他用热缩管包裹了所有裸露的连接，用胶带固定了连接器，并增加了一个电阻。\n\n这个破解方案将前后灯连接起来，现在只需按一下按钮即可同时激活前后灯。改装后的自行车现在可以通过USB-C充电。弗朗西斯科得出结论，有时最简单的解决方案就是最好的。"
  },
  {
    "id": "43771882",
    "title": "5th Circuit Lets AT&T Off the Hook for Major Location Data Privacy Violations",
    "url": "https://www.techdirt.com/2025/04/23/5th-circuit-obediently-lets-att-off-the-hook-for-major-location-data-privacy-violations/",
    "summary": "This short article criticizes a 5th Circuit court decision that essentially absolves AT&T of responsibility for major location data privacy violations. The author expresses strong cynicism, stating this outcome is unsurprising given AT&T's history of alleged exploitation of US citizens, seemingly enabled and even financially rewarded by the government over many years. The article implies a pattern of AT&T actions that harm citizens with government approval and financial incentives. The core takeaway is a disappointment and distrust in the legal and regulatory systems that are perceived to be protecting AT&T's interests at the expense of individual privacy.\n",
    "chinese_title": "第五巡回法院免除AT&T重大位置数据隐私违规责任",
    "chinese_summary": "本文批评第五巡回法院的一项判决，该判决实际上免除了AT&T对重大位置数据隐私侵犯的责任。作者表达了强烈的愤世嫉俗，认为考虑到AT&T长期以来被指控剥削美国公民的历史，以及政府多年来似乎对此行为的纵容甚至经济奖励，这一结果并不令人意外。文章暗示AT&T的行为模式在损害公民利益的同时，获得了政府的批准和经济激励。核心要点是对法律和监管体系的失望和不信任，这些体系被认为正在保护AT&T的利益，而牺牲了个人隐私。"
  },
  {
    "id": "43769486",
    "title": "Advanced Python Features",
    "url": "https://blog.edward-li.com/tech/advanced-python-features/",
    "summary": "This article highlights 14 advanced Python features that go beyond common tricks. It aims to elevate Python code by exploring underrated and \"un-pythonic\" techniques.\n\n1.  **Typing Overloads:** Use `@overload` to define multiple function signatures, enhancing type checking based on argument types, and ensuring specific return types.\n\n2.  **Keyword-only and Positional-only Arguments:** Control argument passing with `*` for keyword-only and `/` for positional-only parameters, improving API clarity.\n\n3.  **Future Annotations:** Explores the history of Python's type system and how `from __future__ import annotations` postpones type evaluation, addressing forward reference issues.\n\n4.  **Generics:** Introduced in Python 3.5 and revamped in 3.12, generics enable type parameterization for classes and functions, enhancing type safety and code reusability.\n\n5.  **Protocols:** Implement structural subtyping (Duck Typing) with Protocols, defining expected behaviors regardless of type, improving type checking.\n\n6.  **Context Managers:** Simplify resource management using `contextlib.contextmanager` to define setup and cleanup code for `with` blocks.\n\nThe article promises to cover 8 more advanced Python features in detail in the full article.\n",
    "chinese_title": "高级Python特性",
    "chinese_summary": "本文重点介绍14个超越常见技巧的高级Python特性，旨在通过探索被低估和“非Python式”的技术来提升Python代码。\n\n1. **类型重载:** 使用`@overload`定义多个函数签名，根据参数类型增强类型检查，并确保特定返回类型。\n\n2. **仅关键字和仅位置参数:** 使用`*`控制仅关键字参数，`/`控制仅位置参数，提高API清晰度。\n\n3. **未来注解:** 探讨Python类型系统的历史以及`from __future__ import annotations`如何推迟类型评估，解决前向引用问题。\n\n4. **泛型:** Python 3.5引入并在3.12中改进的泛型，为类和函数启用类型参数化，增强类型安全性和代码可重用性。\n\n5. **协议:** 使用协议实现结构子类型（鸭子类型），定义期望的行为，无论类型如何，从而改进类型检查。\n\n6. **上下文管理器:** 使用`contextlib.contextmanager`简化资源管理，为`with`代码块定义设置和清理代码。\n\n文章承诺在完整版本中详细介绍另外8个高级Python特性。"
  },
  {
    "id": "43739456",
    "title": "Show HN: I built an AI that turns GitHub codebases into easy tutorials",
    "url": "https://github.com/The-Pocket/Tutorial-Codebase-Knowledge",
    "summary": "This \"Show HN\" post introduces an AI tool that automatically generates beginner-friendly tutorials from GitHub codebases. Built with Pocket Flow, a 100-line LLM framework, the AI crawls a repository, analyzes its code, identifies core abstractions, and then produces tutorials complete with visualizations.\n\nThe post highlights the AI's ability to analyze complex code and create understandable explanations. It provides examples of AI-generated tutorials for popular repositories like AutoGen, Celery, FastAPI, and NumPy.\n\nThe post includes instructions on how to use the tool. Users can clone the repository, install dependencies, configure an LLM API key (preferably Gemini Pro 2.5 or similar), and run the `main.py` script to generate a tutorial.  The script can analyze either a GitHub repository URL or a local directory.  Parameters allow specifying file inclusion/exclusion, maximum file size, and the output language.\n\nThe author also mentions using \"Agentic Coding\" and Pocket Flow, suggesting a rapid development paradigm where AI agents (like Cursor AI) handle the coding tasks based on human design. A YouTube tutorial is linked for a more detailed step-by-step development guide.\n",
    "chinese_title": "展示一下：我做了一个能把GitHub代码库变成简易教程的AI",
    "chinese_summary": "此“Show HN”帖子介绍了一个AI工具，它能从GitHub代码库自动生成初学者友好的教程。该AI基于一个100行的LLM框架Pocket Flow构建，通过爬取代码库，分析其代码，识别核心抽象，然后生成带有可视化的完整教程。\n\n帖子强调了该AI分析复杂代码并创建易懂解释的能力。它提供了针对AutoGen、Celery、FastAPI和NumPy等热门代码库的AI生成教程示例。\n\n帖子包含了如何使用该工具的说明。用户可以克隆代码库，安装依赖项，配置LLM API密钥（最好是Gemini Pro 2.5或类似版本），并运行`main.py`脚本来生成教程。该脚本可以分析GitHub存储库URL或本地目录。参数允许指定文件包含/排除、最大文件大小和输出语言。\n\n作者还提到使用“Agentic Coding”和Pocket Flow，暗示了一种快速开发模式，其中AI代理（如Cursor AI）根据人类设计处理编码任务。帖子链接了一个YouTube教程，其中包含了更详细的循序渐进的开发指南。"
  },
  {
    "id": "43764677",
    "title": "Parcom: CL Parser Combinators",
    "url": "https://github.com/fosskers/parcom",
    "summary": "`parcom` is a concise Common Lisp library for creating parsers using parser combinators, inspired by Haskell's `parsec` and Rust's `nom`. It operates on strings, offering \"zero copy\" substring extraction, and has no external dependencies.\n\nThe library provides fundamental parsers for characters (`char`, `any`, `anybut`, `hex`, `eof`), strings (`string`), numbers (`unsigned`, `integer`, `float`), and whitespace (`newline`, `space`, `multispace`). It also includes tools for bulk input consumption like `take`, `take-while`, and `rest`.\n\nKey to `parcom` are its combinators, which compose parsers for complex logic. These include: `*>`, `<*`, `<*>`, `<$`, `alt`, `opt`, `between`, `many`, `sep`, `sep-end`, `skip`, `consume`, `peek`, `count`, and `recognize`. These combinators facilitate sequential parsing, alternative parsing, optional parsing, and repetitive parsing, among other functionalities.\n\n`parcom` offers utilities like `empty?`, `digit?`, `fmap`, and `const`. It also features a JSON parser in the optional `parcom/json` system, providing `parse` and `json` functions, plus conversion rules between JSON and Lisp data structures.\n\nThe document guides users on writing custom parsers, detailing how to create basic parsers, parameterized parsers, and how to handle failures. The library aims for expressiveness and lightweight usage, parsing JSON at approximately 10mb/s.\n",
    "chinese_title": "Parcom：CL解析器组合子",
    "chinese_summary": "`parcom` 是一个简洁的 Common Lisp 库，用于使用解析器组合子创建解析器，其灵感来源于 Haskell 的 `parsec` 和 Rust 的 `nom`。它处理字符串，提供“零拷贝”子字符串提取，并且没有外部依赖。\n\n该库提供了用于字符（`char`、`any`、`anybut`、`hex`、`eof`）、字符串（`string`）、数字（`unsigned`、`integer`、`float`）和空白字符（`newline`、`space`、`multispace`）的基本解析器。它还包括用于批量输入消耗的工具，如 `take`、`take-while` 和 `rest`。\n\n`parcom` 的关键在于它的组合子，它们组合解析器以实现复杂的逻辑。这些组合子包括：`*>`、`<*`、`<$>`、`<$`、`alt`、`opt`、`between`、`many`、`sep`、`sep-end`、`skip`、`consume`、`peek`、`count` 和 `recognize`。这些组合子促进顺序解析、替代解析、可选解析和重复解析等功能。\n\n`parcom` 提供了诸如 `empty?`、`digit?`、`fmap` 和 `const` 等实用程序。它还在可选的 `parcom/json` 系统中提供了一个 JSON 解析器，提供 `parse` 和 `json` 函数，以及 JSON 和 Lisp 数据结构之间的转换规则。\n\n该文档指导用户编写自定义解析器，详细介绍了如何创建基本解析器、参数化解析器以及如何处理失败。该库旨在实现表达性和轻量级使用，以大约 10mb/s 的速度解析 JSON。"
  },
  {
    "id": "43757037",
    "title": "Evertop: E-ink IBM XT clone with 100+ hours of battery life",
    "url": "https://github.com/ericjenott/Evertop",
    "summary": "The Evertop is a portable, low-power IBM XT clone designed for extreme battery life. Powered by an ESP32 microcontroller, it emulates an 80186 processor with 1MB RAM, running DOS, Minix, and Windows up to 3.0. Its e-ink display and dual 10,000mAh batteries, combined with power-saving measures, allow for hundreds to thousands of hours of use on a single charge, complemented by a built-in solar panel for indefinite off-grid operation.\n\nIt's loaded with features including a built-in and detachable keyboard, PS/2 keyboard/mouse ports, full CGA/Hercules/MCGA graphics support, partial EGA/VGA, multiple audio output options, serial ports, USB flash drive port, RJ45 ethernet, WiFi, and LoRA radio. Bluetooth is also present for future features.\n\nThe device offers multiple charging options: solar panel, DC input, and micro USB.  It features a voltmeter for easy monitoring. It also offers user-initiated or automatic hibernation to disk and automatic total power shutoff.\n\nStorage is provided via SD card (tested up to 256GB), with the ability to mount multiple floppy and hard drive images.  The enclosure is 3D printed.\n\nA smaller, more cost-effective version, the \"Evertop Min,\" removes some features (keyboard, solar panel, ethernet, variable voltage charging, LoRA, volt meter, half the battery capacity) to reduce size, weight, and cost, while retaining core functionality like the e-ink display, PS/2 ports, built-in speaker, USB flash drive port, WiFi, Bluetooth, TTL serial port, and the same firmware.\n\nThe article also includes numerous sample videos and images showcasing the Evertop running various software and demonstrating its features.\n",
    "chinese_title": "易峰：E-ink 电子墨水屏 IBM XT 兼容机，电池续航 100+ 小时",
    "chinese_summary": "Evertop：一款便携式、低功耗的IBM XT克隆机，专为极致电池续航而设计。它由ESP32微控制器驱动，模拟80186处理器，拥有1MB RAM，运行DOS、Minix和Windows 3.0及以下版本。其电子墨水屏和双10,000mAh电池，结合节能措施，单次充电可使用数百至数千小时，并配有内置太阳能板，可实现无限期的离网运行。\n\n它配备了众多功能，包括内置且可拆卸的键盘、PS/2键盘/鼠标端口、完整的CGA/Hercules/MCGA图形支持、部分EGA/VGA支持、多种音频输出选项、串口、USB闪存盘端口、RJ45以太网、WiFi和LoRA无线电。蓝牙也已配备，用于未来的功能。\n\n该设备提供多种充电选项：太阳能板、直流输入和Micro USB。它具有电压表，便于监控。它还提供用户启动或自动休眠到磁盘以及自动完全断电功能。\n\n存储通过SD卡提供（已测试高达256GB），能够挂载多个软盘和硬盘映像。外壳采用3D打印。\n\n一款更小、更具成本效益的版本“Evertop Min”删除了某些功能（键盘、太阳能板、以太网、可变电压充电、LoRA、电压表、一半的电池容量），以减小尺寸、重量和成本，同时保留了核心功能，如电子墨水屏、PS/2端口、内置扬声器、USB闪存盘端口、WiFi、蓝牙、TTL串口以及相同的固件。\n\n文章还包含了大量示例视频和图像，展示了Evertop运行各种软件并演示其功能。"
  },
  {
    "id": "43733740",
    "title": "The Illuminated Gospel of St John",
    "url": "https://www.cambridge.org/universitypress/bibles/illuminated-gospel-of-st-john",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "约翰福音彩绘本",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "43757916",
    "title": "Prolog Adventure Game",
    "url": "https://github.com/stefanrodrigues2/Prolog-Adventure-game",
    "summary": "This article describes a Prolog-based adventure game where the player's goal is to find a hidden treasure inside a castle. The game incorporates classic adventure game mechanics to create an engaging experience. The player starts with three lives and must navigate the castle, solve puzzles, and manage resources to succeed.\n\nKey features mentioned include:\n\n*   **Goal:** Find the hidden treasure.\n*   **Language:** Implemented in Prolog.\n*   **Lives:** The player has three lives.\n*   **Gameplay Mechanics:** The game features interactive elements such as locked doors, hidden objects, incomplete objects that need to be completed, limited resources that must be managed, and an inventory system.\n\nThe game aims to provide an interactive and challenging adventure experience using the logic programming capabilities of Prolog.\n",
    "chinese_title": "Prolog冒险游戏",
    "chinese_summary": "本文介绍了一款基于Prolog的冒险游戏，玩家的目标是在城堡内找到隐藏的宝藏。该游戏融合了经典的冒险游戏机制，创造引人入胜的体验。玩家以三条生命开始，必须在城堡中导航，解决谜题，并管理资源才能成功。\n\n提到的主要特点包括：\n\n*   **目标：** 找到隐藏的宝藏。\n*   **语言：** 用Prolog实现。\n*   **生命：** 玩家有三条生命。\n*   **游戏机制：** 游戏具有交互式元素，例如锁着的门、隐藏的物品、需要完成的不完整物品、必须管理的有限资源以及物品栏系统。\n\n该游戏旨在利用Prolog的逻辑编程能力，提供互动且具有挑战性的冒险体验。"
  },
  {
    "id": "43755017",
    "title": "Astronomers confirm the existence of a lone black hole",
    "url": "https://phys.org/news/2025-04-astronomers-lone-black-hole.html",
    "summary": "Astronomers have confirmed the existence of a lone black hole, a feat previously unachieved due to the difficulty of detection without a companion star. A team at the Space Telescope Science Institute, using data from Hubble and the Gaia space probe, verified that a \"dark object\" initially spotted in 2022 is indeed a black hole.\n\nThe object, located in the constellation Sagittarius, was initially detected due to its gravitational lensing effect, magnifying and shifting the position of a distant background star as it passed in front. Earlier observations from 2011-2017 were supplemented with data from 2021-2022.\n\nInitially, a second research team proposed the object was a neutron star, but they later revised their assessment in 2023, agreeing with the original team that it was a black hole. The latest analysis shows the object to be approximately seven times the mass of the sun, definitively ruling out a neutron star. This confirmation marks the first time a lone black hole has been directly identified. The researchers plan to search for more lone black holes using the upcoming Nancy Grace Roman Space Telescope, scheduled for launch in 2027. The findings were published in *The Astrophysical Journal*.\n",
    "chinese_title": "天文学家证实存在孤立黑洞",
    "chinese_summary": "天文学家确认了孤立黑洞的存在，这是此前未实现的壮举，原因是在没有伴星的情况下很难探测到。空间望远镜科学研究所的一个团队，利用哈勃和盖亚空间探测器的数据，证实了最初于2022年发现的“暗物质”确实是一个黑洞。\n\n该天体位于人马座，最初的发现是由于其引力透镜效应，当它经过前方时，放大了远处背景恒星的位置并使其发生偏移。2011-2017年的早期观测结果得到了2021-2022年数据的补充。\n\n最初，第二个研究团队提出该天体是一颗中子星，但他们在2023年修改了评估，同意最初的团队认为它是一个黑洞。最新的分析显示该天体大约是太阳质量的七倍，明确排除了中子星的可能性。这一确认标志着首次直接识别出孤立黑洞。研究人员计划使用计划于2027年发射的南希·格雷斯·罗曼太空望远镜来寻找更多的孤立黑洞。该研究结果发表在《天体物理学杂志》上。"
  },
  {
    "id": "43755682",
    "title": "The Value of Differences: Jennifer Lindsay on Noticing Translation",
    "url": "https://sydneyreviewofbooks.com/essays/the-value-of-differences",
    "summary": "This short passage emphasizes the complementary roles of the Booker Prize and the International Booker Prize in recognizing and promoting world-class fiction to English-speaking readers. The Booker Prize focuses on fiction originally written in English, while the International Booker Prize celebrates fiction that has been translated into English. This symmetrical structure ensures that both original English works and works translated into English receive significant recognition and reach a wider audience. Essentially, the two prizes, taken together, offer a global perspective on literary excellence.\n",
    "chinese_title": "差异的价值：詹妮弗·林赛谈翻译的关注",
    "chinese_summary": "这段短文强调了布克奖和国际布克奖在认可和推广世界一流小说给英语读者方面的互补作用。布克奖侧重于最初用英语创作的小说，而国际布克奖则表彰翻译成英语的小说。这种对称的结构确保了原创英语作品和翻译成英语的作品都能获得重要的认可，并接触到更广泛的读者。本质上，这两个奖项加在一起，提供了对文学卓越性的全球视角。"
  },
  {
    "id": "43745038",
    "title": "Handheld detector for all types of ionizing radiation improves radiation safety",
    "url": "https://phys.org/news/2025-04-handheld-detector-ionizing-safety.html",
    "summary": "A new handheld, multi-purpose radiation detector developed by the University of Jyväskylä and the Finnish Radiation and Nuclear Safety Authority (STUK) can detect all four types of ionizing radiation: alpha, beta, gamma, and neutron radiation. This \"Swiss Army knife\" of radiation detectors improves security and simplifies field work by consolidating multiple detection capabilities into a single, lightweight (under 2 kg) device.\n\nThe detector uses multilayered Phoswich technology, combining five different scintillation layers that each act as independent radiation detectors. This allows for detection of surface contamination from alpha and beta radiation, directional sensing of gamma-ray emitting materials (a novel feature for devices of this size), and the detection of neutron radiation, crucial for identifying nuclear material containing plutonium.\n\nThe device features an integrated screen for real-time monitoring and provides approximately 2 hours of continuous use with its battery. It's versatile applications are for industrial, medical, regulatory, nuclear energy, first responder, and military users. The technology has been patented, and the University of Jyväskylä is actively seeking business partners for commercialization, with plans to develop a broader family of radiation detection instruments. The research is published in Nuclear Instruments and Methods in Physics Research Section A.\n",
    "chinese_title": "用于检测所有类型电离辐射的手持式探测器，提高辐射安全性",
    "chinese_summary": "于韦斯屈莱大学和芬兰辐射与核安全局(STUK) 联合开发了一种新型手持式多用途辐射探测器，可以探测所有四种类型的电离辐射：α射线、β射线、γ射线和中子辐射。这种辐射探测器的“瑞士军刀”通过将多种探测功能整合到一个轻巧（2公斤以下）的设备中，提高了安全性并简化了现场工作。\n\n该探测器采用多层Phoswich技术，结合了五种不同的闪烁层，每层都充当独立的辐射探测器。这使得能够探测α射线和β射线造成的表面污染，对发射伽马射线的材料进行定向感应（对于这种尺寸的设备来说是一项新颖的功能），以及探测中子辐射，这对于识别含有钚的核材料至关重要。\n\n该设备具有用于实时监控的集成屏幕，并且电池可以提供大约2小时的连续使用时间。它的通用应用领域包括工业、医疗、监管、核能、急救人员和军事用户。 该技术已获得专利，于韦斯屈莱大学正在积极寻找商业合作伙伴进行商业化，并计划开发更广泛的辐射探测仪器系列。这项研究发表在《核仪器与方法物理研究A部分》上。"
  },
  {
    "id": "43756871",
    "title": "Cheating the Reaper in Go",
    "url": "https://mcyoung.xyz/2025/04/21/go-arenas/",
    "summary": "This article explores the possibility of implementing manual memory management with garbage collection (GC) cooperation in Go, specifically building an untyped arena allocator. The author argues that while Go doesn't officially support this, the language's design and commitment to backward compatibility make it feasible.\n\nThe article highlights the challenge of allocating pointer-containing memory within an arena. The Go GC relies on metadata (\"pointer bits\") to identify pointers within allocated memory. The arena's `Alloc` method, as initially designed, doesn't provide this shape information, leading to premature garbage collection of pointers allocated within the arena.\n\nTo address this, the author proposes a strategy: ensuring that holding any pointer returned by `Alloc` prevents the entire arena from being garbage collected. If the arena itself is marked as \"live\" by the GC, all memory it manages, including pointers within it, will also be kept alive. This approach leverages the fact that if data stored in an arena needs to be referenced, the entire arena's lifetime must be preserved.\n\nThe article presents a benchmark comparing the arena allocator's performance against Go's standard `new` function, showing a significant performance improvement, especially for larger objects. The core idea is to design the arena in such a way that GC considers it live as long as anything it has allocated is also considered live.\n",
    "chinese_title": "围棋中的死里逃生",
    "chinese_summary": "本文探讨了在Go中实现手动内存管理与垃圾回收（GC）协作的可能性，特别是构建一个非类型化的arena分配器。作者认为，尽管Go官方不支持这种做法，但该语言的设计以及对向后兼容性的承诺使其成为可行方案。\n\n文章强调了在arena中分配包含指针的内存所面临的挑战。Go GC依赖于元数据（“指针位”）来识别已分配内存中的指针。最初设计的arena的`Alloc`方法不提供这种形状信息，导致arena中分配的指针被过早地垃圾回收。\n\n为了解决这个问题，作者提出了一种策略：确保持有`Alloc`返回的任何指针都能够阻止整个arena被垃圾回收。如果arena本身被GC标记为“存活”，那么它管理的所有内存，包括其中的指针，也会被保持存活。这种方法利用了一个事实，即如果存储在arena中的数据需要被引用，那么整个arena的生命周期必须被保留。\n\n文章提供了一个基准测试，比较了arena分配器与Go标准`new`函数的性能，显示出显著的性能提升，特别是对于较大的对象。核心思想是以这样一种方式设计arena，即只要它分配的任何东西也被认为是存活的，GC就认为它是存活的。"
  },
  {
    "id": "43766580",
    "title": "Isolated older adults find joy and connection through virtual singing",
    "url": "https://news.northwestern.edu/stories/2025/04/virtual-singing-brings-connection-and-joy-to-isolated-older-adults-study-finds/",
    "summary": "This article, titled \"Isolated older adults find joy and connection through virtual singing,\" highlights the positive impact of virtual singing programs on older adults experiencing isolation. While the specific content is not provided, the title suggests the article likely discusses how these programs combat loneliness and foster a sense of community among participants. Key information would likely include details about the structure of these virtual singing sessions, such as the technology used, the types of songs performed, and the methods used to engage participants. The article may also include testimonials or interviews with older adults who have benefited from these programs, showcasing the positive effects on their mental and emotional well-being. Additionally, it may discuss the role of facilitators or organizers in creating a supportive and inclusive environment within the virtual singing group. The included line, \"The measles ‘is not a benign disease’ March 5, 2025,\" is likely unrelated and could be from a separate article accidentally included in the provided information. Therefore, the summary focuses solely on the topic suggested by the main title.\n",
    "chinese_title": "通过线上唱歌，孤独的年长者找到了快乐和联系。",
    "chinese_summary": "孤寡老人通过线上歌唱找到快乐和联系"
  },
  {
    "id": "43760357",
    "title": "Detecting if an expression is constant in C",
    "url": "https://nrk.neocities.org/articles/c-constexpr-macro",
    "summary": "This article explores various C macro implementations to detect and verify constant expressions at compile time. The goal is to create a macro `C(x)` that ensures `x` is a constant expression, throws a compilation error if it isn't, and \"returns\" the value of `x` (ideally with the original type).\n\nSeveral approaches are presented, each with its own pros and cons:\n\n*   **C23 `constexpr` compound literals:** Uses new C23 features to enforce constant expression requirements on storage duration initializers while preserving type. Downsides include limited compiler support.\n*   **`__builtin_constant_p`:** Leverages GNU extensions to check for constant expressions and trigger a compilation error using `__builtin_choose_expr` and the `error` attribute.  Drawback: requires GNU extensions.\n*   **`static_assert`:** Uses `static_assert` inside a struct to verify constant expressions, but may alter the type due to implicit conversions.\n*   **sizeof + compound literal with array type:** Employs variable-length arrays within compound literals to detect non-constant expressions.  Similar to `static_assert`, but predates C11; it also changes type and doesn't support floating-point expressions.\n*   **sizeof + enum constant:** Uses enum constant requirements to check constant expressions but suffers from \"leaking\" enum names, which is mitigated by declaring the enum inside a function parameter (though this generates warnings).\n*   **Comma operator:** Combines `sizeof` with the comma operator to ensure type preservation, but generates \"unused\" warnings (resolved by casting the `sizeof` result to `void`).\n\nThe article highlights the challenges in preserving the original type and avoiding compiler warnings while enforcing constant expression requirements. The author shares insights into GCC behavior and emphasizes the importance of creating warning-free macros for library usage. A reader-submitted solution using `_Generic` for integer constant expressions is also mentioned.\n",
    "chinese_title": "检测C语言表达式是否为常量",
    "chinese_summary": "本文探讨了使用多种C宏实现方法，在编译时检测并验证常量表达式。目标是创建一个宏`C(x)`，该宏确保`x`是一个常量表达式，如果不是则抛出编译错误，并“返回”`x`的值（理想情况下保持原始类型）。\n\n文中提出了几种方法，每种方法都有其优缺点：\n\n*   **C23 `constexpr` 复合字面量：** 利用新的 C23 特性来强制执行对存储期初始化器的常量表达式要求，同时保留类型。缺点是编译器支持有限。\n*   **`__builtin_constant_p`：** 利用 GNU 扩展来检查常量表达式，并使用 `__builtin_choose_expr` 和 `error` 属性触发编译错误。缺点：需要 GNU 扩展。\n*   **`static_assert`：** 在结构体内部使用 `static_assert` 来验证常量表达式，但可能由于隐式转换而改变类型。\n*   **sizeof + 具有数组类型的复合字面量：** 采用复合字面量中的变长数组来检测非常量表达式。类似于 `static_assert`，但早于 C11；它也会改变类型，并且不支持浮点表达式。\n*   **sizeof + 枚举常量：** 使用枚举常量的要求来检查常量表达式，但存在“泄漏”枚举名称的问题，这可以通过在函数参数内部声明枚举来缓解（尽管这会生成警告）。\n*   **逗号运算符：** 将 `sizeof` 与逗号运算符结合使用，以确保类型保留，但会生成“未使用”警告（通过将 `sizeof` 结果强制转换为 `void` 来解决）。\n\n本文强调了在强制执行常量表达式要求的同时，保持原始类型并避免编译器警告的挑战。作者分享了对 GCC 行为的见解，并强调了为库的使用创建无警告宏的重要性。还提到了读者提交的关于使用 `_Generic` 处理整数常量表达式的解决方案。"
  },
  {
    "id": "43761976",
    "title": "Join the W3C Exploration Interest Group: where standards start",
    "url": "https://www.w3.org/blog/2025/join-the-w3c-exploration-interest-group-where-standards-start/",
    "summary": "The W3C Exploration Interest Group (IG) acts as an early R&D lab for identity, authentication, and trust on the web. Unlike working groups that define normative specifications, the Exploration IG focuses on connecting real-world challenges to the standards world and asking crucial questions before solutions are developed.\n\nThe group addresses gaps between browser implementations and web specs, explores emerging wallet models, identity credentials, and federation flows. It also considers use cases spanning multiple trust frameworks, sectors, or jurisdictions, identifying fragmentation risks and evaluating regulatory signals needing a technical response.\n\nThe IG encourages participation from implementers, researchers, policymakers, and anyone encountering web development issues. Contributions are welcomed through their public GitHub repository. The goal is to identify overlooked issues and build bridges that could lead to future working group charters. The group meets bi-weekly, focusing on topics raised by the community, inviting questions, and fostering collaboration.\n",
    "chinese_title": "加入W3C探索兴趣组：标准由此启航",
    "chinese_summary": "W3C探索兴趣小组（IG）是Web上身份、认证和信任的早期研发实验室。与定义规范性规范的工作组不同，探索IG专注于将现实世界的挑战与标准世界联系起来，并在开发解决方案之前提出关键问题。\n\n该小组致力于解决浏览器实现与Web规范之间的差距，探索新兴的钱包模型、身份凭证和联合流程。它还考虑跨多个信任框架、行业或司法管辖区的使用案例，识别碎片化风险，并评估需要技术响应的监管信号。\n\nIG鼓励实施者、研究人员、政策制定者以及任何遇到Web开发问题的人参与。欢迎通过其公共GitHub存储库进行贡献。目标是发现被忽视的问题，并搭建可能导致未来工作组章程的桥梁。该小组每两周举行一次会议，重点讨论社区提出的议题，邀请提问，并促进合作。"
  },
  {
    "id": "43758999",
    "title": "Welcome to our website for the 1963 BBC MCR21 OB Van",
    "url": "https://mcr21.org.uk/",
    "summary": "This website provides information about the 1963 BBC MCR21 OB Van, focusing on its technical aspects and historical significance. Built by Pye as one of ten \"Main Fleet Scanners,\" the MCR21 represented a significant advancement in monochrome outside broadcast technology, laying the groundwork for future color installations.\n\nThe website highlights several key areas of the van:\n\n*   **Sound System:** The sound desk featured a 20-channel mixer with three groups, PA outputs, and extensive monitoring. It had a flat response and could revert to battery operation in case of power failure. The Engineering Manager had a desk with a 15-line manual telephone exchange and talkback facilities.\n\n*   **Monitor Stack:** Seven monitors were deemed sufficient, including individual camera monitors, engineering and production previews, and a central 17-inch transmission monitor. Each 14-inch monitor had a BBC-designed waveform monitor, with an optical PPM positioned above for easy viewing. The van also included a dual-standard off-air check receiver for both 405 and 625 line broadcasts.\n\n*   **Vision Engineer's Control Desks:** The MCR21 used 4 Pye Mk6 cameras, controlled by two desks with Operational Control Panels (OCPs). Each desk accommodated two engineers, and each camera had a dedicated picture and waveform monitor.\n\nThe site includes pictures of the MCR21 during construction and a publicity shot, underscoring Pye's capabilities in building complex OB vans. It also mentions the van's advanced innovations and its role in paving the way for color broadcasting. The site also points to information about the Match of the Day 60th Anniversary and newsletters.\n",
    "chinese_title": "欢迎来到我们的1963年BBC MCR21 OB转播车网站",
    "chinese_summary": "本网站提供有关1963年BBC MCR21 OB转播车的资料，重点介绍其技术方面和历史意义。MCR21由Pye公司建造，是十辆“主力扫描车”之一，代表了黑白户外转播技术的重大进步，为未来的彩色设备奠定了基础。\n\n本网站重点介绍了该转播车的几个关键领域：\n\n*   **声音系统：** 音频控制台配备了20通道混音器，具有三个群组、PA输出和广泛的监听功能。它具有平坦的响应，并且可以在电源故障时恢复为电池供电。工程经理拥有一张办公桌，配备15线手动电话交换机和对讲设施。\n\n*   **监视器堆栈：** 七个监视器被认为是足够的，包括单独的摄像机监视器、工程和制作预览以及中央17英寸传输监视器。每个14英寸监视器都有一个BBC设计的波形监视器，上方有一个光学PPM，便于观看。该转播车还包括一个双标准无线广播接收器，用于405和625线广播。\n\n*   **视频工程师控制台：** MCR21使用4台Pye Mk6摄像机，由带有操作控制面板 (OCP) 的两个控制台控制。每个控制台可容纳两名工程师，每台摄像机都有专用的图像和波形监视器。\n\n该网站包含MCR21在建造过程中的图片和一张宣传照，突显了Pye公司在建造复杂OB转播车方面的能力。它还提到了该转播车的先进创新及其在为彩色广播铺平道路方面的作用。该网站还指向有关“今日比赛”60周年纪念和新闻通讯的信息。"
  },
  {
    "id": "43762451",
    "title": "Using physics simulations to find targeting strategies in tenpin bowling",
    "url": "https://pubs.aip.org/aip/adv/article/15/4/045222/3344017/Using-physics-simulations-to-find-targeting",
    "summary": "The article \"Using physics simulations to find targeting strategies in tenpin bowling\" explores the use of physics-based simulations to optimize targeting strategies in tenpin bowling. The authors developed a detailed simulation model that incorporates factors such as ball speed, spin rate, launch angle, and friction coefficients between the ball and the lane, as well as the pin-ball and pin-pin interactions.\n\nThe primary goal of the study was to identify targeting strategies that maximize the probability of a strike for various bowling styles and lane conditions. The simulations allowed them to systematically test a wide range of launch parameters and identify optimal targeting angles and speeds for different bowler types, specifically accounting for variations in ball rotation.\n\nThe researchers found that the ideal targeting location on the lane varies significantly depending on the ball's speed and spin rate. They demonstrate that bowlers with higher spin rates can achieve strikes with a wider range of launch angles, making them more forgiving of minor targeting errors. The simulations also showed the importance of adjusting the targeting strategy based on lane conditions, particularly the oil pattern.\n\nThe article highlights the potential of physics-based simulations to provide valuable insights for bowlers and coaches, enabling them to refine targeting strategies and improve performance. The study demonstrates how computational modeling can be used to understand the complex dynamics of tenpin bowling and identify optimal techniques for maximizing strike probability. Furthermore, the authors propose that this approach could be extended to analyze other sports involving projectile motion and collisions.\n",
    "chinese_title": "使用物理模拟寻找保龄球的击球策略",
    "chinese_summary": "运用物理模拟寻找保龄球投球策略"
  },
  {
    "id": "43766803",
    "title": "Google won't ditch third-party cookies in Chrome after all",
    "url": "https://arstechnica.com/gadgets/2025/04/google-wont-ditch-third-party-cookies-in-chrome-after-all/",
    "summary": "Google has reversed its plan to phase out third-party cookies in Chrome, effectively abandoning its Privacy Sandbox initiative's core goal. After years of development and delays, Google will no longer roll out a feature to help users disable these cookies. This decision comes after initial proposals like FLoC were widely criticized, and later plans were repeatedly postponed.\n\nAccording to Google, the advertising industry's increased focus on privacy influenced this change. However, the article suggests Google's legal exposure from recent antitrust cases, particularly those concerning its dominance in search and ad tech, is a significant factor. Forcing the advertising industry to adopt Google's Privacy Sandbox alternative via Chrome's dominance would be a bad look.\n\nWhile the Privacy Sandbox project isn't entirely dead, its role is diminished. Google will continue developing Privacy Sandbox APIs and aims to increase their adoption, but the industry is unlikely to abandon cookies on its own. The article notes that improved privacy features are still planned for Chrome's Incognito Mode, including IP protection.\n\nThe author argues that while third-party cookies are detrimental to privacy, universal adoption of the Privacy Sandbox could have granted Google even greater power, and its privacy benefits were uncertain, considering Google's focus on revenue.\n",
    "chinese_title": "谷歌最终不会在Chrome浏览器中放弃第三方Cookie。",
    "chinese_summary": "谷歌已撤回在Chrome浏览器中逐步淘汰第三方Cookie的计划，实际上放弃了其隐私沙盒计划的核心目标。经过多年的开发和延误，谷歌将不再推出帮助用户禁用这些Cookie的功能。这一决定是在FLoC等最初的提案受到广泛批评，以及后来的计划被多次推迟之后做出的。\n\n谷歌表示，广告行业对隐私日益关注影响了这一改变。然而，文章认为，谷歌近期反垄断案件带来的法律风险，特别是那些涉及其在搜索和广告技术领域主导地位的案件，是一个重要因素。通过Chrome的主导地位迫使广告行业采用谷歌的隐私沙盒替代方案，会产生不良影响。\n\n虽然隐私沙盒项目并未完全消亡，但其作用已减弱。谷歌将继续开发隐私沙盒API，并致力于提高其采用率，但行业不太可能自行放弃Cookie。文章指出，Chrome的隐身模式仍然计划改进隐私功能，包括IP保护。\n\n作者认为，虽然第三方Cookie不利于隐私，但普遍采用隐私沙盒可能会赋予谷歌更大的权力，而且考虑到谷歌对收入的关注，其隐私益处尚不确定。"
  },
  {
    "id": "43755286",
    "title": "A M.2 HDMI capture card",
    "url": "https://interfacinglinux.com/2025/04/18/magewell-eco-m-2-hdmi-capture-card/",
    "summary": "This article reviews the Magewell Eco Capture Dual HDMI M.2, a capture card designed to fit into an M.2 slot, repurposing PCIe lanes usually used for storage. The author highlights the card's potential for systems with limited PCIe slots.\n\nThe review covers the unboxing experience, noting the inclusion of SHD-to-HDMI Type-A cables and the need to acquire mounting hardware separately. It details the driver installation process for both x86 and ARM (specifically Rockchip 3588 SOC using Armbian) systems, including necessary dependencies and commands. The author expresses surprise that the Jetson TX2 ARM drivers worked on the Rockchip platform.\n\nThe review confirms the card's compatibility with OBS and WebRTC apps like Discord, Jitsi, and Zoom, allowing it to function as a webcam. The author compares the picture quality and latency to a Decklink Mini 4K Recorder, finding them comparable.\n\nThe verdict is generally positive, praising the card's stability, 24/7 operation capability, and M.2 form factor. However, the high price ($385 MSRP) is a significant drawback, though the author notes finding deals on eBay for much lower prices. The review concludes with a rating of 6.8/10, highlighting installability difficulties due to required kernel driver compilation, but praising the performance and form factor.\n",
    "chinese_title": "M.2 HDMI 采集卡",
    "chinese_summary": "本文评测了美乐威Eco Capture Dual HDMI M.2采集卡，这是一款旨在安装在M.2插槽中的采集卡，它将通常用于存储的PCIe通道重新利用。作者强调了该采集卡对于PCIe插槽有限的系统的潜力。\n\n评测涵盖了开箱体验，注意到包含了SHD-转-HDMI Type-A线缆，以及需要单独购买安装硬件。它详细介绍了x86和ARM（特别是使用Armbian的瑞芯微3588 SOC）系统的驱动程序安装过程，包括必要的依赖项和命令。作者表示惊讶Jetson TX2 ARM驱动程序可以在瑞芯微平台上工作。\n\n评测证实了该采集卡与OBS和WebRTC应用程序（如Discord、Jitsi和Zoom）的兼容性，使其能够作为网络摄像头运行。作者将画面质量和延迟与Decklink Mini 4K Recorder进行了比较，发现它们不相上下。\n\n总体的结论是积极的，赞扬了该采集卡的稳定性、24/7运行能力和M.2外形。然而，高昂的价格（建议零售价385美元）是一个显著的缺点，尽管作者注意到在eBay上找到了价格低得多的交易。评测最终给出了6.8/10的评分，强调了由于需要编译内核驱动程序而导致的安装困难，但赞扬了性能和外形。"
  },
  {
    "id": "43759513",
    "title": "AI for Network Engineers: Understanding Flow, Flowlet, and Packet-Based LB",
    "url": "https://nwktimes.blogspot.com/2025/04/ai-for-network-engineers-understanding.html",
    "summary": "This article, \"AI for Network Engineers: Understanding Flow, Flowlet, and Packet-Based LB,\" addresses the challenges of load balancing in RoCEv2-based AI backend networks, particularly with the massive \"elephant flows\" generated by GPU-to-GPU communication. Traditional Flow-Based Load Balancing with Layer 3 ECMP is often inadequate due to its inability to adapt to congestion, leading to uneven bandwidth usage and performance degradation.\n\nThe article introduces two alternative methods: Flowlet-Based Load Balancing with Adaptive Routing and Packet-Based Load Balancing with Packet Spraying. Adaptive routing dynamically monitors link utilization and redirects flowlets to less congested paths, reducing buffer buildup and improving link utilization.\n\nPacket Spraying distributes individual packets across multiple paths. This method requires the use of RDMA Write Only operation, supported by newer NVIDIA NICs (ConnectX-5 and later), which includes the RDMA Extended Transport Header (RETH) in every packet. This self-contained packet allows for per-packet load balancing without concern for packet reordering.\n\nThe article also provides an example configuration for enabling per-packet load balancing (packet spraying) on Cisco Nexus 9000 Series Cloud Scale switches, starting from NX-OS Release 10.5(1)F, using Dynamic Load Balancing (DLB). The key is the DLB MAC address, which decouples the MAC from the physical path.\n",
    "chinese_title": "网络工程师的人工智能：理解流、流簇和基于数据包的负载均衡",
    "chinese_summary": "面向网络工程师的人工智能：理解流、流簇和基于包的负载均衡\n\n本文探讨了基于 RoCEv2 的 AI 后端网络中负载均衡面临的挑战，特别是 GPU 间通信产生的大量“大象流”。传统的基于流的、使用三层 ECMP 的负载均衡通常不足以应对，因为它无法适应拥塞，导致带宽使用不均衡和性能下降。\n\n本文介绍了两种替代方法：基于流簇的自适应路由负载均衡和基于包的包喷洒负载均衡。自适应路由动态监控链路利用率并将流簇重定向到不那么拥塞的路径，从而减少缓冲区积压并提高链路利用率。\n\n包喷洒将单个数据包分配到多个路径上。这种方法需要使用 RDMA Write Only 操作，该操作由较新的 NVIDIA 网卡（ConnectX-5 及更高版本）支持，并在每个数据包中包含 RDMA 扩展传输头 (RETH)。这种自包含的数据包允许进行基于每个数据包的负载均衡，而无需担心数据包重排序。\n\n本文还提供了一个示例配置，用于在 Cisco Nexus 9000 系列云规模交换机上启用基于每个数据包的负载均衡（包喷洒），从 NX-OS Release 10.5(1)F 开始，使用动态负载均衡 (DLB)。关键在于 DLB MAC 地址，它将 MAC 地址与物理路径解耦。"
  }
]