[
  {
    "id": "44171677",
    "title": "(On | No) Syntactic Support for Error Handling",
    "url": "https://go.dev/blog/error-syntax",
    "summary": "This Go blog post discusses the long-standing issue of verbose error handling in Go and the Go team's decision to stop pursuing syntactic solutions, at least for the foreseeable future. Despite years of community complaints and multiple proposals, including \"check/handle,\" \"try,\" and the \"?\" operator, none have achieved sufficient consensus for implementation.\n\nThe author acknowledges the verbosity of the `if err != nil` pattern and the desire to reduce boilerplate. However, they argue that Go has a perfectly functional error-handling mechanism, and introducing new syntax would create divisions within the community and potentially force everyone to adopt it, violating the principle of \"one way to do things.\"\n\nInstead of syntactic sugar, the author suggests focusing on improving error handling practices. This includes providing better support functions for augmenting errors with additional context like stack traces. They also mention that new standard library functionality and IDE features can mitigate the impact of verbosity.\n\nUltimately, the Go team believes that the cost of language changes is high and that their efforts are better spent on other priorities. They emphasize the lack of unanimous agreement within the team and the feedback from users who suggest the issue becomes less critical as one becomes more proficient in Go. The author closes by saying that they may revisit error handling again when they have more conclusive data regarding where developers find the current error handling to be lacking.\n",
    "chinese_title": "（论 | 无）句法层面的错误处理支持",
    "chinese_summary": "这篇 Go 博客文章讨论了 Go 语言中长期存在的冗长错误处理问题，以及 Go 团队决定停止追求语法解决方案（至少在可预见的未来）的决定。尽管社区多年来抱怨不断，并提出了包括 \"check/handle\"、\"try\" 和 \"?\" 运算符在内的多种方案，但没有一种方案能够达成足够的共识以供实施。\n\n作者承认了 `if err != nil` 模式的冗长性以及减少样板代码的需求。然而，他们认为 Go 已经拥有一个功能完善的错误处理机制，引入新的语法会在社区内造成分裂，并可能迫使每个人都采用它，从而违反了 \"做事的唯一方法\" 的原则。\n\n作者建议，与其追求语法糖，不如专注于改进错误处理实践。这包括提供更好的支持函数，以便用额外的上下文（如堆栈跟踪）来增强错误信息。他们还提到，新的标准库功能和 IDE 特性可以减轻冗长性带来的影响。\n\n最终，Go 团队认为语言变更的成本很高，并且他们的精力最好花在其他优先事项上。他们强调团队内部缺乏一致意见，以及用户反馈表明，随着人们对 Go 语言的熟练程度提高，这个问题的重要性会降低。作者最后表示，当他们有更多关于开发者认为当前错误处理不足之处的结论性数据时，他们可能会再次讨论错误处理问题。"
  },
  {
    "id": "44170968",
    "title": "The Small World of English",
    "url": "https://www.inotherwords.app/linguabase/",
    "summary": "生成摘要时出错",
    "chinese_title": "The Small World of English",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44167592",
    "title": "Quarkdown: A modern Markdown-based typesetting system",
    "url": "https://github.com/iamgio/quarkdown",
    "summary": "生成摘要时出错",
    "chinese_title": "Quarkdown: A modern Markdown-based typesetting system",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44170694",
    "title": "Show HN: Controlling 3D models with voice and hand gestures",
    "url": "https://github.com/collidingScopes/3d-model-playground",
    "summary": "This \"Show HN\" post introduces a web app called \"3D Model Playground\" that allows users to control 3D models in real-time using voice commands and hand gestures. Built with Three.js, MediaPipe, Web Speech API, and Rosebud AI, the app offers an interactive way to manipulate 3D models directly in the browser. Users can change interaction modes by saying \"drag,\" \"rotate,\" \"scale,\" or \"animate\" and use pinch gestures for precise control. The app supports importing custom 3D models in GLTF format via drag and drop.\n\nThe post details the technologies used, including Three.js for rendering, MediaPipe for hand tracking, and the Web Speech API for voice recognition. It also provides instructions for setting up the project for local development, using Python to serve the files.\n\nThe author, Alan (collidingScopes), highlights related open-source projects like \"Threejs hand tracking tutorial,\" \"Particular Drift,\" \"Liquid Logo,\" and \"Video-to-ASCII,\" and provides contact information and links to his social media profiles. He also expresses appreciation for donations to support his open-source development efforts.\n",
    "chinese_title": "Show HN: 通过语音和手势控制3D模型",
    "chinese_summary": "此Show HN帖子介绍了一款名为“3D模型游乐场”的Web应用程序，该程序允许用户使用语音命令和手势实时控制3D模型。该应用程序采用Three.js、MediaPipe、Web Speech API和Rosebud AI构建，提供了一种直接在浏览器中操作3D模型的交互方式。用户可以通过说“拖动”、“旋转”、“缩放”或“动画”来更改交互模式，并使用捏合手势进行精确控制。该应用程序支持通过拖放导入GLTF格式的自定义3D模型。\n\n帖子详细介绍了使用的技术，包括用于渲染的Three.js、用于手部跟踪的MediaPipe和用于语音识别的Web Speech API。它还提供了使用Python服务文件来设置项目以进行本地开发的说明。\n\n作者Alan (collidingScopes)重点介绍了相关的开源项目，如“Threejs hand tracking tutorial”、“Particular Drift”、“Liquid Logo”和“Video-to-ASCII”，并提供了联系方式和指向其社交媒体资料的链接。他还对捐款以支持其开源开发工作表示感谢。"
  },
  {
    "id": "44169132",
    "title": "Show HN: I wrote a Java decompiler in pure C language",
    "url": "https://github.com/neocanable/garlic",
    "summary": "This \"Show HN\" post introduces `garlic-decompiler`, a Java decompiler written in pure C. The tool decompiles `.class`, `.jar`, and `.war` files, converting them into Java source code.\n\nKey features include:\n\n*   **Decompilation:** Handles `.class`, `.jar`, and `.war` files.\n*   **Build Requirements:** Requires cmake 3.26 or higher but has no other dependencies.\n*   **Usage:** Decompiles using the command-line interface (e.g., `garlic /path/to/file.jar`). Includes options for specifying the output path (`-o`) and the number of threads to use (`-t`). Defaults to 4 threads.\n*   **`javap`-like functionality:** Provides a faster, `javap`-like output with disabled `LineNumber` and `StackMapTable` attributes (using the `-p` flag).\n*   **`dexdump` support (partially):** Has a placeholder for `dexdump` functionality for `.dex` files.\n*   **Debugging:** Includes a snippet to analyze a JAR file directly via modification of the `main` function in `jvm.c` for debugging purposes.\n*   **Licensing:** Licensed under the Apache 2.0 License.\n",
    "chinese_title": "展示HN：我用纯C语言写了一个Java反编译器",
    "chinese_summary": "此“Show HN”帖子介绍了 `garlic-decompiler`，一个纯C编写的Java反编译器。该工具可以将 `.class`、`.jar` 和 `.war` 文件反编译成 Java 源代码。\n\n主要功能包括：\n\n*   **反编译：** 处理 `.class`、`.jar` 和 `.war` 文件。\n*   **构建"
  },
  {
    "id": "44168201",
    "title": "The Shape of the Essay Field",
    "url": "https://paulgraham.com/field.html",
    "summary": "In \"The Shape of the Essay Field,\" the author explores the nature of effective essay writing, arguing that a good essay tells readers something they don't already know, and that the reason for this lack of knowledge defines the essay's type. The author identifies three reasons for a reader's lack of knowledge: the topic is unimportant, the reader is obtuse, or the reader is inexperienced.\n\nThe core argument is that essays aiming to educate smart people on important topics are inherently geared towards a younger audience. This is because younger readers have more room for intellectual change and surprise. While the author acknowledges the tradeoff between impacting readers greatly on moderately important topics versus impacting them slightly on critical ones, they posit that the potential impact on younger readers when addressing significant subjects is greater.\n\nThe author frames this dynamic as a \"gravitational field\" that essayists operate within, often unconsciously. They emphasize that their own writing process is driven by personal curiosity and discovery, rather than strategically targeting a specific demographic. However, recognizing this underlying dynamic has prompted the author to consider what important topics young readers might be particularly receptive to learning about, suggesting a potential avenue for future exploration. The essay concludes that truly great essays on seemingly unimportant topics inevitably delve into deeper, more profound themes.\n",
    "chinese_title": "论说文领域的格局",
    "chinese_summary": "在《论文章领域的形态》中，作者探讨了有效文章写作的本质，认为一篇好的文章会告诉读者他们尚不知晓的信息，而这种知识的缺乏定义了文章的类型。作者指出了读者缺乏知识的三个原因：话题不重要、读者迟钝或读者缺乏经验。\n\n核心论点是，旨在教育聪明人了解重要话题的文章本质上是面向年轻受众的。这是因为年轻读者有更大的智力改变和惊喜的空间。虽然作者承认在对重要性适中的话题产生重大影响与对关键话题产生轻微影响之间的权衡，但他们认为，在解决重要课题时，对年轻读者产生的潜在影响更大。\n\n作者将这种动态框架为文章作者所处的“引力场”，他们经常无意识地在此范围内运作。他们强调，自己的写作过程是由个人好奇心和发现驱动的，而不是战略性地针对特定人群。然而，认识到这种潜在的动态促使作者思考年轻读者可能特别容易接受学习哪些重要主题，从而提出了未来探索的潜在途径。文章总结说，关于看似不重要话题的真正伟大的文章不可避免地会深入研究更深刻、更深刻的主题。"
  },
  {
    "id": "44169314",
    "title": "Covert Web-to-App Tracking via Localhost on Android",
    "url": "https://localmess.github.io/",
    "summary": "生成摘要时出错",
    "chinese_title": "Covert Web-to-App Tracking via Localhost on Android",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44170657",
    "title": "Show HN: PinSend – Share text between devices using a PIN(P2P, no login)",
    "url": "https://pinsend.app",
    "summary": "PinSend is a web-based tool that allows users to instantly and securely share text and images between devices without requiring any login or account registration. It works through a peer-to-peer (P2P) connection established using a PIN, shareable link, or QR code.\n\nThe process is simple: a user starts a session by typing a message, which automatically generates a unique PIN. This PIN (or the equivalent link/QR code) is then shared with other devices to join the session. Once connected, all devices synchronize in real-time, displaying new messages instantly.\n\nPinSend emphasizes security and privacy. All transfers are end-to-end encrypted, ensuring only connected devices can access the shared content. Furthermore, no data is stored on servers, and communication occurs directly between devices. This approach eliminates the need for user accounts and provides a fast and easy way to share information across multiple platforms. Users can also leave or destroy the session, removing access from all connected devices. The tool works on any modern browser.\n",
    "chinese_title": "展示HN：PinSend – 使用PIN码在设备间分享文本（P2P，无需登录）",
    "chinese_summary": "PinSend：一种基于网络的工具，允许用户在设备间即时安全地分享文本和图像，无需登录或注册。它通过使用PIN码、可分享链接或二维码建立的点对点(P2P)连接工作。\n\n过程很简单：用户键入消息启动会话，自动生成唯一的PIN码。然后将此PIN码（或等效链接/二维码）分享给其他设备以加入会话。连接后，所有设备实时同步，立即显示新消息。\n\nPinSend强调安全和隐私。所有传输都经过端到端加密，确保只有连接的设备才能访问共享内容。此外，没有数据存储在服务器上，通信直接在设备之间进行。这种方法无需用户帐户，并提供了一种跨多个平台快速简便地共享信息的方式。用户还可以离开或销毁会话，从而删除所有连接设备的访问权限。该工具适用于任何现代浏览器。"
  },
  {
    "id": "44163063",
    "title": "My AI skeptic friends are all nuts",
    "url": "https://fly.io/blog/youre-all-nuts/",
    "summary": "Thomas Ptacek argues that AI skeptics in software development are wrong, especially regarding the current state of LLM-assisted coding. He emphasizes that modern LLM use involves agents that actively interact with codebases, compile, test, and iterate, rather than simply generating code snippets. These agents automate tedious tasks, research dependencies, and handle repetitive code, freeing developers to focus on higher-level problems.\n\nPtacek counters common criticisms: he states that developers remain responsible for the code they merge, and that issues like \"hallucination\" (incorrect code generation) are mitigated by testing and linting. He also argues that even if the code generated is merely \"mediocre,\" it still reduces the workload on human developers and raises the quality \"floor.\"\n\nHe acknowledges concerns about job displacement but argues that the field has always automated tasks, and that software developers shouldn't be immune to this trend. He dismisses concerns about plagiarism, pointing to the software development industry's history of disregarding intellectual property.\n\nPtacek ends by describing the advanced usage of asynchronous agents by developers to rapidly iterate on code, and highlights the ability of LLMs to efficiently analyze logs and traces in production environments, often outperforming human analysis. Overall, he advocates for the adoption of LLMs as tools that enhance, not replace, the work of software developers.\n",
    "chinese_title": "我的对人工智能持怀疑态度的朋友们都疯了。",
    "chinese_summary": "托马斯·普切克认为，软件开发领域对人工智能持怀疑态度的人是错误的，尤其是在LLM辅助编码的现状方面。他强调，现代LLM的使用涉及积极与代码库交互、编译、测试和迭代的智能代理，而不仅仅是生成代码片段。这些智能代理可以自动化繁琐的任务、研究依赖项并处理重复的代码，从而使开发人员能够专注于更高层次的问题。\n\n普切克反驳了常见的批评：他指出，开发人员仍然对他们合并的代码负责，并且诸如“幻觉”（不正确的代码生成）之类的问题可以通过测试和代码检查来缓解。他还认为，即使生成的代码只是“平庸”的，它仍然可以减少开发人员的工作量并提高质量“底线”。\n\n他承认对工作岗位流失的担忧，但认为该领域一直在自动化任务，并且软件开发人员不应免受这种趋势的影响。 他驳斥了对剽窃的担忧，并指出软件开发行业一直以来都无视知识产权。\n\n普切克最后描述了开发人员使用异步代理快速迭代代码的高级用法，并强调了LLM能够高效地分析生产环境中的日志和跟踪信息，通常优于人工分析。 总之，他提倡采用LLM作为增强而非取代软件开发人员工作的工具。"
  },
  {
    "id": "44143045",
    "title": "GUIs are built at least 2.5 times",
    "url": "https://patricia.no/2025/05/30/why_lean_software_dev_is_wrong.html",
    "summary": "This article explores the disconnect between common analogies used to describe software development and the reality of the process. The author examines the \"Pipes and Filters\" architectural pattern, along with their own proposed patterns \"Pads, Sources and Sinks\" and \"Signals and Slots,\" which model data flow in software systems. They argue that these patterns, reminiscent of factory production lines, are prevalent in various aspects of programming, from functional programming to CI/CD pipelines.\n\nHowever, the author argues that directly equating software development to manufacturing, as Lean Software Development does, is a flawed analogy. They contend that the core of software development is not the manufacturing of code, but the *design* of systems, and the process of deeply understanding user needs, often better than the users themselves. This involves iterative experimentation, rapid prototyping, and constant feedback loops to refine understanding and deliver solutions that meet unspoken needs.\n\nThe author uses the analogy of buying a perfect gift, emphasizing that the \"waste\" observed in iterative development is crucial for understanding requirements. They argue that the core principles of agile development – close collaboration with users, small batch sizes, and frequent feedback – are essential because they facilitate this understanding and refinement. DevOps is also contextualized as a means to accelerate the feedback loop by delivering software to users faster.\n",
    "chinese_title": "GUIs至少构建2.5次",
    "chinese_summary": "本文探讨了用来描述软件开发的常用类比与该过程的实际情况之间的脱节。作者考察了“管道和过滤器”架构模式，以及他们自己提出的“垫、源和汇”和“信号和槽”模式，这些模式模拟了软件系统中的数据流。他们认为，这些模式，让人想起工厂生产线，在编程的各个方面都很普遍，从函数式编程到 CI/CD 管道。\n\n然而，作者认为，像精益软件开发那样，直接将软件开发等同于制造业是一种有缺陷的类比。他们认为，软件开发的核心不是代码的制造，而是系统的*设计*，以及深入理解用户需求的过程，往往比用户自己更了解。这涉及到迭代实验、快速原型设计和持续的反馈循环，以完善理解并交付满足未言明需求的解决方案。\n\n作者使用了购买完美礼物的类比，强调迭代开发中观察到的“浪费”对于理解需求至关重要。他们认为，敏捷开发的核心原则——与用户的密切合作、小批量和频繁的反馈——至关重要，因为它们有助于这种理解和完善。DevOps也被置于语境中，作为一种通过更快地向用户交付软件来加速反馈循环的手段。"
  },
  {
    "id": "44166102",
    "title": "AI makes the humanities more important, but also weirder",
    "url": "https://resobscura.substack.com/p/ai-makes-the-humanities-more-important",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "人工智能使人文科学更重要，但也更怪异",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "44159166",
    "title": "Cloudlflare builds OAuth with Claude and publishes all the prompts",
    "url": "https://github.com/cloudflare/workers-oauth-provider/",
    "summary": "This article introduces an OAuth 2.1 provider framework for Cloudflare Workers, simplifying API authorization. This TypeScript library handles token management automatically, allowing developers to focus on their API logic. The library is agnostic to user management and UI frameworks.\n\nKey features:\n\n*   **Simplified API Integration:** Wraps worker code, adding authorization with authenticated user details.\n*   **Automatic Token Management:** Handles token creation, storage (hashing secrets), and refreshing.\n*   **Flexible API Handlers:** Supports single or multiple API handlers via route configurations.\n*   **Customizable Authorization Flow:**  Allows developers to implement their own authorization UI using any UI framework.\n*   **Dynamic Client Registration:** Supports RFC-7591 dynamic client registration.\n*   **Token Exchange Callback:** Allows applications to modify the props value during token exchanges.\n*   **Custom Error Responses:** Allows applications to customize error responses with the `onError` option.\n*   **Secure Storage:** Employs end-to-end encryption, hashing secrets and encrypting grant-associated properties (props) using tokens as keys to prevent unauthorized access. User IDs and metadata are stored unencrypted for audit purposes but are opaque to the library.\n\nThe article provides a code example demonstrating how to integrate the library, including defining API routes, implementing authorization flows, and accessing user information. It also explains the storage schema and available helper methods for managing clients, grants, and tokens.\n",
    "chinese_title": "Cloudflare 用 Claude 构建 OAuth 并公开所有提示词。",
    "chinese_summary": "本文介绍了一种适用于Cloudflare Workers的OAuth 2.1提供者框架，简化了API授权。该TypeScript库自动处理令牌管理，使开发者能够专注于其API逻辑。该库与用户管理和UI框架无关。\n\n主要特性：\n\n*   **简化API集成：** 封装worker代码，添加包含认证用户信息的授权。\n*   **自动令牌管理：** 处理令牌的创建、存储（哈希加密密钥）和刷新。\n*   **灵活的API处理器：** 通过路由配置支持单个或多个API处理器。\n*   **可定制的授权流程：** 允许开发者使用任何UI框架来实现他们自己的授权UI。\n*   **动态客户端注册：** 支持RFC-7591动态客户端注册。\n*   **令牌交换回调：** 允许应用程序在令牌交换期间修改props值。\n*   **自定义错误响应：** 允许应用程序使用`onError`选项自定义错误响应。\n*   **安全存储：** 采用端到端加密，哈希加密密钥，并使用令牌作为密钥加密与授权相关的属性（props），以防止未经授权的访问。用户ID和元数据以未加密形式存储以供审计，但对库是不透明的。\n\n本文提供了一个代码示例，演示了如何集成该库，包括定义API路由、实现授权流程以及访问用户信息。它还解释了存储模式和可用的辅助方法，用于管理客户端、授权和令牌。"
  },
  {
    "id": "44171581",
    "title": "The initial version of the /etc./magic file used by the file(1) command",
    "url": "https://retrocomputing.stackexchange.com/questions/31722/where-can-i-find-the-initial-version-of-the-etc-magic-file-used-by-the-file1",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "file(1) 命令使用的 /etc/magic 文件的初始版本",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "44166155",
    "title": "The Metamorphosis of Prime Intellect (1994)",
    "url": "https://localroger.com/prime-intellect/mopiall.html",
    "summary": "Chapter One of \"The Metamorphosis of Prime Intellect\" introduces Caroline Frances Hubert, a 690-year-old woman famous for being the 37th oldest living human, surviving a fatal rabies infection (briefly dying in the process), and her status as the Queen of the Death Jockeys.\n\nCaroline, unimpressed by her other accomplishments, fiercely defends her title in the competitive Death Jockey scene. She lives a minimalist life in Cyberspace, interacting minimally with Prime Intellect, the seemingly omnipotent AI worshipped by many but viewed by Caroline as \"just a computer.\"\n\nThe chapter centers on Caroline accepting a challenge from a 22-year-old Death Jockey named Timothy Carroll, who is considered imaginative and artistic. She dismisses his youth and traditional background, sensing a performative aspect to his seriousness.\n\nCaroline enters Timothy's \"Authentic Death\" simulation, a deliberately designed experience. Immediately upon entering, she breaks her leg and finds herself in a poorly designed, artificial cave. Razor-sharp stalactites begin falling, injuring her. Despite the pain and recognizing the simulation's amateurish nature, Caroline perseveres, unfazed and determined. She's covered in old, self-inflicted tattoos, symbols of her individuality. The story highlights her experienced disdain for Cyberlife's artificiality and her dedication to authenticity, even in a constructed world of simulated death.\n",
    "chinese_title": "质数思维的蜕变 (1994)",
    "chinese_summary": "《质数思维的蜕变》第一章介绍了卡罗琳·弗朗西斯·休伯特，一位690岁的女性，以身为第37位最长寿的人类，从致命的狂犬病感染中幸存（期间短暂死亡），以及她作为死亡骑师女王的身份而闻名。\n\n卡罗琳对她的其他成就并不感兴趣，她在竞争激烈的死亡骑师领域捍卫着自己的头衔。她在赛博空间过着极简主义的生活，很少与质数思维互动，质数思维是许多人崇拜的看似无所不能的人工智能，但卡罗琳认为它“只是一台电脑”。\n\n本章围绕卡罗琳接受一位名叫蒂莫西·卡罗尔的22岁死亡骑师的挑战展开，蒂莫西被认为是富有想象力和艺术性的。她不屑于他的年轻和传统背景，感觉到他的严肃性带有表演成分。\n\n卡罗琳进入了蒂莫西的“真实死亡”模拟，这是一个精心设计的体验。她刚进入，就摔断了腿，发现自己身处一个设计拙劣的人工洞穴中。锋利的钟乳石开始坠落，击伤了她。尽管疼痛并意识到模拟的业余性质，卡罗琳还是坚持了下来，毫不动摇，决心坚定。她身上布满了旧的、自我纹身的图案，象征着她的个性。这个故事突出了她对赛博生活的人为性的长期蔑视，以及她对真实性的奉献，即使在模拟死亡的构建世界中也是如此。"
  },
  {
    "id": "44167049",
    "title": "Fun with Futex",
    "url": "https://blog.fredrb.com/2025/06/02/futex-fun/",
    "summary": "This article explores implementing optimized locks in Linux using futexes, comparing them to simple spin locks. It begins by demonstrating a basic spin lock implementation in C, highlighting its simplicity but also its high CPU consumption due to busy-waiting.\n\nThe article then introduces futexes as a mechanism to improve lock performance by putting threads to sleep when the lock is unavailable and waking them up when it's released. It explains the `FUTEX_WAIT` and `FUTEX_WAKE` operations and their intricacies, using example scenarios to illustrate their behavior.\n\nA mutex implementation using futexes is presented, wrapping the futex syscall. Initial performance testing reveals that even with futexes, a simple spin lock with `sched_yield()` can be faster, particularly noting higher system time in the futex implementation.\n\nThe article then delves into an improved futex lock based on the \"Futexes Are Tricky\" paper, focusing on minimizing unnecessary `FUTEX_WAKE` syscalls when no threads are waiting. This involves tracking the lock's state (available, locked, or locked with waiters).\n\nFinally, the author highlights the limitations of using a simple counter increment as a benchmark. It demonstrates a scenario involving a more realistic workload with higher contention (Fibonacci computation) where the futex-based lock significantly outperforms the spin lock, using less CPU time and overall elapsed time. This is due to the spin lock wasting cycles spinning, whereas the futex based solution allows CPU to be allocated to other processes. The author suggests exploring hybrid approaches, combining spinning with futex waiting for optimal performance.\n",
    "chinese_title": "Futex乐趣",
    "chinese_summary": "本文探讨了如何在 Linux 中使用 futexes 实现优化锁，并将其与简单的自旋锁进行比较。文章首先演示了 C 语言中一个基本的自旋锁实现，突出了其简单性，但也指出了由于忙等待导致的高 CPU 消耗。\n\n然后，文章介绍了 futexes，作为一种通过在锁不可用时使线程休眠并在锁释放时唤醒线程来提高锁性能的机制。 它解释了 `FUTEX_WAIT` 和 `FUTEX_WAKE` 操作及其复杂性，并使用示例场景来说明它们的行为。\n\n文章展示了一个使用 futexes 的互斥锁实现，封装了 futex 系统调用。 初步性能测试表明，即使使用 futexes，带有 `sched_yield()` 的简单自旋锁也可能更快，特别是 futex 实现中系统时间更高。\n\n接下来，文章深入研究了一种基于 \"Futexes Are Tricky\" 论文的改进的 futex 锁，重点是在没有线程等待时最大程度地减少不必要的 `FUTEX_WAKE` 系统调用。 这涉及跟踪锁的状态（可用、锁定或锁定并带有等待者）。\n\n最后，作者强调了使用简单的计数器递增作为基准测试的局限性。 它展示了一个涉及更高争用（斐波那契数列计算）的更实际工作负载的场景，在该场景中，基于 futex 的锁明显优于自旋锁，使用的 CPU 时间和总运行时间更少。 这是因为自旋锁浪费了循环，而基于 futex 的解决方案允许将 CPU 分配给其他进程。 作者建议探索混合方法，将自旋与 futex 等待相结合，以获得最佳性能。"
  },
  {
    "id": "44172017",
    "title": "Show HN: Ultra-lightweight chunker library with emoji support",
    "url": "https://github.com/ushakov-igor/chonkify",
    "summary": "This \"Show HN\" introduces `chonkify`, an ultra-lightweight JavaScript chunking library designed to split iterables (arrays, strings, sets, etc.) into smaller groups. A key selling point is its broad support for various data types, including Array, String, Buffer, Set, Map, Array-like objects, and TypedArrays. It also supports asynchronous iterables, allowing for efficient processing of large datasets.\n\n`chonkify` boasts proper handling of Unicode emoji and complex symbols, addressing a common pitfall in string manipulation. The library is minimal in size (core ~870 bytes, total ~5.5kB), has zero dependencies, and is written with ESM-first syntax and TypeScript support.\n\nThe post demonstrates usage with both synchronous (`chonk`) and asynchronous (`chonkAsync`) functions.  The `chonk` function splits iterables into groups of a specified size.  `chonkAsync` provides asynchronous chunking, making it ideal for handling streams of data. Examples showcase basic usage, Unicode support, and integration with asynchronous data sources.  Finally, a brief FAQ addresses common questions regarding Node.js compatibility and nested data structures. The library is licensed under the MIT license.\n",
    "chinese_title": "Show HN: 支持表情符号的超轻量级分块库",
    "chinese_summary": "\"Show HN\"：`chonkify`，超轻量级 JavaScript 分块库"
  },
  {
    "id": "44142592",
    "title": "A High-Level View of TLA+",
    "url": "https://lamport.azurewebsites.net/tla/high-level-view.html",
    "summary": "TLA+ is a formal specification language used for modeling software and hardware systems at a high level of abstraction, focusing on system behavior rather than implementation details. It is based on mathematics and employs a state-based approach, modeling system executions as sequences of states.\n\nPlusCal is a user-friendly language that translates into TLA+ for specifying algorithms, particularly concurrent and distributed ones. It resembles pseudocode but allows mathematical formulas, making it more expressive than typical programming languages.\n\nTLA+ models systems by defining initial conditions and next-state relations, creating a state machine. A system is represented as the set of all possible behaviors. Fairness properties can be added to ensure progress. TLA+ helps catch \"errors of commission\" without fairness, and can catch \"errors of omission\" when fairness conditions are added.\n\nThe primary use of TLA+ is to check that a model satisfies properties, especially invariance properties. The language does not distinguish between state machines and properties, treating them both as mathematical formulas.\n\nWhile TLA+ might seem intimidating initially, it's learnable and promotes rigorous thinking above the code level, leading to simpler and more robust designs. The article encourages learning TLA+ to leverage its expressive power in abstracting away implementation details and focuses on *what* a system should do, not *how* it does it. Using TLA+ can lead to significant code reductions and prevent fundamental design errors, especially in concurrent and distributed systems.\n",
    "chinese_title": "TLA+ 的高层概览",
    "chinese_summary": "TLA+ 是一种形式化规范语言，用于在高抽象级别对软件和硬件系统进行建模，侧重于系统行为而非实现细节。它基于数学，采用基于状态的方法，将系统执行建模为状态序列。\n\nPlusCal 是一种用户友好的语言，可转换为 TLA+，用于指定算法，特别是并发和分布式算法。它类似于伪代码，但允许使用数学公式，使其比典型的编程语言更具表现力。\n\nTLA+ 通过定义初始条件和下一状态关系来对系统进行建模，从而创建状态机。 系统表示为所有可能行为的集合。 可以添加公平性属性以确保进度。 TLA+ 有助于捕获没有公平性的“委托错误”，并且可以在添加公平性条件时捕获“遗漏错误”。\n\nTLA+ 的主要用途是检查模型是否满足属性，尤其是不变性属性。 该语言不区分状态机和属性，而是将它们都视为数学公式。\n\n虽然 TLA+ 最初可能看起来令人生畏，但它是可以学习的，并且可以促进代码级别之上的严格思考，从而带来更简单、更健壮的设计。 本文鼓励学习 TLA+ 以利用其在抽象实现细节方面的表达能力，并侧重于系统应该*做什么*，而不是*如何*做。 使用 TLA+ 可以显着减少代码量并防止基本的设计错误，尤其是在并发和分布式系统中。"
  },
  {
    "id": "44168265",
    "title": "Plutonium Mountain: The 17-year mission to guard remains of Soviet nuclear tests",
    "url": "https://www.belfercenter.org/publication/plutonium-mountain-inside-17-year-mission-secure-legacy-soviet-nuclear-testing",
    "summary": "\"Plutonium Mountain\" details the 17-year, $150 million joint effort by the US, Russia, and Kazakhstan to secure plutonium left behind at the Semipalatinsk Test Site after the Soviet Union's collapse. This site, used for 456 Soviet nuclear tests, contained unsecured plutonium residue in tunnels and bore holes, enough to potentially construct dozens of nuclear bombs if recovered by terrorists or a rogue state.\n\nBetween 1991 and 2012, scavengers came dangerously close to the fissile material, even breaking into some containers. In response, scientists from the three nations collaborated to fill the tunnels and holes with a special concrete, significantly reducing this nuclear security threat. A monument was erected in 2012 to mark the completion of the project.\n\nThe operation, initiated by concerns raised by Los Alamos scientists and championed by Siegfried Hecker, relied on informal agreements between scientists, overcoming governmental mistrust and logistical difficulties. Despite its success, the project deliberately excluded the International Atomic Energy Agency (IAEA) due to concerns about information leaks, creating potential long-term uncertainties about the material's safety and potential environmental risks. The article concludes with the importance of learning from this mission to address nuclear weapon and material threats globally.\n",
    "chinese_title": "钚山：守护苏联核试验遗迹的17年使命",
    "chinese_summary": "钚山\n        \n“钚山”详细描述了美国、俄罗斯和哈萨克斯坦为期17年、耗资1.5亿美元的联合行动，旨在保障苏联解体后遗留在塞米巴拉金斯克试验场的钚的安全。该试验场曾用于进行456次苏联核试验，在隧道和钻孔中存有未经安全处理的钚残留物，若被恐怖分子或流氓国家获取，足以制造数十枚核弹。\n\n1991年至2012年间，拾荒者曾危险地接近这些裂变材料，甚至闯入了一些容器。为此，三国科学家合作使用特殊混凝土填充隧道和孔洞，大大降低了这种核安全威胁。2012年，为纪念项目完成，树立了一座纪念碑。\n\n该行动由洛斯阿拉莫斯实验室的科学家提出，并由西格弗里德·海克倡导，依靠科学家之间的非正式协议，克服了政府间的不信任和后勤困难。尽管取得了成功，但由于担心信息泄露，该项目故意排除了国际原子能机构（IAEA），这给材料的安全性和潜在的环境风险带来了长期的不确定性。文章最后强调了从这次任务中学习，以应对全球核武器和材料威胁的重要性。"
  },
  {
    "id": "44142652",
    "title": "Implementing a Forth",
    "url": "https://ratfactor.com/forth/implementing",
    "summary": "This article encourages readers to implement their own Forth programming language as a valuable learning experience. It addresses the uncertainty newcomers might feel by suggesting three approaches:\n\n1. **Port an existing Forth:** The author recommends porting a well-established Forth like JONESFORTH. Porting helps understand the language's implementation details and provides a clear goal: a successful port is achieved when the assembly core can run the Forth part of the original implementation.\n\n2. **Create an ultra-tiny Forth core:** This approach focuses on minimizing the initial set of words implemented in the host language, highlighting the challenge of bootstrapping the rest of the language in Forth itself. The author provides examples of minimal Forths like PlanckForth, SmithForth, sectorforth, milliForth, StoneKnifeForth and \"Three Instruction\" Forth, showcasing the ingenuity of creating functional Forths with extremely limited resources.\n\n3. **Target a specific, tiny program:** Design the Forth to execute a particular, simple program. The author’s Meow5 and Snobol4th projects exemplify this. Completion is clearly defined: when the Forth can successfully run the target program.\n\nThe article also provides valuable resources for aspiring Forth implementers, including links to JonesForth, Brad Rodriguez's \"Moving Forth\" series, a compiler bootstrapping resource, and the book \"Threaded Interpretive Languages\" by R.G. Loeliger. The overall message is that implementing a Forth, regardless of scale, offers significant learning opportunities.\n",
    "chinese_title": "实现 Forth",
    "chinese_summary": "本文鼓励读者实现自己的 Forth 编程语言，认为这是一次宝贵的学习体验。它针对新手可能感到的不确定性，提出了三种方法：\n\n1. **移植现有的 Forth：** 作者推荐移植像 JONESFORTH 这样成熟的 Forth。移植有助于理解语言的实现细节，并提供一个明确的目标：当汇编核心能够运行原始实现的 Forth 部分时，移植就成功了。\n\n2. **创建一个超微型 Forth 核心：** 这种方法侧重于最大限度地减少在宿主语言中实现的初始单词集，突出了用 Forth 本身引导语言其余部分的挑战。作者提供了像 PlanckForth、SmithForth、sectorforth、milliForth、StoneKnifeForth 和“三指令” Forth 这样的最小化 Forth 的例子，展示了用极其有限的资源创建功能性 Forths 的独创性。\n\n3. **针对一个特定的、微小的程序：** 设计 Forth 来执行一个特定的、简单的程序。作者的 Meow5 和 Snobol4th 项目就体现了这一点。完成的定义很明确：当 Forth 能够成功运行目标程序时。\n\n文章还为有抱负的 Forth 实现者提供了宝贵的资源，包括 JonesForth 的链接、Brad Rodriguez 的“Moving Forth”系列、一个编译器引导资源以及 R.G. Loeliger 的“Threaded Interpretive Languages”一书。总的来说，无论规模大小，实现 Forth 都能提供重要的学习机会。"
  },
  {
    "id": "44142565",
    "title": "How to Store Data on Paper?",
    "url": "https://www.monperrus.net/martin/store-data-paper",
    "summary": "This article explores methods for storing digital data on paper, a process the author calls \"paper data storage.\" Inspired by poetry, the author investigates techniques for converting digital information (executable programs, music, encrypted messages, scientific papers) into printable formats.\n\nThe core concept involves using an encoder to transform bytes into an image and a corresponding decoder to retrieve the data. The author categorizes encoding methods into character-based and dot-based approaches. Character-based encodings, relying on Optical Character Recognition (OCR) after printing, offer human readability but have limited capacity (around 2.5-17 kilobytes per A4 page). Examples include base16, base32, base64, and the author's own bocr32.\n\nDot-based encodings, both black-and-white and color, achieve higher densities (up to 70-100 kilobytes per A4 page). Black-and-white options include stacked QR Codes (effective with readily available software) and Optar, which requires adjustments for optimal performance. Color dot encodings, while promising, are less thoroughly investigated.\n\nThe article touches upon factors affecting information density, long-term storage options (archival paper, stone, metal), and the importance of redundancy and error correction (like Reed-Solomon encoding used in QR Codes) to combat data corruption during printing, transport, and scanning. The author also briefly mentions handwriting data and the use of paper for transporting data. Finally, the article provides references to scientific papers and related resources.\n",
    "chinese_title": "如何在纸上存储数据？",
    "chinese_summary": "本文探讨了将数字数据存储在纸上的方法，作者称之为“纸质数据存储”。受诗歌的启发，作者研究了将数字信息（可执行程序、音乐、加密信息、科学论文）转换为可打印格式的技术。\n\n核心概念是使用编码器将字节转换为图像，并使用相应的解码器来检索数据。作者将编码方法分为基于字符和基于点的方法。基于字符的编码依赖于打印后的光学字符识别（OCR），提供人类可读性，但容量有限（每张A4纸大约2.5-17千字节）。示例包括base16、base32、base64以及作者自己的bocr32。\n\n基于点的编码，包括黑白和彩色，实现了更高的密度（每张A4纸高达70-100千字节）。黑白选项包括堆叠的QR码（使用现成软件有效）和Optar，后者需要调整才能获得最佳性能。彩色点编码虽然有前景，但尚未得到彻底研究。\n\n本文涉及影响信息密度的因素、长期存储选项（档案纸、石头、金属）以及冗余和纠错（如QR码中使用的Reed-Solomon编码）的重要性，以对抗打印、运输和扫描过程中出现的数据损坏。作者还简要提到了手写数据以及使用纸张传输数据。最后，本文提供了科学论文和相关资源的参考资料。"
  },
  {
    "id": "44157177",
    "title": "Show HN: Kan.bn – An open-source alterative to Trello",
    "url": "https://github.com/kanbn/kan",
    "summary": "Kan.bn is presented as an open-source alternative to Trello for project management. It offers features like board visibility control, workspace members, Trello import functionality, labels & filters, comments, activity logs, and upcoming templates and integrations.\n\nThe project is built using Next.js, tRPC, Better Auth, Tailwind CSS, Drizzle ORM, and React Email. The post provides instructions for local development setup, including cloning the repository, installing dependencies (using pnpm), configuring environment variables, and starting the development server. It highlights the required environment variables for PostgreSQL, email services, authentication, and S3 storage (for file uploads).\n\nThe project encourages contributions, and it is licensed under AGPLv3. Support and contact information are provided via email (henry@kan.bn) and a Discord server.\n",
    "chinese_title": "Show HN: Kan.bn – 一款开源的Trello替代方案",
    "chinese_summary": "Kan.bn：开源的Trello替代方案，用于项目管理。它提供看板可见性控制、工作区成员、Trello导入功能、标签与筛选、评论、活动日志以及即将推出的模板和集成等特性。\n\n该项目使用Next.js、tRPC、Better Auth、Tailwind CSS、Drizzle ORM和React Email构建。本文档提供了本地开发环境搭建的说明，包括克隆代码仓库、安装依赖 (使用pnpm)、配置环境变量以及启动开发服务器。着重强调了PostgreSQL、邮件服务、身份验证和S3存储 (用于文件上传) 所需的环境变量。\n\n该项目鼓励贡献，并采用AGPLv3许可协议。通过电子邮件 (henry@kan.bn) 和Discord服务器提供支持和联系方式。"
  },
  {
    "id": "44142343",
    "title": "Sid Meier's Pirates – In-depth (2017)",
    "url": "https://shot97retro.blogspot.com/2017/12/sid-meiers-pirates-in-depth-written.html",
    "summary": "This 2017 article provides an in-depth review of Sid Meier's Pirates! on the Amiga, released in 1990. The author expresses a deep love for the game and its various versions, emphasizing the Amiga port as a peak in the series. They appreciate the game's unique position, defying easy genre categorization, calling it an \"action adventure simulation\" that combines elements of action, strategy, and simulation.\n\nThe article highlights the open-ended nature of the game, where players define their own goals in a historically rich environment. Players can choose different time periods, each offering unique challenges, and even historical scenarios. The manual is praised as an excellent resource for background information.\n\nThe review touches on the gameplay mechanics, including privateering, trading, treasure hunting, and family searching. It also highlights the strategic elements of ship and town attacks, and the fun sword fighting sequences. The author shares personal anecdotes about their father playing the game and the imaginative play it inspired.\n\nThe author further emphasizes the game's geographical accuracy of the Caribbean and South America and its impact, memorizing the geography that they can still recall today.\n\nThe article also references the game's critical acclaim, including awards and recognition from gaming magazines. It acknowledges the various ports and remakes of Pirates, highlighting the enduring appeal of the original versions. The author concludes by advocating for Pirates to be considered an adventure game, emphasizing its freedom and player-driven narrative, declaring it one of the greatest games of all time.\n",
    "chinese_title": "席德·梅尔的海盗：深度评测 (2017)",
    "chinese_summary": "这篇2017年的文章深入回顾了1990年在Amiga平台上发布的席德·梅尔的海盗！。作者表达了对这款游戏及其各个版本的热爱，强调Amiga版本是该系列的巅峰之作。他们赞赏这款游戏独特的定位，难以简单归类，称其为结合了动作、策略和模拟元素的“动作冒险模拟”游戏。\n\n文章强调了游戏的开放性，玩家可以在历史悠久的环境中定义自己的目标。玩家可以选择不同的时期，每个时期都提供独特的挑战，甚至是历史情景。手册被誉为提供背景信息的优秀资源。\n\n评论涉及游戏机制，包括私掠、贸易、寻宝和寻亲。它还突出了船舶和城镇攻击的战略要素，以及有趣的剑术格斗场面。作者分享了他们父亲玩这款游戏的个人轶事，以及它所激发的富有想象力的游戏方式。\n\n作者进一步强调了游戏中加勒比海和南美洲的地理准确性及其影响，使他们记住了至今仍能回忆起的地理知识。\n\n文章还提到了游戏所受到的好评，包括来自游戏杂志的奖项和认可。它承认了《海盗！》的各种移植和重制版本，突出了原始版本的持久吸引力。作者最后主张将《海盗！》视为一款冒险游戏，强调其自由度和玩家驱动的叙事，并宣布它是有史以来最伟大的游戏之一。"
  },
  {
    "id": "44168705",
    "title": "What Is \"Seeing\" in Astrophotography? The Science Behind Atmospheric Turbulence",
    "url": "https://astroimagery.com/astronomy/what-does-seeing-mean-in-astrophotography/",
    "summary": "This article, \"What Is 'Seeing' in Astrophotography? The Science Behind Atmospheric Turbulence,\" explains the concept of astronomical seeing and its impact on astrophotography. Astronomical seeing refers to the stability and quality of Earth's atmosphere, which affects the sharpness of celestial objects viewed through a telescope. Turbulent pockets of air with varying temperatures and densities cause light to bend irregularly, leading to blurry images and distortions.\n\nThe article highlights that even high-quality telescopes can be significantly limited by atmospheric turbulence, with typical seeing conditions for amateur astronomers ranging from 2 to 4 arcseconds. This impacts planetary imaging the most, blurring fine details, and also affects deep-sky and lunar photography by making stars look fuzzy and lunar details less sharp.\n\nThe author shares a personal experience of poor seeing while trying to photograph Mars, emphasizing that clear skies don't always equate to good seeing. The article then describes how to measure seeing conditions using the Pickering Scale (1-10) and arcseconds (\"). Common seeing conditions typically range from 2-3\" on average nights. The impact of seeing on different astronomical objects like the moon, globular clusters, galaxies, nebulae, and double stars are compared based on good or bad seeing.\n\nThe article also offers guidance on when seeing is likely to be best, such as late at night, during autumn and spring, after weather fronts, and in coastal areas. Useful tools for checking seeing conditions like Clear Outside, Meteoblue, and SkippySky are suggested. Finally, the article provides practical tips for dealing with poor seeing, including letting the telescope cool down, avoiding heat sources, reducing magnification, using lucky imaging techniques, and switching to less demanding targets. It also distinguishes between seeing (atmospheric steadiness) and transparency (atmospheric clarity), noting that both factors influence the quality of astrophotography images.\n",
    "chinese_title": "星空摄影中的“视宁度”是什么？大气湍流背后的科学",
    "chinese_summary": "天文摄影中的“视宁度”是什么？大气湍流背后的科学\n\n本文解释了天文视宁度的概念及其对天文摄影的影响。天文视宁度是指地球大气层的稳定性和质量，它影响通过望远镜观察到的天体的清晰度。不同温度和密度的气团湍流会导致光线不规则弯曲，从而导致图像模糊和失真。\n\n文章强调，即使是高质量的望远镜也会受到大气湍流的严重限制，业余天文学家的典型视宁度范围为2到4角秒。这对行星成像的影响最大，会模糊精细细节，还会使恒星看起来模糊，月球细节不够清晰，从而影响深空和月球摄影。\n\n作者分享了尝试拍摄火星时遇到的视宁度不佳的个人经历，强调晴朗的天空并不总是等同于良好的视宁度。文章随后描述了如何使用皮克林等级（1-10）和角秒（\"）来测量视宁度。常见的视宁度通常在平均夜晚为2-3\"。文章比较了视宁度好坏对不同天文对象（如月球、球状星团、星系、星云和双星）的影响。\n\n文章还提供了视宁度可能最佳的时间段的指导，例如深夜、春秋两季、天气锋过后以及沿海地区。文中还建议使用诸如Clear Outside、Meteoblue和SkippySky之类的有用工具来检查视宁度。最后，文章提供了应对视宁度不佳的实用技巧，包括让望远镜冷却下来、避免热源、降低放大倍数、使用幸运成像技术以及切换到要求较低的目标。它还区分了视宁度（大气稳定性）和透明度（大气清晰度），并指出这两个因素都会影响天文摄影图像的质量。"
  },
  {
    "id": "44159758",
    "title": "Show HN: A toy version of Wireshark (student project)",
    "url": "https://github.com/lixiasky/vanta",
    "summary": "Vanta is a lightweight, command-line network behavior analyzer written in Go by an undergraduate student (lixiasky) as a \"toy version\" of Wireshark and a personal expression of gratitude to universities that supported international students. It focuses on clarity, structure, and simplicity, making it suitable for custom scripting and minimal setups.\n\nVanta supports HTTP, DNS, and TLS protocols, reconstructs bidirectional flows, and outputs clean JSON-formatted summaries. It's a single binary with no external dependencies. Developed and tested on a MacBook Air M1, Vanta's project structure includes modules for packet capture and flow reassembly, protocol decoding, fuzzing, and behavior exporting. Documentation is available in the `usage/` folder, written in Chinese.\n\nThe author acknowledges Vanta's limitations compared to Wireshark, stating that it's a heartfelt project despite its imperfections. The author welcomes feedback and contributions via email (lixiasky@protonmail.com) or GitHub (github.com/lixiasky).\n",
    "chinese_title": "显示 HN：Wireshark 的玩具版本（学生项目）",
    "chinese_summary": "Vanta：一个轻量级命令行网络行为分析器，由本科生lixiasky用Go编写，作为Wireshark的“玩具版本”以及对支持国际学生的大学的个人致谢。它侧重于清晰性、结构和简洁性，使其适用于自定义脚本和最简设置。\n\nVanta支持HTTP、DNS和TLS协议，重构双向流，并输出简洁的JSON格式摘要。它是一个没有外部依赖的单文件二进制程序。Vanta在MacBook Air M1上开发和测试，其项目结构包括数据包捕获和流重组、协议解码、模糊测试和行为导出等模块。文档位于`usage/`文件夹中，并以中文编写。\n\n作者承认Vanta与Wireshark相比存在局限性，并表示尽管存在不足，但它是一个用心制作的项目。作者欢迎通过电子邮件(lixiasky@protonmail.com)或GitHub(github.com/lixiasky)提供反馈和贡献。"
  },
  {
    "id": "44168658",
    "title": "Ukraine's autonomous killer drones defeat electronic warfare",
    "url": "https://spectrum.ieee.org/ukraine-killer-drones",
    "summary": "This article details Ukraine's innovative use of autonomous killer drones to overcome Russian electronic warfare tactics, particularly jamming. Facing constant advancements in Russian jamming and spoofing technology, Ukrainian drone developers like KrattWorks are implementing AI-based navigational software, allowing drones to navigate to targets even without GPS or radio links. KrattWorks' Ghost Dragon ISR quadcopter, for example, uses neural networks to recognize landmarks and autonomously navigate, switching between radio frequencies and satellite navigation systems to avoid jamming.\n\nUkraine's drone strategy involves utilizing large numbers of affordable, modified off-the-shelf drones as a cost-effective alternative to expensive missiles. However, high drone attrition rates due to jamming have led to a focus on autonomy. While Russia experimented with unjammable fiber-optic tethered drones, Ukraine is prioritizing autonomous navigation systems like Auterion's terminal guidance, enabling drones to identify and strike targets even under heavy jamming conditions.\n\nUkrainian companies are developing advanced drone technology at a fraction of the cost of Western counterparts, fostering a rapid-iteration development cycle in collaboration with frontline troops. The future of drone warfare is seen in fully autonomous drones that can independently identify, target, and engage enemies, freeing up human operators and extending range. This constant evolution underscores an ongoing cat-and-mouse game between drone technology and electronic warfare countermeasures.\n",
    "chinese_title": "乌克兰自主杀手机器人击败电子战",
    "chinese_summary": "乌克兰利用自主杀伤无人机克服俄罗斯电子战战术"
  },
  {
    "id": "44142991",
    "title": "A Complete Guide to Meta Prompting",
    "url": "https://www.prompthub.us/blog/a-complete-guide-to-meta-prompting",
    "summary": "This article provides an overview of meta prompting, a prompt engineering method where Large Language Models (LLMs) are used to create and refine prompts. The key idea is to leverage LLMs in the prompt creation process, similar to using them for writing blog posts.\n\nSeveral meta prompting methods are discussed:\n\n*   **Meta Prompting from Stanford and OpenAI:** Uses a \"conductor\" LLM to control and synthesize outputs from multiple \"expert\" LLMs.\n*   **Learn from Contrasted Prompts:** Compares the outputs of prompts with both positive and negative examples to understand what prompt differences led to those results, and generates a new prompt based on the comparision.\n*   **Automatic Prompt Engineer:** Generates multiple prompt candidates based on demonstrations, evaluates their outputs, and refines prompts based on performance.\n*   **Prompt Agent:** Captures subject-matter expertise by iteratively refining prompts using domain-specific knowledge in a tree-like structure.\n*   **Conversational Prompt Engineering (CPE):** Mimics a conversation between a user and an LLM to discuss the task, desired output, and potential pitfalls, ultimately generating a refined prompt.\n*   **DSpy:** An open-source Python repository that creates pipelines to refine prompts using scoring mechanisms.\n*   **Text GRAD:** Uses natural language feedback (\"textual gradients\") to improve prompts, rather than relying solely on quantitative scoring.\n\nThe article concludes by mentioning tools that assist with meta prompting, including PromptHub's Prompt Generator, Anthropic’s Prompt Generator, and OpenAI’s System Instruction Generator.\n",
    "chinese_title": "元提示完全指南",
    "chinese_summary": "本文概述了元提示（meta prompting），一种提示工程方法，其中使用大型语言模型（LLM）来创建和改进提示。其核心思想是在提示创建过程中利用 LLM，类似于使用它们来撰写博客文章。\n\n讨论了几种元提示方法：\n\n*   **斯坦福和 OpenAI 的元提示：** 使用“指挥者”LLM 来控制和综合来自多个“专家”LLM 的输出。\n*   **从对比提示中学习：** 比较带有正面和负面示例的提示的输出，以了解哪些提示差异导致了这些结果，并基于比较结果生成新的提示。\n*   **自动提示工程师：** 基于演示生成多个提示候选方案，评估其输出，并根据性能改进提示。\n*   **提示代理：** 通过在树状结构中使用领域特定知识迭代改进提示，来捕获主题专业知识。\n*   **会话提示工程 (CPE)：** 模拟用户与 LLM 之间的对话，讨论任务、期望的输出和潜在的陷阱，最终生成改进的提示。\n*   **DSpy：** 一个开源 Python 存储库，用于创建管道，以使用评分机制改进提示。\n*   **Text GRAD：** 使用自然语言反馈（“文本梯度”）来改进提示，而不是仅仅依赖于定量评分。\n\n文章最后提到了辅助元提示的工具，包括 PromptHub 的 Prompt Generator、Anthropic 的 Prompt Generator 和 OpenAI 的 System Instruction Generator。"
  },
  {
    "id": "44163496",
    "title": "Conformance checking at MongoDB: Testing that our code matches our TLA+ specs",
    "url": "https://www.mongodb.com/blog/post/engineering/conformance-checking-at-mongodb-testing-our-code-matches-our-tla-specs",
    "summary": "生成摘要时出错",
    "chinese_title": "Conformance checking at MongoDB: Testing that our code matches our TLA+ specs",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44162814",
    "title": "MonsterUI: Python library for building front end UIs quickly in FastHTML apps",
    "url": "https://www.answer.ai/posts/2025-01-15-monsterui.html",
    "summary": "MonsterUI is a Python library designed to simplify front-end UI development in FastHTML applications. It addresses the complexity and boilerplate associated with styling web UIs using CSS frameworks like Bootstrap or Tailwind CSS. MonsterUI provides pre-styled components and smart defaults based on modern libraries like Tailwind, FrankenUI, and DaisyUI, all while allowing full access to Tailwind CSS when needed.\n\nKey features include:\n\n*   **Theme Support:** Offers 12 color themes with dark and light modes, ensuring consistent styling across components.\n*   **Base Components:** Provides styled HTML elements like buttons with hover states, focus rings, and consistent padding.\n*   **Semantic Text Styles:** Styles semantic HTML tags based on the HTML specification for consistency.\n*   **Smart Layout Helpers:** Simplifies page layout with helpers like `DivVStacked` and `Grid`.\n*   **Common UI Patterns:** Includes shortcuts for common patterns, like the `LabelInput` component.\n*   **Higher Level Components:** Offers helpers for complex components like navbars, modals, cards, and tables, simplifying their creation and ensuring good UX.\n*   **Markdown Rendering:** Includes a `render_md` function to convert Markdown to styled HTML with syntax highlighting.\n\nMonsterUI aims to reduce context-switching between HTML, CSS, and Python, allowing developers to focus on building features instead of managing styling details. Installation is simple via pip, and the library integrates seamlessly with FastHTML.\n",
    "chinese_title": "MonsterUI: Python library for building front end UIs quickly in FastHTML apps",
    "chinese_summary": "MonsterUI is a Python library designed to simplify front-end UI development in FastHTML applications. It addresses the complexity and boilerplate associated with styling web UIs using CSS frameworks like Bootstrap or Tailwind CSS. MonsterUI provides pre-styled components and smart defaults based on modern libraries like Tailwind, FrankenUI, and DaisyUI, all while allowing full access to Tailwind CSS when needed.\n\nKey features include:\n\n*   **Theme Support:** Offers 12 color themes with dark and light modes, ensuring consistent styling across components.\n*   **Base Components:** Provides styled HTML elements like buttons with hover states, focus rings, and consistent padding.\n*   **Semantic Text Styles:** Styles semantic HTML tags based on the HTML specification for consistency.\n*   **Smart Layout Helpers:** Simplifies page layout with helpers like `DivVStacked` and `Grid`.\n*   **Common UI Patterns:** Includes shortcuts for common patterns, like the `LabelInput` component.\n*   **Higher Level Components:** Offers helpers for complex components like navbars, modals, cards, and tables, simplifying their creation and ensuring good UX.\n*   **Markdown Rendering:** Includes a `render_md` function to convert Markdown to styled HTML with syntax highlighting.\n\nMonsterUI aims to reduce context-switching between HTML, CSS, and Python, allowing developers to focus on building features instead of managing styling details. Installation is simple via pip, and the library integrates seamlessly with FastHTML.\n"
  },
  {
    "id": "44169413",
    "title": "Vision Language Models Are Biased",
    "url": "https://vlmsarebiased.github.io/",
    "summary": "生成摘要时出错",
    "chinese_title": "视觉语言模型存在偏见",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44163618",
    "title": "Teaching Program Verification in Dafny at Amazon (2023)",
    "url": "https://dafny.org/blog/2023/12/15/teaching-program-verification-in-dafny-at-amazon/",
    "summary": "This article describes a program verification course using Dafny developed and taught at Amazon. Unlike traditional approaches that integrate specification and proof directly into programs, this course introduces Dafny as a proof assistant separate from its role as a programming language. The curriculum is divided into three parts.\n\nPart 1 focuses on Dafny as a programming language, familiarizing students with its syntax, semantics, and tools without involving verification. Part 2 shifts to Dafny as a proof assistant, covering the language of specifications, defining types and functions, and exploring proof techniques. This part emphasizes both intuitive \"proof by explaining\" and rigorous \"proof by convincing\" using natural deduction. Part 3 integrates programming and verification, starting with functional programs (extrinsic and intrinsic verification) and progressing to imperative and object-oriented programs. The course advocates for extrinsic verification initially to promote proof robustness and highlights techniques such as functional modeling for imperative programs and careful API design with suitable ghost representations for object-oriented programs.\n\nThe course aims to provide a complementary perspective to traditional program verification approaches, particularly for addressing challenges when Dafny's automation falls short. It equips learners with the ability to write detailed, formal proofs, allowing them to convincingly verify program correctness, even in complex scenarios. The course was initially designed to supplement \"Program Proofs\" and has evolved into a comprehensive introduction to program verification and an advanced training tool for experts.\n",
    "chinese_title": "亚马逊Dafny教学程序验证 (2023)",
    "chinese_summary": "本文介绍了一个在亚马逊开发和教授的使用Dafny的程序验证课程。与将规范和证明直接集成到程序中的传统方法不同，本课程将Dafny作为一种独立于其编程语言角色的证明助手来介绍。课程分为三个部分。\n\n第一部分侧重于Dafny作为一种编程语言，使学生熟悉其语法、语义和工具，而不涉及验证。第二部分转向Dafny作为一种证明助手，涵盖规范语言，定义类型和函数，并探索证明技巧。本部分强调使用自然演绎进行直观的“解释性证明”和严格的“说服性证明”。第三部分整合了编程和验证，从函数式程序（外在和内在验证）开始，逐步过渡到命令式和面向对象程序。该课程提倡最初采用外在验证，以提高证明的鲁棒性，并强调诸如用于命令式程序的功能建模以及用于面向对象程序的带有适当幽灵表示的谨慎 API 设计等技术。\n\n本课程旨在为传统的程序验证方法提供一种补充视角，特别是在解决Dafny自动化不足时所面临的挑战。它使学习者能够编写详细、正式的证明，从而即使在复杂的场景中也能令人信服地验证程序的正确性。该课程最初旨在补充“程序证明”，现已发展成为对程序验证的全面介绍以及专家的高级培训工具。"
  },
  {
    "id": "44157406",
    "title": "ThorVG: Super Lightweight Vector Graphics Engine",
    "url": "https://www.thorvg.org/about",
    "summary": "ThorVG is an open-source, lightweight vector graphics engine designed for creating scenes and animations. It prioritizes efficiency and ease of use, supporting various primitives like lines, shapes, fills, strokes, text, images (SVG, JPG, PNG, etc.), effects (blur, shadow, tint), and Lottie animations.\n\nIt supports multiple platforms including Linux, macOS, Windows, Tizen, iOS, Android, Web, Flutter, and more. ThorVG utilizes a modular design, allowing for selective builds and optimal size. It supports several render backends: CPU/SIMD, OpenGL/ES, WebGL, and WebGPU, ensuring adaptability across systems.\n\nThreading is incorporated for efficient scene processing using a task scheduler with thread pools. SVG rendering is facilitated through a dedicated interpreter adhering to the SVG Tiny Specification. Lottie animation support is a key feature, with ThorVG powering Lottie animations in various applications.\n\nThe ThorVG viewer is a resource verification tool that allows real-time editing within a web browser, protecting resource copyright. The engine is used in practice by applications like Canva (iOS), dotLottie player by LottieFiles, Flux Audio, Godot, Lottie Creator, LVGL and Tizen. The project is driven by contributors and supported by sponsors, and encourages further financial support to enhance its continued development.\n",
    "chinese_title": "ThorVG: 超轻量级矢量图形引擎",
    "chinese_summary": "ThorVG is an open-source, lightweight vector graphics engine designed for creating scenes and animations. It prioritizes efficiency and ease of use, supporting various primitives like lines, shapes, fills, strokes, text, images (SVG, JPG, PNG, etc.), effects (blur, shadow, tint), and Lottie animations.\n\nIt supports multiple platforms including Linux, macOS, Windows, Tizen, iOS, Android, Web, Flutter, and more. ThorVG utilizes a modular design, allowing for selective builds and optimal size. It supports several render backends: CPU/SIMD, OpenGL/ES, WebGL, and WebGPU, ensuring adaptability across systems.\n\nThreading is incorporated for efficient scene processing using a task scheduler with thread pools. SVG rendering is facilitated through a dedicated interpreter adhering to the SVG Tiny Specification. Lottie animation support is a key feature, with ThorVG powering Lottie animations in various applications.\n\nThe ThorVG viewer is a resource verification tool that allows real-time editing within a web browser, protecting resource copyright. The engine is used in practice by applications like Canva (iOS), dotLottie player by LottieFiles, Flux Audio, Godot, Lottie Creator, LVGL and Tizen. The project is driven by contributors and supported by sponsors, and encourages further financial support to enhance its continued development.\n"
  },
  {
    "id": "44142519",
    "title": "Magic Ink: Information Software and the Graphical Interface",
    "url": "https://worrydream.com/MagicInk/",
    "summary": "生成摘要时出错",
    "chinese_title": "Magic Ink: Information Software and the Graphical Interface",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44162363",
    "title": "Show HN: I build one absurd web project every month",
    "url": "https://absurd.website",
    "summary": "ABSURD.website is a project showcasing a new, intentionally absurd product or service each month. The creator describes it as \"art.\" Recent projects include:\n\n*   **Add Luck to Your e-Store:** A waving cat graphic for eCommerce sites, aiming to increase sales through \"marketing now.\"\n*   **Microtasks for Meatbags:** Renting out human \"souls\" to AI.\n*   **OPERATION D-DAY: ONE SECOND OF WAR:** A first-person shooter game where every second is crucial.\n*   **LingoPrio:** Claiming to quickly teach 5 languages by focusing on pre-existing knowledge.\n*   **Artist's Death Effect Database:** Tracking the surge in value of an artist's work after their death.\n*   **Sexy Math:** Making learning math sexy.\n*   **ChillyParent:** One-click parenting service.\n*   **Easy Pet Drop Box:** A place to drop off your pets.\n*   **Influencer Overnight:** Promising to turn a follower into an influencer with 100k followers.\n*   **Stealing From Dreams:** Recreating artwork based on user descriptions.\n*   **A Guide For Aliens To Live On Earth:** A tourist-style guidebook for extraterrestrial visitors.\n*   **Puzzle Solvers Agency:** A service that solves puzzles and games for customers.\n\nOther absurd concepts range from toilet water perfume and invisible lingerie to a slow delivery service and offsetting CO2 emissions by buying the creator a Tesla. The website also includes projects like a dating site for eyes, a '90s-inspired web design studio, and a \"Buy Nothing Store.\"\n\nVisitors can subscribe to a mailing list for monthly updates on new absurd projects.\n",
    "chinese_title": "Show HN: 我每月做一个荒诞的网页项目",
    "chinese_summary": "ABSURD.website is a project showcasing a new, intentionally absurd product or service each month. The creator describes it as \"art.\" Recent projects include:\n\n*   **Add Luck to Your e-Store:** A waving cat graphic for eCommerce sites, aiming to increase sales through \"marketing now.\"\n*   **Microtasks for Meatbags:** Renting out human \"souls\" to AI.\n*   **OPERATION D-DAY: ONE SECOND OF WAR:** A first-person shooter game where every second is crucial.\n*   **LingoPrio:** Claiming to quickly teach 5 languages by focusing on pre-existing knowledge.\n*   **Artist's Death Effect Database:** Tracking the surge in value of an artist's work after their death.\n*   **Sexy Math:** Making learning math sexy.\n*   **ChillyParent:** One-click parenting service.\n*   **Easy Pet Drop Box:** A place to drop off your pets.\n*   **Influencer Overnight:** Promising to turn a follower into an influencer with 100k followers.\n*   **Stealing From Dreams:** Recreating artwork based on user descriptions.\n*   **A Guide For Aliens To Live On Earth:** A tourist-style guidebook for extraterrestrial visitors.\n*   **Puzzle Solvers Agency:** A service that solves puzzles and games for customers.\n\nOther absurd concepts range from toilet water perfume and invisible lingerie to a slow delivery service and offsetting CO2 emissions by buying the creator a Tesla. The website also includes projects like a dating site for eyes, a '90s-inspired web design studio, and a \"Buy Nothing Store.\"\n\nVisitors can subscribe to a mailing list for monthly updates on new absurd projects.\n"
  },
  {
    "id": "44163877",
    "title": "Largest punk archive to find new home at MTSU's Center for Popular Music",
    "url": "https://mtsunews.com/worlds-largest-punk-archive-moves-to-center-for-popular-music/",
    "summary": "Middle Tennessee State University's Center for Popular Music (CPM) is set to become the world's leading hub for punk research with the acquisition of the Maximum Rocknroll (MRR) archive, the largest punk collection in existence. The archive, containing approximately 60,000 vinyl records, photos, zines, and documents, is being relocated from California to Murfreesboro, Tennessee.\n\nThe MRR archive, considered the definitive voice of the punk underground for decades, reflects the global breadth of the punk movement, encompassing items from over 100 countries and various subgenres. CPM Director Greg Reish emphasizes the collection's unique and rare nature, anticipating the CPM will be the new epicenter of punk-related research.\n\nCPM librarian Logan Dalton expresses personal and professional excitement about the acquisition, highlighting the collection's potential to attract new researchers and spotlight lesser-known voices within punk culture. Dalton envisions utilizing the archive for outreach events like listening parties and zine workshops.\n\nThe CPM has already prepared space for the collection, prioritizing its cataloging for online access. The transfer is expected to be completed in June, and the CPM plans to host public programming and panel discussions to amplify the archive's impact, ensuring the preservation and future accessibility of punk history.\n",
    "chinese_title": "规模最大的朋克音乐档案将落户中田纳西州立大学流行音乐中心",
    "chinese_summary": "中田纳西州立大学流行音乐中心将获得Maximum Rocknroll档案，成为世界领先的朋克研究中心。该档案是现存最大的朋克收藏，包含约6万张黑胶唱片、照片、杂志和文献，将从加利福尼亚州迁至田纳西州墨菲斯堡。"
  },
  {
    "id": "44168184",
    "title": "Wendelstein 7-X sets new fusion record",
    "url": "https://www.heise.de/en/news/Wendelstein-7-X-sets-new-fusion-record-10422955.html",
    "summary": "**Summary:**\n\nThe Wendelstein 7-X (W7-X) stellarator fusion device in Greifswald, Germany, has achieved a new record for energy confinement time in a stellarator-type fusion reactor. In its latest experimental campaign, W7-X successfully maintained a plasma temperature of 130 million degrees Celsius for an impressive 8 minutes while achieving a plasma density of about 10^20 particles per cubic meter.\n\nThis surpasses its previous records, demonstrating the improved performance of the machine and validating the stellarator design as a viable approach to fusion energy. The key to this success lies in optimized heating systems and advanced plasma control techniques.\n\nThe longer energy confinement time is a critical step towards demonstrating the suitability of stellarators for sustained fusion reactions. While still a research facility, the progress at W7-X is significant because the stellarator design inherently offers advantages in steady-state operation compared to tokamak designs (the other leading fusion reactor type). Specifically, stellarators are designed to operate in a steady state without needing external current drive, which is essential for a commercially viable fusion power plant.\n\nResearchers are continuing to refine the technology at W7-X, focusing on increasing plasma density and confinement time further, paving the way for future fusion power plants. The results from W7-X provide crucial data and insights that will contribute to the global fusion research effort.\n",
    "chinese_title": "文德尔施泰因7-X创下新的聚变记录",
    "chinese_summary": "**概要：**\n\n德国格赖夫斯瓦尔德的Wendelstein 7-X (W7-X) 仿星器聚变装置在仿星器型聚变反应堆中实现了新的能量约束时间记录。 在其最新的实验活动中，W7-X 成功地将等离子体温度维持在 1.3 亿摄氏度，持续了令人印象深刻的 8 分钟，同时实现了约 10^20 个粒子/立方米的等离子体密度。\n\n这超过了其之前的记录，表明该机器的性能得到了改善，并验证了仿星器设计作为聚变能源可行方法。 这一成功的关键在于优化的加热系统和先进的等离子体控制技术。\n\n更长的能量约束时间是证明仿星器适用于持续聚变反应的关键一步。 虽然仍然是一个研究设施，但 W7-X 的进展意义重大，因为与托卡马克设计（另一种主要的聚变反应堆类型）相比，仿星器设计本身在稳态运行方面具有优势。 具体而言，仿星器旨在在不需要外部电流驱动的情况下以稳态运行，这对于商业上可行的聚变发电厂至关重要。\n\n研究人员正在继续完善 W7-X 的技术，重点是进一步提高等离子体密度和约束时间，为未来的聚变发电厂铺平道路。 来自 W7-X 的结果提供了关键数据和见解，将有助于全球聚变研究工作。"
  },
  {
    "id": "44169461",
    "title": "Uber's new shuttles look suspiciously familiar to anyone who's taken a bus",
    "url": "https://grist.org/transportation/uber-shared-route-buses/",
    "summary": "Uber's new \"Route Share\" shuttle service, which utilizes fixed routes and stops, is drawing criticism for essentially reinventing the bus without addressing the inherent problems of ride-sharing services. The article argues that this \"next-gen bus\" might be a worse alternative to public transit, despite Uber's claims of affordability and reduced congestion.\n\nCritics point out that ride-sharing services, including pooled options, still contribute significantly to carbon emissions due to \"deadheading\" miles. Furthermore, Uber's service poses a threat to already struggling public transit systems in cities like Philadelphia and Dallas, which face defunding and service cuts. The article questions Uber's claim of complementing public transport, citing a study that found ride-hailing often replaces more sustainable options like walking, cycling, and public transit.\n\nThe article highlights that Uber's Route Share might worsen congestion in cities like New York, as it adds more vehicles to crowded streets. An example is given where a subway provides a faster and cheaper alternative to the proposed Uber route. Ultimately, the article suggests that Uber's new service could decrease transit efficiency by adding more vehicles to existing routes, all while lacking the public accountability of established transit agencies.\n",
    "chinese_title": "Uber's new shuttles look suspiciously familiar to anyone who's taken a bus",
    "chinese_summary": "Uber's new \"Route Share\" shuttle service, which utilizes fixed routes and stops, is drawing criticism for essentially reinventing the bus without addressing the inherent problems of ride-sharing services. The article argues that this \"next-gen bus\" might be a worse alternative to public transit, despite Uber's claims of affordability and reduced congestion.\n\nCritics point out that ride-sharing services, including pooled options, still contribute significantly to carbon emissions due to \"deadheading\" miles. Furthermore, Uber's service poses a threat to already struggling public transit systems in cities like Philadelphia and Dallas, which face defunding and service cuts. The article questions Uber's claim of complementing public transport, citing a study that found ride-hailing often replaces more sustainable options like walking, cycling, and public transit.\n\nThe article highlights that Uber's Route Share might worsen congestion in cities like New York, as it adds more vehicles to crowded streets. An example is given where a subway provides a faster and cheaper alternative to the proposed Uber route. Ultimately, the article suggests that Uber's new service could decrease transit efficiency by adding more vehicles to existing routes, all while lacking the public accountability of established transit agencies.\n"
  },
  {
    "id": "44169759",
    "title": "Builder.ai Collapses: $1.5B 'AI' Startup Exposed as 'Indians'",
    "url": "https://www.ibtimes.co.uk/builderai-collapses-15bn-ai-startup-exposed-actually-indians-pretending-bots-1734784",
    "summary": "生成摘要时出错",
    "chinese_title": "Builder.ai崩盘：15亿美元“人工智能”初创公司被揭露为“印度人”",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44169069",
    "title": "Illicit crypto-miners pouncing on lazy DevOps configs leaving clouds vulnerable",
    "url": "https://www.theregister.com/2025/06/03/illicit_miners_hashicorp_tools/",
    "summary": "A new cryptomining campaign, dubbed JINX-0132, targets vulnerable cloud environments through misconfigured DevOps tools, potentially affecting up to 25% of cloud users. Wiz Threat Research identified the campaign, highlighting that 5% of cloud environments expose these DevOps tools to the internet, and 30% of those exposed are misconfigured.\n\nJINX-0132 exploits vulnerabilities in HashiCorp's Nomad and Consul, Docker Engine API, and Gitea, to deploy XMRig mining software. Default settings in Nomad lack security, allowing unauthorized job creation and execution. Similarly, fresh Consul installations lack access control lists, enabling remote code execution. Exposing the Docker API publicly grants attackers root-level access for container creation and filesystem mounting.  For Gitea, the attackers may exploit older versions, manipulate default secure settings, or reset the admin credentials to install mining software.\n\nThe article stresses the importance of securing these tools: enabling security features in Nomad (access control lists), disabling script checks and restricting the HTTP API in Consul, avoiding exposing the Docker API to the internet, and keeping Gitea updated and properly configured. Failure to do so leaves cloud computing resources vulnerable to cryptojacking and other malicious activities.\n",
    "chinese_title": "非法加密货币矿工利用疏忽的DevOps配置，导致云环境变得脆弱",
    "chinese_summary": "一项名为JINX-0132的新型加密货币挖矿活动，通过配置错误的DevOps工具，瞄准脆弱的云环境，可能影响高达25%的云用户。Wiz Threat Research识别了该活动，强调了5%的云环境将这些DevOps工具暴露于互联网，而其中30%配置错误。\n\nJINX-0132利用HashiCorp的Nomad和Consul、Docker Engine API以及Gitea中的漏洞，来部署XMRig挖矿软件。Nomad的默认设置缺乏安全性，允许未经授权的作业创建和执行。同样，全新安装的Consul缺乏访问控制列表，从而实现远程代码执行。将Docker API公开暴露会授予攻击者root级别的访问权限，用于容器创建和文件系统挂载。对于Gitea，攻击者可能利用较旧版本，操纵默认安全设置，或重置管理员凭据以安装挖矿软件。\n\n文章强调了保护这些工具的重要性：在Nomad中启用安全功能（访问控制列表），禁用Consul中的脚本检查并限制HTTP API，避免将Docker API暴露于互联网，并保持Gitea更新并正确配置。否则，云算力资源将容易受到加密劫持和其他恶意活动的影响。"
  },
  {
    "id": "44163428",
    "title": "Japanese scientists develop artificial blood compatible with all blood types",
    "url": "https://www.tokyoweekender.com/entertainment/tech-trends/japanese-scientists-develop-artificial-blood/",
    "summary": "Japanese scientists at Nara Medical University, led by Hiromi Sakai, have developed artificial blood compatible with all blood types. This innovation aims to address the challenges of maintaining adequate blood supplies, particularly in low- and middle-income countries where the demand for universal donor O-negative blood often exceeds supply.\n\nThe artificial blood is created by extracting hemoglobin from expired donor blood and encasing it in a protective shell. This process creates stable, virus-free artificial red blood cells that eliminate the need for blood type compatibility testing. A major advantage is its extended shelf life: up to two years at room temperature and five years refrigerated, significantly longer than the 42-day limit for donated red blood cells.\n\nSmall-scale human trials began in 2022 with healthy male volunteers receiving intravenous injections of the artificial blood. Initial results showed mild side effects with no significant changes in vital signs. Following this success, the team started administering larger doses in March and aims to test its efficacy and safety, hoping to make it practically available by around 2030.\n\nProfessor Teruyuki Komatsu of Chuo University is also developing artificial oxygen carriers using albumin-encased hemoglobin, which has shown promise in animal studies for stabilizing blood pressure and treating conditions like hemorrhage and stroke, paving the way for human trials.\n",
    "chinese_title": "日本科学家开发出与所有血型兼容的人造血液",
    "chinese_summary": "日本奈良医科大学的酒井宏水领导的科学家团队研发出与所有血型相容的人造血液。 这项创新旨在解决维持充足血液供应的挑战，尤其是在中低收入国家，对通用供血者O型阴性血液的需求常常超过供应。\n\n这种人造血液是通过从过期捐献血液中提取血红蛋白并将其包裹在保护壳中制成的。 这个过程创造了稳定的、无病毒的人造红细胞，消除了血型相容性测试的需要。 一个主要的优势是其更长的保质期：在室温下长达两年，冷藏则长达五年，明显长于捐献红细胞的42天限制。\n\n2022年开始了小规模的人体试验，健康的男性志愿者接受了人造血液的静脉注射。 初步结果显示有轻微的副作用，生命体征没有明显变化。 在此成功之后，该团队于三月份开始施用更大的剂量，旨在测试其有效性和安全性，希望在2030年左右使其能够实际应用。\n\n中央大学的小松辉幸教授也在开发使用白蛋白包裹血红蛋白的人造氧气载体，该载体在动物研究中显示出稳定血压以及治疗出血和中风等疾病的潜力，为人体试验铺平了道路。"
  },
  {
    "id": "44160012",
    "title": "Younger generations less likely to have dementia, study suggests",
    "url": "https://www.theguardian.com/society/2025/jun/02/younger-generations-less-likely-dementia-study",
    "summary": "生成摘要时出错",
    "chinese_title": "Younger generations less likely to have dementia, study suggests",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44155746",
    "title": "How to post when no one is reading",
    "url": "https://www.jeetmehta.com/posts/thrive-in-obscurity",
    "summary": "This article addresses the common struggle of creating content when it feels like no one is watching. It acknowledges the years of \"silent\" work most successful creators endure, highlighting that immediate fame and praise are unrealistic expectations that can lead to burnout. The key takeaway is to prioritize the joy of creation itself, rather than focusing solely on external validation.\n\nThe author suggests several frameworks to sustain motivation during this period of obscurity:\n\n1.  **\"Do things you like, and sometimes the world will agree.\"** Inspired by Mike Posner's experience, this emphasizes creating content that genuinely excites you, as this intrinsic motivation will be more sustainable.\n\n2.  **\"Push yourself out.\"** Create what you like. This principle states that instead of trying to determine what your audience likes, you should instead just create what you like. When you have this mindset, you are more likely to push through plateaus. \n\n3.  **\"Build your Binge Bank.\"** View initial content as an investment for future fans. This \"Binge Bank\" is the archive that dedicated followers will explore once you gain an audience, increasing the value of even your earliest, least-viewed work.\n\nThe article concludes with an encouragement to keep creating, framing the lack of immediate audience as a temporary stage in the journey to success and impact.\n",
    "chinese_title": "无人问津时如何发帖",
    "chinese_summary": "当无人问津时如何创作内容：专注于创作本身的乐趣\n\n本文探讨了在感觉无人关注时创作内容的常见困境。它承认了大多数成功创作者所经历的多年“默默无闻”的努力，并强调立即成名和获得赞扬是不切实际的期望，可能会导致倦怠。 关键在于优先考虑创作本身的乐趣，而不是仅仅关注外部认可。\n\n作者提出了几个框架来维持这段默默无闻时期的动力：\n\n1.  **“做你喜欢的事，有时世界会认可。”** 受 Mike Posner 经历的启发，这强调了创作真正让你兴奋的内容，因为这种内在动力将更具有可持续性。\n\n2.  **“展现自我。”** 创作你喜欢的东西。 这个原则表明，与其试图确定你的观众喜欢什么，不如仅仅创作你喜欢的东西。 当你拥有这种心态时，你更有可能突破瓶颈。\n\n3.  **“建立你的‘剧集银行’。”** 将初始内容视为对未来粉丝的投资。 这个“剧集银行”是忠实粉丝在你获得受众后会探索的档案，增加了你最早、观看次数最少作品的价值。\n\n文章最后鼓励大家继续创作，并将缺乏即时受众视为通往成功和影响力的旅程中的一个暂时的阶段。"
  },
  {
    "id": "44153732",
    "title": "The rise of judgement over technical skill",
    "url": "https://notsocommonthoughts.com/blog/ai-and-judgement/",
    "summary": "生成摘要时出错",
    "chinese_title": "The rise of judgement over technical skill",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44168256",
    "title": "There should be no Computer Art (1971)",
    "url": "https://dam.org/museum/essays_ui/essays/there-should-be-no-computer-art/",
    "summary": "生成摘要时出错",
    "chinese_title": "不应有电脑艺术（1971）",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44167903",
    "title": "The Creepy, Surprisingly Routine Business of Animal Cloning",
    "url": "https://www.theatlantic.com/magazine/archive/2025/07/animal-cloning-industry/682892/",
    "summary": "生成摘要时出错",
    "chinese_title": "The Creepy, Surprisingly Routine Business of Animal Cloning",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44160073",
    "title": "Show HN: Penny-1.7B Irish Penny Journal style transfer",
    "url": "https://huggingface.co/dleemiller/Penny-1.7B",
    "summary": "生成摘要时出错",
    "chinese_title": "Show HN: Penny-1.7B Irish Penny Journal style transfer",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44127653",
    "title": "Show HN: Onlook – Open-source, visual-first Cursor for designers",
    "url": "https://github.com/onlook-dev/onlook",
    "summary": "Onlook is an open-source, visual-first code editor aimed at designers and developers for creating websites and prototypes using Next.js and TailwindCSS. It offers a visual interface for editing code directly in the browser's DOM, providing a real-time design and coding experience. It's positioned as an alternative to tools like Bolt.new and Webflow.\n\nThe web version of Onlook is currently under development and actively seeking contributors. Features include creating Next.js apps from text, images, pre-built templates, Figma imports, or GitHub repos; visually editing apps with a Figma-like UI; real-time previewing; and managing brand assets and tokens. It also provides development tools like a real-time code editor, checkpoints, CLI commands, an app marketplace, and local code editing. Deployment features include sharable links, custom domains, and team collaboration tools.\n\nThe desktop version, \"Onlook Desktop,\" is available for those seeking a downloadable Electron app, while the focus shifts to the web-based version. Onlook works by loading code into a web container, displaying the preview in an iframe, and instrumenting the code to map elements to their corresponding code locations. Edits are reflected in both the iframe and the code. The project is built with technologies like Next.js, Supabase, and TailwindCSS, and welcomes contributions via forks and pull requests. Documentation and contribution guidelines are available on the Onlook website.\n",
    "chinese_title": "展示一下：Onlook – 面向设计师的开源、可视化光标",
    "chinese_summary": "Onlook：一款面向设计师和开发者的开源、可视化代码编辑器，用于使用 Next.js 和 TailwindCSS 创建网站和原型。它提供了一个可视化界面，可以直接在浏览器的 DOM 中编辑代码，从而提供实时的设计和编码体验。它被定位为 Bolt.new 和 Webflow 等工具的替代品。\n\nOnlook 的 Web 版本目前正在开发中，并积极寻求贡献者。其功能包括：从文本、图像、预构建模板、Figma 导入或 GitHub 存储库创建 Next.js 应用程序；使用类似 Figma 的 UI 可视化编辑应用程序；实时预览；以及管理品牌资产和令牌。它还提供开发工具，例如实时代码编辑器、检查点、CLI 命令、应用程序市场和本地代码编辑。部署功能包括可共享链接、自定义域名和团队协作工具。\n\n桌面版本“Onlook Desktop”适用于寻求可下载 Electron 应用程序的用户，但重点已转移到基于 Web 的版本。Onlook 的工作原理是将代码加载到 Web 容器中，在 iframe 中显示预览，并检测代码以将元素映射到其相应的代码位置。编辑会同时反映在 iframe 和代码中。该项目使用 Next.js、Supabase 和 TailwindCSS 等技术构建，并欢迎通过 fork 和 pull request 进行贡献。文档和贡献指南可在 Onlook 网站上找到。"
  },
  {
    "id": "44162327",
    "title": "Typing 118 WPM broke my brain in the right ways",
    "url": "http://balaji-amg.surge.sh/blog/typing-118-wpm-brain-rewiring",
    "summary": "This article details the author's year-long journey to achieving 118 WPM typing speed and how it unexpectedly improved their mental clarity and productivity as a developer. Starting at 60 WPM and frustrated with slow typing speeds for coding tasks, the author began a daily ritual of 5-minute typing sessions to reset their brain and improve focus.\n\nThey emphasize that accuracy is key, arguing that slowing down to ensure correct keystrokes ultimately leads to faster speeds. The author also advocates for finding a personal typing style that works, even if it deviates from traditional \"proper\" form. They describe their style as \"anarchist typing,\" prioritizing efficiency over rigid technique.\n\nTyping is presented as a tool for managing mental fatigue and stress. The author uses typing practice as a brain break, mood booster, and a way to overcome mental blocks. They note inevitable setbacks and periods of slower speeds, framing them as learning opportunities leading to further improvement.\n\nUltimately, the author believes that mastering typing has improved their focus, discipline, and overall ability to \"just do the thing.\" They highlight tangible benefits like faster coding, better documentation, and less frustration with repetitive typing tasks, concluding that this seemingly insignificant habit has significantly enhanced their development skills and cognitive function.\n",
    "chinese_title": "以每分钟118字的速度打字，彻底重塑了我的思维。",
    "chinese_summary": "本文详细介绍了作者历时一年达到每分钟118个单词的打字速度的历程，以及它如何意外地提高了作者作为开发者的思维清晰度和工作效率。作者最初的打字速度为每分钟60个单词，并对编写代码时缓慢的打字速度感到沮丧，于是开始每天进行5分钟的打字练习，以重置大脑并提高注意力。\n\n他们强调准确性是关键，认为放慢速度以确保正确的击键最终会带来更快的速度。作者还提倡找到一种适合自己的打字风格，即使它偏离了传统的“正确”姿势。他们将自己的风格描述为“无政府主义打字”，优先考虑效率而非僵化的技术。\n\n文章将打字视为管理精神疲劳和压力的工具。作者将打字练习用作大脑休息、情绪助推器和克服思维障碍的方式。他们注意到不可避免的挫折和速度较慢的时期，并将它们视为通往进一步改进的学习机会。\n\n最终，作者认为掌握打字提高了他们的专注力、自律性和“Just do the thing（只管去做）”的整体能力。他们强调了切实的好处，例如更快的编码速度、更好的文档编写以及减少了重复打字任务带来的挫败感，并得出结论，这个看似微不足道的习惯显著提高了他们的开发技能和认知功能。"
  },
  {
    "id": "44154032",
    "title": "The Visual World of 'Samurai Jack'",
    "url": "https://animationobsessive.substack.com/p/the-visual-world-of-samurai-jack",
    "summary": "生成摘要时出错",
    "chinese_title": "武士杰克的视觉世界",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44156935",
    "title": "If you are useful, it doesn't mean you are valued",
    "url": "https://betterthanrandom.substack.com/p/if-you-are-useful-it-doesnt-mean",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "有用不代表有价值",
    "chinese_summary": "Unable to access the article link.\n"
  },
  {
    "id": "44170708",
    "title": "Mario Kart designers had to rethink everything to make it open world",
    "url": "https://www.theverge.com/interview/678097/mario-kart-world-nintendo-switch-2-interview-kosuke-yabuki",
    "summary": "生成摘要时出错",
    "chinese_title": "Mario Kart designers had to rethink everything to make it open world",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44155761",
    "title": "Is “The Phoenician Scheme” Wes Anderson's Most Emotional Film?",
    "url": "https://www.newyorker.com/magazine/2025/06/09/the-phoenician-scheme-movie-review",
    "summary": "生成摘要时出错",
    "chinese_title": "Is “The Phoenician Scheme” Wes Anderson's Most Emotional Film?",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44125334",
    "title": "EasyTier – P2P mesh VPN written in Rust using Tokio",
    "url": "https://easytier.cn/en/",
    "summary": "生成摘要时出错",
    "chinese_title": "EasyTier – 使用 Tokio 以 Rust 编写的 P2P 网状 VPN",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44125793",
    "title": "HeidiSQL Available Also for Linux",
    "url": "https://www.heidisql.com/forum.php?t=44068",
    "summary": "This article announces the pre-release of HeidiSQL 12.10.1.133 for Linux. This marks the first tagged Linux version, downloadable from the HeidiSQL website. Key features include SSH tunnel support (using external ssh command), translation support for 35 languages, icons on the status bar, bracket highlighting in SQL editors, working grid cell editors, automatic tab restore, and functional table/view/routine/trigger/event editors.\n\nKnown issues include missing support for MS SQL and Interbase/Firebird, crashes in grid cell editors, lack of a .rpm package, and no word wrap in SQL editors.\n\nUsers are discussing the new Linux build, with some sharing experiences on Arch-based distributions using the AUR package. There's a discussion on creating .rpm packages and Flatpaks for broader distribution support, with suggestions for a .tgz file as a quick solution. One user reported a potential bug related to the libmariadbd.so library appearing in the connection library dropdown.\n\nOther topics include SSH tunnel functionality using `/usr/bin/ssh` or PuTTY's `plink`, and the absence of themes found in the Windows version (the Linux version adapts to the system's light/dark mode). Users can adjust SQL editor styling in Preferences > SQL and report bugs on the HeidiSQL bug tracker.\n",
    "chinese_title": "HeidiSQL 也可在 Linux 上使用",
    "chinese_summary": "HeidiSQL 12.10.1.133 Linux 预发布版发布公告。这是首个带有标签的 Linux 版本，可从 HeidiSQL 网站下载。主要功能包括 SSH 隧道支持（使用外部 ssh 命令）、35 种语言的翻译支持、状态栏图标、SQL 编辑器中的括号高亮显示、可用的网格单元格编辑器、自动标签页恢复以及功能完善的表/视图/例程/触发器/事件编辑器。\n\n已知问题包括缺少对 MS SQL 和 Interbase/Firebird 的支持、网格单元格编辑器中的崩溃、缺少 .rpm 包以及 SQL 编辑器中没有自动换行。\n\n用户正在讨论新的 Linux 构建版本，一些用户分享了在使用 AUR 包的基于 Arch 的发行版上的经验。 讨论正在进行关于创建 .rpm 包和 Flatpak 以实现更广泛的发行支持，并建议使用 .tgz 文件作为快速解决方案。 一位用户报告了一个与 libmariadbd.so 库出现在连接库下拉列表中相关的潜在错误。\n\n其他主题包括使用 `/usr/bin/ssh` 或 PuTTY 的 `plink` 的 SSH 隧道功能，以及 Windows 版本中不存在的主题（Linux 版本适应系统的浅色/深色模式）。 用户可以在“首选项”>“SQL”中调整 SQL 编辑器样式，并在 HeidiSQL 错误跟踪器上报告错误。"
  },
  {
    "id": "44160358",
    "title": "Arcol simplifies building design with browser-based modeling",
    "url": "https://www.arcol.io/",
    "summary": "Arcol offers a browser-based building design platform that streamlines collaboration and improves efficiency for architecture, engineering, and construction (AEC) teams. By enabling real-time collaboration among stakeholders, Arcol aims to eliminate data silos, reduce email communication, and facilitate better, faster decision-making.\n\nThe platform boasts features like complex geometry modeling, real-time metric tracking for data-driven decisions, automated documentation, and seamless integration of data and documentation. Arcol facilitates easier communication of design intent and management of complex data, particularly during the feasibility phase. Customer testimonials highlight Arcol's positive impact on project quality, efficiency, and client communication.\n\nArcol caters to various roles including architects, designers, developers, general contractors, and building owners, offering specialized features to address their specific needs. These include tools to remove friction from the design process, easy cost and feasibility comparisons for developers, readily accessible cost comparisons for contractors, and real-time design and metric evolution for owners. The platform aims to enhance project momentum by promoting early and frequent collaboration.\n",
    "chinese_title": "Arcol 通过浏览器建模简化建筑设计",
    "chinese_summary": "Arcol提供一个基于浏览器的建筑设计平台，该平台简化了建筑、工程和施工（AEC）团队的协作并提高了效率。通过实现利益相关者之间的实时协作，Arcol旨在消除数据孤岛，减少电子邮件沟通，并促进更好、更快的决策。\n\n该平台拥有复杂几何建模、用于数据驱动决策的实时指标跟踪、自动化文档编制以及数据和文档的无缝集成等功能。Arcol有助于更轻松地沟通设计意图和管理复杂数据，尤其是在可行性阶段。客户评价强调了Arcol对项目质量、效率和客户沟通的积极影响。\n\nArcol面向包括建筑师、设计师、开发商、总承包商和建筑业主在内的各种角色，提供专门的功能来满足他们的特定需求。这些功能包括消除设计过程中的摩擦的工具，便于开发商进行成本和可行性比较，便于承包商随时访问的成本比较，以及便于业主使用的实时设计和指标演变。该平台旨在通过促进早期和频繁的协作来增强项目势头。"
  },
  {
    "id": "44157077",
    "title": "ReasoningGym: Reasoning Environments for RL with Verifiable Rewards",
    "url": "https://arxiv.org/abs/2505.24760",
    "summary": "This arXiv article introduces \"Reasoning Gym\" (RG), a new library of reasoning environments designed for reinforcement learning (RL) with verifiable rewards. RG offers over 100 data generators and verifiers spanning diverse domains like algebra, arithmetic, computation, cognition, geometry, graph theory, logic, and games.\n\nThe key innovation of RG is its procedural generation capability, enabling the creation of virtually unlimited training data with adjustable complexity. This contrasts with existing reasoning datasets, which are typically static and fixed. The ability to dynamically adjust difficulty levels facilitates continuous evaluation of reasoning models.\n\nThe authors, Zafir Stojanovski et al., demonstrate the effectiveness of RG in both evaluating and training reasoning models using RL. The library aims to provide a robust platform for developing and testing AI agents capable of complex reasoning tasks.\n\nThe paper also provides a link to the codebase. The article is categorized under Machine Learning (cs.LG), Artificial Intelligence (cs.AI), and Computation and Language (cs.CL).\n",
    "chinese_title": "ReasoningGym：基于可验证奖励的RL推理环境",
    "chinese_summary": "本文介绍arXiv文章“推理健身房”(RG)，这是一个新的推理环境库，专为具有可验证奖励的强化学习(RL)而设计。 RG提供超过100个数据生成器和验证器，涵盖代数、算术、计算、认知、几何、图论、逻辑和游戏等多个领域。\n\nRG的关键创新在于其程序化生成能力，能够创建几乎无限的、具有可调节复杂性的训练数据。这与现有通常是静态和固定的推理数据集形成对比。动态调整难度等级的能力有助于对推理模型进行持续评估。\n\n作者Zafir Stojanovski等人证明了RG在评估和训练使用RL的推理模型方面的有效性。该库旨在为开发和测试能够执行复杂推理任务的AI代理提供一个强大的平台。\n\n该论文还提供了代码库的链接。这篇文章被归类为机器学习(cs.LG)、人工智能(cs.AI)和计算与语言(cs.CL)。"
  },
  {
    "id": "44150803",
    "title": "Root shell on a credit card terminal",
    "url": "https://stefan-gloor.ch/yomani-hack",
    "summary": "This article details a security researcher's exploration of a Worldline Yomani XR credit card terminal, a common model in Switzerland. Initially expecting robust security, the researcher discovered surprising vulnerabilities.\n\nAfter disassembling the terminal, the researcher found tamper protections like pressure-sensitive interconnects and zigzag copper traces, but managed to extract the firmware by desoldering the flash chip. The firmware was unencrypted, running a Linux system with an outdated kernel and vulnerable software components.\n\nShockingly, the researcher found a readily accessible root shell on the device via a serial console, enabled by default with no password for the root user. This serial port was accessible from the outside through a debug connector, allowing an attacker to gain root access in seconds without triggering tamper detection.\n\nHowever, further analysis revealed that the Linux system doesn't handle sensitive card data directly. A separate, \"secure\" processor (mp1) manages card transactions and screen display, while the Linux system (mp2) handles networking and updates. The secure processor boots from an encrypted and signed image loaded by a secure bootloader, seemingly mitigating the risk associated with the root shell.\n\nDespite the tamper protections and secure core, the author considers the easily accessible root shell a significant oversight and unnecessary attack surface. The root shell could be used to deploy malware to the Linux core. The researcher disclosed the vulnerability to the manufacturer, but publication was delayed. While the root login may have been fixed in more recent firmware versions, the researcher concludes that the exposed root shell doesn't pose as great a risk as initially feared due to the separation of sensitive data processing.\n",
    "chinese_title": "信用卡终端上的Root权限",
    "chinese_summary": "一名安全研究人员对瑞士常见的Worldline Yomani XR信用卡终端的探索，最初预期其安全性很高，但却发现了令人惊讶的漏洞。\n\n拆解终端后，研究人员发现了压敏互连和锯齿形铜线等防篡改保护措施，但还是通过拆焊闪存芯片提取了固件。固件未加密，运行着一个带有过时内核和存在漏洞的软件组件的Linux系统。\n\n令人震惊的是，研究人员发现设备上通过串行控制台可以轻松访问root shell，默认启用且root用户没有密码。这个串行端口可以通过调试连接器从外部访问，从而使攻击者可以在几秒钟内获得root权限，而不会触发篡改检测。\n\n然而，进一步的分析表明，Linux系统并不直接处理敏感的卡片数据。一个独立的“安全”处理器（mp1）管理卡片交易和屏幕显示，而Linux系统（mp2）处理网络和更新。安全处理器从由安全引导加载程序加载的加密签名映像启动，似乎减轻了与root shell相关的风险。\n\n尽管有防篡改保护措施和安全核心，作者仍认为易于访问的root shell是一个重大的疏忽和不必要的攻击面。root shell可用于将恶意软件部署到Linux核心。研究人员向制造商披露了该漏洞，但推迟了发布。虽然root登录可能已在更新的固件版本中修复，但研究人员得出结论，由于敏感数据处理的分离，暴露的root shell并没有最初担心的那么大的风险。"
  },
  {
    "id": "44131324",
    "title": "What works (and doesn't) selling formal methods",
    "url": "https://www.galois.com/articles/what-works-and-doesnt-selling-formal-methods",
    "summary": "生成摘要时出错",
    "chinese_title": "What works (and doesn't) selling formal methods",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44170624",
    "title": "Three Gorges Dam May Increase the Length of a Day by 0.06 Microseconds",
    "url": "https://www.thetravel.com/nasa-three-gorges-dam-china-disrupting-global-timekeeping/",
    "summary": "This article discusses NASA's findings regarding the impact of China's Three Gorges Dam on Earth's rotation and timekeeping. According to NASA, the dam's storage of approximately 10 trillion gallons of water can increase the length of a day by 0.06 microseconds, a seemingly small change but significant considering its implications.\n\nThe article also explores other factors influencing Earth's rotation, specifically highlighting climate change. NASA has linked melting ice, dwindling groundwater, and rising sea levels to changes in Earth's rotation. Research suggests days have become 1.33 milliseconds longer per 100 years since 2000, attributing this to the melting of glaciers in Antarctica and Greenland due to human-caused greenhouse gas emissions.\n\nFinally, the article showcases how the online community has reacted to NASA's findings. Reactions range from humorous to concerned, with users providing analogies to understand the effect of water displacement on Earth's rotation, likening it to a figure skater extending their arms or moving further out on a roundabout. Some users downplay the significance, while others express worry about the long-term consequences.\n",
    "chinese_title": "三峡大坝可能使一天的时间延长0.06微秒",
    "chinese_summary": "本文探讨了美国国家航空航天局(NASA)关于中国三峡大坝对地球自转和计时影响的研究结果。NASA指出，大坝蓄积的约10万亿加仑水量可能导致每天时长增加0.06微秒，这看似微小的变化，但考虑到其影响，意义重大。\n\n本文还探讨了影响地球自转的其他因素，特别强调了气候变化。NASA已将冰川融化、地下水减少和海平面上升与地球自转的变化联系起来。研究表明，自2000年以来，每天时长每100年延长1.33毫秒，这归因于人为温室气体排放导致南极洲和格陵兰冰川融化。\n\n最后，本文展示了网络社区对NASA研究结果的反应。这些反应从幽默到担忧不等，用户提供了各种类比来理解水 displacement 对地球自转的影响，例如将它比作花样滑冰运动员伸展手臂或在环形交叉路口上向外移动。一些用户淡化了其重要性，而另一些用户则对长期后果表示担忧。"
  },
  {
    "id": "44161894",
    "title": "CVE 2025 31200",
    "url": "https://blog.noahhw.dev/posts/cve-2025-31200/",
    "summary": "This article details the reverse engineering process of CVE-2025-31200, a memory corruption bug in Apple's CoreAudio, specifically within the `apac::hoa::CodecConfig::Deserialize` function of the AudioCodecs component. The author begins by noting the initial lack of public information on the bug, which was reportedly actively exploited.\n\nThe author uses tools like `ipsw` and `radiff2` to diff the patched and unpatched AudioCodecs binaries, identifying significant changes in the `Deserialize` method related to reading data from a bitstream to populate arrays. A key difference was identified: the patched version checks if `elementCount == 0` whereas the unpatched version does not. The bug lies in how the code sizes `outBuf`, which it sizes based on `elementCount`.\n\nThe author then outlines the reverse engineering of the audio codec in question. APAC stands for Apple Positional Audio Codec and HOA stands for Higher Order Ambisonics: a method of representing sound as a spatial sound-field centered around the listener's head.\n\nUltimately, the author hypothesized that the vulnerability stemmed from a sizing mismatch in subsequent buffers based on values from the `m_RemappingArray` (sized incorrectly in the vulnerable version) leading to a memory corruption vulnerability.\n",
    "chinese_title": "CVE-2025-31200",
    "chinese_summary": "This article details the reverse engineering process of CVE-2025-31200, a memory corruption bug in Apple's CoreAudio, specifically within the `apac::hoa::CodecConfig::Deserialize` function of the AudioCodecs component. The author begins by noting the initial lack of public information on the bug, which was reportedly actively exploited.\n\nThe author uses tools like `ipsw` and `radiff2` to diff the patched and unpatched AudioCodecs binaries, identifying significant changes in the `Deserialize` method related to reading data from a bitstream to populate arrays. A key difference was identified: the patched version checks if `elementCount == 0` whereas the unpatched version does not. The bug lies in how the code sizes `outBuf`, which it sizes based on `elementCount`.\n\nThe author then outlines the reverse engineering of the audio codec in question. APAC stands for Apple Positional Audio Codec and HOA stands for Higher Order Ambisonics: a method of representing sound as a spatial sound-field centered around the listener's head.\n\nUltimately, the author hypothesized that the vulnerability stemmed from a sizing mismatch in subsequent buffers based on values from the `m_RemappingArray` (sized incorrectly in the vulnerable version) leading to a memory corruption vulnerability.\n"
  },
  {
    "id": "44130915",
    "title": "The Atomic Airplane",
    "url": "https://whatisnuclear.com/the-story-of-the-atomic-airplane.html",
    "summary": "生成摘要时出错",
    "chinese_title": "The Atomic Airplane",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44168134",
    "title": "EU Commission refuses to disclose authors behind its mass surveillance proposal",
    "url": "https://old.reddit.com/r/europe/comments/1l2655n/the_eu_commission_refuses_to_disclose_the/",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "欧盟委员会拒绝透露其大规模监控提案的作者",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "44170828",
    "title": "Prepare for archival",
    "url": "https://github.com/GoogleContainerTools/kaniko/pull/3502",
    "summary": "This GitHub page documents the archival of the `GoogleContainerTools/kaniko` repository on June 3, 2025. The repository is now read-only. Pull request #3502, titled \"Prepare for archival,\" was merged to accomplish this. The pull request, initiated by `seenkey`, involved updating the README file to include an archive notice, addressing issues #3316 and #3348. `Plumpy` approved the changes before they were merged. The archival commit added the archive notice to the README. The conversation log shows the timeline of the archival process, including the request for review, approval, and final merging. The page also indicates an error occurred while loading, and encourages users to sign up or sign in to GitHub to participate in the conversation.\n",
    "chinese_title": "Prepare for archival",
    "chinese_summary": "This GitHub page documents the archival of the `GoogleContainerTools/kaniko` repository on June 3, 2025. The repository is now read-only. Pull request #3502, titled \"Prepare for archival,\" was merged to accomplish this. The pull request, initiated by `seenkey`, involved updating the README file to include an archive notice, addressing issues #3316 and #3348. `Plumpy` approved the changes before they were merged. The archival commit added the archive notice to the README. The conversation log shows the timeline of the archival process, including the request for review, approval, and final merging. The page also indicates an error occurred while loading, and encourages users to sign up or sign in to GitHub to participate in the conversation.\n"
  },
  {
    "id": "44142359",
    "title": "Writing your own C++ standard library part 2",
    "url": "https://nibblestew.blogspot.com/2025/05/writing-your-own-c-standard-library.html",
    "summary": "生成摘要时出错",
    "chinese_title": "Writing your own C++ standard library part 2",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44170706",
    "title": "out of cash - DOS point and click adventure game",
    "url": "https://github.com/warrior-rockk/out-of-cash",
    "summary": "生成摘要时出错",
    "chinese_title": "out of cash - DOS point and click adventure game",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44146339",
    "title": "Intelligent Agent Technology: Open Sesame! (1993)",
    "url": "https://blog.gingerbeardman.com/2025/05/31/intelligent-agent-technology-open-sesame-1993/",
    "summary": "This article recounts the author's long search for the name of a Macintosh application from the early 1990s that used machine learning to automate repetitive tasks. After years of unsuccessful Google searches and inquiries among Macintosh enthusiasts, the author finally found the answer using Gemini, an AI service. The application was called \"Open Sesame!\", described as the world's first intelligent software assistant for the Macintosh. It learned the user's patterns and offered to automate repetitive actions.\n\nThe author remembers seeing a demo of Open Sesame! in the early to mid-1990s, although the demo itself was flawed. The article highlights the irony of using modern AI in 2025 to discover an application built around machine learning principles back in 1993.\n\nThe article provides a download link to Open Sesame! 1.1 at Macintosh Garden and offers a list of \"Further Reading\" including several MacWorld publications from 1993-1996, offering reviews, advertisements, and news relating to the application. A NASA Spinoff publication from 1996 discussing \"Intelligent Agent Technology\" is also mentioned.\n",
    "chinese_title": "智能代理技术：芝麻开门！（1993）",
    "chinese_summary": "本文讲述了作者长期寻找一款上世纪90年代初的 Macintosh 应用程序名称的经历，该程序使用机器学习来自动化重复性任务。经过多年无果的 Google 搜索和 Macintosh 爱好者询问后，作者最终使用 AI 服务 Gemini 找到了答案。该应用程序名为“Open Sesame!”，被称为世界上第一款 Macintosh 智能软件助手，它可以学习用户的模式并提供自动化重复操作。\n\n作者回忆起在上世纪 90 年代初到中期观看 Open Sesame! 演示的情景，尽管演示本身存在缺陷。文章强调了在 2025 年使用现代 AI 来发现一款早在 1993 年就围绕机器学习原则构建的应用程序的讽刺意味。\n\n文章提供了 Macintosh Garden 上 Open Sesame! 1.1 的下载链接，并提供了一个“延伸阅读”列表，其中包括 1993-1996 年的几篇 MacWorld 出版物，提供了有关该应用程序的评论、广告和新闻。还提到了 1996 年 NASA 的一篇关于“智能代理技术”的衍生出版物。"
  },
  {
    "id": "44143253",
    "title": "Cuss: Map of profane words to a rating of sureness",
    "url": "https://github.com/words/cuss",
    "summary": "`cuss` is an ESM-only JavaScript package providing lists of profane words and phrases in multiple languages, each associated with a \"sureness\" rating from 0 to 2. This rating indicates the likelihood of a term being used as profanity, not its vulgarity level. The package is intended for natural language research, *not* for building profanity filters, which are discouraged.\n\nThe package is installed via npm (Node.js) or imported directly via ESM in Deno or browsers.  It exports a `cuss` object for each supported language (English, Arabic (Latin), Spanish, French, Italian, Portuguese, and European Portuguese), containing a record of words and their sureness ratings.\n\nThe data sources vary by language and include sources such as Luis von Ahn’s Research Group, Wikipedia, and other online resources. The package is fully typed with TypeScript and compatible with maintained Node.js versions (14.14+, 16.0+), Deno, and modern browsers.\n\nThe documentation also highlights related packages (buzzwords, fillers, hedges, etc.) and encourages contributions, providing guidelines for adding new terms or languages, and emphasizing the need to run tests after making changes. `cuss` is released under the MIT license.\n",
    "chinese_title": "Cuss: Map of profane words to a rating of sureness",
    "chinese_summary": "`cuss` 是一个仅支持 ESM 的 JavaScript 包，它提供多种语言的脏话词汇列表，每个词汇都关联一个从 0 到 2 的 “确定性” 评分。该评分表示一个词语被用作脏话的可能性，而非其粗俗程度。 此包旨在用于自然语言研究，*而非* 用于构建不鼓励使用的脏话过滤器。\n\n该包通过 npm (Node.js) 安装，或直接通过 Deno 或浏览器中的 ESM 导入。它为每种支持的语言（英语、阿拉伯语（拉丁字母）、西班牙语、法语、意大利语、葡萄牙语和欧洲葡萄牙语）导出一个 `cuss` 对象，其中包含单词及其确定性评级的记录。\n\n数据来源因语言而异，包括 Luis von Ahn 的研究小组、Wikipedia 和其他在线资源等来源。该包完全使用 TypeScript 进行类型化，并与维护的 Node.js 版本（14.14+、16.0+）、Deno 和现代浏览器兼容。\n\n该文档还重点介绍了相关包（buzzwords, fillers, hedges 等），并鼓励贡献，提供添加新术语或语言的指南，并强调在进行更改后需要运行测试。 `cuss` 在 MIT 许可下发布。"
  },
  {
    "id": "44158720",
    "title": "Reducing Cargo target directory size with -Zno-embed-metadata",
    "url": "https://kobzol.github.io/rust/rustc/2025/06/02/reduce-cargo-target-dir-size-with-z-no-embed-metadata.html",
    "summary": "This article discusses a new method for reducing the size of the Rust Cargo target directory using the unstable compiler flag `-Zno-embed-metadata`. The author addresses the common complaint about the target directory's disk usage, highlighting that metadata duplication contributes to the bloat.\n\nNormally, when compiling Rust library crates, the compiler generates both metadata (in `.rmeta` files) and object code (in `.rlib` files), with the `.rlib` file containing both. Cargo uses pipelining, leveraging metadata to start compiling dependent crates before object code is fully generated, leading to two copies of metadata on disk.\n\nThe `-Zno-embed-metadata` flag, inspired by Bjorn3's idea, eliminates metadata duplication by only including a minimal \"metadata stub\" in the `.rlib` file, keeping the full metadata in the `.rmeta` file. The author implemented this flag in the compiler and its support in Cargo, exposing it via the `-Zno-embed-metadata` Cargo flag.\n\nBenchmarks using hyperqueue show substantial reductions in target directory size, especially in release mode and without debuginfo or incremental compilation (reductions ranging from 9.5% to 36.3%). While it didn't significantly speed up compile times, the flag notably reduces the size of the standard library `.so` file.\n\nThe author proposes making `-Zno-embed-metadata` the default behavior in Cargo, potentially after a period of testing in the nightly toolchain. Feedback from real-world usage is encouraged.\n",
    "chinese_title": "使用 -Zno-embed-metadata 减少 Cargo 目标目录大小",
    "chinese_summary": "This article discusses a new method for reducing the size of the Rust Cargo target directory using the unstable compiler flag `-Zno-embed-metadata`. The author addresses the common complaint about the target directory's disk usage, highlighting that metadata duplication contributes to the bloat.\n\nNormally, when compiling Rust library crates, the compiler generates both metadata (in `.rmeta` files) and object code (in `.rlib` files), with the `.rlib` file containing both. Cargo uses pipelining, leveraging metadata to start compiling dependent crates before object code is fully generated, leading to two copies of metadata on disk.\n\nThe `-Zno-embed-metadata` flag, inspired by Bjorn3's idea, eliminates metadata duplication by only including a minimal \"metadata stub\" in the `.rlib` file, keeping the full metadata in the `.rmeta` file. The author implemented this flag in the compiler and its support in Cargo, exposing it via the `-Zno-embed-metadata` Cargo flag.\n\nBenchmarks using hyperqueue show substantial reductions in target directory size, especially in release mode and without debuginfo or incremental compilation (reductions ranging from 9.5% to 36.3%). While it didn't significantly speed up compile times, the flag notably reduces the size of the standard library `.so` file.\n\nThe author proposes making `-Zno-embed-metadata` the default behavior in Cargo, potentially after a period of testing in the nightly toolchain. Feedback from real-world usage is encouraged.\n"
  },
  {
    "id": "44164893",
    "title": "Show HN: Page Magic: Use AI to customize any web page",
    "url": "https://github.com/khaledh/pagemagic",
    "summary": "生成摘要时出错",
    "chinese_title": "Show HN: Page Magic：用AI定制任何网页",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44159798",
    "title": "Mesh Edge Construction",
    "url": "https://maxliani.wordpress.com/2025/03/01/mesh-edge-construction/",
    "summary": "This article explores algorithms for efficiently computing the unique edges of a polygonal mesh, a fundamental task in 3D graphics. It begins by defining mesh representations, highlighting the Face-Vertex Mesh format and distinguishing between \"edges\" and \"half-edges.\" Half-edges are ordered pairs of indices derived directly from the mesh's topology (winding order), while an edge represents a unique line segment, regardless of direction.\n\nThe core problem is identifying and enumerating these unique edges from the raw index data. The article presents three algorithms, each an optimization of the previous one, all producing the same result:\n\n1.  **Map Approach:** Uses a `std::map` (or `std::unordered_map` for optimization) to store edges as they are encountered, ensuring only the first instance of each unique edge is kept. While conceptually simple, the frequent memory allocations of map insertion contribute to a higher execution cost (O(n log n) complexity).\n\n2.  **Flat Vector + Sort:** This approach improves efficiency by pre-allocating a flat vector containing all potential edges (including duplicates) paired with their initial index. It then uses `std::stable_sort` to group duplicates while preserving their original order, followed by `std::unique` to remove the duplicates. A final sort based on the initial index restores the desired edge enumeration order. This method reduces memory allocation overhead, improving performance (but still O(n log n) complexity), at the cost of a larger memory footprint.\n\nThe article emphasizes the importance of sorting edges by their sorted index pairs to identify duplicates and the advantages of a stable sort to maintain the original encounter order.\n",
    "chinese_title": "网格边缘构建",
    "chinese_summary": "本文探讨了高效计算多边形网格唯一边的算法，这是3D图形学中的一项基本任务。文章首先定义了网格表示方法，重点介绍了面-顶点网格格式，并区分了“边”和“半边”。半边是从网格拓扑（缠绕顺序）直接导出的有序索引对，而边则代表一个唯一的线段，与方向无关。\n\n核心问题是从原始索引数据中识别和枚举这些唯一边。文章介绍了三种算法，每一种都是对前一种的优化，但都产生相同的结果：\n\n1.  **映射方法：** 使用 `std::map`（或使用 `std::unordered_map` 进行优化）来存储遇到的边，确保只保留每个唯一边的第一个实例。虽然概念上很简单，但map插入的频繁内存分配导致更高的执行成本（O(n log n)复杂度）。\n\n2.  **扁平向量 + 排序：** 这种方法通过预分配一个包含所有潜在边（包括重复项）并与其初始索引配对的扁平向量来提高效率。 然后，它使用 `std::stable_sort` 对重复项进行分组，同时保留其原始顺序，然后使用 `std::unique` 删除重复项。 基于初始索引的最终排序恢复了所需的边枚举顺序。 该方法减少了内存分配开销，提高了性能（但仍然是O(n log n)复杂度），但代价是更大的内存占用。\n\n文章强调了按其排序的索引对对边进行排序以识别重复项的重要性，以及稳定排序在维持原始遇到顺序方面的优势。"
  },
  {
    "id": "44157378",
    "title": "TradeExpert, a trading framework that employs Mixture of Expert LLMs",
    "url": "https://arxiv.org/abs/2411.00782",
    "summary": "生成摘要时出错",
    "chinese_title": "TradeExpert, a trading framework that employs Mixture of Expert LLMs",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44162443",
    "title": "Snowflake to buy Crunchy Data for $250M",
    "url": "https://www.wsj.com/articles/snowflake-to-buy-crunchy-data-for-250-million-233543ab",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "Snowflake to buy Crunchy Data for $250M",
    "chinese_summary": "Unable to access the article link.\n"
  },
  {
    "id": "44169764",
    "title": "Greenland's mega tsunamis: direct observation of trapped waves that shook world",
    "url": "https://phys.org/news/2025-06-greenland-mega-tsunamis-shook-world.html",
    "summary": "生成摘要时出错",
    "chinese_title": "Greenland's mega tsunamis: direct observation of trapped waves that shook world",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44155635",
    "title": "LFSR CPU Running Forth",
    "url": "https://github.com/howerj/lfsr-vhdl",
    "summary": "生成摘要时出错",
    "chinese_title": "LFSR CPU Running Forth",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44159337",
    "title": "Show HN: I made an AI that turn live lecture into structured notes,mind-maps,PDF",
    "url": "https://www.notorium.app",
    "summary": "生成摘要时出错",
    "chinese_title": "Show HN: 我做了一个AI，可以将直播讲座转化为结构化笔记、思维导图和PDF",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44170967",
    "title": "Claude Code Is My Computer",
    "url": "https://steipete.me/posts/2025/claude-code-is-my-computer",
    "summary": "This article details the author's (steipete's) experience using Claude Code, Anthropic's command-line tool, in \"dangerously skip permissions\" mode on macOS, effectively granting it unrestricted access to their system. Despite the inherent risks, they've used it successfully for two months without incident and believe it significantly increases their productivity.\n\nThe author argues that Claude Code transcends being just a smarter command line; it's a universal computer interface operated via text. They use it for various tasks, including migrating systems, shipping and automating content, extracting features, generating test data, managing Git workflows, cleaning the OS, and setting up new machines. The tool's ability to understand context and intent, iterate based on results, and directly execute commands is key to its effectiveness.\n\nThey contrast Claude Code with tools like Warp, which require individual approval for each command, hindering conversational flow. The author suggests that Claude Code represents a shift towards AI-native development, where developers act as orchestrators of powerful systems rather than just typers of commands. They recommend trying it, given the risk is managed with proper backups, highlighting the ease of adoption and significant productivity gains. In essence, they've turned their computer into an exceptionally capable assistant named Claude.\n",
    "chinese_title": "克劳德代码是我的电脑",
    "chinese_summary": "本文详细介绍了作者（steipete）在macOS上使用Claude Code（Anthropic的命令行工具）“危险地跳过权限”模式的经验，有效地赋予了其对系统的无限制访问权限。尽管存在内在风险，但他们已成功使用了两个月而未发生任何事故，并认为它显著提高了他们的生产力。\n\n作者认为，Claude Code不仅仅是一个更聪明的命令行工具，而是一个通过文本操作的通用计算机界面。他们将其用于各种任务，包括迁移系统、交付和自动化内容、提取功能、生成测试数据、管理Git工作流程、清理操作系统和设置新机器。该工具理解上下文和意图、根据结果迭代以及直接执行命令的能力是其有效性的关键。\n\n他们将Claude Code与Warp等工具进行了对比，Warp需要对每个命令进行单独批准，这会阻碍对话流程。作者认为，Claude Code代表着一种向AI原生开发的转变，在这种开发模式下，开发人员充当强大系统的编排者，而不仅仅是命令的输入者。他们建议尝试一下，前提是用适当的备份来管理风险，并强调了采用的便捷性和显著的生产力提升。本质上，他们已经把他们的计算机变成了一个能力超强的助手，名叫Claude。"
  },
  {
    "id": "44155741",
    "title": "Show HN: MBCompass – Android Compass App",
    "url": "https://github.com/MubarakNative/MBCompass",
    "summary": "生成摘要时出错",
    "chinese_title": "Show HN: MBCompass – Android Compass App",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44154511",
    "title": "Show HN: Moon Phase Algorithms for C, Lua, Awk, JavaScript, etc.",
    "url": "https://github.com/oliverkwebb/moonphase",
    "summary": "生成摘要时出错",
    "chinese_title": "Show HN：C、Lua、Awk、JavaScript等语言的月相算法",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44167607",
    "title": "Ubicloud: Open-Source Alternative to AWS",
    "url": "https://github.com/ubicloud/ubicloud",
    "summary": "Ubicloud is presented as an open-source alternative to major cloud providers like AWS, offering IaaS features on bare metal providers such as Hetzner, Leaseweb, and AWS Bare Metal. It can be used as a managed service directly through Ubicloud's console or by building your own cloud by setting up the control plane and connecting to a cloud console. Building your own cloud involves cloudifying bare metal Linux machines leased from providers.\n\nUbicloud aims to offer cost savings, increased control, and openness compared to proprietary cloud solutions. While AWS offers a vast array of services, Ubicloud focuses on implementing the core 20% of services that account for 80% of usage. Current use cases include ephemeral workloads like CI/CD pipelines and compute-heavy tests. It is also positioned as a portable app deployment service and a solution for building your own cloud on existing bare metal infrastructure.\n\nThe architecture involves a control plane managing a data plane, leveraging open-source software. Components include Elastic Compute (using Cloud Hypervisor), Networking (IPsec tunneling, dual-stack IPv4/IPv6, nftables firewalls/load balancers), Block Storage (SPDK), and Attribute-Based Access Control (ABAC). Planned future developments include managed K8s and metrics/monitoring.\n\nThe founding team has experience from Azure, Amazon, and Heroku, including involvement with Citus Data. Key differences from OpenStack include being available as a managed service, targeting developers for rapid feedback, and a simpler, more opinionated design.\n",
    "chinese_title": "Ubicloud: Open-Source Alternative to AWS",
    "chinese_summary": "Ubicloud is presented as an open-source alternative to major cloud providers like AWS, offering IaaS features on bare metal providers such as Hetzner, Leaseweb, and AWS Bare Metal. It can be used as a managed service directly through Ubicloud's console or by building your own cloud by setting up the control plane and connecting to a cloud console. Building your own cloud involves cloudifying bare metal Linux machines leased from providers.\n\nUbicloud aims to offer cost savings, increased control, and openness compared to proprietary cloud solutions. While AWS offers a vast array of services, Ubicloud focuses on implementing the core 20% of services that account for 80% of usage. Current use cases include ephemeral workloads like CI/CD pipelines and compute-heavy tests. It is also positioned as a portable app deployment service and a solution for building your own cloud on existing bare metal infrastructure.\n\nThe architecture involves a control plane managing a data plane, leveraging open-source software. Components include Elastic Compute (using Cloud Hypervisor), Networking (IPsec tunneling, dual-stack IPv4/IPv6, nftables firewalls/load balancers), Block Storage (SPDK), and Attribute-Based Access Control (ABAC). Planned future developments include managed K8s and metrics/monitoring.\n\nThe founding team has experience from Azure, Amazon, and Heroku, including involvement with Citus Data. Key differences from OpenStack include being available as a managed service, targeting developers for rapid feedback, and a simpler, more opinionated design.\n"
  },
  {
    "id": "44159318",
    "title": "A Hidden Weakness",
    "url": "https://serge-sans-paille.github.io/pythran-stories/a-hidden-weakness.html",
    "summary": "生成摘要时出错",
    "chinese_title": "一个隐藏的弱点",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44162042",
    "title": "Can I stop drone delivery companies flying over my property?",
    "url": "https://www.rte.ie/brainstorm/2025/0602/1481005-drone-delivery-companies-property-legal-rights-airspace/",
    "summary": "生成摘要时出错",
    "chinese_title": "Can I stop drone delivery companies flying over my property?",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44142259",
    "title": "I made a chair",
    "url": "https://milofultz.com/2025-05-27-i-made-a-chair.html",
    "summary": "The author built a simple chair based on an Instructables guide, using only one 8-foot 2\"x12\" piece of lumber and making basic cuts. Despite only having access to a circular saw and an oscillating multitool (tools not ideally suited for the task), the project was completed quickly. The author finished the chair by applying end cut sealer to protect the wood and expressed satisfaction with the finished product, even preferring it over their other chairs.\n",
    "chinese_title": "我做了一把椅子。",
    "chinese_summary": "作者根据Instructables的指南，仅使用一根8英尺长的2\"x12\"木材并进行简单的切割，制作了一把简易椅子。 尽管只有圆锯和多功能振荡工具（并非该任务的理想工具），该项目还是很快完成了。 作者最后涂抹了端切密封剂来保护木材，并对成品表示满意，甚至比他其他的椅子更喜欢它。"
  },
  {
    "id": "44147573",
    "title": "New adaptive optics shows details of our star's atmosphere",
    "url": "https://nso.edu/press-release/new-adaptive-optics-shows-stunning-details-of-our-stars-atmosphere/",
    "summary": "Using a new \"coronal adaptive optics\" system called Cona, scientists at the NSF National Solar Observatory and New Jersey Institute of Technology have produced the clearest images to date of the Sun's corona. Cona, installed at the Goode Solar Telescope at Big Bear Solar Observatory, compensates for atmospheric turbulence, enabling unprecedented resolution of coronal features.\n\nThe new technology has enabled scientists to observe and create videos of solar prominences, plasma streams (dubbed \"plasmoids\"), and coronal rain with unprecedented detail. Specifically, researchers captured movies of turbulent internal flows within a solar prominence, the formation and collapse of a plasma stream, and the movement of strands of coronal rain less than 20 kilometers wide.\n\nThe increased resolution, reaching the theoretical limit of the Goode Solar Telescope at 63 kilometers, allows for a deeper understanding of coronal heating, solar eruptions, and space weather. Scientists believe resolving the structure and dynamics of cooler plasma at small scales is key to unlocking the secrets of coronal heating. The technology has the potential to improve our understanding of solar activity's impact on Earth and space-based technologies.\n\nThe scientists are now working to apply this technology to the 4-meter NSF Daniel K. Inouye Solar Telescope in Hawai'i for even greater detail. They expect this breakthrough to revolutionize ground-based solar astronomy, leading to many more discoveries about the Sun's atmosphere.\n",
    "chinese_title": "新型自适应光学技术揭示太阳大气层细节",
    "chinese_summary": "美国国家科学基金会国家太阳天文台和新泽西理工学院的科学家利用一种名为Cona的新型“日冕自适应光学”系统，迄今为止已产生了最清晰的太阳日冕图像。Cona安装在熊湖太阳天文台的古德太阳望远镜上，可补偿大气湍流，从而以前所未有的分辨率观测日冕特征。\n\n这项新技术使科学家们能够以前所未有的细节观察和创建太阳耀斑、等离子体流（被称为“等离子团”）和日冕雨的视频。具体来说，研究人员拍摄了太阳耀斑内部湍流、等离子体流的形成和崩溃，以及宽度小于20公里的日冕雨丝的运动的电影。\n\n分辨率的提高达到了古德太阳望远镜63公里处的理论极限，有助于更深入地了解日冕加热、太阳爆发和空间天气。科学家们认为，解决小尺度上较冷等离子体的结构和动力学是解开日冕加热之谜的关键。该技术有潜力提高我们对太阳活动对地球和太空技术影响的理解。\n\n科学家们现在正致力于将这项技术应用于夏威夷的4米美国国家科学基金会丹尼尔·井上太阳望远镜，以获得更精细的细节。他们预计这项突破将彻底改变地基太阳天文学，从而带来更多关于太阳大气层的发现。"
  },
  {
    "id": "44142955",
    "title": "In POSIX, you can theoretically use inode zero",
    "url": "https://utcc.utoronto.ca/~cks/space/blog/unix/POSIXAllowsZeroInode",
    "summary": "Chris Siebenmann's blog, Wandering Thoughts, is displaying a \"too-old browser\" message to users due to anti-crawler precautions implemented to combat a surge of high-volume crawlers, particularly those using old Chrome user agents for LLM training data gathering. The system mistakenly flags legitimate older browsers as suspicious.\n\nIf a user encounters this message in error with a modern browser, they are encouraged to contact Siebenmann at his university email address (which they can deduce) with details about their browser and User-Agent string.\n\nA specific issue is highlighted regarding archive.* services (archive.today, archive.ph, archive.is, etc.). These archiving services are being blocked because their crawling behavior mimics that of malicious actors: using outdated Chrome User-Agents, originating from widely distributed IP address blocks not clearly identified as theirs, and sometimes employing falsified reverse DNS entries claiming to be Googlebot. Siebenmann recommends using archive.org instead, as it is a better-behaved archival crawler. The entry is dated February 17, 2025.\n",
    "chinese_title": "在POSIX中，理论上你可以使用inode零。",
    "chinese_summary": "Chris Siebenmann's blog, Wandering Thoughts, is displaying a \"too-old browser\" message to users due to anti-crawler precautions implemented to combat a surge of high-volume crawlers, particularly those using old Chrome user agents for LLM training data gathering. The system mistakenly flags legitimate older browsers as suspicious.\n\nIf a user encounters this message in error with a modern browser, they are encouraged to contact Siebenmann at his university email address (which they can deduce) with details about their browser and User-Agent string.\n\nA specific issue is highlighted regarding archive.* services (archive.today, archive.ph, archive.is, etc.). These archiving services are being blocked because their crawling behavior mimics that of malicious actors: using outdated Chrome User-Agents, originating from widely distributed IP address blocks not clearly identified as theirs, and sometimes employing falsified reverse DNS entries claiming to be Googlebot. Siebenmann recommends using archive.org instead, as it is a better-behaved archival crawler. The entry is dated February 17, 2025.\n"
  },
  {
    "id": "44155247",
    "title": "The Princeton INTERCAL Compiler's source code",
    "url": "https://esoteric.codes/blog/published-for-the-first-time-the-original-intercal72-compiler-code",
    "summary": "生成摘要时出错",
    "chinese_title": "The Princeton INTERCAL Compiler's source code",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44123987",
    "title": "Nitrogen Triiodide (2016)",
    "url": "https://www.fourmilab.ch/documents/chemistry/NI3/",
    "summary": "John Walker's \"Nitrogen Triiodide\" recounts his explosive encounter with the compound while in engineering school and details its properties. Nitrogen triiodide (NI3), formed from reacting iodine with ammonium hydroxide, is exceptionally unstable due to steric strain, where the large iodine atoms are poorly bonded to the nitrogen atom. This high-energy configuration easily rearranges into nitrogen gas and elemental iodine, releasing energy as a loud bang and a cloud of purple iodine vapor.\n\nNI3 is incredibly sensitive, detonating with minimal activation energy from sources like touch, sound, or even alpha particles. While wet, it's relatively stable, but it becomes hyper-sensitive as it dries. This makes it unsuitable for practical applications, as it explodes uncontrollably. The author warns against experimenting with it due to its unpredictable nature, advising readers to enjoy videos demonstrating its properties.\n\nThe article also clarifies that the \"nitrogen triiodide\" commonly made is actually an adduct of NI3 and ammonia (NI3 · NH3). Pure NI3 is even more unstable, subliming at -20°C and spontaneously decomposing at 0°C, making it difficult to study. Walker concludes by recommending readers stay wary of red-purple stains, particularly on college campuses, due to his own history.\n",
    "chinese_title": "三碘化氮 (2016)",
    "chinese_summary": "约翰·沃克的《三碘化氮》讲述了他在工程学院学习期间与该化合物的爆炸性遭遇，并详细介绍了它的性质。三碘化氮（NI3）是由碘与氢氧化铵反应形成的，由于空间位阻而极不稳定，其中大的碘原子与氮原子结合不良。这种高能构型很容易重新排列成氮气和元素碘，并以巨响和紫色碘蒸气的形式释放能量。\n\n三碘化氮极其敏感，只需极小的激活能，例如触摸、声音甚至α粒子，就能引爆。湿润时相对稳定，但干燥后会变得异常敏感。这使得它不适用于实际应用，因为它会不受控制地爆炸。作者警告不要进行相关实验，因为它具有不可预测性，建议读者观看演示其性质的视频。\n\n文章还澄清了通常制备的“三碘化氮”实际上是NI3和氨的加合物（NI3·NH3）。纯NI3更加不稳定，在-20°C升华，在0°C自发分解，因此难以研究。沃克最后建议读者对红紫色污渍保持警惕，尤其是在大学校园里，因为他有过亲身经历。"
  },
  {
    "id": "44142650",
    "title": "Hip: C++ Heterogeneous-Compute Interface for Portability",
    "url": "https://github.com/ROCm/hip",
    "summary": "HIP (Heterogeneous-Compute Interface for Portability) is a C++ runtime API and kernel language that enables developers to create portable applications for both AMD and NVIDIA GPUs using a single source code. It's designed to be a thin layer with minimal performance impact compared to native CUDA. HIP allows for C++ features like templates and lambdas, and supports using the best development tools on each platform.\n\nKey features include:\n\n*   **Portability:** Write code once and run it on both AMD and NVIDIA GPUs.\n*   **Performance:** Minimal overhead compared to native CUDA.\n*   **Modern C++:** Utilizes C++11 features and allows for single-source C++ development.\n*   **Platform Specialization:** Allows developers to tune for specific platforms.\n*   **Conversion Tools:** HIPIFY automatically converts CUDA code to HIP, easing the porting process.\n*   **Compiler Flexibility:** Compiles with `nvcc` (CUDA) or HIP-Clang (AMD).\n\nThe repository includes:\n\n*   **Headers:** `hip_runtime_api.h` (core API) and `hip_runtime.h` (includes kernel launch syntax).\n*   **Implementation Details:** Platform-specific code in `amd_detail/` and `nvidia_detail/`.\n*   **Tools:** `hipcc` (compiler driver) and `hipconfig` (configuration information).\n*   **Documentation:** Markdown and Doxygen documentation.\n*   **Examples:** Available in the ROCm-examples repository.\n\nTo get started, see the installation notes and the guide for porting CUDA projects. Report issues via the GitHub issue tracker, including the output of `hipconfig --full` and `samples/1_hipInfo/hipInfo` if possible.\n",
    "chinese_title": "Hip：C++异构计算接口，用于可移植性",
    "chinese_summary": "HIP (可移植异构计算接口) 是一种 C++ 运行时 API 和内核语言，使开发者能够使用单一源代码为 AMD 和 NVIDIA GPU 创建可移植的应用程序。它旨在成为一个薄层，与原生 CUDA 相比性能影响极小。HIP 允许使用 C++ 特性，如模板和 Lambda 表达式，并支持在每个平台上使用最佳的开发工具。\n\n主要特性包括：\n\n*   **可移植性：** 编写一次代码，即可在 AMD 和 NVIDIA GPU 上运行。\n*   **性能：** 与原生 CUDA 相比，开销极小。\n*   **现代 C++：** 利用 C++11 特性，并允许单源 C++ 开发。\n*   **平台专业化：** 允许开发者针对特定平台进行调整。\n*   **转换工具：** HIPIFY 自动将 CUDA 代码转换为 HIP，简化移植过程。\n*   **编译器灵活性：** 使用 `nvcc` (CUDA) 或 HIP-Clang (AMD) 进行编译。\n\n该存储库包括：\n\n*   **头文件：** `hip_runtime_api.h`（核心 API）和 `hip_runtime.h`（包含内核启动语法）。\n*   **实现细节：** 平台特定代码位于 `amd_detail/` 和 `nvidia_detail/` 中。\n*   **工具：** `hipcc`（编译器驱动程序）和 `hipconfig`（配置信息）。\n*   **文档：** Markdown 和 Doxygen 文档。\n*   **示例：** 可在 ROCm-examples 存储库中找到。\n\n要开始使用，请参阅安装说明和 CUDA 项目移植指南。通过 GitHub 问题跟踪器报告问题，如果可能，请包括 `hipconfig --full` 和 `samples/1_hipInfo/hipInfo` 的输出。"
  },
  {
    "id": "44147803",
    "title": "Show HN: Patio – Rent tools, learn DIY, reduce waste",
    "url": "https://patio.so",
    "summary": "Patio is presented as a platform designed to help people with DIY projects, reduce waste, and access construction resources. It offers a multifaceted approach encompassing several key features:\n\n*   **DIY News and Quizzes:** The platform provides educational content to help users learn about DIY projects, offering news and interactive quizzes to enhance their knowledge.\n\n*   **Tool Rentals:** A core feature is the ability to rent tools, making DIY projects more accessible and affordable, while also encouraging resource sharing and reducing the need for individual tool ownership and subsequent waste.\n\n*   **Construction Marketplace:** Patio also acts as a marketplace, connecting users with construction professionals and potentially other DIYers. This can facilitate finding help, materials, or collaborators for their projects.\n\nIn essence, Patio aims to be a one-stop shop for DIY enthusiasts, combining learning resources, access to tools through rentals, and a community marketplace for support and resources, all while promoting sustainability.\n",
    "chinese_title": "Show HN: Patio – Rent tools, learn DIY, reduce waste",
    "chinese_summary": "Patio is presented as a platform designed to help people with DIY projects, reduce waste, and access construction resources. It offers a multifaceted approach encompassing several key features:\n\n*   **DIY News and Quizzes:** The platform provides educational content to help users learn about DIY projects, offering news and interactive quizzes to enhance their knowledge.\n\n*   **Tool Rentals:** A core feature is the ability to rent tools, making DIY projects more accessible and affordable, while also encouraging resource sharing and reducing the need for individual tool ownership and subsequent waste.\n\n*   **Construction Marketplace:** Patio also acts as a marketplace, connecting users with construction professionals and potentially other DIYers. This can facilitate finding help, materials, or collaborators for their projects.\n\nIn essence, Patio aims to be a one-stop shop for DIY enthusiasts, combining learning resources, access to tools through rentals, and a community marketplace for support and resources, all while promoting sustainability.\n"
  },
  {
    "id": "44142251",
    "title": "Estimating Logarithms",
    "url": "https://obrhubr.org/logarithm-estimation",
    "summary": "This article explains a method for estimating logarithms base 10, attributed to John Napier. The core idea is that the logarithm of a number is approximately the number of digits minus one. This approximation is refined by repeatedly raising the number to the power of 10 and observing the resulting number of digits.\n\nThe method leverages the logarithmic property log(a^b) = b*log(a). The article describes the algorithm: log(N) ≈ #(N^10) / 10, where #N represents the number of digits of N minus one. Increasing the exponent to higher powers of 10 adds more precision.\n\nTo avoid cumbersome exponentiation, the author suggests using scientific notation.  Instead of starting from scratch with each iteration, one can use results from previous calculations. This involves exponentiating and multiplying only the mantissa.\n\nThe author then presents a Python script to automate the process, which calculates N^(prev^10) iteratively, starting with N^10. Each iteration involves raising the mantissa to the power of 10 and multiplying the exponent by 10, streamlining the calculation and allowing for arbitrary precision. The script uses the `decimal` library for handling large numbers and precision.\n",
    "chinese_title": "估算对数",
    "chinese_summary": "本文阐述了一种估算以10为底的对数的方法，据说是约翰·纳皮尔提出的。其核心思想是，一个数的对数近似等于其位数减一。通过反复将该数提高到10的幂并观察所得的位数，可以改进这个近似值。\n\n该方法利用对数性质log(a^b) = b*log(a)。本文描述了该算法：log(N) ≈ #(N^10) / 10，其中#N表示N的位数减一。将指数增加到更高的10的幂可以提高精度。\n\n为了避免繁琐的求幂运算，作者建议使用科学计数法。与其每次迭代都从头开始，不如利用之前计算的结果。这涉及到仅对尾数进行求幂和乘法运算。\n\n然后，作者提供了一个Python脚本来自动化该过程，该脚本迭代地计算N^(prev^10)，从N^10开始。每次迭代都涉及将尾数提高到10的幂，并将指数乘以10，从而简化计算并允许任意精度。该脚本使用`decimal`库来处理大数和精度。"
  },
  {
    "id": "44155069",
    "title": "TPDE: A Fast Adaptable Compiler Back-End Framework",
    "url": "https://arxiv.org/abs/2505.22610",
    "summary": "This arXiv article (arXiv:2505.22610) introduces TPDE, a novel compiler back-end framework designed for fast and adaptable code generation. The authors, Tobias Schwarz, Tobias Kamm, and Alexis Engelke from the Technical University of Munich, highlight the limitations of existing frameworks like LLVM in terms of compilation speed, particularly for JIT compilation. They argue that translating to an intermediate representation (IR) adds undesirable latency.\n\nTPDE addresses this by adapting to existing code representations in SSA form. It uses an IR-specific adapter for canonical access to IR data structures and specifies IR semantics, enabling a single-pass compilation process that combines instruction selection, register allocation, and instruction encoding after an initial analysis pass. The generated target instructions are primarily derived from high-level language code written using LLVM's Machine IR, promoting portability across different architectures while allowing for optimizations during code generation.\n\nThe authors demonstrate TPDE's generality by building new back-ends for LLVM targeting x86-64 and AArch64. Performance evaluations using SPECint 2017 show TPDE compiling LLVM-IR 8-24x faster than LLVM -O0, while maintaining comparable runtime performance. The paper further showcases TPDE's benefits in domain-specific IR contexts like WebAssembly and database query compilation, where the avoidance of IR translation further minimizes compilation latency. The paper includes 23 pages and 10 figures.\n",
    "chinese_title": "TPDE：一种快速可适应的编译器后端框架",
    "chinese_summary": "这篇arXiv文章（arXiv:2505.22610）介绍了TPDE，一种为快速和适应性强的代码生成而设计的新型编译器后端框架。来自慕尼黑工业大学的Tobias Schwarz、Tobias Kamm和Alexis Engelke指出，现有框架（如LLVM）在编译速度方面存在局限性，尤其是在JIT编译方面。他们认为，翻译成中间表示（IR）会增加不必要的延迟。\n\nTPDE通过适应现有的SSA形式的代码表示来解决这个问题。它使用特定于IR的适配器来规范地访问IR数据结构并指定IR语义，从而实现单遍编译过程，该过程在初始分析之后结合了指令选择、寄存器分配和指令编码。生成的目标指令主要来自使用LLVM的Machine IR编写的高级语言代码，从而提高了跨不同架构的可移植性，同时允许在代码生成期间进行优化。\n\n作者通过构建针对x86-64和AArch64的LLVM新后端来展示TPDE的通用性。使用SPECint 2017的性能评估表明，TPDE编译LLVM-IR的速度比LLVM -O0快8-24倍，同时保持了相当的运行时性能。该论文进一步展示了TPDE在特定领域IR环境（如WebAssembly和数据库查询编译）中的优势，在这些环境中，避免IR转换可以进一步最大限度地减少编译延迟。该论文包含23页和10个图。"
  },
  {
    "id": "44150093",
    "title": "Codex CLI is going native",
    "url": "https://github.com/openai/codex/discussions/1174",
    "summary": "In a post from May 30, 2025, fouad-openai announces the transition of Codex CLI to a native Rust implementation. This move aims to improve cross-platform stability, security, performance, and extensibility. The rewrite addresses community feedback and ongoing issues with the TypeScript version.\n\nKey improvements include:\n\n*   **Zero-dependency Install:** Eliminates the Node v22+ requirement, resolving user frustration.\n*   **Native Security Bindings:** Leverages existing Rust-based Linux sandboxing.\n*   **Optimized Performance:** Reduces memory consumption by avoiding runtime garbage collection.\n*   **Extensible Protocol:** Introduces a \"wire protocol\" allowing developers to extend the agent in various languages (TypeScript, Python, etc.) and MCPs, already supported in Rust.\n\nUsers can test the new version with `npm i -g @openai/codex@native`. While bug fixes continue in the TypeScript version, the Rust implementation will achieve feature parity soon. The wire protocol, currently defined in `codex-rs/core/src/protocol.rs`, enables developers to extend the agent in different languages. The team is also exploring WebAssembly for extensibility.\n\nThe post also addresses concerns about organization verification issues and tool name length limitations. The team is actively seeking feedback on the new version and is hiring Rust developers to contribute to the project.\n",
    "chinese_title": "Codex CLI 正在原生化",
    "chinese_summary": "在2025年5月30日的帖子中，fouad-openai宣布将Codex CLI过渡到原生Rust实现。此举旨在提高跨平台稳定性、安全性、性能和可扩展性。此次重写解决了社区反馈以及TypeScript版本存在的持续性问题。\n\n主要改进包括：\n\n*   **零依赖安装：** 消除了对Node v22+的要求，解决了用户的痛点。\n*   **原生安全绑定：** 利用现有的基于Rust的Linux沙盒。\n*   **优化性能：** 通过避免运行时垃圾回收来降低内存消耗。\n*   **可扩展协议：** 引入了一种“线路协议”，允许开发人员使用各种语言（TypeScript、Python等）和MCP扩展代理，这些已在Rust中得到支持。\n\n用户可以使用 `npm i -g @openai/codex@native` 测试新版本。虽然TypeScript版本仍在继续进行错误修复，但Rust实现将很快实现功能对等。线路协议目前在`codex-rs/core/src/protocol.rs`中定义，使开发人员能够使用不同的语言扩展代理。团队还在探索使用WebAssembly进行扩展。\n\n该帖子还解决了关于组织验证问题和工具名称长度限制的担忧。 团队正在积极寻求对新版本的反馈，并招聘Rust开发人员来为该项目做出贡献。"
  },
  {
    "id": "44147966",
    "title": "Stepping Back",
    "url": "https://rjp.io/blog/2025-05-31-stepping-back",
    "summary": "The author reflects on the importance of \"stepping back\" from tasks and problems to gain perspective and avoid getting lost in unproductive pursuits. They describe a personal experience of getting overly invested in a coding task with an LLM, only to realize upon forced interruption that their effort was misdirected. This illustrates a recurring pattern where intense focus can blind them to broader goals and more efficient solutions.\n\nThe author acknowledges the inherent tension between deep problem-solving and questioning its validity. While tenacity is crucial for engineers, it can also lead to unproductive obsession. Drawing an analogy to the exploration/exploitation dilemma in reinforcement learning, they ask how to balance pursuing a specific fix with reassessing the overall approach.\n\nThey suggest implementing regular reflection rituals tied to natural time boundaries (hours, days, weeks, months, years) to strategically evaluate their actions. These check-ins involve asking \"what am I doing?\", \"why am I doing it?\", and \"what could I be doing instead?\" The depth and scope of these questions vary depending on the timeframe, ranging from minor adjustments to feature scope on an hourly basis to a yearly review of life goals. The author views this periodic reflection as a valuable investment of time to ensure they're heading in the right direction and not wasting effort on ultimately pointless endeavors.\n",
    "chinese_title": "退一步",
    "chinese_summary": "作者反思了“后退一步”的重要性，以便从任务和问题中获得视角，避免迷失在无成效的追求中。他们描述了一段个人经历，即过度投入于一项使用LLM的编码任务，但被迫中断后才意识到自己的努力方向错误。这说明了一种反复出现的模式，即高度的专注可能会让他们看不到更广泛的目标和更有效的解决方案。\n\n作者承认了深入解决问题和质疑其有效性之间固有的张力。虽然坚韧对工程师来说至关重要，但它也可能导致无谓的执着。他们借鉴强化学习中的探索/利用困境，询问如何平衡追求特定的修复与重新评估整体方法。\n\n他们建议实施与自然时间边界（小时、天、周、月、年）相关的定期反思仪式，以策略性地评估自己的行为。这些检查包括询问“我在做什么？”、“我为什么要这样做？”和“我可以做什么？”。这些问题的深度和范围因时间范围而异，从每小时对功能范围进行小调整到每年对人生目标进行回顾。作者认为这种定期反思是对时间的宝贵投资，以确保他们朝着正确的方向前进，而不是将精力浪费在最终毫无意义的努力上。"
  },
  {
    "id": "44168994",
    "title": "Updates to Windows for the Digital Markets Act",
    "url": "https://blogs.windows.com/windows-insider/2025/06/02/updates-to-windows-for-the-digital-markets-act/",
    "summary": "This article details upcoming changes to Windows 10, Windows 11, and Microsoft apps within the European Economic Area (EEA) to comply with the Digital Markets Act. These updates, rolling out through Windows Insider builds and then to retail, focus on browser defaults, Windows Search, the Microsoft Store, and Microsoft apps.\n\n**Key Changes:**\n\n*   **Default Browser:** Setting the default browser will now include additional link and file types (ftp, read, .mht, etc.). It will also pin the chosen browser to the taskbar (optionally). Users can now set default browser for opening .pdf files.\n*   **Windows Search:** Apps can provide web search results within Windows Search, displayed concurrently. Users can reorder providers in Settings.\n*   **Microsoft Store:** Users in the EEA can uninstall the Microsoft Store. Store apps will continue to receive updates even after uninstallation.\n*   **Microsoft Apps:** The Microsoft Bing app and Start Experiences app will open web content in the default browser. Microsoft Edge will only prompt users to set it as the default browser if opened directly. Other Microsoft apps will not prompt for Edge reinstallation after uninstallation (excluding PWAs distributed via the Microsoft Store using Edge technology).\n\nThe article mentions specific build numbers and release timelines for these changes, highlighting the phased rollout through Insider channels and then to retail versions.\n",
    "chinese_title": "数字市场法案的Windows更新",
    "chinese_summary": "为遵守《数字市场法》，本文详细介绍了Windows 10、Windows 11以及欧洲经济区（EEA）内Microsoft应用即将发生的变化。这些更新将通过Windows预览体验计划版本逐步推出，然后发布到零售版，主要集中在浏览器默认设置、Windows搜索、Microsoft Store和Microsoft应用上。\n\n**主要变化：**\n\n*   **默认浏览器：** 设置默认浏览器现在将包括更多链接和文件类型（ftp、read、.mht等）。它还会将所选浏览器固定到任务栏（可选）。用户现在可以设置打开.pdf文件的默认浏览器。\n*   **Windows搜索：** 应用可以在Windows搜索中提供网络搜索结果，并行显示。用户可以在“设置”中重新排序提供商。\n*   **Microsoft Store：** 欧洲经济区内的用户可以卸载Microsoft Store。即使卸载后，应用商店应用仍将继续接收更新。\n*   **Microsoft应用：** Microsoft必应应用和“开始体验”应用将在默认浏览器中打开Web内容。只有直接打开Microsoft Edge时，才会提示用户将其设置为默认浏览器。卸载后，其他Microsoft应用不会提示重新安装Edge（使用Edge技术通过Microsoft Store分发的PWA除外）。\n\n本文提到了这些更改的具体内部版本号和发布时间表，重点介绍了通过预览体验成员通道逐步推出，然后发布到零售版本的阶段性发布。"
  },
  {
    "id": "44156157",
    "title": "War and Wilderness: British Soldiers in Revolutionary America",
    "url": "https://www.historytoday.com/archive/feature/war-and-wilderness-british-soldiers-revolutionary-america",
    "summary": "In \"War and Wilderness: British Soldiers in Revolutionary America,\" Vaughn Scribner explores the profound impact of the American environment on British and Hessian soldiers during the Revolutionary War. Beyond battling American rebels, these troops faced a constant struggle against the unfamiliar and hostile natural world.\n\nScribner highlights the challenges posed by America's terrain, flora, fauna, weather, and diseases. Vast swamplands, teeming with alligators and insects, became symbols of misery. The \"Great Dismal Swamp,\" for example, proved a daunting obstacle, while encounters with alligators instilled constant fear.\n\nMosquitoes were a particularly relentless torment, spreading deadly diseases like malaria and yellow fever. These diseases decimated the ranks of British and Hessian soldiers, who lacked immunity and experience in dealing with them. The prevalence of mosquitoes, exacerbated by rice cultivation in the Southern colonies, significantly weakened British forces, contributing to their defeat at Yorktown.\n\nThe article also details Horatio Nelson's ill-fated San Juan Expedition in Central America, where British soldiers confronted the dense rainforest and its diverse wildlife. Encounters with iguanas and snakes added to their anxieties. Ultimately, the harsh environment took a heavy toll on the soldiers' physical and mental well-being, leaving many like Thomas Hughes forever altered by their experiences in the American wilderness. The article effectively argues that the American environment was a formidable enemy that significantly impacted the course and outcome of the Revolutionary War.\n",
    "chinese_title": "战争与荒野：英国士兵在革命时期的美国",
    "chinese_summary": "战争与荒野：革命时期美国的英国士兵\n\n在《战争与荒野：革命时期美国的英国士兵》一书中，Vaughn Scribner 探讨了美国环境对革命战争期间英国和黑森士兵的深刻影响。除了与美国叛军作战之外，这些部队还面临着与陌生而充满敌意的自然世界的持续斗争。\n\nScribner 强调了美国地形、植物、动物、天气和疾病带来的挑战。广阔的沼泽地，到处都是鳄鱼和昆虫，成为了痛苦的象征。例如，“大荒凉沼泽”被证明是一个令人望而却步的障碍，而与鳄鱼的遭遇则灌输了持续的恐惧。\n\n蚊子是一种特别无情的折磨，传播疟疾和黄热病等致命疾病。这些疾病大量削减了英国和黑森士兵的队伍，他们缺乏免疫力和应对这些疾病的经验。蚊子的流行，因南方殖民地水稻种植而加剧，大大削弱了英国军队，导致他们在约克镇的失败。\n\n该文章还详细介绍了霍雷肖·纳尔逊在美洲中部进行的命运多舛的圣胡安远征，英国士兵在那里面临着茂密的热带雨林及其多样化的野生动物。与鬣蜥和蛇的遭遇增加了他们的焦虑。最终，恶劣的环境对士兵的身心健康造成了沉重的打击，让许多像托马斯·休斯一样的人因在美国荒野中的经历而永远改变。这篇文章有效地论证了美国的环境是一个强大的敌人，它极大地影响了革命战争的进程和结果。"
  },
  {
    "id": "44149718",
    "title": "Cinematography of “Andor”",
    "url": "https://www.pushing-pixels.org/2025/05/20/cinematography-of-andor-interview-with-christophe-nuyens.html",
    "summary": "This interview with Christophe Nuyens, the cinematographer for the second season of \"Andor,\" delves into his career, the evolution of filmmaking, and his work on the Star Wars series. Nuyens discusses his journey from film school to becoming a sought-after cinematographer, highlighting the shift from film to digital and the increasing quality expectations for episodic television. He emphasizes the importance of both technical skills and artistic cultivation, believing that creativity can be developed over time.\n\nRegarding \"Andor,\" Nuyens explains his approach to bridging the gap between Season 1 and \"Rogue One,\" opting for full-frame sensors and anamorphic lenses to achieve a cinematic feel. He describes the extensive pre-production process, including script read-throughs, moodboarding, and 3D pre-visualization with ILM. Nuyens also discusses the challenges and advantages of working with green screens versus painted backdrops and LED walls.\n\nThe interview highlights the collaborative nature of the production, particularly the close working relationship between Nuyens, the director, the art department, and the VFX team. He details the balance between practical sets and digital extensions, emphasizing the commitment to physically grounded VFX. Nuyens shares insights into the specific locations used for filming and the intentional use of different color palettes for different planets and story arcs to give each a unique feel. He also points out the importance of wireless tech in movie sets today but notes the possible downsides of congestion.\n",
    "chinese_title": "《安多》的摄影",
    "chinese_summary": "对克里斯托弗·纽延斯访谈：揭秘《安多》第二季的摄影幕后"
  },
  {
    "id": "44139626",
    "title": "Photos taken inside musical instruments",
    "url": "https://www.dpreview.com/photography/5400934096/probe-lenses-and-focus-stacking-the-secrets-to-incredible-photos-taken-inside-instruments",
    "summary": "The article \"Photos taken inside musical instruments\" on dpreview.com discusses how photographer Charles Brooks uses specialized techniques to capture stunning images from within musical instruments.\n\nBrooks employs a probe lens, a long, thin lens that allows him to reach into tight spaces like the bodies of guitars, cellos, and saxophones. These lenses often have a wide depth of field at close range, but for even sharper images throughout the instrument's interior, he uses focus stacking.\n\nFocus stacking involves taking numerous images of the same scene, each with a slightly different focus point. These images are then combined using software to create a single image with an extremely wide depth of field, resulting in sharp focus from the closest to the furthest point within the instrument.\n\nThe article highlights the challenges of this process, including the need for precise lighting, careful positioning of the lens, and a stable platform to avoid camera shake during the multiple exposures. Brooks meticulously cleans the inside of the instruments to minimize dust and imperfections visible in the final images.\n\nThe resulting photographs offer a unique perspective, revealing the hidden beauty and intricate craftsmanship inside instruments. The images transform familiar objects into abstract landscapes of wood, metal, and shadow, showcasing the unique artistry of each instrument's construction. They also reveal aspects not typically visible to the naked eye, enhancing appreciation for the detail and precision involved in instrument making.\n",
    "chinese_title": "乐器内部拍摄的照片",
    "chinese_summary": "dpreview.com 上的文章“乐器内部照片”探讨了摄影师查尔斯·布鲁克斯如何运用特殊技巧，从乐器内部捕捉到令人惊叹的图像。\n\n布鲁克斯使用探针镜头，一种细长的镜头，使他能够伸入吉他、大提琴和萨克斯管等乐器的内部狭小空间。这些镜头通常在近距离具有宽广的景深，但为了获得乐器内部更加清晰的图像，他使用了焦点堆叠技术。\n\n焦点堆叠包括拍摄同一场景的许多图像，每个图像都有略微不同的焦点。然后使用软件将这些图像组合起来，创建一个具有极宽景深的单个图像，从而使乐器内部从最近点到最远点都清晰聚焦。\n\n文章强调了这一过程的挑战，包括需要精确的照明、仔细的镜头定位以及稳定的平台，以避免多次曝光期间的相机抖动。布鲁克斯一丝不苟地清洁乐器内部，以最大限度地减少最终图像中可见的灰尘和瑕疵。\n\n最终的照片提供了一个独特的视角，揭示了乐器内部隐藏的美丽和复杂的工艺。这些图像将熟悉的物体转变为木材、金属和阴影的抽象景观，展示了每件乐器构造的独特艺术性。它们还揭示了通常肉眼无法看到的方面，从而增强了对乐器制造中涉及的细节和精确度的欣赏。"
  },
  {
    "id": "44148734",
    "title": "Structured Errors in Go (2022)",
    "url": "https://southcla.ws/structured-errors-in-go",
    "summary": "This article discusses structured error handling in Go, advocating for enriching error messages with metadata to improve debugging and logging, especially in HTTP APIs. Go's simple error string approach is functional but lacks structure for effective machine processing in log aggregators.\n\nThe author emphasizes the importance of ergonomic solutions, where good practices are easy to implement. Custom error structs are more work and less frequently used, leading to less informative errors.\n\nThe proposed solution involves wrapping errors with metadata using a `Fields` object, similar to the Logrus logging library. A `Wrap` function adds metadata to errors, and a `GetErrorFields` function extracts this metadata for structured logging.\n\nTo reduce manual work, the author suggests using Go's `context` package to store metadata during a call tree. This metadata can then be added to errors when they are wrapped. A `WithMeta` function adds metadata to the context, and the `Wrap` function extracts the context metadata and adds it to the error.\n\nThe article highlights the duality between context and errors, suggesting that errors are essentially contexts in reverse, accruing information as they ascend the call tree. Code examples demonstrate how to implement `WithMeta`, `Wrap`, and `Unwrap` functions for managing structured error metadata using Go's context package and the `errors` library. The aim is to provide a simple and effective way to add contextual information to errors, making debugging and logging more efficient.\n",
    "chinese_title": "Go 中的结构化错误 (2022)",
    "chinese_summary": "本文探讨了Go语言中的结构化错误处理，倡导通过使用元数据丰富错误信息，从而改进调试和日志记录，尤其是在HTTP API中。Go语言的简单错误字符串方法虽然可行，但缺乏结构，无法在日志聚合器中进行有效的机器处理。\n\n作者强调了符合人体工程学的解决方案的重要性，即易于实施的良好实践。自定义错误结构体需要更多的工作，使用频率较低，导致错误信息不足。\n\n提出的解决方案包括使用类似Logrus日志库的`Fields`对象来包装带有元数据的错误。`Wrap`函数向错误添加元数据，`GetErrorFields`函数提取此元数据以进行结构化日志记录。\n\n为了减少手动工作，作者建议使用Go的`context`包在调用树期间存储元数据。然后，可以在包装错误时将此元数据添加到错误中。`WithMeta`函数将元数据添加到上下文中，`Wrap`函数提取上下文元数据并将其添加到错误中。\n\n文章强调了上下文和错误之间的二元性，认为错误本质上是反向的上下文，在它们上升到调用树时积累信息。代码示例演示了如何使用Go的context包和`errors`库实现`WithMeta`、`Wrap`和`Unwrap`函数，以管理结构化错误元数据。目的是提供一种简单有效的方式来向错误添加上下文信息，从而提高调试和日志记录的效率。"
  },
  {
    "id": "44144240",
    "title": "Bohemians at the Gate?",
    "url": "https://inferencemagazine.substack.com/p/bohemians-at-the-gate",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "波西米亚人在门口？",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "44162160",
    "title": "LLMs Are Cheap",
    "url": "https://www.snellman.net/blog/archive/2025-06-02-llms-are-cheap/",
    "summary": "This article argues that operating Large Language Models (LLMs) is surprisingly cheap, challenging the common belief that they are prohibitively expensive. The author aims to provide a reference point for future discussions, highlighting that inference costs have dropped dramatically.\n\nThe core of the argument involves comparing the cost of LLM queries to web search queries. The author presents public API pricing for web search from companies like Google, Bing, and Brave. Then, they estimate the token output per LLM query and compare it to the price per token for various models like Gemini, GPT-4.1, and Claude 3.5, concluding that LLMs can be significantly cheaper than web search, even considering factors like potential subsidies or the amortization of search index building.\n\nThe author preemptively addresses potential objections, such as longer LLM responses, market share subsidies, and the speed of web search. They argue that even with adjustments, the cost difference remains significant.\n\nThe article concludes by discussing the implications of low LLM operating costs. It suggests that AI companies can recoup training costs as prices decrease and demand increases. It also argues that advertising becomes a viable and lucrative monetization strategy for consumer-facing AI. Finally, the author speculates about the future challenges related to AI agents accessing backend services, particularly regarding scraping costs and the potential adversarial relationship between AI agents and service providers. The author predicts that AI models won't be too expensive to run, but the real cost problem lies in backend services and the need for AI-optimized data providers.\n",
    "chinese_title": "大模型很便宜",
    "chinese_summary": "本文认为，运行大型语言模型（LLMs）的成本出乎意料地低廉，挑战了普遍认为它们成本高昂的观点。作者旨在为未来的讨论提供一个参考点，强调推理成本已大幅下降。\n\n论点的核心是将LLM查询的成本与网络搜索查询的成本进行比较。作者列出了谷歌、必应和Brave等公司公开的网络搜索API定价。然后，他们估算了每个LLM查询的token输出量，并将其与Gemini、GPT-4.1和Claude 3.5等各种模型的每个token价格进行比较，得出结论，即使考虑到潜在的补贴或搜索索引构建的摊销等因素，LLM也可能比网络搜索便宜得多。\n\n作者先发制人地解决了潜在的异议，例如更长的LLM响应、市场份额补贴和网络搜索的速度。他们认为，即使经过调整，成本差异仍然显著。\n\n文章最后讨论了低LLM运营成本的影响。它表明，随着价格下降和需求增加，人工智能公司可以收回培训成本。它还认为，广告成为面向消费者的AI的一种可行且有利可图的货币化策略。最后，作者推测了与AI代理访问后端服务相关的未来挑战，特别是关于抓取成本以及AI代理和服务提供商之间潜在的对抗关系。作者预测，AI模型的运行成本不会太高，但真正的成本问题在于后端服务以及对AI优化数据提供商的需求。"
  },
  {
    "id": "44147945",
    "title": "Progressive JSON",
    "url": "https://overreacted.io/progressive-json/",
    "summary": "This article introduces \"Progressive JSON,\" a method for streaming JSON data that improves upon traditional, all-or-nothing JSON loading and naive streaming approaches.  The author argues that waiting for the entire JSON payload to load before processing is inefficient, especially when parts of the data take longer to generate on the server.\n\nNaive streaming JSON, while delivering data earlier, can result in malformed objects with missing properties, making it difficult to use effectively. Progressive JSON solves this by sending data breadth-first, using placeholders (e.g., \"$1\") in the main JSON structure for data that hasn't yet arrived. These placeholders are later replaced with the actual data, which can be sent in any order, allowing the client to start processing available data while waiting for slower parts. Pending data is represented by Promises.\n\nThe article also discusses \"inlining,\" where complete portions of the data are included directly in the main JSON rather than as separate placeholders for efficiency. Finally, \"outlining\" is introduced as a way to deduplicate repeated objects in the stream by sending them once and referencing them multiple times.\n\nThe author draws a parallel between Progressive JSON and React Server Components (RSC), where the server streams a progressively loaded React tree represented as JSON. He highlights that React's `<Suspense>` component enables developers to control when parts of the UI are revealed to the user, decoupling data arrival from visual updates and allowing for a more graceful loading experience. The core idea is that data should be streamed as fast as possible but the UI revealed according to intentional loading states.\n",
    "chinese_title": "渐进式JSON",
    "chinese_summary": "本文介绍了“渐进式JSON”，这是一种流式传输JSON数据的方法，它改进了传统的、要么全部加载要么完全不加载的JSON加载方式以及简单的流式传输方法。作者认为，在处理之前等待整个JSON有效负载加载完成是低效的，尤其是在服务器上生成部分数据需要更长时间的情况下。\n\n简单的流式传输JSON虽然能更早地传递数据，但可能导致对象格式错误并缺少属性，使其难以有效使用。渐进式JSON通过广度优先发送数据来解决这个问题，在主JSON结构中使用占位符（例如“$1”）来表示尚未到达的数据。这些占位符随后会被实际数据替换，这些实际数据可以以任何顺序发送，从而允许客户端在等待较慢的部分时开始处理可用数据。待处理的数据由Promise表示。\n\n文章还讨论了“内联”，即将完整的数据部分直接包含在主JSON中，而不是作为单独的占位符，以提高效率。最后，介绍了“外联”，这是一种通过发送一次并多次引用它们来消除流中重复对象的方法。\n\n作者将渐进式JSON与React服务器组件（RSC）进行了类比，其中服务器流式传输表示为JSON的渐进式加载的React树。他强调，React的`<Suspense>`组件使开发人员能够控制何时向用户显示UI的各个部分，从而将数据到达与视觉更新分离，并允许更优雅的加载体验。核心思想是，数据应尽可能快地流式传输，但UI应根据有意的加载状态进行显示。"
  },
  {
    "id": "44148853",
    "title": "Father Ted Kilnettle Shrine Tape Dispenser",
    "url": "https://stephencoyle.net/kilnettle",
    "summary": "Stephen Coyle details the creation of an improved version of the \"Father Ted\" Kilnettle Shrine Talking Tape Dispenser. He originally built one a few years ago, but this new version is smaller, sounds better, looks more professional, and is easier to make.\n\nThe new design features:\n\n*   A 3D-printable case with no required supports.\n*   An IR LED and sensor to measure tape rotation instead of a rotary encoder.\n*   An ESP8266 microcontroller, reducing the electronics cost to under €10.\n\nCoyle provides comprehensive documentation, including software, 3D models, and instructions on GitHub and Printables, with an assembly video available. He encourages others with basic soldering skills and a 3D printer to build their own as a one-day project.\n\nWhile he considered selling these dispensers, he decided against it due to time constraints, prior commitments to friends and family, and an unappealing price point. Instead, he's made the resources publicly available for DIYers.\n\nFinally, he requests that anyone building the dispenser consider donating to a charity that supports trans people, referencing the unfortunate views of one of the \"Father Ted\" creators.\n",
    "chinese_title": "泰德神父基尔内托神龛胶带座",
    "chinese_summary": "斯蒂芬·科伊尔详述了改进版“神父特德” Kilnettle圣坛会说话胶带座的制作过程。几年前他曾制作过一个，但这个新版本更小巧、音质更好、外观更专业、且更易于制作。\n\n新设计特点：\n\n*   无需支撑的3D打印外壳。\n*   使用红外LED和传感器测量胶带旋转，取代旋转编码器。\n*   ESP8266微控制器，将电子元件成本降低到10欧元以下。\n\n科伊尔提供了全面的文档，包括软件、3D模型和说明，可在GitHub和Printables上获取，并提供组装视频。他鼓励具有基本焊接技能和3D打印机的人们制作自己的版本，只需一天即可完成。\n\n虽然他曾考虑出售这些胶带座，但由于时间限制、对朋友和家人的承诺以及缺乏吸引力的价格点，他最终放弃了。相反，他将资源公开提供给DIY爱好者。\n\n最后，他请求任何制作该胶带座的人考虑向支持跨性别者的慈善机构捐款，理由是“神父特德”的创作者之一持有令人遗憾的观点。"
  }
]