[
  {
    "id": "45199713",
    "title": "ChatGPT Developer Mode",
    "url": "https://platform.openai.com/docs/guides/developer-mode",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "ChatGPT开发者模式",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "45181535",
    "title": "Show HN: Term.everything – Run any GUI app in the terminal",
    "url": "https://github.com/mmulet/term.everything",
    "summary": "Term.everything❗ is a Linux CLI program that allows you to run any GUI application, even over SSH, directly within your terminal. It achieves this by functioning as a Wayland compositor, outputting to the terminal window instead of a traditional monitor.\n\nThe quality of the GUI rendering depends on the terminal's resolution, which can be adjusted for better visuals at the potential cost of performance. Terminals that support images, like Kitty or iTerm2, can render windows at full resolution. The project aims to eliminate the need for specialized terminal file viewers by allowing users to utilize their existing GUI file viewers within the terminal.\n\nThe project is currently in beta and may have issues with app compatibility. The developer encourages users to report any problems encountered. Term.everything❗ is built using Typescript and Bun, with a small portion written in C++. Documentation including a usage guide and contributing guidelines are available.\n",
    "chinese_title": "Show HN: Term.everything – 在终端中运行任何GUI应用",
    "chinese_summary": "Term.everything❗是一个 Linux 命令行程序，允许你直接在终端内运行任何 GUI 应用程序，甚至可以通过 SSH 运行。它通过充当 Wayland 合成器来实现这一点，将输出显示到终端窗口，而不是传统的显示器。\n\nGUI 渲染的质量取决于终端的分辨率，可以调整分辨率以获得更好的视觉效果，但可能会牺牲性能。 支持图像的终端，如 Kitty 或 iTerm2，可以以全分辨率渲染窗口。 该项目旨在消除对专用终端文件浏览器的需求，使用户能够在终端内使用现有的 GUI 文件浏览器。\n\n该项目目前处于 Beta 阶段，可能存在应用程序兼容性问题。开发者鼓励用户报告遇到的任何问题。 Term.everything❗ 使用 Typescript 和 Bun 构建，其中一小部分用 C++ 编写。 文档，包括使用指南和贡献指南，均已提供。"
  },
  {
    "id": "45196173",
    "title": "OrioleDB Patent: now freely available to the Postgres community",
    "url": "https://supabase.com/blog/orioledb-patent-free",
    "summary": "The announcement highlights the availability of the OrioleDB patent to the Postgres community. The core message is that the technology protected by the patent, likely related to innovative features or functionalities within the OrioleDB database system, is now freely accessible for use and further development within the broader Postgres ecosystem. This implies a significant shift from a proprietary technology to an open-source resource. By relinquishing exclusive rights, the creators of OrioleDB aim to foster collaboration, accelerate innovation, and contribute to the advancement of the Postgres database platform. The move potentially encourages wider adoption of OrioleDB concepts and techniques, benefiting both the OrioleDB project itself through community contributions and the Postgres community as a whole with access to valuable technological advancements. This availability signifies a commitment to open-source principles and aims to drive progress and innovation within the Postgres database landscape.\n",
    "chinese_title": "OrioleDB专利：现可供Postgres社区免费使用",
    "chinese_summary": "该公告强调OrioleDB专利对Postgres社区的可用性。核心信息是，受该专利保护的技术，可能与OrioleDB数据库系统中的创新特性或功能有关，现在可以自由访问，以便在更广泛的Postgres生态系统中进行使用和进一步开发。这表明从专有技术到开源资源的重大转变。通过放弃专有权，OrioleDB的创建者旨在促进协作、加速创新，并为Postgres数据库平台的发展做出贡献。此举可能会鼓励更广泛地采用OrioleDB概念和技术，通过社区贡献使OrioleDB项目本身受益，并通过访问有价值的技术进步使整个Postgres社区受益。这种可用性标志着对开源原则的承诺，并旨在推动Postgres数据库领域内的进步和创新。"
  },
  {
    "id": "45199378",
    "title": "The Origin Story of Merge Queues",
    "url": "https://mergify.com/blog/the-origin-story-of-merge-queues",
    "summary": "This article chronicles the evolution of merge queues, starting from early solutions born out of the need to keep main branches stable amid increasing developer activity. It traces the journey from manual processes and simple scripts like Ben Elliston's cron jobs and Graydon Hoare's Bors in the Rust project, to more sophisticated and automated tools.\n\nBors' success led to Homu, a more generic and open-source solution that maintained a tested integration branch, ensuring main was always a copy of code that passed tests. Bors-NG emerged as a modern successor to Homu, providing faster and more user-friendly merge queue functionality.\n\nSimultaneously, industry solutions like Bulldozer, Mergify, and Kodiak addressed the same problem, automating the process of merging and updating PRs. GitLab introduced Merge Trains as an integrated solution, and tech giants like Uber, Shopify, and Strava built internal merge queues to handle their large-scale development needs.\n\nFinally, GitHub recognized the value of merge queues and introduced its own native feature, mirroring the principles established by earlier solutions. This mainstream adoption marked a significant milestone, transforming a community hack into a standard feature for modern software development, improving developer experience, and ensuring code quality. The article demonstrates how merge queues have evolved from necessity to a standard practice in modern software development.\n",
    "chinese_title": "合并队列的起源",
    "chinese_summary": "本文记录了合并队列的演变历程，从早期为了在日益活跃的开发者活动中保持主分支稳定而诞生的解决方案开始。它追溯了从人工流程和简单脚本（如Ben Elliston的cron作业和Rust项目中Graydon Hoare的Bors）到更复杂和自动化工具的演变。\n\nBors的成功促成了Homu的出现，Homu是一个更通用和开源的解决方案，它维护了一个经过测试的集成分支，确保主分支始终是已通过测试的代码的副本。Bors-NG作为Homu的现代继任者出现，提供了更快、更友好的合并队列功能。\n\n与此同时，诸如Bulldozer、Mergify和Kodiak等行业解决方案也解决了相同的问题，自动化了合并和更新PR的过程。GitLab引入了Merge Trains作为集成解决方案，而像Uber、Shopify和Strava这样的科技巨头则构建了内部合并队列来处理其大规模的开发需求。\n\n最终，GitHub认识到了合并队列的价值，并引入了自己的原生功能，反映了早期解决方案所建立的原则。这种主流采用标志着一个重要的里程碑，将一个社区黑客行为转变为现代软件开发的标准功能，改善了开发者体验，并确保了代码质量。本文展示了合并队列如何从必需品演变为现代软件开发中的一种标准实践。"
  },
  {
    "id": "45199931",
    "title": "I didn't bring my son to a museum to look at screens",
    "url": "https://sethpurcell.com/writing/screens-in-museums/",
    "summary": "The author recounts a cherished childhood memory of visiting The Franklin Institute (TFI) in Philadelphia, emphasizing the engaging, hands-on exhibits that sparked a love of science. Returning with his son, he was disappointed to find the museum dominated by touchscreen-based exhibits and video games, a stark contrast to the tangible experiences he remembered.\n\nWhile acknowledging the presence of real artifacts and a few remaining hands-on exhibits, the author criticizes the museum's apparent prioritization of digital displays over physical ones. He argues that these screens fail to provide the same level of engagement and educational value as the original hands-on experiences, which he believes are crucial for fostering a child's understanding and appreciation of science. He notes that many of the physical exhibits are tucked away, poorly maintained, and sometimes even broken.\n\nThe author believes museums should offer real-world experiences and tangible interactions, especially in an age where children are already saturated with screen time. He suggests that TFI is misguided in its focus on digital displays, speculating that it may be an attempt to compete with screens for attention. He strongly urges TFI and other museums to eliminate touchscreen exhibits and reinvest in the tangible, interactive science displays that made museums like TFI such a valuable resource in the first place. Despite his disappointment, he acknowledges the museum's continued potential and hopes for a return to its original focus.\n",
    "chinese_title": "我带儿子去博物馆不是为了看屏幕的。",
    "chinese_summary": "作者回忆起童年时参观费城富兰克林学会（TFI）的美好记忆，强调了那些引人入胜的动手展览如何激发了他对科学的热爱。带着儿子重返故地，他失望地发现博物馆充斥着基于触摸屏的展览和电子游戏，与他记忆中那些真实的体验形成了鲜明对比。\n\n虽然承认博物馆中仍有一些真实的文物和少数保留下来的动手展览，但作者批评了博物馆似乎将数字展示置于实物展示之上的做法。他认为，这些屏幕无法提供与原始动手体验相同程度的参与度和教育价值，而他认为这些体验对于培养孩子对科学的理解和欣赏至关重要。他注意到，许多实物展品都被藏了起来，维护不善，有时甚至损坏。\n\n作者认为，博物馆应该提供真实世界的体验和切实的互动，尤其是在孩子们已经被屏幕时间过度饱和的时代。他认为TFI对数字展示的关注是错误的，并推测这可能是一种试图与屏幕竞争注意力的方式。他强烈敦促TFI和其他博物馆取消触摸屏展览，并重新投资于那些曾使TFI等博物馆成为宝贵资源的切实可互动的科学展示。尽管感到失望，但他承认博物馆仍然具有潜力，并希望它能回归最初的重点。"
  },
  {
    "id": "45199760",
    "title": "TikTok has turned culture into a feedback loop of impulse and machine learning",
    "url": "https://www.thenexus.media/tiktok-won-now-everything-is-60-seconds/",
    "summary": "This article argues that TikTok has revolutionized how culture is consumed by turning it into a feedback loop driven by impulse and machine learning. While concerns about TikTok's data collection persist, the author focuses on the platform's success in \"industrializing human attention.\"\n\nUnlike older media forms that relied on developed narratives, TikTok utilizes short videos and an algorithm that learns instantly from user micro-behaviors (hovering, swipe speed, etc.). This creates an uncannily perceptive recommender system that quickly adapts to user preferences.\n\nThe \"TikTok model\" is spreading, influencing news organizations, education, entertainment, and even music. Content is becoming shorter, snappier, and designed for immediate gratification and viral potential. Cultural consumption is now a form of algorithmic training, where users unknowingly teach machines how to efficiently deliver content.\n\nThe platform rewards hyper-specialization, pushing creators to perfect narrow niches. This focus on capturing attention through data and iteration has led to increasingly sophisticated methods of engagement.\n\nThe article concludes that while TikTok provides instant satisfaction and personalized content, it comes at the cost of the ability to be bored, to engage with incomplete thoughts, and to discover things serendipitously. Users are often unaware that their scrolling patterns are training an algorithm optimized for psychological grip rather than meaningful engagement.\n",
    "chinese_title": "TikTok已将文化变成冲动和机器学习的反馈循环。",
    "chinese_summary": "本文认为，TikTok已彻底改变了文化消费方式，将其转变为由冲动和机器学习驱动的反馈回路。尽管人们对TikTok的数据收集仍存担忧，但作者主要关注该平台在“工业化人类注意力”方面的成功。\n\n与依赖成熟叙事的老式媒体形式不同，TikTok利用短视频和一个能即时学习用户微行为（悬停、滑动速度等）的算法。这创造了一种异常敏锐的推荐系统，能够迅速适应用户偏好。\n\n“TikTok模式”正在蔓延，影响着新闻机构、教育、娱乐，甚至音乐。内容变得更短、更精悍，专为即时满足和病毒式传播而设计。文化消费现在是一种算法训练的形式，用户在不知不觉中教机器如何高效地传递内容。\n\n该平台奖励高度专业化，推动创作者完善狭窄的利基市场。这种通过数据和迭代来获取注意力的关注，导致了越来越复杂的参与方法。\n\n文章总结认为，虽然TikTok提供了即时满足和个性化内容，但其代价是丧失了无聊的能力、参与不完整思考的能力以及偶然发现事物的能力。用户往往没有意识到，他们的滚动模式正在训练一种算法，该算法针对心理控制而非有意义的参与进行了优化。"
  },
  {
    "id": "45200593",
    "title": "Bild AI (YC W25) Is Hiring",
    "url": "https://www.ycombinator.com/companies/bild-ai/jobs/m2ilR5L-founding-engineer-applied-ai",
    "summary": "Bild AI, a Y Combinator W25 startup, is seeking a Founding Engineer (Applied AI) to build AI that understands construction blueprints. This San Francisco-based role offers a $100K-$180K salary and 0.50%-2.00% equity. The ideal candidate has applied computer vision/machine learning experience and a \"0-to-1 builder\" mentality, with a focus on shipping quickly and iterating based on user feedback. Prior startup experience or a construction background are a plus.\n\nThe role involves working on the \"intelligence layer\" of the product, applying the latest computer vision, LLM models, and AI systems to tackle challenges in blueprint reading, cost estimation, and permit applications. Bild AI is looking for someone with a growth mindset, strong communication skills, and a willingness to \"schlep.\"\n\nBild AI, founded in 2024, uses a model-garden approach to blueprint understanding and is funded by top VCs. Founders Roop Pal and Puneet Sukhija emphasize a customer-obsessed approach to product development. Candidates should explain why they're a good fit and share their favorite fruit in their application message. The position requires full-time, in-office presence in San Francisco or a willingness to relocate.\n",
    "chinese_title": "Bild AI (YC W25) 正在招聘",
    "chinese_summary": "Bild AI 诚聘创始工程师（应用人工智能），构建理解建筑蓝图的人工智能。Bild AI 是一家 Y Combinator W25 孵化的初创公司，该职位位于旧金山，薪资范围为 10 万美元至 18 万美元，并提供 0.50% 至 2.00% 的股权。理想的候选人需具备应用计算机视觉/机器学习经验，并具有“从 0 到 1 的建设者”心态，注重快速交付并根据用户反馈迭代。 具有先前初创公司经验或建筑背景者优先。\n\n该职位涉及产品“智能层”的开发，应用最新的计算机视觉、LLM 模型和人工智能系统来解决蓝图解读、成本估算和许可证申请等方面的挑战。Bild AI 正在寻找具有成长型思维、强大沟通能力和愿意“努力付出”的人才。\n\nBild AI 成立于 2024 年，采用模型花园方法来理解蓝图，并获得顶级风险投资的支持。创始人 Roop Pal 和 Puneet Sukhija 强调以客户为中心的产品开发方法。应聘者应在申请信息中说明自己为何适合该职位，并分享他们最喜欢的水果。该职位要求全职在旧金山办公室工作或愿意搬迁。"
  },
  {
    "id": "45200118",
    "title": "Anthropic Services Down",
    "url": "https://status.anthropic.com/incidents/k6gkm2b8cjk9",
    "summary": "On September 10, 2025, Anthropic experienced a service outage impacting its core offerings: the API (api.anthropic.com), the Claude.ai platform (claude.ai), and the Anthropic Console (console.anthropic.com). The incident was first identified and reported at 16:28 UTC, indicating that all three services were down. Subsequent updates, posted at 16:37, 16:55, and 17:15 UTC, stated that a fix had been implemented and the Anthropic team was actively monitoring the results. The status page indicates that services were being restored as quickly as possible. Users can subscribe to updates for further information on the situation.\n",
    "chinese_title": "Anthropic 服务中断",
    "chinese_summary": "2025年9月10日，Anthropic公司发生服务中断，影响其核心产品：API（api.anthropic.com）、Claude.ai平台（claude.ai）和Anthropic控制台（console.anthropic.com）。该事件于UTC时间16:28首次被发现并报告，表明所有三项服务均已宕机。随后分别于UTC时间16:37、16:55和17:15发布的更新声明已实施修复，Anthropic团队正在积极监控结果。状态页面显示服务正在尽快恢复。用户可以订阅更新以获取有关情况的更多信息。"
  },
  {
    "id": "45192655",
    "title": "I replaced Animal Crossing's dialogue with a live LLM by hacking GameCube memory",
    "url": "https://joshfonseca.com/blogs/animal-crossing-llm",
    "summary": "Josh hacked Animal Crossing on a GameCube to replace the original dialogue with a live LLM, creating a bridge between the 2001 game and modern AI. Unable to modify the game code or use network calls due to the GameCube's limitations, he utilized Inter-Process Communication (IPC) via shared memory. He allocated a portion of the GameCube's RAM as a \"mailbox\" where a Python script could write AI-generated dialogue directly into the game.\n\nThe biggest challenge was finding stable memory addresses for dialogue text and speaker names, achieved through meticulous memory scanning. He also discovered that Animal Crossing uses a special encoded language, requiring him to create a Python encoder and decoder for proper communication.\n\nThe AI was built as a two-model pipeline: a \"Writer\" model focused on creative dialogue generation based on character sheets and context, and a \"Director\" model responsible for adding technical control codes for pauses, colors, emotions, and sound effects.\n\nHe integrated a lightweight news feed and a shared memory space for gossip, leading to villagers incorporating headlines and developing emergent behaviors, sometimes with unexpected and humorous consequences. The entire project's code is available on GitHub.\n",
    "chinese_title": "我通过破解GameCube内存，用实时LLM替换了动物森友会的对话。",
    "chinese_summary": "乔希破解了GameCube上的《动物森友会》，用实时LLM替换了原始对话，从而在2001年的游戏和现代AI之间架起了一座桥梁。由于GameCube的限制，无法修改游戏代码或使用网络调用，他利用共享内存实现了进程间通信(IPC)。他将GameCube的RAM分配出一部分作为“邮箱”，Python脚本可以将AI生成的对话直接写入游戏。\n\n最大的挑战是找到对话文本和说话者姓名的稳定内存地址，这通过细致的内存扫描实现。他还发现《动物森友会》使用一种特殊的编码语言，需要创建一个Python编码器和解码器才能进行适当的通信。\n\n该AI构建为一个双模型流水线：“作者”模型专注于基于人物设定和上下文的创意对话生成，而“导演”模型则负责添加用于暂停、颜色、情绪和音效的技术控制代码。\n\n他集成了一个轻量级的新闻源和一个用于闲聊的共享内存空间，导致村民们融入了新闻标题并发展出涌现行为，有时会产生意想不到的幽默后果。整个项目的代码都可以在GitHub上找到。"
  },
  {
    "id": "45192963",
    "title": "Show HN: TailGuard – Bridge your WireGuard router into Tailscale via a container",
    "url": "https://github.com/juhovh/tailguard",
    "summary": "TailGuard is a Docker container application that bridges existing WireGuard servers into a Tailscale network, useful when the WireGuard device can't run Tailscale directly. It allows devices connected to WireGuard to access the Tailscale network and vice versa.\n\n**Key Benefits:**\n\n*   **Centralized Key Management:** WireGuard private key is stored on a single machine (the TailGuard server).\n*   **Simplified Device Setup:** New devices connect to Tailscale via SSO, avoiding key transfers.\n*   **Flexible Exit Nodes:** Easy switching between Tailscale exit nodes.\n*   **Concurrent VPN Access:** Allows simultaneous WireGuard and Tailscale connections on devices with single VPN support.\n*   **Router Integration:** Connects home networks via WireGuard-only routers to Tailscale.\n\n**Installation:**\n\nThe easiest setup involves downloading a WireGuard client configuration (wg0.conf) and running the Docker container.  Docker commands are provided for creating a network and running the container, with instructions for obtaining a Tailscale login URL. Docker compose is also supported.\n\n**Advanced Configuration:**\n\nThe article details how to configure routing, including how to forward Tailscale traffic to a router behind the WireGuard tunnel and advertise routes to the Tailscale network. Environment variables (e.g., `TS_DEST_IP`, `TS_AUTHKEY`) can be used to customize the setup.\n\n**Two-Way Routing:**\n\nWhile TailGuard advertises WireGuard subnets to Tailscale automatically, manual routes need to be added to the WireGuard server to route Tailscale's private address spaces (100.64.0.0/10 and fd7a:115c:a1e0::/48) through the TailGuard node.\n\nThe project is MIT licensed.\n",
    "chinese_title": "Show HN: TailGuard – 通过容器将你的 WireGuard 路由器桥接到 Tailscale",
    "chinese_summary": "TailGuard：将 WireGuard 服务器桥接到 Tailscale 网络\n\n**主要优势：**\n\n*   **集中密钥管理：** WireGuard 私钥存储在单台机器（TailGuard 服务器）上。\n*   **简化设备设置：** 新设备通过 SSO 连接到 Tailscale，避免密钥传输。\n*   **灵活出口节点：** 轻松切换 Tailscale 出口节点。\n*   **并发 VPN 访问：** 允许在仅支持单个 VPN 的设备上同时进行 WireGuard 和 Tailscale 连接。\n*   **路由器集成：** 通过仅支持 WireGuard 的路由器将家庭网络连接到 Tailscale。\n\n**安装：**\n\n最简单的设置是下载 WireGuard 客户端配置 (wg0.conf) 并运行 Docker 容器。提供了用于创建网络和运行容器的 Docker 命令，以及获取 Tailscale 登录 URL 的说明。也支持 Docker Compose。\n\n**高级配置：**\n\n文章详细介绍了如何配置路由，包括如何将 Tailscale 流量转发到 WireGuard 隧道后的路由器，以及如何将路由通告到 Tailscale 网络。可以使用环境变量（例如，`TS_DEST_IP`、`TS_AUTHKEY`）来自定义设置。\n\n**双向路由：**\n\n虽然 TailGuard 会自动将 WireGuard 子网通告到 Tailscale，但需要在 WireGuard 服务器上手动添加路由，以通过 TailGuard 节点路由 Tailscale 的私有地址空间（100.64.0.0/10 和 fd7a:115c:a1e0::/48）。\n\n该项目采用 MIT 许可。"
  },
  {
    "id": "45196437",
    "title": "Kerberoasting",
    "url": "https://blog.cryptographyengineering.com/2025/09/10/kerberoasting/",
    "summary": "This article discusses Kerberoasting, a long-standing vulnerability in Microsoft's Active Directory (AD) that allows attackers to crack service account passwords and gain access to critical network resources. AD, a system that controls network access using Kerberos authentication, supports outdated cryptographic methods like RC4 and unsalted NT hashes, which make it susceptible to this attack.\n\nThe core problem is that when a user requests access to a network service, they receive an encrypted \"ticket\" using the service's password. If administrators use weak, human-generated passwords instead of strong cryptographic keys for these services, attackers can easily obtain these tickets and crack them offline through dictionary attacks.\n\nWhile modern systems encrypt these tickets with AES and PBKDF2, slowing down cracking, older systems fall back to RC4 and unsalted NT hashes, enabling attackers to guess billions of passwords per second using readily available hardware like RTX 5090 GPUs. This vastly increases the chances of a successful attack.\n\nDespite Kerberoasting being a known vulnerability for over a decade, Microsoft hasn't taken sufficiently strong action to mitigate it. Their recommendations to administrators are weak and passive, relying on administrators to manually enforce strong passwords and disable RC4, rather than proactively banning the obsolete, vulnerable options. The recent ransomware attack on Ascension Health hospital system demonstrates the real-world impact of this neglected vulnerability. The author argues that Microsoft needs to take a more aggressive approach to eliminate these legacy cryptographic weaknesses from Active Directory.\n",
    "chinese_title": "Kerberoasting\n克尔贝罗斯汀",
    "chinese_summary": "本文探讨了Kerberoasting攻击，这是微软Active Directory (AD)中一个长期存在的漏洞，攻击者可以利用它破解服务帐户密码，从而访问关键网络资源。 AD使用Kerberos认证控制网络访问，但它支持过时的加密方法，如RC4和无盐NT哈希，这使其容易受到此攻击。\n\n核心问题在于，当用户请求访问网络服务时，他们会收到一个使用该服务密码加密的“票据”。 如果管理员为这些服务使用弱的、人为生成的密码，而不是强大的加密密钥，攻击者就可以很容易地获得这些票据，并通过字典攻击离线破解它们。\n\n虽然现代系统使用AES和PBKDF2加密这些票据，从而减缓破解速度，但较旧的系统会回退到RC4和无盐NT哈希，使攻击者能够使用现成的硬件（如RTX 5090 GPU）每秒猜测数十亿个密码。 这大大增加了攻击成功的几率。\n\n尽管Kerberoasting作为一个已知漏洞已经存在十多年，但微软尚未采取足够强有力的措施来缓解它。 他们的建议是薄弱且被动的，依赖于管理员手动强制使用强密码并禁用RC4，而不是主动禁止过时的、易受攻击的选项。 最近Ascension Health医院系统遭受的勒索软件攻击表明了这种被忽视的漏洞在现实世界中的影响。 作者认为，微软需要采取更积极的方法来消除Active Directory中的这些遗留加密弱点。"
  },
  {
    "id": "45198420",
    "title": "We can’t circumvent the work needed to train our minds",
    "url": "https://zettelkasten.de/posts/the-scam-called-you-dont-have-to-remember-anything/",
    "summary": "Sascha argues that tools like search engines, note-taking apps, and AI falsely promise to eliminate the need for memorization and deep thinking. He contends that this reliance on external tools, without sufficient prior knowledge and critical thinking skills, actually *detrains* our brains and hinders our ability to process and understand information effectively.\n\nHe uses the example of digital natives, who often prioritize surface-level information and lack the critical thinking needed to evaluate online sources. This superficial engagement, devoid of emotional connection, prevents information from truly impacting the brain and forming a solid knowledge foundation.\n\nThe author uses ChatGPT to generate a fitness plan, then emphasizes that without prior knowledge, you cannot effectively evaluate its quality. He illustrates how deep understanding of a concept, like \"aerobic capacity,\" activates a vast network of related knowledge and enables critical assessment.\n\nSascha emphasizes that the bottleneck in knowledge work isn't access to information, but the internal processing power of our minds, which is developed through training and deep engagement with subjects. He concludes that true knowledge work requires remembering *everything* and training the mind for depth. He champions methods like spaced repetition and the Zettelkasten Method as ways to cultivate this cognitive ability, and criticizes the notion that we can shortcut the necessary mental work.\n",
    "chinese_title": "我们无法绕过训练心智所需付出的努力。",
    "chinese_summary": "萨沙认为，搜索引擎、笔记应用和人工智能等工具虚假地承诺消除记忆和深度思考的必要性。他认为，在缺乏充分的先验知识和批判性思维能力的情况下，过度依赖外部工具实际上会*削弱*我们的大脑，并阻碍我们有效处理和理解信息的能力。\n\n他以数字原住民为例，他们常常优先考虑表面信息，缺乏评估在线资源所需的批判性思维。这种缺乏情感联系的肤浅参与，阻碍了信息真正影响大脑并形成坚实的知识基础。\n\n作者使用ChatGPT生成健身计划，然后强调，如果没有先验知识，你就无法有效地评估其质量。他说明了对“有氧能力”等概念的深刻理解如何激活庞大的相关知识网络，并能够进行批判性评估。\n\n萨沙强调，知识工作的瓶颈不是获取信息，而是我们大脑的内部处理能力，这种能力是通过训练和对主题的深入参与来开发的。他总结说，真正的知识工作需要记住*所有事情*，并训练大脑以获得深度。他提倡间隔重复和Zettelkasten方法等方法，以培养这种认知能力，并批评了我们能够绕过必要的脑力劳动的观点。"
  },
  {
    "id": "45199031",
    "title": "Zoox launches its robotaxi service to the public in Las Vegas",
    "url": "https://zoox.com/journal/las-vegas",
    "summary": "Zoox, the Amazon-owned autonomous vehicle company, has officially launched its robotaxi service to the public in Las Vegas. This marks a significant milestone in the company's development and the broader autonomous vehicle industry.\n\nThe service allows passengers to hail Zoox's purpose-built, bidirectional robotaxis via an app and travel between designated stops throughout a limited service area in Las Vegas. These vehicles are designed for passenger comfort and safety, lacking traditional steering wheels and pedals, and equipped with advanced sensors and cameras for a 360-degree view of their surroundings.\n\nWhile the service is currently limited in scope, it demonstrates Zoox's progress in navigating complex urban environments and handling real-world driving scenarios. This public launch is a crucial step in gathering data, refining the technology, and ultimately expanding the service to more locations in the future.\n\nThis launch showcases the culmination of years of development and testing, positioning Zoox as a frontrunner in the burgeoning robotaxi market. It also highlights the company's commitment to transforming transportation through autonomous technology, aiming to provide a safer, more efficient, and potentially more accessible transportation option for the public. The rollout will be closely watched as it offers a glimpse into the future of urban mobility and the practical application of fully autonomous vehicles.\n",
    "chinese_title": "Zoox 在拉斯维加斯向公众推出无人驾驶出租车服务",
    "chinese_summary": "亚马逊旗下的自动驾驶汽车公司Zoox已在拉斯维加斯正式向公众推出其无人驾驶出租车服务。这标志着该公司发展以及更广泛的自动驾驶汽车行业的一个重要里程碑。\n\n乘客可以通过应用程序呼叫Zoox专门打造的双向无人驾驶出租车，并在拉斯维加斯有限服务区域内的指定站点之间出行。这些车辆专为乘客的舒适性和安全性而设计，没有传统方向盘和踏板，并配备了先进的传感器和摄像头，可以360度全方位观察周围环境。\n\n虽然该服务目前范围有限，但它展示了Zoox在复杂城市环境中导航和处理现实世界驾驶场景方面的进展。这次公开推出是收集数据、改进技术，并最终在未来将服务扩展到更多地点的关键一步。\n\n此次发布展示了多年开发和测试的成果，使Zoox成为新兴无人驾驶出租车市场的领跑者。它还突显了该公司致力于通过自动驾驶技术改变交通运输方式，旨在为公众提供更安全、更高效且可能更便捷的交通选择。这次推出将受到密切关注，因为它让我们得以一窥城市交通的未来以及完全自动驾驶汽车的实际应用。"
  },
  {
    "id": "45166655",
    "title": "Distributing your own scripts via Homebrew",
    "url": "https://justin.searls.co/posts/how-to-distribute-your-own-scripts-via-homebrew/",
    "summary": "This article is a guide to distributing your own command-line tools (CLIs) via Homebrew, the popular package manager for macOS. It acknowledges the initial complexity and confusion surrounding Homebrew's terminology and process.\n\nThe author outlines the steps required for distributing a CLI: creating a tap (a Git repository of formulae), creating a formula (package definition), and updating the formula for each CLI release. The article details how to create a tap using `brew tap-new`, connect it to a GitHub repository, and then create a formula using `brew create` and a tarball archive of a tagged release from GitHub.\n\nA significant portion of the guide focuses on customizing the formula, including using LLMs (ChatGPT) to troubleshoot and debug the initial generated formula. Key elements of a formula are highlighted, such as specifying the git repository, adding a livecheck, and including a simple test.\n\nThe article addresses the tediousness of manually updating the formula with new URLs and SHA hashes for each release. It provides a solution by offering a GitHub Actions workflow that automates the process of updating the tap repository whenever a new release is cut in the CLI's repository. This includes setting up a personal access token with write permissions, configuring repository secrets, and specifying environment variables.\n\nThe author concludes by emphasizing the ease of publishing additional CLI tools once the initial setup is complete, despite the initial complexities encountered.\n",
    "chinese_title": "通过 Homebrew 发布你自己的脚本",
    "chinese_summary": "本文旨在指导读者如何通过 Homebrew（macOS 上流行的软件包管理器）分发自己的命令行工具 (CLI)。文章承认 Homebrew 的术语和流程最初可能比较复杂，容易让人困惑。\n\n作者概述了分发 CLI 所需的步骤：创建 tap（包含 formulae 的 Git 仓库）、创建 formula（软件包定义），以及为每个 CLI 版本更新 formula。 文章详细介绍了如何使用 `brew tap-new` 创建 tap，将其连接到 GitHub 仓库，然后使用 `brew create` 和来自 GitHub 已标记版本的 tarball 归档创建 formula。\n\n指南的很大一部分侧重于自定义 formula，包括使用 LLM (ChatGPT) 对初始生成的 formula 进行故障排除和调试。 重点介绍了 formula 的关键要素，例如指定 git 仓库、添加 livecheck 以及包含一个简单的测试。\n\n文章还讨论了每次发布都手动更新包含新 URL 和 SHA 哈希的 formula 的繁琐性。它提供了一个解决方案，即提供一个 GitHub Actions 工作流程，以便在 CLI 仓库中创建新版本时自动更新 tap 仓库。 这包括设置具有写入权限的个人访问令牌、配置仓库密钥以及指定环境变量。\n\n作者最后强调，一旦完成初始设置，发布其他 CLI 工具就会变得容易，尽管最初会遇到一些复杂性。"
  },
  {
    "id": "45186015",
    "title": "iPhone Air",
    "url": "https://www.apple.com/newsroom/2025/09/introducing-iphone-air-a-powerful-new-iphone-with-a-breakthrough-design/",
    "summary": "The iPhone Air, announced September 9, 2025, is Apple's thinnest iPhone yet, featuring a breakthrough titanium design that's light, strong, and durable. It boasts a 6.5-inch Super Retina XDR display with ProMotion, the A19 Pro, N1, and C1X chips for pro performance and all-day battery life.\n\nThe phone includes a 48MP Fusion Main camera, an 18MP Center Stage front camera, and Ceramic Shield 2 for 3x better scratch resistance. Available in space black, cloud white, light gold, and sky blue, pre-orders start September 12, with availability on September 19.\n\nKey design features include a 5.6mm thickness, the Action button, and Camera Control. The improved Ceramic Shield covers both front and back, and the display boasts 3000 nits peak outdoor brightness. The Center Stage front camera offers a wide field of view and 4K HDR video, while the 48MP Fusion camera provides four lens options.\n\nThe A19 Pro chip delivers fast CPU and GPU performance, with Neural Accelerators for generative AI. The N1 chip enables Wi-Fi 7 and Bluetooth 6, while the C1X cellular modem is power-efficient. It has an eSIM-only design and runs on iOS 26 with Apple Intelligence.\n\nNew accessories include the iPhone Air Case with MagSafe, iPhone Air Bumper, Crossbody Strap, and iPhone Air MagSafe Battery. The phone is made with 35% recycled content and is part of Apple's 2030 carbon neutrality plan. Pricing starts at $999, with storage options of 256GB, 512GB, and 1TB.\n",
    "chinese_title": "iPhone Air",
    "chinese_summary": "iPhone Air于2025年9月9日发布，是苹果迄今为止最薄的iPhone，采用突破性的钛金属设计，轻巧、坚固且耐用。它拥有6.5英寸超视网膜XDR显示屏，支持ProMotion技术，配备A19 Pro、N1和C1X芯片，提供专业性能和全天候电池续航。\n\n该手机配备4800万像素融合主摄像头、1800万像素人物居中前置摄像头和第二代超瓷晶面板，抗刮擦性能提升3倍。提供深空黑色、云雾白色、浅金色和天空蓝色四种颜色，9月12日开始预购，9月19日上市。\n\n关键设计特性包括5.6毫米厚度、操作按钮和相机控制。改进的超瓷晶面板覆盖手机正面和背面，显示屏峰值户外亮度达到3000尼特。人物居中前置摄像头提供广阔的视野和4K HDR视频，而4800万像素融合摄像头提供四种镜头选项。\n\nA19 Pro芯片提供快速的CPU和GPU性能，并配备神经网络加速器，用于生成式AI。N1芯片支持Wi-Fi 7和蓝牙6，而C1X蜂窝调制解调器具有节能特性。它采用纯eSIM设计，运行iOS 26和Apple Intelligence。\n\n全新配件包括带MagSafe的iPhone Air保护壳、iPhone Air边框保护壳、斜挎带和iPhone Air MagSafe外接电池。该手机采用35%的回收材料制成，是苹果2030年碳中和计划的一部分。起售价为999美元，提供256GB、512GB和1TB的存储选项。"
  },
  {
    "id": "45155846",
    "title": "Show HN: CrabCamera – Cross-platform camera plugin for Tauri desktop apps",
    "url": "https://crates.io/crates/crabcamera",
    "summary": "CrabCamera is a cross-platform camera plugin designed for Tauri desktop applications. The title indicates it's being shared on Hacker News (\"Show HN\"). The content provided is just a link to the crates.io page, suggesting CrabCamera is a Rust crate. This means it's a reusable library or module written in Rust and published on the official Rust package registry (crates.io). Essentially, CrabCamera allows Tauri applications, which are already cross-platform desktop applications built with web technologies (like HTML, CSS, and JavaScript), to easily access and use camera functionalities on different operating systems. The crates.io link implies developers can install and integrate CrabCamera into their Tauri projects to add camera support.\n",
    "chinese_title": "Show HN: CrabCamera – Tauri 桌面应用跨平台相机插件",
    "chinese_summary": "CrabCamera：Tauri桌面应用跨平台相机插件（Show HN）。该插件是 crates.io 的链接，表明 CrabCamera 是一个 Rust crate。开发者可以将 CrabCamera 安装并集成到他们的 Tauri 项目中，以添加相机支持。"
  },
  {
    "id": "45197187",
    "title": "Guy running a Google rival from his laundry room",
    "url": "https://www.fastcompany.com/91396271/searcha-page-seekninja-diy-search-engines",
    "summary": "Okay, here's a summary of the Fast Company article \"Guy running a Google rival from his laundry room,\" based on the URL provided.\n\nThe article profiles Alec Chen, a self-taught programmer who is creating alternative search engines from his laundry room. He aims to offer niche search experiences tailored to specific needs, contrasting sharply with Google's broad, algorithm-driven approach. Chen's projects, *Searcha*, *Page*, and *SeekNinja*, each focus on different aspects of this philosophy.\n\n*Searcha* is a customizable search engine allowing users to specify the exact websites they want it to crawl, generating highly targeted results. This contrasts with Google's reliance on massive indexing and ranking algorithms. *Page* is a minimalist search engine focused solely on fetching the requested URL. *SeekNinja* is designed to be a more powerful and versatile search tool.\n\nThe article highlights Chen's DIY approach, emphasizing his independence from venture capital and corporate pressures. This freedom allows him to prioritize user control and data privacy, features often compromised by larger search companies. Chen views his work as a response to the increasing centralization of the internet and the limitations of dominant search engines like Google. The article presents Chen as a symbol of the growing movement towards decentralized and personalized search experiences.\n",
    "chinese_title": "在洗衣房运营谷歌竞争对手的家伙",
    "chinese_summary": "好的，以下是根据提供的网址对《快公司》文章“在洗衣房运营谷歌竞争对手的家伙”的总结：\n\n文章介绍了自学成才的程序员Alec Chen，他正在自己的洗衣房里创建替代搜索引擎。他的目标是提供针对特定需求的利基搜索体验，这与谷歌广泛的、算法驱动的方法形成鲜明对比。Chen的项目，*Searcha*、*Page*和*SeekNinja*，各自专注于这一哲学的不同方面。\n\n*Searcha*是一个可定制的搜索引擎，允许用户指定他们希望它抓取的精确网站，从而生成高度针对性的结果。这与谷歌依赖大规模索引和排名算法形成对比。*Page*是一个极简主义搜索引擎，仅专注于获取请求的URL。*SeekNinja*被设计成一个更强大和通用的搜索工具。\n\n文章强调了Chen的DIY方法，强调了他独立于风险投资和公司压力。这种自由使他能够优先考虑用户控制和数据隐私，这些特性通常被更大的搜索公司所牺牲。Chen将他的工作视为对互联网日益集中化以及像谷歌这样的主导搜索引擎的局限性的一种回应。文章将Chen呈现为日益增长的去中心化和个性化搜索体验运动的象征。"
  },
  {
    "id": "45199191",
    "title": "Microsoft PowerToys",
    "url": "https://learn.microsoft.com/en-us/windows/powertoys/",
    "summary": "Microsoft PowerToys is a free suite of utilities designed for power users to customize and enhance their Windows 10 and 11 experience for greater productivity. It offers a wide range of tools that address various needs, including window management (FancyZones, Always On Top), file exploration (File Explorer add-ons, Image Resizer, PowerRename, Peek), system utilities (Color Picker, PowerToys Run, Text Extractor, Awake, Hosts File Editor), input customization (Keyboard Manager, Quick Accent), mouse enhancements (Find My Mouse, Mouse Highlighter, Mouse Jump, Mouse Pointer Crosshairs, Mouse Without Borders), and more specialized functions (Advanced Paste, Command Palette, Crop And Lock, Environment Variables, File Locksmith, New+, Registry Preview, Screen Ruler, Shortcut Guide, Workspaces, ZoomIt).\n\nThe program is open-source, welcomes community contributions and includes a detailed contributor's guide. The tools aim to optimize workflows and provide functionalities not readily available in the standard Windows OS.\n\nPowerToys has evolved from a previous Windows 95 era project.\n",
    "chinese_title": "微软 PowerToys",
    "chinese_summary": "Microsoft PowerToys 是一款免费实用工具集，专为高级用户设计，用于自定义和增强其 Windows 10 和 11 体验，从而提高工作效率。它提供各种工具来满足不同需求，包括窗口管理（FancyZones、置顶）、文件浏览（文件资源管理器插件、图像大小调整器、PowerRename、Peek）、系统实用工具（颜色选择器、PowerToys Run、文本提取器、保持唤醒、Hosts 文件编辑器）、输入自定义（键盘管理器、快速字符）、鼠标增强功能（查找我的鼠标、鼠标高亮显示、鼠标跳转、鼠标指针十字线、鼠标无界）以及更专业的功能（高级粘贴、命令面板、裁剪并锁定、环境变量、文件解锁器、New+、注册表预览、屏幕标尺、快捷方式指南、工作区、ZoomIt）。\n\n该程序是开源的，欢迎社区贡献，并包含详细的贡献者指南。这些工具旨在优化工作流程，并提供标准 Windows 操作系统中不易获得的功能。\n\nPowerToys 来源于早期的 Windows 95 时代的项目。"
  },
  {
    "id": "45185756",
    "title": "E-paper display reaches the realm of LCD screens",
    "url": "https://spectrum.ieee.org/e-paper-display-modos",
    "summary": "Modos has announced a new open-source e-paper display with a refresh rate of 75 Hz. This is significant because it brings e-paper technology to performance levels comparable to basic LCD screens, a previously unattainable feat. The article highlights this breakthrough as a notable advancement in e-paper technology, potentially allowing for more dynamic and responsive applications than previously possible. The author, Matthew S. Smith, a contributing editor for IEEE Spectrum, notes the importance of this development for the future of display technology. In essence, this e-paper display represents a major step forward, blurring the lines between the traditional limitations of e-paper and the capabilities of LCD screens.\n",
    "chinese_title": "电子纸显示屏进入液晶屏领域",
    "chinese_summary": "Modos发布新型开源电子纸显示器，刷新率达75Hz。这一突破意义重大，因为它使电子纸技术性能达到可与基本LCD屏幕相媲美的水平，这是以前无法实现的。文章强调了这项突破是电子纸技术的显著进步，可能实现比以往更具动态性和响应性的应用。IEEE Spectrum的特约编辑Matthew S. Smith指出，这一发展对显示器技术的未来至关重要。本质上，这款电子纸显示器代表着向前迈出的一大步，模糊了电子纸传统局限性与LCD屏幕功能之间的界限。"
  },
  {
    "id": "45197608",
    "title": "Performance Improvements in .NET 10",
    "url": "https://devblogs.microsoft.com/dotnet/performance-improvements-in-net-10/",
    "summary": "This article previews performance improvements in .NET 10, drawing an analogy to Frederic Tudor's innovations in ice harvesting and preservation. Just as Tudor focused on numerous small optimizations that compounded into significant gains, .NET 10's performance improvements stem from shaving off nanoseconds and bytes across various areas.\n\nThe article highlights deabstraction improvements in the JIT compiler, specifically expanded escape analysis enabling stack allocation of objects and arrays. This reduces memory allocations and GC pressure, leading to faster execution. The example provided showcases how .NET 10 can eliminate the delegate allocation when creating a Func, and can stack allocate short lived arrays. This makes idiomatic C# code, using interfaces, foreach loops, and lambdas, run closer to the speed of hand-tuned code.\n\nThe author includes benchmark setups, with clear instructions for replicating results, and emphasizes that the displayed micro-benchmarks are designed to be reproducible, but that actual results may vary based on the environment.\n",
    "chinese_title": ".NET 10 性能提升",
    "chinese_summary": "本文预览.NET 10的性能提升，类比弗雷德里克·都铎在冰块采集和保存方面的创新。正如都铎专注于众多小型优化，累积成显著收益一样，.NET 10的性能改进源于在各个领域节省纳秒和字节。\n\n文章重点介绍了JIT编译器中消除抽象的改进，特别是扩展的逃逸分析，从而能够将对象和数组分配到栈上。这减少了内存分配和GC压力，从而加快了执行速度。提供的示例展示了.NET 10如何在创建Func时消除委托分配，并将短生命周期的数组分配到栈上。这使得使用接口、foreach循环和lambda表达式的惯用C#代码，运行速度更接近于手工调优的代码。\n\n作者包含了基准测试设置，并提供了复制结果的清晰说明，同时强调所展示的微基准测试旨在可重现，但实际结果可能因环境而异。"
  },
  {
    "id": "45154088",
    "title": "Knowledge and memory",
    "url": "https://www.robinsloan.com/lab/knowledge-and-memory/",
    "summary": "In this blog post, dated September 6, 2025, the author reflects on the difference between their own knowledge and the way language models (like Claude) \"know\" things, particularly regarding hallucinations. The author observes that while Claude readily hallucinates non-existent methods in programming languages like Ruby, they themselves don't.\n\nThe author attributes this difference to human memory being \"sedimentary,\" a process where knowledge is built up over time through experiences, creating a sense of context and connection. They can \"feel\" the solidity of their knowledge and the uncertainty of guesses, a \"proprioception\" of knowledge. This is contrasted with the current lack of understanding of the brain's physical mechanisms for memory.\n\nLanguage models, the author argues, lack this experiential memory. Their model weights are more akin to inherited DNA than lived experience, and the \"context window\" used by some engineers is likened to waking up with unfamiliar notes – useful, but disorienting.\n\nThe author concludes that true understanding, including the ability to distinguish between what is known and unknown, requires time, causal connections, and ultimately, a form of \"life\" or real-world experience. They predict that hallucinations in AI will persist until AI models can interact with and learn from the world in a more meaningful way.\n",
    "chinese_title": "知识与记忆",
    "chinese_summary": "在这篇2025年9月6日的博客文章中，作者反思了自身知识与语言模型（如Claude）“知道”事物的方式之间的区别，尤其是在幻觉方面。作者观察到，虽然Claude很容易在Ruby等编程语言中虚构不存在的方法，但他们自己不会。\n\n作者将这种差异归因于人类记忆的“沉积性”，这是一个知识通过经验随着时间积累的过程，从而产生一种语境和联系感。他们可以“感觉”到自己知识的稳固性和猜测的不确定性，一种知识的“本体感受”。这与目前对大脑记忆物理机制缺乏了解形成对比。\n\n作者认为，语言模型缺乏这种经验性的记忆。它们的模型权重更像是遗传的DNA，而不是生活经验，一些工程师使用的“上下文窗口”被比作醒来时发现不熟悉的笔记——有用，但令人迷惑。\n\n作者总结说，真正的理解，包括区分已知和未知的能力，需要时间、因果关系，最终，需要某种形式的“生命”或现实世界的经验。他们预测，在人工智能模型能够以更有意义的方式与世界互动和学习之前，人工智能中的幻觉现象将会持续存在。"
  },
  {
    "id": "45191347",
    "title": "NASA finds Titan's lakes may be creating vesicles with primitive cell walls",
    "url": "https://www.sciencedaily.com/releases/2025/08/250831112449.htm",
    "summary": "This NASA article, published in September 2025, explores the potential for life on Saturn's moon Titan. Researchers suggest that conditions in Titan's methane and ethane lakes could allow for the spontaneous formation of vesicles, structures resembling primitive cell walls.\n\nThe study, published in the International Journal of Astrobiology, proposes that amphiphile molecules, similar to those that form soap bubbles on Earth, could self-organize into bilayer vesicles within the hydrocarbon lakes. This process hinges on sea-spray droplets being coated in layers of amphiphiles, which then merge upon landing on the lake's surface, encapsulating the droplet within a double-layered membrane.\n\nThese vesicles, if formed, would represent an increase in order and complexity, considered necessary conditions for the origin of life. Such compartments could potentially lead to primitive protocells through interaction and competition, offering insights into how life might arise in environments drastically different from Earth.\n\nWhile NASA's upcoming Dragonfly mission to Titan won't directly detect these vesicles, it will contribute to understanding the moon's surface composition and habitability. The research highlights the significance of Titan in the search for extraterrestrial life and opens new avenues for future exploration and research.\n",
    "chinese_title": "美国宇航局发现土卫六的湖泊可能正在形成具有原始细胞壁的囊泡",
    "chinese_summary": "这篇美国宇航局2025年9月发表的文章探讨了土卫六泰坦上存在生命的潜力。研究人员认为，泰坦甲烷和乙烷湖中的条件可能允许囊泡的自发形成，这些结构类似于原始细胞壁。\n\n这项发表在《国际天体生物学杂志》上的研究提出，类似于地球上形成肥皂泡的两亲分子可能会在碳氢化合物湖中自组织成双层囊泡。这一过程取决于海浪飞沫被多层两亲分子包裹，这些分子在落在湖面后融合，将液滴封装在双层膜内。\n\n如果这些囊泡形成，将代表秩序和复杂性的增加，这被认为是生命起源的必要条件。这种分隔可能通过相互作用和竞争导致原始原细胞的产生，从而为了解生命如何在与地球截然不同的环境中产生提供见解。\n\n虽然美国宇航局即将进行的“蜻蜓”号泰坦探测任务不会直接探测到这些囊泡，但它将有助于了解这颗卫星的表面成分和宜居性。该研究强调了泰坦在寻找地外生命中的重要性，并为未来的探索和研究开辟了新的途径。"
  },
  {
    "id": "45163417",
    "title": "Rendering flame fractals with a compute shader (2023)",
    "url": "https://wrighter.xyz/blog/2023_08_17_flame_fractals_in_comp_shader",
    "summary": "This 2023 article discusses the process of rendering flame fractals using a compute shader. Flame fractals, known for their complex and visually appealing designs, are computationally intensive to render traditionally. Leveraging a compute shader offers a parallelized approach, significantly speeding up the rendering process.\n\nThe article likely explains the mathematical foundations of flame fractals, highlighting the iterative function systems (IFS) and their transformations that define the fractal's structure. It probably delves into how these transformations are encoded and applied within the compute shader.\n\nThe key advantage of using a compute shader is the ability to execute the fractal generation algorithm in parallel on the GPU. The article likely describes how the work items (individual threads) within the compute shader are responsible for calculating the color and position of individual pixels, independently contributing to the final image.\n\nFurthermore, the article probably touches upon optimization techniques used to improve performance, such as memory management and minimizing data transfer between the CPU and GPU. It may also explore different rendering techniques, like using multiple iterations or adjusting parameters to achieve varying visual effects.\n\nIn essence, the article provides a practical guide to rendering flame fractals efficiently using the power of compute shaders, covering the underlying math, the shader implementation, and potential optimization strategies.\n",
    "chinese_title": "使用计算着色器渲染火焰分形 (2023)",
    "chinese_summary": "本文讨论了2023年使用计算着色器渲染火焰分形的过程。 火焰分形以其复杂和视觉上吸引人的设计而闻名，传统渲染在计算上非常密集。 利用计算着色器提供了一种并行化方法，可显著加快渲染过程。\n\n该文章可能解释了火焰分形的数学基础，重点介绍了迭代函数系统 (IFS) 及其定义分形结构的转换。 它可能深入研究了这些转换如何在计算着色器中进行编码和应用。\n\n使用计算着色器的主要优势在于能够在 GPU 上并行执行分形生成算法。 该文章可能描述了计算着色器中的工作项（单个线程）如何负责计算单个像素的颜色和位置，从而独立地为最终图像做出贡献。\n\n此外，该文章可能涉及用于提高性能的优化技术，例如内存管理和最大限度地减少 CPU 和 GPU 之间的数据传输。 它还可能探索不同的渲染技术，例如使用多次迭代或调整参数以实现不同的视觉效果。\n\n本质上，该文章提供了一个实用指南，指导如何利用计算着色器的强大功能有效地渲染火焰分形，涵盖了底层数学、着色器实现和潜在的优化策略。"
  },
  {
    "id": "45195520",
    "title": "Pontevedra, Spain declares its entire urban area a \"reduced traffic zone\"",
    "url": "https://www.greeneuropeanjournal.eu/made-for-people-not-cars-reclaiming-european-cities/",
    "summary": "Pontevedra, Spain, has transformed its entire urban area into a \"reduced traffic zone,\" prioritizing pedestrians over cars and defying the trend of increasing vehicle numbers in Europe. Led by Mayor Miguel Anxo Fernández Lores since 1999, the city's policies aim to reclaim public space, improve air quality, and enhance accessibility for residents.\n\nInstead of implementing a Low Emission Zone like other Spanish cities following a national decree, Pontevedra took a more radical approach. Transit traffic is prohibited, and only \"necessary traffic\" like emergency vehicles, public services, and vehicles accessing private garages are permitted 24/7. Loading and unloading are restricted to specific hours, and fines are issued for violations.\n\nThis approach has led to a 40% reduction in overall traffic, the elimination of fatal road accidents for a decade, and a significant increase in walking and cycling. CO2 emissions have also been reduced by approximately 67%. The city center now prioritizes pedestrians, with indistinguishable roads and sidewalks, and encourages a compact, mixed-use urban environment.\n\nPontevedra's success has inspired other cities and highlights the potential of prioritizing people over cars to create safer, healthier, and more vibrant urban spaces. The city offers free parking on the periphery and provides resources like the Metrominuto map, encouraging walking by providing steps and calorie information. Residents and business owners report the system's success stems from its convenience and positive impact on local commerce.\n",
    "chinese_title": "西班牙蓬特韦德拉宣布整个市区为“限行区”",
    "chinese_summary": "西班牙蓬特韦德拉市将其整个城区改造为“限行区”，优先考虑行人而非车辆，挑战了欧洲车辆数量不断增长的趋势。自 1999 年以来，在市长米格尔·安克索·费尔南德斯·洛雷斯领导下，该市的政策旨在收回公共空间、改善空气质量并提高居民的出行便利性。\n\n与其他西班牙城市遵循国家法令实施低排放区不同，蓬特韦德拉采取了更为激进的方式。禁止过境交通，只有“必要交通”，如紧急车辆、公共服务车辆和进入私人车库的车辆，才允许 24/7 通行。装卸货时间受到限制，违规者将被处以罚款。\n\n这种做法使总体交通量减少了 40%，十年来消除了致命的道路交通事故，并显著增加了步行和自行车出行。二氧化碳排放量也减少了约 67%。市中心现在优先考虑行人，道路和人行道难以区分，并鼓励紧凑型、混合用途的城市环境。\n\n蓬特韦德拉的成功启发了其他城市，并突显了优先考虑人而非车辆在创造更安全、更健康、更充满活力的城市空间方面的潜力。该市在外围提供免费停车位，并提供诸如 Metrominuto 地图之类的资源，通过提供步数和卡路里信息来鼓励步行。居民和企业主表示，该系统的成功源于其便利性和对当地商业的积极影响。"
  },
  {
    "id": "45200024",
    "title": "\"No Tax on Tips\" Includes Digital Creators, Too",
    "url": "https://www.hollywoodreporter.com/business/business-news/no-tax-on-tips-guidance-creators-trump-treasury-1236366513/",
    "summary": "This article discusses how the \"No Tax on Tips\" policy, stemming from President Trump's act, could significantly impact the creator economy. The U.S. Treasury Department has included \"digital content creators\" – such as podcasters, social media influencers, and streamers – in the list of professions eligible for the tax deduction on tipped income.\n\nThis inclusion incentivizes creators to prioritize receiving tips and gifts from their audience over other income streams like subscription revenue, as only tip income qualifies for the deduction. Platforms like TikTok, YouTube, and Twitch may start promoting tipping options more prominently.\n\nWhile there are limitations to the deduction, including a $25,000 cap per year and income phase-outs for higher earners (starting at $150,000 for single filers and $300,000 for married couples), the change could still alter how creators seek income. Some restrictions apply regarding the business type and fields like performing arts, limiting the deduction.\n\nUltimately, the inclusion of digital creators in this policy acknowledges their growing influence in media and politics and might encourage more individuals to enter or expand their presence in the creator space, focusing on generating tip-based income. The article suggests this shift could be felt across the creator economy as creators become more adept at requesting and securing tips from their audience.\n",
    "chinese_title": "小费免税也包括数字内容创作者",
    "chinese_summary": "本文探讨了源于特朗普总统法案的“小费免税”政策如何能显著影响创作者经济。美国财政部已将“数字内容创作者”——例如播客、社交媒体影响者和流媒体主播——纳入有资格享受小费收入税收减免的职业名单。\n\n这一纳入激励创作者优先考虑从受众处获得小费和礼物，而不是其他收入来源，如订阅收入，因为只有小费收入才有资格获得税收减免。像TikTok、YouTube和Twitch这样的平台可能会开始更突出地推广小费选项。\n\n虽然这项减免存在限制，包括每年25,000美元的上限，以及针对高收入者的收入递减（单身申报者从150,000美元开始，已婚夫妇从300,000美元开始），但这一变化仍然可能改变创作者寻求收入的方式。某些限制适用于业务类型和表演艺术等领域，限制了减免。\n\n最终，将数字创作者纳入这项政策承认了他们在媒体和政治领域日益增长的影响力，并可能鼓励更多人进入或扩大他们在创作者领域的影响力，专注于产生基于小费的收入。本文认为，随着创作者越来越善于向观众索取和获得小费，这种转变可能会在整个创作者经济中感受到。"
  },
  {
    "id": "45182381",
    "title": "Claude now has access to a server-side container environment",
    "url": "https://www.anthropic.com/news/create-files",
    "summary": "Anthropic has announced a new feature for Claude that allows it to create and edit files directly within the platform, including Excel spreadsheets, documents, PowerPoint presentations, and PDFs. This \"file creation\" capability, currently in preview for Max, Team, and Enterprise plan users (coming soon to Pro users), enables Claude to perform tasks like data analysis, spreadsheet generation, and cross-format conversion based on user instructions and uploaded data.\n\nClaude can now take raw data and produce polished reports with statistical analysis and charts. It can also create financial models, project trackers, and budget templates with working formulas in spreadsheets. Furthermore, it can convert a PDF report into a PowerPoint presentation or organize invoices into spreadsheets. This is made possible by giving Claude access to a private computer environment where it can write code and run programs.\n\nTo use the feature, users must enable \"Upgraded file creation and analysis\" in settings, upload relevant files or describe their needs, and then guide Claude through the process via chat. Completed files can be downloaded or saved directly to Google Drive. Anthropic advises users to monitor chats closely when using this feature due to potential data security risks associated with Claude's internet access. The company envisions this as a significant step towards making complex, multi-step work accessible through conversational interfaces.\n",
    "chinese_title": "克劳德现在可以访问服务器端的容器环境了。",
    "chinese_summary": "Anthropic 推出 Claude 新功能，可直接在平台内创建和编辑文件，包括 Excel 表格、文档、PowerPoint 演示文稿和 PDF。这项“文件创建”功能目前正面向 Max、Team 和 Enterprise 计划用户进行预览（即将面向 Pro 用户推出），使 Claude 能够根据用户指令和上传的数据执行数据分析、电子表格生成和跨格式转换等任务。\n\n现在，Claude 可以利用原始数据生成包含统计分析和图表的润色报告。它还可以创建包含工作公式的电子表格，例如财务模型、项目跟踪器和预算模板。此外，它还可以将 PDF 报告转换为 PowerPoint 演示文稿，或将发票整理到电子表格中。这得益于 Claude 可以访问一个私有计算机环境，在该环境中它可以编写代码并运行程序。\n\n要使用该功能，用户必须在设置中启用“升级的文件创建和分析”，上传相关文件或描述其需求，然后通过聊天引导 Claude 完成该过程。 完成的文件可以直接下载或保存到 Google Drive。 Anthropic 建议用户在使用此功能时密切监控聊天，因为 Claude 的互联网访问可能存在数据安全风险。 该公司认为这是通过对话界面实现复杂、多步骤工作的重要一步。"
  },
  {
    "id": "45182657",
    "title": "US High school students' scores fall in reading and math",
    "url": "https://apnews.com/article/naep-reading-math-scores-12th-grade-c18d6e3fbc125f12948cc70cb85a520a",
    "summary": "The recent National Assessment of Education Progress (NAEP) results, known as the nation's report card, reveal a continuing decline in US high school students' math and reading performance, with 12th-grade scores hitting a 20-year low. Eighth-grade science scores also dropped significantly. Experts attribute the decline to a combination of factors, including the pandemic's impact, increased screen time, shorter attention spans, and a shift in educational approaches emphasizing shorter texts.\n\nThe report highlights that a growing percentage of students are not achieving \"basic\" proficiency in these subjects, impacting their preparedness for future academics and careers. This trend coincides with a widening achievement gap between high and low-performing students and a re-emergence of the gender gap in STEM, with girls experiencing steeper score declines since the pandemic.\n\nEducation Secretary Linda McMahon pointed to the scores as evidence that states should have greater control of education spending. House Democrats, however, argued for increased federal investment in academic recovery and equity. The NAEP scores reflect tests taken between January and March 2024.\n",
    "chinese_title": "美国高中生阅读和数学成绩下降",
    "chinese_summary": "近期发布的全国教育进步评估（NAEP）结果，即“国家成绩单”，显示美国高中生数学和阅读成绩持续下降，12年级得分跌至20年来最低点。八年级科学成绩也显著下降。专家认为，成绩下滑是多种因素共同作用的结果，包括疫情的影响、屏幕使用时间增加、注意力持续时间缩短，以及教育方法向强调短文本的转变。\n\n该报告强调，越来越多的学生未能达到这些学科的“基本”熟练程度，影响了他们为未来学业和职业做准备。这一趋势与高低分学生之间日益扩大的成绩差距，以及STEM领域性别差距的再次出现同时发生，其中女孩自疫情以来成绩下降幅度更大。\n\n教育部长琳达·麦克马洪指出，这些分数证明各州应该对教育支出拥有更大的控制权。然而，众议院民主党人则主张增加联邦政府对学术复苏和公平的投资。NAEP分数反映的是2024年1月至3月期间进行的测试。"
  },
  {
    "id": "45171733",
    "title": "All clickwheel iPod games have now been preserved for posterity",
    "url": "https://arstechnica.com/gaming/2025/09/all-54-lost-clickwheel-ipod-games-have-now-been-preserved-for-posterity/",
    "summary": "A community of classic iPod enthusiasts, led by GitHub user Olsro, has successfully preserved all 54 official clickwheel games that Apple sold in the late 2000s. These games were previously locked behind Apple's FairPlay DRM and at risk of being lost due to server shutdowns, hardware failures, and Apple ID issues.\n\nThe project involved syncing multiple iTunes accounts containing the games to a single \"master library\" within a Virtual Machine (VM). This process, though complex and fraught with technical difficulties and unexpected hardware failures, allows for the creation of playable copies that can be synced to iPod 5G+ or iPod Nano 3G+ devices offline.\n\nThe final game to be preserved was \"Real Soccer 2009,\" a process Olsro described as \"especially cursed.\" With all games now secured, the community provides instructions on setting up a VM or downloading a torrented archive to access the complete collection. The preservation effort not only ensures the survival of this piece of Apple's gaming history but also provides valuable resources for security and DRM researchers. It also offers a dose of nostalgia for gamers who grew up with these titles, as highlighted by a Reddit user whose introduction to the Sonic franchise was the iPod version.\n",
    "chinese_title": "所有滚轮iPod游戏现已永久保存。",
    "chinese_summary": "由GitHub用户Olsro带领的经典iPod爱好者社区成功保存了苹果公司在2000年代后期销售的所有54款官方转盘游戏。这些游戏之前受到苹果FairPlay DRM保护，并面临因服务器关闭、硬件故障和Apple ID问题而丢失的风险。\n\n该项目涉及将多个包含游戏的iTunes账户同步到虚拟机(VM)中的一个“主库”。尽管这一过程复杂且充满技术困难和意外的硬件故障，但它允许创建可玩的副本，这些副本可以离线同步到iPod 5G+或iPod Nano 3G+设备。\n\n最后被保存的游戏是“Real Soccer 2009”，Olsro称这个过程“尤其困难”。现在所有游戏都已安全保存，该社区提供了设置虚拟机或下载种子存档以访问完整收藏的说明。这项保护工作不仅确保了苹果游戏历史的这一部分得以保存，还为安全和DRM研究人员提供了宝贵的资源。对于那些从小玩这些游戏的玩家来说，这也带来了一丝怀旧之情，一位Reddit用户就表示，他对索尼克系列的最初印象就是iPod版本。"
  },
  {
    "id": "45192194",
    "title": "R-Zero: Self-Evolving Reasoning LLM from Zero Data",
    "url": "https://arxiv.org/abs/2508.05004",
    "summary": "This paper introduces R-Zero, a novel framework for self-evolving Large Language Models (LLMs) that learns reasoning from scratch without any human-curated data, tasks, or labels. The core idea is to create a fully autonomous system where two LLMs, a \"Challenger\" and a \"Solver,\" co-evolve through interaction.\n\nThe Challenger is incentivized to generate tasks that are just beyond the Solver's current capabilities, pushing its boundaries. The Solver, in turn, is rewarded for successfully solving the increasingly difficult problems posed by the Challenger. This creates a targeted, self-improving curriculum.\n\nR-Zero initializes with a single base LLM (e.g., Qwen3-4B-Base) and optimizes the Challenger and Solver models independently. The system then iteratively generates training data and refines the models based on their performance.\n\nEmpirical results demonstrate that R-Zero significantly improves the reasoning abilities of different backbone LLMs. For example, R-Zero boosted the Qwen3-4B-Base model's performance by +6.49 on math-reasoning benchmarks and +7.54 on general-domain reasoning benchmarks. This demonstrates the potential of autonomous self-evolution for advancing LLM capabilities beyond those achievable through traditional supervised learning approaches. The authors suggest this method bypasses the limitations of relying on human-annotated data, paving the way towards developing AI systems with superhuman intelligence.\n",
    "chinese_title": "R-Zero：零数据自进化推理大模型",
    "chinese_summary": "本文介绍了一种名为R-Zero的新型自进化大型语言模型(LLM)框架，该框架从零开始学习推理，无需任何人工策划的数据、任务或标签。其核心思想是创建一个完全自主的系统，其中两个LLM，“挑战者”和“解决者”，通过互动共同进化。\n\n挑战者被激励去生成超出解决者当前能力的任务，从而拓展其界限。反过来，解决者因成功解决挑战者提出的日益困难的问题而获得奖励。这创造了一个有针对性的、自我完善的课程。\n\nR-Zero使用单个基础LLM（例如，Qwen3-4B-Base）初始化，并独立优化挑战者和解决者模型。然后，该系统迭代地生成训练数据，并根据其性能改进模型。\n\n实证结果表明，R-Zero显著提高了不同骨干LLM的推理能力。例如，R-Zero使Qwen3-4B-Base模型在数学推理基准测试中的性能提高了+6.49，在通用领域推理基准测试中的性能提高了+7.54。这证明了自主自进化在提升LLM能力方面的潜力，超越了传统监督学习方法所能实现的水平。作者认为，这种方法绕过了依赖人工标注数据的限制，为开发具有超人智能的AI系统铺平了道路。"
  },
  {
    "id": "45183029",
    "title": "We all dodged a bullet",
    "url": "https://xeiaso.net/notes/2025/we-dodged-a-bullet/",
    "summary": "The article, titled \"We all dodged a bullet,\" consists of a message indicating the page is trying to verify if the user is a robot. It states \"正在确认你是不是机器人！ 加载中...请稍等，我们需要在继续之前检查您的连接安全性。\" which translates to \"Verifying if you are a robot! Loading... Please wait, we need to check your connection security before continuing.\"\n\nTherefore, the \"article\" is essentially a security check and loading screen, suggesting the content is gated behind a CAPTCHA or similar anti-bot measure. It implies a potential threat (dodging a bullet) which is likely related to automated access or malicious activity. No actual content about what threat was dodged is provided, only the verification process.\n",
    "chinese_title": "我们都躲过了一劫。",
    "chinese_summary": "文章标题为“我们都躲过了一劫”，内容显示页面正在验证用户是否为机器人，提示“正在确认你是不是机器人！ 加载中...请稍等，我们需要在继续之前检查您的连接安全性。” 因此，该“文章”本质上是一个安全检查和加载界面，表明内容受到验证码或类似的反机器人措施保护。它暗示了一种潜在威胁（躲过一劫），这可能与自动化访问或恶意活动有关。 没有提供关于躲过什么威胁的实际内容，只有验证过程。"
  },
  {
    "id": "45198481",
    "title": "Jiratui – A Textual UI for interacting with Atlassian Jira from your shell",
    "url": "https://jiratui.sh/",
    "summary": "JiraTUI is a command-line interface that revolutionizes Jira task management for developers. It allows users to interact with Jira directly from the terminal, streamlining workflows and enhancing productivity. Key features include the ability to search, create, and update tasks, manage comments, handle related tasks, and perform advanced searches using JQL (Jira Query Language).\n\nJiraTUI offers several advantages: it's highly configurable, allowing users to customize shortcuts and settings; it provides a simple and intuitive command-line interface, eliminating unnecessary navigation; it's fast, enabling rapid execution of commands for efficient task management; and it's easy to use, with a clear command structure suitable for developers of all skill levels.\n\nBy enabling seamless task management without leaving the terminal, JiraTUI empowers developers to stay focused on their code, ultimately saving time and improving overall productivity. The software also facilitates team collaboration through comment management. The website provides links to documentation, licensing information, contribution guidelines, and issue reporting.\n",
    "chinese_title": "Jiratui – 从命令行与Atlassian Jira交互的文本用户界面",
    "chinese_summary": "JiraTUI：一款变革开发者Jira任务管理的命令行界面。它允许用户直接从终端与Jira交互，简化工作流程并提高生产力。主要功能包括搜索、创建和更新任务，管理评论，处理相关任务，以及使用JQL（Jira查询语言）执行高级搜索。\n\nJiraTUI具有以下几个优点：高度可配置，允许用户自定义快捷键和设置；提供简洁直观的命令行界面，消除不必要的导航；速度快，能够快速执行命令以实现高效的任务管理；易于使用，具有清晰的命令结构，适合所有技能水平的开发者。\n\n通过实现无需离开终端的无缝任务管理，JiraTUI使开发者能够专注于代码，最终节省时间并提高整体生产力。该软件还通过评论管理促进团队协作。网站提供文档、许可信息、贡献指南和问题报告的链接。"
  },
  {
    "id": "45200357",
    "title": "'Block Everything' protests sweep across France, scores arrested",
    "url": "https://www.reuters.com/world/europe/block-everything-protests-sweep-across-france-scores-arrested-2025-09-10/",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "“封锁一切”抗议席卷法国，多人被捕",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "45194165",
    "title": "Children and young people's reading in 2025",
    "url": "https://literacytrust.org.uk/research-services/research-reports/children-and-young-peoples-reading-in-2025/",
    "summary": "This 2025 report, based on a survey of nearly 115,000 children and young people aged 5-18, reveals a continuing decline in reading enjoyment and frequency. Reading enjoyment has reached a 20-year low, with only 32.7% of 8- to 18-year-olds enjoying reading in their free time – a 36% drop since 2005. This decline is particularly sharp among primary-aged children and boys, especially those aged 11-16.\n\nDaily reading frequency is also at its lowest recorded level, with only 18.7% of 8- to 18-year-olds reading daily, a decrease of almost 20 percentage points since 2005. Even among 5- to 8-year-olds, daily reading rates have fallen. A widening gender gap shows girls reading more frequently than boys. Children receiving Free School Meals (FSMs) also read less frequently than their peers.\n\nThe report identifies potential motivators to reignite reading interest. Linking reading material to favorite films, TV shows, or personal interests/hobbies motivates approximately 40% of children and young people. An appealing book cover or title attracts around 30%, while the freedom to choose reading material is valued by about 25%. Even children with low reading enjoyment acknowledge reading's educational value. They also engage with various forms of reading, such as song lyrics and comics, suggesting that aligning reading with their interests and cultural preferences could re-engage them.\n",
    "chinese_title": "2025年儿童青少年阅读",
    "chinese_summary": "这份基于对近11.5万名5-18岁儿童和青少年调查的2025年报告显示，阅读乐趣和频率持续下降。阅读乐趣已降至20年来的最低点，只有32.7%的8-18岁儿童和青少年在空闲时间喜欢阅读，自2005年以来下降了36%。这种下降在小学年龄儿童和男孩中尤为明显，尤其是11-16岁的男孩。\n\n每日阅读频率也处于有记录以来的最低水平，只有18.7%的8-18岁儿童和青少年每天阅读，自2005年以来下降了近20个百分点。即使在5-8岁的儿童中，每日阅读率也有所下降。日益扩大的性别差距表明女孩比男孩更频繁地阅读。领取免费校餐（FSMs）的儿童阅读频率也低于同龄人。\n\n该报告确定了可能重新激发阅读兴趣的潜在激励因素。将阅读材料与最喜欢的电影、电视节目或个人兴趣/爱好联系起来，可以激励大约40%的儿童和青少年。吸引人的书籍封面或标题吸引了大约30%的人，而选择阅读材料的自由对大约25%的人来说很有价值。即使是阅读乐趣较低的儿童也承认阅读的教育价值。他们还参与各种形式的阅读，如歌曲歌词和漫画，这表明将阅读与他们的兴趣和文化偏好相结合可以重新吸引他们。"
  },
  {
    "id": "45156480",
    "title": "Memory Safety in ProcASM",
    "url": "https://temware.site/html/blogs/procasm_memory_safety.html",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "ProcASM 中的内存安全",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "45186265",
    "title": "Memory Integrity Enforcement",
    "url": "https://security.apple.com/blog/memory-integrity-enforcement/",
    "summary": "This article details Apple's Memory Integrity Enforcement (MIE), a comprehensive memory safety defense built into Apple silicon and iOS. MIE represents a significant advancement in memory safety, aiming to protect against memory corruption vulnerabilities exploited by even sophisticated attackers like those using mercenary spyware.\n\nKey components of MIE include:\n\n*   **Secure Memory Allocators:** Type-aware allocators like kalloc_type and xzone malloc organize memory to hinder memory corruption techniques.\n*   **Enhanced Memory Tagging Extension (EMTE):** A hardware-based memory tagging system that detects memory corruption by tagging allocations with secrets and enforcing that memory accesses use the correct tag. MIE uses EMTE in synchronous mode for always-on protection.\n*   **Tag Confidentiality Enforcement:** Protecting the confidentiality of EMTE tags and secure allocator implementations, including against side-channel and speculative-execution attacks.\n\nMIE is designed to be always-on and synchronous, blocking memory corruption attempts immediately. Unlike some other MTE implementations, Apple's EMTE checks both tagged and non-tagged memory, making it harder for attackers to bypass the system. Moreover, they developed novel mitigation methods that limit the effective reach of Spectre V1 leaks – at virtually zero CPU cost.\n\nApple emphasizes that MIE is a hardware-software co-design, requiring significant resources in Apple silicon and deep integration with the operating system. It leverages secure allocators to reduce the scope where EMTE is needed, optimizing performance.\n",
    "chinese_title": "内存完整性强制执行",
    "chinese_summary": "本文详细介绍了苹果的内存完整性强制执行（MIE），这是一种内置于苹果芯片和iOS中的全面内存安全防御机制。MIE代表了内存安全方面的重大进步，旨在防御内存损坏漏洞，即使是使用雇佣间谍软件等复杂攻击者也难以利用。\n\nMIE的关键组件包括：\n\n*   **安全内存分配器：** 诸如kalloc_type和xzone malloc之类的类型感知分配器可组织内存，以阻止内存损坏技术。\n*   **增强型内存标记扩展（EMTE）：** 一种基于硬件的内存标记系统，通过用密钥标记分配并强制内存访问使用正确的标记来检测内存损坏。MIE在同步模式下使用EMTE，以实现始终开启的保护。\n*   **标记保密性强制执行：** 保护EMTE标记和安全分配器实现的机密性，包括防御侧信道和推测执行攻击。\n\nMIE旨在始终开启并同步运行，立即阻止内存损坏尝试。与某些其他MTE实现不同，苹果的EMTE会检查标记和未标记的内存，从而使攻击者更难绕过该系统。此外，他们还开发了新型缓解方法，可以限制Spectre V1泄露的有效范围——几乎不占用任何CPU成本。\n\n苹果强调，MIE是一种硬件与软件协同设计，需要在苹果芯片中投入大量资源，并与操作系统进行深度集成。它利用安全分配器来减少需要EMTE的范围，从而优化性能。"
  },
  {
    "id": "45154142",
    "title": "Axial twist theory",
    "url": "https://en.wikipedia.org/wiki/Axial_twist_theory",
    "summary": "The Axial Twist Theory proposes that vertebrate body plans, including humans, feature a \"twisted\" configuration where the head's rostral part (face and forebrain) is rotated relative to the rest of the body, which exhibits a left-handed chirality. This twist aims to explain various anatomical phenomena, including contralateral brain organization (left brain controls right body), the left-sided heart, asymmetrical organ placement, and nerve crossings like the optic chiasm.\n\nWhile not universally accepted, the theory suggests the anterior head rotates against the body during embryological development, effectively flipping left/right and anterior/posterior in the forebrain and face. Embryological evidence from zebrafish and chicks supports this twist occurring early in development. Genetic mechanisms like the Nodal signaling pathway and ciliated cells contribute to asymmetric development, influencing organ placement and body turning.\n\nThe theory also addresses developmental malformations like holoprosencephaly and cephalopagus twins. It posits an evolutionary origin related to ancestral vertebrates adopting a left-sided posture or bottom-feeding behavior. Supporting evidence includes the presence of contralateral brain organization and asymmetric organ placement in even the most primitive vertebrates. The theory predicts external body asymmetries and connects brain torque (Yakovlevian torque) to spinal asymmetry. It further explains the patterns of nerve decussations, particularly in the visual and olfactory systems, aligning with the idea of a head twist relative to the body.\n",
    "chinese_title": "轴向扭转理论",
    "chinese_summary": "轴向扭转理论提出，包括人类在内的脊椎动物身体结构具有一种“扭转”构型，即头部的吻侧部分（面部和前脑）相对于身体的其余部分发生旋转，而身体其余部分则呈现左手性。这种扭转旨在解释各种解剖学现象，包括对侧大脑组织（左脑控制右身）、左侧心脏、不对称的器官位置以及诸如视交叉之类的神经交叉。\n\n虽然未被普遍接受，但该理论认为，在胚胎发育过程中，头部前部相对于身体旋转，从而有效地翻转了前脑和面部的左右和前后。来自斑马鱼和小鸡的胚胎学证据支持这种扭转发生在发育早期。诸如Nodal信号通路和纤毛细胞等遗传机制促进了不对称发育，影响了器官位置和身体转向。\n\n该理论还涉及诸如前脑无裂畸形和联体头畸形等发育畸形。它推测了一个与祖先脊椎动物采取左侧姿势或底部摄食行为相关的进化起源。支持证据包括即使在最原始的脊椎动物中也存在对侧大脑组织和不对称的器官位置。该理论预测了外部身体不对称，并将大脑扭矩（雅科夫列维安扭矩）与脊柱不对称联系起来。它进一步解释了神经纤维的交叉模式，特别是在视觉和嗅觉系统中，与头部相对于身体扭转的观点相符。"
  },
  {
    "id": "45190777",
    "title": "Hypervisor in 1k Lines",
    "url": "https://1000hv.seiya.me/en",
    "summary": "This \"Hypervisor in 1,000 Lines\" book guides the reader in building a minimal RISC-V type-1 hypervisor, capable of booting Linux-based OSes. It's presented as a sequel to the \"Operating System in 1,000 Lines\" book and is written in Rust.\n\nThe book emphasizes a hands-on, from-scratch approach to bare-metal programming, but leverages Rust's crate ecosystem to avoid reimplementing non-essential components. The goal is to create a functional hypervisor within approximately 1,000 lines of code, similar to the approach in the previous OS book.\n\nReaders can access example implementations on GitHub. The book is licensed under CC BY 4.0, while the source code is under the MIT license. The author encourages readers to engage in \"happy hypervisor hacking.\"\n",
    "chinese_title": "1K行代码的虚拟机监控器",
    "chinese_summary": "《千行代码实现Hypervisor》本书指导读者构建一个最小的RISC-V 1型虚拟机监控器，该监控器能够启动基于Linux的操作系统。本书是《千行代码实现操作系统》一书的续作，并使用Rust编写。\n\n本书强调一种从零开始的实践方法来进行裸机编程，但也利用Rust的crate生态系统来避免重新实现非必要组件。目标是在大约1000行代码内创建一个功能齐全的虚拟机监控器，与之前操作系统书籍的方法类似。\n\n读者可以在GitHub上访问示例实现。本书采用CC BY 4.0许可，而源代码采用MIT许可。作者鼓励读者积极参与“愉快的虚拟机监控器黑客活动”。"
  },
  {
    "id": "45185875",
    "title": "Tomorrow's emoji today: Unicode 17.0",
    "url": "https://jenniferdaniel.substack.com/p/tomorrows-emoji-today-unicode-170",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "今日预见明日表情：Unicode 17.0",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "45183050",
    "title": "Building a DOOM-like multiplayer shooter in pure SQL",
    "url": "https://cedardb.com/blog/doomql/",
    "summary": "Lukas Vogel created DOOMQL, a multiplayer DOOM-like shooter built entirely in SQL using CedarDB. Inspired by DuckDB-Doom, the project aimed to push the concept to the extreme, handling all rendering and game logic within SQL, including multiplayer functionality.\n\nThe architecture stores game state in database tables (map, players, etc.). Rendering is achieved through SQL views that implement raycasting and sprite projection. A shell script acts as the game loop, executing SQL queries 30 times per second. The client, a 150-line Python script, polls for input and renders the 3D view based on database queries.\n\nA key benefit is easy modding due to everything being data. The game loop manages bullet movement, collisions, and respawns within a single transaction to ensure consistency. Multiplayer functionality is achieved through simple queries for rendering and input insertion/updates.\n\nWhile a pure SQL raycasting renderer isn't practical, Vogel found expressing game state and logic in SQL surprisingly natural. The database system inherently manages concurrency for multiplayer. At 128x64 pixels, the game achieves ~30 FPS on CedarDB. Cheating is possible by sending raw SQL commands, creating an unexpected metagame.\n\nThe code is available on GitHub and the author is interested in feedback.\n",
    "chinese_title": "用纯SQL构建类似DOOM的多人射击游戏",
    "chinese_summary": "Lukas Vogel 用 CedarDB 完全使用 SQL 创建了 DOOMQL，一款类似 DOOM 的多人射击游戏。该项目受 DuckDB-Doom 启发，旨在将这一概念推向极致，在 SQL 中处理所有渲染和游戏逻辑，包括多人游戏功能。\n\n其架构将游戏状态存储在数据库表中（地图、玩家等）。渲染通过实现光线投射和精灵投影的 SQL 视图来实现。一个 shell 脚本作为游戏循环，每秒执行 30 次 SQL 查询。客户端是一个 150 行的 Python 脚本，轮询输入并根据数据库查询渲染 3D 视图。\n\n一个主要好处是易于修改，因为一切都是数据。游戏循环在单个事务中管理子弹移动、碰撞和重生，以确保一致性。多人游戏功能通过简单的渲染和输入插入/更新查询来实现。\n\n虽然纯 SQL 光线投射渲染器并不实用，但 Vogel 发现用 SQL 表达游戏状态和逻辑出奇地自然。数据库系统本身管理多人游戏的并发性。在 128x64 像素的分辨率下，该游戏在 CedarDB 上实现了约 30 FPS 的帧率。可以通过发送原始 SQL 命令进行作弊，从而创造出一种意想不到的元游戏。\n\n代码可在 GitHub 上找到，作者有兴趣获得反馈。"
  },
  {
    "id": "45199899",
    "title": "NASA Says Mars Rover Discovered Potential Biosignature in 2024",
    "url": "https://www.nasa.gov/news-release/nasa-says-mars-rover-discovered-potential-biosignature-last-year/",
    "summary": "In September 2025, NASA announced that the Perseverance rover discovered a potential biosignature in a rock sample collected in July 2024 from Jezero Crater's \"Bright Angel\" formation, specifically from a rock named \"Cheyava Falls.\" The sample, dubbed \"Sapphire Canyon,\" was taken from an ancient dry riverbed in Neretva Vallis.\n\nThe potential biosignature is indicated by the presence of \"leopard spots\" containing minerals like vivianite (hydrated iron phosphate) and greigite (iron sulfide) within the rock. These minerals could have formed through microbial activity, where microbes utilized organic carbon, sulfur, and phosphorus as energy sources. While these minerals can also form abiotically (without life), the absence of evidence of high temperatures or acidic conditions in the rock makes a biological origin more plausible, although not definitively proven.\n\nThe discovery is significant because these sedimentary rocks are among the youngest investigated, suggesting that Mars may have been habitable for a longer period than previously thought. NASA emphasizes that this finding is a potential biosignature, requiring further study by the scientific community to confirm or refute its biological potential. The data is now available for peer review and analysis, with scientists utilizing frameworks like the CoLD scale to assess the likelihood of life detection. Sapphire Canyon is one of 27 rock cores collected by Perseverance since landing in February 2021, contributing to NASA's Mars Exploration Program.\n",
    "chinese_title": "美国宇航局称火星探测器于2024年发现潜在生物特征",
    "chinese_summary": "2025年9月，美国国家航空航天局宣布，毅力号探测器在2024年7月从耶泽罗陨石坑“明亮天使”地层，特别是从一块名为“切亚瓦瀑布”的岩石中采集的岩石样本中发现了一个潜在的生物特征。该样本名为“蓝宝石峡谷”，取自内雷特瓦谷地的古老干涸河床。\n\n潜在的生物特征由岩石中含有针铁矿（水合磷酸铁）和磁黄铁矿（硫化铁）等矿物质的“豹斑”表明。这些矿物质可能通过微生物活动形成，微生物利用有机碳、硫和磷作为能量来源。虽然这些矿物质也可以非生物成因形成（没有生命），但岩石中没有高温或酸性条件的证据，这使得生物起源更可信，尽管尚未最终证实。\n\n这一发现意义重大，因为这些沉积岩是所研究的最年轻的岩石之一，表明火星可能比之前认为的更长时间内都适宜居住。美国国家航空航天局强调，这一发现是一个潜在的生物特征，需要科学界进一步研究，以确认或驳斥其生物潜力。目前，数据已可供同行评审和分析，科学家们正在利用CoLD等级等框架来评估生命探测的可能性。“蓝宝石峡谷”是自2021年2月毅力号着陆以来采集的27个岩石岩芯之一，为美国国家航空航天局的火星探测计划做出了贡献。"
  },
  {
    "id": "45158118",
    "title": "Show HN: Bottlefire – Build single-executable microVMs from Docker images",
    "url": "https://bottlefire.dev/",
    "summary": "Bottlefire allows users to build single-executable microVMs from Docker images using the open-source CLI tool `bake`. This creates standalone Linux executables that bundle Firecracker and automatically launch microVMs. These executables have zero dependencies and work on modern amd64/arm64 Linux platforms where KVM is available, without requiring root privileges or system-level setups. They include features like zero-config userspace networking, port mapping, and host-to-VM directory sharing, similar to regular containers.\n\nUsers can download pre-built images or create their own. Public images are available for free. Accessing any public or private image from Docker Hub, GHCR, or other registries requires a subscription (starting at $5/month, including 20GB of active images). The \"active image\" limit refers to the first pull of a uniquely configured image each month. Sponsorship options are available for those wanting to make their container images publicly accessible through Bottlefire. The provided examples showcase how to download and run these microVMs, including sandboxing with Landlock.\n",
    "chinese_title": "Show HN: Bottlefire – 从 Docker 镜像构建单文件可执行微虚拟机",
    "chinese_summary": "Bottlefire允许用户使用开源CLI工具`bake`从Docker镜像构建单执行文件的微虚拟机。这会创建独立的Linux可执行文件，它们捆绑了Firecracker并自动启动微虚拟机。这些可执行文件零依赖，可在支持KVM的现代amd64/arm64 Linux平台上运行，无需root权限或系统级设置。它们包含诸如零配置用户空间网络、端口映射和主机到VM目录共享等功能，与常规容器类似。\n\n用户可以下载预构建镜像或创建自己的镜像。公共镜像免费提供。从Docker Hub、GHCR或其他注册表访问任何公共或私有镜像需要订阅（起价为每月5美元，包括20GB的活动镜像）。“活动镜像”限制是指每个月首次拉取唯一配置的镜像。对于希望通过Bottlefire公开访问其容器镜像的用户，提供赞助选项。提供的示例展示了如何下载和运行这些微虚拟机，包括使用Landlock进行沙盒化。"
  },
  {
    "id": "45157094",
    "title": "PKM apps need to get better at resurfacing information",
    "url": "https://ankursethi.com/blog/pkm-apps-need-to-get-better-at-resurfacing-information/",
    "summary": "This article argues that current Personal Knowledge Management (PKM) apps excel at capturing, organizing, and connecting information, but fall short in resurfacing previously captured content. The author, a user of several PKM apps (Obsidian, Things, Drafts, Readwise Reader, Raindrop), desires features that automatically remind users of relevant past notes, tasks, or articles based on their current context or time.\n\nThe author criticizes PKM apps for becoming inert data stores similar to physical notebooks, where valuable information is inaccessible without manual searching. Resurfacing information is crucial for remembering captured data, pruning stale items, reducing information overload, observing patterns, and fostering serendipitous connections.\n\nDrawing inspiration from Spotify's \"Home\" tab, which effectively resurfaces previously listened-to music, the author proposes features like \"This Day in History\" sections, AI-powered similarity suggestions, and automatic surfacing of old or infrequently accessed notes. While the author has created basic workarounds using scripting and extensions, they advocate for these features to be natively integrated into PKM apps.\n\nThe article concludes with a plea to PKM app developers to prioritize features that allow users to re-engage with collected information, arguing that these features will significantly enhance the utility and value of PKM tools, transforming them from mere storage systems into active cognitive amplifiers. The lack of quality APIs and automation options in many apps are also highlighted as impediments to users' ability to create custom solutions.\n",
    "chinese_title": "PKM应用需要更好地重现信息。",
    "chinese_summary": "本文认为，当前的个人知识管理（PKM）应用程序擅长捕捉、组织和连接信息，但在重新呈现先前捕获的内容方面存在不足。作者作为多个PKM应用程序（Obsidian、Things、Drafts、Readwise Reader、Raindrop）的用户，希望能够拥有根据当前情境或时间自动提醒用户相关过往笔记、任务或文章的功能。\n\n作者批评PKM应用程序沦为类似于实体笔记本的惰性数据存储，有价值的信息在没有手动搜索的情况下无法访问。重新呈现信息对于记住捕获的数据、修剪过时项目、减少信息过载、观察模式以及培养偶然的联系至关重要。\n\n作者从Spotify的“主页”选项卡中汲取灵感，该选项卡有效地重新呈现了先前听过的音乐，因此提出了诸如“历史上的今天”部分、人工智能驱动的相似性建议以及自动呈现旧的或不常访问的笔记等功能。虽然作者已经使用脚本和扩展创建了基本解决方法，但他们主张将这些功能原生集成到PKM应用程序中。\n\n文章最后呼吁PKM应用程序开发者优先考虑允许用户重新参与收集的信息的功能，并认为这些功能将显著增强PKM工具的实用性和价值，使其从单纯的存储系统转变为主动的认知放大器。许多应用程序缺乏高质量的API和自动化选项也被强调为用户创建自定义解决方案的障碍。"
  },
  {
    "id": "45182770",
    "title": "A new experimental Go API for JSON",
    "url": "https://go.dev/blog/jsonv2-exp",
    "summary": "This Go blog post introduces `encoding/json/v2` and `encoding/json/jsontext`, new experimental packages in Go 1.25 designed to address limitations and flaws in the existing `encoding/json` package (v1).\n\nThe v1 package has shortcomings like imprecise JSON syntax handling (invalid UTF-8, duplicate object names), inconsistent handling of nil slices/maps, case-insensitive unmarshaling, inconsistent method calling, API inflexibilities with io.Reader and options, and performance limitations due to memory buffering and interface requirements.\n\nThe post argues for a new major version (v2) to implement breaking changes impossible to make in v1 while adhering to Go 1 compatibility. V2 offers a more flexible and configurable API, aiming for mostly seamless migration from v1.\n\n`encoding/json/jsontext` provides low-level syntactic functionalities for encoding and decoding JSON values and tokens without reflection. `encoding/json/v2` builds upon `jsontext` to add semantic meaning, offering functions like `Marshal`, `Unmarshal`, `MarshalWrite`, `UnmarshalRead`, `MarshalEncode`, and `UnmarshalDecode`, all accepting options for customization.\n\nV2 introduces `MarshalerTo` and `UnmarshalerFrom` interfaces for types to define their JSON representation using streaming encoders/decoders. It also allows callers of `Marshal` and `Unmarshal` to specify custom JSON representations for arbitrary types, overriding type-defined methods. The new packages aim to provide stricter JSON handling, streaming capabilities, and enhanced flexibility and configurability.\n",
    "chinese_title": "一个用于JSON的全新实验性Go API",
    "chinese_summary": "Go 1.25 中新的实验性 JSON 编码包：encoding/json/v2 和 encoding/json/jsontext\n\n这篇 Go 博客介绍了 `encoding/json/v2` 和 `encoding/json/jsontext`，Go 1.25 中新的实验性包，旨在解决现有 `encoding/json` 包（v1）中的限制和缺陷。\n\nv1 包存在一些缺点，例如：不精确的 JSON 语法处理（无效 UTF-8、重复的对象名称）、对 nil 切片/map 的不一致处理、不区分大小写的反序列化、不一致的方法调用、io.Reader 和选项方面的 API 不灵活性，以及由于内存缓冲和接口要求导致的性能限制。\n\n该文章认为需要一个新的主版本（v2）来实现 v1 中无法进行的破坏性更改，同时遵守 Go 1 的兼容性。V2 提供了一个更灵活和可配置的 API，旨在实现从 v1 的几乎无缝迁移。\n\n`encoding/json/jsontext` 提供了用于编码和解码 JSON 值和令牌的底层语法功能，无需反射。`encoding/json/v2` 构建于 `jsontext` 之上，增加了语义含义，提供了诸如 `Marshal`、`Unmarshal`、`MarshalWrite`、`UnmarshalRead`、`MarshalEncode` 和 `UnmarshalDecode` 等函数，所有函数都接受用于自定义的选项。\n\nV2 引入了 `MarshalerTo` 和 `UnmarshalerFrom` 接口，供类型使用流式编码器/解码器定义其 JSON 表示形式。它还允许 `Marshal` 和 `Unmarshal` 的调用者为任意类型指定自定义的 JSON 表示形式，覆盖类型定义的方法。新的包旨在提供更严格的 JSON 处理、流式传输能力以及增强的灵活性和可配置性。"
  },
  {
    "id": "45198485",
    "title": "Cuba's electrical grid collapses in nationwide blackout",
    "url": "https://www.reuters.com/sustainability/boards-policy-regulation/cubas-electrical-grid-collapses-nationwide-blackout-2025-09-10/",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "古巴全国大停电，电网崩溃",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "45183589",
    "title": "An attacker’s blunder gave us a look into their operations",
    "url": "https://www.huntress.com/blog/rare-look-inside-attacker-operation",
    "summary": "Huntress, an endpoint detection and response (EDR) company, gained a rare inside look into a threat actor's operations when the attacker inadvertently installed their agent while researching security solutions after clicking on a Google ad. This provided Huntress with a wealth of real-time data on the attacker's activities over three months.\n\nThe attacker, who had been tracked in previous incidents, was observed using AI tools like Make.com to automate and speed up their workflows, including translating messages with Google Translate after receiving tips from Telegram. They also showed interest in other AI tools for data generation and writing.\n\nHuntress discovered the attacker searching for running instances of the Evilginx man-in-the-middle attack framework and researching various reconnaissance and attack tools. They also explored residential proxy services like LunaProxy to obscure their malicious activity. The attacker spent time researching companies, their ecosystems, and their technology stacks using platforms like BuiltWith. They also looked into tools for scraping data from Telegram.\n\nThe attacker's browser history revealed a wide range of activities, from crafting phishing messages to researching companies in various sectors, including banks and real estate. They also showed interest in STYX Market, a dark web forum known for stolen credentials and laundering services.\n\nHuntress's analysis led to the identification of over 2,471 unique identities accessed by the attacker and resulted in detections with high confidence, significantly improving Huntress's ability to respond to such incidents. This incident provided valuable insights into the attacker's methodologies, tool preferences, and target selection.\n",
    "chinese_title": "攻击者的失误让我们得以窥探他们的行动。",
    "chinese_summary": "Huntress不慎“捕获”攻击者，深入了解其行动：Huntress是一家端点检测与响应(EDR)公司，因一名攻击者在点击Google广告后，为研究安全解决方案而不慎安装了其代理，从而罕见地深入了解了该威胁行动者的运营。这为Huntress提供了长达三个月的关于攻击者活动的丰富实时数据。\n\n该攻击者此前已在多起事件中被追踪，据观察，他使用诸如Make.com等人工智能工具来自动化和加速其工作流程，包括在使用Telegram收到提示后，使用谷歌翻译翻译消息。他们还对其他用于数据生成和写作的人工智能工具表现出兴趣。\n\nHuntress发现该攻击者正在搜索Evilginx中间人攻击框架的运行实例，并研究各种侦察和攻击工具。他们还探索了诸如LunaProxy之类的住宅代理服务，以掩盖其恶意活动。该攻击者花费时间使用诸如BuiltWith之类的平台来研究公司、其生态系统和技术堆栈。他们还研究了从Telegram抓取数据的工具。\n\n该攻击者的浏览器历史记录显示了广泛的活动，从制作网络钓鱼消息到研究银行和房地产等各个行业的公司。他们还对STYX Market表现出兴趣，这是一个以被盗凭据和洗钱服务而闻名的暗网论坛。\n\nHuntress的分析导致识别出攻击者访问的超过2,471个唯一身份，并产生了高置信度的检测结果，从而显着提高了Huntress对此类事件的响应能力。该事件为攻击者的行为方法、工具偏好和目标选择提供了宝贵的见解。"
  },
  {
    "id": "45188945",
    "title": "Immunotherapy drug clinical trial results: half of tumors shrink or disappear",
    "url": "https://www.rockefeller.edu/news/38120-immunotherapy-drug-eliminates-aggressive-cancers-in-clinical-trial/",
    "summary": "This brief article mentions two distinct scientific advancements. The first, and prominently featured as the title, highlights encouraging results from an immunotherapy drug clinical trial. The key takeaway is that the drug demonstrated a significant impact, with half of the treated patients experiencing tumor shrinkage or complete remission (disappearance of tumors). The second, briefly mentioned, concerns a breakthrough in mammalian cochlea research. Scientists have successfully kept a mammalian cochlea alive outside the body for the first time. This achievement likely has implications for understanding and treating hearing loss, though the specific details and significance are not elaborated upon in this summary.\n",
    "chinese_title": "免疫疗法药物临床试验结果：一半肿瘤缩小或消失",
    "chinese_summary": "本文简要提及了两项不同的科学进展。首先，也是标题重点，一项免疫疗法药物临床试验取得了令人鼓舞的结果。关键在于该药物显示出显著疗效，接受治疗的患者中有一半肿瘤缩小或完全缓解（肿瘤消失）。其次，简要提及的是哺乳动物耳蜗研究的一项突破。科学家们首次成功地在体外保持了哺乳动物耳蜗的活性。这项成就可能对理解和治疗听力损失有影响，但具体细节和意义在本摘要中并未详述。"
  },
  {
    "id": "45197302",
    "title": "Bending Spoons acquires Vimeo for $1.38B",
    "url": "https://investors.vimeo.com/news-releases/news-release-details/vimeo-enters-definitive-agreement-be-acquired-bending-spoons-138",
    "summary": "In a deal announced on September 10, 2025, Bending Spoons will acquire Vimeo for $1.38 billion in an all-cash transaction. Vimeo shareholders will receive $7.85 per share, a 91% premium over the company's recent share price. The deal, unanimously approved by Vimeo's board, is expected to close in the fourth quarter of 2025, pending customary approvals.\n\nVimeo's Chairman, Glenn H. Schiffman, believes the acquisition delivers compelling value to shareholders and will accelerate Vimeo's strategic roadmap. Philip Moyer, Vimeo CEO, expressed excitement about the partnership, anticipating increased focus for the team and customers. Bending Spoons CEO, Luca Ferrari, emphasized a long-term commitment to Vimeo, planning significant investments in the US and other key markets to enhance performance, features, and AI capabilities.\n\nUpon completion, Vimeo will become a private company, delisting from the NASDAQ. The company will release its third-quarter earnings results in writing. Skadden, Arps, Slate, Meagher & Flom LLP is advising Vimeo, while Latham & Watkins LLP is advising Bending Spoons.\n\nVimeo is a leading video platform for businesses, while Bending Spoons is a technology company with a portfolio of digital businesses. The press release also includes standard legal disclaimers about forward-looking statements and information about SEC filings related to the transaction.\n",
    "chinese_title": "Bending Spoons 以 13.8 亿美元收购 Vimeo",
    "chinese_summary": "2025年9月10日宣布的一项交易中，Bending Spoons将以13.8亿美元的全现金交易收购Vimeo。Vimeo股东将获得每股7.85美元，较该公司近期股价溢价91%。该交易已获得Vimeo董事会一致批准，预计将于2025年第四季度完成，尚待获得惯例批准。\n\nVimeo董事长Glenn H. Schiffman认为，此次收购为股东带来了令人信服的价值，并将加速Vimeo的战略路线图。Vimeo首席执行官Philip Moyer对此次合作表示兴奋，并期待团队和客户的关注度能够得到提升。Bending Spoons首席执行官Luca Ferrari强调了对Vimeo的长期承诺，计划在美国和其他主要市场进行重大投资，以提高性能、功能和人工智能能力。\n\n交易完成后，Vimeo将成为一家私有公司，从纳斯达克退市。该公司将以书面形式发布其第三季度收益报告。Skadden, Arps, Slate, Meagher & Flom LLP担任Vimeo的顾问，而Latham & Watkins LLP担任Bending Spoons的顾问。\n\nVimeo是领先的企业视频平台，而Bending Spoons是一家拥有数字业务组合的科技公司。该新闻稿还包括关于前瞻性陈述的标准法律免责声明以及有关与交易相关的SEC文件的信息。"
  },
  {
    "id": "45184432",
    "title": "Microsoft is officially sending employees back to the office",
    "url": "https://www.businessinsider.com/microsoft-send-employees-back-to-office-rto-remote-work-2025-9",
    "summary": "This Business Insider article, titled \"Microsoft is officially sending employees back to the office,\" reports that Microsoft is mandating a return to in-office work for its employees. While the exact details of the article are not available without access to the full text, the title suggests the following likely key points:\n\n* **Mandatory Return:** The return is not optional; Microsoft is requiring employees to work from the office.\n* **Company-Wide Policy:** The policy likely affects a significant portion of Microsoft's workforce, not just specific teams.\n* **Potential Reasons:** The article might explore the reasons behind the decision, such as collaboration, innovation, company culture, or performance concerns. It could also reference industry trends and whether other tech companies are following suit.\n* **Timeline and Flexibility:** The article might detail the timeline for the return, how it will be implemented, and whether any exceptions or hybrid work options are being offered.\n* **Employee Response:** The article could include potential employee reactions, concerns, and the overall impact on employee morale and retention.\n* **Impact on Real Estate:** The mandate could also have implications for Microsoft's real estate footprint and investments in office spaces.\n\nIn essence, the article highlights Microsoft's departure from flexible work arrangements towards a more traditional in-office work model.\n",
    "chinese_title": "微软正式要求员工返回办公室。",
    "chinese_summary": "微软正式要求员工重返办公室"
  },
  {
    "id": "45196945",
    "title": "Show HN: Small Transfers – charge from 0.000001 USD per request for your SaaS",
    "url": "https://smalltransfers.com/",
    "summary": "The \"Show HN: Small Transfers\" post introduces a service enabling SaaS companies to charge extremely small amounts (down to $0.000001 USD) per request or action within their applications. This micro-transaction model allows for a highly granular pricing structure, potentially enabling new monetization strategies that were previously infeasible due to high transaction fees.\n\nThe key idea is to move beyond traditional subscription or usage-based pricing models. This new approach could be valuable for services where resource consumption varies significantly, allowing users to pay precisely for what they use, even at a very fine-grained level. It could also be used to incentivize specific behaviors or unlock advanced features through micro-payments.\n\nWhile the post is currently loading and lacks concrete details, the core concept revolves around facilitating extremely low-value transactions within a SaaS environment. The success of such a service would depend heavily on its cost-effectiveness (minimizing transaction fees) and ease of integration for developers.\n",
    "chinese_title": "Show HN: 小型转账 – 每次SaaS请求收费0.000001美元起",
    "chinese_summary": "“Show HN: Small Transfers”介绍了一种服务，使SaaS公司能够对应用程序内的每次请求或操作收取极少量费用（低至0.000001美元）。这种微交易模式允许高度精细的定价结构，有可能实现以前因高额交易费用而不可行的新型盈利策略。\n\n其核心思想是超越传统的订阅或基于使用量的定价模式。这种新方法对于资源消耗差异很大的服务可能很有价值，允许用户精确地为他们使用的资源付费，即使是非常细粒度的级别。它也可以用于激励特定行为或通过微支付解锁高级功能。\n\n虽然该帖子目前正在加载且缺乏具体细节，但其核心概念围绕着促进SaaS环境中的极低价值交易。该服务的成功将很大程度上取决于其成本效益（最小化交易费用）和开发人员的集成便利性。"
  },
  {
    "id": "45178041",
    "title": "Mistral raises 1.7B€, partners with ASML",
    "url": "https://mistral.ai/news/mistral-ai-raises-1-7-b-to-accelerate-technological-progress-with-ai",
    "summary": "Mistral AI has secured a €1.7 billion Series C funding round, valuing the company at €11.7 billion post-money. This investment will be used to fuel AI research and develop solutions for strategic industries. The funding round is led by ASML, a leading semiconductor equipment manufacturer, marking the beginning of a strategic partnership.\n\nThe partnership aims to leverage AI to create innovative products and solutions for ASML customers and explore potential joint research. Existing investors, including DST Global, Andreessen Horowitz, Bpifrance, General Catalyst, Index Ventures, Lightspeed, and NVIDIA, also participated in the funding.\n\nMistral AI plans to continue its focus on cutting-edge research, strategic partnerships, and the development of custom decentralized AI solutions for complex engineering and industrial problems. The company aims to provide enterprises, public sectors, and industries with a competitive edge through advanced models, tailored solutions, and high-performance computing infrastructure. Mistral AI CEO Arthur Mensch emphasized the company's ambition to help ASML and its partners solve engineering challenges through AI, ultimately advancing the semiconductor and AI value chain. The funding round also reaffirms Mistral AI's independence.\n",
    "chinese_title": "Mistral 融资 17 亿欧元，并与 ASML 合作",
    "chinese_summary": "Mistral AI 完成 17 亿欧元 C 轮融资，估值达 117 亿欧元（投后）。该笔投资将用于推动人工智能研究，并为战略行业开发解决方案。此轮融资由领先的半导体设备制造商 ASML 领投，标志着战略合作的开始。\n\n该合作旨在利用人工智能为 ASML 客户创造创新产品和解决方案，并探索潜在的联合研究。包括 DST Global、Andreessen Horowitz、Bpifrance、General Catalyst、Index Ventures、Lightspeed 和 NVIDIA 在内的现有投资者也参与了此轮融资。\n\nMistral AI 计划继续专注于前沿研究、战略合作，以及为复杂的工程和工业问题开发定制的去中心化人工智能解决方案。该公司旨在通过先进的模型、定制的解决方案和高性能计算基础设施，为企业、公共部门和各行业提供竞争优势。Mistral AI 首席执行官 Arthur Mensch 强调了公司帮助 ASML 及其合作伙伴通过人工智能解决工程挑战的雄心，最终推进半导体和人工智能价值链。此轮融资也再次确认了 Mistral AI 的独立性。"
  },
  {
    "id": "45197240",
    "title": "Mercedes EQS with solid-state batteries drove 750 miles with range to spare",
    "url": "https://electrek.co/2025/09/09/mercedes-eqs-with-solid-state-ev-batteries-drove-750-miles/",
    "summary": "A Mercedes EQS, equipped with solid-state batteries, successfully drove 750 miles on a single charge, with 85 miles of range still remaining. Mercedes-Benz is hailing this battery technology as a \"gamechanger\" for electric vehicles. The test drive, from Stuttgart, Germany, to Malmö, Sweden, significantly exceeded Mercedes' previous claim of a 620-mile real-world range for a modified EQS with solid-state batteries.\n\nThe new solid-state battery increases usable energy by 25% while maintaining a similar weight and size to the standard EQS battery pack. Mercedes is developing this technology in collaboration with Mercedes-AMG High Performance Powertrains (HPP), using battery cells from US-based Factorial Energy, who is also partnering with other major automotive manufacturers such as Hyundai and Stellantis.\n\nMercedes aims to bring solid-state batteries to series production by the end of the decade. They are one of many automakers, including Volkswagen, Toyota, BMW, Nissan, Honda, CATL, and BYD, racing to unlock the potential of solid-state batteries.\n",
    "chinese_title": "奔驰EQS搭载固态电池行驶750英里，续航里程仍有剩余",
    "chinese_summary": "搭载固态电池的梅赛德斯EQS成功实现单次充电行驶750英里，剩余续航里程85英里。梅赛德斯-奔驰称这项电池技术为电动汽车领域的“游戏规则改变者”。此次从德国斯图加特到瑞典马尔默的测试驾驶，大大超过了梅赛德斯此前宣称的配备固态电池的改装EQS 620英里实际续航里程。\n\n新型固态电池在保持与标准EQS电池组相似重量和尺寸的同时，将可用能量提高了25%。梅赛德斯正与梅赛德斯-AMG高性能动力总成（HPP）合作开发这项技术，采用美国Factorial Energy的电池单元，该公司也与现代和Stellantis等其他主要汽车制造商建立了合作关系。\n\n梅赛德斯的目标是在本十年末将固态电池投入批量生产。包括大众、丰田、宝马、日产、本田、宁德时代和比亚迪在内的众多汽车制造商，都在竞相挖掘固态电池的潜力。"
  },
  {
    "id": "45184368",
    "title": "ICE is using fake cell towers to spy on people's phones",
    "url": "https://www.forbes.com/sites/the-wiretap/2025/09/09/how-ice-is-using-fake-cell-towers-to-spy-on-peoples-phones/",
    "summary": "This Forbes article reports that Immigration and Customs Enforcement (ICE) continues to use controversial cell-site simulators, also known as Stingrays, to locate and deport undocumented immigrants, despite criticism from civil rights groups. These devices mimic cell towers to track phones, potentially exposing the data of anyone nearby. A recently unsealed search warrant reveals ICE used a Stingray to attempt to locate a fugitive in Utah who had a murder conviction in Venezuela.\n\nThe article highlights ICE's ongoing investment in surveillance technology, including a nearly $1 million purchase of \"cell site simulator vehicles\" and a $4.4 million contract with the original Stingray manufacturer.\n\nBeyond ICE, the newsletter also touches on other surveillance-related stories. It discusses a $12 million AI surveillance system called Sherlock, implemented by San Mateo County Sheriff’s Office, that has so far failed to live up to its promise of speeding up police work. Other news includes Flock Safety's ambition to challenge Axon in the police technology market, ICE's $10 million contract with Clearview AI for facial recognition, and a lawsuit against Meta alleging privacy breaches within WhatsApp. The newsletter also highlights Signal's launch of encrypted chat backups and Amnesty International's report on Pakistan's expansive domestic surveillance operations.\n",
    "chinese_title": "美国移民及海关执法局使用假基站监听民众手机。",
    "chinese_summary": "福布斯报道称，尽管受到民权组织的批评，美国移民及海关执法局 (ICE) 仍在继续使用备受争议的手机基站模拟器（也称为 Stingray）来定位和驱逐无证移民。这些设备模拟手机信号塔来跟踪手机，可能会暴露附近任何人的数据。一份最近解封的搜查令显示，ICE 使用 Stingray 试图在犹他州定位一名在委内瑞拉犯有谋杀罪的逃犯。\n\n文章强调了 ICE 对监控技术的持续投资，包括以近 100 万美元购买“手机基站模拟器车辆”以及与 Stingray 原始制造商签订的 440 万美元合同。\n\n除了 ICE 之外，该简报还涉及其他与监控相关的新闻。它讨论了圣马特奥县治安官办公室实施的一项名为 Sherlock 的价值 1200 万美元的 AI 监控系统，该系统迄今未能实现其加速警务工作的承诺。其他新闻包括 Flock Safety 挑战 Axon 在警用技术市场地位的雄心、ICE 与 Clearview AI 签订的价值 1000 万美元的面部识别合同，以及针对 Meta 的一项诉讼，指控 WhatsApp 内部存在隐私泄露。该简报还强调了 Signal 推出加密聊天备份以及国际特赦组织关于巴基斯坦大规模国内监控行动的报告。"
  },
  {
    "id": "45167436",
    "title": "Go for Bash Programmers – Part II: CLI Tools",
    "url": "https://github.com/go-monk/from-bash-to-go-part-ii",
    "summary": "This article serves as a tutorial for Bash programmers transitioning to Go for writing CLI tools. It builds upon the previous article introducing the Go language fundamentals.\n\nThe article begins with a simple \"hello\" program, demonstrating how to create a testable function by leveraging the `io.Writer` interface for output. It explores different approaches to manage output streams, including passing `io.Writer` as an argument, using `nil` for default behavior, employing global variables, and ultimately settling on a struct-based `Printer` for encapsulation and thread-safety.\n\nThe tutorial then moves to a more practical example: a CLI tool for counting duplicate lines in input. It introduces the concept of function types in Go to define options, allowing for flexible configuration of the tool's behavior (e.g., specifying the input reader). It then discusses handling command-line arguments directly using `os.Args`, and refactors the argument parsing into a reusable option function.\n\nFinally, the article covers using the `flag` package to define command-line flags (options), including providing usage messages and default values, making the CLI tool more user-friendly. The example provided demonstrates a `-lines` flag to count lines instead of words. The article provides practical examples and highlights best practices for building robust and testable CLI tools in Go.\n",
    "chinese_title": "Bash程序员进阶（二）：命令行工具",
    "chinese_summary": "本文旨在为从 Bash 程序员转型使用 Go 编写 CLI 工具的开发者提供教程。它建立在前一篇介绍 Go 语言基础知识的文章之上。\n\n文章从一个简单的 \"hello\" 程序开始，演示如何通过利用 `io.Writer` 接口进行输出来创建可测试的函数。它探讨了管理输出流的不同方法，包括将 `io.Writer` 作为参数传递，使用 `nil` 作为默认行为，使用全局变量，并最终确定使用基于结构的 `Printer` 来实现封装和线程安全。\n\n教程随后转向一个更实用的例子：一个用于统计输入中重复行的 CLI 工具。它介绍了 Go 中的函数类型来定义选项，从而可以灵活地配置工具的行为（例如，指定输入读取器）。然后讨论了直接使用 `os.Args` 处理命令行参数，并将参数解析重构为一个可重用的选项函数。\n\n最后，文章介绍了使用 `flag` 包来定义命令行标志（选项），包括提供使用消息和默认值，从而使 CLI 工具更用户友好。提供的示例演示了一个 `-lines` 标志，用于统计行数而不是单词数。本文提供了实用的例子，并强调了在 Go 中构建健壮且可测试的 CLI 工具的最佳实践。"
  },
  {
    "id": "45166245",
    "title": "Anscombe's Quartet",
    "url": "https://en.wikipedia.org/wiki/Anscombe%27s_quartet",
    "summary": "Anscombe's Quartet, created by statistician Francis Anscombe in 1973, is a set of four datasets designed to highlight the importance of visually examining data before statistical analysis. Each dataset contains eleven (x, y) points and shares nearly identical simple descriptive statistics like mean, variance, correlation, and linear regression line.\n\nDespite having these similar statistical properties, when graphed as scatter plots, the four datasets reveal drastically different distributions. The first shows a clear linear relationship, the second a non-linear one, the third a linear relationship heavily influenced by an outlier, and the fourth demonstrates a high correlation driven by a single high-leverage point, with the remaining data showing no discernible relationship.\n\nAnscombe created the quartet to counter the idea that numerical calculations are precise, while graphs are rough. The quartet vividly demonstrates that relying solely on statistical summaries can be misleading, and visualizing data is crucial for understanding underlying patterns and the influence of outliers.\n\nThe quartet remains a popular example used to teach the significance of exploratory data analysis and the limitations of relying on basic statistical properties alone. Subsequent work has built upon Anscombe's concept, leading to datasets like the Datasaurus Dozen, which further emphasize the need for visual data exploration.\n",
    "chinese_title": "安斯库姆四重奏",
    "chinese_summary": "安斯库姆四重奏是由统计学家弗朗西斯·安斯库姆于1973年创建的一组四种数据集，旨在强调在进行统计分析之前目视检查数据的重要性。每个数据集包含十一个 (x, y) 点，并具有几乎相同的简单描述性统计数据，如平均值、方差、相关性和线性回归线。\n\n尽管具有这些相似的统计特性，但当绘制成散点图时，这四个数据集显示出截然不同的分布。第一个显示出清晰的线性关系，第二个显示出非线性关系，第三个显示出受异常值严重影响的线性关系，第四个则显示出由单个高杠杆点驱动的高相关性，其余数据则显示出没有明显的关系。\n\n安斯库姆创建四重奏是为了反驳数值计算是精确的，而图表是粗略的这种观点。该四重奏生动地表明，仅仅依靠统计摘要可能会产生误导，而可视化数据对于理解潜在模式和异常值的影响至关重要。\n\n该四重奏仍然是一个流行的例子，用于教授探索性数据分析的重要性以及仅依赖基本统计属性的局限性。随后的工作以安斯库姆的概念为基础，产生了像“Datasaurus Dozen”这样的数据集，进一步强调了可视化数据探索的必要性。"
  },
  {
    "id": "45177683",
    "title": "YouTube is a mysterious monopoly",
    "url": "https://anderegg.ca/2025/09/08/youtube-is-a-mysterious-monopoly",
    "summary": "This blog post from September 8, 2025, discusses a recent, unexplained decline in YouTube views experienced by several content creators, including Adrian Black and Jeff Geerling. While views have decreased significantly, likes and revenue appear to have remained relatively stable. This discrepancy has led to speculation about a potential change in YouTube's view calculation methods, though YouTube hasn't made any official announcements.\n\nThe author highlights the impact of this decline on creators who rely on video view metrics to secure sponsorships. Without clarification from YouTube, these creators face difficulties in adjusting sponsor expectations. Some, like RedLetterMedia, speculate that the issue might be related to Restricted Mode randomly activating for users.\n\nThe author, a YouTube Premium subscriber, acknowledges YouTube's near-monopoly in the online video space. While alternatives like Nebula exist, they lack the scale and reach of YouTube. The author emphasizes the demoralizing effect of sudden, unexplained traffic fluctuations on creators who depend on the platform for income. The lack of transparency and official communication from YouTube exacerbates the problem.\n\nThe author concludes that the YouTube landscape is in need of competition, but creating a viable alternative would require significant investment and patience, as attracting both viewers and advertisers from the dominant YouTube platform would be a major challenge.\n",
    "chinese_title": "YouTube 是个神秘的垄断者。",
    "chinese_summary": "2025年9月8日的这篇博文讨论了包括Adrian Black和Jeff Geerling在内的几位内容创作者近期经历的、原因不明的YouTube观看量下降。虽然观看次数大幅下降，但点赞和收入似乎相对稳定。这种差异引发了人们对YouTube观看量计算方法可能发生变化的猜测，尽管YouTube尚未发布任何官方声明。\n\n作者强调了这种下降对依赖视频观看量指标来获得赞助的创作者的影响。在YouTube没有澄清的情况下，这些创作者在调整赞助商预期方面面临困难。一些人，如RedLetterMedia，推测这个问题可能与限制模式随机为用户激活有关。\n\n作者作为YouTube Premium订阅者，承认YouTube在在线视频领域的近乎垄断地位。虽然像Nebula这样的替代品存在，但它们缺乏YouTube的规模和影响力。作者强调了突然的、无法解释的流量波动对依赖该平台获得收入的创作者的士气打击。YouTube缺乏透明度和官方沟通加剧了这个问题。\n\n作者总结说，YouTube生态系统需要竞争，但创建一个可行的替代方案需要大量的投资和耐心，因为从占主导地位的YouTube平台吸引观众和广告商将是一个重大挑战。"
  },
  {
    "id": "45179304",
    "title": "Anthropic judge rejects $1.5B AI copyright settlement",
    "url": "https://news.bloomberglaw.com/ip-law/anthropic-judge-blasts-copyright-pact-as-nowhere-close-to-done",
    "summary": "Judge William Alsup is holding off on approving Anthropic's proposed $1.5 billion copyright settlement with authors, expressing concerns that the agreement is incomplete and could disadvantage class members. Alsup fears the deal might be pushed through without adequately protecting authors' rights and ensuring fair compensation. He demands more information about the claims process, including a definitive list of works covered and a clear notification system for potential claimants.\n\nAlsup criticized the \"army\" of attorneys involved, emphasizing that \"add-on\" attorneys won't be paid from settlement funds and that legal fees will be tied to actual payouts to class members. He also wants to ensure that Anthropic gains a \"clean bill of health\" from the settlement, protected from future lawsuits over the same copyright issues.\n\nAuthors' counsel assured the court of their commitment to ensuring all valid claims are compensated. Maria A. Pallante of the Association of American Publishers criticized Alsup's understanding of the publishing industry. The settlement aims to resolve a class action over Anthropic's unauthorized use of copyrighted books and could set a precedent for similar AI copyright disputes.\n\nAlsup instructed the parties to create a claim form requiring copyright owners to opt-in, with individual works excluded if any owner opts out. He set a September 15 deadline for a final list of works. The case is Bartz v. Anthropic PBC, N.D. Cal., 24-cv-5417.\n",
    "chinese_title": "Anthropic 法官驳回 15 亿美元 AI 版权和解协议",
    "chinese_summary": "法官威廉·阿尔苏普暂缓批准Anthropic公司提出的与作者达成15亿美元的版权和解协议，他表达了对该协议不完整并可能损害集体诉讼成员利益的担忧。阿尔苏普担心该协议可能会在没有充分保护作者权利和确保公平赔偿的情况下通过。他要求提供关于索赔流程的更多信息，包括涵盖作品的明确清单和潜在索赔人的清晰通知系统。\n\n阿尔苏普批评了所涉及的“律师大军”，强调“额外”律师将不会从和解基金中获得报酬，并且律师费将与支付给集体诉讼成员的实际赔偿金挂钩。他还希望确保Anthropic公司从和解中获得“清白之身”，免受未来因相同版权问题提起的诉讼。\n\n作者律师向法院保证，他们致力于确保所有有效索赔都得到赔偿。美国出版商协会的Maria A. Pallante批评了阿尔苏普对出版业的理解。该和解协议旨在解决一起关于Anthropic公司未经授权使用受版权保护书籍的集体诉讼，并可能为类似的AI版权纠纷开创先例。\n\n阿尔苏普指示各方创建一个要求版权所有者选择加入的索赔表格，如果任何所有者选择退出，则个别作品将被排除在外。他设定了9月15日作为最终作品清单的截止日期。该案件为Bartz v. Anthropic PBC，北加州地区法院，24-cv-5417。"
  },
  {
    "id": "45156671",
    "title": "Cassette Logic: technology that never dies but is already dead",
    "url": "https://www.differentshelf.com/cassette-logic/",
    "summary": "This article explores the enduring appeal of cassette tapes in a world dominated by digital music. The author appreciates the unique experience of listening to cassettes, arguing that it's not about superior sound quality but about context, memory, and the connection to the past. He describes his vintage audio setup, highlighting how the imperfections and the ritualistic nature of cassette playback contribute to a more engaging listening experience.\n\nThe author emphasizes how cassette music was originally produced with the limitations of tape and radio in mind, shaping the mixing and mastering. Playing these recordings in lossless quality, while technically superior, loses a part of their original context. Cassettes, he argues, evoke autobiographical memories more strongly than digital formats, tying music to personal experiences and identity.\n\nHe contrasts the cassette experience with remastered digital music, drawing an analogy to film restorations. While some remasters faithfully enhance the original recording, others are heavily altered, similar to the revised version of the Han Solo scene in Star Wars. Cassettes, however, preserve the original intention of the artists, engineers, and even the friends who created mixtapes.\n\nThe author concludes by highlighting the element of surprise and discovery that cassettes offer, citing his purchase of a large, unlabeled collection of rock cassettes. He finds joy in the unpredictability of cassette tapes, noting how they bring unexpected music into his life and provide a tangible connection to the past. In essence, the cassette's value lies in its ability to preserve a specific moment in time, both musically and personally.\n",
    "chinese_title": "磁带逻辑：永不死去却早已逝去的科技",
    "chinese_summary": "在数字音乐主导的世界里，本文探讨了卡式磁带经久不衰的魅力。作者欣赏聆听卡带的独特体验，认为其价值不在于卓越的音质，而在于情境、记忆以及与过去的连接。他描述了自己的复古音响设备，强调卡带播放的瑕疵和仪式感如何带来更引人入胜的聆听体验。\n\n作者强调，卡带音乐最初的制作就考虑了磁带和广播的局限性，从而影响了混音和母带制作。以无损音质播放这些录音，虽然技术上更胜一筹，却失去了部分原始情境。他认为，卡带比数字格式更能唤起自传式的记忆，将音乐与个人经历和身份联系起来。\n\n他将卡带体验与重制版数字音乐进行对比，并用电影修复进行类比。虽然有些重制版忠实地增强了原始录音，但另一些则被大幅修改，类似于《星球大战》中汉·索罗场景的修改版。然而，卡带保留了艺术家、工程师，甚至创作混音带的朋友们的原始意图。\n\n作者最后强调了卡带所带来的惊喜和发现，并以自己购买的大量未标记摇滚卡带收藏为例。他从卡带的不可预测性中找到了乐趣，注意到它们如何将意想不到的音乐带入他的生活，并提供与过去的切实联系。本质上，卡带的价值在于它能够保留特定的时刻，无论是音乐上还是个人层面。"
  },
  {
    "id": "45198948",
    "title": "You Need to See Epstein's Birthday Book for Yourself",
    "url": "https://www.theatlantic.com/technology/archive/2025/09/jeffrey-epstein-birthday-book-conspiracy-theories/684157/",
    "summary": "Charlie Warzel's article in *The Atlantic* dissects the newly released contents of Jeffrey Epstein's 50th-birthday book, compiled by Ghislaine Maxwell in 2003. Warzel expresses shock and disgust at the book's contents, which are now public after a subpoena from the House Oversight Committee.\n\nThe book is filled with tributes from Epstein's friends and associates, many of which contain sexually suggestive content and allusions to his attraction to young girls. Key figures allegedly contributed, including Donald Trump (whose letter is a focal point due to its lewd nature), Bill Clinton, George Mitchell, and Leslie Wexner. The Trump letter and a sketch included in it have become a subject of debate and denial, despite its seeming authenticity.\n\nWarzel highlights specific examples from the book, including disturbing anecdotes, graphic illustrations, and sexually charged poems. He argues that the book confirms suspicions that Epstein's predatory behavior was an open secret among his powerful circle, who may have enabled or participated in it.\n\nDespite the damning evidence, Warzel notes that the reaction across social media and right-wing media has been surprisingly muted, with attempts to dismiss the content or deflect blame. He suggests that the book's release, while potentially fueling conspiracy theories, also presents a challenge for those invested in them, as it forces them to confront the reality they've been theorizing about. Ultimately, Warzel views the book as confirmation of a corrupt elite, and the muted public reaction as a reflection of a broken media ecosystem.\n",
    "chinese_title": "你需要亲自看看爱泼斯坦的生日书",
    "chinese_summary": "查理·沃泽尔在《大西洋》杂志的文章剖析了杰弗里·爱泼斯坦50岁生日纪念册新近公开的内容，该纪念册由吉斯莱恩·麦克斯韦于2003年编辑。沃泽尔对纪念册的内容表达了震惊和厌恶，这些内容在众议院监督委员会发出传票后现已公开。\n\n这本纪念册充满了爱泼斯坦朋友和同事的赞扬之词，其中许多包含性暗示内容和对其迷恋年轻女孩的暗示。据称，包括唐纳德·特朗普（其信件因其淫秽性质而成为焦点）、比尔·克林顿、乔治·米切尔和莱斯利·韦克斯纳在内的重要人物都做出了贡献。 特朗普的信件和其中的一幅素描已经成为争论和否认的主题，尽管它看起来是真实的。\n\n沃泽尔重点介绍了该纪念册中的具体例子，包括令人不安的轶事、图形插图和带有性意味的诗歌。他认为，这本书证实了人们的怀疑，即爱泼斯坦的掠夺行为在他强大的圈子里是一个公开的秘密，他们可能促成或参与了这一行为。\n\n尽管有确凿的证据，沃泽尔指出，社交媒体和右翼媒体的反应出人意料地平淡，试图驳斥这些内容或转移责任。他认为，这本书的发布虽然可能助长阴谋论，但也对那些沉迷于阴谋论的人提出了挑战，因为它迫使他们面对他们一直在推测的现实。 最终，沃泽尔认为这本书证实了一个腐败的精英阶层，而公众的冷淡反应反映了一个破碎的媒体生态系统。"
  },
  {
    "id": "45196746",
    "title": "Office CMBS Delinquency Rate Spikes to Record 11.7%",
    "url": "https://wolfstreet.com/2025/09/01/office-cmbs-delinquency-rate-spikes-to-record-11-7-much-worse-than-financial-crisis-peak-multifamily-delinquencies-also-spike/",
    "summary": "This WOLF STREET article highlights a significant spike in commercial real estate (CRE) mortgage delinquencies, particularly in the office and multifamily sectors. The office CMBS delinquency rate reached a record high of 11.7% in August, surpassing even the peak of the Financial Crisis, driven by a \"flight to quality\" where tenants are leaving older office towers for newer ones. Multifamily CMBS delinquencies also jumped to 6.9%, the highest since 2015.\n\nThe article points out the use of \"extend-and-pretend\" tactics and forbearance deals as attempts to \"cure\" delinquent loans, essentially pushing problems into the future or delaying losses. Examples include the $1.04 billion mortgage on 1211 Avenue of the Americas and the $335 million mortgage on Times Square Plaza.\n\nThe article breaks down who is holding the risk in these troubled mortgages, revealing that a large portion is held by investors through CMBS and CLOs, rather than banks. For multifamily mortgages, government entities like Fannie Mae and Freddie Mac hold significant exposure. While banks do have some exposure, the article suggests that the limited exposure of US banks to CRE mortgages implies that the situation is unlikely to pose a systemic risk to the banking sector. Losses are more likely to be absorbed by investors and the government. The Fed could allow the situation to resolve itself naturally.\n",
    "chinese_title": "办公楼CMBS贷款违约率飙升至创纪录的11.7%",
    "chinese_summary": "WOLF STREET文章指出商业地产抵押贷款违约率显著上升，尤其是在办公和多户住宅领域。8月份，办公楼CMBS违约率达到创纪录的11.7%，甚至超过了金融危机时期的峰值，原因是“逃向优质资产”导致租户纷纷离开老旧办公楼，转而选择新建办公楼。多户住宅CMBS违约率也跃升至6.9%，为2015年以来的最高水平。\n\n文章指出，使用“展期和假装”策略以及延期偿还协议是试图“治愈”不良贷款的手段，本质上是将问题推到未来或推迟损失。例子包括美洲大道1211号的10.4亿美元抵押贷款和时代广场广场的3.35亿美元抵押贷款。\n\n文章分析了这些不良抵押贷款的风险承担者，揭示了大部分风险由投资者通过CMBS和CLO持有，而非银行。对于多户住宅抵押贷款，房利美和房地美等政府实体持有大量敞口。虽然银行确实有一些敞口，但文章认为，美国银行对商业地产抵押贷款的有限敞口意味着这种情况不太可能对银行业构成系统性风险。损失更有可能由投资者和政府承担。美联储可能会允许情况自然解决。"
  },
  {
    "id": "45179939",
    "title": "DuckDB NPM packages 1.3.3 and 1.29.2 compromised with malware",
    "url": "https://github.com/duckdb/duckdb-node/security/advisories/GHSA-w62p-hx95-gf2c",
    "summary": "On September 9, 2025, the DuckDB team announced that versions 1.3.3 and 1.29.2 of their NPM packages were compromised with malware designed to interfere with cryptocoin transactions. The affected packages are `@duckdb/node-api`, `@duckdb/node-bindings`, `duckdb`, and `@duckdb/duckdb-wasm`.\n\nThe compromise occurred due to a phishing attack where a DuckDB maintainer was tricked into logging into a fake NPM website, allowing attackers to add a malicious API token to the account and publish compromised versions of the packages.\n\nThe DuckDB team responded quickly by deprecating the malicious versions, reaching out to NPM support to delete them, and re-releasing the packages with updated, safe versions (1.3.4/1.30.0). They also rotated passwords, tokens, and API keys.\n\nThe team apologized for the incident, is reviewing internal security processes to prevent future occurrences, and categorized the severity of the compromise as High (CVE-2025-59037). Users are advised to verify they haven't accidentally updated to the compromised versions.\n",
    "chinese_title": "DuckDB NPM 包 1.3.3 和 1.29.2 版本遭恶意软件入侵",
    "chinese_summary": "2025年9月9日，DuckDB团队宣布其NPM包的1.3.3和1.29.2版本受到恶意软件入侵，该恶意软件旨在干扰加密货币交易。受影响的软件包包括`@duckdb/node-api`、`@duckdb/node-bindings`、`duckdb`和`@duckdb/duckdb-wasm`。\n\n此次入侵是由于网络钓鱼攻击造成的，攻击者诱骗DuckDB维护人员登录虚假的NPM网站，从而将恶意API令牌添加到该帐户，并发布了受损版本的软件包。\n\nDuckDB团队迅速做出反应，弃用了恶意版本，联系NPM支持以删除它们，并重新发布了更新的安全版本（1.3.4/1.30.0）。他们还轮换了密码、令牌和API密钥。\n\n该团队为此次事件道歉，正在审查内部安全流程以防止未来再次发生，并将此次入侵的严重程度归类为高级别（CVE-2025-59037）。建议用户验证他们是否意外更新到受损版本。"
  },
  {
    "id": "45153380",
    "title": "Interesting PEZY-SC4s",
    "url": "https://chipsandcheese.com/p/pezy-sc4s-at-hot-chips-2025",
    "summary": "This article previews PEZY Computing's upcoming PEZY-SC4s accelerator, unveiled at Hot Chips 2025. SC4s aims to deliver highly efficient FP64 compute for supercomputing, a tradition Japan emphasizes with domestic hardware development. The design uses a massively parallel array of low-clocked, low-voltage processing elements (PEs), arranged hierarchically in Villages, Cities, Prefectures, and a State (the chip).\n\nEach PE features eight hardware threads, fine-grained multithreading for latency hiding, and a four-wide FP64 SIMD unit designed to minimize branch divergence penalties. SC4s introduces BF16 support for AI applications, but notably lacks dedicated matrix multiplication units found in GPUs.\n\nThe memory subsystem prioritizes low latency, featuring small PE-private L1 caches, shared L2 caches, and a 64MB last-level cache (L3). It utilizes four HBM3 stacks for 3.2 TB/s of memory bandwidth. A quad-core RISC-V management processor based on the Rocket Core handles task distribution and PCIe interface management.\n\nThe accelerator connects to a host server (AMD EPYC 9555P) via PCIe Gen 5. While silicon isn't yet available, simulations suggest SC4s will achieve high FP64 performance per watt, potentially surpassing Nvidia's H200. PEZY emphasizes ease of use with a PZCL programming model similar to OpenCL. The SC4s is seen as a refinement of previous generations focused on increased efficiency, filling a niche for high-precision applications where accuracy is critical.\n",
    "chinese_title": "有趣的PEZY-SC4s",
    "chinese_summary": "本文预览了PEZY Computing公司即将在Hot Chips 2025上发布的PEZY-SC4s加速器。SC4s旨在为超级计算提供高效的FP64计算，这是日本通过国产硬件开发所强调的传统。该设计采用了低时钟、低电压处理单元（PE）的大规模并行阵列，按村庄、城市、县和邦（芯片）分层排列。\n\n每个PE都有八个硬件线程，用于延迟隐藏的细粒度多线程，以及旨在最大限度地减少分支发散惩罚的四路FP64 SIMD单元。SC4s引入了对AI应用的BF16支持，但值得注意的是，它缺乏GPU中常见的专用矩阵乘法单元。\n\n内存子系统优先考虑低延迟，具有小型PE私有L1缓存、共享L2缓存和一个64MB的末级缓存（L3）。它利用四个HBM3堆栈，提供3.2 TB/s的内存带宽。一个基于Rocket Core的四核RISC-V管理处理器负责任务分配和PCIe接口管理。\n\n该加速器通过PCIe Gen 5连接到主机服务器（AMD EPYC 9555P）。虽然硅片尚未上市，但模拟结果表明SC4s将实现高FP64每瓦性能，可能超过Nvidia的H200。PEZY强调易用性，采用类似于OpenCL的PZCL编程模型。SC4s被视为对以往几代的改进，专注于提高效率，填补了精度至关重要的高精度应用领域。"
  },
  {
    "id": "45177518",
    "title": "Strong Eventual Consistency – The Big Idea Behind CRDTs",
    "url": "https://lewiscampbell.tech/blog/250908.html",
    "summary": "This article introduces Strong Eventual Consistency (SEC) and argues that CRDTs (Conflict-Free Replicated Data Types) are essential for achieving it, particularly in distributed databases.\n\nThe author starts by defining Eventual Consistency as guaranteeing that updates will eventually reach all nodes and that nodes seeing the same updates will eventually have the same state. SEC, however, replaces \"eventually\" with immediacy, ensuring nodes with the same updates immediately have the same state. This \"Strong Convergence\" implies that conflicts arising from independent updates are automatically and deterministically resolved.\n\nThe author highlights the advantages of SEC: low latency (no coordination needed for reads/writes), high fault tolerance (system continues to function with nearly all nodes failing), and resilience to offline/split network scenarios. These advantages make SEC a superior alternative for local-first applications and low-latency geo-replicated systems.\n\nThe key takeaway is that CRDTs provide the building blocks for SEC, enabling developers to create systems that are both highly available and consistent. The author envisions CRDTs evolving beyond simple application state management to become the foundation of entire distributed databases. Finally, they state they are available for hire.\n",
    "chinese_title": "最终一致性——CRDTs背后的核心思想",
    "chinese_summary": "本文介绍了强最终一致性 (SEC)，并论证了无冲突复制数据类型 (CRDT) 对于实现它至关重要，尤其是在分布式数据库中。\n\n作者首先将最终一致性定义为保证更新最终到达所有节点，并且看到相同更新的节点最终将具有相同的状态。 然而，SEC 将“最终”替换为即时性，确保具有相同更新的节点立即具有相同的状态。 这种“强收敛”意味着由独立更新引起的冲突会被自动且确定性地解决。\n\n作者强调了 SEC 的优势：低延迟（读取/写入无需协调）、高容错性（系统在几乎所有节点发生故障时仍能继续运行）以及对离线/分裂网络场景的弹性。 这些优势使 SEC 成为本地优先应用程序和低延迟地理复制系统的卓越替代方案。\n\n关键要点是 CRDT 为 SEC 提供了构建块，使开发人员能够创建既高度可用又一致的系统。 作者设想 CRDT 不仅仅是简单的应用程序状态管理，而是发展成为整个分布式数据库的基础。 最后，他们表示他们可以被雇佣。"
  },
  {
    "id": "45152252",
    "title": "How to study people who are drunk",
    "url": "https://www.economist.com/science-and-technology/2025/09/03/how-to-study-people-who-are-very-drunk",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "如何研究醉酒的人",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "45186011",
    "title": "Dropbox Paper mobile App Discontinuation",
    "url": "https://help.dropbox.com/installs/paper-mobile-discontinuation",
    "summary": "The Dropbox Paper mobile app and desktop app (beta) will be discontinued on October 9, 2025, to allow Dropbox to focus on the web version (paper.dropbox.com). After this date, the mobile app will no longer function or receive updates, and the desktop app will also stop working. Users are advised to delete the mobile app after the discontinuation date.\n\nAll Paper documents will remain securely stored in Dropbox accounts and can be accessed and edited through paper.dropbox.com on any device. Users can create new documents by logging in to the website on their mobile device and tapping \"Create new doc.\" Editing existing documents is done by tapping the document and then tapping on the text to begin editing.\n\nSharing Paper documents is still possible through paper.dropbox.com or the Dropbox mobile app. Notifications about changes, comments, and mentions will continue to be delivered via email and the Dropbox mobile app.\n\nActive users of the mobile and desktop apps will receive a reminder email about the change on October 1, 2025.\n",
    "chinese_title": "Dropbox Paper 移动应用停止服务",
    "chinese_summary": "Dropbox Paper移动应用和桌面应用（测试版）将于2025年10月9日停止服务，以便Dropbox专注于网页版(paper.dropbox.com)。此日期之后，移动应用将不再运行或接收更新，桌面应用也将停止工作。建议用户在停止服务日期后删除移动应用。\n\n所有Paper文档将继续安全地存储在Dropbox帐户中，并且可以通过任何设备上的paper.dropbox.com访问和编辑。用户可以通过在移动设备上登录网站并点击“创建新文档”来创建新文档。编辑现有文档的方式是点击该文档，然后点击文本开始编辑。\n\n仍然可以通过paper.dropbox.com或Dropbox移动应用分享Paper文档。有关更改、评论和提及的通知将继续通过电子邮件和Dropbox移动应用发送。\n\n移动和桌面应用的活跃用户将于2025年10月1日收到关于此变更的提醒邮件。"
  },
  {
    "id": "45170515",
    "title": "Signal Secure Backups",
    "url": "https://signal.org/blog/introducing-secure-backups/",
    "summary": "Signal is rolling out a new \"Secure Backups\" feature, starting with Android beta, to address the longstanding need for message recovery in case of phone loss or damage. This opt-in feature allows users to create end-to-end encrypted backups of their Signal conversations, ensuring privacy and security.\n\nThe backups include text messages and the last 45 days of media for free. A paid subscription plan ($1.99/month) is offered for backing up media history beyond 45 days and more message history. Signal justifies the cost due to the high storage demands of media, as the nonprofit relies on user support rather than data monetization.\n\nSecure Backups utilize zero-knowledge technology, similar to Signal groups, to prevent backups from being directly linked to user accounts or payment information. A 64-character recovery key, generated on the user's device, is essential for unlocking the backup; Signal cannot recover lost keys. Daily backups replace the previous day's archive, excluding view-once messages and those scheduled to disappear within 24 hours.\n\nSignal plans to expand Secure Backups with options for local storage and cross-platform transfer between Android, iOS, and Desktop. The technology underpinning Secure Backups is designed with privacy as the priority, including encrypting media files a second time and adding padding to obscure file sizes.\n",
    "chinese_title": "信号安全备份",
    "chinese_summary": "Signal 推出全新“安全备份”功能，首先在 Android 测试版中推出，以解决长期以来因手机丢失或损坏导致的消息恢复需求。这项可选功能允许用户创建 Signal 对话的端到端加密备份，确保隐私和安全。\n\n备份包含文本消息和最近 45 天的媒体文件，免费提供。对于备份超过 45 天的媒体历史记录和更多消息历史记录，提供付费订阅计划（1.99 美元/月）。Signal 认为该成本合理，因为媒体存储需求量大，且该非营利组织依赖用户支持，而不是数据货币化。\n\n安全备份采用零知识技术，类似于 Signal 群组，以防止备份直接链接到用户帐户或支付信息。一个在用户设备上生成的 64 个字符的恢复密钥对于解锁备份至关重要；Signal 无法恢复丢失的密钥。每日备份会替换前一天的存档，不包括阅后即焚消息和计划在 24 小时内消失的消息。\n\nSignal 计划扩展安全备份，增加本地存储选项以及 Android、iOS 和桌面平台之间的跨平台传输。安全备份底层技术的设计以隐私为优先事项，包括对媒体文件进行二次加密以及添加填充以模糊文件大小。"
  },
  {
    "id": "45157425",
    "title": "Some thoughts on personal Git hosting",
    "url": "https://shkspr.mobi/blog/2025/09/some-thoughts-on-personal-git-hosting/",
    "summary": "This article explores the author's attempt to move their personal Git projects away from centralized platforms like GitHub to a self-hosted solution for greater control and decentralization. They're experimenting with a Gitea instance hosted by PikaPod, accessible via their own domain.\n\nWhile this offers independence and the ability to switch underlying software (e.g., to Forgejo), the author identifies several drawbacks compared to GitHub:\n\n*   **Network Effects:** GitHub's large user base makes contributions and bug reports easy. Moving to a personal server introduces friction, even with Gitea's OAuth integration, potentially discouraging contributions.\n*   **Forking Limitations:** Forking to GitHub or other platforms is not seamless. Users must manually clone and move repositories, hindering collaboration.\n*   **Discoverability:** Code on personal servers is harder to find than on GitHub, impacting adoption.\n*   **Admin Overhead:** Even with PikaPod's hosting support, managing Gitea, handling spam, and ensuring security requires time and expertise.\n*   **Sponsorship:** Lacks the convenient sponsorship features and network effects of GitHub, potentially reducing income.\n\nUltimately, the author plans to:\n\n*   Keep popular and sponsored repositories on GitHub.\n*   Move smaller repositories to their personal Gitea instance.\n*   Create new projects on the personal instance.\n*   Investigate hosted Forgejo options.\n\nThe article concludes that while self-hosting offers control, it sacrifices network effects, discoverability, and convenience compared to established platforms. The author is trying to find a balance between these factors.\n",
    "chinese_title": "关于个人Git托管的一些思考",
    "chinese_summary": "本文探讨了作者尝试将其个人Git项目从GitHub等中心化平台迁移到自托管解决方案的尝试，旨在获得更大的控制权和去中心化。他们正在试验由PikaPod托管的Gitea实例，并通过自己的域名访问。\n\n虽然这提供了独立性以及切换底层软件（例如，切换到Forgejo）的能力，但作者也发现了与GitHub相比的几个缺点：\n\n*   **网络效应：** GitHub庞大的用户群使得贡献和错误报告变得容易。迁移到个人服务器会带来摩擦，即使使用Gitea的OAuth集成，也可能降低贡献的积极性。\n*   **Fork限制：** Fork到GitHub或其他平台并非无缝衔接。用户必须手动克隆和移动存储库，从而阻碍协作。\n*   **可发现性：** 个人服务器上的代码比GitHub上的代码更难找到，从而影响采用率。\n*   **管理开销：** 即使有PikaPod的托管支持，管理Gitea、处理垃圾邮件和确保安全也需要时间和专业知识。\n*   **赞助：** 缺乏GitHub的便捷赞助功能和网络效应，可能会减少收入。\n\n最终，作者计划：\n\n*   将受欢迎和受赞助的存储库保留在GitHub上。\n*   将较小的存储库迁移到他们的个人Gitea实例。\n*   在个人实例上创建新项目。\n*   研究托管的Forgejo选项。\n\n文章总结说，虽然自托管提供了控制权，但与已建立的平台相比，它牺牲了网络效应、可发现性和便利性。作者正试图在这些因素之间找到平衡。"
  },
  {
    "id": "45164892",
    "title": "I solved a distributed queue problem after 15 years",
    "url": "https://www.dbos.dev/blog/durable-queues",
    "summary": "This article discusses the evolution of distributed task queues, contrasting traditional message brokers like RabbitMQ with more modern durable queues. The author, reflecting on their experience at Reddit, highlights the limitations of RabbitMQ, specifically data loss during crashes and lack of recovery capabilities.\n\nTraditional task queues offer horizontal scalability, flow control, and scheduling, but lack durability. If a process failed mid-task, data could be lost. Durable queues address these shortcomings by using a persistent store, typically a relational database like Postgres, to checkpoint the status of queued tasks. This allows for resuming failed jobs from the last completed step, preventing data loss and reprocessing.\n\nDurable queues offer a workflow-centric approach, recording tasks, inputs, and relationships within the persistent store. This provides significant advantages in fault tolerance and observability. Upon recovery, the system can identify the last completed step and resume from there. Furthermore, the stored workflow data enables easy monitoring and querying of queue and workflow status using SQL.\n\nHowever, durable queues involve a performance tradeoff. While traditional task queues often use in-memory key-value stores like Redis for speed, durable queues rely on slower, durable storage for message brokering and backend operations. Therefore, durable queues are best suited for lower-volume, business-critical tasks, while traditional task queues are better for high-volume, smaller tasks. The article concludes with examples of companies using durable queues and links to further reading.\n",
    "chinese_title": "I solved a distributed queue problem after 15 years",
    "chinese_summary": "This article discusses the evolution of distributed task queues, contrasting traditional message brokers like RabbitMQ with more modern durable queues. The author, reflecting on their experience at Reddit, highlights the limitations of RabbitMQ, specifically data loss during crashes and lack of recovery capabilities.\n\nTraditional task queues offer horizontal scalability, flow control, and scheduling, but lack durability. If a process failed mid-task, data could be lost. Durable queues address these shortcomings by using a persistent store, typically a relational database like Postgres, to checkpoint the status of queued tasks. This allows for resuming failed jobs from the last completed step, preventing data loss and reprocessing.\n\nDurable queues offer a workflow-centric approach, recording tasks, inputs, and relationships within the persistent store. This provides significant advantages in fault tolerance and observability. Upon recovery, the system can identify the last completed step and resume from there. Furthermore, the stored workflow data enables easy monitoring and querying of queue and workflow status using SQL.\n\nHowever, durable queues involve a performance tradeoff. While traditional task queues often use in-memory key-value stores like Redis for speed, durable queues rely on slower, durable storage for message brokering and backend operations. Therefore, durable queues are best suited for lower-volume, business-critical tasks, while traditional task queues are better for high-volume, smaller tasks. The article concludes with examples of companies using durable queues and links to further reading.\n"
  },
  {
    "id": "45193291",
    "title": "Automate compile_flags for C/C++ projects on the Zig build system",
    "url": "https://simonhartcher.com/posts/2025-09-08-announcing-compile-flagz/",
    "summary": "生成摘要时出错",
    "chinese_title": "Automate compile_flags for C/C++ projects on the Zig build system",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45198322",
    "title": "Show HN: Ark v0.5.0 – A Minimal, High-Performance Entity Component System for Go",
    "url": "https://github.com/mlange-42/ark",
    "summary": "生成摘要时出错",
    "chinese_title": "Show HN: Ark v0.5.0 – A Minimal, High-Performance Entity Component System for Go",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45186023",
    "title": "Apple Debuts iPhone 17",
    "url": "https://www.apple.com/newsroom/2025/09/apple-debuts-iphone-17/",
    "summary": "生成摘要时出错",
    "chinese_title": "Apple Debuts iPhone 17",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45186726",
    "title": "A cryptography expert on how Web3 started, and how it’s going",
    "url": "https://spectrum.ieee.org/web3-hardware-security",
    "summary": "生成摘要时出错",
    "chinese_title": "A cryptography expert on how Web3 started, and how it’s going",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45187349",
    "title": "Astronomers spot mysterious gamma-ray explosion, unlike any detected before",
    "url": "https://www.eso.org/public/news/eso2514/",
    "summary": "生成摘要时出错",
    "chinese_title": "Astronomers spot mysterious gamma-ray explosion, unlike any detected before",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45183039",
    "title": "Source code for the X recommendation algorithm",
    "url": "https://github.com/twitter/the-algorithm",
    "summary": "生成摘要时出错",
    "chinese_title": "Source code for the X recommendation algorithm",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45191932",
    "title": "The OSS code that powers Claude and the maintainer they didn't hire",
    "url": "https://agenticweb.nearestnabors.com/p/the-opensource-code-that-powers-claudes",
    "summary": "生成摘要时出错",
    "chinese_title": "The OSS code that powers Claude and the maintainer they didn't hire",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45186705",
    "title": "Subsea Cables Parted in Red Sea Again",
    "url": "https://www.kentik.com/blog/subsea-cables-parted-in-red-sea-again/",
    "summary": "生成摘要时出错",
    "chinese_title": "Subsea Cables Parted in Red Sea Again",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45145176",
    "title": "Yet Another TypeSafe and Generic Programming Candidate for C",
    "url": "https://github.com/brightprogrammer/MisraStdC",
    "summary": "生成摘要时出错",
    "chinese_title": "Yet Another TypeSafe and Generic Programming Candidate for C",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45200411",
    "title": "Poland Has Invoked NATO's Article 4. What Comes Next?",
    "url": "https://www.nytimes.com/2025/09/10/world/europe/what-is-nato-article-4.html",
    "summary": "生成摘要时出错",
    "chinese_title": "Poland Has Invoked NATO's Article 4. What Comes Next?",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45196099",
    "title": "Lossless Listening Arrives on Spotify Premium",
    "url": "https://newsroom.spotify.com/2025-09-10/lossless-listening-arrives-on-spotify-premium-with-a-richer-more-detailed-listening-experience/",
    "summary": "生成摘要时出错",
    "chinese_title": "Lossless Listening Arrives on Spotify Premium",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45180315",
    "title": "Hallucination Risk Calculator",
    "url": "https://github.com/leochlon/hallbayes",
    "summary": "生成摘要时出错",
    "chinese_title": "Hallucination Risk Calculator",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45193234",
    "title": "Exploring the Japanese Toilet Culture Museum",
    "url": "https://spoon-tamago.com/toilet-culture-museum/",
    "summary": "生成摘要时出错",
    "chinese_title": "Exploring the Japanese Toilet Culture Museum",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45197629",
    "title": "Bending Spoons to Buy Vimeo in $1.38B All-Cash Deal",
    "url": "https://www.bloomberg.com/news/articles/2025-09-10/bending-spoons-to-buy-vimeo-in-1-38-billion-all-cash-deal",
    "summary": "生成摘要时出错",
    "chinese_title": "Bending Spoons to Buy Vimeo in $1.38B All-Cash Deal",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45140572",
    "title": "A clickable visual guide to the Rust type system",
    "url": "https://rustcurious.com/elements/",
    "summary": "生成摘要时出错",
    "chinese_title": "A clickable visual guide to the Rust type system",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45179889",
    "title": "You too can run malware from NPM (I mean without consequences)",
    "url": "https://github.com/naugtur/running-qix-malware",
    "summary": "生成摘要时出错",
    "chinese_title": "You too can run malware from NPM (I mean without consequences)",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45151641",
    "title": "How can England possibly be running out of water?",
    "url": "https://www.theguardian.com/news/ng-interactive/2025/aug/17/how-can-england-possibly-be-running-out-of-water",
    "summary": "生成摘要时出错",
    "chinese_title": "How can England possibly be running out of water?",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45171200",
    "title": "iPhone dumbphone",
    "url": "https://stopa.io/post/297",
    "summary": "生成摘要时出错",
    "chinese_title": "iPhone dumbphone",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45170000",
    "title": "I have left Branch and am no longer involved with Nova Launcher",
    "url": "https://teslacoilapps.com/nova/solong.html",
    "summary": "生成摘要时出错",
    "chinese_title": "I have left Branch and am no longer involved with Nova Launcher",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45182418",
    "title": "Disrupting the DRAM roadmap with capacitor-less IGZO-DRAM technology",
    "url": "https://www.imec-int.com/en/articles/disrupting-dram-roadmap-capacitor-less-igzo-dram-technology",
    "summary": "生成摘要时出错",
    "chinese_title": "Disrupting the DRAM roadmap with capacitor-less IGZO-DRAM technology",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45188116",
    "title": "Show HN: Vicinae – a native, Raycast-compatible launcher for Linux",
    "url": "https://github.com/vicinaehq/vicinae",
    "summary": "生成摘要时出错",
    "chinese_title": "Show HN: Vicinae – a native, Raycast-compatible launcher for Linux",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45157278",
    "title": "Cities obey the laws of living things",
    "url": "https://nautil.us/cities-obey-the-laws-of-living-things-1236057/",
    "summary": "生成摘要时出错",
    "chinese_title": "Cities obey the laws of living things",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45155937",
    "title": "How We Built Our lakeFS Iceberg Catalog",
    "url": "https://lakefs.io/blog/how-we-built-lakefs-iceberg-catalog/",
    "summary": "生成摘要时出错",
    "chinese_title": "How We Built Our lakeFS Iceberg Catalog",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45157161",
    "title": "Show HN: An Open Source XR(AR/VR) Operating System",
    "url": "https://www.getxeneva.com/",
    "summary": "生成摘要时出错",
    "chinese_title": "Show HN: An Open Source XR(AR/VR) Operating System",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45155916",
    "title": "Synthesizing Object-Oriented and Functional Design to Promote Re-Use",
    "url": "https://cs.brown.edu/~sk/Publications/Papers/Published/kff-synth-fp-oo/",
    "summary": "生成摘要时出错",
    "chinese_title": "Synthesizing Object-Oriented and Functional Design to Promote Re-Use",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45193218",
    "title": "Tron changed cinema and predicted the future of tech (2022)",
    "url": "https://www.theguardian.com/film/2022/jul/05/tron-steven-lisberger-interview",
    "summary": "生成摘要时出错",
    "chinese_title": "Tron changed cinema and predicted the future of tech (2022)",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45135591",
    "title": "Contracts for C",
    "url": "https://gustedt.wordpress.com/2025/03/10/contracts-for-c/",
    "summary": "生成摘要时出错",
    "chinese_title": "Contracts for C",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45165186",
    "title": "How Britain built some of the world’s safest roads",
    "url": "https://ourworldindata.org/britain-safest-roads-history",
    "summary": "生成摘要时出错",
    "chinese_title": "How Britain built some of the world’s safest roads",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45174297",
    "title": "Liquid Glass in the Browser: Refraction with CSS and SVG",
    "url": "https://kube.io/blog/liquid-glass-css-svg/",
    "summary": "生成摘要时出错",
    "chinese_title": "Liquid Glass in the Browser: Refraction with CSS and SVG",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45192862",
    "title": "Claude's new Code Interpreter review",
    "url": "https://simonwillison.net/2025/Sep/9/claude-code-interpreter/",
    "summary": "生成摘要时出错",
    "chinese_title": "Claude's new Code Interpreter review",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45195267",
    "title": "A love letter to the CSV format (2024)",
    "url": "https://medialab.sciencespo.fr/en/news/a-love-letter-to-the-csv-format/",
    "summary": "生成摘要时出错",
    "chinese_title": "A love letter to the CSV format (2024)",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45142704",
    "title": "Seedship – Text-Based Game",
    "url": "https://philome.la/johnayliff/seedship/play/index.html",
    "summary": "生成摘要时出错",
    "chinese_title": "Seedship – Text-Based Game",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45182111",
    "title": "U.S. added 911k fewer jobs in year through March than reported earlier",
    "url": "https://www.barrons.com/articles/jobs-report-revisions-bls-fed-3d88c77b?st=u8mw75",
    "summary": "生成摘要时出错",
    "chinese_title": "U.S. added 911k fewer jobs in year through March than reported earlier",
    "chinese_summary": "生成摘要时出错"
  }
]