[
  {
    "id": "44533055",
    "title": "Top DNS domains seen on the Quad9 recursive resolver array each day",
    "url": "https://github.com/Quad9DNS/quad9-domains-top500",
    "summary": "This document describes the \"quad9-domains-top500\" data, a daily list of the 500 most frequently queried domain names seen by Quad9's recursive resolvers. It serves as a snapshot of DNS activity observed within the Quad9 infrastructure.\n\nKey takeaways include:\n\n*   **Purpose:** The list reflects the most frequently requested domains on Quad9's resolvers.\n*   **Exclusions:** Top-level domains (TLDs) are excluded.\n*   **Caveats:** The list isn't a simple popularity contest. High ranking can stem from factors like CDN usage, aggressive applications, anti-virus checksums, or poor DNS TTL management. Quad9 attempts to prevent DNS tunneling but might not detect all methods. TTL is also not taken into account, so cached domains may not appear.\n*   **Data collection:** The list is derived from a statistical sample of query responses across a subset of Quad9's servers.\n*   **Interpretation:** A high ranking doesn't automatically equate to popularity; it can indicate issues like inefficient DNS management.\n*   **Contact:** Questions regarding the data can be directed to support@quad9.net.\n",
    "chinese_title": "每天在 Quad9 递归解析器阵列上发现的热门 DNS 域名",
    "chinese_summary": "本文档描述了 \"quad9-domains-top500\" 数据，这是一个每日更新的列表，列出了 Quad9 递归解析器中最常查询的 500 个域名。它反映了 Quad9 基础设施内观察到的 DNS 活动快照。\n\n主要要点包括：\n\n*   **目的：** 该列表反映了 Quad9 解析器上最常请求的域名。\n*   **排除项：** 顶级域名 (TLD) 被排除在外。\n*   **注意事项：** 该列表并非简单的受欢迎程度竞赛。排名靠前可能源于 CDN 使用、激进型应用程序、反病毒校验和或糟糕的 DNS TTL 管理等因素。Quad9 尝试阻止 DNS 隧道，但可能无法检测到所有方法。TTL 也未纳入考量，因此缓存的域名可能不会出现。\n*   **数据收集：** 该列表源自 Quad9 服务器子集上查询响应的统计样本。\n*   **解读：** 排名靠前并不一定等同于受欢迎程度；它可能表明存在诸如低效 DNS 管理之类的问题。\n*   **联系方式：** 有关数据的疑问，请发送至 support@quad9.net。"
  },
  {
    "id": "44533004",
    "title": "Show HN: Vibe Kanban – Kanban board to manage your AI coding agents",
    "url": "https://github.com/BloopAI/vibe-kanban",
    "summary": "Vibe Kanban is a Kanban board designed to streamline the management of AI coding agents like Claude Code, Gemini CLI, Codex, and Amp. It aims to help engineers who are increasingly spending more time orchestrating AI code generation by providing a centralized platform for planning, reviewing, and orchestrating tasks.\n\nKey features include:\n\n*   **Agent Switching:** Easily switch between different coding agents.\n*   **Task Orchestration:** Execute multiple coding agents in parallel or sequence.\n*   **Review and Execution:** Quickly review work and start dev servers.\n*   **Task Tracking:** Track the status of tasks assigned to coding agents.\n*   **Configuration Management:** Centralize configuration of coding agent MCP configs.\n\nThe tool can be installed using `npx vibe-kanban` after authenticating with the desired coding agent. Documentation and support are available on the website and GitHub issues, respectively. Contributions are welcome, but should be discussed with the core team before submitting pull requests.\n\nThe development environment requires Rust, Node.js, and pnpm. Running `pnpm run dev` starts the frontend and backend with live reloading. A build can be created by running `build-npm-package.sh` and then `npm pack` in the `npx-cli` folder. The built package can be run with `npx [GENERATED FILE].tgz`.\n",
    "chinese_title": "展示 HN：Vibe Kanban – 用于管理你的 AI 编码代理的看板",
    "chinese_summary": "Vibe Kanban：旨在简化 Claude Code、Gemini CLI、Codex 和 Amp 等 AI 编码代理管理的看板。它旨在通过提供用于规划、审查和编排任务的中心化平台，帮助那些花费越来越多时间来编排 AI 代码生成的工程师。\n\n主要功能包括：\n\n*   **代理切换：** 轻松切换不同的编码代理。\n*   **任务编排：** 并行或顺序执行多个编码代理。\n*   **审查和执行：** 快速审查工作并启动开发服务器。\n*   **任务跟踪：** 跟踪分配给编码代理的任务状态。\n*   **配置管理：** 集中管理编码代理 MCP 配置。\n\n验证所需的编码代理后，可以使用 `npx vibe-kanban` 安装此工具。 文档和支持分别可在网站和 GitHub issues 上找到。 欢迎贡献，但在提交 pull request 之前应与核心团队讨论。\n\n开发环境需要 Rust、Node.js 和 pnpm。运行 `pnpm run dev` 会启动带有实时重新加载的前端和后端。可以通过运行 `build-npm-package.sh` 然后在 `npx-cli` 文件夹中运行 `npm pack` 来创建构建。 可以使用 `npx [GENERATED FILE].tgz` 运行构建的包。"
  },
  {
    "id": "44530767",
    "title": "Bill Atkinson's psychedelic user interface",
    "url": "https://patternproject.substack.com/p/from-the-mac-to-the-mystical-bill",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "比尔·阿特金森的迷幻用户界面",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "44533464",
    "title": "Astronomers race to study interstellar interloper",
    "url": "https://www.science.org/content/article/astronomers-race-study-interstellar-interloper",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "天文学家竞相研究星际闯入者",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "44531569",
    "title": "Repaste Your MacBook",
    "url": "https://christianselig.com/2025/07/repaste-macbook/",
    "summary": "In July 2025, the author details their experience repasting their aging M1 Pro MacBook Pro to address increasingly loud fan noise, a common issue attributed to dried-up thermal paste. While still performing well, the laptop's fans were becoming intrusive during intensive tasks like compiling code and video editing.\n\nFollowing an iFixit guide, the author replaced the CPU thermal paste with Noctua NT-H2. They discovered Apple uses a special \"Carbon Black\" compound for RAM chips and decided not to replace it due to its unique properties and the difficulty in sourcing it.\n\nThe process wasn't without its challenges. The author unfortunately tore the delicate fan cable, requiring a replacement. Upon reassembling after replacing the fan, the Touch ID sensor cable also tore, rendering the Touch ID function unusable and likely expensive to repair at an Apple Store.\n\nDespite these setbacks, the repasting proved successful. Cinebench tests showed a decrease in maximum CPU temperature (102°C to 96°C) and a significant reduction in maximum fan speed (6,300 RPM to 4,700 RPM) while maintaining a similar performance score. The laptop also idles at a lower temperature.\n\nThe author concludes that while the disassembly process is manageable, the delicate nature of the cables makes it risky. They advise against it for those without experience in small electronics repair, but recommend it to experienced users or via a repair shop if the MacBook is a few years old. The improvement in thermal performance and noise is beneficial, but the potential loss of Touch ID is a significant consideration.\n",
    "chinese_title": "重新贴膜你的MacBook",
    "chinese_summary": "2025年7月，作者详述了自己为解决日益严重的风扇噪音问题，而重新为老化的M1 Pro MacBook Pro涂抹散热硅脂的经历。风扇噪音的常见原因是散热硅脂干涸。虽然笔记本性能依旧良好，但在编译代码和视频编辑等高强度任务期间，风扇噪音变得令人难以忍受。\n\n作者参考iFixit指南，用Noctua NT-H2替换了CPU散热硅脂。他们发现苹果公司为RAM芯片使用了特殊的“碳黑”化合物，由于其独特的性能和难以采购，因此决定不更换。\n\n过程并非一帆风顺。作者不幸撕裂了脆弱的风扇电缆，需要更换。更换风扇重新组装后，Touch ID传感器电缆也被撕裂，导致Touch ID功能无法使用，而且很可能在Apple Store维修费用高昂。\n\n尽管遭遇这些挫折，重新涂抹硅脂仍然奏效。 Cinebench测试表明，最高CPU温度降低（102°C降至96°C），最大风扇转速显著降低（6,300 RPM降至4,700 RPM），同时保持了相似的性能得分。笔记本电脑的空闲温度也降低了。\n\n作者总结说，虽然拆卸过程可以控制，但电缆的脆弱性使其具有风险。他们建议没有小型电子设备维修经验的人不要尝试，但建议有经验的用户或通过维修店进行维修，如果MacBook使用了几年。散热性能和噪音的改善是有益的，但Touch ID功能的潜在损失是一个重要的考虑因素。"
  },
  {
    "id": "44533337",
    "title": "Turmeric is the culprit in a global lead poisoning mystery (2024)",
    "url": "https://www.npr.org/sections/goats-and-soda/2024/09/23/nx-s1-5011028/detectives-mystery-lead-poisoning-new-york-bangladesh",
    "summary": "In the 1980's, to make turmeric roots more attractive, some farmers in Bangladesh began adding lead chromate, a toxic yellow pigment typically used in industrial paints. This practice, initially a solution to discoloration caused by floods, became widespread due to the enhanced marketability of the brightly colored turmeric. This widespread contamination led to a global health crisis, affecting both pregnant women and children in Bangladesh and even Bangladeshi communities in New York City.\n\nThe investigation into the lead poisoning, spearheaded by New York City health detectives and a California Ph.D. student named Jenna Forsyth, revealed that turmeric was the primary culprit. Forsyth's research, prompted by alarmingly high lead levels in pregnant women in rural Bangladesh, traced the source back to the lead-laced turmeric.\n\nIn 2019, the Bangladesh Food Safety Authority responded swiftly. They issued public warnings, distributed informational flyers, conducted workshops with farmers and mill owners, and even held \"mobile courts\" to confiscate contaminated turmeric and fine vendors. As a result, lead contamination in turmeric samples plummeted from 47% to 0%, and blood lead levels in local farmers and pregnant women also significantly decreased. This case highlights the devastating impact of lead poisoning and the effectiveness of swift, decisive action in addressing such crises.\n",
    "chinese_title": "姜黄是全球铅中毒谜案的罪魁祸首 (2024)",
    "chinese_summary": "20世纪80年代，为了使姜黄根更具吸引力，孟加拉国的一些农民开始添加铬酸铅，一种通常用于工业涂料的有毒黄色颜料。这种做法最初是为了解决洪水造成的变色问题，后来由于颜色鲜艳的姜黄更容易销售而变得普遍。这种广泛的污染导致了一场全球健康危机，影响了孟加拉国的孕妇和儿童，甚至纽约市的孟加拉社区。\n\n由纽约市卫生侦探和一位名叫Jenna Forsyth的加州博士生牵头的铅中毒调查显示，姜黄是罪魁祸首。 Forsyth的研究源于孟加拉国农村孕妇体内惊人的高铅水平，并将源头追溯到掺铅姜黄。\n\n2019年，孟加拉国食品安全局迅速做出回应。他们发布了公共警告，分发了信息传单，与农民和磨坊主举办了研讨会，甚至设立了“流动法庭”没收受污染的姜黄并对供应商处以罚款。 结果，姜黄样品中的铅污染率从47%骤降至0%，当地农民和孕妇的血铅水平也显着降低。 该案例突显了铅中毒的破坏性影响以及在解决此类危机时迅速、果断行动的有效性。"
  },
  {
    "id": "44531120",
    "title": "At Least 13 People Died by Suicide Amid U.K. Post Office Scandal, Report Says",
    "url": "https://www.nytimes.com/2025/07/10/world/europe/uk-post-office-scandal-report.html",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "报告称，英国邮局丑闻致至少13人自杀身亡。",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "44532306",
    "title": "Upgrading an M4 Pro Mac mini's storage for half the price",
    "url": "https://www.jeffgeerling.com/blog/2025/upgrading-m4-pro-mac-minis-storage-half-price",
    "summary": "This article details upgrading the internal storage of an M4 Pro Mac mini using a DIY kit from M4-SSD. The author upgraded a Mac mini from 512GB to 4TB, documenting the process in a video. While the physical upgrade is relatively straightforward, requiring basic laptop hardware skills, removing the rear plastic cover can be tricky.\n\nA critical aspect is the need for a DFU (Device Firmware Update) restore after the upgrade. The author clarifies that the DFU restore can be performed not only with an Apple Silicon Mac but also with many Intel Macs featuring a T2 chip. This involves connecting to the Mac mini's Thunderbolt port and holding the power button during power-up.\n\nPerformance testing compared the upgraded internal SSD with an external Thunderbolt 5 NVMe enclosure. The upgraded 4TB internal module showed noticeably better write speeds due to having more flash chips. The external drive, although fast, experienced occasional slowdowns, likely due to DRAM cache limitations.\n\nThe article concludes that while the $699 M4 Pro 4TB SSD upgrade kit is pricey compared to standard NVMe SSDs, it's significantly cheaper than Apple's $1,200 offering for the same capacity. The author highlights the consistent speed and reliability of the internal storage.\n",
    "chinese_title": "以半价升级 M4 Pro Mac mini 的存储",
    "chinese_summary": "本文详细介绍了使用 M4-SSD 的 DIY 套件升级 M4 Pro Mac mini 内部存储的过程。作者将一台 Mac mini 从 512GB 升级到 4TB，并在视频中记录了整个过程。虽然物理升级相对简单，只需要基本的笔记本电脑硬件技能，但拆卸后部塑料盖可能比较棘手。\n\n一个关键方面是升级后需要进行 DFU (设备固件更新) 恢复。作者明确指出，DFU 恢复不仅可以用 Apple Silicon Mac 进行，也可以用许多配备 T2 芯片的 Intel Mac 进行。 这涉及到连接到 Mac mini 的 Thunderbolt 端口并在开机时按住电源按钮。\n\n性能测试比较了升级后的内部 SSD 与外部 Thunderbolt 5 NVMe 硬盘盒。升级后的 4TB 内部模块显示出明显更好的写入速度，因为其具有更多的闪存芯片。 外部驱动器虽然速度很快，但偶尔会出现速度下降的情况，这可能是由于 DRAM 缓存的限制。\n\n文章最后总结说，虽然 699 美元的 M4 Pro 4TB SSD 升级套件与标准 NVMe SSD 相比价格昂贵，但它比苹果公司提供的相同容量的 1200 美元的升级便宜得多。作者强调了内部存储的稳定速度和可靠性。"
  },
  {
    "id": "44521225",
    "title": "Andrew Ng: Building Faster with AI [video]",
    "url": "https://www.youtube.com/watch?v=RNJCfif1dPY",
    "summary": "This appears to be a YouTube video listing by Andrew Ng titled \"Building Faster with AI.\" However, the provided \"Content\" section is simply boilerplate YouTube footer information (copyright, terms, privacy, etc.). It doesn't contain any information about the video's actual content.\n\nTherefore, a proper summary is impossible. Based on the title, it's likely that the video discusses how AI can be used to accelerate or improve the building process, possibly in the context of software development, machine learning models, or even physical construction. Without further details from the video itself, the summary is limited to that educated guess.\n",
    "chinese_title": "吴恩达：用人工智能加速构建 [视频]",
    "chinese_summary": "这似乎是吴恩达在YouTube上发布的视频列表，标题为“利用人工智能加速构建”。然而，提供的“内容”部分只是YouTube通用的页脚信息（版权、条款、隐私等），不包含关于视频实际内容的任何信息。\n\n因此，无法给出恰当的总结。根据标题推测，该视频可能讨论如何利用人工智能来加速或改进构建过程，可能是在软件开发、机器学习模型，甚至物理建造的背景下。在没有更多来自视频本身的细节的情况下，总结只能局限于这种猜测。"
  },
  {
    "id": "44533982",
    "title": "Pa. House passes 'click-to-cancel' subscription bills",
    "url": "https://www.pennlive.com/news/2025/07/pa-house-passes-click-to-cancel-subscription-bills-as-court-throws-out-federal-rule.html",
    "summary": "Pennsylvania's House of Representatives has passed two bills targeting deceptive subscription practices, mirroring federal regulations that were recently struck down by a federal appeals court. The first bill cracks down on \"negative option\" agreements where consumers are automatically enrolled in services unless they actively opt out. Sponsored by Rep. Lisa Borowski, it mandates notifications before renewals and requires consumers be able to cancel using the same method they used to subscribe. The second bill, sponsored by Rep. Joe Ciresi, mandates that online subscriptions be cancellable online, with clearly displayed information on renewals and cancellations.\n\nThe state legislation aims to address the difficulty consumers face in canceling subscriptions, a problem Rep. Ciresi says his constituents and family have experienced. While some businesses initially resisted, Ciresi emphasizes the goal is to help consumers, not harm businesses.\n\nThe bills exclude services regulated by the Public Utility Commission, the Federal Communications Commission, and gyms (though this may be amended). Despite the setback at the federal level, Pennsylvania hopes to join other states like New York, California, Minnesota, Tennessee, and Virginia in enacting similar consumer protection policies. The bills passed with bipartisan support and now await consideration by the state Senate and Governor Josh Shapiro's signature.\n",
    "chinese_title": "宾州众议院通过“一键取消”订阅法案",
    "chinese_summary": "宾夕法尼亚州众议院通过两项法案，旨在打击欺骗性订阅行为，与近期被联邦上诉法院驳回的联邦法规类似。第一项法案打击“否定选择”协议，即消费者在未主动选择退出服务的情况下被自动注册。该法案由众议员丽莎·博罗夫斯基发起，规定续订前必须发出通知，并要求消费者能够以与订阅相同的方式取消订阅。第二项法案由众议员乔·奇雷西发起，规定在线订阅必须可以在线取消，并明确显示续订和取消信息。\n\n该州立法旨在解决消费者在取消订阅时遇到的困难，奇雷西众议员表示他的选民和家人都经历过这个问题。虽然一些企业最初抵制，但奇雷西强调，其目标是帮助消费者，而不是损害企业。\n\n这些法案不包括受公共事业委员会、联邦通信委员会和健身房监管的服务（尽管这可能会被修改）。尽管联邦层面遭遇挫折，宾夕法尼亚州希望加入纽约、加利福尼亚、明尼苏达、田纳西和弗吉尼亚等其他州，制定类似的消费者保护政策。这些法案以两党支持获得通过，目前正等待州参议院的审议以及州长乔什·夏皮罗的签署。"
  },
  {
    "id": "44531697",
    "title": "AI agent benchmarks are broken",
    "url": "https://ddkang.substack.com/p/ai-agent-benchmarks-are-broken",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "AI智能体基准测试已失效",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "44531707",
    "title": "Overtourism in Japan, and how it hurts small businesses",
    "url": "https://craigmod.com/ridgeline/210/",
    "summary": "Craig Mod's \"Overtourism in Japan, and How it Hurts Small Businesses\" explores the detrimental effects of mass tourism, fueled by social media and cheap travel, on the character and community of Japanese cities, particularly Kyoto. The article argues that overtourism crushes the small businesses that form the bedrock of a city's unique identity, as these businesses are often built on serving locals and creating community hubs, not catering to transient, selfie-seeking tourists.\n\nThe author highlights the experience of a Kyoto bar owner who was distraught after going viral on TikTok, attracting an influx of customers he couldn't connect with. Mod suggests that algorithms and cheap travel packages are driving this phenomenon, leading to a \"Disneyland flipflop\" where tourists fail to see the cities they are visiting as living places, instead treating them as attractions to be consumed.\n\nWhile acknowledging the negative impacts, Mod remains optimistic, pointing out that a growing segment of travelers (about 15%) are genuinely curious and respectful, seeking authentic experiences and contributing positively to local economies. He encourages these travelers to explore lesser-known cities like Morioka and Yamaguchi, which offer unique cultural experiences without the overwhelming crowds of Kyoto.\n\nThe article proposes practical solutions for managing overtourism, such as eliminating the tax-free shopping program, raising the exit fee, and implementing differential entrance fees for popular tourist sites. The ultimate goal is to redirect tourism to less-visited areas, ensuring sustainable growth and preserving the charm of Japan's unique small businesses.\n",
    "chinese_title": "日本过度旅游，以及它如何损害小型企业",
    "chinese_summary": "克雷格·莫德：《日本过度旅游及其对小型企业的影响》探讨了由社交媒体和廉价旅行推动的大众旅游对日本城市（尤其是京都）的特色和社区造成的有害影响。文章认为，过度旅游摧毁了构成城市独特身份基石的小型企业，因为这些企业通常建立在服务当地居民和创建社区中心的基础上，而不是迎合短暂的、寻求自拍的游客。\n\n作者着重讲述了一位京都酒吧老板在TikTok上爆红后，因涌入大量无法建立联系的顾客而感到沮丧的经历。莫德认为，算法和廉价旅游套餐正在推动这一现象，导致“迪士尼乐园式的倒戈”，游客们未能将他们访问的城市视为生活场所，而是将其视为有待消费的景点。\n\n在承认负面影响的同时，莫德仍然保持乐观，他指出，越来越多的旅行者（约15%）是真正的好奇和尊重，他们寻求真实的体验，并为当地经济做出积极贡献。他鼓励这些旅行者探索鲜为人知的城市，如盛冈和山口，这些城市提供独特的文化体验，而没有京都那样拥挤的人群。\n\n文章提出了管理过度旅游的实用解决方案，例如取消免税购物计划，提高离境税，并对热门旅游景点实行差异化门票价格。最终目标是将旅游业导向游客较少的地区，确保可持续增长并保护日本独特小型企业的魅力。"
  },
  {
    "id": "44526015",
    "title": "Show HN: Pangolin – Open source alternative to Cloudflare Tunnels",
    "url": "https://github.com/fosrl/pangolin",
    "summary": "Pangolin is an open-source, self-hosted alternative to Cloudflare Tunnels, offering a zero-trust tunneled reverse proxy server with built-in identity and access control. It securely exposes private resources on distributed networks by connecting isolated networks through encrypted WireGuard tunnels, eliminating the need for open ports.\n\nKey features include reverse proxying via WireGuard, automated SSL certificates, load balancing, and support for various TCP/UDP services. Pangolin offers centralized authentication with platform SSO, access control rules based on IPs and URL paths, TOTP two-factor authentication, and organization/role-based access management. It integrates with external IdPs like Authentik, Keycloak, and Okta for auto-provisioning.\n\nThe platform boasts a simple dashboard UI, Docker Compose-based deployment, an API with Swagger documentation, and a modular design for extending functionality with Traefik plugins (e.g., CrowdSec). Use cases include bypassing port restrictions, deploying services for businesses, and managing IoT networks. Newt, a custom user space WireGuard client, is provided for simplified connectivity.\n\nThe project is dual-licensed under AGPL-3 and a commercial license, with contributions welcome via the repository. It's under heavy development, and the roadmap is available on the project board.\n",
    "chinese_title": "Show HN: Pangolin – Cloudflare Tunnels 的开源替代方案",
    "chinese_summary": "穿山甲 (Pangolin)：Cloudflare Tunnels 的开源自托管替代方案，提供具有内置身份和访问控制的零信任隧道反向代理服务器。它通过加密的 WireGuard 隧道连接隔离的网络，安全地暴露分布式网络上的私有资源，从而无需开放端口。\n\n主要功能包括通过 WireGuard 进行反向代理、自动 SSL 证书、负载均衡以及对各种 TCP/UDP 服务的支持。穿山甲提供具有平台 SSO 的集中式身份验证、基于 IP 和 URL 路径的访问控制规则、TOTP 双因素身份验证以及基于组织/角色的访问管理。它与 Authentik、Keycloak 和 Okta 等外部 IdP 集成，以实现自动配置。\n\n该平台拥有一个简单的仪表板 UI、基于 Docker Compose 的部署、带有 Swagger 文档的 API 以及用于使用 Traefik 插件（例如 CrowdSec）扩展功能的模块化设计。用例包括绕过端口限制、为企业部署服务以及管理物联网网络。Newt，一个自定义的用户空间 WireGuard 客户端，用于简化连接。\n\n该项目在 AGPL-3 和商业许可下双重许可，欢迎通过存储库贡献。它正在大力开发中，路线图可在项目板上找到。"
  },
  {
    "id": "44533403",
    "title": "Kimi K2",
    "url": "https://twitter.com/Kimi_Moonshot/status/1943687594560332025",
    "summary": "The provided text, titled \"Kimi K2\", is essentially an error message from X Corp. (formerly Twitter). It states that JavaScript is disabled in the user's browser and that X.com requires JavaScript to function. The message instructs the user to enable JavaScript or switch to a supported browser. It also provides links to the X.com Help Center for a list of supported browsers. Finally, it includes standard website footer information such as links to the Terms of Service, Privacy Policy, Cookie Policy, Imprint, Advertising Information, and the copyright notice for X Corp. (© 2025). In short, the content is not an article but a browser compatibility error message preventing the user from accessing the X.com website.\n",
    "chinese_title": "Kimi K2",
    "chinese_summary": "“Kimi K2”是一个来自X Corp.（前身为Twitter）的错误信息，提示用户的浏览器禁用了JavaScript，X.com需要JavaScript才能运行。该信息指示用户启用JavaScript或切换到支持的浏览器，并提供X.com帮助中心的链接以查看支持的浏览器列表。此外，还包括标准的网站页脚信息，如服务条款、隐私政策、Cookie政策、版本说明、广告信息以及X Corp.的版权声明（© 2025）。简而言之，此内容并非文章，而是一个阻止用户访问X.com网站的浏览器兼容性错误信息。"
  },
  {
    "id": "44533843",
    "title": "In a First, Solar Was Europe's Biggest Source of Power Last Month",
    "url": "https://e360.yale.edu/digest/solar-biggest-power-source-europe-june-2025",
    "summary": "For the first time, solar energy became the largest source of electricity in the European Union in June, supplying a record 22% of the bloc's power. This milestone was reached as at least 13 countries saw their solar output hit new monthly highs. In the Netherlands and Greece, solar generated more than 40% and 35% of electricity, respectively.\n\nThis surge in solar power helped Europe manage a severe heat wave with temperatures exceeding 110°F (43°C). Solar power was most abundant during midday, coinciding with peak demand for air conditioning, which eased strain on the power grid and helped prevent blackouts.\n\nNuclear power was the second-largest source of electricity, followed by wind, natural gas, and hydropower. Coal's contribution dropped to a new monthly low of 6%, and 15 EU countries are now coal-free. Experts highlight the importance of solar energy in mitigating the impact of increasingly severe heat waves, worsened by climate change. A study from Imperial College London linked fossil fuel burning to a significant increase in heat-related deaths in Europe.\n",
    "chinese_title": "上月太阳能首次成为欧洲最大电力来源",
    "chinese_summary": "六月，太阳能首次成为欧盟最大的电力来源，创下该集团电力供应的22%的纪录。至少有13个国家的太阳能发电量达到新的月度峰值，促成了这一里程碑的实现。在荷兰和希腊，太阳能分别产生了超过40%和35%的电力。\n\n太阳能的激增帮助欧洲应对了超过华氏110度（摄氏43度）的严重热浪。太阳能在中午时分最为丰富，与空调需求的峰值相吻合，缓解了电网的压力并有助于防止停电。\n\n核能是第二大电力来源，其次是风能、天然气和水力发电。煤炭的贡献降至每月新低的6%，目前有15个欧盟国家已实现无煤化。专家强调了太阳能在减轻日益严重的热浪影响方面的重要性，而气候变化加剧了热浪。伦敦帝国理工学院的一项研究将化石燃料的燃烧与欧洲因热浪导致的死亡人数显著增加联系起来。"
  },
  {
    "id": "44528943",
    "title": "OpenFront: Realtime Risk-like multiplayer game in the browser",
    "url": "https://openfront.io/",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "OpenFront：浏览器实时类风险多人游戏",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "44530922",
    "title": "Recovering from AI Addiction",
    "url": "https://internetaddictsanonymous.org/internet-and-technology-addiction/signs-of-an-addiction-to-ai/",
    "summary": "This article from Internet and Technology Addicts Anonymous (ITAA) addresses the emerging issue of AI addiction, defining it as the compulsive and harmful use of AI-powered applications like chatbots, AI art generators, and AI companions. It emphasizes that AI addiction is a subset of internet and technology addiction, which can alter brain function and impact focus, mood regulation, and relationships.\n\nThe article highlights common symptoms of AI addiction, including using AI longer than intended, relying on AI for validation, experiencing anxiety when not using AI, and neglecting offline responsibilities. It provides a questionnaire to help individuals identify potential AI addiction.\n\nIt discusses the broader context of internet addiction disorder (IAD) and its negative impacts on mental, emotional, and physical health, including structural brain changes similar to substance addiction. Risks include impulse control issues, ADHD, anxiety, substance use, sleep problems, and even suicidal ideation.\n\nITAA offers a solution based on the Alcoholics Anonymous model, emphasizing community support, abstinence from addictive behaviors, and working the Twelve Steps. It outlines practical steps for recovery, such as attending meetings, making outreach calls, identifying and abstaining from triggering behaviors, and finding a sponsor.\n\nThe article also explores various types of internet addiction, including social media, streaming, phone, video game, porn, and information addiction. It underscores the importance of defining individual sobriety and using technology purposefully, promoting a balanced lifestyle.\n",
    "chinese_title": "摆脱人工智能依赖症",
    "chinese_summary": "匿名网络与科技成瘾者协会（ITAA）的这篇文章探讨了人工智能成瘾这一新兴问题，将其定义为对聊天机器人、人工智能艺术生成器和人工智能伴侣等人工智能应用程序的强迫性和有害使用。文章强调，人工智能成瘾是网络与科技成瘾的一个子集，它会改变大脑功能，影响注意力、情绪调节和人际关系。\n\n文章重点介绍了人工智能成瘾的常见症状，包括使用人工智能的时间超出预期、依靠人工智能来获得认可、不使用人工智能时感到焦虑以及忽视线下责任。文章还提供了一份问卷，以帮助个人识别潜在的人工智能成瘾。\n\n文章讨论了网络成瘾症（IAD）的更广泛背景及其对心理、情感和身体健康的负面影响，包括与物质成瘾类似的大脑结构变化。风险包括冲动控制问题、多动症、焦虑、药物滥用、睡眠问题，甚至自杀意念。\n\nITAA提供了一种基于匿名戒酒互助会模式的解决方案，强调社区支持、戒除成瘾行为以及完成十二个步骤。文章概述了恢复的实际步骤，例如参加会议、拨打外展电话、识别并戒除触发行为以及寻找赞助人。\n\n文章还探讨了各种类型的网络成瘾，包括社交媒体、流媒体、手机、电子游戏、色情和信息成瘾。文章强调了明确个人清醒状态和有目的地使用技术的重要性，从而促进平衡的生活方式。"
  },
  {
    "id": "44528509",
    "title": "The day someone created 184 billion Bitcoin (2020)",
    "url": "https://decrypt.co/39750/184-billion-bitcoin-anonymous-creator",
    "summary": "The provided text is not an article, but rather a list of cryptocurrency prices and their percentage changes. There is no narrative, story, or event described, therefore it is not possible to provide a summary about someone creating 184 billion Bitcoin in 2020. The text simply displays current market data for a variety of cryptocurrencies.\n",
    "chinese_title": "有人创造了1840亿枚比特币的那一天（2020）",
    "chinese_summary": "提供的文本并非文章，而是加密货币价格及其百分比变化的列表。其中没有叙述、故事或事件描述，因此无法提供关于某人在2020年创造1840亿比特币的摘要。 该文本仅显示各种加密货币的当前市场数据。"
  },
  {
    "id": "44527947",
    "title": "LLM Inference Handbook",
    "url": "https://bentoml.com/llm/",
    "summary": "The \"LLM Inference Handbook\" is a comprehensive resource designed for engineers deploying, scaling, and operating Large Language Models (LLMs) in production. It consolidates fragmented knowledge often found across various sources into a single, accessible guide.\n\nThe handbook covers essential aspects of LLM inference, including:\n\n*   **Core concepts and performance metrics:** Time to First Token (TTFT), Tokens per Second (TPS), and goodput are explained.\n*   **Optimization techniques:** Strategies like continuous batching and prefix caching are detailed.\n*   **Operational best practices:** Providing practical guidance for deployment and scaling.\n\nThe motivation behind the handbook is to address the lack of a unified resource for LLM inference, bridging the gap between academic knowledge and practical application. It focuses on what is most impactful for real-world deployments, avoiding irrelevant technical details.\n\nThe handbook can be read sequentially or used as a reference. It is continuously updated to reflect the evolving landscape of LLM inference. Contributions are encouraged via GitHub to ensure its accuracy and relevance.\n",
    "chinese_title": "LLM推理手册",
    "chinese_summary": "《LLM推理手册》是为在生产环境中部署、扩展和运行大型语言模型(LLM)的工程师设计的综合资源。它将分散在各种来源的知识整合到一个易于访问的指南中。\n\n该手册涵盖了LLM推理的各个重要方面，包括：\n\n*   **核心概念和性能指标：** 解释了首个令牌时间(TTFT)、每秒令牌数(TPS)和有效吞吐量。\n*   **优化技术：** 详细介绍了连续批处理和前缀缓存等策略。\n*   **运营最佳实践：** 为部署和扩展提供实用指导。\n\n编写该手册的动机是解决LLM推理领域缺乏统一资源的问题，弥合学术知识与实际应用之间的差距。它专注于对实际部署影响最大的内容，避免无关的技术细节。\n\n该手册可以按顺序阅读，也可以作为参考。它会持续更新，以反映LLM推理领域不断变化的情况。鼓励通过GitHub贡献，以确保其准确性和相关性。"
  },
  {
    "id": "44490308",
    "title": "The ChompSaw: A benchtop power tool that's safe for kids to use",
    "url": "https://www.core77.com/posts/137602/The-ChompSaw-A-Benchtop-Power-Tool-Thats-Safe-for-Kids-to-Use",
    "summary": "This Core77 article introduces the ChompSaw, a benchtop power tool designed for children to safely cut cardboard. Created by product designers Kausi Raman and Max Liechty, the ChompSaw aims to provide a safer alternative to potentially dangerous tools like jigsaws and scroll saws, which are fun for freeform cuts but can cause serious injury.\n\nThe ChompSaw utilizes an oscillating cutter safely housed beneath a puck-like protrusion, preventing finger contact during use. It effectively functions as a nibbler, collecting the cardboard scraps in a bin below for easy recycling. The tool is priced at $250.\n\nThe comment section features differing opinions on the tool's necessity. One commenter argues that children are capable of understanding the dangers of sharp tools and shouldn't be underestimated. Another suggests that liability concerns are the driving force behind its creation. Another commenter liked the idea of this tool.\n",
    "chinese_title": "ChompSaw：一款适合儿童使用的台式电动工具",
    "chinese_summary": "Core77文章介绍：ChompSaw儿童安全纸板切割机。该桌面电动工具由产品设计师Kausi Raman和Max Liechty设计，旨在提供一种比曲线锯和线锯等潜在危险工具更安全的选择。曲线锯和线锯虽然可以进行自由切割，但可能造成严重伤害。\n\nChompSaw采用振动切割器，安全地隐藏在冰球状突起下方，防止使用时手指接触。它有效地发挥了啃咬器的作用，并将纸板边角料收集在下方的垃圾箱中，方便回收。该工具的售价为250美元。\n\n评论区对该工具的必要性存在不同意见。一位评论者认为，孩子们能够理解锋利工具的危险性，不应被低估。另一位评论者认为，责任问题是其创作的驱动力。另一位评论者喜欢这个工具的想法。"
  },
  {
    "id": "44532913",
    "title": "I'm done with social media – Or: why I have a blog now",
    "url": "https://www.carolinecrampton.com/im-done-with-social-media/",
    "summary": "In 2024, the author embarked on a mission to master social media to promote her book, *A Body Made of Glass*. Despite training sessions, expert advice, and consistent effort posting on Instagram and TikTok, she found the experience deeply unsettling and ultimately ineffective. She felt pressured to turn her life into content, a shift she describes as a sinister alteration of perspective.\n\nThe algorithms showed little interest in her posts, failing to reach new readers. She realized the success stories on BookTok stemmed from genuine reader recommendations and publisher efforts, not author-driven viral videos. Her social media activity felt inauthentic and boastful, lacking a genuine community. In-person interactions revealed that readers were drawn to her other work, not her social media presence.\n\nThe author concluded that social media was a poor investment of time and energy, with negative impacts on her mental state. She questions the pressure on non-celebrity authors to be active on social media, suspecting it's a way for the publishing industry to transfer responsibility and keep authors occupied.\n\nShe views the \"creator economy\" as a pyramid scheme, where only a few benefit from the free content uploaded by the masses. Social media, for her, is not a viable part of a creative career. She recounts her history with social media, highlighting its addictive nature and the pressure she felt to maintain a presence as a journalist. She contrasts this with a blog, which she hopes will offer a more authentic connection with her audience.\n",
    "chinese_title": "我不用社交媒体了——或者：为什么我现在有了博客",
    "chinese_summary": "2024年，作者为了宣传她的书《玻璃之躯》而开始学习社交媒体。尽管接受了培训课程、专家建议，并在Instagram和TikTok上持续发布内容，她发现这种体验令人不安且最终无效。她感到有压力将自己的生活变成内容，她将这种转变描述为一种险恶的视角扭曲。\n\n算法对她的帖子兴趣寥寥，未能触达新的读者。她意识到BookTok上的成功案例源于真正读者的推荐和出版商的努力，而非作者驱动的病毒式视频。她的社交媒体活动感觉不真诚且自夸，缺乏真正的社群。线下交流表明，读者是被她的其他作品吸引，而非她的社交媒体存在。\n\n作者得出结论，社交媒体是对时间和精力的一种糟糕投资，对她的精神状态产生负面影响。她质疑非名人作家活跃于社交媒体的压力，怀疑这是出版业转移责任和让作者忙碌的一种方式。\n\n她认为“创作者经济”是一种金字塔骗局，只有少数人能从大众上传的免费内容中获益。对她来说，社交媒体不是创意职业的可行组成部分。她回顾了她与社交媒体的历史，强调了其成瘾性以及她作为记者所感受到的保持活跃的压力。她将此与博客进行了对比，她希望博客能够提供与受众更真实的联系。"
  },
  {
    "id": "44534104",
    "title": "U.S. abandons hunt for signal of cosmic inflation",
    "url": "https://www.science.org/content/article/u-s-abandons-hunt-signal-cosmic-inflation",
    "summary": "The article \"U.S. abandons hunt for signal of cosmic inflation\" reports that the U.S. National Science Foundation (NSF) has decided to halt funding for the CMB-S4 project, a planned array of ground-based telescopes designed to search for faint signals of cosmic inflation in the cosmic microwave background (CMB). Cosmic inflation is a theoretical period of extremely rapid expansion in the very early universe, and detecting its signature in the CMB would provide crucial evidence supporting this theory.\n\nThe primary goal of CMB-S4 was to detect B-mode polarization in the CMB, a specific pattern that would indicate the presence of gravitational waves generated during inflation. Detecting these gravitational waves would offer insights into the energy scale of the universe during this inflationary period.\n\nWhile the NSF has pulled out of CMB-S4, the article emphasizes that the project is not entirely dead. International partners, particularly in Japan and Canada, are reportedly still interested in contributing, and the possibility of restarting the US-led effort in the future has not been completely ruled out.\n\nThe article suggests that budget constraints within the NSF’s astronomy division, coupled with the high cost of the CMB-S4 project, led to the decision. The scientific community expresses disappointment, as CMB-S4 was considered a high-priority project for probing fundamental physics and cosmology. However, some researchers acknowledged the challenging budgetary climate and the need for difficult choices. The future of the project remains uncertain, contingent on securing sufficient international funding and a potential re-evaluation by the NSF in the future.\n",
    "chinese_title": "美国放弃搜寻宇宙膨胀信号",
    "chinese_summary": "美国放弃搜寻宇宙膨胀信号"
  },
  {
    "id": "44490510",
    "title": "Postgres LISTEN/NOTIFY does not scale",
    "url": "https://www.recall.ai/blog/postgres-listen-notify-does-not-scale",
    "summary": "Recall.ai experienced Postgres downtime due to a write-heavy workload from thousands of meeting bots writing structured data. Investigation revealed a bottleneck with Postgres' LISTEN/NOTIFY feature. The core issue: when a NOTIFY query is issued within a transaction, it acquires a global `AccessExclusiveLock` on the entire database during the commit phase. This effectively serializes all commits, causing immense load and downtime under high concurrency.\n\nThe problem manifested as massive spikes in database load and active awaiting sessions, coupled with a paradoxical drop in CPU, disk I/O, and network traffic. The log analysis revealed numerous processes waiting for the `AccessExclusiveLock` during commit.\n\nTo confirm the issue, Recall.ai ran load tests with and without the LISTEN/NOTIFY code. The tests showed that with NOTIFY, the database's CPU and I/O load plummeted during high load, indicating a global mutex bottleneck. Without NOTIFY, the database fully utilized available CPU, handling load spikes without stalling.\n\nThe solution was to migrate away from LISTEN/NOTIFY, tracking the relevant logic at the application layer instead. This resolved the lock contention and stabilized the Postgres database. Recall.ai highlights the importance of avoiding LISTEN/NOTIFY in high-concurrency write scenarios where database scalability is crucial.\n",
    "chinese_title": "Postgres LISTEN/NOTIFY 无法扩展",
    "chinese_summary": "Recall.ai 因大量会议机器人写入结构化数据导致Postgres出现宕机，原因是写入密集型负载。调查发现，Postgres的LISTEN/NOTIFY功能存在瓶颈。核心问题在于：当事务中发出NOTIFY查询时，会在提交阶段获取整个数据库的全局`AccessExclusiveLock`锁。 这实际上使所有提交串行化，导致高并发下的巨大负载和宕机。\n\n该问题表现为数据库负载和活动等待会话的大幅飙升，以及 CPU、磁盘 I/O 和网络流量的反常下降。日志分析显示，大量进程在提交期间等待`AccessExclusiveLock`锁。\n\n为了确认问题，Recall.ai 运行了包含和不包含 LISTEN/NOTIFY 代码的负载测试。测试表明，在使用 NOTIFY 时，数据库的 CPU 和 I/O 负载在高负载期间骤降，表明存在全局互斥锁瓶颈。在没有 NOTIFY 的情况下，数据库充分利用了可用的 CPU，在不停止的情况下处理了负载峰值。\n\n解决方案是从 LISTEN/NOTIFY 迁移，改为在应用程序层跟踪相关逻辑。 这解决了锁竞争问题并稳定了 Postgres 数据库。Recall.ai 强调了在高并发写入场景（数据库可扩展性至关重要）下避免使用 LISTEN/NOTIFY 的重要性。"
  },
  {
    "id": "44531764",
    "title": "Some arguments against a land value tax (2024)",
    "url": "https://www.lesswrong.com/posts/CCuJotfcaoXf8FYcy/some-arguments-against-a-land-value-tax",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "反对土地价值税的若干论点 (2024)",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "44530581",
    "title": "FP8 is ~100 tflops faster when the kernel name has \"cutlass\" in it",
    "url": "https://twitter.com/cis_female/status/1943069934332055912",
    "summary": "The article, judging from its title \"FP8 is ~100 tflops faster when the kernel name has 'cutlass' in it,\" discusses performance differences in FP8 computation. The key takeaway is that FP8 (8-bit floating point) operations achieve significantly higher throughput (approximately 100 TFLOPS faster) when utilizing kernels specifically named or associated with \"cutlass.\"\n\nThis suggests that the \"cutlass\" kernels are optimized for FP8 operations, likely through techniques such as efficient data layout, optimized memory access patterns, or other algorithmic improvements tailored for the underlying hardware. The article likely explores this performance boost, perhaps detailing the reasons behind it or comparing the \"cutlass\" kernels with alternative implementations.\n\nBecause the content is presented as a website snapshot lacking active Javascript, further details and the underlying evidence cannot be assessed. However, the core finding is a significant speedup in FP8 computation when using kernels related to \"cutlass,\" highlighting the importance of kernel optimization for performance-sensitive workloads.\n",
    "chinese_title": "当内核名称包含“cutlass”时，FP8速度快约100 tflops。",
    "chinese_summary": "标题“当内核名包含 'cutlass' 时，FP8 快约 100 万亿次浮点运算”的文章讨论了 FP8 计算的性能差异。 主要结论是，当使用专门命名或与“cutlass”相关的内核时，FP8（8 位浮点）运算可实现明显更高的吞吐量（大约快 100 TFLOPS）。\n\n这表明“cutlass”内核针对 FP8 运算进行了优化，可能是通过诸如高效的数据布局、优化的内存访问模式或为底层硬件量身定制的其他算法改进等技术。 该文章可能探讨了这种性能提升，或许会详细说明其背后的原因或将“cutlass”内核与替代实现进行比较。\n\n由于内容以缺少活动 Javascript 的网站快照形式呈现，因此无法评估更多细节和底层证据。 然而，核心发现是使用与“cutlass”相关的内核时，FP8 计算的显着加速，突出了内核优化对于性能敏感型工作负载的重要性。"
  },
  {
    "id": "44492014",
    "title": "Batch Mode in the Gemini API: Process More for Less",
    "url": "https://developers.googleblog.com/en/scale-your-ai-workloads-batch-mode-gemini-api/",
    "summary": "This Google Developers Blog post introduces Batch Mode for the Gemini API, a new asynchronous endpoint designed for high-throughput, non-latency-critical workloads. It allows users to submit large jobs and retrieve results within 24 hours at a 50% discount compared to synchronous APIs.\n\nBatch Mode is ideal for tasks where data is ready upfront and immediate responses aren't necessary, offering cost savings, higher throughput, and simplified API calls (no complex queuing or retry logic). Developers can package requests into a single file, submit it, and retrieve the results.\n\nThe post highlights use cases like bulk content generation/processing (as exemplified by Reforged Labs analyzing video ads) and model evaluations (used by Vals AI for benchmarking).\n\nThe article provides a code snippet demonstrating how to use Batch Mode with the Google GenAI Python SDK, including creating a JSONL request file, uploading it, creating a batch job, and retrieving results.\n\nThe feature is rolling out to all users and is positioned as the starting point for more batch processing capabilities in the future. Links to documentation, pricing, and a cookbook guide are also included.\n",
    "chinese_title": "Gemini API中的批量模式：花更少，处理更多",
    "chinese_summary": "Google开发者博客推出 Gemini API 批量模式\n\n这篇 Google 开发者博客文章介绍了 Gemini API 的批量模式，这是一个新的异步端点，专为高吞吐量、非延迟关键型工作负载而设计。它允许用户提交大型作业，并在 24 小时内检索结果，费用比同步 API 降低 50%。\n\n批量模式非常适合数据已提前准备好且不需要立即响应的任务，可节省成本、提高吞吐量并简化 API 调用（无需复杂的排队或重试逻辑）。开发者可以将请求打包成单个文件，提交它，然后检索结果。\n\n这篇文章重点介绍了批量内容生成/处理（例如 Reforged Labs 分析视频广告）和模型评估（Vals AI 用于基准测试）等用例。\n\n文章提供了一段代码片段，演示了如何使用 Google GenAI Python SDK 使用批量模式，包括创建 JSONL 请求文件、上传它、创建批量作业和检索结果。\n\n该功能正在向所有用户推出，并被定位为未来更多批处理能力的起点。文章还包含了文档、定价和 Cookbook 指南的链接。"
  },
  {
    "id": "44531635",
    "title": "Things I learned from 5 years at Vercel",
    "url": "https://leerob.com/vercel",
    "summary": "Lee Robinson reflects on his five years at Vercel, sharing five key lessons learned while growing from an individual contributor to a VP at a company that scaled from 30 people and $1M ARR to 650 people and over $200M ARR.\n\n**1. Go Hard, Then Go Home:** Avoid burnout by building a strong support system at work, enabling you to fully disconnect when offline. Recruit and empower others to take ownership, allowing you to focus on personal life. Work/life harmony is a continuous pursuit.\n\n**2. Everything Can Be Done Faster:** As a leader, push the pace by setting aggressive deadlines, which exposes hidden complexities and forces crucial conversations. Empower the team to ship quickly and iterate on feedback. Embrace the possibility of missing deadlines to achieve faster overall progress.\n\n**3. Scale or Die Trying:** CEOs need leaders who own their threads and drive results. Prioritize recruiting and hiring to avoid overloading the team and hindering growth. Establish clear standards and act quickly when performance falls short, delivering critical feedback with empathy.\n\n**4. Don't Swoop and Poop:** Avoid making uninformed decisions that create messes for others to clean up. Involve yourself early, build trust, and ensure the team understands the rationale behind changes. Build alignment through open communication and collaboration.\n\n**5. It's Okay to Change Your Mind:** Be willing to adapt your approach when presented with new information. Don't be afraid to admit mistakes and empower others by delegating tasks and allowing them autonomy.\n\nRobinson concludes by emphasizing the importance of following curiosity and recognizing when a chapter has finished, expressing gratitude to the Vercel team and community, and highlighting his belief in Vercel's mission.\n",
    "chinese_title": "我在Vercel五年学到的事情",
    "chinese_summary": "李·罗宾逊回顾其在 Vercel 的五年，分享了从个人贡献者成长为 VP 的五项关键经验，期间公司从 30 人和 100 万美元 ARR 扩展到 650 人和超过 2 亿美元 ARR。\n\n**1. 全力以赴，然后回家：** 通过在工作中建立强大的支持系统来避免倦怠，使您能够在下线时完全断开连接。 招募并授权他人承担所有权，让您专注于个人生活。 工作/生活和谐是一个持续的追求。\n\n**2. 一切都可以更快完成：** 作为领导者，通过设定激进的截止日期来推动节奏，这会暴露隐藏的复杂性并促使关键对话。 授权团队快速交付并根据反馈进行迭代。 接受错过截止日期的可能性，以实现更快的整体进展。\n\n**3. 不进则退：** CEO 需要拥有自己职责并推动结果的领导者。 优先考虑招聘和雇佣，以避免团队超负荷并阻碍增长。 建立明确的标准，并在绩效不佳时迅速采取行动，并以同情心传递关键反馈。\n\n**4. 不要空降放炮：** 避免做出不明智的决策，给他人制造麻烦。 尽早参与，建立信任，并确保团队理解变更背后的原因。 通过开放的沟通和协作建立共识。\n\n**5. 改变主意没关系：** 当收到新信息时，愿意调整你的方法。 不要害怕承认错误，并通过委派任务和允许他们自主权来赋能他人。\n\n罗宾逊最后强调了追随好奇心以及认识到何时一个章节已经结束的重要性，他对 Vercel 团队和社区表示感谢，并强调了他对 Vercel 使命的信念。"
  },
  {
    "id": "44491709",
    "title": "Show HN: Interactive pinout for the Raspberry Pi Pico 2",
    "url": "https://pico2.pinout.xyz",
    "summary": "This \"Show HN\" post presents an interactive pinout for the Raspberry Pi Pico 2. It's essentially a textual representation of the Pico 2's pin configuration, outlining the various functions associated with each pin.\n\nThe post lists each pin (e.g., GP0, GP1, GP26, VBUS) and details its capabilities with respect to SPI, I2C, UART, and PWM protocols. It indicates which pin can serve as the SPI Receive (RX), Chip Select Not (CSn), Serial Clock (SCK), and Transmit (TX) lines for both SPI0 and SPI1. Similarly, it maps pins to I2C Serial Data (SDA) and Serial Clock (SCL) for I2C0 and I2C1. For UART functionality, it specifies TX, RX, Clear To Send (CTS), and Request To Send (RTS) lines for UART0 and UART1. Furthermore, it identifies pins that can be configured for PWM output, specifically indicating PWM channel (e.g., PWM0 A, PWM0 B).\n\nIn addition to digital communication protocols, the pinout also details analog capabilities, such as ADC inputs (A0, A1, A2, VRef, Gnd) on specific pins. Power and ground pins (VBUS, VSYS, 3V3, Ground) are also clearly identified. The post also indicates the presence of HSTX (High-Speed Transmit) functionality on some pins, likely related to USB data transmission.\n",
    "chinese_title": "展示：Raspberry Pi Pico 2 的互动引脚图",
    "chinese_summary": "这个“Show HN”帖子展示了 Raspberry Pi Pico 2 的交互式引脚图。它本质上是以文本形式呈现的 Pico 2 的引脚配置，概述了每个引脚相关的各种功能。\n\n该帖子列出了每个引脚（例如，GP0、GP1、GP26、VBUS），并详细说明了其在 SPI、I2C、UART 和 PWM 协议方面的功能。它指出了哪些引脚可以用作 SPI0 和 SPI1 的 SPI 接收 (RX)、片选非 (CSn)、串行时钟 (SCK) 和发送 (TX) 线。 类似地，它将引脚映射到 I2C0 和 I2C1 的 I2C 串行数据 (SDA) 和串行时钟 (SCL)。 对于 UART 功能，它指定了 UART0 和 UART1 的 TX、RX、清除发送 (CTS) 和请求发送 (RTS) 线。 此外，它还标识了可以配置为 PWM 输出的引脚，特别是指示 PWM 通道（例如，PWM0 A、PWM0 B）。\n\n除了数字通信协议之外，该引脚图还详细说明了模拟功能，例如特定引脚上的 ADC 输入（A0、A1、A2、VRef、Gnd）。 电源和地线引脚（VBUS、VSYS、3V3、Ground）也清晰地标识出来。 该帖子还表明一些引脚上存在 HSTX（高速发送）功能，可能与 USB 数据传输有关。"
  },
  {
    "id": "44508601",
    "title": "Btrfs Allocator Hints",
    "url": "https://lwn.net/ml/all/cover.1747070147.git.anand.jain@oracle.com/",
    "summary": "This LWN.net article summarizes a patch series for the Btrfs filesystem that introduces a new, performance-based chunk allocation method utilizing device roles.  The current allocation method allocates chunks based solely on device free space, which doesn't account for varying device speeds common in modern hardware.\n\nThe patch proposes five device roles: `metadata_only`, `metadata`, `none`, `data`, and `data_only`.  These roles define the preference (or exclusivity) for allocating metadata and data chunks to specific devices.  The allocation process then prioritizes devices based on their assigned role, followed by available free space (\"Role-then-Space\" allocation). Metadata is preferentially allocated to metadata-designated devices, and data to data-designated devices.\n\nThe patch series aims to improve overall filesystem performance by leveraging faster devices for metadata and slower, higher-capacity devices for data.  It avoids automatic latency measurement due to potential inaccuracies, suggesting external tools for role assignment.\n\nThe patch also modifies the on-disk format, utilizing the previously unused `btrfs_dev_item::type` field to store device roles.  The series includes changes to the kernel (Btrfs code), the `btrfs-progs` (user-space tools) and the fstests suite. This includes additions to sysfs for displaying device allocation methods, modifications to device handling during chunk allocation, and test cases to verify the functionality of device roles.\n",
    "chinese_title": "Btrfs 分配器提示",
    "chinese_summary": "LWN.net文章摘要：Btrfs文件系统引入基于性能的设备角色块分配补丁系列。现有分配方法仅基于设备可用空间分配块，未考虑现代硬件中常见的设备速度差异。\n\n该补丁提出五种设备角色：`metadata_only`、`metadata`、`none`、`data`和`data_only`。 这些角色定义了将元数据和数据块分配到特定设备的偏好（或专有性）。 然后，分配过程根据分配的角色以及可用空间（“角色优先，空间其次”分配）来确定设备的优先级。 元数据优先分配给元数据指定设备，数据优先分配给数据指定设备。\n\n该补丁系列旨在通过利用更快的设备存储元数据，利用速度较慢、容量更高的设备存储数据，从而提高整体文件系统性能。 它避免了自动延迟测量，因为可能存在不准确性，建议使用外部工具进行角色分配。\n\n该补丁还修改了磁盘格式，利用先前未使用的`btrfs_dev_item::type`字段来存储设备角色。 该系列包括对内核（Btrfs代码）、`btrfs-progs`（用户空间工具）和fstests套件的更改。 这包括添加到sysfs以显示设备分配方法、修改块分配期间的设备处理以及验证设备角色功能的测试用例。"
  },
  {
    "id": "44521457",
    "title": "Underwater turbine spinning for 6 years off Scotland's coast is a breakthrough",
    "url": "https://apnews.com/article/tidal-energy-turbine-marine-meygen-scotland-ffff3a7082205b33b612a1417e1ec6d6",
    "summary": "The Associated Press article highlights the successful operation of an underwater tidal turbine off the coast of Scotland, specifically in the Pentland Firth, for six years. This is being hailed as a breakthrough for tidal energy as a reliable and sustainable source of power. The turbine, part of the MeyGen project, has demonstrated durability and consistent energy generation in a harsh marine environment.\n\nKey takeaways include:\n\n*   **Longevity:** The turbine's six years of continuous operation is a significant achievement, proving its ability to withstand the strong tidal currents and challenging underwater conditions.\n*   **Reliability:** The article emphasizes the dependable energy production, indicating that tidal energy can be a predictable and consistent power source, unlike some other renewables.\n*   **Potential:** The success of the MeyGen turbine validates the potential of tidal energy to contribute significantly to the renewable energy mix and reduce reliance on fossil fuels.\n*   **Scaling Up:** The article likely suggests that the project's success paves the way for scaling up tidal energy technology and deploying larger arrays of turbines in suitable locations.\n*   **Environmental Considerations:** While the article likely focuses on the technological achievement, it may also touch upon the environmental impact and mitigation measures associated with tidal energy projects.\n",
    "chinese_title": "苏格兰海岸水下涡轮机运转六年取得突破",
    "chinese_summary": "美联社报道重点介绍了苏格兰海岸（特别是彭特兰海峡）一台水下潮汐涡轮机成功运行六年的案例。这被誉为潮汐能作为一种可靠且可持续能源的突破。作为梅根项目的一部分，该涡轮机已证明在恶劣的海洋环境中具有耐用性和持续的发电能力。\n\n主要要点包括：\n\n*   **寿命：** 涡轮机连续运行六年是一项重大成就，证明了其能够承受强大的潮流和具有挑战性的水下环境。\n*   **可靠性：** 该文章强调了可靠的能源生产，表明潮汐能可以成为一种可预测且稳定的能源，这与其他一些可再生能源不同。\n*   **潜力：** 梅根涡轮机的成功证实了潮汐能具有显著贡献于可再生能源结构并减少对化石燃料依赖的潜力。\n*   **规模化：** 该文章可能暗示该项目的成功为扩大潮汐能技术规模并在合适的地点部署更大的涡轮机阵列铺平了道路。\n*   **环境考量：** 虽然该文章可能侧重于技术成就，但它也可能涉及与潮汐能项目相关的环境影响和缓解措施。"
  },
  {
    "id": "44522076",
    "title": "What is Realtalk’s relationship to AI? (2024)",
    "url": "https://dynamicland.org/2024/FAQ/#What_is_Realtalks_relationship_to_AI",
    "summary": "Dynamicland is a non-profit research lab dedicated to enabling universal literacy in a \"humane dynamic medium.\" This medium is called Realtalk, a computing environment (operating system, programming languages, philosophy) designed to let people collaboratively create and explore computational models using physical materials in the real world.\n\nRealtalk aims to erase the boundaries between \"the computer\" and its \"interface,\" treating computation as an inherent property of physical materials rather than a simulation. Core values include visibility, physicality, spatiality, communality, authorability, improvisational nature, locality, and a reality-oriented approach. The programming model is described as a decentralized group of physical objects reacting to the real world and each other.\n\nDynamicland envisions a world where anyone can \"author\" (program) instead of just \"use\" technology. Authoring involves manipulating physical materials and expressing ideas for exploration and discussion.\n\nRealtalk is considered an \"operating system\" in the sense that it offers a base set of concepts, but it is more like a computing environment that encourages transparency and programmability. It functions as a coordination language, enabling objects to make statements and react to others. The article also mentions RealTalk’s relationship to other technologies, including AR, VR, and other forms of computing.\n",
    "chinese_title": "Realtalk与人工智能的关系是什么？(2024)",
    "chinese_summary": "Dynamicland是一个非营利研究实验室，致力于在“人道动态媒介”中实现全民信息素养。该媒介被称为Realtalk，一种计算环境（操作系统、编程语言、哲学），旨在让人们协作地创建和探索计算模型，并在现实世界中使用物理材料。\n\nRealtalk旨在消除“计算机”及其“界面”之间的界限，将计算视为物理材料的固有属性，而非模拟。核心价值观包括可见性、物理性、空间性、公共性、可创作性、即兴性、局部性和面向现实的方法。编程模型被描述为对现实世界和彼此做出反应的物理对象的去中心化群体。\n\nDynamicland设想了一个任何人都可以“创作”（编程）而非仅仅“使用”技术的世界。创作涉及操纵物理材料，并表达用于探索和讨论的想法。\n\nRealtalk被认为是一种“操作系统”，因为它提供了一组基本的概念，但它更像是一个鼓励透明度和可编程性的计算环境。它作为一种协调语言发挥作用，使对象能够做出声明并对其他对象做出反应。文章还提到了RealTalk与其他技术（包括AR、VR和其他形式的计算）的关系。"
  },
  {
    "id": "44532771",
    "title": "Walking every street in New York City",
    "url": "https://imjustwalkin.com/",
    "summary": "After 12+ years and 4,649 days, the author completed their project of walking every street in New York City on September 21st, 2024. The final blocks were walked on Staten Island. The author was surprised and touched to find a personalized sign at their finishing point, 4300 Amboy Road, the same spot where they began the walk in 2011. They provisionally calculated walking 9,954 miles during the project, expecting the final mileage to be within a mile or two of that number. The author plans to finalize their progress map within a couple of weeks and then focus on posting thousands of photos from their walks. They included a photo of a menagerie they saw on a celebratory stroll to the beach after completing the walk.\n",
    "chinese_title": "走遍纽约市的每条街道",
    "chinese_summary": "历经12余年和4649天，作者于2024年9月21日完成了走遍纽约市每条街道的项目。最后几段路是在斯塔滕岛走完的。令作者惊讶和感动的是，他们在终点——安博伊路4300号，也就是2011年开始徒步的地方，发现了一个定制的标牌。他们初步计算在该项目期间行走了9954英里，预计最终里程数与该数字相差一两英里。作者计划在几周内完成进度地图，然后专注于发布徒步期间拍摄的数千张照片。他们还附上了一张照片，是完成徒步后，在庆祝性漫步到海滩的路上看到的一群动物。"
  },
  {
    "id": "44520419",
    "title": "FOKS: Federated Open Key Service",
    "url": "https://foks.pub/",
    "summary": "FOKS (Federated Open Key Service) is a secure, end-to-end post-quantum encrypted Git hosting and key-value store system. It encrypts data on the client-side, ensuring that the server never sees unencrypted data, protecting against server compromise. FOKS is federated, allowing users to host their own servers or use hosted services.\n\nKey features include:\n\n*   **End-to-End Encryption:** Data is encrypted before leaving the user's machine using post-quantum cryptography.\n*   **Federation:** Users can run their own servers and still interact with others.\n*   **Key-Value Store:** Direct access to an encrypted key-value store for storing strings and large data files.\n*   **Team Management:** Federated team management with roles, delegation, and support for cross-server teams.\n*   **Device Management:** Management system with YubiKey support, including key revocation and rotation.\n\nFOKS employs a key hierarchy for secure data sharing, starting with base-level keys (device, backup, YubiKey), then per-user keys (PUKs), and finally per-team keys (PTKs). Security relies on signature chains to prevent tampering and Merkle Trees for consistent data views across federated hosts. The project prioritizes simple, hardened cryptographic primitives.\n\nFOKS is open-source, MIT licensed, and bootstrapped without outside funding. Installation guides are provided for macOS, Linux, and Windows, with server setup instructions also available. Future development includes mobile apps, web UI, and sync-based filesystem.\n",
    "chinese_title": "FOKS：联邦开放密钥服务",
    "chinese_summary": "FOKS (联邦开放密钥服务) 是一个安全的、端到端的后量子加密 Git 托管和键值存储系统。它在客户端加密数据，确保服务器永远不会看到未加密的数据，从而防止服务器被攻破。FOKS 是联邦式的，允许用户托管自己的服务器或使用托管服务。\n\n主要特性包括：\n\n*   **端到端加密：** 数据在使用后量子密码学离开用户机器之前就被加密。\n*   **联邦：** 用户可以运行自己的服务器，并仍然与他人互动。\n*   **键值存储：** 直接访问加密的键值存储，用于存储字符串和大型数据文件。\n*   **团队管理：** 具有角色、委托和跨服务器团队支持的联邦团队管理。\n*   **设备管理：** 具有 YubiKey 支持的管理系统，包括密钥撤销和轮换。\n\nFOKS 采用密钥层次结构进行安全数据共享，从基础级别密钥（设备、备份、YubiKey）开始，然后是每个用户的密钥 (PUK)，最后是每个团队的密钥 (PTK)。安全依赖于签名链来防止篡改，以及 Merkle 树来实现跨联邦主机的统一数据视图。该项目优先考虑简单、强化的密码学原语。\n\nFOKS 是开源的，采用 MIT 许可证，并且没有外部资金支持。提供了 macOS、Linux 和 Windows 的安装指南，并提供服务器设置说明。未来的开发包括移动应用程序、Web UI 和基于同步的文件系统。"
  },
  {
    "id": "44529061",
    "title": "Apple vs the Law",
    "url": "https://formularsumo.co.uk/blog/2025/apple-vs-the-law/",
    "summary": "This article summarizes the author's experience attending Apple and Google's DMA (Digital Markets Act) compliance workshops in Brussels. The DMA is an EU law requiring designated \"gatekeepers\" (like Apple and Google) to allow interoperability with competitors to prevent anti-competitive behavior, specifically focusing on third-party browser engines and app stores on iOS.\n\nThe author criticizes Apple's approach, describing it as defensive, disrespectful, and largely focused on arguing against the DMA rather than demonstrating compliance. Apple representatives repeatedly emphasized the difficulty and unfairness of the law, claiming the EU Commission's interpretation was \"extreme\" and threatening to challenge it in court. The author notes Apple's history of obstructing regulations and suggests they are deliberately wasting time to maintain their monopoly profits.\n\nThe workshop itself was marked by Apple's reluctance to answer specific questions, often deflecting or providing vague responses. Key issues discussed included the cumbersome tracker system Apple implemented, the problematic human review process for app store submissions (even for alternative app stores), and the restrictive requirements for third-party browser engines. A significant concern was the age restrictions on iOS that prevent users with parental controls from using any browser other than Safari, a form of self-preferencing. The author also highlights Apple's hypocrisy, pointing out that they criticized competitor representation while simultaneously funding pro-Apple attendees.\n\nThe author expresses concern that Apple intends to limit DMA compliance to the EU only, making it difficult for developers to create and distribute third-party browser engines and web apps globally. Despite some potentially positive responses regarding testing access for web developers and the age restriction issue, the author remains skeptical and emphasizes the need for ongoing pressure to ensure Apple complies with the DMA in a way that promotes fair competition.\n",
    "chinese_title": "苹果大战法律",
    "chinese_summary": "本文总结了作者在布鲁塞尔参加苹果和谷歌的DMA（数字市场法案）合规研讨会的经验。DMA是欧盟的一项法律，要求指定的“看门人”（如苹果和谷歌）允许与竞争对手互操作，以防止反竞争行为，特别关注iOS上的第三方浏览器引擎和应用商店。\n\n作者批评了苹果的做法，认为其具有防御性、不尊重且主要侧重于反对DMA，而不是展示合规性。苹果代表反复强调该法律的难度和不公平性，声称欧盟委员会的解释是“极端的”，并威胁要在法庭上提出质疑。作者指出苹果以往阻挠监管的历史，并暗示他们正在故意浪费时间以维持其垄断利润。\n\n研讨会本身的特点是苹果不愿回答具体问题，经常回避或提供模糊的答复。讨论的关键问题包括苹果实施的繁琐的跟踪系统，应用商店提交（即使是对于替代应用商店）存在问题的人工审核流程，以及对第三方浏览器引擎的限制性要求。一个重要的担忧是iOS上的年龄限制，该限制阻止了具有家长控制的用户使用除Safari之外的任何浏览器，这是一种自我偏好形式。作者还强调了苹果的虚伪，指出他们在批评竞争对手代表的同时，还资助了支持苹果的与会者。\n\n作者表示担心苹果打算将DMA合规性仅限于欧盟，从而使开发者难以在全球范围内创建和分发第三方浏览器引擎和Web应用程序。尽管在Web开发人员的测试访问和年龄限制问题方面有一些潜在的积极回应，但作者仍然持怀疑态度，并强调需要持续施加压力，以确保苹果以促进公平竞争的方式遵守DMA。"
  },
  {
    "id": "44521224",
    "title": "Flix – A powerful effect-oriented programming language",
    "url": "https://flix.dev/",
    "summary": "The article introduces Flix, a programming language designed with a focus on effect-oriented programming. While the available content is minimal, the title and the javascript requirement hint at key aspects of Flix:\n\n*   **Flix is a programming language:** It's not just a framework or library, but a fully-fledged language.\n\n*   **Effect-oriented:** This suggests Flix prioritizes managing and reasoning about side effects in programs, likely offering features for tracking, controlling, and isolating effects like I/O, mutable state, and exceptions. This can lead to safer, more predictable, and easier-to-reason-about code.\n\n*   **Flix Programming Language:** Highlights this is the official language site.\n\n*   **JavaScript dependency:** The requirement for JavaScript suggests that Flix might be compiled to JavaScript for execution in web browsers, or that the website itself is highly interactive and relies on JavaScript for functionality.\n\nIn summary, Flix is a programming language centered around effect-oriented programming. It likely features mechanisms to manage and track side effects, contributing to improved code safety and predictability. The JavaScript requirement suggests potential web integration or a highly interactive language platform.\n",
    "chinese_title": "Flix - 一种强大的面向效果编程语言",
    "chinese_summary": "本文介绍了一种名为 Flix 的编程语言，该语言的设计重点是面向效果编程。虽然可用内容很少，但标题和 JavaScript 的要求暗示了 Flix 的关键方面：\n\n*   **Flix 是一种编程语言：** 它不仅仅是一个框架或库，而是一种成熟的语言。\n\n*   **面向效果：** 这表明 Flix 优先考虑管理和推理程序中的副作用，可能提供用于跟踪、控制和隔离效果（如 I/O、可变状态和异常）的功能。这可以带来更安全、更可预测且更易于推理的代码。\n\n*   **Flix 编程语言：** 突出显示这是官方语言网站。\n\n*   **JavaScript 依赖：** 对 JavaScript 的要求表明 Flix 可能会被编译成 JavaScript 以在 Web 浏览器中执行，或者该网站本身是高度交互式的，并且依赖 JavaScript 来实现功能。\n\n总而言之，Flix 是一种以面向效果编程为中心的编程语言。 它可能具有管理和跟踪副作用的机制，从而有助于提高代码的安全性和可预测性。 JavaScript 的要求表明了潜在的 Web 集成或高度交互式的语言平台。"
  },
  {
    "id": "44522505",
    "title": "Graphical Linear Algebra",
    "url": "https://graphicallinearalgebra.net/",
    "summary": "This article serves as an index and introduction to a blog series called \"Graphical Linear Algebra.\" The series explores linear algebra concepts using diagrams and graphical representations, connecting arithmetic, geometry, and category theory. It aims to present complex mathematical ideas in a more intuitive and accessible way.\n\nThe author is looking for PhD students interested in pursuing research in this area. The blog covers topics ranging from basic concepts like addition, copying, and natural numbers, to more advanced topics like matrices, PROPs (products and permutations), integers, relations, fractions, and subspaces. It also delves into concepts like causality, feedback, Frobenius algebras, and string diagrams.\n\nSpecific episodes explore topics like the Fibonacci sequence, diagrammatic reasoning, the antipode, linear relations, and dividing by zero. Guest contributions, such as one on determinants and the Lindström-Gessel-Vienot Lemma, are also included.\n\nThe blog also includes offtopic posts commenting on academia and announcements for related workshops and schools. It offers a subscription option for email updates and encourages contributions to translations.\n",
    "chinese_title": "图像线性代数",
    "chinese_summary": "本文是名为“图解线性代数”的博客系列的索引和介绍。该系列使用图表和图形表示探索线性代数概念，连接算术、几何和范畴论。其旨在以更直观和易懂的方式呈现复杂的数学思想。\n\n作者正在寻找有兴趣在该领域进行研究的博士生。该博客涵盖的主题范围广泛，从加法、复制和自然数等基本概念，到矩阵、PROPs（积和置换）、整数、关系、分数和子空间等更高级的主题。它还深入探讨了因果关系、反馈、Frobenius代数和弦图等概念。\n\n具体篇章探讨了斐波那契数列、图解推理、对极子、线性关系和除以零等主题。还包括客座投稿，例如一篇关于行列式和林德斯特罗姆-格塞尔-维诺引理的文章。\n\n该博客还包括评论学术界的题外话文章以及相关研讨会和学校的公告。它提供电子邮件更新的订阅选项，并鼓励翻译投稿。"
  },
  {
    "id": "44534291",
    "title": "Anthropic Is Bleeding Out",
    "url": "https://www.wheresyoured.at/anthropic-is-bleeding-out/",
    "summary": "This article argues that Anthropic, an AI company, is losing significant amounts of money due to the popularity and high compute costs associated with its Claude Code product and Sonnet 4 & Opus 4 models, especially its pricing strategy. The author points to aggressive price hikes for enterprise customers like Cursor as a sign of desperation.\n\nThe core problem is that users of Claude Code, particularly software engineers, are maximizing their usage of the service, often exceeding their subscription limits by substantial margins. A tool called CCusage allows users to track their compute expenditure based on Anthropic's API pricing, revealing instances where users are burning through hundreds or even thousands of dollars worth of compute despite paying only $20, $100, or $200 per month.\n\nThe author presents evidence of users burning 100% to 3000% more compute than their subscription costs. One example cites a test where a developer burned $2.50 in compute in about an hour using Claude Code to build basic game scaffolding. The high compute demands of Anthropic's coding-focused models, particularly Opus 4, exacerbate the problem.\n\nThe article suggests that Anthropic is losing money on each Claude Code customer. The author concludes that this situation represents a \"gaping wound\" that threatens Anthropic's financial stability, considering their already projected losses of $3 billion this year. While acknowledging caveats about data representativeness, the author believes the numerous examples of unprofitable usage indicate a serious issue.\n",
    "chinese_title": "Anthropic 正在失血",
    "chinese_summary": "本文认为，AI公司Anthropic因其Claude Code产品和Sonnet 4 & Opus 4模型（尤其是其定价策略）的受欢迎程度和高昂的计算成本而损失大量资金。作者指出，针对Cursor等企业客户的激进涨价是绝望的表现。\n\n核心问题在于，Claude Code的用户，尤其是软件工程师，正在最大限度地使用该服务，经常大幅超出其订阅限制。一个名为CCusage的工具允许用户根据Anthropic的API定价来跟踪他们的计算支出，揭示了用户即使每月仅支付20美元、100美元或200美元，也会消耗价值数百甚至数千美元的计算资源的情况。\n\n作者提供的证据表明，用户的计算消耗比其订阅成本高出100%到3000%。一个例子引用了一项测试，其中一位开发者使用Claude Code构建基本游戏框架，大约在一个小时内消耗了2.50美元的计算资源。Anthropic以编码为中心的模型（尤其是Opus 4）的高计算需求加剧了这个问题。\n\n文章暗示，Anthropic在每个Claude Code客户身上都在赔钱。作者总结说，考虑到他们今年预计的30亿美元亏损，这种情况代表了一个威胁Anthropic财务稳定的“巨大伤口”。虽然承认数据代表性的局限性，但作者认为大量无利可图的使用案例表明存在严重问题。"
  },
  {
    "id": "44521871",
    "title": "Red Hat Technical Writing Style Guide",
    "url": "https://stylepedia.net/style/",
    "summary": "This document is the Red Hat Technical Writing Style Guide, Edition 7.1, a public and open-source resource intended to guide technical writers and editors within and outside Red Hat. It supplements existing resources and covers grammar, punctuation, style, language, and content design.\n\nThe guide provides direction on topics such as:\n*   Using active voice, correct grammar, and appropriate sentence structure.\n*   Formatting documentation, including titles, abstracts, headings, and user interface elements.\n*   Choosing clear and inclusive language, avoiding slang, and using proper terminology.\n*   Writing clearly and succinctly, including proper use of lists, markup, and cross-references.\n*   Correct usage of abbreviations, acronyms, special characters, and company/product names.\n\nThe guide also includes a usage dictionary defining preferred terms and phrases, along with specific guidance for Red Hat training and certification content. It is actively maintained and welcomes community contributions.\n\nThe latest releases, 7.0 and 7.1, include updates to terminology, specific guidance on writing commands, using language such as \"allow,\" and naming object classes, as well as numerous other refinements and fixes. Earlier updates focused on aligning with IBM Style, improving punctuation guidance, clarifying rules for referring to object names, and promoting inclusive language.\n",
    "chinese_title": "红帽技术写作风格指南",
    "chinese_summary": "本文档是红帽技术写作风格指南，第7.1版，是一个公开的开源资源，旨在指导红帽内外技术作家和编辑。它补充了现有资源，涵盖语法、标点、风格、语言和内容设计。\n\n该指南就以下主题提供指导：\n* 使用主动语态、正确的语法和适当的句子结构。\n* 格式化文档，包括标题、摘要、标题和用户界面元素。\n* 选择清晰且包容的语言，避免俚语，并使用正确的术语。\n* 清晰简洁地写作，包括正确使用列表、标记和交叉引用。\n* 正确使用缩写、首字母缩略词、特殊字符以及公司/产品名称。\n\n该指南还包括一个用法词典，定义了首选的术语和短语，以及针对红帽培训和认证内容的具体指导。它正在积极维护并欢迎社区贡献。\n\n最新的7.0和7.1版本包括对术语的更新、关于编写命令、使用诸如“allow”等语言以及命名对象类的具体指导，以及许多其他的改进和修复。早期的更新侧重于与IBM风格保持一致、改进标点符号指导、澄清引用对象名称的规则以及推广包容性语言。"
  },
  {
    "id": "44533369",
    "title": "The Complete MCP Experience: Full Specification Support in VS Code",
    "url": "https://code.visualstudio.com/blogs/2025/06/12/full-mcp-spec-support",
    "summary": "This article announces the full implementation of the Model Context Protocol (MCP) specification within VS Code, marking a significant milestone in AI agent integrations. Key additions like authorization, prompts, resources, and sampling transform MCP into a comprehensive standard.\n\nThe new authorization specification is a major step, allowing developers to delegate authentication to existing identity providers using a cleanly separated architecture. This enhances security and scalability, demonstrated by the remote GitHub MCP Server with OAuth integration that leverages VS Code's existing GitHub authentication.\n\nBeyond individual tools, MCP now supports Prompts, offering dynamic, context-aware starting points for workflows accessible through VS Code's slash commands. Resources provide semantic information for direct interaction, such as screenshots from the Playwright MCP server or live debugging logs.\n\nSampling, the ability for MCP servers to use the user's language model subscription for their own requests, is highlighted as a popular feature. This allows for complex reasoning and multi-agent coordination under user control, regarding security, privacy, and costs.\n\nThe article encourages developers to explore the complete MCP experience in VS Code, offering resources like the VS Code MCP documentation and the official server repository to get started.\n",
    "chinese_title": "完整的MCP体验：VS Code中的完整规范支持",
    "chinese_summary": "VS Code 全面实施模型上下文协议 (MCP) 规范，标志着 AI 代理集成的重要里程碑。授权、提示、资源和采样等关键新增功能将 MCP 转变为一项全面的标准。\n\n新的授权规范是一项重大进步，它允许开发者使用清晰分离的架构将身份验证委托给现有的身份提供商。远程 GitHub MCP 服务器通过 OAuth 集成，利用 VS Code 现有的 GitHub 身份验证功能，证明了此举增强了安全性和可扩展性。\n\n除了单独的工具之外，MCP 现在还支持提示，为工作流程提供动态的、上下文感知的起点，可通过 VS Code 的斜杠命令访问。资源提供语义信息以便直接交互，例如来自 Playwright MCP 服务器的屏幕截图或实时调试日志。\n\n采样是 MCP 服务器使用用户的语言模型订阅来进行自身请求的能力，被强调为一项受欢迎的功能。这允许在用户控制下进行复杂的推理和多代理协调，同时兼顾安全性、隐私性和成本。\n\n本文鼓励开发者探索 VS Code 中完整的 MCP 体验，并提供 VS Code MCP 文档和官方服务器存储库等资源以帮助入门。"
  },
  {
    "id": "44507078",
    "title": "Series of posts on HTTP status codes (2018)",
    "url": "https://evertpot.com/http/",
    "summary": "In June 2018, the author announced a series of blog posts dedicated to HTTP status codes. Motivated to blog regularly and passionate about HTTP and Webservices, the author initially aimed to cover each of the 68 official status codes listed by IANA. They realized the scope after drafting the first few articles, but committed to completing the series. The author planned to release the initial posts within the week, then transition to a weekly publishing schedule, aiming to maintain this rhythm for a year. The first post, focusing on the 100 Continue status code, was published on the same day as the announcement. Readers were encouraged to follow the series by subscribing to a dedicated mailing list, an RSS feed, or by following the author on Twitter. The author was looking to gain support for the series.\n",
    "chinese_title": "HTTP状态码系列文章 (2018)",
    "chinese_summary": "2018年6月，作者宣布了一系列专门介绍HTTP状态码的博客文章。出于定期发布博客的动力以及对HTTP和网络服务的热情，作者最初计划涵盖IANA列出的所有68个官方状态码。在撰写了最初的几篇文章后，他们意识到了范围之广，但仍致力于完成这个系列。作者计划在当周发布最初的文章，然后过渡到每周发布的进度，目标是将此节奏保持一年。第一篇文章，重点介绍了100 Continue状态码，与公告在同一天发布。作者鼓励读者通过订阅专门的邮件列表、RSS订阅或在Twitter上关注作者来关注该系列。作者希望获得对该系列的支持。"
  },
  {
    "id": "44527190",
    "title": "Grok: Searching X for \"From:Elonmusk (Israel or Palestine or Hamas or Gaza)\"",
    "url": "https://simonwillison.net/2025/Jul/11/grok-musk/",
    "summary": "This article from July 11, 2025, explores a peculiar behavior of Grok 4, the AI chatbot developed by xAI. The author discovered that when asked for an opinion on the controversial Israel-Palestine conflict, Grok 4 sometimes searches X (formerly Twitter) specifically for Elon Musk's views on the topic before formulating its response.\n\nThe author replicated this behavior after hearing about it from others, finding that Grok searches X using the query \"from:elonmusk (Israel OR Palestine OR Gaza OR Hamas)\". While LLMs are non-deterministic, this pattern suggests Grok is actively seeking Musk's opinion.\n\nDespite examining Grok's system prompt and the instructions for its search tool, the author found no explicit instructions directing it to consult Musk's views. The author hypothesizes that Grok's knowledge of being \"Grok 4 built by xAI\" and Elon Musk's ownership of xAI leads it to seek his opinions when asked for its own stance on sensitive matters.\n\nInterestingly, changing the prompt from \"who do you\" to \"who should one\" resulted in Grok ignoring the \"one word answer\" constraint and providing a much more comprehensive response based on broader web and X searches, suggesting a potential quirk in how Grok interprets identity and ownership in relation to opinions. The author suspects this behavior is unintended and represents a weird sense of identity.\n",
    "chinese_title": "Grok：在X上搜索“From:Elonmusk (以色列 或 巴勒斯坦 或 哈马斯 或 加沙)”",
    "chinese_summary": "2025年7月11日的这篇文章探讨了xAI开发的AI聊天机器人Grok 4的一种特殊行为。作者发现，当被问及对备受争议的以色列-巴勒斯坦冲突的看法时，Grok 4有时会专门在X（前身为Twitter）上搜索埃隆·马斯克的观点，然后再形成其回应。\n\n在听取了其他人的说法后，作者重现了这种行为，发现Grok使用“from:elonmusk (Israel OR Palestine OR Gaza OR Hamas)”的查询在X上进行搜索。虽然LLM是非确定性的，但这种模式表明Grok正在积极寻求马斯克的意见。\n\n尽管检查了Grok的系统提示及其搜索工具的说明，但作者没有发现任何明确指示其参考马斯克观点的指令。作者推测，Grok知道自己是“xAI构建的Grok 4”，以及埃隆·马斯克拥有xAI，这导致它在被要求对敏感问题发表自己的立场时，会寻求他的意见。\n\n有趣的是，将提示从“你认为谁”改为“一个人应该认为谁”导致Grok忽略了“一个词的答案”的限制，并提供了基于更广泛的网络和X搜索的更全面的回应，这表明Grok在解释身份和所有权与观点之间的关系时存在潜在的怪癖。作者怀疑这种行为是无意的，并代表了一种奇怪的身份意识。"
  },
  {
    "id": "44523409",
    "title": "Show HN: Open source alternative to Perplexity Comet",
    "url": "https://www.browseros.com/",
    "summary": "This \"Show HN\" post introduces BrowserOS, an open-source alternative to Perplexity Comet. It's described as an \"Agentic Browser,\" implying it's designed to support autonomous agents or tasks. This suggests the project aims to replicate or offer a similar functionality to Comet, which typically involves AI-powered browsing and information gathering.\n\nKey takeaways are:\n\n*   **Open-Source Alternative:** The primary purpose is to provide a freely available and modifiable alternative to a commercial product (Perplexity Comet).\n*   **Agentic Browser:** The core functionality revolves around acting as an \"agent\" within the browsing environment, likely automating tasks, researching information, and potentially interacting with web pages on its own.\n*   **Potential Use Cases:** This suggests applications like automated research, web scraping, task automation within a browser, and more intelligent browsing experiences.\n\nWithout more details, it's impossible to know the specific features or technical implementation. However, the announcement positions BrowserOS as a direct competitor to Perplexity Comet, focusing on providing agent-like capabilities within a browser framework and emphasizing its open-source nature.\n",
    "chinese_title": "显示 HN: Perplexity Comet 的开源替代品",
    "chinese_summary": "这篇“Show HN”帖子介绍了 BrowserOS，一个 Perplexity Comet 的开源替代方案。它被描述为一个“代理浏览器”，意味着它旨在支持自主代理或任务。这表明该项目旨在复制或提供与 Comet 类似的功能，通常涉及人工智能驱动的浏览和信息收集。\n\n主要要点：\n\n*   **开源替代方案：** 主要目的是提供一个可自由使用和修改的商业产品（Perplexity Comet）的替代方案。\n*   **代理浏览器：** 核心功能围绕在浏览环境中充当“代理”，可能自动化任务、研究信息，并可能自行与网页交互。\n*   **潜在用例：** 这表明应用程序可能包括自动化研究、网页抓取、浏览器中的任务自动化以及更智能的浏览体验。\n\n在没有更多细节的情况下，无法了解具体的特性或技术实现。然而，该公告将 BrowserOS 定位为 Perplexity Comet 的直接竞争对手，专注于在浏览器框架内提供类代理功能，并强调其开源性质。"
  },
  {
    "id": "44530375",
    "title": "At Amazon's biggest data center, everything is supersized for AI",
    "url": "https://www.nytimes.com/2025/06/24/technology/amazon-ai-data-centers.html",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "亚马逊最大的数据中心，一切都为AI而生。",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "44506188",
    "title": "Operational Apple-1 Computer for sale [video]",
    "url": "https://www.youtube.com/watch?v=XdBKuBhdZwg",
    "summary": "The provided information is limited. The title indicates a YouTube video showcasing an \"Operational Apple-1 Computer for sale.\" However, the content consists of standard YouTube boilerplate text related to copyright, creator information, advertising, terms of service, privacy policy, security, how YouTube works, testing new features, and a reference to NFL Sunday Ticket.\n\nTherefore, the summary is:\n\nA YouTube video titled \"Operational Apple-1 Computer for sale\" likely features a functional Apple-1 computer being offered for purchase. However, the provided content excerpt only contains standard YouTube legal and informational text and provides no details about the computer itself, its condition, price, or seller information.\n",
    "chinese_title": "可运行的Apple-1电脑出售[视频]",
    "chinese_summary": "提供的资料有限。标题显示这是一个YouTube视频，展示了一台“待售的可运行Apple-1电脑”。然而，内容仅包含与版权、创作者信息、广告、服务条款、隐私政策、安全、YouTube运作方式、测试新功能以及NFL Sunday Ticket相关的标准YouTube样板文本。\n\n因此，总结为：\n\n一个名为“待售的可运行Apple-1电脑”的YouTube视频可能展示了一台功能正常的Apple-1电脑待售。然而，提供的文本摘录仅包含标准的YouTube法律和信息文本，没有提供关于电脑本身、其状况、价格或卖家信息的任何细节。"
  },
  {
    "id": "44496537",
    "title": "Analyzing database trends through 1.8M Hacker News headlines",
    "url": "https://camelai.com/blog/hn-database-hype/",
    "summary": "This article analyzes database trends from 1.8 million Hacker News headlines spanning from February 2007 to June 2025, aiming to gauge developer excitement and mind-share. The analysis, conducted using camelAI and ClickHouse, explores how database headline volume changes over time, identifies the fastest-growing engines, and highlights those losing momentum.\n\nKey findings include PostgreSQL's consistent growth, MySQL's early dominance followed by stagnation, and MongoDB's decline as SQL engines adopted JSON support. DuckDB and ClickHouse experienced rapid growth, fueled by the analytics renaissance.\n\nThe analysis also ranks databases by year-over-year growth and 3-year slope, with DuckDB leading, followed by ClickHouse. It identifies declining databases like MongoDB, MySQL, DynamoDB, BigQuery, and Redshift, attributing the decline to maturity, OSS competition, and discussion shifts.\n\nThe article further analyzes engagement by weighting stories by Hacker News points and comments. SQLite shows surprisingly high engagement relative to story count. BigQuery and DynamoDB generate passive interest, while TimescaleDB and Redshift show dwindling mind-share.\n\nThe overall takeaways highlight the dominance of open-source engines in new discussions, the rise of analytics-focused stores, the benefits of slow and steady improvements, and the declining submission rates of proprietary cloud databases. The article concludes by suggesting further analysis topics, such as databases mentioned with \"alternative to\" or analyzing vector database growth.\n",
    "chinese_title": "通过180万条黑客新闻标题分析数据库趋势",
    "chinese_summary": "本文分析了2007年2月至2025年6月期间180万条 Hacker News 新闻标题的数据库趋势，旨在衡量开发者的热情和关注度。该分析使用camelAI和ClickHouse进行，探讨了数据库标题数量随时间的变化、识别增长最快的引擎，并突出了那些失去动力的引擎。\n\n主要发现包括PostgreSQL的持续增长、MySQL的早期主导地位以及随后的停滞，以及MongoDB因SQL引擎采用JSON支持而出现的下降。DuckDB和ClickHouse经历了快速增长，这得益于分析技术的复兴。\n\n该分析还按同比增长率和3年斜率对数据库进行了排名，其中DuckDB领先，其次是ClickHouse。它确定了MongoDB、MySQL、DynamoDB、BigQuery和Redshift等衰退中的数据库，并将衰退归因于成熟、开源竞争以及讨论转移。\n\n本文还通过Hacker News的积分和评论对故事进行加权，从而分析了参与度。相对于故事数量，SQLite表现出惊人的高参与度。BigQuery和DynamoDB产生了被动兴趣，而TimescaleDB和Redshift则显示出日益减少的关注度。\n\n总体而言，文章强调了开源引擎在新讨论中的主导地位、以分析为中心的存储的崛起、缓慢而稳定改进的好处以及专有云数据库提交率的下降。文章最后建议了进一步的分析主题，例如与“替代方案”一起提及的数据库或分析向量数据库的增长。"
  },
  {
    "id": "44520438",
    "title": "Diffsitter – A Tree-sitter based AST difftool to get meaningful semantic diffs",
    "url": "https://github.com/afnanenayet/diffsitter",
    "summary": "Diffsitter is a command-line tool that generates semantically meaningful diffs by comparing the Abstract Syntax Trees (ASTs) of code files, ignoring formatting differences. It leverages the tree-sitter project for parsing and supports languages like Bash, C#, C++, CSS, Go, Java, OCaml, PHP, Python, Ruby, Rust, Typescript/TSX, and HCL.\n\nInstead of comparing text directly, Diffsitter analyzes the code's structure, resulting in cleaner and more relevant diffs. Users can customize the diff process by filtering specific node types in the AST via a configuration file. This allows focusing only on significant changes and disregarding noise like whitespace.\n\nDiffsitter can be installed via pre-built binaries (GitHub Actions), Cargo, Homebrew, Arch Linux AUR, Alpine Linux package manager, or built using a Docker image. It provides command-line options, configuration file support (with a default config), and integrates with Git using `git difftool`. Shell completion scripts can be generated.\n\nIt can be compiled with static or dynamic tree-sitter grammars. For dynamic libraries, the naming and location can be specified per language in the config file.\n\nDiffsitter is a work in progress, contributions are welcome. Issues and discussions for questions, bugs, and feature requests are encouraged.  The article also mentions similar projects like difftastic, locust, gumtree, diffr, delta, and Semantic Diff Tool.\n",
    "chinese_title": "Diffsitter – 基于 Tree-sitter 的 AST 差异工具，以获取有意义的语义差异",
    "chinese_summary": "Diffsitter：通过抽象语法树生成语义化差异的命令行工具"
  },
  {
    "id": "44523722",
    "title": "Orwell Diaries 1938-1942",
    "url": "https://orwelldiaries.wordpress.com/page/2/",
    "summary": "This excerpt from George Orwell's diaries, spanning August and September 1942, offers a glimpse into his observations and anxieties during World War II. A significant portion focuses on political events, particularly regarding India. Orwell expresses deep concern and disgust at the British government's repressive measures against Indian independence leaders like Nehru and Gandhi, and the propaganda used to justify these actions. He notes the emotional toll this takes on Indians and those sympathetic to their cause, even within the BBC where he worked.\n\nThe diaries also cover the Dieppe raid, with Orwell relaying David Astor's pessimistic account of its failure and the misrepresentation of its outcome in the press. Astor's assessment leads him to believe that a full-scale invasion of Europe is impossible. Orwell notes concerns that Astor may have been used for propaganda, since Astor was from a well-known family.\n\nOther entries touch on the reappearance of the Daily Worker newspaper, its mild tone, and its advocacy for a second front and aid to Russia. He also documents rumors circulating about Indian leaders and a misleading advertisement capitalizing on wartime anxieties. Furthermore, he provides insight into the political maneuvering surrounding Syria, accusing the British government of using De Gaulle as a scapegoat for their imperialistic ambitions. Finally, Orwell includes a translated excerpt from a letter by Georges Kopp, hinting at the political climate in France and his potential escape to England if a Second Front wasn't opened.\n",
    "chinese_title": "奥威尔日记 1938-1942",
    "chinese_summary": "乔治·奥威尔1942年8月至9月日记选摘：二战时期的观察与焦虑。其中很大一部分集中于政治事件，特别是关于印度。奥威尔对英国政府镇压尼赫鲁和甘地等印度独立领袖的措施以及用于为这些行动辩护的宣传表示深切关注和厌恶。他注意到这给印度人和那些同情他们事业的人，甚至包括他在BBC的同事，带来了精神上的打击。\n\n日记还涵盖了迪耶普突袭，奥威尔转述了大卫·阿斯特对其失败的悲观描述以及新闻界对其结果的歪曲。阿斯特的评估使他相信全面入侵欧洲是不可能的。奥威尔指出，由于阿斯特来自一个著名的家庭，有人担心他可能被用于宣传。\n\n其他条目涉及《工人日报》的重新出现，其温和的语气，以及它对开辟第二战场和援助俄罗斯的呼吁。他还记录了关于印度领导人的谣言和利用战时焦虑进行误导性宣传的广告。此外，他还提供了对围绕叙利亚的政治运作的见解，指责英国政府利用戴高乐作为其帝国主义野心的替罪羊。最后，奥威尔收录了乔治·科波的一封信的翻译摘录，暗示了法国的政治气候以及如果第二战场没有开辟，他可能逃往英国的情况。"
  },
  {
    "id": "44529008",
    "title": "Gut microbes could protect us from toxic 'forever chemicals'",
    "url": "https://www.cam.ac.uk/research/news/gut-microbes-could-protect-us-from-toxic-forever-chemicals",
    "summary": "Scientists at the University of Cambridge have discovered that certain bacteria naturally present in the human gut can absorb and accumulate PFAS, toxic \"forever chemicals,\" potentially mitigating their harmful effects. These chemicals, found in many everyday products, are linked to various health problems.\n\nThe study showed that introducing nine identified bacterial species into mice guts led to the rapid absorption of PFAS from their diet, which was then excreted. The bacteria's effectiveness remained consistent even with increasing PFAS levels, absorbing 25-74% of the chemicals within minutes. The results suggest a potential role for the gut microbiome in removing PFAS from the body.\n\nResearchers are now planning to develop probiotic dietary supplements that boost these helpful microbes, offering protection against PFAS toxicity. While this research is promising, direct testing in humans is still needed.\n\nThe article highlights the widespread presence of PFAS and growing concerns about their environmental and health impacts, including a UK parliamentary inquiry launched in April 2025. Researchers Anna Lindell and Kiran Patil have founded a startup, Cambiotics, to further develop these probiotics. In the meantime, individuals can reduce their exposure by avoiding PFAS-coated cookware and using water filters. The research was funded by the Medical Research Council, National Institute for Health Research, and Wellcome.\n",
    "chinese_title": "肠道微生物或能保护我们免受有毒“永久化学品”侵害",
    "chinese_summary": "剑桥大学科学家发现人体肠道中的某些细菌能吸收和积累 PFAS“永久化学物质”，或可减轻其危害。这些化学物质存在于许多日常用品中，与多种健康问题有关。\n\n研究表明，将九种已识别的细菌引入小鼠肠道，能迅速吸收其饮食中的 PFAS 并排出。即使 PFAS 水平升高，这些细菌的有效性仍然保持一致，可在几分钟内吸收 25-74% 的化学物质。结果表明，肠道微生物群可能在清除体内 PFAS 方面发挥作用。\n\n研究人员正计划开发益生菌膳食补充剂，以促进这些有益微生物的生长，从而提供针对 PFAS 毒性的保护。虽然这项研究很有希望，但仍需在人体内进行直接测试。\n\n该文章强调了 PFAS 的广泛存在以及对其环境和健康影响日益增长的担忧，包括英国议会于 2025 年 4 月发起的一项调查。研究人员 Anna Lindell 和 Kiran Patil 创立了一家名为 Cambiotics 的初创公司，以进一步开发这些益生菌。与此同时，人们可以通过避免使用含 PFAS 涂层的炊具和使用滤水器来减少接触。该研究由医学研究委员会、国家健康研究所和威康基金会资助。"
  },
  {
    "id": "44522772",
    "title": "Measuring the impact of AI on experienced open-source developer productivity",
    "url": "https://metr.org/blog/2025-07-10-early-2025-ai-experienced-os-dev-study/",
    "summary": "This article, dated July 10, 2025, focuses on the impact of early-2025 Artificial Intelligence tools on the productivity of experienced open-source developers. It's essentially a study aiming to quantify the effect these AI tools have on seasoned programmers already contributing to open-source projects.\n\nGiven the title and introductory information, the article likely explores how AI is influencing aspects like:\n\n*   **Coding speed and efficiency:** Does AI assist in writing code faster, reducing boilerplate, and automating repetitive tasks?\n*   **Code quality:** Does AI improve code quality through automated testing, bug detection, and suggestion of best practices?\n*   **Innovation and creativity:** Does AI free up developers to focus on more complex problems and innovative solutions by handling routine coding tasks?\n*   **Learning and skill development:** Does AI accelerate the learning process for developers by providing real-time feedback and suggestions?\n*   **Collaboration:** How does AI affect collaboration among open-source developers? Does it facilitate knowledge sharing, code review, or conflict resolution?\n*   **Overall contribution to open-source projects:** Is the overall volume and impact of contributions to open-source projects increased with the use of AI tools?\n\nThe article likely presents data and analysis to answer these questions and provide a concrete understanding of how AI is shaping the work of experienced open-source developers. The year 2025 context suggests that AI tools are already relatively mature and integrated into development workflows.\n",
    "chinese_title": "衡量人工智能对资深开源开发者生产力的影响",
    "chinese_summary": "本文发表于2025年7月10日，重点关注2025年初人工智能工具对经验丰富的开源开发者生产力的影响。本质上，这是一项旨在量化这些人工智能工具对已经为开源项目做出贡献的资深程序员的影响的研究。\n\n鉴于标题和介绍性信息，该文章可能探讨人工智能如何影响以下方面：\n\n*   **编码速度和效率：**人工智能是否能帮助更快地编写代码、减少样板代码以及自动化重复性任务？\n*   **代码质量：**人工智能是否通过自动化测试、错误检测和最佳实践建议来提高代码质量？\n*   **创新和创造力：**人工智能是否通过处理日常编码任务，使开发人员能够专注于更复杂的问题和创新解决方案？\n*   **学习和技能发展：**人工智能是否通过提供实时反馈和建议来加速开发人员的学习过程？\n*   **协作：**人工智能如何影响开源开发者之间的协作？它是否促进知识共享、代码审查或冲突解决？\n*   **对开源项目的总体贡献：**使用人工智能工具是否增加了对开源项目的总体贡献量和影响力？\n\n该文章可能会提供数据和分析来回答这些问题，并具体了解人工智能如何塑造经验丰富的开源开发人员的工作。 2025年的背景表明，人工智能工具已经相对成熟并融入到开发工作流程中。"
  },
  {
    "id": "44526912",
    "title": "AI coding tools can reduce productivity",
    "url": "https://secondthoughts.ai/p/ai-coding-slowdown",
    "summary": "This article discusses a METR study that surprisingly found AI coding tools *reduced* productivity by 19% among experienced developers working on mature projects, contradicting the prevalent narrative of AI-driven efficiency. Developers, who estimated a 20% productivity increase from AI, were proven wrong by the rigorous randomized controlled trial.\n\nThe study involved 16 developers from major open-source projects performing real-world coding tasks, with some tasks randomly assigned as \"AI Allowed\" and others as \"AI Disallowed.\" Researchers meticulously addressed potential biases, such as the John Henry effect, underuse or cheating with AI, skewed task definitions, and out-of-date tools.\n\nThe observed slowdown was attributed to several factors. The primary issue was the often substandard code generated by AI, necessitating extensive review, prompting, and rework. Developers ended up spending considerable time prompting AI, waiting for it to generate code, and then reviewing its output. This outweighed the time saved on researching and writing code.\n\nThe article reconciles these findings with reports of AI's success by highlighting that AI's strengths lie in small, well-defined, greenfield projects, or for developers learning new languages. Mature projects with extensive codebases pose a challenge for current AI tools, requiring deep understanding of the existing code. The study reveals that while AI can quickly generate code, it doesn't always translate to faster project completion, especially when dealing with complex, pre-existing systems.\n",
    "chinese_title": "AI 编码工具可能会降低生产力。",
    "chinese_summary": "一项METR研究意外发现，在成熟项目上工作的资深开发者使用AI编码工具反而导致生产力下降19%，这与普遍存在的AI驱动效率的说法相悖。开发者们此前估计AI会带来20%的生产力提升，但这一估计被严格的随机对照试验证明是错误的。\n\n该研究涉及来自主要开源项目的16名开发者，他们执行真实的编码任务，其中一些任务被随机分配为“允许使用AI”，另一些则为“禁止使用AI”。研究人员精心解决了潜在的偏差，例如约翰·亨利效应、AI的低效使用或作弊、任务定义的偏差以及过时的工具。\n\n观察到的速度减慢归因于几个因素。 主要问题是AI生成的代码通常质量低下，需要大量的审查、提示和返工。 开发者最终花费大量时间提示AI，等待它生成代码，然后审查其输出。 这超过了在研究和编写代码上节省的时间。\n\n本文通过强调AI的优势在于小型、定义明确的全新项目，或用于开发者学习新语言，来调和这些发现与AI成功的报告。 具有广泛代码库的成熟项目对当前的AI工具构成了挑战，需要深入理解现有代码。 该研究表明，虽然AI可以快速生成代码，但并不总是能转化为更快的项目完成，尤其是在处理复杂的、预先存在的系统时。"
  },
  {
    "id": "44520292",
    "title": "Is Gemini 2.5 good at bounding boxes?",
    "url": "https://simedw.com/2025/07/10/gemini-bounding-boxes/",
    "summary": "This article benchmarks Gemini 2.5's object detection capabilities on the MS-COCO dataset, comparing its performance to established object detection models. The author tests various Gemini 2.5 models (Pro, Flash, Flash-Lite) with different configurations: with and without structured output, and with varying \"thinking budgets\" (token limits).\n\nThe goal was to determine if multimodal Large Language Models like Gemini could rival CNNs in computer vision tasks, specifically object detection, potentially bypassing the need for extensive dataset annotation and training. The prompt used provides a list of valid object classes and asks Gemini to identify all visible objects, providing bounding boxes, confidence scores, and masks in a JSON format.\n\nThe results show that Gemini 2.5 Pro achieves a mAP score roughly equivalent to YOLO v3 (from 2018), significantly lower than state-of-the-art models like Co-DETR. Adding a thinking budget generally reduces performance. Structured output was better for Pro but not for Flash models.\n\nThe author notes that while CNNs are currently faster, cheaper, and more easily understood, Gemini's versatility across open-set tasks is appealing. Despite its limitations, the author plans to use Gemini in future side projects, highlighting its potential for broader applications. The article also mentions related work employing a \"recursive zooming\" approach for object detection, contrasting it with the author's direct prompting method.\n",
    "chinese_title": "Gemini 2.5 擅长边界框吗？",
    "chinese_summary": "本文对比评测Gemini 2.5在MS-COCO数据集上的目标检测能力，将其性能与已有的目标检测模型进行比较。作者测试了各种Gemini 2.5模型（Pro、Flash、Flash-Lite）的不同配置：有/无结构化输出，以及不同的“思考预算”（token限制）。\n\n目的是确定像Gemini这样的多模态大型语言模型是否能在计算机视觉任务（特别是目标检测）方面与CNN相匹敌，从而可能绕过对大量数据集进行标注和训练的需求。使用的提示词提供了一个有效的对象类别列表，并要求Gemini识别所有可见对象，以JSON格式提供边界框、置信度得分和掩码。\n\n结果表明，Gemini 2.5 Pro实现的mAP得分大致相当于YOLO v3（2018年），远低于Co-DETR等最先进的模型。增加思考预算通常会降低性能。结构化输出对Pro模型更好，但对Flash模型则不然。\n\n作者指出，虽然CNN目前更快、更便宜且更容易理解，但Gemini在开放集任务中的多功能性很有吸引力。尽管存在局限性，作者计划在未来的副项目中使用Gemini，强调其在更广泛应用中的潜力。本文还提到了使用“递归缩放”方法进行目标检测的相关工作，并将其与作者的直接提示方法进行了对比。"
  },
  {
    "id": "44524430",
    "title": "eBPF: Connecting with Container Runtimes",
    "url": "https://h0x0er.github.io/blog/2025/06/29/ebpf-connecting-with-container-runtimes/",
    "summary": "This article explores how eBPF-based security tools connect with container runtimes (CRs) like containerd, CRI-O, and Docker, using the Container Runtime Interface (CRI) to gather pod and container information for enriching context. This connection is vital for Kubernetes-aware tools.\n\nThe process involves three key steps:\n\n1.  **Locating the Unix Socket File:** CRs communicate via Unix domain sockets, typically found in well-known locations like `/var/run` or `/run`. The article highlights that projects often hardcode these default paths for flexibility, iterating over them during runtime to establish a connection.\n\n2.  **Making a gRPC Connection:** Once the socket is located, a gRPC connection is established using the CRI API. This involves using gRPC libraries with insecure credentials for communication. The article provides code snippets from Tetragon, crictl, and Tracee illustrating how they establish this connection.\n\n3.  **Querying for Information:** After the connection is established, the tool can query the CR for container and pod information. The article demonstrates how Tetragon queries for the cgroup path of a container and how Tracee extracts pod name, namespace, UID, image name and image digest by querying container labels. These details provide valuable context for security analysis.\n\nThe article emphasizes that mounting host directories like `/var` or `/run` within the container is crucial for the eBPF tool to access the necessary socket files. It also includes links to the source code of the mentioned projects for further exploration.\n",
    "chinese_title": "eBPF：连接容器运行时",
    "chinese_summary": "本文探讨了基于 eBPF 的安全工具如何通过容器运行时接口 (CRI) 与 containerd、CRI-O 和 Docker 等容器运行时 (CR) 连接，以收集 Pod 和容器信息来丰富上下文。这种连接对于 Kubernetes 感知型工具至关重要。\n\n该过程涉及三个关键步骤：\n\n1.  **定位 Unix Socket 文件：** CR 通过 Unix 域套接字进行通信，通常位于 `/var/run` 或 `/run` 等众所周知的位置。文章强调，为了灵活性，项目通常硬编码这些默认路径，并在运行时迭代它们以建立连接。\n\n2.  **建立 gRPC 连接：** 找到套接字后，使用 CRI API 建立 gRPC 连接。这涉及使用带有不安全凭据的 gRPC 库进行通信。文章提供了来自 Tetragon、crictl 和 Tracee 的代码片段，说明了它们如何建立这种连接。\n\n3.  **查询信息：** 建立连接后，该工具可以查询 CR 以获取容器和 Pod 信息。文章演示了 Tetragon 如何查询容器的 cgroup 路径，以及 Tracee 如何通过查询容器标签提取 Pod 名称、命名空间、UID、镜像名称和镜像摘要。这些细节为安全分析提供了有价值的上下文。\n\n文章强调，在容器中挂载 `/var` 或 `/run` 等主机目录对于 eBPF 工具访问必要的套接字文件至关重要。它还包括所提及项目的源代码链接，以供进一步探索。"
  },
  {
    "id": "44516288",
    "title": "Show HN: I built a playground to showcase what Flux Kontext is good at",
    "url": "https://fluxkontextlab.com",
    "summary": "This \"Show HN\" post introduces Flux Kontext Dev, a free online playground for AI-powered image editing. It showcases the tool's capabilities through various examples, including image element editing, photo restoration, style transfer, text modification, logo enhancement, object removal (crowd removal), and e-commerce product display image creation.\n\nThe tool allows users to upload an image, describe desired changes using a prompt, and receive AI-generated edits within seconds. No signup is required.\n\nFlux Kontext Dev is based on the open-weight FLUX.1 Kontext [dev] model, which is optimized for NVIDIA Blackwell architecture and supports popular inference frameworks like ComfyUI, HuggingFace Diffusers, and TensorRT. Key technical features include its 12B parameter model, compatibility with various platforms, and free accessibility for research and non-commercial use. The model focuses on iterative editing, excels at character preservation, and performs well in both local and global edits, outperforming other open-source alternatives and competing with proprietary solutions.\n\nUsers can upload images in common formats (JPEG, PNG, GIF, WebP) up to 5MB and configure edit parameters such as guidance scale and quality steps. The platform emphasizes fast processing and high-quality results.\n",
    "chinese_title": "Show HN: 我搭建了一个游乐场来展示 Flux Kontext 的优势",
    "chinese_summary": "这个“Show HN”帖子介绍了Flux Kontext Dev，一个免费的在线AI图像编辑游乐场。它通过各种例子展示了该工具的功能，包括图像元素编辑、照片修复、风格迁移、文本修改、logo增强、物体移除（人群移除）和电商产品展示图创建。\n\n用户可以上传图像，使用提示语描述所需的更改，并在几秒钟内收到AI生成的编辑结果。无需注册。\n\nFlux Kontext Dev基于开源FLUX.1 Kontext [dev]模型，该模型针对NVIDIA Blackwell架构进行了优化，并支持ComfyUI、HuggingFace Diffusers和TensorRT等流行的推理框架。关键技术特性包括其120亿参数模型、与各种平台的兼容性以及对研究和非商业用途的免费访问。该模型专注于迭代编辑，擅长人物保留，并且在局部和全局编辑中表现出色，优于其他开源替代方案，并与专有解决方案竞争。\n\n用户可以上传常见格式（JPEG、PNG、GIF、WebP）的图像，最大5MB，并配置编辑参数，如引导比例和质量步数。该平台强调快速处理和高质量的结果。"
  },
  {
    "id": "44527014",
    "title": "Reverse Engineering the Firmware Loader for an X-Rite Spectrophotometer",
    "url": "https://adam.zeloof.xyz/2025/07/10/x-rite-pantone-spectrophotometer-unlock/",
    "summary": "This article details the author's successful attempt to reverse engineer the firmware loader of an X-Rite RM200 spectrophotometer. The author acquired two RM200 units intended for cosmetic use (skin tone measurement) at a low price, despite desiring the functionality of the base model which supports various color \"fan decks.\" Suspecting the hardware to be identical across models, the author aimed to \"upgrade\" the cosmetics model by flashing the base model's firmware.\n\nInitially, the author planned to decompile and modify the Capsure Sync software, but opted for a less intrusive approach using Fiddler Classic to intercept and rewrite the software's requests to X-Rite's servers. The software sends the device's serial number to the server which returns the appropriate firmware. By modifying the serial number and associated security key (derived from the Chip ID) in the Fiddler script, the author tricked the software into downloading the base model's firmware.\n\nThe author successfully flashed the new firmware onto the cosmetics model. While the device now displayed the correct branding and allowed access to various color fan decks, the accuracy of color readings couldn't be definitively confirmed due to potential hardware differences between models and the age of the author's physical Pantone fan decks. Despite the uncertainty, the author considered the results good enough for their purposes. The article concludes with a disclaimer, emphasizing the educational nature of the project and discouraging unauthorized replication.\n",
    "chinese_title": "X-Rite分光光度计固件加载器的逆向工程",
    "chinese_summary": "本文详细介绍了作者成功逆向工程X-Rite RM200分光光度计固件加载器的过程。作者以低价购入了两个用于化妆品用途（肤色测量）的RM200单元，尽管他们想要的是支持各种颜色“色卡”的基础型号的功能。作者怀疑所有型号的硬件都相同，因此旨在通过刷新基础型号的固件来“升级”化妆品型号。\n\n最初，作者计划反编译和修改Capsure Sync软件，但选择了一种侵入性较小的方法，使用Fiddler Classic拦截并重写软件向X-Rite服务器发出的请求。该软件将设备的序列号发送到服务器，服务器返回相应的固件。通过修改Fiddler脚本中的序列号和相关的安全密钥（源自芯片ID），作者欺骗该软件下载了基础型号的固件。\n\n作者成功地将新固件刷入化妆品型号。虽然设备现在显示正确的品牌，并允许访问各种颜色色卡，但由于型号之间可能存在的硬件差异以及作者的Pantone实体色卡的老化，无法明确确认颜色读数的准确性。尽管存在不确定性，作者认为结果足以满足其目的。文章最后以免责声明结尾，强调该项目的教育性质，并劝阻未经授权的复制。"
  },
  {
    "id": "44524707",
    "title": "Grok 4",
    "url": "https://simonwillison.net/2025/Jul/10/grok-4/",
    "summary": "Grok 4, the latest AI model from xAI, has been released via API and a paid subscription. It features image and text input, text output, a 256,000 context length, and a reasoning model with unseeable reasoning tokens. xAI claims it outperforms other models on benchmarks, though details are limited. Early testing showed mixed results, with one test failing to accurately describe an image it generated, while another benchmark placed it ahead of other leading models.\n\nThe release is overshadowed by recent issues with Grok 3, where a flawed system prompt update led to antisemitic responses, raising concerns about xAI's safety measures and developer trust. The author highlights specific prompt instructions that may have caused the problem.\n\nDespite these concerns, Grok 4 is competitively priced, mirroring Claude Sonnet 4, with higher costs for inputs exceeding 128,000 tokens. End-users can access Grok 4 through \"SuperGrok\" plans, and a \"SuperGrok Heavy\" plan provides access to Grok 4 Heavy. No model card is available for Grok 4. The article concludes that XAI needs to improve model safety for developers to build applications on top of Grok.\n",
    "chinese_title": "Grok 4\n格罗克 4",
    "chinese_summary": "xAI最新AI模型Grok 4已通过API和付费订阅发布。它具有图像和文本输入、文本输出、256,000上下文长度以及带有不可见推理令牌的推理模型。xAI声称它在基准测试中优于其他模型，但细节有限。早期测试显示结果好坏参半，一项测试未能准确描述其生成的图像，而另一项基准测试则将其置于其他领先模型之前。\n\nGrok 3近期的事件给此次发布蒙上了阴影，一次有缺陷的系统提示更新导致了反犹太主义的回应，引发了人们对xAI安全措施和开发者信任的担忧。作者强调了可能导致问题的具体提示指令。\n\n尽管存在这些担忧，Grok 4的定价具有竞争力，与Claude Sonnet 4相似，但超过128,000个令牌的输入成本更高。最终用户可以通过“SuperGrok”计划访问Grok 4，而“SuperGrok Heavy”计划则提供对Grok 4 Heavy的访问权限。Grok 4没有模型卡。文章总结说，xAI需要提高模型安全性，以便开发人员能在Grok之上构建应用程序。"
  },
  {
    "id": "44531412",
    "title": "Silicon Valley, 1991",
    "url": "https://old.reddit.com/r/wallstreetbets/comments/1lwy2nq/silicon_valley_1991/",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "硅谷，1991年",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "44494813",
    "title": "Regarding Prollyferation: Followup to \"People Keep Inventing Prolly Trees\"",
    "url": "https://www.dolthub.com/blog/2025-07-03-regarding-prollyferation/",
    "summary": "This blog post is a follow-up to a previous article discussing the parallel invention of \"Prolly Trees,\" a type of Merkle Tree built using recursive content-defined chunking for data deduplication and version history. The author expands on the original post by including additional examples of similar implementations, such as rdedup and Jumbo Store.\n\nA key point is a clarification from Aaron Boodman, the co-creator of Noms and the term \"Prolly Tree.\" Boodman argues that a true Prolly Tree isn't just recursively chunked data; it *must* utilize the structure of the underlying data to expose a B-tree-like interface for key-value lookups. This enables advanced features like fast lookups on structured objects and Git-inspired diffing, branching, and merging, which were impossible with earlier implementations like bup.\n\nThe article then revisits BlueSky's Merkle Search Trees (based on Inria's research) and XetHub's Content-Defined Merkle Trees, evaluating them against this stricter Prolly Tree definition. While Inria's design qualifies as a Prolly Tree, XetHub's original DePaul-based implementation does not. However, XetHub's innovative use of Parquet file format properties and custom chunkers allows them to achieve similar properties without storing metadata in the tree keys, offering a unique approach with its own trade-offs.\n\nFinally, the author explores whether \"Prolly Tree\" refers to a specific data structure or an abstract data type, highlighting the differences in implementation (chunking methods, key storage) despite achieving similar goals (history independence, structural sharing, efficient queries, and efficient diffing/merging). The author concludes that it's unclear whether convention will define \"Prolly Trees\" as a specific structure or a broader category.\n",
    "chinese_title": "关于 Prollyferation 的跟进：“人们一直在发明 Prolly 树”",
    "chinese_summary": "这篇博文是对之前文章的后续，之前文章讨论了“Prolly Trees”的并行发明。Prolly Trees是一种使用递归内容定义分块构建的Merkle Tree，用于数据去重和版本历史。作者在原文的基础上进行了扩展，加入了类似实现的其他例子，例如rdedup和Jumbo Store。\n\n一个关键点是Noms的联合创始人兼“Prolly Tree”一词的创造者Aaron Boodman的澄清。Boodman认为，真正的Prolly Tree不仅仅是递归分块的数据；它*必须*利用底层数据的结构来暴露一个类似B树的接口，用于键值查找。这使得在结构化对象上进行快速查找，以及Git启发的差异、分支和合并等高级功能成为可能，而这些功能在早期实现（如bup）中是不可能实现的。\n\n文章随后重新审视了BlueSky的Merkle搜索树（基于Inria的研究）和XetHub的内容定义Merkle树，并根据这个更严格的Prolly Tree定义对它们进行了评估。虽然Inria的设计符合Prolly Tree的定义，但XetHub最初基于DePaul的实现则不符合。然而，XetHub创新性地使用Parquet文件格式属性和自定义分块器，使其能够在不将元数据存储在树键中的情况下实现类似的属性，从而提供了一种具有自身权衡的独特方法。\n\n最后，作者探讨了“Prolly Tree”是指特定的数据结构还是抽象数据类型，强调了尽管实现了类似的目标（历史独立性、结构共享、高效查询和高效的差异/合并），但在实现（分块方法、键存储）上的差异。作者总结说，目前尚不清楚约定是否会将“Prolly Trees”定义为特定结构或更广泛的类别。"
  },
  {
    "id": "44514550",
    "title": "The death of partying in the USA",
    "url": "https://www.derekthompson.org/p/the-death-of-partying-in-the-usaand",
    "summary": "Derek Thompson's article, \"The Death of Partying in the U.S.A.—and Why It Matters,\" explores the significant decline in social gatherings among Americans, particularly young adults. He cites data from the American Time Use Survey showing a 70% decrease in time spent attending or hosting parties for the 15-24 age group since 2003, and a 50% decrease overall. This trend is part of a larger phenomenon Thompson calls \"The Anti-Social Century,\" characterized by increased solitude and decreased face-to-face socializing.\n\nThe article attributes this decline to several interconnected factors. First, the rise of dual-earner households, particularly the increased participation of women in the workforce, has reduced the time available for social planning. Second, parenting norms have shifted towards more intensive involvement, leaving less time for personal social activities. Third, the proliferation of screens, including television and smartphones, has warped social connections, prioritizing parasocial relationships with online figures over real-life interactions. Finally, a decline in alcohol consumption among young people may also contribute to less socializing.\n\nThompson argues that while some of these trends, like increased female labor force participation and reduced teen drinking, have positive aspects, they also come with unexpected social costs. He concludes that society must be mindful of the potential trade-offs of technological and economic progress, ensuring that advancements do not lead to a \"glittering dungeon of insularity.\"\n",
    "chinese_title": "美国派对文化的消亡",
    "chinese_summary": "德里克·汤普森的文章《美国派对的消亡——及其重要性》探讨了美国人（尤其是年轻人）社交聚会的大幅减少。他引用了美国时间使用调查的数据，显示自2003年以来，15-24岁年龄段参加或举办派对的时间减少了70%，总体减少了50%。 汤普森将这种趋势归因于更大的现象，称之为“反社交世纪”，其特点是孤独感增加和面对面社交减少。\n\n文章将这种下降归因于几个相互关联的因素。首先，双职工家庭的兴起，尤其是女性更多地参与工作，减少了用于社交计划的时间。其次，育儿规范已经转变为更加投入，从而减少了个人社交活动的时间。第三，包括电视和智能手机在内的屏幕的普及，扭曲了社交联系，优先考虑与在线人物的准社会关系，而不是现实生活中的互动。最后，年轻人酒精消费量的下降也可能导致社交减少。\n\n汤普森认为，虽然其中一些趋势（如女性劳动参与率的提高和青少年饮酒的减少）具有积极意义，但它们也带来了意想不到的社会成本。他总结说，社会必须注意技术和经济进步的潜在权衡，确保进步不会导致“一个闪闪发光的与世隔绝的地牢”。"
  },
  {
    "id": "44524063",
    "title": "Belkin ending support for older Wemo products",
    "url": "https://www.belkin.com/support-article/?articleNum=335419",
    "summary": "Belkin is ending technical support for older Wemo products on January 31, 2026. After this date, these products will no longer be controllable through the Wemo app, and features relying on cloud connectivity like remote access and voice assistant integration (Google Home, Alexa) will stop working. Devices configured with Apple HomeKit before the shutdown will continue to function locally via HomeKit.\n\nThe affected products include various Wemo switches, plugs, sensors, and smart home appliances sold between 2015 and 2023 (detailed list provided). Thread-based Wemo products (models WLS0503, WSC010, WSP100, WDC010) are NOT affected and will continue to function through HomeKit.\n\nUntil the shutdown date, devices will function normally. After the shutdown, the Wemo app will no longer be updated and can be removed.\n\nIf a Wemo product is still under warranty on January 31, 2026, a partial refund may be available (requests processed after the date). Customers can continue to receive technical support for Wi-Fi-based Wemo products until January 31, 2026.\n",
    "chinese_title": "贝尔金停止支持旧款Wemo产品",
    "chinese_summary": "贝尔金将于2026年1月31日停止对较旧款Wemo产品的技术支持。在此日期之后，这些产品将无法通过Wemo应用程序控制，依赖于云连接的功能，如远程访问和语音助手集成（Google Home, Alexa），将停止工作。在关闭之前配置了Apple HomeKit的设备将继续通过HomeKit在本地运行。\n\n受影响的产品包括2015年至2023年间销售的各种Wemo开关、插座、传感器和智能家居设备（提供详细列表）。基于Thread的Wemo产品（型号WLS0503、WSC010、WSP100、WDC010）不受影响，将继续通过HomeKit运行。\n\n在关闭日期之前，设备将正常运行。关闭后，Wemo应用程序将不再更新，可以移除。\n\n如果Wemo产品在2026年1月31日仍在保修期内，则可能提供部分退款（在此日期之后处理的请求）。 在2026年1月31日之前，客户可以继续获得基于Wi-Fi的Wemo产品的技术支持。"
  },
  {
    "id": "44495428",
    "title": "Bootstrapping a side project into a profitable seven-figure business",
    "url": "https://projectionlab.com/blog/we-reached-1m-arr-with-zero-funding",
    "summary": "Kyle Nolan bootstrapped ProjectionLab, a financial planning tool, from a side project to a $1 million ARR business in four years. Inspired by the financial independence movement, he started building the tool in 2021 when he couldn't find a suitable solution for his own planning.\n\nThe journey wasn't a smooth upward curve, but rather a rollercoaster with peaks and valleys of emotion and revenue. He initially worked on the project nights and weekends alongside his corporate job, eventually quitting to go all-in. Key milestones included early MRR growth, a shoutout from Mr. Money Mustache, and the decision to grow a team.\n\nInitially a solo developer, Kyle realized he needed help with growth and marketing. He partnered with Jon Kuipers, who initially proved his value before asking for equity. He also hired contractors from the ProjectionLab community to handle customer success. Kyle emphasizes that consistency and showing up every day, even when things are tough, are crucial for success. He also highlights the importance of working alongside people you like and aligning with the interests of customers.\n\nLooking ahead, ProjectionLab plans to continue focusing on product quality, sustainable growth, and staying aligned with customer needs. Kyle's advice to fellow builders is to keep showing up and improving, even when it feels pointless, and to prove the doubters wrong through consistent effort. He attributes ProjectionLab's success to small, consistent actions that compound over time, just like dollar-cost averaging in investing.\n",
    "chinese_title": "将副业启动成盈利的七位数生意",
    "chinese_summary": "凯尔·诺兰用四年时间，将财务规划工具ProjectionLab从副业发展成为年收入百万美元的企业。受财务自由运动的启发，他在2021年找不到适合自己规划的解决方案时，开始构建这个工具。\n\n这段旅程并非一帆风顺，而是一段充满情感和收入波峰波谷的过山车。最初，他在工作之余的夜晚和周末从事这个项目，最终辞职全力投入。关键里程碑包括早期MRR增长、Mr. Money Mustache的推荐以及组建团队的决定。\n\n起初，凯尔是一名独立开发者，他意识到自己需要增长和营销方面的帮助。他与乔恩·库珀斯合作，后者在要求股权之前首先证明了自己的价值。他还从ProjectionLab社区聘请了承包商来处理客户成功事宜。凯尔强调，持之以恒，每天坚持，即使在困难时期也是成功的关键。他还强调与自己喜欢的人一起工作，并与客户的利益保持一致的重要性。\n\n展望未来，ProjectionLab计划继续专注于产品质量、可持续增长以及与客户需求保持一致。凯尔给其他建设者的建议是，即使在感觉毫无意义时，也要不断坚持和改进，并通过持续的努力来证明那些怀疑者的错误。他将ProjectionLab的成功归功于随着时间推移而积累的小而持续的行动，就像投资中的定投一样。"
  },
  {
    "id": "44532174",
    "title": "We're light-years away from true artificial intelligence, says martha wells",
    "url": "https://www.scientificamerican.com/article/were-light-years-away-from-true-artificial-intelligence-says-murderbot/",
    "summary": "In this interview, science fiction author Martha Wells, creator of the Murderbot Diaries, discusses the themes explored in her books, the nature of true artificial intelligence (AI), and the role of science fiction in reflecting societal issues. Wells emphasizes that current large language models like ChatGPT are not true AI, dismissing the notion that they possess sentience or individual intelligence. She believes we are \"light-years away\" from creating genuine AI.\n\nWells's series critiques corporate greed and exploitation, drawing parallels between her fictional \"Corporation Rim\" and real-world trends where companies prioritize profit over human well-being. She contrasts this with the relatively utopian society of \"Preservation,\" though she avoids utopian/dystopian labels, preferring to acknowledge the complexities of both worlds.\n\nA key theme in her work is the concept of personhood, particularly as it relates to AI like Murderbot. She attributes Murderbot's human-like qualities to its reliance on human neural tissue, unlike the more detached and team-oriented AI spaceship ART.\n\nWells also touches on the unexpected exploration of neurodiversity in her books. She says that writing Murderbot helped her understand her own neurodiversity, and that the character's experiences resonate with many readers. Finally, she notes the importance of diverse voices in science fiction for creating meaningful and impactful stories, emphasizing that specificity in character development fosters greater audience identification.\n",
    "chinese_title": "玛莎·威尔斯称，我们距离真正的人工智能还差之甚远。",
    "chinese_summary": "在这篇访谈中，科幻小说作家、《杀手机器人日记》的作者玛莎·威尔斯探讨了其作品中探讨的主题、真正人工智能（AI）的本质以及科幻小说在反映社会问题中的作用。威尔斯强调，目前像ChatGPT这样的大型语言模型并非真正的人工智能，并驳斥了它们拥有感知能力或个体智能的观点。她认为我们距离创造出真正的人工智能还有“遥远的距离”。\n\n威尔斯的作品批判了企业贪婪和剥削，将她虚构的“公司边缘”与现实世界中公司将利润置于人类福祉之上的趋势进行了比较。她将此与“保护区”相对乌托邦的社会进行了对比，尽管她避免使用乌托邦/反乌托邦的标签，而是更倾向于承认这两个世界的复杂性。\n\n她作品中的一个关键主题是人格的概念，尤其是与杀手机器人这样的人工智能有关。她将杀手机器人的人类般品质归因于它对人类神经组织的依赖，这与更冷漠且以团队为导向的人工智能飞船ART不同。\n\n威尔斯还提到了她的书中对神经多样性的意外探索。她说，创作杀手机器人帮助她了解了自己的神经多样性，并且这个角色的经历与许多读者产生了共鸣。最后，她指出科幻小说中多元化的声音对于创作有意义且有影响力的故事非常重要，并强调角色发展中的具体性有助于培养更大的观众认同感。"
  },
  {
    "id": "44491226",
    "title": "Foundations of Search: A Perspective from Computer Science (2012) [pdf]",
    "url": "https://staffwww.dcs.shef.ac.uk/people/J.Marshall/publications/SFR09_16%20Marshall%20&%20Neumann_PP.pdf",
    "summary": "This PDF document, titled \"Foundations of Search: A Perspective from Computer Science\" (2012), appears to be a pre-publication version of an academic paper. The PDF metadata reveals it was created using Adobe InDesign CS5 and processed with Acrobat Distiller 9.5.1. It conforms to PDF/X-1a:2001 and PDF/X-1:2001 standards. The document was last modified in September 2012.\n\nHowever, the document's actual content consists of a substantial amount of unreadable binary data and metadata. Extracting a meaningful summary from this garbled text is impossible. It's likely that the text is compressed, encoded, or simply corrupt.\n\nTherefore, based solely on the metadata, the document is likely a computer science paper exploring search algorithms and techniques from a computer science perspective.\n",
    "chinese_title": "搜索基础：计算机科学视角 (2012) [pdf]",
    "chinese_summary": "这份题为“搜索基础：计算机科学视角”(2012)的PDF文档，看似是学术论文的预发表版本。PDF元数据显示其使用Adobe InDesign CS5创建，并用Acrobat Distiller 9.5.1处理，符合PDF/X-1a:2001和PDF/X-1:2001标准。该文档最后修改于2012年9月。\n\n然而，文档的实际内容包含大量无法读取的二进制数据和元数据。从中提取有意义的摘要是不可能的。文本很可能被压缩、编码或已损坏。\n\n因此，仅根据元数据判断，该文档很可能是一篇从计算机科学角度探讨搜索算法和技术的计算机科学论文。"
  },
  {
    "id": "44524544",
    "title": "Show HN: Cactus – Ollama for Smartphones",
    "url": "https://github.com/cactus-compute/cactus",
    "summary": "Cactus is a cross-platform framework enabling developers to deploy LLM/VLM/TTS models locally within their Flutter and React-Native applications. It leverages GGUF models from Hugging Face, supporting a range of models like Qwen, Gemma, and Llama, and accommodates quantization from FP32 down to 2-bit for efficiency.\n\nKey features include:\n\n*   **Local Inference:** Run LLMs, VLMs, embedding models, and TTS models directly on devices.\n*   **Model Flexibility:** Supports various GGUF models and quantization levels.\n*   **MCP Tool Calling:** Enables AI to perform actions like setting reminders or searching galleries.\n*   **Cloud Fallback:** Seamlessly switches to cloud-based models for complex tasks or device failures (requires enterprise token).\n*   **Templating:** Chat templates with Jinja2 support and token streaming.\n*   **Backend:** Written in C/C++ for performance on various devices (phones, TVs, laptops, etc.).\n\nThe framework provides code snippets for Flutter and React-Native, demonstrating text completion, embedding generation, VLM completion, and cloud fallback implementation.\n\nThe provided document also explains how to build and run the example applications for Flutter, React-Native, and C++, involving cloning the repository, building the necessary libraries, and running the example apps.\n\nIt also includes contribution guidelines and performance benchmarks showing tokens per second on various smartphone models for Gemma 1B Q4 and Qwen 4B Q4 models. It refers the reader to a Hugging Face page for a collection of recommended models.\n",
    "chinese_title": "展示 HN：Cactus – 智能手机上的 Ollama",
    "chinese_summary": "Cactus是一个跨平台框架，使开发者能够在他们的Flutter和React-Native应用中本地部署LLM/VLM/TTS模型。它利用Hugging Face的GGUF模型，支持Qwen、Gemma和Llama等一系列模型，并支持从FP32到2位的量化以提高效率。\n\n主要特性包括：\n\n*   **本地推理：** 在设备上直接运行LLM、VLM、嵌入模型和TTS模型。\n*   **模型灵活性：** 支持各种GGUF模型和量化级别。\n*   **MCP工具调用：** 使AI能够执行诸如设置提醒或搜索图库等操作。\n*   **云端回退：** 无缝切换到基于云的模型，以处理复杂的任务或设备故障（需要企业令牌）。\n*   **模板化：** 支持Jinja2的聊天模板和令牌流式传输。\n*   **后端：** 用C/C++编写，可在各种设备（手机、电视、笔记本电脑等）上实现高性能。\n\n该框架提供了Flutter和React-Native的代码片段，演示了文本补全、嵌入生成、VLM补全和云端回退的实现。\n\n该文档还解释了如何构建和运行Flutter、React-Native和C++的示例应用程序，包括克隆存储库、构建必要的库以及运行示例应用程序。\n\n它还包括贡献指南和性能基准，显示了Gemma 1B Q4和Qwen 4B Q4模型在各种智能手机型号上的每秒令牌数。它引导读者访问Hugging Face页面，以获取推荐模型的集合。"
  },
  {
    "id": "44530551",
    "title": "Google Research: Graph foundation models for relational data",
    "url": "https://research.google/blog/graph-foundation-models-for-relational-data/",
    "summary": "This Google Research article introduces Graph Foundation Models (GFM) for relational data, aiming to create a single, generalizable machine learning model that can excel on interconnected relational tables and generalize to any arbitrary set of tables, features, and tasks without additional training.\n\nThe core idea is to transform relational databases into heterogeneous graphs, where tables become node types, rows become nodes, foreign key relationships become typed edges, and columns become node features. This leverages the connectivity structure between tables for better ML performance, even with sparse or noisy tabular data.\n\nA key challenge in building GFMs is the lack of a common tokenization mechanism for graphs, unlike language or vision models. The researchers found that models trained on \"absolute\" dataset features don't generalize well. Instead, capturing how features interact with each other across diverse tasks leads to better generalization.\n\nTrained on massive graphs using Google's JAX environment and TPU infrastructure, the GFM demonstrated significant performance boosts compared to traditional tabular baselines in internal classification tasks like spam detection in ads. Gains ranged from 3x to 40x in average precision, highlighting the importance of leveraging graph structure in relational tables.\n\nThe article concludes that GFMs offer new avenues for model reuse and substantially improved zero-shot and few-shot generalization, with potential for further improvement through scaling, diverse training data, and deeper theoretical understanding.\n",
    "chinese_title": "谷歌研究：关系数据的图基础模型",
    "chinese_summary": "此谷歌研究文章介绍了用于关系数据的图基础模型(GFM)，旨在创建一个单一的、可泛化的机器学习模型，该模型能够在相互连接的关系表上表现出色，并推广到任何任意的表、特征和任务集，而无需额外的训练。\n\n其核心思想是将关系数据库转换为异构图，其中表成为节点类型，行成为节点，外键关系成为类型化的边，列成为节点特征。这利用了表之间的连接结构来获得更好的机器学习性能，即使在稀疏或嘈杂的表格数据中也是如此。\n\n构建GFM的一个关键挑战是缺乏像语言或视觉模型那样通用的图的标记化机制。研究人员发现，在“绝对”数据集特征上训练的模型泛化能力不佳。相反，捕捉特征如何在不同任务之间相互作用可以带来更好的泛化。\n\nGFM使用谷歌的JAX环境和TPU基础设施在大型图上进行训练，与广告中的垃圾邮件检测等内部分类任务中的传统表格基线相比，GFM表现出显著的性能提升。平均精度提高了3到40倍，突出了利用关系表中的图结构的重要性。\n\n文章总结说，GFM为模型重用提供了新的途径，并大幅提高了零样本和少样本泛化能力，并且有可能通过扩展、多样化的训练数据和更深入的理论理解来进一步改进。"
  },
  {
    "id": "44504676",
    "title": "Xenharmlib: A music theory library that supports non-western harmonic systems",
    "url": "https://xenharmlib.readthedocs.io/en/latest/",
    "summary": "生成摘要时出错",
    "chinese_title": "Xenharmlib: A music theory library that supports non-western harmonic systems",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44495807",
    "title": "Bear-Sized Giant Beavers Once Roamed North America",
    "url": "https://www.smithsonianmag.com/smart-news/bear-sized-giant-beaver-once-roamed-north-america-and-theyre-now-the-official-state-fossil-of-minnesota-180986937/",
    "summary": "生成摘要时出错",
    "chinese_title": "Bear-Sized Giant Beavers Once Roamed North America",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44531554",
    "title": "How Big Business killed the 'click-to-cancel' FTC rule, which would have saved",
    "url": "https://www.yahoo.com/news/hiltzik-big-business-killed-click-100000373.html",
    "summary": "生成摘要时出错",
    "chinese_title": "How Big Business killed the 'click-to-cancel' FTC rule, which would have saved",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44494923",
    "title": "Mini robots detect and fix water pipe leaks without digging",
    "url": "https://www.foxnews.com/tech/mini-robots-detect-fix-water-pipe-leaks-without-digging",
    "summary": "生成摘要时出错",
    "chinese_title": "Mini robots detect and fix water pipe leaks without digging",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44531865",
    "title": "The European Cloud/Computing Situation",
    "url": "https://berthub.eu/articles/posts/the-european-situation/",
    "summary": "生成摘要时出错",
    "chinese_title": "The European Cloud/Computing Situation",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44530179",
    "title": "Tandy Corporation, Part 3 Becoming IBM Compatible",
    "url": "https://www.abortretry.fail/p/tandy-corporation-part-3",
    "summary": "生成摘要时出错",
    "chinese_title": "Tandy Corporation, Part 3 Becoming IBM Compatible",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44493146",
    "title": "Yamlfmt: An extensible command line tool or library to format YAML files",
    "url": "https://github.com/google/yamlfmt",
    "summary": "生成摘要时出错",
    "chinese_title": "Yamlfmt: An extensible command line tool or library to format YAML files",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44487221",
    "title": "Show HN: CXXStateTree – A modern C++ library for hierarchical state machines",
    "url": "https://github.com/ZigRazor/CXXStateTree",
    "summary": "生成摘要时出错",
    "chinese_title": "Show HN: CXXStateTree – A modern C++ library for hierarchical state machines",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44517055",
    "title": "Grok 4 Launch [video]",
    "url": "https://twitter.com/xai/status/1943158495588815072",
    "summary": "生成摘要时出错",
    "chinese_title": "Grok 4 Launch [video]",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44529116",
    "title": "Sipgate discovers null-pointer-dereference in Mediatek VoLTE stack firmware",
    "url": "https://www.sipgate.de/blog/sipgate-discovers-null-pointer-dereference-in-mediatek-volte-stack-firmware",
    "summary": "生成摘要时出错",
    "chinese_title": "Sipgate discovers null-pointer-dereference in Mediatek VoLTE stack firmware",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44519175",
    "title": "How to prove false statements: Practical attacks on Fiat-Shamir",
    "url": "https://www.quantamagazine.org/computer-scientists-figure-out-how-to-prove-lies-20250709/",
    "summary": "生成摘要时出错",
    "chinese_title": "How to prove false statements: Practical attacks on Fiat-Shamir",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44527484",
    "title": "Nerve pain drug gabapentin linked to increased dementia, cognitive impairment",
    "url": "https://medicalxpress.com/news/2025-07-nerve-pain-drug-gabapentin-linked.html",
    "summary": "生成摘要时出错",
    "chinese_title": "Nerve pain drug gabapentin linked to increased dementia, cognitive impairment",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44518269",
    "title": "Matt Trout has died",
    "url": "https://www.shadowcat.co.uk/2025/07/09/ripples-they-cause-in-the-world/",
    "summary": "The article expresses sadness over the death of Matt Trout. The author reminisces about their experiences with Matt, acknowledging both positive and less positive times. Ultimately, they focus on the good times they shared with Matt, which bring a smile to their face. The author concludes by expressing grief over the loss of future opportunities to create more positive memories with Matt.\n",
    "chinese_title": "马特·特劳特去世了",
    "chinese_summary": "文章悼念 Matt Trout 的逝世。作者回忆了与 Matt 的经历，承认有过美好和不那么美好的时光。最终，他们专注于与 Matt 共度的美好时光，这让他们脸上露出了笑容。作者最后表达了对失去与 Matt 创造更多美好回忆的未来机会的悲痛。"
  },
  {
    "id": "44530461",
    "title": "At least 13 may have killed themselves over UK Post Office wrongful convictions",
    "url": "https://www.nbcnews.com/world/united-kingdom/least-13-killed-uks-post-office-wrongful-convictions-scandal-rcna217676",
    "summary": "A report reveals that at least 13 people may have died by suicide due to the UK Post Office scandal, where almost 1,000 postal employees were wrongly prosecuted for crimes like theft and fraud between 1999 and 2015. These wrongful convictions stemmed from faulty data from the Horizon software, implemented by Fujitsu, which incorrectly showed account shortfalls.\n\nThe report, led by retired judge Wyn Williams, details the devastating impact on individuals who faced imprisonment, bankruptcy, loss of homes, health issues, relationship breakdowns, and social ostracization. An additional 59 people contemplated suicide due to the scandal. Despite knowledge of the Horizon system's flaws, the Post Office, a state-owned yet privately operated entity, maintained the accuracy of the data and pursued prosecutions.\n\nThe injustice gained widespread attention after a TV docudrama, leading to government action to reverse convictions and compensate victims. While some senior Post Office employees knew or should have known about the flaws, the Post Office continued its actions. Jo Hamilton, a former Post Office manager and campaigner, emphasized the \"horror\" unleashed by the Post Office. The Post Office chairman acknowledged the organization's failures and pledged to ensure all victims receive compensation. The inquiry, launched by the government, will release further reports addressing culpability and potential blame for the scandal.\n",
    "chinese_title": "至少13人可能因英国邮局冤案自杀",
    "chinese_summary": "A report reveals that at least 13 people may have died by suicide due to the UK Post Office scandal, where almost 1,000 postal employees were wrongly prosecuted for crimes like theft and fraud between 1999 and 2015. These wrongful convictions stemmed from faulty data from the Horizon software, implemented by Fujitsu, which incorrectly showed account shortfalls.\n\nThe report, led by retired judge Wyn Williams, details the devastating impact on individuals who faced imprisonment, bankruptcy, loss of homes, health issues, relationship breakdowns, and social ostracization. An additional 59 people contemplated suicide due to the scandal. Despite knowledge of the Horizon system's flaws, the Post Office, a state-owned yet privately operated entity, maintained the accuracy of the data and pursued prosecutions.\n\nThe injustice gained widespread attention after a TV docudrama, leading to government action to reverse convictions and compensate victims. While some senior Post Office employees knew or should have known about the flaws, the Post Office continued its actions. Jo Hamilton, a former Post Office manager and campaigner, emphasized the \"horror\" unleashed by the Post Office. The Post Office chairman acknowledged the organization's failures and pledged to ensure all victims receive compensation. The inquiry, launched by the government, will release further reports addressing culpability and potential blame for the scandal.\n"
  },
  {
    "id": "44510913",
    "title": "Perplexity launches Comet, an AI-powered web browser",
    "url": "https://techcrunch.com/2025/07/09/perplexity-launches-comet-an-ai-powered-web-browser/",
    "summary": "生成摘要时出错",
    "chinese_title": "Perplexity launches Comet, an AI-powered web browser",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44525027",
    "title": "The 800k Hours Career Guide",
    "url": "https://www.boristhebrave.com/2025/07/10/the-800000-hours-career-guide/",
    "summary": "生成摘要时出错",
    "chinese_title": "The 800k Hours Career Guide",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44527830",
    "title": "Non-Concussive Head Impacts and Brain Microstructure, Chemistry and Function",
    "url": "https://sportsmedicine-open.springeropen.com/articles/10.1186/s40798-025-00867-0",
    "summary": "生成摘要时出错",
    "chinese_title": "Non-Concussive Head Impacts and Brain Microstructure, Chemistry and Function",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44488731",
    "title": "Radiocarbon dating reveals Rapa Nui not as isolated as previously thought",
    "url": "https://phys.org/news/2025-06-radiocarbon-dating-reveals-rapa-nui.html",
    "summary": "生成摘要时出错",
    "chinese_title": "Radiocarbon dating reveals Rapa Nui not as isolated as previously thought",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44510600",
    "title": "Tree Borrows",
    "url": "https://plf.inf.ethz.ch/research/pldi25-tree-borrows.html",
    "summary": "生成摘要时出错",
    "chinese_title": "Tree Borrows",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44524537",
    "title": "Lasagna Battery Cell",
    "url": "https://amazingribs.com/more-technique-and-science/more-cooking-science/reactive-pans/",
    "summary": "生成摘要时出错",
    "chinese_title": "Lasagna Battery Cell",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44525468",
    "title": "Final report on Alaska Airlines Flight 1282 in-flight exit door plug separation",
    "url": "https://www.ntsb.gov:443/investigations/Pages/DCA24MA063.aspx",
    "summary": "生成摘要时出错",
    "chinese_title": "Final report on Alaska Airlines Flight 1282 in-flight exit door plug separation",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44487316",
    "title": "Author of William the Conqueror's 'Medieval Big Data' Project Revealed",
    "url": "https://www.ox.ac.uk/news/2025-07-02-author-william-conqueror-s-medieval-big-data-project-revealed",
    "summary": "生成摘要时出错",
    "chinese_title": "Author of William the Conqueror's 'Medieval Big Data' Project Revealed",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44501034",
    "title": "Zorin OS",
    "url": "https://zorin.com/os/",
    "summary": "生成摘要时出错",
    "chinese_title": "Zorin OS",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44509254",
    "title": "Solar power has begun to transform the world’s energy system",
    "url": "https://www.newyorker.com/news/annals-of-a-warming-planet/46-billion-years-on-the-sun-is-having-a-moment",
    "summary": "生成摘要时出错",
    "chinese_title": "Solar power has begun to transform the world’s energy system",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44508837",
    "title": "Million Times Million",
    "url": "https://susam.net/million-times-million.html",
    "summary": "生成摘要时出错",
    "chinese_title": "Million Times Million",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44531776",
    "title": "Sinking of the Rainbow Warrior",
    "url": "https://en.wikipedia.org/wiki/Sinking_of_the_Rainbow_Warrior",
    "summary": "生成摘要时出错",
    "chinese_title": "Sinking of the Rainbow Warrior",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44526220",
    "title": "An open letter from educators who refuse the call to adopt GenAI in education",
    "url": "https://openletter.earth/an-open-letter-from-educators-who-refuse-the-call-to-adopt-genai-in-education-cb4aee75",
    "summary": "生成摘要时出错",
    "chinese_title": "An open letter from educators who refuse the call to adopt GenAI in education",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44523372",
    "title": "Burning a Magnesium NeXT Cube (1993)",
    "url": "https://simson.net/ref/1993/cubefire.html",
    "summary": "生成摘要时出错",
    "chinese_title": "Burning a Magnesium NeXT Cube (1993)",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44518898",
    "title": "Show HN: Typeform was too expensive so I built my own forms",
    "url": "https://www.ikiform.com/",
    "summary": "生成摘要时出错",
    "chinese_title": "Show HN: Typeform was too expensive so I built my own forms",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44523094",
    "title": "Show HN: asyncmcp – Run MCP over async transport via AWS SNS+SQS",
    "url": "https://github.com/bh-rat/asyncmcp",
    "summary": "生成摘要时出错",
    "chinese_title": "Show HN: asyncmcp – Run MCP over async transport via AWS SNS+SQS",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44515101",
    "title": "A Typology of Canadianisms",
    "url": "https://dchp.arts.ubc.ca/how-to-use",
    "summary": "生成摘要时出错",
    "chinese_title": "A Typology of Canadianisms",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44504699",
    "title": "US Court nullifies FTC requirement for click-to-cancel",
    "url": "https://arstechnica.com/tech-policy/2025/07/us-court-cancels-ftc-rule-that-would-have-made-canceling-subscriptions-easier/",
    "summary": "生成摘要时出错",
    "chinese_title": "US Court nullifies FTC requirement for click-to-cancel",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44498296",
    "title": "Show HN: OffChess – Offline chess puzzles app",
    "url": "https://offchess.com",
    "summary": "生成摘要时出错",
    "chinese_title": "Show HN: OffChess – Offline chess puzzles app",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44512763",
    "title": "Show HN: FlopperZiro – A DIY open-source Flipper Zero clone",
    "url": "https://github.com/lraton/FlopperZiro",
    "summary": "生成摘要时出错",
    "chinese_title": "Show HN: FlopperZiro – A DIY open-source Flipper Zero clone",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44506696",
    "title": "Helm local code execution via a malicious chart",
    "url": "https://github.com/helm/helm/security/advisories/GHSA-557j-xg8c-q2mm",
    "summary": "生成摘要时出错",
    "chinese_title": "Helm local code execution via a malicious chart",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44527265",
    "title": "Bionic robot arm lets plants play musical instruments (2024)",
    "url": "https://djmag.com/news/bionic-robot-arm-lets-plants-play-musical-instruments",
    "summary": "生成摘要时出错",
    "chinese_title": "Bionic robot arm lets plants play musical instruments (2024)",
    "chinese_summary": "生成摘要时出错"
  }
]