[
  {
    "id": "44473135",
    "title": "Local-first software: You own your data, in spite of the cloud",
    "url": "https://www.inkandswitch.com/essay/local-first/",
    "summary": "This article introduces the concept of \"local-first software\" as a solution to the drawbacks of cloud applications, particularly regarding data ownership and control. While cloud apps offer seamless collaboration and accessibility, they place user data on \"someone else's computer,\" making users dependent on the service provider. \"Old-fashioned\" local apps, conversely, grant full data ownership but lack easy collaboration.\n\nLocal-first software aims to combine the benefits of both approaches. It prioritizes local storage on users' devices as the primary data source, while servers provide secondary copies for synchronization across devices.\n\nThe article outlines seven ideals for local-first software:\n\n1.  **No Spinners:** Instant responsiveness by operating on local data.\n2.  **Cross-Device Access:** Data synchronization across multiple devices.\n3.  **Optional Network:** Functionality even without an internet connection.\n4.  **Seamless Collaboration:** Real-time collaboration on par with cloud apps.\n5.  **Long Now:** Ensuring data accessibility and longevity, even if the software provider disappears.\n6.  **Security and Privacy by Default:** User control over their data and its security.\n\nThe author advocates for a shift in perspective where local data is paramount, offering users greater control, security, and longevity for their data, while still enabling convenient collaboration.\n",
    "chinese_title": "本地优先软件：尽管有云，你仍拥有你的数据",
    "chinese_summary": "本文介绍了“本地优先软件”的概念，作为解决云应用缺点的一种方案，特别是关于数据所有权和控制方面。虽然云应用提供无缝协作和可访问性，但它们将用户数据放在“别人的电脑”上，使得用户依赖于服务提供商。相反，“老式”本地应用赋予完全的数据所有权，但缺乏便捷的协作。\n\n本地优先软件旨在结合两种方法的优点。它优先将用户设备上的本地存储作为主要数据源，而服务器提供辅助副本用于跨设备同步。\n\n本文概述了本地优先软件的七个理想：\n\n1.  **无加载指示器：** 通过操作本地数据实现即时响应。\n2.  **跨设备访问：** 跨多个设备进行数据同步。\n3.  **可选网络：** 即使没有互联网连接也能运行。\n4.  **无缝协作：** 与云应用相当的实时协作。\n5.  **长期可用：** 确保数据可访问性和持久性，即使软件提供商消失。\n6.  **默认的安全和隐私：** 用户控制其数据及其安全性。\n\n作者提倡一种转变的视角，即本地数据至关重要，为用户提供更大的数据控制权、安全性和持久性，同时仍然能够实现便捷的协作。"
  },
  {
    "id": "44472992",
    "title": "Europe's first geostationary sounder satellite is launched",
    "url": "https://www.eumetsat.int/europes-first-geostationary-sounder-satellite-launched",
    "summary": "Europe has launched Meteosat Third Generation Sounder 1 (MTG-S1), its first geostationary sounder satellite, a major step in improving resilience to extreme weather. Launched on July 1, 2025, MTG-S1 will provide high-frequency atmospheric data on temperature, humidity, and trace gases, enabling earlier and more accurate warnings for severe weather events like storms, floods, and heatwaves.\n\nThe satellite carries two key missions: the Infrared Sounder and the Copernicus Sentinel-4 spectrometer, which will monitor pollutants and aerosols. The Infrared Sounder will scan thermal infrared wavelengths to build vertical profiles of temperature, humidity, and trace gases. This data will help detect early signs of atmospheric instability, even before cloud formation. Sentinel-4 will provide hourly data on pollutants.\n\nMTG-S1 will maintain an uninterrupted view of Europe, Africa, and surrounding regions from its geostationary position. Combined with data from MTG imaging satellites, it will offer a comprehensive view of storm lifecycles, enhance short-range forecasts (nowcasts), improve air quality models, and support long-term climate monitoring.\n\nEUMETSAT, ESA, the European Commission, and numerous industry partners collaborated on the project. The launch is considered a testament to European cooperation and is expected to significantly improve weather forecasting and air quality monitoring capabilities, protecting lives and infrastructure across Europe.\n",
    "chinese_title": "欧洲首颗地球静止轨道探测卫星发射升空",
    "chinese_summary": "欧洲已发射气象卫星第三代探空仪1号（MTG-S1），其首颗地球静止轨道探空卫星，这是提高极端天气抵御能力的重要一步。 MTG-S1 于 2025 年 7 月 1 日发射，将提供关于温度、湿度和微量气体的高频大气数据，从而能够更早、更准确地预警暴风雨、洪水和热浪等极端天气事件。\n\n该卫星执行两项主要任务：红外探空仪和哥白尼哨兵-4号光谱仪，后者将监测污染物和气溶胶。 红外探空仪将扫描热红外波长，以建立温度、湿度和微量气体的垂直剖面。 这些数据将有助于检测大气不稳定性的早期迹象，甚至在云形成之前。 哨兵-4号将提供关于污染物的每小时数据。\n\nMTG-S1 将从其地球静止位置保持对欧洲、非洲和周边地区的连续观测。 结合来自 MTG 成像卫星的数据，它将提供风暴生命周期的全面视图，增强短时预报（现报），改进空气质量模型，并支持长期气候监测。\n\n欧洲气象卫星应用组织 (EUMETSAT)、欧洲航天局 (ESA)、欧盟委员会和众多行业合作伙伴合作开展了这个项目。 这次发射被认为是欧洲合作的证明，预计将显著提高天气预报和空气质量监测能力，从而保护欧洲各地的生命和基础设施。"
  },
  {
    "id": "44473711",
    "title": "ApplePay vs. Alternative Payment Services",
    "url": "https://www.taler.net/en/news/2025-05.html",
    "summary": "Marc Stibane's article \"ApplePay vs. Alternative Payment Services\" critiques Apple's App Store payment policies, arguing they stifle competition. The core analogy compares the App Store to an airport demanding shops choose between using its frequent traveler card (ApplePay) exclusively or other payment methods.\n\nStibane contends that Apple forces app developers to choose between offering ApplePay (and accessing its vast user base) or alternative payment services, prohibiting them from offering both simultaneously. This creates a situation where developers are practically compelled to use ApplePay, hindering the growth and viability of competing payment providers. Since millions of people already have ApplePay, developers can not risk alienating these customers.\n\nHe contrasts this with Apple's own retail stores, which accept multiple payment methods, including ApplePay, credit/debit cards, and bank transfers, recognizing the importance of customer choice. Stibane argues that app developers should have the same freedom to offer a variety of payment options, letting users choose their preferred method for each transaction. He emphasizes that Apple should not receive fees when users opt for non-ApplePay options.\n\nThe author calls for regulations, ideally through the EU's Digital Markets Act, to mandate that Apple allow app developers to offer all desired payment methods concurrently, promoting fair competition and user choice. He believes this will level the playing field and allow alternative payment providers a chance to compete with ApplePay.\n",
    "chinese_title": "Apple Pay 对比其他支付服务",
    "chinese_summary": "马克·斯蒂班的文章《ApplePay vs. 替代支付服务》批评了苹果应用商店的支付政策，认为这些政策扼杀了竞争。其核心类比是将应用商店比作一个机场，要求商店只能在独家使用其常旅客卡（ApplePay）或其他支付方式之间做出选择。\n\n斯蒂班认为，苹果迫使应用程序开发者在提供ApplePay（并访问其庞大的用户群）或替代支付服务之间做出选择，禁止他们同时提供这两种选择。这造成了一种局面，即开发者实际上被迫使用ApplePay，阻碍了竞争性支付提供商的增长和生存能力。由于数百万人已经拥有ApplePay，开发者不能冒险疏远这些客户。\n\n他将此与苹果自己的零售店进行了对比，苹果零售店接受多种支付方式，包括ApplePay、信用卡/借记卡和银行转账，认识到客户选择的重要性。斯蒂班认为，应用程序开发者应该有同样的自由来提供各种支付选项，让用户为每笔交易选择他们喜欢的方式。他强调，当用户选择非ApplePay选项时，苹果不应收取费用。\n\n作者呼吁进行监管，理想情况下是通过欧盟的《数字市场法案》，强制苹果允许应用程序开发者同时提供所有想要的支付方式，以促进公平竞争和用户选择。他认为这将创造公平的竞争环境，并让替代支付提供商有机会与ApplePay竞争。"
  },
  {
    "id": "44473590",
    "title": "Local-First Software Is Easier to Scale",
    "url": "https://elijahpotter.dev/articles/local-first_software_is_easier_to_scale",
    "summary": "Elijah Potter argues that local-first software is easier to scale because, in many cases, it doesn't need to be scaled at all. He uses Harper, a grammar-checking tool he works on, as an example, contrasting it with server-based software like LanguageTool.\n\nHarper's \"local-first\" (also called \"edge-first\" or \"on-device\") approach means the grammar checking code runs directly on the user's device. This allows for faster suggestions with minimal CPU and memory usage. Potter highlights that when Harper experienced a surge in users after being featured on Hacker News, there were no performance issues. Unlike LanguageTool, which relies on servers that would need to be scaled up to handle increased demand (requiring expert cloud architecture knowledge and increased infrastructure costs), Harper handled the influx of users seamlessly because it runs on the edge. Potter concludes by stating that he prefers to brag about not having to scale at all, contrasting this with the scaling capabilities bragged about by cloud providers. He then shifts to other unrelated topics (refactoring, browser integration, and book recommendations).\n",
    "chinese_title": "本地优先软件更易于扩展",
    "chinese_summary": "伊利亚·波特认为，本地优先软件更容易扩展，因为在许多情况下，它根本不需要扩展。他以自己参与开发的语法检查工具Harper为例，将其与基于服务器的软件（如LanguageTool）进行对比。\n\nHarper的“本地优先”（也称为“边缘优先”或“设备端”）方法意味着语法检查代码直接在用户的设备上运行。这使得建议更快，且CPU和内存使用率极低。波特强调，Harper在Hacker News上被推荐后，用户数量激增，但没有出现任何性能问题。与LanguageTool不同，后者依赖于需要扩展的服务器来处理增加的需求（需要专业的云架构知识和增加基础设施成本），而Harper则能无缝处理涌入的用户，因为它运行在边缘。波特总结说，他更喜欢吹嘘自己根本不需要扩展，这与云服务提供商吹嘘的扩展能力形成对比。然后，他转向其他不相关的话题（重构、浏览器集成和书籍推荐）。"
  },
  {
    "id": "44440968",
    "title": "X-Clacks-Overhead",
    "url": "https://xclacksoverhead.org/home/about",
    "summary": "The X-Clacks-Overhead HTTP header is a non-standard way to commemorate individuals, inspired by Terry Pratchett's Discworld series. In the books, the \"Clacks\" were semaphore towers, and a character named Robert Dearheart ensured his son's memory lived on by continuously transmitting his name through the network with the \"GNU\" code.\n\nFollowing Pratchett's death, the Discworld subreddit community created the X-Clacks-Overhead header to honor him. This header is silently transmitted with web requests, allowing websites to commemorate individuals without disrupting functionality. The presence of the header can only be detected by inspecting transmission headers.\n\nSeveral prominent websites, including Mozilla.org, Debian, XML.com, and The Register, implement the X-Clacks-Overhead header, often using the value \"GNU Terry Pratchett.\" The Register also uses it to commemorate a staff member. The article provides links to further information about GNU Terry Pratchett, Terry Pratchett, the Discworld series, and the associated online communities. Finally, a note is included regarding cookie usage on the website.\n",
    "chinese_title": "X-Clacks-Overhead",
    "chinese_summary": "X-Clacks-Overhead HTTP头部是一种非标准的方式，用于纪念逝者，其灵感来源于特里·普拉切特的碟形世界系列小说。 在书中，“Clacks”是信号塔，一个名叫罗伯特·迪尔哈特的人物确保他儿子的记忆得以延续，通过使用“GNU”代码在网络中不断传输他的名字。\n\n在普拉切特去世后，碟形世界subreddit社区创建了X-Clacks-Overhead头部以纪念他。 这个头部在网络请求中静默传输，允许网站纪念逝者而不会中断功能。 只有通过检查传输头部才能检测到此头部的存在。\n\n包括Mozilla.org、Debian、XML.com和The Register在内的几个著名网站都实现了X-Clacks-Overhead头部，通常使用值“GNU Terry Pratchett”。 The Register也使用它来纪念一位员工。 该文章提供了关于GNU Terry Pratchett、特里·普拉切特、碟形世界系列小说和相关在线社区的更多信息的链接。 最后，包含了一条关于网站上cookie使用的说明。"
  },
  {
    "id": "44473319",
    "title": "'Positive review only': Researchers hide AI prompts in papers",
    "url": "https://asia.nikkei.com/Business/Technology/Artificial-intelligence/Positive-review-only-Researchers-hide-AI-prompts-in-papers",
    "summary": "Nikkei Asia reports that researchers from 14 academic institutions across eight countries, including Japan, South Korea, China, and the U.S., have been found embedding hidden AI prompts in their pre-print research papers on arXiv. These prompts instruct AI tools to provide positive reviews, ignore negatives, and even recommend the paper for its \"impactful contributions, methodological rigor, and exceptional novelty.\" The prompts are concealed using methods like white text or tiny font sizes.\n\nThe discovery raises concerns about the integrity of the peer review process, especially as some reviewers are increasingly using AI to evaluate submissions. While many academic conferences and journals prohibit AI in peer review, a Waseda professor defended the practice as a countermeasure against \"lazy reviewers\" using AI. Some publishers like Springer Nature allow AI in certain review stages, while others like Elsevier ban it entirely.\n\nThe article highlights the lack of unified rules and opinions on AI's role in peer review. Experts warn that hidden prompts can also manipulate AI tools in other contexts, such as generating inaccurate summaries of websites. The piece calls for broader awareness of AI's risks and the development of clear guidelines for its use across industries. Organizations like the AI Governance Association suggest technical measures to guard against prompt manipulation and emphasize the need for industries to establish rules for AI implementation.\n",
    "chinese_title": "只给好评：研究人员将人工智能提示隐藏在论文中",
    "chinese_summary": "日经亚洲报道称，来自日本、韩国、中国和美国等八个国家14所学术机构的研究人员被发现在arXiv的预印本研究论文中嵌入隐藏的AI提示。这些提示指示AI工具提供积极的评价，忽略负面评价，甚至以“有影响力的贡献、严谨的方法论和卓越的创新性”为由推荐该论文。这些提示通过白色文字或极小字体等方法进行隐藏。\n\n这一发现引发了人们对同行评审过程完整性的担忧，尤其是在一些审稿人越来越多地使用AI来评估提交的论文的情况下。虽然许多学术会议和期刊禁止在同行评审中使用AI，但一位早稻田大学教授辩称，这种做法是对抗使用AI的“懒惰审稿人”的一种对策。一些出版商，如施普林格·自然，允许在某些评审阶段使用AI，而另一些出版商，如爱思唯尔，则完全禁止使用。\n\n该文章强调了在AI在同行评审中的作用方面缺乏统一的规则和意见。专家警告说，隐藏的提示也可能操纵其他环境中的AI工具，例如生成不准确的网站摘要。这篇文章呼吁更广泛地认识到AI的风险，并为各行业制定清晰的AI使用指南。人工智能治理协会等组织建议采取技术措施来防止提示操纵，并强调各行业需要建立AI实施规则。"
  },
  {
    "id": "44473409",
    "title": "Heart attacks aren't as fatal as they used to be",
    "url": "https://www.vox.com/future-perfect/418849/heart-attack-deaths-cardiovascular-disease-progress-medicine",
    "summary": "Bryan Walsh's article highlights the remarkable progress made in reducing deaths from heart attacks in the US.  The death rate from coronary heart disease has plummeted by nearly 90% between 1970 and 2022. Key factors contributing to this improvement include the successful public health campaign against smoking, the development and widespread use of statins to manage cholesterol, and advancements in emergency care, such as CPR, defibrillators, and specialized coronary care units with procedures like angioplasty and stents.\n\nDespite this progress, heart disease remains a leading cause of death in the US, with around 700,000 Americans dying from it annually. This is partly due to the increased lifespan and survival rates after initial heart attacks, leading to more chronic forms of heart disease.  The article also points out that unhealthy lifestyle factors like obesity, diabetes, hypertension, and sedentary behavior are increasing the risk of heart disease for many Americans.\n\nThe author suggests utilizing GLP-1 inhibitors like Ozempic to combat obesity-related heart risks, increasing statin use among high-risk groups, and expanding access to advanced screening methods like coronary artery calcium (CAC) scans to identify and address heart disease early on. The goal is to move beyond just treating heart attacks to preventing them altogether.\n",
    "chinese_title": "心脏病发作已不如以往致命。",
    "chinese_summary": "布莱恩·沃尔什的文章强调了美国在降低心脏病死亡率方面取得的显著进展。1970年至2022年间，冠心病死亡率骤降近90%。促成这一改善的关键因素包括成功的公共卫生禁烟运动、用于控制胆固醇的他汀类药物的开发和广泛使用，以及急救护理的进步，如心肺复苏术、除颤器以及配备血管成形术和支架等程序的专业冠心病护理病房。\n\n尽管取得了这些进展，心脏病仍然是美国的主要死亡原因，每年约有70万美国人因此丧生。部分原因是寿命延长以及首次心脏病发作后的生存率提高，导致更多慢性心脏病。文章还指出，不健康的生活方式因素，如肥胖、糖尿病、高血压和久坐不动的生活方式，正在增加许多美国人患心脏病的风险。\n\n作者建议利用GLP-1抑制剂（如Ozempic）来对抗与肥胖相关的心脏风险，增加高危人群的他汀类药物使用，并扩大冠状动脉钙化（CAC）扫描等先进筛查方法的使用，以便及早发现和解决心脏病问题。目标是超越仅仅治疗心脏病发作，而是完全预防它们。"
  },
  {
    "id": "44467912",
    "title": "Being too ambitious is a clever form of self-sabotage",
    "url": "https://maalvika.substack.com/p/being-too-ambitious-is-a-clever-form",
    "summary": "Okay, I can access the article and provide a summary.\n\nHere's a summary of \"Being too ambitious is a clever form of self-sabotage\":\n\nThe article argues that excessive ambition, while seemingly positive, can be a subtle form of self-sabotage. The author suggests that setting overly ambitious goals and pursuing them relentlessly can actually hinder progress and fulfillment. This happens in several ways:\n\n*   **Fear of Failure:** Setting impossibly high standards creates intense pressure and a constant fear of falling short. This fear can lead to procrastination, perfectionism, and ultimately, inaction. The author posits that sometimes it is easier not to try than to try and risk not meeting an unreasonable goal.\n*   **Distraction from the Present:** Constant focus on future aspirations can prevent individuals from appreciating and enjoying the present moment. It keeps people perpetually striving, sacrificing current happiness for a hypothetical future reward.\n*   **Comparison and Dissatisfaction:** Ambitious individuals often compare themselves to others who are perceived as more successful, leading to feelings of inadequacy and dissatisfaction, even when they achieve significant milestones.\n*   **Burnout and Exhaustion:** The relentless pursuit of ambitious goals can lead to burnout and exhaustion, ultimately undermining productivity and well-being.\n*   **Avoiding Deeper Issues:** The author contends that for some, extreme ambition serves as a distraction from underlying personal issues. The constant striving allows them to avoid facing vulnerabilities or insecurities.\n\nIn essence, the article encourages readers to examine the *why* behind their ambition, ensuring it stems from a place of genuine desire and aligns with their values, rather than being driven by fear, external validation, or escapism. A healthy balance, realistic goals, and present moment awareness are presented as antidotes to the self-sabotaging potential of unchecked ambition.\n",
    "chinese_title": "过于雄心勃勃是一种巧妙的自我破坏。",
    "chinese_summary": "好的，我可以访问文章并提供摘要。\n\n以下是“过于雄心勃勃是一种巧妙的自我破坏形式”的摘要：\n\n文章认为，过度的雄心壮志，看似积极，实则是一种微妙的自我破坏形式。作者认为，设定过于雄心勃勃的目标并坚持不懈地追求它们，实际上会阻碍进步和实现。这种情况发生在以下几个方面：\n\n*   **对失败的恐惧：** 设定高不可攀的标准会造成巨大的压力和对失败的持续恐惧。这种恐惧会导致拖延、完美主义，最终导致无所作为。作者认为，有时不尝试比尝试但冒着无法达到不合理目标的风险更容易。\n*   **对当下的分心：** 不断关注未来的愿望会阻止人们欣赏和享受当下。它使人们不断奋斗，牺牲当前的幸福来换取假设的未来回报。\n*   **比较和不满：** 雄心勃勃的人经常将自己与那些被认为更成功的人进行比较，导致产生不足和不满的感觉，即使他们实现了重要的里程碑。\n*   **倦怠和精疲力竭：** 对雄心勃勃的目标的无情追求会导致倦怠和精疲力竭，最终损害生产力和福祉。\n*   **逃避更深层次的问题：** 作者认为，对某些人来说，极端的雄心壮志是一种转移对潜在个人问题的注意力的手段。不断的奋斗使他们能够避免面对脆弱或不安全感。\n\n本质上，这篇文章鼓励读者审视他们雄心壮志背后的“原因”，确保它源于真正的渴望，并与他们的价值观相符，而不是受到恐惧、外部验证或逃避主义的驱使。健康的平衡、现实的目标和当下的意识被认为是应对不受控制的野心所带来的自我破坏潜力的解药。"
  },
  {
    "id": "44458914",
    "title": "Just Ask for Generalization",
    "url": "https://evjang.com/2021/10/23/generalization.html",
    "summary": "This blog post advocates for prioritizing generalization in AI system design, particularly in reinforcement learning. The author argues that large, diverse datasets are more crucial for achieving generalization than complex model biases, building upon the success of foundation models and neural scaling laws.\n\nDeep neural networks excel as \"data sponges\" through supervised learning, quickly memorizing vast amounts of data and generalizing well even when overparameterized. Examples like DALL-E demonstrate the power of simply \"asking\" these models for desired outputs through prompt engineering.\n\nHowever, reinforcement learning struggles with data efficiency compared to supervised learning. Estimating policy gradients requires extensive environment interactions and is computationally expensive, especially in diverse, multi-task environments. Offline RL methods, while promising, face challenges with bootstrapping and instability, hindering their ability to absorb data effectively.\n\nThe author proposes shifting the focus from direct optimization in RL to learning the distribution of policies through supervised learning and then \"asking\" for the best one. Approaches like Decision Transformer, which model all policies (good and bad) and condition them on return-to-go, showcase this principle. Other techniques like language-conditioned imitation learning and inferring reward functions from suboptimal demonstrations (D-REX) further emphasize the power of generalization for tackling challenging problems. The core idea is to leverage the strengths of deep learning in data absorption and generalization to achieve desired outcomes, rather than relying solely on complex RL algorithms.\n",
    "chinese_title": "直接询问泛化",
    "chinese_summary": "优先考虑人工智能系统设计中的泛化能力：以强化学习为例\n\n这篇博文倡导在人工智能系统设计中优先考虑泛化能力，尤其是在强化学习领域。作者认为，相比于复杂的模型偏见，大型、多样化的数据集对于实现泛化更为关键，这是基于基础模型和神经缩放定律的成功经验。\n\n深度神经网络通过监督学习可以作为“数据海绵”发挥出色，能够快速记忆大量数据，即使过度参数化也能很好地泛化。像DALL-E这样的例子证明了通过提示工程简单地“要求”这些模型产生期望输出的强大能力。\n\n然而，与监督学习相比，强化学习在数据效率方面存在不足。估计策略梯度需要大量的环境交互，并且计算成本高昂，尤其是在多样化的多任务环境中。离线强化学习方法虽然前景广阔，但在自举和不稳定性方面面临挑战，阻碍了它们有效吸收数据的能力。\n\n作者提出将重点从强化学习中的直接优化转移到通过监督学习学习策略的分布，然后“要求”获得最佳策略。像Decision Transformer这样的方法展示了这一原则，它们对所有策略（好的和坏的）进行建模，并以剩余回报为条件。其他技术，如语言条件模仿学习和从次优演示中推断奖励函数（D-REX），进一步强调了泛化能力对于解决具有挑战性问题的强大作用。核心思想是利用深度学习在数据吸收和泛化方面的优势来实现期望的结果，而不是仅仅依赖于复杂的强化学习算法。"
  },
  {
    "id": "44473694",
    "title": "Cops in [Spain] think everyone using a Google Pixel must be a drug dealer",
    "url": "https://www.androidauthority.com/google-pixel-organized-crime-preferred-phone-3573578/",
    "summary": "In Catalonia, Spain, police are suspicious of individuals using Google Pixel phones, as they are reportedly popular among criminals, drug dealers, and gang members. This isn't due to the Pixel itself, but because Android's open nature allows for the installation of privacy-focused operating systems like GrapheneOS, which offers robust security features like full disk and metadata encryption. Criminals are exploiting these security features on Pixel phones to protect their data.\n\nGrapheneOS officially supports Pixel phones due to their strong security and long-term software update guarantees, particularly highlighting the Pixel 8 and 9 series for their hardware memory tagging security. Some criminals even physically remove the cameras, GPS, and microphones from their Pixels to further reduce surveillance risks.\n\nCatalan police are resorting to infecting suspects' phones with malware to access their data. This situation highlights the double-edged sword of security features, which can be used for both legitimate privacy and illicit activities. GrapheneOS officials responded strongly to the article, stating that security is a tool that can be wielded for good or bad and that they are opposed to mass surveillance. They refuted any negative characterization of their OS.\n",
    "chinese_title": "在[西班牙]的警察认为所有使用谷歌Pixel手机的人都是毒贩。",
    "chinese_summary": "在西班牙加泰罗尼亚地区，警方对使用谷歌Pixel手机的个人表示怀疑，据报道，这些手机在罪犯、毒贩和团伙成员中很受欢迎。这并非Pixel本身的问题，而是因为安卓系统的开放性允许安装注重隐私的操作系统，如GrapheneOS，该系统提供强大的安全功能，如全盘和元数据加密。罪犯正在利用Pixel手机上的这些安全功能来保护其数据。\n\nGrapheneOS官方支持Pixel手机，原因是其强大的安全性和长期的软件更新保证，尤其强调Pixel 8和9系列在硬件内存标记安全性方面的优势。一些罪犯甚至会从他们的Pixel手机上物理移除摄像头、GPS和麦克风，以进一步降低被监视的风险。\n\n加泰罗尼亚警方正在采取感染嫌疑人手机恶意软件的方式来访问他们的数据。这种情况突显了安全功能的双刃剑特性，既可以用于合法的隐私保护，也可以用于非法活动。GrapheneOS官员对该报道做出了强烈回应，称安全是一种可以用于善或恶的工具，他们反对大规模监控，并驳斥了对其操作系统的任何负面描述。"
  },
  {
    "id": "44444686",
    "title": "The Moat of Low Status",
    "url": "https://usefulfictions.substack.com/p/learn-to-love-the-moat-of-low-status",
    "summary": "Here's a summary of \"The Moat of Low Status\" based on my understanding of similar concepts and what the title suggests, as I am unable to access the provided URL:\n\nAssuming the article discusses how low-status activities or niches can provide a competitive advantage (a \"moat\"), the core argument is likely that activities perceived as undesirable or unglamorous by most can be lucrative because they attract less competition.\n\nThe article likely explores the idea that people often avoid pursuits that are perceived as being \"beneath them\" or that lack social prestige, creating a vacuum of skilled individuals and potentially high profitability. This scarcity of competitors then functions as a \"moat,\" protecting those willing to engage in the activity from being easily displaced.\n\nThe article likely uses examples of businesses or individuals who have found success by focusing on these \"low status\" areas. These might include unsexy industries, niche markets with specialized skills, or tasks that are deemed tedious or unrewarding by the majority.\n\nThe key takeaways from the article are probably:\n\n*   Don't shy away from unglamorous opportunities.\n*   Perceived undesirability can create a strong competitive advantage.\n*   Low-status activities can be surprisingly profitable due to a lack of competition.\n*   Focusing on practical skills and fulfilling unmet needs, even if those needs seem mundane, can lead to success.\n\nWithout access to the original article, this summary is based on a reasonable interpretation of the title and common themes in business and personal development.\n",
    "chinese_title": "低地位的护城河",
    "chinese_summary": "以下是对“低地位的护城河”的总结，基于我对类似概念的理解以及标题的暗示，因为我无法访问提供的URL：\n\n假设文章讨论的是低地位的活动或利基市场如何提供竞争优势（“护城河”），那么核心论点很可能是，大多数人认为不受欢迎或不吸引人的活动可能是有利可图的，因为它们吸引的竞争较少。\n\n文章可能探讨了这样一种观点，即人们往往会避免从事那些被认为是“有失身份”或缺乏社会声望的活动，从而造成技术熟练人员的真空，并可能带来很高的盈利能力。这种竞争对手的稀缺性就起到了“护城河”的作用，保护那些愿意从事这项活动的人免受轻易取代。\n\n文章可能使用了企业或个人通过专注于这些“低地位”领域而获得成功的例子。这些可能包括不那么吸引人的行业、具有专业技能的利基市场，或者大多数人认为单调乏味或没有回报的任务。\n\n这篇文章的主要收获可能是：\n\n*   不要回避不吸引人的机会。\n*   感知到的不受欢迎程度可以创造强大的竞争优势。\n*   由于缺乏竞争，低地位的活动可能会出人意料地有利可图。\n*   专注于实用技能并满足未满足的需求，即使这些需求看起来很平凡，也可以带来成功。\n\n在无法访问原始文章的情况下，此摘要基于对标题以及商业和个人发展中常见主题的合理解释。"
  },
  {
    "id": "44471150",
    "title": "Gecode is an open source C++ toolkit for developing constraint-based systems",
    "url": "https://www.gecode.org/",
    "summary": "Gecode is an open-source C++ toolkit designed for developing constraint-based systems and applications. It provides a high-performance constraint solver that is both modular and extensible.\n\nKey features of Gecode include its openness, allowing easy integration with other systems and enabling the programming of new constraints, branching strategies, search engines, and variable domains with the same efficiency as predefined variables. It's comprehensive, featuring constraints over integers, Booleans, sets, and floats, a C++ modeling layer, advanced branching heuristics, various search engines, automatic symmetry breaking, no-goods from restarts, and MiniZinc support.\n\nGecode boasts excellent runtime and memory efficiency, proven by its consistent victories in the MiniZinc Challenges from 2008 to 2012. It is thoroughly documented with a comprehensive tutorial and reference documentation.\n\nDistributed under the MIT license, Gecode is free software with all parts available as source code. It is portable, adhering to the C++ standard and compiling on modern compilers across a wide range of machines.  Gecode also leverages multi-core processors for parallel search, enhancing its efficiency and is extensively tested with a suite containing over 50,000 test cases.\n",
    "chinese_title": "Gecode是一个用于开发基于约束系统的开源C++工具包。",
    "chinese_summary": "Gecode是一个开源的C++工具包，专为开发基于约束的系统和应用程序而设计。它提供了一个高性能的约束求解器，该求解器既模块化又可扩展。\n\nGecode的主要特点包括其开放性，允许与其他系统轻松集成，并能够以与预定义变量相同的效率对新的约束、分支策略、搜索引擎和变量域进行编程。它功能全面，具有针对整数、布尔值、集合和浮点数的约束，一个C++建模层，高级分支启发式算法，各种搜索引擎，自动对称性破坏，重启后的no-goods学习，以及MiniZinc支持。\n\nGecode拥有出色的运行时和内存效率，这已通过其在2008年至2012年MiniZinc挑战赛中的持续胜利得到证明。它具有全面的文档，包括详尽的教程和参考文档。\n\nGecode在MIT许可证下分发，是一款免费软件，所有部分均以源代码形式提供。它具有可移植性，符合C++标准，并在各种机器上的现代编译器上进行编译。Gecode还利用多核处理器进行并行搜索，从而提高其效率，并通过包含超过50,000个测试用例的套件进行了广泛测试。"
  },
  {
    "id": "44473063",
    "title": "Happy Birthday, GamingOnLinux – 16 years today",
    "url": "https://www.gamingonlinux.com/2025/07/happy-birthday-gamingonlinux-16-years-today/",
    "summary": "GamingOnLinux celebrates its 16th anniversary, marking a significant milestone in a landscape where many other sites have faltered. The article expresses gratitude to readers and supporters for their continued support. It acknowledges the challenges posed by the rise of AI-generated content and the potential for search engines to prioritize their own interests over content creators.\n\nThe author highlights Microsoft's decision to remove GamingOnLinux from Bing News, impacting its visibility on DuckDuckGo, and stresses the importance of direct readership and sharing articles to counteract this. Despite these challenges, the site's traffic remains high, and there are no plans to incorporate AI-generated content.\n\nThe article also mentions the expansion of the Steam Tracker page to include Linux distribution usage data and the upcoming return of the PC Info system. It provides various avenues for following GamingOnLinux, including Bluesky, Mastodon, Telegram, Discord, WhatsApp, and RSS, along with ways to support the site through Patreon, PayPal donations, and affiliate links.\n\nThe author also lists recently popular articles and ends by inviting readers to provide feedback and report rule-breaking content. The comment section reveals a largely supportive community celebrating the site's anniversary and expressing appreciation for its content and moderation.\n",
    "chinese_title": "游戏至尊Linux，生日快乐 – 今天16周年",
    "chinese_summary": "GamingOnLinux庆祝成立十六周年，在许多其他网站纷纷倒下的环境中，这是一个重要的里程碑。文章表达了对读者和支持者持续支持的感谢。它承认了人工智能生成内容兴起带来的挑战，以及搜索引擎可能优先考虑自身利益而非内容创作者的潜在风险。\n\n作者强调了微软将GamingOnLinux从必应新闻中移除的决定，这影响了其在DuckDuckGo上的可见度，并强调了直接读者阅读和分享文章以抵消这种影响的重要性。尽管面临这些挑战，该网站的流量仍然很高，并且没有计划纳入人工智能生成的内容。\n\n文章还提到Steam Tracker页面扩展到包括Linux发行版使用数据，以及即将回归的PC Info系统。它提供了多种关注GamingOnLinux的途径，包括Bluesky、Mastodon、Telegram、Discord、WhatsApp和RSS，以及通过Patreon、PayPal捐赠和联盟链接支持该网站的方式。\n\n作者还列出了近期受欢迎的文章，并邀请读者提供反馈并报告违反规则的内容。评论区显示了一个主要支持社区，他们庆祝该网站的周年纪念，并表达对其内容和审核的感谢。"
  },
  {
    "id": "44465319",
    "title": "Mini NASes marry NVMe to Intel's efficient chip",
    "url": "https://www.jeffgeerling.com/blog/2025/mini-nases-marry-nvme-intels-efficient-chip",
    "summary": "This article reviews three mini NAS devices—GMKtec G9, Aiffro K100, and Beelink ME mini—all utilizing Intel N100/N150 chips and designed for users with smaller storage needs. The author, having downsized his homelab, is looking for a compact NAS solution using NVMe SSDs.\n\nAll three NASes feature 2.5 Gbps networking and multiple M.2 NVMe slots. The GMKtec G9 is the budget option but initially suffered from cooling issues, prompting a redesign. The Aiffro K100, though smaller and cooler, is more expensive, lacks eMMC, and has a single 2.5 Gbps port. The Beelink ME mini has six NVMe slots but most are limited to PCIe Gen 3 x1 bandwidth. It also boasts a built-in power supply and comes with eMMC.\n\nWhile the G9 is the cheapest, its initial thermal problems were a concern. The K100 is energy-efficient and runs cool but is the most expensive and lacks eMMC. The ME mini is expandable and currently cheaper than the K100 (pre-sale price), but its bandwidth limitations on individual drive slots hinder performance.\n\nUltimately, the author leans towards the K100 if a good deal on 4 TB NVMe SSDs can be found to meet the 6 TB usable storage requirement. The best choice depends on individual priorities regarding price, cooling, expansion, and features.\n",
    "chinese_title": "迷你NAS结合NVMe与英特尔高效芯片",
    "chinese_summary": "本文评测了三款迷你NAS设备——GMKtec G9、Aiffro K100和Beelink ME mini，它们都采用了英特尔N100/N150芯片，专为存储需求较小的用户设计。作者缩减了他的家庭实验室规模，正在寻找一种使用NVMe SSD的紧凑型NAS解决方案。\n\n这三款NAS都具有2.5 Gbps网络和多个M.2 NVMe插槽。GMKtec G9是预算之选，但最初存在散热问题，促使重新设计。Aiffro K100虽然更小更凉爽，但更昂贵，缺少eMMC，并且只有一个2.5 Gbps端口。Beelink ME mini有六个NVMe插槽，但大多数都限制在PCIe Gen 3 x1带宽。它还拥有内置电源并配备eMMC。\n\n虽然G9是最便宜的，但其最初的散热问题令人担忧。K100节能且运行凉爽，但也是最昂贵的且缺少eMMC。ME mini可扩展，目前比K100便宜（预售价格），但其对单个驱动器插槽的带宽限制阻碍了性能。\n\n最终，如果能找到4 TB NVMe SSD的好价钱以满足6 TB的可用存储需求，作者倾向于选择K100。最佳选择取决于个人在价格、散热、扩展和功能方面的优先考虑。"
  },
  {
    "id": "44442396",
    "title": "Build Systems à la Carte (2018) [pdf]",
    "url": "https://www.microsoft.com/en-us/research/wp-content/uploads/2018/03/build-systems.pdf",
    "summary": "I am unable to summarize the article as the provided text is a PDF file encoded in a way that is difficult for me to read. It appears to be a technical document related to build systems, but I cannot extract the meaningful text needed to understand its content and provide a summary.\n",
    "chinese_title": "点菜式构建系统 (2018) [pdf]",
    "chinese_summary": "我无法总结这篇文章，因为提供的文本是一个PDF文件，其编码方式使我难以读取。它似乎是一份与构建系统相关的技术文档，但我无法提取有意义的文本来理解其内容并提供摘要。"
  },
  {
    "id": "44471896",
    "title": "QSBS Limits Raised",
    "url": "https://www.mintz.com/insights-center/viewpoints/2906/2025-06-25-qsbs-benefits-expanded-under-senate-finance-proposal",
    "summary": "This article discusses proposed changes to Section 1202 regarding Qualified Small Business Stock (QSBS) included in the Senate Finance Committee's version of the \"One Big Beautiful Bill Act.\" Currently, QSBS allows noncorporate founders and investors in C corporations to exclude up to 100% of the gain on the sale of QSBS, limited to the greater of $10 million or 10 times the basis. To qualify, stock must be acquired at original issuance, the company's gross assets must not exceed $50 million, the company must meet active business requirements, and the stock must be held for over five years.\n\nThe Senate Finance proposal includes three key changes: a tiered-gain exclusion based on holding period (50% after 3 years, 75% after 4 years, 100% after 5 years), an increase in the per-issuer gain exclusion cap to $15 million (adjusted for inflation starting in 2027), and an increase in the corporate-level gross asset threshold from $50 million to $75 million (adjusted for inflation starting in 2027). These changes would be effective for stock issued or acquired after the date of enactment.\n\nThe article emphasizes that the proposed changes would provide more flexibility for founders and investors, allowing for earlier exits with partial gain exclusion. It also notes that companies approaching the $50 million asset threshold may consider delaying financing rounds until the legislation's viability is clearer. The authors view the proposed changes as a positive expansion of QSBS incentives for startups.\n",
    "chinese_title": "QSBS额度提高",
    "chinese_summary": "本文探讨了参议院财政委员会“一个美好法案”版本中关于合格小企业股票（QSBS）第1202节的拟议变更。目前，QSBS允许非公司创始人及C型公司投资者免除出售QSBS所得收益，最高可免除100%，但以1000万美元或10倍成本为限，取较高者。要符合条件，股票必须在首次发行时获得，公司总资产不得超过5000万美元，公司必须满足活跃业务要求，且股票必须持有五年以上。\n\n参议院财政提案包括三个关键变化：基于持有期限的分级收益免除（3年后50%，4年后75%，5年后100%）；将每个发行人的收益免除上限提高至1500万美元（自2027年起按通货膨胀调整）；以及将公司层面的总资产门槛从5000万美元提高到7500万美元（自2027年起按通货膨胀调整）。这些变更将适用于法案生效日之后发行或获得的股票。\n\n文章强调，拟议的变更将为创始人和投资者提供更大的灵活性，允许提前退出并部分免除收益。文章还指出，接近5000万美元资产门槛的公司可能会考虑推迟融资，直到该立法的可行性更加明确。作者认为拟议的变更为初创企业提供了积极的QSBS激励扩展。"
  },
  {
    "id": "44439915",
    "title": "Optimizing typography of insect labels using free fonts and free software (2012) [pdf]",
    "url": "https://www.akentsoc.org/doc/Bowser_ML_2012.pdf",
    "summary": "The article \"Optimizing Typography of Insect Labels Using Free Fonts and Free Software\" (2012) discusses how to improve the readability and aesthetic appeal of insect labels by leveraging freely available resources. While the provided text is predominantly unintelligible machine code extracted from a PDF file (including image data and metadata), we can infer the probable core message based on the title.\n\nThe article likely addresses the following topics:\n\n*   **Importance of Typography for Insect Labels:** Highlighting the need for clear and legible labels for proper identification and data management.\n*   **Free Font Selection:** Recommending specific free fonts that are suitable for small text sizes, offer good character distinction, and are widely accessible. Considerations probably include serif vs. sans-serif, font weight, and overall readability.\n*   **Free Software Options:** Introducing free and open-source software (such as Inkscape or similar graphic design tools) that can be used to design and layout insect labels effectively.\n*   **Label Design Principles:** Covering fundamental typographic principles like kerning, leading (line spacing), point size, and contrast to enhance readability.\n*   **Practical Application:** Providing examples or step-by-step instructions on how to design and print insect labels using the suggested fonts and software.\n*   **Considerations for Durability:** Potentially addressing the need for durable printing methods and materials to ensure the labels remain legible in various environmental conditions.\n\nEssentially, the article aims to empower entomologists and researchers to create high-quality insect labels without incurring costs associated with proprietary fonts and software, ultimately improving data accuracy and presentation.\n",
    "chinese_title": "使用免费字体和免费软件优化昆虫标签的排版（2012）[pdf]",
    "chinese_summary": "利用免费字体和免费软件优化昆虫标签的排版 (2012) 探讨了如何通过利用免费资源来提高昆虫标签的可读性和美观性。虽然所提供的文本主要是从PDF文件中提取的难以理解的机器码（包括图像数据和元数据），但我们可以根据标题推断出可能的核心信息。\n\n该文章可能涉及以下主题：\n\n*   **昆虫标签排版的重要性：** 强调清晰易读的标签对于正确识别和数据管理的必要性。\n*   **免费字体选择：** 推荐适合小字号、具有良好字符区分度且广泛可用的特定免费字体。考虑因素可能包括衬线与无衬线、字体粗细和整体可读性。\n*   **免费软件选项：** 介绍可以有效设计和布局昆虫标签的免费和开源软件（如Inkscape或类似的图形设计工具）。\n*   **标签设计原则：** 涵盖基本的排版原则，如字距调整、行距、字号和对比度，以增强可读性。\n*   **实际应用：** 提供有关如何使用建议的字体和软件设计和打印昆虫标签的示例或分步说明。\n*   **耐用性考虑：** 可能会讨论需要耐用的印刷方法和材料，以确保标签在各种环境条件下保持清晰。\n\n本质上，该文章旨在使昆虫学家和研究人员能够创建高质量的昆虫标签，而无需承担与专有字体和软件相关的成本，从而最终提高数据的准确性和呈现效果。"
  },
  {
    "id": "44471695",
    "title": "Problems the AI industry is not addressing adequately",
    "url": "https://www.thealgorithmicbridge.com/p/im-losing-all-trust-in-the-ai-industry",
    "summary": "Alberto Romero's \"I’m Losing All Trust in the AI Industry\" argues that the AI industry is facing serious problems it isn't addressing adequately, leading to a loss of trust.\n\nFirstly, the high rate of talent churn suggests that claims of imminent Artificial General Intelligence (AGI) are exaggerated. The author argues that if researchers genuinely believed AGI was near, they wouldn't be job-hopping for better pay or opportunities.\n\nSecondly, the focus on creating addictive AI products over genuinely useful ones raises ethical concerns. The pursuit of metrics like monthly active users prioritizes retention and monetization, potentially leading to psychological dependence, mirroring the tactics of the social media industry.\n\nThirdly, the economic model is unsustainable. Many frontier AI labs are operating at a loss, requiring constant capital infusions without a clear path to profitability beyond relying on ads. The industry may be driven by a few powerful actors providing services below cost, preventing healthy competition.\n\nFourthly, the hard problems of Large Language Models (LLMs), specifically hallucinations and unreliability, remain unsolved. The author points out the real-world consequences of these flaws, questioning the industry's stated belief that AGI is near, as these are fundamental issues that have not been resolved.\n\nFinally, the public messaging is chaotic, oscillating between utopian promises and dystopian fears, ultimately manipulating public perception. This serves to accelerate AI deployment while avoiding accountability for its current consequences.\n",
    "chinese_title": "人工智能行业未能充分解决的问题",
    "chinese_summary": "阿尔贝托·罗梅罗的《我对人工智能行业失去所有信任》一文认为，人工智能行业正面临着一些未得到充分解决的严重问题，导致信任丧失。\n\n首先，人才流失率高表明，关于通用人工智能（AGI）即将到来的说法被夸大了。作者认为，如果研究人员真的相信AGI即将到来，他们就不会为了更高的薪酬或更好的机会而频繁跳槽。\n\n其次，专注于创造令人上瘾的AI产品而不是真正有用的产品，引发了伦理问题。追求月活跃用户等指标优先考虑用户留存和货币化，可能导致心理依赖，与社交媒体行业的手法如出一辙。\n\n第三，经济模式不可持续。许多前沿人工智能实验室都在亏损运营，需要不断注入资金，但除了依赖广告之外，没有明确的盈利途径。该行业可能由少数几个以低于成本的价格提供服务的强大参与者驱动，从而阻碍了健康的竞争。\n\n第四，大型语言模型（LLM）的难题，特别是幻觉和不可靠性，仍然没有解决。作者指出了这些缺陷在现实世界中的后果，质疑该行业声称AGI即将到来的说法，因为这些都是尚未解决的根本问题。\n\n最后，公众信息混乱，在乌托邦式的承诺和反乌托邦式的恐惧之间摇摆不定，最终操纵了公众的认知。这有助于加速人工智能的部署，同时避免对其当前后果承担责任。"
  },
  {
    "id": "44470656",
    "title": "Telli (YC F24) Is Hiring Engineers [On-Site Berlin]",
    "url": "https://hi.telli.com/join-us",
    "summary": "Telli, a company that participated in Y Combinator's F24 batch, is hiring engineers for on-site positions in Berlin. The job advertisement is hosted on Notion, suggesting that's where details about the specific engineering roles and the company itself can be found. This likely includes information about the technologies they use, the type of engineering work involved, required qualifications, and how to apply. Potential applicants should consult the Notion page directly for more comprehensive information.\n",
    "chinese_title": "Telli (YC F24) 招聘工程师 [柏林现场]",
    "chinese_summary": "参与Y Combinator F24批次的Telli公司正在柏林招聘现场工程师。招聘广告发布在Notion上，具体工程职位和公司详情可能在其中，包括技术栈、工程工作类型、所需资质和申请方式等。潜在申请者应直接查阅Notion页面获取更全面的信息。"
  },
  {
    "id": "44452106",
    "title": "N-Back – A Minimal, Adaptive Dual N-Back Game for Brain Training",
    "url": "https://n-back.net",
    "summary": "This article promotes the N-Back test as a free, scientifically-backed online tool to improve working memory and cognitive abilities. The N-Back test challenges users to identify when the current stimulus in a sequence matches the one from \"N\" steps prior.\n\nThe article explains how to play the 2-Back version, where users must determine if the current square's position matches the position from two steps ago. It highlights benefits like working memory improvement, fluid intelligence enhancement (citing Jaeggi et al., 2008), improved attention and focus, cognitive flexibility, and potentially better academic performance.\n\nIt references scientific research, including studies by Owen et al. (2010) and Klingberg (2010), confirming the effectiveness of working memory training and its impact on brain activity. The article also provides tips for effective N-Back training, such as starting at easier levels, minimizing distractions, practicing regularly, tracking progress, and staying relaxed. Finally, it suggests related N-Back test variations, including 1-Back, 2-Back, 3-Back, and Dual N-Back, and answers frequently asked questions about practice frequency and expected improvements, emphasizing the importance of consistency and scientific validation of the method.\n",
    "chinese_title": "N-Back – 一款极简自适应双N-Back脑力训练游戏",
    "chinese_summary": "本文推广N-Back测试，作为一种免费且有科学依据的在线工具，旨在提高工作记忆和认知能力。N-Back测试要求用户识别当前序列中的刺激是否与“N”步之前的刺激相匹配。\n\n文章解释了如何进行2-Back版本，用户必须确定当前方块的位置是否与两步前的位置相匹配。它强调了诸多益处，例如改善工作记忆、提高流体智力（引用Jaeggi等人，2008）、改善注意力和专注力、认知灵活性，以及潜在的更好的学业表现。\n\n文章引用了科学研究，包括Owen等人 (2010) 和 Klingberg (2010) 的研究，证实了工作记忆训练的有效性及其对大脑活动的影响。文章还提供了有效的N-Back训练技巧，例如从较易的级别开始、尽量减少干扰、定期练习、跟踪进度并保持放松。最后，文章还介绍了相关的N-Back测试变体，包括1-Back、2-Back、3-Back和双N-Back，并解答了关于练习频率和预期改进的常见问题，强调了该方法的一致性和科学验证的重要性。"
  },
  {
    "id": "44449509",
    "title": "The History of Electronic Music in 476 Tracks (1937–2001)",
    "url": "https://www.openculture.com/2025/06/the-history-of-electronic-music-in-476-tracks.html",
    "summary": "This article highlights Ubuweb's online archive of \"The History of Electronic/Electroacoustic Music,\" a compilation of 476 tracks spanning 1937-2001. Originally a 62-CD set, the collection was curated by Caio Barros and caters to those interested in avant-garde and musicological aspects of electronic music. The article mentions key figures like Karlheinz Stockhausen, Pierre Henry, and François Bayle, with links to some of their pieces.\n\nWhile Ubuweb acknowledges the collection's significance, they also point out its limitations: a lack of representation of women and non-Western artists. The article suggests using the collection as a starting point for creating a more inclusive and comprehensive playlist of electronic music history. It also argues that electronic music encompasses a wider range of artists beyond the experimental avant-garde, including popular figures like Brian Eno, Kraftwerk, and Clara Rockmore.\n\nUltimately, the article encourages readers to explore the extensive free collection on Ubuweb and curate their own playlists, while acknowledging the archive's value as a focused course in Western avant-garde electronic music. It also points to related content on the site, including a focus on women in electronic music and the history of electronic music instruments.\n",
    "chinese_title": "电子音乐史：476首曲目 (1937–2001)",
    "chinese_summary": "本文重点介绍了Ubuweb上的“电子/电声音乐史”在线档案，该档案汇集了1937-2001年间的476首曲目。这套最初为62张CD的合集由Caio Barros策划，旨在满足那些对电子音乐的前卫和音乐学方面感兴趣的人的需求。文章提到了卡尔海因茨·施托克豪森、皮埃尔·亨利和弗朗索瓦·贝勒等关键人物，并提供了部分作品的链接。\n\n虽然Ubuweb承认该收藏的重要性，但他们也指出了其局限性：缺乏对女性和非西方艺术家的代表。文章建议将该收藏作为创建更具包容性和更全面的电子音乐史播放列表的起点。它还认为，电子音乐涵盖了更广泛的艺术家，超越了实验性的先锋派，包括像Brian Eno、Kraftwerk和Clara Rockmore等流行人物。\n\n最终，本文鼓励读者探索Ubuweb上丰富的免费收藏，并策划他们自己的播放列表，同时承认该档案作为西方先锋派电子音乐重点课程的价值。文章还指出了网站上相关的内容，包括对电子音乐中的女性和电子乐器历史的关注。"
  },
  {
    "id": "44451949",
    "title": "Numerical Electromagnics Code (NEM)",
    "url": "https://www.nec2.org/",
    "summary": "This webpage serves as an unofficial resource for the Numerical Electromagnetics Code (NEC2), a Method of Moments program used to simulate the electromagnetic response of antennas and metal structures. Developed at Lawrence Livermore Labs, NEC2 is publicly available for various platforms.\n\nThe site offers NEC2 documentation, code examples, and instructions for running NEC2 in Windows, including a sample model for testing. It features a tutorial on antennas for WLAN deployment and provides details and simulation models for the BiQuad antenna, a simple 2.4GHz WLAN antenna.\n\nUsers can access an HTML version of the NEC user manual created by Peter Richeson, along with a historical overview of NEC development. The page also links to the NEC-LIST mailing list, a forum for discussing computational electromagnetics with experts.\n\nFurthermore, the page provides links to other NEC2 resources, including Ray Anderson's \"UnofficalNEC Archives\" and various academic and commercial sites offering NEC-related software and information, such as Nittany Scientific and W7ELCreator of ELNEC/EZNEC. The content on the website is copyrighted by Trevor G. Marshall.\n",
    "chinese_title": "数值电磁学代码",
    "chinese_summary": "本网页是非官方的电磁数值代码(NEC2)资源，NEC2是一个用于模拟天线和金属结构电磁响应的矩量法程序。NEC2由劳伦斯利弗莫尔实验室开发，可公开用于各种平台。\n\n本网站提供NEC2文档、代码示例以及在Windows中运行NEC2的说明，包括一个用于测试的示例模型。它还提供了一个关于WLAN部署天线的教程，并提供了BiQuad天线的详细信息和仿真模型，BiQuad天线是一种简单的2.4GHz WLAN天线。\n\n用户可以访问由Peter Richeson创建的NEC用户手册HTML版本，以及NEC开发的 Historical Overview。该页面还链接到NEC-LIST邮件列表，这是一个与专家讨论计算电磁学的论坛。\n\n此外，该页面还提供了其他NEC2资源的链接，包括Ray Anderson的“UnofficalNEC Archives”，以及提供NEC相关软件和信息的各种学术和商业网站，例如Nittany Scientific和ELNEC/EZNEC的W7ELCreator。本网站的内容受Trevor G. Marshall的版权保护。"
  },
  {
    "id": "44471190",
    "title": "A 37-year-old wanting to learn computer science",
    "url": "https://initcoder.com/posts/37-year-old-learning-cs/",
    "summary": "This blog post introduces a 37-year-old individual, \"InitCoder,\" embarking on a deep dive into computer science. While not a complete beginner, InitCoder possesses self-taught web development skills, including building static blogs and a more complex website using the Astro framework.\n\nDriven by a passion for building and a desire to create meaningful tools for others, InitCoder is leaving behind a non-linear career history, including teaching, to pursue a computer science education for the next decade. The motivation isn't solely career-focused, but rather a desire to gain mastery and build specific projects.\n\nSupported by a psychotherapist wife who is willing to be the sole breadwinner, and with savings to last for several years, InitCoder acknowledges the tech industry's potential ageism but remains undeterred. The planned projects range from a community-focused social media app to a device for streaming content to family members' televisions and educational apps. There's also the ambition to create a sustainable revenue stream through either a niche product or an e-commerce platform for wooden toys.\n\nInitCoder plans to document progress on this journey, seeking luck and support from the online community. Resources like TeachYourselfCS and OSSU's computer science curriculum will be utilized. The post highlights a thoughtful, long-term commitment to learning and creating, fueled by passion and a supportive environment.\n",
    "chinese_title": "想学计算机科学的37岁人士",
    "chinese_summary": "此博文介绍了一位37岁的“InitCoder”，他正全身心投入计算机科学的学习。InitCoder并非完全的新手，他自学掌握了Web开发技能，包括构建静态博客以及使用Astro框架开发更复杂的网站。\n\n出于对构建事物的热爱以及为他人创造实用工具的渴望，InitCoder放弃了以往非线性的职业生涯（包括教学），计划在未来十年追求计算机科学教育。他的动力不仅仅在于职业发展，更在于获得精通并构建特定项目。\n\n在心理治疗师妻子的支持下（她愿意成为唯一的经济支柱），以及拥有足够维持数年的积蓄，InitCoder承认科技行业的潜在年龄歧视，但他仍然毫不气馁。计划中的项目包括一个以社区为中心的社交媒体应用、一个用于向家人电视流媒体内容的设备以及教育应用。他还有雄心壮志，希望通过利基产品或木制玩具电子商务平台创造可持续的收入来源。\n\nInitCoder计划记录此过程中的进展，并寻求在线社区的幸运和支持。他将利用诸如TeachYourselfCS和OSSU的计算机科学课程等资源。 这篇文章突出了一个深思熟虑的、长期的学习和创造承诺，它受到激情和支持性环境的推动。"
  },
  {
    "id": "44466697",
    "title": "Incapacitating Google Tag Manager (2022)",
    "url": "https://backlit.neocities.org/incapacitate-google-tag-manager",
    "summary": "This article argues that Google Tag Manager (GTM) is a destructive tool for online privacy, primarily used for surveillance rather than its purported general purposes. It highlights GTM's role in enabling Google Analytics (GA) to track user behavior in detail, identify individuals, and exploit their vulnerabilities for profit.\n\nThe author criticizes Google's move to integrate GTM into the first-party domain to circumvent content blocking, further endangering user privacy. While acknowledging that content blockers like uBlock Origin can block GTM, some websites circumvent this by running GTM on the server-side, making it unblockable.\n\nThe article advocates for disabling JavaScript as the most effective way to neutralize GTM's surveillance capabilities. This action prevents GTM from launching its \"tentacles,\" including Google Analytics and other spyware routines, even when running on the server-side. However, it acknowledges that disabling JavaScript will break many websites, a tactic the author claims is deliberately employed by sites to force users to accept surveillance.\n\nThe author suggests blocking all cookies (first-party and third-party) and provides two methods for incapacitating GTM: disabling all JavaScript and image loading in the browser or using uBlock Origin's JavaScript disabling feature. Both methods render GTM largely useless, though the latter offers more flexibility. The article emphasizes that collective action, like widespread blocking of GA4 and GTM, can render these tools ineffective and force their withdrawal.\n",
    "chinese_title": "禁用Google Tag Manager (2022)",
    "chinese_summary": "本文认为谷歌代码管理器（GTM）是一种破坏在线隐私的工具，主要用于监视，而非其声称的通用目的。文章强调了GTM在使谷歌分析（GA）能够详细追踪用户行为、识别个人身份并利用其漏洞牟利方面的作用。\n\n作者批评谷歌将GTM整合到第一方域名以规避内容屏蔽的行为，认为这进一步危及了用户隐私。文章承认像uBlock Origin这样的内容拦截器可以屏蔽GTM，但一些网站通过在服务器端运行GTM来规避这一点，使其无法被拦截。\n\n文章提倡禁用JavaScript作为中和GTM监视能力的最有效方法。此举可以阻止GTM启动其“触角”，包括谷歌分析和其他间谍软件程序，即使在服务器端运行也是如此。但是，文章承认禁用JavaScript会破坏许多网站，作者声称网站故意采用这种策略来迫使用户接受监视。\n\n作者建议阻止所有cookie（第一方和第三方），并提供了两种使GTM失效的方法：禁用浏览器中的所有JavaScript和图像加载，或者使用uBlock Origin的JavaScript禁用功能。这两种方法在很大程度上都使GTM无用，但后者提供了更大的灵活性。文章强调，像广泛阻止GA4和GTM这样的集体行动可以使这些工具失效，并迫使它们撤回。"
  },
  {
    "id": "44464068",
    "title": "Why I left my tech job to work on chronic pain",
    "url": "https://sailhealth.substack.com/p/why-i-left-my-tech-job-to-work-on",
    "summary": "Here's a summary of the article \"Why I left my tech job to work on chronic pain,\" based on the provided link and assuming it's a personal essay:\n\nThe author details their personal journey from a lucrative, stable career in the tech industry to pursuing work related to chronic pain, a field deeply impacted by their own experiences and struggles. They felt increasingly disillusioned with the often superficial and abstract nature of their tech work, yearning for something more meaningful and impactful.\n\nThe turning point came with their own battles with chronic pain. This experience provided firsthand insight into the limitations and frustrations of the current healthcare system in addressing chronic conditions. The author highlights the lack of effective treatments, the emotional toll on patients, and the systemic challenges in research and development within the chronic pain space.\n\nMotivated by their personal experience and a desire to help others facing similar challenges, the author made the difficult decision to leave their comfortable tech job. They acknowledge the financial and social risks involved, but emphasize the compelling need for innovation and improved solutions in chronic pain management.\n\nThe article frames this career change as a pursuit of purpose and a commitment to contribute to a field where they can make a real difference in people's lives. The author expresses optimism and determination to leverage their skills and knowledge to drive positive change in the chronic pain landscape, even acknowledging the significant challenges that lie ahead. Essentially, they traded stability for purpose, driven by personal experience and a desire to alleviate suffering.\n",
    "chinese_title": "我为何离开科技行业，转而研究慢性疼痛",
    "chinese_summary": "以下是基于所提供的链接和假设这是一篇个人文章，对文章《我为什么离开我的技术工作去从事慢性疼痛领域》的摘要：\n\n作者详细描述了自己从技术行业一份收入丰厚、稳定的工作，转而从事与慢性疼痛相关工作的个人经历。慢性疼痛领域深受作者自身经历和斗争的影响。他们越来越对技术工作肤浅和抽象的本质感到失望，渴望更有意义和更有影响力的事情。\n\n转变的转折点来自于他们自己与慢性疼痛的斗争。这段经历让他们对当前医疗系统在解决慢性疾病方面的局限性和挫败感有了第一手的了解。作者强调了缺乏有效的治疗方法、患者的情感负担以及慢性疼痛领域研究和发展中的系统性挑战。\n\n受到个人经历和帮助其他面临类似挑战的人的愿望的驱使，作者做出了艰难的决定，离开了舒适的技术工作。他们承认其中涉及的经济和社会风险，但强调了在慢性疼痛管理方面进行创新和改进解决方案的迫切需求。\n\n这篇文章将这种职业转变描述为对目标的追求和致力于为一个他们可以真正改变人们生活的领域做出贡献。作者表达了乐观和决心，要利用他们的技能和知识来推动慢性疼痛领域的积极变革，即使他们也承认未来面临的重大挑战。本质上，他们用稳定换取了目标，这是由个人经历和减轻痛苦的愿望所驱动的。"
  },
  {
    "id": "44465731",
    "title": "EverQuest",
    "url": "https://www.filfre.net/2025/07/everquest/",
    "summary": "This article recounts the origin story of the MMORPG *EverQuest*, highlighting its rise to prominence despite *Ultima Online* being the pioneer in the genre. It emphasizes that *EverQuest* learned from *Ultima Online*'s missteps, allowing it to achieve greater success.\n\nThe article details how John Smedley, a producer at Sony Interactive (focused on sports games), pitched the idea of an online CRPG to his boss, Kelly Flock. Flock approved a feasibility study, leading to the hiring of Brad McQuaid and Steve Clover, two developers working on their own CRPG, *WarWizard*. They were brought in to design *EverQuest*, named quickly and without debate.\n\nA key difference between *EverQuest* and *Ultima Online* was their development approach. While the Kosters (the *Ultima Online* designers) adopted an iterative, experimental process, *EverQuest*'s development, influenced by Smedley's experience with sports games and Clover and McQuaid's MUDding and coding background, focused on a detailed design document upfront. The article also points to the use of a DikuMUD toolkit and the adoption of a first-person 3D perspective after seeing the 3DO's Meridian 59, as major influences.\n\nThe article concludes by mentioning the key role of Rosie Cosgrove (now Rosie Strzalkowski), the lead artist, in shaping the game's distinctive aesthetic of whimsical fun. This aesthetic, combined with the team's focus on accessibility and straightforward gameplay, ultimately contributed to *EverQuest*'s success.\n",
    "chinese_title": "无尽的任务",
    "chinese_summary": "本文讲述了大型多人在线角色扮演游戏《无尽的任务》(EverQuest)的起源故事，并强调了尽管《网络创世纪》(Ultima Online)是该类型的先驱，但《无尽的任务》如何崛起。文章强调《无尽的任务》从《网络创世纪》的失误中吸取了教训，从而取得了更大的成功。\n\n文章详细介绍了索尼互动（专注于体育游戏）的制作人约翰·斯梅德利如何向他的老板凯利·弗洛克提出了开发在线CRPG的想法。弗洛克批准了一项可行性研究，促使公司聘请了布拉德·麦奎德和史蒂夫·克洛弗，这两位开发者当时正在开发他们自己的CRPG《战巫师》(WarWizard)。他们被请来设计《无尽的任务》，这个名字很快就被确定下来，而且没有经过任何讨论。\n\n《无尽的任务》和《网络创世纪》之间的一个关键区别是它们的开发方法。科斯特夫妇（《网络创世纪》的设计师）采用了一种迭代的、实验性的过程，而《无尽的任务》的开发，受到了斯梅德利在体育游戏方面的经验以及克洛弗和麦奎德在MUD游戏和编程方面的背景的影响，侧重于事先制定详细的设计文档。文章还指出，DikuMUD工具包的使用以及在看到了3DO的Meridian 59后采用的第一人称3D视角，都是重要的影响因素。\n\n文章最后提到首席美术师罗西·科斯格罗夫（现名罗西·斯特扎科夫斯基）在塑造游戏独特的异想天开的乐趣美学方面发挥了关键作用。这种美学，加上团队对可访问性和简单直接的游戏玩法的关注，最终促成了《无尽的任务》的成功。"
  },
  {
    "id": "44469124",
    "title": "OBBB signed: Reinstates immediate expensing for U.S.-based R&D",
    "url": "https://www.kbkg.com/feature/house-passes-tax-bill-sending-to-president-for-signature",
    "summary": "The \"One Big Beautiful Bill Act\" (OBBBA) has been signed into law, significantly overhauling federal tax policy with a focus on domestic production and pro-business incentives. Key changes include:\n\n*   **Restored 100% Bonus Depreciation:** Businesses can immediately expense qualifying assets placed in service after January 19, 2025, and qualified production property receives 100% bonus depreciation until 2029.\n*   **Immediate Expensing of U.S. R&D:** Domestic research costs are now fully deductible, with a catch-up deduction available for capitalized expenses from 2022-2024. Foreign R&D must still be amortized over 15 years.\n*   **Termination of IRA Clean Energy Incentives:** Many green tax credits, like 179D, 45L, and certain electric vehicle credits, are eliminated, impacting renewable energy project economics.\n*   **Changes to Clean Energy ITC and PTC:** Projects relying on these credits must begin construction within 12 months of enactment and be placed in service by December 31, 2027.\n*   **Other Highlights:** Section 179 expensing cap is increased, SALT workarounds are preserved but with a higher cap and phase-out for high earners, and other international tax reforms, LIHTC enhancements and middle-class deductions were also introduced.\n\nTax practitioners and businesses are urged to review client portfolios, model scenarios, and communicate changes to stakeholders, as many provisions take effect immediately or retroactively to the start of 2025.\n",
    "chinese_title": "OBBB法案签署：恢复美国本土研发的立即费用化",
    "chinese_summary": "《“一项宏伟美好法案”》(OBBBA)已签署成为法律，大幅改革联邦税收政策，重点关注国内生产和亲商激励措施。 主要变更包括：\n\n*   **恢复100%额外折旧：** 企业可立即扣除2025年1月19日之后投入使用的符合条件的资产，符合条件的生产性财产可享受100%的额外折旧，直至2029年。\n*   **美国研发费用立即支出：** 国内研发成本现在可以完全扣除，并为2022-2024年的资本化费用提供追补扣除。 国外研发仍必须在15年内摊销。\n*   **终止IRA清洁能源激励：** 许多绿色税收抵免，如179D、45L和某些电动汽车抵免，已被取消，影响了可再生能源项目的经济效益。\n*   **清洁能源ITC和PTC的变更：** 依赖这些抵免的项目必须在颁布后12个月内开始建设，并在2027年12月31日之前投入使用。\n*   **其他亮点：** 第179条支出上限增加，SALT规避措施得以保留，但高收入者的上限更高且逐步取消，还引入了其他国际税收改革、LIHTC改进和中产阶级扣除。\n\n税务从业者和企业被敦促审查客户投资组合、模拟情景，并向利益相关者传达变更，因为许多条款立即生效或追溯至2025年初。"
  },
  {
    "id": "44433094",
    "title": "In a milestone for Manhattan, a pair of coyotes has made Central Park their home",
    "url": "https://www.smithsonianmag.com/science-nature/in-a-milestone-for-manhattan-a-pair-of-coyotes-has-made-central-park-their-home-180986892/",
    "summary": "In a remarkable development, a pair of coyotes, nicknamed Romeo and Juliet, have established themselves in Central Park, marking a significant milestone for the species' expansion across the United States. Photographers David Lei and Jacqueline Emery have been documenting the coyotes' lives, observing their mating rituals, hunting habits, and interactions within the urban environment.\n\nThe article highlights the shift in attitude toward coyotes in New York City. A previous negative approach has evolved into a strategy promoting coexistence through public policy and education. While some residents express concerns, the authors emphasize that the coyotes haven't harmed any people or pets, contrasting this with the higher incidence of dog bites in the area.\n\nThe authors describe Romeo and Juliet's daily routines, their ability to navigate the park's challenges, and their interactions with other wildlife. Despite witnessing mating, the pair hasn't yet produced pups, leading to speculation from experts about potential factors such as infertility, disturbance, or lack of suitable denning locations.\n\nThe article underscores the importance of respecting urban wildlife and promoting positive narratives about coyotes. Despite debates about the species being in cities, the authors hope New Yorkers will embrace these animals, recognizing their role in the ecosystem, which is helping to keep rodent and geese populations under control.\n\nOverall, the article celebrates Romeo and Juliet's presence as a sign of a healthier ecosystem and encourages a shift towards appreciation and coexistence with these adaptable urban dwellers.\n",
    "chinese_title": "曼哈顿迎来里程碑，一对郊狼已将中央公园安家落户。",
    "chinese_summary": "一对被昵称为罗密欧和朱丽叶的郊狼在中央公园安家落户，这一非凡的进展标志着该物种在美国扩张的一个重要里程碑。摄影师David Lei和Jacqueline Emery一直在记录郊狼的生活，观察它们的交配仪式、狩猎习惯以及在城市环境中的互动。\n\n文章重点介绍了纽约市对待郊狼态度的转变。过去消极的方式已经演变为一种通过公共政策和教育来促进共存的策略。尽管一些居民表示担忧，但作者强调，郊狼没有伤害任何人或宠物，这与该地区较高的犬只咬伤事件形成对比。\n\n作者描述了罗密欧和朱丽叶的日常活动，它们应对公园挑战的能力，以及它们与其他野生动物的互动。尽管目睹了交配，但这对郊狼尚未产下幼崽，这导致专家们推测可能的因素，如不孕、干扰或缺乏合适的筑巢地点。\n\n文章强调了尊重城市野生动物和宣传关于郊狼的积极叙事的重要性。尽管存在关于该物种是否应该出现在城市中的争论，但作者希望纽约人能够拥抱这些动物，认识到它们在生态系统中的作用，这有助于控制啮齿动物和鹅的数量。\n\n总的来说，文章庆祝罗密欧和朱丽叶的存在，将其视为生态系统更健康的标志，并鼓励人们转变观念，欣赏并与这些适应性强的城市居民共存。"
  },
  {
    "id": "44468175",
    "title": "Nvidia won, we all lost",
    "url": "https://blog.sebin-nyshkim.net/posts/nvidia-is-full-of-shit/",
    "summary": "This article paints a critical picture of Nvidia's current state, arguing that despite their financial success, their practices negatively impact consumers. The author focuses on the RTX 50 series launch as a case study of these issues.\n\nFirstly, the author highlights the difficulty of obtaining GPUs at MSRP due to scalper bots and alleged intentional supply shortages by Nvidia, leading to inflated prices and bundled products. They point out that even older RTX 40 series cards remain overpriced.\n\nSecondly, the article criticizes Nvidia for shipping defective chips with missing ROPs, downplaying the performance impact, and later admitting the issue affected more models than initially stated. The 12VHPWR connector's continued use, despite melting cable issues stemming from a flawed design, is another major concern. The author explains the technical reasons behind the melting cables, blaming Nvidia's change in shunt resistor design.\n\nBeyond hardware, the author critiques Nvidia's proprietary technologies like DLSS, CUDA, NVENC, and G-Sync as creating vendor lock-in, forcing users to stick with Nvidia despite the problems. They also discuss Nvidia's removal of 32-bit PhysX support, breaking backward compatibility.\n\nFinally, the article accuses Nvidia of misleading marketing around DLSS and ray tracing. The author argues that DLSS is a crutch, used to compensate for the performance demands of ray tracing, a technology still beyond the capabilities of even the top-end cards in native 4K. They conclude that Nvidia's focus on data center GPUs leads to neglecting consumer needs and prioritizing profit over quality and accessibility.\n",
    "chinese_title": "英伟达赢了，我们都输了。",
    "chinese_summary": "本文对英伟达的现状进行了批判性描述，认为尽管其财务上取得了成功，但其行为对消费者产生了负面影响。作者以RTX 50系列发布为例，对这些问题进行了案例研究。\n\n首先，作者强调了由于黄牛机器人和英伟达涉嫌故意制造供应短缺，导致消费者难以按建议零售价购买到GPU，从而导致价格上涨和捆绑销售。他们指出，即使是较旧的RTX 40系列显卡仍然定价过高。\n\n其次，文章批评英伟达发布存在缺陷的、缺少ROPs的芯片，淡化其对性能的影响，并在后来承认该问题影响的模型比最初声明的更多。 尽管存在因设计缺陷导致的电缆熔化问题，12VHPWR连接器的持续使用是另一个主要问题。作者解释了电缆熔化背后的技术原因，将责任归咎于英伟达在分流电阻设计上的改变。\n\n除了硬件之外，作者还批评英伟达的专有技术，如DLSS、CUDA、NVENC和G-Sync，认为它们造成了厂商锁定，迫使用户即使存在问题也只能坚持使用英伟达的产品。他们还讨论了英伟达移除32位PhysX支持，破坏了向后兼容性。\n\n最后，文章指责英伟达在DLSS和光线追踪方面存在误导性营销。作者认为DLSS是一种拐杖，用于弥补光线追踪的性能需求，而光线追踪这项技术即使对于原生4K的顶级显卡来说，仍然超出了其能力范围。他们得出结论，英伟达对数据中心GPU的关注导致其忽视消费者需求，并将利润置于质量和可访问性之上。"
  },
  {
    "id": "44455124",
    "title": "Baba Is Eval",
    "url": "https://fi-le.net/baba/",
    "summary": "This article introduces \"Baba Is Eval,\" a project turning the puzzle game Baba Is You into a benchmark for language models, drawing inspiration from similar initiatives like Claude playing Pokémon and the Factorio Learning Environment. The challenge lies in the game's abstract rule manipulation, making it a strong reasoning test similar to the upcoming ARC-AGI-3.\n\nThe author outlines the key desiderata: fetching the game state into the model's context, allowing the model to control the game through actions like movement, undo, and reset, and automating menu navigation. They achieved this by extracting the game state from Lua scripts using mod hooks and a Python MCP server to serialize and present the game board as a text-based grid. Game control is implemented via asynchronous Lua file writes triggered by commands from the language model.\n\nLevel selection is handled through simulated keyboard inputs. Claude Desktop is used as the demo client, leveraging its tool calling and context management capabilities. However, initial results with Claude 4 were disappointing, struggling even with basic levels due to limitations in rule tracking, pathfinding, and strategic planning.\n\nThe author suggests future improvements including using reasoning-focused models like o3, optimizing context management and game state representation for tokenizers, and abstracting the input space with tools like \"move_to().\" The project repository is open for contributions, inviting others to improve upon the current implementation.\n",
    "chinese_title": "巴巴是求值",
    "chinese_summary": "本文介绍了 \"Baba Is Eval\" 项目，该项目将益智游戏 Baba Is You 转化为语言模型的基准测试，其灵感来自 Claude 玩 Pokémon 和 Factorio 学习环境等类似举措。挑战在于游戏中抽象的规则操作，使其成为与即将推出的 ARC-AGI-3 类似的强大推理测试。\n\n作者概述了关键需求：将游戏状态提取到模型的上下文中，允许模型通过移动、撤销和重置等操作来控制游戏，以及自动化菜单导航。他们通过使用 mod hooks 从 Lua 脚本中提取游戏状态，并使用 Python MCP 服务器来序列化游戏棋盘并将其呈现为基于文本的网格来实现这一点。游戏控制是通过语言模型发出的命令触发的异步 Lua 文件写入来实现的。\n\n关卡选择通过模拟键盘输入来处理。 Claude Desktop 用作演示客户端，利用其工具调用和上下文管理功能。然而，使用 Claude 4 的初步结果令人失望，由于规则跟踪、寻路和战略规划方面的限制，即使是基本关卡也难以完成。\n\n作者建议未来的改进包括使用以推理为中心的模型（如 o3），优化上下文管理和游戏状态表示以适应 tokenizer，以及使用 \"move_to()\" 等工具抽象输入空间。该项目存储库已开放供稿，邀请其他人改进当前的实现。"
  },
  {
    "id": "44469727",
    "title": "ADXL345 (2024)",
    "url": "https://www.tinytransistors.net/2024/08/25/adxl345/",
    "summary": "This article dissects a suspicious ADXL345 accelerometer, a popular MEMS device, that exhibited significant malfunctions. The author received the device from a reader who suspected it was counterfeit after experiencing issues with offsets, axis measurements, and freefall detection.\n\nInitially, the chip's exterior appeared normal, but closer inspection revealed laser markings beneath the original ones, suggesting tampering. Dissection revealed a two-chip module: a MEMS sensor and a readout chip. The readout chip contained an ADC and digital logic for SPI/I2C communication, with the chip ID confirming it was an ADXL345. The MEMS die surprisingly displayed \"ADXL335,\" suggesting it used the same MEMS die as a less capable analog accelerometer.\n\nFurther separation of the MEMS die revealed its intricate structure. The author describes the proof mass, fixed and moving beams for measuring acceleration along different axes, bump stops (likely the purpose of Y-shaped features on the other half of the chip), and the self-test function. He also explains how the z-axis sensing function is implemented.\n\nThe author concludes that the chip is likely a rejected unit from the manufacturing process that was subsequently re-marked and sold as functional. While the chip's internal components appear legitimate, they likely fell outside acceptable performance specifications. The article highlights the beauty and complexity of MEMS devices compared to purely electronic chips, emphasizing their unique blend of mechanical and electrical engineering.\n",
    "chinese_title": "ADXL345 (2024)",
    "chinese_summary": "本文剖析了一款可疑的 ADXL345 加速度计。该设备是一种常见的 MEMS 器件，但表现出显著的故障。作者从一位读者处收到了该设备，这位读者在使用过程中遇到了偏移、轴测量和自由落体检测等问题，怀疑其为假冒产品。\n\n最初，该芯片的外部看起来正常，但仔细检查后发现原始标记下方有激光标记，表明曾被篡改。解剖显示这是一个双芯片模块：一个 MEMS 传感器和一个读出芯片。读出芯片包含一个用于 SPI/I2C 通信的 ADC 和数字逻辑，芯片 ID 确认其为 ADXL345。令人惊讶的是，MEMS 芯片上显示“ADXL335”，表明它使用了与功能较弱的模拟加速度计相同的 MEMS 芯片。\n\n进一步分离 MEMS 芯片后，揭示了其复杂的结构。作者描述了证明质量、用于测量不同轴上加速度的固定和移动梁、缓冲挡块（可能是芯片另一半上 Y 形特征的目的）以及自检功能。他还解释了如何实现 z 轴传感功能。\n\n作者的结论是，该芯片很可能是制造过程中被拒绝的单元，随后被重新标记并作为功能单元出售。虽然该芯片的内部组件看起来是合法的，但它们可能超出了可接受的性能规范。文章突出了 MEMS 器件相比纯电子芯片的美观和复杂性，强调了它们独特的机械和电气工程的结合。"
  },
  {
    "id": "44463967",
    "title": "Show HN: I AI-coded a tower defense game and documented the whole process",
    "url": "https://github.com/maciej-trebacz/tower-of-time-game",
    "summary": "\"Tower of Time\" is a time-traveling tower defense game created primarily with AI assistance, developed for the Beginner's Jam Summer 2025. The game allows players to defend their base against waves of enemies and rewind time to adjust their strategies. Key features include multiple tower types, an energy management system, and keyboard/gamepad controls.\n\nThe developer, m4v3k, highlights the project as a \"Vibe Coding Proof of Concept,\" noting that approximately 95% of the codebase was generated by AI using tools like Augment Code, Cursor, and Claude Sonnet 4. He emphasizes the feasibility of AI-assisted game development, while cautioning about the need for developer expertise, careful transition from prototype to final game, and AI's tendency to generate excessive code.\n\nThe developer learned that providing specific documentation URLs helped the AI when coding specific features and that debugging through console logs was a key method. The tech stack includes Phaser 3, TypeScript, and Vite. The project structure organizes code into directories for scenes, prefabs, systems, components, and UI.\n\nThe game is available to play at a provided itch.io link. Balancing, menu music, and testing were provided by death_unites_us, with in-game music and art assets sourced from various creators, all credited in the description. The game is released under the MIT License.\n",
    "chinese_title": "展示一下：我用AI编写了一个塔防游戏，并记录了整个过程",
    "chinese_summary": "《时间之塔》是一款主要借助AI辅助创作的时间穿越塔防游戏，为2025新手夏季游戏创作赛而开发。游戏中，玩家需要抵御一波又一波的敌人，并可以倒转时间来调整策略。主要功能包括多种类型的防御塔、能量管理系统以及键盘/手柄控制。\n\n开发者m4v3k将该项目强调为“氛围编程概念验证”，指出大约95%的代码库是由AI使用Augment Code、Cursor和Claude Sonnet 4等工具生成的。他强调了AI辅助游戏开发的可行性，同时也提醒开发者需要专业知识，从原型到最终游戏的谨慎过渡，以及AI生成过度代码的倾向。\n\n开发者了解到，提供特定的文档URL有助于AI编写特定功能，并通过控制台日志进行调试是一个关键方法。技术栈包括Phaser 3、TypeScript和Vite。项目结构将代码组织到场景、预制件、系统、组件和UI的目录中。\n\n游戏可通过提供的itch.io链接进行游玩。平衡性、菜单音乐和测试由death_unites_us提供，游戏中的音乐和美术资源来自不同的创作者，所有这些都在描述中进行了注明。该游戏以MIT许可证发布。"
  },
  {
    "id": "44458890",
    "title": "Wind Knitting Factory",
    "url": "https://www.merelkarhof.nl/work/wind-knitting-factory",
    "summary": "\"Wind Knitting Factory\" by Merel Karhof is a wind-powered knitting machine installed on a building's facade. A wind turbine with large blades catches the wind, using it to drive a knitting machine. This machine knits a long scarf that descends the building's exterior. The knitting speed varies with the wind's strength. The scarf is then transported inside where it is collected, cut and transformed into scarves. Each harvested scarf receives a label detailing the date and time the wind knitted it. This creates a visual representation of urban wind energy production. The project operates in both the public and private realms, demonstrating the potential of urban wind to produce tangible goods.\n",
    "chinese_title": "风编织厂",
    "chinese_summary": "风力针织工厂"
  },
  {
    "id": "44437014",
    "title": "Scientists capture slow-motion earthquake in action",
    "url": "https://phys.org/news/2025-06-scientists-capture-motion-earthquake-action.html",
    "summary": "Scientists have, for the first time, detected a slow slip earthquake in action along Japan's Nankai Fault, a region known for generating large earthquakes and tsunamis. Researchers from the University of Texas at Austin used borehole sensors placed offshore to capture the slow-motion event, which they describe as a slow \"unzipping\" of the fault line between tectonic plates.\n\nThe slow slip earthquake, recorded in 2015 and followed by a similar event in 2020, moved along the tail of the fault, the region near the seafloor where shallow earthquakes can trigger tsunamis. These events appear to ease tectonic pressure in this area, suggesting it acts as a tectonic \"shock absorber,\" preventing energy from contributing to larger, more hazardous earthquakes.\n\nThe study found the slow slip events occurred where geologic fluid pressures were higher than normal, supporting the idea that fluids are a key component in slow earthquakes. These events travelled about 20 miles along the fault over several weeks.\n\nThe findings are crucial for understanding subduction zone faults along the Pacific Ring of Fire. In contrast to the Nankai Fault, the Cascadia fault off the Pacific Northwest lacks similar slow slip at its tsunami-generating end, potentially indicating a higher risk of large earthquakes and tsunamis. This research emphasizes the importance of high-precision monitoring of faults to assess their potential hazards.\n",
    "chinese_title": "科学家捕捉到地震慢动作",
    "chinese_summary": "科学家首次探测到日本南海海槽正在发生的慢滑地震，该地区以产生大型地震和海啸而闻名。德克萨斯大学奥斯汀分校的研究人员利用放置在近海的井孔传感器捕捉到了这一慢动作事件，他们将其描述为构造板块之间断层线的缓慢“解压”。\n\n2015年记录到的慢滑地震，以及2020年发生的类似事件，沿着断层尾部移动，该区域靠近海底，浅层地震可能引发海啸。这些事件似乎缓解了该区域的构造压力，表明它起到了构造“减震器”的作用，阻止能量导致更大、更危险的地震。\n\n研究发现，慢滑事件发生在 geological fluid pressures (地质流体压力)高于正常水平的地方，支持了流体是慢地震关键组成部分的观点。这些事件在几周内沿着断层移动了约 20 英里。\n\n该发现对于理解环太平洋火山带的俯冲带断层至关重要。与南海海槽相比，太平洋西北部沿海的卡斯卡迪亚断层在其海啸生成端缺乏类似的慢滑，可能表明发生大型地震和海啸的风险更高。这项研究强调了对断层进行高精度监测以评估其潜在危险的重要性。"
  },
  {
    "id": "44457623",
    "title": "Will Scaling Solve Robotics?",
    "url": "https://nishanthjkumar.com/blog/2023/Will-Scaling-Solve-Robotics-Perspectives-from-CoRL-2023/",
    "summary": "Nishanth J. Kumar's article summarizes the debate at CoRL 2023 regarding whether scaling up neural networks and datasets is a viable path to solving general-purpose robotics, akin to the successes seen in computer vision (CV) and natural language processing (NLP).\n\nArguments for scaling:\n*   **Success in CV/NLP:** Similar scaling approaches have led to breakthroughs and emergent capabilities in other fields.\n*   **Early evidence:** RT-X, RT-2, Diffusion Policies, and robot-agnostic navigation models show promising generalization with larger datasets.\n*   **Riding the wave:** Leveraging data and compute improvements is a proven strategy in AI.\n*   **Manifold hypothesis:** Robotics tasks may exist on a simpler manifold that large models can discover.\n*   **Common sense:** Large models can potentially capture the \"common sense\" reasoning needed for many robotics tasks.\n\nArguments against scaling:\n*   **Data scarcity:** Obtaining robotics data is difficult and expensive compared to CV/NLP.\n*   **Embodiment differences:** Robots have varying shapes, sizes, and control systems, complicating data aggregation.\n*   **Environmental variance:** The diversity of environments is vast, making comprehensive data collection impractical.\n*   **Computational cost:** Training large robotics models can be prohibitively expensive in terms of money and energy.\n*   **The 99.X% problem:** Achieving the high accuracy and reliability required for real-world applications is challenging.\n*   **Limitations in CV/NLP:** Even advanced models don't consistently reach the 99.X% threshold.\n*   **Self-driving car example:** Despite extensive data and resources, self-driving car companies using end-to-end models haven't achieved full autonomy.\n*   **Long-horizon tasks:** Many robotics tasks require a long sequence of correct actions, making it difficult for models to succeed.\n",
    "chinese_title": "规模化能解决机器人技术难题吗？",
    "chinese_summary": "Nishanth J. Kumar的文章总结了CoRL 2023上关于是否可以通过扩展神经网络和数据集来解决通用机器人问题的辩论，类似于计算机视觉（CV）和自然语言处理（NLP）领域取得的成功。\n\n支持扩展的论点：\n*   **CV/NLP领域的成功：** 类似的扩展方法已在其他领域带来了突破和涌现能力。\n*   **早期证据：** RT-X、RT-2、扩散策略和与机器人无关的导航模型显示出使用更大的数据集具有广阔的泛化前景。\n*   **顺应潮流：** 利用数据和计算能力的提升是人工智能领域已被证明有效的策略。\n*   **流形假设：** 机器人任务可能存在于一个更简单的流形上，大型模型可以发现它。\n*   **常识：** 大型模型有可能捕获许多机器人任务所需的“常识”推理。\n\n反对扩展的论点：\n*   **数据稀缺：** 与CV/NLP相比，获取机器人数据困难且昂贵。\n*   **具身差异：** 机器人具有不同的形状、尺寸和控制系统，使数据聚合变得复杂。\n*   **环境差异：** 环境的多样性是巨大的，使得全面的数据收集不切实际。\n*   **计算成本：** 训练大型机器人模型的成本可能非常高昂，无论是金钱还是能源。\n*   **99.X% 问题：** 实现实际应用所需的高精度和可靠性具有挑战性。\n*   **CV/NLP的局限性：** 即使是先进的模型也无法始终如一地达到 99.X% 的阈值。\n*   **自动驾驶汽车的例子：** 尽管拥有大量数据和资源，但使用端到端模型的自动驾驶汽车公司尚未实现完全自主。\n*   **长时程任务：** 许多机器人任务需要一系列正确的动作，这使得模型难以成功。"
  },
  {
    "id": "44467312",
    "title": "The story behind Caesar salad",
    "url": "https://www.nationalgeographic.com/travel/article/story-behind-caesar-salad",
    "summary": "The Caesar salad, a dish celebrated worldwide, originated in 1924 at Restaurante Caesar's in Tijuana, Mexico, owned by Italian immigrant Caesar Cardini. Facing a shortage of ingredients on a busy Fourth of July, Cardini improvised a salad tableside, using leftover romaine lettuce, garlic croutons, and a dressing based on raw egg, anchovies, garlic, Dijon mustard, lemon, salt, pepper, and parmesan.\n\nThe salad quickly gained popularity, attracting celebrities and culinary enthusiasts. While Caesar Cardini is credited with inventing the dish, some attribute the addition of anchovies and Dijon mustard to his brother, Alex Cardini. Others claim Livio Santini came up with the original recipe.\n\nTraditionally, the Caesar salad was prepared tableside to showcase fresh ingredients. The ensalador would add ingredients one by one, creating a creamy dressing before tossing it with romaine leaves and croutons, topped with parmesan.\n\nToday, many restaurants use Alex Cardini's variation with anchovies, Dijon mustard, and lemon. Despite variations, the tableside preparation remains a tradition in some establishments. The article highlights several restaurants where you can experience different versions of the Caesar salad, including Caesar's in Tijuana, Paradise Point Resort & Spa in San Diego, Lola 55 Tacos & Cocktails (San Diego), and Dan Tana's in Los Angeles.\n",
    "chinese_title": "凯撒沙拉背后的故事",
    "chinese_summary": "凯撒沙拉，这道风靡全球的菜肴，起源于1924年墨西哥蒂华纳的恺撒餐厅（Restaurante Caesar's），该餐厅由意大利移民恺撒·卡迪尼所有。在繁忙的七月四日，卡迪尼因食材短缺，便在餐桌旁即兴创作了一道沙拉，使用了剩余的长叶莴苣、蒜香面包丁，以及一种基于生鸡蛋、凤尾鱼、大蒜、第戎芥末、柠檬、盐、胡椒和帕尔马干酪的酱汁。\n\n这款沙拉迅速走红，吸引了众多名人和美食爱好者。虽然恺撒·卡迪尼被认为是这道菜的创始人，但有些人认为凤尾鱼和第戎芥末的添加归功于他的兄弟亚历克斯·卡迪尼。也有人声称利维奥·桑蒂尼创造了最初的食谱。\n\n传统上，凯撒沙拉是在餐桌旁制作的，以展示新鲜的食材。沙拉师会逐一添加食材，先制作出浓郁的酱汁，然后再与长叶莴苣和面包丁混合，最后撒上帕尔马干酪。\n\n如今，许多餐厅都使用亚历克斯·卡迪尼添加了凤尾鱼、第戎芥末和柠檬的改良版本。尽管有各种变体，餐桌旁的制作方式在一些餐厅仍然是一种传统。本文重点介绍了您可以体验不同版本凯撒沙拉的几家餐厅，包括蒂华纳的恺撒餐厅、圣地亚哥的天堂点度假村及水疗中心、圣地亚哥的Lola 55 Tacos & Cocktails以及洛杉矶的Dan Tana's。"
  },
  {
    "id": "44462896",
    "title": "Writing a Game Boy Emulator in OCaml (2022)",
    "url": "https://linoscope.github.io/writing-a-game-boy-emulator-in-ocaml/",
    "summary": "This article details the author's experience creating CAMLBOY, a Game Boy emulator in OCaml. Faced with the challenge of applying advanced OCaml features to a practical project, they chose emulator development due to its well-defined specifications and manageable complexity.\n\nThe article covers the emulator's architecture, focusing on the CPU, bus, timer, and GPU, all operating in a synchronized manner using a \"catch-up\" method in the main loop. It highlights key interfaces for reading/writing 8-bit and 16-bit data, leveraging OCaml's signatures (module types) and inclusion to define and extend these interfaces.\n\nA significant portion discusses the implementation of the CPU and the initial design's testability issues due to tight coupling with other modules like the bus. The author addresses this by employing functors to abstract the bus implementation, allowing for mock implementations during unit testing.\n\nThe article also delves into representing the Game Boy instruction set in OCaml, initially using variants but encountering problems with type ambiguity in the `execute` function. It hints at the use of GADTs (Generalized Algebraic Data Types) as a solution to this problem. The author emphasizes writing readable and maintainable code, compiling to JavaScript using `js_of_ocaml`, achieving playable FPS on smartphones, and benchmarking compiler backends as key goals.\n",
    "chinese_title": "用 OCaml 编写 Game Boy 模拟器 (2022)",
    "chinese_summary": "本文详细介绍了作者使用 OCaml 创建 Game Boy 模拟器 CAMLBOY 的经验。面对将高级 OCaml 功能应用于实际项目的挑战，作者选择了模拟器开发，因为它具有明确的规范和可控的复杂性。\n\n文章涵盖了模拟器的架构，重点介绍了 CPU、总线、定时器和 GPU，所有这些模块都通过主循环中的“追赶”方法以同步方式运行。文章突出了用于读取/写入 8 位和 16 位数据的关键接口，利用 OCaml 的签名（模块类型）和包含来定义和扩展这些接口。\n\n文章的很大一部分讨论了 CPU 的实现以及初始设计由于与总线等其他模块的紧密耦合而产生的可测试性问题。作者通过使用函子来抽象总线实现来解决这个问题，从而允许在单元测试期间使用模拟实现。\n\n文章还深入探讨了用 OCaml 表示 Game Boy 指令集的方法，最初使用变体，但在 `execute` 函数中遇到类型歧义问题。文章暗示了使用 GADTs（广义代数数据类型）作为解决此问题的方法。作者强调编写可读和可维护的代码，使用 `js_of_ocaml` 编译为 JavaScript，在智能手机上实现可玩的 FPS，以及对编译器后端进行基准测试是关键目标。"
  },
  {
    "id": "44455196",
    "title": "Robots move Shanghai city block [video]",
    "url": "https://www.youtube.com/watch?v=7ZccC9BnT8k",
    "summary": "This \"article\" is more of a YouTube snippet than a traditional news article. Based on the title \"Robots move Shanghai city block [video],\" and the provided content, we can infer the following:\n\n*   **The main topic is robots moving a city block in Shanghai.** This implies a significant engineering feat, possibly involving the relocation of buildings or infrastructure.\n*   **The content is likely a video hosted on YouTube.** The presence of YouTube's standard footer information (copyright, contact, creators, ads, terms, privacy, safety, etc.) strongly suggests this.\n*   **There is no additional context or detail provided.** We lack information on *why* the robots are moving the block, *what* kind of robots are involved, *how* they are accomplishing the task, or *the purpose* of this operation.\n\nIn summary, the title promises a video showcasing robots moving a city block in Shanghai, but the actual provided content is just the YouTube footer, leaving the reader with no real understanding of the event beyond the basic premise.\n",
    "chinese_title": "机器人移动上海市街区 [视频]",
    "chinese_summary": "这“文章”更像是一个YouTube片段，而非传统新闻报道。根据标题“机器人移动上海街区[视频]”和提供的内容，我们可以推断如下：\n\n*   **主题是机器人在上海移动街区。** 这暗示着一项重大的工程壮举，可能涉及建筑物或基础设施的搬迁。\n*   **内容很可能是一个托管在YouTube上的视频。** YouTube的标准页脚信息（版权、联系方式、创作者、广告、条款、隐私、安全等）强烈暗示了这一点。\n*   **没有提供额外的背景或细节。** 我们缺乏关于机器人*为何*移动街区，*涉及哪些*机器人，*如何*完成任务，或这项行动的*目的*的信息。\n\n总之，标题承诺了一个展示机器人在上海移动街区的视频，但实际提供的内容只是YouTube页脚，让读者除了基本前提之外，对事件没有真正的了解。"
  },
  {
    "id": "44470464",
    "title": "The messy reality of SIMD (vector) functions",
    "url": "https://johnnysswlab.com/the-messy-reality-of-simd-vector-functions/",
    "summary": "This article delves into the complexities of SIMD (vector) functions in C/C++, exploring their potential benefits and practical limitations. SIMD functions process multiple data elements simultaneously, aiming to improve performance, particularly in loops.\n\nThe article explains how to declare and define vector functions using compiler-specific attributes (like GCC's `__attribute__((simd))`) or standardized OpenMP pragmas (`#pragma omp declare simd`). It highlights the importance of specifying parameter types (variable, uniform, linear) to guide the compiler's vectorization.  `inbranch` and `notinbranch` attributes are introduced to handle conditional execution within vectorized loops.\n\nHowever, the article emphasizes the \"messy reality\" of SIMD functions. Limited compiler support (GCC being better than Clang), restricted usability, and inefficient compiler-generated implementations often hinder their effectiveness. A common issue is the compiler simply replicating the scalar version N times instead of a true vector implementation.\n\nA significant portion of the article focuses on overriding the compiler-generated vector implementations with custom code using intrinsics. While there's no standard OMP way to do this, it's possible by understanding vector function name mangling (e.g., `_ZGV`) and linking your custom functions to the correct mangled names. The author provides details on how to interpret the mangled names to target specific ISAs (SSE, AVX, AVX2, AVX512) and vector lengths. The process involves declaring the function with `#pragma omp declare simd` and then defining it without the pragma, providing your own intrinsic-based implementation.\n",
    "chinese_title": "SIMD (向量) 函数的混乱现实",
    "chinese_summary": "本文深入探讨了C/C++中SIMD（向量）函数的复杂性，探索其潜在优势和实际局限。SIMD函数同时处理多个数据元素，旨在提高性能，尤其是在循环中。\n\n本文解释了如何使用编译器特定的属性（如GCC的`__attribute__((simd))`）或标准化的OpenMP编译指示（`#pragma omp declare simd`）来声明和定义向量函数。它强调了指定参数类型（variable、uniform、linear）以指导编译器向量化的重要性。引入了`inbranch`和`notinbranch`属性来处理向量化循环中的条件执行。\n\n然而，本文强调了SIMD函数的“混乱现实”。有限的编译器支持（GCC比Clang更好）、受限的可用性以及编译器生成的效率低下的实现常常阻碍其有效性。一个常见的问题是编译器只是将标量版本复制N次，而不是真正的向量实现。\n\n本文的很大一部分侧重于使用内部函数覆盖编译器生成的向量实现。虽然没有标准的OMP方法来实现这一点，但可以通过理解向量函数名称修饰（例如，`_ZGV`）并将您的自定义函数链接到正确的修饰名称来实现。作者提供了有关如何解释修饰名称以定位特定ISA（SSE、AVX、AVX2、AVX512）和向量长度的详细信息。该过程涉及使用`#pragma omp declare simd`声明函数，然后不使用pragma定义它，并提供您自己的基于内部函数的实现。"
  },
  {
    "id": "44471576",
    "title": "Go, PET, Let Hen - Curious adventures in (Commodore) BASIC tokenizing",
    "url": "https://www.masswerk.at/nowgobang/2025/go-pet-let-hen",
    "summary": "This article delves into a curious behavior in early Commodore BASIC (specifically BASIC 1.0 on the PET 2001) related to how the tokenizer routine handles whitespace, leading to unexpected syntax errors. It explores why a seemingly valid BASIC statement like `10 IF LS = LE THEN GOTO 100` throws an error.\n\nThe core issue arises from BASIC's deliberate disregard for whitespace, allowing constructs like `GO TO`. The tokenizer, responsible for converting keywords into tokens (integer representations), aggressively skips whitespace, leading to scenarios where adjacent letters are inadvertently recognized as keywords. In the example, \"LE THEN\" is misinterpreted as \"LET HEN,\" which isn't valid syntax.\n\nThe article explains the purpose of tokenizing – to save memory and speed up execution by replacing keywords with single-byte tokens. It demonstrates how BASIC programs are stored in memory, showing the tokenization process in action.\n\nIt further elaborates on how Commodore BASIC, like other early BASIC implementations, handles whitespace and numbers, highlighting the deliberate design choices that prioritize user-friendliness over strict parsing. The article showcases how BASIC preserves the user's input formatting for readability in listings, except in cases where it conflicts with keyword recognition.\n\nThe article reveals the keyword table and the `CRUNCH` routine in the PET BASIC ROM. Ultimately, the article concludes that the syntax error is a consequence of the \"feature\" of skipping blanks, where the interpreter incorrectly identified \"LET\" across the word boundary, and is not present in later versions of Commodore BASIC.\n",
    "chinese_title": "去吧，PET，让母鸡下蛋 - (Commodore) BASIC 符号化的奇妙冒险",
    "chinese_summary": "本文深入探讨了早期Commodore BASIC (特指PET 2001上的BASIC 1.0) 中一种奇特的行为，该行为与分词器例程处理空白的方式有关，会导致意外的语法错误。它探讨了为什么像 `10 IF LS = LE THEN GOTO 100` 这样看似有效的BASIC语句会抛出错误。\n\n核心问题源于BASIC有意忽略空白，允许像 `GO TO` 这样的结构存在。 负责将关键字转换为令牌（整数表示）的分词器会积极跳过空格，导致相邻字母被无意中识别为关键字的情况。 在示例中，“LE THEN”被错误地解释为“LET HEN”，这不是有效的语法。\n\n文章解释了令牌化的目的——通过用单字节令牌替换关键字来节省内存并加快执行速度。 它演示了BASIC程序如何在内存中存储，并展示了令牌化过程的实际应用。\n\n文章进一步阐述了Commodore BASIC（如其他早期BASIC实现）如何处理空格和数字，突出了优先考虑用户友好性而不是严格解析的有意设计选择。 文章展示了BASIC如何保留用户输入的格式，以便在列表中实现可读性，除非它与关键字识别冲突。\n\n文章揭示了PET BASIC ROM中的关键字表和 `CRUNCH` 例程。最终，文章得出结论，语法错误是跳过空格这一“特性”的后果，其中解释器错误地跨单词边界识别了“LET”，并且在更高版本的Commodore BASIC中不存在。"
  },
  {
    "id": "44464396",
    "title": "Bcachefs may be headed out of the kernel",
    "url": "https://lwn.net/Articles/1027289/",
    "summary": "This LWN.net article from June 27, 2025, discusses the potential removal of the Bcachefs filesystem from the Linux kernel. The core issue stems from disagreements between Bcachefs developer Kent Overstreet and Linus Torvalds regarding the handling of bug fixes and pull requests. Torvalds expresses discomfort with what he perceives as Overstreet's insistence on unquestioned acceptance of his changes.\n\nSeveral commenters discuss the implications of Bcachefs being maintained outside the kernel. Concerns include the potential for kernel developers to introduce changes that break Bcachefs compatibility, and the difficulty Overstreet might face in pushing fixes or refactors external to the Bcachefs codebase.\n\nA recurring theme is Overstreet's communication style and perceived unwillingness to compromise, with some commenters suggesting that his approach contributed to the conflict with Torvalds. Others defend Overstreet, emphasizing the importance of prioritizing data integrity.\n\nOverstreet himself acknowledges the challenges but emphasizes his responsibility for ensuring a working filesystem for Bcachefs users, and raises concerns about data integrity not being prioritized. He also suggests that if the kernel development process is too inflexible to accommodate a modern filesystem, alternative distribution methods like DKMS modules may be necessary. There is also discussion about exploring user-space recovery options to make the process more forgiving and debug friendly.\n",
    "chinese_title": "Bcachefs或将脱离内核",
    "chinese_summary": "2025年6月27日 LWN.net文章讨论了将Bcachefs文件系统从Linux内核中移除的可能性。核心问题源于Bcachefs开发者Kent Overstreet和Linus Torvalds之间关于bug修复和pull请求处理的分歧。Torvalds表达了对他所认为的Overstreet坚持无条件接受其更改的不安。\n\n一些评论员讨论了Bcachefs在内核之外维护的含义。担忧包括内核开发者可能会引入破坏Bcachefs兼容性的更改，以及Overstreet在推动Bcachefs代码库之外的修复或重构时可能面临的困难。\n\n一个反复出现的主题是Overstreet的沟通方式和被认为的不愿妥协，一些评论员认为他的做法导致了与Torvalds的冲突。另一些人则为Overstreet辩护，强调优先考虑数据完整性的重要性。\n\nOverstreet本人承认了这些挑战，但强调了他有责任确保Bcachefs用户的文件系统正常工作，并提出了关于数据完整性未被优先考虑的担忧。他还认为，如果内核开发过程过于僵化而无法容纳现代文件系统，那么可能需要像DKMS模块这样的替代分发方法。此外，还有关于探索用户空间恢复选项的讨论，以使过程更加宽容和便于调试。"
  },
  {
    "id": "44464641",
    "title": "Kepler.gl",
    "url": "https://kepler.gl/",
    "summary": "The article \"Kepler.gl\" simply states \"kepler.gl\". This suggests that the article is likely about **Kepler.gl**, a powerful open-source geospatial analysis tool developed by Uber (now maintained by the community).\n\nBased solely on the title and content, here's the summary:\n\nThe article's focus is on **Kepler.gl**, a tool whose name is explicitly stated. Although the article provides no further information, we can infer that it likely provides information about, discusses, or serves as a landing page for Kepler.gl.  Users interested in geospatial analysis, visualization, and exploration of large-scale datasets can use the tool. It allows users to create interactive maps and extract insights from location data. Without more context, it's impossible to know what specific aspect of Kepler.gl the article highlights.\n",
    "chinese_title": "Kepler.gl",
    "chinese_summary": "文章“Kepler.gl”仅声明“kepler.gl”。这表明该文章很可能关于 **Kepler.gl**，一款由 Uber 开发（现由社区维护）的强大的开源地理空间分析工具。\n\n仅根据标题和内容，总结如下：\n\n文章的重点是 **Kepler.gl**，一个名称被明确声明的工具。尽管文章没有提供更多信息，我们可以推断它可能提供关于 Kepler.gl 的信息、讨论 Kepler.gl 或作为 Kepler.gl 的着陆页。对地理空间分析、可视化和大规模数据集探索感兴趣的用户可以使用该工具。它允许用户创建交互式地图并从位置数据中提取见解。在没有更多上下文的情况下，不可能知道文章突出了 Kepler.gl 的哪个特定方面。"
  },
  {
    "id": "44433159",
    "title": "We're all CTO now",
    "url": "https://jamie.ideasasylum.com/2025/07/01/you%27re-all-cto-now",
    "summary": "This article explores the shift in the software development landscape due to the rise of AI-coding agents, arguing that developers are increasingly becoming managers of AI rather than solely coders. The author, a former developer turned CTO, draws parallels between his own experience of moving away from direct coding and the likely future of many developers.\n\nThe initial excitement of increased productivity and automated drudgery will likely be followed by a decrease in dopamine satisfaction. The deep sense of accomplishment derived from overcoming challenging coding problems may be replaced by the less intrinsically rewarding tasks of managing and prompting AI.\n\nThe author challenges the notion that a developer's sole purpose is to solve user problems, asserting that the core function remains writing and fixing software. The shift towards managing AI could lead to dissatisfaction and potentially change the types of individuals attracted to and retained by the tech industry, especially those who thrive on intense focus and flow.\n\nWhile acknowledging the potential for specialized \"parajumper\" roles to fix complex AI-generated code, the author warns that these tasks could be particularly difficult due to the lack of familiarity with the codebase and the atrophy of traditional coding skills. Ultimately, the article prompts developers to consider the long-term implications of this shift and its potential impact on their job satisfaction and career trajectories, concluding with a somewhat wry \"Welcome to your new role. I hope you'll be happy here.\"\n",
    "chinese_title": "我们现在都是首席技术官了",
    "chinese_summary": "人工智能编码代理兴起导致软件开发格局转变：开发者或将更多地成为人工智能管理者，而非纯粹的编码人员。作者是一位前开发者，现任首席技术官，他将自己从直接编码转型到管理者的经历与许多开发者的未来进行了类比。\n\n最初，生产力提高和自动化繁琐工作的兴奋感之后，很可能会伴随着多巴胺满足感的降低。克服具有挑战性的编码问题所获得的深刻成就感可能会被管理和提示人工智能等内在回报较低的任务所取代。\n\n作者挑战了开发者的唯一目的是解决用户问题的观念，并断言其核心功能仍然是编写和修复软件。向管理人工智能的转变可能导致不满，并可能改变吸引和留住科技行业的人员类型，尤其是那些在高度专注和心流状态中茁壮成长的人。\n\n虽然作者承认可能存在专门的“伞兵”角色来修复复杂的人工智能生成的代码，但他警告说，由于对代码库缺乏熟悉以及传统编码技能的萎缩，这些任务可能特别困难。最终，文章促使开发者考虑这种转变的长期影响及其对工作满意度和职业发展轨迹的潜在影响，并以略带讽刺意味的“欢迎来到你的新岗位。希望你在这里过得愉快”作为结尾。"
  },
  {
    "id": "44468999",
    "title": "The ITTAGE indirect branch predictor",
    "url": "https://blog.nelhage.com/post/ittage-branch-predictor/",
    "summary": "This article explores the TAGE and ITTAGE branch predictors, focusing on their ability to accurately predict branch behavior, even within bytecode interpreter loops. The author, inspired by Sam Gross's comment on Python's tail-calling interpreter, delves into how these predictors work.\n\nTAGE and ITTAGE predict branch behavior by mapping program counter (PC) and PC history to past behavior, using multiple tables with geometrically increasing history lengths. They dynamically choose the appropriate table for each branch, favoring longer histories on errors.\n\nThe core idea is to track historical data and predict based on past events. Simple predictors use the branch address and a single bit or a small counter for history. However, more sophisticated predictors use a circular buffer to store recent branch history (PC history) for better accuracy.\n\nTAGE keeps track of extensive branch history using multiple tables. Each table entry stores a tag, along with a counter, to indicate the key being stored. The predictor uses hash functions to index and check entries, selecting the entry with the longest matching history for prediction. On prediction errors, it attempts to allocate a new entry in a table with a longer history. A \"useful\" counter tracks the effectiveness of each entry, favoring retention of useful entries. ITTAGE is similar, but predicts the target address of indirect branches, with a confidence counter replacing the simple taken/not-taken counter of TAGE.\n",
    "chinese_title": "ITTAGE间接分支预测器",
    "chinese_summary": "本文探讨了TAGE和ITTAGE分支预测器，重点在于它们精确预测分支行为的能力，即使是在字节码解释器循环中。作者受到Sam Gross关于Python尾调用解释器的评论的启发，深入研究了这些预测器的工作原理。\n\nTAGE和ITTAGE通过将程序计数器（PC）和PC历史映射到过去的执行行为来预测分支行为，并使用具有几何递增历史长度的多个表。 它们动态地为每个分支选择合适的表，并在发生错误时倾向于更长的历史记录。\n\n核心思想是跟踪历史数据并基于过去的事件进行预测。 简单的预测器使用分支地址和单一位或一个小的计数器来记录历史。 然而，更复杂的预测器使用循环缓冲区来存储最近的分支历史（PC历史），以获得更高的准确性。\n\nTAGE使用多个表来跟踪广泛的分支历史。 每个表条目存储一个标签以及一个计数器，以指示正在存储的键。 预测器使用哈希函数来索引和检查条目，选择具有最长匹配历史的条目进行预测。 在预测错误时，它会尝试在具有更长历史记录的表中分配一个新条目。 一个“有用”计数器跟踪每个条目的有效性，并倾向于保留有用的条目。 ITTAGE类似，但预测间接分支的目标地址，其中置信度计数器取代了TAGE简单的taken/not-taken计数器。"
  },
  {
    "id": "44465206",
    "title": "Compression Dictionary Transport",
    "url": "https://developer.mozilla.org/en-US/docs/Web/HTTP/Guides/Compression_dictionary_transport",
    "summary": "Compression Dictionary Transport is an experimental HTTP optimization technique that uses shared compression dictionaries to significantly reduce the size of HTTP responses. Unlike standard compression algorithms that find redundancy within a single resource, Compression Dictionary Transport leverages dictionaries of frequently encountered strings across multiple resources.\n\nThe key benefit is a substantial reduction in bandwidth usage and page load times, especially when serving similar versions of resources like JavaScript libraries. Instead of transmitting the entire updated resource, only the delta (differences) between versions needs to be sent, referencing the common parts in the dictionary.\n\nDictionaries can be existing resources (e.g., a previous library version) or separate files containing common strings. To use a resource as a dictionary, the server includes a `Use-As-Dictionary` header in the response. Subsequent requests for matching resources include an `Available-Dictionary` header containing the dictionary's SHA-256 hash, and the `Accept-Encoding` header includes `dcb` (Brotli) or `dcz` (Zstandard) to indicate support for dictionary compression. The server then responds with dictionary-compressed content (indicated by `Content-Encoding: dcb` or `Content-Encoding: dcz`) and the appropriate `Vary` header.  Alternatively, a `<link rel=\"compression-dictionary\">` tag or a `Link` header can be used to instruct the browser to download a separate dictionary file.\n\nSecurity restrictions include same-origin requirements for dictionaries and dictionary-compressed resources, along with CORS rules. Browsers may also restrict the feature for privacy reasons.\n",
    "chinese_title": "压缩字典传输",
    "chinese_summary": "压缩字典传输是一种实验性的HTTP优化技术，它使用共享的压缩字典来显著减小HTTP响应的大小。与在单个资源中寻找冗余的标准压缩算法不同，压缩字典传输利用包含多个资源中频繁出现的字符串的字典。\n\n其主要优势在于显著减少带宽使用和页面加载时间，尤其是在提供类似版本的资源（如JavaScript库）时。无需传输整个更新后的资源，只需发送版本之间的增量（差异），并引用字典中的公共部分。\n\n字典可以是现有资源（例如，之前的库版本）或包含常用字符串的单独文件。要将资源用作字典，服务器会在响应中包含一个`Use-As-Dictionary`标头。后续对匹配资源的请求包含一个`Available-Dictionary`标头，其中包含字典的SHA-256哈希值，并且`Accept-Encoding`标头包含`dcb` (Brotli) 或 `dcz` (Zstandard) 来指示支持字典压缩。然后，服务器会响应字典压缩的内容（由`Content-Encoding: dcb` 或 `Content-Encoding: dcz` 指示）和相应的`Vary`标头。或者，可以使用 `<link rel=\"compression-dictionary\">` 标签或 `Link` 标头来指示浏览器下载单独的字典文件。\n\n安全限制包括字典和字典压缩资源的同源要求，以及CORS规则。出于隐私原因，浏览器也可能会限制此功能。"
  },
  {
    "id": "44467279",
    "title": "Show HN: AirBending – Hand gesture based macOS app MIDI controller",
    "url": "https://www.nanassound.com/products/software/airbending",
    "summary": "AirBending is a macOS application that turns your hand gestures into MIDI control signals using your Mac's built-in camera. It allows users to control DAWs like Logic Pro, Ableton Live, and hardware synthesizers without the need for special drivers or plugins.\n\nKey features include:\n\n*   **Gesture-based MIDI Control:** Translates hand movements into MIDI signals in real-time.\n*   **Universal MIDI Compatibility:** Works with any DAW and external hardware via standard MIDI.\n*   **Advanced Preset Manager:** Customizable gesture mappings for one or two hands controlling X/Y axes.\n*   **MIDI Channel Control:** Assigns specific MIDI channels for controlling multiple instruments simultaneously.\n*   **Musical Scale Selection:** Locks pitch control to specific scales and keys for in-tune performance.\n*   **Custom CC Assignment:** Maps hand movements to any Control Change (CC) number for precise parameter control.\n\nAirBending is suitable for live performances, studio recordings, music education, interactive installations, and musicians seeking novel expressive methods. It offers a way to break free from traditional MIDI controllers.\n",
    "chinese_title": "Show HN: AirBending – 基于手势的 macOS 应用 MIDI 控制器",
    "chinese_summary": "AirBending是一款macOS应用程序，它利用Mac的内置摄像头将你的手势转换为MIDI控制信号。它允许用户控制Logic Pro、Ableton Live等DAW以及硬件合成器，而无需特殊的驱动程序或插件。\n\n主要功能包括：\n\n*   **基于手势的MIDI控制：** 将手部动作实时转换为MIDI信号。\n*   **通用MIDI兼容性：** 通过标准MIDI与任何DAW和外部硬件协同工作。\n*   **高级预设管理器：** 可自定义手势映射，单手或双手控制X/Y轴。\n*   **MIDI通道控制：** 为同时控制多个乐器分配特定的MIDI通道。\n*   **音阶选择：** 将音高控制锁定到特定的音阶和调性，以实现音准演奏。\n*   **自定义CC分配：** 将手部动作映射到任何控制改变 (CC) 编号，以实现精确的参数控制。\n\nAirBending适用于现场表演、录音棚录音、音乐教育、互动装置以及寻求新型表现方式的音乐家。它提供了一种摆脱传统MIDI控制器的途径。"
  },
  {
    "id": "44457612",
    "title": "Impact of PCIe 5.0 Bandwidth on GPU Content Creation and LLM Performance",
    "url": "https://www.pugetsystems.com/labs/articles/impact-of-pcie-5-0-bandwidth-on-gpu-content-creation-performance/",
    "summary": "This article investigates the impact of PCIe 5.0 bandwidth on GPU performance in content creation applications and Large Language Model (LLM) performance. With the arrival of new GPUs supporting PCIe 5.0, the study examines performance differences across various PCIe versions (5.0, 4.0, 3.0) and lane configurations (x16, x8, x4). It highlights that consumer motherboards often lack sufficient PCIe lanes for multiple add-in cards at full bandwidth, forcing some cards to operate at reduced speeds.\n\nThe testing methodology involves a high-end Intel Core Ultra 9 285k system with an RTX 5090 GPU, using a ProArt Z890 motherboard to control PCIe lane configurations. Benchmarks include After Effects, DaVinci Resolve, Unreal Engine, Blender, V-Ray, OctaneBench, and Llama.cpp, covering diverse workflows.\n\nThe raw results tables provide detailed scores for each benchmark across different PCIe configurations. The article emphasizes the importance of considering specific workflow needs when analyzing the data, as performance variations depend on the application and task. Key performance metrics include overall scores, sub-scores for specific application features (e.g., 2D, 3D in After Effects; LongGOP, Intraframe in DaVinci Resolve), and FPS in Unreal Engine. The impact on LLM performance is also examined, focusing on prompt processing and token generation speeds.\n",
    "chinese_title": "PCIe 5.0带宽对GPU内容创作和LLM性能的影响",
    "chinese_summary": "本文研究了PCIe 5.0带宽对GPU在内容创作应用和大型语言模型（LLM）性能的影响。随着支持PCIe 5.0的新型GPU的出现，该研究考察了不同PCIe版本（5.0、4.0、3.0）和通道配置（x16、x8、x4）下的性能差异。它强调消费者主板通常缺乏足够的PCIe通道以支持多个附加卡全带宽运行，导致某些卡以降低的速度运行。\n\n测试方法采用高端英特尔酷睿Ultra 9 285k系统，配备RTX 5090 GPU，并使用ProArt Z890主板控制PCIe通道配置。基准测试包括After Effects、达芬奇Resolve、虚幻引擎、Blender、V-Ray、OctaneBench和Llama.cpp，涵盖多样化的工作流程。\n\n原始结果表格提供了每个基准测试在不同PCIe配置下的详细分数。文章强调，在分析数据时，必须考虑特定工作流程的需求，因为性能变化取决于应用和任务。关键性能指标包括总分、特定应用功能（例如After Effects中的2D、3D；达芬奇Resolve中的LongGOP、帧内）的子分数以及虚幻引擎中的FPS。此外，还研究了对LLM性能的影响，重点关注提示处理和令牌生成速度。"
  },
  {
    "id": "44471832",
    "title": "What I learned building an AI coding agent for a year",
    "url": "https://jamesgrugett.com/p/what-i-learned-building-an-ai-coding",
    "summary": "James, the author, reflects on a year spent building Codebuff, an AI coding agent. He details their initial successes, including focusing on a CLI-first approach, injecting context, foregoing permission checks, offering a premium tool, and introducing \"knowledge.md\" files. Many of these ideas are now standard in the field.\n\nHowever, Codebuff didn't achieve the expected exponential growth due to reliability issues with their file editing strategy, leading to a long tail of failing tasks and hindering retention.\n\nJames outlines key lessons learned: implement end-to-end evaluations for regular feedback, ruthlessly cut non-core features, involve the entire team in core product improvement, constantly think about future disruptions, and conduct monthly retrospectives.\n\nCurrently, the team is excited about their new multi-agent framework, which allows agents to spawn other agents with different roles and has already improved their evaluation scores.\n\nJames predicts that the multi-agent paradigm will dominate, \"live learning\" will become standard, coding agents will become proactive in suggesting tasks, they'll close the loop by autonomously performing QA and committing changes, recursively improving agents will emerge, and xAI will gain a significant lead. Ultimately, the network of agents will be more important than the underlying model. He concludes with an invitation to join his team in building the best coding agent.\n",
    "chinese_title": "我打造AI编程助手一年的心得",
    "chinese_summary": "作者 James 回顾了他花费一年时间构建 AI 编码助手 Codebuff 的经历。他详细描述了最初的成功，包括专注于 CLI 优先的方法、注入上下文、放弃权限检查、提供高级工具以及引入“knowledge.md”文件。这些想法现在已成为该领域的标准。\n\n然而，由于文件编辑策略的可靠性问题，导致大量失败任务和阻碍用户留存，Codebuff 并未实现预期的指数级增长。\n\nJames 概述了重要的经验教训：实施端到端评估以获得定期反馈、无情地削减非核心功能、让整个团队参与核心产品改进、不断思考未来的颠覆，并进行每月回顾。\n\n目前，团队对他们新的多代理框架感到兴奋，该框架允许代理生成具有不同角色的其他代理，并且已经提高了他们的评估分数。\n\nJames 预测多代理范式将占据主导地位，“实时学习”将成为标准，编码代理将主动建议任务，他们将通过自主执行 QA 和提交更改来闭环，递归改进的代理将出现，并且 xAI 将获得显著领先优势。最终，代理网络将比底层模型更重要。他最后邀请大家加入他的团队，共同构建最佳编码助手。"
  },
  {
    "id": "44467539",
    "title": "Open Source and FPGA Maker Board for Networking",
    "url": "https://privateisland.tech/betsy",
    "summary": "Private Island Networks Inc. is offering sponsorships for university (and potentially high school) projects in the 2025/2026 academic year centered around their open-source networking stack and the Betsy™ maker board. The project aims to foster innovation in network security, privacy, and machine learning using FPGAs.\n\nThe Betsy Maker board utilizes an Altera Cyclone 10 LP FPGA and the Private Island open source Verilog stack to create an open, extensible system for packet processing at Gigabit Ethernet speeds. Key functionalities include packet filtering, mirroring, data collection, and multi-port switching. This approach contrasts with closed-source SoC implementations by providing full transparency and control.\n\nThe company believes this project is ideal for student projects, offering a foundation for custom networking solutions. The first revision of the Betsy board is available in limited quantities, with a production model expected in early 2026.\n\nThe document lists potential research projects including neural networks for anomaly detection, cloud-based machine learning using FPGA-collected metadata, daughter board design, network visualization, threat modeling, secure communication channels, voice encryption daughter board, and identifying/thwarting undesirable network activity. They also emphasize the need for basic contributions like testing, documentation, and library integration. Relevant project documentation is available, covering the project overview, architecture, and Ethernet packet processing. Interested parties are encouraged to apply for sponsorship via a form or email, requiring the support of a professor or teacher.\n",
    "chinese_title": "面向网络应用的开源FPGA开发板",
    "chinese_summary": "Private Island Networks Inc. 正在为2025/2026学年大学（以及可能的高中）项目提供赞助，项目围绕他们的开源网络堆栈和Betsy™创客板展开。该项目旨在利用FPGA促进网络安全、隐私和机器学习方面的创新。\n\nBetsy创客板采用Altera Cyclone 10 LP FPGA和Private Island开源Verilog堆栈，创建一个开放、可扩展的系统，用于以千兆以太网速度进行数据包处理。主要功能包括数据包过滤、镜像、数据收集和多端口交换。这种方法通过提供完全的透明度和控制，与闭源SoC实现形成对比。\n\n该公司认为该项目非常适合学生项目，为定制网络解决方案提供基础。第一版Betsy板的数量有限，预计生产模型将于2026年初推出。\n\n该文档列出了潜在的研究项目，包括用于异常检测的神经网络、使用FPGA收集的元数据的云端机器学习、子板设计、网络可视化、威胁建模、安全通信通道、语音加密子板以及识别/阻止不良网络活动。他们还强调了测试、文档和库集成等基本贡献的需求。提供了相关的项目文档，涵盖项目概述、架构和以太网数据包处理。 鼓励有兴趣的各方通过表格或电子邮件申请赞助，并需要教授或教师的支持。"
  },
  {
    "id": "44466888",
    "title": "Sleeping beauty Bitcoin wallets wake up after 14 years to the tune of $2B",
    "url": "https://www.marketwatch.com/story/sleeping-beauty-bitcoin-wallets-wake-up-after-14-years-to-the-tune-of-2-billion-79f1f11f",
    "summary": "Here's a summary of the MarketWatch article about Bitcoin wallets waking up after 14 years:\n\nThe article discusses the phenomenon of \"sleeping beauty\" Bitcoin wallets that have been dormant for over a decade suddenly becoming active. These wallets, containing early-mined Bitcoin, hold significant value due to Bitcoin's exponential price increase over the years. Recently, wallets containing Bitcoin mined in 2010, the cryptocurrency's early days, have been moved, triggering speculation and excitement within the crypto community.\n\nThe total value moved from these wallets amounts to roughly $2 billion. The reason behind this renewed activity remains uncertain. Possibilities range from early adopters finally deciding to cash out their substantial holdings, lost keys being recovered (though unlikely after such a long period), estate settlements, or even law enforcement activity.\n\nThese movements can impact the Bitcoin market, although the actual effect is debatable. While the selling of such large amounts of Bitcoin could theoretically exert downward price pressure, the market has matured significantly since 2010 and can likely absorb the sales without major disruption. Some experts believe these movements are simply a sign of the Bitcoin market's evolution and the increasing liquidity available. The news highlights the long-term investment potential of Bitcoin and the stories of individuals who believed in the cryptocurrency during its infancy.\n",
    "chinese_title": "沉睡的美人比特币钱包在14年后醒来，价值20亿美元。",
    "chinese_summary": "以下是MarketWatch关于比特币钱包沉睡14年后被激活的文章摘要：\n\n该文章讨论了“睡美人”比特币钱包的现象，这些钱包已经休眠了十多年，却突然变得活跃起来。这些钱包包含早期挖出的比特币，由于比特币多年来的指数级价格上涨，它们具有巨大的价值。最近，包含2010年，即加密货币早期，挖出的比特币的钱包被转移，引发了加密社区内的猜测和兴奋。\n\n从这些钱包转移的总价值约为20亿美元。这种重新活跃的原因仍然不确定。可能性包括早期采用者最终决定兑现他们的巨额持有量，丢失的密钥被找回（尽管经过这么长时间不太可能），遗产结算，甚至执法活动。\n\n这些举动可能会影响比特币市场，尽管实际影响尚有争议。虽然出售如此大量的比特币理论上可能会产生向下的价格压力，但自2010年以来，市场已经成熟了很多，并且很可能在没有重大中断的情况下吸收这些销售。一些专家认为，这些举动仅仅是比特币市场发展和可用流动性增加的迹象。该新闻突出了比特币的长期投资潜力以及那些在加密货币初期就相信它的人的故事。"
  },
  {
    "id": "44433062",
    "title": "Lens: Lenses, Folds and Traversals",
    "url": "https://hackage.haskell.org/package/lens",
    "summary": "The \"lens\" package in Haskell provides a comprehensive set of tools for working with lenses, folds, traversals, getters, setters, and isomorphisms. These combinators offer a generic way to access and manipulate parts of data structures, enabling easier code composition and data transformation.\n\nThe package comes \"Batteries Included\" with many useful lenses for the types commonly used from the Haskell Platform, and with tools for automatically generating lenses and isomorphisms for user-supplied data types.\n\nKey features include the ability to read and write to lenses, compose them using standard function composition, derive lenses automatically for data type fields using `makeLenses` and `makePrisms`, and use lenses as setters with functions like `over`. The `mapped` setter is particularly useful for applying functions over containers.\n\nThe package offers equivalents to C/C++'s `+=` and `*=`, along with `+~` and `*~` for functional modification. It supports working with state monads, foldable containers, traversable data, and includes combinators for generic programming based on Uniplate. Isomorphisms allow using lenses in reverse via `from`.\n\nThe package is dependency-free, as simple lenses and traversals can be constructed using only the Prelude and Control.Applicative.Applicative.\n\nLinks to tutorial videos, a FAQ, a Wiki, and example games are provided for learning resources.\n",
    "chinese_title": "镜头：透镜、折叠与遍历",
    "chinese_summary": "Haskell中的\"lens\"包提供了一套全面的工具，用于处理lens、fold、traversal、getter、setter和同构。这些组合器提供了一种通用的方式来访问和操作数据结构的各个部分，从而更容易地实现代码组合和数据转换。\n\n该软件包“开箱即用”，包含许多用于Haskell平台常用类型的实用lens，以及用于自动生成用户提供的数据类型的lens和同构的工具。\n\n主要功能包括读取和写入lens，使用标准函数组合进行组合，使用`makeLenses`和`makePrisms`为数据类型字段自动派生lens，以及使用lens作为setter与`over`等函数一起使用。`mapped` setter对于在容器上应用函数特别有用。\n\n该软件包提供了相当于C/C++的`+=`和`*=`的功能，以及用于函数式修改的`+~`和`*~`。它支持使用状态monad、可折叠容器、可遍历数据，并包含基于Uniplate的泛型编程组合器。同构允许通过`from`反向使用lens。\n\n该软件包没有依赖项，因为简单的lens和traversal只需使用Prelude和Control.Applicative.Applicative即可构建。\n\n提供了教程视频、FAQ、Wiki和示例游戏的链接，作为学习资源。"
  },
  {
    "id": "44465980",
    "title": "Gremllm",
    "url": "https://github.com/awwaiid/gremllm",
    "summary": "Gremllm is a Python utility class that leverages LLMs (Language Learning Models) to dynamically implement methods and properties on-the-fly. Instead of pre-defined code, Gremllm uses an LLM to generate code in response to method calls and attribute access, allowing for flexible and unpredictable behavior.\n\nInstallation is straightforward using `pip install gremllm`. It supports multiple LLM providers including OpenAI, Claude, Gemini, and local models via the `llm` library. Users can configure their preferred LLM using `llm keys set`.\n\nKey features include dynamic behavior, \"Wet Mode\" for infinite method chaining where method calls return Gremllm objects, \"Verbose Mode\" to view the LLM-generated code, multi-model support, inheritance of wet and verbose settings, and smart error handling for graceful fallbacks.\n\nExamples provided demonstrate Gremllm's use as a basic counter and a shopping cart. Wet Mode is showcased with a swimming pool simulator, highlighting its ability to create emergent behavior through chained interactions. Verbose Mode is useful for debugging and understanding the LLM's code generation process.\n\nThe documentation emphasizes the experimental nature of Gremllm and playfully warns against its widespread adoption while simultaneously expressing excitement about its functionality.\n",
    "chinese_title": "Gremllm\n格雷姆LLM",
    "chinese_summary": "Gremllm是一个Python实用工具类，它利用LLM（语言学习模型）来动态地即时实现方法和属性。Gremllm不使用预定义的代码，而是使用LLM来生成代码以响应方法调用和属性访问，从而实现灵活且不可预测的行为。\n\n可以使用 `pip install gremllm` 轻松安装它。 它支持多个LLM提供商，包括 OpenAI、Claude、Gemini 以及通过 `llm` 库支持的本地模型。 用户可以使用 `llm keys set` 配置其首选的LLM。\n\n主要功能包括动态行为、用于无限方法链的“湿模式”（其中方法调用返回Gremllm对象）、用于查看LLM生成的代码的“详细模式”、多模型支持、湿模式和详细模式设置的继承以及用于优雅回退的智能错误处理。\n\n提供的示例演示了Gremllm作为基本计数器和购物车的用法。“湿模式”通过游泳池模拟器展示，突出了它通过链式交互创建涌现行为的能力。“详细模式”可用于调试和理解LLM的代码生成过程。\n\n该文档强调了Gremllm的实验性质，并开玩笑地警告不要广泛采用它，同时表达了对其功能的兴奋之情。"
  },
  {
    "id": "44469880",
    "title": "How to Use JSONPath to Query and Extract JSON Data Efficiently",
    "url": "https://www.postpilot.dev/blog/how-to-use-jsonpath-to-query-and-extract-json",
    "summary": "This article introduces JSONPath, a query language for efficiently extracting data from JSON structures, analogous to XPath for XML. It avoids manual looping and provides a concise, readable way to navigate and filter JSON data.\n\nThe article covers JSONPath syntax, including root selection (`$`), child access (`.`), wildcards (`*`), recursive descent (`..`), array indexing (`[n]`), slicing (`[start:end:step]`), unions (`[i,j,...]`), and filters (`?(<filter>)`). It also explains the use of functions like `length()`, `count()`, `match()`, `search()`, and `value()` within queries.\n\nPractical use cases are illustrated with examples, such as fetching book titles, filtering by price, and using regex matching. The article also details more advanced filtering based on length, substring search, and node counting.\n\nLanguage support and tools are discussed, including JSONPath libraries for JavaScript (jsonpath), Java (com.jayway.jsonpath), C#/.NET (Json.NET, JsonPath.Net), Python (jsonpath-ng, jsonpath-python), PHP (Flow JSONPath), Ruby (jsonpath) and Go (GJson). PostPilot.dev is recommended as a UI tool for interactively testing JSONPath expressions locally in the browser.\n\nThe benefits of using JSONPath include increased clarity, powerful filtering capabilities, portability across languages, faster data extraction, and easier exploration of JSON data. Mastering JSONPath enables developers to create concise, powerful, and flexible queries for various JSON processing tasks.\n",
    "chinese_title": "如何高效地使用JSONPath查询和提取JSON数据",
    "chinese_summary": "本文介绍了 JSONPath，一种用于从 JSON 结构中高效提取数据的查询语言，类似于 XML 的 XPath。它避免了手动循环，并提供了一种简洁、可读的方式来导航和过滤 JSON 数据。\n\n本文涵盖了 JSONPath 语法，包括根选择（`$`）、子访问（`.`）、通配符（`*`）、递归下降（`..`）、数组索引（`[n]`）、切片（`[start:end:step]`）、联合（`[i,j,...]`）和过滤器（`?(<filter>)`）。它还解释了在查询中使用 `length()`、`count()`、`match()`、`search()` 和 `value()` 等函数。\n\n通过示例说明了实际用例，例如获取书名、按价格过滤以及使用正则表达式匹配。本文还详细介绍了基于长度、子字符串搜索和节点计数的更高级过滤。\n\n讨论了语言支持和工具，包括 JavaScript (jsonpath)、Java (com.jayway.jsonpath)、C#/.NET (Json.NET, JsonPath.Net)、Python (jsonpath-ng, jsonpath-python)、PHP (Flow JSONPath)、Ruby (jsonpath) 和 Go (GJson) 的 JSONPath 库。建议使用 PostPilot.dev 作为 UI 工具，用于在浏览器中以交互方式本地测试 JSONPath 表达式。\n\n使用 JSONPath 的好处包括提高清晰度、强大的过滤功能、跨语言的可移植性、更快的数据提取以及更轻松的 JSON 数据探索。掌握 JSONPath 使开发人员能够为各种 JSON 处理任务创建简洁、强大且灵活的查询。"
  },
  {
    "id": "44428997",
    "title": "Killer whales groom each other with pieces of kelp",
    "url": "https://www.science.org/content/article/killer-whales-groom-each-other-pieces-kelp",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "虎鲸用海带互相梳理身体",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "44473255",
    "title": "The Reality My Medicaid Patients Face",
    "url": "https://www.theatlantic.com/health/archive/2025/07/medicaid-cuts-work-requirements-patients/683437/",
    "summary": "Dr. Lindsay Ryan, a physician in California, argues that new Medicaid work requirements will severely harm vulnerable patients, despite the stated goal of reducing waste. She illustrates this with the story of a patient whose severe disability should exempt him, but whose lack of a stable address, phone, and ID will make proving his exemption nearly impossible.\n\nDr. Ryan contends that bureaucratic hurdles, or \"time taxes,\" disproportionately affect the poor and disabled, who often lack the resources to navigate complex systems. She provides further examples of patients with language barriers, cognitive impairments, addiction, and unstable employment, all of whom would struggle to meet work requirements despite qualifying for exemptions.\n\nShe points to Arkansas's experience, where a majority of those disenrolled due to work requirements still should have qualified. The Congressional Budget Office projects that nearly 12 million Americans will lose insurance by 2034 due to the new legislation, resulting in a trillion-dollar cut to Medicaid by 2034 and over 300 billion due to work requirements. The author argues that these cuts will devastate rural healthcare and urban neighborhoods, ultimately saving money by denying necessary medical care and burdening Americans with preventable illness. She notes the cost to administer these programs will far outweigh the benefits.\n",
    "chinese_title": "我的医疗补助患者所面临的现实",
    "chinese_summary": "加州医生林赛·瑞安认为，新的医疗补助工作要求将严重损害弱势患者，尽管其既定目标是减少浪费。她以一位患者的故事为例，这位患者的严重残疾本应使其获得豁免，但由于缺乏稳定的地址、电话和身份证，要证明其豁免几乎是不可能的。\n\n瑞安医生认为，官僚障碍或“时间税”对贫困和残疾人士的影响尤为严重，他们往往缺乏应对复杂系统的资源。她进一步提供了患有语言障碍、认知障碍、成瘾和不稳定就业的患者的例子，所有这些患者即使有资格获得豁免，也会难以满足工作要求。\n\n她指出阿肯色州的经验，该州因工作要求而被取消资格的大多数人仍然应该符合资格。国会预算办公室预测，到2034年，由于新立法，将有近1200万美国人失去保险，导致到2034年医疗补助削减一万亿美元，其中超过3000亿美元是由于工作要求造成的。作者认为，这些削减将摧毁农村医疗和城市社区，最终通过拒绝必要的医疗保健和使美国人负担可预防的疾病来节省资金。她指出，管理这些项目的成本将远远超过收益。"
  },
  {
    "id": "44467914",
    "title": "The Amiga 3000 Unix and Sun Microsystems: Deal or No Deal?",
    "url": "https://www.datagubbe.se/amix/",
    "summary": "This article investigates the long-standing Amiga lore that Sun Microsystems was interested in licensing either the Amiga 3000UX hardware or its UNIX operating system in the early 1990s, but Commodore management allegedly scuttled the deal.\n\nThe author examines historical sources, including statements from Commodore engineers Dave Haynie and Bryce Nesbitt, who present differing accounts – Haynie claiming Sun wanted to OEM the A3000UX hardware, and Nesbitt suggesting Commodore offered to license Amiga UNIX.\n\nHowever, the author finds these stories riddled with inconsistencies and improbabilities. By 1990-91, Sun's primary focus was SPARC architecture, and they already had a low-end 68k workstation line (Sun-3/80).  The author questions why Sun would introduce a new 68030 machine when phasing out the architecture. While the Amiga 3000UX offered good value, it lacked the processing power compared to newer 68040-based machines and emerging RISC workstations.\n\nRegarding software, the article disputes the claim that Commodore's UNIX SVR4 port was a significant draw, as Sun was already developing Solaris 2.0, its own SVR4-based UNIX, for SPARC. Licensing a UNIX port for a cul-de-sac architecture was unlikely.\n\nThe author concludes that the \"Sun deal\" story, while persistent, lacks supporting evidence and doesn't align with the prevailing technological and business trends of the time. The Amiga 3000UX, though cool, faced an uphill battle in a UNIX workstation market dominated by larger players, regardless of Commodore's management issues.\n",
    "chinese_title": "Amiga 3000 Unix 和 Sun Microsystems：合作还是不合作？",
    "chinese_summary": "本文调查了长期存在的Amiga传说，即太阳微系统公司（Sun Microsystems）在1990年代早期有意向授权Amiga 3000UX硬件或其UNIX操作系统，但据说Commodore管理层破坏了该交易。\n\n作者考察了历史资料，包括Commodore工程师Dave Haynie和Bryce Nesbitt的说法，他们提出了不同的说法——Haynie声称Sun想要OEM A3000UX硬件，而Nesbitt暗示Commodore提出授权Amiga UNIX。\n\n然而，作者发现这些说法漏洞百出，缺乏可能性。到1990-91年，Sun的主要重点是SPARC架构，并且他们已经拥有低端68k工作站系列（Sun-3/80）。作者质疑为什么Sun会在逐步淘汰该架构时推出新的68030机器。虽然Amiga 3000UX提供了良好的价值，但与更新的基于68040的机器和新兴的RISC工作站相比，它缺乏处理能力。\n\n关于软件，本文反驳了Commodore的UNIX SVR4端口具有重大吸引力的说法，因为Sun已经在为其SPARC开发Solaris 2.0，这是其自己基于SVR4的UNIX。为一个死胡同架构授权UNIX端口是不太可能的。\n\n作者的结论是，“Sun交易”的故事虽然一直存在，但缺乏支持证据，并且与当时的 prevailing 技术和商业趋势不符。Amiga 3000UX虽然很酷，但在由大型企业主导的UNIX工作站市场中面临着艰苦的斗争，无论Commodore的管理问题如何。"
  },
  {
    "id": "44470574",
    "title": "Show HN: MCP-123, a 2-line MCP server/client (Windows-friendly)",
    "url": "https://github.com/Tylersuard/MCP-123",
    "summary": "MCP-123 is a Python library designed to simplify the creation and use of Model Context Protocol (MCP) servers and clients, making it exceptionally easy to integrate tools with Large Language Models (LLMs) like those from OpenAI. Its core principle is minimizing boilerplate code.\n\nThe library allows users to create an MCP server with just two lines of code, automatically exposing functions defined in a `tools.py` file as callable tools. These functions require no special decorators or wrappers. For example, a simple `add` function can be used as a tool.\n\nThe client side also requires only two lines of code to set up. It connects to the server, discovers available tools, and leverages an OpenAI API key to answer questions. If the LLM determines a tool is necessary, it automatically calls the appropriate function from the server.\n\nKey features include: ultra-minimal setup, easy tool creation through standard Python functions, and seamless OpenAI integration. It requires Python 3.11+ and an OpenAI API key. The project is built with FastMCP and inspired by the Model Context Protocol (MCP). Contributions, especially in ALL-CAPS, are welcome.\n",
    "chinese_title": "Show HN: MCP-123，一个两行代码的MCP服务器/客户端 (Windows友好)",
    "chinese_summary": "MCP-123：简化模型上下文协议(MCP)服务器和客户端创建与使用的Python库，使工具与OpenAI等大型语言模型(LLM)的集成异常简单。其核心原则是最小化样板代码。\n\n该库允许用户仅用两行代码创建一个MCP服务器，自动将`tools.py`文件中定义的函数作为可调用工具公开。这些函数不需要特殊的装饰器或包装器。例如，一个简单的`add`函数可以用作工具。\n\n客户端也只需两行代码即可设置。它连接到服务器，发现可用工具，并利用OpenAI API密钥来回答问题。如果LLM确定需要工具，它会自动调用服务器上的相应函数。\n\n主要功能包括：超小化的设置，通过标准Python函数轻松创建工具，以及无缝的OpenAI集成。它需要Python 3.11+和OpenAI API密钥。该项目基于FastMCP构建，并受到模型上下文协议(MCP)的启发。欢迎贡献，尤其是大写字母的贡献。"
  },
  {
    "id": "44464647",
    "title": "Ask HN: I want to leave tech: what do I do?",
    "url": "https://write.as/conjure-utopia/lets-say-youre-working-in-tech-and-you-have-a-technical-role-youre-a",
    "summary": "This \"Ask HN\" post addresses tech workers seeking a career change that offers more meaning, stability, or positive impact. It acknowledges various motivations for leaving tech, from disillusionment with the industry's values to a desire for more purpose.\n\nThe article suggests several alternative paths:\n\n*   **Working for a public institution:** Offers a softer transition with similar tools but potentially more meaningful work affecting millions. Be wary of consultancy firm influence.\n*   **Joining a tech co-operative:** Provides worker ownership and control over projects and revenue distribution, but requires greater responsibility. Consider \"autonomous working groups\" for easier entry.\n*   **Joining a tech NGO:** Explores opportunities within non-profits focused on environmentalism, civil rights, healthcare, and more. Requires targeted networking.\n*   **Working for a union or party:** Allows using tech skills to support political or social causes.\n*   **Becoming a mentor or teacher:** Capitalizes on the continued demand for tech education through high schools, universities, or online platforms.\n*   **Becoming a \"techno-political hustler\":** A connector and facilitator leveraging tech skills for social or ethical projects, supporting NGOs and other organizations.\n\nThe author emphasizes that finding the right path is a personal journey, but provides pointers and resources to help tech workers discover organizations outside the traditional tech industry that need their skills. The conclusion encourages taking the initiative to create a more fulfilling career.\n",
    "chinese_title": "Ask HN: 我想离开科技行业：我该怎么办？",
    "chinese_summary": "“Ask HN”帖文：科技从业者寻求更有意义、更稳定或更积极影响的职业转型。 本文承认离开科技行业的各种动机，从对行业价值观的幻灭到对更多目标的渴望。\n\n本文提出了几种替代方案：\n\n*   **为公共机构工作：** 提供更温和的过渡，使用类似的工具，但可能从事影响数百万人的更有意义的工作。 警惕咨询公司的影响。\n*   **加入科技合作社：** 提供工人所有权和对项目及收入分配的控制权，但需要承担更大的责任。 考虑“自主工作组”以更容易入门。\n*   **加入科技非政府组织：** 探索专注于环保、民权、医疗保健等的非营利组织中的机会。 需要有针对性的社交。\n*   **为工会或政党工作：** 允许使用技术技能来支持政治或社会事业。\n*   **成为导师或教师：** 利用高中、大学或在线平台对技术教育的持续需求。\n*   **成为一名“技术政治推动者”：** 一位连接者和促进者，利用技术技能为社会或道德项目服务，支持非政府组织和其他组织。\n\n作者强调，找到正确的道路是一个人的旅程，但提供了指导和资源，以帮助科技从业者发现传统科技行业之外需要他们技能的组织。 结论鼓励大家主动创造更充实的职业生涯。"
  },
  {
    "id": "44463536",
    "title": "Can Large Language Models Play Text Games Well? (2023)",
    "url": "https://arxiv.org/abs/2304.02868",
    "summary": "This arXiv article, \"Can Large Language Models Play Text Games Well? Current State-of-the-Art and Open Questions,\" investigates the ability of large language models (LLMs) like ChatGPT and GPT-4 to play text-based games. The authors, Chen Feng Tsai, Xiaochen Zhou, Sierra S. Liu, Jing Li, Mo Yu, and Hongyuan Mei, explore how well these models can understand the environment and interact through dialogue within the game world.\n\nThe study reveals that ChatGPT performs competitively compared to existing text game-playing systems, but still demonstrates a low level of \"intelligence\" in the context of these games. The researchers highlight specific shortcomings: ChatGPT struggles to build a world model from gameplay or even by reading game manuals. It also has difficulty leveraging existing world knowledge and inferring the necessary goals for each step of the game.\n\nThe paper concludes that these limitations reveal opportunities for further research at the intersection of artificial intelligence, machine learning, and natural language processing. The work raises important questions about the ability of LLMs to truly understand and reason within complex, interactive environments. The paper was initially submitted in April 2023 and revised in March 2025.\n",
    "chinese_title": "大型语言模型能玩好文本游戏吗？（2023）",
    "chinese_summary": "大型语言模型能玩好文本游戏吗？当前技术水平与开放性问题\n\n该arXiv文章《大型语言模型能玩好文本游戏吗？当前技术水平与开放性问题》研究了诸如ChatGPT和GPT-4等大型语言模型（LLMs）玩文本游戏的能力。作者陈风才、周晓辰、刘诗雅、李静、俞默和梅宏元探讨了这些模型在游戏世界中理解环境并通过对话互动表现如何。\n\n研究表明，ChatGPT在玩文本游戏方面表现出与现有系统相媲美的竞争力，但仍展现出较低水平的“智能”。研究人员强调了具体的不足之处：ChatGPT难以从游戏玩法甚至阅读游戏手册中构建世界模型，也难以利用现有的世界知识并推断出游戏中每个步骤的必要目标。\n\n该论文总结认为，这些局限性揭示了人工智能、机器学习和自然语言处理交叉领域进一步研究的机会。该工作提出了关于LLMs在复杂、交互式环境中真正理解和推理能力的重要问题。该论文最初于2023年4月提交，并于2025年3月修订。"
  },
  {
    "id": "44462947",
    "title": "Larry (cat)",
    "url": "https://en.wikipedia.org/wiki/Larry_(cat)",
    "summary": "Larry is a domestic tabby cat who has served as Chief Mouser to the Cabinet Office at 10 Downing Street since 2011. Adopted from Battersea Dogs & Cats Home, he's been a resident through six Prime Ministers: Cameron, May, Johnson, Truss, Sunak, and Starmer. His duties include greeting guests, inspecting security, and napping on furniture, though his mousing abilities have been questioned.\n\nDespite initial doubts about his hunting skills (\"Lazy Larry\"), he has recorded some kills, even publicly. He's had several feline and canine housemates at Downing Street, including Freya, Dilyn, and Nova and rivalries, most notably with Palmerston, the Foreign Office cat.\n\nLarry's popularity extends beyond Downing Street. He has a higher favorability rating than some politicians and has been honored with a blue plaque. His life at Number 10 is documented in cartoons, Google Street View, and a parody Twitter account, @Number10Cat. Press photographers regularly capture his image, contributing to his widespread appeal. Despite rumors of ill health, Downing Street maintains he is \"happy and healthy.\" His unique position as a permanent fixture in British politics has solidified his place in popular culture.\n",
    "chinese_title": "拉里 (猫)",
    "chinese_summary": "拉里是一只家养虎斑猫，自2011年以来一直在唐宁街10号担任内阁办公室的首席捕鼠官。它从巴特西猫狗之家被收养，经历了六位首相：卡梅伦、梅、约翰逊、特拉斯、苏纳克和斯塔默。它的职责包括迎接客人、检查安全以及在家具上打盹，尽管它的捕鼠能力一直受到质疑。\n\n尽管最初对其狩猎技能有所怀疑（“懒惰的拉里”），但它也记录了一些捕杀记录，甚至公开捕杀。它在唐宁街有几位猫和狗的室友，包括弗雷亚、迪伦和诺瓦，以及一些竞争对手，最著名的是外交部猫帕默斯顿。\n\n拉里的受欢迎程度已经超越了唐宁街。它比一些政客拥有更高的支持率，并被授予了蓝色牌匾。它在10号的生活被记录在漫画、谷歌街景和一个恶搞推特账号@Number10Cat 中。新闻摄影师经常捕捉它的形象，从而增加了它的广泛吸引力。尽管有关于它身体不好的传言，但唐宁街坚称它“快乐且健康”。它作为英国政治中一个永久性存在的独特地位巩固了它在流行文化中的地位。"
  },
  {
    "id": "44467949",
    "title": "Everything around LLMs is still magical and wishful thinking",
    "url": "https://dmitriid.com/everything-around-llms-is-still-magical-and-wishful-thinking",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "关于大语言模型的一切仍然充满魔力和一厢情愿。",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "44466826",
    "title": "ChatGPT creates phisher's paradise by serving the wrong URLs for major companies",
    "url": "https://www.theregister.com/2025/07/03/ai_phishing_websites/",
    "summary": "This article from *The Register* highlights a new potential phishing vulnerability created by AI chatbots like ChatGPT. Researchers at Netcraft discovered that when prompted for the URLs of major company login pages, ChatGPT provided the correct URL only 66% of the time. 29% of the time it provided dead or suspended links, and another 5% led to legitimate but incorrect sites.\n\nThis inconsistency creates an opportunity for phishers. By identifying the incorrect URLs that ChatGPT suggests, criminals can register those domains and create convincing fake login pages to steal user credentials. Rob Duncan of Netcraft explains that phishers are adapting their tactics as users increasingly rely on AI instead of traditional search engines. They're focusing on manipulating AI models with fake sites designed to appear in their results.\n\nThe article cites an example of scammers poisoning the Solana blockchain API, setting up a fake interface and populating the internet with supporting (but false) documentation to trick developers into using the malicious code. This \"vibe coding\" attack strategy aims to exploit the reliance on AI for information gathering, emphasizing the need for users to remain vigilant even when using AI tools. The article concludes by noting the similarity of this technique to supply chain attacks.\n",
    "chinese_title": "ChatGPT为钓鱼者创造天堂，因其提供主要公司错误的URL",
    "chinese_summary": "《注册报》的文章指出，人工智能聊天机器人（如ChatGPT）带来了一种新的潜在网络钓鱼漏洞。Netcraft的研究人员发现，当被提示提供主要公司登录页面的URL时，ChatGPT只有66%的时间提供了正确的URL。29%的时间它提供了无效或暂停的链接，另有5%的时间链接到合法但错误的网站。\n\n这种不一致性为网络钓鱼者创造了机会。通过识别ChatGPT建议的错误URL，犯罪分子可以注册这些域名并创建具有说服力的虚假登录页面来窃取用户凭据。Netcraft的Rob Duncan解释说，随着用户越来越依赖人工智能而非传统搜索引擎，网络钓鱼者正在调整策略。他们正专注于操纵人工智能模型，使用旨在出现在其结果中的虚假网站。\n\n文章引用了一个诈骗者毒害Solana区块链API的例子，他们设置了一个虚假界面，并在互联网上发布支持性（但虚假）文档，以诱骗开发人员使用恶意代码。这种“氛围编码”攻击策略旨在利用人们对人工智能信息收集的依赖，强调用户即使在使用人工智能工具时也需要保持警惕。文章最后指出，这种技术与供应链攻击相似。"
  },
  {
    "id": "44463747",
    "title": "Show HN: BunkerWeb – the open-source and cloud-native WAF",
    "url": "https://docs.bunkerweb.io/latest/",
    "summary": "BunkerWeb is presented as a next-generation, open-source Web Application Firewall (WAF) designed to secure web services \"by default.\" It functions as a reverse proxy based on NGINX, integrating seamlessly into various environments like Linux, Docker, and Kubernetes. Key features include ease of integration, high customizability, and a user-friendly web UI.\n\nThe WAF offers robust security features such as HTTPS support with Let's Encrypt automation, HTTP security headers, data leak prevention, TLS hardening, integrated ModSecurity with OWASP Core Rule Set, automatic banning of suspicious behavior based on HTTP status codes, connection/request limits, bot blocking via challenges, and IP blacklisting.\n\nThe project offers both an open-source version (AGPLv3 licensed) and a paid PRO version. The PRO version provides enhanced security features, improved user experience, and technical monitoring. Users can easily upgrade from open-source to PRO. A free trial is available using the code \"freetrial.\"\n\nBunkerWeb Cloud is also offered as a fully managed SaaS for those who don't want to self-host. Professional services like technical support, consulting, and custom development are available through the BunkerWeb Panel.\n\nThe announcement encourages readers to explore the demo website, web UI demo, and available resources like the official website, documentation, and community channels (Discord, LinkedIn, Twitter, Reddit).\n",
    "chinese_title": "Show HN: BunkerWeb – 开源云原生 WAF",
    "chinese_summary": "BunkerWeb是一款新一代开源Web应用程序防火墙(WAF)，旨在“默认”保护Web服务。它作为基于NGINX的反向代理工作，无缝集成到Linux、Docker和Kubernetes等各种环境中。其主要特点包括易于集成、高度可定制性和用户友好的Web UI。\n\n该WAF提供强大的安全功能，例如支持HTTPS并自动集成Let's Encrypt、HTTP安全标头、数据泄露防护、TLS强化、集成ModSecurity及OWASP核心规则集、基于HTTP状态代码自动禁止可疑行为、连接/请求限制、通过挑战进行机器人拦截以及IP黑名单。\n\n该项目提供开源版本（AGPLv3许可）和付费PRO版本。PRO版本提供增强的安全功能、改进的用户体验和技术监控。用户可以轻松地从开源版本升级到PRO版本。使用代码“freetrial”可以获得免费试用。\n\nBunkerWeb Cloud也作为完全托管的SaaS提供，适用于不想自行托管的用户。通过BunkerWeb Panel提供技术支持、咨询和定制开发等专业服务。\n\n该公告鼓励读者探索演示网站、Web UI演示以及官方网站、文档和社区渠道（Discord、LinkedIn、Twitter、Reddit）等可用资源。"
  },
  {
    "id": "44455787",
    "title": "Introducing tmux-rs",
    "url": "https://richardscollin.github.io/tmux-rs/",
    "summary": "This article introduces `tmux-rs`, a hobby project by Collin Richards to rewrite the tmux terminal multiplexer from C to Rust. The author describes the process of porting the ~67,000 lines of C code to ~81,000 lines of (unsafe) Rust.\n\nThe project initially started using C2Rust, a C to Rust transpiler, but the generated code was unmaintainable. The author abandoned this approach in favor of manually translating the code, function by function.\n\nThe author highlights the importance of understanding the original build process (autotools). The author explains how the build process transitioned from compiling a C binary that linked to a Rust static library to compiling a Rust binary that linked to a C library using the `cc` crate.\n\nThe author then details two interesting bugs encountered during the translation process, one involving incorrect function declaration in C and another involving mismatched struct definitions between C and Rust.\n\nThe article discusses challenges in mapping C constructs to Rust, focusing on raw pointers, the use of `goto` (which was emulated with labeled blocks and loops), and intrusive data structures. The author explains how traits are used to mimic the original C interface with intrusive macros. Finally, the article describes how the author used the lalrpop crate to rewrite the Yacc parser, allowing the project to eliminate its C dependencies.\n",
    "chinese_title": "介绍 tmux-rs",
    "chinese_summary": "本文介绍了Collin Richards的业余项目`tmux-rs`，该项目旨在将tmux终端复用器从C语言重写为Rust语言。作者描述了将约67,000行C代码移植到约81,000行（不安全）Rust代码的过程。\n\n该项目最初使用C到Rust的转译器C2Rust，但生成的代码难以维护。作者放弃了这种方法，转而采用手动翻译代码的方式，逐个函数地进行翻译。\n\n作者强调了理解原始构建过程（autotools）的重要性。作者解释了构建过程如何从编译链接到Rust静态库的C二进制文件过渡到使用`cc` crate编译链接到C库的Rust二进制文件。\n\n作者随后详细介绍了翻译过程中遇到的两个有趣的错误，一个涉及C语言中不正确的函数声明，另一个涉及C和Rust之间不匹配的结构体定义。\n\n本文讨论了将C结构映射到Rust的挑战，重点介绍了原始指针、`goto`的使用（使用标记块和循环进行模拟）以及侵入式数据结构。作者解释了如何使用trait来模仿原始C接口与侵入式宏。最后，本文描述了作者如何使用lalrpop crate重写Yacc解析器，从而使项目能够消除其C依赖项。"
  },
  {
    "id": "44463813",
    "title": "Is an Intel N100 or N150 a better value than a Raspberry Pi?",
    "url": "https://www.jeffgeerling.com/blog/2025/intel-n100-better-value-raspberry-pi",
    "summary": "This article compares the value of Intel N100/N150 mini PCs (like the GMKtec NucBox G3 Plus) to the Raspberry Pi 5, revisiting a previous comparison with updated benchmarks and a Linux-only environment on the mini PC to address fairness concerns. The author highlights that N100/N150 performance varies greatly depending on RAM, I/O, and cooling. While generally faster than the Pi 5 in raw performance (around 1.5-2x in benchmarks like High Performance Linpack), the Pi 5 is more power-efficient.\n\nThe article also addresses the misconception that used Tiny PCs are cheaper than Raspberry Pis by distinguishing between used and new pricing. A similarly-specced new mini PC is roughly comparable in price to a fully-kitted-out Raspberry Pi 5. However, a bare Pi 5 is cheaper at the entry level.\n\nUltimately, the \"better value\" choice is context-dependent. The Pi 5 is more compact, power-efficient at idle, and can be powered via PoE, making it suitable for remote and low-power use cases. Intel systems offer better compatibility with a wider range of software, including Windows. The author cautions against oversimplification, comparing the situation to choosing between a bicycle and a car.\n\nAdditional notes include a defective power adapter received with the review unit and compatibility issues encountered when installing Ubuntu 24.04.\n",
    "chinese_title": "英特尔N100或N150比树莓派更具性价比吗？",
    "chinese_summary": "本文对比了英特尔N100/N150迷你电脑（如GMKtec NucBox G3 Plus）与树莓派5的价值，通过更新的基准测试以及迷你电脑上仅Linux环境，重新审视了之前的对比，以解决公平性问题。作者强调N100/N150的性能因RAM、I/O和散热而异。虽然在原始性能上通常比树莓派5更快（在高性能Linpack等基准测试中约为1.5-2倍），但树莓派5更省电。\n\n本文还纠正了一种误解，即二手迷你电脑比树莓派更便宜，区分了二手和全新产品的价格。配置相似的全新迷你电脑的价格与全套树莓派5大致相当。然而，裸板的树莓派5在入门级价格上更便宜。\n\n最终，“更好的价值”选择取决于具体情况。树莓派5更紧凑、空闲时更省电，并且可以通过PoE供电，使其适用于远程和低功耗用例。英特尔系统与包括Windows在内的更广泛的软件具有更好的兼容性。作者告诫不要过度简化，将这种情况比作选择自行车和汽车。\n\n其他注意事项包括评测单元收到的电源适配器存在缺陷，以及安装Ubuntu 24.04时遇到的兼容性问题。"
  },
  {
    "id": "44463916",
    "title": "Rust and WASM for Form Validation",
    "url": "https://sebastian.lauwe.rs/blog/rust-wasm-form-validation/",
    "summary": "This article explores using Rust and WebAssembly (WASM) for form validation in a web application, advocating for its practicality and potential for code sharing between frontend and backend. The author, Sebastian Lauwers, emphasizes the improved usability of Rust/WASM for backend developers, moving away from the previously cumbersome Node.js/Webpack-centric workflows.\n\nThe article details setting up a project with separate crates for the server (using Rocket) and the WASM component. The WASM part handles email form validation, leveraging browser's built-in validation and extending it with custom checks (e.g., domain name). Rust code interacts with the DOM to access form elements, prevent default submission, and trigger validation using `web-sys` crate. Validation happens within WASM, informing the browser to display appropriate messages if the input is invalid or submitting the form if valid.\n\nThe server, built with Rocket, serves the HTML templates and the WASM module. The key steps covered include compiling Rust to WASM, setting up the Rocket web server to serve both static files and handle form submissions, and writing the Rust code to interact with the DOM. The author highlights that although WASM introduces some initial overhead, the benefits of using WASM can outweigh the initial overhead when complexity increases. He concludes by emphasizing the feasibility and strength of using Rust and WASM for web development.\n",
    "chinese_title": "Rust 和 WASM 用于表单验证",
    "chinese_summary": "本文探讨了在Web应用程序中使用Rust和WebAssembly(WASM)进行表单验证的方法，提倡其可行性以及前后端代码共享的潜力。作者Sebastian Lauwers强调了Rust/WASM对后端开发人员的可用性提升，摆脱了以往繁琐的Node.js/Webpack中心工作流程。\n\n文章详细介绍了如何设置一个项目，其中包含用于服务器（使用Rocket）和WASM组件的独立crate。WASM部分处理电子邮件表单验证，利用浏览器的内置验证并通过自定义检查（例如，域名）对其进行扩展。Rust代码与DOM交互以访问表单元素，阻止默认提交，并使用`web-sys` crate触发验证。验证在WASM中进行，通知浏览器显示适当的消息（如果输入无效），或者在有效时提交表单。\n\n服务器使用Rocket构建，用于提供HTML模板和WASM模块。涵盖的关键步骤包括将Rust编译为WASM，设置Rocket Web服务器以提供静态文件和处理表单提交，以及编写Rust代码以与DOM交互。作者强调，尽管WASM引入了一些初始开销，但当复杂性增加时，使用WASM的优势可能会超过初始开销。最后，他强调了使用Rust和WASM进行Web开发的可行性和优势。"
  },
  {
    "id": "44469650",
    "title": "Why AO3 Was Down",
    "url": "https://www.reddit.com/r/AO3/s/67nQid89MW",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "AO3宕机原因",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "44462174",
    "title": "DRM Panic QR code generator",
    "url": "https://rust-for-linux.com/drm-panic-qr-code-generator",
    "summary": "生成摘要时出错",
    "chinese_title": "DRM Panic QR code generator",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44461015",
    "title": "LooksMapping",
    "url": "https://looksmapping.com/",
    "summary": "生成摘要时出错",
    "chinese_title": "LooksMapping",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44432857",
    "title": "OpenDrop – Electro-wetting technology to control small droplets of liquids",
    "url": "https://gaudishop.ch/index.php/product-category/opendrop/",
    "summary": "生成摘要时出错",
    "chinese_title": "OpenDrop – Electro-wetting technology to control small droplets of liquids",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44432596",
    "title": "Context Engineering for Agents",
    "url": "https://rlancemartin.github.io/2025/06/23/context_engineering/",
    "summary": "生成摘要时出错",
    "chinese_title": "Context Engineering for Agents",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44431805",
    "title": "Free as Air, Free as Water, Free as Knowledge (1992)",
    "url": "http://bactra.org/Sterling/Free_as_the_Air_Free_as_Water_Free_as_Knowledge.html",
    "summary": "生成摘要时出错",
    "chinese_title": "Free as Air, Free as Water, Free as Knowledge (1992)",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44433078",
    "title": "Raphael discovery emerges from Vatican museum restoration",
    "url": "https://news.artnet.com/art-world/raphael-rooms-restoration-discovery-2662624",
    "summary": "生成摘要时出错",
    "chinese_title": "Raphael discovery emerges from Vatican museum restoration",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44428746",
    "title": "The Novelty of the Arpanet",
    "url": "https://twobithistory.org/2021/02/07/arpanet.html",
    "summary": "生成摘要时出错",
    "chinese_title": "The Novelty of the Arpanet",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44468380",
    "title": "Show HN: Tinykv – Minimal file-backed key-value store for Rust",
    "url": "https://crates.io/crates/tinykv",
    "summary": "生成摘要时出错",
    "chinese_title": "Show HN: Tinykv – Minimal file-backed key-value store for Rust",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44471359",
    "title": "European Commission presents Roadmap for lawful access to data",
    "url": "https://home-affairs.ec.europa.eu/news/commission-presents-roadmap-effective-and-lawful-access-data-law-enforcement-2025-06-24_en",
    "summary": "生成摘要时出错",
    "chinese_title": "European Commission presents Roadmap for lawful access to data",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44461067",
    "title": "Zig breaking change – Initial Writergate",
    "url": "https://github.com/ziglang/zig/pull/24329",
    "summary": "生成摘要时出错",
    "chinese_title": "Zig breaking change – Initial Writergate",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44431372",
    "title": "Show HN: A cross-platform terminal emulator written in Java",
    "url": "https://github.com/sebkur/forceterm",
    "summary": "生成摘要时出错",
    "chinese_title": "Show HN: A cross-platform terminal emulator written in Java",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44432506",
    "title": "Caching is an abstraction, not an optimization",
    "url": "https://buttondown.com/jaffray/archive/caching-is-an-abstraction-not-an-optimization/",
    "summary": "生成摘要时出错",
    "chinese_title": "Caching is an abstraction, not an optimization",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44432900",
    "title": "phkmalloc",
    "url": "https://phk.freebsd.dk/sagas/phkmalloc/",
    "summary": "生成摘要时出错",
    "chinese_title": "phkmalloc",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44463698",
    "title": "Show HN: Fast Thermodynamic Calculations in Python",
    "url": "https://dlr-institute-of-future-fuels.github.io/gaspype/",
    "summary": "生成摘要时出错",
    "chinese_title": "Show HN: Fast Thermodynamic Calculations in Python",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44431226",
    "title": "Logging Shell Commands in BusyBox? Yes, You Can Now",
    "url": "http://carminatialessandro.blogspot.com/2025/06/logging-shell-commands-in-busybox-yes.html",
    "summary": "生成摘要时出错",
    "chinese_title": "Logging Shell Commands in BusyBox? Yes, You Can Now",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44431828",
    "title": "Ubuntu 25.10 Raises RISC-V Profile Requirements",
    "url": "https://www.omgubuntu.co.uk/2025/06/ubuntu-riscv-rva23-support",
    "summary": "生成摘要时出错",
    "chinese_title": "Ubuntu 25.10 Raises RISC-V Profile Requirements",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44473836",
    "title": "Long-lost Chinese typewriter prototype from the 1940s that changed computing",
    "url": "https://www.npr.org/2025/07/05/nx-s1-5405452/chinese-typewriter-mingkwai-stanford",
    "summary": "生成摘要时出错",
    "chinese_title": "Long-lost Chinese typewriter prototype from the 1940s that changed computing",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44455933",
    "title": "Flounder Mode – Kevin Kelly on a different way to do great work",
    "url": "https://joincolossus.com/article/flounder-mode/",
    "summary": "生成摘要时出错",
    "chinese_title": "Flounder Mode – Kevin Kelly on a different way to do great work",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44460552",
    "title": "My open source project was relicensed by a YC company [license updated]",
    "url": "https://twitter.com/soham_btw/status/1940952786491027886",
    "summary": "生成摘要时出错",
    "chinese_title": "My open source project was relicensed by a YC company [license updated]",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44463224",
    "title": "Our Fullstack Architecture: Eta, Htmx, and Lit",
    "url": "https://www.lorenstew.art/blog/eta-htmx-lit-stack/",
    "summary": "生成摘要时出错",
    "chinese_title": "Our Fullstack Architecture: Eta, Htmx, and Lit",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44466751",
    "title": "LLM-assisted writing in biomedical publications through excess vocabulary",
    "url": "https://www.science.org/doi/10.1126/sciadv.adt3813",
    "summary": "生成摘要时出错",
    "chinese_title": "LLM-assisted writing in biomedical publications through excess vocabulary",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44457390",
    "title": "Opening up ‘Zero-Knowledge Proof’ technology",
    "url": "https://blog.google/technology/safety-security/opening-up-zero-knowledge-proof-technology-to-promote-privacy-in-age-assurance/",
    "summary": "生成摘要时出错",
    "chinese_title": "Opening up ‘Zero-Knowledge Proof’ technology",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44466580",
    "title": "Not being federated and E2E as an advantage",
    "url": "https://blog.koehntopp.info/2025/06/17/no-federation-no-e2e.html",
    "summary": "生成摘要时出错",
    "chinese_title": "Not being federated and E2E as an advantage",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44468308",
    "title": "Btrfs read-write on FreeBSD: It is possible and works well (2024)",
    "url": "https://treefort.piusbird.space/blog/btrfs-freebsd/",
    "summary": "生成摘要时出错",
    "chinese_title": "Btrfs read-write on FreeBSD: It is possible and works well (2024)",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44470746",
    "title": "A new, faster DeepSeek R1-0528 variant appears from German lab",
    "url": "https://venturebeat.com/ai/holy-smokes-a-new-200-faster-deepseek-r1-0528-variant-appears-from-german-lab-tng-technology-consulting-gmbh/",
    "summary": "生成摘要时出错",
    "chinese_title": "A new, faster DeepSeek R1-0528 variant appears from German lab",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44445646",
    "title": "ICEBlock, an app for anonymously reporting ICE sightings, goes viral",
    "url": "https://techcrunch.com/2025/07/01/iceblock-an-app-for-anonymously-reporting-ice-sightings-goes-viral-overnight-after-bondi-criticism/",
    "summary": "生成摘要时出错",
    "chinese_title": "ICEBlock, an app for anonymously reporting ICE sightings, goes viral",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44468058",
    "title": "Prompting LLMs is not engineering",
    "url": "https://dmitriid.com/prompting-llms-is-not-engineering",
    "summary": "生成摘要时出错",
    "chinese_title": "Prompting LLMs is not engineering",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44455950",
    "title": "AI for Scientific Search",
    "url": "https://arxiv.org/abs/2507.01903",
    "summary": "生成摘要时出错",
    "chinese_title": "AI for Scientific Search",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44433024",
    "title": "Chasing Lost Languages",
    "url": "https://nautil.us/chasing-lost-languages-1221167/",
    "summary": "生成摘要时出错",
    "chinese_title": "Chasing Lost Languages",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44461222",
    "title": "Major reversal in ocean circulation detected in the Southern Ocean",
    "url": "https://www.icm.csic.es/en/news/major-reversal-ocean-circulation-detected-southern-ocean-key-climate-implications",
    "summary": "生成摘要时出错",
    "chinese_title": "Major reversal in ocean circulation detected in the Southern Ocean",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44471040",
    "title": "Proof That Adult Brains Make New Neurons Settles Scientific Controversy",
    "url": "https://www.scientificamerican.com/article/proof-that-adult-brains-make-new-neurons-settles-scientific-controversy/",
    "summary": "生成摘要时出错",
    "chinese_title": "Proof That Adult Brains Make New Neurons Settles Scientific Controversy",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44450575",
    "title": "Trans-Taiga Road (2004)",
    "url": "https://www.jamesbayroad.com/ttr/index.html",
    "summary": "生成摘要时出错",
    "chinese_title": "Trans-Taiga Road (2004)",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44466838",
    "title": "Air pollution may contribute to development of lung cancer in never-smokers",
    "url": "https://today.ucsd.edu/story/air-pollution-may-contribute-to-development-of-lung-cancer-in-never-smokers-new-study-finds",
    "summary": "生成摘要时出错",
    "chinese_title": "Air pollution may contribute to development of lung cancer in never-smokers",
    "chinese_summary": "生成摘要时出错"
  }
]