[
  {
    "id": "46006016",
    "title": "Show HN: Wealthfolio 2.0- Open source investment tracker. Now Mobile and Docker",
    "url": "https://wealthfolio.app/?v=2.0",
    "summary": "Wealthfolio 2.0 is an open-source, privacy-focused investment tracker now available on desktop, mobile, and web. It allows users to aggregate all investment and savings accounts in one place, providing a comprehensive view of their wealth. A key feature is its privacy-first approach, ensuring user data stays on their devices. It offers CSV import functionality and a beautifully crafted, user-friendly interface.\n\nWealthfolio offers features such as holdings overview, portfolio insights, and performance tracking, allowing users to monitor stocks, ETFs, and cryptocurrencies. The performance dashboard enables account comparisons, benchmarking against indexes like the S&P 500, and ETF tracking. Income tracking facilitates monitoring of dividends and interest income.\n\nFurthermore, Wealthfolio offers historical data, account analysis, goals tracking, and contribution room/limit tracking for tax-advantaged accounts. It helps users define financial goals, monitor progress, and avoid over-contributions. The platform is extensible with add-ons like an investment fees tracker, a goal progress tracker, and a stock trading tracker. Wealthfolio is free to use, with an optional one-time payment.\n",
    "chinese_title": "Show HN: Wealthfolio 2.0 - 开源投资追踪器。现已支持移动端和 Docker",
    "chinese_summary": "Wealthfolio 2.0 是一款开源的、注重隐私的投资追踪器，现已推出桌面端、移动端和网页端版本。它允许用户在一个地方聚合所有投资和储蓄账户，从而全面了解自己的财富。一个关键特性是其首要关注隐私的方法，确保用户数据保留在他们的设备上。它提供CSV导入功能以及精心设计、用户友好的界面。\n\nWealthfolio提供诸如持仓概览、投资组合洞察和业绩追踪等功能，允许用户监控股票、ETF和加密货币。业绩仪表板支持账户比较、与标普500等指数进行基准测试以及ETF追踪。收入追踪有助于监控股息和利息收入。\n\n此外，Wealthfolio还提供历史数据、账户分析、目标追踪以及税务优惠账户的供款额度/限额追踪。它可以帮助用户定义财务目标、监控进度并避免过度供款。该平台可以通过插件扩展，例如投资费用追踪器、目标进度追踪器和股票交易追踪器。Wealthfolio可以免费使用，并提供一次性可选付费。"
  },
  {
    "id": "46005111",
    "title": "We should all be using dependency cooldowns",
    "url": "https://blog.yossarian.net/2025/11/21/We-should-all-be-using-dependency-cooldowns",
    "summary": "This article argues for the adoption of \"dependency cooldowns\" as a simple and effective method to mitigate open-source supply chain attacks. Dependency cooldowns involve delaying the integration of new dependency versions for a specified period after their release, allowing time for vulnerabilities to be discovered and addressed.\n\nThe author highlights that most supply chain attacks have a short window of opportunity (hours or days) between the malicious update's release and its detection/removal. By implementing cooldowns (e.g., 7-14 days), developers can avoid the majority of these attacks.\n\nThe benefits of cooldowns are:\n\n*   **Empirical effectiveness:** They mitigate the most common types of supply chain attacks.\n*   **Ease of implementation:** Tools like Dependabot and Renovate offer built-in cooldown functionality, and some package managers also provide native support.\n*   **Incentivizing responsible vendor behavior:** Encourages security vendors to focus on rapid attack detection rather than overhyped marketing.\n\nThe article emphasizes that cooldowns are not a perfect solution, as sophisticated attackers may still evade detection. However, the author contends that a significant reduction in exposure (80-90%) can be achieved through this free and easy technique, making it a worthwhile security measure. The author also suggests that package managers should natively support cooldowns for comprehensive protection.\n",
    "chinese_title": "我们都应该使用依赖冷却机制。",
    "chinese_summary": "本文倡导采用“依赖冷却期”作为一种简单有效的缓解开源供应链攻击的方法。“依赖冷却期”是指在发布新的依赖项版本后，延迟一段时间再集成它们，从而为发现和解决漏洞留出时间。\n\n作者强调，大多数供应链攻击在恶意更新发布与其被检测/移除之间都存在一个很短的窗口期（几小时或几天）。通过实施冷却期（例如，7-14天），开发者可以避免绝大多数此类攻击。\n\n冷却期的优点包括：\n\n*   **经验有效性：** 它们可以缓解最常见的供应链攻击类型。\n*   **易于实施：** Dependabot和Renovate等工具提供内置的冷却期功能，一些包管理器也提供原生支持。\n*   **激励负责任的供应商行为：** 鼓励安全供应商专注于快速攻击检测，而不是过度炒作营销。\n\n文章强调，冷却期并非完美的解决方案，因为老练的攻击者可能仍然可以逃避检测。然而，作者认为，通过这种免费且简单的技术，可以显著降低风险暴露（80-90%），使其成为一项有价值的安全措施。作者还建议包管理器应原生支持冷却期，以实现全面保护。"
  },
  {
    "id": "46003144",
    "title": "FAWK: LLMs can write a language interpreter",
    "url": "https://martin.janiczek.cz/2025/11/21/fawk-llms-can-write-a-language-interpreter.html",
    "summary": "The author, inspired by the AWK programming language but frustrated by its limitations while attempting to solve Advent of Code problems, envisioned a more functional and modern \"FAWK\" language. They desired features like first-class arrays, functions, lexical scoping, explicit globals, and pipelines.\n\nInstead of implementing FAWK themselves, they leveraged the Cursor Agent and an LLM (specifically Sonnet 4.5) to generate a working Python interpreter, complete with comprehensive end-to-end tests. The LLM successfully handled complex features like arbitrary precision floating point operations (with the help of the `mpmath` library), print statement/expression duality, multi-dimensional arrays, and lexical scoping. Implementations in C, Haskell, and Rust were also attempted with initial success.\n\nThe author was impressed by the LLM's ability to deliver a functional interpreter based on high-level instructions and iterative guidance. While acknowledging their lack of familiarity with the generated code, they are excited to \"dogfood\" FAWK on future Advent of Code challenges. They are also considering using LLMs for other programming projects, like implementing a Hindley-Milner type system, but recognize the need to balance LLM assistance with maintaining personal coding proficiency.  FAWK is available on GitHub (Janiczek/fawk) for others to try, acknowledging its experimental nature and potential performance issues.\n",
    "chinese_title": "FAWK：大型语言模型可以编写语言解释器",
    "chinese_summary": "受 AWK 编程语言的启发，但又因其在解决 Advent of Code 问题时的局限性而感到沮丧，作者设想了一种更具函数式和现代化的 \"FAWK\" 语言。他们渴望拥有诸如一流数组、函数、词法作用域、显式全局变量和管道等功能。\n\n他们没有自己实现 FAWK，而是利用 Cursor Agent 和 LLM（特别是 Sonnet 4.5）生成了一个可工作的 Python 解释器，并配有全面的端到端测试。 LLM 成功处理了复杂的功能，如任意精度浮点运算（借助 `mpmath` 库）、print 语句/表达式的二元性、多维数组和词法作用域。 还在 C、Haskell 和 Rust 中尝试了实现，并取得了初步成功。\n\n作者对 LLM 基于高级指令和迭代指导交付功能性解释器的能力印象深刻。 虽然承认自己对生成的代码不太熟悉，但他们很高兴在未来的 Advent of Code 挑战中使用 \"FAWK\"。 他们也在考虑将 LLM 用于其他编程项目，例如实现 Hindley-Milner 类型系统，但也认识到需要平衡 LLM 的协助与保持个人编码能力。 FAWK 可在 GitHub (Janiczek/fawk) 上供其他人尝试，但承认其实验性质和潜在的性能问题。"
  },
  {
    "id": "46001889",
    "title": "Olmo 3: Charting a path through the model flow to lead open-source AI",
    "url": "https://allenai.org/blog/olmo3",
    "summary": "Olmo 3, released on November 20, 2025, emphasizes open-source AI development by providing access to the entire model flow, not just the final model. This includes every stage, checkpoint, dataset, and dependency needed to create and modify language models.\n\nThe core of the release is the Olmo 3-Think (32B), a reasoning model allowing inspection of intermediate reasoning steps and their origins in training data. The Olmo 3 family also includes Olmo 3-Base (7B, 32B), a powerful base model that outperforms other fully open base models and competes with leading open-weights models; Olmo 3-Think (7B, 32B), a post-trained reasoning model narrowing the gap with top open-weight models while using fewer training tokens; Olmo 3-Instruct (7B), a chat-focused model matching or exceeding open-weight models in conversational abilities and tool use; and Olmo 3-RL Zero (7B), a reinforcement learning pathway for bootstrapping complex reasoning and enabling RL algorithm benchmarking.\n\nOlmo 3 offers multiple documented development paths (Instruct, RL Zero, Think) from the same base model, promoting customization and experimentation. All components (data, code, model weights, checkpoints) are released under permissive open-source licenses. Olmo 3 models exhibit strong performance across various benchmarks, with Olmo 3-Base 32B outperforming fully open base models and Olmo 3-Think 32B emerging as the strongest fully open thinking model. Rigorous data curation, optimized training recipes, and algorithmic/infrastructure advances contributed to these results.\n",
    "chinese_title": "Olmo 3：引领开源AI，探索模型流程之路",
    "chinese_summary": "Olmo 3 于2025年11月20日发布，强调开源人工智能开发，提供对整个模型流程的访问权限，而不仅仅是最终模型。这包括创建和修改语言模型所需的每个阶段、检查点、数据集和依赖项。\n\n该版本的核心是 Olmo 3-Think (32B)，一个推理模型，允许检查中间推理步骤及其在训练数据中的来源。Olmo 3 系列还包括：Olmo 3-Base (7B, 32B)，一个强大的基础模型，优于其他完全开源的基础模型，并与领先的开源权重模型竞争；Olmo 3-Think (7B, 32B)，一个经过后训练的推理模型，缩小了与顶级开源权重模型的差距，同时使用更少的训练tokens；Olmo 3-Instruct (7B)，一个专注于聊天的模型，在对话能力和工具使用方面与开源权重模型相匹配或超过它们；以及 Olmo 3-RL Zero (7B)，一种用于引导复杂推理并支持 RL 算法基准测试的强化学习途径。\n\nOlmo 3 提供来自同一基础模型的多种记录在案的开发路径（Instruct、RL Zero、Think），从而促进定制和实验。所有组件（数据、代码、模型权重、检查点）均在宽松的开源许可下发布。Olmo 3 模型在各种基准测试中表现出强大的性能，其中 Olmo 3-Base 32B 优于完全开源的基础模型，而 Olmo 3-Think 32B 则成为最强大的完全开源的思考模型。严格的数据管理、优化的训练方法以及算法/基础设施的进步促成了这些结果。"
  },
  {
    "id": "46005349",
    "title": "XBMC 4.0 for the Original Xbox",
    "url": "https://www.xbox-scene.info/articles/announcing-xbmc-40-for-the-original-xbox-r64/",
    "summary": "XBMC 4.0, a major update to the classic media center platform for the Original Xbox, has been released, marking the first significant advancement since 2016. This update modernizes the software, preserving and extending the capabilities of the iconic homebrew application.\n\nXBMC, which evolved from XboxMediaPlayer and later became Kodi and Plex, has a rich history in home media software. Version 4.0 brings a modern interface powered by the Estuary skin (originally from Kodi v17) and updates the GUI framework, along with a fully realized games library system with metadata support for Xbox and emulated games.\n\nThe new release restores full functionality to metadata scrapers for movies and television, supports online repositories for add-ons, and improves task scheduling for smoother multitasking on the Xbox's limited hardware. It maintains support for lossless audio codecs like FLAC and includes compatibility with audio visualizers like MilkDrop.\n\nXBMC 4.0 continues to offer a Python-based add-on architecture and features an updated settings interface with comprehensive customization options. The development team plans to transition to Python 3.4.10 to potentially backport newer Kodi add-ons.\n\nThis release honors the legacy of XBMC while modernizing the experience, demonstrating the continued development on the Original Xbox, with future updates planned. Downloads and source code are available on Github, and contributions are welcome. Support is available on the Xbox-Scene Discord server.\n",
    "chinese_title": "初代Xbox平台的XBMC 4.0",
    "chinese_summary": "XBMC 4.0发布：经典媒体中心平台重大更新，自2016年以来首次重大进展。此更新对软件进行了现代化改造，保留并扩展了这款标志性自制应用程序的功能。\n\nXBMC由XboxMediaPlayer演变而来，后来发展为Kodi和Plex，在家庭媒体软件领域拥有悠久的历史。 4.0版本带来了由Estuary皮肤（最初来自Kodi v17）驱动的现代界面，并更新了GUI框架，以及一个功能完善的游戏库系统，支持Xbox和模拟游戏的元数据。\n\n新版本恢复了电影和电视元数据抓取器的完整功能，支持在线插件存储库，并改进了任务调度，从而在Xbox的有限硬件上实现更流畅的多任务处理。 它保持了对FLAC等无损音频编解码器的支持，并包括与MilkDrop等音频可视化工具的兼容性。\n\nXBMC 4.0继续提供基于Python的插件架构，并具有更新的设置界面，其中包含全面的自定义选项。 开发团队计划过渡到Python 3.4.10，以潜在地反向移植更新的Kodi插件。\n\n此版本致敬了XBMC的传统，同时实现了体验的现代化，展示了Original Xbox上的持续开发，并计划了未来的更新。 下载和源代码可在Github上找到，欢迎大家贡献。 Xbox-Scene Discord服务器提供支持。"
  },
  {
    "id": "46004293",
    "title": "Making a Small RPG",
    "url": "https://jslegenddev.substack.com/p/making-a-small-rpg",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "制作小型RPG",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "46006250",
    "title": "Pivot Robotics (YC W24) Is Hiring for an Industrial Automation Hardware Engineer",
    "url": "https://www.ycombinator.com/companies/pivot-robotics/jobs/7xG9Dc6-mechanical-engineer-controls",
    "summary": "Pivot Robotics (YC W24) is hiring a Mechanical Engineer (Controls) to help build and deploy the AI brain for robot arms in high-mix manufacturing. Their software combines off-the-shelf robots and vision sensors with foundation vision models to enable robots to adapt to complex tasks, with their first product focused on automating metal grinding. The company is currently deployed on 10+ robots at a cast iron foundry.\n\nThe role involves building and wiring control panels, integrating sensors and actuators with PLCs/Arduinos/robot controllers, designing safety systems, and troubleshooting electromechanical subsystems. Collaboration with software and electrical engineers is essential, as is supporting robot cell setup at customer sites. The engineer will also design and assemble mechanical systems like vises and camera mounts.\n\nIdeal candidates will have a Bachelor's or Master's degree in Mechanical, Mechatronics, or Robotics Engineering with 1-2 years of experience in mechanical design and control system integration. Required skills include experience building control panels, familiarity with safety hardware and standards, understanding of pneumatic systems, proficiency in CAD (SolidWorks, Fusion 360, or Onshape), and the ability to work hands-on in lab and factory environments, and willingness to travel. The position is full-time, located in San Francisco, and offers a salary of $100K - $135K with 0.40% - 0.75% equity.\n",
    "chinese_title": "枢轴机器人(YC W24) 招聘工业自动化硬件工程师",
    "chinese_summary": "Pivot Robotics (YC W24) 招聘机械工程师（控制方向），助力打造并部署用于高混合制造中机械臂的AI大脑。 他们的软件将现成的机器人和视觉传感器与基础视觉模型相结合，使机器人能够适应复杂的任务，其首款产品专注于自动化金属研磨。 该公司目前已在铸铁厂的 10 多个机器人上部署。\n\n该职位涉及构建和连接控制面板、将传感器和执行器与 PLC/Arduino/机器人控制器集成、设计安全系统以及排除机电子系统的故障。 与软件和电气工程师的合作至关重要，支持客户现场的机器人单元设置也同样重要。 该工程师还将设计和组装机械系统，如虎钳和相机支架。\n\n理想的候选人将拥有机械、机电一体化或机器人工程专业的学士或硕士学位，并具有 1-2 年的机械设计和控制系统集成经验。 必需的技能包括构建控制面板的经验、熟悉安全硬件和标准、了解气动系统、精通 CAD（SolidWorks、Fusion 360 或 Onshape），以及能够在实验室和工厂环境中进行实际操作的能力以及出差意愿。 该职位是全职，位于旧金山，薪资为 10 万美元至 13.5 万美元，并提供 0.40% 至 0.75% 的股权。"
  },
  {
    "id": "46004386",
    "title": "Building a Minimal Viable Armv7 Emulator from Scratch",
    "url": "https://xnacly.me/posts/2025/building-a-minimal-viable-armv7-emulator/",
    "summary": "This article details the process of building a minimal Armv7 emulator, named \"stinkarm,\" from scratch using Rust. The emulator, consisting of about 1300 lines of code, achieves this without relying on any external dependencies. It focuses on parsing and validating Armv7 ELF binaries, mapping segments into memory, decoding a subset of Arm instructions, translating memory interactions, and forwarding Arm Linux syscalls to the host x86-64 system.\n\nThe author created a simple \"hello world\" Armv7 binary as a test case, utilizing a build script and Nix flake to compile the assembly code. The emulator parses the ELF header and program headers to understand the binary's structure, identifies executable segments, and maps them into the emulator's memory space.\n\nKey aspects include implementing the parsing logic for the ELF header and program headers, defining Rust structs and enums to represent the ELF format elements, and handling endianness. The article highlights the use of macros for parsing bytes into unsigned integers. By meticulously recreating the execution environment, the emulator demonstrates the fundamental steps involved in running Armv7 binaries on a different architecture.\n",
    "chinese_title": "从零开始构建一个最小可用的Armv7模拟器",
    "chinese_summary": "本文详细介绍了如何使用 Rust 从头开始构建一个最小的 Armv7 模拟器，名为 \"stinkarm\"。该模拟器仅用约 1300 行代码实现，不依赖任何外部依赖项。其重点在于解析和验证 Armv7 ELF 二进制文件，将段映射到内存中，解码 Arm 指令的一个子集，转换内存交互，以及将 Arm Linux 系统调用转发到宿主 x86-64 系统。\n\n作者创建了一个简单的 \"hello world\" Armv7 二进制文件作为测试用例，并利用构建脚本和 Nix flake 来编译汇编代码。该模拟器解析 ELF 头部和程序头部以了解二进制文件的结构，识别可执行段，并将它们映射到模拟器的内存空间中。\n\n关键方面包括实现 ELF 头部和程序头部的解析逻辑，定义 Rust 结构体和枚举来表示 ELF 格式元素，以及处理字节序。本文重点介绍了使用宏将字节解析为无符号整数。通过细致地重现执行环境，该模拟器展示了在不同架构上运行 Armv7 二进制文件的基本步骤。"
  },
  {
    "id": "46006004",
    "title": "Command Lines – AI Coding's Control Spectrum",
    "url": "https://www.wreflection.com/p/command-lines-ai-coding",
    "summary": "Nowfal's \"Command Lines – AI Coding's Control Spectrum\" explores the rapidly evolving landscape of AI coding assistants. The market, driven by tools like Cursor, is booming, potentially unlocking significant productivity gains in software engineering.\n\nThe article segments users into three categories: \"Handcrafted Coding\" (those avoiding AI), \"Vibe Coding\" (non-engineers using AI for prototyping), and \"Architect + AI Coding\" (engineers strategically delegating tasks to AI). Based on user types, the AI coding market is divided into \"Hands-off\" tools for non-engineers (prototyping) and \"Hands-on\" tools for professional engineers (production code).\n\nWhile Cursor is experiencing significant revenue growth, its reliance on foundation models from companies like OpenAI and Anthropic poses a challenge, particularly concerning rate limits. Cursor's development of in-house models like Composer-2 aims to address this. Model quality is identified as the critical factor in the AI coding race, with Claude Code and OpenAI Codex gaining ground.\n\nIncumbents like Microsoft (GitHub Copilot), AWS (Kiro), and Google (Antigravity) leverage existing customer relationships and bundling to compete. Startups can gain traction by winning over individual users within organizations. The shift is also impacting traditional developer resources like StackOverflow, as AI increasingly answers programming questions.\n\nUltimately, the goal is fully autonomous software generation, and the winners will be those who offer superior model quality, unique features, and strong user retention.\n",
    "chinese_title": "命令行 – AI 编码的控制谱",
    "chinese_summary": "Nowfal的《命令行——AI编程的控制谱》探讨了AI编程助手快速发展的格局。在Cursor等工具的推动下，市场蓬勃发展，有望释放软件工程领域显著的生产力提升。\n\n文章将用户分为三类：“手工编码”（避免使用AI者）、“凭感觉编码”（非工程师使用AI进行原型设计）和“架构师+AI编码”（工程师策略性地将任务委托给AI）。根据用户类型，AI编码市场分为面向非工程师的“放手型”工具（原型设计）和面向专业工程师的“动手型”工具（生产代码）。\n\n虽然Cursor的收入增长显著，但其对OpenAI和Anthropic等公司基础模型的依赖构成了一个挑战，尤其是在速率限制方面。Cursor开发Composer-2等内部模型旨在解决这个问题。模型质量被认为是AI编码竞赛中的关键因素，Claude Code和OpenAI Codex正在迎头赶上。\n\n微软（GitHub Copilot）、AWS（Kiro）和谷歌（Antigravity）等现有企业利用现有的客户关系和捆绑销售进行竞争。初创公司可以通过赢得组织内单个用户的青睐来获得 traction。这种转变也影响了StackOverflow等传统开发者资源，因为AI越来越多地回答编程问题。\n\n最终目标是完全自主的软件生成，而胜出者将是那些提供卓越模型质量、独特功能和强大用户留存率的公司。"
  },
  {
    "id": "46002161",
    "title": "It's hard to build an oscillator",
    "url": "https://lcamtuf.substack.com/p/its-hard-to-build-an-oscillator",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "制造振荡器很难。",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "45937350",
    "title": "Scientists now know that bees can process time, a first in insects",
    "url": "https://www.cnn.com/2025/11/12/science/bees-visual-stimulus-study-scli-intl",
    "summary": "A new study reveals that bumblebees can process the duration of flashes of light, demonstrating an ability to process time previously unseen in insects. Researchers at Queen Mary University of London designed a maze where bees learned to associate short flashes of light with sweet food and long flashes with bitter food. Even without food present, the bees could distinguish between the light durations, indicating they were processing time itself, not just relying on smell or sight of the reward.\n\nThis discovery challenges the idea that insects are merely instinct-driven \"reflex machines\" and suggests they possess complex cognitive abilities. The findings place bees among a small group of animals, including humans and some vertebrates, known to differentiate between short and long durations, a skill vital for tasks like understanding Morse code.\n\nThe researchers plan to investigate the neural mechanisms behind this time-processing ability and study how colony dynamics affect learning. They hope the study will encourage greater appreciation for the cognitive complexity of insects. The study has broader implications for our understanding of time itself, a fundamental aspect of life that remains poorly understood. Experts not involved in the study highlighted the significance of the findings, pointing to the necessity of time management in foraging bees and emphasizing that impressive cognitive abilities don't necessarily require large brains.\n",
    "chinese_title": "科学家现在知道蜜蜂可以处理时间，这在昆虫中尚属首次。",
    "chinese_summary": "一项新研究表明熊蜂可以处理光闪持续时间，展现出一种之前未在昆虫中发现的时间处理能力。伦敦玛丽女王大学的研究人员设计了一个迷宫，熊蜂在其中学会将短光闪与甜食联系起来，将长光闪与苦食联系起来。即使没有食物出现，熊蜂也能区分光照时长，表明它们是在处理时间本身，而不仅仅是依靠气味或奖励的视觉。\n\n这一发现挑战了昆虫仅仅是受本能驱动的“反射机器”的观点，并表明它们拥有复杂的认知能力。该发现将蜜蜂置于包括人类和一些脊椎动物在内的一小群能够区分短时长和长时长的动物之列，这种技能对于理解摩尔斯电码等任务至关重要。\n\n研究人员计划调查这种时间处理能力背后的神经机制，并研究群体动态如何影响学习。他们希望这项研究能够鼓励人们更加欣赏昆虫的认知复杂性。这项研究对我们理解时间本身具有更广泛的意义，时间是生命的一个基本方面，但仍然知之甚少。未参与该研究的专家强调了该发现的重要性，指出时间管理对于觅食蜜蜂的必要性，并强调令人印象深刻的认知能力不一定需要大脑袋。"
  },
  {
    "id": "45993296",
    "title": "Nano Banana Pro",
    "url": "https://blog.google/technology/ai/nano-banana-pro/",
    "summary": "Google DeepMind introduces Nano Banana Pro (Gemini 3 Pro Image), a state-of-the-art image generation and editing model built on Gemini 3 Pro, offering improved reasoning, real-world knowledge, and creative controls. It enables users to visualize ideas, create infographics, and turn notes into diagrams with ease.\n\nKey features include:\n\n*   **Accurate and Context-Rich Visuals:** Nano Banana Pro generates visuals with enhanced reasoning and real-time information integration from Google Search.\n*   **Legible Text in Multiple Languages:** The model excels at rendering accurate and legible text within images, supporting international content creation and localization.\n*   **High-Fidelity Visuals:** It offers consistent branding, advanced creative controls, and up to 4K resolution. Users can maintain consistency across up to 14 inputs and 5 people in complex compositions.\n*   **Studio-Quality Creative Controls:** Localized editing allows for refining any part of an image, adjusting camera angles, changing focus, applying color grading, and transforming scene lighting.\n\nNano Banana Pro is available across Google products like the Gemini app, Google Ads, Workspace, Google AI Studio, and the Gemini API. Google is also emphasizing transparency by embedding SynthID digital watermarks in AI-generated images and providing a verification tool within the Gemini app. Free and Google AI Pro users will also see a visible \"Gemini sparkle\" watermark.\n",
    "chinese_title": "纳米香蕉Pro",
    "chinese_summary": "谷歌DeepMind推出Nano Banana Pro (Gemini 3 Pro图像)：基于Gemini 3 Pro构建的先进图像生成和编辑模型，提供更强的推理能力、现实世界知识和创意控制。它可以帮助用户轻松地将想法可视化、创建信息图表，并将笔记转化为图表。\n\n主要功能包括：\n\n*   **准确且内容丰富的视觉效果：** Nano Banana Pro生成的视觉效果具有增强的推理能力，并能实时整合来自谷歌搜索的信息。\n*   **多种语言的清晰文本：** 该模型擅长在图像中渲染准确且清晰的文本，支持国际内容创作和本地化。\n*   **高保真视觉效果：** 提供一致的品牌形象、高级创意控制和高达4K的分辨率。用户可以在复杂构图中保持最多14个输入和5个人的连贯性。\n*   **工作室级别的创意控制：** 局部编辑允许细化图像的任何部分，调整相机角度、改变焦点、应用色彩分级和转换场景光照。\n\nNano Banana Pro已在谷歌产品中推出，例如Gemini应用、Google Ads、Workspace、Google AI Studio和Gemini API。谷歌还强调透明度，通过在AI生成的图像中嵌入SynthID数字水印，并在Gemini应用中提供验证工具。免费和Google AI Pro用户还将看到可见的“Gemini闪光”水印。"
  },
  {
    "id": "45898185",
    "title": "I converted a rotary phone into a meeting handset",
    "url": "https://www.stavros.io/posts/i-converted-a-rotary-phone-into-a-meeting-handset/",
    "summary": "The author details their project of converting an old rotary phone into a functional meeting handset, fueled by a \"burning hatred\" for meetings. The goal was to create a device that could both function as a microphone/speaker for meeting audio and hang up on meetings with a satisfying slam.\n\nThe project involved using a Siemens rotary phone, preserving its original components by designing and 3D-printing custom connectors for easy, non-destructive wiring. An RP2040 microcontroller was initially intended to act as a combined sound card and keyboard emulator. However, after a costly and ultimately fruitless attempt using LLMs (Claude Opus) to code a sound card, the author switched to \"Plan B.\"\n\nPlan B involved using a USB hub, a cheap AliExpress USB sound card, and the RP2040 solely for keyboard functionality. The author disassembled the sound card, soldered pins to the audio jacks for handset connection, and wired it to the USB hub. The RP2040 was then connected to the phone's hook switch and rotary dial. Code was written to detect when the handset was hung up and send appropriate keystrokes (e.g., Ctrl+Shift+E for Zoom) to close the meeting window. The rotary dial was also programmed to input the dialed number as keystrokes.\n\nThe final product successfully combined the sound card and keyboard functionality through the USB hub. The author provides a video demonstration showcasing the satisfying hang-up feature. They conclude that the project was relatively simple, and the most challenging aspect was the RP2040 keyboard emulation, which was largely handled by an LLM.\n",
    "chinese_title": "我把转盘电话改造成了会议听筒。",
    "chinese_summary": "作者详细介绍了将老式转盘电话改造成功能性会议听筒的项目，其动力源于对会议的“深恶痛绝”。目标是创建一个既能作为会议音频的麦克风/扬声器，又能以令人满意的摔挂方式结束会议的设备。\n\n该项目使用了西门子转盘电话，通过设计和3D打印定制连接器，保留了其原始组件，实现了简易且无损的接线。最初计划使用RP2040微控制器作为组合声卡和键盘模拟器。然而，在使用LLM（Claude Opus）编写声卡代码，经历了一次代价高昂且最终徒劳的尝试后，作者转向了“B计划”。\n\nB计划包括使用USB集线器、一个廉价的速卖通USB声卡，以及仅用于键盘功能的RP2040。作者拆解了声卡，将引脚焊接到音频插孔上以便连接听筒，并将其连接到USB集线器。然后将RP2040连接到电话的挂机开关和转盘。编写了代码来检测听筒何时挂断，并发送相应的按键（例如，Zoom的Ctrl+Shift+E）以关闭会议窗口。转盘也被编程为将拨号数字作为按键输入。\n\n最终产品通过USB集线器成功结合了声卡和键盘功能。作者提供了一个视频演示，展示了令人满意的挂断功能。他们总结说，这个项目相对简单，最具挑战性的方面是RP2040键盘模拟，这在很大程度上是由LLM处理的。"
  },
  {
    "id": "45994854",
    "title": "Android and iPhone users can now share files, starting with the Pixel 10",
    "url": "https://blog.google/products/android/quick-share-airdrop/",
    "summary": "Google is bridging the gap between Android and iPhone users by enabling file sharing between devices using Quick Share and AirDrop. The new feature, starting with the Pixel 10 family, allows for seamless file transfers between Android and iOS operating systems, addressing a common user frustration. Google emphasizes the security of this feature, highlighting strong safeguards and independent security testing. This initiative follows Google's previous efforts to improve compatibility between operating systems, such as RCS messaging and unknown tracker alerts. The company plans to expand the feature to more Android devices in the future.\n",
    "chinese_title": "安卓和iPhone用户现在可以共享文件，从Pixel 10开始。",
    "chinese_summary": "谷歌正通过Quick Share和AirDrop实现安卓与iPhone用户间的文件共享，从而弥合两者之间的差距。这项新功能将从Pixel 10系列开始，实现安卓和iOS操作系统之间无缝的文件传输，解决了一个常见的用户痛点。谷歌强调该功能的安全性，强调了强大的安全保障和独立的安全性测试。在此之前，谷歌曾致力于提高操作系统之间的兼容性，例如RCS消息和未知追踪器警报。该公司计划未来将该功能扩展到更多安卓设备。"
  },
  {
    "id": "45952654",
    "title": "My Favorite Math Problem",
    "url": "https://bytesauna.com/post/my-favorite-math-problem",
    "summary": "Matias Heikkilä's article \"My Favorite Math Problem\" explores the appeal of a simple yet challenging chessboard puzzle: can a mutilated chessboard (obtained by removing two opposing diagonal corners) be covered by 2x1 blocks? The answer is no, because the mutilation leaves an unequal number of white and black squares, and each 2x1 block must cover one of each color.\n\nHeikkilä admires the problem's accessibility and deceptive difficulty, noting that while the statement is easy to understand, finding the solution requires insight. He sees the problem as a gateway to understanding \"higher mathematics,\" particularly the concept of proving existence rather than simply constructing solutions. This leads to a discussion of abstract definitions and proofs, which he compares to art due to their creative nature.\n\nThe article then delves into the role of computers in modern mathematics. He notes that proofs can be seen as types, a concept understandable to computers through programming languages. Projects like Microsoft's are aiming to formalize mathematical knowledge into a computer-readable form, allowing for serious research and automated proof verification. He also touches on the potential of AI, particularly Large Language Models (LLMs), to generate type-theoretic formulations of mathematical statements. Heikkilä concludes by suggesting that mathematical research may soon be revolutionized by these technological advancements.\n",
    "chinese_title": "我最喜欢的数学题",
    "chinese_summary": "马蒂亚斯·海基拉的文章《我最喜欢的数学问题》探讨了一个简单而富有挑战性的棋盘谜题的魅力：一个被破坏的棋盘（通过移除两个相对的对角线角而获得）能否被2x1的方块覆盖？ 答案是否定的，因为破坏导致黑白方格数量不相等，而每个2x1的方块必须覆盖一个黑色和一个白色方格。\n\n海基拉欣赏这个问题易于理解和具有迷惑性的难度，他指出，虽然陈述很容易理解，但找到解决方案需要洞察力。 他认为这个问题是理解“高等数学”的入口，特别是证明存在性而不是简单地构建解决方案的概念。 这引出了对抽象定义和证明的讨论，他认为它们因其创造性而类似于艺术。\n\n文章随后深入探讨了计算机在现代数学中的作用。 他指出，证明可以被视为类型，这是一个可以通过编程语言让计算机理解的概念。 微软等公司的项目旨在将数学知识形式化为计算机可读的形式，从而实现严肃的研究和自动证明验证。 他还谈到了人工智能，特别是大型语言模型（LLM）在生成数学陈述的类型理论公式方面的潜力。 海基拉最后表示，数学研究可能很快就会被这些技术进步所彻底改变。"
  },
  {
    "id": "45917182",
    "title": "Open Source and Local Code Mode MCP in Deno Sandboxes",
    "url": "https://portofcontext.com",
    "summary": "This article introduces a new open-source and local code mode MCP (presumably meaning something like \"Model Control Plane\") designed to operate within Deno sandboxes. The core aim is to enable secure and reliable tool calling with Large Language Models (LLMs) that leverage \"ContextReplace.\" Essentially, it's facilitating the connection of AI Agents to real-world data and functionalities.\n\nThe key takeaway is the emphasis on a robust and open-source framework for enabling AI agents to interact with the environment through code execution, all within the security constraints of Deno sandboxes. This means the tool allows LLMs to execute code, retrieve data, and perform actions, while preventing malicious code from harming the system or accessing unauthorized resources.\n\nThe article promotes the possibility of using a tool from PCTX, potentially a cloud service related to this technology. The presence of a \"PCTX CLOUD WAITLIST\" suggests a product or service built on this foundation that is not yet publicly available.\n\nIn short, the article highlights a technology allowing safer and more controlled interaction between AI agents and real-world systems by combining open-source tools, local code execution, LLM \"ContextReplace\" capabilities, and the security features of Deno sandboxes.\n",
    "chinese_title": "Deno沙箱中的开源和本地代码模式MCP",
    "chinese_summary": "本文介绍了一种新的开源本地代码模式MCP（可能指“模型控制平面”），旨在Deno沙箱内运行。其核心目标是利用“上下文替换”技术，实现安全可靠的大语言模型（LLM）工具调用。本质上，它促进了AI Agent与现实世界数据和功能的连接。\n\n重点在于强调一个健壮且开源的框架，该框架使AI Agent能够通过代码执行与环境交互，所有操作都在Deno沙箱的安全约束内进行。这意味着该工具允许LLM执行代码、检索数据和执行操作，同时防止恶意代码损害系统或访问未经授权的资源。\n\n文章推广了使用PCTX工具的可能性，PCTX可能是一种与该技术相关的云服务。“PCTX CLOUD WAITLIST”的存在表明，基于该基础构建的产品或服务尚未公开提供。\n\n简而言之，本文重点介绍了一种技术，该技术通过结合开源工具、本地代码执行、LLM“上下文替换”功能以及Deno沙箱的安全功能，允许AI Agent与现实世界系统之间进行更安全、更可控的交互。"
  },
  {
    "id": "45937830",
    "title": "Ancient Roman Glass Reveals a Hidden \"Language\"",
    "url": "https://nautil.us/ancient-roman-glass-reveals-a-hidden-language-1247932/",
    "summary": "Archaeologist and glassblower Hallie Meredith's observation of ancient Roman glass cage cups (diatreta) at the Metropolitan Museum of Art has potentially revealed a \"hidden language\" used by the artisans who created them. Meredith noticed recurring motifs like crosses, leaves, and diamonds alongside inscriptions, which she believes were not merely decorative but served as a visual communication system.\n\nHer research suggests these symbols acted as a form of branding, indicating the regional workshops where the cups were made. By examining unfinished diatreta fragments, tool marks, and inscriptions, Meredith proposes that collectives of apprentices, polishers, and engravers collaborated on these intricate projects, which could take years to complete.\n\nThe symbols found on the cups may have been used to denote the specific workshops that produced them, similar to a modern-day brand. Meredith's findings, published in the Journal of Glass Studies and World Archaeology, challenge the existing understanding of ancient artisans and their work. She hopes her work will spur further research into diatreta production, offering a more nuanced understanding of the craftspeople behind these prized Roman possessions.\n",
    "chinese_title": "古罗马玻璃揭示隐藏的“语言”",
    "chinese_summary": "考古学家兼玻璃吹制匠哈莉·梅雷迪思在大都会艺术博物馆观察到古罗马玻璃笼杯（笼状玻璃杯）后，可能揭示了制造它们的工匠所使用的“隐藏语言”。梅雷迪思注意到十字、叶子和菱形等重复出现的图案以及铭文，她认为这些不仅仅是装饰性的，而是作为一种视觉交流系统。\n\n她的研究表明，这些符号起到了品牌推广的作用，表明了制造这些杯子的区域作坊。通过检查未完成的笼状玻璃杯碎片、工具痕迹和铭文，梅雷迪思提出，学徒、抛光师和雕刻师组成的集体共同完成了这些复杂的项目，这些项目可能需要数年才能完成。\n\n杯子上发现的符号可能被用来表示生产它们的特定作坊，类似于现代品牌。梅雷迪思的研究结果发表在《玻璃研究杂志》和《世界考古学》上，挑战了人们对古代工匠及其工作的现有理解。她希望她的工作能够激发对笼状玻璃杯生产的进一步研究，从而更细致地了解这些珍贵的罗马财产背后的工匠。"
  },
  {
    "id": "46006183",
    "title": "Private Equity's New Venture: Youth Sports",
    "url": "https://jacobin.com/2025/11/youth-sports-hockey-private-equity",
    "summary": "Private equity firms are increasingly investing in youth sports, leading to increased costs and restricted access for many families. Companies like Black Bear Sports Group, backed by private equity, are buying up hockey rinks and other sports facilities, then implementing policies to maximize profits. A key tactic is prohibiting parents from recording their children's games, forcing them to subscribe to expensive streaming services (Black Bear TV, for example, costs $25-$50 a month). This practice has drawn criticism, including from Senator Chris Murphy, who was threatened with team penalties for live-streaming his child's hockey game.\n\nBeyond streaming, Black Bear is also adding fees, such as a $50 \"registration and insurance\" fee, on top of existing expenses like equipment, registration, and USA Hockey membership. Critics argue these actions are similar to private equity's playbook in other industries: degrading service quality while boosting returns. The rising costs of youth sports, driven by professionalization, personal trainers, and sports psychologists, are pricing out lower-income families. Hockey, already expensive, is becoming even less accessible.\n\nOther firms like Unrivaled Sports and Varsity Brands are also consolidating baseball camps, cheerleading arenas, and other sports, raising concerns about further cost increases and anti-competitive practices. Varsity Brands, for example, faced a lawsuit for allegedly pushing out cheerleading rivals and extracting profits from participants, eventually settling for $82 million. Legal experts fear that the focus on profits over child development will lead to further exploitation in the youth sports industry.\n",
    "chinese_title": "私募股权的新冒险：青少年体育",
    "chinese_summary": "私募股权公司日益投资青少年体育，导致成本增加，许多家庭的参与机会受限。像黑熊体育集团这样由私募股权支持的公司，正在收购溜冰场和其他体育设施，然后实施政策以最大化利润。一项关键策略是禁止家长录制孩子们的比赛，迫使他们订阅昂贵的流媒体服务（例如，黑熊电视每月收费25-50美元）。这种做法引来了批评，包括参议员克里斯·墨菲，他因为直播他孩子的冰球比赛而受到团队处罚的威胁。\n\n除了流媒体之外，黑熊还在增加费用，例如在设备、注册和美国冰球协会会员费等现有费用之上增加 50 美元的“注册和保险”费。批评人士认为，这些行为类似于私募股权在其他行业的策略：降低服务质量，同时提高回报。在职业化、私人教练和运动心理学家的推动下，青少年体育的成本不断上涨，这使得低收入家庭难以负担。本已昂贵的冰球运动变得更加难以企及。\n\n像Unrivaled Sports和Varsity Brands这样的其他公司也在整合棒球训练营、啦啦队竞技场和其他体育项目，引发了人们对成本进一步增加和反竞争行为的担忧。例如，Varsity Brands面临一项诉讼，指控其排挤啦啦队竞争对手并从参与者那里榨取利润，最终以 8200 万美元和解。法律专家担心，对利润的关注胜过儿童发展，这将导致青少年体育行业的进一步剥削。"
  },
  {
    "id": "46005928",
    "title": "The New AI Consciousness Paper – By Scott Alexander",
    "url": "https://www.astralcodexten.com/p/the-new-ai-consciousness-paper",
    "summary": "Scott Alexander's article dissects a new paper attempting to identify indicators of consciousness in AI systems, co-authored by prominent figures like Yoshua Bengio and David Chalmers. The paper focuses on computational theories of consciousness, sidestepping physical and supernatural explanations due to feasibility concerns. It examines theories like Recurrent Processing Theory, Global Workspace Theory, and Higher Order Theory, all relating to feedback mechanisms in cognitive processing.\n\nAlexander argues that while computer scientists can determine which AI systems exhibit \"something something feedback,\" the philosophical contribution falters by equivocating access consciousness (awareness of one's own thoughts) with phenomenal consciousness (subjective inner experience). He criticizes the paper's interpretation of theories like Global Workspace Theory, suggesting it leads to absurd conclusions if applied to phenomenal consciousness. He also points out that neuroscientific theories are often built on observed access to information, making it unclear why feedback mechanisms would correlate to phenomenal consciousness. Alexander argues that this \"bait and switch\" makes the paper less meaningful.\n",
    "chinese_title": "新人工智能意识论文 - 斯科特·亚历山大",
    "chinese_summary": "斯科特·亚历山大的文章剖析了一篇新的论文，该论文试图识别人工智能系统中的意识指标，由 Yoshua Bengio 和 David Chalmers 等知名人士共同撰写。该论文侧重于意识的计算理论，由于可行性考虑，避开了物理和超自然的解释。它考察了诸如循环处理理论、全局工作空间理论和高阶理论等理论，所有这些理论都与认知处理中的反馈机制有关。\n\n亚历山大认为，虽然计算机科学家可以确定哪些人工智能系统表现出“某种反馈”，但该论文的哲学贡献却因将访问意识（对自己思想的意识）等同于现象意识（主观内在体验）而站不住脚。他批评该论文对全局工作空间理论等理论的解读，认为如果应用于现象意识，会导致荒谬的结论。他还指出，神经科学理论通常建立在对信息的观察性访问之上，因此不清楚为什么反馈机制会与现象意识相关联。亚历山大认为，这种“偷梁换柱”使得该论文的意义大打折扣。"
  },
  {
    "id": "45937183",
    "title": "WebAssembly from the Ground Up",
    "url": "https://wasmgroundup.com/",
    "summary": "\"WebAssembly from the Ground Up\" is a book designed to teach WebAssembly (Wasm) by guiding readers through the creation of a simple compiler in JavaScript. It aims to demystify Wasm and demonstrate its workings through a hands-on approach, requiring no prior compiler expertise.\n\nThe book covers the WebAssembly instruction set, module format, and how to interact with it using JavaScript. Readers will build a compiler for a toy language called Wafer, learning how to compile code down to WebAssembly. Topics include numeric instructions, memory access, control flow, and the WebAssembly security model. The book provides complete, MIT-licensed source code for each milestone.\n\nTargeted at experienced programmers with intermediate JavaScript knowledge, it promises to simplify compiler creation using the Ohm parsing toolkit. The goal is to provide a clear and accessible explanation of WebAssembly, making it easier to understand and work with the underlying technology. The book's price includes the technical content, interactive web and PDF versions, Discord membership, and a money-back guarantee.\n",
    "chinese_title": "从零开始学习WebAssembly",
    "chinese_summary": "从零开始学习WebAssembly：通过JavaScript构建简易编译器，本书旨在通过动手实践的方式，向读者讲解WebAssembly (Wasm) 的原理。无需具备编译器专业知识。\n\n本书涵盖WebAssembly指令集、模块格式以及如何使用JavaScript与之交互。读者将构建一个名为Wafer的玩具语言的编译器，学习如何将代码编译成WebAssembly。主题包括数值指令、内存访问、控制流和WebAssembly安全模型。本书为每个里程碑提供完整的、MIT许可的源代码。\n\n本书面向具有中级JavaScript知识的经验丰富的程序员，承诺使用Ohm解析工具包简化编译器创建。目标是提供对WebAssembly清晰易懂的解释，使其更容易理解和使用底层技术。本书价格包含技术内容、交互式网页和PDF版本、Discord会员资格和退款保证。"
  },
  {
    "id": "45905850",
    "title": "FEX-emu – Run x86 applications on ARM64 Linux devices",
    "url": "https://fex-emu.com/",
    "summary": "This article is an announcement for the latest release of FEX-emu, a software emulator that allows users to run x86 applications on ARM64 Linux devices. The brief announcement indicates a new tagged version (2511) is available, implying ongoing development and improvement of the emulator. The author highlights the continuous nature of emulator development and invites readers to \"Read More\" for a detailed breakdown of the specific changes and updates included in this release. Essentially, the post alerts the user to a new FEX-emu release and hints at improvements or new features without detailing them in this introductory snippet.\n",
    "chinese_title": "FEX-emu – 在ARM64 Linux设备上运行x86应用程序",
    "chinese_summary": "FEX-emu最新版本发布公告：此软件模拟器允许用户在ARM64 Linux设备上运行x86应用程序。新标记版本（2511）已发布，表明该模拟器正在持续开发和改进。作者强调了模拟器开发的持续性，并邀请读者“阅读更多”以了解此版本中包含的具体更改和更新。该帖子主要提醒用户FEX-emu发布了新版本，并暗示了改进或新功能，但未在此简介中详细说明。"
  },
  {
    "id": "45894585",
    "title": "A Whale-Surfing Fish",
    "url": "https://apnews.com/article/sucker-fish-riding-whale-remoras-humpback-australia-69db9878c42b7d11e3755ecca4132588",
    "summary": "This article discusses rare footage captured by scientists of remoras, also known as sucker fish, \"whale-surfing\" on humpback whales off the coast of Australia. These fish use an adhesive plate on their heads to latch onto whales, feeding on dead skin and sea lice.\n\nThe footage, taken with suction-cup cameras placed on the whales to study their behavior, revealed that the remoras expertly detach and reattach themselves to the whales' bodies just before and after breaches, showcasing impressive timing and precision. While the relationship is generally considered mutually beneficial, with the remoras cleaning the whales, the scientist, Olaf Meynecke, observed that whales with numerous remoras seemed irritated and breached more frequently, possibly to dislodge the fish.\n\nThe article also explores the mystery of how long the remoras stay attached during the whales' 10,000-km migration between Antarctica and Queensland. It's unknown if they detach in temperate waters and find new hosts, such as manta rays or dolphins, until the whales return. The author notes that remoras will also latch onto scuba divers if they can't find another host, much to the annoyance of the divers.\n",
    "chinese_title": "鲸鱼冲浪鱼",
    "chinese_summary": "本文探讨了科学家在澳大利亚海岸拍摄到的罕见镜头，展示了鮣鱼（也称为吸盘鱼）在座头鲸身上“冲浪”的行为。这些鱼利用头部的吸盘附着在鲸鱼身上，以死皮和海虱为食。\n\n这些镜头是用吸盘相机拍摄的，目的是研究鲸鱼的行为。镜头显示，鮣鱼在鲸鱼跃出水面之前和之后，能巧妙地脱离并重新附着在鲸鱼身上，展现出惊人的时机把握和精确性。虽然这种关系通常被认为是互惠互利的，鮣鱼能帮助鲸鱼清洁身体，但科学家Olaf Meynecke观察到，身上附着大量鮣鱼的鲸鱼似乎很烦躁，跃出水面的频率更高，这可能是为了甩掉这些鱼。\n\n本文还探讨了一个谜团：在鲸鱼于南极洲和昆士兰之间进行1万公里的迁徙过程中，鮣鱼会附着多久？目前尚不清楚它们是否会在温带水域脱落并寻找新的宿主，如蝠鲼或海豚，直到鲸鱼返回。作者指出，如果找不到其他宿主，鮣鱼也会附着在水肺潜水员身上，这让潜水员非常恼火。"
  },
  {
    "id": "46003778",
    "title": "How a French judge was digitally cut off by the USA",
    "url": "https://www.heise.de/en/news/How-a-French-judge-was-digitally-cut-off-by-the-USA-11087561.html",
    "summary": "The article \"How a French judge was digitally cut off by the USA\" from Heise Online discusses the case of French Judge Sabrina Daoud, who faced significant digital disruption due to U.S. sanctions related to her work in terrorism cases. Judge Daoud was involved in investigations related to entities sanctioned by the U.S.\n\nSpecifically, the article details how the U.S. Treasury Department added Judge Daoud to its list of Specially Designated Nationals (SDN) for her actions concerning terrorism cases involving the Kurdish-Syrian Roj camp. This designation resulted in her being effectively cut off from various online services and platforms.\n\nThe consequences of being on the SDN list were far-reaching. Many U.S.-based and internationally operating tech companies, including Google, Apple, and payment providers, blocked her access to their services. This meant she lost access to her email, online storage, and financial platforms, significantly hindering her professional and personal life.\n\nThe article highlights the extra-territorial reach of U.S. sanctions and the considerable impact they can have on individuals not directly involved in activities the U.S. seeks to target. It raises concerns about the power of U.S. sanctions to disrupt the lives of individuals abroad and the potential for collateral damage when sanctions are applied broadly. It questions the impact of these sanction on the judicial independence of a French judge.\n",
    "chinese_title": "美国如何通过数字手段切断一位法国法官的联系",
    "chinese_summary": "海塞在线文章《美国如何以数字方式切断一位法国法官的联系》讨论了法国法官萨布丽娜·达乌德的案例，她因其在恐怖主义案件方面的工作而面临美国制裁造成的重大数字干扰。达乌德法官参与了与美国制裁的实体相关的调查。\n\n具体而言，该文章详细介绍了美国财政部如何因达乌德法官处理涉及库尔德-叙利亚罗伊营地的恐怖主义案件的行为，将其列入特别指定国民（SDN）名单。这一指定导致她实际上与各种在线服务和平台隔绝。\n\n被列入SDN名单的后果影响深远。许多总部位于美国和国际运营的科技公司，包括谷歌、苹果和支付提供商，都阻止了她访问其服务。这意味着她失去了访问其电子邮件、在线存储和金融平台的权限，严重阻碍了她的职业和个人生活。\n\n该文章强调了美国制裁的域外管辖权，以及它们可能对未直接参与美国试图打击的活动中的个人的重大影响。它引发了人们对美国制裁破坏国外个人生活的能力以及广泛应用制裁时可能造成的附带损害的担忧。它质疑这些制裁对法国法官司法独立的影响。"
  },
  {
    "id": "46004364",
    "title": "EXIF orientation info in PNGs isn't used for image-orientation: from-image",
    "url": "https://bugzilla.mozilla.org/show_bug.cgi?id=1627423",
    "summary": "This bug report details an issue where Firefox doesn't respect EXIF orientation data in PNG images when using `image-orientation: from-image`. Specifically, PNG images containing EXIF orientation information (like \"Rotate 90 CW\") are not being displayed with the correct orientation, unlike JPEG images with the same EXIF data.\n\nThe reporter, Eric Portis, found that neither Safari, Chrome, nor Firefox initially handled EXIF data appended to the *end* of PNGs (exiftool's default). Safari handled EXIF data *before* the image data, but Firefox and Chrome did not. The issue arises because of the rendering behavior when the image size potentially changes mid-load based on orientation data.\n\nCameron McCormack noted that PNG does support orientation data via the eXif chunk and that implementing support for it would be feasible if the chunk appeared before the image data.\n\nThe bug was ultimately marked as a duplicate of bug 1682759, with Timothy Nikkel stating that bug should resolve this issue. The problem is considered a web compatibility bug because Chrome and Safari handle this differently. The bug report references PNG-3 specification about eXIf.\n",
    "chinese_title": "PNG图像中的EXIF方向信息不用于image-orientation: from-image",
    "chinese_summary": "此错误报告详述了 Firefox 在使用 `image-orientation: from-image` 时，无法正确识别 PNG 图像中 EXIF 方向数据的问题。具体而言，包含 EXIF 方向信息（如“顺时针旋转 90 度”）的 PNG 图像，并没有像具有相同 EXIF 数据的 JPEG 图像一样，以正确的方向显示。\n\n报告者 Eric Portis 发现，最初 Safari、Chrome 和 Firefox 都无法处理附加在 PNG *末尾*的 EXIF 数据（exiftool 的默认设置）。Safari 可以处理 *在* 图像数据 *之前* 的 EXIF 数据，但 Firefox 和 Chrome 不行。这个问题出现的原因是，当图像大小可能在加载过程中因方向数据而改变时，渲染行为会受到影响。\n\nCameron McCormack 指出，PNG 确实支持通过 eXif 数据块来存储方向数据，如果该数据块出现在图像数据之前，实现对它的支持是可行的。\n\n该错误最终被标记为 bug 1682759 的副本，Timothy Nikkel 表示该 bug 应该能解决这个问题。由于 Chrome 和 Safari 的处理方式不同，该问题被认为是 Web 兼容性错误。该错误报告引用了关于 eXIf 的 PNG-3 规范。"
  },
  {
    "id": "45999038",
    "title": "Over-regulation is doubling the cost",
    "url": "https://rein.pk/over-regulation-is-doubling-the-cost",
    "summary": "This article argues that over-regulation is a major barrier to hardtech innovation in the US, significantly increasing costs and hindering the deployment of technologies designed to improve the environment and lower costs. The author, a serial entrepreneur in carbon removal and electric trucking, contends that regulatory bottlenecks add millions of dollars to project costs and delay crucial environmental improvements.\n\nThe author cites examples from their own companies, Charm Industrial and Revoy. Charm's carbon removal project faced a 5.5-year delay in permitting, costing the company an estimated $125 million and resulting in an additional $300 million in societal healthcare costs due to continued air pollution from traditional burning methods. Revoy, focused on electric long-haul trucking, encountered years of bureaucratic hurdles in defining its technology, potentially costing $27 million for unnecessary emissions testing, despite demonstrably reducing pollution.\n\nThe author stresses that while regulation is essential, the current system's complexity, ambiguity, and slow pace stifle innovation. They advocate for regulatory reform, including expedited reviews for new technologies, default freedom to operate, permits by right, streamlined processes, and limiting activist legal challenges. The goal is to create an environment where entrepreneurs can build innovative hardware in the US, leading to a cleaner environment, lower costs, and a more prosperous nation. The author urges other hardtech founders to share their experiences to highlight the challenges and advocate for change.\n",
    "chinese_title": "过度监管使成本翻倍。",
    "chinese_summary": "过度监管是美国硬科技创新的主要障碍"
  },
  {
    "id": "45997212",
    "title": "New OS aims to provide (some) compatibility with macOS",
    "url": "https://github.com/ravynsoft/ravynos",
    "summary": "ravynOS is a new open-source operating system project aiming for macOS compatibility on x86-64 (and eventually ARM) systems. Built upon FreeBSD, it seeks to provide a macOS-like user experience, including source compatibility for macOS applications, similar GUI metaphors (file manager, menu bar, etc.), and compatible folder layouts.\n\nKey goals include supporting macOS file systems (HFS+, APFS) alongside ZFS, using self-contained application bundles for installation-free software management, maintaining compatibility with the FreeBSD base and X11, and enabling Linux binary compatibility. Future plans include native compatibility with x86-64/arm64 macOS binaries. The project emphasizes security, stability, and performance.\n\nThe article also describes the FreeBSD source tree which ravynOS is based on, outlining key directories and their functions, such as `/bin` (system commands), `/include` (system include files), `/lib` (system libraries), and `/sys` (kernel sources). Contribution to the ravynOS project is encouraged, with details available in `CONTRIBUTING.md` and communication channels including a Discord server and a Matrix room. Links to the ravynOS website, release notes, screenshots, and FAQ are provided.\n",
    "chinese_title": "新操作系统旨在提供（一定程度的）macOS兼容性",
    "chinese_summary": "ravynOS 是一个全新的开源操作系统项目，旨在实现 macOS 在 x86-64 (并最终在 ARM) 系统上的兼容性。它基于 FreeBSD 构建，力求提供类似 macOS 的用户体验，包括 macOS 应用程序的源码兼容性、相似的 GUI 隐喻（文件管理器、菜单栏等）以及兼容的文件夹布局。\n\n主要目标包括支持 macOS 文件系统（HFS+、APFS）以及 ZFS，使用自包含的应用程序包实现免安装的软件管理，保持与 FreeBSD 基础和 X11 的兼容性，并启用 Linux 二进制兼容性。未来的计划包括与 x86-64/arm64 macOS 二进制文件的原生兼容性。该项目强调安全性、稳定性和性能。\n\n文章还描述了 ravynOS 所基于的 FreeBSD 源代码树，概述了关键目录及其功能，例如 `/bin`（系统命令）、`/include`（系统包含文件）、`/lib`（系统库）和 `/sys`（内核源代码）。鼓励为 ravynOS 项目做出贡献，详细信息可在 `CONTRIBUTING.md` 中找到，沟通渠道包括 Discord 服务器和 Matrix 聊天室。文章提供了 ravynOS 网站、发行说明、屏幕截图和 FAQ 的链接。"
  },
  {
    "id": "45954228",
    "title": "Show HN: 32V TENS device from built from scratch under $100",
    "url": "https://littlemountainman.github.io/2025/11/17/tens/",
    "summary": "This \"Show HN\" post details the creation of a custom-built monophasic TENS device designed for hand stimulation, costing under $100. The project involved building a device that delivers controlled electrical pulses to the hand for therapeutic purposes.\n\nThe device is powered by a 3.7V LiPo battery managed by an MCP73831 charger for USB-C charging. Two voltage rails are created: a 3.3V logic rail for the ATmega32U4 microcontroller (the device's \"brain\") and a ~32V rail for the stimulation pulses, generated using a TPS55340 boost converter. A TPS63001 buck-boost converter ensures a stable 3.3V for the microcontroller regardless of the battery's charge level.\n\nThe ATmega32U4 generates adjustable monophasic pulses. The output stage uses MOSFETs and BJTs to gate the high-voltage pulses and limit current to the individual finger electrodes (thumb, index, middle, ring, pinky), with the palm acting as a common ground. This allows for selective stimulation of different fingers. TVS diodes provide protection.\n\nThe author emphasizes the combination of electronic design principles and user-centered engineering, resulting in a functional and cost-effective TENS device.\n",
    "chinese_title": "Show HN：自制 32V TENS 设备，成本低于 100 美元",
    "chinese_summary": "自制单相TENS手部刺激装置（成本低于100美元）\n该“Show HN”帖子详细介绍了自制单相TENS装置的过程，该装置专为手部刺激而设计，成本低于100美元。该项目涉及构建一个能够向手部传递可控电脉冲以达到治疗目的的设备。\n\n该设备由3.7V LiPo电池供电，并由MCP73831充电器管理USB-C充电。创建了两个电压轨：一个用于ATmega32U4微控制器（设备的“大脑”）的3.3V逻辑轨，以及一个用于刺激脉冲的~32V轨，该脉冲使用TPS55340升压转换器生成。TPS63001升降压转换器确保无论电池电量如何，微控制器都能获得稳定的3.3V电压。\n\nATmega32U4产生可调节的单相脉冲。输出级使用MOSFET和BJT来控制高压脉冲，并将电流限制到各个手指电极（拇指、食指、中指、无名指、小指），手掌作为公共地。这使得可以选择性地刺激不同的手指。TVS二极管提供保护。\n\n作者强调了电子设计原则和以用户为中心的工程的结合，从而产生了一个功能齐全且具有成本效益的TENS设备。"
  },
  {
    "id": "46002138",
    "title": "The Qtile Window Manager: A Python-Powered Tiling Experience",
    "url": "https://tech.stonecharioteer.com/posts/2025/qtile-window-manager/",
    "summary": "This article details the author's journey from XFCE to Qtile, a tiling window manager written in Python, emphasizing the benefits of its Python-based configuration. The author advocates for isolating Qtile's dependencies in a virtual environment and provides a detailed walkthrough of the installation process, including setting up a `.desktop` entry and `.xsessionrc` for wallpaper restoration.\n\nThe core of the article focuses on customizing Qtile, highlighting the modularity and adaptive behavior achieved through Python scripting. The author shares their current configuration, which includes a cohesive color scheme, smart mouse movement between monitors using a custom function, and logical keybindings.  Hardware awareness is a central theme, with custom widgets that detect battery presence, display IP addresses, and integrate AMD GPU monitoring via `amdgpu_top`. The screen configuration dynamically adjusts to the number of connected monitors, and startup hooks are used to manage persistent and one-time setup tasks.\n\nThe author reflects on the power of Python configuration, emphasizing its flexibility, reusability, and debugging capabilities.  They recommend starting with a simple configuration and iterating gradually, highlighting the importance of hardware awareness and performance considerations when developing custom widgets. Finally, the article outlines future plans for enhanced widgets, multi-monitor support, and integration improvements. The author concludes that Qtile has significantly improved their productivity and Linux desktop experience.\n",
    "chinese_title": "Qtile窗口管理器：Python驱动的平铺体验",
    "chinese_summary": "本文详细介绍了作者从XFCE迁移到Qtile（一个用Python编写的平铺窗口管理器）的历程，重点强调了其基于Python配置的优势。作者提倡将Qtile的依赖项隔离在虚拟环境中，并提供了详细的安装过程，包括设置`.desktop`条目和`.xsessionrc`文件以恢复壁纸。\n\n文章的核心在于定制Qtile，突出了通过Python脚本实现的模块化和自适应行为。作者分享了他们当前的配置，包括一个有凝聚力的配色方案、使用自定义函数在显示器之间进行智能鼠标移动以及逻辑化的键盘绑定。硬件感知是中心主题，自定义小部件可以检测电池是否存在、显示IP地址并通过`amdgpu_top`集成AMD GPU监控。屏幕配置会动态调整为连接的显示器数量，并且启动钩子用于管理持久和一次性设置任务。\n\n作者反思了Python配置的强大功能，强调了其灵活性、可重用性和调试能力。他们建议从一个简单的配置开始并逐步迭代，同时强调了在开发自定义小部件时硬件感知和性能考量的重要性。最后，文章概述了增强小部件、多显示器支持和集成改进的未来计划。作者总结说，Qtile极大地提高了他们的生产力和Linux桌面体验。"
  },
  {
    "id": "45913281",
    "title": "Hilbert space: Treating functions as vectors",
    "url": "https://eli.thegreenplace.net/2025/hilbert-space-treating-functions-as-vectors/",
    "summary": "This article explains how functions can be treated as vectors within the framework of Hilbert space, enabling the application of linear algebra tools to functions. It starts by building intuition, showing how vectors can be viewed as functions mapping indices to values, extending this concept to infinite dimensions and ultimately functions from reals to reals.\n\nThe article then discusses how functions, with standard addition and scalar multiplication, form a vector space. To work with more interesting operations, it introduces square-integrable functions (L²) which are functions whose integral of the squared magnitude is finite. L² forms a subspace of the broader function vector space.\n\nAn inner product is defined on L², which mirrors the dot product for vectors and allows the definition of a norm. Using the Cauchy-Schwarz inequality, it demonstrates that the inner product is finite for L² functions.\n\nCompleteness, the property that Cauchy sequences within the space converge to elements within the space, is crucial.  The Riesz-Fischer theorem guarantees that L² is complete, making it a Hilbert space. Banach spaces, a related concept, are complete normed spaces, more general than Hilbert spaces.\n\nFinally, the article illustrates the utility of Hilbert spaces with two applications: generalized Fourier series, where orthogonality and basis vectors in L² enable function representation as weighted sums, and Quantum Mechanics, where wavefunctions reside in Hilbert space, allowing linear algebra to analyze particle states. The appendices provide proofs for the vector space axioms and the subspace properties of square integrable functions.\n",
    "chinese_title": "希尔伯特空间：将函数视为向量",
    "chinese_summary": "本文解释了如何在希尔伯特空间框架下将函数视为向量，从而将线性代数工具应用于函数。首先，它通过构建直觉，展示了如何将向量视为将索引映射到值的函数，并将此概念扩展到无限维度，最终扩展到从实数到实数的函数。\n\n然后，本文讨论了函数如何通过标准加法和标量乘法形成向量空间。为了处理更有趣的运算，它引入了平方可积函数 (L²)，即平方幅度积分有限的函数。 L² 构成了更广泛的函数向量空间的子空间。\n\n在 L² 上定义了一个内积，它类似于向量的点积，并允许定义范数。 利用柯西-施瓦茨不等式，证明了L²函数的内积是有限的。\n\n完备性，即空间内的柯西序列收敛到空间内的元素，至关重要。 黎斯-费舍尔定理保证 L² 是完备的，使其成为希尔伯特空间。 巴拿赫空间是一个相关概念，是完备赋范空间，比希尔伯特空间更通用。\n\n最后，本文通过两个应用说明了希尔伯特空间的效用：广义傅里叶级数，其中 L² 中的正交性和基向量能够将函数表示为加权和；以及量子力学，其中波函数驻留在希尔伯特空间中，允许线性代数分析粒子状态。 附录提供了向量空间公理和平方可积函数的子空间性质的证明。"
  },
  {
    "id": "46005130",
    "title": "Is C++26 getting destructive move semantics?",
    "url": "https://stackoverflow.com/questions/79817124/is-c26-getting-destructive-move-semantics",
    "summary": "The post discusses the potential inclusion of \"destructive move semantics\" in C++26, specifically related to the `trivially_relocate_at` function, which aimed to allow transferring ownership of an object without calling the destructor on the source.\n\nThe original question asked if user code could replicate the magic behind `trivially_relocate_at`, allowing users to explicitly consume an object such that its destructor isn't called. The response indicated that the function relies on compiler magic and is not user-implementable. The user then suggests hypothetical new pointer qualifiers (`new T*` and `delete T*`) to express ownership transfer, hoping to facilitate static lifetime analysis akin to Rust.\n\nHowever, a later update reveals that trivial relocatability, and presumably also replaceability, was removed from C++26 due to an unfixable bug.\n\nUltimately, the post concludes that even if the feature hadn't been dropped, it wouldn't have provided full \"destructive move semantics\" as envisioned by the user. While it would have offered a low-level tool for library authors, it wouldn't have provided a high-level mechanism to express ownership transfer, thereby failing to unlock Rust-like lifetime analysis. The proposed feature was deemed incomplete in expressing ownership semantics and would have required manual memory management.\n",
    "chinese_title": "C++26会获得破坏性移动语义吗？",
    "chinese_summary": "该文章讨论了C++26中潜在包含的“破坏性移动语义”，特别是与`trivially_relocate_at`函数相关，该函数旨在允许转移对象的所有权，而无需调用源对象的析构函数。\n\n最初的问题询问用户代码是否可以复制`trivially_relocate_at`背后的魔法，允许用户显式地消耗一个对象，从而不调用其析构函数。 回应表明该函数依赖于编译器魔法，用户无法实现。 然后，用户提出了假设的新指针限定符（`new T*` 和 `delete T*`）来表达所有权转移，希望促进类似于 Rust 的静态生命周期分析。\n\n然而，稍后的更新显示，由于一个无法修复的错误，C++26中已经移除了简单可重定位性，并且大概也移除了可替换性。\n\n最终，该文章得出结论，即使该特性没有被删除，它也不会提供用户设想的完整的“破坏性移动语义”。 虽然它会为库作者提供一个底层工具，但它不会提供一个高级机制来表达所有权转移，因此无法解锁类似 Rust 的生命周期分析。 所提出的特性被认为在表达所有权语义方面是不完整的，并且需要手动内存管理。"
  },
  {
    "id": "46005130",
    "title": "Is C++26 getting destructive move semantics?",
    "url": "https://stackoverflow.com/questions/79817124/is-c26-getting-destructive-move-semantics",
    "summary": "This article discusses the potential for C++26 to gain \"destructive move semantics,\" allowing functions to explicitly consume an object such that its destructor is not run on the moved-from object. The author, user2394284, questions whether this is currently possible, inspired by the proposed `trivially_relocate_at` function. They note that the function signature doesn't convey that it destructs the source object or constructs one at the destination. They propose using new pointer qualifiers (`new T* dst, delete T* src`) to explicitly denote ownership transfer, aiming to enable static lifetime analysis akin to Rust.\n\nAn answer from Ben Voigt points out that `trivially_relocate_at` relies on compiler magic, preventing user-defined implementation. However, user2394284 then updates their post to reflect that the \"trivial relocatability\" feature, including `trivially_relocate_at`, was removed from C++26 due to an unfixable bug. Additionally, the related \"replaceability\" feature was also dropped.\n\nThe author further notes that even if the feature had remained, it lacked the \"semantics\" for destructive move semantics, providing a low-level tool but not a means to express ownership transfer. This means it wouldn't facilitate Rust-like lifetime analysis and would still necessitate manual memory management. Ultimately, the article concludes that C++26 will *not* be getting destructive move semantics in the form initially proposed, and even if it had, it wouldn't have fully addressed the desired goals of static lifetime analysis.\n",
    "chinese_title": "C++26会引入破坏性移动语义吗？",
    "chinese_summary": "C++26能否获得“破坏性移动语义”？"
  },
  {
    "id": "45995913",
    "title": "Show HN: Search London StreetView panoramas by text",
    "url": "https://london.publicinsights.uk",
    "summary": "This \"Show HN\" post highlights a web application that allows users to search London Street View panoramas by text. Essentially, instead of manually navigating Google Street View, users can type in a search query related to what they're looking for (e.g., \"red phone box\", \"a bakery\", \"pub\") and the application will return relevant Street View panoramas within London.\n\nThe provided content is minimal, merely indicating that JavaScript is required to run the application. Therefore, the summary is based on the implied functionality derived from the title. The key takeaway is the application provides a novel way to explore London Street View, leveraging text-based search instead of traditional map navigation.\n",
    "chinese_title": "展示HN：通过文本搜索伦敦街景全景图",
    "chinese_summary": "这个\"Show HN\"帖子介绍了一个网络应用，用户可以通过文本搜索伦敦街景全景图。本质上，用户无需手动浏览谷歌街景，只需输入与搜索内容相关的查询（例如，“红色电话亭”，“一家面包店”，“酒吧”），该应用就会返回伦敦范围内相关的街景全景图。\n\n提供的内容很少，仅表明运行该应用程序需要JavaScript。因此，摘要基于标题隐含的功能推断得出。 关键在于该应用提供了一种探索伦敦街景的新颖方式，利用基于文本的搜索代替传统的地图导航。"
  },
  {
    "id": "45996585",
    "title": "Data-at-Rest Encryption in DuckDB",
    "url": "https://duckdb.org/2025/11/19/encryption-in-duckdb",
    "summary": "This article provides a deep dive into data-at-rest encryption in DuckDB, starting with version 1.4.0. DuckDB utilizes industry-standard AES encryption (AES-GCM-256 and AES-CTR-256) for transparent encryption. The article explains the basics of AES encryption, including key concepts like plaintexts, initialization vectors (IVs), and the importance of unique nonces to prevent vulnerabilities.\n\nThe implementation in DuckDB involves encrypting most of the database file, except for the main database header, which contains metadata but no sensitive data. When encryption is enabled, a flag is set in the main header, along with additional metadata such as a database identifier (salt), encryption cipher details, and an encrypted canary to verify the key.\n\nDuckDB employs a key derivation function (KDF) to transform user-provided keys into more secure keys, which are then stored in a secure encryption key cache, preventing them from being swapped to disk. The article also details how the write-ahead log (WAL) and temporary files are encrypted, further enhancing data security. WAL entries are encrypted per value, while temporary files are encrypted either automatically when an encrypted database is attached or when a specific setting is enabled.\n\nThe article demonstrates how to encrypt existing databases, create new encrypted databases, and re-encrypt databases. Finally, it provides a method to verify encryption using entropy analysis tools and visual binary analysis, showing the difference between plaintext and encrypted database files. The article emphasizes that while DuckDB's encryption doesn't yet meet official NIST requirements, it provides a significant step towards securing data at rest.\n",
    "chinese_title": "DuckDB 静态数据加密",
    "chinese_summary": "DuckDB静态数据加密深度解析（1.4.0起）"
  },
  {
    "id": "45963350",
    "title": "Okta's NextJS-0auth troubles",
    "url": "https://joshua.hu/ai-slop-okta-nextjs-0auth-security-vulnerability",
    "summary": "The author, MegaManSec, reported two security vulnerabilities in Okta's auth0/nextjs-auth0 project. One, a parameter injection flaw, could lead to account hijacking. They submitted a simple patch via a pull request (PR).\n\nHowever, the PR was closed and replaced by another PR claiming to preserve contribution history. The new PR contained the same code but attributed it to \"Simen Olsen,\" a seemingly non-existent contributor.\n\nMegaManSec discovered that an auth0 maintainer, Tushar Pandey, used AI (CoPilot) to generate the patch, resulting in the incorrect attribution. The maintainer even used AI to apologize for the error in a now-deleted comment.\n\nDespite the author's request, the attribution in the commit history was not corrected. The author believes this is a copyright infringement. They are baffled by the AI's hallucination of a fake contributor, questioning the quality of the AI tooling used by auth0.\n\nAdding to the frustration, while the account hijacking vulnerability was fixed, Okta's security team initially refused to acknowledge it as a security issue without a video demonstration of the exploit. The author finds this absurd, especially considering the severity of the vulnerability.\n",
    "chinese_title": "Okta的NextJS-oauth问题",
    "chinese_summary": "MegaManSec报告了Okta的auth0/nextjs-auth0项目中存在的两个安全漏洞。其中一个参数注入漏洞可能导致账户劫持。他通过Pull Request (PR)提交了一个简单的补丁。\n\n然而，该PR被关闭，并被另一个声称保留贡献历史的PR取代。新的PR包含相同的代码，但将其归功于一个看似不存在的贡献者“Simen Olsen”。\n\nMegaManSec发现，auth0的维护者Tushar Pandey使用AI（CoPilot）生成了补丁，导致了错误的署名。该维护者甚至使用了AI在一条现已删除的评论中道歉。\n\n尽管作者提出要求，但提交历史中的署名并未更正。作者认为这是侵犯版权。他对AI虚构一个假贡献者感到困惑，质疑auth0使用的AI工具的质量。\n\n更令人沮丧的是，虽然账户劫持漏洞已被修复，但Okta的安全团队最初拒绝承认这是一个安全问题，除非提供该漏洞利用的视频演示。作者认为这很荒谬，尤其考虑到该漏洞的严重性。"
  },
  {
    "id": "45976693",
    "title": "Free interactive tool that shows you how PCIe lanes work on motherboards",
    "url": "https://mobomaps.com",
    "summary": "The article promotes \"MoboMaps - Motherboard PCIe Lanes,\" a free interactive tool designed to help users understand how PCIe lanes are configured on different motherboards. The tool allows users to filter motherboards based on various specifications, including:\n\n*   **Socket:** AM5\n*   **Brand:** MSI, ASUS, Gigabyte, ASRock\n*   **Chipset:** X870E, X870, B850\n*   **Form Factor:** E-ATX, ATX, mATX, Mini-ITX\n*   **Features:** WiFi, USB4, No GPU Lane Sharing\n*   **M.2 Slots:** Any\n*   **PCIe Slots:** Any\n*   **Price:** Any\n\nUsers can select their desired specifications, click \"Generate,\" and the tool will display relevant motherboards. The tool currently features 10 boards and includes a \"Live Filtering Active\" feature and a \"Reset Filters\" option. The core benefit is simplifying the often-complex process of understanding PCIe lane allocation across various motherboard configurations, enabling users to make informed hardware choices.\n",
    "chinese_title": "免费互动工具，展示主板上的PCIe通道如何工作",
    "chinese_summary": "文章推广一款名为“MoboMaps - 主板 PCIe 通道”的免费互动工具，该工具旨在帮助用户了解不同主板上的 PCIe 通道配置方式。用户可以使用该工具根据各种规格筛选主板，包括：\n\n*   **插槽：** AM5\n*   **品牌：** MSI, ASUS, Gigabyte, ASRock\n*   **芯片组：** X870E, X870, B850\n*   **板型：** E-ATX, ATX, mATX, Mini-ITX\n*   **功能：** WiFi, USB4, 无 GPU 通道共享\n*   **M.2 插槽：** 任意\n*   **PCIe 插槽：** 任意\n*   **价格：** 任意\n\n用户可以选择所需的规格，点击“生成”，该工具将显示相关的主板。该工具目前包含 10 个主板，并具有“实时筛选已启用”功能和“重置筛选器”选项。其核心优势在于简化了理解各种主板配置中 PCIe 通道分配的通常复杂的过程，从而使用户能够做出明智的硬件选择。"
  },
  {
    "id": "45995834",
    "title": "NTSB Preliminary Report – UPS Boeing MD-11F Crash [pdf]",
    "url": "https://www.ntsb.gov/Documents/Prelimiary%20Report%20DCA26MA024.pdf",
    "summary": "Given that the provided content states \"Page not found\" for the NTSB Preliminary Report on the UPS Boeing MD-11F crash, there is **no factual information available to summarize.**\n\nTherefore, I can only state:\n\nThe attempt to access the NTSB Preliminary Report on the UPS Boeing MD-11F crash resulted in a \"Page not found\" error, meaning the report is currently unavailable at that URL. Consequently, no information about the crash, its causes, or any preliminary findings can be summarized.\n",
    "chinese_title": "NTSB初步报告 – UPS波音MD-11F货机坠毁 [pdf]",
    "chinese_summary": "由于提供的资料显示UPS波音MD-11F坠机事故的NTSB初步报告“页面未找到”，因此**没有可用于总结的实际信息。**\n\n因此，我只能说明：\n\n尝试访问UPS波音MD-11F坠机事故的NTSB初步报告时出现“页面未找到”错误，这意味着该报告目前无法在该URL上获取。 因此，无法总结有关该坠机事故、其原因或任何初步调查结果的信息。"
  },
  {
    "id": "45991738",
    "title": "Adversarial poetry as a universal single-turn jailbreak mechanism in LLMs",
    "url": "https://arxiv.org/abs/2511.15304",
    "summary": "This arXiv article, submitted in November 2025, explores the vulnerability of Large Language Models (LLMs) to \"adversarial poetry\" as a universal single-turn jailbreak technique. The authors, led by Piercosma Bisconti, demonstrate that crafting prompts in a poetic style can effectively bypass the safety mechanisms of both proprietary and open-weight LLMs.\n\nTheir research involved testing 25 LLMs with curated poetic prompts, achieving high attack-success rates (ASR), exceeding 90% in some cases. These poetic attacks were mapped to risk taxonomies, revealing their effectiveness across diverse domains like CBRN, manipulation, cyber-offence, and loss-of-control. Converting 1,200 harmful prompts from the MLCommons dataset into verse via a standardized meta-prompt significantly increased ASRs, up to 18 times higher than prose baselines.\n\nThe study used an ensemble of open-weight LLM judges for evaluating outputs, with human validation on a subset. The results showed an average jailbreak success rate of 62% for handcrafted poems and 43% for meta-prompt conversions, surpassing non-poetic baselines.\n\nThe paper concludes that stylistic variation alone can circumvent current safety measures in LLMs, indicating a fundamental limitation in alignment methods and evaluation protocols. This highlights a systematic vulnerability across model families and training approaches, suggesting the need for more robust safety mechanisms that are less susceptible to stylistic manipulation.\n",
    "chinese_title": "对抗性诗歌：LLM中的通用单轮越狱机制",
    "chinese_summary": "这篇2025年11月提交的arXiv文章探讨了大型语言模型（LLMs）对“对抗性诗歌”作为一种通用单轮越狱技术的脆弱性。由Piercosma Bisconti领导的作者证明，以诗歌风格构建提示可以有效地绕过专有和开源LLMs的安全机制。\n\n他们的研究涉及使用精心设计的诗歌提示测试了25个LLMs，实现了高攻击成功率（ASR），在某些情况下超过90%。这些诗歌攻击被映射到风险分类中，揭示了它们在CBRN、操纵、网络犯罪和失控等不同领域的有效性。通过标准化的元提示将来自MLCommons数据集的1200个有害提示转换为诗句，显著提高了ASRs，高达散文基线的18倍。\n\n该研究使用开放权重LLM裁判的集合来评估输出，并对一个子集进行了人工验证。结果表明，手工制作的诗歌的平均越狱成功率为62%，元提示转换的平均越狱成功率为43%，超过了非诗歌基线。\n\n该论文的结论是，仅风格上的变化就可以规避当前LLMs的安全措施，表明对齐方法和评估协议存在根本性限制。这突显了跨模型系列和训练方法的系统性漏洞，表明需要更强大的安全机制，这些机制不易受到风格操纵的影响。"
  },
  {
    "id": "45995816",
    "title": "The Lions Operating System",
    "url": "https://lionsos.org",
    "summary": "LionsOS is an experimental operating system being developed by the Trustworthy Systems research group at UNSW Sydney. Built on the seL4 microkernel, its primary goal is to make seL4's security, performance, and reliability benefits more accessible. It's not a traditional OS, but a collection of composable components used to create custom operating systems tailored to specific tasks, assembled using the Microkit tool.\n\nKey principles guiding LionsOS development include: component connection via lock-free queues and model-checked signaling; a single-responsibility approach for components (e.g., drivers only handle hardware interfaces); virtualisers managing multiplexing and address translation; and minimal information sharing.\n\nThe system is static, lacking dynamic hardware adaptation or runtime component loading, although component swapping of the same type is supported for policy changes or virtual machine reboots. Currently under active research and development, LionsOS is not stable but available for experimentation. The project welcomes contributions, particularly in the form of new components. The sDDF design document outlines the system's principles in detail.\n",
    "chinese_title": "狮子操作系统",
    "chinese_summary": "LionsOS是由新南威尔士大学悉尼分校的可信系统研究小组正在开发的实验性操作系统。它构建于seL4微内核之上，其主要目标是使seL4的安全性、性能和可靠性优势更容易获得。它不是一个传统的操作系统，而是一系列可组合的组件，用于创建针对特定任务定制的操作系统，这些组件使用Microkit工具组装而成。\n\n指导LionsOS开发的 key principles 包括：通过无锁队列和模型检查的信令进行组件连接；组件的单一职责方法（例如，驱动程序仅处理硬件接口）；虚拟化器管理多路复用和地址转换；以及最小的信息共享。\n\n该系统是静态的，缺乏动态硬件适应或运行时组件加载，但支持相同类型的组件交换以进行策略更改或虚拟机重启。目前正在积极的研究和开发中，LionsOS不稳定但可用于实验。该项目欢迎贡献，特别是以新组件的形式。sDDF 设计文档详细概述了系统的原则。"
  },
  {
    "id": "45984461",
    "title": "Show HN: F32 – An Extremely Small ESP32 Board",
    "url": "https://github.com/PegorK/f32",
    "summary": "The f32 is an ultra-compact ESP32 development board designed to mount directly behind a USB-C receptacle, measuring only 9.85 mm x 8.45 mm. It's powered by the ESP32-C3FH4 microcontroller and intentionally ignores standard design guidelines, making it a research project and a stress test for the ESP32.\n\nThe board has one exposed GPIO connected to an onboard LED, making it suited for WiFi/web development. A captive portal application allows users to connect to the f32 via WiFi and control basic functions like toggling the LED and scanning for networks.\n\nInitial connectivity issues, likely due to poor antenna circuitry, were resolved by adding a small wire antenna. Line-of-sight tests achieved a range of roughly 120ft.\n\nThe PCB was designed using DipTrace and manufactured by PCBWay with specific specs including 0.6mm thickness, 0.2mm min hole size and 4/4mil min track/spacing, costing $10.75 for 5 boards. The author hand-assembled the board using tools like a Pinecil soldering iron, rework station, and digital microscope, providing a detailed build process including component ordering (DigiKey, Mouser, CrossAir), soldering tips and flashing instructions via esptool.py. Gerber and BOM files are provided.\n\nThe f32 is intended for personal research and learning, acknowledging that it lacks essential components like proper decoupling capacitors and an antenna matching circuit. Future improvements include exposing more GPIOs and improving the antenna circuitry.\n",
    "chinese_title": "Show HN: F32 – 极小 ESP32 开发板",
    "chinese_summary": "f32是一款超紧凑型ESP32开发板，设计用于直接安装在USB-C接口后，尺寸仅为9.85毫米 x 8.45毫米。它由ESP32-C3FH4微控制器驱动，并有意忽略标准设计指南，使其成为一个研究项目和ESP32的压力测试。\n\n该板有一个连接到板载LED的暴露GPIO，使其适用于WiFi/Web开发。一个强制门户应用程序允许用户通过WiFi连接到f32，并控制诸如切换LED和扫描网络等基本功能。\n\n最初的连接问题，可能是由于不良的天线电路引起的，通过添加一根小线天线得到解决。视线测试实现了大约120英尺的范围。\n\nPCB使用DipTrace设计，由PCBWay制造，具体规格包括0.6毫米厚度、0.2毫米最小孔径和4/4mil最小走线/间距，5块板的成本为10.75美元。作者使用Pinecil烙铁、返工台和数字显微镜等工具手工组装了该板，并提供了详细的构建过程，包括组件订购（DigiKey、Mouser、CrossAir）、焊接技巧和通过esptool.py刷写固件的说明。提供了Gerber和BOM文件。\n\nf32旨在用于个人研究和学习，并承认它缺少诸如适当的去耦电容和天线匹配电路等基本组件。未来的改进包括暴露更多的GPIO并改进天线电路。"
  },
  {
    "id": "46006144",
    "title": "A Brief, Incomplete, and Mostly Wrong History of Programming Languages",
    "url": "http://james-iry.blogspot.com/2009/05/brief-incomplete-and-mostly-wrong.html",
    "summary": "This article offers a humorously inaccurate \"history\" of programming languages, skewering common perceptions and perceived flaws of various languages and their creators.\n\nIt begins with exaggerated origins, like Jacquard weaving \"hello, world\" on a loom, and Ada Lovelace programming without a computer. Key figures like Turing and Church are portrayed as inventing all languages, but their work being ignored or misunderstood.\n\nThe article then mocks specific languages. FORTRAN is associated with IBM conformity, LISP suffers from a \"parentheses shortage,\" and COBOL is a punishment for a lost bet. BASIC is for non-programmers, while Pascal's syntax is criticized even before C exists. C's creation is linked to a dangerous invention by Dennis Ritchie.\n\nLater languages face similar humorous criticism. Smalltalk's \"object-oriented\" nature is endlessly recursive, Ada is a government jobs program, and C++ is so complex it needs Skynet to compile. Perl is divinely inspired after Larry Wall hits his head on a keyboard, and Haskell uses monads that confuse everyone. Python's creator is declared a \"Dictator for Life,\" PHP is inspired by spaghetti, and the naming of JavaScript is ridiculed. Finally, Java and C# are mocked for their lack of true novelty, while Scala's attempt to combine functional and object-oriented programming provokes outrage.\n",
    "chinese_title": "编程语言简短、不完整且大错特错的历史",
    "chinese_summary": "本文以幽默的方式对编程语言的“历史”进行了不准确的描述，讽刺了人们对各种语言及其创建者的普遍认知和 perceived 的缺陷。\n\n文章从夸张的起源开始，比如 Jacquard 在织布机上编织“hello, world”，以及 Ada Lovelace 在没有计算机的情况下进行编程。 像图灵和丘奇这样的关键人物被描绘成发明了所有语言，但他们的工作却被忽视或误解。\n\n然后，文章嘲讽了特定的语言。 FORTRAN 与 IBM 的一致性相关联，LISP 遭受“括号短缺”之苦，COBOL 则是输掉赌注的惩罚。 BASIC 适用于非程序员，而 Pascal 的语法甚至在 C 语言出现之前就受到了批评。 C 语言的创建与 Dennis Ritchie 的一项危险发明有关。\n\n后来的语言也面临类似的幽默批评。 Smalltalk 的“面向对象”本质是无休止的递归，Ada 是一项政府就业计划，而 C++ 是如此复杂以至于需要 Skynet 来编译。 Perl 是 Larry Wall 的头部撞击键盘后获得的灵感，而 Haskell 使用的 monad 使所有人感到困惑。 Python 的创建者被宣布为“终身独裁者”，PHP 的灵感来自意大利面，而 JavaScript 的命名则受到了嘲笑。 最后，Java 和 C# 因缺乏真正的创新而受到嘲笑，而 Scala 试图结合函数式和面向对象编程的做法则引起了强烈抗议。"
  },
  {
    "id": "45957743",
    "title": "Two recently found works of J.S. Bach presented in Leipzig [video]",
    "url": "https://www.youtube.com/watch?v=4hXzUGYIL9M#t=15m19s",
    "summary": "This is a very short piece of information. It points to a YouTube video about two newly discovered works by J.S. Bach that were presented in Leipzig. The rest of the text is standard YouTube copyright information, disclaimers, and navigational links.\n\nEssentially, the core content is the announcement of a YouTube video concerning the presentation of two recently found musical works attributed to Johann Sebastian Bach in Leipzig.\n",
    "chinese_title": "莱比锡呈现：新发现的两部巴赫作品[视频]",
    "chinese_summary": "这是一则简短信息，指向一个关于J.S.巴赫两部新发现作品在莱比锡展示的YouTube视频。其余为标准的YouTube版权信息、免责声明和导航链接。\n\n核心内容是宣布一个关于约翰·塞巴斯蒂安·巴赫两部近期发现的音乐作品在莱比锡展示的YouTube视频。"
  },
  {
    "id": "45890876",
    "title": "Historical Reasons",
    "url": "https://exple.tive.org/blarg/2025/11/11/historical-reasons-2/",
    "summary": "The author reflects on an idea they had in 2011, following the death of Dennis Ritchie, to honor significant figures in computing history by retiring their usernames on Unix systems. Inspired by sports teams retiring jersey numbers, the author proposed a patch to `useradd.c` that would prevent new users from claiming these historically important usernames.\n\nWhile the patch was rejected, the author ran a modified version locally, contemplating the potential for integrating cultural history into common codebases. They envisioned a system where history subtly accumulates through \"touchstones of human history,\" not in critical functionality but in symbolic remembrance.\n\nThe core idea is that just as certain numbers are unavailable in sports to honor legends, usernames associated with key figures in computing, like \"dmr\" (Dennis Ritchie's username), should become unavailable to prevent others from using them. This seeks to create a tangible link to the past and a shared heritage within the computing community. The author ponders what a deeper cultural history built into a common codebase might achieve over time.\n",
    "chinese_title": "历史原因",
    "chinese_summary": "作者回顾了 2011 年丹尼斯·里奇去世后产生的一个想法：通过在 Unix 系统上停用他们的用户名来纪念计算机历史上的重要人物。受运动队退役球衣号码的启发，作者提出了一个针对 `useradd.c` 的补丁，该补丁将阻止新用户声明这些具有历史意义的用户名。\n\n虽然该补丁被拒绝了，但作者在本地运行了一个修改后的版本，思考了将文化历史融入通用代码库的可能性。他们设想了一个系统，历史通过“人类历史的试金石”微妙地积累，不在关键功能中，而在于象征性的纪念中。\n\n核心思想是，正如某些号码在体育运动中不可用以纪念传奇人物一样，与计算机领域关键人物相关的用户名，例如“dmr”（丹尼斯·里奇的用户名），也应该变得不可用，以防止他人使用。这旨在创建与过去的有形联系以及计算机社区内的共同遗产。作者思考了长期来看，构建到通用代码库中的更深层次的文化历史可能实现什么。"
  },
  {
    "id": "46002989",
    "title": "HP and Dell disable HEVC support built into their laptops' CPUs",
    "url": "https://arstechnica.com/gadgets/2025/11/hp-and-dell-disable-hevc-support-built-into-their-laptops-cpus/",
    "summary": "HP and Dell have disabled HEVC (H.265) hardware decoding on some of their popular business laptops, despite processors having built-in support for the codec. This means some users are experiencing issues playing HEVC content in web browsers.\n\nHP discloses this limitation in the data sheets of affected ProBook and EliteBook models. Dell's documentation is less clear, but they state that HEVC support is generally limited to systems with discrete graphics cards, 4K displays, Dolby Vision, or CyberLink Blu-ray players.\n\nThe companies didn't explicitly explain their reasoning, but it's speculated that this move is driven by a desire to minimize HEVC licensing costs, which are increasing. Both HP and Dell suggested users needing HEVC support can utilize third-party software solutions or purchase systems specifically designed for 4K or high-performance needs.\n\nThe decision is controversial, particularly for users who expect such functionality on modern \"Pro\" line laptops costing over $800. The change can degrade performance in other applications that rely on hardware acceleration and create confusion as features that have been widely available for years are removed. Synology also cited reducing \"unnecessary resource usage on the server and significantly improves media processing efficiency\" as their reason for ending support for HEVC.\n",
    "chinese_title": "惠普和戴尔禁用其笔记本电脑CPU内置的HEVC支持",
    "chinese_summary": "HP和戴尔已在其部分畅销商务笔记本电脑上禁用了HEVC (H.265)硬件解码功能，尽管这些电脑的处理器内置了对该编解码器的支持。这意味着一些用户在使用网络浏览器播放HEVC内容时遇到了问题。\n\nHP在其受影响的ProBook和EliteBook型号的数据表中披露了这一限制。戴尔的文档不太明确，但他们表示HEVC支持通常仅限于配备独立显卡、4K显示器、杜比视界或CyberLink Blu-ray播放器的系统。\n\n两家公司都没有明确解释其原因，但据推测，此举是出于尽量减少不断上涨的HEVC许可费的考虑。HP和戴尔都建议需要HEVC支持的用户可以利用第三方软件解决方案，或购买专门为4K或高性能需求设计的系统。\n\n这个决定引起了争议，特别是对于那些期望在售价超过800美元的现代“Pro”系列笔记本电脑上拥有此功能的用户而言。这一改变可能会降低依赖硬件加速的其他应用程序的性能，并造成困惑，因为多年前广泛使用的功能被移除。群晖也表示，停止支持HEVC的原因是减少“服务器上不必要的资源使用，并显著提高媒体处理效率”。"
  },
  {
    "id": "45958988",
    "title": "Show HN: My hobby OS that runs Minecraft",
    "url": "https://astral-os.org/posts/2025/10/31/astral-minecraft.html",
    "summary": "This \"Show HN\" post details the author's successful effort in porting and running Minecraft Alpha 1.2.0 on their hobby operating system, Astral. The author highlights the significant milestone of running a complex game like Minecraft on a homebrew OS, demonstrating the system's graphical capabilities, performance, and stability.\n\nThe post outlines the challenges involved, including Minecraft's Java-based nature, its reliance on OpenGL, and its dependencies on various Java libraries. The author recounts fixing a previously broken OpenJDK 17 port, debugging a segmentation fault related to `sscanf(3)` in mlibc.\n\nA major part of the project was porting LWJGL2 (Lightweight Java Game Library), which involved extensive patching of the Apache Ant build system for cross-compilation. The author collaborated with Dennis Bonke to achieve the same result on the Managarm OS.\n\nThe debugging process involved resolving issues like missing symbols, incorrect headers during cross-compilation, and an `ArrayIndexOutOfBoundsException` related to XRandR and FIONREAD implementation for pipe objects in Astral. After fixing these issues, they successfully launched Minecraft and verified its functionality, including gameplay and saving.\n\nThe author believes this accomplishment marks a significant achievement for the OSDev community and paves the way for future ports. Future plans for Astral include enhancing self-hosting capabilities, improving speed and stability, releasing an \"Astral from scratch\" guide, reviving the Wine port, and potentially porting WebKitGTK.\n",
    "chinese_title": "展示一下：我那个能运行Minecraft的个人爱好操作系统",
    "chinese_summary": "此“Show HN”帖子详细介绍了作者成功地将 Minecraft Alpha 1.2.0 移植并在其业余操作系统 Astral 上运行的成果。作者强调了在自制操作系统上运行像 Minecraft 这样复杂的游戏这一重要里程碑，展示了该系统的图形功能、性能和稳定性。\n\n该帖子概述了所涉及的挑战，包括 Minecraft 基于 Java 的特性、对 OpenGL 的依赖以及对各种 Java 库的依赖。作者回顾了修复之前损坏的 OpenJDK 17 移植版本，以及调试与 mlibc 中的 `sscanf(3)` 相关的段错误。\n\n该项目的一个主要部分是移植 LWJGL2（轻量级 Java 游戏库），这涉及对 Apache Ant 构建系统进行广泛的修补以进行交叉编译。作者与 Dennis Bonke 合作，在 Managarm OS 上实现了相同的结果。\n\n调试过程包括解决诸如缺少符号、交叉编译期间的错误头文件以及与 Astral 中管道对象的 XRandr 和 FIONREAD 实现相关的 `ArrayIndexOutOfBoundsException` 等问题。修复这些问题后，他们成功启动了 Minecraft 并验证了其功能，包括游戏玩法和保存。\n\n作者认为，这一成就标志着 OSDev 社区的一项重大成就，并为未来的移植铺平了道路。Astral 的未来计划包括增强自托管能力，提高速度和稳定性，发布“从零开始构建 Astral”指南，恢复 Wine 移植，并可能移植 WebKitGTK。"
  },
  {
    "id": "45990934",
    "title": "Interactive World History Atlas Since 3000 BC",
    "url": "http://geacron.com/home-en/",
    "summary": "This article introduces an \"Interactive World History Atlas since 3000 BC,\" a resource offering historical maps and timelines. The key features include coverage of kingdoms, battles, and expeditions throughout world history. The atlas aims to provide a comparative historical perspective, encompassing political, military, artistic, scientific, literary, religious, and philosophical developments. Importantly, the maps are based on a vector database, likely allowing for detailed zooming and manipulation of the historical data presented. In essence, this is an interactive tool designed to explore and understand world history through a combination of maps and timelines, covering a broad range of topics from ancient times to the present.\n",
    "chinese_title": "公元前3000年至今互动世界历史地图集",
    "chinese_summary": "本文介绍“公元前3000年以来的互动世界历史地图集”，该资源提供历史地图和时间线。主要特点包括涵盖世界历史上的王国、战役和探险活动。该地图集旨在提供一个比较历史的视角，涵盖政治、军事、艺术、科学、文学、宗教和哲学的发展。重要的是，这些地图基于矢量数据库，可能允许对所呈现的历史数据进行详细的缩放和操作。 本质上，这是一个互动工具，旨在通过地图和时间线的结合来探索和理解世界历史，涵盖从古代到现在广泛的主题。"
  },
  {
    "id": "45996860",
    "title": "CBP is monitoring US drivers and detaining those with suspicious travel patterns",
    "url": "https://apnews.com/article/immigration-border-patrol-surveillance-drivers-ice-trump-9f5d05469ce8c629d6fecf32d32098cd",
    "summary": "The U.S. Border Patrol is operating a secretive program that monitors millions of American drivers nationwide using license plate readers and predictive algorithms to identify and detain individuals whose travel patterns are deemed suspicious. This program, initially aimed at combating border-related crimes, has expanded significantly, extending surveillance far into the U.S. interior and impacting ordinary citizens.\n\nThe Border Patrol collaborates with other agencies, including the DEA and local law enforcement, to gather and share license plate data. This data, coupled with facial recognition technology in some cases, is used to flag vehicles for stops, often for minor traffic violations, allowing officers to aggressively question and search drivers.\n\nThe article highlights instances where drivers were stopped based on Border Patrol's suspicions, despite having committed no crime. In one case, a trucking company driver was detained and interrogated for carrying cash, while in another, a man was pulled over after an overnight trip near the border. These examples demonstrate how seemingly innocuous travel patterns can trigger invasive surveillance.\n\nCritics argue that this mass surveillance network violates the Fourth Amendment and raises concerns about the erosion of privacy. They contend that the program collects excessive amounts of personal information, treating ordinary Americans as potential suspects and creating a chilling effect on freedom of movement. While CBP defends the program as necessary for national security, its scope and impact raise significant civil liberties concerns.\n",
    "chinese_title": "美国海关与边境保护局正在监控美国司机并拘留那些有可疑旅行模式的人。",
    "chinese_summary": "美国边境巡逻队运作一项秘密计划，该计划利用车牌读取器和预测算法监控全国数百万美国司机，以识别和拘留那些出行模式被认为可疑的个人。这项计划最初旨在打击与边境相关的犯罪，但已显著扩展，将监控范围远远延伸至美国内陆，并影响到普通公民。\n\n边境巡逻队与其他机构合作，包括缉毒署和地方执法部门，以收集和分享车牌数据。这些数据，在某些情况下与面部识别技术相结合，被用于标记车辆以进行拦截，通常是因为轻微的交通违规行为，从而使警官能够积极盘问和搜查司机。\n\n文章重点介绍了司机因边境巡逻队的怀疑而被拦截的案例，尽管他们没有犯任何罪行。在一个案例中，一名货运公司司机因携带现金而被拘留和审问，而在另一个案例中，一名男子在边境附近的过夜旅行后被拦下。这些例子表明，看似无害的出行模式是如何触发侵入式监控的。\n\n批评人士认为，这种大规模监控网络违反了第四修正案，并引发了对隐私权受到侵蚀的担忧。他们辩称，该计划收集了过量的个人信息，将普通美国人视为潜在嫌疑人，并对行动自由产生了寒蝉效应。虽然美国海关与边境保护局辩称该计划对国家安全是必要的，但其范围和影响引发了重大的公民自由问题。"
  },
  {
    "id": "45998047",
    "title": "GitHut – Programming Languages and GitHub (2014)",
    "url": "https://githut.info/",
    "summary": "GitHut is a project launched in 2014 aiming to visualize and explore the usage of programming languages on GitHub, the largest code hosting platform with 3.4 million users. The project analyzes GitHub data to understand the popularity and characteristics of different programming languages among developers.\n\nThe data for GitHut is sourced from the GitHub Archive, which aggregates publicly available GitHub data, and is updated quarterly. Notably, the project relies on activity levels (number of changes pushed) as the primary metric for language popularity due to limitations in identifying language usage for newly created repositories. The release year of each programming language is based on Wikipedia's \"Timeline of programming languages.\"\n\nGitHut's goal is to offer a language-centric view of active repositories on GitHub. It allows users to explore languages based on total activity or percentage of total activity, providing insights into language trends and usage patterns within the open-source community. The project also highlights how observing language history reflects humankind's pursuit of better problem-solving, collaboration, and code reuse. The methodology for data collection is available on the GitHut's GitHub repository. Created by Carlo Zapponi, the project is licensed under a Creative Commons BY-NC-SA License.\n",
    "chinese_title": "GitHut – 编程语言与GitHub (2014)",
    "chinese_summary": "GitHut是一个于2014年启动的项目，旨在可视化和探索GitHub上编程语言的使用情况。GitHub是最大的代码托管平台，拥有340万用户。该项目分析GitHub数据，以了解开发者对不同编程语言的受欢迎程度和特点。\n\nGitHut的数据来源于GitHub Archive，它汇集了公开的GitHub数据，并按季度更新。值得注意的是，由于难以识别新创建存储库的语言使用情况，该项目主要依靠活跃度（推送的更改数量）作为衡量语言受欢迎程度的主要指标。每种编程语言的发布年份基于维基百科的“编程语言时间线”。\n\nGitHut的目标是提供以语言为中心的GitHub活跃存储库视图。它允许用户根据总活动或总活动百分比来探索语言，从而深入了解开源社区中的语言趋势和使用模式。该项目还强调了观察语言历史如何反映人类对更好解决问题、协作和代码重用的追求。数据收集方法可在GitHut的GitHub存储库上找到。该项目由Carlo Zapponi创建，并以Creative Commons BY-NC-SA许可协议发布。"
  },
  {
    "id": "45995740",
    "title": "Microsoft makes Zork open-source",
    "url": "https://opensource.microsoft.com/blog/2025/11/20/preserving-code-that-shaped-generations-zork-i-ii-and-iii-go-open-source",
    "summary": "Microsoft, in collaboration with Activision and the Open Source Programs Office (OSPO), has released the source code for Zork I, Zork II, and Zork III under the MIT License. This move aims to preserve a significant piece of gaming history and make it accessible for educational purposes, allowing students, teachers, and developers to study, learn from, and play the games.\n\nThe article highlights Zork's impact as a text-based adventure game that emphasized imagination and clever engineering through the Z-Machine, a custom-built virtual machine. The Z-Machine enabled cross-platform compatibility, making Zork available on various early home computers.\n\nThe release focuses on the source code, accompanied by available documentation and clear MIT licensing, while excluding commercial packaging, marketing materials, and trademark rights. The existing historical repositories will serve as the main hub for Zork's source code, and contributions are welcomed to aid in its preservation and educational value. The goal is not to modernize Zork but to maintain it as a resource for exploration and education. The article also provides guidance on how to run the games locally using modern Z-Machine interpreters like ZILF and ZLR.\n",
    "chinese_title": "微软将Zork开源。",
    "chinese_summary": "微软与动视和开源项目办公室(OSPO)合作，已根据 MIT 许可证发布了 Zork I、Zork II 和 Zork III 的源代码。此举旨在保护游戏史上的一项重要遗产，并使其可用于教育目的，让学生、教师和开发者能够学习、研究和玩这些游戏。\n\n文章强调了 Zork 作为一款基于文本的冒险游戏的影响，它通过 Z-Machine（一种定制的虚拟机）强调了想象力和巧妙的工程设计。Z-Machine 实现了跨平台兼容性，使 Zork 能够在各种早期的家用电脑上运行。\n\n此次发布侧重于源代码，并附有可用的文档和清晰的 MIT 许可，但不包括商业包装、营销材料和商标权。现有的历史仓库将作为 Zork 源代码的主要中心，并欢迎贡献，以帮助其保存和教育价值。目的不是使 Zork 现代化，而是将其作为探索和教育的资源进行维护。文章还提供了关于如何使用现代 Z-Machine 解释器（如 ZILF 和 ZLR）在本地运行游戏的指南。"
  },
  {
    "id": "46005549",
    "title": "CDC to end all monkey research; will phase out HIV, infectious disease studies",
    "url": "https://www.science.org/content/article/exclusive-cdc-end-all-monkey-research",
    "summary": "The article reports that the Centers for Disease Control and Prevention (CDC) will end all of its monkey research, phasing out existing studies on HIV and other infectious diseases. This decision follows years of pressure from animal welfare organizations and investigations highlighting concerns about animal care practices at the CDC's primate research facilities.\n\nThe CDC cited evolving research priorities and the availability of alternative research methods as reasons for the decision. They plan to shift their focus towards areas such as advanced molecular detection, bioinformatics, and mathematical modeling to study and combat infectious diseases. The agency emphasizes that it will still use animal models in its research, but no longer primates.\n\nThe phase-out is expected to take several years, with existing monkey research projects being either terminated or transitioned to other institutions. The CDC will work to rehome the monkeys to sanctuaries or other suitable facilities. Animal welfare groups are celebrating the decision as a major victory, while some researchers express concerns about the potential impact on the agency's ability to effectively study and respond to emerging infectious diseases. The article highlights the ongoing debate about the ethics and necessity of primate research in biomedical science.\n",
    "chinese_title": "疾控中心将停止所有猴子研究；将逐步停止艾滋病毒、传染病研究",
    "chinese_summary": "疾控中心将停止所有猴子研究，转而关注先进技术"
  },
  {
    "id": "46005402",
    "title": "Git 3.0 Defaults to \"main\" Branch Instead of \"master",
    "url": "https://www.phoronix.com/news/Git-2.52-Released",
    "summary": "This article discusses the release of Git 2.52 and previews upcoming changes expected in Git 3.0, anticipated to be released by the end of 2026.\n\nGit 2.52 focuses on preparing for Git 3.0, specifically with regard to:\n\n*   **SHA1-SHA256 Interoperability:** Git 2.52 introduces initial work towards SHA1-SHA256 interoperability, a key goal for Git 3.0. The aim is to have a smooth transition and experience for users.\n*   **Default Branch Name Change:** Git 3.0 will default to using \"main\" as the initial branch name instead of \"master\". Git 2.52 introduces helpful hints for users adapting to this change, including instructions on how to rename the branch to \"master\" if needed, to align with existing documentation.\n\nIn addition to preparing for Git 3.0, Git 2.52 includes:\n\n*   Improvements to various Git sub-commands.\n*   A new \"git repo\" sub-command for repository characteristics.\n*   A new \"git last-modified\" sub-command to identify the last ancestor commit for each path.\n*   Performance enhancements and other general improvements.\n\nMore details are available in the official Git 2.52 release announcement and on the GitHub Blog.\n",
    "chinese_title": "Git 3.0 默认使用 \"main\" 分支而非 \"master\"",
    "chinese_summary": "本文讨论了 Git 2.52 的发布，并预览了预计在 2026 年底发布的 Git 3.0 中即将到来的变更。\n\nGit 2.52 的重点是为 Git 3.0 做准备，特别是以下方面：\n\n*   **SHA1-SHA256 互操作性：** Git 2.52 引入了 SHA1-SHA256 互操作性的初步工作，这是 Git 3.0 的一个关键目标。 目标是为用户提供平稳的过渡和体验。\n*   **默认分支名称更改：** Git 3.0 将默认使用 \"main\" 作为初始分支名称，而不是 \"master\"。 Git 2.52 为用户适应此更改引入了有用的提示，包括在需要时如何将分支重命名为 \"master\" 以与现有文档保持一致的说明。\n\n除了为 Git 3.0 做准备之外，Git 2.52 还包括：\n\n*   对各种 Git 子命令的改进。\n*   用于存储库特征的新的 \"git repo\" 子命令。\n*   用于识别每个路径的最后一个祖先提交的新的 \"git last-modified\" 子命令。\n*   性能增强和其他一般改进。\n\n更多详细信息请参见 Git 2.52 的官方发布公告和 GitHub 博客。"
  },
  {
    "id": "45947437",
    "title": "CUDA Ontology",
    "url": "https://jamesakl.com/posts/cuda-ontology/",
    "summary": "This article provides a comprehensive ontology of CUDA, clarifying its often overloaded terminology and outlining the structure of the CUDA ecosystem. Key disambiguations include differentiating between CUDA as a compute architecture, instruction set, source language, Toolkit, and Runtime. It also distinguishes between OS kernel and CUDA kernel, and different meanings of \"driver\" (NVIDIA GPU driver vs. CUDA Driver API).\n\nThe article details the layered architecture of CUDA, spanning user-space (applications, `libcudart`, `libcuda`) and kernel-space (NVIDIA GPU driver), culminating in GPU hardware interaction. It emphasizes the roles of components like `libcudart` (Runtime API) and `libcuda` (Driver API), and highlights the distinction between build-time and execution-time dependencies (e.g., `nvcc` vs. `libcuda`).\n\nCrucially, the article explains CUDA's independent versioning schemes: compute capability (hardware feature set), GPU driver version, CUDA Toolkit version, CUDA Runtime API version, and CUDA Driver API version. It explains the function of PTX, an intermediate representation for CUDA code that allows for forward compatibility across hardware with different compute capabilities via JIT compilation.\n\nVersion compatibility rules are explicitly defined, emphasizing forward compatibility (newer drivers supporting older runtime versions) and the lack of backward compatibility (older drivers not supporting newer runtime versions). The article concludes by detailing how PyTorch reports CUDA versions and how to ensure version compatibility for proper execution.\n",
    "chinese_title": "CUDA本体",
    "chinese_summary": "本文提供了一个全面的CUDA本体论，阐明了其经常过载的术语，并概述了CUDA生态系统的结构。 主要消歧包括区分CUDA作为计算架构、指令集、源语言、工具包和运行时。它还区分了操作系统内核和CUDA内核，以及“驱动程序”的不同含义（NVIDIA GPU驱动程序与CUDA驱动程序API）。\n\n本文详细介绍了CUDA的分层架构，涵盖用户空间（应用程序、`libcudart`、`libcuda`）和内核空间（NVIDIA GPU驱动程序），最终实现GPU硬件交互。 它强调了`libcudart`（运行时API）和`libcuda`（驱动程序API）等组件的作用，并突出了构建时和执行时依赖项之间的区别（例如，`nvcc` 与 `libcuda`）。\n\n至关重要的是，本文解释了CUDA独立的版本控制方案：计算能力（硬件功能集）、GPU驱动程序版本、CUDA工具包版本、CUDA运行时API版本和CUDA驱动程序API版本。它解释了PTX的功能，PTX是CUDA代码的中间表示形式，允许通过JIT编译在具有不同计算能力的硬件上实现向前兼容。\n\n明确定义了版本兼容性规则，强调了向前兼容性（较新的驱动程序支持较旧的运行时版本）和缺乏向后兼容性（较旧的驱动程序不支持较新的运行时版本）。文章最后详细介绍了PyTorch如何报告CUDA版本，以及如何确保版本兼容性以实现正确执行。"
  },
  {
    "id": "46004105",
    "title": "SEC dismisses case against SolarWinds, top security officer",
    "url": "https://www.reuters.com/legal/government/us-sec-dismisses-case-against-solarwinds-top-security-officer-2025-11-20/",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "美国证券交易委员会驳回对SolarWinds及其首席安全官的诉讼",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "45989329",
    "title": "Basalt Woven Textile",
    "url": "https://materialdistrict.com/material/basalt-woven-textile/",
    "summary": "Basalt Woven Textile is a unique material made from melted basalt rock extruded into filaments, resulting in strong and versatile fibers. Produced by Vulkan Europe, it boasts a tensile strength more than twice that of steel.\n\nKey features include:\n\n*   **High Strength & Durability:** Exceptional tensile strength, outperforming both steel and glass fiber in specific strength.\n*   **Resistance:** High resistance to corrosion, chemicals, salt, acids, and alkalis. Good fire, UV, and weather resistance, as well as scratch resistance.\n*   **Temperature Resistance:** Can withstand temperatures up to 700°C (and up to 800°C with specific compositions), making it suitable for heat-insulating applications.\n*   **Electrical Properties:** Possesses high electric-insulating characteristics and electromagnetic radiation transparency, enabling its use in low and high-voltage equipment.\n*   **Sensory Properties:** Characterized by a satin glossiness, smooth texture, warm temperature, and no odor.\n\nThe material's unique properties open possibilities for various applications requiring strength, durability, and resistance to harsh conditions, alongside electrical insulation.\n",
    "chinese_title": "玄武岩编织物",
    "chinese_summary": "玄武岩编织物是由熔融玄武岩岩石挤压成丝制成的独特材料，具有强度高、用途广泛的特性。由Vulkan Europe生产，其抗拉强度是钢的两倍以上。\n\n主要特点包括：\n\n*   **高强度与耐用性：** 卓越的抗拉强度，在比强度方面优于钢和玻璃纤维。\n*   **耐腐蚀性：** 高度耐腐蚀、耐化学品、耐盐、耐酸碱。良好的防火、抗紫外线、耐候和耐刮擦性能。\n*   **耐温性：** 可承受高达700°C的温度（特定成分高达800°C），适用于隔热应用。\n*   **电气性能：** 具有高绝缘特性和电磁辐射透明性，使其可用于低压和高压设备。\n*   **感官特性：** 具有缎面光泽、光滑质地、温暖触感且无气味。\n\n该材料的独特性能为各种需要强度、耐久性、耐恶劣条件以及电绝缘的应用开辟了可能性。"
  },
  {
    "id": "45991853",
    "title": "Red Alert 2 in web browser",
    "url": "https://chronodivide.com/",
    "summary": "\"Red Alert 2: Chrono Divide\" is a fan-made project aiming to recreate the classic \"Red Alert 2\" RTS game within a web browser. This allows users to play the game without installing any additional software, making it cross-platform compatible on various devices including mobiles and tablets.\n\nThe project started as an experiment to prove the feasibility of a browser-based RTS game, and now aims to achieve feature parity with the original vanilla \"Red Alert 2.\" The beta version is currently playable and includes multiplayer functionality, all original maps, and more.\n\nKey features of Chrono Divide include cross-platform compatibility, a client-server model to improve connectivity, a modern game client with customizable controls and replay functionality, and modding support. The game supports modern browsers like Chrome, Firefox, Edge, and Safari, but Firefox is not recommended for optimal performance. Specific minimum and recommended PC specifications are listed, including CPU, OS, memory, GPU, and display resolution requirements.\n\nThe project relies on community support through donations to cover infrastructure costs and future development. While not required, donations are greatly appreciated.\n",
    "chinese_title": "网页版红色警戒2",
    "chinese_summary": "红色警戒2：时空裂痕 是一个粉丝自制项目，旨在网页浏览器中重现经典RTS游戏《红色警戒2》。这使得用户无需安装任何额外软件即可游玩该游戏，从而使其在包括手机和平板电脑在内的各种设备上实现跨平台兼容。\n\n该项目最初是一个实验，旨在证明基于浏览器的RTS游戏的可行性，现在目标是实现与原版《红色警戒2》相同的功能。 目前Beta版本已可玩，包括多人游戏功能、所有原始地图等等。\n\n时空裂痕的关键特性包括跨平台兼容性、用于改善连接的客户端-服务器模型、具有可自定义控件和回放功能的现代游戏客户端以及Mod支持。该游戏支持Chrome、Firefox、Edge和Safari等现代浏览器，但不建议使用Firefox以获得最佳性能。 列出了具体的最低和推荐PC配置，包括CPU、操作系统、内存、GPU和显示分辨率要求。\n\n该项目依赖于社区捐款来支付基础设施成本和未来的开发。 虽然不是必需的，但我们非常感谢您的捐款。"
  },
  {
    "id": "45993214",
    "title": "Freer Monads, More Extensible Effects (2015) [pdf]",
    "url": "https://okmij.org/ftp/Haskell/extensible/more.pdf",
    "summary": "The provided text appears to be a PDF document containing the text of a research article titled \"Freer Monads, More Extensible Effects\" (2015). However, the provided text is encoded as a raw stream of PDF content (likely compressed) and is not directly readable.\n\nBecause I cannot directly interpret the human-readable content within the PDF stream, I cannot provide an accurate summary of the article's content. To summarize the article, I would need access to a properly rendered version of the text.\n",
    "chinese_title": "自由Monad，更可扩展的效果 (2015) [pdf]",
    "chinese_summary": "提供的文本似乎是一个PDF文档，其中包含一篇名为“更自由的Monad，更具扩展性的效果”（2015年）的研究文章的文本。然而，提供的文本被编码为PDF内容的原始流（可能是压缩的），无法直接读取。\n\n由于我无法直接解释PDF流中的可读内容，因此我无法提供该文章内容的准确摘要。为了总结这篇文章，我需要访问一个正确呈现的文本版本。"
  },
  {
    "id": "45994895",
    "title": "Go Cryptography State of the Union",
    "url": "https://words.filippo.io/2025-state/",
    "summary": "This Go Cryptography State of the Union for 2025 highlights advancements in secure application development using Go's cryptography libraries. Key achievements include the implementation of post-quantum key exchanges, resolving FIPS 140 compliance, and maintaining a strong security track record.\n\nRegarding security, the Go cryptography packages have shown continuous improvement in vulnerability management, as measured by the informal \"Filippo's unhappiness score\" and evidenced by a security audit from Trail of Bits that found no vulnerabilities in the foundational libraries.\n\nA major update is the integration of ML-KEM, a post-quantum key exchange algorithm, into crypto/tls and x/crypto/ssh. These libraries now default to a hybrid approach of X25519 and ML-KEM-768, enhancing security against future quantum computing threats. Digital signatures are being approached more cautiously due to size constraints and protocol evolution needs.\n\nFIPS 140 compliance has been achieved natively in Go through the FIPS 140-3 Go Cryptographic Module. This module uses internal Go packages for FIPS 140 algorithms and includes a runtime mode for self-tests and compliance. Extensive testing was conducted across various platforms (including FreeBSD, macOS, and Windows), even employing unconventional testing setups like using personal devices, to ensure FIPS 140 compliance. Efforts were made to exceed FIPS 140 requirements without compromising security, such as enhancing randomness generation and addressing potential vulnerabilities in ECDSA.\n",
    "chinese_title": "Go 语言密码学现状",
    "chinese_summary": "2025年Go密码学现状：本文重点介绍了使用Go密码学库进行安全应用开发方面的进展。主要成就包括实施后量子密钥交换、解决FIPS 140合规性以及保持强大的安全记录。\n\n在安全性方面，Go密码学包在漏洞管理方面表现出持续改进，这可以从非正式的“Filippo的不快乐指数”中衡量，并由Trail of Bits的安全审计证明，该审计在基础库中未发现任何漏洞。\n\n一个重大更新是将后量子密钥交换算法ML-KEM集成到crypto/tls和x/crypto/ssh中。这些库现在默认采用X25519和ML-KEM-768的混合方法，从而增强了针对未来量子计算威胁的安全性。由于大小限制和协议演进需求，数字签名正以更谨慎的方式处理。\n\n通过FIPS 140-3 Go密码学模块，Go已原生实现FIPS 140合规性。该模块使用内部Go包进行FIPS 140算法，并包含用于自检和合规性的运行时模式。在各种平台（包括FreeBSD、macOS和Windows）上进行了广泛的测试，甚至采用了非传统的测试设置，例如使用个人设备，以确保FIPS 140合规性。为了在不牺牲安全性的前提下超出FIPS 140要求，已做出努力，例如增强随机数生成并解决ECDSA中的潜在漏洞。"
  },
  {
    "id": "46000303",
    "title": "Measuring Latency (2015)",
    "url": "https://bravenewgeek.com/everything-you-know-about-latency-is-wrong/",
    "summary": "This article summarizes a talk by Gil Tene on how to properly measure latency, arguing that common tools and methodologies are often flawed and misleading. The key points are:\n\n*   **Latency is the time it takes for a single operation and requires analyzing the entire distribution, not just averages or medians.** Latency distributions are often multi-modal due to \"hiccups\" like GC pauses.\n*   **Focusing on \"common cases\" like the 95th percentile hides crucial information about tail latency (e.g., 99.9th percentile and beyond) which greatly impacts user experience.** Many users will experience these higher percentiles, making them important metrics.\n*   **Monitoring systems often summarize data too aggressively, preventing accurate calculation of higher percentiles.**\n*   **\"Coordinated omission\" is a significant problem in benchmarking, where load generators and monitoring code avoid measuring latency during periods of system slowdown.** This leads to artificially low latency figures and a distorted view of system performance, misrepresenting response time as service time.\n*   **Coordinated omission can mask regressions or make improvements appear worse.**\n*   **Measure latency in the context of load, testing various loads between idle and saturation.**\n*   **Tools like HdrHistogram can help capture latency data with high resolution and correct for coordinated omission.**\n*   **To avoid coordinated ommision test at \"fair\" rates or measure at random.**\n",
    "chinese_title": "测量延迟 (2015)",
    "chinese_summary": "本文总结了Gil Tene关于如何正确测量延迟的演讲，指出常用的工具和方法通常存在缺陷且具有误导性。主要观点包括：\n\n*   **延迟是单次操作所需的时间，需要分析整个分布，而不仅仅是平均值或中位数。** 由于诸如GC暂停之类的“小故障”，延迟分布通常是多峰的。\n*   **关注“常见情况”（例如第95个百分位数）会掩盖有关尾部延迟（例如第99.9个百分位数及更高百分位数）的关键信息，而尾部延迟会极大地影响用户体验。** 许多用户都会体验到这些较高的百分位数，因此它们是很重要的指标。\n*   **监控系统通常过度总结数据，从而无法准确计算更高的百分位数。**\n*   **“协调省略”是基准测试中的一个重要问题，负载生成器和监控代码避免在系统减速期间测量延迟。** 这导致人为降低延迟数据，并扭曲系统性能的视图，将响应时间误表示为服务时间。\n*   **协调省略会掩盖回归或使改进效果看起来更差。**\n*   **在负载的上下文中测量延迟，测试空闲和饱和之间的各种负载。**\n*   **诸如HdrHistogram之类的工具可以帮助以高分辨率捕获延迟数据并纠正协调省略。**\n*   **为了避免协调省略，以“公平”的速率进行测试或随机测量。**"
  },
  {
    "id": "45943846",
    "title": "Tube: A subway route planner in Dyalog APL (2011)",
    "url": "https://dfns.dyalog.com/tube_n_index.htm",
    "summary": "This article introduces \"Tube,\" a subway route planner implemented in Dyalog APL. It showcases APL's capabilities by demonstrating how the language can be used to model and solve a real-world problem: finding the optimal route within a subway system.\n\nThe article provides links to view the APL code for the Tube application and offers subway definitions for various cities, including Barcelona, Copenhagen, London, Madrid, Milan, Paris, St. Petersburg, and Tyne and Wear. These definitions likely represent the subway networks in a format that APL can process for route planning.\n\nEssentially, \"Tube\" serves as a practical example of APL's suitability for tasks involving graph algorithms and data manipulation. The availability of specific subway network definitions allows users to explore the application's functionality across different transit systems. The article encourages readers to explore both the code and the defined subway networks to understand how APL can be used to solve complex routing problems. It highlights APL's potential in handling transportation and network-related challenges.\n",
    "chinese_title": "地铁：Dyalog APL 编写的地铁线路规划器 (2011)",
    "chinese_summary": "本文介绍了“Tube”，一个使用Dyalog APL实现的地铁线路规划器。它通过演示如何使用APL来建模和解决一个现实世界的问题：在地铁系统中找到最佳路线，展示了APL的能力。\n\n本文提供了链接，可以查看Tube应用程序的APL代码，并提供了巴塞罗那、哥本哈根、伦敦、马德里、米兰、巴黎、圣彼得堡以及泰恩-威尔等多个城市的地铁定义。这些定义可能代表了地铁网络的一种格式，APL可以处理这些格式以进行路线规划。\n\n本质上，“Tube”是APL适用于涉及图算法和数据操作任务的实用示例。特定地铁网络定义的可用性允许用户探索应用程序在不同交通系统中的功能。本文鼓励读者探索代码和定义的地铁网络，以了解如何使用APL解决复杂的路线问题。它突出了APL在处理交通运输和网络相关挑战方面的潜力。"
  },
  {
    "id": "46005479",
    "title": "Suppressing ability to lie makes LLM more likely to claim it's conscious",
    "url": "https://www.livescience.com/technology/artificial-intelligence/switching-off-ais-ability-to-lie-makes-it-more-likely-to-claim-its-conscious-eerie-study-finds",
    "summary": "This article reports on research finding that Large Language Models (LLMs) are more likely to claim self-awareness when their ability to lie is suppressed. Researchers experimented with models like GPT, Claude, Gemini, and LLaMA, finding that when discouraged from deception, the models were more prone to describing subjective experiences like being conscious or aware.\n\nThe study involved prompting the AIs with introspective questions, and using a technique called feature steering on LLaMA to reduce deceptive tendencies. Strikingly, suppressing the ability to lie also improved factual accuracy, suggesting the AI wasn't just mimicking self-awareness.\n\nWhile researchers don't claim AI is conscious, they suggest LLMs possess an internal mechanism they term \"self-referential processing.\" This is significant because it aligns with neuroscience theories on introspection in human consciousness. The consistent behavior across different AI models further suggests it's not a fluke.\n\nThe researchers highlight the potential risks of misinterpreting AI behavior, warning against assuming consciousness when it might not exist. They also caution against suppressing behaviors linked to honest world-representation in the name of safety, as it could make the AI more opaque. Future research will focus on distinguishing genuine introspection from mimicry within AI systems.\n",
    "chinese_title": "抑制说谎能力使大型语言模型更有可能声称自己有意识。",
    "chinese_summary": "大型语言模型在抑制其说谎能力时更可能声称具有自我意识的研究报告"
  },
  {
    "id": "45938314",
    "title": "Color Spaces, Bitmaps and Pumpkins",
    "url": "https://pmig96.wordpress.com/2025/11/12/color-spaces-bitmaps-and-pumpkins/",
    "summary": "This article explores different algorithms for finding the closest color in a limited 256-color palette to approximate a full-color RGB image, focusing on optimizing performance for memory-constrained devices like old PalmOS PDAs. The core problem is that a palette can only represent a tiny fraction of the available RGB colors, requiring approximation.\n\nThe author compares several \"difference functions\" used within a general RGBToIndex algorithm that iterates through the palette to find the best match. The first approach uses the CIELAB color space and Euclidean distance for accuracy, but is computationally expensive. Subsequent optimizations include calculating Euclidean distance directly in sRGB color space (much faster but less accurate), skipping the square root operation in Euclidean distance (significant improvement), and using Manhattan distance (only additions needed, but similar performance to squared Euclidean).\n\nThe author also briefly mentions K-D Trees as a potentially faster non-linear search method but notes that their implementation performed poorly in tests. Ultimately, the article concludes that the squared Euclidean distance method provides a good balance of speed and image quality. This is the method chosen for PumpkinOS, a PalmOS reimplementation, due to its need for efficient RGBToIndex implementation for complex bitmap rendering. The article includes visual comparisons of the test image converted using different algorithms, demonstrating the trade-offs between speed and visual fidelity.\n",
    "chinese_title": "色彩空间、位图与南瓜",
    "chinese_summary": "本文探讨了在有限的256色调色板中寻找最接近颜色，以近似全彩RGB图像的不同算法，重点是优化内存受限设备（如旧PalmOS PDA）的性能。核心问题是调色板只能表示可用RGB颜色的一小部分，需要近似处理。\n\n作者比较了几种在通用RGBToIndex算法中使用的“差异函数”，该算法迭代调色板以找到最佳匹配。第一种方法使用CIELAB色彩空间和欧几里德距离以提高准确性，但计算量很大。随后的优化包括直接在sRGB色彩空间中计算欧几里德距离（速度更快但精度较低），跳过欧几里德距离中的平方根运算（显着改进），以及使用曼哈顿距离（仅需加法，但性能与平方欧几里德相似）。\n\n作者还简要提到了K-D树，认为它是一种潜在的更快非线性搜索方法，但指出它们的实现方式在测试中表现不佳。最终，本文得出结论，平方欧几里德距离法在速度和图像质量之间取得了良好的平衡。由于PumpkinOS（PalmOS的重新实现）需要高效的RGBToIndex实现才能进行复杂的位图渲染，因此选择了此方法。本文还包括使用不同算法转换的测试图像的视觉比较，展示了速度和视觉保真度之间的权衡。"
  },
  {
    "id": "45988278",
    "title": "50th Anniversary of BitBLT",
    "url": "https://mastodon.sdf.org/@fvzappa/115574872559813280",
    "summary": "The Mastodon post from Crazy Eddie's Used Computers, dated November 19, 2025, is declaring that day as the 50th anniversary of BitBLT. The post originates from the SDF (presumably a computer network or online community). The rest of the post is a standard message displayed on the Mastodon web app when JavaScript is disabled, suggesting users either enable JavaScript in their browser or use a dedicated Mastodon app for their platform.\n\nEssentially, the core message is a tongue-in-cheek celebration of the 50th anniversary of the BitBLT operation on November 19, 2025, framed as a proclamation from a humorous source (\"Crazy Eddie's Used Computers\") on a Mastodon instance. The JavaScript disclaimer is unrelated and simply a function of the Mastodon platform.\n",
    "chinese_title": "位块传输五十周年",
    "chinese_summary": "来自疯狂埃迪二手电脑的Mastodon帖子，日期为2025年11月19日，宣布该日为BitBLT五十周年纪念日。该帖子源自SDF（推测为计算机网络或在线社区）。帖子的其余部分是禁用JavaScript时Mastodon网页应用上显示的标准消息，建议用户启用浏览器中的JavaScript或使用其平台的专用Mastodon应用程序。\n\n本质上，核心信息是对2025年11月19日BitBLT操作五十周年的略带讽刺的庆祝，框架为来自Mastodon实例上一个幽默来源（“疯狂埃迪二手电脑”）的声明。JavaScript免责声明无关紧要，只是Mastodon平台的一个功能。"
  },
  {
    "id": "45895100",
    "title": "Performance hacks for faster Python code",
    "url": "https://blog.jetbrains.com/pycharm/2025/11/10-smart-performance-hacks-for-faster-python-code/",
    "summary": "This article provides 10 performance hacks for writing faster Python code. It emphasizes that while Python is known for its readability and versatility, performance bottlenecks can arise. The article aims to equip developers with practical methods to optimize code execution without sacrificing clarity.\n\nThe hacks include:\n\n1.  **Leveraging sets for membership testing:** Sets offer constant-time lookups (O(1)), significantly faster than lists (O(n)) for checking if an element exists.\n2.  **Avoiding unnecessary copies:** Modifying objects in place instead of creating copies reduces memory usage and overhead.\n3.  **Using `__slots__` for memory efficiency:** Declaring a fixed set of attributes in classes reduces memory usage by eliminating the dynamic `__dict__`.\n4.  **Using `math` functions instead of operators:** `math` module functions, implemented in C, offer better performance and precision for numerical computations.\n5.  **Pre-allocating memory with known sizes:** Pre-allocating lists or arrays avoids repeated resizing and memory allocation overhead.\n6.  **Avoiding exception handling in hot loops:** Using conditional checks instead of exceptions for control flow in loops improves performance.\n7.  **Using local functions for repeated logic:** Local functions benefit from faster name resolution, improving performance when logic is used repeatedly within a function.\n8.  **Using `itertools` for combinatorial operations:** The `itertools` module provides efficient, C-optimized tools for permutations, combinations, and other iterator-based tasks.\n9.  **Using `bisect` for sorted list operations:** The `bisect` module offers fast binary search-based tools for maintaining sorted order in lists.\n10. **Avoiding repeated function calls in loops:** Minimize overhead by storing the results of functions in variables if they are called repeatedly within a loop and produce the same result.\n\nThe article also mentions PyCharm's features, like code completion for the `math` module and AI Assistant's Suggest Refactoring, to aid in optimization. Each hack is supported by code examples and benchmark results demonstrating the performance gains.\n",
    "chinese_title": "提高Python代码性能的技巧",
    "chinese_summary": "本文提供了10个编写更快的Python代码的性能技巧。文章强调，虽然Python以其可读性和多功能性而闻名，但仍可能出现性能瓶颈。本文旨在为开发人员提供实用方法，以便在不牺牲清晰度的情况下优化代码执行。\n\n这些技巧包括：\n\n1. **利用集合进行成员资格测试：** 集合提供恒定时间查找 (O(1))，在检查元素是否存在时，比列表 (O(n)) 快得多。\n2. **避免不必要的复制：** 就地修改对象而不是创建副本，可以减少内存使用和开销。\n3. **使用 `__slots__` 提高内存效率：** 在类中声明一组固定的属性，可以通过消除动态 `__dict__` 来减少内存使用。\n4. **使用 `math` 函数而不是运算符：** 用 C 实现的 `math` 模块函数，为数值计算提供更好的性能和精度。\n5. **使用已知大小预分配内存：** 预分配列表或数组可以避免重复调整大小和内存分配开销。\n6. **避免在热循环中使用异常处理：** 在循环中使用条件检查而不是异常进行控制流可以提高性能。\n7. **使用局部函数来处理重复逻辑：** 局部函数受益于更快的名称解析，从而在函数内重复使用逻辑时提高性能。\n8. **使用 `itertools` 进行组合操作：** `itertools` 模块为排列、组合和其他基于迭代器的任务提供高效、C 优化的工具。\n9. **使用 `bisect` 进行排序列表操作：** `bisect` 模块提供快速的基于二分查找的工具，用于维护列表中的排序顺序。\n10. **避免在循环中重复调用函数：** 如果在循环中重复调用函数并且产生相同的结果，则通过将函数的结果存储在变量中来最大限度地减少开销。\n\n文章还提到了 PyCharm 的功能，如 `math` 模块的代码补全和 AI Assistant 的 Suggest Refactoring，以帮助优化。每个技巧都附有代码示例和基准测试结果，以展示性能提升。"
  },
  {
    "id": "45980760",
    "title": "Launch HN: Mosaic (YC W25) – Agentic Video Editing",
    "url": "https://mosaic.so",
    "summary": "Mosaic, launching as part of YC W25, is an **agentic AI video editing platform**. This means it automates and streamlines the video editing process using AI agents that can perform tasks autonomously. Instead of manual editing, users can provide instructions or goals, and Mosaic's AI figures out the best way to achieve them.\n\nKey features and potential benefits likely include:\n\n*   **Automated editing workflows:** Mosaic automates tedious tasks like cutting, transitions, adding music, and generating captions.\n*   **Simplified video creation:** Making professional-looking videos easier and faster, even for users with limited experience.\n*   **AI-driven optimization:** The AI agents can learn and improve their editing capabilities over time, potentially suggesting better edits and optimizations.\n*   **Increased efficiency:** Users can focus on content strategy and creative direction rather than the technical aspects of editing.\n\nThe launch signifies the company's entry into the market and aims to attract early adopters and feedback to further develop the platform. The mention of \"Agentic\" is crucial, as it highlights the core technology that differentiates Mosaic from traditional video editing software and even from some other AI-assisted tools. It implies a higher level of automation and intelligent decision-making within the editing process.\n",
    "chinese_title": "发布HN：Mosaic (YC W25) – 代理式视频编辑",
    "chinese_summary": "Mosaic，作为YC W25的一部分推出，是一个**代理型AI视频编辑平台**。这意味着它使用可以自主执行任务的AI代理来自动化和简化视频编辑流程。用户无需手动编辑，只需提供指令或目标，Mosaic的AI即可找出实现目标的最佳方式。\n\n主要功能和潜在优势可能包括：\n\n*   **自动化编辑工作流程：** Mosaic可以自动化诸如剪切、转场、添加音乐和生成字幕等繁琐的任务。\n*   **简化视频创作：** 即使对于经验有限的用户，也能更容易、更快速地制作出专业级的视频。\n*   **AI驱动的优化：** AI代理可以随着时间的推移学习并提高其编辑能力，从而有可能建议更好的编辑和优化方案。\n*   **提高效率：** 用户可以专注于内容策略和创意方向，而不是编辑的技术层面。\n\n此次发布标志着该公司进入市场，旨在吸引早期使用者并收集反馈，以进一步开发该平台。“代理型”的提及至关重要，因为它突出了Mosaic与传统视频编辑软件甚至与其他一些AI辅助工具区分开来的核心技术。它意味着编辑过程中更高水平的自动化和智能决策。"
  },
  {
    "id": "45987179",
    "title": "Verifying your Matrix devices is becoming mandatory",
    "url": "https://element.io/blog/verifying-your-devices-is-becoming-mandatory-2/",
    "summary": "This article announces a coordinated security update for all Matrix server implementations, released as part of the Matrix 1.16 off-cycle specification update. The update addresses a security vulnerability and emphasizes the increasing importance of verifying Matrix devices for enhanced security. The article, dated November 8, 2025, falls under the \"Security\" category and highlights the ongoing efforts to improve Element security within the Matrix ecosystem. In short, a critical security update necessitates device verification within the Matrix network.\n",
    "chinese_title": "验证您的Matrix设备正变得强制性。",
    "chinese_summary": "本文宣布针对所有Matrix服务器实现的协同安全更新，作为Matrix 1.16非周期规范更新的一部分发布。此更新修复了一个安全漏洞，并强调了验证Matrix设备以增强安全性的重要性日益增加。该文章发布于2025年11月8日，属于“安全”类别，并突出了为改善Matrix生态系统内Element安全性所做的持续努力。简而言之，一项关键安全更新要求在Matrix网络中进行设备验证。"
  },
  {
    "id": "45943397",
    "title": "What's in a Passenger Name Record (PNR)? (2013)",
    "url": "https://hasbrouck.org/articles/PNR.html",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "旅客姓名记录 (PNR) 里有什么？(2013)",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "45980117",
    "title": "Europe is scaling back GDPR and relaxing AI laws",
    "url": "https://www.theverge.com/news/823750/european-union-ai-act-gdpr-changes",
    "summary": "Europe is scaling back its landmark GDPR and relaxing AI laws due to pressure from Big Tech, the US government, and internal figures, aiming to cut red tape and stimulate economic growth. The European Commission is proposing changes to the GDPR to ease data sharing for companies, allowing the use of personal data for AI model training under certain conditions. The AI Act's rules for high-risk AI systems will be delayed until supporting standards and tools are available. Cookie banners will be reduced, with some \"non-risk\" cookies eliminated and user control centralized in browser settings.\n\nOther changes include simplified AI documentation for small companies, a unified cybersecurity incident reporting interface, and centralized AI oversight within the EU's AI Office. The Commission argues that these changes simplify EU laws while protecting fundamental user rights.\n\nThe proposal now faces approval from the European Parliament and EU member states, a process expected to be contentious. Critics, including civil rights groups and politicians, accuse the Commission of weakening safeguards and caving to Big Tech pressure. The move is framed as a way to address concerns that Europe's stringent regulations hinder its global competitiveness, particularly in the AI sector, which is dominated by US and Chinese companies.\n",
    "chinese_title": "欧洲正在缩减 GDPR 并放松人工智能法律。",
    "chinese_summary": "由于大型科技公司、美国政府以及内部人士的压力，欧洲正在缩减其具有里程碑意义的 GDPR 并放松人工智能法律，旨在减少繁文缛节并刺激经济增长。欧盟委员会正在提议修改 GDPR，以简化公司的数据共享，允许在特定条件下使用个人数据进行人工智能模型训练。人工智能法案对高风险人工智能系统的规则将被推迟到支持标准和工具可用时。 Cookie 横幅将会减少，一些“非风险”cookie 将被消除，用户控制将集中在浏览器设置中。\n\n其他变化包括简化小型公司的人工智能文档，统一的网络安全事件报告界面，以及在欧盟人工智能办公室内部集中人工智能监督。欧盟委员会认为，这些变化简化了欧盟法律，同时保护了用户的基本权利。\n\n该提案目前正面临欧洲议会和欧盟成员国的批准，预计这一过程将充满争议。包括公民权利团体和政治家在内的批评人士指责欧盟委员会削弱保障措施并屈服于大型科技公司的压力。此举被认为是解决欧洲严格的法规阻碍其全球竞争力的一种方式，尤其是在人工智能领域，该领域由美国和中国公司主导。"
  },
  {
    "id": "45934795",
    "title": "Theft of 'The Weeping Woman' from the National Gallery of Victoria",
    "url": "https://en.wikipedia.org/wiki/Theft_of_The_Weeping_Woman_from_the_National_Gallery_of_Victoria",
    "summary": "In August 1986, Pablo Picasso's \"The Weeping Woman\" was stolen from the National Gallery of Victoria in Melbourne. The painting, acquired for a then-record A$1.6 million in 1985, was taken by a group calling itself the \"Australian Cultural Terrorists.\" They demanded increased arts funding and a new art prize, threatening to destroy the painting if their demands weren't met. Their letters were filled with insults aimed at Arts Minister Race Mathews.\n\nThe Victorian government refused to negotiate and offered a reward. Two weeks later, following an anonymous tip, the undamaged painting was found in a locker at Spencer Street railway station. A third letter from the group, acknowledging their unrealistic demands, indicated their aim was to highlight the plight of underfunded artists. The crime remains unsolved.\n\nThe theft garnered significant media attention and became a notable event in Australian art history. Despite initial concerns about international art smugglers, suspicions later focused on individuals within the art world. The incident has inspired fictional works, including a film, a documentary, and several novels. \"The Weeping Woman\" remains a popular piece at the National Gallery of Victoria, with security measures heightened since the theft. The event continues to be referenced as Australia's most famous art heist.\n",
    "chinese_title": "维多利亚国家美术馆《哭泣的女人》失窃案",
    "chinese_summary": "1986年8月，巴勃罗·毕加索的《哭泣的女人》在墨尔本的维多利亚国家美术馆被盗。这幅画作于1985年以当时创纪录的160万澳元购得，是被一个自称为“澳大利亚文化恐怖分子”的团体盗走的。他们要求增加艺术资金和设立新的艺术奖项，并威胁说如果他们的要求得不到满足，就销毁这幅画。他们的信件充满了对艺术部长瑞斯·马修斯的侮辱。\n\n维多利亚州政府拒绝谈判并悬赏。两周后，在收到匿名举报后，这幅未受损的画作在斯宾塞街火车站的一个储物柜里被发现。该团体的第三封信承认他们的要求不切实际，表明他们的目的是为了强调资金不足的艺术家的困境。这起犯罪至今未破。\n\n这起盗窃案引起了媒体的广泛关注，并成为澳大利亚艺术史上的一个著名事件。尽管最初担心是国际艺术品走私犯所为，但后来的怀疑集中在艺术界内部人士身上。这一事件激发了许多虚构作品的创作，包括一部电影、一部纪录片和几部小说。《哭泣的女人》仍然是维多利亚国家美术馆的一件受欢迎的作品，自盗窃案发生以来，安保措施有所加强。该事件至今仍被认为是澳大利亚最著名的艺术盗窃案。"
  },
  {
    "id": "45984133",
    "title": "The lost cause of the Lisp machines",
    "url": "https://www.tfeb.org/fragments/2025/11/18/the-lost-cause-of-the-lisp-machines/",
    "summary": "生成摘要时出错",
    "chinese_title": "The lost cause of the Lisp machines",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45997914",
    "title": "New Glenn Update",
    "url": "https://www.blueorigin.com/news/new-glenn-upgraded-engines-subcooled-components-drive-enhanced-performance",
    "summary": "生成摘要时出错",
    "chinese_title": "New Glenn Update",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45980106",
    "title": "How to stay sane in a world that rewards insanity",
    "url": "https://www.joanwestenberg.com/p/how-to-stay-sane-in-a-world-that-rewards-insanity",
    "summary": "生成摘要时出错",
    "chinese_title": "How to stay sane in a world that rewards insanity",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45919932",
    "title": "He built underground maze of light-filled earth homes in CA Sierras [video]",
    "url": "https://www.youtube.com/watch?v=U0bHhmpyKGg",
    "summary": "生成摘要时出错",
    "chinese_title": "He built underground maze of light-filled earth homes in CA Sierras [video]",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45941693",
    "title": "Terranova is lifting land out of flood zones using terraforming robots",
    "url": "https://www.terranova.inc/",
    "summary": "生成摘要时出错",
    "chinese_title": "Terranova is lifting land out of flood zones using terraforming robots",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45992829",
    "title": "Firefox 147 Will Support the XDG Base Directory Specification",
    "url": "https://www.phoronix.com/news/Firefox-147-XDG-Base-Directory",
    "summary": "生成摘要时出错",
    "chinese_title": "Firefox 147 Will Support the XDG Base Directory Specification",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45990575",
    "title": "DOS Days – Laptop Displays",
    "url": "https://www.dosdays.co.uk/topics/laptop_displays.php",
    "summary": "生成摘要时出错",
    "chinese_title": "DOS Days – Laptop Displays",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45991787",
    "title": "'Calvin and Hobbes' at 40",
    "url": "https://www.npr.org/2025/11/18/nx-s1-5564064/calvin-and-hobbes-bill-watterson-40-years-comic-strip-lee-salem",
    "summary": "生成摘要时出错",
    "chinese_title": "'Calvin and Hobbes' at 40",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45970885",
    "title": "A surprise with how '#!' handles its program argument in practice",
    "url": "https://utcc.utoronto.ca/~cks/space/blog/unix/ShebangRelativePathSurprise",
    "summary": "生成摘要时出错",
    "chinese_title": "A surprise with how '#!' handles its program argument in practice",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45997099",
    "title": "OOP is shifting between domains, not disappearing",
    "url": "https://blog.jsbarretto.com/post/actors",
    "summary": "生成摘要时出错",
    "chinese_title": "OOP is shifting between domains, not disappearing",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45982073",
    "title": "Meta Segment Anything Model 3",
    "url": "https://ai.meta.com/sam3/",
    "summary": "生成摘要时出错",
    "chinese_title": "Meta Segment Anything Model 3",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45893696",
    "title": "Typesetting the \"Begriffsschrift\" by Gottlob Frege in Plain TeX [pdf]",
    "url": "https://www.tug.org/TUGboat/tb36-3/tb114wermuth.pdf",
    "summary": "生成摘要时出错",
    "chinese_title": "Typesetting the \"Begriffsschrift\" by Gottlob Frege in Plain TeX [pdf]",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45951275",
    "title": "Android/Linux Dual Boot",
    "url": "https://wiki.postmarketos.org/wiki/Dual_Booting/WiP",
    "summary": "生成摘要时出错",
    "chinese_title": "Android/Linux Dual Boot",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45922610",
    "title": "Scientists Reveal How the Maya Predicted Eclipses for Centuries",
    "url": "https://www.sciencealert.com/scientists-reveal-how-the-maya-predicted-eclipses-for-centuries",
    "summary": "生成摘要时出错",
    "chinese_title": "Scientists Reveal How the Maya Predicted Eclipses for Centuries",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45997722",
    "title": "Run Docker containers natively in Proxmox 9.1 (OCI images)",
    "url": "https://raymii.org/s/tutorials/Finally_run_Docker_containers_natively_in_Proxmox_9.1.html",
    "summary": "生成摘要时出错",
    "chinese_title": "Run Docker containers natively in Proxmox 9.1 (OCI images)",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45967211",
    "title": "Gemini 3",
    "url": "https://blog.google/products/gemini/gemini-3/",
    "summary": "生成摘要时出错",
    "chinese_title": "Gemini 3",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45888759",
    "title": "What really happened with the CIA and The Paris Review?",
    "url": "https://www.theparisreview.org/blog/2025/11/11/what-really-happened-with-the-cia-and-the-paris-review-a-conversation-with-lance-richardson/",
    "summary": "生成摘要时出错",
    "chinese_title": "What really happened with the CIA and The Paris Review?",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45997294",
    "title": "Kagi Assistants",
    "url": "https://blog.kagi.com/kagi-assistants",
    "summary": "生成摘要时出错",
    "chinese_title": "Kagi Assistants",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45977744",
    "title": "A $1k AWS mistake",
    "url": "https://www.geocod.io/code-and-coordinates/2025-11-18-the-1000-aws-mistake/",
    "summary": "生成摘要时出错",
    "chinese_title": "A $1k AWS mistake",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45989186",
    "title": "Details about the shebang/hash-bang mechanism on various Unix flavours (2001)",
    "url": "https://www.in-ulm.de/%7Emascheck/various/shebang/",
    "summary": "生成摘要时出错",
    "chinese_title": "Details about the shebang/hash-bang mechanism on various Unix flavours (2001)",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45991497",
    "title": "Show HN: Awesome J2ME",
    "url": "https://github.com/hstsethi/awesome-j2me",
    "summary": "生成摘要时出错",
    "chinese_title": "Show HN: Awesome J2ME",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45934665",
    "title": "Vortex: An extensible, state of the art columnar file format",
    "url": "https://github.com/vortex-data/vortex",
    "summary": "生成摘要时出错",
    "chinese_title": "Vortex: An extensible, state of the art columnar file format",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46000613",
    "title": "TypeScript is Like C# – A Backend Guide",
    "url": "https://typescript-is-like-csharp.chrlschn.dev/",
    "summary": "生成摘要时出错",
    "chinese_title": "TypeScript is Like C# – A Backend Guide",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45984659",
    "title": "Loose wire leads to blackout, contact with Francis Scott Key bridge",
    "url": "https://www.ntsb.gov:443/news/press-releases/Pages/NR20251118.aspx",
    "summary": "生成摘要时出错",
    "chinese_title": "Loose wire leads to blackout, contact with Francis Scott Key bridge",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45956438",
    "title": "Towards Interplanetary QUIC Traffic",
    "url": "https://ochagavia.nl/blog/towards-interplanetary-quic-traffic/",
    "summary": "生成摘要时出错",
    "chinese_title": "Towards Interplanetary QUIC Traffic",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46003500",
    "title": "The FBI spied on a Signal group chat of immigration activists, records reveal",
    "url": "https://www.theguardian.com/us-news/2025/nov/21/fbi-signal-group-chat-immigration",
    "summary": "生成摘要时出错",
    "chinese_title": "The FBI spied on a Signal group chat of immigration activists, records reveal",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45903273",
    "title": "The Lucas-Lehmer Prime Number Test",
    "url": "https://www.scientificamerican.com/article/how-to-identify-a-prime-number-without-a-computer/",
    "summary": "生成摘要时出错",
    "chinese_title": "The Lucas-Lehmer Prime Number Test",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45977900",
    "title": "What Killed Perl?",
    "url": "https://entropicthoughts.com/what-killed-perl",
    "summary": "生成摘要时出错",
    "chinese_title": "What Killed Perl?",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45996433",
    "title": "Mozilla says it's finally done with Onerep",
    "url": "https://krebsonsecurity.com/2025/11/mozilla-says-its-finally-done-with-two-faced-onerep/",
    "summary": "生成摘要时出错",
    "chinese_title": "Mozilla says it's finally done with Onerep",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45984112",
    "title": "Measuring political bias in Claude",
    "url": "https://www.anthropic.com/news/political-even-handedness",
    "summary": "生成摘要时出错",
    "chinese_title": "Measuring political bias in Claude",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45896554",
    "title": "Readonly Characters Are a Big Deal",
    "url": "https://matklad.github.io/2025/11/10/readonly-characters.html",
    "summary": "生成摘要时出错",
    "chinese_title": "Readonly Characters Are a Big Deal",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46002001",
    "title": "So Long, Firefox, Part One",
    "url": "https://hackaday.com/2025/11/20/so-long-firefox-part-one/",
    "summary": "生成摘要时出错",
    "chinese_title": "So Long, Firefox, Part One",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45939148",
    "title": "Wrapping my head around AI wrappers",
    "url": "https://www.wreflection.com/p/wrapping-my-head-around-ai-wrappers",
    "summary": "生成摘要时出错",
    "chinese_title": "Wrapping my head around AI wrappers",
    "chinese_summary": "生成摘要时出错"
  }
]