[
  {
    "id": "43663865",
    "title": "Open source and self hostable/private file converter",
    "url": "https://vert.sh",
    "summary": "VERT.sh is presented as an open-source and self-hostable file converter. Its key features are:\n\n*   **Privacy-focused:** All file processing happens locally on the user's device, ensuring privacy and eliminating file size limits and ads.\n*   **Open Source:** The software is open source, allowing users to inspect and modify the code.\n*   **Wide Format Support (In Progress):** The tool aims to support a variety of file formats for images, audio, and video.\n*   **Current Status:** While promising, the listed formats and their support status indicate that the features are still \"not ready\" for images, audio, and some videos require server-side processing by default (with instructions on how to set up local processing).\n*   **User Interface:** Provides a simple drag-and-drop or click-to-upload interface.\n*   **Sections:** The webpage has sections for Upload, Convert, Settings, and About.\n",
    "chinese_title": "开源且可自托管/私有的文件转换器",
    "chinese_summary": "VERT.sh：开源且可自托管的文件转换器。其主要特点包括：\n\n*   **注重隐私：** 所有文件处理都在用户本地设备上进行，确保隐私安全，并消除文件大小限制和广告。\n*   **开源：** 该软件是开源的，允许用户检查和修改代码。\n*   **广泛的格式支持（开发中）：** 该工具旨在支持各种图片、音频和视频文件格式。\n*   **当前状态：** 虽然前景可观，但列出的格式及其支持状态表明，图片和音频的各项功能仍“未就绪”，且某些视频默认需要服务器端处理（附有关于如何设置本地处理的说明）。\n*   **用户界面：** 提供简单的拖放或点击上传界面。\n*   **板块：** 网页包含上传、转换、设置和关于等板块。"
  },
  {
    "id": "43665201",
    "title": "Tunarr: Create and configure live TV channels from media on your servers",
    "url": "https://tunarr.com/",
    "summary": "Tunarr is a software that creates live TV channels from media stored on your Plex, Jellyfin, or Emby servers. It lets you configure channels, programs, commercials, and settings through a web UI. You can then watch these channels by adding Tunarr's simulated HDHomerun tuner to your media server or by using generated M3U files with any IPTV player.\n\nTunarr is a reimagining of dizqueTV, aiming to modernize the technology stack, provide migration for existing users, stabilize the program, improve performance (using Node 20.11.1), update the web UI, and add new features. In essence, Tunarr allows you to curate your own personalized live TV experience from your existing media library.\n",
    "chinese_title": "Tunarr: 从服务器上的媒体创建和配置直播电视频道",
    "chinese_summary": "Tunarr 是一款软件，可以从存储在 Plex、Jellyfin 或 Emby 服务器上的媒体创建直播电视频道。它允许您通过 Web UI 配置频道、节目、广告和设置。 然后，您可以通过将 Tunarr 模拟的 HDHomerun 调谐器添加到您的媒体服务器或使用生成的 M3U 文件与任何 IPTV 播放器来观看这些频道。\n\nTunarr 是 dizqueTV 的重新构想，旨在实现技术栈现代化、为现有用户提供迁移、稳定程序、提高性能 (使用 Node 20.11.1)、更新 Web UI 并添加新功能。 本质上，Tunarr 允许您从现有的媒体库中创建个性化的直播电视体验。"
  },
  {
    "id": "43665793",
    "title": "Paris said au revoir to cars. Air pollution maps reveal a dramatic change",
    "url": "https://www.washingtonpost.com/climate-solutions/2025/04/12/air-pollution-paris-health-cars/",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "巴黎告别汽车。空气污染地图显示显著变化。",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "43632049",
    "title": "Google will let companies run Gemini models in their own data centers",
    "url": "https://www.cnbc.com/2025/04/09/google-will-let-companies-run-gemini-models-in-their-own-data-centers.html",
    "summary": "Google Cloud will allow companies to run its Gemini AI models within their own data centers, a service called Google Distributed Cloud, starting in the third quarter. This move differentiates Google from competitors like OpenAI and Anthropic, who prefer to maintain tighter control over their models by not offering data center deployment. Cohere offers a similar option but with slower setup times.\n\nThis offering caters to organizations, including government entities with high security needs, that prefer to maintain control over their data while leveraging Google's AI technology. An \"air-gapped\" version of Google Distributed Cloud, disconnected from the internet, will cater to clients with top-secret classification levels.\n\nNvidia will also provide Gemini models on its Blackwell GPUs, available for purchase through Google or other vendors. This initiative is part of Google's broader strategy to expand its cloud market share, which stood at 8% in 2023 compared to Amazon's 39% and Microsoft's 23%. Google Cloud Chief Thomas Kurian emphasizes the company's commitment to multi-cloud environments and investments in AI as drivers for customer growth. Gemini models support a wide range of inputs (text, audio, video) and over 100 languages. The announcement comes after Google's $32 billion acquisition of cloud security startup Wiz.\n",
    "chinese_title": "谷歌将允许企业在自有数据中心运行 Gemini 模型",
    "chinese_summary": "谷歌云将允许企业在其自有数据中心运行 Gemini AI 模型，此项名为 Google Distributed Cloud 的服务将于第三季度开始提供。 这一举措使谷歌有别于 OpenAI 和 Anthropic 等竞争对手，后者更倾向于通过不提供数据中心部署来保持对其模型的严格控制。 Cohere 提供类似选项，但设置时间较长。\n\n此项服务满足了包括具有高度安全需求的政府实体在内的组织的需求，这些组织希望在利用谷歌 AI 技术的同时，保持对其数据的控制。 一个与互联网断开连接的“气隙”版 Google Distributed Cloud 将满足具有绝密分类级别的客户的需求。\n\n英伟达也将在其 Blackwell GPU 上提供 Gemini 模型，可通过谷歌或其他供应商购买。 这项举措是谷歌扩大其云市场份额的更广泛战略的一部分，谷歌云在 2023 年的市场份额为 8%，而亚马逊为 39%，微软为 23%。 谷歌云首席执行官 Thomas Kurian 强调，公司致力于多云环境和对人工智能的投资，这将推动客户增长。 Gemini 模型支持多种输入（文本、音频、视频）和 100 多种语言。 此公告是在谷歌以 320 亿美元收购云安全初创公司 Wiz 之后发布的。"
  },
  {
    "id": "43634408",
    "title": "One Bug Wasn't Enough: Escalating Twice Through SAP's Setuid Landscape",
    "url": "https://www.anvilsecure.com/blog/one-bug-wasnt-enough-escalating-twice-through-saps-setuid-landscape.html",
    "summary": "Tao Sauvage details their process of discovering two local privilege escalation vulnerabilities (CVE-2024-47595) in SAP software, allowing a `sapsys` user to gain root privileges. This was achieved by exploiting setuid binaries `icmbnd` and `hostexecstart`.\n\nThe initial reconnaissance involved identifying potential setuid binaries. `hdbmdcdispatcher` and `sapuxuserchk` were excluded due to existing exploits. The focus shifted to `icmbnd` and `hostexecstart`.\n\nThe `icmbnd` vulnerability was exploited by using the `-f` option to overwrite `/etc/passwd`. By injecting a crafted `-l` parameter containing a modified `/etc/passwd` entry, the `hxeadm` user's group ID was changed to 0 (root). This resulted in the `hxeadm` user gaining root privileges upon a new login.\n\nExploiting `hostexecstart` was more challenging. The `-upgrade` option, which takes a SAR archive path, seemed promising. However, SAR archives are signed, and the signature is verified before extraction.  The author explored options like injecting parameters to load a custom library using the `-L` option, but this was unsuccessful due to restrictions on file paths.\n\nAttempts to sign a SAR archive were also unsuccessful due to SAP's proprietary signing process involving a Time Stamp Authority (TSA) and only SAP-trusted CAs.\n\nAs a result, the author developed SAPCARve, a Python tool for parsing and manipulating SAR archives, based on the Kaitai Struct format, to explore other methods of exploiting `hostexecstart`. The details of the second exploit were not provided in the context of this abstract.\n",
    "chinese_title": "一个漏洞不够：通过SAP的Setuid环境两次升级权限",
    "chinese_summary": "Tao Sauvage 披露了他们发现 SAP 软件中两个本地权限提升漏洞 (CVE-2024-47595) 的过程，这些漏洞允许 `sapsys` 用户获得 root 权限。这是通过利用 setuid 二进制文件 `icmbnd` 和 `hostexecstart` 实现的。\n\n初步的侦察涉及识别潜在的 setuid 二进制文件。由于存在现有漏洞，`hdbmdcdispatcher` 和 `sapuxuserchk` 被排除。重点转移到 `icmbnd` 和 `hostexecstart`。\n\n`icmbnd` 漏洞是通过使用 `-f` 选项覆盖 `/etc/passwd` 来利用的。通过注入包含修改后的 `/etc/passwd` 条目的精心设计的 `-l` 参数，`hxeadm` 用户的组 ID 被更改为 0 (root)。这导致 `hxeadm` 用户在新的登录时获得 root 权限。\n\n利用 `hostexecstart` 更具挑战性。接受 SAR 归档文件路径的 `-upgrade` 选项似乎很有希望。但是，SAR 归档文件是经过签名的，并且在提取之前会验证签名。作者探索了诸如使用 `-L` 选项注入参数以加载自定义库之类的选项，但由于对文件路径的限制而未成功。\n\n由于 SAP 的专有签名过程涉及时间戳机构 (TSA) 并且仅信任 SAP 信任的 CA，因此签署 SAR 归档文件的尝试也未成功。\n\n因此，作者开发了 SAPCARve，这是一个基于 Kaitai Struct 格式的 Python 工具，用于解析和操作 SAR 归档文件，以探索利用 `hostexecstart` 的其他方法。第二个漏洞的细节未在本摘要的上下文中提供。"
  },
  {
    "id": "43642212",
    "title": "Roo or Cline? We're building a superset",
    "url": "https://blog.kilocode.ai/p/roo-or-cline-were-building-a-superset",
    "summary": "Kilo Code is building an open-source AI coding tool that aims to be a \"superset\" of existing tools like Cline and Roo Code, incorporating their best features instead of focusing on novel innovation. This \"fast follow\" strategy, inspired by examples like Apple and Linux, leverages the open-source community and encourages reciprocal adoption of features.\n\nKilo Code began by forking Roo Code (itself a fork of Cline) and then incorporating the unique features of Cline, making Kilo Code a superset of both. They will continue to merge in code from Roo Code to remain a superset of them. Current unique features from Roo Code include temperature control, internationalization, and enhanced prompt capabilities. Unique features from Cline include MCP Marketplace integration and zero-config startup. Kilo Code's own additions include free Claude 3.7 Sonnet access, shortcut keys, and \"vibe coding\" (auto-acceptance).\n\nThe company plans to integrate more features from other popular tools, including proprietary ones like Cursor and Windsurf, into Kilo Code. They actively encourage users to suggest features for inclusion, aiming to become the go-to tool with the widest range of capabilities. By open-sourcing their work, they hope to accelerate the overall progress of AI coding tools, even if it means others \"steal back\" their improvements. Ultimately, Kilo Code focuses on increasing developer productivity and reducing headaches, emphasizing building something genuinely useful for the open-source community.\n",
    "chinese_title": "Roo还是Cline？我们在构建一个超集。",
    "chinese_summary": "Kilo Code正在构建一个开源AI编码工具，目标是成为像Cline和Roo Code等现有工具的“超集”，融合它们的最佳特性，而不是专注于新颖的创新。这种“快速跟随”策略，受到苹果和Linux等例子的启发，利用开源社区并鼓励特性的相互采用。\n\nKilo Code首先通过fork Roo Code（本身就是Cline的一个fork），然后融入Cline的独特特性，使Kilo Code成为两者的超集。他们将继续合并Roo Code的代码，以保持其超集地位。目前Roo Code的独特特性包括温度控制、国际化和增强的提示功能。Cline的独特特性包括MCP市场集成和零配置启动。Kilo Code自身的增加功能包括免费的Claude 3.7 Sonnet访问、快捷键和“氛围编码”（自动接受）。\n\n该公司计划将来自其他流行工具（包括像Cursor和Windsurf这样的专有工具）的更多特性集成到Kilo Code中。他们积极鼓励用户建议需要包含的特性，旨在成为功能最广泛的首选工具。通过开源他们的工作，他们希望加速AI编码工具的整体进步，即使这意味着其他人“偷回”他们的改进。最终，Kilo Code专注于提高开发人员的生产力并减少麻烦，强调为开源社区构建真正有用的东西。"
  },
  {
    "id": "43666112",
    "title": "Artie (YC S23) Is Hiring Engineer #3",
    "url": "https://www.ycombinator.com/companies/artie/jobs/7kGvDVC-founding-product-engineer",
    "summary": "Artie, a Y Combinator S23 startup building a real-time data streaming solution for databases and data warehouses, is hiring its third engineer as a Founding Product Engineer in San Francisco. They leverage Change Data Capture (CDC) and Kafka for sub-minute latency data transfers, offering an alternative to traditional batch ETL solutions. They've achieved 1M ARR within a year of launching their cloud product and are backed by prominent investors.\n\nThe ideal candidate will have 4+ years of experience in web development at startups, strong computer science fundamentals, and a pragmatic approach to building user-friendly and extensible products. While proficiency in Go is preferred, it's not mandatory. The role involves direct interaction with technical customers to improve the product's UX, building new features like column exclusion and schema change alerts, and improving internal tooling and build automation.\n\nArtie's tech stack includes TypeScript (React, Material UI) for the frontend and Go, PostgreSQL, Redis, Kafka, and Elasticsearch for the backend, with infrastructure managed using Terraform, Kubernetes, and Helm on GCP and AWS. The interview process consists of a call with the CTO, a technical phone screen, and an onsite interview.\n\nArtie's team size is 8, and they are an active company founded in 2023.\n",
    "chinese_title": "Artie (YC S23) 招聘第三位工程师",
    "chinese_summary": "Artie (Y Combinator S23) 招募创始产品工程师\n\nArtie (一家 Y Combinator S23 的创业公司，致力于构建数据库和数据仓库的实时数据流解决方案) 正在旧金山招聘第三名工程师，担任创始产品工程师。他们利用变更数据捕获 (CDC) 和 Kafka 实现亚分钟级延迟的数据传输，为传统的批量 ETL 解决方案提供了一种替代方案。在推出云产品一年内，他们已实现 100 万美元的年度经常性收入 (ARR)，并获得了知名投资者的支持。\n\n理想的候选人将拥有 4 年以上在初创公司从事 Web 开发的经验，扎实的计算机科学基础，以及以务实的方法构建用户友好且可扩展的产品。虽然精通 Go 语言者优先，但并非强制性要求。该职位涉及与技术客户直接互动以改进产品的用户体验，构建诸如列排除和模式更改警报等新功能，以及改进内部工具和构建自动化。\n\nArtie 的技术栈包括用于前端的 TypeScript (React, Material UI) 和用于后端的 Go、PostgreSQL、Redis、Kafka 和 Elasticsearch，基础设施使用 Terraform、Kubernetes 和 Helm 在 GCP 和 AWS 上进行管理。面试流程包括与首席技术官的电话沟通、技术电话筛选以及现场面试。\n\nArtie 团队规模为 8 人，是一家于 2023 年成立的活跃公司。"
  },
  {
    "id": "43641649",
    "title": "Delusional themes may be more varied than we thought",
    "url": "https://www.bps.org.uk/research-digest/delusional-themes-may-be-more-varied-we-thought",
    "summary": "A recent study published in Schizophrenia Bulletin challenges traditional understandings of delusional themes, finding far more variation than previously assumed. Led by Elisavet Pappa at University College London, the study analyzed 155 studies encompassing 173,920 participants with psychotic disorders globally. The research identified 37 distinct delusional themes, exceeding the limited categories outlined in diagnostic manuals like the DSM-5.\n\nThe study revealed significant cultural variations in how delusions are experienced, suggesting that existing diagnostic frameworks may be too narrow and not universally relevant. Researchers discovered a \"social gradient\" in delusions, with individuals more likely to experience delusions related to close family members. This highlights the importance of interpersonal relationships in shaping delusional content.\n\nThe study also found links between specific delusional themes and psychiatric diagnoses, challenging some existing assumptions. For instance, jealousy delusions, typically linked to delusional disorder, were also common in schizophrenia and bipolar disorder. Cultural context also played a significant role, with Southern Asia showing higher prevalence of jealousy delusions, Eastern Europe more guilt/sin delusions, and the Middle East higher rates of sexual and jealousy delusions compared to 'Anglo' countries.\n\nThe study emphasizes the need for a more nuanced, individualized, and culturally informed approach to understanding and treating psychosis. By broadening the understanding of delusional themes, clinicians can develop more effective diagnostic tools, improve therapeutic interventions, and enhance patient outcomes.\n",
    "chinese_title": "妄想主题可能比我们想象的更加多样化",
    "chinese_summary": "精神分裂症公报近期发表的一项研究挑战了对妄想主题的传统理解，发现其变异程度远超之前的假设。由伦敦大学学院的Elisavet Pappa领导的这项研究分析了涵盖全球173,920名精神病患者的155项研究。该研究确定了37种不同的妄想主题，超过了DSM-5等诊断手册中概述的有限类别。\n\n该研究揭示了妄想体验方式中显著的文化差异，表明现有的诊断框架可能过于狭隘，且不具有普遍适用性。研究人员发现妄想中存在“社会梯度”，即个体更可能体验到与亲近家庭成员相关的妄想。这突出了人际关系在塑造妄想内容中的重要性。\n\n该研究还发现特定妄想主题与精神疾病诊断之间存在联系，挑战了一些现有的假设。例如，通常与妄想症相关的嫉妒妄想在精神分裂症和双相情感障碍中也很常见。文化背景也起着重要作用，南亚的嫉妒妄想患病率较高，东欧的负罪感/罪孽妄想患病率较高，与“盎格鲁”国家相比，中东的性妄想和嫉妒妄想患病率较高。\n\n该研究强调，需要采取更加细致、个体化和具有文化意识的方法来理解和治疗精神病。通过拓宽对妄想主题的理解，临床医生可以开发更有效的诊断工具，改进治疗干预措施，并改善患者的治疗效果。"
  },
  {
    "id": "43631931",
    "title": "The AI magic behind Sphere's upcoming 'The Wizard of Oz' experience",
    "url": "https://blog.google/products/google-cloud/sphere-wizard-of-oz/",
    "summary": "This article discusses the upcoming \"The Wizard of Oz at Sphere\" experience in Las Vegas, set to debut on August 28, 2025. The project uses advanced generative AI, including Google DeepMind's Imagen and Veo, and Google Cloud's Gemini, to reimagine the classic 1939 film for the massive, immersive environment of the Sphere.\n\nThe goal is to create a sensory experience that envelops the 17,600-seat venue while respecting the original film's integrity. The team is not adding any new dialogue or music, but instead using AI to enhance and expand the original material.\n\nKey challenges include scaling the original 35mm film to the Sphere's 16K LED screen and filling in gaps created by camera cuts. The AI tools are used for \"super resolution\" to enhance the image quality, \"outpainting\" to expand the scope of scenes, and \"performance generation\" to incorporate performances into the expanded environments.\n\nTo improve the quality of AI outputs, the team is using fine-tuning, training the AI models with a vast collection of supplementary material, including shooting scripts, production illustrations, and set plans. This allows the AI to generate hyper-realistic details and seamless integration of characters like Dorothy and Toto into the enhanced environments. The project involves a collaboration between Google DeepMind, Google Cloud, Sphere Studios, Magnopus, and Warner Bros. Discovery.\n",
    "chinese_title": "Sphere即将上映的《绿野仙踪》体验背后的AI魔法",
    "chinese_summary": "本文探讨了即将于2025年8月28日在拉斯维加斯Sphere首映的“Sphere绿野仙踪”体验。该项目利用先进的生成式人工智能，包括谷歌DeepMind的Imagen和Veo，以及谷歌云的Gemini，为Sphere巨大的沉浸式环境重新构想1939年的经典电影。\n\n目标是在尊重原片完整性的前提下，创造一种包围17600个座位的场馆的感官体验。团队没有添加任何新的对话或音乐，而是使用人工智能来增强和扩展原始素材。\n\n关键挑战包括将原始35毫米胶片扩展到Sphere的16K LED屏幕，并填补因镜头切换造成的空白。人工智能工具被用于“超分辨率”以提高图像质量，“外绘”以扩展场景范围，以及“性能生成”以将表演融入扩展的环境中。\n\n为了提高人工智能输出的质量，团队正在使用微调，利用大量的补充材料（包括拍摄剧本、制作插图和场景设计图）来训练人工智能模型。这使人工智能能够生成超逼真的细节，并将多萝西和托托等角色无缝集成到增强的环境中。该项目涉及谷歌DeepMind、谷歌云、Sphere Studios、Magnopus和华纳兄弟探索公司的合作。"
  },
  {
    "id": "43659365",
    "title": "Vacheron Constantin breaks the world record for most complicated wristwatch",
    "url": "https://www.hodinkee.com/articles/introducing-vacheron-constantin-les-cabinotiers-solaria",
    "summary": "The article \"Vacheron Constantin breaks the world record for most complicated wristwatch,\" focuses on Vacheron Constantin's achievement in creating a new wristwatch with an unprecedented number of complications. The article likely highlights this watch as a significant achievement in horological history. Because it is presented within an \"Editors' Picks Our Favorite Watches From Watches And Wonders 2025,\" the article suggests the watch debuted (or will debut) at the Watches And Wonders 2025 event and stands out as a top choice among other releases. The core message is that Vacheron Constantin has pushed the boundaries of watchmaking complexity, setting a new benchmark for other manufacturers.\n",
    "chinese_title": "江诗丹顿打破世界纪录，推出最复杂腕表",
    "chinese_summary": "江诗丹顿打破世界纪录，打造最复杂腕表：文章聚焦江诗丹顿在创造一款具有空前复杂功能的全新腕表上所取得的成就。文章很可能强调这款腕表是钟表史上的一项重大成就。由于文章出现在“编辑精选：2025年钟表与奇迹表展上我们最喜爱的腕表”中，因此表明这款腕表在2025年钟表与奇迹表展上首次亮相（或将首次亮相），并在其他发布的产品中脱颖而出，成为首选。核心信息是江诗丹顿突破了制表复杂性的界限，为其他制造商树立了新的标杆。"
  },
  {
    "id": "43659370",
    "title": "You might not need WebSockets",
    "url": "https://hntrl.io/posts/you-dont-need-websockets/",
    "summary": "This article argues that WebSockets, while seemingly ideal for real-time applications, might not always be the best choice. It highlights several drawbacks:\n\n*   **Non-transactional messages:** WebSockets lack built-in mechanisms to associate commands with responses, especially error messages. Implementing this requires extra complexity like request IDs and error handling.\n*   **Socket lifecycle management:** WebSockets require managing connection states (open, close, error), reconnect attempts, and resource cleanup, adding complexity compared to the simpler request/response model of HTTP.\n*   **Increased server-side complexity:** Handling WebSocket handshake upgrades, managing potential failures, and dealing with partial data frames increase server-side code complexity, especially when combined with request/response semantics.\n\nThe article proposes **HTTP Streaming** as a viable alternative. By using HTTP's built-in streaming capabilities, the server can push real-time updates to the client without the overhead of a full-duplex WebSocket connection. The client can use the Stream API to read data as it becomes available.\n\nFinally, the author introduces **eventkit**, a library designed to simplify the management of asynchronous streams of data, further streamlining the implementation of real-time updates using HTTP Streaming. The author encourages readers to explore eventkit and its HTTP Streaming guide. In essence, the article suggests carefully considering the specific needs of an application before opting for WebSockets, as simpler alternatives like HTTP Streaming can often provide the desired functionality with less complexity.\n",
    "chinese_title": "你可能不需要WebSockets。",
    "chinese_summary": "WebSockets并非始终最佳：HTTP流媒体的替代方案\n\n*   **非事务性消息：** WebSockets缺乏将命令与响应（尤其是错误消息）关联的内置机制。实现此功能需要额外的复杂性，如请求ID和错误处理。\n*   **Socket生命周期管理：** WebSockets需要管理连接状态（打开、关闭、错误）、重连尝试和资源清理，与HTTP的简单请求/响应模型相比增加了复杂性。\n*   **增加服务器端复杂性：** 处理WebSocket握手升级、管理潜在故障以及处理部分数据帧会增加服务器端代码的复杂性，尤其是当与请求/响应语义结合使用时。\n\n本文提出**HTTP流媒体**作为一种可行的替代方案。 通过使用HTTP的内置流媒体功能，服务器可以将实时更新推送到客户端，而无需全双工WebSocket连接的开销。 客户端可以使用Stream API在数据可用时读取数据。\n\n最后，作者介绍了**eventkit**，这是一个旨在简化异步数据流管理的库，进一步简化了使用HTTP流媒体实现实时更新的过程。 作者鼓励读者探索eventkit及其HTTP流媒体指南。 本质上，本文建议在选择WebSockets之前仔细考虑应用程序的特定需求，因为像HTTP流媒体这样更简单的替代方案通常可以在降低复杂性的同时提供所需的功能。"
  },
  {
    "id": "43661235",
    "title": "Google Is Winning on Every AI Front",
    "url": "https://www.thealgorithmicbridge.com/p/google-is-winning-on-every-ai-front",
    "summary": "The article argues that Google, specifically Google DeepMind, is currently dominating the AI landscape, surpassing OpenAI and Anthropic. The author, Alberto Romero, highlights Google's comeback after initially fumbling the introduction of ChatGPT.\n\nKey points supporting this claim include:\n\n*   **Superior AI Models:** Gemini 2.5 Pro is considered the best model globally, excelling in benchmarks like LMArena and GPQA Diamond, along with private benchmarks and agentic playgrounds. Gemini 2.5 Flash offers speed and cost-effectiveness. Google also has Gemma 3, a competitive open-source model.\n*   **Domination in Generative AI:** Google leads in various generative AI fields beyond text, with tools like Lyria (music), Imagen 3 (image), Veo 2 (video), and Chirp 3 (voice/speech) being integrated into Vertex AI.\n*   **Advanced Agents:** Google's Deep Research mode is superior to OpenAI's, and they are developing Project Astra (assistant) and Project Mariner (computer interaction).\n*   **Strong Research:** Google consistently publishes high-quality research papers.\n*   **Software Ecosystem:** Google benefits from its existing vast user base across multiple platforms like Search, YouTube, Android, Gmail, and Workspace, offering default access to AI for billions.\n*   **Infrastructure Advantages:** Google is a hyperscaler with Google Cloud, renting chips and partnering with Nvidia, unlike OpenAI and Anthropic, which depend on other cloud providers.\n*   **Hardware Capabilities:** Google develops its own AI chips (TPUs), competing with Nvidia and securing revenue.\n*   **Mobile Integration:** Google integrates Gemini into its Pixel phones, offering unique AI features.\n\nThe author suggests that Google's multifaceted approach, encompassing AI, software, cloud, hardware, and mobile, gives it a significant advantage over competitors.\n",
    "chinese_title": "谷歌在人工智能的各个领域都取得了胜利。",
    "chinese_summary": "该文章认为，谷歌，特别是谷歌DeepMind，目前在人工智能领域占据主导地位，超越了OpenAI和Anthropic。作者Alberto Romero强调了谷歌在最初推出ChatGPT时表现不佳后的卷土重来。\n\n支持这一论点的关键点包括：\n\n*   **卓越的AI模型：** Gemini 2.5 Pro被认为是全球最佳模型，在LMArena和GPQA Diamond等基准测试以及私有基准测试和代理竞技场中表现出色。Gemini 2.5 Flash具有速度和成本效益。谷歌还拥有Gemma 3，一个具有竞争力的开源模型。\n*   **在生成式AI领域的主导地位：** 谷歌在文本之外的各种生成式AI领域处于领先地位，其Lyria（音乐）、Imagen 3（图像）、Veo 2（视频）和Chirp 3（语音/语音）等工具正被集成到Vertex AI中。\n*   **高级智能代理：** 谷歌的Deep Research模式优于OpenAI，并且正在开发Project Astra（助理）和Project Mariner（计算机交互）。\n*   **强大的研究能力：** 谷歌持续发表高质量的研究论文。\n*   **软件生态系统：** 谷歌受益于其现有庞大的用户群，遍布搜索、YouTube、Android、Gmail和Workspace等多个平台，为数十亿用户提供默认的AI访问权限。\n*   **基础设施优势：** 谷歌是一家拥有谷歌云的超大规模企业，出租芯片并与英伟达合作，而OpenAI和Anthropic则依赖于其他云提供商。\n*   **硬件能力：** 谷歌开发自己的AI芯片（TPU），与英伟达竞争并获得收入。\n*   **移动集成：** 谷歌将Gemini集成到其Pixel手机中，提供独特的AI功能。\n\n作者认为，谷歌在AI、软件、云、硬件和移动等方面的多方面方法，使其比竞争对手具有显著优势。"
  },
  {
    "id": "43653672",
    "title": "Fedora change aims for 99% package reproducibility",
    "url": "https://lwn.net/Articles/1014979/",
    "summary": "This LWN.net article discusses Fedora's initiative to achieve 99% package reproducibility by Fedora 43, expected in October 2025. Reproducible builds ensure that identical source code, build environment, and instructions produce bit-by-bit identical artifacts. While Fedora has good control over its build process, reproducible builds enhance security by mitigating supply-chain attacks and enabling independent verification.\n\nFedora's definition of reproducibility differs slightly from Debian's, excluding signatures and some metadata (like BUILDTIME, BUILDHOST) to accommodate RPM package specifics. Previous changes, like clamping modification times to SOURCE_DATE_EPOCH and using the `add-determinism` tool to standardize metadata, have already achieved 90% reproducibility.\n\nReaching 99% requires packagers to treat reproducibility issues as bugs. The `fedora-repro-build` utility will allow local rebuild testing, and a public `rebuilderd` instance will provide independent verification.  Fedora's packaging guidelines will be updated to encourage reproducible builds, with bugs filed against non-reproducible packages. While some packages, like those using Haskell or Go, face reproducibility challenges, the effort aims to improve package quality by uncovering errors.\n\nDiscussions on the Fedora Discourse forum revolve around hosting and maintaining the `rebuilderd` instance, potentially outside Fedora infrastructure for independence. Integrating `rebuilderd` with existing tools like Koji and Copr for seamless workflow and testing is also considered. The proposal awaits FESCo approval before implementation, aiming for completion by Fedora 43's release.\n",
    "chinese_title": "Fedora 更改旨在实现 99% 的软件包可复现性",
    "chinese_summary": "LWN.net文章：Fedora计划在Fedora 43（预计2025年10月发布）实现99%软件包可复现性。可复现构建确保相同的源代码、构建环境和指令产生逐位相同的工件。虽然Fedora对构建过程有良好的控制，但可复现构建通过缓解供应链攻击和支持独立验证来增强安全性。\n\nFedora对可复现性的定义与Debian略有不同，排除了签名和一些元数据（如BUILDTIME、BUILDHOST），以适应RPM软件包的特性。之前的更改，如将修改时间钳制到SOURCE_DATE_EPOCH以及使用`add-determinism`工具标准化元数据，已经实现了90%的可复现性。\n\n达到99%的要求需要打包者将可复现性问题视为bug。`fedora-repro-build`实用程序将允许本地重新构建测试，而公共的`rebuilderd`实例将提供独立验证。Fedora的打包指南将被更新，以鼓励可复现构建，并针对不可复现的软件包提交bug。虽然一些软件包（如使用Haskell或Go的软件包）面临可复现性挑战，但该工作旨在通过发现错误来提高软件包质量。\n\nFedora Discourse论坛上的讨论围绕托管和维护`rebuilderd`实例展开，可能在Fedora基础设施之外进行以保证独立性。还将考虑将`rebuilderd`与现有工具（如Koji和Copr）集成，以实现无缝的工作流程和测试。该提案在实施之前还需要获得FESCo的批准，目标是在Fedora 43发布之前完成。"
  },
  {
    "id": "43653885",
    "title": "Adobe deletes Bluesky posts after backlash",
    "url": "https://petapixel.com/2025/04/10/adobe-deletes-bluesky-posts-after-furious-backlash/",
    "summary": "Adobe's attempt to engage with artists and designers on the Twitter alternative Bluesky backfired spectacularly. After creating accounts for Adobe and Photoshop, the company was met with a barrage of criticism from users unhappy with Adobe's business practices. Key complaints centered on the company's subscription model, price hikes, and adoption of AI.\n\nUsers referenced rising prices for software perceived as declining in quality, and accused Adobe of supporting AI-generated art on \"fascist-owned\" X (formerly Twitter).\n\nThe negative reaction was so intense that Adobe ultimately deleted its initial posts on both accounts. Bluesky users celebrated the removal of the posts, highlighting the widespread animosity towards the company among the artistic community. This unpopularity stems from Adobe's shift to a subscription model over a decade ago, compounded by recent price increases and the company's embrace of artificial intelligence. An editor from PetaPixel noted Adobe's strained relationship with photographers and media due to poor communication and negative press.\n",
    "chinese_title": "Adobe 因强烈反对删除 Bluesky 帖子",
    "chinese_summary": "Adobe在Bluesky上与艺术家和设计师互动的尝试惨遭滑铁卢。在创建Adobe和Photoshop的账户后，该公司遭到了大量用户的批评，这些用户对Adobe的商业行为感到不满。主要的抱怨集中在该公司的订阅模式、价格上涨以及对人工智能的采用。\n\n用户提到了被认为质量下降的软件价格上涨，并指责Adobe在“法西斯所有”的X（前身为Twitter）上支持人工智能生成的艺术。\n\n负面反应非常强烈，以至于Adobe最终删除了其在两个账户上的初始帖子。Bluesky用户庆祝这些帖子的删除，突显了艺术界对该公司的普遍敌意。这种不受欢迎源于Adobe十多年前转向订阅模式，加上最近的价格上涨以及该公司对人工智能的拥抱。PetaPixel的一位编辑指出，由于沟通不畅和负面新闻，Adobe与摄影师和媒体的关系一直紧张。"
  },
  {
    "id": "43619032",
    "title": "Intentionally Making Close Friends (2021)",
    "url": "https://www.neelnanda.io/blog/43-making-friends",
    "summary": "Neel Nanda's article, \"Intentionally Making Close Friends,\" details his journey from having superficial friendships to deliberately cultivating deep emotional connections. He realized that forming close friendships wasn't a natural process for him but a skill that could be learned and optimized.\n\nHis initial approach involved identifying the turning points in existing friendships and replicating them by engineering vulnerable, 1-on-1 conversations, often using a curated list of personal questions. While initially awkward, this experiment proved surprisingly successful, breaking him out of a cycle of superficial interactions.\n\nNanda stresses the importance of agency in actively seeking out and nurturing these connections, challenging the passive mindset that friendships should \"just happen.\" He advocates for being intentional while remaining authentic, suggesting tactics like openly discussing his strategies.\n\nKey advice includes \"seeking excitement\" in conversations by focusing on what both parties find engaging and employing \"recursive curiosity\" to delve deeper into interesting topics. He also emphasizes the role of vulnerability, advocating for creating a safe space for sharing and connecting on a deeper emotional level. Nanda believes that intentional effort, when applied thoughtfully, can significantly enhance the quality and depth of friendships, leading to a more fulfilling life. The core message is that close friendships require proactive effort and that individuals can improve their ability to form and maintain these relationships.\n",
    "chinese_title": "刻意结交密友 (2021)",
    "chinese_summary": "尼尔·南达的文章《有意结交挚友》详细描述了他从只有肤浅友谊到刻意培养深厚情感联系的历程。他意识到，对他而言，建立亲密友谊并非自然而然的过程，而是一种可以学习和优化的技能。\n\n他最初的方法包括识别现有友谊中的转折点，并通过设计脆弱的、一对一的对话来复制它们，通常使用一份精选的个人问题清单。虽然最初很尴尬，但这个实验被证明出人意料地成功，使他摆脱了肤浅互动的循环。\n\n南达强调了在积极寻找和培养这些联系中的主动性的重要性，挑战了友谊应该“自然发生”的被动心态。他提倡保持真诚的同时保持有意为之，并建议采用公开讨论他的策略等方法。\n\n关键建议包括通过关注双方都感兴趣的内容，在对话中“寻求兴奋点”，并运用“递归好奇心”来深入研究有趣的话题。他还强调了脆弱性的作用，主张创造一个安全的空间，以便进行分享并在更深的情感层面上建立联系。南达认为，深思熟虑地应用有意的努力可以显著提高友谊的质量和深度，从而带来更充实的生活。核心信息是，亲密的友谊需要积极的努力，并且个人可以提高他们建立和维持这些关系的能力。"
  },
  {
    "id": "43639253",
    "title": "Why 'Prince Rupert's Drop' Glass Is Strong Enough to Shatter a Bullet (2023)",
    "url": "https://www.popularmechanics.com/science/a40008994/why-the-prince-ruperts-drop-is-so-strong/",
    "summary": "This Popular Mechanics article explains the science behind the surprising strength of Prince Rupert's drops, glass teardrops that can even shatter bullets. The drops are created by dripping molten glass into cold water, causing the surface to cool rapidly and form a hardened shell. The interior then cools and retracts, compressing the inner core and creating immense tension within the drop. This compressive force acts as a shock absorber, making the rounded part of the drop incredibly strong.\n\nThe article details how a shockwave travels through the drop when the bulb is struck, leading to its near-instantaneous destruction. The bullet itself can shatter upon impact due to the release of the compressive force in the glass.\n\nBeyond their novelty, Prince Rupert's drops demonstrate the principle of compressive strength, which is utilized in technologies like Gorilla Glass. Gorilla Glass is made using ion exchange, where larger potassium ions replace smaller sodium ions on the glass surface, generating pressure and compressing the interior. This balanced compression creates a strong protective layer, as demonstrated by MythBusters in the linked Corning video, and could be applied to devices like cell phones. While not unbreakable, Gorilla Glass offers significant protection against damage.\n",
    "chinese_title": "为什么“鲁珀特王子之泪”玻璃能强大到击碎子弹 (2023)",
    "chinese_summary": "这篇《大众机械》的文章解释了鲁珀特之泪惊人强度背后的科学原理。鲁珀特之泪是一种玻璃泪珠，甚至可以击碎子弹。它是通过将熔融玻璃滴入冷水中制成的，导致表面迅速冷却并形成硬化外壳。然后，内部冷却并收缩，压缩内部核心并在泪珠内部产生巨大的张力。这种压缩力就像一个减震器，使泪珠的圆形部分异常坚固。\n\n文章详细介绍了当冲击泪珠球部时，冲击波如何在泪珠中传播，导致其近乎瞬间的破坏。由于玻璃中压缩力的释放，子弹本身在撞击时可能会破碎。\n\n除了其新颖性之外，鲁珀特之泪还展示了抗压强度的原理，该原理已应用于诸如大猩猩玻璃之类的技术中。大猩猩玻璃是使用离子交换制成的，其中较大的钾离子取代了玻璃表面的较小钠离子，从而产生压力并压缩内部。正如探索频道节目《流言终结者》在链接的康宁视频中所展示的那样，这种平衡的压缩创造了一个坚固的保护层，并且可以应用于像手机这样的设备。虽然不是坚不可摧的，但大猩猩玻璃提供了显著的防损伤保护。"
  },
  {
    "id": "43626108",
    "title": "Yakread's Ranking Algorithm",
    "url": "https://obryant.dev/p/yakread-algorithm/",
    "summary": "This article describes the core ranking algorithm behind Yakread, a personalized feed combining newsletter/RSS subscriptions and bookmarked articles. The algorithm focuses on selecting and ordering content to present in a user's \"For You\" feed.\n\nFor **Bookmarks**, items are initially sorted by \"freshness\" (least skips, most recent bookmark). A near-linear shuffle with a `p` parameter (set to 0.1, resulting in a 65% chance the first item will be in the top 10 of the freshest) adds some randomness.  Finally, the algorithm limits recommendations to one bookmark per website to avoid dominance from single domains.\n\nFor **Subscriptions**, the process involves two key steps. First, the algorithm calculates an \"affinity score\" for each subscription based on user interactions (views, skips, likes, dislikes) using weighted values and a \"beta distribution expected value.\" New subscriptions get a starting bonus. Subscriptions are then prioritized with pinned subscriptions interleaved into the list based on affinity, with a 30% chance to choose a pinned subscription regardless of score. Finally, the subscriptions are shuffled and the algorithm picks the 'freshest' item from each subscription, similar to the bookmark selection.\n\n**Interleaving** bookmarks and subscriptions is done by comparing items pairwise. Weighted random selection is used based on the number of times each item has been skipped, favoring items that have been skipped less. This ensures a balance between the two content types.\n",
    "chinese_title": "Yakread排名算法",
    "chinese_summary": "本文介绍 Yakread 背后的核心排序算法，它是一个结合了新闻邮件/RSS订阅和书签文章的个性化信息流。该算法专注于选择和排序内容，以便在用户的“为你推荐”信息流中呈现。\n\n对于**书签**，项目最初按“新鲜度”（最少跳过，最新书签）排序。 接近线性的洗牌，带有一个 `p` 参数（设置为 0.1，导致 65% 的几率第一个项目将位于最新项目的前 10 名）增加了一些随机性。 最后，该算法将推荐限制为每个网站一个书签，以避免单个域名占据主导地位。\n\n对于**订阅**，该过程涉及两个关键步骤。 首先，该算法基于用户交互（浏览、跳过、喜欢、不喜欢）使用加权值和“贝塔分布期望值”来计算每个订阅的“亲和力得分”。 新订阅会获得一个起始奖励。 然后，订阅按优先级排序，并将置顶订阅根据亲和力穿插到列表中，无论分数如何，都有 30% 的几率选择置顶订阅。 最后，对订阅进行洗牌，算法从每个订阅中选择“最新”的项目，类似于书签选择。\n\n**交错**书签和订阅是通过成对比较项目来完成的。 基于每个项目被跳过的次数使用加权随机选择，从而偏向于跳过次数较少的项目。 这确保了两种内容类型之间的平衡。"
  },
  {
    "id": "43621378",
    "title": "A 32-bit processor made with an atomically thin semiconductor",
    "url": "https://arstechnica.com/science/2025/04/researchers-build-a-risc-v-processor-using-a-2d-semiconductor/",
    "summary": "Researchers in China have created a 32-bit RISC-V processor, named RV32-WUJI, using molybdenum disulfide (MoS2), an atomically thin semiconductor, instead of silicon. This is a significant step towards \"beyond silicon\" hardware. MoS2, similar to graphene, forms a single-atom-thick sheet and, unlike graphene, is a semiconductor.\n\nThe processor uses nearly 6,000 transistors and can execute the full 32-bit RISC-V instruction set, although it operates at kilohertz clock speeds and adds single bits at a time. A key challenge was the inability to dope MoS2 like silicon. The team overcame this by using different metals (aluminum and gold) for wiring and adjusting transistor threshold voltages based on wiring material and embedding. Machine learning was used to optimize wiring and materials for individual transistor performance.\n\nThe processor employs depletion-mode inverters and was built using 18 functional logic gates (out of 25 tested). Chip-level yield was high (99.8%), but yields for larger registers (e.g., 64-bit) were significantly lower.\n\nWhile the processor demonstrates the feasibility of complex circuits with MoS2, the authors don't see it replacing silicon. Instead, they envision niche applications like ultra-low-power processing for simple sensors, acknowledging its potential for future expansion. The research highlights progress in using 2D materials for advanced electronics.\n",
    "chinese_title": "用原子级薄半导体制造的32位处理器",
    "chinese_summary": "中国研究人员利用二硫化钼（MoS2）——一种原子级薄半导体材料，而非硅，制造了一款名为RV32-WUJI的32位RISC-V处理器。这是向“超越硅”硬件迈出的重要一步。二硫化钼与石墨烯类似，形成单原子厚度的薄片，但与石墨烯不同，它是一种半导体。\n\n该处理器使用了近6000个晶体管，可以执行完整的32位RISC-V指令集，但其运行频率为千赫兹级别，并且每次只能添加单个比特。一个关键的挑战是无法像硅一样掺杂二硫化钼。该团队通过使用不同的金属（铝和金）进行布线，并根据布线材料和嵌入调整晶体管阈值电压来克服了这一问题。机器学习被用于优化布线和材料，以提高单个晶体管的性能。\n\n该处理器采用耗尽型反相器，并使用18个功能逻辑门（在25个测试的逻辑门中）构建。芯片级的良率很高（99.8%），但较大寄存器（例如，64位）的良率明显较低。\n\n虽然该处理器证明了用二硫化钼构建复杂电路的可行性，但作者并不认为它可以取代硅。相反，他们设想了诸如简单传感器超低功耗处理等特定应用，并承认其未来扩展的潜力。这项研究突出了在先进电子产品中使用二维材料的进展。"
  },
  {
    "id": "43655221",
    "title": "Erlang's not about lightweight processes and message passing (2023)",
    "url": "https://stevana.github.io/erlangs_not_about_lightweight_processes_and_message_passing.html",
    "summary": "This article argues that Erlang's true power isn't simply lightweight processes and message passing, but its structured approach using \"behaviours.\" The author explains that Erlang, initially designed for reliable distributed systems at Ericsson, relies on generic components called behaviours to achieve reliability.\n\nBehaviours are similar to interfaces in other languages, defining a contract for implementations. The article highlights the `gen_server` behaviour as a key example, demonstrating how it encapsulates concurrency, allowing developers to write sequential code while the `gen_server` handles the concurrent requests.\n\nThe author emphasizes that Erlang provides a set of crucial behaviours like `gen_server`, `gen_event` (event manager), `gen_statem` (state machine), `supervisor`, `application`, and `release`, and argues that these are sufficient for building robust distributed systems. Supervisors, in particular, are crucial for fault tolerance by monitoring and restarting failing processes based on predefined strategies, embracing the \"Let it crash!\" philosophy.\n\nThe article uses Ericsson's AXD301 telephone switch, built with Erlang, as a case study, showcasing its remarkable reliability (99.9999999%). The author concludes by suggesting that other languages should adopt Erlang's structured behaviour approach rather than just mimicking its concurrency primitives, proposing a generic interface signature of Input -> State -> (State, Output) as a starting point for implementing behaviours in other languages.\n",
    "chinese_title": "Erlang并非关于轻量级进程和消息传递 (2023)",
    "chinese_summary": "Erlang真正强大的地方并非轻量级进程和消息传递，而是其使用“行为”的结构化方法。作者解释说，Erlang最初为爱立信的可靠分布式系统而设计，依靠被称为行为的通用组件来实现可靠性。\n\n行为类似于其他语言中的接口，定义了实现的契约。本文重点介绍了`gen_server`行为作为一个关键示例，展示了它如何封装并发性，使开发人员能够编写顺序代码，而`gen_server`处理并发请求。\n\n作者强调，Erlang提供了一组关键行为，如`gen_server`、`gen_event`（事件管理器）、`gen_statem`（状态机）、`supervisor`、`application`和`release`，并认为这些足以构建健壮的分布式系统。尤其是Supervisor，通过根据预定义的策略监视和重启失败的进程，从而实现容错，秉承了“任其崩溃！”的理念。\n\n本文以爱立信用Erlang构建的AXD301电话交换机为例，展示了其卓越的可靠性（99.9999999%）。作者最后建议，其他语言应采用Erlang的结构化行为方法，而不仅仅是模仿其并发原语，并提出Input -> State -> (State, Output)的通用接口签名，作为在其他语言中实现行为的起点。"
  },
  {
    "id": "43640204",
    "title": "Retro Computing Artifacts Stream",
    "url": "https://retro-computing-stream.onrender.com/",
    "summary": "This article describes a \"Retro Computing Artifacts Stream,\" a continuous and automatically updating feed of vintage computing materials sourced from the Internet Archive. The stream allows users to browse through digitized artifacts related to the history of computing. Users can either manually scroll through the content or passively watch as new images automatically appear. The core function is to provide a curated, evolving window into retro computing history, making the vast archive accessible and engaging for those interested in the evolution of computers. The user interface includes a feature to pause the auto-scrolling, allowing for closer inspection of individual items. In essence, the stream acts as a \"time machine\" transporting users through the digital history of computing.\n",
    "chinese_title": "复古计算文物直播",
    "chinese_summary": "本文介绍了一种“复古计算文物流”，这是一个持续且自动更新的 feed，其复古计算材料来源于互联网档案馆。该流允许用户浏览与计算历史相关的数字化文物。用户可以手动滚动浏览内容，也可以被动地观看新图像自动出现。其核心功能是提供一个经过策划、不断发展的窗口，让人们了解复古计算的历史，使浩瀚的档案资料对那些对计算机发展感兴趣的人来说更易于访问和参与。用户界面包含暂停自动滚动的特性，以便更仔细地检查单个项目。本质上，该流就像一台“时间机器”，将用户带回计算的数字历史。"
  },
  {
    "id": "43661329",
    "title": "Rust to C compiler – 95.9% test pass rate, odd platforms",
    "url": "https://fractalfir.github.io/generated_html/cg_clr_odd_platforms.html",
    "summary": "This article provides an update on the author's Rust to C compiler project, `rustc_codegen_clr`. The big news is the author will be giving a talk about the project at Rust Week in Utrecht.\n\nSignificant progress has been made, with the core test pass rate increasing to 95.9%. Recent bug fixes focused on 128-bit intrinsics, checked arithmetic, and subslicing. Issues with truncating 128-bit integers in bit counting intrinsics were resolved by summing the popcounts of the lower and higher 64-bit halves.  A simple but inefficient overflow check was implemented for 128-bit multiplication.  A subslicing bug caused by incorrect pointer offsetting was fixed.\n\nThe author is leveraging Rust's built-in emulated versions of intrinsics where possible, particularly for complex operations like `carrying_mul_add` which requires 256-bit calculations.  Efforts are also underway to improve compatibility with a wider range of C compilers, including those on obscure platforms, to potentially enable Rust support where LLVM or GCC is unavailable.  The goal is to target standard C99/ANSI C and POSIX APIs.\n\nMinor performance improvements were achieved by optimizing integer literal formatting and streamlining the `#line` directive usage for debug information. Internal refactoring in `rustc_codegen_clr` is ongoing, with parts split into separate crates to improve build times, and a move towards a more memory-efficient interned IR.\n\nFinally, the author plans to write about Rust panics and a memory profiler in the future.\n",
    "chinese_title": "Rust到C编译器 – 95.9%测试通过率，奇特平台",
    "chinese_summary": "`rustc_codegen_clr` 项目进展：Rust to C 编译器近况及 Rust Week 演讲预告\n\n本文更新作者的 Rust to C 编译器项目 `rustc_codegen_clr` 的进展。重磅消息是作者将在乌得勒支的 Rust Week 上就该项目发表演讲。\n\n项目已取得显著进展，核心测试通过率提升至 95.9%。最近的错误修复主要集中在 128 位内部函数、溢出检查算术和子切片上。通过对高低 64 位半部分进行 popcount 求和，解决了位计数内部函数中截断 128 位整数的问题。对 128 位乘法实现了一个简单但低效的溢出检查。修复了由不正确的指针偏移引起的子切片错误。\n\n作者尽可能利用 Rust 内置的模拟内部函数版本，特别是对于像 `carrying_mul_add` 这样需要 256 位计算的复杂操作。 还在努力提高与更广泛的 C 编译器的兼容性，包括那些在冷门平台上的编译器，以期在 LLVM 或 GCC 不可用的情况下实现 Rust 支持。目标是定位标准的 C99/ANSI C 和 POSIX API。\n\n通过优化整数文字格式化和简化 `#line` 指令在调试信息中的使用，实现了小幅性能提升。`rustc_codegen_clr` 的内部重构正在进行中，部分代码被拆分为单独的 crate 以缩短构建时间，并且正在朝着更节省内存的 interned IR 方向发展。\n\n最后，作者计划将来撰写关于 Rust 恐慌和内存分析器的文章。"
  },
  {
    "id": "43629380",
    "title": "C++: terser (shorter) lambda == SHORTY (ab-use?)",
    "url": "https://github.com/hanickadot/shorty",
    "summary": "The \"SHORTY\" C++ library offers a terser syntax for lambdas, aiming to reduce boilerplate without creating a full lazy DSL. It leverages the `shorty::literals` namespace to provide shorthand for common lambda operations.\n\nKey features include simplified comparisons (e.g., `$lhs > $rhs` for sorting), concise filtering and transformations using views (e.g., `$i % 2 == 0` for filtering even numbers), and easy calling of external functions using `$call<sqrt>` or `$<sqrt>`. Casting is also simplified using `$cast<int>` or `<int>`.\n\nSHORTY provides several ways to access arguments within the lambda: numerically using `$0-$9` or `$arg<N>`, by name using `$a-$f`, `$x`, `$y`, `$z`, or `$i`, `$n`, `$k`, `$in`, and specialized access using `$lhs`, `$rhs` for binary callables or `$it` for single-argument iterators. It automatically unwraps tuple-like arguments for single-argument lambdas and lazy calls. `$argc` returns the number of arguments, and `$args` provides all arguments as a tuple.\n\nThe library also handles capturing variables by reference (`$(v)` or `$ref(v)`), by value (`$value(v)`, `$val(v)`, or `$copy(v)`), and as compile-time constants (`$fixed<v>` or `$const<v>`).  It supports calling functions (or constructing new objects) using `$call<callable>(args...)` and creating tuples using `($a, $b, $c)`. Assignment operators like `+=`, `-=`, etc., are also supported directly on arguments.\n",
    "chinese_title": "C++: 更精简的 Lambda == SHORTY (滥用?)",
    "chinese_summary": "\"SHORTY\" C++ 库为 lambda 表达式提供了更简洁的语法，旨在减少样板代码，而无需创建完整的惰性 DSL。它利用 `shorty::literals` 命名空间为常用的 lambda 操作提供简写。\n\n主要特性包括简化的比较（例如，`$lhs > $rhs` 用于排序），使用视图进行简洁的过滤和转换（例如，`$i % 2 == 0` 用于过滤偶数），以及使用 `$call<sqrt>` 或 `$<sqrt>` 轻松调用外部函数。 使用 `$cast<int>` 或 `<int>` 也简化了类型转换。\n\nSHORTY 提供了几种访问 lambda 表达式中参数的方法：使用 `$0-$9` 或 `$arg<N>` 进行数值访问，使用 `$a-$f`、`$x`、`$y`、`$z` 或 `$i`、`$n`、`$k`、`$in` 进行名称访问，以及使用 `$lhs`、`$rhs`（用于二元可调用对象）或 `$it`（用于单参数迭代器）进行专用访问。 它会自动解包单参数 lambda 表达式和惰性调用的类元组参数。 `$argc` 返回参数数量，`$args` 将所有参数作为元组提供。\n\n该库还处理按引用捕获变量 (`$(v)` 或 `$ref(v)`)，按值捕获变量 (`$value(v)`、`$val(v)` 或 `$copy(v)`)，以及作为编译时常量捕获变量 (`$fixed<v>` 或 `$const<v>`)。 它支持使用 `$call<callable>(args...)` 调用函数（或构造新对象），并使用 `($a, $b, $c)` 创建元组。 也支持直接对参数使用赋值运算符，如 `+=`、`-=` 等。"
  },
  {
    "id": "43628070",
    "title": "Blue Prince is a roguelike puzzle masterpiece",
    "url": "https://mssv.net/2025/04/07/a-puzzle-designer-on-blue-prince-a-roguelike-puzzle-masterpiece/",
    "summary": "\"Blue Prince\" is a roguelike puzzle game set in a sprawling mansion where the player, as the grandnephew of the late Herbert S. Sinclair, must find the 46th room to inherit the estate. The game combines roguelike mechanics with puzzle-solving, exploration, and storytelling.\n\nEach \"run\" involves drafting rooms from a choice of three to create a 5x9 grid mansion layout, balancing resources, exits, and goals. Rooms are filled with clues, notes, and environmental puzzles that contribute to a non-linear story about obsession, expectations, and generational trauma. While puzzle-solving provides rewards, the game offers alternative paths to reach the 46th room, making no puzzle mandatory.\n\n\"Blue Prince\" includes a slot-machine like element, with chances to obtain needed items, which the reviewer found addictive. The game includes persistent upgrades which mitigate repetitive elements, and a subtle hint system. Despite the element of chance, the game is fair and compensates for bad luck.\n\nThe reviewer acknowledges that the randomized systems may lead some players to experience the story more as a \"vibe\" than a coherent narrative, but praises the game's overall design, story, and addictive gameplay. The reviewer finished the game in 17 hours but says there is still plenty left to discover.\n",
    "chinese_title": "蓝王子：类Rogue益智杰作",
    "chinese_summary": "《蓝王子》是一款roguelike解谜游戏，背景设定在一座广阔的豪宅中。玩家扮演已故的赫伯特·S·辛克莱的侄孙，必须找到第46号房间才能继承遗产。该游戏结合了roguelike机制与解谜、探索和故事讲述。\n\n每次“挑战”都需要从三个房间中选择一个来构建一个5x9的网格豪宅布局，平衡资源、出口和目标。房间里充满了线索、笔记和环境谜题，这些都构成了一个关于痴迷、期望和代际创伤的非线性故事。虽然解谜能提供奖励，但游戏也提供了到达第46号房间的替代路径，因此没有谜题是强制性的。\n\n《蓝王子》包含一个类似老虎机的元素，有机会获得所需的物品，评论员认为这令人上瘾。游戏包含永久升级，可以减轻重复元素，并提供微妙的提示系统。尽管存在运气成分，但游戏是公平的，并能弥补坏运气。\n\n评论员承认，随机系统可能导致一些玩家将故事更多地体验为一种“氛围”而非连贯的叙事，但赞扬了游戏的整体设计、故事和令人上瘾的游戏玩法。评论员在17小时内完成了游戏，但表示仍有大量内容等待发现。"
  },
  {
    "id": "43640345",
    "title": "Ames Shovel and Tool Catalog of Shovels, Spades and Scoops (1926) [pdf]",
    "url": "https://stonehill-website.s3.amazonaws.com/files/resources/1926-ames-catalog-2.pdf",
    "summary": "This document is a heavily corrupted or unreadable PDF file, based on the standard PDF header and trailer structure combined with mostly gibberish content. The title indicates it's a 1926 catalog from Ames Shovel and Tool featuring shovels, spades, and scoops. However, the PDF data itself appears to be severely damaged, preventing the extraction of any meaningful content related to the catalog's contents, product details, or historical information about Ames. The presence of binary data and encoding issues throughout the file makes it impossible to summarize the actual catalog information that the title suggests. Attempts to decode and extract relevant information would require advanced data recovery techniques, and there's no guarantee of successful reconstruction of the original catalog content. In short, while the title suggests a valuable historical resource, the document in its current state is unusable.\n",
    "chinese_title": "艾姆斯铁锹工具公司铁锹、铲子和勺子目录 (1926) [pdf]",
    "chinese_summary": "该文档是一个严重损坏或无法读取的PDF文件，虽然具有标准的PDF文件头和文件尾结构，但其内容基本为乱码。标题显示其为Ames Shovel and Tool公司1926年的目录，内容包括铲子、锹和勺子。然而，PDF数据本身似乎受到了严重损坏，无法提取任何与目录内容、产品详情或关于Ames的历史信息相关的有意义的内容。文件中存在大量的二进制数据和编码问题，使得总结标题所暗示的实际目录信息成为不可能。尝试解码和提取相关信息需要高级数据恢复技术，并且无法保证成功重建原始目录内容。简而言之，虽然标题暗示着一个有价值的历史资源，但该文档目前的状态是无法使用的。"
  },
  {
    "id": "43643467",
    "title": "Once lush Sahara was home to a surprisingly unique group of humans",
    "url": "https://www.sciencealert.com/once-lush-sahara-was-home-to-a-surprisingly-unique-group-of-humans",
    "summary": "A new genetic analysis reveals that the Sahara Desert, once a lush savanna, was home to a surprisingly isolated and unique group of humans around 7,000 years ago. Researchers sequenced ancient DNA from two female individuals found in the Takarkori rock shelter in Libya, discovering they shared the most genetic similarities with 15,000-year-old foragers from Morocco. This suggests a stable North African population existed before and during the Saharan humid period, distinct from sub-Saharan Africans, even though they all branched off the original human migration out of Africa.\n\nWhile largely isolated, this Saharan lineage received small traces of genes from the Levantine region, including some Neanderthal DNA. Interestingly, the Takarkori individuals had less Neanderthal DNA than the Moroccan foragers, indicating a barrier preventing further gene flow from Europe extending beyond the Sahara.\n\nArchaeological evidence indicates that the Takarkori people were early herders of livestock, a practice adopted without significant gene exchange. This suggests that pastoralism spread through cultural exchange, not large-scale migration. The Sahara's diverse ecosystems, including wetlands and mountains, may have acted as a southern barrier to migration. This research provides insights into human migrations, adaptations, and cultural evolution in a key region of Africa.\n",
    "chinese_title": "曾经绿意盎然的撒哈拉是令人惊讶的独特人类群体的家园。",
    "chinese_summary": "一项新的基因分析显示，撒哈拉沙漠在7000年前曾是一片茂盛的热带草原，是居住着一个令人惊讶的孤立和独特人类群体的家园。研究人员对在利比亚塔卡科里岩棚发现的两名女性个体的古代DNA进行了测序，发现她们与来自摩洛哥的15000年前的采集者拥有最多的基因相似性。这表明，在撒哈拉湿润期之前和期间，存在一个稳定的北非人口，该人口不同于撒哈拉以南非洲人，尽管他们都起源于最初的非洲人类迁徙。\n\n虽然在很大程度上与世隔绝，但这个撒哈拉血统接受了来自黎凡特地区的少量基因，包括一些尼安德特人DNA。有趣的是，塔卡科里个体所含的尼安德特人DNA比摩洛哥采集者少，这表明存在一个屏障，阻止了来自欧洲的进一步基因流动延伸到撒哈拉沙漠之外。\n\n考古证据表明，塔卡科里人是早期的牲畜牧民，这一习俗是在没有重大基因交流的情况下采用的。这表明畜牧业是通过文化交流传播的，而不是大规模迁徙。撒哈拉沙漠的多样化生态系统，包括湿地和山脉，可能充当了南部迁徙的屏障。这项研究为了解非洲关键地区的人类迁徙、适应和文化进化提供了见解。"
  },
  {
    "id": "43612835",
    "title": "Bonobos use a kind of syntax once thought to be unique to humans",
    "url": "https://www.newscientist.com/article/2474993-bonobos-use-a-kind-of-syntax-once-thought-to-be-unique-to-humans/",
    "summary": "This article reports on a groundbreaking discovery: bonobos exhibit a form of syntax, specifically \"non-trivial compositionality,\" previously thought unique to humans. Researchers at the Kokolopori Bonobo Reserve in the Democratic Republic of the Congo, led by Mélissa Berthet, analyzed nearly 1000 bonobo vocalizations, meticulously recording contextual information to decipher the meaning of individual calls and their combinations.\n\nUsing linguistic techniques, they created a \"dictionary\" of bonobo calls and their meanings.  They identified four compositional calls, three of which demonstrated non-trivial compositionality, meaning the combined call conveyed a meaning distinct from the sum of its individual components. An example is \"high-hoot + low-hoot,\" which combines \"pay attention to me\" and \"I am excited\" to mean \"pay attention to me because I am in distress,\" often used when seeking support against intimidation.\n\nThe findings suggest that this type of syntax is evolutionarily ancient, predating the divergence of humans, chimpanzees, and bonobos. While this doesn't mean bonobos have language in the human sense, it demonstrates a complex communication system sharing parallels with human language. The discovery, hailed as revolutionary, opens new avenues for comparative and evolutionary linguistics, suggesting the capacity for compositionality was likely inherited from our last common ancestor, potentially over 7 million years ago.\n",
    "chinese_title": "倭黑猩猩使用一种曾被认为人类独有的句法。",
    "chinese_summary": "本文报道了一项突破性发现：倭黑猩猩表现出一种句法形式，特别是“非平凡组合性”，这曾被认为是人类独有的。由梅丽莎·贝尔特（Mélissa Berthet）领导的研究人员在刚果民主共和国的科科洛波里倭黑猩猩保护区分析了近 1000 种倭黑猩猩的发声，仔细记录了背景信息，以解读单个叫声及其组合的含义。\n\n利用语言学技术，他们创建了一个倭黑猩猩叫声及其含义的“字典”。他们识别出四种组合叫声，其中三种表现出非平凡组合性，这意味着组合后的叫声传达的含义与单个组成部分的简单相加不同。例如，“高音呼叫 + 低音呼叫”结合了“注意我”和“我感到兴奋”的意思，表示“注意我，因为我处于困境中”，通常在寻求支持以对抗恐吓时使用。\n\n研究结果表明，这种类型的句法在进化上是很古老的，早于人类、黑猩猩和倭黑猩猩的分化。虽然这并不意味着倭黑猩猩拥有人类意义上的语言，但它表明存在一种复杂的交流系统，与人类语言有相似之处。这项被誉为革命性的发现为比较和进化语言学开辟了新途径，表明组合能力很可能是从我们共同的祖先那里继承下来的，可能在 700 多万年前。"
  },
  {
    "id": "43653421",
    "title": "Windows 2000 Server named peak Microsoft",
    "url": "https://www.theregister.com/2025/04/11/windows_2000_best_microsoft/",
    "summary": "This article discusses the results of a survey asking readers of The Register to reflect on Microsoft's 50-year history, focusing on milestones and missteps. The consensus among commenters is that Windows 2000 Server represents Microsoft's peak. Readers appreciated its functionality and stability, contrasting it favorably with later operating systems like Windows 8 and 11. While some acknowledged the merits of XP, Windows 7, and even Vista, the overall sentiment leaned towards a decline after Windows 2000.\n\nThe article also touches upon the mixed feelings regarding Microsoft's acquisition of Nokia and its subsequent handling of Windows Phone, citing a lack of upgrade paths and inconsistent development frameworks as major failures. Humorously, one commenter pointed out that the high price and low quality of Microsoft's software were both notable \"high\" and \"low\" points, respectively. The Office suite received positive mentions.\n\nThe article acknowledges Microsoft's successful pivot to the cloud as an achievement, despite a lack of originality. It also recognizes the company's resilience in overcoming legal challenges. Ultimately, the article suggests that Microsoft's best days are behind it, with Windows 2000 Server serving as a highlight. The future will determine whether Microsoft's current focus on AI will be viewed as a success or a misstep.\n",
    "chinese_title": "名为微软高峰的Windows 2000服务器",
    "chinese_summary": "本文探讨了一项调查的结果，该调查邀请《The Register》的读者回顾微软 50 年的历史，重点关注里程碑和失误。评论者的普遍共识是 Windows 2000 Server 代表了微软的巅峰。读者们赞赏其功能性和稳定性，并将其与后来的操作系统（如 Windows 8 和 11）进行了鲜明对比。虽然有些人承认 XP、Windows 7 甚至 Vista 的优点，但总体情绪倾向于 Windows 2000 之后的衰落。\n\n本文还涉及了对微软收购诺基亚及其随后对 Windows Phone 处理的复杂情感，认为缺乏升级路径和不一致的开发框架是主要的失败之处。有趣的是，一位评论者指出，微软软件的高价格和低质量分别是显著的“高点”和“低点”。 Office 套件获得了积极评价。\n\n本文承认微软成功转型到云端是一项成就，尽管缺乏原创性。它还认识到该公司在克服法律挑战方面的韧性。最终，本文认为微软最好的日子已经过去，Windows 2000 Server 是一个亮点。未来将决定微软当前对人工智能的关注是否会被视为成功或失误。"
  },
  {
    "id": "43654813",
    "title": "WebRTC for the Curious",
    "url": "https://webrtcforthecurious.com",
    "summary": "\"WebRTC For The Curious\" is an open-source book designed to provide a comprehensive and unbiased understanding of WebRTC technology. It's aimed at developers of all levels, from those new to WebRTC to experienced implementers seeking deeper knowledge beyond basic APIs. The book focuses on protocols and APIs, summarizing RFCs and undocumented knowledge without being tied to specific software vendors or offering tutorials with extensive code.\n\nThe book's structure is designed for flexible learning, with self-contained chapters that can be read in any order. Each chapter addresses a single question in three levels: the problem being solved, the technical solution, and resources for further learning. No prior knowledge is required, allowing readers to begin at any point. While acknowledging that other resources may provide more in-depth information on specific topics, this book prioritizes teaching the entire WebRTC system.\n\nThe book is available on GitHub and WebRTCforTheCurious.com in ePub and PDF formats, licensed under CC0, meaning it's free to use without attribution. Committed to privacy, it's written by individuals for individuals, vendor-agnostic, and the website has no analytics or tracking. Contributions and improvements are welcomed through GitHub, and users can open issues, suggest changes, or contribute to development.\n",
    "chinese_title": "求知者的WebRTC",
    "chinese_summary": "面向求知者的WebRTC 是一本开源书籍，旨在提供对WebRTC技术的全面且公正的理解。它面向所有级别的开发者，从WebRTC新手到寻求超越基本API的更深入知识的经验丰富的实施者。本书侧重于协议和API，总结了RFC和未公开的知识，而不受特定软件供应商的束缚，也不提供包含大量代码的教程。\n\n本书的结构设计旨在实现灵活学习，各个章节彼此独立，可以以任何顺序阅读。每章都从三个层面解决一个问题：要解决的问题、技术解决方案以及进一步学习的资源。无需任何先验知识，读者可以从任何地方开始。虽然承认其他资源可能提供关于特定主题的更深入的信息，但本书优先教授整个WebRTC系统。\n\n本书以ePub和PDF格式在GitHub和WebRTCforTheCurious.com上提供，并采用CC0许可，这意味着可以免费使用而无需署名。本书致力于保护隐私，由个人为个人编写，与供应商无关，并且该网站没有分析或跟踪。欢迎通过GitHub提供贡献和改进，用户可以提出问题、建议更改或为开发做出贡献。"
  },
  {
    "id": "43638520",
    "title": "Every picture from Venus' surface, ever (2021)",
    "url": "https://www.planetary.org/articles/every-picture-from-venus-surface-ever",
    "summary": "This article showcases all the images ever taken from the surface of Venus, a feat accomplished solely by the Soviet Union's Venera probes in 1975 and 1982. The extreme heat and pressure on Venus make landing and capturing images exceedingly difficult. The Venera missions, four in total, transmitted panoramic images revealing yellow skies and desolate, cracked landscapes, offering a glimpse of a world that may have once resembled Earth before a catastrophic climate change event.\n\nThe article highlights the work of Ted Stryk, a philosophy professor who specializes in reconstructing images from early space missions. Using data from the Russian Academy of Sciences, Stryk has created the best possible versions of the original Venera panoramas. The article presents six panoramic images: Venera 9 (1975), Venera 10 (1975), Venera 13 front and rear cameras (1982), and Venera 14 front and rear cameras (1982).\n\nFinally, the article includes a call to action, urging readers to support NASA science funding by contacting their congressional representatives and to donate to the Planetary Society to advance space science and exploration.\n",
    "chinese_title": "金星地表的所有照片 (2021)",
    "chinese_summary": "本文展示了所有从金星表面拍摄的图像，这项壮举仅由苏联的金星探测器于1975年和1982年完成。金星上的极端高温和高压使得着陆和拍摄图像极其困难。金星任务总共四次，传回了全景图像，揭示了黄色的天空和荒凉、龟裂的景观，让我们得以一窥这个可能曾经类似于地球，但在灾难性的气候变化事件发生之前的世界。\n\n本文重点介绍了哲学教授泰德·斯特里克的工作，他专门从事早期太空任务图像的重建工作。斯特里克利用俄罗斯科学院的数据，创建了原始金星全景图像的最佳版本。文章展示了六张全景图像：金星9号（1975年）、金星10号（1975年）、金星13号前置和后置摄像头（1982年），以及金星14号前置和后置摄像头（1982年）。\n\n最后，本文包含一项行动号召，敦促读者通过联系他们的国会代表来支持美国宇航局的科学经费，并通过捐赠给行星学会来推进太空科学和探索。"
  },
  {
    "id": "43652723",
    "title": "But what if I want a faster horse?",
    "url": "https://rakhim.exotext.com/but-what-if-i-really-want-a-faster-horse",
    "summary": "This article argues that tech companies are increasingly prioritizing \"innovation\" that mimics TikTok's endless, algorithm-driven content stream at the expense of useful features and user control. The author uses the \"faster horse\" analogy, typically invoked to champion radical innovation, to argue that sometimes users simply want improved versions of existing solutions.\n\nThe author cites Netflix and Spotify as examples. He laments that Netflix has shifted from a reliable library with good recommendations to a confusing \"experience\" with a constantly shifting interface, meaningless categories, and unreliable catalog management. Similarly, Spotify is criticized for moving away from a straightforward music library with user control to a stream of ever-changing content and podcasts.\n\nThe core complaint is that these platforms are sacrificing consistency, user agency, and genuine UX improvement to chase the engagement model of TikTok, where users passively consume an endless feed of content. This trend extends to YouTube, LinkedIn, and even Substack, all of which are incorporating short-form video and algorithmic feeds. The author likens this to carcinisation, a form of convergent evolution, where different platforms are all evolving into a homogenous, TikTok-like experience, regardless of their original purpose or user needs. He concludes that the desire for useful enhancements to existing models is being overlooked in favor of chasing fleeting engagement metrics.\n",
    "chinese_title": "但如果我想要一匹更快的马呢？",
    "chinese_summary": "科技公司正日益牺牲实用功能和用户控制，转而优先发展模仿 TikTok 无尽、算法驱动的内容流的“创新”。本文认为，作者借用通常用于支持激进创新的“更快的马”类比，指出有时用户仅仅想要现有解决方案的改进版本。\n\n作者以 Netflix 和 Spotify 为例。他感叹 Netflix 已经从一个拥有良好推荐的可靠资源库，转变为一个令人困惑的“体验”，其界面不断变化、类别毫无意义，目录管理也并不可靠。同样，Spotify 也因偏离用户可控的简单音乐库，转向不断变化的内容和播客流而受到批评。\n\n核心问题是，这些平台正在牺牲一致性、用户自主性和真正的用户体验改进，以追逐 TikTok 的参与模式，即用户被动地消费源源不断的内容。这种趋势已经蔓延到 YouTube、LinkedIn 甚至 Substack，它们都在加入短视频和算法驱动的信息流。作者将其比作“蟹化”现象，一种趋同进化，不同的平台都在进化成同质化的、类似 TikTok 的体验，而忽略了它们最初的目的或用户需求。他总结说，人们对现有模式的有用改进的渴望，正被追逐短暂的参与度指标所忽视。"
  },
  {
    "id": "43651532",
    "title": "Lead is still bad for your brain",
    "url": "https://neurofrontiers.blog/why-lead-is-still-bad-for-your-brain/",
    "summary": "This article, \"Lead is Still Bad for Your Brain,\" highlights the enduring dangers of lead exposure despite past efforts to reduce its use. While enthusiastic use of lead in products like gasoline and paint has decreased, its persistence in the environment remains a concern. Lead doesn't degrade easily, meaning past contamination continues to pose a risk, compounded by its continued use in products like batteries.\n\nThe author emphasizes that there is no safe level of lead exposure, and that even small concentrations can have neurological effects, especially in children, whose bodies absorb lead more readily. Lead enters the body through the gut or lungs and accumulates in soft tissues and bones, potentially leaching back into the bloodstream later in life.\n\nChronic lead exposure is linked to memory problems, cognitive and behavioral issues, including decreased IQ and increased aggression. The mechanisms behind lead's neurotoxicity involve disrupting cell membrane fluidity, interfering with calcium-based neural communication, and generating reactive oxygen species that damage cells.\n\nThe article encourages proactive measures to mitigate lead exposure, such as safely removing lead paint or pipes, advocating for community lead removal programs, and supporting affected individuals. Although early intervention and enriched environments can help reverse some effects of lead exposure, the author stresses that prevention is key, particularly in older housing, industrial areas, and underfunded communities where lead contamination is more prevalent.\n",
    "chinese_title": "铅仍然对你的大脑有害",
    "chinese_summary": "铅仍然对你的大脑有害\n\n这篇文章《铅仍然对你的大脑有害》强调了铅暴露的持续危害，尽管过去已经努力减少其使用。虽然在汽油和油漆等产品中对铅的热情使用已经减少，但它在环境中的持久性仍然令人担忧。铅不易降解，这意味着过去的污染仍然构成风险，再加上它继续在电池等产品中使用，情况更加复杂。\n\n作者强调，铅暴露没有安全水平，即使是少量浓度也会产生神经系统影响，尤其是在儿童身上，他们的身体更容易吸收铅。铅通过肠道或肺部进入人体，并积聚在软组织和骨骼中，有可能在日后渗回血液中。\n\n长期铅暴露与记忆问题、认知和行为问题有关，包括智商下降和攻击性增加。铅的神经毒性机制包括破坏细胞膜流动性，干扰基于钙的神经通讯，以及产生损害细胞的活性氧。\n\n文章鼓励采取积极措施来减轻铅暴露，例如安全移除含铅油漆或管道，倡导社区铅移除计划，并支持受影响的个人。虽然早期干预和丰富的环境有助于逆转铅暴露的某些影响，但作者强调预防是关键，尤其是在较旧的房屋、工业区和资金不足的社区，这些地方铅污染更为普遍。"
  },
  {
    "id": "43655603",
    "title": "Leaked data reveals Israeli govt campaign to remove pro-Palestine posts on Meta",
    "url": "https://www.dropsitenews.com/p/leaked-data-israeli-censorship-meta",
    "summary": "According to leaked Meta data obtained by Drop Site News, the Israeli government has been aggressively campaigning to remove pro-Palestine content from Facebook and Instagram, with Meta complying with 94% of takedown requests since October 7, 2023. These requests often target users in Arab and Muslim-majority nations, with Israel being the biggest originator of takedown requests globally. The requests often categorize content as \"terrorism\" or \"violence and incitement,\" even without specific details. Meta's AI is also being trained on this takedown data, potentially leading to future biased moderation.\n\nWithin Meta, key positions are held by individuals with connections to the Israeli government, raising concerns about bias. The Integrity Organization, run by former Israeli military official Guy Rosen, enforces policies set by the Policy Organization, now headed by Joel Kaplan, who has previously worked with Israeli officials. Jordana Cutler, Meta’s Director of Public Policy for Israel and the Jewish Diaspora, has also intervened to flag pro-Palestine content, including material related to the late Palestinian writer Ghassan Kanafani.\n\nWhile most countries focus censorship efforts on their own citizens, Israel overwhelmingly targets users from Arab and Muslim-majority nations, with only a small fraction of takedown requests targeting Israeli users. Despite internal concerns raised about overenforcement against pro-Palestinian content, Meta leadership has prioritized removing potentially violating content over risking underenforcement. Human Rights Watch has also documented disproportionate removal of pro-Palestine content on Meta platforms.\n",
    "chinese_title": "泄露数据揭示以色列政府要求 Meta 删除支持巴勒斯坦帖文的活动",
    "chinese_summary": "根据Drop Site News获得的泄露Meta数据，以色列政府一直在积极游说从Facebook和Instagram上删除支持巴勒斯坦的内容，自2023年10月7日以来，Meta已配合了94%的删除请求。这些请求通常针对阿拉伯和穆斯林占多数国家的用戶，以色列是全球删除请求的最大发起者。这些请求经常将内容归类为“恐怖主义”或“暴力和煽动”，即使没有具体细节。Meta的人工智能也在接受这些删除数据的训练，可能导致未来出现带有偏见的审查。\n\n在Meta内部，关键职位由与以色列政府有关联的个人担任，这引起了人们对偏见的担忧。由前以色列军方官员盖伊·罗森运营的诚信组织负责执行政策组织制定的政策，而政策组织现在由曾与以色列官员合作过的乔尔·卡普兰领导。Meta负责以色列和犹太人散居地公共政策的主管约尔达娜·卡特勒也曾介入标记支持巴勒斯坦的内容，包括与已故巴勒斯坦作家加桑·卡纳法尼有关的材料。\n\n虽然大多数国家都将审查重点放在本国公民身上，但以色列主要针对来自阿拉伯和穆斯林占多数国家的用戶，只有一小部分删除请求针对以色列用戶。尽管内部提出了关于过度强制执行针对支持巴勒斯坦内容的担忧，但Meta领导层已优先考虑删除潜在的违规内容，而不是冒着执行不足的风险。人权观察组织也记录了Meta平台上不成比例地删除了支持巴勒斯坦的内容。"
  },
  {
    "id": "43654912",
    "title": "Bilinear interpolation on a quadrilateral using Barycentric coordinates",
    "url": "https://gpuopen.com/learn/bilinear-interpolation-quadrilateral-barycentric-coordinates/",
    "summary": "This short announcement highlights the availability of new DirectX and video encoding features through the AgilitySDK Preview Release 1.716.0. The core message is that developers now have access to enhanced capabilities in these areas, suggesting potential improvements in graphics rendering and video processing. While the specific new features aren't detailed, the announcement serves as a notification and invitation for developers to explore and utilize the updated AgilitySDK.\n",
    "chinese_title": "使用重心坐标在四边形上进行双线性插值",
    "chinese_summary": "通过 AgilitySDK 预览版 1.716.0 发布 DirectX 和视频编码新功能通知。"
  },
  {
    "id": "43655914",
    "title": "Datastar: Web Framework for the Future?",
    "url": "https://chrismalek.me/posts/data-star-first-impressions/",
    "summary": "Chris Malek explores Datastar, a new hypermedia framework aimed at simplifying real-time web application development, presenting it as a potential alternative to HTMX. He emphasizes Datastar's server-driven architecture, use of Server-Sent Events (SSE) for rapid updates, and \"signals\" for automatic UI changes, aligning with his preference for backend-centric solutions stemming from his PeopleSoft ERP background.\n\nMalek's frustration with HTMX's complexity, especially regarding frontend interactions and reliance on JavaScript (which he dislikes), led him to revisit Datastar. He highlights key aspects of Datastar, including signals for reactive programming, SSE for efficient data streaming, actions to trigger server logic, and HTML fragments for UI updates.\n\nDatastar offers benefits of both HTMX and AlpineJS under a single library. This approach allows developers to handle UI state and interactions without heavy reliance on JavaScript, making it suitable for those who prefer backend control. Malek emphasizes the importance of understanding \"signals\" for simplifying UI development and reactive programming. He also notes Datastar's backend-agnostic nature, making it compatible with Go (his preferred language) and other server-side languages.\n",
    "chinese_title": "Datastar：面向未来的Web框架？",
    "chinese_summary": "Chris Malek 探索 Datastar，一款旨在简化实时 Web 应用开发的新型超媒体框架，并将其视为 HTMX 的潜在替代方案。他强调 Datastar 的服务器驱动架构、利用服务器发送事件 (SSE) 实现快速更新，以及用于自动 UI 更改的“信号”，这与他偏爱源于 PeopleSoft ERP 背景的后端中心解决方案的倾向相符。\n\nMalek 对 HTMX 复杂性的不满，尤其是在前端交互和依赖 JavaScript（他不喜欢）方面，促使他重新审视 Datastar。他强调了 Datastar 的关键方面，包括用于反应式编程的信号、用于高效数据流的 SSE、用于触发服务器逻辑的操作以及用于 UI 更新的 HTML 片段。\n\nDatastar 融合了 HTMX 和 AlpineJS 的优势于单一库中。 这种方法允许开发人员在不严重依赖 JavaScript 的情况下处理 UI 状态和交互，使其适合那些喜欢后端控制的人。 Malek 强调了理解“信号”对于简化 UI 开发和反应式编程的重要性。 他还指出 Datastar 的后端无关性，使其与 Go（他首选的语言）和其他服务器端语言兼容。"
  },
  {
    "id": "43663777",
    "title": "AI can't stop making up software dependencies and sabotaging everything",
    "url": "https://www.theregister.com/2025/04/12/ai_code_suggestions_sabotage_supply_chain/",
    "summary": "This article discusses a growing security risk stemming from the use of AI-powered code generation tools: AI's tendency to hallucinate nonexistent software packages and the subsequent exploitation of this by malicious actors. These AI coding assistants suggest code that incorporates packages that don't exist, a problem researchers have quantified in both commercial and open-source models.\n\nCybercriminals are taking advantage of this \"slopsquatting\" by creating malicious packages with the hallucinated names and uploading them to public repositories like PyPI and npm. When AI re-hallucinates the package name, the code will install the malware.\n\nSecurity experts warn that developers are increasingly relying on AI for coding, often without verifying the AI's suggestions, leading to potentially vulnerable code. AI-generated summaries on search engines can further exacerbate the problem by falsely validating these fake packages, creating a false sense of security.\n\nThe article highlights specific examples, including Google's AI Overview suggesting a malicious npm package and a dark web playbook detailing how to build a blockchain-based botnet using malicious npm packages generated with AI assistance.\n\nThe Python Software Foundation is actively working to mitigate this issue. The article urges developers to verify package names, check for typos, and review package content before installation. Organizations are also encouraged to mirror package repositories internally for greater control over available packages.\n",
    "chinese_title": "AI无法停止捏造软件依赖项并破坏一切",
    "chinese_summary": "本文探讨了使用人工智能代码生成工具所带来的日益增长的安全风险：人工智能倾向于虚构不存在的软件包，以及恶意行为者随后对这种现象的利用。这些人工智能编码助手会建议包含不存在的软件包的代码，研究人员已在商业和开源模型中量化了这个问题。\n\n网络罪犯正在利用这种“抢占虚名”行为，创建具有虚构名称的恶意软件包，并将它们上传到PyPI和npm等公共存储库。当人工智能再次虚构软件包名称时，代码将安装恶意软件。\n\n安全专家警告说，开发人员越来越依赖人工智能进行编码，但常常不验证人工智能的建议，导致潜在的漏洞代码。搜索引擎上人工智能生成的摘要可能会通过错误地验证这些虚假软件包，从而加剧这个问题，产生一种虚假的安全感。\n\n文章重点介绍了具体案例，包括谷歌的AI Overview建议了一个恶意npm软件包，以及一份暗网剧本，详细介绍了如何使用人工智能辅助生成的恶意npm软件包构建基于区块链的僵尸网络。\n\nPython软件基金会正在积极努力缓解这个问题。文章敦促开发人员在安装之前验证软件包名称，检查拼写错误，并审查软件包内容。还鼓励组织在内部镜像软件包存储库，以便更好地控制可用的软件包。"
  },
  {
    "id": "43664665",
    "title": "Apple, Nvidia, Dell, and Others Get a Tariffs Exemption Under New Rules",
    "url": "https://www.barrons.com/articles/tariffs-exclusions-exemptions-apple-nvidia-dell-smartphones-pcs-b2e069ff",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "苹果、英伟达、戴尔等公司获得关税豁免，适用新规",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "43664405",
    "title": "Energy Department cuts university overhead rates to 15% on research grants",
    "url": "https://www.science.org/content/article/energy-department-cuts-university-overhead-rates-to-15-on-research-grants",
    "summary": "The Department of Energy (DOE) is implementing a new policy capping overhead rates (also known as indirect costs) on research grants to universities at 15% for certain programs. This is a significant reduction from the current average, which can exceed 50% at many institutions.\n\nThe move aims to free up more funding for direct research costs, such as salaries, equipment, and materials. DOE officials believe that reducing overhead will enable them to fund more research projects and accelerate scientific breakthroughs.\n\nThe specific programs affected by this change are primarily those focused on basic energy sciences, advanced scientific computing research, and high energy physics. These programs are considered crucial for addressing national challenges in energy, climate, and scientific innovation.\n\nThe decision has sparked concern and criticism from university administrators and research advocates. They argue that overhead rates cover essential infrastructure and administrative costs necessary to support research, including maintaining labs, providing utilities, ensuring compliance with regulations, and managing grant finances. A significant reduction in overhead could force universities to divert funds from other areas or potentially limit their ability to support research activities.\n\nThe impact of this policy change is expected to vary across universities, with institutions that have higher overhead rates and rely heavily on DOE funding likely to be most affected. The DOE maintains that the 15% cap is sufficient to cover necessary indirect costs and that it is committed to working with universities to ensure the continued success of DOE-funded research. The policy is expected to be phased in gradually, allowing institutions time to adjust.\n",
    "chinese_title": "能源部将大学科研经费间接费用削减至15%",
    "chinese_summary": "能源部将部分大学科研项目管理费上限设定为15%"
  },
  {
    "id": "43658794",
    "title": "AI Coding and the Peanut Butter and Jelly Problem",
    "url": "https://iamcharliegraham.substack.com/p/ai-coding-and-the-peanut-butter-and",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "AI编码与花生酱果冻问题",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "43656609",
    "title": "Modern 6502",
    "url": "https://www.mikekohn.net/micro/modern_6502.php",
    "summary": "Michael Kohn's \"Modern 6502\" showcases projects using the Western Design Center W65C265SXB board, a modern microcontroller featuring a 6502 (actually 65C816) processor. Kohn, a long-time enthusiast of the 6502, presents four small projects demonstrating the chip's capabilities: LED Blinking (in both 65C816 and 6502 assembly), Music Playing (using Java and the chip's tone generators), a Software SPI DAC Sound Player (assembly), and a tone generator controlled by foot pedals (assembly).\n\nThe article details the hardware (W65C265SXB board with UARTs, IO, tone generators) and software tools used (naken_asm, Java Grinder, EasySXB). Kohn highlights the use of Java Grinder for 65C816 development and emphasizes the quality of the sine wave sound generated by the chip's tone generators. He also describes how to interface with an MCP4921 DAC chip via software SPI for playing sound samples (specifically referencing a sound sample from The Terminator). Finally, he describes the creation of a foot-controlled tone generator using buttons and the W65C265SXB board. Links to source code and videos demonstrating the projects are included. The page also mentions other related projects on mikekohn.net that involve 6502 processors.\n",
    "chinese_title": "现代 6502",
    "chinese_summary": "迈克尔·科恩的《现代6502》展示了使用Western Design Center W65C265SXB开发板的项目，这是一款现代微控制器，以6502（实际上是65C816）处理器为特色。科恩作为6502的长期爱好者，展示了四个小项目，演示了该芯片的功能：LED闪烁（使用65C816和6502汇编语言）、音乐播放（使用Java和芯片的音调发生器）、软件SPI DAC声音播放器（汇编语言）以及脚踏板控制的音调发生器（汇编语言）。\n\n文章详细介绍了所使用的硬件（带有UART、IO、音调发生器的W65C265SXB开发板）和软件工具（naken_asm、Java Grinder、EasySXB）。科恩重点介绍了使用Java Grinder进行65C816开发，并强调了芯片音调发生器产生的正弦波声音的质量。他还描述了如何通过软件SPI与MCP4921 DAC芯片连接，以播放声音样本（特别提到了《终结者》中的一个声音样本）。最后，他描述了如何使用按钮和W65C265SXB开发板创建一个脚踏控制的音调发生器。文中包含了指向源代码和演示这些项目的视频的链接。该页面还提到了mikekohn.net上其他与6502处理器相关的项目。"
  },
  {
    "id": "43658060",
    "title": "Germany creates 'super–high-tech ministry' for research, technology, aerospace",
    "url": "https://www.science.org/content/article/germany-creates-super-high-tech-ministry-research-technology-and-aerospace",
    "summary": "Germany has created a new \"super-high-tech ministry\" by merging existing departments related to research, technology, and aerospace. This restructuring, overseen by Minister Bettina Stark-Watzinger, aims to streamline innovation, reduce bureaucracy, and boost Germany's competitiveness in key technological sectors.\n\nThe core objective is to address perceived inefficiencies and fragmentation within the German research landscape. Previously, responsibilities for various aspects of research and technology were spread across multiple ministries. This new structure seeks to foster better coordination, faster decision-making, and a more coherent national strategy for innovation.\n\nThe ministry will focus on key areas such as artificial intelligence, biotechnology, quantum computing, and space exploration. It will also be responsible for supporting basic research and promoting technology transfer from academia to industry. By centralizing these functions, the government hopes to accelerate the development and commercialization of cutting-edge technologies.\n\nThe move is seen as a response to increasing global competition, particularly from the United States and China, in strategic technology sectors. The German government hopes that this more streamlined and focused approach will enable the country to maintain its position as a leading innovation nation and secure its economic future. Minister Stark-Watzinger emphasized the importance of investing in research and development to create jobs and address societal challenges.\n",
    "chinese_title": "德国设立“超高科技部”，主管科研、技术和航空航天",
    "chinese_summary": "德国合并现有研究、技术和航空航天相关部门，成立新的“超级高科技部”。此次重组由部长贝蒂娜·施塔克-瓦青格主持，旨在简化创新流程、减少官僚主义并提高德国在关键技术领域的竞争力。\n\n其核心目标是解决德国研究领域内被认为存在的效率低下和碎片化问题。此前，研究和技术各方面的职责分散在多个部门。新的架构旨在促进更好的协调、更快的决策制定以及更连贯的国家创新战略。\n\n该部门将专注于人工智能、生物技术、量子计算和太空探索等关键领域。它还将负责支持基础研究并促进技术从学术界向工业界的转移。通过集中这些职能，政府希望加速尖端技术的开发和商业化。\n\n此举被视为对战略技术领域日益激烈的全球竞争，特别是来自美国和中国的竞争的回应。德国政府希望这种更精简和集中的方法能够使该国保持其作为领先创新国家的地位并确保其经济未来。施塔克-瓦青格部长强调了投资研发以创造就业机会和应对社会挑战的重要性。"
  },
  {
    "id": "43654881",
    "title": "Rust CUDA Project",
    "url": "https://github.com/Rust-GPU/Rust-CUDA",
    "summary": "The Rust CUDA Project aims to make Rust a first-class language for GPU computing using the CUDA Toolkit. It provides libraries and tools for compiling Rust code to PTX and leveraging CUDA libraries.\n\nThe project addresses the historical challenges of using Rust with CUDA, which relied on the often-problematic LLVM PTX backend. Inspired by projects like rust-gpu, this initiative offers a specialized solution.\n\nThe project encompasses a broad range of the CUDA ecosystem and includes several key crates:\n\n*   **rustc\\_codegen\\_nvvm:** A rustc backend targeting NVVM IR for optimized PTX code generation.\n*   **cuda\\_std:** GPU-side functions and utilities for cleaner and more reliable kernels.\n*   **cudnn:** GPU-accelerated primitives for deep neural networks.\n*   **cust:** CPU-side CUDA features, like kernel launching and memory allocation, with RAII and Rust Results for better management.\n*   **gpu\\_rand:** GPU-friendly random number generation.\n*   **optix:** CPU-side hardware raytracing and denoising using the CUDA OptiX library.\n\nThe project is under active development (expecting bugs) and encourages contributions. It provides example Dockerfiles for building and running Rust-CUDA in container environments. The code is dual-licensed under Apache 2.0 and MIT licenses.\n",
    "chinese_title": "Rust CUDA 项目",
    "chinese_summary": "Rust CUDA 项目旨在使 Rust 成为使用 CUDA 工具包进行 GPU 计算的一流语言。它提供了将 Rust 代码编译为 PTX 并利用 CUDA 库的库和工具。\n\n该项目旨在解决 Rust 与 CUDA 结合使用的历史挑战，这种结合以前依赖于经常出现问题的 LLVM PTX 后端。受到 rust-gpu 等项目的启发，该计划提供了一个专门的解决方案。\n\n该项目涵盖了广泛的 CUDA 生态系统，并包括几个关键的 crate：\n\n*   **rustc\\_codegen\\_nvvm:** 一个以 NVVM IR 为目标的 rustc 后端，用于优化 PTX 代码生成。\n*   **cuda\\_std:** GPU 端函数和实用程序，用于更简洁、更可靠的内核。\n*   **cudnn:** 用于深度神经网络的 GPU 加速原语。\n*   **cust:** CPU 端的 CUDA 功能，例如内核启动和内存分配，具有 RAII 和 Rust Results 以实现更好的管理。\n*   **gpu\\_rand:** GPU 友好的随机数生成。\n*   **optix:** 使用 CUDA OptiX 库的 CPU 端硬件光线追踪和降噪。\n\n该项目正在积极开发中（预计存在错误），并鼓励贡献。它提供了示例 Dockerfile，用于在容器环境中构建和运行 Rust-CUDA。该代码以 Apache 2.0 和 MIT 双重许可证获得许可。"
  },
  {
    "id": "43652160",
    "title": "How to Make a Longbow",
    "url": "https://www.howtomakealongbow.co.uk",
    "summary": "This is a very brief introduction to an article or website titled \"How to Make a Longbow.\" The main points are:\n\n*   **Topic:** The article will provide information on how to make a longbow.\n*   **Dynamic Content:** The site is actively being updated and expanded.\n*   **User Engagement:** The author encourages reader feedback and suggestions for future content.\n",
    "chinese_title": "如何制作长弓",
    "chinese_summary": "关于《如何制作长弓》的文章或网站的简介：\n\n*   **主题：** 本文将提供关于如何制作长弓的信息。\n*   **动态内容：** 本网站正在积极更新和扩展。\n*   **用户互动：** 作者鼓励读者提供反馈和建议，以供未来内容参考。"
  },
  {
    "id": "43662365",
    "title": "Boltz-1",
    "url": "https://github.com/jwohlwend/boltz",
    "summary": "Boltz-1 is a new, open-source model for predicting the 3D structures of complex biomolecules, including combinations of proteins, RNA, DNA, and other molecules like modified residues, ligands, and glycans. Released under the MIT license, it is freely available for academic and commercial use. The model allows users to condition predictions on specific interaction pockets or contacts.\n\nKey features highlighted include its ability to handle diverse biomolecular components, its permissive licensing, and the availability of code and weights. Installation can be done via PyPI or directly from GitHub. Inference can be run using the `boltz predict` command with various input formats like FASTA files, YAML schemas, or directories of these files. The tool also offers evaluation scripts and predictions for comparing its performance against other models like Chai-1 and AlphaFold3.\n\nThe article encourages community engagement through a Slack channel for discussions and collaborations. Instructions are provided for training the model and contributing to its development. The authors also acknowledge a Tenstorrent hardware-optimized fork by Moritz Thüning. Finally, appropriate citations are provided for both the Boltz-1 model itself and the ColabFold MSA generation method.\n",
    "chinese_title": "玻尔兹-1",
    "chinese_summary": "Boltz-1 是一个新型开源模型，用于预测复杂生物分子的 3D 结构，包括蛋白质、RNA、DNA 以及其他分子（如修饰残基、配体和聚糖）的组合。它采用 MIT 许可证发布，可免费用于学术和商业用途。该模型允许用户基于特定的相互作用口袋或接触来设定预测条件。\n\n其主要亮点包括处理多样生物分子组分的能力、宽松的许可协议以及代码和权重的可用性。可以通过 PyPI 或直接从 GitHub 安装。可以使用 `boltz predict` 命令，采用 FASTA 文件、YAML 模式或这些文件的目录等各种输入格式来运行推理。该工具还提供评估脚本和预测结果，用于将其性能与其他模型（如 Chai-1 和 AlphaFold3）进行比较。\n\n文章鼓励通过 Slack 频道进行讨论和协作，促进社区参与。提供了训练模型和贡献开发的说明。作者还感谢 Moritz Thüning 提供的 Tenstorrent 硬件优化分支。最后，为 Boltz-1 模型本身和 ColabFold MSA 生成方法都提供了适当的引用。"
  },
  {
    "id": "43664660",
    "title": "\"Slow Pay, Low Pay or No Pay\": Blue Cross Approved Surgeries Then Refused to Pay",
    "url": "https://www.propublica.org/article/blue-cross-blue-shield-louisiana-insurance-lawsuit-breast-cancer-doctors",
    "summary": "This ProPublica article investigates Blue Cross and Blue Shield of Louisiana's practice of approving breast cancer surgeries, specifically mastectomies and breast reconstructions at the Center for Restorative Breast Surgery, and then refusing to pay the full doctors' bills, or sometimes not paying at all. Witney Arch, a patient, received authorization but was pressured to seek treatment elsewhere.\n\nThe Center, founded by surgeons Frank DellaCroce and Scott Sullivan, specializes in autologous tissue reconstruction and provides a comfortable, patient-focused environment. They repeatedly sued Blue Cross, alleging a pattern of approvals followed by payment denials, an aggressive legal battle that culminated in a major victory for the surgeons.\n\nA jury found Blue Cross liable for fraud, awarding the Center $421 million. Blue Cross has appealed, claiming the verdict was wrong. The article highlights the power imbalance between insurance companies and doctors, with insurers setting their own guidelines and often receiving favorable standing.\n\nInternal documents revealed Blue Cross executives established processes for reduced fees and payment delays, even profiting from savings achieved on out-of-state patients' claims. While denying full payment to patients generally, Blue Cross had made special agreements to cover executives' wives' cancer treatment at the same center. This led Sullivan to accuse the insurer of being hypocritical and \"morally bankrupt.\"\n",
    "chinese_title": "慢付、少付或拒付：蓝十字批准手术后拒绝支付",
    "chinese_summary": "ProPublica文章调查路易斯安那州蓝十字蓝盾保险公司批准乳腺癌手术（特别是乳房切除术和乳房再造术）后，拒绝全额支付医生账单，甚至有时完全不予支付的行为，这些手术均在修复性乳房外科中心进行。患者惠特尼·阿奇获得了授权，但被迫寻求其他治疗方案。\n\n该中心由外科医生弗兰克·德拉克罗切和斯科特·沙利文创立，专门从事自体组织重建，并提供舒适、以患者为中心的环境。他们多次起诉蓝十字，指控其存在批准后拒绝支付的模式，这场激烈的法律战最终以外科医生的重大胜利而告终。\n\n陪审团裁定蓝十字犯有欺诈罪，判给该中心 4.21 亿美元。蓝十字已提出上诉，声称该判决是错误的。这篇文章强调了保险公司和医生之间的权力失衡，保险公司制定自己的指导方针，并且常常获得有利地位。\n\n内部文件显示，蓝十字高管制定了降低费用和延迟付款的流程，甚至从节省外州患者的索赔中获利。虽然通常拒绝全额支付患者费用，但蓝十字已达成特殊协议，以支付高管妻子在同一中心接受的癌症治疗费用。这导致沙利文指责该保险公司虚伪且“道德破产”。"
  },
  {
    "id": "43622514",
    "title": "We clone a running VM in 2 seconds (2022)",
    "url": "https://codesandbox.io/blog/how-we-clone-a-running-vm-in-2-seconds",
    "summary": "This article details how CodeSandbox achieves incredibly fast (under 2 seconds) VM cloning for development environments using Firecracker MicroVMs and memory snapshotting. The core challenge was enabling users to quickly fork running environments without long setup times.\n\nInitially, CodeSandbox ran code in the browser, but this was limited. Moving to VMs introduced the problem of slow startup times. Firecracker MicroVMs provided a faster VM boot time, but still required cloning the repository, installing dependencies, and starting the dev server, taking too long.\n\nThe solution was memory snapshotting. Firecracker allows pausing a VM, saving its entire state (memory and configuration) to disk, and then resuming from that snapshot. This significantly reduces boot time, but saving snapshots was initially slow.\n\nTo speed up snapshotting, the author leveraged the `mmap` system call with the `MAP_SHARED` flag. This maps the memory snapshot file to memory, syncing changes back to the file lazily, distributing the I/O work over time.  This reduced snapshot save times from seconds to milliseconds.\n\nCloning snapshots was then accelerated using copy-on-write (CoW). Instead of copying the entire memory file, new VMs share the same data as the original VM. Data is only copied when the new VM modifies it, resulting in near-instantaneous cloning times.\n\nThe result is a VM cloning process that takes under 2 seconds, making it possible to quickly fork and test changes in any development environment, even complex ones like a Minecraft server. The article concludes with a list of unwritten details and future improvements planned.\n",
    "chinese_title": "两秒克隆运行中的虚拟机 (2022)",
    "chinese_summary": "本文详细介绍了 CodeSandbox 如何使用 Firecracker MicroVM 和内存快照技术，实现开发环境的极速（2 秒以内）VM 克隆。 核心挑战在于使用户能够快速 Fork 正在运行的环境，而无需漫长的设置时间。\n\n最初，CodeSandbox 在浏览器中运行代码，但这受到了限制。 迁移到 VM 引入了启动时间慢的问题。 Firecracker MicroVM 提供了更快的 VM 启动时间，但仍然需要克隆存储库、安装依赖项和启动开发服务器，这花费了太长时间。\n\n解决方案是内存快照。 Firecracker 允许暂停 VM，将其整个状态（内存和配置）保存到磁盘，然后从该快照恢复。 这大大缩短了启动时间，但保存快照最初很慢。\n\n为了加速快照，作者利用了带有 `MAP_SHARED` 标志的 `mmap` 系统调用。 这会将内存快照文件映射到内存，以延迟的方式将更改同步回文件，从而将 I/O 工作分摊到一段时间内。 这将快照保存时间从几秒减少到几毫秒。\n\n然后使用写时复制 (CoW) 加速克隆快照。 新的 VM 不会复制整个内存文件，而是与原始 VM 共享相同的数据。 只有当新的 VM 修改数据时才会复制数据，从而实现近乎瞬时的克隆时间。\n\n最终，VM 克隆过程耗时不到 2 秒，从而可以快速 Fork 和测试任何开发环境中的更改，即使是像 Minecraft 服务器这样复杂的环境。 文章最后列出了尚未编写的细节和计划的未来改进。"
  },
  {
    "id": "43661680",
    "title": "$70M in 60 Seconds: How Insider Info Helped Someone 28x Their Money",
    "url": "https://data-and-politics.ghost.io/70-million-in-60-seconds-how-insider-information-helped-someone-28x-their-money/",
    "summary": "On April 9, 2025, an individual or group made a highly profitable trade, turning a $2.5 million investment into over $70 million in under an hour using zero-day expiry options on the SPY ETF, which tracks the S&P 500. The trade involved buying call options with a strike price of $509, while SPY was trading below $500. This risky strategy paid off when Donald Trump announced a pause on tariffs at 1:30 pm EST, causing the market to surge and SPY to surpass the $509 mark, making the options incredibly valuable.\n\nThe article highlights the unusual precision and timing of the trades, suggesting possible insider information. Significant volumes of SPY shares were also purchased at 1:01 pm EST, potentially earning buyers over $100 million in profit within sixty seconds if sold at the closing price. The rapid increase in trading volume before the public announcement distinguishes this event from past market shocks, where volume typically increased after the news broke.\n\nThe author emphasizes that the trades were not only profitable but also incredibly risky, as the entire $2.5 million could have been lost if the market hadn't moved favorably. The author questions whether the trader's success was due to luck, a hunch, or, more concerningly, prior knowledge of the impending announcement. The article concludes that regardless of the reason, the trades were extraordinarily successful, and the possibility of insider information cannot be dismissed.\n",
    "chinese_title": "60秒内赚取7000万美元：内幕消息如何助人获利28倍",
    "chinese_summary": "2025年4月9日，某个人或团体进行了一笔利润极高的交易，利用SPY ETF（追踪标普500指数）的零日期权，在不到一小时内将250万美元的投资变成了超过7000万美元。 这笔交易涉及购买行权价为509美元的看涨期权，当时SPY的交易价格低于500美元。 当地时间下午1点30分，唐纳德·特朗普宣布暂停关税，导致市场飙升，SPY突破509美元大关，使得这些期权变得极具价值，这种冒险策略获得了回报。\n\n该文章强调了交易的异常精确性和时机，暗示可能存在内幕消息。 美东时间下午1点01分也购买了大量SPY股票，如果在收盘价卖出，可能会在六十秒内为买家带来超过1亿美元的利润。 公告发布前交易量迅速增加，这与过去市场冲击不同，过去通常是新闻发布后交易量才会增加。\n\n作者强调，这些交易不仅利润丰厚，而且风险极高，如果市场没有朝着有利的方向发展，全部250万美元都有可能损失殆尽。 作者质疑交易员的成功是源于运气、直觉，还是更令人担忧的、对即将发布的公告的预先了解。 文章总结称，无论原因如何，这些交易都非常成功，并且不能排除内幕交易的可能性。"
  },
  {
    "id": "43658093",
    "title": "A recent study suggests that insects branched out from crustaceans",
    "url": "https://www.smithsonianmag.com/science-nature/you-might-think-of-shrimp-as-bugs-of-the-sea-but-a-remarkable-discovery-shows-the-opposite-bugs-are-actually-shrimp-of-the-land-180986303/",
    "summary": "This article discusses a recent study that reclassifies insects as a subgroup of crustaceans, specifically within the pancrustacea group. This shift, based on genetic data, places insects alongside crustaceans like remipedes, branchiopods, and cephalocarids.\n\nFor years, the resemblance between insects and crustaceans has been noted, but the idea that insects evolved from crustaceans wasn't widely accepted due to the possibility of convergent evolution. However, research, including a 2013 study linking insects to remipedes, pointed towards a closer relationship. The 2023 study, analyzing genetic data, solidified this connection, placing insects within the allotriocarida crustacean group.\n\nThis reclassification has broader implications for understanding insect evolution. Previously, it was thought that insects evolved from millipede-like terrestrial ancestors. Now, the connection to marine-dwelling crustaceans like remipedes suggests insects originated from aquatic ancestors. This shift necessitates a reevaluation of insect origins and evolution, including studying the ancestry of remipedes and reexamining the fossil record.\n\nThe article also draws parallels to other significant systematic shifts, like the recognition of birds as dinosaurs and whales as artiodactyls. These shifts not only rearranged evolutionary trees but also led to new insights into the evolution of traits and the relationships between species. Understanding that insects are crustaceans provides a new framework for understanding their origins and evolution, focusing on the aquatic environment and potentially uncovering miscategorized fossils.\n",
    "chinese_title": "一项最新研究表明昆虫起源于甲壳类动物。",
    "chinese_summary": "本文探讨了一项近期研究，该研究将昆虫重新归类为甲壳动物的一个亚群，特别是泛甲壳动物群内的一个亚群。这种基于基因数据的转变将昆虫与诸如潜水虾、鳃足纲动物和头甲纲动物等甲壳动物并列。\n\n多年来，昆虫和甲壳动物之间的相似之处已为人所知，但由于趋同进化的可能性，昆虫从甲壳动物进化而来的观点并未被广泛接受。然而，包括2013年一项将昆虫与潜水虾联系起来的研究在内的研究，都指向了更紧密的关系。2023年的研究分析了基因数据，巩固了这种联系，将昆虫置于异甲总目甲壳动物群中。\n\n这种重新分类对理解昆虫进化具有更广泛的意义。此前，人们认为昆虫是从类似马陆的陆生祖先进化而来的。现在，与诸如潜水虾等海洋甲壳动物的联系表明昆虫起源于水生祖先。这种转变有必要重新评估昆虫的起源和进化，包括研究潜水虾的祖先和重新审视化石记录。\n\n本文还与其他重要的系统性转变进行了类比，例如将鸟类视为恐龙以及将鲸类视为偶蹄类动物的认知。这些转变不仅重新排列了进化树，还导致了对性状进化和物种之间关系的新见解。理解昆虫是甲壳动物为理解它们的起源和进化提供了一个新的框架，重点关注水生环境，并有可能揭示被错误分类的化石。"
  },
  {
    "id": "43653004",
    "title": "Pentagon to terminate $5.1B in IT contracts with Accenture, Deloitte",
    "url": "https://www.reuters.com/world/us/pentagon-terminate-51-billion-it-contracts-with-accenture-deloitte-others-2025-04-11/",
    "summary": "**Summary:**\n\nThe Pentagon plans to terminate $5.1 billion in IT contracts with several major consulting firms, including Accenture, Deloitte, and Booz Allen Hamilton. The contracts, awarded under the Defense Enclave Services (DES) program, aimed to consolidate and modernize the Pentagon's IT infrastructure into a single, cloud-based network. The termination is reportedly due to a change in strategic direction and evolving requirements for the DES program.\n\nThe Defense Information Systems Agency (DISA), which oversees the DES program, is expected to announce the contract terminations formally. While the specific reasons remain undisclosed in the provided context, the decision signifies a significant shift in the Pentagon's approach to modernizing its IT systems.\n\nThe move will impact the affected companies, who were slated to play key roles in the DES program over the next decade. It also raises questions about the Pentagon's future strategy for IT modernization and the potential for new contract opportunities or a restructured approach to achieving the program's original goals. The termination signals a reevaluation of priorities and a potential shift towards a new strategy in managing and securing the Pentagon's IT infrastructure.\n",
    "chinese_title": "五角大楼将终止与埃森哲、德勤的51亿美元IT合同",
    "chinese_summary": "**概要：**\n\n五角大楼计划终止与埃森哲、德勤和博思艾伦汉密尔顿等多家大型咨询公司的价值51亿美元的IT合同。这些合同是在国防飞地服务（DES）项目下授予的，旨在将五角大楼的IT基础设施整合并现代化为一个单一的、基于云的网络。据报道，终止合同的原因是战略方向的改变以及DES项目不断变化的需求。\n\n负责监督DES项目的国防信息系统局（DISA）预计将正式宣布合同终止。虽然在提供的上下文中具体原因尚未披露，但该决定标志着五角大楼在实现其IT系统现代化方面的一个重大转变。\n\n此举将影响受影响的公司，这些公司原本计划在未来十年内在DES项目中发挥关键作用。这也引发了人们对五角大楼未来IT现代化战略以及潜在的新合同机会或重组方法以实现该项目最初目标的质疑。终止合同表明对优先事项的重新评估，以及在管理和保护五角大楼IT基础设施方面可能转向新战略。"
  },
  {
    "id": "43629158",
    "title": "Pinball Brothers – A Swedish-Italian Pinball Company",
    "url": "https://www.pinballbrothers.com/",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "弹珠兄弟 - 一家瑞典-意大利弹珠公司",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "43630223",
    "title": "Grappling with Infinity in Constraint Solvers",
    "url": "https://tuzz.tech/blog/grappling-with-infinity",
    "summary": "Chris Patuzzo's article discusses the challenges of handling infinity in constraint solvers, specifically within the context of his programming language, Sentient. Many problems, even simple ones, have infinitely many solutions and potential values to test. However, Sentient, like most systems, represents integers using a finite number of bits, leading to termination even when infinite solutions exist.\n\nThe author explores the idea of viewing finite representations as approximations of infinite mathematical concepts. Increasing the bit representation improves the approximation but restarts the search, re-exploring already-tested regions. He proposes first-class support for approximation strategies.\n\nThe article explores how infinity arises not just in integer values but also in array sizes and exponents, leading to multi-dimensional search spaces.  The author suggests delegating approximation control to the programmer via external programs, allowing for flexible strategies.\n\nHe also considers leveraging Incremental SAT (IPASIR) to improve efficiency by reusing knowledge between approximation levels, rather than restarting from scratch. The author contemplates how operations must adapt to changing bit representations, and how approximation might impact NP-hard optimization problems.\n\nFinally, he explores the possibility of Turing completeness for Sentient through approximations, specifically by limiting recursion depth and loop unrolling. This, combined with incremental SAT, could dramatically increase Sentient's problem-solving capabilities.\n",
    "chinese_title": "约束求解器中处理无穷大",
    "chinese_summary": "在约束求解器中处理无限的挑战：Patuzzo 的 Sentient 语言视角\n\n克里斯·帕图佐的文章探讨了在约束求解器中处理无限的挑战，特别是在他的编程语言 Sentient 的背景下。许多问题，即使是简单的问题，也存在无限多的解决方案和潜在的测试值。然而，像大多数系统一样，Sentient 使用有限的位数来表示整数，即使存在无限解，也会导致程序终止。\n\n作者探讨了将有限表示视为无限数学概念的近似值的想法。增加位表示可以改善近似值，但会重新开始搜索，重新探索已经测试过的区域。他提出了对近似策略的一流支持。\n\n文章探讨了无限不仅出现在整数值中，还出现在数组大小和指数中，从而导致多维搜索空间。作者建议通过外部程序将近似控制委托给程序员，从而实现灵活的策略。\n\n他还考虑利用增量 SAT (IPASIR) 通过重用近似级别之间的知识来提高效率，而不是从头开始。作者思考了操作如何适应不断变化的位表示，以及近似可能如何影响 NP 困难的优化问题。\n\n最后，他探讨了 Sentient 通过近似实现图灵完备性的可能性，特别是通过限制递归深度和循环展开。这与增量 SAT 相结合，可能会极大地提高 Sentient 的问题解决能力。"
  },
  {
    "id": "43651576",
    "title": "Why I Program in Lisp",
    "url": "http://funcall.blogspot.com/2025/04/why-i-program-in-lisp.html",
    "summary": "Joe Marshall's blog post, \"Why I Program in Lisp,\" dated April 10, 2025, explains his preference for Lisp despite its lack of popularity compared to other languages. He argues that Lisp is easier to remember due to its uniform and universal Cambridge Polish notation, reducing cognitive load. Its functional programming support, emphasizing substitution, refactoring ease, and seamless abstraction between values and functions, further enhances its appeal.\n\nMarshall values Lisp's rapid prototyping capabilities, with new programs seamlessly integrating with existing ones. The debugger and safe memory model facilitate exploration without catastrophic failures. The REPL allows immediate evaluation of code fragments, enabling real-time program development. Dynamic typing provides ad hoc polymorphism, promoting generic code that operates on diverse data types.\n\nThe comments section expands on the article's points, particularly the discussion of polymorphism. Some commenters point out the limitations of Lisp's ad-hoc polymorphism compared to languages with typeclasses (like Haskell or Rust) or generic type arguments (like C#), which allow for more precise type constraints. The discussion then veers into a comparison with C, with the author defending Lisp's broader application of mathematical functions like factorial and Euclid's algorithm. The thread also touches upon the aesthetic beauty of Lisp and its use in configuring Emacs, and briefly mentions historical Lisp-based operating systems.\n",
    "chinese_title": "我为何用Lisp编程",
    "chinese_summary": "乔·马歇尔的博客文章《我为什么用Lisp编程》（2025年4月10日）解释了他对Lisp的偏爱，尽管与其他语言相比，Lisp并不流行。他认为Lisp更容易记忆，因为它统一且通用的剑桥波兰表示法降低了认知负荷。其函数式编程支持，强调替换、易于重构以及值和函数之间的无缝抽象，进一步增强了它的吸引力。\n\n马歇尔重视Lisp的快速原型设计能力，新程序可以与现有程序无缝集成。调试器和安全的内存模型有助于探索，避免灾难性故障。REPL允许立即评估代码片段，从而实现实时程序开发。动态类型提供临时多态性，促进操作各种数据类型的泛型代码。\n\n评论区扩展了文章的观点，特别是对多态性的讨论。一些评论者指出了Lisp的临时多态性与具有类型类（如Haskell或Rust）或泛型类型参数（如C#）的语言相比的局限性，后者允许更精确的类型约束。随后讨论转向与C的比较，作者为Lisp在更广泛地应用数学函数（如阶乘和欧几里得算法）辩护。该帖子还涉及Lisp的审美情趣及其在配置Emacs中的应用，并简要提到了基于Lisp的历史操作系统。"
  },
  {
    "id": "43651390",
    "title": "Live Map of the London Underground",
    "url": "https://www.londonunderground.live/",
    "summary": "This web page offers a live, interactive map of the London Underground. The map displays real-time information about train locations on the Tube network. Users can interact with the map in several ways: right-clicking allows for orbital view adjustments, zooming in reveals building details, and hovering the mouse over elements provides more specific information. The map is labeled as \"LIVE\" indicating real-time data. The map was created by Ben James, utilizing data sources that are also acknowledged. The page mentions sponsorship from The London Minute, indicating their support for the map's visual presentation. In essence, it's a dynamic tool for visualizing the current state of the London Underground system, providing users with a real-time understanding of train movements and network status.\n",
    "chinese_title": "伦敦地铁实时地图",
    "chinese_summary": "伦敦地铁实时互动地图。"
  },
  {
    "id": "43608377",
    "title": "Show HN: Atari Missile Command Game Built Using AI Gemini 2.5 Pro",
    "url": "https://missile-command-game.centminmod.com/",
    "summary": "This \"Show HN\" post showcases a modern HTML5 canvas remake of the classic Atari game Missile Command. The game boasts core gameplay similar to the original, along with several new features. These include an in-game store where players can purchase special weapons like Sonic Waves, Mega Bombs, and satellite defense bases, as well as upgrades like faster missiles and wider explosions. Players can control the game by clicking/tapping to fire missiles and using special weapon icons. The space bar pauses and resumes the game.\n\nThe game was primarily developed by George Liu, leveraging AI assistance from Google Gemini 2.5 Pro and Claude 3.7 Sonnet. The project is hosted on Cloudflare Pages, with the leaderboard powered by Cloudflare Page Functions/KV. Gameplay analysis is performed using Cloudflare AI Gateway with OpenRouter AI. The post includes screenshots of the game showing the difficulty selection, gameplay, inter-wave store with purchasable upgrades, and information about the game's features, controls, and credits. A GitHub repository for the project is also provided.\n",
    "chinese_title": "展示HN：使用AI Gemini 2.5 Pro构建的雅达利导弹指挥官游戏",
    "chinese_summary": "“Show HN”：基于HTML5 Canvas重制的雅达利经典游戏《导弹指挥官》\n\n这款“Show HN”帖子展示了一个使用现代HTML5 Canvas技术重制的经典雅达利游戏《导弹指挥官》。该游戏保留了与原作相似的核心玩法，并增加了一些新特性。这些特性包括一个游戏内商店，玩家可以在其中购买特殊武器，如声波、巨型炸弹和卫星防御基地，以及导弹加速和爆炸范围扩大等升级。玩家可以通过点击/触摸来发射导弹，并使用特殊武器图标来控制游戏。空格键可以暂停和恢复游戏。\n\n该游戏主要由George Liu开发，并借助了Google Gemini 2.5 Pro和Claude 3.7 Sonnet的AI辅助。该项目托管在Cloudflare Pages上，排行榜由Cloudflare Page Functions/KV驱动。游戏分析则通过Cloudflare AI Gateway与OpenRouter AI结合进行。帖子包含游戏截图，展示了难度选择、游戏过程、带有可购买升级的波间商店，以及关于游戏特性、控制方式和贡献者的信息。同时也提供了该项目的GitHub仓库地址。"
  },
  {
    "id": "43643886",
    "title": "Usability Improvements in GCC 15",
    "url": "https://developers.redhat.com/articles/2025/04/10/6-usability-improvements-gcc-15",
    "summary": "Okay, I have read the article \"Usability Improvements in GCC 15\" from the provided URL.\n\nHere's a summary:\n\nGCC 15 introduces several usability improvements aimed at making the compiler more helpful and easier to use for developers. A major theme is enhanced diagnostics, providing more informative and actionable error and warning messages. Specific improvements include:\n\n1.  **Improved Range Analysis Diagnostics:** More detailed diagnostics related to out-of-bounds access and array indices, helping developers pinpoint the exact location and cause of such errors.\n\n2.  **Diagnostic Grouping:** Related diagnostics are grouped together, making it easier to understand the context and root cause of issues. This reduces the noise from a cascade of errors by presenting them in a more organized fashion.\n\n3.  **Better Spelling Suggestions:** More accurate and relevant spelling suggestions are provided for misspelled keywords and identifiers, reducing debugging time due to simple typos.\n\n4.  **Improved -Wformat Diagnostics:** Enhanced format string checking in `printf` and related functions, catching potential vulnerabilities and incorrect usage more effectively.\n\n5.  **Standard Header Include Fix Suggestions:** When a needed header file is missing, GCC 15 provides suggestions for which header to include, streamlining the development process.\n\n6.  **Enhanced LTO Diagnostics:** Improved diagnostics during Link-Time Optimization (LTO) provide better insight into performance bottlenecks and optimization opportunities.\n\nOverall, GCC 15's usability improvements focus on providing clearer, more actionable, and more grouped error and warning messages, thereby facilitating faster debugging and improved code quality. The article showcases how these improvements will benefit developers in their daily coding workflows.\n",
    "chinese_title": "GCC 15 的可用性改进",
    "chinese_summary": "好的，我已经阅读了来自所提供URL的文章“GCC 15中的可用性改进”。\n\n以下是摘要：\n\nGCC 15引入了几项可用性改进，旨在使编译器对开发人员更有用且更易于使用。一个主要主题是增强的诊断功能，提供更具信息性和可操作性的错误和警告消息。 具体改进包括：\n\n1.  **改进的范围分析诊断：** 提供与越界访问和数组索引相关的更详细的诊断信息，帮助开发人员精确定位此类错误的确切位置和原因。\n\n2.  **诊断分组：** 将相关的诊断信息分组在一起，使您可以更轻松地了解问题的上下文和根本原因。通过以更有组织的方式呈现级联错误，从而减少噪音。\n\n3.  **更好的拼写建议：** 为拼写错误的关键字和标识符提供更准确和相关的拼写建议，从而减少因简单拼写错误而导致的调试时间。\n\n4.  **改进的 -Wformat 诊断：** 增强了`printf`和相关函数中的格式字符串检查，更有效地捕获潜在的漏洞和不正确的使用。\n\n5.  **标准头文件包含修复建议：** 当缺少需要的头文件时，GCC 15 会建议包含哪个头文件，从而简化开发过程。\n\n6.  **增强的LTO诊断：** 链接时优化 (LTO) 期间改进的诊断功能可以更好地了解性能瓶颈和优化机会。\n\n总而言之，GCC 15 的可用性改进侧重于提供更清晰、更可操作和更分组的错误和警告消息，从而促进更快的调试和改进的代码质量。 这篇文章展示了这些改进将如何在开发人员的日常编码工作流程中使他们受益。"
  },
  {
    "id": "43630634",
    "title": "In Guatemala, painted altar found at Tikal adds new context to Maya history",
    "url": "https://phys.org/news/2025-04-guatemala-altar-tikal-context-mysterious.html",
    "summary": "A painted altar discovered at Tikal, Guatemala, is providing new insights into the relationship between the Maya and the ancient city of Teotihuacan. The altar, dating back to the late 300s A.D., features murals resembling the \"Storm God\" deity from central Mexico and is believed to have been created by an artisan from Teotihuacan, not a Maya artist.\n\nResearchers argue that the altar confirms a period of upheaval where Teotihuacan exerted significant influence over Tikal. Archaeological evidence suggests that what started as a trading relationship escalated into a power struggle, culminating in a coup around A.D. 378 where Teotihuacan replaced Tikal's king with a puppet ruler. The discovery of a Teotihuacan citadel replica near Tikal further supports this occupation theory.\n\nInside the altar, archaeologists found a child buried in a seated position and an adult with a dart point made of green obsidian, both practices and materials common in Teotihuacan but rare in Tikal. The subsequent burial of the altar and surrounding buildings indicates a complex and potentially negative perception of Teotihuacan's presence.\n\nDespite the initial disruption, Teotihuacan's influence ultimately contributed to Tikal's rise to power in the following centuries. Researchers note a nostalgic view of this era, suggesting the Maya saw it as a period of heightened importance and influence. The article concludes by highlighting the parallels between Teotihuacan's actions and other historical instances of powerful empires exploiting resource-rich regions.\n",
    "chinese_title": "在危地马拉，蒂卡尔发现彩绘祭坛，为玛雅历史增添新背景",
    "chinese_summary": "在危地马拉蒂卡尔发现的彩绘祭坛揭示了玛雅文明与特奥蒂瓦坎古城之间的新关系。该祭坛可追溯至公元300年代末，其壁画类似于墨西哥中部的“风暴之神”神祇，据信由来自特奥蒂瓦坎的工匠而非玛雅艺术家创作。\n\n研究人员认为，该祭坛证实了一段动荡时期，特奥蒂瓦坎对蒂卡尔施加了重大影响。考古证据表明，最初的贸易关系升级为权力斗争，最终在公元378年左右发生政变，特奥蒂瓦坎用傀儡统治者取代了蒂卡尔的国王。在蒂卡尔附近发现的特奥蒂瓦坎城堡复制品进一步支持了这一占领理论。\n\n在祭坛内部，考古学家发现了一个以坐姿埋葬的儿童和一个带有绿色黑曜石飞镖尖端的成年人，这两种做法和材料在特奥蒂瓦坎很常见，但在蒂卡尔却很少见。随后对祭坛和周围建筑的埋葬表明了对特奥蒂瓦坎存在的复杂且可能消极的看法。\n\n尽管最初遭到破坏，但特奥蒂瓦坎的影响最终促成了蒂卡尔在随后几个世纪的崛起。研究人员注意到对这个时代的怀旧之情，表明玛雅人将其视为一个重要性和影响力高度提升的时期。文章最后强调了特奥蒂瓦坎的行为与其他强大帝国剥削资源丰富地区的历史实例之间的相似之处。"
  },
  {
    "id": "43649853",
    "title": "Default styles for h1 elements are changing",
    "url": "https://developer.mozilla.org/en-US/blog/h1-element-styles/",
    "summary": "This article discusses upcoming changes to how web browsers style `<h1>` elements, specifically addressing the removal of implicit styling based on their nesting within sectioning elements like `<section>`, `<article>`, `<nav>`, and `<aside>`.\n\nHistorically, browsers automatically adjusted the font size and margins of `<h1>` elements based on the depth of their nesting within these elements (e.g., `section > h1` looked like `<h2>`). This behavior, stemming from a now-removed HTML outline algorithm, is being phased out.\n\nThe key takeaways are:\n\n*   Browsers are removing the default UA styles that automatically resized `<h1>` elements based on nesting.\n*   `<h1>` will now consistently render with the same style, regardless of the surrounding sectioning elements, unless explicitly styled otherwise.\n*   Lighthouse, and other page auditing tools, will flag instances where `<h1>` elements lack explicit font-size declarations as bad practice, showing warnings like \"H1UserAgentFontSizeInSection.\"\n*   Firefox and Chrome have already begun implementing these changes with deprecation warnings, and Safari is expected to follow.\n\nThe article advises developers to:\n\n*   Avoid relying on default browser styles for heading hierarchy.\n*   Always explicitly define font-size and margin for `<h1>` elements.\n*   Consider updating CSS resets to reflect the change.\n*   Use Lighthouse and browser DevTools to identify deprecated usage.\n\nIn essence, web developers need to be more explicit in styling their `<h1>` elements to ensure consistent rendering and avoid warnings from auditing tools.\n",
    "chinese_title": "h1元素的默认样式正在更改",
    "chinese_summary": "本文探讨了网页浏览器对 `<h1>` 元素样式即将进行的更改，特别是取消基于其在诸如 `<section>`、`<article>`、`<nav>` 和 `<aside>` 等分段元素中嵌套的隐式样式。\n\n历史上，浏览器会根据 `<h1>` 元素在这些元素中的嵌套深度自动调整其字体大小和边距（例如，`section > h1` 看起来像 `<h2>`）。这种行为源于现已移除的 HTML 大纲算法，目前正在逐步淘汰。\n\n主要要点是：\n\n*   浏览器正在移除根据嵌套自动调整 `<h1>` 元素大小的默认 UA 样式。\n*   `<h1>` 现在将始终以相同的样式呈现，无论周围的分段元素如何，除非明确指定样式。\n*   Lighthouse 和其他页面审核工具会将 `<h1>` 元素缺少显式字体大小声明的情况标记为不良做法，并显示诸如“H1UserAgentFontSizeInSection”之类的警告。\n*   Firefox 和 Chrome 已经开始实施这些更改并发出弃用警告，预计 Safari 也会跟进。\n\n本文建议开发者：\n\n*   避免依赖默认浏览器样式来实现标题层次结构。\n*   始终为 `<h1>` 元素显式定义字体大小和边距。\n*   考虑更新 CSS 重置以反映此更改。\n*   使用 Lighthouse 和浏览器 DevTools 来识别已弃用的用法。\n\n本质上，Web 开发者需要更加明确地设置 `<h1>` 元素的样式，以确保一致的呈现效果并避免审核工具发出警告。"
  },
  {
    "id": "43646095",
    "title": "Garfield Minus Garfield",
    "url": "https://garfieldminusgarfield.net",
    "summary": "The provided text describes the title \"Garfield Minus Garfield\" and some content listing dates with links to Facebook and Twitter. This suggests the existence of a project, titled \"Garfield Minus Garfield\", that has a social media presence on Facebook and Twitter. The dates \"一月 27\" (January 27) and \"十一月 03\" (November 3) likely represent dates when content was shared or updated on those platforms.\n\nEssentially, the text is a metadata-like snippet hinting at a project called \"Garfield Minus Garfield\" that utilizes social media for promotion or content sharing. Without further context, it's difficult to know the precise nature of the project.\n",
    "chinese_title": "没有加菲猫的加菲猫",
    "chinese_summary": "《加菲猫减去加菲猫》描述，以及一些包含Facebook和Twitter链接的日期列表。这表明存在一个名为《加菲猫减去加菲猫》的项目，并在Facebook和Twitter上拥有社交媒体存在。\"一月 27\"（1月27日）和\"十一月 03\"（11月3日）可能代表在该平台上分享或更新内容的日期。\n\n本质上，这段文字是一段元数据片段，暗示着一个名为《加菲猫减去加菲猫》的项目利用社交媒体进行推广或内容分享。在没有更多背景信息的情况下，很难知道该项目的确切性质。"
  },
  {
    "id": "43658089",
    "title": "Googler... ex-Googler",
    "url": "https://nerdy.dev/ex-googler",
    "summary": "Adam, a Chrome team member at Google, was unexpectedly laid off, leaving him shocked, angry, and saddened. The dismissal, described as not merit-based and a surprise to his managers, happened abruptly while he was attending a Chrome team offsite. He was immediately cut off from Google resources like his calendar, documents, and code.\n\nAdam expresses frustration over the loss of numerous responsibilities and opportunities he was actively involved in, including a Google I/O video, onstage presentation, booth management, and contributions to the developer keynote. He also laments the loss of his CSS Working Group membership, developer office hours, and access to code. Furthermore, he fears the dissolution of relationships he cultivated over years.\n\nHe describes feeling backstabbed, unappreciated, and like a disposable component of a large corporation. He is struggling to sleep and feels ashamed and angry about the situation. He provides contact information for those who wish to reach out on Bluesky or via email at adam.is@nerdy.dev, but acknowledges that he may be slow to respond due to the overwhelming nature of the situation.\n",
    "chinese_title": "谷歌员工...前谷歌员工",
    "chinese_summary": "谷歌Chrome团队成员Adam意外遭到裁员，令他感到震惊、愤怒和悲伤。这次解雇被描述为并非基于能力，且令他的经理们也感到意外。解雇发生在他参加Chrome团队线下会议期间，非常突然。他立即被切断了与谷歌资源的连接，如日历、文档和代码。\n\nAdam对失去众多他积极参与的职责和机会感到沮丧，包括Google I/O视频、舞台演讲、展位管理以及对开发者主题演讲的贡献。他还惋惜失去了CSS工作组成员资格、开发者办公时间以及对代码的访问权限。此外，他担心多年来建立的关系会因此瓦解。\n\n他形容自己感到被背后捅刀、不被赏识，觉得自己像大型公司中一个可有可无的零件。他难以入睡，并对这种情况感到羞愧和愤怒。他提供了联系方式，方便那些想通过Bluesky或电子邮件（adam.is@nerdy.dev）联系他的人，但他承认由于情况过于复杂，可能回复较慢。"
  },
  {
    "id": "43644662",
    "title": "2025 AI Index Report",
    "url": "https://hai.stanford.edu/ai-index/2025-ai-index-report",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "2025年人工智能指数报告",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "43635185",
    "title": "Soil from the moon's far side suggests drier conditions than side facing Earth",
    "url": "https://apnews.com/article/moon-far-side-near-side-water-18081418600ea93bac69ac6af86a761b",
    "summary": "The AP News article, \"Soil from the moon's far side suggests drier conditions than side facing Earth,\" discusses new research indicating that the lunar far side is significantly drier than the near side. This conclusion is based on analyzing soil samples brought back from the Chang'e-5 mission, which landed on the near side, and comparing them to spectral data from the Chang'e-5 landing site on the far side of the Moon.\n\nScientists found that the far side soil contains less water, specifically hydroxyl (OH), a molecule with one hydrogen and one oxygen atom, which is considered a precursor to water ice. The leading theory for this difference is that volcanic eruptions billions of years ago deposited water-rich materials on the near side, while the far side experienced less volcanic activity and, therefore, retained less water. Alternatively, it may be that solar wind and other space weather effects have had a more pronounced drying effect on the far side due to differences in the magnetic field environment.\n\nUnderstanding the distribution of water on the Moon is crucial for future lunar missions, as water ice can be used as a resource for drinking water, rocket fuel, and oxygen. The findings highlight the importance of further exploration of the Moon's far side to gain a more comprehensive understanding of lunar water distribution and its formation. The study provides valuable insights into the Moon's geological history and the processes that have shaped its surface.\n",
    "chinese_title": "月球背面土壤表明其比朝向地球一面更干燥",
    "chinese_summary": "美联社新闻：“月球背面土壤表明比面向地球一侧更干燥”一文讨论了新的研究，该研究表明月球背面比近地面显著干燥。这一结论基于对嫦娥五号任务从近地面带回的土壤样本的分析，以及将其与来自月球背面嫦娥五号着陆点光谱数据的比较。\n\n科学家发现，远侧土壤含水量较低，特别是羟基 (OH)，这是一种含有一个氢原子和一个氧原子的分子，被认为是水冰的前体。对此差异的主要理论是，数十亿年前的火山喷发在近地面沉积了富含水的物质，而远地面经历的火山活动较少，因此保留的水也较少。或者，可能是由于磁场环境的差异，太阳风和其他空间天气效应对远侧产生了更明显的干燥效应。\n\n了解月球上水的分布对于未来的月球任务至关重要，因为水冰可用作饮用水、火箭燃料和氧气的资源。该发现强调了进一步探索月球背面以更全面地了解月球水分布及其形成的重要性。这项研究为月球的地质历史和塑造其表面的过程提供了宝贵的见解。"
  },
  {
    "id": "43654279",
    "title": "Our New AI Website Builder",
    "url": "https://wordpress.com/blog/2025/04/09/ai-website-builder/",
    "summary": "This article introduces a new AI website builder from WordPress.com that simplifies website creation. Instead of manual design and content creation, users provide a description of their desired website, and the AI instantly generates a complete WordPress site with text, layouts, and images.\n\nThe builder is aimed at entrepreneurs, small business owners, freelancers, bloggers, and developers who need a professional online presence quickly and easily. While not yet suitable for complex e-commerce or integration-heavy sites, it creates functional and visually appealing websites in minutes.\n\nThe process involves describing the desired website, logging into or creating a WordPress.com account, and letting the AI build the site. Users can then make changes through manual editing or by using prompts in a chat box. A WordPress.com hosting plan provides a secure online home, a free domain for the first year, and enables immediate launching.\n\nThe article emphasizes the importance of providing specific and detailed prompts for optimal results and highlights that the AI builder is only available for new WordPress.com sites. Users get 30 free prompts initially, with unlimited prompts available with a hosting plan. The AI generated site can be further customized using standard WordPress features. The article concludes by encouraging readers to use the AI website builder to quickly establish an online presence for their business, ideas, or personal projects.\n",
    "chinese_title": "我们的全新AI网站构建器",
    "chinese_summary": "WordPress.com推出全新AI网站构建器，简化网站创建流程。用户只需描述所需网站，无需手动设计和创建内容，AI即可立即生成包含文本、布局和图片的完整WordPress站点。\n\n该构建器旨在帮助企业家、小型企业主、自由职业者、博主和开发者快速轻松地建立专业的在线形象。虽然目前还不适用于复杂的电子商务或需要大量集成的网站，但它可以在几分钟内创建功能齐全且视觉上吸引人的网站。\n\n该过程包括描述所需网站，登录或创建WordPress.com账户，并让AI构建站点。用户随后可以通过手动编辑或在聊天框中使用提示进行更改。WordPress.com托管计划提供安全的在线空间，第一年免费域名，并可以立即启动网站。\n\n文章强调提供具体和详细的提示以获得最佳结果的重要性，并强调AI构建器仅适用于新的WordPress.com站点。用户最初获得30个免费提示，而拥有托管计划则可获得无限提示。AI生成的站点可以使用标准的WordPress功能进一步自定义。文章最后鼓励读者使用AI网站构建器，为他们的业务、想法或个人项目快速建立在线形象。"
  },
  {
    "id": "43652024",
    "title": "Strengths Are Your Weaknesses",
    "url": "https://terriblesoftware.org/2025/03/31/your-strengths-are-your-weaknesses/",
    "summary": "This article argues that an individual's strengths and weaknesses are often two sides of the same coin, a concept illustrated through the author's personal experience as an engineer. The author's coding speed, initially praised, led to overlooking critical details and causing a production issue.\n\nThe author suggests that this is a universal phenomenon, where celebrated qualities can also be the source of major problems. To address this duality, the author proposes three strategies for effective management:\n\n1.  **Acknowledge the duality in 1:1s:** Reframe strengths and weaknesses as interconnected aspects of the same trait to foster self-awareness and reduce self-criticism.\n2.  **Provide clear contextual guidance:** Clearly define when specific tendencies are beneficial or detrimental, empowering individuals to make informed decisions.\n3.  **Leverage tension in teams:** Encourage collaboration between individuals with contrasting approaches to foster a more well-rounded perspective and improved outcomes.\n\nThe article emphasizes the importance of developing self-aware engineers who can adapt their natural tendencies based on the context. The goal is not to eliminate individual differences or \"fix\" engineers, but rather to help them understand and effectively utilize their strengths while mitigating potential weaknesses. Ultimately, recognizing the interconnectedness of strengths and weaknesses fosters better management and promotes compassion.\n",
    "chinese_title": "优势即是弱点",
    "chinese_summary": "本文认为，个人的优势和劣势往往是一体两面，作者通过自己作为工程师的个人经历阐述了这一概念。作者的编码速度起初备受赞扬，但却导致忽略了关键细节并引发了生产问题。\n\n作者认为这是一种普遍现象，即被赞扬的品质也可能成为重大问题的根源。为了解决这种二元性，作者提出了三种有效的管理策略：\n\n1.  **在1对1会议中承认二元性：** 将优势和劣势重新定义为同一特质的相互关联的方面，以培养自我意识并减少自我批评。\n2.  **提供明确的背景指导：** 明确界定特定倾向何时有利或有害，从而使个人能够做出明智的决定。\n3.  **利用团队中的张力：** 鼓励具有不同方法的人员进行协作，以培养更全面的视角并改善结果。\n\n本文强调了培养能够根据环境调整自身倾向的、具有自我意识的工程师的重要性。目标不是消除个体差异或“修复”工程师，而是帮助他们理解并有效利用自己的优势，同时减轻潜在的劣势。最终，认识到优势和劣势之间的相互关联性能够促进更好的管理并提升同理心。"
  },
  {
    "id": "43646219",
    "title": "Big Book of R",
    "url": "https://www.bigbookofr.com/",
    "summary": "\"Big Book of R\" is a collection of over 400 free and affordable R programming books. The author, Oscar, hopes it will be the only R resource bookmark users need. The collection started in August 2020 with around 100 books and has grown thanks to contributions.\n\nUsers can search the collection using the menu or search icon. The author welcomes donations to support the project and encourages contributions of both paid and free books through GitHub or a Google Form.\n\nOscar thanks Fathom Data for converting the site to Quarto. The website is licensed under the Creative Commons Attribution-NonCommercial-NoDerivs 3.0 License. Live, privacy-focused website statistics are available for viewing.\n\nOscar invites readers to connect on Mastodon or LinkedIn and subscribe to a newsletter for updates on his data-related projects and the book.\n",
    "chinese_title": "R语言大全",
    "chinese_summary": "《R语言大全》收录了400多本免费且经济实惠的R编程书籍。作者Oscar希望它能成为用户唯一需要的R语言资源书签。该系列始于2020年8月，当时约有100本书，并且 благодаря contributions不断壮大。\n\n用户可以使用菜单或搜索图标搜索此系列。作者欢迎捐款以支持该项目，并鼓励通过GitHub或Google表格贡献付费和免费书籍。\n\nOscar感谢Fathom Data将该网站转换为Quarto。本网站采用Creative Commons Attribution-NonCommercial-NoDerivs 3.0许可协议。 实时、注重隐私的网站统计数据可供查看。\n\nOscar邀请读者在Mastodon或LinkedIn上联系，并订阅新闻通讯，以获取有关他的数据相关项目和这本书的更新。"
  },
  {
    "id": "43644043",
    "title": ".localhost Domains",
    "url": "https://inclouds.space/localhost-domains",
    "summary": "Charles Chamberlain describes a method for accessing local web applications using custom `.localhost` domains instead of `localhost:port` combinations, making development easier and more memorable. The system involves three steps:\n\n1.  **Launchd Daemons:** Each application runs as a launchd daemon listening on a unique port.\n2.  **/etc/hosts Configuration:** The `/etc/hosts` file is edited to redirect traffic for each custom `.localhost` domain to `127.0.0.1` (localhost).  For example, `127.0.0.1 inclouds.localhost`.\n3.  **Caddy Reverse Proxy:** Caddy, a web server, is configured to reverse proxy traffic from `127.0.0.1` on the custom domain to the appropriate port where the application is running. This configuration is done in the Caddyfile, specifying the domain, the localhost port and TLS and encoding.\n\nThe author expresses a desire to further simplify the process, envisioning a single command for installing and uninstalling applications with corresponding `.localhost` domain configurations. He also mentions an update from cristóbal using dnsmasq to improve the process.\n",
    "chinese_title": ".localhost 域名",
    "chinese_summary": "查尔斯·张伯伦介绍了一种通过自定义`.localhost`域名而非`localhost:端口`组合来访问本地Web应用的方法，从而简化开发并使其更易于记忆。 该系统包含三个步骤：\n\n1.  **Launchd守护进程：** 每个应用程序都作为launchd守护进程运行，监听唯一的端口。\n2.  **/etc/hosts配置：** 编辑`/etc/hosts`文件，将每个自定义`.localhost`域名的流量重定向到`127.0.0.1`（localhost）。例如，`127.0.0.1 inclouds.localhost`。\n3.  **Caddy反向代理：** 配置Web服务器Caddy，将来自自定义域名上`127.0.0.1`的流量反向代理到应用程序运行的相应端口。 此配置在Caddyfile中完成，指定域名、localhost端口以及TLS和编码。\n\n作者表示希望进一步简化该过程，设想使用单个命令来安装和卸载应用程序以及相应的`.localhost`域名配置。 他还提到了来自Cristóbal的使用dnsmasq来改进该过程的更新。"
  },
  {
    "id": "43656279",
    "title": "The PS3 Licked the Many Cookie",
    "url": "https://darkcephas.github.io/ps3_failed/ps3_failed.html",
    "summary": "This article analyzes the PS3's failure to fulfill the promise of many-core processing from the perspective of a game developer. The author argues that the PS3's primary problem was its excessive heterogeneity, making it difficult to effectively utilize its Cell processor's SPEs (Synergistic Processing Elements).\n\nWhile the SPEs initially seemed to embody the principles of many-core architecture, the reality was that developers only had access to a limited number of usable SPEs, making its core count only marginally higher than the Xbox 360. Furthermore, the SPEs and the PS3's GPU were computationally weak individually, requiring developers to orchestrate complex synchronization between them to achieve competitive performance. The GPU had separate Vertex and Pixel shading units and pixel shading didn't have constants unlike the unified architecture of the Xbox 360.\n\nThe author emphasizes the challenges posed by the SPE's local memory constraints (256KB, realistically 128KB after stack and program). This limitation forced developers to create specialized SPE-friendly code instead of readily porting generic code. Concepts such as C++ virtual functions and dynamic memory allocation became problematic, further highlighting the complexity of the platform.\n\nUltimately, the PS3 became synonymous with the failure of many-core architecture. The author suggests that a more homogenous, high-performance many-core design, like the original design of multiple Cell processors, could have unlocked the true potential of the console. The PS3's attempt to embrace a heterogeneous approach resulted in a \"licked cookie\" - a compromised and ultimately disappointing realization of the many-core vision.\n",
    "chinese_title": "PS3舔了许多饼干",
    "chinese_summary": "本文从游戏开发者的角度分析了PS3未能实现多核处理承诺的原因。作者认为，PS3的主要问题在于其过度异构，导致难以有效利用其Cell处理器的SPE（协同处理器单元）。\n\n虽然SPE最初看起来体现了多核架构的原则，但实际上开发者只能访问有限数量的可用的SPE，使其核心数量仅比Xbox 360略高。此外，SPE和PS3的GPU在计算能力上都比较弱，需要开发者协调它们之间复杂的同步才能实现有竞争力的性能。GPU具有独立的顶点和像素着色单元，并且像素着色不像Xbox 360的统一架构那样具有常量。\n\n作者强调了SPE的本地内存限制（256KB，实际上在堆栈和程序之后为128KB）带来的挑战。这种限制迫使开发者创建专门的、对SPE友好的代码，而不是轻易移植通用代码。诸如C++虚函数和动态内存分配之类的概念变得成问题，进一步突出了该平台的复杂性。\n\n最终，PS3成为了多核架构失败的代名词。作者认为，更同质化、高性能的多核设计，比如最初的多个Cell处理器设计，本可以释放该游戏机的真正潜力。PS3尝试采用异构方法最终导致了“舔过的饼干”——一个妥协且最终令人失望的多核愿景的实现。"
  },
  {
    "id": "43625211",
    "title": "PyReason: Explainable inference for annotated, real valued, graph based and tem",
    "url": "https://github.com/lab-v2/pyreason",
    "summary": "PyReason is a Python-based graphical inference tool designed for reasoning over graph structures using logical rules and facts. It supports annotated, real-valued, graph-based, and temporal logic, enabling explainable inference. The software comes with accompanying resources including a research paper, video, website, a PyReason Gym, and comprehensive documentation available on ReadTheDocs.\n\nPyReason can be installed via `pip install pyreason` and currently supports Python versions 3.7 through 3.10, with multi-core parallel support limited to versions 3.9 and 3.10.\n\nThe software is licensed under BSD-2-Clause. While PyReason™ and the PyReason Design Logo ™ are trademarks of Arizona State University, users are permitted to use the \"PyReason™\" trademark in association with the software and educational institutions can use the PyReason Design Logo ™ for non-commercial purposes.\n\nThe creators encourage users who utilize PyReason in their work to cite the provided Bibtex entry. For inquiries, contact Dyuman Aditya, Kaustuv Mukherji, or Paulo Shakarian via the provided email addresses.\n",
    "chinese_title": "PyReason：面向带注释、实值、图和时间序列数据的可解释推理",
    "chinese_summary": "PyReason 是一款基于 Python 的图形推理工具，旨在利用逻辑规则和事实对图结构进行推理。它支持带注释的、实值的、基于图的以及时序逻辑，从而实现可解释的推理。该软件附带包括研究论文、视频、网站、PyReason Gym 以及 ReadTheDocs 上提供的全面文档在内的配套资源。\n\nPyReason 可以通过 `pip install pyreason` 安装，目前支持 Python 3.7 到 3.10 版本，但多核并行支持仅限于 3.9 和 3.10 版本。\n\n该软件以 BSD-2-Clause 许可授权。尽管 PyReason™ 和 PyReason Design Logo ™ 是亚利桑那州立大学的商标，但用户可以结合软件使用 \"PyReason™\" 商标，教育机构可以出于非商业目的使用 PyReason Design Logo ™。\n\n创建者鼓励在工作中使用 PyReason 的用户引用提供的 Bibtex 条目。如有疑问，请通过提供的电子邮件地址联系 Dyuman Aditya、Kaustuv Mukherji 或 Paulo Shakarian。"
  },
  {
    "id": "43625139",
    "title": "Clojure: Realtime collaborative web apps without ClojureScript",
    "url": "https://andersmurphy.com/2025/04/07/clojure-realtime-collaborative-web-apps-without-clojurescript.html",
    "summary": "This article introduces Datastar, a lightweight hypermedia framework enabling the creation of realtime collaborative web applications with Clojure, without relying on ClojureScript or user-written JavaScript. The author showcases a multiplayer \"Game of Life\" application built with Datastar, highlighting its approach of streaming the entire `<main>` element from server to client every 200ms using Server-Sent Events (SSE).\n\nThe key benefits of this approach include simplicity, performance, and network efficiency. Datastar leverages a fast morph algorithm to efficiently update the client-side DOM. Brotli compression over SSE achieves high compression ratios, potentially outperforming fine-grained updates and simplifying view/session maintenance.\n\nThe author argues that SSE offers advantages over WebSockets for real-time communication due to its inherent compatibility with HTTP features like compression, multiplexing, and automatic reconnects, while avoiding the operational challenges associated with WebSockets.\n\nThe article emphasizes Datastar's \"view = f(state)\" model, keeping the view on the client and the state function on the server. Hyperlith, an experimental mini-framework built on Datastar, handles complexities like SSE, compression, and event management. The article demonstrates how a single-user application can be easily transformed into a multiplayer one without significant code changes due to the server-side rendering logic. Datastar, being backend-agnostic, promises a simpler and effective alternative to frameworks like Phoenix LiveView.\n",
    "chinese_title": "Clojure：无需ClojureScript的实时协作Web应用",
    "chinese_summary": "本文介绍了 Datastar，一个轻量级的超媒体框架，它可以使用 Clojure 创建实时协作的 Web 应用程序，而无需依赖 ClojureScript 或用户编写的 JavaScript。作者展示了一个用 Datastar 构建的多人“生命游戏”应用程序，重点介绍了它使用 Server-Sent Events (SSE) 每 200 毫秒将整个 `<main>` 元素从服务器流式传输到客户端的方法。\n\n这种方法的主要优点包括简单性、性能和网络效率。 Datastar 利用快速的 morph 算法来高效地更新客户端 DOM。 通过 SSE 进行 Brotli 压缩实现了高压缩率，可能优于细粒度的更新，并简化了视图/会话维护。\n\n作者认为，由于 SSE 本身与 HTTP 功能（如压缩、多路复用和自动重新连接）兼容，并且避免了与 WebSockets 相关的操作挑战，因此 SSE 在实时通信方面优于 WebSockets。\n\n本文强调了 Datastar 的 \"view = f(state)\" 模型，将视图保留在客户端，将状态函数保留在服务器上。Hyperlith 是一个构建在 Datastar 之上的实验性迷你框架，可处理诸如 SSE、压缩和事件管理之类的复杂问题。本文展示了由于服务器端渲染逻辑，如何将单用户应用程序轻松转换为多人应用程序，而无需进行重大代码更改。Datastar 是后端无关的，它承诺提供一个比 Phoenix LiveView 等框架更简单有效的替代方案。"
  },
  {
    "id": "43646698",
    "title": "Demystifying the (Shebang): Kernel Adventures",
    "url": "https://crocidb.com/post/kernel-adventures/demystifying-the-shebang/",
    "summary": "This article dives deep into how the Linux kernel handles executable files, particularly focusing on the role of the shebang (`#!`) in script execution. The author explains that the shebang isn't just a hint for the shell, but is actively processed by the kernel itself.\n\nThe article uses `strace` and kernel code exploration to demonstrate how the `execve` system call leads to functions like `do_execveat_common`, `bprm_execve`, and `search_binary_handler` within the kernel. `search_binary_handler` identifies the file's format by reading the first 256 bytes and comparing them against registered formats (ELF, FLAT, SCRIPT, MISC). The `binfmt_script.c` module specifically handles scripts with shebangs, parsing the interpreter path and arguments and then executing the interpreter.\n\nThe author also explores `binfmt_misc.c`, a kernel feature for executing non-native binaries like Java JAR files by associating them with specific interpreters. The article demonstrates how the kernel effectively replaces the process image with the interpreter's when a shebang is present.\n\nFinally, the article clarifies that while the shebang is the standard way to specify an interpreter, shells have a fallback mechanism to execute scripts without a shebang by explicitly invoking `/bin/sh`. It also touches on permission checks, showing how the kernel's `do_open_execat` function uses `path_noexec` to verify execute permissions before allowing execution, returning EACCES if permission is denied.\n",
    "chinese_title": "揭秘Shebang：内核探险",
    "chinese_summary": "本文深入探讨Linux内核如何处理可执行文件，特别关注shebang（`#!`）在脚本执行中的作用。作者解释说，shebang不仅仅是shell的提示，而是由内核本身主动处理的。\n\n本文使用`strace`和内核代码探索来演示`execve`系统调用如何导致内核中的`do_execveat_common`、`bprm_execve`和`search_binary_handler`等函数。`search_binary_handler`通过读取文件的前256个字节并将其与注册格式（ELF、FLAT、SCRIPT、MISC）进行比较来识别文件的格式。`binfmt_script.c`模块专门处理带有shebang的脚本，解析解释器路径和参数，然后执行解释器。\n\n作者还探讨了`binfmt_misc.c`，这是一个内核特性，用于通过将非本地二进制文件（如Java JAR文件）与特定解释器相关联来执行它们。本文演示了当存在shebang时，内核如何有效地将进程映像替换为解释器的进程映像。\n\n最后，本文阐明，虽然shebang是指定解释器的标准方法，但shell具有一种回退机制，可以通过显式调用`/bin/sh`来执行没有shebang的脚本。它还涉及权限检查，展示了内核的`do_open_execat`函数如何使用`path_noexec`来验证执行权限，然后在允许执行之前，如果权限被拒绝，则返回EACCES。"
  },
  {
    "id": "43662403",
    "title": "'Paraparticles' Would Be a Third Kingdom of Quantum Particle",
    "url": "https://www.quantamagazine.org/paraparticles-would-be-a-third-kingdom-of-quantum-particle-20250411/",
    "summary": "This article discusses the potential existence of a third category of quantum particle called \"paraparticles,\" distinct from the known categories of fermions (matter particles) and bosons (force-carrying particles). Physicists Zhiyuan Wang and Kaden Hazzard propose that paraparticles could exist with hidden quantum states that change when particles swap places. Unlike fermions, which cannot occupy the same space, and bosons, which can, paraparticles would allow a limited number of particles in the same state.\n\nThe concept challenges the decades-old DHR theory, which suggested that only bosons and fermions are possible under specific assumptions like locality and three-dimensional space. Wang and Hazzard's model argues that paraparticles are possible by relaxing a stricter definition of indistinguishability. They suggest that swapping paraparticles would not affect a single observer's measurements, but two observers comparing notes could tell if the swap occurred.\n\nMarkus Müller's team also explored the idea by considering observers in superposed quantum states. Their results indicated that paraparticles are impossible under strict assumptions of indistinguishability. However, Müller acknowledged that Wang and Hazzard's model may be valid.\n\nIf paraparticles exist, they would likely be emergent quasiparticles in quantum materials, potentially explaining previously difficult-to-understand exotic phases. Experimental physicist Bryce Gadway is optimistic that paraparticles could be realized in the lab using Rydberg atoms in the near future. While still theoretical, the discovery of paraparticles could lead to new states of matter and revolutionize our understanding of the quantum world.\n",
    "chinese_title": "仲粒子：量子粒子的第三种王国",
    "chinese_summary": "本文探讨了第三类量子粒子的潜在存在，这种粒子被称为“准粒子”，它与已知的费米子（物质粒子）和玻色子（力载粒子）类别不同。物理学家王志远和卡登·哈扎德提出，准粒子可能存在隐藏的量子态，当粒子交换位置时，这些量子态会发生变化。与不能占据同一空间的费米子和可以占据同一空间的玻色子不同，准粒子允许有限数量的粒子处于同一状态。\n\n这个概念挑战了数十年历史的DHR理论，该理论认为，在局域性和三维空间等特定假设下，只有玻色子和费米子才有可能存在。王和哈扎德的模型认为，通过放宽对不可区分性的更严格定义，准粒子是有可能存在的。他们认为，交换准粒子不会影响单个观察者的测量结果，但两个观察者比较笔记可以分辨出是否发生了交换。\n\n马库斯·穆勒的团队也通过考虑处于叠加量子态的观察者来探索这一想法。他们的结果表明，在对不可区分性的严格假设下，准粒子是不可能存在的。然而，穆勒承认王和哈扎德的模型可能是有效的。\n\n如果准粒子存在，它们很可能是在量子材料中出现的准粒子，有可能解释以前难以理解的奇异相。实验物理学家布莱斯·加德威乐观地认为，在不久的将来，可以使用里德堡原子在实验室中实现准粒子。虽然这仍然是理论上的，但准粒子的发现可能会导致新的物质状态，并彻底改变我们对量子世界的理解。"
  },
  {
    "id": "43659340",
    "title": "Our Best Customers Are Now Robots",
    "url": "https://fly.io/blog/fuckin-robots/",
    "summary": "Kurt Mackey's article, \"Our Best Customers Are Now Robots,\" explores Fly.io's surprising shift towards serving AI-powered applications (\"robots\") as its primary growth driver, rather than human developers. Fly.io, a developer-focused cloud platform known for its excellent developer experience (DX), particularly its CLI-first approach, is finding that its platform is unexpectedly appealing to LLMs (Large Language Models).\n\nMackey attributes this to several platform features: the speed and cost-effectiveness of launching and stopping Fly Machines (hardware-isolated VMs running Docker containers), persistent storage for iterative, stateful code building, and the platform's networking capabilities, specifically its handling of MCP (a protocol used by LLMs). The robots appreciate the ability to quickly create, modify, and run code within the Fly Machines.\n\nHe acknowledges that Fly.io didn't intentionally target robots; the platform's features just happened to align well with the needs of LLM-based applications. He highlights that robots don't use the platform in the way that humans do, they don't run exisiting applicaitons but build new ones. Mackey believes that the next challenge is to optimize the platform for robots, i.e creating a robot experience(RX), exploring features like easier MCP integration and secure secrets management (tokenized OAuth tokens) for granting controlled API access to the robots. While Fly.io remains focused on its human users and ongoing improvements to its managed Postgres (MPG) and DX, the emergence of robots as a significant user base necessitates a shift in thinking towards building a great RX.\n",
    "chinese_title": "我们最好的客户现在是机器人",
    "chinese_summary": "库尔特·麦基的文章《我们最好的客户现在是机器人》探讨了Fly.io令人惊讶的转变，即其主要增长驱动力并非人类开发者，而是服务于人工智能驱动的应用程序（“机器人”）。Fly.io是一家以开发者为中心的云平台，以其卓越的开发者体验（DX）而闻名，特别是其CLI优先的方法，但它发现其平台出乎意料地对LLM（大型语言模型）具有吸引力。\n\n麦基将此归因于几个平台特性：启动和停止Fly Machines（运行Docker容器的硬件隔离虚拟机）的速度和成本效益、用于迭代、有状态代码构建的持久存储，以及平台的网络功能，特别是其对MCP（LLM使用的协议）的处理。机器人很欣赏在Fly Machines中快速创建、修改和运行代码的能力。\n\n他承认Fly.io并非有意瞄准机器人；该平台的特性只是恰好与基于LLM的应用程序的需求相吻合。他强调，机器人使用平台的方式与人类不同，它们不是运行现有应用程序，而是构建新的应用程序。麦基认为，下一个挑战是为机器人优化平台，即创建机器人体验（RX），探索诸如更简单的MCP集成和安全密钥管理（令牌化的OAuth令牌）等功能，以便授予机器人受控的API访问权限。尽管Fly.io仍然专注于其人类用户，并不断改进其托管Postgres（MPG）和DX，但机器人作为重要用户群的出现，迫使人们转变思维，朝着构建出色的RX方向发展。"
  },
  {
    "id": "43650656",
    "title": "Playing in the Creek",
    "url": "https://www.hgreer.com/PlayingInTheCreek/",
    "summary": "The article, \"Playing in the Creek,\" explores the bittersweet experience of gaining mastery in a particular domain, leading to the loss of the initial joy and freedom of uninhibited play and exploration. The author uses the childhood anecdote of damming a creek as a metaphor: discovering a more efficient method (using a shovel to collapse the riverbanks) robbed the author of the intricate, playful game of meticulously building dams with rocks and leaves.\n\nThis pattern repeats throughout life. The author describes scenarios like building K'Nex catapults, making sparkler bombs, and building bows and arrows, where newfound knowledge or skill curtailed the carefree experimentation. The author even relates this to a job offer in investment banking, realizing that achieving the \"goal\" of maximizing income actually eliminated the game of striving for that goal.\n\nThe key takeaway is that the \"price of victory\" can be a smaller playground. The author acknowledges that confronting challenges beyond their immediate capabilities allows for continued play. However, when the consequences of applying full effort become ethically questionable (like manipulating the beach with city council influence) or potentially destructive (like the metaphorical \"sparkler bomb\" in AI development), limitations become necessary.\n\nThe article concludes with a cautious perspective on AI development. The author implies that recklessly pushing the boundaries of AI, even in a competitive race, could lead to undesirable outcomes. They express hope that companies like Anthropic are considering the \"coquinas\" – the potentially unnoticed consequences and smaller concerns – in their pursuit of AI advancement.\n",
    "chinese_title": "在小溪里玩耍",
    "chinese_summary": "文章《在小溪中玩耍》探讨了在特定领域获得精通后，失去最初无拘无束的玩耍和探索的喜悦和自由，这种苦乐参半的体验。作者用童年时筑坝小溪的轶事作比喻：发现更有效的方法（用铲子铲平河岸）剥夺了作者用石头和树叶精心筑坝的复杂而有趣的乐趣。\n\n这种模式在生活中不断重复。作者描述了搭建K'Nex弹射器、制作烟花炸弹以及制作弓箭等场景，在这些场景中，新获得的知识或技能限制了无忧无虑的实验。作者甚至将此与投资银行的工作邀请联系起来，意识到实现收入最大化的“目标”实际上消除了为实现该目标而奋斗的游戏。\n\n关键的收获是，“胜利的代价”可能是一个更小的游乐场。作者承认，面对超出自己能力范围的挑战才能继续玩耍。然而，当全力以赴的后果在道德上变得令人质疑（比如利用市议会影响力来操纵海滩）或具有潜在破坏性（比如人工智能开发中隐喻的“烟花炸弹”）时，限制就变得必要。\n\n文章最后以对人工智能发展的谨慎观点结尾。作者暗示，即使在竞争激烈的竞赛中，鲁莽地推动人工智能的界限也可能导致不良后果。他们希望像Anthropic这样的公司在追求人工智能进步的过程中，能够考虑到“鸟蛤”——那些可能被忽视的后果和较小的担忧。"
  },
  {
    "id": "43662548",
    "title": "The madlads did it: world’s fastest EV drives upside-down & beat an F1 car, too",
    "url": "https://electrek.co/2025/04/11/the-crazy-bastards-did-it-they-drove-the-worlds-quickest-ev-upside-down/",
    "summary": "The McMurtry Speirling, a 1,000hp electric racecar known for its record-breaking performance, has achieved two new milestones: breaking the Top Gear test track record and becoming the first car to drive upside down.\n\nThe Speirling uses fans to create a vacuum under the car, generating significant downforce (2,000kg on a 1,000kg car) without increasing mass, allowing for greater grip and faster speeds. This \"fan car\" concept, though previously banned in motorsport, allows the Speirling to generate downforce even at low speeds, unlike traditional aerodynamic elements.\n\nOn the Top Gear track, the Speirling achieved a lap time of 0:55.9, beating the previous record of 59 seconds set by a Renault F1 car in 2004 and outperforming the fastest electric car (Ford SuperVan) by nearly ten seconds.\n\nIn addition, the Speirling demonstrated its extreme downforce capabilities by driving upside down for ten seconds, maintaining control throughout. While not a high-speed stunt, it's a proof of concept demonstrating the potential of the car's downforce technology. McMurtry aims to further explore the possibilities, potentially driving longer distances upside down in the future.\n",
    "chinese_title": "疯子们做到了：世界最快电动汽车倒立行驶并击败了一辆F1赛车",
    "chinese_summary": "麦克默特里 Speirling 电动赛车以其破纪录的性能而闻名，功率达 1000 马力，现已取得两项新的里程碑：打破了 Top Gear 测试赛道的记录，并成为第一辆倒置行驶的汽车。\n\nSpeirling 使用风扇在车下产生真空，从而产生巨大的下压力（在 1000 公斤的汽车上产生 2000 公斤），而不会增加质量，从而实现更大的抓地力和更快的速度。这种“风扇车”概念虽然以前在赛车运动中被禁止，但允许 Speirling 即使在低速下也能产生下压力，这与传统的空气动力学元件不同。\n\n在 Top Gear 赛道上，Speirling 实现了 0:55.9 的单圈时间，击败了 2004 年雷诺 F1 赛车创下的 59 秒的先前记录，并且比最快的电动汽车（福特 SuperVan）快了近十秒。\n\n此外，Speirling 通过倒置行驶十秒钟，并在整个过程中保持控制，展示了其极端的下压力能力。虽然不是一项高速特技，但它是对汽车下压力技术潜力的概念验证。麦克默特里旨在进一步探索这种可能性，未来可能会倒置行驶更长的距离。"
  },
  {
    "id": "43632373",
    "title": "Show HN: Python at the Speed of Rust",
    "url": "https://blog.fxn.ai/python-at-the-speed-of-rust/",
    "summary": "This article presents \"Function,\" a project aiming to compile Python code into native code for near-Rust-level performance and cross-platform compatibility. The core idea involves tracing Python function execution to create an Intermediate Representation (IR) graph, which captures all operations. This tracing is achieved using CPython's frame evaluation API, dynamically capturing instruction inputs, operations, and outputs.\n\nThe process then lowers the IR graph into native code by generating corresponding implementations of Python operations in languages like C. Type annotations on the Python function and the native implementation of operations allow for type propagation through the IR graph. The resulting native code can then be cross-compiled for various platforms.\n\nThe article uses a fused multiply-add (FMA) function as an example. It demonstrates how to compile this function using the Function framework, including installation, decoration with the `@compile` decorator, and compilation via the command line.\n\nA benchmark comparing the compiled Python code against an equivalent Rust implementation shows that the compiled Python is only slower by a constant factor. While still a proof-of-concept, the compiler has been used by design partners in production for applications like monocular depth estimation and real-time pose detection, with future goals including on-device LLM inference. The project encourages community involvement through a Discord server and provides a GitHub repository for inspecting the generated code and reproducing the benchmark.\n",
    "chinese_title": "展示 HN：Rust 速度的 Python",
    "chinese_summary": "本文介绍了“Function”项目，该项目旨在将Python代码编译成原生代码，以实现接近Rust水平的性能和跨平台兼容性。其核心思想是追踪Python函数的执行，从而创建一个中间表示（IR）图，该图捕获所有操作。这种追踪是通过CPython的帧评估API实现的，动态捕获指令输入、操作和输出。\n\n随后，该过程通过在诸如C语言等语言中生成Python操作的相应实现，将IR图降级为原生代码。Python函数上的类型注释和操作的原生实现允许类型在IR图中传播。然后，生成的原生代码可以为各种平台进行交叉编译。\n\n本文使用融合乘加（FMA）函数作为一个例子。它演示了如何使用Function框架编译这个函数，包括安装、使用`@compile`装饰器进行装饰，以及通过命令行进行编译。\n\n一项将编译后的Python代码与等效的Rust实现进行比较的基准测试表明，编译后的Python代码仅慢了一个常数因子。虽然仍然是一个概念验证，但该编译器已被设计合作伙伴在生产环境中用于诸如单目深度估计和实时姿态检测等应用，未来的目标包括设备上的LLM推理。该项目鼓励通过Discord服务器进行社区参与，并提供一个GitHub存储库，用于检查生成的代码和重现基准测试。"
  },
  {
    "id": "43660178",
    "title": "Awe – Modern compiler for Algol W",
    "url": "https://github.com/glynawe/awe",
    "summary": "Awe is a modern compiler for the ALGOL W programming language, a successor to Algol 60. It aims for compatibility with code written for OS/360 ALGOL W compilers, adhering to the ALGOL W Language Description (June 1972). The compiler provides a complete implementation of the language.\n\nTo compile Awe, a Unix-like OS, GCC, Python3, OCaml, and Boehm GC are required. The Awe manual, accessible via `awe(1)` and `awe.mk(7)`, provides further details. Installation instructions can be found in the INSTALL file.\n\nThe project acknowledges the contributions of Hendrick Boom, Tony Marsland, Carey Bloodworth, John Boutland, and Nicolas Brouard for their advice, encouragement, and testing. It also thanks the authors of the Algol W Language Description for their clear and unambiguous specification. The author expresses gratitude to the late Frank Key, and suggests readers consider purchasing his books.\n",
    "chinese_title": "Awe – Algol W 的现代编译器",
    "chinese_summary": "Awe：ALGOL W编程语言的现代编译器，Algol 60的后继者。它旨在兼容为OS/360 ALGOL W编译器编写的代码，并遵循《ALGOL W语言描述》（1972年6月）。该编译器提供该语言的完整实现。\n\n编译Awe需要类Unix操作系统、GCC、Python3、OCaml和Boehm GC。可通过`awe(1)`和`awe.mk(7)`访问的Awe手册提供了更多详细信息。安装说明可在INSTALL文件中找到。\n\n该项目感谢Hendrick Boom、Tony Marsland、Carey Bloodworth、John Boutland和Nicolas Brouard的建议、鼓励和测试。它还感谢Algol W语言描述的作者，感谢他们清晰明确的规范。作者感谢已故的Frank Key，并建议读者考虑购买他的书籍。"
  },
  {
    "id": "43658234",
    "title": "A Guide to Bearer Tokens: JWT vs. Opaque Tokens",
    "url": "https://www.permit.io/blog/a-guide-to-bearer-tokens-jwt-vs-opaque-tokens",
    "summary": "This article provides a comprehensive guide to bearer tokens, focusing on the differences between JSON Web Tokens (JWTs) and Opaque tokens, which are critical for securing APIs and managing user sessions. It explains that bearer tokens act as digital keys granting access to protected resources without requiring re-authentication.\n\nJWTs are self-contained, including user and access data for fast, stateless validation, ideal for APIs and microservices. However, they are hard to revoke and can expose data if not encrypted. Opaque tokens are simple reference strings requiring server-side validation, offering better security and revocation control but with increased overhead and reduced scalability.\n\nThe article details the structure, advantages, and disadvantages of each token type. JWTs are favored for their statelessness, speed, and interoperability but pose challenges in revocation and data exposure. Opaque tokens excel in security, real-time revocation, and privacy but require centralized validation, impacting performance.\n\nThe article also explores when to use each token type, advising opaque tokens for systems needing revocation and sensitive data protection, and JWTs for microservices where speed is vital. Finally, it recommends hybrid approaches like using JWTs for access tokens and opaque tokens for refresh tokens. The article emphasizes that regardless of token type, proper authorization using a dedicated policy engine is crucial, warning against relying solely on token claims for access control, and advocating for externalized authorization with policy as code.\n",
    "chinese_title": "持有者令牌指南：JWT与不透明令牌",
    "chinese_summary": "本文全面介绍了持有者令牌，重点关注JSON Web Tokens (JWTs) 和不透明令牌之间的差异，这对于保护API和管理用户会话至关重要。文章解释说，持有者令牌充当数字密钥，授予对受保护资源的访问权限，而无需重新身份验证。\n\nJWTs是自包含的，包括用户和访问数据，可实现快速的无状态验证，非常适合API和微服务。但是，它们难以撤销，如果未加密，可能会暴露数据。不透明令牌是简单的引用字符串，需要服务器端验证，提供更好的安全性和撤销控制，但会增加开销并降低可扩展性。\n\n文章详细介绍了每种令牌类型的结构、优点和缺点。 JWTs因其无状态性、速度和互操作性而受到青睐，但在撤销和数据暴露方面提出了挑战。不透明令牌在安全性、实时撤销和隐私方面表现出色，但需要集中验证，从而影响性能。\n\n文章还探讨了何时使用每种令牌类型，建议对于需要撤销和敏感数据保护的系统使用不透明令牌，而对于速度至关重要的微服务使用JWTs。最后，它建议采用混合方法，例如使用JWTs作为访问令牌，使用不透明令牌作为刷新令牌。文章强调，无论令牌类型如何，使用专用策略引擎进行适当的授权至关重要，警告不要仅仅依靠令牌声明来进行访问控制，并提倡使用策略作为代码进行外部授权。"
  },
  {
    "id": "43624135",
    "title": "Researchers discover why plastic sheds dangerous fragments",
    "url": "https://www.sciencedaily.com/releases/2025/04/250407172923.htm",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "研究人员发现塑料释放危险碎片的原因",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "43648950",
    "title": "Fintech founder charged with fraud; AI app found to be humans in the Philippines",
    "url": "https://techcrunch.com/2025/04/10/fintech-founder-charged-with-fraud-after-ai-shopping-app-found-to-be-powered-by-humans-in-the-philippines/",
    "summary": "Albert Saniger, founder and former CEO of the AI shopping app Nate, has been charged with defrauding investors. The DOJ alleges that Saniger raised over $50 million by falsely claiming Nate's \"universal\" checkout experience was powered by AI, enabling purchases from any e-commerce site with a single click without human intervention.\n\nIn reality, Nate heavily relied on hundreds of human contractors in the Philippines to manually complete purchases, even though the company had acquired AI technology and hired data scientists. The DOJ claims the app's actual automation rate was effectively 0%. This practice was previously investigated by The Information in 2022.\n\nThe DOJ's indictment states that Nate ran out of money and was forced to sell its assets in January 2023, resulting in \"near total\" losses for investors. Saniger is now a managing partner at VC firm Buttercore Partners.\n\nNate joins a growing list of startups accused of exaggerating their AI capabilities, including an \"AI\" drive-through software company and legal tech unicorn EvenUp, both of which were found to rely heavily on human labor.\n",
    "chinese_title": "金融科技创始人被控欺诈；人工智能应用被发现实为菲律宾人在操作",
    "chinese_summary": "AI购物应用Nate创始人兼前CEO Albert Saniger 被指控欺诈投资者。美国司法部（DOJ）指控Saniger虚假声称Nate的“通用”结账体验由人工智能驱动，只需一键即可从任何电商网站完成购买，无需人工干预，以此筹集了超过5000万美元。\n\n事实上，Nate严重依赖菲律宾数百名人工承包商手动完成购买，尽管该公司已收购人工智能技术并聘请了数据科学家。美国司法部声称该应用程序的实际自动化率实际上为 0%。此前，《The Information》杂志曾在 2022 年对此行为进行过调查。\n\n美国司法部的起诉书指出，Nate资金耗尽，被迫于 2023 年 1 月出售其资产，导致投资者“几乎全部”损失。 Saniger现在是风险投资公司Buttercore Partners的管理合伙人。\n\nNate加入了一份日益增长的初创公司名单，这些公司被指控夸大其人工智能能力，其中包括一家“人工智能”得来速软件公司和法律科技独角兽EvenUp，这两家公司都被发现严重依赖人工劳动。"
  },
  {
    "id": "43649783",
    "title": "A port of Mbed-TLS for the Classic Macintosh OS 7/8/9",
    "url": "https://github.com/bbenchoff/MacSSL",
    "summary": "This document details \"MacSSL,\" a port of the Mbed-TLS library to the Classic Macintosh OS 7/8/9, specifically for the Metrowerks CodeWarrior Pro 4 compiler. The project aims to enable HTTPS functionality for applications on these older systems, specifically a \"vintage digital camera\" Instagram clone.\n\nThe repository includes the CodeWarrior project, Mbed-TLS files (a subset required for the project, alongside a full copy of the original repo), and a sample application. This app performs a GET request to a specified API endpoint and displays the results, along with debug information.\n\nThe port is based on a version of polarssl, a fork of Mbed-TLS 2.29.9. It supports TLS 1.1 with a limited set of ciphersuites (AES-128 and AES-256 CBC with SHA), the SECP256R1 elliptic curve, and specific signature algorithms (SHA-256/384/1 + RSA).\n\nKey challenges included adapting the code to the C89/C90 standard (variable declarations, lack of variadic macros and method overloading), creating compatible 64-bit integer types, handling include path limitations, and generating sufficient entropy for secure randomness. The custom entropy source is based on system clock, mouse movement, memory state, hardware timings, and network statistics. The ISRG Root X1 and Let's Encrypt R11 certificates are used for certificate handling. Debug information is outputted to both the application's text box and a separate file due to Toolbox limitations. The implementation is labeled as potentially insecure due to the limitations of the entropy collection.\n",
    "chinese_title": "适用于经典 Macintosh OS 7/8/9 的 Mbed-TLS 移植版",
    "chinese_summary": "本文档详细介绍了“MacSSL”，它是Mbed-TLS库到Classic Macintosh OS 7/8/9的移植版本，专门针对Metrowerks CodeWarrior Pro 4编译器。该项目旨在为这些旧系统上的应用程序启用HTTPS功能，特别是针对一个“复古数码相机”Instagram克隆应用。\n\n该仓库包含CodeWarrior项目、Mbed-TLS文件（项目所需的一个子集，以及原始仓库的完整副本）和一个示例应用程序。此应用程序执行对指定API端点的GET请求并显示结果，以及调试信息。\n\n该移植基于polarssl的一个版本，它是Mbed-TLS 2.29.9的一个分支。它支持TLS 1.1，但仅限于一组密码套件（AES-128和AES-256 CBC with SHA），SECP256R1椭圆曲线和特定的签名算法（SHA-256/384/1 + RSA）。\n\n主要挑战包括将代码适配到C89/C90标准（变量声明、缺少可变参数宏和方法重载）、创建兼容的64位整数类型、处理包含路径限制以及为安全随机性生成足够的熵。自定义熵源基于系统时钟、鼠标移动、内存状态、硬件时序和网络统计信息。ISRG Root X1和Let's Encrypt R11证书用于证书处理。由于Toolbox的限制，调试信息会输出到应用程序的文本框和一个单独的文件中。由于熵收集的限制，该实现被标记为可能不安全。"
  },
  {
    "id": "43665027",
    "title": "Trump administration overrode Social Security staff to list immigrants as dead",
    "url": "https://www.washingtonpost.com/politics/2025/04/12/trump-immigrants-dead-social-security/",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "特朗普政府推翻社保局员工意见，将移民列为死亡。",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "43656424",
    "title": "Maps with Django⁽³⁾: GeoDjango, Pillow and GPS",
    "url": "https://www.paulox.net/2025/04/11/maps-with-django-part-3-geodjango-pillow-and-gps/",
    "summary": "This article is the third part of a series about creating maps with Django, focusing on integrating images and GPS data. It guides the reader through building a web map using Django, GeoDjango, SpatiaLite, Leaflet, and Pillow. The goal is to create a map that displays markers, extracts GPS information from images, and associates images with specific locations.\n\nThe process begins with setting up a Django project with GeoDjango and SpatiaLite, then creating a \"markers\" app to manage map markers. The article demonstrates how to define a Marker model with location and name fields, and use the Django admin interface to add markers with a map widget. It covers generating database migrations and creating a superuser for accessing the admin.\n\nNext, the article details the steps to integrate a web map using Leaflet, including linking JavaScript and CSS modules in an HTML template. It shows how to create a custom JavaScript file to initialize an OpenStreetMap layer and display markers as GeoJSON. The article provides code snippets for creating a MapView class, defining URL patterns, and testing the populated map in a web browser. Finally, it explains the use of Pillow for image processing and extracting GPS information from images to automatically populate map markers.\n",
    "chinese_title": "使用Django的地图⁽³⁾：GeoDjango、Pillow和GPS",
    "chinese_summary": "本文是关于使用 Django 创建地图的系列文章的第三部分，重点介绍集成图像和 GPS 数据。 它指导读者使用 Django、GeoDjango、SpatiaLite、Leaflet 和 Pillow 构建一个 Web 地图。目标是创建一个地图，可以显示标记、从图像中提取 GPS 信息，并将图像与特定位置相关联。\n\n该过程首先设置一个包含 GeoDjango 和 SpatiaLite 的 Django 项目，然后创建一个“markers”应用程序来管理地图标记。 本文演示了如何定义一个包含位置和名称字段的 Marker 模型，并使用 Django 管理界面来添加带有地图小部件的标记。 它涵盖了生成数据库迁移和创建超级用户以访问管理界面。\n\n接下来，本文详细介绍了使用 Leaflet 集成 Web 地图的步骤，包括在 HTML 模板中链接 JavaScript 和 CSS 模块。 它展示了如何创建一个自定义 JavaScript 文件来初始化 OpenStreetMap 图层并将标记显示为 GeoJSON。 本文提供了用于创建 MapView 类、定义 URL 模式以及在 Web 浏览器中测试填充地图的代码片段。 最后，它解释了使用 Pillow 进行图像处理以及从图像中提取 GPS 信息以自动填充地图标记。"
  },
  {
    "id": "43660419",
    "title": "45-year mystery behind eerie photo from The Shining is believed to be solved",
    "url": "https://www.cbc.ca/lite/story/1.7507349",
    "summary": "After 45 years of speculation, the mystery behind the eerie photo in Stanley Kubrick's \"The Shining\" is believed to be solved. The photo, dated July 4, 1921, features Jack Nicholson's face superimposed on a figure in a crowd of partygoers. Retired academic Alasdair Spark and New York Times journalist Arik Tolar collaborated to uncover the man's identity and the photo's context.\n\nThe breakthrough came when a Reddit user used facial recognition to identify the man as Santos Casani, a famous ballroom dancer in 1920s London, whose real name was John Golman. Spark and Tolar confirmed the identification by matching scars on Casani's face to the figure in the photo, learning that Casani was an RAF veteran who had undergone facial reconstruction after a plane crash, explaining his unusual appearance.\n\nThe location of the photo had also remained a mystery. Initially believed to be from the Warner Brothers archive, photographer Murray Close revealed that he had sourced it from the BBC Hulton Photo Library, now part of Getty Images. The photo was taken at a Valentine's Day dance on February 14, 1921, in the Empress Ballroom at the Royal Palace Hotel in London. Spark expressed satisfaction in solving the long-standing mystery, identifying the man, the location, and the date of the photo.\n",
    "chinese_title": "《闪灵》诡异照片背后的45年谜团据信已解开",
    "chinese_summary": "《闪灵》诡异照片谜团终被破解，疑为45年后揭晓"
  },
  {
    "id": "43647880",
    "title": "The Story Behind “100 Go Mistakes and How to Avoid Them”",
    "url": "https://www.thecoder.cafe/p/100-go-mistakes",
    "summary": "Teiva Harsanyi recounts the journey of writing his book, \"100 Go Mistakes and How to Avoid Them,\" starting in 2018. Initially working with Scala and Akka, he discovered Go and quickly realized its potential. After landing a Go job, he wrote a blog post, \"The Top 10 Most Common Mistakes I've Seen in Go Projects,\" which unexpectedly went viral, inspiring him to expand the concept into a book.\n\nIn November 2020, with 100 mistakes collected, he contacted Manning, a publisher known for its rigorous review process. He emphasizes the value of working with a publisher for the extensive review system and increased visibility, despite a relatively low royalty rate (10%).\n\nThe writing process involved refining the Minimum Qualified Reader (MQR) profile, working closely with a development editor (DE) who significantly improved his writing style, and undergoing multiple rounds of external reviews. Harsanyi aimed to create the best possible Go book, dedicating himself to addressing feedback and improving the content. He received invaluable advice from Bill Kennedy to address even minor comments.\n\nHe mentions a hiccup with his Technical Development Editor (TDE), who didn't meet the minimum Go knowledge level, hindering their ability to provide useful technical guidance. Despite this, he continued to work through the MEAP (Manning Early Access Program) and incorporated reviewer feedback.\n",
    "chinese_title": "《“100个Go语言常见错误”及其规避方法背后的故事》",
    "chinese_summary": "泰瓦·哈尔萨尼讲述了他从2018年开始创作《围棋百错及如何避免》一书的历程。最初使用Scala和Akka，他发现了Go语言，并迅速意识到它的潜力。在获得一份Go语言工作后，他写了一篇博客文章《我在Go项目中见过的最常见的十大错误》，出乎意料地走红，这启发他将这个概念扩展成一本书。\n\n2020年11月，在收集了100个错误后，他联系了Manning出版社，这家出版社以其严格的审查流程而闻名。他强调了与出版社合作的价值，因为他们有广泛的审查系统和更高的知名度，尽管版税相对较低（10%）。\n\n写作过程包括完善最低合格读者 (MQR) 档案，与一位开发编辑 (DE) 密切合作，这位编辑极大地改进了他的写作风格，并经历了多轮外部审查。哈尔萨尼的目标是创作出最好的Go语言书籍，他致力于解决反馈并改进内容。他从Bill Kennedy那里获得了宝贵的建议，甚至处理了细微的评论。\n\n他提到了一段与他的技术开发编辑 (TDE) 之间的小插曲，这位编辑没有达到最低Go语言知识水平，阻碍了他们提供有用的技术指导。尽管如此，他继续通过MEAP（Manning Early Access Program）工作，并纳入了评论者的反馈。"
  },
  {
    "id": "43627300",
    "title": "Titanic digital scan reveals new details of ship's final hours",
    "url": "https://www.bbc.com/news/articles/cwy6gjwd0g6o",
    "summary": "A comprehensive digital scan of the Titanic wreck has unveiled unprecedented details about the ship's final hours, providing new insights into the disaster. The 3D replica, created from over 700,000 images taken by underwater robots, reveals the violence of the ship's breakup and the damage inflicted by the iceberg.\n\nKey findings include confirmation of eyewitness accounts that engineers worked until the end to maintain power, signified by concave boilers and an open steam valve on the stern. This highlights the heroism of engineers like Joseph Bell, who kept the lights on to aid in lifeboat deployment.\n\nThe scan also revealed a smashed porthole, corroborating survivor stories of ice entering cabins during the collision. Furthermore, a computer simulation based on the Titanic's blueprints suggests the ship's demise was caused by a series of small punctures, the size of A4 paper, spread across six compartments. These small holes ultimately led to the flooding and sinking, despite the ship's design to withstand flooding in four compartments.\n\nThe digital scan, described as a \"crime scene\" for analysis, is providing a more complete view of the wreck than previously possible with submersible explorations. While it will take years to fully analyze the 3D replica, it continues to offer new clues and details about the tragic sinking of the Titanic.\n",
    "chinese_title": "泰坦尼克号数字扫描揭示沉没前新细节",
    "chinese_summary": "泰坦尼克号残骸全面数字扫描揭示了关于该船最后时刻前所未有的细节，为这场灾难提供了新的见解。这个3D复制品由水下机器人拍摄的70多万张图像创建，揭示了该船解体的剧烈程度以及冰山造成的破坏。\n\n主要发现包括证实了目击者的描述，即工程师们工作到最后一刻以维持电力，这由凹陷的锅炉和船尾上打开的蒸汽阀门所表明。这突显了约瑟夫·贝尔等工程师的英雄主义，他们保持照明以帮助救生艇的部署。\n\n扫描还显示了一个破碎的舷窗，证实了幸存者关于冰在碰撞过程中进入船舱的故事。此外，基于泰坦尼克号蓝图的计算机模拟表明，该船的沉没是由一系列分布在六个舱室中的、A4纸大小的小穿孔造成的。尽管该船的设计能够承受四个舱室的洪水，但这些小孔最终导致了洪水和沉没。\n\n该数字扫描被描述为用于分析的“犯罪现场”，它提供的残骸全貌比以往潜水器探索所能提供的更为完整。虽然需要数年时间才能完全分析这个3D复制品，但它仍在不断提供关于泰坦尼克号悲剧沉没的新线索和细节。"
  },
  {
    "id": "43646920",
    "title": "How a $2k 'Made in the USA' Phone Is Manufactured",
    "url": "https://www.404media.co/how-a-2-000-made-in-the-usa-liberty-phone-phone-is-manufactured/",
    "summary": "This article discusses the challenges and realities of manufacturing a smartphone in the USA, focusing on Purism's Liberty Phone, a $2,000 \"Made in the USA\" alternative to their China-made Librem 5 ($800). Founder Todd Weaver explains Purism's commitment to US manufacturing for security, transparency, and control over the supply chain.\n\nThe Liberty Phone is manufactured in Purism's California facility, going from bare circuit boards to finished goods by soldering components. This qualifies it as \"manufactured\" in the USA according to the FTC, as opposed to merely \"assembled.\" While Purism aims to source components from US or Western distributors/manufacturers whenever possible, raw materials and specific components (like certain crystals) still often originate outside the US due to availability and cost.\n\nWeaver acknowledges that replicating the efficiency and expertise of Chinese manufacturing is a massive undertaking, requiring significant investment and time. While advanced chips *can* be manufactured in the US, the complete process of incorporating them into a phone with all other components is currently concentrated in China. Despite these hurdles, Purism provides transparency about their sourcing, publishing schematics, hardware bills of materials, and source code. The article highlights the complexities of US manufacturing and the trade-offs between cost, performance, and country of origin.\n",
    "chinese_title": "一台2000美元“美国制造”的手机是如何生产的",
    "chinese_summary": "本文探讨了在美国制造智能手机的挑战与现实，重点关注Purism的Liberty Phone，这款售价2000美元的“美国制造”产品，是其中国制造的Librem 5（800美元）的替代品。创始人Todd Weaver解释了Purism致力于在美国制造的原因，包括安全性、透明度以及对供应链的控制。\n\nLiberty Phone在Purism位于加利福尼亚州的工厂生产，通过焊接元件将裸电路板制成成品。这符合美国联邦贸易委员会对“美国制造”的定义，而不是仅仅“组装”。虽然Purism的目标是尽可能从美国或西方分销商/制造商处采购元件，但由于供货和成本原因，原材料和特定元件（如某些晶体）仍然经常来自美国境外。\n\nWeaver承认，复制中国制造业的效率和专业知识是一项艰巨的任务，需要大量的投资和时间。虽然先进的芯片*可以*在美国制造，但将它们与所有其他元件整合到手机中的完整流程目前集中在中国。尽管存在这些障碍，Purism对其采购保持透明，公布原理图、硬件物料清单和源代码。本文强调了美国制造业的复杂性以及成本、性能和原产地之间的权衡。"
  },
  {
    "id": "43661763",
    "title": "Why Your 'Harmonious' Team Is Failing",
    "url": "https://terriblesoftware.org/2025/03/12/why-your-harmonious-team-is-actually-failing/",
    "summary": "This article argues that a seemingly \"harmonious\" team, where conflict is avoided, is often a failing team. It challenges the misconception that psychological safety equates to the absence of disagreement. True psychological safety, as defined by Amy Edmondson, is about fostering an environment where individuals feel comfortable raising concerns, challenging ideas, and admitting mistakes without fear of punishment or humiliation.\n\nThe author highlights the benefits of productive disagreement, including early issue identification, thorough debate of ideas, a focus on problem-solving rather than personal attacks, and using mistakes as learning opportunities. Conversely, \"nice\" teams, which avoid conflict, often produce mediocre work due to a lack of honest communication and critical thinking. Disagreements are suppressed, leading to poor decision-making and unresolved issues.\n\nThe article provides practical tips for engineering managers to cultivate a psychologically safe environment that encourages constructive conflict: showing vulnerability, setting ground rules for debates (focus on the idea, not the person), and celebrating those who raise challenging questions. By addressing disagreements openly and respectfully, teams can prevent them from escalating into resentment and passive-aggressive behavior, ultimately leading to better code, improved ideas, and a stronger, more resilient team.\n",
    "chinese_title": "你的“和谐”团队为何失败",
    "chinese_summary": "本文认为，表面上“和谐”的团队，往往因回避冲突而走向失败。它挑战了一种误解，即心理安全等同于没有分歧。正如Amy Edmondson所定义的，真正的心理安全是营造一种环境，让个人能够放心地提出顾虑、挑战观点和承认错误，而不必担心受到惩罚或羞辱。\n\n作者强调了富有成效的分歧带来的好处，包括及早发现问题、充分辩论观点、专注于解决问题而不是人身攻击，以及将错误视为学习机会。相反，回避冲突的“友善”团队，往往由于缺乏诚实的沟通和批判性思维而产生平庸的工作。分歧被压制，导致决策失误和问题悬而未决。\n\n文章为工程经理们提供了实用技巧，以培养鼓励建设性冲突的心理安全环境：展现脆弱性、为辩论设定基本规则（关注观点，而不是人），并赞扬那些提出挑战性问题的人。通过公开且尊重地处理分歧，团队可以防止分歧升级为怨恨和消极攻击行为，最终带来更好的代码、更完善的想法以及更强大、更具韧性的团队。"
  },
  {
    "id": "43621926",
    "title": "An unused nuclear power plant became home to a world-class acoustics lab",
    "url": "https://www.theverge.com/tech/644385/nuclear-power-plant-acoustics-lab",
    "summary": "Allison Johnson's article explores how an abandoned nuclear power plant in Satsop Business Park, Washington, has been transformed into a world-class acoustics lab, NWAA Labs, run by Ron and Bonnie Sauro. Facing budget issues and waning enthusiasm, the WNP-3 nuclear power plant was never completed, eventually becoming part of the Satsop Business Park.\n\nRon Sauro, a former NASA scientist, saw the potential of the massive concrete structure, particularly the auxiliary reactor building with its thick walls, for creating a controlled sound environment. The location's remoteness and the building's inherent temperature stability provide ideal conditions for acoustic testing. NWAA Labs measures soundproofing and noise levels for various products, adhering to strict ANSI and ISO standards.\n\nThe lab features reverberation chambers for testing sound transmission loss, including a unique \"floating room-within-a-room\" known as the quietest non-anechoic room in the world. They also utilize a free field speaker testing rig in the turbine building, adapting to challenges like a leaky roof. Sauro highlights the resourcefulness required to operate the lab, acting as a carpenter, plumber, and more. The facility's unique characteristics, like the inability to easily modify the reactor housing, present both challenges and benefits, allowing the lab to thrive in an unconventional space.\n",
    "chinese_title": "废弃核电站变身世界一流声学实验室",
    "chinese_summary": "艾莉森·约翰逊的文章探讨了华盛顿州萨特索普商业园的一座废弃核电站如何被改造成世界级的声学实验室——NWAA实验室，由罗恩·索罗和邦妮·索罗运营。由于预算问题和热情消退，WNP-3核电站从未完工，最终成为萨特索普商业园的一部分。\n\n前NASA科学家罗恩·索罗看到了这座巨大混凝土结构的潜力，特别是辅助反应堆大楼及其厚实的墙壁，可以用来创造一个可控的声音环境。该地点偏远以及建筑固有的温度稳定性为声学测试提供了理想的条件。NWAA实验室测量各种产品的隔音效果和噪声水平，并遵守严格的ANSI和ISO标准。\n\n该实验室设有混响室，用于测试声音传输损耗，其中包括一个独特的“室中室”，被称为世界上最安静的非消音室。他们还在涡轮机大楼里利用自由场扬声器测试装置，应对漏水屋顶等挑战。索罗强调了运营该实验室所需的足智多谋，身兼木匠、水管工等多种角色。该设施的独特特性，例如无法轻易修改反应堆外壳，既带来了挑战也带来了好处，使实验室能够在非常规的空间中蓬勃发展。"
  },
  {
    "id": "43652476",
    "title": "We Chose Tauri over Electron for Our Performance-Critical Desktop App",
    "url": "https://gethopp.app/blog/tauri-vs-electron",
    "summary": "Costa Alexoglou's article compares Tauri and Electron, two popular frameworks for building cross-platform desktop applications, focusing on their differences, trade-offs, and why the Hopp team chose Tauri for their low-latency remote pair programming application.\n\nThe article highlights that Electron uses Node.js for its main process and Chromium for rendering, leading to larger app sizes due to bundling the Node.js runtime and the full Chromium engine. Tauri, on the other hand, utilizes Rust for the backend, compiling to a native binary, and relies on the operating system's native WebView component for UI rendering, resulting in smaller app bundles and lower memory usage. However, this can lead to UI inconsistencies across platforms due to variations in WebView implementations.\n\nA benchmark comparing simple apps built with each framework showed Tauri had significantly smaller bundle size and lower memory usage, although initial build times were slower due to Rust compilation. Startup times were negligible.\n\nHopp chose Tauri because its Rust-based backend offers better performance for intensive tasks like video streaming using WebRTC, and Tauri's built-in \"Sidecar\" feature simplifies managing a separate process for screen streaming and remote control input. The article concludes that the best choice between Tauri and Electron depends on specific project requirements, team expertise, and use case, with both frameworks capable of building powerful desktop applications.\n",
    "chinese_title": "我们选择了Tauri而非Electron来开发对性能要求严苛的桌面应用",
    "chinese_summary": "科斯塔·阿莱克斯格卢的文章比较了Tauri和Electron，这两种流行的跨平台桌面应用程序构建框架，重点介绍了它们的差异、权衡以及Hopp团队为何选择Tauri来构建其低延迟远程结对编程应用程序。\n\n文章强调，Electron使用Node.js作为其主进程，并使用Chromium进行渲染，由于捆绑了Node.js运行时和完整的Chromium引擎，导致应用程序体积较大。另一方面，Tauri使用Rust作为后端，编译成原生二进制文件，并依赖操作系统的原生WebView组件进行UI渲染，从而减小了应用程序包的大小并降低了内存使用率。然而，由于WebView实现的差异，这可能会导致跨平台的UI不一致。\n\n一项比较使用每个框架构建的简单应用程序的基准测试表明，Tauri的捆绑包大小和内存使用率明显更低，尽管由于Rust编译，初始构建时间较慢。启动时间可以忽略不计。\n\nHopp选择Tauri是因为其基于Rust的后端为使用WebRTC进行视频流传输等密集型任务提供了更好的性能，并且Tauri内置的“Sidecar”功能简化了对屏幕流传输和远程控制输入的单独进程的管理。文章总结说，Tauri和Electron之间的最佳选择取决于具体的项目需求、团队专业知识和用例，这两种框架都能够构建强大的桌面应用程序。"
  },
  {
    "id": "43658420",
    "title": "Key principles on in-game virtual currencies in the EU",
    "url": "https://tiendil.org/en/posts/eu-key-principles-on-in-game-virtual-currencies",
    "summary": "This article discusses the European Commission's recommendations for regulating in-game virtual currencies and their potential impact on free-to-play (F2P) games. The author outlines the key principles, including recognizing in-game currency as real-world money, protecting consumer rights in transactions, prohibiting exploitative practices, displaying real-world currency prices alongside virtual currency, discouraging complex currency systems, and offering transaction cancellation rights.\n\nThe author anticipates challenges in implementing these regulations, especially for small and medium businesses. Developers may face the decision of adapting their games for the EU market (potentially reducing income) or avoiding it altogether. The shift to more ethical monetization models could necessitate retraining game designers and rethinking interfaces.\n\nThe article highlights technical challenges, such as implementing reliable transaction logs, especially for games with client-side logic. It also suggests necessary implementations like smart refunds and parental controls.\n\nThe author speculates on the regulation's potential outcomes: a shift towards buy-to-play or subscription models, or the exit of aggressively monetized F2P games from the EU market. However, they express skepticism about its effectiveness, drawing parallels to GDPR. They predict developers will find loopholes by slightly adapting their games and employing clever game design tactics to circumvent the rules, such as selling resources or collectibles indirectly linked to in-game currency.\n",
    "chinese_title": "欧盟游戏内虚拟货币的关键原则",
    "chinese_summary": "本文探讨了欧盟委员会关于监管游戏内虚拟货币的建议及其对免费游戏（F2P）的潜在影响。作者概述了关键原则，包括将游戏内货币视为现实货币、保护交易中的消费者权益、禁止剥削性行为、同时显示现实货币价格和虚拟货币价格、不鼓励复杂的货币系统以及提供交易取消权。\n\n作者预计实施这些法规会面临挑战，特别是对于中小型企业。开发者可能面临为欧盟市场调整游戏（可能减少收入）或完全避免该市场的抉择。转向更合乎道德的盈利模式可能需要重新培训游戏设计师并重新思考界面。\n\n文章强调了技术挑战，例如实施可靠的交易日志，特别是对于具有客户端逻辑的游戏。它还建议必要的实施，如智能退款和家长控制。\n\n作者推测了该法规的潜在结果：转向买断制或订阅模式，或者过度盈利的免费游戏退出欧盟市场。然而，他们对它的有效性表示怀疑，并将它与GDPR进行了比较。他们预测开发者会通过稍微调整他们的游戏并采用巧妙的游戏设计策略来规避规则，例如销售与游戏内货币间接相关的资源或收藏品，从而找到漏洞。"
  },
  {
    "id": "43663880",
    "title": "Charts.css",
    "url": "https://chartscss.org/",
    "summary": "Charts.css is a modern CSS framework that allows developers to create various charts using only CSS utility classes and HTML. It boasts features like semantic structure, customizability via CSS, responsiveness, accessibility, and zero JavaScript dependencies. The framework supports a wide range of chart types, including area, bar, column, line, pie, and donut charts, with multi-dataset, percentage, stacked, and 3D variations also available.\n\nThe framework is lightweight, with a gzipped file size of only 7kb, leading to better performance due to the absence of JavaScript rendering. Being open-source under the MIT license, it's freely modifiable.\n\nThe project is developed by Rami Yushuvaev, a developer, and designed by Lana Gordiievska. The source code is available on GitHub, where users are encouraged to star the repository.\n",
    "chinese_title": "Charts.css",
    "chinese_summary": "Charts.css 是一个现代 CSS 框架，它允许开发者仅使用 CSS 实用类和 HTML 创建各种图表。它拥有语义结构、通过 CSS 的可定制性、响应式、可访问性以及零 JavaScript 依赖等特性。该框架支持广泛的图表类型，包括面积图、条形图、柱状图、折线图、饼图和甜甜圈图，并提供多数据集、百分比、堆叠和 3D 变体。\n\n该框架轻量级，gzip 压缩后文件大小仅为 7kb，由于无需 JavaScript 渲染，因此性能更佳。它在 MIT 许可下开源，可以自由修改。\n\n该项目由开发者 Rami Yushuvaev 开发，由 Lana Gordiievska 设计。源代码可在 GitHub 上找到，欢迎用户为该存储库点亮星星。"
  },
  {
    "id": "43659876",
    "title": "Dev Tools Honeytrap: Why We Can't Stop Building Tools Nobody Buys",
    "url": "https://substack.com/home/post/p-161145826",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "开发者工具蜜罐：为何我们总在构建无人问津的工具",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "43616649",
    "title": "A surprising enum size optimization in the Rust compiler",
    "url": "https://jpfennell.com/posts/enum-type-size/",
    "summary": "This article by James Fennell explores a surprising enum size optimization in the Rust compiler, going beyond the well-known \"niche optimization.\"  The article first explains how enums are typically represented in memory: a tag indicating the variant, followed by the variant's payload. For `Foo { Int(u32), Char(char) }`, this results in 8 bytes (4 for the tag, 4 for the payload).\n\nThe niche optimization is then explained, using `Option<char>` as an example. Because not all bit patterns are valid `char` values, Rust uses an invalid pattern (a \"niche\") to represent `None`, thus avoiding an explicit tag and reducing the size to 4 bytes.\n\nThe surprising optimization comes into play with nested enums. Consider `Inner { A(u32), B(u32) }` and `Outer { C(u32), D(Inner) }`. One would expect `Outer` to be 12 bytes (8 for `Inner`, 4 for the tag). However, Rust optimizes `Outer` to 8 bytes by cleverly reusing the tag space of `Inner`.\n\nThe key insight is that the tag in `Inner` only uses values 0 and 1. The compiler assigns a tag to `Outer::C` (e.g., 2). Then, for `Outer::D(inner)`, it simply uses the memory representation of `inner` directly.  This works because the \"Outer tag\" effectively repurposes the \"Inner tag\" space when representing `Outer::D`. The remaining variants of `Outer` have payloads that fit within the payload space of `Inner`. This effectively encodes the `Outer` variant within the `Inner` tag and payload, saving space.\n",
    "chinese_title": "Rust 编译器中一个令人惊讶的枚举大小优化",
    "chinese_summary": "Rust编译器中一种令人惊讶的枚举大小优化"
  },
  {
    "id": "43650792",
    "title": "Deno Under TinyKVM in Varnish",
    "url": "https://info.varnish-software.com/blog/tinykvm-in-varnish-and-some-deno",
    "summary": "This article introduces TinyKVM, a high-performance sandbox environment, and its potential as a compute framework within Varnish Cache. The core concept is enabling arbitrary code execution for request processing directly within Varnish, offering benefits like direct cache access and data processing capabilities.\n\nThe authors highlight TinyKVM's architecture, emphasizing its low-overhead request handling, including per-request isolation through ephemeral VMs. This allows for clean execution environments, resetting after each request, beneficial for memory-intensive tasks like garbage collection in languages like JavaScript.\n\nLaurence Rowe discusses embedding the Deno JavaScript runtime in TinyKVM, demonstrating its potential for server-side rendering with per-request isolation. Benchmarks show promising results, achieving significantly lower latency compared to existing solutions like V8 isolates or process forking. The Deno implementation benefits from static linking and a new \"wait_for_requests_paused\" API for synchronous calls.\n\nThe article also mentions a GBC emulator example showcasing shared mutable storage achieved through lightweight forks and function calls to a dedicated storage VM. Performance improvements through hugepages are also highlighted, boosting Deno performance without code modification.\n\nUltimately, the authors demonstrate TinyKVM's ability to deliver high-performance sandboxing and per-request isolation (averaging 14us for a tiny program), opening doors for efficient data processing within Varnish Cache. They emphasize the ongoing development and available language APIs (C, C++, Go, Javascript, Rust, Zig, etc.), inviting contributions to expand its capabilities.\n",
    "chinese_title": "在 Varnish 中使用 TinyKVM 运行 Deno",
    "chinese_summary": "本文介绍了高性能沙箱环境TinyKVM，及其作为Varnish Cache中计算框架的潜力。核心概念是在Varnish中直接启用任意代码执行以进行请求处理，从而提供诸如直接缓存访问和数据处理能力等优势。\n\n作者重点介绍了TinyKVM的架构，强调其低开销的请求处理，包括通过临时VM实现的每个请求隔离。这允许干净的执行环境，每次请求后重置，有利于诸如JavaScript等语言中垃圾收集等内存密集型任务。\n\nLaurence Rowe讨论了将Deno JavaScript运行时嵌入TinyKVM，展示了其利用每个请求隔离进行服务器端渲染的潜力。基准测试显示了令人鼓舞的结果，与现有的解决方案（如V8 isolates或进程forking）相比，延迟显著降低。Deno的实现受益于静态链接和一个新的“wait_for_requests_paused”API，用于同步调用。\n\n文章还提到了一个GBC模拟器示例，展示了通过轻量级fork和对专用存储VM的函数调用实现的共享可变存储。还强调了通过hugepages提高性能，无需修改代码即可提升Deno性能。\n\n最终，作者证明了TinyKVM提供高性能沙箱和每个请求隔离的能力（一个微小程序的平均时间为14us），为Varnish Cache内的高效数据处理打开了大门。他们强调正在进行的开发和可用的语言API（C、C++、Go、Javascript、Rust、Zig等），并邀请贡献以扩展其功能。"
  },
  {
    "id": "43620676",
    "title": "Remember FastCGI? (2021)",
    "url": "https://brokenco.de/2021/06/27/remember-fastcgi.html",
    "summary": "This article revisits FastCGI, a protocol that allows longer-lived processes to serve multiple web requests, positioning it between CGI and modern \"serverless\" functions. While still used in the PHP community, it has largely fallen out of favor. The author explores its utility in Rust, using the `fastcgi` crate to create a simple FastCGI server.\n\nThe author then compares the FastCGI implementation to a functionally identical program built with the Tide web framework in Rust. The key takeaway is that setting up FastCGI involves process management and web server configuration (using Nginx in the example), which raises the question of whether it's more efficient than running an embedded web server directly.\n\nThe Tide example highlights the simplicity of modern web frameworks, allowing direct testing without needing an external web server. The Nginx configuration for Tide is also similar to the FastCGI setup.\n\nThe author concludes that FastCGI might still be useful in scenarios where scripting languages are too slow or unsafe for processing HTTP requests. However, for most use cases, modern HTTP web servers are a simpler and more practical solution. The rise of frameworks like Tide that allow for easily embedding a server and handling routing directly has made FastCGI a less compelling option.\n",
    "chinese_title": "还记得FastCGI吗？ (2021)",
    "chinese_summary": "本文回顾了 FastCGI 协议，该协议允许长时间运行的进程处理多个 Web 请求，其定位介于 CGI 和现代“无服务器”函数之间。尽管它仍在 PHP 社区中使用，但已基本不再流行。作者探讨了它在 Rust 中的实用性，使用 `fastcgi` crate 创建了一个简单的 FastCGI 服务器。\n\n然后，作者将 FastCGI 实现与使用 Rust 中的 Tide Web 框架构建的功能相同的程序进行了比较。 主要的结论是，设置 FastCGI 涉及进程管理和 Web 服务器配置（在示例中使用 Nginx），这引发了一个问题，即它是否比直接运行嵌入式 Web 服务器更有效。\n\nTide 示例突出了现代 Web 框架的简单性，允许直接测试而无需外部 Web 服务器。 用于 Tide 的 Nginx 配置也与 FastCGI 设置类似。\n\n作者的结论是，FastCGI 在脚本语言对于处理 HTTP 请求而言速度太慢或不安全的情况下可能仍然有用。 然而，对于大多数用例而言，现代 HTTP Web 服务器是一种更简单且更实用的解决方案。 像 Tide 这样允许轻松嵌入服务器并直接处理路由的框架的兴起，使得 FastCGI 成为一个不太引人注目的选择。"
  },
  {
    "id": "43653251",
    "title": "Show HN: Building better base images",
    "url": "https://github.com/avkcode/container-tools",
    "summary": "Container Tools is a project aimed at building optimized, minimal Debian-based container images to address common Dockerfile inefficiencies like storage bloat, network redundancy, and slow rebuild times. It leverages `debootstrap` to create custom root filesystems with only necessary components.\n\nThe tool allows users to build a variety of Debian images (e.g., Debian 11, Debian 11 with Java, Kafka, GraalVM, etc.) using simple `make` commands. It produces a `.tar` archive of the root filesystem that can be imported directly into Docker. Benefits include reduced image size and faster build times.\n\nThe project is designed to be extensible. Users can add new image variations by creating recipes (installation scripts for specific software like Java or Kafka) and defining new targets in the Makefile. These recipes specify download URLs and checksums for components. A security scan script is also integrated for post-build vulnerability assessment.\n\nThe repository is organized with separate directories for Debian configuration files, GPG keys, recipes (including Java and Kafka), and post-build scripts. The `dist/` directory contains the output images, and a temporary `download/` directory stores downloaded packages during the build process. This approach facilitates clean, efficient, and secure container image creation.\n",
    "chinese_title": "Show HN: 构建更好的基础镜像",
    "chinese_summary": "容器工具旨在构建优化的、最小化的基于Debian的容器镜像，以解决常见的Dockerfile效率低下问题，如存储膨胀、网络冗余和重建速度慢。它利用`debootstrap`创建只包含必要组件的自定义根文件系统。\n\n该工具允许用户使用简单的`make`命令构建各种Debian镜像（例如，Debian 11、带有Java的Debian 11、Kafka、GraalVM等）。它生成根文件系统的`.tar`归档文件，可以直接导入Docker。优点包括减小镜像大小和加快构建速度。\n\n该项目被设计为可扩展的。用户可以通过创建配方（针对特定软件如Java或Kafka的安装脚本）并在Makefile中定义新目标来添加新的镜像变体。这些配方指定组件的下载URL和校验和。还集成了安全扫描脚本，用于构建后的漏洞评估。\n\n该存储库的组织方式是将Debian配置文件、GPG密钥、配方（包括Java和Kafka）以及构建后脚本分别放置在单独的目录中。`dist/`目录包含输出镜像，而临时`download/`目录在构建过程中存储下载的软件包。这种方法有助于创建干净、高效和安全的容器镜像。"
  },
  {
    "id": "43660617",
    "title": "Splash-free urinals: Design through physics and differential equations",
    "url": "https://academic.oup.com/pnasnexus/article/4/4/pgaf087/8098745?login=false",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "无溅尿池：基于物理学和微分方程的设计",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "43641958",
    "title": "Procedural Generation of Mammals and Locomotion",
    "url": "https://blog.runevision.com/2025/01/procedural-creature-progress-2021-2024.html",
    "summary": "This article details a game developer's progress from 2021 to 2024 on procedurally generating and animating realistic quadruped mammals for the game \"The Big Forest.\" The goal is to create diverse forest creatures with plausible anatomy using a manageable set of parameters that always result in valid creatures.\n\nThe developer initially used simple extruded rectangles to represent creature body parts, controlled by a vast number of low-level parameters extracted from skinned reference meshes. This approach allowed the creation of different creatures and interpolation between them, but the parameters were too granular and difficult to control.\n\nAttempts to automatically identify meaningful parameters using Principal Component Analysis (PCA) failed, as the resulting parameters influenced too many traits simultaneously, making them unhelpful for intuitive creature design. The developer concluded that manual parametrization was necessary.\n\nThe focus then shifted to manually defining high-level parameters that control the low-level parameters. A tool was created to visualize correlations between parameters to aid in this process. A significant challenge was the accurate placement of joints, which required anatomical study and dealing with inconsistent rigging in reference models.\n\nTo speed up the creation of example creatures, a Gradient Descent-based tool was developed to automatically adjust creature parameters to match the silhouettes of reference models. This tool uses Signed Distance Fields (SDFs) to compare silhouettes and iteratively optimize the creature's shape. By the end of the period covered in the article, the author had established 106 high-level parameters that controled all the 503 low-level parameters.\n",
    "chinese_title": "哺乳动物程序化生成与运动",
    "chinese_summary": "本文详细介绍了游戏开发者从2021年至2024年，为游戏《大森林》程序化生成并动画制作逼真四足哺乳动物的进展。目标是使用一套可控的参数，创建具有合理解剖结构且始终有效的多样化森林生物。\n\n开发者最初使用简单的拉伸矩形来表示生物的身体部位，这些矩形由从蒙皮参考网格中提取的大量底层参数控制。这种方法允许创建不同的生物并在它们之间进行插值，但这些参数过于细化且难以控制。\n\n尝试使用主成分分析（PCA）自动识别有意义的参数失败了，因为由此产生的参数同时影响了太多的特征，使其不利于直观的生物设计。开发者得出结论，手动参数化是必要的。\n\n随后，重点转向手动定义控制底层参数的高级参数。创建了一个工具来可视化参数之间的相关性，以帮助完成这个过程。一个重要的挑战是关节的准确定位，这需要解剖学研究以及处理参考模型中不一致的绑定。\n\n为了加快示例生物的创建速度，开发了一个基于梯度下降的工具，以自动调整生物参数来匹配参考模型的轮廓。该工具使用有符号距离场（SDF）来比较轮廓并迭代优化生物的形状。到本文所述期间结束时，作者已经建立了106个控制所有503个底层参数的高级参数。"
  },
  {
    "id": "43649088",
    "title": "Systemd ParticleOS",
    "url": "https://github.com/systemd/particleos",
    "summary": "ParticleOS is a fully customizable immutable Linux distribution built using mkosi. Unlike other immutable distributions, users build the ParticleOS image themselves, signing it with their own keys, providing full control over the base distribution and installed packages. Supported distributions include Arch and Fedora.\n\nUpdates are performed by cloning the ParticleOS repository, configuring `mkosi.local.conf`, and running `mkosi -ff sysupdate`. The OBS profile is recommended for accessing daily builds of systemd from its git main branch. Alternatively, users can build systemd from source, integrating it into ParticleOS by specifying the build artifacts in `mkosi.local.conf`.\n\nSecure Boot is enabled by signing images with user-generated keys (created using `mkosi genkey`), which can be stored on smartcards. Installation involves burning the built image to a USB drive and using `systemd-repart` to install ParticleOS onto the target drive. Secure Boot must be in setup mode during installation.\n\nFor LUKS encrypted partitions, a recovery password can be added using `cryptenroll`. To improve performance, systemd-homed should be configured after installation to disable auto-resize, enable LUKS discard, and set BTRFS mount options.\n\nFinally, when running ParticleOS in a virtual machine using `mkosi vm`, a default root password and user are automatically created for convenience.\n",
    "chinese_title": "Systemd ParticleOS:\n\nParticleOS 系统管理器",
    "chinese_summary": "ParticleOS是使用mkosi构建的完全可定制的不可变Linux发行版。与其他不可变发行版不同，用户自行构建ParticleOS镜像，并使用自己的密钥对其进行签名，从而完全控制基础发行版和已安装的软件包。支持的发行版包括Arch和Fedora。\n\n更新通过克隆ParticleOS仓库、配置`mkosi.local.conf`并运行`mkosi -ff sysupdate`来执行。建议使用OBS profile来访问systemd从其git main分支的每日构建版本。或者，用户可以从源代码构建systemd，并通过在`mkosi.local.conf`中指定构建产物将其集成到ParticleOS中。\n\n通过使用用户生成的密钥（使用`mkosi genkey`创建）对镜像进行签名来启用安全启动，这些密钥可以存储在智能卡上。安装过程包括将构建的镜像刻录到USB驱动器，并使用`systemd-repart`将ParticleOS安装到目标驱动器。安全启动在安装期间必须处于设置模式。\n\n对于LUKS加密分区，可以使用`cryptenroll`添加恢复密码。为了提高性能，应在安装后配置systemd-homed以禁用自动调整大小、启用LUKS discard并设置BTRFS挂载选项。\n\n最后，当使用`mkosi vm`在虚拟机中运行ParticleOS时，为了方便起见，会自动创建一个默认的root密码和用户。"
  },
  {
    "id": "43645183",
    "title": "SDL2 for macOS 9 “rough draft”",
    "url": "https://macintoshgarden.org/apps/sdl2-macos-9-rough-draft",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "macOS 9 上的 SDL2“粗略草稿”",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "43657747",
    "title": "Generative AI in Servo",
    "url": "https://www.azabani.com/2025/04/11/generative-ai-in-servo.html",
    "summary": "This article argues against the use of generative AI tools like GitHub Copilot in the Servo browser project. The author, a key contributor to Servo, expresses disappointment in recent TSC votes that relaxed the ban on AI contributions, viewing them as a mistake made without proper community consultation.\n\nThe central argument is that the downsides of generative AI, such as generating inaccurate or misleading content, increasing maintainer burden, potential legal issues, and ethical concerns outweigh any perceived benefits within the context of Servo's development. The author emphasizes the community's overwhelming consensus against these tools, highlighting concerns about project health, contribution quality, and the signal it sends to the broader AI movement.\n\nWhile advocating for a firm stance against tools like Copilot, the author acknowledges potential exceptions for specific tools used for narrow purposes, such as speech recognition and machine translation, with careful consideration and community-driven evaluation. Any allowance would require clearly defined use cases, concrete examples, and a thorough assessment of the tool's effectiveness and potential risks.\n\nThe author also reflects on governance issues within the TSC, noting a lack of consistent structure for community consultation and decision-making processes, suggesting a public RFC process would be beneficial. The author calls for the TSC to reaffirm its commitment to keeping generative AI out of Servo and to rebuild trust with the community.\n",
    "chinese_title": "Servo 中的生成式 AI",
    "chinese_summary": "本文反对在 Servo 浏览器项目中使用 GitHub Copilot 等生成式 AI 工具。作者作为 Servo 的主要贡献者，对最近 TSC 投票放宽对 AI 贡献的禁令表示失望，认为这是一个未经适当社区协商而犯的错误。\n\n核心论点是，生成式 AI 的缺点，例如生成不准确或误导性内容、增加维护者负担、潜在的法律问题和伦理问题，超过了在 Servo 开发中任何被认为的益处。作者强调社区对这些工具的压倒性共识是反对的，并强调了对项目健康、贡献质量以及向更广泛的 AI 运动发出的信号的担忧。\n\n在主张对 Copilot 等工具采取坚定立场的同时，作者承认对用于狭隘目的的特定工具，例如语音识别和机器翻译，可能存在例外情况，但需要仔细考虑和社区驱动的评估。任何允许都将需要明确定义的用例、具体示例以及对工具的有效性和潜在风险的全面评估。\n\n作者还反思了 TSC 内部的治理问题，指出社区协商和决策过程缺乏一致的结构，并建议公开 RFC 流程将是有益的。作者呼吁 TSC 重申其致力于将生成式 AI 排除在 Servo 之外，并重建与社区的信任。"
  },
  {
    "id": "43654971",
    "title": "Evelyn Waugh’s Decadent Redemption",
    "url": "https://libertiesjournal.com/online-articles/evelyn-waughs-decadent-redemption/",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "伊夫林·沃的颓废救赎",
    "chinese_summary": "无法访问文章链接。"
  }
]