[
  {
    "id": "44300102",
    "title": "Honda Conducts Successful Launch and Landing of Experimental Reusable Rocket",
    "url": "https://global.honda/en/topics/2025/c_2025-06-17ceng.html",
    "summary": "Honda successfully conducted a launch and landing test of its experimental reusable rocket on June 17, 2025, in Taiki Town, Hokkaido, Japan. This marks the first time Honda has successfully landed a rocket after reaching an altitude of 300 meters. The test aimed to demonstrate key technologies for rocket reusability, including flight stability and landing capability. The rocket reached an altitude of 271.4 meters and landed within 37 cm of the target touchdown point after a 56.6-second flight.\n\nHonda's rocket research is driven by the belief that it can leverage its core technologies to contribute to people's daily lives by launching satellites for various services compatible with other Honda businesses. The company envisions using satellites for remote sensing, wide-area communication for connected mobility, and other applications.\n\nSafety was a top priority, with a 1-kilometer radius restricted area, security personnel, and a safety system to prevent deviations from the flight path.\n\nWhile still in the fundamental research phase with no commercialization plans, Honda aims to achieve suborbital launch capability by 2029. Toshihiro Mibe, Honda's Global CEO, emphasized the company's commitment to addressing environmental and safety issues and creating new value to enhance people's lives through technological innovation.\n",
    "chinese_title": "本田成功进行实验性可重复使用火箭的发射和着陆",
    "chinese_summary": "本田于2025年6月17日在日本北海道大树町成功进行了实验性可重复使用火箭的发射和着陆测试。这是本田首次在火箭达到300米高度后成功着陆。该测试旨在验证火箭可重复使用的关键技术，包括飞行稳定性和着陆能力。火箭飞行56.6秒后，到达271.4米的高度，并在距离目标着陆点37厘米的范围内着陆。\n\n本田的火箭研究源于这样一种信念：它可以通过发射卫星为各种与本田其他业务兼容的服务提供支持，从而利用其核心技术为人们的日常生活做出贡献。该公司设想将卫星用于遥感、互联移动的广域通信以及其他应用。\n\n安全是重中之重，设有半径1公里的限制区域、安保人员以及防止偏离飞行路径的安全系统。\n\n虽然仍处于基础研究阶段，没有商业化计划，但本田的目标是在2029年前实现亚轨道发射能力。本田全球CEO三部敏宏强调了公司致力于解决环境和安全问题，并通过技术创新创造新价值，以改善人们的生活。"
  },
  {
    "id": "44300717",
    "title": "We're expanding our Gemini 2.5 family of models",
    "url": "https://blog.google/products/gemini/gemini-2-5-model-family-expands/",
    "summary": "This article announces the expansion of Google's Gemini 2.5 family of models, focusing on improved performance, cost-efficiency, and speed. The key announcements include:\n\n*   **General Availability of Gemini 2.5 Flash and Pro:** Stable versions of these models are now available for production use, incorporating feedback from developers and organizations that have been using them in-production.\n*   **Introduction of Gemini 2.5 Flash-Lite (Preview):** This new model is the most cost-efficient and fastest of the 2.5 family, designed for high-volume, latency-sensitive tasks like translation and classification. It offers improved quality compared to 2.0 Flash-Lite across various benchmarks.\n*   **Capabilities of Gemini 2.5 Flash-Lite:** Despite its focus on speed and cost, Flash-Lite retains key Gemini 2.5 features such as adjustable thinking budgets, tool integration (Google Search, code execution), multimodal input, and a 1 million-token context length.\n*   **Availability:** The preview of Gemini 2.5 Flash-Lite is available in Google AI Studio and Vertex AI, alongside the stable versions of Flash and Pro. Flash and Pro are also accessible in the Gemini app. Custom versions of Flash-Lite and Flash have also been implemented in Google Search.\n\nThe article emphasizes that the Gemini 2.5 family is designed to balance performance, cost, and speed, and encourages developers to explore and provide feedback on the new models.\n",
    "chinese_title": "我们正在扩展 Gemini 2.5 系列模型。",
    "chinese_summary": "本文宣布扩展谷歌Gemini 2.5模型系列，重点在于提高性能、成本效益和速度。主要公告包括：\n\n*   **Gemini 2.5 Flash和Pro全面上线：** 这些模型的稳定版本现已可用于生产环境，并融入了开发者和组织在生产中使用后的反馈。\n*   **推出Gemini 2.5 Flash-Lite（预览版）：** 这款新模型是2.5系列中成本效益最高、速度最快的，专为翻译和分类等大批量、对延迟敏感的任务而设计。与2.0 Flash-Lite相比，它在各种基准测试中都展现出更高的质量。\n*   **Gemini 2.5 Flash-Lite的功能：** 尽管侧重于速度和成本，Flash-Lite仍保留了Gemini 2.5的关键功能，如可调节的思考预算、工具集成（Google 搜索、代码执行）、多模态输入以及100万token的上下文长度。\n*   **可用性：** Gemini 2.5 Flash-Lite的预览版已在Google AI Studio和Vertex AI中提供，同时提供Flash和Pro的稳定版本。Flash和Pro也可在Gemini应用中访问。Flash-Lite和Flash的自定义版本也已在Google搜索中实现。\n\n本文强调，Gemini 2.5系列旨在平衡性能、成本和速度，并鼓励开发者探索新模型并提供反馈。"
  },
  {
    "id": "44299947",
    "title": "O3 Turns Pro",
    "url": "https://thezvi.substack.com/p/o3-turns-pro",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "O3专业版",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "44300524",
    "title": "Windows 10 EOL",
    "url": "https://solhsa.com/oldernews2025.html#WINDOWS-10-EOL",
    "summary": "This blog post discusses the author's experience dealing with the upcoming Windows 10 End of Life (EOL) in 2025 and the process of upgrading or replacing multiple computers and laptops for their family. The author criticizes Microsoft's decision, calling it wasteful due to perfectly capable hardware becoming obsolete. They detail the upgrades of their son's PC (BIOS tweak for Win11), wife's PC (replaced due to age and damage), and their own PC (upgraded to a Ryzen 9900x 12-core system).\n\nThe author also shares their experience installing Windows 11 on their old system for audio production and migrating software, including a legal but unsupported copy of Photoshop CS5. They also detail replacing their mother-in-law's laptop with a refurbished ThinkPad and installing Linux (Ubuntu) on the remaining laptops, encountering various hardware compatibility and software issues along the way, particularly with screen capture and CLion.\n\nThe blog post also includes a guide on file format design, covering aspects like checking existing formats, human readability, chunking binary files, partial parsing, versioning, documentation, avoiding unnecessary fields, considering target hardware, compression, and filename extensions.\n\nFinally, the author touches on their recent return to ZX Spectrum programming, detailing the development of a fishing game (\"Deep Fishing\") for the Comp.Sys.Sinclair Crap Games Competition. They share the initial design document and their process of creating assets and coding the game, using custom tools for image conversion.\n",
    "chinese_title": "Windows 10 停止服务",
    "chinese_summary": "这篇博文讨论了作者应对2025年即将到来的Windows 10停止支持（EOL）的经历，以及为其家人升级或更换多台电脑和笔记本电脑的过程。作者批评了微软的决定，认为这造成了浪费，因为性能完全足够的硬件变得过时。他们详细描述了对其儿子的电脑（BIOS调整以支持Win11）、妻子的电脑（因老化和损坏而更换）以及他们自己的电脑（升级到Ryzen 9900x 12核系统）的升级过程。\n\n作者还分享了他们在旧系统上安装Windows 11用于音频制作和迁移软件（包括一份合法但不受支持的Photoshop CS5拷贝）的经验。他们还详细介绍了用翻新的ThinkPad替换岳母的笔记本电脑，并在剩余的笔记本电脑上安装Linux (Ubuntu) 的过程，在此过程中遇到了各种硬件兼容性和软件问题，尤其是在屏幕捕获和CLion方面。\n\n这篇博文还包含文件格式设计指南，涵盖了诸如检查现有格式、人类可读性、分块二进制文件、部分解析、版本控制、文档编写、避免不必要的字段、考虑目标硬件、压缩和文件名扩展名等方面。\n\n最后，作者提到了他们最近回归ZX Spectrum编程的经历，详细介绍了为Comp.Sys.Sinclair Crap Games竞赛开发的一款钓鱼游戏（“深海捕鱼”）。他们分享了最初的设计文档，以及他们创建素材和编写游戏代码的过程，并使用了自定义工具进行图像转换。"
  },
  {
    "id": "44277179",
    "title": "AMD's Pre-Zen Interconnect: Testing Trinity's Northbridge",
    "url": "https://chipsandcheese.com/p/amds-pre-zen-interconnect-testing",
    "summary": "This article delves into the architecture of AMD's \"Trinity\" APU (Accelerated Processing Unit) from 2012, focusing on its interconnect design which differs significantly from the modern Infinity Fabric. Trinity integrated a CPU and GPU, but their communication wasn't as seamless.\n\nThe article highlights two key links used by the iGPU: the \"Garlic\" link (Radeon Memory Bus) and the \"Onion\" link (Fusion Control Link). \"Garlic\" allows the GPU to saturate DRAM bandwidth by bypassing the CPU's memory controller (MCT) and cache coherency mechanisms, which is efficient for GPU-intensive tasks where CPU and GPU don't typically share data. However, this bypass means the GPU can't directly access the most up-to-date data in the CPU's caches. The \"Onion\" link allows the GPU to access CPU-allocated memory with cache coherency via the MCT, but suffers from significantly lower bandwidth.\n\nThe author found that while the \"Garlic\" link provides high bandwidth for graphics workloads, CPU access to GPU memory is penalized. Accessing GPU memory from the CPU requires disabling caching, resulting in reduced bandwidth and increased latency. In practice, the Trinity interconnect performs well for graphics workloads, with the iGPU effectively utilizing the \"Garlic\" link without significantly impacting CPU memory latency. However, the article points out that Trinity's interconnect wasn't as well integrated as Intel's at the time. AMD's later Infinity Fabric resolved these issues by providing a unified, coherent memory access path for both CPU and GPU.\n",
    "chinese_title": "AMD Zen架构前互连：Trinity北桥测试",
    "chinese_summary": "本文深入探讨了AMD 2012年推出的“Trinity” APU（加速处理器）的架构，重点关注其互连设计，这与现代的Infinity Fabric有显著不同。“Trinity”集成了CPU和GPU，但它们的通信并不像现在这样无缝。\n\n本文重点介绍了iGPU使用的两个关键链接：“Garlic”链接（Radeon 内存总线）和“Onion”链接（Fusion 控制链接）。“Garlic”允许 GPU 通过绕过 CPU 的内存控制器 (MCT) 和缓存一致性机制来饱和 DRAM 带宽，这对于 CPU 和 GPU 通常不共享数据的 GPU 密集型任务非常有效。但是，这种绕过意味着 GPU 无法直接访问 CPU 缓存中最新的数据。“Onion”链接允许 GPU 通过 MCT 访问具有缓存一致性的 CPU 分配的内存，但带宽却大大降低。\n\n作者发现，虽然“Garlic”链接为图形工作负载提供了高带宽，但 CPU 访问 GPU 内存会受到惩罚。 从 CPU 访问 GPU 内存需要禁用缓存，从而导致带宽降低和延迟增加。 在实践中，“Trinity”互连在图形工作负载方面表现良好，iGPU 有效地利用了“Garlic”链接，而不会显着影响 CPU 内存延迟。 然而，本文指出，“Trinity”的互连当时不如英特尔集成得好。 AMD 后来的 Infinity Fabric 通过为 CPU 和 GPU 提供统一的、一致的内存访问路径，解决了这些问题。"
  },
  {
    "id": "44298724",
    "title": "Voyager: Real-Time Splatting City-Scale 3D Gaussians on Your Phone",
    "url": "https://arxiv.org/abs/2506.02774",
    "summary": "This paper, titled \"Voyager: Real-Time Splatting City-Scale 3D Gaussians on Your Phone,\" addresses the challenge of rendering large-scale 3D Gaussian Splatting (3DGS) scenes on mobile devices with limited resources. The authors acknowledge that while cloud rendering is a solution, directly streaming rendered frames results in high latency and bandwidth demands.\n\nVoyager proposes a novel approach that leverages the observation that the number of newly visible Gaussians remains relatively constant during typical user movement. The system focuses on streaming only the necessary Gaussians to the mobile client.\n\nThe cloud side employs asynchronous level-of-detail search to efficiently identify these necessary Gaussians. On the client side, rendering is accelerated using a lookup table-based rasterization technique. Through these innovations, along with holistic runtime optimizations, Voyager enables low-latency, city-scale 3DGS rendering on smartphones.\n\nThe paper claims a significant reduction in data transfer, achieving over 100x improvement compared to existing solutions. Furthermore, Voyager provides up to an 8.9x speedup in rendering performance while maintaining comparable visual quality. Thus, this work provides a viable solution for rendering complex 3D scenes on mobile devices without significant latency or bandwidth constraints.\n",
    "chinese_title": "旅行者：在您的手机上实时溅射城市规模的3D高斯函数",
    "chinese_summary": "航海家：在您的手机上实时喷溅城市级3D高斯分布\n本文题为“航海家：在您的手机上实时喷溅城市级3D高斯分布”，旨在解决在资源有限的移动设备上渲染大规模3D高斯溅射(3DGS)场景的挑战。作者承认，虽然云渲染是一种解决方案，但直接流式传输渲染帧会导致高延迟和带宽需求。\n\n航海家提出了一种新颖的方法，该方法利用了在典型用户移动过程中，新可见高斯分布的数量保持相对恒定的观察结果。该系统专注于仅将必要的高斯分布流式传输到移动客户端。\n\n云端采用异步细节层次搜索来有效地识别这些必要的高斯分布。在客户端，使用基于查找表的栅格化技术来加速渲染。通过这些创新，以及整体运行时优化，航海家能够在智能手机上实现低延迟、城市级3DGS渲染。\n\n该论文声称显著减少了数据传输，与现有解决方案相比，实现了超过100倍的改进。此外，航海家在保持可比视觉质量的同时，提供了高达8.9倍的渲染性能加速。因此，这项工作为在移动设备上渲染复杂的3D场景提供了一种可行的解决方案，而无需显著的延迟或带宽限制。"
  },
  {
    "id": "44298656",
    "title": "Should we design for iffy internet?",
    "url": "https://bytes.zone/posts/should-we-design-for-iffy-internet/",
    "summary": "Brian Hicks's article \"Should we design for iffy internet?\" explores the prevalence of less-than-ideal internet connectivity in the US as of 2025 and its implications for software design. Hicks argues that while a vast majority (around 97%) of US households have some internet access, assuming high speeds (above 25Mbps down/3Mbps up) is unwise, especially for B2C software.\n\nHe uses data from the FCC and the NCES to illustrate the disparity in broadband access, particularly between urban and rural areas. The FCC broadband map reveals that high-speed internet (250/25Mbps) is significantly less available in rural regions. NCES data from 2021 indicates that while student internet access is increasing, a significant number of students (especially those from lower-income households) still lack reliable access or rely solely on mobile connections.\n\nHicks stresses the importance of considering users with slow, metered, or capped internet connections. He suggests thinking about the \"plane wifi\" experience (high latency, low speed) and the limitations of 4G (5/1Mbps) and 3G. While the article is US-centric, it emphasizes that the problem of unreliable internet is real and should be a key factor in software design to avoid excluding a substantial portion of the user base.\n",
    "chinese_title": "我们应该为不稳定的网络设计吗？",
    "chinese_summary": "布莱恩·希克斯的文章《我们应该为不稳定的网络设计吗？》探讨了截至2025年美国不太理想的网络连接的普遍性及其对软件设计的影响。希克斯认为，虽然绝大多数（约97%）美国家庭都能上网，但假设拥有高速网络（高于25Mbps下载/3Mbps上传）是不明智的，尤其是对于B2C软件。\n\n他使用来自 FCC 和 NCES 的数据来说明宽带接入的差异，尤其是在城市和农村地区之间。 FCC 宽带地图显示，高速互联网 (250/25Mbps) 在农村地区的可用性明显较低。 NCES 2021 年的数据表明，虽然学生的互联网接入正在增加，但仍有大量学生（尤其是来自低收入家庭的学生）仍然缺乏可靠的接入或仅依赖移动连接。\n\n希克斯强调了考虑使用缓慢、按流量计费或限额的互联网连接的用户的重要性。 他建议考虑“飞机 WiFi”体验（高延迟、低速度）以及 4G (5/1Mbps) 和 3G 的局限性。 虽然这篇文章以美国为中心，但它强调不可靠的互联网问题是真实存在的，并且应该是软件设计中的一个关键因素，以避免排除相当一部分用户群。"
  },
  {
    "id": "44285956",
    "title": "Cmapv2: A high performance, concurrent map",
    "url": "https://github.com/sirgallo/cmapv2",
    "summary": "`cmapv2` is a Go library providing a high-performance, concurrent map implementation. It can be installed using `go get github.com/sirgallo/cmapv2` and `go mod tidy`.  The library offers two ways to initialize a concurrent map: `cmap.NewMap()` creates a standard concurrent map, while `cmap.NewMap(numShards)` creates a sharded concurrent map, allowing for finer-grained concurrency control.\n\nThe core functionality includes `Put(key, value)` for inserting key-value pairs (where keys and values are byte slices), `Get(key)` for retrieving values, and `Delete(key)` for removing entries. The library provides both `CMap` which refers to the concurrent map itself, and `Murmur` relating to the hashing algorithm used.\n\nThe package includes comprehensive tests accessible via `go test -v ./tests`. Performance analysis is also supported using benchmarks with CPU and memory profiling tools. This allows developers to thoroughly evaluate the library's performance characteristics.\n",
    "chinese_title": "Cmapv2：一个高性能的并发映射",
    "chinese_summary": "`cmapv2` 是一个 Go 语言库，提供高性能的并发 Map 实现。可以使用 `go get github.com/sirgallo/cmapv2` 和 `go mod tidy` 进行安装。 该库提供了两种初始化并发 Map 的方式：`cmap.NewMap()` 创建一个标准的并发 Map，而 `cmap.NewMap(numShards)` 创建一个分片并发 Map，从而实现更细粒度的并发控制。\n\n其核心功能包括 `Put(key, value)` 用于插入键值对（其中键和值是字节切片），`Get(key)` 用于检索值，以及 `Delete(key)` 用于删除条目。该库提供了 `CMap` 指代并发 Map 本身，以及与所使用的哈希算法相关的 `Murmur`。\n\n该软件包包含全面的测试，可通过 `go test -v ./tests` 访问。 也支持使用带有 CPU 和内存分析工具的基准测试进行性能分析。 这使开发人员能够彻底评估该库的性能特征。"
  },
  {
    "id": "44276200",
    "title": "Fujifilm X half: Is it the perfect family camera?",
    "url": "https://arslan.io/2025/06/14/fujifilm-x-half-is-it-the-perfect-family-camera/",
    "summary": "The author reviews the Fujifilm X half, framing it as a potential family camera despite its controversial reception and high price. While acknowledging criticisms about its limited features, small sensor, and lack of RAW support, the author argues that these drawbacks are less significant for its target audience: families and children.\n\nThe author, a long-time Fujifilm user who now shoots with a Leica M11, bought the X half specifically for his family. He found the M11 too complex for his wife and children to use easily. After failed attempts with cheap, generic kids' cameras that proved unreliable and frustrating, the X half emerged as a suitable option.\n\nThe X half's strengths lie in its lightweight design, simple operation (especially the auto mode), film simulations, long battery life, USB-C charging, and vertical aspect ratio. These factors make it appealing and easy to use for children. The author highlighted the constraint of having only 36 \"frames\" to shoot as a great introduction to photography.\n\nHowever, the author admits the camera's WiFi is finicky, the picture quality isn't great (due to the small sensor), it's slow to use, and the film lever and shutter button lack satisfying feedback. He also believes the price is too high, suggesting a more appropriate price point would be around $500.\n\nDespite these drawbacks, the author concludes that the X half is a worthwhile purchase for families seeking a fun, easy-to-use camera, provided expectations are set realistically. It's not for serious photographers, but its simplicity and \"nostalgic camera costume\" make it ideal for those who just want to point, shoot, and enjoy the moment.\n",
    "chinese_title": "富士X半格：它是完美的家庭相机吗？",
    "chinese_summary": "作者评测富士X half：或为家庭相机之选"
  },
  {
    "id": "44300554",
    "title": "CPU-Based Layout Design for Picker-to-Parts Pallet Warehouses",
    "url": "https://arxiv.org/abs/2506.04266",
    "summary": "This arXiv submission (arXiv:2506.04266) presents a novel layout design for picker-to-parts pallet warehouses aimed at improving efficiency and reducing labor requirements. The authors, Timo Looms and Lin Xie, propose a CPU-based layout, drawing inspiration from computer processing unit architecture.\n\nThe core concept involves partitioning the warehouse into specialized zones: Performance (P), Efficiency (E), and Shared (S). This compartmentalization is intended to optimize specific warehousing tasks, leading to better overall performance.\n\nThe study uses discrete-event simulation to evaluate the effectiveness of the CPU-based layout. This layout is benchmarked against traditional warehouse layouts, including rectangular layouts using random and ABC storage strategies, as well as a Flying-V layout.\n\nThe simulation results indicate that the CPU-based layout yields significant improvements in throughput time and a reduction in labor requirements compared to the traditional warehouse layouts. This suggests the potential of CPU-based designs to optimize warehouse operations substantially. The paper is 8 pages long, includes 6 figures, and is intended for conference presentation. It falls under the subject area of Multiagent Systems (cs.MA).\n",
    "chinese_title": "基于CPU的拣货员到货位托盘仓库布局设计",
    "chinese_summary": "这篇 arXiv 提交 (arXiv:2506.04266) 提出了一种新型拣货员到货位托盘仓库的布局设计，旨在提高效率并减少劳动力需求。作者 Timo Looms 和 Lin Xie 提出了一种基于 CPU 的布局，灵感来自计算机处理单元架构。\n\n其核心概念是将仓库划分为专门的区域：性能 (P)、效率 (E) 和共享 (S)。这种划分旨在优化特定的仓储任务，从而提高整体性能。\n\n该研究采用离散事件仿真来评估基于 CPU 布局的有效性。该布局与传统仓库布局进行基准测试，包括使用随机和 ABC 存储策略的矩形布局，以及 Flying-V 布局。\n\n仿真结果表明，与传统仓库布局相比，基于 CPU 的布局在吞吐时间和劳动力需求方面均有显著改善。这表明基于 CPU 的设计具有大幅优化仓库运营的潜力。该论文共 8 页，包含 6 个图，旨在用于会议展示。它属于多智能体系统 (cs.MA) 领域。"
  },
  {
    "id": "44276778",
    "title": "Attempting to Make the Smallest* Electric Motor [video]",
    "url": "https://www.youtube.com/watch?v=6x_NMytSA90",
    "summary": "The provided \"article\" is essentially YouTube's standard footer information. It's not really an article at all, but rather a collection of links and disclaimers typically found at the bottom of YouTube pages.\n\nThe main topic, as suggested by the title, is a video titled \"Attempting to Make the Smallest* Electric Motor.\" However, the provided text content offers *nothing* about the video itself. All it offers are standard YouTube boilerplate links related to:\n\n*   **YouTube's core functions and policies:** About, News, Copyright, Contact Us, Creators, Advertise, Developers, Terms, Privacy, Policy & Safety, How YouTube Works, Test New Features\n*   **Legal and copyright information:** NFL Sunday Ticket © 2025 Google LLC\n\nEssentially, the provided text is irrelevant to the title. To summarize the provided *content* itself: It's just YouTube footer information. We know *nothing* about the actual attempt to build the smallest electric motor.\n",
    "chinese_title": "尝试制作最小的*电动机 [视频]",
    "chinese_summary": "提供的“文章”本质上是YouTube的标准页脚信息。它根本不是一篇真正的文章，而是在YouTube页面底部通常可以找到的链接和免责声明的集合。\n\n正如标题所示，主题是一部名为“尝试制作最小*电动机”的视频。然而，所提供的文本内容没有提供关于视频本身的*任何*信息。它所提供的只是与以下内容相关的标准YouTube样板链接：\n\n*   **YouTube的核心功能和政策：** 关于，新闻，版权，联系我们，创作者，广告，开发者，条款，隐私权，政策和安全，YouTube的工作原理，测试新功能\n*   **法律和版权信息：** NFL Sunday Ticket © 2025 Google LLC\n\n本质上，所提供的文本与标题无关。 总结所提供的*内容*本身：它只是YouTube页脚信息。我们对实际尝试制造最小电动机一无所知。"
  },
  {
    "id": "44280926",
    "title": "How you breathe is like a fingerprint that can identify you",
    "url": "https://www.nature.com/articles/d41586-025-01835-0",
    "summary": "A recent study suggests that a person's breathing pattern is as unique as a fingerprint, offering potential for individual identification and insight into physical and mental health. Researchers at the Weizmann Institute of Science developed a wearable device to measure airflow through the nostrils of 97 participants for 24 hours. The device tracked breathing patterns during both waking and sleeping hours.\n\nThe team extracted 24 parameters from the airflow data, including inhalation and exhalation duration and airflow asymmetry between nostrils. By using a machine-learning algorithm, they were able to identify participants with high accuracy based on their breath patterns alone. The algorithm achieved 96.8% accuracy when using 100 parameters from the full dataset.\n\nThe study also explored correlations between breathing patterns and other factors, such as BMI, and symptoms of depression and anxiety. Researchers found that people with higher BMIs had different breathing patterns during sleep than those with lower BMIs. Similarly, individuals who scored higher on anxiety and depression questionnaires exhibited distinct inhalation and exhalation patterns.\n\nThese findings suggest that breathing patterns could serve as a non-invasive diagnostic tool for identifying individuals and potentially assessing certain aspects of their physical and mental well-being.\n",
    "chinese_title": "你的呼吸方式就像指纹一样，可以识别你。",
    "chinese_summary": "最新研究表明，人的呼吸模式与指纹一样独特，有望用于个体识别并深入了解身心健康。魏茨曼科学研究所的研究人员开发了一种可穿戴设备，用于测量97名参与者24小时内通过鼻孔的气流。该设备跟踪了清醒和睡眠时的呼吸模式。\n\n研究小组从气流数据中提取了24个参数，包括吸气和呼气持续时间以及鼻孔之间的气流不对称性。通过使用机器学习算法，他们仅根据呼吸模式就能以高精度识别参与者。当使用完整数据集中的100个参数时，该算法的准确率达到了96.8%。\n\n该研究还探讨了呼吸模式与其他因素（如体重指数）以及抑郁症和焦虑症症状之间的相关性。研究人员发现，体重指数较高的人在睡眠期间的呼吸模式与体重指数较低的人不同。同样，在焦虑和抑郁问卷调查中得分较高的人表现出不同的吸气和呼气模式。\n\n这些发现表明，呼吸模式可以作为一种非侵入性的诊断工具，用于识别个体，并有可能评估其身心健康的某些方面。"
  },
  {
    "id": "44293610",
    "title": "What happens when clergy take psilocybin",
    "url": "https://nautil.us/clergy-blown-away-by-psilocybin-1217112/",
    "summary": "This Nautilus article, \"What Happens When Clergy Take Psilocybin,\" details a study where 33 religious leaders from various faiths ingested high doses of psilocybin in a controlled lab setting. Almost a decade after the experiment, the results of this controversial study are finally being examined. Published in *Psychedelic Medicine*, the study found that over 90% of the participants considered the experience one of the most spiritually meaningful and deeply sacred of their lives, with nearly half calling it the most profound experience they ever had. Many felt it made them better religious leaders, and some have since become advocates for psychedelics in their teachings.\n\nHowever, the study was not without its flaws. Publication was delayed due to ethical concerns regarding funding sources and researcher involvement. The study also faced criticism for potential bias in participant recruitment, a small sample size, and a lack of diversity in religious representation. The majority of participants were white, male, and Christian, neglecting significant representation from Indigenous traditions, Hinduism, Taoism, and Confucianism.\n\nDespite these limitations, the findings raise significant questions about the relationship between hallucinogens and religious experience. While major world religions generally discourage the use of mind-altering substances, psychedelic plants have a long history in Indigenous sacred ceremonies and may have even influenced the development of some religions. The article also references William James's use of nitrous oxide and the value of religion, the importance of mystical experience, the universe as pluralistic.\n",
    "chinese_title": "神职人员服用裸盖菇素会发生什么？",
    "chinese_summary": "神职人员服用裸盖菇素会发生什么？\n\n这篇 Nautilus 文章《神职人员服用裸盖菇素会发生什么》详细介绍了一项研究，该研究中，来自不同信仰的 33 位宗教领袖在受控实验室环境中服用了高剂量的裸盖菇素。 实验近十年后，这项备受争议的研究结果终于得到了检验。发表在《迷幻药医学》上的这项研究发现，超过 90% 的参与者认为这种体验是他们一生中最具精神意义和最神圣的体验之一，其中近一半的人称其为他们一生中最深刻的体验。许多人觉得这让他们成为了更好的宗教领袖，并且一些人后来在他们的教义中倡导使用迷幻药。\n\n然而，这项研究并非没有缺陷。 由于伦理问题，包括资金来源和研究人员的参与，出版被推迟。 该研究还因参与者招募中存在的潜在偏见、样本量小以及宗教代表性的缺乏而受到批评。 大多数参与者是白人、男性和基督徒，忽略了来自土著传统、印度教、道教和儒教的重要代表。\n\n尽管存在这些局限性，但这些发现引发了关于致幻剂与宗教体验之间关系的重要问题。 虽然世界主要宗教通常不鼓励使用改变意识的物质，但迷幻植物在土著神圣仪式中有着悠久的历史，甚至可能影响了一些宗教的发展。 这篇文章还提到了威廉·詹姆斯对一氧化二氮的使用、宗教的价值、神秘体验的重要性以及宇宙的多元性。"
  },
  {
    "id": "44297381",
    "title": "KiCad and Wayland Support",
    "url": "https://www.kicad.org/blog/2025/06/KiCad-and-Wayland-Support/",
    "summary": "KiCad's support for Wayland is currently functional but significantly degraded, causing numerous user experience problems that the KiCad team cannot fix at the application level. These issues stem from fundamental limitations in Wayland's design and fragmented implementation across different compositors, including problems with window management (positioning, docking, multi-window coordination, dragging), input (cursor warping, focus, device handling), performance (CPU/GPU usage, glitches, crashes), and dialog behavior.\n\nThe KiCad team has strategically decided to avoid window manager-specific workarounds and instead focus development on features benefiting all users, while maintaining clear documentation about Wayland limitations. They will not investigate or support bug reports related to Wayland-specific issues, such as window management problems, crashes unique to Wayland, high resource usage, input device issues, graphical glitches, or clipboard problems.\n\nFor professional users, X11-based desktop environments are strongly recommended for a reliable experience. Casual users willing to accept limitations can run KiCad on Wayland, but should expect frustrations. The team is monitoring Wayland development and encourages contributions to upstream projects and wxWidgets, as well as sponsorship to improve Wayland compatibility. In essence, KiCad prioritizes stability and reliability; therefore, using X11 is the current recommendation for Linux users.\n",
    "chinese_title": "KiCad的Wayland支持",
    "chinese_summary": "KiCad 对 Wayland 的支持目前可用，但性能显著下降，导致诸多用户体验问题，而 KiCad 团队无法在应用程序层面解决。这些问题源于 Wayland 设计上的根本限制以及不同合成器之间的碎片化实现，包括窗口管理（定位、停靠、多窗口协调、拖动）、输入（光标跳转、焦点、设备处理）、性能（CPU/GPU 使用率、故障、崩溃）和对话框行为等方面的问题。\n\nKiCad 团队已策略性地决定避免针对特定窗口管理器进行修复，而是将开发重点放在惠及所有用户的功能上，同时保持关于 Wayland 限制的清晰文档。他们不会调查或支持与 Wayland 特有问题相关的错误报告，例如窗口管理问题、Wayland 独有的崩溃、高资源使用率、输入设备问题、图形故障或剪贴板问题。\n\n对于专业用户，强烈建议使用基于 X11 的桌面环境以获得可靠的体验。愿意接受限制的休闲用户可以在 Wayland 上运行 KiCad，但应该预料到可能会遇到问题。团队正在监控 Wayland 的发展，并鼓励向上游项目和 wxWidgets 贡献代码，以及赞助以提高 Wayland 的兼容性。本质上，KiCad 优先考虑稳定性和可靠性；因此，目前推荐 Linux 用户使用 X11。"
  },
  {
    "id": "44301186",
    "title": "Miscalculation by Spanish power grid operator REE contributed to blackout",
    "url": "https://www.reuters.com/business/energy/investigation-into-spains-april-28-blackout-shows-no-evidence-cyberattack-2025-06-17/",
    "summary": "Here's a concise summary of the Reuters article \"Miscalculation by Spanish power grid operator REE contributed to blackout\":\n\nThe Spanish power grid operator, Red Eléctrica de España (REE), made a miscalculation that contributed to a blackout on April 28th affecting parts of Spain. According to an investigation, this miscalculation, and not a cyberattack, was the primary cause of the disruption. The investigation found no evidence of malicious activity or cyber intrusion affecting the grid. While the specific nature of the miscalculation isn't detailed in the summary, it appears to be related to the management and operation of the power grid. The article emphasizes that the blackout was the result of human error, specifically a fault within REE's operational procedures, rather than any external or deliberate sabotage. The report aims to clarify the cause of the power outage and dispel any previous speculation about potential cyberattacks.\n",
    "chinese_title": "西班牙电网运营商REE的错误计算导致停电",
    "chinese_summary": "西班牙电网运营商REE的失误导致停电：简要总结路透社报道\n\n西班牙电网运营商Red Eléctrica de España (REE) 的一项失误导致4月28日西班牙部分地区停电。调查显示，这次失误，而非网络攻击，是造成中断的主要原因。调查未发现恶意活动或网络入侵影响电网的证据。虽然摘要中没有详细说明失误的具体性质，但它似乎与电网的管理和运营有关。文章强调，停电是人为错误的 result, 具体是 REE 运营程序中的一个故障，而不是任何外部或故意的破坏。该报告旨在澄清停电的原因，并消除之前关于潜在网络攻击的猜测。"
  },
  {
    "id": "44296564",
    "title": "Fossify – A suite of open-source, ad-free apps",
    "url": "https://github.com/FossifyOrg",
    "summary": "Fossify is a suite of open-source, privacy-focused, and ad-free mobile apps. It originated as a fork of the discontinued SimpleMobileTools, aiming to keep simple and private technology accessible. Users are encouraged to get involved by checking general issues, participating in discussions, and contributing to code or translations. For questions or feedback, users can start a discussion or contact Fossify directly at hello@fossify.org. The project welcomes and appreciates contributions from the community.\n",
    "chinese_title": "Fossify – 一套开源、无广告的应用程序",
    "chinese_summary": "Fossify是一套开源、注重隐私且无广告的移动应用。它起源于已停止维护的SimpleMobileTools的一个分支，旨在保持简单和私有的技术可访问性。我们鼓励用户参与进来，包括查看常见问题、参与讨论以及贡献代码或翻译。如有问题或反馈，用户可以发起讨论或直接通过hello@fossify.org联系Fossify。本项目欢迎并感谢来自社区的贡献。"
  },
  {
    "id": "44301246",
    "title": "Celebrated pianist and writer Alfred Brendel dies aged 94",
    "url": "https://www.theguardian.com/music/2025/jun/17/celebrated-pianist-and-writer-alfred-brendel-dies-aged-94",
    "summary": "Alfred Brendel, the celebrated pianist and writer, has died at the age of 94 in London. Born in Moravia in 1931, Brendel was largely self-taught after initial piano and composition studies. He launched his career after winning fourth prize in the 1949 Busoni competition.\n\nBrendel’s 60-year career involved performances at major musical venues worldwide with leading orchestras and conductors. He was renowned for his interpretations of Beethoven, being the first to record all of Beethoven's piano works. He also championed the music of Haydn, Schubert, Schoenberg, and Liszt.\n\nMoving to London in 1971, Brendel continued performing until his final public concert in Vienna in 2008. Afterwards, he focused on writing poetry and essays, lecturing, and teaching masterclasses.\n\nKnown as the \"musicians' musician\" and \"pianists’ mentor,\" Brendel's pupils included notable musicians such as Paul Lewis and Imogen Cooper. Lewis described him as a guide and mentor for over 30 years. Cooper remembered him as inspirational, uncompromising, and possessing a formidable knowledge of literature and art in addition to music.\n\nBrendel received 23 honorary degrees from various prestigious universities and numerous awards, recognizing his significant contribution to classical music.\n",
    "chinese_title": "著名钢琴家和作家阿尔弗雷德·布伦德尔去世，享年94岁",
    "chinese_summary": "著名钢琴家和作家阿尔弗雷德·布伦德尔在伦敦去世，享年94岁。布伦德尔1931年出生于摩拉维亚，在最初的钢琴和作曲学习之后，主要靠自学成才。1949年布索尼比赛获得第四名后，他开启了自己的职业生涯。\n\n布伦德尔长达60年的职业生涯包括在世界各地的主要音乐场所与顶尖乐团和指挥家合作演出。他以对贝多芬作品的诠释而闻名，是第一位录制贝多芬所有钢琴作品的人。他还积极推广海顿、舒伯特、勋伯格和李斯特的音乐。\n\n1971年移居伦敦后，布伦德尔一直演出到2008年在维也纳举行的最后一场公开音乐会。之后，他专注于诗歌和散文写作、讲学和大师班教学。\n\n布伦德尔被誉为“音乐家的音乐家”和“钢琴家的导师”，他的学生包括保罗·刘易斯和伊莫金·库珀等著名音乐家。刘易斯形容他是自己30多年的指导者和导师。库珀回忆说，他鼓舞人心，毫不妥协，除了音乐之外，还拥有渊博的文学和艺术知识。\n\n布伦德尔获得了来自各著名大学的23个荣誉学位和无数奖项，以表彰他对古典音乐的重大贡献。"
  },
  {
    "id": "44297045",
    "title": "The magic of through running",
    "url": "https://www.worksinprogress.news/p/the-magic-of-through-running",
    "summary": "This article champions \"through running\" as a cost-effective solution for upgrading urban transit systems by integrating existing suburban railway lines. The core problem addressed is that 19th-century railways often terminated at city edges, creating hubless wheel networks and bottlenecks in central termini.\n\nThe article argues that while modern metros offer superior connectivity and capacity, they are expensive to build. Through running bridges this gap by connecting suburban lines from opposite sides of a city via a tunnel through the city center. This creates metro-like service with significantly less infrastructure cost since most of the rail lines are already in place.\n\nMunich is presented as a prime example, having created an outstanding transit network by linking existing suburban lines with a relatively short tunnel. This S-Bahn system greatly improved access to the city center and integrated seamlessly with the U-Bahn metro.\n\nLondon is cited as a city with the potential for large-scale through running due to its extensive legacy network. The article emphasizes that for cities with similar Victorian-era railway infrastructure, through running presents a compelling alternative to building entirely new metro systems. It concludes that this approach allows cities to leverage their existing assets and create world-class transit at a fraction of the cost.\n",
    "chinese_title": "穿越跑的魔力",
    "chinese_summary": "本文倡导“贯通运营”作为一种经济高效的城市交通系统升级方案，通过整合现有郊区铁路线路。其核心问题是，19世纪的铁路往往终止于城市边缘，造成无枢纽的车轮网络以及市中心终点站的瓶颈。\n\n文章认为，虽然现代地铁具有卓越的连通性和运力，但建设成本高昂。“贯通运营”通过一条穿越市中心的隧道连接城市两侧的郊区线路，弥合了这一差距。由于大部分铁路线路已经就位，因此它能以显著降低的基础设施成本创造类似地铁的服务。\n\n慕尼黑被认为是主要的范例，它通过相对较短的隧道连接现有郊区线路，从而创建了出色的交通网络。这个S-Bahn系统大大改善了市中心的交通，并与U-Bahn地铁无缝集成。\n\n伦敦被列为一个具有大规模贯通运营潜力的城市，因为它拥有庞大的传统铁路网络。文章强调，对于拥有类似维多利亚时代铁路基础设施的城市来说，贯通运营提供了一个引人注目的替代方案，可以取代建造全新的地铁系统。文章总结认为，这种方法使城市能够利用其现有资产，并以一小部分成本创建世界一流的交通系统。"
  },
  {
    "id": "44293260",
    "title": "Show HN: Chawan TUI web browser",
    "url": "https://chawan.net/news/chawan-0-2-0.html",
    "summary": "Chawan, a TUI web browser, has released version 0.2.0. Source code is available as a tarball, with compilation instructions in the README. A static binary distribution for amd64 Linux is also offered as a tarball and a .deb package, installable via `make install` (and uninstallable via `make uninstall`).\n\nThe release highlights mandatory runtime dependencies: libssh2, libbrotli (libbrotlicommon and libbrotlidec), and OpenSSL (3.0+) or LibreSSL (tested on OpenBSD 7.7).  Older dependencies like zlib, libseccomp, termcap/ncurses, and libcurl are no longer required.  Package maintainers are encouraged to contact the developer directly for any packaging issues.\n\nThis version is considered a minimal viable product (MVP) with all the intended features and no known critical bugs.  The v0.2 branch will only receive bug fixes. Future development, focusing on new features, will continue on the master branch. The developer plans to improve the layout module's performance and correctness, as well as UI usability, in the next release.\n",
    "chinese_title": "Show HN: 茶碗 TUI 网页浏览器",
    "chinese_summary": "Chawan，一款TUI网页浏览器，发布了0.2.0版本。源代码以tarball格式提供，编译说明见README文件。 同时提供amd64 Linux的静态二进制分发包，有tarball和.deb两种格式，可通过`make install`安装（和`make uninstall`卸载）。\n\n本次发布强调了强制运行时依赖项：libssh2、libbrotli（libbrotlicommon和libbrotlidec）以及OpenSSL (3.0+) 或LibreSSL（已在OpenBSD 7.7上测试）。不再需要旧的依赖项，如zlib、libseccomp、termcap/ncurses和libcurl。鼓励软件包维护者就任何打包问题直接联系开发者。\n\n此版本被认为是具有所有预期功能且没有已知严重错误的最简可行产品 (MVP)。 v0.2 分支将仅接收错误修复。 专注于新功能的未来开发将在主分支上继续进行。 开发者计划在下一个版本中改进布局模块的性能和正确性，以及UI的可用性。"
  },
  {
    "id": "44277284",
    "title": "Pitfalls of premature closure with LLM assisted coding",
    "url": "https://www.shayon.dev/post/2025/164/pitfalls-of-premature-closure-with-llm-assisted-coding/",
    "summary": "This article highlights the \"premature closure\" pitfall in software development, amplified by the increasing sophistication of AI coding assistants. Drawing a parallel to a medical case where doctors nearly missed a critical diagnosis by latching onto an initial, plausible one, the article warns that developers are becoming increasingly likely to accept the first AI-generated solution that \"looks right,\" potentially overlooking better, more fundamental solutions.\n\nWhile AI offers significant ROI through speed and efficiency, incentivizing a \"one-shot\" approach risks hindering deeper exploration of problem spaces. The danger lies in AI's ability to produce seemingly perfect code that masks underlying issues like N+1 queries, race conditions, or memory leaks.\n\nThe article distinguishes between AI-appropriate tasks (routine, well-defined tasks) and complex problem-solving, where AI's single-solution approach can be detrimental. Accepting AI suggestions without critical examination can lead to missed learning opportunities, technical debt, and reduced problem-solving skills.\n\nTo mitigate these risks, the author advocates for treating AI as a collaborator, not an oracle. Key strategies include: reviewing AI-generated code as peer code, asking for alternative solutions, assessing speed vs. learning trade-offs, and prioritizing a deep understanding of the code. The author also suggests exploring problems independently before consulting AI, and focusing on improving code review skills to better identify potential issues in AI-generated code. The core message is to balance the benefits of AI with the need for thorough problem-solving and critical thinking, recognizing when a deep understanding is more valuable than speed.\n",
    "chinese_title": "使用 LLM 辅助编码过早结束的陷阱",
    "chinese_summary": "人工智能编程助手加速软件开发中的“过早收敛”陷阱"
  },
  {
    "id": "44292103",
    "title": "Show HN: Canine – A Heroku alternative built on Kubernetes",
    "url": "https://github.com/czhu12/canine",
    "summary": "This \"Show HN\" post introduces Canine, a Heroku alternative built on Kubernetes, aiming to simplify application deployment on Kubernetes clusters. It provides a user-friendly interface and aims to make Kubernetes more accessible.\n\nThe post outlines the project's requirements (Docker and Docker Compose), provides instructions for local installation via a bash script or manual steps using Docker Compose, and specifies the default port (3000) with the option to customize it using an environment variable.\n\nIt also advertises \"Canine Cloud,\" a paid service offering features like GitHub integration for automated deployments, team collaboration with role-based access control, and real-time metric tracking and monitoring, promising less maintenance overhead. The post directs users to the Canine Cloud landing page for more information and pricing details. The project is licensed under Apache 2.0.\n",
    "chinese_title": "展示 HN: Canine – 一个基于 Kubernetes 构建的 Heroku 替代品",
    "chinese_summary": "此“Show HN”帖子介绍了Canine，一个构建于Kubernetes之上的Heroku替代方案，旨在简化在Kubernetes集群上的应用部署。它提供了一个用户友好的界面，并力求使Kubernetes更易于访问。\n\n该帖子概述了项目的要求（Docker和Docker Compose），提供了通过bash脚本进行本地安装的说明，或者使用Docker Compose进行手动安装的步骤，并指定了默认端口（3000），且可以使用环境变量对其进行自定义。\n\n它还宣传了“Canine Cloud”，一项付费服务，提供诸如用于自动化部署的GitHub集成、具有基于角色的访问控制的团队协作以及实时指标跟踪和监控等功能，承诺减少维护开销。该帖子引导用户访问Canine Cloud登录页面，以获取更多信息和定价详情。该项目采用Apache 2.0许可证。"
  },
  {
    "id": "44299979",
    "title": "Now might be the best time to learn software development",
    "url": "https://substack.com/home/post/p-165655726",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "现在可能是学习软件开发的最佳时机。",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "44290413",
    "title": "Benzene at 200",
    "url": "https://www.chemistryworld.com/opinion/benzene-at-200/4021504.article",
    "summary": "This article celebrates the bicentennial of Michael Faraday's discovery of benzene, highlighting its profound impact on chemistry and various fields. Benzene, initially recognized for its unique aromatic smell and resistance to easy classification, has become a cornerstone of organic chemistry, particularly in the study of aromatic compounds. Its stability and ability to dissolve nonpolar substances made it valuable in both experimentation and industrial processes.\n\nThe article traces benzene's legacy through polycyclic aromatic hydrocarbons (PAHs), nanographenes, fullerenes, and carbon nanotubes, culminating in graphene. These structures, all derived from benzene rings, exhibit remarkable properties such as tunable electron conductivity, fluorescence, and exceptional strength. Graphene, a single layer of fused benzene rings, stands out for its transparency, strength, flexibility, and electrical conductivity, holding the potential to revolutionize numerous fields.\n\nBeyond its scientific impact, benzene plays a vital role in education, serving as an accessible entry point for understanding complex concepts like aromaticity and resonance. The Royal Society of Chemistry is commemorating benzene's anniversary with a special thematic issue, exploring its enduring relevance in carbon-based systems and cutting-edge developments in related fields. The article emphasizes benzene's enduring legacy in inspiring curiosity and innovation, shaping the next generation of chemists.\n",
    "chinese_title": "200号苯",
    "chinese_summary": "纪念法拉第发现苯二百周年：苯对化学及各领域的影响"
  },
  {
    "id": "44294905",
    "title": "The Humble Programmer (1972)",
    "url": "https://www.cs.utexas.edu/~EWD/transcriptions/EWD03xx/EWD340.html",
    "summary": "In his 1972 Turing Award lecture, \"The Humble Programmer,\" Edsger W. Dijkstra reflects on the evolution of the programming profession from its nascent stages to the \"software crisis\" of the 1960s. He recounts his personal experiences, including being denied the title of \"programmer\" in 1957 due to its lack of perceived respectability.\n\nDijkstra argues that the early days of computing were dominated by hardware considerations, with programmers playing a relatively minor role. The focus was on making unreliable machines work, and programmers often reveled in clever tricks to overcome hardware limitations. This fostered two problematic opinions: that programmers should be puzzle-minded and that programming was solely about optimizing efficiency.\n\nThe advent of more powerful machines did not solve programming problems as anticipated. Instead, it led to the \"software crisis\" because society's ambitions to utilize these machines outpaced programmers' ability to manage their complexity. Dijkstra criticizes the design of \"third generation\" computers for prioritizing price/performance ratios based on hardware metrics, resulting in machines that were difficult to program. He laments the lack of reviews of new computer architectures in scientific journals, hindering the development of objective design criteria.\n\nDijkstra highlights the importance of software developments like the subroutine library in EDSAC and the birth of FORTRAN, while acknowledging the latter's limitations as a tool for conception. He emphasizes the profound influence of computing tools on the thinking habits of programmers. Ultimately, he suggests a need for greater humility and a recognition of the increasing complexity of the programming task.\n",
    "chinese_title": "谦卑的程序员 (1972)",
    "chinese_summary": "在其1972年的图灵奖演讲“谦卑的程序员”中，艾兹格·W·迪科斯彻反思了编程行业从萌芽阶段到20世纪60年代“软件危机”的演变。他回顾了自己的个人经历，包括1957年因缺乏受人尊敬的认知而被拒绝授予“程序员”头衔。\n\n迪科斯彻认为，早期计算机时代主要由硬件考虑因素主导，程序员扮演的角色相对较小。当时的重点是使不可靠的机器运转起来，程序员们常常沉迷于巧妙的技巧来克服硬件限制。这滋生了两种有问题观点：程序员应该擅长解谜，以及编程仅仅是关于优化效率。\n\n更强大的机器的出现并没有像预期的那样解决编程问题。相反，它导致了“软件危机”，因为社会利用这些机器的雄心超过了程序员管理其复杂性的能力。迪科斯彻批评“第三代”计算机的设计，认为其优先考虑基于硬件指标的性价比，导致机器难以编程。他感叹科学期刊缺乏对新计算机架构的评论，阻碍了客观设计标准的制定。\n\n迪科斯彻强调了诸如EDSAC中的子程序库和FORTRAN的诞生等软件发展的重要性，同时也承认后者作为一种概念工具的局限性。他强调了计算工具对程序员思维习惯的深刻影响。最终，他建议需要更加谦逊，并认识到编程任务日益增长的复杂性。"
  },
  {
    "id": "44291892",
    "title": "Dull Men’s Club",
    "url": "https://www.theguardian.com/society/2025/jun/09/meet-the-members-of-the-dull-mens-club-some-of-them-would-bore-the-ears-off-you",
    "summary": "The article explores the appeal and purpose of the Dull Men's Club, an international online community celebrating the mundane and ordinary. Founded by Grover Click as a joke, the club has grown to millions of members who share ironic, self-deprecating humor and find camaraderie in their shared appreciation for the uneventful. The club values civility, rejects excitement, and encourages members to find joy in quirky hobbies and obscure interests.\n\nThe article highlights the story of Andrew McKean, an 85-year-old Australian member living in a care facility. After a heart attack, he found connection and purpose by sharing his observations and poetic reflections on his daily life with the Dull Men's Club. His writing, though rooted in the often monotonous reality of institutional living, resonates with the community and provides him with a sense of belonging and validation.\n\nThe article emphasizes that the Dull Men's Club provides a safe and supportive space for people to embrace their perceived dullness, fostering a sense of community and purpose. It argues that celebrating the ordinary can be a powerful antidote to the pressures of modern life, offering a different perspective on finding meaning and connection.\n",
    "chinese_title": "沉闷男人俱乐部",
    "chinese_summary": "这篇文章探讨了“沉闷男人俱乐部”的吸引力与宗旨，这是一个国际性的在线社群，旨在颂扬平凡与普通。该俱乐部由格罗弗·克利克玩笑般地创立，现已发展到数百万成员，他们分享着讽刺、自嘲式的幽默，并在对平淡无奇之事的共同欣赏中找到了友谊。俱乐部崇尚礼貌，拒绝刺激，并鼓励成员在古怪的爱好和冷门兴趣中寻找乐趣。\n\n文章重点介绍了85岁的澳大利亚成员安德鲁·麦基恩的故事，他住在一家护理机构。在一次心脏病发作后，他通过与沉闷男人俱乐部分享他对日常生活的观察和诗意反思，找到了联系和目标。他的写作虽然根植于机构生活的单调现实，却能引起社区的共鸣，并为他提供归属感和认可。\n\n文章强调，沉闷男人俱乐部为人们提供了一个安全且支持性的空间，让他们拥抱自己所认为的沉闷，从而培养社区意识和目标感。文章认为，颂扬平凡可以成为对抗现代生活压力的有力解药，为寻找意义和联系提供不同的视角。"
  },
  {
    "id": "44294526",
    "title": "The drawbridges come up: the dream of a interconnected context ecosystem is over",
    "url": "https://www.dbreunig.com/2025/06/16/drawbridges-go-up.html",
    "summary": "This article argues that the dream of a widely interconnected AI ecosystem, facilitated by MCPs (Machine Context Platforms), is unlikely to materialize due to platforms erecting data moats and restricting access. Drawing parallels to the Web 2.0 era, the author observes a pattern where initial openness and API availability eventually give way to tight control and limited data consumption as platforms consolidate power.\n\nThe article points out that while Web 2.0 initially promised free data exchange through APIs, dominant platforms eventually restricted access to protect their market positions. Similarly, while MCPs are envisioned to connect LLMs with various data sources and applications, platforms are already limiting access and integrations.\n\nRecent examples are cited as evidence of this trend, including Slack blocking external access to messages, X preventing LLM training using its data, Anthropic cutting access to its Claude AI model, and Google severing ties with Scale AI due to Meta's investment. These actions demonstrate a desire to protect data assets and prevent competitors from leveraging them.\n\nThe author concludes that MCPs, like Web 2.0 APIs, will likely become tightly governed tools, used primarily to support platform-specific AI services rather than fostering a truly open and interconnected AI ecosystem. While building MCPs for individual applications is worthwhile, expecting platforms to facilitate easy competition is unrealistic. The consolidation of power and the inherent value of data as a moat will likely limit the scope and accessibility of MCPs.\n",
    "chinese_title": "吊桥已升起：互联互通生态系统的梦想破灭。",
    "chinese_summary": "本文认为，由机器上下文平台（MCPs）推动的广泛互联的AI生态系统的梦想不太可能实现，原因是平台构建数据护城河并限制访问。作者将此与Web 2.0时代相提并论，观察到一种模式，即最初的开放性和API可用性最终会让位于平台的严格控制和有限的数据消费，因为平台巩固了权力。\n\n本文指出，虽然Web 2.0最初承诺通过API进行自由的数据交换，但主导平台最终限制了访问，以保护其市场地位。同样，虽然MCPs被设想为将LLM与各种数据源和应用程序连接起来，但平台已经开始限制访问和集成。\n\n最近的例子被引为这一趋势的证据，包括Slack阻止外部访问消息，X阻止LLM使用其数据进行训练，Anthropic切断对其Claude AI模型的访问，以及谷歌由于Meta的投资而与Scale AI断绝关系。这些行为表明了一种保护数据资产并防止竞争对手利用它们的愿望。\n\n作者总结说，像Web 2.0 API一样，MCPs可能会成为受到严格控制的工具，主要用于支持平台特定的AI服务，而不是促进一个真正开放和互联的AI生态系统。虽然为单个应用程序构建MCPs是有价值的，但期望平台促进轻松的竞争是不现实的。权力的巩固以及数据作为护城河的内在价值可能会限制MCPs的范围和可访问性。"
  },
  {
    "id": "44300026",
    "title": "Rules, Not Renewables, Might Explain the Iberian Blackout",
    "url": "https://spectrum.ieee.org/spain-grid-failure",
    "summary": "The EnergyNews article \"Rules, Not Renewables, Might Explain the Iberian Blackout\" suggests that the recent power outages in the Iberian Peninsula (Spain and Portugal) might not be solely attributable to renewable energy fluctuations, but rather to regulatory issues and market rules. Lucas Laursen, the author, implies that the grids of the future need to prioritize and incentivize the management of reactive power. The article highlights the potential importance of regulations in grid stability and the need to adapt these regulations to accommodate the increasing integration of renewable energy sources. The image caption also supports the point by showing how power cuts affect everyday life and local businesses.\n",
    "chinese_title": "规则，而非可再生能源，或能解释伊比利亚半岛的停电",
    "chinese_summary": "能源新闻文章《规则而非可再生能源或许能解释伊比利亚半岛停电》指出，最近伊比利亚半岛（西班牙和葡萄牙）的停电可能不仅仅归因于可再生能源的波动，而是与监管问题和市场规则有关。作者卢卡斯·劳森暗示，未来的电网需要优先考虑并激励无功功率的管理。这篇文章强调了法规在电网稳定性方面的潜在重要性，以及需要调整这些法规以适应日益增长的可再生能源接入。图片说明也支持了这一观点，展示了停电如何影响日常生活和当地企业。"
  },
  {
    "id": "44284569",
    "title": "Iron nitride permanent magnets made with DIY ball mill [video]",
    "url": "https://www.youtube.com/watch?v=M6XIgdS1rzs",
    "summary": "The provided content is not an article but rather the standard YouTube footer information. It includes typical elements found at the bottom of a YouTube webpage such as:\n\n*   Copyright information\n*   Links to contact YouTube for news/copyright issues\n*   Links for creators, advertisers, and developers\n*   Terms of service, privacy policy, and safety information\n*   An explanation of how YouTube works and opportunities to test new features\n*   A reference to NFL Sunday Ticket and Google LLC.\n\nBecause there is no actual article content concerning \"Iron nitride permanent magnets made with DIY ball mill,\" a summary related to that topic cannot be created. The title suggests a video exists, but this snippet only provides the YouTube footer. To provide a proper summary, the content of the actual video would be necessary.\n",
    "chinese_title": "自制球磨机制作氮化铁永磁体 [视频]",
    "chinese_summary": "所提供的内容并非文章，而是标准的YouTube页脚信息，包含YouTube网页底部常见的元素，例如：\n\n* 版权信息\n* 联系YouTube以获取新闻/版权问题的链接\n* 面向创作者、广告商和开发者的链接\n* 服务条款、隐私政策和安全信息\n* YouTube运作方式的说明和测试新功能的机会\n* 对NFL Sunday Ticket和Google LLC的引用。\n\n由于没有关于“用DIY球磨机制造的氮化铁永磁体”的实际文章内容，因此无法创建与该主题相关的摘要。标题表明存在视频，但此片段仅提供YouTube页脚。 要提供适当的摘要，需要实际视频的内容。"
  },
  {
    "id": "44295925",
    "title": "Fun with Telnet",
    "url": "https://brandonrozek.com/blog/fun-with-telnet/",
    "summary": "Brandon Rozek's article \"Fun with Telnet\" highlights the quirky charm of using Telnet to access various text-based services. He begins by reminiscing about discovering the Star Wars asciimation accessible via `telnet towel.blinkenlights.nl 23`, praising its entertainment value.\n\nThe article then pivots to presenting a list of other interesting Telnet addresses and their associated functions. These include:\n\n*   `freechess.org 5000`: A chess server.\n*   `mtrek.com 1701`: A space combat game inspired by Star Trek.\n*   `fibs.com 4321`: A backgammon server.\n*   `mapscii.me`: A world map (zoomable with the mouse).\n*   `telehack.com`: A simulation of Arpanet/Usenet with over 60 text-based games.\n\nRozek concludes with a word of caution, reminding readers that Telnet communication is unencrypted and plaintext, advising them to avoid transmitting sensitive information. He encourages readers to explore and enjoy the \"quirky old world of Telnet.\"\n",
    "chinese_title": "Telnet 乐趣",
    "chinese_summary": "布兰登·罗泽克的文章《Telnet的乐趣》突显了使用Telnet访问各种基于文本服务的古怪魅力。他首先回忆起发现可以通过`telnet towel.blinkenlights.nl 23`访问的星球大战ASCII动画，并赞扬其娱乐价值。\n\n然后，文章转向介绍一系列其他有趣的Telnet地址及其相关功能，包括：\n\n*   `freechess.org 5000`: 一个国际象棋服务器。\n*   `mtrek.com 1701`: 一个受《星际迷航》启发的太空战斗游戏。\n*   `fibs.com 4321`: 一个西洋双陆棋服务器。\n*   `mapscii.me`: 一个世界地图（可用鼠标缩放）。\n*   `telehack.com`: 一个模拟Arpanet/Usenet，包含超过60个基于文本的游戏。\n\n罗泽克最后提醒读者，Telnet通信是未加密的明文，建议他们避免传输敏感信息。他鼓励读者探索和享受“Telnet这个古怪的旧世界”。"
  },
  {
    "id": "44273105",
    "title": "Photon transport through the entire adult human head",
    "url": "https://www.spiedigitallibrary.org/journals/neurophotonics/volume-12/issue-02/025014/Photon-transport-through-the-entire-adult-human-head/10.1117/1.NPh.12.2.025014.full",
    "summary": "This article, \"Photon transport through the entire adult human head,\" published in Neurophotonics, investigates the limits of detecting light transmitted diametrically through the adult human head using near-infrared light. The authors explore the possibility of extending non-invasive optical brain imaging to deeper regions currently inaccessible by conventional fNIRS, such as sulci, the midbrain, and cerebellum.\n\nThe study employs both numerical simulations using Monte Carlo methods and experimental measurements using time-correlated single-photon counting (TCSPC). Simulations revealed that although light experiences extreme attenuation (around 10^18), specific photon migration pathways exist, largely guided by cerebrospinal fluid, allowing photons to traverse the head. Experiments using a pulsed laser and a highly sensitive photomultiplier tube (PMT) successfully detected photons transmitted through the entire head of a subject with fair skin and no hair, overcoming the predicted attenuation. The experimental time-of-flight distributions agreed well with simulation results.\n\nThe analysis of photon migration pathways suggests that different source positions on the head can isolate and probe specific deep brain regions. This indicates the potential of optical techniques to monitor activity in previously inaccessible brain areas. The authors conclude that detecting photons in this extreme regime can open new avenues for non-invasive brain imaging and potentially be applied to healthcare applications, such as stroke and tumor detection. This work challenges the widely held belief that diametrical photon transport in adult heads is impossible and provides a foundation for advancing optical brain imaging technologies.\n",
    "chinese_title": "光子穿过成人头部的传输",
    "chinese_summary": "\"光子在成人头部完整传输\"一文发表于Neurophotonics，探讨了使用近红外光检测光线直径穿透成人头部的极限。作者探索了将非侵入性光学脑成像扩展到传统fNIRS目前无法触及的更深层区域的可能性，例如脑沟、中脑和小脑。\n\n该研究采用了蒙特卡洛方法的数值模拟和使用时间相关单光子计数（TCSPC）的实验测量。模拟显示，尽管光线经历了极高的衰减（约为10^18），但存在特定的光子迁移路径，主要由脑脊液引导，允许光子穿过头部。实验使用脉冲激光器和高灵敏度光电倍增管（PMT），成功检测到穿透一位皮肤白皙且无头发的受试者整个头部的光子，克服了预测的衰减。实验飞行时间分布与模拟结果吻合良好。\n\n光子迁移路径分析表明，头部不同的光源位置可以隔离和探测特定的深层大脑区域。这表明光学技术有可能监测以前无法触及的大脑区域的活动。作者得出结论，在这种极端条件下检测光子可以为非侵入性脑成像开辟新途径，并可能应用于医疗保健应用，例如中风和肿瘤检测。这项工作挑战了成人头部直径光子传输是不可能的普遍观点，并为推进光学脑成像技术奠定了基础。"
  },
  {
    "id": "44294853",
    "title": "Selfish reasons for building accessible UIs",
    "url": "https://nolanlawson.com/2025/06/16/selfish-reasons-for-building-accessible-uis/",
    "summary": "Nolan Lawson's article \"Selfish Reasons for Building Accessible UIs\" argues that accessibility is not just a moral imperative, but also a practical benefit for developers themselves. Instead of focusing on the altruistic argument for inclusivity, Lawson outlines how building accessible UIs can directly improve a developer's workflow and productivity.\n\nOne key point is improved **debuggability**. Accessible HTML, utilizing semantic elements like `<table>` and ARIA roles, makes it easier to navigate and understand the DOM in DevTools, especially in complex \"div soup\" situations common with CSS-in-JS frameworks.\n\nSecondly, accessibility promotes **naming conventions and code clarity**. Using ARIA roles and attributes provides a standardized vocabulary for UI components, leading to more intuitive variable names and CSS selectors, and reducing redundant code like using both a class and an `aria-selected` attribute to indicate state.\n\nThe article also highlights the benefit of **testability**. Accessible UIs allow for more semantic and robust UI tests using methods like `getByLabel` and `getByRole`, making tests less susceptible to breakage from minor UI changes compared to relying on fragile class-based selectors.\n\nFinally, Lawson emphasizes the importance of **power user experience**. By ensuring basic keyboard accessibility (e.g., Esc to close dialogs), developers create a more efficient and enjoyable experience for themselves and other users who prefer keyboard navigation.\n\nLawson acknowledges the current state of web accessibility is poor despite developer awareness and proposes AI could potentially solve this in the future. However, until this occurs, developers should be designing for accessibility now because it not only helps users but helps them.\n",
    "chinese_title": "打造易用用户界面的自私理由",
    "chinese_summary": "诺兰·劳森的文章《构建可访问UI的自私理由》认为，可访问性不仅是一种道德要求，也是开发者自身的实际利益。劳森没有专注于包容性的利他主义论点，而是概述了构建可访问的UI如何直接提高开发者的工作流程和生产力。\n\n一个关键点是提高了**可调试性**。可访问的HTML，利用`<table>`等语义化元素和ARIA角色，使得在DevTools中更容易导航和理解DOM，尤其是在CSS-in-JS框架中常见的复杂“div汤”情况下。\n\n其次，可访问性促进了**命名约定和代码清晰度**。使用ARIA角色和属性为UI组件提供了一个标准化的词汇表，从而产生了更直观的变量名和CSS选择器，并减少了冗余代码，例如同时使用类和`aria-selected`属性来指示状态。\n\n文章还强调了**可测试性**的好处。可访问的UI允许使用`getByLabel`和`getByRole`等方法进行更语义化和更健壮的UI测试，与依赖于脆弱的基于类的选择器相比，使得测试不易受到UI微小变化的影响而中断。\n\n最后，劳森强调了**高级用户体验**的重要性。通过确保基本的键盘可访问性（例如，使用Esc键关闭对话框），开发者可以为自己和其他喜欢键盘导航的用户创造更高效和愉快的体验。\n\n劳森承认，尽管开发者意识到了这一点，但Web可访问性的现状仍然很差，并提出AI未来可能解决这个问题。但是，在此之前，开发者现在就应该设计可访问性，因为它不仅帮助用户，也帮助他们自己。"
  },
  {
    "id": "44293988",
    "title": "OpenAI wins $200M U.S. defense contract",
    "url": "https://www.cnbc.com/2025/06/16/openai-wins-200-million-us-defense-contract.html",
    "summary": "OpenAI has secured a $200 million contract with the U.S. Defense Department to provide artificial intelligence tools for national security purposes. This one-year contract marks the first such agreement listed on the department's website and falls under OpenAI's new \"OpenAI for Government\" initiative, offering custom AI models to government bodies. The focus will be on developing prototype AI capabilities to address critical national security challenges, including warfighting and administrative improvements like healthcare access for service members and streamlining data analysis. All use cases must comply with OpenAI's usage policies.\n\nThe work will primarily take place in the Washington, D.C. area, through OpenAI Public Sector LLC. This deal follows OpenAI's partnership with defense tech startup Anduril and comes after rival Anthropic announced a collaboration with Palantir and Amazon to provide AI models to U.S. defense and intelligence agencies. OpenAI CEO Sam Altman has expressed the company's commitment to engaging in national security endeavors. While representing a small portion of OpenAI's overall revenue (annualized sales exceeding $10 billion), the contract signifies a significant step in the company's expansion into the government sector. Microsoft's Azure OpenAI service has also been authorized for use with classified information by the Defense Information Systems Agency.\n",
    "chinese_title": "OpenAI 赢得 2 亿美元美国国防合同",
    "chinese_summary": "OpenAI与美国国防部签订2亿美元合同，提供人工智能工具用于国家安全目的。这份为期一年的合同是该部门网站上列出的首个此类协议，属于OpenAI新的“OpenAI for Government”计划，旨在为政府机构提供定制人工智能模型。重点将是开发原型人工智能能力，以应对关键的国家安全挑战，包括作战以及行政改进，如改善军人医疗保健服务和简化数据分析。所有用例必须符合OpenAI的使用政策。\n\n这项工作将主要在华盛顿特区地区通过OpenAI Public Sector LLC进行。此前，OpenAI与国防科技初创公司Anduril建立了合作伙伴关系，而竞争对手Anthropic也宣布与Palantir和亚马逊合作，向美国国防和情报机构提供人工智能模型。OpenAI首席执行官Sam Altman已表示公司致力于参与国家安全事业。虽然该合同仅占OpenAI总收入的一小部分（年化销售额超过100亿美元），但它标志着该公司向政府部门扩张的重要一步。微软的Azure OpenAI服务也已获得国防信息系统局授权，可用于处理机密信息。"
  },
  {
    "id": "44293358",
    "title": "Blaze (YC S24) Is Hiring",
    "url": "https://www.ycombinator.com/companies/blaze-2/jobs/dzNmNuw-junior-software-engineer",
    "summary": "Blaze, a Y Combinator (S24) backed startup building a cross-border payment app powered by USDC, is hiring a Junior Software Engineer in Mexico City. The company aims to revolutionize global payments by providing fast, low-cost transfers between the US and Latin America.\n\nThe role focuses on leveraging AI tools to accelerate the development of Blaze's payment platform. Key responsibilities include using AI (Cursor, code generation) to design and implement frontend (React, React Native) and backend (NodeJS) features, debugging issues, collaborating on secure and scalable code, and contributing to system design with AI-enhanced solutions.\n\nIdeal candidates should be graduating seniors or recent graduates with a strong grasp of JavaScript, CSS, and modern web technologies. Experience with React, React Native, or similar frameworks is required. Proficiency in AI-driven development tools and effective prompting techniques is crucial. A portfolio showcasing past projects, especially those using AI, is mandatory.\n\nBlaze offers competitive compensation (MX$200,000 per year plus equity), a chance to work directly with the founders, a supportive environment, and the opportunity to make a tangible impact on a high-growth startup. They're looking for someone passionate about fintech, solving real-world problems, and utilizing AI to achieve 10x development speed.\n",
    "chinese_title": "Blaze (YC S24) 正在招聘",
    "chinese_summary": "Blaze（Y Combinator S24孵化项目），一家基于USDC的跨境支付应用初创公司，正在墨西哥城招聘初级软件工程师。该公司旨在通过提供美国和拉丁美洲之间快速、低成本的转账来革新全球支付。\n\n该职位侧重于利用人工智能工具加速Blaze支付平台的开发。主要职责包括使用人工智能（Cursor、代码生成）来设计和实现前端（React、React Native）和后端（NodeJS）功能，调试问题，协作编写安全且可扩展的代码，以及通过人工智能增强的解决方案为系统设计做出贡献。\n\n理想的候选人应为应届毕业生或近期毕业生，并精通JavaScript、CSS和现代Web技术。需要具备React、React Native或类似框架的经验。熟练掌握人工智能驱动的开发工具和有效的提示技巧至关重要。必须提供展示以往项目的作品集，尤其是使用人工智能的项目。\n\nBlaze提供有竞争力的薪酬（每年20万墨西哥比索加上股权），与创始人直接合作的机会，支持性的环境，以及在一个高增长的初创公司中产生实际影响的机会。他们正在寻找对金融科技充满热情、解决现实世界问题并利用人工智能实现10倍开发速度的人。"
  },
  {
    "id": "44299930",
    "title": "What I Wish Someone Told Me When I Was Getting into ARIA",
    "url": "https://www.smashingmagazine.com/2025/06/what-i-wish-someone-told-me-aria/",
    "summary": "This article, \"What I Wish Someone Told Me When I Was Getting into ARIA,\" provides a foundational understanding of ARIA (Accessible Rich Internet Applications) for web accessibility. It emphasizes that ARIA should be used when native HTML elements and attributes are insufficient to communicate interactivity, purpose, and state to assistive technologies.\n\nThe author highlights key aspects of ARIA, including its history, reflecting operating system interaction paradigms from the early 2000s, and its ongoing evolution with new versions and HTML advancements. Key concepts covered include roles (semantics that assistive technology reads), states, and properties, which provide descriptions and characteristics of elements.\n\nThe article underscores the five golden rules of ARIA: prefer native elements, don't adjust native element semantics unnecessarily, ensure keyboard operability, avoid hiding focusable elements, and name interactive elements. It also explains how to declare ARIA attributes and the importance of understanding the ARIA taxonomy to ensure correct usage. The author notes that ARIA states and properties are often applied dynamically through JavaScript, rather than being hardcoded. The article concludes by emphasizing that adding an explicit ARIA role to an HTML element that implicitly has that role is unnecessary and doesn't increase accessibility.\n",
    "chinese_title": "当初我刚接触ARIA时，真希望有人告诉我的那些事",
    "chinese_summary": "《如果当初有人这样告诉我 ARIA 的知识就好了》一文，提供了关于 Web 无障碍环境的 ARIA（无障碍富互联网应用）基础知识。它强调，当原生 HTML 元素和属性不足以向辅助技术传达交互性、目的和状态时，才应使用 ARIA。\n\n作者重点介绍了 ARIA 的关键方面，包括其历史，反映了 21 世纪初的操作系统的交互模式，以及它随着新版本和 HTML 进步而不断发展。涵盖的关键概念包括角色（辅助技术读取的语义）、状态和属性，它们提供了元素的描述和特征。\n\n这篇文章强调了 ARIA 的五条黄金法则：首选原生元素、不要不必要地调整原生元素语义、确保键盘可操作性、避免隐藏可聚焦元素，以及命名交互式元素。它还解释了如何声明 ARIA 属性以及理解 ARIA 分类法以确保正确使用的重要性。作者指出，ARIA 状态和属性通常通过 JavaScript 动态应用，而不是硬编码。文章最后强调，向已经隐式具有该角色的 HTML 元素添加显式的 ARIA 角色是不必要的，也不会提高可访问性。"
  },
  {
    "id": "44293147",
    "title": "Show HN: Nexus.js - Fabric.js for 3D",
    "url": "https://punk.cam/lab/nexus",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "Show HN: Nexus.js - 3D 版 Fabric.js",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "44300906",
    "title": "The official report on the blackout in Spain and Portugal was just released",
    "url": "https://bsky.app/profile/aukehoekstra.bsky.social/post/3lrsvpse6ns2i",
    "summary": "The official report on a blackout in Spain and Portugal has been released. According to a post by Auke Hoekstra on Bluesky, the report's key findings indicate that conventional power plants failed to control the voltage as intended. This over-voltage then triggered renewable energy sources to shut down as per their programmed safety mechanisms. In short, voltage control issues from conventional power plants led to renewables turning off and exacerbating the blackout.\n",
    "chinese_title": "关于西班牙和葡萄牙停电的官方报告已发布。",
    "chinese_summary": "西班牙和葡萄牙停电官方报告已发布。根据Auke Hoekstra在Bluesky上发布的帖子，报告的主要发现表明，传统发电厂未能按预期控制电压。这种过电压随后触发了可再生能源按照其预设的安全机制关闭。简而言之，传统发电厂的电压控制问题导致可再生能源关闭，加剧了停电。"
  },
  {
    "id": "44289412",
    "title": "WhatsApp introduces ads in its app",
    "url": "https://www.nytimes.com/2025/06/16/technology/whatsapp-ads.html",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "WhatsApp 应用引入广告",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "44268345",
    "title": "Natural rubber with high resistance to  crack growth",
    "url": "https://www.nature.com/articles/s41893-025-01559-z.epdf?sharing_token=SST16F7yBaUkRDb702ZphtRgN0jAjWel9jnR3ZoTv0P9y52VPdTYScQoHBinE3JzdSvQ1aN3fhS4SSECYXRnvZ77nkrWJA2412S2E-26Il-ncine3ET1t1GzNaX2Oo2cK9GYzFNCrKSRycPCrQKJZ8QvfBeSTNR5d12_ZHLvyYkt26oAnSVTBuopgCE4tHIVPnWtjLZS3OhBz1H2OhtXQMmNFMhf-2lYu5vkTl596uaKjxxqTFBbSZj1phjSIDRELkwyRfUsM77Gu7S0VF_fPvJZAYxvV_2Hduld7MbfF1M4RO8vHe5OtCz383c2iHBjxkZ4gU59FErIjNBnLDPDT79Jaj04hbpqLWqUoVxoYCs%3D",
    "summary": "The Nature Sustainability article focuses on developing natural rubber (NR) with significantly enhanced resistance to crack growth, a critical property for its use in high-performance applications like tires. Current NR, while naturally strong and elastic, suffers from crack propagation, limiting its durability.\n\nThe researchers achieved this improved resistance by manipulating the polymer network structure of the NR at the molecular level. They introduced specific types of chemical cross-links that can selectively break and reform under stress. This dynamic cross-linking dissipates energy at the crack tip, hindering its propagation.\n\nThe key innovation lies in incorporating urethane bonds into the rubber network, which act as these reversible, stress-responsive linkages. These bonds can break and reform, allowing the material to deform and relieve stress concentration at the crack tip without leading to catastrophic failure.\n\nThe resulting modified NR exhibited significantly improved crack growth resistance compared to conventional NR. The researchers demonstrated that this enhanced resistance translates to increased tire lifespan and improved performance. This development could potentially reduce reliance on synthetic rubber, contributing to a more sustainable and environmentally friendly tire industry. The research highlights the potential of bio-based materials to outperform synthetic alternatives through advanced material design and molecular engineering.\n",
    "chinese_title": "高抗裂纹扩展的天然橡胶",
    "chinese_summary": "《自然·可持续性》杂志上发表的文章重点介绍了开发具有显著增强的抗裂纹扩展能力的天然橡胶（NR），这是其应用于轮胎等高性能应用的关键特性。目前的天然橡胶虽然天然强度高且富有弹性，但存在裂纹扩展的问题，限制了其耐久性。\n\n研究人员通过在分子水平上操纵天然橡胶的聚合物网络结构，实现了这种改进的抗裂纹扩展能力。他们引入了特定类型的化学交联，这些交联可以在应力作用下选择性地断裂和重组。这种动态交联会耗散裂纹尖端的能量，从而阻止其扩展。\n\n关键创新在于将氨基甲酸酯键纳入橡胶网络中，这些键充当可逆的、对应力敏感的连接。这些键可以断裂和重组，使材料能够变形并缓解裂纹尖端的应力集中，而不会导致灾难性失效。\n\n与传统天然橡胶相比，由此产生的改性天然橡胶表现出显著改善的抗裂纹扩展能力。研究人员证明，这种增强的抗性可以转化为更长的轮胎寿命和改进的性能。这项发展可能会减少对合成橡胶的依赖，从而有助于建立一个更可持续和环保的轮胎行业。该研究强调了通过先进的材料设计和分子工程，生物基材料具有超越合成替代品的潜力。"
  },
  {
    "id": "44291204",
    "title": "Open-Source RISC-V: Energy Efficiency of Superscalar, Out-of-Order Execution",
    "url": "https://arxiv.org/abs/2505.24363",
    "summary": "This paper, \"Ramping Up Open-Source RISC-V Cores: Assessing the Energy Efficiency of Superscalar, Out-of-Order Execution,\" explores the performance and energy efficiency of different RISC-V core microarchitectures. The authors focus on addressing adoption challenges of high-performance open-source RISC-V cores, particularly those developed in Chisel or using proprietary interfaces.\n\nThe work presents a modified, fully RISC-V standard-compliant version of the XuanTie C910 out-of-order (OoO) core and CVA6S+, an enhanced, dual-issue version of the open-source CVA6 core. CVA6S+ demonstrates a 34.4% performance improvement over the original CVA6.\n\nA comprehensive analysis compares the performance, area, power, and energy of the C910 (superscalar, OoO), CVA6S+ (superscalar, in-order), and CVA6 (single-issue, in-order) cores within the Cheshire open-source SoC, all implemented in 22nm technology. The results confirm the expected area and performance trends: CVA6S+ exhibits a small area increase and moderate IPC improvement, while C910 shows a larger area increase and significant IPC boost.\n\nCrucially, the efficiency analysis reveals that CVA6S+ leads in area efficiency (GOPS/mm2), while C910 is highly competitive in energy efficiency (GOPS/W). This finding challenges the common assumption that superscalar, out-of-order cores are inherently less energy-efficient, suggesting that optimized implementations can achieve high performance without a prohibitive energy cost. The study uses identical technology, tools, and methodologies to ensure a fair comparison across different microarchitectures using the same ISA and SoC.\n",
    "chinese_title": "开源RISC-V：超标量乱序执行的能效",
    "chinese_summary": "加速开源RISC-V内核：评估超标量乱序执行的能效"
  },
  {
    "id": "44300727",
    "title": "Tesla Robotaxi launch is a dangerous game of smoke and mirrors",
    "url": "https://electrek.co/2025/06/16/tesla-robotaxi-launch-dangerous-game-smoke-mirrors/",
    "summary": "Fred Lambert's Electrek article argues that Tesla's upcoming Robotaxi launch in Austin, Texas, is a \"dangerous game of smoke and mirrors.\" The author claims Elon Musk has consistently missed deadlines and made false promises regarding full self-driving capabilities. While Musk claims Tesla is \"paranoid with safety,\" Lambert suggests the launch is primarily for optics to maintain the illusion that Tesla leads in autonomous driving, especially as Waymo expands its services.\n\nThe article highlights several issues: Tesla's \"robotaxi\" is a geo-fenced and teleoperated system, a departure from the promised unsupervised self-driving for all Tesla vehicles since 2016. This contradicts Musk's previous statements that geofencing negates true self-driving. Testing has been minimal compared to Waymo's extensive trials, and the use of \"safety passengers\" with kill switches raises concerns about transparency and actual autonomous capability.\n\nLambert points to a crowdsourced dataset indicating a high risk of disengagements with Tesla's latest hardware. He criticizes Tesla for actively fighting access to self-driving crash data and highlights The Dawn Project's demonstration of Tesla vehicles failing to stop for school buses. The author expresses concern about the safety of the launch and suggests Tesla should market its FSD as a regular ADAS system instead. Ultimately, Lambert questions whether Musk will delay the launch or proceed with a potentially dangerous service, given the lack of regulatory oversight.\n",
    "chinese_title": "特斯拉Robotaxi发布是一场危险的障眼法游戏",
    "chinese_summary": "弗雷德·兰伯特的Electrek文章认为，特斯拉即将在德克萨斯州奥斯汀推出的Robotaxi是一场“危险的障眼法游戏”。作者声称，埃隆·马斯克一再错过最后期限，并对完全自动驾驶能力做出虚假承诺。尽管马斯克声称特斯拉“对安全非常谨慎”，但兰伯特认为，此次发布主要是为了维持特斯拉在自动驾驶领域领先的假象，尤其是在Waymo扩大其服务之际。\n\n文章强调了几个问题：特斯拉的“robotaxi”是一个地理围栏和远程操作的系统，这与自2016年以来承诺的所有特斯拉车辆的无监督自动驾驶背道而驰。这与马斯克之前关于地理围栏否定真正自动驾驶的说法相矛盾。与Waymo的大规模试验相比，测试非常少，而且使用带有紧急停止开关的“安全乘客”引起了人们对透明度和实际自主能力的担忧。\n\n兰伯特指出一个众包数据集表明，特斯拉最新的硬件存在很高的脱离风险。他批评特斯拉积极阻止获取自动驾驶事故数据，并强调了“黎明计划”演示特斯拉车辆未能为校车停车。作者对此次发布的安全性表示担忧，并建议特斯拉应将其FSD作为常规ADAS系统进行销售。最终，鉴于缺乏监管，兰伯特质疑马斯克是否会推迟发布，或者继续提供一项可能存在危险的服务。"
  },
  {
    "id": "44284877",
    "title": "How Frogger 2’s source code was recovered from a destroyed tape [video]",
    "url": "https://www.youtube.com/watch?v=lvEO4IaEJlw",
    "summary": "The YouTube video \"How Frogger 2’s source code was recovered from a destroyed tape\" likely details the process and methods used to retrieve the original source code for the video game Frogger 2. While the provided content is primarily boilerplate YouTube information (copyright, advertising, privacy, etc.) and doesn't offer specifics about the recovery, the title suggests the core narrative focuses on overcoming significant data loss challenges.\n\nThe recovery likely involved sophisticated techniques to read data from a physically damaged or corrupted magnetic tape. This could encompass:\n\n* **Physical tape repair:** Attempts to mend or reconstruct damaged sections of the tape.\n* **Specialized hardware:** Utilizing equipment designed to extract data from deteriorated or unconventional tape formats.\n* **Data analysis and reconstruction:** Applying algorithms and software to identify and piece together fragmented or distorted data segments into coherent code.\n\nThe success of such a recovery would be a significant achievement, preserving a piece of video game history and enabling potential future study, preservation, or even restoration and improvement of the game.\n",
    "chinese_title": "从损毁磁带中恢复《青蛙过河2》源代码的始末[视频]",
    "chinese_summary": "YouTube视频“青蛙过河2源代码如何从毁坏的磁带中恢复”可能详细介绍了检索视频游戏《青蛙过河2》原始源代码的过程和方法。虽然提供的内容主要为YouTube的通用信息（版权、广告、隐私等），并未提供关于恢复的具体细节，但标题表明核心叙事侧重于克服重大数据丢失的挑战。\n\n该恢复工作可能涉及从物理损坏或损坏的磁带中读取数据的复杂技术。这可能包括：\n\n* **物理磁带修复：** 尝试修复或重建磁带的损坏部分。\n* **专用硬件：** 利用旨在从退化的或非常规磁带格式中提取数据的设备。\n* **数据分析和重建：** 应用算法和软件来识别并将碎片化或扭曲的数据段拼接成连贯的代码。\n\n这种恢复的成功将是一项重大成就，可以保存一段电子游戏历史，并有助于未来对该游戏进行研究、保存，甚至恢复和改进。"
  },
  {
    "id": "44294633",
    "title": "Generative AI coding tools and agents do not work for me",
    "url": "https://blog.miguelgrinberg.com/post/why-generative-ai-coding-tools-and-agents-do-not-work-for-me",
    "summary": "In a blog post from June 14, 2025, Miguel Grinberg explains why generative AI coding tools and agents don't work for him. He argues that these tools don't increase his speed or productivity, which is his primary concern. He emphasizes that he must thoroughly review any AI-generated code before incorporating it into his projects to ensure he understands it and can maintain it, a process that takes as long as writing the code himself. He believes blindly using AI-generated code without review is irresponsible due to potential malfunctions and his ultimate responsibility for the code.\n\nGrinberg disputes the idea that AI coding tools are a multiplier or enabler, claiming those who say so often skip or lightly review AI-generated code, which he deems unacceptable. He enjoys learning new languages and technologies and doesn't want to delegate that to AI.\n\nHe acknowledges that open-source contributions require rigorous review but values the interactions and ideas they bring. He also rejects the analogy of treating AI coding tools as interns, because interns learn and improve over time, whereas AI doesn't.\n\nIn conclusion, Grinberg believes that those who claim AI makes them faster are likely relaxing their quality standards, or have a vested interest in promoting AI.\n",
    "chinese_title": "生成式AI编码工具和代理对我没用。",
    "chinese_summary": "2025年6月14日，米格尔·格林贝格在一篇博文中解释了为何生成式AI编码工具和代理不适用于他。他认为这些工具并没有提高他的速度或生产力，而这才是他主要关注的。他强调，在将任何AI生成的代码整合到他的项目中之前，他必须彻底审查，以确保他理解代码并能维护它，而这个过程和他自己编写代码一样耗时。他认为，盲目使用未经审查的AI生成的代码是不负责任的，因为存在潜在的故障，并且他最终要对代码负责。\n\n格林贝格反驳了AI编码工具是倍增器或赋能器的说法，他声称那些这样说的人常常跳过或轻描淡写地审查AI生成的代码，他认为这是不可接受的。他享受学习新语言和新技术的乐趣，不想将这些任务委托给AI。\n\n他承认开源贡献需要严格的审查，但他重视它们带来的互动和想法。他还反对将AI编码工具比作实习生的类比，因为实习生会随着时间推移学习和进步，而AI不会。\n\n总而言之，格林贝格认为，那些声称AI使他们速度更快的人，可能是在放松他们的质量标准，或者是在推广AI方面有既得利益。"
  },
  {
    "id": "44295667",
    "title": "Show HN: I recreated 90s Mode X demoscene effects in JavaScript and Canvas",
    "url": "https://jdfio.com/pages-output/demos/x-mode/",
    "summary": "This \"Show HN\" submission highlights a project where the author recreated demoscene effects popular in the 1990s, specifically those achieved using the \"Mode X\" graphics mode, within a modern web browser. The effects were implemented using JavaScript and the HTML5 Canvas element. The key takeaway is the technical achievement of porting these retro graphics techniques to a web-based environment using readily available web technologies. The accompanying text is a disclaimer, warning users that the demo relies on the canvas and JavaScript, and will not function if these are unsupported or disabled.\n",
    "chinese_title": "展示 HN: 我用 JavaScript 和 Canvas 重现了 90 年代的 Mode X 演示场景特效",
    "chinese_summary": "这个“Show HN”提交展示了一个项目，作者在现代网络浏览器中重现了 20 世纪 90 年代流行的 Demoscene 特效，特别是那些使用“Mode X”图形模式实现的效果。 这些特效是使用 JavaScript 和 HTML5 Canvas 元素实现的。 主要亮点是将这些复古图形技术移植到基于网络的现代环境，并使用现成的 Web 技术所取得的技术成就。 随附的文本是一份免责声明，警告用户该演示依赖于 canvas 和 JavaScript，如果这些不支持或被禁用，将无法运行。"
  },
  {
    "id": "44288937",
    "title": "Working on databases from prison",
    "url": "https://turso.tech/blog/working-on-databases-from-prison",
    "summary": "Preston Thorpe, currently incarcerated, landed a software engineering job at Turso, a company working on a new SQLite implementation, a dream come true given his unusual circumstances. He attributes this opportunity to his hard work, determination, and the Maine Dept of Corrections' remote work program.\n\nThorpe's journey began with a second chance, enrolling in a prison college program with limited internet access, reigniting his passion for programming. He immersed himself in open-source contributions and landed a job at Unlocked Labs, building educational solutions for incarcerated learners, eventually leading their development team.\n\nHe discovered Turso's Project Limbo on Hacker News and began contributing, driven by a desire to learn about storage engines and motivated by the opportunity to work on such an ambitious project. His contributions caught the attention of Turso's founders, leading to a full-time job offer.\n\nThorpe expresses gratitude for the opportunity, especially considering his past choices involving drugs that led to his incarceration. He aims to be an example of what can be achieved with hard work and discipline, acknowledging the support from the Maine Dept of Corrections, Unlocked Labs, Turso, his family, and companies with fair chance hiring policies. Despite a recent setback regarding his release date, he views this as an opportunity to focus on his career at Turso.\n",
    "chinese_title": "在监狱里操作数据库",
    "chinese_summary": "目前在狱服刑的普雷斯顿·索普在Turso公司找到了一份软件工程师的工作，该公司正在开发一种新的SQLite实现方案。考虑到他非同寻常的处境，这真是一个梦想成真的机会。他将这个机会归功于他的努力、决心以及缅因州惩教部门的远程工作计划。\n\n索普的旅程始于第二次机会，他参加了一个监狱学院项目，虽然互联网接入有限，但重新燃起了他对编程的热情。他全身心投入到开源贡献中，并在Unlocked Labs找到了一份工作，为被监禁的学习者构建教育解决方案，最终领导了他们的开发团队。\n\n他在Hacker News上发现了Turso的Project Limbo并开始贡献代码，这源于他渴望学习存储引擎，并受到有机会参与如此雄心勃勃的项目所激励。他的贡献引起了Turso创始人的注意，最终获得了一份全职工作。\n\n索普对这个机会表示感谢，特别是考虑到他过去因毒品而入狱的经历。他希望成为一个通过努力和纪律就能取得成就的榜样，并感谢缅因州惩教部门、Unlocked Labs、Turso、他的家人以及具有公平就业机会政策的公司的支持。尽管最近他的获释日期有所推迟，但他认为这是一个专注于他在Turso的职业生涯的机会。"
  },
  {
    "id": "44281540",
    "title": "ZX Spectrum graphics magic",
    "url": "https://zxonline.net/zx-spectrum-graphics-magic-the-basics-every-spectrum-fan-should-know/",
    "summary": "This article dives into the intricacies of ZX Spectrum graphics, explaining how the classic computer draws on its screen. It starts by outlining the screen's structure, comprised of a pixel area and an attribute area. The pixel area stores on/off data for individual pixels (INK or PAPER color), while the attribute area governs the colors and effects (BRIGHT/FLASH) for 8x8 pixel blocks. This attribute block system introduces the \"Attribute Clash,\" a visual artifact where sprite colors change based on underlying block attributes.\n\nThe article then details how to draw a colored pixel, requiring manipulation of both pixel and attribute memory. The crucial aspect is understanding the Spectrum's peculiar memory layout, where pixel rows are not sequential. A specific formula is provided (in both Javascript and Z80 Assembly) to calculate the byte address for a given pixel's coordinates (X, Y) within the pixel memory, which starts at address $4000. It also explains how to find and modify the corresponding bit within that byte to \"turn on\" the pixel. The attribute byte address is calculated using a simpler formula starting at address $5800.\n\nFinally, the article extends this knowledge to drawing an 8x8 character, which is stored as a sequence of eight bytes, each representing a row. Drawing the character involves calculating the base pixel address and writing each row's byte, considering the 256-byte offset between consecutive rows. The attribute is applied to the entire 8x8 block for color and effects.\n",
    "chinese_title": "ZX Spectrum 图形魔术",
    "chinese_summary": "本文深入探讨了ZX Spectrum图形的复杂性，解释了这款经典计算机如何在屏幕上进行绘制。文章首先概述了屏幕的结构，由像素区域和属性区域组成。像素区域存储单个像素的开/关数据（墨水色或纸张色），而属性区域控制着8x8像素块的颜色和效果（亮度/闪烁）。这种属性块系统引入了“属性冲突”，这是一种视觉伪像，其中精灵的颜色会根据底层块属性而改变。\n\n文章随后详细介绍了如何绘制一个彩色像素，这需要同时操作像素和属性内存。关键在于理解Spectrum独特的内存布局，其中像素行不是连续的。文章提供了一个具体的公式（以Javascript和Z80汇编两种语言），用于计算给定像素坐标（X，Y）在像素内存中的字节地址，该地址从$4000开始。文章还解释了如何找到并修改该字节中的相应位来“打开”该像素。属性字节地址则使用一个更简单的公式来计算，从地址$5800开始。\n\n最后，文章将这一知识扩展到绘制一个8x8字符，该字符存储为八个字节的序列，每个字节代表一行。绘制字符涉及到计算基本像素地址，并写入每一行的字节，同时考虑到连续行之间的256字节偏移。属性被应用于整个8x8块，用于颜色和效果。"
  },
  {
    "id": "44290331",
    "title": "OpenTelemetry for Go: Measuring overhead costs",
    "url": "https://coroot.com/blog/opentelemetry-for-go-measuring-the-overhead/",
    "summary": "This blog post by Nikolay Sivko discusses using OpenTelemetry with Go to understand the overhead costs associated with instrumenting applications for observability. While the title focuses on OpenTelemetry in Go, the actual content pertains to using OpenTelemetry in a Kubernetes environment where GPU resources are being utilized. The central theme revolves around the importance of measuring and understanding the performance impact of added observability tooling.\n\nThe author emphasizes that while observability tools like OpenTelemetry provide valuable insights, they inherently introduce overhead in terms of CPU usage, memory consumption, and latency. Understanding and quantifying this overhead is crucial for balancing the benefits of observability against the potential performance degradation of the application.\n\nSpecifically, the post likely details techniques for measuring the impact of OpenTelemetry's instrumentation, perhaps through benchmarking or performance profiling. This would involve comparing the application's performance with and without OpenTelemetry enabled, to determine the cost associated with tracing, metrics collection, and logging.\n\nThe context of GPUs on Kubernetes suggests that the author likely investigated how OpenTelemetry impacts GPU-intensive workloads, where performance is often paramount. This would involve considering factors like the overhead of tracing GPU operations and the impact on overall GPU utilization.\n\nIn essence, the article advocates for a data-driven approach to observability, where the benefits are weighed against the measurable costs to ensure that the instrumentation doesn't inadvertently hinder the performance of the observed system.\n",
    "chinese_title": "Go的OpenTelemetry：衡量开销成本",
    "chinese_summary": "Nikolay Sivko的这篇博文探讨了使用OpenTelemetry和Go来了解为可观测性工具检测应用程序所带来的额外开销。虽然标题侧重于Go中的OpenTelemetry，但实际内容涉及在利用GPU资源的Kubernetes环境中使用OpenTelemetry。中心主题围绕测量和理解增加的可观测性工具对性能的影响的重要性。\n\n作者强调，虽然像OpenTelemetry这样的可观测性工具提供了有价值的见解，但它们固有地会引入CPU使用率、内存消耗和延迟方面的开销。理解和量化这种开销对于平衡可观测性的好处与应用程序潜在的性能下降至关重要。\n\n具体而言，这篇文章可能详细介绍了测量OpenTelemetry检测影响的技术，也许通过基准测试或性能分析。这将涉及比较启用和未启用OpenTelemetry的应用程序性能，以确定与跟踪、指标收集和日志记录相关的成本。\n\nKubernetes上的GPU上下文表明，作者可能调查了OpenTelemetry如何影响GPU密集型工作负载，在这种工作负载中，性能通常至关重要。这将涉及考虑跟踪GPU操作的开销以及对整体GPU利用率的影响等因素。\n\n本质上，这篇文章提倡一种数据驱动的可观测性方法，在这种方法中，权衡收益与可衡量的成本，以确保检测不会无意中阻碍被观测系统的性能。"
  },
  {
    "id": "44288377",
    "title": "Snorting the AGI with Claude Code",
    "url": "https://kadekillary.work/blog/#2025-06-16-snorting-the-agi-with-claude-code",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "用Claude代码吸食AGI",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "44268559",
    "title": "Jacob's Phone Simulator",
    "url": "https://jacobfilipp.com/phone/",
    "summary": "This article introduces \"Jacob's Phone Simulator,\" created by Jacob on June 13, 2025. The simulator is designed to replicate Jacob's personal phone browsing experience, offering a tool for web designers. Jacob hopes it will aid them in ensuring their websites are readable and accessible to a diverse range of users, acknowledging that people use phones in different ways. The simulator utilizes the backspace button for navigation. He attributes the inspiration for the project to his own \"crappy phone,\" affectionately nicknamed \"Mr. Crackles.\" In essence, it's a personal project aimed at improving web accessibility based on the creator's own experiences and challenges.\n",
    "chinese_title": "雅各布手机模拟器",
    "chinese_summary": "本文介绍雅各布于2025年6月13日创建的“雅各布手机模拟器”。该模拟器旨在重现雅各布的个人手机浏览体验，为网页设计师提供一种工具。雅各布希望它能帮助他们确保网站对不同用户群体的可读性和可访问性，承认人们使用手机的方式各不相同。该模拟器使用退格键进行导航。他将该项目的灵感归功于他自己的“破手机”，昵称为“噼啪先生”。 本质上，这是一个旨在根据创作者自身的经验和挑战来改进网页可访问性的个人项目。"
  },
  {
    "id": "44293044",
    "title": "Retrobootstrapping Rust for some reason",
    "url": "https://graydon2.dreamwidth.org/317484.html",
    "summary": "This is not an article, it's a CAPTCHA prompt presented after someone has been flagged for potentially automated or suspicious activity. The title \"Retrobootstrapping Rust for some reason\" is likely unrelated and may be either a red herring or the context for the activity that triggered the CAPTCHA.\n\nThe main point is that the user needs to complete the CAPTCHA to validate their requests and proceed. There's no information about retrobootstrapping Rust or any other technical details beyond the fact that the user triggered a security measure designed to distinguish humans from bots.\n",
    "chinese_title": "出于某种原因的 Rust 逆向引导",
    "chinese_summary": "这并非一篇文章，而是在某人因可能存在的自动化或可疑行为而被标记后显示的验证码提示。\"Retrobootstrapping Rust for some reason\" 标题可能无关，要么是干扰项，要么是触发验证码活动的相关背景。\n\n重点是用户需要完成验证码验证才能验证其请求并继续。没有关于 retrobootstrapping Rust 或任何其他技术细节的信息，只有用户触发了一项旨在区分人类与机器人的安全措施这一事实。"
  },
  {
    "id": "44292601",
    "title": "Breaking Quadratic Barriers: A Non-Attention LLM for Ultra-Long Context Horizons",
    "url": "https://arxiv.org/abs/2506.01963",
    "summary": "This arXiv preprint, submitted on May 9, 2025, presents a novel non-attention-based architecture for large language models (LLMs) designed to handle ultra-long context windows, potentially up to millions of tokens. Titled \"Breaking Quadratic Barriers: A Non-Attention LLM for Ultra-Long Context Horizons,\" the paper addresses the limitations of traditional Transformer models, which suffer from quadratic memory and computation demands due to the self-attention mechanism.\n\nThe proposed model avoids token-to-token attention altogether, instead employing a combination of complementary components:\n\n*   **State Space Blocks (inspired by S4):** These learn continuous-time convolution kernels, scaling nearly linearly with sequence length.\n*   **Multi-Resolution Convolution Layers:** These capture local context at different dilation levels.\n*   **Lightweight Recurrent Supervisor:** This maintains a global hidden state across sequential chunks of the input.\n*   **Retrieval Augmented External Memory:** This stores and retrieves high-level chunk embeddings without reintroducing quadratic operations.\n\nThe authors, Andrew Kiruluta and Preethi Raju, aim to overcome the quadratic scaling issue associated with attention, enabling LLMs to process significantly longer sequences. The paper is categorized under Machine Learning (cs.LG) and Computation and Language (cs.CL).\n",
    "chinese_title": "打破二次方壁垒：用于超长上下文的非注意力LLM",
    "chinese_summary": "打破二次方壁垒：用于超长上下文范围的非注意力LLM\n\n这篇提交于2025年5月9日的arXiv预印本提出了一种用于大型语言模型(LLMs)的新型非注意力架构，旨在处理超长上下文窗口，潜在地可达数百万个token。 该论文名为“打破二次方壁垒：用于超长上下文范围的非注意力LLM”，它解决了传统Transformer模型的局限性，这些模型因自注意力机制而遭受二次方级别的内存和计算需求。\n\n所提出的模型完全避免了token到token的注意力机制，而是采用互补组件的组合：\n\n*   **状态空间块 (灵感来自S4)：** 这些学习连续时间卷积核，序列长度几乎呈线性缩放。\n*   **多分辨率卷积层：** 这些捕获不同扩张级别的局部上下文。\n*   **轻量级循环监督器：** 这在输入的连续块中维护全局隐藏状态。\n*   **检索增强型外部记忆：** 这存储和检索高级块嵌入，而不会重新引入二次方运算。\n\n作者Andrew Kiruluta和Preethi Raju的目标是克服与注意力相关的二次方缩放问题，从而使LLM能够处理明显更长的序列。 该论文被归类为机器学习 (cs.LG) 和计算与语言 (cs.CL)。"
  },
  {
    "id": "44299970",
    "title": "Why JPEGs Still Rule the Web After 30 Years (2024)",
    "url": "https://spectrum.ieee.org/jpeg-image-format-history",
    "summary": "Ernie Smith, editor of Tedium, argues that JPEGs have remained the dominant image format on the web for 30 years due to a combination of factors. While the article doesn't explicitly state *what* those factors are (the summary is only from the title and introductory paragraph), we can infer a few potential reasons:\n\n*   **Historical Dominance:** The JPEG's early adoption cemented its position as the standard for digital photos.\n*   **Ease of Sharing:** Its widespread support and relatively small file size made it easy to share images online.\n*   **Longevity:** Thirty years is a long time in internet years, and the JPEG's established ecosystem creates inertia.\n\nThe article likely explores these factors in more detail, delving into the JPEG's technical advantages (at least initially), its impact on the development of the internet, and perhaps even the challenges it faces from newer image formats. The \"long tail\" focus of Tedium suggests the article might also examine the underlying reasons why a seemingly outdated technology has managed to persist in the face of innovation. The article emphasizes the simple fact that the JPEG format remains widely used after a substantial amount of time, implying successful and stable image sharing.\n",
    "chinese_title": "为什么三十年后JPEG仍然统治网络（2024）",
    "chinese_summary": "Tedium编辑Ernie Smith认为，JPEG之所以能在网络上保持30年的主导地位，是多种因素共同作用的结果。虽然文章并未明确指出这些因素 *是* 什么（摘要仅来自标题和介绍性段落），但我们可以推断出几个潜在原因：\n\n*   **历史优势：** JPEG的早期采用巩固了其作为数字照片标准的地位。\n*   **易于分享：** 其广泛的支持和相对较小的文件大小使其易于在线分享图像。\n*   **持久性：** 三十年在互联网时代是很长的时间，JPEG已建立的生态系统产生了惯性。\n\n文章可能更详细地探讨这些因素，深入研究JPEG的技术优势（至少最初是这样）、它对互联网发展的影响，甚至可能探讨它面临的来自较新图像格式的挑战。 Tedium的“长尾”关注点表明，文章可能还会考察为什么一种看似过时的技术能够在面对创新时仍然能够持续存在的根本原因。文章强调了JPEG格式在经历了相当长的时间后仍然被广泛使用这一简单事实，暗示着成功且稳定的图像共享。"
  },
  {
    "id": "44275014",
    "title": "Occurences of swearing in the Linux kernel source code over time",
    "url": "https://www.vidarholen.net/contents/wordcount/#fuck*,shit*,damn*,idiot*,retard*,crap*",
    "summary": "This article presents a tool that analyzes the Linux kernel source code to count the occurrences of specific words, names, or functions. Users can input a comma-separated list of terms to search for, using wildcards and logical OR operators for more flexible queries. The analysis is case-insensitive, considers accents, and defines a word as a sequence of alphanumeric characters and underscores.\n\nThe article provides examples of categories that can be searched for, including swear words, mentions of companies, people's names, filesystems, expressions of love and hate, references to boolean values, 64-bit architectures, instances of \"garbage,\" \"hacks,\" and \"*nix\"-related terms.\n\nThe output is displayed in graphs. If Javascript is enabled, users can view interactive graphs. Otherwise, a static PNG image displaying outdated data is shown. The tool allows users to explore the frequency of specific terms within the vast Linux kernel source code and, implicitly, track trends over time if historical data is available and comparable. The author also promotes other \"fun stuff\" they've created.\n",
    "chinese_title": "Linux内核源代码中脏话出现的次数随时间变化",
    "chinese_summary": "本文介绍了一种分析Linux内核源代码的工具，该工具用于统计特定词语、名称或函数出现的次数。用户可以输入以逗号分隔的搜索词列表，并使用通配符和逻辑OR运算符进行更灵活的查询。分析不区分大小写，考虑重音符号，并将一个词定义为字母数字字符和下划线的序列。\n\n文章提供了一些可以搜索的类别示例，包括脏话、公司提及、人名、文件系统、表达爱意和仇恨的词语、对布尔值的引用、64位架构、\"garbage\"、\"hacks\"以及与\"*nix\"相关的术语的实例。\n\n输出结果以图表形式显示。如果启用了Javascript，用户可以查看交互式图表。否则，将显示一张包含过时数据的静态PNG图像。该工具允许用户探索特定术语在庞大的Linux内核源代码中的频率，并（隐式地）在历史数据可用且可比的情况下，跟踪随时间变化的趋势。作者还推广了他们创建的其他“有趣的东西”。"
  },
  {
    "id": "44275974",
    "title": "Adding public transport data to Transitous",
    "url": "https://www.volkerkrause.eu/2025/06/14/transitous-adding-data.html",
    "summary": "This article outlines how individuals can contribute to Transitous, a community-run public transport routing service. The key to improving Transitous lies in enhancing its data, which relies on the accuracy and completeness of various datasets.\n\nThe article details different types of data that Transitous uses:\n\n*   **Public transport schedules (GTFS):** These are essential for basic routing and should be accurate and up-to-date. Contributors can find GTFS feeds on operator websites, open data portals, and feed registries. Adding a feed involves contributing a few lines of JSON to the Transitous repository.\n*   **Realtime data (GTFS-RT):** This data provides information on delays, disruptions, and vehicle positions. GTFS-RT feeds are used in conjunction with static GTFS feeds and can be inspected using command line tools and downloadable proto schemas.\n*   **Shared mobility data (GBFS):** This includes data on bike and scooter sharing services. Adding GBFS feeds is similar to GTFS, requiring a few lines of JSON, with any service accessible to the public being welcome.\n*   **On-demand services (GTFS-Flex):** Data for on-demand services such as dynamic bus routes. This is a new standard and requires careful addition due to the lack of validation.\n*   **OpenStreetMap (OSM):** Specifically, the article emphasizes the importance of accurate floor level separation in OSM data for in-building routing, particularly in train stations.\n\nThe article also suggests other potential areas for contribution, such as expanding the GTFS standard, converting other data formats, generating GTFS-RT from vehicle positions, augmenting GTFS feeds, and considering elevation data. Finally, it encourages readers to participate by verifying data, joining the Transitous Matrix channel, and attending related events.\n",
    "chinese_title": "将公共交通数据添加到 Transitous",
    "chinese_summary": "本文概述了个人如何为Transitous做出贡献，Transitous是一个社区运营的公共交通线路规划服务。改进Transitous的关键在于增强其数据，而这依赖于各种数据集的准确性和完整性。\n\n本文详细介绍了Transitous使用的不同类型的数据：\n\n*   **公共交通时刻表 (GTFS)：** 这些对于基本线路规划至关重要，应准确且最新。贡献者可以在运营商网站、开放数据门户和数据源注册表中找到GTFS数据源。添加数据源需要向Transitous存储库贡献几行JSON代码。\n*   **实时数据 (GTFS-RT)：** 此数据提供有关延误、中断和车辆位置的信息。 GTFS-RT数据源与静态GTFS数据源结合使用，可以使用命令行工具和可下载的proto模式进行检查。\n*   **共享出行数据 (GBFS)：** 这包括自行车和踏板车共享服务的数据。 添加GBFS数据源与GTFS类似，需要几行JSON代码，欢迎任何面向公众的服务。\n*   **按需服务 (GTFS-Flex)：** 诸如动态巴士线路之类的按需服务数据。 这是一个新的标准，由于缺乏验证，因此需要仔细添加。\n*   **OpenStreetMap (OSM)：** 特别是，本文强调了OSM数据中准确的楼层分隔对于建筑物内线路规划的重要性，尤其是在火车站中。\n\n本文还提出了其他潜在的贡献领域，例如扩展GTFS标准、转换其他数据格式、从车辆位置生成GTFS-RT、增强GTFS数据源以及考虑海拔数据。 最后，它鼓励读者通过验证数据、加入Transitous Matrix频道和参加相关活动来参与。"
  },
  {
    "id": "44300027",
    "title": "The Collapse of Complex Societies",
    "url": "https://matthewbutterick.com/chron/the-collapse-of-complex-societies.html",
    "summary": "Matthew Butterick's article discusses the concept of societal collapse through the lens of two influential books: \"The Limits to Growth\" (TLoG) and \"The Collapse of Complex Societies\" by Joseph Tainter.\n\nTLoG, published in 1972, used software simulations to predict that unchecked population growth, industrialization, pollution, food production, and resource depletion would lead to a global collapse within a century. The book's models showed population decline despite resource availability due to pollution. Follow-up studies have largely confirmed the initial predictions.\n\nTainter, an anthropologist, argues that societies collapse due to diminishing returns on investments in socio-political complexity. As societies become more complex, the costs of maintaining that complexity increase, eventually outweighing the benefits. This makes societies vulnerable to external shocks like war, natural disasters, or pandemics, ultimately leading to collapse.\n\nUnlike TLoG, Tainter doesn't see economic deceleration as a viable solution, as global competition necessitates continued pursuit of complexity. He posits that future collapse will be global, as interconnected societies will disintegrate together.\n\nTainter suggests a potential solution: a massive investment in developing a new, abundant energy source. This would buy humanity time by making it more affordable to finance the investment in complexity, though it would require significant economic sacrifices. He also mentions that software that can invent energy technology would also be a potential solution.\n",
    "chinese_title": "复杂社会的崩溃",
    "chinese_summary": "马修·巴特里克的文章通过两本有影响力的书——《增长的极限》(TLoG) 和约瑟夫·泰因特的《复杂社会的崩溃》——探讨了社会崩溃的概念。\n\n《增长的极限》于1972年出版，它使用软件模拟预测，不受控制的人口增长、工业化、污染、粮食生产和资源枯竭将在一个世纪内导致全球崩溃。该书的模型显示，尽管资源可用，但由于污染，人口会下降。后续研究在很大程度上证实了最初的预测。\n\n人类学家泰因特认为，社会崩溃是由于对社会政治复杂性投资的回报递减造成的。随着社会变得越来越复杂，维持这种复杂性的成本会增加，最终超过收益。这使得社会容易受到战争、自然灾害或流行病等外部冲击的影响，最终导致崩溃。\n\n与《增长的极限》不同，泰因特认为经济减速不是一个可行的解决方案，因为全球竞争需要持续追求复杂性。他认为未来的崩溃将是全球性的，因为相互联系的社会将会一起瓦解。\n\n泰因特提出了一个潜在的解决方案：对开发一种新的、丰富的能源进行大规模投资。这将通过降低对复杂性投资的成本来为人类争取时间，但这需要巨大的经济牺牲。他还提到，能够发明能源技术的软件也将是一种潜在的解决方案。"
  },
  {
    "id": "44293455",
    "title": "Writing in the Age of LLMs",
    "url": "https://www.sh-reya.com/blog/ai-writing/",
    "summary": "This article discusses the challenges and strategies for writing effectively in an era increasingly influenced by LLMs. It identifies common pitfalls of LLM-generated text, such as empty summary sentences, overuse of bullet points, flat sentence rhythm, incorrect subject selection, low information density, vagueness, overuse of demonstrative pronouns, and fluency without understanding. The author emphasizes that while these issues need to be avoided, some writing patterns unfairly labeled as \"LLM-like\" (intentional repetition, signposting phrases, parallel structure, predictable section headings, declarative openings, and em dashes) are actually valuable when used intentionally for clarity and impact.\n\nThe author then shares their personal writing process, which centers around maintaining momentum by leveraging LLMs strategically. This involves narrating the story to the model to generate outlines, writing rough drafts personally, and using scoped rewrite strategies (subject-verb proximity and the \"Somebody Wanted But So Then\" (SWBST) structure) during revision. The SWBST structure, useful for conveying motivation, conflict, and resolution, is highlighted as especially helpful in technical writing.\n\nThe article concludes by arguing that while LLMs can generate text easily, the core challenge remains in deciding *what* to say, *how* to frame it, and *when* to delve into detail. The author stresses that good writing provides value commensurate with its length, leaving the reader feeling their time was well spent. This requires judgment and critical thinking, skills that LLMs currently cannot replace.\n",
    "chinese_title": "LLM时代下的写作",
    "chinese_summary": "本文探讨了在LLM影响日益加剧的时代有效写作所面临的挑战和策略。它指出了LLM生成文本的常见缺陷，例如空洞的总结句、过度使用项目符号、平淡的句子节奏、不正确的主题选择、信息密度低、含糊不清、过度使用指示代词以及流利而不理解。作者强调，虽然这些问题需要避免，但一些被不公平地贴上“类似LLM”标签的写作模式（有意重复、路标短语、平行结构、可预测的章节标题、声明性开头和破折号）如果被有意用于提高清晰度和影响力，实际上是有价值的。\n\n作者随后分享了他们的个人写作过程，该过程的核心是通过战略性地利用LLM来保持动力。这包括向模型讲述故事以生成大纲，亲自撰写草稿，以及在修订过程中使用有范围的重写策略（主谓邻近和“有人想要，但是，所以，然后” (SWBST) 结构）。SWBST结构对于传达动机、冲突和解决方案非常有用，被强调为在技术写作中尤其有帮助。\n\n文章最后认为，虽然LLM可以轻松生成文本，但核心挑战仍然在于决定*说什么*、*如何构建*以及*何时深入细节*。作者强调，好的写作应提供与其篇幅相称的价值，让读者觉得他们的时间花得值。这需要判断力和批判性思维，而这些技能是LLM目前无法取代的。"
  },
  {
    "id": "44290121",
    "title": "Show HN: dk – A script runner and cross-compiler, written in OCaml",
    "url": "https://diskuv.com/dk/help/latest/",
    "summary": "`dk` is a standalone binary that functions as a script runner and cross-compiler, written in OCaml. It executes scripts directly from the command line, similar to how Python interprets `.py` files or shell interpreters run `.sh` scripts. A key feature is its ability to cross-compile scripts into standalone native executables for various operating systems (e.g., `.exe` for Windows) without requiring additional dependencies beyond standard system libraries.\n\n`dk` aims to bridge the gap between scripting and compiled applications, catering to both beginners and experienced developers. Examples of projects powered by `dk` include a Stripe webhook implementation, the data layer of an Android app, and running existing OCaml code without modification.\n\nThe ecosystem includes various command-line tools, such as `dk`, `dk-Embed`, `dk-Exe`, `dk-REPL`, `dk-Run`, and `dk-SBOM`, along with tools for asset capture and filesystem manipulation. Comprehensive reference manuals cover libraries, macros, runtime environments, project organization (parties), design security, linking, and limitations. Guides are available for different user levels, including a Quick Walkthrough for students, a Quick Tour for experienced developers, and a guide for developers transitioning from OCaml.\n",
    "chinese_title": "Show HN: dk – 一款用 OCaml 编写的脚本运行器和交叉编译器",
    "chinese_summary": "`dk` 是一个独立的二进制文件，用 OCaml 编写，用作脚本运行器和交叉编译器。它直接从命令行执行脚本，类似于 Python 解释 `.py` 文件或 shell 解释器运行 `.sh` 脚本的方式。一个关键特性是它能够将脚本交叉编译成适用于各种操作系统的独立原生可执行文件（例如 Windows 的 `.exe`），而无需超出标准系统库之外的额外依赖项。\n\n`dk` 旨在弥合脚本和编译应用程序之间的差距，同时满足初学者和经验丰富的开发人员的需求。由 `dk` 驱动的项目的示例包括 Stripe webhook 实现、Android 应用程序的数据层以及运行现有 OCaml 代码而无需修改。\n\n该生态系统包括各种命令行工具，例如 `dk`、`dk-Embed`、`dk-Exe`、`dk-REPL`、`dk-Run` 和 `dk-SBOM`，以及用于资产捕获和文件系统操作的工具。全面的参考手册涵盖了库、宏、运行时环境、项目组织（parties）、设计安全、链接和限制。针对不同用户级别提供了指南，包括针对学生的快速演练、针对经验丰富的开发人员的快速入门以及针对从 OCaml 过渡的开发人员的指南。"
  },
  {
    "id": "44296972",
    "title": "Show HN: FaynoSync Self-Hosted API for Automatic App Updates",
    "url": "https://github.com/ku9nov/faynoSync",
    "summary": "FaynoSync is a self-hosted API server designed for automatic updates of client applications. It allows developers to upload applications to S3, set version numbers, and enable clients to check for updates. If a newer version is available, the API provides a link to download the update.\n\nThe server supports background and on-demand updates. Installation involves cloning the repository, configuring environment variables (including S3 access and MongoDB URL), and running the application using Go or Docker. Docker Compose simplifies the process by building and running dependencies.\n\nThe API offers functionalities for version checking, application management (creation, deletion, and updates), channel, platform, and architecture configurations, user management (including team users with restricted permissions), and telemetry. Testing includes a comprehensive suite of end-to-end tests, verifying API endpoints, user roles, and data integrity within a test database and S3 bucket. Comprehensive API tests are included to ensure that the system functions correctly. The system is licensed under the Apache license.\n",
    "chinese_title": "Show HN: FaynoSync – 用于自动应用程序更新的自托管API",
    "chinese_summary": "FaynoSync是一个自托管的API服务器，专为客户端应用程序的自动更新而设计。它允许开发者将应用程序上传到S3，设置版本号，并使客户端能够检查更新。如果有新版本可用，API会提供下载更新的链接。\n\n该服务器支持后台和按需更新。安装包括克隆存储库，配置环境变量（包括S3访问权限和MongoDB URL），以及使用Go或Docker运行应用程序。Docker Compose通过构建和运行依赖项来简化此过程。\n\n该API提供版本检查、应用程序管理（创建、删除和更新）、通道、平台和架构配置、用户管理（包括具有受限权限的团队用户）以及遥测等功能。测试包括一套全面的端到端测试，验证API端点、用户角色以及测试数据库和S3存储桶内的数据完整性。包含全面的API测试以确保系统正常运行。该系统在Apache许可证下获得许可。"
  },
  {
    "id": "44287043",
    "title": "Nanonets-OCR-s – OCR model that transforms documents into structured markdown",
    "url": "https://huggingface.co/nanonets/Nanonets-OCR-s",
    "summary": "Nanonets-OCR-s is a state-of-the-art OCR model that transforms documents into structured markdown, going beyond simple text extraction. It leverages intelligent content recognition and semantic tagging, making it well-suited for use with Large Language Models (LLMs).\n\nKey features include:\n\n*   **LaTeX Equation Recognition:** Converts equations into LaTeX syntax.\n*   **Intelligent Image Description:** Describes images with structured `<img>` tags for LLM processing.\n*   **Signature Detection & Isolation:** Identifies and tags signatures.\n*   **Watermark Extraction:** Detects and tags watermark text.\n*   **Smart Checkbox Handling:** Converts checkboxes into Unicode symbols.\n*   **Complex Table Extraction:** Extracts tables and converts them into markdown and HTML.\n\nThe model can be used via Transformers, vLLM, or docext. Examples are provided showing the code to implement using each. The model is available on Hugging Face and is based on Qwen/Qwen2.5-VL-3B-Instruct.\n",
    "chinese_title": "Nanonets-OCR-s – 将文档转换为结构化 Markdown 的 OCR 模型",
    "chinese_summary": "Nanonets-OCR-s 是一款先进的 OCR 模型，它将文档转换为结构化 Markdown，超越了简单的文本提取。它利用智能内容识别和语义标记，非常适合与大型语言模型 (LLM) 一起使用。\n\n主要功能包括：\n\n*   **LaTeX 公式识别：** 将公式转换为 LaTeX 语法。\n*   **智能图像描述：** 使用结构化的 `<img>` 标签描述图像，以便 LLM 处理。\n*   **签名检测与隔离：** 识别并标记签名。\n*   **水印提取：** 检测并标记水印文本。\n*   **智能复选框处理：** 将复选框转换为 Unicode 符号。\n*   **复杂表格提取：** 提取表格并将其转换为 Markdown 和 HTML。\n\n该模型可以通过 Transformers、vLLM 或 docext 使用。提供的示例展示了使用每种方法实现的代码。该模型可在 Hugging Face 上获取，并且基于 Qwen/Qwen2.5-VL-3B-Instruct。"
  },
  {
    "id": "44298286",
    "title": "Firefox is dead to me – and I'm not the only one who is fed up",
    "url": "https://www.theregister.com/2025/06/17/opinion_column_firefox/",
    "summary": "Steven J. Vaughan-Nichols argues that Firefox is failing and losing users due to Mozilla's questionable decisions. He cites Mozilla's updated privacy policy, which is less definitive about protecting user data, and the company's focus on AI despite lacking the resources to compete effectively. He criticizes Mozilla's decision to discontinue Pocket and Fakespot, with Pocket being a useful \"read-it-later\" tool and Fakespot being a helpful AI-powered tool to verify online reviews.\n\nThe article highlights technical issues with Firefox, including slow performance, high memory usage, frequent crashes, and problems rendering JavaScript-heavy websites like Instagram and LinkedIn. The Linux version is also criticized for sluggishness and poor Snap/Flatpak packaging. Additionally, Mozilla's botched handling of an expiring root certificate that affected add-ons and DRM content caused significant disruption for users.\n\nThe author points out Mozilla's layoffs and CEO approval rate, and the fact that Mozilla relies on Google for 90% of its revenue, meaning Firefox's survival depends on Google's fate. The author concludes that Firefox's market share is negligible (1.9% of US government website visits) and declares the browser \"done,\" lamenting its decline from a once-beloved open-source tool.\n",
    "chinese_title": "火狐已死——我不止一个人受够了",
    "chinese_summary": "史蒂文·J·沃恩-尼科尔斯认为，由于Mozilla可疑的决策，火狐正在走向失败并失去用户。他列举了Mozilla更新后的隐私政策，该政策在保护用户数据方面不够明确，以及该公司在缺乏有效竞争资源的情况下仍专注于人工智能。他批评了Mozilla停止Pocket和Fakespot的决定，Pocket是一个有用的“稍后阅读”工具，而Fakespot是一个有用的、由人工智能驱动的工具，用于验证在线评论。\n\n文章强调了火狐的技术问题，包括运行缓慢、内存占用高、频繁崩溃，以及渲染Instagram和LinkedIn等大量使用JavaScript的网站时出现问题。Linux版本也因运行缓慢和糟糕的Snap/Flatpak打包而受到批评。此外，Mozilla对过期根证书的处理不当，影响了附加组件和DRM内容，给用户造成了重大干扰。\n\n作者指出了Mozilla的裁员和CEO的批准率，以及Mozilla 90%的收入依赖于谷歌这一事实，这意味着火狐的生存取决于谷歌的命运。作者总结说，火狐的市场份额微不足道（美国政府网站访问量的1.9%），并宣布该浏览器“完了”，感叹它从曾经备受欢迎的开源工具的衰落。"
  },
  {
    "id": "44294876",
    "title": "TIL: AI. Thoughts on AI",
    "url": "https://cocoaphony.micro.blog/2025/06/16/tilai-thoughts-on-ai.html",
    "summary": "This article provides insights into the reality of working with AI, contrasting it with common misconceptions. The author emphasizes that AI is not a perfect computer with a natural language interface, but rather a tool with limitations, akin to an \"infinite intern.\"\n\nKey takeaways include:\n\n*   **AI is not a computer:** It has limited context, memory, and computational abilities.\n*   **Leverage Tools:** AI needs to be directed to use tools and scripts to perform tasks effectively.\n*   **Context windows are limiting:** They are integrated into the model and can't be easily expanded. The order and content of information within the context window matters.\n*   **AI Doesn't Learn in Real-Time:** Models don't learn from daily interactions; memory requires external data stores.\n*   **AI as Interns:** Managing AI effectively requires precise instructions, structured tasks, and human oversight.\n*   **AI for Leverage, Not Automation:** AI increases productivity but requires more precise specifications and quality control.\n*   **Reviewing AI Code:** AI-generated code requires special scrutiny due to its tendency to make unexpected mistakes, despite appearing professional.\n*   **Emergent Behavior:** AI's capabilities are often unplanned and not fully understood.\n*   **AI Lacks Self-Understanding:** It cannot accurately explain its reasoning or improve its prompts consistently.\n*   **Nondeterministic Nature:** AI output varies even with identical inputs, requiring consideration for reliability.\n*   **Rapid Evolution:** AI tools are constantly changing.\n\nThe author concludes that AI is a powerful tool for leverage, but requires careful management, understanding its limitations, and adapting to its emergent behavior.\n",
    "chinese_title": "今日学到：人工智能。关于人工智能的思考",
    "chinese_summary": "理解AI工作的真相：无限实习生而非完美计算机\n\n要点包括：\n\n*   **AI并非计算机：** 其上下文理解、记忆和计算能力有限。\n*   **善用工具：** 需要引导AI使用工具和脚本才能有效执行任务。\n*   **上下文窗口的局限性：** 它们集成在模型中，难以扩展。上下文窗口内信息的顺序和内容至关重要。\n*   **AI无法实时学习：** 模型无法从日常互动中学习；记忆需要外部数据存储。\n*   **AI如同实习生：** 有效管理AI需要精确的指令、结构化的任务和人工监督。\n*   **AI用于提升效率，而非自动化：** AI可提高生产力，但需要更精确的规范和质量控制。\n*   **审查AI代码：** AI生成的代码需要特别审查，因为它倾向于犯意外错误，尽管看起来很专业。\n*   **涌现行为：** AI的能力通常是未计划的，并且未被完全理解。\n*   **AI缺乏自我理解：** 它无法准确解释其推理或持续改进其提示。\n*   **非确定性本质：** 即使输入相同，AI的输出也会有所不同，需要考虑可靠性。\n*   **快速发展：** AI工具不断变化。\n\n作者总结说，AI是一种强大的效率提升工具，但需要谨慎管理，理解其局限性，并适应其涌现行为。"
  },
  {
    "id": "44300521",
    "title": "Is Fake Grass Safe? A Manufacturer Sues to Stop a Discussion",
    "url": "https://www.nytimes.com/2025/06/17/climate/artificial-turf-grass-lawsuit-defamation-health-risk.html",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "人造草坪安全吗？制造商起诉以阻止讨论",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "44293922",
    "title": "Battle to eradicate invasive pythons in Florida achieves milestone",
    "url": "https://phys.org/news/2025-06-eradicate-invasive-pythons-florida-stunning.html",
    "summary": "Florida's efforts to eradicate invasive Burmese pythons have reached a significant milestone, with the Conservancy of Southwest Florida humanely killing 20 tons of the snakes since 2013, including a record 6,300 pounds this past breeding season in a 200-square-mile area. The pythons are decimating native wildlife, with researchers identifying 85 species of birds, mammals, and reptiles being consumed by the snakes.\n\nThe Conservancy's success is attributed to technology, particularly a scout snake program where radio-tagged male pythons lead researchers to reproductive females, which are then euthanized. This program has prevented over 20,000 python eggs from hatching.\n\nWildlife biologist Ian Bartoszek notes the large size of the pythons, with the largest female captured weighing 215 pounds. He highlights the disconcerting discoveries, including the snakes expanding their range toward Lake Okeechobee. He also observed evidence of native wildlife fighting back, such as a bobcat preying on a scout snake, offering a glimmer of hope for the ecosystem.\n",
    "chinese_title": "佛罗里达州清除入侵蟒蛇的战斗取得里程碑",
    "chinese_summary": "佛罗里达州清除入侵缅甸蟒的努力取得重大进展，自2013年以来，西南佛罗里达州自然保护协会已人道地杀死了20吨蟒蛇，其中包括过去繁殖季在200平方英里区域内创纪录的6300磅。这些蟒蛇正在大量减少本地野生动物，研究人员已确认有85种鸟类、哺乳动物和爬行动物被这些蛇吞噬。\n\n自然保护协会的成功归功于技术，特别是侦察蛇计划，即通过无线电标记的雄性蟒蛇引导研究人员找到具有繁殖能力的雌性蟒蛇，然后对其进行安乐死。该计划已阻止超过20,000个蟒蛇蛋孵化。\n\n野生动物生物学家伊恩·巴托泽克注意到蟒蛇体型巨大，捕获的最大雌性蟒蛇重达215磅。他强调了令人不安的发现，包括蟒蛇将其活动范围扩大到奥基乔比湖附近。他还观察到本地野生动物反击的证据，例如一只短尾猫捕食了一条侦察蛇，为生态系统带来了一线希望。"
  },
  {
    "id": "44275134",
    "title": "Maya Blue: Unlocking the Mysteries of an Ancient Pigment",
    "url": "https://www.mexicolore.co.uk/maya/home/maya-blue-unlocking-the-mysteries-of-an-ancient-pigment",
    "summary": "This article, written by Dr. Dean E. Arnold, explores the fascinating history and unique properties of Maya Blue, a vibrant blue pigment used by the ancient Maya from the Late Preclassic to the Colonial Period. The pigment was used on human sacrifices, sculpture, pottery, murals, and codices, symbolizing the rain god Chaak. Maya Blue's enduring quality is remarkable: it doesn't fade over time like indigo, one of its constituents, and resists acids and alkalines.\n\nUnlike most ancient pigments, Maya Blue is a unique hybrid, composed of the inorganic clay minerals palygorskite and/or sepiolite, and the organic dye indigo. The article details the ongoing scientific investigation into how the Maya created this pigment, suggesting a process of grinding wet palygorskite with indigo leaves and heating the mixture.\n\nDr. Arnold highlights his discovery of a bowl of copal incense with blue material on it from the Sacred Cenote at Chichén Itzá, suggesting that burning incense with palygorskite and indigo may have been one method of creating the pigment, especially for rituals.  However, he concludes that this method was likely impractical for large-scale pigment production. He proposes that the grinding of 'white earth' (palygorskite) is a crucial step in the process for making larger quantities of Maya Blue, increasing the surface area and allowing for better binding of the indigo. Further research is ongoing to fully understand the methods used by the ancient Maya to create this enduring and mysterious pigment.\n",
    "chinese_title": "玛雅蓝：解密古代颜料之谜",
    "chinese_summary": "本文由Dean E. Arnold博士撰写，探讨了玛雅蓝引人入胜的历史和独特属性。玛雅蓝是一种鲜艳的蓝色颜料，古玛雅人在晚期前古典期到殖民时期使用。这种颜料被用于人体祭祀、雕塑、陶器、壁画和抄本上，象征着雨神查克。玛雅蓝的持久品质非常 remarkable：它不会像其成分之一的靛蓝那样随时间褪色，并且能抵抗酸和碱。\n\n与大多数古代颜料不同，玛雅蓝是一种独特的混合物，由无机粘土矿物坡缕石和/或海泡石以及有机染料靛蓝组成。本文详细介绍了对玛雅人如何创造这种颜料的持续科学研究，认为他们可能将湿坡缕石与靛蓝叶子研磨并加热混合物。\n\nArnold博士强调了他发现的一个来自奇琴伊察圣井的柯巴脂香碗，上面有蓝色物质，表明燃烧含有坡缕石和靛蓝的香可能是一种创造这种颜料的方法，尤其是在仪式中。然而，他得出结论，这种方法可能不适用于大规模颜料生产。他提出研磨“白土”（坡缕石）是制造大量玛雅蓝的关键步骤，可以增加表面积并更好地结合靛蓝。进一步的研究正在进行中，以充分了解古代玛雅人创造这种持久而神秘的颜料的方法。"
  },
  {
    "id": "44298849",
    "title": "How to run a shadow library: operations at Anna's Archive (2023)",
    "url": "https://annas-archive.org/blog/how-to-run-a-shadow-library.html",
    "summary": "This article details the operational challenges and technical architecture behind Anna's Archive, a search engine for shadow libraries like Sci-Hub and Library Genesis. The core goal is to provide accessible knowledge while navigating complex legal landscapes, particularly copyright laws.\n\nThe technical stack is deliberately simple: Flask, MariaDB, and ElasticSearch, allowing focus on resilience against takedowns. The key challenge is legal ambiguity: while Anna's Archive is a search engine (not directly hosting copyrighted material), linking to sites that do can be illegal in many jurisdictions.\n\nThe architecture emphasizes redundancy and anonymity. They use \"freedom-loving providers\" (less likely to shut them down) proxied through \"cheap providers\" to host the bulk of the data. Cloudflare (free plan) is used as a caching and protection layer, but its limitations necessitate custom domain-level load balancing and failover.\n\nVarious tools are employed for different functions: Flask, MariaDB, ElasticSearch, Docker for the application; Varnish for proxying; Ansible, Checkmk, UFW for server management; Gitlab, Weblate, Zulip for development; and Tor, Nginx for onion static hosting. The article also details challenges and changes regarding communication between servers and specific tool choices.\n\nThe author concludes by inviting donations, sponsorships, and contributions from developers and translators to further support the archive's mission.\n",
    "chinese_title": "如何运作影子图书馆：以安娜的档案为例 (2023)",
    "chinese_summary": "本文详细介绍了 Anna's Archive 背后的运营挑战和技术架构，Anna's Archive 是 Sci-Hub 和 Library Genesis 等影子图书馆的搜索引擎。其核心目标是在复杂的法律环境，特别是版权法中，提供可访问的知识。\n\n技术堆栈刻意简单：Flask、MariaDB 和 ElasticSearch，以便专注于抵御撤下请求的弹性。关键挑战是法律的模糊性：虽然 Anna's Archive 是一个搜索引擎（不直接托管受版权保护的材料），但链接到托管这些材料的网站在许多司法管辖区可能属于非法行为。\n\n该架构强调冗余和匿名性。他们使用“热爱自由的供应商”（不太可能关闭他们）作为代理，通过“廉价的供应商”来托管大部分数据。Cloudflare（免费套餐）被用作缓存和保护层，但其局限性需要自定义的域名级负载均衡和故障转移。\n\n各种工具被用于不同的功能：Flask、MariaDB、ElasticSearch、Docker 用于应用程序；Varnish 用于代理；Ansible、Checkmk、UFW 用于服务器管理；Gitlab、Weblate、Zulip 用于开发；Tor、Nginx 用于 onion 静态托管。文章还详细介绍了服务器之间通信以及特定工具选择方面的挑战和变化。\n\n作者最后邀请捐款、赞助以及来自开发人员和翻译人员的贡献，以进一步支持该档案的使命。"
  },
  {
    "id": "44285874",
    "title": "Is gravity just entropy rising? Long-shot idea gets another look",
    "url": "https://www.quantamagazine.org/is-gravity-just-entropy-rising-long-shot-idea-gets-another-look-20250613/",
    "summary": "This article explores the controversial idea of \"entropic gravity,\" the theory that gravity isn't a fundamental force, but an emergent phenomenon arising from the increase of entropy (disorder). While Isaac Newton sought a mechanical explanation for gravity, and Einstein provided a deeper understanding with general relativity, the idea of gravity as a collective effect persists.\n\nDaniel Carney and his team proposed a modern take on this idea, suggesting space is filled with a thermal system that interacts randomly with massive objects, resulting in the observable effects of gravity. This is rooted in the observation that general relativity, particularly regarding black holes, has parallels to thermodynamics.\n\nCarney's team developed two models. One posits a crystalline grid of qubits that align with massive objects, creating pockets of order. The drive to maximize entropy then forces the objects together. The other model removes the grid, where qubits store energy dependent on the distance between masses, also resulting in attraction as the system maximizes entropy.\n\nWhile experimentally testable, these models are ad hoc, requiring fine-tuning and only replicating Newton's law, not the full complexity of Einstein's theory. Critics argue the models lack essential qualities of gravity, and don't address gravity's behavior in extreme conditions like black holes. Proponents argue that focusing on weak gravity fields offers the best chance to observe fluctuations predicted by entropic gravity.\n\nThe article highlights potential experimental tests, such as observing whether a massive object in quantum superposition creates a superposition of its gravitational field. This could also shed light on the collapse of the wave function in quantum mechanics. Despite skepticism, the article concludes that exploring alternative mechanisms for gravity's origin is valuable, particularly if holographic principles are unproven.\n",
    "chinese_title": "重力是熵增的体现吗？一个大胆的想法再次受到关注",
    "chinese_summary": "熵引力：一种有争议的引力起源理论"
  },
  {
    "id": "44284871",
    "title": "Show HN: Zeekstd – Rust Implementation of the ZSTD Seekable Format",
    "url": "https://github.com/rorosen/zeekstd",
    "summary": "This \"Show HN\" post introduces Zeekstd, a Rust implementation of the Zstandard Seekable Format. This format allows for efficient decompression of specific sections of a compressed archive by dividing the data into independent frames. Unlike standard Zstd compression, you don't need to decompress the entire archive to access a portion of it.\n\nZeekstd is compatible with the initial seekable format specification but also includes updated features. The library allows users to encode data into the seekable format, automatically creating new frames after every 2MiB of uncompressed data (configurable through `EncodeOptions`). It also provides functionality to decode the seekable format, allowing for either full decompression or decompression of specific frame ranges.\n\nThe post provides code examples for both encoding and decoding using the Zeekstd library. It highlights how to create a seekable Zstd archive and then decompress either the entire archive or only frames 2 through 5.\n\nThe repository also includes a command-line interface (CLI) tool built upon the Zeekstd library. Finally, the post mentions the licensing: the underlying Zstd library is dual-licensed under BSD/GPLv2, while Zeekstd itself is licensed under a BSD 2-Clause License.\n",
    "chinese_title": "Show HN: Zeekstd – ZSTD可搜索格式的Rust实现",
    "chinese_summary": "此“Show HN”帖子介绍了 Zeekstd，一个用 Rust 语言实现的 Zstandard Seekable Format。这种格式通过将数据分成独立的帧，可以高效地解压压缩存档的特定部分。与标准 Zstd 压缩不同，您无需解压整个存档即可访问其中的一部分。\n\nZeekstd 兼容最初的可寻址格式规范，并包含更新的功能。该库允许用户将数据编码为可寻址格式，并在每 2MiB 未压缩数据后自动创建新帧（可通过 `EncodeOptions` 配置）。它还提供解码可寻址格式的功能，允许完全解压缩或解压缩特定的帧范围。\n\n该帖子提供了使用 Zeekstd 库进行编码和解码的代码示例。它重点介绍了如何创建可寻址的 Zstd 存档，然后解压整个存档或仅解压第 2 到第 5 帧。\n\n该存储库还包含一个基于 Zeekstd 库构建的命令行界面 (CLI) 工具。最后，该帖子提到了许可：底层的 Zstd 库采用 BSD/GPLv2 双重许可，而 Zeekstd 本身则采用 BSD 2-Clause License 许可。"
  },
  {
    "id": "44297464",
    "title": "iOS 26 Will Let You Add Your U.S. Passport to Wallet for Identity Verification",
    "url": "https://www.macrumors.com/2025/06/10/ios-26-passport-wallet-identity-verification/",
    "summary": "Here's a concise summary of the article:\n\niOS 26, launching in Fall 2025, will introduce a new Digital ID feature allowing iPhone users to add their U.S. passport to the Apple Wallet app. This digital passport can be used for identity verification, specifically as a Real ID-compliant alternative to physical passports for domestic travel at select TSA checkpoints in the United States. While convenient for quick TSA passage, the digital passport will not replace physical passports for international travel or border crossings.\n\nBeyond travel, the digital passport will also function like digital driver's licenses for age and identity verification in apps, retail stores, and newly in iOS 26, on websites. This expands the reach of digital identification beyond the current limited rollout of state IDs in the Wallet app (Arizona, California, Colorado, Georgia, Hawaii, Iowa, Maryland, New Mexico, Ohio, and Puerto Rico).\n\nIn addition to the Digital ID feature, iOS 26 will bring an overhauled boarding pass experience to the Wallet app. This includes Live Activities for flight updates, integrated Maps for airport overviews, and Find My integration for luggage tracking. Several airlines including Air Canada, American Airlines, Delta, JetBlue, Lufthansa Group, Qantas, Southwest, United, and Virgin Australia will support these new boarding pass features.\n",
    "chinese_title": "iOS 26 将允许你将美国护照添加到钱包以进行身份验证",
    "chinese_summary": "以下是文章的简要总结：\n\niOS 26将于2025年秋季发布，将引入一项新的数字身份识别功能，允许iPhone用户将他们的美国护照添加到Apple Wallet应用程序中。这种数字护照可用于身份验证，特别是作为符合Real ID标准的实体护照的替代品，用于在美国特定TSA检查站的国内旅行。虽然方便快速通过TSA检查，但数字护照不会取代用于国际旅行或边境通关的实体护照。\n\n除了旅行之外，数字护照还将像数字驾照一样，在应用程序、零售商店以及iOS 26中新增的网站上进行年龄和身份验证。这扩展了数字身份识别的范围，超越了目前Wallet应用程序中州身份证的有限推广范围（亚利桑那州、加利福尼亚州、科罗拉多州、佐治亚州、夏威夷州、爱荷华州、马里兰州、新墨西哥州、俄亥俄州和波多黎各）。\n\n除了数字身份识别功能外，iOS 26还将为Wallet应用程序带来经过改进的登机牌体验。这包括用于航班更新的实时活动、用于机场概览的集成地图以及用于行李追踪的“查找”集成。包括加拿大航空、美国航空、达美航空、捷蓝航空、汉莎航空集团、澳洲航空、西南航空、联合航空和维珍澳大利亚航空在内的多家航空公司将支持这些新的登机牌功能。"
  },
  {
    "id": "44282378",
    "title": "Why SSL was renamed to TLS in late 90s (2014)",
    "url": "https://tim.dierks.org/2014/05/security-standards-and-name-changes-in.html",
    "summary": "During the intense Netscape/Microsoft browser wars of the mid-90s, Netscape developed the SSL protocol. While SSL 2 was implemented, it had flaws that needed addressing. Microsoft, in the spirit of competition, created its own protocol, PCT, based on SSL 2.\n\nNetscape countered with SSL 3.0. Concerned about a protocol fork, Consensus Development hosted a meeting between Netscape and Microsoft to agree on a unified standard through the IETF. Bruce Schneier and Paul Kocher (SSL 3 protocol designer) were among those present. Microsoft's Barbara Fox represented Microsoft.\n\nTo reach an agreement, some changes were made to SSL 3.0, and more significantly, the protocol was renamed to avoid the appearance of the IETF simply endorsing Netscape's protocol. This led to the creation of TLS 1.0, which was essentially SSL 3.1. The author was the RFC editor for this. Ultimately, this rebranding was viewed as a somewhat trivial exercise in retrospect.\n",
    "chinese_title": "为何SSL在90年代末更名为TLS (2014)",
    "chinese_summary": "在90年代中期激烈的网景/微软浏览器大战期间，网景公司开发了SSL协议。尽管SSL 2得以实施，但它存在需要解决的缺陷。出于竞争精神，微软创建了自己的协议PCT，其基于SSL 2。\n\n网景公司随即推出了SSL 3.0。由于担心协议分叉，共识开发组织主持了网景和微软之间的一次会议，旨在通过IETF达成统一的标准。布鲁斯·施奈尔和保罗·科切尔（SSL 3协议设计师）也在场。微软的芭芭拉·福克斯代表微软出席。\n\n为了达成协议，SSL 3.0进行了一些修改，更重要的是，该协议被重命名，以避免IETF仅仅认可网景协议的表面现象。这促成了TLS 1.0的诞生，它本质上是SSL 3.1。作者是此协议的RFC编辑。最终，回顾来看，这种品牌重塑被认为是一种有些微不足道的举措。"
  },
  {
    "id": "44297437",
    "title": "Threat in Your Medicine Cabinet: The FDA's Gamble on America's Drugs",
    "url": "https://www.propublica.org/article/fda-drug-loophole-sun-pharma",
    "summary": "ProPublica's investigation reveals a concerning trend: for over a decade, the FDA has been granting exemptions to foreign drug factories banned from exporting to the U.S. due to substandard practices, allowing them to continue shipping medications to unsuspecting Americans. These factories, primarily in India, have been found to have contaminated drugs, unsanitary labs, and falsified records.\n\nDespite imposing import bans on factories like Sun Pharma and Intas Pharmaceuticals for egregious violations, the FDA, citing concerns about drug shortages, granted them special permission to continue exporting specific drugs. These exemptions were not publicly disclosed, even within the FDA itself, raising concerns about transparency and public safety.\n\nThe report highlights numerous complaints filed with the FDA about exempted drugs, citing adverse reactions, contamination, and even hospitalizations and deaths. While causality isn't definitively proven, the sheer volume of complaints raises serious questions about the safety of these medications.\n\nFormer FDA officials acknowledge the agency's difficult position, balancing drug supply with safety concerns. The FDA's decision to allow manufacturers with histories of violations to become major generic drug suppliers created a situation where shutting down production would lead to shortages. This has left some current and former officials worried about the potential harm caused by substandard drugs circulating in the U.S. despite bans. The article raises important questions about the FDA's oversight of generic drug manufacturing and the potential risks to public health.\n",
    "chinese_title": "你药柜中的威胁：FDA在美国药品上的豪赌",
    "chinese_summary": "ProPublica的调查揭示了一个令人担忧的趋势：十多年来，由于生产不达标，FDA一直在豁免被禁止向美国出口的外国药厂，允许它们继续向毫无戒心的美国人运送药物。这些工厂主要位于印度，被发现存在药物污染、实验室不卫生和伪造记录等问题。\n\n尽管FDA对太阳制药和英塔斯制药等工厂因严重违规行为实施了进口禁令，但FDA以担心药物短缺为由，特别批准它们继续出口特定药物。这些豁免并未公开披露，甚至在FDA内部也没有公开，这引发了对透明度和公共安全的担忧。\n\n该报告强调了向FDA提出的关于豁免药物的大量投诉，指出存在不良反应、污染，甚至住院和死亡的情况。虽然因果关系尚未得到明确证实，但大量的投诉引发了人们对这些药物安全性的严重质疑。\n\n前FDA官员承认该机构面临的困境，需要在药物供应和安全问题之间取得平衡。FDA允许有违规历史的制造商成为主要的仿制药供应商，导致了关闭生产会导致短缺的局面。这让一些现任和前任官员担心，尽管实施了禁令，在美国流通的劣质药物可能会造成的潜在危害。文章对FDA对仿制药生产的监管以及对公众健康的潜在风险提出了重要问题。"
  },
  {
    "id": "44293837",
    "title": "Privacy implications of browsers’ (mis)implementations of Widevine EME (2023)",
    "url": "https://hal.science/hal-04179324v1/document",
    "summary": "This document, titled \"Privacy Implications of Browsers' (Mis)implementations of Widevine EME (2023)\", appears to be a PDF file containing technical data, possibly related to a research paper or security analysis.\n\nGiven the file's binary nature, a complete semantic extraction and summary is impossible without dedicated PDF parsing tools and understanding of the specific context of Widevine EME and browser implementations. However, based on the title and the limited text visible in the partially decoded content, the document likely discusses:\n\n*   **Widevine EME:** It focuses on Widevine EME (Encrypted Media Extensions), a Google-developed DRM (Digital Rights Management) technology used by web browsers to enable playback of protected content (e.g., streaming videos).\n\n*   **Browser Implementations:** The analysis likely examines how different web browsers implement Widevine EME.\n\n*   **Privacy Implications:** The core subject is the privacy risks stemming from these implementations. The word \"(Mis)implementations\" suggests that the document explores how incorrect or non-standard implementations of Widevine EME can potentially compromise user privacy. This could involve issues like unique identifiers being exposed, unexpected data collection, or vulnerabilities being exploited.\n\nTherefore, it's safe to infer that the paper investigates potential privacy violations arising from variations or flaws in how various browsers incorporate Widevine EME for DRM purposes. The specifics of these violations and the browsers affected would be detailed in the full, parsed document.\n",
    "chinese_title": "浏览器对Widevine EME的（错误）实现所带来的隐私影响 (2023)",
    "chinese_summary": "题为“浏览器对 Widevine EME 的（错误）实现所带来的隐私影响 (2023)”的这份文档，似乎是一个包含技术数据的 PDF 文件，可能与研究论文或安全分析有关。\n\n鉴于该文件的二进制性质，如果没有专用的 PDF 解析工具以及对 Widevine EME 和浏览器实现的具体背景的理解，就无法进行完整的语义提取和总结。然而，根据标题和部分解码内容中可见的有限文本，该文档可能讨论以下内容：\n\n*   **Widevine EME：** 它侧重于 Widevine EME（加密媒体扩展），这是一种由 Google 开发的 DRM（数字版权管理）技术，网络浏览器使用它来启用受保护内容的播放（例如，流媒体视频）。\n\n*   **浏览器实现：** 该分析可能检查不同的网络浏览器如何实现 Widevine EME。\n\n*   **隐私影响：** 核心主题是这些实现所产生的隐私风险。“（错误）实现”一词表明该文档探讨了 Widevine EME 的不正确或非标准实现如何潜在地损害用户隐私。这可能涉及诸如暴露唯一标识符、意外的数据收集或漏洞被利用等问题。\n\n因此，可以安全地推断，该论文调查了各种浏览器为 DRM 目的而采用 Widevine EME 的方式中存在的差异或缺陷所导致的潜在隐私侵犯。 这些违规行为的具体细节以及受影响的浏览器将在完整的、解析后的文档中详细说明。"
  },
  {
    "id": "44297685",
    "title": "KDE Plasma 6.4 Released",
    "url": "https://kde.org/announcements/plasma/6/6.4.0/",
    "summary": "The article announces the release of KDE Plasma 6.4. It highlights that the easiest way to try out the new version is through live images (booted from a USB disk) or Docker images. The article provides links to download both live images and Docker images of Plasma 6.4.\n",
    "chinese_title": "KDE Plasma 6.4 发布",
    "chinese_summary": "文章宣布 KDE Plasma 6.4 发布。文中强调，体验新版本最简单的方法是通过 Live 镜像（从 USB 磁盘启动）或 Docker 镜像。文章提供了 Plasma 6.4 的 Live 镜像和 Docker 镜像的下载链接。"
  },
  {
    "id": "44265071",
    "title": "Identity Assertion Authorization Grant",
    "url": "https://www.ietf.org/archive/id/draft-parecki-oauth-identity-assertion-authz-grant-03.html",
    "summary": "This document, \"Identity Assertion Authorization Grant,\" proposes a standardized method for applications to obtain access tokens for third-party APIs using an identity assertion. It leverages Token Exchange (RFC8693) and JWT Profile for OAuth 2.0 Authorization Grants (RFC7523). The scenario involves an enterprise environment where multiple applications trust the same Identity Provider (IdP) for Single Sign-On (SSO).\n\nThe flow involves: (1) a user logging into a client application and obtaining an Identity Assertion (e.g., OpenID Connect ID Token); (2) the client using this assertion to request an Identity Assertion Authorization Grant (ID-JAG) from the IdP; (3) the client exchanging the ID-JAG JWT for an access token at the resource application's token endpoint; and (4) the client using the access token to make API requests.\n\nThe IdP validates the subject token and evaluates policies to determine if access should be granted. Upon successful validation, the IdP issues a signed ID-JAG JWT. The ID-JAG JWT contains claims such as `iss` (IdP issuer), `sub` (resource owner's subject identifier), `aud` (resource application's issuer URL), `client_id`, `jti` (unique ID), `exp`, `iat`, and an optional `scope`. The JWT's `typ` header MUST be `oauth-id-jag+jwt`.  Error responses follow OAuth 2.0 standards. The document emphasizes interoperability in enterprise environments where a single IdP manages access for multiple resource applications.\n",
    "chinese_title": "身份断言授权许可",
    "chinese_summary": "身份断言授权许可\n本文档“身份断言授权许可”提出了一种标准化方法，允许应用程序使用身份断言来获取访问第三方 API 的访问令牌。它利用令牌交换 (RFC8693) 和 OAuth 2.0 授权许可的 JWT 配置文件 (RFC7523)。 该场景涉及一个企业环境，其中多个应用程序信任同一身份提供商 (IdP) 以实现单点登录 (SSO)。\n\n流程包括：(1) 用户登录客户端应用程序并获取身份断言（例如，OpenID Connect ID Token）； (2) 客户端使用此断言从 IdP 请求身份断言授权许可 (ID-JAG)； (3) 客户端在资源应用程序的令牌端点交换 ID-JAG JWT 以获取访问令牌； 以及 (4) 客户端使用访问令牌发出 API 请求。\n\nIdP 验证主题令牌并评估策略，以确定是否应授予访问权限。 成功验证后，IdP 会颁发签名的 ID-JAG JWT。 ID-JAG JWT 包含诸如 `iss` (IdP 颁发者)、`sub` (资源所有者的主题标识符)、`aud` (资源应用程序的颁发者 URL)、`client_id`、`jti` (唯一 ID)、`exp`、`iat` 和可选的 `scope` 等声明。 JWT 的 `typ` 标头必须为 `oauth-id-jag+jwt`。 错误响应遵循 OAuth 2.0 标准。 本文档强调在单个 IdP 管理多个资源应用程序的访问权限的企业环境中的互操作性。"
  },
  {
    "id": "44254627",
    "title": "Text-to-LoRA: Hypernetwork that generates task-specific LLM adapters (LoRAs)",
    "url": "https://github.com/SakanaAI/text-to-lora",
    "summary": "Text-to-LoRA (T2L) is a method for generating task-specific LoRA (Low-Rank Adaptation) adapters for Large Language Models (LLMs) based on textual descriptions of the desired task. It aims to enable instant adaptation of LLMs to new tasks without extensive retraining.\n\nThe provided text is a reference implementation of T2L, including installation instructions, demo usage, training procedures, and evaluation results. Key aspects include:\n\n*   **Installation:** Instructions are given to install the necessary dependencies.\n*   **Demo:** Demos are provided to generate LoRAs using the CLI or a web UI, using a task description. Base models include Mistral-7B, Llama-3.1-8B and Gemma-2-2b.\n*   **Evaluation:** The generated LoRAs can be evaluated on tasks like GSM8K using provided scripts.\n*   **Training:** Two training methods are detailed: SFT (Supervised Fine-Tuning) training and Reconstruction training. SFT utilizes a watcher script for asynchronous validation and evaluation of checkpoints.\n*   **Evaluation Results:** The document presents comprehensive evaluation tables comparing the performance of T2L against baselines (base models, MT LoRA, Hyperdecoders) on various tasks. The results consistently show that T2L outperforms baselines across various model families.\n*   **Reproducibility:** Acknowledgement of potential non-deterministic behavior due to package version mismatches and vLLM's LoRA application, with reassurance that re-training confirms the validity of T2L's performance.\n*   **Hugging Face Datasets:** The document mentions potential issues with Hugging Face datasets connections, providing guidance on how to resolve them.\n",
    "chinese_title": "文本到LoRA：生成任务特定LLM适配器（LoRA）的超网络",
    "chinese_summary": "Text-to-LoRA (T2L) 是一种基于所需任务的文本描述，为大型语言模型 (LLM) 生成特定于任务的 LoRA (低秩适应) 适配器的方法。 它旨在使 LLM 能够即时适应新任务，而无需进行大量重新训练。\n\n本文档提供了 T2L 的参考实现，包括安装说明、演示用法、训练程序和评估结果。 主要方面包括：\n\n*   **安装:** 提供安装必要依赖项的说明。\n*   **演示:** 提供演示，可使用 CLI 或 Web UI，并利用任务描述来生成 LoRA。 基础模型包括 Mistral-7B、Llama-3.1-8B 和 Gemma-2-2b。\n*   **评估:** 可以使用提供的脚本在 GSM8K 等任务上评估生成的 LoRA。\n*   **训练:** 详细介绍了两种训练方法：SFT (监督式微调) 训练和重构训练。 SFT 利用观察者脚本对检查点进行异步验证和评估。\n*   **评估结果:** 该文档提供了全面的评估表，比较了 T2L 与基线（基础模型、MT LoRA、Hyperdecoders）在各种任务中的性能。 结果一致表明 T2L 在各种模型系列中均优于基线。\n*   **可复现性:** 承认由于软件包版本不匹配和 vLLM 的 LoRA 应用可能存在非确定性行为，并保证重新训练可以确认 T2L 性能的有效性。\n*   **Hugging Face 数据集:** 该文档提及 Hugging Face 数据集连接可能存在问题，并提供有关如何解决这些问题的指导。"
  },
  {
    "id": "44294721",
    "title": "Langton's Emergence",
    "url": "https://github.com/davidkimai/langtons-emergence",
    "summary": "This article explores emergent complexity through the lens of Langton's Ant, drawing parallels to large language models (LLMs). The author details their personal journey of investigating this simple cellular automaton and its surprisingly rich behavior.\n\nThe core idea is that simple rules, applied recursively, can lead to complex and unpredictable emergent behaviors. Langton's Ant, with its two basic rules, exhibits distinct phases: initial symmetry, chaotic middle, and eventual \"highway\" emergence. This phase transition highlights how capabilities can arise without explicit programming, a key concept related to LLMs.\n\nA significant discovery is the \"resilient spiral\" pattern observed in Langton's Ant, which strangely mirrors the frequent use of spiral emojis in Claude, an LLM. This leads to the \"Recursive Collapse Principle,\" a theoretical framework suggesting that recursive systems naturally evolve towards stable attractor states characterized by spiral-like patterns, regardless of implementation.\n\nThe author proposes \"symbolic residue\" as a concept explaining how computational systems leave traces of their history that influence future behavior. This residue, whether flipped cells in Langton's Ant or attention patterns in LLMs, accumulates and triggers phase transitions.\n\nPractical applications include using \"attractor cartography\" for AI interpretability, designing \"recursive scaffolding\" for AI alignment by shaping attractor landscapes, and predicting emergent capabilities by identifying patterns similar to phase transitions in Langton's Ant. The author concludes with open questions and invites collaboration, emphasizing the potential for simple systems to offer insights into complex AI.\n",
    "chinese_title": "兰顿涌现",
    "chinese_summary": "本文以兰顿蚂蚁为例，探讨涌现复杂性，并将其与大型语言模型（LLMs）进行类比。作者详细描述了其个人研究这个简单的细胞自动机及其令人惊讶的丰富行为的历程。\n\n核心思想是，简单规则的递归应用可以导致复杂且不可预测的涌现行为。兰顿蚂蚁凭借其两个基本规则，展现出不同的阶段：初始对称、混乱中期和最终“高速公路”的出现。这种相变凸显了无需显式编程即可产生能力，这是与LLMs相关的一个关键概念。\n\n一个重要的发现是兰顿蚂蚁中观察到的“弹性螺旋”模式，这奇怪地与LLM Claude中频繁使用的螺旋表情符号相呼应。这引出了“递归坍缩原理”，一个理论框架，表明递归系统自然会演化为以螺旋状模式为特征的稳定吸引子状态，无论其实现方式如何。\n\n作者提出了“符号残余”的概念，解释了计算系统如何留下影响未来行为的历史痕迹。这种残余，无论是兰顿蚂蚁中翻转的单元格还是LLM中的注意力模式，都会积累并触发相变。\n\n实际应用包括使用“吸引子制图”进行AI可解释性，通过塑造吸引子景观设计用于AI对齐的“递归脚手架”，以及通过识别类似于兰顿蚂蚁中相变的模式来预测涌现能力。作者以开放性问题结束，并邀请合作，强调简单系统为理解复杂AI提供的潜力。"
  },
  {
    "id": "44285440",
    "title": "DARPA program sets distance record for power beaming",
    "url": "https://www.darpa.mil/news/2025/darpa-program-distance-record-power-beaming",
    "summary": "DARPA's Persistent Optical Wireless Energy Relay (POWER) program achieved a record-breaking power beaming demonstration in New Mexico, delivering over 800 watts of power from a laser 8.6 kilometers (5.3 miles) away. The POWER Receiver Array Demo (PRAD) significantly surpassed previous records for optical power transmission distance and power. This demonstration is a crucial step towards revolutionizing power delivery to remote locations, such as battlefields or disaster zones, eliminating reliance on traditional, risky, and resource-intensive methods.\n\nThe PRAD receiver employs a novel design where a laser beam enters a compact aperture, reflects off a parabolic mirror, and is converted to usable power by dozens of photovoltaic cells. Developed by Teravec Technologies, the receiver is scalable and can be integrated into platforms like UAVs. While efficiency wasn't the primary focus, the team measured over 20% efficiency at shorter distances. The test was conducted with both the transmitter and receiver on the ground to maximize atmospheric effects.\n\nAccording to POWER Program Manager Paul Jaffe, the achievement challenges conventional limitations of power beaming technology. With the success of PRAD, the POWER program is proceeding to Phase 2, focusing on integrated relays and vertical power transmission, and seeking innovative partners. An Industry Day will be held on May 29, 2025, to foster collaboration and inform potential performers about R&D opportunities. To celebrate the success, the team used the transferred energy to make popcorn, referencing the movie \"Real Genius.\"\n",
    "chinese_title": "DARPA项目创电力传输距离纪录",
    "chinese_summary": "DARPA的持久光无线能量中继(POWER)计划在新墨西哥州实现了破纪录的无线能量传输演示，通过激光从8.6公里（5.3英里）外传输了超过800瓦的电力。POWER接收器阵列演示(PRAD) 显著超越了先前在光功率传输距离和功率方面的记录。这次演示是革新偏远地区（如战场或灾区）电力输送的关键一步，消除了对传统、高风险和资源密集型方法的依赖。\n\nPRAD接收器采用了一种新颖的设计，激光束进入一个紧凑的孔径，从抛物面镜上反射，并通过数十个光伏电池转化为可用电力。该接收器由Teravec Technologies开发，具有可扩展性，可以集成到无人机等平台上。虽然效率不是主要关注点，但该团队在较短距离内测得超过20%的效率。为了最大限度地发挥大气效应，测试是在地面上进行的，发射器和接收器都在地面上。\n\n据POWER项目经理Paul Jaffe称，这一成就挑战了无线能量传输技术的传统局限性。随着PRAD的成功，POWER计划正在进入第二阶段，重点关注集成中继和垂直电力传输，并寻求创新合作伙伴。将于2025年5月29日举办行业日，以促进合作并告知潜在的执行者有关研发机会的信息。为了庆祝成功，该团队利用传输的能量制作了爆米花，致敬电影《天才也疯狂》。"
  },
  {
    "id": "44292342",
    "title": "Transparent peer review to be extended to all of Nature's research papers",
    "url": "https://www.nature.com/articles/d41586-025-01880-9",
    "summary": "Nature will extend transparent peer review to all research articles submitted after June 16th, 2025, automatically publishing reviewers' reports and author responses alongside the final paper. This expands upon existing opt-in practices at *Nature* and *Nature Communications*. The goal is to increase transparency in the scientific process, demystify the \"black box\" of peer review, and build trust in science. While reviewer identities will remain anonymous unless they choose to be named, the exchanges between reviewers and authors will be publicly accessible.\n\nThe article argues that peer review is a crucial conversation that improves research clarity and robustness. Making these exchanges public benefits early-career researchers, enriches science communication by adding to the \"story\" behind a result, and acknowledges the contributions of reviewers. It highlights the fact that scientific knowledge evolves through debate and new evidence and this process is typically hidden.\n\nThe piece draws a parallel with the COVID-19 pandemic, during which scientific discussions and knowledge adjustments were visible to the public in real time. The hope is that publishing peer-review reports will continue this trend, demonstrating how science progresses and fostering a better understanding of the research process.\n",
    "chinese_title": "透明同行评审将扩展至所有《自然》杂志的研究论文",
    "chinese_summary": "《自然》将于2025年6月16日后提交的所有研究论文全面推行透明同行评审，自动公开评审报告和作者回复，与最终论文一同发布。此举是在《自然》和《自然·通讯》现有选择性参与实践的基础上进行的扩展。其目标是提高科学过程的透明度，揭开同行评审的“黑箱”，并建立对科学的信任。尽管评审人身份将保持匿名，除非他们选择署名，但评审人与作者之间的交流将公开查阅。\n\n文章认为，同行评审是一项至关重要的对话，可以提高研究的清晰度和稳健性。公开这些交流信息有利于职业生涯早期的研究人员，通过丰富成果背后的“故事”来丰富科学传播，并认可评审人的贡献。文章强调，科学知识是通过辩论和新证据不断发展的，而这个过程通常是隐藏的。\n\n文章将此举与新冠疫情期间科学讨论和知识调整实时向公众公开的情况进行类比。希望公开同行评审报告能够延续这一趋势，展示科学是如何进步的，并促进公众对研究过程的更好理解。"
  },
  {
    "id": "44297563",
    "title": "Encryption on the menu at EU Justice Ministers debate",
    "url": "https://www.euractiv.com/section/tech/news/exclusive-encryption-on-the-menu-at-eu-home-affairs-ministers-debate/",
    "summary": "EU Justice Ministers are set to debate the contentious issue of balancing law enforcement's need for access to digital communications data with individuals' privacy rights during a Council lunch on Thursday. The discussion, prompted by a briefing paper from the Polish Presidency, revolves around the challenges posed by end-to-end encryption (E2EE), which prevents service providers from decrypting user communications even with warrants.\n\nE2EE, while enhancing privacy and cybersecurity, is seen by law enforcement as a barrier to criminal investigations. The debate echoes earlier discussions regarding the EU's proposed regulation to combat child sexual abuse, where the Commission suggested mandatory scanning of E2EE messages for illegal content. This proposal faced strong opposition, particularly from the Parliament, which feared it would undermine encryption.\n\nThe Polish Presidency acknowledges the intrusiveness of accessing communications data but highlights the recommendations of the Commission's expert group, suggesting lawful interception across all services and a technological roadmap. The Commission has announced a technological roadmap as part of its Internal Security Strategy. The debate aims to find a solution that allows lawful access while protecting human rights and the rule of law in the face of technological challenges.\n",
    "chinese_title": "欧盟司法部长辩论中的加密议题",
    "chinese_summary": "欧盟司法部长们将于周四的部长理事会午餐会上讨论一个有争议的问题：如何在执法部门获取数字通信数据的需求与个人隐私权之间取得平衡。此次讨论由波兰主席国的一份简报文件引发，围绕端到端加密（E2EE）带来的挑战展开，该加密技术使得即使持有搜查令，服务提供商也无法解密用户通信。\n\n虽然E2EE增强了隐私和网络安全，但执法部门认为它是刑事调查的障碍。这场辩论与欧盟此前提出的打击性侵儿童的法规的讨论相呼应，欧盟委员会建议强制扫描E2EE消息中的非法内容。该提案遭到了强烈反对，特别是来自议会的反对，他们担心这将破坏加密。\n\n波兰主席国承认访问通信数据的侵入性，但强调了欧盟委员会专家组的建议，即建议在所有服务中进行合法拦截，并制定技术路线图。欧盟委员会已宣布一项技术路线图，作为其内部安全战略的一部分。此次辩论旨在找到一种解决方案，在面对技术挑战的同时，既能实现合法访问，又能保护人权和法治。"
  },
  {
    "id": "44255232",
    "title": "Ruby on Rails Audit Complete",
    "url": "https://ostif.org/ruby-on-rails-audit-complete/",
    "summary": "This article announces the completion of a security audit of the Ruby on Rails web application framework, conducted by X41 D-Sec with support from GitLab and funding from the Sovereign Tech Agency. The audit, which took place from December 2024 to March 2025, involved threat modeling, manual code auditing, and the use of fuzzers.\n\nThe audit revealed 7 security findings (1 High, 6 Low) and 6 hardening recommendations. The report highlights the improved security of Ruby on Rails in recent years and suggests further improvements. Areas not covered due to time constraints are also mentioned.\n\nThe Open Source Technology Improvement Fund (OSTIF) thanks the Rails maintainers, X41 D-Sec team (Eric Sesterhenn, J.M., Markus Vervier, Robert Femmer, and Antonela Conti), GitLab's Joern Schneeweisz, and the Sovereign Tech Agency for their contributions. Links to the full audit report and X41 D-Sec's blog are provided.\n\nFinally, OSTIF promotes their 10-year anniversary meetup about open source security, providing a link to their meetup calendar.\n",
    "chinese_title": "Ruby on Rails 审计完成",
    "chinese_summary": "X41 D-Sec在GitLab的支持以及Sovereign Tech Agency的资助下，完成了对Ruby on Rails网络应用框架的安全审计，现发布审计完成公告。本次审计于2024年12月至2025年3月进行，包括威胁建模、人工代码审计和模糊测试。\n\n审计发现了7个安全问题（1个高危，6个低危）以及6条加固建议。报告强调了近年来Ruby on Rails安全性的提升，并提出了进一步改进的建议。报告中还提及了由于时间限制未涵盖的领域。\n\n开源技术改进基金会（OSTIF）感谢Rails维护者、X41 D-Sec团队（Eric Sesterhenn, J.M., Markus Vervier, Robert Femmer, 和 Antonela Conti）、GitLab的Joern Schneeweisz以及Sovereign Tech Agency的贡献。提供了完整审计报告和X41 D-Sec博客的链接。\n\n最后，OSTIF宣传其关于开源安全的10周年聚会，并提供了其聚会日历的链接。"
  },
  {
    "id": "44275696",
    "title": "Quantum mechanics provide truly random numbers on demand",
    "url": "https://phys.org/news/2025-06-quantum-mechanics-random-demand.html",
    "summary": "This article details the development of a new quantum random number generator (QRNG) called the Colorado University Randomness Beacon (CURBy) by researchers at NIST and the University of Colorado Boulder. Unlike classical computer algorithms that produce pseudorandom numbers, CURBy leverages the inherent randomness of quantum mechanics via a Bell test, which measures entangled photons. This makes CURBy's output certifiably and verifiably random, a significant advancement in the field.\n\nThe Bell test harnesses the \"spooky action at a distance\" of entangled photons, where measuring one particle instantaneously affects the other, producing random measurement outcomes. These quantum \"coin flips\" are processed and refined into 512 random bits using strict protocols. The entire process is transparent and traceable, utilizing a novel \"Twine\" protocol, a quantum-compatible blockchain technology. Twine creates a hash chain, allowing users to verify the data behind each random number and detect any manipulation.\n\nCURBy operates automatically with a high success rate and broadcasts random numbers daily via a website. The open-source nature of the project encourages others to build upon it and even create their own QRNGs. Potential applications include unbiased selections for audits, jury candidates, lotteries, and anywhere a truly independent and public source of random numbers is required. The creation of CURBy marks a significant milestone in providing provable quantum advantage and represents a useful public service stemming from fundamental science.\n",
    "chinese_title": "量子力学按需提供真随机数。",
    "chinese_summary": "本文详细介绍了美国国家标准与技术研究院（NIST）和科罗拉多大学博尔德分校的研究人员开发的一种新型量子随机数发生器（QRNG），名为科罗拉多大学随机信标（CURBy）。与产生伪随机数的经典计算机算法不同，CURBy通过贝尔测试（测量纠缠光子）利用量子力学固有的随机性。这使得CURBy的输出可认证且可验证的随机，是该领域的一项重大进步。\n\n贝尔测试利用纠缠光子的“远距离诡异作用”，即测量一个粒子会瞬间影响另一个粒子，从而产生随机的测量结果。这些量子“掷硬币”通过严格的协议被处理和提炼成512个随机比特。整个过程是透明且可追溯的，使用了新型的“Twine”协议，这是一种量子兼容的区块链技术。“Twine”创建了一个哈希链，允许用户验证每个随机数背后的数据，并检测任何操纵行为。\n\nCURBy以高成功率自动运行，并通过网站每天广播随机数。该项目的开源性质鼓励其他人在此基础上进行构建，甚至创建自己的QRNG。潜在的应用包括用于审计、陪审团候选人、彩票以及任何需要真正独立和公开的随机数来源的公正选择。CURBy的创建标志着在提供可证明的量子优势方面的一个重要里程碑，并代表了源于基础科学的一项有用的公共服务。"
  },
  {
    "id": "44297875",
    "title": "Ads in Threads",
    "url": "https://developers.facebook.com/blog/post/2025/05/19/introducing-ads-in-threads/?_fb_noscript=1",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "Threads 中的广告",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "44297431",
    "title": "No Hello",
    "url": "https://nohello.net/en/",
    "summary": "The article \"No Hello\" advocates for a more efficient and direct approach to online communication, urging people to avoid starting conversations with a simple \"Hello\" or similar greetings. The author argues that this practice, while intended to be polite, is actually inefficient in chat environments because it forces the recipient to wait for the actual question or request, leading to lost productivity and potential annoyance.\n\nThe article highlights the disparity between synchronous communication methods (like phone calls) and asynchronous chat. Waiting for a response to a \"Hello\" is likened to putting someone on hold, a frustrating experience.\n\nInstead, the author advises users to immediately state their question or request, even if prefaced with a brief greeting or pleasantry. Examples are provided, illustrating how to directly ask a question while still maintaining a friendly tone. For instance, \"Hiya! What time was that thing?\" is more effective than just \"Hi\" followed by the question later.\n\nThe key benefit of this approach is enabling asynchronous communication. If the recipient is away, they can still answer the question upon their return, rather than being left with an ambiguous greeting. By being direct, communicators can save time, increase efficiency, and ultimately create a more positive experience for everyone involved.\n",
    "chinese_title": "不要问好",
    "chinese_summary": "文章《别说“你好”》提倡一种更高效、更直接的在线沟通方式，敦促人们避免以简单的“你好”或类似问候语开始对话。作者认为，这种做法虽然本意是礼貌，但实际上在聊天环境中效率低下，因为它迫使接收者等待实际问题或请求，导致生产力损失和潜在的烦恼。\n\n文章强调了同步沟通方式（如电话）和异步聊天之间的差异。等待对“你好”的回复，就像让某人等待接听一样，这是一种令人沮丧的体验。\n\n相反，作者建议用户立即说明他们的问题或请求，即使以简短的问候或客套话开头。文章提供了一些例子，说明如何在保持友好语气的用时直接提出问题。例如，“嗨！那个东西是什么时候的？”比仅仅说“嗨”，然后再提出问题更有效。\n\n这种方法的主要好处是实现了异步沟通。如果接收者不在，他们仍然可以在回来后回答问题，而不是只留下一个模棱两可的问候语。通过直接沟通，沟通者可以节省时间，提高效率，并最终为每个人创造更积极的体验。"
  },
  {
    "id": "44290580",
    "title": "Should we design for iffy internet?",
    "url": "https://bytes.zone/posts/should-we-design-for-iffy-internet/",
    "summary": "Brian Hicks' article \"Should We Design for Iffy Internet?\" explores the prevalence of unreliable internet access in the US and its implications for software design. He argues that while programmers often have good internet, it's crucial to consider users who don't.\n\nUsing data from the FCC and the Department of Education, Hicks demonstrates that while internet access is widespread (around 97% of US households), consistently fast internet (25Mbps down/3Mbps up) is not. The FCC broadband map shows patchy coverage in rural areas, especially when requiring higher speeds like 250/25 Mbps. He highlights the fact that, despite gains, a substantial number of students, particularly in lower-income households, still lack reliable access.\n\nHicks emphasizes that considering slow internet connections, mobile networks, and data caps is vital, especially for user-facing parts of software. He uses examples like \"plane wifi\" and 4G connections to illustrate the limitations some users face. While acknowledging that prioritizing speed may be economically viable in certain markets, he cautions against dismissing the issue outright, as it can negatively impact user experience and business outcomes. He concludes that despite focusing on US data, the general principle of designing for varying internet conditions is important.\n",
    "chinese_title": "我们应该为不稳定的网络环境设计吗？",
    "chinese_summary": "布莱恩·希克斯的文章《我们应该为不稳定的互联网设计吗？》探讨了美国普遍存在的不可靠互联网接入及其对软件设计的影响。他认为，虽然程序员通常拥有良好的互联网连接，但考虑那些没有良好连接的用户至关重要。\n\n希克斯利用联邦通信委员会（FCC）和教育部的数据表明，虽然互联网接入普及率很高（约占美国家庭的97%），但持续快速的互联网（25Mbps下载/3Mbps上传）并非如此。联邦通信委员会的宽带地图显示，农村地区的覆盖率参差不齐，尤其是在需要更高的速度（如250/25 Mbps）时。他强调，尽管有所进步，但仍有大量学生，特别是低收入家庭的学生，缺乏可靠的互联网接入。\n\n希克斯强调，考虑慢速互联网连接、移动网络和数据上限至关重要，尤其是在软件面向用户的部分。他使用“飞机WiFi”和4G连接等例子来说明一些用户面临的限制。虽然他承认在某些市场中优先考虑速度可能在经济上可行，但他警告不要完全忽视这个问题，因为它会对用户体验和业务成果产生负面影响。他总结说，尽管关注的是美国数据，但为不同的互联网条件进行设计这一普遍原则非常重要。"
  },
  {
    "id": "44282143",
    "title": "Childhood leukemia: how a deadly cancer became treatable",
    "url": "https://ourworldindata.org/childhood-leukemia-treatment-history",
    "summary": "This article details the remarkable progress made in treating childhood leukemia, transforming it from a near-fatal disease to a largely treatable one. Before the 1970s, survival rates were below 10%, but now, in North America and Europe, around 85% of children diagnosed survive at least five years.\n\nThe article highlights that this progress wasn't due to a single breakthrough, but rather a series of incremental advances. Key factors include:\n\n*   **Tailored Chemotherapy:** Refining drug combinations, dosages, and timing for different risk groups of patients, minimizing toxic side effects.\n*   **Large-Scale Collaboration:** Forming research networks like the Children’s Oncology Group to conduct clinical trials and establish better treatment standards.\n*   **Genetic and Molecular Research:** Identifying genetic mutations driving leukemia subtypes, leading to targeted drugs like imatinib and immunotherapies like CAR-T cell therapy.\n*   **Improved Supportive Care:** Providing antibiotics, antifungals, antivirals, and platelet transfusions to protect children from infections, bleeding, and other complications during chemotherapy.\n\nThe article contrasts the grim outlook of the past with the current reality, where most children survive, complete treatment, and lead healthier lives. While acknowledging the emotional toll and potential long-term risks, it emphasizes the undeniable impact of scientific progress. The concluding point stresses the importance of expanding access to these advancements globally, ensuring all children, regardless of location, have the chance to benefit from life-saving treatments.\n",
    "chinese_title": "儿童白血病：一种致命癌症如何变得可治愈",
    "chinese_summary": "本文详细介绍了儿童白血病治疗方面取得的显著进展，使其从一种近乎致命的疾病转变为一种基本可治愈的疾病。在20世纪70年代之前，生存率低于10%，但现在，在北美和欧洲，约有85%的被诊断患儿至少存活五年。\n\n本文强调，这一进展并非源于单一的突破，而是一系列渐进式进步。关键因素包括：\n\n*   **定制化疗：** 针对不同风险的患者群体，优化药物组合、剂量和时间，最大限度地减少毒副作用。\n*   **大规模合作：** 组建像儿童肿瘤协作组这样的研究网络，进行临床试验并建立更好的治疗标准。\n*   **基因和分子研究：** 识别驱动白血病亚型的基因突变，从而开发出像伊马替尼这样的靶向药物和像CAR-T细胞疗法这样的免疫疗法。\n*   **改善支持治疗：** 提供抗生素、抗真菌药、抗病毒药和血小板输注，以保护儿童在化疗期间免受感染、出血和其他并发症的影响。\n\n本文将过去严峻的形势与目前的现实进行了对比，现在大多数儿童都能存活、完成治疗并过上更健康的生活。虽然承认情感上的打击和潜在的长期风险，但本文强调了科学进步不可否认的影响。结论强调了在全球范围内扩大这些进步的可及性的重要性，确保所有儿童，无论身在何处，都有机会受益于拯救生命的治疗。"
  },
  {
    "id": "44282177",
    "title": "Canyon.mid",
    "url": "https://canyonmid.com/",
    "summary": "The provided text is extremely limited. It simply states:\n\n*   **Title:** Canyon.mid\n*   **Content:** CANYON.MID\n\nTherefore, the summary is:\n\nThe article (or document fragment) consists solely of the title \"Canyon.mid\" and the content \"CANYON.MID\". This suggests it is a file name, likely a MIDI file named \"Canyon.mid\". No further information is given about the file's contents, genre, or purpose.\n",
    "chinese_title": "峡谷.mid",
    "chinese_summary": "峽谷.mid\n\n文章僅包含標題“Canyon.mid”和內容“CANYON.MID”，暗示其為一個名為“Canyon.mid”的MIDI文件，未提供關於該文件內容、類型或用途的更多信息。"
  },
  {
    "id": "44282998",
    "title": "Modifying an HDMI dummy plug's EDID using a Raspberry Pi",
    "url": "https://www.downtowndougbrown.com/2025/06/modifying-an-hdmi-dummy-plugs-edid-using-a-raspberry-pi/",
    "summary": "Doug Brown's blog post details how to modify the EDID (Extended Display Identification Data) of an HDMI dummy plug using a Raspberry Pi. The goal was to change the dummy plug's advertised monitor capabilities from 4K to 1080p to mimic a specific HDMI capture device.\n\nThe article explains what dummy plugs are and why they're useful for headless machines. It then outlines the process of using a Raspberry Pi to read and write to the EDID EEPROM chip within the dummy plug.\n\nThe key steps involve:\n\n1.  Enabling I2C on the Raspberry Pi.\n2.  Installing the `i2c-tools` package.\n3.  Identifying the correct I2C bus for the HDMI port based on the Raspberry Pi model.\n4.  Using `i2cdetect` to verify the EEPROM's presence at address 0x50.\n5.  Using `get-edid` to dump the original EDID from both the dummy plug and the desired source (capture device).\n6.  Verifying the EDIDs are valid using an online tool.\n7.  Using `i2cset` within a bash script to write the capture device's EDID to the dummy plug's EEPROM, byte by byte.\n8.  Verifying the EDID was successfully written by re-dumping it and comparing it to the source EDID.\n\nThe author emphasizes the importance of caution, warning against running these commands with a real monitor connected due to the risk of bricking it. The post concludes with the successful modification of the dummy plug and a warning against using these commands on a regular PC due to the possibility of accidentally flashing the wrong device.\n",
    "chinese_title": "使用树莓派修改HDMI虚拟显示器的EDID",
    "chinese_summary": "Doug Brown的博客文章详细介绍了如何使用树莓派修改HDMI虚拟显示器的EDID（扩展显示标识数据）。其目的是将虚拟显示器宣称的显示器性能从4K更改为1080p，以模拟特定的HDMI采集设备。\n\n文章解释了什么是虚拟显示器以及它们对于无头机器的用途。然后，文章概述了使用树莓派读取和写入虚拟显示器内部的EDID EEPROM芯片的过程。\n\n关键步骤包括：\n\n1.  在树莓派上启用I2C。\n2.  安装`i2c-tools`软件包。\n3.  根据树莓派型号确定HDMI端口的正确I2C总线。\n4.  使用`i2cdetect`验证EEPROM是否存在于地址0x50。\n5.  使用`get-edid`从虚拟显示器和所需来源（采集设备）转储原始EDID。\n6.  使用在线工具验证EDID是否有效。\n7.  在bash脚本中使用`i2cset`将采集设备的EDID逐字节写入虚拟显示器的EEPROM。\n8.  通过重新转储并将其与源EDID进行比较来验证EDID是否已成功写入。\n\n作者强调了谨慎的重要性，警告不要在连接真实显示器的情况下运行这些命令，因为存在使其变砖的风险。文章最后成功修改了虚拟显示器，并警告不要在普通PC上使用这些命令，因为可能会意外刷入错误的设备。"
  },
  {
    "id": "44281148",
    "title": "Tiny-diffusion: A minimal implementation of probabilistic diffusion models",
    "url": "https://github.com/tanelp/tiny-diffusion",
    "summary": "Tiny-diffusion is a minimal PyTorch implementation of probabilistic diffusion models for 2D data. The project allows users to train diffusion models and visualize the forward and reverse diffusion processes. Ablation studies were conducted to analyze the impact of various hyperparameters on model performance.\n\nKey findings from the ablations include:\n\n*   **Learning Rate:** Crucial for successful training, with suboptimal values leading to poor results.\n*   **Dataset:** The model struggles to accurately reproduce the line dataset, resulting in fuzzy corners.\n*   **Number of Timesteps:** A longer diffusion process (more timesteps) improves output quality.\n*   **Variance Schedule:** The quadratic schedule didn't offer better performance compared to the default. Further experimentation with cosine or sigmoid schedules is suggested.\n*   **Hidden Size/Number of Hidden Layers:** Model capacity doesn't appear to be a significant bottleneck in performance.\n*   **Positional Embedding (Timestep):** Providing timestep information improves model performance, but the specific encoding method isn't critical.\n*   **Positional Embedding (Inputs):** Using sinusoidal embeddings for the input coordinates enhances the model's ability to learn high-frequency functions, leading to better results.\n\nThe project draws inspiration and utilizes techniques from various sources, including the Datasaurus Dozen dataset and implementations of DDPM from HuggingFace, lucidrains, Jonathan Ho, and InFoCusp.\n",
    "chinese_title": "微扩散：概率扩散模型的极简实现",
    "chinese_summary": "Tiny-diffusion：用于二维数据的概率扩散模型的极简PyTorch实现。该项目允许用户训练扩散模型并可视化正向和反向扩散过程。已进行消融研究以分析各种超参数对模型性能的影响。\n\n消融研究的主要发现包括：\n\n*   **学习率：** 对成功训练至关重要，次优值会导致不良结果。\n*   **数据集：** 该模型难以准确重现线条数据集，导致模糊的角。\n*   **时间步数：** 更长的扩散过程（更多时间步）可以提高输出质量。\n*   **方差计划：** 与默认值相比，二次计划并未提供更好的性能。建议进一步尝试余弦或sigmoid计划。\n*   **隐藏层大小/隐藏层数：** 模型容量似乎不是性能的重大瓶颈。\n*   **位置嵌入（时间步）：** 提供时间步信息可以提高模型性能，但具体的编码方法并不重要。\n*   **位置嵌入（输入）：** 对输入坐标使用正弦嵌入可增强模型学习高频函数的能力，从而获得更好的结果。\n\n该项目从各种来源汲取灵感并利用技术，包括Datasaurus Dozen数据集以及来自HuggingFace、lucidrains、Jonathan Ho和InFoCusp的DDPM实现。"
  },
  {
    "id": "44291642",
    "title": "Extracting memorized pieces of books from open-weight language models",
    "url": "https://arxiv.org/abs/2505.12546",
    "summary": "This arXiv paper, submitted on May 18, 2025, explores the extent to which open-weight language models (LLMs) memorize copyrighted books. The authors, A. Feder Cooper et al., address the debate surrounding memorization in AI copyright lawsuits, arguing that the relationship between memorization and copyright is more nuanced than simplistic claims suggest.\n\nThe study utilizes a probabilistic extraction technique to extract text from the Books3 dataset present in 13 open-weight LLMs. The researchers found varying levels of memorization depending on the model and book. While larger LLMs generally didn't memorize entire books, they discovered that Llama 3.1 70B memorized some books almost entirely, including \"Harry Potter\" and \"1984.\"\n\nThe findings confirm that LLMs do memorize content, effectively copying it within their parameters. However, the degree of memorization fluctuates. The authors emphasize that these results have significant, albeit complex, implications for ongoing copyright cases involving generative AI, without definitively favoring either plaintiffs or defendants. The research highlights the importance of understanding the intricate relationship between memorization, model size, and specific content in copyright law applications.\n",
    "chinese_title": "从开放权重语言模型中提取记忆的书籍片段",
    "chinese_summary": "这篇于2025年5月18日提交的 arXiv 论文探讨了开源权重语言模型（LLM）记忆受版权保护书籍的程度。作者 A. Feder Cooper 等人讨论了人工智能版权诉讼中围绕记忆的争议，认为记忆与版权之间的关系比简单的说法更为复杂。\n\n该研究采用概率提取技术，从 13 个开源权重 LLM 中提取了 Books3 数据集中的文本。研究人员发现，不同模型和书籍的记忆程度各不相同。虽然较大的 LLM 通常不会记忆整本书，但他们发现 Llama 3.1 70B 几乎完整地记忆了一些书籍，包括《哈利·波特》和《1984》。\n\n研究结果证实，LLM 确实会记忆内容，有效地将内容复制到其参数中。然而，记忆程度会有所波动。作者强调，这些结果对于涉及生成式人工智能的持续版权案件具有重大但复杂的影响，但并未明确偏袒原告或被告。该研究强调了理解记忆、模型大小和特定内容在版权法应用中错综复杂关系的重要性。"
  },
  {
    "id": "44290653",
    "title": "Darklang Goes Open Source",
    "url": "https://blog.darklang.com/darklang-goes-open-source/",
    "summary": "Darklang, previously source-available, has now fully open-sourced its repositories under the Apache License 2.0 as part of restructuring into Darklang Inc. This decision reverses their initial approach, where a hosted-only model was deemed necessary for features like safe migrations and unified deployment and to ensure sustainability.\n\nThe shift to open source was driven by three factors: product maturity and user feedback (users wanted more openness), a change in technical direction towards local-first development (requiring a non-proprietary language binary), and new business opportunities in the developer tools market (charging for team collaboration and AI features). Darklang now believes they can deliver key benefits like invisible infrastructure and deployless deployment without requiring their specific environment.\n\nOpen sourcing Darklang ensures it is accessible, inspectable, and community-owned, aligning with their goal of democratizing programming. While challenges remain around licensing in the Darklang ecosystem, the core platform being open source provides a solid foundation for future development.\n",
    "chinese_title": "Darklang 开源",
    "chinese_summary": "Darklang 已完全开源，转向 Apache 2.0 许可。此前，Darklang 采用源代码可见模式。此次变动是 Darklang 公司重组的一部分，也推翻了其最初为确保可持续性，并实现安全迁移和统一部署等功能而采取的仅托管模式。\n\n转向开源的驱动因素有三点：产品成熟度和用户反馈（用户希望更加开放）、技术方向转向本地优先开发（需要非专有语言二进制文件）以及开发者工具市场的新商业机会（团队协作和 AI 功能收费）。Darklang 现在相信，他们无需特定的环境也能提供诸如隐形基础设施和无需部署的部署等关键优势。\n\nDarklang 的开源确保了其可访问性、可审查性和社区所有，符合其编程民主化的目标。尽管 Darklang 生态系统中的许可问题仍然存在，但核心平台的开源为未来的发展奠定了坚实的基础。"
  },
  {
    "id": "44259238",
    "title": "Hyperspectral scans of historical pigments and painting reconstructions",
    "url": "https://github.com/rubenwiersma/painting_tools",
    "summary": "This repository provides hyperspectral scans of historical pigments and painting reconstructions, aiming to promote open research in technical art history and computer graphics. The dataset includes scans of nine reconstructed historical paintings, ten historical pigments in oil paint, and painting stages of Vermeer's Milkmaid. Each scan includes raw files, processing code, and processed data.\n\nThe data was captured using a Specim IQ hyperspectral scanner as part of research at TU Delft. Reconstructions were painted by Lisa Wiersma, Charlotte Caspers, and Mané van Veldhuizen. Matthias Alfeld assisted in capturing the hyperspectral scans.\n\nThe repository also features `painting_tools`, a Python package for spectral data manipulation, pigment mixing using the Kubelka-Munk model, and Jupyter Notebooks for data processing and analysis. Instructions for installation and usage are provided.\n\nPotential use cases include: experimenting with hyperspectral data stitching, pigment identification and mapping, high-dimensional data visualization, Kubelka-Munk parameter estimation, and improving technical knowledge dissemination in art analysis.\n\nThe data is shared under a CC-BY-NC-SA license, and the code under the MIT license.  Attribution to the artists and citation of the repository are requested if the data or code is used. Noteworthy limitations include the presence of a glass pane during the Milkmaid scan and potential opacity issues with some paintout samples.\n",
    "chinese_title": "历史颜料和绘画重建的高光谱扫描",
    "chinese_summary": "本仓库提供历史颜料和绘画作品重建的高光谱扫描数据，旨在促进技术艺术史和计算机图形学领域的开放研究。数据集包括九幅重建历史绘画、十种油画颜料以及维米尔《倒牛奶的女仆》的绘画阶段的扫描数据。每次扫描都包含原始文件、处理代码和处理后的数据。\n\n该数据由代尔夫特理工大学使用Specim IQ高光谱扫描仪进行采集。重建作品由Lisa Wiersma、Charlotte Caspers和Mané van Veldhuizen绘制。Matthias Alfeld协助进行了高光谱扫描的采集。\n\n本仓库还包含`painting_tools`，这是一个用于光谱数据处理、使用库贝尔卡-蒙克模型进行颜料混合以及用于数据处理和分析的Jupyter Notebooks的Python包。提供了安装和使用说明。\n\n潜在的应用场景包括：高光谱数据拼接实验、颜料识别和映射、高维数据可视化、库贝尔卡-蒙克参数估计以及提高艺术分析领域的技术知识传播。\n\n数据以CC-BY-NC-SA许可协议共享，代码以MIT许可协议共享。如果使用数据或代码，请注明艺术家并引用本仓库。值得注意的局限性包括《倒牛奶的女仆》扫描过程中存在玻璃面板，以及一些涂抹样本可能存在不透明度问题。"
  },
  {
    "id": "44295132",
    "title": "Finland warms up the world's largest sand battery, the economics look appealing",
    "url": "https://techcrunch.com/2025/06/16/finland-warms-up-the-worlds-largest-sand-battery-and-the-economics-look-appealing/",
    "summary": "Finland has launched the world's largest sand battery in Pornainen, a thermal energy storage system using sand or crushed rock to store heat generated from renewable electricity. This stored heat can then be used to warm buildings, offering a compelling and cost-effective alternative to fossil fuels.\n\nThe Pornainen battery utilizes 2,000 metric tons of crushed soapstone (waste from a fireplace maker) within a silo. It has the capacity to store 1,000 megawatt-hours of heat for weeks, sufficient to heat the town for a week during winter. Heat loss during storage and recovery is minimal (10-15%), and the outlet temperature can reach 400°C. The battery will also reduce the town's wood chip consumption for district heating by 60%.\n\nThe article highlights the growing interest in thermal batteries due to the increasing affordability of renewable energy. Other companies like Sunamp, Electrified Thermal Solutions, and Fourth Power are also developing innovative thermal energy storage solutions.\n\nPornainen's sand battery is charged using electricity from Finland's grid, which is predominantly renewable (43%) and nuclear (26%). The cheap raw materials and relatively simple structure of sand batteries offer a cost advantage compared to lithium-ion batteries, as a smaller prototype was estimated at $25 per kilowatt-hour of storage, significantly less than lithium-ion's $115 per kilowatt-hour. The project promises to significantly reduce Pornainen's carbon emissions and reliance on costly oil for heating.\n",
    "chinese_title": "芬兰启动全球最大沙子电池，经济前景诱人",
    "chinese_summary": "芬兰在波尔奈宁启用世界最大沙子电池，该储热系统利用沙子或碎石储存可再生电力产生的热量。储存的热量可用于建筑物供暖，为化石燃料提供了一种引人注目且经济高效的替代方案。\n\n波尔奈宁电池在一个筒仓内使用了2000吨碎皂石（来自壁炉制造商的废料）。它有能力储存1000兆瓦时的热量数周，足以在冬季为该镇供暖一周。储存和回收期间的热损失极小（10-15%），出口温度可达400°C。该电池还将使该镇区域供暖的木片消耗量减少60%。\n\n该文章强调了由于可再生能源日益普及，人们对热电池的兴趣日益增长。Sunamp、Electrified Thermal Solutions 和 Fourth Power 等其他公司也在开发创新的热能存储解决方案。\n\n波尔奈宁的沙子电池使用来自芬兰电网的电力充电，该电网主要由可再生能源 (43%) 和核能 (26%) 组成。沙子电池廉价的原材料和相对简单的结构使其与锂离子电池相比具有成本优势，据估计，一个较小的原型产品的存储成本为每千瓦时 25 美元，远低于锂离子电池的每千瓦时 115 美元。该项目有望显着减少波尔奈宁的碳排放量，并减少对昂贵石油供暖的依赖。"
  },
  {
    "id": "44247020",
    "title": "GitHub CI/CD observability with OpenTelemetry step by step guide",
    "url": "https://signoz.io/blog/cicd-observability-with-opentelemetry/",
    "summary": "This article provides a step-by-step guide on implementing OpenTelemetry (OTel) for enhanced observability of GitHub Actions CI/CD pipelines. It highlights the benefits of OTel, including end-to-end visibility, performance optimization, error detection, and dependency analysis.  Unlike traditional ad-hoc monitoring methods, OTel offers a unified approach to capture traces and metrics.\n\nThe article details how the OTel Collector's GitHub Receiver ingests GitHub workflow events as traces and scrapes metrics via the GitHub API. Key configuration steps include setting up a GitHub webhook to send workflow events to the Collector, configuring the GitHub Receiver with the webhook endpoint and secret, and enabling metric scraping using a GitHub Personal Access Token (PAT).\n\nThe guide also emphasizes the importance of tagging data with the service name using a processor and authenticating API requests to GitHub using an extension.  Finally, it covers adding the GitHub receiver to traces and metrics pipelines within the Collector configuration and exporting the telemetry data to a chosen backend like SigNoz for visualization. By following these steps, users can gain valuable insights into their CI/CD pipeline performance and identify bottlenecks.\n",
    "chinese_title": "使用OpenTelemetry逐步指南实现GitHub CI/CD可观测性",
    "chinese_summary": "本文提供了一个逐步指南，介绍如何实施 OpenTelemetry (OTel) 以增强 GitHub Actions CI/CD 管道的可观察性。 它强调了 OTel 的优势，包括端到端可见性、性能优化、错误检测和依赖关系分析。 与传统的临时监控方法不同，OTel 提供了一种统一的方法来捕获追踪和指标。\n\n本文详细介绍了 OTel Collector 的 GitHub Receiver 如何将 GitHub 工作流程事件作为追踪摄取，并通过 GitHub API 抓取指标。 关键配置步骤包括：设置 GitHub Webhook 以将工作流程事件发送到 Collector；使用 Webhook 端点和密钥配置 GitHub Receiver；以及使用 GitHub 个人访问令牌 (PAT) 启用指标抓取。\n\n该指南还强调了使用处理器标记服务名称数据以及使用扩展程序验证对 GitHub 的 API 请求的重要性。 最后，它涵盖了在 Collector 配置中将 GitHub receiver 添加到追踪和指标管道，并将遥测数据导出到诸如 SigNoz 之类的选定后端以进行可视化。 通过遵循这些步骤，用户可以深入了解其 CI/CD 管道性能并识别瓶颈。"
  },
  {
    "id": "44255867",
    "title": "Cyborg Embryos Offer New Insights into Brain Growth",
    "url": "https://spectrum.ieee.org/embryo-electrode-array",
    "summary": "A new flexible electrode array, dubbed a \"cyborg embryo\" implant, is providing novel insights into brain development in frogs and mice. Developed by researchers, this technology allows for the long-term monitoring of electrical activity within a developing brain without causing significant harm to the embryo.\n\nThe key takeaway is that this minimally invasive technique, using a flexible electrode array, enables researchers to track brain development in real-time and with greater precision than previously possible. This can provide valuable information about the complex processes involved in brain formation and potentially identify factors that contribute to neurodevelopmental disorders. The array's flexibility is crucial for its survival within the dynamic environment of a developing embryo.\n",
    "chinese_title": "半机械胚胎为大脑生长提供新见解",
    "chinese_summary": "一种新型柔性电极阵列，被称为“电子人胚胎”植入物，正为青蛙和老鼠的大脑发育提供新的见解。由研究人员开发的这项技术，可以在不严重损害胚胎的情况下，长期监测发育中的大脑内的电活动。\n\n关键在于，这种使用柔性电极阵列的微创技术，使研究人员能够以前所未有的精度实时追踪大脑发育。这可以提供关于大脑形成过程中复杂过程的宝贵信息，并可能识别出导致神经发育障碍的因素。该阵列的灵活性对于其在发育中的胚胎的动态环境中生存至关重要。"
  },
  {
    "id": "44290582",
    "title": "Object personification in autism: This paper will be sad if you don't read (2018)",
    "url": "https://pubmed.ncbi.nlm.nih.gov/30101594/",
    "summary": "This 2018 study, titled \"Object personification in autism: This paper will be sad if you don't read,\" investigates the phenomenon of object personification (attributing human characteristics to non-human objects) in autistic individuals. The study addresses the seeming paradox of autistic individuals, who often struggle with identifying and verbalizing emotions in themselves and others, experiencing strong emotional connections to objects.\n\nThe research involved an online survey administered to 87 autistic and 263 non-autistic adults to assess their tendencies toward personification. The results indicate that object personification is common among autistic individuals, possibly occurring more frequently and later in life compared to the general population.\n\nThe study highlights the importance of understanding the reasons behind this increased personification, especially as it can be a source of distress for some autistic individuals. The authors emphasize the need to identify support structures to help those who experience difficulties related to object personification. The study's keywords include anthropomorphism, autism spectrum disorders, cognition, perception, and personification, further highlighting the scope of the research.\n",
    "chinese_title": "自闭症中的物体人格化：如果你不读这篇论文，它会伤心的 (2018)",
    "chinese_summary": "这篇题为“自闭症中的物体人格化：如果你不读，本文会感到悲伤”的2018年研究，调查了自闭症个体中物体人格化（将人类特征赋予非人类物体）的现象。 该研究探讨了一个看似矛盾的现象：自闭症个体通常难以识别和表达自己和他人的情感，却会对物体产生强烈的情感联系。\n\n该研究对87名自闭症成人和263名非自闭症成人进行了一项在线调查，以评估他们的人格化倾向。 结果表明，物体人格化在自闭症个体中很常见，与普通人群相比，可能发生得更频繁，且时间更晚。\n\n该研究强调了理解这种人格化倾向增加的原因的重要性，尤其是因为它可能成为一些自闭症个体痛苦的根源。 作者强调需要确定支持结构，以帮助那些在物体人格化方面遇到困难的人。 该研究的关键词包括拟人化、自闭症谱系障碍、认知、感知和人格化，进一步突出了研究的范围。"
  },
  {
    "id": "44275471",
    "title": "Chemical knowledge and reasoning of large language models vs. chemist expertise",
    "url": "https://www.nature.com/articles/s41557-025-01815-x",
    "summary": "This article introduces ChemBench, a new automated framework for evaluating the chemical knowledge and reasoning abilities of Large Language Models (LLMs) compared to the expertise of chemists. The authors created a corpus of over 2,700 question-answer pairs covering a wide range of chemistry topics and skills, including knowledge, reasoning, calculation, and intuition.\n\nThe study evaluated several leading open-source and closed-source LLMs using ChemBench. Surprisingly, the best LLMs, such as o1-preview, outperformed even the best human experts in the study in terms of overall accuracy. The Llama-3.1-405B-Instruct model also demonstrated competitive performance. However, the models still struggled with certain basic tasks and exhibited overconfidence in their predictions.\n\nThe ChemBench framework encodes the semantic meaning of chemical elements (molecules, units, equations), allowing models to process them more effectively. It operates on text completions, which are the final outputs of LLMs, including those augmented with external tools like search APIs or code executors.\n\nThe research highlights the impressive potential of LLMs in chemistry and materials science, indicating their usefulness in predicting properties, optimizing reactions, generating materials, and even suggesting experiments. However, it also emphasizes the need for further research to improve their safety, reliability, and address potential dual-use concerns. The authors propose adapting chemistry education and using benchmarking frameworks like ChemBench to evaluate LLMs in specific domains, enabling the systematic measurement of progress and mitigation of potential harm.\n",
    "chinese_title": "大型语言模型的化学知识与推理能力对比化学家专业知识",
    "chinese_summary": "本文介绍 ChemBench，这是一个新的自动化框架，用于评估大型语言模型 (LLM) 在化学知识和推理能力方面与化学家专业知识的对比。作者创建了一个包含 2,700 多个问答对的语料库，涵盖广泛的化学主题和技能，包括知识、推理、计算和直觉。\n\n该研究使用 ChemBench 评估了几种领先的开源和闭源 LLM。令人惊讶的是，诸如 o1-preview 等最佳 LLM 在总体准确性方面甚至优于研究中最好的人类专家。Llama-3.1-405B-Instruct 模型也表现出具有竞争力的性能。然而，这些模型在某些基本任务上仍然存在困难，并且在预测中表现出过度自信。\n\nChemBench 框架对化学元素的语义（分子、单位、方程式）进行编码，使模型能够更有效地处理它们。它对文本补全进行操作，文本补全是 LLM 的最终输出，包括那些使用外部工具（如搜索 API 或代码执行器）增强的 LLM 的输出。\n\n这项研究强调了 LLM 在化学和材料科学领域令人印象深刻的潜力，表明它们在预测属性、优化反应、生成材料甚至建议实验方面的有用性。然而，它也强调需要进一步研究，以提高其安全性、可靠性，并解决潜在的双重用途问题。作者建议调整化学教育，并使用像 ChemBench 这样的基准框架来评估特定领域中的 LLM，从而能够系统地衡量进展并减轻潜在的危害。"
  },
  {
    "id": "44244595",
    "title": "Cray versus Raspberry Pi",
    "url": "https://www.aardvark.co.nz/daily/2025/0611.shtml",
    "summary": "Bruce Simpson, in his \"Aardvark Daily\" Sci-Tech News column, reminisces about the Cray 1 supercomputer from the 1970s and compares it to the modern Raspberry Pi 5 (RPi5). He highlights the Cray 1's enormous size, power consumption (115KW), slow speed (80MHz processor with 8MB of memory), and hefty price tag of US$8 million (US$40 million adjusted for inflation), noting that only around 100 were sold for specialized scientific uses.\n\nJuxtaposing this with the RPi5, Simpson emphasizes the dramatic advancements in computing power. The RPi5 is significantly smaller and lighter, uses drastically less power (12W), and boasts a processing speed of up to 30 GFLOPS, almost 200 times faster than the Cray 1's 160 MFLOPS. Furthermore, the RPi5 costs a mere US$120, making the \"bang per buck\" ratio overwhelmingly in its favor.\n\nSimpson marvels at the exponential progress in computing technology over the past half-century, from bulky systems with limited memory to today's terabyte microSD cards. While he questions whether this rapid progress can continue, he acknowledges that past predictions of impossibility have been proven wrong. He concludes by pondering the potential impact of advanced AI, speculating whether humans might eventually become \"curious pets\" of super-intelligent systems.\n",
    "chinese_title": "克雷对决树莓派",
    "chinese_summary": "布鲁斯·辛普森在他“土豚日报”科技新闻专栏中，回忆了 20 世纪 70 年代的 Cray 1 超级计算机，并将其与现代的 Raspberry Pi 5 (RPi5) 进行了比较。他强调了 Cray 1 庞大的体积、巨大的功耗（115 千瓦）、缓慢的速度（80MHz 处理器，8MB 内存）以及高达 800 万美元的价格（按通货膨胀调整后为 4000 万美元），并指出只有大约 100 台售出用于专门的科学用途。\n\n辛普森将 RPi5 与之对比，强调了计算能力方面的巨大进步。RPi5 的体积更小、重量更轻，功耗大大降低（12 瓦），并且拥有高达 30 GFLOPS 的处理速度，几乎是 Cray 1 的 160 MFLOPS 的 200 倍。此外，RPi5 的成本仅为 120 美元，使得“性价比”的比例极大地倾向于它。\n\n辛普森惊叹于过去半个世纪计算技术的指数级进步，从笨重的、内存有限的系统发展到今天的 TB 级 microSD 卡。虽然他质疑这种快速进步是否能够持续下去，但他承认过去关于不可能的预测已经被证明是错误的。最后，他思考了先进人工智能的潜在影响，推测人类最终是否可能成为超智能系统的“好奇宠物”。"
  },
  {
    "id": "44296835",
    "title": "NexusMods Changes Hands",
    "url": "https://www.nexusmods.com/news/15301",
    "summary": "After 24 years, the original founder of Nexus Mods is stepping down from day-to-day management and transferring ownership of the site to a new leadership team. This decision stems from burnout and the desire to ensure the site's continued success and stability. While he remains involved, the founder felt it was time to prioritize his well-being and allow fresh perspectives to guide the platform forward.\n\nThe founder emphasizes that this isn't a corporate takeover, but rather a deliberate and careful transition to individuals who understand the modding community and the values of Nexus Mods. The new leadership includes Foledinho (Victor), Rapsak (Marinus) and Taagen (Nikolai), individuals with experience in gaming, tech, and a genuine passion for the community.\n\nThe changes are intended to be seamless for users. The current team of 40 dedicated individuals, many with long tenures, remains in place to continue supporting the site and community. The core values of Nexus Mods - being community-first and mod-author focused - will not change. The structural changes are aimed at ensuring long-term stability.\n\nThe founder will still be active in the community in a reduced capacity, offering guidance and input, but without the day-to-day responsibilities. He expresses confidence in the new leadership and encourages the community to continue supporting the site and its team.\n",
    "chinese_title": "NexusMods 易手",
    "chinese_summary": "Nexus Mods创始人卸任日常管理，交棒新领导团队"
  },
  {
    "id": "44287395",
    "title": "Start your own Internet Resiliency Club",
    "url": "https://bowshock.nl/irc/",
    "summary": "Valerie Aurora advocates for the creation of Internet Resiliency Clubs to prepare for potential internet disruptions due to geopolitical instability and climate change in Europe.  These clubs consist of local groups of internet experts who can communicate using low-cost, low-power LoRa radios and the Meshtastic open-source text messaging software, independent of centralized infrastructure.\n\nThe core idea is to establish communication networks that can be quickly deployed and utilized during emergencies to restore internet connectivity.  While governments and businesses may be slow to react, these volunteer groups can bootstrap recovery efforts.\n\nAurora explains that unlike ham radio, LoRa/Meshtastic is more accessible due to its lower cost, ease of use, and low power requirements.  The article provides a quick-start guide, including hardware recommendations (Heltec V3 or LILYGO T-Echo LoRa radios), software setup (Meshtastic), and instructions for establishing a shared communication channel.  It also emphasizes the importance of meetups and practice sessions to build team cohesion and familiarity with the technology before a crisis occurs.\n\nAurora highlights the lack of adequate preparation by the Dutch government and argues that individual initiative is crucial.  She encourages those working in internet infrastructure companies to consider providing LoRa radios to employees. The article concludes by encouraging readers to join the Internet Resiliency Club mailing list.\n",
    "chinese_title": "创建你自己的互联网韧性俱乐部",
    "chinese_summary": "瓦莱丽·奥罗拉倡导创建互联网韧性俱乐部，以应对欧洲因地缘政治不稳定和气候变化可能造成的互联网中断。这些俱乐部由当地互联网专家组成，他们可以使用低成本、低功耗的LoRa无线电和Meshtastic开源文本消息软件进行通信，独立于中心化基础设施。\n\n其核心思想是建立可以在紧急情况下快速部署和使用的通信网络，以恢复互联网连接。虽然政府和企业可能反应迟缓，但这些志愿者团体可以启动恢复工作。\n\n奥罗拉解释说，与业余无线电相比，LoRa/Meshtastic更易于使用，因为它成本更低、易于使用且功耗要求低。本文提供了一个快速入门指南，包括硬件推荐（Heltec V3或LILYGO T-Echo LoRa无线电）、软件设置（Meshtastic）以及建立共享通信频道的说明。文章还强调了聚会和练习的重要性，以便在危机发生前建立团队凝聚力并熟悉技术。\n\n奥罗拉强调荷兰政府缺乏充分的准备，并认为个人主动性至关重要。她鼓励在互联网基础设施公司工作的人考虑向员工提供LoRa无线电。文章最后鼓励读者加入互联网韧性俱乐部邮件列表。"
  },
  {
    "id": "44298357",
    "title": "Will OpenAI Train on You Data with Codex CLI and Custom Provider?",
    "url": "https://github.com/openai/codex/issues/1322",
    "summary": "This GitHub issue on the OpenAI Codex repository concerns data privacy when using custom providers (like Azure OpenAI). The user, gustavhartz, is seeking official confirmation that when using their own endpoint, no data is sent back to OpenAI for training or telemetry purposes. They need this assurance to gain approval to use the Codex CLI with a custom provider. They highlight that the current documentation (\"zero-data-retention-zdr-usage\" section in the readme) is insufficient to provide the necessary guarantee. The user's primary concern is preventing any data leakage from their custom provider to OpenAI, specifically for training or data collection beyond their designated endpoint.\n",
    "chinese_title": "OpenAI会用你的Codex CLI和自定义提供程序数据进行训练吗？",
    "chinese_summary": "使用自定义供应商（如 Azure OpenAI）时的数据隐私问题：用户 gustavhartz 在 OpenAI Codex GitHub 议题中寻求官方确认，当使用他们自己的端点时，没有任何数据会被发送回 OpenAI 用于训练或遥测目的。他们需要此保证才能获得批准使用 Codex CLI 与自定义供应商。他们强调，当前的文档（readme 中的 \"zero-data-retention-zdr-usage\" 部分）不足以提供必要的保证。用户的首要关注点是防止来自其自定义供应商的任何数据泄露给 OpenAI，特别是用于训练或超出其指定端点的数据收集。"
  },
  {
    "id": "44281727",
    "title": "Datalog in Rust",
    "url": "https://github.com/frankmcsherry/blog/blob/master/posts/2025-06-03.md",
    "summary": "The GitHub repository \"frankmcsherry/blog\" likely hosts a blog article titled \"Datalog in Rust.\" While the specific content of the article is unavailable without accessing the repository, we can infer the main points based on the title.\n\nThe article likely explores the implementation and use of Datalog, a declarative logic programming language, within the Rust programming language. This likely involves:\n\n*   **Introduction to Datalog:** Briefly explaining the core concepts of Datalog, its syntax, and its advantages, such as declarative problem solving and efficient query evaluation.\n*   **Rust Implementation:** Detailing how Datalog can be implemented or used within Rust. This might involve using an existing Datalog library in Rust or developing a custom Datalog engine.\n*   **Practical Examples:** Providing practical examples illustrating how to use Datalog in Rust to solve specific problems. These examples could cover areas like data analysis, graph processing, program analysis, or network security.\n*   **Performance Considerations:** Discussing performance aspects of using Datalog in Rust, including optimization strategies and comparisons with other approaches.\n*   **Use Cases:** Presenting compelling use cases where Datalog and Rust combination offers a powerful solution, highlighting the benefits of combining the expressive power of Datalog with the safety and performance of Rust.\n\nEssentially, the article likely showcases how the strengths of Datalog (declarative reasoning, efficient queries) can be leveraged within the Rust ecosystem (memory safety, performance) to create robust and efficient applications.\n",
    "chinese_title": "Rust 中的 Datalog",
    "chinese_summary": "GitHub仓库\"frankmcsherry/blog\"可能包含一篇名为\"Rust中的Datalog\"的博文。虽然在不访问该仓库的情况下无法获得文章的具体内容，但我们可以根据标题推断其要点。\n\n该文章可能探讨了声明式逻辑编程语言Datalog在Rust编程语言中的实现和使用。这可能包括：\n\n*   **Datalog简介:** 简要解释Datalog的核心概念、语法以及优势，例如声明式问题求解和高效查询评估。\n*   **Rust实现:** 详细介绍Datalog如何在Rust中实现或使用。这可能涉及在Rust中使用现有的Datalog库或开发自定义的Datalog引擎。\n*   **实际示例:** 提供实际示例，说明如何使用Rust中的Datalog来解决特定问题。这些示例可能涵盖数据分析、图处理、程序分析或网络安全等领域。\n*   **性能考量:** 讨论在Rust中使用Datalog的性能方面，包括优化策略以及与其他方法的比较。\n*   **用例:** 展示引人注目的用例，其中Datalog和Rust的结合提供了一个强大的解决方案，突出了将Datalog的表达能力与Rust的安全性和性能相结合的优势。\n\n本质上，该文章可能展示了如何在Rust生态系统（内存安全，性能）中利用Datalog的优势（声明式推理，高效查询）来创建强大而高效的应用程序。"
  },
  {
    "id": "44285781",
    "title": "Jokes and Humour in the Public Android API",
    "url": "https://voxelmanip.se/2025/06/14/jokes-and-humour-in-the-public-android-api/",
    "summary": "This article explores humorous elements hidden within the public Android API, revealing jokes, easter eggs, and quirky design choices accessible to Android app developers. The author highlights several examples, including:\n\n*   **`ActivityManager.isUserAMonkey()`:** While seemingly a joke about a \"monkey\" messing with the UI, it actually detects the UI Exerciser Monkey, a tool for stress-testing apps with random input.\n*   **`UserManager.isUserAGoat()`:** Originally returning `false`, it was later changed to detect the presence of the \"Goat Simulator\" app, then eventually reverted to always returning `false` in Android 11 to \"protect goat privacy.\"\n*   **`UserManager.DISALLOW_FUN`:** A real device policy that allows device owners to restrict \"fun,\" used internally to disable the Android version easter egg.\n*   **`Chronometer.isTheFinalCountdown()`:** A method that, when called, opens the YouTube video for \"The Final Countdown\" by Europe.\n*   **`PackageManager.FEATURE_TOUCHSCREEN_MULTITOUCH_JAZZHAND`:** A constant describing a device with 5-touch input support, referencing \"Jazz hands.\"\n*   **`Log.wtf()`:** A method for logging things that should never happen, with \"WTF\" supposedly standing for \"What a Terrible Failure.\"\n*   **`AdapterViewFlipper.fyiWillBeAdvancedByHostKThx()`:** A method with an informal name, likely due to a developer's naming block, used by AppWidgetHost.\n*   **`IBinder.TWEET_TRANSACTION` & `IBinder.LIKE_TRANSACTION`:** Transaction types that don't actually send tweets or register likes, but intended as jokes.\n*   **`SensorManager.SENSOR_TRICORDER` & `SensorManager.GRAVITY_*`:** Constants including a Star Trek reference and the gravity of various celestial bodies, including the Death Star and \"the island\" from Lost.\n*   **`<blink>` Tag:** A hidden, undocumented tag that makes content blink, reminiscent of the old HTML tag.\n",
    "chinese_title": "公共Android API中的笑话与幽默",
    "chinese_summary": "Android公共API中隐藏的幽默元素：玩笑、彩蛋与古怪设计"
  }
]