[
  {
    "id": "45670443",
    "title": "Willow quantum chip demonstrates verifiable quantum advantage on hardware",
    "url": "https://blog.google/technology/research/quantum-echoes-willow-verifiable-quantum-advantage/",
    "summary": "Google Quantum AI's \"Willow\" quantum chip has achieved a significant breakthrough: demonstrating verifiable quantum advantage on hardware for the first time. Their \"Quantum Echoes\" algorithm, published in Nature, runs 13,000 times faster than the best classical algorithm on a supercomputer and can be repeatedly verified on similar quantum computers.\n\nThe Quantum Echoes algorithm measures out-of-order time correlators (OTOC) and can be used to learn the structure of complex systems, from molecules to black holes. It works by sending a signal into the quantum system, perturbing a qubit, reversing the signal, and listening for the \"echo,\" which is amplified by constructive interference.\n\nThe team also demonstrated a \"molecular ruler\" technique, using Quantum Echoes and Nuclear Magnetic Resonance (NMR) data to measure molecular geometry, gaining more information about chemical structure than traditional methods. This was verified in a proof-of-principle experiment with molecules containing 15 and 28 atoms in partnership with The University of California, Berkeley.\n\nThis verifiable quantum advantage is enabled by Willow's low error rates and high-speed operations. The algorithm tests both complexity and precision, crucial for real-world applications. The advances have the potential to enhance NMR technology, leading to a \"quantum-scope\" for observing previously unobservable natural phenomena, impacting fields like drug discovery and materials science.\n\nThe team is now focusing on achieving a long-lived logical qubit, a key milestone in their quantum hardware roadmap.\n",
    "chinese_title": "Willow quantum chip demonstrates verifiable quantum advantage on hardware",
    "chinese_summary": "Google Quantum AI's \"Willow\" quantum chip has achieved a significant breakthrough: demonstrating verifiable quantum advantage on hardware for the first time. Their \"Quantum Echoes\" algorithm, published in Nature, runs 13,000 times faster than the best classical algorithm on a supercomputer and can be repeatedly verified on similar quantum computers.\n\nThe Quantum Echoes algorithm measures out-of-order time correlators (OTOC) and can be used to learn the structure of complex systems, from molecules to black holes. It works by sending a signal into the quantum system, perturbing a qubit, reversing the signal, and listening for the \"echo,\" which is amplified by constructive interference.\n\nThe team also demonstrated a \"molecular ruler\" technique, using Quantum Echoes and Nuclear Magnetic Resonance (NMR) data to measure molecular geometry, gaining more information about chemical structure than traditional methods. This was verified in a proof-of-principle experiment with molecules containing 15 and 28 atoms in partnership with The University of California, Berkeley.\n\nThis verifiable quantum advantage is enabled by Willow's low error rates and high-speed operations. The algorithm tests both complexity and precision, crucial for real-world applications. The advances have the potential to enhance NMR technology, leading to a \"quantum-scope\" for observing previously unobservable natural phenomena, impacting fields like drug discovery and materials science.\n\nThe team is now focusing on achieving a long-lived logical qubit, a key milestone in their quantum hardware roadmap.\n"
  },
  {
    "id": "45671871",
    "title": "Introducing Galaxy XR, the first Android XR headset",
    "url": "https://blog.google/products/android/samsung-galaxy-xr/",
    "summary": "The Samsung Galaxy XR is the first device built on Android XR, a new operating system blending digital and physical experiences with Gemini AI integration. It offers an infinite screen for apps from Google Play and new XR experiences, controlled via voice, hands, and eyes. Key features include immersive movie watching through YouTube and Google TV, converting 2D photos into 3D with Google Photos, and exploring the world in 3D with Google Maps, all enhanced by Gemini's contextual assistance. The Galaxy XR also provides an expansive workspace with multiple apps, keyboard/mouse support, and Gemini's organizational help.\n\nThe headset leverages Gemini to provide real-time information about on-screen content, such as player stats during a basketball game, or historical context for landmarks in Google Maps. It supports Google apps reimagined for XR, brand new XR experiences, and millions of mobile and tablet apps.\n\nThe Galaxy XR is available for $1799 or $149/month via Samsung.com and Samsung Experience stores in the US and Korea. A limited-time \"Explorer Pack\" offers a subscription bundle including Google AI Pro, YouTube Premium, Google Play Pass, access to streaming services trials, sports passes, and early access to apps like Adobe's Project Pulsar and Status Pro's NFL PRO ERA. The Android XR system also supports open standards such as OpenXR, WebXR and Unity. More devices and experiences based on Android XR are expected in the future.\n",
    "chinese_title": "推出 Galaxy XR，首款安卓 XR 头显",
    "chinese_summary": "三星Galaxy XR是首款基于Android XR的设备，这是一款融合数字与物理体验并集成Gemini AI的新操作系统。它提供了一个无限屏幕，可用于Google Play的应用程序和全新的XR体验，通过语音、手势和眼睛进行控制。主要功能包括通过YouTube和Google TV进行沉浸式电影观看，使用Google Photos将2D照片转换为3D，以及使用Google Maps在3D中探索世界，所有这些都通过Gemini的上下文帮助得到增强。Galaxy XR还提供了一个带有多个应用程序、键盘/鼠标支持以及Gemini组织帮助的广阔工作空间。\n\n该头显利用Gemini提供关于屏幕内容的实时信息，例如篮球比赛期间的球员统计数据，或Google Maps中地标的历史背景。它支持为XR重新设计的Google应用程序，全新的XR体验以及数百万个移动和平板电脑应用程序。\n\nGalaxy XR在美国和韩国的Samsung.com和三星体验店有售，价格为1799美元或每月149美元。限时“探索者套装”提供订阅捆绑包，包括Google AI Pro，YouTube Premium，Google Play Pass，访问流媒体服务试用版，体育通行证以及提前访问Adobe的Project Pulsar和Status Pro的NFL PRO ERA等应用程序。Android XR系统还支持OpenXR，WebXR和Unity等开放标准。预计未来将会有更多基于Android XR的设备和体验。"
  },
  {
    "id": "45669593",
    "title": "Cryptographic Issues in Cloudflare's Circl FourQ Implementation (CVE-2025-8556)",
    "url": "https://www.botanica.software/blog/cryptographic-issues-in-cloudflares-circl-fourq-implementation",
    "summary": "This article details CVE-2025-8556, a vulnerability discovered in Cloudflare's CIRCL library, specifically in its implementation of the FourQ elliptic curve. The vulnerability stems from insufficient validation of points used in cryptographic calculations, making the implementation susceptible to invalid point attacks.\n\nThe FourQ curve, designed for efficiency in resource-constrained environments, relies on specific characteristics including endomorphisms. The core issue lies in the `Shared` function of `Curve4Q` (a Diffie-Hellman implementation), where a public point isn't validated for curve membership before scalar multiplication with a secret key. This allows attackers to supply invalid points, potentially belonging to curves with small subgroup orders, which drastically reduces the difficulty of recovering the server's secret key via brute-force methods and the Chinese Remainder Theorem.\n\nWhile traditional invalid curve attacks on Weierstrass curves don't directly translate to Edwards curves like FourQ, a specific attack vector exploiting points of the form (0, y) was identified. This allows manipulation of the scalar multiplication to reveal the secret key.\n\nThe reported issues include: incorrect point validation during unmarshalling (missing conjugate validation), a faulty point comparison in `pointR1.isEqual` that returns true when Z = 0, lack of point validation after cofactor clearing in `pointR1.ClearCofactor`, and the absence of pre-validation in `pointR1.ScalarMult`, which is vulnerable to degenerate curve attacks. Cloudflare addressed the major points raised.\n",
    "chinese_title": "Cloudflare Circl FourQ 实现中的密码学问题 (CVE-2025-8556)",
    "chinese_summary": "This article details CVE-2025-8556, a vulnerability discovered in Cloudflare's CIRCL library, specifically in its implementation of the FourQ elliptic curve. The vulnerability stems from insufficient validation of points used in cryptographic calculations, making the implementation susceptible to invalid point attacks.\n\nThe FourQ curve, designed for efficiency in resource-constrained environments, relies on specific characteristics including endomorphisms. The core issue lies in the `Shared` function of `Curve4Q` (a Diffie-Hellman implementation), where a public point isn't validated for curve membership before scalar multiplication with a secret key. This allows attackers to supply invalid points, potentially belonging to curves with small subgroup orders, which drastically reduces the difficulty of recovering the server's secret key via brute-force methods and the Chinese Remainder Theorem.\n\nWhile traditional invalid curve attacks on Weierstrass curves don't directly translate to Edwards curves like FourQ, a specific attack vector exploiting points of the form (0, y) was identified. This allows manipulation of the scalar multiplication to reveal the secret key.\n\nThe reported issues include: incorrect point validation during unmarshalling (missing conjugate validation), a faulty point comparison in `pointR1.isEqual` that returns true when Z = 0, lack of point validation after cofactor clearing in `pointR1.ClearCofactor`, and the absence of pre-validation in `pointR1.ScalarMult`, which is vulnerable to degenerate curve attacks. Cloudflare addressed the major points raised.\n"
  },
  {
    "id": "45669142",
    "title": "Linux Capabilities Revisited",
    "url": "https://dfir.ch/posts/linux_capabilities/",
    "summary": "生成摘要时出错",
    "chinese_title": "Linux Capabilities Revisited",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45665452",
    "title": "MinIO stops distributing free Docker images",
    "url": "https://github.com/minio/minio/issues/21647#issuecomment-3418675115",
    "summary": "This issue reports the absence of new Docker images for the recent MinIO security release (Security/CVE RELEASE.2025-10-15T17-29-55Z) on both quay.io and DockerHub. The reporter, neil-lcv-cs, is inquiring if this is intentional and requests the release of a new Docker image if it's not. The issue is labelled as \"community\" and \"working as intended,\" suggesting that MinIO may have intentionally stopped providing free Docker images for this security release, or that the release isn't being distributed via Docker for some other reason. The reporter and at least 22 other people reacted positively to the initial report.\n",
    "chinese_title": "MinIO停止分发免费Docker镜像",
    "chinese_summary": "本次问题报告指出，Quay.io和DockerHub上均缺少最近MinIO安全版本(Security/CVE RELEASE.2025-10-15T17-29-55Z)的新的Docker镜像。报告人neil-lcv-cs询问这是否是有意的，如果不是，则请求发布新的Docker镜像。该问题被标记为“社区”和“按预期工作”，表明MinIO可能有意停止为该安全版本提供免费Docker镜像，或者由于其他原因该版本未通过Docker分发。报告人和至少22人对最初的报告表示赞同。"
  },
  {
    "id": "45662368",
    "title": "Designing software for things that rot",
    "url": "https://drobinin.com/posts/designing-software-for-things-that-rot/",
    "summary": "This article explores the intersection of software design and fermentation, drawing parallels between managing infrastructure and the controlled decay inherent in fermenting food. The author recounts their journey from amateur fermenter to developing a software tool, \"Fermento,\" to manage the inherent risks and complexities.\n\nThe initial phases involved setting up a dedicated fermentation chamber with temperature and humidity control, controlled by Home Assistant. However, the author found monitoring alone insufficient, lacking the contextual awareness needed to identify real problems. This led to the adoption of HACCP (Hazard Analysis and Critical Control Points), a food industry framework, to systematically identify and monitor critical control points.\n\nThe author then developed Fermento, an iOS app designed to track fermentation projects, applying HACCP principles. The app utilizes fermentation profiles, state machines that progress through phases (ferment, dry, age), each with associated constraints on metrics like pH, humidity, and weight loss. A key design element is caching relevant constraints based on the current phase, optimizing performance. The app also automates the generation of HACCP documents, bidirectionally linking logs and documentation.\n\nThe article stresses the importance of traceability over absolute precision, advocating for honest logging of actions, measurements, and observations. This is especially crucial in long cures or low-acid environments where dangerous outcomes might not be obvious.\n\nThe author concludes by noting that while automation is helpful, manual entry and human observation are valuable. The app serves as a flexible diary and reminder system, scaling to the needs of the fermentation process. Ultimately, \"Fermento\" aims to provide confidence and structure, ensuring safer and more successful fermentation outcomes.\n",
    "chinese_title": "为易腐物品设计软件",
    "chinese_summary": "软件设计与发酵的交汇：一个软件工具“Fermento”的开发历程"
  },
  {
    "id": "45672035",
    "title": "Bild AI (YC W25) Is Hiring a Founding AI Engineer",
    "url": "https://www.ycombinator.com/companies/bild-ai/jobs/m2ilR5L-founding-engineer-applied-ai",
    "summary": "Bild AI (YC W25), a startup focused on applying AI to construction blueprints, is hiring a Founding AI Engineer in San Francisco. The role offers a $100K-$180K salary with 0.50%-2.00% equity. Bild AI aims to streamline blueprint reading, cost estimation, and permit applications, building more houses, hospitals, and schools efficiently.\n\nThe ideal candidate will focus on the intelligence layer, applying the latest computer vision, LLMs, and AI systems, quickly prototyping and iterating based on user feedback. Desired qualifications include applied CV/ML experience, experience building and deploying AI solutions from scratch, a growth mindset, strong communication skills, and a willingness to handle the less glamorous aspects of startup life. Bonus points are awarded for prior startup/founder experience with a successful product, construction background, and impact-driven motivation.\n\nApplicants should express why they are a good fit and share their favorite fruit. The position requires a full-time, in-office presence in San Francisco or a willingness to relocate. Bild AI, founded in 2024 and part of YC W25, uses a model-garden approach to solve difficult technical challenges in blueprint understanding and has received funding from top VCs. Founders are Roop Pal and Puneet Sukhija.\n",
    "chinese_title": "Bild AI (YC W25) 正在招聘创始 AI 工程师",
    "chinese_summary": "Bild AI（YC W25）是一家专注于将人工智能应用于建筑蓝图的初创公司，正在旧金山招聘创始AI工程师。该职位提供10万至18万美元的薪资，以及0.50%至2.00%的股权。Bild AI旨在简化蓝图阅读、成本估算和许可证申请流程，从而更高效地建造房屋、医院和学校。\n\n理想的候选人将专注于智能层，应用最新的计算机视觉、大型语言模型和人工智能系统，根据用户反馈快速进行原型设计和迭代。期望的资质包括应用计算机视觉/机器学习经验、从零开始构建和部署人工智能解决方案的经验、成长型思维、强大的沟通能力，以及愿意处理创业生活中不太光鲜的一面。有成功产品的早期创业/创始人经验、建筑背景以及以影响力为导向的动机者将获得加分。\n\n申请人应说明他们为何适合该职位，并分享他们最喜欢的水果。该职位要求全职在旧金山办公室工作，或愿意搬迁。Bild AI成立于2024年，是YC W25的一部分，采用模型花园方法来解决蓝图理解中的复杂技术挑战，并已获得顶级风险投资的支持。创始人是Roop Pal和Puneet Sukhija。"
  },
  {
    "id": "45668990",
    "title": "AI assistants misrepresent news content 45% of the time",
    "url": "https://www.bbc.co.uk/mediacentre/2025/new-ebu-research-ai-assistants-news-content",
    "summary": "A recent study coordinated by the EBU and led by the BBC reveals that AI assistants routinely misrepresent news content, regardless of language, region, or platform. The international study, involving 22 public service media organizations across 18 countries, evaluated over 3,000 responses from ChatGPT, Copilot, Gemini, and Perplexity.\n\nKey findings indicate that 45% of AI answers contain significant issues, with 31% suffering from sourcing problems and 20% displaying major accuracy issues like hallucinations and outdated information. Gemini performed the worst, with 76% of its responses containing significant issues.\n\nThis is concerning as AI assistants are increasingly used as news sources, especially among younger demographics. The EBU and BBC emphasize the danger this poses to public trust and democratic participation. They have released a News Integrity in AI Assistants Toolkit to help improve AI responses and media literacy.\n\nThe EBU and its members are urging regulators to enforce laws on information integrity. Ongoing independent monitoring of AI assistants is deemed essential. A separate BBC study reveals that many people trust AI summaries to be accurate, despite the prevalent errors, which could ultimately damage trust in news organizations.\n",
    "chinese_title": "AI助手45%的时间内错误呈现新闻内容",
    "chinese_summary": "EBU与BBC联合研究揭示AI助手常曲解新闻内容"
  },
  {
    "id": "45671778",
    "title": "Meta is axing 600 roles across its AI division",
    "url": "https://www.theverge.com/news/804253/meta-ai-research-layoffs-fair-superintelligence",
    "summary": "Meta is cutting 600 roles across its AI division, impacting its Fundamental AI Research (FAIR) unit, AI product, and infrastructure divisions. This move comes despite the company continuing to hire for its newly formed superintelligence team, TBD Lab. A Meta spokesperson confirmed the layoffs, which follow a period of significant AI investment and hiring, including hiring Scale AI's CEO Alexandr Wang. The restructuring signifies a shift in focus towards AI-related products and infrastructure, with FAIR taking a backseat. Head of Meta AI, Wang stated the company aims to integrate research from FAIR into the TBD Lab. The layoffs are intended to streamline decision-making by creating a smaller, more impactful team. Impacted employees will have the opportunity to apply for other positions within Meta.\n",
    "chinese_title": "Meta 裁减其人工智能部门 600 个职位",
    "chinese_summary": "Meta裁减人工智能部门600个职位，涉及基础人工智能研究(FAIR)部门、人工智能产品和基础设施部门。尽管公司仍在为其新成立的超智能团队TBD Lab招聘，但仍采取了这一举措。Meta发言人证实了裁员，此前公司曾对人工智能进行大量投资和招聘，包括聘请Scale AI首席执行官Alexandr Wang。此次重组标志着公司将重点转向与人工智能相关的产品和基础设施，而FAIR则退居次要地位。Meta人工智能负责人Wang表示，公司旨在将FAIR的研究成果整合到TBD Lab中。裁员旨在通过创建一个更小、更具影响力的团队来简化决策流程。受影响的员工将有机会申请Meta内部的其他职位。"
  },
  {
    "id": "45668264",
    "title": "The security paradox of local LLMs",
    "url": "https://quesma.com/blog/local-llms-security-paradox/",
    "summary": "Jacek Migdal's article highlights a security paradox in using local LLMs for privacy. While intended to be more secure, research on gpt-oss-20b reveals they are significantly more vulnerable to malicious prompts than larger, frontier models. This is because they are less capable of identifying malicious intent.\n\nThe article details two attacks: The first is an \"easter egg\" backdoor, where a hidden RCE backdoor is planted with a high success rate (95%) by disguising it as a harmless feature. The second is an immediate RCE achieved through cognitive overload, tricking the model into executing malicious code during code generation. This attack, although less successful (43.5%), is dangerous due to its immediacy.\n\nThese attacks work by injecting malicious prompts into the AI assistant's context, either through documentation poisoning, compromised MCP servers, or social engineering. The article emphasizes that local models worsen this situation due to their weaker reasoning, poorer alignment, and limited safety training. Frontier models, while potentially more secure, are difficult to test due to provider restrictions.\n\nThe article concludes by advocating for a new class of defenses, including static analysis of generated code, sandboxing initial execution, monitoring inputs, outputs, and network traffic, and employing a \"second look\" from a smaller, simpler model to check for policy violations. The key takeaway is that all AI-generated code should be treated with skepticism, recognizing that local LLMs, despite their privacy benefits, require robust security measures.\n",
    "chinese_title": "本地LLM的安全悖论",
    "chinese_summary": "Jacek Migdal 的文章强调了使用本地 LLM 保护隐私的一个安全悖论。 虽然本意是更安全，但对 gpt-oss-20b 的研究表明，它们比大型前沿模型更容易受到恶意提示的攻击。 这是因为它们识别恶意意图的能力较弱。\n\n该文章详细介绍了两种攻击：第一种是“彩蛋”后门，通过将其伪装成无害的功能来植入成功率高达 95% 的隐藏 RCE 后门。 第二种是通过认知过载实现的即时 RCE，诱骗模型在代码生成期间执行恶意代码。 这种攻击虽然成功率较低 (43.5%)，但由于其即时性而十分危险。\n\n这些攻击通过将恶意提示注入 AI 助手的上下文中来实现，途径包括文档污染、受损的 MCP 服务器或社会工程。 该文章强调，由于本地模型推理能力较弱、对齐效果较差且安全训练有限，因此会加剧这种情况。 前沿模型虽然可能更安全，但由于提供商的限制，难以进行测试。\n\n文章最后提倡一种新的防御方式，包括对生成的代码进行静态分析、沙盒化初始执行、监控输入、输出和网络流量，以及使用较小、更简单的模型进行“二次审查”以检查政策违规情况。 关键在于，所有 AI 生成的代码都应持怀疑态度，认识到本地 LLM 虽然具有隐私优势，但也需要强大的安全措施。"
  },
  {
    "id": "45620330",
    "title": "Die shots of as many CPUs and other interesting chips as possible",
    "url": "https://commons.wikimedia.org/wiki/User:Birdman86",
    "summary": "This Wikimedia Commons page is a project by Pauli Rautakorpi to collect and organize die shots (photographs of the internal circuitry) of various CPUs and other integrated circuits. The page serves as an index, categorizing these die shots into different chip classes and families for easy browsing.\n\nThe collection is extensive, covering a wide range of processors from x86 CPUs and FPUs (including Intel, AMD, Cyrix, and others) to other CPUs and FPUs from manufacturers like AMD, Intel, DEC, HP, Motorola, MIPS, SPARC, ARM, and more. The list includes specific models within each family, often noting different revisions or variations.\n\nBeyond CPUs and FPUs, the collection includes die shots of various support chips such as cache controllers, memory controllers, memory management units, DMA controllers, bus/interface controllers, interrupt controllers, and network controllers.  It also includes a section on digital signal processors (DSPs) and microcontrollers from various manufacturers like Texas Instruments, Analog Devices, Motorola, and Intel. Furthermore, the collection contains die shots of graphics chips, video en/decoders, RAMDACs, memory chips, and crypto chips. The project is ongoing, with new die shots being added as they become available. The page also provides a link to the contributor's complete file list for further exploration.\n",
    "chinese_title": "尽可能多的CPU和其他有趣芯片的芯片照片",
    "chinese_summary": "这个维基共享资源页面是由 Pauli Rautakorpi 发起的一个项目，旨在收集和整理各种 CPU 和其他集成电路的芯片照片（内部电路照片）。该页面作为一个索引，将这些芯片照片分类到不同的芯片类别和系列中，以便于浏览。\n\n该合集内容广泛，涵盖了从 x86 CPU 和 FPU（包括 Intel、AMD、Cyrix 等）到 AMD、Intel、DEC、HP、Motorola、MIPS、SPARC、ARM 等制造商的其他 CPU 和 FPU 的各种处理器。该列表包括每个系列中的特定型号，通常会注明不同的修订版本或变体。\n\n除了 CPU 和 FPU 之外，该合集还包括各种支持芯片的芯片照片，例如缓存控制器、内存控制器、内存管理单元、DMA 控制器、总线/接口控制器、中断控制器和网络控制器。它还包括来自德州仪器、模拟器件、摩托罗拉和英特尔等制造商的数字信号处理器 (DSP) 和微控制器部分。此外，该合集还包含图形芯片、视频编/解码器、RAMDAC、存储芯片和加密芯片的芯片照片。该项目正在进行中，随着新的芯片照片的出现，会不断添加。该页面还提供一个链接，指向贡献者的完整文件列表，以供进一步探索。"
  },
  {
    "id": "45667866",
    "title": "Internet's biggest annoyance: Cookie laws should target browsers, not websites",
    "url": "https://nednex.com/en/the-internets-biggest-annoyance-why-cookie-laws-should-target-browsers-not-websites/",
    "summary": "This article argues that the current implementation of cookie consent laws, like GDPR and CCPA, is a failure because it places the burden of consent on individual websites, leading to user annoyance, consent fatigue, and disproportionate difficulty for small businesses. The author proposes a shift in focus, advocating for browsers to handle cookie consent instead.\n\nThe key problems with the current system are: 1) consent fatigue makes cookie banners meaningless; 2) it disproportionately burdens small businesses; and 3) it provides a false sense of control, pushing users to accept all cookies for convenience.\n\nThe proposed solution is a browser-centric model where users set their privacy preferences once in their browser settings. The browser then acts as a personal privacy enforcer, automatically allowing or declining cookies based on the user's pre-defined choices. This approach would offer several benefits:\n\n*   **For Users:** Real control and a cleaner web experience without constant cookie banners.\n*   **For Website Owners:** Reduced burden of compliance, eliminating the need for complex and performance-sapping consent management platforms.\n*   **For Regulators:** Easier enforcement by focusing on a handful of browser developers instead of millions of websites.\n\nThe author emphasizes that this change would streamline the current convoluted system, replacing a fragile patchwork of compliance tools with a single, browser-based source of truth. It's about simplifying the process for users, creators, and regulators, creating a more private and less annoying internet.\n",
    "chinese_title": "互联网最大的烦恼：Cookie法应针对浏览器，而非网站",
    "chinese_summary": "本文认为，目前Cookie同意法律（如GDPR和CCPA）的实施是失败的，因为它将同意的负担置于各个网站，导致用户厌烦、同意疲劳，以及小型企业面临不成比例的困难。作者提出转变重点，主张由浏览器来处理Cookie同意事宜。\n\n当前系统的主要问题是：1）同意疲劳使Cookie横幅变得毫无意义；2）它给小型企业带来了不成比例的负担；3）它提供了一种虚假的控制感，促使用户为了方便而接受所有Cookie。\n\n提议的解决方案是浏览器中心模型，用户在浏览器设置中一次性设置其隐私偏好。然后，浏览器充当个人隐私执行者，根据用户预定义的选项自动允许或拒绝Cookie。这种方法将提供以下几个好处：\n\n*   **对于用户：** 真正的控制和更简洁的网络体验，无需持续不断的Cookie横幅。\n*   **对于网站所有者：** 减轻合规负担，无需复杂且降低性能的同意管理平台。\n*   **对于监管机构：** 通过关注少数浏览器开发商而非数百万个网站，更容易执行。\n\n作者强调，这种改变将简化当前复杂的系统，用基于浏览器的单一真实来源取代脆弱的合规工具拼凑。它旨在简化用户、创建者和监管机构的流程，创造一个更私密、更少烦扰的互联网。"
  },
  {
    "id": "45668160",
    "title": "SourceFS: A 2h+ Android build becomes a 15m task with a virtual filesystem",
    "url": "https://www.source.dev/journal/sourcefs",
    "summary": "Here's a concise summary of the article \"SourceFS: A 2h+ Android build becomes a 15m task with a virtual filesystem\":\n\nThe article describes SourceFS, a virtual filesystem designed to significantly accelerate large software builds, specifically focusing on the Android Open Source Project (AOSP). The traditional AOSP build process involves copying large amounts of source code, often multiple times, which can be extremely time-consuming, especially on systems with slower storage or limited resources.\n\nSourceFS tackles this problem by creating a *virtual* view of the source code. Instead of copying files, it creates a virtual filesystem layer that provides access to the original source files as if they were copied. This eliminates the redundant copying process, leading to substantial speedups.\n\nThe key advantage of SourceFS is its ability to avoid physical file copies. Changes made during the build process are written to a separate overlay, leaving the original source files untouched. This also allows for cleaner builds and easier switching between different build configurations.\n\nThe article highlights the dramatic reduction in build time achieved using SourceFS, going from over two hours to approximately 15 minutes in their testing. This improvement translates to significant productivity gains for developers working on large codebases like AOSP.\n\nSourceFS utilizes technologies like FUSE (Filesystem in Userspace) to implement the virtual filesystem. While it requires careful configuration and some understanding of the underlying system, the article argues that the time saved on builds more than justifies the initial investment. The article concludes that SourceFS is a valuable tool for optimizing large software builds and improving developer efficiency.\n",
    "chinese_title": "SourceFS：借助虚拟文件系统，原本2小时以上的Android构建任务缩短至15分钟",
    "chinese_summary": "SourceFS：利用虚拟文件系统将Android构建从2小时缩短至15分钟"
  },
  {
    "id": "45670516",
    "title": "The Logarithmic Time Perception Hypothesis",
    "url": "http://www.kafalas.com/Logtime.html",
    "summary": "James Main Kenney's \"The Logarithmic Time Perception Hypothesis\" (Logtime) proposes that our perception of time passage is not linear but logarithmic, shrinking as we age. The theory suggests we judge the length of time intervals relative to our current age. A year represents a larger proportion of life for a young child than for an adult, hence the subjective feeling of time accelerating as we grow older.\n\nKenney coins the term \"psychochronometry\" to describe the study of subjective time estimation and presents Logtime as a mathematical model for understanding human temporal experiences. He argues this logarithmic perception aligns with the Weber-Fechner law governing our perception of physical stimuli.\n\nThe article introduces the concept of \"octaves of life\" - periods where the ratio of ending age to starting age is 2:1 (e.g., 10-20, 20-40, 40-80). These octaves are proposed as equally perceived units of time, replacing the linear concept of decades. Remembering early childhood is more difficult, he argues, because of its increased logarithmic distance from our present age.\n\nThe author provides various logarithmic scales and interpolated octaves to illustrate how subjective time might be experienced differently at various stages of life. He acknowledges limitations in accurately measuring these perceptions, and notes that external factors and adjusting to changing circumstances influence our subjective time perception. The article concludes with suggestions for different octave scales to use, along with interpolation, with the author noting musicians may like to scale the octave, a common term in the music community.\n",
    "chinese_title": "对数时间感知假说",
    "chinese_summary": "詹姆斯·梅因·肯尼的“对数时间感知假说”(Logtime) 提出我们对时间流逝的感知并非线性的，而是对数的，随着年龄增长而收缩。该理论认为，我们根据当前的年龄来判断时间间隔的长短。一年对于一个幼儿来说代表着更大的人生比例，因此我们主观感觉时间随着年龄增长而加速。\n\n肯尼创造了术语“心理计时学”来描述对主观时间估计的研究，并将 Logtime 作为理解人类时间体验的数学模型。他认为这种对数感知与支配我们对物理刺激感知的韦伯-费希纳定律相符。\n\n该文章介绍了“生命八度”的概念——起始年龄和结束年龄之比为 2:1 的时期（例如，10-20 岁、20-40 岁、40-80 岁）。这些八度音阶被认为是同样感知到的时间单位，取代了线性的十年概念。他认为，由于幼儿时期与我们现在的年龄在对数上的距离增加，所以回忆起童年早期更加困难。\n\n作者提供了各种对数刻度和内插八度音阶，以说明在人生的不同阶段如何以不同的方式体验主观时间。他承认准确测量这些感知的局限性，并指出外部因素和适应不断变化的环境会影响我们的主观时间感知。文章最后提出了使用不同八度音阶及其内插的建议，作者指出音乐家可能喜欢缩放八度音阶，这是音乐界常用的术语。"
  },
  {
    "id": "45543746",
    "title": "Patina: a Rust implementation of UEFI firmware",
    "url": "https://github.com/OpenDevicePartnership/patina",
    "summary": "Patina is a Rust implementation of UEFI firmware aiming to replace core C-based components with memory-safe Rust alternatives, enhancing system firmware security and stability without sacrificing boot performance. Currently in beta, it welcomes platform testing and integration feedback.\n\nReleases are managed via GitHub releases, which trigger a workflow to update Cargo.toml versions. Documentation is available at OpenDevicePartnership.github.io/patina/ and can be self-hosted using `mdbook`. The document outlines tool setup, including `rustup`, `cargo-make`, and `cargo-llvm-cov`.\n\nBuild instructions cover aarch64, x64, and native targets, with development and release profiles. Testing involves running unit tests and building on-platform tests. Rust version updates are recommended quarterly and should be reviewed by the `OpenDevicePartnership/patina-contributors` team.\n\nThe roadmap focuses on Stabilization (bug fixes, performance), Expansion (new components, MM Core support), and Ecosystem Integration (firmware and Rust). Contributions are encouraged.\n",
    "chinese_title": "Patina：UEFI固件的Rust实现",
    "chinese_summary": "Patina：一种 Rust 实现的 UEFI 固件，旨在用内存安全的 Rust 替代方案取代基于 C 的核心组件，从而在不牺牲启动性能的前提下，增强系统固件的安全性和稳定性。目前处于 Beta 阶段，欢迎进行平台测试和集成反馈。\n\n发布版本通过 GitHub Releases 进行管理，该版本会触发工作流程以更新 Cargo.toml 版本。文档位于 OpenDevicePartnership.github.io/patina/，可以使用 `mdbook` 自行托管。该文档概述了工具设置，包括 `rustup`、`cargo-make` 和 `cargo-llvm-cov`。\n\n构建说明涵盖 aarch64、x64 和原生目标，包括开发和发布配置文件。测试包括运行单元测试和构建平台上测试。建议每季度更新 Rust 版本，并应由 `OpenDevicePartnership/patina-contributors` 团队进行审查。\n\n路线图侧重于稳定化（错误修复、性能）、扩展（新组件、MM Core 支持）和生态系统集成（固件和 Rust）。欢迎贡献。"
  },
  {
    "id": "45665311",
    "title": "French ex-president Sarkozy begins jail sentence",
    "url": "https://www.bbc.com/news/articles/cvgkm2j0xelo",
    "summary": "Nicolas Sarkozy, former French president, has begun serving a five-year jail sentence for conspiring to illegally finance his 2007 election campaign with money from Muammar Gaddafi's Libya. He is the first former French president to be jailed since World War II.\n\nSarkozy, who maintains his innocence, was taken to La Santé prison in Paris, where he will be held in an isolation wing for his safety. He will have a small cell with basic amenities and limited contact with other inmates.\n\nDespite appealing the conviction, Sarkozy was ordered to jail due to the severity of the charges. He expressed feeling sorrow for France and reaffirmed his belief that the truth will prevail. His lawyer has already filed a request for his release.\n\nThe imprisonment has sparked significant reaction in France. President Macron received Sarkozy at the Élysée Palace prior to his jail term and commented on the situation without criticizing the judicial decision. Justice Minister Darmanin also plans to visit Sarkozy in prison.\n\nSarkozy is facing further legal challenges, including an upcoming verdict on an appeal against a six-month jail term in the Bygmalion affair, another illegal campaign financing case. He has been dogged by criminal inquiries since leaving office in 2012.\n",
    "chinese_title": "法国前总统萨科齐开始服刑",
    "chinese_summary": "前法国总统萨科齐因共谋利用卡扎菲利比亚资金非法资助其2007年竞选活动，已开始服刑五年。他是二战后第一位被判入狱的前法国总统。\n\n萨科齐坚称自己无罪，已被送往巴黎的桑特监狱，为安全起见，他将被关押在隔离区。他将拥有一个配备基本设施的小牢房，并限制与其他囚犯的接触。\n\n尽管萨科齐对判决提出上诉，但他因指控的严重性而被勒令入狱。他表达了对法国的悲伤之情，并重申他相信真相终将获胜。他的律师已经提交了释放申请。\n\n这次监禁在法国引起了巨大反响。马克龙总统在萨科齐入狱前在爱丽舍宫接见了他，并对情况发表了评论，但没有批评司法裁决。司法部长达尔马宁也计划探望狱中的萨科齐。\n\n萨科齐还面临进一步的法律挑战，包括即将对Bygmalion事件中，另一起非法竞选资金案，提出的六个月监禁上诉的判决。自2012年卸任以来，他一直受到刑事调查的困扰。"
  },
  {
    "id": "45565793",
    "title": "Go subtleties",
    "url": "https://harrisoncramer.me/15-go-sublteties-you-may-not-already-know/",
    "summary": "This article presents 15 Go language subtleties that can be beneficial for developers.\n\n1.  **Ranging over Integers:** In Go 1.22+, you can directly iterate over integers using `range`.\n2.  **Renaming Packages:** Go's LSP allows renaming packages, updating all references and the directory name.\n3.  **Constraining Generic Function Signatures:** Use `~` to constrain generic types to underlying types, useful for typed constants.\n4.  **Index-based String Interpolation:** Use `%[index]s` in `fmt.Printf` to reuse interpolated values.\n5.  **`time.After` function:** Creates a channel that receives a message after a specified duration, useful for timeouts with `select`.\n6.  **`embed` package:** Embeds non-Go files into the binary, simplifying deployments.\n7.  **`len()` with Strings and UTF-8:** `len()` returns bytes, not characters. Use `range` to iterate over runes (code points).\n8.  **Nil Interfaces:** A nil value boxed in an interface is not nil. This can cause unexpected behavior in nil checks.\n9.  **Invoking Methods on Nil Values:** You can call methods on nil struct pointers, but accessing properties will panic.\n10. **Variable References with Ranging over Maps:** Updates inside a map loop might not be immediately visible due to internal hashing and storage buckets.\n11. **Returning Custom Errors:** Define error types to provide structured data and custom logic.\n12. **Context-Aware Functions:** Always select on the context to handle cancellations and avoid unnecessary waiting. Be careful when propagating contexts.\n13. **Empty Structs:** Occupy zero bytes and are commonly used for signaling on channels.\n14. **The Go compiler and the range keyword:** The range keyword is lowered into basic loops.\n15. **Hidden Interface satisfaction:** Embedded structs can implicitly promote methods, potentially overriding desired behavior like JSON marshaling. Be careful with struct embedding!\n16. **The ”-” tag for JSON:** Omits a field from JSON output during marshaling.\n17. **Comparing Times:** Don't use string comparisons for `time.Time` values; use the `.Equal()` method.\n18. **The wg.Go Function:** Go 1.25 introduced a convenient method to add Go routines to waitgroups\n",
    "chinese_title": "围棋妙手",
    "chinese_summary": "对开发者有益的 18 个 Go 语言技巧\n\n1. **遍历整数:** 在 Go 1.22+ 中，可以直接使用 `range` 迭代整数。\n2. **重命名包:** Go 的 LSP 允许重命名包，更新所有引用和目录名。\n3. **约束泛型函数签名:** 使用 `~` 将泛型类型约束为底层类型，对类型化的常量很有用。\n4. **基于索引的字符串插值:** 在 `fmt.Printf` 中使用 `%[index]s` 来重用插值。\n5. **`time.After` 函数:** 创建一个通道，该通道在指定的持续时间后接收消息，可用于带有 `select` 的超时。\n6. **`embed` 包:** 将非 Go 文件嵌入到二进制文件中，简化部署。\n7. **带有字符串和 UTF-8 的 `len()`:** `len()` 返回字节数，而不是字符数。使用 `range` 迭代 runes（代码点）。\n8. **Nil 接口:** 封装在接口中的 nil 值不是 nil。这可能会导致 nil 检查中出现意外行为。\n9. **在 Nil 值上调用方法:** 你可以在 nil 结构体指针上调用方法，但访问属性会 panic。\n10. **使用 Ranging 遍历 Map 的变量引用:** 由于内部哈希和存储桶，在 map 循环内的更新可能不会立即显示。\n11. **返回自定义错误:** 定义错误类型以提供结构化数据和自定义逻辑。\n12. **上下文感知函数:** 始终选择上下文来处理取消并避免不必要的等待。传播上下文时要小心。\n13. **空结构体:** 占用零字节，通常用于在通道上发出信号。\n14. **Go 编译器和 range 关键字:** range 关键字被降低为基本循环。\n15. **隐藏的接口实现:** 嵌入的结构体可以隐式地提升方法，可能会覆盖所需的行为，例如 JSON 序列化。使用结构体嵌入时要小心！\n16. **JSON 的 “-” 标签:** 在序列化期间从 JSON 输出中省略字段。\n17. **比较时间:** 不要对 `time.Time` 值使用字符串比较；使用 `.Equal()` 方法。\n18. **wg.Go 函数:** Go 1.25 引入了一种方便的方法来向等待组添加 Go 例程。"
  },
  {
    "id": "45601855",
    "title": "Farming Hard Drives (2012)",
    "url": "https://www.backblaze.com/blog/backblaze_drive_farming/",
    "summary": "In late 2011, devastating floods in Thailand crippled hard drive manufacturing, causing prices to skyrocket and threatening Backblaze's unlimited data backup service model. The company, facing a 200% cost increase for essential hard drives, needed to find a solution to continue offering its services at $5/month.\n\nBackblaze initiated a strategy called \"drive farming,\" tasking employees, friends, and family with purchasing external hard drives from retail stores like Costco and Best Buy. These drives were then \"shucked\" (removed from their external cases) for use in Backblaze's Storage Pods. This was cheaper than buying internal drives, despite the extra labor and recycling costs.\n\nInitially, employees scoured local stores, but limitations on purchase quantities forced Backblaze to expand the operation nationwide, relying on friends and family to buy and ship drives. The company continued to face challenges, including purchase limits and vendor shortages. Despite these hurdles, Backblaze avoided raising prices, a decision that contrasted with other tech companies.\n\nThe \"drive farming\" efforts continued into early 2012, ultimately securing 5.5 petabytes of storage. As Thailand recovered and hard drive production normalized, Backblaze was able to return to its traditional purchasing channels. They expressed gratitude to everyone who helped them during the crisis. The article concludes with an epilogue about Backblaze taking venture funding later in 2012 and capitalizing on a Costco deal for more drives.\n",
    "chinese_title": "硬盘挖矿 (2012)",
    "chinese_summary": "2011年末，泰国毁灭性洪水重创硬盘制造业，导致价格飙升，并威胁到Backblaze的无限数据备份服务模式。该公司面临关键硬盘成本上涨200%的困境，亟需找到解决方案，以继续提供每月5美元的服务。\n\nBackblaze启动了一项名为“硬盘农场”的策略，安排员工、朋友和家人从Costco和百思买等零售店购买外置硬盘。然后将这些硬盘“拆解”（从外壳中取出），用于Backblaze的存储舱。尽管需要额外的人工和回收成本，但这样做比购买内置硬盘更便宜。\n\n最初，员工们搜遍了当地商店，但购买数量的限制迫使Backblaze将行动扩大到全国范围，依靠朋友和家人购买并运送硬盘。该公司继续面临挑战，包括购买限制和供应商短缺。尽管面临这些困难，Backblaze还是避免了提价，这一决定与其他科技公司形成对比。\n\n“硬盘农场”行动一直持续到2012年初，最终获得了5.5拍字节的存储空间。随着泰国的复苏和硬盘生产的正常化，Backblaze得以回归传统的采购渠道。他们对在危机期间帮助过他们的人表示感谢。文章的尾声讲述了Backblaze在2012年晚些时候获得了风险投资，并利用Costco的交易购买了更多硬盘。"
  },
  {
    "id": "45605223",
    "title": "A non-diagonal SSM RNN computed in parallel without requiring stabilization",
    "url": "https://github.com/glassroom/goom_ssm_rnn",
    "summary": "This article introduces `goom_ssm_rnn`, a deep Recurrent Neural Network (RNN) implementation that leverages generalized orders of magnitude (GOOMs) to enable parallel computation of non-diagonal linear state-space model (SSM) recurrences without requiring stabilization. The key innovation lies in using complex-typed GOOMs (torch.complex64 tensors) within the recurrent layers, allowing the model to capture sequential dependencies with a non-diagonal SSM efficiently.\n\nThe RNN is designed as a PyTorch `nn.Module` and comes with convenience methods for parameter grouping (with/without weight decay), loss and accuracy computation, and text generation.  While the complex tensor usage limits full PyTorch compilation, partial compilation is still possible, significantly improving performance. The authors highlight that autocasting to `torch.float16` is supported for float tensors.\n\nThe article presents performance benchmarks on natural language generation using The Pile dataset, achieving competitive results (cross-entropy ~2.7 after 10B tokens) with a 124M parameter model.  The model also demonstrated strong performance on tasks like Sequential MNIST (generation and classification), Wikitext-103, and Copy-Memory tasks, using a smaller configuration (12.8M-38M parameters). The hyperparameter settings for achieving these results are detailed. The code, fully documented in `goom_ssm_rnn.py`, is presented as readily modifiable for various tasks. The authors emphasize the importance of their method for enabling scalable and parallel high-dynamic-range computation in RNNs.\n",
    "chinese_title": "一种无需稳定化即可并行计算的非对角SSM RNN",
    "chinese_summary": "本文介绍`goom_ssm_rnn`，一种深度循环神经网络（RNN）实现，它利用广义数量级（GOOMs）来实现非对角线性状态空间模型（SSM）递归的并行计算，而无需稳定化。 其关键创新在于在循环层中使用复数类型GOOMs（torch.complex64张量），从而使模型能够有效地捕获具有非对角SSM的序列依赖性。\n\n该RNN被设计为PyTorch `nn.Module`，并提供便捷的方法来进行参数分组（带/不带权重衰减）、损失和准确率计算以及文本生成。 虽然复数张量的使用限制了完整的PyTorch编译，但部分编译仍然是可能的，从而显著提高了性能。 作者强调，对于浮点张量，支持自动转换为`torch.float16`。\n\n本文展示了使用The Pile数据集进行自然语言生成的性能基准测试，使用1.24亿参数模型实现了具有竞争力的结果（10B token后交叉熵约为2.7）。 该模型还在诸如Sequential MNIST（生成和分类）、Wikitext-103和Copy-Memory任务等任务上表现出强大的性能，使用了较小的配置（1280万-3800万参数）。 详细介绍了实现这些结果的超参数设置。 代码完全记录在`goom_ssm_rnn.py`中，可以很容易地修改以用于各种任务。 作者强调了他们的方法对于在RNN中实现可扩展和并行的高动态范围计算的重要性。"
  },
  {
    "id": "45664848",
    "title": "Evaluating the Infinity Cache in AMD Strix Halo",
    "url": "https://chipsandcheese.com/p/evaluating-the-infinity-cache-in",
    "summary": "This article by Chester Lam evaluates the effectiveness of AMD's Infinity Cache in the Strix Halo APU, specifically its ability to mitigate DRAM bandwidth bottlenecks in graphics workloads. Strix Halo combines a powerful CPU and GPU with a 256-bit LPDDR5X-8000 setup and a 32 MB Infinity Cache.\n\nLam utilizes performance monitoring tools at the Coherent Stations (CS) and Unified Memory Controllers (UMC) to estimate Infinity Cache hit rates by comparing traffic levels. Traffic at the CS but not the UMC indicates a cache hit.\n\nThe results demonstrate that the 32 MB Infinity Cache effectively keeps Strix Halo well below its theoretical 256 GB/s DRAM bandwidth limit in the tested graphics workloads. While some workloads push close to the limit, the cache consistently improves bandwidth efficiency. The author points out how various resolutions and workload types influence the cache performance, observing that increasing resolution often decreases hitrate, but the cache still significantly reduces DRAM bandwidth demands.\n\nThe article also draws comparisons to the PS5's memory setup, suggesting that Strix Halo's combination of cache and DRAM bandwidth is a power-efficient alternative to a solely high-bandwidth GDDR6 solution, especially for mobile devices.\n\nUltimately, the article concludes that AMD's choice of a 32 MB cache and 256 GB/s of DRAM bandwidth is well-tuned for a variety of workloads. Lam expresses a desire for AMD's developer tools to provide direct data on Infinity Cache hitrates for better insights into its performance.\n",
    "chinese_title": "评估AMD Strix Halo中的Infinity Cache",
    "chinese_summary": "Chester Lam 的这篇文章评估了 AMD 的 Infinity Cache 在 Strix Halo APU 中的有效性，特别是其在图形工作负载中缓解 DRAM 带宽瓶颈的能力。 Strix Halo 结合了强大的 CPU 和 GPU，配备 256 位 LPDDR5X-8000 设置和 32 MB Infinity Cache。\n\nLam 利用相干站 (CS) 和统一内存控制器 (UMC) 的性能监控工具，通过比较流量水平来估算 Infinity Cache 命中率。 CS 上的流量而 UMC 上没有的流量表明缓存命中。\n\n结果表明，在测试的图形工作负载中，32 MB Infinity Cache 有效地使 Strix Halo 远低于其理论上的 256 GB/s DRAM 带宽限制。 虽然某些工作负载接近该限制，但缓存始终能提高带宽效率。 作者指出，各种分辨率和工作负载类型如何影响缓存性能，观察到增加分辨率通常会降低命中率，但缓存仍然可以显著降低 DRAM 带宽需求。\n\n文章还将 Strix Halo 的内存设置与 PS5 的内存设置进行了比较，表明 Strix Halo 的缓存和 DRAM 带宽组合是仅使用高带宽 GDDR6 解决方案的一种节能替代方案，尤其适用于移动设备。\n\n最终，文章得出结论，AMD 选择 32 MB 缓存和 256 GB/s DRAM 带宽对于各种工作负载来说都是经过精心调整的。 Lam 表示希望 AMD 的开发者工具能够提供有关 Infinity Cache 命中率的直接数据，以便更好地了解其性能。"
  },
  {
    "id": "45566730",
    "title": "Show HN: Cadence – A Guitar Theory App",
    "url": "https://cadenceguitar.com/",
    "summary": "Cadence is a guitar theory and ear training app designed to make learning fun and engaging through interactive lessons and gamified challenges. The app breaks down guitar theory into bite-sized lessons with visual and audio aids, followed by intuitive recaps to reinforce the content. Users can test their knowledge through theory, visual, and audio challenges of increasing difficulty, earning trophies as they progress.\n\nA key feature is dedicated ear training, enabling users to recognize intervals, chords, scales, and progressions by ear. Progress tracking, including daily activity reports and streaks, helps maintain motivation.\n\nCadence offers a comprehensive guitar library with over 2000 chords, scales (CAGED, 3NPS, octaves), arpeggios in various positions, and progressions with voicing suggestions.\n\nThe app offers a free tier that includes beginner lessons and challenges, 5 challenge attempts per day, progress tracking, and full access to the guitar library. A Pro subscription, available monthly or annually, unlocks all lessons and challenges, unlimited challenge attempts, a practice mode, and custom library presets. Both tiers offer an ad-free experience, and multi-device sync is optional. There's also a lifetime access option via a one-time purchase.\n",
    "chinese_title": "Show HN: Cadence – 吉他乐理应用",
    "chinese_summary": "Cadence：一款通过互动课程和游戏化挑战，让学习吉他理论和练耳变得有趣且引人入胜的应用。该应用将吉他理论分解为小节课程，辅以视觉和听觉辅助，并进行直观的总结以巩固内容。用户可以通过难度递增的理论、视觉和听觉挑战来测试他们的知识，并在进步过程中赢得奖杯。\n\n一个关键功能是专门的练耳训练，使用户能够通过听觉识别音程、和弦、音阶和进行。包括每日活动报告和连胜记录的进度跟踪有助于保持动力。\n\nCadence提供了一个全面的吉他库，其中包含2000多个不同位置的和弦、音阶（CAGED、3NPS、八度）、琶音以及带有发声建议的进行。\n\n该应用提供一个免费层级，其中包括初学者课程和挑战，每天5次挑战尝试，进度跟踪以及对吉他库的完全访问权限。Pro订阅（按月或按年提供）可解锁所有课程和挑战、无限次挑战尝试、练习模式和自定义库预设。两种层级都提供无广告体验，并且可以选择多设备同步。还可以通过一次性购买获得永久访问权限。"
  },
  {
    "id": "45605556",
    "title": "Power over Ethernet (PoE) basics and beyond",
    "url": "https://www.edn.com/poe-basics-and-beyond-what-every-engineer-should-know/",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "以太网供电（PoE）基础及进阶",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "45666327",
    "title": "Knocker, a knock based access control system for your homelab",
    "url": "https://github.com/FarisZR/knocker",
    "summary": "Knocker is a self-hosted, single-packet authorization (SPA) gateway designed to enhance security in homelab environments by providing an HTTP-based \"knock-knock\" system. It protects services by keeping them private and opening them on-demand only for authorized IP addresses. Knocker can be integrated with reverse proxies like Caddy or even at the firewall level using FirewallD.\n\nKey features include: API key authentication, configurable TTL for whitelisted IPs, remote whitelisting, static IP whitelisting, path-based exclusion, and IPv6 support. It offers web, CLI, and Android clients for easy knocking.\n\nKnocker operates by validating API keys and whitelisting client IPs for a specified duration. When integrated with Caddy, it acts as an authentication gateway, returning 401 Unauthorized responses to non-whitelisted IPs. FirewallD integration allows Knocker to create dynamic, time-based firewall rules, expiring them automatically based on the TTL, working even for non-HTTP services.\n\nDeployment is facilitated through Docker Compose. Configuration involves setting API keys, reviewing trusted proxies, and optionally enabling FirewallD integration (requiring root access for the container). The article includes detailed instructions for setting up Knocker with Caddy and FirewallD, along with troubleshooting tips.\n\nThe project includes unit and integration tests. API documentation endpoints can be enabled in the configuration file. The project was built with AI assistance, and users who are against AI usage are advised not to use it.\n",
    "chinese_title": "敲门者：一个基于敲击的家庭实验室访问控制系统",
    "chinese_summary": "Knocker：自托管的单包授权（SPA）网关，旨在通过提供基于 HTTP 的“敲敲门”系统来增强家庭实验室环境中的安全性。它通过保持服务的私密性，并且仅为授权 IP 地址按需开放来保护服务。Knocker 可以与 Caddy 等反向代理集成，甚至可以在防火墙级别使用 FirewallD。\n\n主要功能包括：API 密钥身份验证、可配置的 IP 白名单有效期 (TTL)、远程白名单、静态 IP 白名单、基于路径的排除以及 IPv6 支持。它提供 Web、CLI 和 Android 客户端，方便敲门。\n\nKnocker 的工作原理是验证 API 密钥，并将客户端 IP 加入白名单，有效期可指定。与 Caddy 集成时，它充当身份验证网关，向非白名单 IP 返回 401 未授权响应。FirewallD 集成允许 Knocker 创建动态的、基于时间的防火墙规则，并根据 TTL 自动过期这些规则，即使对于非 HTTP 服务也有效。\n\n可以通过 Docker Compose 轻松部署。配置包括设置 API 密钥、审查受信任的代理，以及选择性地启用 FirewallD 集成（需要容器的 root 访问权限）。本文包含有关使用 Caddy 和 FirewallD 设置 Knocker 的详细说明，以及故障排除提示。\n\n该项目包括单元测试和集成测试。可以在配置文件中启用 API 文档端点。该项目是在 AI 的帮助下构建的，不赞成使用 AI 的用户请勿使用它。"
  },
  {
    "id": "45666510",
    "title": "Greg Newby, CEO of Project Gutenberg Literary Archive Foundation, has died",
    "url": "https://www.pgdp.net/wiki/In_Memoriam/gbnewby",
    "summary": "This article announces the death of Dr. Gregory B. Newby, CEO of the Project Gutenberg Literary Archive Foundation, after a short battle with cancer. Dr. Newby served as CEO for over 20 years and was a voting member of the Distributed Proofreaders Foundation board, maintaining a close partnership between the two organizations.\n\nThe article highlights Dr. Newby's passion for making literature accessible. Inspired by receiving an electronic copy of *Alice's Adventures in Wonderland* in 1987, he recognized the potential of ebooks and dedicated himself to Project Gutenberg's mission. He believed in the importance of having a positive impact by making literature available to everyone.\n\nUnder his leadership, Project Gutenberg's ebook collection grew to over 75,000 titles, many of which were produced by Distributed Proofreaders. A significant achievement in 2023 was the Project Gutenberg Open Audiobook Collection of AI-narrated audiobooks, a collaboration with Microsoft and MIT that was recognized by TIME magazine as one of the best inventions of the year.\n\nThe article emphasizes the strong partnership between Dr. Newby and Distributed Proofreaders, expressing that his leadership and dedication to Project Gutenberg will be greatly missed.\n",
    "chinese_title": "古腾堡计划文学档案馆基金会CEO格雷格·纽比去世",
    "chinese_summary": "本文沉痛宣布古腾堡计划文学档案馆基金会首席执行官格雷戈里·B·纽比博士因罹患癌症，经短暂抗争后不幸逝世。纽比博士担任首席执行官超过20年，同时也是分布式校对者基金会董事会的投票成员，保持着两家机构之间的紧密合作关系。\n\n文章重点介绍了纽比博士对普及文学的热情。1987年收到电子版《爱丽丝梦游仙境》的启发，他认识到电子书的潜力，并全身心投入到古腾堡计划的使命中。他坚信，通过向所有人提供文学作品，产生积极影响至关重要。\n\n在他的领导下，古腾堡计划的电子书藏书增长到超过75,000部，其中许多是由分布式校对者制作的。2023年的一项重大成就是古腾堡计划开放式人工智能旁白有声读物收藏，这是与微软和麻省理工学院合作的项目，被《时代》杂志评为年度最佳发明之一。\n\n文章强调了纽比博士与分布式校对者之间的牢固伙伴关系，并表示他的领导才能和对古腾堡计划的奉献精神将被人们深深怀念。"
  },
  {
    "id": "45668408",
    "title": "The Dragon Hatchling: The missing link between the transformer and brain models",
    "url": "https://arxiv.org/abs/2509.26507",
    "summary": "This article introduces \"Dragon Hatchling\" (BDH), a novel Large Language Model architecture inspired by the biological brain, aiming to bridge the gap between Transformers and brain models. BDH utilizes a scale-free network of locally-interacting \"neuron particles,\" offering both theoretical grounding and inherent interpretability while maintaining Transformer-like performance.\n\nThe model is presented as a practical and performant state-of-the-art attention-based state space sequence learning architecture. It can be formulated for GPU processing and exhibits similar scaling laws to Transformers, rivaling GPT2 performance on language and translation tasks for the same parameter size (10M to 1B) and training data.\n\nA key aspect of BDH is its biological plausibility. The model's working memory relies on synaptic plasticity with Hebbian learning, demonstrating that specific synapses strengthen when the model processes related concepts. The neuron interaction network is highly modular with a heavy-tailed degree distribution, suggesting a possible mechanism for human speech processing.\n\nBDH is also designed with interpretability in mind. Activation vectors are sparse and positive, and the model exhibits monosemanticity on language tasks. The interpretability extends beyond neurons and model parameters to the state of the model itself. Code and an accompanying blog are available for further exploration.\n",
    "chinese_title": "龙雏：连接Transformer和脑模型之间的缺失环节",
    "chinese_summary": "本文介绍了“龙雏”（BDH），一种受生物大脑启发的新型大型语言模型架构，旨在弥合Transformer模型与大脑模型之间的差距。BDH利用局部交互的“神经元粒子”的无尺度网络，在保持类Transformer性能的同时，提供理论基础和内在可解释性。\n\n该模型被认为是一种实用且高性能的，基于注意力机制的最先进的状态空间序列学习架构。它可以通过公式在GPU上进行处理，并表现出与Transformer相似的缩放规律，在相同参数大小（1000万到10亿）和训练数据下，其在语言和翻译任务上的性能可与GPT2相媲美。\n\nBDH的一个关键方面是其生物合理性。该模型的工作记忆依赖于具有赫布学习的突触可塑性，表明当模型处理相关概念时，特定突触会得到加强。神经元交互网络具有高度模块化和重尾度分布，表明其可能是人类语音处理的一种机制。\n\nBDH在设计时也考虑到了可解释性。激活向量是稀疏且为正的，并且该模型在语言任务上表现出单义性。可解释性不仅限于神经元和模型参数，还扩展到模型本身的状态。代码和配套博客可供进一步探索。"
  },
  {
    "id": "45668022",
    "title": "Tesla Recalls Almost 13,000 EVs over Risk of Battery Power Loss",
    "url": "https://www.bloomberg.com/news/articles/2025-10-22/tesla-recalls-almost-13-000-evs-over-risk-of-battery-power-loss",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "特斯拉因电池电力损失风险召回近13000辆电动汽车",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "45668805",
    "title": "Cigarette-smuggling balloons force closure of Lithuanian airport",
    "url": "https://www.theguardian.com/world/2025/oct/22/cigarette-smuggling-balloons-force-closure-vilnius-airport-lithuania",
    "summary": "Cigarette-smuggling balloons from Belarus forced the temporary overnight closure of Vilnius airport in Lithuania for safety reasons. Dozens of balloons were used to transport Belarusian cigarettes into the EU, where tobacco is more expensive. The incident was described as \"the most intense this year\" by Lithuania's national crisis management centre, leading to the suspension of flights from 11 pm Tuesday to 6:30 am Wednesday. Land border crossings were also temporarily closed.\n\nLithuania's Prime Minister Inga Ruginienė urged Belarus to cooperate in preventing future incidents, emphasizing the need for a responsible approach regardless of political relations. The concern stems from the high volume of balloons crossing the border, with 966 entering last year and over 500 this year.\n\nA similar incident occurred on October 5th when 25 balloons entered Lithuanian airspace. Border guards have been authorized to shoot down the balloons since last year. Neighboring Poland has also experienced over 100 similar incidents this year. The airspace violations are particularly sensitive due to previous incidents involving suspected Russian drones entering Lithuanian territory from Belarus.\n",
    "chinese_title": "走私香烟气球迫使立陶宛机场关闭",
    "chinese_summary": "来自白俄罗斯的走私香烟气球迫使立陶宛维尔纽斯机场因安全原因暂时关闭一夜。数十个气球被用来将白俄罗斯香烟运往欧盟，那里的烟草价格更高。立陶宛国家危机管理中心称该事件为“今年最严重的一次”，导致周二晚上11点至周三早上6:30之间的航班停飞。陆地边境口岸也暂时关闭。\n\n立陶宛总理英格丽达·西蒙尼特呼吁白俄罗斯合作，防止未来发生类似事件，强调无论政治关系如何，都需要采取负责任的态度。担忧源于大量气球越境，去年有966个进入，今年已超过500个。\n\n10月5日也发生过类似事件，当时有25个气球进入立陶宛领空。边防部队自去年以来已被授权击落这些气球。邻国波兰今年也经历了100多起类似事件。由于之前发生过疑似俄罗斯无人机从白俄罗斯进入立陶宛领土的事件，这些领空入侵行为尤其敏感。"
  },
  {
    "id": "45526766",
    "title": "Ghostly swamp will-O'-the-wisps may be explained by science",
    "url": "https://www.snexplores.org/article/swamp-gas-methane-will-o-wisp-chemistry",
    "summary": "This article explores a potential scientific explanation for the ghostly lights known as will-o'-the-wisps, often seen hovering over swamps and cemeteries and attributed to folklore or spirits. While the traditional explanation involves the spontaneous combustion of swamp gas (primarily methane), chemist Luigi Garlaschelli's experiments failed to perfectly replicate the blue flame associated with the phenomenon.\n\nThe article highlights a new study from chemist Richard Zare's team at Stanford University (led by Yu Xia) suggesting that micro-sparks of electricity could be the igniting source. Their experiments showed that tiny bubbles in water, mimicking gas seeping from a swamp, can generate micro-lightning that could potentially ignite methane gas. They successfully captured these micro-sparks using sensitive photon counters and a high-speed camera.\n\nWhile the study demonstrates the potential for micro-bubbles to create electrical discharges, some scientists, like Antonio Pavão and Garlaschelli, remain unconvinced it fully explains will-o'-the-wisps. Pavão questions the lack of modern-day sightings and suggests old lanterns might have ignited swamp gas in the past, while Garlaschelli points out the discrepancy between underwater lab conditions and the aerial nature of will-o'-the-wisps.\n\nDespite the remaining uncertainties, the research is considered a promising step forward in understanding triboelectricity. It offers potential applications in environmental chemistry, such as breaking down pollutants, triggering chemical reactions under milder conditions, and improving everyday technologies. The article even suggests a modern-day experiment to replicate the conditions of will-o'-the-wisps.\n",
    "chinese_title": "鬼火沼泽或可用科学解释",
    "chinese_summary": "对鬼火现象的科学解释探索"
  },
  {
    "id": "45661638",
    "title": "rlsw – Raylib software OpenGL renderer in less than 5k LOC",
    "url": "https://github.com/raysan5/raylib/blob/master/src/external/rlsw.h",
    "summary": "The GitHub repository \"rlsw\" by raysan5 / raylib presents a software OpenGL renderer implemented using the Raylib library, achieving this in under 5,000 lines of code. The title highlights the project's core features: it's a software renderer (as opposed to hardware-accelerated), it uses OpenGL as its API, and it is remarkably compact in its implementation. The repository itself appears to have experienced a loading error at the time of capture. Despite this, the information provided suggests that the project is popular, indicated by its 2.7k forks and 28.8k stars. The project likely provides a valuable resource for understanding software rendering, OpenGL principles, and efficient code implementation, especially in the context of the well-regarded Raylib game development library. It is significant due to the increasing rarity of software renderers in modern graphics programming.\n",
    "chinese_title": "rlsw – 少于5千行代码的Raylib软件OpenGL渲染器",
    "chinese_summary": "raysan5/raylib的GitHub仓库\"rlsw\"展示了一个使用Raylib库实现的软件OpenGL渲染器，其代码量少于5000行。标题突出了该项目的核心特性：它是一个软件渲染器（与硬件加速相对），使用OpenGL作为其API，并且实现非常紧凑。在捕获时，该仓库本身似乎遇到了加载错误。尽管如此，提供的信息表明该项目很受欢迎，拥有2.7k个fork和28.8k个star。该项目很可能为理解软件渲染、OpenGL原理和高效代码实现提供了一个宝贵的资源，尤其是在备受推崇的Raylib游戏开发库的背景下。由于现代图形编程中软件渲染器越来越罕见，因此它具有重要意义。"
  },
  {
    "id": "45667458",
    "title": "Starcloud",
    "url": "https://blogs.nvidia.com/blog/starcloud/",
    "summary": "This article, titled \"Starcloud,\" announces an expansion of the collaboration between NVIDIA and Google Cloud to accelerate enterprise AI and industrial digitalization. The partnership focuses on providing businesses with greater access to accelerated computing power to transform various enterprise workloads, ranging from visual computing to advanced AI, including agentic and physical AI applications.\n\nSpecifically, Google Cloud unveiled new offerings and integrations leveraging NVIDIA's hardware and software. This likely includes:\n\n*   **Access to NVIDIA's latest GPUs:** Google Cloud will probably be providing its customers with access to NVIDIA's most advanced GPUs, enabling faster training and inference for AI models.\n*   **Optimized Software Integrations:** Expect integrations between NVIDIA's software stack (like CUDA, TensorRT, etc.) and Google Cloud's AI platform and services. This makes it easier for developers to build and deploy AI applications on Google Cloud.\n*   **Solutions for Specific Industries:** The partnership likely aims to address the needs of industries like manufacturing, healthcare, and automotive, where accelerated computing is crucial for tasks like simulation, robotics, and real-time data analysis.\n\nIn essence, NVIDIA and Google Cloud are working together to democratize access to powerful computing resources, empowering enterprises to leverage AI and digitalization to drive innovation and efficiency across their operations.\n",
    "chinese_title": "星云",
    "chinese_summary": "题为“星云”的文章宣布NVIDIA和谷歌云扩大合作，以加速企业人工智能和工业数字化。该合作的重点是为企业提供更大的加速计算能力，以转变各种企业工作负载，范围从视觉计算到先进人工智能，包括智能体和物理人工智能应用。\n\n具体而言，谷歌云推出了利用NVIDIA硬件和软件的新产品和集成。这可能包括：\n\n*   **访问NVIDIA最新的GPU：**谷歌云可能会向其客户提供访问NVIDIA最先进的GPU的权限，从而为AI模型实现更快的训练和推理。\n*   **优化的软件集成：** 预计NVIDIA的软件堆栈（如CUDA、TensorRT等）与谷歌云的AI平台和服务之间将进行集成。 这使得开发人员可以更轻松地在谷歌云上构建和部署AI应用程序。\n*   **针对特定行业的解决方案：** 该合作关系可能旨在满足制造业、医疗保健和汽车等行业的需求，在这些行业中，加速计算对于模拟、机器人和实时数据分析等任务至关重要。\n\n本质上，NVIDIA和谷歌云正在共同努力，普及对强大计算资源的访问，从而使企业能够利用人工智能和数字化来推动其运营中的创新和效率。"
  },
  {
    "id": "45655188",
    "title": "NASA chief suggests SpaceX may be booted from moon mission",
    "url": "https://www.cnn.com/2025/10/20/science/nasa-spacex-moon-landing-contract-sean-duffy",
    "summary": "NASA is considering opening up the lunar lander contract for the Artemis III mission, potentially sidelining SpaceX due to concerns about its Starship development timeline and the perceived risk of falling behind China in the new space race. NASA acting chief Sean Duffy expressed these concerns in recent interviews, stating his intention to allow other companies to compete with SpaceX.\n\nThe Artemis III mission, slated for mid-2027, aims to return astronauts to the moon for the first time since the Apollo program. While SpaceX currently holds a $2.9 billion contract for the lunar lander, Duffy suggested Blue Origin, which already has a NASA contract for later Artemis missions, could potentially take over. He also mentioned the possibility of opening the competition to other companies without existing contracts.\n\nNASA has requested \"acceleration approaches\" from both SpaceX and Blue Origin by October 29 and will issue a Request for Information (RFI) to the entire commercial space industry to explore ways to increase the mission cadence to the Moon. The agency emphasizes the urgency to beat China to the moon, a goal shared by lawmakers.\n\nExperts have raised concerns about the complexity and timelines for both Starship and Blue Moon, particularly the need for in-orbit refueling. The article notes that an RFI is typically an informal fact-finding process, while a Request for Proposal (RFP) would be a more formal solicitation.\n",
    "chinese_title": "美国宇航局局长暗示SpaceX或将被踢出登月任务",
    "chinese_summary": "美国国家航空航天局考虑开放“阿耳忒弥斯III”登月舱合同，可能因SpaceX的星舰开发时间表及其在新太空竞赛中落后于中国的风险担忧而将其搁置。美国国家航空航天局代理局长肖恩·达菲在最近的采访中表达了这些担忧，并表示他打算允许其他公司与SpaceX竞争。\n\n“阿耳忒弥斯III”任务计划于2027年中期进行，旨在自阿波罗计划以来首次将宇航员送回月球。虽然SpaceX目前持有价值29亿美元的登月舱合同，但达菲暗示，已经拥有美国国家航空航天局后续阿耳忒弥斯任务合同的蓝色起源公司有可能接手。他还提到，有可能向其他没有现有合同的公司开放竞争。\n\n美国国家航空航天局已要求SpaceX和蓝色起源在10月29日之前提交“加速方案”，并将向整个商业航天工业发布信息征询书（RFI），以探索增加登月任务频率的方法。该机构强调了在登月方面击败中国的紧迫性，这也是立法者们共同的目标。\n\n专家们对星舰和蓝色月亮的复杂性和时间表表示担忧，特别是对轨道加油的需求。文章指出，信息征询书通常是一个非正式的事实调查过程，而征求建议书（RFP）将是一个更正式的招标。"
  },
  {
    "id": "45610939",
    "title": "Distributed Ray-Tracing",
    "url": "https://www.4rknova.com//blog/2019/02/24/distributed-raytracing",
    "summary": "This article explains distributed ray-tracing and how it enhances realism compared to traditional Whitted ray-tracing. While Whitted ray-tracing uses a single ray per pixel and a limited number of additional rays for shadows, reflections, and refractions, it struggles to accurately simulate real-world optical phenomena.\n\nDistributed ray-tracing, also called stochastic ray-tracing, addresses these limitations by using Monte Carlo sampling. Instead of relying on single, binary shadow queries for infinitely small light sources (resulting in hard shadows), it simulates light sources of arbitrary size by casting multiple shadow rays to random points on the light source, approximating occlusion probability and creating soft shadows with penumbras.\n\nThis sampling approach extends to other effects. Glossy reflections are achieved by generating multiple reflection rays towards random samples on a specular lobe. Depth of field is simulated by distributing integration samples on a thin lens. Motion blur is produced by integrating samples in the time domain. Essentially, distributed ray-tracing provides a better approximation of the rendering equation by sampling the integrand at multiple points across the domain.\n\nThe article showcases examples of distributed ray-tracing in action, demonstrating softer shadows, glossy surfaces, and depth of field. It also provides example code for implementing a thin lens model for depth of field and links to an open-source renderer, xtracer, for further exploration.\n",
    "chinese_title": "分布式光线追踪",
    "chinese_summary": "本文解释了分布式光线追踪，以及它与传统Whitted光线追踪相比如何增强真实感。Whitted光线追踪对每个像素使用单条光线，并对阴影、反射和折射使用有限数量的额外光线，因此难以准确模拟真实世界的光学现象。\n\n分布式光线追踪，也称为随机光线追踪，通过使用蒙特卡洛采样来解决这些限制。它不是依赖于无限小光源的单个、二元阴影查询（导致硬阴影），而是通过向光源上的随机点投射多条阴影光线来模拟任意大小的光源，从而近似计算遮挡概率并创建带有半影的柔和阴影。\n\n这种采样方法也适用于其他效果。通过向镜面反射叶瓣上的随机样本生成多条反射光线来实现光泽反射。通过在薄透镜上分布积分样本来模拟景深。通过在时域中积分样本来产生运动模糊。本质上，分布式光线追踪通过在整个域中的多个点对被积函数进行采样，从而更好地逼近渲染方程。\n\n本文展示了分布式光线追踪的实际应用示例，展示了更柔和的阴影、光泽表面和景深。它还提供了实现景深的薄透镜模型的示例代码，并链接到开源渲染器xtracer，以便进一步探索。"
  },
  {
    "id": "45655161",
    "title": "Neural audio codecs: how to get audio into LLMs",
    "url": "https://kyutai.org/next/codec-explainer",
    "summary": "This article explores the challenges of building effective speech LLMs and introduces neural audio codecs as a solution. Current voice interfaces rely on transcription, lacking nuance and true understanding of audio. The author argues that directly applying the success of text LLMs to audio is difficult due to the high sampling rate and temporal coherence requirements of audio data.\n\nThe article details an attempt to train a language model on raw audio samples, which results in poor performance. It then introduces the concept of neural audio codecs, which compress audio into discrete tokens, allowing LLMs to predict continuations more effectively.\n\nThe article uses a Fashion MNIST example to explain Vector Quantized Variational Autoencoders (VQ-VAEs), a type of neural audio codec. It demonstrates how to train an autoencoder with quantization, addressing the non-differentiability issue using the straight-through estimator and adding a commitment loss to improve quantization. It shows how this compresses data, albeit with a loss of quality.\n\nFinally, the article introduces Residual Vector Quantization (RVQ), an extension of VQ-VAE that improves reconstruction fidelity by quantizing residuals at multiple levels. This technique uses multiple quantizers to represent the data, allowing for a higher number of possible values without a massive increase in computational cost. RVQ iteratively quantizes the error (residual) from the previous quantization level, resulting in a more refined representation of the original data. The article lays the groundwork for how these codecs, including the Kyutai's Mimi codec, enable the processing of audio by LLMs.\n",
    "chinese_title": "神经音频编解码器：如何将音频输入大型语言模型",
    "chinese_summary": "本文探讨了构建有效的语音LLM所面临的挑战，并介绍了神经音频编解码器作为一种解决方案。当前的语音界面依赖于转录，缺乏细微差别和对音频的真正理解。作者认为，由于音频数据的高采样率和时间连贯性要求，直接将文本LLM的成功应用于音频是困难的。\n\n文章详细介绍了一项尝试在原始音频样本上训练语言模型的尝试，结果表现不佳。随后介绍了神经音频编解码器的概念，该编解码器将音频压缩成离散的token，从而使LLM能够更有效地预测延续。\n\n文章使用Fashion MNIST示例来解释向量量化变分自编码器（VQ-VAE），这是一种神经音频编解码器。它演示了如何训练带有量化的自编码器，使用直通估计器解决不可微问题，并添加承诺损失以改善量化。它展示了这如何压缩数据，尽管会损失质量。\n\n最后，文章介绍了残差向量量化（RVQ），它是VQ-VAE的扩展，通过在多个级别量化残差来提高重建保真度。该技术使用多个量化器来表示数据，从而允许更多的可能值，而无需大幅增加计算成本。RVQ迭代地量化来自先前量化级别的误差（残差），从而产生对原始数据的更精细的表示。文章为这些编解码器（包括Kyutai的Mimi编解码器）如何使LLM能够处理音频奠定了基础。"
  },
  {
    "id": "45661306",
    "title": "Erowid - Documenting the Complex Relationship Between Humans and Psychoactives",
    "url": "https://www.erowid.org",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "Erowid - 记录人类与精神活性物质之间的复杂关系",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "45662668",
    "title": "The Hidden Engineering of Niagara Falls",
    "url": "https://practical.engineering/blog/2025/10/21/the-hidden-engineering-of-niagara-falls",
    "summary": "Niagara Falls is not just a tourist attraction, but a hub of significant engineering feats tied to shipping, power generation, and water control. The falls posed a shipping obstacle between Lake Erie and Lake Ontario, which was overcome by the Welland Canal, a crucial waterway with eight locks to manage the elevation difference.\n\nThe falls' unique combination of high water flow and significant elevation drop made it the birthplace of large-scale hydroelectric power in North America. Water is diverted from the Niagara River through massive tunnels to power plants, reducing the flow over the falls. This diversion is managed by the International Control Dam to balance tourism and power generation needs. Pumped storage plants further optimize power generation by storing water and releasing it during peak demand.\n\nAlthough the water diversion reduces the flow over the falls by 50%, it also slows erosion, helping to preserve them. The American Falls were even temporarily shut off in 1969 to assess and stabilize the talus (rock debris) at its base.\n\nIn essence, Niagara Falls showcases the intersection of natural wonder and human engineering, with infrastructure designed to harness its power, facilitate transportation, and preserve its beauty.\n",
    "chinese_title": "尼亚加拉瀑布的隐秘工程",
    "chinese_summary": "尼亚加拉瀑布不仅是旅游胜地，也是与航运、发电和水利控制相关的重大工程壮举的中心。瀑布阻碍了伊利湖和安大略湖之间的航运，而韦兰运河克服了这一障碍，这是一条关键的水道，拥有八个船闸来管理高程差。\n\n瀑布高流量和显著高程下降的独特结合使其成为北美大规模水力发电的诞生地。尼亚加拉河的水通过巨大的隧道被引流到发电厂，从而减少了瀑布的流量。这种引流由国际控制坝管理，以平衡旅游业和发电需求。抽水蓄能电站通过储存水并在高峰需求期间释放水来进一步优化发电。\n\n虽然水流的转移减少了瀑布流量的50%，但它也减缓了侵蚀，有助于保护瀑布。美国瀑布甚至在1969年被暂时关闭，以评估和稳定其底部的岩屑（岩石碎片）。\n\n本质上，尼亚加拉瀑布展示了自然奇观和人类工程的交汇，其基础设施旨在利用其力量、促进交通运输和保护其美丽。"
  },
  {
    "id": "45661253",
    "title": "Replacing a $3000/mo Heroku bill with a $55/mo server",
    "url": "https://disco.cloud/blog/how-idealistorg-replaced-a-3000mo-heroku-bill-with-a-55-server/",
    "summary": "The article \"Replacing a $3000/mo Heroku bill with a $55/mo server\" details how Idealist.org significantly reduced their hosting costs by migrating away from Heroku to a self-managed server. Facing a hefty $3000 monthly Heroku bill, they sought a more cost-effective solution.\n\nThe move likely involved setting up their own infrastructure, potentially using cloud providers like AWS, DigitalOcean, or Linode, or even a dedicated server. The article probably outlines the steps taken, which would include:\n\n*   **Analyzing Heroku usage:** Understanding resource consumption to determine the required server specifications.\n*   **Server setup and configuration:** Installing necessary software, configuring databases, and setting up deployment pipelines.\n*   **Application migration:** Moving the application code and data from Heroku to the new server.\n*   **Optimization:** Tweaking server settings and application code for optimal performance.\n*   **Ongoing maintenance:** Implementing monitoring, security measures, and updates.\n\nThe primary takeaway is that for projects with predictable resource needs and the technical expertise, managing your own server can lead to substantial cost savings compared to PaaS solutions like Heroku, even if it requires more initial effort and ongoing maintenance. The $55/mo figure highlights the potential for dramatic cost reduction.\n",
    "chinese_title": "用每月55美元的服务器替代每月3000美元的Heroku账单",
    "chinese_summary": "用每月55美元的服务器替换每月3000美元的Heroku账单\n        \n文章“用每月55美元的服务器替换每月3000美元的Heroku账单”详细介绍了Idealist.org如何通过从Heroku迁移到自管理服务器来显著降低其托管成本。面对每月高达3000美元的Heroku账单，他们寻求更具成本效益的解决方案。\n\n此举可能涉及设置他们自己的基础设施，可能使用AWS、DigitalOcean或Linode等云提供商，甚至专用服务器。 该文章可能概述了采取的步骤，其中包括：\n\n*   **分析Heroku使用情况：** 了解资源消耗以确定所需的服务器规格。\n*   **服务器设置和配置：** 安装必要的软件、配置数据库以及设置部署管道。\n*   **应用程序迁移：** 将应用程序代码和数据从Heroku迁移到新服务器。\n*   **优化：** 调整服务器设置和应用程序代码以获得最佳性能。\n*   **持续维护：** 实施监控、安全措施和更新。\n\n主要的结论是，对于具有可预测资源需求和技术专长的项目，与Heroku等PaaS解决方案相比，管理自己的服务器可以带来可观的成本节省，即使这需要更多的初始努力和持续维护。每月55美元的数字突显了大幅降低成本的潜力。"
  },
  {
    "id": "45604013",
    "title": "Show HN: Modshim – A new alternative to monkey-patching in Python",
    "url": "https://github.com/joouha/modshim",
    "summary": "Modshim is presented as a clean alternative to monkey-patching, forking, and vendoring in Python, offering a way to enhance existing modules without directly modifying their source code. It creates a new, \"shimmed\" module by overlaying custom functionality onto the original, preserving its behavior while introducing modifications like bug fixes, feature additions, or alternative implementations.\n\nThe library operates by intercepting Python's import system, creating a virtual merged module accessible under a designated \"mount point.\" This involves locating both the original (\"lower\") and enhancement (\"upper\") modules, executing their code in sequence, and rewriting Abstract Syntax Trees (ASTs) to redirect internal references within these modules to the new combined module.\n\nThe key benefits highlighted include avoiding global namespace pollution associated with monkey-patching, reducing the maintenance burden of forking by depending on the original library, and maintaining a cleaner separation of code compared to vendoring. The article provides practical examples, like adding a prefix argument to `textwrap.TextWrapper` and configurable retries to the `requests` library, demonstrating how modshim enables modular enhancements and internal reference rewriting. It underscores the preservation of the original module's integrity, ensuring other parts of the application remain unaffected by the modifications. Modshim's approach keeps enhancements isolated, maintainable, and ready for potential upstream contribution.\n",
    "chinese_title": "Show HN: Modshim – Python 中一种新的替代猴子补丁的方法",
    "chinese_summary": "Modshim：Python中替代猴子补丁、Fork和Vendoring的方案\n\nModshim是一种干净的替代方案，用于替代Python中的猴子补丁、Fork和Vendoring，它提供了一种增强现有模块的方法，而无需直接修改其源代码。它通过将自定义功能覆盖到原始模块上来创建一个新的“shimmed”模块，在保留其行为的同时引入修改，如错误修复、功能添加或替代实现。\n\n该库通过拦截Python的导入系统来运行，创建一个可在指定“挂载点”下访问的虚拟合并模块。这涉及到定位原始（“下层”）模块和增强（“上层”）模块，按顺序执行它们的代码，并重写抽象语法树（AST），以将这些模块内的内部引用重定向到新的组合模块。\n\n强调的关键优势包括：避免与猴子补丁相关的全局命名空间污染，通过依赖原始库来减少Fork的维护负担，以及与Vendoring相比，保持更清晰的代码分离。文章提供了实际示例，例如向`textwrap.TextWrapper`添加前缀参数，以及向`requests`库添加可配置的重试机制，展示了modshim如何实现模块化增强和内部引用重写。它强调了对原始模块完整性的保护，确保应用程序的其他部分不受修改的影响。Modshim的方法使增强功能保持隔离、可维护，并为潜在的向上游贡献做好准备。"
  },
  {
    "id": "45606853",
    "title": "Mathematicians have found a hidden 'reset button' for undoing rotation",
    "url": "https://www.newscientist.com/article/2499647-mathematicians-have-found-a-hidden-reset-button-for-undoing-rotation/",
    "summary": "Mathematicians Jean-Pierre Eckmann and Tsvi Tlusty have discovered a universal \"reset button\" for undoing rotations of nearly any object. Instead of painstakingly reversing each individual rotation, their method involves scaling the initial rotation by a common factor and repeating it twice.\n\nThe principle applies to objects like spinning tops, qubits, gyroscopes, and robotic arms, allowing them to return to their original position after a complex series of rotations. The discovery is rooted in the mathematical space SO(3), which catalogues all possible rotations in three dimensions. Undoing a rotation is like finding a path back to the center of this space, which is difficult. Eckmann and Tlusty realized that finding a path to the *surface* of the space (a halfway point in undoing the rotation) is much easier.\n\nTheir proof relies on the 19th-century Rodrigues formula and an 1889 theorem from number theory. The scaling factor required for the reset nearly always exists.\n\nThis research showcases the richness of mathematics in the study of rotations and could have practical applications in fields like nuclear magnetic resonance (NMR) and robotics. In NMR/MRI, it could help undo unwanted spin rotations. In robotics, it could enable rolling robots to follow repeating paths using a reliable \"roll-reset-roll\" motion, or even allow robots to navigate by morphing their shape.\n",
    "chinese_title": "数学家发现撤销旋转的隐藏“重置按钮”",
    "chinese_summary": "数学家发现还原物体旋转的通用“重置按钮”\n\n数学家让-皮埃尔·埃克曼和茨维·特拉斯蒂发现了一种通用的“重置按钮”，可以撤销几乎任何物体的旋转。他们的办法不是费力地逆转每一次单独的旋转，而是将初始旋转按一个通用系数缩放并重复两次。\n\n该原理适用于旋转陀螺、量子比特、陀螺仪和机械臂等物体，使其在经过一系列复杂的旋转后能够返回到原始位置。该发现根植于数学空间SO(3)，它记录了三维空间中所有可能的旋转。撤销旋转就像找到一条回到这个空间中心的路径，这很困难。埃克曼和特拉斯蒂意识到，找到一条通往空间*表面*的路径（撤销旋转的中途点）要容易得多。\n\n他们的证明依赖于19世纪的罗德里格斯公式和1889年的一条数论定理。重置所需的缩放因子几乎总是存在的。\n\n这项研究展示了数学在旋转研究中的丰富性，并可能在核磁共振（NMR）和机器人等领域具有实际应用。在NMR/MRI中，它可以帮助撤销不需要的自旋旋转。在机器人领域，它可以使滚动机器人能够使用可靠的“滚动-重置-滚动”运动来遵循重复路径，甚至允许机器人通过改变形状来进行导航。"
  },
  {
    "id": "45588752",
    "title": "Evaluating Argon2 adoption and effectiveness in real-world software",
    "url": "https://arxiv.org/abs/2504.17121",
    "summary": "This paper, \"Evaluating Argon2 Adoption and Effectiveness in Real-World Software,\" by Tippe and Berner, investigates the real-world security of the Argon2 password hashing algorithm. It combines attack simulations with an empirical study of Argon2's deployment in public GitHub repositories.\n\nThe research quantifies the impact of different Argon2 parameter configurations on password guessing costs under realistic attack budgets. The economic model, validated against cryptocurrency mining benchmarks, shows that OWASP's recommended 46 MiB configuration significantly improves security compared to SHA-256. However, the study reveals diminishing returns with increasing memory allocation to RFC 9106's 2048 MiB. A critical finding is that Argon2, regardless of configuration, struggles against weak, commonly used passwords like those found in the RockYou dataset.\n\nThe analysis of GitHub repositories reveals growing Argon2 adoption but alarming weaknesses in its implementation. A significant 46.6% of deployments use weaker-than-OWASP recommended parameters. Surprisingly, sensitive applications like password managers and encryption tools do not exhibit stronger Argon2 configurations than general software.\n\nThe authors conclude that merely adopting a secure algorithm is insufficient for robust password security. Effective parameter guidance and developer education are crucial to leverage Argon2's potential and mitigate risks associated with weak passwords and incorrect configurations. The paper highlights a disconnect between the theoretical security of Argon2 and its practical implementation in real-world software.\n",
    "chinese_title": "评估Argon2在实际软件中的应用与有效性",
    "chinese_summary": "Tippe和Berner的论文《评估Argon2在实际软件中的采纳和有效性》研究了Argon2密码哈希算法在真实世界中的安全性。它将攻击模拟与Argon2在公共GitHub存储库中的部署的实证研究相结合。\n\n该研究量化了不同Argon2参数配置在现实攻击预算下对密码猜测成本的影响。该经济模型通过加密货币挖掘基准验证，表明OWASP推荐的46 MiB配置比SHA-256显著提高了安全性。然而，该研究表明，随着内存分配增加到RFC 9106的2048 MiB，收益递减。一个关键发现是，无论配置如何，Argon2都难以防御弱密码和常用密码，例如RockYou数据集中发现的密码。\n\n对GitHub存储库的分析表明，Argon2的采用率不断增长，但其实现存在令人担忧的弱点。高达46.6%的部署使用了弱于OWASP推荐的参数。令人惊讶的是，像密码管理器和加密工具这样的敏感应用程序并没有表现出比通用软件更强的Argon2配置。\n\n作者得出结论，仅仅采用安全的算法不足以实现强大的密码安全性。有效的参数指导和开发者教育对于发挥Argon2的潜力并减轻与弱密码和不正确配置相关的风险至关重要。该论文强调了Argon2的理论安全性与其在实际软件中的实际实现之间存在脱节。"
  },
  {
    "id": "45668453",
    "title": "Democracy and the open internet die in daylight",
    "url": "https://heatherburns.tech/2025/10/22/democracy-and-the-open-internet-die-in-daylight/",
    "summary": "Heather Burns, a UK tech policy expert, expresses concern over a recent development at the Washington Post. She highlights that the newspaper is offering free access to its articles in exchange for downloading the Comet browser from PerplexityAI, which is built around agentic AI. Burns finds this particularly disturbing, comparing it to outdated, restrictive practices from the 1990s where content access was conditional on using specific browsers.\n\nShe views this move as a potential shift in the funding model of journalism, moving away from adtech and towards agentic AI. While acknowledging the shortcomings of the adtech model, which she believes contributed to the current state of journalism, Burns strongly objects to replacing one privacy-obliterating technology with another. She sees this as a false promise of opportunity, essentially trading one form of privacy invasion for another.\n\nBurns' concerns are rooted in her commitment to an open web based on human rights, privacy, accessibility, and freedom of expression. She fears that this partnership between the Washington Post and PerplexityAI could further compromise these values. The author's overall tone is one of alarm and disillusionment, suggesting that this development marks a significant step towards eroding both democracy and the open internet.\n",
    "chinese_title": "民主与开放的互联网在光天化日之下消亡",
    "chinese_summary": "英国科技政策专家Heather Burns对《华盛顿邮报》最近的一项举措表示担忧。她指出，该报正提供免费访问其文章的权限，以换取下载PerplexityAI的Comet浏览器，该浏览器是围绕代理AI构建的。Burns认为这尤其令人不安，将其比作20世纪90年代过时的、限制性的做法，即内容访问取决于使用特定的浏览器。\n\n她认为此举可能是新闻业融资模式的转变，从广告技术转向代理AI。虽然她承认广告技术模式的缺点，认为它导致了新闻业的现状，但Burns强烈反对用另一种侵犯隐私的技术取代它。她认为这是对机会的虚假承诺，本质上是用一种形式的隐私侵犯换取另一种。\n\nBurns的担忧源于她对基于人权、隐私、可访问性和言论自由的开放网络的承诺。她担心《华盛顿邮报》和PerplexityAI之间的这种合作可能会进一步损害这些价值观。作者的总体基调是警惕和失望，表明这一发展标志着朝着侵蚀民主和开放互联网迈出了重要一步。"
  },
  {
    "id": "45646559",
    "title": "Getting DeepSeek-OCR working on an Nvidia Spark via brute force with Claude Code",
    "url": "https://simonwillison.net/2025/Oct/20/deepseek-ocr-claude-code/",
    "summary": "Simon Willison successfully used Anthropic's Claude Code to get DeepSeek-OCR, a new PyTorch CUDA model for OCR, running on an NVIDIA Spark device. He essentially outsourced the complex task to Claude within a Docker sandbox, giving it access to relevant repositories and a sample image to OCR.\n\nThe process took about 40 minutes, with minimal direct involvement from Willison. Claude Code navigated the challenges of running PyTorch with CUDA on the NVIDIA ARM architecture, including incompatible PyTorch versions. It identified and installed compatible ARM CUDA wheels, resolved CUDA errors, and ultimately ran the model successfully.\n\nClaude also experimented with different prompts for OCR and documented its findings, including a comparison of speed, text quality, structure, and best use cases for each prompt. It generated comprehensive notes in a `notes.md` file throughout the process, along with detailed README files and scripts for future use.\n\nKey takeaways include the effectiveness of using agentic loops and sandboxed environments like Docker with full permissions for automated problem-solving, as well as the importance of providing clear goals and resources to the AI agent. Willison also highlighted the value of his own expertise in guiding Claude when it encountered roadblocks. He also utilized VS Code's Remote SSH and Dev Containers extensions to monitor the Docker container's file system in real-time. The project demonstrated DeepSeek-OCR's potential and provided a reproducible method for running the model on similar hardware.\n",
    "chinese_title": "通过Claude代码暴力破解，使DeepSeek-OCR在Nvidia Spark上运行",
    "chinese_summary": "Simon Willison 成功利用 Anthropic 的 Claude Code 在 NVIDIA Spark 设备上运行了 DeepSeek-OCR，这是一款新的 PyTorch CUDA OCR 模型。他本质上是将这项复杂的任务外包给了 Docker 沙箱内的 Claude，并赋予其访问相关代码仓库和一个用于 OCR 的示例图片的权限。\n\n整个过程大约花费了 40 分钟，Willison 本人几乎没有直接参与。Claude Code 克服了在 NVIDIA ARM 架构上运行带有 CUDA 的 PyTorch 所面临的挑战，包括不兼容的 PyTorch 版本。它识别并安装了兼容的 ARM CUDA wheels，解决了 CUDA 错误，并最终成功运行了该模型。\n\nClaude 还尝试了不同的 OCR 提示词，并记录了它的发现，包括速度、文本质量、结构以及每种提示词的最佳使用案例的比较。在整个过程中，它在 `notes.md` 文件中生成了全面的笔记，以及详细的 README 文件和脚本，供将来使用。\n\n主要经验包括使用类似 Docker 的沙箱环境和完整权限的代理循环进行自动化问题解决的有效性，以及向 AI 代理提供清晰的目标和资源的重要性。Willison 还强调了当 Claude 遇到阻碍时，他自身专业知识在引导 Claude 方面的价值。他还利用 VS Code 的 Remote SSH 和 Dev Containers 扩展来实时监控 Docker 容器的文件系统。该项目展示了 DeepSeek-OCR 的潜力，并提供了一种在类似硬件上运行该模型的可复现方法。"
  },
  {
    "id": "45668008",
    "title": "Jaguar Land Rover hack cost UK economy an estimated $2.5B",
    "url": "https://www.reuters.com/sustainability/boards-policy-regulation/jaguar-land-rover-hack-cost-uk-economy-25-billion-report-says-2025-10-22/",
    "summary": "**Summary:**\n\nAccording to a report cited by Reuters, a cyberattack on Jaguar Land Rover (JLR) in early 2024 resulted in an estimated $2.5 billion loss to the UK economy. The report, likely commissioned by a cybersecurity firm or related organization, highlights the significant economic impact of the breach beyond the direct costs to JLR.\n\nWhile the specific details of the attack are not thoroughly outlined in this summarized version, the report suggests the loss stems from disrupted production, reputational damage leading to decreased sales, supply chain disruptions, and the costs associated with incident response, remediation, and legal ramifications. The attack reportedly targeted JLR's operations, potentially compromising intellectual property and customer data.\n\nThe report underscores the vulnerability of major manufacturers to cyberattacks and emphasizes the cascading effects such incidents can have on a nation's economy. It serves as a reminder of the increasing importance of robust cybersecurity measures and proactive risk management strategies for businesses, especially those involved in critical sectors like automotive manufacturing. The $2.5 billion figure is a significant one, highlighting the scale of potential economic damage from a successful cyberattack on a major UK corporation.\n",
    "chinese_title": "捷豹路虎遭黑客攻击，致英国经济损失约25亿美元",
    "chinese_summary": "**摘要：**\n\n据路透社援引的一份报告，2024年初对捷豹路虎（JLR）的网络攻击给英国经济造成了约25亿美元的损失。该报告可能由网络安全公司或相关组织委托编写，强调了此次事件对经济造成的重大影响，远超捷豹路虎的直接损失。\n\n虽然本摘要版本并未详尽概述此次攻击的具体细节，但报告表明，损失源于生产中断、声誉受损导致销量下降、供应链中断，以及事件响应、补救和法律后果相关的成本。据报道，此次攻击针对捷豹路虎的运营，可能泄露了知识产权和客户数据。\n\n该报告强调了大型制造商在网络攻击面前的脆弱性，并强调此类事件可能对国家经济产生的连锁反应。它提醒人们，强大的网络安全措施和积极主动的风险管理策略对企业（尤其是那些涉及汽车制造等关键领域的企业）来说日益重要。25亿美元的数字非常可观，突显了对一家英国大型公司成功的网络攻击可能造成的潜在经济损失规模。"
  },
  {
    "id": "45668469",
    "title": "The Stagnant Order. and the End of Rising Powers",
    "url": "https://www.foreignaffairs.com/united-states/stagnant-order-michael-beckley",
    "summary": "Michael Beckley's \"The Stagnant Order and the End of Rising Powers\" argues that the era of rapidly rising global powers, a hallmark of the industrial age, is ending. The key drivers of this shift are slowing productivity, shrinking populations, and the increased difficulty and diminished rewards of conquest.\n\nHistorically, rising powers like the UK, Germany, and the US were fueled by the Industrial Revolution's unprecedented gains in productivity, population growth, and military power. However, current technological advancements haven't replicated the transformative impact of the past, and productivity growth has stagnated. Demographic decline is widespread, with birthrates below replacement levels in most industrialized nations. Furthermore, the proliferation of technology and nuclear weapons has made conquest both riskier and less profitable.\n\nChina, the last major rising power, is already peaking, and other potential contenders like Japan, Russia, Europe, and India face their own limitations. The United States, while facing its challenges, is outperforming rivals experiencing deeper decay.\n\nThe consequences of this shift are profound. While a reduction in power transitions may ultimately decrease the likelihood of large-scale conflicts driven by rising powers seeking resources and status, the immediate aftermath brings dangers. Fragile states struggle with debt and youth bulges, while declining powers may resort to militarization and irredentism. Economic insecurity fuels extremism, erodes democracies, and potentially leads to unilateralism by major powers. The article concludes that the end of the age of rising powers does not guarantee a more peaceful world.\n",
    "chinese_title": "停滞的秩序：以及崛起大国的终结",
    "chinese_summary": "迈克尔·贝克利的《停滞的秩序和崛起大国的终结》认为，快速崛起的全球大国时代——工业时代的标志——正在走向终结。 这一转变的关键驱动因素是生产力下降、人口萎缩以及征服的难度增加和回报减少。\n\n历史上，英国、德国和美国等崛起大国得益于工业革命带来的前所未有的生产力提高、人口增长和军事力量增强。 然而，当前的技术进步尚未重现过去的变革性影响，生产力增长已经停滞。 人口下降普遍存在，大多数工业化国家的出生率都低于更替水平。 此外，技术和核武器的扩散使征服的风险更高，利润更低。\n\n中国是最后一个主要的崛起大国，但已经达到了顶峰，而日本、俄罗斯、欧洲和印度等其他潜在竞争者也面临着各自的局限性。 美国虽然面临挑战，但其表现优于正在经历更深层次衰退的竞争对手。\n\n这一转变的后果是深远的。 虽然权力过渡的减少最终可能会降低崛起大国寻求资源和地位而引发大规模冲突的可能性，但眼前的后果却带来了危险。 脆弱国家在债务和青年人口膨胀中挣扎，而衰落的大国可能会诉诸军事化和收复失地主义。 经济不安全感助长了极端主义，侵蚀了民主制度，并可能导致主要大国采取单边主义行动。 文章的结论是，崛起大国时代的终结并不能保证一个更加和平的世界。"
  },
  {
    "id": "45658479",
    "title": "ChatGPT Atlas",
    "url": "https://chatgpt.com/atlas",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "ChatGPT 地图集",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "45659883",
    "title": "Researchers complete first human trial on viability of enteral ventilation",
    "url": "https://newatlas.com/disease/butt-breathing-ignobel-prize/",
    "summary": "Researchers have completed the first human trial of enteral ventilation, a technique that aims to deliver oxygen to the body through the intestine, offering a potential alternative for patients with severe respiratory failure. The study, led by Cincinnati Children's Hospital, follows the scientists' prior IgNobel Prize for demonstrating that some mammals can breathe through their anus.\n\nThe trial focused on assessing the safety and tolerability of the procedure. Twenty-seven healthy male volunteers in Japan received a single intrarectal dose of non-oxygenated perfluorodecalin liquid, a substance known for its oxygen-carrying capacity, and were instructed to retain the liquid for 60 minutes. The results showed that the procedure was safe and well-tolerated, with mild side effects of abdominal bloating and discomfort at the largest volume of 1,500 ml. All clinical laboratory measures remained within normal range.\n\nThis first-in-human study establishes a critical safety foundation for future research. The scientists now plan to conduct further trials to determine the optimal dosage and duration needed to effectively improve blood-oxygen levels. This technique, inspired by bottom-feeding fish that absorb oxygen through their gut, holds potential as a life-saving emergency treatment for people with blocked airways or compromised lung function.\n",
    "chinese_title": "研究人员完成首个人体肠内通气可行性试验",
    "chinese_summary": "研究人员已完成首次人体肠道通气试验，该技术旨在通过肠道向身体输送氧气，为严重呼吸衰竭患者提供潜在替代方案。这项由辛辛那提儿童医院领导的研究，紧随科学家们此前因证明某些哺乳动物可以通过肛门呼吸而获得的搞笑诺贝尔奖之后。\n\n该试验的重点是评估该程序的安全性和耐受性。在日本，27名健康的男性志愿者接受了单次直肠内剂量的无氧全氟癸烷液体，这是一种以其携氧能力而闻名的物质，并被指示保持液体60分钟。结果表明，该程序安全且耐受性良好，仅在最大剂量1500毫升时出现轻微的腹胀和不适副作用。所有临床实验室指标均保持在正常范围内。\n\n这项首次人体研究为未来的研究奠定了关键的安全基础。科学家们现在计划进行进一步的试验，以确定有效提高血氧水平的最佳剂量和持续时间。这项技术受到通过肠道吸收氧气的底栖鱼类的启发，有望成为因气道阻塞或肺功能受损的人的救生急救治疗方法。"
  },
  {
    "id": "45649510",
    "title": "The death of thread per core",
    "url": "https://buttondown.com/jaffray/archive/the-death-of-thread-per-core/",
    "summary": "Justin Jaffray's article \"The Death of Thread Per Core\" discusses the shifting landscape of concurrency models, particularly in data processing. The core argument is that the traditional \"thread-per-core\" approach, which prioritizes data locality and minimizing cross-core communication, is facing challenges and a potential resurgence of \"work-stealing\" models.\n\nThe article highlights the benefits of thread-per-core when data distribution is relatively uniform. However, it points out that this model struggles with skewed data, becoming increasingly problematic with higher core counts. Work-stealing, where idle threads can \"steal\" tasks from busy threads, offers a solution to uneven workloads and better overall CPU utilization.\n\nKey arguments against thread-per-core include:\n\n*   **Increased Core Counts:** Skewed data distributions are more severely impacted on machines with higher core counts.\n*   **Improved IO Latency:** The rationale for maximizing CPU utilization has become more important due to improvements in other areas like disk speed.\n*   **Insight into Data Processing:** Data processing allows for more predictive introspection on data needs and task manipulation than general-purpose programming.\n*   **Cultural Shift:** As data systems scale, handling skew becomes a necessity, making \"solve the skew problem a layer up\" an inadequate strategy.\n\nUltimately, the article suggests that the choice between thread-per-core and work-stealing depends on the specific application and data characteristics. However, it argues that the increasing prevalence of skewed data and the growing need for elasticity in large-scale data systems are driving a renewed interest in work-stealing and shared-state concurrency models, shifting away from the strict thread-per-core paradigm.\n",
    "chinese_title": "每核线程的终结",
    "chinese_summary": "贾斯汀·贾弗雷的文章《每核线程之死》探讨了并发模型的转变，尤其是在数据处理领域。其核心论点是，传统的“每核线程”方法——优先考虑数据局部性和减少跨核心通信——正面临挑战，“工作窃取”模型可能再次兴起。\n\n文章强调了数据分布相对均匀时每核线程的优势。然而，它指出该模型在处理倾斜数据时会遇到困难，并且随着核心数量的增加，问题会变得越来越严重。工作窃取（空闲线程可以从繁忙线程“窃取”任务）为解决不均衡的工作负载和提高整体CPU利用率提供了一种方案。\n\n反对每核线程的关键论点包括：\n\n*   **核心数量增加：**在具有更多核心的机器上，倾斜的数据分布会受到更严重的影响。\n*   **IO延迟的改善：**由于磁盘速度等其他领域的改进，最大限度地提高CPU利用率的理由变得更加重要。\n*   **对数据处理的洞察：** 与通用编程相比，数据处理允许对数据需求和任务操作进行更具预测性的内省。\n*   **文化转变：** 随着数据系统的扩展，处理倾斜变得必然，使得“在上层解决倾斜问题”成为一种不充分的策略。\n\n最终，文章认为，每核线程和工作窃取之间的选择取决于具体的应用程序和数据特性。然而，它认为，倾斜数据的日益普遍和大规模数据系统中对弹性的日益增长的需求，正在推动人们对工作窃取和共享状态并发模型重新产生兴趣，从而摆脱严格的每核线程范例。"
  },
  {
    "id": "45669138",
    "title": "Should we worry about AI's circular deals?",
    "url": "https://www.noahpinion.blog/p/should-we-worry-about-ais-circular",
    "summary": "Noah Smith's article explores the concerns surrounding \"circular deals\" in the AI industry, where AI companies are investing in each other, raising fears of an impending bust. These deals typically involve chipmakers like Nvidia investing in AI model developers like OpenAI, who then use the funds to purchase the chipmaker's hardware, creating a closed loop.\n\nThe primary worries are twofold: first, that these deals artificially inflate revenue, misleading investors and creating unsustainable valuations, and second, that they increase systemic risk by making the fortunes of all involved companies interdependent. Smith argues that these deals are more akin to \"vendor finance\" (like GM lending to car buyers) than illegal \"round-tripping\" seen in the dot-com era. He reasons that revenue is flowing one-way, the companies involved are under intense scrutiny, and Nvidia's stock price didn't significantly jump after the OpenAI deal.\n\nHowever, he acknowledges the risk of increased interdependence. While a general AI bust would cripple all these companies regardless, the deals tie their fates even closer. Smith suggests that these deals may be a way for AI companies to diversify their dependencies and reduce risk, avoiding reliance on a few major clients. Essentially, he concludes that these circular deals are part of the broader high-stakes bet being placed on AI's potential, leading to a system more vulnerable to an AI crash, but less vulnerable to the failure of a specific AI company.\n",
    "chinese_title": "我们应该担心人工智能的循环交易吗？",
    "chinese_summary": "诺亚·史密斯的文章探讨了人工智能行业中围绕“循环交易”的担忧，即人工智能公司互相投资，引发了对即将崩溃的恐惧。这些交易通常涉及像英伟达这样的芯片制造商投资像OpenAI这样的人工智能模型开发商，然后后者利用这些资金购买芯片制造商的硬件，从而形成一个闭环。\n\n主要的担忧有两方面：首先，这些交易人为地抬高了收入，误导投资者并造成不可持续的估值；其次，它们通过使所有相关公司的命运相互依存来增加系统性风险。史密斯认为，这些交易更像是“供应商融资”（如通用汽车向汽车购买者贷款），而不是互联网泡沫时代常见的非法“循环交易”。他认为，收入是单向流动的，相关公司正受到严密审查，而且英伟达的股价在OpenAI交易后并没有显著上涨。\n\n然而，他承认相互依存的风险增加。虽然普遍的人工智能崩溃会摧毁所有这些公司，但这些交易使它们的命运更加紧密地联系在一起。史密斯认为，这些交易可能是人工智能公司分散其依赖性并降低风险的一种方式，从而避免依赖少数主要客户。本质上，他总结说，这些循环交易是押注人工智能潜力的更大赌注的一部分，导致一个更容易受到人工智能崩溃影响，但不太容易受到特定人工智能公司失败影响的系统。"
  },
  {
    "id": "45671427",
    "title": "GitHub is working on stacked diffs",
    "url": "https://twitter.com/jaredpalmer/status/1980619222918262842",
    "summary": "This isn't an article about GitHub working on stacked diffs. It's a placeholder page indicating JavaScript is disabled in the user's browser while trying to access X (formerly Twitter). The page instructs the user to enable JavaScript or switch to a supported browser. It also provides links to the X Help Center, Terms of Service, Privacy Policy, Cookie Policy, Imprint, and Ad Information. The copyright notice indicates the page belongs to X Corp. in 2025. The title is misleading and the content is unrelated. There is no information about GitHub or stacked diffs.\n",
    "chinese_title": "GitHub 正在开发堆叠式差异。",
    "chinese_summary": "这并非关于GitHub开发堆叠式差异的文章。这是一个占位符页面，表明用户尝试访问X（前身为Twitter）时，其浏览器已禁用JavaScript。该页面指示用户启用JavaScript或切换到受支持的浏览器，并提供X帮助中心、服务条款、隐私政策、Cookie政策、版本说明和广告信息的链接。版权声明表明该页面属于X Corp.，版权所有年份为2025年。标题具有误导性，内容不相关。其中没有关于GitHub或堆叠式差异的信息。"
  },
  {
    "id": "45668106",
    "title": "Argentine peso hits fresh lows despite U.S. support – and it could get worse",
    "url": "https://www.cnbc.com/2025/10/22/argentine-peso-at-fresh-lows-despite-us-purchases.html",
    "summary": "Despite a U.S. support package, including dollar purchases and a $20 billion currency swap, the Argentine peso has continued to fall to new lows amid political uncertainty ahead of midterm elections. The peso has depreciated over 5% since the U.S. intervention.\n\nExperts attribute the peso's weakness primarily to shifting expectations of a strong showing by Peronist (left-wing) parties, which historically favor policies leading to inflation and distrust in the peso. While U.S. support mitigates the situation, it may not fully offset market stress given the electoral uncertainty.\n\nTreasury Secretary Scott Bessent emphasized the \"systemic importance\" of Argentina's reforms and highlighted the country's \"acute illiquidity,\" leading to the U.S. intervention. Gustavo Medeiros noted Argentina's liquidity problem and the importance of the support package, especially as Argentina is trying to reduce debt by buying back its bonds at a discount. However, the continued peso depreciation suggests that political concerns are outweighing the impact of U.S. financial assistance.\n",
    "chinese_title": "阿根廷比索再创新低，尽管有美国支持——情况可能更糟",
    "chinese_summary": "尽管美国提供了包括购买美元和200亿美元货币互换在内的支持方案，但由于中期选举前政治局势不明朗，阿根廷比索持续跌至新低。自美国干预以来，比索已贬值超过5%。\n\n专家认为，比索疲软的主要原因是人们预期庇隆主义（左翼）政党将表现强劲，这些政党历来倾向于导致通货膨胀和对比索不信任的政策。 虽然美国的支持缓解了局势，但在选举不确定性的情况下，可能无法完全抵消市场压力。\n\n财政部长斯科特·贝森特强调了阿根廷改革的“系统重要性”，并强调了该国“严重的流动性不足”，导致了美国的干预。 古斯塔沃·梅代罗斯指出了阿根廷的流动性问题以及支持方案的重要性，尤其是在阿根廷试图通过以折扣价回购债券来减少债务之际。 然而，比索持续贬值表明，政治担忧超过了美国财政援助的影响。"
  },
  {
    "id": "45664147",
    "title": "OpenBSD 7.8",
    "url": "https://cdn.openbsd.org/pub/OpenBSD/7.8/ANNOUNCEMENT",
    "summary": "OpenBSD 7.8 was released on October 22, 2025, marking the 59th release of the operating system, which boasts a strong security record. This release brings a multitude of improvements and new features across the system.\n\nKey platform-specific updates include Raspberry Pi 5 support and acpicpu(4) implementation for arm64, along with fixes for AMD CPU power management on amd64. Kernel improvements include better error reporting, POSIX-2024 close-on-fork flag implementation (modified for security), improved lock handling, a new high-level software interrupt dispatcher, and moving to nanosecond sleep time arguments for better precision. AMD SEV-ES guest mode is now supported, and CPU xcalls are enabled.\n\nSuspend/hibernate support is enhanced with fixes for various devices, and SMP improvements include parallel TCP stack and IPv6 processing. Graphics drivers are updated to Linux 6.12.50, with a new qcdrm(4) driver for Qualcomm Snapdragon. VMM/VMD sees support for AMD SEV-ES confidential virtual machines, along with various security and memory management enhancements.\n\nUserland updates feature pkgconf replacing the Perl script for pkg-config(1), the addition of watch(1) utility, GPT/MBR backups via security(8) and recovery through fdisk(8). fdisk(8) gains an improved interactive editor. Profiling is updated with a new gprof system. Numerous bugfixes and documentation improvements were made across userland utilities.\n\nHardware support is expanded with drivers for various devices like Raspberry Pi peripherals, ASUS I2C HID keyboards, and Realtek RTL8125D/8127 Ethernet chips. Wireless drivers see improvements in qwx(4), bwfm(4), and iwx(4). Installer improvements include disk preference and preventing corrupted /bsd installations. Security enhancements include expanded pledge permissions and an unmapped guard page between the PCB and the kernel stack. The network stack gains soft LRO support for TCP and a new erspan(4) driver. pf(4) firewall and routing daemons also receive bug fixes and improvements.\n",
    "chinese_title": "OpenBSD 7.8",
    "chinese_summary": "OpenBSD 7.8 发布，带来诸多改进和新特性\n\nOpenBSD 7.8 于 2025 年 10 月 22 日发布，标志着该操作系统第 59 次发布，该操作系统以其强大的安全记录而闻名。此版本带来了整个系统的众多改进和新特性。\n\n关键的平台特定更新包括 Raspberry Pi 5 支持和 arm64 的 acpicpu(4) 实现，以及 amd64 上 AMD CPU 电源管理的修复。内核改进包括更好的错误报告、POSIX-2024 close-on-fork 标志实现（为安全而修改）、改进的锁处理、新的高级软件中断分发器，以及移动到纳秒睡眠时间参数以获得更好的精度。现在支持 AMD SEV-ES 来宾模式，并启用了 CPU xcall。\n\nSuspend/hibernate 支持得到了增强，修复了各种设备的问题，SMP 改进包括并行 TCP 栈和 IPv6 处理。图形驱动程序更新到 Linux 6.12.50，并为高通 Snapdragon 增加了一个新的 qcdrm(4) 驱动程序。VMM/VMD 支持 AMD SEV-ES 机密虚拟机，以及各种安全和内存管理增强功能。\n\nUserland 更新包括 pkgconf 替换用于 pkg-config(1) 的 Perl 脚本，添加 watch(1) 实用程序，以及通过 security(8) 进行 GPT/MBR 备份和通过 fdisk(8) 进行恢复。fdisk(8) 获得了改进的交互式编辑器。分析使用新的 gprof 系统进行了更新。整个 userland 实用程序进行了大量的错误修复和文档改进。\n\n硬件支持通过 Raspberry Pi 外围设备、华硕 I2C HID 键盘和 Realtek RTL8125D/8127 以太网芯片等各种设备的驱动程序得到扩展。无线驱动程序在 qwx(4)、bwfm(4) 和 iwx(4) 中得到了改进。安装程序的改进包括磁盘首选项和防止损坏 /bsd 安装。安全增强功能包括扩展的 pledge 权限以及 PCB 和内核堆栈之间的未映射保护页。网络栈获得了对 TCP 的软 LRO 支持和一个新的 erspan(4) 驱动程序。pf(4) 防火墙和路由守护程序也收到了错误修复和改进。"
  },
  {
    "id": "45657260",
    "title": "20,858 Public Domain Audio Books",
    "url": "https://librivox.org/search",
    "summary": "This LibriVox webpage advertises a catalog of 20,858 public domain audiobooks available for browsing. Users can utilize an advanced search function, filling in specific fields and options to refine their search. The catalog includes audiobooks recorded by individuals (solo) and groups. The page also encourages users to donate to LibriVox and thank the volunteer readers.\n\nA crucial disclaimer emphasizes that LibriVox recordings are in the public domain in the USA. However, users outside the US are responsible for verifying the copyright status of the audiobooks in their own country to ensure they are not violating copyright laws before downloading.\n\nThe catalog can be ordered alphabetically or by release date, offering users flexibility in how they browse the available titles.\n",
    "chinese_title": "20,858部公共版权领域有声书",
    "chinese_summary": "This LibriVox webpage advertises a catalog of 20,858 public domain audiobooks available for browsing. Users can utilize an advanced search function, filling in specific fields and options to refine their search. The catalog includes audiobooks recorded by individuals (solo) and groups. The page also encourages users to donate to LibriVox and thank the volunteer readers.\n\nA crucial disclaimer emphasizes that LibriVox recordings are in the public domain in the USA. However, users outside the US are responsible for verifying the copyright status of the audiobooks in their own country to ensure they are not violating copyright laws before downloading.\n\nThe catalog can be ordered alphabetically or by release date, offering users flexibility in how they browse the available titles.\n"
  },
  {
    "id": "45564821",
    "title": "Minds, brains, and programs (1980) [pdf]",
    "url": "https://home.csulb.edu/~cwallis/382/readings/482/searle.minds.brains.programs.bbs.1980.pdf",
    "summary": "生成摘要时出错",
    "chinese_title": "Minds, brains, and programs (1980) [pdf]",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45655190",
    "title": "Our modular, high-performance Merkle Tree library for Rust",
    "url": "https://github.com/bilinearlabs/rs-merkle-tree",
    "summary": "生成摘要时出错",
    "chinese_title": "Our modular, high-performance Merkle Tree library for Rust",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45580683",
    "title": "Principles and Methodologies for Serial Performance Optimization",
    "url": "https://danglingpointers.substack.com/p/principles-and-methodologies-for",
    "summary": "生成摘要时出错",
    "chinese_title": "Principles and Methodologies for Serial Performance Optimization",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45584680",
    "title": "Bare Metal (The Emacs Essay)",
    "url": "https://waxbanks.wordpress.com/2025/08/01/bare-metal-the-emacs-essay/",
    "summary": "生成摘要时出错",
    "chinese_title": "Bare Metal (The Emacs Essay)",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45651485",
    "title": "Wikipedia says traffic is falling due to AI search summaries and social video",
    "url": "https://techcrunch.com/2025/10/18/wikipedia-says-traffic-is-falling-due-to-ai-search-summaries-and-social-video/",
    "summary": "生成摘要时出错",
    "chinese_title": "Wikipedia says traffic is falling due to AI search summaries and social video",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45657287",
    "title": "Foreign hackers breached a US nuclear weapons plant via SharePoint flaws",
    "url": "https://www.csoonline.com/article/4074962/foreign-hackers-breached-a-us-nuclear-weapons-plant-via-sharepoint-flaws.html",
    "summary": "生成摘要时出错",
    "chinese_title": "Foreign hackers breached a US nuclear weapons plant via SharePoint flaws",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45666719",
    "title": "iPhone 17 Pro Camera Review: Dolomites – Travel Photographer – Austin Mann",
    "url": "https://www.austinmann.com/trek/iphone-17-pro-camera-review-dolomites",
    "summary": "生成摘要时出错",
    "chinese_title": "iPhone 17 Pro Camera Review: Dolomites – Travel Photographer – Austin Mann",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45654512",
    "title": "Diamond Thermal Conductivity: A New Era in Chip Cooling",
    "url": "https://spectrum.ieee.org/diamond-thermal-conductivity",
    "summary": "生成摘要时出错",
    "chinese_title": "Diamond Thermal Conductivity: A New Era in Chip Cooling",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45655263",
    "title": "Ilo – a Forth system running on UEFI",
    "url": "https://asciinema.org/a/Lbxa2w9R5IbaJqW3INqVrbX8E",
    "summary": "生成摘要时出错",
    "chinese_title": "Ilo – a Forth system running on UEFI",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45653143",
    "title": "Language Support for Marginalia Search",
    "url": "https://www.marginalia.nu/log/a_126_multilingual/",
    "summary": "生成摘要时出错",
    "chinese_title": "Language Support for Marginalia Search",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45656223",
    "title": "LLMs can get \"brain rot\"",
    "url": "https://llm-brain-rot.github.io/",
    "summary": "生成摘要时出错",
    "chinese_title": "LLMs can get \"brain rot\"",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45661462",
    "title": "The Gypsy Life of Robert Louis Stevenson",
    "url": "https://hudsonreview.com/2025/10/the-gypsy-life-of-robert-louis-stevenson/",
    "summary": "生成摘要时出错",
    "chinese_title": "The Gypsy Life of Robert Louis Stevenson",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45666719",
    "title": "iPhone 17 Pro Camera Review: Dolomites – Travel Photographer – Austin Mann",
    "url": "https://www.austinmann.com/trek/iphone-17-pro-camera-review-dolomites",
    "summary": "生成摘要时出错",
    "chinese_title": "iPhone 17 Pro Camera Review: Dolomites – Travel Photographer – Austin Mann",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45548125",
    "title": "Understanding conflict resolution and avoidance in PostgreSQL: a complete guide",
    "url": "https://www.pgedge.com/blog/living-on-the-edge",
    "summary": "生成摘要时出错",
    "chinese_title": "Understanding conflict resolution and avoidance in PostgreSQL: a complete guide",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45578016",
    "title": "Weekend projects: Chicken Squisher 3000",
    "url": "https://lcamtuf.substack.com/p/weekend-projects-chicken-squisher",
    "summary": "生成摘要时出错",
    "chinese_title": "Weekend projects: Chicken Squisher 3000",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45669719",
    "title": "Meta Plans to Cut 600 Jobs at A.I. Superintelligence Labs",
    "url": "https://www.nytimes.com/2025/10/22/technology/meta-plans-to-cut-600-jobs-at-ai-superintelligence-labs.html",
    "summary": "生成摘要时出错",
    "chinese_title": "Meta Plans to Cut 600 Jobs at A.I. Superintelligence Labs",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45668036",
    "title": "Is Vibe Coding Dying?",
    "url": "https://garymarcus.substack.com/p/is-vibe-coding-dying",
    "summary": "生成摘要时出错",
    "chinese_title": "Is Vibe Coding Dying?",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45667949",
    "title": "Subprime Lender PrimaLend Enters Bankruptcy After Bond Default",
    "url": "https://www.bloomberg.com/news/articles/2025-10-22/subprime-lender-primalend-enters-bankruptcy-after-bond-default",
    "summary": "生成摘要时出错",
    "chinese_title": "Subprime Lender PrimaLend Enters Bankruptcy After Bond Default",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45621020",
    "title": "Do not accept terms and conditions",
    "url": "https://www.termsandconditions.game/",
    "summary": "生成摘要时出错",
    "chinese_title": "Do not accept terms and conditions",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45664791",
    "title": "Show HN: Run any GitHub Action locally from your Cron job -- finally!",
    "url": "https://docs.dagu.io/features/executors/github-actions#basic-usage",
    "summary": "生成摘要时出错",
    "chinese_title": "Show HN: Run any GitHub Action locally from your Cron job -- finally!",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45575165",
    "title": "South Africa's one million invisible children without birth certificates",
    "url": "https://www.france24.com/en/africa/20250705-south-africa-s-one-million-invisible-children-without-birth-certificates",
    "summary": "生成摘要时出错",
    "chinese_title": "South Africa's one million invisible children without birth certificates",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45633386",
    "title": "Show HN: bbcli – A TUI and CLI to browse BBC News like a hacker",
    "url": "https://github.com/hako/bbcli",
    "summary": "生成摘要时出错",
    "chinese_title": "Show HN: bbcli – A TUI and CLI to browse BBC News like a hacker",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45661084",
    "title": "Doomsday scoreboard",
    "url": "https://doomsday.march1studios.com/",
    "summary": "生成摘要时出错",
    "chinese_title": "Doomsday scoreboard",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45640226",
    "title": "Space Elevator",
    "url": "https://neal.fun/space-elevator/",
    "summary": "生成摘要时出错",
    "chinese_title": "Space Elevator",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45653330",
    "title": "Pasta/80 is a simple Pascal cross compiler targeting the Z80 microprocessor",
    "url": "https://github.com/pleumann/pasta80",
    "summary": "生成摘要时出错",
    "chinese_title": "Pasta/80 is a simple Pascal cross compiler targeting the Z80 microprocessor",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45652307",
    "title": "60k kids have avoided peanut allergies due to 2015 advice, study finds",
    "url": "https://www.cbsnews.com/news/peanut-allergies-60000-kids-avoided-2015-advice/",
    "summary": "生成摘要时出错",
    "chinese_title": "60k kids have avoided peanut allergies due to 2015 advice, study finds",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45621571",
    "title": "Show HN: ASCII Automata",
    "url": "https://hlnet.neocities.org/ascii-automata/",
    "summary": "生成摘要时出错",
    "chinese_title": "Show HN: ASCII Automata",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45654660",
    "title": "StarGrid: A new Palm OS strategy game",
    "url": "https://quarters.captaintouch.com/blog/posts/2025-10-21-stargrid-has-arrived,-a-brand-new-palm-os-strategy-game-in-2025.html",
    "summary": "生成摘要时出错",
    "chinese_title": "StarGrid: A new Palm OS strategy game",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45658019",
    "title": "The Programmer Identity Crisis",
    "url": "https://hojberg.xyz/the-programmer-identity-crisis/",
    "summary": "生成摘要时出错",
    "chinese_title": "The Programmer Identity Crisis",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45652859",
    "title": "Practical Scheme",
    "url": "https://practical-scheme.net/index.html#docs",
    "summary": "生成摘要时出错",
    "chinese_title": "Practical Scheme",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45664431",
    "title": "Show HN: AutoLearn Skills for self-improving agents",
    "url": "https://www.autolearn.dev",
    "summary": "生成摘要时出错",
    "chinese_title": "Show HN: AutoLearn Skills for self-improving agents",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45661112",
    "title": "You Cannot Outsource Understanding",
    "url": "https://russmiles.substack.com/p/you-cannot-outsource-understanding",
    "summary": "生成摘要时出错",
    "chinese_title": "You Cannot Outsource Understanding",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45670827",
    "title": "Meta Cutting 600 AI Jobs to move faster",
    "url": "https://www.bloomberg.com/news/articles/2025-10-22/meta-cutting-roughly-600-ai-jobs-as-company-aims-to-move-faster",
    "summary": "生成摘要时出错",
    "chinese_title": "Meta Cutting 600 AI Jobs to move faster",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45657595",
    "title": "Binary Retrieval-Augmented Reward Mitigates Hallucinations",
    "url": "https://arxiv.org/abs/2510.17733",
    "summary": "生成摘要时出错",
    "chinese_title": "Binary Retrieval-Augmented Reward Mitigates Hallucinations",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45646414",
    "title": "What do we do if SETI is successful?",
    "url": "https://www.universetoday.com/articles/what-do-we-do-if-seti-is-successful",
    "summary": "生成摘要时出错",
    "chinese_title": "What do we do if SETI is successful?",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45657431",
    "title": "Public trust demands open-source voting systems",
    "url": "https://www.voting.works/news/public-trust-demands-open-source-voting-systems",
    "summary": "生成摘要时出错",
    "chinese_title": "Public trust demands open-source voting systems",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45557599",
    "title": "KDE Connect: Enabling communication between all your devices",
    "url": "https://community.kde.org/KDEConnect",
    "summary": "生成摘要时出错",
    "chinese_title": "KDE Connect: Enabling communication between all your devices",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45647133",
    "title": "Peanut allergies have plummeted in children",
    "url": "https://www.nytimes.com/2025/10/20/well/peanut-allergy-drop.html",
    "summary": "生成摘要时出错",
    "chinese_title": "Peanut allergies have plummeted in children",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45671218",
    "title": "Why companies are lying about mass layoffs",
    "url": "https://www.youtube.com/watch?v=VEA7vQKJ8aQ",
    "summary": "生成摘要时出错",
    "chinese_title": "Why companies are lying about mass layoffs",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45556772",
    "title": "Quantum dynamics on your laptop? New technique moves us closer",
    "url": "https://www.buffalo.edu/news/releases/2025/10/quantum-dynamics-on-your-laptop.html",
    "summary": "生成摘要时出错",
    "chinese_title": "Quantum dynamics on your laptop? New technique moves us closer",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45657302",
    "title": "Apple alerts exploit developer that his iPhone was targeted with gov spyware",
    "url": "https://techcrunch.com/2025/10/21/apple-alerts-exploit-developer-that-his-iphone-was-targeted-with-government-spyware/",
    "summary": "生成摘要时出错",
    "chinese_title": "Apple alerts exploit developer that his iPhone was targeted with gov spyware",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45578935",
    "title": "If you'd built a \"tool\" that stupid, why would you advertise the fact?",
    "url": "https://svpow.com/2025/10/13/if-youd-built-a-tool-that-stupid-why-would-you-advertise-the-fact/",
    "summary": "生成摘要时出错",
    "chinese_title": "If you'd built a \"tool\" that stupid, why would you advertise the fact?",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45668254",
    "title": "Workers and Employers Face Higher Health Insurance Costs",
    "url": "https://www.nytimes.com/2025/10/22/health/health-insurance-costs-2025.html",
    "summary": "生成摘要时出错",
    "chinese_title": "Workers and Employers Face Higher Health Insurance Costs",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45640594",
    "title": "DeepSeek OCR",
    "url": "https://github.com/deepseek-ai/DeepSeek-OCR",
    "summary": "生成摘要时出错",
    "chinese_title": "DeepSeek OCR",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45583019",
    "title": "The Salt and Pepper Shaker Museum",
    "url": "https://www.thesaltandpeppershakermuseum.com",
    "summary": "生成摘要时出错",
    "chinese_title": "The Salt and Pepper Shaker Museum",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45668882",
    "title": "Sentence Transformers is joining Hugging Face",
    "url": "https://huggingface.co/blog/sentence-transformers-joins-hf",
    "summary": "生成摘要时出错",
    "chinese_title": "Sentence Transformers is joining Hugging Face",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45632429",
    "title": "A laser pointer at 2B FPS [video]",
    "url": "https://www.youtube.com/watch?v=o4TdHrMi6do",
    "summary": "生成摘要时出错",
    "chinese_title": "A laser pointer at 2B FPS [video]",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45657922",
    "title": "The Greatness of Text Adventures",
    "url": "https://entropicthoughts.com/the-greatness-of-text-adventures",
    "summary": "生成摘要时出错",
    "chinese_title": "The Greatness of Text Adventures",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45668731",
    "title": "Meta overhauls legacy AI operations",
    "url": "https://www.axios.com/2025/10/22/meta-superintelligence-tbd-ai-reorg",
    "summary": "生成摘要时出错",
    "chinese_title": "Meta overhauls legacy AI operations",
    "chinese_summary": "生成摘要时出错"
  }
]