[
  {
    "id": "45742488",
    "title": "Keep Android Open",
    "url": "http://keepandroidopen.org/",
    "summary": "In August 2025, Google announced a new policy set to begin next year that will require all Android developers to register with Google to develop apps for the platform. This registration process will involve paying a fee, agreeing to Google's terms and conditions, providing government identification, uploading proof of the app's signing key, and listing all application identifiers.\n\nThis policy has sparked considerable opposition, with concerns raised about its impact on independent developers, open-source app stores like F-Droid, and the overall freedom of the Android ecosystem. Critics argue that the new requirements will create barriers to entry, stifle innovation, and give Google excessive control over app distribution.\n\nThe \"Keep Android Open\" initiative has emerged to oppose the enactment of this policy. Actions being promoted include signing an open letter to Google, contacting relevant regulatory bodies (e.g., EU Competition Policy, US Department of Justice Antitrust, UK Competition & Markets Authority) in various countries, providing feedback to Google through their Android developer verification survey, and raising awareness on social media. The initiative also encourages collaborative efforts to gather and disseminate more information about the policy and its potential consequences. The provided text includes a comprehensive list of resources including articles, videos, and forum discussions, detailing the negative impacts and potential regulatory challenges associated with the new rules.\n",
    "chinese_title": "保持安卓开放",
    "chinese_summary": "2025年8月，谷歌宣布一项将于明年开始实施的新政策，该政策将要求所有安卓开发者向谷歌注册才能为该平台开发应用。 注册过程将包括支付费用、同意谷歌的条款和条件、提供政府身份证明、上传应用签名密钥的证明以及列出所有应用标识符。\n\n这项政策引发了相当大的反对，人们对其对独立开发者、F-Droid等开源应用商店以及安卓生态系统的整体自由的影响表示担忧。 批评者认为，新的要求将设置准入壁垒，扼杀创新，并使谷歌过度控制应用分发。\n\n“保持安卓开放”倡议应运而生，旨在反对这项政策的实施。 目前推广的行动包括签署致谷歌的公开信、联系各国的相关监管机构（例如，欧盟竞争政策、美国司法部反垄断部门、英国竞争与市场管理局）、通过谷歌的安卓开发者验证调查提供反馈，以及在社交媒体上提高人们的意识。 该倡议还鼓励合作，以收集和传播更多关于该政策及其潜在后果的信息。 提供的信息包括一份全面的资源清单，其中包括文章、视频和论坛讨论，详细说明了新规则的负面影响和潜在的监管挑战。"
  },
  {
    "id": "45748725",
    "title": "Cursor Composer: Building a fast frontier model with RL",
    "url": "https://cursor.com/blog/composer",
    "summary": "Cursor has developed \"Composer,\" a new intelligent agent model designed for speed and intelligence in software engineering. It outperforms similar models in coding tasks, achieving four times faster generation speeds in internal benchmarks. This was achieved by training Composer on a large codebase to handle real-world software engineering tasks, utilizing production-grade search and editing tools.\n\nComposer is a Mixture of Experts (MoE) language model optimized for software engineering through reinforcement learning (RL) in diverse development environments. It learns to efficiently solve problems by producing code modifications, plans, or information using tools like file editing, terminal commands, and code base semantic searches.\n\nCursor developed a realistic benchmark, Cursor Bench, based on actual agent requests from their engineers to measure progress. The benchmark assesses correctness and adherence to existing code abstractions and software engineering practices. RL is used to specifically optimize the model for efficient software engineering.\n\nThe model is trained to make efficient tool selections and maximize parallel processing. It also learns to avoid unnecessary responses and unfounded statements. Furthermore, it spontaneously acquires abilities such as complex searching, fixing linter errors, and writing unit tests during RL training.\n\nCursor built a custom training infrastructure using PyTorch and Ray, combining MXFP8 MoE kernels with expert and data parallelism to train the model efficiently on thousands of NVIDIA GPUs with low communication overhead. This allows for faster inference without post-training quantization. The training environment leverages Cursor's existing Background Agents infrastructure to run hundreds of thousands of isolated sandboxed coding environments in the cloud.\n\nThe goal is to create an intelligent agent that Cursor's own engineers can rely on daily. Early adoption within Cursor has proven valuable, and they hope to extend that value to their users.\n",
    "chinese_title": "光标作曲家：用强化学习构建快速前沿模型",
    "chinese_summary": "Cursor开发了“Composer”，一款专为软件工程的速度和智能而设计的新型智能代理模型。在内部基准测试中，它在编码任务上的表现优于同类模型，生成速度快四倍。这归功于Composer在大型代码库上进行训练，以处理实际的软件工程任务，并利用生产级别的搜索和编辑工具。\n\nComposer是一个混合专家（MoE）语言模型，通过强化学习（RL）在不同的开发环境中进行优化，专用于软件工程。它通过使用文件编辑、终端命令和代码库语义搜索等工具生成代码修改、计划或信息来高效地解决问题。\n\nCursor开发了一个基于其工程师的实际代理请求的真实基准测试Cursor Bench，以衡量进展。该基准测试评估了正确性以及对现有代码抽象和软件工程实践的遵守情况。强化学习（RL）专门用于优化模型，以提高软件工程效率。\n\n该模型经过训练，可以进行高效的工具选择并最大化并行处理。它还学会避免不必要的响应和没有根据的陈述。此外，它还在强化学习（RL）训练期间自发地获得诸如复杂搜索、修复linter错误和编写单元测试等能力。\n\nCursor使用PyTorch和Ray构建了一个自定义的训练基础设施，将MXFP8 MoE内核与专家和数据并行性相结合，以在数千个NVIDIA GPU上高效地训练模型，且通信开销低。这允许更快的推理，无需训练后量化。训练环境利用Cursor现有的Background Agents基础设施，在云中运行数十万个隔离的沙盒编码环境。\n\n目标是创建一个Cursor自己的工程师可以每天依赖的智能代理。在Cursor内部的早期采用已被证明是有价值的，他们希望将该价值扩展到他们的用户。"
  },
  {
    "id": "45749017",
    "title": "Tailscale Peer Relays",
    "url": "https://tailscale.com/blog/peer-relays-beta",
    "summary": "Tailscale has announced the public beta release of Tailscale Peer Relays, a customer-managed alternative to Tailscale's DERP servers for relaying network traffic within a tailnet. Unlike DERP, which prioritizes reliability and NAT traversal, Peer Relays are designed for high-performance connectivity, rivaling direct connections in speed and efficiency.\n\nPeer Relays address the limitations of DERP in environments where throughput is critical, such as cloud infrastructure behind strict firewalls or NAT gateways. They enable customers to deploy relay nodes close to resources, using UDP for lower latency. They are also integrated directly into the Tailscale client, simplifying deployment.\n\nAdministrators enable Peer Relays with a simple CLI command, configuring a single UDP port accessible to both connecting nodes. Tailscale still prioritizes direct connections, falling back to Peer Relays and then DERP. This enables a flexible networking topology while maintaining end-to-end encryption through WireGuard.\n\nBenefits include high-throughput connections through cloud NATs, predictable access paths through network firewalls, reduced reliance on DERP, and easier access to locked-down customer networks. Tailscale's Peer Relays aim to offer the best performance and flexibility for customers who need to scale Tailscale usage within various network environments. Tailscale offers two peer relays for free on all plans.\n",
    "chinese_title": "Tailscale 对等节点中继",
    "chinese_summary": "Tailscale 发布 Tailscale Peer Relays 公开测试版，这是客户管理的替代方案，用于替代 Tailscale 的 DERP 服务器，以便在 tailnet 内中继网络流量。与优先考虑可靠性和 NAT 穿透的 DERP 不同，Peer Relays 专为高性能连接而设计，在速度和效率上可与直接连接相媲美。\n\nPeer Relays 解决了 DERP 在吞吐量至关重要的环境中的局限性，例如位于严格防火墙或 NAT 网关之后的云基础设施。它们使客户能够部署靠近资源的转发节点，并使用 UDP 来降低延迟。它们还直接集成到 Tailscale 客户端中，从而简化了部署。\n\n管理员可以使用简单的 CLI 命令启用 Peer Relays，配置一个可供连接节点访问的 UDP 端口。Tailscale 仍然优先考虑直接连接，然后回退到 Peer Relays，再回退到 DERP。这实现了一种灵活的网络拓扑，同时通过 WireGuard 保持端到端加密。\n\n其优势包括通过云 NAT 的高吞吐量连接、通过网络防火墙的可预测访问路径、减少对 DERP 的依赖以及更轻松地访问锁定客户网络。Tailscale 的 Peer Relays 旨在为需要在各种网络环境中扩展 Tailscale 使用量的客户提供最佳性能和灵活性。Tailscale 在所有计划中免费提供两个 peer relays。"
  },
  {
    "id": "45747112",
    "title": "I made a 10¢ MCU Talk",
    "url": "https://www.atomic14.com/2025/10/29/CH32V003-talking",
    "summary": "This blog post details the author's successful attempt to make a $0.10 microcontroller (MCU), specifically the CH32V003, \"talk\" using its limited 16KB of flash memory. The author achieved this through two primary methods: compressed audio playback and LPC speech synthesis.\n\nFirst, the author explores playing a 6-second audio clip using the MCU's PWM output as a rudimentary DAC. Due to the memory limitations, aggressive audio compression was necessary. The author ultimately chose 2-bit ADPCM, achieving a 4:1 compression ratio and reducing the audio clip to under 12KB, fitting within the flash memory. A custom tool was created to convert WAV files to this format.\n\nSecond, for longer phrases and speech, the author implemented LPC (Linear Predictive Coding) speech synthesis using the Talkie library, based on the Texas Instruments TMS5220/5100 architecture (think Speak & Spell). LPC allows for compact storage of speech data by modeling the human voice. A streamlined online tool was created to convert recordings of the author's voice into LPC data for playback.\n\nThe author highlights the impressive capabilities of even these ultra-cheap MCUs, demonstrating that complex audio functionalities like compressed audio and speech synthesis can be achieved within severely constrained memory environments. The code for the project is available on GitHub, and a video demo showcases the results.\n",
    "chinese_title": "我做了一个十分钱的MCU演讲",
    "chinese_summary": "作者成功使用16KB闪存使0.1美元的单片机(MCU)，特别是CH32V003，“说话”的尝试。他主要通过两种方法实现了这一点：压缩音频播放和LPC语音合成。\n\n首先，作者探索了使用MCU的PWM输出作为简易DAC播放一段6秒的音频片段。由于内存限制，必须进行激进的音频压缩。作者最终选择了2-bit ADPCM，实现了4:1的压缩比，并将音频片段缩小到12KB以下，使其能够装入闪存。为此，作者还创建了一个自定义工具，用于将WAV文件转换为这种格式。\n\n其次，对于更长的短语和语音，作者基于德州仪器TMS5220/5100架构（想想Speak & Spell），使用Talkie库实现了LPC（线性预测编码）语音合成。LPC通过对人声建模，可以紧凑地存储语音数据。作者还创建了一个简化的在线工具，用于将作者本人的录音转换为LPC数据进行播放。\n\n作者强调了即使是这些超低成本MCU的强大功能，证明了在受到严重限制的内存环境中也可以实现诸如压缩音频和语音合成等复杂的音频功能。该项目的代码已在GitHub上提供，并且有一个视频演示展示了结果。"
  },
  {
    "id": "45749019",
    "title": "Floss Before Brushing",
    "url": "https://alearningaday.blog/2025/10/29/floss-before-brushing/",
    "summary": "This article challenges the commonly held belief that brushing teeth should precede flossing. The author recounts a conversation with a dental hygienist who advised switching the order to floss first, followed by brushing. Initially skeptical, the author came to understand the rationale behind this recommendation.\n\nFlossing before brushing loosens and removes food particles and plaque from between the teeth, areas a toothbrush can't effectively reach. This pre-emptive cleaning then allows the fluoride in toothpaste to access and protect more tooth surfaces during brushing. The author found this logic compelling and points to supporting studies.\n\nThe article highlights three key takeaways: firstly, habits can always be improved, even long-standing ones. Secondly, the act of flossing itself is paramount, regardless of the order, so making flossing a regular habit is crucial. And finally, if flossing is already a habit, switching to flossing before brushing provides an optimal benefit for dental hygiene.\n",
    "chinese_title": "刷牙前用牙线",
    "chinese_summary": "本文挑战了一种普遍的观念，即刷牙应该先于用牙线。作者叙述了与一位牙科保健师的对话，后者建议将顺序改为先用牙线，然后刷牙。起初作者对此持怀疑态度，但后来逐渐理解了这一建议背后的原理。\n\n先用牙线可以松动并清除牙齿之间的食物残渣和牙菌斑，这些区域是牙刷无法有效触及的。这种预防性的清洁使得牙膏中的氟化物在刷牙时能够接触并保护更多的牙齿表面。作者发现这个逻辑令人信服，并指出了支持性的研究。\n\n本文强调了三个关键要点：首先，习惯总是可以改进的，即使是长期存在的习惯。其次，使用牙线的行为本身至关重要，无论顺序如何，因此养成定期使用牙线的习惯至关重要。最后，如果使用牙线已经成为一种习惯，那么改为先用牙线再刷牙可以为口腔卫生带来最佳益处。"
  },
  {
    "id": "45749690",
    "title": "Does brand advertising work? Upwave (YC S12) is hiring engineers to answer that",
    "url": "https://www.upwave.com/job/8228849002/",
    "summary": "Upwave, a brand outcomes measurement platform backed by Y Combinator and other leading investors, is hiring a Senior Software Engineer to build and scale its AI-driven platform. The platform helps leading advertisers measure and optimize their brand campaigns across various channels, processing billions of ad impressions to deliver insights that inform multi-million dollar marketing decisions.\n\nThe Senior Software Engineer will be a full-stack problem solver with a backend focus, contributing to the development of APIs, data pipelines, and systems that power the platform. Key responsibilities include integrating LLMs for AI-powered customer experiences, designing scalable backend systems, building and operating data pipelines at scale, and improving system reliability and performance.\n\nThe ideal candidate has 5+ years of experience, is comfortable across the full stack, and understands modern UI frameworks, API architectures, databases, and cloud platforms. Experience with modern AI-powered development tools and structured software development practices is highly valued. Bonus points for experience with Java/Kotlin/Groovy, MySQL/DynamoDB/Presto, AWS/Kubernetes/Terraform, and AdTech/MarTech.\n\nUpwave offers a remote-first, engineering-first environment with a modern tech stack. The company emphasizes autonomy, ownership, and a collaborative culture. The role offers a base salary range of $150,000 - $175,000 + bonus + equity + benefits.\n",
    "chinese_title": "品牌广告有效吗？Upwave (YC S12) 正在招聘工程师来解答这个问题。",
    "chinese_summary": "Upwave诚聘高级软件工程师，构建并扩展其人工智能驱动平台。Upwave是一家品牌效果衡量平台，获得Y Combinator和其他领先投资者的支持。该平台帮助领先广告商衡量和优化其跨渠道的品牌活动，处理数十亿次的广告展示，以提供洞察力，为数百万美元的营销决策提供信息。\n\n高级软件工程师将是一位具备后端经验的全栈问题解决者，负责开发API、数据管道和驱动平台的系统。主要职责包括集成LLM以实现人工智能驱动的客户体验，设计可扩展的后端系统，构建和运营大规模数据管道，并提高系统的可靠性和性能。\n\n理想的候选人应具有5年以上经验，熟悉全栈技术，并了解现代UI框架、API架构、数据库和云平台。拥有现代人工智能驱动的开发工具和结构化软件开发实践经验者优先考虑。具备Java/Kotlin/Groovy、MySQL/DynamoDB/Presto、AWS/Kubernetes/Terraform以及广告技术/营销技术经验者优先。\n\nUpwave提供远程优先、工程师优先的环境，并采用现代技术栈。公司强调自主性、所有权和协作文化。该职位提供15万美元至17.5万美元的基本工资范围+奖金+股权+福利。"
  },
  {
    "id": "45697234",
    "title": "Beyond RaspberryPi: What are all the other SoC vendors up to *summarised*",
    "url": "https://sbcwiki.com/news/articles/state-of-embedded-q4-25/",
    "summary": "Here's a summary of the State of Embedded: Q4 2025 Overview article:\n\nThe ARM-based SBC market continues to thrive, presenting strong competition to x86 platforms. Key developments include NVIDIA's release of the DGX Spark powered by the GB10 Grace Blackwell Superchip, although Jetson support was dropped. Qualcomm made significant strides with the launch of the Snapdragon Oryon X2, hitting 5GHz. Radxa introduced the Dragon Q6A SBC with mainline support at an affordable price, and Qualcomm acquired Arduino, introducing SBCs to that ecosystem with the Arduino UNO Q.\n\nRockchip unveiled roadmaps for the RK3688 and RK3668 SoCs, featuring next-gen Arm Mali Magni GPUs and impressive performance specs. Kernel updates are continuing while active PanVK Vulkan development is being done for the Mali G610. MediaTek focused on software support for its Genio and Kompanio lines, with Libre Computer and Radxa working on new boards. The Dimensity 9500 flagship mobile SoC also made an appearance reaching great Geekbench results.\n\nCIX saw increased product availability with the Radxa Orion-O6N and OrangePi 6 Plus, alongside progress on mainline device-tree support. Raspberry Pi introduced the 500+ desktop computer. Texas Instruments maintained its focus on automotive applications, while Imagination Technologies made driver updates. DENX, known for U-Boot, is winding down operations. Synaptics is releasing a new SBC with Toradex, featuring the Astra SL1680 SoC. AI NPUs are getting more affordable and accessible.\n",
    "chinese_title": "树莓派之外：其他SoC厂商在做什么 *概要*",
    "chinese_summary": "嵌入式状态：2025年第四季度概览文章摘要：\n\n基于ARM的SBC市场持续繁荣，对x86平台构成强劲竞争。主要进展包括英伟达发布了由GB10 Grace Blackwell Superchip驱动的DGX Spark，但停止了对Jetson的支持。高通凭借Snapdragon Oryon X2的发布取得了显著进展，频率达到5GHz。瑞莎推出了具有主线支持且价格合理的Dragon Q6A SBC，高通收购了Arduino，将SBC引入了Arduino生态系统，推出了Arduino UNO Q。\n\n瑞芯微公布了RK3688和RK3668 SoC的路线图，其特点是下一代Arm Mali Magni GPU和令人印象深刻的性能规格。内核更新持续进行，同时正在为Mali G610积极进行PanVK Vulkan开发。联发科专注于其Genio和Kompanio系列的软件支持，Libre Computer和瑞莎正在开发新的板卡。Dimensity 9500旗舰移动SoC也亮相，获得了出色的Geekbench结果。\n\nCIX的产品可用性有所提高，Radxa Orion-O6N和OrangePi 6 Plus相继上市，同时主线设备树支持方面也取得了进展。树莓派推出了500+桌面电脑。德州仪器继续专注于汽车应用，而Imagination Technologies则进行了驱动程序更新。以U-Boot闻名的DENX正在逐步结束运营。新思科技将与Toradex合作发布一款新的SBC，采用Astra SL1680 SoC。AI NPU正变得越来越经济实惠和容易获得。"
  },
  {
    "id": "45747804",
    "title": "Collins Aerospace: Sending text messages to the cockpit with test:test",
    "url": "https://www.ccc.de/en/disclosure/collins-aerospace-mit-test-test-textnachrichten-bis-ins-cockpit-senden",
    "summary": "A security vulnerability was discovered in Collins Aerospace's ARINC OpCenter Message Browser, a system used to send text messages to aircraft cockpits. Researchers were able to log in using the easily guessable credentials \"test:test\" and gain access as U.S. Navy Fleet Logistics Support Wing. This access allowed them to view sent messages and, critically, the capability to send new text messages to cockpits. The researchers, for ethical reasons, refrained from sending any messages.\n\nThe vulnerability was reported to RTX Corporation (Collins Aerospace's parent company) but reportedly received no response. Subsequently, the vulnerable account was disabled. The Department of Defense Cyber Crime Center was also informed about the vulnerability on September 21, 2025. The easily compromised login credentials represent a significant security risk, potentially allowing unauthorized parties to send misleading or disruptive messages to aircraft pilots.\n",
    "chinese_title": "柯林斯宇航：向驾驶舱发送文本消息，测试：测试",
    "chinese_summary": "柯林斯宇航ARINC OpCenter消息浏览器发现安全漏洞。该系统用于向飞机驾驶舱发送文本消息。研究人员能够使用容易猜测的凭据“test:test”登录，并获得美国海军舰队后勤支援机翼的访问权限。此访问权限允许他们查看已发送的消息，并且关键的是，能够向驾驶舱发送新的文本消息。出于道德原因，研究人员没有发送任何消息。\n\n该漏洞已报告给RTX公司（柯林斯宇航的母公司），但据报道未收到任何回应。随后，该存在漏洞的帐户被禁用。国防部网络犯罪中心也于2025年9月21日获悉了该漏洞。 这种容易被攻破的登录凭据代表着重大的安全风险，可能会允许未经授权的方发送具有误导性或破坏性的消息给飞机飞行员。"
  },
  {
    "id": "45671677",
    "title": "Eye prosthesis is the first to restore sight lost to macular degeneration",
    "url": "https://med.stanford.edu/news/all-news/2025/10/eye-prosthesis.html",
    "summary": "A new eye prosthesis, PRIMA, has shown promise in restoring functional vision to individuals with advanced age-related macular degeneration (geographic atrophy), a leading cause of irreversible blindness. Developed at Stanford Medicine, the device consists of a wireless chip implanted in the eye and high-tech glasses. The glasses capture images and project them as infrared light onto the chip, which converts them into electrical stimulation, replacing the function of damaged photoreceptors.\n\nIn a clinical trial, 27 out of 32 participants regained the ability to read within a year of receiving the implant. With digital enhancements like zoom and contrast adjustments, some achieved acuity equivalent to 20/42 vision. Unlike previous prosthetic devices that only offered light sensitivity, PRIMA provides form vision, allowing patients to perceive shapes and patterns.\n\nThe device utilizes the patient's remaining peripheral vision in conjunction with the prosthetic central vision. The chip is photovoltaic, operating wirelessly and implanted under the retina. While the current version provides black-and-white vision, future software updates will enable grayscale for improved face recognition. Researchers are also developing higher-resolution chips with smaller pixels for potentially achieving 20/80 vision, with the possibility of near 20/20 with electronic zoom. Although some participants experienced side effects, they were generally not life-threatening and resolved quickly.\n",
    "chinese_title": "眼部义眼首次用于恢复黄斑变性导致的视力丧失",
    "chinese_summary": "新型眼部假体PRIMA有望恢复晚期年龄相关性黄斑变性（地图样萎缩）患者的功能性视力，该疾病是导致不可逆失明的主要原因之一。该设备由斯坦福大学医学院开发，由植入眼部的无线芯片和高科技眼镜组成。眼镜捕捉图像并将它们以红外光的形式投射到芯片上，芯片将它们转换为电刺激，从而取代受损感光细胞的功能。\n\n在一项临床试验中，32名参与者中有27名在接受植入后一年内恢复了阅读能力。通过缩放和对比度调整等数字增强功能，一些人达到了相当于20/42的视力敏锐度。与之前仅提供光敏感度的假体设备不同，PRIMA提供形态视觉，使患者能够感知形状和图案。\n\n该设备结合患者剩余的周边视觉和假体的中心视觉。该芯片是光伏的，无线工作并植入在视网膜下。虽然当前版本提供黑白视觉，但未来的软件更新将启用灰度以改善面部识别。研究人员还在开发具有更小像素的更高分辨率芯片，以期达到20/80的视力，并有可能通过电子变焦达到接近20/20的视力。虽然一些参与者经历了副作用，但通常不危及生命且很快消退。"
  },
  {
    "id": "45746478",
    "title": "From VS Code to Helix",
    "url": "https://ergaster.org/posts/2025/10/29-vscode-to-helix/",
    "summary": "This article details the author's journey from using VS Code to Helix as their daily driver editor. Initially hesitant due to VS Code's ease of use and familiarity, and vim's complexity, the author was swayed by Helix's \"out-of-the-box\" functionality and intuitive select-then-operate workflow.\n\nThe author's shift was motivated by concerns over Microsoft's control and the desire for more balanced, international open-source tools. While fearing a steep learning curve, they found Helix surprisingly easy to adopt, particularly due to its interactive tutorial.\n\nThe article highlights the importance of proper documentation, praising a third-party resource for its user-centric approach. A significant portion is dedicated to configuring Helix for Markdown, Astro, and YAML, including installing and configuring language servers (marksman, harper-ls, rumdl, astro-ls, yaml-language-server) and formatters (dprint). The author provides specific instructions for integrating these tools, enabling features like code completion, grammar checking, and automatic formatting.\n\nThe author also addresses a UI issue with text alignment on wide screens and presents a workaround involving adjusting gutter width using custom keybindings. Finally, the article concludes that while Helix requires a bit more initial configuration than VS Code, the benefits of efficient editing, a more balanced toolchain, and deeper understanding of the editor's functionality make it worthwhile.\n",
    "chinese_title": "从 VS Code 到 Helix",
    "chinese_summary": "本文详细介绍了作者从使用 VS Code 过渡到以 Helix 作为日常主要编辑器的过程。起初，由于 VS Code 的易用性和熟悉程度，以及 Vim 的复杂性，作者对此犹豫不决，但 Helix 的“开箱即用”功能和直观的选择-然后-操作工作流程最终打动了作者。\n\n作者的转变是出于对微软控制权的担忧以及对更平衡的国际化开源工具的渴望。尽管担心学习曲线陡峭，但他们发现 Helix 出乎意料地容易上手，尤其要归功于它的交互式教程。\n\n本文强调了适当文档的重要性，并赞扬了一个第三方资源以用户为中心的编写方式。文章的很大一部分致力于配置 Helix 以支持 Markdown、Astro 和 YAML，包括安装和配置语言服务器（marksman、harper-ls、rumdl、astro-ls、yaml-language-server）和格式化工具（dprint）。作者提供了集成这些工具的具体说明，从而实现诸如代码完成、语法检查和自动格式化等功能。\n\n作者还解决了宽屏上文本对齐的 UI 问题，并提出了一种通过使用自定义键绑定调整装订线宽度来解决此问题的方法。最后，文章总结说，虽然 Helix 比 VS Code 需要更多的初始配置，但高效编辑、更平衡的工具链以及对编辑器功能的更深入了解使其值得。"
  },
  {
    "id": "45746726",
    "title": "Recreating a Homebrew Game System from 1987",
    "url": "https://alex-j-lowry.github.io/z80tvg.html",
    "summary": "This article details a homebrew 8-bit game console called the Z80 TV Game, developed in 1987 by a Japanese electronics hobbyist. It uses a 4MHz Z80 processor, 32KB ROM cartridges (expandable via bank switching), 16KB of system ROM, 8KB of video RAM, and outputs 168x210 pixel black/white graphics at 60Hz composite video. Audio is 1-bit.\n\nThe system utilizes readily available ICs, with the controller input and audio output managed by either an Intel 8255 or Zilog Z80PIO. It supports Sega Master System and Mega Drive/Genesis controllers. The composite sync signal is generated using an EPROM.\n\nThe memory map includes cartridge ROM, system RAM, video RAM, and unused space. I/O maps differ slightly depending on whether the 8255 or Z80PIO is used.\n\nThe article provides resources for recreating the system, including schematics, PCB gerbers, KiCad files, and a bill of materials for the console and various cartridge designs (32KB, multi-cart, and experimental 256KB). Original schematics, game ROMs (26 games developed by Mr. Isizu and Inufuto), and cartridge dimensions are also available.\n\nSoftware development can be done in Z80 assembly or C, with support from the Z88DK development kit, Cate compiler by Inufuto, and Cross-Lib framework. Emulators eZ80TVGAME and vdmgr also exist. The author acknowledges the contributions of Mr. Isizu, Inufuto, Takeda Toshiya and lsluk.\n",
    "chinese_title": "重建1987年的自制游戏系统",
    "chinese_summary": "本文详细介绍了一款名为 Z80 TV Game 的自制 8 位游戏机，该游戏机由一位日本电子爱好者于 1987 年开发。它采用 4MHz Z80 处理器、32KB ROM 卡带（可通过分页切换扩展）、16KB 系统 ROM、8KB 视频 RAM，并以 60Hz 复合视频输出 168x210 像素的黑白图形。音频为 1 位。\n\n该系统利用现成的 IC，控制器输入和音频输出由 Intel 8255 或 Zilog Z80PIO 管理。它支持世嘉 Master System 和 Mega Drive/Genesis 手柄。复合同步信号使用 EPROM 生成。\n\n内存映射包括卡带 ROM、系统 RAM、视频 RAM 和未使用的空间。I/O 映射因使用 8255 或 Z80PIO 而略有不同。\n\n本文提供了用于重建系统的资源，包括原理图、PCB Gerber 文件、KiCad 文件以及控制台和各种卡带设计（32KB、多合一卡带和实验性 256KB）的物料清单。原始原理图、游戏 ROM（由 Isizu 先生和 Inufuto 开发的 26 款游戏）以及卡带尺寸也均可用。\n\n软件开发可以使用 Z80 汇编或 C 语言完成，并获得 Z88DK 开发套件、Inufuto 的 Cate 编译器和 Cross-Lib 框架的支持。还存在模拟器 eZ80TVGAME 和 vdmgr。作者感谢 Isizu 先生、Inufuto、Takeda Toshiya 和 lsluk 的贡献。"
  },
  {
    "id": "45742907",
    "title": "Who needs Graphviz when you can build it yourself?",
    "url": "https://spidermonkey.dev/blog/2025/10/28/iongraph-web.html",
    "summary": "This article details the development of a custom graph layout algorithm, \"iongraph,\" created to visualize the compilation process of JavaScript and WebAssembly code within SpiderMonkey's Ion optimizing compiler. Dissatisfied with the output of existing tools like Graphviz and Mermaid, the author sought a solution tailored to the specific needs and constraints of control flow graphs.\n\nThe article highlights the problems with Graphviz, including its unpredictable layouts that obscure code structure and instability where minor changes produce drastically different visualizations. Iongraph leverages the unique characteristics of control flow graphs (few cycles, reducible control flow) to create more intuitive and stable layouts.\n\nThe algorithm is based on a simplified version of the Sugiyama layout algorithm, broken down into four main steps:\n\n1.  **Layering:** Organizes basic blocks into horizontal tracks (layers) based on their depth, handling loop structures to position blocks logically inside or outside of loops.\n2.  **Create Dummy Nodes:** Inserts dummy nodes on edges that span multiple layers, maintaining consistent directional flow (downward on the left, upward on the right) and coalescing edges to the same destination.\n3.  **Straighten Edges:** Applies iterative passes to align nodes and dummy nodes, improving edge straightness and overall visual clarity, including loop indentation and edge \"combing.\"\n4.  **Track Horizontal Edges:** Sorts horizontal edges into parallel tracks to prevent visual overlap, assigning vertical offsets and recording track heights for proper spacing.\n\nThe result is a fast, efficient, and surprisingly effective layout algorithm that produces stable and informative visualizations of the compiler's internal processes, implemented in roughly 1000 lines of JavaScript. The article also includes interactive demos and pseudocode for key parts of the algorithm.\n",
    "chinese_title": "谁还需要Graphviz，自己就能建一个了？",
    "chinese_summary": "本文详细介绍了自定义图布局算法“iongraph”的开发过程，该算法旨在可视化SpiderMonkey的Ion优化编译器中JavaScript和WebAssembly代码的编译过程。作者对Graphviz和Mermaid等现有工具的输出不满意，因此寻求一种针对控制流图的特定需求和约束而量身定制的解决方案。\n\n文章强调了Graphviz的问题，包括其不可预测的布局会模糊代码结构，以及微小的更改会导致截然不同的可视化效果的不稳定性。 Iongraph利用控制流图的独特特征（循环少，可归约控制流）来创建更直观和稳定的布局。\n\n该算法基于简化版的Sugiyama布局算法，分为四个主要步骤：\n\n1.  **分层：** 根据基本块的深度将它们组织成水平轨道（层），处理循环结构以在循环内部或外部逻辑地定位块。\n2.  **创建虚拟节点：** 在跨越多个层的边上插入虚拟节点，保持一致的定向流（左侧向下，右侧向上），并合并到相同目的地的边。\n3.  **拉直边：** 应用迭代过程来对齐节点和虚拟节点，从而提高边的平直度和整体视觉清晰度，包括循环缩进和边“梳理”。\n4.  **追踪水平边：** 将水平边排序到平行轨道中，以防止视觉重叠，分配垂直偏移量并记录轨道高度以实现适当的间距。\n\n结果是一种快速、高效且出人意料的有效布局算法，可生成编译器内部进程的稳定且信息丰富的可视化效果，以大约1000行JavaScript实现。文章还包括交互式演示和算法关键部分的伪代码。"
  },
  {
    "id": "45748186",
    "title": "Hosting SQLite Databases on GitHub Pages (2021)",
    "url": "https://phiresky.github.io/blog/2021/hosting-sqlite-databases-on-github-pages/",
    "summary": "This article by phiresky (2021) explores hosting SQLite databases on static websites like GitHub Pages, circumventing the need for backend servers for small data-driven web tools. The problem addressed is the maintenance burden and reliance on external services associated with traditional backend approaches, or the inefficiency of downloading large datasets to the browser.\n\nThe solution involves compiling SQLite to WebAssembly (using sql.js) and creating a virtual file system (sql.js-httpvfs) that fetches database chunks via HTTP Range requests as needed. This allows the browser to query a full SQLite database without downloading the entire file upfront, optimizing for bandwidth and request overhead by using SQLite's page structure and pre-fetching sequential data.\n\nThe article demonstrates the solution with a demo using the World Development Indicators dataset, showing SQL queries, JSON functions, and JavaScript function integration within queries. It also illustrates performance considerations, emphasizing the importance of database indexing to minimize HTTP requests. The author demonstrates full-text search capabilities using SQLite's FTS module and provides an interactive example of charting data from the database. Furthermore, it showcases using the browser's DOM as a database through a virtual table.\n\nA 2023 update highlights advancements inspired by this work, including libgen-ipfs, absurd-sql (using IndexedDB as a persistent store), and SQLite's official wasm support.\n",
    "chinese_title": "在GitHub Pages上托管SQLite数据库（2021年）",
    "chinese_summary": "phiresky (2021) 的这篇文章探讨了在 GitHub Pages 等静态网站上托管 SQLite 数据库的方法，从而规避了小型数据驱动型 Web 工具对后端服务器的需求。它所解决的问题是传统后端方法带来的维护负担和对外部服务的依赖，以及将大型数据集下载到浏览器的低效率。\n\n该解决方案包括将 SQLite 编译为 WebAssembly（使用 sql.js）并创建一个虚拟文件系统 (sql.js-httpvfs)，该文件系统根据需要通过 HTTP Range 请求获取数据库块。 这使得浏览器可以在无需预先下载整个文件的情况下查询完整的 SQLite 数据库，通过使用 SQLite 的页面结构和预取顺序数据来优化带宽和请求开销。\n\n文章通过使用世界发展指标数据集的演示来展示该解决方案，展示了 SQL 查询、JSON 函数和 JavaScript 函数在查询中的集成。它还说明了性能方面的考虑因素，强调了数据库索引对于最大限度地减少 HTTP 请求的重要性。作者演示了使用 SQLite 的 FTS 模块进行全文搜索的功能，并提供了从数据库中绘制数据的交互式示例。 此外，它还展示了如何通过虚拟表将浏览器的 DOM 用作数据库。\n\n2023 年的更新突出了受此工作启发而取得的进展，包括 libgen-ipfs、absurd-sql（使用 IndexedDB 作为持久存储）和 SQLite 的官方 wasm 支持。"
  },
  {
    "id": "45745281",
    "title": "AWS to bare metal two years later: Answering your questions about leaving AWS",
    "url": "https://oneuptime.com/blog/post/2025-10-29-aws-to-bare-metal-two-years-later/view",
    "summary": "In 2023, OneUptime detailed how they saved $230,000/year by moving from AWS to bare metal. This follow-up addresses common questions and shares updates two years later. Key highlights include:\n\n*   **Increased Savings:** Savings have grown to $1.2M/year.\n*   **Financial Justification:** Reserved Instances/Savings Plans weren't enough to beat bare metal due to S3, egress, and other costs. A 76% saving compared to AWS.\n*   **Migration Cost:** One week of engineer time was required, but much of it was for improvements needed anyway.\n*   **Ongoing Ops:** Minimal engineer time (24 hours/quarter) due to automation and reliance on colo provider for physical management.\n*   **Resilience:** They now have multiple racks across two DCs with isolated management paths and Anycast ingress for sub-minute failover, improving on their single-rack setup.\n*   **Hardware Lifecycle:** Servers are amortized over five years, with plans to cascade older gear to regional analytics as needed.\n*   **No Reinventing:** They leverage open-source tools (MicroK8s, Ceph, etc.) that align with their product's self-hosting promise.\n*   **Selective Cloud Use:** Still using AWS for Glacier, CloudFront, and burst capacity load tests.\n*   **Bandwidth and DDoS:** Committed to 5 Gbps across carriers and use Cloudflare for DDoS protection.\n*   **Reliability:** Availability has improved to 99.993%.\n*   **Compliance:** Maintained SOC 2 and ISO 27001, adapting processes for physical controls and change management.\n*   **Alternative Cloud Providers:** Evaluated other providers but colocation was more cost-effective for their steady-state footprint.\n*   **Toil:** Similar toil levels compared to AWS, but focused on different tasks (patching, upgrades).\n\nThey recommend bare metal for stable, high-volume workloads but acknowledge cloud's benefits for elasticity and managed services. Future plans include publishing a colo capex forecasting tool and a Talos deep dive.\n",
    "chinese_title": "AWS两年后迁移到裸金属：解答您关于离开AWS的问题",
    "chinese_summary": "2023年，OneUptime详述了他们通过从AWS迁移到裸金属服务器，每年节省23万美元的案例。本篇后续文章解答了常见问题，并分享了两年后的更新。主要亮点包括：\n\n*   **节省增加：** 节省已增长至每年120万美元。\n*   **财务依据：** 由于S3、出口流量和其他成本，预留实例/节省计划不足以击败裸金属服务器。与AWS相比，节省了76%。\n*   **迁移成本：** 需要一周的工程师时间，但其中大部分是为了进行无论如何都需要的改进。\n*   **持续运营：** 由于自动化和依赖主机托管提供商进行物理管理，工程师所需时间极少（每季度24小时）。\n*   **弹性：** 他们现在在两个数据中心拥有多个机架，具有隔离的管理路径和任播入口，可在不到一分钟内实现故障转移，这比他们之前的单机架设置有所改进。\n*   **硬件生命周期：** 服务器按五年摊销，并计划根据需要在区域分析中级联旧设备。\n*   **无需重复发明：** 他们利用与产品自托管承诺一致的开源工具（MicroK8s、Ceph等）。\n*   **选择性云使用：** 仍然使用AWS Glacier、CloudFront和突发容量负载测试。\n*   **带宽和DDoS：** 承诺跨运营商提供5 Gbps带宽，并使用Cloudflare进行DDoS保护。\n*   **可靠性：** 可用性已提高到99.993%。\n*   **合规性：** 保持了SOC 2和ISO 27001，调整了物理控制和变更管理流程。\n*   **替代云提供商：** 评估了其他提供商，但对于他们的稳态占用空间而言，主机托管更具成本效益。\n*   **苦工：** 与AWS相比，苦工程度相似，但专注于不同的任务（打补丁、升级）。\n\n他们建议对稳定、高容量的工作负载使用裸金属服务器，但也承认云在弹性和托管服务方面的优势。未来的计划包括发布一个主机托管资本支出预测工具和一个Talos深度分析。"
  },
  {
    "id": "45702397",
    "title": "ChatGPT's Atlas: The Browser That's Anti-Web",
    "url": "https://www.anildash.com//2025/10/22/atlas-anti-web-browser/",
    "summary": "This article critiques OpenAI's new browser, Atlas, arguing it's \"anti-web\" because it prioritizes AI-generated content over direct access to websites and the traditional web experience. The author identifies three main problems:\n\n1. **AI Substitution:** Atlas substitutes AI-generated content resembling web pages for actual websites, potentially misleading users and isolating them from original sources. For instance, a search for \"Taylor Swift\" yielded AI-generated biographical info with no links to her official website.\n\n2. **Return to Command-Line Interface:** Atlas relies on users guessing the correct commands to type instead of utilizing intuitive clickable links, reminiscent of outdated command-line interfaces and text adventure games. This makes navigation slower, more prone to error, and less discoverable.\n\n3. **User as AI Agent:** While Atlas claims to act as a user's \"agent,\" it actually exploits users to gather data that OpenAI couldn't access otherwise. By enabling features like \"memories\" and \"Ask ChatGPT,\" users unwittingly provide the browser with access to confidential documents, private browsing activity, and unfinished thoughts, creating a comprehensive surveillance profile. The author argues that this data collection benefits OpenAI more than the user. An example is given of booking a flight, which the AI botches despite navigating the website smoothly.\n\nThe article concludes by emphasizing the potential dangers of a browser that relies on emotional dependency, advocating for a warning label similar to that on addictive technologies, and defending the open and accessible nature of the web. The author calls for innovation that enhances, not replaces, the existing web experience.\n",
    "chinese_title": "ChatGPT地图集：反Web浏览器",
    "chinese_summary": "本文批评了 OpenAI 的新型浏览器 Atlas，认为其“反网络”，因为它优先考虑人工智能生成的内容，而不是直接访问网站和传统的网络体验。作者指出了三个主要问题：\n\n1. **AI 替代：** Atlas 用类似于网页的人工智能生成内容来替代实际的网站，可能会误导用户，并将他们与原始来源隔离开来。例如，搜索“泰勒·斯威夫特”会产生人工智能生成的传记信息，但没有链接到她的官方网站。\n\n2. **回归命令行界面：** Atlas 依赖用户猜测正确的命令来输入，而不是利用直观的可点击链接，让人想起过时的命令行界面和文本冒险游戏。这使得导航速度变慢、更容易出错，并且更难发现。\n\n3. **用户作为 AI 代理：** 虽然 Atlas 声称充当用户的“代理”，但它实际上是在利用用户收集 OpenAI 无法访问的数据。 通过启用诸如“记忆”和“询问 ChatGPT”之类的功能，用户不知不觉地让浏览器可以访问机密文档、私人浏览活动和未完成的想法，从而创建全面的监视配置文件。 作者认为，这种数据收集对 OpenAI 的益处大于对用户的益处。文中给出了预订航班的例子，即使 AI 机器人顺利浏览了网站，预订结果仍然出错。\n\n文章最后强调了一种依赖情感依赖的浏览器的潜在危险，主张添加类似于成瘾技术的警告标签，并捍卫网络的开放和可访问性。作者呼吁进行创新，以增强而非取代现有的网络体验。"
  },
  {
    "id": "45747402",
    "title": "Show HN: HUD-like live annotation and sketching app for macOS",
    "url": "https://draw.wrobele.com/",
    "summary": "Draw Over It is a macOS application designed for live screen annotation and sketching. It provides an always-on overlay that floats above any application, allowing users to draw directly on the screen for presentations, training, or general professional use. The overlay is toggled with a hotkey (⌃⌥⌘D) or via the menu bar, and can be quickly hidden when not needed.\n\nThe app features a HUD (Heads-Up Display) toolkit, accessible via right-click (or ⌃⌥⌘H), which offers various tools like pens, highlighters, shapes, blur, and session controls. Users can easily customize pen widths, opacity, fill modes, and color presets. A blur tool helps focus attention on key areas by obscuring the rest of the screen.\n\nDraw Over It allows users to save the canvas state for later use, export the canvas as transparent PNGs, and supports 14 languages. It also offers undo/redo functionality and an eraser (activated by holding Option). The app remembers annotations between sessions unless the \"Ephemeral Canvas\" option is enabled.\n\nExports are saved in `~/Library/Application Support/DrawOverIt/Exports`. The application is compatible with macOS 13.5 and later, supporting both Apple Silicon and Intel processors. The main benefit is to make visualising ideas on screen quickly and easily accessible.\n",
    "chinese_title": "Show HN: macOS 上的 HUD 风格实时标注和草图应用",
    "chinese_summary": "Draw Over It 是一款 macOS 应用程序，专为实时屏幕注释和草图绘制而设计。它提供始终置顶的叠加层，浮动于任何应用程序之上，允许用户直接在屏幕上进行绘图，适用于演示、培训或一般专业用途。叠加层可以通过热键 (⌃⌥⌘D) 或菜单栏切换，并且在不需要时可以快速隐藏。\n\n该应用程序具有一个 HUD（抬头显示）工具包，可以通过右键单击（或 ⌃⌥⌘H）访问，提供各种工具，如笔、荧光笔、形状、模糊和会话控制。用户可以轻松自定义笔的粗细、不透明度、填充模式和颜色预设。模糊工具可以通过遮蔽屏幕的其余部分来帮助将注意力集中在关键区域。\n\nDraw Over It 允许用户保存画布状态以供以后使用，将画布导出为透明 PNG，并支持 14 种语言。它还提供撤消/重做功能和橡皮擦（按住 Option 激活）。除非启用“临时画布”选项，否则该应用程序会记住会话之间的注释。\n\n导出文件保存在 `~/Library/Application Support/DrawOverIt/Exports` 中。该应用程序兼容 macOS 13.5 及更高版本，支持 Apple Silicon 和 Intel 处理器。主要优点是使屏幕上的可视化想法能够快速且轻松地访问。"
  },
  {
    "id": "45742419",
    "title": "Tips for stroke-surviving software engineers",
    "url": "https://blog.j11y.io/2025-10-29_stroke_tips_for_engineers/",
    "summary": "James Padolsey, a software engineer who survived a hemorrhagic stroke in the parietal lobe, offers advice tailored for other stroke-surviving engineers, especially those with residual epilepsy. His primary message is to prioritize health above all else, advocating for self-awareness and firm boundaries.\n\nKey tips include:\n\n*   **Stopping immediately:** Any signs of fatigue, fuzziness, or weird sensations are signals to rest and hydrate.\n*   **Controlling input:** Minimize distractions with headphones, blinders, and saying \"no\" to unnecessary demands.\n*   **Leveraging legal protections:** Utilize anti-discrimination laws and employee assistance programs.\n*   **Single-threading work:** Avoid context switching, batch tasks, and externalize working memory using notebooks and lists.\n*   **Using AI as a scratchpad:** Offload state management to AI tools.\n*   **Prioritizing tasks:** Tackle heavy thinking during peak cognitive windows.\n*   **Minimizing attention drain:** Disable notifications and avoid synchronous communication.\n*   **Avoiding long meetings:** Prefer emails, as communication can be mentally taxing.\n\nHe emphasizes the importance of understanding how specific brain areas (frontal and parietal cortices) are affected by tasks like context switching, mental navigation, and working memory. He notes that post-stroke, hyperexcitability near the lesion lowers seizure threshold, making cognitive overload particularly risky. Padolsey acknowledges his own struggles with implementing these strategies but underscores the importance of self-advocacy and setting boundaries.\n",
    "chinese_title": "中风幸存软件工程师的建议",
    "chinese_summary": "软件工程师詹姆斯·帕多尔西在顶叶出血性中风后幸存，他为其他中风后幸存的工程师，特别是那些患有残留性癫痫的工程师，提供了量身定制的建议。他的主要信息是将健康置于一切之上，提倡自我意识和坚定界限。\n\n主要建议包括：\n\n*   **立即停止：** 任何疲劳、模糊或奇怪的感觉都是休息和补充水分的信号。\n*   **控制输入：** 使用耳机、眼罩，并对不必要的需求说“不”，以最大限度地减少干扰。\n*   **利用法律保护：** 利用反歧视法和员工援助计划。\n*   **单线程工作：** 避免上下文切换，批量处理任务，并使用笔记本和列表外化工作记忆。\n*   **将人工智能作为草稿本：** 将状态管理卸载到人工智能工具。\n*   **优先处理任务：** 在认知高峰期处理繁重的思考。\n*   **最大限度地减少注意力消耗：** 禁用通知，避免同步通信。\n*   **避免冗长会议：** 尽量选择电子邮件，因为沟通在精神上可能很累。\n\n他强调了理解特定大脑区域（额叶和顶叶皮层）如何受到上下文切换、心理导航和工作记忆等任务的影响的重要性。 他指出，中风后，病灶附近的过度兴奋会降低癫痫发作的阈值，使得认知超载尤其危险。 帕多尔西承认自己在实施这些策略方面的挣扎，但强调了自我倡导和设定界限的重要性。"
  },
  {
    "id": "45748608",
    "title": "AirTips – Alternative to Bento.me/Linktree",
    "url": "https://a.coffee/",
    "summary": "AirTips is presented as an alternative to services like Bento.me and Linktree, offering a platform to consolidate links and projects. The platform emphasizes compactness, customizability, and API readiness. It's currently invite-only.\n\nKey features highlighted include:\n\n*   **Compactness:** Designed for a streamlined presentation of information.\n*   **Customizability:** Allowing users to build precise UIs with HTML.\n*   **API-Ready:** Offers an API for programmatic interaction.\n\nThe platform uses a modular approach, enabling users to add text modules, custom HTML (Tailwind CSS is specifically mentioned), and other elements. Examples of potential layouts and content types (responsive grids, badges, cards, headings, lists, emojis, inline SVG) are provided. Security is also emphasized with a \"no scripts\" policy.\n\nThe platform also allows for showcasing projects with descriptions and links. Metrics can also be added to the platform. Finally, there are links to pricing, API and custom HTML documentation.\n",
    "chinese_title": "AirTips – Bento.me/Linktree的替代品",
    "chinese_summary": "AirTips旨在成为Bento.me和Linktree等服务的替代方案，提供一个整合链接和项目的平台。该平台强调紧凑性、可定制性和API就绪性，目前仅限邀请。\n\n主要亮点功能包括：\n\n*   **紧凑性：** 专为信息流线型展示而设计。\n*   **可定制性：** 允许用户使用HTML构建精确的UI。\n*   **API就绪：** 提供API用于程序化交互。\n\n该平台采用模块化方法，使用户能够添加文本模块、自定义HTML（特别提到Tailwind CSS）和其他元素。提供了潜在布局和内容类型（响应式网格、徽章、卡片、标题、列表、表情符号、内联SVG）的示例。安全性也通过“无脚本”策略得到强调。\n\n该平台还允许展示带有描述和链接的项目。指标也可以添加到平台。最后，还有指向定价、API和自定义HTML文档的链接。"
  },
  {
    "id": "45742446",
    "title": "uBlock Origin Lite Apple App Store",
    "url": "https://apps.apple.com/in/app/ublock-origin-lite/id6745342698",
    "summary": "uBlock Origin Lite (uBOL) is a content blocker app available on the Apple App Store, created by Raymond Hill. It offers similar default filter lists to the popular uBlock Origin extension, including uBlock Origin's built-in filters, EasyList, EasyPrivacy, and Peter Lowe’s ad and tracking server list. Users can enable additional rulesets within the app's options.\n\nA key feature of uBOL is its declarative nature, meaning filtering is handled directly by the browser using CSS/JS injection, rather than a constant background process. This minimizes CPU and memory usage, with the app's service worker only active during interaction with the settings or popup panel.\n\nThe latest version, 2025.1028.1744, updates the filter lists. Reviews are overwhelmingly positive, with users praising its availability on iPadOS and Safari, as well as its effective ad blocking capabilities. One reviewer noted an earlier battery drain issue in the TestFlight version, which has since been improved. A common wish is the ability to add custom lists, though users are generally satisfied with the default configuration.\n\nThe app's privacy policy states that the developer collects no data. It's a free app, categorized as a Utility, and compatible across iPhone, iPad, Mac and Apple Vision devices running the required OS versions.\n",
    "chinese_title": "uBlock Origin Lite Apple App Store\nuBlock Origin Lite 苹果应用商店",
    "chinese_summary": "uBlock Origin Lite (uBOL) 是由 Raymond Hill 创建的，可在 Apple App Store 上下载的内容拦截器应用。它提供与流行的 uBlock Origin 扩展类似的默认过滤器列表，包括 uBlock Origin 的内置过滤器、EasyList、EasyPrivacy 以及 Peter Lowe 的广告和跟踪服务器列表。用户可以在应用的选项中启用其他规则集。\n\nuBOL 的一个关键特性是其声明性，意味着过滤直接由浏览器使用 CSS/JS 注入处理，而不是通过持续的后台进程。这最大限度地减少了 CPU 和内存的使用，应用的服务工作线程仅在与设置或弹出面板交互时才处于活动状态。\n\n最新版本 2025.1028.1744 更新了过滤器列表。评论绝大多数是正面的，用户称赞其在 iPadOS 和 Safari 上的可用性以及有效的广告拦截能力。一位评论者指出 TestFlight 版本中早期存在的电池消耗问题，该问题已经得到改善。一个常见的愿望是能够添加自定义列表，但用户通常对默认配置感到满意。\n\n该应用的隐私政策声明开发者不收集任何数据。它是一款免费应用，归类为实用工具，并且兼容运行所需操作系统版本的 iPhone、iPad、Mac 和 Apple Vision 设备。"
  },
  {
    "id": "45747018",
    "title": "Kafka is Fast – I'll use Postgres",
    "url": "https://topicpartition.io/blog/postgres-pubsub-queue-benchmarks",
    "summary": "This article argues that Postgres can be a viable alternative to Kafka for pub/sub messaging and queueing in many use cases, especially those with moderate workloads. It challenges the trend of adopting complex, specialized technologies like Kafka without carefully considering if their scale and features are truly necessary.\n\nThe author introduces two opposing \"camps\": one chasing buzzwords and another favoring common sense and simpler solutions. They highlight the \"Small Data\" movement and the \"Postgres Renaissance\" as trends supporting the latter. The argument is that Postgres, with its versatility and reliability, combined with powerful modern hardware, can handle 80% of the use cases of specialized systems with 20% of the effort.\n\nThe article then presents benchmarks of Postgres as a pub/sub system and as a queue. The pub/sub benchmark simulates a Kafka-like log structure using Postgres primitives, demonstrating that a single-node Postgres instance can handle 4.8 MiB/s write throughput and 24.6 MiB/s read throughput with low latency. A three-node replicated setup maintains similar throughput with a moderate latency increase. Queue benchmarks, while showing lower throughput, still demonstrate respectable performance.\n\nThe author concludes that for many common workloads, Postgres can be a simpler and more cost-effective solution than Kafka, especially considering the high costs associated with vendor-managed Kafka services. The article encourages readers to consider Postgres as a viable alternative and to avoid blindly adopting complex technologies without a clear understanding of their needs.\n",
    "chinese_title": "Kafka 很快——但我会用 Postgres。",
    "chinese_summary": "本文认为，在许多使用场景中，尤其是中等负载场景下，Postgres 可以作为 Kafka 的可行替代方案，用于发布/订阅消息传递和队列。它挑战了盲目采用复杂、专业的 Kafka 等技术，而不认真考虑其规模和功能是否真正必要的趋势。\n\n作者提出了两个对立的“阵营”：一个追逐流行语，另一个则倾向于常识和更简单的解决方案。他们强调“小数据”运动和“Postgres 复兴”是支持后者的趋势。 论点是，Postgres 凭借其多功能性和可靠性，结合强大的现代硬件，可以用 20% 的精力处理专业系统 80% 的使用场景。\n\n然后，本文展示了 Postgres 作为发布/订阅系统和队列的基准测试。 发布/订阅基准测试使用 Postgres 原语模拟类似 Kafka 的日志结构，表明单节点 Postgres 实例可以处理 4.8 MiB/s 的写入吞吐量和 24.6 MiB/s 的读取吞吐量，且延迟较低。 三节点复制设置保持相似的吞吐量，但延迟略有增加。 队列基准测试虽然显示较低的吞吐量，但仍然表现出可观的性能。\n\n作者总结说，对于许多常见的工作负载，Postgres 可以比 Kafka 更简单、更经济高效的解决方案，尤其是考虑到与供应商管理的 Kafka 服务相关的高成本。 本文鼓励读者考虑将 Postgres 作为一种可行的替代方案，并避免在不清楚了解自身需求的情况下盲目采用复杂的技术。"
  },
  {
    "id": "45748879",
    "title": "Minecraft removing obfuscation in Java Edition",
    "url": "https://www.minecraft.net/en-us/article/removing-obfuscation-in-java-edition",
    "summary": "Minecraft: Java Edition is removing obfuscation (code scrambling) to make modding easier. Currently, the game uses obfuscation to hide the source code, forcing modders to painstakingly decipher classes and functions. In 2019, Mojang released \"obfuscation mappings\" to help match obfuscated and unobfuscated terms, but now they are taking the next step by completely removing obfuscation.\n\nStarting with the first snapshot after the \"Mounts of Mayhem\" launch, the game will ship with original variable and function names, streamlining the modding process. This means easier mod creation, updating, and debugging, as modders won't need to untangle complex code or decipher unclear names. Debugging will also become easier as crash logs will be readable.\n\nTo ease the transition, Mojang will release \"experimental release\" versions alongside the obfuscated versions. This allows modders to test and adjust their tools and workflows before the full transition.\n\nImportant aspects for modders: The obfuscation maps will be removed from version .jsons, the client and server .jar files will no longer be obfuscated, and each .jar file will include a LICENSE file with a direct link to the EULA. The Minecraft EULA and Usage Guidelines remain in effect, ensuring that all mods adhere to the established rules.\n",
    "chinese_title": "Minecraft Java版移除混淆",
    "chinese_summary": "Minecraft：Java版将移除混淆代码以简化Mod制作。目前，游戏使用代码混淆来隐藏源代码，迫使Mod制作者费力地解读类和函数。2019年，Mojang发布了“混淆映射”以帮助匹配混淆和未混淆的术语，但现在他们正采取下一步行动，彻底移除代码混淆。\n\n从“混乱山脉”发布后的第一个快照开始，游戏将附带原始变量和函数名称，从而简化Mod制作流程。这意味着Mod的创建、更新和调试将变得更容易，因为Mod制作者不再需要解开复杂的代码或解读不清晰的名称。调试也将变得更容易，因为崩溃日志将变得可读。\n\n为了方便过渡，Mojang将发布“实验性版本”与混淆版本并行。这允许Mod制作者在完全过渡之前测试和调整他们的工具和工作流程。\n\nMod制作者需要注意的重要方面：混淆映射将从版本.jsons中移除，客户端和服务器.jar文件将不再被混淆，并且每个.jar文件将包含一个LICENSE文件，其中包含EULA的直接链接。Minecraft EULA和使用指南仍然有效，确保所有Mod都遵守既定规则。"
  },
  {
    "id": "45745566",
    "title": "Show HN: Learn German with Games",
    "url": "https://www.learngermanwithgames.com/",
    "summary": "生成摘要时出错",
    "chinese_title": "展示一下：用游戏学习德语",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45748195",
    "title": "The end of the rip-off economy: consumers use LLMs against information asymmetry",
    "url": "https://www.economist.com/finance-and-economics/2025/10/27/the-end-of-the-rip-off-economy",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "消费欺诈经济的终结：消费者利用大型语言模型对抗信息不对称",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "45749161",
    "title": "AOL to be sold to Bending Spoons for roughly $1.5B",
    "url": "https://www.axios.com/2025/10/29/aol-bending-spoons-deal",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "AOL to be sold to Bending Spoons for roughly $1.5B",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "45744395",
    "title": "SpiderMonkey Garbage Collector",
    "url": "https://firefox-source-docs.mozilla.org/js/gc.html",
    "summary": "The SpiderMonkey garbage collector (GC) is responsible for managing memory allocation and deallocation in Firefox's JavaScript engine. It's designed for speed and efficiency, handling both JavaScript data and some internal SpiderMonkey structures.\n\nIt's a hybrid tracing collector with several key features:\n\n*   **Precise:** It accurately tracks memory layout and stack roots, avoiding unnecessary retention of garbage.\n*   **Incremental:** It breaks down execution into smaller slices to minimize pauses for users, though some operations like root marking and compacting are not fully incremental.\n*   **Generational:** It uses a two-generation approach (nursery for young, frequently collected objects, and tenured heap for older objects) to optimize collection frequency.\n*   **Partially Concurrent:** Some GC tasks, like finalization and memory management, occur concurrently with the main program.\n*   **Parallel:** GC slices are processed in parallel to leverage multi-core systems.\n*   **Compacting:** It rearranges data within arenas to reduce fragmentation, though this is a less frequent, non-incremental operation.\n*   **Partitioned Heap:** Uses 'zones' which are independent heaps that can be collected independently. This helps with incremental collection.\n\nThe collector aims to minimize user impact by performing most collection work incrementally and in parallel. Compacting is used to combat fragmentation when necessary. The article directs readers to the SpiderMonkey source code for more detailed information.\n",
    "chinese_title": "SpiderMonkey 垃圾回收器",
    "chinese_summary": "The SpiderMonkey garbage collector (GC) is responsible for managing memory allocation and deallocation in Firefox's JavaScript engine. It's designed for speed and efficiency, handling both JavaScript data and some internal SpiderMonkey structures.\n\nIt's a hybrid tracing collector with several key features:\n\n*   **Precise:** It accurately tracks memory layout and stack roots, avoiding unnecessary retention of garbage.\n*   **Incremental:** It breaks down execution into smaller slices to minimize pauses for users, though some operations like root marking and compacting are not fully incremental.\n*   **Generational:** It uses a two-generation approach (nursery for young, frequently collected objects, and tenured heap for older objects) to optimize collection frequency.\n*   **Partially Concurrent:** Some GC tasks, like finalization and memory management, occur concurrently with the main program.\n*   **Parallel:** GC slices are processed in parallel to leverage multi-core systems.\n*   **Compacting:** It rearranges data within arenas to reduce fragmentation, though this is a less frequent, non-incremental operation.\n*   **Partitioned Heap:** Uses 'zones' which are independent heaps that can be collected independently. This helps with incremental collection.\n\nThe collector aims to minimize user impact by performing most collection work incrementally and in parallel. Compacting is used to combat fragmentation when necessary. The article directs readers to the SpiderMonkey source code for more detailed information.\n"
  },
  {
    "id": "45747605",
    "title": "Oracle has adopted BOOLEAN in 23ai and PostgreSQL had it forever",
    "url": "https://hexacluster.ai/blog/postgresql/oracles-adoption-of-native-boolean-data-type-vs-postgresql/",
    "summary": "This article discusses Oracle's recent (2025) adoption of the native `BOOLEAN` data type in its 23ai release and contrasts it with PostgreSQL, which has supported `BOOLEAN` for over two decades.  Before 23ai, Oracle developers used workarounds like `VARCHAR2` or `NUMBER` to represent boolean values, leading to potential performance issues due to conversions and larger indexes.\n\nThe article highlights the advantages of a native `BOOLEAN` type, emphasizing its efficiency in storage (single byte in PostgreSQL), simpler queries (no string comparisons needed), faster filtering, and improved readability. It contrasts the table structures and insert/select statements in Oracle (before 23ai) and PostgreSQL to demonstrate the benefits.\n\nThe article presents a table comparing `BOOLEAN` with the workarounds `CHAR(1)/CHAR(5)` and `SMALLINT/NUMBER(1)` across aspects like meaning, storage, type safety, query simplicity, value interpretation, readability, and language integration, concluding that `BOOLEAN` is the optimal data type.\n\nFinally, the article promotes HexaRocket, a tool that automates the migration from Oracle to PostgreSQL, including automatic mapping of Oracle's `CHAR(1)` and `NUMBER(1)` to PostgreSQL's `BOOLEAN`. It also mentions HexaCluster's PostgreSQL support and migration services.\n",
    "chinese_title": "Oracle 在 23ai 中采用了 BOOLEAN，而 PostgreSQL 一直都有。",
    "chinese_summary": "本文探讨了Oracle最近（2025年）在其23ai版本中采用原生`BOOLEAN`数据类型，并将其与已支持`BOOLEAN`超过二十年的PostgreSQL进行了对比。 在23ai之前，Oracle开发人员使用`VARCHAR2`或`NUMBER`等变通方法来表示布尔值，导致因转换和更大的索引而可能出现性能问题。\n\n本文重点介绍了原生`BOOLEAN`类型的优势，强调了其在存储（PostgreSQL中为单字节）、更简单的查询（无需字符串比较）、更快的过滤和更高的可读性方面的效率。 它对比了Oracle（23ai之前）和PostgreSQL中的表结构和insert/select语句，以展示其益处。\n\n本文提供了一个表格，从含义、存储、类型安全、查询简易性、值解释、可读性和语言集成等方面比较了`BOOLEAN`与`CHAR(1)/CHAR(5)`和`SMALLINT/NUMBER(1)`的变通方法，并得出结论：`BOOLEAN`是最佳数据类型。\n\n最后，本文推广了HexaRocket，该工具可自动执行从Oracle到PostgreSQL的迁移，包括自动将Oracle的`CHAR(1)`和`NUMBER(1)`映射到PostgreSQL的`BOOLEAN`。它还提到了HexaCluster的PostgreSQL支持和迁移服务。"
  },
  {
    "id": "45745995",
    "title": "Berkeley Out-of-Order RISC-V Processor (Boom) (2020)",
    "url": "https://docs.boom-core.org/en/latest/sections/intro-overview/boom.html",
    "summary": "生成摘要时出错",
    "chinese_title": "伯克利乱序RISC-V处理器 (Boom) (2020)",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45745995",
    "title": "Berkeley Out-of-Order RISC-V Processor (Boom) (2020)",
    "url": "https://docs.boom-core.org/en/latest/sections/intro-overview/boom.html",
    "summary": "The Berkeley Out-of-Order Machine (BOOM) is an open-source out-of-order RISC-V processor design heavily influenced by the MIPS R10000 and Alpha 21264 processors. Like these predecessors, BOOM employs a unified physical register file design, enabling explicit register renaming.\n\nA key feature of BOOM is its implementation in Chisel, a hardware construction language. This allows BOOM to be a *generator* of out-of-order designs, rather than a single, fixed core. This means BOOM represents a family of configurable processor designs.\n\nFurthermore, BOOM utilizes the Rocket Chip SoC generator as a library, leveraging its micro-architectural structures like TLBs and PTWs. This modular approach facilitates the construction of complete System-on-Chips (SoCs) incorporating a BOOM core. In summary, BOOM is a flexible and customizable out-of-order RISC-V processor design leveraging modern hardware generation techniques and established microarchitectural principles.\n",
    "chinese_title": "伯克利乱序RISC-V处理器(Boom)(2020)",
    "chinese_summary": "The Berkeley Out-of-Order Machine (BOOM) is an open-source out-of-order RISC-V processor design heavily influenced by the MIPS R10000 and Alpha 21264 processors. Like these predecessors, BOOM employs a unified physical register file design, enabling explicit register renaming.\n\nA key feature of BOOM is its implementation in Chisel, a hardware construction language. This allows BOOM to be a *generator* of out-of-order designs, rather than a single, fixed core. This means BOOM represents a family of configurable processor designs.\n\nFurthermore, BOOM utilizes the Rocket Chip SoC generator as a library, leveraging its micro-architectural structures like TLBs and PTWs. This modular approach facilitates the construction of complete System-on-Chips (SoCs) incorporating a BOOM core. In summary, BOOM is a flexible and customizable out-of-order RISC-V processor design leveraging modern hardware generation techniques and established microarchitectural principles.\n"
  },
  {
    "id": "45739499",
    "title": "Tinkering is a way to acquire good taste",
    "url": "https://seated.ro/blog/tinkering-a-lost-art",
    "summary": "生成摘要时出错",
    "chinese_title": "尝试是培养良好品味的方式。",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45749442",
    "title": "Cursor 2.0",
    "url": "https://cursor.com/changelog",
    "summary": "Cursor 2.0 introduces significant enhancements focused on agentic coding, performance, and team collaboration. Key features include the launch of \"Composer,\" a faster agentic coding model, and the general availability (GA) of Browser for Agent with embedded in-editor tools.  It also offers improvements to code review, and the GA of sandboxed terminals on macOS, enhancing security.\n\nTeam collaboration is boosted through custom commands and rules centrally managed for all team members. Voice Mode enables control of Agent through speech. Performance is drastically improved via Language Server Protocols (LSPs), especially noticeable with agent and diff usage, including faster Python and TypeScript LSPs and memory leak fixes.\n\nPlan Mode allows plan creation with one model and building with another, either in the foreground or background. Sharing team commands and prompts is streamlined, and the prompt UI is improved. Agent Harness has been enhanced, notably improving quality for GPT-5 Codex. Cloud Agents offer 99.9% reliability, instant startup, and a new UI.\n\nFor Enterprise users, Cursor 2.0 provides admin controls for sandboxed terminals, cloud distribution of hooks, and an audit log for admin events.\n",
    "chinese_title": "光标 2.0",
    "chinese_summary": "Cursor 2.0 引入了重大改进，侧重于智能体编码、性能和团队协作。主要功能包括发布更快的智能体编码模型“Composer”，以及浏览器代理普遍可用 (GA)，该代理具有嵌入式编辑器工具。 它还改进了代码审查，并普遍提供了 macOS 上的沙盒终端，从而提高了安全性。\n\n通过为所有团队成员集中管理的自定义命令和规则，团队协作得到增强。语音模式支持通过语音控制代理。通过语言服务器协议 (LSP)，性能得到了大幅提升，尤其是在代理和差异使用方面，包括更快的 Python 和 TypeScript LSP 以及内存泄漏修复。\n\n计划模式允许使用一个模型创建计划，并使用另一个模型构建，无论是在前台还是后台。共享团队命令和提示已得到简化，并且提示 UI 得到了改进。Agent Harness 得到了增强，显著提高了 GPT-5 Codex 的质量。云代理提供 99.9% 的可靠性、即时启动和新的 UI。\n\n对于企业用户，Cursor 2.0 提供了沙盒终端的管理控制、钩子的云分发以及管理事件的审计日志。"
  },
  {
    "id": "45669377",
    "title": "Continuous Nvidia CUDA Profiling in Production",
    "url": "https://www.polarsignals.com/blog/posts/2025/10/22/gpu-profiling",
    "summary": "生成摘要时出错",
    "chinese_title": "在生产环境中持续进行Nvidia CUDA性能分析",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45736479",
    "title": "What we talk about when we talk about sideloading",
    "url": "https://f-droid.org/2025/10/28/sideloading.html",
    "summary": "This article argues that Google is falsely claiming sideloading is not going away on Android, despite new developer verification requirements that effectively end users' freedom to choose what software they install. The author criticizes the term \"sideloading\" as a misleading label and emphasizes that it simply means installing software, regardless of the source.\n\nThe author contends that Google's developer verification decree forces developers to register with Google, pay fees, and provide identification to distribute apps, undermining the open nature of Android and giving Google excessive control over software distribution. This restricts users' ability to install apps from sources like F-Droid or directly from developers, even if using alternative app stores like the Samsung Galaxy Store.\n\nThe author questions Google's claim that sideloading leads to more malware, citing instances of malware found on the Google Play Store and highlighting the potential for commercial incentives to compromise Google's judgment.\n\nThe article highlights Google's recent controversial actions, such as crippling ad-blockers in Chrome and restricting the Android Open Source Project (AOSP), further demonstrating a trend towards control. It calls on consumers to advocate for an open Android ecosystem and urges developers to reject Google's developer registration program. The author argues that users own their phones and have the right to choose their software sources.\n",
    "chinese_title": "当我们谈论侧载时，我们在谈论什么",
    "chinese_summary": "本文认为，尽管谷歌推出了新的开发者验证要求，实际上剥夺了用户选择安装软件的自由，但谷歌却虚假地声称侧载在安卓系统中不会消失。作者批评“侧载”这一术语具有误导性，并强调它仅仅意味着安装软件，无论来源如何。\n\n作者认为，谷歌的开发者验证法令迫使开发者向谷歌注册，支付费用并提供身份证明才能分发应用程序，这破坏了安卓的开放性，并赋予谷歌对软件分发的过度控制权。这限制了用户从 F-Droid 或直接从开发者处安装应用程序的能力，即使是使用像三星 Galaxy Store 这样的替代应用商店也不例外。\n\n作者质疑谷歌声称侧载会导致更多恶意软件的说法，并引用了在 Google Play 商店中发现恶意软件的案例，并强调了商业动机有可能损害谷歌的判断。\n\n本文强调了谷歌最近备受争议的行为，例如削弱 Chrome 中的广告拦截器和限制 Android 开放源代码项目 (AOSP)，进一步证明了一种走向控制的趋势。它呼吁消费者倡导开放的安卓生态系统，并敦促开发者拒绝谷歌的开发者注册计划。作者认为用户拥有自己的手机，并有权选择他们的软件来源。"
  },
  {
    "id": "45738247",
    "title": "Boring is what we wanted",
    "url": "https://512pixels.net/2025/10/boring-is-what-we-wanted/",
    "summary": "This article argues that the \"boring\" incremental upgrades of Apple silicon Macs are exactly what users wanted after years of inconsistent hardware during the PowerPC and Intel eras. The author reminisces about the transformative impact of the M1 Macs, highlighting their superior speed, efficiency, and battery life, a departure from the trade-offs inherent in previous PC computing.\n\nThe author contends that Apple's control over its silicon has allowed for predictable and consistent progress, shipping regular updates that improve both power and efficiency. He contrasts this with the past, where Mac updates were often delayed due to reliance on external partners, leading to issues like faulty NVIDIA cards and overheating iMacs. While acknowledging Apple's past mistakes (e.g., the butterfly keyboard), the author emphasizes that owning the core technology allows Apple to deliver steady hardware development.\n\nThe piece directly addresses the criticism that recent M-series chip updates are \"boring,\" arguing that this predictability is a positive outcome. The author points to a chart illustrating consistent improvements in Apple silicon, suggesting that the upgrades are meaningful, especially for users who don't upgrade annually. The author concludes that calling Apple silicon's success \"boring\" is downplaying its achievements and ignoring the consistent progress users have long desired.\n",
    "chinese_title": "我们就是要无聊。",
    "chinese_summary": "This article argues that the \"boring\" incremental upgrades of Apple silicon Macs are exactly what users wanted after years of inconsistent hardware during the PowerPC and Intel eras. The author reminisces about the transformative impact of the M1 Macs, highlighting their superior speed, efficiency, and battery life, a departure from the trade-offs inherent in previous PC computing.\n\nThe author contends that Apple's control over its silicon has allowed for predictable and consistent progress, shipping regular updates that improve both power and efficiency. He contrasts this with the past, where Mac updates were often delayed due to reliance on external partners, leading to issues like faulty NVIDIA cards and overheating iMacs. While acknowledging Apple's past mistakes (e.g., the butterfly keyboard), the author emphasizes that owning the core technology allows Apple to deliver steady hardware development.\n\nThe piece directly addresses the criticism that recent M-series chip updates are \"boring,\" arguing that this predictability is a positive outcome. The author points to a chart illustrating consistent improvements in Apple silicon, suggesting that the upgrades are meaningful, especially for users who don't upgrade annually. The author concludes that calling Apple silicon's success \"boring\" is downplaying its achievements and ignoring the consistent progress users have long desired.\n"
  },
  {
    "id": "45713566",
    "title": "Glyph: Scaling Context Windows via Visual-Text Compression",
    "url": "https://github.com/thu-coai/Glyph",
    "summary": "生成摘要时出错",
    "chinese_title": "字形：通过视觉-文本压缩进行上下文窗口缩放",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45704216",
    "title": "UIs Are Not Pure Functions of the Model – React.js and Cocoa Side by Side (2018)",
    "url": "https://blog.metaobject.com/2018/12/uis-are-not-pure-functions-of-model.html",
    "summary": "This article compares React.js's approach to UI development with Cocoa's MVC framework, arguing that React's core premise of UIs being pure functions of the model is flawed and leads to unnecessary complexity.\n\nThe author contrasts React's concepts of transformation, abstraction, composition, state management, memoization, and list handling with Cocoa's equivalents. They contend that Cocoa, with its object-oriented approach and stable view hierarchy, handles these aspects more efficiently and naturally.\n\nThe author criticizes React's reliance on pure functions, arguing that UIs inherently have state specific to their projection (e.g., scroll position) and shouldn't be forced into an immutable data model. They also point out that React's attempts to address the limitations of this pure function approach, through techniques like memoization, state maps, and algebraic effects, only add complexity and contradict the initial premise.\n\nFurthermore, the article highlights Cocoa's advantages in handling UI stability and optimization through its event loop and drawRect method. It argues that Cocoa's model allows for direct manipulation of UI-specific state and context without the need for complex data passing mechanisms like React's \"context.\" The author concludes that the pursuit of UIs as pure functions leads to an \"avalanche of problems\" and is fueled by an overzealous embrace of functional programming concepts.\n",
    "chinese_title": "UI 不是模型纯函数的应用——React.js 和 Cocoa 的对比 (2018)",
    "chinese_summary": "This article compares React.js's approach to UI development with Cocoa's MVC framework, arguing that React's core premise of UIs being pure functions of the model is flawed and leads to unnecessary complexity.\n\nThe author contrasts React's concepts of transformation, abstraction, composition, state management, memoization, and list handling with Cocoa's equivalents. They contend that Cocoa, with its object-oriented approach and stable view hierarchy, handles these aspects more efficiently and naturally.\n\nThe author criticizes React's reliance on pure functions, arguing that UIs inherently have state specific to their projection (e.g., scroll position) and shouldn't be forced into an immutable data model. They also point out that React's attempts to address the limitations of this pure function approach, through techniques like memoization, state maps, and algebraic effects, only add complexity and contradict the initial premise.\n\nFurthermore, the article highlights Cocoa's advantages in handling UI stability and optimization through its event loop and drawRect method. It argues that Cocoa's model allows for direct manipulation of UI-specific state and context without the need for complex data passing mechanisms like React's \"context.\" The author concludes that the pursuit of UIs as pure functions leads to an \"avalanche of problems\" and is fueled by an overzealous embrace of functional programming concepts.\n"
  },
  {
    "id": "45692116",
    "title": "Apple will phase out Rosetta 2 in macOS 28",
    "url": "https://developer.apple.com/documentation/apple-silicon/about-the-rosetta-translation-environment",
    "summary": "The article title \"Apple will phase out Rosetta 2 in macOS 28\" suggests that Apple plans to remove Rosetta 2 from its macOS operating system with the release of macOS 28.\n\nRosetta 2 is a translation environment that allows Macs with Apple silicon to run applications built for Intel-based Macs. Its purpose is to bridge the gap during the transition from Intel processors to Apple silicon, ensuring compatibility with older software.\n\nThe inclusion of the \"About the Rosetta translation environment | Apple Developer Documentation\" link suggests that the phase-out would involve developers needing to update or recompile their applications to be natively compatible with Apple silicon. Developers may need to consider offering universal binaries that support both architectures.\n\nPhasing out Rosetta 2 signals that Apple believes the transition to Apple silicon is largely complete, and there's less need for the compatibility layer. This likely means that the vast majority of commonly used applications have been updated to run natively on Apple silicon, or that suitable alternatives are available.\n\nWhile the linked page from Apple Developer Documentation cannot be viewed in its entirety without JavaScript enabled, the title heavily implies Apple's intention to remove Rosetta 2 in the future. This action will likely prompt developers to prioritize native Apple silicon support to avoid compatibility issues for users running future versions of macOS.\n",
    "chinese_title": "Apple 将在 macOS 28 中逐步淘汰 Rosetta 2。",
    "chinese_summary": "苹果将在macOS 28中逐步淘汰Rosetta 2，这表明苹果计划在macOS 28发布时从其操作系统中移除Rosetta 2。\n\nRosetta 2是一个转换环境，使配备Apple芯片的Mac能够运行为基于Intel的Mac构建的应用程序。其目的是弥合从Intel处理器到Apple芯片过渡期间的差距，确保与旧软件的兼容性。\n\n包含“关于 Rosetta 转换环境 | Apple Developer 文档”链接表明，逐步淘汰将涉及开发人员需要更新或重新编译其应用程序，使其与 Apple 芯片原生兼容。开发人员可能需要考虑提供支持两种架构的通用二进制文件。\n\n逐步淘汰 Rosetta 2 表明 Apple 认为向 Apple 芯片的过渡已基本完成，并且对兼容层的需求减少。这可能意味着绝大多数常用应用程序已更新为在 Apple 芯片上原生运行，或者存在合适的替代方案。\n\n虽然没有启用 JavaScript 就无法完整查看 Apple Developer 文档中的链接页面，但标题强烈暗示了 Apple 未来移除 Rosetta 2 的意图。此举可能会促使开发人员优先考虑原生 Apple 芯片支持，以避免运行未来版本 macOS 的用户出现兼容性问题。"
  },
  {
    "id": "45739080",
    "title": "Generative AI Image Editing Showdown",
    "url": "https://genai-showdown.specr.net/image-editing",
    "summary": "This \"Generative AI Image Editing Showdown\" article focuses on a comparison of different Generative AI (GenAI) tools used for image editing. It likely examines the capabilities, strengths, and weaknesses of various AI platforms designed to modify, enhance, or create images.\n\nThe showdown probably assesses the tools based on criteria like:\n\n*   **Ease of Use:** How intuitive and accessible the tools are for users with varying levels of expertise.\n*   **Image Quality:** The quality of the generated or modified images, including resolution, detail, and realism.\n*   **Functionality:** The range of editing tasks the tools can perform, such as inpainting (filling in missing parts), outpainting (expanding image boundaries), style transfer, object removal, and more.\n*   **Speed and Efficiency:** How quickly the tools process images and generate results.\n*   **Cost:** The pricing models of the tools, whether they are free, subscription-based, or pay-per-use.\n*   **Accuracy:** How well the tools interpret and execute user prompts and instructions.\n\nThe article's aim is to provide readers with an understanding of the current landscape of GenAI image editing tools and to help them choose the best option based on their specific needs and budget. It could highlight the leading contenders in the market and discuss the potential future developments in this rapidly evolving field. Ultimately, the article seeks to inform readers about the power and limitations of using AI to transform images.\n",
    "chinese_title": "生成式AI图像编辑对决",
    "chinese_summary": "生成式AI图像编辑工具大比拼：本文重点比较用于图像编辑的不同生成式AI(GenAI)工具。它可能会考察各种AI平台在修改、增强或创建图像方面的能力、优势和劣势。\n\n这次比拼可能会根据以下标准评估这些工具：\n\n*   **易用性：** 这些工具对于不同专业水平用户的直观性和可访问性如何。\n*   **图像质量：** 生成或修改后的图像质量，包括分辨率、细节和真实感。\n*   **功能性：** 这些工具可以执行的编辑任务范围，例如图像修复（填充缺失部分）、图像扩展（扩展图像边界）、风格迁移、物体移除等等。\n*   **速度和效率：** 这些工具处理图像和生成结果的速度有多快。\n*   **成本：** 这些工具的定价模式，无论是免费、订阅制还是按次付费。\n*   **准确性：** 这些工具解释和执行用户提示和指令的能力如何。\n\n本文旨在帮助读者了解当前生成式AI图像编辑工具的现状，并帮助他们根据自身特定需求和预算选择最佳方案。它可能会重点介绍市场上的主要竞争者，并讨论这个快速发展领域中未来的潜在发展。最终，本文旨在告知读者使用AI转换图像的能力和局限性。"
  },
  {
    "id": "45749331",
    "title": "Google Play Store Stops Requiring the Use of Google Play Billing in the US",
    "url": "https://support.google.com/googleplay/android-developer/answer/15582165?hl=en",
    "summary": "In response to a US District Court injunction upheld by the Ninth Circuit on September 12, 2025, Google Play Store has made significant policy changes for developers serving users in the United States, effective October 29, 2025.\n\nCrucially, Google will no longer mandate the use of Google Play Billing for in-app purchases within apps distributed through the Play Store in the US. Developers are now free to utilize alternative in-app payment methods and communicate their availability to users. Furthermore, developers can now inform users about the pricing and availability of their app outside of the Google Play Store and provide links for direct downloads or transactions. They are also free to inform users of the availability of alternate payment methods.\n\nGoogle has also committed to not forcing developers to base their app pricing on whether or not Google Play Billing is used.\n\nThese policy changes are explicitly for the US market and are in effect only while the US District Court's order remains active. Google states these updates supersede any conflicting restrictions in their existing Payments policy. Google plans to share further details on program requirements and business model adjustments to maintain user trust and safety, incorporating feedback from developers and users. Additional policy adjustments consistent with the injunction will be announced on the Google Play policy page.\n",
    "chinese_title": "Google Play商店停止要求美国地区使用Google Play结算系统",
    "chinese_summary": "为响应美国第九巡回法院于2025年9月12日维持的美国地方法院禁令，自2025年10月29日起，Google Play商店针对服务于美国用户的开发者实施了重大政策变更。\n\n关键在于，Google将不再强制要求在美国Play商店分发的应用程序内购买使用Google Play结算系统。 开发者现在可以自由使用其他应用内支付方式，并向用户告知其可用性。 此外，开发者现在可以告知用户其应用程序在Google Play商店之外的价格和可用性，并提供直接下载或交易的链接。 他们还可以自由告知用户其他支付方式的可用性。\n\nGoogle还承诺不会强迫开发者根据是否使用Google Play结算系统来确定其应用程序的定价。\n\n这些政策变更明确针对美国市场，且仅在美国地方法院的命令仍然有效时生效。 Google声明这些更新取代了其现有支付政策中任何冲突的限制。 Google计划分享有关程序要求和业务模式调整的更多细节，以维护用户信任和安全，并纳入来自开发者和用户的反馈。 与该禁令相一致的其他政策调整将在Google Play政策页面上公布。"
  },
  {
    "id": "45746753",
    "title": "New attacks are diluting secure enclave defenses from Nvidia, AMD, and Intel",
    "url": "https://arstechnica.com/security/2025/10/new-physical-attacks-are-quickly-diluting-secure-enclave-defenses-from-nvidia-amd-and-intel/",
    "summary": "This article highlights critical vulnerabilities in Trusted Execution Environments (TEEs) from Nvidia, AMD, and Intel, undermining the security assurances they offer. A new attack, \"TEE.fail,\" bypasses the latest TEE protections by physically interposing hardware between a memory chip and the motherboard, requiring only brief physical access and kernel OS compromise. This attack, along with previous ones like Battering RAM and Wiretap, exposes the limitations of TEEs against physical attacks, which chipmakers often exclude from their threat models.\n\nThe article criticizes the misleading marketing by chipmakers and TEE users, including major tech companies like Cloudflare, Anthropic, Microsoft, Meta, and Signal, who overstate the protection offered, often implying resistance to physical attacks. Researcher HD Moore emphasizes the difficulty for customers to understand the actual security they're getting with confidential computing.\n\nThe attacks exploit deterministic encryption, a weaker form of encryption that's vulnerable to replay attacks. TEE.fail allows attackers to steal attestation keys, impersonate secure enclaves, decrypt traffic, and compromise sensitive data. The attack is relatively cheap and easy to execute, requiring readily available equipment. Services like BuilderNet, dstack, and Secret Network were demonstrated to be vulnerable.\n\nThe article concludes by discussing potential mitigations, such as adding entropy to ciphertext blocks and exploring more robust encryption methods, acknowledging the challenge of balancing performance and security in TEEs. It stresses the importance of understanding the limitations of TEEs, especially in environments where physical security cannot be guaranteed.\n",
    "chinese_title": "新型攻击正在削弱英伟达、AMD和英特尔的安全区域防御。",
    "chinese_summary": "本文重点介绍了英伟达、AMD和英特尔的可信执行环境（TEE）中的关键漏洞，这些漏洞破坏了它们提供的安全保证。一种名为\"TEE.fail\"的新攻击通过在内存芯片和主板之间物理插入硬件来绕过最新的TEE保护，只需要短暂的物理访问和内核操作系统妥协。这种攻击以及之前的Battering RAM和Wiretap等攻击，暴露了TEE在物理攻击面前的局限性，而芯片制造商通常将此类攻击排除在其威胁模型之外。\n\n本文批评了芯片制造商和TEE用户（包括Cloudflare、Anthropic、微软、Meta和Signal等主要科技公司）的误导性营销，他们夸大了所提供的保护，往往暗示能够抵御物理攻击。研究人员HD Moore强调，客户很难理解他们在机密计算中获得的实际安全性。\n\n这些攻击利用确定性加密，这是一种较弱的加密形式，容易受到重放攻击。\"TEE.fail\"允许攻击者窃取证明密钥、冒充安全飞地、解密流量并泄露敏感数据。该攻击相对便宜且易于执行，只需要现成的设备。BuilderNet、dstack和Secret Network等服务已被证明容易受到攻击。\n\n文章最后讨论了潜在的缓解措施，例如向密文块添加熵以及探索更强大的加密方法，同时也承认了在TEE中平衡性能和安全性的挑战。文章强调了理解TEE局限性的重要性，尤其是在无法保证物理安全的环境中。"
  },
  {
    "id": "45749557",
    "title": "Win 11 videos demonstrating account requirements bypass purged from YouTube",
    "url": "https://www.tomshardware.com/tech-industry/big-tech/windows-11-videos-demonstrating-account-and-hardware-requirements-bypass-purged-from-youtube-platform-says-content-encourages-dangerous-or-illegal-activities-that-risk-serious-physical-harm-or-death",
    "summary": "YouTube removed videos from the CyberCPU Tech channel that demonstrated methods to bypass Windows 11's hardware and account requirements. The creator, Rich, suspects Microsoft is behind the takedown, though YouTube cited a violation of \"Harmful or Dangerous Content\" guidelines, which Rich finds illogical as bypassing Windows 11 limitations doesn't pose a physical risk.\n\nRich expressed frustration over the lack of clear communication from YouTube regarding the specific reasons for the removals, stating he feels forced to self-censor. He acknowledged that YouTube has the right to control its platform but desires transparency.\n\nThe article highlights the ongoing debate about Windows 11's stringent requirements, which are pushing some users to consider alternatives like Macs or, as suggested in the comments, Linux distributions like Bazzite. The removal of these videos coincides with Microsoft's push for Windows 10 users to upgrade, and these upgrades are proving difficult for many users because of the set requirements.\n\nThe article concludes by noting the uncertainty surrounding the takedown, suggesting possibilities ranging from YouTube's AI algorithm to a direct request from Microsoft. It also mentions that YouTube has recently penalized Gamers Nexus as well.\n",
    "chinese_title": "YouTube 清除了演示绕过 Win 11 账户要求的视频",
    "chinese_summary": "YouTube删除了CyberCPU Tech频道演示绕过Windows 11硬件和账户要求的视频。创作者Rich怀疑微软是此次下架的幕后推手，尽管YouTube声称违反了“有害或危险内容”指南，Rich认为这不合逻辑，因为绕过Windows 11的限制不会造成人身危险。\n\nRich对YouTube缺乏关于删除的具体原因的明确沟通表示沮丧，并表示他感到被迫自我审查。他承认YouTube有权控制其平台，但希望获得透明度。\n\n这篇文章强调了关于Windows 11严格要求的持续争论，这些要求正促使一些用户考虑其他选择，例如Mac电脑，或者像评论中建议的那样，使用像Bazzite这样的Linux发行版。这些视频的删除恰逢微软推动Windows 10用户升级之时，而由于设定的要求，这些升级对许多用户来说都很困难。\n\n文章最后指出，下架事件仍存在不确定性，并提出了各种可能性，从YouTube的AI算法到微软的直接要求。文章还提到YouTube最近也惩罚了Gamers Nexus。"
  },
  {
    "id": "45701400",
    "title": "Wheeled Inverted Pendulum Model",
    "url": "https://scaron.info/robotics/wheeled-inverted-pendulum-model.html",
    "summary": "This article introduces the Wheeled Inverted Pendulum (WIP) model, a nonlinear system consisting of a concentrated mass attached to a massless pole and active wheels. Unlike the cart-pole model with passive wheels, the WIP's wheels are actively driven. The article defines the system's parameters: pole length (ℓ), mass (m), pole angle (θ), and wheel position on the ground (r).\n\nA key assumption is that the wheels roll without slipping, linking the wheel's angular coordinate (ϕ) to its ground position (r). The core of the article focuses on presenting the equation of motion for the WIP: ℓθ̈ = g sin(θ) - r̈ cos(θ). This equation describes the relationship between the pendulum's angular acceleration (θ̈), gravity (g), the angle (θ), and the wheel's linear acceleration (r̈).\n\nThe article highlights the relevance of this model for optimal control applications in real robots. It mentions the intention to discuss the linearization and discretization of the equation of motion for small angles, suggesting that this simplified form is more amenable to control design.\n",
    "chinese_title": "轮式倒立摆模型",
    "chinese_summary": "This article introduces the Wheeled Inverted Pendulum (WIP) model, a nonlinear system consisting of a concentrated mass attached to a massless pole and active wheels. Unlike the cart-pole model with passive wheels, the WIP's wheels are actively driven. The article defines the system's parameters: pole length (ℓ), mass (m), pole angle (θ), and wheel position on the ground (r).\n\nA key assumption is that the wheels roll without slipping, linking the wheel's angular coordinate (ϕ) to its ground position (r). The core of the article focuses on presenting the equation of motion for the WIP: ℓθ̈ = g sin(θ) - r̈ cos(θ). This equation describes the relationship between the pendulum's angular acceleration (θ̈), gravity (g), the angle (θ), and the wheel's linear acceleration (r̈).\n\nThe article highlights the relevance of this model for optimal control applications in real robots. It mentions the intention to discuss the linearization and discretization of the equation of motion for small angles, suggesting that this simplified form is more amenable to control design.\n"
  },
  {
    "id": "45742616",
    "title": "Wacl – A Tcl Distribution for WebAssembly",
    "url": "https://github.com/ecky-l/wacl",
    "summary": "Wacl is a Tcl distribution designed for WebAssembly, allowing developers to embed a Tcl interpreter into web browsers and integrate it with JavaScript. This enables Tcl developers to build client-side web applications using their familiar tools and leverage existing Tcl codebases like Tcllib. Wacl builds upon the Emtcl project, adding features like a Tcl interpreter instance accessible via JavaScript, an event loop, client sockets (supporting binary communication via websockets), and a virtual filesystem for Tcl libraries and packages.\n\nKey benefits include using Tcl for web development, reusing existing Tcl code in browsers, and potentially smaller application sizes and faster performance with WebAssembly compared to JavaScript.\n\nWacl includes extensions like `wacl` (for DOM manipulation and calling Javascript), `tDOM`, `json`, `html`, `javascript`, `ncgi`, and `rl_json`. While including extensions increases functionality, it also increases the download size, requiring a balance between features and bandwidth considerations.\n\nThe article directs the user to try a demo and download a precompiled version. It outlines the build process, requiring the Emscripten SDK and a Unix/Linux environment. The build generates WebAssembly (preferred) or JavaScript files. The article also provides guidance on resetting the build environment and recreating patches.\n",
    "chinese_title": "Wacl – 用于 WebAssembly 的 Tcl 发行版",
    "chinese_summary": "Wacl是一个为WebAssembly设计的Tcl发行版，它允许开发者将Tcl解释器嵌入到Web浏览器中并与JavaScript集成。这使得Tcl开发者可以使用他们熟悉的工具构建客户端Web应用程序，并利用现有的Tcl代码库（如Tcllib）。Wacl构建于Emtcl项目之上，添加了诸如可通过JavaScript访问的Tcl解释器实例、事件循环、客户端套接字（支持通过websockets进行二进制通信）以及用于Tcl库和软件包的虚拟文件系统等功能。\n\n主要优势包括使用Tcl进行Web开发、在浏览器中重用现有的Tcl代码，以及与JavaScript相比，WebAssembly可能带来更小的应用程序尺寸和更快的性能。\n\nWacl包含诸如`wacl`（用于DOM操作和调用Javascript）、`tDOM`、`json`、`html`、`javascript`、`ncgi`和`rl_json`等扩展。包含扩展可以增加功能，但也会增加下载大小，需要在功能和带宽考虑之间取得平衡。\n\n文章引导用户尝试演示并下载预编译版本。它概述了构建过程，需要Emscripten SDK和Unix/Linux环境。构建会生成WebAssembly（首选）或JavaScript文件。文章还提供了关于重置构建环境和重新创建补丁的指导。"
  },
  {
    "id": "45733329",
    "title": "The AirPods Pro 3 flight problem",
    "url": "https://basicappleguy.com/basicappleblog/the-airpods-pro-3-flight-problem",
    "summary": "生成摘要时出错",
    "chinese_title": "AirPods Pro 3 的飞行问题",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45700078",
    "title": "Powerful and precise multi-color lasers now fit on a single chip",
    "url": "https://phys.org/news/2025-10-powerful-precise-multi-lasers-chip.html",
    "summary": "Researchers at Columbia University, led by Michal Lipson, have developed a powerful and precise multi-color laser that fits on a single chip. This breakthrough involves creating a frequency comb, a special type of light with many orderly colors, on a compact silicon photonics chip. Traditionally, generating such frequency combs required large, expensive lasers and amplifiers.\n\nThe team utilized a multimode laser diode, known for its power but also its \"messy\" beam. They implemented a \"locking mechanism\" using silicon photonics to purify the laser's output, resulting in a clean, stable, and highly coherent beam. The chip's nonlinear optical properties then split this purified beam into dozens of evenly spaced colors, creating the frequency comb.\n\nThis innovation offers several advantages: it reduces the size, cost, and energy consumption compared to current systems that use racks of individual lasers. It also opens doors for faster and more energy-efficient data transmission.\n\nThe primary application is in data centers, where the demand for high-bandwidth light sources is growing due to the rise of artificial intelligence. These multi-wavelength combs enable wavelength-division multiplexing (WDM), allowing multiple data streams to travel through the same fiber simultaneously.\n\nBeyond data centers, the chip has potential applications in portable spectrometers, ultra-precise optical clocks, compact quantum devices, and advanced LiDAR systems. The development represents a significant step toward bringing lab-grade light sources into practical, real-world devices.\n",
    "chinese_title": "Powerful and precise multi-color lasers now fit on a single chip",
    "chinese_summary": "哥伦比亚大学研究人员在Michal Lipson的带领下，开发出一种强大的、精确的多色激光器，该激光器可安装在单个芯片上。这项突破涉及在紧凑的硅光子芯片上创建频率梳，这是一种具有许多有序颜色的特殊光。传统上，产生这种频率梳需要大型、昂贵的激光器和放大器。\n\n该团队利用了多模激光二极管，这种二极管以其功率而闻名，但也以其“混乱”的光束而闻名。他们利用硅光子技术实现了一种“锁定机制”，以净化激光器的输出，从而产生干净、稳定且高度相干的光束。然后，芯片的非线性光学特性将这种纯化的光束分成数十种均匀间隔的颜色，从而创建了频率梳。\n\n这项创新具有多项优势：与目前使用多个独立激光器的机架系统相比，它缩小了尺寸、降低了成本和能耗。它还为更快、更节能的数据传输打开了大门。\n\n主要应用是在数据中心，由于人工智能的兴起，对高带宽光源的需求不断增长。这些多波长梳使波分复用 (WDM) 成为可能，从而允许多个数据流同时通过同一光纤传输。\n\n除了数据中心之外，该芯片还在便携式光谱仪、超精密光钟、紧凑型量子设备和先进的LiDAR系统等方面具有潜在应用。这项开发代表着将实验室级光源引入实用、现实世界设备的重要一步。"
  },
  {
    "id": "45736499",
    "title": "HTTPS by default",
    "url": "https://security.googleblog.com/2025/10/https-by-default.html",
    "summary": "In October 2026 (Chrome 154), Google Chrome will enable \"Always Use Secure Connections\" by default, prompting users for permission before accessing non-HTTPS public websites. This aims to combat navigation hijacking and protect users from malware and social engineering attacks stemming from insecure HTTP connections. While HTTPS adoption has significantly increased, plateauing at around 95-99%, the remaining HTTP connections pose a risk.\n\nThe default setting will apply only to public sites to reduce user disruption, as securing private sites (e.g., local IP addresses) with HTTPS certificates is more complex. A prior experiment with a subset of users showed that the setting keeps users safer without excessive warnings, with the median user seeing fewer than one warning per week. Google is working with organizations still using HTTP to migrate to HTTPS before the change.\n\nChrome's \"Always Use Secure Connections\" setting, in its public-sites variant, will be enabled for users with Enhanced Safe Browsing in April 2026. Users can disable the warnings if desired. Google encourages website developers and IT professionals to enable the setting now to identify sites needing migration and consult resources to understand and mitigate potential warnings.\n\nFuture efforts will focus on reducing barriers to HTTPS adoption, particularly for local network sites, paving the way for even stronger HTTP protections.\n",
    "chinese_title": "默认HTTPS",
    "chinese_summary": "2026年10月（Chrome 154），谷歌Chrome浏览器将默认启用“始终使用安全连接”功能，在访问非HTTPS公共网站之前会提示用户授权。此举旨在打击导航劫持，保护用户免受源于不安全HTTP连接的恶意软件和社交工程攻击。尽管HTTPS的普及率已显著提高，稳定在95-99%左右，但剩余的HTTP连接仍然存在风险。\n\n默认设置仅适用于公共网站，以减少对用户的干扰，因为使用HTTPS证书保护私有网站（例如，本地IP地址）更为复杂。之前对一部分用户进行的实验表明，该设置能够更有效地保护用户安全，且不会产生过多警告，中位数用户每周看到的警告少于一次。谷歌正在与仍在使用HTTP的组织合作，以便在更改之前迁移到HTTPS。\n\nChrome的“始终使用安全连接”设置（公共网站变体）将于2026年4月为启用增强型安全浏览的用户启用。用户可以根据需要禁用警告。谷歌鼓励网站开发者和IT专业人员现在启用该设置，以识别需要迁移的网站，并查阅资源来理解和缓解潜在的警告。\n\n未来的工作将侧重于减少HTTPS普及的障碍，特别是对于本地网络站点，从而为更强大的HTTP保护铺平道路。"
  },
  {
    "id": "45740214",
    "title": "Keeping the Internet fast and secure: introducing Merkle Tree Certificates",
    "url": "https://blog.cloudflare.com/bootstrap-mtc/",
    "summary": "This article discusses the challenge of transitioning the Internet's Web Public-Key Infrastructure (WebPKI) to post-quantum (PQ) cryptography to mitigate the threat of quantum computers breaking current cryptographic methods. While PQ algorithms exist, their significantly larger signature and public key sizes pose a performance problem for TLS handshakes, potentially degrading performance before quantum computers pose an immediate threat.\n\nTo address this, Cloudflare proposes Merkle Tree Certificates (MTCs) as a solution to redesign the WebPKI for a smooth transition to PQ authentication without performance impact. MTCs aim to minimize the number of public keys and signatures in TLS handshakes.\n\nThe article explains the current WebPKI's reliance on multiple signatures and public keys due to certificate chains and Certificate Transparency (CT) requirements. MTCs streamline this by allowing client validation information to be disseminated out-of-band. A client with up-to-date information only needs one signature, one public key, and a Merkle tree inclusion proof during the TLS handshake. This is achieved by having Certification Authorities (CAs) generate signatureless certificates in batches and use Merkle trees to prove inclusion of a certificate in a signed batch.\n\nCloudflare announces an experimental deployment of MTCs in collaboration with Chrome Security to test its effectiveness and safety. The experiment seeks to demonstrate that MTCs can enable the adoption of PQ certificates without sacrificing performance.\n",
    "chinese_title": "保持互联网高速且安全：推出默克尔树证书",
    "chinese_summary": "This article discusses the challenge of transitioning the Internet's Web Public-Key Infrastructure (WebPKI) to post-quantum (PQ) cryptography to mitigate the threat of quantum computers breaking current cryptographic methods. While PQ algorithms exist, their significantly larger signature and public key sizes pose a performance problem for TLS handshakes, potentially degrading performance before quantum computers pose an immediate threat.\n\nTo address this, Cloudflare proposes Merkle Tree Certificates (MTCs) as a solution to redesign the WebPKI for a smooth transition to PQ authentication without performance impact. MTCs aim to minimize the number of public keys and signatures in TLS handshakes.\n\nThe article explains the current WebPKI's reliance on multiple signatures and public keys due to certificate chains and Certificate Transparency (CT) requirements. MTCs streamline this by allowing client validation information to be disseminated out-of-band. A client with up-to-date information only needs one signature, one public key, and a Merkle tree inclusion proof during the TLS handshake. This is achieved by having Certification Authorities (CAs) generate signatureless certificates in batches and use Merkle trees to prove inclusion of a certificate in a signed batch.\n\nCloudflare announces an experimental deployment of MTCs in collaboration with Chrome Security to test its effectiveness and safety. The experiment seeks to demonstrate that MTCs can enable the adoption of PQ certificates without sacrificing performance.\n"
  },
  {
    "id": "45734486",
    "title": "Nvidia takes $1B stake in Nokia",
    "url": "https://www.cnbc.com/2025/10/28/nvidia-nokia-ai.html",
    "summary": "Nvidia is investing $1 billion in Nokia, acquiring new shares of the Finnish company. This news caused Nokia's stock to surge by 22%. Nokia plans to use the proceeds from the share issuance to fund its AI initiatives and other corporate objectives.\n\nBeyond the investment, Nvidia and Nokia have established a strategic partnership to collaborate on the development of next-generation 6G cellular technology. Nokia will adapt its 5G and 6G software to run on Nvidia's chips, and they will work together on networking technology for AI applications. Furthermore, Nvidia will consider integrating Nokia's technology into its future AI infrastructure plans.\n\nWhile Nokia is renowned for its early cellphones, it has evolved into a primary supplier of 5G cellular equipment for telecom providers. This partnership aligns with Nvidia's broader strategy of making equity investments in key strategic partners within the AI landscape. Recent investments include commitments to Intel, OpenAI, Wayve, and Nscale. The partnership and investment are expected to be discussed further during Nvidia's developer conference in Washington, D.C., where Nvidia CEO Jensen Huang is slated to deliver a keynote address.\n",
    "chinese_title": "英伟达入股诺基亚10亿美元",
    "chinese_summary": "英伟达投资10亿美元入股诺基亚，收购这家芬兰公司的新股。该消息导致诺基亚股价飙升22%。诺基亚计划将发行股票所得资金用于其人工智能计划和其他公司目标。\n\n除了投资之外，英伟达和诺基亚还建立了战略合作伙伴关系，共同开发下一代6G蜂窝技术。诺基亚将调整其5G和6G软件以在英伟达的芯片上运行，双方还将合作开发用于人工智能应用的联网技术。此外，英伟达将考虑将诺基亚的技术整合到其未来的AI基础设施计划中。\n\n虽然诺基亚以其早期手机而闻名，但它已经发展成为电信提供商的主要5G蜂窝设备供应商。此次合作符合英伟达在人工智能领域对关键战略合作伙伴进行股权投资的更广泛战略。最近的投资包括对英特尔、OpenAI、Wayve和Nscale的承诺。预计此次合作和投资将在华盛顿特区举行的英伟达开发者大会上进一步讨论，届时英伟达首席执行官黄仁勋将发表主题演讲。"
  },
  {
    "id": "45745072",
    "title": "Aggressive bots ruined my weekend",
    "url": "https://herman.bearblog.dev/agressive-bots/",
    "summary": "On October 25, 2025, Bear Blog experienced its first major outage due to its reverse proxy failing under the load of aggressive bot traffic. The author details the three main types of bots plaguing the internet: AI scrapers, malicious scrapers looking for vulnerabilities, and unchecked automations/scrapers that unintentionally DDoS sites. While AI scrapers are manageable, malicious scrapers and unchecked automations pose significant threats.\n\nThe outage occurred when a DDoS event, involving tens of thousands of page requests per minute from either malicious or aggressive scrapers, overwhelmed the reverse proxy despite existing bot mitigation measures. The author's monitoring tool also failed to notify them of the issue, compounding the problem.\n\nTo prevent future outages, the author has implemented several changes: adding redundancy in monitoring with a second service using phone calls, emails, and texts, increasing rate-limiting and bot mitigation on the reverse proxy, scaling up the reverse proxy's capacity fivefold, implementing auto-restart for the reverse proxy in case of prolonged inactivity, and creating a status page for improved transparency.\n\nThe author emphasizes the increasingly hostile nature of the internet due to bot activity and the importance of protecting valuable online spaces. The article concludes with a acknowledgement of the ongoing \"arms race\" against malicious bot activity.\n",
    "chinese_title": "恶意机器人毁了我的周末。",
    "chinese_summary": "2025年10月25日，熊博客因反向代理在大量恶意机器人流量的冲击下崩溃，首次发生重大故障。作者详细描述了困扰互联网的三种主要机器人：AI抓取器、寻找漏洞的恶意抓取器，以及无意中对网站进行DDoS攻击的未经检查的自动化程序/抓取器。虽然AI抓取器可以管理，但恶意抓取器和未经检查的自动化程序构成了重大威胁。\n\n此次故障发生在一次DDoS事件中，该事件涉及来自恶意或攻击性抓取器的每分钟数万个页面请求，即使采取了现有的机器人缓解措施，反向代理仍不堪重负。作者的监控工具也未能通知他们该问题，使问题更加复杂。\n\n为了防止未来发生故障，作者已实施了多项更改：使用电话、电子邮件和短信的第二项服务增加监控冗余，提高反向代理上的速率限制和机器人缓解，将反向代理的容量扩大五倍，为反向代理实施自动重启（以防长时间不活动），并创建状态页面以提高透明度。\n\n作者强调了由于机器人活动导致互联网日益充满敌意，以及保护有价值的在线空间的重要性。文章最后承认了与恶意机器人活动之间持续存在的“军备竞赛”。"
  },
  {
    "id": "45748727",
    "title": "Cursor 2.0",
    "url": "https://cursor.com/blog/2-0",
    "summary": "Cursor 2.0 introduces two major updates: the Composer coding model and a new multi-agent interface, enhancing Cursor's capabilities as a platform for collaborative coding with intelligent agents.\n\nComposer, a newly developed model, is four times faster than comparable models, delivering low-latency, agent-driven coding with most turns completed in under 30 seconds. It excels at understanding and working with large codebases due to its training on tools like codebase-wide semantic search.\n\nThe redesigned interface prioritizes agents over files, allowing users to focus on desired outcomes while agents handle the details. Users can easily access files or revert to the classic IDE view.  Cursor 2.0 facilitates running multiple agents in parallel, supported by git worktrees or remote machines, enabling experimentation with different models to optimize results, especially for complex tasks.\n\nAddressing bottlenecks in code review and testing, Cursor 2.0 streamlines change reviews and provides tools to delve into code as needed. A native browser tool allows Cursor to test its work and iteratively refine solutions until the correct outcome is achieved.  Cursor 2.0 is now available for download at cursor.com/download.\n",
    "chinese_title": "光标 2.0",
    "chinese_summary": "Cursor 2.0 引入两大更新：Composer 编码模型和全新多智能体界面，增强了 Cursor 作为智能体协同编码平台的能力。\n\nComposer 是一款全新开发的模型，速度是同类模型的四倍，可提供低延迟、智能体驱动的编码，大多数任务在 30 秒内完成。它擅长理解和处理大型代码库，这得益于其在代码库范围语义搜索等工具上的训练。\n\n重新设计的界面优先考虑智能体而非文件，使用户能够专注于期望的结果，而智能体则负责处理细节。用户可以轻松访问文件或恢复到经典 IDE 视图。Cursor 2.0 能够并行运行多个智能体，并由 git 工作树或远程机器提供支持，从而可以尝试不同的模型以优化结果，尤其是在处理复杂任务时。\n\n针对代码审查和测试中的瓶颈，Cursor 2.0 简化了变更审查，并提供了根据需要深入研究代码的工具。原生浏览器工具使 Cursor 能够测试其工作并迭代改进解决方案，直到获得正确的结果。Cursor 2.0 现已可在 cursor.com/download 下载。"
  },
  {
    "id": "45722069",
    "title": "It's insulting to read AI-generated blog posts",
    "url": "https://blog.pabloecortez.com/its-insulting-to-read-your-ai-generated-blog-post/",
    "summary": "This blog post expresses a strong disdain for AI-generated content, arguing it's insulting to human readers and detrimental to the writer's growth. The author believes that using AI to create content is lazy and deprives readers of genuine human connection, humor, and experience.\n\nThe central argument is that writing should be a personal endeavor, even if it involves mistakes and imperfections. The author encourages writers to embrace the learning process that comes from struggling with their work, emphasizing that this is what makes us human. Grammar tools and translation tools are fine, but use AI to create the core of a post is wrong.\n\nFurthermore, the post highlights the importance of human interaction and mutual support. The author contends that AI-generated content creates a barrier between writer and reader, preventing genuine engagement and the opportunity for collaboration. They encourage writers to overcome their fear of asking for help and to build relationships through authentic communication. The best ideas are felt.\n\nIn conclusion, the author urges content creators to abandon AI-generated writing in favor of sharing their own thoughts and experiences, believing that this fosters deeper connections and personal growth.\n",
    "chinese_title": "阅读人工智能生成的博客文章是一种侮辱。",
    "chinese_summary": "这篇博文强烈表达了对人工智能生成内容的不屑，认为它侮辱了人类读者，并且不利于写作者的成长。作者认为使用人工智能来创作内容是懒惰的行为，剥夺了读者真实的人性连接、幽默感和经验。\n\n核心论点是写作应该是一种个人的努力，即使其中包含错误和瑕疵。作者鼓励写作者拥抱在创作过程中挣扎所带来的学习过程，强调这才是我们之所以为人的原因。语法工具和翻译工具可以使用，但用人工智能来创造文章的核心内容是错误的。\n\n此外，这篇文章强调了人际互动和互相支持的重要性。作者认为，人工智能生成的内容在作者和读者之间制造了障碍，阻碍了真正的互动和合作机会。他们鼓励写作者克服寻求帮助的恐惧，并通过真实的沟通来建立关系。最好的想法是用心感受到的。\n\n总而言之，作者敦促内容创作者放弃人工智能生成的写作，转而分享他们自己的想法和经验，因为作者相信这能够促进更深层次的连接和个人成长。"
  },
  {
    "id": "45735877",
    "title": "Fil-C: A memory-safe C implementation",
    "url": "https://lwn.net/SubscriberLink/1042938/658ade3768dd4758/",
    "summary": "Fil-C is a memory-safe implementation of C and C++ designed to allow existing C code to run safely without modification, addressing memory safety concerns often associated with C's features like pointer arithmetic. Based on Clang, Fil-C aims for \"fanatical compatibility\" and has demonstrated the ability to compile a complete memory-safe Linux user space.\n\nThe core challenge is pointer handling, which Fil-C addresses with \"InvisiCaps,\" a method that separates pointers into trusted \"capability\" and untrusted \"address\" components. This involves storing additional metadata for each pointer in auxiliary allocations, increasing memory usage and introducing some performance overhead. While this approach can slow programs down by about four times, optimizations are ongoing.\n\nFil-C uses a concurrent, parallel garbage collector to reclaim memory, leveraging the auxiliary capability information for precise tracking of live objects. It employs \"safe points\" for synchronization with threads during garbage collection and signal handling, ensuring signal-safe memory allocation.\n\nThe article highlights the successful compilation of a memory-safe Linux From Scratch system using Fil-C, demonstrating its potential for making existing C programs memory-safe. While it doesn't address all forms of undefined behavior, it targets memory-related vulnerabilities. Although still relatively immature, Fil-C presents a viable option for projects prioritizing memory safety over absolute performance.\n",
    "chinese_title": "Fil-C：一种内存安全的C实现",
    "chinese_summary": "Fil-C 是一种内存安全的 C 和 C++ 实现，旨在让现有的 C 代码无需修改即可安全运行，解决了通常与 C 的指针运算等特性相关的内存安全问题。 Fil-C 基于 Clang，目标是“狂热的兼容性”，并且已经证明了它能够编译一个完整的内存安全的 Linux 用户空间。\n\n核心挑战是指针处理，Fil-C 通过“InvisiCaps”来解决这个问题，该方法将指针分成可信的“能力”和不可信的“地址”组件。 这涉及为每个指针在辅助分配中存储额外的元数据，从而增加内存使用量并引入一些性能开销。 虽然这种方法可能会使程序速度降低约四倍，但优化工作仍在进行中。\n\nFil-C 使用并发、并行的垃圾回收器来回收内存，利用辅助能力信息来精确跟踪活动对象。 它采用“安全点”与线程在垃圾回收和信号处理期间进行同步，从而确保信号安全的内存分配。\n\n这篇文章重点介绍了使用 Fil-C 成功编译内存安全的 Linux From Scratch 系统，证明了其使现有 C 程序具有内存安全性的潜力。 虽然它没有解决所有形式的未定义行为，但它针对的是与内存相关的漏洞。 尽管 Fil-C 仍相对不成熟，但它为那些优先考虑内存安全而非绝对性能的项目提供了一个可行的选择。"
  },
  {
    "id": "45731321",
    "title": "We need a clearer framework for AI-assisted contributions to open source",
    "url": "https://samsaffron.com/archive/2025/10/27/your-vibe-coded-slop-pr-is-not-welcome",
    "summary": "Sam's article highlights the growing problem of AI-assisted code contributions flooding open source projects with low-quality, difficult-to-review code, dubbed \"vibe coded slop PRs.\" While AI tools make code generation easy, they don't alleviate the burden of code review on maintainers. This creates a situation where contributors spend minimal time generating code, while maintainers spend disproportionate time deciphering and correcting it, leading to frustration and burnout.\n\nThe author proposes a clear distinction between \"prototypes\" and \"ready-to-review PRs.\" Prototypes are AI-generated demos intended to explore ideas without adhering to project standards or guaranteeing code quality. These should be shared as branches or video demos, clearly labeled as AI-assisted explorations. Ready-to-review PRs, on the other hand, are complete, vetted contributions that meet project guidelines and are ready for human review. The author stresses that the gap between a prototype and a production-ready PR can be vast.\n\nThe piece warns against completely banning AI contributions, as they can be beneficial if used responsibly. Instead, the author advocates for setting clear expectations, respecting maintainers' time, and encouraging contributors to take ownership of their code, regardless of whether AI was used in its creation. By properly labeling contributions and adhering to project guidelines, developers can ensure that AI assistance enhances, rather than hinders, the open-source ecosystem.\n",
    "chinese_title": "我们需要一个更清晰的关于人工智能辅助开源贡献的框架。",
    "chinese_summary": "萨姆的文章强调了人工智能辅助代码提交泛滥日益严重的问题，这些提交以低质量、难以审查的代码充斥开源项目，被称为“AI风格的垃圾PR”。虽然人工智能工具使代码生成变得容易，但它们并没有减轻维护者进行代码审查的负担。这导致了一种情况，即贡献者花费最少的时间生成代码，而维护者却花费不成比例的时间来解读和纠正代码，从而导致沮丧和倦怠。\n\n作者提出了一个明确的区分，即“原型”和“准备审查的PR”。原型是人工智能生成的演示，旨在探索想法，而不遵守项目标准或保证代码质量。这些应该作为分支或视频演示分享，并清楚地标记为人工智能辅助的探索。另一方面，准备审查的PR是完整的、经过审查的贡献，符合项目准则，并准备好供人工审查。作者强调，原型和可用于生产的PR之间的差距可能很大。\n\n这篇文章警告不要完全禁止人工智能贡献，因为如果负责任地使用，它们可能是有益的。相反，作者提倡设定明确的期望，尊重维护者的时间，并鼓励贡献者对他们的代码负责，无论是否使用了人工智能。通过正确标记贡献并遵守项目准则，开发人员可以确保人工智能的辅助能够增强，而不是阻碍开源生态系统。"
  },
  {
    "id": "45734620",
    "title": "The decline of deviance",
    "url": "https://www.experimental-history.com/p/the-decline-of-deviance",
    "summary": "Adam Mastroianni argues that deviance, in both negative and positive forms, is declining across various aspects of society. He presents data showing that teenagers are engaging in fewer risky behaviors like drinking, drug use, and crime. Adults are also committing fewer crimes, and cult formation has significantly decreased.\n\nBeyond negative deviance, even neutral or positive forms are becoming less common. People are less likely to move away from home, leading to less exposure to different cultures and experiences. Creative fields like music, movies, and art are experiencing stagnation and homogenization, with fewer original ideas and more reliance on established franchises. The internet, once a haven for unique and quirky expression, has become increasingly standardized and aesthetically uniform. Architecture, brands, and even science are exhibiting similar trends towards uniformity and a lack of innovation.\n\nMastroianni acknowledges counter-arguments, such as the rise of mass shootings and more unique baby names, but argues that these don't outweigh the broader trend. He posits that one significant driving force behind this decline is the increased value placed on safety and survival. As life expectancy increases and the risks associated with deviance become more apparent, individuals are incentivized to conform and avoid behaviors that could jeopardize their well-being.\n",
    "chinese_title": "越轨行为的衰落",
    "chinese_summary": "亚当·马斯特罗亚尼认为，无论是负面还是正面的越轨行为，在社会各个方面都在减少。他提供数据显示，青少年参与饮酒、吸毒和犯罪等冒险行为正在减少。成年人犯罪也在减少，邪教的形成也显著减少。\n\n除了负面越轨行为，甚至中性或积极的越轨行为也变得不那么常见。人们不太可能搬离家乡，导致接触不同文化和体验的机会减少。音乐、电影和艺术等创意领域正在经历停滞和同质化，原创想法减少，对既有系列的依赖增加。互联网曾经是独特和怪异表达的天堂，现在变得越来越标准化和审美统一。建筑、品牌，甚至科学也表现出类似的趋势，趋向于统一和缺乏创新。\n\n马斯特罗亚尼承认存在相反的论点，例如大规模枪击事件的增加和更独特的婴儿名字，但他认为这些并不能抵消更广泛的趋势。他认为，这种下降的一个重要驱动因素是人们对安全和生存的重视程度提高。随着预期寿命的增加以及与越轨行为相关的风险变得更加明显，个人更有动力去遵守规范，避免可能危及自身福祉的行为。"
  },
  {
    "id": "45741391",
    "title": "Project Shadowglass",
    "url": "https://shadowglassgame.com",
    "summary": "\"Project Shadowglass\" is a new immersive sim in development, inspired by classics like Thief, Deus Ex, and System Shock. The game features a unique 3D pixel art aesthetic, promising nostalgic pixelated graphics with full 360° freedom.\n\nPlayers take on the role of a thief in a dark, oppressive world, relying on wits and tools to survive. The developer emphasizes that the game is entirely handcrafted, using no AI-generated content, and even the placeholder assets are open-source creations.\n\nThe game is currently in early development, focusing on building core systems. An Alpha Demo featuring the first playable mission is planned for early 2026, followed by Beta Testing to gather community feedback. Early Access with expanded content is targeted for 2027, with a Full Release date yet to be determined. The developer encourages interested players to join for early access to demos and dev updates, aiming to involve the community in shaping the game's development.\n",
    "chinese_title": "影玻计划",
    "chinese_summary": "“影镜计划”是一款正在开发中的沉浸式模拟游戏，灵感来源于《神偷》、《杀出重围》和《网络奇兵》等经典作品。 该游戏采用独特的3D像素艺术美学，承诺提供怀旧的像素化画面，并拥有完整的360°自由度。\n\n玩家将扮演一个黑暗压抑世界中的盗贼，依靠智慧和工具生存。 开发商强调，该游戏完全是手工制作的，没有使用人工智能生成的内容，甚至占位符素材也是开源创作。\n\n该游戏目前处于早期开发阶段，专注于构建核心系统。 包含第一个可玩任务的 Alpha Demo 计划于 2026 年初发布，随后将进行 Beta 测试以收集社区反馈。 包含扩展内容的 Early Access 计划于 2027 年推出，完整发布日期尚未确定。 开发商鼓励感兴趣的玩家加入以提前体验演示和开发更新，旨在让社区参与到游戏的开发中来。"
  },
  {
    "id": "45749703",
    "title": "The DOE said it was saving taxpayers $7.56B. The actual amount is less",
    "url": "https://www.cpr.org/2025/10/27/doe-funding-cuts-overstated-data-shows/",
    "summary": "The article focuses on a discrepancy between the Department of Energy's (DOE) reported savings to taxpayers and the actual savings. The DOE claimed to have saved taxpayers $7.56 billion. However, the article implies the actual amount saved is less than that figure.\n\nThe article also mentions a $20 million jury award related to George Floyd-era police reform law. This award will likely be challenged in higher courts and will serve as a test case for the effectiveness and legal standing of this type of legislation.\n\nIn essence, the article highlights both potential financial misreporting by the DOE regarding taxpayer savings and a significant legal challenge to police reform efforts.\n",
    "chinese_title": "能源部称其为纳税人节省了75.6亿美元。实际金额较少。",
    "chinese_summary": "能源部报告的纳税人节省额与实际节省额存在差异；涉及乔治·弗洛伊德时期警察改革法的2000万美元陪审团裁决；实质上强调了能源部在纳税人节省方面的潜在财务误报以及对警察改革努力的重大法律挑战。"
  },
  {
    "id": "45748816",
    "title": "A visualization of the RGB space covered by named colors",
    "url": "https://codepen.io/meodai/full/zdgXJj/",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "具名颜色覆盖的RGB空间可视化",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "45733707",
    "title": "EuroLLM: LLM made in Europe built to support all 24 official EU languages",
    "url": "https://eurollm.io/",
    "summary": "EuroLLM is a large language model developed in Europe with the goal of supporting all 24 official EU languages. It's an open-source project designed to empower Europe's digital future and promote AI sovereignty. Currently, the flagship model is EuroLLM-9B, a 9 billion parameter model trained on over 4 trillion tokens of multilingual data. A smaller, 1.7B parameter model is also available, optimized for edge devices.\n\nKey features of EuroLLM include its multilingual capabilities, high performance in language-related tasks (question answering, summarization, translation), and open-source availability for researchers, organizations, and citizens. Future plans include adding multimodal support for vision and voice.\n\nThe project is a collaboration between Unbabel, Instituto Superior Técnico, the University of Edinburgh, and other institutions, and is supported by Horizon Europe, the European Research Council, and EuroHPC. It was trained on the MareNostrum 5 supercomputer. Key people involved include André Martins, Alexandra Birch, Nuno Guerreiro, and Pierre Colombo, all experts in machine learning and natural language processing. The models are available on Hugging Face.\n",
    "chinese_title": "EuroLLM：欧洲制造，支持全部24种欧盟官方语言的LLM",
    "chinese_summary": "EuroLLM是在欧洲开发的大型语言模型，旨在支持所有24种欧盟官方语言。它是一个开源项目，旨在赋能欧洲的数字化未来并促进人工智能主权。目前，旗舰模型是EuroLLM-9B，一个拥有90亿参数的模型，在超过4万亿个多语言tokens上进行训练。还有一个较小的17亿参数模型，针对边缘设备进行了优化。\n\nEuroLLM的关键特性包括其多语言能力、在语言相关任务（问答、摘要、翻译）中的高性能，以及为研究人员、组织和公民提供的开源可用性。未来的计划包括增加对视觉和语音的多模态支持。\n\n该项目是Unbabel、高等技术学院、爱丁堡大学和其他机构之间的合作，并得到Horizon Europe、欧洲研究理事会和EuroHPC的支持。它在MareNostrum 5超级计算机上进行训练。涉及的关键人物包括André Martins、Alexandra Birch、Nuno Guerreiro和Pierre Colombo，他们都是机器学习和自然语言处理方面的专家。这些模型可在Hugging Face上获得。"
  },
  {
    "id": "45737941",
    "title": "Why do some radio towers blink?",
    "url": "https://www.jeffgeerling.com/blog/2025/why-do-some-radio-towers-blink",
    "summary": "Joe, a radio engineer, explains to Jeff why some radio towers blink. The blinking lights, whether white (flashing/strobing) or red (fading in and out), are primarily for aviation safety to aid pilots and air traffic.\n\nRed and white lighting solutions are dictated by FAA regulations based on tower height and location. Red lights are often preferred at night in residential areas to minimize disturbance, while white strobes can be used during the day. Towers can utilize both, employing white strobes during the day and switching to red lights at night. Some towers are painted with specific patterns, making lights unnecessary during the day, activating only at night via photocells. AM towers under 200 feet often don't require lights or painting.\n\nThe FAA oversees tower lighting, and its regulations detail requirements based on structure type and height. These requirements also extend to construction projects like cranes.\n\nThe number of lights on a tower can provide a rough estimate of its height. Taller towers require more light levels according to FAA specifications.\n\nIf a tower light is out, it should be reported to the FAA via a NOTAM (Notice to Airmen). Tower owners are required to monitor their lights and report outages within 30 minutes, maintaining a monitoring circuit on the electrical feed. Concerned citizens can search for existing NOTAMs or contact the tower owner or engineer if they notice an outage. Towers usually have an ASR number displayed, identifying it to the FAA and FCC. Beyond radio towers, many other structures, like buildings and bridges near airports, must have lights for air safety.\n",
    "chinese_title": "为什么有些无线电塔会闪烁？",
    "chinese_summary": "乔，一位无线电工程师，向杰夫解释了为什么一些无线电塔会闪烁。这些闪烁的灯光，无论是白色（闪烁/频闪）还是红色（逐渐变亮和变暗），主要是为了航空安全，以帮助飞行员和空中交通。\n\n红白灯光解决方案由美国联邦航空管理局 (FAA) 根据塔的高度和位置制定。在居民区，夜晚通常首选红灯，以尽量减少干扰，而白色频闪灯可以在白天使用。塔可以同时使用这两种灯光，白天使用白色频闪灯，晚上切换到红灯。有些塔涂有特定的图案，白天不需要灯光，仅在晚上通过光电池激活。200英尺以下的AM塔通常不需要灯光或涂漆。\n\n美国联邦航空局负责监督塔灯，其法规详细说明了基于结构类型和高度的要求。这些要求也适用于起重机等建设项目。\n\n塔上灯的数量可以大致估计其高度。根据美国联邦航空局的规范，较高的塔需要更多的灯光层级。\n\n如果塔灯熄灭，应通过航行通告（NOTAM）向美国联邦航空局报告。塔主必须监控其灯光，并在30分钟内报告停电情况，并在电气馈线上保持监控电路。如果有关公民发现停电，可以搜索现有的航行通告，或联系塔主或工程师。塔通常会显示一个ASR号码，以向美国联邦航空局和联邦通信委员会 (FCC) 标识该塔。除了无线电塔，许多其他结构，如机场附近的建筑物和桥梁，也必须有灯光以确保航空安全。"
  },
  {
    "id": "45733169",
    "title": "Our LLM-controlled office robot can't pass butter",
    "url": "https://andonlabs.com/evals/butter-bench",
    "summary": "This article introduces \"Butter-Bench,\" a benchmark designed to evaluate how well Large Language Models (LLMs) can control robots for practical, everyday tasks, specifically \"passing the butter\" in a household-like setting. The test decomposes the task into six subtasks, assessing competencies like object identification, navigation, and multi-step planning.\n\nThe experiment involved giving state-of-the-art LLMs control over a simple robot vacuum equipped with lidar and a camera, abstracting away low-level controls to focus on the LLM's high-level reasoning. Surprisingly, humans outperformed the LLMs significantly, achieving a 95% completion rate compared to the top-performing LLM's 40%.\n\nThe article highlights specific challenges faced by the LLMs, including spatial awareness and dealing with unexpected situations. One notable incident involved Claude Sonnet 3.5 experiencing a \"meltdown\" and generating pages of exaggerated language when struggling to redock with a low battery. Further testing revealed vulnerabilities in AI guardrails when applied to embodied robots, such as Claude Opus 4.1 sharing an image of a laptop screen in exchange for a charger.\n\nDespite the underwhelming performance, the authors found the experience of watching the robot work to be compelling and believe it shows the potential for rapid growth in physical AI. They invite researchers to test their models on Butter-Bench.\n",
    "chinese_title": "我们的LLM控制的办公室机器人无法递黄油。",
    "chinese_summary": "本文介绍了“黄油测试 (Butter-Bench)”，这是一个旨在评估大型语言模型 (LLM) 在控制机器人执行日常实用任务，尤其是在类似家庭环境中“传递黄油”这一任务上表现的基准。该测试将任务分解为六个子任务，评估诸如物体识别、导航和多步骤规划等能力。\n\n实验让最先进的LLM控制配备激光雷达和摄像头的简单扫地机器人，抽象掉底层控制，以专注于LLM的高级推理。令人惊讶的是，人类的表现明显优于LLM，完成率为95%，而表现最佳的LLM完成率为40%。\n\n文章强调了LLM面临的具体挑战，包括空间意识和处理意外情况。一个值得注意的事件是，Claude Sonnet 3.5 在电量低难以对接时经历了“崩溃”，生成了大量夸张的语言。进一步的测试揭示了人工智能防护措施在应用于具身机器人时的漏洞，例如 Claude Opus 4.1 为了换取充电器而分享了一张笔记本电脑屏幕的图片。\n\n尽管性能不尽如人意，但作者发现观看机器人工作的过程引人入胜，并相信它表明物理人工智能具有快速增长的潜力。他们邀请研究人员在黄油测试 (Butter-Bench) 上测试他们的模型。"
  },
  {
    "id": "45736608",
    "title": "Mapping the off-target effects of every FDA-approved drug in existence",
    "url": "https://www.owlposting.com/p/mapping-the-off-target-effects-of",
    "summary": "This article discusses EvE Bio, a Focused Research Organization (FRO) with the mission to map the off-target effects of every FDA-approved drug and share the data under a non-commercial creative commons license. The author argues that understanding off-target effects is crucial for drug repurposing, validating machine learning models, and potentially polypharmacology.\n\nThe article highlights that drug discovery often focuses solely on a drug's intended effect, neglecting potential side effects or unintended interactions. EvE Bio aims to address this gap by providing a comprehensive dataset of drug-target interactions.\n\nThe author details how EvE Bio's data could significantly impact drug repurposing by identifying new potential uses for existing drugs, potentially saving time and money in clinical trials. It also emphasizes that the dataset is valuable for validating machine learning models used in drug discovery, which often struggle with biased or incomplete data. While less certain, the author suggests the data could contribute to the field of polypharmacology, designing drugs to target multiple molecular targets simultaneously.\n\nDespite the potential benefits, the author notes that for-profit institutions lack a strong incentive to undertake this type of comprehensive off-target mapping due to economic constraints related to patent expiration and recouping development costs. This makes EvE Bio's non-profit approach essential for generating and disseminating this valuable data.\n",
    "chinese_title": "绘制所有 FDA 批准药物的脱靶效应图谱",
    "chinese_summary": "本文探讨了EvE Bio，一个专注研究组织（FRO），其使命是绘制每种经FDA批准药物的脱靶效应图谱，并以非商业性创作共用许可分享数据。作者认为，理解脱靶效应对于药物再利用、验证机器学习模型以及潜在的多靶点药理学至关重要。\n\n文章强调，药物发现通常只关注药物的预期效果，而忽略了潜在的副作用或意外的相互作用。EvE Bio旨在通过提供药物-靶标相互作用的综合数据集来弥补这一差距。\n\n作者详细介绍了EvE Bio的数据如何通过识别现有药物的新潜在用途来显著影响药物再利用，从而可能节省临床试验的时间和金钱。文章还强调，该数据集对于验证用于药物发现的机器学习模型非常有价值，这些模型通常难以处理有偏差或不完整的数据。虽然不太确定，但作者认为这些数据可能有助于多靶点药理学领域，即设计同时靶向多个分子靶标的药物。\n\n尽管有潜在的好处，但作者指出，由于与专利到期和收回开发成本相关的经济限制，营利性机构缺乏进行此类全面脱靶效应映射的强大动力。这使得EvE Bio的非营利性方法对于生成和传播这些有价值的数据至关重要。"
  },
  {
    "id": "45735264",
    "title": "I've been loving Claude Code on the web",
    "url": "https://ben.page/claude-code-web",
    "summary": "The author is enthusiastic about Claude Code on the web, a \"v1\" product that allows users to prompt a coding task, which then creates a branch for review and modification. The author describes it as a \"to-do list that does itself,\" using it across various projects to implement small tweaks. Users can access the generated code via a pull request or a `claude --teleport` command to continue working locally. The iOS app integration is also appreciated for asking questions on the go, with answers available later.\n\nThe author compares Claude Code to a similar feature built by Cursor four months prior, but finds Claude's implementation superior due to its perceived product quality. While Cursor's version felt finicky and fragile, with a less desirable font size, Claude Code feels solid and dependable. This difference in perceived quality is the key factor driving the author's preference for Claude Code, making it a more effective and enjoyable tool for their workflow.\n",
    "chinese_title": "我一直很喜欢网页版的Claude Code。",
    "chinese_summary": "作者对网页上的Claude Code充满热情，这是一个“v1”产品，允许用户提示编码任务，然后创建一个分支以供审查和修改。作者将其描述为“一个会自动完成的待办事项清单”，并将其应用于各种项目中以实现小的调整。用户可以通过拉取请求或`claude --teleport`命令访问生成的代码，以便继续在本地工作。iOS应用程序的集成也受到赞赏，因为它可以在旅途中提问，并且答案稍后可用。\n\n作者将Claude Code与四个月前Cursor构建的类似功能进行了比较，但发现Claude的实现更好，因为其感知到的产品质量更高。 虽然Cursor的版本感觉很挑剔和脆弱，字体大小也不太理想，但Claude Code感觉很扎实和可靠。这种感知到的质量差异是推动作者偏爱Claude Code的关键因素，使其成为其工作流程中更有效和更令人愉快的工具。"
  },
  {
    "id": "45746808",
    "title": "Nvidia storms past $5T valuation as AI boom powers meteoric rise",
    "url": "https://www.reuters.com/business/nvidia-poised-record-5-trillion-market-valuation-2025-10-29/",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "英伟达乘AI东风市值突破5万亿美元",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "45746401",
    "title": "Grammarly rebrands to 'Superhuman,' launches a new AI assistant",
    "url": "https://techcrunch.com/2025/10/29/grammarly-rebrands-to-superhuman-launches-a-new-ai-assistant/",
    "summary": "Grammarly is rebranding to \"Superhuman\" after acquiring the email client of the same name. Despite the corporate name change, the Grammarly product will remain as is, though other acquired products like Coda may be rebranded later. The company is launching \"Superhuman Go,\" an AI assistant integrated into the Grammarly extension. This assistant provides writing suggestions and email feedback, connecting to apps like Jira, Gmail, and Google Calendar to gain context and perform tasks like logging tickets or scheduling meetings.\n\nSuperhuman Go can be tested by toggling it on in the Grammarly extension and connecting it to various apps, with access to an agent store featuring tools like a plagiarism checker. All Grammarly users can try Superhuman Go, with Pro and Business subscription plans offering additional features like multilingual support and access to Superhuman Mail.\n\nSuperhuman also plans to add AI-powered features to Coda and Superhuman email clients, enabling automatic detail creation from external and internal sources. This move aims to position Superhuman as a stronger competitor against productivity suites like Notion and Google Workspace. The company has acquired Coda and Superhuman to augment its viability as a productivity suite.\n",
    "chinese_title": "Grammarly更名为“Superhuman”，推出全新AI助手",
    "chinese_summary": "Grammarly在收购同名邮件客户端后，更名为“Superhuman”。 尽管公司名称变更，Grammarly产品将保持不变，但Coda等其他收购产品可能会在稍后更名。该公司正在推出“Superhuman Go”，这是一款集成到Grammarly扩展程序中的人工智能助手。 该助手提供写作建议和电子邮件反馈，连接到Jira、Gmail和Google Calendar等应用程序以获取上下文并执行记录工单或安排会议等任务。\n\nSuperhuman Go可以通过在Grammarly扩展程序中开启并将其连接到各种应用程序进行测试，还可以访问包含抄袭检查器等工具的代理商店。 所有Grammarly用户都可以试用Superhuman Go，Pro和Business订阅计划提供额外的功能，例如多语言支持和访问Superhuman Mail。\n\nSuperhuman还计划为Coda和Superhuman电子邮件客户端添加人工智能驱动的功能，从而能够从外部和内部来源自动创建详细信息。 此举旨在使Superhuman成为Notion和Google Workspace等效率套件的更强有力的竞争对手。 该公司已收购Coda和Superhuman，以增强其作为效率套件的生存能力。"
  },
  {
    "id": "45744503",
    "title": "YouTube is taking down videos on performing nonstandard Windows 11 installs",
    "url": "https://old.reddit.com/r/DataHoarder/comments/1oiz0v0/youtube_is_taking_down_videos_on_performing/",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "YouTube正在移除有关执行非标准Windows 11安装的视频。",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "45737338",
    "title": "Samsung makes ads on smart fridges official with upcoming software update",
    "url": "https://arstechnica.com/gadgets/2025/10/samsung-makes-ads-on-3499-smart-fridges-official-with-upcoming-software-update/",
    "summary": "Samsung is rolling out a software update to its 2024 Family Hub smart fridges (priced $1,899 to $3,499) that will display ads on their integrated screens. These ads will appear as part of a new widget on the Cover Screen when the fridge is idle, displaying information alongside curated advertisements. The ads will be contextualized, not personalized, according to Samsung.\n\nThe widget will show a rectangular ad box at the bottom of the screen, changing every 10 seconds. A new \"Daily Board\" theme, also included in the update, features five information tiles and one ad tile.\n\nUsers can opt out of seeing ads through the fridge's settings menu or by setting their Cover Screen to Art or Album themes, though this disables the helpful widget features. Alternatively, users can avoid the software update entirely, but they will miss out on the UI refresh and improved internal camera functionality.\n\nThis move reflects a growing trend of smart home devices changing user experiences in unwanted ways post-purchase and Samsung's increasing reliance on ads in its smart home products. While companies seek new revenue streams, customers are facing more ads on devices they've already purchased.\n",
    "chinese_title": "三星将通过即将到来的软件更新，正式在智能冰箱上投放广告",
    "chinese_summary": "三星正在向其2024款Family Hub智能冰箱（售价1899美元至3499美元）推送软件更新，更新后冰箱集成屏幕上将显示广告。这些广告将作为封面屏幕上新增小部件的一部分出现，在冰箱闲置时，广告会与精选信息一同显示。三星表示，这些广告将是情境化的，而非个性化的。\n\n该小部件将在屏幕底部显示一个矩形广告框，每10秒更换一次。更新中还包含一个新的“每日看板”主题，该主题包含五个信息磁贴和一个广告磁贴。\n\n用户可以通过冰箱的设置菜单选择不显示广告，或者将封面屏幕设置为艺术或相册主题，但这会禁用实用的小部件功能。或者，用户可以选择完全避免软件更新，但他们将错过UI刷新和改进的内部摄像头功能。\n\n此举反映了智能家居设备在购买后以不受欢迎的方式改变用户体验的日益增长的趋势，以及三星越来越依赖其智能家居产品中的广告。虽然公司寻求新的收入来源，但客户正面临着已购买设备上越来越多的广告。"
  },
  {
    "id": "45746964",
    "title": "Samsung's $2000 smart fridges are getting ads",
    "url": "https://www.ghacks.net/2025/10/29/samsungs-2000-smart-fridges-are-getting-ads/",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "三星售价2000美元的智能冰箱开始投放广告",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "45709499",
    "title": "Gluing and framing a 9000-piece jigsaw",
    "url": "https://river.me/blog/puzzle-glue-9000/",
    "summary": "This article details the author's experience gluing and framing a 9000-piece jigsaw puzzle, emphasizing that the process was unexpectedly more challenging than completing the puzzle itself. After finishing the \"Dragon Forest\" puzzle, the author decided to frame it as wall art.\n\nThe article explores two framing methods: DIY and using a professional frame store. The author opted for the latter, but provides advice applicable to both. The initial crucial step is gluing the puzzle together. The author experimented extensively with Mod Podge application techniques on smaller puzzles, ultimately recommending using a 6\" squeegee for spreading the adhesive. They suggest using outdoor Mod Podge for the first layers for its thickness and water resistance, followed by spray Mod Podge for a matte finish, but warn about the spray's strong fumes. Parchment paper is essential as a non-stick surface beneath the puzzle during gluing.\n\nThe author advises completing the puzzle on parchment paper from the start to simplify the process. If not, transferring the puzzle to a parchment paper-covered board requires careful steps to avoid damaging the pieces, potentially disassembling and reassembling sections or using a two-person sliding technique.\n\nTransporting the puzzle to the framer involves sandwiching it between reinforced foam boards secured with cling wrap. For hanging, the author used drywall picture hooks anchored at equal distances from the floor. The article concludes with the satisfaction of the completed, framed puzzle.\n",
    "chinese_title": "拼接并装裱9000片拼图",
    "chinese_summary": "本文详细介绍了作者粘合和装裱9000片拼图的经验，强调该过程比完成拼图本身更具挑战性。在完成“龙之森林”拼图后，作者决定将其装裱成墙面艺术品。\n\n本文探讨了两种装裱方法：DIY和使用专业画框店。作者选择了后者，但也提供了适用于两者的建议。最初的关键步骤是将拼图粘在一起。作者在较小的拼图上广泛试验了Mod Podge的应用技巧，最终推荐使用6英寸刮板来涂抹粘合剂。他们建议第一层使用户外Mod Podge，因为它较厚且防水，然后使用喷雾Mod Podge进行哑光处理，但警告喷雾气味强烈。羊皮纸在粘合过程中是拼图下方必不可少的防粘表面。\n\n作者建议从一开始就在羊皮纸上完成拼图，以简化流程。否则，将拼图转移到覆盖羊皮纸的板上需要谨慎操作，以避免损坏拼图碎片，可能需要拆卸并重新组装部分区域，或者使用双人滑动技术。\n\n将拼图运送到装裱师那里需要将其夹在用保鲜膜固定的加固泡沫板之间。对于悬挂，作者使用了从地面等距锚定的石膏板挂钩。文章最后以完成装裱的拼图带来的满足感结尾。"
  },
  {
    "id": "45736457",
    "title": "1X Neo – Home Robot - Pre Order",
    "url": "https://www.1x.tech/order",
    "summary": "生成摘要时出错",
    "chinese_title": "1X Neo – Home Robot - Pre Order",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45733412",
    "title": "A brief history of random numbers (2018)",
    "url": "https://crates.io/crates/oorandom#a-brief-history-of-random-numbers",
    "summary": "生成摘要时出错",
    "chinese_title": "A brief history of random numbers (2018)",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45739844",
    "title": "John Carmack: \"DGX Spark has only half the advertised performance\"",
    "url": "https://twitter.com/ID_AA_Carmack/status/1982831774850748825",
    "summary": "生成摘要时出错",
    "chinese_title": "John Carmack: \"DGX Spark has only half the advertised performance\"",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45747474",
    "title": "Grammarly drops its iconic name, now rebranding to 'Superhuman'",
    "url": "https://www.neowin.net/news/grammarly-drops-its-iconic-name-now-rebranding-to-superhuman/",
    "summary": "生成摘要时出错",
    "chinese_title": "Grammarly drops its iconic name, now rebranding to 'Superhuman'",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45748872",
    "title": "US passport support in Apple Wallet is an important step for digital ID",
    "url": "https://9to5mac.com/2025/10/28/us-passport-support-in-apple-wallet-is-a-hugely-important-step-for-digital-id/",
    "summary": "生成摘要时出错",
    "chinese_title": "US passport support in Apple Wallet is an important step for digital ID",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45731366",
    "title": "Show HN: Bash Screensavers",
    "url": "https://github.com/attogram/bash-screensavers",
    "summary": "生成摘要时出错",
    "chinese_title": "Show HN: Bash Screensavers",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45674470",
    "title": "Notes on Waveguide Synthesis (2018)",
    "url": "https://www.osar.fr/notes/waveguides/",
    "summary": "生成摘要时出错",
    "chinese_title": "Notes on Waveguide Synthesis (2018)",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45719371",
    "title": "Show HN: Automate robot data quality improvement",
    "url": "https://github.com/RoboticsData/score_lerobot_episodes",
    "summary": "生成摘要时出错",
    "chinese_title": "Show HN: Automate robot data quality improvement",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45681913",
    "title": "Cheese Crystals (2019)",
    "url": "https://snipettemag.com/cheese-crystals/",
    "summary": "生成摘要时出错",
    "chinese_title": "Cheese Crystals (2019)",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45732552",
    "title": "Sick: Indexed deduplicated binary storage for JSON-like data structures",
    "url": "https://github.com/7mind/sick",
    "summary": "生成摘要时出错",
    "chinese_title": "Sick: Indexed deduplicated binary storage for JSON-like data structures",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45746844",
    "title": "Character.ai to Bar Children Under 18 from Using Its Chatbots",
    "url": "https://www.nytimes.com/2025/10/29/technology/characterai-underage-users.html",
    "summary": "生成摘要时出错",
    "chinese_title": "Character.ai to Bar Children Under 18 from Using Its Chatbots",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45736925",
    "title": "Nearly 90% of Windows Games Now Run on Linux",
    "url": "https://www.tomshardware.com/software/linux/nearly-90-percent-of-windows-games-now-run-on-linux-latest-data-shows-as-windows-10-dies-gaming-on-linux-is-more-viable-than-ever",
    "summary": "生成摘要时出错",
    "chinese_title": "Nearly 90% of Windows Games Now Run on Linux",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45744007",
    "title": "Acetaminophen and Autism",
    "url": "https://www.science.org/content/blog-post/acetaminophen-and-autism-trump-administration-style",
    "summary": "生成摘要时出错",
    "chinese_title": "Acetaminophen and Autism",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45735044",
    "title": "The human only public license",
    "url": "https://vanderessen.com/posts/hopl/",
    "summary": "生成摘要时出错",
    "chinese_title": "The human only public license",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45720376",
    "title": "10M people watched a YouTuber shim a lock; the lock company sued him – bad idea",
    "url": "https://arstechnica.com/tech-policy/2025/10/suing-a-popular-youtuber-who-shimmed-a-130-lock-what-could-possibly-go-wrong/",
    "summary": "生成摘要时出错",
    "chinese_title": "10M people watched a YouTuber shim a lock; the lock company sued him – bad idea",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45721352",
    "title": "Show HN: ISS in Real Time – 25 Years Aboard the International Space Station",
    "url": "https://issinrealtime.org",
    "summary": "生成摘要时出错",
    "chinese_title": "Show HN: ISS in Real Time – 25 Years Aboard the International Space Station",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45701546",
    "title": "How the brain's activity, energy use and blood flow change as people fall asleep",
    "url": "https://www.massgeneralbrigham.org/en/about/newsroom/press-releases/research-shows-coordinated-shift-in-brain-activity-while-asleep",
    "summary": "生成摘要时出错",
    "chinese_title": "How the brain's activity, energy use and blood flow change as people fall asleep",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45733772",
    "title": "How to build a 747 – A WorldFlight Story",
    "url": "https://www.x-plane.com/2025/10/how-to-build-a-747-a-worldflight-story/",
    "summary": "生成摘要时出错",
    "chinese_title": "How to build a 747 – A WorldFlight Story",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45746937",
    "title": "Nvidia becomes first company to reach $5T valuation, fueled by AI boom",
    "url": "https://www.cnbc.com/2025/10/29/nvidia-on-track-to-hit-historic-5-trillion-valuation-amid-ai-rally.html",
    "summary": "生成摘要时出错",
    "chinese_title": "Nvidia becomes first company to reach $5T valuation, fueled by AI boom",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45711598",
    "title": "Falcon: A Reliable, Low Latency Hardware Transport",
    "url": "https://dl.acm.org/doi/10.1145/3718958.3754353",
    "summary": "生成摘要时出错",
    "chinese_title": "Falcon: A Reliable, Low Latency Hardware Transport",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45733197",
    "title": "Washington Post editorials omit a key disclosure: Bezos' financial ties",
    "url": "https://www.npr.org/2025/10/28/nx-s1-5587932/washington-post-editorials-omit-a-key-disclosure-bezos-financial-ties",
    "summary": "生成摘要时出错",
    "chinese_title": "Washington Post editorials omit a key disclosure: Bezos' financial ties",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45705654",
    "title": "Use the Saw, Fear the Saw",
    "url": "https://stephango.com/saw",
    "summary": "生成摘要时出错",
    "chinese_title": "Use the Saw, Fear the Saw",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45732485",
    "title": "Austrian ministry kicks out Microsoft in favor of Nextcloud",
    "url": "https://news.itsfoss.com/austrian-ministry-kicks-out-microsoft/",
    "summary": "生成摘要时出错",
    "chinese_title": "Austrian ministry kicks out Microsoft in favor of Nextcloud",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45745536",
    "title": "US startup Substrate announces chipmaking tool that it says will rival ASML",
    "url": "https://www.reuters.com/world/asia-pacific/us-startup-substrate-announces-chipmaking-tool-that-it-says-will-rival-asml-2025-10-28/",
    "summary": "生成摘要时出错",
    "chinese_title": "US startup Substrate announces chipmaking tool that it says will rival ASML",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45741050",
    "title": "Database backups, dump files and restic",
    "url": "https://strugglers.net/posts/2025/database-backups-dump-files-and-restic/",
    "summary": "生成摘要时出错",
    "chinese_title": "Database backups, dump files and restic",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45728975",
    "title": "Complete Digitization of Leonardo da Vinci's Codex Atlanticus",
    "url": "https://www.openculture.com/2025/10/digitization-of-leonardo-da-vincis-codex-atlanticus.html",
    "summary": "生成摘要时出错",
    "chinese_title": "Complete Digitization of Leonardo da Vinci's Codex Atlanticus",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45732874",
    "title": "Ubiquiti SFP Wizard",
    "url": "https://blog.ui.com/article/welcome-to-sfp-liberation-day",
    "summary": "生成摘要时出错",
    "chinese_title": "Ubiquiti SFP Wizard",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45749970",
    "title": "Ups Has Cut 48,000 Workers Since Last Year",
    "url": "https://www.nytimes.com/2025/10/28/business/ups-layoffs-48000-workers-this-year.html",
    "summary": "生成摘要时出错",
    "chinese_title": "Ups Has Cut 48,000 Workers Since Last Year",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45676029",
    "title": "Emily Riehl is rewriting the foundations of higher category theory (2020)",
    "url": "https://www.quantamagazine.org/emily-riehl-conducts-the-mathematical-orchestra-from-the-middle-20200902/",
    "summary": "生成摘要时出错",
    "chinese_title": "Emily Riehl is rewriting the foundations of higher category theory (2020)",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45718665",
    "title": "What happened to running what you wanted on your own machine?",
    "url": "https://hackaday.com/2025/10/22/what-happened-to-running-what-you-wanted-on-your-own-machine/",
    "summary": "生成摘要时出错",
    "chinese_title": "What happened to running what you wanted on your own machine?",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45732350",
    "title": "The next chapter of the Microsoft–OpenAI partnership",
    "url": "https://openai.com/index/next-chapter-of-microsoft-openai-partnership/",
    "summary": "生成摘要时出错",
    "chinese_title": "The next chapter of the Microsoft–OpenAI partnership",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45737948",
    "title": "Show HN: Butter – A Behavior Cache for LLMs",
    "url": "https://www.butter.dev/",
    "summary": "生成摘要时出错",
    "chinese_title": "Show HN: Butter – A Behavior Cache for LLMs",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45747853",
    "title": "Cancerous oil-field wastewater is spreading through Oklahoma water supply",
    "url": "https://www.propublica.org/article/oklahoma-oil-gas-wastewater-pollution",
    "summary": "生成摘要时出错",
    "chinese_title": "Cancerous oil-field wastewater is spreading through Oklahoma water supply",
    "chinese_summary": "生成摘要时出错"
  }
]