[
  {
    "id": "45898407",
    "title": "Yt-dlp: External JavaScript runtime now required for full YouTube support",
    "url": "https://github.com/yt-dlp/yt-dlp/issues/15012",
    "summary": "生成摘要时出错",
    "chinese_title": "Yt-dlp：完整支持YouTube现需外部JavaScript运行时",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45900978",
    "title": "Learn Prolog Now",
    "url": "https://lpn.swi-prolog.org/lpnpage.php?pageid=top",
    "summary": "生成摘要时出错",
    "chinese_title": "Learn Prolog Now",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45897271",
    "title": "Yann LeCun to depart Meta and launch AI startup focused on 'world models'",
    "url": "https://www.nasdaq.com/articles/metas-chief-ai-scientist-yann-lecun-depart-and-launch-ai-start-focused-world-models",
    "summary": "Yann LeCun, Meta's Chief AI Scientist and a Turing Award winner, is leaving the company to launch his own AI startup focused on developing \"world models.\" These next-generation AI systems aim to learn from visual and spatial data to replicate human reasoning, a project LeCun believes will take a decade.\n\nHis departure stems from a philosophical rift with Mark Zuckerberg's strategy, which heavily emphasizes large language models (LLMs). LeCun considers LLMs fundamentally limited in their ability to reason and plan like humans, while Zuckerberg is shifting Meta's AI research towards commercial products and LLMs to compete with OpenAI and Google. This shift includes hiring Alexandr Wang of Scale AI to lead a new Superintelligence division.\n\nLeCun's exit adds to recent AI leadership shake-ups at Meta, including departures and layoffs, following investor pressure and a significant drop in Meta's stock value due to concerns about high AI spending. The article highlights LeCun's move as a signal of a potential new competitor in the development of artificial general intelligence, moving away from Meta's current direction under Zuckerberg. He intends to extend his FAIR research to enable machines to think more like people, contrasting with the reliance on LLMs at Meta.\n",
    "chinese_title": "杨立昆将离开Meta并创办专注于“世界模型”的AI初创公司",
    "chinese_summary": "Meta首席AI科学家、图灵奖得主杨立昆离职，将创办AI初创公司，专注于开发“世界模型”。这些下一代AI系统旨在学习视觉和空间数据，以复制人类推理，立昆认为这个项目需要十年时间。\n\n他的离职源于与马克·扎克伯格战略的哲学分歧，后者严重依赖大型语言模型（LLM）。立昆认为LLM在像人类一样推理和计划的能力方面存在根本局限性，而扎克伯格正在将Meta的AI研究转向商业产品和LLM，以与OpenAI和Google竞争。这一转变包括聘请Scale AI的亚历山大·王来领导一个新的超智能部门。\n\n立昆的离职加剧了Meta最近的AI领导层变动，包括离职和裁员，此前投资者施加压力，并且由于对高额AI支出的担忧，Meta的股票价值大幅下跌。文章强调，立昆的举动预示着通用人工智能开发领域可能出现新的竞争者，与扎克伯格领导下Meta的当前方向背道而驰。他计划扩展其FAIR研究，使机器更像人类一样思考，这与Meta对LLM的依赖形成对比。"
  },
  {
    "id": "45900159",
    "title": "The Geometry Behind Normal Maps",
    "url": "https://www.shlom.dev/articles/geometry-behind-normal-maps/",
    "summary": "This article demystifies tangent space in the context of normal mapping, explaining it not as a rendering trick but as a fundamental geometric structure arising from a surface's parameterization (UVs). Tangent space is a local coordinate frame built at each point on a surface, defined by the tangent plane and a normal vector. UV coordinates dictate the orientation of this frame, bridging the flat world of textures and the curved 3D surface.\n\nThe article details how to construct the tangent space by calculating the tangent and bitangent vectors from UV coordinates and surface geometry, effectively finding the transformation that maps texture space directions to corresponding surface directions. The Gram-Schmidt process is crucial for orthogonalizing the tangent frame. The article then explains how normal maps, which store surface orientations as colors, leverage tangent space to add fine detail to low-poly meshes. Normal map texels store directions in tangent space, and the tangent-basis (TBN) matrix transforms these directions into the surface's coordinate frame, influencing lighting calculations. Proper generation and interpolation of the tangent basis are crucial for accurate normal mapping, preventing seams and highlighting artifacts. The article concludes by emphasizing that tangent space is a fundamental aspect of surfaces and not just a shading technique, underpinning various techniques like anisotropy and displacement mapping.\n",
    "chinese_title": "法线贴图背后的几何学",
    "chinese_summary": "本文旨在揭秘法线贴图中的切线空间，阐释它并非一种渲染技巧，而是源于表面参数化（UV）的一种基本几何结构。切线空间是构建于表面每个点的局部坐标系，由切平面和法向量定义。UV坐标决定了这个坐标系的朝向，连接了平坦的纹理世界和弯曲的3D表面。\n\n文章详细介绍了如何通过UV坐标和表面几何计算切向量和副切向量来构建切线空间，有效地找到将纹理空间方向映射到相应表面方向的变换。格拉姆-施密特正交化过程对于正交化切线坐标系至关重要。文章随后解释了法线贴图如何利用切线空间，通过将表面朝向存储为颜色，为低多边形网格添加精细细节。法线贴图像素存储切线空间中的方向，而切线基（TBN）矩阵将这些方向转换为表面的坐标系，从而影响光照计算。切线基的正确生成和插值对于精确的法线贴图至关重要，可以防止接缝和高光伪影。文章最后强调，切线空间是表面的一个基本方面，而不仅仅是一种着色技术，它支撑着各项技术，例如各向异性和置换贴图。"
  },
  {
    "id": "45783411",
    "title": "Ioannis Yannas invented artificial skin for treatment of burns–dies at 90",
    "url": "https://news.mit.edu/2025/professor-ioannis-yannas-dies-1027",
    "summary": "Ioannis Yannas, a longtime MIT faculty member and physical chemist, died on October 19th at the age of 90. He is best known for inventing artificial skin for treating severe burns, a discovery that revolutionized burn care and launched the field of regenerative medicine. Yannas collaborated with John Burke of Massachusetts General Hospital, developing Integra, a patented artificial skin made of a silicone outer sheet over a collagen scaffolding derived from cow tendon and shark cartilage. This invention provides protection from infection and dehydration, allowing healthy skin cells to regenerate.\n\nYannas's work also advanced the use of collagen tubes for peripheral nerve injuries. He was celebrated for his boldness in tackling complex medical problems and his influence extended to the development of courses like 2.79 (Biomaterial-Tissue Interactions) at MIT. Myron Spector, professor emeritus at Harvard Medical School, highlights Yannas's ability to codify cell behavior in relation to tissue response to implants, influencing approaches to engineering medical devices.\n\nThroughout his career, Yannas received numerous accolades, including election to the National Academy of Medicine, the National Inventors Hall of Fame, and the National Academy of Engineering. He authored influential works, including \"Tissue and Organ Regeneration in Adults.\" His legacy includes saving the lives of countless burn victims and inspiring future generations of bioengineers. A celebration of life will be announced at a later date. He is survived by his two children, Tania Kluzak and Alexi Yannas, and five grandchildren.\n",
    "chinese_title": "伊阿尼斯·扬纳斯发明人造皮肤治疗烧伤去世，享年90岁",
    "chinese_summary": "长期担任麻省理工学院教职的物理化学家伊奥尼斯·扬纳斯于10月19日去世，享年90岁。他最著名的成就是发明了用于治疗严重烧伤的人工皮肤，这一发现彻底改变了烧伤护理，并开创了再生医学领域。扬纳斯与马萨诸塞州总医院的约翰·伯克合作，开发了Integra，一种获得专利的人工皮肤，由覆盖在源自牛肌腱和鲨鱼软骨的胶原支架上的硅酮外层制成。这项发明可以防止感染和脱水，从而使健康的皮肤细胞再生。\n\n扬纳斯的研究还促进了胶原管在周围神经损伤中的应用。他因大胆解决复杂的医学问题而备受赞誉，他的影响力还延伸到麻省理工学院的2.79（生物材料-组织相互作用）等课程的开发。哈佛医学院荣誉退休教授迈伦·斯佩克特强调了扬纳斯在将细胞行为与组织对植入物的反应进行编码方面的能力，从而影响了医疗设备工程设计的方法。\n\n在整个职业生涯中，扬纳斯获得了无数荣誉，包括当选为国家医学院院士、国家发明家名人堂院士和国家工程院院士。他撰写了具有影响力的著作，包括《成人组织和器官再生》。他的遗产包括拯救了无数烧伤患者的生命，并激励了下一代生物工程师。追悼会将在稍后公布。他留下了两个孩子，塔尼亚·克鲁扎克和阿列克谢·扬纳斯，以及五个孙辈。"
  },
  {
    "id": "45900108",
    "title": "Micro.blog launches new 'Studio' tier with video hosting",
    "url": "https://heydingus.net/blog/2025/11/micro-blog-offers-an-indie-alternative-to-youtube-with-its-studio-video-hosting-plan",
    "summary": "In November 2025, Micro.blog launched its new \"Studio\" tier, introducing video hosting to its platform, positioning itself as an indie alternative to YouTube. Founder Manton Reece aims to empower users to own their video content and presence on the web, extending Micro.blog's existing ethos of owning your data to include video.\n\nThe \"Studio\" plan allows uploads of videos up to 20 minutes in length and includes automatic copying to platforms like PeerTube and Bluesky. This addresses the concern of centralized video hosting on platforms like YouTube, as highlighted by John Gruber's call for independent video hosting solutions.\n\nMicro.blog embraces the Publish to Own Site, Syndicate Elsewhere (POSSE) framework, automatically cross-posting to various social networks, with PeerTube now included and plans for potential YouTube integration.\n\nThe author expresses excitement about Micro.blog tackling the challenge of an indie YouTube alternative. An \"Update\" section expresses desires for scaling video time limits across different pricing tiers, rather than only the Studio plan, and for supporting 4K resolution.\n\nThe author highlights that Micro.blog has offered video uploading previously, but Studio makes it a first-rate feature with smooth playback and automatic resolution conversion. Reece states the Studio tier aims to serve the user first, as opposed to algorithms.\n",
    "chinese_title": "Micro.blog 推出全新“Studio”等级，支持视频托管",
    "chinese_summary": "2025年11月，Micro.blog推出了新的“Studio”层级，将视频托管引入其平台，定位为YouTube的独立替代方案。创始人Manton Reece旨在赋能用户拥有其视频内容和在网络上的存在，将Micro.blog现有的数据所有权理念扩展到视频领域。\n\n“Studio”计划允许上传最长20分钟的视频，并包括自动复制到PeerTube和Bluesky等平台。这解决了YouTube等平台上集中式视频托管的问题，正如John Gruber呼吁独立的视频托管解决方案所强调的那样。\n\nMicro.blog拥抱“发布到自有站点，联合发布到其他地方”(POSSE)框架，自动交叉发布到各种社交网络，现在包括PeerTube，并计划未来集成YouTube。\n\n作者对Micro.blog应对独立YouTube替代方案的挑战表示兴奋。“更新”部分表达了希望扩展不同定价层级的视频时长限制，而不仅仅是Studio计划，并支持4K分辨率。\n\n作者强调，Micro.blog之前已经提供视频上传功能，但Studio使其成为一流的功能，具有流畅的播放和自动分辨率转换。Reece表示，Studio层级的目标是首先服务用户，而不是算法。"
  },
  {
    "id": "45901855",
    "title": "Waymo begins freeway rides for the public",
    "url": "https://techcrunch.com/2025/11/12/waymo-robotaxis-are-now-giving-rides-on-freeways-in-these-3-cities/",
    "summary": "Waymo is launching robotaxi rides on freeways in San Francisco, Phoenix, and Los Angeles, a significant expansion that could cut ride times by up to 50%. This move is crucial for offering rides to and from the San Francisco Airport and expands the service area to include San Jose, creating a 260-mile unified zone.\n\nWhile freeway driving seems simple, Waymo emphasizes the complexity of achieving full autonomy at scale, prioritizing system safety and reliability. Extensive closed-course and simulation testing, along with expanded operational protocols, were implemented to ensure smooth and safe transitions between freeways and surface streets.\n\nInitially, freeway rides will be offered to select Waymo riders who indicate their preference in the app. The expansion allows for curbside drop-off and pick-up services at San Jose Mineta International Airport, adding to existing services at Phoenix Sky Harbor International Airport.\n",
    "chinese_title": "Waymo开始向公众提供高速公路乘车服务",
    "chinese_summary": "Waymo将在旧金山、凤凰城和洛杉矶的高速公路上推出无人驾驶出租车服务，这是一项重大扩张，有望将乘车时间缩短高达50%。此举对于提供往返旧金山机场的乘车服务至关重要，并将服务范围扩大到包括圣何塞，形成一个260英里的统一区域。\n\n虽然高速公路驾驶看似简单，但Waymo强调了实现大规模完全自动驾驶的复杂性，优先考虑系统安全性和可靠性。实施了广泛的封闭场地和模拟测试，以及扩展的运营协议，以确保高速公路和地面街道之间的平稳安全过渡。\n\n最初，高速公路乘车服务将提供给在应用程序中表明偏好的部分Waymo乘客。此次扩张允许在圣何塞米内塔国际机场提供路边上下车服务，从而增加了凤凰城天港国际机场的现有服务。"
  },
  {
    "id": "45897935",
    "title": "What happened to Transmeta, the last big dotcom IPO",
    "url": "https://dfarq.homeip.net/what-happened-to-transmeta-the-last-big-dotcom-ipo/",
    "summary": "Dave Farquhar's blog post explores the rise and fall of Transmeta, a CPU company that launched the last major dotcom-era IPO in November 2000. While not strictly an Internet company, its IPO marked a turning point as investor interest cooled on dotcoms, paving the way for more traditional technology stocks.\n\nTransmeta distinguished itself with a unique CPU design that used a translation layer to execute x86 instructions on a more efficient core. This allowed them to potentially emulate different architectures, but they focused on the popular x86. Linus Torvalds famously worked at Transmeta, contributing to its significance.\n\nDespite releasing two CPU lines (Crusoe and Efficeon), Transmeta struggled to compete with Intel and AMD in performance and speed. The Crusoe trailed Pentium III speeds, while the Efficieon couldn't keep pace with the Pentium 4 or the rise of 64-bit processors like AMD's Athlon 64. Consequently, Transmeta's CPUs found limited use in low-power devices.\n\nUltimately, Transmeta failed to thrive. Torvalds left in 2003, and in 2005, the company shifted to licensing its intellectual property. In 2009, Transmeta was acquired by Novafora, who subsequently sold the patent portfolio to Intellectual Ventures. Novafora ceased operations shortly after. Intellectual Ventures now licenses Transmeta's patents, leaving the company a distant memory. Transmeta hardware is now a rare collectible, though lacking widespread nostalgia. The article concludes that Transmeta's fate resembles that of Netscape or VA Linux more than that of Red Hat.\n",
    "chinese_title": "Transmeta，最后一家大型网络公司首次公开募股，后来怎么样了？",
    "chinese_summary": "戴夫·法夸尔的博文探讨了全美达（Transmeta）的兴衰，这是一家CPU公司，于2000年11月进行了最后一次主要的互联网泡沫时代IPO。虽然并非严格意义上的互联网公司，但其IPO标志着一个转折点，投资者对互联网公司的兴趣降温，为更传统的科技股铺平了道路。\n\n全美达以其独特的CPU设计而著称，该设计使用翻译层在更高效的内核上执行x86指令。这使得他们有可能模拟不同的架构，但他们专注于流行的x86架构。Linus Torvalds曾在全美达工作，这增加了它的重要性。\n\n尽管发布了两条CPU产品线（Crusoe和Efficeon），全美达在性能和速度方面难以与英特尔和AMD竞争。Crusoe落后于奔腾III的速度，而Efficeon无法跟上奔腾4或AMD Athlon 64等64位处理器的兴起。因此，全美达的CPU在低功耗设备中的应用有限。\n\n最终，全美达未能蓬勃发展。Torvalds于2003年离职，2005年，该公司转向授权其知识产权。2009年，全美达被Novafora收购，后者随后将专利组合出售给Intellectual Ventures。Novafora在此之后不久停止运营。Intellectual Ventures现在授权全美达的专利，使这家公司成为遥远的回忆。全美达的硬件现在是一种稀有的收藏品，尽管缺乏广泛的怀旧感。文章总结说，全美达的命运更像网景或VA Linux，而不是红帽。"
  },
  {
    "id": "45898789",
    "title": "Pakistani newspaper mistakenly prints AI prompt with the article",
    "url": "https://twitter.com/omar_quraishi/status/1988518627859951986",
    "summary": "The article describes a blunder where a Pakistani newspaper inadvertently published an AI prompt along with the actual news article. The rest of the text appears to be unrelated JavaScript error information typically found on the X (formerly Twitter) website when JavaScript is disabled. It's likely this snippet of code and AI prompt were mistakenly included in the published article, indicating a potential error in the newspaper's editorial process or content management system. The core of the story is the embarrassing and humorous error of including an AI prompt alongside a news piece, highlighting the growing reliance on AI in content creation and the potential pitfalls associated with it. The presence of the unrelated JavaScript error text suggests a possible cut-and-paste error during the article's preparation.\n",
    "chinese_title": "巴基斯坦报纸误将AI提示词与文章一同刊登",
    "chinese_summary": "一篇巴基斯坦报纸无意中将一个AI提示词与新闻文章一同发表，犯下了一个错误。其余文字似乎是不相关的JavaScript错误信息，通常在X（前身为Twitter）网站禁用JavaScript时出现。这段代码和AI提示词很可能被错误地包含在已发表的文章中，表明该报纸的编辑流程或内容管理系统可能存在错误。故事的核心在于这个尴尬而幽默的错误，即在新闻文章中包含了AI提示词，突显了内容创作中对AI日益增长的依赖以及与之相关的潜在陷阱。不相关的JavaScript错误文本的存在表明文章准备过程中可能存在复制粘贴错误。"
  },
  {
    "id": "45811026",
    "title": "NetHack4 Philosophy",
    "url": "http://nethack4.org/philosophy.html",
    "summary": "生成摘要时出错",
    "chinese_title": "NetHack4 的理念",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45789674",
    "title": "Laptops with Stickers",
    "url": "https://stickertop.art/main/",
    "summary": "Stickertop.art showcases a curated collection of laptops customized with stickers. The project aims to celebrate the artistic expression and cultural significance of laptop personalization. Each laptop featured tells a unique story through its stickers, offering insights into the owner's personality and interests. The website provides a glimpse into the world of individual expression through the art of laptop sticker arrangement.\n",
    "chinese_title": "贴纸笔记本电脑",
    "chinese_summary": "Stickertop.art 展示了一系列定制贴纸的笔记本电脑精选集。该项目旨在赞扬笔记本电脑个性化的艺术表达和文化意义。每台展出的笔记本电脑都通过其贴纸讲述着独特的故事，提供了对其所有者个性和兴趣的见解。该网站通过笔记本电脑贴纸排列的艺术，让人们得以一窥个人表达的世界。"
  },
  {
    "id": "45901869",
    "title": "Kubernetes Is Your Private Cloud",
    "url": "https://oneuptime.com/blog/post/2025-11-12-kubernetes-is-your-private-cloud/view",
    "summary": "This article argues that Kubernetes empowers businesses to reclaim control of their infrastructure and build their own \"private cloud,\" moving away from reliance on public cloud providers. The author contends that while public clouds offer initial convenience, they often lead to ballooning costs, limited control, and vendor lock-in.\n\nKubernetes, as a \"programmable substrate,\" provides the same building blocks offered by hyperscalers, like elastic compute (pods and autoscaling), durable storage (Rook + Ceph), and managed databases (CloudNativePG), all open-sourced and customizable. By owning the stack, companies gain control over data location, compliance, and budgeting, leading to increased resilience and reduced anxiety.\n\nThe article acknowledges the work involved in managing bare-metal Kubernetes clusters but emphasizes the maturity of modern tooling, including infrastructure-as-code and Kubernetes Operators, simplifying the process.\n\nThe core message is that Kubernetes commoditizes the public cloud, allowing businesses to utilize it tactically without being entirely dependent on it. Ultimately, building a private cloud with Kubernetes allows for greater control, autonomy, and predictability, leading to improved team morale, customer satisfaction, and financial stability. The author includes a specific example of saving $230,000/year by migrating from AWS to bare-metal Kubernetes.\n",
    "chinese_title": "Kubernetes 是你的私有云",
    "chinese_summary": "本文认为 Kubernetes 使企业能够重新掌控其基础设施，构建自己的“私有云”，摆脱对公共云提供商的依赖。作者认为，虽然公共云最初提供了便利，但它们往往导致成本膨胀、控制受限和供应商锁定。\n\nKubernetes 作为一个“可编程基底”，提供了与超大规模服务商相同的构建模块，例如弹性计算（Pod 和自动缩放）、持久存储（Rook + Ceph）和托管数据库（CloudNativePG），所有这些都是开源且可定制的。通过拥有堆栈，公司可以控制数据位置、合规性和预算，从而提高弹性和减少焦虑。\n\n本文承认管理裸机 Kubernetes 集群需要付出努力，但强调了现代工具（包括基础设施即代码和 Kubernetes Operators）的成熟性，从而简化了流程。\n\n核心信息是，Kubernetes 使公共云商品化，允许企业在不完全依赖它的情况下战术性地使用它。最终，使用 Kubernetes 构建私有云可以实现更大的控制、自主性和可预测性，从而提高团队士气、客户满意度和财务稳定性。作者列举了一个具体的例子，通过从 AWS 迁移到裸机 Kubernetes，每年节省了 23 万美元。"
  },
  {
    "id": "45893004",
    "title": "X5.1 solar flare, G4 geomagnetic storm watch",
    "url": "https://www.spaceweatherlive.com/en/news/view/593/20251111-x5-1-solar-flare-g4-geomagnetic-storm-watch.html",
    "summary": "On November 11, 2025, sunspot region 4274 produced a significant X5.1 solar flare, the strongest since its appearance and the sixth strongest of the current solar cycle. This flare, peaking at 10:04 UTC, was followed by a large coronal mass ejection (CME). Imagery from GOES-19 CCOR-1 confirmed the CME had an Earth-directed component, prompting the NOAA SWPC to issue a G4 or greater geomagnetic storm watch for November 12th, potentially impacting the planet as early as 16:00 UTC.\n\nThe fast CME is expected to travel through an area of high solar wind speed and low density due to two earlier CMEs. If conditions are favorable, the resulting geomagnetic storm could make aurora visible as far south as northern France, Germany, Ukraine, Switzerland, and Austria in Europe, and Nevada and Arkansas in the US.\n\nThe article reminds readers that two other, less powerful CMEs are also en route to Earth, potentially arriving within 6 to 18 hours of each other. Readers are encouraged to use the SpaceWeatherLive app and monitor solar wind data for updates. SpaceWeatherLive also provides help resources for understanding the technical terms used in the article.\n",
    "chinese_title": "X5.1级太阳耀斑，G4级地磁暴预警",
    "chinese_summary": "2025年11月11日，太阳黑子区域4274爆发了一次强烈的X5.1级太阳耀斑，是该区域出现以来最强的一次，也是当前太阳活动周期的第六强。此次耀斑于UTC时间10:04达到峰值，随后发生了一次大型日冕物质抛射（CME）。来自GOES-19 CCOR-1的图像证实，CME具有指向地球的成分，促使NOAA SWPC发布了11月12日G4级或更高级别的地磁暴预警，最早可能在UTC时间16:00影响地球。\n\n预计快速CME将穿过因先前的两次CME导致的高太阳风速和低密度区域。如果条件有利，由此产生的地磁暴可能使极光在欧洲远至法国北部、德国、乌克兰、瑞士和奥地利，以及美国的内华达州和阿肯色州可见。\n\n文章提醒读者，另有两次较弱的CME也正在前往地球的途中，可能会在彼此相隔6到18小时内到达。建议读者使用SpaceWeatherLive应用程序并监控太阳风数据以获取最新信息。SpaceWeatherLive还提供帮助资源，以帮助理解文章中使用的技术术语。"
  },
  {
    "id": "45901996",
    "title": "The PowerPC Has Still Got It (Llama on G4 Laptop)",
    "url": "https://www.hackster.io/news/the-powerpc-has-still-got-it-c4348bd7a88c",
    "summary": "Andrew Rossignol, a vintage computing enthusiast, successfully ran a large language model (LLM) on a 2005 PowerBook G4, demonstrating that even outdated hardware can participate in modern AI applications. The PowerBook, equipped with a 1.5GHz PowerPC processor and 1GB of RAM, ran a forked version of llama2.c, an open-source LLM inference engine, using the TinyStories model due to its relatively small size.\n\nSignificant modifications were needed to accommodate the PowerPC's big-endian architecture, including converting model checkpoints and tokenizer data, and manually copying weights into memory to meet memory alignment requirements.\n\nPerformance was understandably slow, achieving only 0.77 tokens per second compared to a modern Intel Xeon processor's 6.91 tokens per second. Rossignol improved the speed slightly to 0.88 tokens per second by leveraging AltiVec, the PowerPC's vector processing extension, to optimize matrix multiplication.\n\nDespite the limitations, the project showcases the potential to push the limits of older hardware through careful software optimization and a deep understanding of the underlying architecture. The ability of a 20-year-old laptop to run a modern AI model at all is a testament to the ingenuity and resourcefulness of retro computing enthusiasts.\n",
    "chinese_title": "PowerPC 宝刀未老 (G4 笔记本上的 Llama)",
    "chinese_summary": "复古计算爱好者安德鲁·罗西尼奥成功在2005年的PowerBook G4上运行了一个大型语言模型(LLM)，表明即使是过时的硬件也能参与到现代AI应用中。这台PowerBook配备了1.5GHz PowerPC处理器和1GB内存，运行了llama2.c的一个分支版本，这是一个开源的LLM推理引擎，由于TinyStories模型相对较小，所以使用了该模型。\n\n为了适应PowerPC的大端架构，需要进行重大修改，包括转换模型检查点和分词器数据，以及手动将权重复制到内存中以满足内存对齐要求。\n\n性能可想而知很慢，每秒仅生成0.77个token，而现代英特尔至强处理器每秒可以生成6.91个token。罗西尼奥利用PowerPC的矢量处理扩展AltiVec优化矩阵乘法，将速度略微提高到每秒0.88个token。\n\n尽管存在局限性，该项目展示了通过仔细的软件优化和对底层架构的深刻理解来突破旧硬件极限的潜力。一台20年前的笔记本电脑能够运行现代AI模型，充分证明了复古计算爱好者的聪明才智和足智多谋。"
  },
  {
    "id": "45839141",
    "title": "A Vision of Chocolate's Future in an Amsterdam Brownie",
    "url": "https://www.bloomberg.com/graphics/2025-opinion-future-of-chocolate/",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "阿姆斯特丹布朗尼中的巧克力未来愿景",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "45897457",
    "title": "Please donate to keep Network Time Protocol up – Goal 1k",
    "url": "https://www.ntp.org/",
    "summary": "The Network Time Protocol (NTP) Project is seeking donations to ensure the continued functionality and development of NTP, a crucial protocol that synchronizes computer clocks globally. Accurate timekeeping is essential for a vast range of critical applications, including satellites, GPS, 5G, financial services, and healthcare.\n\nThe NTP Project develops and maintains the open-source Reference Implementation of the NTP standard, alongside its documentation and the protocol itself. This ensures the reliability of time synchronization for billions of devices worldwide.\n\nThe project is currently seeking to raise $8,000. Network Time Foundation supports the NTP Project and hosts monthly online fundraising events focusing on time-related topics to further these efforts. The website offers access to download NTP, report bugs, and find background information on NTP through the Reference Library.\n",
    "chinese_title": "请捐款以维持网络时间协议的运行——目标1千。",
    "chinese_summary": "网络时间协议(NTP)项目寻求捐款，以确保NTP这一关键协议的持续运行和发展，该协议在全球范围内同步计算机时钟。精确计时对于包括卫星、GPS、5G、金融服务和医疗保健在内的众多关键应用至关重要。\n\nNTP项目开发并维护NTP标准的开源参考实现，以及其文档和协议本身。这确保了全球数十亿设备的时间同步可靠性。\n\n该项目目前寻求筹集8,000美元。网络时间基金会支持NTP项目，并每月举办以时间相关主题为重点的在线筹款活动，以进一步推动这些工作。该网站提供下载NTP、报告错误以及通过参考图书馆查找NTP背景信息的途径。"
  },
  {
    "id": "45829790",
    "title": "Bluetooth 6.2 – more responsive, improves security, USB comms, and testing",
    "url": "https://www.cnx-software.com/2025/11/05/bluetooth-6-2-gets-more-responsive-improves-security-usb-communication-and-testing-capabilities/",
    "summary": "The Bluetooth 6.2 specification has been released, focusing on improved responsiveness, security, USB communication, and testing. Key highlights include:\n\n*   **Shorter Connection Intervals (SCI):** Reduces the minimum Bluetooth LE connection interval significantly, leading to faster responsiveness, especially for HID devices, HMIs, latency-sensitive sensors, AR/VR, and gaming applications.\n*   **Amplitude-based Attack Resilience:** Enhances security against sophisticated RF attacks, making devices in automotive, smart home, and industrial sectors more resistant to relay and spoofing threats.\n*   **HCI USB LE Isochronous Support:** Introduces Bulk Serialization Mode, a new method that streamlines the isochronous data transmission over USB, simplifying packet handling and improving LE Audio integration in Bluetooth USB devices.\n*   **LE Test Mode Enhancements:** Offers a unified control protocol for Bluetooth LE RF PHY tests, including over-the-air (OTA) support, reducing the reliance on cables for testing.\n\nThe Bluetooth SIG has adopted a bi-annual release schedule, with Bluetooth 6.3 expected in May 2026.\n",
    "chinese_title": "蓝牙6.2 – 更快响应，增强安全性，改进USB通讯及测试",
    "chinese_summary": "蓝牙6.2规范已发布，重点提升响应速度、安全性、USB通信和测试。主要亮点包括：\n\n*   **更短连接间隔（SCI）：** 显著缩短蓝牙低功耗连接的最小间隔，从而加快响应速度，尤其适用于HID设备、HMI、延迟敏感型传感器、AR/VR和游戏应用。\n*   **基于振幅的攻击弹性：** 增强了针对复杂射频攻击的安全性，使汽车、智能家居和工业领域的设备更能抵抗中继和欺骗威胁。\n*   **HCI USB LE同步支持：** 引入了批量序列化模式，这是一种简化USB上同步数据传输的新方法，简化了数据包处理，并改善了蓝牙USB设备中的LE音频集成。\n*   **LE测试模式增强：** 为蓝牙低功耗射频PHY测试提供统一的控制协议，包括空中（OTA）支持，从而减少对测试电缆的依赖。\n\n蓝牙技术联盟已采用两年一次的发布时间表，预计蓝牙6.3将于2026年5月发布。"
  },
  {
    "id": "45902604",
    "title": "Helm v4.0.0",
    "url": "https://github.com/helm/helm/releases/tag/v4.0.0",
    "summary": "Helm v4.0.0, a major release with backward incompatible changes, has been released. While it introduces changes to CLI flags, output, and the SDK, the goal is to maintain workflow compatibility with Helm v3.\n\nKey new features include:\n\n*   A redesigned plugin system supporting Web Assembly.\n*   Post-renderers implemented as plugins.\n*   Server-side apply support.\n*   Improved resource watching using kstatus.\n*   Local content-based caching.\n*   Logging via slog for SDK integration.\n*   Reproducible chart archive builds.\n*   Updated SDK API with experimental v3 chart API version.\n\nExisting Helm charts (apiVersion v2) are expected to be compatible. The release encourages testing installation and upgrades of existing charts to ensure they function as expected.\n\nThe Helm Team invites the community to join discussions on Kubernetes Slack and participate in the Public Developer Call. Download links for various platforms are provided, along with links to the Quickstart and Install Guides.\n\nPatch releases (3.19.3 and 4.0.1) are scheduled for December 10, 2025, and minor releases (3.20.0 and 4.1.0) for January 21, 2026. The Helm Team expresses gratitude to the community for their contributions.\n",
    "chinese_title": "Helm v4.0.0",
    "chinese_summary": "Helm v4.0.0 发布，重大更新包含不兼容的变更。虽然它对 CLI 标志、输出和 SDK 进行了更改，但目标是保持与 Helm v3 的工作流程兼容性。\n\n主要新特性包括：\n\n*   重新设计的插件系统，支持 Web Assembly。\n*   作为插件实现的后渲染器。\n*   服务端应用支持。\n*   使用 kstatus 改进的资源监视。\n*   基于本地内容的缓存。\n*   通过 slog 进行 SDK 集成日志记录。\n*   可复现的 chart 归档构建。\n*   更新的 SDK API，带有实验性的 v3 chart API 版本。\n\n现有的 Helm charts (apiVersion v2) 预计兼容。该版本鼓励测试现有 charts 的安装和升级，以确保它们按预期运行。\n\nHelm 团队邀请社区加入 Kubernetes Slack 上的讨论，并参与公共开发者会议。提供了各种平台的下载链接，以及快速入门和安装指南的链接。\n\n补丁版本（3.19.3 和 4.0.1）计划于 2025 年 12 月 10 日发布，次要版本（3.20.0 和 4.1.0）计划于 2026 年 1 月 21 日发布。Helm 团队感谢社区的贡献。"
  },
  {
    "id": "45893795",
    "title": "Four strange places to see London's Roman Wall",
    "url": "https://diamondgeezer.blogspot.com/2025/11/odd-places-to-see-londons-roman-wall.html",
    "summary": "Diamond Geezer's blog post, dated November 11, 2025, explores four unusual locations in the City of London where remnants of the Roman Wall can be observed.\n\n1.  **Tower Hill Station (Platform 1):** A dimly lit section of the original Roman wall is visible across the tracks from the rear of platform 1. While only a small recessed area remains, it's a quirky find. A plaque confirms its connection to the visible wall outside, but the Circle line construction in 1882 led to the demolition of 22 meters of the wall, leaving only this fragment.\n\n2.  **Leonardo Royal Hotel (rear):** Behind the hotel, a substantial section of the wall, largely medieval rebuild with archer windows, exists. However, by looking down, distinctive bands of red bricks reveal the original Roman section. Passageway exists via steps through a low medieval arch or around the wall's end, leading to a staff entrance and a backstreet.\n\n3.  **The City Wall at Vine Street (cafe terrace):** A museum exhibit with excavations and finds, including a Greek tombstone and a cat skeleton, displays a towering section of the Roman Wall. Uniquely, this contains remains of an original postern. What makes it weird is that it is below a cafe where students are enjoying food and drinks. Visitors can view the wall while enjoying refreshments.\n\n4.  **London Wall Car Park:** Hidden beneath the London Wall dual carriageway, at the far end of a grim subterranean car park, a substantial chunk of the Roman Wall slots in diagonally. Protective blocks and a glass screen are in place to prevent damage, but the contrasts between the ancient structure and the modern car park create an incongruous scene.\n",
    "chinese_title": "探索伦敦罗马墙的四个奇特地点",
    "chinese_summary": "钻石大佬博客（2025年11月11日）探讨了伦敦市四个可以观察到罗马城墙遗迹的非同寻常的地点。\n\n1.  **塔丘站（1号站台）：** 在1号站台后方，穿过铁轨，可以看到一段光线昏暗的原始罗马城墙。虽然只剩下一小块凹陷区域，但这是一个奇特的发现。一块牌匾证实了它与外面可见的墙壁的联系，但1882年环线地铁的建设导致22米长的城墙被拆除，只留下了这一小部分。\n\n2.  **莱昂纳多皇家酒店（后方）：** 酒店后面，有一段相当长的城墙，大部分是中世纪重建的，带有弓箭手窗户。然而，向下看，独特的红色砖带揭示了最初的罗马部分。可通过穿过低矮的中世纪拱门的台阶或绕过墙的末端进入通道，通往员工入口和一条小街。\n\n3.  **葡萄街的城墙（咖啡厅露台）：** 博物馆展出了一段高耸的罗马城墙，其中有挖掘物和发现，包括一块希腊墓碑和一副猫骨骼。独特的是，这里包含一个原始的小门遗迹。奇怪之处在于它位于一家咖啡馆下方，学生们正在那里享用食物和饮料。游客可以在享用茶点时欣赏城墙。\n\n4.  **伦敦墙停车场：** 隐藏在伦敦墙双车道下方，在一个阴暗的地下停车场的尽头，一大块罗马城墙斜向插入。为了防止损坏，设置了保护性街区和玻璃屏障，但古老的建筑和现代停车场之间的对比形成了一种不协调的场景。"
  },
  {
    "id": "45893095",
    "title": "I didn't reverse-engineer the protocol for my blood pressure monitor in 24 hours",
    "url": "https://james.belchamber.com/articles/blood-pressure-monitor-reverse-engineering/",
    "summary": "The author received a blood pressure test after a flu vaccine, which yielded concerning results. To investigate further, they were given a 24-hour blood pressure monitor, the Microlife WatchBP O3. Dissatisfied with the closed-off nature of the device, the author attempted to reverse-engineer its communication protocol to access the data directly.\n\nThey started by trying the official Windows software in a Bottles container, but ended up using a Windows VM to access the data. They then used Wireshark to capture the USB traffic between the VM and the device, hoping to decode the blood pressure readings.\n\nBy examining the data packets, the author identified bytes corresponding to Systolic (SYS), Diastolic (DIA) blood pressure, and Heart Rate (HR). They attempted to decipher the timestamps and Oscillometric signal peak pressure (OPP) but encountered difficulties, trying different endianness and feeding the data to AIs.\n\nDespite initial progress, the author ran out of time and had to return the device before fully reverse-engineering the protocol. While they enjoyed the challenge and learned about USB communication, they ultimately failed to meet their self-imposed 24-hour deadline. The experience also led them to learn about Normotension and White Coat Hypertension, suggesting the high initial reading was likely due to the clinical setting and recent injection.\n",
    "chinese_title": "我没有在24小时内逆向工程我的血压监测仪的协议。",
    "chinese_summary": "作者在接种流感疫苗后进行了血压测试，结果令人担忧。为了进一步调查，他们被提供了一个24小时血压监测仪，即Microlife WatchBP O3。由于对该设备的封闭性感到不满，作者试图对其通信协议进行逆向工程，以直接访问数据。\n\n他们最初尝试在Bottles容器中使用官方Windows软件，但最终还是使用了Windows虚拟机来访问数据。然后，他们使用Wireshark捕获虚拟机和设备之间的USB流量，希望能解码血压读数。\n\n通过检查数据包，作者识别出对应于收缩压(SYS)、舒张压(DIA)和心率(HR)的字节。他们试图破译时间戳和示波脉冲峰值压力(OPP)，但遇到了困难，尝试了不同的字节序并将数据提供给人工智能。\n\n尽管取得了一些初步进展，但作者时间不够，必须在完全逆向工程协议之前归还设备。虽然他们享受了挑战并了解了USB通信，但最终未能达到自己设定的24小时期限。这次经历也让他们了解了正常血压和白大衣高血压，表明最初的高血压读数很可能是由于临床环境和最近的注射造成的。"
  },
  {
    "id": "45893986",
    "title": ".NET MAUI is coming to Linux and the browser",
    "url": "https://avaloniaui.net/blog/net-maui-is-coming-to-linux-and-the-browser-powered-by-avalonia",
    "summary": "This article announces that .NET MAUI is coming to Linux and the browser, powered by Avalonia. The Avalonia MAUI Backend allows developers to use their existing MAUI codebase while replacing the rendering layer with Avalonia, effectively extending MAUI apps to more platforms and enhancing desktop performance.\n\nKey benefits include:\n\n*   **Linux Support:** .NET MAUI apps can run as first-class desktop applications on Linux distributions and embedded devices.\n*   **WebAssembly Support:** MAUI apps can now run in the browser without plugins via WebAssembly.\n*   **Improved Performance:** Early testing suggests significant performance improvements on macOS compared to Mac Catalyst.\n*   **Consistent UI:** Applications will have consistent look and feel across Windows, macOS, Linux, mobile, and the browser.\n*   **Simplified Development:** Maintaining one Avalonia target instead of separate implementations for each platform streamlines development and reduces platform-specific bugs.\n\nAvalonia is building this backend to support .NET developers, learn from MAUI's needs, and strengthen its own platform. By using Avalonia, MAUI developers gain access to a mature, drawn UI framework with hardware-accelerated rendering, consistent styling, and broad platform coverage. The collaboration with the Flutter team to bring Impeller to .NET will further improve rendering performance. The source code will be released as open source under the MIT license once stable.\n",
    "chinese_title": ".NET MAUI 即将登陆 Linux 和浏览器",
    "chinese_summary": ".NET MAUI即将登陆Linux和浏览器，由Avalonia提供支持。Avalonia MAUI后端使开发人员能够使用其现有的MAUI代码库，同时用Avalonia替换渲染层，从而有效地将MAUI应用程序扩展到更多平台并提高桌面性能。\n\n主要优势包括：\n\n*   **Linux支持：**.NET MAUI应用程序可以在Linux发行版和嵌入式设备上作为一流的桌面应用程序运行。\n*   **WebAssembly支持：**MAUI应用程序现在可以通过WebAssembly在浏览器中运行，无需插件。\n*   **性能提升：**早期测试表明，与Mac Catalyst相比，macOS上的性能显著提高。\n*   **一致的UI：**应用程序在Windows、macOS、Linux、移动设备和浏览器上将具有一致的外观和感觉。\n*   **简化开发：**维护一个Avalonia目标，而不是为每个平台单独实现，从而简化了开发并减少了平台特定的错误。\n\nAvalonia正在构建此后端以支持.NET开发人员，从MAUI的需求中学习并加强其自身平台。通过使用Avalonia，MAUI开发人员可以访问成熟的、绘制的UI框架，该框架具有硬件加速渲染、一致的样式和广泛的平台覆盖。与Flutter团队合作将Impeller引入.NET将进一步提高渲染性能。源代码稳定后将以MIT许可证开源发布。"
  },
  {
    "id": "45897122",
    "title": "Simulating a Planet on the GPU: Part 1 (2022)",
    "url": "https://www.patrickcelentano.com/blog/planet-sim-part-1",
    "summary": "In this blog post from June 2022, the author describes their ambitious project to create a realistic planetary simulation, motivated by a desire for a modern \"SimEarth\" experience. They detail their multi-stage development journey, highlighting the challenges and lessons learned along the way.\n\nInitially, the author experimented with polygon-based approaches using Delaunay Triangulation and Voronoi Tessellation within Unity and C#. However, performance limitations, particularly regarding realistic tectonic plate collision modeling, led them to explore GPU-based solutions.\n\nThey then delved into compute shaders, leveraging the GPU's parallel processing power to simulate tectonic plates represented as cubemaps. While successful in creating plate collisions and subduction, the system lacked realistic crust deformation.\n\nInspired by a physical simulation of plate boundaries using sand, the author embraced Smoothed-Particle Hydrodynamics (SPH) to simulate crust deformation using individual \"crust\" particles. This involved significant experimentation and learning related to compute shader optimization, especially regarding memory management on the GPU.\n\nThe author concludes by outlining future development goals, including visualizing ocean and air currents, simulating precipitation and weather patterns, adding geological features like volcanoes, and optimizing the simulation for a wider range of hardware. They express satisfaction with the project's progress and anticipate a \"part 2\" blog post detailing further advancements. A link to download the current state of the project is also provided.\n",
    "chinese_title": "在 GPU 上模拟行星：第一部分 (2022)",
    "chinese_summary": "在这篇2022年6月的博文中，作者描述了他们雄心勃勃的项目，即创建一个逼真的行星模拟，其动机是渴望获得现代版的“模拟地球”体验。他们详细介绍了他们的多阶段开发历程，重点介绍了沿途的挑战和经验教训。\n\n最初，作者尝试了使用Unity和C#中的Delaunay三角剖分和Voronoi泰森多边形方法的基于多边形的方法。然而，性能限制，尤其是在逼真的板块构造碰撞建模方面，促使他们探索基于GPU的解决方案。\n\n随后，他们深入研究了计算着色器，利用GPU的并行处理能力来模拟表示为立方体贴图的板块构造。虽然成功地创建了板块碰撞和俯冲，但该系统缺乏逼真的地壳变形。\n\n受到使用沙子进行的板块边界物理模拟的启发，作者采用了平滑粒子流体动力学（SPH）来模拟使用单个“地壳”粒子的地壳变形。这涉及大量的实验和学习，涉及计算着色器优化，尤其是在GPU上的内存管理方面。\n\n作者最后概述了未来的开发目标，包括可视化海洋和气流、模拟降水和天气模式、添加火山等地质特征，以及优化模拟以适应更广泛的硬件。他们对项目的进展表示满意，并期待一篇“第二部分”的博文，详细介绍进一步的进展。还提供了下载项目当前状态的链接。"
  },
  {
    "id": "45810909",
    "title": "Seaque Live Bell Test",
    "url": "https://research.physics.illinois.edu/QI/Photonics/SEAQUE/",
    "summary": "The SEAQUE (Space Entanglement and Annealing Quantum Experiment) is a project utilizing the International Space Station (ISS) to study quantum entanglement. A key component of the experiment involves a game called Quantum Satellite where player decisions directly influence the measurements made on entangled photons.\n\nEvery choice a player makes in the game generates a random number (0 or 1) used to determine how the entangled photons are measured. These random choices contribute to a Bell Inequality Violation test, which assesses the quality of entanglement between the photons. The more unpredictable the player's choices, the better the experiment can determine if the correlated properties of the photons are due to entanglement, rather than some hidden common cause.\n\nWhile SEAQUE creates and measures photons locally on the ISS, the ultimate goal is to use space as a platform to distribute entangled photons to distant ground stations. SEAQUE is a vital step toward building a space-based quantum network. Furthermore, SEAQUE aims to \"anneal\" or repair radiation damage to the single-photon detectors on board, potentially extending the lifespan of future quantum missions.\n\nThe project is a collaborative effort involving multiple institutions and has garnered attention from various news outlets. By playing the Quantum Satellite game, individuals directly contribute to quantum science research in space.\n",
    "chinese_title": "Seaque Live Bell 测试",
    "chinese_summary": "The SEAQUE (Space Entanglement and Annealing Quantum Experiment) is a project utilizing the International Space Station (ISS) to study quantum entanglement. A key component of the experiment involves a game called Quantum Satellite where player decisions directly influence the measurements made on entangled photons.\n\nEvery choice a player makes in the game generates a random number (0 or 1) used to determine how the entangled photons are measured. These random choices contribute to a Bell Inequality Violation test, which assesses the quality of entanglement between the photons. The more unpredictable the player's choices, the better the experiment can determine if the correlated properties of the photons are due to entanglement, rather than some hidden common cause.\n\nWhile SEAQUE creates and measures photons locally on the ISS, the ultimate goal is to use space as a platform to distribute entangled photons to distant ground stations. SEAQUE is a vital step toward building a space-based quantum network. Furthermore, SEAQUE aims to \"anneal\" or repair radiation damage to the single-photon detectors on board, potentially extending the lifespan of future quantum missions.\n\nThe project is a collaborative effort involving multiple institutions and has garnered attention from various news outlets. By playing the Quantum Satellite game, individuals directly contribute to quantum science research in space.\n"
  },
  {
    "id": "45892191",
    "title": "The terminal of the future",
    "url": "https://jyn.dev/the-terminal-of-the-future",
    "summary": "This article envisions a future terminal that transcends the limitations of current VT100 emulators by drawing inspiration from Jupyter Notebooks. The author identifies four key components of a terminal: the emulator, pseudo-terminal (PTY), shell, and spawned programs, highlighting the limitations of traditional terminals concerning rich formatting, command history, and persistence.\n\nThe proposed \"terminal of the future\" would incorporate Jupyter-like features such as high-fidelity image rendering, \"rerun\" functionality, and rewritable \"views.\" It addresses challenges like command-by-command execution, long-lived processes (e.g., `vi`, `top`), undo/redo functionality, and data persistence. Solutions include leveraging shell integration, similar to Warp and iTerm2, for command awareness and pretty rendering. For long-lived processes, the design emphasizes interactive outputs, automatic \"free input cells,\" and persistent visuals for suspended processes. The author explores existing approaches for session disconnection/reconnection (tmux, Mosh, alden/shpool/etc.) and advocates for dataflow tracking for undo/redo and automatic rerun capabilities.\n\nThe article outlines derived features enabled by these primitives, spanning runbooks, customizable CSS, smart search, timestamps, IntelliSense, collaborative terminals, and LLM integration. The author suggests a phased implementation approach, starting with:\n\n*   **Stage 1:** Transactional semantics via a CLI, enabling undoable operations.\n*   **Stage 2:** Decoupled persistence from tools like tmux and mosh, achieving PTY persistence, scrollback, and network resumption.\n*   **Stage 3:** Structured RPC facilitated by the client/server model.\n*   **Stage 4:** Jupyter-like Frontend.\n\nThis incremental adoption aims to provide improvements at each stage, minimizing switching costs.\n",
    "chinese_title": "未来的终端",
    "chinese_summary": "本文设想了一种未来的终端，它通过借鉴Jupyter Notebooks，超越当前VT100仿真器的局限性。作者识别了终端的四个关键组成部分：仿真器、伪终端(PTY)、Shell和衍生的程序，并强调了传统终端在富格式、命令历史和持久性方面的局限性。\n\n所提出的“未来终端”将融入类似Jupyter的功能，例如高保真图像渲染、“重运行”功能和可重写的“视图”。它解决了诸如逐条命令执行、长期运行的进程（例如`vi`、`top`）、撤销/重做功能和数据持久性等挑战。解决方案包括利用类似于Warp和iTerm2的Shell集成，以实现命令感知和美观的渲染。对于长期运行的进程，该设计强调交互式输出、自动“自由输入单元”和挂起进程的持久可视化。作者探讨了用于会话断开/重新连接的现有方法（tmux、Mosh、alden/shpool/etc.），并倡导使用数据流跟踪来实现撤销/重做和自动重运行功能。\n\n文章概述了由这些原语启用的衍生功能，涵盖运行手册、可定制的CSS、智能搜索、时间戳、IntelliSense、协作终端和LLM集成。作者建议采用分阶段的实施方法，从以下几个阶段开始：\n\n* **第一阶段：** 通过CLI实现事务语义，从而实现可撤销的操作。\n* **第二阶段：** 将持久性与tmux和mosh等工具解耦，实现PTY持久性、回滚和网络恢复。\n* **第三阶段：** 客户端/服务器模型促进的结构化RPC。\n* **第四阶段：** 类似Jupyter的前端。\n\n这种增量采用旨在在每个阶段提供改进，从而最大限度地降低切换成本。"
  },
  {
    "id": "45896130",
    "title": "Perkeep – Personal storage system for life",
    "url": "https://perkeep.org/",
    "summary": "Perkeep (formerly Camlistore) is an open-source personal storage system designed for long-term data preservation and management in the post-PC era. It allows users to store various types of data, from files and objects to social media posts and large videos, accessible through multiple platforms like phones, browsers, and FUSE filesystems.\n\nKey features and principles of Perkeep include:\n\n*   **User Control:** Emphasizes complete user control over their data.\n*   **Open Source:** Based on open-source formats, protocols, and software.\n*   **Privacy-Focused:** Prioritizes privacy by default.\n*   **No Single Point of Failure:** Avoids reliance on any single entity for data storage.\n*   **Longevity:** Aims to ensure data accessibility and preservation for the long term (80+ years).\n\nThe project is under active development and may contain bugs and unfinished features, making it more suitable for technical users. The latest release, 0.12 (\"Toronto\"), was released in 2025-11-11. New users can download and follow setup instructions to begin using Perkeep. Demonstrations and presentations are available, including a LinuxFest Northwest 2018 presentation with slides and video. Contributions and bug reports are welcome.\n",
    "chinese_title": "Perkeep – 个人终身存储系统",
    "chinese_summary": "Perkeep (原 Camlistore) 是一款开源个人存储系统，专为后PC时代的数据长期保存和管理而设计。它允许用户存储各种类型的数据，从文件和对象到社交媒体帖子和大型视频，并可通过手机、浏览器和 FUSE 文件系统等多个平台访问。\n\nPerkeep 的主要特性和原则包括：\n\n*   **用户控制：** 强调用户对其数据的完全控制。\n*   **开源：** 基于开源格式、协议和软件。\n*   **隐私优先：** 默认情况下优先考虑隐私。\n*   **无单点故障：** 避免依赖任何单一实体进行数据存储。\n*   **长期性：** 旨在确保数据的长期（80年以上）可访问性和保存。\n\n该项目正在积极开发中，可能包含错误和未完成的功能，因此更适合技术用户。最新版本 0.12（“多伦多”）于 2025-11-11 发布。新用户可以下载并按照设置说明开始使用 Perkeep。演示和演示文稿均可使用，包括 LinuxFest Northwest 2018 的幻灯片和视频演示。欢迎贡献和错误报告。"
  },
  {
    "id": "45887957",
    "title": "Pikaday: A friendly guide to front-end date pickers",
    "url": "https://pikaday.dbushell.com",
    "summary": "This article challenges the common reliance on JavaScript date pickers for front-end development, arguing that simpler, more user-friendly alternatives often exist. It advocates for using native HTML date and time input types, highlighting their built-in accessibility, performance, and internationalization support.\n\nThe author suggests various alternatives to traditional date pickers, including:\n\n*   **Separate inputs:** Breaking down the date into day, month, and year fields.\n*   **Select elements:** Using dropdown menus for limited date options.\n*   **Masked inputs:** Employing a single input field with a placeholder mask.\n*   **Ranges and limited options:** Using two inputs or radio buttons to simplify range selection.\n*   **Free text and suggestions:** Allowing users to enter dates freely with the aid of the datalist element.\n\nThe article emphasizes the importance of accessibility and warns against the pitfalls of complex custom UI, which can lead to errors and accessibility issues. It suggests leveraging web standards and browser dev tools for testing accessibility. The author refuses to recommend a JavaScript date picker, stressing that there is no perfect solution and encourages developers to evaluate their specific needs and prioritize simplicity and user feedback.\n",
    "chinese_title": "Pikaday：前端日期选择器友好指南",
    "chinese_summary": "本文挑战了前端开发中对JavaScript日期选择器普遍依赖的现象，认为通常存在更简单、更友好的替代方案。它提倡使用原生HTML日期和时间输入类型，强调其内置的可访问性、性能和国际化支持。\n\n作者提出了传统日期选择器的多种替代方案，包括：\n\n*   **分离式输入框：** 将日期分解为日、月和年字段。\n*   **Select元素：** 使用下拉菜单选择有限的日期选项。\n*   **带掩码输入框：** 使用带有占位符掩码的单个输入框。\n*   **范围和有限选项：** 使用两个输入框或单选按钮来简化范围选择。\n*   **自由文本和建议：** 允许用户自由输入日期，并借助datalist元素提供建议。\n\n本文强调了可访问性的重要性，并警告了复杂自定义UI的陷阱，这些陷阱可能导致错误和可访问性问题。它建议利用Web标准和浏览器开发工具来测试可访问性。作者拒绝推荐任何JavaScript日期选择器，强调没有完美的解决方案，并鼓励开发人员评估其特定需求，优先考虑简洁性和用户反馈。"
  },
  {
    "id": "45797337",
    "title": "Stochastic computing",
    "url": "https://scottlocklin.wordpress.com/2025/10/31/stochastic-computing/",
    "summary": "Scott Locklin's blog post explores the concept of stochastic computing, an older computational architecture that uses streams of random bits to represent numbers, offering advantages in noise immunity and hardware simplicity compared to traditional digital and analog computers. He revisits the history of stochastic computing from the 1960s, when it was competitive with supercomputers and used in early neural networks, highlighting its relevance to machine learning, particularly in modeling probabilities.\n\nLocklin notes that stochastic computing could be more energy-efficient than current methods, making it potentially relevant to modern deep learning. He speculates that the startup Extropic might be reviving this approach, although their communication is unclear. Despite the ambiguity, he advocates for investing in innovative computing architectures like stochastic computing instead of overhyped technologies like quantum computing.\n\nThe post emphasizes the potential of stochastic computing to efficiently handle probabilistic models and machine learning tasks, drawing parallels to techniques like dropout and regularization. He touches upon the basic principles of stochastic computing, noting how mathematical operations can be implemented, and highlighting that uncorrelated, rather than perfectly random, bitstreams are sufficient. He concludes by expressing hope for a resurgence in this technology and advocating for more investment in such potentially groundbreaking areas of research.\n",
    "chinese_title": "随机计算",
    "chinese_summary": "斯科特·洛克林在他的博文中探讨了随机计算的概念。这是一种较早的计算架构，使用随机比特流来表示数字，与传统的数字和模拟计算机相比，在抗噪声和硬件简易性方面具有优势。他回顾了随机计算从20世纪60年代至今的历史，当时它与超级计算机竞争，并被用于早期的神经网络，突出了它与机器学习的相关性，尤其是在概率建模方面。\n\n洛克林指出，随机计算可能比目前的方法更节能，使其可能与现代深度学习相关。他推测初创公司Extropic可能正在复兴这种方法，尽管他们的沟通并不明确。尽管存在模糊性，他仍然主张投资于像随机计算这样的创新计算架构，而不是过度炒作的技术，例如量子计算。\n\n该博文强调了随机计算在高效处理概率模型和机器学习任务方面的潜力，并将其与dropout和正则化等技术相提并论。他提到了随机计算的基本原理，说明了如何实现数学运算，并强调非相关而非完全随机的比特流就足够了。最后，他表达了对这项技术复兴的希望，并倡导对这种可能具有突破性研究领域进行更多投资。"
  },
  {
    "id": "45887699",
    "title": "The Department of War just shot the accountants and opted for speed",
    "url": "https://steveblank.com/2025/11/11/the-department-of-war-just-shot-the-accountants-and-opted-for-speed/",
    "summary": "Steve Blank's article \"The Department of War Just Shot the Accountants and Opted for Speed\" details a major shift in the Department of War's (DoW) acquisition strategy, moving from a cost and performance optimization model to prioritizing rapid delivery of advanced weapons. The DoW is abandoning Robert McNamara’s 1962 Planning, Programming, and Budgeting System (PPBS) in favor of Lean Methodology to compete with adversaries like China who have more agile systems.\n\nKey changes include prioritizing off-the-shelf technology over custom-designed weapons and utilizing fast-track acquisition processes instead of cumbersome Federal Acquisition Regulations (FAR). To facilitate this, the DoW is reorganizing its Acquisition ecosystem across the Services, implementing advice ignored for the past decade.\n\nThe core of the reform involves creating Portfolio Acquisition Executives (PAEs) responsible for the entire acquisition process, from concept to sustainment, and organized around Warfighting Concepts. PAEs will have authority to make trade-offs between cost, schedule, and performance, and are mandated to prioritize Commercial Off the Shelf (COTS) products. Incentive compensation will be tied to capability delivery time and mission outcomes.\n\nThe DoW is also using Non-FAR regulations like OTAs (Other Transaction Authorities) for greater flexibility and to engage with a wider range of innovative commercial companies and startups. Ultimately, the aim is to operate at the speed of Silicon Valley, deliver better technology faster, and provide warfighters with a military second to none.\n",
    "chinese_title": "战争部刚刚解雇了会计师，选择了速度。",
    "chinese_summary": "史蒂夫·布兰克的文章《战争部枪毙了会计师，选择了速度》详细描述了战争部（DoW）采购战略的重大转变，即从成本和性能优化模式转向优先快速交付先进武器。为了与拥有更敏捷系统的中国等对手竞争，战争部正在放弃罗伯特·麦克纳马拉1962年的计划、规划和预算系统（PPBS），转而采用精益方法。\n\n主要变化包括优先考虑现成技术而非定制武器，以及利用快速通道采购流程代替繁琐的联邦采购条例（FAR）。为了促进这一点，战争部正在跨部门重组其采购生态系统，实施过去十年被忽视的建议。\n\n改革的核心是创建投资组合采购执行官（PAE），负责从概念到维持的整个采购过程，并围绕作战概念组织。PAE将有权在成本、进度和性能之间进行权衡，并且必须优先考虑商业现成品（COTS）。激励性薪酬将与能力交付时间和任务成果挂钩。\n\n战争部还在使用非FAR法规，如OTAs（其他交易授权），以获得更大的灵活性，并与更广泛的创新型商业公司和初创公司互动。最终目标是以硅谷的速度运作，更快地交付更好的技术，并为战士提供首屈一指的军事力量。"
  },
  {
    "id": "45860552",
    "title": "The history of Casio watches",
    "url": "https://www.casio.com/us/watches/50th/Heritage/1970s/",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "卡西欧手表历史",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "45891016",
    "title": "FFmpeg to Google: Fund us or stop sending bugs",
    "url": "https://thenewstack.io/ffmpeg-to-google-fund-us-or-stop-sending-bugs/",
    "summary": "This is a subscription form for \"The New Stack\" newsletter, aimed at software engineering leaders and developers. It focuses on at-scale software development news and exclusive content. The form requires users to provide an email address and resubscribe if they've unsubscribed previously. Beyond basic contact information (first name, last name, company name, country, zipcode), the form gathers demographic data to personalize the newsletter experience. It asks for job level, role, company size, organization type (end-user, vendor, cloud provider, etc.), and primary industry. An optional LinkedIn profile URL is also requested. Upon completion, subscribers receive a confirmation email with options to adjust preferences and join additional groups and are encouraged to follow The New Stack on social media and browse featured stories. The New Stack promises to not sell or share user information with unaffiliated third parties, adhering to their Terms of Use and Privacy Policy.\n",
    "chinese_title": "FFmpeg致谷歌：要么资助我们，要么别再发漏洞报告",
    "chinese_summary": "这是“The New Stack”时事通讯的订阅表格，面向软件工程领导者和开发者。它专注于大规模软件开发新闻和独家内容。该表格要求用户提供电子邮件地址，如果之前取消订阅，则需要重新订阅。除了基本联系信息（名、姓、公司名称、国家、邮政编码）之外，该表格还收集人口统计数据，以个性化时事通讯体验。它询问职位级别、角色、公司规模、组织类型（最终用户、供应商、云提供商等）以及主要行业。还要求提供可选的LinkedIn个人资料URL。完成后，订阅者会收到一封确认电子邮件，其中包含调整偏好和加入其他群组的选项，并鼓励他们在社交媒体上关注The New Stack以及浏览精选文章。The New Stack承诺不会出售或与非附属第三方分享用户信息，并遵守其使用条款和隐私政策。"
  },
  {
    "id": "45891907",
    "title": "A modern 35mm film scanner for home",
    "url": "https://www.soke.engineering/",
    "summary": "Knokke is a modern 35mm film scanner designed for both individual users and lab professionals. It boasts state-of-the-art hardware, including a backside-illuminated CMOS sensor, custom optics, and an RGB LED backlight, enabling high-resolution scans (4064 DPI) with a wide dynamic range (120 dB) and 48-bit color depth. A full roll of film can be scanned in under 5 minutes.\n\nThe scanner uses Korova, custom-built open-source software compatible with Windows, macOS, and Linux, offering per-frame scan settings and the ability to skip to specific frames for efficient workflows. It supports various file formats including RAW, TIFF, DNG, JPEG, and PNG.\n\nKnokke emphasizes quality, speed, full control, and future-proofing through its precision engineering, fast scan times, flexible settings, ongoing software support, open-source nature, and readily available spare parts. It reads 35mm DX codes to embed film metadata.\n\nThe launch price is set at €999, including the scanner and software, with a retail price of €1599.\n\nKnokke will launch on Kickstarter in Q1 2026 and will support any frame width on 35mm film. The company plans to share example scans before the Kickstarter launch and is considering 120 film support in the future.\n",
    "chinese_title": "家用现代35毫米胶片扫描仪",
    "chinese_summary": "Knokke：一款专为个人用户和专业实验室设计的现代35毫米胶片扫描仪。它拥有最先进的硬件，包括背照式CMOS传感器、定制光学元件和RGB LED背光，能够实现高分辨率扫描（4064 DPI），具有宽广的动态范围（120 dB）和48位色彩深度。一整卷胶片可在5分钟内扫描完成。\n\n该扫描仪使用Korova，一款定制的开源软件，兼容Windows、macOS和Linux，提供逐帧扫描设置，并能够跳至特定帧，从而实现高效的工作流程。它支持多种文件格式，包括RAW、TIFF、DNG、JPEG和PNG。\n\nKnokke强调质量、速度、完全控制和面向未来的特性，这体现在其精密工程、快速扫描时间、灵活的设置、持续的软件支持、开源性质以及易于获得的备件。它读取35毫米DX代码以嵌入胶片元数据。\n\n发售价格定为999欧元，包括扫描仪和软件，零售价为1599欧元。\n\nKnokke将于2026年第一季度在Kickstarter上推出，并将支持35毫米胶片上的任何帧宽。该公司计划在Kickstarter发布前分享示例扫描，并正在考虑未来支持120胶片。"
  },
  {
    "id": "45830178",
    "title": "My fan worked fine, so I gave it WiFi",
    "url": "https://ellis.codes/blog/my-fan-worked-fine-so-i-gave-it-wi-fi/",
    "summary": "This article details the author's project to add WiFi control to a Vornado 633DC fan while maintaining a fully revertible modification. The initial motivation stemmed from the desire to remotely adjust the fan's speed, not just turn it on/off via a smart plug.\n\nThe author reverse-engineered the fan's internal circuitry, discovering that the fan speed was controlled by a variable resistance from a potentiometer. They then implemented a digital potentiometer (digipot) controlled by an ESP32-C6-WROOM-1 microcontroller running ESPHome. This allowed for remote control of the fan speed.\n\nThe project involved designing a custom PCB to fit within the fan's housing, carefully selecting components based on power requirements and available ESPHome support. They also integrated a rotary encoder for physical speed control and an RGB LED for status feedback. The original potentiometer was replaced with the rotary encoder, preserving a manual interface but with infinite rotation.\n\nThe PCB design was ordered from JLCPCB, with most components pre-soldered. ESPHome was configured to manage the digipot, rotary encoder, and LED. The author emphasizes that the modification is fully revertible, requiring no permanent alterations to the original fan. The ultimate goal was achieved: remote fan speed control without physical interaction, while also retaining the original manual control option. The schematic, PCB design, Bill of Materials, and ESPHome configuration are all made available for others to replicate the project.\n",
    "chinese_title": "我的风扇本来好好的，我给它连了WiFi。",
    "chinese_summary": "为Vornado 633DC风扇添加WiFi控制，并保持完全可逆的改装方案\n\n本文详细介绍了作者为Vornado 633DC风扇添加WiFi控制的项目，同时保持完全可逆的改装。最初的动机是希望远程调节风扇转速，而不仅仅是通过智能插座开关风扇。\n\n作者对风扇的内部电路进行了逆向工程，发现风扇转速由电位器的可变电阻控制。然后，他们实现了一个由运行ESPHome的ESP32-C6-WROOM-1微控制器控制的数字电位器 (digipot)。这实现了对风扇转速的远程控制。\n\n该项目涉及设计一个定制PCB，使其能够安装在风扇外壳内，并根据电源要求和可用的ESPHome支持精心选择组件。他们还集成了一个旋转编码器用于物理速度控制，以及一个RGB LED用于状态反馈。原来的电位器被旋转编码器取代，保留了手动界面，但具有无限旋转的功能。\n\nPCB设计从JLCPCB订购，大部分元件都已预焊。ESPHome被配置为管理数字电位器、旋转编码器和LED。作者强调，该改装是完全可逆的，不需要对原风扇进行永久性改动。最终目标得以实现：无需物理交互即可远程控制风扇速度，同时保留了原始的手动控制选项。原理图、PCB设计、物料清单和ESPHome配置均已提供，供他人复制该项目。"
  },
  {
    "id": "45892773",
    "title": "Meticulous (YC S21) is hiring to redefine software dev",
    "url": "https://jobs.ashbyhq.com/meticulous/3197ae3d-bb26-4750-9ed7-b830f640515e",
    "summary": "This is a job posting from Meticulous (YC S21) for a Software Engineer. The company's stated goal is to redefine software development. The key takeaway is that Meticulous is hiring for this purpose. Further details about the role, responsibilities, and qualifications are unavailable without JavaScript being enabled. Therefore, the summary is limited to the fact that Meticulous is actively recruiting a Software Engineer to contribute to their mission of changing software development.\n",
    "chinese_title": "Meticulous (YC S21) 招聘，重新定义软件开发",
    "chinese_summary": "Meticulous (YC S21) 招聘软件工程师，致力于重新定义软件开发。关键信息是，Meticulous 正在为此目的招贤纳士。 由于未启用 JavaScript，无法获取有关职位、职责和资格的更多详细信息。因此，摘要仅限于 Meticulous 正在积极招聘一名软件工程师，以助力其改变软件开发的使命。"
  },
  {
    "id": "45900370",
    "title": "Fighting the New York Times' invasion of user privacy",
    "url": "https://openai.com/index/fighting-nyt-user-privacy-invasion",
    "summary": "Okay, I can summarize the article based on the title \"Fighting the New York Times' invasion of user privacy,\" assuming it's about a legal or technical conflict between OpenAI and the New York Times concerning user data and privacy.\n\n**Summary:**\n\nBased on the title, the article likely details a dispute between OpenAI and The New York Times (NYT) regarding OpenAI's alleged infringement on user privacy. It suggests that the NYT is accusing OpenAI of inappropriately accessing or utilizing user data, potentially through the scraping of NYT content to train its AI models like GPT.\n\nThe article, presumably published by OpenAI, would likely present their defense, arguing that their data collection and usage practices are either within legal and ethical boundaries, or that the NYT's claims are inaccurate or exaggerated. OpenAI would likely emphasize the public benefit of AI development and innovation, and that their methods are necessary for creating effective and helpful AI systems.\n\nThe piece might discuss the specific data at the center of the dispute, the ways OpenAI claims it is used, and the safeguards they have in place to protect user privacy. It might also address the broader implications of the conflict for the future of AI training and the balance between innovation and data privacy. Ultimately, the article probably aims to refute the NYT's accusations and defend OpenAI's stance on user privacy.\n\nPlease remember this is a summary based on the title alone. If you can provide the article content, I can give you a much more accurate summary.\n",
    "chinese_title": "对抗《纽约时报》对用户隐私的侵犯",
    "chinese_summary": "好的，我可以基于标题“对抗《纽约时报》对用户隐私的侵犯”来总结这篇文章，假设它讲述了OpenAI和《纽约时报》之间关于用户数据和隐私的法律或技术冲突。\n\n**摘要：**\n\n根据标题，这篇文章很可能详细描述了OpenAI和《纽约时报》（NYT）之间关于OpenAI涉嫌侵犯用户隐私的纠纷。它暗示《纽约时报》指责OpenAI不适当地访问或利用用户数据，可能是通过抓取《纽约时报》的内容来训练其GPT等AI模型。\n\n这篇文章，大概是由OpenAI发布的，很可能会提出他们的辩护，辩称他们的数据收集和使用行为要么在法律和道德范围内，要么《纽约时报》的说法是不准确或夸大的。OpenAI可能会强调AI发展和创新的公共利益，并认为他们的方法对于创建有效且有用的AI系统是必要的。\n\n这篇文章可能会讨论争端核心的具体数据，OpenAI声称的使用方式，以及他们为保护用户隐私而采取的保障措施。它也可能探讨这场冲突对AI训练的未来以及创新和数据隐私之间平衡的更广泛影响。最终，这篇文章的目的可能是驳斥《纽约时报》的指控，并捍卫OpenAI在用户隐私方面的立场。\n\n请记住，这只是基于标题的摘要。如果您能提供文章内容，我可以为您提供更准确的摘要。\n\n对抗《纽约时报》侵犯用户隐私 – 摘要"
  },
  {
    "id": "45893646",
    "title": "Heroku Support for .NET 10",
    "url": "https://www.heroku.com/blog/support-for-dotnet-10-lts-what-developers-need-know/",
    "summary": "This article focuses on Heroku's support for .NET 10 LTS (Long-Term Support) and what developers need to understand when deploying .NET 10 applications on the platform.\n\nThe key takeaway is that while .NET Core 3.1 (the predecessor) is approaching end-of-life, .NET 10 LTS offers a continued and more stable environment for .NET applications on Heroku. Developers should migrate to .NET 10 to maintain security and compatibility.\n\nThe article likely covers topics such as:\n\n*   **The end-of-life date for .NET Core 3.1** and the risks associated with continuing to use it (security vulnerabilities, lack of updates).\n*   **The benefits of migrating to .NET 10 LTS:** stability, long-term support, performance improvements, new features.\n*   **Heroku buildpacks and configurations** required for deploying .NET 10 applications. This might include specifying the .NET version in the `runtime.txt` file or using environment variables.\n*   **Potential breaking changes** between .NET Core 3.1 and .NET 10 that developers need to address during migration.\n*   **Best practices for deploying .NET 10 applications on Heroku:** using environment variables for configuration, logging, monitoring, and scaling.\n*   **Resources and documentation** available to help developers with the migration and deployment process.\n\nIn essence, the article serves as a guide for .NET developers to ensure their applications remain supported and secure on Heroku by migrating to .NET 10 LTS and adapting to any necessary changes in configuration and deployment.\n",
    "chinese_title": ".NET 10的Heroku支持",
    "chinese_summary": "本文重点介绍 Heroku 对 .NET 10 LTS（长期支持）的支持，以及开发者在 Heroku 平台上部署 .NET 10 应用程序时需要了解的内容。\n\n主要结论是，虽然 .NET Core 3.1（前代版本）即将终止支持，但 .NET 10 LTS 为 Heroku 上的 .NET 应用程序提供了持续且更稳定的环境。 开发者应迁移到 .NET 10 以保持安全性和兼容性。\n\n本文可能涵盖以下主题：\n\n*   **.NET Core 3.1 的终止支持日期**以及继续使用它的相关风险（安全漏洞、缺乏更新）。\n*   **迁移到 .NET 10 LTS 的好处：**稳定性、长期支持、性能改进、新功能。\n*   **部署 .NET 10 应用程序所需的 Heroku buildpack 和配置。** 这可能包括在 `runtime.txt` 文件中指定 .NET 版本或使用环境变量。\n*   .NET Core 3.1 和 .NET 10 之间 **开发者在迁移过程中需要解决的潜在破坏性变更。**\n*   **在 Heroku 上部署 .NET 10 应用程序的最佳实践：** 使用环境变量进行配置、日志记录、监控和扩展。\n*   **可帮助开发者完成迁移和部署过程的资源和文档。**\n\n本质上，本文旨在指导 .NET 开发者通过迁移到 .NET 10 LTS 并适应配置和部署中的任何必要更改，来确保他们的应用程序在 Heroku 上保持受支持和安全。"
  },
  {
    "id": "45890186",
    "title": "We ran over 600 image generations to compare AI image models",
    "url": "https://latenitesoft.com/blog/evaluating-frontier-ai-image-generation-models/",
    "summary": "LateNiteSoft, a company specializing in iOS photography apps, conducted a comparison of AI image models (OpenAI, Gemini, and Seedream) to determine which works best for different image edits. They ran over 600 image generations using naive prompts relevant to typical user needs, like classic filters, lens effects, style transfer, portrait effects, and generative edits.\n\nTheir key finding is that no single model excels in all areas. OpenAI is superior for transformative filters like style transfer and creative edits, while Gemini is better for realistic edits, preserving details and minimizing \"AI slop,\" although it can be overly conservative and sometimes ignores prompts, especially with human subjects. Seedream strikes a balance, offering a decent performance across various tasks and potentially replacing OpenAI due to price and performance.\n\nThe tests revealed specific strengths and weaknesses. For example, Gemini struggled with heat maps and often took a literal approach to prompts like \"pinhole camera.\" OpenAI tended to alter details significantly, while Seedream showed a bias toward Asian cultural styles. The article highlighted that OpenAI excelled in prompts requiring creativity (e.g., incorporating futuristic elements), while Gemini excelled in realistic edits (e.g., applying a fish-eye lens).\n\nLateNiteSoft is considering a \"prompt classifier\" to automatically route prompts to the best model based on whether they're artistic or realistic. They also developed a \"pay per generation\"-style billing system, CreditProxy, due to issues with existing \"unlimited access\" models.\n",
    "chinese_title": "我们运行了超过600次图像生成来比较AI图像模型。",
    "chinese_summary": "LateNiteSoft公司是一家专门从事iOS摄影应用程序的公司，他们对AI图像模型（OpenAI、Gemini和Seedream）进行了比较，以确定哪种模型最适合不同的图像编辑。他们使用与典型用户需求相关的简单提示，如经典滤镜、镜头效果、风格迁移、人像效果和生成式编辑，运行了超过600次图像生成。\n\n他们的主要发现是，没有哪个模型在所有领域都表现出色。OpenAI在风格迁移和创意编辑等变革性滤镜方面表现更佳，而Gemini更擅长逼真编辑，保留细节并最大限度地减少“AI瑕疵”，尽管它可能过于保守，有时会忽略提示，尤其是在处理人类主体时。Seedream则达到了平衡，在各种任务中表现良好，并且可能因性价比而取代OpenAI。\n\n测试揭示了各自的优势和劣势。例如，Gemini在处理热图方面表现不佳，并且常常对“针孔相机”之类的提示采取字面意义的理解。OpenAI倾向于大幅改变细节，而Seedream则表现出对亚洲文化风格的偏好。文章强调，OpenAI擅长需要创造力的提示（例如，融入未来元素），而Gemini擅长逼真编辑（例如，应用鱼眼镜头）。\n\nLateNiteSoft公司正在考虑使用“提示分类器”来根据提示的艺术性或逼真性自动将提示路由到最佳模型。由于现有的“无限访问”模型存在问题，他们还开发了一种“按生成次数付费”的计费系统，CreditProxy。"
  },
  {
    "id": "45887466",
    "title": "Scaling HNSWs",
    "url": "https://antirez.com/news/156",
    "summary": "Given the incredibly short and uninformative content \"Scaling HNSWs,\" it's impossible to provide a meaningful summary beyond stating the obvious:\n\nThe article discusses the scaling of Hierarchical Navigable Small World (HNSW) graphs. Without further context, no specific scaling aspects, challenges, solutions, or findings can be summarized.\n\nTo provide a more helpful summary, I need the actual content of the article. Please provide the body of the article. I would expect such an article to discuss topics such as:\n\n*   **Dataset Size:** How the performance of HNSW (e.g., query speed, build time, memory usage) changes with increasing dataset size.\n*   **Dimensionality:** How the \"curse of dimensionality\" affects HNSW and what strategies are used to mitigate it.\n*   **Index Building:** How the time required to build the HNSW index scales with the number of data points.\n*   **Query Performance:** How query performance (speed and accuracy) is affected by scale.\n*   **Optimization Techniques:** Techniques used to optimize HNSW for large-scale datasets, such as graph pruning, compression, and distributed indexing.\n*   **Hardware Considerations:** The hardware requirements for scaling HNSW, including memory, CPU, and GPU.\n*   **Distributed HNSW:** Implementations of HNSW that can be distributed across multiple machines to handle extremely large datasets.\n",
    "chinese_title": "扩展 HNSW",
    "chinese_summary": "鉴于内容极其简短且缺乏信息，仅为“Scaling HNSWs”，除了陈述显而易见的事实之外，不可能提供有意义的总结：\n\n该文章讨论了分层可导航小世界图（HNSW）的扩展。在没有更多上下文的情况下，无法总结任何具体的扩展方面、挑战、解决方案或发现。\n\n为了提供更有帮助的总结，我需要文章的实际内容。请提供文章正文。我预计该文章会讨论以下主题：\n\n*   **数据集大小：** HNSW的性能（例如，查询速度、构建时间、内存使用量）如何随着数据集大小的增加而变化。\n*   **维度：** “维度诅咒”如何影响HNSW，以及使用哪些策略来缓解它。\n*   **索引构建：** 构建HNSW索引所需的时间如何随着数据点数量的增加而扩展。\n*   **查询性能：** 查询性能（速度和准确性）如何受到规模的影响。\n*   **优化技术：** 用于优化大规模数据集的HNSW的技术，例如图剪枝、压缩和分布式索引。\n*   **硬件考量：** 扩展HNSW的硬件要求，包括内存、CPU和GPU。\n*   **分布式HNSW：** HNSW的实现，可以将其分布在多台机器上以处理极其庞大的数据集。"
  },
  {
    "id": "45894588",
    "title": "Why Nietzsche matters in the age of artificial intelligence",
    "url": "https://cacm.acm.org/blogcacm/why-nietzsche-matters-in-the-age-of-artificial-intelligence/",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "尼采在人工智能时代的重要性",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "45891817",
    "title": "Agentic pelican on a bicycle",
    "url": "https://www.robert-glaser.de/agentic-pelican-on-a-bicycle/",
    "summary": "This article explores the agentic capabilities of multimodal AI models by challenging them to iteratively improve a generated SVG image of a \"pelican riding a bicycle,\" a benchmark popularized by Simon Willison. Unlike Willison's original zero-shot approach, the author allowed models to self-correct by converting their SVG output to JPG, analyzing it with their vision capabilities, and then refining the SVG in a continuous loop until satisfied.\n\nSix models were tested: Claude Opus 4.1, Claude Sonnet 4.5, Claude Haiku 4.5, GPT-5, GPT-5-Codex, and Gemini 2.5 Pro. A standardized Chrome DevTools MCP server ensured consistent rasterization across models.\n\nThe results were mixed. Claude Opus 4.1 demonstrated a capacity for genuinely thoughtful improvements, adding realistic features like a bicycle chain and improved proportions. Other models, like Claude Sonnet 4.5 and GPT-5, made subtle refinements without drastically altering the initial composition. Claude Haiku 4.5 performed the most iterations. GPT-5-Codex, however, amplified its initial abstract rendering, resulting in an even more complex, arguably less improved, image. Gemini 2.5 Pro significantly altered the initial composition over its iterations.\n\nThe author concludes that while the agentic approach yields different results compared to zero-shot generation, its success hinges on the model's self-critique abilities, aesthetic judgment, and understanding of mechanical principles. The experiment highlights that the ability to evaluate and improve one's creative output is a distinct skill from initial creative generation.\n",
    "chinese_title": "骑自行车的能动鹈鹕",
    "chinese_summary": "本文探讨了多模态AI模型的能动性，通过挑战它们迭代改进由西蒙·威利森推广的“鹈鹕骑自行车”SVG图像。与威利森最初的零样本方法不同，作者允许模型通过将其SVG输出转换为JPG，利用其视觉能力进行分析，然后在连续循环中完善SVG直到满意，从而进行自我纠正。\n\n测试了六个模型：Claude Opus 4.1、Claude Sonnet 4.5、Claude Haiku 4.5、GPT-5、GPT-5-Codex 和 Gemini 2.5 Pro。 标准化的 Chrome DevTools MCP 服务器确保了模型之间光栅化的一致性。\n\n结果喜忧参半。 Claude Opus 4.1 表现出进行真正深思熟虑改进的能力，添加了自行车链条等逼真特征并改善了比例。 其他模型，如 Claude Sonnet 4.5 和 GPT-5，则进行了细微改进，而没有大幅改变初始构图。 Claude Haiku 4.5 执行了最多的迭代。 然而，GPT-5-Codex 放大了其最初的抽象渲染，导致图像更加复杂，但可以说改进较少。 Gemini 2.5 Pro 在其迭代过程中显着改变了初始构图。\n\n作者总结说，虽然能动性方法产生的效果与零样本生成相比有所不同，但其成功取决于模型的自我批判能力、审美判断和对机械原理的理解。 该实验强调，评估和改进自身创造性输出的能力与最初的创造性生成是一种截然不同的技能。"
  },
  {
    "id": "45891868",
    "title": "A catalog of side effects",
    "url": "https://bernsteinbear.com/blog/compiler-effects/",
    "summary": "This article, titled \"A catalog of side effects\", explores different approaches to representing and tracking instruction effects within optimizing compilers. The author, Max Bernstein, frames the discussion as a continuation of a previous post on Intermediate Representations (IRs), emphasizing the importance of asking \"what effects does this opcode have?\" rather than simply \"what opcode is this?\".\n\nThe article highlights that tracking these effects allows compilers to perform optimizations like reordering, duplication, and deletion of instructions. The goal is to determine if two instructions might interfere with each other, for example, by writing to the same memory location (aliasing).\n\nTwo main methods for representing effects are discussed:\n\n1.  **Bitsets:** Cinder, a Python JIT compiler, utilizes bitsets to represent a lattice called AliasClass. Each bit in the bitset corresponds to a distinct heap location (e.g., ArrayItem, ListItem). This allows for efficient union and intersection operations to determine if memory locations might overlap.\n\n2.  **Heap Range Lists:** JavaScriptCore (JSC) employs heap range lists, where effects are represented as pre-order/post-order integer pairs indicating nested heap effects. The article uses DOMJIT as an example, where heap structures are defined hierarchically (e.g., Node_firstChild is a subheap of Node). Overlap is determined by comparing the ranges.\n\nThe author explores the trade-offs between these methods: bitsets are compact and precise but can become memory-intensive for a large number of bits. Heap range lists are more flexible long-term but require more complex data structures and algorithms for precise union and intersection operations. JavaScriptCore uses \"functors\" that compress/summarize the effects, avoiding list allocation.\n\nThe article concludes by demonstrating how these representations are used in practice, specifically in DCE (Dead Code Elimination) and other analyses.\n",
    "chinese_title": "副作用目录",
    "chinese_summary": "这篇文章，题为“副作用目录”，探讨了在优化编译器中表示和跟踪指令效果的不同方法。作者 Max Bernstein 将该讨论定位为之前一篇关于中间表示 (IR) 的文章的延续，强调提问“此操作码有什么效果？”比仅仅提问“这是什么操作码？”更重要。\n\n文章强调，跟踪这些效果使编译器能够执行诸如指令重排序、复制和删除之类的优化。目标是确定两条指令是否可能相互干扰，例如，写入相同的内存位置（别名）。\n\n文章讨论了表示效果的两种主要方法：\n\n1.  **位集：** Cinder，一个 Python JIT 编译器，利用位集来表示一个名为 AliasClass 的格。位集中的每一位都对应于一个不同的堆位置（例如，ArrayItem，ListItem）。这允许进行高效的并集和交集运算，以确定内存位置是否可能重叠。\n\n2.  **堆范围列表：** JavaScriptCore (JSC) 采用堆范围列表，其中效果表示为前序/后序整数对，指示嵌套的堆效果。文章以 DOMJIT 为例，其中堆结构按层次结构定义（例如，Node_firstChild 是 Node 的子堆）。通过比较范围来确定重叠。\n\n作者探讨了这些方法之间的权衡：位集紧凑而精确，但对于大量位来说可能会占用大量内存。堆范围列表在长期内更灵活，但需要更复杂的数据结构和算法来进行精确的并集和交集运算。JavaScriptCore 使用“仿函数”来压缩/汇总效果，从而避免列表分配。\n\n文章最后演示了这些表示如何在实践中使用，特别是在 DCE（死代码消除）和其他分析中。"
  },
  {
    "id": "45809975",
    "title": "Fixing LCD Screen Corruption of a Tektronix TDS220 Oscilloscope",
    "url": "https://tomverbeure.github.io/2025/11/03/TDS220-LCD-Corruption-Fix.html",
    "summary": "This article details the repair of a Tektronix TDS220 oscilloscope acquired at a flea market. The scope exhibited screen corruption and a distorted square wave output.\n\nThe author first addresses the common TDS220 issue of leaking capacitors in the power supply. After opening the scope and identifying electrolyte leakage, all 11 electrolytic capacitors on the power supply PCB were replaced with new components (a Digikey list of replacements is provided). However, this did not resolve the screen corruption.\n\nInvestigation led to a Chinese forum suggesting the issue stemmed from capacitors inside the LCD panel. The author carefully disassembled the LCD panel and replaced the three specialized 3.3uF 35V capacitors on the LCD PCB with standard electrolytic capacitors, soldering them meticulously to fit within the existing cut-outs.\n\nSimultaneously, the LCD backlight (CCFL tube) was replaced, although the improvement in brightness was not dramatic. A new tube was sourced from eBay, requiring soldering to transfer the connector.\n\nFinally, the distorted square wave issue was resolved by reflowing the solder joints on the BNC connectors of the main PCB.\n\nThe article concludes that the TDS220 was successfully restored, exhibiting correct signal measurements, no screen corruption, and acceptable brightness. The author highlights the rarity of documented solutions for the LCD screen corruption issue.\n",
    "chinese_title": "修复泰克TDS220示波器LCD屏幕损坏",
    "chinese_summary": "跳蚤市场淘来的泰克TDS220示波器维修纪实。该示波器存在屏幕损坏和方波输出失真的问题。\n\n作者首先解决了TDS220常见的电源电容漏液问题。打开示波器并发现电解液泄漏后，更换了电源PCB板上的所有11个电解电容（提供了Digikey的替换清单）。然而，这并没有解决屏幕损坏问题。\n\n调查发现一个中国论坛建议问题源于LCD面板内部的电容。作者小心地拆卸了LCD面板，并将LCD PCB上的三个特殊的3.3uF 35V电容更换为标准电解电容，并精心地焊接，使其能安装在现有的开孔内。\n\n同时，LCD背光灯管（CCFL灯管）也被更换，尽管亮度提升并不显著。新的灯管从eBay上采购，需要焊接以转移连接器。\n\n最后，通过重焊主PCB板上BNC连接器的焊点，解决了方波失真的问题。\n\n文章总结说，TDS220已成功修复，显示正确的信号测量值，无屏幕损坏，且亮度可接受。作者强调了关于LCD屏幕损坏问题记录解决方案的罕见性。"
  },
  {
    "id": "45901751",
    "title": "The Duties of John von Neumann's Assistant in the 1930s (2020)",
    "url": "https://www.cantorsparadise.com/the-duties-of-john-von-neumanns-assistant-in-the-1930s-8d08e538fe2b",
    "summary": "生成摘要时出错",
    "chinese_title": "1930年代约翰·冯·诺伊曼助手的职责 (2020)",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45896781",
    "title": "Seeking the Productive Life: Some Details of My Personal Infrastructure (2019)",
    "url": "https://writings.stephenwolfram.com/2019/02/seeking-the-productive-life-some-details-of-my-personal-infrastructure/",
    "summary": "In \"Seeking the Productive Life: Some Details of My Personal Infrastructure (2019),\" Stephen Wolfram details the technological and organizational tools he uses to maximize his productivity as a remote CEO and creative individual. He emphasizes structuring, streamlining, and automating his workflow.\n\nWolfram's daily routine includes walking for a couple of hours each morning. Initially, he used a treadmill in his office, but later transitioned to walking outside with a \"walking desk\" for better health benefits. He maintains a dedicated desk setup with multiple monitors, optimized for ergonomics and screensharing during virtual meetings. Notably, he avoids videoconferencing in favor of screensharing, prioritizing audio quality.\n\nHe has a specially designed desk with pull-out surfaces to prevent clutter and file drawers with slots for easy paper filing. While primarily paperless, he still uses a printer occasionally.\n\nWhen mobile, Wolfram carries a small, lightweight laptop in a bag for serious work, and relies on his phone for quick tasks. He keeps a synchronized \"things to read\" folder across all his devices for offline productivity. He relies on a pen and paper for taking notes when out of the office.\n\nIn essence, Wolfram's personal infrastructure is a meticulously designed system that leverages technology, ergonomics, and organizational habits to optimize his productivity and well-being.\n",
    "chinese_title": "追求高效生活：我的个人基础设施细节 (2019)",
    "chinese_summary": "在《追求高效生活：我的个人基础设施的若干细节 (2019)》一文中，斯蒂芬·沃尔夫勒姆详细介绍了其作为远程CEO和创意人士，为最大化生产力所使用的技术和组织工具。他强调构建、简化和自动化其工作流程。\n\n沃尔夫勒姆的日常包括每天早上步行两小时。起初，他在办公室使用跑步机，但后来为了更好的健康益处，过渡到使用“步行办公桌”在户外步行。他保持一个配备多台显示器的专用办公桌设置，针对人机工程学和虚拟会议期间的屏幕共享进行了优化。值得注意的是，他避免视频会议，而倾向于屏幕共享，并优先考虑音质。\n\n他拥有一张特殊设计的办公桌，带有可拉出的表面以防止杂乱，以及带有插槽的文件抽屉以便于纸质文件整理。虽然主要采用无纸化办公，但他仍然偶尔使用打印机。\n\n移动办公时，沃尔夫勒姆携带一个小型轻便的笔记本电脑放在包里进行重要工作，并依靠手机处理快速任务。他在所有设备上维护一个同步的“待读”文件夹，以实现离线生产力。当不在办公室时，他依靠笔和纸来做笔记。\n\n本质上，沃尔夫勒姆的个人基础设施是一个精心设计的系统，它利用技术、人机工程学和组织习惯来优化他的生产力和福祉。"
  },
  {
    "id": "45898450",
    "title": "Chat Control 2.0 through the back door",
    "url": "https://www.patrick-breyer.de/en/chat-control-2-0-through-the-back-door-breyer-warns-the-eu-is-playing-us-for-fools-now-theyre-scanning-our-texts-and-banning-teens/",
    "summary": "Digital rights expert Dr. Patrick Breyer is raising concerns about a proposed EU legislative package, dubbed \"Chat Control 2.0,\" which he claims is a deceptive attempt to implement intrusive mass surveillance. Breyer argues this compromise, being pushed in a closed-door meeting, is worse than the previously rejected \"Chat Control\" proposal.\n\nHe outlines three main concerns: Firstly, while explicit scanning mandates are ostensibly removed, a loophole allows providers to be forced to scan private messages under the guise of \"risk mitigation,\" potentially ending secure encryption. Secondly, the proposal allows for AI-driven mass scanning of text chats and metadata for suspicious keywords, leading to false positives, unwarranted suspicion, and the exposure of private communications. Thirdly, two additional measures threaten digital freedom: mandatory ID verification for all citizens to access email and messenger accounts, effectively ending online anonymity, and a blanket ban on teenagers under 16 from using various online platforms with chat functions.\n\nBreyer urges EU governments, particularly those who previously opposed indiscriminate mass scanning, to veto the proposal. He suggests immediate corrections, including clarifying that scanning cannot be enforced through \"risk mitigation,\" restricting scanning to known CSAM, allowing targeted surveillance only with court orders, and scrapping mandatory age verification requirements. He concludes that the proposal is a \"fraud against the citizen\" that sacrifices privacy in the name of security and child protection. He encourages citizens to contact their representatives to oppose the measures.\n",
    "chinese_title": "后门聊天管控2.0",
    "chinese_summary": "数字权利专家帕特里克·布雷耶博士对一项拟议的欧盟立法方案表示担忧，该方案被称为“聊天控制2.0”，他声称这是实施侵入式大规模监控的欺骗性尝试。布雷耶认为，这项在闭门会议中推动的妥协方案比之前被否决的“聊天控制”提案更糟糕。\n\n他概述了三个主要担忧：首先，虽然表面上取消了明确的扫描授权，但一个漏洞允许供应商在“风险缓解”的幌子下被迫扫描私人信息，从而可能结束安全的加密。其次，该提案允许对文本聊天和元数据进行AI驱动的大规模扫描，以查找可疑关键词，这会导致误报、不必要的怀疑以及私人通信的暴露。第三，另外两项措施威胁着数字自由：强制所有公民进行身份验证才能访问电子邮件和通讯账号，从而有效结束在线匿名，以及全面禁止16岁以下的青少年使用具有聊天功能的各种在线平台。\n\n布雷耶敦促欧盟各国政府，特别是那些此前反对不分青红皂白的大规模扫描的国家，否决该提案。他建议立即进行纠正，包括澄清不能通过“风险缓解”来强制执行扫描，将扫描限制在已知的CSAM范围内，仅允许根据法院命令进行有针对性的监视，以及取消强制性的年龄验证要求。他总结说，该提案是“对公民的欺诈”，以牺牲隐私为代价来换取安全和儿童保护。他鼓励公民联系他们的代表，反对这些措施。"
  },
  {
    "id": "45898923",
    "title": "Async and Finaliser Deadlocks",
    "url": "https://tratt.net/laurie/blog/2025/async_and_finaliser_deadlocks.html",
    "summary": "生成摘要时出错",
    "chinese_title": "异步和终结器死锁",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45900276",
    "title": "TorrentFreak Turns 20",
    "url": "https://torrentfreak.com/torrentfreak-turns-20-what-a-ride/",
    "summary": "TorrentFreak, a news site covering file-sharing and copyright issues, celebrates its 20th anniversary. Founded in 2005 by a graduate student fascinated by the early internet and the revolutionary potential of torrents, the site aimed to provide balanced reporting and critical assessment of the file-sharing landscape, countering the often unquestioned anti-piracy messaging of copyright industry groups.\n\nThe article reflects on the evolution of the file-sharing ecosystem, noting the shift from \"pirate\" hobbyists to profit-driven individuals and groups, leading to increased criminal activity. It also acknowledges the increased activity of rightsholders and anti-piracy groups in enforcement and lobbying.\n\nTorrentFreak has adopted a neutral, critical observer role, highlighting extremes on both sides of copyright debates. The founder acknowledges the importance of luck, contributors, readers, sources and tipsters in the site's success.\n\nLooking ahead, while the founder feels TorrentFreak has largely accomplished its mission, the site will remain online indefinitely, with a continued focus on in-depth reporting on topics where they can add value. The article concludes with gratitude to readers for their support, enabling TorrentFreak to thrive in its niche and document developments at its own pace.\n",
    "chinese_title": "TorrentFreak 二十周年",
    "chinese_summary": "专注文件分享和版权议题的新闻网站TorrentFreak迎来20周年。该网站由一位着迷于早期互联网和种子文件革命性潜力的研究生于2005年创立，旨在对文件分享领域进行平衡报道和批判性评估，以对抗版权行业团体经常提出的未经质疑的反盗版信息。\n\n文章回顾了文件分享生态系统的演变，注意到从“盗版”爱好者到以利润为导向的个人和群体的转变，导致犯罪活动增加。文章还承认版权所有者和反盗版团体在执法和游说方面的活动有所增加。\n\nTorrentFreak采取了中立、批判性的观察者角色，突出了版权辩论双方的极端情况。创始人承认，运气、贡献者、读者、消息来源和线人对于网站的成功至关重要。\n\n展望未来，虽然创始人认为TorrentFreak已基本完成其使命，但该网站将无限期地保持在线，并继续专注于他们能够增加价值的领域的深入报道。文章最后感谢读者的支持，使TorrentFreak能够在自己的领域蓬勃发展，并按照自己的节奏记录事态发展。"
  },
  {
    "id": "45892394",
    "title": "Collaboration sucks",
    "url": "https://newsletter.posthog.com/p/collaboration-sucks",
    "summary": "Charles Cook argues that excessive collaboration, while seemingly beneficial, can significantly hinder a company's progress. He uses the analogy of driving a car to illustrate how too much input and feedback can slow down the \"driver\" and prevent them from reaching their destination efficiently.\n\nCook highlights that while some collaboration is helpful, startups often fall into the trap of seeking excessive input, eroding the driver's motivation, confidence, and ability to ship quickly. This manifests in phrases like \"Curious what X thinks\" which, while well-intentioned, forces the driver to slow down and explain everything.\n\nHe identifies several reasons why excessive collaboration happens: people want to be helpful, aren't specific about the feedback needed, default to discussions instead of action, and lack clear ownership.\n\nTo combat this, Cook advocates for:\n\n*   **Defaulting to shipping:** Prioritizing pull requests over discussions.\n*   **Designating a driver:** Clearly identifying the owner responsible for a task and empowering them to make decisions.\n*   **Targeted feedback:** Requesting input from specific individuals on specific aspects.\n*   **Post-shipping feedback:** Providing feedback after something is shipped, but before the next iteration, to avoid hindering progress.\n\nUltimately, Cook encourages companies to actively attempt to collaborate less to improve their ability to move far and fast. He acknowledges that some collaboration is necessary but emphasizes the importance of minimizing unnecessary input to maintain momentum and empower individuals to take ownership.\n",
    "chinese_title": "合作真烂。",
    "chinese_summary": "查尔斯·库克认为，过度协作看似有益，实则会严重阻碍公司的发展。他用驾驶汽车作比，说明过多的意见和反馈会拖慢“驾驶员”的速度，阻碍他们高效地到达目的地。\n\n库克强调，虽然适当的协作是有帮助的，但初创公司常常陷入寻求过度意见的陷阱，从而削弱了驾驶员的积极性、信心以及快速交付的能力。 这体现在诸如“想知道X的想法”之类的短语中，虽然是出于好意，但却迫使驾驶员慢下来并解释一切。\n\n他指出了导致过度协作的几个原因：人们想提供帮助、没有明确所需反馈、默认进行讨论而不是行动，以及缺乏明确的责任人。\n\n为了解决这个问题，库克提倡：\n\n*   **默认交付：** 优先处理拉取请求，而不是讨论。\n*   **指定驾驶员：** 明确指定负责任务的所有者，并授权他们做出决策。\n*   **针对性反馈：** 向特定人员征求对特定方面的意见。\n*   **发布后反馈：** 在产品发布后但在下次迭代之前提供反馈，以避免阻碍进度。\n\n最终，库克鼓励公司积极尝试减少协作，以提高其快速前进的能力。他承认一些协作是必要的，但强调尽量减少不必要的意见，以保持势头并授权个人承担责任的重要性。"
  },
  {
    "id": "45883788",
    "title": "The 'Toy Story' You Remember",
    "url": "https://animationobsessive.substack.com/p/the-toy-story-you-remember",
    "summary": "生成摘要时出错",
    "chinese_title": "你记忆中的《玩具总动员》",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45901149",
    "title": "Fungus in Chernobyl nuclear disaster zone has mutated to 'feed' on radiation (2024)",
    "url": "https://www.unilad.com/news/world-news/fungus-chernobyl-mutated-feed-radiation-164735-20241217",
    "summary": "Here's a summary of the article based on the title and likely content, assuming it's a typical report on this topic:\n\nThe article likely discusses how certain fungi found in the Chernobyl Exclusion Zone have evolved to thrive in a highly radioactive environment. These fungi have undergone a remarkable adaptation: they use melanin, the same pigment that gives skin and hair its color, to absorb and seemingly \"feed\" on radiation.\n\nInstead of being damaged by radiation, the melanin in these fungi allows them to convert gamma radiation into chemical energy, similar to how plants use chlorophyll to photosynthesize. This process is termed radiosynthesis.\n\nThe article probably highlights that scientists have been studying these \"radiotrophic fungi\" for years, intrigued by their potential applications. These include:\n\n*   Protecting astronauts from radiation in space, potentially using melanin-rich materials as shields.\n*   Developing new methods for decontaminating radioactive waste.\n*   Understanding the potential for life to exist on other planets with high radiation levels.\n\nThe article may also mention the specific types of fungi found in Chernobyl that exhibit this behavior, and the ongoing research exploring the mechanisms behind their radiotrophic abilities. It is important to note that while they utilize radiation, they do not \"eat\" nuclear waste in the sense of eliminating it. They use radiation as an energy source.\n",
    "chinese_title": "切尔诺贝利核灾区真菌变异“吞噬”辐射 (2024)",
    "chinese_summary": "以下是基于标题和可能内容的文章摘要，假设这是一篇关于该主题的典型报告：\n\n该文章可能讨论了切尔诺贝利禁区发现的某些真菌如何进化以在高度放射性环境中茁壮成长。这些真菌经历了一种非凡的适应：它们利用黑色素——赋予皮肤和毛发颜色的同一种色素——来吸收并看似“吸收”辐射。\n\n这些真菌中的黑色素不会受到辐射的损害，反而能将伽马射线转化为化学能，类似于植物利用叶绿素进行光合作用。这个过程被称为辐射合成。\n\n文章可能强调，科学家们多年来一直在研究这些“嗜辐射真菌”，对它们的潜在应用很感兴趣。这些应用包括：\n\n*   保护宇航员免受太空辐射，可能使用富含黑色素的材料作为屏蔽。\n*   开发新的放射性废物净化方法。\n*   了解生命在其他高辐射水平行星上存在的可能性。\n\n文章可能还会提到在切尔诺贝利发现的具有这种行为的特定类型的真菌，以及正在进行的探索其嗜辐射能力的机制的研究。重要的是要注意，虽然它们利用辐射，但它们并没有“吃掉”核废料，而是将其作为能源。"
  },
  {
    "id": "45843600",
    "title": "Array-programming the Mandelbrot set",
    "url": "https://jcmorrow.com/mandelbrot/",
    "summary": "Josh Morrow's article details his experience translating a Mandelbrot set generator from the array programming language J to Uiua. He notes the difficulties of revisiting code written in J after some time and the appeal of attempting the translation in Uiua, a language he's been using more recently.\n\nThe article highlights the differences between the two languages, particularly Uiua's stack-based nature which impacts code readability and organization. While J evaluates right-to-left, Uiua offers greater explicit control over the stack. Morrow expresses a preference for Uiua's function signatures, finding them clearer and more intuitive for understanding the stack manipulation occurring.\n\nHe then presents the code for the Mandelbrot set in both J and Uiua, showcasing how the same computation is expressed differently. Finally, Morrow emphasizes Uiua's immediate feedback loop, specifically its ability to automatically display data as a GIF in interactive environments. He appreciates this feature as enhancing the immediacy and explorative nature of array programming, making complex transformations easily visualizable and facilitating rapid intellectual progress. He sees this automatic visualization as a significant step forward, simplifying the often tedious process of rendering pixels for visual arts projects.\n",
    "chinese_title": "曼德勃罗集阵列编程",
    "chinese_summary": "乔希·莫罗的文章详细介绍了将一个曼德勃罗集生成器从数组编程语言J翻译到Uiua的经历。他提到了一段时间后重温用J编写的代码的困难，以及尝试用Uiua（他最近一直在使用的语言）进行翻译的吸引力。\n\n这篇文章突出了这两种语言之间的差异，尤其是Uiua基于堆栈的特性，这影响了代码的可读性和组织性。 虽然J从右到左求值，但Uiua提供了对堆栈的更明确的控制。 莫罗表达了对Uiua函数签名的偏爱，认为它们更清晰直观，更容易理解正在发生的堆栈操作。\n\n然后，他展示了用J和Uiua编写的曼德勃罗集代码，展示了相同的计算是如何以不同的方式表达的。 最后，莫罗强调了Uiua的即时反馈循环，特别是它能够在交互式环境中自动将数据显示为GIF的功能。 他赞赏这一特性增强了数组编程的即时性和探索性，使复杂的转换易于可视化，并促进了快速的智力进步。 他认为这种自动可视化是向前迈进的一大步，简化了视觉艺术项目中经常繁琐的像素渲染过程。"
  },
  {
    "id": "45890726",
    "title": "Terminal Latency on Windows (2024)",
    "url": "https://chadaustin.me/2024/02/windows-terminal-latency/",
    "summary": "This article revisits the author's 2009 claim that MinTTY is the best terminal on Windows, comparing it to newer options in 2024. While the Windows terminal landscape has improved with features like PTY support and ANSI sequence compatibility, the author tests several terminals based on criteria including feature set, input latency, and throughput.\n\nThe tested terminals include legacy conhost.exe, MinTTY, Alacritty, WezTerm, and Windows Terminal. Feature-wise, all except conhost.exe meet the author's requirements, with conhost.exe also having a poor default color palette.\n\nLatency tests revealed conhost.exe and MinTTY had the best performance, while Alacritty, WezTerm, and Windows Terminal lagged. Throughput tests showed MinTTY dramatically outperformed the others, suggesting a throttling mechanism for display updates. Further tests revealed high CPU usage during repeated keypresses, particularly with WezTerm and Windows Terminal. Also, all terminals, except conhost.exe, showed significant CPU usage while idle, indicating inefficient power management.\n\nThe author concludes that conhost.exe has the best latency, and MinTTY is still excellent due to its performance, feature support, and better default palette. The author plans to investigate MinTTY's idle CPU usage. They note that while they'll stick with MinTTY, there's room for improvement in all tested terminals, even with Windows Terminal reducing latency in its 1.19 update.\n",
    "chinese_title": "Windows终端延迟 (2024)",
    "chinese_summary": "本文回顾了作者2009年关于MinTTY是Windows上最佳终端的观点，并将其与2024年的新选项进行比较。尽管Windows终端领域随着PTY支持和ANSI序列兼容性等功能的加入而有所改进，作者仍然基于功能集、输入延迟和吞吐量等标准测试了几个终端。\n\n测试的终端包括传统的conhost.exe、MinTTY、Alacritty、WezTerm和Windows Terminal。在功能方面，除conhost.exe外，所有终端都满足作者的要求，而且conhost.exe的默认调色板也很差。\n\n延迟测试表明conhost.exe和MinTTY具有最佳性能，而Alacritty、WezTerm和Windows Terminal则存在延迟。吞吐量测试显示MinTTY明显优于其他终端，这表明存在显示更新的限制机制。进一步的测试表明，重复按键期间CPU使用率很高，尤其是在WezTerm和Windows Terminal中。此外，除conhost.exe外，所有终端在空闲时都显示出显著的CPU使用率，表明电源管理效率低下。\n\n作者得出结论，conhost.exe具有最佳延迟，而MinTTY由于其性能、功能支持和更好的默认调色板仍然非常出色。作者计划调查MinTTY的空闲CPU使用率。他们指出，尽管他们会继续使用MinTTY，但所有测试的终端都还有改进的空间，即使Windows Terminal在其1.19更新中降低了延迟。"
  },
  {
    "id": "45891968",
    "title": "Adk-go: code-first Go toolkit for building, evaluating, and deploying AI agents",
    "url": "https://github.com/google/adk-go",
    "summary": "Adk-go is an open-source, code-first Go toolkit designed for building, evaluating, and deploying sophisticated AI agents. Leveraging Go's concurrency and performance, it aims to simplify the creation, deployment, and orchestration of agent workflows, from simple tasks to complex, modular systems.\n\nKey features include idiomatic Go design, a rich tool ecosystem (pre-built, custom, and integrated tools), code-first development for enhanced flexibility and testability, support for modular multi-agent systems, and easy deployment in cloud-native environments like Google Cloud Run. While optimized for Gemini, it is model-agnostic and compatible with other frameworks.\n\nAdk-go utilizes software development principles for AI agent creation, providing a flexible and modular approach. Installation is streamlined through the `go get` command. The project is licensed under the Apache 2.0 license, with a separate license for the internal/httprr component.\n",
    "chinese_title": "Adk-go: 用于构建、评估和部署 AI 代理的代码优先 Go 工具包",
    "chinese_summary": "Adk-go 是一个开源、代码优先的 Go 工具包，旨在构建、评估和部署复杂的 AI 代理。它利用 Go 的并发性和性能，旨在简化代理工作流程的创建、部署和编排，从简单任务到复杂的模块化系统。\n\n主要特性包括符合 Go 习惯的设计、丰富的工具生态系统（预构建、自定义和集成工具）、增强灵活性和可测试性的代码优先开发、对模块化多代理系统的支持，以及在 Google Cloud Run 等云原生环境中轻松部署。虽然它针对 Gemini 进行了优化，但它是模型无关的，并且与其他框架兼容。\n\nAdk-go 利用软件开发原则来创建 AI 代理，提供灵活且模块化的方法。安装通过 `go get` 命令简化。该项目采用 Apache 2.0 许可协议，内部/httprr 组件采用单独的许可协议。"
  },
  {
    "id": "45888620",
    "title": ".NET 10",
    "url": "https://devblogs.microsoft.com/dotnet/announcing-dotnet-10/",
    "summary": "生成摘要时出错",
    "chinese_title": ".NET 10",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45889891",
    "title": "Cache-friendly, low-memory Lanczos algorithm in Rust",
    "url": "https://lukefleed.xyz/posts/cache-friendly-low-memory-lanczos/",
    "summary": "This article explores a memory-efficient variant of the Lanczos algorithm for computing matrix functions, particularly useful for large sparse matrices. The standard Lanczos method requires storing a large basis matrix (O(nk) memory), which becomes prohibitive for high-dimensional problems. The article proposes a two-pass approach that reduces memory usage to O(n) at the cost of doubling the number of matrix-vector products.\n\nIn the first pass, the algorithm computes and stores only the scalar coefficients (α and β) needed to define the tridiagonal matrix Tk, discarding the basis vectors.  In the second pass, it replays the Lanczos recurrence, reconstructing the basis vectors on-the-fly using the stored scalars. Each reconstructed vector is immediately used to update the solution before being discarded, avoiding the need to store the entire basis.\n\nWhile seemingly slower due to the doubled matrix-vector products, the article argues that this two-pass method can be *faster* in practice due to improved cache behavior and reduced memory overhead. The article further addresses numerical precision considerations, noting slight differences in rounding errors due to the alternative method of solution accumulation, but argues they rarely impact convergence. Finally, the article discusses implementation details in Rust, highlighting the importance of memory layout, allocation strategies, and zero-cost abstractions.\n",
    "chinese_title": "Rust 语言中缓存友好、低内存的 Lanczos 算法",
    "chinese_summary": "本文探讨了一种内存高效的Lanczos算法变体，用于计算矩阵函数，尤其适用于大型稀疏矩阵。标准的Lanczos方法需要存储一个大型基矩阵（O(nk)内存），这对于高维问题来说变得难以承受。本文提出了一种两遍法，以加倍矩阵-向量乘积的代价，将内存使用量减少到O(n)。\n\n在第一遍中，该算法计算并仅存储定义三对角矩阵Tk所需的标量系数（α和β），丢弃基向量。在第二遍中，它重放Lanczos递推关系，使用存储的标量即时重建基向量。每个重建的向量在使用后立即被丢弃，从而避免了存储整个基的需求。\n\n尽管由于矩阵-向量乘积加倍而看起来速度较慢，但本文认为，由于改进的缓存行为和减少的内存开销，这种两遍法在实践中可能*更快*。本文进一步讨论了数值精度方面的考虑，指出由于替代的解累积方法导致舍入误差略有不同，但认为它们很少影响收敛性。最后，本文讨论了Rust中的实现细节，强调了内存布局、分配策略和零成本抽象的重要性。"
  },
  {
    "id": "45897016",
    "title": "You will own nothing and be (un)happy",
    "url": "https://racc.blog/you-will-own-nothing-and-be-unhappy/",
    "summary": "In a blog post dated November 11, 2025, the author expresses frustration with the increasing prevalence of subscription-based services, specifically citing the Goodnotes app as an example. The author purchased a \"lifetime\" license for Goodnotes but now finds that new AI features are locked behind a subscription, rendering their previous purchase obsolete.\n\nThe author laments the shift towards subscription models for almost everything, from apps to food, and criticizes companies for exploiting users who forget to cancel free trials, often making the refund process deliberately difficult. They highlight the illusion of ownership in the digital age, where users are essentially renting access to apps, music, and tools rather than owning them outright.\n\nThe author argues that this trend prioritizes steady revenue streams for companies over fair ownership for consumers. They suggest that the subscription model encourages companies to focus on maintaining indefinite payments rather than improving their products. The post concludes with a sarcastic remark about the necessity of integrating AI like ChatGPT into note-taking apps. The author encourages readers to subscribe to their RSS feed.\n",
    "chinese_title": "你将一无所有，并（不）快乐",
    "chinese_summary": "在2025年11月11日发表的一篇博文中，作者对日益普及的订阅服务表示不满，并以Goodnotes应用为例。作者曾购买Goodnotes的“终身”许可证，但现在发现新的AI功能被锁定在订阅服务之后，使其之前的购买变得毫无意义。\n\n作者感叹几乎所有事物都转向订阅模式，从应用程序到食品，并批评公司利用用户忘记取消免费试用，且经常故意使退款过程变得困难。他们强调了数字时代的所有权幻觉，用户实际上是在租用应用程序、音乐和工具的访问权，而不是完全拥有它们。\n\n作者认为，这种趋势将公司稳定的收入来源置于消费者公平的所有权之上。他们认为订阅模式鼓励公司专注于维持无限期的付款，而不是改进他们的产品。文章最后讽刺性地评论了在笔记应用程序中集成ChatGPT等AI的必要性。作者鼓励读者订阅他们的RSS源。"
  },
  {
    "id": "45841998",
    "title": "Learning to Model the World with Language",
    "url": "https://dynalang.github.io/",
    "summary": "This article introduces Dynalang, a novel agent that learns to model the world using language by predicting future outcomes. The key idea is to unify language understanding with future prediction, creating a powerful self-supervised learning objective. Unlike traditional agents that only use language to predict actions, Dynalang leverages diverse language (general knowledge, state descriptions, feedback) to predict future language, video, and rewards.\n\nDynalang builds on the DreamerV3 model-based RL agent, learning a multimodal world model that compresses text and image inputs into a latent representation. This model is trained to reconstruct observations, predict rewards, and anticipate the next timestep's representation. The agent then uses a policy network trained on imagined rollouts from this model to maximize predicted rewards. A key innovation is modeling video and text as a unified sequence, processing one image frame and one text token at a time, enabling text pretraining like a language model.\n\nThe paper showcases Dynalang's capabilities across several environments: HomeGrid (language hints), Messenger (game manuals), Habitat (instruction following), and LangRoom (grounded language generation). Dynalang consistently outperforms state-of-the-art RL algorithms and task-specific architectures by grounding language to visual experience through future prediction. Furthermore, the architecture allows for pretraining on large text datasets without actions or rewards, improving downstream task performance. The agent also exhibits rudimentary language generation capabilities. This research demonstrates the potential of unifying language understanding and acting within a single agent architecture.\n",
    "chinese_title": "用语言建模世界",
    "chinese_summary": "本文介绍Dynalang，一种新型代理，通过预测未来结果，利用语言来建模世界。其核心思想是将语言理解与未来预测统一起来，从而创建一个强大的自监督学习目标。与传统代理仅使用语言来预测动作不同，Dynalang利用多样化的语言（通用知识、状态描述、反馈）来预测未来的语言、视频和奖励。\n\nDynalang建立在DreamerV3基于模型的强化学习代理之上，学习一种多模态世界模型，该模型将文本和图像输入压缩成潜在表示。该模型经过训练，可以重构观察结果、预测奖励并预测下一个时间步的表示。然后，代理使用一个策略网络，该网络基于该模型中的想象展开进行训练，以最大化预测的奖励。一项关键创新是将视频和文本建模为统一的序列，一次处理一个图像帧和一个文本标记，从而实现像语言模型一样的文本预训练。\n\n该论文展示了Dynalang在多个环境中的能力：HomeGrid（语言提示）、Messenger（游戏手册）、Habitat（指令跟随）和LangRoom（基于语言的生成）。通过将语言与视觉体验联系起来并通过未来预测，Dynalang始终优于最先进的强化学习算法和特定于任务的架构。此外，该架构允许在没有动作或奖励的大型文本数据集上进行预训练，从而提高下游任务的性能。该代理还表现出基本的语言生成能力。这项研究证明了在单个代理架构中统一语言理解和行动的潜力。"
  },
  {
    "id": "45885242",
    "title": "Why effort scales superlinearly with the perceived quality of creative work",
    "url": "https://markusstrasser.org/creative-work-landscapes.html",
    "summary": "Markus Strasser's article, \"Why Effort Scales Superlinearly with the Perceived Quality of Creative Work,\" argues that the creation of high-quality work involves a fractal exploration-exploitation process under optimal feedback control, leading to a \"precision tax\" where effort increases superlinearly with perceived quality. He rejects the notion of exploration (idea) and exploitation (execution) as separate phases, proposing instead a recursively nested search process.\n\nThe core concept is that as the perceived quality (resolution) increases, the \"acceptance volume\" – the portion of parameter space where changes don't worsen the artifact – rapidly collapses. This forces creators to make numerous, high-precision edits with delayed verification (feedback latency). These edits are often geometrically bad, lowering the work's perceived quality.\n\nStrasser uses examples like sketching, music, and writing to illustrate this point. Quick sketches utilize \"cached motor heuristics,\" avoiding true exploration. He contrasts modalities, noting that music timing requires high precision, while prose allows more flexibility. He models the creative process as navigating an optimization landscape, where finding a sharper, higher peak (higher quality) requires significantly more effort due to the shrinking acceptance volume.\n\nHe addresses FAQs, clarifying that \"banger\" songs recorded quickly result from prior practice (muscle memory), while drawing, unlike rehearsed performances, involves constant problem-solving and real-time refinement. Essentially, achieving high quality requires a painstaking slog of closing ever-less-perceivable gaps.\n",
    "chinese_title": "为什么努力程度与感知到的创意作品质量呈超线性增长",
    "chinese_summary": "马库斯·斯特拉瑟的文章《为何努力程度随创意作品的感知质量超线性增长》认为，高质量作品的创作涉及最优反馈控制下的分形探索-利用过程，导致一种“精确税”，即努力程度随感知质量超线性增长。他拒绝将探索（构思）和利用（执行）视为独立阶段，而是提出了一种递归嵌套的搜索过程。\n\n核心概念是，随着感知质量（分辨率）的提高，“接受体积”——即参数空间中改变不会使作品变差的部分——迅速坍缩。这迫使创作者进行大量高精度编辑，并伴随延迟验证（反馈延迟）。这些编辑通常在几何上是不利的，会降低作品的感知质量。\n\n斯特拉瑟用素描、音乐和写作等例子来说明这一点。快速素描利用“缓存的运动启发式”，避免了真正的探索。他对比了不同模式，指出音乐Timing需要高精度，而散文则允许更大的灵活性。他将创作过程建模为在优化地形中导航，其中找到一个更尖锐、更高的峰（更高的质量）需要付出更多的努力，因为接受体积不断缩小。\n\n他解答了常见问题，澄清了快速录制的“热门”歌曲是先前练习（肌肉记忆）的结果，而绘画，与排练过的表演不同，涉及持续的问题解决和实时改进。本质上，实现高质量需要通过艰苦的努力来弥合越来越难以察觉的差距。"
  },
  {
    "id": "45902767",
    "title": "We analyzed 47,000 ChatGPT conversations. Here's what people use it for",
    "url": "https://www.washingtonpost.com/technology/2025/11/12/how-people-use-chatgpt-data",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "我们分析了四万七千个ChatGPT对话，这是人们用它来做什么的",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "45899077",
    "title": "Open Source Games",
    "url": "https://github.com/bobeff/open-source-games",
    "summary": "This article is a comprehensive list of open-source video games and open-source remakes of commercial games, categorized by genre. It aims to provide a resource for gamers and developers interested in exploring or contributing to the open-source gaming community.\n\nThe listed games span a wide variety of genres, including Action, Adventure, Business & Tycoon, City-Building, First-Person, Platformers, Puzzle, Racing, Real-Time Strategy, Roguelikes, Role-Playing Games, Sandbox, Shoot 'em up, Sport, Third-Person, Tower Defense, and Turn-Based Strategy.\n\nFor each game, the article provides a brief description and a link to the source code or project website. This allows users to easily find and explore the games that interest them, whether they want to play, modify, or contribute to the development.\n\nThe article also includes a section called \"Other lists,\" which links to additional resources and collections of open-source games and game-related projects, further expanding the possibilities for exploration and discovery. The list is a valuable starting point for anyone wanting to find open-source game alternatives or learn about the open-source gaming ecosystem.\n",
    "chinese_title": "开源游戏",
    "chinese_summary": "本文是一份开源视频游戏和商业游戏开源重制版的综合列表，按类型分类。旨在为有兴趣探索或贡献于开源游戏社区的玩家和开发者提供资源。\n\n所列游戏涵盖了广泛的类型，包括动作、冒险、商业与大亨、城市建造、第一人称、平台游戏、益智、竞速、即时战略、Roguelikes、角色扮演游戏、沙盒、射击游戏、体育、第三人称、塔防和回合制战略。\n\n对于每个游戏，本文都提供了一个简短的描述以及指向源代码或项目网站的链接。这使得用户可以轻松地查找和探索他们感兴趣的游戏，无论他们是想玩、修改还是为开发做贡献。\n\n本文还包括一个名为“其他列表”的部分，其中链接到开源游戏和游戏相关项目的其他资源和集合，进一步扩展了探索和发现的可能性。对于任何想要寻找开源游戏替代品或了解开源游戏生态系统的人来说，该列表都是一个有价值的起点。"
  },
  {
    "id": "45886479",
    "title": "Widespread distribution of bacteria containing PETases across global oceans",
    "url": "https://academic.oup.com/ismej/article/19/1/wraf121/8159680?login=false",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "全球海洋中含PET酶细菌的广泛分布",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "45886002",
    "title": "Welcome, the entire land – \"Hello, world\" in hieroglyphics (2009)",
    "url": "https://optional.is/required/2009/12/03/welcome-the-entire-land/",
    "summary": "In December 2009, the author recounts a conversation at the dConstruct web conference in Brighton, where a friend pointed out an Egyptian exhibit. This sparked the idea of creating a \"Hello World\" t-shirt using hieroglyphs, a concept born from the intersection of computer programming and Egyptology.\n\nThe author learned that ancient Egyptian didn't have a glyph for the letter \"L,\" so the initial idea had to be adapted. They sought help from Egyptologists to translate a suitable equivalent. After consulting with experts, they settled on \"Welcome, the entire land\" as a fitting translation, recognizing the rarity of this phrase ever being written in hieroglyphs before.\n\nThe article details the translation process, including the individual glyphs and their literal pictoral meanings. The author then stylized the design and printed it on a t-shirt, acknowledging the niche appeal of the joke. The author encourages others to use the translation and design for their own purposes, releasing it into the public domain. The author thanks Mike Stenhouse and the Egypt Exploration Society for their help in the translation. The article is categorized under T-Shirts and Temporality, and tagged with keywords related to Egypt, hello world, hieroglyphs, and programming.\n",
    "chinese_title": "欢迎，整个大地 – 象形文字版的“你好，世界”（2009）",
    "chinese_summary": "2009年12月，作者回忆了在布莱顿dConstruct网络会议上的一次对话，一位朋友指出了一个埃及展品。这激发了用象形文字创作一件“Hello World”T恤的想法，这是一个源于计算机编程和埃及学交叉的概念。\n\n作者了解到古埃及文字中没有字母“L”的字形，因此最初的想法不得不进行调整。他们向埃及学家寻求帮助，以翻译出一个合适的等价物。在咨询专家后，他们最终确定了“欢迎，整个大地”作为一个合适的翻译，并认识到这个短语以前用象形文字书写的罕见性。\n\n文章详细介绍了翻译过程，包括每个字形的字面意义。然后，作者将设计进行风格化处理并印在T恤上，并承认了这个笑话的小众吸引力。作者鼓励其他人使用该翻译和设计用于他们自己的目的，并将其发布到公共领域。作者感谢Mike Stenhouse和埃及探险协会在翻译方面提供的帮助。这篇文章被归类在T恤和时间性之下，并标记了与埃及、hello world、象形文字和编程相关的关键词。"
  },
  {
    "id": "45843927",
    "title": "Modern Optimizers – An Alchemist's Notes on Deep Learning",
    "url": "https://notes.kvfrans.com/7-misc/modern-optimizers.html",
    "summary": "This article delves into modern optimization techniques in deep learning, focusing on spectral-whitening methods that aim to outperform the widely used Adam optimizer. It explains that gradient descent, the foundation of learning, can be improved by using non-Euclidean distance metrics, where the \"whitening\" metric, derived from the Gauss-Newton approximation of the Hessian, Natural Gradient Descent, or Spectral Norm Descent, plays a crucial role.\n\nThe article then explores various implementations of optimizers that approximate the whitening metric. Adam utilizes an element-wise approximation. Shampoo and its variants (SOAP, SPlus) employ Kronecker factorization to estimate gradient covariances for each dense layer, with SOAP and SPlus further refining the update rule by incorporating Adam or sign function within the eigenbasis of the Kronecker factors. Finally, Preconditioned Stochastic Gradient Descent (PSGD) iteratively approximates the whitening metric by minimizing a cost function that balances gradient and noise statistics. The article does not give clear guidance on which optimizer is best, but presents several options to try that have been show to improve performance on some tasks.\n",
    "chinese_title": "Modern Optimizers – An Alchemist's Notes on Deep Learning",
    "chinese_summary": "本文深入探讨深度学习中的现代优化技术，重点关注旨在超越广泛使用的Adam优化器的谱白化方法。文章解释了作为学习基础的梯度下降可以通过使用非欧几里得距离度量来改进，其中源自Hessian矩阵的高斯-牛顿近似的“白化”度量、自然梯度下降或谱范数下降起着至关重要的作用。\n\n文章接着探讨了各种近似白化度量的优化器的实现。Adam使用逐元素近似。Shampoo及其变体（SOAP、SPlus）采用Kronecker分解来估计每个密集层的梯度协方差，其中SOAP和SPlus通过在Kronecker因子的特征基中结合Adam或符号函数来进一步改进更新规则。最后，预处理随机梯度下降(PSGD)通过最小化一个平衡梯度和噪声统计的成本函数来迭代地近似白化度量。文章没有明确指出哪个优化器是最好的，但提出了几种可以尝试的方案，这些方案已显示出在某些任务上提高了性能。"
  },
  {
    "id": "45884937",
    "title": "SoftBank sells its entire stake in Nvidia",
    "url": "https://www.cnbc.com/2025/11/11/softbank-sells-its-entire-stake-in-nvidia-for-5point83-billion.html",
    "summary": "SoftBank has sold its entire stake in Nvidia for $5.83 billion, consisting of 32.1 million shares sold in October. This move is part of a larger strategy to monetize assets and fund a $22.5 billion investment in OpenAI, the creator of ChatGPT, as well as other projects like the acquisition of ABB's robotics unit. They also sold part of their T-Mobile stake for $9.17 billion.\n\nDespite exiting Nvidia, SoftBank remains heavily involved in the AI sector and is tied to Nvidia through various AI ventures, including the $500 billion Stargate project. Analysts suggest the sale is not a reflection of concerns about Nvidia's valuation or AI in general, but rather a need for capital to support SoftBank's aggressive investments in AI.\n\nThe sale, combined with a $19 billion gain from SoftBank's Vision Fund (partly driven by its early investment in OpenAI), helped the company double its profit in its fiscal second quarter. Following the recapitalization, SoftBank's 4% ownership of OpenAI will increase to 11%. They may increase their investment further depending on the company's performance and valuation, but likely won't go over 40%.\n",
    "chinese_title": "软银出售其持有的全部英伟达股份",
    "chinese_summary": "软银出售其持有的全部英伟达股份，套现58.3亿美元。这批股份包括10月份出售的3210万股。此举是其变现资产、为投资OpenAI（ChatGPT的创造者）的225亿美元以及收购ABB机器人部门等项目提供资金的更大战略的一部分。他们还出售了部分T-Mobile股份，套现91.7亿美元。\n\n尽管退出了英伟达，软银仍然深度参与人工智能领域，并通过包括5000亿美元的“星际之门”项目在内的各种人工智能风险投资与英伟达保持联系。分析师认为，此次出售并非反映对英伟达估值或整体人工智能的担忧，而是出于支持软银在人工智能领域激进投资的资金需求。\n\n此次出售，加上软银愿景基金（部分得益于其早期对OpenAI的投资）带来的190亿美元收益，帮助该公司在第二财季实现了利润翻番。重组后，软银对OpenAI的所有权将从4%增加到11%。他们可能会根据该公司的业绩和估值进一步增加投资，但可能不会超过40%。"
  },
  {
    "id": "45889793",
    "title": "Show HN: Cactoide – Federated RSVP Platform",
    "url": "https://cactoide.org/",
    "summary": "Cactoide is a federated, open-source RSVP platform designed for easy and efficient event management. It allows users to create events, share unique URLs, and collect RSVPs without requiring any registration or account creation. Its key features include instant event creation, one-click sharing via a memorable URL, centralized response tracking, no-signup RSVP process, flexible RSVP limits, and effortless simplicity.\n\nA key aspect is federation, allowing Cactoide instances to connect and share public events, creating a decentralized event discovery network. Users can create either public or invite-only events, the latter offering control over attendee access via special invite links.\n\nThe process is simple: users fill out an event form, receive a unique URL, and attendees RSVP by simply entering their name, without needing an account. Cactoide emphasizes streamlined coordination and efficient event planning, making it suitable for various event sizes and scenarios. The platform aims to provide a user-friendly alternative to traditional event planning tools, focusing on simplicity and accessibility.\n",
    "chinese_title": "Show HN: Cactoide – 联邦 RSVP 平台",
    "chinese_summary": "Cactoide 是一个联邦式开源 RSVP 平台，旨在实现简易高效的活动管理。它允许用户创建活动、分享唯一 URL 并收集 RSVP，无需任何注册或创建账户。其主要功能包括：即时活动创建、通过易记 URL 一键分享、集中式回复跟踪、无需注册的 RSVP 流程、灵活的 RSVP 限制以及轻松简便的操作。\n\n联邦式是其关键特性，允许 Cactoide 实例连接并分享公共活动，从而创建一个去中心化的活动发现网络。用户可以创建公开活动或仅限邀请的活动，后者通过特殊的邀请链接提供对参与者访问的控制。\n\n流程简单：用户填写活动表格，获得唯一 URL，参与者只需输入姓名即可 RSVP，无需注册账户。Cactoide 强调精简的协调和高效的活动策划，使其适用于各种规模和场景的活动。该平台旨在提供一个用户友好的替代方案，以取代传统的活动策划工具，专注于简洁性和可访问性。"
  },
  {
    "id": "45808693",
    "title": "A behind-the-scenes look at Broadcom's design labs",
    "url": "https://www.techbrew.com/stories/2025/11/03/broadcom-design-labs-tour",
    "summary": "This article provides a behind-the-scenes look at Broadcom's design labs, focusing on the company's response to the rapidly evolving demands of AI and its impact on their network switch business. The AI boom, particularly with models like ChatGPT, has drastically reshaped Broadcom's priorities. Their switches, crucial for coordinating data in massive AI data centers, are now designed to handle the high-capacity needs of these facilities.\n\nThe article highlights Broadcom's partnership with OpenAI to build 10 gigawatts' worth of AI accelerators, showcasing the growing importance of custom AI chips and networking infrastructure. Engineers at Broadcom's R&D labs in San Jose are constantly working to develop these devices, a process that takes around three years from initial design to release.\n\nA key challenge is managing the heat generated by these powerful devices. Broadcom is currently upgrading to a liquid cooling system to improve power efficiency and handle the extreme heat produced by its chips. The shift to liquid cooling is driven by the increasing power demands of AI workloads, which air cooling systems can no longer adequately address.\n\nThe article emphasizes the massive scale of new AI data centers, requiring Broadcom to innovate in networking across multiple buildings due to power constraints. The company faces the challenge of connecting tens of thousands of GPUs in a single building and even across multiple locations to support the training of large AI models. The increasing compute needs and the scale of these AI data centers are driving significant changes in Broadcom's business and product development.\n",
    "chinese_title": "博通设计实验室幕后探秘",
    "chinese_summary": "This article provides a behind-the-scenes look at Broadcom's design labs, focusing on the company's response to the rapidly evolving demands of AI and its impact on their network switch business. The AI boom, particularly with models like ChatGPT, has drastically reshaped Broadcom's priorities. Their switches, crucial for coordinating data in massive AI data centers, are now designed to handle the high-capacity needs of these facilities.\n\nThe article highlights Broadcom's partnership with OpenAI to build 10 gigawatts' worth of AI accelerators, showcasing the growing importance of custom AI chips and networking infrastructure. Engineers at Broadcom's R&D labs in San Jose are constantly working to develop these devices, a process that takes around three years from initial design to release.\n\nA key challenge is managing the heat generated by these powerful devices. Broadcom is currently upgrading to a liquid cooling system to improve power efficiency and handle the extreme heat produced by its chips. The shift to liquid cooling is driven by the increasing power demands of AI workloads, which air cooling systems can no longer adequately address.\n\nThe article emphasizes the massive scale of new AI data centers, requiring Broadcom to innovate in networking across multiple buildings due to power constraints. The company faces the challenge of connecting tens of thousands of GPUs in a single building and even across multiple locations to support the training of large AI models. The increasing compute needs and the scale of these AI data centers are driving significant changes in Broadcom's business and product development.\n"
  },
  {
    "id": "45866697",
    "title": "Marble Fountain",
    "url": "https://willmorrison.net/posts/marble-fountain/",
    "summary": "生成摘要时出错",
    "chinese_title": "大理石喷泉",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45886191",
    "title": "DARPA and Texas Bet $1.4B on Unique Foundry -3D heterogeneous integration",
    "url": "https://spectrum.ieee.org/3d-heterogeneous-integration",
    "summary": "生成摘要时出错",
    "chinese_title": "DARPA和德州豪掷14亿美元押注独特晶圆厂 - 3D异构集成",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45897225",
    "title": "Ditch your (mut)ex, you deserve better",
    "url": "https://chrispenner.ca/posts/mutexes",
    "summary": "The article critiques the use of mutexes for managing shared mutable state in concurrent programming, arguing they are prone to data races, deadlocks, and break encapsulation.\n\nIt begins with a simple banking system example to illustrate synchronization problems arising from concurrent access to shared data. Data races, where multiple threads access and modify the same memory location non-deterministically, are identified as a primary concern.\n\nMutexes, traditionally used to enforce exclusive access to critical sections, are presented as a flawed solution. The author demonstrates how mutexes don't compose well, forcing developers to break encapsulation and expose locking mechanisms to the caller. Fixing one concurrency issue often leads to others, like deadlocks, where threads block each other indefinitely. The article highlights that mutexes operate on the honor system, relying on programmers to correctly implement locking, a risk that can lead to unpredictable behavior.\n\nThe author emphasizes that these issues are difficult to spot and debug, especially in complex systems. They advocate for exploring alternative concurrency management techniques beyond mutexes to create more robust and maintainable software. The article asserts that relying on mutexes as the primary synchronization tool is inadequate for modern, highly concurrent systems.\n",
    "chinese_title": "Ditch your (mut)ex, you deserve better",
    "chinese_summary": "The article critiques the use of mutexes for managing shared mutable state in concurrent programming, arguing they are prone to data races, deadlocks, and break encapsulation.\n\nIt begins with a simple banking system example to illustrate synchronization problems arising from concurrent access to shared data. Data races, where multiple threads access and modify the same memory location non-deterministically, are identified as a primary concern.\n\nMutexes, traditionally used to enforce exclusive access to critical sections, are presented as a flawed solution. The author demonstrates how mutexes don't compose well, forcing developers to break encapsulation and expose locking mechanisms to the caller. Fixing one concurrency issue often leads to others, like deadlocks, where threads block each other indefinitely. The article highlights that mutexes operate on the honor system, relying on programmers to correctly implement locking, a risk that can lead to unpredictable behavior.\n\nThe author emphasizes that these issues are difficult to spot and debug, especially in complex systems. They advocate for exploring alternative concurrency management techniques beyond mutexes to create more robust and maintainable software. The article asserts that relying on mutexes as the primary synchronization tool is inadequate for modern, highly concurrent systems.\n"
  },
  {
    "id": "45817027",
    "title": "Étude in C minor (2020)",
    "url": "https://zserge.com/posts/etude-in-c/",
    "summary": "生成摘要时出错",
    "chinese_title": "Étude in C minor (2020)",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45844419",
    "title": "The R47: A new physical RPN calculator",
    "url": "https://www.swissmicros.com/product/model-r47",
    "summary": "生成摘要时出错",
    "chinese_title": "The R47: A new physical RPN calculator",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45898467",
    "title": "Show HN: DeltaGlider – Store 4TB of build artifacts in 5GB",
    "url": "https://github.com/beshu-tech/deltaglider",
    "summary": "生成摘要时出错",
    "chinese_title": "Show HN: DeltaGlider – Store 4TB of build artifacts in 5GB",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45885813",
    "title": "iPhone Pocket",
    "url": "https://www.apple.com/newsroom/2025/11/introducing-iphone-pocket-a-beautiful-way-to-wear-and-carry-iphone/",
    "summary": "生成摘要时出错",
    "chinese_title": "iPhone Pocket",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45886194",
    "title": "Advent of Code on the Z-Machine",
    "url": "https://entropicthoughts.com/advent-of-code-on-z-machine",
    "summary": "生成摘要时出错",
    "chinese_title": "Advent of Code on the Z-Machine",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45877149",
    "title": "Asus Ascent GX10",
    "url": "https://www.asus.com/networking-iot-servers/desktop-ai-supercomputer/ultra-small-ai-supercomputers/asus-ascent-gx10/",
    "summary": "生成摘要时出错",
    "chinese_title": "Asus Ascent GX10",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45785300",
    "title": "How I fell in love with Erlang",
    "url": "https://boragonul.com/post/falling-in-love-with-erlang",
    "summary": "生成摘要时出错",
    "chinese_title": "How I fell in love with Erlang",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45887105",
    "title": "The Perplexing Appeal of the Telepathy Tapes",
    "url": "https://asteriskmag.com/issues/12-books/paradigm-shifted-the-perplexing-appeal-of-the-telepathy-tapes",
    "summary": "生成摘要时出错",
    "chinese_title": "The Perplexing Appeal of the Telepathy Tapes",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45888891",
    "title": "Firefox expands fingerprint protections",
    "url": "https://blog.mozilla.org/en/firefox/fingerprinting-protections/",
    "summary": "生成摘要时出错",
    "chinese_title": "Firefox expands fingerprint protections",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45888143",
    "title": "Grebedoc – static site hosting for Git forges",
    "url": "https://grebedoc.dev",
    "summary": "生成摘要时出错",
    "chinese_title": "Grebedoc – static site hosting for Git forges",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45896733",
    "title": "Problems with C++ exceptions",
    "url": "https://marler8997.github.io/blog/bjarne-fix-your-language/",
    "summary": "生成摘要时出错",
    "chinese_title": "Problems with C++ exceptions",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45883995",
    "title": "Hiring a developer as a small indie studio in 2025",
    "url": "https://www.ballardgames.com/tales/hiring-dev-2025/",
    "summary": "生成摘要时出错",
    "chinese_title": "Hiring a developer as a small indie studio in 2025",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45885135",
    "title": "Zig / C++ Interop",
    "url": "https://tuple.app/blog/zig-cpp-interop",
    "summary": "This article by Johnny Marler discusses techniques for achieving seamless interoperability between Zig and C++, focusing on how to share data types between the two languages. The primary challenge addressed is embedding types from one language into structs/classes of the other without relying solely on `extern` types, allowing for full use of standard library types.\n\nThe solution involves using a `SIZED_OPAQUE` macro in C++ to create opaque types that define only the size and alignment of a Zig type. Zig then uses `@cImport` and `comptime` checks to verify that the declared size and alignment match the actual Zig type. This approach enables both languages to reserve the correct memory space for the other's types without requiring full type definitions.\n\nThe article further explains that passing shared pointers between Zig and C++ requires passing pointers to those shared pointers and utilizing C++ functions to manage memory (e.g., moving shared pointers instead of copying). A new pattern is introduced with the `DEFINE_OPAQUE_CONCRETE` macro, which creates conversion functions between opaque types (used by Zig) and concrete types (in C++), reducing the need for explicit casts and improving code readability when dealing with pointers to shared pointers. This simplifies the code and enhances maintainability by centralizing the type conversion logic. An example of storing a Zig HTTP client within a C++ class is provided, showcasing the practical application of these techniques.\n",
    "chinese_title": "Zig / C++ Interop",
    "chinese_summary": "This article by Johnny Marler discusses techniques for achieving seamless interoperability between Zig and C++, focusing on how to share data types between the two languages. The primary challenge addressed is embedding types from one language into structs/classes of the other without relying solely on `extern` types, allowing for full use of standard library types.\n\nThe solution involves using a `SIZED_OPAQUE` macro in C++ to create opaque types that define only the size and alignment of a Zig type. Zig then uses `@cImport` and `comptime` checks to verify that the declared size and alignment match the actual Zig type. This approach enables both languages to reserve the correct memory space for the other's types without requiring full type definitions.\n\nThe article further explains that passing shared pointers between Zig and C++ requires passing pointers to those shared pointers and utilizing C++ functions to manage memory (e.g., moving shared pointers instead of copying). A new pattern is introduced with the `DEFINE_OPAQUE_CONCRETE` macro, which creates conversion functions between opaque types (used by Zig) and concrete types (in C++), reducing the need for explicit casts and improving code readability when dealing with pointers to shared pointers. This simplifies the code and enhances maintainability by centralizing the type conversion logic. An example of storing a Zig HTTP client within a C++ class is provided, showcasing the practical application of these techniques.\n"
  },
  {
    "id": "45873625",
    "title": "The Linux Kernel Looks to “Bite the Bullet” in Enabling Microsoft C Extensions",
    "url": "https://www.phoronix.com/news/Linux-6.19-Patch-Would-MS-Ext",
    "summary": "生成摘要时出错",
    "chinese_title": "The Linux Kernel Looks to “Bite the Bullet” in Enabling Microsoft C Extensions",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45892174",
    "title": "Xortran - A PDP-11 Neural Network With Backpropagation in Fortran IV",
    "url": "https://github.com/dbrll/Xortran",
    "summary": "生成摘要时出错",
    "chinese_title": "Xortran - A PDP-11 Neural Network With Backpropagation in Fortran IV",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45843954",
    "title": "A Treatise on the All-Healing Qualities of Earth Bathing (1790)",
    "url": "https://publicdomainreview.org/collection/earth-bathing/",
    "summary": "生成摘要时出错",
    "chinese_title": "A Treatise on the All-Healing Qualities of Earth Bathing (1790)",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45896555",
    "title": "Bank of America Just Issued a Stark Warning: AI Boom Is Hitting a Cash Crunch",
    "url": "https://247wallst.com/investing/2025/11/10/bank-of-america-just-issued-a-stark-warning-the-ai-boom-is-hitting-a-cash-crunch/",
    "summary": "生成摘要时出错",
    "chinese_title": "Bank of America Just Issued a Stark Warning: AI Boom Is Hitting a Cash Crunch",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45880939",
    "title": "Spatial intelligence is AI’s next frontier",
    "url": "https://drfeifei.substack.com/p/from-words-to-worlds-spatial-intelligence",
    "summary": "生成摘要时出错",
    "chinese_title": "Spatial intelligence is AI’s next frontier",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45884658",
    "title": "The write last, read first rule",
    "url": "https://tigerbeetle.com/blog/2025-11-06-the-write-last-read-first-rule/",
    "summary": "生成摘要时出错",
    "chinese_title": "The write last, read first rule",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45878826",
    "title": "Omnilingual ASR: Advancing automatic speech recognition for 1600 languages",
    "url": "https://ai.meta.com/blog/omnilingual-asr-advancing-automatic-speech-recognition/?_fb_noscript=1",
    "summary": "生成摘要时出错",
    "chinese_title": "Omnilingual ASR: Advancing automatic speech recognition for 1600 languages",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45846525",
    "title": "High speed X-ray video: jumping beans, wind-up toys and more",
    "url": "https://www.youtube.com/watch?v=xdpDd7dyU00",
    "summary": "生成摘要时出错",
    "chinese_title": "High speed X-ray video: jumping beans, wind-up toys and more",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45800843",
    "title": "Metaphors for Biology: Sizes",
    "url": "https://press.asimov.com/articles/metaphors-size",
    "summary": "生成摘要时出错",
    "chinese_title": "Metaphors for Biology: Sizes",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45810048",
    "title": "When Soviet-made cars roamed Singapore roads",
    "url": "https://remembersingapore.org/2025/10/30/soviet-made-cars-singapore-70s-to-90s/",
    "summary": "生成摘要时出错",
    "chinese_title": "When Soviet-made cars roamed Singapore roads",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45887709",
    "title": "Show HN: Gametje – A casual online gaming platform",
    "url": "https://gametje.com",
    "summary": "生成摘要时出错",
    "chinese_title": "Show HN: Gametje – A casual online gaming platform",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45879793",
    "title": "Using Generative AI in Content Production",
    "url": "https://partnerhelp.netflixstudios.com/hc/en-us/articles/43393929218323-Using-Generative-AI-in-Content-Production",
    "summary": "生成摘要时出错",
    "chinese_title": "Using Generative AI in Content Production",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45887574",
    "title": "Physicists Take the Imaginary Numbers Out of Quantum Mechanics",
    "url": "https://www.quantamagazine.org/physicists-take-the-imaginary-numbers-out-of-quantum-mechanics-20251107/",
    "summary": "生成摘要时出错",
    "chinese_title": "Physicists Take the Imaginary Numbers Out of Quantum Mechanics",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45897647",
    "title": "Show HN: YaraDB – Lightweight open-source document database built with FastAPI",
    "url": "https://github.com/illusiOxd/yaradb",
    "summary": "生成摘要时出错",
    "chinese_title": "Show HN: YaraDB – Lightweight open-source document database built with FastAPI",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45845620",
    "title": "SanDisk launches dongle-like Extreme Fit USB-C flash drive with up to 1 TB",
    "url": "https://www.notebookcheck.net/Sandisk-launches-dongle-like-Extreme-Fit-USB-C-flash-drive-with-up-to-1-TB-capacity.1156601.0.html",
    "summary": "生成摘要时出错",
    "chinese_title": "SanDisk launches dongle-like Extreme Fit USB-C flash drive with up to 1 TB",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45890394",
    "title": "Show HN: Data Formulator – interactive AI agents for data analysis (Microsoft)",
    "url": "https://data-formulator.ai/",
    "summary": "生成摘要时出错",
    "chinese_title": "Show HN: Data Formulator – interactive AI agents for data analysis (Microsoft)",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45840321",
    "title": "Unix v4 Tape Found",
    "url": "https://discuss.systems/@ricci/115504720054699983",
    "summary": "生成摘要时出错",
    "chinese_title": "Unix v4 Tape Found",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45876598",
    "title": "Time to start de-Appling",
    "url": "https://heatherburns.tech/2025/11/10/time-to-start-de-appling/",
    "summary": "生成摘要时出错",
    "chinese_title": "Time to start de-Appling",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45891772",
    "title": "Vertical integration is the only thing that matters",
    "url": "https://becca.ooo/blog/vertical-integration/",
    "summary": "生成摘要时出错",
    "chinese_title": "Vertical integration is the only thing that matters",
    "chinese_summary": "生成摘要时出错"
  }
]