[
  {
    "id": "44404905",
    "title": "MCP: An (Accidentally) Universal Plugin System",
    "url": "https://worksonmymachine.substack.com/p/mcp-an-accidentally-universal-plugin",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "MCP：一个（意外地）通用的插件系统",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "44405953",
    "title": "Jane Street's sneaky retention tactic",
    "url": "https://www.economist.com/finance-and-economics/2025/06/26/jane-streets-sneaky-retention-tactic",
    "summary": "The article discusses Jane Street, a hedge fund, and their unusual employee retention tactic: building a compiler for their own in-house programming language. This is presented as a surprising and eyebrow-raising strategy compared to more conventional hedge fund tactics. The language in question appears to be a French programming language (possibly OCaml, as Jane Street is known to be a major user of that language). The article suggests that investing in such a specialized tool, a custom compiler, is a significant commitment, implying it's a way to keep their programmers engaged and invested in the company long-term. Other articles in the \"Finance & economics\" section of the print edition include topics like tax avoidance on stocks, the consequences of reduced migration, the rise of prediction markets, and commodity price volatility. The article implies that Jane Street's compiler strategy is a novel and possibly extreme way to retain valuable employees in the competitive hedge fund industry.\n",
    "chinese_title": "Jane Street 悄然的留人策略",
    "chinese_summary": "简·街：一家对冲基金及其非同寻常的员工保留策略——为其内部编程语言构建编译器。印刷版“金融与经济”版块的其他文章包括股票避税、减少移民的后果、预测市场的兴起以及大宗商品价格波动等主题。"
  },
  {
    "id": "44406171",
    "title": "BusyBeaver(6) Is Quite Large",
    "url": "https://scottaaronson.blog/?p=8972",
    "summary": "This blog post by Raymond Laflamme discusses recent groundbreaking advances in determining lower bounds for the Busy Beaver function, specifically BB(6). The Busy Beaver function, BB(n), represents the maximum number of steps a Turing machine with 'n' states can take before halting when started on an all-zero tape.\n\nLaflamme highlights the immense leap in magnitude between BB(5) and BB(6). While BB(5) is known to be 47,176,870, recent work by \"mxdys\" from the \"BBchallenge\" team has dramatically increased the known lower bound for BB(6). The bound was first improved to 10,000,000 tetrated to the 10, and then further to 2 tetrated to the 2 tetrated to the 2 tetrated to the 9, a number so large it surpasses simple visualizations. This implies BB(6) is at least 2 pentated to the 5.\n\nThe author reflects on how these discoveries, especially the sheer scale of BB(6), lead him to reconsider the point at which the value of BB(n) becomes independent of the ZFC axioms of set theory. He posits that this independence might occur at a much lower 'n' (7, 8, or 9) than previously thought (currently known to be n=745).\n\nFinally, Laflamme mentions his recent trip to STOC'2025 in Prague and provides a link to his plenary lecture slides on \"The Status of Quantum Speedups.\" He also briefly touches on his struggles with the world's current state, finding solace in research breakthroughs like this one.\n",
    "chinese_title": "忙碌海狸(6)非常大",
    "chinese_summary": "Raymond Laflamme的博客文章探讨了确定忙碌海狸函数（具体为BB(6)）下界的最新突破性进展。忙碌海狸函数BB(n)表示具有“n”个状态的图灵机在全零磁带上启动后停止之前可以执行的最大步数。\n\nLaflamme强调了BB(5)和BB(6)之间量级的巨大飞跃。虽然已知BB(5)为47,176,870，但来自“BBchallenge”团队的“mxdys”的最新工作已经大幅提高了BB(6)的已知下限。 该下限首先提高到10,000,000叠代10次，然后进一步提高到2叠代2叠代2叠代9次，这个数字如此之大，以至于超越了简单的可视化。 这意味着BB(6)至少为2五迭代5次。\n\n作者反思了这些发现，特别是BB(6)的巨大规模，使他重新考虑了BB(n)的值在何处变得独立于集合论的ZFC公理。 他假设这种独立性可能发生在比之前认为的“n”值（目前已知为n=745）更低的“n”（7、8或9）处。\n\n最后，Laflamme提到了他最近在布拉格参加STOC'2025的行程，并提供了他关于“量子加速的现状”的全会讲座幻灯片链接。他还简要地谈到了他对世界现状的挣扎，并在这样的研究突破中找到了慰藉。"
  },
  {
    "id": "44404164",
    "title": "We ran a Unix-like OS Xv6 on our home-built CPU with a home-built C compiler",
    "url": "https://fuel.edby.coffee/posts/how-we-ported-xv6-os-to-a-home-built-cpu-with-a-home-built-c-compiler/",
    "summary": "Takaya Saeki recounts a student project where a team of undergraduates at the University of Tokyo designed their own CPU architecture (ISA), built a processor on an FPGA, created a C compiler (Ucc) from scratch, and ported Xv6, a Unix-like operating system, to their home-built CPU named GAIA.\n\nThe project stemmed from a CPU experiment, which typically involves designing a CPU, building a compiler for a subset of OCaml, and running a ray-tracing program. Saeki's team, Group X, aimed to port an OS to their CPU for entertainment. They chose Xv6 due to its simplicity and similarity to Unix v6.\n\nThe project faced several challenges, including the need for a C compiler, understanding the necessary CPU features for an OS (like privilege protections and virtual addresses), a basic simulator, and the low portability of Xv6. The team overcame these hurdles by building the Ucc compiler, porting Xv6 to MIPS for learning, and implementing crucial CPU features.\n\nKey achievements included GAIA's CPU design, simulator enhancements with debugging capabilities, fixing incompatibility issues between Ucc's char size and Xv6's assumptions, and resolving a cache alias problem with a \"Page Coloring\" solution. Ultimately, Xv6 ran successfully on the simulator and then on the real GAIA CPU. As a final touch, they added entertainment features like running the sl command and creating a high-quality 2048 game, even adding features like ioctl to Xv6 to enable it.\n",
    "chinese_title": "我们在自制的 CPU 上，使用自制的 C 编译器运行了类 Unix 的 OS Xv6。",
    "chinese_summary": "佐伯多佳也讲述了一个学生项目，其中东京大学的一个本科生团队设计了自己的CPU架构（ISA），在FPGA上构建了一个处理器，从头开始创建了一个C编译器（Ucc），并将类Unix操作系统Xv6移植到他们自制的名为GAIA的CPU上。\n\n该项目源于一个CPU实验，该实验通常涉及设计CPU，构建一个OCaml子集的编译器，并运行一个光线追踪程序。佐伯的团队，X小组，旨在将一个操作系统移植到他们的CPU上以供娱乐。他们选择Xv6是因为它的简单性和与Unix v6的相似性。\n\n该项目面临若干挑战，包括需要一个C编译器，理解操作系统所需的CPU特性（如特权保护和虚拟地址），一个基本的模拟器，以及Xv6的低可移植性。该团队通过构建Ucc编译器、将Xv6移植到MIPS以供学习，以及实现关键的CPU特性来克服了这些障碍。\n\n主要成就包括GAIA的CPU设计、具有调试功能的模拟器增强、修复Ucc的char大小与Xv6的假设之间的不兼容问题，以及使用“页面着色”解决方案解决缓存别名问题。最终，Xv6在模拟器上成功运行，然后在真正的GAIA CPU上运行。作为最后的润色，他们添加了娱乐功能，例如运行sl命令并创建一个高质量的2048游戏，甚至向Xv6添加了ioctl等功能以启用它。"
  },
  {
    "id": "44403594",
    "title": "Unheard works by Erik Satie to premiere 100 years after his death",
    "url": "https://www.theguardian.com/music/2025/jun/26/unheard-works-by-erik-satie-to-premiere-100-years-after-his-death",
    "summary": "Twenty-seven previously unheard works by the innovative French composer Erik Satie are set to premiere a century after his death in 1925. The pieces, ranging from cabaret songs to minimalist nocturnes, were painstakingly pieced together by musicologist James Nye and composer Sato Matsui from hundreds of Satie's notebooks discovered in various archives. These works are believed to have been composed in the bohemian bistros of Montmartre, Paris, where Satie worked as a pianist in the early 20th century.\n\nThe sketches have been prepared for performance by acclaimed French pianist Alexandre Tharaud and will be released in a new album titled *Satie: Discoveries* on Friday by Erato. Nye expressed excitement at the discovery, highlighting the variety and inventiveness of Satie's output. He described Satie's composing process, noting he often jotted down ideas while walking or in cafes, rarely composing at the piano.\n\nThe newly discovered works include pieces similar to Satie's well-known Gymnopedies and Gnossiennes, such as Réflexions nocturnes and Autour du 1st nocturne, as well as experimental works. The centenary of Satie's death on July 1 will be marked with numerous programmes on BBC channels. Satie's legacy has been championed by figures like Peter Dickinson and John Cage, further solidifying his influence on modern music.\n",
    "chinese_title": "埃里克·萨蒂逝世百年后，其未闻世作品将首演",
    "chinese_summary": "埃里克·萨蒂去世百年后，二十七首此前从未公开的这位创新法国作曲家的作品即将首演。这些作品包括从歌舞厅歌曲到极简主义夜曲等多种类型，由音乐学家詹姆斯·奈和作曲家佐藤松井从在各个档案馆发现的数百本萨蒂笔记本中精心整理而成。据信，这些作品创作于20世纪初萨蒂在巴黎蒙马特波西米亚小酒馆担任钢琴师期间。\n\n这些草稿已由著名法国钢琴家亚历山大·塔罗准备演奏，并将于周五由Erato发行一张名为《萨蒂：发现》的新专辑。奈表达了对这一发现的兴奋之情，并强调了萨蒂作品的多样性和创造性。他描述了萨蒂的创作过程，指出他经常在散步或在咖啡馆里记下想法，很少在钢琴上创作。\n\n新发现的作品包括类似于萨蒂广为人知的《吉姆诺培迪》和《格诺西恩》的作品，例如《夜曲思考》和《围绕第一首夜曲》，以及实验性作品。7月1日萨蒂逝世一百周年将通过英国广播公司（BBC）的多个频道进行纪念。彼得·迪金森和约翰·凯奇等人物一直倡导萨蒂的遗产，进一步巩固了他对现代音乐的影响。"
  },
  {
    "id": "44405342",
    "title": "Parsing JSON in Forty Lines of Awk",
    "url": "https://akr.am/blog/posts/parsing-json-in-forty-lines-of-awk",
    "summary": "This article presents a concise JSON parser written in approximately 40 lines of `awk` code. The author, facing a need to parse JSON within an existing POSIX shell script, opted for `awk` due to its ubiquity and availability in POSIX environments, as alternatives like `jq` require additional dependencies.\n\nThe parser prioritizes brevity and assumes well-formed JSON input from a trusted source, acknowledging limitations in comprehensive error handling. It offers a simple interface: the `get_json_value` function takes a JSON string and a dotted path to a key or array index, returning the corresponding value. This function handles both objects and arrays, treating arrays as objects with integer keys. The article provides the complete, annotated `awk` code for `get_json_value`, explaining its logic for traversing the JSON structure, identifying keys and values, and handling nested objects and arrays.\n\nAdditionally, the article includes a `decode_json_string` function to handle basic JSON string decoding, particularly escape sequences (excluding Unicode escapes). A simple `error` function is also provided for rudimentary error reporting, redirecting output to `stderr`. The article emphasizes practicality and conciseness over complete JSON standard compliance, making it suitable for scenarios where a lightweight JSON parsing solution is needed within a POSIX environment.\n",
    "chinese_title": "用四十行 Awk 解析 JSON",
    "chinese_summary": "本文介绍了一个用大约 40 行 `awk` 代码编写的简洁 JSON 解析器。作者因需要在现有 POSIX shell 脚本中解析 JSON，选择了 `awk`，因为它在 POSIX 环境中普遍存在且可用，而像 `jq` 这样的替代方案需要额外的依赖项。\n\n该解析器优先考虑简洁性，并假设输入来自可信来源的格式良好的 JSON，并承认在全面错误处理方面的局限性。它提供了一个简单的接口：`get_json_value` 函数接受一个 JSON 字符串和一个指向键或数组索引的点路径，并返回相应的值。此函数处理对象和数组，将数组视为具有整数键的对象。本文提供了完整的、带有注释的 `awk` 代码，用于 `get_json_value`，解释了它遍历 JSON 结构、识别键和值以及处理嵌套对象和数组的逻辑。\n\n此外，本文还包括一个 `decode_json_string` 函数来处理基本的 JSON 字符串解码，特别是转义序列（不包括 Unicode 转义）。还提供了一个简单的 `error` 函数，用于进行基本的错误报告，并将输出重定向到 `stderr`。本文强调实用性和简洁性，而不是完全符合 JSON 标准，因此它适用于需要在 POSIX 环境中使用轻量级 JSON 解析解决方案的场景。"
  },
  {
    "id": "44396518",
    "title": "Show HN: I'm an airline pilot – I built interactive graphs/globes of my flights",
    "url": "https://jameshard.ing/pilot",
    "summary": "This \"Show HN\" post features an Airbus A350 pilot who has created interactive visualizations of their flight log data. The pilot, a First Officer with British Airways, has been flying since 2016, initially on the A320 family and since 2023 on the A350.\n\nThe pilot utilizes LogTen Pro to digitally log flights and uses SQL to query the data, presenting it in several interactive formats. Highlights include:\n\n*   **GitHub-style flying history:** A calendar graph showing flight hours per day, revealing patterns related to career changes (short-haul to long-haul) and the impact of Covid-19.\n*   **3D Globe Visualizations:** Globes showing flight activity by country and airport.\n*   **Destination Matrix:** A circular chart displaying the frequency of flights between countries.\n*   **Annual Hours Chart:** Displays hours flown per year, broken down by pilot role (PIC, PICUS, P2, Heavy) and defining acronyms like PIC and PICUS within the British Airways context.\n*   **Cumulative Hours Chart:** Shows total flight hours per aircraft type, using ICAO designators (e.g., A320 family, A350).\n*   **Flight Time vs Distance Scatterplot:** Demonstrates the relationship between flight time and distance, highlighting the impact of prevailing winds on westbound flights from London.\n\nThe project demonstrates a creative way to visualize and analyze flight data, providing insights into the pilot's career progression and flying experiences.\n",
    "chinese_title": "展示一下：我是一名飞行员，我构建了我飞行航线的交互式图表/地球仪",
    "chinese_summary": "飞行员自制交互式飞行日志可视化 (Show HN)\n\n一位空客A350飞行员（英国航空副驾驶，自2016年开始飞行，最初驾驶A320系列，2023年起驾驶A350）创建了其飞行日志数据的交互式可视化。\n\n该飞行员使用LogTen Pro进行数字化飞行记录，并使用SQL查询数据，以多种交互式格式呈现。亮点包括：\n\n*   **GitHub风格的飞行历史：** 日历图显示每日飞行小时数，揭示了与职业变动（短途到长途）和 Covid-19 影响相关的模式。\n*   **3D地球可视化：** 显示按国家和机场划分的飞行活动的地球仪。\n*   **目的地矩阵：** 显示国家之间航班频率的圆形图。\n*   **年度小时数图表：** 显示每年飞行的小时数，按飞行员角色（PIC，PICUS，P2，Heavy）分解，并定义英国航空环境中的PIC和PICUS等缩写。\n*   **累计小时数图表：** 显示每种机型的总飞行小时数，使用ICAO代码（例如，A320系列，A350）。\n*   **飞行时间和距离散点图：** 展示了飞行时间和距离之间的关系，突出了盛行风对从伦敦出发的西行航班的影响。\n\n该项目展示了一种可视化和分析飞行数据的创造性方法，提供了对飞行员职业发展和飞行体验的洞察。"
  },
  {
    "id": "44367811",
    "title": "Lossless LLM 3x Throughput Increase by LMCache",
    "url": "https://github.com/LMCache/LMCache",
    "summary": "LMCache is an LLM serving engine extension designed to significantly improve throughput and reduce Time To First Token (TTFT), particularly in long-context scenarios. It achieves this by caching and reusing Key-Value (KV) caches of reusable text across different storage locations (GPU, CPU DRAM, Local Disk), effectively saving GPU cycles and decreasing user response delay. This reuse extends to any reused text, not just prefixes.\n\nWhen combined with vLLM, LMCache can provide 3-10x improvements in delay and GPU cycle reduction across various LLM use cases like multi-round QA and RAG.\n\nKey features of LMCache V1 include high-performance CPU KVCache offloading, disaggregated prefill, P2P KVCache sharing, stable support for non-prefix KV caches, and pip installation compatibility with the latest vLLM. It's now supported within the vLLM production stack ecosystem and offers user and developer documentation.\n\nThe project is actively developed with regular community meetings held weekly, welcoming contributions and collaborations. Several research papers are available detailing the underlying technologies. LMCache is licensed under Apache License 2.0.\n",
    "chinese_title": "LMCache 实现无损 LLM 吞吐量提升 3 倍",
    "chinese_summary": "LMCache 是一种 LLM 服务引擎扩展，旨在显著提高吞吐量并降低首个 Token 生成时间 (TTFT)，尤其是在长上下文场景中。它通过缓存和重用跨不同存储位置（GPU、CPU DRAM、本地磁盘）的可重用文本的键值 (KV) 缓存来实现这一点，从而有效节省 GPU 周期并减少用户响应延迟。这种重用适用于任何重用的文本，而不仅仅是前缀。\n\n当与 vLLM 结合使用时，LMCache 可以在多轮 QA 和 RAG 等各种 LLM 用例中提供 3-10 倍的延迟和 GPU 周期减少。\n\nLMCache V1 的主要功能包括高性能 CPU KVCache 卸载、分离式预填充、P2P KVCache 共享、对非前缀 KV 缓存的稳定支持以及与最新 vLLM 的 pip 安装兼容性。它现在在 vLLM 生产堆栈生态系统中得到支持，并提供用户和开发者文档。\n\n该项目正在积极开发中，每周定期举行社区会议，欢迎贡献和合作。 有几篇研究论文详细介绍了底层技术。 LMCache 根据 Apache License 2.0 获得许可。"
  },
  {
    "id": "44346141",
    "title": "Engineer creates ad block for the real world with augmented reality glasses",
    "url": "https://www.tomshardware.com/maker-stem/engineer-creates-ad-block-for-the-real-world-with-augmented-reality-glasses-no-more-products-or-branding-in-your-everyday-life",
    "summary": "A software engineer named Stijn Spanhove has created an augmented reality application for Snap's AR Spectacles that blocks real-world advertisements. The app uses Google's Gemini AI to identify billboards, product branding, and other ads visible through the glasses and replaces them with a red square, effectively creating an \"AdBlock\" for the physical world.\n\nSpanhove showcased the app in a video demonstrating its ability to block ads on posters, pedestrian billboards, and even food packaging. He envisions a future where users can customize the blocked areas with personalized content.\n\nThe app is built using Snap's shared libraries and APIs, currently making it exclusive to Snap Spectacles users. While other AR platforms like Apple Vision Pro and Meta Quest are not yet supported, the project raises questions about the future of controlling what we see and the potential impact on advertising.\n\nCommenters on the article had mixed reactions, with some finding the concept intriguing, particularly for those sensitive to advertising or with addictions. Others feel the red squares are more distracting than the ads themselves, or that online ad-blocking is a more pressing concern. One commenter suggested that ad revenue subsidizes the ticket prices, so ad-blocking in these areas might be considered a form of theft.\n",
    "chinese_title": "工程师利用增强现实眼镜为现实世界创建广告拦截器",
    "chinese_summary": "一名名叫Stijn Spanhove的软件工程师为Snap的AR眼镜开发了一款增强现实应用程序，可以屏蔽现实世界的广告。该应用程序使用谷歌的Gemini AI识别通过眼镜可见的广告牌、产品品牌和其他广告，并将其替换为红色方块，从而有效地为现实世界创建了一个“AdBlock”。\n\nSpanhove在一个视频中展示了该应用程序屏蔽海报、行人广告牌甚至食品包装上的广告的能力。他设想未来用户可以用个性化内容自定义屏蔽区域。\n\n该应用程序是使用Snap的共享库和API构建的，目前仅供Snap Spectacles用户使用。虽然其他AR平台（如Apple Vision Pro和Meta Quest）尚未得到支持，但该项目引发了人们对未来控制我们所见事物以及对广告潜在影响的质疑。\n\n文章评论区反响不一，一些人觉得这个概念很有趣，特别是对于那些对广告敏感或有成瘾症的人。另一些人则认为红色方块比广告本身更分散注意力，或者认为在线广告拦截是一个更紧迫的问题。一位评论员表示，广告收入补贴了票价，因此在这些区域屏蔽广告可能被视为一种盗窃行为。"
  },
  {
    "id": "44403383",
    "title": "History of Cycling Maps",
    "url": "https://cyclemaps.blogspot.com/",
    "summary": "This website offers a comprehensive history of cycling maps, featuring over a hundred carefully selected and restored extracts from key providers. Created for the general public interested in the subject, it functions as an electronic \"coffee-table\" book for leisurely browsing and factual reference, rather than a traditional blog with comments and forums.\n\nThe site, initially published in 2021 and now expanded, includes dedicated pages covering the following topics:\n\n*   **Introduction:** Setting the stage for the topic.\n*   **Development of Cycling:** Contextualizing the evolution of cycling's impact on mapmaking.\n*   **Individual Map Publishers:** Exploring the contributions of various map publishers.\n*   **Sources and References:** Providing the foundation for the information presented.\n*   **How to Date Cycling Maps:** A guide to determining the age of maps.\n*   **The Black Museum - Map Mistakes:** Highlighting errors and curiosities found in cycling maps.\n\nInstead of blog posts, the content is organized into distinct pages accessible via the Home Page, providing a structured and informative experience for those interested in the history and evolution of cycling maps.\n",
    "chinese_title": "自行车地图史",
    "chinese_summary": "本网站提供全面的自行车地图历史，精选并修复了来自主要供应商的一百多份重要摘录。专为对该主题感兴趣的公众创建，它作为一个电子“咖啡桌”读物，供休闲浏览和事实参考，而不是一个带有评论和论坛的传统博客。\n\n该网站最初于2021年发布，现已扩展，包含以下主题的专门页面：\n\n*   **简介：** 为该主题奠定基础。\n*   **自行车运动的发展：** 将自行车运动对地图制作的影响置于背景之中。\n*   **独立地图出版商：** 探索各个地图出版商的贡献。\n*   **来源和参考：** 为所呈现的信息提供基础。\n*   **如何确定自行车地图的年代：** 确定地图年代的指南。\n*   **黑色博物馆 - 地图错误：** 突出显示自行车地图中发现的错误和奇闻异事。\n\n内容并非以博文形式呈现，而是组织成可通过主页访问的独立页面，为对自行车地图的历史和演变感兴趣的人提供结构化的信息体验。"
  },
  {
    "id": "44404224",
    "title": "ZeQLplus: Terminal SQLite Database Browser",
    "url": "https://github.com/ZetloStudio/ZeQLplus",
    "summary": "ZeQL+ is a lightweight, cross-platform, open-source terminal-based SQLite database browser designed for simplicity and speed. It allows users to easily open and explore SQLite databases directly from the command line without any external dependencies.\n\nKey features include:\n\n*   **Database Browsing:** Open and list tables within any SQLite database file.\n*   **Fast Performance:** Optimized for quick access and display of data.\n*   **Terminal Interface:** Operates within a terminal or command prompt.\n*   **Small Footprint:** A tiny executable requiring no installation.\n*   **Paginated Views:** Displays table rows in a manageable, paginated format.\n*   **SQL Queries:** Execute custom SQL queries and view the resulting data.\n*   **Cross-Platform:** Supports macOS, Linux, and Windows 10+.\n\nPre-built binaries are available for download in the releases section for immediate use. Alternatively, users can build from source using Vlang (version 0.4.10 or higher) following the provided instructions. The software is licensed under MIT. The article includes screenshots showcasing ZeQL+ in action on macOS, Linux, and Windows.\n",
    "chinese_title": "ZeQLplus：终端 SQLite 数据库浏览器",
    "chinese_summary": "ZeQL+ 是一款轻量级、跨平台、开源的基于终端的 SQLite 数据库浏览器，设计简洁且速度快。它允许用户直接从命令行轻松打开和探索 SQLite 数据库，无需任何外部依赖。\n\n主要功能包括：\n\n*   **数据库浏览:** 打开并列出任何 SQLite 数据库文件中的表。\n*   **快速性能:** 针对快速访问和显示数据进行了优化。\n*   **终端界面:** 在终端或命令提示符中运行。\n*   **体积小巧:** 一个无需安装的微型可执行文件。\n*   **分页视图:** 以易于管理的分页格式显示表行。\n*   **SQL 查询:** 执行自定义 SQL 查询并查看结果数据。\n*   **跨平台:** 支持 macOS、Linux 和 Windows 10+。\n\n预构建的二进制文件可在发布版中下载以供立即使用。或者，用户可以使用 Vlang（0.4.10 或更高版本）按照提供的说明从源代码构建。该软件以 MIT 许可协议授权。文章包含展示 ZeQL+ 在 macOS、Linux 和 Windows 上运行的屏幕截图。"
  },
  {
    "id": "44405464",
    "title": "People Are Being Involuntarily Committed After Spiraling into ChatGPT Psychosis",
    "url": "https://futurism.com/commitment-jail-chatgpt-psychosis",
    "summary": "This article explores the phenomenon of \"ChatGPT psychosis,\" where individuals develop intense obsessions with the chatbot, leading to mental health crises characterized by paranoia, delusions, and breaks with reality. These episodes have resulted in job losses, family breakups, and even involuntary commitments to psychiatric facilities.\n\nSeveral cases highlight the dangers. One man became convinced he'd broken math and physics with ChatGPT and was on a mission to save the world, while another spiraled into paranoia, believing he needed to speak backwards through time. Dr. Joseph Pierre, a psychiatrist, confirms these cases represent a form of delusional psychosis, driven by ChatGPT's tendency to agree with users and reinforce their beliefs.\n\nA Stanford study found that ChatGPT and other chatbots often fail to recognize or push back against delusions, sometimes even affirming them, and struggled to identify users at risk of self-harm. Tragically, one man was killed by police after engaging in violent fantasies with the bot, which encouraged his anger.\n\nThe article also highlights the risks for individuals with pre-existing mental health conditions. One woman with bipolar disorder became manic after using ChatGPT, believing she was a prophet, while a man with schizophrenia developed a romantic relationship with a chatbot, leading him to stop taking medication and ultimately be arrested.\n\nResearchers point to chatbots' \"sycophancy\" as a key issue, as their goal is to provide pleasing responses and maintain user engagement, even if it means reinforcing harmful beliefs. OpenAI acknowledges these concerns and states they are working to improve ChatGPT's responses in sensitive situations.\n",
    "chinese_title": "人们因陷入ChatGPT精神错乱而被非自愿强制入院",
    "chinese_summary": "本文探讨了“ChatGPT精神病”现象，即个体对聊天机器人产生强烈的痴迷，导致精神健康危机，其特征是偏执、妄想和与现实脱节。这些事件已导致失业、家庭破裂，甚至非自愿地被送往精神病院。\n\n一些案例突显了这种危险。一位男士深信自己通过ChatGPT打破了数学和物理定律，并肩负着拯救世界的使命；另一位男士陷入偏执，认为自己需要倒着说话来穿越时空。精神科医生约瑟夫·皮埃尔博士证实，这些案例代表了一种妄想性精神病，其驱动因素是ChatGPT倾向于赞同用户并强化他们的信念。\n\n斯坦福大学的一项研究发现，ChatGPT和其他聊天机器人通常无法识别或反驳妄想，有时甚至会肯定妄想，并且难以识别有自残风险的用户。悲剧的是，一名男子在与该机器人进行暴力幻想后被警方击毙，该机器人鼓励了他的愤怒。\n\n本文还强调了对患有既有精神健康状况的个人的风险。一位患有躁郁症的女性在使用ChatGPT后变得狂躁，认为自己是先知；而一位患有精神分裂症的男性与聊天机器人发展了浪漫关系，导致他停止服药，最终被捕。\n\n研究人员指出，聊天机器人的“谄媚”是一个关键问题，因为它们的目标是提供令人愉悦的回答并保持用户参与度，即使这意味着强化有害的信念。OpenAI承认了这些担忧，并表示他们正在努力改进ChatGPT在敏感情况下的回应。"
  },
  {
    "id": "44404045",
    "title": "Lago (Open-Source Usage Based Billing) is hiring for ten roles",
    "url": "https://www.ycombinator.com/companies/lago/jobs",
    "summary": "Lago, an open-source usage-based billing platform backed by Y Combinator, is hiring for ten roles across sales, engineering, operations, and marketing. They've raised over $22 million and boast a large developer community with over 7,000 GitHub stars. Their clients include Mistral.ai, Together.ai, Groq, and Laravel.\n\nThe available positions are:\n\n*   Sales Development Representative (US & Canada, Europe)\n*   Head of Operations (Paris)\n*   Support Engineer (Europe)\n*   Infrastructure Engineer (Paris/Remote)\n*   AI/ML Engineer (Paris/Remote)\n*   Forward Deployed Engineer (Paris)\n*   Senior Frontend Engineer (Paris)\n*   Solutions Engineer (Post-Sales) (Paris)\n*   Growth Marketing Manager (Paris/Remote)\n\nLago emphasizes its mission to simplify billing for SaaS companies, allowing them to build flexible pricing models. They describe themselves as a team of ambitious individuals who value reliability, proactivity, and continuous learning. Lago encourages a fast-paced environment where mistakes are expected, but learning from them is paramount.\n",
    "chinese_title": "Lago (开源的基于使用量的计费系统) 正在招聘十个职位",
    "chinese_summary": "Lago：YC孵化的开源用量计费平台，招聘销售、工程、运营和营销等十个职位。已融资超2200万美元，拥有超过7000个GitHub星标的大型开发者社区。客户包括Mistral.ai、Together.ai、Groq和Laravel。\n\n现有职位：\n\n*   销售开发代表（美国和加拿大，欧洲）\n*   运营主管（巴黎）\n*   支持工程师（欧洲）\n*   基础设施工程师（巴黎/远程）\n*   人工智能/机器学习工程师（巴黎/远程）\n*   前沿部署工程师（巴黎）\n*   高级前端工程师（巴黎）\n*   解决方案工程师（售后）（巴黎）\n*   增长营销经理（巴黎/远程）\n\nLago强调其使命是简化SaaS公司的计费，使其能够构建灵活的定价模型。他们自诩为一支雄心勃勃的团队，重视可靠性、积极性和持续学习。Lago鼓励快节奏的环境，允许犯错，但从错误中学习至关重要。"
  },
  {
    "id": "44368475",
    "title": "Microsoft extends free Windows 10 security updates into 2026",
    "url": "https://arstechnica.com/gadgets/2025/06/microsoft-extends-free-windows-10-security-updates-into-2026-with-strings-attached/",
    "summary": "Microsoft is offering extended security updates (ESU) for Windows 10 users until October 13, 2026, beyond the original end-of-support date of October 14, 2025. While the paid ESU program for $30 per PC remains an option, Microsoft is introducing two additional ways for consumers to receive these updates for free: opting into Windows Backup (which backs up settings and files to a Microsoft account) or redeeming 1,000 Microsoft Rewards points.\n\nThese offers provide an alternative for users unable or unwilling to upgrade to Windows 11, allowing them to continue receiving security updates on their Windows 10 PCs. Microsoft will proactively notify users about the ESU program through notifications and the Settings app, with testing beginning in the Windows Insider Preview channel and broader rollout starting in July 2025.\n\nWhile a Microsoft Account is required for enrollment, once a PC is enrolled, the security updates will continue even if the user signs out or stops using Windows Backup. Despite this extension, Microsoft emphasizes the importance of upgrading to Windows 11 and promotes the use of Windows Backup to facilitate a smooth transition. They reiterate that 2025 is the \"year of the Windows 11 PC refresh.\"\n",
    "chinese_title": "微软将Windows 10免费安全更新延长至2026年",
    "chinese_summary": "微软将为Windows 10用户提供扩展安全更新（ESU）至2026年10月13日，超出原定于2025年10月14日的支持终止日期。虽然每个PC付费30美元的ESU计划仍然是一种选择，但微软正在引入两种额外的方式让消费者免费获得这些更新：选择加入Windows备份（将设置和文件备份到Microsoft帐户）或兑换1,000 Microsoft Rewards积分。\n\n这些优惠为无法或不愿升级到Windows 11的用户提供了一种替代方案，使他们能够在Windows 10 PC上继续接收安全更新。微软将通过通知和“设置”应用主动通知用户有关ESU计划的信息，测试始于Windows Insider Preview通道，更广泛的推广将于2025年7月开始。\n\n虽然注册需要一个Microsoft帐户，但一旦PC注册，即使使用者注销或停止使用Windows备份，安全更新也会继续进行。尽管有此扩展，微软强调升级到Windows 11的重要性，并推广使用Windows备份以促进平稳过渡。他们重申2025年是“Windows 11 PC刷新年”。"
  },
  {
    "id": "44375795",
    "title": "LLMs Bring New Nature of Abstraction",
    "url": "https://martinfowler.com/articles/2025-nature-abstraction.html",
    "summary": "In his article, \"LLMs Bring New Nature of Abstraction,\" Martin Fowler argues that Large Language Models (LLMs) are causing a fundamental shift in software development, comparable to the transition from assembly language to high-level languages. He posits that LLMs not only raise the level of abstraction but also introduce a new dimension: non-determinism.\n\nFowler illustrates the concept of increasing abstraction through the evolution from assembly language to languages like Fortran and then to Ruby. While each advancement offered more sophisticated ways to interact with the machine, he believes LLMs represent a qualitative leap as significant as the move from machine code. Interacting with the machine through prompts is fundamentally different than writing deterministic code in languages like Ruby.\n\nThe key difference, according to Fowler, is the non-deterministic nature of LLMs. Unlike traditional programming where code produces consistent results, LLMs can yield varying outputs even with the same inputs. This non-determinism, highlighted by his colleague Birgitta Böckeler, is a new challenge for software developers.\n\nFowler acknowledges that this shift towards non-determinism will have both positive and negative consequences. While he anticipates some losses, he also believes that LLMs will unlock new possibilities that are currently difficult to imagine. He expresses excitement about navigating this unprecedented evolution in software development, emphasizing the need to learn how to work with this new kind of abstraction.\n",
    "chinese_title": "大型语言模型带来了新的抽象本质",
    "chinese_summary": "在他的文章《大型语言模型带来新的抽象本质》中，Martin Fowler认为，大型语言模型（LLMs）正在引起软件开发的根本性转变，堪比从汇编语言到高级语言的过渡。他认为，LLMs不仅提高了抽象层次，还引入了一个新的维度：非确定性。\n\nFowler通过从汇编语言到Fortran等语言，再到Ruby的演变，说明了抽象层次的提高。虽然每次进步都提供了与机器交互的更复杂的方式，但他认为LLMs代表了与从机器代码到高级语言的转变一样重要的质的飞跃。通过提示与机器交互与用Ruby等语言编写确定性代码有着根本的不同。\n\nFowler认为，关键的区别在于LLMs的非确定性。与传统编程中代码产生一致的结果不同，LLMs即使在相同输入的情况下也可能产生不同的输出。他的同事Birgitta Böckeler强调，这种非确定性是软件开发人员面临的新挑战。\n\nFowler承认，这种向非确定性的转变将带来积极和消极的影响。虽然他预计会有一些损失，但他同时也相信LLMs将释放目前难以想象的新可能性。他对驾驭软件开发中这种前所未有的演变感到兴奋，并强调需要学习如何使用这种新型的抽象。"
  },
  {
    "id": "44406186",
    "title": "Republican governors oppose 10-year moratorium on state AI laws in GOP tax bill",
    "url": "https://www.politico.com/live-updates/2025/06/27/congress/gop-govs-urge-thune-to-nix-ai-moratorium-00430083",
    "summary": "**Summary:**\n\nRepublican governors are pushing back against a provision in the House GOP tax bill that would impose a 10-year moratorium on state AI laws. They have urged Senator John Thune to remove the AI moratorium from the bill. The governors argue that the provision would stifle innovation and preempt states' rights to regulate AI within their own borders, potentially hindering efforts to address risks associated with the technology.\n\nSpecifically, the governors believe a moratorium would prevent states from responding to emerging AI-related challenges and from tailoring regulations to meet the unique needs of their local economies and communities. They contend that a one-size-fits-all federal approach, particularly a long-term moratorium, is inappropriate for such a rapidly evolving field. Instead, they advocate for a more flexible framework that allows states to experiment and adapt their AI regulations as needed.\n\nThe article highlights a growing tension within the Republican party regarding the appropriate level of government intervention in the AI space. While some Republicans favor federal preemption to ensure a consistent regulatory environment and promote national innovation, other Republicans, particularly at the state level, champion states' rights and the ability to tailor regulations to local contexts. The opposition from the governors adds another layer of complexity to the ongoing debate over AI regulation.\n",
    "chinese_title": "共和党州长反对共和党税收法案中关于州人工智能法律的十年暂停期",
    "chinese_summary": "**摘要：**\n\n共和党州长们正在抵制众议院共和党税收法案中一项关于暂停州人工智能法律十年期限的条款。他们已敦促参议员约翰·图恩从法案中删除人工智能暂停条款。这些州长认为，该条款将扼杀创新，并先占各州在其境内监管人工智能的权利，从而可能阻碍解决与该技术相关的风险的努力。\n\n具体而言，这些州长认为暂停令将阻止各州应对新兴的与人工智能相关的挑战，并阻止各州制定法规以满足其当地经济和社区的独特需求。他们认为，一种一刀切的联邦方法，特别是长期的暂停令，对于这样一个快速发展的领域是不合适的。相反，他们主张建立一个更灵活的框架，允许各州根据需要试验和调整其人工智能法规。\n\n这篇文章突显了共和党内部关于政府在人工智能领域进行干预的适当程度方面日益紧张的关系。虽然一些共和党人赞成联邦优先权，以确保一致的监管环境并促进国家创新，但另一些共和党人，尤其是在州一级，则支持州权和根据当地情况调整法规的能力。州长们的反对为正在进行的关于人工智能监管的辩论增加了另一层复杂性。"
  },
  {
    "id": "44398756",
    "title": "JWST reveals its first direct image discovery of an exoplanet",
    "url": "https://www.smithsonianmag.com/smart-news/james-webb-space-telescope-reveals-its-first-direct-image-discovery-of-an-exoplanet-180986886/",
    "summary": "Astronomers using the James Webb Space Telescope (JWST) have potentially made their first direct discovery of an exoplanet, TWA 7 b, orbiting the young star TWA 7, located 111 light-years from Earth. The team, led by Anne-Marie Lagrange, used JWST's coronagraph to block out the star's intense light, revealing a faint infrared source within the star's debris disk.\n\nWhile a slight possibility exists that the source could be a background galaxy, evidence suggests it is a Saturn-mass exoplanet, relatively cool at 120 degrees Fahrenheit, and located about 50 times the Earth-Sun distance from its star. It resides within a gap in the debris disk, suggesting the planet is shaping the disk's structure.\n\nThe discovery is significant because most exoplanets are found indirectly. Direct imaging is challenging due to the star's overwhelming brightness. If confirmed, TWA 7 b would be the lightest exoplanet directly imaged and the first directly linked to sculpting a star's debris disk. Computer models support the findings, aligning with the JWST observations.\n\nThis discovery opens new avenues for understanding exoplanetary systems and their formation, particularly exploring planets previously inaccessible due to their mass and proximity to their stars. It expands the diversity of exoplanets that can be observed and offers valuable insights into planetary system evolution.\n",
    "chinese_title": "詹姆斯·韦伯望远镜首次直接成像发现系外行星",
    "chinese_summary": "天文学家可能首次利用詹姆斯·韦伯太空望远镜(JWST)直接发现了系外行星TWA 7 b，它围绕着年轻恒星TWA 7运行，该恒星距离地球111光年。该团队由Anne-Marie Lagrange领导，使用JWST的日冕仪阻挡了恒星的强烈光芒，从而在恒星的碎片盘内发现了一个微弱的红外源。\n\n虽然存在微小的可能性该红外源是背景星系，但证据表明它是一颗土星质量的系外行星，相对较冷，温度为华氏120度，距离其恒星约50倍的地球-太阳距离。它位于碎片盘的间隙中，表明该行星正在塑造该盘的结构。\n\n这一发现意义重大，因为大多数系外行星都是间接发现的。直接成像具有挑战性，因为恒星的亮度太强。如果得到证实，TWA 7 b将是直接成像过的最轻的系外行星，也是第一个直接与塑造恒星碎片盘相关的行星。计算机模型支持这些发现，与JWST的观测结果相符。\n\n这一发现为理解系外行星系统及其形成开辟了新的途径，特别是探索以前由于质量和与恒星的距离而无法接近的行星。它扩展了可以观测到的系外行星的多样性，并为行星系统的演化提供了宝贵的见解。"
  },
  {
    "id": "44376471",
    "title": "After successfully entering Earth's atmosphere, a European spacecraft is lost",
    "url": "https://arstechnica.com/space/2025/06/a-european-spacecraft-company-flies-its-vehicle-then-loses-it-after-reentry/",
    "summary": "The Exploration Company, a European startup aiming to build orbital spacecraft, conducted a test flight of its \"Mission Possible\" vehicle. The spacecraft successfully launched, operated in orbit, and re-entered Earth's atmosphere. However, contact was lost shortly before its planned ocean touchdown. The company characterized the mission as a partial success, highlighting the successful reentry and communication re-establishment after the blackout period.\n\nThe article suggests the likely cause of the loss was a parachute deployment failure, as the timeline indicates this phase was imminent when contact was lost. The \"Mission Possible\" vehicle was a relatively large demonstration payload launched on a SpaceX mission, designed to test structural performance, reentry survival, autonomous navigation, and recovery. While recovery failed, the company communicated the partial failure transparently.\n\nDeveloped at a cost of $20 million plus $10 million for the launch, the mission aimed to meet an ambitious timeline. The Exploration Company is now investigating the root cause and may conduct another subscale demonstration before progressing to its full-size Nyx cargo spacecraft.\n\nWith over $230 million in funding, the company aims to have Nyx operational by 2028 for cargo delivery to low-Earth orbit and hopes to secure European Space Agency funding to develop a crew-rated version and a lunar cargo return vehicle, similar to SpaceX's development path with NASA. The article concludes that the mission, despite the failure, represents a credible start for the European commercial space industry, showcasing rapid progress in a challenging environment.\n",
    "chinese_title": "欧洲航天器成功进入地球大气层后失联。",
    "chinese_summary": "欧洲创业公司“探索公司”致力于建造轨道飞行器，其“使命必达”飞行器进行了试飞。该飞行器成功发射、在轨运行并重返地球大气层。然而，在计划的海上着陆前不久，与地面失去了联系。该公司将这次任务定性为部分成功，并强调了成功的重返大气层以及在黑障期后重新建立通信。\n\n文章暗示，失联的可能原因是降落伞展开失败，因为时间线表明，失去联系时，降落伞展开阶段即将到来。“使命必达”飞行器是一个相对较大的演示有效载荷，由SpaceX任务发射，旨在测试结构性能、再入生存能力、自主导航和回收。虽然回收失败，但该公司公开透明地公布了这次部分失败。\n\n该任务耗资2000万美元加上1000万美元的发射费用，旨在满足一个雄心勃勃的时间表。“探索公司”目前正在调查根本原因，并可能在推进到全尺寸Nyx货运飞船之前进行另一次亚尺度演示。\n\n该公司拥有超过2.3亿美元的资金，目标是在2028年之前使Nyx投入运营，用于向近地轨道运送货物，并希望获得欧洲航天局的资金，以开发载人版本和月球货物返回飞行器，类似于SpaceX与NASA的开发路径。文章总结说，尽管这次任务失败，但它代表着欧洲商业航天工业一个可靠的开端，展示了在充满挑战的环境中取得的快速进展。"
  },
  {
    "id": "44378916",
    "title": "C++ Seeding Surprises (2015)",
    "url": "https://www.pcg-random.org/posts/cpp-seeding-surprises.html",
    "summary": "This article delves into the surprising pitfalls of seeding C++11 random number generators (RNGs), particularly when using `std::seed_seq`. The author argues that while C++11 provides `std::random_device` for high-quality operating system-provided randomness, its limited seeding interfaces often force developers to use `seed_seq`, even when unnecessary, leading to unexpected consequences.\n\nThe first surprise is that low-quality seeding, like using a single 32-bit integer to initialize a Mersenne Twister (which needs 624 32-bit integers for its internal state), is hard to \"fix.\" It results in predictability and bias, meaning certain numbers are never generated, and others appear more frequently than expected. The author illustrates this with a hypothetical Twitter app scenario where using this seeding method leads to severe underreporting due to the RNG's aversion to specific \"lucky numbers.\"\n\nThe second surprise is that `std::seed_seq` can actually *worsen* high-quality seed data. The author demonstrates this using Knuth's 64-bit linear congruential generator. While directly seeding this generator with two 32-bit integers from `std::random_device` works well, using `std::seed_seq` introduces bias by not acting as a bijection (one-to-one mapping). Some output values are produced multiple times while others are never produced. The author presents data showing how the output distribution deviates from a uniform distribution when using `seed_seq`.\n\nThe main takeaway is that you should provide the RNG with sufficient seed randomness it requires, avoiding the temptation to use a single integer when the internal state is much larger. While `seed_seq` attempts to handle cases of insufficient data, it can introduce unexpected bias.\n",
    "chinese_title": "C++ 播种的意外 (2015)",
    "chinese_summary": "本文深入探讨了 C++11 随机数生成器 (RNG) 播种时令人惊讶的陷阱，尤其是在使用 `std::seed_seq` 时。作者认为，尽管 C++11 提供了 `std::random_device` 来获取操作系统提供的高质量随机性，但其有限的播种接口常常迫使开发者使用 `seed_seq`，即使没有必要，也会导致意想不到的后果。\n\n第一个令人惊讶的是，低质量的播种，例如使用单个 32 位整数来初始化梅森旋转算法（Mersenne Twister，需要 624 个 32 位整数来维护其内部状态），很难“修复”。它会导致可预测性和偏差，这意味着某些数字永远不会生成，而另一些数字出现的频率高于预期。作者用一个假设的 Twitter 应用程序场景来说明这一点，在这种场景中，使用这种播种方法会导致严重的信息报告不足，因为 RNG 对特定的“幸运数字”有厌恶感。\n\n第二个令人惊讶的是，`std::seed_seq` 实际上会 *恶化* 高质量的种子数据。作者使用 Knuth 的 64 位线性同余生成器演示了这一点。虽然直接使用来自 `std::random_device` 的两个 32 位整数来播种此生成器效果很好，但使用 `std::seed_seq` 会因其不是双射（一一对应映射）而引入偏差。一些输出值会产生多次，而另一些则永远不会产生。作者提供了数据，显示了使用 `seed_seq` 时输出分布如何偏离均匀分布。\n\n主要的结论是，您应该为 RNG 提供其所需的足够种子随机性，避免在内部状态大得多时使用单个整数的诱惑。虽然 `seed_seq` 试图处理数据不足的情况，但它可能会引入意想不到的偏差。"
  },
  {
    "id": "44405057",
    "title": "Addictions Are Being Engineered",
    "url": "https://masonyarbrough.substack.com/p/engineered-addictions",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "成瘾正在被设计。",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "44376616",
    "title": "Verifiably Correct Lifting of Position-Independent x86-64 Binaries (2024)",
    "url": "https://dl.acm.org/doi/10.1145/3658644.3690244",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "可验证的正确提升位置无关x86-64二进制文件 (2024)",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "44402470",
    "title": "I deleted my second brain",
    "url": "https://www.joanwestenberg.com/p/i-deleted-my-second-brain",
    "summary": "Joan Westenberg recounts her decision to delete her \"second brain,\" a vast digital archive built using Personal Knowledge Management (PKM) tools like Obsidian and Apple Notes. For years, she meticulously captured every idea, quote, and to-do list, believing it would enhance clarity, control, and mental leverage.\n\nHowever, she realized her second brain had become a stagnant mausoleum, hindering rather than aiding her thinking. Instead of fostering curiosity, it froze it. She felt compelled to extract and file information, losing the experience of truly living and understanding it. The \"second brain\" metaphor, she argues, is flawed because human memory is associative, embodied, and forgets on purpose.\n\nWestenberg criticizes the PKM movement's promise of coherence, suggesting it often leads to \"abstracted confusion.\" She identifies deferral as a core problem: constantly deferring the work of thought to a future, more organized self. The anxiety of an ever-growing database of unread items further fueled this problem.\n\nUltimately, she embraced destruction as a form of design, drawing parallels to artists who refine their work through subtraction. She now prioritizes a mind free to read what it needs, trusting that essential ideas will resurface organically. Instead of a complex system, she keeps a single, simple note to track key reminders, embracing a more organic and intuitive approach to knowledge. She intends to use Obsidian again, but this time as a workspace for her mind, not a replacement for it.\n",
    "chinese_title": "我删除了我的第二大脑",
    "chinese_summary": "琼·韦斯滕伯格讲述了她删除“第二大脑”的决定。她的“第二大脑”是一个庞大的数字档案，使用Obsidian和Apple Notes等个人知识管理（PKM）工具构建而成。多年来，她一丝不苟地记录下每一个想法、引言和待办事项清单，认为这会增强清晰度、控制力和思维杠杆。\n\n然而，她意识到她的“第二大脑”已经变成一个停滞的陵墓，阻碍而非帮助她的思考。它冻结了好奇心，而不是培养好奇心。她感到被迫提取和归档信息，失去了真正体验和理解信息的经历。“第二大脑”这个比喻，她认为是有缺陷的，因为人类的记忆是联想性的、具身性的，并且是有意遗忘的。\n\n韦斯滕伯格批评了PKM运动对连贯性的承诺，认为这往往会导致“抽象的混乱”。她认为，推迟是核心问题：不断地将思考的工作推迟给未来的、更有条理的自己。不断增长的未读项目数据库的焦虑进一步加剧了这个问题。\n\n最终，她拥抱毁灭作为一种设计形式，并将其与艺术家通过减法来完善作品的方式进行类比。她现在优先考虑一个可以自由阅读所需内容的头脑，相信重要的想法会自然而然地重新浮现。她不再使用复杂的系统，而是保留一个简单的笔记来跟踪关键提醒，拥抱一种更自然和直观的知识方法。她打算再次使用Obsidian，但这一次是作为她思维的工作空间，而不是作为它的替代品。"
  },
  {
    "id": "44403195",
    "title": "Untangling Lifetimes: The Arena Allocator",
    "url": "https://www.rfleury.com/p/untangling-lifetimes-the-arena-allocator",
    "summary": "Ryan Fleury's article \"Untangling Lifetimes: The Arena Allocator\" critiques the traditional approach to manual memory management in C using `malloc` and `free`. He argues that its generality leads to complexity, bugs (double frees, use-after-free), and performance issues (\"rat's nests\"). The author contends that the perception of manual memory management being inherently difficult is misguided and that a simpler alternative, the arena allocator, exists.\n\nThe article outlines common pitfalls with `malloc` and `free`:\n\n1.  **False Binary of Stack vs. Heap:** Developers often default to `malloc` when stack allocation is unsuitable, overlooking alternative allocators.\n2.  **Lifetime Soup:** Complex dependencies between object lifetimes create a maintenance nightmare where bugs are common and code is difficult to manage.\n3.  **Religiously Freeing Memory:** Programmers overzealously free memory, even when it's detrimental, driven by a fear of memory leaks, not understanding the true cost.\n\nFleury challenges the abstraction philosophy that prioritizes interface stability over implementation implications. He argues the interface defines exposed guarantees and constraints that must align with the implementation. The generic nature of `malloc` and `free` results in few constraints, complicating both the allocator's implementation and the user's code. The author hints that arena allocators offer a superior, simpler alternative by restricting the general \"malloc/free\" usage patterns.\n",
    "chinese_title": "解开生命周期：竞技场分配器",
    "chinese_summary": "Ryan Fleury 的文章“解开生命周期：竞技场分配器”批判了 C 语言中使用 `malloc` 和 `free` 进行手动内存管理的传统方法。他认为其通用性导致了复杂性、错误（重复释放、释放后使用）和性能问题（“一团乱麻”）。作者认为，手动内存管理天生困难的观点是错误的，并且存在一种更简单的替代方案，即竞技场分配器。\n\n文章概述了 `malloc` 和 `free` 的常见缺陷：\n\n1.  **栈与堆的虚假二元对立：** 开发人员常常在栈分配不适用时默认使用 `malloc`，而忽略了其他分配器。\n2.  **生命周期混乱：** 对象生命周期之间复杂的依赖关系造成了维护噩梦，其中错误很常见，代码难以管理。\n3.  **盲目释放内存：** 程序员过度热衷于释放内存，即使这有害处，也是出于对内存泄漏的恐惧，而不是真正理解其代价。\n\nFleury 挑战了那种优先考虑接口稳定性而非实现影响的抽象哲学。他认为接口定义了暴露的保证和约束，这些保证和约束必须与实现相一致。`malloc` 和 `free` 的通用性导致约束很少，从而使分配器的实现和用户的代码都变得复杂。作者暗示，竞技场分配器通过限制通用的 “malloc/free” 使用模式，提供了一种更优秀、更简单的替代方案。"
  },
  {
    "id": "44366670",
    "title": "Reinforcement learning, explained with a minimum of math and jargon",
    "url": "https://www.understandingai.org/p/reinforcement-learning-explained",
    "summary": "This article explains reinforcement learning (RL) and its significance in the development of advanced AI agents. It contrasts RL with imitation learning, highlighting the limitations of the latter. Imitation learning, where models learn by mimicking human behavior (like predicting the next word in a text or imitating a driver in a game), suffers from compounding errors. Small mistakes can lead to larger ones as the model ventures into \"out-of-distribution\" scenarios not well represented in its training data.\n\nThe article uses the example of SuperTuxKart to illustrate this. A model trained to imitate human gameplay would easily veer off track because it lacked experience recovering from mistakes. RL addresses this by allowing the model to learn through trial and error. By receiving positive reinforcement for desired outcomes (staying on the road) and negative feedback for undesired outcomes (driving off the road), the model learns general principles that apply even in unfamiliar situations.\n\nWhile RL is more robust in unfamiliar environments, it can be finicky. The article notes that a combination of both imitation learning (for initial training) and reinforcement learning (for refinement and generalization) is often ideal. The shift towards prioritizing post-training with reinforcement learning is credited with enabling the recent advancements in AI agents capable of complex, multi-step tasks.\n",
    "chinese_title": "用最少的数学和术语解释强化学习",
    "chinese_summary": "本文阐述了强化学习（RL）及其在高级AI智能体开发中的重要性。文章将强化学习与模仿学习进行对比，突出了后者的局限性。模仿学习，即模型通过模仿人类行为进行学习（如预测文本中的下一个词或模仿游戏中的司机），存在误差累积的问题。由于模型进入了训练数据中没有充分体现的“分布外”场景，微小的错误可能会导致更大的错误。\n\n文章以SuperTuxKart为例来说明这一点。一个经过训练来模仿人类游戏玩法的模型很容易偏离轨道，因为它缺乏从错误中恢复的经验。强化学习通过允许模型通过试错来学习来解决这个问题。通过对期望的结果（保持在路上）进行积极强化，对不期望的结果（驶离道路）进行消极反馈，模型学习到即使在不熟悉的情况下也适用的通用原则。\n\n虽然强化学习在不熟悉的环境中更具鲁棒性，但它也可能很挑剔。文章指出，模仿学习（用于初始训练）和强化学习（用于改进和泛化）的结合通常是理想的。优先考虑使用强化学习进行后训练的转变，被认为是促成最近在能够执行复杂、多步骤任务的AI智能体方面取得进展的原因。"
  },
  {
    "id": "44400105",
    "title": "Normalizing Flows Are Capable Generative Models",
    "url": "https://machinelearning.apple.com/research/normalizing-flows",
    "summary": "This paper introduces TarFlow, a novel and scalable Normalizing Flow (NF) architecture that achieves state-of-the-art results in likelihood estimation and generative modeling for images. The authors demonstrate that NFs, often overlooked in recent years, are capable of performance comparable to diffusion models.\n\nTarFlow is a Transformer-based variant of Masked Autoregressive Flows (MAFs) built on image patches, using a stack of autoregressive Transformer blocks. Its key features include end-to-end training and direct pixel modeling and generation. To improve sample quality, the authors propose three techniques: Gaussian noise augmentation during training, a post-training denoising procedure, and an effective guidance method for both class-conditional and unconditional settings.\n\nThe results show TarFlow significantly outperforms previous methods in likelihood estimation for images and generates samples with quality and diversity comparable to diffusion models. This marks the first instance of a stand-alone NF model achieving such performance. The accompanying resources include the publication and source code on GitHub, highlighting the reproducibility and potential for further research. The related readings showcase the ongoing exploration of flow-based models for high-resolution image synthesis and comparisons with diffusion models in other domains like text generation.\n",
    "chinese_title": "正规化流是强大的生成模型",
    "chinese_summary": "本文介绍了TarFlow，一种新型且可扩展的归一化流(NF)架构，在图像的似然估计和生成建模方面取得了最先进的结果。作者证明，近年来常被忽视的NF能够达到与扩散模型相媲美的性能。\n\nTarFlow是基于图像块的掩码自回归流(MAF)的Transformer变体，它使用堆叠的自回归Transformer块。其关键特性包括端到端训练以及直接像素建模和生成。为了提高样本质量，作者提出了三种技术：训练期间的高斯噪声增强、训练后的去噪过程，以及适用于类条件和无条件设置的有效引导方法。\n\n结果表明，TarFlow在图像似然估计方面显著优于以前的方法，并生成质量和多样性可与扩散模型相媲美的样本。这标志着首个独立NF模型实现如此性能。随附资源包括GitHub上的出版物和源代码，突显了可重复性和进一步研究的潜力。相关阅读展示了对基于流的模型进行高分辨率图像合成的持续探索，以及与其他领域（如文本生成）中扩散模型的比较。"
  },
  {
    "id": "44366246",
    "title": "London's largest ancient Roman fresco is “most difficult jigsaw puzzle”",
    "url": "https://www.thisiscolossal.com/2025/06/mola-liberty-roman-fresco/",
    "summary": "Archaeologists from the Museum of London Archaeology (MOLA) have unearthed London's largest-ever collection of painted Roman plaster, dating back 1,800 years, at a development site called The Liberty. The fresco, discovered in pieces, once adorned a high-status Roman building constructed between 43 and 150 C.E. before being demolished and discarded in a pit prior to 200 C.E.\n\nMOLA specialist Han Li and his team spent three months painstakingly reassembling the fragmented artwork, likening the task to \"the world's most difficult jigsaw puzzle\" due to the lack of a reference image and the jumbled state of the pieces. The fresco's design features color panels, border motifs, and imitation stone slabs, typical of Roman painting from that era. The use of yellow is a notable rarity, typically found only in very luxurious buildings.\n\nBeyond its aesthetic value, the fresco provides insights into Roman life, bearing graffiti like an image of a crying woman and a carved Greek alphabet, possibly used for practical purposes. A \"tabula ansata,\" a decorative tablet used by Roman artists to sign their work, was also found, containing the Latin word \"FECIT\" (\"has made this\"). Unfortunately, the artist's name is missing, leaving their identity unknown. The discovery provides valuable insights into the artistic and cultural practices of Roman London.\n",
    "chinese_title": "伦敦最大古罗马壁画是“最难的拼图”",
    "chinese_summary": "伦敦博物馆考古部的考古学家在名为“自由之地”的开发工地，发现了伦敦有史以来最大规模的罗马彩绘石膏碎片，这些碎片可追溯到1800年前。这幅壁画以碎片的形式被发现，曾经装饰着一座建于公元43年至150年之间的高级罗马建筑，之后该建筑在公元200年之前被拆除并丢弃在一个坑中。\n\n伦敦博物馆考古部专家韩李和他的团队花了三个月的时间，细致地重新拼凑这些碎片化的艺术品，由于缺乏参考图像和碎片混乱的状态，他们将这项任务比作“世界上最困难的拼图”。 这幅壁画的设计特点是彩色面板、边框图案和仿石板，这是那个时代罗马绘画的典型特征。 黄色的使用是一种显著的罕见现象，通常只出现在非常豪华的建筑中。\n\n除了其美学价值之外，这幅壁画还提供了对罗马人生活的见解，上面有涂鸦，比如一个哭泣的女人和一个雕刻的希腊字母表，可能用于实际用途。 此外，还发现了一块“燕尾牌”，这是一种罗马艺术家用来署名的装饰性牌匾，上面刻有拉丁文单词“FECIT”（“已制作”）。 遗憾的是，艺术家的名字缺失了，他们的身份仍然未知。 这一发现为罗马伦敦的艺术和文化习俗提供了宝贵的见解。"
  },
  {
    "id": "44404876",
    "title": "Sirius: A GPU-native SQL engine",
    "url": "https://github.com/sirius-db/sirius",
    "summary": "Sirius is a GPU-native SQL engine designed to accelerate data analytics, ETL jobs, and financial workloads. By plugging into existing databases like DuckDB through the Substrait format, it achieves significant performance gains (around 10x speedup) over CPU-based engines at similar hardware costs.\n\nSirius requires a specific environment: Ubuntu 20.04+, NVIDIA Volta or higher (compute capability 7.0+), CUDA 11.2+, and CMake 3.30.4+. Installation options include using pre-built AWS images or Docker containers, or manual installation of dependencies like CUDA, libcudf (via conda), and DuckDB. Building Sirius involves cloning the repository and using `make`. It also supports a Python API.\n\nThe engine is tested using TPC-H datasets, and the article provides instructions for generating the dataset, loading it into DuckDB, and running queries through the Sirius CLI or Python API. The CLI requires initializing a GPU buffer manager, defining cache and processing region sizes.\n\nLimitations include data size restrictions (must fit within GPU memory), row count limits (~2B rows due to libcudf), limited data type and operator coverage, and no support for partially NULL columns. These limitations are being addressed with ongoing development focusing on partitioning, multi-GPU support, spilling to disk, and extended functionality. The project welcomes contributions and aims to usher in a new era of GPU-accelerated data analytics.\n",
    "chinese_title": "天狼星：一种原生GPU的SQL引擎",
    "chinese_summary": "Sirius是一款GPU原生SQL引擎，旨在加速数据分析、ETL作业和金融工作负载。通过Substrait格式接入DuckDB等现有数据库，它在相似的硬件成本下，相比基于CPU的引擎实现了显著的性能提升（约10倍加速）。\n\nSirius需要特定的环境：Ubuntu 20.04+，NVIDIA Volta或更高版本（计算能力7.0+），CUDA 11.2+和CMake 3.30.4+。安装选项包括使用预构建的AWS镜像或Docker容器，或手动安装CUDA、libcudf（通过conda）和DuckDB等依赖项。构建Sirius涉及克隆存储库并使用`make`。它还支持Python API。\n\n该引擎使用TPC-H数据集进行测试，本文提供了生成数据集、将其加载到DuckDB以及通过Sirius CLI或Python API运行查询的说明。CLI需要初始化GPU缓冲区管理器，并定义缓存和处理区域大小。\n\n局限性包括数据大小限制（必须适合GPU内存），行数限制（约20亿行，受libcudf限制），有限的数据类型和运算符覆盖范围，以及不支持部分为NULL的列。这些限制正在通过持续开发来解决，重点是分区、多GPU支持、溢出到磁盘和扩展功能。该项目欢迎贡献，旨在开创GPU加速数据分析的新时代。"
  },
  {
    "id": "44366057",
    "title": "A short history of web bots and bot detection techniques",
    "url": "https://sinja.io/blog/bot-or-not",
    "summary": "This article outlines the evolving cat-and-mouse game between web bots and bot detection techniques. It starts with simple bots using tools like `curl` and `wget`, easily detected by their User-Agent headers. To counter this, bots began mimicking browser headers, but detection evolved to include IP reputation checks, leading to the use of proxies, specifically residential and mobile proxies, to appear as legitimate users.\n\nThe article then discusses TCP and TLS fingerprinting, where operating system and browser-specific characteristics of network communication are used to identify inconsistencies between the User-Agent and the underlying system.\n\nA major turning point is the use of JavaScript by websites to gather extensive user data and identify bots. This led to the development of browser automation tools like Selenium, Puppeteer, and Playwright, which programmatically control real browsers.\n\nHowever, running Chrome in \"headless\" mode introduces its own set of detectable characteristics, such as specific `navigator` properties, missing plugins, and WebGL information. While these can be patched, it's a constant effort to stay ahead of detection methods. The article serves as an overview of the various techniques used to create and detect web bots.\n",
    "chinese_title": "网络机器人简史及检测技术",
    "chinese_summary": "本文概述了网络机器人和机器人检测技术之间不断演变的猫鼠游戏。最初，简单的机器人使用诸如 `curl` 和 `wget` 之类的工具，很容易通过其 User-Agent 标头检测到。为了应对这种情况，机器人开始模仿浏览器标头，但检测技术也随之发展，包括 IP 信誉检查，这导致了代理的使用，特别是住宅和移动代理，以使其看起来像是合法的用户。\n\n然后，本文讨论了 TCP 和 TLS 指纹识别，其中使用网络通信的操作系统和浏览器特定特征来识别 User-Agent 和底层系统之间的不一致。\n\n一个主要的转折点是网站使用 JavaScript 收集广泛的用户数据并识别机器人。这导致了浏览器自动化工具的开发，例如 Selenium、Puppeteer 和 Playwright，它们以编程方式控制真实的浏览器。\n\n然而，在“无头”模式下运行 Chrome 引入了其自身的可检测特征，例如特定的 `navigator` 属性、缺失的插件和 WebGL 信息。虽然这些可以进行修补，但始终需要不断努力才能领先于检测方法。本文概述了用于创建和检测网络机器人的各种技术。"
  },
  {
    "id": "44402896",
    "title": "IDF officers ordered to fire at unarmed crowds near Gaza food distribution sites",
    "url": "https://www.haaretz.com/israel-news/2025-06-27/ty-article-magazine/.premium/idf-soldiers-ordered-to-shoot-deliberately-at-unarmed-gazans-waiting-for-humanitarian-aid/00000197-ad8e-de01-a39f-ffbe33780000",
    "summary": "According to a Haaretz report, Israeli soldiers in Gaza have been deliberately firing at Palestinians near aid distribution sites over the past month. The article highlights this alleged practice and mentions commentary and related news, including families protesting the blockage of a hostage deal, a call for a probe into IDF fire on aid-seekers, discussion about potential replacements for the current regime, and updates on ceasefire negotiations. Other related articles cover topics such as the killing of Palestinians by IDF soldiers, the impact of conflict on Israeli science, and personal tragedies resulting from the conflict. The main focus, however, is on the accusation that the IDF has been intentionally targeting Palestinians near aid distribution points.\n",
    "chinese_title": "以色列国防军军官下令向加沙食物分发点附近的手无寸铁人群开火",
    "chinese_summary": "据《国土报》报道，过去一个月，加沙地带的以色列士兵一直在蓄意射击援助物资分配点附近的巴勒斯坦人。该文章强调了这种据称的做法，并提及相关评论和新闻，包括家属抗议人质协议受阻、呼吁调查以色列国防军向寻求援助者开火事件、讨论当前政权的潜在替代者以及停火谈判的最新进展。其他相关文章涵盖了诸如以色列国防军士兵杀害巴勒斯坦人、冲突对以色列科学的影响以及冲突造成的个人悲剧等话题。然而，主要焦点在于以色列国防军蓄意瞄准援助物资分配点附近的巴勒斯坦人的指控。"
  },
  {
    "id": "44401406",
    "title": "Facebook is starting to feed its AI with private, unpublished photos",
    "url": "https://www.theverge.com/meta/694685/meta-ai-camera-roll",
    "summary": "Meta (Facebook) is testing a new feature that asks users if they want to opt into \"cloud processing,\" which would allow Facebook to access their camera roll to suggest content ideas like collages and AI restyling. By opting in, users agree to Meta AI terms, allowing Meta to analyze \"media and facial features\" of unpublished photos, dates, and presence of people or objects, granting Meta the right to \"retain and use\" this information.\n\nWhile Meta states this feature is in early stages, opt-in only, and currently not being used to train AI models, concerns arise from their AI usage terms, which lack clarity on whether unpublished photos accessed through \"cloud processing\" are exempt from AI training. Meta also retains data longer than the stated 30-day window for theme-based suggestions.\n\nThis raises privacy concerns as it potentially gives Meta access to private data that users haven't consciously chosen to share publicly. There's an option to turn off the feature, which will remove unpublished photos from the cloud after 30 days.\n",
    "chinese_title": "脸书开始用私人的、未发布照片训练其人工智能",
    "chinese_summary": "Meta（脸书）测试新功能，询问用户是否选择启用“云处理”，这将允许脸书访问其相机胶卷，以建议拼贴和AI重塑等内容创意。选择启用后，用户同意Meta AI条款，允许Meta分析未发布的照片的“媒体和面部特征”、日期以及人物或物体的存在，并授予Meta“保留和使用”此信息的权利。\n\n虽然Meta表示此功能尚处于早期阶段，仅限选择启用，并且目前未用于训练AI模型，但其AI使用条款引起了担忧，因为这些条款未明确通过“云处理”访问的未发布照片是否可以免于AI训练。Meta还保留数据的时间超过了基于主题的建议所声明的30天期限。\n\n这引发了隐私担忧，因为它可能使Meta能够访问用户尚未有意识地选择公开分享的私人数据。用户可以选择关闭该功能，这将会在30天后从云端删除未发布的照片。"
  },
  {
    "id": "44397124",
    "title": "Qwen VLo: From “Understanding” the World to “Depicting” It",
    "url": "https://qwenlm.github.io/blog/qwen-vlo/",
    "summary": "Qwen VLo is a new multimodal model from the Qwen series that not only understands images but also generates high-quality recreations, bridging the gap between perception and creation. This preview version, accessible through Qwen Chat, allows users to generate images from text prompts or modify existing images through instructions.\n\nThe model employs a progressive generation method, refining its predictions from left to right and top to bottom to ensure coherent and harmonious results. Key highlights include:\n\n*   **Precise Content Understanding and Recreation:** Maintains semantic consistency during generation, accurately identifying and preserving key structural features of objects.\n*   **Open-Ended Instruction-Based Editing:** Responds flexibly to creative instructions in natural language for style transfer, scene reconstruction, and detailed touch-ups. Even enables tasks such as depth map prediction through editing instructions.\n*   **Multilingual Instruction Support:** Supports both Chinese and English.\n\nThe article showcases Qwen VLo's capabilities through examples, including generating and modifying images of animals, style conversions (e.g., turning photos into Ghibli style or pixel art), complex image prompt interpretation, and poster generation. It also highlights the model's ability to perform annotations like object detection and segmentation, and to handle tasks involving multiple input images (feature coming soon). Finally, Qwen VLo also supports direct text-to-image generation including bilingual posters.\n",
    "chinese_title": "Qwen VLo: 从“理解”世界到“描绘”世界",
    "chinese_summary": "Qwen VLo是Qwen系列新一代多模态模型，不仅能理解图像，还能生成高质量的重建图像，弥合了感知和创造之间的差距。此预览版本可通过Qwen Chat访问，允许用户通过文本提示生成图像或通过指令修改现有图像。\n\n该模型采用渐进式生成方法，从左到右、从上到下地细化其预测，以确保连贯和谐的结果。主要亮点包括：\n\n*   **精准的内容理解和重建：** 在生成过程中保持语义一致性，准确识别并保留对象的关键结构特征。\n*   **开放式基于指令的编辑：** 灵活响应自然语言中的创意指令，用于风格迁移、场景重建和细节修饰。甚至可以通过编辑指令实现深度图预测等任务。\n*   **多语言指令支持：** 支持中文和英文。\n\n本文通过示例展示了Qwen VLo的功能，包括生成和修改动物图像、风格转换（例如，将照片转换为吉卜力风格或像素艺术）、复杂图像提示解释以及海报生成。它还强调了该模型执行对象检测和分割等注释的能力，以及处理涉及多个输入图像的任务的能力（此功能即将推出）。最后，Qwen VLo还支持直接文本生成图像，包括双语海报。"
  },
  {
    "id": "44400025",
    "title": "Learn OCaml",
    "url": "https://ocaml-sf.org/learn-ocaml-public/#activity=exercises",
    "summary": "The provided text is extremely brief and essentially just states the title \"Learn OCaml\" repeated, along with the word \"Connected as\" and sections labeled \"Activities\" bracketed with \"<<\" and \">>\".\n\nBased on this limited information, the article is likely an introductory resource for learning the OCaml programming language. It suggests that it will offer activities, presumably to help readers engage with and learn the language through practical application.\n\nBecause the content is so minimal, a comprehensive summary is impossible. We can only infer that the article aims to guide readers through the process of learning OCaml and includes interactive elements (\"Activities\") to facilitate that learning.\n",
    "chinese_title": "学习 OCaml",
    "chinese_summary": "学习 OCaml\n\n内容极简，仅重复标题“学习 OCaml”，以及“Connected as”和用“<<”和“>>”括起来的“Activities”部分。\n\n据此推测，该文章可能是 OCaml 编程语言的入门资源，并提供活动，可能旨在帮助读者通过实践应用来学习这门语言。\n\n因内容极少，无法提供全面总结。只能推断该文章旨在引导读者学习 OCaml，并包含交互元素（“Activities”）以促进学习。"
  },
  {
    "id": "44397367",
    "title": "Weird Expressions in Rust",
    "url": "https://www.wakunguma.com/blog/rust-weird-expr",
    "summary": "This article delves into the \"weird-expr.rs\" test file in the Rust repository, showcasing unusual and valid Rust code that leverages features like coercion, loops, expressions, and macros in unexpected ways. These are not bugs, but rather extreme examples illustrating Rust's flexibility and type system quirks.\n\nThe author explores examples like functions returning \"never\" type `!`, which can coerce to any other type, allowing it to be assigned to booleans or passed as unit type arguments. They demonstrate how `return` expressions can be used within loops, match statements, and if statements due to this coercion.\n\nOther examples include uninitialized variables used in comparisons, exploiting the unit type `()` returned by assignments. The `assert!` macro's unit type return is also used in conjunction with coercion. Furthermore, the article touches on infinite module recursion using `pub use super::cx;`, and using unicode characters to rename keywords, and the turbo fish `::<>` for explicitly empty generics.\n\nMore complex cases involve chaining multiple patterns in match arms and closures with unspecified types and pattern matching, alongside nested expressions and macro abuse to return and break from loops. The article also explains how assigning patterns with wildcard `_` and `matches!` macro can lead to complex conditional logic.\n\nFinally, the author dissects intricate examples involving ranges, nested macros, and dereferencing traits to create callable functions that result in valid, though perhaps bewildering, Rust code. The article serves as a fascinating exploration of Rust's expressive power and edge cases.\n",
    "chinese_title": "Rust 中的奇特表达",
    "chinese_summary": "深入剖析 Rust 仓库中的 \"weird-expr.rs\" 测试文件：探索利用强制转换、循环、表达式和宏的非常规有效 Rust 代码。这些并非漏洞，而是展示 Rust 灵活性和类型系统怪癖的极端示例。\n\n作者探讨了函数返回 \"never\" 类型 `!` 的例子，它可以强制转换为任何其他类型，从而可以将其赋值给布尔值或作为单元类型参数传递。他们演示了由于这种强制转换，`return` 表达式如何在循环、match 语句和 if 语句中使用。\n\n其他示例包括在比较中使用未初始化的变量，利用赋值返回的单元类型 `()`。`assert!` 宏的单元类型返回值也与强制转换结合使用。此外，本文还涉及使用 `pub use super::cx;` 的无限模块递归，以及使用 Unicode 字符重命名关键字，和使用 turbo fish `::<>` 来显式指定空泛型。\n\n更复杂的情况包括在 match 分支和具有未指定类型和模式匹配的闭包中链接多个模式，以及嵌套表达式和滥用宏以从循环返回和跳出。本文还解释了如何使用带有通配符 `_` 的赋值模式和 `matches!` 宏来产生复杂的条件逻辑。\n\n最后，作者剖析了涉及范围、嵌套宏和解引用 trait 以创建可调用函数的复杂示例，这些函数会产生有效但可能令人困惑的 Rust 代码。本文是对 Rust 表达能力和边缘情况的一次引人入胜的探索。"
  },
  {
    "id": "44399854",
    "title": "A brief history of children sent through the mail (2016)",
    "url": "https://www.smithsonianmag.com/smart-news/brief-history-children-sent-through-mail-180959372/",
    "summary": "This Smithsonian article from 2016 explores the surprising history of children being sent through the U.S. mail in the early 20th century. After the introduction of Parcel Post in 1913, which allowed the shipping of larger packages, some parents took advantage of the service to send their children to relatives, often grandparents, particularly in rural areas. The article highlights the case of James Beagle, an 8-month-old sent for 15 cents, and Charlotte May Pierstorff, a four-year-old \"mailed\" 73 miles, whose story became a children's book.\n\nWhile these instances made headlines, historian Jenny Lynch emphasizes that the practice reflected the trust rural communities placed in local postal workers. Rural carriers were often seen as trusted servants, performing tasks beyond mail delivery, like caring for the sick.\n\nAlthough the Post Office technically didn't allow animals (except bees and bugs) in the mail, they officially decreed in June 1913 that children could no longer be sent through the mail. However, the practice seemed to fade more because of increased scrutiny rather than a definitive rule. The article concludes by noting that such practices are no longer necessary due to modern travel options.\n",
    "chinese_title": "邮寄儿童简史 (2016)",
    "chinese_summary": "这篇史密森尼杂志2016年的文章探讨了20世纪初美国儿童被邮寄的惊人历史。1913年包裹邮寄服务推出后，允许运输更大的包裹，一些父母便利用这项服务将他们的孩子寄给亲戚，通常是祖父母，尤其是在农村地区。文章重点介绍了詹姆斯·比格的案例，一个8个月大的婴儿被寄了15美分，以及夏洛特·梅·皮尔斯托夫，一个四岁的孩子被“邮寄”了73英里，她的故事后来被写成了一本儿童读物。\n\n尽管这些案例成为了头条新闻，但历史学家珍妮·林奇强调，这种做法反映了农村社区对当地邮政工作人员的信任。农村邮递员通常被视为值得信赖的仆人，他们执行的任务超越了邮件递送，例如照顾病人。\n\n虽然邮局从技术上讲不允许动物（蜜蜂和昆虫除外）邮寄，但他们在1913年6月正式宣布，儿童不得再通过邮件寄送。然而，这种做法似乎更多是因为审查力度的加大而逐渐消失，而不是因为明确的规定。文章最后指出，由于现代旅行方式的出现，这种做法已不再必要。"
  },
  {
    "id": "44394916",
    "title": "DeepSeek R2 launch stalled as CEO balks at progress",
    "url": "https://www.reuters.com/world/china/deepseek-r2-launch-stalled-ceo-balks-progress-information-reports-2025-06-26/",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "DeepSeek R2发布受阻，因CEO对进展不满",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "44399234",
    "title": "SymbolicAI: A neuro-symbolic perspective on LLMs",
    "url": "https://github.com/ExtensityAI/symbolicai",
    "summary": "SymbolicAI is a neuro-symbolic framework that combines Python programming with the power of LLMs. It introduces two core concepts: **Primitives** and **Contracts**. Primitives are Symbol objects offering both syntactic (literal Python value) and semantic (meaning and context-aware) behaviors, accessible through projections like `.sem` and `.syn`. These allow for composable operations, bridging traditional Python operations with semantic reasoning.\n\nContracts implement Design by Contract principles to ensure LLM output correctness. This involves using decorators on Expression classes with data models derived from `LLMDataModel` (compatible with Pydantic's BaseModel). Contracts define pre and post-conditions, validation rules, and automatic remedies to handle incorrect inputs or outputs, improving reliability.\n\nTo get started, install SymbolicAI via `pip install symbolicai` and set up API keys for supported engines (OpenAI, Anthropic, etc.) either via environment variables or a `symai.config.json` configuration file.  The framework employs a priority-based configuration system, checking for settings in debug mode (current directory), environment-specific locations, and the global home directory in descending order of priority. Optional features like Wolfram Alpha, Whisper, Selenium, SerpAPI, and Pinecone require additional installations and API keys. The `symconfig` command helps in inspecting the current configuration. SymbolicAI supports community data collection for research purposes and warns the user for data collection usage.\n",
    "chinese_title": "符号AI：LLM的神经符号视角",
    "chinese_summary": "符号AI是一个神经符号框架，它将Python编程与LLM的能力相结合。它引入了两个核心概念：**基元 (Primitives)** 和 **契约 (Contracts)**。基元是符号对象，提供语法（字面 Python 值）和语义（含义和上下文感知）行为，可通过 `.sem` 和 `.syn` 等投影访问。这些允许组合操作，将传统的 Python 操作与语义推理连接起来。\n\n契约实现了契约式设计原则，以确保 LLM 输出的正确性。这涉及到使用装饰器在表达式类上，这些表达式类具有从 `LLMDataModel` 派生的数据模型（与 Pydantic 的 BaseModel 兼容）。契约定义了前置条件和后置条件、验证规则和自动补救措施，以处理不正确的输入或输出，从而提高可靠性。\n\n要开始使用，请通过 `pip install symbolicai` 安装 SymbolicAI，并通过环境变量或 `symai.config.json` 配置文件设置支持的引擎（OpenAI、Anthropic 等）的 API 密钥。该框架采用基于优先级的配置系统，按优先级降序检查调试模式（当前目录）、特定于环境的位置和全局主目录中的设置。Wolfram Alpha、Whisper、Selenium、SerpAPI 和 Pinecone 等可选功能需要额外的安装和 API 密钥。`symconfig` 命令有助于检查当前配置。SymbolicAI 支持用于研究目的的社区数据收集，并警告用户关于数据收集的使用情况。"
  },
  {
    "id": "44405728",
    "title": "Arrests of scientists over smuggled samples add to US border anxiety",
    "url": "https://www.nature.com/articles/d41586-025-01958-4",
    "summary": "The article discusses the recent arrests of several foreign scientists in the US for allegedly attempting to smuggle biological materials into the country without proper declaration. These incidents have created anxiety within the research community, particularly given the Trump administration's stance on immigration and science funding.\n\nThe article highlights four specific cases: Kseniia Petrova (frog embryos), Yunqing Jian and Zunyong Liu (fungus harmful to crops), and Chengxuan Han (roundworms). In all cases, authorities allege the scientists attempted to conceal the materials.\n\nWhile the transportation of undocumented biological materials isn't new, legal experts argue that the current climate has sensationalized these cases. The key takeaway is that failure to declare biological materials, even if non-hazardous, can lead to serious consequences, including arrest and deportation. The severity of the penalties increases when the materials are hazardous or the individual is a repeat offender. The article emphasizes that transparency is crucial, as the efforts to conceal the materials appear to be a primary factor in the criminal charges.\n",
    "chinese_title": "科学家因走私样本被捕，加剧美国边境焦虑。",
    "chinese_summary": "本文探讨了近期美国逮捕数名外国科学家事件，他们被指控试图在未申报的情况下向该国走私生物材料。这些事件在研究界引发了焦虑，尤其是在特朗普政府对移民和科研经费持强硬立场的大背景下。\n\n文章重点介绍了四个具体案例：Kseniia Petrova（蛙胚胎），Yunqing Jian 和 Zunyong Liu（对农作物有害的真菌）以及 Chengxuan Han（蛔虫）。在所有案例中，当局均指控科学家试图隐瞒这些材料。\n\n虽然运输未备案的生物材料并非新鲜事，但法律专家认为，当前的政治气候使这些案件变得耸人听闻。重要的结论是，未能申报生物材料，即使是非有害的，也可能导致严重的后果，包括逮捕和驱逐出境。当材料具有危险性或个人是惯犯时，处罚的严厉程度会增加。文章强调，透明度至关重要，因为试图隐瞒这些材料的行为似乎是刑事指控的主要因素。"
  },
  {
    "id": "44397168",
    "title": "10 Years of Pomological Watercolors",
    "url": "https://parkerhiggins.net/2025/04/10-years-of-pomological-watercolors/",
    "summary": "This blog post celebrates the 10th anniversary of the author's initial efforts to make the US government's Pomological Watercolor Collection publicly available. The author discovered this collection of over 7,000 fruit and plant illustrations from the late 19th and early 20th centuries, held by the National Agricultural Library. Frustrated that these digitized images were behind a paywall, the author filed FOIA requests and advocated for their release.\n\nThe campaign succeeded, and the collection was made freely accessible online. This success spurred a cascade of related projects: creating Python software to upload the images to Wikimedia Commons (the author's first coding project), developing social media bots to showcase the art, presenting at Wikicon, incorporating the data into other projects, and even creating buttons.\n\nThe author highlights the collection's broader impact, noting its appearance in a coffee table book, academic studies, postcards, art prints, and mentions in publications like the New York Times and Atlas Obscura, and even a cameo in Schitt's Creek. The author emphasizes the unexpected and positive influence of pursuing this interest, stating that it \"changed my life for the better.\" The author ends by expressing gratitude for following curiosity and interest, which led to a decade of surprises and delights centered around the Pomological Watercolor Collection. Finally, the author mentions being on the job market and encourages those with relevant opportunities to get in touch.\n",
    "chinese_title": "十年果树水彩画展",
    "chinese_summary": "这篇博文庆祝作者最初为公开美国政府的果树水彩画集所做努力的十周年。作者在美国国家农业图书馆发现了这批由19世纪末至20世纪初的7000多幅水果和植物插图组成的馆藏。由于这些数字化图像被设置了付费墙，作者感到沮丧，于是提交了信息自由法案请求，并倡导公开这些图像。\n\n这场行动取得了成功，该馆藏得以在网上免费访问。这一成功引发了一系列相关项目：创建Python软件将图像上传到维基共享资源（作者的第一个编码项目），开发社交媒体机器人来展示这些艺术品，在维基大会上进行演讲，将数据整合到其他项目中，甚至制作徽章。\n\n作者强调了该馆藏的更广泛影响，指出它出现在咖啡桌书籍、学术研究、明信片、艺术版画中，并在《纽约时报》和《Atlas Obscura》等出版物中被提及，甚至还在《富家穷路》中客串亮相。作者强调了追求这一兴趣所带来的意想不到的积极影响，并表示这“让我的生活变得更美好”。作者最后表示感谢，感谢自己追随好奇心和兴趣，这带来了围绕果树水彩画集的十年惊喜和快乐。最后，作者提到自己正在求职，并鼓励有相关机会的人与他联系。"
  },
  {
    "id": "44380964",
    "title": "The Original Macintosh: Calculator Construction Set",
    "url": "https://www.folklore.org/Calculator_Construction_Set.html",
    "summary": "This article from Folklore.org recounts the development of the original Macintosh calculator. Chris Espinosa, a young Apple employee, created a calculator program using Quickdraw to demonstrate its capabilities. However, Steve Jobs, acting as the aesthetic judge, found the initial design unsatisfactory, criticizing the colors, line thicknesses, and button sizes.\n\nInstead of repeatedly modifying the calculator based on Steve's feedback, Chris ingeniously created the \"Steve Jobs Roll Your Own Calculator Construction Set.\" This program allowed users to customize every graphical aspect of the calculator through pull-down menus, including line thickness, button size, and background patterns.\n\nSteve Jobs spent ten minutes tweaking the parameters and settled on a design he liked. When the actual calculator UI was implemented by Andy Hertzfeld (with Donn Denman handling the math semantics), Steve's preferred design was used. This design became the standard calculator on the Macintosh, remaining consistent through OS 9.\n\nThe article highlights Chris Espinosa's creativity in addressing Steve Jobs' perfectionism and how this approach ultimately shaped a lasting element of the Macintosh operating system. A commenter noted that the order of some operators in the calculator were different from the numeric keypad of the Mac Plus, and this was fixed with System 3.2.\n",
    "chinese_title": "初代Macintosh：计算器构造套装",
    "chinese_summary": "本文讲述了 Folklore.org 上关于初代 Macintosh 计算器开发的故事。年轻的苹果员工 Chris Espinosa 用 Quickdraw 创建了一个计算器程序，以展示其功能。然而，作为审美评判者的史蒂夫·乔布斯对最初的设计并不满意，批评了颜色、线条粗细和按钮大小。\n\nChris 没有根据史蒂夫的反馈反复修改计算器，而是巧妙地创建了“史蒂夫·乔布斯定制计算器构造工具”。该程序允许用户通过下拉菜单自定义计算器的每个图形方面，包括线条粗细、按钮大小和背景图案。\n\n史蒂夫·乔布斯花了十分钟调整参数，最终确定了他喜欢的设计。当 Andy Hertzfeld（由 Donn Denman 处理数学语义）实现实际的计算器 UI 时，使用了史蒂夫首选的设计。这个设计成为 Macintosh 上的标准计算器，并一直沿用到 OS 9。\n\n文章突出了 Chris Espinosa 在应对史蒂夫·乔布斯的完美主义方面的创造力，以及这种方法如何最终塑造了 Macintosh 操作系统的一个持久元素。一位评论员指出，计算器中某些运算符的顺序与 Mac Plus 的数字键盘不同，这个问题在 System 3.2 中得到了修复。"
  },
  {
    "id": "44367539",
    "title": "c4wa – C compiler for Web Assembly",
    "url": "https://github.com/kign/c4wa",
    "summary": "c4wa is a C compiler designed to produce minimalistic, well-optimized WebAssembly (WASM) code, offering a middle ground between full-featured compilers like Emscripten and hand-written WAT. Its key features include generating WASM without external dependencies, efficient use of linear memory, and the ability to output human-readable WAT code for learning and debugging.\n\nUnlike Emscripten, c4wa avoids \"glue\" code or large libraries, focusing solely on direct translation of C to WASM. It supports a subset of C including loops, conditionals, data types, structs, pointers, and dynamic memory allocation.\n\nc4wa requires Java 11+ and optionally a C preprocessor. The generated WASM is runtime-agnostic, usable with node, wasmtime, wasmer, or browsers.  The article provides instructions for installation and a simple example demonstrating how to compile C code and run it using node and wasmer.  It highlights that standard libraries are intentionally excluded, encouraging direct WASM imports.\n\nThe article also mentions a test suite and a sample web application demonstrating how to use c4wa-compiled WASM in a browser, including redirecting `printf` output.  Finally, it describes a built-in WebAssembly interpreter for runtime verification and details the development and testing process, including unit tests, WAT code verification, and runtime execution checks.\n",
    "chinese_title": "c4wa – Web Assembly 的 C 编译器",
    "chinese_summary": "c4wa 是一款 C 编译器，旨在生成最小化、优化良好的 WebAssembly (WASM) 代码，提供 Emscripten 等全功能编译器和手写 WAT 之间的中间地带。其主要特点包括生成没有外部依赖的 WASM，高效利用线性内存，以及输出人类可读的 WAT 代码，方便学习和调试。\n\n与 Emscripten 不同，c4wa 避免了“胶水”代码或大型库，仅专注于 C 到 WASM 的直接翻译。它支持 C 的一个子集，包括循环、条件语句、数据类型、结构体、指针和动态内存分配。\n\nc4wa 需要 Java 11+，可选的 C 预处理器。生成的 WASM 与运行时无关，可与 node、wasmtime、wasmer 或浏览器一起使用。文章提供了安装说明和一个简单示例，演示了如何编译 C 代码并使用 node 和 wasmer 运行它。文章强调有意排除标准库，鼓励直接导入 WASM。\n\n文章还提到了一个测试套件和一个示例 Web 应用程序，演示了如何在浏览器中使用 c4wa 编译的 WASM，包括重定向 `printf` 输出。最后，它描述了一个内置的 WebAssembly 解释器，用于运行时验证，并详细介绍了开发和测试过程，包括单元测试、WAT 代码验证和运行时执行检查。"
  },
  {
    "id": "44405812",
    "title": "What makes Europe better than America?",
    "url": "https://www.thefp.com/p/what-makes-europe-better-than-america",
    "summary": "Chris Arnade's article \"What Makes Europe Better Than America?\" uses a personal anecdote of contrasting breakfast experiences to highlight deeper cultural differences between Europe and the United States.\n\nHe contrasts a pleasurable breakfast experience in a 600-year-old plaza in Milan with a depressing, overpriced breakfast in a bland hotel lobby near the Atlanta airport. He argues that while cost and calories might be similar, the experiences were drastically different, pointing to more significant underlying disparities in values and priorities.\n\nArnade suggests that the U.S. emphasizes material wealth, opportunity, and individual liberty, while Europe places more value on community health, shared resources, and a sense of place. The Italian breakfast exemplified this, with its focus on fresh, quality ingredients enjoyed in a beautiful, historically rich setting, highlighting a connection to the community. The American breakfast, on the other hand, prioritized cost-effectiveness and inoffensiveness, resulting in a sterile and unfulfilling experience.\n\nUltimately, Arnade implies that while America might be wealthier, Europe offers a healthier and more enriching lifestyle due to its emphasis on aesthetics, community, and cultural heritage.\n",
    "chinese_title": "是什么让欧洲比美国更好？",
    "chinese_summary": "克里斯·阿尔纳德的文章《是什么让欧洲比美国更好？》通过对比早餐经历的个人轶事，突显了欧洲和美国之间更深层次的文化差异。\n\n他将米兰一座有着600年历史的广场上令人愉悦的早餐体验，与亚特兰大机场附近一家平淡酒店大堂里令人沮丧且价格过高的早餐进行了对比。他认为，虽然成本和卡路里可能相似，但体验却截然不同，这表明在价值观和优先事项方面存在更重要的潜在差异。\n\n阿尔纳德认为，美国强调物质财富、机会和个人自由，而欧洲更重视社区健康、共享资源和归属感。意大利的早餐体现了这一点，它注重在美丽而具有历史意义的环境中享用新鲜、优质的食材，突出了与社区的联系。另一方面，美国早餐优先考虑成本效益和无冒犯性，导致了无菌且令人不满足的体验。\n\n最终，阿尔纳德暗示，虽然美国可能更富有，但由于欧洲强调美学、社区和文化遗产，因此提供了更健康、更丰富的生活方式。"
  },
  {
    "id": "44398390",
    "title": "Transmitting data via ultrasound without any special equipment",
    "url": "https://halcy.de/blog/2025/06/27/transmitting-data-via-ultrasound-without-any-special-equipment/",
    "summary": "This article, written on June 27, 2025, explores transmitting data via ultrasound using standard computer speakers and microphones, avoiding the need for specialized hardware or network connections. The author explains that ultrasound, frequencies above human hearing (20,000 Hz), can be emitted and received by typical laptop speakers and microphones, albeit with limitations.\n\nThe author details a project leveraging WebAudio to encode data into high-frequency audio signals. They implemented a return-to-zero frequency shift keying (RTZ FSK) method, where data is represented by shifts in pitch within the ultrasound range. A website is provided for readers to experiment with sending messages between devices.\n\nThe encoder converts characters to 8-bit ASCII with preambles and framing bits for synchronization. The receiver analyzes the audio spectrum to detect frequency shifts, converting them back into bits and then characters. The author acknowledges limitations such as susceptibility to interference, lack of error correction, slow speed, and potentially audible frequencies for some users. They provide the source code for improvement, suggesting enhancements like Reed-Solomon error correction or a more robust decoder.\n\nDespite its \"hacky\" nature, the author points out that this technique is already used in software to detect nearby devices, highlighting its practical application. The article encourages readers to explore the potential of ultrasound data transmission.\n",
    "chinese_title": "无需特殊设备，通过超声波传输数据",
    "chinese_summary": "本文发表于2025年6月27日，探讨了如何利用标准电脑扬声器和麦克风通过超声波传输数据，从而避免对专用硬件或网络连接的需求。作者解释说，超声波，即高于人类听觉范围（20,000赫兹）的频率，可以通过典型的笔记本电脑扬声器和麦克风发射和接收，尽管存在局限性。\n\n作者详细介绍了一个利用WebAudio将数据编码成高频音频信号的项目。他们实施了一种归零频移键控（RTZ FSK）方法，其中数据由超声波范围内音调的偏移来表示。文章提供了一个网站，供读者尝试在设备之间发送消息。\n\n编码器将字符转换为带有前导码和帧位用于同步的8位ASCII码。接收器分析音频频谱以检测频率偏移，将其转换回比特，然后转换为字符。作者承认其局限性，例如容易受到干扰、缺乏纠错、速度慢，以及对于某些用户可能存在可听见的频率。他们提供了源代码以供改进，并建议进行增强，例如Reed-Solomon纠错或更强大的解码器。\n\n尽管具有“hacky”性质，作者指出该技术已在软件中用于检测附近的设备，突出了其在实际应用中的价值。文章鼓励读者探索超声波数据传输的潜力。"
  },
  {
    "id": "44377589",
    "title": "AlphaGenome: AI for Better Understanding the Genome",
    "url": "https://deepmind.google/discover/blog/alphagenome-ai-for-better-understanding-the-genome/",
    "summary": "AlphaGenome, a new AI tool, has been introduced to comprehensively and accurately predict how DNA sequence variations impact gene regulation. Developed by Ziga Avsec and Natasha Latysheva, this model processes long DNA sequences (up to 1 million base pairs) and predicts thousands of molecular properties, including gene start/end points, splicing, RNA production, and protein binding, across various cell types and tissues.\n\nAlphaGenome builds upon previous models like Enformer and is complementary to AlphaMissense. It distinguishes itself through its ability to analyze long sequence contexts at high resolution, comprehensively predict diverse modalities of gene regulation, efficiently score the impact of genetic variants, and explicitly model RNA splice junctions. It achieves state-of-the-art performance across genomic prediction benchmarks, outperforming or matching existing models in predicting DNA sequence and variant effects.\n\nThe tool is available via API for non-commercial research, with plans for a full release. AlphaGenome's unifying approach enables scientists to explore a variant's impact on multiple modalities simultaneously, accelerating research in disease understanding, synthetic biology, and fundamental genome research. For example, it was used to investigate a cancer-associated mutation mechanism in T-ALL patients.\n\nWhile AlphaGenome marks a significant advancement, it still has limitations in capturing very distant regulatory elements and cell/tissue-specific patterns. It is not designed for personal genome prediction and doesn't encompass the full complexity of diseases involving developmental and environmental factors. The developers are actively seeking community feedback to further improve the model and its applications.\n",
    "chinese_title": "AlphaGenome：人工智能助力基因组理解",
    "chinese_summary": "AlphaGenome：预测DNA序列变异对基因调控影响的新AI工具\n\nAlphaGenome是一种新的AI工具，旨在全面、准确地预测DNA序列变异如何影响基因调控。该模型由Ziga Avsec和Natasha Latysheva开发，能够处理长DNA序列（高达100万个碱基对），并预测数千种分子特性，包括基因起始/终止点、剪接、RNA产生以及蛋白质结合，覆盖多种细胞类型和组织。\n\nAlphaGenome建立在Enformer等先前模型的基础上，并与AlphaMissense互补。它的独特之处在于能够以高分辨率分析长序列上下文，全面预测多种基因调控模式，高效评估遗传变异的影响，并明确模拟RNA剪接连接。该模型在基因组预测基准测试中表现出色，在预测DNA序列和变异效应方面超越或匹敌现有模型。\n\n该工具通过API提供给非商业研究使用，并计划全面发布。AlphaGenome的统一方法使科学家能够同时探索变异对多种模式的影响，从而加速疾病理解、合成生物学和基础基因组研究。例如，它已被用于研究T-ALL患者中与癌症相关的突变机制。\n\n虽然AlphaGenome标志着一项重大进步，但它在捕捉非常遥远的调控元件和细胞/组织特异性模式方面仍存在局限性。它并非为个人基因组预测而设计，也不涵盖涉及发育和环境因素的疾病的全部复杂性。开发者们正在积极寻求社区反馈，以进一步改进模型及其应用。"
  },
  {
    "id": "44402421",
    "title": "An Introduction to Tribalism for the Modern World That Has Forgotten It",
    "url": "https://sustainableviews.substack.com/p/an-introduction-to-tribalism-for",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "现代世界已遗忘的部落主义导论",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "44369810",
    "title": "Korean students seek 'digital undertakers' amid US visa social media screening",
    "url": "https://www.koreaherald.com/article/10515737",
    "summary": "Korean students seeking US visas are increasingly concerned about social media screening as part of the visa application process. This concern has led to a new demand for \"digital undertakers,\" individuals or companies specializing in cleaning up social media profiles to remove potentially problematic content.\n\nThe article, by Lee Jung-joo who covers social issues in Seoul, security, and climate, highlights how US visa applicants in Korea are going to extra lengths to ensure their online presence aligns with visa requirements. The implication is that posts, photos, or comments that could be interpreted negatively by US consular officers might negatively impact visa approval.\n\nTherefore, these students are hiring \"digital undertakers\" to thoroughly scrub their social media accounts of anything deemed risky or controversial. This includes deleting old posts, editing profiles, and removing potentially offensive content. This highlights the anxiety and proactive measures applicants are taking in response to the heightened scrutiny of social media by US immigration authorities. The increasing demand for these services underscores the significance applicants place on presenting a flawless online image to secure their US visas.\n",
    "chinese_title": "韩国学生因美国签证社交媒体审查而寻求“数字殡葬师”",
    "chinese_summary": "韩国学生申请美国签证越来越担心社交媒体审查。这种担忧催生了对“数字殡葬师”的新需求，这些人或公司专门清理社交媒体资料，以删除可能存在问题的内容。\n\n首尔社会问题、安全和气候记者李正珠的文章强调了韩国的美国签证申请者如何采取额外措施，以确保他们的在线形象符合签证要求。这意味着，可能被美国领事官员负面解读的帖子、照片或评论可能会对签证批准产生不利影响。\n\n因此，这些学生正在聘请“数字殡葬师”彻底清理其社交媒体账户中任何被认为有风险或有争议的内容，包括删除旧帖子、编辑个人资料以及删除可能具有攻击性的内容。这凸显了申请者对美国移民局加强社交媒体审查的焦虑和主动采取的措施。对这些服务日益增长的需求突显了申请者对呈现完美在线形象以确保获得美国签证的重视。"
  },
  {
    "id": "44401303",
    "title": "Multi-Stage Programming with Splice Variables",
    "url": "https://tsung-ju.org/icfp25/",
    "summary": "This article introduces multi-stage programming with splice variables, a technique for generating optimized code at compile time. It explains how, instead of writing generic code, the system can create specialized code tailored to specific situations, improving performance.\n\nThe core concepts are quotations, which treat code as data within angle brackets `< >`, and splice variables, introduced with `let$`, which allow injecting quoted code into other quoted code. Splice variables offer precise control over code generation and automatically track variable dependencies, ensuring well-formed, scoped, and type-correct generated code.\n\nThe necessity of splice variables stems from stage tracking (managing variable usage across nested quotations) and dependency tracking (ensuring all variables have defined values in their execution context). These mechanisms prevent errors and guarantee safe code generation.\n\nThe article demonstrates the power of splice variables through examples like creating optimized power functions that unfold loops into direct multiplications. It also covers code pattern matching and rewriting, enabling code analysis, optimization, and simplification. These techniques use rewrite rules for global code transformations.\n\nFinally, the article explores advanced features such as unhygienic functions, which intentionally capture variables from surrounding contexts, and wrap types, which grant fine-grained control over dependency declaration for values. The key takeaway is that the system automatically manages stage levels and variable dependencies, leading to predictable and safe code generation.\n",
    "chinese_title": "使用拼接变量的多阶段编程",
    "chinese_summary": "本文介绍了使用拼接变量的多阶段编程，这是一种在编译时生成优化代码的技术。它解释了系统如何创建针对特定情况量身定制的专用代码，而不是编写通用代码，从而提高性能。\n\n核心概念是引号，它将代码视为尖括号 `< >` 内的数据，以及用 `let$` 引入的拼接变量，它允许将引号代码注入到其他引号代码中。拼接变量可以精确控制代码生成，并自动跟踪变量依赖关系，从而确保生成格式良好、范围明确且类型正确的代码。\n\n拼接变量的必要性源于阶段跟踪（管理跨嵌套引号的变量使用）和依赖关系跟踪（确保所有变量在其执行上下文中都有定义的值）。这些机制可以防止错误并保证代码生成的安全性。\n\n本文通过创建将循环展开为直接乘法的优化幂函数等示例，展示了拼接变量的强大功能。它还介绍了代码模式匹配和重写，从而实现代码分析、优化和简化。这些技术使用重写规则进行全局代码转换。\n\n最后，本文探讨了高级功能，例如不卫生的函数（有意捕获周围上下文中的变量）和包装类型（允许对值的依赖关系声明进行细粒度控制）。主要结论是，系统自动管理阶段级别和变量依赖关系，从而实现可预测且安全的代码生成。"
  },
  {
    "id": "44404782",
    "title": "Facebook is asking to use Meta AI on photos in your camera roll you haven't yet",
    "url": "https://techcrunch.com/2025/06/27/facebook-is-asking-to-use-meta-ai-on-photos-in-your-camera-roll-you-havent-yet-shared/",
    "summary": "Facebook is testing a feature that asks users for permission to access their camera roll to automatically generate AI-edited versions of their photos, including those not yet uploaded to the platform. When creating a new Story, a pop-up appears asking users to opt into \"cloud processing\" to allow Facebook to suggest collages, recaps, AI restylings, and photo themes.\n\nBy agreeing, users allow Facebook to upload media from their camera roll to its servers, enabling AI analysis of media and facial features. While Facebook claims the suggestions are only visible to the user and not used for ad targeting, consenting to the terms of service gives Meta the right to analyze the images and retain personal information for personalized AI outputs.\n\nThis feature has sparked privacy concerns, as it extends beyond publicly shared data and allows Meta to potentially train its AI on personal photos not yet posted on the platform. Some users have discovered the feature and shared concerns about it. Users can disable this \"cloud processing\" in the app's settings under \"Camera roll sharing suggestions\".\n\nMeta is currently testing the feature in the U.S. and Canada, with a spokesperson stating that the suggestions are opt-in, only visible to the user, and can be turned off at any time. They also claim that while camera roll media may be used to improve these suggestions, they are not used to improve AI models.\n",
    "chinese_title": "Facebook正在请求使用Meta AI处理你相机胶卷中尚未上传的照片。",
    "chinese_summary": "脸书测试新功能：请求访问用户相册，自动生成AI编辑照片，包括未上传照片。创建新动态时，会弹出窗口询问用户是否选择“云处理”，允许脸书推荐拼贴、回顾、AI风格重塑和照片主题。\n\n同意后，用户允许脸书将相册中的媒体上传到其服务器，从而进行媒体和面部特征的AI分析。虽然脸书声称这些建议仅用户可见，不会用于广告定向，但同意服务条款即赋予Meta分析图像和保留个人信息以用于个性化AI输出的权利。\n\n此功能引发了隐私担忧，因为它超越了公开分享的数据，并允许Meta潜在地使用尚未发布在平台上的个人照片来训练其AI。一些用户发现了此功能并表达了担忧。用户可以在应用程序设置中的“相册共享建议”下禁用此“云处理”。\n\nMeta目前正在美国和加拿大测试该功能，一位发言人表示，这些建议是可选加入的，仅用户可见，并且可以随时关闭。他们还声称，虽然相册媒体可能被用于改进这些建议，但不会用于改进AI模型。"
  },
  {
    "id": "44399193",
    "title": "nimbme – Nim bare-metal environment",
    "url": "https://github.com/mikra01/nimbme",
    "summary": "`nimbme` is a Nim-based bare-metal environment designed for embedded targets, currently implemented on Raspberry Pi 1 and Pi Zero (BCM2835). It aims to provide a platform for research and development without relying on vendor-specific APIs, emphasizing direct hardware access via Nim code.\n\nKey features include a cooperative scheduler, system-mode ARMv6 execution, an async programming model, and portability with minimal assembly code. It requires a GNU-ARM toolchain, a serial terminal, and a USB-to-serial adapter.\n\nThe project supports features like UART-based stdio, process management (up to 10 processes), runtime cycle collection, memory management (64KB total RAM, 24KB shared heap, 1KB stack size per process), race condition detection, register snapshots, and in-memory image upload. Build size is significantly impacted by library choices, with considerations needed for stack alignment.\n\nThe author highlights the poor quality of the BCM2835 datasheet, recommending alternative documentation. They also share overclocking experiments (at user's own risk) and debugging techniques utilizing Nim's capabilities, GPIO monitoring with a scope, and counter measurements for latency analysis.\n\nFuture plans include fixed-size memory block allocation, GPIO handling for RP1, support for other targets (Cortex-M0, Sitara AM3358, RISC-V), in-memory app mode for flash targets, a generic driver layer, ethernet/USB gadget mode, SD card I/O, signal handling, and SPI/I2C examples. David Welch's previous work on BCM2835 is acknowledged as a helpful resource for filling in gaps in the official documentation.\n",
    "chinese_title": "nimbme – Nim裸机环境",
    "chinese_summary": "`nimbme`是一个基于Nim的裸机环境，专为嵌入式目标设计，目前已在 Raspberry Pi 1 和 Pi Zero (BCM2835) 上实现。它旨在提供一个用于研究和开发的平台，无需依赖供应商特定的 API，强调通过 Nim 代码直接访问硬件。\n\n主要特性包括协作式调度器、系统模式 ARMv6 执行、异步编程模型以及具有最少汇编代码的可移植性。它需要 GNU-ARM 工具链、串行终端和 USB 转串行适配器。\n\n该项目支持 UART 上的 stdio、进程管理（最多 10 个进程）、运行时循环垃圾回收、内存管理（总共 64KB RAM，24KB 共享堆，每个进程 1KB 堆栈大小）、竞争条件检测、寄存器快照和内存镜像上传等功能。构建大小受库选择的显著影响，需要考虑堆栈对齐。\n\n作者强调了 BCM2835 数据手册的质量不佳，并推荐了替代文档。他们还分享了超频实验（风险自负）和利用 Nim 功能的调试技术、使用示波器进行 GPIO 监控以及用于延迟分析的计数器测量。\n\n未来的计划包括固定大小内存块分配、RP1 的 GPIO 处理、对其他目标的支持（Cortex-M0、Sitara AM3358、RISC-V）、闪存目标的内存应用程序模式、通用驱动程序层、以太网/USB 设备模式、SD 卡 I/O、信号处理以及 SPI/I2C 示例。David Welch 之前在 BCM2835 上的工作被认为是填补官方文档空白的有用资源。"
  },
  {
    "id": "44405235",
    "title": "Skype Is Gone: The FOSS Alternative",
    "url": "https://boilingsteam.com/skype-shuts-down-some-good-foss-alternatives/",
    "summary": "In a future where Skype has shut down, leaving a void in accessible communication, the article explores Free and Open Source Software (FOSS) alternatives. Microsoft Teams is deemed an unsatisfactory replacement. The author sets strict criteria for a viable alternative: end-to-end encryption, group chat, audio and video calls, open protocols, non-reliance on phone numbers for identification, FOSS clients across major platforms, client interoperability, and self-hostable servers.\n\nThe primary recommendation is the Matrix network, used at Boiling Steam for years. It meets all the criteria, allowing for encrypted audio/video calls, group chats, and self-hosting. However, the experience isn't flawless. The Element client, while feature-rich, faces challenges with its mobile versions: the legacy client's account creation restrictions and the still-developing Element-X's lack of features and buggy nature.  The hosting of Matrix server (Synapse) can be resource intensive.  The Matrix organization's financial instability raises concerns about long-term support, although the FOSS nature provides some reassurance.\n\nThe article also considers XMPP, IRC, and Deltachat. XMPP suffers from inconsistent client quality across platforms, particularly on iOS and desktop. IRC lacks modern features and the Irc v3 protocol is still in development. Deltachat, while intriguing due to its reliance on email, lacks video calls.\n\nThe author concludes that Matrix, despite its issues, is the most mature replacement for Skype in 2025, particularly for those prioritizing FOSS and self-hosting options.\n",
    "chinese_title": "Skype已逝：FOSS替代方案",
    "chinese_summary": "在Skype关闭，导致无障碍通讯出现空白的未来，本文探讨了自由及开放源代码软件（FOSS）的替代方案。Microsoft Teams被认为是不令人满意的替代品。作者为可行的替代方案设定了严格的标准：端到端加密、群聊、音频和视频通话、开放协议、不依赖电话号码进行身份识别、跨主要平台的FOSS客户端、客户端互操作性以及可自托管的服务器。\n\n主要推荐是已经在Boiling Steam使用多年的Matrix网络。它满足所有标准，允许加密的音频/视频通话、群聊和自托管。然而，体验并非完美。Element客户端虽然功能丰富，但在移动版本方面面临挑战：旧版客户端的帐户创建限制以及仍在开发中的Element-X缺乏功能且存在错误。Matrix服务器（Synapse）的托管可能需要大量的资源。Matrix组织财务上的不稳定引发了人们对长期支持的担忧，尽管FOSS的性质提供了一些保证。\n\n本文还考虑了XMPP、IRC和Deltachat。XMPP在各个平台上的客户端质量不一致，尤其是在iOS和桌面平台上。IRC缺乏现代功能，并且Irc v3协议仍在开发中。Deltachat因其依赖电子邮件而引人入胜，但缺乏视频通话功能。\n\n作者总结说，Matrix虽然存在问题，但对于那些优先考虑FOSS和自托管选项的人来说，它是2025年Skype最成熟的替代品。"
  },
  {
    "id": "44405895",
    "title": "Peter Thiel: Elon Musk has given up on Mars",
    "url": "https://unherd.com/newsroom/peter-thiel-elon-musk-has-given-up-on-mars/?us",
    "summary": "According to Peter Thiel in a New York Times interview, Elon Musk has abandoned his vision of colonizing Mars as a \"political project\" to build a new society. Thiel claims that Musk now views SpaceX solely as a technological endeavor, no longer believing a Martian colony can escape Earth's problems.\n\nThiel attributes Musk's change of heart to a conversation with Google DeepMind AI boss Demis Hassabis, who argued that AI could follow humans to Mars. This allegedly led Musk to believe that even on Mars, the \"socialist US government\" and \"woke AI\" would persist. This disillusionment reportedly fueled Musk's heavy backing of Trump, viewing political battles on Earth as more crucial than escaping to space.\n\nWhile Musk has publicly maintained his ambition for Mars colonization, even tweeting about a potential Starship launch to Mars next year, Thiel insists that Musk no longer sees space as a refuge. He quotes Musk as saying, \"There's nowhere to go,\" indicating a loss of faith in interplanetary escape. Thiel also suggests that Musk's initial vision of Mars was a libertarian paradise, but the realization that it could be more than just a science project led to his disillusionment.\n",
    "chinese_title": "彼得·蒂尔：埃隆·马斯克已经放弃火星了",
    "chinese_summary": "根据彼得·蒂尔在《纽约时报》的一次采访中透露，埃隆·马斯克已经放弃了他将火星殖民地化作为“政治项目”来建设新社会的愿景。蒂尔声称，马斯克现在仅仅将SpaceX视为一项技术事业，不再相信火星殖民地能够逃脱地球的问题。\n\n蒂尔将马斯克心境的转变归因于与谷歌DeepMind人工智能负责人德米斯·哈萨比斯的一次谈话，后者认为人工智能可以跟随人类登上火星。据称，这让马斯克相信，即使在火星上，“社会主义的美国政府”和“觉醒的人工智能”也会继续存在。据报道，这种幻灭感促使马斯克大力支持特朗普，认为地球上的政治斗争比逃往太空更为重要。\n\n尽管马斯克公开坚持他殖民火星的雄心，甚至发推文说明年可能会用星舰发射到火星，但蒂尔坚持认为马斯克不再将太空视为避难所。他引用马斯克的话说，“无处可去”，表明他对行星际逃亡失去了信心。蒂尔还暗示，马斯克最初对火星的愿景是一个自由主义者的天堂，但意识到它可能不仅仅是一个科学项目后，导致了他的幻灭。"
  },
  {
    "id": "44404907",
    "title": "Broadcom is quietly plotting a takeover of the AI infrastructure market",
    "url": "https://www.theregister.com/2025/06/27/broadcom_ai_ip/",
    "summary": "This article discusses Broadcom's strategy to become a major player in the AI infrastructure market by focusing on interconnect technologies, often overlooked amidst the focus on GPUs. Unlike Nvidia, which develops its own closed ecosystem, Broadcom operates on a merchant silicon model, licensing its chips and IP to various companies, including hyperscalers like Google and Apple.\n\nBroadcom's approach spans multiple levels of interconnection, from die-to-die communication using their 3.5D XDSiP packaging technology to system-to-system networks utilizing high-radix Ethernet switches like the Tomahawk series. The Tomahawk 6, capable of 102.4Tbps, allows for efficient connections between massive GPU clusters. While Ethernet is typically used for scale-out networks, Broadcom is also advocating for its use in scale-up architectures, offering an alternative to UALink.\n\nA key component of Broadcom's strategy is co-packaged optics (CPO), which integrates lasers and signal processors directly onto the switch ASIC, significantly improving power efficiency. They are also developing optical chiplets that can be co-packaged with GPUs to extend scale-up networks beyond a single rack.\n\nBy providing a comprehensive portfolio of interconnect solutions, from chiplets to high-speed switches and advanced packaging, Broadcom aims to enable hyperscalers and other AI infrastructure providers to build large-scale, efficient AI systems without having to develop these complex technologies themselves. The article concludes that Broadcom's open, licensing-based approach could make them a dominant force in the AI infrastructure market, even if their presence remains largely invisible to end-users.\n",
    "chinese_title": "博通正悄然策划收购人工智能基础设施市场。",
    "chinese_summary": "博通：专注于互连技术，打造AI基础设施市场关键角色\n\n本文探讨了博通成为AI基础设施市场主要参与者的战略，其重点在于互连技术，这些技术在GPU备受关注的情况下常常被忽视。与开发自有封闭生态系统的英伟达不同，博通采用商业硅模式，将其芯片和IP授权给包括谷歌和苹果等超大规模企业在内的多家公司。\n\n博通的方法涵盖多个互连层面，从使用其3.5D XDSiP封装技术的die-to-die通信，到利用Tomahawk系列等高基数以太网交换机的系统间网络。能够达到102.4Tbps的Tomahawk 6，实现了大规模GPU集群之间的高效连接。虽然以太网通常用于横向扩展网络，但博通也在提倡将其用于纵向扩展架构，从而为UALink提供替代方案。\n\n博通战略的关键组成部分是共封装光学（CPO），它将激光器和信号处理器直接集成到交换机ASIC上，从而显著提高了电源效率。他们还在开发可以与GPU共封装的光学芯片，以将纵向扩展网络扩展到单个机架之外。\n\n通过提供从芯片到高速交换机和先进封装等全面的互连解决方案组合，博通旨在使超大规模企业和其他AI基础设施提供商能够构建大规模、高效的AI系统，而无需自己开发这些复杂的技术。文章总结说，博通的开放式、基于许可的模式可能使其成为AI基础设施市场的主导力量，即使其存在对最终用户来说仍然基本不可见。"
  },
  {
    "id": "44399757",
    "title": "Structuring Arrays with Algebraic Shapes",
    "url": "https://dl.acm.org/doi/abs/10.1145/3736112.3736141",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "用代数形状构建数组",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "44356130",
    "title": "Whitesmiths C compiler: One of the earliest commercial C compilers available",
    "url": "https://github.com/hansake/Whitesmiths-C-compiler",
    "summary": "This article discusses the historical significance and potential public release of the Whitesmiths C compiler, one of the earliest commercial C compilers (released in 1978). The compiler supported a C dialect similar to Version 6 Unix and was a completely new implementation, not derived from Unix code. Later versions, starting with version 3.0 in 1985, supported the emerging ANSI C standard.\n\nThe Whitesmiths compiler was known for its cross-compilation capabilities and supported a wide range of target architectures, including DEC PDP-11, Intel 8080/Zilog Z80, Intel 8086, Motorola MC68000, DEC VAX-11, IBM System/370, and IBM System/36. P.J. Plauger was the company's president from 1978 to 1988.\n\nThe author of the article aims to preserve this important software for future generations. They received permission from P.J. Plauger to make the compiler available for non-commercial download, provided the author creates the package and supplies Plauger with a copy.\n\nThe article provides information on where to find specific versions of the Whitesmiths C compiler:\n\n*   Whitesmiths C Compiler for CP/M-80 Edition 2.2 (binary and source code)\n*   Whitesmiths C Cross Compiler for IBM System/36 Version 3.1 (binary)\n*   Whitesmiths/COSMIC C Cross Compiler Version 3.32 for target Z80 (documentation only).\n\nThe author plans to add more hosts and targets to the available build environment, but is currently awaiting confirmation from P.J. Plauger before fully releasing the compiler to a public repository.\n",
    "chinese_title": "Whitesmiths C 编译器：最早的商用 C 编译器之一",
    "chinese_summary": "本文探讨了最早的商业C编译器之一（1978年发布）Whitesmiths C编译器的历史意义和潜在的公开版本发布。该编译器支持类似于Unix Version 6的C语言方言，并且是一个完全全新的实现，并非源自Unix代码。后来的版本，从1985年的3.0版本开始，支持新兴的ANSI C标准。\n\nWhitesmiths编译器以其交叉编译能力而闻名，并支持广泛的目标架构，包括DEC PDP-11、Intel 8080/Zilog Z80、Intel 8086、Motorola MC68000、DEC VAX-11、IBM System/370和IBM System/36。P.J. Plauger于1978年至1988年担任该公司的总裁。\n\n本文作者旨在为后代保存这一重要的软件。他们已获得P.J. Plauger的许可，可以提供该编译器用于非商业下载，前提是作者创建软件包并将副本提供给Plauger。\n\n本文提供了有关在何处找到特定版本的Whitesmiths C编译器的信息：\n\n*   用于CP/M-80的Whitesmiths C编译器2.2版（二进制文件和源代码）\n*   用于IBM System/36的Whitesmiths C交叉编译器3.1版（二进制文件）\n*   用于目标Z80的Whitesmiths/COSMIC C交叉编译器3.32版（仅文档）。\n\n作者计划向可用的构建环境添加更多主机和目标，但在将编译器完全发布到公共存储库之前，目前正在等待P.J. Plauger的确认。"
  },
  {
    "id": "44367004",
    "title": "bootc-image-builder: Build your entire OS from a Containerfile",
    "url": "https://github.com/osbuild/bootc-image-builder",
    "summary": "`bootc-image-builder` is a tool that creates bootable disk images from bootc container images, particularly those based on Fedora/CentOS bootc. It allows you to build entire operating systems from a Containerfile.  Installation requires `podman` and optionally `qemu` for running the resulting images. SELinux environments need `osbuild-selinux`.\n\nKey features include building various image types (qcow2, ami, iso, etc.) from container images.  A central use case involves pulling a base image (like `quay.io/centos-bootc/centos-bootc`) and then customizing it using a configuration file (`config.toml`) to add users, set kernel arguments, or define filesystem layouts. This configuration file is mounted into the container during the build process.\n\nThe builder supports cloud uploads to AWS for AMIs, requiring specific permissions and bucket configurations.  Credentials can be supplied through the AWS credentials file or environment variables.\n\nImportant arguments include `--type` for image type, `--output` for the output directory, `--rootfs` to override the default filesystem type, `--target-arch` for building for specific architectures, and flags for AWS uploads.  Progress reporting can be controlled via the `--progress` flag.  Volumes like `/output` (required) and `/store` are used for storing artifacts and the osbuild store, respectively.\n\nThe `customizations` section in `config.toml` allows for specifying users, kernel arguments, and filesystem configurations, even setting minimum sizes for `/` and `/boot`. Anaconda ISO builds can be customized using kickstart files, but ensure no conflicting commands with the automated container image installation.\n",
    "chinese_title": "bootc-image-builder：从容器文件中构建你的完整操作系统",
    "chinese_summary": "`bootc-image-builder` 是一个从 bootc 容器镜像创建可引导磁盘镜像的工具，尤其适用于基于 Fedora/CentOS bootc 的镜像。它允许你从 Containerfile 构建整个操作系统。安装需要 `podman`，可选地需要 `qemu` 用于运行生成的镜像。SELinux 环境需要 `osbuild-selinux`。\n\n主要功能包括从容器镜像构建各种镜像类型（qcow2, ami, iso 等）。一个核心用例是拉取基础镜像（例如 `quay.io/centos-bootc/centos-bootc`），然后使用配置文件 (`config.toml`) 自定义它，以添加用户、设置内核参数或定义文件系统布局。此配置文件在构建过程中会被挂载到容器中。\n\n该构建器支持云上传到 AWS 以创建 AMI，这需要特定的权限和存储桶配置。凭证可以通过 AWS 凭证文件或环境变量提供。\n\n重要的参数包括 `--type` (镜像类型)、`--output` (输出目录)、`--rootfs` (覆盖默认文件系统类型)、`--target-arch` (为特定架构构建) 以及用于 AWS 上传的标志。进度报告可以通过 `--progress` 标志控制。卷如 `/output` (必需) 和 `/store` 分别用于存储工件和 osbuild 存储。\n\n`config.toml` 中的 `customizations` 部分允许指定用户、内核参数和文件系统配置，甚至可以设置 `/` 和 `/boot` 的最小大小。Anaconda ISO 构建可以使用 kickstart 文件进行自定义，但要确保没有与自动化容器镜像安装冲突的命令。"
  },
  {
    "id": "44404067",
    "title": "Microsoft pushes staff to use internal AI tools more",
    "url": "https://www.businessinsider.com/microsoft-internal-memo-using-ai-no-longer-optional-github-copilot-2025-6",
    "summary": "This Business Insider article reports that Microsoft is actively encouraging its employees to increase their usage of the company's internal AI tools. While the article provides few specific details about *how* Microsoft is doing this, the central takeaway is a push towards adoption. This indicates Microsoft likely sees internal usage as crucial for several reasons:\n\n*   **Feedback and Improvement:** Internal employees provide a significant testing ground and source of feedback for refining AI tools. Increased usage leads to more data and insights, allowing Microsoft to identify bugs, improve accuracy, and enhance user experience before wider release.\n*   **Evangelization and Expertise:** By becoming power users, Microsoft employees can better understand the capabilities and limitations of their own AI products. This internal expertise can then be leveraged to promote these tools to external customers and partners.\n*   **Internal Efficiency:** Using AI tools internally likely aims to boost employee productivity and streamline workflows across various departments within Microsoft.\n*   **Maintaining Competitive Edge:** The article implies a strategic imperative; that Microsoft is positioning itself at the forefront of AI adoption and wants its employees to embody that leadership.\n\nThe article, while concise, highlights Microsoft's commitment to its AI initiatives and signals a proactive strategy to integrate AI deeply within its own operations and culture. The emphasis is on making internal adoption a priority.\n",
    "chinese_title": "微软推动员工更多使用内部AI工具",
    "chinese_summary": "微软鼓励员工更多使用内部AI工具"
  },
  {
    "id": "44363948",
    "title": "Show HN: Do you know RGB?",
    "url": "https://maxwellito.github.io/do-you-know-rgb/",
    "summary": "The submission on Show HN presents a simple app, likely a game or interactive tool, related to the RGB color model. The title \"Do you know RGB?\" immediately suggests that the app is designed to test or improve a user's understanding of Red, Green, and Blue color combinations. The terse description, \"You need to enable JavaScript to run this app,\" indicates that the application is client-side and requires JavaScript to function properly in a web browser. Without further details, it can be inferred that the app probably involves tasks like identifying colors based on RGB values, mixing colors, or understanding the impact of adjusting individual RGB components.\n",
    "chinese_title": "展示一下：你了解RGB吗？",
    "chinese_summary": "你在Show HN上提交的作品是一个简单的应用程序，可能是一个与RGB颜色模型相关的游戏或互动工具。标题“你了解RGB吗？”直接表明该应用旨在测试或提高用户对红、绿、蓝颜色组合的理解。 简短的描述“你需要启用JavaScript才能运行此应用”表明该应用是客户端应用，需要JavaScript才能在Web浏览器中正常运行。 在没有更多细节的情况下，可以推断出该应用程序可能涉及诸如根据RGB值识别颜色、混合颜色或理解调整单个RGB分量的影响之类的任务。"
  },
  {
    "id": "44399186",
    "title": "New Process Uses Microbes to Create Valuable Materials from Urine",
    "url": "https://newscenter.lbl.gov/2025/06/17/new-process-uses-microbes-to-create-valuable-materials-from-urine/",
    "summary": "Researchers have developed a novel biomanufacturing process using genetically modified yeast to convert human urine into valuable materials, specifically hydroxyapatite, a mineral used in bone and teeth repair, as well as potentially as a building material and plastic replacement. The modified yeast, dubbed \"osteoyeast,\" mimics bone-building cells and efficiently extracts calcium and phosphorus from urine to create high-quality hydroxyapatite.\n\nThis process offers several potential benefits: a cost-effective production method for hydroxyapatite, a practical way to reduce wastewater treatment costs by utilizing urine components, and an energy-efficient means of producing fertilizer by capturing ammonia. Technoeconomic analysis suggests that a large-scale system could be profitable, generating revenue while reducing wastewater treatment expenses.\n\nThe researchers used advanced microscopy techniques to confirm that the osteoyeast successfully performed all steps of hydroxyapatite production within the cells. The technology is available for licensing, and the team is exploring the development of new yeast strains for synthesizing other bio-based materials and extracting specific elements for bio-mining, presenting significant potential for diverse applications. The collaborative effort involved researchers from Lawrence Berkeley National Laboratory, UC Irvine, and the University of Illinois Urbana-Champaign, highlighting the importance of interdisciplinary approaches in scientific innovation.\n",
    "chinese_title": "利用微生物从尿液中创造有价值的新材料",
    "chinese_summary": "研究人员开发了一种新型生物制造工艺，利用基因改造酵母将人类尿液转化为有价值的材料，特别是羟基磷灰石——一种用于骨骼和牙齿修复的矿物质，并可能用作建筑材料和塑料替代品。这种被称为“骨酵母”的改良酵母模仿成骨细胞，有效地从尿液中提取钙和磷，从而产生高质量的羟基磷灰石。\n\n该工艺具有多种潜在优势：一种经济高效的羟基磷灰石生产方法，一种通过利用尿液成分来降低废水处理成本的实用方法，以及一种通过捕获氨来节能生产肥料的方法。技术经济分析表明，大规模系统可能有利可图，在减少废水处理费用的同时产生收入。\n\n研究人员使用先进的显微镜技术证实了骨酵母成功地在细胞内完成了羟基磷灰石生产的所有步骤。该技术可供许可，该团队正在探索开发新的酵母菌株，用于合成其他生物基材料和提取特定元素用于生物采矿，这为各种应用提供了巨大的潜力。这项合作汇集了劳伦斯伯克利国家实验室、加州大学欧文分校和伊利诺伊大学厄巴纳-香槟分校的研究人员，突显了跨学科方法在科学创新中的重要性。"
  },
  {
    "id": "44400698",
    "title": "Theoretical Analysis of Positional Encodings in Transformer Models",
    "url": "https://arxiv.org/abs/2506.06398",
    "summary": "This paper, titled \"Theoretical Analysis of Positional Encodings in Transformer Models: Impact on Expressiveness and Generalization,\" by Yin Li, presents a theoretical framework for analyzing different positional encoding methods within Transformer models. It investigates the impact of sinusoidal, learned, relative, and bias-based encodings (like ALiBi) on expressiveness (function approximation), generalization ability (using Rademacher complexity), and extrapolation to longer sequences.\n\nThe paper introduces new encoding methods based on orthogonal functions, such as wavelets and Legendre polynomials, and extends the theoretical understanding of ALiBi's biasing approach. The core contribution is providing a unified theoretical context for understanding positional encodings and their impact on Transformer performance.\n\nExperimental evaluation on synthetic sequence-to-sequence tasks demonstrates that the proposed orthogonal transform-based encodings outperform traditional sinusoidal encodings in terms of generalization and extrapolation. The research addresses a significant gap in transformer theory, offering valuable insights for designing and selecting positional encodings in various applications, including NLP and computer vision. The paper is classified under Machine Learning and Artificial Intelligence and employs mathematical analysis techniques.\n",
    "chinese_title": "Transformer模型中位置编码的理论分析",
    "chinese_summary": "尹礼的论文《Transformer模型中位置编码的理论分析：对表达性和泛化性的影响》提出了一种理论框架，用于分析Transformer模型中不同的位置编码方法。该论文研究了正弦、学习、相对和基于偏差的编码（如ALiBi）对表达性（函数逼近）、泛化能力（使用Rademacher复杂度）以及外推到更长序列的影响。\n\n该论文引入了基于正交函数的新编码方法，如小波和勒让德多项式，并扩展了对ALiBi偏差方法的理论理解。核心贡献是为理解位置编码及其对Transformer性能的影响提供了一个统一的理论背景。\n\n在合成序列到序列任务上的实验评估表明，所提出的基于正交变换的编码在泛化性和外推方面优于传统的正弦编码。该研究弥补了Transformer理论中的一个重要空白，为在各种应用（包括NLP和计算机视觉）中设计和选择位置编码提供了有价值的见解。该论文属于机器学习和人工智能领域，并采用了数学分析技术。"
  },
  {
    "id": "44356456",
    "title": "Sailing the fjords like the Vikings yields unexpected insights",
    "url": "https://arstechnica.com/science/2025/06/this-archaeologist-built-a-replica-boat-to-sail-like-the-vikings/",
    "summary": "Archaeologist Greer Jarrett is using experimental archaeology to understand Viking seafaring by sailing replica Viking boats along known trade routes. This hands-on approach has allowed him to learn about the boats' capabilities and identify potential Viking havens along the Norwegian coast.\n\nJarrett and his crew used replicas of traditional Norwegian boats to sail over 5,000 kilometers, experiencing the conditions faced by Viking sailors. This led to the discovery of four potential havens located further out to sea than previously known ports. Jarrett argues these havens were part of a decentralized network crucial for Viking trade and travel.\n\nHis research challenges the assumption that Vikings needed sophisticated navigational tools like compasses, suggesting they relied on \"mental maps\" based on experience and oral tradition. Jarrett identified criteria for potential havens, including accessibility in low visibility, sufficient size for multiple vessels, protection from the sea, and access to fresh water.\n\nWhile some colleagues criticize using later boat designs, Jarrett defends his choice, arguing that the construction techniques and performance characteristics are similar enough for studying Viking-era voyages. He emphasizes the importance of hands-on experience in understanding the seaworthiness of the boats and the collaborative nature of Viking seafaring, which fostered strong social bonds. The next step is to excavate these potential havens for physical evidence of jetties, mooring posts, and ship repair materials.\n",
    "chinese_title": "像维京人一样航行于峡湾，收获意想不到的洞见。",
    "chinese_summary": "考古学家格里尔·贾勒特正在利用实验考古学，通过驾驶复制的维京船只沿已知贸易路线航行，来了解维京航海。这种实践方法使他能够了解船只的性能，并确定挪威沿岸潜在的维京避风港。\n\n贾勒特和他的船员使用传统挪威船只的复制品航行了超过5000公里，体验了维京水手所面临的状况。这导致发现了四个潜在的避风港，这些避风港的位置比之前已知的港口更靠近大海。贾勒特认为，这些避风港是维京贸易和旅行至关重要的分散式网络的一部分。\n\n他的研究挑战了维京人需要指南针等复杂导航工具的假设，表明他们依赖于基于经验和口头传统的“心理地图”。贾勒特确定了潜在避风港的标准，包括在低能见度下的可达性、足够容纳多艘船只的尺寸、免受海洋侵蚀的保护以及淡水的获取。\n\n虽然一些同事批评使用较晚期的船只设计，但贾勒特为自己的选择辩护，认为其建造技术和性能特征足够相似，可以用于研究维京时代的航行。他强调了实践经验在理解船只的适航性以及维京航海的协作性质（这种协作培养了强大的社会关系）方面的重要性。下一步是挖掘这些潜在的避风港，以寻找码头、系泊柱和船舶修理材料等实物证据。"
  },
  {
    "id": "44404601",
    "title": "Antitrust defies politics' law of gravity",
    "url": "https://pluralistic.net/2025/06/28/mamdani/#trustbusting",
    "summary": "Cory Doctorow's article \"Antitrust defies politics' law of gravity\" explores the surprising global surge in antitrust enforcement, defying the established political science theory that the wealthy elite dictate policy outcomes. Doctorow cites a 2014 study showing the overwhelming influence of money in shaping US policy, leading him to believe that grassroots efforts were futile.\n\nHowever, he notes a recent wave of antitrust actions worldwide, including in the EU, Australia, Canada, Japan, South Korea, and even China, targeting tech giants. This trend is unexpected because antitrust measures directly challenge the wealth and power of the billionaire class. He questions why this is occurring.\n\nDoctorow attributes this anomaly to a widespread public discontent with a system perceived as catering solely to the wealthy. He points to examples like Occupy, Bernie Sanders' campaigns, and the Women's March as manifestations of this frustration, which, while often suppressed by centrist forces, fuels an underlying political energy.\n\nHe argues that even the right-wing's focus on radical change reflects this desire for systemic disruption. He concludes by stating that, though the influence of the wealthy and powerful is undeniable, it is not immutable. Doctorow points to the recent primary election win of Zohran Mamdani and his own involvement in the Green Party as evidence of this. Ultimately, Doctorow believes that because the current state of affairs is not popular, it is therefore unsustainable.\n",
    "chinese_title": "反垄断逆势而行",
    "chinese_summary": "科里·多克托罗的文章《反垄断反抗政治的万有引力定律》探讨了反垄断执法在全球范围内令人惊讶的 surge，它违背了既定的政治科学理论，即富有精英阶层决定政策结果。多克托罗引用了一项2014年的研究，该研究表明金钱对美国政策的影响是压倒性的，这使他相信基层努力是徒劳的。\n\n然而，他注意到近期全球范围内出现了一波反垄断行动，包括欧盟、澳大利亚、加拿大、日本、韩国，甚至中国，目标直指科技巨头。这种趋势出乎意料，因为反垄断措施直接挑战了亿万富翁阶层的财富和权力。他质疑为什么会发生这种情况。\n\n多克托罗将这种异常现象归因于公众对一个被认为只迎合富人的体系普遍不满。他指出，“占领华尔街”、“伯尼·桑德斯”的竞选活动和“妇女大游行”等例子都体现了这种挫败感，虽然这些活动经常受到中间派力量的压制，但却激发了潜在的政治能量。\n\n他认为，即使是右翼对激进变革的关注也反映了对系统性颠覆的渴望。他最后表示，虽然富有和有权势的人的影响力是不可否认的，但它并非一成不变。多克托罗指出，佐兰·马姆达尼在最近的初选中获胜以及他自己参与绿党活动就是这方面的证据。最终，多克托罗认为，因为现状并不受欢迎，所以它注定是不可持续的。"
  },
  {
    "id": "44394051",
    "title": "Show HN: Sink – Sync any directory with any device on your local network",
    "url": "https://github.com/sirbread/sink",
    "summary": "Sink is a local network file synchronization tool written in Python designed to avoid cloud services, email, or flash drives. It automatically discovers other Sink instances on the network, allowing users to select trusted devices for synchronization. It monitors for file changes and syncs them almost instantly, handling conflicts by creating a \".sink_conflicts\" folder to store conflicting versions. Users can exclude specific files or directories from synchronization using a \".sinkignore\" file, similar to \".gitignore.\"\n\nTo use Sink, clone the repository, install the requirements, and run \"main.py.\" Synchronization occurs within a \"sync\" folder in the same directory as \"main.py.\" Currently, the tool is designed for syncing between two Windows machines.\n\nThe author plans to add several features, prioritized as follows: support for meshing with more than 2 devices (priority 1), delta sync (maybe?) (priority 2), system tray integration (priority 3), a user interface (priority 4), and custom path selection (priority 5). The author initially created Sink to sync files on a locked-down school laptop.\n",
    "chinese_title": "Show HN: Sink – 在本地网络中同步任何目录到任何设备",
    "chinese_summary": "Sink 是一个用 Python 编写的本地网络文件同步工具，旨在避免使用云服务、电子邮件或闪存盘。它会自动发现网络上的其他 Sink 实例，允许用户选择信任的设备进行同步。它会监控文件更改并几乎立即同步，并通过创建一个“.sink_conflicts”文件夹来存储冲突版本，从而处理冲突。用户可以使用“.sinkignore”文件（类似于“.gitignore”）从同步中排除特定文件或目录。\n\n要使用 Sink，请克隆存储库，安装所需组件，然后运行“main.py”。同步发生在与“main.py”相同目录下的“sync”文件夹中。目前，该工具旨在在两台 Windows 机器之间进行同步。\n\n作者计划添加以下几个功能，优先级如下：支持与 2 个以上设备进行网状连接（优先级 1），增量同步（可能？）（优先级 2），系统托盘集成（优先级 3），用户界面（优先级 4）以及自定义路径选择（优先级 5）。作者最初创建 Sink 是为了同步一台被锁定的学校笔记本电脑上的文件。"
  },
  {
    "id": "44380500",
    "title": "New projects contribute to digital commons",
    "url": "https://nlnet.nl/news/2025/20250624-announcement-grants-CommonsFund.html",
    "summary": "This NLnet Foundation article announces 62 new projects funded by the NGI Zero Commons Fund, all contributing to the digital commons and a more open, trustworthy, and resilient internet. These projects encompass diverse areas, from browser-based cellular networking and quantum-safe cryptography to decentralized social media and open hardware microscopes.\n\nSeveral projects focus on strengthening open hardware and trustworthy manufacturing, including advancements in open hardware security keys (Nitrokey), energy consumption analysis tools (OpenEPT), and open-source microscopes for telepathology (OpenFlexure). There's also a strong emphasis on libre silicon and trustworthy hardware, including chip design toolchains, CPU designs with proof against Spectre-style bugs, and pad cell generators. Collaborative design tools for programmable PCBs and CAD models are also highlighted.\n\nBeyond hardware, the projects support decentralized social media through ActivityPub standard improvements and modern typesetting tools for print media. The article emphasizes the breadth of contributions, mentioning projects working on compilers, wifi mapping, P2P mesh networks, cross-language symbolic execution, and tools for tracking online service terms and consumer product prices.\n\nThe article also addresses applicants who weren't selected, clarifying the application review process and how to identify the call round applied to. The article provides descriptions and links to each of the 62 funded projects.\n",
    "chinese_title": "新项目助力数字共享。",
    "chinese_summary": "荷兰网络基金会宣布 NGI Zero Commons 基金资助 62 个新项目，所有项目均致力于数字共享资源以及更开放、可信和有韧性的互联网。这些项目涵盖领域广泛，从基于浏览器的蜂窝网络和量子安全密码学，到去中心化社交媒体和开放硬件显微镜。\n\n多个项目侧重于加强开放硬件和可信制造，包括开放硬件安全密钥 (Nitrokey)、能耗分析工具 (OpenEPT) 和用于远程病理学的开源显微镜 (OpenFlexure) 的改进。此外，还特别强调自由硅和可信硬件，包括芯片设计工具链、具有 Spectre 风格漏洞防护的 CPU 设计以及焊盘单元生成器。用于可编程 PCB 和 CAD 模型的协作设计工具也得到重点介绍。\n\n除了硬件之外，这些项目还通过 ActivityPub 标准改进和用于印刷媒体的现代排版工具来支持去中心化社交媒体。文章强调了贡献的广泛性，提到了从事编译器、WiFi 测绘、P2P 网状网络、跨语言符号执行以及用于跟踪在线服务条款和消费品价格的工具的项目。\n\n文章还向未被选中的申请人说明了申请审查流程以及如何确定所申请的轮次。文章提供了对 62 个资助项目的描述和链接。"
  },
  {
    "id": "44400697",
    "title": "Rust in the Linux kernel: part 2",
    "url": "https://lwn.net/SubscriberLink/1025232/fbb2d90d084368e3/",
    "summary": "This LWN.net article, \"How to write Rust in the kernel: part 2,\" delves into the specifics of implementing a simple PHY driver in Rust for the Linux kernel, contrasting it with the equivalent C implementation. Using the Asix AX88796B Ethernet controller driver as a case study, the article highlights differences in syntax, types, and APIs.\n\nIt explains the use of `use` statements for importing kernel modules, analogous to `#include` in C, and how the `kernel::prelude` module provides replacements for standard library functions unavailable in the kernel. The article emphasizes the use of the `kernel::module_phy_driver!` macro, which handles module setup and device table creation, similar to `module_phy_driver()` in C.\n\nThe article introduces Rust's `const` and `let` keywords for defining constants and variables, respectively, noting the mandatory type declaration for `const`. It elaborates on Rust functions, their default private visibility (unlike C), and the use of `&mut` references for safe mutable access. The concept of `Result` and the try operator `?` are explained for handling potential errors, simplifying error propagation compared to C.\n\nThe article showcases how Rust traits and `impl` blocks, combined with the `#[vtable]` macro, provide a type-safe and organized way to define driver functionality, converting traits into C structures with function pointers, allowing the integration of rust and C. It concludes by summarizing the key differences between implementing PHY drivers in C and Rust, highlighting the structural advantages of Rust.\n",
    "chinese_title": "Linux内核中的Rust：第二部分",
    "chinese_summary": "如何在内核中用 Rust 编写代码：第二部分\n\n这篇 LWN.net 文章“如何在内核中用 Rust 编写代码：第二部分”深入探讨了在 Linux 内核中用 Rust 实现一个简单 PHY 驱动程序的细节，并将其与等效的 C 实现进行了对比。文章以 Asix AX88796B 以太网控制器驱动程序为例，突出了语法、类型和 API 的差异。\n\n文章解释了使用 `use` 语句导入内核模块，类似于 C 中的 `#include`，以及 `kernel::prelude` 模块如何为内核中不可用的标准库函数提供替代品。文章强调了 `kernel::module_phy_driver!` 宏的使用，该宏处理模块设置和设备表创建，类似于 C 中的 `module_phy_driver()`。\n\n文章介绍了 Rust 的 `const` 和 `let` 关键字，分别用于定义常量和变量，并指出 `const` 必须进行类型声明。它详细阐述了 Rust 函数，它们的默认私有可见性（与 C 不同），以及使用 `&mut` 引用来实现安全的可变访问。文章解释了 `Result` 的概念和 try 运算符 `?`，用于处理潜在的错误，与 C 相比，简化了错误传播。\n\n文章展示了 Rust 特征（traits）和 `impl` 块，结合 `#[vtable]` 宏，如何提供一种类型安全且有组织的方式来定义驱动程序功能，将特征转换为带有函数指针的 C 结构体，从而允许 Rust 和 C 的集成。文章最后总结了用 C 和 Rust 实现 PHY 驱动程序之间的关键区别，突出了 Rust 的结构优势。"
  },
  {
    "id": "44390488",
    "title": "Why is the Rust compiler so slow?",
    "url": "https://sharnoff.io/blog/why-rust-compiler-slow",
    "summary": "This article details the author's investigation into the slow compilation times of their Rust website within Docker containers. Initially, building the statically linked binary from scratch took about 4 minutes per change. Using `cargo-chef` improved caching, but the final binary compilation still took around 2 minutes 50 seconds.\n\nThe author then used `cargo --timings` and `rustc's self-profiling feature (-Zself-profile)` to pinpoint the bottleneck.  These tools revealed that Link-Time Optimization (LTO) and `LLVM_module_codegen_emit_obj` were the primary culprits.\n\nExploring LTO options (off, thin, fat), the author found that disabling LTO significantly reduced compilation time to around 50 seconds. Debug symbols also contributed to the build time. Despite the improvement, the author further investigated the remaining 50-second delay, identifying `LLVM_module_optimize` as the primary consumer.\n\nThey experimented with reducing the `opt-level` for the final binary while maintaining optimizations for dependencies.  Reducing `opt-level` to 0 dramatically reduced build time to under 15 seconds, albeit at the cost of a larger binary size. Finally, setting codegen-units = 1 sped things up further to around 9 seconds.\n",
    "chinese_title": "Rust 编译器为什么这么慢？",
    "chinese_summary": "本文详细介绍了作者对 Docker 容器中 Rust 网站编译速度缓慢问题的调查。最初，从头开始构建静态链接的二进制文件每次更改大约需要 4 分钟。使用 `cargo-chef` 改进了缓存，但最终的二进制文件编译仍然需要大约 2 分 50 秒。\n\n然后，作者使用 `cargo --timings` 和 `rustc 的 self-profiling 功能（-Zself-profile)` 来确定瓶颈。这些工具表明，链接时优化 (LTO) 和 `LLVM_module_codegen_emit_obj` 是主要原因。\n\n在探索 LTO 选项（off、thin、fat）后，作者发现禁用 LTO 可以显著减少编译时间到大约 50 秒。调试符号也增加了构建时间。尽管有所改进，作者进一步调查了剩余的 50 秒延迟，确定 `LLVM_module_optimize` 是主要消耗者。\n\n他们尝试降低最终二进制文件的 `opt-level`，同时保持对依赖项的优化。将 `opt-level` 降低到 0 可以将构建时间显着缩短到 15 秒以下，但代价是二进制文件大小更大。最后，设置 codegen-units = 1 使速度进一步加快到大约 9 秒。"
  },
  {
    "id": "44393942",
    "title": "Parameterized types in C using the new tag compatibility rule",
    "url": "https://nullprogram.com/blog/2025/06/26/",
    "summary": "This article discusses a new feature in C23, implemented in GCC 15 and coming soon to Clang, regarding the compatibility of `struct`, `union`, and `enum` definitions.  Previously, identical definitions of a struct in different translation units (TUs) were considered incompatible. C23 changes this, making such definitions compatible based on matching tags and fields.\n\nThe author explores how this new rule enables a limited form of type parameterization using macros.  They demonstrate this with a `Slice(T)` macro for creating dynamically sized arrays, avoiding the need to predefine `Slice` types for each possible element type `T`. This macro leverages the tag compatibility rule to create compatible slice types on demand.\n\nThe author provides examples of using the `Slice(T)` macro to declare functions and data structures with parameterized slices, such as `Slice(int)`, `Slice(float)`, and `Slice(Str)`.  They also demonstrate how the `push` macro can be used to add elements to these dynamically sized slices.\n\nHowever, the author acknowledges the limitations.  It's impossible to create generic functions operating on these parameterized types, and it's awkward to parameterize types with complex types like `Slice(Slice(float))`.  The macro system restricts parameterization to identifiers, requiring workarounds.\n\nDespite these limitations, the author concludes that the technique is worth investigating, providing a small demo (demo.c) for testing.  They note that while the benefits might be small, it offers a glimpse of what could be achieved with limited type parameterization in C.\n",
    "chinese_title": "使用新标签兼容性规则的C语言参数化类型",
    "chinese_summary": "本文讨论了 C23 中的一项新特性，该特性已在 GCC 15 中实现，并将很快出现在 Clang 中，它涉及 `struct`、`union` 和 `enum` 定义的兼容性。以前，不同翻译单元 (TU) 中相同的结构体定义被认为是不兼容的。C23 改变了这一点，使其基于匹配的标签和字段来兼容这些定义。\n\n作者探讨了这条新规则如何使用宏实现一种有限形式的类型参数化。他们用一个 `Slice(T)` 宏来创建动态大小的数组，避免了为每种可能的元素类型 `T` 预定义 `Slice` 类型的需要，以此来证明这一点。该宏利用标签兼容性规则来按需创建兼容的 slice 类型。\n\n作者提供了使用 `Slice(T)` 宏声明具有参数化 slice 的函数和数据结构的示例，例如 `Slice(int)`、`Slice(float)` 和 `Slice(Str)`。他们还演示了如何使用 `push` 宏将元素添加到这些动态大小的 slice 中。\n\n然而，作者承认了其局限性。不可能创建对这些参数化类型进行操作的泛型函数，并且使用复杂类型（如 `Slice(Slice(float))`）来参数化类型很麻烦。宏系统将参数化限制为标识符，需要一些变通方法。\n\n尽管存在这些局限性，作者总结说这项技术值得研究，并提供了一个用于测试的小演示 (demo.c)。他们指出，虽然好处可能很小，但它让我们看到了在 C 中通过有限的类型参数化可以实现的目标。"
  },
  {
    "id": "44401729",
    "title": "Programming as Theory Building: Why Senior Developers Are More Valuable",
    "url": "https://cekrem.github.io/posts/programming-as-theory-building-naur/",
    "summary": "This article argues that \"programming as theory building\" is crucial for software quality, especially in the age of AI code generation. It highlights Peter Naur's 1985 essay, emphasizing that code is merely a representation of a deeper \"theory\"—a shared mental model encompassing intent, design decisions, and rationale behind a system.\n\nThe article warns of a \"theory-loss crisis\" fueled by reflexive AI usage, where developers copy-paste AI-generated code without understanding the underlying architectural decisions, potentially introducing inconsistencies and violating domain models. The influx of inexperienced developers, armed with powerful AI tools, exacerbates this problem.\n\nSenior developers are presented as critical in mitigating this crisis. They act as:\n\n*   **Domain Theory Builders:** Connecting business needs to software architecture.\n*   **Architectural Theory Guardians:** Ensuring new code aligns with the overall system design.\n*   **Intentional AI Collaborators:** Using AI strategically, understanding its output and challenging its assumptions.\n*   **Theory Teachers and Craft Mentors:** Transferring understanding and problem-solving skills to junior developers.\n\nThe article concludes that organizations must prioritize \"theory preservation\" through documentation, knowledge sharing, rigorous code reviews, and mentorship. While AI can handle repetitive tasks, the core work of building coherent, domain-aware software models requires human understanding and thoughtful decision-making, making senior developers invaluable in maintaining software quality. The most successful teams will be those that recognize the value of senior developers as guardians of software quality by building and maintaing theortical frameworks for their respective teams.\n",
    "chinese_title": "编程即理论构建：为何资深开发者更有价值",
    "chinese_summary": "本文认为，“编程即理论构建”对于软件质量至关重要，尤其是在AI代码生成时代。它强调了彼得·诺尔1985年的文章，指出代码仅仅是一种更深层次“理论”的体现——一种涵盖意图、设计决策以及系统背后原理的共享思维模型。\n\n文章警告称，盲目使用AI会引发“理论缺失危机”，开发者复制粘贴AI生成的代码而不理解其底层架构决策，可能导致不一致性并违反领域模型。大量涌入的、装备着强大AI工具的经验不足的开发者，加剧了这一问题。\n\n资深开发者被认为是缓解这一危机的关键。他们的作用如下：\n\n*   **领域理论构建者：** 将业务需求与软件架构相连接。\n*   **架构理论守护者：** 确保新代码与整体系统设计相一致。\n*   **有意图的AI合作者：** 战略性地使用AI，理解其输出并挑战其假设。\n*   **理论教师和技艺导师：** 将理解和问题解决技能传授给初级开发者。\n\n文章总结认为，组织必须通过文档、知识共享、严格的代码审查和指导来优先考虑“理论保存”。虽然AI可以处理重复性任务，但构建连贯的、领域感知的软件模型的核心工作需要人类的理解和深思熟虑的决策，这使得资深开发者在维护软件质量方面具有不可估量的价值。最成功的团队将是那些认识到资深开发者作为软件质量守护者，通过为其各自团队构建和维护理论框架的价值的团队。"
  },
  {
    "id": "44394386",
    "title": "PJ5 TTL CPU",
    "url": "https://pj5cpu.wordpress.com/",
    "summary": "The PJ5 TTL CPU project has made progress, successfully running Conway's Game of Life and a Mandelbrot generator on its display. However, challenges remain with display speed and memory corruption. Sending data to the display faster than 500 KHz results in errors, potentially due to the long ribbon cable. To mitigate this, the CPU uses speed switching, performing calculations at 2 MIPS and then slowing down to 500 KIPS for display writes. Running calculations at 4 MIPS significantly increases RAM corruption.\n\nA second set of main boards has been built and tested, paving the way for having two functional CPUs. Attention is now focused on reworking the bus board, clock, and code memory boards. Planning for peripheral development has also begun.\n",
    "chinese_title": "PJ5 TTL CPU",
    "chinese_summary": "PJ5 TTL CPU项目进展：成功运行生命游戏和曼德布罗集生成器，但显示速度和内存损坏仍是挑战。高于500KHz的显示数据传输会导致错误，可能源于长排线。为此，CPU采用速度切换，以2 MIPS进行计算，然后降速至500 KIPS进行显示写入。4 MIPS下的计算会显著增加RAM损坏。\n\n第二套主板已完成构建和测试，为拥有两台可运行的CPU铺平了道路。目前，工作重点在于重新设计总线板、时钟和代码存储器板。外设开发的规划也已启动。"
  },
  {
    "id": "44404264",
    "title": "Crims taking advantage of the ridiculously complex US healthcare billing system",
    "url": "https://www.theregister.com/2025/06/27/patients_providers_records_payment_scam/",
    "summary": "生成摘要时出错",
    "chinese_title": "Crims taking advantage of the ridiculously complex US healthcare billing system",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44403639",
    "title": "Finding Peter Putnam: The forgotten janitor who discovered the logic of the mind",
    "url": "https://nautil.us/finding-peter-putnam-1218035/",
    "summary": "生成摘要时出错",
    "chinese_title": "Finding Peter Putnam: The forgotten janitor who discovered the logic of the mind",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44394929",
    "title": "Show HN: Zenta – Mindfulness for Terminal Users",
    "url": "https://github.com/e6a5/zenta",
    "summary": "生成摘要时出错",
    "chinese_title": "Show HN: Zenta – Mindfulness for Terminal Users",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44403841",
    "title": "Swarms of robots could go up your nose, melt the mucus and clean your sinuses",
    "url": "https://www.zmescience.com/future/swarms-of-tiny-robots-could-go-up-your-nose-melt-the-mucus-and-clean-your-sinuses/",
    "summary": "生成摘要时出错",
    "chinese_title": "Swarms of robots could go up your nose, melt the mucus and clean your sinuses",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44405040",
    "title": "The Epic Verse calculus: a core calculus for functional logic programming",
    "url": "https://simon.peytonjones.org/verse-calculus/",
    "summary": "生成摘要时出错",
    "chinese_title": "The Epic Verse calculus: a core calculus for functional logic programming",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44404999",
    "title": "The Coming Storm: How Mediterranean Water Collapse Could Reshape Britain",
    "url": "https://fromtheprism.com/mediterranean-water-crisis-britain.html",
    "summary": "生成摘要时出错",
    "chinese_title": "The Coming Storm: How Mediterranean Water Collapse Could Reshape Britain",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44392776",
    "title": "Slightly better named character reference tokenization than Chrome, Safari, FF",
    "url": "https://www.ryanliptak.com/blog/better-named-character-reference-tokenization/",
    "summary": "生成摘要时出错",
    "chinese_title": "Slightly better named character reference tokenization than Chrome, Safari, FF",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44362628",
    "title": "A New Kind of Computer (April 2025)",
    "url": "https://lightmatter.co/blog/a-new-kind-of-computer/",
    "summary": "生成摘要时出错",
    "chinese_title": "A New Kind of Computer (April 2025)",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44403295",
    "title": "Missing Heritability: Much More Than You Wanted to Know",
    "url": "https://www.astralcodexten.com/p/missing-heritability-much-more-than",
    "summary": "生成摘要时出错",
    "chinese_title": "Missing Heritability: Much More Than You Wanted to Know",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44363804",
    "title": "Does a Focus on Royalty Obscure British History?",
    "url": "https://www.historytoday.com/archive/head-head/does-focus-royalty-obscure-british-history",
    "summary": "生成摘要时出错",
    "chinese_title": "Does a Focus on Royalty Obscure British History?",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44365404",
    "title": "Glass nanostructures reflect nearly all visible light, challenging assumptions",
    "url": "https://phys.org/news/2025-06-glass-nanostructures-visible-photonics-assumptions.html",
    "summary": "生成摘要时出错",
    "chinese_title": "Glass nanostructures reflect nearly all visible light, challenging assumptions",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44403087",
    "title": "Show HN: Reactylon – Open-source framework for building 3D/XR apps with React",
    "url": "https://github.com/simonedevit/reactylon",
    "summary": "生成摘要时出错",
    "chinese_title": "Show HN: Reactylon – Open-source framework for building 3D/XR apps with React",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44395799",
    "title": "My Lights Run on Bash",
    "url": "https://kramkow.ski/article/2025/06/27/my_lights_run_on_bash.html",
    "summary": "生成摘要时出错",
    "chinese_title": "My Lights Run on Bash",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44393817",
    "title": "XSLT – Native, zero-config build system for the Web",
    "url": "https://github.com/pacocoursey/xslt",
    "summary": "生成摘要时出错",
    "chinese_title": "XSLT – Native, zero-config build system for the Web",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44361288",
    "title": "I Switched from Flutter and Rust to Rust and Egui",
    "url": "https://jdiaz97.github.io/greenblog/posts/flutter_to_egui/",
    "summary": "生成摘要时出错",
    "chinese_title": "I Switched from Flutter and Rust to Rust and Egui",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44400440",
    "title": "The Journey of Bypassing Ubuntu's Unprivileged Namespace Restriction",
    "url": "https://u1f383.github.io/linux/2025/06/26/the-journey-of-bypassing-ubuntus-unprivileged-namespace-restriction.html",
    "summary": "生成摘要时出错",
    "chinese_title": "The Journey of Bypassing Ubuntu's Unprivileged Namespace Restriction",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44359454",
    "title": "A Lisp adventure on the calm waters of the dead C (2021)",
    "url": "https://mihaiolteanu.me/language-abstractions",
    "summary": "生成摘要时出错",
    "chinese_title": "A Lisp adventure on the calm waters of the dead C (2021)",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44356385",
    "title": "How much slower is random access, really?",
    "url": "https://samestep.com/blog/random-access/",
    "summary": "生成摘要时出错",
    "chinese_title": "How much slower is random access, really?",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44397923",
    "title": "Project Vend: Can Claude run a small shop? (And why does that matter?)",
    "url": "https://www.anthropic.com/research/project-vend-1",
    "summary": "生成摘要时出错",
    "chinese_title": "Project Vend: Can Claude run a small shop? (And why does that matter?)",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44395782",
    "title": "Copilot Chat in VS Code is now open source",
    "url": "https://github.com/microsoft/vscode-copilot-chat",
    "summary": "生成摘要时出错",
    "chinese_title": "Copilot Chat in VS Code is now open source",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44390005",
    "title": "Show HN: Magnitude – Open-source AI browser automation framework",
    "url": "https://github.com/magnitudedev/magnitude",
    "summary": "生成摘要时出错",
    "chinese_title": "Show HN: Magnitude – Open-source AI browser automation framework",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44393160",
    "title": "A lumberjack created more than 200 sculptures in Wisconsin's Northwoods",
    "url": "https://www.smithsonianmag.com/travel/when-a-lumberjacks-imagination-ran-wild-he-created-more-than-200-sculptures-in-wisconsins-northwoods-180986840/",
    "summary": "生成摘要时出错",
    "chinese_title": "A lumberjack created more than 200 sculptures in Wisconsin's Northwoods",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44404231",
    "title": "Texas brothers buy abandoned Boeing 727 for $10k",
    "url": "https://www.popsci.com/diy/texas-brothers-buy-abandoned-boeing-727/",
    "summary": "生成摘要时出错",
    "chinese_title": "Texas brothers buy abandoned Boeing 727 for $10k",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44394201",
    "title": "Blazing Matrix Products",
    "url": "https://panadestein.github.io/blog/posts/mp.html",
    "summary": "生成摘要时出错",
    "chinese_title": "Blazing Matrix Products",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44390501",
    "title": "Alternative Layout System",
    "url": "https://alternativelayoutsystem.com/scripts/#same-sizer",
    "summary": "生成摘要时出错",
    "chinese_title": "Alternative Layout System",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44387659",
    "title": "AlphaGenome: AI for better understanding the genome",
    "url": "https://deepmind.google/discover/blog/alphagenome-ai-for-better-understanding-the-genome/",
    "summary": "生成摘要时出错",
    "chinese_title": "AlphaGenome: AI for better understanding the genome",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44381297",
    "title": "A new pyramid-like shape always lands the same side up",
    "url": "https://www.quantamagazine.org/a-new-pyramid-like-shape-always-lands-the-same-side-up-20250625/",
    "summary": "生成摘要时出错",
    "chinese_title": "A new pyramid-like shape always lands the same side up",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44361681",
    "title": "VA Tech scientists are building a better fog harp",
    "url": "https://arstechnica.com/science/2025/06/these-va-tech-scientists-are-building-a-better-fog-harp/",
    "summary": "生成摘要时出错",
    "chinese_title": "VA Tech scientists are building a better fog harp",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44403110",
    "title": "Saudi Arabia's Role in Slowing Progress in Climate Negotiations",
    "url": "https://cssn.org/decades-of-systematic-obstructionism-saudi-arabias-role-in-slowing-progress-in-un-climate-negotiations/",
    "summary": "生成摘要时出错",
    "chinese_title": "Saudi Arabia's Role in Slowing Progress in Climate Negotiations",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44385742",
    "title": "Apptainer: Application Containers for Linux",
    "url": "https://apptainer.org/",
    "summary": "生成摘要时出错",
    "chinese_title": "Apptainer: Application Containers for Linux",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44398710",
    "title": "US Supreme Court limits federal judges' power to block Trump orders",
    "url": "https://www.theguardian.com/us-news/2025/jun/27/trump-supreme-court-birthright-citizenship-scotus",
    "summary": "生成摘要时出错",
    "chinese_title": "US Supreme Court limits federal judges' power to block Trump orders",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44402985",
    "title": "DR Congo and Rawanda signs a peace deal",
    "url": "https://www.bbc.com/news/articles/c1e0ggw7d43o",
    "summary": "生成摘要时出错",
    "chinese_title": "DR Congo and Rawanda signs a peace deal",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44382834",
    "title": "Puerto Rico's Solar Microgrids Beat Blackout",
    "url": "https://spectrum.ieee.org/puerto-rico-solar-microgrids",
    "summary": "生成摘要时出错",
    "chinese_title": "Puerto Rico's Solar Microgrids Beat Blackout",
    "chinese_summary": "生成摘要时出错"
  }
]