[
  {
    "id": "45618790",
    "title": "The Rapper 50 Cent, Adjusted for Inflation",
    "url": "https://50centadjustedforinflation.com/",
    "summary": "This short \"article\" is a humorous take on inflation using the rapper 50 Cent's name as a base. It calculates what 50 Cent would be worth, in name only, if adjusted for inflation from June 1994 (presumably when the rapper adopted the name) to the present day. The conclusion is that, adjusted for inflation, 50 Cent would be worth 109 Cent. It attributes the calculation and concept to Brian Moore and references the Bureau of Labor Statistics (BLS) as the source for the inflation data. The piece is a simple, lighthearted observation using a well-known figure to illustrate the concept of inflation.\n",
    "chinese_title": "50 Cent：经通货膨胀调整后",
    "chinese_summary": "这篇短文以饶舌歌手50 Cent的名字为基础，幽默地探讨了通货膨胀。它计算了从1994年6月（据推测是这位饶舌歌手采用这个名字的时间）至今，若按照通货膨胀调整，50 Cent（仅指名字）的价值。结论是，经通货膨胀调整后，50 Cent价值109 Cent。文章将计算和概念归功于Brian Moore，并参考了美国劳工统计局(BLS)作为通货膨胀数据的来源。这篇文章是一个简单、轻松的观察，利用一个著名人物来阐释通货膨胀的概念。"
  },
  {
    "id": "45615931",
    "title": "Live Stream from the Namib Desert",
    "url": "https://bookofjoe2.blogspot.com/2025/10/live-stream-from-namib-desert.html",
    "summary": "This blog post describes the author's fascination with a live streaming camera focused on a water hole in the Namib Desert, Namibia. The author starts their day by checking the feed, which showcases a diverse array of wildlife coming to hydrate, including zebras, ostriches, oryx, warthogs, wildebeest, jackal, bat-eared fox, spotted hyena, cape hare, red hartebeest, giraffes, springbok, and elephants. Due to the time difference (Namibia being 6 hours ahead of U.S. Eastern Time), the author observes these animals during the hottest part of the day. The author suggests that an elementary school teacher could use this live stream as an educational tool, displaying it on a large screen to expose students to African wildlife in their natural habitat. The post includes sharing options for email and social media platforms, and allows for reader comments.\n",
    "chinese_title": "来自纳米布沙漠的直播",
    "chinese_summary": "这篇博文讲述了作者对纳米比亚纳米布沙漠水坑直播摄像头的迷恋。作者每天开始的第一件事就是查看直播，其中展示了各种各样的野生动物前来饮水，包括斑马、鸵鸟、剑羚、疣猪、角马、胡狼、蝙蝠耳廓狐、斑鬣狗、南非兔、红狷羚、长颈鹿、跳羚和大象。由于时差（纳米比亚比美国东部时间早6个小时），作者在一天中最热的时候观察这些动物。作者建议小学老师可以使用此直播作为一种教育工具，在大屏幕上展示，让学生们了解非洲野生动物的自然栖息地。该帖子包含电子邮件和社交媒体平台的分享选项，并允许读者评论。"
  },
  {
    "id": "45617819",
    "title": "Scientists discover intercellular nanotubular communication system in brain",
    "url": "https://www.science.org/doi/10.1126/science.adr7403",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "科学家发现大脑中细胞间纳米管状通讯系统",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "45615863",
    "title": "Ruby core team takes ownership of RubyGems and Bundler",
    "url": "https://www.ruby-lang.org/en/news/2025/10/17/rubygems-repository-transition/",
    "summary": "In a move to ensure long-term stability and continuity, the Ruby core team, led by Matz, is taking ownership of RubyGems and Bundler, two critical components of the Ruby ecosystem currently managed by Ruby Central. While RubyGems and Bundler have always been bundled with Ruby, their development has historically been external to the core Ruby organization.\n\nThe transition aims to align the development of these essential tools more closely with the core Ruby project. While repository ownership will transfer to the Ruby core team, Ruby Central will continue to manage it jointly.\n\nCrucially, RubyGems and Bundler will remain open source under their current licenses. Existing contributors will retain full copyright and authorship of their code, and the collaborative, community-driven development process will continue unchanged.\n\nMatz emphasizes that this transition is a commitment to the continued health and growth of the Ruby ecosystem and expresses gratitude to Ruby Central for their past stewardship. The Ruby core team looks forward to collaborating with Ruby Central and the broader community to further develop RubyGems and Bundler.\n",
    "chinese_title": "Ruby核心团队接管RubyGems和Bundler",
    "chinese_summary": "为确保长期稳定和延续性，由Matz领导的Ruby核心团队将接管RubyGems和Bundler的所有权，这两个关键的Ruby生态系统组件目前由Ruby Central管理。虽然RubyGems和Bundler一直与Ruby捆绑在一起，但其开发在历史上一直独立于Ruby核心组织。\n\n此次转变旨在使这些重要工具的开发与Ruby核心项目更加紧密地结合。虽然仓库所有权将转移到Ruby核心团队，但Ruby Central将继续共同管理。\n\n至关重要的是，RubyGems和Bundler将继续以其当前许可证保持开源。现有贡献者将保留其代码的完整版权和作者身份，协作的、社区驱动的开发过程将保持不变。\n\nMatz强调，此次转变是对Ruby生态系统持续健康发展的一项承诺，并对Ruby Central过去的管理表示感谢。Ruby核心团队期待与Ruby Central和更广泛的社区合作，进一步开发RubyGems和Bundler。"
  },
  {
    "id": "45615237",
    "title": "EVs are depreciating faster than gas-powered cars",
    "url": "https://restofworld.org/2025/ev-depreciation-blusmart-collapse/",
    "summary": "Electric vehicles are depreciating at a significantly faster rate than gas-powered cars, creating a crisis for both private owners and fleet operators. Several factors contribute to this issue, including uncertainty about battery lifespans, limited data on secondhand EV values, and faster mileage accumulation in fleet vehicles.\n\nThe collapse of BluSmart, an Indian all-electric ride-hailing service, highlights this problem, as its vehicles rapidly lost value. Hertz also reported substantial losses due to plummeting EV values, prompting them to sell off a portion of their Tesla fleet. Older EV models depreciate even faster, particularly in regions like North America, where vast distances and climate sensitivity impact battery performance.\n\nWhile Tesla retains resale value better than newer Chinese brands, favorable policies and extensive charging networks in markets like China, Norway, and Costa Rica support higher resale values.\n\nHowever, solutions are emerging. Battery-as-a-service models are providing predictable costs and stable values for fleet operators. Data on battery health, showing slower deterioration rates than initially expected, is also boosting consumer confidence. Certified pre-owned EV programs and state-of-health reports are facilitating informed decision-making. As the pace of innovation slows and longevity is prioritized, the EV market is expected to readjust in 2026, potentially leading to more stable resale values.\n",
    "chinese_title": "电动汽车贬值速度快于燃油车",
    "chinese_summary": "电动汽车的贬值速度远快于燃油车，给私人车主和车队运营商都带来了危机。电池寿命的不确定性、二手电动汽车价值数据的匮乏以及车队车辆更快的里程累积等多种因素导致了这一问题。\n\n印度全电动网约车服务BluSmart的倒闭突显了这个问题，其车辆迅速贬值。赫兹也报告了因电动汽车价值暴跌而造成的重大损失，促使他们出售了部分特斯拉车队。旧款电动汽车贬值速度更快，尤其是在北美等地区，那里广阔的距离和气候敏感性会影响电池性能。\n\n虽然特斯拉比新型中国品牌更能保值，但在中国、挪威和哥斯达黎加等市场，优惠政策和广泛的充电网络支持了更高的转售价值。\n\n然而，解决方案正在涌现。电池即服务模式为车队运营商提供了可预测的成本和稳定的价值。电池健康状况的数据表明电池衰减速度慢于最初预期，这也提振了消费者的信心。认证二手电动汽车计划和健康状况报告正在促进知情决策。随着创新步伐放缓，对车辆寿命的重视，预计电动汽车市场将在2026年进行调整，可能导致更稳定的转售价值。"
  },
  {
    "id": "45613047",
    "title": "Meow.camera",
    "url": "https://meow.camera/",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "喵喵相机",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "45614922",
    "title": "Migrating from AWS to Hetzner",
    "url": "https://digitalsociety.coop/posts/migrating-to-hetzner-cloud/",
    "summary": "DigitalSociety migrated its cloud infrastructure from AWS and DigitalOcean to Hetzner, achieving a 76% cost reduction while tripling their compute capacity. The primary driver for the migration was the high cost of running data-intensive workloads on AWS Fargate, which quickly consumed their startup credits. Faced with escalating bills, they sought a more affordable EU-based provider and settled on Hetzner.\n\nThe new stack consists of Hetzner's ARM shared vCPU cloud servers, block storage, load balancers, and S3-compatible object storage. They adopted Talos Linux for simplified Kubernetes node management and CloudNativePG for robust PostgreSQL database management. Ingress NGINX Controller and ExternalDNS handle HTTP routing and DNS management respectively, with cert-manager providing TLS certificates. The entire infrastructure is codified using Terraform and Helm, with deployments automated through GitHub Actions.\n\nWhile the migration was successful, challenges arose due to differences in network topologies (Hetzner's locations vs. AWS's availability zones) and unexpected complexities in migrating deployment automation scripts from ECS to Kubernetes. They overcame these challenges by opting for a single Hetzner location with placement groups for resilience and using Kustomize to manage configuration. The result is a significantly cheaper and more performant infrastructure for running their SaaS product, tap.\n",
    "chinese_title": "从AWS迁移到Hetzner",
    "chinese_summary": "DigitalSociety迁移云基础设施，从AWS和DigitalOcean迁移到Hetzner，实现了76%的成本降低，同时计算能力提升了三倍。迁移的主要原因是运行在AWS Fargate上的数据密集型工作负载成本过高，迅速消耗了他们的启动资金。面对不断上涨的账单，他们寻求更经济实惠的欧盟供应商，最终选择了Hetzner。\n\n新架构包括Hetzner的ARM共享vCPU云服务器、块存储、负载均衡器和S3兼容对象存储。他们采用了Talos Linux简化Kubernetes节点管理，并采用CloudNativePG实现强大的PostgreSQL数据库管理。Ingress NGINX Controller和ExternalDNS分别处理HTTP路由和DNS管理，cert-manager提供TLS证书。整个基础设施使用Terraform和Helm进行编码，并通过GitHub Actions自动化部署。\n\n虽然迁移是成功的，但由于网络拓扑结构（Hetzner的位置与AWS的可用区）的差异以及将部署自动化脚本从ECS迁移到Kubernetes时出现的意外复杂性，也出现了一些挑战。他们通过选择具有放置组的单个Hetzner位置来实现弹性，并使用Kustomize管理配置，从而克服了这些挑战。最终成果是为运行其SaaS产品tap提供了更经济高效的基础设施。"
  },
  {
    "id": "45617088",
    "title": "You did no fact checking, and I must scream",
    "url": "https://shkspr.mobi/blog/2025/10/i-have-no-facts-and-i-must-scream/",
    "summary": "This article lambastes journalists and media outlets for their failure to fact-check information, leading to the spread of misinformation. The author uses the example of a viral post about the late actress Patricia Routledge, which was riddled with easily disprovable inaccuracies, yet was still published by reputable newspapers like The Independent and The Express.\n\nThe author meticulously dismantles the false claims in the viral post, highlighting errors regarding Routledge's birthday, Tony Award win, and role in \"Keeping Up Appearances.\" They emphasize the simplicity of fact-checking using readily available online tools like reverse image search, Google Books, and social media searches. The author points out that even without professional resources, basic web-sleuthing and common sense could have prevented the publication of false information.\n\nThe author argues that the rush to publish and chase clicks outweighs the importance of accuracy in modern journalism. They criticize the Independent and The Express for relying on a questionable blog source and failing to contact Routledge's agent or conduct basic research. They further cite the BBC's \"Have I Got News For You\" as another example of a professional media outlet broadcasting easily disprovable lies.\n\nThe article concludes by urging readers to take responsibility for stopping the spread of misinformation by fact-checking information before sharing it online, emphasizing that it's a simple task requiring only an internet connection and a curious mind.\n",
    "chinese_title": "你没有做事实核查，我要尖叫了。",
    "chinese_summary": "本文抨击记者和媒体机构未能核实信息，导致虚假信息传播。作者以一篇关于已故女演员帕特里夏·劳特利奇的病毒式帖子为例，该帖子充斥着容易被证伪的不实信息，却仍被《独立报》和《快报》等知名报纸发表。\n\n作者细致地拆穿了这篇病毒式帖子中的虚假信息，突出了关于劳特利奇的生日、托尼奖获奖情况以及在《Keeping Up Appearances》中角色的错误。他们强调了使用诸如反向图像搜索、谷歌图书和社交媒体搜索等唾手可得的在线工具进行事实核查的简易性。作者指出，即使没有专业的资源，基本的网络搜索和常识也本可以避免虚假信息的发布。\n\n作者认为，在现代新闻业中，急于发表和追逐点击量超过了准确性的重要性。他们批评《独立报》和《快报》依赖于一个可疑的博客来源，并且未能联系劳特利奇的经纪人或进行基本的研究。他们还引用了BBC的《Have I Got News For You》作为另一个专业媒体机构传播容易被证伪的谎言的例子。\n\n文章最后敦促读者承担起阻止虚假信息传播的责任，在网上分享信息之前进行事实核查，并强调这是一项简单的任务，只需要互联网连接和一颗好奇心。"
  },
  {
    "id": "45528813",
    "title": "Resizeable Bar Support on the Raspberry Pi",
    "url": "https://www.jeffgeerling.com/blog/2025/resizeable-bar-support-on-raspberry-pi",
    "summary": "This article details the process of enabling Resizable BAR support for Intel Xe GPUs on a Raspberry Pi 5. Resizable BAR allows GPUs to transfer data more efficiently over the PCIe bus. While the Pi's hardware should theoretically support BAR resizing by default, issues arise with Intel's Xe drivers requiring specific configurations.\n\nThe workaround involves manually setting the desired BAR size and configuring the system to accommodate it. This is achieved by blacklisting the Xe driver initially, modifying the `/boot/firmware/cmdline.txt` file to specify the VRAM BAR size (`xe.vram_bar_size=8192` for 8GB), and then manually resizing the BAR using `sysfs` commands. Crucially, a specific Linux patch is also required.\n\nTo automate this process on boot, a systemd unit is created to execute a script that performs the BAR resize and loads the Xe driver. This involves creating `/usr/bin/bar_resize.sh` and `/etc/systemd/system/resize-bar.service` files, then enabling the service.\n\nThe article highlights the progress toward full Intel eGPU support on the Pi, with AMD eGPU support already showing stability.  It also touches on potential limitations encountered when requesting very large BAR sizes, suggesting a relationship with the device's RAM. Finally, it gives a high level overview on how BAR sizes can impact virtualization use cases.\n",
    "chinese_title": "树莓派上的可调整大小的Bar支持",
    "chinese_summary": "本文详细介绍了在树莓派 5 上为 Intel Xe GPU 启用 Resizable BAR 支持的过程。Resizable BAR 允许 GPU 通过 PCIe 总线更有效地传输数据。虽然树莓派的硬件理论上应该默认支持 BAR 大小调整，但 Intel 的 Xe 驱动程序出现问题，需要进行特定配置。\n\n解决方法包括手动设置所需的 BAR 大小并配置系统以适应它。这通过首先禁用 Xe 驱动程序，修改 `/boot/firmware/cmdline.txt` 文件来指定 VRAM BAR 大小（对于 8GB，`xe.vram_bar_size=8192`），然后使用 `sysfs` 命令手动调整 BAR 大小来实现。至关重要的是，还需要一个特定的 Linux 补丁。\n\n为了在启动时自动执行此过程，创建了一个 systemd 单元来执行一个脚本，该脚本执行 BAR 大小调整并加载 Xe 驱动程序。这涉及创建 `/usr/bin/bar_resize.sh` 和 `/etc/systemd/system/resize-bar.service` 文件，然后启用该服务。\n\n本文重点介绍了树莓派上对 Intel eGPU 的全面支持的进展，AMD eGPU 支持已经显示出稳定性。它还涉及请求非常大的 BAR 大小时可能遇到的潜在限制，表明与设备的 RAM 存在关联。最后，它概述了 BAR 大小如何影响虚拟化用例。"
  },
  {
    "id": "45559145",
    "title": "Cartridge Chaos: The Official Nintendo Region Converter and More",
    "url": "https://nicole.express/2025/not-just-for-robert.html",
    "summary": "This article explores several peculiarities found within a collection of NES and Famicom cartridges.\n\nFirst, it examines a copy of the NES game \"Gyromite\" that surprisingly contains an official Nintendo region converter inside the cartridge. This converter allows the use of Famicom game PCBs on the NES, a practice used in early NES releases to quickly build up the game library. The converter doesn't support Famicom's expansion audio and the author notes that these converters are now more of a historical oddity.\n\nNext, the article delves into the \"Super Mario Bros./Duck Hunt/World Class Track Meet\" multicart. The author analyzes the three epoxy blobs on the PCB, deducing that Nintendo combined the MMC1 mapper and the lockout chip into a single blob.\n\nFinally, the article focuses on a damaged Famicom cartridge of \"Kaiketsu Yanchamaru\" (Kid Niki: Radical Ninja). The game exhibits glitches during level loading, which the author suspects is due to a faulty connection related to the Irem TAM-S1 mapper chip (Mapper 97). Through testing and analysis, the author hypothesizes that a data line is intermittently failing, causing incorrect bank switching. Attempts to resolder the components yielded improved, but inconsistent, results. The author notes that \"Gyromite\" isn't the only game that can be found with a cartridge converter, with a number of early NES titles using them.\n",
    "chinese_title": "卡带乱斗：官方任天堂区码转换器及其他",
    "chinese_summary": "本文探讨了一系列 NES 和 Famicom 卡带中发现的几个特殊之处。\n\n首先，它研究了一份 NES 游戏《Gyromite》的拷贝，令人惊讶的是，其中包含一个官方的 Nintendo 区域转换器。这种转换器允许在 NES 上使用 Famicom 游戏 PCB，这是一种早期 NES 发行版中使用的做法，目的是快速构建游戏库。该转换器不支持 Famicom 的扩展音频，作者指出，这些转换器现在更多的是一种历史遗迹。\n\n接下来，本文深入研究了“Super Mario Bros./Duck Hunt/World Class Track Meet”合卡。作者分析了 PCB 上的三个环氧树脂团，推断 Nintendo 将 MMC1 映射器和防盗版芯片组合成了一个环氧树脂团。\n\n最后，本文重点关注一个损坏的 Famicom 卡带《Kaiketsu Yanchamaru》（忍者小子）。游戏在关卡加载期间出现故障，作者怀疑这是由于与 Irem TAM-S1 映射芯片（Mapper 97）相关的连接故障所致。通过测试和分析，作者推测一条数据线间歇性故障，导致不正确的存储体切换。尝试重新焊接组件后，结果有所改善，但不稳定。作者指出，《Gyromite》并非唯一可以找到带有卡带转换器的游戏，许多早期的 NES 游戏也使用了它们。"
  },
  {
    "id": "45617986",
    "title": "Dead or Alive creator Tomonobu Itagaki, 58 passes away",
    "url": "https://www.gamedeveloper.com/design/dead-or-alive-creator-tomonobu-itagaki-has-passed-away-at-58",
    "summary": "Tomonobu Itagaki, the creator of the Dead or Alive series and known for reviving the Ninja Gaiden franchise, has passed away at the age of 58. His death was announced by his family on his Facebook page, where he left a final message reflecting on his life as a series of battles he ultimately won, expressing no regrets despite the trials he faced. He also voiced his disappointment at not being able to share his \"new work\" with his fans.\n\nItagaki began his career at Tecmo in 1992, eventually leading Team Ninja and becoming an executive officer. His career was marked by both success and controversy. He was removed from his executive position in 2006 following sexual harassment accusations (of which he was cleared in court) and later left Tecmo in 2008, suing the company over unpaid bonuses and the president for disparaging remarks. He then formed Valhalla Entertainment, releasing the Wii U exclusive Devil's Third, before eventually founding Itagaki Games in 2021.\n\nKnown for his trademark leather jacket and sunglasses, Itagaki was a prominent figure in the game industry, with peers like Tekken director Katsuhiro Harada mourning his loss. He is survived by his wife and daughter. The article also touches upon Itagaki's complex legacy, mentioning his creative talent alongside instances of inappropriate behavior.\n",
    "chinese_title": "《生死格斗》制作人板垣伴信去世，享年58岁",
    "chinese_summary": "《死或生》系列创作者、复兴《忍者龙剑传》系列的板垣伴信去世，享年58岁。他的家人在他的Facebook页面上宣布了他的死讯，他在页面上留下遗言，将自己的一生比作一场他最终获胜的战斗，尽管历经磨难，但他毫无遗憾。他还表达了未能与粉丝分享他的“新作品”的失望。\n\n板垣伴信于1992年在Tecmo开始了他的职业生涯，最终领导了Team Ninja并成为执行官。他的职业生涯充满了成功和争议。2006年，他因性骚扰指控（后在法庭上被澄清）而被解除执行职务，并于2008年离开Tecmo，起诉该公司未支付奖金以及总裁的诽谤言论。随后，他成立了Valhalla Entertainment，发布了Wii U独占游戏《恶魔三人组》，最终于2021年创立了Itagaki Games。\n\n板垣伴信以其标志性的皮夹克和太阳镜而闻名，是游戏行业中的杰出人物，如《铁拳》导演原田胜弘等同行为他的逝去表示哀悼。他身后留下了妻子和女儿。这篇文章还提到了板垣伴信复杂的遗产，既肯定了他的创作天赋，也提到了不当行为的事件。"
  },
  {
    "id": "45618350",
    "title": "AI has a cargo cult problem",
    "url": "https://www.ft.com/content/f2025ac7-a71f-464f-a3a6-1e39c98612c7",
    "summary": "This is a snippet from the Financial Times advertising subscription options under the headline \"AI has a cargo cult problem.\" The excerpt doesn't contain the actual article content about the supposed \"cargo cult problem\" in AI. Instead, it focuses entirely on prompting readers to subscribe to the Financial Times for access to its journalism.\n\nThe ad presents different subscription tiers:\n\n*   **Standard Digital:** Offers global news, analysis, expert opinion, the FT App, FT Edit, First FT, newsletters, myFT features, FT Videos & Podcasts, and monthly gift articles. Currently discounted.\n*   **Trial:** A 4-week trial for $1, then $75 per month, offering similar benefits as Standard Digital and adding Lex: FT's flagship investment column and Premium newsletters.\n*   **Premium Digital:** Offers complete digital access with added expert analysis from industry leaders. A yearly upfront payment saves 20%.\n*   **FT Digital Edition:** Provides access to the digitized print edition of the FT but does not include access to ft.com or the FT App.\n\nThe ad concludes by promoting FT Professional and highlighting the readership of the Financial Times. In essence, the provided text is a sales pitch designed to convert readers into paying subscribers of the Financial Times.\n",
    "chinese_title": "人工智能有拜货教问题",
    "chinese_summary": "这是一段摘自《金融时报》的广告，标题为“人工智能面临货物崇拜问题”，介绍订阅选项。 该段文字不包含关于人工智能所谓“货物崇拜问题”的实际文章内容，而是完全专注于引导读者订阅《金融时报》以获取其新闻报道。\n\n该广告展示了不同的订阅级别：\n\n*   **标准数字版：** 提供全球新闻、分析、专家观点、《金融时报》App、《金融时报》精简版、First FT、新闻通讯、myFT功能、《金融时报》视频和播客，以及每月赠送文章。 目前有折扣。\n*   **试用：** 为期4周的试用期，费用为1美元，然后每月75美元，提供与标准数字版类似的好处，并增加Lex：《金融时报》的旗舰投资专栏和高级新闻通讯。\n*   **高级数字版：** 提供完整的数字访问权限，并增加行业领导者的专家分析。 每年一次性付款可节省20%。\n*   **《金融时报》数字版：** 提供对《金融时报》数字化印刷版的访问权限，但不包括访问ft.com或《金融时报》App。\n\n该广告最后推广了FT Professional，并强调了《金融时报》的读者群。 本质上，提供的文本是一个旨在将读者转化为《金融时报》付费订阅用户的销售宣传。"
  },
  {
    "id": "45614148",
    "title": "4Chan Lawyer publishes Ofcom correspondence",
    "url": "https://alecmuffett.com/article/117792",
    "summary": "This article discusses the conflict between Ofcom, the UK's communications regulator, and 4Chan, specifically regarding Ofcom's attempt to enforce the Online Safety Act against the American company. Preston Byrne, 4Chan's lawyer, has published their correspondence, highlighting Ofcom's belief that it has the authority to regulate online safety for UK users, even extraterritorially, and penalize non-compliant online service providers.\n\nThe author criticizes Ofcom's stance, arguing it's overreaching and potentially flouts US sovereignty. The author also points out the hypocrisy of Ofcom claiming sovereign immunity while simultaneously asserting jurisdictional powers over a US company. The author fears this will lead to a \"Great Firewall of Britain,\" requiring digital identity for internet access and ultimately being ineffective due to VPNs and the Streisand effect.\n\nThe author believes that regulation is not the answer to protecting British children online, but rather better education and responsible digital citizenship. The article suggests that Ofcom should quietly drop the matter and focus on education instead of escalating the conflict. The article includes links to other coverage of the issue and the original source documents of the correspondence between Preston Byrne and Ofcom.\n",
    "chinese_title": "4chan律师公布英国通讯管理局往来信件",
    "chinese_summary": "本文探讨了英国通信监管机构Ofcom与4Chan之间的冲突，特别是Ofcom试图根据《网络安全法》对这家美国公司采取强制措施一事。4Chan的律师普雷斯顿·伯恩发布了他们的往来信件，突显了Ofcom认为其有权监管英国用户的在线安全，甚至具有域外管辖权，并惩罚不合规的在线服务提供商。\n\n作者批评了Ofcom的立场，认为其过度扩张权力，并可能藐视美国主权。作者还指出，Ofcom一方面声称享有主权豁免权，另一方面又声称对一家美国公司拥有管辖权，这是一种虚伪行为。作者担心这会导致出现“英国防火墙”，要求通过数字身份访问互联网，并最终因VPN和斯特赖效应而失效。\n\n作者认为，监管并非保护英国儿童在线安全的答案，而是更好的教育和负责任的数字公民意识。文章建议Ofcom悄悄放弃此事，专注于教育，而不是升级冲突。文章包含指向其他相关报道以及普雷斯顿·伯恩与Ofcom之间往来信件原始来源文件的链接。"
  },
  {
    "id": "45540398",
    "title": "Let's write a macro in Rust",
    "url": "https://hackeryarn.com/post/rust-macros-1/",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "让我们用 Rust 写一个宏",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "45610226",
    "title": "How I bypassed Amazon's Kindle web DRM",
    "url": "https://blog.pixelmelt.dev/kindle-web-drm/",
    "summary": "This article details how the author reverse-engineered Amazon's Kindle Cloud Reader DRM to download and convert a purchased ebook into a standard EPUB format. Frustrated by the buggy Kindle app and restrictions on offline reading and transferring the book to Calibre, the author decided to circumvent Amazon's protections out of principle.\n\nThe Kindle Cloud Reader delivers book content in a TAR file containing JSON data with obfuscated glyphs instead of plain text. Each glyph is identified by an ID, and the ID-to-character mapping changes every five pages, making a simple substitution cipher impossible. Further complicating matters, the SVG glyphs contain deliberate anti-scraping \"fake font hints,\" and multiple font variants are used.\n\nThe author's solution involved:\n\n1.  **Rendering glyphs as images:** Using `cairosvg` to handle the fake font hints.\n2.  **Generating perceptual hashes:** Creating unique identifiers for each glyph based on its rendered appearance.\n3.  **Building a normalized glyph space:** Mapping all random alphabets to the hash-based IDs.\n4.  **Matching to actual characters:** Using Structural Similarity Index (SSIM) to compare rendered glyphs with characters from the Bookerly TTF font, identifying the closest match.\n\nThis process successfully decoded all characters, allowing the author to reconstruct the book in EPUB format, preserving formatting details like paragraph breaks, text alignment, and styling. The author emphasizes that this method is intended for backing up legally purchased ebooks and acknowledges the effort Amazon put into the obfuscation system.\n",
    "chinese_title": "我是如何绕过亚马逊Kindle网页版DRM的",
    "chinese_summary": "本文详细介绍了作者如何逆向工程亚马逊 Kindle Cloud Reader 的 DRM，从而下载并将购买的电子书转换为标准的 EPUB 格式。由于 Kindle 应用存在缺陷，以及对离线阅读和将书籍传输到 Calibre 的限制感到沮丧，作者出于原则决定绕过亚马逊的保护措施。\n\nKindle Cloud Reader 以 TAR 文件的形式提供书籍内容，其中包含带有混淆字形的 JSON 数据，而不是纯文本。每个字形都由一个 ID 标识，并且 ID 到字符的映射每五页更改一次，使得简单的替换密码成为不可能。 更复杂的是，SVG 字形包含故意的反爬虫“虚假字体提示”，并且使用了多种字体变体。\n\n作者的解决方案包括：\n\n1. **将字形渲染为图像：** 使用 `cairosvg` 来处理虚假字体提示。\n2. **生成感知哈希：** 根据每个字形的渲染外观创建唯一的标识符。\n3. **构建标准化的字形空间：** 将所有随机字母表映射到基于哈希的 ID。\n4. **匹配到实际字符：** 使用结构相似性指标 (SSIM) 将渲染的字形与 Bookerly TTF 字体中的字符进行比较，从而识别最接近的匹配项。\n\n这个过程成功解码了所有字符，使作者能够以 EPUB 格式重建书籍，保留了段落分隔、文本对齐和样式等格式细节。作者强调，这种方法旨在备份合法购买的电子书，并承认亚马逊为混淆系统所做的努力。"
  },
  {
    "id": "45550969",
    "title": "Read your way through Hà Nội",
    "url": "https://vietnamesetypography.com/samples/read-your-way-through-ha-noi/",
    "summary": "This article is a literary guide to Hà Nội, urging readers to explore the city through the lens of Vietnamese literature. It highlights that Hà Nội is not just a city shaped by war, but one rich in history, culture, and poetic tradition.\n\nThe author recommends several books to read before visiting, including \"The Food of Việt Nam\" by Luke Nguyễn, poetry collections by Hồ Xuân Hương and Nguyễn Quang Thiệu, and the novel \"Dumb Luck\" by Vũ Trọng Phụng.  She also suggests exploring books about the city's history like \"Hà Nội: Biography of a City.\"\n\nFurther, she discusses books that explore the darker sides of Vietnamese history like \"The Sorrow of War\" by Bảo Ninh and \"Last Night I Dreamed of Peace,\" the diary of Đặng Thùy Trâm, and short story collections like “The Stars, The Earth, The River” by Lê Minh Khuê. She also suggests the audiobook \"Lanterns Hanging on the Wind,\" a bilingual radio program celebrating Vietnamese poetry, and \"Bronze Drum\".\n\nThe author recommends literary landmarks such as 19/12 Street (Book Street), the Temple of Literature, the Việt Nam Museum of Literature, and bookstores like Tràng Tiền and Thăng Long. She also encourages visiting indie bookstores on Đinh Lễ Street and seeking out banned books on Nguyễn Xí Street. For excursions, she suggests books like \"Beneath Saigon's Chò Nâu,\" and \"The Defiant Muse: Vietnamese Feminist Poems from Antiquity to the Present.\"\n\nFinally, the author emphasizes the importance of using diacritical marks when writing Vietnamese words, as their absence can alter the meaning and diminish the richness of the language.\n",
    "chinese_title": "用阅读的方式游览河内",
    "chinese_summary": "本文是一篇探索河內的文學指南，敦促讀者透過越南文學的視角來探索這座城市。它強調河內不僅僅是一座受戰爭塑造的城市，更是一座擁有豐富歷史、文化和詩歌傳統的城市。\n\n作者建議在前往之前閱讀幾本書，包括盧克·阮的《越南美食》、胡春香和阮光紹的詩集，以及武仲奉的小說《斷命》。她還建議探索關於該市歷史的書籍，如《河內：一座城市的傳記》。\n\n此外，她還討論了一些探索越南歷史陰暗面的書籍，如保寧的《戰爭的悲哀》和鄧翠琛的日記《昨夜我夢見和平》，以及黎明奎的短篇小說集《星星，土地，河流》。她還推薦有聲讀物《掛在風中的燈籠》，這是一個慶祝越南詩歌的雙語廣播節目，以及《銅鼓》。\n\n作者推薦了諸如19/12街（書街）、文廟、越南文學博物館等文學地標，以及像莊錢和昇龍這樣的書店。她還鼓勵參觀丁禮街上的獨立書店，並在阮西街上尋找禁書。對於短途旅行，她建議閱讀諸如《西貢蕉林的下面》和《反抗的繆斯：從古至今的越南女權主義詩歌》。\n\n最後，作者強調在使用越南語單詞時使用音標的重要性，因為它們的缺失會改變含義並削弱語言的豐富性。"
  },
  {
    "id": "45615449",
    "title": "Email bombs exploit lax authentication in Zendesk",
    "url": "https://krebsonsecurity.com/2025/10/email-bombs-exploit-lax-authentication-in-zendesk/",
    "summary": "Cybercriminals are exploiting a widespread lack of authentication within Zendesk, a customer service platform, to launch \"email bombs.\" This involves flooding targeted email inboxes with malicious messages that appear to originate from numerous legitimate Zendesk customer companies, including prominent names like CapCom, Discord, and NordVPN.\n\nThe attack leverages the fact that many Zendesk customers allow anonymous users to submit support requests without prior email verification. Attackers submit bogus tickets using the victim's email address, triggering automated \"ticket creation\" notifications from the Zendesk customer's domain. The content of these messages can be anything the attacker chooses, from threats to insults.\n\nZendesk acknowledges the issue, stating that while they recommend customers verify users before allowing ticket submissions, some opt for anonymous environments for business reasons. They also claim to use rate limits, but these proved insufficient to prevent the email floods.\n\nThe core problem lies in Zendesk customers not validating support request email addresses before sending responses. While this lax approach simplifies customer support, it enables attackers to abuse the system, damaging the sender's reputation through disruptive and malicious email campaigns. Zendesk is now investigating additional preventive measures and advising customers to implement authenticated ticket creation workflows.\n",
    "chinese_title": "Zendesk电子邮件炸弹利用身份验证漏洞",
    "chinese_summary": "网络犯罪分子正在利用Zendesk（一种客户服务平台）中普遍存在的身份验证缺失漏洞，发起“邮件炸弹”攻击。这种攻击涉及用恶意信息淹没目标电子邮件收件箱，这些信息看起来源自众多合法的Zendesk客户公司，包括CapCom、Discord和NordVPN等知名企业。\n\n该攻击利用了许多Zendesk客户允许匿名用户在未经事先电子邮件验证的情况下提交支持请求这一事实。攻击者使用受害者的电子邮件地址提交虚假工单，从而触发来自Zendesk客户域名的自动“工单创建”通知。这些消息的内容可以是攻击者选择的任何内容，从威胁到侮辱。\n\nZendesk承认了这个问题，并表示虽然他们建议客户在允许提交工单之前验证用户身份，但出于商业原因，一些客户选择匿名环境。他们还声称使用了速率限制，但这些措施不足以阻止邮件洪流。\n\n核心问题在于Zendesk客户在发送回复之前未验证支持请求的电子邮件地址。虽然这种宽松的做法简化了客户支持，但也使攻击者能够滥用该系统，通过破坏性和恶意电子邮件活动损害发送者的声誉。Zendesk目前正在调查额外的预防措施，并建议客户实施经过身份验证的工单创建工作流程。"
  },
  {
    "id": "45542245",
    "title": "Trap the Critters with Paint",
    "url": "https://deepanwadhwa.github.io/freeze_trap/",
    "summary": "The text describes a game titled \"Trap the Critters with Paint,\" specifically detailing a mode called \"Freeze Trap.\" The game seems to involve using paint, perhaps in a style reminiscent of Jackson Pollock (referenced as \"Paint Pollock\"), to strategically trap creatures.\n\nPlayers can choose to immediately start a game (\"Start\") or customize their experience (\"Custom\"). The customization options include setting the game time (defaulting to 30 seconds) and the number of paint balls available (defaulting to 2).\n\nThe interface provides standard game controls: \"Back,\" \"Restart,\" and \"Home\" (presumably to return to the main menu). Upon completing a level, players can advance using \"Next Level.\" Failure results in options to \"Try Again\" or \"Return to Menu.\"\n\nIn essence, the game appears to be a puzzle or strategy game where players use limited paint resources within a time limit to trap creatures on a screen.\n",
    "chinese_title": "用颜料捕捉小动物",
    "chinese_summary": "用颜料困住小动物：冰冻陷阱\n\n游戏描述了一款名为“用颜料困住小动物”的游戏，特别详细介绍了名为“冰冻陷阱”的模式。该游戏似乎涉及使用颜料，可能采用类似杰克逊·波洛克（被称为“颜料波洛克”）的风格来策略性地困住生物。\n\n玩家可以选择立即开始游戏（“开始”）或自定义他们的体验（“自定义”）。自定义选项包括设置游戏时间（默认为30秒）和可用颜料球的数量（默认为2个）。\n\n界面提供标准游戏控件：“返回”、“重新开始”和“主页”（可能是返回主菜单）。完成关卡后，玩家可以使用“下一关”来推进。失败会导致出现“重试”或“返回菜单”选项。\n\n本质上，这款游戏似乎是一款益智或策略游戏，玩家需要在时间限制内使用有限的颜料资源来困住屏幕上的生物。"
  },
  {
    "id": "45616944",
    "title": "Metropolis 1998 lets you design every building in an isometric, pixel-art city (2024)",
    "url": "https://arstechnica.com/gaming/2024/08/metropolis-1998-lets-you-design-every-building-in-an-isometric-pixel-art-city/",
    "summary": "\"Metropolis 1998\" is an upcoming isometric, pixel-art city-building game that allows players to design every building in detail, reminiscent of \"The Sims\" but on a city-wide scale. Currently in pre-alpha, a demo is available on Steam and Itch.io, showcasing impressive early features. Players start with a blank field and can choose between SimCity-style zone planning, placing pre-made buildings, or designing individual rooms with customizable details.\n\nWhile still early in development with mechanics not yet tutorialized, the game promises deep customization and management aspects beyond simple zone placement. Planned features include managing specific buildings like hospitals and police stations, addressing issues like traffic and zone demand, and potentially adding elements like visible crime (bank robberies) and even a zombie mode. Post-release aspirations hint at a Sims-like \"live in your own city\" mode.\n\nThe game is being developed by YesBox, a small team working on the project since December 2021. The roadmap includes detailed plans and progress updates, with an Early Access release targeted between Q4 2024 and Q2 2025. The game sets itself apart from titles like \"Cities: Skylines 2\" by focusing on a more human-scale, retro experience with a detailed level of design control, moving away from complex mechanical simulations.\n",
    "chinese_title": "《大都会1998》让你设计等距像素风城市中的每栋建筑（2024）",
    "chinese_summary": "《大都会1998》是一款即将推出的等距视角像素风城市建造游戏，玩家可以详细设计每栋建筑，让人想起“模拟人生”，但规模却是整个城市。目前处于pre-alpha阶段，Steam和Itch.io上提供了一个演示，展示了令人印象深刻的早期功能。玩家从一片空白的土地开始，可以在SimCity风格的区域规划、放置预制建筑或设计具有可定制细节的单个房间之间进行选择。\n\n虽然仍处于开发的早期阶段，并且机制尚未进行教程化，但该游戏承诺提供超出简单区域放置的深度定制和管理方面。计划中的功能包括管理医院和警察局等特定建筑物，解决交通和区域需求等问题，并可能添加可见犯罪（银行抢劫）甚至僵尸模式等元素。发布后的愿景暗示了一种类似“模拟人生”的“居住在你自己的城市”模式。\n\n该游戏由YesBox开发，这是一个自2021年12月以来致力于该项目的小团队。路线图包括详细的计划和进度更新，预计在2024年第四季度至2025年第二季度之间发布抢先体验版。该游戏通过专注于更人性化的、具有详细设计控制级别的复古体验，摆脱了复杂的机械模拟，从而区别于“城市：天际线2”等游戏。"
  },
  {
    "id": "45612987",
    "title": "Next steps for BPF support in the GNU toolchain",
    "url": "https://lwn.net/Articles/1039827/",
    "summary": "This LWN.net article summarizes a discussion from the 2025 GNU Tools Cauldron focusing on improving BPF (Berkeley Packet Filter) support in the GNU toolchain. The goal is to make GCC a viable alternative to LLVM for compiling BPF code.\n\nA key topic was the integration of BTF (BPF Type Format) and CTF (Compact C Type Format). Work is underway to allow `libctf` to handle both, enabling direct BTF creation during kernel builds. Enhancements are needed for user-space compatibility, specifically handling string headers, structure member references in archives, and floating-point data.\n\nThe discussion then shifted to the GCC BPF backend. Alexei Starovoitov emphasized the crucial need for `btf_decl_tag` and `btf_type_tag` attributes in GCC to improve BPF verifier accuracy by reflecting memory annotations like `__rcu` and `__user`. A patch series addressing this was posted shortly after the session.\n\nChallenges in producing verifiable BPF code with GCC were also discussed. The compiler's optimization passes can hinder the verifier's ability to prove code correctness. The idea of a new compiler flag, `-fverifiable`, was proposed to address this, focusing on generating code that passes the verifier. The discussion highlighted the difficulty of selectively disabling optimizations and the importance of balancing optimization with verifiability. A concern was raised that over-reliance on compiler workarounds could reduce pressure to improve the verifier itself.\n",
    "chinese_title": "GNU 工具链中 BPF 支持的下一步",
    "chinese_summary": "LWN.net 撰文总结了 2025 年 GNU 工具研讨会上关于改进 GNU 工具链中 BPF（伯克利包过滤器）支持的讨论。目标是使 GCC 成为编译 BPF 代码时 LLVM 的可行替代方案。\n\n一个关键议题是 BTF（BPF 类型格式）和 CTF（紧凑 C 类型格式）的集成。目前正在进行的工作是允许 `libctf` 处理两者，从而在内核构建期间直接创建 BTF。需要增强用户空间兼容性，特别是处理字符串头、存档中的结构成员引用和浮点数据。\n\n讨论随后转向了 GCC BPF 后端。Alexei Starovoitov 强调了 GCC 中 `btf_decl_tag` 和 `btf_type_tag` 属性的关键需求，以通过反映诸如 `__rcu` 和 `__user` 之类的内存注解来提高 BPF 验证器的准确性。会后不久就发布了一系列解决此问题的补丁。\n\n还讨论了使用 GCC 生成可验证 BPF 代码的挑战。编译器的优化过程可能会妨碍验证器证明代码正确性的能力。有人提出了一种新的编译器标志 `-fverifiable` 来解决这个问题，重点是生成可以通过验证器的代码。讨论强调了有选择地禁用优化的难度以及平衡优化与可验证性的重要性。有人担心过度依赖编译器变通方法可能会减少改进验证器本身的压力。"
  },
  {
    "id": "45617112",
    "title": "Stinkbug Leg Organ Hosts Symbiotic Fungi That Protect Eggs from Parasitic Wasps",
    "url": "https://bioengineer.org/stinkbug-leg-organ-hosts-symbiotic-fungi-that-protect-eggs-from-parasitic-wasps/",
    "summary": "This article presents two unrelated research findings.\n\nThe first finding, highlighted in the title, describes a symbiotic relationship between stinkbugs and fungi. Specifically, the stinkbug's leg organ hosts symbiotic fungi that provide protection for the stinkbug eggs from parasitic wasps. This suggests a fascinating evolutionary adaptation where the stinkbug utilizes fungi as a defensive mechanism against a common threat to its offspring.\n\nThe second, and completely separate, finding reported in the date line is: Codonopsis lanceolata Peel Extract Eases Premenstrual Syndrome. This indicates research has shown that an extract derived from the peel of the *Codonopsis lanceolata* plant, a type of bellflower, may offer relief from the symptoms of Premenstrual Syndrome (PMS).\n\nTherefore, the article covers two distinct areas of scientific research: a symbiotic relationship in insects and a potential herbal remedy for PMS. The connection between the two findings is non-existent, and they appear to have been presented together merely as two recent scientific discoveries.\n",
    "chinese_title": "臭椿象腿部器官寄宿共生真菌，保护卵免受寄生蜂侵害",
    "chinese_summary": "本文介绍了两个不相关的研究发现。\n\n第一个发现，已在标题中强调，描述了椿象与真菌之间的共生关系。具体来说，椿象的腿部器官寄生着共生真菌，这些真菌可以保护椿象卵免受寄生蜂的侵害。这表明了一种引人入胜的进化适应，其中椿象利用真菌作为防御机制来对抗其后代的常见威胁。\n\n第二个，并且完全独立的发现，在日期栏中报告：桔梗皮提取物缓解经前综合症。这表明研究表明，从桔梗皮中提取的提取物可能有助于缓解经前综合症 (PMS) 的症状。\n\n因此，本文涵盖了两个不同的科学研究领域：昆虫中的共生关系和一种潜在的 PMS 草药疗法。这两个发现之间没有任何联系，它们似乎只是作为两个最新的科学发现一起呈现。"
  },
  {
    "id": "45615454",
    "title": "Show HN: OnlyJPG – Client-Side PNG/HEIC/AVIF/PDF/etc to JPG",
    "url": "https://onlyjpg.com",
    "summary": "OnlyJPG is a client-side web application that converts various image formats (PNG, HEIC, AVIF, PDF, etc.) to standard JPGs directly in the user's browser, ensuring privacy as no images are uploaded or stored on a server. Users can drag and drop files or select them to initiate the conversion, and then download the converted images as a ZIP archive.\n\nThe application aims to reduce bandwidth and CO₂e emissions by creating smaller JPG files. It estimates these reductions based on the Sustainable Web Design model, considering data transfer energy and grid carbon intensity. OnlyJPG collects anonymous usage statistics (image totals, bandwidth saved) to demonstrate impact, using IPs for rate-limiting but not storing them with the stats. Users can opt-out of statistics collection.\n\nThe application also estimates downstream savings based on the assumption that a percentage of images are shared and downloaded multiple times.\n\nOnlyJPG is built upon numerous open-source libraries and services, including Jpegli (for JPEG encoding), Emscripten (for WebAssembly compilation), PDF.js (for PDF rasterization), and others for image decoding, UI components, zipping, and statistics. It utilizes various CDNs for delivery and Google Fonts for typography.\n\nThe tool is provided \"as-is\" without warranties, and users are advised to keep backups of their original files. The terms of service prohibit illegal, malicious, or abusive use.\n",
    "chinese_title": "Show HN: OnlyJPG – 客户端 PNG/HEIC/AVIF/PDF 等格式转 JPG",
    "chinese_summary": "OnlyJPG 是一款客户端 Web 应用，可直接在用户浏览器中将各种图像格式（PNG、HEIC、AVIF、PDF 等）转换为标准 JPG，确保隐私安全，因为所有图像都不会上传或存储在服务器上。 用户可以拖放文件或选择文件以启动转换，然后将转换后的图像下载为 ZIP 压缩包。\n\n该应用程序旨在通过创建更小的 JPG 文件来减少带宽和 CO₂e 排放。 它基于可持续 Web 设计模型估算这些减少量，同时考虑数据传输能量和电网碳强度。 OnlyJPG 收集匿名使用统计数据（图像总数、节省的带宽）以展示影响，使用 IP 进行速率限制，但不会将 IP 与统计数据一起存储。 用户可以选择退出统计数据收集。\n\n该应用程序还基于以下假设估算下游节省量：一定比例的图像会被多次共享和下载。\n\nOnlyJPG 构建于众多开源库和服务之上，包括 Jpegli（用于 JPEG 编码）、Emscripten（用于 WebAssembly 编译）、PDF.js（用于 PDF 栅格化）以及其他用于图像解码、UI 组件、压缩和统计的库和服务。 它利用各种 CDN 进行交付，并使用 Google Fonts 进行排版。\n\n该工具按“原样”提供，不提供任何保证，建议用户保留原始文件的备份。 服务条款禁止非法、恶意或滥用行为。"
  },
  {
    "id": "45614713",
    "title": "Amazon’s Ring to partner with Flock",
    "url": "https://techcrunch.com/2025/10/16/amazons-ring-to-partner-with-flock-a-network-of-ai-cameras-used-by-ice-feds-and-police/",
    "summary": "Amazon's Ring is partnering with Flock, a company providing AI-powered surveillance cameras to law enforcement agencies, including ICE, the Secret Service, and the Navy. This partnership will allow agencies using Flock to request footage from Ring doorbell users for investigations and evidence collection.\n\nFlock cameras scan license plates and other identifying information, enabling law enforcement to conduct natural language searches for individuals matching specific descriptions. Concerns have been raised that AI-powered law enforcement technology can exacerbate racial biases.\n\nThe timing of the announcement coincides with a report highlighting ICE and other federal agencies' access to Flock's camera network. The partnership with Ring could significantly expand Flock's access to video footage from millions of additional cameras.\n\nRing's history of security vulnerabilities is also highlighted, referencing a 2023 FTC order for the company to pay $5.8 million due to employees and contractors having unrestricted access to customer videos.\n",
    "chinese_title": "亚马逊Ring将与Flock合作",
    "chinese_summary": "亚马逊的Ring正在与Flock合作，后者是一家向包括ICE、特勤局和海军在内的执法机构提供人工智能监控摄像头的公司。此次合作将允许使用Flock的机构向Ring门铃用户请求录像，用于调查和证据收集。\n\nFlock摄像头扫描车牌和其他识别信息，使执法部门能够使用自然语言搜索匹配特定描述的个人。人们担心人工智能执法的技术可能会加剧种族偏见。\n\n该声明发布之时，恰逢一份报告强调ICE和其他联邦机构可以访问Flock的摄像头网络。与Ring的合作可能会显著扩大Flock对数百万额外摄像头视频的访问权限。\n\nRing的安全漏洞历史也被强调，并提及了2023年联邦贸易委员会（FTC）的命令，该公司因员工和承包商可以无限制地访问客户视频而需支付580万美元的罚款。"
  },
  {
    "id": "45613667",
    "title": "New computer model helps reveal how the brain both adapts and misfires",
    "url": "https://now.tufts.edu/2025/10/16/flight-simulator-brain-reveals-how-we-learn-and-why-minds-sometimes-go-course",
    "summary": "This article discusses a new computer model called CogLinks that simulates brain function to understand how the brain learns, adapts, and sometimes malfunctions in mental health disorders. Developed by Michael Halassa and colleagues, CogLinks mimics real brain cell connections and how the brain assigns value to ambiguous information. This allows researchers to observe how a \"virtual brain\" learns and adapts, bridging the gap between single-cell animal studies and human brain imaging.\n\nA study using CogLinks explored flexible thinking by weakening the connection between the prefrontal cortex and the mediodorsal thalamus. This resulted in slower, habit-driven learning, suggesting this pathway is crucial for adaptability. A companion fMRI study on human volunteers confirmed that the mediodorsal thalamus acts as a \"switchboard\" connecting flexible and habitual learning systems, helping the brain adapt to changing rules.\n\nThe research aims to lay the foundation for \"algorithmic psychiatry,\" where computer models reveal how brain circuit changes lead to mental illness. By identifying biological markers, treatments can be targeted more precisely. The model may also help understand how genetic mutations linked to schizophrenia affect information processing and flexible thinking. Ultimately, CogLinks offers a new tool for understanding the complex interplay between brain structure, function, and mental health.\n",
    "chinese_title": "新型计算机模型揭示大脑如何适应和失灵",
    "chinese_summary": "本文探讨了一种名为CogLinks的新型计算机模型，该模型模拟大脑功能，以了解大脑如何学习、适应以及有时在精神健康障碍中出现功能障碍。CogLinks由Michael Halassa及其同事开发，它模仿真实脑细胞连接以及大脑如何为模糊信息赋值。这使得研究人员能够观察“虚拟大脑”如何学习和适应，从而弥合了单细胞动物研究和人脑成像之间的差距。\n\n一项使用CogLinks的研究通过削弱前额叶皮层和丘脑背内侧之间的连接，探索了灵活思维。这导致了更慢、习惯驱动的学习，表明该通路对于适应性至关重要。一项对人类志愿者进行的配套fMRI研究证实，丘脑背内侧充当“交换机”，连接着灵活和习惯性学习系统，帮助大脑适应不断变化的规则。\n\n该研究旨在为“算法精神病学”奠定基础，其中计算机模型揭示了脑回路变化如何导致精神疾病。通过识别生物标志物，可以更精确地进行治疗。该模型还有助于了解与精神分裂症相关的基因突变如何影响信息处理和灵活思维。最终，CogLinks为理解大脑结构、功能和精神健康之间复杂的相互作用提供了一种新工具。"
  },
  {
    "id": "45547346",
    "title": "Show HN: A large format XY scanning hyperspectral camera",
    "url": "https://www.anfractuosity.com/projects/waverider/",
    "summary": "This \"Show HN\" post details the creation of a large-format XY scanning hyperspectral camera. The author built the camera using a 4x5\" camera, lens, spectrometer attached to a 200um fiber optic cable, and motorized XY stages. The fiber optic cable is moved behind the lens to capture spectral data for each pixel. The stages are controlled by a custom PCB with a Raspberry Pi Pico and TMC2130 drivers, programmed in micropython.\n\nThe author uses the `colour-science.org` Python library to convert the spectral data into RGB images. They encountered issues with USB errors due to cable length and are working on reducing noise in the spectral data by experimenting with exposure times, averaging, and pinhole sizes.\n\nThe post includes images and videos demonstrating the camera's output, including a 400x400 pixel image that took nearly 19 hours to generate. They also explored visualizing specific wavelengths and combining data from multiple wavelengths to reduce noise. The final videos showcase the camera's performance under different light sources, revealing unique spectral properties of objects like sunglasses. The source code for the project, including MCU code, processing code, and 3D print designs, is available online. Future work involves experimenting with hardware and software to improve image quality and data browsing.\n",
    "chinese_title": "Show HN: 一款大幅面XY扫描高光谱相机",
    "chinese_summary": "此“Show HN”帖子详细介绍了大型XY扫描高光谱相机的制作过程。作者使用4x5英寸相机、镜头、连接到200um光纤的光谱仪以及电动XY平台构建了该相机。光纤电缆在镜头后移动，以捕获每个像素的光谱数据。平台由定制PCB控制，该PCB配备Raspberry Pi Pico和TMC2130驱动器，并使用micropython编程。\n\n作者使用`colour-science.org` Python库将光谱数据转换为RGB图像。他们遇到了因电缆长度引起的USB错误问题，并且正在通过尝试曝光时间、平均和针孔尺寸来降低光谱数据中的噪声。\n\n该帖子包含展示相机输出的图像和视频，其中包括一张耗时近19小时生成的400x400像素图像。他们还探索了可视化特定波长以及组合来自多个波长的数据以减少噪声。最终的视频展示了相机在不同光源下的性能，揭示了诸如太阳镜等物体独特的 spectral 属性。该项目的源代码，包括MCU代码、处理代码和3D打印设计，均已在线提供。未来的工作包括试验硬件和软件，以提高图像质量和数据浏览体验。"
  },
  {
    "id": "45583786",
    "title": "Your data model is your destiny",
    "url": "https://notes.mtb.xyz/p/your-data-model-is-your-destiny",
    "summary": "Matt Brown's article, \"Your Data Model is Your Destiny,\" argues that a startup's data model – its core abstractions and how it represents the world – is crucial for long-term success, especially in competitive markets. He defines the data model as the core concepts prioritized within a product, shaping everything from UI/UX to pricing and GTM strategy.\n\nHe emphasizes that a distinctive data model is a key differentiator, especially for disruptive companies. He provides examples like Slack's persistent channels, Toast's menu-item-centric architecture, Notion's blocks, Figma's canvas, Rippling's employee data model, Klaviyo's order-centric focus, and ServiceNow's connected services, illustrating how a well-chosen model creates compounding advantages.\n\nIn today's market, with commoditized code and crowded spaces, the data model is the foundation of a competitive moat. Brown suggests that the winners will be those with a data model that captures a fundamental truth about their market, creating advantages competitors can't easily replicate.\n\nHe advises founders to identify model mismatches in existing products, focusing on workflows instead of technical implementation. He suggests evaluating a product's current data model by analyzing database schema and core actions. He also underscores the importance of a data model that creates compounding advantages, enabling new features and products to be automatically more powerful. Ultimately, the right data model leads to natural expansion paths and solidifies a company's destiny.\n",
    "chinese_title": "你的数据模型决定你的命运。",
    "chinese_summary": "Matt Brown 的文章《你的数据模型即你的命运》认为，一家初创公司的数据模型——其核心抽象以及它如何表示世界——对于长期成功至关重要，尤其是在竞争激烈的市场中。他将数据模型定义为产品中优先考虑的核心概念，它塑造着从 UI/UX 到定价和 GTM 战略的一切。\n\n他强调，独特的数据模型是关键的差异化因素，尤其是对于颠覆性公司而言。他提供了诸如 Slack 的持久频道、Toast 的以菜单项为中心的架构、Notion 的块、Figma 的画布、Rippling 的员工数据模型、Klaviyo 的以订单为中心的关注以及 ServiceNow 的互联服务等例子，说明了精心选择的模型如何创造累积优势。\n\n在当今代码商品化和拥挤的市场中，数据模型是竞争护城河的基础。Brown 认为，赢家将是那些拥有数据模型，能够捕捉到其市场的基本真相，从而创造竞争对手难以复制的优势的公司。\n\n他建议创始人识别现有产品中的模型不匹配问题，专注于工作流程而不是技术实现。他建议通过分析数据库模式和核心操作来评估产品的当前数据模型。他还强调数据模型创造累积优势的重要性，使新功能和产品能够自动变得更加强大。最终，正确的数据模型会带来自然的扩张路径，并巩固公司的命运。"
  },
  {
    "id": "45618178",
    "title": "Amazon-backed, nuclear facility for Washington state",
    "url": "https://www.geekwire.com/2025/a-first-look-at-the-amazon-backed-next-generation-nuclear-facility-planned-for-washington-state/",
    "summary": "The article details the planned construction of a next-generation nuclear facility in Washington state, backed by Amazon. The facility, being developed by startup Helion Energy, will utilize fusion technology, aiming to provide a clean and sustainable energy source for the region and potentially the broader grid. Unlike traditional nuclear fission reactors, fusion theoretically produces minimal radioactive waste and eliminates the risk of meltdowns.\n\nAmazon has a purchase agreement with Helion Energy to procure electricity from the facility, which is intended to power its data centers and other operations. This move aligns with Amazon's commitment to achieving net-zero carbon emissions by 2040.\n\nThe planned facility showcases the potential of private sector investment in advanced nuclear energy technologies. It represents a significant step towards commercializing fusion power, although challenges remain in making the technology economically viable and scalable. The article highlights the innovative approach Helion Energy is taking and the potential impact it could have on the future of clean energy. While the project is still in its early stages, it represents a potentially groundbreaking development for Washington state's energy landscape and a significant step forward for fusion energy technology. The article gives a \"first look\" and not detailed technical specifics.\n",
    "chinese_title": "亚马逊支持的华盛顿州核设施",
    "chinese_summary": "亚马逊支持的下一代核设施计划在华盛顿州建设，该设施由初创公司Helion Energy开发，将采用聚变技术，旨在为该地区乃至更广阔的电网提供清洁、可持续的能源。与传统的核裂变反应堆不同，聚变理论上产生的放射性废物极少，并消除了熔毁的风险。\n\n亚马逊与Helion Energy签订了电力采购协议，计划从该设施采购电力，用于其数据中心和其他运营。此举符合亚马逊到2040年实现净零碳排放的承诺。\n\n该计划中的设施展示了私营部门对先进核能技术投资的潜力。虽然在使该技术在经济上可行和可扩展方面仍然存在挑战，但它代表着商业化聚变能的重要一步。这篇文章重点介绍了Helion Energy正在采取的创新方法及其可能对清洁能源未来产生的影响。尽管该项目仍处于早期阶段，但它代表了华盛顿州能源领域一项潜在的突破性发展，也是聚变能源技术向前迈出的重要一步。本文提供的是“初览”，而非详细的技术细节。"
  },
  {
    "id": "45605501",
    "title": "DoorDash and Waymo launch autonomous delivery service in Phoenix",
    "url": "https://about.doordash.com/en-us/news/waymo",
    "summary": "DoorDash and Waymo have partnered to launch an autonomous delivery service in Metro Phoenix. The service utilizes Waymo's self-driving technology for deliveries from participating merchants, initially focusing on DashMart orders through DoorDash's Autonomous Delivery Platform. Broader commercial operations are planned for later this year.\n\nIn addition, DoorDash is offering a limited-time promotion for DashPass members in Los Angeles, San Francisco, and Phoenix. From now until December 31, 2025, DashPass members in these cities can get $10 off one Waymo ride per month.\n\nDoorDash highlights that this collaboration aims to provide DashPass members with value, convenience, and access to new experiences while advancing the vision for a multi-modal autonomous future of local commerce. Waymo emphasizes the ease and safety of its technology for everyday errands. Both companies are excited about the potential to provide customers with seamless and contact-free deliveries.\n\nThe partnership aims to leverage Waymo's proven delivery experience and DoorDash's existing Autonomous Delivery Platform to orchestrate various delivery methods, including Dashers, robots, drones, and Waymo vehicles.\n",
    "chinese_title": "DoorDash和Waymo在凤凰城推出自动送货服务",
    "chinese_summary": "DoorDash 与 Waymo 合作在凤凰城都会区推出自动驾驶配送服务。该服务利用 Waymo 的自动驾驶技术为参与商家提供配送，初期专注于通过 DoorDash 的自动驾驶配送平台配送 DashMart 订单。更广泛的商业运营计划于今年晚些时候推出。\n\n此外，DoorDash 正在洛杉矶、旧金山和凤凰城为 DashPass 会员提供限时促销活动。从现在起到 2025 年 12 月 31 日，这些城市的 DashPass 会员每月可以获得 10 美元的 Waymo 乘车优惠。\n\nDoorDash 强调，此次合作旨在为 DashPass 会员提供价值、便利和全新体验，同时推进本地商业多模式自动驾驶未来的愿景。Waymo 强调其技术在日常差事中的便捷性和安全性。两家公司都对为客户提供无缝和非接触式配送的潜力感到兴奋。\n\n此次合作旨在利用 Waymo 成熟的配送经验和 DoorDash 现有的自动驾驶配送平台来协调各种配送方式，包括 Dashers、机器人、无人机和 Waymo 车辆。"
  },
  {
    "id": "45618196",
    "title": "Google's $1,800 foldable phone is first smartphone to explode in durability test",
    "url": "https://fortune.com/2025/10/16/google-pixel-10-pro-fold-durability-test-jerryrigeverything-zack-nelson-folding-phone-explosion-video/",
    "summary": "A popular durability tester, Zack Nelson of JerryRigEverything, found that Google's new $1,800 Pixel 10 Pro Fold is the weakest foldable smartphone he's ever tested, experiencing a battery explosion during a routine bend test. This is the first time a smartphone has exploded in his decade-long career of durability testing.\n\nThe phone snapped at the antenna lines, a known weak point from previous Pixel Fold models, causing the battery to short circuit and ignite. Nelson criticized Google for not addressing this design flaw despite repeated failures in previous iterations. He compared Google's repeated design error to building a Death Star with the same exhaust port or hiding Horcruxes in Harry Potter's closet, implying a failure to learn from past mistakes.\n\nDespite Google marketing the phone as their most durable foldable yet with an IP68 rating and a redesigned hinge, Nelson's tests revealed vulnerability. Sand infiltrated the hinge, and the battery exploded due to thermal runaway when bent, a result of pinched battery layers causing a short circuit.\n\nThe Pixel 10 Pro Fold features Google’s new Tensor G5 processor, 16GB of RAM, and screens measuring 6.4 inches externally and 8 inches internally. The device is available starting at $1,799 for the 256GB model, but can cost up to $2,149 for 1 terabyte of storage. While other reviewers have praised its durability under normal conditions, Nelson recommends Google relocate the antenna lines in future designs to prevent similar failures.\n",
    "chinese_title": "谷歌1800美元的折叠屏手机在耐用性测试中首次爆炸。",
    "chinese_summary": "知名耐用性测试者 JerryRigEverything 的 Zack Nelson 发现，谷歌新款 1800 美元的 Pixel 10 Pro Fold 是他测试过的最脆弱的可折叠智能手机，在一次常规弯曲测试中发生电池爆炸。这是他十年耐久性测试生涯中首次发生智能手机爆炸。\n\n该手机在天线处断裂，这是之前 Pixel Fold 型号的已知弱点，导致电池短路并起火。Nelson 批评谷歌没有解决这个设计缺陷，尽管之前的迭代中反复出现故障。他将谷歌重复出现的设计错误比作建造一个带有相同排气口的死星，或者将魂器藏在哈利·波特的壁橱里，暗示了未能从过去的错误中吸取教训。\n\n尽管谷歌将这款手机宣传为迄今为止最耐用的可折叠手机，具有 IP68 防护等级和重新设计的铰链，但 Nelson 的测试显示其存在漏洞。沙子渗入铰链，电池在弯曲时因热失控而爆炸，这是由于电池层被挤压导致短路造成的。\n\nPixel 10 Pro Fold 配备谷歌新款 Tensor G5 处理器、16GB 内存，外部屏幕为 6.4 英寸，内部屏幕为 8 英寸。 256GB 型号的起价为 1799 美元，但 1TB 存储空间的售价高达 2149 美元。尽管其他评测人员称赞其在正常条件下的耐用性，但 Nelson 建议谷歌在未来的设计中重新定位天线，以防止类似的故障。"
  },
  {
    "id": "45618178",
    "title": "Amazon-backed, nuclear facility for Washington state",
    "url": "https://www.geekwire.com/2025/a-first-look-at-the-amazon-backed-next-generation-nuclear-facility-planned-for-washington-state/",
    "summary": "The article details plans for a next-generation nuclear facility planned for Washington state, backed by Amazon. The facility is being developed by Talen Energy subsidiary Cumulus Data, and it will be a data center powered by a NuScale small modular reactor (SMR). This is a significant step towards cleaner energy sources powering energy-intensive data centers.\n\nThe key points are:\n\n*   **Location and Purpose:** The data center will be located near the Columbia Generating Station nuclear power plant in Richland, Washington, leveraging existing infrastructure and workforce expertise in the region. Its primary purpose is to provide dedicated, carbon-free power to the adjacent data center.\n\n*   **Technology:** The facility will use NuScale's VOYGR SMR, a smaller and arguably safer reactor design than traditional nuclear plants. These reactors are designed to be more flexible and easier to integrate into existing power grids.\n\n*   **Amazon's Involvement:** While not directly building the facility, Amazon Web Services (AWS) has a data center agreement with Talen Energy. This is a crucial factor, providing a guaranteed offtake agreement that makes the project economically viable and demonstrates Amazon's commitment to renewable energy.\n\n*   **Benefits:** The project aims to provide reliable, carbon-free energy to power data centers, reducing reliance on fossil fuels. It's also expected to create jobs and stimulate the local economy in the Tri-Cities region.\n\n*   **Timeline:** The SMR is expected to be operational by the end of the decade. However, the project is subject to regulatory approvals and licensing requirements.\n\n*   **Significance:** This project represents a potential shift in how data centers are powered, using advanced nuclear technology to address concerns about carbon emissions and energy security. It also highlights the growing demand for clean energy solutions from major tech companies like Amazon.\n",
    "chinese_title": "亚马逊支持的华盛顿州核设施",
    "chinese_summary": "文章详细介绍了亚马逊支持的，计划在华盛顿州建设的下一代核设施。该设施由Talen Energy的子公司Cumulus Data开发，将是一个由NuScale小型模块化反应堆（SMR）供电的数据中心。这是向使用更清洁的能源为高耗能数据中心供电迈出的重要一步。\n\n要点包括：\n\n*   **地点和目的：** 该数据中心将位于华盛顿州里奇兰附近的哥伦比亚发电站核电站附近，利用该地区现有的基础设施和劳动力专业知识。其主要目的是为邻近的数据中心提供专用的无碳电力。\n\n*   **技术：** 该设施将使用NuScale的VOYGR SMR，这是一种比传统核电站更小且可能更安全的反应堆设计。这些反应堆旨在更灵活，更容易集成到现有电网中。\n\n*   **亚马逊的参与：** 虽然亚马逊网络服务（AWS）没有直接建造该设施，但它与Talen Energy签订了数据中心协议。这是一个关键因素，它提供了一项保证的承购协议，使该项目在经济上可行，并表明了亚马逊对可再生能源的承诺。\n\n*   **益处：** 该项目旨在提供可靠的无碳能源来为数据中心供电，从而减少对化石燃料的依赖。预计还将创造就业机会并刺激三城地区的当地经济。\n\n*   **时间表：** SMR预计将在本十年末投入运营。但是，该项目需要获得监管部门的批准和许可。\n\n*   **意义：** 该项目代表了数据中心供电方式的潜在转变，即利用先进的核技术来解决对碳排放和能源安全的担忧。它还突显了像亚马逊这样的主要科技公司对清洁能源解决方案日益增长的需求。"
  },
  {
    "id": "45607758",
    "title": "Gemini 3.0 spotted in the wild through A/B testing",
    "url": "https://ricklamers.io/posts/gemini-3-spotted-in-the-wild/",
    "summary": "The article discusses the possible discovery of Google's unreleased Gemini 3.0 model through A/B testing on Google AI Studio. The author was motivated by rumors and SVG generation examples (particularly of Xbox controllers) that hinted at the model's capabilities.\n\nThe author used the prompt \"Create an SVG image of an Xbox 360 controller. Output it in a Markdown multi-line code block.\" and successfully triggered the A/B test, receiving an SVG image that impressed them compared to the current \"frontier\" models.\n\nThe model ID associated with this test was \"ecpt50a2y6mpgkcn,\" which doesn't definitively identify the specific Gemini 3.0 version.  The author speculates that the test might be comparing Gemini 3.0 Pro against the existing Gemini 2.5 Pro, as such a comparison makes more sense than comparing Gemini 3.0 Flash with Gemini 2.5 Pro. The \"Gemini 3.0\" response had a longer time-to-first-token (TTFT) and a longer output length, suggesting that it wasn’t a low-compute \"GPT-5 Pro\" style model. The author suggests that SVG generation can be a useful proxy for gauging model quality, referencing Simon Willison's \"pelican riding a bicycle\" test.\n",
    "chinese_title": "通过A/B测试发现Gemini 3.0的踪迹",
    "chinese_summary": "本文探讨了通过 Google AI Studio 上的 A/B 测试发现 Google 未发布的 Gemini 3.0 模型的可能性。作者受到传闻和 SVG 生成示例（特别是 Xbox 控制器）的启发，这些示例暗示了该模型的能力。\n\n作者使用了提示语“创建一个 Xbox 360 控制器的 SVG 图像。以 Markdown 多行代码块输出。”并成功触发了 A/B 测试，收到了一个 SVG 图像，与当前的“前沿”模型相比，该图像给他们留下了深刻的印象。\n\n与此测试相关的模型 ID 为“ecpt50a2y6mpgkcn”，但这并不能明确识别出具体的 Gemini 3.0 版本。作者推测，该测试可能是在比较 Gemini 3.0 Pro 和现有的 Gemini 2.5 Pro，因为这样的比较比比较 Gemini 3.0 Flash 和 Gemini 2.5 Pro 更有意义。“Gemini 3.0”响应的首次令牌响应时间 (TTFT) 更长，输出长度也更长，这表明它不是低算力的“GPT-5 Pro”风格模型。作者认为，SVG 生成可以作为衡量模型质量的有用代理，并参考了 Simon Willison 的“鹈鹕骑自行车”测试。"
  },
  {
    "id": "45610523",
    "title": "Cloudflare Sandbox SDK",
    "url": "https://sandbox.cloudflare.com/",
    "summary": "This article introduces the Cloudflare Sandbox SDK. It appears to be a product designed to allow developers to experiment with and test Cloudflare features and configurations in a controlled environment before deploying them to a live production environment. This likely includes the ability to:\n\n*   **Simulate Cloudflare's infrastructure and functionalities:** The sandbox environment replicates core aspects of Cloudflare's network, such as caching, security rules, and edge logic, allowing developers to see how their configurations will behave in a real-world scenario.\n*   **Test changes without impacting live traffic:** By isolating the testing environment, the Sandbox SDK prevents unintended consequences from affecting production websites or applications.\n*   **Rapid iteration and experimentation:** The controlled environment facilitates faster development cycles, enabling developers to experiment with different settings and integrations quickly.\n*   **Potentially integrate with existing development workflows:** The SDK likely provides tools and APIs to automate testing and integration, streamlining the development process.\n\nEssentially, the Cloudflare Sandbox SDK offers a safe and isolated space to develop, test, and refine Cloudflare configurations, minimizing risk and accelerating the deployment process. Because this is just an introduction, specific features and functionalities would need further investigation for a complete understanding.\n",
    "chinese_title": "Cloudflare 沙盒 SDK",
    "chinese_summary": "本文介绍了Cloudflare Sandbox SDK。该产品似乎旨在让开发者在受控环境中实验和测试Cloudflare的功能和配置，然后再将其部署到实际生产环境中。这可能包括以下能力：\n\n*   **模拟Cloudflare的基础设施和功能：** 沙箱环境复制了Cloudflare网络的核心方面，例如缓存、安全规则和边缘逻辑，使开发者能够了解他们的配置在真实场景中的行为。\n*   **在不影响实时流量的情况下测试更改：** 通过隔离测试环境，Sandbox SDK可防止意外后果影响生产网站或应用程序。\n*   **快速迭代和实验：** 受控环境促进了更快的开发周期，使开发者能够快速实验不同的设置和集成。\n*   **可能与现有开发工作流程集成：** 该SDK可能提供工具和API来自动化测试和集成，从而简化开发过程。\n\n本质上，Cloudflare Sandbox SDK提供了一个安全和隔离的空间来开发、测试和改进Cloudflare配置，从而最大限度地降低风险并加速部署过程。因为这只是一个介绍，所以需要进一步调查具体的功能和特性才能获得完整的理解。"
  },
  {
    "id": "45537698",
    "title": "Virtual Memory for Real-time RISC-V systems using hPMP",
    "url": "https://arxiv.org/abs/2504.04498",
    "summary": "This arXiv article, submitted on April 6, 2025, by Konrad Walluszik, Daniel Auge, Gerhard Wirrer, and Holm Rauchfuss, and Thomas Roecker explores implementing virtual memory for real-time RISC-V systems, particularly in the context of automotive safety and security. The authors propose an extension to the existing RISC-V SPMP proposal that enables address redirection for specific address regions.\n\nThe core problem addressed is the need for memory protection mechanisms in automotive microcontrollers to meet stringent safety and security requirements. Existing systems typically rely on either physical address-based memory protection units (MPUs) or memory management units (MMUs) that handle both protection and virtual-to-physical address mapping. MMUs allow for larger virtual address spaces, simplifying software development and integration, especially in virtualized environments.\n\nThe proposed solution aims to bridge the gap by offering address redirection while maintaining the deterministic behavior crucial for real-time systems. This deterministic behavior is a key advantage of MPUs that is usually lost when using a full MMU. This extension to SPMP allows for software development using a large, virtual address space without compromising the timing predictability demanded by real-time automotive applications. The authors showcase how their extension achieves this balance, allowing for easier software development through virtualization, and improved safety in real-time systems.\n",
    "chinese_title": "使用hPMP的实时RISC-V系统的虚拟内存",
    "chinese_summary": "Konrad Walluszik、Daniel Auge、Gerhard Wirrer、Holm Rauchfuss 和 Thomas Roecker 于 2025 年 4 月 6 日提交的这篇 arXiv 文章，探讨了为实时 RISC-V 系统实现虚拟内存，特别是在汽车安全和安保背景下。作者提出对现有 RISC-V SPMP 提案的扩展，该扩展能够为特定地址区域启用地址重定向。\n\n所解决的核心问题是汽车微控制器中对内存保护机制的需求，以满足严格的安全和安保要求。现有系统通常依赖于基于物理地址的内存保护单元 (MPU) 或处理保护和虚拟到物理地址映射的内存管理单元 (MMU)。MMU 允许更大的虚拟地址空间，简化软件开发和集成，尤其是在虚拟化环境中。\n\n所提出的解决方案旨在通过提供地址重定向来弥合差距，同时保持实时系统至关重要的确定性行为。这种确定性行为是 MPU 的一个关键优势，通常在使用完整 MMU 时会丢失。SPMP 的这种扩展允许使用大型虚拟地址空间进行软件开发，而不会影响实时汽车应用所需的定时可预测性。作者展示了他们的扩展如何实现这种平衡，从而通过虚拟化简化软件开发，并提高实时系统的安全性。"
  },
  {
    "id": "45559040",
    "title": "A liver transplant from start to finish",
    "url": "https://press.asimov.com/articles/liver",
    "summary": "Donna Vatnick's \"A Liver on Ice\" chronicles the journey of a liver from a brain-dead donor to a recipient awaiting a transplant. The article details Vatnick's experience accompanying a transplant team on a liver procurement mission.\n\nThe story begins with the team, including Dr. Lee and Organ Recovery Coordinator Trudy, traveling to a Midwest hospital via ambulance and private plane. They arrive at the operating room where John, the brain-dead donor, lies. John, though not a registered donor, had his organs approved for donation by the coroner.\n\nVatnick vividly describes the surgical procedure, including the initial incision, examination of the liver to assess its suitability, and the warm dissection, where the liver is carefully separated from the body. Dr. Lee identifies an anatomical anomaly during this process. The article explores the concept of \"brain death\" and its role in organ transplantation.\n\nThe climax involves the cross-clamp, where blood circulation to the liver is severed. As John bleeds out, the surgical team works quickly to flush the organ and pack the body with ice. Finally, the liver is completely detached and prepared for transport to the waiting recipient. The article blends scientific details with ethical considerations and personal observations, offering a comprehensive view of the complex process of liver transplantation.\n",
    "chinese_title": "从肝移植开始到结束",
    "chinese_summary": "唐娜·瓦特尼克的《冰上的肝脏》记录了一颗肝脏从脑死亡捐赠者到等待移植的接受者的旅程。文章详细描述了瓦特尼克陪同移植团队执行肝脏获取任务的经历。\n\n故事从团队开始，包括李医生和器官获取协调员特鲁迪，他们乘坐救护车和私人飞机前往中西部的一家医院。他们到达手术室，脑死亡捐赠者约翰躺在那里。约翰虽然没有注册为捐赠者，但他的器官经过验尸官批准可以捐赠。\n\n瓦特尼克生动地描述了手术过程，包括最初的切口，检查肝脏以评估其适用性，以及热解剖，其中肝脏被小心地从身体中分离出来。李医生在此过程中发现了解剖异常。文章探讨了“脑死亡”的概念及其在器官移植中的作用。\n\n高潮涉及横向钳夹，即切断肝脏的血液循环。当约翰流血时，手术团队迅速工作，冲洗器官并将尸体用冰块包裹。最后，肝脏被完全分离并准备运送给等待的接受者。文章将科学细节与伦理考量和个人观察相结合，全面展示了复杂的肝脏移植过程。"
  },
  {
    "id": "45616296",
    "title": "Elixir/Ports and external process wiring",
    "url": "https://mw.ludd.net/wiki/Elixir/Ports_and_external_process_wiring",
    "summary": "This article details the author's experience creating an Elixir library to interface with the `rsync` command-line tool for background file transfers. It explores the challenges of managing external processes spawned from Elixir using `Port.open` and `System.cmd`.\n\nThe author highlights the difficulty in controlling the lifecycle of these external processes. Unlike programs like `gzip` or `cat` that terminate when their input stream closes, `rsync` continues to run even when the Elixir process that spawned it terminates, leading to runaway processes.\n\nThe article discusses \"shimming\" as a potential solution, using an adapter program to translate the closing of stdin into a SIGTERM or SIGKILL signal for the child process. However, a more robust solution involves modifying the Erlang runtime system (ERTS) to send a terminate signal to spawned processes upon port closure. A proposed patch (PR#9453) aims to implement this by sending a SIGTERM signal.\n\nThe author delves into the technical details of how ERTS launches external processes, emphasizing the low-level interactions with pipes and system calls. The discussion also touches upon the implications of orphaned processes and the importance of proper process supervision. The article concludes by mentioning future directions for improving the Port API, including unifying platform implementations and adding the option to kill entire process groups. Finally, the article addresses the debate on which signal to send for termination (HUP, TERM, or KILL), suggesting configurability as a possible approach.\n",
    "chinese_title": "Elixir/端口与外部进程连接",
    "chinese_summary": "本文详细介绍了作者创建 Elixir 库的经验，该库用于与 `rsync` 命令行工具接口，以进行后台文件传输。它探讨了使用 `Port.open` 和 `System.cmd` 管理从 Elixir 衍生的外部进程所面临的挑战。\n\n作者强调了控制这些外部进程生命周期的难度。与 `gzip` 或 `cat` 等在输入流关闭时终止的程序不同，即使衍生它的 Elixir 进程终止，`rsync` 也会继续运行，从而导致失控的进程。\n\n本文讨论了将“垫片 (shimming)”作为一种潜在的解决方案，即使用适配器程序将 stdin 的关闭转换为子进程的 SIGTERM 或 SIGKILL 信号。然而，更可靠的解决方案涉及修改 Erlang 运行时系统 (ERTS)，以便在端口关闭时向衍生的进程发送终止信号。一项拟议的补丁 (PR#9453) 旨在通过发送 SIGTERM 信号来实现这一点。\n\n作者深入研究了 ERTS 如何启动外部进程的技术细节，强调了与管道和系统调用的底层交互。讨论还涉及孤儿进程的影响以及适当进程监督的重要性。文章最后提到了改进 Port API 的未来方向，包括统一平台实现以及添加杀死整个进程组的选项。最后，文章讨论了关于发送哪个信号进行终止的争论（HUP、TERM 或 KILL），并建议将可配置性作为一种可能的方法。"
  },
  {
    "id": "45555709",
    "title": "A 4k-Room Text Adventure Written by One Human in QBasic No AI",
    "url": "https://the-ventureweaver.itch.io/tlote4111",
    "summary": "\"The Labyrinth Of Time's Edge\" is a text adventure game developed by The Ventureweaver using QBasic/QB64, designed to evoke the feel of DOS-era games. It features a sprawling world of 3,999 handcrafted rooms filled with horror, mystery, and challenging encounters, including werewolves, undead, and spectral figures.\n\nThe game emphasizes exploration, courage, and adaptation, presenting a dynamic and evolving experience where previously mastered knowledge is tested. The latest update requires players to replace their existing ROOMS.txt and INTERACTIONS.txt files to access the expanded content.\n\nSystem requirements are minimal, needing only a basic Windows OS or DOS emulator, a 1 GHz processor, 512 MB of RAM, 10 MB of storage, a basic VGA display, and a keyboard.\n\nThe game is currently in development and has received positive feedback. Recent development logs highlight the addition of new rooms and content, with the developer actively engaging with the community and addressing feedback, such as typos in the text files.\n",
    "chinese_title": "一人用QBasic编写，无AI的4K房间文字冒险游戏",
    "chinese_summary": "时间边缘的迷宫是一款由The Ventureweaver使用QBasic/QB64开发的文字冒险游戏，旨在唤起DOS时代游戏的感觉。它拥有一个庞大的世界，包含3999个手工打造的房间，充满了恐怖、神秘和具有挑战性的遭遇，包括狼人、不死族和幽灵般的形象。\n\n游戏强调探索、勇气和适应，呈现出一种动态和不断发展的体验，之前掌握的知识也会受到考验。最新更新要求玩家替换现有的ROOMS.txt和INTERACTIONS.txt文件才能访问扩展内容。\n\n系统要求非常低，只需要一个基本的Windows操作系统或DOS模拟器、1 GHz处理器、512 MB内存、10 MB存储空间、一个基本的VGA显示器和一个键盘。\n\n该游戏目前正在开发中，并已收到积极的反馈。最近的开发日志重点介绍了新房间和内容的添加，开发人员积极与社区互动并解决反馈，例如文本文件中的拼写错误。"
  },
  {
    "id": "45608456",
    "title": "Talent",
    "url": "https://www.felixstocker.com/blog/talent",
    "summary": "Felix Stocker's \"Talent\" explores the nature of talent and its role in achievement, contrasting relentless output with innate abilities. The author begins by highlighting prolific writers like Matt Levine and historical figures like Paul Erdös, who achieved immense output through constant work.\n\nHe then introduces Scott Alexander's \"The Parable of the Talents,\" emphasizing the existence of natural talent. Alexander uses personal anecdotes and the example of Srinivasa Ramanujan to illustrate that some individuals possess innate abilities that others cannot replicate, regardless of effort. Stocker agrees, arguing that talent is a real factor.\n\nThe article goes on to cite further examples of how innate talent shows up in different ways. He contrasts his own experience in English and Math classes to demonstrate this point. Stocker then pivots to the importance of finding activities that align with one's natural inclinations. He uses Jim Donovan's relentless availability as an investment banker as an example of someone whose natural wiring was advantageous in his profession. He contrasts this to another person's experience who produces books on a years-long schedule.\n\nFinally, the author delves into the traits of successful traders, such as self-control, rational thinking under pressure, and inscrutability, suggesting that these are often innate qualities rather than acquired skills.\n",
    "chinese_title": "人才",
    "chinese_summary": "费利克斯·斯托克的《天赋》探讨了天赋的本质及其在成就中的作用，并将持续不断的产出与先天能力进行了对比。作者首先强调了像马特·莱文这样的多产作家和像保罗·埃尔德什这样的历史人物，他们通过持续不断的工作实现了巨大的产出。\n\n然后，他介绍了斯科特·亚历山大的《天赋的比喻》，强调了自然天赋的存在。亚历山大利用个人轶事和斯里尼瓦萨·拉马努金的例子来说明，有些人拥有其他人无论付出多少努力都无法复制的先天能力。斯托克对此表示赞同，认为天赋是一个真实存在的因素。\n\n文章继续引用更多例子来说明先天天赋如何以不同的方式展现出来。他用自己在英语和数学课上的经历来证明这一点。斯托克随后转向寻找与自身自然倾向相符的活动的重要性。他以吉姆·多诺万作为投资银行家的不懈努力为例，说明有些人的天性在其职业生涯中是有利的。他将此与另一个人以数年时间安排写作出版书籍的经历进行了对比。\n\n最后，作者深入探讨了成功交易员的特质，如自控力、压力下的理性思维和深不可测，并暗示这些往往是先天品质，而非后天习得的技能。"
  },
  {
    "id": "45615481",
    "title": "A classified network of SpaceX satellites is emitting a mysterious signal",
    "url": "https://www.npr.org/2025/10/17/nx-s1-5575254/spacex-starshield-starlink-signal",
    "summary": "A classified network of SpaceX's Starshield satellites, built for the U.S. National Reconnaissance Office (NRO), is emitting a mysterious signal on frequencies typically used for sending commands *to* satellites, raising concerns about potential interference with other satellites. Amateur satellite tracker Scott Tilley discovered the signals while monitoring radio frequencies, finding that the Starshield satellites were \"downlinking\" data in the 2025-2110 MHz range, reserved for \"uplinking.\"\n\nExperts agree that this unconventional use of frequencies could disrupt the operation of other satellites by interfering with their ability to receive commands from Earth. However, whether significant disruption has occurred is unresolved. Neither SpaceX nor the NRO responded to requests for comment.\n\nThe purpose of the Starshield signals remains unclear. Unlike Starlink, which uses higher frequencies for broadband internet, Starshield appears to be using lower frequencies, suggesting slower data transmission rates. Tilley speculates the unconventional use of frequencies could be an attempt to conceal Starshield's activities. Another theory is that SpaceX is simply utilizing a relatively unused portion of the radio spectrum.\n\nThe NRO has launched over 200 Starshield satellites as part of its \"proliferated architecture,\" aiming to improve the timeliness, diversification, and resilience of military Earth observations and communications. Tilley has detected signals from 170 of these satellites. He went public with his findings to inform satellite operators about the potential risks posed by the classified satellite network's unusual transmissions.\n",
    "chinese_title": "SpaceX 秘密卫星网络发出神秘信号",
    "chinese_summary": "为美国国家侦察局（NRO）建造的SpaceX星盾卫星保密网络，正在通常用于向卫星发送指令的频率上发射神秘信号，引发了对可能干扰其他卫星的担忧。业余卫星追踪者斯科特·蒂利在监测无线电频率时发现了这些信号，发现星盾卫星正在2025-2110 MHz范围内“下行传输”数据，而该频率范围是为“上行传输”保留的。\n\n专家们一致认为，这种非常规的频率使用可能会干扰其他卫星的运行，影响它们接收来自地球指令的能力。然而，是否已发生重大干扰尚未确定。SpaceX和NRO均未回应置评请求。\n\n星盾信号的目的仍然不明。与使用更高频率进行宽带互联网传输的星链不同，星盾似乎正在使用较低的频率，表明数据传输速率较慢。蒂利推测，这种非常规的频率使用可能是为了掩盖星盾的活动。另一种理论是，SpaceX只是在利用无线电频谱中一个相对未被使用的部分。\n\n作为其“扩散架构”的一部分，NRO已经发射了超过200颗星盾卫星，旨在提高军事地球观测和通信的及时性、多样性和韧性。蒂利已经探测到其中170颗卫星的信号。他公开了他的发现，以告知卫星运营商有关该保密卫星网络不寻常的传输所构成的潜在风险。"
  },
  {
    "id": "45604673",
    "title": "Hyperflask – Full stack Flask and Htmx framework",
    "url": "https://hyperflask.dev/",
    "summary": "Hyperflask is a full-stack Python framework built on Flask that simplifies the creation of interactive, backend-driven web applications. It leverages HTMX and a component system for easier development, promoting straightforward state management and reducing common frontend-heavy application pitfalls.\n\nKey features include:\n\n*   **Component-Driven Architecture:** Hyperflask introduces a component system for both frontend and backend elements, integrating seamlessly with Jinja templates and HTMX for server-backed interactivity.\n*   **File-Based Routing:** Uses a combined Python/Jinja file format (inspired by Astro) for routing.\n*   **UI Components and Styling:** Offers pre-built UI components from daisyUI, Bootstrap Icons, and Tailwind CSS for rapid UI development.\n*   **Batteries Included:** Offers built-in support for common features like email sending (MJML), background jobs, server-sent events (SSE), translations, authentication, content streaming, and image optimization.\n*   **Static Site Generation:** Supports static site generation and hybrid server-client models.\n*   **Containerized Development:** Standardizes development and production environments using containers and provides tight VS Code integration.\n*   **Independent Extensions:** Hyperflask is a small core that integrates various Flask extensions, developed independently under the Hyperflask organization, allowing users to pick and choose desired components.\n",
    "chinese_title": "Hyperflask – 全栈 Flask 和 Htmx 框架",
    "chinese_summary": "Hyperflask 是一个基于 Flask 构建的全栈 Python 框架，它简化了交互式、后端驱动的 Web 应用程序的创建。 它利用 HTMX 和组件系统来实现更轻松的开发，从而促进直接的状态管理并减少常见的前端密集型应用程序的缺陷。\n\n主要功能包括：\n\n*   **组件驱动架构:** Hyperflask 引入了一个用于前端和后端元素的组件系统，与 Jinja 模板和 HTMX 无缝集成，以实现服务器支持的交互性。\n*   **基于文件的路由:** 使用组合的 Python/Jinja 文件格式（受 Astro 启发）进行路由。\n*   **UI 组件和样式:** 提供来自 daisyUI、Bootstrap Icons 和 Tailwind CSS 的预构建 UI 组件，以实现快速的 UI 开发。\n*   **内置常用功能:** 提供对常见功能的内置支持，例如电子邮件发送 (MJML)、后台作业、服务器发送事件 (SSE)、翻译、身份验证、内容流式传输和图像优化。\n*   **静态站点生成:** 支持静态站点生成和混合服务器-客户端模型。\n*   **容器化开发:** 使用容器标准化开发和生产环境，并提供紧密的 VS Code 集成。\n*   **独立扩展:** Hyperflask 是一个小型核心，集成了各种 Flask 扩展，这些扩展在 Hyperflask 组织下独立开发，允许用户选择所需的组件。"
  },
  {
    "id": "45607117",
    "title": "Claude Skills",
    "url": "https://www.anthropic.com/news/skills",
    "summary": "This article introduces \"Skills,\" a new feature that enhances Claude's ability to perform specific tasks. Skills are essentially folders containing instructions, scripts, and resources that Claude can access when needed, enabling it to specialize in areas like working with Excel, adhering to brand guidelines, or other custom workflows.\n\nKey features of Skills include:\n\n*   **Composability:** Claude can automatically identify and coordinate the use of multiple Skills.\n*   **Portability:** Skills are designed to work consistently across Claude apps, Claude Code, and the API.\n*   **Efficiency:** Claude only loads the necessary information from a Skill, minimizing overhead.\n*   **Power:** Skills can include executable code for complex tasks.\n\nSkills are available in Claude apps for Pro, Max, Team, and Enterprise users, and can be enabled in settings (admins must enable organization-wide for Team and Enterprise accounts). Users can create custom Skills with the help of the \"skill-creator\" skill, which guides them through the process.\n\nThe Claude Developer Platform (API) allows developers to integrate Skills into Messages API requests and manage skill versions programmatically. The Code Execution Tool beta is required to run Skills.\n\nSeveral companies, like Box, Notion, and Canva, are already leveraging Skills to enhance Claude's capabilities within their respective platforms. Claude Code also benefits from Skills, allowing teams to install and share custom workflows.\n\nAnthropic plans to simplify skill creation and improve enterprise-wide deployment capabilities in the future. Users are advised to use Skills from trusted sources due to the code execution aspect.\n",
    "chinese_title": "Claude 的技能",
    "chinese_summary": "本文介绍“技能”（Skills），一项增强 Claude 执行特定任务能力的新功能。“技能”本质上是包含指令、脚本和资源的文件夹，Claude 可以在需要时访问它们，使其能够专注于诸如处理 Excel、遵守品牌指南或其他自定义工作流程等领域。\n\n“技能”的主要功能包括：\n\n*   **可组合性：** Claude 可以自动识别并协调多个“技能”的使用。\n*   **可移植性：** “技能”旨在跨 Claude 应用、Claude 代码和 API 保持一致的工作方式。\n*   **高效性：** Claude 仅从“技能”加载必要的信息，从而最大限度地减少开销。\n*   **强大性：** “技能”可以包含用于复杂任务的可执行代码。\n\nPro、Max、Team 和 Enterprise 用户可以在 Claude 应用中使用“技能”，并且可以在设置中启用（Team 和 Enterprise 帐户需要管理员启用组织范围）。用户可以使用“技能创建器”（skill-creator）技能来创建自定义“技能”，该技能会指导他们完成整个过程。\n\nClaude 开发者平台 (API) 允许开发者将“技能”集成到 Messages API 请求中，并以编程方式管理技能版本。 运行“技能”需要代码执行工具 Beta 版。\n\nBox、Notion 和 Canva 等多家公司已经利用“技能”来增强 Claude 在各自平台中的功能。Claude 代码也受益于“技能”，允许团队安装和共享自定义工作流程。\n\nAnthropic 计划在未来简化技能创建并改进企业范围的部署能力。由于代码执行方面的原因，建议用户使用来自可信来源的“技能”。"
  },
  {
    "id": "45617475",
    "title": "Endorsing easily disproven claims linked to prioritizing symbolic strength",
    "url": "https://theconversation.com/winning-with-misinformation-new-research-identifies-link-between-endorsing-easily-disproven-claims-and-prioritizing-symbolic-strength-265652",
    "summary": "This article explores why some people endorse easily disproven claims, focusing on the concept of \"symbolic strength.\" The authors' research suggests that for some individuals, particularly those with authoritarian tendencies, endorsing misinformation is a way to signal independence from external influence and demonstrate a perceived psychological strength.\n\nTheir study, based on surveys conducted during the COVID-19 pandemic, found that the strongest predictor of believing misinformation wasn't political beliefs, general feelings about COVID-19, or thinking style, but rather the perception of COVID-19 prevention efforts as a sign of symbolic weakness. These individuals viewed adherence to guidelines as \"backing down\" or \"giving in\" to control.\n\nThe authors argue that for these \"symbolic thinkers,\" the literal truth of a statement is secondary to the act of defiance it represents. The more easily disprovable a claim is, the more powerful it becomes as a symbol of unwavering independence. This mindset extends beyond COVID-19, as shown in a study linking cryptocurrency investment with a desire to signal independence from traditional finance and a greater likelihood of believing in other conspiracies.\n\nThe article concludes that attempts to debunk misinformation are ineffective on those prioritizing symbolic strength because they perceive debunking as a sign of weakness. This mindset can lead individuals to embrace even outlandish claims as a way to appear \"authentic\" and signal that they won't be swayed by external forces.\n",
    "chinese_title": "支持容易被证伪的，且与优先考虑象征性力量相关的说法",
    "chinese_summary": "本文探讨了为何有些人会支持容易被证伪的说法，重点关注“象征性力量”的概念。作者的研究表明，对于某些人，特别是那些具有专制倾向的人来说，支持虚假信息是一种表明独立于外部影响并展示一种感知到的心理力量的方式。\n\n他们的研究基于新冠疫情期间进行的调查，发现相信虚假信息的最强预测因素不是政治信仰、对新冠疫情的总体感受或思维方式，而是将新冠疫情预防措施视为象征性软弱的表现。这些人认为遵守准则是一种“退缩”或“屈服”于控制。\n\n作者认为，对于这些“象征性思考者”来说，陈述的字面真相不如它所代表的对抗行为重要。一个说法越容易被证伪，它作为坚定不移的独立象征就越强大。这种心态不仅限于新冠疫情，一项研究表明，加密货币投资与渴望表明独立于传统金融以及更易于相信其他阴谋论有关。\n\n文章的结论是，试图揭穿虚假信息对那些优先考虑象征性力量的人来说是无效的，因为他们认为揭穿是一种软弱的表现。这种心态可能导致个人拥抱甚至古怪的说法，以此来表现得“真实”并表明他们不会受到外部力量的左右。"
  },
  {
    "id": "45529255",
    "title": "Post office in France rolls out croissant-scented stamp",
    "url": "https://www.ctvnews.ca/world/article/french-post-office-rolls-out-croissant-scented-stamp/",
    "summary": "The French post office, La Poste, has released a limited-edition postage stamp that smells like a croissant to celebrate French baking. The stamp, officially called \"Croissant,\" features a picture of the iconic pastry and is scented using microencapsulation technology. This technology embeds the scent into the ink, allowing the aroma to be released when the stamp is scratched or rubbed.\n\nThe stamp was issued on March 1st and is available for purchase at post offices and online. A sheet of 10 stamps costs €1.96 each, making it slightly more expensive than a standard stamp. The launch coincides with a renewed appreciation for traditional French pastries and artisanal baking techniques.\n\nWhile the practicality of a scented stamp might be questioned, it serves as a novel way for La Poste to promote French culture and gastronomy. The stamp has garnered significant attention and has become a popular novelty item, particularly among collectors and those with an interest in French culinary traditions.\n",
    "chinese_title": "法国邮局推出可颂香味邮票",
    "chinese_summary": "法国邮政La Poste发行了一款限量版可颂香味邮票，以庆祝法国烘焙。 这款官方名称为“可颂”的邮票，印有标志性糕点的图片，并采用微胶囊技术注入香味。 通过这项技术，香味被嵌入到油墨中，当邮票被刮擦时，香味就会散发出来。\n\n这款邮票于3月1日发行，可在邮局和网上购买。 一版10张邮票，每张售价1.96欧元，略高于标准邮票。 这次发行正值人们对传统法国糕点和手工烘焙技术的重新重视。\n\n虽然香味邮票的实用性可能受到质疑，但它为La Poste提供了一种推广法国文化和美食的新颖方式。 这款邮票引起了广泛关注，并已成为一种受欢迎的新奇物品，尤其是在收藏家和对法国烹饪传统感兴趣的人群中。"
  },
  {
    "id": "45618053",
    "title": "I Test Drove a Flying Car. Get Ready, They're Here",
    "url": "https://www.wsj.com/lifestyle/cars/i-test-drove-a-flying-car-get-ready-theyre-here-257b0ecf",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "我试驾了飞行汽车。准备好，它们来了",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "45565977",
    "title": "Create a Custom Interactive dashboard using SVG",
    "url": "https://0xmm.in/posts/custom_dash/",
    "summary": "This article describes how to create a custom interactive infrastructure dashboard using SVG. The author, inspired by tools like Grafana Canvas, wanted a way to visualize and monitor their self-hosted services and devices on a single screen.  Initially considering CSS, they realized the complexity and instead consulted a frontend developer who suggested SVG.\n\nThe author found SVGs to be a good option as they can be designed with tools like Illustrator, manipulated through the DOM, and easily integrated with any frontend framework. They designed a custom router model where port statuses (connected, disconnected, disabled) could be visually represented.\n\nThe key to making the dashboard interactive lies in manipulating the SVG elements. Each element (like a router port) has an ID and a fill attribute.  By targeting specific elements with their IDs and dynamically changing the fill color, the author could represent different statuses (e.g., red for shutdown, green for online).\n\nThe article also provides instructions on how to test a Proof of Concept (PoC). This involves running a server, opening an HTML file to view the dashboard, and then making live updates to the SVG files, which are monitored using `npm chokidar`.  Changes to the SVG, such as color modifications, are reflected in real-time in the browser, demonstrating the interactive capabilities of the SVG-based dashboard.\n",
    "chinese_title": "使用 SVG 创建自定义交互式仪表板",
    "chinese_summary": "本文介绍了如何使用SVG创建一个自定义的交互式基础设施仪表盘。作者受到Grafana Canvas等工具的启发，希望能够在一个屏幕上可视化和监控其自托管的服务和设备。最初考虑使用CSS，但意识到其复杂性，转而咨询了一位前端开发人员，他建议使用SVG。\n\n作者发现SVG是一个不错的选择，因为可以使用Illustrator等工具进行设计，通过DOM进行操作，并且可以轻松地与任何前端框架集成。他们设计了一个自定义路由器模型，其中端口状态（已连接、已断开、已禁用）可以通过视觉方式呈现。\n\n使仪表盘具有交互性的关键在于操作SVG元素。每个元素（如路由器端口）都有一个ID和一个fill属性。通过使用它们的ID定位特定元素并动态更改填充颜色，作者可以表示不同的状态（例如，红色表示关闭，绿色表示在线）。\n\n本文还提供了关于如何测试概念验证 (PoC) 的说明。这包括运行服务器，打开HTML文件以查看仪表盘，然后对SVG文件进行实时更新，这些更新使用`npm chokidar`进行监控。对SVG的更改（例如颜色修改）会实时反映在浏览器中，从而演示了基于SVG的仪表盘的交互功能。"
  },
  {
    "id": "45616949",
    "title": "Zorin OS 18",
    "url": "https://blog.zorin.com/2025/10/14/zorin-os-18-has-arrived/",
    "summary": "Zorin OS 18 has been released, marking a significant update focused on ease of use, performance, and a modern design. Targeted as a Windows replacement, particularly with Windows 10 end-of-life approaching, Zorin OS 18 offers a familiar experience for Windows users, aiming to revitalize older hardware.\n\nKey features include a redesigned desktop environment with rounded elements, a new window tiling manager for enhanced multitasking, and seamless integration of Web Apps to run cloud-based applications like Microsoft Office. OneDrive integration allows easy access to cloud-stored files. The OS also suggests alternatives to Windows applications during installation, guiding users to compatible software.\n\nThe update includes new theme colors for personalization, three new desktop layouts in Zorin OS Pro, and additional pre-installed apps in the Pro and Education editions to boost productivity and learning. Performance improvements, better Windows software support through WINE, enhanced search capabilities, remote login via RDP, and updated audio with PipeWire are also included.\n\nZorin OS 18 offers long-term support until 2029 and is available for download in Core, Pro, and Education editions. Users of the Core Beta version can upgrade, and direct upgrades from Zorin OS 17 will be available soon. The creators emphasize the OS's blend of powerful technology and user-friendly design.\n",
    "chinese_title": "Zorin OS 18",
    "chinese_summary": "Zorin OS 18 发布，这是一项重大更新，侧重于易用性、性能和现代设计。Zorin OS 18 的目标是取代 Windows，尤其是在 Windows 10 寿命终止临近之际，它为 Windows 用户提供了熟悉的体验，旨在使旧硬件焕发新生。\n\n主要功能包括重新设计的桌面环境，带有圆形元素；用于增强多任务处理的新窗口平铺管理器；以及无缝集成的 Web 应用程序，可运行 Microsoft Office 等基于云的应用程序。OneDrive 集成可轻松访问云存储的文件。操作系统还在安装过程中建议 Windows 应用程序的替代方案，引导用户使用兼容的软件。\n\n此更新包括用于个性化的新主题颜色、Zorin OS Pro 中的三种新桌面布局，以及 Pro 和教育版中预装的额外应用程序，以提高生产力和学习效率。此外，还包括性能改进、通过 WINE 更好地支持 Windows 软件、增强的搜索功能、通过 RDP 进行远程登录以及使用 PipeWire 更新的音频。\n\nZorin OS 18 提供长期支持至 2029 年，并提供 Core、Pro 和教育版下载。Core Beta 版用户可以升级，并且很快将提供从 Zorin OS 17 的直接升级。创建者强调了该操作系统强大的技术和用户友好型设计的融合。"
  },
  {
    "id": "45604779",
    "title": "Electricity can heal wounds three times as fast (2023)",
    "url": "https://www.chalmers.se/en/current/news/mc2-how-electricity-can-heal-wounds-three-times-as-fast/",
    "summary": "Researchers at Chalmers and the University of Freiburg have developed a method using electrical stimulation to accelerate wound healing, potentially by up to three times the normal rate. This breakthrough could be particularly beneficial for individuals with impaired wound healing, such as those with diabetes, spinal injuries, or poor blood circulation, reducing the risk of infection and chronic wounds.\n\nThe research leverages the principle that skin cells are electrotactic, meaning they migrate directionally in electric fields. Using a microfluidic biochip, they observed that electrically stimulated wounds on artificial skin healed significantly faster than unstimulated wounds. Notably, the method also showed promise in accelerating healing in diabetes-affected cells, bringing their healing rate closer to that of healthy cells.\n\nThe team aims to develop individualized wound healing products by \"scanning\" wounds and tailoring the electrical stimulation. This tailored approach is believed to be key to effectively treating individuals with slow-healing wounds. With recent funding, they are investigating how different skin cells interact during stimulation to better replicate real-world wound conditions and develop effective products for consumers. The study, published in *Lab on a Chip*, details the effectiveness of low-level electrical fields (200 mV/mm) in promoting accelerated wound closure without harming the cells.\n",
    "chinese_title": "电力能将伤口愈合速度提高三倍 (2023)",
    "chinese_summary": "查尔姆斯大学和弗莱堡大学的研究人员开发了一种利用电刺激加速伤口愈合的方法，有可能将愈合速度提高至正常速度的三倍。这项突破可能特别有益于伤口愈合受损的个体，例如糖尿病患者、脊髓损伤患者或血液循环不良者，从而降低感染和慢性伤口的风险。\n\n该研究利用了皮肤细胞具有电趋性的原理，这意味着它们在电场中定向迁移。通过使用微流控生物芯片，他们观察到，人工皮肤上经电刺激的伤口比未受刺激的伤口愈合速度显著加快。值得注意的是，该方法还显示出加速糖尿病影响细胞愈合的潜力，使其愈合速度更接近健康细胞。\n\n该团队旨在通过“扫描”伤口并定制电刺激来开发个性化的伤口愈合产品。这种定制方法被认为是有效治疗伤口愈合缓慢个体的关键。凭借最近获得的资金，他们正在研究不同皮肤细胞在刺激过程中如何相互作用，以更好地复制现实世界的伤口状况，并为消费者开发有效的产品。《芯片实验室》（*Lab on a Chip*）发表的研究详细介绍了低强度电场（200 mV/mm）在促进加速伤口闭合而不损害细胞方面的有效性。"
  },
  {
    "id": "45609922",
    "title": "Benjie's Humanoid Olympic Games",
    "url": "https://generalrobots.substack.com/p/benjies-humanoid-olympic-games",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "本杰的人形奥运会",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "45610996",
    "title": "Understanding Spec-Driven-Development: Kiro, Spec-Kit, and Tessl",
    "url": "https://martinfowler.com/articles/exploring-gen-ai/sdd-3-tools.html",
    "summary": "This article explores the emerging concept of Spec-Driven Development (SDD) and its various implementations. SDD involves writing a \"spec\" before coding with AI, making the spec the source of truth. The article identifies three levels of SDD: Spec-first (spec written before AI-assisted development), Spec-anchored (spec maintained for feature evolution), and Spec-as-source (spec is the primary artifact, code generated and not directly edited).\n\nThe author defines a \"spec\" as a structured, behavior-oriented artifact in natural language guiding AI coding agents, distinct from general codebase context documents. Evaluating SDD tools is time-consuming, requiring real-world usage across different problem sizes.\n\nThe article examines three SDD tools: Kiro (spec-first, VS Code-based workflow: Requirements -> Design -> Tasks), Spec-kit (GitHub's CLI-based tool with Constitution -> Specify -> Plan -> Tasks workflow, aiming for spec-anchored but currently spec-first), and Tessl Framework (private beta, aiming for spec-anchored and spec-as-source, with a spec-to-code file mapping).\n\nThe author raises several questions: if one workflow can fit all problem sizes, the effectiveness of reviewing markdown over code, the potential for a false sense of control, and how to effectively separate functional and technical specs. The author concludes that these tools are quite different despite labeling themselves as SDD implementations, and there are still a lot of open questions about how this works in real life.\n",
    "chinese_title": "理解规格驱动开发：Kiro、Spec-Kit 和 Tessl",
    "chinese_summary": "本文探讨了新兴的概念——规范驱动开发(SDD)及其各种实现方式。SDD 涉及在使用 AI 编码前编写“规范”，使规范成为真理来源。本文确定了三个 SDD 级别：规范优先（在 AI 辅助开发之前编写规范）、规范锚定（维护规范以进行功能演进）和规范即源（规范是主要工件，代码生成且不直接编辑）。\n\n作者将“规范”定义为一种结构化的、面向行为的自然语言工件，用于指导 AI 编码代理，区别于一般的代码库上下文文档。评估 SDD 工具非常耗时，需要在不同问题规模下进行实际使用。\n\n本文考察了三个 SDD 工具：Kiro（规范优先，基于 VS Code 的工作流程：需求 -> 设计 -> 任务）、Spec-kit（GitHub 基于 CLI 的工具，工作流程为 Constitution -> Specify -> Plan -> Tasks，目标是规范锚定，但目前是规范优先）和 Tessl Framework（私有 beta，目标是规范锚定和规范即源，具有规范到代码的文件映射）。\n\n作者提出了几个问题：一种工作流程是否能适应所有问题规模，审查 markdown 比审查代码的有效性，潜在的虚假控制感，以及如何有效分离功能规范和技术规范。作者总结说，尽管这些工具都标榜自己是 SDD 的实现方式，但它们之间差异很大，并且关于它在现实生活中如何运作还有很多悬而未决的问题。"
  },
  {
    "id": "45604308",
    "title": "Jiga (YC W21) Is Hiring Full Stacks",
    "url": "https://www.workatastartup.com/jobs/44310",
    "summary": "Jiga, a Y Combinator (W21) startup, is hiring a Full Stack Engineer to join their fully remote team. Jiga is building a digital platform to streamline the manufacturing part procurement process. They emphasize a culture of trust, performance-based evaluation, minimal meetings, and values like simple code and rapid iteration.\n\nThe ideal candidate has 3+ years of experience building full-stack web applications using React, NodeJS, and MongoDB, with experience in AWS and maintaining EC2/ECS services. Experience with Terraform is a plus. They should be a proactive, independent, and product-focused individual who is comfortable taking ownership and working quickly. The role requires some working hour overlap with GMT+3 and is limited to US citizens or green card holders.\n\nJiga offers a flexible, location-independent work environment, a self-development budget, stock options, annual team offsites, and the opportunity to contribute to a challenging problem. They don't offer traditional office perks but focus on employee autonomy and a dynamic, internationally diverse team. To apply, candidates should send a short blurb about themselves and their favorite ice cream flavor.\n",
    "chinese_title": "Jiga (YC W21) 招聘全栈工程师",
    "chinese_summary": "Jiga (Y Combinator W21 孵化公司) 正在招聘全栈工程师加入其全远程团队。Jiga 正在构建一个数字化平台，以简化制造零件的采购流程。他们强调信任文化、基于绩效的评估、最少会议，并重视简洁代码和快速迭代。\n\n理想的候选人应具有 3 年以上使用 React、NodeJS 和 MongoDB 构建全栈 Web 应用程序的经验，以及 AWS 和维护 EC2/ECS 服务的经验。具有 Terraform 经验者优先。他们应该是一个积极主动、独立自主且以产品为中心的人，能够承担责任并快速工作。该职位要求部分工作时间与 GMT+3 重叠，并且仅限于美国公民或绿卡持有者。\n\nJiga 提供灵活的、不受地域限制的工作环境、自我发展预算、股票期权、年度团队线下活动，以及为具有挑战性的问题做出贡献的机会。他们不提供传统的办公室福利，而是专注于员工自主权和一个充满活力、国际化的多元团队。申请者应发送一段关于他们自己的简短介绍以及他们最喜欢的冰淇淋口味。"
  },
  {
    "id": "45617400",
    "title": "US hyperscalers to guzzle 22% more grid juice by end of 2025",
    "url": "https://www.theregister.com/2025/10/16/us_datacenters_ai_power/",
    "summary": "By the end of 2025, US hyperscale datacenters are projected to consume 22% more grid power than the previous year, and nearly three times as much by the end of the decade, driven by the AI boom and the demand for machine learning models.\n\nA report from 451 Research highlights the rapid increase in datacenter energy consumption, projecting a rise from 11.3 GW to 61.8 GW by the end of 2024, escalating to 134.4 GW by 2030. This surge is attributed to hyperscalers like Amazon, Microsoft, Meta, and Google investing heavily in new datacenter infrastructure.\n\nHowever, some power companies are introducing datacenter-specific tariffs to protect other customers from infrastructure costs, potentially impacting the actual rate of growth. For example, AEP Ohio requires large datacenter customers to be responsible for a high percentage of their subscribed energy, leading to a decrease in interconnection requests. Overestimated energy requirements and duplicate requests across jurisdictions could also skew projections.\n\nVirginia and Texas are identified as the states with the highest datacenter energy demands. Operators are also exploring emerging markets with \"stranded power\" and alternative energy opportunities and on-site power generation systems.\n",
    "chinese_title": "到2025年底，美国超大规模企业用电量将增加22%。",
    "chinese_summary": "到2025年底，美国超大规模数据中心预计将比上一年消耗多22%的电网电力，到本十年末，由于人工智能的蓬勃发展和对机器学习模型的需求，消耗量将接近三倍。\n\n451 Research的一份报告强调了数据中心能源消耗的快速增长，预计到2024年底将从11.3吉瓦增加到61.8吉瓦，到2030年将激增至134.4吉瓦。这种激增归因于亚马逊、微软、Meta和谷歌等超大规模企业对新数据中心基础设施的大量投资。\n\n然而，一些电力公司正在推出针对数据中心的特定关税，以保护其他客户免受基础设施成本的影响，这可能会影响实际增长率。例如，AEP Ohio要求大型数据中心客户承担其认购能源的很高比例，导致互连请求减少。高估的能源需求和跨辖区的重复请求也可能扭曲预测。\n\n弗吉尼亚州和得克萨斯州被认为是数据中心能源需求最高的州。运营商还在探索具有“搁浅电力”和替代能源机会的新兴市场以及现场发电系统。"
  },
  {
    "id": "45545220",
    "title": "How to tame a user interface using a spreadsheet",
    "url": "https://blog.gingerbeardman.com/2025/10/11/how-to-tame-a-user-interface-using-a-spreadsheet/",
    "summary": "This article advocates for using spreadsheets as a powerful, underappreciated tool for user interface (UI) design, focusing on layout, positioning, and hierarchy, independent of content and style details. The author argues that spreadsheets are accessible, cost-effective, and enable rapid prototyping by allowing quick adjustments to screen size and structure using rows and columns.\n\nThe author dispels the criticism that spreadsheets are limited to 2D by explaining that multiple sheets can add dimensions to the work. They cite the example of Lotus 1-2-3, demonstrating 3D spreadsheet manipulation. Highlighting the grid system's role in enforcing structure, the article draws a parallel to graph paper's superiority over plain paper for pixel-based art and Susan Kare's use of graph paper for early Macintosh icons.\n\nThe author provides examples of how spreadsheets were used to plan the UI of the game YOYOZO, enhanced versions of sfxr, an upcoming optical media dumper called Spindle, and a driving game. The author shares that the spreadsheet design translated directly to SwiftUI grid system in the optical media dumper.\n\nThe core message is to consider spreadsheets as a versatile and efficient tool for UI design, enabling designers to concentrate on layout and structure before diving into the complexities of design software.\n",
    "chinese_title": "如何用电子表格驯服用户界面",
    "chinese_summary": "本文提倡将电子表格作为一种强大且未被充分利用的用户界面（UI）设计工具，重点关注布局、定位和层级，独立于内容和样式细节。作者认为电子表格易于使用、经济高效，并且通过使用行列快速调整屏幕大小和结构，实现快速原型设计。\n\n作者通过解释多个工作表可以为工作增加维度，从而驳斥了电子表格仅限于2D的批评。他们引用了 Lotus 1-2-3 的例子，展示了 3D 电子表格操作。文章强调网格系统在强化结构方面的作用，并将其与方格纸在像素艺术方面优于白纸以及苏珊·凯尔使用方格纸制作早期 Macintosh 图标相提并论。\n\n作者提供了电子表格如何用于规划游戏 YOYOZO 的 UI、sfxr 的增强版本、一个名为 Spindle 的即将推出的光盘媒体转储器和一个驾驶游戏的示例。作者分享说，电子表格设计直接转化为光盘媒体转储器中的 SwiftUI 网格系统。\n\n核心信息是考虑将电子表格作为一种通用且高效的 UI 设计工具，使设计师能够在深入研究设计软件的复杂性之前，专注于布局和结构。"
  },
  {
    "id": "45618356",
    "title": "Microsoft integrates Copilot with the Taskbar on Windows 11",
    "url": "https://www.windowscentral.com/microsoft/windows-11/microsoft-integrates-copilot-with-the-taskbar-on-windows-11-the-search-box-is-now-an-ai-chat-box",
    "summary": "Microsoft is integrating Copilot more deeply into Windows 11 by replacing the Taskbar's Windows Search box with a Copilot chat box. This update aims to streamline productivity by making Copilot universally accessible across the operating system. The new integration will allow users to initiate AI chat and search local files and apps through the Copilot UI, accessible directly from the Taskbar. While it doesn't automatically grant Copilot access, it uses existing Windows Search APIs for results.\n\nThis change is planned for all Windows 11 users, not just those with Copilot+ PCs. Microsoft is also introducing a new agentic AI assistant within Copilot that can interact with apps and files, enabling the AI to perform tasks on behalf of the user.\n\nThe new Taskbar integration will first be available in preview for Windows Insiders in the coming weeks, with a broader rollout expected sometime in 2026. This means users will have quick access to Copilot features like Copilot Vision and chat, regardless of their location within Windows 11.\n",
    "chinese_title": "微软将Copilot集成到Windows 11的任务栏。",
    "chinese_summary": "微软正通过用Copilot聊天框取代任务栏的Windows搜索框，更深入地将Copilot集成到Windows 11中。此更新旨在通过使Copilot在整个操作系统中普遍可用，从而简化生产力。新的集成将允许用户通过Copilot UI启动AI聊天，并搜索本地文件和应用程序，该UI可直接从任务栏访问。虽然它不会自动授予Copilot访问权限，但它使用现有的Windows Search API来获取结果。\n\n这项改变计划面向所有Windows 11用户，而不仅仅是那些拥有Copilot+ PC的用户。微软还在Copilot中引入了一个新的代理AI助手，它可以与应用程序和文件进行交互，使AI能够代表用户执行任务。\n\n新的任务栏集成将在未来几周内首先在Windows预览体验计划中提供，预计在2026年的某个时候进行更广泛的推广。这意味着无论用户在Windows 11中的哪个位置，都可以快速访问Copilot Vision和聊天等Copilot功能。"
  },
  {
    "id": "45611851",
    "title": "Lead Limited Brain and Language Development in Neanderthals and Other Hominids?",
    "url": "https://today.ucsd.edu/story/did-lead-limit-brain-and-language-development-in-neanderthals-and-other-extinct-hominids",
    "summary": "A study by UC San Diego researchers suggests that lead exposure, dating back nearly two million years, may have limited brain and language development in Neanderthals and other extinct hominids. Analyzing fossilized teeth from various hominids, including Neanderthals, ancient humans, and great apes, the researchers found significant lead exposure across species.\n\nThe study proposes that ancient hominids may have been exposed to lead through contaminated water sources, impacting brain development and potentially leading to deficits in intelligence and emotional regulation.\n\nThe key differentiator between modern humans and other hominids may lie in a genetic variant of the NOVA1 gene, which plays a crucial role in brain development. Modern humans possess a variant that differs from the ancestral version found in Neanderthals. When brain organoids with the archaic NOVA1 variant were exposed to lead, the expression of FOXP2, a gene essential for language and speech, was altered. This suggests the modern human NOVA1 variant may have protected us from the detrimental effects of lead, promoting complex language development and providing a significant evolutionary advantage.\n\nThe researchers suggest that lead exposure, coupled with the lack of the protective NOVA1 variant, may have contributed to the extinction of Neanderthals. The findings also have implications for understanding neurological conditions related to language, such as speech apraxia and autism.\n",
    "chinese_title": "铅限制了尼安德特人和其他人族的大脑和语言发展吗？",
    "chinese_summary": "加州大学圣地亚哥分校研究人员的一项研究表明，早在近两百万年前的铅暴露可能限制了尼安德特人和其他已灭绝人科动物的大脑和语言发展。通过分析来自包括尼安德特人、远古人类和大型猿类在内的各种人科动物的化石牙齿，研究人员发现不同物种都存在显著的铅暴露。\n\n该研究提出，远古人科动物可能通过受污染的水源接触到铅，从而影响大脑发育，并可能导致智力和情绪调节方面的缺陷。\n\n现代人类和其他人科动物之间的关键区别可能在于NOVA1基因的一种遗传变异，该基因在大脑发育中起着至关重要的作用。现代人类拥有一种与尼安德特人中发现的祖先版本不同的变异。当带有古老NOVA1变异的大脑类器官暴露于铅时，FOXP2的表达发生了改变，而FOXP2是语言和言语的关键基因。这表明现代人类的NOVA1变异可能保护了我们免受铅的有害影响，促进了复杂的语言发展，并提供了显著的进化优势。\n\n研究人员认为，铅暴露，加上缺乏保护性的NOVA1变异，可能导致了尼安德特人的灭绝。这些发现对于理解与语言相关的神经系统疾病（如言语失用症和自闭症）也具有重要意义。"
  },
  {
    "id": "45617099",
    "title": "Samsung teams up with Glance to use your face in AI-generated lock screen ads",
    "url": "https://arstechnica.com/gadgets/2025/06/samsung-teams-up-with-glance-to-use-your-face-in-ai-generated-lock-screen-ads/",
    "summary": "Samsung is partnering with Glance to introduce an AI-powered \"shopping\" experience to Samsung phone lock screens. This opt-in feature will use a selfie and basic body type information to generate personalized fashion ads featuring the user's AI-generated image in various outfits and scenarios. These images, created using Google Gemini and Imagen, will appear on the lock screen, allowing users to purchase the displayed items directly.\n\nWhile Glance assures users that biometric data used for the avatar creation is retained for 12 months or until account deletion and won't be used for other purposes or shared without consent, the article highlights potential privacy concerns associated with constantly generating AI images of the user and tracking their data for advertising. The service also collects general location data which will be shared with partners.\n\nThis Glance AI integration will be available as a standalone app and a lock screen feature. It's rolling out to Samsung Galaxy S22, S23, S24, and S25 series phones via the Galaxy Store and is expected to expand to a wider range of Samsung devices within 30 days. The article draws a comparison to Google's virtual try-on feature, noting that Glance's constant image generation based on trending content and social media creates a potentially more invasive experience.\n",
    "chinese_title": "三星与Glance合作，利用你的面部在AI生成的锁屏广告中。",
    "chinese_summary": "三星正与Glance合作，为三星手机锁屏引入AI驱动的“购物”体验。这项可选功能将使用自拍和基本体型信息来生成个性化时尚广告，其中包含用户AI生成的图像，该图像会出现在各种服装和场景中。这些使用Google Gemini和Imagen创建的图像将出现在锁屏上，允许用户直接购买显示的商品。\n\n虽然Glance向用户保证，用于创建头像的生物识别数据将保留12个月或直到账户删除，且不会用于其他目的或未经同意共享，但文章强调了与持续生成用户AI图像和跟踪其数据用于广告相关的潜在隐私问题。该服务还会收集一般位置数据，这些数据将与合作伙伴共享。\n\n这种Glance AI集成将作为一个独立的应用程序和一个锁屏功能提供。它正在通过Galaxy Store向三星Galaxy S22、S23、S24和S25系列手机推出，预计将在30天内扩展到更广泛的三星设备。文章将此功能与谷歌的虚拟试穿功能进行了比较，并指出Glance基于趋势内容和社交媒体不断生成图像，这可能会创造一种更具侵入性的体验。"
  },
  {
    "id": "45617803",
    "title": "A Surprising Amount of Satellite Traffic Is Unencrypted – Schneier on Security",
    "url": "https://www.schneier.com/blog/archives/2025/10/a-surprising-amount-of-satellite-traffic-is-unencrypted.html",
    "summary": "Bruce Schneier's blog post highlights a research study revealing a significant security vulnerability in satellite communications. The study found that a surprising amount of sensitive data transmitted via geostationary satellites is unencrypted. This includes crucial infrastructure data, internal corporate and government communications, personal voice calls and SMS messages, and internet traffic from sources like in-flight WiFi and mobile networks.\n\nThe implication is alarming because this unencrypted traffic can be easily intercepted and observed passively by anyone possessing relatively inexpensive, readily available consumer-grade satellite dish equipment. The reach is vast, with a single satellite transponder's data potentially visible across 40% of the Earth's surface.\n\nIn essence, the study exposes a widespread lack of encryption in satellite communication, making a wide range of private and sensitive information vulnerable to eavesdropping on a global scale. The researchers emphasize the ease with which this vulnerability can be exploited, raising serious concerns about data security and privacy.\n",
    "chinese_title": "令人惊讶的大量卫星通信流量未加密 – Schneier on Security",
    "chinese_summary": "布鲁斯·施奈尔的博客文章重点介绍了一项研究，该研究揭示了卫星通信中一个重大的安全漏洞。该研究发现，通过地球静止卫星传输的令人惊讶的大量敏感数据是未加密的，这包括关键的基础设施数据、内部公司和政府通信、个人语音通话和短信，以及来自诸如机载WiFi和移动网络等来源的互联网流量。\n\n这意味着令人担忧，因为任何拥有相对便宜、容易获得的消费级卫星天线设备的人都可以轻松地拦截并被动地观察到这些未加密的流量。其影响范围广阔，单个卫星转发器的数据可能在地球表面40%的范围内可见。\n\n本质上，该研究暴露了卫星通信中普遍缺乏加密，使得范围广泛的私人和敏感信息容易受到全球范围内的窃听。研究人员强调了利用此漏洞的容易程度，引发了人们对数据安全和隐私的严重担忧。"
  },
  {
    "id": "45543546",
    "title": "Microwave technique allows energy-efficient chemical reactions",
    "url": "https://phys.org/news/2025-10-microwave-technique-energy-efficient-chemical.html",
    "summary": "Researchers at the University of Tokyo have developed a more energy-efficient method for driving chemical reactions using microwaves. This innovative technique focuses microwave energy on specific atomic active sites within a material, unlike conventional heating methods that disperse energy throughout the entire reactor. The system uses lower-frequency microwaves (around 900 MHz) to excite indium ions within a spongelike zeolite material. These ions act as antennas, generating localized heat that facilitates chemical reactions as fluids pass through the zeolite's pores.\n\nThis targeted heating approach is approximately 4.5 times more efficient than traditional methods, enabling reactions at lower overall temperatures. Potential applications include water decomposition, methane conversion to create fuel, carbon capture by recycling CO2 during methane conversion, and plastics recycling. The researchers demonstrated the concept using a specialized experimental setup at Japan's SPring-8 synchrotron radiation facility, proving the selective heating of the atomic active sites.\n\nChallenges remain in scaling the technology for industrial use, including the complex and potentially expensive production of the zeolite material, indirect temperature measurement at the atomic scale, and further improvements in energy efficiency. The research team aims to expand the technique to other chemical reactions, optimize catalyst design, and integrate it with renewable energy sources. They are seeking corporate partners for joint development and anticipate pilot-scale demonstrations within the next decade.\n",
    "chinese_title": "微波技术助力节能化学反应",
    "chinese_summary": "东京大学的研究人员开发了一种更节能的微波驱动化学反应方法。这种创新技术将微波能量聚焦于材料内特定的原子活性位点，不同于传统加热方法将能量分散到整个反应器。该系统使用较低频率的微波（约 900 MHz）来激发海绵状沸石材料中的铟离子。这些离子充当“天线”，产生局部热量，从而促进流体通过沸石孔隙时的化学反应。\n\n这种靶向加热方法比传统方法效率高约 4.5 倍，可以在较低的整体温度下进行反应。潜在应用包括水分解、甲烷转化为燃料、在甲烷转化过程中通过回收二氧化碳进行碳捕获以及塑料回收。研究人员在日本 SPring-8 同步辐射设施中使用专门的实验装置证明了该概念，证实了原子活性位点的选择性加热。\n\n将该技术扩展到工业用途仍面临挑战，包括沸石材料复杂且可能昂贵的生产、原子尺度的间接温度测量以及能源效率的进一步提高。研究团队的目标是将该技术扩展到其他化学反应，优化催化剂设计，并将其与可再生能源相结合。他们正在寻找公司合作伙伴进行联合开发，并预计在未来十年内进行中试规模的演示。"
  },
  {
    "id": "45611735",
    "title": "America’s semiconductor boom [video]",
    "url": "https://www.youtube.com/watch?v=T-jt3qBzJ4A",
    "summary": "This is not an article, but a YouTube video. The provided \"content\" is just the standard YouTube boilerplate footer information. There is no actual information about \"America's semiconductor boom\" provided to summarize. Therefore, I can only say that the video title suggests it discusses the potential growth and advancements in the American semiconductor industry. To provide a summary, the actual content of the video would be needed.\n",
    "chinese_title": "美国的半导体繁荣[视频]",
    "chinese_summary": "这并非文章，而是一个YouTube视频。提供的“内容”仅为标准的YouTube页脚信息。没有提供关于“美国半导体繁荣”的实际信息可供总结。因此，我只能说视频标题暗示其讨论美国半导体行业的潜在增长和进步。要提供摘要，需要视频的实际内容。"
  },
  {
    "id": "45604700",
    "title": "Show HN: Inkeep (YC W23) – Agent Builder to create agents in code or visually",
    "url": "https://github.com/inkeep/agents",
    "summary": "Inkeep (YC W23) introduces a platform for building AI agents, offering both a no-code visual builder and a TypeScript SDK for development. The key feature is 2-way synchronization between the visual and code interfaces, enabling collaboration between technical and non-technical teams.\n\nInkeep Agents can be used for real-time AI Chat Assistants (e.g., customer support) and AI Workflow Automation (e.g., knowledge base management, CRM updates).\n\nThe platform provides open-source tools including the visual builder, SDK, multi-agent architecture support, MCP tools (credential management), a UI component library for chat experiences, API triggering, and observability via Traces UI & OpenTelemetry. Deployment options include Vercel and Docker.\n\nArchitecturally, Inkeep consists of several APIs (manage, run), UIs (manage, agents), SDK, and CLI for syncing code. It leverages the Vercel AI SDK for LLM integration, ensuring compatibility with Vercel's `useChat` and AI Elements primitives.\n\nLicensed under Elastic License 2.0 with supplemental terms, Inkeep promotes extensibility by allowing users to choose their LLM provider and self-host agents. The project encourages community contribution and provides resources for getting started and staying updated.\n",
    "chinese_title": "Show HN: Inkeep (YC W23) – 以代码或可视化方式创建代理的代理构建器",
    "chinese_summary": "Inkeep (YC W23) 推出构建 AI 代理的平台，提供无代码可视化构建器和 TypeScript SDK 用于开发。其关键特性是可视化界面和代码界面之间的双向同步，从而实现技术团队和非技术团队之间的协作。\n\nInkeep Agents 可用于实时 AI 聊天助手（例如，客户支持）和 AI 工作流自动化（例如，知识库管理、CRM 更新）。\n\n该平台提供开源工具，包括可视化构建器、SDK、多代理架构支持、MCP 工具（凭证管理）、用于聊天体验的 UI 组件库、API 触发以及通过 Traces UI 和 OpenTelemetry 实现的可观察性。部署选项包括 Vercel 和 Docker。\n\n在架构上，Inkeep 由多个 API（管理、运行）、UI（管理、代理）、SDK 和用于同步代码的 CLI 组成。它利用 Vercel AI SDK 进行 LLM 集成，确保与 Vercel 的 `useChat` 和 AI Elements 原语的兼容性。\n\nInkeep 在 Elastic License 2.0 附加条款下获得许可，通过允许用户选择其 LLM 提供商并自托管代理来促进可扩展性。该项目鼓励社区贡献，并提供入门和保持更新的资源。"
  },
  {
    "id": "45554004",
    "title": "VOC injection into a house reveals large surface reservoir sizes",
    "url": "https://www.pnas.org/doi/10.1073/pnas.2503399122",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "挥发性有机物注入房屋揭示了巨大的表面储集层规模",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "45604451",
    "title": "A stateful browser agent using self-healing DOM maps",
    "url": "https://100x.bot/a/a-stateful-browser-agent-using-self-healing-dom-maps",
    "summary": "This snippet describes a \"stateful browser agent\" leveraging \"self-healing DOM maps.\" The title suggests an approach to building AI agents that can interact with web browsers in a more robust and persistent manner. Instead of just executing actions on a website and forgetting the context, this agent maintains a \"state\" – a record of the website's current condition and its interactions.\n\nKey to this is the \"self-healing DOM maps.\" The Document Object Model (DOM) represents the structure of a webpage. Webpages are dynamic, constantly changing their structure and content. A \"self-healing DOM map\" implies a system that can automatically adapt to these changes in the DOM. This is crucial for the agent to remain functional even when a website is modified, avoiding failures caused by broken selectors or outdated assumptions about the page's structure.\n\nThe mention of \"100X.Bot | 100x All-in-One AI Agent Platform\" strongly suggests that this technology is being marketed as part of a comprehensive AI automation platform. The claim implies that by using this technology, developers can create browser agents that are far more resilient and efficient than traditional methods, leading to a \"100x\" improvement in performance or capability.\n\nIn essence, the article likely discusses an AI agent that can navigate websites reliably by maintaining state and dynamically adapting to DOM changes, offered as part of a broader AI automation solution.\n",
    "chinese_title": "使用自修复DOM映射的有状态浏览器代理",
    "chinese_summary": "利用“自愈DOM映射”的状态化浏览器代理\n\n这段文字描述了一种利用“自愈DOM映射”的“状态化浏览器代理”。标题暗示了一种构建AI代理的方法，该方法可以以更健壮和持久的方式与Web浏览器交互。该代理不是仅仅在网站上执行操作并忘记上下文，而是维护一种“状态”——网站当前状况及其交互的记录。\n\n关键在于“自愈DOM映射”。文档对象模型 (DOM) 代表网页的结构。网页是动态的，不断更改其结构和内容。“自愈DOM映射”意味着一种可以自动适应DOM中这些更改的系统。这对于代理保持功能至关重要，即使网站被修改，也可以避免由于选择器损坏或对页面结构的过时假设而导致的故障。\n\n提及“100X.Bot | 100x 多合一 AI 代理平台”强烈暗示这项技术正作为综合AI自动化平台的一部分进行营销。该声明暗示，通过使用这项技术，开发人员可以创建比传统方法更具弹性和效率的浏览器代理，从而使性能或能力提高“100 倍”。\n\n本质上，这篇文章可能讨论了一种AI代理，该代理可以通过维护状态和动态适应DOM更改来可靠地浏览网站，并作为更广泛的AI自动化解决方案的一部分提供。"
  },
  {
    "id": "45591799",
    "title": "Apple M5 chip",
    "url": "https://www.apple.com/newsroom/2025/10/apple-unleashes-m5-the-next-big-leap-in-ai-performance-for-apple-silicon/",
    "summary": "Apple announced the M5 chip on October 15, 2025, touting it as a major advancement in AI performance for Apple silicon. Built on a third-generation 3-nanometer technology, the M5 features a next-generation 10-core GPU architecture with a Neural Accelerator in each core, leading to over 4x the peak GPU compute performance for AI compared to the M4.\n\nThe M5 also boasts a faster CPU with up to 10 cores (six efficiency and four performance), resulting in up to 15% faster multithreaded performance over M4. An improved 16-core Neural Engine and a nearly 30% increase in unified memory bandwidth to 153GB/s further enhance the chip's capabilities. Graphics performance sees a boost of up to 45% compared to the M4, thanks to enhanced graphics capabilities and third-generation ray tracing.\n\nAccording to Apple, the M5's optimized GPU architecture significantly accelerates AI-driven workflows and delivers increased graphics performance, offering smoother gameplay, more realistic visuals, and faster rendering times. The faster Neural Engine enhances AI-powered features on devices like Apple Vision Pro and improves the overall performance of Apple Intelligence models.\n\nThe increased unified memory bandwidth allows devices to run larger AI models completely on-device, fueling the CPU, GPU, and Neural Engine. The M5 is launching in the new 14-inch MacBook Pro, iPad Pro, and Apple Vision Pro, all available for pre-order. Apple also highlighted the M5's power efficiency and contribution to the company's Apple 2030 environmental plan.\n",
    "chinese_title": "苹果 M5 芯片",
    "chinese_summary": "苹果于2025年10月15日发布M5芯片，称其为Apple芯片在AI性能方面的重大进步。M5采用第三代3纳米技术，配备下一代10核GPU架构，每个核心都包含神经加速器，与M4相比，AI的峰值GPU计算性能提升超过4倍。\n\nM5还拥有更快的CPU，最多可配置10个核心（6个能效核心和4个性能核心），多线程性能比M4提升高达15%。改进的16核神经网络引擎和近30%的统一内存带宽增加至153GB/s，进一步增强了芯片的功能。由于增强的图形功能和第三代光线追踪技术，图形性能与M4相比提升高达45%。\n\n苹果表示，M5优化的GPU架构显著加速了AI驱动的工作流程，并提高了图形性能，从而提供更流畅的游戏体验、更逼真的视觉效果和更快的渲染速度。更快的神经网络引擎增强了Apple Vision Pro等设备上的人工智能功能，并提高了Apple Intelligence模型的整体性能。\n\n增加的统一内存带宽使设备能够在设备上完全运行更大的AI模型，从而为CPU、GPU和神经网络引擎提供动力。M5将应用于新款14英寸MacBook Pro、iPad Pro和Apple Vision Pro，所有这些设备均可预订。苹果还强调了M5的能效以及对公司Apple 2030环境计划的贡献。"
  },
  {
    "id": "45605153",
    "title": "Lace: A New Kind of Cellular Automata Where Links Matter",
    "url": "https://www.novaspivack.com/science/introducing-lace-a-new-kind-of-cellular-automata",
    "summary": "This article introduces LACE (Link Automata Computing Engine), a new platform for exploring a novel class of cellular automata where links between cells significantly impact their behavior. Unlike traditional cellular automata like Conway's Game of Life, LACE rules consider both cell states and the connectivity (links) between them.\n\nThe author's decades-long fascination with digital physics, inspired by figures like Ed Fredkin and Stephen Wolfram, led to the development of LACE. The key insight was recognizing the importance of topology and the evolving nature of space, where connections between elements are crucial.\n\nLACE allows users to define rules where cell states are influenced by their neighbors *and* the links they share, and conversely, link states are affected by the cells they connect. This enables rules that utilize topological properties like number of connections and neighbor degree, leading to more complex and interesting behaviors.\n\nThe article provides examples, starting with link-aware variations of the Game of Life, demonstrating how links can influence cell states. It then showcases the \"Realm of LACE\" (ROL) rules, which fully utilize topology, generating entirely new forms of stable patterns, oscillators, gliders, and phenomena that resemble \"artificial life.\" These rules can be explored and modified using the provided Python code repository. The author encourages users to experiment and share their discoveries within this new computational landscape. A gallery of videos showcases the diverse and fascinating behaviors generated by various LACE rules.\n",
    "chinese_title": "蕾丝：一种关注连接的新型元胞自动机",
    "chinese_summary": "本文介绍了 LACE (链接自动机计算引擎)，一个用于探索新型细胞自动机的新平台。在该自动机中，细胞之间的链接会显著影响其行为。与传统的细胞自动机（如康威生命游戏）不同，LACE 规则同时考虑细胞状态和它们之间的连接（链接）。\n\n受埃德·弗雷德金和斯蒂芬·沃尔夫勒姆等人的启发，作者对数字物理学数十年的迷恋促成了 LACE 的开发。关键的见解是认识到拓扑结构和空间演化性质的重要性，其中元素之间的连接至关重要。\n\nLACE 允许用户定义规则，其中细胞状态受其邻居*以及*它们共享的链接的影响，反之，链接状态受它们连接的细胞的影响。这使得规则能够利用拓扑属性，如连接数和邻居度数，从而产生更复杂和有趣的 behavior。\n\n本文提供了示例，从生命游戏的链接感知变体开始，展示了链接如何影响细胞状态。然后展示了“LACE领域” (ROL) 规则，该规则充分利用拓扑结构，生成全新的稳定模式、振荡器、滑翔机以及类似“人工生命”的现象。可以使用提供的 Python 代码库来探索和修改这些规则。作者鼓励用户在这个新的计算领域中进行实验并分享他们的发现。视频画廊展示了各种 LACE 规则产生的各种有趣的行为。"
  },
  {
    "id": "45601834",
    "title": "New coding models and integrations",
    "url": "https://ollama.com/blog/coding-models",
    "summary": "This article announces the availability of new coding models, GLM-4.6 and Qwen3-coder-480B, on Ollama's cloud service. It also highlights an updated Qwen3-Coder-30B model with improved tool calling within Ollama's new engine.\n\nThe new models can be accessed via the `ollama run` command (e.g., `ollama run glm-4.6:cloud`). A local version of Qwen3-coder-480B is also available for users with sufficient VRAM. The article includes an example prompt for generating a single-page game using these models.\n\nIt provides instructions for integrating these models with popular coding tools like VS Code, Zed (now available for Windows), and Droid, detailing how to pull the models and configure them within each environment.\n\nFurthermore, the article mentions expanded documentation for using Ollama with other coding tools like Codex, Cline, and Roo code.\n\nFinally, it explains how to access the cloud models directly via Ollama's cloud API. This requires obtaining an API key and using it in API calls, demonstrating a simple example using `curl` to generate a snake game. The article points readers to Ollama's API documentation for further details.\n",
    "chinese_title": "新的编码模型与集成",
    "chinese_summary": "本文宣布Ollama云服务上新增代码模型GLM-4.6和Qwen3-coder-480B。同时，强调了更新后的Qwen3-Coder-30B模型，该模型在Ollama的新引擎中改进了工具调用。\n\n新模型可以通过`ollama run`命令访问（例如，`ollama run glm-4.6:cloud`）。拥有足够显存的用户还可以使用本地版本的Qwen3-coder-480B。文章包含一个使用这些模型生成单页游戏的示例提示。\n\n文章提供了将这些模型与流行的编码工具（如VS Code、Zed（现已推出Windows版本）和Droid）集成的方法，详细说明了如何在每个环境中拉取模型并进行配置。\n\n此外，文章还提到了扩展的文档，用于将Ollama与其他编码工具（如Codex、Cline和Roo code）一起使用。\n\n最后，文章解释了如何通过Ollama的云API直接访问云模型。这需要获取API密钥并在API调用中使用它，并演示了一个使用`curl`生成贪吃蛇游戏的简单示例。文章引导读者参阅Ollama的API文档以获取更多详细信息。"
  },
  {
    "id": "45615880",
    "title": "Dead or Alive and Ninja Gaiden 2004 Creator Tomonobu Itagaki Dies Aged 58",
    "url": "https://www.ign.com/articles/dead-or-alive-and-ninja-gaiden-2004-creator-tomonobu-itagaki-dies-aged-58-fans-react-to-final-message-i-am-proud-to-say-that-i-followed-my-beliefs-and-fought-to-the-end",
    "summary": "Tomonobu Itagaki, the creator of the Dead or Alive series and the revitalizer of the Ninja Gaiden franchise, has died at the age of 58. Known for his uncompromising vision and contributions to action gaming, Itagaki left a \"final words\" message expressing pride in following his beliefs and regret for not delivering a new work to his fans.\n\nItagaki began his career at Tecmo in 1992 and rose to prominence with the Dead or Alive series, noted for its graphics and female characters. He further solidified his reputation with the 2004 Xbox exclusive Ninja Gaiden reboot, followed by the critically acclaimed Ninja Gaiden Black.\n\nHis departure from Tecmo in 2008 was marked by a public dispute over unpaid bonuses. He then founded Valhalla Game Studios, releasing Devil's Third, before establishing Itagaki Games in 2021 with the intention of developing new games.\n\nThe gaming community, including figures like Katsuhiro Harada and Ed Boon, have expressed their condolences and acknowledged Itagaki's significant impact on the industry. Team Ninja, the studio he put on the map, vowed to continue his philosophy and creativity. Itagaki's death coincides with the upcoming release of Ninja Gaiden 4, a project he was not involved in.\n",
    "chinese_title": "生死格斗与忍者龙剑传2004创作人板垣伴信逝世，享年58岁",
    "chinese_summary": "《生死格斗》系列创始人及《忍者龙剑传》系列复兴者板垣伴信逝世，享年58岁。板垣以其毫不妥协的愿景和对动作游戏领域的贡献而闻名，他留下了“遗言”，表达了对自己坚持信仰的自豪，以及未能向粉丝们交付新作的遗憾。\n\n板垣伴信于1992年在特库摩开始了他的职业生涯，并凭借《生死格斗》系列声名鹊起，该系列以其图形和女性角色而闻名。他于2004年发布了Xbox独占的《忍者龙剑传》重启版，随后又推出了备受好评的《忍者龙剑传：黑之章》，进一步巩固了他的声誉。\n\n2008年，他因未支付奖金而与特库摩发生公开纠纷，随后离开了公司。之后，他创立了瓦尔哈拉游戏工作室，发行了《恶魔三人组》，然后在2021年成立了Itagaki Games，旨在开发新游戏。\n\n包括原田胜弘和Ed Boon在内的游戏界人士纷纷表示哀悼，并认可了板垣对游戏行业的重大影响。他一手打造的Team Ninja工作室也发誓将延续他的理念和创造力。板垣的去世恰逢《忍者龙剑传4》即将发布，但他并未参与该项目。"
  },
  {
    "id": "45617382",
    "title": "Australian wet rainforests may be switching from absorbing carbon to emitting it",
    "url": "https://www.abc.net.au/news/science/2025-10-16/australian-rainforest-trees-carbon-storage-producer/105886554",
    "summary": "This ABC Science article reports on a concerning shift in Australia's Queensland wet tropical rainforests. A 49-year study revealed that the \"woody biomass\" of these forests, meaning the trunks and branches of trees, has transitioned from being a carbon sink (absorbing more carbon than it releases) to a carbon source (releasing more carbon than it absorbs). This change occurred around 25 years ago.\n\nThe key reason is that trees are dying and decaying at a faster rate than they are being replaced, attributed to climate change impacts such as heat and drier air. This is especially concerning because wet rainforests are typically carbon-dense ecosystems crucial for the global carbon cycle.\n\nThe study contrasts this finding with the Amazon rainforest, which, despite potential overall shifts to being a carbon source, still exhibits some growth due to rising CO2 levels. The Queensland rainforests, however, seem unable to capitalize on this \"CO2 fertilization effect,\" potentially due to other limiting factors like moisture and nutrient deficiencies, or the impact of cyclones.\n\nWhile it's unlikely these rainforests will become grasslands soon, there could be significant changes in their structure, function, and species diversity. The study's findings serve as a \"canary in the coal mine,\" suggesting that similar shifts could occur in other rainforests globally, jeopardizing efforts to mitigate climate change by relying on these ecosystems as stable carbon stocks. The researchers stress the importance of reducing fossil fuel emissions and recognizing that forests require specific conditions to function effectively as carbon sinks.\n",
    "chinese_title": "澳大利亚湿润雨林可能正从吸收碳转变为排放碳。",
    "chinese_summary": "澳大利亚昆士兰湿热带雨林碳汇功能逆转：气候变化加速树木死亡"
  },
  {
    "id": "45615672",
    "title": "MTV Shutting Down Some of Its Music Channels After 40 Years",
    "url": "https://www.eonline.com/news/1423766/mtv-shutting-down-some-music-channels-after-40-years",
    "summary": "MTV is shutting down five of its UK music channels – MTV Music, MTV 80s, MTV 90s, Club MTV, and MTV Live – on December 31st after 40 years of broadcasting. While flagship channel MTV HD will remain and continue showing reality programming, the closures mark a significant shift for the brand, which originally launched in the US in 1981 as a 24-hour music video broadcaster.\n\nMTV Europe followed in 1987, with the UK getting its own channel in 1997. Former MTV VJ Simone Angel expressed sadness and disbelief at the news, lamenting the loss of a platform that once brought people together through music and played a pivotal role in shaping culture, particularly in the 90s. She emphasized MTV's importance as a precursor to the internet, reaching a vast audience of 100-150 million viewers globally. While acknowledging the need to adapt to changing times, Angel criticized the network's shift towards reality television, arguing it's a departure from what MTV originally stood for. The article highlights the end of an era for a globally recognizable brand.\n",
    "chinese_title": "MTV Shutting Down Some of Its Music Channels After 40 Years",
    "chinese_summary": "MTV is shutting down five of its UK music channels – MTV Music, MTV 80s, MTV 90s, Club MTV, and MTV Live – on December 31st after 40 years of broadcasting. While flagship channel MTV HD will remain and continue showing reality programming, the closures mark a significant shift for the brand, which originally launched in the US in 1981 as a 24-hour music video broadcaster.\n\nMTV Europe followed in 1987, with the UK getting its own channel in 1997. Former MTV VJ Simone Angel expressed sadness and disbelief at the news, lamenting the loss of a platform that once brought people together through music and played a pivotal role in shaping culture, particularly in the 90s. She emphasized MTV's importance as a precursor to the internet, reaching a vast audience of 100-150 million viewers globally. While acknowledging the need to adapt to changing times, Angel criticized the network's shift towards reality television, arguing it's a departure from what MTV originally stood for. The article highlights the end of an era for a globally recognizable brand.\n"
  },
  {
    "id": "45602428",
    "title": "Elixir 1.19",
    "url": "https://elixir-lang.org/blog/2025/10/16/elixir-v1-19-0-released/",
    "summary": "生成摘要时出错",
    "chinese_title": "Elixir 1.19",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45555690",
    "title": "Show HN: Compression-Resistant Data Transfers",
    "url": "https://github.com/ianling/steg-experiments",
    "summary": "生成摘要时出错",
    "chinese_title": "Show HN: 抗压缩数据传输",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45563576",
    "title": "Syntax highlighting is a waste of an information channel (2020)",
    "url": "https://buttondown.com/hillelwayne/archive/syntax-highlighting-is-a-waste-of-an-information/",
    "summary": "The author argues that syntax highlighting, while useful, is a wasted opportunity for leveraging color as an information channel in code.  They propose \"semantic highlighting\" – dynamically coloring code based on its *meaning* and the specific task at hand – as a more effective alternative.  Instead of simply differentiating syntax elements, semantic highlighting could highlight imports, argument types, potential exceptions, metadata (like functions called in failed tests), or even code characteristics like length or lack of documentation.\n\nThe author provides numerous examples of potential use cases, each offering variations for increased specificity. These include rainbow parenthesis, highlighting nested contexts, different types of imports, argument usage, variable types, exception handling, and even code metadata related to testing or code reviews.\n\nHowever, they acknowledge significant implementation challenges: creating the complex rules requires deep knowledge of the code's AST, project context, and runtime information; resolving conflicts between different highlighting rules with varying priorities is difficult; and existing editors are ill-equipped to handle dynamic, semantic highlighting overlays. Despite these hurdles, the author believes semantic highlighting is inevitable due to its potential advantages, though it will likely emerge first in simpler languages. They invite readers to subscribe to their newsletter for more updates on computer science topics.\n",
    "chinese_title": "语法高亮是信息通道的浪费 (2020)",
    "chinese_summary": "The author argues that syntax highlighting, while useful, is a wasted opportunity for leveraging color as an information channel in code.  They propose \"semantic highlighting\" – dynamically coloring code based on its *meaning* and the specific task at hand – as a more effective alternative.  Instead of simply differentiating syntax elements, semantic highlighting could highlight imports, argument types, potential exceptions, metadata (like functions called in failed tests), or even code characteristics like length or lack of documentation.\n\nThe author provides numerous examples of potential use cases, each offering variations for increased specificity. These include rainbow parenthesis, highlighting nested contexts, different types of imports, argument usage, variable types, exception handling, and even code metadata related to testing or code reviews.\n\nHowever, they acknowledge significant implementation challenges: creating the complex rules requires deep knowledge of the code's AST, project context, and runtime information; resolving conflicts between different highlighting rules with varying priorities is difficult; and existing editors are ill-equipped to handle dynamic, semantic highlighting overlays. Despite these hurdles, the author believes semantic highlighting is inevitable due to its potential advantages, though it will likely emerge first in simpler languages. They invite readers to subscribe to their newsletter for more updates on computer science topics.\n"
  },
  {
    "id": "45601750",
    "title": "TurboTax’s 20-year fight to stop Americans from filing taxes for free (2019)",
    "url": "https://www.propublica.org/article/inside-turbotax-20-year-fight-to-stop-americans-from-filing-their-taxes-for-free",
    "summary": "生成摘要时出错",
    "chinese_title": "TurboTax’s 20-year fight to stop Americans from filing taxes for free (2019)",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45615037",
    "title": "Firefox Interop Feature Ranking",
    "url": "https://interop-rank.jakearchibald.com/",
    "summary": "生成摘要时出错",
    "chinese_title": "Firefox Interop Feature Ranking",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45539079",
    "title": "JustSketchMe – Digital Posing Tool",
    "url": "https://justsketch.me",
    "summary": "生成摘要时出错",
    "chinese_title": "JustSketchMe – Digital Posing Tool",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45614547",
    "title": "Frank founder Charlie Javice sentenced for JPMorgan fraud",
    "url": "https://www.bbc.com/news/articles/c4gwj15djdxo",
    "summary": "生成摘要时出错",
    "chinese_title": "Frank founder Charlie Javice sentenced for JPMorgan fraud",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45557669",
    "title": "Reworking Memory Management in CRuby",
    "url": "https://railsatscale.com/2025-09-16-reworking-memory-management-in-cruby/",
    "summary": "生成摘要时出错",
    "chinese_title": "Reworking Memory Management in CRuby",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45547891",
    "title": "Eon – An Effects-Based OCaml Nameserver",
    "url": "https://ryan.freumh.org/eon.html",
    "summary": "生成摘要时出错",
    "chinese_title": "Eon – 基于效果的 OCaml 域名服务器",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45586339",
    "title": "FSF announces Librephone project",
    "url": "https://www.fsf.org/news/librephone-project",
    "summary": "生成摘要时出错",
    "chinese_title": "FSF announces Librephone project",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45607822",
    "title": "SWE-Grep and SWE-Grep-Mini: RL for Fast Multi-Turn Context Retrieval",
    "url": "https://cognition.ai/blog/swe-grep",
    "summary": "生成摘要时出错",
    "chinese_title": "SWE-Grep and SWE-Grep-Mini: RL for Fast Multi-Turn Context Retrieval",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45609251",
    "title": "Apple M4 Series Feature Support",
    "url": "https://asahilinux.org/docs/platform/feature-support/m4/",
    "summary": "生成摘要时出错",
    "chinese_title": "Apple M4 Series Feature Support",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45617352",
    "title": "Two Southern California men charged and arrested for homelessness funding fraud",
    "url": "https://www.cbsnews.com/losangeles/news/homelessness-funding-fraud-federal-criminal-cases-2-southern-california-men/",
    "summary": "生成摘要时出错",
    "chinese_title": "Two Southern California men charged and arrested for homelessness funding fraud",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45615938",
    "title": "First long-acting hair regrowth pill hailed as 'new benchmark'",
    "url": "https://newatlas.com/health-wellbeing/long-acting-hair-regrowth-pill/",
    "summary": "生成摘要时出错",
    "chinese_title": "First long-acting hair regrowth pill hailed as 'new benchmark'",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45595403",
    "title": "Claude Haiku 4.5",
    "url": "https://www.anthropic.com/news/claude-haiku-4-5",
    "summary": "生成摘要时出错",
    "chinese_title": "Claude Haiku 4.5",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45580981",
    "title": "DOJ seizes $15B in Bitcoin from 'pig butchering' scam based in Cambodia",
    "url": "https://www.cnbc.com/2025/10/14/bitcoin-doj-chen-zhi-pig-butchering-scam.html",
    "summary": "生成摘要时出错",
    "chinese_title": "DOJ seizes $15B in Bitcoin from 'pig butchering' scam based in Cambodia",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45606070",
    "title": "Improving the Trustworthiness of JavaScript on the Web",
    "url": "https://blog.cloudflare.com/improving-the-trustworthiness-of-javascript-on-the-web/",
    "summary": "生成摘要时出错",
    "chinese_title": "Improving the Trustworthiness of JavaScript on the Web",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45613898",
    "title": "Tragic OceanGate Titan submersible's $62 SanDisk memory card found undamaged",
    "url": "https://www.tomshardware.com/pc-components/microsd-cards/tragic-oceangate-titan-submersibles-usd62-sandisk-memory-card-found-undamaged-at-wreckage-site-12-stills-and-nine-videos-have-been-recovered-but-none-from-the-fateful-implosion",
    "summary": "生成摘要时出错",
    "chinese_title": "Tragic OceanGate Titan submersible's $62 SanDisk memory card found undamaged",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45557591",
    "title": "Silver Snoopy Award",
    "url": "https://www.nasa.gov/space-flight-awareness/silver-snoopy-award/",
    "summary": "生成摘要时出错",
    "chinese_title": "Silver Snoopy Award",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45539262",
    "title": "Flies keep landing on North Sea oil rigs",
    "url": "https://theconversation.com/thousands-of-flies-keep-landing-on-north-sea-oil-rigs-then-taking-off-a-few-hours-later-heres-why-265622",
    "summary": "生成摘要时出错",
    "chinese_title": "Flies keep landing on North Sea oil rigs",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45545017",
    "title": "The people rescuing forgotten knowledge trapped on old floppy disks",
    "url": "https://www.bbc.com/future/article/20251009-rescuing-knowledge-trapped-on-old-floppy-disks",
    "summary": "生成摘要时出错",
    "chinese_title": "The people rescuing forgotten knowledge trapped on old floppy disks",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45617123",
    "title": "The Joys of 'Urban Geology'",
    "url": "https://www.bbc.com/future/article/20251017-urban-geology-how-to-find-fossils-and-other-discoveries-in-your-citys-buildings",
    "summary": "生成摘要时出错",
    "chinese_title": "The Joys of 'Urban Geology'",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45601982",
    "title": "Upcoming Rust language features for kernel development",
    "url": "https://lwn.net/Articles/1039073/",
    "summary": "生成摘要时出错",
    "chinese_title": "Upcoming Rust language features for kernel development",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45542536",
    "title": "Build a Superscalar 8-Bit CPU (YouTube Playlist) [video]",
    "url": "https://www.youtube.com/watch?v=bwjMLyBU4RU&list=PLyR4neQXqQo5nPdEiMbaEJxWiy_UuyNN4&index=1",
    "summary": "生成摘要时出错",
    "chinese_title": "Build a Superscalar 8-Bit CPU (YouTube Playlist) [video]",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45611252",
    "title": "K8s with 1M Nodes",
    "url": "https://bchess.github.io/k8s-1m/",
    "summary": "生成摘要时出错",
    "chinese_title": "K8s with 1M Nodes",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45611746",
    "title": "Automerge",
    "url": "https://automerge.org/",
    "summary": "生成摘要时出错",
    "chinese_title": "Automerge",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45564042",
    "title": "State of AI Report 2025",
    "url": "https://www.stateof.ai/",
    "summary": "生成摘要时出错",
    "chinese_title": "State of AI Report 2025",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45610620",
    "title": "Hacker News – The Good Parts",
    "url": "https://smartmic.bearblog.dev/why-hacker-news/",
    "summary": "生成摘要时出错",
    "chinese_title": "Hacker News – The Good Parts",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45602676",
    "title": "Liquibase continues to advertise itself as \"open source\" despite license switch",
    "url": "https://github.com/liquibase/liquibase/issues/7374",
    "summary": "生成摘要时出错",
    "chinese_title": "Liquibase continues to advertise itself as \"open source\" despite license switch",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45546575",
    "title": "What is going on with all this radioactive shrimp?",
    "url": "https://www.consumerreports.org/health/food-safety/radioactive-shrimp-explained-a5493175857/",
    "summary": "生成摘要时出错",
    "chinese_title": "What is going on with all this radioactive shrimp?",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45588689",
    "title": "Just talk to it – A way of agentic engineering",
    "url": "https://steipete.me/posts/just-talk-to-it",
    "summary": "生成摘要时出错",
    "chinese_title": "Just talk to it – A way of agentic engineering",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45596059",
    "title": "Recursive Language Models (RLMs)",
    "url": "https://alexzhang13.github.io/blog/2025/rlm/",
    "summary": "生成摘要时出错",
    "chinese_title": "Recursive Language Models (RLMs)",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45608887",
    "title": "A conspiracy to kill IE6 (2019)",
    "url": "https://blog.chriszacharias.com/a-conspiracy-to-kill-ie6",
    "summary": "生成摘要时出错",
    "chinese_title": "A conspiracy to kill IE6 (2019)",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45602197",
    "title": "The Hidden Math of Ocean Waves Crashes Into View",
    "url": "https://www.quantamagazine.org/the-hidden-math-of-ocean-waves-crashes-into-view-20251015/",
    "summary": "生成摘要时出错",
    "chinese_title": "The Hidden Math of Ocean Waves Crashes Into View",
    "chinese_summary": "生成摘要时出错"
  }
]