[
  {
    "id": "46079721",
    "title": "Can Dutch universities do without Microsoft?",
    "url": "https://dub.uu.nl/en/news/can-dutch-universities-do-without-microsoft",
    "summary": "A HOP (Hoger Onderwijs Persbureau) article titled \"Can Dutch universities do without Microsoft?\" likely explores the possibility and challenges of Dutch universities reducing or eliminating their reliance on Microsoft products and services. The article likely delves into factors such as:\n\n*   **Dominance of Microsoft:** The extent to which Dutch universities are currently dependent on Microsoft software (e.g., Windows, Office 365, Teams) for education, research, and administrative tasks.\n*   **Cost Considerations:** The financial implications of using Microsoft products, including licensing fees and potential cost savings from switching to alternative solutions.\n*   **Privacy Concerns:** Concerns regarding data privacy and security associated with using Microsoft's cloud services, especially in light of European data protection regulations (GDPR).\n*   **Availability of Alternatives:** The article would probably address existing open-source or other commercial alternatives to Microsoft products that could potentially meet the needs of universities. It might mention specific software suites like LibreOffice or collaborative platforms like Nextcloud.\n*   **Technical Feasibility:** The technical challenges of migrating away from Microsoft, including compatibility issues, staff training, and the integration of new systems.\n*   **Impact on Research:** The article would consider the potential effects of a shift away from Microsoft on research activities, especially those relying on specific Microsoft tools or platforms.\n*   **Stakeholder Perspectives:** It would likely include viewpoints from university administrators, IT staff, researchers, and students regarding the feasibility and desirability of reducing reliance on Microsoft.\n*   **Arguments For and Against:** The piece probably presents a balanced argument, outlining both the benefits (e.g., cost savings, increased data privacy) and drawbacks (e.g., technical challenges, user adoption) of such a transition.\n*   **University Pilots/Examples:** It might mention specific Dutch universities that have already taken steps to reduce their reliance on Microsoft or are considering doing so.\n",
    "chinese_title": "荷兰大学能否摆脱微软？",
    "chinese_summary": "荷兰大学能否摆脱微软？（一篇Hoger Onderwijs Persbureau文章探讨荷兰大学减少或消除对微软产品和服务依赖的可能性和挑战，可能深入探讨以下因素：\n\n*   微软的主导地位：荷兰大学目前在教育、研究和行政任务方面对微软软件（如Windows、Office 365、Teams）的依赖程度。\n*   成本考量：使用微软产品的财务影响，包括许可费以及切换到替代解决方案可能节省的成本。\n*   隐私担忧：与使用微软云服务相关的数据隐私和安全担忧，尤其是在欧洲数据保护法规（GDPR）的背景下。\n*   替代方案的可用性：文章可能讨论现有的开源或其他商业替代方案，这些方案可能满足大学的需求。它可能会提到具体的软件套件，如LibreOffice，或协作平台，如Nextcloud。\n*   技术可行性：迁移离开微软的技术挑战，包括兼容性问题、员工培训以及新系统的集成。\n*   对研究的影响：文章将考虑摆脱微软对研究活动的潜在影响，特别是那些依赖于特定微软工具或平台的研究。\n*   利益相关者的观点：它可能包括大学管理人员、IT人员、研究人员和学生关于减少对微软依赖的可行性和愿望的观点。\n*   赞成和反对的论点：文章可能提出了一个平衡的论点，概述了这种转变的优点（例如，节省成本、提高数据隐私）和缺点（例如，技术挑战、用户采用）。\n*   大学试点/案例：它可能会提到已经采取措施减少对微软依赖或正在考虑这样做的具体荷兰大学。）"
  },
  {
    "id": "46080143",
    "title": "True P2P Email on Top of Yggdrasil Network",
    "url": "https://github.com/JB-SelfCompany/Tyr",
    "summary": "Tyr is an Android app aiming to provide truly peer-to-peer email communication leveraging the Yggdrasil Network. Unlike traditional email, Tyr eliminates the need for centralized mail servers, message encryption layers (as Yggdrasil handles it), and port forwarding. It offers censorship resistance and allows users to control their email infrastructure.\n\nKey features include integration with DeltaChat and ArcaneChat, a local SMTP/IMAP server, automatic Ed25519 key generation for email identity, configurable Yggdrasil peer connections, auto-start on boot, encrypted backup/restore, and automatic recovery from Android Keystore issues.\n\nTyr runs a full email server (Yggmail, written in Go) directly on the Android device, exposing standard SMTP/IMAP protocols on localhost. Email addresses are cryptographically derived from the user's public key ( `<64-hex-characters>@yggmail`), ensuring verifiable identity and preventing spoofing.\n\nSetting up Tyr with DeltaChat/ArcaneChat allows for a fully decentralized messaging experience where messages are sent directly between users via Yggdrasil, bypassing central servers. Setup can be done automatically via a button or manually through configuring a DeltaChat/ArcaneChat profile to point to the local Tyr server.\n\nThe project includes security features like Android Keystore encryption for passwords, automatic Keystore recovery, Yggdrasil network encryption, local-only port access, cryptographic identity, and encrypted backups. Tyr is open-source.\n",
    "chinese_title": "基于Yggdrasil网络的真正P2P邮件",
    "chinese_summary": "Tyr：一款利用Yggdrasil网络的真正点对点电子邮件通讯安卓应用。与传统电子邮件不同，Tyr无需中心化邮件服务器、消息加密层（Yggdrasil已处理）和端口转发。它具有抗审查性，并允许用户控制其电子邮件基础设施。\n\n主要功能包括与DeltaChat和ArcaneChat集成、本地SMTP/IMAP服务器、用于电子邮件身份的自动Ed25519密钥生成、可配置的Yggdrasil对等连接、开机自启动、加密备份/恢复以及自动从Android Keystore问题中恢复。\n\nTyr直接在Android设备上运行一个完整的电子邮件服务器（Yggmail，用Go编写），在localhost上暴露标准SMTP/IMAP协议。电子邮件地址通过用户的公钥加密派生（`<64位十六进制字符>@yggmail`），确保可验证的身份并防止欺骗。\n\n将Tyr与DeltaChat/ArcaneChat配合使用，可以实现完全去中心化的消息传递体验，消息通过Yggdrasil直接在用户之间发送，绕过中心服务器。可以通过按钮自动设置，也可以通过配置DeltaChat/ArcaneChat配置文件以指向本地Tyr服务器来手动设置。\n\n该项目包括安全功能，如用于密码的Android Keystore加密、自动Keystore恢复、Yggdrasil网络加密、本地专用端口访问、加密身份以及加密备份。Tyr是开源的。"
  },
  {
    "id": "46079785",
    "title": "Don't tug on that, you never know what it might be attached to",
    "url": "https://blog.plover.com/2016/07/01/#tmpdir",
    "summary": "Mark Dominus recounts his debugging journey when his `also` script, which uses `emacsclient` to open files in Emacs, stopped working with an error message indicating the server socket couldn't be found. The problem stemmed from a mismatch in where Emacs and `emacsclient` were looking for the socket.\n\nHe discovered that the `TMPDIR` environment variable, set by a system administrator script, was causing `emacsclient` to look for the socket in `/mnt/tmp`, while Emacs was creating it in `/tmp`. Initially, he suspected Emacs wasn't respecting `TMPDIR`, but further investigation revealed that a Perl script, `git-re-edit`, invoked via Git, was somehow unsetting `TMPDIR`.\n\nThe core mystery was why Perl was removing `TMPDIR`. This was puzzling as it only affected `TMPDIR` and not other environment variables. Eventually, with help from others, the issue was traced to a security measure within the Perl installation that strips `TMPDIR` to prevent privilege escalation attacks. Setting `TMPDIR` could trick a program into writing temporary files to a location controlled by the attacker, potentially overwriting important files.\n\nDominus devised two workarounds: using a TCP socket for Emacs instead of a Unix-domain socket, and setting a custom environment variable, `EMACS_SERVER_SOCKET`, to explicitly tell `emacsclient` where to find the Unix-domain socket.\n",
    "chinese_title": "别拽那个，你永远不知道它连着什么。",
    "chinese_summary": "马克·多米努斯讲述了他的调试历程：他的 `also` 脚本（使用 `emacsclient` 在 Emacs 中打开文件）停止工作，并显示错误信息，指示无法找到服务器套接字。问题根源在于 Emacs 和 `emacsclient` 查找套接字的位置不匹配。\n\n他发现，系统管理员脚本设置的 `TMPDIR` 环境变量导致 `emacsclient` 在 `/mnt/tmp` 中查找套接字，而 Emacs 则在 `/tmp` 中创建它。 最初，他怀疑 Emacs 不尊重 `TMPDIR`，但进一步调查显示，通过 Git 调用的 Perl 脚本 `git-re-edit` 以某种方式取消设置了 `TMPDIR`。\n\n核心问题是为什么 Perl 会删除 `TMPDIR`。 令人困惑的是，它只影响 `TMPDIR`，而不影响其他环境变量。 最终，在其他人的帮助下，问题被追溯到 Perl 安装中的一项安全措施，该措施会剥离 `TMPDIR` 以防止权限提升攻击。 设置 `TMPDIR` 可能会诱使程序将临时文件写入攻击者控制的位置，从而可能覆盖重要文件。\n\n多米努斯设计了两种解决方法：使用 TCP 套接字代替 Unix 域套接字用于 Emacs，以及设置自定义环境变量 `EMACS_SERVER_SOCKET`，以明确告诉 `emacsclient` 在哪里找到 Unix 域套接字。"
  },
  {
    "id": "46080381",
    "title": "200 Lines of Python beats $50M supercomputer – Navier-Stokes at Re=10⁸ [pdf]",
    "url": "https://philpapers.org/archive/CAMIIA-3.pdf",
    "summary": "Based on the title, the article makes a bold claim: that a fluid dynamics simulation based on the Navier-Stokes equations, achievable with just 200 lines of Python code, rivals the performance of a supercomputer costing $50 million. The Reynolds number (Re) of 10⁸ indicates a highly turbulent flow regime, making the simulation computationally challenging.\n\nHowever, the provided content appears to be a truncated and corrupted PDF document. It consists mostly of binary data and PDF object definitions, providing no actual textual content that can substantiate or refute the title's claim. There's nothing to determine the accuracy of the simulation, the methodology employed, the specific hardware used, or the details of the comparison with the supercomputer.\nTherefore, a summary of the article's content is impossible as the textual content is missing.  All that is apparent is the article's purported title and the format of a PDF document.\n",
    "chinese_title": "200行Python代码胜过5000万美元的超级计算机 – Re=10⁸下的Navier-Stokes方程 [pdf]",
    "chinese_summary": "基于标题，该文章做出了大胆的声明：仅用200行Python代码实现的基于纳维-斯托克斯方程的流体动力学模拟，其性能可以媲美价值5000万美元的超级计算机。雷诺数(Re)为10⁸表明存在高度湍流状态，使得模拟在计算上具有挑战性。\n\n然而，所提供的文档似乎是一个被截断和损坏的PDF文档，主要由二进制数据和PDF对象定义组成，没有实际的文本内容来证实或反驳标题的声明。 无法确定模拟的准确性、所采用的方法、所使用的具体硬件，或者与超级计算机进行比较的细节。\n\n因此，由于缺少文本内容，无法总结文章的内容。 唯一显而易见的是文章的标题以及PDF文档的格式。"
  },
  {
    "id": "46039317",
    "title": "Atuin’s New Runbook Execution Engine",
    "url": "https://blog.atuin.sh/introducing-the-new-runbook-execution-engine/",
    "summary": "Atuin Desktop has released a major architectural update with a redesigned runbook execution engine, addressing issues like flaky context and inconsistent execution. The new engine provides persistent and reproducible runbooks, maintaining state across app restarts and ensuring predictable behavior.\n\nKey improvements include:\n\n*   **Persistent Context:** Runbooks retain execution state, eliminating the need to re-run blocks.\n*   **Reproducible Execution:** Blocks only influence those below them, creating a predictable workflow.\n*   **Templates Everywhere:** Template system applied to all user inputs, including variable names and context blocks.\n*   **Self-Referential Variables:** Variables can refer to themselves for transformations.\n*   **Two Types of Context:** Passive context (working directory, env vars) persists automatically. Active context (block output) is set during execution.\n\nThe update removes global context dependency and replaces the editor variable sync with manual updating. Script variables now only capture stdout.\n\nFuture plans include a CLI runner for executing runbooks without Atuin Desktop, improved serial execution, secrets management, and markdown-based runbooks. The new engine lays the groundwork for real-time collaborative execution and is available in v0.2.0.\n",
    "chinese_title": "Atuin 的新 Runbook 执行引擎",
    "chinese_summary": "Atuin Desktop发布重大架构更新，重新设计了runbook执行引擎，解决了诸如上下文不稳定和执行不一致等问题。新引擎提供持久且可复现的runbook，在应用程序重启后保持状态并确保可预测的行为。\n\n主要改进包括：\n\n*   **持久上下文：** Runbook保留执行状态，无需重新运行代码块。\n*   **可复现执行：** 代码块仅影响其下方的代码块，从而创建可预测的工作流程。\n*   **模板无处不在：** 模板系统应用于所有用户输入，包括变量名和上下文代码块。\n*   **自引用变量：** 变量可以引用自身以进行转换。\n*   **两种类型的上下文：** 被动上下文（工作目录、环境变量）自动持久化。 主动上下文（代码块输出）在执行期间设置。\n\n此次更新移除了全局上下文依赖性，并将编辑器变量同步替换为手动更新。 脚本变量现在仅捕获stdout。\n\n未来的计划包括一个用于在没有Atuin Desktop的情况下执行runbook的CLI运行器、改进的串行执行、秘密管理以及基于Markdown的runbook。 新引擎为实时协作执行奠定了基础，并已在v0.2.0中提供。"
  },
  {
    "id": "46079868",
    "title": "Meta hiding $27B in debt using advanced geometry",
    "url": "https://stohl.substack.com/p/exclusive-credit-report-shows-meta",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "Meta用高等几何隐藏270亿美元债务",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "46075882",
    "title": "Show HN: Glasses to detect smart-glasses that have cameras",
    "url": "https://github.com/NullPxl/banrays",
    "summary": "This \"Show HN\" post details the development of \"Ban-Rays,\" glasses designed to detect smart glasses with cameras, like Meta Raybans. The project explores two main detection methods: optics and networking.\n\nThe optics approach utilizes the retro-reflectivity of camera lenses, where infrared (IR) light is reflected directly back at the source. The initial experiments with IR LEDs and a photodiode proved inconsistent in differentiating camera lenses from other reflective surfaces. Different wavelengths and sweeping patterns were tested, but yielded weak and unreliable signals.\n\nThe networking approach focuses on Bluetooth Low Energy (BLE) fingerprinting. The developer discovered that Meta Raybans broadcast detectable BLE advertisements during pairing and power-on, containing Meta-specific identifiers. The challenge lies in detecting these advertisements during active usage, which would require capturing specific communication packets. The developer is exploring using an nRF module for more advanced Bluetooth analysis. Bluetooth Classic (BTC) traffic analysis is also considered but requires more specialized and expensive hardware.\n\nThe author includes a logbook style update detailing the challenges and findings so far, and outlines future steps for both approaches, including experimenting with sweeping patterns, data from different wavelengths, and active probing. The post concludes with acknowledgements to individuals providing guidance and loaning equipment for testing.\n",
    "chinese_title": "Show HN: 用眼镜检测带摄像头的智能眼镜",
    "chinese_summary": "这个“Show HN”帖子详细介绍了“Ban-Rays”的开发，这是一款旨在检测带有摄像头的智能眼镜（如Meta Raybans）的眼镜。该项目探索了两种主要的检测方法：光学和网络。\n\n光学方法利用相机镜头的逆反射性，红外（IR）光会直接反射回光源。使用红外LED和光电二极管的初步实验表明，在区分相机镜头和其他反射表面方面效果不稳定。虽然测试了不同的波长和扫描模式，但产生的信号微弱且不可靠。\n\n网络方法侧重于低功耗蓝牙（BLE）指纹识别。开发者发现Meta Raybans在配对和开机期间会广播可检测的BLE广播，其中包含Meta特定的标识符。挑战在于在使用过程中检测这些广播，这需要捕获特定的通信数据包。开发者正在探索使用nRF模块进行更高级的蓝牙分析。蓝牙经典（BTC）流量分析也在考虑之中，但需要更专业且昂贵的硬件。\n\n作者以日志形式更新，详细介绍了迄今为止的挑战和发现，并概述了两种方法的未来步骤，包括试验扫描模式、来自不同波长的数据以及主动探测。该帖子最后感谢了为测试提供指导和借用设备的人员。"
  },
  {
    "id": "46079987",
    "title": "AI Adoption Rates Starting to Flatten Out",
    "url": "https://www.apolloacademy.com/ai-adoption-rates-starting-to-flatten-out/",
    "summary": "This article, dated November 28, 2025, by Apollo Chief Economist Torsten Sløk, reports that AI adoption rates across all firm sizes are starting to flatten. The analysis uses data from the US Census Bureau and Ramp, specifically the Ramp AI Index, which measures AI product and service adoption among over 40,000 American businesses. The Ramp AI Index utilizes corporate card and bill pay data, encompassing billions of dollars in spending. The data is presented as a six-survey moving average from a bi-weekly survey.\n\nThe article emphasizes that the information presented should not be distributed without Apollo Global Management's express consent. It also includes a comprehensive disclaimer, stating that Apollo does not guarantee the accuracy of the information, which is subject to change. It clarifies that the presentation is not investment advice and that readers should consult their own advisors. Finally, it cautions readers regarding forward-looking statements and their inherent uncertainties.\n",
    "chinese_title": "人工智能采纳率开始趋于平缓",
    "chinese_summary": "人工智能普及率趋于平缓\n\n这篇文章由阿波罗首席经济学家托斯滕·斯洛克于2025年11月28日发表，报告指出各种规模的公司采用人工智能的比率开始趋于平缓。该分析使用了美国人口普查局和Ramp的数据，特别是Ramp人工智能指数，该指数衡量了超过4万家美国企业对人工智能产品和服务的采用情况。Ramp人工智能指数利用公司信用卡和账单支付数据，涵盖数十亿美元的支出。这些数据以双周调查的六次调查移动平均线形式呈现。\n\n文章强调，未经阿波罗全球管理公司明确同意，不得分发所提供的信息。 它还包括一份全面的免责声明，声明阿波罗不保证信息的准确性，这些信息可能会发生变化。它明确指出，该演示文稿不是投资建议，读者应咨询自己的顾问。 最后，它提醒读者注意前瞻性陈述及其固有的不确定性。"
  },
  {
    "id": "46078770",
    "title": "Petition to formally recognize open source work as civic service in Germany",
    "url": "https://www.openpetition.de/petition/online/anerkennung-von-open-source-arbeit-als-ehrenamt-in-deutschland#petition-main",
    "summary": "The article likely discusses a petition in Germany advocating for the formal recognition of open-source work as a form of civic service (Ehrenamt). This suggests that open-source developers are pushing for their contributions to be considered equivalent to traditional volunteer work, like that done in clubs and associations (Vereinsarbeit). The news items indicate that this issue is currently receiving attention in Germany.\n\nThe core argument likely revolves around the idea that open-source development benefits society, similar to other forms of volunteer work, and therefore deserves similar recognition and potentially benefits (such as tax breaks, recognition on resumes, or other forms of government support given to volunteers).\n",
    "chinese_title": "请愿书：正式承认开源工作为德国公民服务",
    "chinese_summary": "德国请愿活动呼吁正式承认开源工作为志愿服务"
  },
  {
    "id": "46080473",
    "title": "Bringing Sexy Back. Internet surveillance has killed eroticism",
    "url": "https://lux-magazine.com/article/privacy-eroticism/",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "重塑性感：网络监控扼杀了情色。",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "46077038",
    "title": "Tech Titans Amass Multimillion-Dollar War Chests to Fight AI Regulation",
    "url": "https://www.wsj.com/tech/ai/tech-titans-amass-multimillion-dollar-war-chests-to-fight-ai-regulation-88c600e1",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "科技巨头囤积数百万美元资金对抗人工智能监管",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "46012803",
    "title": "Moss: a Rust Linux-compatible kernel in 26,000 lines of code",
    "url": "https://github.com/hexagonal-sun/moss",
    "summary": "Moss is a Unix-like, Linux-compatible kernel written in Rust and Aarch64 assembly, aiming for binary compatibility with Linux userspace applications. Its core is asynchronous, leveraging Rust's async/await for concurrency, preventing common kernel deadlocks. The kernel has a modular architecture with a Hardware Abstraction Layer (HAL) for easy porting to different architectures like x86_64 and RISC-V.\n\nKey features include full Aarch64 support, MMU enablement, Copy-on-Write pages, and kernel/userspace page fault management. It implements process management with scheduling, task migration, and 51 Linux syscalls, sufficient to run most BusyBox commands. The VFS and filesystem support includes Ramdisk, FAT32 (read-only), and devtmpfs drivers.\n\nMoss relies on `libkernel`, an architecture-agnostic utility library, enabling logic testing on host machines before deployment on bare metal. It includes strong typing for address types, containers, sync primitives, and a comprehensive test suite.\n\nBuilding and running involves using QEMU for Aarch64 emulation and `dosfstools` to create the virtual filesystem. The provided scripts simplify image creation and kernel execution within QEMU. The test suite can be run on x86_64 Linux.\n\nThe project roadmap includes expanding syscall compatibility, developing a networking stack (TCP/IP), improving the scheduler, and implementing a read/write filesystem driver. Contributions are welcome under the MIT License.\n",
    "chinese_title": "Moss: 一个用 Rust 编写的 Linux 兼容内核，仅需 26000 行代码",
    "chinese_summary": "Moss：用 Rust 和 Aarch64 汇编写成的类 Unix、Linux 兼容内核，旨在与 Linux 用户空间应用程序实现二进制兼容。其核心是异步的，利用 Rust 的 async/await 实现并发，防止常见的内核死锁。该内核采用模块化架构，具有硬件抽象层 (HAL)，便于移植到不同的架构，如 x86_64 和 RISC-V。\n\n主要特性包括完整的 Aarch64 支持、MMU 启用、写时复制页面以及内核/用户空间页面错误管理。它实现了带有调度、任务迁移和 51 个 Linux 系统调用的进程管理，足以运行大多数 BusyBox 命令。VFS 和文件系统支持包括 Ramdisk、FAT32（只读）和 devtmpfs 驱动程序。\n\nMoss 依赖于 `libkernel`，一个架构无关的实用程序库，可以在部署到裸机之前在主机上进行逻辑测试。它包括地址类型、容器、同步原语的强类型和一个全面的测试套件。\n\n构建和运行涉及使用 QEMU 进行 Aarch64 仿真以及 `dosfstools` 创建虚拟文件系统。提供的脚本简化了 QEMU 中镜像创建和内核执行的过程。测试套件可以在 x86_64 Linux 上运行。\n\n该项目路线图包括扩展系统调用兼容性、开发网络堆栈 (TCP/IP)、改进调度器以及实现读/写文件系统驱动程序。欢迎在 MIT 许可证下进行贡献。"
  },
  {
    "id": "46075320",
    "title": "Pocketbase – open-source realtime back end in 1 file",
    "url": "https://pocketbase.io/",
    "summary": "This is a minimal blurb promoting Pocketbase, an open-source, real-time backend solution. The core selling point is its simplicity, being contained within a single file. This suggests ease of deployment, management, and potentially a smaller footprint than traditional backend frameworks. The promotion encourages users to explore the functionality through a live demo and delve into the details via the official documentation. The key takeaway is that Pocketbase offers a quick and straightforward way to set up a backend for applications requiring real-time capabilities, all bundled within a single, manageable file.\n",
    "chinese_title": "Pocketbase – 单文件开源实时后端",
    "chinese_summary": "Pocketbase：单文件实时后端解决方案，简单易用。访问演示，查阅文档。"
  },
  {
    "id": "46080161",
    "title": "Stellantis Is Spamming Owners' Screens with Pop-Up Ads for New Car Discounts",
    "url": "https://www.thedrive.com/news/stellantis-is-spamming-owners-screens-with-pop-up-ads-for-new-car-discounts",
    "summary": "Stellantis is facing backlash for displaying pop-up ads on the infotainment screens of their vehicles, offering discounts on new car purchases. The issue came to light when car enthusiast Zerin Dube posted a photo of a marketing notification on his Jeep Grand Cherokee's screen, promoting a $1,500 loyalty offer.\n\nWhile Dube ended up using the offer to buy a new Jeep Wrangler, many other owners expressed annoyance and criticism, vowing to avoid the brand in the future. They shared screenshots of similar ads appearing on Chrysler and Ram vehicles.\n\nStellantis defended the practice, stating they use the in-vehicle messaging system to stay in contact with owners and provide important updates like recall notices. They claim the marketing notifications are designed to be minimally intrusive, appearing only when the car is stationary and disappearing quickly. The company also says drivers can opt out of these messages by contacting customer care.\n\nDespite the negative reactions, Stellantis asserts the offers have been successful in driving sales. The article notes that Stellantis is stacking discounts, including the loyalty bonus, to boost sales in a competitive market, particularly against the Ford Bronco. However, the practice of using in-car screens for advertising raises concerns about privacy and potential distractions for drivers. This isn't the first time Stellantis has used in-car screens for advertising, as they previously promoted extended warranties in a similar fashion.\n",
    "chinese_title": "Stellantis用弹窗广告轰炸车主屏幕，推销新车折扣",
    "chinese_summary": "Stellantis因在其车辆的信息娱乐屏幕上显示弹出广告，提供新车购买折扣而面临强烈反对。 汽车爱好者Zerin Dube在他的吉普大切诺基屏幕上发布了一张营销通知照片，宣传1500美元的忠诚度优惠，该问题由此曝光。\n\n虽然Dube最终使用了该优惠购买了一辆新的吉普牧马人，但许多其他车主表达了不满和批评，并誓言未来将避免购买该品牌。 他们分享了在克莱斯勒和Ram车辆上出现类似广告的截图。\n\nStellantis为这种做法辩护，称他们使用车载消息系统与车主保持联系，并提供重要的更新，例如召回通知。 他们声称这些营销通知旨在尽可能减少干扰，仅在汽车静止时出现并迅速消失。 该公司还表示，驾驶员可以通过联系客服选择退出这些消息。\n\n尽管面临负面反应，Stellantis声称这些优惠在推动销售方面取得了成功。 文章指出，Stellantis正在叠加折扣，包括忠诚度奖励，以在竞争激烈的市场中促进销售，尤其是在与福特Bronco竞争时。 然而，使用车载屏幕进行广告宣传的做法引发了对隐私和驾驶员潜在分心的担忧。 这并非Stellantis首次使用车载屏幕进行广告宣传，他们之前也以类似的方式推广过延长保修期。"
  },
  {
    "id": "46077964",
    "title": "A Tale of Four Fuzzers",
    "url": "https://tigerbeetle.com/blog/2025-11-28-tale-of-four-fuzzers/",
    "summary": "This article details TigerBeetle's approach to testing its Adaptive Replication Routing (ARR) algorithm using multiple fuzzers. ARR dynamically optimizes replication topology in a distributed database cluster, improving performance and resilience by routing data through a ring of replicas.\n\nThe author argues that relying on a single, whole-system fuzzer is insufficient. A targeted fuzzer for each subsystem is crucial for deeper exploration and specific assertions. To achieve this, they advocate for creating minimal interfaces between the target component and the rest of the system, allowing for isolated and efficient fuzzing.\n\nThe article highlights the design of the ARR interface, focusing on simplicity by passing integers representing time and identifiers instead of complex data structures. This reduction of dependencies makes the system easier to fuzz.\n\nThe article introduces four different types of fuzzers used for ARR:\n\n1.  **Exhausting Positive Space Fuzzer:** Ensures serialization and deserialization of routes works correctly by generating random permutations and verifying round-trip encoding.\n\nThis part of the article ends here, and suggests the next section will elaborate the usage of the other 3 fuzzers.\n",
    "chinese_title": "四个模糊测试器的故事",
    "chinese_summary": "本文详细介绍了TigerBeetle如何使用多种模糊测试器来测试其自适应复制路由 (ARR) 算法。ARR动态优化分布式数据库集群中的复制拓扑，通过将数据路由到副本环来提高性能和弹性。\n\n作者认为，仅依靠单个、全系统的模糊测试器是不够的。针对每个子系统的有针对性的模糊测试器对于更深入的探索和特定的断言至关重要。为了实现这一点，他们主张在目标组件和系统的其余部分之间创建最小的接口，从而实现隔离和高效的模糊测试。\n\n本文重点介绍了ARR接口的设计，通过传递表示时间和标识符的整数而不是复杂的数据结构来关注简洁性。这种依赖性的减少使系统更容易进行模糊测试。\n\n本文介绍了用于ARR的四种不同类型的模糊测试器：\n\n1. **穷举正空间模糊测试器:** 通过生成随机排列并验证往返编码，确保路由的序列化和反序列化工作正常。\n\n文章的这部分到此结束，并表明下一节将详细说明其他3个模糊测试器的用法。"
  },
  {
    "id": "46079857",
    "title": "Playtiles: The Pocket-Sized Gaming Platform",
    "url": "https://get.playtil.es",
    "summary": "Playtiles is presented as a pocket-sized handheld gaming platform designed to cater to modern gamers who are disillusioned with current mobile gaming trends. It targets players who miss the tactile experience of physical buttons and are overwhelmed by massive game libraries, intrusive ads, and predatory microtransactions. Playtiles also aims to appeal to individuals who lack the time to dedicate to lengthy gaming experiences. The key selling point is offering a curated selection of fresh, instant-fun games delivered weekly, all while remaining affordable. Essentially, Playtiles promises a return to a simpler, more enjoyable handheld gaming experience, free from the common frustrations associated with mobile gaming.\n",
    "chinese_title": "掌上游戏砖：口袋里的游戏平台",
    "chinese_summary": "Playtiles：一款专为厌倦当下手游趋势的现代玩家设计的掌上游戏机。它面向那些怀念实体按键触感、对庞大游戏库、侵入式广告和掠夺性微交易感到厌烦的玩家。Playtiles也旨在吸引那些没有时间投入长时间游戏体验的个人。其主要卖点是以实惠的价格每周提供精选的新鲜、即时乐趣游戏。本质上，Playtiles承诺回归更简单、更愉快的掌上游戏体验，摆脱与手游相关的常见挫折。"
  },
  {
    "id": "46078138",
    "title": "A Remarkable Assertion from A16Z",
    "url": "https://nealstephenson.substack.com/p/a-remarkable-assertion-from-a16z",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "A16Z的惊人论断",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "46079460",
    "title": "Swedish publishers file police report against Meta's Zuckerberg for fraud",
    "url": "https://www.sverigesradio.se/artikel/swedish-publishers-file-police-report-against-metas-zuckerberg-for-fraud",
    "summary": "A Swedish publisher's association has filed a police report against Meta founder Mark Zuckerberg, alleging fraud. The report was filed with the Swedish police. The article identifies Roza Bicerroza.bicer@sverigesradio.se as the author, and indicates that the news falls under the categories of Swedish news, international news, crime, and IT and Media News. The provided text doesn't elaborate on the specific details of the alleged fraud.\n",
    "chinese_title": "瑞典出版商举报扎克伯格涉嫌欺诈",
    "chinese_summary": "瑞典出版商协会已向警方举报Meta创始人马克·扎克伯格涉嫌欺诈。该报告已提交瑞典警方。文章作者为Roza Bicerroza.bicer@sverigesradio.se，新闻类别为瑞典新闻、国际新闻、犯罪、IT与媒体新闻。提供的文本未详细说明涉嫌欺诈的具体细节。"
  },
  {
    "id": "46077106",
    "title": "A Repository with 44 Years of Unix Evolution",
    "url": "https://www.spinellis.gr/pubs/conf/2015-MSR-Unix-History/html/Spi15c.html",
    "summary": "This article describes the creation of a publicly available Git repository that tracks the 44-year evolution of the Unix operating system, from 1972 to 2015. The repository contains 659,000 commits and 2306 merges, representing the contributions of about 850 individuals from Bell Labs, Berkeley, and the FreeBSD Project.\n\nThe repository was built by synthesizing 24 snapshots of different Unix versions, legacy repositories (CSRG SCCS, FreeBSD 1 CVS), and the modern FreeBSD Git repository. A key aspect was reconstructing authorship information through primary research, as early snapshots lacked this data. This involved analyzing documents, code, and communicating with individuals involved in Unix development.\n\nThe repository structure uses tags and branches to mark significant releases (Research editions, BSD versions, FreeBSD releases) and development stages. A notable technique is the use of a \".ref\" directory to store previous snapshots. This ensures that `git blame` can trace code provenance across releases by detecting code movement without displaying the reference files. The repository also represents merges between releases accurately.\n\nThe article highlights the repository's value for empirical research in software engineering, information systems, and software archaeology. The repository, along with the tools used to create it, is publicly available, enabling researchers to recreate and analyze the evolution of Unix in detail.\n",
    "chinese_title": "拥有44年Unix演进历史的仓库",
    "chinese_summary": "本文介绍了如何创建一个公开可用的Git仓库，用于追踪Unix操作系统44年的演变历史，从1972年到2015年。该仓库包含65.9万次提交和2306次合并，代表了来自贝尔实验室、伯克利大学和FreeBSD项目的约850位个人的贡献。\n\n该仓库通过合成24个不同Unix版本的快照、遗留仓库（CSRG SCCS、FreeBSD 1 CVS）和现代FreeBSD Git仓库构建而成。一个关键方面是通过原始研究重建作者信息，因为早期的快照缺乏这些数据。这涉及到分析文档、代码，并与参与Unix开发的人员沟通。\n\n该仓库结构使用标签和分支来标记重要的发布版本（Research版、BSD版本、FreeBSD发布版）和开发阶段。一项值得注意的技术是使用“.ref”目录来存储先前的快照。这确保了`git blame`可以通过检测代码移动来追踪跨版本的代码出处，而无需显示引用文件。该仓库还准确地表示了版本之间的合并。\n\n本文强调了该仓库对于软件工程、信息系统和软件考古学领域的实证研究价值。该仓库以及用于创建它的工具都是公开可用的，使研究人员能够详细地重现和分析Unix的演变。"
  },
  {
    "id": "46079975",
    "title": "Artificial Computation",
    "url": "https://cultureandcommunication.org/galloway/artificial-computation",
    "summary": "This article explores the concept of \"artificial computation\" as a radical alternative to the dominant paradigm of digital computing, defined by the \"Principle of Sufficient Computation.\" This principle, derived from Turing's expansive definition of the computer, suggests that anything logically definable can be computationally executed. This leads to: action-centricity, the conflation of thought and execution, practical omniscience, and a system of judgment based on mimetic accuracy.\n\nHowever, the article proposes that artificial computation, discovered by Laruelle, operates *alongside* rather than *beyond* standard computing. It fundamentally challenges the Principle of Sufficient Computation by: preempting executable commands in favor of pure, immanent process; delinking thought and action; embracing radically finite knowledge based on axioms; and utilizing a non-mimetic technology of immanence.\n\nIn essence, artificial computation represents a withdrawal from the totalizing potential of conventional computing, seeking a form of thought \"liberated\" from traditional cybernetics and neurosciences. Though artificial computers haven't been invented yet, the theoretical framework for artificial computation proposes a generic thinking that transcends the limitations and assumptions inherent in standard computation and philosophical inquiry. Synonyms for artificial computation include non-computation, non-standard computation, compu-fiction, and computer fiction.\n",
    "chinese_title": "人工智能计算",
    "chinese_summary": "本文探讨了“人工计算”的概念，将其作为数字计算主导范式的激进替代方案，该范式由“充分计算原则”定义。这一原则源于图灵对计算机的广泛定义，认为任何逻辑上可定义的事物都可以通过计算来执行。这导致了：以行动为中心，思想与执行的混淆，实践上的全知，以及基于模仿精确性的判断体系。\n\n然而，本文提出，拉鲁埃尔发现的人工计算*与*标准计算*并行*运作，而非*超越*标准计算。它从根本上挑战了充分计算原则，具体体现为：倾向于纯粹的、内在的过程，而非先发制人地执行可执行的命令；将思想与行动分离；拥抱基于公理的、彻底有限的知识；以及利用非模仿性的内在性技术。\n\n本质上，人工计算代表着从传统计算的总体化潜力中撤退，寻求一种从传统控制论和神经科学中“解放”出来的思维形式。尽管人工计算机尚未被发明，但人工计算的理论框架提出了一种超越标准计算和哲学探究中固有限制和假设的通用思维。人工计算的同义词包括非计算、非标准计算、计算小说和计算机小说。"
  },
  {
    "id": "46078566",
    "title": "Writing Builds Resilience in Everyday Challenges by Changing Your Brain",
    "url": "https://scienceclock.com/writing-builds-resilience-in-everyday-challenges-by-changing-your-brain/",
    "summary": "This article explores how writing can build resilience in everyday challenges by changing the brain. It argues that writing, from casual texts to formal compositions, allows individuals to process emotions, create distance from pain, and shift from a state of overwhelm to grounded clarity.\n\nThe article highlights research from psychologist James Pennebaker, who developed expressive writing as a therapeutic technique. Expressive writing helps externalize emotional distress, signaling to the brain that it doesn't need to carry the burden. Translating emotions into words involves various brain regions associated with memory, decision-making, and language, supporting memory consolidation and reframing painful experiences.\n\nFurthermore, writing regulates emotions by calming the amygdala (the fear response center) and engaging the prefrontal cortex (responsible for goal-setting and problem-solving). This allows individuals to move from reaction to response and become aware of their feelings without being consumed by them. Even mundane writing tasks stimulate reasoning and decision-making.\n\nThe article emphasizes that writing is a meaning-making activity that fosters agency. It cites the field of writing studies, recognizing writing as a form of thinking that reshapes the mind and creates identity.\n\nFinally, it provides five research-backed tips for developing a resilience-building writing practice: write by hand, write daily, write before reacting, write a letter you never send, and treat writing as a process. The author concludes that writing is an ordinary form of adaptation, a constant process of transformation.\n",
    "chinese_title": "写作通过改变大脑来增强应对日常挑战的韧性",
    "chinese_summary": "写作如何通过改变大脑来建立应对日常挑战的韧性"
  },
  {
    "id": "46076642",
    "title": "SQLite as an Application File Format",
    "url": "https://sqlite.org/appfileformat.html",
    "summary": "This article advocates for using SQLite databases as application file formats, arguing they offer significant advantages over traditional methods like custom formats, pile-of-files, and wrapped pile-of-files formats.\n\nThe core argument is that SQLite provides a versatile, well-structured, and easily accessible way to store application state and data. It highlights benefits such as simplified application development (reduced code, proven reliability), single-file documents (easy to copy and move), a high-level query language (SQL), and accessible content (using standard tools).\n\nFurther advantages include cross-platform compatibility, atomic transactions (data integrity), incremental and continuous updates (performance and data safety), easy extensibility (adding features without breaking compatibility), and overall performance benefits (faster read/writes and start-up times). SQLite databases avoid the \"opaque blob\" nature of custom formats and offer more structure and querying capabilities than simple pile-of-files. The article emphasizes that an SQLite database can handle complex relationships and data structures efficiently and compactly, making it a superior choice for many application file format needs.\n",
    "chinese_title": "SQLite作为应用程序文件格式",
    "chinese_summary": "本文提倡使用SQLite数据库作为应用程序文件格式，认为其相对于传统方法（如自定义格式、文件堆和封装文件堆格式）具有显著优势。\n\n核心论点是SQLite提供了一种通用、结构良好且易于访问的方式来存储应用程序状态和数据。它强调了诸如简化应用程序开发（减少代码、经验证的可靠性）、单文件文档（易于复制和移动）、高级查询语言（SQL）以及可访问的内容（使用标准工具）等优点。\n\n其他优势包括跨平台兼容性、原子事务（数据完整性）、增量和持续更新（性能和数据安全）、易于扩展（添加功能而不破坏兼容性）以及整体性能优势（更快的读/写和启动时间）。SQLite数据库避免了自定义格式的“不透明blob”性质，并提供了比简单文件堆更强的结构和查询能力。文章强调，SQLite数据库可以高效紧凑地处理复杂的关系和数据结构，使其成为许多应用程序文件格式需求的更佳选择。"
  },
  {
    "id": "46079567",
    "title": "Generating 3D Meshes from Text",
    "url": "https://cprimozic.net/notes/posts/generating-3d-meshes-from-text/",
    "summary": "This article details the process of converting text into 3D meshes for use in the author's Geotoy project and Geoscript language. The author outlines a three-stage pipeline: SVG path generation, tessellation, and extrusion.\n\nFirst, the JavaScript library `svg-text-to-path` is used to convert text and font parameters into an SVG path. This is done via a small backend service leveraging Google Fonts and the fontkit backend. This service caches the path and extracts it from the generated SVG.\n\nNext, the Rust library `lyon` is employed to tessellate the SVG path into triangles. The `lyon_extra` crate parses the SVG path, and `lyon_tessellation` generates vertex and index buffers for the 2D mesh. A WebAssembly wrapper is implemented to interface with this library from the main application. The author adjusted the `FillTessellator` options to ensure correct handling of self-intersecting paths.\n\nFinally, the 2D mesh is extruded into 3D. This involves converting 2D vertices to 3D, flipping the winding order of triangles, creating duplicate vertices with an offset, and generating triangle strips to connect the top and bottom faces. The author's own mesh representation is used for this step. Correct handling of vertex indices is crucial to ensure the output mesh is 2-manifold and watertight.\n\nThe author integrates this functionality into Geoscript, reporting the process is performant and reliable across various fonts and even complex scripts. They are pleased with the results, achieving high-quality 3D meshes from text input.\n",
    "chinese_title": "从文本生成3D网格",
    "chinese_summary": "本文详细介绍了将文本转换为3D网格的过程，以用于作者的Geotoy项目和Geoscript语言。作者概述了一个三阶段流程：SVG路径生成、细分和拉伸。\n\n首先，使用JavaScript库`svg-text-to-path`将文本和字体参数转换为SVG路径。这是通过利用Google Fonts和fontkit后端的小型后端服务完成的。该服务缓存路径并从生成的SVG中提取它。\n\n接下来，使用Rust库`lyon`将SVG路径细分为三角形。`lyon_extra` crate解析SVG路径，而`lyon_tessellation`为2D网格生成顶点和索引缓冲区。实现了一个WebAssembly包装器，以便从主应用程序与该库进行交互。作者调整了`FillTessellator`选项，以确保正确处理自相交路径。\n\n最后，将2D网格拉伸为3D。这包括将2D顶点转换为3D，翻转三角形的绕组顺序，创建具有偏移的重复顶点，并生成三角条以连接顶部和底部面。作者自己的网格表示用于此步骤。正确处理顶点索引对于确保输出网格是2-流形且水密的至关重要。\n\n作者将此功能集成到Geoscript中，并报告该过程在各种字体甚至复杂脚本中都表现出高性能和可靠性。他们对结果感到满意，从文本输入中获得了高质量的3D网格。"
  },
  {
    "id": "46068138",
    "title": "Show HN: Spikelog – A simple metrics service for scripts, cron jobs, and MVPs",
    "url": "https://spikelog.com",
    "summary": "Spikelog is a simple metrics service designed for scripts, cron jobs, and MVPs that simplifies tracking key performance indicators. Instead of complex observability stacks, Spikelog offers a single API endpoint where users can POST numerical data associated with a chart name. The service then automatically generates a graph of this data over time, eliminating the need for extensive configuration, query languages, or dashboard building.\n\nThe core benefits of Spikelog include ease of use (setup involves just copying an API key and sending POST requests), automatic charting, and AI integration (using prompts to automatically identify and implement tracking). Spikelog is particularly useful for quickly determining if a job ran successfully, if user sign-ups occurred, or if a metric increased or decreased.\n\nSpikelog offers a free tier with 10 charts and 1,000 data points per chart, using a rolling window to ensure recent data is always available without retention management. It's built for side projects, MVPs, and small production systems, providing a lightweight alternative to full observability stacks like Grafana or more comprehensive solutions like Axiom (which are recommended for long retention, complex queries, and compliance needs). Simple threshold alerts are planned for future development.\n",
    "chinese_title": "Show HN: Spikelog – 脚本、定时任务和MVP的简单指标服务",
    "chinese_summary": "Spikelog：简易指标服务，专为脚本、定时任务和MVP设计，简化关键绩效指标的跟踪。无需复杂的监控堆栈，Spikelog提供单一API端点，用户可POST与图表名称关联的数值数据。服务自动生成随时间变化的图表，免去繁琐配置、查询语言或仪表盘构建。\n\nSpikelog的核心优势包括易用性（只需复制API密钥并发送POST请求即可设置）、自动绘图和AI集成（使用提示自动识别并实施跟踪）。Spikelog尤其适用于快速确定作业是否成功运行、用户注册是否发生，或指标是增加还是减少。\n\nSpikelog提供免费层级，包含10个图表，每个图表1,000个数据点，使用滚动窗口确保始终提供近期数据，无需保留管理。专为业余项目、MVP和小规模生产系统构建，是Grafana等完整监控堆栈或Axiom等更全面解决方案的轻量级替代方案（建议用于长期保留、复杂查询和合规性需求）。简单的阈值警报计划在未来开发。"
  },
  {
    "id": "46080424",
    "title": "Apple and Intel Rumored to Partner on Mac Chips",
    "url": "https://www.macrumors.com/2025/11/28/intel-rumored-to-supply-new-mac-chip/",
    "summary": "This article reports on a rumor from Apple supply chain analyst Ming-Chi Kuo that Apple may partner with Intel again, beginning as early as mid-2027, to manufacture its lower-end M-series chips (potentially M6 or M7). The partnership would involve Intel using its 18A process (a sub-2nm node) to manufacture Apple-designed chips based on Arm architecture, a shift from the previous Intel-designed x86 chips used in Macs.\n\nTSMC is expected to remain Apple's primary M-series chip supplier, while Intel's involvement would be limited to manufacturing. The rumor suggests Apple may utilize Intel to produce chips for devices like the MacBook Air, iPad Air, and iPad Pro.\n\nKuo posits that this move could serve two purposes: satisfying demands for \"Made in USA\" products, potentially echoing a Trump administration initiative, and diversifying Apple's manufacturing supply chain. Apple's transition away from Intel processors began in 2020, with their in-house M-series chips providing superior performance per watt. The article also notes that macOS Tahoe will be the last major macOS version to support Intel-based Macs.\n",
    "chinese_title": "苹果和英特尔传闻合作开发Mac芯片",
    "chinese_summary": "该文章报道了苹果供应链分析师郭明錤的传言，称苹果最早可能在2027年中期再次与英特尔合作，生产其低端M系列芯片（可能为M6或M7）。该合作将涉及英特尔使用其18A工艺（2纳米以下节点）制造苹果设计的基于Arm架构的芯片，这与之前Mac中使用的英特尔设计的x86芯片有所不同。\n\n台积电预计仍将是苹果M系列芯片的主要供应商，而英特尔的参与将仅限于制造。该传言暗示苹果可能利用英特尔生产MacBook Air、iPad Air和iPad Pro等设备的芯片。\n\n郭明錤认为，此举可能有两个目的：满足对“美国制造”产品的需求（可能呼应特朗普政府的倡议），以及使苹果的制造供应链多样化。苹果于2020年开始摆脱英特尔处理器，其内部M系列芯片提供更高的每瓦性能。文章还指出，macOS Tahoe将是最后一个支持基于英特尔芯片的Mac的主要macOS版本。"
  },
  {
    "id": "46079860",
    "title": "The Signal Is the Noise",
    "url": "https://www.magazine.dirt.fyi/p/the-signal-is-the-noise",
    "summary": "Nishanth Bhargava's article, \"The Signal Is the Noise,\" explores the rise of prediction markets, like Kalshi and Polymarket, and their impact on political analysis and reporting. Fueled by a decline in trust in traditional polling, particularly after the 2016 election, these markets are gaining traction as sources of collective wisdom, allowing individuals to bet on the outcomes of political events.\n\nThe article highlights the massive trade volumes these markets generate, exemplified by the hundreds of millions wagered on the New York City mayoral election. They've become so popular that they are rivaling the sums raised in traditional political campaigns. This shift is driven by the belief that market prices offer a more reliable assessment of reality than expert opinions or traditional polls.\n\nHowever, the article cautions that the increasing influence of prediction markets blurs the line between market odds and actual reality. As election betting becomes a larger industry, there's a risk that the markets themselves begin to influence the very events they are supposed to predict. The piece questions whether, in Baudrillard's terms, the \"map\" of the market is beginning to precede and shape the \"territory\" of political reality.\n\nThe article contrasts the profit-driven approach of newer prediction markets with the academic and research-oriented model of the Iowa Electronic Markets (IEM). It suggests that the rise of these markets is a symptom of a broader \"epistemic crisis\" where faith in traditional political analysts has waned.\n",
    "chinese_title": "信号与噪声",
    "chinese_summary": "Nishanth Bhargava的文章《信号即噪声》探讨了预测市场（如Kalshi和Polymarket）的兴起及其对政治分析和报道的影响。由于人们对传统民调的信任度下降，尤其是在2016年大选之后，这些市场作为集体智慧的来源越来越受欢迎，允许个人押注政治事件的结果。\n\n文章强调了这些市场产生的巨大交易量，例如在纽约市长选举中投注的数亿美元。它们变得如此受欢迎，以至于可以与传统政治竞选活动筹集的资金相媲美。这种转变的驱动力是人们认为市场价格比专家意见或传统民调更能提供对现实的可靠评估。\n\n然而，文章警告说，预测市场日益增长的影响力模糊了市场赔率和实际现实之间的界限。随着选举博彩成为一个更大的产业，存在市场本身开始影响其应预测的事件的风险。这篇文章质疑，用鲍德里亚的话来说，市场的“地图”是否开始先于并塑造政治现实的“领土”。\n\n文章将新型预测市场的逐利模式与爱荷华电子市场(IEM)的学术和研究导向模式进行了对比。 它表明，这些市场的兴起是一种更广泛的“认知危机”的症状，在这种危机中，人们对传统政治分析师的信任已经减弱。"
  },
  {
    "id": "46077136",
    "title": "The Math of Why You Can't Focus at Work",
    "url": "https://justoffbyone.com/posts/math-of-why-you-cant-focus-at-work/",
    "summary": "This article explores why it's increasingly difficult to focus at work, using a mathematical model to illustrate the impact of interruptions. The author argues that constant interruptions, fueled by technology like Slack and constant connectivity, are significantly reducing productivity.\n\nThe model focuses on three key parameters: λ (lambda), the interruption rate per hour; Δ (delta), the recovery time in minutes after an interruption; and θ (theta), the minimum uninterrupted time needed for meaningful work. The article provides visualizations showing how different values for these parameters impact an 8-hour workday, highlighting the stark contrast between a productive day with long, uninterrupted \"focus blocks\" and a fragmented day filled with interruptions and recovery time.\n\nThe \"capacity formula\" demonstrates that even when the total time worked is constant, increasing interruptions and recovery time can dramatically reduce the actual output due to the need for sustained focus. The author simulates 100 days under various conditions to show how different combinations of λ, Δ, and θ impact overall productivity.\n\nFinally, the article cites research highlighting that interruption frequency and recovery times vary, but are consistently high, especially in modern workplaces. Some research suggests knowledge workers switch tasks every 3 minutes and require 10-16 minutes to recover after an interruption, while more recent data suggests interruptions every 2 minutes for heavy collaborators. The article emphasizes the importance of understanding and managing these factors to improve focus and productivity.\n",
    "chinese_title": "工作时无法集中注意力的数学原理",
    "chinese_summary": "本文探讨了为什么在工作中越来越难以集中注意力，并使用数学模型来说明中断的影响。作者认为，由Slack等技术和持续连接所引发的持续中断正在显著降低生产力。\n\n该模型侧重于三个关键参数：λ（lambda），每小时的中断率；Δ（delta），中断后的恢复时间（分钟）；以及θ（theta），进行有意义的工作所需的最小不间断时间。本文提供了可视化，展示了这些参数的不同值如何影响8小时工作日，突出了具有长时间、不间断的“专注时间段”的高效工作日，与充满中断和恢复时间的碎片化工作日之间的鲜明对比。\n\n“产能公式”表明，即使总工作时间不变，由于需要持续专注，增加中断和恢复时间也会大大降低实际产出。作者模拟了100天在各种条件下的情况，以显示λ、Δ和θ的不同组合如何影响整体生产力。\n\n最后，本文引用研究表明，中断频率和恢复时间各不相同，但始终很高，尤其是在现代工作场所。一些研究表明，知识工作者每3分钟切换一次任务，并且需要10-16分钟才能从中断中恢复，而更新的数据表明，重度协作者的中断时间间隔为2分钟。本文强调了理解和管理这些因素对于提高专注力和生产力的重要性。"
  },
  {
    "id": "46033386",
    "title": "Open (Apache 2.0) TTS model for streaming conversational audio in realtime",
    "url": "https://github.com/nari-labs/dia2",
    "summary": "Dia2, developed by Nari Labs, is an open-source, Apache 2.0 licensed streaming dialogue TTS model designed for real-time conversational audio generation. Unlike traditional TTS models, Dia2 begins generating audio as soon as the first few words are received, making it suitable for interactive applications. The model supports audio conditioning, enabling natural conversation flow by incorporating previous context.\n\nTwo model checkpoints (1B and 2B parameters) are available, along with inference code, to facilitate research. The model currently supports English and is limited to 2-minute generations. The quality and voice characteristics may vary, necessitating the use of prefixes or fine-tuning for consistent output.\n\nKey features include:\n\n*   **Real-time streaming:** Generates audio on-the-fly as text is input.\n*   **Audio conditioning:** Adapts output based on previous audio input (speaker voices).\n*   **Open-source:** Licensed under Apache 2.0, fostering accessibility and modification.\n*   **Simple Usage:** Easy to test using Gradio or directly from the command line\n\nThe article provides quickstart instructions for installation, audio generation with and without audio conditioning, programmatic usage examples, and links to model repositories.\n\nThe project explicitly forbids misuse such as identity impersonation, generating deceptive content, or any illegal or malicious activities. It emphasizes ethical use and adherence to legal standards.\n",
    "chinese_title": "用于实时流式会话音频的开源（Apache 2.0）TTS模型",
    "chinese_summary": "Dia2：一种实时流式对话TTS模型\n\nDia2由南瑞实验室开发，是一款开源、Apache 2.0 许可的流式对话TTS模型，专为实时对话音频生成而设计。与传统的TTS模型不同，Dia2在收到最初几个词后就开始生成音频，使其适用于交互式应用。该模型支持音频条件控制，通过结合先前的上下文来实现自然的对话流程。\n\n目前提供两个模型检查点（10亿和20亿参数）以及推理代码，以方便研究。该模型目前支持英语，并且限制为2分钟的生成。质量和语音特征可能有所不同，因此需要使用前缀或进行微调以获得一致的输出。\n\n主要特点包括：\n\n*   **实时流式：** 随着文本输入，即时生成音频。\n*   **音频条件控制：** 根据先前的音频输入（说话人声音）调整输出。\n*   **开源：** 在 Apache 2.0 许可下发布，促进可访问性和修改。\n*   **使用简单：** 可以使用 Gradio 或直接从命令行轻松测试\n\n本文提供了安装、有/无音频条件控制的音频生成、程序化使用示例以及模型仓库链接的快速入门说明。\n\n该项目明确禁止滥用，例如身份冒充、生成欺骗性内容或任何非法或恶意活动。它强调道德使用并遵守法律标准。"
  },
  {
    "id": "46079605",
    "title": "Open-Source n8n Alternative for Workflow Building (GUI and Docker Included)",
    "url": "https://github.com/empowerd-cms/nyno",
    "summary": "Nyno 3.0 is an open-source, multi-language workflow engine designed as an alternative to platforms like n8n for building automation workflows. It enables users to create and connect automation steps using Python, PHP, JavaScript, and Ruby. Each language operates within its own high-performance worker engine, and workflows are defined using human-readable YAML files (.nyno).\n\nThe engine uses multi-process workers for performance, spawning multiple workers per language based on CPU cores. Nyno allows users to turn scripts in supported languages into reusable commands callable within workflows. This is achieved by exporting a function within a script that accepts arguments and context.\n\nInstallation is facilitated via Docker/Podman, with instructions provided for building and running the container. A more involved installation on a Linux host is also described, noting a dependency on Best.js. The article provides example code snippets for creating extensions in each supported language, demonstrating how to access arguments and context to pass data between steps in a workflow. Finally, Nyno is proudly built with Best.JS, a faster alternative to Next.JS.\n",
    "chinese_title": "用于构建工作流的开源n8n替代方案（包含GUI和Docker）",
    "chinese_summary": "Nyno 3.0是一款开源、多语言工作流引擎，旨在替代n8n等平台，用于构建自动化工作流。它允许用户使用Python、PHP、JavaScript和Ruby创建并连接自动化步骤。每种语言都在其自身的高性能worker引擎中运行，工作流使用人类可读的YAML文件（.nyno）定义。\n\n该引擎使用多进程worker以提高性能，并根据CPU核心数为每种语言生成多个worker。Nyno允许用户将受支持语言的脚本转换为可在工作流中调用的可重用命令。这通过导出脚本中接受参数和上下文的函数来实现。\n\n可以通过Docker/Podman轻松安装，并提供构建和运行容器的说明。文章还描述了在Linux主机上进行更复杂的安装，并指出对Best.js的依赖。文章提供了用每种受支持语言创建扩展的示例代码片段，演示了如何访问参数和上下文以在工作流中的步骤之间传递数据。最后，Nyno自豪地使用Best.JS构建，它是Next.JS的更快替代方案。"
  },
  {
    "id": "46079605",
    "title": "Open-Source n8n Alternative for Workflow Building (GUI and Docker Included)",
    "url": "https://github.com/empowerd-cms/nyno",
    "summary": "Nyno 3.0 is an open-source, multi-language workflow engine designed for building automation, particularly for AGI applications. It allows users to create workflows using YAML files (.nyno) and extend them with Python, PHP, JavaScript, and Ruby. Each language executes within its own high-performance worker engine, improving speed and efficiency. Nyno leverages multi-processing, spawning multiple workers per language and CPU core.\n\nUsers can create reusable commands from scripts in supported languages by exporting functions, enabling seamless integration into workflows. The article provides examples of how to define commands and use them within YAML workflows, illustrating how to pass data between steps via the context object. It also offers examples of extensions written in Python and PHP.\n\nNyno can be installed using Docker/Podman for ease of setup, including a GUI accessible via a web browser. Alternatively, it can be installed directly on a Linux host, although this requires more manual dependency management (including Best.js). The provided installation instructions guide users through cloning the repository, building the container, and running it. The article also showcases example workflows and output, emphasizing its flexibility and ease of use. Nyno is built with Best.js, promising a faster alternative to Next.js.\n",
    "chinese_title": "用于构建工作流程的开源n8n替代方案（包含图形界面和Docker）",
    "chinese_summary": "Nyno 3.0 是一个开源、多语言的工作流引擎，专为构建自动化，尤其是 AGI 应用而设计。它允许用户使用 YAML 文件 (.nyno) 创建工作流，并使用 Python、PHP、JavaScript 和 Ruby 对其进行扩展。每种语言都在其自身的高性能工作引擎中执行，从而提高速度和效率。Nyno 利用多进程，为每种语言和 CPU 核心生成多个工作进程。\n\n用户可以通过导出函数，从支持的语言编写的脚本中创建可重用的命令，从而实现与工作流的无缝集成。本文提供了如何定义命令并在 YAML 工作流中使用它们的示例，展示了如何通过上下文对象在步骤之间传递数据。它还提供了用 Python 和 PHP 编写的扩展示例。\n\nNyno 可以使用 Docker/Podman 安装，方便设置，包括可通过 Web 浏览器访问的 GUI。或者，它可以直接安装在 Linux 主机上，但这需要更多手动依赖项管理（包括 Best.js）。提供的安装说明指导用户完成克隆存储库、构建容器和运行容器的过程。本文还展示了示例工作流和输出，强调了其灵活性和易用性。Nyno 构建于 Best.js 之上，有望成为 Next.js 的更快替代方案。"
  },
  {
    "id": "46020561",
    "title": "How to make precise sheet metal parts (photochemical machining) [video]",
    "url": "https://www.youtube.com/watch?v=bR9EN3kUlfg",
    "summary": "This YouTube video, titled \"How to make precise sheet metal parts (photochemical machining),\" appears to be an informational video demonstrating the photochemical machining process for creating precise sheet metal components. However, the provided content is simply the standard YouTube footer information (copyright, terms, policies, etc.) and doesn't give any specifics about the video itself. Therefore, a true summary of the *video's content* is impossible.\n\nWe can infer, based on the title, that the video likely covers:\n\n*   **Photochemical Machining (PCM):** A manufacturing process that uses chemical etchants to remove material from sheet metal, exposing areas defined by a photoresist mask. This is how it creates the \"precise sheet metal parts.\"\n*   **Process Steps:** The video would probably detail the different steps involved in PCM, such as:\n    *   Preparing the sheet metal.\n    *   Applying a photoresist coating.\n    *   Exposing the photoresist to a UV light through a mask (the pattern for the part).\n    *   Developing the exposed photoresist.\n    *   Etching the metal in the exposed areas.\n    *   Stripping the remaining photoresist.\n*   **Advantages of PCM:** The video might also discuss the benefits of using PCM over other methods, such as:\n    *   High precision and tight tolerances.\n    *   Ability to create complex shapes and intricate designs.\n    *   Lack of mechanical stress on the metal.\n    *   Cost-effectiveness for small to medium production runs.\n*   **Applications:** The video may showcase different applications for sheet metal parts made using PCM.\n\nWithout viewing the actual video, this is the best possible summary based on the provided title and common knowledge about photochemical machining. The listed YouTube footer information gives no actual content summary.\n",
    "chinese_title": "如何精密制作钣金零件（光化学蚀刻）[视频]",
    "chinese_summary": "这个名为“如何制造精密钣金件（光化学蚀刻）”的YouTube视频，看似是一个演示如何使用光化学蚀刻工艺制造精密钣金件的信息视频。然而，提供的内容仅是标准的YouTube页脚信息（版权、条款、政策等），并未提供关于视频本身的任何具体信息。因此，无法对*视频内容*进行真正的总结。\n\n我们可以根据标题推断，该视频可能涵盖以下内容：\n\n*   **光化学蚀刻（PCM）：** 一种制造工艺，使用化学蚀刻剂从钣金上移除材料，露出由光刻胶掩模定义的区域。这就是它如何制造“精密钣金件”的方式。\n*   **工艺步骤：** 该视频可能会详细介绍PCM中涉及的不同步骤，例如：\n    *   准备钣金。\n    *   涂覆光刻胶涂层。\n    *   通过掩模（零件的图案）将光刻胶暴露在紫外线下。\n    *   显影暴露的光刻胶。\n    *   蚀刻暴露区域的金属。\n    *   剥离剩余的光刻胶。\n*   **PCM的优势：** 该视频可能还会讨论使用PCM优于其他方法的优势，例如：\n    *   高精度和严格的公差。\n    *   能够创建复杂的形状和精细的设计。\n    *   金属上没有机械应力。\n    *   对于中小批量生产具有成本效益。\n*   **应用：** 该视频可能会展示使用PCM制造的钣金零件的不同应用。\n\n在没有观看实际视频的情况下，这是基于提供的标题和关于光化学蚀刻的常识所能给出的最佳总结。所列的YouTube页脚信息没有提供任何实际的内容摘要。"
  },
  {
    "id": "46077393",
    "title": "EU Council Approves New \"Chat Control\" Mandate Pushing Mass Surveillance",
    "url": "https://reclaimthenet.org/eu-council-approves-new-chat-control-mandate-pushing-mass-surveillance",
    "summary": "The article on reclaimthenet.org reports that the EU Council has approved a new \"Chat Control\" mandate that is raising serious concerns about mass surveillance. This mandate allows for the scanning of private communications – including messaging apps and emails – to detect and prevent the online sharing of child sexual abuse material (CSAM).\n\nCritics argue the mandate effectively mandates mass surveillance of EU citizens, infringing on their fundamental right to privacy. They contend that the technology used to scan these communications is prone to errors, potentially leading to false accusations and unwarranted investigations. There are concerns that the indiscriminate scanning could also chill free speech and limit the ability of journalists and activists to communicate securely.\n\nThe article highlights that the mandate doesn't guarantee end-to-end encryption will be respected, as the scanning is intended to occur *before* messages are encrypted or *after* they are decrypted on devices. Concerns are also raised that the scope of the mandate could be expanded beyond CSAM detection in the future, potentially encompassing other types of content deemed illegal or harmful by authorities.\n\nUltimately, the article presents the EU Council's approval of the \"Chat Control\" mandate as a significant step towards increased surveillance of online communications within the EU, with the stated goal of combating CSAM, but with significant risks to privacy and freedom of expression. The author emphasizes the potential for abuse and the chilling effect this legislation could have on online communication.\n",
    "chinese_title": "欧盟理事会批准新的“聊天控制”授权，推动大规模监控",
    "chinese_summary": "Reclaimthenet.org网站上的一篇文章报道称，欧盟理事会已批准一项新的“聊天控制”授权，该授权引发了人们对大规模监控的严重担忧。这项授权允许扫描私人通信——包括消息应用程序和电子邮件——以检测和防止在线分享儿童性虐待材料（CSAM）。\n\n批评人士认为，该授权实际上强制对欧盟公民进行大规模监控，侵犯了他们基本的隐私权。他们认为，用于扫描这些通信的技术容易出错，可能导致虚假指控和不必要的调查。有人担心，不加区分的扫描也可能扼杀言论自由，并限制记者和活动人士安全通信的能力。\n\n该文章强调，该授权不能保证端到端加密会得到尊重，因为扫描旨在*在*消息加密*之前*或*之后*在设备上解密*之后*进行。人们还担心，该授权的范围将来可能会扩展到CSAM检测之外，可能涵盖当局认为非法或有害的其他类型的内容。\n\n最终，该文章将欧盟理事会批准“聊天控制”授权视为在欧盟内部加强在线通信监控的重要一步，其既定目标是打击CSAM，但对隐私和言论自由构成重大风险。作者强调了滥用的可能性以及这项立法可能对在线通信产生的寒蝉效应。"
  },
  {
    "id": "46079858",
    "title": "Looking Back at a Pandemic Simulator",
    "url": "https://www.raphkoster.com/2025/11/16/looking-back-at-a-pandemic-simulator/",
    "summary": "This article recounts the author's experience during the early days of the COVID-19 pandemic and how they sought to address public misunderstanding of the virus's spread through a pandemic simulator game design. Frustrated by the general public's inability to grasp the exponential nature of the pandemic and the significance of factors like infection fatality rates (IFR) and comorbidities, the author outlined a simple game concept on Facebook in March 2020.\n\nThe game aimed to simulate the virus's spread, testing, social distancing, and resource management, highlighting the human cost with individual names and characteristics. The post resonated with game developers, leading to two different teams creating playable games: \"Covid Ops\" by John Albano and \"In the Time of Pandemia\" led by Khail Santia. \"In the Time of Pandemia\" gained significant traction, particularly in the Philippines, where it was praised for its accuracy, educational value, and ability to convey the challenges of managing the pandemic. The author reflects on the impact of their initial design sketch, acknowledging the developers' hard work, and defends including the games on their CV, despite not being directly involved in development. Ultimately, the author considers the project a success, born out of a desire to improve public understanding of the pandemic's complexities and consequences.\n",
    "chinese_title": "回顾疫情模拟器",
    "chinese_summary": "本文讲述了作者在新冠疫情初期时的经历，以及他们如何试图通过一款疫情模拟游戏设计来解决公众对病毒传播的误解。由于公众普遍无法理解疫情的指数级增长以及感染死亡率 (IFR) 和合并症等因素的重要性，作者感到沮丧，于是在 2020 年 3 月在 Facebook 上概述了一个简单的游戏概念。\n\n该游戏旨在模拟病毒的传播、检测、社交隔离和资源管理，并通过个人的姓名和特征来突出人类付出的代价。该帖子引起了游戏开发者的共鸣，促使两个不同的团队创建了可玩的游戏：John Albano 的 “Covid Ops” 和 Khail Santia 领导的 “In the Time of Pandemia”。“In the Time of Pandemia” 获得了广泛的关注，尤其是在菲律宾，因其准确性、教育价值以及传达管理疫情挑战的能力而备受赞誉。作者回顾了他们最初的设计草图的影响，肯定了开发者的辛勤工作，并为将这些游戏包含在他们的简历中辩护，尽管他们没有直接参与开发。最终，作者认为该项目是成功的，其源于提高公众对疫情复杂性和后果的理解的愿望。"
  },
  {
    "id": "46070203",
    "title": "GitLab discovers widespread NPM supply chain attack",
    "url": "https://about.gitlab.com/blog/gitlab-discovers-widespread-npm-supply-chain-attack/",
    "summary": "GitLab has uncovered a large-scale supply chain attack targeting the npm ecosystem using an evolved version of the \"Shai-Hulud\" malware. This malware spreads through infected npm packages and exhibits worm-like behavior, automatically compromising other packages maintained by infected developers. It harvests credentials for GitHub, npm, AWS, GCP, and Azure, exfiltrating the data to attacker-controlled GitHub repositories.\n\nA crucial aspect of the malware is its \"dead man's switch\" mechanism. If the malware loses access to both GitHub (for exfiltration) and npm (for propagation), it triggers data destruction on the compromised machine, potentially deleting user files and overwriting disk sectors.\n\nThe initial infection occurs through a multi-stage loading process involving a modified `package.json` with a preinstall script pointing to `setup_bun.js`. This loader downloads a seemingly legitimate tool, the Bun JavaScript runtime, but instead executes an obfuscated malicious payload named `bun_environment.js`. The malware leverages stolen GitHub tokens to create public repositories with the description \"Sha1-Hulud: The Second Coming\" for data exfiltration. It also propagates by using stolen npm tokens to inject malicious code into other packages.\n\nGitLab recommends using its Dependency Scanning feature and Duo Chat's Security Analyst Agent to detect infected packages within projects. They are actively monitoring for new infections and variations of the attack and shared the findings to help the community respond effectively, while emphasizing the danger of triggering the destructive \"dead man's switch\" during remediation attempts.\n",
    "chinese_title": "GitLab发现大规模NPM供应链攻击",
    "chinese_summary": "GitLab发现大规模供应链攻击，利用进化版“沙虫(Shai-Hulud)”恶意软件针对npm生态系统。该恶意软件通过受感染的npm包传播，并表现出蠕虫般的行为，自动入侵受感染开发者维护的其他包。它会收集GitHub、npm、AWS、GCP和Azure的凭据，并将数据泄露到攻击者控制的GitHub仓库。\n\n该恶意软件的一个关键方面是其“死人开关”机制。如果该恶意软件失去对GitHub（用于数据泄露）和npm（用于传播）的访问权限，它将触发受感染机器上的数据销毁，可能删除用户文件并覆盖磁盘扇区。\n\n初始感染通过一个多阶段加载过程发生，该过程涉及一个修改后的`package.json`文件，其中包含一个指向`setup_bun.js`的preinstall脚本。该加载器下载了一个看似合法的工具，即Bun JavaScript运行时，但实际上执行了一个名为`bun_environment.js`的混淆恶意负载。该恶意软件利用被盗的GitHub令牌创建描述为“Sha1-Hulud: The Second Coming”的公共仓库，用于数据泄露。它还利用被盗的npm令牌，将恶意代码注入到其他包中进行传播。\n\nGitLab建议使用其依赖项扫描功能和Duo Chat的安全分析师代理来检测项目中的受感染包。他们正在积极监控新的感染和攻击变种，并分享调查结果以帮助社区有效应对，同时强调在补救尝试期间触发破坏性“死人开关”的危险。"
  },
  {
    "id": "46075628",
    "title": "Tiger Style: Coding philosophy (2024)",
    "url": "https://tigerstyle.dev/",
    "summary": "Tiger Style is a coding philosophy emphasizing safety, performance, and developer experience to create robust, efficient, and maintainable software.\n\n**Core Principles:**\n\n*   **Safety:** Prioritizes writing code that works in all situations, reduces errors, and is trustworthy.\n*   **Performance:** Focuses on efficient resource utilization for fast and responsive software.\n*   **Developer Experience:** Aims for readable and maintainable code to encourage collaboration and minimize errors.\n\n**Key Design Goals:**\n\n*   **Safety:** Clear, structured practices to prevent errors. Includes predictable control flow, bounded resources, explicit types, static memory allocation, minimized variable scope, thorough error handling with assertions, and treating compiler warnings as errors.\n*   **Performance:** Early consideration of performance in design, using \"napkin math\" for quick estimations. Prioritizes efficient resource use (network, disk, memory, CPU) and predictable code execution to leverage CPU caching and branch prediction.\n*   **Developer Experience:** Clear and consistent naming, thorough documentation of \"why\" behind code, logical code organization, simple function signatures, and consistent code style. It emphasizes avoiding duplicates, managing buffer allocation cleanly, and handling off-by-one errors.\n\nThe philosophy also advocates for zero technical debt by doing things right the first time, proactive problem-solving, and building momentum with solid code. Performance estimation through napkin math helps in early design decisions.\n",
    "chinese_title": "虎式编码哲学 (2024)",
    "chinese_summary": "虎式编程是一种强调安全性、性能和开发者体验的编码哲学，旨在创建健壮、高效且易于维护的软件。\n\n**核心原则：**\n\n*   **安全性：** 优先编写在所有情况下都能正常工作的代码，减少错误，并值得信赖。\n*   **性能：** 专注于高效的资源利用，以实现快速响应的软件。\n*   **开发者体验：** 致力于编写可读且易于维护的代码，以鼓励协作并最大限度地减少错误。\n\n**主要设计目标：**\n\n*   **安全性：** 清晰、结构化的实践以防止错误。包括可预测的控制流、有界资源、显式类型、静态内存分配、最小化变量作用域、使用断言进行彻底的错误处理，以及将编译器警告视为错误。\n*   **性能：** 在设计中尽早考虑性能，使用“草稿纸估算”进行快速估计。优先考虑高效的资源使用（网络、磁盘、内存、CPU）和可预测的代码执行，以利用 CPU 缓存和分支预测。\n*   **开发者体验：** 清晰且一致的命名、对代码背后“原因”的透彻文档记录、逻辑性的代码组织、简单的函数签名以及一致的代码风格。它强调避免重复、干净利落地管理缓冲区分配以及处理差一错误。\n\n该哲学还提倡零技术债务，即第一次就把事情做对，主动解决问题，并通过可靠的代码来建立动力。 通过草稿纸估算进行性能估计有助于早期的设计决策。"
  },
  {
    "id": "46074111",
    "title": "Vsora Jotunn-8 5nm European inference chip",
    "url": "https://vsora.com/products/jotunn-8/",
    "summary": "The Vsora Jotunn-8 is a 5nm European AI inference chip designed for high-performance, cost-efficient, and sustainable AI deployments in data centers. It aims to meet the growing demand for real-time AI services across various applications. The chip prioritizes ultra-low latency, very high throughput, cost-efficiency, and power efficiency to enable AI at scale.\n\nKey features and benefits of Jotunn-8 include:\n\n*   **High Performance:** Engineered for speed, efficiency, and scalability, the chip delivers maximum impact at lower operational costs.\n*   **Ultra-low Latency:** Critical for real-time applications like chatbots, fraud detection, and search.\n*   **Very High Throughput:** Essential for high-demand services like recommendation engines or LLM APIs.\n*   **Cost Efficiency:** Reducing cost per inference is essential for business viability.\n*   **Power Efficiency:** Performance per watt is a major focus, addressing power as a key operational expense and carbon footprint driver.\n\nThe Jotunn-8 architecture supports the integration of different AI models, including Reasoning Models, LLMs/Generative AI, and Agentic AI, enabling near-theory performance for building more capable and reliable systems. It allows for the smooth combination of these algorithms, leveraging the strengths of each type while mitigating their weaknesses. The chip emphasizes cost-effectiveness, offering more speed for the investment, which is crucial for large-scale AI inference.\n",
    "chinese_title": "Vsora Jotunn-8 5纳米欧洲推理芯片",
    "chinese_summary": "Vsora Jotunn-8是一款5纳米欧洲AI推理芯片，专为数据中心内高性能、高性价比和可持续的AI部署而设计。它旨在满足各种应用中对实时AI服务日益增长的需求。该芯片优先考虑超低延迟、极高吞吐量、成本效益和功率效率，以实现大规模AI应用。\n\nJotunn-8的主要特点和优势包括：\n\n*   **高性能：** 该芯片专为速度、效率和可扩展性而设计，以更低的运营成本实现最大影响。\n*   **超低延迟：** 对于聊天机器人、欺诈检测和搜索等实时应用至关重要。\n*   **极高吞吐量：** 对于推荐引擎或LLM API等高需求服务至关重要。\n*   **成本效益：** 降低每次推理的成本对于业务可行性至关重要。\n*   **功率效率：** 每瓦性能是主要关注点，将功耗作为关键的运营支出和碳足迹驱动因素来解决。\n\nJotunn-8架构支持集成不同的AI模型，包括推理模型、LLM/生成式AI和Agentic AI，从而实现接近理论的性能，以构建更强大和可靠的系统。它允许平滑组合这些算法，利用每种类型的优势，同时减轻它们的劣势。该芯片强调成本效益，为投资提供更高的速度，这对于大规模AI推理至关重要。"
  },
  {
    "id": "46075746",
    "title": "How to use Linux vsock for fast VM communication",
    "url": "https://popovicu.com/posts/how-to-use-linux-vsock-for-fast-vm-communication/",
    "summary": "This article explains how to use Linux vsock for fast and efficient communication between a host machine and a virtual machine (VM), specifically using gRPC. Vsock eliminates the need for traditional TCP/IP networking, offering a streamlined approach for VM communication.\n\nThe author demonstrates a practical example using Bazel to build a gRPC service with a server running inside a VM and a client running on the host. The server exposes a simple \"Addition\" service that sums two integers. The article walks through the necessary Bazel setup for handling external dependencies, generating gRPC libraries from Protobuf definitions, and building the statically linked server and client binaries.\n\nKey concepts highlighted include:\n\n*   **Vsock Addressing:** The `vsock:CID:port` format used for specifying the server address, where CID identifies the VM (CID 2 for the host, typically CID 3 onwards for guests).\n*   **Static Linking:** Linking the server and client binaries statically simplifies deployment to the VM.\n*   **QEMU Configuration:** Demonstrates how to configure a QEMU VM with a vsock device using `vhost-vsock-pci` and assigning a CID.\n*   **gRPC over Vsock:** Showcases how gRPC abstracts the underlying vsock implementation, allowing for structured RPC communication.\n\nThe author emphasizes the benefits of using vsock with gRPC for creating isolated environments, combining different operating systems, and leveraging various programming languages for client/server implementations without the overhead of network virtualization. The complete code is available on GitHub for reference.\n",
    "chinese_title": "如何使用Linux vsock实现快速虚拟机通信",
    "chinese_summary": "本文介绍了如何使用 Linux vsock 在宿主机和虚拟机 (VM) 之间进行快速高效的通信，特别是使用 gRPC。Vsock 消除了对传统 TCP/IP 网络的需求，为 VM 通信提供了一种简化的方法。\n\n作者演示了一个使用 Bazel 构建 gRPC 服务的实际示例，其中服务器在 VM 内部运行，客户端在宿主机上运行。服务器公开了一个简单的“加法”服务，用于对两个整数求和。本文介绍了处理外部依赖项、从 Protobuf 定义生成 gRPC 库以及构建静态链接的服务器和客户端二进制文件所需的 Bazel 设置。\n\n强调的关键概念包括：\n\n* **Vsock 地址:** 用于指定服务器地址的 `vsock:CID:port` 格式，其中 CID 标识 VM（宿主机为 CID 2，访客通常从 CID 3 开始）。\n* **静态链接:** 将服务器和客户端二进制文件进行静态链接简化了到 VM 的部署。\n* **QEMU 配置:** 演示了如何使用 `vhost-vsock-pci` 配置带有 vsock 设备的 QEMU VM 并分配 CID。\n* **基于 Vsock 的 gRPC:** 展示了 gRPC 如何抽象底层 vsock 实现，从而实现结构化的 RPC 通信。\n\n作者强调了使用 vsock 和 gRPC 创建隔离环境、组合不同操作系统以及利用各种编程语言进行客户端/服务器实现的好处，而无需网络虚拟化的开销。完整的代码可在 GitHub 上找到以供参考。"
  },
  {
    "id": "46077885",
    "title": "Switzerland: Data Protection Officers Impose Broad Cloud Ban for Authorities",
    "url": "https://www.heise.de/en/news/Switzerland-Data-Protection-Officers-Impose-Broad-Cloud-Ban-for-Authorities-11093477.html",
    "summary": "Switzerland's data protection officers (DPOs) have imposed a broad ban on the use of hyperscale cloud services by Swiss authorities, citing data security concerns. The core issue is the potential access to Swiss data by foreign governments, particularly the United States, through laws like the CLOUD Act.\n\nThe ban covers the use of services from major cloud providers like Amazon, Microsoft, and Google, even if the data is stored within Switzerland. The DPOs are concerned that these companies are subject to foreign legislation that could compel them to disclose Swiss citizens' data to foreign intelligence agencies, overriding Swiss data protection laws.\n\nThe ban isn't absolute. Authorities can still use cloud services if they implement appropriate safeguards and can demonstrate that the data is adequately protected against unauthorized foreign access. This might involve encryption, anonymization, or contractual agreements that effectively prevent foreign government access. However, proving this to the DPOs' satisfaction is proving difficult.\n\nThe DPOs have been stricter about the requirements for data protection, causing some cantons to halt or postpone cloud migration projects. This move highlights the tension between the desire for digital transformation and the need to protect Swiss data sovereignty and privacy. The decision could have significant implications for the digitalization efforts of Swiss authorities and the future of cloud adoption in the country's public sector.\n",
    "chinese_title": "瑞士：数据保护官员对当局实施广泛的云禁令",
    "chinese_summary": "瑞士数据保护官员禁止瑞士当局使用超大规模云服务，理由是数据安全问题。核心问题是外国政府，特别是美国，可能通过诸如《云法案》之类的法律访问瑞士数据。\n\n该禁令涵盖了亚马逊、微软和谷歌等主要云服务提供商的服务，即使数据存储在瑞士境内。数据保护官员担心这些公司受到外国法律的约束，这些法律可能迫使他们向外国情报机构披露瑞士公民的数据，从而凌驾于瑞士数据保护法之上。\n\n该禁令并非绝对。如果当局实施适当的安全措施并能证明数据得到充分保护以防止未经授权的外国访问，他们仍然可以使用云服务。这可能涉及加密、匿名化或有效阻止外国政府访问的合同协议。然而，要让数据保护官员满意地证明这一点正变得困难。\n\n数据保护官员对数据保护的要求更加严格，导致一些州暂停或推迟云迁移项目。此举突显了对数字化转型的渴望与保护瑞士数据主权和隐私的需求之间的紧张关系。该决定可能对瑞士当局的数字化努力以及该国公共部门云采用的未来产生重大影响。"
  },
  {
    "id": "46079843",
    "title": "Is Europe Awakening at Last to Its Economic Peril?",
    "url": "https://www.wsj.com/opinion/is-europe-awakening-at-last-to-its-economic-peril-2ecfd61b",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "欧洲终于开始意识到其经济危机了吗？",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "46074362",
    "title": "How Charles M Schulz created Charlie Brown and Snoopy (2024)",
    "url": "https://www.bbc.com/culture/article/20241205-how-charles-m-schulz-created-charlie-brown-and-snoopy",
    "summary": "This article explores how Charles M. Schulz created the beloved comic strip \"Peanuts,\" focusing on the development of Charlie Brown and Snoopy. Despite his modesty, Schulz built a billion-dollar empire from his simple drawings that resonated with both children and adults. He attributed his focus on children to commercial appeal and used them to explore universal themes like love, hate, mistrust, fear, and insecurity.\n\nSnoopy, in particular, served as an outlet for Schulz's ideas, often portrayed as smarter than the children in the strip. Schulz's own experiences as a shy child influenced the characters and themes.\n\nDespite the demanding publishing schedule, Schulz maintained consistency by shutting out distractions and focusing on creating something funny. He drew inspiration from his own life and aimed to reflect everyday problems. Although he felt his role as a cartoonist was to point out problems, not to solve them, the enduring lesson from Peanuts was Charlie Brown's perseverance.\n\nThe article also touches on the comic strip's popularity, its use by NASA, and the impact of Schulz's retirement due to cancer. His final strip, published posthumously, expressed gratitude to his editors and fans, and his enduring affection for his characters.\n",
    "chinese_title": "查尔斯·M·舒尔茨如何创造了查理·布朗和史努比 (2024)",
    "chinese_summary": "本文探讨了查尔斯·M·舒尔茨如何创作出备受欢迎的漫画《花生漫画》，重点关注查理·布朗和史努比的塑造。尽管舒尔茨为人谦逊，但他凭借这些引起儿童和成人共鸣的简单绘画建立了一个价值数十亿美元的帝国。他将专注于儿童归因于商业吸引力，并利用他们来探索诸如爱、恨、不信任、恐惧和不安全感等普遍主题。\n\n特别是，史努比是舒尔茨表达想法的出口，常常被描绘得比漫画中的孩子们更聪明。舒尔茨自己作为一个害羞孩子的经历影响了人物和主题。\n\n尽管出版日程很紧张，舒尔茨仍通过排除干扰并专注于创作有趣的东西来保持一致性。他从自己的生活中汲取灵感，旨在反映日常问题。虽然他认为自己作为漫画家的角色是指出问题，而不是解决问题，但《花生漫画》永恒的教训是查理·布朗的毅力。\n\n本文还涉及该漫画的流行程度、美国宇航局对其的使用以及舒尔茨因癌症退休所带来的影响。他死后发表的最后一篇漫画表达了对编辑和粉丝的感谢，以及他对角色的持久喜爱。"
  },
  {
    "id": "46079161",
    "title": "What Is Air-Gapped Streaming and How Government Streams Without Internet",
    "url": "https://www.red5.net/blog/what-is-air-gapped-streaming/",
    "summary": "Chris Allen, CEO of Red5, discusses air-gapped streaming, a solution for environments isolated from the public internet, like government agencies or critical infrastructure. These systems require real-time video, audio, or data streaming while maintaining strict security and data sovereignty.\n\nAir-gapped systems are used in military, financial networks, industrial control systems, lottery systems, and life-critical systems like nuclear power plants. The demand for these solutions is increasing as organizations seek to view camera feeds in real time, access content on demand, and utilize AI-driven analysis within secure environments.\n\nRed5 offers a solution with their \"Castaway\" plugin for Red5 Pro, allowing the system to run completely offline, bypassing standard licensing checks. This enables on-premise hardware deployment without relying on internet connectivity or outdated USB dongles.\n\nA real-world application is Caltrans, where Red5 and Nomad Media partnered with AWS to provide real-time traffic camera footage from an air-gapped network to law enforcement. This achieved sub-500ms latency, reducing latency by 14 to 29 seconds, and enabled cross-agency content sharing. Red5's solution allows teams to maintain their isolated systems while adding secure, real-time capabilities. The article concludes by highlighting the benefits of air-gapped streaming and promotes Red5's streaming solutions.\n",
    "chinese_title": "气隙流媒体是什么？以及政府如何在没有互联网的情况下进行流媒体播放",
    "chinese_summary": "Red5 CEO Chris Allen谈论气隙流媒体：一种适用于与公共互联网隔离环境（如政府机构或关键基础设施）的解决方案。这些系统需要在保持严格安全和数据主权的同时，进行实时视频、音频或数据流传输。\n\n气隙系统应用于军事、金融网络、工业控制系统、彩票系统以及核电站等生命攸关系统。随着各组织寻求实时查看摄像头画面、按需访问内容以及在安全环境中使用人工智能驱动的分析，对这些解决方案的需求正在增加。\n\nRed5通过其Red5 Pro的“Castaway”插件提供解决方案，该插件允许系统完全离线运行，绕过标准许可检查。这使得可以在无需依赖互联网连接或过时的USB加密狗的情况下进行本地硬件部署。\n\n加州交通局（Caltrans）就是一个实际应用案例，Red5和Nomad Media与AWS合作，将来自气隙网络的实时交通摄像头画面提供给执法部门。这实现了低于500毫秒的延迟，将延迟降低了14到29秒，并实现了跨部门的内容共享。Red5的解决方案使团队能够在维护其隔离系统的同时，添加安全、实时的功能。文章最后强调了气隙流媒体的优势，并推广了Red5的流媒体解决方案。"
  },
  {
    "id": "46032230",
    "title": "A fast EDN (Extensible Data Notation) reader written in C11 with SIMD boost",
    "url": "https://github.com/DotFox/edn.c",
    "summary": "This document describes `EDN.C`, a fast, zero-copy EDN (Extensible Data Notation) reader library written in C11. EDN is a data format similar to JSON but with richer types and extensibility, offering features like keywords, symbols, sets, and tagged literals. `EDN.C` boasts SIMD acceleration (NEON, SSE4.2, SIMD128) for speed, WebAssembly support, minimal memory allocations, a simple API, memory safety through an arena allocator, zero dependencies, comprehensive testing, and UTF-8 native encoding.\n\nThe library supports various features, including tagged literals, map namespace syntax, extended character literals, metadata, text blocks, ratio numbers, extended integer formats, and underscores in numeric literals, with many being optional. The document details installation instructions for macOS, Linux, and Windows, including CMake and Make build procedures. A quick start guide is provided with example code demonstrating how to parse EDN strings, access values, and handle errors.\n\nThe document extensively covers the API reference, detailing core functions like `edn_read` (for parsing EDN), `edn_free` (for memory management), and `edn_type` (for type identification).  It also elaborates on the type system, error codes, and how to access scalar types (strings, booleans, integers, big integers, floating-point numbers, big decimals, and ratio numbers) and collections. Crucially, it explains how EDN.C handles whitespace and control characters according to the Clojure specification.\n",
    "chinese_title": "使用SIMD加速的C11快速EDN（可扩展数据表示）读取器",
    "chinese_summary": "本文档介绍 `EDN.C`，一个用 C11 编写的快速、零拷贝的 EDN (可扩展数据表示法) 读取器库。EDN 是一种类似于 JSON 的数据格式，但具有更丰富的类型和可扩展性，提供诸如关键字、符号、集合和带标签的字面量等功能。`EDN.C` 具有 SIMD 加速（NEON、SSE4.2、SIMD128）以提高速度，支持 WebAssembly，内存分配极少，API 简单，通过 arena 分配器保证内存安全，零依赖，全面的测试，以及 UTF-8 原生编码。\n\n该库支持各种功能，包括带标签的字面量、映射命名空间语法、扩展字符字面量、元数据、文本块、比率数、扩展整数格式以及数值字面量中的下划线，其中许多是可选的。本文档详细介绍了 macOS、Linux 和 Windows 的安装说明，包括 CMake 和 Make 构建过程。提供了一个快速入门指南，其中包含示例代码，演示如何解析 EDN 字符串、访问值以及处理错误。\n\n本文档广泛介绍了 API 参考，详细说明了核心函数，如 `edn_read` (用于解析 EDN)、`edn_free` (用于内存管理) 和 `edn_type` (用于类型识别)。它还详细阐述了类型系统、错误代码以及如何访问标量类型（字符串、布尔值、整数、大整数、浮点数、大十进制数和比率数）和集合。至关重要的是，它解释了 EDN.C 如何根据 Clojure 规范处理空白字符和控制字符。"
  },
  {
    "id": "46079818",
    "title": "Open-Source Nouveau+NVK vs. Nvidia 580 Linux Gaming&Compute Driver Performance",
    "url": "https://www.phoronix.com/review/nvidia-nvk-linux-618-mesa-26",
    "summary": "This Phoronix article from November 28, 2025, compares the performance of the open-source NVIDIA Linux driver stack (Nouveau kernel driver with Mesa NVK Vulkan driver, Zink OpenGL-on-Vulkan, and Rusticl for OpenCL) against NVIDIA's official 580 series Linux driver. The comparison covers both gaming/graphics and compute workloads.\n\nThe article tests three driver configurations: the default Nouveau/NVK from Ubuntu 25.10, an updated NVK Git version using newer kernel and Mesa drivers, and NVIDIA's official 580.95.05 driver. These are tested across GeForce RTX 4070 SUPER, RTX 4080 SUPER, and the newer RTX 5080 Blackwell graphics cards.\n\nThe goal is to provide an in-depth look at the current state of the open-source NVIDIA driver, building upon previous tests from July, highlighting the advancements in NVK, Rusticl, and Zink. The article notes that previous issues with Blackwell card testing have been resolved. The benchmark suite includes OpenGL, Vulkan, and OpenCL workloads, as well as OpenCL peak performance.\n\nThe article is structured into ten pages, with subsequent pages detailing specific benchmarks like GravityMark, 3DMark, DiRT Rally 2, Llama.cpp, Vulkan Compute, OpenCL, FluidX3D, and ViennaCL, ultimately leading to a conclusion about the performance comparison.\n",
    "chinese_title": "开源Nouveau+NVK对比Nvidia 580 Linux游戏与计算驱动性能",
    "chinese_summary": "2025年11月28日 Phoronix 文章对比了开源 NVIDIA Linux 驱动栈（Nouveau 内核驱动搭配 Mesa NVK Vulkan 驱动、Zink OpenGL-on-Vulkan 和 Rusticl OpenCL）与 NVIDIA 官方 580 系列 Linux 驱动的性能。对比涵盖了游戏/图形和计算工作负载。\n\n文章测试了三种驱动配置：Ubuntu 25.10 的默认 Nouveau/NVK、使用更新的内核和 Mesa 驱动的 NVK Git 版本，以及 NVIDIA 的官方 580.95.05 驱动。这些测试在 GeForce RTX 4070 SUPER、RTX 4080 SUPER 和更新的 RTX 5080 Blackwell 显卡上进行。\n\n目标是深入了解开源 NVIDIA 驱动的当前状态，基于 7 月份的先前测试，突出 NVK、Rusticl 和 Zink 的进展。文章指出先前 Blackwell 显卡测试的问题已得到解决。基准测试套件包括 OpenGL、Vulkan 和 OpenCL 工作负载，以及 OpenCL 峰值性能。\n\n文章分为十页，后续页面详细介绍了 GravityMark、3DMark、DiRT Rally 2、Llama.cpp、Vulkan Compute、OpenCL、FluidX3D 和 ViennaCL 等特定基准测试，最终得出关于性能对比的结论。"
  },
  {
    "id": "46038684",
    "title": "Implementing Bluetooth LE Audio and Auracast on Linux Systems",
    "url": "https://www.collabora.com/news-and-blog/blog/2025/11/24/implementing-bluetooth-le-audio-and-auracast-on-linux-systems/",
    "summary": "This article discusses the implementation of Bluetooth LE Audio and Auracast on Linux systems, highlighting its benefits over Bluetooth Classic. LE Audio, built on Bluetooth Low Energy, offers lower power consumption, lower latency, and a modular profile framework compared to Bluetooth Classic's limitations, which cause quality drops and high power usage. Auracast, enabled through the Public Broadcast Profile, allows audio broadcasting to multiple receivers simultaneously.\n\nOn Linux, LE Audio support is managed through BlueZ for the Bluetooth host stack and PipeWire for audio routing. Setting up LE Audio requires a recent Linux kernel (6.4 or later), BlueZ, and PipeWire versions. Hardware support varies, with some controllers supporting LE Audio but not Auracast. Configuration involves enabling experimental features in BlueZ and ensuring proper PipeWire setup.\n\nA challenge lies in dual-stack devices supporting both Bluetooth Classic and LE Audio, as switching between them requires disconnection and reconnection. Improvements are underway to address this. Ongoing development focuses on enhancing usability through command-line and GUI tools, creating a unified call control API, and undergoing Bluetooth SIG qualification testing. Collabora offers assistance in deploying LE Audio on embedded Linux systems, leveraging their expertise in the software stack and contributions to BlueZ and PipeWire.\n",
    "chinese_title": "在Linux系统上实现蓝牙LE音频和Auracast",
    "chinese_summary": "本文探讨了在Linux系统上实施蓝牙LE Audio和Auracast，并突出了其相对于蓝牙Classic的优势。LE Audio基于蓝牙低功耗技术，与蓝牙Classic的局限性（导致音质下降和高功耗）相比，LE Audio具有更低的功耗、更低的延迟以及模块化的配置文件框架。Auracast通过公共广播配置文件实现，允许音频同时广播到多个接收器。\n\n在Linux上，LE Audio支持由BlueZ管理蓝牙主机堆栈，PipeWire管理音频路由。设置LE Audio需要较新的Linux内核（6.4或更高版本）、BlueZ和PipeWire版本。硬件支持各不相同，一些控制器支持LE Audio，但不支持Auracast。配置涉及在BlueZ中启用实验性功能，并确保正确的PipeWire设置。\n\n一个挑战在于支持蓝牙Classic和LE Audio的双栈设备，因为在它们之间切换需要断开并重新连接。目前正在改进以解决这个问题。正在进行的开发工作侧重于通过命令行和GUI工具增强可用性，创建统一的呼叫控制API，并进行蓝牙SIG认证测试。Collabora提供在嵌入式Linux系统上部署LE Audio的协助，利用其在软件堆栈方面的专业知识以及对BlueZ和PipeWire的贡献。"
  },
  {
    "id": "46032623",
    "title": "OS Malevich – how we made a system that embodies the idea of simplicity (2017)",
    "url": "https://www.ajax-systems.uz/blog/hub-os-malevich-story/",
    "summary": "This article details the development journey of Ajax Systems' OS Malevich, a new operating system for their security hub, designed for simplicity and scalability. Initially, the team opted for a real-time operating system (RTOS) for its reliability and strict timeframes crucial for security systems, rejecting C for scalability concerns and Linux due to potential vulnerabilities and unpredictable operation times.\n\nWhile the initial RTOS-based system fulfilled basic requirements, the rapid influx of feature requests from different markets exposed limitations in scalability and development speed. Adding new features was slow and difficult to test. To overcome this, the team embarked on a complete overhaul of the OS, codenamed \"Malevich,\" drawing inspiration from Kazimir Malevich's \"Black Square\" to emphasize simplicity.\n\nOS Malevich incorporates elements from Linux, such as CPU time allocation and modular design with standard APIs, while maintaining the reliability of RTOS. This hybrid approach allows for faster development, easier testing, and improved scalability. By separating hardware and software and standardizing development across hub, server, and mobile applications, Ajax Systems aims to implement new features quickly without compromising system stability. The new OS allows hub to use a maximum of 20% of CPU even when performing resource-intensive tasks. Ultimately, the goal of OS Malevich is to provide a flexible and robust foundation for future growth and innovation within the Ajax security ecosystem.\n",
    "chinese_title": "OS Malevich – 我们如何打造一个体现简约理念的系统 (2017)",
    "chinese_summary": "本文详细介绍了Ajax Systems公司为其安全中心开发的新操作系统OS Malevich的历程，该系统旨在实现简洁性和可扩展性。最初，团队选择了实时操作系统(RTOS)，因为它具有可靠性和严格的时间框架，这对于安全系统至关重要。由于可扩展性问题，团队拒绝了C语言，并因为潜在的漏洞和不可预测的运行时间而拒绝了Linux。\n\n虽然最初基于RTOS的系统满足了基本要求，但来自不同市场的大量功能请求暴露了可扩展性和开发速度的局限性。添加新功能既缓慢又难以测试。为了克服这个问题，团队开始了对操作系统的全面改造，代号为“Malevich”，灵感来源于卡济米尔·马列维奇的“黑色方块”，以强调简洁性。\n\nOS Malevich融合了Linux的元素，例如CPU时间分配和具有标准API的模块化设计，同时保持了RTOS的可靠性。这种混合方法允许更快的开发、更容易的测试和改进的可扩展性。通过分离硬件和软件，并标准化中心、服务器和移动应用程序的开发，Ajax Systems旨在快速实施新功能，而不会影响系统稳定性。即使在执行资源密集型任务时，新操作系统也允许中心最多使用20%的CPU。最终，OS Malevich的目标是为Ajax安全生态系统内的未来增长和创新提供灵活而强大的基础。"
  },
  {
    "id": "46079963",
    "title": "Show HN: Research Papers as Memes",
    "url": "https://near.tl/tech",
    "summary": "The \"Show HN: Research Papers as Memes\" submission introduces Neartale, a project that aims to present research papers in the form of memes. The content suggests a novel approach to making complex academic information more accessible and engaging, potentially breaking down barriers to understanding research for a wider audience. By using the popular and easily digestible format of memes, Neartale likely seeks to simplify and highlight key findings or concepts from research papers. The concise presentation suggests the project is in its early stages, with the \"Loading...\" indicating potential ongoing development or limited initial content. Essentially, Neartale is an attempt to translate dense academic writing into humorous, shareable, and easily understood visual formats.\n",
    "chinese_title": "展示 HN：研究论文做成梗图",
    "chinese_summary": "“Show HN: 研究论文表情包化” 提交介绍了一个名为Neartale的项目，该项目旨在以表情包的形式呈现研究论文。 内容表明这是一种使复杂的学术信息更易于访问和理解的新颖方法，有可能打破更广泛的受众理解研究的障碍。 通过使用流行的、易于消化的表情包格式，Neartale可能试图简化并突出研究论文中的关键发现或概念。 简洁的呈现方式表明该项目处于早期阶段，“Loading...” 表明潜在的持续开发或有限的初始内容。 本质上，Neartale试图将密集的学术写作转化为幽默、可分享且易于理解的视觉格式。"
  },
  {
    "id": "46078924",
    "title": "Building an NPM Worm (2016)",
    "url": "https://contolini.com/building-an-npm-worm",
    "summary": "This 2016 article discusses the vulnerability of npm to a self-replicating worm due to the execution of arbitrary scripts during package installation. The author highlights how a malicious package, upon installation, could scan for other node modules, inject the same malicious script into them, bump their version numbers, and attempt to publish the infected versions to npm.\n\nThe author created a proof-of-concept \"pizza-party\" to demonstrate this. While most publish attempts would fail, infecting a few maintainers of widely used packages could trigger a widespread outbreak due to developers' common use of loose semver range specifiers in their `package.json` files. This means that users installing packages with dependencies using `^` or `~` could inadvertently download infected versions when they become available.\n\nThe article emphasizes the difficulty in undoing a worm's damage, requiring precise identification and purging of infected versions. Recommended protection measures include logging out of npm when not actively managing modules and using `npm shrinkwrap` to lock dependencies. The author acknowledges the inherent risks of using open-source code and blindly trusting dependencies, suggesting a need for increased security measures from npm Inc. and a call for developers to act responsibly. Despite the risks, the article recognizes the positive impact of npm and GitHub on open-source software development.\n",
    "chinese_title": "构建一个NPM蠕虫 (2016)",
    "chinese_summary": "该2016年的文章探讨了npm由于在包安装期间执行任意脚本而易受自复制蠕虫攻击的漏洞。作者强调了一个恶意包在安装后如何扫描其他node模块，将相同的恶意脚本注入其中，增加其版本号，并尝试将感染版本发布到npm。\n\n作者创建了一个概念验证“pizza-party”来演示这一点。虽然大多数发布尝试都会失败，但感染一些广泛使用软件包的维护者可能会引发大规模爆发，因为开发者通常在其`package.json`文件中使用宽松的语义版本范围说明符。这意味着当感染版本可用时，使用`^`或`~`安装具有依赖项的软件包的用户可能会无意中下载感染版本。\n\n文章强调了撤销蠕虫破坏的难度，需要精确识别和清除感染版本。建议的保护措施包括在不主动管理模块时注销npm，以及使用`npm shrinkwrap`锁定依赖项。作者承认使用开源代码和盲目信任依赖项的固有风险，并建议npm Inc.需要加强安全措施，并呼吁开发者负责任地行动。尽管存在风险，但文章认识到npm和GitHub对开源软件开发的积极影响。"
  },
  {
    "id": "46077992",
    "title": "The mysterious black fungus from Chernobyl that may eat radiation",
    "url": "https://www.bbc.com/future/article/20251125-the-mysterious-black-fungus-from-chernobyl-that-appears-to-eat-radiation",
    "summary": "This article explores the remarkable discovery of black fungi in Chernobyl that appear to thrive on radiation. Nelli Zhdanova's research revealed that these fungi, rich in melanin, exhibit \"radiotropism,\" growing towards radioactive particles rather than being harmed by them.\n\nBuilding on this, Ekaterina Dadachova's research suggests the fungi may be using radiation for energy, a process she terms \"radiosynthesis.\" While the exact mechanism is still a theory, the melanised fungi grew faster in the presence of radiation.\n\nScientists at NASA are exploring the potential of these fungi for radiation shielding, particularly for astronauts in space. A study on the International Space Station showed that the Chernobyl fungus, Cladosporium sphaerospermum, grew better in space, exposed to galactic cosmic radiation. Furthermore, the fungus appeared to block radiation, suggesting melanin's protective capabilities.\n\nThe use of fungi-based materials, termed \"myco-architecture,\" offers a potentially lighter and self-regenerating alternative to traditional radiation shields like water or metal, which are costly to transport into space. This could enable safer long-term space missions and lunar or Martian bases. In essence, the black moulds that have colonized the abandoned Chernobyl may hold the key to protecting future space explorers.\n",
    "chinese_title": "切尔诺贝利的神秘黑真菌或可吞噬辐射",
    "chinese_summary": "本文探讨了在切尔诺贝利发现的黑真菌的非凡现象，这些真菌似乎能在辐射中茁壮成长。Nelli Zhdanova的研究表明，这些富含黑色素的真菌表现出“放射趋性”，即它们会向放射性粒子生长，而不是受到其伤害。\n\n在此基础上，Ekaterina Dadachova的研究表明，这些真菌可能正在利用辐射获取能量，她将这一过程称为“放射合成”。虽然确切的机制仍是一种理论，但含黑色素的真菌在辐射存在下生长得更快。\n\n美国宇航局的科学家正在探索这些真菌在辐射屏蔽方面的潜力，特别是对于太空中的宇航员。国际空间站的一项研究表明，切尔诺贝利真菌——球孢枝孢菌——在太空中的生长情况更好，因为它暴露于银河宇宙射线。此外，该真菌似乎可以阻挡辐射，这表明黑色素具有保护能力。\n\n使用基于真菌的材料，称为“真菌建筑”，为传统的辐射屏蔽材料（如水或金属）提供了一种潜在的更轻、可自我再生的替代方案，而这些传统材料的运输成本很高。这可以实现更安全的长期太空任务以及月球或火星基地。本质上，已经占领废弃切尔诺贝利的黑霉菌可能掌握着保护未来太空探险家的关键。"
  },
  {
    "id": "46073855",
    "title": "250MWh 'Sand Battery' to start construction in Finland",
    "url": "https://www.energy-storage.news/250mwh-sand-battery-to-start-construction-in-finland-for-both-heating-and-ancillary-services/",
    "summary": "生成摘要时出错",
    "chinese_title": "250MWh 'Sand Battery' to start construction in Finland",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46073817",
    "title": "A programmer-friendly I/O abstraction over io_uring and kqueue (2022)",
    "url": "https://tigerbeetle.com/blog/2022-11-23-a-friendly-abstraction-over-iouring-and-kqueue/",
    "summary": "This article details building a programmer-friendly I/O abstraction layer on top of `io_uring` (Linux) and `kqueue` (FreeBSD/macOS), inspired by libuv and TigerBeetle's I/O library. It starts by contrasting blocking I/O with batched I/O using `io_uring` and `kqueue`, highlighting performance benefits. The article advocates for separating I/O handling from business logic using a central dispatcher with callbacks for I/O completion. This abstraction handles the complexities of submission and completion queues, using user data fields to track callbacks. The abstraction includes a `flush` function to submit requests and poll for completion events, wrapped by `run_for_ns` for time-limited execution within an event loop.  An overflow queue manages requests that cannot be immediately submitted. The article contrasts Darwin/macOS (kqueue) and Linux (io_uring) implementations, showing how userland `send` calls are required in macOS. Finally, it briefly mentions Windows IOCP and discusses single-threaded vs. multi-threaded event loop architectures, before hinting at a future standalone, cross-platform I/O library in Zig.\n",
    "chinese_title": "一个对程序员友好的io_uring和kqueue I/O抽象层 (2022)",
    "chinese_summary": "本文详细介绍了如何在`io_uring`(Linux)和`kqueue`(FreeBSD/macOS)之上构建一个程序员友好的I/O抽象层，其灵感来自libuv和TigerBeetle的I/O库。文章首先对比了阻塞式I/O与使用`io_uring`和`kqueue`的批量I/O，突出了性能优势。文章提倡使用带有I/O完成回调的中央调度器将I/O处理与业务逻辑分离。这种抽象处理了提交和完成队列的复杂性，并使用用户数据字段来跟踪回调。该抽象包括一个`flush`函数，用于提交请求和轮询完成事件，并由`run_for_ns`封装，以便在事件循环中进行时间限制的执行。溢出队列管理无法立即提交的请求。文章对比了 Darwin/macOS (kqueue) 和 Linux (io_uring) 的实现，展示了 macOS 中如何需要用户态的 `send` 调用。最后，文章简要提及了 Windows IOCP，并讨论了单线程与多线程事件循环架构，然后暗示了未来用 Zig 编写的独立、跨平台 I/O 库。"
  },
  {
    "id": "46079792",
    "title": "PocketBase MCP Server",
    "url": "https://github.com/ssakone/pb_mcp_server",
    "summary": "This document describes the PocketBase MCP Server, a tool that allows AI assistants and other MCP clients to interact with PocketBase databases. It provides comprehensive access to PocketBase's functionality, including authentication, data management, and administrative operations.\n\nKey features include: admin and user authentication with session persistence, automatic authentication at startup, collection and record management (CRUD operations), user management, custom HTTP headers, raw HTTP request sending, query support (filtering, sorting, pagination), consistent error handling, multi-instance support, and an optional TOON output format for token reduction with LLMs.\n\nThe server can be installed via `git` and `npm`. Configuration is handled through environment variables or a `pocketbase.config.json` file, specifying the PocketBase URL, admin token, and output format. It can be run in `stdio` mode for MCP clients or HTTP/SSE mode for web clients.\n\nThe document details available tools, including authentication, collection management, record CRUD, user management, and custom HTTP requests. Each tool description includes parameters, types, and descriptions. The `send_custom_request` tool is highlighted for its flexibility in interacting with any PocketBase API endpoint. Examples of usage are provided for filtering, batch operations, validation, and health checks. Error handling is standardized with informative messages and error codes. The document also provides details on PocketBase filter syntax and development setup.\n",
    "chinese_title": "PocketBase MCP服务器",
    "chinese_summary": "本文档介绍了PocketBase MCP服务器，该工具允许AI助手和其他MCP客户端与PocketBase数据库进行交互。它提供了对PocketBase功能的全面访问，包括身份验证、数据管理和管理操作。\n\n主要功能包括：具有会话持久性的管理员和用户身份验证，启动时自动身份验证，集合和记录管理（CRUD操作），用户管理，自定义HTTP标头，原始HTTP请求发送，查询支持（过滤、排序、分页），一致的错误处理，多实例支持，以及可选的TOON输出格式，用于减少LLM的token。\n\n服务器可以通过`git`和`npm`安装。配置通过环境变量或`pocketbase.config.json`文件处理，指定PocketBase URL、管理员token和输出格式。它可以在`stdio`模式下为MCP客户端运行，也可以在HTTP/SSE模式下为Web客户端运行。\n\n本文档详细介绍了可用工具，包括身份验证、集合管理、记录CRUD、用户管理和自定义HTTP请求。每个工具描述都包括参数、类型和描述。 `send_custom_request`工具因其与任何PocketBase API端点交互的灵活性而突出显示。 提供了过滤、批处理操作、验证和运行状况检查的使用示例。 错误处理已标准化，带有信息丰富的消息和错误代码。 本文档还提供了有关PocketBase过滤器语法和开发设置的详细信息。"
  },
  {
    "id": "46075219",
    "title": "Shor's algorithm: the one quantum algo that ends RSA/ECC tomorrow",
    "url": "https://blog.ellipticc.com/posts/what-is-shors-algorithm-and-why-its-the-single-biggest-threat-to-classical-cryptography/",
    "summary": "Shor's algorithm, as the article describes, is a quantum algorithm that poses a significant threat to widely used classical cryptographic systems like RSA and Elliptic Curve Cryptography (ECC). These systems rely on the mathematical difficulty of factoring large numbers (for RSA) or solving the elliptic curve discrete logarithm problem (for ECC).\n\nShor's algorithm leverages the principles of quantum mechanics to efficiently solve these problems. It allows a quantum computer to factor large numbers exponentially faster than the best-known classical algorithms. This means that keys used to encrypt data with RSA and ECC, which would take centuries or even millennia to crack with classical computers, could be broken in a matter of hours, days, or weeks with a sufficiently powerful quantum computer.\n\nThe article likely explains that Shor's algorithm works by transforming the factoring problem into a period-finding problem. Quantum computers excel at finding patterns and periodicities due to their ability to exist in multiple states simultaneously (superposition) and interfere with those states (quantum interference). The algorithm uses a quantum Fourier transform to efficiently identify the period, which then leads to the factors of the original number.\n\nThe consequence of a quantum computer running Shor's algorithm successfully would be the widespread vulnerability of secure communications and data storage systems. This includes financial transactions, government secrets, and any other sensitive information protected by RSA or ECC. The article likely concludes by emphasizing the urgency in developing post-quantum cryptography (PQC), which are cryptographic algorithms resistant to attacks from both classical and quantum computers, to mitigate this threat.\n",
    "chinese_title": "肖尔算法：明日终结RSA/ECC的量子算法",
    "chinese_summary": "肖尔算法，正如文章所述，是一种量子算法，对广泛使用的经典密码系统，如RSA和椭圆曲线密码学（ECC）构成了重大威胁。这些系统依赖于大数分解（对于RSA）或求解椭圆曲线离散对数问题（对于ECC）的数学难度。\n\n肖尔算法利用量子力学的原理来高效地解决这些问题。它使量子计算机能够以比已知最佳经典算法快指数级的速度分解大数。这意味着使用RSA和ECC加密数据的密钥，用经典计算机需要数百年甚至数千年才能破解，而用足够强大的量子计算机可能只需数小时、数天或数周即可破解。\n\n文章可能解释了肖尔算法通过将分解问题转化为周期查找问题来工作。量子计算机擅长查找模式和周期性，这归功于它们能够同时存在于多种状态（叠加）并干扰这些状态（量子干涉）。该算法使用量子傅里叶变换来有效地识别周期，从而得到原始数字的因子。\n\n量子计算机成功运行肖尔算法的后果将是安全通信和数据存储系统的广泛脆弱性。这包括金融交易、政府机密以及受RSA或ECC保护的任何其他敏感信息。文章可能最后强调开发后量子密码学（PQC）的紧迫性，后量子密码学是能够抵抗经典计算机和量子计算机攻击的密码算法，以减轻这种威胁。"
  },
  {
    "id": "46078571",
    "title": "Show HN: DB Pro – A Modern Desktop Client for Postgres, MySQL, SQLite and LibSQL",
    "url": "https://www.dbpro.app/",
    "summary": "DB Pro is a new desktop application designed for developers to manage PostgreSQL, MySQL, SQLite, Supabase, and Turso databases. It offers a modern interface with features like visual change review, inline data editing, a raw SQL editor, full database activity logs, and a visual schema explorer. Users can also tag tables for better organization.\n\nThe application aims to be a comprehensive database workbench with plans for future features like dashboards, workflows, and support for more databases including MongoDB, MariaDB, Redis, and Neon. A public roadmap details upcoming features across categories such as Query Workbench, Dashboards & Insights, Workflow Builder, Integrations, AI-Powered Chat, Performance Testing, DB Pro Cloud, Visual ERD Designer, and Triggers.\n\nDB Pro offers a free tier with basic features and a paid \"Solo\" tier for $9.99/month that unlocks unlimited connections, tabs, table tags, exports, supports up to 3 devices and email support. A \"Team\" tier with team collaboration and \"Enterprise\" tier with dedicated support are coming soon. The application is currently available for macOS, with Windows and Linux versions planned. Users can download the free version to get started.\n",
    "chinese_title": "展示HN：DB Pro – 一款适用于Postgres、MySQL、SQLite和LibSQL的现代桌面客户端",
    "chinese_summary": "DB Pro 是一款全新的桌面应用程序，专为开发者设计，用于管理 PostgreSQL、MySQL、SQLite、Supabase 和 Turso 数据库。它提供了一个现代化的界面，具有可视化变更审查、内联数据编辑、原始 SQL 编辑器、完整数据库活动日志和可视化模式浏览器等功能。用户还可以标记表以实现更好的组织。\n\n该应用程序旨在成为一个全面的数据库工作台，并计划在未来添加仪表板、工作流以及对更多数据库（包括 MongoDB、MariaDB、Redis 和 Neon）的支持。公开路线图详细介绍了即将推出的功能，涵盖查询工作台、仪表板与洞察、工作流构建器、集成、AI驱动的聊天、性能测试、DB Pro 云、可视化 ERD 设计器和触发器等类别。\n\nDB Pro 提供包含基本功能的免费层级，以及每月 9.99 美元的付费“Solo”层级，该层级可解锁无限连接、选项卡、表标签、导出，并支持最多 3 个设备和电子邮件支持。具有团队协作功能的“Team”层级和具有专属支持的“Enterprise”层级即将推出。该应用程序目前适用于 macOS，并计划推出 Windows 和 Linux 版本。用户可以下载免费版本以开始使用。"
  },
  {
    "id": "46079388",
    "title": "TPUv7: Google Takes a Swing at the King",
    "url": "https://newsletter.semianalysis.com/p/tpuv7-google-takes-a-swing-at-the",
    "summary": "This article, \"TPUv7: Google Takes a Swing at the King,\" argues that Google's Tensor Processing Units (TPUs) are becoming a significant threat to Nvidia's dominance in the AI hardware market.  The author highlights Anthropic's massive 1GW+ TPU purchase and Google's move to sell TPUs externally to companies like Meta, SSI, and xAI, potentially saving them on GPU capex.\n\nThe piece emphasizes that AI infrastructure is critical to success, with TPUs offering a compelling performance-per-dollar advantage, even before deployment (as evidenced by OpenAI negotiating lower GPU prices).  Google's decision to commercialize TPUs, after years of internal use, marks a major shift, leveraging its silicon design expertise to compete with Nvidia.\n\nThe article details Anthropic's deal, including a large purchase of TPUv7 Ironwoods and a significant rental agreement through GCP. Google's power constraints are also mentioned, leading to innovative solutions like utilizing Neocloud providers and offering credit backstops.\n\nFinally, the article underscores the technical strengths of TPUs, citing the training of Gemini 3 on them, and argues that Google's system-level engineering allows TPUs to rival Nvidia in performance and cost-efficiency. The shift to Neocloud infrastructure is also explored. The article anticipates further growth and competition in the AI hardware market, particularly with Google's TPU offerings.\n",
    "chinese_title": "TPUv7：谷歌剑指王者",
    "chinese_summary": "TPUv7：谷歌挥拳挑战AI芯片霸主地位"
  },
  {
    "id": "46035819",
    "title": "Maxduino Review: Tape Cassette Emulator for Multiple Retro Computers",
    "url": "https://retrogamecoders.com/maxduino-review/",
    "summary": "The Maxduino is a tape cassette emulator for a variety of retro computers, aiming to replace the slow and unreliable tape loading process with a modern SD card interface. The RetroGameCoders review highlights its broad compatibility, supporting machines like the Commodore 64, ZX Spectrum, Amstrad CPC, Atari 8-bit computers, and more through interchangeable firmware.\n\nThe key advantage of the Maxduino is its ability to load games and programs significantly faster than traditional tape drives. It reads .TAP, .CDT, .TZX, and other common tape image formats from an SD card and outputs a signal that mimics a tape drive, allowing the retro computer to load the data.\n\nThe review mentions the device is relatively easy to set up, requiring only connection to the computer's tape port. Navigation of the SD card content is performed via buttons and a small screen on the Maxduino. Different models of the Maxduino offer various features, such as a built-in amplifier and speaker for outputting audio, as well as different case designs.\n\nWhile the review doesn't explicitly state any major drawbacks, it implicitly notes that the Maxduino is dependent on readily available and compatible tape image formats. The review focuses on its functionality, compatibility, and ease of use, positioning it as a valuable tool for retro computing enthusiasts looking for a convenient and efficient way to load software. The versatility stemming from its multi-system compatibility further enhances its appeal.\n",
    "chinese_title": "Maxduino 评测：多款复古电脑磁带盒仿真器",
    "chinese_summary": "Maxduino是一款磁带盒式录音机模拟器，适用于各种复古电脑，旨在用现代SD卡接口取代缓慢且不可靠的磁带加载过程。 RetroGameCoders的评测强调了其广泛的兼容性，通过可互换的固件支持 Commodore 64、ZX Spectrum、Amstrad CPC、Atari 8位电脑等机器。\n\nMaxduino 的主要优势在于其加载游戏和程序的速度明显快于传统磁带驱动器。它可以从 SD 卡读取 .TAP、.CDT、.TZX 和其他常见的磁带映像格式，并输出一个模仿磁带驱动器的信号，使复古电脑能够加载数据。\n\n评测提到该设备设置相对容易，只需连接到电脑的磁带端口即可。 SD 卡内容的导航通过 Maxduino 上的按钮和小屏幕进行。 Maxduino 的不同型号提供各种功能，例如用于输出音频的内置放大器和扬声器，以及不同的外壳设计。\n\n虽然评测没有明确说明任何主要缺点，但它含蓄地指出 Maxduino 依赖于容易获得且兼容的磁带映像格式。评测侧重于其功能、兼容性和易用性，将其定位为复古计算爱好者寻找便捷高效的软件加载方式的宝贵工具。源于其多系统兼容性的多功能性进一步增强了其吸引力。"
  },
  {
    "id": "46078917",
    "title": "The Eleven-Faced Die That Emulates Two Six-Sided Dice",
    "url": "https://hackaday.com/2025/11/28/the-eleven-faced-die-that-emulates-two-six-sided-dice/",
    "summary": "Researchers have created an eleven-sided die that replicates the probability distribution of rolling two six-sided dice (2d6). This means the die, when rolled, produces results from 2 to 12 with the same bell curve distribution as 2d6, making 7 the most likely outcome and 2 and 12 the least.\n\nThe development stems from research focused on predicting stable resting states for rigid bodies without relying on simulations. This new method is differentiable, allowing for the design of shapes with specific probability distributions. As an example, the team was also able to design a three-sided die with a custom 25%-50%-25% distribution.\n\nThe creator, Hossein Baktash, has provided 3D models for printing. Preliminary physical testing suggests the die's performance aligns with the theoretical predictions, particularly when rolled on hard surfaces. However, automated testing has not yet been conducted to definitively confirm the accuracy and reliability of this novel die.\n",
    "chinese_title": "模拟两个六面骰子的十一面骰子",
    "chinese_summary": "研究人员创造了一种十一面骰子，它可以复制掷两个六面骰子（2d6）的概率分布。这意味着，该骰子在掷出时，会产生从2到12的结果，其概率分布与2d6的钟形曲线相同，使得7是最可能的结果，而2和12是最不可能的结果。\n\n这项开发源于一项研究，该研究致力于预测刚体的稳定静止状态，而无需依赖模拟。这种新方法是可微的，从而可以设计具有特定概率分布的形状。例如，该团队还能够设计一个具有25%-50%-25%自定义分布的三面骰子。\n\n创造者侯赛因·巴克塔什已经提供了用于打印的3D模型。初步的物理测试表明，该骰子的性能与理论预测相符，尤其是在硬表面上滚动时。然而，尚未进行自动化测试来最终确认这种新型骰子的准确性和可靠性。"
  },
  {
    "id": "46070668",
    "title": "Same-day upstream Linux support for Snapdragon 8 Elite Gen 5",
    "url": "https://www.qualcomm.com/developer/blog/2025/10/same-day-snapdragon-8-elite-gen-5-upstream-linux-support",
    "summary": "This article snippet announces the availability of same-day, upstream Linux support for the Snapdragon 8 Elite Gen 5 processor.\n\nThe key takeaway is the rapid and complete availability of Linux support through standard channels (upstream) for this new Snapdragon processor. This signifies a commitment to open-source compatibility and allows Linux developers and users to immediately leverage the full capabilities of the Snapdragon 8 Elite Gen 5 within their Linux environments without relying on custom patches or waiting for delayed driver development.\n",
    "chinese_title": "骁龙 8 Gen 5 精英版当日上游 Linux 支持",
    "chinese_summary": "本文宣布骁龙8 Elite Gen 5处理器现已支持同日上游Linux。\n\n关键在于，这款新型骁龙处理器通过标准渠道（上游）即可快速、完整地获得Linux支持。 这表明了对开源兼容性的承诺，并使Linux开发者和用户能够立即在其Linux环境中使用骁龙8 Elite Gen 5的全部功能，而无需依赖自定义补丁或等待延迟的驱动程序开发。"
  },
  {
    "id": "46024302",
    "title": "Indie, alone, and figuring it out",
    "url": "https://danijelavrzan.com/posts/2025/11/indie-dev/",
    "summary": "This article explores the realities of being an indie app developer, contrasting the initial allure of freedom with the challenges encountered after taking the leap. While escaping the 9-to-5 grind is appealing, indie developers quickly discover they're responsible for every aspect of the business: development, design, product management, marketing, analytics, and customer support.\n\nThe author emphasizes the loneliness and pressure of working alone, highlighting the constant decision-making and context-switching required. While online communities offer support, it's not the same as a team environment.\n\nA significant portion of the article focuses on the non-coding tasks crucial for success, such as marketing, App Store Optimization (ASO), and paywall implementation. User feedback is paramount, shaping the app's direction and requiring developers to balance diverse opinions with their own vision.\n\nTime management becomes critical, requiring careful prioritization between feature development, bug fixes, user support, and marketing. Despite the demands, the author finds indie life rewarding, offering flexibility and continuous learning.\n\nThe article briefly touches on the role of AI, acknowledging its potential to speed up development and assist with tasks like debugging and copywriting, while cautioning against over-reliance, especially with new technologies.\n\nFinally, the author shares valuable resources for aspiring indie developers, including tools for ASO, courses on indie development, and books covering essential non-coding aspects of app development. Despite the challenges, the author enjoys the journey, finding fulfillment in the autonomy and learning opportunities it provides.\n",
    "chinese_title": "独立，孤身，独自摸索",
    "chinese_summary": "本文探讨了独立应用开发者的现实情况，将最初对自由的向往与迈出这一步后遇到的挑战进行了对比。虽然摆脱朝九晚五的工作很有吸引力，但独立开发者很快发现他们要负责业务的方方面面：开发、设计、产品管理、营销、分析和客户支持。\n\n作者强调了独自工作的孤独和压力，突出了持续的决策和情境切换需求。虽然在线社区提供支持，但这与团队环境不同。\n\n文章的很大一部分重点介绍了对成功至关重要的非编码任务，例如营销、应用商店优化（ASO）和付费墙实施。用户反馈至关重要，它塑造了应用程序的方向，并要求开发人员在各种意见与他们自己的愿景之间取得平衡。\n\n时间管理变得至关重要，需要在功能开发、错误修复、用户支持和营销之间进行仔细的优先级排序。尽管要求很高，但作者发现独立生活是有回报的，提供了灵活性和持续学习的机会。\n\n文章简要地提到了人工智能的作用，承认其有潜力加速开发并协助调试和文案撰写等任务，同时告诫不要过度依赖，尤其是在新技术方面。\n\n最后，作者分享了有抱负的独立开发者的宝贵资源，包括ASO工具、独立开发课程以及涵盖应用程序开发基本非编码方面的书籍。 尽管面临挑战，作者仍然享受这段旅程，并在它提供的自主权和学习机会中找到满足感。"
  },
  {
    "id": "46037261",
    "title": "Installing Java in 2025, and Version Managers",
    "url": "https://blog.hakanserce.com/post/version_managers/",
    "summary": "This article addresses the complexities of installing and managing Java in a modern development environment, a stark contrast to the simpler process of the past.  The proliferation of Java vendors (Oracle, Amazon, Red Hat, Eclipse, etc.) and the availability of multiple Long-Term Support (LTS) versions (8, 11, 17, 21, and others) makes choosing and managing the right version a significant challenge, especially as different projects often require different versions.\n\nThe article contrasts manual installation (downloading installers, managing PATH) with the use of version managers like SDKMAN!.  Version managers provide a unified interface for installing, updating, and switching between different versions of languages and runtimes, acting as package managers optimized for version control. SDKMAN! examples demonstrate commands for listing, installing, and selecting Java versions, both globally and on a per-project basis.\n\nThe benefits of version managers include simplicity, reproducibility, isolation, easy upgrades, cleanup, and discovery. The article highlights popular version managers for various languages: pyenv for Python, nvm for Node.js, SDKMAN! for Java/Kotlin/Scala/Groovy, and rbenv for Ruby.  Tools like asdf-vm and vfox can handle multiple languages. The article encourages developers to adopt version managers for improved workflow and concludes that version managers are essential for modern software development, simplifying the management of multiple language versions and distributions.\n",
    "chinese_title": "2025年安装Java及版本管理器",
    "chinese_summary": "本文探讨了在现代开发环境中安装和管理Java的复杂性，这与过去简单的流程形成了鲜明对比。Java供应商（Oracle、Amazon、Red Hat、Eclipse等）的激增以及多种长期支持(LTS)版本（8、11、17、21等）的可用性，使得选择和管理正确的版本成为一项重大挑战，尤其是在不同项目通常需要不同版本的情况下。\n\n本文对比了手动安装（下载安装程序，管理PATH）与使用诸如SDKMAN!之类的版本管理器。版本管理器为安装、更新和切换不同语言和运行时版本提供了一个统一的界面，充当针对版本控制进行优化的软件包管理器。SDKMAN! 的例子演示了用于列出、安装和选择Java版本的命令，包括全局和基于项目的版本。\n\n版本管理器的优势包括简单性、可重现性、隔离性、轻松升级、清理和发现。本文重点介绍了各种语言的流行版本管理器：用于Python的pyenv，用于Node.js的nvm，用于Java/Kotlin/Scala/Groovy的SDKMAN!，以及用于Ruby的rbenv。像asdf-vm和vfox这样的工具可以处理多种语言。本文鼓励开发人员采用版本管理器以改进工作流程，并得出结论，版本管理器对于现代软件开发至关重要，简化了多种语言版本和发行版的管理。"
  },
  {
    "id": "46079152",
    "title": "A Man Powers His Home for 8 Years Using 1k Recycled Laptop Batteries",
    "url": "https://scienceclock.com/a-man-powers-his-home-for-8-years-using-1000-recycled-laptop-batteries/",
    "summary": "For eight years, a man known as Glubux has powered his home using a DIY system built from over 1,000 recycled laptop batteries. He started the project in 2016, aiming for grid independence through a combination of solar panels and repurposed batteries.\n\nThe initial setup included a 1.4 kW solar panel system, a forklift battery, and inverters. Glubux expanded the system by collecting and repurposing discarded laptop batteries, recognizing their potential as a renewable energy source. He built a separate warehouse to house the growing battery bank, charge controllers, and inverters.\n\nThe process involved disassembling laptop batteries, removing individual cells, and organizing them into custom racks. This labor-intensive task addressed uneven discharge rates and ensured efficient operation. The system evolved from a small setup to one powered by 650 batteries at an intermediate stage, and eventually exceeded 1,000 batteries.\n\nThe current system features 24 solar panels, each rated at 440W. Remarkably, Glubux claims no battery cell has needed replacement in eight years, and no major issues like fires or swollen batteries have occurred. The system successfully powers his home and appliances, demonstrating the potential of repurposing electronic waste for sustainable energy solutions.\n",
    "chinese_title": "男子用1000块回收笔记本电脑电池供电自家8年",
    "chinese_summary": "八年来，一位名叫格鲁布克斯的男子一直用自制系统为他的家供电，该系统由1000多块回收的笔记本电脑电池组成。他于2016年启动该项目，旨在通过太阳能电池板和再利用的电池相结合来实现电网独立。\n\n最初的设置包括一个1.4千瓦的太阳能电池板系统、一个叉车电池和逆变器。格鲁布克斯通过收集和再利用废弃的笔记本电脑电池来扩展系统，他认识到这些电池作为可再生能源的潜力。他建造了一个单独的仓库来存放不断增长的电池组、充电控制器和逆变器。\n\n这个过程包括拆卸笔记本电脑电池，取出单个电芯，并将它们整理到定制的机架中。这项劳动密集型的工作解决了放电率不均的问题，并确保了高效运行。该系统从一个小型的装置发展到中间阶段由650块电池供电，最终超过了1000块电池。\n\n目前的系统配备了24块太阳能电池板，每块额定功率为440瓦。值得注意的是，格鲁布克斯声称八年来没有电池需要更换，也没有发生火灾或电池膨胀等重大问题。该系统成功地为他的家庭和电器供电，证明了再利用电子垃圾来获得可持续能源解决方案的潜力。"
  },
  {
    "id": "46069048",
    "title": "TPUs vs. GPUs and why Google is positioned to win AI race in the long term",
    "url": "https://www.uncoveralpha.com/p/the-chip-made-for-the-ai-inference",
    "summary": "This article provides a deep dive into Google's Tensor Processing Units (TPUs), arguing that they give Google a significant competitive advantage in the AI race, particularly in the long term. It begins by explaining the history of the TPU, born out of Google's need for a more efficient solution for handling the computational demands of AI services.\n\nThe core difference between TPUs and GPUs is highlighted: GPUs are general-purpose parallel processors, while TPUs are domain-specific architectures designed specifically for TensorFlow neural networks using a Systolic Array. This architecture reduces memory access, leading to better performance per watt. The newest TPUv7 (Ironwood) boasts significant performance improvements over previous versions.\n\nWhile performance numbers are hard to come by, analysis suggests TPUs are more cost-effective and energy-efficient than Nvidia GPUs for specific applications. Experts mention 1.4x better performance per dollar in certain cases. However, adoption is hindered by the ecosystem gap. Nvidia's CUDA is widely adopted, while TPUs use JAX and TensorFlow. The multi-cloud environment also presents a challenge, as TPUs are primarily available on GCP, unlike Nvidia GPUs available across all major cloud providers.\n\nDespite these challenges, the article emphasizes the rapid improvement rate of TPUs and Google's optimization of its ecosystem for TPUs. Even Nvidia acknowledges the special case of Google's TPUs. The article concludes that Google's TPU investment positions them well, especially in the inference era, where CUDA's dominance is less critical.\n",
    "chinese_title": "TPU vs. GPU：以及为何谷歌有望赢得长期人工智能竞赛",
    "chinese_summary": "深入剖析谷歌张量处理器 (TPU)：人工智能竞赛中的长期优势"
  },
  {
    "id": "46075616",
    "title": "Beads – A memory upgrade for your coding agent",
    "url": "https://github.com/steveyegge/beads",
    "summary": "Beads is presented as a \"memory upgrade\" for coding agents, a lightweight graph-based issue tracker designed to improve organization, focus, and handling of long-term tasks. Version 0.20.1 introduces a significant upgrade with multi-worker support, enabled by switching from sequential issue IDs to collision-resistant hash-based IDs (e.g., bd-a1b2). This eliminates merge conflicts in multi-agent or multi-branch workflows.\n\nKey features include zero setup, dependency tracking, ready work detection, git versioning, distributed design, optional agent mail, protected branch support, extensibility, dependency trees, audit trails, and memory decay. Beads is primarily designed for AI coding agents, not direct human interaction. Agents automatically file and manage issues, improving long-term planning and preventing lost work. It's backed by git, acting like a managed SQL database shared by all agents.\n\nInstallation is simple, with options for npm, quick install scripts, and Homebrew. Setting up involves running `bd init` in the project root. The article emphasizes the importance of configuring an `AGENTS.md` file with a session-ending protocol to ensure agents properly manage issue tracking and database synchronization. Beads automatically syncs the local database with git, and provides options to manually or disable auto-sync. Stealth mode provides isolated usage, hiding beads-related files from collaborators.\n",
    "chinese_title": "珠子 – 为你的编码代理提供的内存升级",
    "chinese_summary": "Beads：编码代理的“记忆升级”，轻量级图结构问题追踪器，旨在提升组织性、专注度和长期任务处理能力。0.20.1版本引入多工作者支持的重大升级，通过将顺序问题ID切换为防冲突的哈希ID（例如，bd-a1b2）实现。这消除了多代理或多分支工作流中的合并冲突。\n\n主要功能包括零配置、依赖追踪、就绪工作检测、git版本控制、分布式设计、可选代理邮件、受保护分支支持、可扩展性、依赖树、审计追踪和记忆衰减。Beads主要为AI编码代理设计，而非直接的人工交互。代理自动提交和管理问题，改善长期规划并防止工作丢失。它以git为后盾，就像一个由所有代理共享的托管SQL数据库。\n\n安装简单，可通过npm、快速安装脚本和Homebrew进行安装。设置包括在项目根目录下运行`bd init`。本文强调配置`AGENTS.md`文件以及会话结束协议的重要性，以确保代理正确管理问题追踪和数据库同步。Beads自动将本地数据库与git同步，并提供手动或禁用自动同步的选项。隐身模式提供隔离的使用，对合作者隐藏与beads相关的文件。"
  },
  {
    "id": "46078046",
    "title": "OpenAI won't make money by 2030 and needs another $207B, HSBC estimates",
    "url": "https://fortune.com/2025/11/26/is-openai-profitable-forecast-data-center-200-billion-shortfall-hsbc/",
    "summary": "HSBC estimates that OpenAI will not be profitable by 2030 and will require an additional $207 billion to fund its growth plans, primarily due to soaring infrastructure costs (data centers and compute). While HSBC acknowledges AI as a significant trend and anticipates OpenAI holding a leading revenue position, the company faces a massive financial hurdle to meet its ambitions.\n\nOpenAI's cumulative free cash flow is projected to remain negative through 2030, with cloud and AI infrastructure costs reaching $792 billion between late 2025 and 2030, and total compute commitments reaching $1.4 trillion by 2033. Projected revenues, even with a growing subscriber base and potential capture of digital ad revenue, won't bridge this gap.\n\nHSBC suggests several options to close the gap, including increasing paid subscribers, capturing more ad revenue, or improving compute efficiencies. However, even in optimistic scenarios, further capital beyond 2030 will be needed.\n\nOpenAI's survival is heavily dependent on its backers like Microsoft and Amazon, and the overall AI ecosystem. Potential risks include unproven revenue models, market saturation, regulatory scrutiny, and the sheer scale of required capital injections. Raising more debt is a possible avenue, but current market conditions are challenging.\n\nThe article also touches on the debate surrounding the actual productivity gains from technology, citing concerns that the internet revolution hasn't significantly improved productivity in offices or factories. The increasing focus on data centers and hardware raises questions about the sustainability of growth based on future, potentially uncertain, AI returns.\n",
    "chinese_title": "汇丰银行估计，OpenAI到2030年将无法盈利，并且还需要额外2070亿美元。",
    "chinese_summary": "汇丰银行预计OpenAI到2030年都无法实现盈利，并需要额外2070亿美元的资金来支持其增长计划，主要原因是基础设施成本（数据中心和计算）飙升。尽管汇丰银行承认人工智能是一个重要趋势，并预计OpenAI将保持领先的收入地位，但该公司面临着巨大的财务障碍才能实现其雄心壮志。\n\nOpenAI的累计自由现金流预计到2030年仍将为负，从2025年末到2030年，云和人工智能基础设施成本将达到7920亿美元，到2033年，总计算承诺将达到1.4万亿美元。即使拥有不断增长的订阅用户群和潜在的数字广告收入，预计收入也无法弥补这一差距。\n\n汇丰银行提出了几种弥补这一差距的方案，包括增加付费订阅用户、获取更多广告收入或提高计算效率。然而，即使在乐观的情况下，2030年以后仍需要更多资金。\n\nOpenAI的生存高度依赖于微软和亚马逊等支持者以及整个AI生态系统。潜在的风险包括未经证实的收入模式、市场饱和、监管审查以及所需资本注入的巨大规模。发行更多债务是一种可能的途径，但当前的市场状况充满挑战。\n\n文章还提到了关于技术实际生产力提升的争论，并指出有人担心互联网革命并没有显著提高办公室或工厂的生产力。对数据中心和硬件日益增长的关注引发了人们对基于未来、可能不确定的AI回报的增长可持续性的质疑。"
  },
  {
    "id": "46066522",
    "title": "Mixpanel Security Breach",
    "url": "https://mixpanel.com/blog/sms-security-incident/",
    "summary": "On November 8th, 2025, Mixpanel detected and responded to a smishing campaign that resulted in unauthorized access to a limited number of customer accounts. They promptly initiated incident response, contained the breach, and secured affected user accounts with the help of external cybersecurity partners.\n\nMixpanel proactively contacted all impacted customers. If a customer did not receive communication from Mixpanel, their accounts were not affected.\n\nThe company took several steps to mitigate the damage, including:\n\n*   Securing affected accounts\n*   Revoking active sessions and sign-ins\n*   Rotating compromised credentials\n*   Blocking malicious IP addresses\n*   Registering Indicators of Compromise (IOCs) in their SIEM platform\n*   Performing global password resets for employees\n*   Engaging a third-party forensics firm\n*   Forensic review of logs\n*   Implementing additional security controls\n*   Engaging with law enforcement and cybersecurity advisors\n\nMixpanel encourages customers who received communication to review it for specific instructions. Others were not impacted. Any questions can be directed to support@mixpanel.com. The company, under CEO Jen Taylor, emphasizes its commitment to security and transparent communication.\n",
    "chinese_title": "Mixpanel 安全漏洞",
    "chinese_summary": "2025年11月8日，Mixpanel检测并响应了一起短信钓鱼攻击，该攻击导致少量客户账户遭到未授权访问。他们立即启动事件响应，控制了漏洞，并在外部网络安全合作伙伴的帮助下保护了受影响的用户账户。\n\nMixpanel主动联系了所有受影响的客户。如果客户没有收到来自Mixpanel的通知，则其账户未受影响。\n\n该公司采取了多项措施来减轻损失，包括：\n\n*   保护受影响的账户\n*   撤销活动会话和登录\n*   轮换被盗凭据\n*   阻止恶意IP地址\n*   在其SIEM平台中注册入侵指标（IOC）\n*   为员工执行全局密码重置\n*   聘请第三方取证公司\n*   对日志进行取证审查\n*   实施额外的安全控制\n*   与执法部门和网络安全顾问合作\n\nMixpanel建议收到通知的客户查看通知中的具体说明。 其他客户未受影响。如有任何问题，请发送至support@mixpanel.com。 在首席执行官Jen Taylor的领导下，该公司强调其对安全和透明沟通的承诺。"
  },
  {
    "id": "46066695",
    "title": "Ray Marching Soft Shadows in 2D (2020)",
    "url": "https://www.rykap.com/2020/09/23/distance-fields/",
    "summary": "This article explains how to implement ray marching soft shadows in 2D using distance fields. The author's demo generates a distance field from text and uses ray marching to determine shadow intensity for each pixel.\n\nRay marching involves casting a ray from a pixel to the light source. The distance field provides the distance to the nearest shape, allowing the ray to advance safely without skipping objects.  The core algorithm checks if the ray intersects any shapes before reaching the light source.\n\nTo achieve soft shadows, the author uses three rules:\n\n1.  **Proximity to Intersection:** The closer a ray gets to intersecting a shape, the more shadowed the pixel should be.  This is approximated by the smallest distance to a shape during ray marching (sceneDist).\n2.  **Distance from Intersection:** The further a pixel is from the point where its ray almost intersects a shape, the more the shadow should spread. This is approximated by the ray's progress (rayProgress).\n3.  **Light Attenuation:** Light weakens with distance from the light source.\n\nThese rules are implemented by calculating `sceneDist / rayProgress` during each step, keeping the minimum value, and then multiplying it by a distance factor based on the light's falloff.\n\nThe article also mentions common artifacts such as banding, which occur due to inaccurate distance approximations when taking too few ray marching steps. The author introduces random jitter to mitigate banding, but acknowledges it's a trade-off. The author concludes by inviting further discussion and hints at future articles covering additional tweaks to the demo.\n",
    "chinese_title": "2D光线步进软阴影 (2020)",
    "chinese_summary": "本文阐述了如何使用距离场在2D中实现光线步进软阴影。作者的演示程序从文本生成距离场，并使用光线步进来确定每个像素的阴影强度。\n\n光线步进涉及从像素向光源投射光线。距离场提供到最近形状的距离，允许光线安全地前进，而不会跳过对象。核心算法检查光线在到达光源之前是否与任何形状相交。\n\n为了实现软阴影，作者使用了三个规则：\n\n1.  **接近交点：** 光线越接近与形状相交，像素应该越阴暗。这可以通过光线步进期间到形状的最小距离（sceneDist）来近似。\n2.  **远离交点：** 像素距离光线几乎与形状相交的点越远，阴影应该扩散得越多。这可以通过光线的进程（rayProgress）来近似。\n3.  **光衰减：** 光线随着与光源距离的增加而减弱。\n\n这些规则通过在每个步骤中计算 `sceneDist / rayProgress` 来实现，保持最小值，然后将其乘以基于光线衰减的距离因子。\n\n本文还提到了常见的伪影，例如条带，这是由于采取的光线步进步骤太少时，距离近似不准确而造成的。作者引入随机抖动来减轻条带，但承认这是一种权衡。作者最后邀请进一步讨论，并暗示未来的文章将涵盖对演示程序的额外调整。"
  },
  {
    "id": "46064757",
    "title": "Penpot: The Open-Source Figma",
    "url": "https://github.com/penpot/penpot",
    "summary": "Penpot is an open-source design and code collaboration tool positioned as an alternative to Figma. It allows designers to create designs, interactive prototypes, and design systems while providing developers with ready-to-use code, streamlining the design-to-development workflow. It's available on browsers or self-hosted and works with open standards like SVG, CSS, HTML, and JSON. Penpot is free to use.\n\nKey features include native design tokens for a single source of truth, CSS Grid Layout, a redesigned UI, and a new component system. It also boasts a plugin system for expanding functionality and integrating with other apps. Developers benefit from real-time collaboration or solo work options, an inspect mode providing instant access to code snippets, and integrations with development toolchains through webhooks and an API.\n\nPenpot supports building Design Systems with design tokens, components, and variants. Users can deploy Penpot on SaaS or install it themselves via Docker, Kubernetes, or Elestio.\n\nThe Penpot community is actively encouraged to participate, contribute, and improve the platform through designs, code, and ideas. A Code of Conduct ensures a positive environment. Contribution methods include creating libraries and templates, inviting teams, providing feedback, reporting bugs, becoming a translator, and contributing to the codebase. Resources like documentation, tutorials, and dev diaries are available. Penpot Fest, an event in Madrid, Spain, is planned for October 9-10, 2025.\n",
    "chinese_title": "Penpot：开源的Figma",
    "chinese_summary": "Penpot 是一款开源设计和代码协作工具，定位为 Figma 的替代品。它允许设计师创建设计、交互式原型和设计系统，同时为开发者提供可直接使用的代码，从而简化设计到开发的流程。它可以在浏览器上使用或进行自托管，并支持 SVG、CSS、HTML 和 JSON 等开放标准。Penpot 可以免费使用。\n\n主要功能包括用于单一数据源的原生设计令牌、CSS Grid Layout、重新设计的 UI 和新的组件系统。它还拥有一个插件系统，用于扩展功能并与其他应用程序集成。开发者可以受益于实时协作或单人工作选项、提供即时代码片段访问的检查模式，以及通过 Webhook 和 API 与开发工具链的集成。\n\nPenpot 支持使用设计令牌、组件和变体构建设计系统。用户可以通过 SaaS 部署 Penpot，也可以通过 Docker、Kubernetes 或 Elestio 自行安装。\n\nPenpot 社区积极鼓励通过设计、代码和想法参与、贡献和改进该平台。《行为准则》确保了积极的环境。贡献方式包括创建库和模板、邀请团队、提供反馈、报告错误、成为翻译者以及为代码库做出贡献。提供文档、教程和开发日记等资源。Penpot Fest 计划于 2025 年 10 月 9 日至 10 日在西班牙马德里举行。"
  },
  {
    "id": "46054661",
    "title": "Comparing xeus-Haskell and ihaskell kernels",
    "url": "https://www.datahaskell.org/blog/2025/11/25/a-tale-of-two-kernels.html",
    "summary": "This article compares two Haskell kernels for Jupyter notebooks: IHaskell and xeus-haskell. IHaskell takes a monolithic approach, implementing the Jupyter protocol and using the GHC API directly. This allows it to leverage the full GHC ecosystem but ties it closely to specific GHC versions, leading to potential installation and package management complexities.\n\nXeus-haskell adopts a middleware approach, delegating protocol handling to the Xeus C++ library and using MicroHs, a smaller Haskell interpreter. This results in a smaller runtime footprint, faster startup, and easier deployment, especially in environments like WebAssembly. However, it supports a limited subset of Haskell features and libraries compatible with MicroHs.\n\nKey differences lie in their ecosystem, ease of use, performance, and deployment scenarios. IHaskell excels in server-side data science due to its access to the complete GHC ecosystem and native performance. Xeus-haskell shines in client-side execution, interactive documentation, and quick prototyping, offering a simpler installation experience. IHaskell’s GHC dependency makes it more suitable for heavy workloads, while xeus-haskell is ideal for lightweight embedding of Haskell functionalities. The choice depends on the specific use case: IHaskell for established server setups and full GHC support, xeus-haskell for portability and simplicity, particularly with JupyterLite.\n",
    "chinese_title": "比较 xeus-Haskell 和 ihaskell 内核",
    "chinese_summary": "本文比较了两个用于Jupyter Notebook的Haskell内核：IHaskell和xeus-haskell。IHaskell采用单体式方法，直接实现Jupyter协议并使用GHC API。这使其能够利用完整的GHC生态系统，但同时也将其与特定的GHC版本紧密联系在一起，导致潜在的安装和包管理复杂性。\n\nXeus-haskell采用中间件方法，将协议处理委托给Xeus C++库，并使用MicroHs，一个更小的Haskell解释器。这带来了更小的运行时占用空间、更快的启动速度和更简便的部署，尤其是在WebAssembly等环境中。然而，它仅支持与MicroHs兼容的Haskell特性和库的有限子集。\n\n两者之间的主要区别在于它们的生态系统、易用性、性能和部署场景。IHaskell凭借其对完整GHC生态系统的访问和原生性能，在服务器端数据科学方面表现出色。Xeus-haskell在客户端执行、交互式文档和快速原型设计方面表现出色，并提供更简单的安装体验。IHaskell的GHC依赖性使其更适合繁重的工作负载，而xeus-haskell非常适合Haskell功能的轻量级嵌入。选择取决于具体的用例：IHaskell适用于已建立的服务器设置和完整的GHC支持，xeus-haskell适用于可移植性和简单性，尤其是在JupyterLite中。"
  },
  {
    "id": "46057488",
    "title": "Voyager 1 is about to reach one light-day from Earth",
    "url": "https://scienceclock.com/voyager-1-is-about-to-reach-one-light-day-from-earth/",
    "summary": "生成摘要时出错",
    "chinese_title": "Voyager 1 is about to reach one light-day from Earth",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45999475",
    "title": "The three thousand year journey of colchicine",
    "url": "https://www.worksinprogress.news/p/the-three-thousand-year-journey-of",
    "summary": "生成摘要时出错",
    "chinese_title": "The three thousand year journey of colchicine",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46072786",
    "title": "DeepSeekMath-V2: Towards Self-Verifiable Mathematical Reasoning [pdf]",
    "url": "https://github.com/deepseek-ai/DeepSeek-Math-V2/blob/main/DeepSeekMath_V2.pdf",
    "summary": "生成摘要时出错",
    "chinese_title": "DeepSeekMath-V2: Towards Self-Verifiable Mathematical Reasoning [pdf]",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46079140",
    "title": "Lap around Australia in a small electric car",
    "url": "https://thedriven.io/2025/11/27/fun-and-easy-our-lap-around-australia-with-a-family-of-four-in-a-small-electric-dolphin/",
    "summary": "生成摘要时出错",
    "chinese_title": "Lap around Australia in a small electric car",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46076992",
    "title": "Great Math Software: List of fun visual math programs",
    "url": "http://xahlee.info/math_software/mathPrograms.html",
    "summary": "生成摘要时出错",
    "chinese_title": "Great Math Software: List of fun visual math programs",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46077445",
    "title": "Africa's forests have switched from absorbing to emitting carbon",
    "url": "https://phys.org/news/2025-11-africa-forests-absorbing-emitting-carbon.html",
    "summary": "生成摘要时出错",
    "chinese_title": "Africa's forests have switched from absorbing to emitting carbon",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46022203",
    "title": "Experimenting with Robin Hood Hashing",
    "url": "https://twdev.blog/2025/11/robin_hood/",
    "summary": "生成摘要时出错",
    "chinese_title": "Experimenting with Robin Hood Hashing",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46027065",
    "title": "Giving the Jakks Atari Paddle a Spin",
    "url": "https://nicole.express/2025/paddle-me-atari.html",
    "summary": "生成摘要时出错",
    "chinese_title": "Giving the Jakks Atari Paddle a Spin",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46059620",
    "title": "Optery (YC W22) Hiring CISO, Release Manager, Tech Lead (Node), Full Stack Eng",
    "url": "https://www.optery.com/careers/",
    "summary": "生成摘要时出错",
    "chinese_title": "Optery (YC W22) Hiring CISO, Release Manager, Tech Lead (Node), Full Stack Eng",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46031552",
    "title": "Quake Engine Indicators",
    "url": "https://fabiensanglard.net/quake_indicators/index.html",
    "summary": "生成摘要时出错",
    "chinese_title": "Quake Engine Indicators",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46026343",
    "title": "Designing a Mechanical Calculator",
    "url": "https://signoregalilei.com/2025/11/22/designing-a-mechanical-calculator/",
    "summary": "生成摘要时出错",
    "chinese_title": "Designing a Mechanical Calculator",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46066280",
    "title": "Linux Kernel Explorer",
    "url": "https://reverser.dev/linux-kernel-explorer",
    "summary": "生成摘要时出错",
    "chinese_title": "Linux Kernel Explorer",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46018159",
    "title": "Physicists drive antihydrogen breakthrough at CERN",
    "url": "https://phys.org/news/2025-11-physicists-antihydrogen-breakthrough-cern-technique.html",
    "summary": "生成摘要时出错",
    "chinese_title": "Physicists drive antihydrogen breakthrough at CERN",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46058471",
    "title": "Feedback doesn't scale",
    "url": "https://another.rodeo/feedback/",
    "summary": "生成摘要时出错",
    "chinese_title": "Feedback doesn't scale",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46039387",
    "title": "Willis Whitfield: Creator of clean room technology still in use today (2024)",
    "url": "https://www.sandia.gov/labnews/2024/04/04/willis-whitfield-a-simple-man-with-a-simple-solution-that-changed-the-world/",
    "summary": "生成摘要时出错",
    "chinese_title": "Willis Whitfield: Creator of clean room technology still in use today (2024)",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46039106",
    "title": "Interactive λ-Reduction",
    "url": "https://deltanets.org/",
    "summary": "生成摘要时出错",
    "chinese_title": "Interactive λ-Reduction",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46025911",
    "title": "G0-G3 corners, visualised: learn what \"Apple corners\" are",
    "url": "https://www.printables.com/model/1490911-g0-g3-corners-visualised-learn-what-apple-corners",
    "summary": "生成摘要时出错",
    "chinese_title": "G0-G3 corners, visualised: learn what \"Apple corners\" are",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46078844",
    "title": "A $1M Dollar Apple Macintosh PowerBook 170",
    "url": "https://www.ebay.ca/itm/326104837538",
    "summary": "生成摘要时出错",
    "chinese_title": "A $1M Dollar Apple Macintosh PowerBook 170",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46061871",
    "title": "Inspired by Spider-Man, scientists recreate web-slinging technology",
    "url": "https://scienceclock.com/inspired-by-spider-man-scientists-recreate-web-slinging-technology/",
    "summary": "生成摘要时出错",
    "chinese_title": "Inspired by Spider-Man, scientists recreate web-slinging technology",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46068777",
    "title": "The current state of the theory that GPL propagates to AI models",
    "url": "https://shujisado.org/2025/11/27/gpl-propagates-to-ai-models-trained-on-gpl-code/",
    "summary": "生成摘要时出错",
    "chinese_title": "The current state of the theory that GPL propagates to AI models",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46068777",
    "title": "The current state of the theory that GPL propagates to AI models",
    "url": "https://shujisado.org/2025/11/27/gpl-propagates-to-ai-models-trained-on-gpl-code/",
    "summary": "生成摘要时出错",
    "chinese_title": "The current state of the theory that GPL propagates to AI models",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46057266",
    "title": "Memories of .us",
    "url": "https://computer.rip/2025-11-11-dot-us.html",
    "summary": "生成摘要时出错",
    "chinese_title": "Memories of .us",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46077650",
    "title": "Cats became our companions way later than you think",
    "url": "https://www.bbc.co.uk/news/articles/cq8dvdp9gn7o",
    "summary": "生成摘要时出错",
    "chinese_title": "Cats became our companions way later than you think",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46079150",
    "title": "Humans Have Tilted the Earth 31.5 Inches Since 1993, Study Finds (2023)",
    "url": "https://scienceclock.com/humans-have-titled-the-earth-31-5-inches-since-1993-study-finds/",
    "summary": "生成摘要时出错",
    "chinese_title": "Humans Have Tilted the Earth 31.5 Inches Since 1993, Study Finds (2023)",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46051449",
    "title": "Show HN: KiDoom – Running DOOM on PCB Traces",
    "url": "https://www.mikeayles.com/#kidoom",
    "summary": "生成摘要时出错",
    "chinese_title": "Show HN: KiDoom – Running DOOM on PCB Traces",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46073033",
    "title": "Underrated reasons to be thankful V",
    "url": "https://dynomight.net/thanks-5/",
    "summary": "生成摘要时出错",
    "chinese_title": "Underrated reasons to be thankful V",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46074183",
    "title": "ML-KEM Mythbusting",
    "url": "https://keymaterial.net/2025/11/27/ml-kem-mythbusting/",
    "summary": "生成摘要时出错",
    "chinese_title": "ML-KEM Mythbusting",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46057000",
    "title": "Indie game developers have a new sales pitch: being 'AI free'",
    "url": "https://www.theverge.com/entertainment/827650/indie-developers-gen-ai-nexon-arc-raiders",
    "summary": "生成摘要时出错",
    "chinese_title": "Indie game developers have a new sales pitch: being 'AI free'",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46064680",
    "title": "Functional Data Structures and Algorithms: a Proof Assistant Approach",
    "url": "https://fdsa-book.net/",
    "summary": "生成摘要时出错",
    "chinese_title": "Functional Data Structures and Algorithms: a Proof Assistant Approach",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46070883",
    "title": "10 years of writing a blog nobody reads",
    "url": "https://flowtwo.io/post/on-10-years-of-writing-a-blog-nobody-reads",
    "summary": "生成摘要时出错",
    "chinese_title": "10 years of writing a blog nobody reads",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46033472",
    "title": "Technical Deflation",
    "url": "https://benanderson.work/blog/technical-deflation/",
    "summary": "生成摘要时出错",
    "chinese_title": "Technical Deflation",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46078964",
    "title": "Janet Yellen Says the US Is Undermining Its Economic Success",
    "url": "https://www.bloomberg.com/news/articles/2025-11-14/janet-yellen-warns-about-economic-risk-of-trump-s-tariffs-funding-cuts",
    "summary": "生成摘要时出错",
    "chinese_title": "Janet Yellen Says the US Is Undermining Its Economic Success",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46069556",
    "title": "Show HN: Runprompt – run .prompt files from the command line",
    "url": "https://github.com/chr15m/runprompt",
    "summary": "生成摘要时出错",
    "chinese_title": "Show HN: Runprompt – run .prompt files from the command line",
    "chinese_summary": "生成摘要时出错"
  }
]