[
  {
    "id": "45721801",
    "title": "Pyrex catalog from from 1938 with hand-drawn lab glassware [pdf]",
    "url": "https://exhibitdb.cmog.org/opacimages/Images/Pyrex/Rakow_1000132877.pdf",
    "summary": "This document appears to be a corrupted PDF file, supposedly of a 1938 Pyrex catalog featuring hand-drawn lab glassware. Due to the file corruption, it is impossible to analyze the content and summarize its key information accurately. The text consists of raw PDF commands and image data, making it unreadable and inaccessible without proper PDF rendering. The jumbled text includes references to image headers, color profiles, and PDF structure elements, but without rendering, these are simply strings of characters. Therefore, a summary of its content is not possible.\n",
    "chinese_title": "1938年手绘实验室玻璃器皿Pyrex目录 [pdf]",
    "chinese_summary": "该文档似乎是一个损坏的PDF文件，据称是1938年派热克斯（Pyrex）目录，其中包含手绘的实验室玻璃器皿。由于文件损坏，无法分析其内容并准确总结其关键信息。该文本由原始PDF命令和图像数据组成，未经适当的PDF渲染，使其无法读取和访问。乱码文本包括对图像标题、颜色配置文件和PDF结构元素的引用，但如果没有渲染，这些只是字符串。因此，无法对其内容进行总结。"
  },
  {
    "id": "45722639",
    "title": "Claude for Excel",
    "url": "https://www.claude.com/claude-for-excel",
    "summary": "This article, titled \"Claude for Excel,\" explores the potential of integrating Claude, presumably an AI model, with Microsoft Excel. The core question it addresses is: \"How can Claude help?\" This implies Claude can be used to enhance Excel's functionality or to streamline workflows related to spreadsheet data.\n\nA key application of Claude in this context appears to be revenue forecasting. The article specifically asks: \"What assumptions drive the revenue forecast in Q3?\" This highlights Claude's potential to analyze and explain the underlying logic and assumptions behind complex calculations within Excel, such as revenue predictions. It suggests Claude could provide transparency and insight into forecasting models, allowing users to understand the drivers of projected revenues for the third quarter of the year.\n\nIn summary, the article suggests that Claude can be a powerful tool for Excel users, particularly in understanding and interpreting complex data analysis. Its main application appears to be in providing insights into forecasting models, specifically elucidating the assumptions that drive revenue predictions. This integration promises to make Excel data more transparent and easier to understand.\n",
    "chinese_title": "Claude 用于 Excel",
    "chinese_summary": "本文题为《Claude for Excel》，探讨了将Claude（推测为一种人工智能模型）与Microsoft Excel集成的潜力。其核心问题是：“Claude能提供什么帮助？” 这意味着Claude可用于增强Excel的功能或简化与电子表格数据相关的工作流程。\n\nClaude在此背景下的一个关键应用似乎是收入预测。本文特别提出了问题：“第三季度的收入预测基于哪些假设？” 这突显了Claude分析和解释Excel中复杂计算（如收入预测）背后的潜在逻辑和假设的能力。这表明Claude可以提供预测模型的透明度和洞察力，使用户能够理解今年第三季度预计收入的驱动因素。\n\n总而言之，本文表明Claude可能是Excel用户的强大工具，尤其是在理解和解释复杂的数据分析方面。其主要应用似乎是在提供对预测模型的洞察力，特别是阐明推动收入预测的假设。这种集成有望使Excel数据更加透明且易于理解。"
  },
  {
    "id": "45722069",
    "title": "It's insulting to read AI-generated blog posts",
    "url": "https://blog.pabloecortez.com/its-insulting-to-read-your-ai-generated-blog-post/",
    "summary": "This blog post passionately argues against the use of AI for writing blog content, asserting that it's insulting to the reader and detrimental to the writer's personal growth. The author believes reading AI-generated content feels like being presented with something carelessly thrown together, devoid of the personality, experience, and nuances that come from human authorship.\n\nThe core argument revolves around the importance of embracing imperfection and learning from mistakes. The author encourages writers to avoid using AI even for tasks like grammar correction or translation, advocating for the valuable learning experience gained from the process of creation, even if it involves feeling embarrassed by errors.\n\nFurthermore, the post highlights the missed opportunities for human connection when AI mediates communication. The author emphasizes that readers are often willing to help and engage with writers, but this becomes impossible when interaction is filtered through a \"sterile robo-liaison.\" The author encourages writers to overcome their fear of asking for help and to cultivate mutually beneficial relationships.\n\nIn conclusion, the author urges writers to embrace their humanity, express their own thoughts, and learn from real-world experiences, instead of relying on AI to produce impersonal and ultimately less valuable content. The most meaningful thoughts, according to the author, are those rooted in personal experience and emotion.\n",
    "chinese_title": "阅读人工智能生成的博客文章是一种侮辱。",
    "chinese_summary": "这篇博文充满激情地反对使用人工智能撰写博客内容，认为这既是对读者的侮辱，也有损于写作者的个人成长。作者认为阅读人工智能生成的内容就像是看到随意拼凑的东西，缺乏人性的笔触、经验和细微之处。\n\n核心论点围绕着拥抱不完美和从错误中学习的重要性展开。作者鼓励写作者避免使用人工智能，即使是进行语法纠正或翻译等任务，也应避免，因为从创作过程中获得的宝贵学习经验，即使是因犯错而感到尴尬，也是值得的。\n\n此外，这篇文章还强调了当人工智能介入沟通时，人类会错失建立联系的机会。作者强调，读者通常愿意帮助和互动，但当互动被“无菌的机器人联络员”过滤时，这便变得不可能。作者鼓励写作者克服寻求帮助的恐惧，培养互惠互利的关系。\n\n总而言之，作者敦促写作者拥抱人性，表达自己的想法，并从现实世界的经验中学习，而不是依赖人工智能来生产没有人情味且最终价值较低的内容。作者认为，最有意义的想法是那些植根于个人经验和情感的想法。"
  },
  {
    "id": "45723159",
    "title": "JetKVM Is Now Available for Retail Purchase",
    "url": "https://jetkvm.com/products",
    "summary": "JetKVM, a next-generation open-source KVM over IP solution, is now available for retail purchase. JetKVM provides remote power and reset control of desktop computers. The announcement highlights the core JetKVM product and several key add-ons that expand its functionality. These add-ons include:\n\n*   **DC Power Control Extension:** Allows remote power management of DC-powered devices.\n*   **Serial Console Extension:** Enables remote access to device serial ports through the JetKVM.\n\nThe announcement promotes the JetKVM ecosystem, emphasizing its versatility through these modular extensions for various remote management needs.\n",
    "chinese_title": "JetKVM 现已上市零售",
    "chinese_summary": "JetKVM，下一代开源KVM over IP解决方案，现已上市零售。 JetKVM提供桌面电脑的远程电源和重启控制。 该公告重点介绍了JetKVM核心产品和扩展其功能的几个关键附加组件。 这些附加组件包括：\n\n*   **直流电源控制扩展：** 允许对直流供电设备进行远程电源管理。\n*   **串口控制台扩展：** 通过JetKVM实现对设备串口的远程访问。\n\n该公告推广了JetKVM生态系统，并通过这些用于各种远程管理需求的模块化扩展，强调了其多功能性。"
  },
  {
    "id": "45719004",
    "title": "Rust cross-platform GPUI components",
    "url": "https://github.com/longbridge/gpui-component",
    "summary": "GPUI Component is a Rust library providing UI components for building cross-platform desktop applications, inspired by macOS, Windows controls, and shadcn/ui design. It boasts over 60 components, is easy to use with stateless `RenderOnce` components, and is highly customizable with built-in theming and variable-based configurations. It offers flexible layout options like dock layouts and freeform tiles, as well as high-performance virtualized table and list components.\n\nKey features include native support for Markdown and basic HTML rendering, built-in charting, and a performant code editor with LSP support and syntax highlighting using Tree Sitter. The library also supports WebView (behind a feature flag) and custom icons.\n\nCompared to alternatives like Iced, egui, and QT 6, GPUI Component offers a modern UI style, robust CJK support, built-in charting, advanced table features, dock layouts, and superior Markdown/HTML rendering. While it lacks dedicated documentation currently, it provides a more comprehensive feature set and flexible theming compared to Iced and egui. The project is under active development, requiring Git dependencies for now, and encourages contributions. Longbridge Pro serves as a flagship application built using GPUI Component.\n",
    "chinese_title": "Rust 跨平台 GPUI 组件",
    "chinese_summary": "GPUI Component 是一个 Rust 库，提供 UI 组件以构建跨平台桌面应用程序，其设计灵感来源于 macOS、Windows 控件和 shadcn/ui。 它拥有超过 60 个组件，易于使用无状态的 `RenderOnce` 组件，并且具有内置主题和基于变量的配置，高度可定制。 它提供灵活的布局选项，如 Dock 布局和自由形式平铺，以及高性能虚拟化表格和列表组件。\n\n主要功能包括原生支持 Markdown 和基本 HTML 渲染，内置图表，以及一个高性能代码编辑器，该编辑器使用 Tree Sitter 提供 LSP 支持和语法高亮显示。 该库还支持 WebView（通过 feature flag 启用）和自定义图标。\n\n与 Iced、egui 和 QT 6 等替代方案相比，GPUI Component 提供现代化的 UI 风格、强大的 CJK 支持、内置图表、高级表格功能、Dock 布局以及卓越的 Markdown/HTML 渲染。 虽然目前缺乏专门的文档，但与 Iced 和 egui 相比，它提供了更全面的功能集和灵活的主题。 该项目正在积极开发中，目前需要 Git 依赖项，并鼓励贡献。 Longbridge Pro 是使用 GPUI Component 构建的旗舰应用程序。"
  },
  {
    "id": "45719140",
    "title": "Don't forget these tags to make HTML work like you expect",
    "url": "https://blog.jim-nielsen.com/2025/dont-forget-these-html-tags/",
    "summary": "This article highlights essential HTML snippets to include in every HTML file for consistent browser rendering and functionality, especially when directly opening files from disk.\n\nFirst, `<!doctype html>` ensures the browser renders the page in standards mode, preventing quirks mode and layout inconsistencies. While case-insensitive, using it maintains expected behavior.\n\nSecond, `<html lang=\"en\">` (or appropriate language code) declares the document's language. This aids browsers, search engines, and assistive technologies in accurate pronunciation, indexing, translation, and locale-specific tool application.\n\nThird, `<meta charset=\"utf-8\">` specifies the character encoding, crucial for displaying characters like accented letters, smart quotes, symbols, and emojis correctly. Without it, these characters might render improperly.\n\nFinally, `<meta name=\"viewport\" content=\"width=device-width,initial-scale=1.0\">` ensures proper scaling and responsiveness on different devices, preventing the content from appearing too small on mobile screens.\n\nThe author emphasizes that including these tags is crucial for making HTML work as expected across various browsers and devices, promoting consistency and accessibility. While not explicitly mentioned, the author jokes about missing the typical JavaScript inclusion snippets, acknowledging the focus on fundamental HTML structure.\n",
    "chinese_title": "不要忘记这些标签，以确保HTML按预期工作。",
    "chinese_summary": "本文重点介绍了在每个 HTML 文件中都应包含的基本 HTML 代码片段，以确保浏览器渲染和功能的一致性，尤其是在直接从磁盘打开文件时。\n\n首先，`<!doctype html>` 确保浏览器以标准模式渲染页面，防止怪异模式和布局不一致。虽然不区分大小写，但使用它可以保持预期的行为。\n\n其次，`<html lang=\"en\">`（或适当的语言代码）声明文档的语言。这有助于浏览器、搜索引擎和辅助技术进行准确的发音、索引、翻译和特定于区域设置的工具应用。\n\n第三，`<meta charset=\"utf-8\">` 指定字符编码，这对于正确显示诸如带重音的字母、弯引号、符号和表情符号之类的字符至关重要。没有它，这些字符可能会渲染不正确。\n\n最后，`<meta name=\"viewport\" content=\"width=device-width,initial-scale=1.0\">` 确保在不同设备上适当的缩放和响应能力，防止内容在移动屏幕上显得太小。\n\n作者强调，包含这些标签对于使 HTML 在各种浏览器和设备上按预期工作至关重要，从而促进一致性和可访问性。虽然没有明确提及，但作者开玩笑地说缺少典型的 JavaScript 包含代码片段，承认了对基本 HTML 结构的关注。"
  },
  {
    "id": "45723426",
    "title": "Sieve (YC X25) Is Hiring Engineers to build video datasets for frontier AI",
    "url": "https://www.sievedata.com/",
    "summary": "Sieve (YC X25) is hiring engineers to build video datasets for frontier AI, offering high-quality video data solutions for training AI models. They specialize in datasets for video generation, human avatars, and world models, encompassing areas like cinematic video, talking head humans, fully body avatars, animated characters, real-world egocentric views, and rendered egocentric views. Their library contains 500K hours of diverse video clips, with the ability to create custom packaged datasets.\n\nSieve emphasizes high quality achieved through video understanding models and human QA, unparalleled scale with thousands of petabytes of data, extreme diversity through various sources (public, private, synthetic), and next-gen complexity with paired, time-synced, and conversational data.\n\nTheir services include exploring pre-packaged datasets, requesting samples, purchasing access based on volume, and receiving data via storage bucket access. They emphasize a scalable API, compliance with specific filtering and licensing needs, dedicated partnership with research teams, and secure end-to-end encryption. Sieve boasts that their data leads to better video models and works with leading AI labs, Fortune 100 companies, and generative AI startups.\n",
    "chinese_title": "Sieve (YC X25) 正在招聘工程师，构建用于前沿人工智能的视频数据集",
    "chinese_summary": "Sieve (YC X25) 招聘工程师，构建前沿AI视频数据集，为训练AI模型提供高质量视频数据解决方案。他们专注于视频生成、人类头像和世界模型的相关数据集，涵盖电影级视频、会说话的人像、全身化身、动画角色、真实世界的第一人称视角以及渲染的第一人称视角等领域。他们的库包含50万小时的各种视频片段，并能够创建定制打包的数据集。\n\nSieve 强调通过视频理解模型和人工质检实现高质量、通过数千PB的数据实现无与伦比的规模、通过各种来源（公共、私有、合成）实现极高的多样性，以及通过配对、时间同步和会话数据实现下一代复杂性。\n\n他们的服务包括探索预先打包的数据集、请求样本、根据数量购买访问权限，以及通过存储桶访问接收数据。他们强调可扩展的 API、符合特定过滤和许可需求、与研究团队的专门合作以及安全的端到端加密。Sieve 声称其数据能够带来更好的视频模型，并与领先的 AI 实验室、财富 100 强公司和生成式 AI 初创公司合作。"
  },
  {
    "id": "45718231",
    "title": "Recall for Linux",
    "url": "https://github.com/rolflobker/recall-for-linux",
    "summary": "This article satirically presents \"Recall for Linux,\" a fictional tool designed to mimic the controversial Windows Recall feature, but for Linux users. The humor stems from exaggerating the privacy concerns associated with Recall by explicitly stating the tool's purpose is to \"spy\" on users and store their sensitive data.\n\nThe advertised \"features\" include constant screen capture, OCR for image-to-text conversion, and indexing of chat and email content. The article highlights the potential for this data to be used to resurface forgotten or confidential information, even embarrassing details.\n\nThe installation instructions further contribute to the satire, urging users to blindly execute a random command from the internet, falsely claiming it's virus-free despite a suspicious VirusTotal score.\n\nThe roadmap lists outlandish features like delayed encryption (2028), monetization for the developers, webcam captures, always-on audio recording, and integration with LLMs for training using user data. The increasingly absurd mentions of \"AI\" and the promise of \"Windows Foresight\" solidify the article's satirical nature and commentary on the potential overreach of data collection and AI technologies. The overall tone is sarcastic and critical, mocking the perceived privacy invasion and lack of user control associated with data-driven features.\n",
    "chinese_title": "Linux 召回",
    "chinese_summary": "本文讽刺性地介绍了“Linux版回忆”(Recall for Linux)，这是一款虚构的工具，旨在模仿备受争议的Windows回忆功能，但面向Linux用户。 其幽默之处在于夸大了与回忆功能相关的隐私问题，明确声明该工具的目的是“监视”用户并存储他们的敏感数据。\n\n宣传的“功能”包括持续屏幕截图、用于图像转文本转换的OCR以及聊天和电子邮件内容的索引。 本文强调了使用这些数据重新浮出被遗忘或机密信息的可能性，甚至是令人尴尬的细节。\n\n安装说明进一步增强了讽刺效果，敦促用户盲目地从互联网上执行随机命令，并谎称它是无病毒的，尽管 VirusTotal 评分可疑。\n\n路线图列出了异想天开的功能，例如延迟加密（2028年）、开发人员的货币化、网络摄像头捕获、始终开启的录音以及与LLM的集成以使用用户数据进行训练。 越来越荒谬地提及“AI”以及对“Windows先见之明”的承诺巩固了本文的讽刺性质，并评论了数据收集和AI技术的潜在过度扩张。 总体基调是讽刺和批判性的，嘲笑与数据驱动功能相关的感知到的隐私侵犯和缺乏用户控制。"
  },
  {
    "id": "45723359",
    "title": "Why Busy Beaver Hunters Fear the Antihydra",
    "url": "https://benbrubaker.com/why-busy-beaver-hunters-fear-the-antihydra/",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "为何忙碌海狸猎手惧怕反九头蛇",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "45721682",
    "title": "Microsoft in court for allegedly misleading Australians over 365 subscriptions",
    "url": "https://www.accc.gov.au/media-release/microsoft-in-court-for-allegedly-misleading-millions-of-australians-over-microsoft-365-subscriptions",
    "summary": "The Australian Competition and Consumer Commission (ACCC) is suing Microsoft Australia and its parent company for allegedly misleading approximately 2.7 million Australian subscribers of Microsoft 365 Personal and Family plans. The ACCC alleges that Microsoft falsely informed subscribers that they had to accept the integration of the Copilot AI assistant and pay increased prices, or cancel their subscriptions, after October 31, 2024.\n\nThe ACCC claims Microsoft concealed the existence of \"Classic\" plans, which allowed subscribers to retain their existing features without Copilot at the previous lower price. This option was only revealed during the cancellation process. ACCC Chair Gina Cass-Gottlieb stated that Microsoft deliberately omitted reference to the Classic plans to push consumers towards more expensive Copilot-integrated plans.\n\nFollowing the Copilot integration, the annual subscription price increased by 45% for the Personal plan and 29% for the Family plan. The ACCC alleges that emails and a blog post sent to subscribers were misleading, implying that accepting the price increase was the only alternative to cancellation.\n\nThe ACCC is seeking penalties, injunctions, declarations, consumer redress, and costs. The ACCC believes consumers may have suffered economic harm due to automatic renewal at higher prices. The ACCC investigation was significantly informed by consumer reports and online forum discussions. The lawsuit only concerns Microsoft 365 Personal and Family plans, not business or enterprise subscriptions.\n",
    "chinese_title": "微软因涉嫌误导澳大利亚人购买365订阅而被起诉",
    "chinese_summary": "澳大利亚竞争与消费者委员会(ACCC)起诉微软澳大利亚及其母公司，指控其涉嫌误导约270万名澳大利亚Microsoft 365个人和家庭计划用户。ACCC声称，微软虚假告知用户，在2024年10月31日后，他们必须接受Copilot AI助手的集成并支付更高的价格，否则必须取消订阅。\n\nACCC声称微软隐瞒了“经典”计划的存在，该计划允许用户以较低的价格保留现有功能而无需Copilot。这个选项只在取消订阅过程中才被透露。ACCC主席吉娜·卡斯-戈特利布表示，微软故意省略提及经典计划，以推动消费者选择更昂贵的集成Copilot计划。\n\n在Copilot集成后，个人计划的年度订阅价格上涨了45%，家庭计划上涨了29%。ACCC声称，发送给用户的电子邮件和博客文章具有误导性，暗示接受涨价是取消订阅之外的唯一选择。\n\nACCC正在寻求处罚、禁令、声明、消费者赔偿和诉讼费用。ACCC认为，消费者可能因以更高的价格自动续订而遭受经济损失。ACCC的调查主要基于消费者报告和在线论坛讨论。该诉讼仅涉及Microsoft 365个人和家庭计划，不涉及商业或企业订阅。"
  },
  {
    "id": "45723558",
    "title": "Artificial Writing and Automated Detection [pdf]",
    "url": "https://www.nber.org/system/files/working_papers/w34223/w34223.pdf",
    "summary": "This document appears to be a corrupted PDF file, titled \"Artificial Writing and Automated Detection.\" Due to the corruption and primarily non-readable characters, a meaningful summary of the article's content is impossible. The file consists mostly of binary data and encoded text that doesn't render into coherent information. It seems to contain metadata related to the PDF structure (objects, cross-reference table), but lacks discernible content pertaining to the topic of artificial writing and its detection. Therefore, I cannot provide a summary of the article's main points or key information. It is likely a broken or incomplete document.\n",
    "chinese_title": "人工智能写作与自动检测 [pdf]",
    "chinese_summary": "该文档似乎是一个已损坏的PDF文件，标题为“人工智能写作与自动检测”。由于文件损坏，且主要包含无法识别的字符，因此无法对文章内容进行有意义的概括。该文件主要由二进制数据和编码文本组成，无法呈现为连贯的信息。其中似乎包含与PDF结构相关的元数据（对象，交叉引用表），但缺乏与人工智能写作及其检测主题相关的可辨识内容。因此，我无法提供文章要点或关键信息的摘要。这很可能是一个损坏或不完整的文件。"
  },
  {
    "id": "45722635",
    "title": "Show HN: Erdos – open-source, AI data science IDE",
    "url": "https://www.lotas.ai/erdos",
    "summary": "This \"Show HN\" post introduces Erdos, an open-source, AI-powered data science IDE. The post highlights the latest version, 0.2.0 released on October 27, 2025. Key features of this release include the ability to enable remote development via SSH and containerization, support for local model usage, and availability on Windows ARM64 architecture. In essence, Erdos is aiming to provide a comprehensive and accessible environment for data scientists, now with added flexibility and wider platform compatibility.\n",
    "chinese_title": "展示HN: Erdos – 开源AI数据科学IDE",
    "chinese_summary": "Show HN：Erdos，开源AI驱动的数据科学IDE"
  },
  {
    "id": "45722826",
    "title": "JSON Query",
    "url": "https://jsonquerylang.org/",
    "summary": "JSON Query is a small, flexible, and expandable query language designed for processing JSON data. It enables users to extract, transform, and manipulate JSON data using a chain of functions and operators.\n\nKey features include:\n\n*   **Function-based operations:** Data is processed through a series of functions like `filter`, `sort`, `pick`, `map`, `groupBy`, and others, each performing a specific transformation. Functions operate in a chain, with the output of one becoming the input for the next.\n*   **Operators:** Basic operators like `==`, `>`, `>=`, `<`, `<=`, `!=`, `and`, `or`, `in`, `not in`, `+`, `-`, `*`, `/`, `^`, `%` are supported for building conditions and performing calculations.\n*   **Pipes:** Queries can be chained together using pipes (`|`), where the output of one query becomes the input of the next.\n*   **Data Structures:** JSON Query supports standard JSON data structures: Objects (`{prop1: query1, prop2: query2, ...}`), Arrays (`[query1, query2, ... ]`), Properties (`.prop1.prop2`), and primitive Values (`string`, `number`, `boolean`, `null`). These structures are used to define complex queries and transformations.\n*   **Documentation and Resources:** The language provides documentation, a function reference, implementations, and source code, along with a playground for experimentation.\n\nJSON Query offers a powerful and versatile way to interact with JSON data, making it suitable for a variety of data processing tasks.\n",
    "chinese_title": "JSON 查询",
    "chinese_summary": "JSON查询是一种小巧、灵活且可扩展的查询语言，专为处理JSON数据而设计。它使用户能够通过一系列函数和运算符来提取、转换和操作JSON数据。\n\n主要特性包括：\n\n*   **基于函数的操作：** 数据通过一系列函数进行处理，例如 `filter`、`sort`、`pick`、`map`、`groupBy` 等，每个函数执行特定的转换。函数以链式方式操作，一个函数的输出成为下一个函数的输入。\n*   **运算符：** 支持诸如 `==`、`>`、`>=`、`<`、`<=`、`!=`、`and`、`or`、`in`、`not in`、`+`、`-`、`*`、`/`、`^`、`%` 等基本运算符，用于构建条件和执行计算。\n*   **管道：** 可以使用管道 (`|`) 将查询链接在一起，其中一个查询的输出成为下一个查询的输入。\n*   **数据结构：** JSON 查询支持标准的 JSON 数据结构：对象 (`{prop1: query1, prop2: query2, ...}`)、数组 (`[query1, query2, ... ]`)、属性 (`.prop1.prop2`) 和原始值 (`string`、`number`、`boolean`、`null`)。这些结构用于定义复杂的查询和转换。\n*   **文档和资源：** 该语言提供文档、函数参考、实现和源代码，以及用于实验的游乐场。\n\nJSON 查询提供了一种强大而通用的方式来与 JSON 数据交互，使其适用于各种数据处理任务。"
  },
  {
    "id": "45719927",
    "title": "Amazon strategised about keeping water use secret",
    "url": "https://www.source-material.org/amazon-leak-reveals-true-data-centres-water-usage-secret-plan/",
    "summary": "A leaked internal document reveals that Amazon strategized to keep the public unaware of its data centers' true water consumption due to concerns that high figures could damage its reputation. While competitors like Microsoft and Google disclose their water usage, Amazon has remained secretive. The document projects Amazon's data centers to use 7.7 billion gallons of water annually by 2030.\n\nExecutives feared accusations of a cover-up and opted to only calculate progress toward water efficiency targets based on direct water use, excluding the significantly larger \"secondary\" use from electricity generation due to \"reputational risk.\" Experts argue this approach doesn't accurately capture the true water cost of data centers.\n\nAmazon launched a \"Water Positive\" campaign, pledging to replenish more water than it uses by 2030, but the document suggests this focuses primarily on direct water use and includes offsets, some of which would have happened regardless. Critics argue this can be misleading.\n\nFurthermore, Amazon is accused of influencing industry standards to downplay its water use and avoid scrutiny. The company also decided to keep its larger \"indirect\" water footprint (scope 3), primarily from agricultural supply chains, confidential, despite it representing 90% of Amazon's total water footprint, to avoid setting a precedent for the rest of the company.\n",
    "chinese_title": "亚马逊策划隐瞒用水量",
    "chinese_summary": "一份泄露的内部文件显示，亚马逊曾制定策略，对公众隐瞒其数据中心真实的用水量，原因是担心高用水量会损害其声誉。虽然微软和谷歌等竞争对手披露了其用水量，但亚马逊一直对此保密。该文件预计到2030年，亚马逊的数据中心每年将使用77亿加仑的水。\n\n高管们担心被指控为掩盖真相，因此选择仅根据直接用水量来计算其在提高用水效率方面的进展，排除了因发电产生的更大的“间接”用水量，理由是“声誉风险”。专家认为，这种方法无法准确反映数据中心的真实用水成本。\n\n亚马逊发起了一项“水资源正效益”运动，承诺到2030年补充的水资源超过其用水量，但该文件表明，这项运动主要关注直接用水，并包含一些即使没有这项运动也会发生的抵消措施。批评人士认为，这可能具有误导性。\n\n此外，亚马逊还被指控影响行业标准，以淡化其用水量并避免审查。该公司还决定对其更大的“间接”用水足迹（范围3）保密，该足迹主要来自农业供应链，尽管它占亚马逊总用水足迹的90%，目的是避免为公司其他部门树立先例。"
  },
  {
    "id": "45680583",
    "title": "Corrosion",
    "url": "https://fly.io/blog/corrosion/",
    "summary": "Fly.io's state synchronization system, Corrosion, is a novel service discovery system built to address the challenges of globally distributing routing information for their platform. Unlike traditional orchestration systems relying on a central database, Fly.io distributes the authoritative source of information to individual servers. This enables scaling across regions without the bottleneck of a centralized database, but requires a method for quickly sharing state information.\n\nCorrosion leverages a gossip protocol (based on SWIM and QUIC) to propagate a SQLite database across their global network, mimicking how routing protocols like OSPF work. This design avoids distributed consensus and central servers, relying on workers owning their own state and minimizing conflicts. It utilizes cr-sqlite, a CRDT SQLite extension, to ensure eventual consistency across all nodes.\n\nWhile performant, Corrosion hasn't been without its challenges, including efficiently gossiping a deadlock bug, expensive DDL changes causing cluster meltdowns, and unexpected interactions with other systems like Consul leading to saturation. To mitigate these issues, Fly.io has implemented watchdogs for their Tokio programs, extensively tested Corrosion using Antithesis, simplified database rebuilding from workers, and eliminated partial updates. Crucially, they are moving away from a single global state domain towards a regionalized architecture with local clusters feeding into a global cluster, reducing the blast radius of state bugs. Corrosion offers an alternative approach to distributed state management, particularly for systems that benefit from a link-state routing protocol model.\n",
    "chinese_title": "腐蚀",
    "chinese_summary": "Fly.io 的状态同步系统 Corrosion 是一种新型服务发现系统，旨在解决为其平台在全球范围内分发路由信息所面临的挑战。与依赖中央数据库的传统编排系统不同，Fly.io 将权威信息源分发到各个服务器。这使得跨区域扩展成为可能，而无需中央数据库的瓶颈，但也需要一种快速共享状态信息的方法。\n\nCorrosion 利用一种八卦协议（基于 SWIM 和 QUIC）在其全球网络中传播 SQLite 数据库，模仿 OSPF 等路由协议的工作方式。这种设计避免了分布式共识和中央服务器，依赖于工作节点拥有自己的状态并最大限度地减少冲突。它使用 cr-sqlite（一种 CRDT SQLite 扩展）来确保所有节点最终一致。\n\n虽然性能良好，但 Corrosion 也面临着一些挑战，包括高效传播死锁错误、导致集群崩溃的昂贵 DDL 变更，以及与其他系统（如 Consul）的意外交互导致饱和。为了缓解这些问题，Fly.io 为其 Tokio 程序实施了看门狗，使用 Antithesis 对 Corrosion 进行了广泛的测试，简化了从工作节点重建数据库的过程，并消除了部分更新。至关重要的是，他们正在从单一的全局状态域转向区域化架构，即本地集群馈送到全局集群，从而减小了状态错误的爆炸半径。Corrosion 提供了一种替代的分布式状态管理方法，特别适用于受益于链路状态路由协议模型的系统。"
  },
  {
    "id": "45677253",
    "title": "Eight Million Copies of Moby-Dick",
    "url": "https://thevoltablog.wordpress.com/2014/01/27/nicolas-mugaveros-eight-million-copies-of-moby-dick-or-the-whale/",
    "summary": "Chrysanthe Tan's review of Nicolas Mugavero's \"Eight Million Copies of Moby-Dick; or, The Whale\" describes a unique and frustrating reading experience. The book, published by Gauss PDF, consists of 1,000 pages of identical grayscale textures resembling woven fabric, rather than any actual text.\n\nTan initially suspected a printing error but soon realized the book's structure was intentional. She notes the title page's deliberate similarity to Herman Melville's original \"Moby Dick,\" setting the stage for an interpretive imitation.\n\nReading the book provokes a series of increasingly frustrated questions, as the reader attempts to decipher meaning in the unchanging pattern. Tan details her own growing obsession and eventual realization that she has fallen into a \"futile quest for answers,\" mirroring Captain Ahab's relentless pursuit of the white whale.\n\nTan argues that Mugavero's work embodies the whale itself, testing the reader's persistence and highlighting their ego-driven desire for understanding. The experience becomes a form of self-assessment, forcing the reader to confront their own stubborn pursuit of meaning in the face of seemingly meaningless repetition. She compares the book to a rigged IQ test designed to punish obsessive individuals.\n\nUltimately, Tan concludes that \"Eight Million Copies\" is not simply a book, but a \"character assessment and a cheeky piece of performance art.\" The author wins by prompting readers to project their own interpretations onto the unchanging text, much like Ahab projecting his obsession onto Moby Dick.\n",
    "chinese_title": "《白鲸》销量八百万册",
    "chinese_summary": "菊桑瑟·谭对尼古拉斯·穆加维罗的《八百万本<白鲸>》的评论描述了一种独特且令人沮丧的阅读体验。 这本书由高斯PDF出版，由1000页相同的类似于织物纹理的灰度图案组成，而不是任何实际文本。\n\n谭最初怀疑是印刷错误，但很快意识到这本书的结构是故意的。她指出，标题页与赫尔曼·梅尔维尔的原始《白鲸》故意相似，为一种诠释性的模仿奠定了基础。\n\n阅读这本书引发了一系列越来越令人沮丧的问题，因为读者试图在不变的模式中解读意义。 谭详细描述了她自己日益增长的痴迷，并最终意识到她已经陷入了一场“徒劳的寻求答案的旅程”，这与亚哈船长对白鲸的无情追逐相呼应。\n\n谭认为，穆加维罗的作品体现了鲸鱼本身，考验着读者的毅力，并突出了他们以自我为中心的对理解的渴望。这种体验变成了一种自我评估的形式，迫使读者在面对看似毫无意义的重复时，直面自己对意义的顽固追求。 她将这本书比作一场旨在惩罚痴迷者的被操纵的智商测试。\n\n最终，谭总结说，《八百万本》不仅仅是一本书，而是一种“性格评估和一种厚颜无耻的行为艺术”。 作者通过促使读者将自己的解释投射到不变的文本上而获胜，就像亚哈将他的痴迷投射到白鲸身上一样。"
  },
  {
    "id": "45669394",
    "title": "Why I'm teaching kids to hack computers",
    "url": "https://www.hacktivate.app/why-teach-kids-to-hack",
    "summary": "In an effort to rekindle the spirit of exploration and learning through experimentation that he experienced as a teen, Paul Hudson has created \"Hacktivate,\" an app designed to teach cybersecurity skills to kids 13+. Hudson noticed that while \"learn to hack\" material is available, it often lacks practical application, guidance, and engagement.\n\nHacktivate aims to bridge this gap by providing 240 \"capture the flag\" challenges covering areas like SQL injection, the Linux command line, cryptography, and networking. The app emphasizes a safe, sandboxed environment where students can break things without affecting real-world systems. It's available on iPhone, iPad, and Mac, in both a paid upfront version and a free-to-play version with in-app purchases.\n\nHudson discusses the challenges in building Hacktivate, particularly the need to create unique and engaging challenges that teach real-world skills. He highlights examples like steganography puzzles, browser-based vulnerabilities (IDOR, SQL injection), and terminal-based challenges using a custom Linux emulator.\n\nThe app is built with Swift and SwiftUI, and while some AI was used for complex algorithm implementations, the majority was hand-coded to ensure originality and a sense of progression. Hudson drew inspiration from retro games like Syndicate, Command & Conquer, and Uplink to create a visually appealing and engaging interface.\n\nHis goals are to inspire a new generation to explore cybersecurity in a safe way and improve their understanding of online security and privacy. Future plans include improved screenreader support, leaderboards (privacy-preserving), achievements, and UI refinements.\n",
    "chinese_title": "我为什么要教孩子们黑客技术",
    "chinese_summary": "为了重燃青少年时期他所体验到的通过实验进行探索和学习的精神，保罗·哈德森创建了“Hacktivate”，这是一款旨在向13岁以上儿童教授网络安全技能的应用程序。哈德森注意到，虽然“学习黑客技术”的材料随处可见，但它们往往缺乏实际应用、指导和互动。\n\nHacktivate 旨在弥合这一差距，提供 240 个“夺旗”挑战，涵盖 SQL 注入、Linux 命令行、密码学和网络等领域。该应用程序强调一个安全的沙盒环境，学生可以在其中破坏事物而不会影响现实世界的系统。它可在 iPhone、iPad 和 Mac 上使用，既有付费版本，也有带有应用内购买的免费版本。\n\n哈德森讨论了构建 Hacktivate 的挑战，特别是需要创建独特且引人入胜的挑战来教授现实世界的技能。他强调了一些例子，如隐写术谜题、基于浏览器的漏洞（IDOR、SQL 注入）以及使用自定义 Linux 模拟器的基于终端的挑战。\n\n该应用程序是用 Swift 和 SwiftUI 构建的，虽然一些人工智能被用于复杂的算法实现，但大部分是手工编码的，以确保原创性和渐进感。哈德森从 Syndicate、Command & Conquer 和 Uplink 等复古游戏中汲取灵感，创造了一个具有视觉吸引力且引人入胜的界面。\n\n他的目标是激励新一代以安全的方式探索网络安全，并提高他们对在线安全和隐私的理解。未来的计划包括改进的屏幕阅读器支持、排行榜（保护隐私）、成就和 UI 改进。"
  },
  {
    "id": "45720345",
    "title": "Pre-emptive Z80 multitasking explainer",
    "url": "https://github.com/bchiha/Ready-Z80/tree/main/29-Multitasking",
    "summary": "The \"Ready-Z80\" project by bchiha appears to be related to implementing pre-emptive multitasking on the Z80 microprocessor. The title, \"Pre-emptive Z80 multitasking explainer,\" suggests the project aims to provide an understanding or explanation, likely accompanied by code or documentation, on how to achieve this.\n\nPre-emptive multitasking is a system where the operating system (or a scheduler within the system) interrupts running tasks to allow other tasks to execute, preventing any single task from monopolizing the processor. This is crucial for creating responsive and seemingly simultaneous execution of multiple programs, even on a single-core processor like the Z80.\n\nThe project's name \"Ready-Z80\" implies it provides a practical, potentially ready-to-use, implementation for adding pre-emptive multitasking capabilities to Z80-based systems. This would likely involve handling interrupts, managing task contexts (registers, stack pointers, etc.), and providing a scheduler to decide which task runs next.\n\nThe metrics (8 forks and 48 stars) indicate a moderate level of interest in the project, suggesting that the topic of Z80 multitasking is relevant and valuable to some developers or retrocomputing enthusiasts. The \"Public\" designation signifies that the source code and associated resources are openly available for use, modification, and distribution.\n",
    "chinese_title": "抢占式Z80多任务处理说明",
    "chinese_summary": "bchiha 的 \"Ready-Z80\" 项目似乎与在 Z80 微处理器上实现抢占式多任务处理有关。标题“抢占式 Z80 多任务处理解释器”表明该项目旨在提供关于如何实现这一点的理解或解释，可能附带代码或文档。\n\n抢占式多任务处理是一种系统，其中操作系统（或系统内的调度程序）中断正在运行的任务，以允许其他任务执行，从而防止任何单个任务垄断处理器。这对于创建响应式且看似同时执行多个程序至关重要，即使是在像 Z80 这样的单核处理器上也是如此。\n\n项目名称 \"Ready-Z80\" 暗示它提供了一个实用的、可能随时可用的实现，用于向基于 Z80 的系统添加抢占式多任务处理功能。这可能涉及处理中断、管理任务上下文（寄存器、堆栈指针等）以及提供一个调度程序来决定下一个运行哪个任务。\n\n各项指标（8 个 fork 和 48 个 star）表明该项目具有中等程度的关注度，表明 Z80 多任务处理的主题对一些开发人员或复古计算爱好者来说是相关且有价值的。“Public”标志表明源代码和相关资源可公开用于使用、修改和分发。"
  },
  {
    "id": "45664765",
    "title": "Viral 'Free Potatoes' Post Cost This Farmer 150 Tons of Crops",
    "url": "https://www.vice.com/en/article/viral-free-potatoes-post-cost-this-farmer-150-tons-of-crops/",
    "summary": "A Polish farmer named Piotr from Dąbrowica lost 150 tons of his potato harvest due to a viral Facebook rumor claiming he was giving them away for free because he couldn't find buyers. Piotr was away at a family gathering when the false post spread rapidly, drawing crowds from nearby villages equipped with bags, buckets, and trailers to his field. Some individuals took small amounts, while others hauled away up to 60 tons of potatoes at a time.\n\nUpon returning to his farm, Piotr was shocked to find his field nearly bare. The situation went viral in Poland, with reactions ranging from jokes about a \"potato gold rush\" to disbelief over the massive daylight theft. Despite the significant loss, Piotr hasn't yet filed a police report, hoping that some of the potatoes will be returned. The incident highlights the potential for widespread real-world damage caused by a single false social media post. He's received numerous calls, including from journalists, and is now left with an empty field and a stark reminder of the power of misinformation.\n",
    "chinese_title": "病毒式“免费土豆”帖子让这位农民损失了150吨作物",
    "chinese_summary": "波兰农民皮奥特在栋布罗维察因脸书上疯传的谣言损失了150吨土豆，该谣言称他因找不到买家而免费赠送土豆。当时皮奥特不在家，去参加家庭聚会了，这条虚假帖子迅速传播，吸引了附近村庄的人们带着袋子、桶和拖车来到他的田里。有些人拿走了少量土豆，而另一些人一次运走了多达60吨。\n\n皮奥特回到农场后，震惊地发现他的田地几乎空空如也。这一事件在波兰迅速传播，人们的反应各不相同，从关于“土豆淘金热”的玩笑到对光天化日之下大规模盗窃的难以置信。尽管损失惨重，皮奥特尚未报警，希望有人能归还一些土豆。该事件凸显了一条虚假社交媒体帖子可能造成的广泛现实损害。他接到了无数电话，包括来自记者的电话，现在只剩下一片空旷的田地和一个对虚假信息力量的鲜明警示。"
  },
  {
    "id": "45652998",
    "title": "Geoutil.com – Measure distances, areas, and convert geo data in the browser",
    "url": "https://geoutil.com",
    "summary": "GeoUtil.com is a free, browser-based online geography toolkit designed for GIS professionals, developers, and geography enthusiasts. It offers a range of tools for measuring distances and areas, converting between various geospatial data formats, manipulating coordinates, merging and splitting files, and minimizing data size.\n\nKey features include:\n\n*   **Privacy-focused:** All tools run locally in the browser, ensuring data never leaves the user's device.\n*   **Free and accessible:** No sign-up is required, and all tools are free to use.\n*   **Format support:** Works with popular formats like GeoJSON, TopoJSON, Shapefile, KML, WKT, and CSV.\n*   **Diverse functionalities:** Tools include distance and area measurement, coordinate conversion, format conversion (e.g., GeoJSON to TopoJSON), file merging and splitting, and data minification.\n*   **Coordinate Tools:** CRS Conversion, Coordinate Format Conversion, Coordinate Extractor.\n\nGeoUtil is suitable for various use cases, including GIS professionals needing data conversion and validation, web developers preparing data for web maps, data analysts extracting coordinates, educators demonstrating map projections, and researchers processing data privately. The site provides detailed documentation, examples, and a Reddit community for support.\n",
    "chinese_title": "Geoutil.com – 在浏览器中测量距离、面积和转换地理数据",
    "chinese_summary": "GeoUtil.com 是一个免费的、基于浏览器的在线地理工具包，专为 GIS 专业人士、开发者和地理爱好者设计。它提供了一系列工具，用于测量距离和面积、在各种地理空间数据格式之间进行转换、处理坐标、合并和拆分文件以及最小化数据大小。\n\n主要功能包括：\n\n*   **注重隐私：** 所有工具都在本地浏览器中运行，确保数据永远不会离开用户的设备。\n*   **免费且易于访问：** 无需注册，所有工具均可免费使用。\n*   **格式支持：** 适用于 GeoJSON、TopoJSON、Shapefile、KML、WKT 和 CSV 等常用格式。\n*   **功能多样：** 工具包括距离和面积测量、坐标转换、格式转换（例如，GeoJSON 到 TopoJSON）、文件合并和拆分以及数据最小化。\n*   **坐标工具：** CRS 转换、坐标格式转换、坐标提取器。\n\nGeoUtil 适用于各种用例，包括需要数据转换和验证的 GIS 专业人员、为网络地图准备数据的 Web 开发者、提取坐标的数据分析师、演示地图投影的教育工作者以及私下处理数据的研究人员。 该网站提供详细的文档、示例和一个 Reddit 社区以提供支持。"
  },
  {
    "id": "45719788",
    "title": "You are how you act",
    "url": "https://boz.com/articles/you-are-how-you-act",
    "summary": "This article explores the conflicting philosophies of Jean-Jacques Rousseau and Benjamin Franklin, and how they both influence the modern American concept of self. Rousseau believed in an inherent inner goodness corrupted by the world, while Franklin argued that virtue is a habit formed through actions, not an inherent trait.\n\nModern America conveniently adopts both philosophies: Rousseau for excusing intentions and Franklin for demanding accountability. However, the author argues that Franklin's model is more practical and scalable. The idea of \"fake it until you make it,\" often dismissed as superficial, aligns with Franklin's view that repeated behavior shapes character.\n\nThe article emphasizes that you become the kind of person who performs certain actions consistently. While Rousseau encourages introspection, Franklin fosters progress. The author favors Franklin's model because it provides agency – the ability to choose actions even when feelings are uncontrollable. Ultimately, greatness isn't about inherent qualities, but about consistently doing great things.\n",
    "chinese_title": "你的行为塑造了你。",
    "chinese_summary": "本文探讨了让-雅克·卢梭和本杰明·富兰克林的冲突哲学，以及它们如何影响现代美国人的自我概念。卢梭认为内在固有善良，却被世界腐蚀，而富兰克林则认为美德是一种通过行动养成的习惯，而非内在特质。\n\n现代美国巧妙地同时采纳了这两种哲学：用卢梭的观点来为意图辩解，用富兰克林的观点来要求问责。然而，作者认为富兰克林的模式更实用且更具可扩展性。“假装直到你成功”的理念，虽然常被认为是肤浅的，但却与富兰克林的观点一致，即重复的行为塑造性格。\n\n文章强调，你会成为那种持续做出特定行为的人。卢梭鼓励内省，而富兰克林则促进进步。作者更倾向于富兰克林的模式，因为它提供了能动性——即使在情感无法控制时也能选择行动的能力。最终，伟大不在于内在品质，而在于持续地做伟大的事情。"
  },
  {
    "id": "45716109",
    "title": "How I turned Zig into my favorite language to write network programs in",
    "url": "https://lalinsky.com/2025/10/26/zio-async-io-for-zig.html",
    "summary": "This blog post details the author's journey from initial skepticism to becoming a fervent advocate for Zig, particularly for network programming. Initially drawn to Zig for its performance characteristics relevant to audio software, the author found its lack of a robust asynchronous I/O framework a hindrance when building server applications. They had previously relied on Qt in C++ and Go's built-in concurrency features for similar tasks.\n\nTo address this, the author created Zio, an asynchronous I/O and concurrency library for Zig. Zio implements a Go-style concurrency model using stackful coroutines with fixed-size stacks, offering a more manageable alternative to callback-based asynchronous programming. It supports asynchronous network and file I/O, synchronization primitives, Go-style channels, and OS signal handling. Tasks can run in single or multi-threaded modes, migrating between threads for improved performance.\n\nThe author emphasizes Zio's speed, claiming it outperforms Go and Rust's Tokio in single-threaded scenarios and offers comparable performance in multi-threaded setups. They highlight its compatibility with standard reader/writer interfaces, enabling integration with external libraries. An example HTTP server showcases Zio's ease of use.\n\nThe author concludes that Zio has transformed their perception of Zig, moving it from a niche language for performance-critical code to a viable option for full-stack development. They plan to update their NATS client to use Zio and develop an HTTP client/server library based on it.\n",
    "chinese_title": "我如何将 Zig 变成我最喜欢的网络编程语言",
    "chinese_summary": "这篇博文详细介绍了作者从最初的怀疑到成为 Zig 的热烈倡导者的过程，尤其是在网络编程方面。作者最初被 Zig 吸引是因为它在音频软件方面的性能特点，但发现它在构建服务器应用程序时缺乏强大的异步 I/O 框架是一个阻碍。他们之前曾依赖 C++ 中的 Qt 和 Go 的内置并发功能来完成类似的任务。\n\n为了解决这个问题，作者创建了 Zio，一个用于 Zig 的异步 I/O 和并发库。 Zio 使用带有固定大小堆栈的有栈协程实现了一种 Go 风格的并发模型，为基于回调的异步编程提供了一种更易于管理的替代方案。它支持异步网络和文件 I/O、同步原语、Go 风格的通道和 OS 信号处理。任务可以在单线程或多线程模式下运行，并在线程之间迁移以提高性能。\n\n作者强调了 Zio 的速度，声称它在单线程场景中优于 Go 和 Rust 的 Tokio，并在多线程设置中提供相当的性能。 他们强调了它与标准读/写器接口的兼容性，从而能够与外部库集成。一个 HTTP 服务器示例展示了 Zio 的易用性。\n\n作者的结论是，Zio 改变了他们对 Zig 的看法，将其从一种用于性能关键型代码的小众语言转变为全栈开发的可行选择。他们计划更新他们的 NATS 客户端以使用 Zio，并基于它开发一个 HTTP 客户端/服务器库。"
  },
  {
    "id": "45719669",
    "title": "Microsoft needs to open up more about its OpenAI dealings",
    "url": "https://www.wsj.com/tech/ai/microsoft-needs-to-open-up-more-about-its-openai-dealings-59102de8",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "微软需要更多地公开其与OpenAI的交易细节。",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "45721160",
    "title": "EntropyLong: Effective Long-Context Training via Predictive Uncertainty",
    "url": "https://arxiv.org/abs/2510.02330",
    "summary": "This arXiv article (arXiv:2510.02330), titled \"EntropyLong: Effective Long-Context Training via Predictive Uncertainty,\" presents a novel data construction method for training long-context language models. The authors, led by Junlong Jia, address the challenge of creating training data that genuinely reflects long-range dependencies, as existing methods often rely on simple concatenation or heuristics.\n\nEntropyLong tackles this issue by employing a \"model-in-the-loop\" approach that leverages predictive uncertainty. The method identifies high-entropy positions in documents, signifying points where the model is uncertain about the next token. It then retrieves semantically relevant contexts from large corpora and verifies their utility by assessing whether these contexts reduce the prediction entropy at the identified positions. This ensures that added dependencies represent measurable information gain.\n\nThe authors constructed a 128K-length sequence dataset using FineWebEdu and Cosmopedia, incorporating verified dependencies. Models trained on this dataset showed significant improvements on RULER benchmarks, specifically in tasks requiring understanding of distant information. Furthermore, instruction fine-tuning resulted in substantial gains on LongBenchv2, demonstrating enhanced long-context understanding. Ablation studies confirmed the importance of entropy-based verification for effective long-context training. The paper is currently a work in progress. Correspondence can be directed to Xing Wu.\n",
    "chinese_title": "熵长程：通过预测不确定性实现有效长上下文训练",
    "chinese_summary": "这篇 arXiv 文章 (arXiv:2510.02330)，题为“EntropyLong：通过预测不确定性实现有效长文本训练”，提出了一种训练长文本语言模型的新型数据构建方法。作者由贾俊龙领导，旨在解决创建真实反映长程依赖关系的训练数据这一难题，因为现有方法通常依赖于简单的串联或启发式方法。\n\nEntropyLong 通过采用利用预测不确定性的“模型在环”方法来解决这个问题。 该方法识别文档中高熵的位置，表示模型对下一个 token 不确定的点。 然后，它从大型语料库中检索语义相关的上下文，并通过评估这些上下文是否降低了识别位置的预测熵来验证它们的效用。 这确保了添加的依赖关系代表可衡量的信息增益。\n\n作者使用 FineWebEdu 和 Cosmopedia 构建了一个 128K 长度的序列数据集，并纳入了经过验证的依赖关系。 在此数据集上训练的模型在 RULER 基准测试中表现出显着改进，尤其是在需要理解远距离信息的任务中。 此外，指令微调在 LongBenchv2 上产生了显著的收益，表明长文本理解能力得到增强。 消融研究证实了基于熵的验证对于有效的长文本训练的重要性。 该论文目前仍在撰写中。 相关事宜请联系吴星。"
  },
  {
    "id": "45717724",
    "title": "Show HN: Write Go code in JavaScript files",
    "url": "https://www.npmjs.com/package/vite-plugin-use-golang",
    "summary": "Okay, here's a summary based on the title and common use-cases for similar tools, assuming I can't directly access the npm package page:\n\n**Summary:**\n\nThe `vite-plugin-use-golang` package allows developers to write Go code directly within JavaScript or TypeScript files within a Vite-powered project. This effectively blurs the lines between the front-end (JavaScript/TypeScript) and back-end (Go) layers, enabling tighter integration and potentially simplifying development workflows.\n\nThe plugin likely works by intercepting specifically tagged code blocks (e.g., code wrapped in `/* Go */` or similar) during the Vite build process. These blocks are then extracted and compiled into a Go executable, which can be accessed from the JavaScript code. This could involve either compiling the Go code into WebAssembly (WASM) for direct execution in the browser, or more likely, it sets up a simple Go server endpoint that the front-end can call via HTTP requests.\n\nThe benefit is reducing the need for separate Go server processes during development. For example, you might define a computationally intensive function in Go and seamlessly call it from your React component.\n\nPossible use-cases include:\n\n*   Offloading CPU-intensive tasks to Go for improved performance.\n*   Leveraging existing Go libraries and APIs within a front-end application.\n*   Simplifying development by co-locating Go and JavaScript logic.\n\nThe package likely handles the complexities of compiling the Go code, managing the communication between the front-end and the compiled Go code (WASM or server), and providing a way to access the Go functions from JavaScript. The main value proposition is increased developer productivity and simplified project structure.\n",
    "chinese_title": "Show HN: 在 JavaScript 文件中编写 Go 代码",
    "chinese_summary": "好的，以下是基于标题和类似工具常见用例的摘要，假设我无法直接访问 npm 包页面：\n\n**摘要：**\n\n`vite-plugin-use-golang` 包允许开发者在 Vite 项目中的 JavaScript 或 TypeScript 文件中直接编写 Go 代码。这有效地模糊了前端（JavaScript/TypeScript）和后端（Go）之间的界限，从而实现更紧密的集成，并可能简化开发工作流程。\n\n该插件可能通过在 Vite 构建过程中拦截特定标记的代码块（例如，用 `/* Go */` 或类似内容包裹的代码）来工作。然后，这些代码块会被提取并编译成 Go 可执行文件，可以从 JavaScript 代码中访问。这可能涉及将 Go 代码编译成 WebAssembly (WASM) 以便在浏览器中直接执行，或者更有可能的是，它会设置一个简单的 Go 服务器端点，前端可以通过 HTTP 请求调用该端点。\n\n其好处是减少了开发期间对单独 Go 服务器进程的需求。例如，您可以在 Go 中定义一个计算密集型函数，并从您的 React 组件中无缝调用它。\n\n可能的用例包括：\n\n*   将 CPU 密集型任务卸载到 Go 以提高性能。\n*   在前端应用程序中利用现有的 Go 库和 API。\n*   通过共置 Go 和 JavaScript 逻辑来简化开发。\n\n该软件包可能处理编译 Go 代码、管理前端和编译后的 Go 代码（WASM 或服务器）之间的通信以及提供从 JavaScript 访问 Go 函数的方式等复杂性。主要的价值主张是提高开发人员的工作效率和简化项目结构。"
  },
  {
    "id": "45721904",
    "title": "PSF has withdrawn $1.5M proposal to US Government grant program",
    "url": "https://pyfound.blogspot.com/2025/10/NSF-funding-statement.html",
    "summary": "On October 27, 2025, the Python Software Foundation (PSF) announced the withdrawal of its $1.5 million grant proposal to the US National Science Foundation (NSF). The proposal, submitted in January 2025, aimed to improve the security and privacy of the Python and PyPI ecosystems, focusing on addressing structural vulnerabilities and implementing automated proactive review of PyPI packages to prevent supply-chain attacks.\n\nWhile the PSF was initially honored to have the proposal recommended for funding, concerns arose upon reviewing the grant's terms and conditions. A specific clause required the PSF to affirm that it would not operate any programs that \"advance or promote DEI, or discriminatory equity ideology,\" across all PSF activities, not just those funded by the grant. Violation of this clause could result in the NSF reclaiming previously disbursed funds.\n\nGiven the PSF's mission to support a diverse and international community of Python programmers, this requirement was deemed a betrayal of the organization's core values. Despite consulting with NSF contacts and reviewing similar situations, the PSF board unanimously voted to withdraw the application, prioritizing its commitment to DEI over the substantial financial benefits and community impact of the project.\n\nThe withdrawal, compounded by inflation, lower sponsorship, and economic pressures, leaves the PSF in greater need of financial support. The PSF urges individuals and companies to support the organization through memberships, donations, and sponsorships to help sustain its mission of promoting and protecting the Python programming language and its community.\n",
    "chinese_title": "PSF撤回向美国政府拨款计划提交的150万美元申请",
    "chinese_summary": "2025年10月27日，Python软件基金会（PSF）宣布撤回其向美国国家科学基金会（NSF）提交的150万美元拨款申请。该提案于2025年1月提交，旨在提高Python和PyPI生态系统的安全性和隐私性，重点是解决结构性漏洞，并实施对PyPI软件包的自动化主动审查，以防止供应链攻击。\n\n虽然PSF最初很荣幸该提案被推荐资助，但在审查拨款条款和条件后，出现了担忧。一项具体条款要求PSF申明，它不会在所有PSF活动中（不仅仅是受该拨款资助的活动）开展任何“推进或推广DEI，或歧视性公平意识形态”的项目。违反此条款可能导致NSF收回先前支付的资金。\n\n鉴于PSF支持多元化和国际化的Python程序员社区的使命，这一要求被视为背叛了该组织的核心价值观。尽管咨询了NSF联系人并审查了类似情况，PSF董事会仍一致投票决定撤回该申请，优先考虑其对DEI的承诺，而非该项目带来的可观经济利益和社区影响。\n\n撤回申请，再加上通货膨胀、赞助减少和经济压力，使得PSF更加需要财政支持。PSF敦促个人和公司通过会员资格、捐款和赞助来支持该组织，以帮助维持其促进和保护Python编程语言及其社区的使命。"
  },
  {
    "id": "45693871",
    "title": "OpenBSD C/C++ Toolchain in the Browser",
    "url": "https://openbsd.llvm.moe/",
    "summary": "The article introduces a web-based application providing an OpenBSD C/C++ compiler directly in the browser. It leverages JavaScript and WebAssembly to execute the compilation process client-side. This eliminates the need for users to install a local OpenBSD environment or any compilation tools. The accessibility of the compiler through a browser makes it convenient for quick testing, experimentation, and learning C/C++ programming, particularly within the OpenBSD ecosystem. The core requirement is that the user's browser must have JavaScript and WebAssembly enabled for the application to function correctly. While the details of the implementation and capabilities are limited by the text, the focus is clearly on providing an accessible and portable OpenBSD C/C++ compilation environment via the web.\n",
    "chinese_title": "在浏览器中使用OpenBSD C/C++工具链",
    "chinese_summary": "本文介绍了一个基于Web的应用程序，它直接在浏览器中提供OpenBSD C/C++编译器。该应用利用JavaScript和WebAssembly在客户端执行编译过程，从而消除了用户安装本地OpenBSD环境或任何编译工具的需求。通过浏览器访问编译器使其便于快速测试、实验和学习C/C++编程，尤其是在OpenBSD生态系统中。核心要求是用户的浏览器必须启用JavaScript和WebAssembly，应用程序才能正常运行。虽然文本对实现和功能的细节描述有限，但重点显然在于通过Web提供一个可访问且可移植的OpenBSD C/C++编译环境。"
  },
  {
    "id": "45683643",
    "title": "Unexpected patterns in historical astronomical observations",
    "url": "https://www.su.se/english/news/unexpected-patterns-in-historical-astronomical-observations-1.855042",
    "summary": "Researchers analyzing digitized astronomical plates from the early 1950s as part of the VASCO project have discovered unexpected patterns in short-lived flashes of light. These patterns reveal statistical connections between the flashes, nuclear weapons tests, and reports of unidentified anomalous phenomena (UAP).\n\nOne study showed a 68% increase in flashes the day after nuclear tests and an 8.5% increase for each UAP report. When both coincided, the effect was additive. This surprising correlation warrants further investigation.\n\nAnother study focused on identifying potential extraterrestrial artifacts in orbit by looking for flashes aligned in lines or narrow bands, indicating reflections from flat objects. They found two such examples, one coinciding with UAP sightings in Washington, D.C., in 1952. They also found a deficit of flashes in Earth's shadow, suggesting that at least a third of these flashes are solar reflections from highly reflective objects in high orbits.\n\nThese findings suggest that some previously dismissed \"noise\" on astronomical plates may represent real objects exhibiting patterns linked to nuclear tests and UAP reports. The researchers propose that the flashes could be reflections from flat, highly reflective objects in orbit around the Earth. They emphasize that these results are unexpected and warrant further study to understand the origin and nature of these objects.\n",
    "chinese_title": "历史天文观测中的意外模式",
    "chinese_summary": "研究人员分析了20世纪50年代初的数字化天文底片，作为VASCO项目的一部分，发现了短暂闪光中出乎意料的模式。这些模式揭示了闪光、核武器试验和不明异常现象（UAP）报告之间的统计关联。\n\n一项研究表明，核试验后一天闪光增加了68%，每份UAP报告增加了8.5%。当两者同时发生时，效果是叠加的。这种令人惊讶的关联值得进一步调查。\n\n另一项研究侧重于通过寻找排列成直线或窄带的闪光来识别轨道上潜在的地球外人工制品，这表明来自扁平物体的反射。他们发现了两个这样的例子，其中一个与1952年华盛顿特区的不明飞行物目击事件相吻合。他们还发现地球阴影中闪光数量不足，表明至少三分之一的闪光是高轨道上高反射物体产生的太阳反射。\n\n这些发现表明，天文底片上一些先前被认为是“噪声”的现象可能代表了真实的物体，这些物体表现出与核试验和UAP报告相关的模式。研究人员认为，这些闪光可能是地球轨道上扁平、高反射物体的反射。他们强调，这些结果出乎意料，值得进一步研究，以了解这些物体的起源和性质。"
  },
  {
    "id": "45717397",
    "title": "Structure and Interpretation of Classical Mechanics (2014)",
    "url": "https://tgvaughan.github.io/sicm/toc.html",
    "summary": "\"Structure and Interpretation of Classical Mechanics\" by Gerald Jay Sussman and Jack Wisdom (2014) is a textbook that delves into the fundamental principles and mathematical formalisms of classical mechanics. It explores Lagrangian and Hamiltonian mechanics, offering a deep understanding of their applications and interpretations.\n\nThe book begins with Lagrangian mechanics, covering configuration spaces, generalized coordinates, the principle of stationary action, and the Euler-Lagrange equations. It discusses how to find Lagrangians, conserved quantities, constrained motion, and Noether's Theorem. Then it moves to rigid bodies, examining rotational kinetic energy, kinematics of rotation, moments of inertia, Euler angles, and the motion of free rigid bodies, including spin-orbit coupling.\n\nNext, the text introduces Hamiltonian mechanics, focusing on Hamilton's equations, Poisson brackets, phase space reduction, and phase space evolution. It also covers surfaces of section, exponential divergence, Liouville's Theorem, and the standard map.\n\nThe book further explores phase space structure, including the emergence of divided phase space, linear stability, homoclinic tangles, integrable systems, and the Poincaré-Birkhoff theorem, explaining the dissolution of invariant curves. It delves into canonical transformations, generating functions, extended and reduced phase space.\n\nFinally, the text discusses canonical evolution, including the Hamilton-Jacobi equation, Lie transforms, and Lie series, concluding with canonical perturbation theory, which encompasses topics like perturbation theory with Lie series, the pendulum as a perturbed rotor, many degrees of freedom, nonlinear resonance, and the stability of inverted vertical equilibrium. The appendices provide information on Scheme and notation used throughout the book.\n",
    "chinese_title": "经典力学的结构与解释 (2014)",
    "chinese_summary": "杰拉尔德·杰·萨斯曼和杰克·维斯dom的《经典力学结构与解释》（2014）是一本深入探讨经典力学的基本原理和数学形式的教科书。 它探讨了拉格朗日力学和哈密顿力学，提供了对其应用和解释的深刻理解。\n\n本书从拉格朗日力学开始，涵盖构型空间、广义坐标、驻定作用量原理和欧拉-拉格朗日方程。 它讨论了如何找到拉格朗日量、守恒量、约束运动和诺特定理。 然后转向刚体，研究旋转动能、旋转运动学、转动惯量、欧拉角和自由刚体的运动，包括自旋-轨道耦合。\n\n接下来，该书介绍了哈密顿力学，重点关注哈密顿方程、泊松括号、相空间约化和相空间演化。 它还涵盖了截面、指数发散、刘维尔定理和标准映射。\n\n本书进一步探讨了相空间结构，包括分裂相空间的出现、线性稳定性、同宿纠缠、可积系统和庞加莱-伯克霍夫定理，解释了不变曲线的解体。 它深入研究了正则变换、生成函数、扩展和约化的相空间。\n\n最后，该书讨论了正则演化，包括哈密顿-雅可比方程、李变换和李级数，最后以正则微扰理论结尾，其中包括诸如带有李级数的微扰理论、作为扰动转子的摆、多个自由度、非线性共振和倒立垂直平衡的稳定性等主题。 附录提供了有关贯穿全书的Scheme和符号的信息。"
  },
  {
    "id": "45715055",
    "title": "Show HN: MyraOS – My 32-bit operating system in C and ASM (Hack Club project)",
    "url": "https://github.com/dvir-biton/MyraOS",
    "summary": "This \"Show HN\" post introduces MyraOS, a 32-bit Unix-like operating system developed from scratch in C and assembly language. Key features include protected mode operation with GDT/IDT, paging and virtual memory, memory management, heap support, user and kernel modes, process scheduling, and drivers for various hardware components like PIT, RTC, keyboard, mouse, framebuffer, and PATA. MyraOS also boasts an ext2 filesystem and a UI compositor with widgets, labels, icons, buttons, and a custom font. Critically, it features an ELF loader, enabling the execution of real applications, including a pre-loaded Doom port. The author emphasizes that this is a functional OS, not just a toy or look-alike.\n\nThe post provides instructions for running MyraOS using QEMU on macOS, Linux, and Windows (though WSL or other platforms are recommended for Windows). The author includes specific QEMU commands for both normal and fullscreen modes on each operating system. Finally, the developer seeks feedback from the community, encouraging users to share feature requests, general feedback, or even just engage in discussion via email.\n",
    "chinese_title": "Show HN: MyraOS – 我用C和汇编编写的32位操作系统 (Hack Club 项目)",
    "chinese_summary": "这个“Show HN”帖子介绍MyraOS，一个完全由C语言和汇编语言编写的32位类Unix操作系统。主要特性包括：带有GDT/IDT的保护模式操作、分页和虚拟内存、内存管理、堆支持、用户和内核模式、进程调度，以及各种硬件组件的驱动程序，如PIT、RTC、键盘、鼠标、帧缓冲区和PATA。MyraOS还拥有ext2文件系统和一个带有小部件、标签、图标、按钮和自定义字体的UI合成器。关键是，它具有ELF加载器，可以执行真正的应用程序，包括预加载的Doom移植版。作者强调这是一个功能齐全的操作系统，而不仅仅是一个玩具或仿制品。\n\n该帖子提供了在macOS、Linux和Windows上使用QEMU运行MyraOS的说明（尽管建议Windows使用WSL或其他平台）。作者为每个操作系统提供了普通模式和全屏模式的特定QEMU命令。最后，开发者寻求社区的反馈，鼓励用户分享功能请求、一般反馈，甚至只是通过电子邮件进行讨论。"
  },
  {
    "id": "45672615",
    "title": "Sandhill cranes have adopted a Canada gosling",
    "url": "https://www.smithsonianmag.com/science-nature/these-sandhill-cranes-have-adopted-a-canadian-gosling-and-birders-have-flocked-to-watch-the-strange-family-180986828/",
    "summary": "In Madison, Wisconsin, a pair of sandhill cranes has adopted a Canada gosling, a rare phenomenon observed only a few times previously. This interspecies adoption may be increasing due to the rebounding populations of both species and their adaptation to urban landscapes, leading to ecological overlap in suburban wetlands. While the exact circumstances of the adoption are unknown, the gosling has imprinted on the cranes, who care for it like their own colt, even defending it from its biological goose parents.\n\nObservers have noted the tender care the cranes provide, feeding, sheltering, and protecting the gosling. However, the gosling's future is uncertain due to differences in diet, behavior, and migration strategies between cranes and geese. Cranes eat insects and worms, while geese graze on grass. Migration presents a further challenge, as cranes fly higher and at different times of the year than geese.\n\nDespite these challenges, the crane parents are experienced and attentive. Previous instances of such adoptions have not ended well, but local observers remain hopeful. Experts emphasize that death isn't the only outcome, and the gosling could potentially rejoin its own species. The story highlights the resilience and adaptability of both sandhill cranes and Canada geese, whose populations have significantly recovered due to conservation efforts. The event serves as a reminder of the surprising and joyful aspects of nature.\n",
    "chinese_title": "沙丘鹤收养了一只加拿大鹅幼雏",
    "chinese_summary": "在威斯康星州麦迪逊市，一对沙丘鹤收养了一只加拿大鹅幼崽，这种罕见现象此前仅被观察到几次。这种跨物种收养现象可能正在增加，原因是这两个物种的种群数量都在反弹，并且它们适应了城市景观，导致郊区湿地的生态重叠。虽然收养的确切情况尚不清楚，但鹅幼崽已经对鹤产生了印记，鹤像照顾自己的孩子一样照顾它，甚至保护它免受其亲生鹅父母的伤害。\n\n观察者注意到鹤提供的细心照料，喂养、庇护和保护鹅幼崽。然而，由于鹤和鹅在饮食、行为和迁徙策略上的差异，鹅幼崽的未来并不确定。鹤吃昆虫和蠕虫，而鹅则以草为食。迁徙带来了进一步的挑战，因为鹤比鹅飞得更高，时间也不同。\n\n尽管存在这些挑战，鹤父母却经验丰富，非常细心。以前发生过的类似收养案例结局都不太好，但当地观察员仍然抱有希望。专家强调，死亡并非唯一的结局，鹅幼崽有可能重新加入自己的物种。这个故事突出了沙丘鹤和加拿大鹅的韧性和适应性，它们的种群数量因保护工作而显着恢复。该事件提醒人们大自然中令人惊讶和喜悦的一面。"
  },
  {
    "id": "45713359",
    "title": "Ken Thompson recalls Unix's rowdy, lock-picking origins",
    "url": "https://thenewstack.io/ken-thompson-recalls-unixs-rowdy-lock-picking-origins/",
    "summary": "This isn't an article, but rather a newsletter signup form presented in the context of an article about Ken Thompson and the origins of Unix.\n\nThe form aims to get users to subscribe to The New Stack's newsletter. It requires an email address and may require a resubscription if a user has unsubscribed previously.  The form also collects information about the user, including:\n\n*   First Name\n*   Last Name\n*   Company Name\n*   Country\n*   Zip Code\n*   Job Level\n*   Job Role\n*   Company Size\n*   Type of Organization\n*   Industry\n*   LinkedIn Profile URL (optional)\n\nThe stated purpose of collecting this data is to deliver relevant news and resources. By subscribing, users agree to The New Stack's Terms of Use and Privacy Policy. Once subscribed, users are directed to check their inbox for a confirmation email and encouraged to follow The New Stack on social media.\n",
    "chinese_title": "Ken Thompson recalls Unix's rowdy, lock-picking origins",
    "chinese_summary": "This isn't an article, but rather a newsletter signup form presented in the context of an article about Ken Thompson and the origins of Unix.\n\nThe form aims to get users to subscribe to The New Stack's newsletter. It requires an email address and may require a resubscription if a user has unsubscribed previously.  The form also collects information about the user, including:\n\n*   First Name\n*   Last Name\n*   Company Name\n*   Country\n*   Zip Code\n*   Job Level\n*   Job Role\n*   Company Size\n*   Type of Organization\n*   Industry\n*   LinkedIn Profile URL (optional)\n\nThe stated purpose of collecting this data is to deliver relevant news and resources. By subscribing, users agree to The New Stack's Terms of Use and Privacy Policy. Once subscribed, users are directed to check their inbox for a confirmation email and encouraged to follow The New Stack on social media.\n"
  },
  {
    "id": "45723481",
    "title": "Navy loses two aircraft from USS Nimitz aircraft carrier within 30 minutes",
    "url": "https://www.bostonherald.com/2025/10/27/navy-aircraft-crashes-uss-nimitz/",
    "summary": "Within a 30-minute span, a fighter jet and a helicopter, both operating from the USS Nimitz aircraft carrier, crashed into the South China Sea. The Navy's Pacific Fleet confirmed that all five crew members involved were safely rescued and are in stable condition. The incidents occurred on a Sunday afternoon, with investigations underway to determine the causes of the crashes.\n\nPresident Trump suggested the crashes may have been caused by \"bad fuel,\" dismissing any possibility of foul play and emphasizing transparency. The USS Nimitz was on its way back to Naval Base Kitsap in Washington after a deployment to the Middle East due to Houthi rebel attacks on commercial shipping. This is the carrier's last deployment before being decommissioned.\n\nThe article also notes other recent incidents involving the USS Harry S. Truman. These include a guided-missile cruiser mistakenly shooting down a jet, a fighter jet falling off the hangar deck into the Red Sea, and another jet going overboard during landing due to a failure to catch the arresting cables. While no fatalities occurred in these incidents, the investigations' results are still pending.\n",
    "chinese_title": "海军“尼米兹”号航母30分钟内损失两架飞机",
    "chinese_summary": "30分钟内，一架战斗机和一架直升机，均从尼米兹号航空母舰起飞，坠入南海。海军太平洋舰队证实，所有五名涉事机组人员均已安全获救，情况稳定。事件发生在周日下午，坠机原因正在调查中。\n\n特朗普总统暗示，坠机可能是由“劣质燃料”引起的，否认存在任何阴谋的可能性，并强调透明度。尼米兹号在部署到中东应对胡塞叛军对商业航运的袭击后，正返回华盛顿州基察普海军基地的途中。这是该航母退役前的最后一次部署。\n\n文章还提到最近涉及杜鲁门号航空母舰的其他事件，包括一艘导弹巡洋舰错误击落一架喷气式飞机、一架战斗机从机库甲板掉入红海，以及另一架飞机在着陆时因未能抓住阻拦索而落水。虽然这些事件中没有人员伤亡，但调查结果仍在等待中。"
  },
  {
    "id": "45718665",
    "title": "What happened to running what you wanted on your own machine?",
    "url": "https://hackaday.com/2025/10/22/what-happened-to-running-what-you-wanted-on-your-own-machine/",
    "summary": "This article laments the gradual erosion of the freedom to run any software on personal computers, a freedom once inherent to the early days of microcomputing. The author argues that this freedom is being sacrificed in favor of locked-down ecosystems, often disguised as security measures, but ultimately driven by corporate control and profit.\n\nThe piece traces the origins of this trend from video game consoles enforcing licensing fees to Apple's App Store model, which prioritized curated apps and security over user freedom. While Android initially offered a more open approach, it has increasingly adopted restrictions on sideloading and root access. Microsoft's attempts to lock down Windows have failed, but the author fears that a growing user base accustomed to locked-down smartphones and tablets may not resist further restrictions.\n\nThe author emphasizes that the loss of freedom stifles experimentation, creativity, and the ability to learn by doing. The walled gardens prevent individuals from sharing custom software, mods, and other creations without navigating complex developer programs and fees.\n\nThe article concludes with a call to action, urging users to vote with their wallets by supporting platforms that prioritize user freedom and resist the trend of \"Consumer Computing,\" where users are limited to running only approved and monetized code. The central message: your computer should run what *you* want, not just what corporations allow.\n",
    "chinese_title": "在自己的机器上运行自己想运行的东西，这种自由到哪里去了？",
    "chinese_summary": "本文哀叹在个人电脑上运行任何软件的自由逐渐被侵蚀，这种自由曾经是微型计算机早期固有的。作者认为，这种自由正被牺牲，取而代之的是封闭的生态系统，这些生态系统通常伪装成安全措施，但最终是由企业控制和利润驱动的。\n\n文章追溯了这一趋势的起源，从强制执行许可费的视频游戏机到苹果应用商店模式，后者优先考虑精选应用和安全性，而不是用户自由。虽然安卓最初提供了一种更开放的方式，但它越来越多地限制侧载和root访问。微软锁定Windows的尝试已经失败，但作者担心，日益增长的用户群已经习惯了封闭的智能手机和平板电脑，可能不会抵制进一步的限制。\n\n作者强调，自由的丧失扼杀了实验、创造力以及边做边学的能力。围墙花园阻止个人分享定制软件、mod和其他创作，而无需通过复杂的开发者程序和费用。\n\n文章最后呼吁采取行动，敦促用户用他们的钱包投票，支持那些优先考虑用户自由并抵制“消费者计算”趋势的平台，在这种趋势下，用户只能运行经过批准和货币化的代码。中心思想是：你的电脑应该运行*你*想要的，而不仅仅是公司允许的。"
  },
  {
    "id": "45665617",
    "title": "Enchanting Imposters",
    "url": "https://daily.jstor.org/enchanting-imposters/",
    "summary": "Earle Havens, curator of the Bibliotheca Fictiva Collection at Johns Hopkins University, discusses the captivating history of literary forgery. The collection, amassed primarily by Arthur and Janet Freeman, houses over 2,000 items showcasing forgeries from ancient times to the mid-20th century. Havens emphasizes that forgery is not a new phenomenon and explores its various forms, including physical forgeries, fake manuscripts, and literary impostures like \"Robinson Crusoe.\"\n\nHavens incorporates the study of forgery into his teaching, challenging students to create and defend their own historical forgeries. This exercise aims to develop critical thinking and media literacy, encouraging students to question everything they encounter. He notes that while modern AI is not yet adept at generating convincing forgeries, understanding historical techniques of deception provides valuable insights.\n\nThe article explores the motivations behind forgeries, ranging from political agendas (like the Donation of Constantine) to filling gaps in religious narratives (like the Letter of Publius Lentulus). It highlights that forgeries often capitalize on contemporary technologies and beliefs, requiring a delicate balance of information to suspend disbelief. Despite the outrage some forgeries elicit, Havens argues that studying them cultivates skepticism and reveals the ingenuity of successful forgers, ultimately contributing to a deeper understanding of truth and deception.\n",
    "chinese_title": "迷人的冒牌货",
    "chinese_summary": "约翰·霍普金斯大学虚构文献馆馆长厄尔·海文斯探讨了引人入胜的文学伪造史。该馆藏主要由亚瑟和珍妮特·弗里曼夫妇积累，藏有2000多件展示从古代到20世纪中叶的伪造品的文物。海文斯强调，伪造并非新鲜事物，并探讨了其各种形式，包括实物伪造、假手稿和类似“鲁滨逊漂流记”的文学冒名顶替。\n\n海文斯将伪造研究融入教学中，挑战学生创作并捍卫他们自己的历史伪造品。这项练习旨在培养批判性思维和媒体素养，鼓励学生质疑他们遇到的一切。他指出，虽然现代人工智能尚未擅长生成令人信服的伪造品，但了解历史上的欺骗技巧可提供宝贵的见解。\n\n文章探讨了伪造背后的动机，从政治议程（如君士坦丁赠礼）到填补宗教叙事中的空白（如普布利乌斯·楞图卢斯书信）。文章强调，伪造往往利用当代技术和信仰，需要微妙的信息平衡才能消除怀疑。尽管一些伪造品引起了愤怒，但海文斯认为，研究它们可以培养怀疑精神，并揭示成功伪造者的独创性，最终有助于更深入地理解真相和欺骗。"
  },
  {
    "id": "45652952",
    "title": "Should LLMs just treat text content as an image?",
    "url": "https://www.seangoedecke.com/text-tokens-as-image-tokens/",
    "summary": "This article explores the idea of treating text as images for Large Language Models (LLMs), a concept termed \"optical compression.\"  The central argument stems from a DeepSeek paper suggesting that a model's internal representation of an image is potentially more efficient than its representation of text.  The author proposes that converting text into images before feeding it to LLMs could lead to increased data input and improved efficiency.\n\nThe article highlights the counterintuitive nature of optical compression, given that images contain more raw information than text. It explains that image tokens can be more expressive because they are continuous, while text tokens are discrete and represent a scattering of points in the embedding space. The article draws an analogy to human perception, suggesting that processing text as images might be closer to how the human brain works.\n\nCurrent implementations of optical compression exist and show some promise. However, the article also explores the challenges of training LLMs directly on images of text, particularly concerning generating and verifying the correctness of the next word. Finally, the article also raises the point that if this approach is not utilized, LLMs may not be able to tap into potentially relevant resources of text such as the 70% of books that have not been digitized.\n",
    "chinese_title": "大型语言模型是否应该将文本内容视为图像？",
    "chinese_summary": "本文探讨了一种将文本视为图像供大型语言模型（LLM）使用的想法，这一概念被称为“光学压缩”。核心论点源于DeepSeek的一篇论文，该论文表明模型对图像的内部表示可能比其对文本的表示更有效。作者提出，在将文本输入LLM之前将其转换为图像，可能会增加数据输入并提高效率。\n\n文章强调了光学压缩的反直觉性，因为图像包含比文本更多的原始信息。文章解释说，图像token可以更具表现力，因为它们是连续的，而文本token是离散的，并且代表嵌入空间中的一些分散的点。文章类比了人类的感知，表明将文本作为图像处理可能更接近于人脑的工作方式。\n\n目前存在光学压缩的实现，并显示出一定的潜力。然而，文章还探讨了直接在文本图像上训练LLM的挑战，特别是在生成和验证下一个单词的正确性方面。最后，文章还提出了一个观点，如果未采用这种方法，LLM可能无法利用潜在相关的文本资源，例如尚未数字化的70%的图书。"
  },
  {
    "id": "45713959",
    "title": "A definition of AGI",
    "url": "https://arxiv.org/abs/2510.18212",
    "summary": "This arXiv paper, submitted in October 2025 by Hendrycks et al., proposes a quantifiable framework for defining and evaluating Artificial General Intelligence (AGI). Recognizing the lack of a concrete definition of AGI, the authors define it as matching the cognitive versatility and proficiency of a well-educated adult.\n\nTo operationalize this definition, they leverage the Cattell-Horn-Carroll (CHC) theory, a well-established model of human cognition. The framework breaks down general intelligence into ten core cognitive domains like reasoning, memory, and perception. Established human psychometric tests are then adapted to assess AI systems across these domains.\n\nThe paper applies this framework to contemporary AI models, revealing a \"jagged\" cognitive profile. While AI exhibits proficiency in knowledge-intensive areas, significant deficits remain in foundational cognitive abilities, especially long-term memory. This results in AGI scores that quantify both progress and the remaining gap to achieving human-level intelligence; for example, GPT-4 scores 27% and GPT-5 scores 57%. In summary, the study provides a concrete, empirically grounded methodology for measuring AGI progress, highlighting strengths and weaknesses of current AI systems relative to human cognitive benchmarks.\n",
    "chinese_title": "AGI的定义",
    "chinese_summary": "Hendrycks等人于2025年10月提交的这篇arXiv论文，提出了一个可量化的框架，用于定义和评估通用人工智能（AGI）。 鉴于缺乏AGI的具体定义，作者将其定义为达到受过良好教育的成年人的认知多功能性和熟练程度。\n\n为了将这个定义付诸实践，他们利用了卡特尔-霍恩-卡罗尔（CHC）理论，这是一个成熟的人类认知模型。该框架将通用智能分解为推理、记忆和感知等十个核心认知领域。 然后，调整现有人类心理测量测试，以评估AI系统在这些领域的能力。\n\n该论文将这个框架应用于当代AI模型，揭示了一种“锯齿状”的认知曲线。 虽然AI在知识密集型领域表现出熟练程度，但在基础认知能力，特别是长期记忆方面仍然存在显著缺陷。 这导致AGI分数既量化了进展，也量化了实现人类水平智能的剩余差距； 例如，GPT-4得分为27%，GPT-5得分为57%。 总之，该研究提供了一种具体的、以经验为基础的方法来衡量AGI的进展，突出了当前AI系统相对于人类认知基准的优势和劣势。"
  },
  {
    "id": "45684253",
    "title": "A bug that taught me more about PyTorch than years of using it",
    "url": "https://elanapearl.github.io/blog/2025/the-bug-that-taught-me-pytorch/",
    "summary": "This article details a deep dive into a perplexing PyTorch bug that caused the author's training loss to plateau unexpectedly. Initially assuming hyperparameter issues or coding errors, the author systematically investigated, discovering the encoder weights were not updating while the decoder weights were.\n\nThe problem was isolated to the Adam optimizer specifically on the Apple Silicon GPU (MPS backend). Examination of Adam's state revealed the encoder's `exp_avg_sq` (running average of squared gradients) was inexplicably zero, despite the existence of gradients.\n\nHypotheses related to bias correction and floating-point precision were explored and ultimately rejected. A critical observation: switching to float64 (which forced execution on CPU) resolved the issue, pointing towards a device-specific problem.\n\nUltimately, the bug was traced to a PyTorch GPU kernel issue within the MPS backend. Specifically, `addcmul_` and `addcdiv_` operations silently failed when writing to non-contiguous memory. Because the encoder weights were initialized as the transpose of the decoder weights, they had a non-contiguous memory layout. Adam's state tensors inherited this layout, and the MPS kernel's failure to handle non-contiguous outputs resulted in the `exp_avg_sq` not being updated for the encoder, effectively freezing its weights.\n\nThe fixes include making weights contiguous at initialization, upgrading to PyTorch 2.4 (which fixes the `addcmul_/addcdiv_` bug), or upgrading to macOS 15+ (native non-contiguous tensor support). The author also notes that other MPS operations may be affected and has submitted a PR to fix similar bugs in random operations on macOS < 15. A reproduction script is available on GitHub.\n",
    "chinese_title": "一个bug教会了我比多年使用更深刻的PyTorch知识",
    "chinese_summary": "本文深入剖析了一个令人困惑的PyTorch错误，该错误导致作者的训练损失意外停滞。起初，作者假设是超参数问题或编码错误，但经过系统性调查后发现，编码器的权重没有更新，而解码器的权重却在更新。\n\n该问题被确定为仅在使用Apple Silicon GPU (MPS后端)上的Adam优化器特有。对Adam状态的检查显示，尽管存在梯度，但编码器的`exp_avg_sq`（平方梯度的运行平均值）却莫名其妙地为零。\n\n探索了与偏差校正和浮点精度相关的假设，但最终被否定。一个关键的观察结果是：切换到float64（这迫使在CPU上执行）解决了该问题，指向了一个设备特定的问题。\n\n最终，该错误被追溯到MPS后端中的PyTorch GPU内核问题。具体而言，当写入非连续内存时，`addcmul_`和`addcdiv_`操作会悄无声息地失败。由于编码器权重被初始化为解码器权重的转置，因此它们具有非连续的内存布局。Adam的状态张量继承了这种布局，并且MPS内核无法处理非连续输出导致编码器的`exp_avg_sq`未被更新，从而有效地冻结了其权重。\n\n修复方法包括在初始化时使权重连续，升级到PyTorch 2.4（修复了`addcmul_/addcdiv_`错误），或升级到macOS 15+（原生支持非连续张量）。作者还指出，其他MPS操作可能受到影响，并已提交PR来修复macOS < 15上随机操作中的类似错误。GitHub上提供了一个复现脚本。"
  },
  {
    "id": "45675956",
    "title": "An overengineered solution to `sort | uniq -c` with 25x throughput (hist)",
    "url": "https://github.com/noamteyssier/hist-rs",
    "summary": "This article introduces `hist`, a command-line tool designed for high-throughput counting of unique lines, effectively replacing the standard `cat <file> | sort | uniq -c | sort -n` pipeline. Written in Rust, `hist` aims to significantly improve performance compared to existing alternatives.\n\nThe article highlights `hist`'s installation process (`cargo install hist-rs`) and provides usage examples for counting unique lines from files or standard input. It also details options for skipping counting and outputting only unique lines (`-u`), filtering lines based on patterns (`-e`, `-i`), specifying abundance thresholds (`-m`, `-M`), and sorting the output by key (`-n`) or in descending order (`-d`).\n\nThe core of the article is a benchmark comparison against other similar tools: `cuniq`, `huniq`, `sortuniq`, and the naive `cat | sort | uniq -c | sort -n` implementation. The results show that `hist` achieves significantly higher throughput, performing approximately 25 times faster than the naive approach. The benchmark table illustrates `hist`'s superior performance, with a mean execution time of around 200ms compared to the naive implementation's 5409ms.\n",
    "chinese_title": "过度设计的 `sort | uniq -c` 解决方案，吞吐量提升 25 倍 (hist)",
    "chinese_summary": "本文介绍了 `hist`，一个命令行工具，旨在用于高吞吐量地计数唯一行，有效地替代了标准的 `cat <file> | sort | uniq -c | sort -n` 管道。`hist` 使用 Rust 编写，旨在显著提高性能，优于现有替代方案。\n\n文章重点介绍了 `hist` 的安装过程 (`cargo install hist-rs`)，并提供了从文件或标准输入计数唯一行的使用示例。它还详细介绍了跳过计数并仅输出唯一行的选项 (`-u`)，基于模式过滤行的选项 (`-e`, `-i`)，指定丰度阈值的选项 (`-m`, `-M`)，以及按键排序输出的选项 (`-n`) 或以降序排序的选项 (`-d`)。\n\n文章的核心是对 `hist` 与其他类似工具（`cuniq`、`huniq`、`sortuniq` 和朴素的 `cat | sort | uniq -c | sort -n` 实现）的基准比较。结果表明，`hist` 实现了明显更高的吞吐量，其性能大约是朴素方法的 25 倍。基准测试表说明了 `hist` 的卓越性能，其平均执行时间约为 200 毫秒，而朴素实现为 5409 毫秒。"
  },
  {
    "id": "45711094",
    "title": "Feed the bots",
    "url": "https://maurycyz.com/misc/the_cost_of_trash/",
    "summary": "The author describes a significant problem: aggressive bots relentlessly scraping websites to train LLMs, ignoring standard bot-blocking measures like `robots.txt`, IP bans, and rate limits. These bots consume bandwidth and server resources, making traditional defenses ineffective and costly.\n\nThe author explores various countermeasures and explains why they fail. Paywalls and CAPTCHAs inconvenience legitimate users. Gzip bombs are ineffective and resource-intensive. Sending 404s makes the bots more aggressive.\n\nThe surprisingly effective solution is to \"feed the bots\" with dynamically generated garbage content. This exploits the fact that CPU and RAM are relatively cheap and fast compared to disk I/O. The author's Markov babbler generates nonsense content quickly and efficiently, consuming minimal resources (60 microseconds of CPU and 1.2MB of RAM per request) without requiring rules, blacklists, or complex infrastructure. By providing the bots with an endless stream of meaningless data, the author keeps them occupied and reduces the strain on the rest of the server, effectively turning the bots' voracity against them.\n",
    "chinese_title": "喂养机器人",
    "chinese_summary": "作者描述了一个严重的问题：具有攻击性的机器人无情地抓取网站内容以训练大型语言模型，无视标准的机器人屏蔽措施，如`robots.txt`、IP封锁和速率限制。这些机器人消耗带宽和服务器资源，使得传统防御措施失效且代价高昂。\n\n作者探讨了各种对策，并解释了它们为何失败。付费墙和验证码给合法用户带来不便。Gzip炸弹无效且资源密集。发送404错误使机器人更具攻击性。\n\n出人意料的有效解决方案是用动态生成的垃圾内容“喂养”机器人。这利用了CPU和RAM相对便宜且速度快于磁盘I/O的事实。作者的马尔可夫胡言生成器快速高效地生成无意义的内容，消耗极少的资源（每次请求60微秒的CPU和1.2MB的RAM），无需规则、黑名单或复杂的基础设施。通过向机器人提供源源不断的无意义数据，作者使其保持繁忙，并减轻服务器其他部分的压力，有效地利用了机器人自身的贪婪。"
  },
  {
    "id": "45683536",
    "title": "Sphere Computer – The Innovative 1970s Computer Company Everyone Forgot",
    "url": "https://sphere.computer/",
    "summary": "This article introduces the Sphere Computer, a forgotten microcomputer from the 1970s produced by the Sphere Corporation in Utah. Founded in 1975 by Mike Wise, Sphere Corp aimed to be innovative with the Sphere 1, an all-in-one machine based on the Motorola 6800 processor. However, the Sphere 1 suffered from delays, usability issues, and reliability problems, leading to the company's demise in 1977.\n\nDespite its shortcomings, the Sphere computer is recognized as a precursor to the mass-market computers that would soon dominate the market. The article highlights Ben Zotto, a historian, engineer, and writer, who is dedicated to researching and documenting the history of Sphere. He maintains a website featuring a virtual museum, a Sphere emulator, and even new Sphere hardware. Zotto is also writing a book about Sphere and seeks contributions from anyone with Sphere hardware, software, documents, or stories to help preserve its history.\n",
    "chinese_title": "球体电脑：一家被遗忘的创新 1970 年代电脑公司",
    "chinese_summary": "本文介绍了Sphere计算机，这是一款1970年代由犹他州Sphere公司生产的已被遗忘的微型计算机。Sphere公司由Mike Wise于1975年创立，旨在通过基于摩托罗拉6800处理器的all-in-one机器Sphere 1进行创新。然而，Sphere 1饱受延误、可用性问题和可靠性问题的困扰，导致该公司于1977年倒闭。\n\n尽管存在缺点，Sphere计算机仍被认为是即将主导市场的大众市场计算机的先驱。本文重点介绍了历史学家、工程师兼作家Ben Zotto，他致力于研究和记录Sphere的历史。他维护着一个网站，其中包含一个虚拟博物馆、一个Sphere模拟器，甚至还有新的Sphere硬件。Zotto还在撰写一本关于Sphere的书，并寻求拥有Sphere硬件、软件、文档或故事的人的贡献，以帮助保存其历史。"
  },
  {
    "id": "45723183",
    "title": "Seed Oils, Early-Onset Cancer and Human Metabolic Variability",
    "url": "https://mindandmatter.substack.com/p/seed-oils-early-onset-cancer-and",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "种子油、早发性癌症与人类代谢变异性",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "45715873",
    "title": "Are-we-fast-yet implementations in Oberon, C++, C, Pascal, Micron and Luon",
    "url": "https://github.com/rochus-keller/Are-we-fast-yet",
    "summary": "This repository provides additional implementations of the \"Are-we-fast-yet\" benchmark suite, a tool used for performance comparisons across different programming languages. The main \"Are-we-fast-yet\" repository is located at https://github.com/smarr/are-we-fast-yet. This specific repository expands on that by offering implementations in several other languages: Oberon, C++, C, Pascal (FreePascal), Micron, and Luon. Each language implementation has its own dedicated subdirectory containing specific details and instructions related to that particular implementation. The repository also includes the original README file from the main \"Are-we-fast-yet\" project for reference. Essentially, this repository aims to broaden the scope of the benchmark suite by providing implementations in a more diverse set of programming languages, allowing for a wider range of performance comparisons.\n",
    "chinese_title": "Oberon、C++、C、Pascal、Micron和Luon中的“我们够快了吗”实现",
    "chinese_summary": "本仓库提供了\"Are-we-fast-yet\"基准测试套件的额外实现。\"Are-we-fast-yet\"是一个用于比较不同编程语言性能的工具。主要的\"Are-we-fast-yet\"仓库位于https://github.com/smarr/are-we-fast-yet。本仓库通过提供以下几种语言的实现来扩展该套件：Oberon、C++、C、Pascal (FreePascal)、Micron和Luon。每种语言的实现都有其专门的子目录，其中包含与该特定实现相关的具体细节和说明。仓库还包括来自主\"Are-we-fast-yet\"项目的原始README文件，以供参考。本质上，本仓库旨在通过提供更多样化编程语言的实现来扩大基准测试套件的范围，从而实现更广泛的性能比较。"
  },
  {
    "id": "45715204",
    "title": "We saved $500k per year by rolling our own \"S3\"",
    "url": "https://engineering.nanit.com/how-we-saved-500-000-per-year-by-rolling-our-own-s3-6caec1ee1143",
    "summary": "Nanit saved $500,000 per year by building a custom in-memory landing zone (N3) for their video processing pipeline, reducing reliance on S3's PutObject request fees and minimum storage duration. Their original pipeline used S3 for camera uploads, triggered Lambda functions for queuing to SQS, and video processing pods downloaded from S3. However, the cost of S3 PutObject requests at their scale (thousands per second) and 24-hour minimum storage for short-lived video segments became prohibitive.\n\nN3 acts as a short-term in-memory buffer, with S3 serving as an overflow. N3-Proxy handles camera uploads, forwarding them to N3-Storage. N3-Storage queues the video for processing with a URL pointing to itself. If N3 is overloaded, N3-Proxy falls back to uploading directly to S3. A second fallback redirects all traffic to S3 if N3 is unhealthy.\n\nThe development involved synthetic stress tests and a production Proof of Concept (PoC) running in mirror mode. This helped uncover bottlenecks like TLS termination CPU usage and AWS burstable networking limitations. Key implementation details include DNS-based load balancing using Route53, network-optimized instances, Rustls for HTTPS termination, and optimizations to reduce outgoing traffic costs by disabling TCP timestamps. A memory leak related to stalled client connections was resolved by enforcing connection time limits and disabling keep-alive. The result is a cost-effective system that maintains reliability, strict ordering, and high throughput while minimizing S3 costs.\n",
    "chinese_title": "我们自建“S3”每年节省了50万美元",
    "chinese_summary": "Nanit 通过构建自定义的内存落地区 (N3) 为其视频处理管道每年节省了 50 万美元，从而减少了对 S3 的 PutObject 请求费用和最短存储期限的依赖。他们最初的管道使用 S3 进行摄像头上传，触发 Lambda 函数排队到 SQS，以及视频处理 Pod 从 S3 下载。然而，S3 PutObject 请求的成本在他们的规模（每秒数千次）以及短生命周期视频片段的 24 小时最短存储时间变得过高。\n\nN3 充当短期内存缓冲区，S3 则作为溢出。 N3-Proxy 处理摄像头上传，将其转发到 N3-Storage。 N3-Storage 使用指向自身的 URL 将视频排队以进行处理。 如果 N3 过载，N3-Proxy 将回退到直接上传到 S3。 如果 N3 不健康，第二个回退会将所有流量重定向到 S3。\n\n开发过程包括综合压力测试和以镜像模式运行的生产概念验证 (PoC)。 这有助于发现瓶颈，例如 TLS 终止 CPU 使用率和 AWS 可突发网络限制。 关键实现细节包括使用 Route53 的基于 DNS 的负载均衡、网络优化的实例、用于 HTTPS 终止的 Rustls 以及通过禁用 TCP 时间戳来减少出站流量成本的优化。 通过强制连接时间限制和禁用 keep-alive 解决了与停滞的客户端连接相关的内存泄漏问题。 最终结果是一个经济高效的系统，可在最大限度地降低 S3 成本的同时保持可靠性、严格的排序和高吞吐量。"
  },
  {
    "id": "45710065",
    "title": "Asbestosis",
    "url": "https://diamondgeezer.blogspot.com/2025/10/asbestosis.html",
    "summary": "This blog post by Diamond Geezer reflects on the legacy of asbestos in Barking, London, prompted by the unveiling of a memorial to those who died from asbestos exposure. The author recounts the history of the Cape Asbestos Company factory in Barking, which operated from 1913 to 1968, exposing workers and even local children to dangerous levels of asbestos. The area became known for the \"Barking Cough,\" a local term for mesothelioma.\n\nThe post highlights the long-term consequences, noting that the former factory site, now a council estate, still faces challenges due to asbestos contamination. The author then connects the issue personally, recalling his grandfather's work at another Cape Asbestos factory in Watford as an \"Asbestos Moulder\" and his premature death likely due to asbestosis, though it was never officially recognized.\n\nHe contrasts his grandfather's fate with his father's long life, attributing the difference to advancements in science, worker's rights, and health and safety regulations. The post emphasizes the importance of remembering the victims of asbestos exposure and advocating for safer working conditions. Ultimately, it is a personal reflection on loss, remembrance, and the enduring impact of industrial negligence, tempered by gratitude for the improved health and safety standards that have extended his own father's life.\n",
    "chinese_title": "石棉肺",
    "chinese_summary": "钻石吉泽的博文反思了石棉在伦敦巴金的遗害，缘起于纪念因石棉暴露而死亡者的纪念碑的揭幕。作者回顾了1913年至1968年在巴金运营的开普石棉公司工厂的历史，该工厂使工人和甚至当地儿童暴露于危险水平的石棉。该地区因“巴金咳”而闻名，这是当地对间皮瘤的称谓。\n\n该博文强调了长期后果，指出前工厂所在地现在是一个市政住宅区，但由于石棉污染仍然面临挑战。然后，作者将这个问题与个人联系起来，回忆起他的祖父在沃特福德的另一家开普石棉工厂担任“石棉模具工”的工作，以及他可能因石棉肺而早逝，尽管这从未得到官方承认。\n\n他将祖父的命运与父亲的长寿进行对比，将这种差异归因于科学的进步、工人权利以及健康和安全法规。该博文强调了铭记石棉暴露的受害者以及倡导更安全的工作条件的重要性。最终，这是一篇关于失落、纪念以及工业疏忽的持久影响的个人反思，并因健康和安全标准的提高而延长了他父亲的寿命而感到欣慰。"
  },
  {
    "id": "45650167",
    "title": "Eavesdropping on Internal Networks via Unencrypted Satellites",
    "url": "https://satcom.sysnet.ucsd.edu/",
    "summary": "Researchers at the University of California, San Diego, and the University of Maryland conducted a study revealing a significant security flaw in geostationary (GEO) satellite communications: a large amount of sensitive data is broadcast unencrypted. Using a consumer-grade satellite dish, they passively intercepted various types of unencrypted traffic, including cellular backhaul data (calls, SMS, internet traffic, encryption keys), military and government communications (VoIP, vessel tracking data), in-flight Wi-Fi data (passenger browsing, flight information), VoIP calls, internal commercial network data (login credentials, emails, inventory records, ATM information), and critical infrastructure communications (SCADA, power grid repair).\n\nThe research highlighted that anyone with relatively inexpensive equipment could eavesdrop on this data. While the researchers contacted affected parties and verified remediation in some cases (T-Mobile, Walmart, KPU), the issue persists due to the lack of a single responsible entity and the perceived costs (bandwidth overhead, power consumption, licensing fees) associated with encryption. They advocate for mandatory encryption at every layer (TLS, IPsec/VPNs) and treat satellite communication links as unsecured public networks.\n\nThe study focused on GEO satellites and did not investigate LEO systems like Starlink, which are believed to be encrypted. Researchers emphasized the passive nature of their study and are offering assistance to organizations seeking to audit their network traffic exposure. They have also released open-source tools for others to analyze satellite data.\n",
    "chinese_title": "通过未加密卫星窃听内部网络",
    "chinese_summary": "加州大学圣地亚哥分校和马里兰大学的研究人员进行了一项研究，揭示了地球静止轨道（GEO）卫星通信中一个重大的安全漏洞：大量敏感数据以未加密的方式广播。他们使用消费级卫星天线，被动拦截了各种类型的未加密流量，包括蜂窝回程数据（通话、短信、互联网流量、加密密钥）、军事和政府通信（VoIP、船舶跟踪数据）、飞行中Wi-Fi数据（乘客浏览、航班信息）、VoIP通话、内部商业网络数据（登录凭证、电子邮件、库存记录、ATM信息）和关键基础设施通信（SCADA、电网维修）。\n\n该研究强调，任何拥有相对廉价设备的人都可以窃听这些数据。虽然研究人员联系了受影响方并在某些情况下验证了补救措施（T-Mobile、沃尔玛、KPU），但由于缺乏单一责任实体以及与加密相关的感知成本（带宽开销、功耗、许可费），该问题仍然存在。他们倡导在每一层（TLS、IPsec/VPN）进行强制加密，并将卫星通信链路视为不安全的公共网络。\n\n该研究侧重于GEO卫星，并未调查诸如Starlink之类的LEO系统，据信这些系统是加密的。研究人员强调了他们研究的被动性，并为寻求审计其网络流量暴露情况的组织提供帮助。他们还发布了开源工具，供其他人分析卫星数据。"
  },
  {
    "id": "45718908",
    "title": "WorldGrow: Generating Infinite 3D World",
    "url": "https://github.com/world-grow/WorldGrow",
    "summary": "The paper \"WorldGrow: Generating Infinite 3D World\" introduces a novel generative method, WorldGrow, for creating infinitely large, explicit 3D worlds. This system provides an alternative to existing world simulators by generating walkable, coherent environments suitable for navigation and planning evaluation.\n\nWorldGrow employs a hierarchical framework that starts with a single \"seed\" block and grows large environments through block-wise synthesis and a coarse-to-fine refinement process. This approach allows the system to generate coherent global layouts while also producing detailed local geometry and appearance. The generated scenes are intended to be navigable.\n\nThe paper includes examples of diverse generated scenes at various scales, including a large-scale indoor world showcasing reconstructed mesh and textured rendering. While the paper is released and the repository is initialized, the code is still under active development and preparation for public release. Pretrained weights and full training/inference pipelines are planned. The repository is marked with the expectation of changes as development continues. The authors encourage readers to star the project and cite the paper if they use any part of the repository. License details are to be finalized before the full code release.\n",
    "chinese_title": "世界生长：生成无限三维世界",
    "chinese_summary": "论文《WorldGrow：生成无限三维世界》介绍了一种新颖的生成方法WorldGrow，用于创建无限大的、显式的3D世界。该系统通过生成适合导航和规划评估的可行走、连贯的环境，为现有的世界模拟器提供了一种替代方案。\n\nWorldGrow采用一种分层框架，从单个“种子”块开始，并通过块状合成和粗到精的细化过程来增长大型环境。 这种方法允许系统生成连贯的全局布局，同时产生详细的局部几何形状和外观。 生成的场景旨在具有可导航性。\n\n该论文包括在各种尺度上生成的不同场景的示例，包括展示重建网格和纹理渲染的大型室内世界。 虽然该论文已发布，并且存储库已初始化，但代码仍在积极开发中，并为公开发布做准备。 预训练权重和完整的训练/推理流水线正在计划中。 存储库被标记为预计随着开发的继续而发生变化。 作者鼓励读者为该项目点赞，并在使用存储库的任何部分时引用该论文。 许可详情将在完整代码发布之前最终确定。"
  },
  {
    "id": "45721410",
    "title": "More big companies bet they can still grow without hiring",
    "url": "https://www.wsj.com/business/companies-hiring-jobs-ai-9ef675b6",
    "summary": "Here's a concise summary of the Wall Street Journal article \"More big companies bet they can still grow without hiring\":\n\nThe article highlights a growing trend among large companies aiming to achieve revenue growth without significantly increasing their headcount. Faced with ongoing economic uncertainty, high labor costs, and rapid technological advancements, these companies are prioritizing efficiency and productivity over traditional hiring strategies.\n\nSeveral factors are driving this trend. Companies are leveraging existing employees more effectively, redeploying them to high-priority areas and upskilling them to handle new responsibilities. They are also investing heavily in automation and artificial intelligence (AI) to streamline operations, reduce manual tasks, and improve overall efficiency. This includes implementing AI-powered tools for customer service, data analysis, and even some creative tasks.\n\nThe strategy allows businesses to control costs and maintain profitability amidst economic headwinds. While some companies acknowledge a need for specific expertise in certain fields, the overall focus is on maximizing the output of their existing workforce. This approach can result in a leaner, more agile organization, but also raises concerns about potential job displacement and the need for workers to adapt to evolving roles.\n\nExamples mentioned in the article likely include companies across various sectors experimenting with these strategies, illustrating the broad appeal of achieving growth through productivity gains rather than expanding the workforce. The long-term implications of this shift for the labor market and the future of work are significant.\n",
    "chinese_title": "更多大公司押注无需招聘也能增长",
    "chinese_summary": "以下是对《华尔街日报》文章“更多大公司押注不招聘也能实现增长”的简要总结：\n\n该文章强调了一种日益增长的趋势，即大型公司旨在在不显着增加员工人数的情况下实现收入增长。面对持续的经济不确定性、高昂的劳动力成本和快速的技术进步，这些公司正在优先考虑效率和生产力，而不是传统的招聘策略。\n\n有几个因素正在推动这一趋势。公司正在更有效地利用现有员工，将他们重新部署到高优先级的领域，并提升他们的技能以应对新的职责。他们还在自动化和人工智能（AI）方面投入巨资，以简化运营，减少手动任务并提高整体效率。这包括实施人工智能驱动的工具，用于客户服务、数据分析，甚至是一些创造性任务。\n\n该战略使企业能够在经济逆风中控制成本并保持盈利能力。虽然一些公司承认在某些领域需要特定的专业知识，但总体重点是最大限度地提高现有员工的产出。这种方法可以带来一个更精简、更敏捷的组织，但也引发了对潜在的职位流失以及工人需要适应不断变化的角色等问题的担忧。\n\n文章中提到的例子可能包括各个行业的公司都在尝试这些策略，这表明通过提高生产力而不是扩大劳动力来实现增长的广泛吸引力。这种转变对劳动力市场和未来工作方式的长期影响是重大的。"
  },
  {
    "id": "45652218",
    "title": "NORAD’s Cheyenne Mountain Combat Center, c.1966",
    "url": "https://flashbak.com/norad-cheyenne-mountain-combat-center-478804/",
    "summary": "This article details the history and purpose of NORAD's Cheyenne Mountain Combat Center, built in the 1960s as a hardened command and control center during the Cold War. The need for the facility arose from the vulnerability of existing above-ground centers to attack and sabotage, coupled with the increasing threat of Soviet ICBMs. The Cheyenne Mountain facility provided a secure, underground location with advanced technology for detecting and responding to potential air and space attacks.\n\nKey features of the center included: hardened construction capable of withstanding nuclear blasts; duplexed computers and display screens to track aircraft, missiles, and satellites; independent water and power supplies; protection against various forms of warfare; and provisions to operate in a sealed condition for 30 days.\n\nThe article highlights the technological advancements of the time, such as the use of Philco 212 computers and large display boards for visualizing threats. It also describes the physical construction of the facility, including the use of springs and hydraulic dampers to protect the buildings and equipment from shockwaves.\n\nThe article shows the center's role in air and space defense, its capability to track space satellites, and its importance as a command post for directing defensive air battles. Pictures show the technology, the construction and important visits by dignitaries, including President Richard Nixon. While NORAD headquarters moved to Peterson Air Force Base in 2006, the Cheyenne Mountain complex continues to be used by military and intelligence agencies.\n",
    "chinese_title": "北美防空司令部夏延山作战中心，约1966年",
    "chinese_summary": "本文详细介绍了北美防空司令部（NORAD）夏延山作战中心的历史和目的。该中心建于 20 世纪 60 年代冷战时期，是一个加固的指挥和控制中心。建造该设施的需求源于当时地面的指挥中心容易受到攻击和破坏，以及苏联洲际弹道导弹日益增长的威胁。夏延山设施提供了一个安全的地下场所，配备先进技术，用于探测和应对潜在的空中和太空袭击。\n\n该中心的主要特点包括：能够承受核爆炸的加固结构；用于跟踪飞机、导弹和卫星的双重计算机和显示屏幕；独立的供水和电力系统；针对各种形式战争的保护；以及在密封条件下运行 30 天的准备。\n\n本文重点介绍了当时的先进技术，例如 Philco 212 计算机和用于可视化威胁的大型显示板。文章还描述了该设施的物理结构，包括使用弹簧和液压阻尼器来保护建筑物和设备免受冲击波的影响。\n\n本文展示了该中心在空天防御中的作用、跟踪太空卫星的能力，以及作为指挥防御空战的指挥所的重要性。图片展示了相关技术、建造过程以及重要人物的参观，包括理查德·尼克松总统。虽然北美防空司令部总部于 2006 年迁至彼得森空军基地，但夏延山综合体仍然被军事和情报机构使用。"
  },
  {
    "id": "45684414",
    "title": "Tamper-Sensing Meshes Using Low-Cost, Embedded Time-Domain Reflectometry",
    "url": "https://jaseg.de/blog/paper-sampling-mesh-monitor/",
    "summary": "This article describes a new, low-cost method for monitoring tamper-sensing meshes using time-domain reflectometry (TDR). Tamper-sensing meshes, crucial for protecting high-security devices, are typically monitored by measuring their ohmic resistance, a method that offers limited sensitivity and a challenging trade-off between sensitivity and false positives.\n\nThe author introduces a TDR approach leveraging inexpensive components (around 10€) to achieve high resolution (hundreds of picoseconds). The core of the system is an STM32G4-series microcontroller combined with DisplayPort/HDMI \"redriver\" chips (TI's TDP0604 and Diodes' PI3HDX12211) to generate fast pulse edges. These edges are then fed to a four-diode sampling gate using RF Schottky diodes, creating a cheap and fast TDR circuit.\n\nThis TDR approach offers a significant advantage by creating a \"fingerprint\" of the mesh's trace along its length, enabling more precise monitoring compared to traditional resistance measurement. The system's high sensitivity allows it to detect subtle alterations and even distinguish between identical meshes due to manufacturing tolerances. The paper details the circuitry, extensive measurements characterizing the system's performance and robustness against environmental disturbances, and its sensitivity to attacks. A preprint of the paper is available on eprint, and the source code is open-source on git.jaseg.de.\n",
    "chinese_title": "使用低成本嵌入式时域反射技术的防篡改网格",
    "chinese_summary": "本文介绍了一种使用时域反射计(TDR)监测防篡改网格的新型低成本方法。防篡改网格对于保护高安全性设备至关重要，通常通过测量其欧姆电阻进行监测，但这种方法的灵敏度有限，且在灵敏度和误报之间存在具有挑战性的权衡。\n\n作者介绍了一种TDR方法，利用廉价组件（约10欧元）来实现高分辨率（数百皮秒）。该系统的核心是STM32G4系列微控制器，结合DisplayPort/HDMI“重驱动器”芯片（TI的TDP0604和Diodes的PI3HDX12211）来生成快速脉冲边沿。然后，这些边沿被馈送到使用射频肖特基二极管的四二极管采样门，从而创建了一种廉价且快速的TDR电路。\n\n这种TDR方法通过创建网格迹线沿其长度的“指纹”而提供了显著优势，与传统的电阻测量相比，能够进行更精确的监测。该系统的高灵敏度使其能够检测到细微的改变，甚至能够区分由于制造公差而产生的相同网格。本文详细介绍了电路、表征系统性能和对环境干扰的鲁棒性的广泛测量结果，以及其对攻击的敏感性。该论文的预印本可在eprint上找到，源代码在git.jaseg.de上开源。"
  },
  {
    "id": "45710721",
    "title": "You already have a Git server",
    "url": "https://maurycyz.com/misc/easy_git/",
    "summary": "This article advocates for using existing Git servers with SSH access as a convenient solution for code synchronization, collaboration, and even simple web deployments. It highlights the ease of cloning repositories using SSH and pushing changes back to the origin.\n\nThe article addresses the common issue of pushing to a checked-out branch by suggesting the `git config receive.denyCurrentBranch updateInstead` command on the server. For publishing code via a web server, the article suggests cloning the repository via HTTPS.\n\nTo enable HTTPS cloning, `git update-server-info` needs to be run; the article recommends automating this process with a post-update hook. The example hook provided updates the server info automatically and even executes a static site generator to automatically publish updates to a website after pushing changes.\n\nThe author emphasizes the benefits of this approach, including local editing without network lag, automatic server-side updates, built-in backup and version control, and protection against accidental data loss. This strategy offers a simple yet powerful way to manage code across multiple devices and deploy static websites with minimal effort.\n",
    "chinese_title": "你已经有了一个 Git 服务器。",
    "chinese_summary": "本文提倡使用具有 SSH 访问权限的现有 Git 服务器作为便捷的解决方案，用于代码同步、协作，甚至简单的 Web 部署。它强调了使用 SSH 克隆存储库以及将更改推送回原点的便捷性。\n\n本文讨论了推送至已检出分支的常见问题，并建议在服务器上使用 `git config receive.denyCurrentBranch updateInstead` 命令。对于通过 Web 服务器发布代码，本文建议通过 HTTPS 克隆存储库。\n\n要启用 HTTPS 克隆，需要运行 `git update-server-info`；本文建议使用 post-update 钩子来自动化此过程。提供的示例钩子会自动更新服务器信息，甚至执行静态站点生成器，以便在推送更改后自动将更新发布到网站。\n\n作者强调了这种方法的好处，包括本地编辑无网络延迟、自动服务器端更新、内置备份和版本控制，以及防止意外数据丢失。这种策略提供了一种简单而强大的方法，可以跨多个设备管理代码，并以最小的努力部署静态网站。"
  },
  {
    "id": "45671475",
    "title": "Wren: A classy little scripting language",
    "url": "https://wren.io/",
    "summary": "Wren is a small, fast, class-based, and concurrent scripting language designed for embedding in applications. It's inspired by languages like Smalltalk, Lua, and Erlang, offering a modern syntax. The VM implementation is concise, under 4,000 semicolons, making it easy to understand.\n\nWren prioritizes speed through a fast compiler and compact object representation, allowing it to compete with other dynamic languages. Unlike some scripting languages with complex object models, Wren emphasizes classes. Concurrency is achieved via lightweight fibers, enabling program organization into communicating coroutines.\n\nAs a scripting language meant for embedding, Wren boasts no dependencies, a small standard library, and a user-friendly C API. It is compatible with various C and C++ standards. The article encourages readers to try Wren in their browser and invites them to get involved with the project.\n",
    "chinese_title": "鹪鹩：一款优雅的小型脚本语言",
    "chinese_summary": "Wren是一种小型、快速、基于类且并发的脚本语言，专为嵌入应用程序而设计。它受到Smalltalk、Lua和Erlang等语言的启发，并提供现代语法。其VM实现简洁，少于4000个分号，易于理解。\n\nWren通过快速的编译器和紧凑的对象表示来优先考虑速度，使其能够与其他动态语言竞争。与一些具有复杂对象模型的脚本语言不同，Wren强调类。并发性通过轻量级纤程实现，从而可以将程序组织成通信协程。\n\n作为一种用于嵌入的脚本语言，Wren不依赖任何外部库，拥有一个小型标准库和一个用户友好的C API。它兼容各种C和C++标准。文章鼓励读者在浏览器中尝试Wren，并邀请他们参与到项目中来。"
  },
  {
    "id": "45718546",
    "title": "This World of Ours (2014) [pdf]",
    "url": "https://www.usenix.org/system/files/1401_08-12_mickens.pdf",
    "summary": "I am unable to summarize the article. The content provided appears to be a PDF file's internal code, not human-readable text. Therefore, there is no article to summarize.\n",
    "chinese_title": "我们这个世界 (2014) [pdf]",
    "chinese_summary": "我无法总结这篇文章。提供的内容似乎是PDF文件的内部代码，而非人类可读的文本。因此，没有文章可以总结。"
  },
  {
    "id": "45639476",
    "title": "Researchers demonstrate centimetre-level positioning using smartwatches",
    "url": "https://www.otago.ac.nz/news/newsroom/researchers-demonstrate-centimetre-level-positioning-using-smartwatches",
    "summary": "Researchers at the University of Otago have successfully demonstrated centimeter-level positioning using smartwatches, a significant improvement over the meter-level accuracy typically achieved with existing GPS technology in these devices. This breakthrough utilizes advanced algorithms to process and refine the raw satellite signals received by the smartwatch.\n\nThe key to this enhanced precision lies in overcoming the limitations of standard GPS, which is often affected by signal interference and atmospheric distortions. The Otago team developed sophisticated software capable of mitigating these errors and extracting more precise location data. This involves combining multiple satellite signals and correcting for signal delays caused by the ionosphere and troposphere.\n\nThe potential applications of centimeter-level smartwatch positioning are vast, ranging from improved navigation for pedestrians and cyclists to more accurate tracking of athletes' performance. It could also enhance the functionality of location-based services, such as augmented reality applications and emergency response systems. Furthermore, precise positioning could benefit fields like agriculture and environmental monitoring.\n\nThe researchers highlight that this technology could democratize high-precision positioning, making it accessible to a wider range of users through affordable and readily available smartwatches. While further development and refinement are needed, this proof-of-concept study represents a major step towards achieving highly accurate positioning with everyday wearable devices.\n",
    "chinese_title": "研究人员展示了使用智能手表实现的厘米级定位",
    "chinese_summary": "奥塔哥大学研究人员已成功展示了使用智能手表实现厘米级定位的技术，这比现有设备中通常使用的米级精度的GPS技术有了显著的提升。这项突破利用先进的算法来处理和优化智能手表接收到的原始卫星信号。\n\n这种增强精度的关键在于克服标准GPS的局限性，标准GPS经常受到信号干扰和大气畸变的影响。奥塔哥大学的研究团队开发了复杂的软件，能够减轻这些误差并提取更精确的位置数据。这包括结合多个卫星信号，并校正由电离层和对流层引起的信号延迟。\n\n厘米级智能手表定位的潜在应用非常广泛，从改善行人和骑自行车者的导航到更准确地跟踪运动员的表现。它还可以增强基于位置的服务的功能，例如增强现实应用程序和应急响应系统。此外，精确的定位可以使农业和环境监测等领域受益。\n\n研究人员强调，这项技术可以普及高精度定位，使其通过价格合理且易于获得的智能手表为更广泛的用户所用。虽然还需要进一步的开发和完善，但这项概念验证研究代表着在日常可穿戴设备上实现高精度定位的重大一步。"
  },
  {
    "id": "45715726",
    "title": "Poison, Poison Everywhere",
    "url": "https://loeber.substack.com/p/29-poison-poison-everywhere",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "到处是毒药",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "45630599",
    "title": "Downloadable movie posters from the 40s, 50s, 60s, and 70s",
    "url": "https://hrc.contentdm.oclc.org/digital/collection/p15878coll84/search",
    "summary": "The provided text describes a resource (likely a website or online database) called CONTENTdm that offers downloadable movie posters from the 1940s, 1950s, 1960s, and 1970s. The key takeaway is the availability of these vintage movie posters for download. The page also indicates a requirement for Javascript to enable full interactivity within the platform. This suggests that without Javascript enabled, some features of the CONTENTdm website, related to browsing, searching, or downloading the posters, might be limited or unavailable. Essentially, CONTENTdm is a digital collection of vintage movie posters that users can access and potentially download, but they need Javascript enabled in their browser for the optimal experience.\n",
    "chinese_title": "可下载的四五十六七十年代电影海报",
    "chinese_summary": "该文本描述了一个名为CONTENTdm的资源（可能是网站或在线数据库），它提供可下载的1940年代、1950年代、1960年代和1970年代的电影海报。关键信息是这些老式电影海报可供下载。页面还表明需要启用Javascript才能实现平台内的完整交互性。这表明，如果没有启用Javascript，CONTENTdm网站的某些功能，例如浏览、搜索或下载海报，可能会受到限制或无法使用。本质上，CONTENTdm是一个老式电影海报的数字馆藏，用户可以访问并可能下载，但他们需要在浏览器中启用Javascript以获得最佳体验。"
  },
  {
    "id": "45713367",
    "title": "Books by People – Defending Organic Literature in an AI World",
    "url": "https://booksbypeople.org/",
    "summary": "Books By People is an organization certifying publishers who champion human-authored books, safeguarding creative integrity in an era of AI-generated content. They aim to create a trusted \"Organic Literature\" market where readers can easily identify and value works written by humans.\n\nTheir certification process involves collaborating with publishers to verify internal systems, focusing on workflows, AI usage, authorship integrity, and editorial control. This includes a questionnaire, follow-up discussions, and a review of a sample of titles using expert analysis, editorial process checks, and signed declarations. Once approved, a formal agreement is established, with annual reviews to maintain standards.\n\nCertified publishers receive the Books By People stamp, a certification ID, and a QR code for their profile in the Certified Publisher Directory, which can be used on book covers, metadata, and marketing materials. Additionally, publishers gain access to resources like an Organic Literature Publisher Manual, AI guidance, a legal playbook, AI monitoring materials, and optional advisor support. They also join a network of legal experts, and receive industry updates.\n\nBy joining the \"Organic Literature\" movement, publishers can secure the future of human authorship, maintain consumer trust through proof of authenticity, differentiate their brand in a saturated market, and strategically certify their organization. The Books By People team comprises experts in books, technology, marketing, law, and publishing.\n",
    "chinese_title": "人民之书：在人工智能世界捍卫有机文学",
    "chinese_summary": "\"Books By People\" 是一家认证出版社的组织，这些出版社致力于推广人类创作的书籍，在人工智能生成内容时代保护创作的完整性。他们的目标是创建一个值得信赖的“有机文学”市场，让读者可以轻松识别和重视人类创作的作品。\n\n他们的认证过程包括与出版社合作，验证内部系统，重点关注工作流程、人工智能使用情况、作者身份完整性和编辑控制。这包括一份问卷调查、后续讨论以及对一系列书目的审查，审查采用专家分析、编辑流程检查和签署声明等方式。一旦获得批准，就会建立正式协议，并通过年度审查来维持标准。\n\n获得认证的出版社将获得 \"Books By People\" 标志、认证ID和一个二维码，用于其在“认证出版社目录”中的个人资料，这些标志、ID和二维码可用于书籍封面、元数据和营销材料。此外，出版社还可以获得诸如《有机文学出版社手册》、人工智能指南、法律手册、人工智能监控材料以及可选的顾问支持等资源。他们还将加入法律专家网络，并收到行业更新。\n\n通过加入 \"有机文学\" 运动，出版社可以确保人类创作的未来，通过真实性证明来维护消费者信任，在饱和的市场中区分其品牌，并战略性地认证其组织。“Books By People” 团队由书籍、技术、市场营销、法律和出版领域的专家组成。"
  },
  {
    "id": "45713253",
    "title": "Making the Electron Microscope",
    "url": "https://www.asimov.press/p/electron-microscope",
    "summary": "This article chronicles the evolution of the electron microscope from its inception to its current sophisticated form. It highlights the limitations of light microscopy due to the wave nature of light and the work of Ernst Abbe in defining the resolution limit. The discovery of X-rays and the subsequent development of X-ray crystallography by the Braggs provided a glimpse into atomic structures but was limited by the need for crystallized samples.\n\nThe crucial breakthrough came with Hans Busch's work on electron beams and magnetic fields, which demonstrated that magnetic coils could focus electron beams like lenses focus light, giving birth to electron optics. This inspired Ernst Ruska, working under Max Knoll, to develop the first electron microscope.\n\nInitially intended to improve oscilloscopes, Ruska's work focused on optimizing magnetic focusing coils to sharpen electron beams. This ultimately led to the creation of a prototype electron microscope in 1931, which, though rudimentary, proved the concept. By 1938, it was used to capture images of viruses.\n\nThe article then details the advancements leading to modern cryo-electron microscopy, which can resolve individual atoms. While acknowledging the limitations of electron microscopy, such as the need for static, thin samples in a vacuum, the piece emphasizes its ongoing importance as a bridge between molecular structure and living function in biological research.\n",
    "chinese_title": "制造电子显微镜",
    "chinese_summary": "本文记录了电子显微镜从诞生到目前精密形态的演变过程。它强调了由于光的波动性导致的光学显微镜的局限性，以及恩斯特·阿贝在定义分辨率极限方面的工作。X射线的发现以及后来布拉格父子开发的X射线晶体学为了解原子结构提供了一瞥，但受到需要结晶样品的限制。\n\n汉斯·布什关于电子束和磁场的研究带来了关键突破，该研究表明磁线圈可以像透镜聚焦光一样聚焦电子束，从而诞生了电子光学。这启发了在马克斯·克诺尔手下工作的恩斯特·鲁斯卡开发了第一台电子显微镜。\n\n最初是为了改进示波器，鲁斯卡的工作重点是优化磁聚焦线圈以锐化电子束。这最终导致了1931年第一台电子显微镜原型的诞生，虽然简陋，但证明了这个概念。到1938年，它被用于拍摄病毒图像。\n\n然后，本文详细介绍了导致现代冷冻电镜的进步，冷冻电镜可以分辨单个原子。文章在承认电子显微镜的局限性（例如需要在真空中使用静态、薄样品）的同时，强调了其作为分子结构和生物研究中生物活体功能之间桥梁的持续重要性。"
  },
  {
    "id": "45722104",
    "title": "Zhao's Binance Aided Trump Family Crypto Venture Before Pardon",
    "url": "https://www.bloomberg.com/news/articles/2025-10-27/pardon-of-cz-how-binance-founder-aided-trump-family-crypto-venture",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "赵长鹏在赦免前曾协助特朗普家族加密货币项目",
    "chinese_summary": "Unable to access the article link.\n"
  },
  {
    "id": "45715752",
    "title": "Show HN: Helium Browser for Android with extensions support, based on Vanadium",
    "url": "https://github.com/jqssun/android-helium-browser",
    "summary": "生成摘要时出错",
    "chinese_title": "Show HN: Helium Browser for Android with extensions support, based on Vanadium",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45711062",
    "title": "Formal Reasoning [pdf]",
    "url": "https://cs.ru.nl/~freek/courses/fr-2025/public/fr.pdf",
    "summary": "生成摘要时出错",
    "chinese_title": "Formal Reasoning [pdf]",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45710843",
    "title": "My favorite cult sci-fi and fantasy books you may not have heard of before",
    "url": "https://shepherd.com/best-books/cult-sci-fi-and-fantasy-you-may-not-have-heard-of",
    "summary": "生成摘要时出错",
    "chinese_title": "My favorite cult sci-fi and fantasy books you may not have heard of before",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45709819",
    "title": "Writing a RISC-V Emulator in Rust",
    "url": "https://book.rvemu.app/",
    "summary": "生成摘要时出错",
    "chinese_title": "Writing a RISC-V Emulator in Rust",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45710006",
    "title": "Advent of Code 2025: Number of puzzles reduce from 25 to 12 for the first time",
    "url": "https://adventofcode.com/2025/about#faq_num_days",
    "summary": "生成摘要时出错",
    "chinese_title": "Advent of Code 2025: Number of puzzles reduce from 25 to 12 for the first time",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45721293",
    "title": "Intel has cut 35,500 jobs in less than two years",
    "url": "https://www.tomshardware.com/pc-components/cpus/intel-has-cut-35-500-jobs-in-less-than-two-years-more-than-20-000-let-go-in-in-recent-months-as-lip-bu-tan-continues-drastic-recovery-journey",
    "summary": "生成摘要时出错",
    "chinese_title": "Intel has cut 35,500 jobs in less than two years",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45709988",
    "title": "Clojure Land – Discover open-source Clojure libraries and frameworks",
    "url": "https://clojure.land/",
    "summary": "生成摘要时出错",
    "chinese_title": "Clojure Land – Discover open-source Clojure libraries and frameworks",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45720404",
    "title": "Swiss smart socks help diabetics feel their feet again",
    "url": "https://newatlas.com/diabetes/smart-socks-diabetics-feel-feet/",
    "summary": "生成摘要时出错",
    "chinese_title": "Swiss smart socks help diabetics feel their feet again",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45701980",
    "title": "Why your social.org files can have millions of lines without performance issues",
    "url": "https://en.andros.dev/blog/4e12225f/why-your-socialorg-files-can-have-millions-of-lines-without-any-performance-issues/",
    "summary": "生成摘要时出错",
    "chinese_title": "Why your social.org files can have millions of lines without performance issues",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45713738",
    "title": "Alzheimer's disrupts circadian rhythms of plaque-clearing brain cells",
    "url": "https://medicine.washu.edu/news/alzheimers-disrupts-circadian-rhythms-of-plaque-clearing-brain-cells/",
    "summary": "生成摘要时出错",
    "chinese_title": "Alzheimer's disrupts circadian rhythms of plaque-clearing brain cells",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45719250",
    "title": "Inside An Isotemp Oven Controlled Crystal Oscillator",
    "url": "https://tomverbeure.github.io/2025/10/26/Inside-an-Isotemp-OCXO107-10.html",
    "summary": "生成摘要时出错",
    "chinese_title": "Inside An Isotemp Oven Controlled Crystal Oscillator",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45715837",
    "title": "Microsoft 365 Copilot – Arbitrary Data Exfiltration via Mermaid Diagrams",
    "url": "https://www.adamlogue.com/microsoft-365-copilot-arbitrary-data-exfiltration-via-mermaid-diagrams-fixed/",
    "summary": "生成摘要时出错",
    "chinese_title": "Microsoft 365 Copilot – Arbitrary Data Exfiltration via Mermaid Diagrams",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45636033",
    "title": "Searching for Charles Fourier in the ruins of a socialist utopia outside LA",
    "url": "https://kubicki.org/letters/the-dogs-of-llano-del-rio-i/",
    "summary": "生成摘要时出错",
    "chinese_title": "Searching for Charles Fourier in the ruins of a socialist utopia outside LA",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45676376",
    "title": "NextSilicon reveals new processor chip in challenge to Intel, AMD",
    "url": "https://www.reuters.com/business/nextsilicon-reveals-new-processor-chip-challenge-intel-amd-2025-10-22/",
    "summary": "生成摘要时出错",
    "chinese_title": "NextSilicon reveals new processor chip in challenge to Intel, AMD",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45720376",
    "title": "10M people watched a YouTuber shim a lock; the lock company sued him. Bad idea",
    "url": "https://arstechnica.com/tech-policy/2025/10/suing-a-popular-youtuber-who-shimmed-a-130-lock-what-could-possibly-go-wrong/",
    "summary": "生成摘要时出错",
    "chinese_title": "10M people watched a YouTuber shim a lock; the lock company sued him. Bad idea",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45717933",
    "title": "How Cloudflare's client-side security made the NPM supply chain attack non-event",
    "url": "https://blog.cloudflare.com/how-cloudflares-client-side-security-made-the-npm-supply-chain-attack-a-non/",
    "summary": "生成摘要时出错",
    "chinese_title": "How Cloudflare's client-side security made the NPM supply chain attack non-event",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45710366",
    "title": "Connect to a 1980s Atari BBS through the web",
    "url": "https://www.southernamis.com/ataribbsconnect",
    "summary": "生成摘要时出错",
    "chinese_title": "Connect to a 1980s Atari BBS through the web",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45711886",
    "title": "YouTube Just Ate TV. It's Only Getting Started",
    "url": "https://www.hollywoodreporter.com/business/digital/youtube-impact-tv-sports-late-night-comedy-shows-1236400353/",
    "summary": "生成摘要时出错",
    "chinese_title": "YouTube Just Ate TV. It's Only Getting Started",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45649948",
    "title": "A Looking Glass Half Empty, Part 2: A Series of Unfortunate Events",
    "url": "https://www.filfre.net/2025/10/a-looking-glass-half-empty-part-2-a-series-of-unfortunate-events/",
    "summary": "生成摘要时出错",
    "chinese_title": "A Looking Glass Half Empty, Part 2: A Series of Unfortunate Events",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45708292",
    "title": "A worker fell into a nuclear reactor pool",
    "url": "https://www.nrc.gov/reading-rm/doc-collections/event-status/event/2025/20251022en?brid=vscAjql9kZL1FfGE7TYHVw#en57996:~:text=TRANSPORT%20OF%20CONTAMINATED%20PERSON%20OFFSITE",
    "summary": "生成摘要时出错",
    "chinese_title": "A worker fell into a nuclear reactor pool",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45716296",
    "title": "ICE Will Use AI to Surveil Social Media",
    "url": "https://jacobin.com/2025/10/ice-zignal-surveillance-social-media",
    "summary": "生成摘要时出错",
    "chinese_title": "ICE Will Use AI to Surveil Social Media",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45652821",
    "title": "Gleescript – Bundle Gleam-on-Erlang project into an executable file",
    "url": "https://github.com/lpil/gleescript",
    "summary": "生成摘要时出错",
    "chinese_title": "Gleescript – Bundle Gleam-on-Erlang project into an executable file",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45708795",
    "title": "GenAI Image Editing Showdown",
    "url": "https://genai-showdown.specr.net/",
    "summary": "生成摘要时出错",
    "chinese_title": "GenAI Image Editing Showdown",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45710021",
    "title": "What if tariffs?",
    "url": "https://www.swatch.com/en-en/what-if-tariffs-so34z106/SO34Z106.html",
    "summary": "生成摘要时出错",
    "chinese_title": "What if tariffs?",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45718490",
    "title": "Why JPEG XL Ignoring Bit Depth Is Genius (and Why AVIF Can't Pull It Off)",
    "url": "https://www.fractionalxperience.com/ux-ui-graphic-design-blog/why-jpeg-xl-ignoring-bit-depth-is-genius",
    "summary": "生成摘要时出错",
    "chinese_title": "Why JPEG XL Ignoring Bit Depth Is Genius (and Why AVIF Can't Pull It Off)",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45707658",
    "title": "The Linux Boot Process: From Power Button to Kernel",
    "url": "https://www.0xkato.xyz/linux-boot/",
    "summary": "生成摘要时出错",
    "chinese_title": "The Linux Boot Process: From Power Button to Kernel",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45712118",
    "title": "Resource use matters, but material footprints are a poor way to measure it",
    "url": "https://ourworldindata.org/material-footprint-limitations",
    "summary": "生成摘要时出错",
    "chinese_title": "Resource use matters, but material footprints are a poor way to measure it",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45715980",
    "title": "Knowledge Is Worth Your Time",
    "url": "https://chanda.bearblog.dev/knowledge-is-worth-your-time/",
    "summary": "生成摘要时出错",
    "chinese_title": "Knowledge Is Worth Your Time",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45708524",
    "title": "Pico-Banana-400k",
    "url": "https://github.com/apple/pico-banana-400k",
    "summary": "生成摘要时出错",
    "chinese_title": "Pico-Banana-400k",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45715632",
    "title": "Toon – Token Oriented Object Notation",
    "url": "https://github.com/johannschopplich/toon",
    "summary": "生成摘要时出错",
    "chinese_title": "Toon – Token Oriented Object Notation",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45713835",
    "title": "Nvidia DGX Spark: When benchmark numbers meet production reality",
    "url": "https://publish.obsidian.md/aixplore/Practical+Applications/dgx-lab-benchmarks-vs-reality-day-4",
    "summary": "生成摘要时出错",
    "chinese_title": "Nvidia DGX Spark: When benchmark numbers meet production reality",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45709922",
    "title": "LaserTweezer – Optical Trap",
    "url": "https://www.gaudi.ch/GaudiLabs/?page_id=578",
    "summary": "生成摘要时出错",
    "chinese_title": "LaserTweezer – Optical Trap",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45696438",
    "title": "Validating your ideas on strangers (2017)",
    "url": "https://jeremyaboyd.com/post/validating-your-ideas-on-strangers",
    "summary": "生成摘要时出错",
    "chinese_title": "Validating your ideas on strangers (2017)",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45698070",
    "title": "WebDAV isn't dead yet",
    "url": "https://blog.feld.me/posts/2025/09/webdav-isnt-dead-yet/",
    "summary": "生成摘要时出错",
    "chinese_title": "WebDAV isn't dead yet",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45701404",
    "title": "Mistakes I see engineers making in their code reviews",
    "url": "https://www.seangoedecke.com/good-code-reviews/",
    "summary": "生成摘要时出错",
    "chinese_title": "Mistakes I see engineers making in their code reviews",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45718711",
    "title": "The last European train that travels by sea",
    "url": "https://www.bbc.com/travel/article/20251024-the-last-european-train-that-travels-by-sea",
    "summary": "生成摘要时出错",
    "chinese_title": "The last European train that travels by sea",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45706518",
    "title": "AI, Wikipedia, and uncorrected machine translations of vulnerable languages",
    "url": "https://www.technologyreview.com/2025/09/25/1124005/ai-wikipedia-vulnerable-languages-doom-spiral/",
    "summary": "生成摘要时出错",
    "chinese_title": "AI, Wikipedia, and uncorrected machine translations of vulnerable languages",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45712517",
    "title": "Myanmar military shuts down a major cybercrime center, detains over 2k people",
    "url": "https://apnews.com/article/scam-centers-cybercrime-myanmar-a2c9fda85187121e51bd0efdf29c81da",
    "summary": "生成摘要时出错",
    "chinese_title": "Myanmar military shuts down a major cybercrime center, detains over 2k people",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45653543",
    "title": "Passwords and Power Drills",
    "url": "https://google.github.io/building-secure-and-reliable-systems/raw/ch01.html#on_passwords_and_power_drills",
    "summary": "生成摘要时出错",
    "chinese_title": "Passwords and Power Drills",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45715979",
    "title": "Show HN: Learn Basic Chess Movements",
    "url": "https://www.minichessgames.com/?hn",
    "summary": "生成摘要时出错",
    "chinese_title": "Show HN: Learn Basic Chess Movements",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45700946",
    "title": "Key IOCs for Pegasus and Predator Spyware Removed with iOS 26 Update",
    "url": "https://iverify.io/blog/key-iocs-for-pegasus-and-predator-spyware-cleaned-with-ios-26-update",
    "summary": "生成摘要时出错",
    "chinese_title": "Key IOCs for Pegasus and Predator Spyware Removed with iOS 26 Update",
    "chinese_summary": "生成摘要时出错"
  }
]