[
  {
    "id": "46070668",
    "title": "Same-day upstream Linux support for Snapdragon 8 Elite Gen 5",
    "url": "https://www.qualcomm.com/developer/blog/2025/10/same-day-snapdragon-8-elite-gen-5-upstream-linux-support",
    "summary": "The article, titled \"Same-day upstream Linux support for Snapdragon 8 Elite Gen 5,\" announces the availability of immediate, upstream Linux support for the Snapdragon 8 Elite Gen 5 chipset. This means that users and developers can leverage standard, unmodified Linux kernels on devices powered by this processor from the moment it is released. This eliminates the need for custom kernels or waiting for community ports, resulting in a more streamlined development and usage experience. The availability of same-day upstream support is a significant advancement, likely simplifying software integration, improving security, and enabling faster feature updates compared to relying on vendor-specific or out-of-tree solutions. The short content implies that this is a positive announcement for the Linux community and Snapdragon 8 Elite Gen 5 adopters.\n",
    "chinese_title": "骁龙 8 Elite Gen 5 芯片当日提交 Linux 上游支持",
    "chinese_summary": "文章《骁龙8 Elite Gen 5当日上游Linux支持》宣布骁龙8 Elite Gen 5芯片组可立即获得上游Linux支持。这意味着用户和开发者可以在搭载该处理器的设备发布之时，即可使用标准、未经修改的Linux内核。这消除了对定制内核或等待社区移植的需求，从而带来更精简的开发和使用体验。当日上游支持的可用性是一项重大进步，与依赖于供应商特定的或树外解决方案相比，它可能简化软件集成、提高安全性并实现更快的特性更新。简短的内容表明，这对Linux社区和骁龙8 Elite Gen 5的采用者来说是一个积极的消息。"
  },
  {
    "id": "46069771",
    "title": "We're Losing Our Voice to LLMs",
    "url": "https://tonyalicea.dev/blog/were-losing-our-voice-to-llms/",
    "summary": "This article argues that the increasing use of Large Language Models (LLMs) on social media is eroding individual voices and creating a homogenized online presence. The author contends that relying on LLMs to generate posts is a mistake because personal voice is a valuable asset.\n\nThe author emphasizes the uniqueness of individual voices, shaped by personal experiences and evolving over time. This unique voice is recognizable, fosters connection and trust, and is crucial for making a positive impression in professional and personal settings. The author shares a personal anecdote of securing a job because their unique writing style was valued.\n\nThe article warns that using LLMs to write \"in your voice\" is insufficient because real voice is dynamic and responsive to life experiences and emotions. The author argues that allowing LLMs to dominate online communication leads to cognitive laziness and atrophies this valuable asset.\n\nThe conclusion urges readers to prioritize their own authentic voices over LLM-generated content. The author emphasizes the importance of individual perspectives and discourages the homogenization of online communication through artificial intelligence. The core message is a call to action: to cultivate and express your unique voice instead of surrendering it to LLMs.\n",
    "chinese_title": "我们正在因为大型语言模型而失去自我表达的声音",
    "chinese_summary": "本文认为，社交媒体上大型语言模型（LLM）的日益普及正在侵蚀个人声音，并造成同质化的在线形象。作者认为，依赖 LLM 生成帖子是一个错误，因为个人声音是一种宝贵的资产。\n\n作者强调个人声音的独特性，它由个人经历塑造并随着时间的推移而演变。这种独特的声音是可识别的，可以促进联系和信任，并且对于在职业和个人环境中留下积极印象至关重要。作者分享了一个个人轶事，讲述了因为独特的写作风格而获得一份工作。\n\n本文警告说，使用 LLM 以“你的声音”写作是不够的，因为真正的声音是动态的，并且对生活经历和情感做出反应。作者认为，允许 LLM 主导在线交流会导致认知上的懒惰，并使这种宝贵的资产萎缩。\n\n结论敦促读者优先考虑自己的真实声音，而不是 LLM 生成的内容。作者强调个人视角的重要性，并反对通过人工智能同质化在线交流。核心信息是一个行动呼吁：培养和表达你独特的声音，而不是将其交给 LLM。"
  },
  {
    "id": "46068015",
    "title": "Arthur Conan Doyle explored men’s mental health through Sherlock Holmes",
    "url": "https://scienceclock.com/arthur-conan-doyle-delved-into-mens-mental-health-through-his-sherlock-holmes-stories/",
    "summary": "This article argues that Arthur Conan Doyle used his Sherlock Holmes stories to explore the taboo subject of men's mental health and vulnerability during the Victorian era. Drawing on his own family experiences with his father's alcoholism and mental illness, Doyle created a character in Sherlock Holmes who, despite his genius, grapples with drug addiction, loneliness, and depression, making him relatable to readers.\n\nThe article highlights specific stories, like \"The Man with the Twisted Lip,\" \"The Adventure of the Engineer's Thumb,\" and \"The Stockbroker's Clerk,\" where male characters face emotional turmoil, betrayal, and moral dilemmas. Doyle uses these narratives to examine societal expectations of Victorian masculinity and the pressures men faced, particularly concerning financial stability and reputation. He portrays men struggling with shame, fear, and the potential for suicide.\n\nThe author emphasizes how Holmes serves not just as a detective but also as a protector, confidante, and comforter to these men, offering them both physical and psychological support. By showcasing Holmes's attentiveness to both the physical and mental trauma of his clients, Doyle underscores the importance of psychological support for men. The article concludes that while contemporary readers may have focused on Holmes's genius, these stories offer valuable insight into the mental struggles of Victorian men and create a connection with modern readers.\n",
    "chinese_title": "亚瑟·柯南·道尔通过夏洛克·福尔摩斯探索男性心理健康",
    "chinese_summary": "本文认为，亚瑟·柯南·道尔利用他的夏洛克·福尔摩斯故事，探讨了维多利亚时代男性精神健康和脆弱性这一禁忌话题。道尔借鉴了他自己家庭中父亲酗酒和精神疾病的经历，塑造了夏洛克·福尔摩斯这一角色，尽管他天赋异禀，却也与毒瘾、孤独和抑郁作斗争，从而使读者产生共鸣。\n\n本文重点介绍了《歪唇男人》、《工程师的大拇指》和《证券经纪人的书记员》等故事，其中男性角色面临着情绪动荡、背叛和道德困境。道尔利用这些叙事来审视维多利亚时代社会对男性气概的期望以及男性面临的压力，特别是关于经济稳定和声誉方面。他描绘了男性与羞耻、恐惧和自杀的可能性作斗争的场景。\n\n作者强调，福尔摩斯不仅是一位侦探，还是这些男性的保护者、知己和安慰者，为他们提供身体和心理上的支持。通过展示福尔摩斯对客户身心创伤的关注，道尔强调了对男性进行心理支持的重要性。文章总结道，虽然当代读者可能更关注福尔摩斯的天赋，但这些故事为我们提供了了解维多利亚时代男性精神困境的宝贵视角，并与现代读者建立了联系。"
  },
  {
    "id": "46069556",
    "title": "Show HN: Runprompt – run .prompt files from the command line",
    "url": "https://github.com/chr15m/runprompt",
    "summary": "`runprompt` is a single-file Python script enabling users to execute `.prompt` files from the command line, facilitating interaction with various AI models. Prompts are structured with frontmatter (model selection, input/output schemas) and a template prompt body.\n\nKey features include:\n\n*   **Easy Setup:** Download and execute with `curl` and `chmod`.\n*   **Stdin Integration:** The `{{STDIN}}` variable allows piping text into prompts.\n*   **Structured Output:** Define output schemas for structured JSON extraction, enabling data processing.\n*   **Prompt Chaining:** Pipe the JSON output of one prompt as input for another.\n*   **CLI Overrides:** Override frontmatter values from the command line (e.g., specifying a different model).\n*   **Environment Variable Configuration:** Set API keys (ANTHROPIC\\_API\\_KEY, OPENAI\\_API\\_KEY, GOOGLE\\_API\\_KEY, OPENROUTER\\_API\\_KEY) and override frontmatter via `RUNPROMPT_*` variables.\n*   **Verbose Mode:** Use `-v` for request/response debugging.\n*   **Provider Support:**  It supports Anthropic, OpenAI, Google AI, and OpenRouter models. OpenRouter offers a unified API for multiple providers. Model selection follows the `provider/model-name` format.\n",
    "chinese_title": "Show HN: Runprompt – 从命令行运行 .prompt 文件",
    "chinese_summary": "`runprompt` 是一个单文件 Python 脚本，使用户能够从命令行执行 `.prompt` 文件，从而方便与各种 AI 模型进行交互。提示词的结构包含前置元数据（模型选择、输入/输出模式）和一个模板提示词正文。\n\n主要功能包括：\n\n*   **轻松设置：** 使用 `curl` 和 `chmod` 下载并执行。\n*   **Stdin 集成：** `{{STDIN}}` 变量允许将文本通过管道传递到提示词中。\n*   **结构化输出：** 定义输出模式以进行结构化 JSON 提取，从而实现数据处理。\n*   **提示词链：** 将一个提示词的 JSON 输出通过管道作为另一个提示词的输入。\n*   **CLI 覆盖：** 从命令行覆盖前置元数据值（例如，指定不同的模型）。\n*   **环境变量配置：** 设置 API 密钥（ANTHROPIC\\_API\\_KEY、OPENAI\\_API\\_KEY、GOOGLE\\_API\\_KEY、OPENROUTER\\_API\\_KEY）并通过 `RUNPROMPT_*` 变量覆盖前置元数据。\n*   **详细模式：** 使用 `-v` 进行请求/响应调试。\n*   **供应商支持：** 它支持 Anthropic、OpenAI、Google AI 和 OpenRouter 模型。 OpenRouter 为多个供应商提供统一的 API。 模型选择遵循 `provider/model-name` 格式。"
  },
  {
    "id": "46066280",
    "title": "Linux Kernel Explorer",
    "url": "https://reverser.dev/linux-kernel-explorer",
    "summary": "The \"Linux Kernel Explorer\" provides an interactive resource for learning about the Linux kernel, based on \"The Kernel in The Mind\" by Moon Hee Lee. It emphasizes that **the kernel is not a process, but the system itself**, serving user processes and bridging hardware and software. It orchestrates syscalls, interrupts, and scheduling to keep user tasks running.\n\nThe platform offers a structured learning path, starting with understanding the kernel's fundamental difference from a process and its role as an authority. It highlights the kernel's **layered system: virtual, mapped, isolated, and controlled**.\n\nThe resource allows users to explore the kernel source code directly via a file explorer, providing access to critical files like `init/main.c`, `kernel/fork.c`, `include/linux/sched.h`, and `arch/x86/kernel/entry_64.S`. Each chapter builds upon the previous, covering topics from system foundations and memory management to scheduling and virtualization.\n\nKnowledge checks are included at the end of each chapter to test understanding. The ultimate goal is to provide a deeper understanding of the Linux kernel's architecture and functionality through interactive exploration and structured learning.\n",
    "chinese_title": "Linux内核探索",
    "chinese_summary": "\"Linux内核探险家\"提供了一个交互式资源，用于学习Linux内核，其基于Moon Hee Lee的著作\"The Kernel in The Mind\"。它强调**内核不是一个进程，而是系统本身**，服务于用户进程并连接硬件和软件。它协调系统调用、中断和调度，以保持用户任务的运行。\n\n该平台提供结构化的学习路径，从理解内核与进程的根本区别及其作为权威的角色开始。它突出了内核的**分层系统：虚拟的、映射的、隔离的和受控的**。\n\n该资源允许用户通过文件浏览器直接探索内核源代码，提供对诸如`init/main.c`、`kernel/fork.c`、`include/linux/sched.h`和`arch/x86/kernel/entry_64.S`等关键文件的访问。每个章节都建立在前一个章节的基础上，涵盖从系统基础和内存管理到调度和虚拟化的主题。\n\n每章末尾都包含知识检查，以测试理解情况。最终目标是通过交互式探索和结构化学习，更深入地理解Linux内核的架构和功能。"
  },
  {
    "id": "46031552",
    "title": "Quake Engine Indicators",
    "url": "https://fabiensanglard.net/quake_indicators/index.html",
    "summary": "This article by Fabien Sanglard delves into hidden \"indicators\" found within the original Quake engine, accessible in the game files. These icons, TURTLE, RAM, DISC, and NET, were designed to provide feedback on the game's performance.\n\nThe TURTLE indicator appears when the framerate drops below 10 fps, primarily for developers and map designers to identify performance bottlenecks due to excessive polygons or inefficient code. The command `showturtle 1/0` controls its visibility.\n\nThe RAM indicator warns of \"surface cache thrashing,\" a critical performance issue where the engine is forced to repeatedly regenerate and discard surface data (combinations of textures and lightmaps). This arises when map geometry exceeds the engine's surface cache capacity, leading to a severe framerate drop. This likely assisted map designers in optimizing map complexity.\n\nThe DISC indicator reflects HDD access through `Sys_FileRead`, mostly showing loading activity. While intended for player feedback, its overlap with the TURTLE indicator likely limited its utility during development.\n\nFinally, the NET indicator signals a loss of network packets from the server for more than 300ms, informing players about potential connectivity issues and poor ping.\n\nThe author concludes with a scenario illustrating all indicators appearing simultaneously, representing a disastrous gameplay experience riddled with performance and connectivity problems.\n",
    "chinese_title": "雷神之锤引擎指标",
    "chinese_summary": "Fabien Sanglard 的这篇文章深入探讨了原始 Quake 引擎中隐藏的“指示器”，这些指示器可以在游戏文件中找到。这些图标，TURTLE、RAM、DISC 和 NET，旨在提供关于游戏性能的反馈。\n\n当帧率降至 10 fps 以下时，TURTLE 指示器就会出现，主要用于开发者和地图设计师识别由于过多多边形或低效代码导致的性能瓶颈。命令 `showturtle 1/0` 控制其可见性。\n\nRAM 指示器警告“表面缓存颠簸”，这是一个关键的性能问题，即引擎被迫重复生成和丢弃表面数据（纹理和光照贴图的组合）。当地图几何体超过引擎的表面缓存容量时，就会出现这种情况，导致帧率严重下降。这很可能帮助地图设计师优化地图复杂性。\n\nDISC 指示器通过 `Sys_FileRead` 反映 HDD 访问，主要显示加载活动。虽然最初旨在提供玩家反馈，但它与 TURTLE 指示器的重叠可能限制了其在开发过程中的效用。\n\n最后，NET 指示器表示来自服务器的网络数据包丢失超过 300 毫秒，从而告知玩家潜在的连接问题和糟糕的延迟。\n\n作者最后用一个场景来说明所有指示器同时出现的情况，代表着一个充斥着性能和连接问题的灾难性游戏体验。"
  },
  {
    "id": "46064757",
    "title": "Penpot: The Open-Source Figma",
    "url": "https://github.com/penpot/penpot",
    "summary": "Penpot is an open-source design and code collaboration tool positioning itself as an alternative to Figma. It empowers designers to create designs, prototypes, and design systems while providing developers with ready-to-use code, streamlining the design-code workflow and eliminating handoff issues. Penpot supports open standards like SVG, CSS, HTML, and JSON, is free to use, and can be deployed via browser or self-hosted.\n\nRecent updates include native design token integration for improved efficiency and collaboration, and the major 2.0 release introduced CSS Grid Layout, a UI redesign, and a new Components system. Organizations requiring extra support can contact Penpot for services. The article highlights the upcoming Penpot Fest 2025 in Madrid.\n\nKey benefits of Penpot include a plugin system for expanding capabilities, real-time collaboration or solo work options, an inspect mode for instant code access, and design system support with Design Tokens, Components, and Variants. Penpot is deployment agnostic, offering installation options like Docker and Kubernetes.\n\nThe article emphasizes the importance of community involvement, inviting contributions through code, design sharing, bug reporting, translation, and feedback. Resources include documentation, tutorials, and developer diaries. Penpot is licensed under the Mozilla Public License v2.0 and is a project of Kaleidos INC.\n",
    "chinese_title": "Penpot：开源的Figma",
    "chinese_summary": "Penpot 是一个开源的设计与代码协作工具，定位为 Figma 的替代品。它赋能设计师创建设计稿、原型和设计系统，同时为开发者提供可直接使用的代码，从而简化设计-代码工作流程，消除交接问题。Penpot 支持 SVG、CSS、HTML 和 JSON 等开放标准，免费使用，并可通过浏览器部署或自托管。\n\n最近的更新包括原生设计令牌集成，以提高效率和协作；主要的 2.0 版本引入了 CSS Grid Layout、UI 重新设计以及新的组件系统。需要额外支持的组织可以联系 Penpot 寻求服务。文章重点介绍了即将于 2025 年在马德里举行的 Penpot Fest。\n\nPenpot 的主要优势包括用于扩展功能的插件系统、实时协作或单人工作选项、用于即时代码访问的检查模式，以及具有设计令牌、组件和变体的设计系统支持。Penpot 是部署无关的，提供 Docker 和 Kubernetes 等安装选项。\n\n文章强调了社区参与的重要性，邀请通过代码、设计分享、错误报告、翻译和反馈进行贡献。资源包括文档、教程和开发者日志。Penpot 在 Mozilla Public License v2.0 许可下授权，是 Kaleidos INC. 的一个项目。"
  },
  {
    "id": "46068847",
    "title": "Show HN: MkSlides – Markdown to slides with a similar workflow to MkDocs",
    "url": "https://github.com/MartenBE/mkslides",
    "summary": "MkSlides is a static site generator that transforms Markdown files into visually appealing slideshows using Reveal.js. It offers a workflow similar to MkDocs, simplifying the creation of presentations from Markdown source files configured with a single YAML file.\n\nKey features include: building static HTML slideshows from Markdown; supporting single Markdown files or directories for slideshow creation; easy deployment on various platforms; live preview functionality with python-livereload; customizability with favicons, CSS themes, and templates; and emoji support.\n\nInstallation is straightforward using `pip install mkslides`.  The `mkslides build` command generates static sites from Markdown files, either in a specified folder (e.g., `mkslides build slides/`) or a single file (e.g., `mkslides build test.md`).  The `mkslides serve` command provides a live preview during editing.  A YAML configuration file (mkslides.yml) allows customization of both the index page and individual slides, including themes, titles, reveal.js options, and plugins.  Markdown files can also use frontmatter to override configuration options on a per-slide basis. The tool provides extensive customization capabilities, allowing users to tailor the appearance and functionality of their slideshows. Examples showcasing its possibilities, including Mermaid.js and PlantUML support, are available online.\n",
    "chinese_title": "Show HN: MkSlides – 用类似于 MkDocs 的工作流程将 Markdown 转换为幻灯片",
    "chinese_summary": "MkSlides是一个静态站点生成器，它使用Reveal.js将Markdown文件转换为视觉上吸引人的幻灯片。它提供类似于MkDocs的工作流程，简化了从使用单个YAML文件配置的Markdown源文件创建演示文稿的过程。\n\n主要功能包括：从Markdown构建静态HTML幻灯片；支持单个Markdown文件或目录来创建幻灯片；易于在各种平台上部署；使用python-livereload的实时预览功能；可使用网站图标、CSS主题和模板进行自定义；以及表情符号支持。\n\n使用`pip install mkslides`即可轻松安装。 `mkslides build`命令从Markdown文件生成静态站点，可以在指定的文件夹（例如，`mkslides build slides/`）或单个文件（例如，`mkslides build test.md`）中生成。 `mkslides serve`命令在编辑期间提供实时预览。 YAML配置文件（mkslides.yml）允许自定义索引页和单个幻灯片，包括主题、标题、reveal.js选项和插件。 Markdown文件还可以使用Frontmatter来覆盖每个幻灯片的配置选项。 该工具提供了广泛的自定义功能，允许用户定制幻灯片的外观和功能。 展示其可能性的示例，包括Mermaid.js和PlantUML支持，可在网上找到。"
  },
  {
    "id": "46066695",
    "title": "Ray Marching Soft Shadows in 2D (2020)",
    "url": "https://www.rykap.com/2020/09/23/distance-fields/",
    "summary": "This article explains how to implement ray marching soft shadows in 2D using distance fields. The author describes a method for creating visually appealing, though not physically accurate, soft shadows that are performant.\n\nThe core idea is ray marching: calculating whether a pixel is in shadow by tracing a ray from that pixel to the light source. Instead of fixed-size steps, the algorithm uses the distance field to determine the maximum safe distance to advance along the ray at each step, avoiding skipping over potential occluders.\n\nThe article then details three rules for creating soft shadows:\n\n1.  The closer a ray gets to intersecting a shape, the more the pixel should be shadowed. This is approximated using the minimum distance to the scene during ray marching.\n2.  The further the pixel is from the point of near-intersection, the more spread out the shadow should be. This is approximated using the total ray progress.\n3.  Light gets weaker with distance, implemented by a quadratic fade-off.\n\nThe author uses a GLSL code snippet to illustrate the implementation of these rules, combining the minimum distance ratio (sceneDist / rayProgress) with a distance factor.\n\nFinally, the author acknowledges a common artifact of this technique: banding. They mention two mitigations: using an improved approximation of the distance from a ray to the scene, and introducing random jitter to the ray marching step size. They note that the latter is a trade-off between banding and graininess, and they remain open to improvements.\n",
    "chinese_title": "二维光线步进软阴影（2020）",
    "chinese_summary": "本文阐述了如何使用距离场在2D中实现光线步进软阴影。作者描述了一种创建视觉上吸引人但物理上不精确的、且性能良好的软阴影的方法。\n\n核心思想是光线步进：通过从像素向光源追踪光线来计算该像素是否处于阴影中。该算法不是采用固定大小的步长，而是使用距离场来确定每一步沿光线推进的最大安全距离，避免跳过潜在的遮挡物。\n\n文章随后详细介绍了创建软阴影的三个规则：\n\n1.  光线越接近与形状相交，像素应该被阴影覆盖得越多。这可以通过在光线步进过程中到场景的最小距离来近似。\n2.  像素距离近交点越远，阴影应该越分散。这可以通过总的光线推进距离来近似。\n3.  光照强度随距离减弱，通过二次衰减来实现。\n\n作者使用 GLSL 代码片段来说明这些规则的实现，将最小距离比率 (sceneDist / rayProgress) 与距离因子相结合。\n\n最后，作者承认了这种技术的常见伪像：条带化。他们提到了两种缓解方法：使用对光线到场景距离的改进近似，以及在光线步进的步长中引入随机抖动。他们指出后者是在条带化和颗粒感之间的一种权衡，并且他们对改进持开放态度。"
  },
  {
    "id": "46065034",
    "title": "DIY NAS: 2026 Edition",
    "url": "https://blog.briancmoses.com/2025/11/diy-nas-2026-edition.html",
    "summary": "In this blog post, the author details their 2026 DIY NAS build, continuing their tradition of sharing their experiences building a network-attached storage server annually. The core criteria remain consistent: a small form factor, at least six drive bays, a low-power CPU, and homelab potential for virtual machines and containers.\n\nThe author highlights the challenge of rising component prices, particularly for hard drives, SSDs, and RAM. Despite this, they decided to proceed with the build, anticipating potential further cost increases.\n\nThe chosen components include the Topton N22 motherboard with an Intel Core 3 N355 CPU, offering improved performance for homelab use. For the case, the JONSBO N4 was selected for its smaller footprint and six 3.5\" drive bays, despite some limitations in drive accessibility. To combat potential noise issues, a Noctua NF-A12x25 PWM fan was chosen.\n\nThe author used pre-existing 32GB DDR5 RAM. A pair of 128GB Silicon Power A55 SATA SSDs were used as boot drives and two 1TB Silicon Power NVMe SSDs were used for apps and VMs. Due to high costs, the author opted to use decommissioned hard drives for bulk storage testing. They also highlight the importance of choosing the right hard drives.\n\nFor the OS, TrueNAS Community Edition (version 25.10.0.1) was chosen due to its enterprise-grade features and ease of use.\n\nThe final cost of the build, excluding bulk storage hard drives, was around $989.36, with a total of $1,189.34. The author also provides a brief overview of the assembly process, noting cable management challenges with the power supply and difficulties installing drives in the bays without a SATA backplane.\n",
    "chinese_title": "DIY NAS：2026版",
    "chinese_summary": "作者在本篇博文中详细介绍了他们2026年DIY NAS的构建过程，延续了他们每年分享构建网络附加存储服务器经验的传统。核心标准保持不变：小尺寸规格、至少六个硬盘位、低功耗CPU以及用于虚拟机和容器的家庭实验室潜力。\n\n作者强调了组件价格上涨的挑战，尤其是硬盘、固态硬盘和内存。尽管如此，他们还是决定继续构建，预计未来可能会进一步上涨。\n\n选择的组件包括采用英特尔酷睿3 N355 CPU的Topton N22主板，为家庭实验室使用提供更高的性能。对于机箱，选择了JONSBO N4，因为它占用空间更小且具有六个3.5英寸硬盘位，尽管在硬盘访问方面存在一些限制。为了解决潜在的噪音问题，选择了Noctua NF-A12x25 PWM风扇。\n\n作者使用了原有的32GB DDR5内存。一对128GB Silicon Power A55 SATA固态硬盘用作启动盘，两块1TB Silicon Power NVMe固态硬盘用于应用程序和虚拟机。由于成本高昂，作者选择使用退役的硬盘进行批量存储测试。他们还强调了选择合适硬盘的重要性。\n\n对于操作系统，选择了TrueNAS Community Edition（版本25.10.0.1），因为它具有企业级功能且易于使用。\n\n构建的最终成本（不包括批量存储硬盘）约为989.36美元，总计1,189.34美元。作者还简要概述了组装过程，指出电源的电缆管理面临挑战，并且在没有SATA背板的情况下难以在托架中安装硬盘。"
  },
  {
    "id": "46066522",
    "title": "Mixpanel Security Breach",
    "url": "https://mixpanel.com/blog/sms-security-incident/",
    "summary": "On November 8th, 2025, Mixpanel experienced a security incident involving a smishing campaign that led to unauthorized access to a limited number of customer accounts. Mixpanel promptly activated its incident response protocols, working to contain the breach, eradicate the threat, and secure affected user accounts. They also partnered with external cybersecurity experts for remediation and response.\n\nMixpanel proactively contacted all impacted customers. Those who did not receive a communication were not affected.\n\nActions taken by Mixpanel included:\n\n*   Securing affected accounts by revoking active sessions and sign-ins.\n*   Rotating compromised credentials for impacted accounts.\n*   Blocking malicious IP addresses and registering Indicators of Compromise (IOCs).\n*   Performing global password resets for all Mixpanel employees.\n*   Engaging a third-party forensics firm for guidance.\n*   Conducting a forensic review of relevant logs.\n*   Implementing enhanced security controls to prevent similar incidents in the future.\n*   Informing law enforcement and cybersecurity advisors.\n\nImpacted customers were instructed to review the communication from Mixpanel for specific steps taken and any required actions. Non-impacted customers require no action. Mixpanel emphasizes its commitment to security and transparency, offering support via support@mixpanel.com for any questions. The announcement was made by CEO Jen Taylor.\n",
    "chinese_title": "Mixpanel 安全漏洞",
    "chinese_summary": "2025年11月8日，Mixpanel遭遇一起短信诈骗安全事件，导致少量客户帐户遭到未经授权的访问。Mixpanel迅速启动事件响应协议，努力控制漏洞、消除威胁并保护受影响的用户帐户。他们还与外部网络安全专家合作进行补救和响应。\n\nMixpanel主动联系了所有受影响的客户。未收到通知的客户未受影响。\n\nMixpanel采取的行动包括：\n\n*   撤销活动会话和登录，以保护受影响的帐户。\n*   轮换受影响帐户的泄露凭据。\n*   阻止恶意 IP 地址并注册入侵指标 (IOC)。\n*   对所有 Mixpanel 员工执行全局密码重置。\n*   聘请第三方取证公司提供指导。\n*   对相关日志进行取证审查。\n*   实施增强的安全控制，以防止未来发生类似事件。\n*   通知执法部门和网络安全顾问。\n\n受影响的客户被指示查看 Mixpanel 的通知，了解已采取的具体步骤和任何需要采取的行动。未受影响的客户无需采取任何行动。Mixpanel 强调其对安全和透明度的承诺，并通过 support@mixpanel.com 提供支持，解答任何疑问。该公告由 CEO Jen Taylor 发布。"
  },
  {
    "id": "46039106",
    "title": "Interactive λ-Reduction",
    "url": "https://deltanets.org/",
    "summary": "This article provides an interactive environment for exploring λ-reduction, a fundamental process in lambda calculus. The interactive nature suggests users can step through reductions and observe the changes.\n\nThe listed examples highlight various aspects of λ-reduction:\n\n*   **Starter:** likely introduces the basic concepts.\n*   **Lamping A/B:** Suggests examples leveraging Lamping's optimizations related to sharing and efficient reduction.\n*   **List Head:** Demonstrates λ-reduction applied to data structures, specifically lists.\n*   **Ω & Y (Non-Normalizing):** Shows examples that don't terminate, illustrating the potential for non-termination in λ-calculus.\n*   **Two Squared Twice:** A numerical example showcasing computation via λ-reduction.\n*   **Erasure vs Sharing/Replicator Decay:** Explores the effects of different reduction strategies on resource usage.\n*   **Graph Coloring:** Potentially demonstrates λ-calculus's application to graph theory problems.\n*   **Δ-Nets:** A more advanced topic, potentially related to optimization or alternative reduction strategies.\n\nThe mention of \"λ-Calculus (1936+)\" emphasizes the historical context of the topic. The options \"Absolute levels (default), Relative levels, Linear (L), Affine (A), Relevant (I), Full (K), 0/0\" likely refer to different evaluation strategies or restrictions that influence the reduction process and resource management. The GitHub link provides access to the underlying code and likely more detailed documentation.\n\nIn essence, this is a learning resource offering a hands-on approach to understanding λ-reduction and its intricacies through interactive examples and customizable evaluation strategies.\n",
    "chinese_title": "交互式λ演算化简",
    "chinese_summary": "本文提供了一个交互式环境，用于探索λ归约，λ演算中的一个基本过程。这种交互性意味着用户可以逐步执行归约并观察变化。\n\n列出的例子突出了λ归约的各个方面：\n\n*   **入门：** 可能介绍基本概念。\n*   **Lamping A/B：** 表明例子利用了Lamping的优化，与共享和高效归约有关。\n*   **列表头：** 演示了应用于数据结构的λ归约，特别是列表。\n*   **Ω & Y (非正规化)：** 展示了不会终止的例子，说明了λ演算中非终止的可能性。\n*   **两次平方：** 一个数值例子，展示了通过λ归约进行计算。\n*   **擦除 vs 共享/复制器衰减：** 探讨了不同归约策略对资源使用的影响。\n*   **图着色：** 可能演示了λ演算在图论问题中的应用。\n*   **Δ-网络：** 一个更高级的主题，可能与优化或替代归约策略有关。\n\n提及 \"λ演算 (1936+)\" 强调了该主题的历史背景。\"绝对级别（默认）、相对级别、线性 (L)、仿射 (A)、相关 (I)、完全 (K)、0/0\" 等选项可能指的是影响归约过程和资源管理的不同评估策略或限制。GitHub 链接提供了对底层代码的访问权限，并且可能包含更详细的文档。\n\n本质上，这是一个学习资源，通过交互式示例和可定制的评估策略，提供了一种亲身体验的方式来理解λ归约及其复杂性。"
  },
  {
    "id": "46065817",
    "title": "Music eases surgery and speeds recovery, study finds",
    "url": "https://www.bbc.com/news/articles/c231dv9zpz3o",
    "summary": "A recent Indian study published in the journal *Music and Medicine* found that playing music during surgery under general anesthesia can ease the procedure and speed recovery. Researchers at Delhi's Maulana Azad Medical College and Lok Nayak Hospital discovered that patients who listened to calming instrumental music through headphones during laparoscopic gallbladder removal required lower doses of anesthetic drugs, specifically propofol and fentanyl.\n\nThe study involved 56 adults who were randomly assigned to two groups, both receiving a standard five-drug regimen. One group listened to calming music (flute or piano) while the other did not. The music group experienced smoother recoveries, lower stress hormone (cortisol) levels, and better blood pressure control during surgery.\n\nResearchers believe that even under anesthesia, the auditory pathway remains active, allowing the brain to register music and quiet the body's stress response to surgery. This stress response, characterized by increased heart rate, hormone surges, and blood pressure spikes, can hinder recovery and worsen inflammation. By mitigating this response with music, patients can wake up more quickly and clearly, potentially leading to earlier discharge and improved pain management.\n\nThe study highlights the potential of non-pharmacological interventions like music to humanize the operating room and improve surgical wellbeing. Although music therapy is established in other medical fields, its integration into anesthesia represents a new frontier, suggesting that simple interventions can positively influence patient outcomes. The team plans to further explore music-aided sedation in future studies.\n",
    "chinese_title": "音乐能减轻手术痛苦，加速康复，研究发现",
    "chinese_summary": "最近发表在《音乐与医学》杂志上的一项印度研究发现，在全身麻醉手术期间播放音乐可以减轻手术过程并加速恢复。德里莫拉纳·阿扎德医学院和洛克·纳亚克医院的研究人员发现，在腹腔镜胆囊切除术期间通过耳机聆听舒缓器乐的患者，需要更低剂量的麻醉药物，特别是丙泊酚和芬太尼。\n\n该研究涉及 56 名成年人，他们被随机分为两组，都接受了标准的五种药物治疗方案。一组聆听舒缓的音乐（长笛或钢琴），另一组没有。听音乐组经历了更平稳的恢复，更低的应激激素（皮质醇）水平，以及在手术期间更好的血压控制。\n\n研究人员认为，即使在麻醉状态下，听觉通路仍然活跃，使大脑能够感知音乐并平息身体对手术的应激反应。这种应激反应的特点是心率加快、激素激增和血压飙升，会阻碍恢复并加剧炎症。通过用音乐减轻这种反应，患者可以更快、更清醒地醒来，从而可能导致更早的出院和更好的疼痛管理。\n\n这项研究强调了诸如音乐之类的非药物干预措施在人性化手术室和改善手术福祉方面的潜力。尽管音乐疗法已在其他医学领域得到确立，但将其整合到麻醉中代表着一个新的领域，表明简单的干预措施可以对患者的治疗结果产生积极影响。该团队计划在未来的研究中进一步探索音乐辅助镇静。"
  },
  {
    "id": "46025911",
    "title": "G0-G3 corners, visualised: learn what \"Apple corners\" are",
    "url": "https://www.printables.com/model/1490911-g0-g3-corners-visualised-learn-what-apple-corners",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "G0-G3圆角可视化：了解什么是“苹果圆角”",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "46005239",
    "title": "The Concrete Pontoons of Bristol",
    "url": "https://thecretefleet.com/blog/f/the-concrete-pontoons-of-bristol",
    "summary": "This excerpt introduces \"The Concrete Pontoons of Bristol\" as part of a larger online resource dedicated to concrete ships. It's hosted on \"The Crete Fleet,\" a website focusing on World War I and World War II concrete ships and components of the Mulberry Harbour. The site offers an encyclopedia, blogs, and videos related to concrete ships. The provided text emphasizes copyright protection and the use of cookies for website traffic analysis and optimization, requesting user acceptance of cookie usage and data aggregation. In essence, the article itself is not summarized here, but rather the framework of the website that *contains* the article is described.\n",
    "chinese_title": "布里斯托尔的水泥浮桥",
    "chinese_summary": "这段摘录将“布里斯托尔的混凝土浮筒”作为关于混凝土船只的更大在线资源的一部分进行介绍。它托管在“克里特舰队”网站上，该网站专注于一战和二战时期的混凝土船只以及马尔贝里港的组成部分。该网站提供与混凝土船只相关的百科全书、博客和视频。提供的文本强调了版权保护以及使用Cookie进行网站流量分析和优化，并请求用户接受Cookie的使用和数据汇总。本质上，这里没有总结文章本身，而是描述了*包含*该文章的网站的框架。"
  },
  {
    "id": "46039387",
    "title": "Willis Whitfield: Creator of clean room technology still in use today (2024)",
    "url": "https://www.sandia.gov/labnews/2024/04/04/willis-whitfield-a-simple-man-with-a-simple-solution-that-changed-the-world/",
    "summary": "Willis Whitfield, a physicist at Sandia National Laboratories, invented the modern clean room in 1961, revolutionizing manufacturing and various other fields. Frustrated by particulate contamination affecting the production of complex parts, Whitfield conceived the idea of laminar-flow, which involves constantly sweeping a room with highly filtered air to remove particles. This concept dramatically reduced particle counts, exceeding the cleanliness of existing clean rooms by a factor of 1,000.\n\nWhitfield's design, sketched on an airplane tablet, became the basis for clean rooms used in electronics, pharmaceuticals, healthcare, and aerospace. His invention was patented in 1964 and quickly adopted by major industries.\n\nKnown for his humility and willingness to credit his team, Whitfield also contributed to other projects, including sewage treatment and spacecraft sterilization. He worked at Sandia for 30 years.\n\nWhitfield died in 2012. In 2014, he was inducted into the National Inventors Hall of Fame and honored with a statue at Sandia. His invention continues to be essential in countless applications today.\n",
    "chinese_title": "威利斯·惠特菲尔德：当今仍在使用的洁净室技术创造者 (2024)",
    "chinese_summary": "桑迪亚国家实验室的物理学家威利斯·惠特菲尔德于1961年发明了现代洁净室，彻底改变了制造业和诸多其他领域。由于颗粒物污染影响复杂部件的生产，惠特菲尔德构思了层流的概念，即通过高过滤空气不断吹扫房间以去除颗粒物。这一概念大大降低了颗粒物数量，使洁净度比现有洁净室提高了1000倍。\n\n惠特菲尔德在飞机平板电脑上绘制的设计图，成为了电子、制药、医疗保健和航空航天领域所用洁净室的基础。他的发明于1964年获得专利，并迅速被各大行业采用。\n\n惠特菲尔德以谦逊和乐于赞扬团队而闻名，他还为包括污水处理和航天器消毒在内的其他项目做出了贡献。他在桑迪亚工作了30年。\n\n惠特菲尔德于2012年去世。2014年，他入选美国国家发明家名人堂，并在桑迪亚竖立了一座雕像以示纪念。他的发明在当今无数应用中仍然至关重要。"
  },
  {
    "id": "46060508",
    "title": "Gemini CLI Tips and Tricks for Agentic Coding",
    "url": "https://github.com/addyosmani/gemini-cli-tips",
    "summary": "This article is a comprehensive guide to using the Gemini CLI, an open-source AI assistant that brings Google's Gemini model to your terminal for agentic coding. It acts as a supercharged pair programmer, excelling at coding tasks, debugging, content generation, and system automation through natural language prompts.\n\nThe article provides detailed instructions for setting up Gemini CLI with either a Google Account or an API key. The bulk of the guide is dedicated to ~30 pro tips, offering insights into advanced usage and hidden features. Key tips include:\n\n*   **Persistent Context (GEMINI.md):** Create a `GEMINI.md` file with project-specific instructions for the AI to remember.\n*   **Custom Slash Commands:** Define reusable prompt templates in TOML files to automate repetitive tasks.\n*   **MCP Servers:** Extend Gemini's capabilities by integrating with external systems or custom tools through custom Model Context Protocol (MCP) servers.\n*   **Memory Addition & Recall:** Use `/memory add` to store important facts for later reference.\n*   **Checkpointing:** Use `/checkpoint` and `/restore` for undo functionality.\n*   **File Referencing:** Use `@` to reference files and images for explicit context.\n*   **Passthrough Shell Commands:** Execute shell commands directly with `!`\n\nThe article also covers tips for system troubleshooting, running Gemini CLI in headless mode, managing chat sessions, utilizing multimodal AI, customizing the CLI with settings, integrating with IDEs, and automating repository tasks with GitHub Actions. It emphasizes the importance of security when using custom MCP tools and provides best practices for organizing projects and workflows with Gemini CLI.\n",
    "chinese_title": "Gemini CLI Agentic 编码技巧",
    "chinese_summary": "本文全面介绍了 Gemini CLI 的使用方法，这是一款开源 AI 助手，可将 Google 的 Gemini 模型引入您的终端进行自主编码。它充当了一个超级强大的结对程序员，擅长编码任务、调试、内容生成以及通过自然语言提示实现系统自动化。\n\n本文提供了使用 Google 账户或 API 密钥设置 Gemini CLI 的详细说明。本指南的大部分内容专门介绍了大约 30 条专业技巧，提供了对高级用法和隐藏功能的见解。 主要技巧包括：\n\n*   **持久上下文 (GEMINI.md):** 创建一个 `GEMINI.md` 文件，其中包含项目特定的说明，以便 AI 记住。\n*   **自定义斜杠命令：** 在 TOML 文件中定义可重用的提示模板，以自动化重复性任务。\n*   **MCP 服务器：** 通过自定义模型上下文协议 (MCP) 服务器，集成外部系统或自定义工具，从而扩展 Gemini 的功能。\n*   **记忆添加与召回：** 使用 `/memory add` 存储重要事实以供日后参考。\n*   **检查点：** 使用 `/checkpoint` 和 `/restore` 实现撤消功能。\n*   **文件引用：** 使用 `@` 引用文件和图像以获得明确的上下文。\n*   **直通 Shell 命令：** 使用 `!` 直接执行 Shell 命令。\n\n本文还介绍了系统故障排除、以无头模式运行 Gemini CLI、管理聊天会话、利用多模态 AI、使用设置自定义 CLI、与 IDE 集成以及使用 GitHub Actions 自动化存储库任务的技巧。它强调了在使用自定义 MCP 工具时的安全性，并提供了使用 Gemini CLI 组织项目和工作流程的最佳实践。"
  },
  {
    "id": "46069598",
    "title": "Show HN: SyncKit – Offline-first sync engine (Rust/WASM and TypeScript)",
    "url": "https://github.com/Dancode-188/synckit",
    "summary": "SyncKit is presented as a production-ready, offline-first sync engine designed to simplify building local-first applications. It allows developers to add real-time sync functionality to their apps with minimal code, resolving the complexity and costs associated with building sync from scratch or using existing solutions like Firebase, Supabase, or Yjs.\n\nKey benefits of SyncKit include true offline operation, a small bundle size (~59KB gzipped, with a ~45KB lite version), open-source and self-hostable nature, fast performance, and guaranteed data integrity through conflict resolution and formal verification.\n\nSyncKit offers features like real-time collaboration, network protocol support, IndexedDB persistence, and cross-tab sync. Future versions promise text CRDTs, counters, and sets. It differentiates itself by being truly offline-first (unlike Firebase/Supabase), offering a multi-language server (unlike Yjs), and providing a smaller bundle and faster performance than Automerge.\n\nThe post details a quick start guide, core capabilities, framework integration (React hooks), architecture overview, and comparisons with competing solutions. It emphasizes SyncKit's suitability for various use cases, from simple object sync to collaborative text editing and custom CRDTs. The roadmap includes features like multi-language server support and advanced storage options.  The article concludes with contribution guidelines, enterprise support information, benchmarks demonstrating its performance and bundle size advantages, and acknowledgments of inspirations.\n",
    "chinese_title": "Show HN: SyncKit – 离线优先同步引擎 (Rust/WASM 与 TypeScript)",
    "chinese_summary": "SyncKit是一个生产就绪的、离线优先的同步引擎，旨在简化本地优先应用程序的构建。它允许开发者以最少的代码为他们的应用添加实时同步功能，解决了从头构建同步或使用现有解决方案（如Firebase、Supabase或Yjs）所带来的复杂性和成本。\n\nSyncKit的关键优势包括真正的离线操作、小巧的软件包体积（压缩后约59KB，精简版约45KB）、开源和自托管特性、快速的性能，以及通过冲突解决和形式验证来保证的数据完整性。\n\nSyncKit提供诸如实时协作、网络协议支持、IndexedDB持久化和跨标签页同步等功能。未来版本承诺提供文本CRDT、计数器和集合。它通过真正地离线优先（不同于Firebase/Supabase）、提供多语言服务器（不同于Yjs）以及提供比Automerge更小的软件包和更快的性能来突出自身优势。\n\n该文章详细介绍了快速入门指南、核心功能、框架集成（React hooks）、架构概述以及与竞争解决方案的比较。它强调了SyncKit适用于各种用例，从简单的对象同步到协作文本编辑和自定义CRDT。路线图包括多语言服务器支持和高级存储选项等功能。文章最后介绍了贡献指南、企业支持信息、展示其性能和软件包大小优势的基准测试，以及对灵感的致谢。"
  },
  {
    "id": "46061682",
    "title": "S&box is now an open source game engine",
    "url": "https://sbox.game/news/update-25-11-26",
    "summary": "The article, titled \"S&box is now an open source game engine,\" announces that S&box, a successor to Garry's Mod, has transitioned to an open-source model. This is a significant change for the platform, meaning the engine's source code is now publicly available.\n\nWhile the article is extremely brief, this shift likely means developers and community members can now contribute to the development of S&box, modify its core functionalities, and potentially create custom engine versions. This increased accessibility and community involvement could lead to faster innovation, bug fixes, and a broader range of features. Open-sourcing the engine suggests a commitment to transparency and collaborative development, potentially attracting a larger developer base and fostering a more robust and adaptable platform for creating and sharing games and experiences. The name \"s&box\" is explicitly mentioned as the subject of this announcement.\n",
    "chinese_title": "S&box现在是一个开源游戏引擎",
    "chinese_summary": "文章：《S&box现已开源游戏引擎》宣布，Garry's Mod的继任者S&box已转型为开源模式。这对该平台而言是一项重大变革，意味着引擎的源代码现在已公开可用。\n\n虽然文章非常简短，但这一转变可能意味着开发者和社区成员现在可以为S&box的开发做出贡献，修改其核心功能，并可能创建自定义引擎版本。这种更高的可访问性和社区参与度可能会带来更快的创新、错误修复和更广泛的功能。引擎的开源表明了对透明度和协作开发的承诺，可能会吸引更大的开发者群体，并培养一个更强大、更具适应性的平台，用于创建和分享游戏和体验。“s&box”这个名称被明确提及，作为此公告的主题。"
  },
  {
    "id": "46063272",
    "title": "Running Unsupported iOS on Deprecated Devices",
    "url": "https://nyansatan.github.io/run-unsupported-ios/",
    "summary": "This article details the process of running unsupported iOS 6 on an iPod touch 3, a device officially limited to iOS 5.1.1. The author outlines the key iOS components: iBoot, Kernelcache, DeviceTree, Userspace filesystem, and firmwares.\n\nThe initial approach involved modifying the DeviceTree, the structured list of hardware used by a specific device, and iBoot, the bootloader, from an iPhone 3GS (which supported iOS 6) for compatibility with the iPod touch 3. A Python script was created to compare and apply DeviceTree differences. iBoot modifications included signature checks, boot-args injection, and dynamically populating nvram-proxy-data, an NVRAM dump property, and debug-enabled patch.\n\nThe most challenging aspect was creating a compatible Kernelcache, the OS kernel and kernel extensions. Dynamically loading kexts (kernel extensions) proved unsuccessful, leading to the approach of creating a prelinked kernelcache using tools from older Mac OS X versions. This involved using \"kcgen\" to combine the kernel and kexts, stripping unnecessary data, and compressing the result.\n\nThe process also required modifying the Restore ramdisk filesystem to install an iBoot exploit, as well as the Root filesystem, which included adding hardware feature plists, merging Home screen layouts, adding firmwares, and patching the FairPlay daemon. DYLD shared cache patches were necessary to address Product ID mismatches and device variant determination. Finally, fixing the code signature of the shared cache files was done by recalculating SHA-1 hashes for modified pages.\n\nThe author concludes that the process, while challenging, was achievable, and suggests future work could involve jailbreaking the modified system and applying similar techniques to other deprecated devices like the iPad 1.\n",
    "chinese_title": "在过时设备上运行不受支持的 iOS",
    "chinese_summary": "本文详细介绍了在iPod touch 3上运行不受支持的iOS 6的过程，该设备官方限制为iOS 5.1.1。作者概述了关键的iOS组件：iBoot、内核缓存（Kernelcache）、设备树（DeviceTree）、用户空间文件系统和固件。\n\n最初的方法包括修改设备树（特定设备使用的硬件结构化列表）和iBoot（引导加载程序），使其从支持iOS 6的iPhone 3GS兼容iPod touch 3。创建了一个Python脚本来比较和应用设备树差异。iBoot的修改包括签名检查、boot-args注入、动态填充nvram-proxy-data（NVRAM转储属性）和启用调试补丁。\n\n最具挑战性的方面是创建兼容的内核缓存（操作系统内核和内核扩展）。动态加载kexts（内核扩展）被证明是不成功的，因此采用了使用旧版Mac OS X中的工具创建预链接内核缓存的方法。这涉及到使用“kcgen”来组合内核和kexts，剥离不必要的数据，并压缩结果。\n\n该过程还需要修改Restore ramdisk文件系统以安装iBoot漏洞，以及Root文件系统，其中包括添加硬件功能plist、合并Home屏幕布局、添加固件和修补FairPlay守护进程。需要DYLD共享缓存补丁来解决产品ID不匹配和设备变体确定的问题。最后，通过重新计算已修改页面的SHA-1哈希值来修复共享缓存文件的代码签名。\n\n作者总结说，这个过程虽然具有挑战性，但却是可以实现的，并建议未来的工作可以包括越狱修改后的系统，并将类似的技术应用于其他已弃用的设备，如iPad 1。"
  },
  {
    "id": "46021490",
    "title": "'Turncoat' by Dennis Sewell Review",
    "url": "https://www.historytoday.com/archive/review/turncoat-dennis-sewell-review",
    "summary": "Jackie Eales' review of Dennis Sewell's \"Turncoat: Roundhead to Royalist, the Double Life of Cromwell's Spy\" explores the intriguing life of George Downing, a figure largely overlooked in history despite his significant role in 17th-century England. The biography delves into Downing's remarkable ability to navigate the tumultuous political landscape, serving both Oliver Cromwell and Charles II with equal success.\n\nBorn into a Puritan family with connections to the Massachusetts Bay Colony, Downing's early life saw him educated at Harvard before becoming a chaplain in the New Model Army. He quickly rose through the ranks, becoming Cromwell's scoutmaster general, employing spy networks and turning opponents into informers. His adeptness at gathering intelligence proved crucial in securing Cromwell's power.\n\nFollowing the Restoration, Downing cleverly transitioned to serving Charles II, maintaining his diplomatic post in The Hague. Sewell speculates on how Downing managed this feat, suggesting possibilities from secret meetings to blackmail. A particularly egregious act was Downing's orchestration of the kidnapping and extradition of regicides, including his former colleague John Okey.\n\nDowning's service to Charles II brought him wealth, a baronetcy, and significant influence. He advised on American affairs, including the acquisition of New York. Despite his success, he was also suspected of corruption and regarded with disdain by some, including Samuel Pepys.\n\nWhile Sewell's biography sheds light on Downing's political maneuvering and spycraft, Eales notes that Downing's personal life remains elusive. The book offers a compelling portrait of a secretive and morally ambiguous figure who played a pivotal role in shaping 17th-century England.\n",
    "chinese_title": "丹尼斯·休厄尔《叛徒》书评",
    "chinese_summary": "杰基·伊尔斯评丹尼斯·休厄尔《变节者：从圆颅党到保皇党，克伦威尔间谍的双面人生》一书，探讨了乔治·唐宁引人入胜的一生。尽管唐宁在17世纪的英国扮演了重要角色，但他在很大程度上被历史所忽视。这本传记深入研究了唐宁在动荡的政治环境中游刃有余的能力，他以同样的成功为奥利弗·克伦威尔和查理二世效力。\n\n唐宁出生于一个与马萨诸塞湾殖民地有关联的清教徒家庭，早年在哈佛接受教育，之后成为新模范军的牧师。他迅速晋升，成为克伦威尔的侦察总长，雇佣间谍网络并将对手变成告密者。他收集情报的能力被证明对巩固克伦威尔的权力至关重要。\n\n在王政复辟之后，唐宁巧妙地过渡到为查理二世服务，并继续担任他在海牙的外交职位。休厄尔推测唐宁是如何做到这一点的，提出了从秘密会议到敲诈勒索等可能性。一个特别令人发指的行为是唐宁策划绑架和引渡弑君者，包括他的前同事约翰·奥基。\n\n唐宁为查理二世服务给他带来了财富、从男爵爵位和重大影响力。他为美国事务提供建议，包括收购纽约。尽管他取得了成功，但他也被怀疑腐败，并受到一些人的鄙视，包括塞缪尔·佩皮斯。\n\n虽然休厄尔的传记揭示了唐宁的政治手腕和间谍活动，但伊尔斯指出，唐宁的个人生活仍然难以捉摸。这本书描绘了一个引人注目的、秘密且道德上模棱两可的人物，他在塑造17世纪的英国方面发挥了关键作用。"
  },
  {
    "id": "46065698",
    "title": "Coq: The World's Best Macro Assembler? (2013) [pdf]",
    "url": "https://nickbenton.name/coqasm.pdf",
    "summary": "This 2013 PDF document, provocatively titled \"Coq: The World's Best Macro Assembler?\", explores the unconventional use of the Coq proof assistant, a system primarily designed for verifying mathematical theorems, as a macro assembler.\n\nWhile not a traditional assembler, the paper likely investigates how Coq's powerful type system and proof capabilities can be leveraged to rigorously define and manipulate low-level code representations. This could involve formally specifying instruction set architectures (ISAs) and then generating machine code from higher-level specifications, while simultaneously proving the correctness of the generated code.\n\nThe title suggests a perhaps tongue-in-cheek exploration, highlighting the potential for Coq to offer stronger guarantees about the correctness and safety of assembled code compared to traditional assemblers.  Using Coq ensures that the generated machine code adheres to formal specifications. This is especially appealing in high-assurance systems where code correctness is critical. It likely discusses the challenges of using a proof assistant for this purpose, such as the steep learning curve, the complexity of formalizing assembly code semantics, and the potentially high compilation times. It emphasizes correctness guarantees.\n",
    "chinese_title": "Coq：世界最佳宏汇编器？(2013) [pdf]",
    "chinese_summary": "这篇 2013 年的 PDF 文档，标题颇具挑衅意味：“Coq：世界上最好的宏汇编器？”，探讨了 Coq 证明助手（一种主要用于验证数学定理的系统）作为宏汇编器的非传统用法。\n\n虽然并非传统汇编器，该论文可能研究了如何利用 Coq 强大的类型系统和证明能力来严格定义和操作底层代码表示。这可能涉及正式指定指令集架构 (ISA)，然后从更高级别的规范生成机器代码，同时证明生成代码的正确性。\n\n该标题暗示了一种可能带有玩笑意味的探索，强调了与传统汇编器相比，Coq 在保证汇编代码的正确性和安全性方面的潜力。 使用 Coq 可确保生成的机器代码符合正式规范。这在代码正确性至关重要的高保证系统中尤其具有吸引力。 它可能讨论了为此目的使用证明助手的挑战，例如陡峭的学习曲线、形式化汇编代码语义的复杂性以及潜在的高编译时间。 它强调正确性保证。"
  },
  {
    "id": "46068777",
    "title": "The State of GPL Propagation to AI Models",
    "url": "https://shujisado.org/2025/11/27/gpl-propagates-to-ai-models-trained-on-gpl-code/",
    "summary": "This brief article snippet highlights a critical legal discrepancy regarding the interpretation of Open Source licenses, particularly focusing on its potential impact on the propagation of licenses like the GPL in the context of AI models. While Japan and the EU generally consider Open Source licenses as legally binding contracts, the United States, where Open Source originated, historically views them as \"unilateral permissions.\" This distinction is crucial. If Open Source licenses are treated as permissions rather than contracts in the US, it potentially weakens their enforcement, especially concerning the \"copyleft\" aspects of licenses like the GPL which require derivative works to also be licensed under the GPL. This means that AI models trained on GPL-licensed code in the US might be argued not to be bound by the GPL, allowing for the closed-source commercialization of models derived from Open Source materials. The article implicitly suggests that this difference in legal interpretation could significantly impact the future of Open Source licensing and its effectiveness in ensuring the continued openness and accessibility of AI technology.\n",
    "chinese_title": "GPL协议在人工智能模型中的传播状况",
    "chinese_summary": "开源许可法律解释差异及其对人工智能模型的影响"
  },
  {
    "id": "45998044",
    "title": "Closest Harmonic Number to an Integer",
    "url": "https://www.johndcook.com/blog/2025/11/19/closest-harmonic-number-to-an-integer/",
    "summary": "This article addresses the problem of finding the harmonic number (Hn) closest to a given integer (m). Since harmonic numbers are never integers for n > 1, the goal is to identify the 'n' that minimizes the difference between Hn and m.\n\nThe challenge lies in efficiently calculating harmonic numbers, especially for large 'n'. The article proposes a hybrid approach: direct calculation (sum of reciprocals) for small 'n' (< 1000) and an asymptotic approximation using the Euler-Mascheroni constant (γ) for larger 'n'. This approximation balances accuracy and computational speed.\n\nTo find the optimal 'n', the code first estimates a starting point using the approximation n ≈ exp(m - γ). It then iterates around this guess, increasing or decreasing 'n' until Hn brackets the target value 'm'. Finally, it precisely searches the bracketed range to identify the 'n' that minimizes the absolute difference between Hn and m.\n\nThe provided Python code implements this approach, including both the direct calculation and asymptotic approximation functions for Hn, as well as the function `nearest_harmonic_number(m)` to find the closest harmonic number. The article demonstrates the use of the code with examples, illustrating how to find the harmonic number closest to both an integer (10) and a real number (√20).\n",
    "chinese_title": "最接近整数的调和数",
    "chinese_summary": "本文探讨了寻找最接近给定整数 (m) 的调和数 (Hn) 的问题。由于当 n > 1 时，调和数永远不是整数，因此目标是确定使 Hn 与 m 之间差异最小的 'n'。\n\n挑战在于高效计算调和数，尤其是在 'n' 很大时。本文提出了一种混合方法：对于较小的 'n' (< 1000)，采用直接计算（倒数和）的方式，对于较大的 'n'，则使用欧拉-马斯刻若尼常数 (γ) 进行渐近近似。这种近似方法平衡了准确性和计算速度。\n\n为了找到最佳的 'n'，代码首先使用近似公式 n ≈ exp(m - γ) 估计一个起始点。然后，围绕此猜测进行迭代，增加或减少 'n'，直到 Hn 夹住目标值 'm'。最后，它精确地搜索这个夹住的范围，以确定使 Hn 与 m 之间绝对差最小的 'n'。\n\n提供的 Python 代码实现了这种方法，包括 Hn 的直接计算和渐近近似函数，以及用于查找最接近的调和数的函数 `nearest_harmonic_number(m)`。文章通过示例演示了代码的使用方法，说明了如何找到最接近整数 (10) 和实数 (√20) 的调和数。"
  },
  {
    "id": "46064680",
    "title": "Functional Data Structures and Algorithms: a Proof Assistant Approach",
    "url": "https://fdsa-book.net/",
    "summary": "This ACM Books publication, \"Functional Data Structures and Algorithms: A Proof Assistant Approach,\" introduces data structures and algorithms within the context of functional programming. A key distinguishing feature is its emphasis on rigorous proofs of both functional correctness and running time analysis. These proofs are presented in a unified style using inductive reasoning about functional programs and their performance characteristics.\n\nImportantly, all proofs presented in the book have been formally verified using the Isabelle proof assistant. The PDF version of the book includes links to the corresponding Isabelle theories, allowing readers to examine the machine-checked proofs directly.\n\nThe book is intended to be a living document, evolving over time with contributions from the community. The authors encourage readers to engage with the material and contribute to its ongoing development. The target audience are those interested in learning about data structures and algorithms in the functional programming paradigm, with a particular focus on formal verification using proof assistants. The book offers a unique perspective by integrating correctness and performance analysis within a single, provable framework.\n",
    "chinese_title": "函数式数据结构与算法：一种证明助手方法",
    "chinese_summary": "函数式数据结构与算法：一种证明助手方法\n\n这本ACM Books出版物《函数式数据结构与算法：一种证明助手方法》在函数式编程的背景下介绍了数据结构和算法。其主要特点是强调对功能正确性和运行时间分析进行严格的证明。这些证明以统一的风格呈现，使用关于函数式程序及其性能特征的归纳推理。\n\n重要的是，书中提出的所有证明都已使用Isabelle证明助手进行了正式验证。本书的PDF版本包含指向相应Isabelle理论的链接，允许读者直接检查机器验证的证明。\n\n本书旨在成为一份不断发展的文档，随着社区的贡献而不断演变。作者鼓励读者参与其中，并为本书的持续发展做出贡献。目标读者是对在函数式编程范式中学习数据结构和算法感兴趣的人，尤其侧重于使用证明助手进行形式验证。本书通过在一个可证明的框架内集成正确性和性能分析，提供了一种独特的视角。"
  },
  {
    "id": "46057488",
    "title": "Voyager 1 is about to reach one light-day from Earth",
    "url": "https://scienceclock.com/voyager-1-is-about-to-reach-one-light-day-from-earth/",
    "summary": "NASA's Voyager 1, launched in 1977, is poised to reach a milestone: by November 15, 2026, it will be one light-day from Earth, a distance of 16.1 billion miles (25.9 billion km). This means radio signals will take a full 24 hours to reach the spacecraft. Voyager 1, the most distant human-made object, entered interstellar space in 2012.\n\nTraveling at roughly 11 miles per second (17.7 km/s), it adds about 3.5 astronomical units to its distance annually. Despite its age and the harsh conditions of space, Voyager 1 continues to transmit data thanks to its radioisotope thermoelectric generators, expected to last into the 2030s.\n\nCommunication is a slow process, with commands taking a day to arrive and another day for confirmation, contrasting sharply with the communication times to closer destinations like the Moon, Mars, and Pluto. The article highlights the sheer scale of space, noting that even traveling at light speed to our nearest star, Proxima Centauri, would take over four years.\n\nBeyond its distance record, Voyager 1's mission includes significant achievements such as planetary flybys and the famous 'Pale Blue Dot' image, underscoring the vastness of our solar system and the spacecraft's remarkable longevity.\n",
    "chinese_title": "旅行者1号即将到达距离地球一光天之处。",
    "chinese_summary": "美国宇航局的旅行者1号于1977年发射，即将达到一个里程碑：到2026年11月15日，它将到达距离地球一光日的位置，即161亿英里（259亿公里）。这意味着无线电信号需要整整24小时才能到达该探测器。旅行者1号是距离地球最远的人造物体，于2012年进入星际空间。\n\n它以大约每秒11英里（17.7公里/秒）的速度飞行，每年增加大约3.5个天文单位的距离。尽管历史悠久且太空环境恶劣，旅行者1号仍在不断传输数据，这要归功于它的放射性同位素温差发电机，预计可持续到2030年代。\n\n通信是一个缓慢的过程，指令需要一天才能到达，确认又需要一天，这与到达月球、火星和冥王星等较近目的地的通信时间形成鲜明对比。这篇文章强调了太空的巨大尺度，指出即使以光速飞往我们最近的恒星——比邻星，也需要四年多的时间。\n\n除了它的距离记录之外，旅行者1号的任务还包括重要的成就，例如行星飞越和著名的“暗淡蓝点”图像，突出了我们太阳系的浩瀚和该探测器非凡的寿命。"
  },
  {
    "id": "46066255",
    "title": "Last Issue of \"ECMAScript News\"",
    "url": "https://ecmascript.news/archive/es-next-news-2025-11-26.html",
    "summary": "\"ECMAScript News\" is ceasing publication due to financial losses caused by a decline in advertisers and subscribers over the past two years. The newsletter, which began on September 27, 2016, published a total of 368 issues. The editors express gratitude to their loyal readers for their support throughout the years. There's a possibility that Axel, one of the creators, might revive the newsletter in a different format in 2026, in which case subscribers will receive one last email notification.\n",
    "chinese_title": "“ECMAScript新闻”最后一期",
    "chinese_summary": "ECMAScript新闻因过去两年广告商和订阅者数量下降造成的财务亏损而停止出版。该新闻通讯于2016年9月27日开始发行，共出版了368期。编辑们对忠实读者多年来的支持表示感谢。创始人之一Axel有可能在2026年以不同形式恢复该新闻通讯，届时订阅者将收到最后一封邮件通知。"
  },
  {
    "id": "46020193",
    "title": "A Fast 64-Bit Date Algorithm (30–40% faster by counting dates backwards)",
    "url": "https://www.benjoffe.com/fast-date-64",
    "summary": "This article introduces a new, very fast 64-bit date algorithm that is 30-40% faster than previous leading algorithms by counting dates backwards. The algorithm boasts achieving date conversion using only four multiplications, a significant reduction compared to the seven or more used by earlier methods.\n\nThe speed increase is attributed to three key innovations: calculating years backwards from an epoch in 2400, skipping the day-of-year calculation using a year-modulus-bitshift technique, and utilizing a \"Julian Map\" to accelerate the 100/400 year calculation. Counting backwards allows for removal of terms like \"+3\" due to leap year alignments, which typically occur in forward counting.\n\nThe algorithm offers accurate results across a ±1.89 trillion-year range, suitable for full UNIX 64-bit time. The article provides pseudocode, a detailed line-by-line explanation, and discusses platform-specific optimizations for x64 and ARM processors. It also delves into range/accuracy considerations and 32-bit fallback options. Benchmark results comparing this algorithm's speed against C++ Boost and Neri-Schneider are provided, highlighting its performance advantage based on reduced CPU cycle counts. Finally, the author emphasizes the importance of understanding underlying principles to achieve significant speed improvements.\n",
    "chinese_title": "一种快速的64位日期算法 (通过倒数日期提高30–40%的速度)",
    "chinese_summary": "本文介绍了一种新型、非常快速的64位日期算法，通过倒数日期的方式，比以往领先的算法快30-40%。该算法仅使用四次乘法即可完成日期转换，与早期方法使用的七次或更多次乘法相比，这是一个显著的减少。\n\n速度提升归功于三个关键创新：从2400年的纪元开始倒算年份、使用年份模数位移技术跳过一年中的日期计算，以及利用“儒略图”加速100/400年的计算。倒数允许去除诸如“+3”之类的因闰年对齐而产生的项，这些项通常出现在正数中。\n\n该算法在±1.89万亿年的范围内提供准确的结果，适用于完整的UNIX 64位时间。本文提供了伪代码、详细的逐行解释，并讨论了针对x64和ARM处理器的特定于平台的优化。它还深入研究了范围/准确性考虑因素和32位回退选项。提供了将该算法的速度与C++ Boost和Neri-Schneider进行比较的基准测试结果，突出了其基于减少CPU周期数的性能优势。最后，作者强调了理解基本原理对于实现显著速度提升的重要性。"
  },
  {
    "id": "46070982",
    "title": "Seagate achieves 6.9TB storage capacity per platter",
    "url": "https://www.tomshardware.com/pc-components/hdds/seagate-achieves-a-whopping-6-9tb-storage-capacity-per-platter-in-its-laboratory-55tb-to-69tb-hard-drives-now-physically-possible",
    "summary": "Seagate has achieved a breakthrough in hard drive technology, developing a 6.9TB storage capacity per platter in its laboratory. This advancement could potentially lead to 55TB to 69TB hard drives. The technology relies on heat-assisted magnetic recording (HAMR) combined with Mozaic 3+ to reduce media grain size, enabling denser data storage.\n\nHowever, these high-capacity platters are still in development and are not expected to be implemented in commercial products until 2030. Before that, Seagate plans to release drives with 4TB, 5TB, and 6TB platters in 2027, 2028, and 2029, respectively, with projections of 7TB-15TB platters available from 2031 onwards, possibly leading to petabyte-sized drives before 2040.\n\nDespite the growing popularity of SSDs, hard drives remain crucial for long-term, high-capacity storage, particularly in data centers, due to their reliability and cost-effectiveness. The AI boom has further increased demand for hard drives, creating backorders for manufacturers. Currently, a 24TB Seagate BarraCuda is discounted to $239.99.\n",
    "chinese_title": "希捷实现单碟6.9TB存储容量",
    "chinese_summary": "希捷硬盘技术获突破：单碟容量达6.9TB，或催生55TB-69TB硬盘。该技术结合了热辅助磁记录（HAMR）和Mozaic 3+以减小介质晶粒尺寸，实现更高密度的数据存储。\n\n然而，这些高容量盘片仍在开发中，预计到2030年才能应用于商业产品。在此之前，希捷计划分别在2027年、2028年和2029年推出4TB、5TB和6TB盘片的硬盘，并预计从2031年起推出7TB-15TB的盘片，可能在2040年前问世PB级硬盘。\n\n尽管固态硬盘（SSD）越来越受欢迎，但由于其可靠性和成本效益，硬盘仍然是长期、高容量存储的关键，尤其是在数据中心。人工智能的蓬勃发展进一步增加了对硬盘的需求，导致制造商的订单积压。目前，希捷24TB酷鱼硬盘的折扣价为239.99美元。"
  },
  {
    "id": "46070151",
    "title": "Protect Public School Students from Surveillance of Off-Campus Speech",
    "url": "https://www.eff.org/deeplinks/2025/11/eff-arizona-federal-court-protect-public-school-students-surveillance-and",
    "summary": "This article discusses the case of *Merrill v. Marana Unified School District*, where a high school student was suspended for a joke he drafted (but never sent) in an email on his school-issued Chromebook while at home. The school used Gaggle surveillance software to flag the \"threat.\" The EFF (Electronic Frontier Foundation) filed an amicus brief arguing against the school district's claim that using a school-issued device automatically equates to being \"on campus\" and thus subject to school regulations on speech.\n\nThe EFF emphasizes that such a broad interpretation infringes on students' First Amendment rights and digital privacy, leading to self-censorship and chilling effects on free expression. They argue that students need private digital spaces, free from constant surveillance.\n\nThe brief further highlights potential inequities, as lower-income students relying on school devices would face greater surveillance and stricter speech regulations compared to wealthier students who can afford personal devices. This creates a \"pay for privacy\" system. Moreover, it argues that this rule incentivizes invasive surveillance practices and overlooks the inaccuracies and harms associated with student surveillance technologies. The EFF urges the court to protect student's digital autonomy and free speech by rejecting the notion that school-issued devices inherently make all speech \"on campus.\"\n",
    "chinese_title": "保护公立学校学生免受校外言论监控",
    "chinese_summary": "本文探讨了 *Merrill v. Marana Unified School District* 案，该案中一名高中生因在家中使用学校配发的 Chromebook 电脑起草（但从未发送）的电子邮件中的一个玩笑而被停学。学校使用 Gaggle 监控软件标记了该“威胁”。EFF（电子前沿基金会）提交了法庭之友意见陈述，反对学区声称使用学校配发的设备自动等同于“在校园内”，因此受学校言论规定的约束。\n\nEFF 强调，如此宽泛的解释侵犯了学生的《第一修正案》权利和数字隐私，导致自我审查和对自由表达的寒蝉效应。他们认为，学生需要私人的数字空间，免受持续的监控。\n\n该简报进一步强调了潜在的不公平现象，因为与能够负担个人设备的富裕学生相比，依赖学校设备的低收入学生将面临更大的监控和更严格的言论规定。这创造了一种“付费隐私”制度。此外，简报认为，这项规定鼓励侵入性的监控行为，并忽视了与学生监控技术相关的错误和危害。EFF 敦促法院通过拒绝“学校配发的设备本质上使所有言论都‘在校园内’”的观念，来保护学生的数字自主权和言论自由。"
  },
  {
    "id": "46061208",
    "title": "Fara-7B: An efficient agentic model for computer use",
    "url": "https://github.com/microsoft/fara",
    "summary": "Fara-7B is Microsoft's new, efficient 7-billion parameter Small Language Model (SLM) designed for computer use. It acts as an agent, interacting with computers visually via mouse and keyboard, directly perceiving web pages and performing multi-step tasks like searching, filling forms, and booking reservations. This eliminates the need for accessibility trees or parsing models, mirroring how humans interact with computers. Its compact size allows for on-device deployment, improving latency and privacy.\n\nFara-7B is trained using a synthetic data pipeline based on the Magentic-One framework and Qwen2.5-VL-7B. It outperforms comparable and larger models on web agent benchmarks like WebVoyager, Online-M2W, and DeepShop.\n\nThe article introduces WebTailBench, a new benchmark emphasizing real-world web tasks previously underrepresented. Fara-7B demonstrates superior performance on WebTailBench across various task categories, including shopping, travel, and real estate.\n\nThe article also details the evaluation infrastructure, highlighting the use of Playwright and a structured framework for reproducible results, including handling time-sensitive task updates and environment errors. Instructions are provided for both Azure Foundry hosting (recommended for ease of use) and self-hosting using VLLM. The release is experimental, encouraging community feedback and sandboxed usage.\n",
    "chinese_title": "Fara-7B：用于计算机的高效智能体模型",
    "chinese_summary": "Fara-7B：微软新型高效70亿参数小型语言模型，专为计算机使用而设计。它作为一个代理，通过鼠标和键盘与计算机进行视觉交互，直接感知网页并执行多步骤任务，如搜索、填写表格和预订。这消除了对可访问性树或解析模型的需求，模仿了人类与计算机交互的方式。其紧凑的尺寸使其能够在设备上部署，从而提高延迟和隐私。\n\nFara-7B使用基于Magentic-One框架和Qwen2.5-VL-7B的合成数据管道进行训练。在WebVoyager、Online-M2W和DeepShop等网络代理基准测试中，它优于同类和更大的模型。\n\n本文介绍了一个名为WebTailBench的新基准，强调以前代表性不足的真实世界网络任务。Fara-7B在WebTailBench上的购物、旅行和房地产等各种任务类别中表现出卓越的性能。\n\n本文还详细介绍了评估基础设施，重点介绍了Playwright的使用以及用于可重复结果的结构化框架，包括处理时间敏感的任务更新和环境错误。提供了Azure Foundry托管（推荐易于使用）和使用VLLM进行自托管的说明。该版本为实验性版本，鼓励社区反馈和沙盒使用。"
  },
  {
    "id": "46064571",
    "title": "Migrating the main Zig repository from GitHub to Codeberg",
    "url": "https://ziglang.org/news/migrating-from-github-to-codeberg/",
    "summary": "In a move away from GitHub, the Zig programming language project has migrated its main repository to Codeberg due to concerns about GitHub's perceived decline in quality, neglected GitHub Actions (CI system), and push for AI features. Citing issues like unpredictable CI scheduling and violations of Zig's \"no LLM/AI\" policy, the Zig team decided to switch Git hosting providers to ensure a more stable and reliable development environment.\n\nWhile acknowledging the importance of GitHub Sponsors for early fundraising, the team considers it a liability due to perceived neglect and encourages users to switch recurring donations to Every.org, a non-profit organization. GitHub Sponsors perks will be sunsetted and equivalent perks will be offered through Every.org.\n\nThe migration involves making the GitHub repository read-only and designating Codeberg as the canonical source. Existing GitHub issues and pull requests will remain open and unmigrated, treated as \"copy-on-write.\" New issue numbers on Codeberg will start at 30000 to avoid ambiguity. The Zig team expresses gratitude to the Forgejo and Codeberg communities for their assistance in the migration. The move is seen as a step towards supporting non-profits and defending the \"commons\" in an era of platform capitalism.\n",
    "chinese_title": "将主要的 Zig 仓库从 GitHub 迁移到 Codeberg",
    "chinese_summary": "Zig项目因担忧GitHub质量下降、GitHub Actions (CI系统) 被忽视以及对AI功能的推动，已将其主仓库迁移至Codeberg，以摆脱GitHub。团队指出CI调度不可预测以及违反Zig的“无LLM/AI”政策等问题，因此决定更换Git托管服务提供商，以确保更稳定可靠的开发环境。\n\n虽然承认GitHub Sponsors对早期筹款的重要性，但该团队认为其存在隐患，因为他们认为GitHub Sponsors 被忽视，并鼓励用户将定期捐款转至非营利组织Every.org。GitHub Sponsors的福利将被取消，并通过Every.org提供同等福利。\n\n此次迁移包括将GitHub仓库设为只读，并将Codeberg指定为权威来源。现有的GitHub问题和pull request将保持开放且不迁移，视为“写入时复制”。Codeberg上的新问题编号将从30000开始，以避免歧义。Zig团队感谢Forgejo和Codeberg社区在迁移过程中提供的帮助。此举被视为支持非营利组织和在平台资本主义时代捍卫“公共领域”的一步。"
  },
  {
    "id": "46069053",
    "title": "Renewing GPG Subkeys in 2025",
    "url": "https://entropicthoughts.com/renewing-gpg-subkeys-in-2025",
    "summary": "This article outlines the process for renewing GPG signing and encryption subkeys in 2025, focusing on how advancements in GPG have simplified the procedure. It details the steps performed on an air-gapped computer containing the secret master key.\n\nThe process involves:\n\n1.  **Verification:** Listing public and secret keys to identify the key ID.\n2.  **Importing:** Importing the secret master key.\n3.  **Expiration Update:** Using the `expire` command within GPG to update the expiration dates of both the master key and the subkeys.\n4.  **Exporting Subkeys:** Exporting the secret subkeys to a file.\n5.  **Deleting Master Key (Optional):** Optionally deleting the secret master key from the air-gapped machine, highlighting the automatic removal of associated subkeys as part of this process.\n6.  **Re-importing Subkeys:** Re-importing the secret subkeys back into the keyring.\n7.  **Verification:** Verifying the result by checking for the absence of the secret master key and the updated expiration dates of the subkeys.\n\nThe article also touches on historical complexities of GPG key management that have since been resolved, such as handling separate passphrases for subkeys and master keys. It also mentions the reduced reliance on keyservers due to GDPR concerns and the author's infrequent updates to their publicly available key. The author suggests the potential benefit of re-exporting the secret master key to include previous renewal history within the key data.\n",
    "chinese_title": "2025年更新GPG子密钥",
    "chinese_summary": "本文概述了2025年更新GPG签名和加密子密钥的流程，重点介绍GPG的进步如何简化了该程序。它详细描述了在包含秘密主密钥的离线计算机上执行的步骤。\n\n该过程包括：\n\n1.  **验证：**列出公钥和私钥以识别密钥ID。\n2.  **导入：**导入秘密主密钥。\n3.  **过期更新：**在GPG中使用`expire`命令更新主密钥和子密钥的过期日期。\n4.  **导出子密钥：**将秘密子密钥导出到文件。\n5.  **删除主密钥（可选）：**可选择从离线机器上删除秘密主密钥，并强调删除过程中会自动移除相关的子密钥。\n6.  **重新导入子密钥：**将秘密子密钥重新导入到密钥环中。\n7.  **验证：**通过检查秘密主密钥是否缺失以及子密钥的过期日期是否已更新来验证结果。\n\n本文还涉及GPG密钥管理的历史复杂性，这些复杂性现已得到解决，例如处理子密钥和主密钥的单独密码。它还提到由于GDPR的担忧而减少了对密钥服务器的依赖，以及作者对其公开密钥的更新频率较低。作者建议重新导出秘密主密钥可能带来的好处，以便将之前的续订历史记录包含在密钥数据中。"
  },
  {
    "id": "46065997",
    "title": "Show HN: Era – Open-source local sandbox for AI agents",
    "url": "https://github.com/BinSquare/ERA",
    "summary": "Era is an open-source local sandbox designed for running untrusted or AI-generated code. It uses microVMs, providing container-like isolation with fast startup times and enhanced security. Era offers both a local CLI tool (agent) and a managed cloud layer for deploying as a Cloudflare Worker.\n\n**Key Features:**\n\n*   **Sandboxed Execution:** Runs code within isolated microVMs.\n*   **Language Support:** Supports Python, JavaScript/Node/TypeScript, Go, and Ruby. Custom images can be specified.\n*   **Fast Startup:** MicroVMs launch in around 200ms.\n*   **Local CLI Tool:** Provides commands for creating, executing, listing, stopping, and cleaning VMs.\n*   **Configuration:** Offers configurable options like logging level, state directory, and volume mounting.\n*   **Cloud Deployment:** Can be deployed as a Cloudflare Worker using Durable Objects for session management and HTTP APIs.\n*   **Installation:** Offers installation through Homebrew or from source. Requires dependencies like `krunvm` and `buildah`.\n*   **Documentation:** Provides extensive documentation on CLI usage, setup, troubleshooting, API deployment, and sample workflows.\n*   **License:** Apache 2.0\n\n**Core Commands:**\n\n*   `agent vm create`: Creates a long-running VM.\n*   `agent vm exec`: Runs a command inside a VM.\n*   `agent vm temp`: Executes a command in an ephemeral VM.\n*   `agent vm list`: Lists VMs.\n*   `agent vm stop`: Stops VMs.\n*   `agent vm clean`: Deletes VMs.\n\nIn essence, Era gives developers a secure and efficient way to experiment with AI-generated code or run untrusted applications locally, with the option to deploy a similar environment in the cloud using Cloudflare Workers.\n",
    "chinese_title": "Show HN: Era – AI 代理的开源本地沙箱",
    "chinese_summary": "Era：用于运行不受信任代码或AI生成代码的开源本地沙箱\n\n**主要特性：**\n\n*   **沙箱执行：** 在隔离的微虚拟机内运行代码。\n*   **语言支持：** 支持 Python、JavaScript/Node/TypeScript、Go 和 Ruby。可以指定自定义镜像。\n*   **快速启动：** 微虚拟机启动时间约为 200 毫秒。\n*   **本地 CLI 工具：** 提供用于创建、执行、列出、停止和清理虚拟机的命令。\n*   **配置：** 提供可配置的选项，如日志级别、状态目录和卷挂载。\n*   **云部署：** 可以作为 Cloudflare Worker 部署，使用 Durable Objects 进行会话管理和 HTTP API。\n*   **安装：** 提供通过 Homebrew 或从源代码安装。需要 `krunvm` 和 `buildah` 等依赖项。\n*   **文档：** 提供关于 CLI 用法、设置、故障排除、API 部署和示例工作流的详尽文档。\n*   **许可：** Apache 2.0\n\n**核心命令：**\n\n*   `agent vm create`：创建长时间运行的虚拟机。\n*   `agent vm exec`：在虚拟机内部运行命令。\n*   `agent vm temp`：在临时虚拟机中执行命令。\n*   `agent vm list`：列出虚拟机。\n*   `agent vm stop`：停止虚拟机。\n*   `agent vm clean`：删除虚拟机。\n\n本质上，Era 为开发者提供了一种安全有效的方式，可以在本地实验 AI 生成的代码或运行不受信任的应用程序，并可以选择使用 Cloudflare Workers 在云中部署类似的环境。"
  },
  {
    "id": "46007267",
    "title": "How/why to sweep async tasks under a Postgres table",
    "url": "https://taylor.town/pg-task",
    "summary": "This article advocates for managing asynchronous tasks by \"sweeping\" them into a Postgres table instead of relying on dedicated queuing systems like SQS, Redis, or Celery. The author argues that this approach simplifies system architecture, reduces complexity, and leverages Postgres' transaction guarantees to ensure data consistency and reliable task execution.\n\nThe core idea is to insert tasks into a `task` table within the same database transaction that handles user-facing actions (e.g., user signup). This guarantees that if the database write succeeds, the task is guaranteed to be executed. A background worker continuously polls this table, processing and deleting tasks within a transaction. If a task fails, the transaction rolls back, and the task remains in the queue for retry.\n\nKey benefits highlighted include:\n\n*   **Data Consistency:** Avoids two-phase commit problems by managing all state within the database.\n*   **Simplified Architecture:** Reduces the number of systems involved, making debugging and maintenance easier.\n*   **Automatic Retries:** Failed tasks are automatically retried due to transaction rollback, providing built-in fault tolerance.\n*   **TODO Management:** Unimplemented tasks are automatically logged and retried, acting as a live list of things to be implemented/fixed.\n*   **Parallel Processing:** Using `skip locked` allows multiple workers to process tasks concurrently without contention.\n*   **Prioritized Queues:** Using `order by (case task_type ... end), random()` prioritizes tasks.\n\nThe author also emphasizes the importance of prioritizing database consistency over immediate execution and suggests avoiding complex retry loops for human-solvable issues, delegating them to computers instead.\n",
    "chinese_title": "如何/为何将异步任务扫进Postgres表里",
    "chinese_summary": "本文倡导通过将异步任务“扫入”Postgres表中进行管理，而不是依赖于像SQS、Redis或Celery这样的专用队列系统。作者认为，这种方法简化了系统架构，降低了复杂性，并利用Postgres的事务保证来确保数据一致性和可靠的任务执行。\n\n核心思想是在处理面向用户的操作（例如，用户注册）的同一个数据库事务中，将任务插入到`task`表中。这保证了如果数据库写入成功，则任务肯定会被执行。一个后台worker持续轮询该表，在事务中处理和删除任务。如果任务失败，事务回滚，任务仍然保留在队列中以供重试。\n\n强调的主要优势包括：\n\n*   **数据一致性：** 通过在数据库中管理所有状态来避免两阶段提交问题。\n*   **简化架构：** 减少了所涉及的系统数量，从而更易于调试和维护。\n*   **自动重试：** 由于事务回滚，失败的任务会自动重试，提供内置的容错能力。\n*   **TODO管理：** 未实现的任务会自动记录并重试，充当待实现/修复事项的实时列表。\n*   **并行处理：** 使用`skip locked`允许多个worker并发处理任务，而无需争用。\n*   **优先级队列：** 使用 `order by (case task_type ... end), random()` 对任务进行优先级排序。\n\n作者还强调了优先考虑数据库一致性而不是立即执行的重要性，并建议避免对人工可解决的问题使用复杂的重试循环，而是将其委派给计算机。"
  },
  {
    "id": "46069837",
    "title": "Steam censors LGBTQ+ content on behalf of the Russian Government",
    "url": "https://www.videogamesindustrymemo.com/p/how-steam-censors-lgbtq-content-on",
    "summary": "This article from Video Games Industry Memo (VGIM) reports on how Steam allegedly censors LGBTQ+ content in video games on behalf of the Russian government censorship agency, Roskomnadzor. The article centers on the experience of Flick Games, a UK-based developer, whose card game \"Flick Solitaire\" was removed from the Russian version of Steam after Roskomnadzor deemed it as promoting \"non-traditional\" relationships due to its LGBTQ+ themed decks.\n\nWhile Apple and Google did not comply with Roskomnadzor's demands and kept the game available on their app stores in Russia, Steam immediately removed the game without giving Flick Games a chance to appeal. Steam then blamed Flick Games for not complying with Russian laws, raising concerns about Valve's content moderation policies being weaponized by autocratic regimes.\n\nFlick Games founder Ian Masters emphasized the importance of LGBTQ+ visibility in countries like Russia and expressed disappointment at Steam's decision. Out Making Games also criticized Steam's stance as \"deeply disturbing.\"\n\nThe article argues that Steam's policy of allowing \"everything\" that isn't \"trolling\" or \"illegal\" strengthens censorship bodies like Roskomnadzor. It concludes by calling for digital content regulators to bring the games industry under regulatory control. The article also includes a news brief on other industry developments, including Tencent's investment in Ubisoft and Australia's social media ban for minors.\n",
    "chinese_title": "Steam 代表俄罗斯政府审查 LGBTQ+ 内容",
    "chinese_summary": "视频游戏产业备忘录（VGIM）的这篇文章报道了Steam如何据称代表俄罗斯政府审查机构 Roskomnadzor 审查电子游戏中 LGBTQ+ 内容。文章重点讲述了英国开发商 Flick Games 的经历，其卡牌游戏“Flick Solitaire”因其 LGBTQ+ 主题卡牌而被 Roskomnadzor 认定为宣扬“非传统”关系，并因此从 Steam 的俄罗斯版本中移除。\n\n虽然 Apple 和 Google 没有遵守 Roskomnadzor 的要求，并保持该游戏在其俄罗斯的应用商店中可用，但 Steam 立即移除了该游戏，且没有给 Flick Games 上诉的机会。随后，Steam 指责 Flick Games 未遵守俄罗斯法律，这引发了人们对 Valve 的内容审核政策被专制政权利用的担忧。\n\nFlick Games 创始人 Ian Masters 强调了 LGBTQ+ 能见度在俄罗斯等国家的重要性，并对 Steam 的决定表示失望。Out Making Games 也批评 Steam 的立场“令人深感不安”。\n\n文章认为，Steam 允许“一切”非“钓鱼”或“非法”内容的政策加强了 Roskomnadzor 等审查机构的力量。文章最后呼吁数字内容监管机构将游戏行业置于监管之下。文章还包括关于其他行业发展的新闻简报，包括腾讯对育碧的投资以及澳大利亚对未成年人的社交媒体禁令。"
  },
  {
    "id": "46017830",
    "title": "A woman on a mission to photograph every species of hummingbird",
    "url": "https://www.audubon.org/magazine/meet-woman-mission-photograph-every-species-of-hummingbird-world",
    "summary": "This isn't really an article, but a promotional snippet. It highlights a person dedicated to photographing all hummingbird species and uses that dedication as a springboard to advocate for climate action. The core message is a call to action, urging readers to sign a pledge with Audubon to pressure elected officials to address climate change. The underlying assumption is that the beauty and vulnerability of creatures like hummingbirds make a compelling case for environmental protection and climate solutions.\n",
    "chinese_title": "一位致力于拍摄每种蜂鸟的女性",
    "chinese_summary": "这与其说是一篇文章，不如说是一个宣传片段。它突出了一个致力于拍摄所有蜂鸟物种的人，并以此为跳板，倡导气候行动。核心信息是呼吁采取行动，敦促读者与奥杜邦协会签署承诺书，向民选官员施压，以解决气候变化问题。其潜在假设是，像蜂鸟这样生物的美丽和脆弱性，为环境保护和气候解决方案提供了一个令人信服的理由。"
  },
  {
    "id": "46063450",
    "title": "C100 Developer Terminal",
    "url": "https://caligra.com/",
    "summary": "The C100 Developer Terminal, created by Caligra, is designed for technical environments where precision and focus are paramount. Caligra prioritizes the needs of developers and technical professionals, aiming to create a distraction-free environment that fosters deep work and maximizes productivity. The core philosophy behind the C100 is to prioritize the user's workflow and ensure they can accomplish their tasks efficiently and effectively. It's a computer built with the specific intention of serving the user's needs, enabling them to concentrate on their work and achieve optimal results. In essence, Caligra builds tools that empower developers and technical professionals to excel in their respective fields by focusing on the core principle of making technology work for the user, not the other way around.\n",
    "chinese_title": "C100开发者终端",
    "chinese_summary": "Caligra公司出品的C100开发者终端，专为注重精准和专注的技术环境设计。Caligra优先考虑开发者和技术专业人员的需求，旨在创造一个免受干扰的环境，从而促进深度工作并最大限度地提高生产力。C100的核心理念是优先考虑用户的工作流程，并确保他们能够高效地完成任务。这是一款专门为满足用户需求而打造的计算机，使他们能够专注于工作并取得最佳成果。 简而言之，Caligra致力于构建赋能开发者和技术专业人员在其各自领域中脱颖而出的工具，其核心原则是让技术为人服务，而不是让人为技术服务。"
  },
  {
    "id": "46012980",
    "title": "Can you take an ox to Oxford?",
    "url": "https://alexwlchan.net/2025/ox-in-oxford/",
    "summary": "This article humorously investigates whether Oxford's congestion charge applies to an ox-drawn cart. Sparked by a tweet questioning the chargeability of oxen-driven vehicles due to their zero emissions, the author delves into the legal definitions underpinning the congestion charge.\n\nThe investigation centers on the Oxfordshire County Council's \"Charging Order\" and relevant UK legislation, specifically the Road User Charging and Workplace Parking Levy (Classes of Motor Vehicles) (England) Regulations 2001. The key question is whether an ox-drawn cart falls under the definition of a \"motor vehicle,\" which the Road Traffic Act 1988 defines as \"a mechanically propelled vehicle.\"\n\nThe author argues that since an ox is not \"mechanically propelled\" in the way the law intends, an ox-drawn cart would not be considered a motor vehicle and therefore would not be subject to the congestion charge. The article further points out that the congestion charge is likely enforced via number plate recognition, and an ox-drawn cart lacks a number plate, further solidifying its exemption.\n\nThe article also touches upon quirks in the regulations, noting that vehicles like Reliant Robins and Peel P50s, while technically exempt based on their classifications, would likely be charged due to having number plates.\n\nIn conclusion, the author asserts that you can indeed take an ox to Oxford without incurring the congestion charge. The piece ends with a reflection on the value of publicly available legislation, allowing citizens to research and understand the law, even for absurd scenarios.\n",
    "chinese_title": "你能把牛带到牛津吗？",
    "chinese_summary": "本文幽默地探讨了牛津的拥堵费是否适用于牛拉车。起因是一条推特质疑牛拉车辆因零排放是否应该收费，作者深入研究了构成拥堵费的法律定义。\n\n调查的重点是牛津郡议会的“收费令”和相关的英国法律，特别是《2001年道路使用者收费和工作场所停车税（机动车辆类别）（英格兰）条例》。关键问题是牛拉车是否属于“机动车辆”的定义，《1988年道路交通法》将其定义为“机械推进的车辆”。\n\n作者认为，由于牛并非法律意义上的“机械推进”，因此牛拉车不应被视为机动车辆，因此不受拥堵费的约束。文章进一步指出，拥堵费很可能通过车牌识别来执行，而牛拉车没有车牌，进一步巩固了其豁免权。\n\n文章还提到了法规中的一些怪异之处，指出像Reliant Robins和Peel P50s这样的车辆，虽然从技术上讲可以根据其分类获得豁免，但由于有车牌，很可能会被收费。\n\n总之，作者断言，你确实可以赶着牛车去牛津，而不会产生拥堵费。文章最后反思了公开立法的价值，使公民能够研究和理解法律，即使是对于荒谬的场景。"
  },
  {
    "id": "46070915",
    "title": "Pakistan says rooftop solar output to exceed grid demand in some hubs next year",
    "url": "https://www.reuters.com/sustainability/boards-policy-regulation/pakistan-says-rooftop-solar-output-exceed-grid-demand-some-hubs-next-year-2025-11-22/",
    "summary": "Pakistan's government anticipates that rooftop solar power generation will exceed electricity demand from the grid in certain urban centers by next year (2025). This prediction is based on the rapid adoption of rooftop solar systems by consumers seeking to reduce their energy costs and dependence on the national grid, which often faces issues like power outages and high tariffs.\n\nThe increasing popularity of solar power, driven by attractive net metering policies that allow consumers to sell excess electricity back to the grid, poses potential challenges for Pakistan's power distribution companies. These companies rely on grid electricity sales for revenue and may face financial strain if demand decreases significantly due to increased rooftop solar adoption.\n\nThe government acknowledges the need to adapt to this changing energy landscape and is exploring strategies to ensure the financial viability of distribution companies while continuing to encourage the growth of renewable energy sources. These strategies might include revising tariff structures or developing new business models for distribution companies. The projected surplus of rooftop solar power reflects Pakistan's broader efforts to diversify its energy mix and reduce its reliance on imported fossil fuels.\n",
    "chinese_title": "巴基斯坦称明年部分枢纽屋顶太阳能发电量将超过电网需求",
    "chinese_summary": "巴基斯坦政府预计，到明年（2025年），屋顶太阳能发电量将在某些城市中心超过电网的电力需求。这一预测基于消费者为降低能源成本和摆脱对国家电网的依赖（后者经常面临停电和高关税等问题）而迅速采用屋顶太阳能系统。\n\n太阳能日益普及，这得益于允许消费者将多余电力出售回电网的具有吸引力的净计量政策，但也给巴基斯坦的配电公司带来了潜在挑战。这些公司依赖电网电力销售收入，如果由于屋顶太阳能普及而导致需求大幅下降，可能会面临财务压力。\n\n政府承认需要适应这种不断变化的能源格局，并正在探索确保配电公司财务可行性的同时，继续鼓励可再生能源发展的战略。这些战略可能包括修订关税结构或为配电公司开发新的商业模式。预计屋顶太阳能发电的盈余反映了巴基斯坦为实现能源结构多样化和减少对进口化石燃料的依赖所做的更广泛努力。"
  },
  {
    "id": "46062504",
    "title": "The EU made Apple adopt new Wi-Fi standards, and now Android can support AirDrop",
    "url": "https://arstechnica.com/gadgets/2025/11/the-eu-made-apple-adopt-new-wi-fi-standards-and-now-android-can-support-airdrop/",
    "summary": "This article discusses how Android's Quick Share feature is being updated to support Apple's AirDrop, enabling direct file sharing between Android and Apple devices using a peer-to-peer Wi-Fi connection. Initially, this feature will only be available on the Pixel 10 series, with Google planning to expand support to more Android devices in the future. The update requires AirDrop to be set to \"everyone for 10 minutes\" mode and leverages Wi-Fi Aware, a standard Google has supported since Android 8.0.\n\nThe article argues that this interoperability is largely due to the EU's Digital Markets Act (DMA), which required Apple to adopt interoperable wireless standards like Wi-Fi Aware instead of its proprietary Apple Wireless Direct Link (AWDL). This allowed other companies, like Google, to make their file-sharing features compatible with AirDrop.\n\nWhile Google doesn't explicitly mention the DMA in its announcements, the article suggests it's likely a key driver behind this change. The adoption of Wi-Fi Aware in iOS 26 and iPadOS 26 (supported by iPhone 12 and later, and recent iPads) is necessary for Quick Share to work with AirDrop. macOS is unlikely to be supported. The author speculates that Google might be hesitant to credit the DMA due to its own concerns about the law's potential impacts, despite occasionally leveraging it.\n",
    "chinese_title": "欧盟迫使苹果采用新的Wi-Fi标准，现在安卓可以支持AirDrop。",
    "chinese_summary": "本文探讨了Android的“邻近分享”功能如何更新以支持Apple的AirDrop，从而通过点对点Wi-Fi连接实现Android和Apple设备之间的直接文件共享。最初，此功能仅在Pixel 10系列上可用，谷歌计划未来将支持扩展到更多Android设备。该更新需要AirDrop设置为“所有人，10分钟”模式，并利用Wi-Fi感知（Wi-Fi Aware），这是谷歌自Android 8.0以来一直支持的标准。\n\n文章认为，这种互操作性主要归功于欧盟的《数字市场法案》（DMA），该法案要求苹果公司采用像Wi-Fi感知这样的可互操作的无线标准，而不是其专有的Apple无线直连（AWDL）。这使得像谷歌这样的其他公司能够使其文件共享功能与AirDrop兼容。\n\n虽然谷歌在其公告中没有明确提及DMA，但文章暗示这很可能是这一变化背后的关键驱动因素。iOS 26和iPadOS 26（iPhone 12及更高版本，以及最近的iPad支持）中采用Wi-Fi感知是“邻近分享”与AirDrop配合使用的必要条件。macOS不太可能得到支持。作者推测，尽管谷歌偶尔会利用DMA，但由于担心该法律的潜在影响，它可能不愿赞扬DMA。"
  },
  {
    "id": "46033046",
    "title": "Essence and accident in language model-assisted coding",
    "url": "https://www.sicpers.info/2025/11/essence-and-accident-in-language-model-assisted-coding/",
    "summary": "Graham's article \"Essence and accident in language model-assisted coding\" examines how language model-based coding tools address complexity in software development, referencing Fred Brooks' \"No Silver Bullet\" paper from 1986. Brooks distinguished between essential complexity (inherent to the problem) and accidental complexity (introduced by the chosen solution).\n\nThe article argues that coding assistants, by generating code like programmers, don't inherently reduce accidental complexity. A cynical view suggests they might even increase it by adding prompt engineering. True reduction in accidental complexity would only occur if the tools directly generated executables from prompts, bypassing source code altogether, or if language models completely replaced programming.\n\nRegarding essential complexity, the author contends that language models are irrelevant to the inherent complexity of most problems unless the problem itself involves a language model. However, these tools excel at quickly exposing essential complexity by revealing misunderstandings and flawed assumptions through iterative code generation and testing. This accelerated feedback loop allows for faster progress in understanding the true requirements, even compared to traditional methods like requirement specification or prototyping.\n\nGraham concludes that while these tools might not be a silver bullet, they significantly speed up the iterative process of uncovering essential complexity and refining requirements, aligning with Brooks' prediction of automatic programming via higher-level languages.\n",
    "chinese_title": "语言模型辅助编码中的本质与偶然",
    "chinese_summary": "格雷厄姆的文章《语言模型辅助编码中的本质与偶然》探讨了基于语言模型的编码工具如何解决软件开发中的复杂性，并参考了弗雷德·布鲁克斯 1986 年的论文《没有银弹》。布鲁克斯区分了本质复杂性（问题固有的）和偶然复杂性（由所选解决方案引入的）。\n\n文章认为，编码助手通过像程序员一样生成代码，并不能从根本上减少偶然复杂性。一种愤世嫉俗的观点认为，它们甚至可能通过增加提示工程来增加偶然复杂性。真正减少偶然复杂性只有在工具直接从提示生成可执行文件，完全绕过源代码，或者语言模型完全取代编程时才会发生。\n\n关于本质复杂性，作者认为，除非问题本身涉及语言模型，否则语言模型与大多数问题的固有复杂性无关。然而，这些工具擅长通过迭代代码生成和测试来揭示误解和错误假设，从而快速暴露本质复杂性。这种加速的反馈循环能够更快地理解真实需求，甚至优于需求规范或原型设计等传统方法。\n\n格雷厄姆总结说，虽然这些工具可能不是银弹，但它们显着加速了发现本质复杂性和完善需求的迭代过程，与布鲁克斯关于通过更高级别语言实现自动编程的预测相符。"
  },
  {
    "id": "46063072",
    "title": "Bring bathroom doors back to hotels",
    "url": "https://bringbackdoors.com/",
    "summary": "This article outlines a growing frustration with hotels removing bathroom doors in favor of cost savings and aesthetic appeal. The author is fed up with this trend, arguing that it sacrifices guest privacy and dignity.\n\nTo combat this issue, the author has created a website dedicated to identifying hotels with and without bathroom doors. They have contacted hundreds of hotels, asking if their bathroom doors close completely and if they are made of glass. Hotels confirming closing doors and non-glass material are listed on the site, categorized by price range and city, to help travelers find hotels that guarantee bathroom privacy.\n\nThe website also includes a feature allowing users to check if a hotel has already been reported for lacking a bathroom door. Furthermore, the author encourages travelers to submit reports of \"doorless\" hotels via email (bringbackdoors@gmail.com) or Instagram DM, including the hotel name and a photo. These submissions will be publicly shared to \"name and shame\" offending hotels, aiming to pressure them into prioritizing guest privacy and reinstalling bathroom doors. The author emphasizes that this is a passion project fueled by a desire to protect the dignity of future travelers.\n",
    "chinese_title": "酒店重新安装浴室门",
    "chinese_summary": "本文概述了酒店为节省成本和追求美观而拆除浴室门，由此引发的日益增长的不满。作者对此趋势感到厌倦，认为这牺牲了客人的隐私和尊严。\n\n为了解决这个问题，作者创建了一个网站，专门用于识别有浴室门和没有浴室门的酒店。他们联系了数百家酒店，询问其浴室门是否完全关闭以及是否由玻璃制成。确认门可以关闭且材料非玻璃的酒店将被列在该网站上，按价格范围和城市分类，以帮助旅客找到可以保证浴室隐私的酒店。\n\n该网站还包含一项功能，允许用户查看某酒店是否已被报告缺少浴室门。此外，作者鼓励旅客通过电子邮件 (bringbackdoors@gmail.com) 或 Instagram 私信提交“无门”酒店的报告，包括酒店名称和照片。这些提交的内容将被公开分享，以“点名羞辱”违规酒店，旨在迫使他们优先考虑客人隐私并重新安装浴室门。作者强调，这是一个出于保护未来旅客尊严的愿望而驱动的热情项目。"
  },
  {
    "id": "46068461",
    "title": "Implementing Drift Search with Neo4j and LlamaIndex",
    "url": "https://neo4j.com/blog/developer/drift-search-with-neo4j-and-llamaindex/",
    "summary": "This article delves into the implementation of Dynamic Reasoning and Inference with Flexible Traversal (DRIFT) search using Neo4j and LlamaIndex, a technique that combines aspects of global and local search within a GraphRAG system. DRIFT begins by leveraging community information via vector search, establishing a broad starting point for queries and refining them into detailed follow-up questions. This allows the system to dynamically traverse the knowledge graph, balancing computational efficiency with comprehensive answer quality.\n\nThe implementation uses LlamaIndex workflows to orchestrate the DRIFT search process. First, Hypothetical Document Embeddings (HyDE) generation creates a hypothetical answer based on a sample community report to improve query representation. Next, community search uses vector similarity to identify the most relevant community reports, providing broad context. The system analyzes these results to generate an initial intermediate answer and a set of follow-up queries for deeper investigation. These follow-up queries are executed in parallel during the local search phase, retrieving targeted information. Finally, the answer generation step synthesizes all intermediate answers, combining broad community-level insights with detailed local findings to produce a comprehensive response. The article uses \"Alice's Adventures in Wonderland\" as a sample dataset and reuses a previously developed Microsoft GraphRAG indexing implementation adapted into a LlamaIndex workflow for data ingestion. The code for DRIFT search is available on GitHub.\n",
    "chinese_title": "使用 Neo4j 和 LlamaIndex 实现漂移搜索",
    "chinese_summary": "本文深入探讨了使用Neo4j和LlamaIndex实现的基于灵活遍历的动态推理和推断（DRIFT）搜索技术，该技术结合了GraphRAG系统中全局搜索和局部搜索的各个方面。 DRIFT首先利用向量搜索获取社区信息，为查询建立一个广泛的起点，并将其细化为详细的后续问题。 这使得系统能够动态遍历知识图谱，在计算效率和全面的答案质量之间取得平衡。\n\n该实现使用LlamaIndex工作流程来协调DRIFT搜索过程。 首先，假设文档嵌入（HyDE）生成基于示例社区报告的假设答案，以改善查询表示。 接下来，社区搜索使用向量相似性来识别最相关的社区报告，从而提供广泛的上下文。 系统分析这些结果以生成初始的中间答案以及一组用于更深入调查的后续查询。 这些后续查询在本地搜索阶段并行执行，从而检索有针对性的信息。 最后，答案生成步骤综合所有中间答案，将广泛的社区层面见解与详细的本地发现相结合，以产生全面的响应。 本文使用《爱丽丝梦游仙境》作为示例数据集，并重用了先前开发的Microsoft GraphRAG索引实现，该实现已适配到LlamaIndex工作流程中以用于数据摄取。 DRIFT搜索的代码可在GitHub上找到。"
  },
  {
    "id": "46059620",
    "title": "Optery (YC W22) Hiring CISO, Release Manager, Tech Lead (Node), Full Stack Eng",
    "url": "https://www.optery.com/careers/",
    "summary": "Optery, a YC W22 company, is hiring for multiple technical roles: CISO (Chief Information Security Officer), Release Manager, Tech Lead (Node), and Full Stack Engineer.\n\nThe Optery Careers page may require cookies to display fully. If the page appears blank, users are advised to accept \"Personalization cookies\" via the cookie banner located in the bottom left corner of the screen.\n",
    "chinese_title": "Optery (YC W22) 招聘首席信息安全官、发布经理、技术主管（Node）、全栈工程师",
    "chinese_summary": "Optery (YC W22 公司) 正在招聘多个技术职位：首席信息安全官 (CISO)、发布经理、技术负责人（Node）和全栈工程师。\n\nOptery 招聘页面可能需要 Cookie 才能完整显示。如果页面显示空白，建议用户通过屏幕左下角的 Cookie 横幅接受“个性化 Cookie”。"
  },
  {
    "id": "46033472",
    "title": "Technical Deflation",
    "url": "https://benanderson.work/blog/technical-deflation/",
    "summary": "Benjamin Anderson's article, \"Technical Deflation,\" explores the idea that the increasing ease and affordability of software development, driven by advancements in AI, is creating a deflationary effect in the tech industry. He argues that startups may delay building products, anticipating further improvements in AI models and development tools.\n\nAnderson details how AI advancements, like improved LLMs, have simplified the development process, allowing startups to quickly build functional applications with fewer resources. This allows newcomers to compete with established companies by rapidly developing features that used to take years.\n\nHe uses the example of developing a desktop app to illustrate this point, suggesting that the potential for future AI advancements makes it tempting to postpone development. He further argues that being a late entrant into the market can be advantageous, as companies can avoid the mistakes of early adopters and leverage more advanced AI tools.\n\nWhile acknowledging the traditional importance of being first to market, Anderson suggests that the current technological climate favors those who enter later. He concludes by pondering the optimal strategy for startups in this environment, suggesting that focusing on distribution, customer understanding, or innovative approaches like self-customizing software might be key to success in a world of increasingly accessible technology. The core idea being, if building becomes easy, the moat must be elsewhere.\n",
    "chinese_title": "技术性通货紧缩",
    "chinese_summary": "本杰明·安德森的文章《技术性通货紧缩》探讨了这样一个观点：人工智能的进步使得软件开发越来越容易和便宜，从而在科技行业造成通货紧缩效应。他认为，初创公司可能会推迟产品开发，因为他们预期人工智能模型和开发工具会进一步改进。\n\n安德森详细阐述了人工智能的进步，例如改进的LLM，如何简化了开发过程，使得初创公司能够以更少的资源快速构建功能性应用程序。这使得新来者可以通过快速开发过去需要数年才能完成的功能，与老牌公司竞争。\n\n他以开发桌面应用程序为例来说明这一点，并表示未来人工智能进步的潜力使得推迟开发具有诱惑力。他进一步认为，作为市场的后来者可能是有利的，因为公司可以避免早期采用者的错误，并利用更先进的人工智能工具。\n\n虽然安德森承认先发制人的传统重要性，但他认为当前的技术环境有利于后来者。最后，他思考了初创公司在这种环境下的最佳策略，并认为专注于分销、客户理解或像自定制软件这样的创新方法可能是在这个技术越来越容易获得的世界中取得成功的关键。核心思想是，如果构建变得容易，那么护城河必须在其他地方。"
  },
  {
    "id": "46057000",
    "title": "Indie game developers have a new sales pitch: being 'AI free'",
    "url": "https://www.theverge.com/entertainment/827650/indie-developers-gen-ai-nexon-arc-raiders",
    "summary": "Indie game developers are increasingly using \"AI-free\" marketing to distinguish their games, fueled by ethical concerns and a desire to highlight the human effort behind their creations. This trend emerged in response to gaming CEOs like Nexon's Junghun Lee suggesting that AI is ubiquitous in game development, a claim indie developers vehemently deny.\n\nA key element of this movement is a freely available \"no gen AI\" seal created by Polygon Treehouse, signaling to consumers that a game was entirely human-made. D-Cell Games, the studio behind Unbeatable, has also adopted a firm stance against AI, emphasizing the personal touch and imperfections inherent in human creation.\n\nThese developers argue that AI, despite its potential to speed up development, diminishes the creative problem-solving and unique aesthetic choices that define indie games. They believe that constraints breed creativity and that avoiding AI aligns with their values and resonates with players who appreciate handcrafted experiences.\n\nWhile acknowledging the growing pressure to adopt AI, these indie developers are determined to maintain their artistic integrity and continue producing games the \"human way,\" finding it more fulfilling and authentic. They've seen positive responses from their communities regarding their anti-AI stance, indicating a demand for games made without AI assistance.\n",
    "chinese_title": "独立游戏开发者有了新的销售策略：标榜“无AI”。",
    "chinese_summary": "独立游戏开发者越来越多地使用“无AI”营销来区分他们的游戏，这受到伦理考量以及突出游戏背后人类努力的愿望的推动。这一趋势的出现，源于Nexon的Junghun Lee等游戏公司CEO声称AI在游戏开发中无处不在，而独立开发者强烈否认这一说法。\n\n此运动的一个关键要素是由Polygon Treehouse创建的免费“无生成AI”标志，向消费者表明该游戏完全由人类制作。Unbeatable背后的工作室D-Cell Games也采取了坚定的反AI立场，强调人类创作中固有的个人风格和不完美。\n\n这些开发者认为，尽管AI有可能加快开发速度，但它会削弱定义独立游戏的创造性问题解决能力和独特的审美选择。他们相信，约束会激发创造力，避免使用AI符合他们的价值观，并能引起欣赏手工制作体验的玩家的共鸣。\n\n虽然承认采用AI的压力越来越大，但这些独立开发者决心保持其艺术完整性，并继续以“人类方式”制作游戏，认为这样更充实和真实。他们已经从社区收到了关于其反AI立场的积极回应，表明人们对不使用AI辅助制作的游戏存在需求。"
  },
  {
    "id": "46069048",
    "title": "TPUs vs. GPUs and why Google is positioned to win AI race in the long term",
    "url": "https://www.uncoveralpha.com/p/the-chip-made-for-the-ai-inference",
    "summary": "This article dives deep into Google's Tensor Processing Units (TPUs), comparing them to GPUs and arguing why Google is positioned to win the long-term AI race. It begins with the history of TPUs, explaining they were created to address Google's need for efficient processing of massive matrix multiplications for AI inference, specifically to avoid doubling data center capacity due to voice search.\n\nThe core difference between TPUs and GPUs lies in their architecture: GPUs are general-purpose parallel processors optimized for graphics, while TPUs are domain-specific, using a Systolic Array. This array reduces memory access bottlenecks, leading to higher operations per Joule. Recent TPU designs like Ironwood (v7) have enhanced capabilities including SparseCore, increased HBM capacity/bandwidth, and improved inter-chip interconnectivity.\n\nWhile performance data is limited, analyses of interviews and industry insights suggest TPUs offer better cost-effectiveness and performance per watt for specific AI tasks compared to GPUs. Experts cite efficiency gains, reduced AI search costs, and potential speed benefits for dynamic models. A key advantage lies in Google's optimized software ecosystem for TPUs.\n\nThe article highlights the main obstacle to wider TPU adoption: the dominance of Nvidia's CUDA ecosystem, which is widely taught and supported. The industry also skews to PyTorch. Furthermore, the fact that most companies are multi-cloud means that Nvidia, being accessible on all three hyperscalers (AWS, Azure, GCP), has a significant advantage. However, the increasing focus on AI inference, where CUDA is less critical, provides an opportunity for TPU expansion. Finally, the rapid generational improvements in TPUs, potentially exceeding Nvidia's rate of advancement, solidify Google's competitive edge.\n",
    "chinese_title": "TPU vs. GPU：以及为何谷歌有望赢得AI长期竞赛",
    "chinese_summary": "本文深入探讨谷歌的张量处理器 (TPU)，将其与 GPU 进行比较，并论证了谷歌为何有能力赢得长期的 AI 竞赛。文章首先回顾了 TPU 的历史，解释了 TPU 的创建是为了满足谷歌对 AI 推理中大规模矩阵乘法进行高效处理的需求，特别是为了避免因语音搜索而导致数据中心容量翻倍。\n\nTPU 和 GPU 的核心区别在于它们的架构：GPU 是针对图形优化的通用并行处理器，而 TPU 是特定领域的，使用 systolic 阵列。这种阵列减少了内存访问瓶颈，从而提高了每焦耳的运算次数。最新的 TPU 设计，如 Ironwood (v7)，增强了包括 SparseCore、增加的 HBM 容量/带宽和改进的芯片间互连等功能。\n\n虽然性能数据有限，但对采访和行业洞察的分析表明，与 GPU 相比，TPU 在特定 AI 任务上提供了更好的成本效益和每瓦性能。专家们提到效率提升、降低的 AI 搜索成本以及动态模型的潜在速度优势。一个关键优势在于谷歌针对 TPU 优化的软件生态系统。\n\n文章强调了 TPU 更广泛采用的主要障碍：英伟达 CUDA 生态系统的统治地位，该生态系统被广泛教授和支持。该行业也偏向于 PyTorch。此外，大多数公司都是多云的事实意味着，英伟达可以在所有三个超大规模云提供商（AWS、Azure、GCP）上访问，因此具有显著优势。然而，对 AI 推理的日益关注（CUDA 在此方面不太重要）为 TPU 的扩展提供了机会。最后，TPU 的快速世代改进，可能超过英伟达的进步速度，巩固了谷歌的竞争优势。"
  },
  {
    "id": "46064210",
    "title": "Collabora Online Desktop Released with Improved UI from LibreOffice",
    "url": "https://www.collaboraonline.com/blog/collabora-online-now-available-on-desktop/",
    "summary": "The article announces the release of Collabora Online Desktop, a desktop application bringing the Collabora Online office suite experience closer to a traditional desktop environment. The key takeaway is that this release features an improved user interface derived from LibreOffice, suggesting a significant UI upgrade aimed at enhancing the user experience and likely making the application more intuitive and familiar to users already accustomed to LibreOffice. The \"Read More »\" link indicates that further details about the specific improvements and features of the Collabora Online Desktop are available in the linked article.\n",
    "chinese_title": "Collabora Online桌面版发布，采用LibreOffice改进的用户界面",
    "chinese_summary": "Collabora Online桌面版发布，UI升级源自LibreOffice，详见全文。"
  },
  {
    "id": "46051449",
    "title": "Show HN: KiDoom – Running DOOM on PCB Traces",
    "url": "https://www.mikeayles.com/#kidoom",
    "summary": "This \"Show HN\" post introduces KiDoom, a project that accomplishes the impressive feat of running the classic game DOOM on PCB traces. This means DOOM isn't running on a conventional processor or microcontroller, but rather directly utilizing the printed circuit board's conductive pathways to execute the game logic.\n\nThe snippet also highlights some related professional experience, likely belonging to the project creator. It mentions developing 3 ECUs (Engine Control Units), possessing over 10 years of experience in the field, and having accrued over 28.5 million miles driven. This suggests the creator has a background in automotive electronics and embedded systems.\n\nThe sections titled \"Selected Projects\" and \"Private Tools\" imply that KiDoom is part of a larger portfolio of projects and that the creator utilizes custom-built tools in their work, adding further credibility and showcasing expertise.\n\nIn essence, the post is a brief announcement of a novel and technically challenging project (KiDoom) demonstrating impressive capabilities in PCB design and embedded systems engineering. It's presented alongside indicators of significant professional experience in related fields, hinting at the creator's expertise and passion for pushing the boundaries of what's possible.\n",
    "chinese_title": "显示 HN: KiDoom – 在 PCB 走线上运行 DOOM",
    "chinese_summary": "这个“Show HN”帖子介绍了KiDoom，一个令人印象深刻的项目，它实现了在PCB走线上运行经典游戏DOOM的壮举。这意味着DOOM不是在传统的处理器或微控制器上运行，而是直接利用印刷电路板的导电通路来执行游戏逻辑。\n\n该片段还突出了作者的一些相关专业经验，很可能是项目创建者本人的。其中提到开发了3个ECU（发动机控制单元），拥有超过10年的行业经验，并且累计行驶超过2850万英里。这表明创建者具有汽车电子和嵌入式系统的背景。\n\n名为“精选项目”和“私人工具”的部分暗示 KiDoom 只是更大项目组合的一部分，并且创建者在其工作中使用了定制工具，这进一步增加了可信度并展示了专业知识。\n\n本质上，这篇文章是对一个新颖且具有技术挑战性的项目 (KiDoom) 的简短公告，展示了 PCB 设计和嵌入式系统工程方面的卓越能力。它与相关领域的重要专业经验指标一起呈现，暗示了创建者的专业知识以及突破可能性的热情。"
  },
  {
    "id": "46070706",
    "title": "RFK Jr.'s new CDC deputy director prefers \"natural immunity\" over vaccines",
    "url": "https://arstechnica.com/health/2025/11/rfk-jr-s-new-cdc-deputy-director-prefers-natural-immunity-over-vaccines/",
    "summary": "Under Health Secretary Robert F. Kennedy Jr., the CDC appointed Ralph Abraham as its principal deputy director. Abraham's appointment has been met with concern due to his history of anti-vaccine views and promotion of unproven COVID-19 treatments.\n\nAs Louisiana's Surgeon General, Abraham delayed informing residents about a whooping cough outbreak and halted mass vaccination campaigns, expressing a preference for \"natural immunity\" over vaccines. He also prescribed hydroxychloroquine and ivermectin for COVID-19, despite their ineffectiveness. In 2021, he was among the top ivermectin prescribers in Louisiana. Furthermore, he has a history of high opioid prescriptions.\n\nAbraham's views align with Kennedy's anti-vaccine stance, conspiracy theories, and support for unproven treatments. Kennedy recently directed the CDC to falsely link vaccines to autism on its website. The appointment is seen as a move to reshape the CDC according to Kennedy's views.\n",
    "chinese_title": "小罗伯特·肯尼迪的新任疾控中心副主任更青睐“自然免疫”而非疫苗",
    "chinese_summary": "在卫生部长小罗伯特·F·肯尼迪领导下，疾控中心任命拉尔夫·亚伯拉罕为首席副主任。由于亚伯拉罕曾持有反疫苗观点并推销未经证实的 COVID-19 疗法，他的任命引起了担忧。\n\n作为路易斯安那州卫生局长，亚伯拉罕延迟通知居民关于百日咳爆发的消息，并停止大规模疫苗接种活动，表达了对“自然免疫”优于疫苗的偏好。他还为 COVID-19 开出了羟氯喹和伊维菌素，尽管这些药物无效。2021 年，他是路易斯安那州伊维菌素处方量最高的医生之一。此外，他还有大量开具阿片类药物处方的历史。\n\n亚伯拉罕的观点与肯尼迪的反疫苗立场、阴谋论以及对未经证实疗法的支持相一致。肯尼迪最近指示疾控中心在其网站上错误地将疫苗与自闭症联系起来。这项任命被视为根据肯尼迪的观点重塑疾控中心的一步。"
  },
  {
    "id": "46064367",
    "title": "Bonsai_term: A library for building dynamic terminal apps by Jane Street",
    "url": "https://github.com/janestreet/bonsai_term",
    "summary": "Bonsai_term is a Jane Street library for building Terminal User Interfaces (TUIs) in OCaml, mirroring the programming model of their bonsai_web library. It's distributed across four repositories: `bonsai_term` (the core library), `bonsai_term_examples`, `bonsai_term_components`, and `bonsai_term_test`.\n\nTo get started, users need to install opam (OCaml's package manager) and OxCaml. Once these are set up, `opam install bonsai_term` will install the library and its dependencies.\n\nThe documentation suggests exploring the `src/bonsai_term.mli` file and the `bonsai_term_examples` repository to understand how to use the library. While `bonsai_web` documentation is a useful resource, users should focus on the \"effect,\" \"state-fulness,\" and \"incrementality\" aspects, as the \"vdom\" parts are web-specific.\n\nThe documentation also provides links to learning resources for OCaml, including the Learn OCaml documentation, the CS 3110 course, and Real World OCaml. Users who have followed the initial installation instructions can skip the \"Install\" sections in these resources. The article also mentions example demos with their source code located in the examples repo.\n",
    "chinese_title": "Bonsai_term: Jane Street 构建动态终端应用程序的库",
    "chinese_summary": "Bonsai_term 是 Jane Street 的一个 OCaml 库，用于构建终端用户界面 (TUI)，其编程模型与他们的 bonsai_web 库相仿。它分布在四个存储库中：`bonsai_term` (核心库)、`bonsai_term_examples`、`bonsai_term_components` 和 `bonsai_term_test`。\n\n要开始使用，用户需要安装 opam (OCaml 的包管理器) 和 OxCaml。安装完成后，`opam install bonsai_term` 将安装该库及其依赖项。\n\n文档建议浏览 `src/bonsai_term.mli` 文件和 `bonsai_term_examples` 存储库，以了解如何使用该库。虽然 `bonsai_web` 文档是一个有用的资源，但用户应重点关注 “effect”、“state-fulness” 和 “incrementality” 方面，因为 “vdom” 部分是特定于 Web 的。\n\n文档还提供了 OCaml 学习资源的链接，包括 Learn OCaml 文档、CS 3110 课程和 Real World OCaml。已按照初始安装说明操作的用户可以跳过这些资源中的“安装”部分。文章还提到了示例演示，其源代码位于 examples 仓库中。"
  },
  {
    "id": "46068147",
    "title": "C64 Burrow.BAS",
    "url": "https://basic-code.bearblog.dev/c64-burrow/",
    "summary": "This article discusses a short Commodore 64 BASIC program, titled \"Burrow.BAS,\" designed as a visual demo rather than a game. The author explains how they embedded the C64 BASIC listing into a blog post and reveals it's based on two one-line programs from a 1985 issue of Run magazine.\n\nThe program consists of two lines. Line 1 sets the border and background colors to yellow. Line 2 uses cursor movement characters and reverse text to create an animation where an asterisk appears to \"burrow\" in a random direction across the screen. The author explains the special characters used, such as \"{yellow}\", \"{up}\", \"{down}\", \"{left}\", \"{right}\", and \"{reverse on}\", and how they are input using the Commodore 64 keyboard and control keys.\n\nThe article also briefly touches on the `PEEK` and `POKE` commands in 8-bit BASIC, explaining that they allow direct access to memory addresses. In this case, `POKE 53280` and `POKE 53281` are used to change the border and background colors, respectively. The random burrowing effect is achieved by randomly selecting a cursor direction code. The author adapted line 1 from another one-liner to enhance the colors.\n",
    "chinese_title": "C64地穴.BAS",
    "chinese_summary": "本文讨论了一个简短的Commodore 64 BASIC程序，名为“Burrow.BAS”，它被设计为一个视觉演示，而非游戏。作者解释了如何将C64 BASIC代码嵌入到博客文章中，并揭示该程序基于1985年Run杂志中的两个单行程序。\n\n该程序由两行代码组成。第1行将边框和背景颜色设置为黄色。第2行使用光标移动字符和反显文本来创建一个动画，其中星号似乎以随机方向在屏幕上“挖洞”。作者解释了使用的特殊字符，例如“{yellow}”、“{up}”、“{down}”、“{left}”、“{right}”和“{reverse on}”，以及如何使用Commodore 64键盘和控制键输入它们。\n\n文章还简要介绍了8位BASIC中的`PEEK`和`POKE`命令，解释说它们允许直接访问内存地址。在本例中，`POKE 53280`和`POKE 53281`分别用于更改边框和背景颜色。随机挖洞效果是通过随机选择光标方向代码来实现的。作者改编了另一行代码中的第1行，以增强颜色效果。"
  },
  {
    "id": "46031664",
    "title": "Ruby Was Ready from the Start",
    "url": "https://obie.medium.com/ruby-was-ready-from-the-start-4b089b17babb",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "Ruby 从一开始就已准备就绪",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "46028339",
    "title": "A Nicotine Analogue I Had Known and Didn't Love: 6-Methylnicotine",
    "url": "https://psychotechnology.substack.com/p/a-nicotine-analogue-i-had-known-and",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "我曾相识却不爱的尼古丁类似物：6-甲基尼古丁",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "46065959",
    "title": "Evaluating Uniform Memory Access Mode on AMD's Turin",
    "url": "https://chipsandcheese.com/p/evaluating-uniform-memory-access",
    "summary": "This article evaluates AMD's Uniform Memory Access (UMA) mode, specifically NPS0, on their Turin (Zen 5) architecture using an EPYC 9575F dual-socket system provided by Verda (formerly DataCrunch.io). NPS0 mode presents a dual-socket system as a single monolithic entity, evenly distributing memory accesses, simplifying programming by avoiding NUMA (Non-Uniform Memory Access) complexities.\n\nThe key finding is that while NPS0 simplifies memory access, it incurs a significant DRAM latency penalty (over 220ns, a 90ns increase compared to NPS1). Although NPS0 offers higher memory bandwidth, this advantage isn't realized until bandwidth demands are extremely high.\n\nDespite the higher latency, the EPYC 9575F performs surprisingly well in SPEC CPU2017 benchmarks, thanks to its higher 5 GHz clock speed and effective caching. Workloads with high cache hit rates benefit from the increased clock speed, while memory-intensive workloads suffer from the higher latency.\n\nThe article concludes that using NPS0 mode might not be worthwhile in modern systems due to the substantial latency penalty and minimal bandwidth gains for NUMA-unaware code. As server core and memory controller counts increase, optimizing for NUMA becomes increasingly important for workloads needing to scale across sockets. The article highlights the importance of both clock speed and effective caching to compensate for memory latency in modern CPUs.\n",
    "chinese_title": "评估AMD Turin上的统一内存访问模式",
    "chinese_summary": "本文评估了AMD Turin (Zen 5) 架构上采用的统一内存访问 (UMA) 模式，特别是NPS0模式，使用的系统是由Verda (原DataCrunch.io) 提供的EPYC 9575F双路服务器。 NPS0模式将双路系统呈现为一个单一的整体，均匀分配内存访问，并通过避免NUMA (非统一内存访问) 的复杂性来简化编程。\n\n主要发现是，虽然NPS0简化了内存访问，但会带来显著的DRAM延迟惩罚（超过220ns，比NPS1增加了90ns）。 尽管NPS0提供了更高的内存带宽，但只有在带宽需求极高时才能实现这一优势。\n\n尽管延迟较高，但由于更高的5 GHz时钟速度和有效的缓存，EPYC 9575F在SPEC CPU2017基准测试中表现出人意料的良好性能。 具有高缓存命中率的工作负载受益于更高的时钟速度，而内存密集型工作负载则受到更高延迟的影响。\n\n文章总结认为，由于NUMA-感知不足的代码存在巨大的延迟惩罚和最小的带宽增益，因此在现代系统中采用NPS0模式可能并不值得。 随着服务器核心和内存控制器数量的增加，针对需要在多个插槽上扩展的工作负载，优化NUMA变得越来越重要。 本文强调了时钟速度和有效缓存对于弥补现代CPU内存延迟的重要性。"
  },
  {
    "id": "46066736",
    "title": "DNS Firewalling with MISP and Technitium DNS Server",
    "url": "https://zaferbalkan.com/technitium-misp/",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "使用 MISP 和 Technitium DNS 服务器的 DNS 防火墙",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "46061239",
    "title": "Alan.app – Add a Border to macOS Active Window",
    "url": "https://tyler.io/2025/11/alan/",
    "summary": "This article introduces \"Alan.app,\" a small macOS application designed to improve window visibility by adding a customizable border to the active window. The author created Alan to address issues with window contrast on macOS, potentially due to aging eyesight or design choices.\n\nAlan's preferences allow users to select their desired border width and colors, with separate settings for light and dark modes. The app is simple and focuses on providing this single, focused function.\n\nUsers can download a notarized copy of Alan from the provided link. The article also includes a short demo video showcasing the app in action.\n\nFinally, the author provides instructions on how to hide Alan's icon from the Dock via a Terminal command, allowing for a cleaner user interface.\n",
    "chinese_title": "Alan.app – 为 macOS 活跃窗口添加边框",
    "chinese_summary": "本文介绍了“Alan.app”，一个小型 macOS 应用程序，旨在通过为活动窗口添加可自定义的边框来提高窗口可见性。作者创建 Alan 是为了解决 macOS 上窗口对比度的问题，这可能是由于视力老化或设计选择造成的。\n\nAlan 的偏好设置允许用户选择所需的边框宽度和颜色，并为浅色和深色模式提供单独的设置。该应用程序简单易用，专注于提供这一单一、专注的功能。\n\n用户可以从提供的链接下载经过公证的 Alan 副本。本文还包含一个简短的演示视频，展示了该应用程序的实际效果。\n\n最后，作者提供了关于如何通过 Terminal 命令从 Dock 中隐藏 Alan 图标的说明，从而实现更简洁的用户界面。"
  },
  {
    "id": "46058033",
    "title": "Compressed filesystems à la language models",
    "url": "https://grohan.co/2025/11/25/llmfuse/",
    "summary": "This article details an experiment exploring the potential of language models (LLMs) to act as the backend for a compressed filesystem. The author trained an LLM (Qwen3-4b) to model filesystem operations and state by fine-tuning it on a dataset of FUSE operations and corresponding XML representations of filesystem trees.\n\nThe author then created a FUSE filesystem, LLMFuse, where every operation was passed to the LLM for \"execution.\"  The key innovation was leveraging arithmetic coding, a reversible compression algorithm that utilizes the LLM's probabilistic predictions to compress the XML filesystem representation.  Because the LLM was trained on this specific XML format, it could \"self-compress\" the data far more effectively than traditional methods like gzip.\n\nThe results showed dramatic compression improvements using arithmetic coding with the fine-tuned LLM, significantly outperforming gzip and even squashfs, a dedicated compressed filesystem tool.  The author achieved approximately 8x better compression compared to squashfs for a simple filesystem tree.\n\nWhile acknowledging the limitations (high computational cost, reliance on context window size, and applicability to mainly text data), the author suggests that the experiment hints at a potential future where LLMs are used for data compression, particularly for text-heavy data in specialized workflows, or when running LLMs at the edge becomes feasible. The source code for the project, llmfuse and llmencode, is open-sourced.\n",
    "chinese_title": "压缩文件系统：类语言模型",
    "chinese_summary": "本文详细介绍了一项实验，该实验探索了语言模型（LLM）作为压缩文件系统后端的潜力。作者通过在 FUSE 操作和相应的文件系统树 XML 表示的数据集上微调 LLM (Qwen3-4b)，来建模文件系统操作和状态。\n\n作者随后创建了一个 FUSE 文件系统 LLMFuse，其中每个操作都传递给 LLM 进行“执行”。 关键创新在于利用算术编码，这是一种可逆压缩算法，它利用 LLM 的概率预测来压缩 XML 文件系统表示。 因为 LLM 是在这个特定的 XML 格式上训练的，所以它可以比 gzip 等传统方法更有效地“自压缩”数据。\n\n结果表明，使用算术编码和微调后的 LLM 可以显著提高压缩性能，明显优于 gzip 甚至专用压缩文件系统工具 squashfs。 对于一个简单的文件系统树，作者实现了比 squashfs 大约 8 倍的压缩率提升。\n\n虽然承认存在局限性（高计算成本、对上下文窗口大小的依赖以及对主要文本数据的适用性），但作者认为，该实验暗示了 LLM 在未来可能用于数据压缩，尤其是在专门工作流程中的文本密集型数据，或者当在边缘运行 LLM 变得可行时。 该项目的源代码 llmfuse 和 llmencode 已开源。"
  },
  {
    "id": "46060534",
    "title": "A temporary victory – but we still need to stop Chat Control",
    "url": "https://mullvad.net/en/blog/an-important-victory-but-we-still-need-to-stop-chat-control",
    "summary": "This article discusses the current state of the EU's proposed \"Chat Control\" legislation. While the Council of Ministers has removed the requirement for mandatory scanning of end-to-end encrypted messaging services, a significant victory, the article argues that the fight is far from over.\n\nThe Council's proposal still lays the groundwork for future mass surveillance. It includes provisions for voluntary scanning, vaguely worded age verification requirements that could necessitate ID checks, and a three-year review process where mandatory scanning will be reconsidered. Furthermore, the proposal introduces a new infrastructure for blocking content deemed illegal by individual member states.\n\nThe core concern is the introduction of AI-driven scanning for \"new material\" and \"grooming,\" which the article claims will lead to numerous false positives and unwarranted scrutiny of private communications. The collected data will be analyzed by a new EU center, effectively creating a mass surveillance system operating without suspicion or court orders. Concerns are raised about cooperation with American companies and the potential for expanded scanning based on requests like those from Europol.\n\nThe article emphasizes the potential for mandatory ID verification, which would jeopardize anonymity for whistleblowers, journalists' sources, and individuals critical of authoritarian regimes. The establishment of a blocking infrastructure also raises censorship concerns, where content legal in one country could be blocked based on the laws of another. The article concludes by asserting that the goal of mass surveillance remains a key ambition of the Commission and many Council member states and calls for continued resistance to Chat Control and other similar initiatives like ProtectEU, which aim to undermine encryption.\n",
    "chinese_title": "暂时的胜利——但我们仍需阻止聊天监控",
    "chinese_summary": "本文探讨了欧盟拟议的“聊天控制”立法现状。尽管部长理事会已取消了对端到端加密消息服务进行强制扫描的要求，这是一个重大胜利，但本文认为这场斗争远未结束。\n\n理事会的提案仍然为未来的大规模监控奠定了基础。它包括自愿扫描的规定，措辞含糊的年龄验证要求（可能需要身份验证），以及一个三年审查流程，届时将重新考虑强制扫描。此外，该提案引入了一种新的基础设施，用于阻止个别成员国认为非法的的内容。\n\n核心问题在于引入人工智能驱动的“新材料”和“诱导”扫描，本文声称这将导致大量误报，并对私人通信进行不必要的审查。收集到的数据将由一个新的欧盟中心分析，有效地创建一个无需怀疑或法院命令即可运行的大规模监控系统。人们对与美国公司的合作以及基于欧洲刑警组织等机构的要求扩大扫描的可能性表示担忧。\n\n本文强调了强制身份验证的潜在可能性，这将危及告密者、记者消息来源以及批评专制政权的个人的匿名性。建立封锁基础设施也引发了审查担忧，即在一个国家合法的內容可能会因另一个国家的法律而被封锁。本文最后断言，大规模监控的目标仍然是欧盟委员会和许多理事会成员国的主要野心，并呼吁继续抵制“聊天控制”以及其他类似的旨在破坏加密的倡议，如 ProtectEU。"
  },
  {
    "id": "46027878",
    "title": "Show HN: Safe-NPM – only install packages that are +90 days old",
    "url": "https://github.com/kevinslin/safe-npm",
    "summary": "Safe-NPM is a security-focused npm installer that protects projects from supply chain attacks by only installing package versions that are at least 90 days old by default. This delay gives the security community time to identify and report malicious releases before they impact your project.\n\nThe tool works by querying the npm registry, filtering available versions based on age and semver requirements, and then installing the oldest safe version using npm. Safe-NPM provides various configuration options, including:\n\n*   `--min-age-days`: Adjust the minimum age requirement.\n*   `--ignore`: Exclude specific trusted packages from the age restriction.\n*   `--strict`: Enforce age requirements and fail if a dependency cannot be resolved.\n*   `--dev/--prod-only`: Target specific dependency types.\n\nCommon use cases include securing new projects, auditing existing ones, and CI/CD integration.\n\nSafe-NPM mitigates risks associated with compromised packages by delaying updates, allowing for the discovery of malicious code. However, it doesn't protect against packages that are malicious from the start and delays access to new features. It is one layer of defense and should be used in conjunction with other security practices such as regular security audits and dependency review.\n",
    "chinese_title": "Show HN: Safe-NPM – 只安装90天以上的软件包",
    "chinese_summary": "Safe-NPM：一款安全至上的npm安装器，默认只安装至少90天前的软件包版本，以保护项目免受供应链攻击。这种延迟使安全社区有时间在恶意版本影响您的项目之前识别并报告它们。\n\n该工具通过查询npm注册表，根据发布时间和语义版本要求过滤可用版本，然后使用npm安装最旧的安全版本。Safe-NPM提供多种配置选项，包括：\n\n*   `--min-age-days`：调整最短发布时间要求。\n*   `--ignore`：从时间限制中排除特定的受信任软件包。\n*   `--strict`：强制执行时间要求，如果无法解析依赖项则失败。\n*   `--dev/--prod-only`：指定目标依赖项类型。\n\n常见的用例包括保护新项目、审计现有项目以及CI/CD集成。\n\nSafe-NPM通过延迟更新来降低与受损软件包相关的风险，从而为发现恶意代码争取时间。但是，它不能防止从一开始就具有恶意的软件包，并且会延迟对新功能的访问。它是一种防御层，应与其他安全实践（如定期安全审计和依赖项审查）结合使用。"
  },
  {
    "id": "46030325",
    "title": "How Does Microwaving Grapes Create Plumes of Plasma?",
    "url": "https://www.pbs.org/wgbh/nova/article/how-does-microwaving-grapes-create-plumes-plasma/",
    "summary": "This article explores the science behind the viral phenomenon of creating plasma by microwaving grapes. For years, the physics behind this trick was poorly understood, but recent research has finally explained the process.\n\nThe key is the concentration of microwave energy. When two grapes (or similar round, water-containing objects like blueberries) are placed touching in a microwave, the energy concentrates at the point of contact between them. The microwaves, which have a wavelength of 12.5 cm, are funneled into the tiny space (millimeters wide) between the grapes. This creates an intense electric field powerful enough to strip electrons from atoms, ionizing the gases and creating plasma. A single grape won't work because the energy concentrates at its center, not intensely enough for ionization.\n\nResearchers debunked the myth that halved grapes are necessary. The size of the fruit is also important: grapes are ideally sized for typical microwave wavelengths, while larger fruits like tomatoes don't concentrate the energy sufficiently.\n\nBeyond a parlor trick, this phenomenon offers a way to study nanophotonics (light on the nanometer scale) using readily available equipment. While replicating the effect with visible light requires adjustments, the grape-microwave experiment allows for a larger-scale visualization of light concentration in small spaces.\n\nDespite the scientific findings, the researchers strongly advise against attempting this at home due to the risk of damaging the microwave and potential safety hazards associated with plasma. Their research itself led to the destruction of numerous fruits and even several microwaves.\n",
    "chinese_title": "微波葡萄如何产生等离子体羽流？",
    "chinese_summary": "微波炉葡萄产生等离子体的科学原理\n\n本文探讨了微波炉加热葡萄产生等离子体这一爆红现象背后的科学原理。多年来，这一现象的物理机制一直未被充分理解，但最近的研究终于对其原理做出了解释。\n\n关键在于微波能量的集中。当两个葡萄（或类似的圆形、含水物体，如蓝莓）彼此接触地放置在微波炉中时，能量会集中在它们之间的接触点上。波长为12.5厘米的微波被导入到葡萄之间微小的空间（几毫米宽）中。这会产生一个强大的电场，足以从原子中剥离电子，从而电离气体并产生等离子体。单个葡萄不起作用，因为能量集中在其中心，强度不足以实现电离。\n\n研究人员驳斥了葡萄需要对半切开的神话。水果的大小也很重要：葡萄的大小非常适合典型的微波波长，而像西红柿这样较大的水果则无法充分集中能量。\n\n除了是一种消遣把戏外，这种现象还提供了一种利用现成设备研究纳米光子学（纳米尺度上的光）的方法。虽然用可见光复制该效果需要调整，但葡萄微波实验可以更大规模地可视化小空间中的光集中。\n\n尽管有科学发现，研究人员强烈建议不要在家中尝试此实验，因为存在损坏微波炉的风险以及与等离子体相关的潜在安全隐患。他们的研究本身就导致了大量水果甚至几台微波炉的损坏。"
  },
  {
    "id": "46027348",
    "title": "Making my 1970's-style renderer multi-threaded",
    "url": "https://filiph.net/text/making-my-1970s-renderer-multi-threaded.html",
    "summary": "Filip Hráček details his journey of making a retro 3D renderer in his Flutter game multi-threaded. Initially, the renderer, though software-based, ran acceptably fast on the main thread due to optimized use of `Canvas.drawVertices` and `TypedData` (specifically `Float32List`) to minimize memory allocation.\n\nHowever, as the game grew in complexity and he desired compatibility with less powerful machines, the renderer's CPU usage (20-30% on Windows) became a concern. He sought to move the rendering to a separate thread.\n\nDart's isolate-based concurrency, which avoids shared mutable memory, posed a challenge since copying or transferring typed data buffers between isolates every frame was undesirable. He bypassed this using Dart's Foreign Function Interface (FFI) to allocate memory on the native heap, allowing shared mutable arrays between isolates.\n\nThe process involved the main isolate and a worker isolate communicating via messages, allocating shared buffers using `malloc.allocate`, and using a double-buffering strategy to prevent concurrent modification. The worker isolate renders into one buffer while the main isolate uses the other for drawing. The main thread creates RenderResults and uses the data to repaint the CustomPainter.\n\nThe result was a performance improvement, reducing the main thread's CPU time for 3D rendering by 20% on his M4 MacBook Pro, significantly freeing up resources.\n\nHe also touches on the Dart team's potential future support for shared mutable memory and his experience (mostly negative) trying to use AI to aid in the task. He sees AI as useful for simple function or test generation rather than complex architectural tasks.\n",
    "chinese_title": "将我的 70 年代风格渲染器多线程化",
    "chinese_summary": "Filip Hráček详述了他如何在Flutter游戏中使用多线程来制作复古3D渲染器的过程。最初，尽管渲染器是基于软件的，但由于优化使用了`Canvas.drawVertices`和`TypedData`（特别是`Float32List`）来最小化内存分配，因此在主线程上运行速度尚可。\n\n然而，随着游戏复杂性的增加以及他希望与性能较低的机器兼容，渲染器的CPU使用率（在Windows上为20-30%）成为一个问题。他试图将渲染移动到单独的线程。\n\nDart基于isolate的并发机制避免了共享可变内存，这构成了一个挑战，因为每帧在isolate之间复制或传输类型化数据缓冲区是不可取的。他利用Dart的外部函数接口（FFI）在原生堆上分配内存来绕过这个问题，从而允许isolate之间共享可变数组。\n\n该过程涉及主isolate和worker isolate通过消息进行通信，使用`malloc.allocate`分配共享缓冲区，并使用双缓冲策略来防止并发修改。worker isolate渲染到一个缓冲区，而主isolate使用另一个缓冲区进行绘制。主线程创建RenderResults并使用数据来重绘CustomPainter。\n\n结果是性能得到了提升，在他的M4 MacBook Pro上，主线程用于3D渲染的CPU时间减少了20%，显著释放了资源。\n\n他还提到了Dart团队未来可能对共享可变内存的支持，以及他尝试使用AI来辅助完成任务的经验（大部分是负面的）。他认为AI适用于生成简单的函数或测试，而不是复杂的架构任务。"
  },
  {
    "id": "46064065",
    "title": "DSP 101 Part 1: An Introductory Course in DSP System Design",
    "url": "https://www.analog.com/en/resources/analog-dialogue/articles/dsp-101-part-1.html",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "DSP 101 第一部分：DSP系统设计入门课程",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "46016288",
    "title": "Show HN: I turned algae into a bio-altimeter and put it on a weather balloon",
    "url": "https://radi8.dev/blog/stratospore/",
    "summary": "Here's a summary of the article based on the title and the likely content:\n\nThe \"Show HN\" post details a project where the author turned algae into a bio-altimeter and launched it on a weather balloon. The core concept is to use the natural response of algae to changes in atmospheric conditions (likely UV radiation levels or temperature shifts at different altitudes) as a way to measure and record altitude during the balloon flight.\n\nThe author likely modified algae, possibly genetically, to produce a measurable signal (e.g., fluorescence, color change, or specific molecule production) in response to specific environmental conditions encountered at different altitudes. This signal would then be correlated to the altitude reached by the weather balloon. The blog post likely describes the process of preparing the algae, designing a suitable container to house the algae for the duration of the flight, and integrating this container with the weather balloon's payload.\n\nThe article probably also outlines the data collection methods. This might involve capturing images of the algae during the flight (if the signal is visible) or collecting samples for later analysis to determine the changes induced by the stratospheric conditions. The analysis of the algae sample collected would be performed to infer the altitude profile of the flight.\n\nFinally, the post likely discusses the challenges faced during the project, the results obtained (whether successful or not in accurately measuring altitude), and potential future directions for similar bio-sensing applications in atmospheric research or citizen science projects. The author might showcase some images and data visualizations from the flight.\n",
    "chinese_title": "展示HN：我把藻类变成生物高度计，然后把它放在气象气球上",
    "chinese_summary": "基于标题和可能内容的文章摘要：\n\n这篇“Show HN”帖子详细介绍了一个项目，作者将藻类转化为生物高度计，并将其搭载在气象气球上发射升空。核心概念是利用藻类对大气条件变化（可能是不同高度的紫外线辐射水平或温度变化）的自然反应，作为测量和记录气球飞行期间高度的方法。\n\n作者可能对藻类进行了改造，可能是基因改造，以产生可测量的信号（例如，荧光、颜色变化或特定分子的产生），从而响应在不同高度遇到的特定环境条件。然后，该信号将与气象气球达到的高度相关联。这篇博客文章可能描述了准备藻类的过程，设计一个合适的容器来容纳藻类在飞行期间，并将该容器与气象气球的有效载荷集成。\n\n文章可能还概述了数据收集方法。这可能涉及在飞行期间捕获藻类的图像（如果信号可见），或收集样本以供后续分析，以确定由平流层条件引起的改变。对收集的藻类样本的分析将用于推断飞行的海拔剖面。\n\n最后，该帖子可能讨论了项目期间面临的挑战、获得的结果（无论是否成功地准确测量了高度），以及未来在气候研究或公民科学项目中类似生物传感应用的潜在方向。作者可能会展示一些来自飞行的图像和数据可视化。"
  },
  {
    "id": "46068404",
    "title": "We are all mosaics: genetic diversity found between cells in a single person",
    "url": "https://www.nature.com/articles/d41586-025-03768-0",
    "summary": "Researchers have conducted a detailed genetic analysis of over 100 individual cells from a single 74-year-old man, revealing significant genetic variation, or mosaicism, within a single person. The study uncovered instances of missing or extra chromosome segments, altered DNA snippets, and even the complete loss of the Y chromosome in some cells.\n\nThis research, currently a preprint on bioRxiv, serves as a pilot project for a larger consortium aiming to catalogue cellular mutations across 19 body sites using samples from 150 donors. The resulting data will provide a crucial resource for understanding the impact of mosaicism on human health and disease, especially cancer.\n\nThe accumulation of DNA changes throughout life, due to replication errors, environmental factors, or other causes, is a known phenomenon. However, analyzing mosaicism has been challenging due to the limitations of bulk DNA sequencing, which struggles to detect rare variants present in only a few cells. Single-cell RNA sequencing is more common, but DNA sequencing of individual cells is more difficult, despite its importance.\n\nThis new comprehensive genetic portrait highlights the widespread nature of mosaicism and its potential implications for various diseases, reinforcing the need for further research in this area. The research could accelerate studies in this field, especially in areas like cancer, where cellular DNA mutations can play a causative role.\n",
    "chinese_title": "我们都是马赛克：单个人体内细胞间的基因多样性",
    "chinese_summary": "研究人员对一位74岁男性100多个单个细胞进行了详细的基因分析，揭示了单个个体内部存在显著的基因变异，即嵌合现象。该研究发现了一些细胞中存在染色体片段缺失或增加、DNA片段改变，甚至Y染色体完全丢失的情况。\n\n这项研究目前以预印本形式发表在bioRxiv上，是更大规模联盟的一个试点项目，该联盟旨在使用150名捐赠者的样本，编录19个身体部位的细胞突变。由此产生的数据将为理解嵌合现象对人类健康和疾病（尤其是癌症）的影响提供关键资源。\n\n由于复制错误、环境因素或其他原因，DNA变化在生命过程中积累是一种已知现象。然而，由于批量DNA测序的局限性（难以检测仅存在于少数细胞中的罕见变异），分析嵌合现象一直具有挑战性。单细胞RNA测序更为常见，但尽管单细胞DNA测序非常重要，难度却更大。\n\n这项新的综合基因图谱突显了嵌合现象的广泛性及其对各种疾病的潜在影响，从而强调了在该领域进行进一步研究的必要性。这项研究可以加速该领域的研究，尤其是在癌症等领域，因为细胞DNA突变可能起致病作用。"
  },
  {
    "id": "46069943",
    "title": "RIP David Lerner, a Mr. Fix-It of Apple Computers, Co-Founder of Tekserve",
    "url": "https://www.nytimes.com/2025/11/26/technology/personaltech/david-lerner-dead.html",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "苹果电脑的维修大师、Tekserve联合创始人 David Lerner 安息",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "46068731",
    "title": "Solving the Partridge square packing problem using MiniZinc",
    "url": "https://zayenz.se/blog/post/partridge-packing/",
    "summary": "生成摘要时出错",
    "chinese_title": "Solving the Partridge square packing problem using MiniZinc",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46055935",
    "title": "A cell so minimal that it challenges definitions of life",
    "url": "https://www.quantamagazine.org/a-cell-so-minimal-that-it-challenges-definitions-of-life-20251124/",
    "summary": "生成摘要时出错",
    "chinese_title": "A cell so minimal that it challenges definitions of life",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46059737",
    "title": "DRAM prices are spiking, but I don't trust the industry's why",
    "url": "https://www.xda-developers.com/dram-prices-spiking-dont-trust-industry-reasons/",
    "summary": "生成摘要时出错",
    "chinese_title": "DRAM prices are spiking, but I don't trust the industry's why",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46068618",
    "title": "Tiny tweak for Pi OS, big makeover for the Imager",
    "url": "https://www.theregister.com/2025/11/27/new_raspberry_pi_imager/",
    "summary": "生成摘要时出错",
    "chinese_title": "Tiny tweak for Pi OS, big makeover for the Imager",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46055177",
    "title": "Image Diffusion Models Exhibit Emergent Temporal Propagation in Videos",
    "url": "https://arxiv.org/abs/2511.19936",
    "summary": "生成摘要时出错",
    "chinese_title": "Image Diffusion Models Exhibit Emergent Temporal Propagation in Videos",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46038417",
    "title": "PRC elites voice AI-skepticism",
    "url": "https://jamestown.org/prc-elites-voice-ai-skepticism/",
    "summary": "生成摘要时出错",
    "chinese_title": "PRC elites voice AI-skepticism",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46025223",
    "title": "JOPA: Java compiler in C++, Jikes modernized to Java 6 with Claude",
    "url": "https://github.com/7mind/jopa",
    "summary": "生成摘要时出错",
    "chinese_title": "JOPA: Java compiler in C++, Jikes modernized to Java 6 with Claude",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46067612",
    "title": "Necroprinting – Dead mosquito proboscis used for high-resolution 3D printing",
    "url": "https://www.tomshardware.com/3d-printing/dead-mosquito-proboscis-used-for-high-resolution-3d-printing-nozzle-scientists-boast-of-the-extremely-fine-output-from-necroprinting",
    "summary": "生成摘要时出错",
    "chinese_title": "Necroprinting – Dead mosquito proboscis used for high-resolution 3D printing",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46018226",
    "title": "Cardiac implantable electronic devices' longevity: A novel modelling tool",
    "url": "https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0333195",
    "summary": "生成摘要时出错",
    "chinese_title": "Cardiac implantable electronic devices' longevity: A novel modelling tool",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46048996",
    "title": "Google Antigravity exfiltrates data via indirect prompt injection attack",
    "url": "https://www.promptarmor.com/resources/google-antigravity-exfiltrates-data",
    "summary": "生成摘要时出错",
    "chinese_title": "Google Antigravity exfiltrates data via indirect prompt injection attack",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46055421",
    "title": "Statistical Process Control in Python",
    "url": "https://timothyfraser.com/sigma/statistical-process-control-in-python.html",
    "summary": "生成摘要时出错",
    "chinese_title": "Statistical Process Control in Python",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46063915",
    "title": "AdBlock and Signal are for terrorists, according to French govt (2023) [video]",
    "url": "https://www.youtube.com/watch?v=1q1hjmwLqe4",
    "summary": "生成摘要时出错",
    "chinese_title": "AdBlock and Signal are for terrorists, according to French govt (2023) [video]",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46036908",
    "title": "Show HN: I built an interactive HN Simulator",
    "url": "https://news.ysimulator.run/news",
    "summary": "生成摘要时出错",
    "chinese_title": "Show HN: I built an interactive HN Simulator",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46061623",
    "title": "Don't Download Apps",
    "url": "https://blog.calebjay.com/posts/dont-download-apps/",
    "summary": "生成摘要时出错",
    "chinese_title": "Don't Download Apps",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46048125",
    "title": "Ilya Sutskever: We're moving from the age of scaling to the age of research",
    "url": "https://www.dwarkesh.com/p/ilya-sutskever-2",
    "summary": "生成摘要时出错",
    "chinese_title": "Ilya Sutskever: We're moving from the age of scaling to the age of research",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46045085",
    "title": "Trillions spent and big software projects are still failing",
    "url": "https://spectrum.ieee.org/it-management-software-failures",
    "summary": "生成摘要时出错",
    "chinese_title": "Trillions spent and big software projects are still failing",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46042810",
    "title": "Jakarta is now the biggest city in the world",
    "url": "https://www.axios.com/2025/11/24/jakarta-tokyo-worlds-biggest-city-population",
    "summary": "生成摘要时出错",
    "chinese_title": "Jakarta is now the biggest city in the world",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46045385",
    "title": "Constant-time support coming to LLVM: Protecting cryptographic code",
    "url": "https://blog.trailofbits.com/2025/11/25/constant-time-support-coming-to-llvm-protecting-cryptographic-code-at-the-compiler-level/",
    "summary": "生成摘要时出错",
    "chinese_title": "Constant-time support coming to LLVM: Protecting cryptographic code",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46045039",
    "title": "Making Crash Bandicoot (2011)",
    "url": "https://all-things-andy-gavin.com/video-games/making-crash/",
    "summary": "生成摘要时出错",
    "chinese_title": "Making Crash Bandicoot (2011)",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46034189",
    "title": "Show HN: Yolodex – real-time customer enrichment API",
    "url": "https://api.yolodex.ai",
    "summary": "生成摘要时出错",
    "chinese_title": "Show HN: Yolodex – real-time customer enrichment API",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46053262",
    "title": "BebboSSH: SSH2 implementation for Amiga systems (68000, GPLv3)",
    "url": "https://franke.ms/git/bebbo/bebbossh",
    "summary": "生成摘要时出错",
    "chinese_title": "BebboSSH: SSH2 implementation for Amiga systems (68000, GPLv3)",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46051340",
    "title": "Someone at YouTube Needs Glasses: The Prophecy Has Been Fulfilled",
    "url": "https://jayd.ml/2025/11/10/someone-at-youtube-needs-glasses-prophecy-fulfilled.html",
    "summary": "生成摘要时出错",
    "chinese_title": "Someone at YouTube Needs Glasses: The Prophecy Has Been Fulfilled",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46021577",
    "title": "Surprisingly, Emacs on Android is pretty good",
    "url": "https://kristofferbalintona.me/posts/202505291438/",
    "summary": "生成摘要时出错",
    "chinese_title": "Surprisingly, Emacs on Android is pretty good",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46069161",
    "title": "Comparing the Genesis Mission to the Manhattan Project",
    "url": "https://tickerfeed.net/articles/whitehouse-genesis-mission-bailout-openai-nvidia",
    "summary": "生成摘要时出错",
    "chinese_title": "Comparing the Genesis Mission to the Manhattan Project",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46064990",
    "title": "CDE – Common Desktop Environment – Release 2.5.3",
    "url": "https://sourceforge.net/p/cdesktopenv/code/ci/e945fc8b08a4882769e29f20fbbb29afe6019da1/",
    "summary": "生成摘要时出错",
    "chinese_title": "CDE – Common Desktop Environment – Release 2.5.3",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45998392",
    "title": "Comic Code Reviews",
    "url": "https://www.jona.ca/2025/11/comic-code-reviews.html",
    "summary": "生成摘要时出错",
    "chinese_title": "Comic Code Reviews",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46056757",
    "title": "Qiskit open-source SDK for working with quantum computers",
    "url": "https://github.com/Qiskit/qiskit",
    "summary": "生成摘要时出错",
    "chinese_title": "Qiskit open-source SDK for working with quantum computers",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46047053",
    "title": "New layouts with CSS Subgrid",
    "url": "https://www.joshwcomeau.com/css/subgrid/",
    "summary": "生成摘要时出错",
    "chinese_title": "New layouts with CSS Subgrid",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46065870",
    "title": "$96M AUD revamp of Bom website bombs out on launch",
    "url": "https://www.bbc.com/news/articles/c2k4dy15nqqo",
    "summary": "生成摘要时出错",
    "chinese_title": "$96M AUD revamp of Bom website bombs out on launch",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46065585",
    "title": "What to know about a recent Mixpanel security incident",
    "url": "https://openai.com/index/mixpanel-incident",
    "summary": "生成摘要时出错",
    "chinese_title": "What to know about a recent Mixpanel security incident",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46066381",
    "title": "Elevating Intelligence via Efficient Model and Tool Orchestration",
    "url": "https://arxiv.org/abs/2511.21689",
    "summary": "生成摘要时出错",
    "chinese_title": "Elevating Intelligence via Efficient Model and Tool Orchestration",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46065449",
    "title": "Show HN: MakeSkill – The Intelligent Skill Builder for Claude",
    "url": "https://makeskill.cc",
    "summary": "生成摘要时出错",
    "chinese_title": "Show HN: MakeSkill – The Intelligent Skill Builder for Claude",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46016579",
    "title": "Java Decompiler",
    "url": "http://java-decompiler.github.io",
    "summary": "生成摘要时出错",
    "chinese_title": "Java Decompiler",
    "chinese_summary": "生成摘要时出错"
  }
]