[
  {
    "id": "45812606",
    "title": "Pg_lake: Postgres with Iceberg and data lake access",
    "url": "https://github.com/Snowflake-Labs/pg_lake",
    "summary": "Pg_lake brings data lake functionality to PostgreSQL, allowing users to leverage Postgres as a lakehouse system. It integrates Iceberg and allows direct querying of data lake files (Parquet, CSV, JSON) stored in object stores like S3. Key capabilities include creating and modifying Iceberg tables transactionally, importing/exporting data with COPY commands, reading geospatial formats, transparent compression, and combining different data sources (heap, Iceberg, external files) in SQL queries.\n\npg_lake utilizes DuckDB's query engine for performance through a separate process, `pgduck_server`, communicating via the PostgreSQL wire protocol. This avoids limitations of embedding DuckDB directly within Postgres.\n\nSetup involves using Docker for a ready-to-run environment or building from source. Initialization includes creating required PostgreSQL extensions and running `pgduck_server`. Configuration requires setting up cloud credentials and the default Iceberg location.\n\nThe architecture comprises PostgreSQL with pg_lake extensions and the `pgduck_server`. pg_lake is designed modularly with extensions handling Iceberg, foreign data wrappers, COPY operations, and more. Components include: `pg_lake_iceberg`, `pg_lake_table`, `pg_lake_copy`, `pg_lake_engine`, `pg_extension_base`, `pg_extension_updater`, `pg_lake_benchmark`, `pg_map`, `pgduck_server`, and `duckdb_pglake`.\n\nOriginally developed at Crunchy Data as Crunchy Bridge for Analytics, the project was open-sourced by Snowflake as pg_lake.\n",
    "chinese_title": "Pg_lake：具有Iceberg和数据湖访问功能的Postgres",
    "chinese_summary": "Pg_lake 将数据湖功能引入 PostgreSQL，使用户能够将 Postgres 用作湖仓一体系统。它集成了 Iceberg，并允许直接查询存储在 S3 等对象存储中的数据湖文件（Parquet、CSV、JSON）。主要功能包括事务性地创建和修改 Iceberg 表、使用 COPY 命令导入/导出数据、读取地理空间格式、透明压缩以及在 SQL 查询中组合不同的数据源（堆、Iceberg、外部文件）。\n\npg_lake 利用 DuckDB 的查询引擎通过一个单独的进程 `pgduck_server` 来提高性能，该进程通过 PostgreSQL wire 协议进行通信。这避免了将 DuckDB 直接嵌入 Postgres 的限制。\n\n设置包括使用 Docker 获取一个即用型环境，或从源代码构建。初始化包括创建所需的 PostgreSQL 扩展并运行 `pgduck_server`。配置需要设置云凭证和默认的 Iceberg 位置。\n\n该架构包括带有 pg_lake 扩展的 PostgreSQL 和 `pgduck_server`。pg_lake 采用模块化设计，其扩展处理 Iceberg、外部数据包装器、COPY 操作等。组件包括：`pg_lake_iceberg`、`pg_lake_table`、`pg_lake_copy`、`pg_lake_engine`、`pg_extension_base`、`pg_extension_updater`、`pg_lake_benchmark`、`pg_map`、`pgduck_server` 和 `duckdb_pglake`。\n\n该项目最初由 Crunchy Data 开发为 Crunchy Bridge for Analytics，后由 Snowflake 作为 pg_lake 开源。"
  },
  {
    "id": "45811093",
    "title": "Show HN: A CSS-Only Terrain Generator",
    "url": "https://terra.layoutit.com",
    "summary": "This \"Show HN\" post introduces Layoutit Terra, a CSS Terrain Generator. It's a tool that allows users to create terrain landscapes directly using CSS, meaning no JavaScript or images are required.\n\nThe interface provides various controls for customizing the terrain, including:\n\n*   **Regeneration:** Users can generate new landscapes with a single click.\n*   **Undo/Redo:** Basic editing functionality for experimenting with changes.\n*   **Import/Export:** Ability to import custom heightmaps and export the generated terrain in various formats (CSS, VOX, TXT, PNG).\n*   **Code Export:** Options to copy the CSS code, embed the generator, open the project in Codepen, or download the entire code.\n*   **Terrain Manipulation:** Tools to move, raise, and lower terrain features, and adjust the world size.\n*   **Terrain Parameters:** Controls for Landmass Coverage (small, medium, large), Terrain Type (pampas, hilly, alpinist), and Biome (temperate, arctic, desert).\n*   **Camera Settings:** Adjustable camera parameters such as rotate x, tilt y, zoom, pan x, and lift y, as well as an option to animate the view.\n*   **Visualization Options:** Minimap, heightmap, and matrix views of the terrain.\n\nThe tool seems to be in its early stages (v0.0.1) and focuses on providing a novel approach to terrain generation using CSS, potentially offering performance benefits and unique styling capabilities. The emphasis is on direct manipulation and code generation, making it useful for developers seeking to create stylized 3D landscapes within their web projects.\n",
    "chinese_title": "Show HN: 纯CSS地形生成器",
    "chinese_summary": "Show HN: Layoutit Terra - CSS地形生成器。这款工具允许用户直接使用CSS创建地形景观，无需JavaScript或图像。\n\n界面提供多种控件来自定义地形，包括：\n\n*   **重新生成:** 用户可以一键生成新的地形。\n*   **撤销/重做:** 用于试验更改的基本编辑功能。\n*   **导入/导出:** 能够导入自定义高度图，并以各种格式（CSS、VOX、TXT、PNG）导出生成的地形。\n*   **代码导出:** 复制CSS代码、嵌入生成器、在Codepen中打开项目或下载整个代码的选项。\n*   **地形操作:** 移动、升高和降低地形特征以及调整世界大小的工具。\n*   **地形参数:** 大陆覆盖率（小、中、大）、地形类型（潘帕斯草原、丘陵、登山型）和生物群落（温带、北极、沙漠）的控件。\n*   **相机设置:** 可调整的相机参数，如X轴旋转、Y轴倾斜、缩放、X轴平移和Y轴抬升，以及动画视图选项。\n*   **可视化选项:** 地形的迷你地图、高度图和矩阵视图。\n\n该工具似乎处于早期阶段（v0.0.1），专注于提供一种使用CSS生成地形的新颖方法，可能提供性能优势和独特的样式能力。 重点是直接操作和代码生成，使其对寻求在其Web项目中创建风格化3D景观的开发人员非常有用。"
  },
  {
    "id": "45811447",
    "title": "Optimizing Datalog for the GPU",
    "url": "https://danglingpointers.substack.com/p/optimizing-datalog-for-the-gpu",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "针对GPU优化Datalog",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "45809193",
    "title": "What is a manifold?",
    "url": "https://www.quantamagazine.org/what-is-a-manifold-20251103/",
    "summary": "This article, \"What is a Manifold?\" by Paulina Rowińska, introduces the concept of manifolds, a fundamental idea in modern geometry and physics, pioneered by Bernhard Riemann. A manifold is a space that appears Euclidean (flat) when observed locally, even if its global structure is more complex, like the surface of the Earth.\n\nThe article explains that Riemann's work generalized the study of curved surfaces to spaces of any dimension, influencing fields like topology, geometry, and relativity. The core idea is that a manifold can be broken down into overlapping \"charts,\" each resembling a piece of Euclidean space, allowing mathematicians to apply familiar calculus techniques. The collection of these charts is called an atlas.\n\nThe article illustrates the utility of manifolds using examples. Einstein's general theory of relativity describes spacetime as a four-dimensional manifold. The article also shows how manifolds can simplify complex problems, such as analyzing the motion of a double pendulum, by representing its possible states as points on a torus (a doughnut-shaped manifold). Manifolds are also used to analyze high-dimensional data sets. The article emphasizes the ubiquitous nature of manifolds in science, comparing their importance to that of numbers.\n",
    "chinese_title": "什么是流形？",
    "chinese_summary": "Paulina Rowińska 的文章《什么是流形？》介绍了流形的概念，这是现代几何学和物理学中的一个基本概念，由伯恩哈德·黎曼开创。流形是一种局部观察时呈现欧几里得空间（平坦）形态的空间，即使其整体结构更为复杂，如地球表面。\n\n文章解释说，黎曼的工作将曲面研究推广到任何维度的空间，影响了拓扑学、几何学和相对论等领域。其核心思想是，流形可以分解为重叠的“图表”，每个图表都类似于一块欧几里得空间，使数学家能够应用熟悉的微积分技术。这些图表的集合称为图册。\n\n文章通过实例说明了流形的用途。爱因斯坦的广义相对论将时空描述为一个四维流形。文章还展示了流形如何简化复杂问题，例如通过将双摆的可能状态表示为环面（一种甜甜圈形状的流形）上的点来分析双摆的运动。流形也用于分析高维数据集。文章强调了流形在科学中普遍存在的性质，将其重要性与数字的重要性相提并论。"
  },
  {
    "id": "45813310",
    "title": "Launch HN: Plexe (YC X25) – Build production-grade ML models from prompts",
    "url": "https://www.plexe.ai/",
    "summary": "Plexe AI, a YC X25 startup, offers a platform for building production-grade ML models from natural language prompts, targeting businesses that want to leverage AI without needing extensive data science expertise. They provide an \"Agentic ML Engineering Team\" to turn raw data into engineered AI solutions.\n\nPlexe's workflow involves connecting data, automatically checking its quality, and identifying patterns. Users can then describe their desired model in plain language, specifying the prediction task and relevant data. Plexe builds a production-ready model tailored to the business challenge, emphasizing transparency through clear performance metrics, training details, and explanations.\n\nThe platform supports various use cases across industries like finance (fraud detection, credit underwriting, churn prediction), e-commerce, logistics, and cybersecurity. It offers features such as data dashboards, API endpoints, batch jobs, and file upload/database connectors.\n\nPlexe emphasizes accessibility and ease of use, aiming to enable businesses to deploy ML models in hours rather than months. They highlight their commitment to transparency and control, giving users full insight into model performance and training. Plexe offers resources like blogs, documentation, and community channels.\n",
    "chinese_title": "发布HN：Plexe (YC X25) – 从提示词构建生产级机器学习模型",
    "chinese_summary": "Plexe AI，一家YC X25创业公司，提供一个从自然语言提示构建生产级机器学习模型的平台，目标客户是希望利用人工智能但又不需要大量数据科学专业知识的企业。他们提供一个“代理机器学习工程团队”来将原始数据转化为工程化的AI解决方案。\n\nPlexe的工作流程包括连接数据、自动检查数据质量并识别模式。用户可以用简单的语言描述他们想要的模型，指定预测任务和相关数据。Plexe构建一个为业务挑战量身定制的、可用于生产的模型，并通过清晰的性能指标、训练细节和解释来强调透明度。\n\n该平台支持金融（欺诈检测、信贷承销、客户流失预测）、电子商务、物流和网络安全等各行业的各种用例。它提供数据仪表板、API端点、批处理作业以及文件上传/数据库连接器等功能。\n\nPlexe强调可访问性和易用性，旨在使企业能够在数小时而不是数月内部署机器学习模型。他们强调对透明度和控制的承诺，让用户可以全面了解模型性能和训练情况。Plexe提供博客、文档和社区渠道等资源。"
  },
  {
    "id": "45810856",
    "title": "Show HN: I built a local-first daily planner for iOS",
    "url": "https://apps.apple.com/ca/app/to-do-list-planner-zesfy/id6479947874",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "展示一下：我做了一个iOS本地优先的每日计划应用",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "45812024",
    "title": "This Day in 1988, the Morris worm infected 10% of the Internet within 24 hours",
    "url": "https://www.tomshardware.com/tech-industry/cyber-security/on-this-day-in-1988-the-morris-worm-slithered-out-and-sparked-a-new-era-in-cybersecurity-10-percent-of-the-internet-was-infected-within-24-hours",
    "summary": "In 1988, Cornell graduate student Robert Tappan Morris unintentionally unleashed the Morris worm, which infected approximately 10% of the internet within 24 hours. The worm, designed to gauge the internet's size, exploited vulnerabilities in BSD UNIX systems, including a backdoor in the email system and a bug in the \"finger\" program. Unlike viruses, the Morris worm could self-replicate and spread autonomously.\n\nWhile not designed to damage files, the worm caused significant slowdowns, messaging delays, and system crashes. Institutions like Berkeley, Harvard, and NASA were impacted, with some resorting to complete system wipes to eliminate the worm.\n\nThe FBI investigated the incident, and Morris was identified as the culprit. He was indicted under the Computer Fraud and Abuse Act of 1986 and, after a court appearance, received a fine, probation, and community service.\n\nAt the time, the internet was vastly different from today's version, with the NSFNET serving as its backbone. It is estimated that 6,000 out of 60,000 connected systems were affected, resulting in damages ranging from $100,000 to millions of dollars. The article concludes by mentioning more recent AI worms, highlighting that computer worms remain a relevant threat.\n",
    "chinese_title": "1988年的今天，莫里斯蠕虫病毒在24小时内感染了10%的互联网。",
    "chinese_summary": "1988年，康奈尔大学研究生罗伯特·塔潘·莫里斯无意间释放了莫里斯蠕虫，在24小时内感染了大约10%的互联网。该蠕虫旨在衡量互联网的规模，利用了BSD UNIX系统中的漏洞，包括电子邮件系统中的后门和“finger”程序中的漏洞。与病毒不同，莫里斯蠕虫可以自我复制并自主传播。\n\n虽然该蠕虫并非旨在破坏文件，但它导致了严重的系统减速、消息传递延迟和系统崩溃。伯克利、哈佛和美国宇航局等机构受到了影响，其中一些机构不得不完全擦除系统以消除蠕虫。\n\n联邦调查局调查了这起事件，莫里斯被确认为罪魁祸首。他因违反1986年《计算机欺诈和滥用法案》而被起诉，在出庭后，他被处以罚款、缓刑和社区服务。\n\n当时，互联网与今天的版本截然不同，NSFNET是其骨干。据估计，60,000个连接系统中有6,000个受到影响，造成的损失从10万美元到数百万美元不等。文章最后提到了最近的人工智能蠕虫，强调计算机蠕虫仍然是一个相关的威胁。"
  },
  {
    "id": "45810430",
    "title": "Chaining FFmpeg with a Browser Agent",
    "url": "https://100x.bot/a/chaining-ffmpeg-with-browser-agent",
    "summary": "This \"article\" snippet is extremely short and primarily focuses on the title: \"Chaining FFmpeg with a Browser Agent\" and an advertisement for an AI platform called \"100X.Bot.\"\n\n**Summary:**\n\nThe core idea presented, based solely on the title, is about combining the functionality of FFmpeg, a powerful multimedia framework, with a \"Browser Agent.\" FFmpeg is typically used for video and audio encoding, decoding, transcoding, and streaming. A Browser Agent, in this context, likely refers to a program or script that automates interactions within a web browser.\n\nThe anticipated content (though not present in the provided snippet) would likely detail how to integrate these two technologies.  This could involve:\n\n*   **Using a Browser Agent to trigger FFmpeg processes:** For example, scraping a website for video links and then using FFmpeg to download and convert them.\n*   **Using FFmpeg to process media retrieved by a Browser Agent:** The Browser Agent might capture streaming video, which is then processed by FFmpeg for editing or archiving.\n*   **Using a Browser Agent to control or monitor FFmpeg:** For example, a web interface controlled by a Browser Agent could allow users to remotely manage FFmpeg tasks.\n\nThe inclusion of \"100X.Bot | 100x All-in-One AI Agent Platform\" suggests that the article, if fully available, might explore using AI agent technology to orchestrate these FFmpeg workflows within a browser environment. The platform likely aims to automate and simplify the process of combining FFmpeg with browser-based actions.\n",
    "chinese_title": "使用浏览器代理链式调用FFmpeg",
    "chinese_summary": "本文片段极其简短，主要围绕标题“使用浏览器代理链接FFmpeg”以及AI平台“100X.Bot”的广告展开。\n\n**概要：**\n\n仅从标题来看，其核心思想是将强大的多媒体框架FFmpeg的功能与“浏览器代理”相结合。FFmpeg通常用于视频和音频的编码、解码、转码和流媒体处理。在此上下文中，浏览器代理可能指的是自动化Web浏览器内交互的程序或脚本。\n\n预期的内容（尽管在提供的片段中没有）很可能会详细介绍如何集成这两种技术。这可能包括：\n\n*   **使用浏览器代理触发FFmpeg进程：** 例如，抓取网站上的视频链接，然后使用FFmpeg下载并转换它们。\n*   **使用FFmpeg处理由浏览器代理检索的媒体：** 浏览器代理可能会捕获流媒体视频，然后由FFmpeg处理以进行编辑或存档。\n*   **使用浏览器代理控制或监控FFmpeg：** 例如，由浏览器代理控制的Web界面可能允许用户远程管理FFmpeg任务。\n\n包含“100X.Bot | 100x一体化AI代理平台”表明，如果文章完整，可能会探讨如何使用AI代理技术在浏览器环境中协调这些FFmpeg工作流程。该平台可能旨在自动化和简化将FFmpeg与基于浏览器的操作相结合的过程。"
  },
  {
    "id": "45812403",
    "title": "Server DRAM prices surge 50% as AI-induced memory shortage hits hyperscalers",
    "url": "https://www.tomshardware.com/pc-components/storage/server-dram-prices-surge-50-percent",
    "summary": "The article reports a significant surge in server DRAM prices, driven by AI's increasing demand for memory. Hyperscalers are experiencing DRAM shortages, receiving only 70% of their orders despite agreeing to price increases of up to 50% for Q4. This is due to major DRAM manufacturers like Samsung and SK hynix diverting production capacity to HBM and other memory types needed for AI acceleration.\n\nAs a result, even the largest buyers are struggling to secure enough memory, causing spot prices to spike and some suppliers to halt quoting for October allocations. DDR5 16GB modules have seen prices nearly double since September. Smaller OEMs and channel players face even greater challenges, with fulfillment rates as low as 35%-40%, pushing them to the expensive spot market or forcing them to wait until 2026.\n\nMicron and TrendForce have warned of the tight DRAM market, predicting that supply growth will lag demand through next year, with the potential for quote freezes and a shift to day-to-day pricing. This trend is also causing retail DDR5 prices to rise. While DDR4 is declining and no longer a priority for volume production, the article concludes that DRAM allocation for smaller players will likely remain constrained until 2026 unless demand decreases or yields improve drastically.\n",
    "chinese_title": "服务器DRAM价格飙升50%，AI引发的内存短缺冲击超大规模数据中心。",
    "chinese_summary": "AI需求激增推动服务器DRAM价格大幅上涨。超大规模厂商面临DRAM短缺，即使同意第四季度提价高达50%，也仅收到70%的订单。这是由于三星和SK海力士等主要DRAM制造商将产能转移到HBM和其他人工智能加速所需的内存类型。\n\n因此，即使是最大的买家也在努力确保足够的内存，导致现货价格飙升，一些供应商已停止10月份的报价。DDR5 16GB 模组的价格自 9 月以来几乎翻了一番。较小的原始设备制造商和渠道商面临更大的挑战，交付率低至 35%-40%，迫使他们转向昂贵的现货市场或被迫等到 2026 年。\n\n美光和集邦咨询已警告 DRAM 市场供应紧张，预测明年供应增长将滞后于需求，并可能出现报价冻结和转向每日定价的情况。这一趋势也导致零售 DDR5 价格上涨。虽然 DDR4 正在下降，不再是批量生产的重点，但文章总结说，除非需求减少或良率大幅提高，否则小型厂商的 DRAM 分配可能会持续受限至 2026 年。"
  },
  {
    "id": "45808998",
    "title": "Bloom filters are good for search that does not scale",
    "url": "https://notpeerreviewed.com/blog/bloom-filters/",
    "summary": "This blog post explores using Bloom filters for full-text search indexes, particularly addressing scalability issues. While Bloom filters offer space efficiency for small document sets (like static websites), the author investigates whether this advantage can extend to larger corpuses.\n\nThe author initially presents and dismisses two ideas: sorting Bloom filters and structuring them in a tree. Sorting fails because a simple counterexample breaks the assumptions, and a tree structure suffers from the \"curse of dimensionality\" due to significant overlap between text documents, forcing the search of nearly every document for each query.\n\nA viable solution involves creating an inverted index of Bloom filters.  This resembles a traditional inverted index but uses a tree to represent the dictionary, potentially reducing the index size because Bloom filters represent words using fewer bits than storing them directly.\n\nDespite this solution, the author concludes that Bloom filter-based indexes are ultimately unsuitable for large document sets. While Bloom filters are compact for representing a large dictionary in a few filters, their space efficiency diminishes as the number of documents increases. Each document requires its own Bloom filter, redundantly encoding its words, while an inverted index stores each dictionary word only once and shares it among all documents. After only a few thousand documents, the size savings of the Bloom filter approach are lost, and a traditional inverted index becomes more space-efficient.\n\nThe core problem is the lack of synergy between Bloom filters; each operates independently. The author extends this insight to other problem domains, emphasizing that what's efficient on a small scale (like a global blocklist implemented with a Bloom filter) may not scale well when individual users create their own instances (e.g., user-specific blocklists).\n",
    "chinese_title": "布隆过滤器适用于不扩展的搜索。",
    "chinese_summary": "本文探讨了使用布隆过滤器进行全文搜索索引，特别关注了其可扩展性问题。虽然布隆过滤器在小型文档集（如静态网站）上具有空间效率，但作者调查了这种优势是否可以扩展到更大的语料库。\n\n作者首先提出并否定了两个想法：排序布隆过滤器和将其构造成树。排序失败是因为一个简单的反例打破了假设，而树结构则由于文本文档之间的显著重叠而遭受“维度诅咒”，迫使每次查询都搜索几乎每个文档。\n\n一个可行的解决方案是创建布隆过滤器的倒排索引。这类似于传统的倒排索引，但使用树来表示字典，从而可能减小索引大小，因为布隆过滤器使用比直接存储单词更少的位来表示单词。\n\n尽管有这个解决方案，作者最终得出结论，基于布隆过滤器的索引不适合大型文档集。虽然布隆过滤器在少数过滤器中紧凑地表示大型字典，但随着文档数量的增加，其空间效率会降低。每个文档都需要自己的布隆过滤器，冗余地编码其单词，而倒排索引仅存储每个字典单词一次，并在所有文档之间共享它。仅在几千个文档之后，布隆过滤器方法的空间节省就会丢失，而传统的倒排索引变得更节省空间。\n\n核心问题是布隆过滤器之间缺乏协同作用；每个都独立运作。作者将这种见解扩展到其他问题领域，强调在小规模上有效的（例如，使用布隆过滤器实现的全局阻止列表）可能在单个用户创建自己的实例时（例如，用户特定的阻止列表）无法很好地扩展。"
  },
  {
    "id": "45745536",
    "title": "US startup Substrate announces chipmaking tool that it says will rival ASML",
    "url": "https://www.reuters.com/world/asia-pacific/us-startup-substrate-announces-chipmaking-tool-that-it-says-will-rival-asml-2025-10-28/",
    "summary": "US startup Substrate has announced the development of a chipmaking tool that it claims will rival ASML, the Dutch company that currently dominates the market for advanced lithography systems. While details of Substrate's technology remain scarce, the company asserts its new tool can produce high-resolution patterns on silicon wafers, essential for manufacturing cutting-edge semiconductors.\n\nThe announcement comes at a time of heightened global competition in the semiconductor industry, with various nations and companies seeking to reduce their reliance on ASML. The US government has actively encouraged domestic chipmaking through initiatives like the CHIPS Act, making Substrate's claim particularly significant.\n\nThe article highlights the challenges Substrate faces. ASML has a strong hold on the extreme ultraviolet (EUV) lithography market, a technology vital for producing the most advanced chips. Building a competitive system would require significant capital investment and technological innovation.\n\nDespite the unknowns, Substrate's potential to disrupt the established market is noteworthy. If successful, Substrate could offer an alternative to ASML's technology, potentially impacting the global semiconductor supply chain and geopolitical dynamics. The company's claim needs to be validated through further technical demonstrations and market adoption.\n",
    "chinese_title": "美国初创公司Substrate宣布推出芯片制造工具，声称将与阿斯麦竞争。",
    "chinese_summary": "美国初创公司Substrate宣布开发一种芯片制造工具，声称将与荷兰公司阿斯麦（ASML）竞争，后者目前主导着先进光刻系统市场。尽管Substrate的技术细节仍然很少，但该公司声称其新工具可以在硅晶圆上生成高分辨率图案，这对于制造尖端半导体至关重要。\n\n该公告发布之际，正值全球半导体行业竞争加剧，各国和公司都在寻求减少对阿斯麦的依赖。美国政府通过《芯片法案》等举措积极鼓励国内芯片制造，这使得Substrate的声明尤其重要。\n\n文章强调了Substrate面临的挑战。阿斯麦在极紫外（EUV）光刻市场占据主导地位，这项技术对于生产最先进的芯片至关重要。构建一个具有竞争力的系统需要大量的资本投资和技术创新。\n\n尽管存在未知数，但Substrate颠覆现有市场的潜力值得关注。如果成功，Substrate可以提供阿斯麦技术的替代方案，可能影响全球半导体供应链和地缘政治格局。该公司的声明需要通过进一步的技术演示和市场应用来验证。"
  },
  {
    "id": "45806903",
    "title": "My Truck Desk",
    "url": "https://www.theparisreview.org/blog/2025/10/29/truck-desk/",
    "summary": "Bud Smith's \"My Truck Desk\" is a humorous and insightful essay about finding time and space for creative writing while working as a mechanic and welder in a petrochemical plant. After returning to the job after a layoff, Smith discovers his beloved, dilapidated F-150, which served as his mobile office, has been scrapped. The F-150's key feature was his custom-built \"Truck Desk,\" a plank that fit across the steering wheel and armrests, allowing him to write during breaks.\n\nThe essay chronicles Smith's evolving search for a workspace amidst the noisy and distracting environment of the plant. He initially wrote on his cell phone and briefly dared to use an unused cubicle in the payroll trailer before being ousted by the site manager. He then built a desk in the machine shop, which was often commandeered for other tasks.\n\nThe Truck Desk in the F-150 provided a perfect solution. Smith highlights the resourceful individuals who use their cars as personal sanctuaries, doing their \"real work\" within them. After the truck's demise, Smith adapts, creating a simple \"Truck Plank\" that fits in whatever truck the crew uses that day, allowing him to continue writing on his laptop during breaks. The piece underscores the author's dedication to his craft and the importance of adapting and \"making your own conditions\" to pursue creative endeavors, even in the most unlikely of settings.\n",
    "chinese_title": "我的卡车办公桌",
    "chinese_summary": "巴德·史密斯的《我的卡车书桌》是一篇幽默而深刻的散文，讲述了在石化厂当机械师和焊工时，如何寻找时间和空间进行创意写作。在一次裁员后重返工作岗位，史密斯发现他心爱的、破旧的F-150，也就是他的移动办公室，已经被报废了。F-150 的关键特征是他定制的“卡车书桌”，一块横跨方向盘和扶手的木板，使他能够在休息期间写作。\n\n这篇散文记录了史密斯在工厂嘈杂和分散注意力的环境中不断寻找工作空间的过程。他最初在手机上写作，并短暂地尝试使用工资单拖车里一间未使用的隔间，但很快就被现场经理赶了出来。然后，他在机修车间搭建了一张桌子，但这张桌子经常被征用用于其他任务。\n\nF-150 里的卡车书桌提供了一个完美的解决方案。史密斯强调了那些将汽车作为个人避难所，在其中进行“真正工作”的足智多谋的人们。在卡车报废后，史密斯进行调整，制作了一个简单的“卡车木板”，可以放在当天船员使用的任何卡车里，使他能够在休息期间继续用笔记本电脑写作。这篇文章强调了作者对创作的奉献，以及适应并“创造自己的条件”以追求创造性努力的重要性，即使在最不可能的环境中也是如此。"
  },
  {
    "id": "45702316",
    "title": "Customize Nano Text Editor",
    "url": "https://shafi.ddns.net/blog/customize-nano-text-editor",
    "summary": "This article is about customizing the Nano text editor. Given the title and the author information (Rayhan Aziz Chowdhury Shafi), we can infer that the article will likely provide guidance on how to personalize and configure the Nano text editor to better suit the user's preferences and workflow. While the provided content snippet is minimal, the core focus is clearly on customizing Nano.\n\nThe article will likely cover topics such as:\n\n*   **Configuration file:** Explaining the location and structure of Nano's configuration file (`.nanorc` or similar).\n*   **Customizing syntax highlighting:** Enabling or modifying syntax highlighting for different programming languages and file types.\n*   **Keyboard shortcuts:** Defining or changing keyboard shortcuts for common editing tasks.\n*   **Other options:** Adjusting settings for things like auto-indentation, line numbering, spell checking, and other features to improve the editing experience.\n\nEssentially, the article is a guide for users to personalize their Nano environment to make it more efficient and productive for coding or general text editing. Being written by a DevOps & Full-Stack Engineer suggests the customizations may lean towards those useful for software development.\n",
    "chinese_title": "自定义 Nano 文本编辑器",
    "chinese_summary": "本文旨在介绍如何自定义 Nano 文本编辑器。根据标题和作者信息 (Rayhan Aziz Chowdhury Shafi) 可以推断，本文很可能会提供关于如何个性化配置 Nano 文本编辑器，使其更好地满足用户的偏好和工作流程的指导。虽然提供的内容片段很少，但核心重点显然是自定义 Nano。\n\n本文可能涵盖以下主题：\n\n*   **配置文件：** 解释 Nano 配置文件的位置和结构（`.nanorc` 或类似文件）。\n*   **自定义语法高亮：** 启用或修改不同编程语言和文件类型的语法高亮。\n*   **键盘快捷键：** 定义或更改常用编辑任务的键盘快捷键。\n*   **其他选项：** 调整自动缩进、行号、拼写检查和其他功能的设置，以改善编辑体验。\n\n本质上，本文是为用户个性化 Nano 环境的指南，使其在编码或一般文本编辑方面更高效和更有成效。由 DevOps 和全栈工程师撰写表明，自定义可能偏向于对软件开发有用的方面。"
  },
  {
    "id": "45812901",
    "title": "YouTube AI error costs creator his channel over alleged link to Japanese account",
    "url": "https://piunikaweb.com/2025/11/04/youtube-ai-error-terminates-enderman-channel/",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "YouTube AI错误导致创作者频道因涉嫌关联日本账户而被封禁",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "45812000",
    "title": "How devtools map minified JS code back to your TypeScript source code",
    "url": "https://www.polarsignals.com/blog/posts/2025/11/04/javascript-source-maps-internals",
    "summary": "This article explains how source maps enable debugging minified JavaScript code by mapping it back to the original TypeScript source. When an error occurs in a production bundle (e.g., `bundle.min.js:1:27698`), the source map translates this location to the corresponding line and column in the original TypeScript file (e.g., `src/index.ts:73:16`).\n\nThe article details the TypeScript build pipeline, consisting of transpilation, bundling, and minification, with source maps preserving the connection to the original code at each stage.\n\nThe article delves into the structure of source map files (typically `.js.map`), which include fields like `version`, `file`, `sources`, `names`, and most importantly, `mappings`.  The `mappings` field contains compressed position mappings, linking tokens in the generated JavaScript to their original locations using Variable Length Quantity (VLQ) encoding.\n\nVLQ encoding efficiently represents position differences using Base64 characters. The mappings string is a series of comma-separated segments, with semicolons acting as line breaks. Each segment represents a mapping from a position in the generated file to a position in the source file, containing information about the generated column, source file index, source line, source column, and original name (if applicable). VLQ compresses this data by encoding the sign bit, splitting into 5-bit groups and converting it into Base64.  Instead of absolute positions, it stores the differences from the previous position making the map compact.\n\nIn essence, source maps bridge the gap between optimized production code and developer-friendly source code, significantly aiding in debugging.\n",
    "chinese_title": "Devtools如何将压缩后的JS代码映射回你的TypeScript源代码",
    "chinese_summary": "本文阐述了源映射如何通过将压缩后的 JavaScript 代码映射回原始 TypeScript 源代码，从而实现对压缩后代码的调试。当生产环境中发生错误时（例如，`bundle.min.js:1:27698`），源映射会将此位置转换为原始 TypeScript 文件中对应的行和列（例如，`src/index.ts:73:16`）。\n\n本文详细介绍了 TypeScript 构建流程，包括转译、打包和压缩，源映射在每个阶段都保留与原始代码的连接。\n\n本文深入探讨了源映射文件的结构（通常为 `.js.map`），其中包括 `version`、`file`、`sources`、`names` 等字段，最重要的是 `mappings` 字段。`mappings` 字段包含压缩的位置映射，使用变长数量 (VLQ) 编码将生成的 JavaScript 中的 token 链接到它们的原始位置。\n\nVLQ 编码使用 Base64 字符有效地表示位置差异。映射字符串是一系列以逗号分隔的段，分号作为换行符。每个段表示从生成文件中位置到源文件中位置的映射，包含有关生成列、源文件索引、源行、源列和原始名称（如果适用）的信息。VLQ 通过编码符号位、拆分为 5 位组并将其转换为 Base64 来压缩此数据。它不是存储绝对位置，而是存储与先前位置的差异，从而使映射更加紧凑。\n\n本质上，源映射弥合了优化后的生产代码和对开发者友好的源代码之间的差距，从而极大地帮助了调试。"
  },
  {
    "id": "45806263",
    "title": "You can't cURL a Border",
    "url": "https://drobinin.com/posts/you-cant-curl-a-border/",
    "summary": "This article details the author's journey in creating an app called \"Residency\" to track and predict potential immigration and tax complications arising from international travel. Frustrated by the complexity and opacity of various government regulations (Schengen, UK tax residency, visa requirements), the author realized a spreadsheet wasn't enough and built a linter-like tool to proactively identify issues *before* booking travel.\n\nThe core problem is that these systems don't expose your current state, forcing travelers to manually navigate a maze of differing rules, time zone considerations, and edge cases (e.g., the specific date of a UK citizenship application, the definition of \"presence\" during airport transits).\n\n\"Residency\" solves this by:\n\n*   Tracking travel history with precise timestamps and reasons for presence.\n*   Simulating future trips and applying location-specific rules (stored as versioned \"interpretations\") to predict potential problems.\n*   Checking passport validity, visa requirements, and other relevant document constraints.\n*   Keeping data local for privacy and performance reasons, avoiding server-side liabilities.\n\nThe app is presented as a practical tool for anyone frequently navigating international travel, allowing them to make informed decisions and avoid costly mistakes by predicting future problems. The author concludes with the example of booking a cheap Iceland flight, and how Residency helped ensure that it would not violate any travel rules or effect their upcoming UK tax residency before their move to Canada.\n",
    "chinese_title": "你无法用cURL获取边界。",
    "chinese_summary": "本文详细介绍了作者创建名为“Residency”的应用程序的历程，该应用程序旨在追踪和预测因国际旅行引起的潜在移民和税务问题。 由于各种政府法规（申根、英国税务居民身份、签证要求）的复杂性和不透明性，作者感到沮丧，意识到仅仅依靠电子表格是不够的，因此构建了一个类似于linter的工具，以便在预订旅行*之前*主动识别问题。\n\n核心问题在于，这些系统不会暴露您当前的状态，迫使旅行者手动穿梭于不同的规则、时区考虑和边缘情况（例如，英国公民身份申请的具体日期、机场过境期间“存在”的定义）迷宫之中。\n\n“Residency”通过以下方式解决此问题：\n\n*   使用精确的时间戳和存在理由跟踪旅行历史。\n*   模拟未来旅行并应用特定于位置的规则（存储为版本化的“解释”）来预测潜在问题。\n*   检查护照有效期、签证要求和其他相关文件约束。\n*   出于隐私和性能原因，将数据保存在本地，避免服务器端责任。\n\n该应用程序被呈现为一个实用的工具，适用于经常进行国际旅行的任何人，使他们能够通过预测未来问题来做出明智的决策并避免代价高昂的错误。 作者最后以预订廉价冰岛航班为例，说明了“Residency”如何帮助确保该航班不会违反任何旅行规则或影响他们即将到来的移居加拿大的英国税务居民身份。"
  },
  {
    "id": "45812499",
    "title": "The 512KB Club",
    "url": "https://512kb.club/",
    "summary": "生成摘要时出错",
    "chinese_title": "The 512KB Club",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45805900",
    "title": "Things you can do with diodes",
    "url": "https://lcamtuf.substack.com/p/things-you-can-do-with-diodes",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "二极管的妙用",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "45684564",
    "title": "Recovering videos from my Sony camera that I stupidly deleted",
    "url": "https://www.jeffgeerling.com/blog/2025/recovering-videos-my-sony-camera-i-stupidly-deleted",
    "summary": "This article details the author's frustrating experience attempting to recover deleted video footage from a Sony camera SD card after accidentally deleting it from their computer and backup drives. The author outlines their usual backup procedure and how a series of errors led to the data loss.\n\nTheir initial attempt involved using PhotoRec, which recovered many files but with randomized names and two file types: .mp4 and _moov.mov. Combining these files, even with scripting, failed to produce playable videos.  The author then created a full disk image backup of the SD card to prevent further data loss.\n\nNext, the author tried untrunc, a tool specifically designed for recovering truncated MP4 files, including Sony XAVC files.  By providing a \"good\" reference MP4 file, untrunc generated partially recovered files, with brief playable fragments but choppy video and glitchy audio. Further experimentation with untrunc using multiple reference files didn't yield significant improvements.\n\nInspired by an article on MP4 file structure, the author theorized that the _moov.mov file might be needed at the end of the MP4 file and attempted to concatenate them in that order, unsuccessfully.\n\nFinally, the author turned to commercial software, Disk Drill, hoping for better results. While Disk Drill's interface was a welcome change, the recovered files were still unplayable and required the same partial recovery attempts as the PhotoRec files. The author discovered Disk Drill's \"Advanced Camera Recovery Module\" and re-scanned the SD card. The article ends abruptly, before the author reveals if this last-ditch effort was successful. The author has spent considerable time and disk space, experimenting with recovery, so decides to stop soon.\n",
    "chinese_title": "从索尼相机恢复我不小心删除的视频",
    "chinese_summary": "本文详细描述了作者在不小心从电脑和备份驱动器中删除索尼相机SD卡中的视频素材后，尝试恢复已删除视频的令人沮丧的经历。作者概述了他们通常的备份流程，以及一系列错误是如何导致数据丢失的。\n\n最初，他们尝试使用PhotoRec，它恢复了许多文件，但文件名是随机的，并且有两种文件类型：.mp4 和 _moov.mov。即使使用脚本将这些文件组合起来，也无法生成可播放的视频。随后，作者创建了SD卡的完整磁盘镜像备份，以防止进一步的数据丢失。\n\n接下来，作者尝试了untrunc，这是一种专门用于恢复截断的MP4文件（包括索尼XAVC文件）的工具。通过提供一个“良好”的参考MP4文件，untrunc生成了部分恢复的文件，其中包含短暂的可播放片段，但视频卡顿，音频失真。使用多个参考文件进一步尝试untrunc并没有产生明显的改进。\n\n受一篇关于MP4文件结构的文章启发，作者推测_moov.mov文件可能需要在MP4文件的末尾，并尝试按此顺序将它们连接起来，但未成功。\n\n最后，作者转向商业软件Disk Drill，希望能获得更好的结果。虽然Disk Drill的界面令人耳目一新，但恢复的文件仍然无法播放，并且需要与PhotoRec文件相同的局部恢复尝试。作者发现了Disk Drill的“高级相机恢复模块”，并重新扫描了SD卡。文章在作者揭示这最后一次尝试是否成功之前戛然而止。作者花费了大量的时间和磁盘空间进行恢复实验，因此决定很快停止。"
  },
  {
    "id": "45806348",
    "title": "When stick figures fought",
    "url": "https://animationobsessive.substack.com/p/when-stick-figures-fought",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "火柴人打架时",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "45804377",
    "title": "AI's Dial-Up Era",
    "url": "https://www.wreflection.com/p/ai-dial-up-era",
    "summary": "This article draws a parallel between the early days of the internet (the \"Dial-Up Era\") and the current state of Artificial Intelligence, arguing that we are in a similar phase of hype, uncertainty, and potential over-investment.\n\nIt cautions against both extreme optimism and pessimism regarding AI's impact on employment. While some predict mass unemployment, the author points to the radiology field as an example where AI has actually *increased* demand and employment due to the Jevons Paradox: improved efficiency leads to greater consumption. However, this effect isn't universal.\n\nThe article argues that employment outcomes depend on the balance between unmet market demand in an industry and the rate of productivity improvement through automation. Industries with high unmet demand (like motor vehicles) may see sustained or even growing employment, while those with saturated demand (like textiles) may experience job displacement. The software industry presents a unique case due to potentially enormous latent demand if AI can significantly lower development costs.\n\nThe article also analyzes whether the current AI boom is a bubble, comparing it to the dotcom era. While acknowledging the significant investment in AI infrastructure and rapid growth of companies like OpenAI, it suggests that the demand is real, but the potential for overbuilding and spectacular failures exists. However, similar to the dotcom bubble, the underlying infrastructure being built will likely outlast the hype and enable future innovations.\n\nIn conclusion, the author suggests a predictably unpredictable future: change is coming, but the details are hard to foresee. AI will unlock new market segments by reducing costs, leading to previously unaffordable products and services. Expect new domains and industries to emerge, shaped by human creativity in ways we cannot currently imagine.\n",
    "chinese_title": "AI的拨号时代",
    "chinese_summary": "本文将互联网早期（“拨号时代”）与当前的人工智能状态进行对比，认为我们正处于类似的炒作、不确定性和潜在过度投资阶段。\n\n文章告诫人们不要对人工智能对就业的影响过于乐观或悲观。虽然有些人预测会大规模失业，但作者以放射学领域为例，指出由于杰文斯悖论，人工智能实际上*增加*了需求和就业：效率的提高导致更大的消费。然而，这种效应并非普遍适用。\n\n文章认为，就业结果取决于一个行业中未被满足的市场需求与通过自动化实现的生产力提高速度之间的平衡。具有高未被满足需求的行业（如汽车行业）可能会看到持续甚至增长的就业，而需求饱和的行业（如纺织业）可能会经历失业。软件行业提出了一个独特的案例，如果人工智能能够显著降低开发成本，则可能存在巨大的潜在需求。\n\n文章还分析了当前的人工智能繁荣是否是一个泡沫，并将其与互联网泡沫时代进行了比较。虽然承认对人工智能基础设施的大量投资以及OpenAI等公司的快速增长，但它认为需求是真实的，但存在过度建设和惊人失败的可能性。然而，与互联网泡沫类似，正在建设的基础设施可能会比炒作更持久，并促进未来的创新。\n\n总而言之，作者提出了一个可预测的不可预测的未来：变革即将到来，但细节难以预见。人工智能将通过降低成本来解锁新的市场领域，从而实现以前负担不起的产品和服务。预计新的领域和行业将会出现，并以我们目前无法想象的方式受到人类创造力的塑造。"
  },
  {
    "id": "45812806",
    "title": "USDA Threatens Stores Giving Discounts to People on Food Stamps",
    "url": "https://newrepublic.com/post/202604/usda-threatens-grocery-stores-discounts-people-food-stamps",
    "summary": "This article focuses on the impact of the Trump administration's government shutdown on the Supplemental Nutrition Assistance Program (SNAP), commonly known as food stamps. It highlights several key issues:\n\n*   **Discounts Restricted:** The USDA warned grocery stores against offering discounts to SNAP recipients affected by the shutdown, citing the \"Equal Treatment Rule.\" Some stores withdrew their discounts as a result.\n*   **SNAP Funding Crisis:** Despite court orders to use contingency funds for SNAP, the administration has not complied, leaving millions of recipients without assistance. This also threatens retailers in low-income areas.\n*   **Political Standoff:** The article frames the shutdown as a Republican issue, with Bernie Sanders urging Democrats to stand firm against Trump's demands. He portrays the situation as a power grab by the president at the expense of working families.\n*   **Immigration Raids:** The article details aggressive immigration enforcement in Chicago, with federal agents using force against residents. Trump defends these raids, stating they haven't gone far enough.\n*   **Contingency Fund Dispute:** Treasury Secretary Scott Bessent claims the administration needs court guidance on SNAP funding despite existing rulings. He blames Democrats for the shutdown and funding issues.\n*   **FBI Jet Misuse:** FBI Director Kash Patel is accused of using a government jet for personal trips with his girlfriend, leading to controversy and personnel changes within the FBI.",
    "chinese_title": "美国农业部威胁向食品券受益者提供折扣的商店",
    "chinese_summary": "本文重点关注特朗普政府停摆对补充营养援助计划（SNAP），俗称食品券的影响。文章重点阐述了几个关键问题：\n\n*   **折扣限制：** 美国农业部警告杂货店不得向受政府停摆影响的SNAP受益者提供折扣，理由是“平等待遇规则”。一些商店因此取消了折扣。\n*   **SNAP资金危机：** 尽管法院下令使用应急资金用于SNAP，但政府尚未遵守，导致数百万受益者得不到援助。这也威胁到低收入地区的零售商。\n*   **政治僵局：** 文章将政府停摆归咎于共和党，伯尼·桑德斯敦促民主党人坚决反对特朗普的要求。他将这种情况描述为总统以牺牲工薪家庭为代价的权力攫取。\n*   **移民突袭：** 文章详细描述了在芝加哥进行的激进移民执法行动，联邦特工对居民使用武力。特朗普为这些突袭辩护，称行动还不够深入。\n*   **应急基金争议：** 财政部长斯科特·贝森特声称，尽管已有裁决，政府仍需要法院对SNAP资金的指导。他指责民主党人造成政府停摆和资金问题。\n*   **联邦调查局飞机滥用：** 联邦调查局局长卡什·帕特尔被指控使用政府飞机与女友进行私人旅行，导致争议和联邦调查局内部的人事变动。"
  },
  {
    "id": "45729340",
    "title": "Reverse-engineered CUPS driver for Phomemo receipt/label printers",
    "url": "https://github.com/vivier/phomemo-tools",
    "summary": "This document describes a reverse-engineered CUPS driver and tools for printing to Phomemo M02, M110, M120, and M220 thermal printers from Linux. The driver was developed by analyzing Bluetooth and USB communication from the Android application.\n\nThe document provides instructions on connecting to the printers via both Bluetooth and USB. For Bluetooth, it outlines the pairing process using `bluetoothctl` and connecting via `rfcomm`. For USB, it details how to identify the device using `lsusb` and access it through `/dev/usb/lp0` or `ttyACM0`.\n\nThe core of the document explains how to install and configure the CUPS driver. Installation involves building the driver from source using `make` and `make install`. Configuration can be done through a GUI or via the command line using `lpadmin`. The document provides specific `lpadmin` commands for setting up Bluetooth and USB connections for the M02, M110, M120, and M220 printers, specifying the appropriate PPD files. It explains how to verify printer options using `lpoptions` and provides example commands for printing text and images using CUPS, including specifying media types.\n\nFinally, the document delves into the reverse-engineered protocol used for both the M02 and M110/M120/M220 printers, detailing the header, block marker, footer, and image data formats based on EPSON ESC/POS commands. It outlines specific byte sequences used for printer initialization, justification, raster image printing, and media type selection.\n",
    "chinese_title": "Phomemo 热敏/标签打印机逆向工程 CUPS 驱动",
    "chinese_summary": "本文档描述了一个逆向工程的 CUPS 驱动程序和工具，用于从 Linux 打印到 Phomemo M02、M110、M120 和 M220 热敏打印机。该驱动程序通过分析 Android 应用程序的蓝牙和 USB 通信开发而成。\n\n本文档提供了通过蓝牙和 USB 连接到打印机的说明。对于蓝牙，它概述了使用 `bluetoothctl` 进行配对以及通过 `rfcomm` 进行连接的过程。对于 USB，它详细介绍了如何使用 `lsusb` 识别设备并通过 `/dev/usb/lp0` 或 `ttyACM0` 访问它。\n\n文档的核心内容解释了如何安装和配置 CUPS 驱动程序。安装涉及使用 `make` 和 `make install` 从源代码构建驱动程序。可以通过 GUI 或使用 `lpadmin` 命令行进行配置。本文档提供了针对 M02、M110、M120 和 M220 打印机设置蓝牙和 USB 连接的特定 `lpadmin` 命令，并指定了相应的 PPD 文件。它解释了如何使用 `lpoptions` 验证打印机选项，并提供了使用 CUPS 打印文本和图像的示例命令，包括指定介质类型。\n\n最后，本文档深入探讨了用于 M02 和 M110/M120/M220 打印机的逆向工程协议，详细介绍了基于 EPSON ESC/POS 命令的标头、块标记、页脚和图像数据格式。它概述了用于打印机初始化、对齐方式、光栅图像打印和介质类型选择的特定字节序列。"
  },
  {
    "id": "45741357",
    "title": "Aisuru botnet shifts from DDoS to residential proxies",
    "url": "https://krebsonsecurity.com/2025/10/aisuru-botnet-shifts-from-ddos-to-residential-proxies/",
    "summary": "The Aisuru botnet, initially known for record-breaking DDoS attacks, has shifted its focus to renting out its vast network of compromised IoT devices as residential proxies. This allows cybercriminals to anonymize their traffic and makes malicious activity harder to trace. Experts believe this influx of proxies is fueling large-scale data harvesting for AI projects, enabling content scrapers to evade detection by appearing as regular internet users.\n\nAisuru, controlling at least 700,000 devices, caused significant disruption to ISPs due to the high volume of outbound attack traffic. While ISPs are sharing blocklists, Aisuru's operators have updated their malware to facilitate easy renting of devices to proxy services. These services are used for legitimate purposes, but are often abused for cybercrime, including advertising fraud and credential stuffing.\n\nThe residential proxy market is experiencing \"insane\" growth, with hundreds of millions of unique residential proxy IPs observed recently. While some providers like Luminati (Bright Data) and Oxylabs claim to adhere to \"know-your-customer\" policies, many others operate in a more shadowy fashion, often acting as bandwidth resellers or bundling SDKs into apps that quietly turn users' devices into traffic relays. IPidea, a China-based proxy network, is identified as a major player in this ecosystem.\n\nThe rise in residential proxies is closely linked to aggressive content scraping for AI development. Companies are using these proxies to bypass restrictions and collect data from websites, sometimes overloading community-maintained infrastructure. This has led to legal action, such as Reddit's lawsuit against Oxylabs for enabling mass scraping. Companies like Cloudflare are even experimenting with ways to charge AI crawlers for accessing content. Aisuru is a major, but not sole, contributor to this proxy availability.\n",
    "chinese_title": "Aisuru僵尸网络从DDoS攻击转向住宅代理",
    "chinese_summary": "最初以打破记录的DDoS攻击而闻名的Aisuru僵尸网络，已将其重心转移到出租其庞大的受感染IoT设备网络作为住宅代理。这使得网络犯罪分子能够匿名化其流量，并使恶意活动更难追踪。专家认为，这种代理的涌入正在助长用于人工智能项目的大规模数据收集，使内容抓取者能够通过伪装成普通互联网用户来逃避检测。\n\nAisuru控制着至少70万台设备，由于大量的出站攻击流量，对ISP造成了重大破坏。虽然ISP正在共享黑名单，但Aisuru的运营者已经更新了他们的恶意软件，以方便将设备出租给代理服务。这些服务被用于合法目的，但经常被滥用于网络犯罪，包括广告欺诈和凭据填充。\n\n住宅代理市场正经历“疯狂”增长，最近观察到数亿个独特的住宅代理IP。虽然像Luminati (Bright Data)和Oxylabs等一些供应商声称遵守“了解你的客户”政策，但许多其他供应商的运营方式更加隐蔽，通常充当带宽经销商或将SDK捆绑到应用程序中，这些应用程序悄悄地将用户的设备变成流量中继。总部位于中国的代理网络IPidea被认为是该生态系统中的主要参与者。\n\n住宅代理的兴起与用于人工智能开发的积极内容抓取密切相关。公司正在使用这些代理来绕过限制并从网站收集数据，有时会使社区维护的基础设施过载。这导致了法律行动，例如Reddit对Oxylabs提起诉讼，指控其促成大规模抓取。像Cloudflare这样的公司甚至正在尝试对人工智能爬虫访问内容收费的方法。Aisuru是这种代理可用性的主要贡献者，但不是唯一的贡献者。"
  },
  {
    "id": "45718710",
    "title": "Tenacity – a multi-track audio editor/recorder",
    "url": "https://tenacityaudio.org",
    "summary": "Tenacity is a free and open-source, cross-platform multi-track audio editor and recorder for Windows, Linux, and other operating systems. Developed by volunteers, it offers a user-friendly interface and a range of features including recording from various audio devices, importing and exporting a wide array of audio formats (extendible with FFmpeg), and supporting up to 32-bit float audio for high quality.\n\nThe software supports VST, LV2, and AU plugins, allowing for extended functionality, and scripting capabilities using Nyquist, Python, Perl, and other languages. Users can perform arbitrary sampling and multi-track timeline editing with accessibility features like keyboard navigation, screen reader support, and narration assistance. The program also provides tools for audio signal analysis.\n\nPre-packaged builds and source code are available on the repository. Users can seek help through the Matrix channel (#tenacity2:matrix.org), follow the project on Mastodon for news and events, or participate in discussions on the Lemmy community. Development occurs on Codeberg, with a GitHub mirror for accessibility. Contributions are welcomed following the contributing guidelines. The project also provides links to mailing lists and information about legacy versions, Audacium, and Saucedacity for those interested in the project's history and forks.\n",
    "chinese_title": "坚韧 - 一款多轨音频编辑器/录音机",
    "chinese_summary": "Tenacity是一款免费开源、跨平台的多音轨音频编辑和录制软件，适用于Windows、Linux和其他操作系统。它由志愿者开发，提供用户友好的界面和一系列功能，包括从各种音频设备录音、导入和导出多种音频格式（可通过FFmpeg扩展），以及支持高达32位浮点音频以获得高质量音频。\n\n该软件支持VST、LV2和AU插件，允许扩展功能，并支持使用Nyquist、Python、Perl和其他语言进行脚本编写。用户可以执行任意采样和多音轨时间线编辑，并具有诸如键盘导航、屏幕阅读器支持和旁白辅助等辅助功能。该程序还提供音频信号分析工具。\n\n预编译版本和源代码可在存储库中找到。用户可以通过Matrix频道（#tenacity2:matrix.org）寻求帮助，在Mastodon上关注项目的新闻和活动，或参与Lemmy社区的讨论。开发在Codeberg上进行，GitHub上有一个镜像以方便访问。欢迎遵循贡献指南进行贡献。该项目还提供邮件列表链接和关于旧版本、Audacium和Saucedacity的信息，供那些对项目历史和分支感兴趣的人参考。"
  },
  {
    "id": "45674676",
    "title": "The Farmer Was Replaced [video]",
    "url": "https://www.youtube.com/watch?v=aP2WHQKJVsw",
    "summary": "The provided text is not an article, but rather the standard footer information found on YouTube. It includes links to YouTube's various resources and policies, such as:\n\n*   **Copyright information:** Links related to copyright issues.\n*   **Contact information:** How to contact YouTube regarding news and other matters.\n*   **Information for creators:** Resources for content creators.\n*   **Advertising:** Information about advertising on YouTube.\n*   **Legal:** Links to the terms of service, privacy policy, and safety information.\n*   **How YouTube works:** Information on YouTube's functionalities.\n*   **Experimental features:** Information on new features being tested.\n*   **NFL Sunday Ticket:** A mention of the NFL Sunday Ticket service offered by YouTube (© 2025 Google LLC).\n\nEssentially, it's a boilerplate block of text providing essential legal and functional details about the YouTube platform. It offers no information about the video title \"The Farmer Was Replaced\" nor does it contain any relevant or meaningful news content.\n",
    "chinese_title": "农民被取代 [视频]",
    "chinese_summary": "提供的文本并非文章，而是YouTube上常见的标准页脚信息。它包括指向YouTube各种资源和政策的链接，例如：\n\n*   **版权信息：**与版权问题相关的链接。\n*   **联系方式：**关于新闻和其他事项如何联系YouTube。\n*   **创作者信息：**内容创作者的资源。\n*   **广告：**关于在YouTube上投放广告的信息。\n*   **法律：**指向服务条款、隐私政策和安全信息的链接。\n*   **YouTube运作方式：**关于YouTube功能的信息。\n*   **实验性功能：**关于正在测试的新功能的信息。\n*   **NFL Sunday Ticket：**对YouTube提供的NFL Sunday Ticket服务的提及（© 2025 Google LLC）。\n\n本质上，这是一段样板文字，提供了关于YouTube平台的基本法律和功能细节。它没有提供关于视频标题“The Farmer Was Replaced”（农民被取代）的任何信息，也没有包含任何相关或有意义的新闻内容。"
  },
  {
    "id": "45805539",
    "title": "A friendly tour of process memory on Linux",
    "url": "https://www.0xkato.xyz/linux-process-memory/",
    "summary": "This article provides a detailed tour of process memory management on Linux, focusing on x86-64 architecture. It explains how Linux creates the illusion of continuous memory for programs, despite the fragmented reality of physical RAM. The key is virtual memory, managed via page tables that map virtual addresses to physical frames. Disk acts as an extension when RAM is full.\n\nThe article delves into the concept of Virtual Memory Areas (VMAs), contiguous address ranges with unified permissions and backing. Memory manipulation happens through `mmap` (reserving address ranges), `mprotect` (changing permissions), and `munmap` (removing mappings). Actual memory allocation happens lazily on the first touch of a page, triggering page faults if a translation is missing. The kernel handles these faults by allocating a zero-filled page (anonymous mapping) or reading from storage (file mapping).\n\nThe article also explains copy-on-write (CoW) behavior during `fork()` and how `MAP_PRIVATE` works. `mprotect` incurs a small performance penalty due to TLB invalidation. It showcases how to inspect memory mappings using `/proc/<pid>/maps`, `/proc/<pid>/smaps`, and more detailed tools like `/proc/<pid>/pagemap`, `/proc/kpagecount`, and `/proc/kpageflags` for per-page information, acknowledging that certain information is restricted to privileged users.\n\nFinally, the text introduces Transparent Huge Pages (THP) and multi-size THP (mTHP) and discusses configuration options via `/sys/kernel/mm/transparent_hugepage/`. These attempt to reduce fault counts and TLB pressure by using larger pages. The article provides tools to determine if THP is working, and also mentions trade-offs, like compaction.\n",
    "chinese_title": "Linux进程内存的友好导览",
    "chinese_summary": "Linux进程内存管理详解 (x86-64架构)\n\n本文详细介绍了Linux上的进程内存管理，重点关注x86-64架构。它解释了Linux如何为程序创建连续内存的错觉，尽管物理RAM的现实是碎片化的。关键在于虚拟内存，它通过页表将虚拟地址映射到物理帧进行管理。当RAM已满时，磁盘充当扩展。\n\n本文深入探讨了虚拟内存区域（VMA）的概念，它是具有统一权限和后备存储的连续地址范围。内存操作通过`mmap`（保留地址范围）、`mprotect`（更改权限）和`munmap`（删除映射）进行。实际的内存分配发生在首次访问页面时，如果缺少转换，则会触发页面错误。内核通过分配一个零填充的页面（匿名映射）或从存储读取（文件映射）来处理这些错误。\n\n本文还解释了`fork()`期间的写时复制（CoW）行为以及`MAP_PRIVATE`的工作原理。 `mprotect`会因TLB失效而产生较小的性能损失。它展示了如何使用`/proc/<pid>/maps`、`/proc/<pid>/smaps`检查内存映射，以及使用更详细的工具（如`/proc/<pid>/pagemap`、`/proc/kpagecount`和`/proc/kpageflags`）获取逐页信息，并承认某些信息仅限于特权用户。\n\n最后，本文介绍了透明大页（THP）和多尺寸THP（mTHP），并讨论了通过`/sys/kernel/mm/transparent_hugepage/`进行的配置选项。这些尝试通过使用更大的页面来减少错误计数和TLB压力。本文提供了确定THP是否工作的工具，并提到了权衡，例如碎片整理。"
  },
  {
    "id": "45810676",
    "title": "The Art of Atari (2016)",
    "url": "http://www.artofatari.com",
    "summary": "\"The Art of Atari,\" published by Dynamite, is an official collection showcasing over 40 years of Atari's unique artwork, sourced from private collections around the world. This book features illustrations used in packaging, advertisements, and catalogs, aiming to enhance the Atari experience and attract both children and adults to the world of electronic entertainment.\n\nThe book includes a comprehensive retrospective of game production and concept artwork, photographs, and marketing materials. Readers will gain insights from key figures in Atari's history and learn behind-the-scenes details about the conception, illustration, approval (or rejection), and creation of numerous Atari games, including iconic titles like Asteroids, Centipede, and Missile Command.\n\nAuthor Tim Lapetino describes Atari as a cultural touchstone, introducing many people to video games for the first time. The book caters to Atari fans, collectors, enthusiasts, and newcomers alike, offering the most complete collection of Atari artwork ever produced.\n\nThe book is available through local independent bookstores and comic shops. Atari and the Atari logo are registered trademarks of Atari Interactive Inc.\n",
    "chinese_title": "雅达利艺术 (2016)",
    "chinese_summary": "《雅达利艺术》，由Dynamite出版，是一部官方收藏集，展示了来自世界各地私人收藏的雅达利40多年来的独特艺术作品。本书收录了用于包装、广告和目录中的插图，旨在提升雅达利体验，并吸引儿童和成人进入电子娱乐世界。\n\n本书全面回顾了游戏制作和概念艺术作品、照片和营销材料。读者将从雅达利历史上的关键人物那里获得见解，并了解包括《小行星》、《蜈蚣》和《导弹指挥官》等标志性游戏在内的众多雅达利游戏的构思、插图、批准（或拒绝）和创作的幕后细节。\n\n作者蒂姆·拉佩蒂诺将雅达利描述为一种文化试金石，它让许多人首次接触到电子游戏。本书面向雅达利粉丝、收藏家、爱好者和新手，提供了有史以来最完整的雅达利艺术作品集。\n\n本书可通过当地独立书店和漫画店购买。 Atari和Atari标志是Atari Interactive Inc.的注册商标。"
  },
  {
    "id": "45800777",
    "title": "Learning to read Arthur Whitney's C to become smart (2024)",
    "url": "https://needleful.net/blog/2024/01/arthur_whitney.html",
    "summary": "This article details the author's attempt to understand Arthur Whitney's highly condensed C code for a K language interpreter. Whitney is known for creating languages and databases (A, K, Q, kdb, Shakti) used in finance and requiring minimal code.\n\nThe author breaks down the 50-line C interpreter, explaining each line and macro, highlighting the challenges posed by Whitney's unconventional coding style, which prioritizes brevity and fitting logic on a single screen. The author appreciates this approach for its potential to improve code comprehension by exposing the full complexity upfront.\n\nThe author examines the custom macros for function definitions, error handling, and common operations. They also delve into how the code handles both integers and pointers using `char*`, and explains functions for vector manipulation, arithmetic operations, and error handling. The author notes that Whitney’s programming style aims to reduce bugs by using small, highly reusable, logic blocks.\n\nUltimately, the author appreciates the challenge and sees potential benefits in learning to read and potentially adopt aspects of Whitney's style, even though it's initially daunting. They come to better understand how one could trade code readability for brevity and see the entire codebase on one screen.\n",
    "chinese_title": "学习阅读亚瑟·惠特尼的C语言以变得聪明 (2024)",
    "chinese_summary": "本文详细介绍了作者尝试理解Arthur Whitney为K语言解释器编写的高度精简的C代码的过程。Whitney以创建用于金融领域并需要最少代码的语言和数据库（A、K、Q、kdb、Shakti）而闻名。\n\n作者分解了这个50行的C解释器，逐行解释每行代码和宏，强调了Whitney非常规编码风格带来的挑战，这种风格优先考虑简洁性并将逻辑置于单个屏幕上。作者赞赏这种方法，因为它有可能通过预先展示全部复杂性来提高代码的可理解性。\n\n作者研究了用于函数定义、错误处理和常见操作的自定义宏。他们还深入研究了代码如何使用`char*`处理整数和指针，并解释了用于向量操作、算术运算和错误处理的函数。作者指出，Whitney的编程风格旨在通过使用小型、高度可重用的逻辑块来减少错误。\n\n最终，作者赞赏这一挑战，并看到了学习阅读并可能采用Whitney风格的各个方面的潜在好处，即使最初令人望而生畏。他们更好地理解了如何用代码简洁性换取可读性，并将整个代码库显示在一个屏幕上。"
  },
  {
    "id": "45733410",
    "title": "Learning from Sudoku Solvers (2007)",
    "url": "http://ravimohan.blogspot.com/2007/04/learning-from-sudoku-solvers.html",
    "summary": "This article, \"Learning from Sudoku Solvers,\" uses Ron Jeffries' attempt to build a Sudoku solver as a case study to highlight potential pitfalls of Test-Driven Development (TDD). It contrasts Jeffries' approach with Peter Norvig's successful solver.\n\nThe core argument, supported by commentary from Peter Seibel (author of \"Coders at Work\"), is that Jeffries became bogged down in the data representation and low-level implementation details from the outset, continuously refactoring and adjusting tests without making significant progress towards the actual solving algorithm. Seibel suggests this is a common pattern when applying TDD to problems where the programmer lacks a clear understanding of the solution. Norvig, in contrast, quickly established a concise data representation and moved on to the more complex problem-solving logic.\n\nThe article emphasizes that spending excessive time on early data structure design, especially within a TDD framework, can be unproductive and indicate a lack of understanding of the underlying problem. It points to a more efficient, lean approach as demonstrated by Norvig. Further updates include a discussion regarding the limitations of TDD, suggesting that TDD, while valuable, may not be universally applicable and has its own set of challenges.\n",
    "chinese_title": "从数独解算器中学习 (2007)",
    "chinese_summary": "本文《从数独解题器学习》以 Ron Jeffries 尝试构建数独解题器为例，旨在突出测试驱动开发（TDD）的潜在缺陷。它将 Jeffries 的方法与 Peter Norvig 成功的解题器进行了对比。\n\n核心论点，辅以 Peter Seibel（《编程之美》作者）的评论，指出 Jeffries 从一开始就陷入了数据表示和底层实现细节的泥潭，不断地重构和调整测试，而没有在实际的解题算法上取得重大进展。Seibel 认为，当程序员对解决方案缺乏清晰的理解时，这是应用 TDD 时的常见模式。相比之下，Norvig 迅速建立了一个简洁的数据表示，并转向了更复杂的解决问题的逻辑。\n\n本文强调，在早期数据结构设计上花费过多时间，尤其是在 TDD 框架内，可能会适得其反，并表明对底层问题缺乏理解。文章指出了 Norvig 所展示的更有效、精简的方法。进一步的更新包括对 TDD 局限性的讨论，表明 TDD 虽然有价值，但可能并不具有普遍适用性，并且有其自身的挑战。"
  },
  {
    "id": "45802029",
    "title": "The Case That A.I. Is Thinking",
    "url": "https://www.newyorker.com/magazine/2025/11/10/the-case-that-ai-is-thinking",
    "summary": "The article \"The Case That A.I. Is Thinking\" explores the evolving debate around whether A.I. models, particularly large language models (LLMs), are capable of genuine thought and understanding. While acknowledging the hype and uneven rollout of A.I. in everyday applications, the author, drawing from personal experience using A.I. in programming, argues that LLMs demonstrate a level of comprehension that challenges traditional definitions of intelligence.\n\nThe author contrasts the dismissive view of A.I. as merely \"shuffling words\" or regurgitating the internet with the impressive capabilities these models exhibit in understanding and generating code, solving complex problems, and even mastering languages. He uses the anecdote of ChatGPT solving a plumbing issue as an example. The article delves into the neuroscience behind A.I., citing research that suggests LLMs might be mirroring the function of the human neocortex, the brain region associated with intelligence.\n\nThe core argument centers on the idea that understanding is compression. LLMs, trained on vast datasets, distill information into efficient models, suggesting a form of comprehension. The article acknowledges criticisms of A.I. as a \"blurry JPEG of the web\" and the moral concerns surrounding its impact. However, it contends that these models are performing feats that were previously deemed impossible, blurring the lines between illusion and reality of understanding. Drawing from Douglas Hofstadter's theory, the author suggests that \"seeing as,\" the recognition of patterns and concepts, is a fundamental aspect of intelligence that A.I. may be achieving. The author ultimately proposes that LLMs, while not necessarily possessing consciousness or inner lives, exhibit a significant degree of understanding, prompting a re-evaluation of what constitutes \"thinking.\"\n",
    "chinese_title": "人工智能正在思考的案例",
    "chinese_summary": "人工智能正在思考的案例"
  },
  {
    "id": "45808918",
    "title": "Show HN: Yourshoesmells.com – Find the most smelly boulder gym",
    "url": "https://yourshoesmells.com",
    "summary": "Yourshoesmells.com is a website aiming to rank boulder gyms based on their perceived \"stinkiness,\" presumably from climbing shoes. The site features a leaderboard showcasing the \"Top 5 Stinky Gyms\" and aims to identify the \"Stinkiest Gym\" and \"Farthest Gym\" using ongoing calculations. It tracks the number of \"Gyms Visited\" by users and provides a geographical breakdown of gyms by region through a loading chart.\n\nUsers can contribute by casting votes to influence the rankings. The site requires registration/login to participate and offers options to request features, provide feedback, and support the project financially through \"Buy me a coffee.\" Functionality for setting up or resetting passwords is also available.\n",
    "chinese_title": "Show HN: Yourshoesmells.com – 寻找最臭的抱石馆",
    "chinese_summary": "Yourshoesmells.com 是一个旨在根据攀岩鞋散发的“臭味”对抱石馆进行排名的网站。该网站设有一个排行榜，展示“五大最臭健身房”，并通过持续计算来确定“最臭健身房”和“最远健身房”。它追踪用户“访问的健身房数量”，并通过加载图表提供按地区划分的健身房地理信息。\n\n用户可以通过投票来影响排名。该网站需要注册/登录才能参与，并提供请求功能、提供反馈以及通过“请我喝咖啡”以经济方式支持该项目的选项。还提供设置或重置密码的功能。"
  },
  {
    "id": "45804122",
    "title": "The Mack Super Pumper was a locomotive engined fire fighter (2018)",
    "url": "https://bangshift.com/bangshiftxl/mack-super-pumper-system-locomotive-engine-powered-pumper-extinguish-hell-often/",
    "summary": "The article discusses the Mack Super Pumper, a powerful firefighting apparatus. The comment suggests that readers interested in impressive firefighting capabilities should also look into New York City's fireboat \"Fire Fighter II\". The \"Fire Fighter II\" is highlighted for its exceptional pumping capacity of 50,000 gallons per minute, surpassing its sister ship, \"Fire Fighter I,\" by 20,000 gallons per minute.\n",
    "chinese_title": "马克超级泵浦车是一辆机车引擎消防车（2018年）",
    "chinese_summary": "文章探讨了麦克超级泵浦消防车，一种强大的消防设备。评论建议对令人印象深刻的消防能力感兴趣的读者也应了解纽约市的消防船“消防员II号”。“消防员II号”因其每分钟5万加仑的卓越抽水能力而备受瞩目，超过其姊妹船“消防员I号” 2万加仑每分钟。"
  },
  {
    "id": "45813208",
    "title": "Inside Pinecone: Slab Architecture",
    "url": "https://www.pinecone.io/learn/slab-architecture/",
    "summary": "This article delves into Pinecone's \"slab architecture,\" designed to balance accuracy, freshness, scalability, and predictable performance for diverse AI applications. Pinecone achieves this by organizing data into immutable units called \"slabs.\"\n\nThe write path ensures immediate durability: write requests are logged, acknowledged, and placed in an in-memory memtable. This memtable is periodically flushed to object storage, creating slabs.\n\nFor queries, requests are fanned out across all slabs (including the memtable), and results are merged. Hot slabs are cached for faster access.\n\nA key process is \"slab compaction,\" which reorganizes data in the background. Smaller L0 slabs merge into larger L1, L2, etc., slabs. This prevents query slowdowns from too many small files and allows for progressive indexing optimization. Tombstones handle updates and deletes, filtering out old versions during compaction to ensure fresh results.\n\nThe read path prioritizes immediate searchability. The memtable is checked first, and queries are fanned out to all slabs. Different search methods are used based on slab size, with metadata filtering optimized using roaring bitmaps.\n\nThis slab architecture allows Pinecone to provide immediate freshness, query performance at scale, elastic scalability, and adaptive growth, effectively abstracting away the complexity of vector search.\n",
    "chinese_title": "Pinecone内部：Slab架构",
    "chinese_summary": "本文深入探讨 Pinecone 的“slab架构”，该架构旨在为各种 AI 应用平衡准确性、新鲜度、可扩展性和可预测的性能。Pinecone 通过将数据组织成称为“slab”的不可变单元来实现这一点。\n\n写入路径确保即时持久性：写入请求被记录、确认并放置在内存中的 memtable 中。此 memtable 定期刷新到对象存储，从而创建 slab。\n\n对于查询，请求会被扇出到所有 slab（包括 memtable），然后合并结果。热门 slab 会被缓存以加快访问速度。\n\n一个关键过程是“slab 压缩”，它在后台重新组织数据。较小的 L0 slab 合并为较大的 L1、L2 等 slab。这可以防止因过多小文件导致的查询速度下降，并允许进行渐进式索引优化。Tombstone 处理更新和删除，在压缩过程中过滤掉旧版本以确保结果的新鲜度。\n\n读取路径优先考虑即时可搜索性。首先检查 memtable，然后将查询扇出到所有 slab。根据 slab 大小使用不同的搜索方法，并使用 roaring bitmap 优化元数据过滤。\n\n这种 slab 架构使 Pinecone 能够提供即时新鲜度、大规模的查询性能、弹性可扩展性和自适应增长，从而有效地抽象出向量搜索的复杂性。"
  },
  {
    "id": "45798479",
    "title": "The Case Against PGVector",
    "url": "https://alex-jacobs.com/posts/the-case-against-pgvector/",
    "summary": "This article argues against the common advice of using pgvector for vector search in production, highlighting the gap between simple demos and the realities of scaling. While pgvector offers vector similarity search within Postgres, it falls short in several key areas compared to dedicated vector databases.\n\nThe author critiques the limitations of pgvector's indexing options (IVFFlat and HNSW), detailing their memory consumption, slow build times, and impact on database performance, especially during index updates. Real-time search becomes a challenge as continuous vector insertions strain resources and lead to lock contention.\n\nMaintaining consistency between vector embeddings and related metadata adds operational complexity, requiring workarounds like staging tables or replica index builds. Query performance suffers due to Postgres's suboptimal query planning for filtered vector searches, forcing manual optimization and potentially inaccurate results. Hybrid search, combining vector similarity with full-text search, requires custom implementation.\n\nWhile pgvectorscale by Timescale addresses some of these issues, it adds another layer of complexity and isn't universally available (e.g., on AWS RDS). The author concludes that managed vector databases offer superior features like intelligent query planning, built-in hybrid search, real-time indexing, horizontal scaling, and specialized monitoring, often at a competitive cost compared to the resources and engineering time needed to make pgvector production-ready.\n",
    "chinese_title": "反对PGVector的理由",
    "chinese_summary": "本文反驳了在生产环境中使用pgvector进行向量搜索的常见建议，强调了简单演示与实际扩展之间的差距。虽然pgvector在Postgres中提供了向量相似度搜索，但与专门的向量数据库相比，它在几个关键领域存在不足。\n\n作者批判了pgvector索引选项（IVFFlat和HNSW）的局限性，详细描述了它们的内存消耗、缓慢的构建时间和对数据库性能的影响，尤其是在索引更新期间。由于持续的向量插入会消耗资源并导致锁竞争，实时搜索成为一个挑战。\n\n维护向量嵌入和相关元数据之间的一致性增加了操作复杂性，需要诸如临时表或副本索引构建等变通方法。由于Postgres对过滤向量搜索的查询计划不佳，查询性能受到影响，从而迫使手动优化并可能导致不准确的结果。结合向量相似度和全文搜索的混合搜索需要自定义实现。\n\n虽然Timescale的pgvectorscale解决了其中一些问题，但它增加了另一层复杂性，并且并非普遍可用（例如，在AWS RDS上）。作者得出结论，托管向量数据库提供了卓越的功能，如智能查询计划、内置混合搜索、实时索引、水平扩展和专门的监控，与使pgvector达到生产就绪状态所需的资源和工程时间相比，通常具有具有竞争力的成本。"
  },
  {
    "id": "45813148",
    "title": "Data breach at major Swedish software supplier impacts 1.5M",
    "url": "https://www.bleepingcomputer.com/news/security/data-breach-at-major-swedish-software-supplier-impacts-15-million/",
    "summary": "A major data breach at Swedish IT supplier Miljödata, impacting approximately 1.5 million people, is under investigation by the Swedish Authority for Privacy Protection (IMY). Miljödata, which serves about 80% of Sweden's municipalities, reported the incident in August 2025, revealing that attackers stole data and demanded a ransom of 1.5 Bitcoin.\n\nThe breach caused operational disruptions across several regions. IMY is prioritizing its investigation on Miljödata's security measures and the data handling practices of the City of Gothenburg, the Municipality of Älmhult, and the Region of Västmanland, focusing particularly on sensitive data like children's information and protected identities.\n\nThe stolen data, containing names, addresses, phone numbers, government IDs, and dates of birth, was leaked on the dark web by the Datacarry group in September 2025. The \"Have I Been Pwned\" service reports that 870,000 individuals were affected. IMY aims to identify security shortcomings to prevent future incidents. The investigation of municipalities will cover how they handled data related to children, people with protected identities, and former employees.\n",
    "chinese_title": "瑞典大型软件供应商数据泄露，影响150万用户",
    "chinese_summary": "瑞典IT供应商Miljödata发生重大数据泄露事件，影响约150万人，瑞典隐私保护局 (IMY) 正在对此进行调查。Miljödata为瑞典约80%的市政当局提供服务，该公司于2025年8月报告了该事件，披露攻击者窃取了数据并勒索1.5个比特币。\n\n此次泄露事件导致多个区域的运营中断。IMY 正在优先调查 Miljödata 的安全措施以及哥德堡市、埃尔姆胡尔特市和西曼兰区的数据处理实践，尤其关注儿童信息和受保护身份等敏感数据。\n\n包含姓名、地址、电话号码、政府身份证件和出生日期在内的被盗数据，于2025年9月被Datacarry组织泄露在暗网上。“Have I Been Pwned”服务报告称，有87万人受到影响。IMY 旨在找出安全漏洞以防止未来发生类似事件。对市政当局的调查将涵盖他们如何处理与儿童、受保护身份人员和前雇员相关的数据。"
  },
  {
    "id": "45796421",
    "title": "First recording of a dying human brain shows waves similar to memory flashbacks (2022)",
    "url": "https://louisville.edu/medicine/news/first-ever-recording-of-a-dying-human-brain-shows-waves-similar-to-memory-flashbacks",
    "summary": "This article discusses the first-ever recording of a dying human brain, revealing brain wave patterns similar to those associated with memory retrieval and dreaming. Conducted by Dr. Ajmal Zemmar and colleagues, the study analyzed the brain activity of an 87-year-old epilepsy patient who suffered a heart attack while being monitored via electroencephalography (EEG). The researchers focused on the 30 seconds before and after the heart stopped beating.\n\nThey observed changes in gamma oscillations, as well as delta, theta, alpha, and beta oscillations, which are linked to high-cognitive functions like memory recall and information processing. Dr. Zemmar speculates that the brain might be replaying significant life events in the final moments before death, mirroring near-death experiences.\n\nThe findings raise fundamental questions about the definition of death, particularly regarding the timing of organ donation. While acknowledging the limitations of a single case study, Zemmar highlights the scientific, metaphysical, and spiritual implications. Scientifically, more research is needed due to the patient's pre-existing conditions. Metaphysically, it suggests a possible replay of life in the final seconds. Spiritually, it could provide comfort to grieving families by suggesting that their loved ones might be experiencing positive memories at the time of death. The research prompts a re-evaluation of current methods for declaring death, suggesting the potential inclusion of EEG monitoring.\n",
    "chinese_title": "人类濒死大脑首次记录显示类似记忆闪回的脑电波 (2022)",
    "chinese_summary": "首次记录濒死人脑活动：揭示与记忆提取和做梦相关的脑电波模式"
  },
  {
    "id": "45799478",
    "title": "State of Terminal Emulators in 2025: The Errant Champions",
    "url": "https://www.jeffquast.com/post/state-of-terminal-emulation-2025/",
    "summary": "In his 2025 update on terminal emulator Unicode support, the author highlights ongoing challenges in accurately displaying diverse Unicode scripts within fixed-width terminal grids. The ucs-detect tool, used for testing, now assesses DEC Private Modes, sixel graphics, and pixel size.\n\nGhostty, a new terminal built from scratch in Zig by Mitchell Hashimoto, is lauded for its exceptional Unicode support and its potential to become a foundational alternative to libvte. Kovid Goyal's Kitty also performs exceptionally well, and Goyal's publication of a text-splitting algorithm aligns closely with the Python wcwidth specification. They are the only terminals to support Variation Selector 15.\n\nThe article details significant performance differences among terminals, with iTerm2 and VTE-based terminals exhibiting notably slow performance. Optimization efforts in Python wcwidth have proven effective, primarily relying on LRU caching due to the repetitive nature of human languages.\n\nThe author discusses issues observed in Terminology, iTerm2, Konsole, and Contour regarding DEC Private Mode support. Improvements in libvte, particularly concerning emoji support, are noted as positive developments.\n\nThe article concludes by addressing the limitations of fixed-width terminals in displaying complex languages and explores the potential of the newly published text sizing protocol to enable variable-sized text, improving legibility and accessibility. The author suggests that allowing font engines to drive text display, rather than meticulously managing cell and cursor movements, could offer a pathway to better support diverse scripts.\n",
    "chinese_title": "State of Terminal Emulators in 2025: The Errant Champions",
    "chinese_summary": "In his 2025 update on terminal emulator Unicode support, the author highlights ongoing challenges in accurately displaying diverse Unicode scripts within fixed-width terminal grids. The ucs-detect tool, used for testing, now assesses DEC Private Modes, sixel graphics, and pixel size.\n\nGhostty, a new terminal built from scratch in Zig by Mitchell Hashimoto, is lauded for its exceptional Unicode support and its potential to become a foundational alternative to libvte. Kovid Goyal's Kitty also performs exceptionally well, and Goyal's publication of a text-splitting algorithm aligns closely with the Python wcwidth specification. They are the only terminals to support Variation Selector 15.\n\nThe article details significant performance differences among terminals, with iTerm2 and VTE-based terminals exhibiting notably slow performance. Optimization efforts in Python wcwidth have proven effective, primarily relying on LRU caching due to the repetitive nature of human languages.\n\nThe author discusses issues observed in Terminology, iTerm2, Konsole, and Contour regarding DEC Private Mode support. Improvements in libvte, particularly concerning emoji support, are noted as positive developments.\n\nThe article concludes by addressing the limitations of fixed-width terminals in displaying complex languages and explores the potential of the newly published text sizing protocol to enable variable-sized text, improving legibility and accessibility. The author suggests that allowing font engines to drive text display, rather than meticulously managing cell and cursor movements, could offer a pathway to better support diverse scripts.\n"
  },
  {
    "id": "45748816",
    "title": "A visualization of the RGB space covered by named colors",
    "url": "https://codepen.io/meodai/full/zdgXJj/",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "具名颜色覆盖的RGB空间可视化",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "45783074",
    "title": "WebAssembly (WASM) arch support for the Linux kernel",
    "url": "https://github.com/joelseverin/linux-wasm",
    "summary": "This project provides scripts for building and running a Linux system natively in WebAssembly (WASM). It leverages several software components: LLVM (Clang, wasm-ld), a patched Linux kernel (WASM architecture support, WASM binfmt, web console driver), musl libc (with WASM target support), modified kernel headers for BusyBox, and BusyBox itself with a WASM defconfig. A minimal initramfs is created using the BusyBox installation, providing a pty and a shell. A sample JavaScript WASM host runtime is included for demonstration and debugging.\n\nKey points include the necessity of building Linux in a NOMMU configuration due to WASM's limitations, and the alternative of using a proxy for syscalls. The `linux-wasm.sh` script automates the downloading and building process. Workarounds are mentioned for LLVM build system bugs and limitations in the Linux kernel's build system requiring space-free paths.\n\nDocker support is provided through two containers: `linux-wasm-base` (build environment) and `linux-wasm-contained` (isolated build). These containers simplify the build process and offer options for development and automated build servers. Environment variables like `LW_WORKSPACE` can be used to customize the workspace folder within the Docker environment.\n",
    "chinese_title": "Linux内核对WebAssembly (WASM)架构的支持",
    "chinese_summary": "本项目提供用于在 WebAssembly (WASM) 中原生构建和运行 Linux 系统的脚本。它利用了以下几个软件组件：LLVM (Clang, wasm-ld)、打过补丁的 Linux 内核（WASM 架构支持、WASM binfmt、Web 控制台驱动）、musl libc（支持 WASM 目标）、修改后的 BusyBox 内核头文件，以及带有 WASM defconfig 的 BusyBox 本身。使用 BusyBox 安装创建了一个最小的 initramfs，提供了一个 pty 和一个 shell。包含了一个示例 JavaScript WASM 主机运行时，用于演示和调试。\n\n重点包括由于 WASM 的限制，必须以 NOMMU 配置构建 Linux，以及使用代理进行系统调用的替代方案。`linux-wasm.sh` 脚本可自动执行下载和构建过程。提到了针对 LLVM 构建系统错误和 Linux 内核构建系统中需要无空格路径的限制的解决方法。\n\n通过两个容器提供 Docker 支持：`linux-wasm-base` (构建环境) 和 `linux-wasm-contained` (隔离构建)。这些容器简化了构建过程，并为开发和自动化构建服务器提供了选项。可以使用 `LW_WORKSPACE` 等环境变量来自定义 Docker 环境中的工作区文件夹。"
  },
  {
    "id": "45805458",
    "title": "Guideline has been acquired by Gusto",
    "url": "https://help.guideline.com/en/articles/12694322-guideline-has-joined-gusto-faqs-about-our-recent-acquisition",
    "summary": "Guideline, a 401(k) provider, has been acquired by Gusto, a payroll, benefits, and HR solutions company. The goal is to offer a more integrated payroll and 401(k) experience for small businesses, making retirement savings simpler and more accessible.\n\nThe transition aims to be seamless with minimal disruption. Users can expect the current Guideline service to continue operating as usual, including the mobile app, access to statements and educational resources, and historical documents. Single Sign-On (SSO) is now available for Gusto users to access their 401(k) accounts.\n\nKey points:\n\n*   **No immediate action needed:** Participants' 401(k) setups and contributions remain unchanged.\n*   **No fee changes:** Current pricing will remain the same.\n*   **Security is a priority:** Existing security measures will continue to protect accounts and personal information.\n*   **No investment changes:** Investments and asset allocations will remain unaffected.\n*   **Transactions will continue without delay:** Contributions, distributions, and rollovers will be processed promptly.\n*   **Support remains the same:** Clients can continue to contact clients@guideline.com and participants support@guideline.com for 401(k) questions.\n\nThe acquisition is expected to lead to future enhancements and a more unified experience between payroll and 401(k) management, especially for companies already using Gusto payroll.\n",
    "chinese_title": "Guideline已被Gusto收购",
    "chinese_summary": "401(k)提供商Guideline已被薪资、福利和人力资源解决方案公司Gusto收购。目标是为小型企业提供更集成的薪资和401(k)体验，使退休储蓄更简单、更容易。\n\n此次过渡旨在无缝进行，尽量减少中断。用户可以期望当前的Guideline服务照常运行，包括移动应用程序、报表和教育资源的访问以及历史文档。Gusto用户现在可以使用单点登录(SSO)来访问他们的401(k)账户。\n\n要点：\n\n*   **无需立即采取行动：** 参与者的401(k)设置和供款保持不变。\n*   **费用无变化：** 当前定价将保持不变。\n*   **安全是首要任务：** 现有的安全措施将继续保护账户和个人信息。\n*   **投资无变化：** 投资和资产配置将保持不变。\n*   **交易将继续进行，不会延误：** 供款、分配和转账将及时处理。\n*   **支持保持不变：** 客户可以继续联系clients@guideline.com，参与者可以继续联系support@guideline.com咨询401(k)问题。\n\n预计此次收购将带来未来的增强功能，并在薪资和401(k)管理之间实现更加统一的体验，特别是对于已经使用Gusto薪资的公司。"
  },
  {
    "id": "45802459",
    "title": "Gallery of wonderful drawings our little thermal printer received",
    "url": "https://guestbook.goodenough.us",
    "summary": "This \"Gallery of Wonderful Drawings\" showcases the charming guestbook entries collected by a little thermal printer. People are invited to \"Draw us something!\" and the submissions, presented as a chronological list from December 10, 2024, back to October 23, 2024, provide a glimpse into the creativity of visitors. Each entry includes the name (or pseudonym), the date, and an IP address. Some entries offer quirky titles like \"Rene The Robot (Self Portrait)\" and \"Time + Pressure = Diamonds.\" The guestbook features a diverse range of contributors from various locations, as implied by the names and IP addresses. The page also indicates that more drawings are available to view beyond the currently displayed entries with the phrase \"Loading more choice prints...\"\n",
    "chinese_title": "我们的小型热敏打印机收到的精彩图画作品集",
    "chinese_summary": "精彩涂鸦展：小小热敏打印机收集的迷人留言簿作品。欢迎大家“给我们画点什么！”，这些作品按时间顺序排列（从2024年12月10日到2024年10月23日），展现了游客们的无限创意。每幅作品都包含姓名（或笔名）、日期和IP地址。一些作品拥有古怪的标题，例如“机器人瑞内（自画像）”和“时间+压力=钻石”。留言簿收录了来自不同地区的贡献者，姓名和IP地址暗示了这一点。页面还显示，目前显示的条目之外还有更多图画可供查看：“正在加载更多精选作品...”"
  },
  {
    "id": "45808690",
    "title": "Some software bloat is OK",
    "url": "https://waspdev.com/articles/2025-11-04/some-software-bloat-is-ok",
    "summary": "生成摘要时出错",
    "chinese_title": "一定程度的软件臃肿是可以接受的。",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45798881",
    "title": "Skyfall-GS – Synthesizing Immersive 3D Urban Scenes from Satellite Imagery",
    "url": "https://skyfall-gs.jayinnn.dev/",
    "summary": "Skyfall-GS addresses the challenge of creating large-scale, explorable 3D urban scenes, a task hindered by the lack of extensive, high-quality 3D training data. Instead of relying on expensive 3D scans, Skyfall-GS leverages readily available satellite imagery for coarse geometry and open-domain diffusion models for high-quality, close-up appearances. This approach allows for city-block scale 3D scene creation without the need for costly 3D annotations, enabling real-time, immersive 3D exploration.\n\nThe core of Skyfall-GS is a curriculum-driven iterative refinement strategy. This process progressively improves both the geometric completeness and the photorealistic textures of the generated 3D scenes. By starting with a rough satellite-derived geometry and iteratively refining it with diffusion models informed by multiple viewpoints, the system achieves a high level of detail and realism.\n\nThe article highlights that Skyfall-GS represents a significant advancement in 3D urban scene generation. Experimental results demonstrate that it produces superior cross-view consistent geometry and more realistic textures compared to existing methods. In essence, Skyfall-GS provides a novel and effective framework for creating immersive 3D urban environments by synergistically combining satellite data and diffusion models, opening possibilities for various embodied applications.\n",
    "chinese_title": "Skyfall-GS – 从卫星图像合成沉浸式3D城市场景",
    "chinese_summary": "Skyfall-GS：利用卫星图像和扩散模型生成大规模可探索的3D城市场景，无需昂贵的3D标注，实现沉浸式实时3D探索。其核心是课程驱动的迭代优化策略，逐步提升几何完整性和照片级真实纹理。实验结果表明，与现有方法相比，该方法生成了更优异的跨视角一致几何体和更真实的纹理。"
  },
  {
    "id": "45719250",
    "title": "Inside an Isotemp OCXO107-10 Oven Controlled Crystal Oscillator",
    "url": "https://tomverbeure.github.io/2025/10/26/Inside-an-Isotemp-OCXO107-10.html",
    "summary": "This article details the author's exploration of an Isotemp OCXO107-10 Oven Controlled Crystal Oscillator, purchased for a mere $5.  The OCXO, a 5 MHz model, is described as a \"chonker\" suggesting high stability due to its larger size which allows for better temperature control mechanisms.\n\nThe author researches the OCXO through the time-nuts email list, discovering its historical cost (>$1000), previous use by Lucent, and the existence of variations like the OCXO107-16.  He also finds that the EFC (electronic frequency control) pin has noisy Vref output.  While a datasheet exists for the OCXO107-3, it's not identical to the -10 model.\n\nThe author successfully powers the OCXO, observing its power draw during the warm-up phase. The output power and harmonic distortion are measured. The unit's tag provides reference voltages related to EFC tuning.\n\nThanks to a contact, Ed Palmer, the author provides insight into the OCXO's internal design. It features a Dewar flask (like a thermos) for thermal isolation, a hallmark of older, high-stability OCXOs. While modern double-oven designs exist, the author notes Quantic Wenzel's continued use of Dewar flasks. The internal components consist of the oscillator control board, a large crystal, a Motorola Darlington transistor used as a heating element, and a possible TL431 voltage reference for temperature feedback.\n\nThe author plans to build a dedicated, low-noise power supply to conduct long-term comparative measurements of OCXOs in his home lab, citing the need for extended stabilization periods and a desire to move away from his current noisy bench supply.\n",
    "chinese_title": "Isotemp OCXO107-10 恒温晶振内部结构",
    "chinese_summary": "本文详细介绍了作者对以区区5美元购得的Isotemp OCXO107-10恒温晶振的探索。这款5 MHz的OCXO被描述为“大块头”，暗示其较大的尺寸意味着更高的稳定性，因为它允许更好的温度控制机制。\n\n作者通过time-nuts邮件列表研究该OCXO，发现了它的历史成本（>1000美元）、朗讯公司之前的使用情况，以及OCXO107-16等变体的存在。他还发现EFC（电子频率控制）引脚有噪声Vref输出。 虽然存在OCXO107-3的数据表，但它与-10型号并不完全相同。\n\n作者成功地为OCXO供电，观察了其在预热阶段的功耗。测量了输出功率和谐波失真。 该设备的标签提供了与EFC调谐相关的参考电压。\n\n感谢联系人Ed Palmer，作者得以深入了解OCXO的内部设计。它采用杜瓦瓶（类似热水瓶）进行热隔离，这是早期高稳定性OCXO的标志。虽然现在存在现代的双层恒温设计，但作者注意到Quantic Wenzel仍然继续使用杜瓦瓶。 内部组件包括振荡器控制板、大晶体、用作加热元件的摩托罗拉达林顿晶体管，以及可能用于温度反馈的TL431电压基准。\n\n作者计划构建一个专用的低噪声电源，以便在其家庭实验室中对OCXO进行长期比较测量，理由是需要更长的稳定期，并且希望摆脱当前嘈杂的台式电源。"
  },
  {
    "id": "45808308",
    "title": "Lessons from interviews on deploying AI Agents in production",
    "url": "https://mmc.vc/research/state-of-agentic-ai-founders-edition/",
    "summary": "This article explores the challenges and strategies for deploying AI agents in enterprise settings, drawing on surveys of over 30 European agentic AI startup founders and interviews with 40+ practitioners. It addresses the initial skepticism towards AI agents, comparing them to the infamous \"Clippy,\" and highlights the importance of successful deployment.\n\nThe main challenges identified are workflow integration, employee resistance, and data privacy, rather than purely technical issues. Successful strategies emphasize a \"Think Small\" approach, focusing on low-risk, high-impact tasks that demonstrate ROI and augment (rather than replace) human workers.\n\nThe article reveals that 62% of agentic AI startups are using core business budgets, indicating a move beyond experimentation. Hybrid and Per Task pricing models are most common, while outcome-based pricing remains rare due to complexity. Most startups are building agentic infrastructure in-house.\n\nAccuracy is crucial, with over 90% reporting at least 70% accuracy in their solutions. However, acceptable accuracy levels vary by industry and use case. The article identifies three configurations: Medium Accuracy/High Autonomy, High Accuracy/Low Autonomy (common in healthcare), and High Accuracy/High Autonomy (financial services, cybersecurity, customer service).\n\nThe article also explains the core attributes of AI Agents: Goal orientation, reasoning, autonomy and persistence (memory).\nIt closes by mentioning that in multi-agent systems, the need for accuracy will only increase.\n",
    "chinese_title": "从生产环境中部署AI代理的访谈中得到的教训",
    "chinese_summary": "本文探讨了在企业环境中部署人工智能代理所面临的挑战和策略，借鉴了对30多家欧洲代理人工智能初创公司创始人的调查以及对40多位从业者的访谈。它探讨了最初对人工智能代理的怀疑态度，将其与臭名昭著的“Clippy”相比较，并强调了成功部署的重要性。\n\n主要挑战在于工作流程集成、员工抵制和数据隐私，而不是纯粹的技术问题。成功的策略强调“从小处着手”的方法，专注于低风险、高影响的任务，这些任务能够证明投资回报率并增强（而非取代）人类员工的能力。\n\n本文揭示，62%的代理人工智能初创公司正在使用核心业务预算，这表明已经超越了实验阶段。混合定价和按任务定价模型最为常见，而基于结果的定价由于其复杂性仍然很少见。大多数初创公司正在内部构建代理基础设施。\n\n准确性至关重要，超过 90% 的公司报告其解决方案的准确率至少达到 70%。然而，可接受的准确率因行业和用例而异。本文确定了三种配置：中等准确率/高自主性，高准确率/低自主性（在医疗保健领域常见），以及高准确率/高自主性（金融服务、网络安全、客户服务）。\n\n本文还解释了人工智能代理的核心属性：目标导向、推理、自主性和持久性（记忆）。\n最后提到，在多代理系统中，对准确性的需求只会增加。"
  },
  {
    "id": "45798681",
    "title": "Why Nextcloud feels slow to use",
    "url": "https://ounapuu.ee/posts/2025/11/03/nextcloud-slow/",
    "summary": "This article discusses the author's frustration with the slow performance of Nextcloud, a self-hosted platform for file storage, calendar, contacts, and other services. While appreciating Nextcloud's extensive feature set and convenience, the author finds it consistently slow, even on decent hardware.\n\nThe primary cause identified is the excessive amount of Javascript required for even basic operations. The author highlights several examples, such as the 4.71 MB `core-common.js` bundle, 5.94 MB for the Calendar app's basic view, and 4.36 MB for the Notes app's editor. These large Javascript files result in lengthy loading times, especially on slower connections and mobile devices.\n\nThe author argues that the functionality-to-bundle size ratio is significantly off, suggesting architectural issues and inefficient code. This poor performance negatively impacts user experience, making tasks like accessing a shopping list in the Tasks app unacceptably slow.\n\nAs a result, the author has begun replacing some Nextcloud apps with alternatives, such as using Vikunja for tasks and Immich for photos, as these alternatives offer significantly smaller Javascript footprints and improved performance.\n\nThe author acknowledges the potential reasons behind the issue, including overworked development teams, but emphasizes the resulting negative impact on user experience and accessibility. The author concludes by recommending Alex Russell's work on web performance, emphasizing the importance of considering performance and accessibility in web development.\n",
    "chinese_title": "为什么 Nextcloud 用起来感觉很慢",
    "chinese_summary": "本文探讨了作者对 Nextcloud 性能缓慢的失望之情。Nextcloud 是一个用于文件存储、日历、联系人和其他服务的自托管平台。虽然作者欣赏 Nextcloud 广泛的功能集和便利性，但他发现即使在配置不错的硬件上，它的速度也一直很慢。\n\n主要原因是即使是基本操作也需要大量的 Javascript。作者列举了几个例子，例如 4.71 MB 的 `core-common.js` 包，日历应用程序基本视图的 5.94 MB，以及 Notes 应用程序编辑器的 4.36 MB。这些大型 Javascript 文件导致加载时间过长，尤其是在较慢的连接和移动设备上。\n\n作者认为，功能与捆绑包大小的比率严重失衡，表明存在架构问题和低效代码。这种糟糕的性能对用户体验产生了负面影响，使得在 Tasks 应用程序中访问购物清单等任务的速度慢得令人无法接受。\n\n因此，作者已经开始用替代方案替换一些 Nextcloud 应用程序，例如使用 Vikunja 来处理任务，使用 Immich 来处理照片，因为这些替代方案提供了明显更小的 Javascript 体积和更高的性能。\n\n作者承认该问题背后可能存在的原因，包括过度劳累的开发团队，但强调了由此产生的对用户体验和可访问性的负面影响。作者最后推荐了 Alex Russell 关于 Web 性能的研究，强调了在 Web 开发中考虑性能和可访问性的重要性。"
  },
  {
    "id": "45811248",
    "title": "US Traces Ransomware Attacks to 2 People Working for Cybersecurity Firms",
    "url": "https://www.pcmag.com/news/us-traces-ransomware-attacks-to-2-people-working-for-cybersecurity-firms",
    "summary": "Two cybersecurity professionals, Kevin Tyler Martin of DigitalMint and Ryan Clifford Goldberg of Sygnia Cybersecurity Services, have been indicted for allegedly conspiring to spread the ALPHV ransomware to multiple companies, including a drone manufacturer, an engineering firm, and three healthcare organizations. Federal investigators claim the duo launched their scheme around May 2023, infecting a company and demanding $10 million for decryption, ultimately receiving $1.2 million.\n\nThe scheme continued until April 2025, with the assistance of an unnamed co-conspirator, and involved acquiring an affiliate account for the ALPHV/Blackcat ransomware gang. Goldberg confessed to the FBI, citing debt as the motivation and expressing remorse. Martin pleaded not guilty.\n\nBoth DigitalMint and Sygnia have stated that the employees acted without company knowledge and were subsequently terminated. They emphasize that the attacks did not compromise client data. The FBI is continuing its investigation.\n",
    "chinese_title": "美国追踪到勒索软件攻击与两名在网络安全公司工作的人员有关",
    "chinese_summary": "两名网络安全专家因涉嫌合谋传播ALPHV勒索软件而被起诉，受害者包括一家无人机制造商、一家工程公司和三家医疗机构。联邦调查人员称，凯文·泰勒·马丁（来自DigitalMint）和瑞安·克利福德·戈德堡（来自Sygnia Cybersecurity Services）二人于2023年5月左右开始实施该计划，感染了一家公司并勒索1000万美元的解密费用，最终获得120万美元。\n\n在一名未透露姓名的同谋协助下，该计划持续到2025年4月，并涉及获得ALPHV/Blackcat勒索软件团伙的联盟账户。戈德堡向FBI供认，称债务是其动机，并表达了悔意。马丁拒不认罪。\n\nDigitalMint和Sygnia均表示，涉事员工的行为是在公司不知情的情况下进行的，随后已被解雇。他们强调，这些攻击并未危及客户数据。联邦调查局正在继续调查。"
  },
  {
    "id": "45714937",
    "title": "The MP3.com Rescue Barge Barge",
    "url": "https://blog.somnolescent.net/2025/09/mp3-com-rescue-barge-barge/",
    "summary": "In a blog post dated September 10, 2025, dotcomboom details their project, \"The MP3.com Rescue Barge Barge,\" aimed at creating a comprehensive archive of music from the defunct MP3.com. They downloaded 1.78TB of data from the Internet Archive's Rescue Barge and Wayback Machine, motivated by a desire to preserve the music amid concerns about the Internet Archive's legal battles.\n\nThe author encountered storage challenges, eventually using a 3TB drive to house the entire collection. Initial disorganization due to wget's folder creation method was solved using the \"Everything\" file indexing tool. The core of the project involved creating a database of MP3 metadata.\n\nWinamp 5 (via WACUP) proved surprisingly adept at handling the massive music library, allowing for smooth browsing and tag indexing. The author then exported the data as a CSV file, including crucial information like artist, track names, and URLs. The author then used Excel to replace the local file paths with the original source URLs.\n\nThe final CSV/spreadsheet contains data for over 533,046 songs, including information like track and artist names, and the original mp3.com URL. Despite some minor imperfections in the CSV format, dotcomboom released the database on their website, hoping it would be useful for others interested in exploring and preserving MP3.com's musical legacy.\n",
    "chinese_title": "MP3.com救援驳船",
    "chinese_summary": "在2025年9月10日的博客文章中，dotcomboom详细介绍了他们的项目“MP3.com拯救驳船”，旨在创建一个已倒闭的MP3.com音乐的全面档案。他们从互联网档案馆的拯救驳船和时光机下载了1.78TB的数据，其动机是在对互联网档案馆的法律纠纷的担忧中保存这些音乐。\n\n作者遇到了存储挑战，最终使用了一个3TB的硬盘来存放整个集合。最初由于wget的文件夹创建方法造成的混乱，通过使用“Everything”文件索引工具得以解决。项目的核心是创建MP3元数据的数据库。\n\nWinamp 5（通过WACUP）被证明非常擅长处理大型音乐库，可以流畅地浏览和索引标签。作者随后将数据导出为CSV文件，其中包括艺术家、曲目标题和URL等关键信息。然后，作者使用Excel将本地文件路径替换为原始来源URL。\n\n最终的CSV/电子表格包含超过533,046首歌曲的数据，包括曲目和艺术家姓名以及原始mp3.com URL等信息。尽管CSV格式存在一些细微的缺陷，dotcomboom还是在其网站上发布了该数据库，希望它对其他有兴趣探索和保存MP3.com音乐遗产的人有用。"
  },
  {
    "id": "45809897",
    "title": "This Month in Ladybird – October 2025",
    "url": "https://ladybird.org/newsletter/2025-10-31/",
    "summary": "The Ladybird browser project had a productive October 2025, merging 217 pull requests from 43 contributors. Key highlights include welcoming new sponsors Axeptio and Gravwell, significantly improving Web Platform Tests (WPT) scores, and starting work on a persistent HTTP disk cache.\n\nPerformance improvements were made across various areas, including JavaScript string and object property handling, and optimization of integer arithmetic. Trusted Types support was expanded to several DOM APIs. Initial support for XPath evaluations was added, enabling the htmx library to work.\n\nThe media playback system was revamped for better audio/video synchronization and multi-track support. Ladybird now supports pinch-to-zoom on macOS. Accessibility DevTools were reimplemented, and progress was made on the CSS Typed OM API, including supporting setting styles with most types of CSSStyleValue and implementing `sibling-count()` and `sibling-index()`.\n\nRendering improvements include CSS and SVG gradients, CanvasPattern support, and enhanced WebGL2 buffer and framebuffer support. Targeted WebGL fixes improved Google Maps Globe View.\n\nCommunity efforts continue to improve Windows support, with Ladybird now running on Windows and the Gamepad API functional.\n",
    "chinese_title": "瓢虫月刊 – 2025年10月",
    "chinese_summary": "瓢虫浏览器项目在2025年10月颇有成效，合并了来自43位贡献者的217个拉取请求。主要亮点包括欢迎新的赞助商Axeptio和Gravwell，显著提高了Web平台测试(WPT)分数，以及开始开发持久性HTTP磁盘缓存。\n\n在各个领域都进行了性能改进，包括JavaScript字符串和对象属性处理，以及整数算术的优化。 Trusted Types支持已扩展到多个DOM API。添加了对XPath评估的初步支持，使htmx库能够工作。\n\n媒体播放系统经过改进，以实现更好的音频/视频同步和多轨支持。 Ladybird现在支持macOS上的捏合缩放。无障碍DevTools已重新实现，并且在CSS Typed OM API方面取得了进展，包括支持使用大多数类型的CSSStyleValue设置样式以及实现`sibling-count()`和`sibling-index()`。\n\n渲染方面的改进包括CSS和SVG渐变、CanvasPattern支持以及增强的WebGL2缓冲区和帧缓冲区支持。有针对性的WebGL修复改进了Google地图地球视图。\n\n社区的努力仍在继续改进Windows支持，Ladybird现在可以在Windows上运行，并且Gamepad API可以正常工作。"
  },
  {
    "id": "45699598",
    "title": "How to Draw a Tetrapod",
    "url": "https://dotat.at/@/2025-10-24-tetrapod.html",
    "summary": "This article details a method for drawing and modeling a concrete tetrapod, a structure used for coastal defense, focusing on a novel approach derived from a surprising observation. The author starts by referencing the original patent for tetrapods and noticing a common design element: chunky chamfers at the ends of the legs.\n\nThe core idea is to construct a tetrapod starting from a cube enclosing a tetrahedron. By experimenting with circles touching the faces of the cube and edges of the tetrahedron near a common vertex, the author found a pleasing design where the length and width of the leg closely match half the side length of the initial cube. This aligns with the specifications in the original tetrapod patent.\n\nThe \"recipe\" involves choosing a size (which becomes both the leg length/diameter and half the tetrapod's height), defining the tetrapod within a cube and tetrahedron, and constructing each leg from truncated cones. Key steps include calculating the radii and positions of four circles (waist, thigh, ankle, sole) based on tapers derived from the cube and tetrahedron geometry.  The author provides the formulas for determining these values, ensuring correct proportions and a taper angle of approximately 10 degrees.\n\nFinally, the individual legs are created, rotated to their appropriate positions, and clipped at specific planes to avoid overlap, resulting in a complete tetrapod model. The author concludes by noting the elegance of the derived design and pondering the origins of the chamfer and the ellipse formed where the legs intersect. They also provide links to a three.js animation of the tetrapod and its source code.\n",
    "chinese_title": "如何画四足动物",
    "chinese_summary": "本文详细介绍了一种绘制和建模混凝土四脚体的方,该结构用于海岸防御，重点介绍了一种源于令人惊讶的观察的新颖方法。作者首先参考了四脚体的原始专利，并注意到一个常见的设计元素：腿端粗短的倒角。\n\n其核心思想是从一个包含四面体的立方体开始构建一个四脚体。通过试验与立方体表面和四面体边缘在公共顶点附近相切的圆，作者发现了一种令人满意的设计，其中腿的长度和宽度与初始立方体边长的一半非常匹配。这与原始四脚体专利中的规格相符。\n\n这个“配方”包括选择一个尺寸（它既是腿的长度/直径，又是四脚体高度的一半），在立方体和四面体内定义四脚体，并从截锥体构建每条腿。关键步骤包括根据从立方体和四面体几何形状导出的锥度，计算四个圆（腰部、大腿、脚踝、鞋底）的半径和位置。作者提供了确定这些值的公式，确保了正确的比例和大约10度的锥角。\n\n最后，创建单个腿，旋转到其适当的位置，并在特定平面上进行裁剪以避免重叠，从而得到完整的四脚体模型。作者最后指出导出设计的优雅性，并思考倒角的起源以及腿部相交处形成的椭圆。他们还提供了指向四脚体及其源代码的 three.js 动画的链接。"
  },
  {
    "id": "45809975",
    "title": "Fixing LCD Screen Corruption of a Tektronix TDS220 Oscilloscope",
    "url": "https://tomverbeure.github.io/2025/11/03/TDS220-LCD-Corruption-Fix.html",
    "summary": "This article details the repair process of a Tektronix TDS220 oscilloscope purchased at a flea market for $25 due to screen flicker and capacitor issues. The author outlines the common problems with the TDS220, including leaking capacitors, weak BNC connector grounds, and dim LCD backlights.\n\nThe repair process included replacing all 11 electrolytic capacitors in the power supply due to suspected leakage. A Digikey parts list is provided for convenience. While this addressed the leaking capacitor issue, the screen corruption persisted.\n\nFurther investigation led to replacing three specialized 3.3uF 35V capacitors inside the LCD panel itself, which resolved the intermittent screen corruption, repairing the screen for good. Due to lack of exact drop in replacement, the original caps were replaced by normal electrolytic caps.\n\nThe author also replaced the aging CCFL backlight, though the improvement in brightness was debatable, and discusses the possibility of LED conversion.\n\nFinally, the inaccurate square wave output from the probe compensation was fixed by reflowing the solder on the BNC connector pins on the main PCB. The author concludes that the TDS220 is now fully functional and a useful addition to his workbench.\n",
    "chinese_title": "修复泰克TDS220示波器LCD屏幕损坏",
    "chinese_summary": "本文详细介绍了对一台在跳蚤市场以25美元购得的泰克TDS220示波器的维修过程，该示波器存在屏幕闪烁和电容问题。作者概述了TDS220的常见问题，包括电容漏液、BNC连接器接地不良以及LCD背光昏暗。\n\n维修过程包括更换电源中的所有11个电解电容，原因是怀疑存在漏液。为方便起见，提供了Digikey零件清单。虽然这解决了电容漏液问题，但屏幕损坏仍然存在。\n\n进一步调查发现，更换了LCD面板内部的三个专用3.3uF 35V电容，从而解决了间歇性屏幕损坏问题，彻底修复了屏幕。由于缺乏完全替代的元件，原始电容被普通电解电容所取代。\n\n作者还更换了老化的CCFL背光灯，尽管亮度改善效果值得商榷，并讨论了LED转换的可能性。\n\n最后，通过回流焊接主PCB上BNC连接器引脚上的焊点，修复了探头补偿产生的不准确方波输出。作者总结说，TDS220现在功能齐全，是其工作台上的一个有用补充。"
  },
  {
    "id": "45798838",
    "title": "VimGraph",
    "url": "https://resources.wolframcloud.com/FunctionRepository/resources/VimGraph/",
    "summary": "VimGraph is a Wolfram Language Resource Function that constructs a graph representing simple Vim-style movements within a given text string. Each letter in the text becomes a vertex in the graph, and edges represent possible movements between letters using Vim commands like 'h', 'l', 'j', 'k', 'w', 'b', 'e', '^', and '$'. These commands correspond to moving left/right, up/down, to the beginning/end of the next/previous word, or to the beginning/end of the line.\n\nThe function allows for customization via the \"IncludedVimMovements\" option, letting users restrict the graph to specific Vim commands. The \"StringPattern\" and \"CustomPatterns\" options allow for defining new, custom movement patterns based on string matches within the text. Standard Graph options are also supported.\n\nThe function can be used to visualize Vim-style navigation within text, calculate the minimum keystroke distance between letters, and explore the impact of text formatting (like newlines) on navigation efficiency. An example demonstrates defining custom movements, allowing for expansion beyond the standard Vim command set.\n\nDeveloped by Pavel Hajek, VimGraph requires Wolfram Language 13.0 or above and is licensed under the Creative Commons Attribution 4.0 International License. Related functions include `StringPosition`.\n",
    "chinese_title": "Vim图",
    "chinese_summary": "VimGraph是一个 Wolfram 语言资源函数，用于构建一个图，该图表示给定文本字符串中简单的 Vim 风格移动。文本中的每个字母都成为图中的一个顶点，边表示使用 Vim 命令（如“h”、“l”、“j”、“k”、“w”、“b”、“e”、“^”和“$”）在字母之间可能的移动。这些命令对应于向左/向右、向上/向下移动，移动到下一个/前一个单词的开头/结尾，或移动到行的开头/结尾。\n\n该函数允许通过“IncludedVimMovements”选项进行自定义，允许用户将图限制为特定的 Vim 命令。“StringPattern”和“CustomPatterns”选项允许基于文本中的字符串匹配定义新的自定义移动模式。也支持标准图选项。\n\n该函数可用于可视化文本中的 Vim 风格导航，计算字母之间的最小按键距离，并探索文本格式（如换行符）对导航效率的影响。一个示例演示了定义自定义移动，允许扩展到标准 Vim 命令集之外。\n\nVimGraph 由 Pavel Hajek 开发，需要 Wolfram 语言 13.0 或更高版本，并根据 Creative Commons Attribution 4.0 International License 获得许可。相关函数包括 `StringPosition`。"
  },
  {
    "id": "45805514",
    "title": "Linkers (2007)",
    "url": "https://www.airs.com/blog/archives/38",
    "summary": "Ian Lance Taylor's blog post, \"Linkers part 1,\" initiates a series exploring the intricacies of linkers, aiming to demystify the linking process for programmers. He starts with a personal introduction, recounting his experiences writing linkers, highlighting the consistent goal of speed improvement. He wrote his first linker in 1988, a second in 1993/94, and is currently working on a third, named gold.\n\nTaylor then provides a technical introduction, explaining that linkers convert object files into executables and shared libraries. He outlines the typical software development process, from writing code in languages like C++ to compilation into assembly code and subsequently into object files. He notes how linkers evolved to combine separately assembled object files into single executables, driven by the emergence of subroutine libraries. Shared libraries are mentioned as a later addition to the linker's responsibilities.\n\nThe post emphasizes the linker's role as a crucial, though often uninteresting, step in software development, primarily focused on speed. The comments section reveals anticipation for future posts in the series, particularly concerning template instantiation, link-time optimizations, and the evolving nature of linkers. Taylor hints at addressing these topics later. There's also discussion about existing literature on linkers, with references to Sun's Linkers and Libraries Guide and John Levine's book, alongside updates on the future of the gold linker.\n",
    "chinese_title": "链接器 (2007)",
    "chinese_summary": "伊恩·兰斯·泰勒的博文“链接器第一部分”开启了一个探索链接器复杂性的系列，旨在为程序员揭秘链接过程。他首先进行个人介绍，回忆了自己编写链接器的经历，强调了一贯的目标是提高速度。他于1988年编写了他的第一个链接器，1993/94年编写了第二个，目前正在开发第三个，名为gold。\n\n泰勒随后进行了技术介绍，解释说链接器将目标文件转换为可执行文件和共享库。他概述了典型的软件开发过程，从用C++等语言编写代码到编译成汇编代码，再到目标文件。他指出，由于子例程库的出现，链接器演变为将单独汇编的目标文件合并为单个可执行文件。共享库被提及为链接器职责的后来补充。\n\n该帖子强调了链接器作为软件开发中至关重要但通常不引人注目的步骤的角色，主要侧重于速度。评论部分显示了对该系列未来帖子的期待，特别是关于模板实例化、链接时优化以及链接器不断发展的性质。泰勒暗示将在以后讨论这些主题。此外，还有关于现有链接器文献的讨论，其中提到了Sun的《链接器和库指南》以及John Levine的书，以及关于gold链接器未来的更新。"
  },
  {
    "id": "45807502",
    "title": "Show HN: MyTimers.app offline-first PWA with no build step and zero dependencies",
    "url": "https://mytimers.app/",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "Show HN: MyTimers.app：离线优先PWA，零构建步骤，零依赖",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "45797242",
    "title": "Tiny electric motor can produce more than 1,000 horsepower",
    "url": "https://supercarblondie.com/electric-motor-yasa-more-powerful-tesla-mercedes/",
    "summary": "YASA, a UK-based company owned by Mercedes-Benz, has developed a groundbreaking tiny electric motor that surpasses existing technology in power and performance density. Weighing just 28 pounds, this axial flux motor delivers 750 kilowatts (1,005 horsepower), exceeding the output of four Tesla motors combined and outperforming YASA's previous record holder by 40%.\n\nThe motor's continuous power output ranges from 350 to 400 kilowatts (469–536 horsepower), showcasing its ability to sustain high performance. According to YASA, the design uses readily available materials, suggesting potential for scalable production.\n\nThis advancement is significant for the EV industry because a lighter motor contributes to a lighter vehicle, resulting in improved efficiency, acceleration, and range. YASA already supplies motors for high-end vehicles like the Mercedes-AMG GT XX concept and the Ferrari 296 GTB. While initially destined for luxury vehicles, the article suggests that with scaled production and reduced costs, this technology could eventually find its way into more affordable EVs, ultimately enhancing their performance and efficiency.\n",
    "chinese_title": "Tiny electric motor can produce more than 1,000 horsepower",
    "chinese_summary": "YASA, a UK-based company owned by Mercedes-Benz, has developed a groundbreaking tiny electric motor that surpasses existing technology in power and performance density. Weighing just 28 pounds, this axial flux motor delivers 750 kilowatts (1,005 horsepower), exceeding the output of four Tesla motors combined and outperforming YASA's previous record holder by 40%.\n\nThe motor's continuous power output ranges from 350 to 400 kilowatts (469–536 horsepower), showcasing its ability to sustain high performance. According to YASA, the design uses readily available materials, suggesting potential for scalable production.\n\nThis advancement is significant for the EV industry because a lighter motor contributes to a lighter vehicle, resulting in improved efficiency, acceleration, and range. YASA already supplies motors for high-end vehicles like the Mercedes-AMG GT XX concept and the Ferrari 296 GTB. While initially destined for luxury vehicles, the article suggests that with scaled production and reduced costs, this technology could eventually find its way into more affordable EVs, ultimately enhancing their performance and efficiency.\n"
  },
  {
    "id": "45746063",
    "title": "KaTeX – The fastest math typesetting library for the web",
    "url": "https://katex.org/",
    "summary": "KaTeX is a fast, lightweight, and dependency-free JavaScript library for typesetting mathematical notation on the web. It prioritizes speed, rendering math synchronously without reflowing the page. Its layout is based on TeX, ensuring print-quality rendering that matches the gold standard in mathematical typesetting.\n\nKey features and benefits highlighted include:\n\n*   **Speed:** KaTeX renders quickly, even on pages with numerous equations.\n*   **Print Quality:** Adheres to TeX standards for accurate and professional-looking typesetting.\n*   **Self-Contained:** Operates without external dependencies, simplifying integration into web projects.\n*   **Server-Side Rendering:** Offers consistent output across browsers and environments, enabling pre-rendering with Node.js.\n\nThe article provides links to installation instructions, documentation, and the GitHub repository. It also features a live demo where users can type a LaTeX expression and see how it's rendered by KaTeX.\n\nFurthermore, the document lists available KaTeX options, such as `displayMode`, `throwOnError`, and `macros`, which allow for customization of the rendering process. It also mentions editor options.\n\nKaTeX is presented as a superior alternative to other math typesetting libraries like MathJax, particularly in terms of speed. The library was created by Emily Eisenberg and Sophie Alpert, is MIT licensed, and leverages the contributions of many individuals.\n",
    "chinese_title": "KaTeX – 网页上最快的数学公式排版库",
    "chinese_summary": "KaTeX 是一个快速、轻量级且无依赖的 JavaScript 库，用于在网页上排版数学符号。它优先考虑速度，同步渲染数学公式，无需重排页面。其布局基于 TeX，确保打印质量的渲染效果，与数学排版的黄金标准相匹配。\n\n主要特性和优势包括：\n\n*   **速度：** KaTeX 渲染速度快，即使在包含大量公式的页面上也是如此。\n*   **打印质量：** 遵循 TeX 标准，实现准确且专业的排版效果。\n*   **自包含：** 无需外部依赖，简化了与 Web 项目的集成。\n*   **服务器端渲染：** 在各种浏览器和环境中提供一致的输出，支持使用 Node.js 进行预渲染。\n\n本文提供了安装说明、文档和 GitHub 存储库的链接。 它还提供了一个实时演示，用户可以在其中键入 LaTeX 表达式并查看 KaTeX 如何渲染它。\n\n此外，该文档还列出了可用的 KaTeX 选项，例如 `displayMode`、`throwOnError` 和 `macros`，这些选项允许自定义渲染过程。它还提到了编辑器选项。\n\nKaTeX 被认为是一种优于其他数学排版库（如 MathJax）的替代方案，尤其是在速度方面。该库由 Emily Eisenberg 和 Sophie Alpert 创建，采用 MIT 许可，并利用了许多个人的贡献。"
  },
  {
    "id": "45702993",
    "title": "Visual Features Across Modalities: SVG and ASCII Art Cross-Modal Understanding",
    "url": "https://transformer-circuits.pub/2025/october-update/index.html#svg-cross-modal",
    "summary": "This article from Anthropic's interpretability team explores how Large Language Models (LLMs) understand visual features in text-based modalities like SVG and ASCII art. The researchers discovered that LLMs develop \"cross-modal features\" that recognize semantic concepts like \"eyes,\" \"mouth,\" \"dogs,\" and \"cats\" across different textual representations (ASCII, SVG, and even prose descriptions in various languages).\n\nThese features are context-dependent; for instance, an SVG circle is only recognized as an eye when positioned within a larger structure recognized as a face. The features are also resilient to surface-level changes like color and radius. The study found that these cross-modal features exist in models ranging from Haiku 3.5 to Sonnet 4.5, and were identified in sparse autoencoders.\n\nThe researchers also investigated if these features could be used to *generate* visual depictions. They found that by steering the model with specific features, they could modify text-based art in semantically meaningful ways, like turning smiles into frowns or adding wrinkles to faces. Motor neuron features, identified by their relationship to tokens predicting specific concepts, proved more effective for steering than purely perceptual neurons.\n\nThe article concludes by raising further questions, including whether models can capture higher-level semantics like aesthetics, identifying properties of features best suited for steering, combining visual output with other interpretability tools, and understanding the computational mechanisms behind feature activation.\n\nA second, unrelated, part of the article describes the \"Data Point Initialization\" (DPI) method for training dictionary models, which involves initializing weight matrices with a noisy version of real data points to improve model quality.\n",
    "chinese_title": "跨模态视觉特征：SVG与ASCII艺术的跨模态理解",
    "chinese_summary": "Anthropic 可解释性团队的这篇文章探讨了大型语言模型 (LLM) 如何理解基于文本模态（如 SVG 和 ASCII 艺术）中的视觉特征。研究人员发现，LLM 发展出“跨模态特征”，可以识别不同文本表示形式（ASCII、SVG 甚至各种语言的散文描述）中的语义概念，例如“眼睛”、“嘴巴”、“狗”和“猫”。\n\n这些特征具有上下文依赖性；例如，只有当 SVG 圆圈位于被识别为面部的更大结构中时，才会被识别为眼睛。这些特征还能抵抗颜色和半径等表面层次的变化。研究发现，这些跨模态特征存在于从 Haiku 3.5 到 Sonnet 4.5 的模型中，并在稀疏自编码器中被识别出来。\n\n研究人员还研究了这些特征是否可以用于*生成*视觉描绘。他们发现，通过使用特定特征来引导模型，他们可以以语义上有意义的方式修改基于文本的艺术，例如将微笑变成皱眉或在脸上添加皱纹。与预测特定概念的标记相关的运动神经元特征，被证明比纯粹的感知神经元更有效地用于引导。\n\n文章最后提出了更多问题，包括模型是否可以捕捉更高层次的语义（如美学），识别最适合引导的特征属性，将视觉输出与其他可解释性工具结合，以及理解特征激活背后的计算机制。\n\n文章的第二个不相关的部分描述了用于训练字典模型的“数据点初始化”(DPI) 方法，该方法涉及用真实数据点的噪声版本初始化权重矩阵，以提高模型质量。"
  },
  {
    "id": "45802290",
    "title": "Agent-o-rama: build, trace, evaluate, and monitor LLM agents in Java or Clojure",
    "url": "https://blog.redplanetlabs.com/2025/11/03/introducing-agent-o-rama-build-trace-evaluate-and-monitor-stateful-llm-agents-in-java-or-clojure/",
    "summary": "Agent-o-rama is a new open-source library for building scalable, stateful LLM agents on the JVM (Java Virtual Machine). It provides both Java and Clojure APIs with feature parity, aiming to bridge the gap in AI tooling, which is currently heavily Python-focused. The library mirrors ideas from LangGraph and LangSmith, such as structured agent graphs, tracing, datasets, experiments, and evaluation, but is native to Java and Clojure.\n\nThe core benefit of Agent-o-rama is facilitating rigorous testing and monitoring of LLM-based applications to improve helpfulness, performance, and minimize hallucinations. Agents are defined as graphs of Java or Clojure functions executing in parallel. The library captures detailed traces and offers a web UI for experimentation, evaluation, and telemetry. It supports streaming and offers scalability through integration with Rama, a cluster platform.\n\nUnlike hosted solutions, Agent-o-rama keeps all data and traces within your infrastructure and integrates with various tools like databases and APIs. The article provides an example research agent, demonstrating how to run it locally and deploy it to a Rama cluster. Key features include automatic tracing of model calls and the ability to add custom tracing information. Agent-o-rama manages storage and deployment, and offers a UI to interact with the agents and view traces. Rama is free to use for small clusters and scales commercially.\n",
    "chinese_title": "Agent-o-rama：在Java或Clojure中构建、追踪、评估和监控LLM代理",
    "chinese_summary": "Agent-o-rama 是一个新的开源库，用于在 JVM (Java 虚拟机) 上构建可扩展、有状态的 LLM 代理。它提供具有特性对等的 Java 和 Clojure API，旨在弥合目前主要集中在 Python 的 AI 工具方面的差距。该库借鉴了 LangGraph 和 LangSmith 的思想，例如结构化代理图、追踪、数据集、实验和评估，但它是 Java 和 Clojure 原生的。\n\nAgent-o-rama 的核心优势在于促进对基于 LLM 的应用程序进行严格的测试和监控，以提高有用性、性能并最大限度地减少幻觉。代理被定义为并行执行的 Java 或 Clojure 函数图。该库捕获详细的追踪信息，并提供一个 Web UI 用于实验、评估和遥测。它支持流式传输，并通过与集群平台 Rama 的集成提供可扩展性。\n\n与托管解决方案不同，Agent-o-rama 将所有数据和追踪信息保留在您的基础设施中，并与各种工具（如数据库和 API）集成。本文提供了一个研究代理的示例，演示了如何在本地运行它并将其部署到 Rama 集群。主要功能包括自动追踪模型调用以及添加自定义追踪信息的能力。Agent-o-rama 管理存储和部署，并提供一个 UI 来与代理交互和查看追踪信息。Rama 对于小型集群可以免费使用，并可进行商业扩展。"
  },
  {
    "id": "45800308",
    "title": "Robert Hooke's \"Cyberpunk” Letter to Gottfried Leibniz",
    "url": "https://mynamelowercase.com/blog/robert-hookes-cyberpunk-letter-to-gottfried-leibniz/",
    "summary": "This article argues that Robert Hooke, often known for his work with springs and his conflicts with Isaac Newton, should be considered a \"patron saint of cyberpunk\" due to his early embrace of ideas reminiscent of the genre. The author focuses on a letter Hooke wrote to Gottfried Leibniz in 1681, expressing enthusiasm for Leibniz's \"Characteristica Universalis,\" a universal language intended to mechanize scientific reasoning.\n\nThe author draws parallels between Leibniz's project and modern computer programming languages, noting Norbert Wiener's description of Leibniz as the \"patron saint of cybernetics,\" the field from which \"cyberpunk\" derives. However, the author contends that Hooke's letter goes beyond cybernetics, displaying a cyberpunk sensibility by envisioning how this early programming language could empower individuals to freely express, explore, and test ideas, circumventing censorship and interference from unjust authorities.\n\nThe author points to Hooke's politically charged background, his hands-on approach to science, and his conflicts with authority as evidence of his counter-cultural mindset. The article suggests that Hooke anticipated the empowering potential of cybernetic systems for individual freedom, a key theme in cyberpunk. The author also mentions the discovery of the letter in the Royal Society's archives and the difficulty in transcribing Hooke's handwriting, with a partially transcribed excerpt provided. The article gained attention on Hacker News, leading to a user providing a full transcription.\n",
    "chinese_title": "罗伯特·胡克致戈特弗里德·莱布尼茨的“赛博朋克”信",
    "chinese_summary": "本文认为，罗伯特·胡克，通常因其在弹簧领域的研究以及与艾萨克·牛顿的冲突而闻名，应被视为“赛博朋克的守护神”，因为他早期就拥抱了与该类型相似的理念。作者着重分析了胡克在 1681 年写给戈特弗里德·莱布尼茨的一封信，信中表达了对莱布尼茨“通用语言”的热情，这种通用语言旨在将科学推理机械化。\n\n作者将莱布尼茨的项目与现代计算机编程语言进行了比较，并指出诺伯特·维纳将莱布尼茨描述为“控制论的守护神”，而“赛博朋克”正是源于控制论。然而，作者认为胡克的信不仅仅是控制论，它还展现了一种赛博朋克的敏感性，设想了这种早期编程语言如何赋予个人自由表达、探索和测试思想的能力，从而规避审查和来自不公正权威的干预。\n\n作者指出胡克具有政治色彩的背景、亲身实践的科学方法以及与权威的冲突，作为他反主流文化心态的证据。文章认为，胡克预见到了控制论系统赋予个人自由的潜力，这是赛博朋克的一个关键主题。作者还提到了在皇家学会档案馆发现这封信的过程，以及转录胡克手稿的困难，并提供了一个部分转录的摘录。这篇文章在 Hacker News 上引起了关注，一位用户提供了完整的转录。"
  },
  {
    "id": "45695712",
    "title": "Pixi: Reproducible Package Management for Robotics",
    "url": "https://prefix.dev/blog/reproducible-package-management-for-robotics",
    "summary": "This article introduces Pixi, a modern, cross-platform package manager designed to simplify and improve the reproducibility of ROS (Robot Operating System) development environments. It addresses the challenges of Ubuntu lock-in, distribution coupling, global installs, multi-distro maintenance, and the overhead of Docker that often plague ROS development.\n\nPixi, built on top of the Conda ecosystem, allows developers to install ROS on Linux, macOS, and Windows without Docker or Ubuntu. It creates isolated environments with precise dependencies, enabling side-by-side management of multiple ROS distributions on a single machine. Environments are easily shared via a `pixi.toml` file, ensuring consistent setups for teams and CI/CD pipelines.\n\nThe article highlights Pixi's benefits through comparisons with APT-based systems, demonstrating superior cross-platform support, reproducibility, multiple distro handling, and easier CI/CD integration. It provides a quick start guide, showcasing how to initialize a ROS environment and add packages. It also covers advanced use cases, like managing multiple distros in one workspace, incorporating CUDA, and leveraging `package.xml` files for dependency management.\n\nPixi facilitates testing against multiple ROS versions and platforms in CI, even offering seamless integration with Docker when needed. The author encourages community involvement in expanding RoboStack packages and contributing to conda-forge, emphasizing the goal of making Pixi a standard tool in the ROS community. The overall aim is to enable robotics developers to concentrate on robot development instead of struggling with package management issues.\n",
    "chinese_title": "Pixi：机器人技术的可复现包管理",
    "chinese_summary": "本文介绍Pixi，一种现代、跨平台的软件包管理器，旨在简化和提高ROS（机器人操作系统）开发环境的可复现性。它解决了Ubuntu锁定、发行版耦合、全局安装、多发行版维护以及Docker开销等长期困扰ROS开发的问题。\n\nPixi构建于Conda生态系统之上，允许开发者在Linux、macOS和Windows上安装ROS，无需Docker或Ubuntu。它创建具有精确依赖项的隔离环境，从而可以在单台机器上并行管理多个ROS发行版。环境可以通过`pixi.toml`文件轻松共享，确保团队和CI/CD管道的一致设置。\n\n本文通过与基于APT的系统的比较，突出了Pixi的优势，展示了其卓越的跨平台支持、可复现性、多发行版处理以及更简便的CI/CD集成。它提供了一个快速入门指南，展示了如何初始化ROS环境和添加软件包。它还涵盖了高级用例，例如在同一工作空间中管理多个发行版、集成CUDA以及利用`package.xml`文件进行依赖项管理。\n\nPixi有助于在CI中针对多个ROS版本和平台进行测试，甚至可以在需要时与Docker无缝集成。作者鼓励社区参与扩展RoboStack软件包并为conda-forge做出贡献，强调使Pixi成为ROS社区的标准工具的目标。总体目标是使机器人开发者能够专注于机器人开发，而不是与软件包管理问题作斗争。"
  },
  {
    "id": "45795511",
    "title": "Oxy is Cloudflare's Rust-based next generation proxy framework (2023)",
    "url": "https://blog.cloudflare.com/introducing-oxy/",
    "summary": "Oxy is Cloudflare's next-generation, Rust-based proxy framework, designed for high-load, customizable traffic management. It's used in projects like Zero Trust Gateway and iCloud Private Relay, offering a feature-rich proxy server tightly integrated with Cloudflare's infrastructure. Oxy allows programmatic control over aspects like protocol decapsulation, traffic analysis, and routing, enabling engineers to tweak every component to meet specific application requirements.\n\nKey features include versatile on-ramps (HTTP, TCP, UDP, IP) and off-ramps (HTTP, UDP, TCP, IP) with internal DNS resolution and geographical egress options. Oxy supports multi-layer traffic processing, from L3 to L7, allowing applications to force decapsulation and analyze traffic at different levels. It handles stateful tunneling of TCP, UDP, QUIC, and IP, and provides full control over HTTP requests and responses, including advanced tunneling methods like CONNECT-UDP and CONNECT-IP.\n\nSecurity is paramount, with cryptography and TLS based on BoringSSL, offering both FIPS-compliant and latest versions, with the option to switch between them dynamically. Oxy also provides comprehensive monitoring and analysis capabilities, including panic reporting, Prometheus metrics, Kibana logging, and audit logs.\n\nExtensibility is achieved through YAML configuration files and Rust code hooks, allowing developers to customize nearly every aspect of traffic processing. Rust's safety and performance, combined with the use of open-source dependencies like hyper and tokio, make Oxy a robust and efficient platform for building advanced network applications.\n",
    "chinese_title": "Oxy是Cloudflare基于Rust的下一代代理框架（2023）",
    "chinese_summary": "Oxy：Cloudflare的下一代Rust代理框架，专为高负载、可定制的流量管理而设计。它被用于诸如Zero Trust Gateway和iCloud Private Relay等项目中，提供了一个功能丰富的代理服务器，与Cloudflare的基础设施紧密集成。Oxy允许对协议解封装、流量分析和路由等方面进行编程控制，使工程师能够调整每个组件以满足特定的应用需求。\n\n其主要特性包括多功能的入口（HTTP、TCP、UDP、IP）和出口（HTTP、UDP、TCP、IP），具有内部DNS解析和地理出口选项。Oxy支持从L3到L7的多层流量处理，允许应用程序强制解封装并在不同级别分析流量。它处理TCP、UDP、QUIC和IP的状态隧道，并提供对HTTP请求和响应的完全控制，包括CONNECT-UDP和CONNECT-IP等高级隧道方法。\n\n安全性至关重要，其密码学和TLS基于BoringSSL，提供符合FIPS标准和最新版本，并可选择动态切换。Oxy还提供全面的监控和分析功能，包括panic报告、Prometheus指标、Kibana日志和审计日志。\n\n通过YAML配置文件和Rust代码钩子实现可扩展性，允许开发者自定义几乎所有流量处理方面。Rust的安全性与性能，结合使用hyper和tokio等开源依赖项，使Oxy成为构建高级网络应用的强大而高效的平台。"
  },
  {
    "id": "45811624",
    "title": "Google Cloud suspended customer's account 3 times, for 3 different reasons",
    "url": "https://www.theregister.com/2025/11/04/google_cloud_suspended_customers_account/",
    "summary": "Andrew Ayer, founder of SSLMate, a service that manages SSL certificates, experienced three Google Cloud account suspensions for different reasons, leading him to question the platform's reliability for production workloads.\n\nSSLMate uses Google Cloud primarily for testing, experimentation, and integrating with customer Google Cloud accounts by creating service accounts to access Cloud DNS and Cloud Domains on behalf of its customers. This approach, based on Google's own documentation, involves impersonating service accounts.\n\nThe first suspension occurred in May 2024, citing policy violations, but Google didn't provide clear information about the cause or how to prevent future occurrences. A second suspension followed shortly after for a different, unspecified reason. Another suspension happened recently, this time due to a terms of service violation, eventually resolved after Ayer posted on social media. One customer integration continued to work despite the suspensions.\n\nAyer is frustrated with the lack of transparency and the impact on his business. He suggests a potential workaround using OpenID Connect (OIDC) but finds the implementation unnecessarily complicated. He concludes that Google's system is unreliable and struggles with moving away from long-lived credentials. Ayer now plans to ditch Google Cloud for production use cases.\n",
    "chinese_title": "Google Cloud因三个不同原因三次暂停客户账户。",
    "chinese_summary": "SSLMate创始人Andrew Ayer因不同原因经历了三次Google Cloud账号停用，导致他对该平台生产环境工作负载的可靠性产生质疑。\n\nSSLMate主要使用Google Cloud进行测试、实验，以及通过创建服务账号代表客户访问Cloud DNS和Cloud Domains来集成客户的Google Cloud账号。这种方法基于Google自己的文档，涉及模拟服务账号。\n\n第一次停用发生在2024年5月，理由是违反政策，但Google没有提供关于原因或如何防止未来发生的明确信息。不久之后，又因另一个未指明的原因发生了第二次停用。最近又发生了一次停用，这次是因为违反服务条款，最终在Ayer在社交媒体上发帖后得到解决。尽管发生了停用，但一个客户集成仍然可以工作。\n\nAyer对缺乏透明度和对业务的影响感到沮丧。他提出了一个使用OpenID Connect（OIDC）的潜在解决方案，但发现实现过程过于复杂。他得出结论，Google的系统不可靠，并且难以摆脱长期有效的凭据。Ayer现在计划放弃Google Cloud用于生产用例。"
  },
  {
    "id": "45680602",
    "title": "Harder, Better, Faster, Stronger Version of Uber H3 in Rust",
    "url": "https://grim7reaper.github.io/blog/2023/01/09/the-hydronium-project/",
    "summary": "This article introduces h3o, a complete rewrite of Uber's H3 geospatial indexing library in Rust, aiming for easier integration, a safer API, performance parity or improvements over the original, and full coverage of the H3 4.0 API.\n\nExtensive testing, including differential, integration, unit, and fuzz testing, was employed to ensure correctness and prevent regressions. A benchmark suite comparing h3o against H3 across 911 test cases reveals significant performance gains for h3o in many areas. While H3 remains faster in a few specific cases (particularly at coarse resolutions and certain cellToLatLng calculations), h3o significantly outperforms H3 in numerous scenarios, especially those involving computationally intensive tasks like `gridDiskDistancesSafe`, `h3SetToLinkedGeo`, `isPentagon`, `isValidCell`, `stringToH3`, and `polygonToCells`. These improvements are attributed to algorithmic optimizations, such as constant-time operations via bit-twiddling, optimized hash table usage, iterative implementations replacing recursion, and special geometry types enabling pre-paid computation costs.\n\nThe article also highlights \"h3oh3o,\" a C API binding for h3o, that enables easier adoption of the library by projects already using the original H3 library. Benchmarks show that h3oh3o maintains the performance advantages of h3o over H3.  The article concludes by stating the authors goal of isofunctionality to H3 but that h3oh3o might detect more errors, return different error codes, or simply return a sensible default value instead of an error.\n",
    "chinese_title": "更硬、更好、更快、更强 - Rust 版 Uber H3",
    "chinese_summary": "本文介绍了 h3o，它是 Uber 的 H3 地理空间索引库的完全重写版本，使用 Rust 编写，旨在实现更轻松的集成、更安全的 API、与原始版本相当或更高的性能，以及对 H3 4.0 API 的全面覆盖。\n\n为了确保正确性并防止回归，进行了广泛的测试，包括差异测试、集成测试、单元测试和模糊测试。一个包含 911 个测试用例的基准测试套件将 h3o 与 H3 进行了比较，结果表明 h3o 在许多领域都获得了显著的性能提升。虽然 H3 在少数特定情况下仍然更快（尤其是在粗略分辨率和某些 cellToLatLng 计算中），但 h3o 在许多场景中明显优于 H3，尤其是在涉及计算密集型任务的场景中，例如 `gridDiskDistancesSafe`、`h3SetToLinkedGeo`、`isPentagon`、`isValidCell`、`stringToH3` 和 `polygonToCells`。这些改进归功于算法优化，例如通过位操作实现的常数时间运算、优化的哈希表使用、用迭代实现代替递归，以及支持预付费计算成本的特殊几何类型。\n\n文章还重点介绍了 “h3oh3o”，它是 h3o 的 C API 绑定，使已经使用原始 H3 库的项目更容易采用该库。基准测试表明，h3oh3o 保持了 h3o 相对于 H3 的性能优势。文章最后指出，作者的目标是与 H3 实现同等功能，但 h3oh3o 可能会检测到更多错误，返回不同的错误代码，或者干脆返回一个合理的默认值而不是错误。"
  },
  {
    "id": "45805049",
    "title": "Amazon imposing fees on using their marketplace API",
    "url": "https://developer.amazonservices.com/spp-announcement",
    "summary": "Amazon is now requiring users of their Selling Partner API (SP-API) to provide payment and tax information to maintain access. This is being implemented through the Solution Provider Portal, where users must submit their preferred charge method, billing address, and any applicable tax information. Completing this step is mandatory to activate an SP-API subscription and avoid any disruption in access to the API. In essence, users who rely on SP-API for their marketplace operations will now face fees and need to configure their billing details to continue using the service without interruption.\n",
    "chinese_title": "亚马逊对使用其市场API收取费用",
    "chinese_summary": "亚马逊现要求其销售伙伴API (SP-API) 用户提供付款和税务信息以维持访问权限。此举通过解决方案提供商门户实施，用户必须提交其首选收费方式、账单地址和任何适用的税务信息。完成此步骤是激活SP-API订阅并避免API访问中断的强制性要求。本质上，依赖SP-API进行市场运营的用户现在将面临费用，并且需要配置其账单详细信息才能继续不间断地使用该服务。"
  },
  {
    "id": "45800955",
    "title": "Why we migrated from Python to Node.js",
    "url": "https://blog.yakkomajuri.com/blog/python-to-node",
    "summary": "Skald, a startup building a RAG API platform, rewrote its backend from Python (Django) to Node.js (Express + MikroORM) just one week after launch, primarily due to the complexities and limitations they encountered with Python's asynchronous capabilities.\n\nThe author, a Django enthusiast, found Python's async implementation difficult, unintuitive, and lacking native support for crucial features like async file I/O. Django's ORM also lacks full async support, requiring workarounds. This led to messy code and concerns about scalability and maintainability.\n\nThey considered FastAPI, a Python framework with better async support, but ultimately chose Node.js to unify their codebase, as their background worker was already written in Node.\n\nThe migration resulted in a ~3x throughput increase out-of-the-box and opportunities for more concurrent processing. While they miss Django's features, particularly its ORM, they are happy with MikroORM. The unified Node.js codebase allowed them to eliminate duplicate logic and improve testing.\n\nThe migration took three days, with limited use of AI code generation. The author expresses satisfaction with the decision and invites feedback and contributions to their open-source project.\n",
    "chinese_title": "我们为什么从Python迁移到Node.js",
    "chinese_summary": "Skald在推出RAG API平台一周后，将其后端从Python (Django) 重写为 Node.js (Express + MikroORM)，主要原因是他们遇到了Python异步功能的复杂性和局限性。\n\n作者是一位Django爱好者，他发现Python的异步实现困难、不直观，并且缺乏对异步文件I/O等关键功能的原生支持。 Django的ORM也缺乏完整的异步支持，需要变通方法。 这导致代码混乱，并引发了对可扩展性和可维护性的担忧。\n\n他们考虑过FastAPI，一个具有更好异步支持的Python框架，但最终选择了Node.js来统一他们的代码库，因为他们的后台工作程序已经用Node编写。\n\n迁移带来了约3倍的开箱即用吞吐量提升，并为更多的并发处理提供了机会。 虽然他们怀念Django的功能，特别是它的ORM，但他们对MikroORM感到满意。 统一的Node.js代码库使他们能够消除重复的逻辑并改进测试。\n\n迁移花了三天时间，几乎没有使用AI代码生成。 作者对这个决定表示满意，并邀请大家对他们的开源项目提出反馈和贡献。"
  },
  {
    "id": "45801416",
    "title": "Why engineers can't be rational about programming languages",
    "url": "https://spf13.com/p/the-hidden-conversation/",
    "summary": "The article argues that programming language choices in companies are often driven by identity, emotion, and ego rather than rational technical analysis, leading to significant hidden costs and hindering business success. The author shares personal experiences, including a disastrous Perl migration at a startup and witnessing a flawed Rust adoption decision, to illustrate this point.\n\nThe core argument is that language discussions involve two conversations: a visible technical debate and an invisible conversation centered around programmers' identities and personal preferences. Neuroscience research supports this, demonstrating that challenging identity-based beliefs triggers a threat response in the brain, making objective evaluation difficult.\n\nThe author criticizes the industry's focus on visible technical debates, arguing that engineers often unconsciously defend their preferred languages and that hiring someone with a specific language expertise predetermines the choice. The article asserts that these identity-driven decisions inflate development costs (40-60% of total costs) by increasing technical debt and slowing down velocity.\n\nThe author proposes a shift in perspective, urging companies to treat language choices as economic decisions rather than technical or emotional ones. They advocate for a new framework that quantifies the true cost of a language, encompassing factors like salaries, velocity, technical debt, hiring difficulty, and operational complexity. The upcoming post will detail this \"9 Factors of a Language's True Cost\" framework.\n",
    "chinese_title": "为什么工程师不能理性看待编程语言",
    "chinese_summary": "公司编程语言的选择常常是出于身份认同、情感和自我，而非理性的技术分析，这导致了巨大的隐性成本并阻碍了业务成功。作者通过个人经历，包括一家初创公司灾难性的Perl迁移和见证一个有缺陷的Rust采纳决策，来说明这一点。\n\n核心论点是，语言讨论涉及两个层面：一个可见的技术辩论和一个围绕程序员身份认同和个人偏好的不可见对话。神经科学研究支持这一点，证明挑战基于身份认同的信念会在大脑中引发威胁反应，从而使客观评估变得困难。\n\n作者批评了行业对可见技术辩论的关注，认为工程师们经常无意识地捍卫自己偏爱的语言，并且雇用具有特定语言专业知识的人员会预先决定语言的选择。文章断言，这些由身份驱动的决策通过增加技术债务和降低开发速度，会使开发成本膨胀（占总成本的40-60%）。\n\n作者提出了一种视角的转变，敦促公司将语言选择视为经济决策，而不是技术或情感决策。他们提倡一种新的框架，该框架可以量化语言的真实成本，包括工资、开发速度、技术债务、招聘难度和运营复杂性等因素。下一篇文章将详细介绍这个“语言真实成本的9个因素”框架。"
  },
  {
    "id": "45799287",
    "title": "Win11Debloat – declutter and improve your Windows experience",
    "url": "https://github.com/Raphire/Win11Debloat",
    "summary": "生成摘要时出错",
    "chinese_title": "Win11Debloat – declutter and improve your Windows experience",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45746289",
    "title": "Measuring characteristics of TCP connections at Internet scale",
    "url": "https://blog.cloudflare.com/measuring-network-connections-at-scale/",
    "summary": "生成摘要时出错",
    "chinese_title": "Measuring characteristics of TCP connections at Internet scale",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45701810",
    "title": "The Continual Learning Problem",
    "url": "https://jessylin.com/2025/10/20/continual-learning/",
    "summary": "生成摘要时出错",
    "chinese_title": "The Continual Learning Problem",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45798871",
    "title": "Show HN: a Rust ray tracer that runs on any GPU – even in the browser",
    "url": "https://github.com/tchauffi/rust-rasterizer",
    "summary": "生成摘要时出错",
    "chinese_title": "Show HN: a Rust ray tracer that runs on any GPU – even in the browser",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45803358",
    "title": "</> Htmx – The Fetch()ening",
    "url": "https://htmx.org/essays/the-fetchening/",
    "summary": "生成摘要时出错",
    "chinese_title": "</> Htmx – The Fetch()ening",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45803306",
    "title": "FreakWAN: A floor-routing WAN implementing a chat over bare-LoRa (no LoRaWAN)",
    "url": "https://github.com/antirez/freakwan",
    "summary": "生成摘要时出错",
    "chinese_title": "FreakWAN: A floor-routing WAN implementing a chat over bare-LoRa (no LoRaWAN)",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45705583",
    "title": "Draw high dimensional tensors as a matrix of matrices",
    "url": "https://blog.ezyang.com/2025/10/draw-high-dimensional-tensors-as-a-matrix-of-matrices/",
    "summary": "生成摘要时出错",
    "chinese_title": "Draw high dimensional tensors as a matrix of matrices",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45773421",
    "title": "The Arduino Uno Q is a weird hybrid SBC",
    "url": "https://www.jeffgeerling.com/blog/2025/arduino-uno-q-weird-hybrid-sbc",
    "summary": "生成摘要时出错",
    "chinese_title": "The Arduino Uno Q is a weird hybrid SBC",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45807329",
    "title": "The Morals of Chess (1786)",
    "url": "https://americanliterature.com/author/benjamin-franklin/essay/the-morals-of-chess",
    "summary": "生成摘要时出错",
    "chinese_title": "The Morals of Chess (1786)",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45807542",
    "title": "Why AC is cheap, but AC repair is a luxury",
    "url": "https://a16z.substack.com/p/why-ac-is-cheap-but-ac-repair-is",
    "summary": "生成摘要时出错",
    "chinese_title": "Why AC is cheap, but AC repair is a luxury",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45737872",
    "title": "Show HN: Tamagotchi P1 for FPGAs",
    "url": "https://github.com/agg23/fpga-tamagotchi",
    "summary": "生成摘要时出错",
    "chinese_title": "Show HN: Tamagotchi P1 for FPGAs",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45728017",
    "title": "Handwriting Programs in J (2017)",
    "url": "https://www.hillelwayne.com/handwriting-j/",
    "summary": "生成摘要时出错",
    "chinese_title": "Handwriting Programs in J (2017)",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45794245",
    "title": "New prompt injection papers: Agents rule of two and the attacker moves second",
    "url": "https://simonwillison.net/2025/Nov/2/new-prompt-injection-papers/",
    "summary": "生成摘要时出错",
    "chinese_title": "New prompt injection papers: Agents rule of two and the attacker moves second",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45799211",
    "title": "OpenAI signs $38B cloud computing deal with Amazon",
    "url": "https://www.nytimes.com/2025/11/03/technology/openai-amazon-cloud-computing.html",
    "summary": "生成摘要时出错",
    "chinese_title": "OpenAI signs $38B cloud computing deal with Amazon",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45804839",
    "title": "R interface to Apple's MLX library",
    "url": "https://hughjonesd.github.io/Rmlx/index.html",
    "summary": "生成摘要时出错",
    "chinese_title": "R interface to Apple's MLX library",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45798892",
    "title": "A collection of links that existed about Anguilla as of 2003",
    "url": "https://web.ai/",
    "summary": "生成摘要时出错",
    "chinese_title": "A collection of links that existed about Anguilla as of 2003",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45811235",
    "title": "Searles's Chinese Room: Case study in philosophy of mind and cognitive science",
    "url": "https://cse.buffalo.edu/~rapaport/Papers/Papers.by.Others/reingold-on-searle.html",
    "summary": "生成摘要时出错",
    "chinese_title": "Searles's Chinese Room: Case study in philosophy of mind and cognitive science",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45743105",
    "title": "When models manipulate manifolds: The geometry of a counting task",
    "url": "https://transformer-circuits.pub/2025/linebreaks/index.html",
    "summary": "生成摘要时出错",
    "chinese_title": "When models manipulate manifolds: The geometry of a counting task",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45743105",
    "title": "When models manipulate manifolds: The geometry of a counting task",
    "url": "https://transformer-circuits.pub/2025/linebreaks/index.html",
    "summary": "生成摘要时出错",
    "chinese_title": "When models manipulate manifolds: The geometry of a counting task",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45719636",
    "title": "How the Mayans were able to accurately predict solar eclipses for centuries",
    "url": "https://phys.org/news/2025-10-mayans-accurately-solar-eclipses-centuries.html",
    "summary": "生成摘要时出错",
    "chinese_title": "How the Mayans were able to accurately predict solar eclipses for centuries",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45801673",
    "title": "Israels top military lawyer arrested after she admitted leaking video of abuse",
    "url": "https://www.theguardian.com/world/2025/nov/03/israels-top-military-lawyer-arrested-after-she-admitted-leaking-video-of-soldiers-abuse",
    "summary": "生成摘要时出错",
    "chinese_title": "Israels top military lawyer arrested after she admitted leaking video of abuse",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45801096",
    "title": "No Socials November",
    "url": "https://bjhess.com/posts/no-socials-november",
    "summary": "生成摘要时出错",
    "chinese_title": "No Socials November",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45793466",
    "title": "Paris had a moving sidewalk in 1900, and a Thomas Edison film captured it (2020)",
    "url": "https://www.openculture.com/2020/03/paris-had-a-moving-sidewalk-in-1900.html",
    "summary": "生成摘要时出错",
    "chinese_title": "Paris had a moving sidewalk in 1900, and a Thomas Edison film captured it (2020)",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45798746",
    "title": "Offline Math: Converting LaTeX to SVG with MathJax",
    "url": "https://sigwait.org/~alex/blog/2025/10/07/3t8acq.html",
    "summary": "生成摘要时出错",
    "chinese_title": "Offline Math: Converting LaTeX to SVG with MathJax",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45798193",
    "title": "OSS Alternative to Open WebUI – ChatGPT-Like UI, API and CLI",
    "url": "https://github.com/ServiceStack/llms",
    "summary": "生成摘要时出错",
    "chinese_title": "OSS Alternative to Open WebUI – ChatGPT-Like UI, API and CLI",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45792166",
    "title": "Is Your Bluetooth Chip Leaking Secrets via RF Signals?",
    "url": "https://www.semanticscholar.org/paper/Is-Your-Bluetooth-Chip-Leaking-Secrets-via-RF-Ji-Dubrova/c1d3ceb47ea6f9cc4f29929e2f97d36862a260a2",
    "summary": "生成摘要时出错",
    "chinese_title": "Is Your Bluetooth Chip Leaking Secrets via RF Signals?",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45796351",
    "title": "ECL Runs Maxima in a Browser",
    "url": "https://mailman3.common-lisp.net/hyperkitty/list/ecl-devel@common-lisp.net/thread/T64S5EMVV6WHDPKWZ3AQHEPO3EQE2K5M/",
    "summary": "生成摘要时出错",
    "chinese_title": "ECL Runs Maxima in a Browser",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45810135",
    "title": "The Nonprofit Feeding the Internet to AI Companies",
    "url": "https://www.theatlantic.com/technology/2025/11/common-crawl-ai-training-data/684567/",
    "summary": "生成摘要时出错",
    "chinese_title": "The Nonprofit Feeding the Internet to AI Companies",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45800967",
    "title": "Python Steering Council unanimously accepts \"PEP 810, Explicit lazy imports\"",
    "url": "https://discuss.python.org/t/pep-810-explicit-lazy-imports/104131?page=23",
    "summary": "生成摘要时出错",
    "chinese_title": "Python Steering Council unanimously accepts \"PEP 810, Explicit lazy imports\"",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45789424",
    "title": "Using FreeBSD to make self-hosting fun again",
    "url": "https://jsteuernagel.de/posts/using-freebsd-to-make-self-hosting-fun-again/",
    "summary": "生成摘要时出错",
    "chinese_title": "Using FreeBSD to make self-hosting fun again",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45720919",
    "title": "S1130 – IBM 1130 Emulator in C#",
    "url": "https://github.com/semuhphor/S1130/tree/feature/web-frontend",
    "summary": "生成摘要时出错",
    "chinese_title": "S1130 – IBM 1130 Emulator in C#",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45795186",
    "title": "Syllabi – Open-source agentic AI with tools, RAG, and multi-channel deploy",
    "url": "https://www.syllabi-ai.com/",
    "summary": "生成摘要时出错",
    "chinese_title": "Syllabi – Open-source agentic AI with tools, RAG, and multi-channel deploy",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45790293",
    "title": "Writing FreeDOS Programs in C",
    "url": "https://www.freedos.org/books/cprogramming/",
    "summary": "生成摘要时出错",
    "chinese_title": "Writing FreeDOS Programs in C",
    "chinese_summary": "生成摘要时出错"
  }
]