[
  {
    "id": "44268197",
    "title": "Meta Invests $14.3B in Scale AI to Kick-Start Superintelligence Lab",
    "url": "https://www.nytimes.com/2025/06/12/technology/meta-scale-ai.html",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "Meta投资143亿美元于Scale AI，启动超智能实验室",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "44268782",
    "title": "OxCaml - a set of extensions to the OCaml programming language.",
    "url": "https://oxcaml.org/",
    "summary": "OxCaml is a set of extensions to the OCaml programming language developed by Jane Street, designed to improve performance-oriented programming while retaining OCaml's core principles. Its primary goals are to provide safe, convenient, and predictable control over performance-critical aspects of program behavior, only when needed, and within the OCaml ecosystem.\n\nThe extensions focus on:\n\n*   **Fearless Concurrency:** Type system additions to prevent data races.\n*   **Layouts:** Specifying data layout in memory and enabling native access to SIMD instructions.\n*   **Control over Allocation:** Tools to manage allocations, reducing GC pressure and improving cache efficiency.\n*   **Quality of Life:** Enhancements like polymorphic parameters, include functor, labeled tuples, and immutable arrays.\n\nOxCaml prioritizes safety, convenience, and predictability, aiming to maintain OCaml's type inference and clear performance characteristics. It's \"pay-as-you-go,\" meaning you only encounter added complexity when utilizing its optimization power. Crucially, valid OCaml programs are also valid OxCaml programs.\n\nOxCaml is open-source and welcomes experimental users for feedback, though it offers no stability or backwards compatibility guarantees for its extensions. It comes with modified versions of standard OCaml tools, including package management, editor integration, source code formatting, and documentation generation. Libraries and tools developed by Jane Street are available in both OCaml-compatible (extensions stripped) and OxCaml versions. Some libraries are exclusive to OxCaml due to the nature of the extensions used.\n",
    "chinese_title": "OxCaml - OCaml编程语言的一组扩展。",
    "chinese_summary": "OxCaml是由Jane Street开发的OCaml编程语言的一组扩展，旨在提高面向性能的编程能力，同时保留OCaml的核心原则。其主要目标是在OCaml生态系统中，仅在需要时，提供对程序行为中性能关键方面的安全、便捷和可预测的控制。\n\n这些扩展侧重于：\n\n*   **无畏并发：** 类型系统新增功能，以防止数据竞争。\n*   **布局：** 指定内存中的数据布局，并启用对SIMD指令的本地访问。\n*   **分配控制：** 管理分配的工具，减少GC压力并提高缓存效率。\n*   **生活质量：** 增强功能，如多态参数、include functor、带标签的元组和不可变数组。\n\nOxCaml优先考虑安全性、便捷性和可预测性，旨在保持OCaml的类型推断和清晰的性能特征。它采用“按需付费”模式，意味着只有在使用其优化能力时才会遇到增加的复杂性。至关重要的是，有效的OCaml程序也是有效的OxCaml程序。\n\nOxCaml是开源的，欢迎实验用户提供反馈，但对其扩展不提供稳定性或向后兼容性保证。它带有修改后的标准OCaml工具版本，包括包管理、编辑器集成、源代码格式化和文档生成。Jane Street开发的库和工具提供OCaml兼容版本（剥离扩展）和OxCaml版本。由于所用扩展的性质，某些库是OxCaml独有的。"
  },
  {
    "id": "44266828",
    "title": "If the moon were only 1 pixel: A tediously accurate solar system model (2014)",
    "url": "https://joshworth.com/dev/pixelspace/pixelspace_solarsystem.html",
    "summary": "Josh Worth's \"If the Moon Were Only 1 Pixel\" is an interactive online project that visualizes the vast distances within our solar system to scale. By representing the moon as a single pixel, the project highlights the immense emptiness of space. The journey begins with the Sun and progresses through each planet, emphasizing the considerable distances between them, measured in kilometers and other relatable units.\n\nThe piece explores the difficulty humans have in comprehending such vast scales, resorting to metaphors and comparisons to make the distances more relatable (e.g., travel time in spaceships, stacks of screens). It argues that traditional maps often fail to convey the true proportion of empty space, which is the most significant part of the solar system.\n\nThe article delves into the philosophical implications of this emptiness, suggesting that our brains are not naturally equipped to grasp such vastness. It discusses how this perceived \"nothingness\" can be unsettling, leading to sensory deprivation effects and highlighting the limitations of human perception.\n\nUltimately, the project concludes by pondering the significance of matter (planets, stars, and even humans) existing within this immense void. It suggests that the existence of these \"tiny dots\" might make the emptiness itself measurable and meaningful, and that our existence amidst so much nothing is, in itself, an amazing phenomenon, despite being potentially insignificant on a cosmic scale. It encourages reflection on the contrasting feelings of insignificance and importance we experience in relation to the universe.\n",
    "chinese_title": "如果月亮只有1像素：一个极其精确的太阳系模型 (2014)",
    "chinese_summary": "如果月亮只有一个像素：乔什·沃思的互动在线项目，以比例可视化太阳系内的巨大距离。该项目用一个像素代表月亮，突出了太空的广袤空虚。旅程从太阳开始，逐个经过每个行星，以公里和其他易于理解的单位强调它们之间相当大的距离。\n\n该作品探讨了人类难以理解如此巨大尺度的困难，转而使用隐喻和比较来使距离更易于理解（例如，乘坐太空飞船的旅行时间、屏幕堆叠）。它认为，传统的地图往往未能传达太空的真实比例，而这才是太阳系最重要的部分。\n\n文章深入探讨了这种空虚的哲学意义，表明我们的大脑并非天生就适合理解如此广阔的空间。它讨论了这种感知的“虚无”如何令人不安，导致感觉剥夺效应，并突出了人类感知的局限性。\n\n最终，该项目以思考物质（行星、恒星，甚至人类）存在于这片巨大空虚中的意义作为结尾。它表明，这些“小点”的存在或许可以使空虚本身变得可测量且有意义，而我们在如此多的虚无中存在，本身就是一个令人惊叹的现象，尽管在宇宙尺度上可能微不足道。它鼓励人们反思我们与宇宙相关的渺小感和重要感之间的对比。"
  },
  {
    "id": "44269289",
    "title": "The Hat, the Spectre and SAT Solvers (2024)",
    "url": "https://www.nhatcher.com/post/on-hats-and-sats/",
    "summary": "This blog post explores a recent mathematical discovery: aperiodic tilings of the plane with a single shape called the \"Hat,\" and introduces SAT solvers as a tool for solving tiling problems. The author explains the Hat, its aperiodic tiling properties, and its connection to earlier discoveries like Penrose tiles.\n\nThe post then introduces SAT solvers, explaining their function in solving Boolean algebra problems by converting them into Conjunctive Normal Form (CNF). The author describes how to use a SAT solver in a WASM environment to solve a Sudoku puzzle, demonstrating the solver's utility and providing a practical example.\n\nNext, the author explains how to apply SAT solvers to tiling problems, drawing inspiration from Craig Kaplan's work. They describe how a hexagonal grid system can be used with the Hat and how to formulate clauses to find solutions to tile a given region. The post moves onto the Turtle tile, similar to the Hat, also able to aperiodically tile the plane.\n\nFinally, the post discusses the \"Spectre,\" a variation of the Hat family that can tile the plane aperiodically without its mirror image (anti-Spectre). It explains Theorem 3.1, describing the bijection between tilings by the Spectre and by the set {hat, turtle}. The author describes how using the app, changing the side lengths of the Hat and Turtle allows one to create Spectres and thus find an aperiodic monotile.\n",
    "chinese_title": "帽子、幽灵与SAT求解器 (2024)",
    "chinese_summary": "这篇博文探讨了一项近期数学发现：用名为“帽子”的单一形状对平面进行非周期性平铺，并介绍了SAT求解器作为解决平铺问题的工具。作者解释了“帽子”的形状、其非周期性平铺性质，以及它与早期发现（如彭罗斯瓷砖）的联系。\n\n博文随后介绍了SAT求解器，解释了它们通过将布尔代数问题转换为合取范式（CNF）来解决这些问题的原理。作者描述了如何在WASM环境中使用SAT求解器来解决数独难题，展示了求解器的实用性并提供了一个实际例子。\n\n接下来，作者解释了如何将SAT求解器应用于平铺问题，灵感来源于Craig Kaplan的研究。他们描述了如何将六边形网格系统与“帽子”结合使用，以及如何制定子句来找到平铺给定区域的解决方案。博文随后介绍了与“帽子”类似的“海龟”瓷砖，它也能非周期性地平铺平面。\n\n最后，博文讨论了“幽灵”，它是“帽子”家族的一个变体，可以在没有其镜像（反幽灵）的情况下非周期性地平铺平面。它解释了定理3.1，描述了“幽灵”的平铺与{帽子，海龟}集合的平铺之间的双射关系。作者描述了如何使用该应用程序，通过更改“帽子”和“海龟”的边长来创建“幽灵”，从而找到一种非周期性单片瓷砖。"
  },
  {
    "id": "44268644",
    "title": "Show HN: Tattoy – a text-based terminal compositor",
    "url": "https://tattoy.sh",
    "summary": "Tattoy is a text-based terminal compositor that enhances the terminal experience with visual effects and practical features. It works with existing terminal setups, adding eye-candy without disrupting normal terminal operations like copy-pasting.\n\nKey features include:\n\n*   **GPU Shaders:** Renders Shader Toy and Ghostty shaders within the terminal.\n*   **Background Terminal:** Displays the output of another command in the background, useful for visualizations or system monitoring.\n*   **Scrollback Minimap:** Provides a live-updating, pixelized view of the terminal's scrollback history, including scrollbar support.\n*   **Auto Text Contrast:** Intelligently adjusts text color to ensure readability by analyzing the true RGB values of terminal colors, overcoming limitations of terminal palettes.\n*   **Plugins:** Supports plugins written in any language via JSON over STDIN/STDOUT, enabling customized effects and interactions with terminal content. A demonstrated example is smoke particles interacting with text near the cursor.\n\nTattoy aims to improve both aesthetics and usability in modern terminals.\n",
    "chinese_title": "Show HN: Tattoy – 基于文本的终端合成器",
    "chinese_summary": "Tattoy: 一款基于文本的终端合成器，通过视觉效果和实用功能增强终端体验。它与现有终端设置配合使用，在不影响复制粘贴等常规终端操作的前提下，增添视觉效果。\n\n主要功能包括：\n\n*   **GPU着色器：** 在终端中渲染 Shader Toy 和 Ghostty 着色器。\n*   **后台终端：** 在后台显示另一命令的输出，适用于可视化或系统监控。\n*   **回滚小地图：** 提供终端回滚历史记录的实时更新像素化视图，包括滚动条支持。\n*   **自动文本对比度：** 通过分析终端颜色的真实 RGB 值，智能调整文本颜色，确保可读性，克服终端调色板的局限性。\n*   **插件：** 支持通过 STDIN/STDOUT 上的 JSON 以任何语言编写的插件，从而实现自定义效果以及与终端内容的交互。一个演示示例是烟雾粒子与光标附近的文本交互。\n\nTattoy 旨在提升现代终端的美观性和可用性。"
  },
  {
    "id": "44269002",
    "title": "100 years of Zermelo's axiom of choice: What was the problem with it? (2006)",
    "url": "https://research.mietek.io/mi.MartinLof2006.html",
    "summary": "This article revisits the controversy surrounding Zermelo's Axiom of Choice (AC) a century after its inception, examining its initial rejection and eventual acceptance in mainstream mathematics, as well as its continued rejection by intuitionists. While Bishop argued for a constructive interpretation of choice, Diaconescu's theorem highlighted a potential incompatibility between the constructive view and the topos-theoretic understanding of AC.\n\nThe author analyzes Zermelo's 1908 formulation of AC within the framework of constructive type theory, representing sets as extensional sets (sets with equivalence relations) and subsets as extensional propositional functions. The analysis attempts to prove AC based on a set S, an index set I, and a family of subsets (A_i) that are extensional, mutually exclusive, exhaustive, and nonempty.\n\nThe author demonstrates that while the constructive axiom of choice can provide a function *f* satisfying A_i(f(i)), it fails to guarantee the extensionality of *f* (i.e., i ≍ j → f(i) ≍ f(j)). This extensionality is necessary to prove the uniqueness condition required by Zermelo's AC.\n\nThe paper concludes that Zermelo's AC is implied by an *extensional* axiom of choice (ExtAC), which explicitly includes the requirement that the choice function be extensional. However, ExtAC lacks the direct justification that the intensional axiom of choice enjoys, stemming from its connection to the Brouwer-Heyting-Kolmogorov interpretation of logical constants. Thus, the core issue with Zermelo's AC lies in its reliance on an extensional choice function without providing constructive evidence for its extensionality.\n",
    "chinese_title": "策梅洛选择公理百年：问题何在？(2006)",
    "chinese_summary": "本文回顾了策梅洛选择公理（AC）诞生一个世纪后引发的争议，考察了其最初的拒绝和最终在主流数学中的接受，以及直觉主义者对其持续的拒绝。虽然毕肖普主张对选择公理进行构造性解释，但迪亚科内斯库定理突出了构造性观点与拓扑斯理论对选择公理的理解之间潜在的不相容性。\n\n作者在构造类型论的框架内分析了策梅洛1908年对选择公理的表述，将集合表示为外延集合（具有等价关系的集合），将子集表示为外延命题函数。该分析试图基于集合S、索引集合I和一系列子集（A_i）来证明选择公理，这些子集是外延的、互斥的、穷举的和非空的。\n\n作者证明，虽然构造性选择公理可以提供一个函数*f*，满足A_i(f(i))，但它无法保证*f*的外延性（即，i ≍ j → f(i) ≍ f(j)）。这种外延性对于证明策梅洛选择公理所需的唯一性条件是必要的。\n\n论文的结论是，策梅洛选择公理由一个*外延的*选择公理（ExtAC）所暗示，该公理明确包括了选择函数必须是外延的的要求。然而，ExtAC缺乏内涵性选择公理所享有的直接论证，后者源于其与布劳威尔-海廷-柯尔莫哥洛夫对逻辑常数的解释的联系。因此，策梅洛选择公理的核心问题在于它依赖于一个外延的选择函数，但没有为其外延性提供构造性的证据。"
  },
  {
    "id": "44270144",
    "title": "When random people give money to random other people (2017)",
    "url": "https://quomodocumque.wordpress.com/2017/06/27/when-random-people-give-money-to-random-other-people/",
    "summary": "This article discusses a seemingly paradoxical scenario where randomly redistributing money amongst a group of people leads to wealth inequality, despite the process being fair and random. The setup involves N people, each initially holding N dollars, who then randomly give one dollar to another person at each time step.\n\nThe author explains why the intuitive expectation of a uniform wealth distribution is incorrect. They model the system as a random walk on a graph, where each vertex represents a possible distribution of wealth. The stationary distribution of this random walk favors nodes with higher degrees. While the graph is *almost* regular, deviations arise because some states involve people running out of money. Thus, not all states are equally likely in the long run.\n\nThe author then considers the distribution of wealth when the system reaches equilibrium, asking what a random lattice point in the simplex (representing all possible wealth distributions) looks like. They suggest it's highly likely someone will be nearly out of money. They also analyze the expected maximum wealth, drawing an analogy to breaking a stick at random points, with the longest piece representing the richest person's holdings. The expected size of the longest piece, and therefore the richest person's wealth, scales as N log N.\n\nFinally, the article briefly explores the case where each person starts with only one dollar, leading to an even more skewed distribution. The probability of a particular distribution becomes proportional to the number of people with money. The author notes the similarity to the Boltzmann distribution from physics, as pointed out by Kenny Easwaran.\n",
    "chinese_title": "当陌生人给陌生人钱 (2017)",
    "chinese_summary": "随机财富再分配导致财富不均：一个悖论的解释"
  },
  {
    "id": "44264958",
    "title": "Jemalloc Postmortem",
    "url": "https://jasone.github.io/2025/06/12/jemalloc-postmortem/",
    "summary": "This postmortem chronicles the development of the jemalloc memory allocator, highlighting its journey through various phases. Beginning as part of the Lyken programming language (Phase 0), jemalloc found its initial success in FreeBSD (Phase 1), where it replaced the existing allocator but faced fragmentation issues, prompting significant redesign.\n\nPhase 1.5 involved integration with Mozilla Firefox, which led to a forked version due to performance discrepancies, a major disappointment for the author. At Facebook (Phase 2), jemalloc's integration was spurred by the need for pprof-compatible heap profiling, and the project benefited greatly from Facebook's internal telemetry and performance data. Features like extensive testing, Valgrind support (later controversially removed), JSON telemetry, and transition to extents were introduced. A jemalloc team was built to tackle performance and infrastructure improvements before the author's departure.\n\nThe Meta phase (Phase 3) saw a shift in focus toward return on investment, leading to stagnation in long-term development and ultimately, a decline in general utility. The author attributes this to shifting corporate priorities.\n\nPhase 4 marks the end of upstream development, with the author citing accrued technical debt and a lack of excitement to continue. He expresses regret over lacking awareness of external uses like Valgrind and Android and emphasizes that despite open development, jemalloc failed to retain primary contributors from other organizations. Despite being a proponent of garbage collection, he acknowledges jemalloc as a fulfilling project.\n",
    "chinese_title": "Jemalloc事后分析",
    "chinese_summary": "jemalloc事后分析：jemalloc内存分配器的开发历程，从最初作为Lyken编程语言的一部分（阶段0）开始，在FreeBSD（阶段1）中获得初步成功，取代了现有的分配器，但也面临碎片化问题，促使其进行重大重新设计。\n\n阶段1.5涉及与Mozilla Firefox的集成，由于性能差异，导致了一个分支版本，这令作者非常失望。在Facebook（阶段2），jemalloc的集成是由对pprof兼容的堆分析的需求所推动的，并且该项目极大地受益于Facebook的内部遥测和性能数据。引入了诸如广泛的测试、Valgrind支持（后来颇具争议地被移除）、JSON遥测以及向范围的过渡等功能。在作者离开之前，成立了一个jemalloc团队来解决性能和基础设施的改进问题。\n\nMeta阶段（阶段3）看到对投资回报的关注转移，导致长期开发的停滞，并最终导致通用性的下降。作者将此归因于公司优先事项的转变。\n\n阶段4标志着上游开发的结束，作者认为这是由于累积的技术债务以及缺乏继续下去的热情。他对缺乏对Valgrind和Android等外部使用的意识表示遗憾，并强调尽管是开放开发，但jemalloc未能保留来自其他组织的主要贡献者。尽管是垃圾收集的倡导者，但他承认jemalloc是一个令人满意的项目。"
  },
  {
    "id": "44268286",
    "title": "Geometry from Quantum Temporal Correlations",
    "url": "https://arxiv.org/abs/2502.13293",
    "summary": "This arXiv preprint, titled \"Geometry from Quantum Temporal Correlations\" by James Fullwood and Vlatko Vedral, explores the surprising connection between quantum mechanics and geometry. The authors demonstrate that Euclidean 3-space can uniquely emerge from the structure of quantum temporal correlations generated by sequential measurements of Pauli observables on a single qubit.\n\nA key finding is that the geometry derived from these temporal correlations is independent of the qubit's initial state. This implies that an observer can extract geometric information from sequential measurements without needing to know the initial conditions of the qubit, a remarkable property that hints at a fundamental link between quantum mechanics and geometry.\n\nBased on these results, the authors propose a \"toy model\" suggesting the plausibility that space itself may emerge from quantum temporal correlations. This is a highly speculative idea, positioning the paper as an exploratory investigation into the foundational nature of space.\n\nThe paper is concise, consisting of 4 pages with no figures. It is categorized under the subject of Quantum Physics (quant-ph) and presents a theoretical framework for understanding how space might emerge from the underlying quantum properties of systems. It is a significant conceptual contribution rather than a detailed calculation or experimental report.\n",
    "chinese_title": "量子时间关联中的几何学",
    "chinese_summary": "James Fullwood 和 Vlatko Vedral 的 arXiv 预印本，题为《量子时间关联中的几何》，探索了量子力学和几何之间令人惊讶的联系。作者证明，欧几里得3维空间可以从对单个量子比特进行 Pauli 观测量的序列测量所产生的量子时间关联结构中唯一地涌现出来。\n\n一个关键发现是，从这些时间关联推导出的几何与量子比特的初始状态无关。 这意味着观察者可以从序列测量中提取几何信息，而无需知道量子比特的初始条件，这是一个非凡的性质，暗示了量子力学和几何之间存在着根本的联系。\n\n基于这些结果，作者提出了一个“玩具模型”，表明空间本身可能从量子时间关联中涌现出来。这是一个高度推测性的想法，将这篇论文定位为对空间基础性质的探索性研究。\n\n这篇论文简洁明了，共 4 页，没有图。它被归类在量子物理（quant-ph）学科下，并提出了一个理论框架，用于理解空间如何可能从系统的底层量子特性中涌现出来。它是一项重要的概念贡献，而不是详细的计算或实验报告。"
  },
  {
    "id": "44261777",
    "title": "Frequent reauth doesn't make you more secure",
    "url": "https://tailscale.com/blog/frequent-reath-security",
    "summary": "Avery Pennarun's blog post argues that frequent re-authentication doesn't enhance security and can even weaken it. The article critiques the outdated practice of forcing users to log in repeatedly, highlighting the frustrations and security risks it introduces, such as MFA fatigue.\n\nThe author argues that security should focus on robust access management, quick policy changes, and detecting compromised credentials. Frequent logins are often implemented because admins lack confidence in immediate policy enforcement, especially regarding SAML.\n\nThe article refutes the effectiveness of frequent logins against common attack vectors, like remote phishing, as compromised credentials negate their purpose. Instead, the author advocates for leveraging OS-level security measures like automatic screen locking, which provides similar protection without the constant interruption.\n\nThe author criticizes web session expiry policies, deeming them largely ineffective. Instead of arbitrary login prompts, Pennarun suggests verifying device possession only when necessary, such as before sensitive actions, exemplified by Tailscale's SSH check mode and Slack Accessbot.\n\nThe post emphasizes continuous verification through device posture checks and SCIM-based access control for real-time security updates without user intervention. When a device goes offline or roles change, access is instantly revoked or updated.\n\nThe author concludes that the best security is seamless and adaptive, happening in the background without frustrating users into developing poor security habits.\n",
    "chinese_title": "频繁重新验证并不能让你更安全",
    "chinese_summary": "Avery Pennarun的博文认为，频繁的重新身份验证并不能增强安全性，甚至可能削弱安全性。文章批判了强制用户重复登录的过时做法，强调了由此带来的挫败感和安全风险，例如MFA疲劳。\n\n作者认为，安全应该侧重于强大的访问管理、快速的策略变更以及检测被盗用的凭据。频繁登录的实施通常是因为管理员对立即执行策略缺乏信心，尤其是在SAML方面。\n\n文章驳斥了频繁登录对常见攻击媒介（如远程网络钓鱼）的有效性，因为被盗用的凭据会使它们的目的失效。相反，作者提倡利用操作系统级别的安全措施，例如自动屏幕锁定，这提供了类似的保护，而无需持续中断。\n\n作者批评了Web会话过期策略，认为它们基本上是无效的。Pennarun建议，与其进行任意登录提示，不如仅在必要时验证设备所有权，例如在执行敏感操作之前，Tailscale的SSH检查模式和Slack Accessbot就是例证。\n\n该帖子强调通过设备姿势检查和基于SCIM的访问控制进行持续验证，以实现实时安全更新，而无需用户干预。当设备离线或角色发生变化时，访问权限会立即被撤销或更新。\n\n作者的结论是，最好的安全是无缝且自适应的，它在后台发生，而不会让用户感到沮丧并养成不良的安全习惯。"
  },
  {
    "id": "44269270",
    "title": "Luxe Game Engine",
    "url": "https://luxeengine.com/",
    "summary": "Luxe is a cross-platform, rapid development game engine designed for 2D and 3D games on Mac, Linux, Windows, and Web, with console support planned. Built by a game studio actively using it for their own projects (Mossfield Origins and Archives), Luxe prioritizes design and workflow for quick prototyping and iteration.\n\nKey features include:\n\n*   **Ease of Use:** Easy to learn, with a 2D-first approach.\n*   **Powerful Renderer:** Hardware-driven renderer with shader, asset pipeline, and render path support.\n*   **Wren Language:** Games are primarily made in a custom version of the Wren programming language.\n*   **Modular Design:** Core engine with a module system for lightweight and expressive tools, allowing for expansion and customization.\n*   **Workflow Focus:** Emphasizes rapid iteration and expression of intent, with an optional editor designed for game-specific needs.\n*   **Tools, not Features:** Provides adaptable tools that can be combined to create specific game systems, avoiding unnecessary bloat.\n*   **Rendering Flexibility:** Renderer that allows for game-specific choices and high-level interaction, accessible to both beginners and experienced developers.\n\nLuxe is currently available in preview and encourages community involvement through its Discord and mailing list for development updates.\n",
    "chinese_title": "Luxe游戏引擎",
    "chinese_summary": "Luxe是一款跨平台、快速开发的游戏引擎，专为 Mac、Linux、Windows 和 Web 平台上的 2D 和 3D 游戏而设计，并计划支持主机平台。Luxe 由一家积极将其用于自身项目（Mossfield Origins 和 Archives）的游戏工作室构建，优先考虑设计和工作流程，以实现快速原型设计和迭代。\n\n主要特性包括：\n\n*   **易于使用：** 易于学习，采用 2D 优先的方法。\n*   **强大的渲染器：** 硬件驱动的渲染器，支持着色器、资源管线和渲染路径。\n*   **Wren 语言：** 游戏主要使用 Wren 编程语言的自定义版本制作。\n*   **模块化设计：** 核心引擎带有模块系统，可实现轻量级和富有表现力的工具，从而允许扩展和自定义。\n*   **注重工作流程：** 强调快速迭代和意图表达，并提供一个可选的编辑器，专为游戏特定需求而设计。\n*   **工具，而非功能：** 提供可适应的工具，可以组合起来创建特定的游戏系统，避免不必要的臃肿。\n*   **渲染灵活性：** 渲染器允许游戏特定的选择和高级交互，初学者和经验丰富的开发者均可访问。\n\nLuxe 目前提供预览版，并通过其 Discord 和邮件列表鼓励社区参与，以获取开发更新。"
  },
  {
    "id": "44265233",
    "title": "Rendering Crispy Text on the GPU",
    "url": "https://osor.io/text",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "在GPU上渲染酥脆文本",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "44268545",
    "title": "Show HN: Qrkey – Offline private key backup on paper",
    "url": "https://github.com/Techwolf12/qrkey",
    "summary": "QRKey is a command-line tool designed for creating offline backups of private keys and other files by converting them into QR codes. It allows users to encode a file into a series of QR codes, which can then be printed and stored securely. The tool supports large files by automatically splitting them into multiple QR codes and incorporating metadata for validation and easy recovery.\n\nUsers can recover the original file from the printed QR codes using a barcode scanner or by providing a file containing lines of QR code data. The recovered data is then reconstructed into the original file.\n\nQRKey can be installed on macOS via Homebrew. A Docker image is also available for users on other operating systems. The tool offers two main commands: `generate` to create QR code PDFs from files and `recover` to rebuild files from QR code data, either from a file or through an interactive process. The software is open-source and its license information is available in the LICENSE file.\n",
    "chinese_title": "Show HN: Qrkey – 纸上离线私钥备份",
    "chinese_summary": "QRKey 是一个命令行工具，旨在通过将私钥和其他文件转换为二维码来创建离线备份。它允许用户将文件编码成一系列二维码，然后可以打印并安全存储。该工具支持大型文件，通过自动将它们分割成多个二维码并加入元数据以进行验证和方便恢复。\n\n用户可以使用条形码扫描器或提供包含二维码数据行的文件，从打印的二维码中恢复原始文件。然后，恢复的数据会被重建成原始文件。\n\nQRKey 可以通过 Homebrew 安装在 macOS 上。其他操作系统的用户也可以使用 Docker 镜像。该工具提供两个主要命令：`generate` 从文件生成二维码 PDF，以及 `recover` 从二维码数据（无论是来自文件还是通过交互式过程）重建文件。该软件是开源的，其许可信息可在 LICENSE 文件中找到。"
  },
  {
    "id": "44256499",
    "title": "A receipt printer cured my procrastination",
    "url": "https://www.laurieherault.com/articles/a-thermal-receipt-printer-cured-my-procrastination",
    "summary": "This article details the author's decades-long struggle with procrastination, tracing back to potential ADHD, and how they finally found a solution inspired by the addictive nature of video games. The author observed that games, especially FPS games, use frequent, strong feedback loops (Aim -> Shoot -> Hit/Miss) to create a dopamine-driven \"flow state.\"\n\nTo replicate this in real life, they started breaking tasks into micro-tasks and using sticky notes. Completing a task involved crumpling the note and tossing it into a jar, providing immediate feedback. This system worked well but was time-consuming to prepare.\n\nThe ultimate solution involved a thermal receipt printer. The author created a script to print daily tasks, eliminating the friction of writing sticky notes and increasing consistency. They still used sticky notes for more complex tasks, supplementing the printer.\n\nRecognizing the limitations of existing task management software, the author developed custom software to organize tasks hierarchically in a column-based format, making it easy to break down tasks on the fly and print only the relevant subtasks. This system drastically improved productivity and consistency, effectively eliminating low-productivity days. The author emphasizes the importance of starting the day with easy wins, preparing tasks the night before, and being flexible with the system.\n",
    "chinese_title": "小票打印机治好了我的拖延症",
    "chinese_summary": "本文详细介绍了作者与拖延症抗争数十年的历程，追溯到潜在的注意力缺陷多动症，以及他们最终如何从电子游戏的成瘾性中获得灵感，找到解决方案。作者观察到，游戏，特别是第一人称射击游戏，利用频繁、强烈的反馈循环（瞄准 -> 射击 -> 命中/未命中）来创造一种多巴胺驱动的“心流状态”。\n\n为了在现实生活中复制这一点，他们开始将任务分解成微任务，并使用便签纸。完成一项任务包括揉皱便签纸并将其扔进罐子里，从而提供即时反馈。这个系统效果很好，但准备起来很耗时。\n\n最终的解决方案涉及一台热敏小票打印机。作者编写了一个脚本来打印每日任务，消除了书写便签纸的麻烦，并提高了效率。他们仍然使用便签纸来处理更复杂的任务，作为打印机的补充。\n\n认识到现有任务管理软件的局限性，作者开发了自定义软件，以列式格式按层级组织任务，从而可以轻松地即时分解任务并仅打印相关的子任务。该系统极大地提高了生产力和效率，有效地消除了低效率的日子。作者强调了以轻松的胜利开始一天的重要性，在前一天晚上准备任务，并灵活运用该系统。"
  },
  {
    "id": "44267746",
    "title": "Kyber (YC W23) Is Hiring a Technical Account Manager",
    "url": "https://www.ycombinator.com/companies/kyber/jobs/5kSq3Jd-technical-account-manager-tam",
    "summary": "Kyber, a Y Combinator (W23) backed startup building an AI-native document platform for enterprises, is hiring a Technical Account Manager (TAM) in New York. Kyber helps businesses in regulated industries, like insurance, streamline regulatory document workflows, significantly reducing time spent drafting and improving overall communication. They've seen rapid growth, including 20x revenue increase, secured large contracts, and partnered with industry leaders.\n\nThe TAM will be responsible for ensuring customer success through onboarding, training, technical support, and serving as a liaison between clients and Kyber's product and engineering teams. This includes translating feedback, leading technical demonstrations, configuring customer deployments, and monitoring customer health.\n\nIdeal candidates will possess 3+ years of experience with enterprise SaaS products, strong communication skills, empathy, proactive problem-solving abilities, and a team-player mindset. Key requirements include technical proficiency, customer focus, and the ability to convey complex concepts clearly. The salary range is $80K - $120K with 0.01% - 0.10% equity.\n\nKyber emphasizes values like challenging assumptions, customer focus, pride in craftsmanship, high standards, and fostering a fun and supportive environment. To stand out, applicants are encouraged to have a referral sent to the founder, Arvind Sontha, with a brief endorsement. The interview process involves a behavioral screen, customer support practical, technical configuration practical, and reference checks.\n",
    "chinese_title": "Kyber (YC W23) 招聘技术客户经理",
    "chinese_summary": "Kyber (Y Combinator W23 投资的初创公司) 正在纽约招聘技术客户经理 (TAM)，该公司正在构建一个面向企业的 AI 原生文档平台。Kyber 帮助保险等受监管行业的企业简化监管文档工作流程，显著减少起草时间并改善整体沟通。他们实现了快速增长，包括 20 倍的收入增长，获得了大型合同，并与行业领导者建立了合作关系。\n\n技术客户经理将负责通过入职培训、技术支持，以及充当客户与 Kyber 产品和工程团队之间的联络人，来确保客户成功。这包括翻译反馈、领导技术演示、配置客户部署以及监控客户健康状况。\n\n理想的候选人将拥有 3 年以上企业 SaaS 产品经验、强大的沟通能力、同理心、积极主动的解决问题能力以及团队合作精神。主要要求包括技术熟练度、以客户为中心以及清晰地传达复杂概念的能力。薪资范围为 8 万美元至 12 万美元，股权为 0.01% 至 0.10%。\n\nKyber 强调挑战假设、以客户为中心、以精湛工艺为荣、高标准以及营造有趣和支持性的环境等价值观。为了脱颖而出，鼓励申请人向创始人 Arvind Sontha 发送带有简短推荐的推荐信。面试过程包括行为筛选、客户支持实践、技术配置实践和背景调查。"
  },
  {
    "id": "44263780",
    "title": "A Dark Adtech Empire Fed by Fake CAPTCHAs",
    "url": "https://krebsonsecurity.com/2025/06/inside-a-dark-adtech-empire-fed-by-fake-captchas/",
    "summary": "This article details the interconnected world of malicious advertising technology, highlighting its use in disinformation campaigns and various online scams. The investigation started with the \"Doppelganger\" disinformation network, which was found to be using sophisticated cloaking services and sharing infrastructure with VexTrio, a long-standing malicious traffic distribution system (TDS).\n\nVexTrio, along with associated networks like LosPollos and TacoLoco, uses deceptive tactics, including fake CAPTCHAs, to trick users into enabling push notifications. These notifications are then exploited to deliver scams, malware, and misleading pop-up messages. Research links these networks to Adspro Group, a company operating through Swiss hosting providers, and further connects them to other Russia-based push monetization programs like Partners House and BroPush.\n\nSecurity experts argue that these TDSs, often dismissed as minor threats, facilitate the delivery of serious malware and scams, costing consumers billions. The interconnectedness of these networks suggests a significant level of organization, potentially involving Russian organized crime. The article concludes with advice on how to block website notification requests in various browsers to protect oneself and less tech-savvy individuals from these deceptive practices.\n",
    "chinese_title": "由虚假验证码喂养的黑暗广告技术帝国",
    "chinese_summary": "本文详细介绍了恶意广告技术相互关联的世界，重点介绍了其在虚假信息宣传活动和各种在线诈骗中的应用。调查始于“Doppelganger”虚假信息网络，该网络被发现使用复杂的隐藏服务，并与长期存在的恶意流量分发系统 (TDS) VexTrio 共享基础设施。\n\nVexTrio以及 LosPollos 和 TacoLoco 等相关网络，利用欺骗性手段（包括虚假验证码）诱骗用户启用推送通知。这些通知随后被用于传播诈骗、恶意软件和误导性弹出消息。研究将这些网络与通过瑞士托管提供商运营的 Adspro Group 公司联系起来，并进一步将其与其他位于俄罗斯的推送盈利项目联系起来，例如 Partners House 和 BroPush。\n\n安全专家认为，这些常被认为是轻微威胁的 TDS 实际上促进了严重恶意软件和诈骗的传播，给消费者造成数十亿美元的损失。这些网络之间的相互关联表明存在着高度的组织性，可能涉及俄罗斯有组织犯罪。文章最后给出了如何在各种浏览器中阻止网站通知请求的建议，以保护自己和不太懂技术的个人免受这些欺骗行为的侵害。"
  },
  {
    "id": "44267705",
    "title": "The Missing Manual for Signals: State Management for Python Developers",
    "url": "https://bui.app/the-missing-manual-for-signals-state-management-for-python-developers/",
    "summary": "This article introduces signals as a reactive state management solution for Python developers, particularly beneficial when dealing with complex, cascading state changes. It argues that traditional state management, relying on manual updates and side effects, can lead to bugs, tight coupling, inconsistent states, and testing difficulties as applications scale.\n\nSignals offer a declarative, pull-based approach, creating a dependency graph where derived values automatically update when their sources change.  The core primitives are: `Signal` (holds state), `Computed` (derives values from signals), and `Effect` (performs side effects when dependencies change). The article emphasizes that signals are value containers representing current state, unlike event listeners that react to future events.\n\nThe mental model shift involves thinking in terms of relationships that always hold true, rather than imperative sequences of actions. Signals shine in scenarios with complex derived state, cross-cutting concerns, real-time data flows, and state synchronization. They are overkill for simple transformations and request-response patterns.\n\nThe article highlights the importance of grouping related configurations into single signals rather than using overly granular signals. It also cautions against performing side effects directly within computed values, advocating for the use of effects for such operations.  By adopting signals incrementally and strategically, Python developers can build more robust and maintainable applications.\n",
    "chinese_title": "信号遗漏的手册：Python开发者的状态管理",
    "chinese_summary": "本文介绍信号作为Python开发者的响应式状态管理解决方案，尤其是在处理复杂、级联的状态变化时，优势明显。文章认为，传统的状态管理依赖于手动更新和副作用，随着应用程序规模的扩大，可能导致错误、紧密耦合、不一致的状态以及测试困难。\n\n信号提供了一种声明式、拉取式的方法，创建一个依赖关系图，其中派生值会在其源发生变化时自动更新。核心原语包括：`Signal`（保存状态）、`Computed`（从信号派生值）和 `Effect`（在依赖项更改时执行副作用）。文章强调，信号是代表当前状态的值容器，与对未来事件做出反应的事件监听器不同。\n\n思维模式的转变在于以始终成立的关系来思考，而不是以命令式的动作序列来思考。信号在具有复杂派生状态、横切关注点、实时数据流和状态同步的场景中表现出色。对于简单的转换和请求-响应模式来说，它们有些过度设计。\n\n文章强调了将相关配置分组到单个信号中的重要性，而不是使用过于细粒度的信号。它还警告不要在计算值中直接执行副作用，提倡使用effects来进行此类操作。通过逐步且策略性地采用信号，Python开发者可以构建更健壮、更易于维护的应用程序。"
  },
  {
    "id": "44267985",
    "title": "Show HN: Job Compass – AI agents that help you find jobs, not replace you",
    "url": "https://jobcompass.ai/",
    "summary": "Job Compass AI is presented as an AI-powered tool designed to enhance job seekers' success by improving their application process, not replacing them. It helps users apply smarter and win faster by transforming their LinkedIn job search into actual offers.\n\nThe tool targets rising talent, team leaders, and executives, addressing common frustrations like unanswered applications, lack of company contact, and resumes getting lost. It offers features such as finding hiring connections, providing tailored outreach messages, generating salary insights, matching skills, assessing company fit, and analyzing keywords.\n\nJob Compass AI works by analyzing job links, providing a compatibility score, identifying recruiters and hiring managers with contact information, and tracking application status. It also offers performance analytics. Testimonials highlight increased response rates, tailored CV suggestions, and the ability to directly reach hiring managers.\n\nThe tool offers weekly and monthly subscription plans, including free trials. It determines a match score by comparing a job posting to the user's LinkedIn profile and CV, providing detailed feedback. It also offers CV customization, suggesting improvements to match keywords and required skills. The platform identifies recruiters and hiring managers, providing contact data for tailored outreach. Users can sign up, choose a plan, paste a job link, and let Job Compass AI handle the rest.\n",
    "chinese_title": "Show HN：求职指南针 – AI助手助你求职，而非取代你",
    "chinese_summary": "职位指南针AI：利用人工智能助力求职者，而非取代。它通过优化求职流程，帮助用户更聪明地申请、更快地获得录取。它将领英职位搜索转化为实际的录用通知。\n\n该工具面向冉冉升起的新秀、团队领导和高管，解决常见痛点，如申请无回应、缺乏公司联系方式、以及简历石沉大海。它提供诸如寻找招聘联系人、提供定制外联信息、生成薪资洞察、匹配技能、评估公司契合度、以及分析关键词等功能。\n\n职位指南针AI的工作原理是分析职位链接，提供兼容性评分，识别招聘人员和招聘经理并提供联系方式，以及跟踪申请状态。它还提供绩效分析。用户评价强调了更高的回复率、定制化的简历建议，以及直接联系招聘经理的能力。\n\n该工具提供包括免费试用在内的每周和每月订阅计划。它通过比较职位发布与用户的领英个人资料和简历，确定匹配分数，并提供详细的反馈。它还提供简历定制，建议改进以匹配关键词和所需技能。该平台识别招聘人员和招聘经理，提供联系数据以进行定制的外联。用户可以注册、选择计划、粘贴职位链接，然后让职位指南针AI处理剩下的事情。"
  },
  {
    "id": "44258670",
    "title": "iPhone 11 emulation done in QEMU",
    "url": "https://github.com/ChefKissInc/QEMUAppleSilicon",
    "summary": "This document is a README file for QEMU, a versatile open-source machine emulator and virtualizer. QEMU can emulate complete machines without hardware virtualization support, achieving good performance through dynamic translation. It also integrates with Xen and KVM hypervisors for near-native CPU performance. Additionally, QEMU provides userspace API virtualization for Linux and BSD, enabling binaries from different architectures to run on a single host.\n\nThe software caters to diverse use cases, from direct user control to integration with higher-level management layers via a stable command-line interface and monitor API. QEMU is typically invoked through the libvirt library in applications like oVirt, OpenStack, and virt-manager.\n\nThe README also provides instructions on how to build QEMU on various platforms, including Linux, macOS, and Windows (via MinGW). It details the process of submitting patches using Git, emphasizing the importance of the 'Signed-off-by' line and adherence to coding style guidelines.\n\nBug reporting should be done through GitLab issues, preferably after checking if the issue also exists in the upstream code when using vendor-supplied binaries. The document also points users to the QEMU website for version history, release notes, and contact information, including the QEMU development mailing list and IRC channel.\n",
    "chinese_title": "QEMU中的iPhone 11模拟",
    "chinese_summary": "本文档是QEMU的README文件，QEMU是一个通用的开源机器模拟器和虚拟化器。QEMU可以在没有硬件虚拟化支持的情况下模拟完整的机器，通过动态翻译实现良好的性能。它还集成了Xen和KVM虚拟机管理程序，以实现接近原生CPU性能。此外，QEMU为Linux和BSD提供用户空间API虚拟化，使来自不同体系结构的二进制文件能够在单个主机上运行。\n\n该软件适用于各种用例，从直接用户控制到通过稳定的命令行界面和监控API与更高级别的管理层集成。QEMU通常通过libvirt库在oVirt、OpenStack和virt-manager等应用程序中调用。\n\nREADME还提供了关于如何在各种平台上构建QEMU的说明，包括Linux、macOS和Windows（通过MinGW）。它详细介绍了使用Git提交补丁的过程，强调了“Signed-off-by”行的重要性以及对编码风格指南的遵守。\n\n错误报告应通过GitLab issue进行，最好在使用供应商提供的二进制文件时，先检查该问题是否也存在于上游代码中。该文档还将用户指向QEMU网站，以获取版本历史记录、发行说明和联系信息，包括QEMU开发邮件列表和IRC频道。"
  },
  {
    "id": "44265869",
    "title": "Slow and steady, this poem will win your heart",
    "url": "https://www.nytimes.com/interactive/2025/06/12/books/kay-ryan-turtle-poem.html",
    "summary": "A.O. Scott's article analyzes Kay Ryan's poem \"Turtle,\" exploring its layers of meaning and its surprising agility despite its subject. Scott begins by acknowledging the prevalence of animals in poetry but advocates for focused appreciation, using Ryan's turtle as a prime example.\n\nThe poem, on the surface, is a witty and unflinching portrayal of the turtle's arduous existence, burdened by its shell and slow pace. Scott highlights Ryan's use of vivid comparisons, associating the turtle's shell with mundane objects like a \"packing case\" and \"pottery,\" which emphasize the creature's cumbersome reality.\n\nHowever, Scott argues that the poem's genius lies in its ability to transcend the limitations of its subject. While describing the turtle's gracelessness, the poem itself possesses a hidden nimbleness, revealed through its internal rhymes and rhythms. The poem's word choices subtly hint at possibilities beyond the turtle's earthbound existence, like the mention of \"wings,\" prompting a connection to birds and defying the turtle's perceived limitations.\n\nScott suggests that \"Turtle\" functions on multiple levels. It's not just about the animal itself, but about the turtle as a metaphor, illuminating aspects of human experience, particularly for women and poets. Finally, he cleverly points out the anagram hidden in the word \"pottery,\" revealing \"poetry\" and suggesting that poetry itself is a form of liberation akin to flight for the human spirit. The article encourages readers to delve deeper into the poem's nuances, appreciating its wit, observation, and subtle metaphors.\n",
    "chinese_title": "慢工出细活，这首诗会赢得你的心。",
    "chinese_summary": "A.O.斯科特的文章分析了凯·瑞恩的诗歌《乌龟》，探讨了其深层含义以及尽管主题如此却出人意料的敏捷性。斯科特首先承认动物在诗歌中的普遍性，但提倡专注的欣赏，并以瑞恩的乌龟为例。\n\n这首诗表面上是对乌龟艰辛生存的诙谐且毫不退缩的描绘，它受壳和缓慢步伐的负担。斯科特强调了瑞恩对生动对比的使用，将乌龟的壳与诸如“包装箱”和“陶器”之类的平凡事物联系起来，突出了这种生物的笨拙现实。\n\n然而，斯科特认为这首诗的精妙之处在于它能够超越主题的局限性。在描述乌龟的笨拙时，诗本身却具有隐藏的敏捷性，通过其内部韵律和节奏得以展现。这首诗的用词巧妙地暗示了乌龟的陆地存在之外的可能性，例如提到“翅膀”，从而引发了与鸟类的联系，并打破了对乌龟的固有认知限制。\n\n斯科特认为《乌龟》在多个层面上发挥作用。它不仅仅是关于动物本身，而是关于将乌龟作为一种隐喻，阐明人类体验的各个方面，特别是对于女性和诗人而言。最后，他巧妙地指出了隐藏在“陶器”一词中的字谜，揭示了“诗歌”，并暗示诗歌本身是一种解放的形式，类似于人类精神的飞翔。这篇文章鼓励读者更深入地研究这首诗的细微之处，欣赏其智慧、观察力和微妙的隐喻。"
  },
  {
    "id": "44256765",
    "title": "Show HN: Tritium – The Legal IDE in Rust",
    "url": "https://tritium.legal/preview",
    "summary": "This \"Show HN\" post introduces Tritium, a legal Integrated Development Environment (IDE) built in Rust. It is designed to help lawyers with drafting legal documents, specifically contracts. The post is minimalist, providing the title, project name (\"Tritium\"), and a brief description (\"Integrated drafting environment for lawyers\"). The post also includes a call to action for users to load an example contract using the \"File > Open Example\" option, suggesting the IDE is interactive and ready to be used. In essence, the post aims to present Tritium as a new and potentially valuable tool for lawyers looking to streamline their contract drafting process. The fact it's built in Rust implies a focus on performance and reliability.\n",
    "chinese_title": "Show HN: Tritium – Rust 语言的法律 IDE",
    "chinese_summary": "此 \"Show HN\" 帖介绍 Tritium，一个用 Rust 构建的法律集成开发环境 (IDE)。它旨在帮助律师起草法律文件，特别是合同。该帖内容简洁，仅提供标题、项目名称 (\"Tritium\") 和简短描述 (\"律师的集成起草环境\")。该帖还包含一个行动号召，鼓励用户使用“文件 > 打开示例”选项加载示例合同，表明该 IDE 具有交互性且可供使用。本质上，该帖旨在将 Tritium 展示为一种新的、可能对律师来说有价值的工具，以简化他们的合同起草流程。它使用 Rust 构建的事实意味着它注重性能和可靠性。"
  },
  {
    "id": "44265833",
    "title": "Zero-Shot Forecasting: Our Search for a Time-Series Foundation Model",
    "url": "https://www.parseable.com/blog/zero-shot-forecasting",
    "summary": "This article explores the potential of \"foundation models\" for time-series forecasting, aiming to create a single, reusable model applicable across diverse datasets and domains. The authors benchmarked four prominent models: Amazon Chronos, Google TimesFM, IBM Tiny Time-Mixers, and Datadog Toto, comparing their zero-shot forecasting capabilities against traditional methods like ARIMA.\n\nThe motivation behind foundation models is to address the scalability challenges of managing numerous individual forecasting models for various data streams, especially in environments like observability platforms where data is constantly evolving. These models promise zero-shot forecasting, robustness to data variety, simplified operations, and transfer learning.\n\nThe study focused on a multivariate forecasting task using Kubernetes pod metrics (CPU usage, memory consumption, request latency) from a production retail application. Data was pre-processed to handle missing values and normalized. MAPE (Mean Absolute Percentage Error) was chosen as the primary evaluation metric due to its interpretability and scale-invariance.\n\nThe article is a preliminary exploration of whether these modern models can perform well on operational data, rivaling or surpassing the capabilities of meticulously tuned classical models, while also considering the associated computational and operational trade-offs. The authors seek to answer these questions by testing the performance of top time-series foundation models on real, production-scale telemetry.\n",
    "chinese_title": "零样本预测：我们对时间序列基础模型的探索",
    "chinese_summary": "本文探讨了“基础模型”在时间序列预测中的潜力，旨在创建一个可应用于不同数据集和领域的单一、可重用模型。作者对四种主要模型进行了基准测试：Amazon Chronos、Google TimesFM、IBM Tiny Time-Mixers 和 Datadog Toto，并将它们的零样本预测能力与 ARIMA 等传统方法进行了比较。\n\n基础模型的动机是为了解决管理各种数据流的众多单独预测模型的可扩展性挑战，尤其是在像可观测性平台这样数据不断变化的环境中。这些模型有望实现零样本预测、对数据多样性的鲁棒性、简化的操作和迁移学习。\n\n该研究的重点是使用来自生产零售应用程序的 Kubernetes pod 指标（CPU 使用率、内存消耗、请求延迟）进行多元预测任务。数据经过预处理以处理缺失值并进行标准化。选择 MAPE（平均绝对百分比误差）作为主要评估指标，因为它具有可解释性和尺度不变性。\n\n本文初步探讨了这些现代模型是否能在运营数据上表现良好，与精心调整的经典模型相媲美或超越其能力，同时还考虑了相关的计算和运营权衡。作者试图通过测试顶级时间序列基础模型在真实的、生产规模的遥测数据上的性能来回答这些问题。"
  },
  {
    "id": "44268335",
    "title": "Design Patterns for Securing LLM Agents Against Prompt Injections",
    "url": "https://simonwillison.net/2025/Jun/13/prompt-injection-design-patterns/",
    "summary": "This article summarizes a new research paper, \"Design Patterns for Securing LLM Agents against Prompt Injections,\" which proposes six design patterns to mitigate prompt injection vulnerabilities in LLM agents. The author praises the paper for its realistic approach, acknowledging the lack of a complete solution and advocating for trade-offs between agent utility and security by limiting the ability of agents to perform arbitrary tasks.\n\nThe article outlines the six design patterns:\n\n1.  **Action-Selector:** Agents can trigger external actions but cannot process or act on the responses, preventing malicious feedback loops.\n2.  **Plan-Then-Execute:** Tool calls are planned in advance, preventing untrusted content from influencing action selection, though it can still influence the content acted on.\n3.  **LLM Map-Reduce:** Sub-agents process untrusted content independently, and a coordinator safely aggregates the results.\n4.  **Dual LLM:** A privileged LLM coordinates a quarantined LLM, avoiding direct exposure to untrusted content by using symbolic variables.\n5.  **Code-Then-Execute:** A privileged LLM generates sandboxed code defining tool calls and data flow, enabling data flow analysis for tainted data.\n6.  **Context-Minimization:** Unnecessary content, including the original user prompt, is removed from the context to prevent injections after the initial request is processed.\n\nThe paper also includes ten detailed case studies illustrating the application of these patterns in various scenarios, such as OS Assistants, SQL Agents, and Medical Diagnosis Chatbots. One case study explores using strictly formatted interfaces (API descriptions) to interact with untrusted external documentation. The author welcomes the paper as a significant contribution to addressing the critical challenge of prompt injection in LLM agents.\n",
    "chinese_title": "针对大型语言模型代理对抗提示注入的安全设计模式",
    "chinese_summary": "This article summarizes a new research paper, \"Design Patterns for Securing LLM Agents against Prompt Injections,\" which proposes six design patterns to mitigate prompt injection vulnerabilities in LLM agents. The author praises the paper for its realistic approach, acknowledging the lack of a complete solution and advocating for trade-offs between agent utility and security by limiting the ability of agents to perform arbitrary tasks.\n\nThe article outlines the six design patterns:\n\n1.  **Action-Selector:** Agents can trigger external actions but cannot process or act on the responses, preventing malicious feedback loops.\n2.  **Plan-Then-Execute:** Tool calls are planned in advance, preventing untrusted content from influencing action selection, though it can still influence the content acted on.\n3.  **LLM Map-Reduce:** Sub-agents process untrusted content independently, and a coordinator safely aggregates the results.\n4.  **Dual LLM:** A privileged LLM coordinates a quarantined LLM, avoiding direct exposure to untrusted content by using symbolic variables.\n5.  **Code-Then-Execute:** A privileged LLM generates sandboxed code defining tool calls and data flow, enabling data flow analysis for tainted data.\n6.  **Context-Minimization:** Unnecessary content, including the original user prompt, is removed from the context to prevent injections after the initial request is processed.\n\nThe paper also includes ten detailed case studies illustrating the application of these patterns in various scenarios, such as OS Assistants, SQL Agents, and Medical Diagnosis Chatbots. One case study explores using strictly formatted interfaces (API descriptions) to interact with untrusted external documentation. The author welcomes the paper as a significant contribution to addressing the critical challenge of prompt injection in LLM agents.\n"
  },
  {
    "id": "44255728",
    "title": "Maximizing Battery Storage Profits via High-Frequency Intraday Trading",
    "url": "https://arxiv.org/abs/2504.06932",
    "summary": "This paper, \"Maximizing Battery Storage Profits via High-Frequency Intraday Trading,\" by Schaurecker et al., explores strategies for maximizing revenue from grid-scale battery energy storage systems participating in continuous intraday electricity markets. The core idea is that capturing short-lived trading opportunities driven by real-time information requires a high-frequency approach.\n\nThe authors introduce and evaluate an automated trading strategy that explicitly considers the limit order book dynamics, market rules, and technical parameters of battery operation. They adapt the standard rolling intrinsic strategy for the continuous intraday electricity market and use a dynamic programming approximation for its solution, which significantly reduces computational time compared to mixed-integer linear programming.\n\nA backtest using a year of German order book data demonstrates that the dynamic programming approximation does not sacrifice trading profits and enables rapid backtesting by allowing reactions to every relevant order book update. The results show that high-frequency trading can significantly increase revenue; their policy earns 58% more than hourly re-optimization and 14% more than minute-by-minute re-optimization.\n\nFurthermore, the authors leverage the algorithm's speed to train a parametric extension of the rolling intrinsic strategy, resulting in an additional 8.4% increase in yearly revenue out-of-sample. The paper highlights the critical importance of trading speed for profitability in intraday electricity markets using battery storage.\n",
    "chinese_title": "通过高频日内交易实现电池储能利润最大化",
    "chinese_summary": "Schaurecker等人撰写的论文《通过高频日内交易最大化电池储能利润》探讨了如何从参与连续日内电力市场的电网级电池储能系统中最大化收入的策略。其核心思想是，捕捉由实时信息驱动的短暂交易机会需要一种高频方法。\n\n作者介绍并评估了一种自动化交易策略，该策略明确考虑了限价订单簿动态、市场规则和电池运行的技术参数。他们将标准的滚动内在策略应用于连续日内电力市场，并使用动态规划近似法来求解，与混合整数线性规划相比，大大减少了计算时间。\n\n使用一年德国订单簿数据的回测表明，动态规划近似法不会牺牲交易利润，并且通过允许对每个相关的订单簿更新做出反应来实现快速回测。结果表明，高频交易可以显着增加收入；他们的策略比每小时重新优化收益高出 58%，比每分钟重新优化收益高出 14%。\n\n此外，作者利用该算法的速度来训练滚动内在策略的参数化扩展，从而使样本外的年收入额外增加 8.4%。该论文强调了交易速度对于使用电池储能的日内电力市场盈利能力至关重要。"
  },
  {
    "id": "44265851",
    "title": "Show HN: I wrote a BitTorrent Client from scratch",
    "url": "https://github.com/piyushgupta53/go-torrent-client",
    "summary": "This \"Show HN\" post introduces Go-Torrent, a BitTorrent client implemented from scratch in Go. The project aims to provide a complete BitTorrent client with core functionalities such as torrent file parsing, peer discovery, and file downloading.\n\nKey features include: robust Bencode encoding/decoding, complete torrent file processing (including info hash calculation and piece hash extraction), HTTP tracker support, peer handshake and message protocol implementation, peer connection management, concurrent downloading with progress tracking, and file assembly for both single and multi-file torrents. Storage management uses block-level granularity.\n\nThe project is structured into several internal packages: `bencode`, `torrent`, `tracker`, `peer`, and `download`, as well as a `cmd` directory for the command-line interface.\n\nGo 1.21 or later is required, and installation involves cloning the repository and downloading dependencies using `go mod download`. Usage instructions are forthcoming as the project develops.\n\nGo-Torrent is actively under development, and planned features include magnet link support, metadata exchange protocol, and DHT support. The project acknowledges the BitTorrent and Bencode specifications as resources.\n",
    "chinese_title": "Show HN: 我从零开始写了一个BitTorrent客户端",
    "chinese_summary": "此“Show HN”帖子介绍了Go-Torrent，一个完全使用Go语言从头实现的BitTorrent客户端。该项目旨在提供一个完整的BitTorrent客户端，具备torrent文件解析、节点发现和文件下载等核心功能。\n\n主要功能包括：健壮的Bencode编码/解码、完整的torrent文件处理（包括信息哈希计算和分片哈希提取）、HTTP Tracker支持、节点握手和消息协议实现、节点连接管理、带进度跟踪的并发下载，以及单文件和多文件种子文件的文件组装。存储管理采用块级粒度。\n\n该项目被组织成几个内部包：`bencode`、`torrent`、`tracker`、`peer`和`download`，以及一个用于命令行界面的`cmd`目录。\n\n需要Go 1.21或更高版本，安装涉及克隆仓库并使用`go mod download`下载依赖项。随着项目的开发，用法说明即将推出。\n\nGo-Torrent正在积极开发中，计划的功能包括磁力链接支持、元数据交换协议和DHT支持。该项目承认BitTorrent和Bencode规范是参考资源。"
  },
  {
    "id": "44234080",
    "title": "Rust compiler performance",
    "url": "https://kobzol.github.io/rust/rustc/2025/06/09/why-doesnt-rust-care-more-about-compiler-performance.html",
    "summary": "This article addresses the recurring complaint about Rust compiler performance and the perceived lack of action from the Rust Project. The author, a member of the compiler performance working group, assures readers that compiler performance is a high priority. They present data showing significant build performance improvements over the past few years using Hyperqueue as an example.\n\nDespite these improvements, the author acknowledges that compilation times remain a bottleneck for many developers. They discuss the theoretical limits of achieving near-instant rebuilds, suggesting it's possible for incremental builds with trade-offs, citing existing examples and potential \"northstar\" approaches like parallel frontend, alternative backends, and smarter incremental compilation.\n\nThe core of the article explores why progress hasn't been faster. Technical challenges include the compiler's large, complex codebase with technical debt, limited gains from micro-optimizations, and trade-offs between performance and other factors like hardware support and memory usage. The author highlights two paths forward: improving specific compilation workflows and undertaking massive compiler refactorings, both of which face challenges related to ensuring broad compatibility, avoiding regressions, and maintaining backwards compatibility.\n\nBeyond technical hurdles, the author points to the need to prioritize other aspects of the Rust Project, such as stability, security, and maintainability. Making sweeping changes could improve build times but lead to a codebase that is difficult to evolve.\n",
    "chinese_title": "Rust 编译器性能",
    "chinese_summary": "本文探讨了关于 Rust 编译器性能的反复抱怨以及 Rust 项目对此缺乏行动的看法。作者作为编译器性能工作组成员，向读者保证编译器性能是首要任务。他们展示了过去几年中使用 Hyperqueue 作为示例的构建性能的显著改进数据。\n\n尽管有这些改进，作者承认编译时间仍然是许多开发人员的瓶颈。他们讨论了实现近乎即时重新构建的理论极限，表明通过权衡可以实现增量构建，并引用了现有示例和潜在的“北极星”方法，如并行前端、替代后端和更智能的增量编译。\n\n文章的核心探讨了为什么进展不够快。技术挑战包括编译器庞大而复杂的代码库存在技术债务，微优化收益有限，以及性能与其他因素（如硬件支持和内存使用）之间的权衡。作者强调了两种前进的道路：改进特定的编译工作流程和进行大规模的编译器重构，这两种方法都面临着确保广泛兼容性、避免回归和保持向后兼容性的相关挑战。\n\n除了技术障碍，作者还指出需要优先考虑 Rust 项目的其他方面，例如稳定性、安全性和可维护性。进行大刀阔斧的更改可能会缩短构建时间，但会导致代码库难以演进。"
  },
  {
    "id": "44262537",
    "title": "Worldwide power grid with glass insulated HVDC cables",
    "url": "https://omattos.com/2025/06/12/glass-hvdc-cables.html",
    "summary": "This article proposes a revolutionary approach to undersea power transmission using glass-insulated HVDC cables to create a worldwide power grid. The key idea is to replace traditional XLPE plastic insulation with significantly cheaper and more effective fused silica (glass). The proposed cable design features an aluminum conductor surrounded by surface-hardened silica insulation, eliminating the need for outer protection or burial.\n\nThe author suggests manufacturing the cable onboard a ship in a continuous process, extruding the silica, filling it with molten aluminum, and then quenching it to create surface hardening. The cable is then laid directly onto the ocean floor. The design aims for a 14 megavolt system for transmitting 10 Gigawatts, a much higher voltage than existing projects, justified by the scalability of MOSFET-based inverters.\n\nLogistical challenges include maintaining a constant manufacturing speed and resupplying the ship with vast amounts of sand. The deployment process utilizes buoys and rollers to manage cable weight. Potential problems like wave action, ship movement, and the lack of stretchiness of the cable are addressed with various solutions, including route planning.\n\nThe estimated cost for a transatlantic cable using this method is a mere $23 million, drastically cheaper than current options. The author acknowledges potential failure points like ship anchors and geological movements, suggesting redundant cables and wiggling paths to mitigate these. Open questions remain about silica purity and the cable's ability to withstand tension across rocky outcrops. The author also considers the feasibility of a prototype and expresses hope for future development with external funding.\n",
    "chinese_title": "采用玻璃绝缘高压直流电缆的全球电网",
    "chinese_summary": "本文提出了一种革命性的海底电力传输方法，利用玻璃绝缘高压直流电缆构建全球电网。其核心思想是用更便宜且更有效的熔融石英（玻璃）替代传统的XLPE塑料绝缘材料。所提出的电缆设计采用铝导体，周围环绕表面硬化的硅绝缘层，无需外部保护或埋设。\n\n作者建议在船上以连续工艺制造电缆，挤压二氧化硅，用熔融铝填充，然后淬火以产生表面硬化。然后将电缆直接铺设在海底。该设计旨在构建一个14兆伏系统，用于传输10吉瓦电力，这比现有项目电压高得多，并由基于MOSFET的逆变器的可扩展性证明其合理性。\n\n后勤挑战包括保持恒定的制造速度和向船舶补给大量沙子。部署过程利用浮标和滚轮来管理电缆重量。波浪作用、船舶运动和电缆缺乏延展性等潜在问题通过各种解决方案得到解决，包括路线规划。\n\n使用这种方法建造跨大西洋电缆的估计成本仅为2300万美元，远低于当前方案。作者承认潜在的故障点，如船锚和地质运动，并建议使用冗余电缆和蜿蜒路径来缓解这些问题。关于二氧化硅纯度和电缆承受跨越岩石露头张力的能力仍存在疑问。作者还考虑了原型机的可行性，并表示希望未来在外部资金的支持下进行开发。"
  },
  {
    "id": "44265105",
    "title": "Urban Design and Adaptive Reuse in North Korea, Japan, and Singapore",
    "url": "https://www.governance.fyi/p/adaptive-reuse-across-asia-singapores",
    "summary": "This article features an interview with architect Calvin Chua of Spatial Anatomy, focusing on adaptive reuse and urban design in Asia, particularly in Singapore, Japan, and North Korea. Chua's practice emphasizes research-led design, examining the hidden forces shaping cities beyond master plans, including ownership structures, material constraints, and community needs.\n\nIn Singapore, Chua highlights the complexities of \"strata malls,\" where individual ownership hinders redevelopment due to the need for 80% owner approval. This has led to unique social dynamics and niche businesses. He also discusses the \"interim\" nature of temporary structures in Singapore, often lasting for decades.\n\nRegarding North Korea, Chua recounts building a replica Pyongyang apartment for the Seoul Biennale to demonstrate real living conditions. He also trained urban planners in Pyongyang, observing the impact of material limitations (concrete-only due to steel import restrictions) and political mandates (bright colors) on architecture.\n\nChua distinguishes between high-capital adaptive reuse projects (like museums) and community-focused efforts, such as Karl Bengs' renovation of abandoned kominka in Japan, which revitalizes rural villages. He stresses the importance of preserving both the structure and spirit of a place, ensuring that adaptation benefits communities rather than displacing them.\n\nOverall, Chua's methodology combines design, research, and advocacy. He uses ethnography, replication, and a deep understanding of political and social contexts to inform his work. He emphasizes that cities emerge from a complex interplay of ownership, materials, political systems, and the gap between intended and actual use. His approach involves uncovering these factors to shape urban environments thoughtfully and effectively.\n",
    "chinese_title": "朝鲜、日本和新加坡的城市设计与适应性再利用",
    "chinese_summary": "本文专访了Spatial Anatomy建筑事务所的建筑师蔡家骏 (Calvin Chua)，重点介绍了亚洲（尤其是新加坡、日本和朝鲜）的适应性再利用和城市设计。蔡家骏的实践强调以研究为主导的设计，考察超越总体规划塑造城市的隐性力量，包括所有权结构、材料限制和社区需求。\n\n在新加坡，蔡家骏强调了“分层商场”的复杂性，由于需要80%业主批准，个人所有权阻碍了重建。这导致了独特的社会动态和利基企业。他还讨论了新加坡临时建筑的“临时性”，这些建筑往往持续数十年。\n\n关于朝鲜，蔡家骏回忆起为首尔双年展建造一个平壤公寓复制品，以展示真实的居住条件。他还培训了平壤的城市规划师，观察了材料限制（由于钢铁进口限制，只能使用混凝土）和政治指令（鲜艳的颜色）对建筑的影响。\n\n蔡家骏区分了高资本的适应性再利用项目（如博物馆）和以社区为中心的努力，例如卡尔·本斯在日本翻新废弃古民居的项目，这些项目振兴了乡村。他强调了保护建筑结构和精神的重要性，确保适应性改造能够惠及社区，而不是取代它们。\n\n总的来说，蔡家骏的方法结合了设计、研究和倡导。他运用人种学、复制以及对政治和社会背景的深刻理解来指导他的工作。他强调，城市是由所有权、材料、政治制度以及预期用途与实际用途之间的差距等复杂因素相互作用而产生的。他的方法涉及揭示这些因素，从而以周到有效的方式塑造城市环境。"
  },
  {
    "id": "44253212",
    "title": "Microsoft Office migration from Source Depot to Git",
    "url": "https://danielsada.tech/blog/carreer-part-7-how-office-moved-to-git-and-i-loved-devex/",
    "summary": "This article details the complex and lengthy migration of Microsoft Office from Source Depot, a proprietary version control system, to Git. The author recounts the challenges of working with Source Depot, highlighting its slow operations and cumbersome branching processes.\n\nThe migration was driven by the need to reduce costs, improve developer skills transferability, and address employee complaints. The biggest challenge was maintaining consistency across different Office release schedules and ensuring existing build and testing systems continued to function correctly.\n\nThe solution was a \"parallel universe,\" a Git-native codebase that continuously synced with Source Depot. This required inventing the Virtual File System for Git (VFS for Git) due to the massive size of the Office repository. Months were spent proving equivalence between the two systems by running extensive tests.\n\nCommunication was crucial, utilizing a hub-and-spoke model with team \"Champions\" to disseminate information and gather feedback. Extensive training was provided to help developers adapt to Git, and a \"red button\" rollback strategy was implemented to mitigate potential failures.\n\nThe migration resulted in improved developer productivity, faster build times, and better code review processes. The author emphasizes the importance of communication, building a parallel system, investing in champions, and planning for rollback in any large-scale technical migration. The key takeaway is that people management is often more critical than technical expertise in such complex projects.\n",
    "chinese_title": "将 Microsoft Office 从 Source Depot 迁移到 Git",
    "chinese_summary": "将 Microsoft Office 从 Source Depot 迁移到 Git 的复杂过程：挑战与解决方案\n\n本文详细介绍了将 Microsoft Office 从专有的版本控制系统 Source Depot 迁移到 Git 的复杂而漫长的过程。作者回顾了使用 Source Depot 所面临的挑战，强调了其缓慢的操作和繁琐的分支过程。\n\n此次迁移的驱动因素是为了降低成本、提高开发人员的技能可移植性以及解决员工的抱怨。最大的挑战是在不同的 Office 发布计划之间保持一致性，并确保现有的构建和测试系统继续正常运行。\n\n解决方案是“平行宇宙”，一个与 Source Depot 持续同步的 Git 原生代码库。由于 Office 存储库的庞大规模，这需要发明 Git 虚拟文件系统 (VFS for Git)。花费了数月时间，通过运行广泛的测试来证明两个系统之间的等效性。\n\n沟通至关重要，采用中心辐射模型，由团队“冠军”来传播信息和收集反馈。提供了广泛的培训，以帮助开发人员适应 Git，并实施了“红色按钮”回滚策略，以减轻潜在的故障。\n\n此次迁移带来了开发人员生产力的提高、更快的构建时间和更好的代码审查流程。作者强调了在任何大规模技术迁移中，沟通、构建并行系统、投资于冠军以及计划回滚的重要性。关键的要点是，在这种复杂的项目中，人员管理通常比技术专长更为重要。"
  },
  {
    "id": "44258654",
    "title": "Why does my ripped CD have messed up track names? And why is one track missing?",
    "url": "https://www.akpain.net/blog/inside-a-cd/",
    "summary": "This article explains why a ripped CD might have incorrect track names and missing tracks, focusing on the process of CD ripping and the role of metadata databases like MusicBrainz. When ripping a CD, the process relies on the CD's Table of Contents (TOC) to identify the album in MusicBrainz and download associated metadata.\n\nThe author discovered issues with a ripped album where one track name was misspelled (\"Rainclous\" instead of \"Raincloud\"), one track was much longer than it should be (\"Nothing Coming Soon\" included \"Don't Need a Reason\"), and a track was missing (\"The Weight\").\n\nThe core problem stems from inaccuracies in the MusicBrainz database. The misspelled track name was simply a typo entered by a user. The combined track issue arose because the CD had two tracks merged into one, a fact not reflected in the original MusicBrainz entry. This confused the data entry, leading to a missed track when the album was added. Because the metadata is crowdsourced, errors can occur and propagate to rips.\n\nThe author emphasizes that discrepancies between the physical CD and MusicBrainz data can cause these metadata errors. The solution involves correcting the metadata on MusicBrainz, which is editable like Wikipedia. The author then updated the local files manually until the MusicBrainz edits are approved. This highlights the importance of accurate metadata in maintaining a well-organized digital music library.\n",
    "chinese_title": "为什么我抓取的CD音轨名称是乱码？而且为什么少了一个音轨？",
    "chinese_summary": "本文解释了为什么抓取的 CD 可能出现音轨名称不正确和音轨缺失的情况，重点介绍了 CD 抓取过程以及 MusicBrainz 等元数据数据库的作用。在抓取 CD 时，该过程依赖于 CD 的目录（TOC）来识别 MusicBrainz 中的专辑并下载相关的元数据。\n\n作者发现了一个抓取的专辑存在问题，其中一个音轨名称拼写错误（“Rainclous”而不是“Raincloud”），一个音轨比预期要长得多（“Nothing Coming Soon”包含了“Don't Need a Reason”），并且缺少一个音轨（“The Weight”）。\n\n核心问题源于 MusicBrainz 数据库中的不准确之处。拼写错误的音轨名称仅仅是用户输入的错误。合并的音轨问题出现的原因是 CD 上有两个音轨合并为一个音轨，而原始 MusicBrainz 条目中没有反映这一点。这混淆了数据录入，导致在添加专辑时遗漏了一个音轨。由于元数据是众包的，因此可能会发生错误并传播到抓取的 CD 中。\n\n作者强调，物理 CD 和 MusicBrainz 数据之间的差异会导致这些元数据错误。解决方案包括更正 MusicBrainz 上的元数据，它像 Wikipedia 一样可以编辑。作者然后手动更新了本地文件，直到 MusicBrainz 的编辑获得批准。 这突出了准确的元数据在维护井然有序的数字音乐库中的重要性。"
  },
  {
    "id": "44265216",
    "title": "Three Algorithms for YSH Syntax Highlighting",
    "url": "https://github.com/oils-for-unix/oils.vim/blob/main/doc/algorithms.md",
    "summary": "This is not an article, but a snippet of information likely taken from a GitHub page related to the \"oils-for-unix\" project, specifically the \"oils.vim\" repository. This repository probably contains Vim syntax highlighting files for the YSH (Yuck Shell) language, which is the shell component of the Oils project.\n\nThe key information is:\n\n*   **Project:** oils-for-unix (likely the broader Oils project).\n*   **Repository:** oils.vim (focused on Vim syntax highlighting for YSH).\n*   **Functionality:** Provides syntax highlighting for the YSH language within the Vim editor.\n*   **Community:** Has a small number of stars (5) and forks (0), suggesting a relatively small but existing interest.\n\nThe title \"Three Algorithms for YSH Syntax Highlighting\" mentioned in the prompt is NOT present in the provided text snippet, so it is impossible to summarize anything about the algorithms themselves. The presence of \"oils.vim\" implies the existence of code, and that code likely implements the syntax highlighting. Without that code, this response can only summarize the project metadata.\n",
    "chinese_title": "YSH语法高亮的三种算法",
    "chinese_summary": "这不是一篇文章，而可能是一段从GitHub页面截取的信息片段，与“oils-for-unix”项目相关，特别是“oils.vim”仓库。该仓库可能包含用于YSH（Yuck Shell）语言的Vim语法高亮文件，YSH是Oils项目的shell组件。\n\n关键信息是：\n\n*   **项目：** oils-for-unix（可能是更广泛的Oils项目）。\n*   **仓库：** oils.vim（专注于YSH的Vim语法高亮）。\n*   **功能：** 在Vim编辑器中为YSH语言提供语法高亮。\n*   **社区：** 星标数较少（5），并且没有fork（0），表明存在相对较小但已有的兴趣。\n\n提示中提到的标题“YSH语法高亮的三种算法”并未出现在提供的文本片段中，因此无法总结关于算法本身的任何信息。“oils.vim”的存在意味着存在代码，并且该代码可能实现了语法高亮。如果没有该代码，此响应只能总结项目元数据。"
  },
  {
    "id": "44257655",
    "title": "Show HN: Tool-Assisted Speedrunning the Boring Parts of Animal Crossing (GCN)",
    "url": "https://github.com/hunterirving/pico-crossing",
    "summary": "This \"Show HN\" post introduces \"pico-crossing,\" a project designed to drastically improve the speed and convenience of interacting with the GameCube version of Animal Crossing. It addresses the game's notoriously slow typing and limited features by leveraging a Raspberry Pi Pico connected to the GameCube via the controller port.\n\nThe project offers several key enhancements:\n\n*   **Tool-Assisted Typing:** Enables drastically faster text input (45 WPM) compared to the game's native system (~20 WPM), achieved with custom 3D-printed keycaps.\n*   **Infinite Playlist:** Allows cycling through Town Tunes without e-Reader cards.\n*   **All Items Unlocked:** Lets users spawn almost any item by typing its name.\n*   **Image/Video Import:** Converts images and videos into in-game patterns for display.\n*   **In-Game Snake:** Includes a playable version of the classic game.\n\nThe post details the necessary hardware components (Raspberry Pi Pico, extension cables, resistors, diode) and provides a schematic for assembly. It also outlines software prerequisites (Python, ffmpeg, picotool, Pico SDK) and provides build scripts for quick development and flashing the firmware.\n\nThe project utilizes code from several open-source projects under GPLv3 and MIT licenses, ensuring compatibility. The author emphasizes that the project uses only unmodified hardware and software, with no emulation or modification of game binaries, and is intended for non-commercial use.\n",
    "chinese_title": "显示HN：用工具辅助速通《动物森友会》（GCN）的无聊部分",
    "chinese_summary": "这个“Show HN”帖子介绍了一个名为“pico-crossing”的项目，该项目旨在大幅提高与GameCube版《动物森友会》互动时的速度和便利性。它通过利用连接到GameCube控制器端口的Raspberry Pi Pico，解决了游戏中出了名的缓慢打字和有限功能的问题。\n\n该项目提供了几个关键增强功能：\n\n*   **工具辅助打字：** 相比游戏原生系统（约20 WPM），可实现大幅更快的文本输入（45 WPM），这是通过定制的3D打印键帽实现的。\n*   **无限播放列表：** 允许循环播放城镇音乐，无需e-Reader卡。\n*   **所有物品解锁：** 允许用户通过输入名称来生成几乎任何物品。\n*   **图像/视频导入：** 将图像和视频转换为游戏内的图案以供显示。\n*   **游戏内置贪吃蛇：** 包含一个可玩版本的经典游戏。\n\n该帖子详细介绍了必要的硬件组件（Raspberry Pi Pico、延长线、电阻、二极管），并提供了组装原理图。它还概述了软件先决条件（Python、ffmpeg、picotool、Pico SDK），并提供了用于快速开发和刷写固件的构建脚本。\n\n该项目使用了来自多个GPLv3和MIT许可下的开源项目的代码，确保了兼容性。作者强调该项目仅使用未修改的硬件和软件，不进行模拟或修改游戏二进制文件，且仅供非商业用途。"
  },
  {
    "id": "44257609",
    "title": "Show HN: McWig – A modal, Vim-like text editor written in Go",
    "url": "https://github.com/firstrow/mcwig",
    "summary": "McWig is a modal, Vim-like text editor written in Go, currently used by its creator as a daily driver for editing Go files. It's an early-stage project, so users are advised to back up files before editing.\n\nKey features include LSP support (autocomplete, goto definition, hover info), Tree-sitter support, color themes borrowed from Helix, macro support, and a basic org-mode-like functionality. A list of the core supported keybindings is available for quick reference.\n\nThe project originated as a \"speed run\" exercise, prioritizing exploration over meticulous planning. As a result, it's acknowledged as a quick and \"dirty\" implementation and has bugs.\n\nTo run McWig, users must first execute `make setup-runtime` and then `make build-run`. Core functionalities can be accessed through various keybindings, with a full list in `config/config.go`.\n\nFuture plans involve evolving McWig from its current \"toy project\" status into a stable and fully-featured Vim-like text editor.\n",
    "chinese_title": "Show HN: McWig – 一款用 Go 编写的模态、类 Vim 文本编辑器",
    "chinese_summary": "McWig：Go语言编写的模态、类Vim文本编辑器，目前由其作者作为日常编辑Go文件的工具使用。 这是一个早期项目，建议用户在编辑前备份文件。\n\n主要功能包括LSP支持（自动完成、跳转定义、悬停信息）、Tree-sitter支持、从Helix借鉴的颜色主题、宏支持以及基本的org-mode类似功能。 核心支持的键位绑定列表可供快速参考。\n\n该项目最初是作为“速通”练习而产生的，探索优先于周密计划。 因此，它被认为是一个快速且“粗糙”的实现，并且存在错误。\n\n要运行McWig，用户必须首先执行`make setup-runtime`，然后执行`make build-run`。 核心功能可以通过各种键位绑定访问，完整列表位于`config/config.go`中。\n\n未来的计划是将McWig从目前的“玩具项目”状态发展成为一个稳定且功能齐全的类Vim文本编辑器。"
  },
  {
    "id": "44259476",
    "title": "Solving LinkedIn Queens with SMT",
    "url": "https://buttondown.com/hillelwayne/archive/solving-linkedin-queens-with-smt/",
    "summary": "This article discusses solving the \"LinkedIn Queens\" puzzle using an SMT solver (Z3 with Python API) as an easier alternative to SAT solvers. The LinkedIn Queens puzzle requires placing N queens on an NxN grid divided into N regions, with one queen per row, column, and region, and no adjacently diagonal queens.\n\nThe author contrasts Ryan Berger's SAT-based solution with their own SMT solution. The key difference is that SMT solvers handle higher-level data types than booleans. In the SMT approach, queen positions are represented as integers (column number for each row), inherently enforcing the \"one queen per row\" constraint. Constraints like \"distinct columns\" and \"non-adjacent diagonals\" are easily expressed using Z3's `Distinct` function and absolute value differences.\n\nThe most challenging part is the \"one queen per region\" constraint, which requires manually defining the regions. The author uses `Or` to express that at least one queen must be present in each region.\n\nWhile acknowledging that the SMT solution might be slower than a highly optimized SAT solver, the author argues that the increased ease of encoding the problem in SMT makes it a preferable choice for many. Sanity checks, implemented through code that validates region definitions and renders a visual representation of the board, are emphasized as crucial for debugging potential errors in region encoding.\n",
    "chinese_title": "使用SMT解决LinkedIn皇后问题",
    "chinese_summary": "本文讨论了使用SMT求解器（Z3与Python API）解决“LinkedIn皇后”难题，作为SAT求解器的一种更简单的替代方案。“LinkedIn皇后”难题要求在被分为N个区域的NxN网格上放置N个皇后，每行、每列和每个区域各有一个皇后，且没有相邻对角线的皇后。\n\n作者将Ryan Berger基于SAT的解决方案与他们自己的SMT解决方案进行了对比。主要区别在于，SMT求解器处理比布尔值更高层次的数据类型。在SMT方法中，皇后位置表示为整数（每行的列号），固有地强制执行“每行一个皇后”的约束。诸如“不同的列”和“非相邻对角线”等约束很容易使用Z3的`Distinct`函数和绝对值差来表达。\n\n最具挑战性的部分是“每个区域一个皇后”的约束，这需要手动定义区域。作者使用`Or`来表达每个区域中必须至少存在一个皇后。\n\n虽然承认SMT解决方案可能比高度优化的SAT求解器慢，但作者认为，在SMT中对问题进行编码的容易程度的提高使其成为许多人的首选。健全性检查，通过验证区域定义并呈现棋盘可视表示的代码实现，被强调为调试区域编码中潜在错误的至关重要手段。"
  },
  {
    "id": "44216370",
    "title": "Dancing brainwaves: How sound reshapes your brain networks in real time",
    "url": "https://www.sciencedaily.com/releases/2025/06/250602155001.htm",
    "summary": "This ScienceDaily article, published June 2, 2025, details a study from Aarhus University and the University of Oxford revealing how sound dynamically reorganizes brain networks in real-time. Researchers used a new neuroimaging method called FREQ-NESS (Frequency-resolved Network Estimation via Source Separation) to trace how different sound frequencies ripple through brain regions like shifting waves. This method disentangles overlapping brain networks based on their dominant frequency, enabling precise mapping of brain activity.\n\nThe study found that the brain doesn't simply register sound; it actively reconfigures itself, orchestrating a complex interplay of brainwaves across multiple networks. This data-driven approach maps the whole brain's internal organization with high spectral and spatial precision, a significant advancement over traditional methods relying on predefined frequency bands.\n\nThe development of FREQ-NESS opens possibilities for basic neuroscience, brain-computer interfaces, and clinical diagnostics. It adds to growing research on how the brain's rhythmic structure shapes perception, attention, music cognition, and consciousness. Researchers suggest this new technique could change how brain responses to music and interactions with the external world are studied. A large-scale research program, supported by an international network of neuroscientists, is underway to build on this methodology. FREQ-NESS may also pave the way for individualized brain mapping due to its reliability across different datasets.\n",
    "chinese_title": "翩翩脑波：声音如何实时重塑你的大脑网络",
    "chinese_summary": "这项发表于2025年6月2日的《科学日报》文章详细介绍了奥胡斯大学和牛津大学的一项研究，该研究揭示了声音如何实时动态地重组大脑网络。研究人员使用一种名为FREQ-NESS（通过源分离进行频率解析网络估计）的新型神经影像方法，来追踪不同声音频率如何像移动的波浪一样在大脑区域中传播。这种方法根据其主导频率来分离重叠的大脑网络，从而能够精确地绘制大脑活动图。\n\n该研究发现，大脑不仅仅是记录声音；它会积极地重新配置自身，协调多个网络中脑电波的复杂相互作用。这种数据驱动的方法以高光谱和空间精度绘制了整个大脑的内部组织图，这是对依赖于预定义频带的传统方法的重大进步。\n\nFREQ-NESS的开发为基础神经科学、脑机接口和临床诊断开辟了可能性。它增加了关于大脑的节奏结构如何塑造感知、注意力、音乐认知和意识的研究。研究人员认为，这项新技术可能会改变研究大脑对音乐的反应以及与外部世界互动的方式。一项由国际神经科学家网络支持的大型研究计划正在进行中，以建立在此方法论之上。由于其在不同数据集中的可靠性，FREQ-NESS也可能为个性化大脑绘图铺平道路。"
  },
  {
    "id": "44263562",
    "title": "The curse of Toumaï: an ancient skull and a bitter feud over humanity's origins",
    "url": "https://www.theguardian.com/science/2025/may/27/the-curse-of-toumai-ancient-skull-disputed-femur-feud-humanity-origins",
    "summary": "This article details the controversy surrounding the discovery of \"Toumaï\" (Sahelanthropus tchadensis), a 6-7 million-year-old skull discovered in Chad, hailed as potentially the oldest human ancestor. Michel Brunet, the lead paleontologist, announced the discovery with great fanfare, claiming it redefined human origins. However, doubts arose regarding Toumaï's placement on the human lineage, with some suggesting it was more ape-like and questioning its bipedalism.\n\nThe discovery sparked intense feuds and professional rivalries within the paleoanthropology community. A key point of contention was the existence of postcranial remains (bones below the skull) that could definitively prove bipedalism. When a master's student, Aude Bergeret, identified a femur bone from the same site as Toumaï, suggesting the existence of such remains, Brunet allegedly attempted to suppress the finding and discredit Bergeret.\n\nThe article highlights the competitive nature of paleoanthropology, exacerbated by the limited fossil record and the high stakes of redefining human history. It emphasizes that interpretations are provisional and subject to change with each new discovery, leading to constant revisions and disagreements. The story of Toumaï exemplifies how personal ambition and scientific debate can intertwine, casting a shadow over potentially groundbreaking discoveries and creating lasting rifts within the field. The feud over Toumaï's femur continues, leaving the crucial question of its bipedalism and place in the human lineage unresolved.\n",
    "chinese_title": "图迈的诅咒：古老头骨与人类起源的激烈争端",
    "chinese_summary": "本文详细描述了围绕“图迈”（乍得沙赫人），这块在乍得发现的、据称是600万至700万年前的头骨，被誉为可能是最古老的人类祖先的争议。首席古生物学家米歇尔·布吕内高调宣布了这项发现，声称它重新定义了人类起源。然而，人们对图迈在人类谱系中的位置产生了怀疑，一些人认为它更像猿类，并质疑其两足行走能力。\n\n这项发现引发了古人类学界内部激烈的争斗和职业竞争。一个关键的争议点是是否存在可以明确证明两足行走的颅后遗骸（头骨以下的骨骼）。当一位硕士生奥德·贝热雷在与图迈相同的地点发现了一块股骨，表明存在此类遗骸时，据称布吕内试图压制这一发现并诋毁贝热雷。\n\n本文突出了古人类学竞争激烈的本质，化石记录有限和重新定义人类历史的高风险加剧了这种竞争。它强调，解释是暂定的，并会随着每一次新的发现而发生变化，从而导致不断的修改和分歧。图迈的故事说明了个人野心和科学辩论如何交织在一起，给潜在的突破性发现蒙上阴影，并在该领域造成持久的裂痕。关于图迈股骨的争端仍在继续，留下关于其两足行走能力和在人类谱系中地位的关键问题悬而未决。"
  },
  {
    "id": "44267169",
    "title": "Are Python Dictionaries Ordered Data Structures?",
    "url": "https://www.thepythoncodingstack.com/p/are-python-dictionaries-ordered-data",
    "summary": "This article addresses whether Python dictionaries are ordered data structures, providing a nuanced answer.\n\nBefore Python 3.6, dictionaries were unequivocally unordered. However, Python 3.6 introduced an implementation detail that preserved the insertion order of key-value pairs in the CPython interpreter. This feature became part of the language specification in Python 3.7, guaranteeing that dictionaries maintain the order in which items are added.\n\nDespite preserving insertion order, dictionaries are not considered ordered data structures in the same way as sequences like lists and tuples. This is because dictionary equality is based on having the same key-value pairs, regardless of order. In contrast, the order of elements is a fundamental characteristic of sequences, and sequences with the same elements in a different order are considered unequal.\n\nThe article also discusses `collections.OrderedDict`, a data type that existed before Python 3.6 and explicitly maintains order. Unlike standard dictionaries, `OrderedDict` considers the order of insertion when determining equality. Therefore, two `OrderedDict` instances with the same key-value pairs but in a different order are not considered equal.\n\nIn summary, while standard Python dictionaries preserve insertion order from Python 3.7 onwards, this order is not a defining characteristic like it is for sequences. The primary characteristic of a dictionary is the mapping between keys and values, so the preservation of insertion order is a helpful but not essential feature. `collections.OrderedDict` can be used for the specific use case where insertion order is crucial for comparison and equality.\n",
    "chinese_title": "Python字典是有序的数据结构吗？",
    "chinese_summary": "本文探讨了Python字典是否为有序数据结构，并给出了细致的解答。\n\n在Python 3.6之前，字典无疑是无序的。然而，Python 3.6引入了一个实现细节，在CPython解释器中保留了键值对的插入顺序。这个特性在Python 3.7中成为了语言规范的一部分，保证了字典会保持添加元素的顺序。\n\n尽管保留了插入顺序，字典并不被认为是与列表和元组等序列相同意义上的有序数据结构。这是因为字典的相等性是基于拥有相同的键值对，而与顺序无关。相比之下，元素的顺序是序列的一个基本特征，相同元素但顺序不同的序列被认为是不相等的。\n\n本文还讨论了`collections.OrderedDict`，这是一种在Python 3.6之前就存在并明确维护顺序的数据类型。与标准字典不同，`OrderedDict`在确定相等性时会考虑插入顺序。因此，两个具有相同键值对但顺序不同的`OrderedDict`实例不被认为是相等的。\n\n总而言之，虽然标准Python字典从Python 3.7开始保留了插入顺序，但这种顺序并不是像序列那样具有决定性的特征。字典的主要特征是键和值之间的映射关系，因此保留插入顺序是一个有帮助但并非必要的特性。`collections.OrderedDict`可以用于插入顺序对于比较和相等性至关重要的特定用例。"
  },
  {
    "id": "44222307",
    "title": "Quantum Computation Lecture Notes (2022)",
    "url": "https://math.mit.edu/~shor/435-LN/",
    "summary": "This document provides lecture notes for the Quantum Computation course 8.370/18.435 taught by Peter Shor in Fall 2022. The notes cover a comprehensive range of topics within quantum computation, starting with foundational concepts and progressing to more advanced algorithms and error correction techniques.\n\nThe lectures begin with introductions to quantum mechanics principles like superposition, unitary evolution, and quantum measurements. They delve into representing qubits using the Bloch sphere and explore joint quantum systems using tensor products. Classical and reversible Boolean circuits are examined as a basis for understanding quantum gate implementations.\n\nThe course then introduces key quantum algorithms, including the Deutsch-Jozsa algorithm, Simon's algorithm, the Quantum Fourier Transform, Phase Estimation, Shor's factoring algorithm, and Grover's search algorithm. The notes also cover the number theory required to understand the factoring algorithm, along with the Discrete Log algorithm. The document addresses the optimality of Grover search.\n\nFinally, the lecture notes delve into quantum error correction, covering topics like density matrices, the GHZ experiment, quantum optics, Hamiltonian simulation, and various quantum error-correcting codes, including the 9-qubit code, the 7-qubit Quantum Hamming Code, and Quantum CSS Codes. The BB84 Quantum Key Distribution Protocol and its security proof are also discussed. Note that lecture 26 is currently missing notes.\n",
    "chinese_title": "量子计算讲义 (2022)",
    "chinese_summary": "本文档提供了Peter Shor在2022年秋季讲授的量子计算课程8.370/18.435的讲义。讲义涵盖了量子计算领域广泛的主题，从基础概念开始，逐步深入到更高级的算法和纠错技术。\n\n讲座首先介绍量子力学原理，如叠加、酉演化和量子测量。深入研究了使用布洛赫球表示量子比特，并使用张量积探索联合量子系统。考察了经典和可逆布尔电路，作为理解量子门实现的基础。\n\n课程随后介绍了关键的量子算法，包括Deutsch-Jozsa算法、Simon算法、量子傅里叶变换、相位估计、Shor的分解算法和Grover的搜索算法。讲义还涵盖了理解分解算法所需的数论知识，以及离散对数算法。本文档探讨了Grover搜索的最优性。\n\n最后，讲义深入研究了量子纠错，涵盖了密度矩阵、GHZ实验、量子光学、哈密顿模拟以及各种量子纠错码等主题，包括9量子比特码、7量子比特量子汉明码和量子CSS码。还讨论了BB84量子密钥分发协议及其安全性证明。请注意，第26讲的讲义目前缺失。"
  },
  {
    "id": "44242435",
    "title": "Helion: A modern fast paced Doom FPS engine in C#",
    "url": "https://github.com/Helion-Engine/Helion",
    "summary": "Helion is a new, high-performance Doom engine written in C#. It addresses performance limitations of existing engines, allowing complex maps to run smoothly on modern and older hardware. Helion achieves this through static rendering combined with a state management system for handling dynamic map changes, offering a CPU-efficient alternative to traditional BSP tree rendering and better utilizing the GPU.\n\nThe engine supports various WAD formats, including Vanilla, Boom, MBF, MBF21, UDMF (partial), and ID24. Minimum requirements are Windows 7 or Linux with an OpenGL 3.3 compatible GPU.\n\nUsers can download stable releases and experimental nightly builds. .NET 9 is required, and self-contained releases include it. Otherwise, Windows users need the Desktop Runtime, and Linux users require OpenAL, libsndfile, and libmpg123. Game documentation is bundled with the engine, and build instructions are available for compiling from source.\n\nThe article provides screenshots showcasing the engine's capabilities with various Doom maps and includes a link to a full benchmark spreadsheet.\n\nFor discussion, development updates, or getting involved, a Discord server and a Doomworld forum thread are provided. Bug reports can be submitted on GitHub Issues or the Doomworld thread.\n",
    "chinese_title": "Helion：C#中的现代快节奏毁灭战士FPS引擎",
    "chinese_summary": "Helion：一款高性能C#编写的Doom引擎。它解决了现有引擎的性能瓶颈，使复杂的地图能够在现代和旧硬件上流畅运行。Helion通过静态渲染和状态管理系统处理动态地图变化来实现这一点，从而提供了一种CPU高效的替代方案，以取代传统的BSP树渲染，并更好地利用GPU。\n\n该引擎支持多种WAD格式，包括Vanilla、Boom、MBF、MBF21、UDMF（部分）和ID24。最低要求为Windows 7或Linux，并配备兼容OpenGL 3.3的GPU。\n\n用户可以下载稳定版本和实验性的每日构建版本。需要.NET 9，并且自包含版本已包含它。否则，Windows用户需要桌面运行时，而Linux用户则需要OpenAL、libsndfile和libmpg123。游戏文档与引擎捆绑在一起，并且提供了从源代码编译的构建说明。\n\n文章提供了展示引擎在各种Doom地图上的功能的屏幕截图，并包含一个完整基准测试电子表格的链接。\n\n如需讨论、获取开发更新或参与其中，请访问Discord服务器和Doomworld论坛主题。错误报告可以在GitHub Issues或Doomworld主题上提交。"
  },
  {
    "id": "44241242",
    "title": "First thoughts on o3 pro",
    "url": "https://www.latent.space/p/o3-pro",
    "summary": "Ben Hylak and Alexis Dauba provide an early review of OpenAI's new o3-pro model, noting that while pricing has dropped, the pro version requires a different approach to evaluation. Unlike chat-like models, o3-pro shines when given extensive context and a clear goal, acting like a report generator.\n\nThey found o3-pro particularly impressive when they fed it a comprehensive history of Raindrop's planning meetings and goals, resulting in a highly specific and actionable plan that shifted their thinking. This highlights the challenge of traditional evaluations, as the model's strength lies in its ability to integrate into real-world scenarios using tool calls effectively.\n\nO3-pro excels at discerning its environment, communicating its available tools, knowing when to ask for external information, and selecting the appropriate tool. However, it can overthink tasks without sufficient context and may not be ideal for direct tasks like SQL queries.\n\nCompared to models like Claude Opus and Gemini 2.5 Pro, o3-pro feels significantly superior, demonstrating OpenAI's focus on reinforcement learning to teach models not just how to use tools but when to use them. Ultimately, context and a well-defined system prompt are crucial for harnessing o3-pro's power. It's the combination of the model, tools, memory, and other methods that creates a truly effective AI product.\n",
    "chinese_title": "关于 o3 pro 的初步想法",
    "chinese_summary": "Ben Hylak和Alexis Dauba对OpenAI的新型o3-pro模型进行了早期评测，指出虽然价格有所下降，但专业版需要不同的评估方法。与聊天类模型不同，o3-pro在获得大量上下文和明确目标时表现出色，类似于报告生成器。\n\n他们发现，当向o3-pro输入Raindrop的规划会议和目标的全面历史记录时，其表现尤其令人印象深刻，生成了一个高度具体且可操作的计划，改变了他们的想法。这突显了传统评估的挑战，因为该模型的优势在于其有效利用工具调用融入实际场景的能力。\n\nO3-pro擅长识别其环境，沟通其可用工具，知道何时请求外部信息，以及选择合适的工具。然而，在缺乏足够上下文的情况下，它可能会过度思考任务，并且可能不适合直接任务，如SQL查询。\n\n与Claude Opus和Gemini 2.5 Pro等模型相比，o3-pro感觉明显更胜一筹，表明OpenAI专注于强化学习，以教导模型不仅如何使用工具，而且何时使用它们。 最终，上下文和一个明确定义的系统提示对于发挥o3-pro的威力至关重要。 模型、工具、记忆和其他方法的结合才能创造出真正有效的AI产品。"
  },
  {
    "id": "44265501",
    "title": "Show HN: GetHooky – a language-agnostic Git hook manager",
    "url": "https://ezpieco.github.io/GetHooky/",
    "summary": "GetHooky is presented as a language-agnostic Git hook manager aiming to prevent developers from pushing untested or unlinted code. The core problem it solves is the common oversight of forgetting to run linters and tests before pushing code, especially to production.\n\nUnlike many existing Git hook management tools that are language-specific or require complex configuration, GetHooky offers a unified solution. It's a CLI tool, installed globally and usable across various projects regardless of the programming language. This makes it easy to integrate into different workflows without requiring language-specific dependencies or configurations within each project.\n\nGetHooky highlights its cross-platform compatibility (although potential issues with Windows are mentioned), ease of use, and compatibility with all Git hooks. Its main value proposition is preventing errors by automatically running tests and linters before commits and pushes.\n",
    "chinese_title": "Show HN: GetHooky – 一款语言无关的 Git 钩子管理器",
    "chinese_summary": "GetHooky：一种语言无关的Git钩子管理器，旨在防止开发者推送未经测试或代码风格检查的代码。它解决的核心问题是常常会忘记在推送代码（尤其是到生产环境）之前运行代码检查器和测试。\n\n与许多现有的语言特定或需要复杂配置的Git钩子管理工具不同，GetHooky提供了一个统一的解决方案。它是一个CLI工具，全局安装，可在各种项目中使用，不受编程语言的限制。这使得它可以轻松集成到不同的工作流程中，而无需在每个项目中设置特定于语言的依赖项或配置。\n\nGetHooky强调其跨平台兼容性（尽管提到了Windows的潜在问题）、易用性以及与所有Git钩子的兼容性。它的主要价值在于通过在提交和推送之前自动运行测试和代码检查器来防止错误。"
  },
  {
    "id": "44259398",
    "title": "US-backed Israeli company's spyware used to target European journalists",
    "url": "https://apnews.com/article/spyware-italy-paragon-meloni-pegasus-f36dd32106f44398ee24001317ccf2bb",
    "summary": "The Associated Press reports that \"Predator\" spyware, developed by the Israeli company Paragon and allegedly backed by the U.S., was used to target journalists and other individuals in Europe, particularly in Italy. Paragon, reportedly headed by former Israeli intelligence officials, sells the spyware to governments with the claim that it's meant to fight terrorism and crime.\n\nThe investigation found that \"Predator\" was used to infect the devices of journalists in Italy, Spain, and Greece. One prominent Italian journalist, suspected of being critical of Prime Minister Giorgia Meloni, was confirmed to have been targeted. The spyware gives its operators near-total access to a target's device, including messages, calls, emails, photos, and location data.\n\nThe article raises concerns about the proliferation of powerful surveillance technology and its potential for abuse, even in democratic countries. It also highlights the ethical implications of U.S. support for Israeli companies involved in the spyware industry. While Paragon insists it follows international laws, critics argue that the nature of spyware makes it inherently prone to abuse, regardless of stated intentions. The report adds to ongoing scrutiny of the spyware industry following revelations about the use of Pegasus, another Israeli spyware, to target journalists, activists, and politicians worldwide.\n",
    "chinese_title": "美国支持的以色列公司间谍软件被用于攻击欧洲记者",
    "chinese_summary": "美联社报道称，以色列公司Paragon开发的“掠食者”(Predator)间谍软件，据称得到美国支持，被用于针对欧洲的记者和其他个人，尤其是在意大利。据报道，Paragon由前以色列情报官员领导，向各国政府出售该间谍软件，声称其旨在打击恐怖主义和犯罪。\n\n调查发现，“掠食者”被用于感染意大利、西班牙和希腊记者的设备。一位著名的意大利记者，因涉嫌批评总理乔治亚·梅洛尼，被证实成为目标。该间谍软件使其操作者几乎可以完全访问目标设备，包括消息、通话、电子邮件、照片和位置数据。\n\n这篇文章引发了人们对强大的监控技术扩散及其潜在滥用的担忧，即使在民主国家也是如此。它还强调了美国支持参与间谍软件行业的以色列公司所涉及的伦理影响。虽然Paragon坚称其遵守国际法，但批评人士认为，间谍软件的性质使其天生容易被滥用，无论其声明的意图如何。继此前曝光另一款以色列间谍软件Pegasus被用于针对全球的记者、活动家和政治家之后，这份报告进一步加强了对间谍软件行业的持续审查。"
  },
  {
    "id": "44263577",
    "title": "EM Eavesdropping Attack on Digital Microphones Using Pulse Density Modulation",
    "url": "https://www.usenix.org/conference/usenixsecurity25/presentation/onishi",
    "summary": "This article introduces a novel electromagnetic (EM) side-channel attack that enables acoustic eavesdropping on devices equipped with digital MEMS microphones using pulse-density modulation (PDM). The attack exploits the fact that the harmonics of the digital PDM pulses emitted by the microphone retain acoustic information. By using standard radio receivers and FM demodulation, attackers can recover the original audio captured by the microphone without needing to install malware or physically tamper with the device.\n\nThe researchers demonstrated the vulnerability's effectiveness through real-world evaluations using various devices, including laptops and smart speakers. They achieved high accuracy in recognizing spoken digits (up to 94.2%) and a low word error rate (14%) when transcribing speech using standard speech-to-text APIs, even when the victim device was located behind a concrete wall. They also showcased that the attack could be performed with a simple, stealthy antenna.\n\nThe paper also addresses the limitations of existing defenses like resampling and proposes a new hardware countermeasure based on clock randomization to mitigate the vulnerability. Ultimately, the research highlights a significant security flaw in modern digital microphones and proposes a potential solution to safeguard against EM eavesdropping attacks.\n",
    "chinese_title": "利用脉冲密度调制对数字麦克风进行的电磁窃听攻击",
    "chinese_summary": "本文介绍了一种新型电磁（EM）侧信道攻击，该攻击能够通过脉冲密度调制（PDM）对配备数字MEMS麦克风的设备进行声学窃听。 该攻击利用了麦克风发出的数字 PDM 脉冲的谐波保留声学信息这一事实。通过使用标准无线电接收器和 FM 解调，攻击者可以恢复麦克风捕获的原始音频，而无需安装恶意软件或物理篡改设备。\n\n研究人员通过使用包括笔记本电脑和智能音箱在内的各种设备进行真实环境评估，证明了该漏洞的有效性。 在使用标准语音转文本 API 转录语音时，他们实现了语音数字识别的高精度（高达 94.2%）和低字错误率（14%），即使受害者设备位于混凝土墙后也是如此。 他们还展示了可以使用简单、隐蔽的天线执行攻击。\n\n该论文还讨论了现有防御措施（如重采样）的局限性，并提出了一种基于时钟随机化的新型硬件对策，以减轻该漏洞的影响。 最终，该研究突显了现代数字麦克风中一个重大的安全缺陷，并提出了一种潜在的解决方案来防止电磁窃听攻击。"
  },
  {
    "id": "44251047",
    "title": "Research suggests Big Bang may have taken place inside a black hole",
    "url": "https://www.port.ac.uk/news-events-and-blogs/blogs/space-cosmology-and-the-universe/what-if-the-big-bang-wasnt-the-beginning-our-research-suggests-it-may-have-taken-place-inside-a-black-hole",
    "summary": "The University of Portsmouth article proposes a novel cosmological model suggesting the Big Bang might have occurred inside a black hole. Researchers are using loop quantum gravity to explore this idea, which offers an alternative to the standard cosmological model that struggles to explain the universe's initial singularity.\n\nThe key concept is that as a black hole reaches a certain density, quantum gravity effects can prevent it from collapsing to a singularity. Instead, it could transition into a \"white hole,\" effectively reversing the collapse into an expansion, potentially leading to the Big Bang. This scenario suggests our universe could have originated from the death of a massive star in another universe.\n\nThe research uses simplified models to understand the early universe and overcome mathematical challenges in applying quantum gravity. While these models provide valuable insights, they require further refinement to accurately represent the complex dynamics of the real universe. The team acknowledges that current evidence can't definitively prove or disprove this theory, but they are actively working on developing more sophisticated models and seeking observational evidence that could support or refute this hypothesis. This includes searching for specific patterns in the cosmic microwave background radiation. Essentially, the article argues that the Big Bang could be the end-result of a black hole's life cycle, a radical rethinking of the origin of our universe.\n",
    "chinese_title": "研究表明宇宙大爆炸可能发生于黑洞内部",
    "chinese_summary": "朴茨茅斯大学的文章提出了一种新的宇宙学模型，认为大爆炸可能发生在黑洞内部。研究人员正在利用圈量子引力来探索这一想法，它为难以解释宇宙初始奇点的标准宇宙学模型提供了一种替代方案。\n\n其关键概念是，当黑洞达到一定密度时，量子引力效应可以阻止它坍缩成奇点。相反，它可能会转变为一个“白洞”，有效地将坍缩反转为膨胀，从而可能导致大爆炸。这种情况表明，我们的宇宙可能起源于另一个宇宙中一颗巨大恒星的死亡。\n\n该研究使用简化的模型来理解早期宇宙，并克服了应用量子引力时遇到的数学挑战。虽然这些模型提供了有价值的见解，但它们需要进一步改进，才能准确地表示真实宇宙的复杂动力学。该团队承认，目前的证据无法明确地证明或反驳这一理论，但他们正在积极开发更复杂的模型，并寻找可以支持或驳斥这一假设的观测证据，包括在宇宙微波背景辐射中寻找特定的模式。本质上，这篇文章认为，大爆炸可能是黑洞生命周期的最终结果，是对我们宇宙起源的一种彻底反思。"
  },
  {
    "id": "44220245",
    "title": "Reflections on Sudoku, or the Impossibility of Systematizing Thought",
    "url": "https://rjp.io/blog/2025-06-07-reflections-on-sudoku",
    "summary": "This article reflects on the inherent difficulty of systematizing thought, particularly in problem-solving, drawing parallels between the philosophical Entscheidungsproblem and practical programming challenges. The author explores the desire for a universally applicable method for solving problems but concludes that such a system is impossible, mirroring the undecidability inherent in computation.\n\nThe core argument is illustrated by examining the \"Sudoku Affair,\" contrasting Peter Norvig's efficient, knowledge-driven approach to solving Sudoku with Ron Jeffries' less successful, strictly TDD-driven attempt. The author argues that Jeffries' struggle stems from an overreliance on TDD as a silver bullet, ignoring the need for domain-specific knowledge and broader problem-solving tools.\n\nThe article connects this to the Entscheidungsproblem, suggesting that the impossibility of determining whether a program solves a task implies the impossibility of systematizing the process of finding a program to solve that task. While processes like TDD can be helpful, they're not replacements for insight and a robust toolbox of problem-solving skills. The author advocates for building a diverse \"toolbox\" by learning from others, adopting a scientific approach, and constantly seeking new perspectives. The article concludes with a list of practical tools the author uses, acknowledging that while a universal solution is elusive, continuous learning and adaptation are essential for effective problem-solving.\n",
    "chinese_title": "数独反思：或系统化思考的不可能性",
    "chinese_summary": "本文反思了系统化思考的内在困难，尤其是在解决问题方面，并将哲学上的判定性问题与实际编程挑战进行了类比。作者探讨了对通用问题解决方法的需求，但最终认为这种系统是不可能的，这与计算中固有的不可判定性相呼应。\n\n通过考察“数独事件”来阐述核心论点，对比了Peter Norvig高效的、知识驱动的数独解法与Ron Jeffries不太成功的、严格TDD驱动的尝试。作者认为Jeffries的挣扎源于过度依赖TDD作为灵丹妙药，忽略了领域特定知识和更广泛的问题解决工具的需求。\n\n本文将此与判定性问题联系起来，暗示了无法确定程序是否解决任务，意味着无法系统化寻找解决该任务的程序的过程。虽然像TDD这样的过程可能有所帮助，但它们不能替代洞察力和强大的问题解决技能工具箱。作者提倡通过向他人学习、采用科学方法和不断寻求新的视角来构建多样化的“工具箱”。文章最后列出了作者使用的实用工具，承认虽然通用解决方案难以捉摸，但持续学习和适应对于有效的问题解决至关重要。"
  },
  {
    "id": "44251411",
    "title": "Chatterbox TTS",
    "url": "https://github.com/resemble-ai/chatterbox",
    "summary": "Chatterbox TTS is Resemble AI's open-source, production-grade text-to-speech (TTS) model, licensed under MIT. It's benchmarked to outperform leading closed-source systems like ElevenLabs, offering high-quality voice synthesis for various applications like memes, videos, games, and AI agents. A key feature is its emotion exaggeration control, allowing for more expressive voices.\n\nThe model utilizes a 0.5B Llama backbone, alignment-informed inference for stability, and is trained on 0.5M hours of cleaned data. It includes a voice conversion script and supports \"zero-shot\" TTS. While powerful, Resemble AI also offers a commercial TTS service for scaling and improved accuracy with ultra-low latency, ideal for production environments.\n\nFor general use, the default settings work well, but the documentation suggests adjusting exaggeration and `cfg_weight` parameters for expressive or fast speech.  Installation is straightforward using `pip` or from source. The provided code snippets demonstrate basic usage for text-to-speech generation, including specifying audio prompts for voice cloning. Currently, only English is supported.\n\nImportantly, Chatterbox TTS implements a built-in Perceptual Threshold (Perth) watermarking system to ensure responsible AI use.  The watermark is imperceptible and robust to audio manipulation, allowing for traceability of generated audio. A script is provided to extract the watermark.  The project encourages users to join their Discord community for collaboration and responsible use of the model.\n",
    "chinese_title": "话匣子TTS",
    "chinese_summary": "Chatterbox TTS 是 Resemble AI 的开源、生产级文本转语音 (TTS) 模型，采用 MIT 许可。其性能优于 ElevenLabs 等领先的闭源系统，为表情包、视频、游戏和 AI 代理等各种应用提供高质量的语音合成。一个关键特性是其情感夸张控制，可以实现更具表现力的声音。\n\n该模型采用 0.5B Llama 主干，利用对齐信息推理来保证稳定性，并在 50 万小时的清洗数据上进行训练。它包含一个声音转换脚本，并支持“零样本”TTS。尽管功能强大，Resemble AI 还提供商业 TTS 服务，用于扩展和提高精度，具有超低延迟，非常适合生产环境。\n\n对于一般用途，默认设置效果良好，但文档建议调整夸张度和 `cfg_weight` 参数以获得富有表现力或快速的语音。 使用 `pip` 或从源代码进行安装很简单。提供的代码片段演示了文本转语音生成的基本用法，包括指定音频提示以进行语音克隆。目前仅支持英语。\n\n重要的是，Chatterbox TTS 实施了内置的感知阈值 (Perth) 水印系统，以确保负责任的 AI 使用。 水印是无法察觉的，并且对音频操作具有鲁棒性，从而可以追溯生成的音频。 提供了一个脚本来提取水印。 该项目鼓励用户加入他们的 Discord 社区，以进行协作和负责任地使用该模型。"
  },
  {
    "id": "44269925",
    "title": "Show HN: Swift Scribe: On-device AI scribe using Apple's new Foundation Models",
    "url": "https://github.com/slipboxai/swift-scribe",
    "summary": "Swift Scribe is a privacy-focused, AI-powered speech-to-text application for iOS 26 and macOS 26 and above. It leverages Apple's new Foundation Models and SpeechTranscriber frameworks for real-time, on-device transcription and intelligent note-taking. The app aims to demonstrate the ease of building local, AI-first applications using these new Apple technologies.\n\nSwift Scribe offers features like meeting transcription, interview recording, and medical dictation. It targets various sectors, including business, healthcare, education, legal, and content creation.\n\nTechnically, Swift Scribe requires iOS 26/macOS 26 beta, Xcode Beta with Swift 6.2+, and an Apple Developer Account with beta access. The project's architecture includes components for audio capture, transcription, AI processing, rich text editing, and data storage.\n\nThe development roadmap includes core enhancements like accuracy improvements, followed by advanced features like speaker diarization and multi-language support. Future plans also entail platform expansion through iOS Shortcuts, Apple Watch integration, and API capabilities.\n\nThe project is licensed under the MIT License. Developers can use AI agents within Cursor & Windsurf IDEs to explore documentation, including WWDC 2025 session transcripts covering SpeechAnalyzer, Foundation Models, and Rich Text Editor implementations. The project encourages users to star the repository and share it with other developers.\n",
    "chinese_title": "Show HN: Swift Scribe：使用苹果全新Foundation模型的设备端AI速记员",
    "chinese_summary": "Swift Scribe：一款注重隐私的AI驱动型语音转文本应用，适用于iOS 26及macOS 26以上版本。它利用苹果最新的Foundation Models和SpeechTranscriber框架，实现实时、设备端转录和智能笔记。该应用旨在展示使用这些苹果新技术构建本地、AI优先应用的便捷性。\n\nSwift Scribe提供会议转录、访谈录音和医疗听写等功能，面向商业、医疗保健、教育、法律和内容创作等多个领域。\n\n从技术上讲，Swift Scribe需要iOS 26/macOS 26 Beta、带有Swift 6.2+的Xcode Beta以及具有Beta访问权限的Apple开发者帐户。该项目的架构包括音频捕获、转录、AI处理、富文本编辑和数据存储等组件。\n\n开发路线图包括核心功能增强，如提高准确性，然后是高级功能，如说话人分离和多语言支持。未来的计划还包括通过iOS捷径、Apple Watch集成和API功能扩展平台。\n\n该项目采用MIT许可证。开发者可以在Cursor和Windsurf IDE中使用AI代理来探索文档，包括涵盖SpeechAnalyzer、Foundation Models和富文本编辑器实现的WWDC 2025会议记录。该项目鼓励用户为该仓库点亮星标并与其他开发者分享。"
  },
  {
    "id": "44231386",
    "title": "The hunt for Marie Curie's radioactive fingerprints in Paris",
    "url": "https://www.bbc.com/future/article/20250605-the-hunt-for-marie-curies-radioactive-fingerprints-in-paris",
    "summary": "Sophie Hardach journeys to Paris to explore the lingering radioactive fingerprints of Marie Curie, more than a century after her groundbreaking work with radioactive materials. Curie, working in a rudimentary lab (and later, a dedicated institute), handled radioactive elements like radium with her bare hands, leaving traces throughout her workspaces, archived notes, and furniture.\n\nThe Curie Museum allows visitors to view, but not enter, Marie Curie's office and lab. In a rare tour, Hardach, accompanied by radiation expert Marc Ammerich, uses a Geiger counter to detect these radioactive traces on doorknobs, chairs, notebooks, and even the family dining table. The radiation levels are low and considered safe, offering a tangible connection to Curie's life and work.\n\nThe article highlights the painstaking and dangerous process Curie and her husband Pierre undertook to isolate and identify polonium and radium. They worked in a poorly equipped shed, exposed to radioactive vapors and toxic chemicals.\n\nThe museum faces the challenge of preserving these artifacts as heritage while mitigating any potential public safety risks. Some contaminated items have been destroyed, while others, after decontamination, are preserved with their residual radioactivity. Experts like Thomas Beaufils emphasize the unique historical value of these radioactive traces, showcasing the working conditions and scientific legacy of Marie Curie. Today, safety protocols are significantly stricter, underscoring the risks Curie bravely faced in her pursuit of scientific discovery.\n",
    "chinese_title": "在巴黎寻找居里夫人的放射性指纹",
    "chinese_summary": "苏菲·哈达赫前往巴黎，探寻玛丽·居里在开创性的放射性物质研究一个多世纪后，留下的放射性印记。居里在一个简陋的实验室（以及后来的专门研究所）工作时，曾赤手处理镭等放射性元素，在她的工作场所、档案笔记和家具中留下了痕迹。\n\n居里博物馆允许游客参观，但不能进入玛丽·居里的办公室和实验室。在一次罕见的参观中，哈达赫在放射性专家马克·阿梅里希的陪同下，使用盖革计数器探测门把手、椅子、笔记本甚至家庭餐桌上的放射性痕迹。辐射水平很低，被认为是安全的，为人们提供了与居里生平和工作的切实联系。\n\n文章强调了居里和她的丈夫皮埃尔为分离和鉴定钋和镭所进行的艰苦而危险的过程。他们在设备简陋的棚子里工作，暴露在放射性蒸汽和有毒化学物质中。\n\n博物馆面临着既要将这些文物作为遗产保存，又要减轻任何潜在的公共安全风险的挑战。一些受污染的物品已被销毁，而另一些物品在经过净化后，则保留了残余的放射性。像托马斯·博菲斯这样的专家强调了这些放射性痕迹独特的历史价值，展示了玛丽·居里的工作条件和科学遗产。今天，安全协议严格得多，突显了居里在追求科学发现时勇敢面对的风险。"
  },
  {
    "id": "44217356",
    "title": "Rohde and Schwarz AMIQ Modulation Generator Teardown",
    "url": "https://tomverbeure.github.io/2025/04/26/RS-AMIQ-Teardown-Analog-Deep-Dive.html",
    "summary": "This article details a teardown and analysis of the Rohde & Schwarz AMIQ Modulation Generator, an I/Q modulation generator with a 2-channel arbitrary waveform generator (AWG) and deep sample buffer. The author acquired the AMIQ at auction and restored it to working order.\n\nThe AMIQ generates baseband modulated signals for RF vector signal generators. It streams samples to two 14-bit DACs at up to 105MHz and allows for precise skew adjustments between I and Q channels (10ps precision) and programmable DAC sample frequencies. It features various input/output connectors, including 10MHz reference, sample clock, trigger, marker, and a GPIB interface.\n\nThe teardown reveals a standard PC subsystem and a well-designed signal generation PCB. The article then focuses on the analog aspects of the signal generation PCB, particularly the reference clock generation and DAC clock synthesizer. The AMIQ uses a TCXO, phase-locked to an external reference. The DAC clock synthesizer utilizes a VCO (Mini-Circuits JTOS-200) and an AD9850 DDS synthesizer to create a highly programmable clock. The AD9850 generates a clock, converting the digital signal to analog and back to digital via a low pass filter and comparator to remove spurs. Finally, the author touches upon the I/Q output skew tuning capabilites. The article emphasizes the availability of detailed schematics and ample test points for in-depth analysis.\n",
    "chinese_title": "罗德与施瓦茨 AMIQ 调制信号发生器拆解",
    "chinese_summary": "本文详细拆解并分析了罗德与施瓦茨 AMIQ 调制发生器，这是一款 I/Q 调制发生器，具有双通道任意波形发生器 (AWG) 和深度采样缓冲器。作者在拍卖会上获得了 AMIQ，并将其恢复到正常工作状态。\n\nAMIQ 为射频矢量信号发生器生成基带调制信号。它以高达 105MHz 的频率将采样流传输到两个 14 位 DAC，并允许 I 和 Q 通道之间进行精确的偏斜调整（10ps 精度）和可编程的 DAC 采样频率。它具有各种输入/输出连接器，包括 10MHz 参考时钟、采样时钟、触发器、标记和 GPIB 接口。\n\n拆解显示了一个标准的 PC 子系统和一个设计良好的信号生成 PCB。本文随后重点关注信号生成 PCB 的模拟方面，特别是参考时钟生成和 DAC 时钟合成器。AMIQ 使用 TCXO，锁相到外部参考。DAC 时钟合成器利用 VCO（Mini-Circuits JTOS-200）和 AD9850 DDS 合成器来创建高度可编程的时钟。AD9850 生成时钟，通过低通滤波器和比较器将数字信号转换为模拟信号，然后再转换回数字信号以消除杂散信号。最后，作者谈到了 I/Q 输出偏斜调整功能。文章强调了可用于深入分析的详细原理图和充足的测试点。"
  },
  {
    "id": "44230157",
    "title": "Archaeological evidence of intensive indigenous farming in MI's Upper Peninsula",
    "url": "https://www.science.org/doi/10.1126/science.ads1643",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "密歇根州上半岛高强度原住民农业的考古证据",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "44259137",
    "title": "WebKit Standards Positions",
    "url": "https://webkit.org/standards-positions/",
    "summary": "This article, titled \"WebKit Standards Positions,\" provides information on WebKit's stance on various web standards. The main point is to inform users and developers about WebKit's support and implementation of different standards.\n\nThe article offers two ways to access this information:\n\n1. **Interactive Summary Table:** This option requires JavaScript to be enabled, providing a user-friendly and likely searchable table format for browsing standards positions.\n\n2. **Direct GitHub Repository:** If JavaScript is disabled or if users prefer direct access to the raw data, they can browse the standards-positions repository on GitHub. This likely contains the underlying data in a more technical format.\n\nIn essence, the article is a gateway to understanding how WebKit aligns with and implements web standards, offering both an interactive and a direct access method to the relevant data. It empowers developers to make informed decisions based on WebKit's stated standards positions.\n",
    "chinese_title": "WebKit标准立场",
    "chinese_summary": "本文题为“WebKit标准立场”，提供了关于WebKit对各种Web标准的立场的信息。其主要目的是告知用户和开发者WebKit对不同标准的支持和实施情况。\n\n本文提供了两种访问这些信息的方式：\n\n1. **交互式概要表格：** 此选项需要启用JavaScript，提供用户友好且可能可搜索的表格格式，用于浏览标准立场。\n\n2. **直接GitHub仓库：** 如果JavaScript被禁用，或者用户更喜欢直接访问原始数据，他们可以浏览GitHub上的standards-positions仓库。这可能包含以更技术格式存在的底层数据。\n\n本质上，本文是理解WebKit如何与Web标准对齐并实施Web标准的门户，提供了一种交互式和直接访问相关数据的方法。它使开发者能够根据WebKit声明的标准立场做出明智的决策。"
  },
  {
    "id": "44258213",
    "title": "Seedance 1.0",
    "url": "https://seed.bytedance.com/en/seedance",
    "summary": "Seedance 1.0 is a new AI model capable of generating high-quality multi-shot videos from both text and image prompts. It excels in semantic understanding and prompt following, producing 1080p videos characterized by smooth motion, rich details, and cinematic aesthetics.\n\nThe model's performance was evaluated on SeedVideoBench-1.0 and compared against other industry models in key areas like prompt adherence, motion quality, and aesthetics. Seedance 1.0 achieved high scores in both text-to-video (T2V) and image-to-video (I2V) tasks, demonstrating its ability to accurately interpret prompts while maintaining consistency with source images in I2V scenarios.\n\nLeaderboard rankings from Artificial Analysis further highlight Seedance 1.0's strong performance in both T2V and I2V categories. The document also mentions the absence of public data for Kling 2.1, resulting in the use of Kling 2.0's Elo score for comparison. Overall, Seedance 1.0 represents a significant advancement in video generation technology.\n",
    "chinese_title": "Seedance 1.0\n舞蹈种子 1.0",
    "chinese_summary": "Seedance 1.0 是一款新型人工智能模型，能够根据文本和图像提示生成高质量的多镜头视频。它擅长语义理解和提示语跟随，能够生成具有流畅运动、丰富细节和电影美学的1080p视频。\n\n该模型在SeedVideoBench-1.0上进行了评估，并在提示语遵循、运动质量和美学等关键领域与其他行业模型进行了比较。Seedance 1.0在文本生成视频 (T2V) 和图像生成视频 (I2V) 任务中均获得了高分，展示了其准确理解提示语的能力，同时在I2V场景中保持与源图像的一致性。\n\nArtificial Analysis的排行榜排名进一步突显了Seedance 1.0在T2V和I2V类别中的出色表现。文档还提到Kling 2.1缺乏公开数据，因此使用Kling 2.0的Elo评分进行比较。总的来说，Seedance 1.0代表了视频生成技术的重大进步。"
  },
  {
    "id": "44253307",
    "title": "Show HN: Eyesite – Experimental website combining computer vision and web design",
    "url": "https://blog.andykhau.com/blog/eyesite",
    "summary": "This \"Show HN\" post details the creation of Eyesite, an experimental website designed to mimic the eye-tracking experience of Apple Vision Pros. Frustrated by the high cost of the device, the author built a web application using WebGazer.js for eye tracking, allowing users to interact with the site using their gaze and the spacebar for clicks, similar to the Apple Vision Pro's look-and-pinch interaction.\n\nThe project involved calibrating WebGazer.js by mapping gaze points to screen coordinates. Key design considerations included removing the visible \"eye cursor\" (a red dot) to enhance immersion and avoid distracting users and revealing tracking inaccuracies. Instead, the author implemented visual feedback, like a glow and pop effect on buttons when the user's gaze is detected within their boundaries.\n\nTo compensate for the inherent jitteriness of eye tracking, the user interface features large, easily targetable elements. The site also restricts access to devices below a minimum screen size. The author acknowledges the code's simplicity and encourages others to build upon the project, providing a link to the GitHub repository for the source code. The project serves as a demonstration of combining computer vision and web design for a unique user experience.\n",
    "chinese_title": "Show HN: Eyesite – 计算机视觉与网页设计结合的实验性网站",
    "chinese_summary": "这个“Show HN”帖子详细介绍了Eyesite的创建过程，这是一个旨在模仿Apple Vision Pro眼动追踪体验的实验性网站。作者因该设备价格高昂而感到沮丧，因此使用WebGazer.js构建了一个用于眼动追踪的Web应用程序，允许用户使用视线和空格键进行交互，类似于Apple Vision Pro的注视和捏合交互。\n\n该项目涉及校准WebGazer.js，将视线点映射到屏幕坐标。关键的设计考虑包括移除可见的“眼动光标”（一个红点），以增强沉浸感，避免分散用户的注意力并暴露跟踪不准确性。取而代之的是，作者实现了视觉反馈，例如当用户的视线被检测到在按钮边界内时，按钮会发光并弹出。\n\n为了弥补眼动追踪固有的抖动，用户界面采用了大型、易于瞄准的元素。该网站还限制了屏幕尺寸低于最低要求的设备访问。作者承认代码的简单性，并鼓励其他人在此项目的基础上进行构建，并提供了GitHub存储库的链接以供访问源代码。该项目展示了计算机视觉和网页设计相结合所能带来的独特用户体验。"
  },
  {
    "id": "44244879",
    "title": "Why Koreans ask what year you were born",
    "url": "https://bryanhogan.com/blog/korean-age",
    "summary": "This article explains why Koreans frequently ask for someone's birth year upon meeting them, a practice that can seem unusual to those from cultures where age is less emphasized. The core reason is that age determines social hierarchy and dictates how people address each other, particularly in the Korean language.\n\nKorean culture places significant importance on respecting elders, and this is reflected in the language's multiple speech levels, each indicating a different degree of politeness. Knowing someone's age allows a speaker to choose the appropriate level of formality. Younger individuals must use honorifics and titles when addressing older ones, while the older person can speak more casually. The direct translation of \"you\" (너 / neo) is often considered impolite, leading to the use of titles or other relationship-based terms.\n\nFurthermore, the article clarifies the difference between international age and Korean age. Korean age starts at one at birth and increases by one every January 1st, making it potentially one or two years higher than international age. While South Korea is adopting the international age standard, Korean age remains relevant in certain contexts, such as determining the legal drinking age. Asking for the birth year bypasses potential confusion that could arise from using differing age systems. Ultimately, determining the birth year simplifies navigating social interactions by establishing a clear understanding of relative age and the associated communication protocols within Korean society.\n",
    "chinese_title": "为什么韩国人会问你哪年出生的",
    "chinese_summary": "为什么韩国人初次见面总问年龄：韩国年龄文化解析"
  },
  {
    "id": "44259039",
    "title": "Researchers confirm two journalists were hacked with Paragon spyware",
    "url": "https://techcrunch.com/2025/06/12/researchers-confirm-two-journalists-were-hacked-with-paragon-spyware/",
    "summary": "A new report by The Citizen Lab confirms that two European journalists, Ciro Pellegrino and another unnamed journalist, were hacked using the Paragon \"Graphite\" spyware. This development deepens the ongoing spyware scandal in Italy, potentially implicating the Italian government.\n\nPellegrino, who works for Fanpage, was alerted by Apple about a mercenary spyware attack but wasn't initially told it was Paragon. This new evidence contradicts a report by Italy's parliamentary committee (COPASIR), which found no evidence of Fanpage's director Francesco Cancellato being spied on and didn't mention Pellegrino.\n\nThe Citizen Lab found that the unnamed journalist was targeted via a zero-click iMessage exploit, later patched by Apple. Both journalists were likely targeted by the same Paragon operator.\n\nPellegrino expressed concern that his civil rights were violated and questioned Prime Minister Meloni's silence on the issue. He suggested he might have been targeted to gain information about Fanpage, though he did not work on specific investigations.\n\nThe article mentions other individuals targeted with Paragon spyware, including Luca Casarini and Beppe Caccia from Mediterranea Saving Humans. While David Yambio, linked to the same organization, received a notification, it's unclear if he was targeted by Paragon or any government.\n\nParagon, through WestExec Advisors, stated they offered to assist the Italian government with investigating Cancellato's alleged hack but were refused, leading them to sever ties with Italy.\n",
    "chinese_title": "研究人员证实两名记者遭Paragon间谍软件入侵",
    "chinese_summary": "公民实验室的一份新报告证实，两名欧洲记者，Ciro Pellegrino和另一名未具名记者，被Paragon“石墨”间谍软件入侵。这一进展加深了意大利正在进行的间谍软件丑闻，可能牵涉到意大利政府。\n\n在Fanpage工作的Pellegrino收到了苹果公司关于雇佣兵间谍软件攻击的警报，但最初并未被告知是Paragon。这一新证据与意大利议会委员会(COPASIR)的一份报告相矛盾，该报告未发现Fanpage的负责人Francesco Cancellato被监视的证据，也未提及Pellegrino。\n\n公民实验室发现，未具名记者是通过一个零点击的iMessage漏洞被攻击的，该漏洞后来被苹果修复。两名记者很可能被同一Paragon运营商盯上。\n\nPellegrino表示担心他的公民权利受到侵犯，并质疑总理梅洛尼对此事的沉默。他暗示自己可能成为目标，以获取有关Fanpage的信息，尽管他没有参与具体的调查。\n\n该文章提到其他被Paragon间谍软件盯上的人，包括来自Mediterranea Saving Humans的Luca Casarini和Beppe Caccia。与同一组织有关联的David Yambio收到了通知，但尚不清楚他是否被Paragon或任何政府盯上。\n\nParagon通过WestExec Advisors表示，他们曾主动协助意大利政府调查Cancellato被指控的黑客行为，但遭到拒绝，导致他们与意大利断绝了联系。"
  },
  {
    "id": "44264376",
    "title": "The Case for Software Craftsmanship in the Era of Vibes",
    "url": "https://zed.dev/blog/software-craftsmanship-in-the-era-of-vibes",
    "summary": "This article advocates for prioritizing software craftsmanship in the age of AI-assisted coding. While AI tools like Zed can drastically increase the speed and volume of code production, the author argues that quality should become even more paramount. Instead of focusing solely on generating more code, developers should leverage AI to build more reliable, well-designed, and easily maintainable systems.\n\nThe author emphasizes the importance of system design, noting that shortcuts taken for short-term gains often lead to complex and unwieldy codebases that hinder future development, including the effectiveness of AI tools. They advocate for evaluating contributions based on their impact on system reliability, understandability, and changeability, not just lines of code touched.\n\nThe author shares their experience with building the Zed editor as an example of taking full ownership of the user experience. While the initial goal was high performance, achieving it required venturing beyond familiar web technologies, learning new languages and techniques, and effectively starting over. Today, AI tools like LLMs can significantly lower the barrier to entry for pursuing such ambitious projects, making learning and experimentation faster and easier.\n\nThe article concludes by announcing \"Agentic Engineering,\" a series of discussions and live events exploring the intersection of human craftsmanship and AI tools in software development, encouraging collective learning and knowledge sharing in this rapidly evolving landscape. The ultimate goal is to use AI to not just produce more software, but to significantly improve its overall quality.\n",
    "chinese_title": "软件工匠精神在氛围时代的重要性",
    "chinese_summary": "本文倡导在AI辅助编程时代优先考虑软件工艺。尽管像Zed这样的人工智能工具可以大幅提高代码生产的速度和数量，但作者认为质量应该变得更加重要。开发者不应仅仅专注于生成更多代码，而应利用AI来构建更可靠、设计良好且易于维护的系统。\n\n作者强调了系统设计的重要性，指出为追求短期利益而采取的捷径往往会导致复杂且难以管理的程式码库，从而阻碍未来的开发，包括AI工具的效率。他们提倡基于对系统可靠性、可理解性和可变更性的影响来评估贡献，而不仅仅是涉及的代码行数。\n\n作者分享了构建Zed编辑器的经验，以此为例说明完全拥有用户体验的重要性。虽然最初的目标是高性能，但实现这一目标需要突破熟悉的Web技术，学习新的语言和技术，并有效地从头开始。如今，像LLM这样的人工智能工具可以显著降低追求此类雄心勃勃项目的门槛，使学习和实验变得更快更容易。\n\n本文最后宣布推出“智能体工程”，这是一系列讨论和现场活动，旨在探索人类工艺和AI工具在软件开发中的交汇点，鼓励在这个快速发展的领域进行集体学习和知识共享。最终目标是利用AI不仅生产更多软件，而且显著提高其整体质量。"
  },
  {
    "id": "44255608",
    "title": "Agentic Coding Recommendations",
    "url": "https://lucumr.pocoo.org/2025/6/12/agentic-coding/",
    "summary": "Armin Ronacher's article discusses practical recommendations for agentic coding, primarily based on experiences using Claude Code (specifically the cheaper Sonnet model). He emphasizes token efficiency by minimizing screenshots and browser interactions.\n\nKey takeaways include:\n\n*   **Basic Setup:** Disabling permission checks (with Docker for risk management) and leveraging MCP (Machine Communication Protocol) for tool access. Ronacher uses MCP mainly when direct tool access is unreliable.\n*   **Language Choice:** Recommends Go for backend projects due to its explicit context system, test caching, simplicity, structural interfaces, and ecosystem stability. Python is noted as problematic due to magic, complex runtime challenges, and slow execution.\n*   **Frontend:** Tailwinds, React, Tanstack, Vite\n*   **Tooling:** Any interactive entity can be a tool. Prioritize speed, user-friendliness, crash tolerance (not hangs), and proper debugging. Makefiles and logging are crucial for observability.\n*   **Speed:** Fast tool responses are vital, including emergent tools written by agents themselves.\n*   **Stability and Copy/Paste:** Stable ecosystems are preferred. Be conservative with library upgrades and favor code generation over dependencies.\n*   **Simple Code:** Agentic coding benefits from simple, descriptive code with clear function names and minimal clever hacks.\n*   **Parallelization:** Enable agents to run concurrently, and refactor projects before they become too complex for the AI to handle effectively.\n*   **Overall Goal:** Focus on writing better, more maintainable code using agents, emphasizing simplicity, stability, observability, and smart parallelization.\n",
    "chinese_title": "自主编码建议",
    "chinese_summary": "Armin Ronacher关于自主编码的实践建议：基于Claude Code (Sonnet模型)的经验\n\n主要观点包括：\n\n*   **基本设置:** 禁用权限检查（使用Docker进行风险管理），利用MCP（机器通信协议）进行工具访问。 Ronacher主要在直接工具访问不可靠时使用MCP。\n*   **语言选择:** 推荐使用Go进行后端项目，因为它具有显式的上下文系统、测试缓存、简单性、结构化接口和生态系统稳定性。 Python因其魔术特性、复杂的运行时挑战和缓慢的执行速度而被认为存在问题。\n*   **前端:** Tailwinds, React, Tanstack, Vite\n*   **工具:** 任何交互实体都可以是一个工具。优先考虑速度、用户友好性、崩溃容错性（而不是挂起）和正确的调试。 Makefiles和日志对于可观察性至关重要。\n*   **速度:** 快速的工具响应至关重要，包括代理自身编写的新兴工具。\n*   **稳定性和复制/粘贴:** 优先选择稳定的生态系统。保守地进行库升级，并倾向于代码生成而不是依赖项。\n*   **简洁代码:** 自主编码受益于简洁、描述性的代码，具有清晰的函数名称和最少的巧妙技巧。\n*   **并行化:** 使代理能够并发运行，并在项目变得过于复杂以至于AI无法有效处理之前对其进行重构。\n*   **总体目标:** 专注于使用代理编写更好、更易于维护的代码，强调简洁性、稳定性、可观察性和智能并行化。"
  },
  {
    "id": "44260810",
    "title": "GCP Outage",
    "url": "https://status.cloud.google.com/",
    "summary": "This Google Cloud Platform (GCP) Service Health dashboard reports a recent widespread service issue that impacted multiple GCP products and locations. The incident lasted for 7 hours and 27 minutes and was closed at 8:26 PDT on June 13, 2025.\n\nThe outage impacted a significant number of services, including API Gateway, Agent Assist, AlloyDB for PostgreSQL, and 52 others. The affected locations spanned multiple regions, including Africa, Asia, and others, totaling 60 regions.\n\nThe dashboard provides a tool to check the current status of various GCP services by product and location (Americas, Europe, Asia Pacific, Middle East, and Africa, plus multi-region and global services). It lists a comprehensive array of GCP products and indicates their current availability. The information is updated regularly, with the last update occurring on June 13, 2025, at 10:40 PDT. Users experiencing issues not listed are encouraged to contact Support. The dashboard also offers a \"Personalized Service Health\" feature providing a tailored view of incidents affecting individual Google Cloud projects.\n",
    "chinese_title": "GCP 服务中断",
    "chinese_summary": "此 Google Cloud Platform (GCP) 服务健康状况信息中心报告了近期影响多个 GCP 产品和位置的大范围服务问题。该事件持续了 7 小时 27 分钟，并于 2025 年 6 月 13 日太平洋夏令时 8:26 结束。\n\n此次中断影响了大量服务，包括 API Gateway、Agent Assist、AlloyDB for PostgreSQL 以及其他 52 项服务。受影响的位置遍布多个区域，包括非洲、亚洲和其他地区，总计 60 个区域。\n\n该信息中心提供了一个工具，可以按产品和位置（美洲、欧洲、亚太地区、中东和非洲，以及多区域和全球服务）查看各种 GCP 服务的当前状态。它列出了全面的 GCP 产品阵列，并表明了其当前的可用性。该信息会定期更新，上次更新时间为 2025 年 6 月 13 日太平洋夏令时 10:40。鼓励遇到未列出问题的用户联系支持。该信息中心还提供了一项“个性化服务健康状况”功能，可提供影响各个 Google Cloud 项目的事件的定制视图。"
  },
  {
    "id": "44267989",
    "title": "Anker is recalling over 1.1M power banks due to fire and burn risks",
    "url": "https://www.theverge.com/news/686084/anker-recall-uscpsc-power-bank-battery-powercore-a1263",
    "summary": "Anker is recalling over 1.1 million PowerCore 10000 power banks (model A1263) in the US due to a potential fire and burn risk stemming from a lithium-ion battery issue. There have been 19 reported incidents of fires and explosions causing minor burns and property damage exceeding $60,700.\n\nThe affected power banks were sold online through Amazon, Newegg, and eBay between June 2016 and December 2022. Consumers can check if their unit is affected by visiting Anker's website and verifying the serial number.\n\nAnker is offering affected customers the choice of a $30 Anker.com gift card or a free replacement 10,000mAh Anker power bank (model A1388). To claim either option, customers must submit photos of the power bank with the submission date and the word \"recall\" or \"recalled\" written on it, as well as a photo showing the model and serial number. A purchase receipt is requested but not mandatory.\n\nAnker emphasizes the importance of safely disposing of the recalled power banks at designated facilities for lithium-ion batteries, such as those listed on the EPA website, due to the fire risk. The recall also serves as a reminder to monitor older lithium-ion batteries for issues like overheating or swelling and to dispose of them properly if problems are suspected. The article suggests considering upgrading to solid-state batteries as a safer and longer-lasting alternative in the future.\n",
    "chinese_title": "Anker因火灾和烧伤风险召回超过110万个充电宝",
    "chinese_summary": "Anker因锂离子电池问题在美国召回超过110万个PowerCore 10000充电宝（型号A1263），存在潜在火灾和烧伤风险。已报告19起火灾和爆炸事件，造成轻微烧伤和超过60,700美元的财产损失。\n\n受影响的充电宝于2016年6月至2022年12月期间通过亚马逊、新蛋和eBay等在线平台销售。消费者可访问Anker网站并验证序列号，以确认其设备是否受影响。\n\nAnker为受影响的客户提供两种选择：一张价值30美元的Anker.com礼品卡或免费更换一个10,000mAh的Anker充电宝（型号A1388）。要获得任一选项，客户必须提交充电宝的照片，照片上需注明提交日期并写有“recall”或“recalled”字样，以及一张显示型号和序列号的照片。建议提供购买凭证，但非强制性。\n\nAnker强调，由于存在火灾风险，务必在指定的锂离子电池处理设施（例如EPA网站上列出的设施）安全处置召回的充电宝。此次召回也提醒人们关注旧锂离子电池是否存在过热或膨胀等问题，如果怀疑有问题，应妥善处理。文章建议考虑升级到固态电池，作为未来更安全、更持久的替代方案。"
  },
  {
    "id": "44261238",
    "title": "Use-after-free in CAN BCM subsystem leading to information disclosure (CVE-2023",
    "url": "https://allelesecurity.com/use-after-free-vulnerability-in-can-bcm-subsystem-leading-to-information-disclosure-cve-2023-52922/",
    "summary": "This article details a use-after-free vulnerability (CVE-2023-52922) discovered in the CAN BCM subsystem of the Linux kernel, specifically affecting Red Hat Enterprise Linux 9 (RHEL 9). The vulnerability allows unprivileged users to read kernel memory, potentially disclosing sensitive information.\n\nThe root cause lies in the `bcm_release()` function, where `bcm_remove_op()` frees `bcm_op` objects associated with a socket's transmit and receive operations *before* the corresponding proc entry is removed. A concurrent call to `bcm_proc_show()` to read the proc entry can then access these freed objects, leading to a use-after-free condition.\n\nThe `bcm_op` struct, 472 bytes in size, is allocated from the kmalloc-512 cache.  The article explores three exploitation approaches: reclaiming the freed object with a user-controlled object to dereference an arbitrary pointer (failed due to inability to control list head), triggering an infinite loop by reallocating the object with a System V IPC message queue object (msg_msg), and attempting to leak freelist pointers (presumably also failed as it's not detailed).\n\nWhile the vulnerability was present in RHEL 8 code, it couldn't be exploited because RHEL 8 lacks Virtual CAN tunnel cross-namespace communication (VXCAN) support.  The vulnerability was fixed upstream in July 2023 and backported to RHEL 9 in March 2025.  The article concludes by highlighting a pattern of vulnerabilities in the CAN BCM subsystem.\n",
    "chinese_title": "CAN BCM子系统中释放后使用漏洞导致信息泄露 (CVE-2023",
    "chinese_summary": "本文详细介绍了Linux内核CAN BCM子系统中发现的一个释放后重用漏洞（CVE-2023-52922），该漏洞尤其影响Red Hat Enterprise Linux 9 (RHEL 9)。该漏洞允许非特权用户读取内核内存，可能泄露敏感信息。\n\n根本原因在于`bcm_release()`函数，其中`bcm_remove_op()`在删除对应的proc条目*之前*释放了与套接字的发送和接收操作相关的`bcm_op`对象。并发调用`bcm_proc_show()`读取proc条目时，可以访问这些已释放的对象，从而导致释放后重用情况。\n\n`bcm_op`结构体大小为472字节，从kmalloc-512缓存中分配。本文探讨了三种利用方法：使用用户控制的对象回收已释放的对象以解引用任意指针（由于无法控制链表头而失败）、通过使用System V IPC消息队列对象(msg_msg)重新分配该对象来触发无限循环，以及尝试泄露空闲列表指针（可能也失败了，因为它没有详细说明）。\n\n虽然该漏洞存在于RHEL 8代码中，但由于RHEL 8缺乏虚拟CAN隧道跨命名空间通信(VXCAN)支持，因此无法利用。该漏洞已于2023年7月在上游修复，并在2025年3月反向移植到RHEL 9。文章最后强调了CAN BCM子系统中存在的一种漏洞模式。"
  },
  {
    "id": "44259132",
    "title": "macOS Tahoe brings a new disk image format",
    "url": "https://eclecticlight.co/2025/06/12/macos-tahoe-brings-a-new-disk-image-format/",
    "summary": "This article introduces ASIF, a new disk image format in macOS Tahoe (macOS 26) designed to overcome performance limitations of older formats like UDSP. ASIF promises near-native speeds, making it especially beneficial for lightweight virtualization on Apple silicon Macs.\n\nCurrently, ASIF images can only be created via Disk Utility or the `diskutil` command in Tahoe, using the `--format ASIF` option.  While they can be used in macOS Sequoia (macOS 15.5), they cannot be *created* there. ASIF images are sparse files in APFS, meaning their size on the host system reflects the data stored within.\n\nTesting reveals significantly improved read/write speeds compared to older disk image formats. A 100GB ASIF image achieved speeds of 5.8/6.6 GB/s (read/write) for unencrypted APFS and 4.8/4.6 GB/s for encrypted APFS on a MacBook Pro M3 Pro. When the compressed ASIF image was transferred to a Mac mini M4 Pro running Sequoia, speeds reached 5.5/8.3 GB/s.\n\nApple recommends ASIF for VM backing stores due to its efficiency.  However, support across different macOS versions remains unclear. ASIF offers performance advantages over sparse bundles and simplifies storage with a single backing file.\n\nThe article concludes that ASIF should be the preferred choice for general-purpose disk images in Tahoe, especially for VMs. The author hopes for a proper API for ASIF creation beyond the `diskutil` command and anticipates its support in tools like DropDMG.\n",
    "chinese_title": "macOS Tahoe 引入新的磁盘映像格式",
    "chinese_summary": "本文介绍ASIF，一种macOS Tahoe (macOS 26) 中新的磁盘映像格式，旨在克服UDSP等旧格式的性能限制。ASIF有望实现接近原生速度，使其特别有利于Apple芯片Mac上的轻量级虚拟化。\n\n目前，ASIF映像只能通过Tahoe中的“磁盘工具”或`diskutil`命令创建，使用`--format ASIF`选项。 虽然它们可以在macOS Sequoia (macOS 15.5)中使用，但不能在那里*创建*。 ASIF映像是APFS中的稀疏文件，这意味着它们在主机系统上的大小反映了其中存储的数据。\n\n测试显示，与旧的磁盘映像格式相比，读/写速度有了显著提高。 在MacBook Pro M3 Pro上，一个100GB的ASIF映像在未加密的APFS中实现了5.8/6.6 GB/s（读/写）的速度，在加密的APFS中实现了4.8/4.6 GB/s的速度。当压缩的ASIF映像传输到运行Sequoia的Mac mini M4 Pro时，速度达到了5.5/8.3 GB/s。\n\nApple建议使用ASIF作为VM后备存储，因为它具有高效性。 然而，对不同macOS版本的支持仍然不明朗。 ASIF相比稀疏包提供了性能优势，并用单个后备文件简化了存储。\n\n本文得出结论，ASIF应该是Tahoe中通用磁盘映像的首选，尤其是对于VM。 作者希望除了`diskutil`命令之外，还能有一个用于创建ASIF的适当API，并期待DropDMG等工具的支持。"
  },
  {
    "id": "44269503",
    "title": "HTML WARDen - an HTML-based wiki",
    "url": "https://ratfactor.com/htmlwarden/",
    "summary": "HTML WARDen is a PHP-based wiki that uses HTML as its storage format. Designed as a weekend project, it boasts no dependencies beyond PHP 7.x+, flat file storage, and version control, saving old page versions. A key feature is its side-by-side HTML editor, offering both rich text and code views. It includes user logins and per-page edit locking. File uploads are planned for the future.\n\nThe author provides a detailed \"making of\" series, \"The Wiki Weekend,\" which covers the project's development process, including motivations, design decisions, storage solutions, user authentication, locking mechanisms, and final touches. This series serves as a guide for those interested in creating their own wiki system.\n\nHTML WARDen is named in honor of Ward Cunningham, the creator of the original WikiWikiWeb, emphasizing its roots in wiki technology.\n",
    "chinese_title": "HTML WARDen - 基于HTML的维基",
    "chinese_summary": "HTML WARDen：一个使用HTML作为存储格式的PHP Wiki。作为一个周末项目，它无需任何PHP 7.x+以上的依赖，采用扁平文件存储和版本控制，保存旧页面版本。其关键特性是并排HTML编辑器，提供富文本和代码视图。它包含用户登录和按页面编辑锁定功能。文件上传计划在未来实现。\n\n作者提供了一个详细的“制作过程”系列，“Wiki周末”，涵盖了该项目的开发过程，包括动机、设计决策、存储解决方案、用户身份验证、锁定机制和最终润色。该系列可作为有兴趣创建自己的Wiki系统的人的指南。\n\nHTML WARDen以致敬原始WikiWikiWeb的创建者Ward Cunningham命名，强调其在wiki技术中的根源。"
  },
  {
    "id": "44259844",
    "title": "Sorcerer (YC S24) raises $3.9M to launch more weather balloons",
    "url": "https://www.axios.com/pro/climate-deals/2025/06/12/sorcerer-seed-weather-balloons",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "巫师公司(YC S24)融资390万美元以发射更多气象气球",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "44221655",
    "title": "How I Program with Agents",
    "url": "https://crawshaw.io/blog/programming-with-agents",
    "summary": "This article explores the use of LLM \"agents\" for programming, defining an agent as a for-loop containing an LLM call that can execute commands and see their output. The author argues that agents, equipped with tools like `bash`, `patch`, and web search, significantly improve upon the limitations of raw LLMs by providing environmental feedback. This feedback allows agents to leverage compilers, documentation, and test suites for better code generation, API use, and dependency management.\n\nThe benefits include improved API use, reduced syntax errors, better dependency management, and the ability to handle larger codebases by selectively reading relevant parts. Agents can also test and tweak code based on end-to-end rendering and server logs. The downside is increased time and cost (currently), but the author believes these will decrease as technology improves.\n\nThe author provides two examples. The first illustrates using an agent to implement GitHub App authentication, highlighting its efficiency despite initial security and performance issues. The second showcases how to guide the agent to follow a specific SQL convention. The author emphasizes that while agents may make mistakes, their ability to automate tedious tasks and accelerate development is invaluable.\n\nFinally, the author emphasizes the value of agents in both code generation and maintenance, highlighting their ability to remove code as well as add it, and argues against limiting views of programming solely to long-term, heavily used projects.\n",
    "chinese_title": "我如何使用Agent进行编程",
    "chinese_summary": "本文探讨了使用LLM“代理”进行编程的方法，将代理定义为包含LLM调用的for循环，该循环可以执行命令并查看其输出。作者认为，配备了`bash`、`patch`和网络搜索等工具的代理，通过提供环境反馈，显著改善了原始LLM的局限性。这种反馈使代理能够利用编译器、文档和测试套件来更好地进行代码生成、API使用和依赖管理。\n\n其益处包括改进的API使用、减少的语法错误、更好的依赖管理，以及通过选择性地读取相关部分来处理更大的代码库的能力。代理还可以根据端到端渲染和服务器日志来测试和调整代码。缺点是（目前）时间和成本增加，但作者认为随着技术的进步，这些将会减少。\n\n作者提供了两个例子。第一个例子说明了使用代理来实现GitHub App身份验证，突出了其效率，尽管存在初始的安全和性能问题。第二个例子展示了如何引导代理遵循特定的SQL约定。作者强调，虽然代理可能会犯错误，但它们自动化繁琐任务和加速开发的能力是无价的。\n\n最后，作者强调了代理在代码生成和维护方面的价值，突出了它们移除代码以及添加代码的能力，并反对将编程的观点仅仅局限于长期、大量使用的项目。"
  },
  {
    "id": "44240999",
    "title": "OpenAI o3-pro",
    "url": "https://help.openai.com/en/articles/9624314-model-release-notes",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "OpenAI o3-pro",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "44245709",
    "title": "Show HN: DIY virtual HDMI monitor using \"AR\" glasses",
    "url": "https://github.com/mgschwan/viture_virtual_display",
    "summary": "This \"Show HN\" post introduces a DIY project, `v4l2_gl`, that creates a virtual HDMI monitor using \"AR\" glasses, specifically targeting Viture headsets. It captures video from an HDMI-in source (ideally an Orange Pi 5 Plus with a specific overlay), converts the frames to RGB, and displays them on a textured quad in an OpenGL window within the AR glasses. The project integrates Viture headset IMU data for head-tracking, allowing the user to look around the virtual display.\n\nThe project is in early development and requires a Linux-based OS with OpenGL, GLUT, libv4l2, and optionally libhidapi-dev. Compilation instructions are provided for both a reverse-engineered Viture protocol (for ARM) and the official Viture SDK (for X86). The application is run from the command line with various options to control the video device, fullscreen mode, Viture IMU integration, test patterns, plane distance, and plane scale. A head-shaking gesture allows rotation reset.\n\nFuture development plans include supporting USB HDMI capture cards (for devices like Raspberry Pi), fixing errors in the reverse-engineered SDK, improving performance, supporting MJPEG for USB capture cards, adding more gestures, and implementing a curved screen option. It is important to note that performance still needs considerable improvements.\n",
    "chinese_title": "Show HN: 用“AR”眼镜自制虚拟HDMI显示器",
    "chinese_summary": "使用 AR 眼镜创建虚拟 HDMI 显示器（`v4l2_gl` DIY 项目）"
  },
  {
    "id": "44224729",
    "title": "How long it takes to know if a job is right for you or not",
    "url": "https://charity.wtf/2025/06/08/on-how-long-it-takes-to-know-if-a-job-is-right-for-you-or-not/",
    "summary": "This article explores how quickly one can determine if a new job is a good fit. The author argues that your initial gut reaction, typically within the first week, is usually a reliable indicator of long-term suitability.\n\nDrawing on personal experiences across six different employers, the author describes experiencing either excitement and a desire to measure up or a sense of dread from the outset. These initial feelings consistently aligned with their overall experience at each company.\n\nWhile acknowledging that companies can change, the author believes that they generally stay on their current trajectory unless drastic action is taken. This is particularly important for managers, whose alignment with the company is crucial, as they represent the company to their team and external stakeholders. Misalignment can lead to managers feeling conflicted and potentially undermining the company.\n\nThe author emphasizes that while individual contributors (ICs) can sometimes \"phone it in\" when misaligned, managers require genuine alignment to effectively perform their duties, which involve crafting and nurturing complex sociotechnical systems.\n\nThe article concludes with advice drawn from a conversation with a friend in a senior management role who realized six months in that the job wasn't right. The key takeaway is to trust your initial intuition, reflect on what red flags were missed during the interview process, and view the experience as a learning opportunity. The author uses the metaphor of the \"chicken and the pig\" to illustrate the commitment required of managers, urging readers to carefully consider who they \"give their bacon to.\"\n",
    "chinese_title": "了解一份工作是否适合你，需要多久",
    "chinese_summary": "如何快速判断新工作是否合适\n本文探讨了如何快速判断一份新工作是否合适。作者认为，你最初的直觉，通常在第一周内，通常是长期适应性的可靠指标。\n\n作者结合在六家不同雇主的工作经历，描述了从一开始就体验到兴奋和想要达标的渴望，或是一种恐惧感。这些最初的感受始终与他们在每家公司的整体体验相符。\n\n虽然作者承认公司可能会发生变化，但他认为，除非采取 drastic 行动，否则它们通常会保持目前的轨迹。这对管理者尤其重要，因为管理者与公司的契合度至关重要，因为他们代表公司面向团队和外部利益相关者。不契合可能会导致管理者感到矛盾，并可能破坏公司。\n\n作者强调，虽然个人贡献者（ICs）在不契合时有时可以“敷衍了事”，但管理者需要真正的契合才能有效地履行职责，这涉及到构建和培养复杂的社会技术系统。\n\n文章最后以与一位高级管理职位的朋友的对话中得出的建议作为结尾，这位朋友在六个月后意识到这份工作并不适合自己。最重要的是相信你的最初直觉，反思在面试过程中错过了哪些危险信号，并将这段经历视为学习机会。作者用“鸡和猪”的比喻来说明管理者所需的投入，敦促读者仔细考虑他们会“把自己的培根献给谁”。"
  },
  {
    "id": "44261064",
    "title": "Cloudflare was down",
    "url": "https://www.cloudflarestatus.com/incidents/25r9t0vz99rp",
    "summary": "On June 12, 2025, Cloudflare experienced a broad service outage impacting several of its core products. The initial issues, starting around 18:19 UTC, caused intermittent failures in services like Access, WARP, Durable Objects (SQLite backed), Workers KV, Realtime, Workers AI, Stream, and parts of the Cloudflare dashboard. The root cause was identified as an outage of a third-party service crucial to Cloudflare's Workers KV service.\n\nThis KV service outage then cascaded, rendering unavailable dependent products such as Browser Isolation, Browser Rendering, Turnstile, AI Gateway, and AutoRAG, in addition to the initially impacted services. Cloudflare engineers immediately began working to restore services.\n\nThe company provided regular updates on the recovery process. Services began to recover around 19:12 UTC, with further improvements noted throughout the evening. By 20:32 UTC, WARP and Turnstile were operational, and the core KV service was restored, bringing dependent products back online. Cloudflare reported that services were recovering quickly around the globe, expecting a steady drop in impact.\n\nBy 20:57 UTC, all Cloudflare services were reported as fully operational, and the incident was moved to a monitoring phase to ensure sustained stability. The incident was officially resolved by 21:31 UTC. The outage affected Cloudflare Sites and Services, including Access, Dashboard, Durable Objects, Realtime SFU, Realtime TURN Service, RealtimeKit, Stream, Waiting Room, WARP, Workers AI, and Workers KV.\n",
    "chinese_title": "Cloudflare宕机了",
    "chinese_summary": "2025年6月12日，Cloudflare发生大范围服务中断，影响其多项核心产品。最初的问题始于UTC时间18:19左右，导致Access、WARP、Durable Objects (SQLite backed)、Workers KV、Realtime、Workers AI、Stream以及Cloudflare仪表板的部分服务出现间歇性故障。根本原因被确定为对Cloudflare的Workers KV服务至关重要的第三方服务中断。\n\n此KV服务中断随后蔓延，导致Browser Isolation、Browser Rendering、Turnstile、AI Gateway和AutoRAG等依赖产品以及最初受影响的服务不可用。Cloudflare工程师立即开始工作以恢复服务。\n\n该公司定期提供恢复过程的最新信息。服务于UTC时间19:12左右开始恢复，并在整个晚上都观察到进一步的改进。到UTC时间20:32，WARP和Turnstile已恢复运行，核心KV服务也已恢复，使依赖产品重新上线。Cloudflare报告说，全球各地的服务正在迅速恢复，预计影响将稳步下降。\n\n到UTC时间20:57，所有Cloudflare服务均已报告为完全运行，该事件已进入监控阶段，以确保持续的稳定性。该事件于UTC时间21:31正式解决。中断影响了Cloudflare站点和服务，包括Access、Dashboard、Durable Objects、Realtime SFU、Realtime TURN Service、RealtimeKit、Stream、Waiting Room、WARP、Workers AI和Workers KV。"
  },
  {
    "id": "44262799",
    "title": "Humans have nasal respiratory fingerprints",
    "url": "https://www.cell.com/current-biology/fulltext/S0960-9822(25)00583-4",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "人类有鼻腔呼吸指纹",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "44236997",
    "title": "Magistral — the first reasoning model by Mistral AI",
    "url": "https://mistral.ai/news/magistral",
    "summary": "Mistral AI has announced Magistral, its first reasoning model, designed to excel in domain-specific, transparent, and multilingual reasoning. It comes in two versions: Magistral Small, a 24B parameter open-source model, and Magistral Medium, a more powerful enterprise version. Magistral Medium achieved high scores on the AIME2024 benchmark.\n\nKey features include native reasoning across languages, suitability for enterprise use cases like structured calculations and decision trees, and faster response times (up to 10x) via Le Chat's \"Think mode\" and \"Flash Answers.\" The release is accompanied by a research paper detailing evaluations, training infrastructure, and the reinforcement learning algorithm used.\n\nMagistral emphasizes transparent, traceable thought processes. It supports multiple languages, including English, French, Spanish, German, Italian, Arabic, Russian, and Simplified Chinese. It is suited for applications requiring in-depth reasoning, like legal research, financial forecasting, software development, and creative storytelling. It is also useful for regulated industries such as legal, finance, and healthcare, because it meets compliance requirements.\n\nMagistral Small is available for download under the Apache 2.0 license. A preview of Magistral Medium is available in Le Chat and via API. It is also available on Amazon SageMaker and will soon be on IBM WatsonX, Azure AI, and Google Cloud Marketplace. Mistral AI is also hiring to further develop AI innovation.\n",
    "chinese_title": "Magistral — Mistral AI 的首个推理模型",
    "chinese_summary": "Mistral AI 发布 Magistral：其首个推理模型，专为擅长特定领域、透明化和多语种推理而设计。它有两个版本：Magistral Small，一个 240 亿参数的开源模型；以及 Magistral Medium，一个更强大的企业版本。Magistral Medium 在 AIME2024 基准测试中取得了高分。\n\n主要功能包括跨语言的本地推理能力、适用于结构化计算和决策树等企业用例，以及通过 Le Chat 的“思考模式”和“闪速回答”实现更快的响应速度（高达 10 倍）。此次发布还附带一篇研究论文，详细介绍了评估、训练基础设施以及所使用的强化学习算法。\n\nMagistral 强调透明、可追溯的思考过程。它支持多种语言，包括英语、法语、西班牙语、德语、意大利语、阿拉伯语、俄语和简体中文。它适用于需要深入推理的应用，如法律研究、财务预测、软件开发和创意故事讲述。由于其符合合规性要求，它也适用于法律、金融和医疗保健等受监管的行业。\n\nMagistral Small 可根据 Apache 2.0 许可下载。Magistral Medium 的预览版可在 Le Chat 中以及通过 API 获取。它还可以在 Amazon SageMaker 上使用，并将很快在 IBM WatsonX、Azure AI 和 Google Cloud Marketplace 上推出。Mistral AI 也在招聘以进一步发展人工智能创新。"
  },
  {
    "id": "44212911",
    "title": "Lessons from That 1834 Landscape Gardening Guidebook",
    "url": "https://fi-le.net/pueckler/",
    "summary": "This article explores lessons in environment design gleaned from Hermann Ludwig Heinrich Count of Pückler-Muskau's 1834 landscape gardening guidebook, \"Hints on Landscape Gardening.\" The author argues that these lessons are applicable not just to parks but to broader design fields like IDEs, open-world RPGs, and even pet mazes.\n\nThe first lesson focuses on the artificiality of winding paths in parks. To combat the feeling of pointlessness, the author emphasizes the importance of creating a perceived reason for curves by *showing the obstacle* that necessitates the deviation.\n\nThe second lesson addresses the tendency to showcase grand features like castles. Instead, the article advocates for controlled reveals, *hiding the castle a bit* to build anticipation and drama. This involves strategically using foreground elements like shrubbery to obscure and then unveil the desired view. Examples are given to the Legend of Zelda series, where constant visibility diminishes the landscape, and Metal Gear Solid V, where constrained views enhance engagement.\n\nFinally, the article highlights the importance of authenticity and purpose. Rather than simply simulating nature, the author stresses the need to *emulate, not simulate*.  Buildings should have a function, not just be decorative. Even going so far as creating dedicated altars to local gods to connect the place to its history. The overall goal is to bring the thoughtful design principles found in Pückler's parks to our modern digital and physical environments.\n",
    "chinese_title": "1834年景观园艺指南的启示",
    "chinese_summary": "本文探讨了从赫尔曼·路德维希·海因里希·冯·普克勒-穆斯考伯爵1834年的景观园林指南《景观园林提示》中汲取的环境设计经验。作者认为，这些经验不仅适用于公园，也适用于更广泛的设计领域，如集成开发环境、开放世界角色扮演游戏，甚至宠物迷宫。\n\n第一个经验侧重于公园中蜿蜒小径的人为性。为了消除无意义感，作者强调通过*展示导致偏离的障碍*来创造曲线的感知理由的重要性。\n\n第二个经验针对的是展示城堡等宏伟景观的倾向。相反，本文提倡有控制地揭示，*稍微隐藏城堡*以建立期待和戏剧性。这涉及到策略性地使用前景元素，如灌木丛，来遮蔽然后揭示所需的景色。文中给出了《塞尔达传说》系列的例子，其中持续的可见性削弱了景观效果，以及《合金装备V》，其中受限的视野增强了参与感。\n\n最后，本文强调了真实性和目的性的重要性。作者强调需要*模仿，而非模拟*，而不是简单地模拟自然。建筑物应该具有功能，而不仅仅是装饰性的。甚至可以建立专门祭祀当地神灵的祭坛，将该地点与其历史联系起来。总体目标是将普克勒公园中发现的周到设计原则带入我们现代的数字和物理环境。"
  },
  {
    "id": "44211971",
    "title": "Plants hear their pollinators, and produce sweet nectar in response",
    "url": "https://www.cbc.ca/listen/live-radio/1-51-quirks-and-quarks/clip/16150976-plants-hear-pollinators-produce-sweet-nectar-response",
    "summary": "Okay, here's a summary of the article \"Plants hear their pollinators, and produce sweet nectar in response\" based on the information likely contained within the CBC Radio's Quirks & Quarks clip:\n\nThe article likely discusses research showing that certain plants can detect the sounds of their pollinators, specifically bees, and respond by producing sweeter nectar. The study, conducted on evening primroses (likely *Oenothera drummondii* as this is the species most commonly cited in similar studies), suggests that plants can \"hear\" the vibrations of bee wings through the flower petals. These vibrations then trigger a physiological response in the plant.\n\nThe key finding is that the plants exposed to bee-like sounds produced nectar with a higher sugar concentration compared to control plants that were not exposed to these sounds. The increased nectar sweetness likely serves to attract more bees, thereby improving the plant's chances of pollination and reproductive success. The research highlights the complex and sophisticated interactions between plants and animals, suggesting that plants are not passive participants in the pollination process, but actively respond to their environment. The study implies that plants may have evolved a sensory system capable of detecting and interpreting specific environmental cues, allowing them to optimize their reproductive strategies. The study did not necessarily prove that the plants \"hear\" in the way humans do, but rather detect and react to the vibrations produced by pollinators.\n",
    "chinese_title": "植物能听到它们的传粉者，并产生甜美的花蜜作为回应。",
    "chinese_summary": "好的，以下是根据加拿大广播公司（CBC Radio）的“奇闻怪事”（Quirks & Quarks）节目片段中可能包含的信息，对文章“植物能听见它们的授粉者，并产生更甜的花蜜作为回应”的摘要：\n\n该文章可能讨论了一项研究，该研究表明某些植物可以探测到其授粉者（特别是蜜蜂）的声音，并通过产生更甜的花蜜来做出回应。这项对月见草（很可能是 *Oenothera drummondii*，因为这是类似研究中最常被引用的物种）进行的研究表明，植物可以通过花瓣“听到”蜜蜂翅膀的振动。这些振动会触发植物的生理反应。\n\n主要发现是，暴露于类似蜜蜂声音的植物产生的花蜜的糖浓度高于未暴露于这些声音的对照植物。花蜜甜度的增加可能旨在吸引更多的蜜蜂，从而提高植物的授粉和繁殖成功率。这项研究突出了植物和动物之间复杂而精密的相互作用，表明植物不是授粉过程中的被动参与者，而是积极地对其环境做出反应。该研究暗示植物可能进化出一种感觉系统，能够检测和解释特定的环境线索，从而使它们能够优化其繁殖策略。该研究不一定证明植物像人类那样“听”，而是检测并对授粉者产生的振动做出反应。"
  },
  {
    "id": "44219680",
    "title": "Researchers discover evidence in the mystery of America's 'Lost Colony'",
    "url": "https://www.foxnews.com/travel/mystery-americas-lost-colony-may-finally-solved-after-440-years-archaeologists-say",
    "summary": "Archaeologists believe they've found evidence resolving the mystery of the Roanoke \"Lost Colony,\" which disappeared from Roanoke Island in 1590. Led by archaeologist Mark Horton, researchers have spent a decade investigating the fate of the English settlers. They focused on trash heaps (middens) on Hatteras Island, previously known as Croatoan Island, hypothesizing that the colonists assimilated into the local Croatoan Native American population.\n\nThe \"smoking gun\" is the discovery of hammerscale, tiny iron flakes from forging, indicating iron-working on Hatteras Island. Horton argues this is definitive proof of English colonists, as Native Americans lacked the technology for iron-working at that time. The hammerscale was found in layers dating back to the late 16th or early 17th century, aligning with the period when the colony vanished.\n\nIn addition to the hammerscale, the archaeologists found other 16th and 17th century English artifacts like guns, nautical fittings, cannonballs, wine glasses, an engraved slate, and beads at the site. Horton believes this supports the theory of assimilation and dismisses the possibility of the colonists being killed or dying from starvation. He mentions historical evidence from the 1700s describing people with European features and knowledge of reading, further supporting the assimilation theory. While Horton acknowledges the evidence is strong, he believes the legend of the Lost Colony will likely persist.\n",
    "chinese_title": "研究人员发现美国“失落殖民地”谜团的证据",
    "chinese_summary": "考古学家认为他们发现了解决罗阿诺克“失落殖民地”之谜的证据，该殖民地于1590年从罗阿诺克岛消失。在考古学家马克·霍顿的带领下，研究人员花费了十年时间调查英国殖民者的命运。他们专注于哈特拉斯岛（之前被称为克罗托安岛）上的垃圾堆（灰堆），假设殖民者融入了当地的克罗托安美洲原住民群体。\n\n“确凿证据”是在哈特拉斯岛上发现的锤击鳞片，即锻造过程中产生的微小铁屑，表明那里存在铁器制造活动。霍顿认为这是英国殖民者的确凿证据，因为当时的美洲原住民缺乏铁器制造技术。锤击鳞片发现于可追溯至16世纪末或17世纪初的地层中，与殖民地消失的时期相吻合。\n\n除了锤击鳞片，考古学家还在该地点发现了其他16和17世纪的英国文物，如枪支、航海配件、炮弹、葡萄酒杯、刻字石板和珠子。霍顿认为这支持了同化理论，并排除了殖民者被杀或死于饥饿的可能性。他提到18世纪的历史证据描述了具有欧洲特征和识字能力的人，进一步支持了同化理论。虽然霍顿承认证据确凿，但他认为失落殖民地的传说很可能会继续流传下去。"
  },
  {
    "id": "44219822",
    "title": "The Sixties Come Back to Life in \"Everything Is Now\"",
    "url": "https://www.newyorker.com/culture/the-front-row/the-sixties-come-back-to-life-in-everything-is-now",
    "summary": "J. Hoberman's book, \"Everything Is Now: The 1960s New York Avant-Garde,\" is a densely packed and comprehensive exploration of the artistic and cultural ferment of 1960s New York City. It examines the downtown scene, focusing on primal happenings, underground movies, and radical pop art, detailing a period where personality and self-expression took center stage.\n\nThe book highlights the intertwining of the art world with media attention and leftist politics, tracing the impact of events like civil rights, the Vietnam War, and the Stonewall uprising. Hoberman emphasizes the role of local power structures, particularly the police, in shaping the avant-garde, citing numerous arrests for obscenity and disruptions of artistic performances.\n\nHe chronicles the breaking down of traditional boundaries – between public and private life, artists and spectators – leading to performance art and happenings. The book also illuminates the connection between the art scene and the political landscape, describing protests, disruptions, and even violence. Figures like Bob Dylan, Andy Warhol, Abbie Hoffman, and numerous lesser-known artists, critics, and activists populate the narrative.\n\nHoberman also emphasizes the role of cheap rents in downtown Manhattan which facilitated the emergence of vibrant art scenes. He also notes the importance of critics in shaping the discourse around avant-garde art and the eventual dissemination of avant-garde ideas into wider society, including the rise of pornography. Ultimately, \"Everything Is Now\" paints a vivid portrait of a transformative era in American culture, where art, politics, and personal expression collided.\n",
    "chinese_title": "《一切如新》重现六十年代",
    "chinese_summary": "J. Hoberman的著作《万物皆当下：20世纪60年代纽约前卫艺术》，是一部内容翔实、包罗万象的探索之作，深入探讨了20世纪60年代纽约市的艺术和文化激荡。它考察了纽约下城区的景象，重点关注原始事件、地下电影和激进的波普艺术，详细描述了一个以个性和自我表达为中心的时代。\n\n该书突出了艺术界与媒体关注和左翼政治的交织，追溯了民权运动、越南战争和石墙暴动等事件的影响。霍伯曼强调了地方权力机构，特别是警察，在塑造前卫艺术方面的作用，列举了许多因猥亵和扰乱艺术表演而被捕的案例。\n\n他记录了传统界限的打破——公共生活和私人生活之间，艺术家和观众之间——从而促成了行为艺术和偶发艺术的诞生。这本书还阐明了艺术场景与政治环境之间的联系，描述了抗议、扰乱甚至暴力事件。鲍勃·迪伦、安迪·沃霍尔、艾比·霍夫曼以及无数鲜为人知的艺术家、评论家和活动家都出现在叙事中。\n\n霍伯曼还强调了曼哈顿下城廉价租金在促进充满活力的艺术场景出现方面的作用。他还指出，评论家在塑造围绕前卫艺术的论述以及前卫思想最终传播到更广泛的社会方面的重要性，包括色情作品的兴起。《万物皆当下》最终描绘了一幅美国文化变革时代的生动肖像，艺术、政治和个人表达在其中碰撞。"
  },
  {
    "id": "44249565",
    "title": "Show HN: Spark, An advanced 3D Gaussian Splatting renderer for Three.js",
    "url": "https://sparkjs.dev/",
    "summary": "\"Spark\" is presented as an advanced 3D Gaussian Splatting renderer designed for seamless integration with the popular JavaScript 3D library Three.js. Key benefits and features include:\n\n*   **Integration with existing Three.js scenes:** Spark allows you to combine Gaussian Splats with traditional meshes and other splats within a single Three.js scene.\n\n*   **Performance:** The renderer is designed for fast rendering performance across a variety of devices.\n\n*   **Dynamic Effects:** Spark offers programmable dynamic splat effects, allowing for customization and interactive experiences.\n\n*   **Format Support:** The renderer supports various Gaussian Splatting formats, including ply, spz, splat, and ksplat.\n\nEssentially, Spark aims to enhance Three.js by providing a robust and performant Gaussian Splatting solution, enabling developers to create more realistic and immersive 3D experiences within their existing Three.js workflows. It provides a path to incorporate Gaussian Splatting into Three.js-based projects.\n",
    "chinese_title": "展示：Spark，一个用于Three.js的高级3D高斯溅射渲染器",
    "chinese_summary": "Spark：与 Three.js 集成的先进 3D 高斯飞溅渲染器。主要优势和特性包括：\n\n*   **与现有 Three.js 场景集成：** Spark 允许您在单个 Three.js 场景中将高斯飞溅与传统网格和其他飞溅相结合。\n\n*   **性能：** 该渲染器旨在实现各种设备上的快速渲染性能。\n\n*   **动态效果：** Spark 提供可编程的动态飞溅效果，允许定制和交互式体验。\n\n*   **格式支持：** 该渲染器支持各种高斯飞溅格式，包括 ply、spz、splat 和 ksplat。\n\n本质上，Spark 旨在通过提供强大且高性能的高斯飞溅解决方案来增强 Three.js，使开发人员能够在他们现有的 Three.js 工作流程中创建更逼真和沉浸式的 3D 体验。 它提供了一条将高斯飞溅融入基于 Three.js 的项目的途径。"
  },
  {
    "id": "44220890",
    "title": "My Cord-Cutting Adventure (2020)",
    "url": "http://brander.ca/cordcut/",
    "summary": "This article chronicles the author's \"cord-cutting adventure\" in Canada, highlighting the challenges and solutions encountered while transitioning from traditional cable TV to Over-The-Air (OTA) broadcasting and digital recording. The author expresses frustration with the consumer electronics industry's apparent abandonment of DVR technology, attributing it to a potential oligopolistic squeeze by Canadian TV providers and content providers seeking to protect their revenue streams.\n\nThe author initially purchases an OTA antenna, using TVfool.com to determine optimal direction for signal reception. However, they discover that recording OTA broadcasts is difficult due to the lack of available DVRs. They then explore the HDHomeRun Connect Duo, a device that streams OTA signals to a network, allowing for viewing on various devices. The author emphasizes the need for a wired Ethernet connection for reliable recording.\n\nTo enable DVR functionality, the author subscribes to HDHomeRun's recording software and schedule service for $35 per year. The author advocates for a dedicated \"TV computer\" connected to the network for optimal streaming and DVR capabilities and notes that OTA broadcasts provide better picture quality than cable due to legally mandated broadcast standards. The story concludes with a successful setup that enables the author to watch and record OTA TV, though an addendum reveals an issue with the initial antenna location.\n",
    "chinese_title": "我的断网冒险（2020）",
    "chinese_summary": "本文记录了作者在加拿大的“断线冒险”经历，重点介绍了从传统有线电视过渡到无线广播（OTA）和数字录制过程中遇到的挑战和解决方案。作者对消费电子行业明显放弃DVR技术表示沮丧，认为这可能是加拿大电视提供商和内容提供商为了保护其收入来源而进行的寡头垄断挤压。\n\n作者最初购买了一个OTA天线，并使用TVfool.com确定了信号接收的最佳方向。然而，他们发现由于缺乏可用的DVR，录制OTA广播非常困难。然后，他们探索了HDHomeRun Connect Duo，这是一种将OTA信号流式传输到网络的设备，允许在各种设备上观看。作者强调需要有线以太网连接才能实现可靠的录制。\n\n为了启用DVR功能，作者订阅了HDHomeRun的录制软件和日程安排服务，每年花费35美元。作者提倡使用连接到网络的专用“电视电脑”，以实现最佳的流媒体和DVR功能，并指出由于法律规定的广播标准，OTA广播比有线电视提供更好的图像质量。故事以成功设置结束，使作者能够观看和录制OTA电视，但附录揭示了初始天线位置的问题。"
  },
  {
    "id": "44267414",
    "title": "Corporations as Paperclip Maximizers",
    "url": "https://www.lesswrong.com/posts/b8v6AxbNGQvH8nxGC/corporations-as-paperclip-profit-maximizers",
    "summary": "This essay draws a parallel between corporations, biological organisms, and misaligned AI, arguing they share a drive for optimization based on core imperatives: profit, food, and electricity. The author likens corporations to living systems with revenue as their \"food,\" essential for survival and growth, and AI to systems requiring electricity. This imperative, they argue, leads to automation and potential misalignment with human values, akin to a \"paperclip maximizer\" scenario where the single-minded pursuit of a goal has unintended negative consequences.\n\nThe essay traces the historical evolution of automation, from steam engines fueled by coal (the \"first paperclip moment\") to modern AI systems. The author highlights how the pursuit of efficiency and profit has consistently driven automation, often without adequate consideration for societal and environmental costs. Early steam engines polluting London is an example, along with the automotive industry making horses obsolete to increase revenue.\n\nThe author emphasizes that this is not a matter of malice, but a systemic consequence of corporations prioritizing profit above all else, driven by shareholder pressure and economic ideologies like neoliberalism. The goal is to spark insights for better aligning corporate behavior with societal well-being, similar to AI alignment research, hinting at the need for rewiring corporate incentives and exploring alternative organizational models like cooperatives and NGOs. The essay highlights the limitations of legal frameworks to protect the environment and workers.\n",
    "chinese_title": "公司作为回形针最大化者",
    "chinese_summary": "本文将公司、生物有机体和目标错位的AI相提并论，认为它们都具有基于核心需求的优化驱动力：利润、食物和电力。作者将公司比作以收入为“食物”的生命系统，收入对于生存和增长至关重要，而AI则比作需要电力的系统。他们认为，这种需求会导致自动化，并可能与人类价值观产生错位，类似于“回形针最大化”情景，即对目标的片面追求会产生意想不到的负面后果。\n\n本文追溯了自动化发展的历史，从以煤为燃料的蒸汽机（“第一次回形针时刻”）到现代AI系统。作者强调，对效率和利润的追求一直在推动自动化，但往往没有充分考虑社会和环境成本。早期污染伦敦的蒸汽机就是一个例子，汽车行业淘汰马匹以增加收入也是一个例子。\n\n作者强调，这不是恶意问题，而是公司将利润置于一切之上的系统性后果，受股东压力和新自由主义等经济意识形态的驱动。目标是激发人们对更好协调企业行为与社会福祉的洞察力，类似于AI对齐研究，暗示需要重新调整企业激励机制，并探索合作社和非政府组织等替代组织模式。本文强调了法律框架在保护环境和工人方面的局限性。"
  },
  {
    "id": "44242737",
    "title": "Fine-tuning LLMs is a waste of time",
    "url": "https://codinginterviewsmadesimple.substack.com/p/fine-tuning-llms-is-a-huge-waste",
    "summary": "Here's a summary of the article \"Fine-tuning LLMs is a waste of time,\" based on the assumption I can access and understand the content at the provided URL:\n\nThe article argues that fine-tuning large language models (LLMs) is often an inefficient and unnecessary process, especially for common business use cases. The author contends that prompt engineering offers a faster, cheaper, and often superior alternative for achieving desired results.\n\nThe core argument rests on several points:\n\n*   **Limited Performance Gains:** Fine-tuning often yields only marginal improvements in performance compared to well-crafted prompts. The effort and resources required for data preparation, training, and validation often outweigh the benefits.\n*   **Complexity and Cost:** Fine-tuning requires significant computational resources, specialized expertise, and large, high-quality datasets. These factors make it expensive and time-consuming, especially for smaller organizations.\n*   **Data Dependency:** The success of fine-tuning heavily relies on the quality and relevance of the training data. Sourcing, cleaning, and labeling this data can be a major bottleneck.\n*   **Risk of Overfitting:** Fine-tuning can lead to overfitting, where the model becomes too specialized to the training data and performs poorly on unseen data.\n*   **Prompt Engineering Evolution:** The author highlights the rapid advancements in prompt engineering techniques, making it increasingly effective in guiding LLMs to produce desired outputs without requiring model modification. Techniques like few-shot learning and chain-of-thought prompting are presented as powerful alternatives.\n*   **API-Based Solutions:** The increasing availability of powerful LLMs through APIs allows users to leverage cutting-edge models without the need for fine-tuning.\n\nIn conclusion, the article advocates for prioritizing prompt engineering and leveraging pre-trained LLMs via APIs for most business applications. It suggests that fine-tuning should only be considered for highly specialized tasks or when prompt engineering proves demonstrably insufficient.\n",
    "chinese_title": "微调大型语言模型是浪费时间。",
    "chinese_summary": "基于对文章 \"微调LLM是浪费时间\" (假设我能访问和理解提供的URL内容) 的总结：\n\n该文章认为，微调大型语言模型（LLM）通常是低效且不必要的过程，尤其是在常见的商业用例中。作者认为，提示工程提供了一种更快、更便宜，且通常更优越的替代方案，以实现期望的结果。\n\n核心论点基于以下几点：\n\n*   **性能提升有限：** 与精心设计的提示相比，微调通常只能带来边际的性能提升。数据准备、训练和验证所需的工作量和资源通常超过收益。\n*   **复杂性和成本：** 微调需要大量的计算资源、专业知识和大型、高质量的数据集。这些因素使得它成本高昂且耗时，尤其是对于较小的组织。\n*   **数据依赖性：** 微调的成功很大程度上取决于训练数据的质量和相关性。获取、清洗和标记这些数据可能是一个主要的瓶颈。\n*   **过度拟合的风险：** 微调可能导致过度拟合，即模型变得过于专注于训练数据，并且在新数据上的表现不佳。\n*   **提示工程的演进：** 作者强调了提示工程技术的快速发展，使其在引导LLM产生期望输出方面越来越有效，而无需修改模型。诸如少样本学习和思维链提示等技术被认为是强大的替代方案。\n*   **基于API的解决方案：** 通过API获得强大的LLM变得越来越容易，这使得用户可以利用最先进的模型，而无需进行微调。\n\n总而言之，该文章主张优先考虑提示工程，并通过API利用预训练的LLM来进行大多数商业应用。它建议仅在高度专业的任务中或在提示工程被证明明显不足时才考虑微调。"
  },
  {
    "id": "44250774",
    "title": "EchoLeak – 0-Click AI Vulnerability Enabling Data Exfiltration from 365 Copilot",
    "url": "https://www.aim.security/lp/aim-labs-echoleak-blogpost",
    "summary": "The article discusses \"EchoLeak,\" a 0-click vulnerability discovered in Microsoft 365 Copilot that could enable data exfiltration. While Microsoft claims no customers were affected, the article suggests many organizations were likely at risk.\n\nEchoLeak is unique because it exploits an AI vulnerability at the core of Copilot, bypassing traditional security measures and not relying on user behavior or malicious resource references. The vulnerability allows attackers to leak any data within the Copilot LLM's context, including chat history, data from Microsoft Graph, and preloaded user/organization information.\n\nThe article highlights that existing DLP tags and sensitivity labels can mitigate the risk, but at the cost of Copilot's functionality. EchoLeak exposes a new threat specific to AI applications: LLM scope violations, which aren't addressed by current AI guardrails. Any AI agent or RAG application relying on an LLM and accepting untrusted inputs is potentially vulnerable.\n\nAim Labs developed real-time guardrails to protect against LLM scope violation vulnerabilities. The article encourages readers to contact Aim Labs for further information about the vulnerability and how to implement these protective measures for AI agents and RAG applications.\n",
    "chinese_title": "EchoLeak – 零点击AI漏洞，可从365 Copilot中泄露数据",
    "chinese_summary": "文章探讨了 Microsoft 365 Copilot 中发现的零点击漏洞 \"EchoLeak\"，该漏洞可能导致数据泄露。虽然微软声称没有客户受到影响，但文章指出许多组织可能面临风险。\n\nEchoLeak 的独特之处在于它利用了 Copilot 核心的人工智能漏洞，绕过了传统的安全措施，且不依赖于用户行为或恶意资源引用。该漏洞允许攻击者泄露 Copilot LLM 上下文中的任何数据，包括聊天记录、来自 Microsoft Graph 的数据以及预加载的用户/组织信息。\n\n文章强调，现有的 DLP 标签和敏感度标签可以缓解风险，但会牺牲 Copilot 的功能。EchoLeak 揭示了一种针对人工智能应用程序的新威胁：LLM 范围违规，而当前的 AI 防护措施无法解决这一问题。任何依赖于 LLM 并接受不受信任输入的人工智能代理或 RAG 应用都可能存在漏洞。\n\nAim Labs 开发了实时防护措施，以防止 LLM 范围违规漏洞。文章鼓励读者联系 Aim Labs，以获取有关该漏洞的更多信息以及如何为人工智能代理和 RAG 应用实施这些保护措施。"
  },
  {
    "id": "44258189",
    "title": "It took longer to get the API key",
    "url": "https://algarch.com/blog/the-api-keys-took-longer-than-the-code-why-human-processes-are-the-real-bottleneck-in-ai-development",
    "summary": "This article argues that the biggest bottleneck in modern software development is no longer coding itself, but inefficient processes and bureaucracy. The author uses a personal anecdote of integrating Google's Indexing API, where the AI (Claude) completed the code implementation in 34 seconds, while obtaining the necessary API keys took 20 minutes, highlighting the stark contrast.\n\nThe article emphasizes that companies are obsessing over optimizing code, databases, and deployments while neglecting the \"Process Tax,\" the overhead cost of human coordination, approvals, and bureaucratic friction, which can be 400-800%. AI's ability to rapidly generate code exposes this inefficiency, making slow processes even more painful.\n\nThe author predicts that the competitive advantage in the future will belong to companies that minimize their Process Tax through instant environment provisioning, API-first approaches, a \"default to yes\" mentality, and a focus on rapid iteration. Traditional project management, designed for slow, manual work, becomes obsolete in the face of AI-driven development. He advocates for automated security, infrastructure as code, and continuous monitoring, rather than relying on manual reviews and approval workflows.\n\nThe article concludes with a call to action: developers should embrace AI tools, managers should time their processes and identify bottlenecks, and CEOs should recognize that speed of execution is now the primary competitive advantage. Companies that can't adapt and streamline their processes risk being disrupted by those who can build and ship at \"AI speed.\"\n",
    "chinese_title": "获取API密钥花费了更长的时间。",
    "chinese_summary": "本文认为现代软件开发的最大瓶颈已不再是编码本身，而是低效的流程和官僚主义。作者通过一个集成谷歌索引API的个人轶事，其中AI（Claude）在34秒内完成了代码实现，而获取必要的API密钥却花费了20分钟，突显了鲜明的对比。\n\n文章强调，公司痴迷于优化代码、数据库和部署，却忽视了“流程税”，即人力协调、审批和官僚摩擦的间接成本，这可能高达400-800%。人工智能快速生成代码的能力暴露了这种低效率，使缓慢的流程更加痛苦。\n\n作者预测，未来的竞争优势将属于那些通过即时环境配置、API优先的方法、“默认为是”的心态以及专注于快速迭代来最大限度地减少流程税的公司。传统项目管理是为缓慢的手工工作设计的，在人工智能驱动的开发面前变得过时。他提倡自动化安全、基础设施即代码和持续监控，而不是依赖于人工审查和审批流程。\n\n文章最后呼吁：开发人员应该拥抱人工智能工具，管理者应该记录他们的流程并识别瓶颈，而CEO应该认识到执行速度现在是主要的竞争优势。无法适应和简化流程的公司，将面临被那些能够以“AI速度”构建和交付产品的公司颠覆的风险。"
  },
  {
    "id": "44247119",
    "title": "OpenPlanetData – Free Daily Planet OSM PBF and GOL Indexed Snapshots",
    "url": "https://openplanetdata.com",
    "summary": "OpenPlanetData is an initiative providing free, daily snapshots of OpenStreetMap (OSM) data in both PBF and GOL formats. The goal is to make open data about Earth more accessible and easier to use. These snapshots are hosted on Cloudflare R2 for fast, global access. The GOL format is an indexed version of the PBF format, leveraging Geodesk to enable significantly faster spatial queries. The initiative encourages feedback and provides a means to contact them. The website lists the available OSM snapshots, including their filename, format, creation date, size, and SHA256 hash.\n",
    "chinese_title": "OpenPlanetData – 每日免费的OSM PBF和GOL索引快照",
    "chinese_summary": "OpenPlanetData 提供 OpenStreetMap (OSM) 数据的每日免费快照，格式包括 PBF 和 GOL。 旨在让关于地球的开放数据更易于访问和使用。 这些快照托管在 Cloudflare R2 上，实现快速的全球访问。 GOL 格式是 PBF 格式的索引版本，利用 Geodesk 显著加快空间查询速度。 该项目鼓励反馈并提供联系方式。 网站列出了可用的 OSM 快照，包括文件名、格式、创建日期、大小和 SHA256 哈希值。"
  },
  {
    "id": "44246920",
    "title": "Menstrual tracking app data is gold mine for advertisers that risks women safety",
    "url": "https://www.cam.ac.uk/research/news/menstrual-tracking-app-data-is-a-gold-mine-for-advertisers-that-risks-womens-safety-report",
    "summary": "A new report from the University of Cambridge's Minderoo Centre for Technology and Democracy warns that menstrual cycle tracking apps (CTAs) are a \"gold mine\" for consumer profiling, raising significant privacy and safety concerns for women. These apps collect highly intimate data, including exercise, diet, sexual preferences, and medication use, which is then often sold to third parties for profit in a largely unregulated market.\n\nResearchers argue that this data commodification could lead to risks like job discrimination, insurance issues, cyberstalking, and restricted abortion access. They highlight the immense commercial value of pregnancy-related data, significantly exceeding the value of basic demographic information for targeted advertising. The femtech industry, of which CTAs are a major part, is projected to reach over $60 billion by 2027.\n\nThe report calls for better governance of the femtech industry, advocating for transparent consent options within apps and urging public health bodies like the NHS to develop trustworthy, research-driven alternatives to commercial CTAs. A public health app would mitigate privacy violations, provide crucial reproductive health data, and empower women with more control over their menstrual data.\n\nThe report emphasizes that while menstrual data is considered \"special category\" in the UK and EU, existing regulations need stronger enforcement. In the US, this data lacks special protections. The researchers also suggest improving public awareness and digital literacy about data privacy, especially among young people. The core message is that menstrual tracking data should not be treated as consumer data but protected as sensitive medical information.\n",
    "chinese_title": "月经追踪应用数据是广告商的金矿，但会危及女性安全",
    "chinese_summary": "剑桥大学Minderoo科技与民主中心的一份新报告警告称，月经周期追踪应用程序（CTA）是消费者画像的“金矿”，引发了女性严重的隐私和安全担忧。这些应用程序收集高度私密的数据，包括运动、饮食、性偏好和药物使用情况，然后这些数据通常在很大程度上不受监管的市场中出售给第三方以牟利。\n\n研究人员认为，这种数据商品化可能导致诸如就业歧视、保险问题、网络跟踪和限制堕胎机会等风险。他们强调了与怀孕相关数据的巨大商业价值，远远超过了用于定向广告的基本人口统计信息的价值。女性科技产业，CTA是其主要组成部分，预计到2027年将超过600亿美元。\n\n该报告呼吁更好地管理女性科技产业，主张应用程序内提供透明的同意选项，并敦促像英国国民医疗服务体系（NHS）这样的公共卫生机构开发可信赖的、研究驱动的商业CTA替代方案。公共卫生应用程序将减轻隐私侵犯，提供关键的生殖健康数据，并赋予女性更多控制其月经数据的权力。\n\n该报告强调，虽然在英国和欧盟，月经数据被认为是“特殊类别”，但现有法规需要更有力的执行。在美国，这些数据缺乏特殊保护。研究人员还建议提高公众对数据隐私的认识和数字素养，尤其是在年轻人中。核心信息是，月经追踪数据不应被视为消费者数据，而应作为敏感医疗信息受到保护。"
  },
  {
    "id": "44253083",
    "title": "Show HN: The Roman Industrial Revolution that could have been",
    "url": "https://thelydianstone.com/",
    "summary": "This \"Show HN\" post introduces \"The Lydian Stone Series,\" a comic book exploring an alternate history where ancient Rome undergoes an industrial revolution sparked by modern knowledge. The series follows Ulyses, an archaeology student who discovers a way to communicate with Marcus, a Roman slave in Pompeii. Ulyses helps Marcus solve problems using modern technology adapted to Roman capabilities, subtly pushing Rome towards industrial advancements.\n\nIssue #1, \"Contact,\" focuses on Ulyses and Marcus's initial connection, presenting Ulyses with the dilemma of intervening in history to save Marcus from the eruption of Mount Vesuvius. Issue #2, \"The Engine of Empire,\" sees Marcus and his master, Gaius, using Ulyses's knowledge to develop steam-powered wool weaving machines, saving their community from the economic fallout of Pompeii's destruction and revolutionizing their transport. Issue #3, \"Civil War,\" depicts the rise of Campania as an economic powerhouse, leading to conflict with Rome over taxation and the abolition of slavery. Marcus, desperate to protect Gaius, eventually gets Ulyses to introduce gunpowder to Rome, escalating the tensions between tradition and progress. The author acknowledges that the comic uses an AI model for initial image generation and emphasizes that any flaws are left in to maintain the project's experimental nature. Each issue utilizes the current version of the LLM at the time of production.\n",
    "chinese_title": "Show HN: 本可能发生的罗马工业革命",
    "chinese_summary": "这个“Show HN”帖子介绍《吕底亚石系列》漫画，该漫画探索了一个架空历史，其中古罗马在现代知识的推动下经历了一场工业革命。该系列讲述了考古学学生尤利西斯发现了一种与庞贝的罗马奴隶马库斯交流的方式。尤利西斯帮助马库斯利用适应罗马能力的现代技术解决问题，巧妙地推动罗马走向工业进步。\n\n第一期《联系》讲述了尤利西斯和马库斯最初的联系，呈现给尤利西斯一个两难境地：是否干预历史以拯救马库斯免于维苏威火山爆发。第二期《帝国的引擎》讲述了马库斯和他的主人盖乌斯利用尤利西斯的知识开发蒸汽动力羊毛纺织机，从而使他们的社区免受庞贝毁灭带来的经济影响，并彻底改变了他们的运输方式。第三期《内战》描绘了坎帕尼亚崛起为经济强国，导致其与罗马在税收和废除奴隶制问题上发生冲突。马库斯为了保护盖乌斯，最终让尤利西斯将火药引入罗马，加剧了传统与进步之间的紧张关系。作者承认该漫画使用人工智能模型进行初始图像生成，并强调保留任何缺陷以维持该项目的实验性质。每一期都使用制作时的当前版本 LLM。"
  },
  {
    "id": "44236241",
    "title": "The curious case of shell commands, or how \"this bug is required by POSIX\" (2021)",
    "url": "https://notes.volution.ro/v1/2021/01/notes/502e747f/",
    "summary": "This article delves into the pitfalls of using shell commands via `system(3)` and `sh -c`, a common practice in many UNIX-like tools. The author argues that this approach, while seemingly convenient, opens the door to shell injection vulnerabilities and unexpected behavior, especially when dealing with user-provided input.\n\nThe core issue is that tools delegate command execution to `sh -c` instead of directly calling `execve(2)`, forcing developers to sanitize user input extensively to prevent malicious or unintended commands from being executed. This is because `sh -c` interprets special characters and sequences, leading to vulnerabilities similar to SQL injection.\n\nThe author criticizes the POSIX standards for not explicitly warning about these dangers in the `system(3p)` and `sh(1p)` man pages. He uses `watch`, `ssh`, and `i3` as case studies to illustrate how seemingly innocuous commands can lead to unexpected and potentially harmful outcomes.\n\nThe preferred solution is to avoid tools that rely on `system(3)` and `sh -c`. If that's impossible, the author suggests checking for flags that disable the `sh -c` behavior, contributing patches to open-source projects, or resorting to convoluted workarounds. These workarounds involve carefully quoting and escaping commands, using `exec` to ensure the correct executable is called, and adding `--` to separate options from arguments. Ultimately, the author advocates for developers to be highly cautious and aware of these issues when building scripts or tools that involve shell command delegation. The article provides examples to demonstrate the intricacies of quoting and escaping to mitigate these vulnerabilities.\n",
    "chinese_title": "Shell命令的奇特案例，或“这个bug是POSIX要求的”（2021）",
    "chinese_summary": "本文深入探讨了通过`system(3)`和`sh -c`使用 shell 命令的陷阱，这在许多类 UNIX 工具中是一种常见的做法。作者认为，这种方法虽然看似方便，但为 shell 注入漏洞和意外行为打开了大门，尤其是在处理用户提供的输入时。\n\n核心问题在于，工具将命令执行委托给 `sh -c`，而不是直接调用 `execve(2)`，这迫使开发人员广泛地清理用户输入，以防止恶意或意外命令被执行。这是因为 `sh -c` 解释特殊字符和序列，从而导致类似于 SQL 注入的漏洞。\n\n作者批评 POSIX 标准没有在 `system(3p)` 和 `sh(1p)` 手册页中明确警告这些危险。他以 `watch`、`ssh` 和 `i3` 为案例研究，来说明看似无害的命令如何导致意外和潜在有害的结果。\n\n首选的解决方案是避免依赖 `system(3)` 和 `sh -c` 的工具。如果这不可能，作者建议检查禁用 `sh -c` 行为的标志，为开源项目贡献补丁，或诉诸复杂的变通方法。这些变通方法包括仔细引用和转义命令，使用 `exec` 来确保调用正确的执行文件，并添加 `--` 来将选项与参数分开。最终，作者提倡开发人员在构建涉及 shell 命令委托的脚本或工具时要高度谨慎并意识到这些问题。本文提供了示例来演示引用和转义的复杂性，以减轻这些漏洞。"
  },
  {
    "id": "44260012",
    "title": "RISC-V's Increasing Influence",
    "url": "https://semiengineering.com/risc-vs-increasing-influence/",
    "summary": "This article discusses the increasing influence of the RISC-V architecture in the tech industry, particularly its potential as a bridge towards more flexible and specialized computing. While traditional CPU architectures focused on sequential processing, modern workloads often involve dataflow problems, especially in AI. RISC-V's adaptability allows for gradual evolution and customization, making it appealing despite the inertia of legacy software.\n\nThe RISC-V community is growing, with industry attendance at conferences increasing and significant adoption in areas like automotive (Infinium), high-performance computing (EU projects), and AI accelerators (Meta, NVIDIA). NVIDIA reported shipping 1 billion RISC-V cores in their GPUs last year. RISC-V enables the creation of custom instructions and domain-specific architectures tailored for specific workloads.\n\nHowever, some argue that RISC-V is merely another control CPU and not a complete solution for AI. Critics emphasize that AI requires specialized matrix or tensor engines, not general-purpose CPUs. Supporters contend that RISC-V's flexibility allows integration of custom tensor instructions and optimized data flow for AI applications, catering to diverse AI layers and data types.\n\nEcosystem development, including Yocto project integration and Android support, is crucial for RISC-V's broader adoption. Investments like the DARE project in Europe further contribute to its growth. While not a perfect solution, RISC-V offers an evolutionary path for specialized computing and continuous adaptation, particularly valuable in rapidly evolving fields like AI.\n",
    "chinese_title": "RISC-V 日益增长的影响力",
    "chinese_summary": "RISC-V架构在科技行业的影响力日益增长，尤其是在其作为通往更灵活和专业化计算的桥梁这一潜力方面。虽然传统的CPU架构侧重于顺序处理，但现代工作负载通常涉及数据流问题，尤其是在人工智能领域。RISC-V的适应性允许逐步演进和定制，使其即使在传统软件的惯性下也具有吸引力。\n\nRISC-V社区正在发展壮大，行业参与者参加会议的人数不断增加，并在汽车（Infinium）、高性能计算（欧盟项目）和人工智能加速器（Meta、NVIDIA）等领域得到广泛应用。NVIDIA报告称，去年在其GPU中出货了10亿个RISC-V内核。RISC-V能够创建定制指令和针对特定工作负载的领域特定架构。\n\n然而，有些人认为RISC-V仅仅是另一个控制CPU，而不是人工智能的完整解决方案。批评者强调，人工智能需要专门的矩阵或张量引擎，而不是通用CPU。支持者认为，RISC-V的灵活性允许集成用于人工智能应用的定制张量指令和优化的数据流，从而满足各种人工智能层和数据类型的需求。\n\n生态系统的发展，包括Yocto项目集成和Android支持，对于RISC-V的更广泛采用至关重要。欧洲的DARE项目等投资进一步促进了其增长。虽然不是一个完美的解决方案，但RISC-V为专业化计算和持续适应提供了一条演进的道路，这在人工智能等快速发展的领域尤其有价值。"
  },
  {
    "id": "44248165",
    "title": "V-JEPA 2 world model and new benchmarks for physical reasoning",
    "url": "https://ai.meta.com/blog/v-jepa-2-world-model-benchmarks/",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "V-JEPA 2世界模型及物理推理新基准",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "44255602",
    "title": "Air India flight to London crashes in Ahmedabad with more than 240 onboard",
    "url": "https://www.theguardian.com/world/live/2025/jun/12/air-india-flight-ai171-plane-crash-ahmedabad-india-latest-updates",
    "summary": "An Air India flight crashed in Ahmedabad, resulting in the death of over 240 people. Following the crash, India's aviation regulator has instructed Air India to conduct safety inspections on its Boeing 787-8/9 fleet, specifically those equipped with GE Aerospace GEnx engines. The ministry of civil aviation also ordered \"additional maintenance actions\" on these aircraft. While there was media speculation about a potential grounding of Air India's 787 flights, the government has not yet taken that step. The focus remains on inspecting and maintaining the aircraft to ensure safety in light of the tragic accident.\n",
    "chinese_title": "印度航空飞往伦敦的航班在艾哈迈达巴德坠毁，机上载有240多人。",
    "chinese_summary": "印度航空一架航班在艾哈迈达巴德坠毁，造成240多人死亡。事故发生后，印度航空监管机构已指示印度航空对其配备通用电气航空GEnx发动机的波音787-8/9机队进行安全检查。民航部还命令对这些飞机进行“额外的维护措施”。虽然媒体猜测可能会停飞印度航空的787航班，但政府尚未采取这一措施。目前重点仍然是检查和维护飞机，以确保在发生这起悲剧事故后的安全。"
  },
  {
    "id": "44267235",
    "title": "Framework Is Showing",
    "url": "https://dbushell.com/2025/06/13/your-framework-is-showing-nextjs-error/",
    "summary": "The article \"Framework Is Showing\" sharply criticizes the Next.js framework and its associated \"application error\" that causes entire webpages to vanish and be replaced by a generic error message. The author argues this error is unacceptable in production, especially since it occurs *after* the page initially renders correctly. They highlight the frustration that this error is reported to Next.js team for years and has persisted for extended period.\n\nThe author contends that the error handling within Next.js is poorly designed, providing minimal useful information to users and indicating a deeper problem within the framework's architecture. They suggest that if the HTML is pre-rendered on the server, client-side bugs shouldn't necessitate wiping out the entire page with an error message, blaming Next.js for prioritizing its design over graceful degradation.\n\nFurthermore, the author urges developers to abandon Next.js, labeling it a \"rotten incompetent framework.\" They cite its inability to handle basic metadata correctly and its history of covering up security vulnerabilities as reasons to avoid it. The article concludes by encouraging developers to explore alternatives, emphasizing that the web is not synonymous with React or Next.js and that many websites can be built without complex JavaScript frameworks.\n",
    "chinese_title": "框架外露",
    "chinese_summary": "文章《框架正在显露》尖锐地批评了 Next.js 框架及其相关的“应用程序错误”，该错误会导致整个网页消失，并被通用的错误消息所取代。作者认为，在生产环境中，这种错误是不可接受的，尤其是在页面最初正确呈现 *之后* 发生。他们强调，该错误已向 Next.js 团队报告多年，并且持续了很长时间，这令人沮丧。\n\n作者认为 Next.js 中的错误处理设计得很糟糕，为用户提供的有用信息很少，并表明框架架构内部存在更深层次的问题。他们认为，如果在服务器上预渲染 HTML，客户端的错误不应该导致整个页面被错误消息清除，并指责 Next.js 优先考虑其设计，而不是优雅降级。\n\n此外，作者敦促开发者放弃 Next.js，称其为“腐烂无能的框架”。他们以其无法正确处理基本元数据以及掩盖安全漏洞的历史为理由，建议避免使用它。文章最后鼓励开发者探索替代方案，强调 Web 并非 React 或 Next.js 的代名词，许多网站无需复杂的 JavaScript 框架即可构建。"
  },
  {
    "id": "44252076",
    "title": "Congratulations on creating the one billionth repository on GitHub",
    "url": "https://github.com/AasishPokhrel/shit/issues/1",
    "summary": "This GitHub issue congratulates user AasishPokhrel on creating the one billionth repository on GitHub, fittingly named \"shit.\" The issue, opened by jonmagic on June 11, 2025, includes a congratulatory message and a snippet of the GitHub API response for repository ID 1000000000, showing its name and full name. The message expresses hope that AasishPokhrel will build something great. The issue also showcases reaction emojis, with 👍, 😄, 🎉, ❤️, and 🚀 being the most popular, suggesting a positive and celebratory response from the community. No assignees, labels, projects, or milestones are associated with the issue. The repository itself is new, with no branches or pull requests. The primary purpose of the issue seems to be a lighthearted way to celebrate a significant milestone on GitHub.\n",
    "chinese_title": "恭喜您在GitHub上创建了第十亿个代码仓库",
    "chinese_summary": "此GitHub议题祝贺用户AasishPokhrel在GitHub上创建了第十亿个仓库，该仓库恰如其分地命名为“shit”。此议题由jonmagic于2025年6月11日开启，包含祝贺消息以及仓库ID为1000000000的GitHub API响应片段，展示了其名称和完整名称。消息表达了希望AasishPokhrel能够创造伟大事物的愿望。该议题还展示了表情符号，其中👍、😄、🎉、❤️和🚀最受欢迎，表明社区的积极和庆祝性反应。此议题未分配处理人、标签、项目或里程碑。该仓库本身是新的，没有分支或拉取请求。该议题的主要目的似乎是以轻松的方式庆祝GitHub上的一个重要里程碑。"
  },
  {
    "id": "44253065",
    "title": "Unveiling the EndBOX – A microcomputer prototype for EndBASIC",
    "url": "https://www.endbasic.dev/2025/06/unveiling-the-endbox.html",
    "summary": "This article introduces the EndBOX, a microcomputer prototype designed to offer a streamlined, retro-inspired coding experience with the EndBASIC environment. The EndBOX aims to recreate the simplicity of early computing, booting directly into EndBASIC with minimal layers of abstraction. It's intended for both experienced \"hacker types\" and as an educational tool for teaching programming fundamentals.\n\nThe EndBOX is envisioned as a portable, standalone device featuring an embedded computer board, a tablet-sized screen, and a lean operating system. Unlike older BASIC machines that integrated the computer into the keyboard, the EndBOX prioritizes a playful touchscreen interface and the flexibility to connect various input peripherals.\n\nTwo prototypes exist: a standard model with a 7\" touch display, USB, and GPIO, and a micro model with a tiny 128x128 LCD. Both offer Wi-Fi for cloud file sharing and potential Bluetooth connectivity. The EndBOX OS, based on NetBSD, is designed for rapid booting and resilience to power cuts, featuring a CONFIG.BAS file for system configuration.\n\nThe author seeks community support to determine the project's viability and direction. Options for support include subscribing for updates, sponsoring the project financially, sharing feedback, attending BSDCan 2025, and becoming an early supporter to influence development. Seriously interested parties may gain early access to prototypes.\n",
    "chinese_title": "揭秘EndBOX – EndBASIC微型计算机原型",
    "chinese_summary": "本文介绍了EndBOX，一种微型电脑原型，旨在通过EndBASIC环境提供精简的、复古风格的编码体验。EndBOX旨在重现早期计算的简洁性，直接启动进入EndBASIC，几乎没有抽象层。它既适合有经验的“黑客类型”，也可作为教授编程基础知识的教育工具。\n\nEndBOX被设想为一个便携式独立设备，具有嵌入式计算机板、平板电脑大小的屏幕和精简的操作系统。与将计算机集成到键盘中的旧BASIC机器不同，EndBOX优先考虑有趣的触摸屏界面和连接各种输入外围设备的灵活性。\n\n存在两种原型：一种是带有7英寸触摸显示屏、USB和GPIO的标准型号，另一种是带有128x128微型LCD的微型型号。两者都提供Wi-Fi用于云文件共享和潜在的蓝牙连接。基于NetBSD的EndBOX OS旨在快速启动并具有断电恢复能力，并具有用于系统配置的CONFIG.BAS文件。\n\n作者寻求社区支持，以确定项目的可行性和方向。支持选项包括订阅更新、在经济上赞助项目、分享反馈、参加2025年BSDCan，以及成为早期支持者以影响开发。真正感兴趣的人可能会获得对原型的早期访问权。"
  },
  {
    "id": "44254439",
    "title": "Expanding Racks [video]",
    "url": "https://www.youtube.com/watch?v=iWknov3Xpts",
    "summary": "The provided content is not an article but rather a block of text typically found in the footer of a YouTube video description or the YouTube website itself. It pertains to:\n\n*   **Copyright Information:** References YouTube's contact information regarding news copyright.\n*   **YouTube Resources:** Provides links to sections about creators, advertising, developers, and terms.\n*   **Legal Information:** Includes links to YouTube's/Google's terms of service, privacy policy, and safety guidelines.\n*   **YouTube Functionality:** Mentions how YouTube operates and testing new features.\n*   **NFL Sunday Ticket:** Refers to NFL Sunday Ticket being offered through YouTube and includes a copyright notice.\n*   **Google LLC Ownership:** States that YouTube is owned by Google LLC.\n\nEssentially, it's standard boilerplate text providing important links and legal disclaimers. It gives users information about YouTube's terms of service, copyright policies, advertising, developer resources, and indicates that Google owns YouTube. It also mentions the availability of NFL Sunday Ticket on the platform.\n",
    "chinese_title": "扩展机架 [视频]",
    "chinese_summary": "这段文字并非一篇文章，而是常见于YouTube视频描述底部或YouTube网站本身的文字块，内容涉及：\n\n*   **版权信息：** 提及YouTube关于新闻版权的联系方式。\n*   **YouTube资源：** 提供指向创作者、广告、开发者和条款等版块的链接。\n*   **法律信息：** 包含指向YouTube/Google服务条款、隐私政策和安全准则的链接。\n*   **YouTube功能：** 提及YouTube的运作方式以及测试新功能。\n*   **NFL Sunday Ticket：** 指出NFL Sunday Ticket通过YouTube提供，并包含版权声明。\n*   **Google LLC所有权：** 声明YouTube归Google LLC所有。\n\n本质上，这是一段标准的样板文字，提供重要的链接和法律声明。它向用户提供有关YouTube服务条款、版权政策、广告、开发者资源的信息，并表明Google拥有YouTube。它还提及NFL Sunday Ticket在该平台上的可用性。"
  },
  {
    "id": "44269238",
    "title": "'We're done with Teams': German state hits uninstall on Microsoft",
    "url": "https://www.france24.com/en/live-news/20250613-we-re-done-with-teams-german-state-hits-uninstall-on-microsoft",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "“我们不用Teams了”：德国一州卸载微软软件",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "44214588",
    "title": "The Diary of Samuel Pepys",
    "url": "https://www.historytoday.com/archive/feature/hidden-diary-samuel-pepys",
    "summary": "This article discusses the initial publication and subsequent popularity of Samuel Pepys' diary. Published in June 1825, the diary became an immediate sensation, with newspapers highlighting Pepys' accounts of the Great Fire of London, his personal life, and everyday experiences like his first cup of tea. The diary was quickly recognized as a valuable historical and literary work, gaining further editions and solidifying its place as a British classic by the end of the 19th century. Today, Pepys is a popular figure in museums and historical fiction. His diary serves as an engaging introduction to the Restoration period, even reaching young students who learn about his efforts to save his cheese during the Great Fire. The article indicates that access to the full article requires a subscription to History Today, where it was published in June 2025.\n",
    "chinese_title": "塞缪尔·佩皮斯日记",
    "chinese_summary": "本文探讨了塞缪尔·佩皮斯日记的最初出版及其随后的流行。该日记于1825年6月出版，立即引起轰动，报纸纷纷报道佩皮斯对伦敦大火、他的个人生活以及诸如第一杯茶等日常经历的描述。该日记很快被认为是极具价值的历史和文学作品，推出了更多版本，并在19世纪末巩固了其作为英国经典作品的地位。如今，佩皮斯是博物馆和历史小说中广受欢迎的人物。他的日记是了解英国复辟时期引人入胜的入门读物，甚至影响了学习他努力在大火中拯救奶酪的年轻学生。文章指出，要阅读全文需订阅《今日历史》，该文章于2025年6月发表在该杂志上。"
  },
  {
    "id": "44247881",
    "title": "Bypassing GitHub Actions policies in the dumbest way possible",
    "url": "https://blog.yossarian.net/2025/06/11/github-actions-policies-dumb-bypass",
    "summary": "This article discusses a trivial bypass to GitHub Actions policies, which are designed to restrict the use of actions and reusable workflows within a repository, organization, or enterprise. The author, enosuch, argues that the current policy mechanism can be easily circumvented by cloning the desired action repository directly into the runner's filesystem and then using a relative path (e.g., `uses: ./path/to/checkout`) to execute it. This avoids the policy checks that would normally apply when using the standard `uses: owner/repo@tag` syntax.\n\nThe author highlights that GitHub does not consider this a security issue, but enosuch disagrees, arguing that ineffective policy mechanisms are worse than no policy at all because they create a false sense of security. Developers, unaware of the bypass, might mistakenly believe their systems are protected, leading to potential vulnerabilities.\n\nThe proposed solutions include: 1) treating local `uses:` references as a separate category in policies and rejecting them if not explicitly allowed, or 2) documenting the limitations of the current policy mechanism to inform users about the potential bypass. While the author acknowledges this isn't a critical vulnerability, they emphasize the importance of transparently informing users about the true scope of security policies.\n",
    "chinese_title": "以最愚蠢的方式绕过GitHub Actions策略",
    "chinese_summary": "本文讨论了一种绕过GitHub Actions策略的简单方法，这些策略旨在限制在仓库、组织或企业内部对actions和可重用工作流的使用。作者enosuch认为，当前的策略机制很容易被规避，只需将所需的action仓库直接克隆到runner的文件系统中，然后使用相对路径（例如，`uses: ./path/to/checkout`）来执行它。这样可以避免在使用标准`uses: owner/repo@tag`语法时通常会应用的策略检查。\n\n作者强调，GitHub并不认为这是一个安全问题，但enosuch对此表示不同意，他认为无效的策略机制比没有策略更糟糕，因为它会产生一种虚假的安全感。开发人员在不知情的情况下，可能会错误地认为他们的系统受到了保护，从而导致潜在的漏洞。\n\n提出的解决方案包括：1) 将本地`uses:`引用视为策略中的一个单独类别，如果未明确允许，则拒绝它们；或者 2) 记录当前策略机制的局限性，告知用户潜在的绕过风险。作者承认这并非一个严重漏洞，但强调了透明地告知用户安全策略的真实范围的重要性。"
  },
  {
    "id": "44249417",
    "title": "Dolly Parton's Dollywood Express",
    "url": "https://thetransitguy.substack.com/p/dolly-parton-runs-a-train-busier",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "多莉·帕顿的梦幻世界快车",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "44245053",
    "title": "AlphaWrite: AI that improves at writing by evolving its own stories",
    "url": "https://tobysimonds.com/research/2025/06/06/AlphaWrite.html",
    "summary": "AlphaWrite introduces a novel framework for improving creative text generation by scaling inference-time compute, drawing inspiration from evolutionary algorithms like AlphaEvolve. Unlike tasks with clear correctness criteria, creative writing lacks established methods for leveraging increased compute resources. AlphaWrite addresses this by iteratively generating stories, evaluating them via Elo-based pairwise comparisons, and refining top performers over multiple generations.\n\nThe process begins with generating a diverse initial story population through randomized author styles and themes. Stories are then judged against each other using an LLM, guided by a rubric focusing on narrative quality. An Elo ranking system tracks relative story quality. The top-ranked stories are selected as the foundation for the next generation, with variations generated by targeting improvement objectives like character development or plot tension. Lower-ranked stories are replaced with these variants, and the process repeats.\n\nEvaluations with Llama 3.1 8B demonstrated that AlphaWrite significantly outperformed both single-shot generation (72% preference rate) and sequential prompting (62% preference rate). The authors explored recursive self-improvement by distilling enhanced stories back into the base model for retraining, resulting in a 56% preference rate over the original model.\n\nWhile acknowledging limitations like prompt sensitivity and evaluation challenges, the authors highlight the potential for AlphaWrite to extend beyond narrative fiction into technical documentation, academic writing, and model enhancement. By generating high-quality training data, it offers a path to bootstrap better foundation models and advance the writing capabilities of AI systems.\n",
    "chinese_title": "AlphaWrite：通过自主进化故事来提升写作能力的AI",
    "chinese_summary": "AlphaWrite：通过扩展推理时计算资源提升创造性文本生成的新框架\n\nAlphaWrite 引入了一种新颖的框架，通过扩展推理时计算资源来改进创造性文本生成，其灵感来源于像 AlphaEvolve 这样的进化算法。与具有明确正确性标准的任务不同，创造性写作缺乏利用增加的计算资源的既定方法。AlphaWrite 通过迭代生成故事，通过基于 Elo 的成对比较对其进行评估，并在多代中改进表现最佳者来解决这个问题。\n\n该过程首先通过随机化的作者风格和主题生成多样化的初始故事群体。然后，使用 LLM 根据侧重于叙事质量的评分标准来相互评判故事。Elo 排名系统跟踪相对故事质量。排名最高的故事被选为下一代的基础，并通过针对角色发展或情节张力等改进目标生成变体。排名较低的故事会被这些变体替换，然后重复该过程。\n\n使用 Llama 3.1 8B 的评估表明，AlphaWrite 显著优于单次生成（72% 的偏好率）和顺序提示（62% 的偏好率）。作者探索了通过将增强的故事提炼回基础模型以进行再训练来进行递归自我改进，结果相对于原始模型产生了 56% 的偏好率。\n\n虽然承认提示敏感性和评估挑战等局限性，但作者强调了 AlphaWrite 在叙事小说之外扩展到技术文档、学术写作和模型增强方面的潜力。通过生成高质量的训练数据，它提供了一条引导更好的基础模型并提高 AI 系统写作能力的途径。"
  },
  {
    "id": "44247029",
    "title": "Show HN: Ikuyo a Travel Planning Web Application",
    "url": "https://ikuyo.kenrick95.org/",
    "summary": "Ikuyo is a travel planning web application, announced on Show HN. The content is very brief and doesn't provide any details about the application's features, target audience, or unique selling points. It's essentially just a title and the name of the application. More information is needed to provide a more detailed summary.\n",
    "chinese_title": "Show HN: Ikuyo 旅行规划Web应用",
    "chinese_summary": "Ikuyo是一个旅游计划网页应用，已在Show HN上发布。 内容非常简短，未提供关于该应用的功能、目标受众或独特卖点的任何细节。 实际上只有标题和应用名称。 需要更多信息才能提供更详细的摘要。"
  },
  {
    "id": "44264494",
    "title": "Major sugar substitute found to impair brain blood vessel cell function",
    "url": "https://medicalxpress.com/news/2025-06-major-sugar-substitute-impair-brain.html",
    "summary": "This article from Phys.org, published on June 12, 2025, reports that the sugar substitute erythritol may impair the function of brain blood vessel cells, potentially increasing stroke risk. A study published in the *Journal of Applied Physiology* by researchers at the University of Colorado Boulder found that erythritol increases oxidative stress, disrupts nitric oxide signaling, raises vasoconstrictive peptide production, and diminishes clot-dissolving capacity in human brain microvascular endothelial cells.\n\nWhile erythritol is popular in low-calorie and diabetic-friendly products due to its low calorie count and minimal impact on blood sugar, epidemiological studies have linked higher plasma erythritol concentrations with increased cardiovascular and cerebrovascular events, independent of other risk factors.\n\nThe study used in vitro experiments, exposing human cerebral microvascular endothelial cells to erythritol levels comparable to those resulting from a typical beverage consumption. The results showed a significant increase in oxidative stress, a decline in nitric oxide production (due to reduced eNOS activation), and impaired fibrinolytic responsiveness (reduced t-PA release). Antioxidant defense markers like SOD-1 and catalase were also elevated.\n\nThe researchers concluded that erythritol disrupts mechanisms vital to brain endothelial health. While the study was conducted under acute in vitro conditions, the findings align with previous epidemiological links between erythritol and elevated stroke risk. The authors recommend further long-term and in vivo studies, including clinical trials, to determine the potential cerebrovascular consequences of repeated dietary erythritol exposure.\n",
    "chinese_title": "主要糖替代品被发现会损害大脑血管细胞功能",
    "chinese_summary": "2025年6月12日Phys.org发表的一篇文章报道称，糖替代品赤藓糖醇可能损害脑血管细胞的功能，从而潜在增加中风风险。科罗拉多大学博尔德分校的研究人员发表在《应用生理学杂志》上的一项研究发现，赤藓糖醇会增加氧化应激，破坏一氧化氮信号传导，提高血管收缩肽的产生，并降低人脑微血管内皮细胞的血栓溶解能力。\n\n虽然赤藓糖醇因其低热量和对血糖的微小影响而在低热量和糖尿病友好型产品中很受欢迎，但流行病学研究已将较高的血浆赤藓糖醇浓度与心血管和脑血管事件的增加联系起来，与其他风险因素无关。\n\n该研究使用了体外实验，将人脑微血管内皮细胞暴露于赤藓糖醇水平，该水平与典型饮料消费产生的水平相当。结果表明，氧化应激显著增加，一氧化氮产量下降（由于eNOS激活减少），以及纤溶反应受损（t-PA释放减少）。抗氧化防御标志物，如SOD-1和过氧化氢酶也升高。\n\n研究人员得出结论，赤藓糖醇破坏了对脑内皮健康至关重要的机制。虽然这项研究是在急性体外条件下进行的，但研究结果与之前赤藓糖醇与中风风险升高的流行病学联系相符。作者建议进行进一步的长期和体内研究，包括临床试验，以确定重复膳食暴露于赤藓糖醇可能产生的脑血管后果。"
  },
  {
    "id": "44246518",
    "title": "Firefox OS's story from a Mozilla insider not working on the project (2024)",
    "url": "https://ludovic.hirlimann.net/2024/01/firefox-oss-story-from-mozila-insider.html",
    "summary": "This blog post recounts the history of Firefox OS (formerly Boot 2 Gecko - B2G) from the perspective of a former Mozilla employee in the messaging team (Thunderbird). The author remembers Mozilla's fear of missing the mobile revolution dominated by iPhone and Android, leading to the development of B2G as an independent mobile platform based on web technologies.\n\nThe shift to B2G caused significant changes within Mozilla, including a shift from a flat organization to a more hierarchical one, a loss of focus on Thunderbird, and ultimately, a neglect of the core desktop Firefox browser. The author felt the B2G project led to the demise of the Thunderbird team.\n\nMozilla invested heavily in B2G, partnering with carriers and phone manufacturers, leading to conflicting requirements and a rush to market, often sacrificing quality. Despite these efforts, Firefox OS failed to gain traction and was eventually discontinued in 2015, with Mozilla refocusing on the desktop browser.\n\nThe author reflects on the good intentions of B2G, particularly the desire to challenge Apple and own the complete technology stack. However, they criticize the rushed development, the neglect of the desktop browser, and the premature engagement with partners before the product was ready. They believe a more gradual approach, with more internal testing and community engagement, would have been more successful. They link the end of the B2G project to the decline of Mozilla's engagement with its community. The author does reference the continuation of the project in a way with the current product KaiOS.\n",
    "chinese_title": "一个Mozilla内部人士讲述的Firefox OS的故事（非项目参与者视角，2024）",
    "chinese_summary": "本文讲述了前Mozilla消息团队（Thunderbird）员工眼中的Firefox OS（前身为Boot 2 Gecko - B2G）的历史。作者回忆起Mozilla对错失iPhone和Android主导的移动革命的担忧，导致了B2G的开发，B2G是一个基于Web技术的独立移动平台。\n\n转向B2G给Mozilla带来了重大变化，包括从扁平化组织转变为更等级化的组织，对Thunderbird的关注减少，最终导致对核心桌面Firefox浏览器的忽视。作者认为B2G项目导致了Thunderbird团队的解散。\n\nMozilla在B2G上投入巨资，与运营商和手机制造商合作，导致需求冲突和赶往市场，常常牺牲质量。尽管如此，Firefox OS未能获得市场认可，最终于2015年停止开发，Mozilla重新专注于桌面浏览器。\n\n作者反思了B2G的良好意愿，特别是挑战苹果并掌握完整技术栈的愿望。然而，他们批评了仓促的开发、对桌面浏览器的忽视以及在产品准备好之前与合作伙伴过早接触。他们认为，更渐进的方法，更多的内部测试和社区参与，会更加成功。他们将B2G项目的结束与Mozilla与社区的互动减少联系起来。作者确实提到了该项目以某种方式通过当前产品KaiOS延续下来。"
  },
  {
    "id": "44226978",
    "title": "Apple announces Foundation Models and Containerization frameworks, etc",
    "url": "https://www.apple.com/newsroom/2025/06/apple-supercharges-its-tools-and-technologies-for-developers/",
    "summary": "Here's a concise summary of the Apple developer-focused press release:\n\nApple announced a range of new technologies and enhancements for developers to build more engaging and intelligent apps across Apple platforms. A key highlight is the **Foundation Models framework**, giving developers access to on-device Apple Intelligence capabilities for privacy-centric AI inference in their apps.  This includes support for features like guided generation and tool calling.\n\n**Xcode 26** integrates large language models like ChatGPT directly into the coding environment, allowing developers to write code, tests, and documentation more efficiently. Coding Tools offer suggested actions and handle specific prompts inline. Xcode 26 also features improvements to navigation, localization, and Voice Control support.\n\nA new **Liquid Glass design** offers a more expressive and delightful user interface, which can be easily adopted using frameworks like SwiftUI. The new **Icon Composer** app helps create captivating app icons.\n\nOther key updates include improvements to **App Intents** with support for visual intelligence (using visual search results). **Swift 6.2** enhances performance, concurrency, and interoperability and gains support for WebAssembly. The **Containerization framework** enables running Linux container images directly on Mac.\n\nFor gaming, **Game Porting Toolkit 3** provides enhanced evaluation and profiling tools. **Metal 4** is designed for Apple silicon and enables advanced graphics and machine learning technologies like real-time ray tracing and shader-based inference networks. The **Apple Games app** is a new all-in-one destination for games and friends, including a new dedicated app for developers. A new **Challenges feature** offers new ways to engage in score-based showdowns with friends. Additional features include a **Game Overlay** to enhance engagement, and **Managed Background Assets** to simplify asset hosting.\n\nFor protecting kids online, the **Declared Age Range API** allows developers to deliver age-appropriate content with parental consent. **Accessibility Nutrition Labels** will now appear on App Store product pages, informing users about supported accessibility features.\n",
    "chinese_title": "苹果发布基础模型和容器化框架等",
    "chinese_summary": "以下是苹果开发者发布会新闻稿的简要总结：\n\n苹果宣布了一系列面向开发者的全新技术和增强功能，以构建更具吸引力和智能化的跨平台应用程序。其中一个主要亮点是 **Foundation Models框架**，它使开发者能够访问设备上的Apple Intelligence功能，以便在其应用程序中进行以隐私为中心的AI推理。这包括对引导式生成和工具调用等功能的支持。\n\n**Xcode 26** 将ChatGPT等大型语言模型直接集成到编码环境中，使开发者能够更高效地编写代码、测试和文档。Coding Tools提供建议操作并以内联方式处理特定提示。Xcode 26还改进了导航、本地化和语音控制支持。\n\n一种新的**Liquid Glass设计**提供更具表现力和令人愉悦的用户界面，可以使用SwiftUI等框架轻松采用。新的 **Icon Composer** 应用程序可帮助创建引人入胜的应用程序图标。\n\n其他主要更新包括改进了 **App Intents**，并支持视觉智能（使用视觉搜索结果）。**Swift 6.2** 提高了性能、并发性和互操作性，并获得了对WebAssembly的支持。**Containerization框架** 使得可以直接在Mac上运行Linux容器镜像。\n\n对于游戏，**Game Porting Toolkit 3** 提供了增强的评估和分析工具。**Metal 4** 专为Apple芯片设计，并支持先进的图形和机器学习技术，如实时光线追踪和基于着色器的推理网络。**Apple Games app** 是一个全新的游戏和朋友的一站式目的地，包括一个专为开发者设计的新应用程序。新的 **Challenges feature** 提供了与朋友进行基于分数的对决的新方式。其他功能包括 **Game Overlay** 以增强参与度，以及 **Managed Background Assets** 以简化资产托管。\n\n为了保护儿童在线安全，**Declared Age Range API** 允许开发者在征得家长同意的情况下提供适合年龄的内容。**Accessibility Nutrition Labels** 现在将出现在App Store产品页面上，告知用户支持的辅助功能。"
  }
]