[
  {
    "id": "43927926",
    "title": "Void: Open-source Cursor alternative",
    "url": "https://github.com/voideditor/void",
    "summary": "Void is an open-source alternative to the Cursor code editor. The repository contains the full source code for Void, welcoming new contributors. The project encourages community involvement through a Discord server, contribution guidelines (HOW_TO_CONTRIBUTE), and a roadmap for future development. It provides a changelog and a codebase guide (VOID_CODEBASE_GUIDE) for navigation. Void encourages contributions, collaborations, and suggestions, inviting interested individuals to participate in weekly meetings on Discord. As a fork of the VS Code repository, the VOID_CODEBASE_GUIDE helps developers understand the underlying structure. Support and communication channels are available via Discord or email (hello@voideditor.com).\n",
    "chinese_title": "Void：开源光标替代方案",
    "chinese_summary": "Void：Cursor代码编辑器的开源替代品。该仓库包含Void的完整源代码，欢迎新的贡献者。该项目鼓励通过Discord服务器、贡献指南（HOW_TO_CONTRIBUTE）和未来开发路线图来促进社区参与。它提供了更新日志和代码库指南（VOID_CODEBASE_GUIDE）以方便导航。Void鼓励贡献、协作和建议，邀请感兴趣的人士参与每周在Discord上举行的会议。作为VS Code仓库的一个分支，VOID_CODEBASE_GUIDE帮助开发者理解底层结构。可以通过Discord或电子邮件(hello@voideditor.com)获取支持和进行沟通。"
  },
  {
    "id": "43927337",
    "title": "Progress toward fusion energy gain as measured against the Lawson criteria",
    "url": "https://www.fusionenergybase.com/articles/continuing-progress-toward-fusion-energy-breakeven-and-gain-as-measured-against-the-lawson-criteria",
    "summary": "This article focuses on progress made towards achieving fusion energy gain, using the Lawson criteria as a benchmark. The Lawson criteria, in essence, defines the necessary conditions – a combination of plasma density, temperature, and confinement time – for a fusion reaction to produce more energy than is used to heat and confine the plasma.\n\nThe article likely discusses how experimental fusion devices, such as tokamaks and stellarators, are striving to meet and exceed the Lawson criteria. It probably highlights recent advancements in these devices, specifically focusing on improvements in plasma density, temperature, and confinement time. These advancements might include the use of advanced magnetic confinement techniques, improved heating methods, and optimized plasma fueling and control.\n\nFurthermore, the article likely addresses the challenges that still need to be overcome to achieve sustained and commercially viable fusion energy. These challenges may include maintaining plasma stability, managing heat exhaust from the plasma, and developing advanced materials that can withstand the extreme conditions within a fusion reactor. It could also mention different fusion approaches beyond magnetic confinement, such as inertial confinement fusion, and their respective progress against similar, though modified, Lawson-like criteria.\n\nIn conclusion, the article provides an overview of the current status of fusion energy research, gauging progress against the fundamental requirements for energy gain as defined by the Lawson criteria and identifying the key hurdles that remain on the path to realizing fusion power.\n",
    "chinese_title": "针对劳森判据衡量的聚变能量增益进展",
    "chinese_summary": "本文以劳逊判据为基准，重点关注在实现聚变能量增益方面取得的进展。劳逊判据本质上定义了聚变反应产生比加热和约束等离子体所用能量更多的能量所需的必要条件——等离子体密度、温度和约束时间的组合。\n\n文章可能讨论了托卡马克和仿星器等实验性聚变装置如何努力达到并超过劳逊判据。它可能突出了这些装置的最新进展，特别关注等离子体密度、温度和约束时间的改进。这些进展可能包括使用先进的磁约束技术、改进的加热方法以及优化的等离子体燃料供应和控制。\n\n此外，文章可能还会探讨为实现可持续和商业上可行的聚变能源仍需克服的挑战。这些挑战可能包括维持等离子体稳定性、管理等离子体的热排放，以及开发能够承受聚变反应堆内极端条件的先进材料。文章也可能提及磁约束以外的不同聚变方法，例如惯性约束聚变，以及它们各自在满足类似但经过修改的类劳逊判据方面取得的进展。\n\n总而言之，本文概述了聚变能源研究的现状，根据劳逊判据定义的能量增益基本要求来衡量进展，并确定了在实现聚变能源道路上仍然存在的关键障碍。"
  },
  {
    "id": "43928118",
    "title": "Show HN: Using eBPF to see through encryption without a proxy",
    "url": "https://github.com/qpoint-io/qtap",
    "summary": "Qtap is an eBPF-based agent that intercepts network traffic within the Linux kernel before and after TLS/SSL encryption, providing full visibility into unencrypted data without requiring application modifications, proxies, or certificate management. It captures data by attaching to TLS/SSL functions and passing it to flexible plugins, along with context like process, container, and protocol. This allows users to understand egress traffic without adding latency or disrupting performance.\n\nQtap can be used for security auditing, debugging network issues, API development, troubleshooting third-party integrations, learning protocols, investigating legacy systems, and validation testing. It offers a \"demo mode\" for quick testing and a simple installation process.\n\nThe project requires Linux with Kernel 5.10+ with BTF enabled and eBPF enabled on the host. It's under active development, so some APIs might change, documentation may be incomplete, and some features may still be rough around the edges. Contributions are welcome via GitHub issues. It is dual-licensed under AGPLv3.0 (open source) and a commercial license. The article also details development prerequisites, quick start commands, and popular Makefile targets for developers who want to contribute.\n",
    "chinese_title": "展示HN：无需代理，使用eBPF穿透加密",
    "chinese_summary": "Qtap: 基于 eBPF 的 TLS/SSL 加密前后流量拦截代理，无需修改应用程序即可实现数据可见性\n\nQtap 是一款基于 eBPF 的代理，可在 Linux 内核中 TLS/SSL 加密前后拦截网络流量，无需修改应用程序、使用代理或进行证书管理，即可完全了解未加密的数据。它通过附加到 TLS/SSL 函数来捕获数据，并将其传递给灵活的插件，同时提供进程、容器和协议等上下文信息。这使用户能够在不增加延迟或中断性能的情况下了解出口流量。\n\nQtap 可用于安全审计、调试网络问题、API 开发、解决第三方集成问题、学习协议、调查遗留系统和验证测试。它提供了一个“演示模式”用于快速测试，并且安装过程简单。\n\n该项目需要在启用了 BTF 和 eBPF 的 Linux Kernel 5.10+ 上运行。 由于该项目正在积极开发中，因此某些 API 可能会更改，文档可能不完整，并且某些功能可能仍不完善。欢迎通过 GitHub Issues 提交贡献。 它在 AGPLv3.0（开源）和商业许可下双重许可。 本文还详细介绍了开发先决条件、快速启动命令以及希望做出贡献的开发人员常用的 Makefile 目标。"
  },
  {
    "id": "43927856",
    "title": "Habemus Papam - new pope elected on second day of the conclave",
    "url": "https://www.cnn.com/world/live-news/new-pope-conclave-day-two-05-08-25",
    "summary": "The cardinals have elected a new Pope on the second day of the conclave. Robert Prevost of the US has been chosen, making him the first American pontiff in history. He will be known as Pope Leo XIV. The election was signaled by white smoke emanating from the Sistine Chapel. The conclave involved 133 voting cardinals sequestered inside the Vatican, requiring a two-thirds majority vote for election.\n",
    "chinese_title": "我们有教皇了 - 教廷会议第二天选出新教皇",
    "chinese_summary": "枢机主教团在第二天选举出新教皇。来自美国的罗伯特·普雷沃斯特当选，成为历史上首位美国籍教皇。他将被称为利奥十四世教皇。西斯廷教堂冒出白烟，标志着选举结果产生。枢机主教团包括133位有投票权的枢机主教，他们被隔离在梵蒂冈内，需要三分之二的多数票才能当选。"
  },
  {
    "id": "43927914",
    "title": "Notes on rolling out Cursor and Claude Code",
    "url": "https://ghiculescu.substack.com/p/nobody-codes-here-anymore",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "发布 Cursor 和 Claude Code 的注意事项",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "43924358",
    "title": "Using NASA’s SMAP satellite to detect L-band interference",
    "url": "https://radioandnukes.substack.com/p/how-dare-you-transmit-at-14-ghz",
    "summary": "Here's a summary of the article \"Using NASA’s SMAP satellite to detect L-band interference\" from radioandnukes.substack.com:\n\nThe article discusses how NASA's Soil Moisture Active Passive (SMAP) satellite, primarily designed to measure soil moisture using a 1.4 GHz L-band radiometer, is also used to detect and monitor radio frequency interference (RFI) in that crucial part of the spectrum. The 1.4 GHz band is protected for passive sensing, meaning intentional transmissions are prohibited. However, illegal or unintended transmissions can interfere with SMAP's ability to accurately measure soil moisture, a vital parameter for weather forecasting, agriculture, and climate modeling.\n\nThe author highlights the challenges posed by RFI, emphasizing that these interfering signals can mimic or distort the natural microwave emissions from the Earth's surface, leading to erroneous soil moisture readings. The article explains that SMAP is equipped with sophisticated signal processing techniques to identify and flag areas affected by RFI. Analyzing the patterns and characteristics of the interference helps researchers track down the sources.\n\nThe author points out that identifying the source of L-band RFI is crucial, as it allows regulatory bodies (like the FCC) to take action against illegal transmitters or address issues like equipment malfunctions that cause unintended emissions. The article concludes by stressing the importance of maintaining a clean L-band spectrum for accurate Earth observation data and underscores the ongoing efforts to mitigate RFI through international cooperation and technological advancements. Essentially, SMAP acts as a space-based \"RFI cop,\" monitoring and reporting on illegal transmissions within its designated band.\n",
    "chinese_title": "利用NASA的SMAP卫星探测L波段干扰",
    "chinese_summary": "以下是radioandnukes.substack.com上文章“利用NASA的SMAP卫星探测L波段干扰”的摘要：\n\n该文章探讨了NASA的土壤湿度主动被动（SMAP）卫星，其主要设计目的是使用1.4 GHz L波段辐射计测量土壤湿度，同时也用于探测和监测该关键频谱部分的射频干扰（RFI）。1.4 GHz频段受到保护，用于被动传感，这意味着禁止有意传输。然而，非法或意外的传输可能会干扰SMAP精确测量土壤湿度的能力，而土壤湿度是天气预报、农业和气候建模的重要参数。\n\n作者强调了RFI带来的挑战，强调这些干扰信号可以模仿或扭曲地球表面的自然微波辐射，导致错误的土壤湿度读数。文章解释说，SMAP配备了复杂的信号处理技术，可以识别并标记受RFI影响的区域。分析干扰的模式和特征有助于研究人员追踪干扰源。\n\n作者指出，识别L波段RFI的来源至关重要，因为这允许监管机构（如FCC）对非法发射器采取行动，或解决诸如设备故障导致意外发射的问题。文章最后强调了保持清洁的L波段频谱对于准确的地球观测数据的重要性，并强调了通过国际合作和技术进步来缓解RFI的持续努力。本质上，SMAP充当了一个基于太空的“RFI警察”，监测和报告其指定频段内的非法传输。"
  },
  {
    "id": "43928294",
    "title": "Ciro (YC S22) is hiring a software engineer to build AI agents for sales",
    "url": "https://www.ycombinator.com/companies/ciro/jobs",
    "summary": "Ciro (YC S22) is hiring a Software Engineer in San Francisco to build AI agents for sales prospecting. The role offers a salary of $150K - $200K with 0.75% - 1.50% equity, requiring 3+ years of experience.\n\nCiro aims to automate and improve the efficiency of sales prospecting, making it 10x easier to scan, qualify, and enrich leads on platforms like LinkedIn. The company tackles the problem of sales reps spending significant time manually searching for and qualifying leads.\n\nThe company boasts a strong team with experience from Meta, Stanford, Google, and Bain & Co., including founders who previously served as VPs of Sales at high-growth SaaS startups. Ciro is cash flow positive and backed by prominent investors such as Y Combinator, SV Angel, CRV, and the founders of Flexport, BuildZoom, and Tegus.\n\nCiro's values emphasize excellence, urgency, and teamwork, fostering a collegial environment built on trust and transparency. Founded in 2022, the company currently has a team size of 5. The founders are Ross Geiger, Richard Lee, and David Winer.\n",
    "chinese_title": "Ciro (YC S22) 正在招聘一名软件工程师，负责构建用于销售的人工智能代理。",
    "chinese_summary": "Ciro (YC S22) 正在旧金山招聘软件工程师，以构建用于销售线索挖掘的 AI 代理。该职位提供 15 万美元至 20 万美元的年薪，以及 0.75% 至 1.50% 的股权，要求 3 年以上的工作经验。\n\nCiro 旨在自动化并提高销售线索挖掘的效率，使在 LinkedIn 等平台上扫描、筛选和丰富线索的工作变得更加轻松。该公司致力于解决销售代表花费大量时间手动搜索和筛选线索的问题。\n\n该公司拥有一支强大的团队，成员来自 Meta、斯坦福大学、谷歌和贝恩咨询，包括曾在高增长 SaaS 初创公司担任销售副总裁的创始人。Ciro 现金流为正，并获得 Y Combinator、SV Angel、CRV 以及 Flexport、BuildZoom 和 Tegus 创始人的支持。\n\nCiro 的价值观强调卓越、紧迫性和团队合作，营造一个建立在信任和透明基础上的友好环境。该公司成立于 2022 年，目前团队规模为 5 人。创始人为 Ross Geiger、Richard Lee 和 David Winer。"
  },
  {
    "id": "43892446",
    "title": "Using Coalton to implement a quantum compiler (2022)",
    "url": "https://coalton-lang.github.io/20220906-quantum-compiler/",
    "summary": "This article discusses using Coalton, a statically typed language within Common Lisp, to implement a new feature called \"discrete compilation\" in the quilc quantum compiler. Quilc, written in Common Lisp, optimizes quantum programs but suffers from runtime type errors and a lack of certain abstractions due to dynamic typing. Coalton aims to address these issues.\n\nDiscrete compilation tackles the problem of approximating arbitrary quantum operations with a *discrete* set of native operations, as opposed to continuous ones that are prone to analog noise. The article focuses on an algorithm by Ross and Selinger using the Clifford+T gate set to approximate arbitrary one-qubit unitary matrices.\n\nA major challenge in implementing this algorithm is working with various, interoperable number types, specifically different number rings. Common Lisp's flexibility comes at the cost of cumbersome implementation due to a lack of operator overloading and difficulties in managing conversions.\n\nCoalton's type class system, particularly the `Num` type class, provides a more elegant and type-safe solution. It allows extending existing operators like `+` and `*` to work with custom number types, simplifying the implementation of arithmetic within these rings. The article demonstrates this by implementing the algebraic number ring $\\mathbb{Z}[\\sqrt{2}]$ and defining its operations, highlighting Coalton's advantage in handling mathematical abstractions compared to Common Lisp. The article implies that Coalton's features make implementing complex mathematical structures in code more manageable and less error-prone, making it a valuable tool for tasks like quantum compiler development.\n",
    "chinese_title": "使用Coalton实现量子编译器 (2022)",
    "chinese_summary": "本文探讨了在quilc量子编译器中使用Common Lisp中的静态类型语言Coalton实现名为“离散编译”的新特性。Quilc使用Common Lisp编写，用于优化量子程序，但由于动态类型，存在运行时类型错误和缺乏某些抽象的问题。Coalton旨在解决这些问题。\n\n离散编译旨在解决使用*离散*原生操作集合近似任意量子操作的问题，而不是容易受到模拟噪声影响的连续操作。本文重点介绍Ross和Selinger使用Clifford+T门集合近似任意单量子比特酉矩阵的算法。\n\n实现此算法的一个主要挑战是处理各种可互操作的数字类型，特别是不同的数环。Common Lisp的灵活性带来了实现上的繁琐，因为它缺乏运算符重载并且难以管理转换。\n\nCoalton的类型类系统，特别是`Num`类型类，提供了一个更优雅且类型安全的解决方案。它允许扩展现有运算符（如`+`和`*`）以使用自定义数字类型，从而简化了这些环中算术的实现。本文通过实现代数数环$\\mathbb{Z}[\\sqrt{2}]$并定义其运算来证明这一点，突出了Coalton在处理数学抽象方面优于Common Lisp的优势。本文暗示，Coalton的特性使得在代码中实现复杂的数学结构更易于管理且更不易出错，使其成为量子编译器开发等任务的宝贵工具。"
  },
  {
    "id": "43927948",
    "title": "More people are getting their tattoos removed",
    "url": "https://www.gq.com/story/why-is-everyone-getting-their-tattoos-removed",
    "summary": "The article discusses the increasing popularity of tattoo removal, driven by advancements in laser technology, changing life priorities, and celebrity influence. While the process is described as painful and requiring multiple sessions, modern picosecond lasers are more effective and less abrasive than older methods. These lasers shatter tattoo ink particles, allowing the body's immune system to flush them away.\n\nSeveral factors contribute to the rise in tattoo removal, including millennials regretting youthful decisions, the desire for a fresh start, and the normalization of the procedure through specialty chains and accessible pricing. Celebrities like Pete Davidson, Ariana Grande, and Zoë Kravitz have publicly undergone tattoo removal, further fueling the trend.\n\nThe tattoo industry itself is adapting, with some artists using laser removal to create clean canvases for new designs. While some \"old-school\" tattoo enthusiasts may view the trend as a rejection of the permanence traditionally associated with tattoos, entrepreneurs envision a future where tattoos become more like fashion trends, easily added and removed. The article highlights the potential for a cyclical tattoo culture, where people can express themselves with ink that isn't necessarily forever. Ultimately, the accessibility and evolving attitudes toward tattoos are reshaping the industry and blurring the lines between permanence and ephemerality.\n",
    "chinese_title": "越来越多的人在去除纹身。",
    "chinese_summary": "激光技术进步、生活重心转移和名人效应推动纹身去除日益普及。文章探讨了这一趋势，指出虽然去除过程痛苦且需要多次疗程，但现代皮秒激光比旧方法更有效、磨损更小。这些激光能击碎纹身墨水颗粒，使人体免疫系统将其清除。\n\n导致纹身去除人数增加的因素包括千禧一代后悔年轻时的决定、渴望重新开始，以及专业连锁店和可接受的价格使该手术逐渐普及。像皮特·戴维森、爱莉安娜·格兰德和佐伊·克拉维茨等名人公开进行纹身去除手术，进一步推动了这一趋势。\n\n纹身行业本身也在适应，一些纹身师使用激光去除来为新设计创造干净的画布。虽然一些“老派”纹身爱好者可能认为这种趋势是对纹身传统永久性的否定，但企业家们设想未来纹身会更像时尚潮流，可以轻松添加和去除。文章强调了循环纹身文化的潜力，在这种文化中，人们可以用不一定是永久性的墨水来表达自己。 最终，纹身的普及和不断变化的观念正在重塑纹身行业，并模糊了永久性和短暂性之间的界限。"
  },
  {
    "id": "43925982",
    "title": "Google to back three new nuclear projects",
    "url": "https://www.esgtoday.com/google-to-back-three-new-advanced-nuclear-projects/",
    "summary": "In May 2025, Google announced a collaboration with Elementl Power to invest in three advanced nuclear energy projects, each capable of generating at least 600 MW of power. This move aims to address Google's rising emissions, which have increased significantly due to growing data center electricity consumption despite its carbon-free energy goals (net zero by 2030 and 24/7 carbon-free energy). Google's emissions increased by 48% since 2019.\n\nThis agreement follows Google's previous nuclear energy initiatives, including a project with Kairos Power to deploy small advanced nuclear power projects. Amanda Peterson Corio of Google emphasized the company's commitment to strengthening power grids and utilizing advanced nuclear technology for reliable, 24/7 energy, particularly in light of increasing AI demands.\n\nGoogle and Meta had previously pledged to support tripling global nuclear energy capacity by 2050, acknowledging the need for increased energy resilience, security, and clean energy supply. Elementl Power, established in 2023, aims to bring over 10 gigawatts online in the U.S. by 2035, using next-generation nuclear technology. According to Elementl Power, partnerships such as the one with Google are crucial for mobilizing the capital needed to build new nuclear projects and achieve net-zero goals.\n",
    "chinese_title": "谷歌将支持三个新的核能项目",
    "chinese_summary": "2025年5月，谷歌宣布与Elementl Power合作，投资三个先进核能项目，每个项目发电能力至少为600兆瓦。此举旨在解决谷歌日益增长的排放问题，尽管谷歌制定了无碳能源目标（到2030年实现净零排放和24/7全天候无碳能源），但由于数据中心电力消耗的增长，其排放量已显著增加。自2019年以来，谷歌的排放量增加了48%。\n\n在此协议之前，谷歌曾实施过核能计划，包括与Kairos Power合作部署小型先进核电项目。谷歌的阿曼达·彼得森·科里奥强调了该公司致力于加强电网并利用先进核技术来实现可靠、全天候能源供应的承诺，尤其是在人工智能需求不断增长的情况下。\n\n谷歌和Meta此前曾承诺支持到2050年将全球核能容量增加三倍，并承认需要提高能源弹性、安全性和清洁能源供应。Elementl Power成立于2023年，旨在到2035年在美国上线超过10吉瓦的电力，采用下一代核技术。Elementl Power表示，与谷歌等公司的合作对于调动建设新核项目和实现净零目标所需的资金至关重要。"
  },
  {
    "id": "43928315",
    "title": "Reservoir Sampling",
    "url": "https://samwho.dev/reservoir-sampling/",
    "summary": "This article explains reservoir sampling, a technique for selecting a random sample from a data stream of unknown size, particularly useful when you can't store the entire stream. It avoids exceeding memory limits while ensuring a fair selection.\n\nThe problem is illustrated with a log collection service example, where the goal is to sample logs fairly without overloading the system during spikes. A simple random selection discards too many logs during quiet periods, while storing everything is memory-intensive and unpredictable.\n\nReservoir sampling works by maintaining a \"reservoir\" of 'k' elements.  For each new element encountered, it has a `k/n` chance of replacing a random element in the reservoir, where `n` is the total number of elements seen so far.  This ensures all elements have an equal probability of being selected in the final sample.  The article explains the math behind this, demonstrating how the probability of an element staying in the reservoir is maintained equally across all elements seen.\n\nThe article details how to implement reservoir sampling for a single element (k=1) and then extends it to multiple elements (k>1).  It also discusses how this technique applies to the log collection service, illustrating the trade-off between real-time streaming and chunk-based sampling.  The key takeaway is predictable memory usage and avoiding overload while preserving fairness. Finally, it mentions a weighted version of reservoir sampling for situations where certain elements are more valuable and should be prioritized.\n",
    "chinese_title": "水库抽样",
    "chinese_summary": "本文解释了水塘抽样，这是一种从未知大小的数据流中选择随机样本的技术，尤其适用于无法存储整个数据流的情况。它避免了超出内存限制，同时确保了公平的选择。\n\n文章通过一个日志收集服务案例来说明这个问题，其目标是在不因高峰期过载系统的情况下公平地对日志进行抽样。简单的随机选择会在平静时期丢弃太多日志，而存储所有内容则会占用大量内存且不可预测。\n\n水塘抽样的工作原理是维护一个包含“k”个元素的“水塘”。对于遇到的每个新元素，它有`k/n`的概率替换水塘中的一个随机元素，其中`n`是到目前为止看到的元素总数。这确保了所有元素都有相同的概率被选中作为最终样本。文章解释了这背后的数学原理，证明了元素保留在水塘中的概率在所有已见元素中是如何保持一致的。\n\n文章详细介绍了如何为单个元素（k=1）实现水塘抽样，然后将其扩展到多个元素（k>1）。它还讨论了这项技术如何应用于日志收集服务，说明了实时流式传输和基于块的抽样之间的权衡。关键要点是可预测的内存使用量，以及在保持公平性的同时避免过载。最后，它提到了水塘抽样的加权版本，适用于某些元素更有价值且应优先考虑的情况。"
  },
  {
    "id": "43901190",
    "title": "How to harden GitHub Actions",
    "url": "https://www.wiz.io/blog/github-actions-security-guide",
    "summary": "This article outlines strategies for hardening GitHub Actions to mitigate supply chain attacks and other security risks. It emphasizes that securing GitHub Actions requires a multi-layered approach, starting with configuring GitHub environment settings like setting default workflow permissions to read-only, limiting actions to verified sources, and restricting runner adoption. Branch protection rules are also crucial to prevent malicious commits.\n\nThe article stresses careful secrets management, advocating for repository-level secrets as the default and environment-level secrets for granular control. Writing secure workflows involves managing permissions, minimizing reliance on third-party actions (preferring verified actions), and hash pinning versions when unavoidable.\n\nIt highlights common workflow vulnerabilities, categorized under Poisoned Pipeline Execution (PPE), including the misuse of triggers like `pull_request_target` (\"Pwn Request\"), leveraging CI/CD tools for unintended code execution (\"Living Off The Pipeline\"), and risks associated with `GITHUB_ENV` and `GITHUB_PATH`. The article also discusses command injection vulnerabilities due to attacker-controlled workflow elements and proper artifact/credential handling, with a focus on preventing credential leakage.\n\nFinally, it addresses the risks of self-hosted runners, emphasizing the security implications of non-ephemeral environments that persist between jobs.\n",
    "chinese_title": "如何加固 GitHub Actions",
    "chinese_summary": "本文概述了强化 GitHub Actions 以缓解供应链攻击和其他安全风险的策略。它强调，保护 GitHub Actions 需要一种多层方法，首先要配置 GitHub 环境设置，例如将默认工作流权限设置为只读、限制操作来源为已验证的源，并限制 Runner 的采用。分支保护规则对于防止恶意提交也至关重要。\n\n本文强调了细致的密钥管理，提倡将存储库级别的密钥作为默认设置，并将环境级别的密钥用于细粒度控制。编写安全的工作流涉及管理权限、尽量减少对第三方操作的依赖（首选已验证的操作），以及在不可避免的情况下进行哈希固定版本。\n\n本文重点介绍了常见的 Workflow 漏洞，这些漏洞归类于“中毒管道执行 (PPE)”下，包括滥用 `pull_request_target` 等触发器（“Pwn Request”）、利用 CI/CD 工具进行非预期的代码执行（“Living Off The Pipeline”）以及与 `GITHUB_ENV` 和 `GITHUB_PATH` 相关的风险。本文还讨论了由于攻击者控制的工作流元素而导致的命令注入漏洞，以及正确的工件/凭据处理，重点是防止凭据泄露。\n\n最后，本文讨论了自托管 Runner 的风险，强调了在作业之间持续存在的非临时环境的安全隐患。"
  },
  {
    "id": "43927813",
    "title": "High tariffs become 'real' with our first $36K bill",
    "url": "https://blog.adafruit.com/2025/05/08/high-tariffs-become-real-with-our-first-36k-bill/",
    "summary": "Okay, I have read the article at the provided URL.\n\nHere's a summary of the Adafruit blog post \"High tariffs become 'real' with our first $36K bill\":\n\nThe blog post details Adafruit's experience with significantly increased tariffs on imported electronic components. They received their first bill reflecting the new tariff rates, totaling a staggering $36,000. The post highlights the immediate and tangible impact of these tariffs on their business, emphasizing that this isn't an abstract political issue but a very real financial burden.\n\nAdafruit explains they had been warning about the potential consequences of high tariffs for some time, and now those predictions are coming to fruition. The tariffs directly increase the cost of goods sold, making it more expensive to manufacture and sell their electronic products.\n\nThe blog post conveys concern that these increased costs will ultimately be passed on to consumers, potentially impacting the affordability and accessibility of electronics and educational tools. Adafruit suggests they will likely need to adjust their pricing strategies or explore alternative sourcing options to mitigate the financial impact. The overall tone is one of concern and a call for awareness regarding the real-world consequences of trade policies like high tariffs on small businesses and the electronics industry. They imply that these tariffs could ultimately hinder innovation and education in the STEM fields.\n",
    "chinese_title": "高关税“真实”了，我们的首张3.6万美元账单",
    "chinese_summary": "好的，我已阅读提供的URL中的文章。\n\n以下是 Adafruit 博客文章 “高关税变成 ‘现实’，我们的第一笔 3.6 万美元账单” 的摘要：\n\n该博客文章详细介绍了 Adafruit 在进口电子元件方面面临大幅提高的关税的经历。 他们收到了第一张反映新关税税率的账单，总额高达 3.6 万美元。 该文章强调了这些关税对其业务的直接和切实影响，强调这并非抽象的政治问题，而是非常真实的财务负担。\n\nAdafruit 解释说，他们已经警告高关税可能造成的后果一段时间了，现在这些预测正在变为现实。 关税直接增加了销售商品的成本，使得制造和销售他们的电子产品的成本更高。\n\n该博客文章表达了担忧，即这些增加的成本最终将转嫁给消费者，可能会影响电子产品和教育工具的负担能力和可及性。 Adafruit 建议他们可能需要调整定价策略或探索替代采购方案，以减轻财务影响。 总体基调是担忧，并呼吁人们关注高关税等贸易政策对小型企业和电子行业的实际影响。 他们暗示，这些关税最终可能会阻碍 STEM 领域的创新和教育。"
  },
  {
    "id": "43926165",
    "title": "My new deadline: 20 years to give away virtually all my wealth",
    "url": "https://www.gatesnotes.com/home/home-page-topic/reader/n20-years-to-give-away-virtually-all-my-wealth",
    "summary": "The article, \"My new deadline: 20 years to give away virtually all my wealth,\" is a blog post by Bill Gates explaining his renewed commitment to philanthropy and a stricter deadline for distributing his wealth. Gates states that despite the massive progress made by the Bill & Melinda Gates Foundation, global setbacks like the pandemic, the war in Ukraine, and climate change have created a pressing need to accelerate their work.\n\nHe announces he will increase the foundation's annual spending to $9 billion by 2026, a 50% increase from pre-pandemic levels. To facilitate this larger effort, he is transferring an additional $20 billion to the foundation's endowment.\n\nGates acknowledges the irony of striving to give away his wealth as quickly as possible, but argues that the suffering caused by current global crises necessitates immediate action. He intends to use his remaining resources and influence to address issues like global health, climate change, gender equality, and food security.\n\nHe concludes by saying he plans to come off the list of the world’s richest people and give virtually all his wealth to the foundation within the next 20 years. He acknowledges this is an ambitious goal, requiring him to continue working hard and creatively, but expresses optimism about the foundation’s ability to make a significant difference with the resources it has. He hopes that others with significant wealth will also step up to address the challenges facing the world.\n",
    "chinese_title": "我的新期限：20年内捐出几乎所有财富",
    "chinese_summary": "文章《我的新截止日期：20年内捐出几乎所有财富》是比尔·盖茨的一篇博文，解释了他对慈善事业的重新承诺以及更严格的财富捐赠期限。盖茨表示，尽管比尔及梅琳达·盖茨基金会取得了巨大进展，但疫情、乌克兰战争和气候变化等全球挫折造成了加速其工作的迫切需求。\n\n他宣布，到2026年，基金会的年度支出将增加到90亿美元，比疫情前的水平增加50%。为了促进这项更大的努力，他将额外向基金会的捐赠基金转移200亿美元。\n\n盖茨承认，尽快捐出自己的财富有些讽刺意味，但他认为，当前全球危机造成的苦难需要立即采取行动。他打算利用剩余的资源和影响力来解决全球健康、气候变化、性别平等和粮食安全等问题。\n\n他最后表示，他计划从世界最富有的人名单中消失，并在未来20年内将几乎所有财富捐给基金会。他承认这是一个雄心勃勃的目标，需要他继续努力和创造性地工作，但他对基金会有能力利用现有资源做出重大贡献表示乐观。他希望其他拥有大量财富的人也能站出来应对世界面临的挑战。"
  },
  {
    "id": "43923372",
    "title": "Mycoria is an open and secure overlay network that connects all participants",
    "url": "https://mycoria.org/",
    "summary": "Mycoria is presented as an open, secure overlay network built on the principles of freedom, equality, and privacy, mirroring the early Internet. It aims to connect everyone easily, without bureaucracy, prioritizing authentication, encryption, and private addresses to prevent surveillance and \"spooking.\"\n\nThe design emphasizes simplicity, small size, and compatibility with existing infrastructure like DNS. Key features include automatic end-to-end encryption using modern cryptography, smart and scalable routing, a dashboard, .myco DNS resolution (requiring OS configuration), simple service discovery, and auto-optimization/healing for Internet overlay networks (work in progress). The system is also developing rotating private addresses to enhance privacy (work in progress). Essentially, Mycoria offers a secure and private overlay network with a focus on accessibility and ease of use.\n",
    "chinese_title": "真菌网络：连接所有参与者的开放且安全的覆盖网络",
    "chinese_summary": "Mycoria：一个开放、安全的覆盖网络，基于自由、平等和隐私原则构建，旨在复刻早期互联网。它致力于便捷地连接所有人，无需繁琐流程，优先考虑身份验证、加密和私有地址，以防止监视和“恐吓”。\n\n其设计强调简洁、小巧以及与现有基础设施（如DNS）的兼容性。关键特性包括：使用现代密码学的自动端到端加密、智能且可扩展的路由、仪表板、.myco DNS解析（需要操作系统配置）、简单的服务发现以及用于互联网覆盖网络的自动优化/修复（正在开发中）。该系统还在开发轮换私有地址以增强隐私（正在开发中）。本质上，Mycoria提供了一个安全、私有的覆盖网络，重点在于可访问性和易用性。"
  },
  {
    "id": "43892786",
    "title": "How Obama’s BlackBerry got secured (2013)",
    "url": "https://www.electrospaces.net/2013/04/how-obamas-blackberry-got-secured.html",
    "summary": "This article details how President Barack Obama managed to keep using his beloved BlackBerry after entering office in 2009, despite security concerns. Initially facing pressure to abandon it due to intercept risks and the Presidential Records Act, a solution was devised by the Secret Service, White House Communications Agency, and NSA.\n\nThe solution involved securing the BlackBerry with SecurVoice software, developed by The Genesis Key in cooperation with Research In Motion (RIM). This software encrypted calls, texts, and emails. Richard \"Dickie\" George, the NSA's technical director, oversaw the modification of Obama's BlackBerry to eliminate threats. The NSA also ensured the software met federal standards.\n\nThe secured BlackBerry was issued to a small group of trusted contacts, as secure communication requires both ends to use the same encryption method, limiting Obama's reach. Hillary Clinton's similar request for a secured BlackBerry was denied, leading her to use a private server, which later became controversial.\n\nThe article also highlights potential security risks, such as hardware compromise and location tracking, and measures taken to mitigate them, including regularly changing Obama's email address and lecturing his staff about security. The article references the use of secure base stations to mask the IMEI-number to prevent tracking.\n\nUltimately, Obama's case marked a shift towards software-based security solutions for mobile devices. It was later revealed that while Russian hackers breached White House email servers, they failed to penetrate the BlackBerry's security. As of August 2023, Obama's actual BlackBerry devices are on display in the National Cryptologic Museum.\n",
    "chinese_title": "奥巴马的黑莓手机如何被安全保护 (2013)",
    "chinese_summary": "奥巴马如何保住他的黑莓手机：安全挑战与解决方案"
  },
  {
    "id": "43895890",
    "title": "How linear regression works intuitively and how it leads to gradient descent",
    "url": "https://briefer.cloud/blog/posts/least-squares/",
    "summary": "This article explains linear regression and gradient descent in an intuitive way, using the example of predicting house prices based on square footage. Linear regression models the relationship between variables with a straight line, defined by a slope and an intercept. The goal is to find the \"best\" line that minimizes the error between predicted and actual values.\n\nThe article explores different ways to measure error, focusing on squared error, which penalizes large errors more heavily and results in a smooth, bowl-shaped error function. This is crucial for gradient descent, an algorithm that iteratively adjusts the slope and intercept of the line to minimize the error function.\n\nGradient descent works by imagining an \"error landscape\" where each point represents a line's parameters (slope and intercept) and its corresponding error. The algorithm then \"walks downhill\" in this landscape, taking steps in the direction of the steepest descent (determined by the derivative of the error function) until it reaches the minimum error point.\n\nThe article highlights why squared error is preferred over absolute error for gradient descent because it provides a smooth, continuous derivative, making the optimization process easier and more reliable. Ultimately, gradient descent allows us to efficiently find the optimal line that best fits the data, enabling accurate predictions like estimating house prices. The principles of gradient descent extend to more complex models like neural networks.\n",
    "chinese_title": "线性回归的直观理解及其如何推导出梯度下降",
    "chinese_summary": "本文以预测房价（基于房屋面积）为例，用直观的方式解释了线性回归和梯度下降。线性回归用一条直线模拟变量之间的关系，这条直线由斜率和截距定义。目标是找到“最佳”直线，以最小化预测值和实际值之间的误差。\n\n本文探讨了不同的误差衡量方法，重点介绍了平方误差，它会更严厉地惩罚较大的误差，并产生一个平滑的碗状误差函数。这对于梯度下降至关重要，梯度下降是一种迭代调整直线斜率和截距以最小化误差函数的算法。\n\n梯度下降的工作原理是想象一个“误差地形”，其中每个点代表一条直线的参数（斜率和截距）及其相应的误差。然后，该算法在这个地形中“下坡行走”，朝着最陡峭的下降方向（由误差函数的导数决定）迈步，直到到达最小误差点。\n\n本文强调了平方误差优于绝对误差的原因，因为它提供了平滑、连续的导数，使优化过程更容易且更可靠。最终，梯度下降使我们能够有效地找到最适合数据的最佳直线，从而实现准确的预测，例如估计房价。梯度下降的原理可以扩展到更复杂的模型，例如神经网络。"
  },
  {
    "id": "43927649",
    "title": "Show HN: Checking Pope's election results with smoke test script for chimney",
    "url": "https://github.com/donobu-inc/donobu-papal-election-tests/blob/main/tests/papal_election_smoke.test.ts",
    "summary": "This \"Show HN\" post by user \"donobu-inc\" presents a publicly available project called \"donobu-papal-election-tests\" on GitHub. The project appears to be a humorous or satirical take on a serious event (Pope's election) by creating a \"smoke test script\" designed to check the results of the election by analyzing the smoke from the Sistine Chapel's chimney. The repository is new, with 2 stars and no forks indicating limited initial traction. The post's title and the repository name suggest a playful, possibly ironic, approach to automating or verifying the election results using an unconventional method. Essentially, it's a lighthearted, tech-focused gag around a traditional religious event.\n",
    "chinese_title": "显示 HN：用烟囱的冒烟测试脚本检查教皇选举结果",
    "chinese_summary": "用户“donobu-inc”的这篇“Show HN”帖子展示了一个公开项目，名为“donobu-papal-election-tests”，托管在GitHub上。该项目似乎是对严肃事件（教皇选举）的一种幽默或讽刺，它创建了一个“烟雾测试脚本”，旨在通过分析西斯廷教堂烟囱冒出的烟来检查选举结果。 该存储库是新的，有 2 个星标且没有派生，表明初始关注度有限。该帖子的标题和存储库名称表明，该项目以一种有趣，可能具有讽刺意味的方式，使用非常规方法来自动化或验证选举结果。本质上，这是一个围绕传统宗教活动的轻松、以技术为中心的玩笑。"
  },
  {
    "id": "43925325",
    "title": "Will protein design tools solve the snake antivenom shortage?",
    "url": "https://www.owlposting.com/p/will-protein-design-tools-solve-the",
    "summary": "This article discusses the critical shortage of snake antivenom and explores the potential of protein design tools to address this issue.\n\nThe current antivenom production system faces significant challenges: a limited number of manufacturers, high costs, and lack of confidence in product quality. This leads to a scarcity of effective antivenom, particularly in regions with high snakebite incidence, causing numerous deaths and disabilities.\n\nThe author emphasizes the complexity of snake venom, highlighting its heterogeneity across snake families, species, populations within species, and even within individual snakes over time due to factors like diet and age. This variability makes it difficult to create antivenoms that are effective against all snakebites, with current treatments often relying on species-specific or \"monovalent\" antivenoms.\n\nThe article suggests that computationally designed proteins, such as those created using RFDiffusion, offer a promising solution. These designed proteins can bind to specific venom toxins, neutralizing their effects. While the Baker Lab's work demonstrates the potential of this approach, the author questions how this technology can scale to address the full spectrum of venom diversity.\n\nThe author then discusses the possibility of moving towards \"polyvalent\" antivenoms, which combine antibodies from multiple snake species, creating a broader spectrum of protection.\n",
    "chinese_title": "蛋白质设计工具能否解决蛇毒血清短缺问题？",
    "chinese_summary": "本文探讨了蛇毒血清严重短缺的问题，并探讨了蛋白质设计工具解决这一问题的潜力。\n\n当前的抗蛇毒血清生产体系面临着严峻的挑战：制造商数量有限、成本高昂以及对产品质量缺乏信心。这导致有效抗蛇毒血清的稀缺，尤其是在蛇咬伤高发地区，造成大量死亡和残疾。\n\n作者强调了蛇毒的复杂性，突出了蛇毒在不同蛇科、物种、物种内种群，甚至在同一条蛇的不同时期（由于饮食和年龄等因素）之间的异质性。这种可变性使得制造对所有蛇咬伤都有效的抗蛇毒血清变得困难，目前的治疗方法通常依赖于物种特异性或“单价”抗蛇毒血清。\n\n文章建议，计算设计的蛋白质，例如使用RFDiffusion创建的蛋白质，提供了一种有希望的解决方案。这些设计的蛋白质可以与特定的毒液毒素结合，从而中和它们的影响。虽然Baker实验室的工作证明了这种方法的潜力，但作者质疑这项技术如何扩展以应对毒液多样性的完整范围。\n\n作者随后讨论了转向“多价”抗蛇毒血清的可能性，即结合来自多个蛇种的抗体，从而提供更广泛的保护范围。"
  },
  {
    "id": "43909519",
    "title": "AI focused on brain regions recreates what you're looking at (2024)",
    "url": "https://www.newscientist.com/article/2438107-mind-reading-ai-recreates-what-youre-looking-at-with-amazing-accuracy/",
    "summary": "This article highlights a breakthrough in artificial intelligence: AI systems can now accurately reconstruct images a person (in this case, a macaque) is viewing, solely based on recordings of their brain activity. Researchers at Radboud University have developed an AI system capable of creating these reconstructions, achieving unprecedented levels of accuracy.\n\nThe key to the AI's success lies in its ability to learn which specific areas of the brain are most relevant to visual processing. By incorporating an \"attention mechanism,\" the AI prioritizes information from these critical brain regions, leading to significantly improved image reconstructions compared to systems without this feature.\n\nUmut Güçlü, one of the researchers, emphasizes the groundbreaking nature of the work, stating that these reconstructions are the \"closest, most accurate\" achieved to date. The article showcases the original images being viewed, alongside the AI-reconstructed images with and without the attention mechanism, visually demonstrating the improvement. The study suggests advancements in understanding how the brain processes visual information and has potential implications for future neurotechnology.\n",
    "chinese_title": "专注于大脑区域的AI重现你所看到的东西 (2024)",
    "chinese_summary": "人工智能突破：仅凭大脑活动重建视觉图像"
  },
  {
    "id": "43925892",
    "title": "Microservices are a tax your startup probably can't afford",
    "url": "https://nexo.sh/posts/microservices-for-startups/",
    "summary": "This article argues that premature adoption of microservices can be detrimental to early-stage startups, hindering velocity and potentially leading to failure. While microservices offer benefits at scale, their complexity introduces significant overhead for small teams without solving immediate problems.\n\nThe author highlights the advantages of a well-structured monolith, emphasizing its simplicity in deployment, developer familiarity, and focus on delivering customer value. A monolith allows startups to prioritize shipping features and staying alive, rather than firefighting architectural complexities.\n\nThe article then outlines common pitfalls of early microservices adoption: arbitrary service boundaries leading to disguised coupling and unnecessary complexity; repository and infrastructure sprawl increasing context switching and hindering code consistency; broken local development environments frustrating engineers and slowing onboarding; technology mismatch exacerbating operational pain; and the hidden complexity of communication, monitoring, and debugging in distributed systems.\n\nMicroservices become relevant when a startup faces real scaling bottlenecks, has large teams working on independent domains, and can justify the investment in infrastructure and operational overhead.\n\nThe article recommends: isolating bottlenecks surgically based on real pain, using monorepos with shared infrastructure for code consistency, ensuring easy local development setups across operating systems, choosing tech stacks aligned with constraints, and understanding the commitment to observability required by distributed systems. In essence, the author advocates for simplicity and pragmatism in early-stage architecture, favoring a monolith until microservices' benefits clearly outweigh their costs.\n",
    "chinese_title": "微服务是你的初创公司可能负担不起的税。",
    "chinese_summary": "本文认为，过早采用微服务可能对初创公司不利，阻碍其发展速度并可能导致失败。 虽然微服务在规模上具有优势，但它们的复杂性会给小型团队带来巨大的额外开销，而无法解决迫在眉睫的问题。\n\n作者强调了结构良好的单体架构的优势，强调其部署简单、开发者熟悉以及专注于交付客户价值。 单体架构使初创公司能够优先考虑发布功能并维持生存，而不是疲于应付架构复杂性。\n\n然后，本文概述了早期采用微服务的常见陷阱：导致伪装耦合和不必要的复杂性的任意服务边界；增加上下文切换并阻碍代码一致性的存储库和基础设施蔓延；让工程师感到沮丧并减慢入门速度的损坏的本地开发环境；加剧运营痛苦的技术不匹配；以及分布式系统中通信、监控和调试的隐藏复杂性。\n\n当初创公司面临真正的扩展瓶颈，有大型团队在独立领域工作，并且可以证明对基础设施和运营开销的投资是合理的时，微服务才变得有意义。\n\n本文建议：基于实际痛点有针对性地隔离瓶颈；使用具有共享基础设施的单体仓库以确保代码一致性；确保跨操作系统的简易本地开发设置；选择与约束条件相符的技术栈；以及了解分布式系统所需的对可观察性的承诺。 本质上，作者提倡早期架构的简单性和实用主义，在微服务的优势明显超过其成本之前，倾向于使用单体架构。"
  },
  {
    "id": "43927842",
    "title": "Hypermode Model Router Preview – OpenRouter Alternative",
    "url": "https://hypermode.com/blog/introducing-model-router",
    "summary": "Hypermode introduces Model Router, a unified API designed to simplify the integration and management of diverse AI models, both open-source and commercial. Addressing the increasing complexity of choosing and utilizing various models (LLaMA, GPT, Claude, Gemini), Model Router eliminates the need for juggling multiple APIs, SDKs, and pricing structures.\n\nKey benefits of Model Router include seamless switching between models based on performance, cost, or availability; cost optimization through dynamic routing to the most efficient model for a specific task; enhanced reliability via fallback mechanisms; and faster experimentation by avoiding application logic rewrites when changing models.\n\nThe tool offers features like unified API access, fallback and load balancing, customizable model preferences, cost and performance optimization, security and compliance through region-specific models, and developer agility via integration with popular SDKs like OpenAI SDK and Vercel AI SDK.\n\nModel Router addresses the hidden costs associated with model swapping, such as differences in tokenization, output structures, and embedding representations, which often require significant adjustments. It enables developers to test, tune, and deploy across models without incurring these switching costs.\n\nDevelopers can get started by generating an API key in the Hypermode Console and integrating it into their preferred framework. Model Router aims to unlock the full potential of the AI ecosystem by providing a flexible and interoperable solution for developers and enterprises to build adaptable AI applications.\n",
    "chinese_title": "Hypermode模型路由器预览 – OpenRouter替代方案",
    "chinese_summary": "Hypermode推出模型路由，一个统一的API，旨在简化集成和管理各种AI模型，包括开源和商业模型。 针对选择和使用各种模型（LLaMA、GPT、Claude、Gemini）的日益复杂性，模型路由消除了对多个API、SDK和定价结构进行管理的需要。\n\n模型路由的主要优势包括基于性能、成本或可用性在模型之间无缝切换；通过动态路由到针对特定任务的最有效模型来优化成本；通过回退机制增强可靠性；以及通过避免在更改模型时重写应用程序逻辑来加速实验。\n\n该工具提供统一的API访问、回退和负载平衡、可定制的模型偏好、成本和性能优化、通过特定区域模型实现安全性和合规性，以及通过与流行的SDK（如OpenAI SDK和Vercel AI SDK）集成来实现开发者敏捷性等功能。\n\n模型路由解决了与模型切换相关的隐藏成本，例如分词、输出结构和嵌入表示方面的差异，这些差异通常需要进行重大调整。 它使开发人员能够跨模型进行测试、调整和部署，而不会产生这些切换成本。\n\n开发人员可以通过在Hypermode控制台中生成API密钥并将其集成到其首选框架中来开始使用。 模型路由旨在通过为开发人员和企业构建适应性强的AI应用程序提供灵活且可互操作的解决方案，来释放AI生态系统的全部潜力。"
  },
  {
    "id": "43918484",
    "title": "Ty: A fast Python type checker and language server",
    "url": "https://github.com/astral-sh/ty",
    "summary": "Ty is a fast Python type checker and language server written in Rust. It's currently pre-release software and under active development, so users should expect bugs and missing features. Development is happening within the Ruff repository. Contributions, bug reports, and questions are welcome via GitHub issues, and pull requests should be directed to the Ruff repository. Ty is licensed under the MIT license.\n",
    "chinese_title": "Ty：一个快速的Python类型检查器和语言服务器",
    "chinese_summary": "Ty：一款用 Rust 编写的快速 Python 类型检查器和语言服务器。目前为预发布软件，正处于积极开发阶段，用户应预期存在错误和功能缺失。开发工作在 Ruff 仓库中进行。欢迎通过 GitHub issues 提交贡献、错误报告和问题，拉取请求应指向 Ruff 仓库。Ty 基于 MIT 许可证。"
  },
  {
    "id": "43898653",
    "title": "Imagineers defend new Walt Disney robot",
    "url": "https://www.yahoo.com/entertainment/articles/keeps-walt-alive-medium-pioneered-170000117.html",
    "summary": "The article discusses Walt Disney Imagineering's upcoming attraction, \"Walt Disney — A Magical Life,\" featuring an advanced animatronic figure of Walt Disney set to debut at Disneyland for its 70th anniversary. The goal is to capture Disney's essence and create a lifelike representation, but the project has sparked ethical debates and mixed reactions from the Disney family.\n\nImagineers emphasize the accuracy and care put into the animatronic, referencing meticulous research on Disney's mannerisms, appearance, and even details like his tie. They aim to tell Disney's story in a fresh, immersive way, leveraging advancements in robotic technology.\n\nHowever, the attraction has faced criticism, notably from Disney's granddaughter, who expressed concerns about \"dehumanizing\" her grandfather through technology. This raises broader ethical questions surrounding the recreation of deceased individuals.\n\nImagineers defend the project by highlighting the educational value of showcasing Disney's life and legacy, arguing many now only know Disney as a company. They emphasize collaboration with the Walt Disney Family Museum and family members, stating the animatronic is a faithful, theatrical performance. The attraction will feature dialogue taken directly from Disney's speeches and showcase artifacts from his life. Despite the controversy, Imagineers are determined to bring Walt Disney back to Disneyland.\n",
    "chinese_title": "幻想工程师为迪士尼新款机器人辩护",
    "chinese_summary": "本文探讨了华特迪士尼幻想工程公司即将推出的景点“华特·迪士尼—奇妙的一生”，该景点将推出一个先进的华特·迪士尼动画人偶，计划在迪士尼乐园70周年庆典上首次亮相。其目标是捕捉迪士尼的精髓，创造一个栩栩如生的形象，但该项目引发了伦理辩论，并受到了迪士尼家族褒贬不一的反应。\n\n幻想工程师强调了动画人偶的准确性和用心程度，并参考了对迪士尼的举止、外貌，甚至包括领带等细节的细致研究。他们的目标是以一种全新的、沉浸式的方式讲述迪士尼的故事，充分利用机器人技术的进步。\n\n然而，该景点也受到了批评，尤其是来自迪士尼的孙女，她对通过技术“非人化”她的祖父表示担忧。这引发了关于重塑已故人士的更广泛的伦理问题。\n\n幻想工程师通过强调展示迪士尼的生平和遗产的教育价值来为该项目辩护，他们认为许多人现在只知道迪士尼是一家公司。他们强调与华特迪士尼家庭博物馆和家庭成员的合作，并表示该动画人偶是一个忠实的、戏剧性的表演。该景点将采用直接摘自迪士尼演讲的对话，并展示他生平的文物。尽管存在争议，幻想工程师仍决心将华特·迪士尼带回迪士尼乐园。"
  },
  {
    "id": "43906066",
    "title": "Mass spectrometry method identifies pathogens within minutes instead of days",
    "url": "https://phys.org/news/2025-05-mass-spectrometry-method-pathogens-minutes.html",
    "summary": "Researchers at the Technical University of Munich (TUM) and Imperial College London have developed a rapid mass spectrometry method that identifies bacterial pathogens in minutes, drastically reducing the waiting time compared to traditional culture-based methods that take days. The new approach, published in *Nature Communications*, focuses on detecting specific metabolic products of bacteria directly in tissue and stool samples.\n\nThe method relies on a database containing metabolic profiles of 232 medically important bacterial species. By identifying unique biomarkers within samples, researchers can quickly pinpoint the presence of pathogens, including those responsible for stomach cancer, pneumonia, meningitis, premature births, gonorrhea, and blood poisoning.\n\nInstead of directly searching for the bacteria, the method targets their metabolic products, significantly accelerating the identification process. According to first author Wei Chen, this indirect approach is key to the speed of the method. Prof. Nicole Strittmatter emphasizes the potential for personalized medicine, where therapies are tailored to individual patients based on rapid pathogen identification. The researchers aim to expand the database to include over 1,400 known bacterial pathogens and their specific metabolic products to enhance the method's clinical utility.\n",
    "chinese_title": "质谱法可在数分钟内而非数天内识别病原体。",
    "chinese_summary": "慕尼黑工业大学 (TUM) 和伦敦帝国理工学院的研究人员开发了一种快速质谱法，可在数分钟内识别细菌病原体，与耗时数天的传统培养方法相比，大大缩短了等待时间。这项发表在《自然通讯》上的新方法，侧重于直接检测组织和粪便样本中细菌的特定代谢产物。\n\n该方法依赖于包含232种具有重要医学意义的细菌物种代谢谱的数据库。通过识别样本中独特的生物标志物，研究人员可以快速确定病原体的存在，包括导致胃癌、肺炎、脑膜炎、早产、淋病和败血症的病原体。\n\n该方法并非直接寻找细菌，而是针对其代谢产物，从而显著加快了识别过程。第一作者魏晨表示，这种间接方法是该方法速度的关键。Nicole Strittmatter教授强调了个性化医疗的潜力，即根据快速病原体识别为个体患者量身定制治疗方案。研究人员的目标是扩展数据库，纳入超过1400种已知的细菌病原体及其特定的代谢产物，以提高该方法的临床实用性。"
  },
  {
    "id": "43903705",
    "title": "Inheritance was invented as a performance hack (2021)",
    "url": "https://catern.com/inheritance.html",
    "summary": "This article argues that inheritance, invented in the Simula language, originated as a performance optimization rather than a design principle for code reuse or extensibility.\n\nThe author highlights two key motivations behind Simula's creation of inheritance (then called \"prefixing\"): simplifying the garbage collector and enabling efficient intrusive lists. Simula's initial garbage collection was limited, and to work around its constraints, they banned passing functions and other data by name. This reduced the expressiveness of the language, hindering customization of classes via composition.  Inheritance offered a way to share common properties between objects without relying on problematic parameter passing.\n\nThe article then details how inheritance was directly inspired by the need for intrusive lists.  Simula initially used traditional linked lists with separately allocated \"element\" objects, but this proved inefficient. Intrusive lists, where the list node is embedded within the object itself, offered superior memory and performance.  Prefixing (inheritance) allowed Simula to \"glue\" objects to a link (list node), making intrusive lists easily usable.\n\nThe author concludes that while Simula was revolutionary and invented many OOP concepts, the specific origin of inheritance as a performance hack is often overlooked. Today, inheritance is typically discussed in terms of code reuse and extensibility, but the author prefers composition and modules for those purposes.\n",
    "chinese_title": "继承是一种为了提高性能而发明的技巧（2021）",
    "chinese_summary": "本文认为，在Simula语言中发明的继承机制，其起源是一种性能优化手段，而非代码复用或可扩展性的设计原则。\n\n作者强调了Simula创造继承（当时称为“前缀”）的两个关键动机：简化垃圾回收器和实现高效的侵入式列表。Simula最初的垃圾回收机制有限，为了解决这一限制，他们禁止通过名称传递函数和其他数据。这降低了语言的表达能力，阻碍了通过组合自定义类。继承提供了一种在对象之间共享共同属性的方式，而无需依赖有问题的参数传递。\n\n文章随后详细介绍了继承如何直接受到对侵入式列表的需求启发。Simula最初使用传统的链表，其中“元素”对象是单独分配的，但这被证明效率低下。侵入式列表（其中列表节点嵌入在对象本身中）提供了卓越的内存和性能。前缀（继承）允许Simula将对象“粘合”到链接（列表节点），从而使侵入式列表易于使用。\n\n作者总结说，虽然Simula具有革命性并创造了许多OOP概念，但继承作为性能技巧的特定起源常常被忽视。今天，继承通常以代码复用和可扩展性来讨论，但作者更喜欢使用组合和模块来实现这些目的。"
  },
  {
    "id": "43926350",
    "title": "Huawei unveils laptop running self-developed HarmonyOS as Windows licence expire",
    "url": "https://www.scmp.com/tech/big-tech/article/3309569/huawei-unveils-first-laptop-running-self-developed-harmonyos-windows-licence-expires",
    "summary": "Huawei has unveiled its first laptop running on its self-developed HarmonyOS, following the expiration of its Microsoft Windows license in March 2025. The unnamed laptop utilizes HarmonyOS 5, also known as HarmonyOS Next, and is equipped with AI features, including Huawei's AI assistant, Celia, which can perform tasks such as creating slides and summarizing meeting minutes.\n\nThe laptop includes a suite of Chinese software like WPS (a Microsoft Office alternative) and Alibaba's DingTalk. It is also compatible with a growing number of mobile apps available on HarmonyOS smartphones, such as RedNote, Bilibili, and Feishu, with plans to support over 2,000 apps by year-end. This move signifies Huawei's increasing independence from Western technology and its commitment to developing its own ecosystem. The laptop's unveiling underscores Huawei's strategic shift towards leveraging its HarmonyOS to power its PC offerings in the wake of the Windows license expiry.\n",
    "chinese_title": "华为发布搭载自研鸿蒙系统的笔记本电脑，此前Windows授权到期。",
    "chinese_summary": "华为发布首款鸿蒙笔记本，搭载自研鸿蒙系统。此前，其微软Windows许可证将于2025年3月到期。这款未命名的笔记本电脑采用鸿蒙5，又称鸿蒙星河版，并配备人工智能功能，包括华为AI助手小艺，可执行创建幻灯片和总结会议纪要等任务。\n\n该笔记本电脑包含WPS（微软Office替代品）和阿里巴巴钉钉等中国软件。它还兼容鸿蒙智能手机上越来越多的移动应用程序，如赤焰笔记、哔哩哔哩和飞书，并计划在年底前支持2000多个应用程序。此举标志着华为日益摆脱对西方技术的依赖，并致力于发展自己的生态系统。这款笔记本电脑的发布突显了华为在Windows许可证到期后，利用鸿蒙系统为其PC产品提供动力的战略转变。"
  },
  {
    "id": "43916577",
    "title": "Waiting for Postgres 18: Accelerating Disk Reads with Asynchronous I/O",
    "url": "https://pganalyze.com/blog/postgres-18-async-io",
    "summary": "This article discusses the upcoming Asynchronous I/O (AIO) feature in Postgres 18, a significant architectural change that promises to accelerate disk reads and improve performance, particularly in cloud environments. Historically, Postgres used synchronous I/O, where the database pauses and waits for each read request to complete. AIO allows Postgres to issue multiple read requests concurrently, reducing idle time and increasing I/O bandwidth utilization.\n\nPostgres 17 introduced read stream APIs, paving the way for AIO. Postgres 18 introduces the `io_method` setting to control the AIO mechanism. The options are: `sync` (traditional synchronous behavior), `worker` (dedicated I/O worker processes), and `io_uring` (a high-performance Linux-specific interface). `io_uring` is the most efficient, minimizing syscall overhead.\n\nBenchmarks on AWS show that AIO, especially with `io_uring`, can double or triple read performance compared to synchronous I/O. The `effective_io_concurrency` setting becomes more relevant with AIO, controlling the number of asynchronous read-ahead requests. The `pg_aios` view helps monitor I/Os in flight.\n\nHowever, AIO changes how execution timing is reported, making I/O timing information harder to interpret as the backend no longer blocks directly on disk reads. While AIO in Postgres 18 is limited to read operations, it represents a crucial step towards improving I/O performance and resource utilization. The article encourages testing Postgres 18 to validate its performance in practice.\n",
    "chinese_title": "等待Postgres 18：使用异步I/O加速磁盘读取",
    "chinese_summary": "Postgres 18 即将引入的异步 I/O (AIO) 功能探讨：显著提升云环境性能"
  },
  {
    "id": "43896948",
    "title": "Heat stress mitigation by trees and shelters at bus stops",
    "url": "https://www.sciencedirect.com/science/article/pii/S136192092500063X",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "公交站树木和遮阳棚缓解热应激",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "43925414",
    "title": "Yes, the Apple II MouseCard IRQ is synced to the VBL",
    "url": "https://www.colino.net/wordpress/en/archives/2025/05/08/yes-the-apple-ii-mousecard-irq-is-synced-to-the-vbl/",
    "summary": "This article delves into the technical details of how the Apple II MouseCard's interrupt (IRQ) is synchronized to the vertical blanking (VBL) signal. The author addresses a previous misunderstanding that the MouseCard IRQ was not precisely synced to the VBL, clarifying that it is indeed cycle-accurate.\n\nThe article explains that during the `MOUSE_INIT` process, the mouse firmware waits for the VBL signal, utilizing either the `RDVBL` softswitch (on Apple IIe) or a vapor lock method (on Apple ][+). This allows the card to determine the screen beam's position.\n\nThe MouseCard then sets up its onboard 68705 CPU, using the 6821 PIA to communicate with the main CPU. The 68705 CPU utilizes a hardware timer to generate IRQs.  The timer is configured with specific values (derived from the 68705 firmware) to trigger interrupts at intervals corresponding to the VBL rate for both NTSC and PAL systems (8515 cycles for NTSC and 10140 cycles for PAL on the 68705, which is 17030 and 20280 cycles on the 6502).\n\nThe author emphasizes that the interrupt is synchronized down to the cycle and fired as close to the start of the VBL as possible.  For developers who want to use the MouseCard IRQ for VBL synchronization across both NTSC and PAL systems, they must use the `TIME_DATA` MouseCard firmware call and determine the system type. Options include counting cycles between VBLs, using `get_tv()` (in cc65), or asking the user.  However, it's noted that there's a delay of several hundred cycles before the developer's code receives the VBL notification.\n",
    "chinese_title": "是的，Apple II MouseCard IRQ与垂直消隐同步。",
    "chinese_summary": "本文深入探讨了Apple II MouseCard的interrupt(IRQ)如何与垂直消隐(VBL)信号同步的技术细节。作者纠正了之前关于MouseCard IRQ与VBL并非精确同步的误解，澄清了它实际上是周期级别的精确同步。\n\n文章解释说，在`MOUSE_INIT`过程中，鼠标固件会等待VBL信号，利用`RDVBL`软开关（在Apple IIe上）或气阻方法（在Apple ][+上）。这使得卡能够确定屏幕光栅的位置。\n\n然后，MouseCard设置其板载68705 CPU，使用6821 PIA与主CPU通信。68705 CPU利用硬件定时器来生成IRQ。定时器配置了特定的值（来源于68705固件），以便在与NTSC和PAL系统VBL速率相对应的间隔触发中断（68705上NTSC为8515个周期，PAL为10140个周期，对应于6502上的17030个周期和20280个周期）。\n\n作者强调，中断是同步到周期的，并尽可能接近VBL的开始时触发。对于想要在NTSC和PAL系统中使用MouseCard IRQ进行VBL同步的开发者，他们必须使用`TIME_DATA` MouseCard固件调用并确定系统类型。选项包括计算VBL之间的周期数、使用`get_tv()`（在cc65中）或询问用户。然而，需要注意的是，在开发者代码收到VBL通知之前会有数百个周期的延迟。"
  },
  {
    "id": "43916098",
    "title": "Mistral ships Le Chat – enterprise AI assistant that can run on prem",
    "url": "https://mistral.ai/news/le-chat-enterprise",
    "summary": "Mistral AI has launched Le Chat Enterprise, an AI assistant designed for businesses, powered by the new Mistral Medium 3 model. Le Chat Enterprise aims to unify AI productivity across organizations by addressing challenges like fragmented tools and insecure data integration.\n\nKey features include enterprise search with secure connections to Google Drive, Sharepoint, OneDrive, Google Calendar, and Gmail, plus the ability to build custom connectors. It enables personalized responses using knowledge bases from various data sources, document summaries, and personal libraries. MCP support is planned for broader enterprise system connectivity.\n\nUsers can build and deploy custom AI agents for automated tasks without code, connected to apps and libraries. Le Chat Enterprise offers privacy-first deployments, whether self-hosted, in a public/private cloud, or hosted by Mistral. It ensures data protection with ACL adherence and offers complete control and customization, from models to interfaces, including personalized assistants and user feedback loops for model improvement. The solution also provides comprehensive audit logging and storage.\n\nMistral's AI experts offer assistance in deployment, solutioning, and safety. Le Chat Enterprise is available on Google Cloud Marketplace and is coming soon to Azure AI and AWS Bedrock. Le Chat Pro and Team plans for individuals and smaller teams are also being improved. Existing users can try Le Chat at chat.mistral.ai or via mobile apps.\n",
    "chinese_title": "Mistral推出Le Chat——可在本地运行的企业AI助手",
    "chinese_summary": "Mistral AI 发布 Le Chat Enterprise，助力企业统一 AI 生产力\n\nMistral AI 推出了 Le Chat Enterprise，一款专为企业设计的人工智能助手，由最新的 Mistral Medium 3 模型驱动。Le Chat Enterprise 旨在通过解决工具碎片化和数据集成不安全等挑战，统一企业内的 AI 生产力。\n\n主要功能包括企业搜索，可安全连接到 Google Drive、Sharepoint、OneDrive、Google Calendar 和 Gmail，并且能够构建自定义连接器。它可以使用来自各种数据源、文档摘要和个人知识库的知识生成个性化回复。MCP 支持计划用于更广泛的企业系统连接。\n\n用户可以构建和部署用于自动化任务的自定义 AI 代理，无需代码，并连接到应用程序和库。Le Chat Enterprise 提供隐私至上的部署方式，无论是自托管、在公共/私有云中，还是由 Mistral 托管。它通过遵守 ACL 来确保数据保护，并提供完全的控制和定制，从模型到界面，包括个性化助手和用于模型改进的用户反馈循环。该解决方案还提供全面的审计日志记录和存储。\n\nMistral 的 AI 专家可提供部署、解决方案和安全方面的帮助。Le Chat Enterprise 已在 Google Cloud Marketplace 上提供，即将登陆 Azure AI 和 AWS Bedrock。面向个人和小型团队的 Le Chat Pro 和 Team 计划也在不断改进。现有用户可以在 chat.mistral.ai 或通过移动应用程序试用 Le Chat。"
  },
  {
    "id": "43920792",
    "title": "June Huh dropped out to become a poet, now he’s won a Fields Medal (2022)",
    "url": "https://www.quantamagazine.org/june-huh-high-school-dropout-wins-the-fields-medal-20220705/",
    "summary": "This article profiles June Huh, a mathematician who won the Fields Medal in 2022. Huh initially struggled with academics, dropping out of high school to pursue poetry, but later found his passion in mathematics after a chance encounter with Fields Medalist Heisuke Hironaka at Seoul National University. Hironaka's unconventional teaching style, focusing on real-time research and unsolved problems, captivated Huh.\n\nDespite a lackluster academic record, Huh excelled in graduate school, proving Read's conjecture in graph theory, a problem that had been open for 40 years. His approach involved connecting combinatorics and geometry by finding an algebraic variety whose associated numbers matched the coefficients of the chromatic polynomial of the graph.\n\nHuh's work revealed deeper geometric principles underlying combinatorial properties. His colleagues describe him as humble, artistic, and possessing a unique perspective. Huh's path to mathematics highlights the importance of exploration and finding beauty in the subject, drawing parallels to his earlier pursuit of poetry. He approaches math with a focus on finding inherent truths rather than seeking recognition, making him a remarkable figure in the field.\n",
    "chinese_title": "许埈珥曾辍学成为诗人，如今荣获菲尔兹奖（2022）",
    "chinese_summary": "本文介绍了2022年菲尔兹奖得主，数学家许埈珥。许埈珥最初在学业上苦苦挣扎，高中辍学去追求诗歌，但在首尔国立大学偶然遇到菲尔兹奖得主广中平佑后，发现了自己对数学的热情。广中平佑专注于实时研究和未解难题的非传统教学风格深深吸引了许埈珥。\n\n尽管学术记录平平，许埈珥在研究生院表现出色，证明了图论中悬而未决40年的Read猜想。他的方法涉及将组合学和几何学联系起来，通过找到一个代数簇，其关联的数字与图的色多项式的系数相匹配。\n\n许埈珥的工作揭示了组合性质背后更深层次的几何原理。他的同事们形容他谦逊、有艺术气质，并且拥有独特的视角。许埈珥的数学之路突显了探索和发现学科之美的重要性，这与他早期对诗歌的追求有异曲同工之妙。他以寻找内在真理而非追求认可的态度对待数学，这使他成为该领域一位杰出的人物。"
  },
  {
    "id": "43925952",
    "title": "QueryHub",
    "url": "https://www.queryhub.ai/blog/introducing-queryhub",
    "summary": "QueryHub is an AI-powered platform designed to simplify database interactions and boost productivity by allowing users to query databases using natural language. It addresses the challenges of complex SQL query writing, time-consuming data analysis, and limited database expertise. The platform aims to democratize data access, accelerate development, and enhance data understanding.\n\nKey features include an AI-powered chatbot for natural language queries, automatic SQL generation, automatic schema understanding, query management, and data visualization. QueryHub differentiates itself from traditional tools by offering natural language query capabilities, automatic SQL generation, and automated schema understanding.\n\nUsers can get started with a free account that allows one database connection and 100 AI queries per month. A Pro plan with more connections and unlimited queries is available for a monthly fee. The platform prioritizes security, encrypting database credentials and using TLS protocols for data transmission, and does not permanently store database content or query results.\n",
    "chinese_title": "查询中心",
    "chinese_summary": "QueryHub是一个人工智能驱动的平台，旨在通过允许用户使用自然语言查询数据库来简化数据库交互并提高生产力。它解决了复杂的SQL查询编写、耗时的数据分析以及有限的数据库专业知识等挑战。该平台旨在普及数据访问、加速开发并增强数据理解。\n\n主要功能包括用于自然语言查询的人工智能聊天机器人、自动SQL生成、自动模式理解、查询管理和数据可视化。QueryHub通过提供自然语言查询功能、自动SQL生成和自动化模式理解，使其与传统工具区分开来。\n\n用户可以免费注册帐户，允许一个数据库连接和每月100个AI查询。Pro计划提供更多连接和无限查询，按月收费。该平台优先考虑安全性，加密数据库凭据并使用TLS协议进行数据传输，且不会永久存储数据库内容或查询结果。"
  },
  {
    "id": "43898400",
    "title": "Bridging the gap between keyword and semantic search with SPLADE (2024)",
    "url": "http://arcturus-labs.com/blog/2024/10/09/bridging-the-gap-between-keyword-and-semantic-search-with-splade/",
    "summary": "This article explores SPLADE (Sparse Lexical and Expansion Model for First Stage Ranking) as a way to combine the benefits of keyword and semantic search. It highlights the limitations of both approaches: keyword search struggles with semantic similarity, while semantic search suffers from large indexes, chunking complexity, and lack of transparency.\n\nSPLADE addresses these issues by using a semantic model to identify important terms (synthetic tokens) that should be in a document, even if they aren't explicitly present. These tokens are then indexed in a traditional search engine, improving recall.\n\nThe article demonstrates SPLADE's effectiveness using a dataset of superheroes. It shows how keyword search fails to find relevant results when queries use different wording, while SPLADE successfully bridges this semantic gap. A custom Python implementation is presented using `transformers` library, which then gets loaded into an Elasticsearch index. The article ends with an evalution using recall@3. SPLADE improves recall, but the author cautions that SPLADE doesn't fully address all the shortcomings of semantic search. It can produce odd synthetic tokens, and the initial implementation omits token weights, potentially impacting precision. Still, SPLADE is presented as a promising approach that can be a good middle ground that helps bridge semantic search with the simpler and easier to maintain traditional keyword search.\n",
    "chinese_title": "用SPLADE弥合关键词搜索和语义搜索之间的差距 (2024)",
    "chinese_summary": "本文探讨了SPLADE（用于第一阶段排序的稀疏词汇和扩展模型），旨在结合关键词搜索和语义搜索的优点。文章强调了两种方法的局限性：关键词搜索难以处理语义相似性，而语义搜索则存在索引庞大、分块复杂和缺乏透明度的问题。\n\nSPLADE通过使用语义模型来识别文档中应该存在的关键术语（合成标记），即使这些术语没有明确出现，从而解决了这些问题。 然后，这些标记被索引到传统的搜索引擎中，从而提高召回率。\n\n本文使用一个关于超级英雄的数据集来展示SPLADE的有效性。它表明，当查询使用不同的措辞时，关键词搜索无法找到相关的结果，而SPLADE成功地弥合了这种语义差距。文章展示了一个使用`transformers`库的定制Python实现，该实现随后被加载到Elasticsearch索引中。文章最后使用recall@3进行了评估。SPLADE提高了召回率，但作者提醒说，SPLADE并没有完全解决语义搜索的所有缺点。它可能会产生奇怪的合成标记，并且最初的实现省略了标记权重，这可能会影响精度。尽管如此，SPLADE被认为是一种有前景的方法，它可以成为一个良好的中间地带，有助于将语义搜索与更简单且更易于维护的传统关键词搜索连接起来。"
  },
  {
    "id": "43918620",
    "title": "RybbitL Open source Google Analytics replacement",
    "url": "https://github.com/rybbit-io/rybbit",
    "summary": "Rybbit Analytics is presented as an open-source, privacy-focused alternative to Google Analytics. It offers a quick setup and user-friendly interface, with options to use a hosted service or self-host on a VPS. Rybbit emphasizes GDPR and CCPA compliance through its cookie-less and user-tracking-free approach.\n\nKey features include standard web analytics metrics like sessions, users, pageviews, bounce rate, and session duration. It also provides advanced functionality such as customizable goals, retention analysis, user journey tracking, and funnel dashboards. Users can filter data across 15+ dimensions and track custom events.\n\nThe platform offers real-time dashboards for live sessions and provides location tracking down to the city level, along with advanced map visualizations. Rybbit supports organizations and an unlimited number of websites. Dashboard previews are available for Main, Realtime, Sessions, Journeys, Map, Funnels, and Goals sections. The article encourages users to explore a live demo on a production site and consult the documentation for further information.\n",
    "chinese_title": "RybbitL 开源 Google Analytics 替代方案",
    "chinese_summary": "Rybbit Analytics 是一款开源、注重隐私的 Google Analytics 替代方案。它提供快速设置和用户友好的界面，可以选择使用托管服务或在 VPS 上进行自托管。Rybbit 强调符合 GDPR 和 CCPA 法规，通过其无 Cookie 和无用户跟踪的方法实现。\n\n其主要功能包括标准的网络分析指标，如会话、用户、页面浏览量、跳出率和会话时长。它还提供高级功能，例如可定制的目标、留存分析、用户旅程跟踪和漏斗仪表板。用户可以跨 15 多个维度过滤数据并跟踪自定义事件。\n\n该平台提供实时仪表板，用于显示实时会话，并提供精确到城市级别的地理位置跟踪，以及高级地图可视化。Rybbit 支持组织和无限数量的网站。主页、实时、会话、旅程、地图、漏斗和目标等部分提供仪表板预览。文章鼓励用户在生产站点上探索实时演示，并查阅文档以获取更多信息。"
  },
  {
    "id": "43909360",
    "title": "Engineered adipocytes implantation suppresses tumor progression in cancer models",
    "url": "https://www.nature.com/articles/s41587-024-02551-2",
    "summary": "This article presents a novel cancer therapy approach called adipose manipulation transplantation (AMT). The researchers engineered adipocytes (fat cells) to aggressively consume nutrients (glucose and fatty acids) that tumors rely on for growth. They achieved this by using CRISPR activation (CRISPRa) to upregulate genes like UCP1, PRDM16, or PPARGC1A, which promote \"browning\" of white adipose tissue, turning it into a beige/brown fat-like tissue with high metabolic activity.\n\nThe engineered adipocytes, when co-cultured with various cancer cell lines in vitro, significantly suppressed cancer cell proliferation. This suppression was linked to reduced glucose uptake, glycolysis, and fatty acid oxidation in the cancer cells.\n\nIn vivo experiments involved transplanting CRISPRa-modulated human adipose organoids alongside cancer cell xenografts in mice and into genetic mouse models of cancer.  Results showed significant tumor size reduction, decreased hypoxia and angiogenesis.  Importantly, the approach also worked with adipocytes isolated from human breast tissue, inhibiting the growth of patient-derived breast cancer organoids.\n\nThe researchers also demonstrated control over the therapeutic effect using tetracycline induction or a cell-scaffold delivery system. Furthermore, they showed that AMT can be customized by upregulating UPP1 in adipocytes to target a uridine-dependent pancreatic cancer. In conclusion, AMT represents a promising customizable therapeutic strategy with the potential to treat diverse cancers by starving them of essential nutrients.\n",
    "chinese_title": "工程脂肪细胞植入抑制癌症模型中的肿瘤进展",
    "chinese_summary": "本文介绍了一种新型癌症治疗方法，称为脂肪操控移植（AMT）。研究人员对脂肪细胞进行了基因工程改造，使其能够大量消耗肿瘤生长所需的营养物质（葡萄糖和脂肪酸）。他们通过使用CRISPR激活（CRISPRa）来上调UCP1、PRDM16或PPARGC1A等基因，从而实现这一目标，这些基因可以促进白色脂肪组织“褐变”，使其转化为具有高代谢活性的米色/棕色脂肪样组织。\n\n在体外，经过基因工程改造的脂肪细胞与各种癌细胞系共同培养时，显著抑制了癌细胞的增殖。这种抑制作用与癌细胞中葡萄糖摄取、糖酵解和脂肪酸氧化减少有关。\n\n体内实验包括将CRISPRa调控的人类脂肪类器官与癌细胞异种移植一起移植到小鼠体内，以及移植到癌症遗传小鼠模型中。结果显示肿瘤体积显著减小，缺氧和血管生成减少。重要的是，该方法也适用于从人类乳腺组织中分离的脂肪细胞，抑制了患者来源的乳腺癌类器官的生长。\n\n研究人员还证明了可以使用四环素诱导或细胞支架递送系统来控制治疗效果。此外，他们表明可以通过上调脂肪细胞中的UPP1来定制AMT，以靶向尿苷依赖型胰腺癌。总之，AMT代表了一种有前景的可定制治疗策略，有可能通过剥夺必需营养物质来治疗多种癌症。"
  },
  {
    "id": "43918437",
    "title": "Samsung is paying $350M for audio brands B&W, Denon, Marantz and Polk",
    "url": "https://www.engadget.com/audio/samsung-is-paying-350-million-for-audio-brands-bowers--wilkins-denon-marantz-and-polk-131514754.html",
    "summary": "Samsung, through its subsidiary Harman International, is set to acquire Masimo's audio business, including renowned brands Bowers & Wilkins, Denon, Marantz, and Polk Audio, for $350 million in cash. This deal, expected to close by the end of 2025, will expand Harman's already extensive portfolio of audio brands like JBL, Harman Kardon, and AKG.\n\nThe acquisition aims to solidify Harman's position as the global leader in the consumer audio market, where it already holds a 60% market share in portable audio devices. Samsung intends to leverage the acquired brands' audio technologies across its product lines, including smartphones, TVs, and earphones.\n\nWhile it's uncertain if the purchase will result in layoffs, Harman seems to be absorbing Sound United's employees. Harman's president of the Lifestyle division, Dave Rogers, emphasizes the complementary nature of the brands and the increased choices it will offer consumers. Samsung highlighted the historical significance of the brands it's acquiring, mentioning iconic products like Bowers & Wilkins' Nautilus loudspeaker and Denon's pioneering role in CD player technology.\n",
    "chinese_title": "三星斥资3.5亿美元收购B&W、天龙、马兰士和普乐之声等音频品牌。",
    "chinese_summary": "三星将通过其子公司哈曼国际，以3.5亿美元现金收购马西莫的音频业务，包括知名品牌 Bowers & Wilkins、Denon、Marantz 和 Polk Audio。预计该交易将于2025年底完成，这将扩展哈曼本已庞大的音频品牌组合，如JBL、Harman Kardon和AKG。\n\n此次收购旨在巩固哈曼作为消费音频市场全球领导者的地位，哈曼在便携式音频设备领域已占据60%的市场份额。三星计划在其包括智能手机、电视和耳机在内的产品线中利用所收购品牌的音频技术。\n\n虽然尚不确定此次收购是否会导致裁员，但哈曼似乎正在吸纳 Sound United 的员工。哈曼 Lifestyle 部门总裁 Dave Rogers 强调了这些品牌的互补性以及它将为消费者提供的更多选择。三星强调了其收购品牌的历史意义，提到了 Bowers & Wilkins 的 Nautilus 扬声器和 Denon 在 CD 播放器技术方面的先驱作用等标志性产品。"
  },
  {
    "id": "43917461",
    "title": "Create and edit images with Gemini 2.0 in preview",
    "url": "https://developers.googleblog.com/en/generate-images-gemini-2-0-flash-preview/",
    "summary": "The Google Developers Blog announces the preview release of image generation capabilities within Gemini 2.0 Flash, accessible through Google AI Studio and Vertex AI using the model name \"gemini-2.0-flash-preview-image-generation.\" This release builds on the initial experimental version, offering higher rate limits and improved performance, including better visual quality, more accurate text rendering, and significantly reduced filter block rates.\n\nThe article highlights several key functionalities that developers are excited about, including the ability to recontextualize products in new environments, collaboratively edit images in real-time, edit specific parts of images conversationally without affecting other areas, dynamically create new product SKUs with text rendering and images, and use Gemini 2.0 Flash as an ideation partner.\n\nThe blog post includes a code snippet demonstrating how to generate an image with accompanying text using the Gemini API.  Developers can access image generation through Google AI Studio and Vertex AI, with further quality improvements, new capabilities, and expanded rate limits planned for the future. The post concludes with encouragement for developers to start building with Gemini's native image capabilities.\n",
    "chinese_title": "使用 Gemini 2.0 预览版创建和编辑图像",
    "chinese_summary": "Google开发者博客宣布Gemini 2.0 Flash中图像生成功能的预览版发布，可通过Google AI Studio和Vertex AI使用模型名称“gemini-2.0-flash-preview-image-generation”访问。此版本基于初始实验版本构建，提供更高的速率限制和改进的性能，包括更好的视觉质量、更准确的文本渲染以及显著降低的过滤阻止率。\n\n文章重点介绍了开发者们期待的几个关键功能，包括在新环境中重新关联产品、实时协作编辑图像、以对话方式编辑图像的特定部分而不影响其他区域、通过文本渲染和图像动态创建新的产品SKU，以及将Gemini 2.0 Flash用作创意伙伴。\n\n该博文包含一个代码片段，演示了如何使用 Gemini API 生成带有随附文本的图像。开发者可以通过 Google AI Studio 和 Vertex AI 访问图像生成功能，未来计划进一步提高质量、增加新功能和扩大速率限制。文章最后鼓励开发者开始使用 Gemini 的原生图像功能进行构建。"
  },
  {
    "id": "43892331",
    "title": "Extending a Language – Writing Powerful Macros in Scheme",
    "url": "https://mnieper.github.io/scheme-macros/README.html",
    "summary": "This article serves as an introduction to writing powerful macros in Scheme, emphasizing their role in extending the language's core functionalities. It highlights the importance of Scheme's built-in hygiene, enabling the creation of robust abstractions indistinguishable from built-in syntax. The tutorial aims to demystify macro writing, asserting that it's not as complicated as perceived.\n\nThe article begins with necessary prerequisites for development, including Chez Scheme, Emacs with Org mode, Geiser, and Paredit. It then briefly introduces the Scheme programming language, particularly the R6RS dialect and the Scheme Requests for Implementation (SRFI) process.\n\nThe core focuses on practical macro creation, starting with a simple `incr!` macro to increment variables, demonstrating how `define-syntax` and `syntax-rules` work. It emphasizes Scheme's macro hygiene, ensuring referential transparency and preventing unintended variable capture, unlike simpler macro facilities like the C preprocessor. A `trace-let` macro is then introduced, which helps debug named let loops by printing arguments during recursion. This example also showcases the use of ellipses (...) for handling repeated patterns in macros. Finally, the document anticipates future sections on syntax objects, syntax-case macros, breaking hygiene (with caution), phasing, extensions like aliases and syntax parameters, complex examples such as a parser generator, and exercises.\n",
    "chinese_title": "扩展语言 – 在Scheme中编写强大的宏",
    "chinese_summary": "本文旨在介绍如何在Scheme中编写强大的宏，并强调它们在扩展语言核心功能方面的作用。文章突出了Scheme内置卫生的重要性，它使得创建与内置语法无法区分的健壮抽象成为可能。本教程旨在揭开宏编写的神秘面纱，声明它并不像人们认为的那么复杂。\n\n文章首先介绍了必要的开发先决条件，包括Chez Scheme、带有Org模式的Emacs、Geiser和Paredit。然后简要介绍了Scheme编程语言，特别是R6RS方言和Scheme实现请求(SRFI)流程。\n\n核心内容侧重于实际的宏创建，从一个简单的 `incr!` 宏开始，该宏用于递增变量，并演示 `define-syntax` 和 `syntax-rules` 的工作方式。文章强调了Scheme的宏卫生，确保了引用透明性并防止了意外的变量捕获，这与像C预处理器这样更简单的宏工具不同。然后引入了一个 `trace-let` 宏，它通过在递归期间打印参数来帮助调试命名let循环。这个例子还展示了使用省略号(...)来处理宏中重复的模式。最后，本文预计未来章节将讨论语法对象、syntax-case宏、打破卫生（需谨慎）、分期、扩展（如别名和语法参数）、复杂示例（如解析器生成器）和练习。"
  },
  {
    "id": "43926149",
    "title": "Trump's NIH axed research grants even after a judge blocked the cuts",
    "url": "https://www.propublica.org/article/trump-nih-cuts-transgender-research-grants",
    "summary": "This ProPublica article investigates allegations that the Trump administration continued to cut NIH research grants related to gender identity and other areas, even after a federal judge issued an injunction against enforcing executive orders that prompted the cuts. Internal records obtained through a lawsuit led by the Washington State Attorney General appear to contradict the administration's claims of compliance with the injunction.\n\nThe investigation reveals that NIH officials, under the direction of the Department of Government Efficiency (DOGE), terminated over 600 grants, targeting research on topics like gender identity, vaccine hesitancy, diversity, equity, and inclusion, and research related to China. Documents show that the terminations were linked to Trump's Executive Order 14168, which banned federal funding to promote \"gender ideology.\"\n\nDepositions from NIH officials suggest that DOGE, specifically a former McKinsey consultant named Rachel Riley, directed the grant terminations, providing lists of grants to be canceled and pre-written letters explaining the decision. This contradicts the administration's claim that DOGE was merely an advisory body. The article highlights the unprecedented scope of the cuts and questions the scientific basis for the terminations. The Washington State Attorney General is pursuing legal action, alleging that the administration has defied court orders and concealed its motivations behind the grant terminations. The administration defended the cuts by stating that they were necessary to refocus the NIH on key public health priorities.\n",
    "chinese_title": "特朗普的NIH在法官叫停后仍削减研究经费。",
    "chinese_summary": "ProPublica的文章调查了特朗普政府在联邦法官发布禁令，禁止执行导致削减经费的行政命令后，仍继续削减美国国立卫生研究院（NIH）与性别认同和其他领域相关的研究经费的指控。通过华盛顿州总检察长领导的诉讼获得的内部记录似乎与政府声称遵守禁令的说法相矛盾。\n\n调查显示，在政府效率部（DOGE）的指示下，美国国立卫生研究院的官员终止了600多项资助，目标包括性别认同、疫苗犹豫、多元化、公平和包容，以及与中国相关的研究等课题。文件显示，终止资助与特朗普的第14168号行政命令有关，该命令禁止联邦资金用于推广“性别意识形态”。\n\n美国国立卫生研究院官员的证词表明，政府效率部，特别是前麦肯锡顾问瑞秋·莱利，指示终止资助，提供要取消的资助名单和解释决定的预先写好的信件。这与政府声称政府效率部仅仅是一个咨询机构的说法相矛盾。文章强调了削减经费的空前规模，并质疑终止资助的科学依据。华盛顿州总检察长正在采取法律行动，指控政府藐视法庭命令并隐瞒终止资助背后的动机。政府为削减经费辩护，称这是将美国国立卫生研究院的重点重新放在关键公共卫生优先事项上所必需的。"
  },
  {
    "id": "43928007",
    "title": "'Beyond comprehension'; Chainsawed trees in L.A. hint at city core's decline",
    "url": "https://www.latimes.com/california/story/2025-04-24/chainsawed-trees-downtown-los-angeles-city-decline",
    "summary": "Downtown Los Angeles is grappling with a sense of decline, exacerbated by the recent chainsaw vandalism of mature trees. This incident has reignited concerns about the city's core, already struggling with issues like high office vacancy rates, homelessness, and crime. Residents and business owners feel the tree cutting is a symptom of a larger problem: a lack of care and attention from city officials.\n\nThe article details the arrest of Samuel Patrick Groft, suspected of felling 13 trees across five locations. StreetsLA, the city bureau responsible for street maintenance, confirmed six trees were vandalized downtown. While the city is addressing the damage and planning replacements, the incident has sparked outrage and frustration.\n\nDespite positive developments like new restaurants, a functioning Metro connector, and plans for the 2028 Olympics, downtown faces ongoing challenges. Vacant office spaces and complex problems like homelessness and open-air drug use hinder revitalization efforts. Residents hope this incident will serve as a \"rallying cry\" for renewed action, prompting increased investment and a focus on improving the public realm. Community leaders are urging city officials to address the underlying issues and hold the perpetrator accountable, aiming to reverse the perceived \"anti-social, chaotic trajectory\" of the neighborhood. While some view the vandalism as a random act, many see it as symbolic of a deeper malaise afflicting the heart of Los Angeles.\n",
    "chinese_title": "超出理解；洛杉矶被电锯砍伐的树木暗示着城市核心的衰落",
    "chinese_summary": "洛杉矶市中心正面临衰落感，近期成熟树木遭电锯破坏事件加剧了这种状况。该事件重新引发了人们对城市核心区的担忧，该区域已然在与高企的办公室空置率、无家可归和犯罪等问题作斗争。居民和企业主认为，砍伐树木是更大问题的症状：城市官员缺乏关怀和关注。\n\n文章详细描述了Samuel Patrick Groft被捕一事，他涉嫌在五个地点砍伐了13棵树。负责街道维护的城市机构 StreetsLA 证实市中心有六棵树遭到破坏。虽然该市正在处理损失并计划更换树木，但该事件引发了愤怒和沮丧。\n\n尽管有新的餐厅开业、正常运营的地铁连接线以及2028年奥运会的规划等积极进展，市中心仍面临持续的挑战。空置的办公空间以及无家可归和露天吸毒等复杂问题阻碍了复兴工作。居民希望这一事件能够成为“集结号”，促使人们采取新的行动，增加投资，并专注于改善公共领域。社区领袖敦促城市官员解决根本问题，并追究肇事者的责任，旨在扭转该社区被认为的“反社会、混乱的轨迹”。虽然有些人认为破坏行为是随机的，但许多人认为它象征着困扰洛杉矶市中心的一种更深层次的弊病。"
  },
  {
    "id": "43921653",
    "title": "Show HN: US Routing – Python library for fast local routing in the US",
    "url": "https://github.com/ivanbelenky/us-routing",
    "summary": "US Routing is a Python library designed for fast, approximate local routing within the United States. It leverages the North American Roads dataset for its routing information. The library supports routing between cities, zip codes, and geographic coordinates.\n\nKey features include multiple routing options like shortest distance and fastest time, and detailed route information such as distance, duration, and states traversed.\n\nThe library can be installed using `pip` or `poetry`. The documentation provides usage examples, demonstrating how to find routes and access information like total distance, duration, and route steps. The library also includes error handling for scenarios where specified coordinates are too far from the existing road network data.\n\nThe library includes functionality to download and process the North American Roads dataset necessary for routing. It also provides a `BaseRouter` class for creating custom routing graphs from shapefiles.\n\nThe library is open to contributions via Pull Requests.\n",
    "chinese_title": "Show HN: US Routing – 用于美国境内快速本地路由的 Python 库",
    "chinese_summary": "美国路由是一个Python库，旨在为美国境内提供快速、近似的本地路由。它利用北美道路数据集进行路由信息。该库支持城市、邮政编码和地理坐标之间的路由。\n\n主要功能包括多种路由选项，如最短距离和最快时间，以及详细的路线信息，如距离、持续时间和途经的州。\n\n该库可以使用`pip`或`poetry`安装。文档提供了使用示例，演示了如何查找路线以及访问总距离、持续时间和路线步骤等信息。该库还包括错误处理，用于处理指定坐标距离现有道路网络数据过远的情况。\n\n该库包含下载和处理路由所需的北美道路数据集的功能。它还提供了一个`BaseRouter`类，用于从shapefile创建自定义路由图。\n\n欢迎通过Pull Requests贡献代码。"
  },
  {
    "id": "43888007",
    "title": "A cycle-accurate IBM PC emulator in your web browser",
    "url": "https://martypc.net/?mount=fd:0:Area%205150%20(Compo%20Version).img",
    "summary": "This is an announcement of MartyPC Web Edition 0.4.0, a cycle-accurate IBM PC emulator that runs directly within a web browser. The user is prompted to interact with the emulator by clicking or tapping on the provided links. The emulator is indicated to be currently \"Loading...\", suggesting that it is being initialized or downloading necessary resources.\n\nIn essence, the article highlights the availability of a portable, browser-based IBM PC emulation experience, emphasizing its precision (\"cycle-accurate\") and accessibility. No further details about features, supported hardware, or performance are provided beyond this fundamental announcement. The focus is on the immediate availability and ease of access for users to try out the emulator.\n",
    "chinese_title": "在你的网页浏览器中运行的周期精确的IBM PC模拟器",
    "chinese_summary": "MartyPC Web Edition 0.4.0 发布：一款可在网页浏览器中直接运行的、周期精确的 IBM PC 模拟器。用户可以通过点击或轻触提供的链接与模拟器互动。当前显示“加载中...”，表明模拟器正在初始化或下载必要资源。\n\n本质上，本文强调了一款便携式、基于浏览器的 IBM PC 模拟体验的可用性，突出了其精确性（“周期精确”）和可访问性。除了此基本公告之外，未提供有关功能、支持的硬件或性能的更多详细信息。重点是用户可以立即使用和轻松访问该模拟器。"
  },
  {
    "id": "43920889",
    "title": "Foundation DB Record Layer SQL API",
    "url": "https://foundationdb.github.io/fdb-record-layer/SQL_Reference.html",
    "summary": "This document provides a reference for the SQL API of the FoundationDB Record Layer. It emphasizes that the API is under active development and subject to change.\n\nThe document outlines the SQL support, including data types (primitive, struct, and array) and how NULL values are handled. It then lists different categories of SQL commands supported: DQL (Data Query Language), DDL (Data Definition Language), and DML (Data Manipulation Language). These commands allow users to query, define, and manipulate data within the Record Layer using SQL.\n\nFurthermore, the document details available functions, including both aggregate and scalar functions, enriching SQL capabilities.\n\nThe reference also explains the data model used, covering databases, schemas, and schema templates, explaining how they organize data within the system. It touches on how to bridge a pre-existing Record Layer setup to the SQL API. The document explains the concept of tables and indexes and how indexes are defined, including indexes on nested fields and how they work. It includes details regarding indexes and how bitmaps are used to identify distinct values.\n\nFinally, the document mentions the direct access API for basic operations like Scan, Get, Insert, and Delete.\n",
    "chinese_title": "Foundation DB Record Layer SQL API\n基金会数据库记录层 SQL API",
    "chinese_summary": "本文档提供了 FoundationDB Record Layer 的 SQL API 参考。请注意，该 API 仍在积极开发中，可能会发生更改。\n\n本文档概述了 SQL 支持，包括数据类型（基本类型、结构体和数组）以及 NULL 值的处理方式。然后，它列出了支持的不同 SQL 命令类别：DQL（数据查询语言）、DDL（数据定义语言）和 DML（数据操作语言）。这些命令允许用户使用 SQL 查询、定义和操作 Record Layer 中的数据。\n\n此外，本文档详细介绍了可用的函数，包括聚合函数和标量函数，从而丰富了 SQL 功能。\n\n该参考还解释了使用的数据模型，涵盖数据库、模式和模式模板，解释了它们如何在系统中组织数据。它还介绍了如何将预先存在的 Record Layer 设置桥接到 SQL API。本文档解释了表和索引的概念，以及如何定义索引，包括嵌套字段上的索引及其工作原理。 它包括有关索引的详细信息，以及如何使用位图来识别不同的值。\n\n最后，本文档提到了用于扫描、获取、插入和删除等基本操作的直接访问 API。"
  },
  {
    "id": "43919868",
    "title": "Mac Themes Garden",
    "url": "https://damien.zone/introducing-mac-themes-garden/",
    "summary": "The author announces the launch of \"Mac Themes Garden,\" a website showcasing over 3,000 Kaleidoscope themes from the Classic Mac era. This project evolved from a bot that posted Mac OS X and Classic Mac themes, which in turn was inspired by a defunct Twitter account and a desire to preserve these themes.\n\nCreating the website involved manually capturing screenshots and author information for each theme using a Mac OS 9 VM. Automation efforts were limited due to the inconsistent and sometimes missing data within the theme files. The author initially planned to finish documenting all themes before launching the site, but was encouraged to release it sooner.\n\nThe website is built with Astro, chosen for its component handling capabilities after the author encountered issues with Eleventy's WebC. Performance optimization was crucial due to the large number of themes and authors, necessitating efficient data handling to keep build times manageable.\n\nThe site's design meticulously recreates the Mac OS 9 UI using CSS tricks like box shadows, gradients, and even CSS Grid to render pixelated buttons, avoiding the use of images to maintain the authentic look and feel. The author details the CSS techniques used for window frames, title bars, and buttons.\n",
    "chinese_title": "Mac主题花园",
    "chinese_summary": "作者宣布推出“Mac Themes Garden”网站，该网站展示了来自经典Mac时代的3000多个Kaleidoscope主题。该项目源于一个发布Mac OS X和经典Mac主题的机器人，而该机器人又受到了一个已停用的Twitter帐户和保存这些主题的愿望的启发。\n\n创建该网站需要在Mac OS 9虚拟机上手动捕获每个主题的屏幕截图和作者信息。由于主题文件中的数据不一致且有时缺失，自动化工作受到限制。作者最初计划在启动网站之前完成所有主题的记录，但后来被鼓励提前发布。\n\n该网站使用Astro构建，选择Astro是因为作者在使用Eleventy的WebC时遇到问题后，发现Astro具有强大的组件处理能力。由于主题和作者数量众多，性能优化至关重要，需要高效的数据处理以保持可控的构建时间。\n\n该网站的设计精心使用CSS技巧（如阴影、渐变，甚至CSS Grid）重现了Mac OS 9的UI，以渲染像素化按钮，避免使用图像以保持其真实的外观和感觉。作者详细介绍了用于窗口框架、标题栏和按钮的CSS技术。"
  },
  {
    "id": "43920188",
    "title": "Web search on the Anthropic API",
    "url": "https://www.anthropic.com/news/web-search-api",
    "summary": "Anthropic has launched web search functionality within its API, enabling Claude models to access and utilize real-time information from across the web. This enhancement allows developers to create Claude-powered applications and agents that deliver up-to-date insights.\n\nWith web search enabled, Claude can leverage its reasoning capabilities to determine when current data is beneficial, generate targeted search queries, analyze results, and provide comprehensive answers with citations. It can also perform multiple progressive searches, refining queries for more accurate responses. Developers can control the search behavior using the `max_uses` parameter. This eliminates the need for developers to manage their own web search infrastructure.\n\nUse cases include financial analysis with real-time stock data, legal research with recent court decisions, developer tools referencing current API documentation, and productivity applications incorporating company reports and industry research.\n\nAnthropic emphasizes trust and control, providing citations for all web-sourced information and allowing administrators to specify domain allow and block lists at the organizational level.\n\nWeb search is available in Claude Code to enhance development workflows with the latest information on development tools and libraries. Customer spotlights from Poe and Adaptive.ai highlight the tool's cost-effectiveness, speed, thoroughness, and accuracy.\n\nWeb search is available for Claude 3.7 Sonnet, upgraded Claude 3.5 Sonnet, and Claude 3.5 Haiku at $10 per 1,000 searches, in addition to standard token costs.\n",
    "chinese_title": "在Anthropic API上进行网页搜索",
    "chinese_summary": "Anthropic 在其 API 中推出网络搜索功能，使 Claude 模型能够访问和利用来自网络的实时信息。此增强功能允许开发者创建由 Claude 提供支持的应用程序和代理，以提供最新的见解。\n\n启用网络搜索后，Claude 可以利用其推理能力来确定何时使用最新数据，生成有针对性的搜索查询，分析结果并提供带有引用的全面答案。它还可以执行多次渐进式搜索，优化查询以获得更准确的响应。开发者可以使用 `max_uses` 参数来控制搜索行为。这消除了开发者管理自己的网络搜索基础设施的需求。\n\n用例包括使用实时股票数据的财务分析、包含近期法院判决的法律研究、引用当前 API 文档的开发者工具以及包含公司报告和行业研究的生产力应用程序。\n\nAnthropic 强调信任和控制，为所有网络来源的信息提供引用，并允许管理员在组织级别指定域允许和阻止列表。\n\n网络搜索已在 Claude Code 中提供，可通过最新的开发工具和库信息来增强开发工作流程。来自 Poe 和 Adaptive.ai 的客户聚光灯展示了该工具的成本效益、速度、彻底性和准确性。\n\n网络搜索适用于 Claude 3.7 Sonnet、升级后的 Claude 3.5 Sonnet 和 Claude 3.5 Haiku，价格为每次 1,000 次搜索 10 美元，此外还需支付标准 token 费用。"
  },
  {
    "id": "43927314",
    "title": "Senators revive bill to restrict TSA facial recognition at airports",
    "url": "https://www.washingtonpost.com/politics/2025/05/08/tsa-face-recognition-airports-privacy-merkley/",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "参议员重启法案限制美国运输安全管理局在机场使用面部识别技术",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "43917448",
    "title": "Ghost students are creating problems for California colleges",
    "url": "https://www.sfgate.com/bayarea/article/ghost-students-creating-problem-calif-colleges-20311708.php",
    "summary": "Here's a summary of the article based on the provided title:\n\nThe SFGate article \"Ghost students are creating problems for California colleges\" details the issue of students who enroll in California community colleges and state universities but fail to actively participate in classes or complete coursework, yet remain on the rolls. These \"ghost students\" pose several problems for the institutions.\n\nFirstly, they artificially inflate enrollment numbers. Colleges receive funding based on student enrollment, so these phantom students lead to institutions receiving state funds for students who are not actually benefiting from the education. This represents a misallocation of resources.\n\nSecondly, the presence of ghost students impacts resource allocation within the colleges. Classes may be created and staffed based on enrollment numbers inflated by these students, potentially diverting resources away from courses with more active and engaged students.\n\nThirdly, the article likely discusses the difficulties colleges face in accurately identifying and removing ghost students from their rolls. This can be a complex process involving verifying attendance, tracking student activity, and navigating bureaucratic hurdles.\n\nThe article likely highlights the efforts California colleges are making to address the problem, such as implementing new verification methods or revising enrollment policies to ensure that funding is tied to actual student participation and success. The overarching concern is that the presence of ghost students is detrimental to the efficient and effective use of state resources dedicated to higher education.\n",
    "chinese_title": "幽灵学生正给加州高校带来问题。",
    "chinese_summary": "以下是根据标题对文章的摘要：\n\nSFGate的文章《幽灵学生正在给加州高校带来问题》详细描述了学生注册加州社区大学和州立大学后，却不积极参与课堂或完成课程，但仍保留在册的问题。这些“幽灵学生”给院校带来了一些问题。\n\n首先，他们人为地夸大了入学人数。高校获得的资金是基于学生入学人数的，因此这些幽灵学生导致院校为没有真正受益于教育的学生获得州政府资金。这代表着资源的错误分配。\n\n其次，幽灵学生的存在影响了高校内部的资源分配。可能会基于被这些学生夸大的入学人数来开设和配备课程，从而可能将资源从有更多积极和投入的学生的课程中转移走。\n\n第三，文章可能讨论了高校在准确识别和将幽灵学生从花名册中移除所面临的困难。这可能是一个复杂的过程，涉及验证出勤率、跟踪学生活动以及克服官僚障碍。\n\n文章可能强调了加州高校为解决该问题所做的努力，例如实施新的验证方法或修改招生政策，以确保资金与学生的实际参与度和成功率挂钩。最令人担忧的是，幽灵学生的存在不利于有效利用州政府用于高等教育的资源。"
  },
  {
    "id": "43892773",
    "title": "Bootstrapping Lisp in a Boot Sector",
    "url": "https://github.com/jart/sectorlisp",
    "summary": "Sectorlisp is a project focused on creating the simplest possible LISP implementation. It presents three key components: a pure LISP meta-circular evaluator written as a single expression (`lisp.lisp`), a portable C reference implementation for bootstrapping the evaluator on POSIX systems (`lisp.c`), and a 512-byte i8086 LISP implementation that boots from BIOS on PCs (`sectorlisp.S`). The project claims the 512-byte implementation is the smallest \"true\" LISP to date.\n\nThe project aims to demonstrate the core essence of LISP by stripping away non-essential elements and providing a minimal, yet functional, implementation. Users can copy and paste LISP code examples into the REPL of either the C or bootstrapped LISP environments.\n\nThe C implementation can be built with `make` and run with `./lisp`. The `sectorlisp.bin` file created by `make` is a bootable master boot record. The article suggests using the Das Blinkenlights emulator or QEMU to run `sectorlisp.bin` if direct booting is not desired. A video demonstrates booting sectorlisp in the Blinkenlights emulator, bootstrapping the meta-circular evaluator, and running a program to find the first element in a tree.\n",
    "chinese_title": "在引导扇区中自举 Lisp",
    "chinese_summary": "Sectorlisp是一个专注于创建尽可能最简LISP实现的的项目。它包含三个关键部分：一个用单个表达式编写的纯LISP元循环求值器 (`lisp.lisp`)，一个用于在POSIX系统上引导求值器的可移植C语言参考实现 (`lisp.c`)，以及一个从PC的BIOS启动的512字节的i8086 LISP实现 (`sectorlisp.S`)。该项目声称512字节的实现是迄今为止最小的“真正的”LISP。\n\n该项目旨在通过剥离非必要元素并提供最小但功能齐全的实现来展示LISP的核心本质。用户可以将LISP代码示例复制并粘贴到C或自举LISP环境的REPL中。\n\nC实现可以使用`make`构建，并使用`./lisp`运行。`make`创建的`sectorlisp.bin`文件是一个可引导的主引导记录。文章建议如果不需要直接启动，可以使用Das Blinkenlights模拟器或QEMU来运行`sectorlisp.bin`。一段视频演示了在Blinkenlights模拟器中启动sectorlisp，自举元循环求值器，并运行程序以查找树中的第一个元素。"
  },
  {
    "id": "43924117",
    "title": "Secret Messages Detected on Egyptian Obelisk in Paris",
    "url": "https://archaeology.org/news/2025/05/06/secret-messages-detected-on-egyptian-obelisk-in-paris/",
    "summary": "Egyptologist Jean-Guillaume Olette-Pelletier discovered hidden \"crypto-hieroglyphics\" on the Egyptian obelisk in Paris's Place de la Concorde. The obelisk, originally erected during Ramesses II's reign (1279–1213 b.c.) outside Luxor Temple, was moved to France in the 1830s. Olette-Pelletier noticed unusual carvings and suspected they were secret messages meant only for Egypt's intellectual elite.\n\nHis examination during the obelisk's cleaning for the 2024 Paris Olympics confirmed at least seven instances of crypto-hieroglyphics. These messages essentially reinforced Ramesses II's divine right to rule, proclaiming his selection by the gods and lineage from Amun-Re and Maat.\n\nCrucially, the placement of these hidden messages was strategic. They would have been visible only to nobles arriving at the Luxor Temple by boat during the annual Opet festival, held during the Nile's flood season. Olette-Pelletier explains that the angle of approach would have allowed the nobility to see the hidden message, subtly reminding them that the king's authority was divinely ordained and unassailable. This suggests the crypto-hieroglyphics served as propaganda targeted specifically at the highest levels of Egyptian society.\n",
    "chinese_title": "在巴黎埃及方尖碑上发现秘密信息",
    "chinese_summary": "埃及学家让-纪尧姆·奥莱特-佩尔蒂埃在巴黎协和广场的埃及方尖碑上发现了隐藏的“密码象形文字”。这座方尖碑最初在拉美西斯二世统治时期（公元前1279-1213年）立于卢克索神庙外，于19世纪30年代被运往法国。奥莱特-佩尔蒂埃注意到了一些不寻常的雕刻，并怀疑这些是专门为埃及知识精英准备的秘密信息。\n\n他在为2024年巴黎奥运会清洁方尖碑期间的检查证实了至少有七处密码象形文字。这些信息本质上强化了拉美西斯二世的神权统治，宣称他被众神选中，并拥有阿蒙-拉和玛特的血统。\n\n至关重要的是，这些隐藏信息的位置具有战略意义。它们本应只有在尼罗河洪水季节举行的年度奥佩特节期间，乘船抵达卢克索神庙的贵族才能看到。奥莱特-佩尔蒂埃解释说，接近的角度本应让贵族们看到隐藏的信息，巧妙地提醒他们，国王的权力是神授的，不可侵犯的。这表明密码象形文字是专门针对埃及社会最高层的宣传。"
  },
  {
    "id": "43926477",
    "title": "The People Refusing to Use AI",
    "url": "https://www.bbc.com/news/articles/c15q5qzdjqxo",
    "summary": "This article explores the reasons why some people are actively choosing to resist the increasing integration of AI into various aspects of life and work. Sabine Zetteler, a communications agency owner, refuses to use AI due to concerns about the loss of human creativity, connection, and the potential displacement of jobs. She questions the value of AI-generated content and prioritizes contributing to society over maximizing profits.\n\nFlorence Achery, owner of Yoga Retreats & More, cites the significant environmental impact of AI's energy-intensive data centers as her primary reason for avoidance. She sees AI as soulless and contradictory to her business's focus on human connection.\n\nSierra Hanson, working in public affairs, is concerned about the potential for AI to erode critical thinking skills. She believes that relying on AI for tasks like scheduling prevents individuals from developing problem-solving abilities.\n\nHowever, the article also acknowledges the pressure to adopt AI. Jackie Adams, initially resistant due to environmental concerns and a perception of laziness, was compelled to use AI at her digital marketing firm to maintain her career after budget cuts and evolving job requirements. While now finding some benefits in AI, she feels a loss of control as AI increasingly permeates online experiences.\n\nProfessor James Brusseau suggests that opting out of AI is becoming increasingly difficult, predicting AI will take over tasks where human input isn't deemed essential, but humans will still be needed for important tasks, like judging court cases and making medical decisions about transplants.\n",
    "chinese_title": "拒绝使用人工智能的人",
    "chinese_summary": "本文探讨了部分人群积极抵制人工智能日益融入生活和工作各个方面的原因。传播机构所有者萨宾·泽特勒因担心失去人类创造力、人际关系以及潜在的职位取代而拒绝使用人工智能。她质疑人工智能生成内容的价值，并将为社会做出贡献置于利润最大化之上。\n\n瑜伽静修所及更多公司所有者弗洛伦斯·阿切里认为，人工智能高能耗数据中心对环境造成重大影响是她避免使用人工智能的主要原因。她认为人工智能是无情的，与她的业务侧重于人际关系相矛盾。\n\n在公共事务领域工作的塞拉·汉森担心人工智能会削弱批判性思维能力。她认为，依赖人工智能完成诸如日程安排之类的任务会阻碍个人发展解决问题的能力。\n\n然而，文章也承认了采用人工智能的压力。杰基·亚当斯最初因环境问题和对惰性的看法而抵制人工智能，但在预算削减和工作要求不断变化后，她被迫在她所在的数字营销公司使用人工智能以保住自己的职业。虽然现在发现人工智能的一些好处，但她感到失去了控制，因为人工智能越来越渗透到在线体验中。\n\n詹姆斯·布鲁索教授认为，选择退出人工智能正变得越来越困难，他预测人工智能将接管那些人类输入被认为不必要的任务，但人类仍然需要处理重要任务，比如审判案件和做出关于移植的医疗决策。"
  },
  {
    "id": "43916411",
    "title": "WeightWatchers files bankruptcy",
    "url": "https://www.wsj.com/articles/weightwatchers-files-bankruptcy-to-adapt-to-chemically-induced-weight-loss-future-a63aa8ac",
    "summary": "WeightWatchers (WW International) has filed for Chapter 11 bankruptcy protection in the U.S., citing the impact of new weight-loss drugs like Ozempic and Mounjaro on its business model. The company intends to use the bankruptcy process to restructure its debt and adapt to the changing landscape of weight management, which is increasingly influenced by these chemically-induced solutions.\n\nSpecifically, WW plans to shed approximately $1.5 billion in debt. The prepackaged bankruptcy plan has the support of key stakeholders and lenders, which should allow for a relatively quick resolution.\n\nThe shift in consumer preference towards these drugs has significantly challenged WW's traditional subscription-based program focused on lifestyle changes, community support, and personalized coaching. While WW has attempted to integrate telehealth services and offer its own weight-loss drug program, it hasn't been enough to offset the decline in its core business.\n\nThe company emphasizes that its operations will continue as usual during the bankruptcy proceedings, and members will still have access to its services. The restructuring is aimed at ensuring WW can remain competitive and relevant in the evolving weight-loss market by focusing on its digital offerings, clinical programs, and personalized weight management solutions, including, potentially, further integration with the use of weight-loss drugs. The bankruptcy filing represents a strategic move to financially restructure the company and better position itself for a future where weight-loss drugs play a more prominent role.\n",
    "chinese_title": "慧优体（WeightWatchers）申请破产",
    "chinese_summary": "慧俪轻体(WW International)已在美国申请第11章破产保护，理由是奥земpic和Mounjaro等新型减肥药对其商业模式的影响。该公司计划利用破产程序重组债务，并适应日益受到这些化学诱导解决方案影响的体重管理领域不断变化的格局。\n\n具体而言，WW计划削减约15亿美元的债务。预先安排的破产计划已获得主要利益相关者和贷款人的支持，这应有助于相对快速地解决问题。\n\n消费者偏好转向这些药物对WW传统的基于订阅、侧重于生活方式改变、社区支持和个性化指导的项目构成了重大挑战。虽然WW试图整合远程医疗服务并提供自己的减肥药项目，但这仍不足以抵消其核心业务的下滑。\n\n该公司强调，在破产程序期间，其运营将照常进行，会员仍可使用其服务。重组旨在确保WW通过专注于其数字产品、临床项目和个性化体重管理解决方案，包括可能进一步整合减肥药的使用，从而在不断变化的减肥市场中保持竞争力和相关性。申请破产代表着一项战略举措，旨在对公司进行财务重组，使其更好地适应减肥药发挥更重要作用的未来。"
  },
  {
    "id": "43916956",
    "title": "Show HN: eInk optimized manga with Kindle Comic Converter (+Kobo/ReMarkable)",
    "url": "https://github.com/ciromattia/kcc",
    "summary": "KCC (Kindle Comic Converter) is a free, open-source tool designed to optimize comics and manga for e-ink devices like Kindles, Kobos, and ReMarkable tablets. It converts various input formats (folders of images, CBZ, CBR, PDF) into formats suitable for e-readers (MOBI/AZW3, EPUB, KEPUB, CBZ).\n\nKey features include image processing tailored for e-ink screens, such as gamma correction and resolution downscaling to improve visual quality and performance on these devices. It also supports manga-style right-to-left reading.\n\nThe tool offers both a GUI and command-line interface (CLI) for advanced users. The CLI provides customizable options for image processing, output formats, and device profiles, allowing for fine-grained control over the conversion process. Device profiles are included for a range of Kindle and Kobo models, including settings for reMarkable tablets.\n\nInstallation instructions are provided for Windows, macOS (including both Intel and Apple Silicon), and Linux (via Flatpak, Docker, and AppImage). Users may need to install optional tools like Kindle Previewer/KindleGen and 7-Zip to enable certain features. Troubleshooting advice is included for common problems such as KindleGen detection and dark images.\n",
    "chinese_title": "Show HN: 适用于 Kindle Comic Converter 的 eInk 优化漫画 (+Kobo/ReMarkable)",
    "chinese_summary": "KCC (Kindle Comic Converter) 是一款免费开源工具，旨在优化漫画和漫画书，使其适用于 Kindle、Kobo 和 ReMarkable 平板电脑等电子墨水设备。它将各种输入格式（图像文件夹、CBZ、CBR、PDF）转换为适用于电子阅读器的格式 (MOBI/AZW3、EPUB、KEPUB、CBZ)。\n\n主要功能包括针对电子墨水屏幕定制的图像处理，例如伽马校正和分辨率缩小，以提高这些设备上的视觉质量和性能。它还支持漫画风格的从右到左阅读。\n\n该工具为高级用户提供 GUI 和命令行界面 (CLI)。 CLI 提供可定制的图像处理、输出格式和设备配置文件选项，从而可以对转换过程进行细粒度控制。设备配置文件包含一系列 Kindle 和 Kobo 型号，包括 ReMarkable 平板电脑的设置。\n\n提供了 Windows、macOS（包括 Intel 和 Apple Silicon）和 Linux（通过 Flatpak、Docker 和 AppImage）的安装说明。用户可能需要安装 Kindle Previewer/KindleGen 和 7-Zip 等可选工具才能启用某些功能。包括针对 KindleGen 检测和图像过暗等常见问题的故障排除建议。"
  },
  {
    "id": "43893464",
    "title": "Docs like code in basic terms",
    "url": "https://deborahwrites.com/blog/docs-like-code-basic-intro/",
    "summary": "This article provides a beginner-friendly introduction to \"Docs Like Code,\" a practice of treating documentation development with the same tools and processes used for code development. It demystifies the concept for non-developers who may be unfamiliar with terms like git, build pipelines, and version control.\n\nThe author outlines the advantages of Docs Like Code, including easier developer contributions, community collaboration, and cost-effectiveness through open-source tools. The disadvantages highlighted are the required web development skills and the potential for costly custom theme development.\n\nThe article explains key terminology and tools such as text editors (VS Code), Markdown, git (version control), GitHub/GitLab (code repositories), static site generators (MkDocs), themes (Material for MkDocs), and linters (Vale). It also describes processes like build and deployment, and CI/CD (Continuous Integration/Continuous Deployment).\n\nThe author details the process of writing and deploying documentation using Docs Like Code, including cloning a repository, creating branches, writing in Markdown, pushing changes, opening pull requests, and the automated build and deployment process. The importance of branching and merging in git for collaboration and version control is explained. Finally, the article provides a recommended learning path, starting with git, then moving onto static site generators and deployment, and includes links to useful resources.\n",
    "chinese_title": "文档即代码，简而言之。",
    "chinese_summary": "本文为“文档即代码”提供了一份入门友好的介绍，这是一种使用与代码开发相同的工具和流程来对待文档开发实践的方式。它为可能不熟悉诸如git、构建管道和版本控制等术语的非开发人员揭开了这一概念的神秘面纱。\n\n作者概述了“文档即代码”的优势，包括更容易的开发者贡献、社区协作以及通过开源工具实现的成本效益。 强调的缺点是所需的Web开发技能以及潜在的昂贵自定义主题开发。\n\n本文解释了关键术语和工具，例如文本编辑器（VS Code）、Markdown、git（版本控制）、GitHub/GitLab（代码存储库）、静态站点生成器（MkDocs）、主题（Material for MkDocs）和代码检查工具（Vale）。 它还描述了构建和部署等过程，以及CI/CD（持续集成/持续部署）。\n\n作者详细介绍了使用“文档即代码”编写和部署文档的过程，包括克隆存储库、创建分支、用Markdown编写、推送更改、打开拉取请求以及自动构建和部署过程。 解释了git中分支和合并对于协作和版本控制的重要性。 最后，本文提供了一条推荐的学习路径，从git开始，然后过渡到静态站点生成器和部署，并包含指向有用资源的链接。"
  },
  {
    "id": "43921624",
    "title": "Yggdrasil is an experimental compact routing scheme that is fully decentralised",
    "url": "https://yggdrasil-network.github.io/about.html",
    "summary": "Yggdrasil is an experimental, fully decentralized, and compact routing scheme aiming for shortest-path routing. Nodes act as equal participants, connecting via peerings over any IP network (wired, wireless, LAN, or Internet), and automatically route traffic towards its destination, even behind NAT. The network self-heals from link failures, making it suitable for dynamic mesh networks.\n\nEach node possesses a location-independent cryptographic identity from which stable IPv6 addresses are generated, allowing existing IPv6 applications to function without significant modification. Unlike hierarchical networks that require manual configuration and centralisation, Yggdrasil requires minimal configuration, enabling rapid network deployment. Nodes self-assign addresses and routing information propagates automatically. This end-to-end routability is intended to enable edge computing and real-world mesh networks independent of the public internet.\n\nYggdrasil differs from anonymity-focused projects like Tor and I2P, and although it can be used for private networks like VPNs such as Wireguard, it does not natively provide exit nodes to the public Internet.\n\nCurrently in alpha, Yggdrasil serves as a research project to test the scalability of its routing scheme via a public overlay network. While it encourages experimentation and participation, it cautions against mission-critical use due to potential unknown failure modes. Future outcomes range from limited adoption to the discovery of design flaws, or, ideally, successful scaling leading to optimised implementations and integration into other projects.\n",
    "chinese_title": "Yggdrasil是一种实验性的紧凑型路由方案，完全去中心化。",
    "chinese_summary": "Yggdrasil是一种实验性的、完全去中心化的紧凑型路由方案，旨在实现最短路径路由。节点作为平等的参与者，通过任何IP网络（有线、无线、局域网或互联网）上的对等连接，自动将流量路由到其目的地，即使在NAT之后。该网络可以从链路故障中自我修复，使其适用于动态网状网络。\n\n每个节点都拥有一个独立于位置的加密身份，由此生成稳定的IPv6地址，从而允许现有的IPv6应用程序无需重大修改即可运行。与需要手动配置和集中化的分层网络不同，Yggdrasil需要最少的配置，从而可以快速部署网络。节点自动分配地址，路由信息自动传播。这种端到端的可路由性旨在实现边缘计算和独立于公共互联网的实际网状网络。\n\nYggdrasil与像Tor和I2P这样以匿名为重点的项目不同，虽然它可以像Wireguard这样的VPN一样用于私有网络，但它本身并不提供到公共互联网的出口节点。\n\n目前处于alpha阶段的Yggdrasil作为一个研究项目，通过公共覆盖网络测试其路由方案的可扩展性。虽然它鼓励实验和参与，但由于潜在的未知故障模式，它警告不要用于关键任务。未来的结果范围从有限的采用到发现设计缺陷，或者，理想情况下，成功的扩展导致优化实现并集成到其他项目中。"
  },
  {
    "id": "43926502",
    "title": "LockBit Hacked – Plaintext Passwords",
    "url": "https://gbhackers.com/lockbit-ransomware-group-breached/",
    "summary": "The LockBit ransomware group, a major player in cyber extortion, has suffered a significant breach. Attackers defaced their dark web sites and leaked a database dump containing operational data, internal chats, and most notably, plaintext passwords for 75 administrators and affiliates. The attackers, identity unknown, left a message taunting LockBit.\n\nSecurity researchers have confirmed the authenticity of the leaked data, which includes Bitcoin wallet addresses, negotiation chat logs, and details on custom ransomware variants. The exposure of plaintext passwords is a major security blunder for a group specializing in exploiting others. Experts believe this leak will help track cryptocurrency payments and attribute attacks to specific actors.\n\nLockBit has attempted to downplay the incident, claiming only a \"light panel\" was compromised. They are also offering a reward for information about the attacker. This breach compounds LockBit's troubles following Operation Cronos, a law enforcement effort that temporarily disrupted their infrastructure. Experts are drawing parallels between this attack and a recent breach of the Everest ransomware operation, linked to a PHP vulnerability.\n\nThe exposure of LockBit's internal information and affiliate credentials could severely damage their credibility and hinder future operations, especially given their prominent role in the ransomware landscape.\n",
    "chinese_title": "LockBit遭黑客入侵 – 明文密码",
    "chinese_summary": "LockBit勒索软件团伙遭遇重大泄露。攻击者篡改了他们的暗网站点，并泄露了一个包含运营数据、内部聊天记录以及最引人注目的是75名管理员和联盟成员的明文密码的数据库转储。身份不明的攻击者留下了一条嘲讽LockBit的消息。\n\n安全研究人员已证实泄露数据的真实性，其中包括比特币钱包地址、谈判聊天记录以及定制勒索软件变体的详细信息。明文密码的泄露对于一个专门利用他人的团伙来说是一个重大的安全失误。专家认为，这次泄露将有助于追踪加密货币支付，并将攻击归因于特定行为者。\n\nLockBit试图淡化这一事件，声称只有“light panel”被破坏。他们还在悬赏征集有关攻击者的信息。继“克洛诺斯行动”（一项暂时扰乱其基础设施的执法行动）之后，这次泄露加剧了LockBit的困境。专家们将这次攻击与最近发生的与PHP漏洞有关的Everest勒索软件行动的泄露事件相提并论。\n\nLockBit内部信息和联盟成员凭证的泄露可能会严重损害他们的信誉并阻碍未来的行动，尤其是考虑到他们在勒索软件领域中的突出作用。"
  },
  {
    "id": "43886604",
    "title": "How three years at McKinsey shaped my second startup",
    "url": "https://blog.zactownsend.com/know-your-enemy-how-three-years-at-mckinsey-shaped-my-second-startup",
    "summary": "This article outlines the author's experience at McKinsey & Company and how it shaped their second startup, Meanwhile, a life insurance company aiming to disrupt the industry with AI and automation. The author joined McKinsey for practical reasons (money, prestige, resume building) and aspirational ones (understanding competition).\n\nDuring their three years, the author worked on two main types of projects: building new ventures within large companies and assisting incumbents with risk and compliance issues. The \"Leap by McKinsey\" projects, where the author acted as an \"entrepreneur in residence,\" highlighted the power of distribution. They learned that even incremental product improvements could achieve significant traction when paired with established distribution channels. However, they also observed that incumbents struggled to disrupt themselves due to organizational inertia.\n\nThe risk transformation projects revealed the difficulty of reforming large, established institutions due to their size and complex processes. This experience, combined with the emerging potential of AI and automation, led the author to believe that building a vertically integrated, full-stack solution from scratch is the best way to disrupt a market.\n\nMeanwhile's vision is to become the world's largest life insurer by customer count, leveraging digital money, AI, and automation to serve a billion people with a lean team. The author believes that the easier path of building AI tools for incumbents is less impactful than building a new company from the ground up. The author acknowledges McKinsey's scandals but states that they didn't experience anything unethical personally. They also discuss the credential aspect of working at McKinsey as a means of social mobility. Finally, they mention the ethics around working with competitor clients is taken very seriously.\n",
    "chinese_title": "在麦肯锡的三年如何塑造了我的第二次创业",
    "chinese_summary": "本文概述了作者在麦肯锡公司的工作经历，以及这段经历如何塑造了他们的第二个创业项目——Meanwhile，一家致力于通过人工智能和自动化颠覆行业的寿险公司。作者加入麦肯锡的原因既务实（金钱、声望、简历增色），也抱有理想（了解竞争）。\n\n在麦肯锡的三年里，作者主要参与了两类项目：在大公司内部创建新业务，以及协助现有企业处理风险和合规问题。在“Leap by McKinsey”项目中，作者担任“常驻企业家”，这凸显了分销的力量。他们了解到，即使是渐进式的产品改进，如果与成熟的分销渠道相结合，也能获得显著的吸引力。然而，他们也观察到，由于组织惯性，现有企业很难颠覆自己。\n\n风险转型项目揭示了由于规模庞大和流程复杂，改革大型成熟机构的难度。这段经历，加上人工智能和自动化领域涌现的潜力，让作者相信，从头开始构建一个垂直整合的全栈解决方案是颠覆市场的最佳方式。\n\nMeanwhile的愿景是成为全球客户数量最多的寿险公司，利用数字货币、人工智能和自动化，以精简的团队为十亿人提供服务。作者认为，为现有企业构建人工智能工具这条更简单的道路，其影响力不如从零开始创建一家新公司。作者承认了麦肯锡的丑闻，但表示他们个人没有经历过任何不道德的事情。他们还讨论了在麦肯锡工作作为一种社会流动手段的资历方面。最后，他们提到与竞争对手客户合作的道德问题非常重要。"
  },
  {
    "id": "43925502",
    "title": "Iranian Cyber Actors Impersonate Model Agency in Suspected Espionage Operation",
    "url": "https://unit42.paloaltonetworks.com/iranian-attackers-impersonate-model-agency/",
    "summary": "This Unit 42 report details a suspected Iranian cyber espionage operation where threat actors impersonated a German model agency, Mega Model Agency. The attackers created a fake website mimicking the real one to collect detailed visitor information, including browser languages, screen resolutions, IP addresses, and browser fingerprints, likely for targeted spear phishing attacks.\n\nThe website includes an obfuscated JavaScript designed to harvest visitor data. The site also replaces a real model's profile with a fake one, featuring a fictitious model named \"Shir Benzion\" and a non-functional link to a private album, indicating preparation for social engineering.\n\nUnit 42 attributes this activity with high confidence to an Iranian threat group and suspects potential overlap with Agent Serpens (APT35 or Charming Kitten), a group known for targeting Iranian dissidents, journalists, and activists abroad.\n\nThe report emphasizes the evolving nature of cyber espionage and the importance of vigilance, especially for those involved with Iranian activist communities. It advises cautious treatment of unsolicited contacts and independent verification of websites and offers. Palo Alto Networks customers are protected through Advanced URL Filtering, Advanced DNS Security, and Advanced Threat Prevention. The report concludes with Indicators of Compromise (IOCs), including the fake website's domain and URLs, along with contact information for Unit 42 Incident Response.\n",
    "chinese_title": "伊朗网络行动者冒充模特经纪公司进行疑似间谍活动",
    "chinese_summary": "Unit 42报告：伊朗网络间谍活动冒充德国Mega模特经纪公司。攻击者创建虚假网站模仿真实网站，收集详细访问者信息，包括浏览器语言、屏幕分辨率、IP地址和浏览器指纹，可能用于有针对性的鱼叉式网络钓鱼攻击。\n\n该网站包含混淆的JavaScript，旨在收集访问者数据。该网站还将一个真实模特的个人资料替换为虚假个人资料，其中包含一个名为“Shir Benzion”的虚构模特和一个无法使用的私人相册链接，表明正在为社交工程做准备。\n\nUnit 42高度确信地将此活动归因于一个伊朗威胁组织，并怀疑与Agent Serpens（APT35或Charming Kitten）存在潜在的重叠，该组织以针对伊朗持不同政见者、记者和海外活动家而闻名。\n\n该报告强调了网络间谍活动的不断演变以及保持警惕的重要性，特别是对于那些参与伊朗活动人士社区的人。它建议谨慎对待未经请求的联系，并独立验证网站和优惠。Palo Alto Networks的客户通过高级URL过滤、高级DNS安全和高级威胁防御受到保护。该报告最后提供了入侵指标（IOC），包括虚假网站的域名和URL，以及Unit 42事件响应的联系信息。"
  },
  {
    "id": "43919959",
    "title": "How to Average in Prolog (2017)",
    "url": "https://storytotell.org/how-to-average-in-prolog",
    "summary": "This article satirically explores how to calculate the average of a list of numbers in Prolog, highlighting the tension between practical, concise solutions and the often convoluted approaches required for academic exercises. The author criticizes the common practice of prohibiting the use of Prolog's built-in functions and libraries, forcing students to recreate functionality using recursion, thereby obscuring Prolog's inherent power and readability.\n\nThe article begins with a simple, declarative solution using `length/2` and `sumlist/2`, emphasizing its resemblance to the mathematical definition of average. Then, it showcases increasingly complex and inefficient solutions, mimicking the perceived demands of a \"clueless professor\" who prioritizes demonstrating recursion over practical problem-solving.\n\nThe author presents a procedural-to-Prolog conversion, involving recursive helper predicates and manual state management (sum and count variables). He then demonstrates how to generate a list of numbers using manual list construction, satirically contrasting this with the simplicity of using `findall/3`.\n\nUltimately, the author flattens these approaches into a single, verbose, and repetitive predicate, sarcastically praising it as resembling \"Professor of Programming Languages code.\" The article concludes by emphasizing that Prolog has a rich standard library that is often forbidden in educational settings and that any procedural loop can be translated into Prolog using recursion.\n",
    "chinese_title": "Prolog中如何求平均值 (2017)",
    "chinese_summary": "本文讽刺性地探讨了如何在Prolog中计算数字列表的平均值，突出了实用、简洁的解决方案与学术练习中通常需要的复杂方法之间的紧张关系。作者批评了禁止使用Prolog内置函数和库的常见做法，迫使学生使用递归来重新创建功能，从而掩盖了Prolog固有的强大功能和可读性。\n\n文章首先使用`length/2`和`sumlist/2`提供了一个简单、声明式的解决方案，强调了它与平均值的数学定义的相似性。然后，它展示了越来越复杂和低效的解决方案，模仿了“无知的教授”的感知需求，他们优先考虑演示递归而不是实际解决问题。\n\n作者展示了一个程序式到Prolog的转换，涉及递归辅助谓词和手动状态管理（总和和计数变量）。然后，他演示了如何使用手动列表构建来生成数字列表，讽刺性地将其与使用`findall/3`的简单性进行对比。\n\n最终，作者将这些方法扁平化为一个冗长、重复的谓词，并讽刺地称赞它类似于“编程语言教授的代码”。文章最后强调，Prolog拥有丰富的标准库，但在教育环境中通常是被禁止的，并且任何程序循环都可以使用递归转换为Prolog。"
  },
  {
    "id": "43922698",
    "title": "I can’t understand Apple’s Critical Alert policy (2023)",
    "url": "https://jhan.bearblog.dev/i-cant-understand-apples-critical-alert-policy/",
    "summary": "The author is frustrated by Apple's rejection of their request for Critical Alert API access for their new iOS app, SuperDose, a medication reminder. The app is designed to send notifications that bypass silent mode and Do Not Disturb, ensuring users take critical medications, like those for hypertension, on time.\n\nThe author argues their app's use case aligns perfectly with the intended purpose of Critical Alerts, especially since Apple's own Health app uses them for medication reminders. They find Apple's reasoning for rejection - \"Apps that can't enforce that usage are not likely candidates for this API\" - contradictory, highlighting that Critical Alerts require explicit user consent, mitigating the risk of abuse.\n\nThey also express confusion as general-purpose reminder apps seem to have been granted Critical Alert access despite less urgent use cases. The lack of Critical Alert permission renders SuperDose incomplete, potentially leading to missed medication doses and endangering users who rely on the app.\n",
    "chinese_title": "我看不懂苹果的关键提醒策略 (2023)",
    "chinese_summary": "作者对苹果拒绝其新iOS应用SuperDose（一款药物提醒应用）的关键提醒API访问权限感到沮丧。该应用旨在发送绕过静音模式和勿扰模式的通知，确保用户按时服用关键药物，例如高血压药物。\n\n作者认为，其应用的用例与关键提醒的预期用途完全一致，尤其是在苹果自己的健康应用也使用该功能进行药物提醒的情况下。他们发现苹果的拒绝理由——“无法强制执行使用的应用不太可能是此API的候选者”——是矛盾的，并强调关键提醒需要明确的用户同意，从而减轻了滥用的风险。\n\n他们还表示困惑，因为通用提醒应用似乎已被授予关键提醒访问权限，尽管其用例并不那么紧急。缺乏关键提醒权限使得SuperDose不完整，可能导致错过服药剂量，从而危及依赖该应用的用户。"
  },
  {
    "id": "43889972",
    "title": "Ancient DNA from the green Sahara reveals ancestral North African lineage",
    "url": "https://www.nature.com/articles/s41586-025-08793-7",
    "summary": "This article presents ancient DNA analysis of two 7,000-year-old female individuals from the Takarkori rock shelter in Libya, shedding light on the genetic history of the Green Sahara during the African Humid Period. The analysis reveals that these individuals belonged to a previously unknown, deeply divergent North African lineage that separated from sub-Saharan African lineages around the same time as the out-of-Africa migration.\n\nKey findings include:\n\n*   **Unique Ancestry:** The Takarkori individuals' ancestry is largely derived from this isolated North African lineage, distinct from both sub-Saharan Africans and populations outside Africa.\n*   **Relationship to Taforalt:** They are closely related to 15,000-year-old foragers from Taforalt, Morocco, suggesting a stable North African population predating the Green Sahara.\n*   **Limited Sub-Saharan Gene Flow:** Unlike the Taforalt individuals, the Takarkori showed ten times less Neanderthal ancestry than Levantine farmers, yet significantly more than contemporary sub-Saharan genomes.\n*   **Cultural Diffusion of Pastoralism:** The presence of this distinct genetic lineage suggests that pastoralism spread into the Sahara through cultural diffusion rather than significant human migration from the Levant.\n*   **No Genetic Exchange across the Green Sahara:** There is no evidence of substantial gene flow from sub-Saharan Africa to Northern Africa during the AHP.\n\nThe study suggests that a distinct North African lineage existed in relative isolation for a long period, and the spread of pastoralism during the Green Sahara was primarily a cultural phenomenon.\n",
    "chinese_title": "来自绿色撒哈拉的古老DNA揭示了古代北非血统",
    "chinese_summary": "本文介绍了对来自利比亚Takarkori岩棚的两名7000年前女性个体的古DNA分析，揭示了非洲湿润时期绿色撒哈拉地区的遗传历史。分析表明，这些个体属于一个先前未知的、深度分化的北非谱系，该谱系与走出非洲迁徙大约同时与撒哈拉以南非洲谱系分离。\n\n主要发现包括：\n\n*   **独特的祖源:** Takarkori个体的祖源主要来自这个孤立的北非谱系，不同于撒哈拉以南非洲人和非洲以外的人群。\n*   **与Taforalt的关系:** 他们与来自摩洛哥Taforalt的15000年前的觅食者关系密切，表明在绿色撒哈拉之前就存在一个稳定的北非人口。\n*   **有限的撒哈拉以南基因流动:** 与Taforalt个体不同，Takarkori个体的新尼安德特人血统比黎凡特农民少十倍，但明显多于当代撒哈拉以南基因组。\n*   **畜牧业的文化传播:** 这种独特的遗传谱系的存在表明，畜牧业是通过文化传播而不是来自黎凡特的大规模人类迁徙传播到撒哈拉地区的。\n*   **绿色撒哈拉地区没有遗传交流:** 没有证据表明在非洲湿润时期期间，从撒哈拉以南非洲到北非存在大量的基因流动。\n\n该研究表明，一个独特的北非谱系在相对孤立的环境中存在了很长一段时间，而绿色撒哈拉时期畜牧业的传播主要是一种文化现象。"
  },
  {
    "id": "43914705",
    "title": "CLion Is Now Free for Non-Commercial Use",
    "url": "https://blog.jetbrains.com/clion/2025/05/clion-is-now-free-for-non-commercial-use/",
    "summary": "JetBrains has made CLion, its cross-platform IDE for C and C++, free for non-commercial use. This includes students, Arduino experimenters, hobbyists, and open-source developers who are not earning commercial benefits. This move extends the licensing model already in place for RustRover, Rider, and WebStorm.\n\nThe goal is to make CLion more accessible, lower the barrier to entry for new users, and encourage learning and experimentation with C and C++. The free version is fully featured, with the only limitation being the Code With Me feature (Community version provided).\n\nCommercial use, defined as developing products and earning commercial benefits, still requires a paid subscription. Non-commercial use includes learning, open-source contributions without commercial gain, content creation, and hobby development.\n\nUsers of the free non-commercial license agree to the collection of anonymous usage statistics for product improvement, similar to the Early Access Program. Users cannot opt out of this data collection.\n\nNon-commercial licenses are issued for one year and automatically renew if used at least once in the last six months. Activation is simple, achievable via a prompt upon startup or through the \"Help | Register\" menu in the IDE.\n\nThe article also addresses common questions about licensing, renewals, refunds, and data collection, and highlights recent updates to CLion, including improvements to the CLion Nova language engine, debugger enhancements, and new features for embedded development.\n",
    "chinese_title": "CLion 现在可供非商业用途免费使用",
    "chinese_summary": "JetBrains 宣布其跨平台 C 和 C++ IDE CLion 对非商业用途免费。这包括学生、Arduino 实验者、爱好者以及未获得商业利益的开源开发者。此举扩展了 RustRover、Rider 和 WebStorm 已有的授权模式。\n\n此举旨在提高 CLion 的可访问性，降低新用户的入门门槛，并鼓励 C 和 C++ 的学习和实验。免费版本功能齐全，唯一的限制是 Code With Me 功能（提供社区版本）。\n\n商业用途，定义为开发产品并获得商业利益，仍需要付费订阅。非商业用途包括学习、无商业收益的开源贡献、内容创作和业余爱好开发。\n\n免费非商业许可证的用户同意收集匿名使用统计数据以改进产品，类似于抢先体验计划。用户不能选择退出此数据收集。\n\n非商业许可证有效期为一年，如果在过去六个月内至少使用过一次，则会自动续订。激活很简单，可以通过启动时的提示或 IDE 中的“帮助 | 注册”菜单完成。\n\n文章还解答了关于许可、续订、退款和数据收集的常见问题，并重点介绍了 CLion 的最新更新，包括 CLion Nova 语言引擎的改进、调试器增强功能以及嵌入式开发的新功能。"
  },
  {
    "id": "43912844",
    "title": "Zed: High-performance AI Code Editor",
    "url": "https://zed.dev/blog/fastest-ai-code-editor",
    "summary": "Zed is a new, open-source, high-performance code editor built in Rust, offering integrated AI capabilities.  It distinguishes itself by being open-source and providing a built-in \"Agent Panel\" that allows developers to interact with AI agents directly within the editor to perform tasks like code analysis, modifications, and new code generation.  Users can interact with the agent using natural language prompts.\n\nKey features include:\n\n*   **Agent Panel:** Provides access to AI agents that understand and manipulate codebases.\n*   **Privacy & Security:** Prioritizes user privacy, with no data harvesting for AI training without explicit consent.\n*   **Customization:** Supports a variety of language models (including running custom models via Ollama) and custom tools through the Model Context Protocol (MCP).\n*   **Tool Control:** Fine-grained control over the agent's access to tools like language servers, linters, formatters, and terminal commands. Users can create profiles to manage tool configurations.\n*   **Cost:** Core Zed functionality remains free. AI features are available through user-provided API keys, running local models, a limited free plan (50 prompts/month), or a Pro plan ($20/month for 500 prompts).\n*   **Availability:** Currently stable for macOS and Linux, with a Windows beta planned for later in 2025.\n*   **Review Changes:** AI proposed changes are presented in an editable diff view allowing developers to easily accept, modify, or reject suggestions.\n\nThe article emphasizes Zed's commitment to building a powerful, customizable, and privacy-respecting code editor that integrates AI seamlessly into the development workflow.\n",
    "chinese_title": "Zed：高性能AI代码编辑器",
    "chinese_summary": "Zed：一款集成了AI功能的高性能开源Rust代码编辑器。它以开源和内置的“Agent Panel”（代理面板）为特色，允许开发者直接在编辑器内与AI代理交互，执行代码分析、修改和生成新代码等任务。用户可以使用自然语言提示与代理交互。\n\n主要特性包括：\n\n*   **Agent Panel (代理面板):** 提供访问能够理解和操作代码库的AI代理的途径。\n*   **隐私与安全:** 优先考虑用户隐私，未经明确同意，不会为AI训练收集数据。\n*   **定制化:** 支持各种语言模型（包括通过Ollama运行自定义模型）以及通过模型上下文协议（MCP）进行的自定义工具。\n*   **工具控制:** 对代理访问语言服务器、代码检查器、格式化程序和终端命令等工具进行细粒度控制。用户可以创建配置文件来管理工具配置。\n*   **费用:** Zed 的核心功能保持免费。 AI 功能通过用户提供的 API 密钥、运行本地模型、有限的免费计划（每月 50 个提示）或 Pro 计划（每月 20 美元，500 个提示）提供。\n*   **可用性:** 目前macOS和Linux版本稳定，计划在2025年晚些时候推出Windows beta版。\n*   **审查更改:** AI提出的更改以可编辑的差异视图呈现，允许开发者轻松接受、修改或拒绝建议。\n\n文章强调了 Zed 致力于构建一个强大、可定制且尊重隐私的代码编辑器，并将 AI 无缝集成到开发工作流程中。"
  },
  {
    "id": "43927371",
    "title": "Ontario set to begin construction of Canada's first mini nuclear power plant",
    "url": "https://www.cbc.ca/news/canada/toronto/small-modular-reactor-nuclear-power-ontario-construction-1.7529338",
    "summary": "Ontario is set to begin construction on Canada's first Small Modular Reactor (SMR) at the Darlington power plant, aiming to meet a projected 75% increase in electricity demand by 2050. Premier Doug Ford's government has approved the project, spearheaded by Ontario Power Generation (OPG), which plans to build four SMRs at a total cost of $20.9 billion.\n\nThe first reactor, estimated at $7.7 billion (including $1.6 billion for shared infrastructure), will provide 300 megawatts of power, enough for approximately 300,000 homes, and is expected to be operational by 2030. The chosen technology is GE Hitachi's BWRX-300, making Ontario the first location in the world to construct this model.\n\nOntario's Minister of Energy and Mines, Stephen Lecce, emphasized the importance of reliable and affordable energy for the province's economic sovereignty. The project anticipates significant economic benefits, projecting 3,700 jobs annually and $13 billion in tax revenue over 65 years.  Approximately 80% of project spending is expected to benefit Ontario companies.\n\nOPG will finance the construction through existing cash and debt, with costs recovered from ratepayers. While the government is not directly funding the build, it currently spends billions annually subsidizing electricity rates.  While the analysis suggests the cost of electricity generated by the SMR is comparable to wind/solar power + storage, it would require much more land and transmission investments. Some, like John Bennett of Friends of the Earth Canada, express skepticism about the project's cost projections, citing past nuclear projects' budget overruns.\n",
    "chinese_title": "安大略省将启动加拿大首个迷你核电站的建设。",
    "chinese_summary": "安大略省将开建加拿大首个小型模块化反应堆，预计至2050年电力需求将增长75%。道格·福特省长政府已批准该项目，由安大略发电公司(OPG)牵头，计划建造四个小型模块化反应堆，总成本为209亿美元。\n\n第一个反应堆预计耗资77亿美元（包括共享基础设施的16亿美元），将提供300兆瓦的电力，足够大约30万户家庭使用，预计到2030年投入运营。所选技术为通用电气日立的BWRX-300，使安大略省成为世界上首个建造该型号反应堆的地区。\n\n安大略省能源和矿业部长斯蒂芬·莱切强调了可靠且负担得起的能源对于该省经济主权的重要性。该项目预计将带来显著的经济效益，预计65年内每年创造3700个就业岗位和130亿美元的税收收入。预计约80%的项目支出将使安大略省企业受益。\n\nOPG将通过现有现金和债务为建设提供资金，费用将从电力用户处回收。虽然政府没有直接资助建设，但目前每年花费数十亿美元补贴电价。虽然分析表明小型模块化反应堆产生的电力成本与风能/太阳能+储能相当，但它需要更多的土地和输电投资。像加拿大地球之友的约翰·贝内特等人对该项目的成本预测表示怀疑，并援引过去核项目的预算超支。"
  },
  {
    "id": "43925633",
    "title": "Never film the new Ex90 because you will break your cell camera",
    "url": "https://old.reddit.com/r/Volvo/comments/1ke98nv/never_film_the_new_ex90_because_you_will_break/",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "永远不要拍摄新款Ex90，因为你会弄坏你的手机摄像头。",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "43906528",
    "title": "A new hairlike electrode for long-term, high-quality EEG monitoring",
    "url": "https://www.psu.edu/news/research/story/future-brain-activity-monitoring-may-look-strand-hair",
    "summary": "Researchers at Penn State have developed a novel hairlike electrode for long-term EEG monitoring that offers improved comfort, stability, and signal quality compared to traditional EEG electrodes. The lightweight, flexible electrode, made from 3D-printed hydrogel material, adheres directly to the scalp using a bioadhesive ink, eliminating the need for messy gels and extensive skin preparation.\n\nThis new technology addresses several limitations of conventional EEG monitoring, which can be cumbersome, time-consuming, and prone to signal degradation due to gaps between the electrode and the scalp or shifting of rigid electrodes. The hairlike electrode maintains stable performance for over 24 hours of continuous wear, delivering high-quality recordings without signal degradation.\n\nThe key advantages of the new electrode include improved patient comfort and inconspicuousness, as it mimics the appearance of human hair and can even be printed in different colors to match a person's hair. Furthermore, the elimination of gels and the secure adhesion of the electrode ensure consistent data, even across different monitoring sessions. While currently wired, future research aims to develop a wireless version for greater patient mobility. The researchers believe this technology holds promise for both clinical healthcare applications and consumer health and wellness products.\n",
    "chinese_title": "用于长期高质量脑电监测的新型发丝状电极",
    "chinese_summary": "宾夕法尼亚州立大学的研究人员开发出一种新型毛发状电极，用于长期脑电图监测，与传统脑电图电极相比，该电极具有更高的舒适性、稳定性和信号质量。这种轻便、灵活的电极由3D打印水凝胶材料制成，使用生物粘合墨水直接粘附在头皮上，无需繁琐的凝胶和大量的皮肤准备。\n\n这项新技术解决了传统脑电图监测的几个局限性，传统脑电图监测繁琐、耗时，并且由于电极与头皮之间的间隙或刚性电极的移动而容易导致信号衰减。该毛发状电极可在连续佩戴超过24小时的情况下保持稳定的性能，提供高质量的记录而不会降低信号质量。\n\n这种新型电极的主要优点包括提高了患者的舒适性和隐蔽性，因为它模仿了人头发的外观，甚至可以打印成不同的颜色以匹配人的头发。此外，无需凝胶和电极的牢固粘附确保了数据的一致性，即使在不同的监测会话中也是如此。虽然目前是有线的，但未来的研究旨在开发无线版本，以提高患者的活动性。研究人员认为，这项技术在临床医疗保健应用以及消费者健康和保健产品方面具有潜力。"
  },
  {
    "id": "43903534",
    "title": "NSA spied through Angry Birds, other apps: report (2014)",
    "url": "https://www.nbcnews.com/tech/tech-news/nsa-spied-through-angry-birds-other-apps-report-flna2d12006530",
    "summary": "Documents leaked by Edward Snowden in 2014 revealed that the NSA and Britain's GCHQ were exploiting smartphone apps, including the popular game Angry Birds, to gather personal data on users worldwide. This data included location information, political affiliation, and sexual orientation. Intelligence agencies were able to access this data through apps like Google Maps, Facebook, Flickr, and Flixster.\n\nA 2012 British intelligence report detailed how to extract user information from Angry Birds on Android devices. A slideshow showed that data generated by apps could reveal a phone's settings, connected networks, visited websites, downloaded documents, and user's friends.\n\nThe NSA, while not commenting directly on the reports, stated that it only collects communications authorized by law for foreign intelligence and counterintelligence purposes and that the communications of everyday Americans were not of interest. GCHQ also maintained that its activities were authorized, necessary, and proportionate.\n\nThe report highlighted the ease with which intelligence agencies can turn seemingly innocuous apps into espionage tools. The New York Times briefly published the name of an NSA employee involved in the program, a move criticized as potentially compromising intelligence operations.\n",
    "chinese_title": "美国国家安全局曾通过愤怒的小鸟及其他应用进行间谍活动：报告 (2014)",
    "chinese_summary": "2014年爱德华·斯诺登泄露的文件显示，美国国家安全局（NSA）和英国政府通信总部（GCHQ）利用包括热门游戏《愤怒的小鸟》在内的智能手机应用程序，在全球范围内收集用户个人数据。这些数据包括位置信息、政治倾向和性取向。情报机构能够通过谷歌地图、脸书、Flickr和Flixster等应用程序访问这些数据。\n\n一份2012年的英国情报报告详细描述了如何从安卓设备上的《愤怒的小鸟》中提取用户信息。幻灯片显示，应用程序生成的数据可以揭示手机的设置、连接的网络、访问的网站、下载的文档以及用户的朋友。\n\n美国国家安全局虽然没有直接评论这些报告，但表示它只收集法律授权的用于外国情报和反情报目的的通信，并且普通美国人的通信并不在其关注范围之内。英国政府通信总部也坚称其活动是经过授权的、必要的和成比例的。\n\n该报告凸显了情报机构将看似无害的应用程序转化为间谍工具的容易程度。《纽约时报》曾短暂公布了一名参与该项目的美国国家安全局员工的名字，这一举动被批评为可能损害情报行动。"
  },
  {
    "id": "43914832",
    "title": "Unity’s Open-Source Double Standard: the ban of VLC",
    "url": "https://mfkl.github.io/2024/01/10/unity-double-oss-standards.html",
    "summary": "This article details VideoLabs' experience with Unity's app store, highlighting a perceived double standard in Unity's enforcement of its rules regarding LGPL licensed code. VideoLabs, the team behind VLC, had their VLC for Unity integration assets banned from the Unity Store in 2023, citing the inclusion of LGPL dependencies.\n\nThe core issue is that while Unity banned VideoLabs for including LGPL code (specifically LibVLC), the Unity Editor and runtime *themselves* rely on multiple LGPL libraries. Furthermore, many other assets in the Unity store also include LGPL dependencies like FFmpeg, suggesting inconsistent enforcement.\n\nAfter the ban, VideoLabs has launched its own \"VideoLabs Store\" to continue offering binaries for the VLC for Unity plugin, as well as LibVLC commercial licenses, an ebook, and flexible multimedia consulting packages focused on LibVLC and FFmpeg. This allows existing and new customers to access the plugin outside of the Unity ecosystem. The consulting packages are designed to provide professional support, custom builds, and integration assistance to companies using LibVLC or FFmpeg in their projects. VideoLabs consists of VLC and FFmpeg experts ready to provide custom solutions to clients.\n",
    "chinese_title": "Unity开源双重标准：VLC禁令",
    "chinese_summary": "本文详细介绍了 VideoLabs 在 Unity 应用商店的经历，重点指出 Unity 在执行其有关 LGPL 许可代码规则方面存在双重标准。作为 VLC 背后的团队，VideoLabs 的 VLC for Unity 集成资源于 2023 年被 Unity 商店禁用，理由是包含 LGPL 依赖项。\n\n核心问题在于，虽然 Unity 以包含 LGPL 代码（特别是 LibVLC）为由禁用了 VideoLabs，但 Unity 编辑器和运行时*本身*也依赖于多个 LGPL 库。此外，Unity 商店中的许多其他资源也包含像 FFmpeg 这样的 LGPL 依赖项，这表明执行标准不一致。\n\n被禁用后，VideoLabs 推出了自己的“VideoLabs 商店”，以继续提供 VLC for Unity 插件的二进制文件，以及 LibVLC 商业许可证、电子书和侧重于 LibVLC 和 FFmpeg 的灵活多媒体咨询服务包。这使得现有和新客户能够在 Unity 生态系统之外访问该插件。咨询服务包旨在为在其项目中使用 LibVLC 或 FFmpeg 的公司提供专业支持、定制构建和集成协助。VideoLabs 由 VLC 和 FFmpeg 专家组成，随时准备为客户提供定制解决方案。"
  },
  {
    "id": "43887489",
    "title": "Stringly Typed",
    "url": "https://www.stefanjudis.com/blog/stringly-typed/",
    "summary": "Stefan Judis's article \"Stringly Typed\" explores the concept of using strings where more specific types would be more appropriate, particularly in API calls. He credits Scott Hanselman for coining the term \"stringly typed\" and defines it as passing strings around when better types exist, which is common in API interactions due to JSON's limited type system.\n\nWhile JavaScript's weak typing has historically made this less of an issue, Judis argues that in strongly typed environments like TypeScript, stringly typed APIs can be problematic because the type information gets lost and must be manually reconstructed. He reconsiders API endpoints as remote function calls, highlighting the loss of type safety when receiving generic types like `any` or `unknown` from APIs.\n\nJudis acknowledges the prevalence of stringly typed interfaces in Single Page Applications (SPAs) and expresses a desire for end-to-end type safety over the network. He notes that solutions like tRPC and GraphQL exist to address this problem, hinting at exploring type safety over the wire. He wonders if his newfound awareness of \"stringly typed\" interfaces will lead him to discover and critique them more frequently.\n",
    "chinese_title": "强类型化",
    "chinese_summary": "Stefan Judis 的文章《字符串类型化》探讨了在 API 调用等场景中使用字符串代替更具体类型的情况。他认为 Scott Hanselman 创造了“字符串类型化”这个术语，并将其定义为在存在更好类型时传递字符串，这在 API 交互中很常见，原因是 JSON 的类型系统有限。\n\n尽管 JavaScript 的弱类型化历史使得这个问题不那么突出，但 Judis 认为，在 TypeScript 等强类型环境中，字符串类型化的 API 可能会出现问题，因为类型信息会丢失，并且必须手动重建。他将 API 端点重新视为远程函数调用，强调了从 API 接收诸如 `any` 或 `unknown` 等通用类型时类型安全性的丧失。\n\nJudis 承认字符串类型化接口在单页应用程序 (SPA) 中的普遍存在，并表达了对网络端到端类型安全性的渴望。他指出，像 tRPC 和 GraphQL 这样的解决方案可以解决这个问题，暗示将探索网络上的类型安全性。他想知道他对“字符串类型化”接口的新认识是否会让他更频繁地发现和批评它们。"
  },
  {
    "id": "43920555",
    "title": "OpenAI for Countries",
    "url": "https://openai.com/global-affairs/openai-for-countries/",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "OpenAI 国家版",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "43913751",
    "title": "So Much Blood",
    "url": "https://dynomight.net/blood/",
    "summary": "This article, titled \"So Much Blood,\" investigates the accuracy of a claim made by The Economist that blood products account for 1.8% of U.S. goods exports. The author meticulously analyzes U.S. trade statistics using the detailed Harmonized Tariff Schedule (HTS) codes.\n\nThe author breaks down the HTS code for \"Human blood; animal blood prepared for therapeutic, prophylactic or diagnostic uses...\" into various subcategories, meticulously categorizing them into those that definitely contain human blood, those that almost never contain human blood, and those that might contain human blood.\n\nThrough this process, the author determines that goods exports that almost certainly use blood account for approximately 0.5298% of total U.S. goods exports. The author then estimates, based on industry knowledge, the percentage of products in the \"maybe blood\" category that actually use human blood, concluding an additional 0.1569% of exports include blood.\n\nTherefore, the author argues that the more accurate figure is roughly 0.6867% of U.S. goods exports involving human blood, significantly lower than the 1.8% figure cited by The Economist. The author acknowledges the rough estimations involved but aims to provide a more detailed and transparent analysis of the data, encouraging further scrutiny and correction.\n",
    "chinese_title": "血流成河",
    "chinese_summary": "本文题为《多少鲜血》，调查了《经济学人》杂志提出的“血液制品占美国商品出口额的1.8%”这一论断的准确性。作者使用详细的协调关税制度（HTS）编码，对美国贸易统计数据进行了细致的分析。\n\n作者将“人血；供治疗、预防或诊断用的动物血制品……”的HTS编码分解为各种子类别，并细致地将它们归类为：肯定含有人血的、几乎不含有人血的以及可能含有人血的。\n\n通过这一过程，作者确定几乎肯定使用血液的商品出口额约占美国商品出口总额的0.5298%。然后，作者根据行业知识，估算“可能含血”类别中实际使用人血的产品的百分比，得出结论，另有0.1569%的出口产品包含血液。\n\n因此，作者认为，更准确的数字约为美国商品出口额中涉及人血的0.6867%，远低于《经济学人》引用的1.8%。作者承认其中涉及粗略估算，但旨在提供更详细、更透明的数据分析，鼓励进一步的审查和修正。"
  },
  {
    "id": "43904478",
    "title": "Cuttlefish 'talk' with their arms, study reveals",
    "url": "https://scienceblog.com/wildscience/2025/05/06/cuttlefish-talk-with-their-arms-study-reveals/",
    "summary": "This article details a new discovery about cuttlefish communication: they use specific arm movements, dubbed \"arm wave signs,\" to communicate with each other in a multi-sensory way. Researchers identified four distinct gestures: \"up,\" \"side,\" \"roll,\" and \"crown,\" each involving different arm positions, undulations, and often color changes.\n\nThe study found that cuttlefish respond more readily to upright videos of these arm wave signs, indicating a sophisticated understanding of socially relevant displays.  Crucially, the research suggests that these signals are not just visual; cuttlefish also perceive them through vibrations in the water, potentially utilizing their lateral line and statocysts to detect the mechanical waves produced by the arm movements. Playback experiments demonstrated that cuttlefish respond more to original recordings than scrambled or reversed versions.\n\nThis dual-channel (visual and vibrational) communication system highlights evolutionary parallels between cephalopods and vertebrates, suggesting that sensory systems for detecting water movement may have evolved to serve communication functions similarly to vertebrate hearing. While the exact meaning of each arm sign remains unknown and likely context-dependent (mating, hunting, defense), this discovery expands our understanding of marine invertebrate communication and emphasizes the intelligence of cephalopods. The research team hopes this work can provide insights into cross-species communication and environmental interaction.\n",
    "chinese_title": "研究显示，乌贼用触手“交谈”",
    "chinese_summary": "本文详细介绍了一项关于乌贼交流的新发现：它们使用特定的手臂动作（被称为“手臂挥舞信号”）以多感官方式相互交流。研究人员识别出四种不同的手势：“向上”、“侧向”、“翻滚”和“加冕”，每种手势都涉及不同的手臂姿势、波动，并且通常伴有颜色变化。\n\n研究发现，乌贼更容易对这些手臂挥舞信号的垂直视频做出反应，表明它们对与社会相关的展示具有复杂的理解。至关重要的是，研究表明这些信号不仅仅是视觉上的；乌贼还可以通过水中的振动感知到它们，可能利用它们的侧线和平衡囊来检测手臂运动产生的机械波。回放实验表明，乌贼对原始录音的反应比对打乱或倒放的版本更强烈。\n\n这种双通道（视觉和振动）通信系统突出了头足类动物和脊椎动物之间的进化相似性，表明用于检测水运动的感觉系统可能已经进化为与脊椎动物听觉类似地服务于通信功能。虽然每个手臂信号的确切含义仍然未知，并且可能依赖于具体环境（交配、狩猎、防御），但这一发现扩展了我们对海洋无脊椎动物通信的理解，并强调了头足类动物的智能。研究团队希望这项工作能够为跨物种交流和环境互动提供见解。"
  },
  {
    "id": "43892832",
    "title": "Show HN: Ductape – Build back end integrations once, reuse them anywhere",
    "url": "https://www.ductape.app",
    "summary": "Ductape is presented as a full-service API marketplace and platform designed to streamline backend development and integration. It allows developers to build and reuse backend components across different environments, leading to faster development cycles and improved resilience.\n\nKey benefits of using Ductape include:\n\n*   **Rapid Integration:** Facilitates quick integration with third-party APIs and services, reducing implementation time from weeks to hours.\n*   **Simplified Development:** Enables the creation of reusable components for APIs, databases, notifications, and cloud functions.\n*   **Enhanced Resilience:** Offers automatic retries, failovers, and provider switching to handle downtime.\n*   **Full Visibility:** Provides comprehensive monitoring across all environments to identify and resolve issues quickly.\n*   **Event-Driven Features:** Supports the creation and monitoring of robust event workflows with built-in error handling.\n*   **Background Jobs & Functions:** Enables the creation of scalable and fault-tolerant jobs and serverless functions.\n*   **Unified Communication:** Simplifies email and notification management across services.\n\nIn essence, Ductape aims to accelerate time-to-market by providing a unified platform for managing APIs, events, and jobs, with a focus on reusability, resilience, and observability. A testimonial highlights the significant reduction in development time using Ductape.\n",
    "chinese_title": "Show HN: Ductape – 一次构建后端集成，随处复用",
    "chinese_summary": "Ductape是一个全方位API市场和平台，旨在简化后端开发和集成。它允许开发者在不同环境中构建和复用后端组件，从而加快开发周期并提高弹性。\n\n使用Ductape的主要优势包括：\n\n*   **快速集成：** 促进与第三方API和服务快速集成，将实施时间从数周缩短至数小时。\n*   **简化开发：** 能够创建可重用的API、数据库、通知和云函数组件。\n*   **增强弹性：** 提供自动重试、故障转移和供应商切换以应对停机。\n*   **完全可见性：** 提供跨所有环境的全面监控，以快速识别和解决问题。\n*   **事件驱动特性：** 支持创建和监控具有内置错误处理功能的强大事件工作流。\n*   **后台作业与函数：** 支持创建可扩展且容错的作业和无服务器函数。\n*   **统一通信：** 简化跨服务的电子邮件和通知管理。\n\n本质上，Ductape旨在通过提供一个用于管理API、事件和作业的统一平台来加速上市时间，其重点是可重用性、弹性和可观察性。一份客户评价强调了使用Ductape后开发时间的显著缩短。"
  },
  {
    "id": "43914235",
    "title": "My quest to make motorcycle riding that tad bit safer",
    "url": "https://gill.net.in/posts/my-quest-to-make-motorcycle-riding-safer/",
    "summary": "This article chronicles the author's journey to develop BrakeBright, a smart brake-light system designed to enhance motorcycle safety. Driven by a re-ignited passion for riding and a concern about rear-end collisions due to strong engine braking, the author sought to create a solution beyond relying solely on rider habit.\n\nBrakeBright intelligently detects deceleration caused by engine braking and activates the brake lights, alerting trailing drivers. It also flashes the brake lights proportionately to braking intensity during hard stops. Dissatisfied with existing products that relied on basic tilt switches, the author aimed to democratize adaptive brake light technology, previously reserved for high-end vehicles.\n\nThe development process involved numerous prototypes, extensive testing (initially using a friend's bike and later the author's own), and continuous refinement. Challenges included vibration interference, sensor accuracy, and the need for user-friendly firmware updates. The author even installed an LED on the front of his motorcycle to visually monitor BrakeBright's actions.\n\nTesting culminated in a rigorous trip along Scotland's NC500 route. The final product is waterproof, vibration-resistant, and easily installed. The author is now finalizing software utilities to allow riders to personalize and update BrakeBright. The arrival of the first production batch was a profoundly rewarding moment, validating the author's dedication and vision. He encourages readers to support his journey by purchasing a BrakeBright unit and provides contact information for feedback and discussion. The goal is to make motorcycling safer and more enjoyable for everyone.\n",
    "chinese_title": "我让摩托车骑行更安全一点点的探索",
    "chinese_summary": "本文记录了作者开发 BrakeBright 的历程，BrakeBright 是一种旨在提高摩托车安全性的智能刹车灯系统。 由于对骑行的热情重燃以及对强发动机制动导致追尾事故的担忧，作者试图创造一种超越仅仅依赖骑手习惯的解决方案。\n\nBrakeBright 能够智能检测出发动机制动引起的减速并激活刹车灯，从而提醒后方车辆。 在紧急制动期间，它还会根据制动强度成比例地闪烁刹车灯。 由于对依赖基本倾斜开关的现有产品不满意，作者旨在普及自适应刹车灯技术，该技术以前仅限于高端车辆。\n\n开发过程涉及大量的原型设计、广泛的测试（最初使用朋友的自行车，后来使用作者自己的自行车）以及持续的改进。 挑战包括振动干扰、传感器精度以及对用户友好的固件更新的需求。 作者甚至在他的摩托车前部安装了一个 LED，以可视化地监控 BrakeBright 的动作。\n\n测试最终在苏格兰 NC500 公路上进行了一次严格的旅行。 最终产品具有防水、抗振和易于安装的特点。 作者现在正在完成软件实用程序，以允许骑手个性化和更新 BrakeBright。 第一批产品的到来是一个非常有意义的时刻，验证了作者的奉献精神和愿景。 他鼓励读者购买 BrakeBright 产品以支持他的旅程，并提供联系方式以供反馈和讨论。 目标是使摩托车骑行对每个人来说都更安全、更愉快。"
  },
  {
    "id": "43891147",
    "title": "Wikidive – AI guided rabbitholes in Wikipedia",
    "url": "https://wikidive.tulv.in/",
    "summary": "Wikidive is presented as an AI-guided tool for exploring Wikipedia in a \"rabbithole\" fashion, suggesting it's designed to encourage deep and branching research. The website or application seems to be experiencing connection issues, as indicated by messages like \"We can't find the internet,\" \"Attempting to reconnect,\" and \"Something went wrong!\".\n\nDespite the connection problems, the core functionality is revealed through a list of topics. Wikidive appears to categorize Wikipedia content into broad subjects like:\n\n*   **Academic Disciplines:** Cognition, Philosophy, Computer Science, Metaphysics, Epistemology, Science, Mathematics, Politics, Economics, History, Psychology, Sociology, Linguistics, Anthropology, Biology, Physics, Chemistry, Astronomy, Geology.\n*   **Arts and Culture:** Literature, Music, Film, Art, Semiotics, Fashion, Food.\n*   **Technology and the Environment:** Technology, Culture, Nature, Religion, Geography, Engineering, Architecture, Design.\n\nThe listed categories suggest that Wikidive helps users navigate Wikipedia by providing AI-driven pathways to explore specific subject areas and related concepts. The \"What is this?\" link implies a section with further explanation or instructions about how to use Wikidive. Overall, it's a platform designed to make exploring Wikipedia content in a more focused and guided manner.\n",
    "chinese_title": "维基深潜 - 维基百科中的AI引导探索",
    "chinese_summary": "Wikidive是一款人工智能引导的工具，旨在以“兔子洞”的方式探索维基百科，鼓励深入和分支研究。该网站或应用程序似乎遇到了连接问题，提示信息如“无法找到互联网”、“尝试重新连接”和“发生错误！”。\n\n尽管存在连接问题，但其核心功能通过一系列主题得以体现。Wikidive似乎将维基百科的内容划分为以下广泛的类别：\n\n*   **学术学科：** 认知、哲学、计算机科学、形而上学、认识论、科学、数学、政治、经济学、历史、心理学、社会学、语言学、人类学、生物学、物理学、化学、天文学、地质学。\n*   **艺术与文化：** 文学、音乐、电影、艺术、符号学、时尚、食物。\n*   **科技与环境：** 科技、文化、自然、宗教、地理、工程、建筑、设计。\n\n这些类别表明，Wikidive通过提供人工智能驱动的路径，帮助用户浏览维基百科，探索特定学科领域和相关概念。“这是什么？”链接暗示着一个包含关于如何使用Wikidive的进一步解释或说明的部分。总而言之，这是一个旨在以更专注和引导的方式探索维基百科内容的平台。"
  },
  {
    "id": "43917376",
    "title": "Telling Lies: Bowie and Online Music Distribution in 1996",
    "url": "https://cybercultural.com/p/online-music-distribution-1996/",
    "summary": "In September 1996, David Bowie released his single \"Telling Lies\" as a free download on his website, marking an early experiment in online music distribution. This initiative, driven by Bowie's digital partner N2K and influenced by Virgin Records, aimed to cut out record label middlemen by directly distributing music electronically.\n\nWhile online music retail existed at the time via sites like Music Boulevard and CDnow, downloading and streaming faced challenges due to low bandwidth. Users could stream \"Telling Lies\" in low quality via RealAudio or Shockwave, or download larger, higher-quality files using Liquid Audio, a new technology designed to protect copyright. The Liquid Audio download was a 9.7MB zip file and the user then needed Liquid Audio player software to play the song. The process was slow and cumbersome, often resulting in incomplete or poor-quality audio.\n\nDespite technical difficulties, the \"Telling Lies\" release was a marketing success, with N2K reporting hundreds of thousands of downloads in the first week. Bowie participated in an online chat on CompuServe to promote the release.\n\nWhile acknowledging the \"crappy quality\" of streaming and slow download speeds, Bowie viewed the experiment positively, recognizing the potential for exciting developments in online music. N2K's CEO, Larry Rosen, envisioned this as the beginning of a shift towards artists financing and distributing their own music, bypassing traditional record labels. Although e-commerce for digital downloads was not yet in place, N2K planned to implement it in the near future.\n",
    "chinese_title": "谎言：1996年鲍威与在线音乐发行",
    "chinese_summary": "1996年9月，大卫·鲍伊在他的网站上免费发布了单曲《Telling Lies》，标志着在线音乐发行的一次早期尝试。这项由鲍伊的数字合作伙伴N2K推动，并受维珍唱片影响的举措，旨在通过直接以电子方式发行音乐来绕过唱片公司中间商。\n\n虽然当时已存在Music Boulevard和CDnow等在线音乐零售网站，但由于带宽较低，下载和流媒体面临挑战。用户可以通过RealAudio或Shockwave以低质量流媒体播放《Telling Lies》，或使用Liquid Audio（一种旨在保护版权的新技术）下载更大的、更高质量的文件。 Liquid Audio下载是一个9.7MB的zip文件，用户需要Liquid Audio播放器软件才能播放该歌曲。这个过程缓慢而繁琐，常常导致音频不完整或质量差。\n\n尽管存在技术困难，《Telling Lies》的发布在营销上取得了成功，N2K报告称第一周下载量达数十万次。鲍伊参与了CompuServe上的在线聊天，以宣传该发布。\n\n尽管鲍伊承认流媒体的“质量差”和下载速度慢，但他积极看待这次实验，认识到在线音乐令人兴奋的发展潜力。 N2K的首席执行官拉里·罗森设想这标志着艺术家资助和发行自己的音乐，绕过传统唱片公司的转变的开始。虽然数字下载的电子商务尚未到位，但N2K计划在不久的将来实施它。"
  },
  {
    "id": "43922975",
    "title": "Gmail will soon stop support for the 3DES encryption cipher for incoming SMTP",
    "url": "https://workspaceupdates.googleblog.com/2025/05/update-for-gmail-support-for-the-3des-encryption-cipher-for-incoming-smtp-connections.html",
    "summary": "Gmail will stop supporting the 3DES encryption cipher for incoming SMTP connections starting May 30, 2025. This change aims to improve security by phasing out outdated encryption methods. After this date, email systems relying on 3DES will be unable to deliver emails to Gmail accounts.\n\nAdministrators and users receiving warnings regarding 3DES usage should ensure their email sending systems are configured to use more modern and secure TLS ciphers. Google provides a list of supported ciphers in their Help Center. Admins who recently sent emails using 3DES have also received email notifications. This change affects all Google Workspace customers. Users can consult the Google Workspace Admin Help for more information on supported ciphers for Gmail SMTP TLS connections and how to check for 3DES usage in their email traffic.\n",
    "chinese_title": "Gmail即将停止支持传入SMTP的3DES加密算法。",
    "chinese_summary": "Gmail 将于 2025 年 5 月 30 日起停止支持传入 SMTP 连接的 3DES 加密算法。此更改旨在通过淘汰过时的加密方法来提高安全性。在此日期之后，依赖 3DES 的电子邮件系统将无法向 Gmail 帐户传递电子邮件。\n\n收到有关 3DES 使用警告的管理员和用户应确保其电子邮件发送系统配置为使用更现代和安全的 TLS 密码。Google 在其帮助中心提供支持的密码列表。最近使用 3DES 发送电子邮件的管理员也收到了电子邮件通知。此更改影响所有 Google Workspace 客户。用户可以查阅 Google Workspace 管理员帮助，了解有关 Gmail SMTP TLS 连接支持的密码以及如何检查其电子邮件流量中 3DES 使用情况的更多信息。"
  },
  {
    "id": "43921681",
    "title": "Parametric Modeling with Grasshopper",
    "url": "https://baharmon.github.io/basics",
    "summary": "This article is an introduction to parametric modeling using Grasshopper, a visual programming interface for Rhino. It covers the basics of creating geometry such as points, lines, polylines, curves, and surfaces through algorithmic diagrams.\n\nThe article starts by explaining the concept of visual programming, emphasizing how Grasshopper uses diagrams connecting data to functions for generating complex forms and design alternatives. It highlights key resources for learning Grasshopper, including online primers and tutorials.\n\nThe tutorial then details how to create fundamental geometric elements:\n\n*   **Points:** Defined by x, y, and z coordinates, either constructed using the \"Construct Point\" component with number sliders or text panels, or referenced from points drawn in Rhino.\n*   **Lines:** Defined by start and end points, a start point with direction and length (\"Line SDL\" component), or referenced from lines drawn in Rhino.\n*   **Polylines:** Created by connecting a sequence of points using the \"Polyline\" component. They can be closed to form polygons.\n*   **Curves:** NURBS curves interpolated through control points using the \"Interpolate\" component. Points can be derived from various sources, including sine waves.\n*   **Surfaces:** NURBS surfaces interpolated through a 2D grid of control points. Surfaces can be created from primitive shapes, planar curves (\"Boundary Surfaces\"), or by lofting (\"Loft\") and ruling (\"Ruled Surface\") multiple curves.\n\nThe article concludes by mentioning extrusion as a method to create solids and hinting at a subsequent tutorial focusing on applying these concepts to furniture design.\n",
    "chinese_title": "使用Grasshopper的参数化建模",
    "chinese_summary": "本文介绍了使用 Grasshopper 进行参数化建模，Grasshopper 是 Rhino 的一个可视化编程界面。 它涵盖了通过算法图创建几何体的基础知识，例如点、线、折线、曲线和曲面。\n\n文章首先解释了可视化编程的概念，强调 Grasshopper 如何使用将数据连接到函数的图表来生成复杂的形状和设计方案。 它重点介绍了学习 Grasshopper 的关键资源，包括在线入门教程和教程。\n\n教程随后详细介绍了如何创建基本的几何元素：\n\n*   **点：** 由 x、y 和 z 坐标定义，可以使用带有数字滑块或文本面板的“Construct Point”组件构建，或从 Rhino 中绘制的点引用。\n*   **线：** 由起点和终点定义，由具有方向和长度的起点（“Line SDL”组件）定义，或从 Rhino 中绘制的线引用。\n*   **折线：** 使用“Polyline”组件连接一系列点创建。 它们可以闭合以形成多边形。\n*   **曲线：** 使用“Interpolate”组件通过控制点插值的 NURBS 曲线。 点可以从各种来源导出，包括正弦波。\n*   **曲面：** 通过二维控制点网格插值的 NURBS 曲面。 曲面可以从原始形状、平面曲线（“Boundary Surfaces”）创建，或者通过放样（“Loft”）和直纹（“Ruled Surface”）多个曲线创建。\n\n文章最后提到了拉伸作为创建实体的方法，并暗示了后续教程将重点介绍将这些概念应用于家具设计。"
  },
  {
    "id": "43884245",
    "title": "Polycompiler: Merge Python and JavaScript code into one file that runs in both",
    "url": "https://github.com/EvanZhouDev/polycompiler",
    "summary": "Polycompiler is an experimental tool that merges Python and JavaScript code into a single file that executes differently depending on the interpreter used. When run with Node.js, the JavaScript code is executed, and when run with Python, the Python code is executed.\n\nThe basic principle involves using JavaScript comments and labeled statements, along with Python's `exec` and JavaScript's `eval` functions. Python interprets the JavaScript line as a lambda function containing an eval statement, but only executes the Python code within the comment on line 1. JavaScript, on the other hand, treats the Python line as an integer (1) due to the comment, and then uses the label `lambda:` to ignore the beginning of the Python statement, allowing the `eval` to execute the JavaScript code.\n\nTo use Polycompiler, install it via `npm i polycompiler` and then run it with `polycompiler in.js in.py out.py.js`, specifying the input JS file, input Python file, and desired output file name (which must end in .js due to Node.js requirements).\n\nThe author created Polycompiler \"for fun\" and suggests it could be a solution for targeting both Python and JS users with a single file, even if one language isn't installed. The article explains the workings of the polyglot file and encourages readers to watch the author's YouTube video for more insight into the development process.\n",
    "chinese_title": "Polycompiler：将Python和JavaScript代码合并成一个可在两者中运行的文件",
    "chinese_summary": "Polycompiler：一个将 Python 和 JavaScript 代码合并到单个文件中的实验性工具，该文件根据所用解释器执行不同的代码。使用 Node.js 运行时，执行 JavaScript 代码；使用 Python 运行时，执行 Python 代码。\n\n其基本原理是利用 JavaScript 注释和带标签的语句，以及 Python 的 `exec` 和 JavaScript 的 `eval` 函数。Python 将 JavaScript 行解释为包含 eval 语句的 lambda 函数，但仅执行第 1 行注释中的 Python 代码。另一方面，由于注释，JavaScript 将 Python 行视为整数 (1)，然后使用标签 `lambda:` 忽略 Python 语句的开头，从而允许 `eval` 执行 JavaScript 代码。\n\n要使用 Polycompiler，通过 `npm i polycompiler` 安装它，然后使用 `polycompiler in.js in.py out.py.js` 运行它，指定输入的 JS 文件、输入的 Python 文件和所需的输出文件名（由于 Node.js 的要求，必须以 .js 结尾）。\n\n作者创建 Polycompiler “纯属娱乐”，并认为它可以作为一种解决方案，用单个文件同时面向 Python 和 JS 用户，即使没有安装其中一种语言。本文解释了这种多语言文件的运作方式，并鼓励读者观看作者的 YouTube 视频，以更深入地了解开发过程。"
  },
  {
    "id": "43893127",
    "title": "Hyper-Typing",
    "url": "https://pscanf.com/s/341/",
    "summary": "This article discusses the trade-off between strictness and usability in TypeScript's type system, introducing the concept of \"hyper-typing.\" Hyper-typing occurs when libraries strive for perfect type safety by creating overly complex types, leading to issues like difficult-to-understand definitions, cryptic error messages, and ultimately, unsafe workarounds like casting to `any`.\n\nThe author uses TanStack Form as an example, highlighting its impressive type-safety features but also criticizing the extreme complexity of its type definitions, exemplified by the `FieldMeta` type with its 17 generic parameters.\n\nThe article argues that while strict types are desirable, excessively complex types can hinder developer experience, making the code harder to understand and maintain. The author advocates for simpler types, even if they are less accurate, as they often lead to a more practical and enjoyable workflow.\n\nFinally, the article proposes an alternative approach: generating types from schema definitions. This is exemplified by Astro's framework, where this approach provides a more enjoyable and maintainable development experience.\n",
    "chinese_title": "超速打字",
    "chinese_summary": "本文探讨了 TypeScript 类型系统中严格性和可用性之间的权衡，并引入了“过度类型化”的概念。过度类型化是指库为了追求完美的类型安全而创建过于复杂的类型，导致难以理解的定义、晦涩的错误信息，以及最终导致不安全的变通方法，例如强制转换为 `any`。\n\n作者以 TanStack Form 为例，强调了其令人印象深刻的类型安全特性，但也批评了其类型定义的极端复杂性，例如具有 17 个泛型参数的 `FieldMeta` 类型。\n\n文章认为，虽然严格的类型是可取的，但过于复杂的类型会阻碍开发人员的体验，使代码更难理解和维护。作者提倡使用更简单的类型，即使它们不太准确，因为它们通常会带来更实用和令人愉快的工作流程。\n\n最后，文章提出了一种替代方法：从模式定义生成类型。Astro 框架就是一个例子，这种方法提供了更令人愉快和可维护的开发体验。"
  },
  {
    "id": "43921813",
    "title": "Human-Like Episodic Memory for Infinite Context LLMs",
    "url": "https://arxiv.org/abs/2407.09450",
    "summary": "This arXiv article introduces EM-LLM, a novel approach designed to improve Large Language Models' (LLMs) ability to handle and maintain coherence over extensive contexts, effectively giving them \"infinite context\" capabilities. Inspired by human episodic memory, EM-LLM addresses the limitations of current LLMs in processing long sequences and maintaining accuracy.\n\nEM-LLM works by organizing token sequences into coherent \"episodic events\" using Bayesian surprise and graph-theoretic boundary refinement. This segmentation occurs online. When information is needed, EM-LLM utilizes a two-stage retrieval process that combines similarity-based and temporally contiguous retrieval, mimicking human-like access to relevant information. This allows for efficient retrieval from very long contexts.\n\nThe authors demonstrate that EM-LLM, even without fine-tuning, outperforms state-of-the-art retrieval models like InfLLM on benchmarks like LongBench and InfiniteBench, while working with various baseline LLMs. It also surpasses traditional Retrieval-Augmented Generation (RAG) systems using similar resources. Remarkably, EM-LLM even exceeds the performance of full-context models in many tasks and handles retrieval across 10 million tokens – a scale computationally challenging for full-context models.\n\nFurthermore, the study reveals a correlation between EM-LLM's event segmentation and human-perceived events, suggesting a link to biological memory mechanisms and offering a framework for further research into human memory. The key benefit of EM-LLM is its ability to handle practically infinite context lengths with computational efficiency and improved performance in long-context tasks.\n",
    "chinese_title": "无限上下文LLM的人类式情景记忆",
    "chinese_summary": "这篇arXiv文章介绍了EM-LLM，一种旨在提升大型语言模型（LLMs）处理和保持长程上下文连贯性的新型方法，有效赋予它们“无限上下文”能力。受人类情景记忆启发，EM-LLM解决了当前LLMs在处理长序列和保持准确性方面的局限性。\n\nEM-LLM的工作原理是使用贝叶斯惊奇度和图论边界细化，将token序列组织成连贯的“情景事件”。这种分割是实时进行的。当需要信息时，EM-LLM利用一个两阶段检索过程，结合基于相似性的检索和时间上连续的检索，模仿人类访问相关信息的方式。这允许从非常长的上下文中进行高效检索。\n\n作者证明，即使没有经过微调，EM-LLM在LongBench和InfiniteBench等基准测试中也优于最先进的检索模型（如InfLLM），并且可以与各种基线LLM协同工作。它还超越了使用类似资源的传统检索增强生成（RAG）系统。值得注意的是，EM-LLM在许多任务中甚至超过了全上下文模型的性能，并且可以处理跨越1000万token的检索——这对于全上下文模型来说是一个计算上具有挑战性的规模。\n\n此外，该研究揭示了EM-LLM的事件分割与人类感知到的事件之间的相关性，表明它与生物记忆机制之间存在联系，并为进一步研究人类记忆提供了一个框架。EM-LLM的关键优势在于其能够以计算效率处理实际上无限的上下文长度，并在长上下文任务中提高性能。"
  },
  {
    "id": "43890118",
    "title": "Bell's 1881 Metal detector",
    "url": "http://www.scitechantiques.com/belldiscovery/",
    "summary": "This article details Alexander Graham Bell's 1881 attempt to locate an assassin's bullet in President Garfield using early metal detectors. The article focuses on props created for a Discovery Channel program, \"Forensics in the White House,\" which re-examined Bell's efforts.\n\nIt highlights two main metal detector designs Bell used. The first utilized a four-coil bridge method, with a primary and secondary coil setup for scanning, balanced against another set of coils. This design had limited range (an inch or two). The article describes Bell's struggles with this design in the White House, including wiring errors and interference from the rheotome (buzzer).\n\nThe second design, based on Bell's telephone work, employed two large coils (primary and secondary). This design proved more sensitive. It describes how Bell and his assistant rushed to build this new detector and tested it on the president, placing equipment in another room to reduce noise. However, despite Bell's efforts, he could not definitively locate the bullet, and Garfield later died of infection.\n\nThe article also offers details about the circuits used in both detector designs, and includes behind-the-scenes photos of the Discovery Channel program being filmed, showing actors and props recreating Bell's laboratory. Finally, it advertises the sale of the scientific instrument props used in the Discovery Channel program.\n",
    "chinese_title": "贝尔1881年金属探测器",
    "chinese_summary": "本文详述了亚历山大·格拉汉姆·贝尔于1881年使用早期金属探测器寻找刺杀加菲尔德总统的子弹的尝试。文章重点介绍了为探索频道节目“白宫法医”制作的道具，该节目重新审视了贝尔的努力。\n\n文章着重介绍了贝尔使用的两种主要金属探测器设计。第一种采用了四线圈桥式方法，使用初级和次级线圈设置进行扫描，与另一组线圈平衡。这种设计的范围有限（一两英寸）。文章描述了贝尔在白宫使用该设计的困境，包括接线错误和来自断续器（蜂鸣器）的干扰。\n\n第二种设计基于贝尔的电话工作，采用了两个大型线圈（初级和次级）。这种设计更灵敏。文章描述了贝尔和他的助手如何匆忙制造这种新型探测器，并在总统身上进行了测试，将设备放置在另一个房间以减少噪音。然而，尽管贝尔做出了努力，但他仍然无法明确地确定子弹的位置，加菲尔德后来死于感染。\n\n文章还提供了有关两种探测器设计中使用的电路的详细信息，并包括探索频道节目拍摄幕后的照片，展示了演员和道具再现贝尔的实验室。最后，它宣传了探索频道节目中使用的科学仪器道具的销售。"
  },
  {
    "id": "43906018",
    "title": "Gemini 2.5 Pro Preview",
    "url": "https://developers.googleblog.com/en/gemini-2-5-pro-io-improved-coding-performance/",
    "summary": "Here's a concise summary of the Gemini 2.5 Pro Preview article:\n\nGoogle has released an updated version of Gemini 2.5 Pro, dubbed the I/O edition, ahead of Google I/O. This new version boasts significantly improved coding capabilities, especially in front-end and UI development. It also enhances fundamental coding tasks such as code transformation, editing, and the creation of agentic workflows.\n\nAccording to Replit, Gemini 2.5 Pro offers the best \"capability over latency\" ratio. Cognition highlights its ability to handle complex code refactoring tasks akin to a senior developer. The model ranks #1 on the WebDev Arena leaderboard for building aesthetically pleasing and functional web apps, powering innovative code agents in Cursor and collaborations with Cognition and Replit.\n\nGemini 2.5 Pro's video understanding has improved, reaching 84.8% on the VideoMME benchmark. This allows new applications, such as generating interactive learning apps from YouTube videos, as demonstrated in Google AI Studio. The model excels in easier feature development, allowing developers to quickly replicate UI styles and generate code for new features within an IDE. The article also showcased a dictation starter app as an example of its capacity for aesthetic web development.\n\nDevelopers can access Gemini 2.5 Pro via the Gemini API in Google AI Studio, while enterprise customers can utilize it on Vertex AI. Existing Gemini 2.5 Pro users will automatically benefit from the updated model without needing to make any changes. Google has also updated the model card with the new version of 2.5 Pro.\n",
    "chinese_title": "Gemini 2.5 Pro 预览",
    "chinese_summary": "以下是Gemini 2.5 Pro预览版文章的简要总结：\n\n谷歌在Google I/O大会之前发布了更新版的Gemini 2.5 Pro，称为I/O版。新版本显著提升了编码能力，尤其是在前端和UI开发方面。它还增强了代码转换、编辑和创建代理工作流等基本编码任务。\n\n据Replit称，Gemini 2.5 Pro提供了最佳的“能力/延迟”比率。Cognition强调了其处理复杂代码重构任务的能力，堪比高级开发人员。该模型在WebDev Arena排行榜上排名第一，可以构建美观且功能齐全的Web应用程序，为Cursor中的创新代码代理以及与Cognition和Replit的协作提供支持。\n\nGemini 2.5 Pro的视频理解能力有所提高，在VideoMME基准测试中达到84.8%。这使得新的应用成为可能，例如从YouTube视频生成交互式学习应用程序，正如在Google AI Studio中演示的那样。该模型擅长更轻松的特性开发，允许开发人员在IDE中快速复制UI样式并为新特性生成代码。文章还展示了一个听写入门应用程序，作为其美学Web开发能力的示例。\n\n开发人员可以通过Google AI Studio中的Gemini API访问Gemini 2.5 Pro，而企业客户可以在Vertex AI上使用它。现有的Gemini 2.5 Pro用户将自动受益于更新后的模型，无需进行任何更改。谷歌还更新了带有新版2.5 Pro的模型卡。"
  },
  {
    "id": "43920544",
    "title": "'I paid for the whole GPU, I am going to use the whole GPU'",
    "url": "https://modal.com/blog/gpu-utilization-guide",
    "summary": "This article by Charles Frye dives into the multifaceted concept of \"GPU utilization,\" breaking it down into three distinct categories: GPU Allocation Utilization, GPU Kernel Utilization, and Model FLOP/s Utilization (MFU).\n\n**GPU Allocation Utilization** measures the fraction of GPU-seconds that are actively running application code versus the total GPU-seconds paid for. It's influenced by economic factors (like contract commitments) and DevOps limits (like slow spin-up times). Modal aims to improve this by aggregating GPU demand and supply, and by optimizing its container stack for faster deployment.\n\n**GPU Kernel Utilization** represents the fraction of time the GPU is actually executing code on the GPU, specifically CUDA kernels. Low kernel utilization can stem from tasks that don't leverage the GPU (like data transfer), or from the CPU failing to provide work to the GPU quickly enough (\"host overhead\"). Techniques like CUDA Graphs and batching can mitigate this.\n\n**Model FLOP/s Utilization (MFU)** is the deepest level of utilization, comparing the achieved FLOP/s throughput to the theoretical FLOP/s bandwidth. Low allocation or kernel utilization inherently leads to low MFU. Optimizing communication, addressing memory bottlenecks (especially relevant for low-arithmetic intensity workloads like foundation model inference), and carefully writing efficient GPU kernels are crucial for maximizing MFU.\n\nIn essence, the article argues that true GPU utilization goes beyond simply having GPUs allocated, and demands a holistic approach addressing the entire stack, from allocation efficiency to kernel optimization to memory bandwidth considerations.\n",
    "chinese_title": "我付了整个GPU的钱，我就要用整个GPU。",
    "chinese_summary": "查尔斯·弗莱的这篇文章深入探讨了“GPU利用率”这一多面概念，将其分解为三个不同的类别：GPU分配利用率、GPU内核利用率和模型FLOP/s利用率（MFU）。\n\n**GPU分配利用率**衡量的是实际运行应用程序代码的GPU秒数与支付的总GPU秒数之比。它受到经济因素（如合同承诺）和DevOps限制（如启动时间慢）的影响。Modal旨在通过聚合GPU供需，以及通过优化其容器堆栈以实现更快的部署来改善这一点。\n\n**GPU内核利用率**表示GPU实际执行代码（特别是CUDA内核）的时间比例。低内核利用率可能源于不利用GPU的任务（如数据传输），或者CPU未能足够快地向GPU提供工作（“主机开销”）。CUDA图和批处理等技术可以缓解这种情况。\n\n**模型FLOP/s利用率 (MFU)** 是最深层的利用率，它将实现的FLOP/s吞吐量与理论FLOP/s带宽进行比较。低分配或内核利用率必然会导致低MFU。优化通信、解决内存瓶颈（尤其与低算术强度工作负载（如基础模型推理）相关），以及认真编写高效的GPU内核对于最大化MFU至关重要。\n\n本质上，这篇文章认为真正的GPU利用率不仅仅是拥有已分配的GPU，还需要一种整体方法，解决从分配效率到内核优化再到内存带宽考虑的整个堆栈。"
  },
  {
    "id": "43921040",
    "title": "Stripe Stablecoin Financial Accounts",
    "url": "https://docs.stripe.com/crypto/stablecoin-financial-accounts",
    "summary": "Stripe's Stablecoin Financial Accounts, currently in private preview, allow businesses in over 100 countries to manage funds using stablecoins. Businesses can receive, store, and send funds in both US dollars and stablecoins using fiat or crypto rails. Supported regions include a wide range of countries across the Americas, Europe, Africa, and Asia.\n\nTo begin, users fund their stablecoin balance within the Stripe Dashboard using bank transfers (ACH or wire) or crypto transfers from external wallets. Users can then share account details to receive funds. Bridge, a Stripe company, acts as the custodian for the stablecoin balance, potentially holding funds in either USDC (Circle) or USDB (Bridge). USDB is a closed-loop stablecoin backed 1:1 by USD.\n\nUsers can transfer money from their stablecoin balance to external bank accounts or crypto wallets, with automatic exchange rate conversions for non-crypto transfers. They can also send money to others in USD (via ACH or wire) or in stablecoins over crypto rails. Recipients can be existing or new, with payout methods configurable on the Directory page.\n\nKey considerations include Bridge acting as custodian and Stripe holding balances in either USDC or USDB. USDB is backed 1:1 by US dollars held in cash and short-duration money market funds at BlackRock.\n",
    "chinese_title": "Stripe稳定币金融账户",
    "chinese_summary": "Stripe稳定币金融账户（目前为私测预览版）允许100多个国家/地区的企业使用稳定币管理资金。企业可以使用法币或加密货币渠道接收、存储和发送美元和稳定币资金。支持的地区包括美洲、欧洲、非洲和亚洲的广泛国家/地区。\n\n要开始使用，用户可以使用银行转账（ACH或电汇）或从外部钱包转入加密货币，在Stripe Dashboard中为其稳定币余额充值。然后，用户可以共享账户详细信息以接收资金。Stripe旗下公司Bridge担任稳定币余额的托管人，可能会将资金保存在USDC（Circle）或USDB（Bridge）中。USDB是一种封闭式稳定币，由美元1:1支持。\n\n用户可以将资金从其稳定币余额转移到外部银行账户或加密货币钱包，非加密货币转账会自动进行汇率转换。他们还可以通过ACH或电汇以美元或通过加密货币渠道以稳定币向他人汇款。收款人可以是现有或新的，可以在Directory页面上配置支付方式。\n\n主要考虑因素包括Bridge担任托管人，以及Stripe将余额保存在USDC或USDB中。USDB由现金和贝莱德的短期货币市场基金中持有的美元1:1支持。"
  },
  {
    "id": "43919812",
    "title": "Vagus Nerve Stimulation Erases PTSD: Study",
    "url": "https://neurosciencenews.com/vagus-nerve-stimulation-ptsd-28818/",
    "summary": "This article reports on a groundbreaking Phase 1 clinical study demonstrating the potential of vagus nerve stimulation (VNS) paired with prolonged exposure therapy to eliminate PTSD in patients resistant to conventional treatments. Conducted by researchers at UT Dallas and Baylor University Medical Center, the study involved nine participants with treatment-resistant PTSD who received 12 sessions of prolonged exposure therapy combined with short bursts of VNS via an implanted device.\n\nRemarkably, all participants achieved complete remission from PTSD, losing their diagnosis and showing significant improvements in PTSD symptoms and severity, which persisted for at least six months post-treatment. This 100% remission rate is especially noteworthy, as many PTSD patients fail to respond to standard therapies and often retain their diagnosis for life.\n\nThe study leverages the established ability of VNS to enhance neuroplasticity, facilitating brain rewiring and improving outcomes for individuals who don't respond to traditional treatments.  The next step is a double-blind, placebo-controlled Phase 2 trial to validate these findings and seek FDA approval. Researchers highlight the potential of this approach to offer new hope for individuals with PTSD, stemming from diverse traumatic experiences, and emphasizing the collaborative nature of the research between preclinical and clinical teams.  They developed a new VNS device that is smaller and less expensive than previous models.\n",
    "chinese_title": "迷走神经刺激消除创伤后应激障碍：研究",
    "chinese_summary": "一项突破性的一期临床研究报告：迷走神经刺激（VNS）联合延长暴露疗法有望消除对抗传统治疗有抵抗性的PTSD患者的病情。该研究由UT Dallas和贝勒大学医学中心的研究人员进行，共有九名对抗治疗有抵抗性的PTSD参与者接受了12次延长暴露疗法，并结合通过植入设备进行的短时VNS刺激。\n\n值得注意的是，所有参与者都完全缓解了PTSD，不再符合诊断标准，并且PTSD症状和严重程度显著改善，这些改善至少在治疗后持续了六个月。这种100%的缓解率尤其值得关注，因为许多PTSD患者对标准疗法没有反应，并且通常终生保持诊断。\n\n该研究利用了VNS已确定的增强神经可塑性的能力，促进大脑重塑，并改善对传统治疗无反应的个体的情况。下一步是进行一项双盲、安慰剂对照的二期临床试验，以验证这些发现并寻求FDA批准。研究人员强调，这种方法有望为患有PTSD的人们带来新的希望，这些PTSD可能源于各种创伤经历，并强调了临床前和临床团队之间研究的合作性质。他们开发了一种新型VNS设备，比以前的型号更小、更便宜。"
  },
  {
    "id": "43902308",
    "title": "DoorDash to acquire Deliveroo",
    "url": "https://www.cnbc.com/2025/05/06/doordash-to-buy-uk-food-delivery-firm-deliveroo-in-3point9-billion-deal.html",
    "summary": "DoorDash is set to acquire UK-based food delivery firm Deliveroo for $3.9 billion (£2.9 billion), marking a significant move for DoorDash to expand its international presence after acquiring Wolt in 2022. The deal, which values Deliveroo at 180 pence per share (a 44% premium), was agreed upon by Deliveroo's board.\n\nThe acquisition signifies the end of a challenging period for Deliveroo, which experienced a poor IPO in 2021, with shares falling significantly below their initial price. Investor concerns about post-COVID growth sustainability, intense market competition, and legal challenges related to the gig economy contributed to this decline.\n\nDoorDash CEO Tony Xu expressed excitement about the acquisition, emphasizing the combined reach of the two companies, covering over 40 countries and a population exceeding 1 billion. This acquisition reflects the ongoing consolidation within the food delivery sector, with other recent deals including Deliveroo selling its Hong Kong unit and Just Eat being acquired by Prosus.\n",
    "chinese_title": "DoorDash 将收购 Deliveroo",
    "chinese_summary": "DoorDash拟以39亿美元收购英国外卖公司Deliveroo，标志着DoorDash继2022年收购Wolt后，进一步扩张其国际业务。该交易对Deliveroo的估值为每股180便士（溢价44%），已获得Deliveroo董事会的批准。\n\n此次收购标志着Deliveroo一段艰难时期的结束，该公司于2021年进行了糟糕的首次公开募股，股价大幅低于发行价。投资者对新冠疫情后增长的可持续性、激烈的市场竞争以及与零工经济相关的法律挑战的担忧，导致了股价下跌。\n\nDoorDash首席执行官Tony Xu对此次收购表示兴奋，强调了两家公司的合并覆盖范围，涵盖超过40个国家，人口超过10亿。此次收购反映了外卖行业的持续整合，其他近期交易包括Deliveroo出售其香港业务以及Just Eat被Prosus收购。"
  },
  {
    "id": "43910685",
    "title": "Alignment is not free: How model upgrades can silence your confidence signals",
    "url": "https://www.variance.co/post/alignment-is-not-free-how-a-model-silenced-our-confidence-signals",
    "summary": "This Variance article, \"Alignment is not free: How model upgrades can silence your confidence signals,\" highlights a potential problem with consistently upgrading AI models: **upgrades can negatively impact the reliability of confidence scores generated by the models.**\n\nThe central argument is that while upgrades are generally seen as beneficial for improving accuracy and capabilities, the process of aligning models (making them adhere to specific guidelines and safety measures) can inadvertently affect the calibration of their confidence scores. Specifically, techniques used to prevent a model from expressing undesirable outputs might also suppress its ability to accurately represent its uncertainty.\n\nThe article suggests that a model whose confidence signals are unreliable poses a significant risk. Users may overestimate the model's competence, leading to inappropriate reliance and potentially harmful outcomes, especially in critical applications.\n\nTherefore, the core takeaway is a call for caution. Organizations need to carefully consider the potential trade-offs between model alignment and the integrity of confidence scores during the upgrade process. Monitoring and validating confidence score calibration after each upgrade becomes essential to ensure that the model's self-assessment capabilities are not compromised. The article implicitly suggests exploring alternative alignment techniques that minimize the impact on confidence scores or implementing strategies to recalibrate the model after alignment.\n",
    "chinese_title": "对齐并非免费：模型升级如何让你的置信度信号失效",
    "chinese_summary": "此方差文章《对齐并非免费：模型升级如何扼杀你的置信度信号》强调了一个持续升级AI模型的潜在问题：**升级可能会对模型生成的置信度评分的可靠性产生负面影响。**\n\n核心论点是，虽然升级通常被认为有利于提高准确性和能力，但模型对齐（使其遵守特定指南和安全措施）的过程可能会无意中影响其置信度评分的校准。 具体而言，用于防止模型表达不良输出的技术也可能会抑制其准确表达不确定性的能力。\n\n文章表明，置信度信号不可靠的模型会构成重大风险。 用户可能会高估模型的能力，从而导致不适当的依赖，并可能在关键应用中造成有害结果。\n\n因此，核心要点是呼吁谨慎。 组织需要仔细考虑模型对齐与升级过程中置信度评分完整性之间的潜在权衡。 每次升级后监测和验证置信度评分的校准变得至关重要，以确保模型的自我评估能力不受损害。 文章含蓄地建议探索可以最大限度地减少对置信度评分影响的替代对齐技术，或者实施在对齐后重新校准模型的策略。"
  },
  {
    "id": "43887068",
    "title": "Perfect Random Floating-Point Numbers",
    "url": "https://specbranch.com/posts/fp-rand/",
    "summary": "This article critiques the common method of generating uniform random floating-point numbers between 0 and 1 (generating a random integer, converting to float, and dividing) due to its limited accessibility to the full range of possible floats and biases in the least significant bits. It proposes a new algorithm for \"perfect\" random floating-point generation that addresses these flaws with minimal performance penalty.\n\nThe author explains the structure of floating-point numbers (sign, exponent, mantissa) and their power-law distribution, emphasizing that precision is constant across magnitudes. They discuss floating-point rounding modes and their implications for random number generation, particularly regarding probabilities at exponent boundaries.\n\nThe core idea is to match the probabilities of generating each floating-point number based on the likelihood of rounding a real number to that float. The proposed two-step algorithm involves: 1) generating a fixed-point random number to determine the range of real numbers from which the final value will be drawn, handling the lower number ranges recursively, and 2) finalizing the number by backfilling the extra bits of precision available. The second phase varies based on the chosen rounding mode. The article includes Go code implementing the algorithm, detailing the zooming fixed-point phase and the finalization process. This approach ensures a truly uniform distribution across the floating-point spectrum.\n",
    "chinese_title": "完美随机浮点数",
    "chinese_summary": "本文批判了一种常见的生成0到1之间均匀随机浮点数的方法（生成随机整数、转换为浮点数并除法），因为它对可能的浮点数完整范围的可访问性有限，并且在最低有效位存在偏差。文章提出了一种新的“完美”随机浮点数生成算法，以最小的性能损失解决了这些缺陷。\n\n作者解释了浮点数的结构（符号、指数、尾数）及其幂律分布，强调精度在不同量级上是恒定的。他们讨论了浮点数舍入模式及其对随机数生成的影响，特别是在指数边界上的概率。\n\n核心思想是基于将实数舍入到该浮点数的可能性，匹配生成每个浮点数的概率。所提出的两步算法包括：1）生成一个定点随机数来确定从中抽取最终值的实数范围，并递归地处理较低的数字范围；2）通过回填可用的额外精度位来完成数字。第二阶段根据选择的舍入模式而变化。文章包含了实现该算法的Go代码，详细介绍了缩放定点阶段和最终化过程。这种方法确保了在浮点数范围内实现真正的均匀分布。"
  },
  {
    "id": "43910681",
    "title": "VVVVVV Source Code",
    "url": "https://github.com/TerryCavanagh/VVVVVV",
    "summary": "The text announces the release of the source code for the indie game VVVVVV (2010), created by Terry Cavanagh with music by Magnus Pålsson. The desktop version's source code is available for personal use compilation. Commercial purchase is still encouraged to support the developer. Distribution of compiled versions is governed by the LICENSE.md file. Discussions about updates occur on the unofficial VVVVVV Discord server in the vvvvvv-code channel.\n\nThe credits list the creators: Terry Cavanagh (creator), Bennett Foddy (room names), Magnus Pålsson (music), FamilyJules (Metal Soundtrack), Simon Roth (2.0 Update - C++ Port), Ethan Lee (2.2 Update - SDL2/PhysicsFS/Steamworks port), and Misa Kai (additional coding). Beta testing was done by Sam Kaplan and Pauli Kohberger. The ending picture was created by Pauli Kohberger. The game was localized by various teams, and numerous others on GitHub contributed.\n",
    "chinese_title": "VVVVVV 源代码",
    "chinese_summary": "VVVVVV (2010) 独立游戏源代码发布公告。该游戏由 Terry Cavanagh 创作，Magnus Pålsson 配乐。桌面版源代码可供个人编译使用。仍鼓励商业购买以支持开发者。已编译版本的发布受 LICENSE.md 文件约束。关于更新的讨论请前往非官方 VVVVVV Discord 服务器的 vvvvvv-code 频道。\n\n鸣谢：Terry Cavanagh (创作者), Bennett Foddy (房间名称), Magnus Pålsson (音乐), FamilyJules (金属原声), Simon Roth (2.0 版本更新 - C++ 移植), Ethan Lee (2.2 版本更新 - SDL2/PhysicsFS/Steamworks 移植), Misa Kai (额外代码)。Beta 测试：Sam Kaplan 和 Pauli Kohberger。结尾图片：Pauli Kohberger。游戏本地化由多个团队完成，GitHub 上也有许多其他贡献者。"
  },
  {
    "id": "43901643",
    "title": "RSC for Astro Developers",
    "url": "https://overreacted.io/rsc-for-astro-developers/",
    "summary": "This article explains React Server Components (RSC) for Astro developers, highlighting their similarities and differences. Both Astro and RSC separate server-side logic from client-side interactivity, with Astro using `.astro` components and Client Islands, while RSC uses Server Components and Client Components distinguished by the `'use client'` directive.\n\nThe key difference lies in the flexibility and integration level. Astro offers a clear visual distinction between server and client code but can lead to limitations in sharing UI components and managing interactive behaviors within nested components. RSC, on the other hand, uses React on both sides, allowing for greater code reuse and a unified React tree that integrates features like context sharing, SPA-like navigation, and in-place server-side refreshes.\n\nWhile RSC offers more flexibility and solves some Astro limitations, it comes with a steeper learning curve. The author notes that the developer experience with RSC is still \"raw\" but suggests learning it for its interesting ideas and its potential to solve problems. Astro can also be a gentler onramp to similar concepts for those struggling with RSC, and can provide solutions to problems client-side React developers may not realize they have. Ultimately, RSC is positioned as a building block for frameworks, unlike Astro which is a full-fledged framework.\n",
    "chinese_title": "面向Astro开发者的RSC",
    "chinese_summary": "本文面向 Astro 开发者解释 React Server Components (RSC)，着重强调它们的异同。Astro 和 RSC 均将服务端逻辑与客户端交互分离，Astro 使用 `.astro` 组件和客户端岛屿，而 RSC 使用 Server Components 和 Client Components，并通过 `'use client'` 指令区分。\n\n主要区别在于灵活性和集成程度。Astro 在服务器和客户端代码之间提供了清晰的视觉区分，但可能导致在共享 UI 组件和管理嵌套组件内的交互行为方面存在局限性。另一方面，RSC 在两侧都使用 React，从而可以实现更高的代码重用率和统一的 React 树，该树集成了诸如上下文共享、类似 SPA 的导航和就地服务器端刷新等功能。\n\n虽然 RSC 提供了更高的灵活性并解决了 Astro 的一些限制，但它也带来了更陡峭的学习曲线。作者指出，RSC 的开发者体验仍然“粗糙”，但建议学习它，因为它包含有趣的想法以及解决问题的潜力。对于那些难以掌握 RSC 的人来说，Astro 也可以作为通往类似概念的更温和的入门方式，并且可以为客户端 React 开发者解决他们可能没有意识到的问题。最终，RSC 被定位为框架的构建块，而 Astro 则是一个成熟的框架。"
  },
  {
    "id": "43905185",
    "title": "Nnd – a TUI debugger alternative to GDB, LLDB",
    "url": "https://github.com/al13n321/nnd",
    "summary": "`Nnd` is presented as a fast, TUI-based debugger for Linux, aiming to be a snappy alternative to GDB and LLDB. It's implemented from scratch, not relying on existing debuggers. The key selling point is speed, emphasizing instantaneous operations where possible through multi-threading and asynchronous processes with progress bars.\n\nHowever, it has limitations: Linux/x86-64 only, native code (C++/Rust) only, TUI only, single process, and no record/replay. It includes common debugging features like breakpoints, stepping, code/disassembly views, watch expressions, and pretty-printers for C++ and Rust standard libraries. Auto-downcasting of abstract classes is a notable feature.\n\nThe debugger is actively used by the author and considered helpful, but it's not widely tested and likely missing features. The author suggests exploring the interface and using `--help-*` for documentation, with plans for tutorial videos.\n\n`Nnd` is distributed as a single 6MB executable with no dependencies, installable via `curl` and `chmod`. Building from source requires Rust, the musl target, and musl-tools. The author encourages feedback and acknowledging the limitations in discoverability.\n",
    "chinese_title": "Nnd – GDB、LLDB 的 TUI 调试器替代品",
    "chinese_summary": "`Nnd`：一款快速的Linux TUI调试器，旨在成为GDB和LLDB的快速替代品。它从头开始实现，不依赖现有调试器。其主要卖点是速度，通过多线程和带进度条的异步进程，尽可能实现即时操作。\n\n然而，它也有局限性：仅支持Linux/x86-64，仅支持原生代码（C++/Rust），仅支持TUI，仅支持单进程，并且没有记录/回放功能。它包含常见的调试功能，如断点、单步执行、代码/反汇编视图、监视表达式以及C++和Rust标准库的美化打印。自动向下转型抽象类是一个显著的特性。\n\n该调试器已被作者积极使用并认为很有帮助，但尚未经过广泛测试，并且可能缺少功能。作者建议探索界面并使用`--help-*`获取文档，并计划制作教程视频。\n\n`Nnd`作为一个6MB的单文件可执行文件分发，没有依赖项，可以通过`curl`和`chmod`安装。从源代码构建需要Rust、musl目标和musl-tools。作者鼓励提供反馈，并承认在可发现性方面的局限性。"
  },
  {
    "id": "43905942",
    "title": "Show HN: Clippy – 90s UI for local LLMs",
    "url": "https://felixrieseberg.github.io/clippy/",
    "summary": "\"Clippy\" is a desktop application that provides a 1990s-style user interface for interacting with local Large Language Models (LLMs). It's a nostalgic art project paying homage to Microsoft's Clippy and the design aesthetics of that era.\n\nThe application allows users to chat with LLMs directly on their computers, eliminating the need for complex setup. It leverages llama.cpp and node-llama-cpp to automatically optimize model performance based on the available hardware (Metal, CUDA, Vulkan, etc.). Users can also load custom models, prompts, and adjust parameters.\n\nClippy emphasizes offline and local operation, ensuring privacy and free usage. The only network activity is for optional update checks. The project is open-source and provides download links for macOS (Apple Silicon & Intel), Windows, and Linux (RPM & Debian).\n\nThe creator acknowledges Microsoft for Clippy's original design and contribution to Electron. He also thanks several other developers for their contributions to the project. The creator positions it as a fun project blending nostalgia for 90s technology with cutting-edge LLM capabilities.\n",
    "chinese_title": "展示一下：Clippy – 为本地LLM设计的90年代UI",
    "chinese_summary": "“Clippy” 是一款桌面应用程序，提供 90 年代风格的用户界面，用于与本地大型语言模型 (LLM) 交互。这是一个怀旧的艺术项目，向微软的 Clippy 以及那个时代的设计美学致敬。\n\n该应用程序允许用户直接在他们的计算机上与 LLM 聊天，无需复杂的设置。它利用 llama.cpp 和 node-llama-cpp 根据可用硬件（Metal、CUDA、Vulkan 等）自动优化模型性能。用户还可以加载自定义模型、提示并调整参数。\n\nClippy 强调离线和本地运行，确保隐私和免费使用。唯一的网络活动是可选的更新检查。该项目是开源的，并提供 macOS (Apple Silicon & Intel)、Windows 和 Linux (RPM & Debian) 的下载链接。\n\n创作者感谢微软对 Clippy 原始设计和对 Electron 的贡献。他还感谢其他几位开发者对该项目的贡献。创作者将其定位为一个有趣的混合项目，将对 90 年代技术的怀旧与尖端的 LLM 功能相结合。"
  },
  {
    "id": "43905299",
    "title": "Accents in latent spaces: How AI hears accent strength in English",
    "url": "https://accent-strength.boldvoice.com/",
    "summary": "This article explores how AI, specifically BoldVoice's machine learning model, understands and quantifies accent strength in English speech. The core concept is the \"accent fingerprint,\" an embedding generated from speech recordings that represents an individual's accent.\n\nThe article visualizes these fingerprints in a latent space, where proximity reflects accent similarity. By analyzing the latent space, the authors found that accent strength is independent of a speaker's native language.\n\nThe article demonstrates the model's practical application by tracking the progress of Victor, a non-native English speaker, as he practices mimicking an American English accent. They used techniques like noise reduction and accent conversion (mapping Eliza's accent onto Victor's voice) to aid Victor's practice. The latent space visualization effectively showed Victor's progress toward the \"target\" accent.\n\nKey findings include that the model accurately distinguishes accent strength, the model is not biased towards different native languages, accent strength can be improved with practice, voice conversion is a useful tool for accent training, and noise reduction doesn't significantly impact accent strength measurement.\n\nThe article concludes by suggesting applications of the accent strength metric, such as tracking learners' progress, evaluating automatic speech recognition (ASR) systems across different accents, and monitoring text-to-speech (TTS) systems for \"accent drift.\" They announce a future post will further explore accent fingerprints in English.\n",
    "chinese_title": "潜在空间中的口音：AI 如何听懂英语口音强度",
    "chinese_summary": "本文探讨了人工智能，特别是BoldVoice的机器学习模型，如何理解和量化英语语音中的口音强度。其核心概念是“口音指纹”，这是一种从语音录音中生成的嵌入，代表了个人的口音。\n\n本文将这些指纹在潜在空间中可视化，其中接近度反映了口音的相似性。通过分析潜在空间，作者发现口音强度与说话者的母语无关。\n\n本文通过跟踪一位非英语母语者Victor练习模仿美式英语口音的进度，展示了该模型的实际应用。他们使用了诸如降噪和口音转换（将Eliza的口音映射到Victor的声音上）等技术来辅助Victor的练习。潜在空间可视化有效地展示了Victor向“目标”口音的进步。\n\n主要发现包括该模型能够准确区分口音强度，该模型没有对不同母语产生偏见，口音强度可以通过练习来提高，语音转换是口音训练的有用工具，以及降噪对口音强度测量没有显著影响。\n\n本文最后提出了口音强度指标的应用，例如跟踪学习者的进步，评估自动语音识别（ASR）系统在不同口音下的表现，以及监控文本转语音（TTS）系统是否存在“口音漂移”。他们宣布未来的文章将进一步探讨英语中的口音指纹。"
  },
  {
    "id": "43903959",
    "title": "New studies offer insight into Lyme disease’s treatment, lingering symptoms",
    "url": "https://news.northwestern.edu/stories/2025/04/taking-the-bite-out-of-lyme-disease/",
    "summary": "This article, titled \"New studies offer insight into Lyme disease’s treatment, lingering symptoms,\" published on May 2, 2025, focuses on the latest research related to Lyme disease. While the full content is unavailable, the title suggests the studies shed light on two key areas:\n\n1.  **Treatment of Lyme Disease:** The article likely discusses advancements in Lyme disease treatment methods. This could include new drugs, therapies, or more effective ways to administer existing treatments.\n\n2.  **Lingering Symptoms:** The article probably explores the persistent or chronic symptoms some individuals experience even after completing standard Lyme disease treatment. These are often referred to as Post-Treatment Lyme Disease Syndrome (PTLDS) or chronic Lyme disease. The studies may investigate the causes of these lingering symptoms and potential strategies to manage or alleviate them.\n\nThe article's second line referencing \"Robotic touch sensors\" is irrelevant to the topic of Lyme Disease. The article is reporting the studies.\n",
    "chinese_title": "关于莱姆病治疗和持续症状的新研究提供了见解",
    "chinese_summary": "题为“新研究深入了解莱姆病的治疗和持续症状”的文章（2025年5月2日发表）侧重于莱姆病相关的最新研究。虽然全文不可用，但标题表明这些研究阐明了两个关键领域：\n\n1.  **莱姆病的治疗：** 文章可能讨论莱姆病治疗方法的进展。这可能包括新药、疗法或更有效的使用现有疗法的方式。\n\n2.  **持续症状：** 文章可能探讨一些人在完成标准莱姆病治疗后仍然经历的持续或慢性症状。这些通常被称为治疗后莱姆病综合征 (PTLDS) 或慢性莱姆病。这些研究可能调查这些持续症状的原因以及管理或缓解它们的潜在策略。\n\n文章第二行引用的“机器人触摸传感器”与莱姆病的主题无关。该文章是在报告这些研究。"
  },
  {
    "id": "43924226",
    "title": "Which countries have the best, and worst, living standards?",
    "url": "https://www.economist.com/graphic-detail/2025/05/06/which-countries-have-the-best-and-worst-living-standards",
    "summary": "This article, published in May 2025, discusses the state of human development across 193 countries and highlights a concerning trend: the setback to living standards experienced during the COVID-19 pandemic may be long-lasting. While many hoped for a quick recovery, the data five years later suggests a more persistent stagnation in human development globally. The article implies that the pandemic's effects on healthcare, education, and economies have had a significant and enduring impact on living standards worldwide.\n",
    "chinese_title": "哪些国家生活水平最高，哪些国家最低？",
    "chinese_summary": "发表于2025年5月的这篇文章探讨了193个国家的人类发展状况，并强调了一个令人担忧的趋势：新冠疫情期间生活水平的倒退可能是长期性的。尽管许多人希望迅速复苏，但五年后的数据显示，全球人类发展持续停滞的可能性更大。文章暗示，疫情对医疗、教育和经济的影响对全球生活水平产生了重大而持久的影响。"
  },
  {
    "id": "43885101",
    "title": "I decided to pay off a school’s lunch debt",
    "url": "https://www.huffpost.com/entry/utah-school-lunch-debt-relief-free-student-meals_n_681258fbe4b03207b5ba49fa",
    "summary": "DJ Bracken recounts his journey from being unaware of school lunch debt to becoming an advocate for its elimination in Utah. He was moved to action after learning about the humiliation children face when unable to pay for lunch, leading him to pay off the $835 lunch debt at Bluffdale Elementary.\n\nThis act spurred him to investigate the larger problem, discovering that Utah schools had $2.8 million in lunch debt. He started a spreadsheet and began contacting school districts to learn more, realizing that the issue affected not just low-income families, but also those just above the eligibility threshold for free lunch programs.\n\nBracken founded the Utah Lunch Debt Relief Foundation, raising over $50,000 through social media to eliminate lunch debt at 12 schools. His work brought him into contact with principals, reporters, and state legislators, making him an accidental expert on the issue. He grapples with the philosophical dilemma of whether paying off the debt enables a broken system.\n\nDespite the contradictions, Bracken advocates for both immediate relief and systemic change. His work contributed to the passage of HB100, which provides free lunch to reduced-price students and prohibits lunch shaming. He emphasizes the importance of addressing immediate needs while simultaneously working towards long-term solutions and envisions a world where children are simply allowed to eat without financial barriers.\n",
    "chinese_title": "我决定偿还一所学校的午餐欠款。",
    "chinese_summary": "DJ·布雷肯讲述了他从对学校午餐债务一无所知到成为犹他州消除午餐债务倡导者的历程。在得知孩子们因无力支付午餐而面临的羞辱后，他深受触动，决定采取行动，并支付了布拉夫代尔小学835美元的午餐债务。\n\n这一举动促使他调查更大的问题，发现犹他州学校有280万美元的午餐债务。他开始制作电子表格，并联系学区以了解更多信息，意识到这个问题不仅影响低收入家庭，也影响那些仅仅超过免费午餐计划资格标准的家庭。\n\n布雷肯创立了犹他州午餐债务救济基金会，通过社交媒体筹集了超过5万美元，用于消除12所学校的午餐债务。他的工作使他与校长、记者和州议员接触，使他成为该问题的意外专家。他纠结于一个哲学难题：偿还债务是否会助长一个破损的体系。\n\n尽管存在矛盾，布雷肯仍倡导立即提供救济和进行系统性变革。他的工作促成了HB100法案的通过，该法案为低价午餐学生提供免费午餐，并禁止午餐羞辱行为。他强调在解决眼前需求的同时努力寻求长期解决方案的重要性，并设想一个孩子们可以简单地吃饭而没有经济障碍的世界。"
  },
  {
    "id": "43901619",
    "title": "An appeal to Apple from Anukari",
    "url": "https://anukari.com/blog/devlog/an-appeal-to-apple",
    "summary": "Anukari, a 3D physics synthesizer for audio generation, relies on the GPU for real-time simulations. The developer, Anukari, is appealing to Apple because the macOS power management system hinders Anukari's performance on Apple Silicon devices. macOS lowers the GPU clock rate when it detects low processing demand, but Anukari's short, burst-like GPU usage doesn't trigger the necessary clock speed increase to meet real-time audio constraints.\n\nWhile Anukari works well for most macOS users due to a \"waste makes haste\" workaround (a spin loop to artificially load the GPU), some users, particularly those with Pro or Max Apple hardware, experience performance issues. Anukari hypothesizes that the independent clock control of multiple GPU chiplets could be assigning the spin loop to a fast-clock GPU while the audio workload gets a slow-clock GPU.\n\nAnukari suggests potential solutions: extending Audio Workgroup concepts to the GPU, providing a real-time sensitivity option in the Metal API for MTLCommandQueue, or discovering an existing solution he's unaware of. Game Mode is not applicable because Anukari runs as a plugin and is not fullscreen. Pipelining is unsuitable due to latency sensitivity, and running the spin kernel in the same queue can interfere with the physics kernel. Kernel hedging is deemed too expensive and wasteful. Despite thorough optimization, including FP16 math and instruction reordering, the core issue remains with GPU clock management. He emphasizes the irony of Windows machines with weaker GPUs performing better due to more user control or less aggressive power management.\n",
    "chinese_title": "阿努卡里的致苹果公司的呼吁",
    "chinese_summary": "Anukari，一款用于音频生成的3D物理合成器，依靠GPU进行实时模拟。开发者Anukari正在向苹果公司呼吁，因为macOS的电源管理系统阻碍了Anukari在Apple Silicon设备上的性能。 macOS在检测到处理需求较低时会降低GPU时钟频率，但Anukari短暂的、突发式的GPU使用无法触发必要的时钟速度提升，以满足实时音频的要求。\n\n虽然Anukari通过“浪费加速”的变通方法（一个人为加载GPU的自旋循环）对大多数macOS用户来说运行良好，但一些用户，特别是那些拥有Pro或Max Apple硬件的用户，会遇到性能问题。 Anukari推测，多个GPU芯片组的独立时钟控制可能将自旋循环分配给了一个快速时钟GPU，而音频工作负载却分配给了一个慢速时钟GPU。\n\nAnukari提出了潜在的解决方案：将音频工作组的概念扩展到GPU，在Metal API中为MTLCommandQueue提供一个实时灵敏度选项，或者找到他尚未发现的现有解决方案。游戏模式不适用，因为Anukari作为插件运行，并非全屏。 由于延迟敏感性，流水线不适用，并且在同一队列中运行自旋内核可能会干扰物理内核。内核对冲被认为过于昂贵和浪费。 尽管经过彻底优化，包括FP16数学和指令重排序，但核心问题仍然在于GPU时钟管理。 他强调了讽刺的一点，即具有较弱GPU的Windows机器由于更多的用户控制或更少的激进电源管理而表现更好。"
  },
  {
    "id": "43908368",
    "title": "Brush (Bo(u)rn(e) RUsty SHell) a POSIX and Bash-Compatible Shell in Rust",
    "url": "https://github.com/reubeno/brush",
    "summary": "Brush (Bo(u)rn(e) RUsty SHell) is a POSIX- and Bash-compatible shell written in Rust, designed for interactive use and script execution. It is built and tested on Linux and macOS, with experimental Windows support. While functional as a daily driver and capable of running most sh/bash scripts, the project advises caution in production environments due to potential behavioral differences. Contributions and feedback are welcomed.\n\nUsers can install Brush via `cargo install --locked brush-shell` or run it directly from the cloned repository using `cargo run`. Nix and Arch Linux users have alternative installation methods. The shell processes standard configuration files like `.bashrc` and allows for custom appearance using a `~/.brushrc` file.\n\nKnown limitations include incomplete implementations of `set` and `shopt` options, along with features marked with `TODO` comments or using `error::unimp()`. Testing involves comparing Brush's behavior against other shells (the \"oracle\"), with over 550 integration tests evaluating standard output and exit codes. The project leverages crates like `reedline`, `clap`, `fancy-regex`, `tokio`, and `nix`, along with tools like `pprof-rs` and `criterion.rs` for testing and performance analysis. Brush draws inspiration from other non-C/C++ shells like Nushell, rusty_bash, and mvdan/sh.\n",
    "chinese_title": "使用 Rust 编写的 POSIX 和 Bash 兼容的 Shell：Brush (Bo(u)rn(e) RUsty SHell)",
    "chinese_summary": "Brush (Bo(u)rn(e) RUsty SHell) 是一个用 Rust 编写的、兼容 POSIX 和 Bash 的 Shell，专为交互式使用和脚本执行而设计。 它构建并测试于 Linux 和 macOS 上，并提供实验性的 Windows 支持。 虽然它可以作为日常使用并能够运行大多数 sh/bash 脚本，但该项目建议在生产环境中谨慎使用，因为可能存在行为差异。 欢迎贡献和反馈。\n\n用户可以通过 `cargo install --locked brush-shell` 安装 Brush，或使用 `cargo run` 直接从克隆的存储库运行它。 Nix 和 Arch Linux 用户有其他安装方法。 该 Shell 处理标准配置文件（如 `.bashrc`），并允许使用 `~/.brushrc` 文件进行自定义外观。\n\n已知限制包括 `set` 和 `shopt` 选项的未完成实现，以及标有 `TODO` 注释或使用 `error::unimp()` 的功能。 测试包括将 Brush 的行为与其他 Shell（即 “oracle”）进行比较，超过 550 个集成测试评估标准输出和退出代码。 该项目利用了 `reedline`、`clap`、`fancy-regex`、`tokio` 和 `nix` 等 crate，以及 `pprof-rs` 和 `criterion.rs` 等工具进行测试和性能分析。 Brush 从其他非 C/C++ Shell（如 Nushell、rusty_bash 和 mvdan/sh）中汲取灵感。"
  },
  {
    "id": "43884418",
    "title": "Old Timey Code and Old Timey Mono Fonts",
    "url": "https://github.com/dse/old-timey-mono-font",
    "summary": "This article introduces \"Old Timey Mono\" and \"Old Timey Code,\" monospace fonts designed to evoke the aesthetic of early 20th-century typewriters. Inspired by \"Reproducing Typewriter,\" a font designed for readability in small print, Old Timey Mono aims to be a coding font with an antique feel. Old Timey Code is a variant specifically tailored for coding, featuring a slashed zero and other character adjustments for clarity.\n\nThe font is designed to be pica-sized at 12pt, making it suitable for screenplay writing. It boasts extensive character set coverage, including ASCII, ISO-8859-1, Code Page 437/850, WGL4, AGLFN, Windows 1252, Mac OS Roman (excluding ligatures), and multiple Unicode blocks.  It supports a wide range of languages across Latin, Cyrillic, and Greek scripts, as detailed by a language coverage checker.\n\nThe author acknowledges minor modifications to the original typeface to achieve a true monospaced design. He also provides recommendations for similar fonts, both free and paid, for users interested in typewriter-style typefaces, along with other fonts he has created. The fonts are licensed under SIL OFL 1.1. A link to download the font from Releases, and a link to a specimen of the font, are prominently placed at the beginning of the document.\n",
    "chinese_title": "老式代码与老式等宽字体",
    "chinese_summary": "本文介绍“Old Timey Mono”和“Old Timey Code”两种等宽字体，旨在唤起人们对20世纪早期打字机美学的回忆。“Old Timey Mono”的灵感来源于为小字号印刷设计的可读性字体“Reproducing Typewriter”，力求成为一种具有复古感的编程字体。“Old Timey Code”是专门为编程定制的变体，具有带斜线的零以及其他为清晰度而调整的字符。\n\n该字体设计为12pt的Pica尺寸，使其适合剧本写作。它拥有广泛的字符集覆盖，包括ASCII、ISO-8859-1、Code Page 437/850、WGL4、AGLFN、Windows 1252、Mac OS Roman（不包括连字）以及多个Unicode块。它支持拉丁文、西里尔文和希腊文等多种语言，详细信息请参见语言覆盖检查器。\n\n作者承认对原始字体进行了细微修改，以实现真正的等宽设计。他还为对打字机风格字体感兴趣的用户推荐了类似的免费和付费字体，以及他创建的其他字体。这些字体采用SIL OFL 1.1许可。文档开头醒目地放置了从Releases下载字体的链接以及字体样本的链接。"
  }
]