[
  {
    "id": "46134443",
    "title": "Congressional lawmakers 47% pts better at picking stocks",
    "url": "https://www.nber.org/papers/w34524",
    "summary": "This NBER working paper, titled \"Captain Gains\" on Capitol Hill, investigates stock trading performance of US congressional lawmakers, revealing a significant performance disparity after ascending to leadership positions. The study, using transaction-level data, finds that leaders outperform their matched peers by an impressive 47 percentage points annually.\n\nThe authors, Shang-Jin Wei and Yifan Zhou, attribute this superior performance to two primary mechanisms: political influence and corporate access.\n\n**Political Influence:** Leaders benefit from their influence through higher returns when their party controls the chamber, strategic selling of stocks before regulatory actions, and purchasing stocks of companies receiving more government contracts or enjoying favorable party support on bills.\n\n**Corporate Access:** Leaders gain access to privileged corporate information, evidenced by stock trades that predict subsequent corporate news and better returns on investments in donor-owned or home-state firms.\n\nIn essence, the research suggests that congressional leaders leverage their political power and insider access to achieve significantly higher returns in the stock market compared to their peers.\n",
    "chinese_title": "国会议员选股能力高出47个百分点",
    "chinese_summary": "题为《国会山的“船长获利”》的这份NBER工作论文，调查了美国国会立法者的股票交易表现，揭示了他们在晋升领导职位后表现出显著的差异。该研究利用交易层面的数据发现，领导者每年的表现比与其匹配的同僚高出惊人的47个百分点。\n\n作者魏尚进和周一帆将这种优异表现归因于两种主要机制：政治影响力和公司关系。\n\n**政治影响力：** 当其所在党派控制议院时，领导者从其影响力中获益，并在监管行动前战略性地出售股票，以及购买获得更多政府合同或在法案中享受有利党派支持的公司的股票，从而获得更高的回报。\n\n**公司关系：** 领导者获得了特权的公司信息，股票交易预测了随后的公司新闻，以及对捐助者拥有或家乡州公司的投资获得了更好的回报，这些都证明了这一点。\n\n本质上，该研究表明，与同僚相比，国会领导人利用其政治权力和内部关系在股市中获得明显更高的回报。"
  },
  {
    "id": "46136023",
    "title": "MinIO is now in maintenance-mode",
    "url": "https://github.com/minio/minio/commit/27742d469462e1561c776f88ca7a1f26816d69e2",
    "summary": "The MinIO project is now in maintenance mode and will not be accepting new features, enhancements, or pull requests. This means the codebase is in a maintenance-only state. While critical security fixes might be evaluated on a case-by-case basis, existing issues and pull requests will not be actively reviewed. Community support will continue on a best-effort basis through their Slack channel. For enterprise support and actively maintained versions, users are directed to MinIO AIStor. Essentially, the open-source MinIO project is no longer actively developed, focusing solely on critical maintenance, with users directed to a commercial alternative for active development and support.\n",
    "chinese_title": "MinIO 目前处于维护模式。",
    "chinese_summary": "MinIO项目现已进入维护模式，不再接受新功能、增强或拉取请求。这意味着代码库处于仅维护状态。虽然可能会根据具体情况评估关键安全修复，但现有问题和拉取请求将不会被积极审查。社区支持将继续尽力通过其Slack频道提供。如需企业支持和积极维护的版本，用户可访问MinIO AIStor。本质上，开源MinIO项目已停止积极开发，仅专注于关键维护，用户可转向商业替代方案以获得积极开发和支持。"
  },
  {
    "id": "46136901",
    "title": "Steam Deck lead reveals Valve is funding ARM compatibility of Windows games",
    "url": "https://frvr.com/blog/news/steam-deck-lead-reveals-valve-is-funding-arm-compatibility-of-windows-games-to-expand-pc-gaming-and-release-ultraportables-in-the-future/",
    "summary": "This article highlights two distinct topics within the gaming industry.\n\nFirstly, it reports that Valve is actively funding efforts to improve ARM compatibility for Windows games, specifically on the Steam Deck. This initiative, revealed by a Steam Deck lead, suggests Valve is invested in broadening the range of games playable on the handheld device, potentially through emulation or other compatibility layers that leverage the ARM architecture. This could significantly expand the Steam Deck's library and make it more appealing to a wider audience.\n\nSecondly, the article mentions a call from voice actors from \"Expedition 33\" for a dedicated \"motion capture category\" at The Game Awards. The actors argue that recognizing motion capture performances is crucial, as these performers often receive little to no visibility despite their significant contributions to game development. They highlight the lack of recognition and the potential for mo-cap performers to \"just disappear\" without acknowledgement of their work. This advocates for increased recognition of a vital but often overlooked aspect of video game creation.\n",
    "chinese_title": "Steam Deck负责人透露Valve正在资助Windows游戏的ARM兼容性",
    "chinese_summary": "本文重点介绍了游戏行业的两个不同主题。\n\n首先，文章报道称 Valve 正在积极资助改进 Windows 游戏在 ARM 架构上的兼容性的工作，特别是针对 Steam Deck。这一由 Steam Deck 负责人透露的消息表明，Valve 致力于扩大该掌机上可玩的游戏范围，可能是通过模拟或其他利用 ARM 架构的兼容层来实现。这可能会显著扩展 Steam Deck 的游戏库，并使其对更广泛的受众更具吸引力。\n\n其次，文章提到了来自“远征 33 号”的配音演员呼吁在 TGA 游戏大奖中设立专门的“动作捕捉类别”。演员们认为，认可动作捕捉表演至关重要，因为这些表演者尽管对游戏开发做出了重大贡献，但往往很少甚至没有得到关注。他们强调了缺乏认可以及动作捕捉表演者可能“消失”而没有得到对其工作的认可的可能性。 这提倡提高对电子游戏创作中一个重要但经常被忽视的方面的认可。"
  },
  {
    "id": "46136026",
    "title": "RCE Vulnerability in React and Next.js",
    "url": "https://github.com/vercel/next.js/security/advisories/GHSA-9qr9-h5gf-34mp",
    "summary": "This document describes a critical Remote Code Execution (RCE) vulnerability affecting React Server Components and Next.js applications. Specifically, it impacts versions 19.0.0, 19.1.0, 19.1.1, and 19.2.0 of certain React packages and Next.js versions 15.x and 16.x using the App Router. The vulnerability is tracked upstream as CVE-2025-55182.\n\nThe issue also affects experimental canary releases of Next.js starting with 14.3.0-canary.77. Users on these canary builds are advised to downgrade to a stable 14.x release or 14.3.0-canary.76.\n\nPatches are available in React versions 19.0.1, 19.1.2, and 19.2.1 and Next.js versions 15.0.5, 15.1.9, 15.2.6, 15.3.6, 15.4.8, 15.5.7, and 16.0.7.  Users of stable Next.js versions 15.x and 16.x are strongly urged to upgrade immediately.\n\nThe vulnerability has a CVSS score of 10.0 (Critical) due to the network attack vector, low attack complexity, no privileges required, no user interaction required, changed scope, and high impact on confidentiality, integrity, and availability.\n",
    "chinese_title": "React 和 Next.js 中的 RCE 漏洞",
    "chinese_summary": "本文档描述了一个影响 React Server Components 和 Next.js 应用程序的关键远程代码执行 (RCE) 漏洞。具体来说，它影响某些 React 包的 19.0.0、19.1.0、19.1.1 和 19.2.0 版本，以及使用 App Router 的 Next.js 15.x 和 16.x 版本。该漏洞的上游追踪编号为 CVE-2025-55182。\n\n该问题还影响 Next.js 从 14.3.0-canary.77 开始的实验性 Canary 版本。建议这些 Canary 构建的用户降级到稳定的 14.x 版本或 14.3.0-canary.76。\n\nReact 19.0.1、19.1.2 和 19.2.1 版本以及 Next.js 15.0.5、15.1.9、15.2.6、15.3.6、15.4.8、15.5.7 和 16.0.7 版本提供了补丁。强烈建议稳定 Next.js 15.x 和 16.x 版本用户立即升级。\n\n由于网络攻击向量、低攻击复杂度、无需权限、无需用户交互、作用范围已更改以及对机密性、完整性和可用性的高影响，该漏洞的 CVSS 评分为 10.0（严重）。"
  },
  {
    "id": "46133622",
    "title": "You Can't Fool the Optimizer",
    "url": "https://xania.org/202512/03-more-adding-integers",
    "summary": "This article, \"You Can't Fool the Optimizer,\" highlights the impressive ability of compilers to optimize even highly obfuscated code. The author, Matt Godbolt, illustrates this with examples of several convoluted unsigned addition routines written for ARM architecture. Despite their different structures, the compiler consistently reduces them to a single, efficient `add w0, w1, w0` instruction.\n\nThe key takeaway is that compilers don't rely on a database of known \"silly\" code patterns. Instead, they translate code into an intermediate representation, a simplified, abstract form, which allows them to identify underlying mathematical equivalencies. For example, a complex `while` loop designed to add two numbers is transformed into \"increment y by x, then return y,\" which the compiler then recognizes as equivalent to \"return x + y.\"\n\nThis process of converting code into a standard, canonical form enables the compiler to treat seemingly disparate code snippets identically. This robust pattern recognition allows programmers to prioritize code readability and clarity, trusting that the compiler will generate optimized code efficiently. The article is part of the \"Advent of Compiler Optimisations 2025\" series and encourages readers to explore the \"Opt Pipeline Viewer\" in Compiler Explorer to witness the compiler's transformations firsthand.\n",
    "chinese_title": "你骗不了优化器",
    "chinese_summary": "你骗不了优化器\n\n这篇文章《你骗不了优化器》强调了编译器在优化甚至高度混淆代码方面的强大能力。作者Matt Godbolt用几个为ARM架构编写的复杂的无符号加法例程来说明了这一点。尽管它们的结构不同，编译器始终将它们简化为一条高效的`add w0, w1, w0`指令。\n\n关键在于编译器并不依赖于已知“愚蠢”代码模式的数据库。相反，它们将代码转换为中间表示，一种简化的抽象形式，这使它们能够识别潜在的数学等价性。例如，一个旨在添加两个数字的复杂`while`循环被转换为“将y增加x，然后返回y”，编译器随后将其识别为等同于“返回x + y”。\n\n这种将代码转换为标准、规范形式的过程使编译器能够以相同的方式处理看似不同的代码片段。这种强大的模式识别能力使程序员可以优先考虑代码的可读性和清晰性，相信编译器会有效地生成优化后的代码。 这篇文章是“2025编译器优化探索”系列的一部分，并鼓励读者在Compiler Explorer中探索“Opt Pipeline Viewer”，以亲眼目睹编译器的转换过程。"
  },
  {
    "id": "46072280",
    "title": "How to Synthesize a House Loop",
    "url": "https://loopmaster.xyz/tutorials/how-to-synthesize-a-house-loop",
    "summary": "The article \"How to Synthesize a House Loop\" from loopmaster's Live Audio Programming section focuses on teaching readers how to create a house music drum loop from scratch using digital audio synthesis techniques. It likely breaks down the process into creating individual drum elements – kick, snare/clap, hi-hats, and potentially other percussive elements – and then combining them into a cohesive rhythmic pattern.\n\nThe article likely covers:\n\n*   **Synthesizing individual drum sounds:** Describing methods for generating each sound using various synthesis techniques (e.g., subtractive synthesis, FM synthesis, noise generators). Parameters like frequency, amplitude envelope, filter settings, and resonance would likely be discussed in relation to creating the desired sonic characteristics for each drum element.\n*   **Building the rhythm:** Explaining how to arrange the synthesized drum sounds in a sequencer or DAW to create a typical 4/4 house beat. This involves placing the kick drum on beats 1 and 3, the snare or clap on beats 2 and 4, and arranging the hi-hats to create a driving rhythmic feel.\n*   **Mixing and processing:** Potentially including tips on EQing, compression, and adding reverb to the individual drum sounds and the overall loop to achieve a professional and polished sound.\n*   **Programming environment**: The article likely assumes basic familiarity with a DAW or a programming environment for audio synthesis.\n\nIn essence, the article serves as a practical guide for electronic music producers interested in gaining a deeper understanding of sound design and rhythmic arrangement, specifically within the context of house music.\n",
    "chinese_title": "如何合成House Loop",
    "chinese_summary": "loopmaster网站“实时音频编程”栏目中的文章《如何合成House Loop》专注于教授读者如何使用数字音频合成技术从零开始创建House音乐鼓loop。它很可能将这个过程分解为创建单独的鼓元素——底鼓、军鼓/拍手声、踩镲，以及可能的其他打击乐元素——然后将它们组合成一个有凝聚力的节奏模式。\n\n这篇文章很可能涵盖：\n\n*   **合成单独的鼓声：** 描述使用各种合成技术（例如，减法合成、FM合成、噪声发生器）生成每种声音的方法。诸如频率、振幅包络、滤波器设置和共振之类的参数很可能会被讨论，以便为每个鼓元素创建所需的音色特征。\n*   **构建节奏：** 解释如何在音序器或DAW中排列合成的鼓声，以创建典型的4/4 House节拍。这包括将底鼓放在第1拍和第3拍上，将军鼓或拍手声放在第2拍和第4拍上，并排列踩镲以创建驱动的节奏感。\n*   **混音和处理：** 可能会包含关于对各个鼓声和整个loop进行EQ、压缩和添加混响的技巧，以实现专业和精致的声音。\n*   **编程环境：** 这篇文章可能假设读者对DAW或音频合成编程环境有基本的熟悉程度。\n\n本质上，这篇文章是为有兴趣深入了解声音设计和节奏编排的电子音乐制作人提供的实用指南，尤其是在House音乐的背景下。"
  },
  {
    "id": "46136918",
    "title": "Rocketable (YC W25) is hiring a founding engineer to automate software companies",
    "url": "https://www.ycombinator.com/companies/rocketable/jobs/CArgzmX-founding-engineer-automation-platform",
    "summary": "Rocketable (YC W25) is seeking a Founding Engineer to build an automation platform for acquiring and transforming SaaS companies into fully autonomous AI-driven businesses, eliminating the need for human operators, engineering teams, and support staff. The ideal candidate believes in the inevitability of full automation and wants to build unprecedented solutions, rather than incremental improvements.\n\nThe role involves architecting a platform to automate real SaaS companies, starting with customer support and evolving into a system that learns from human interventions, builds its own tools, and achieves superhuman performance. The company is looking for someone with 5+ years of experience scaling production systems, strong skills in AI/ML (LLM integration, prompt engineering), and infrastructure (Kubernetes, Docker, Cloud platforms). Proficiency in TypeScript and Python is preferred.\n\nRocketable is backed by $6.5M seed funding from Y Combinator and others, providing capital for multiple acquisitions. The team is small, in-person 5 days/week in San Francisco (or Marin County). The company acknowledges the societal implications of their work but remains focused on building a durable, AI-powered future. The interview process includes an intro call, system design interview, background check, paid trial project, and reference interviews. Rocketable aims to create a portfolio of highly profitable software products that operate at levels unattainable by humans, enabled by scalable and self-improving AI.\n",
    "chinese_title": "Rocketable (YC W25) 正在招聘一位创始工程师，以实现软件公司的自动化。",
    "chinese_summary": "Rocketable (YC W25) 寻求创始工程师，构建自动化平台，将SaaS公司收购并转型为完全自主的AI驱动业务，无需人工操作员、工程团队和支持人员。理想的候选人坚信完全自动化的必然性，并希望构建前所未有的解决方案，而不是渐进式的改进。\n\n该职位涉及构建一个自动化真实SaaS公司的平台，从客户支持开始，逐步发展成为一个从人工干预中学习、构建自己的工具并实现超人性能的系统。该公司正在寻找具有5年以上扩展生产系统经验、在AI/ML（LLM集成、提示工程）和基础设施（Kubernetes、Docker、云平台）方面具有强大技能的人员。精通TypeScript和Python者优先。\n\nRocketable 获得了来自 Y Combinator 和其他机构的 650 万美元种子轮融资，为多次收购提供了资金。团队规模很小，每周 5 天在旧金山（或马林县）进行面对面办公。该公司承认其工作的社会影响，但仍专注于构建一个持久的、由人工智能驱动的未来。面试过程包括介绍性电话、系统设计面试、背景调查、付费试用项目和推荐人面试。Rocketable 旨在创建一个由可扩展且自我完善的人工智能驱动的高利润软件产品组合，这些产品以人类无法达到的水平运行。"
  },
  {
    "id": "46134991",
    "title": "GSWT: Gaussian Splatting Wang Tiles",
    "url": "https://yunfan.zone/gswt_webpage/",
    "summary": "This paper introduces GSWT (Gaussian Splatting Wang Tiles), a novel framework to extend the capabilities of 3D Gaussian Splatting (3DGS) for generating large-scale or infinite terrains from a single captured exemplar. The core idea is to create a tile-based system using Wang Tiles, where each tile represents a local Gaussian field. These tiles are designed with boundary constraints to ensure seamless transitions between adjacent tiles, enabling stochastic yet continuous tiling of Gaussian fields over arbitrary surfaces.\n\nThe GSWT pipeline begins with reconstructing a 3DGS exemplar at multiple Levels of Detail (LODs) from multi-view images. For each LOD, the method generates a Wang Tile set by sampling edge and center patches and applying a semantic-aware graph cut algorithm. Before rendering, the tiles are pre-sorted for efficient sort-free splatting.\n\nDuring runtime, the system performs tiling on the fly, enabling efficient GSWT-based terrain synthesis and rendering. The paper also introduces rendering optimizations specifically designed for the unique characteristics of 3DGS Wang Tiles, leading to real-time rendering of large-scale 3DGS terrains. The authors promise code, dataset, and a demo for further exploration. The paper is set to be presented at SIGGRAPH Asia 2025.\n",
    "chinese_title": "GSWT：高斯溅射王氏瓦片",
    "chinese_summary": "本文介绍了一种名为GSWT（高斯溅射王氏砖）的新颖框架，该框架扩展了3D高斯溅射（3DGS）的功能，能够从单个捕获的样本生成大规模或无限地形。其核心思想是使用王氏砖创建一个基于瓦片的系统，其中每个瓦片代表一个局部高斯场。这些瓦片的设计具有边界约束，以确保相邻瓦片之间的无缝过渡，从而能够在任意表面上实现高斯场的随机且连续的平铺。\n\nGSWT流程首先从多视图图像重建多个细节级别（LOD）的3DGS样本。对于每个LOD，该方法通过采样边缘和中心块并应用语义感知的图割算法来生成王氏砖集合。在渲染之前，瓦片会进行预排序，以便进行高效的无排序溅射。\n\n在运行时，系统会动态执行平铺，从而实现高效的基于GSWT的地形合成和渲染。本文还介绍了专门为3DGS王氏砖的独特特性设计的渲染优化，从而实现大规模3DGS地形的实时渲染。作者承诺提供代码、数据集和演示，以供进一步探索。该论文计划在SIGGRAPH Asia 2025上发表。"
  },
  {
    "id": "46135627",
    "title": "Why are my headphones buzzing whenever I run my game?",
    "url": "https://alexene.dev/2025/12/03/Why-do-my-headphones-buzz-when-i-run-my-game.html",
    "summary": "The author was experiencing a buzzing sound in their headphones specifically when running their isometric game, despite other graphically intensive games running fine. The headphones were connected via USB to a MODI 2 DAC, powered by a USB port on the computer.\n\nThe author initially suspected a power issue but ruled it out as larger games didn't trigger the buzzing. Through a process of elimination, they discovered the buzzing was linked to the game's rendering pipeline and, more specifically, the frequent copying of a \"picking texture\" from the GPU to the CPU. This texture was used for mouse-click object selection, allowing the game to identify which object the player clicked on. Disabling the texture transfer eliminated the buzzing, and reducing the transfer frequency lessened the noise.\n\nThe root cause was identified as the rapid switching of the GPU between full load and idle states, caused by transferring the entire picking texture every frame. This sudden power fluctuation through the USB port was interfering with the MODI 2 DAC and causing the buzzing. The solution was to only download the relevant pixel from the picking texture, significantly reducing GPU workload fluctuations and eliminating the buzzing. As a secondary solution, the author could have used a different power source for their MODI 2 DAC.\n",
    "chinese_title": "为什么我玩游戏的时候耳机总是有嗡嗡声？",
    "chinese_summary": "作者在使用等距视角游戏时，耳机中出现嗡嗡声，而运行其他图形密集型游戏时则无此问题。耳机通过USB连接至MODI 2 DAC，并由电脑上的USB端口供电。\n\n作者最初怀疑是电源问题，但由于更大的游戏不会触发嗡嗡声而排除了该可能性。通过排除法，他们发现嗡嗡声与游戏的渲染管线有关，更具体地说，与频繁将“拾取纹理”从GPU复制到CPU有关。该纹理用于鼠标点击对象选择，使游戏能够识别玩家点击的对象。禁用纹理传输消除了嗡嗡声，降低传输频率则减轻了噪音。\n\n根本原因是GPU在满载和空闲状态之间快速切换，这是由于每帧传输整个拾取纹理造成的。这种通过USB端口的突然功率波动干扰了MODI 2 DAC，导致嗡嗡声。解决方案是仅下载拾取纹理中的相关像素，从而显著减少GPU负载波动并消除嗡嗡声。作为次要解决方案，作者可以使用不同的电源为MODI 2 DAC供电。"
  },
  {
    "id": "46050855",
    "title": "A Look at Rust from 2012",
    "url": "https://purplesyringa.moe/blog/a-look-at-rust-from-2012/",
    "summary": "This blog post provides a fascinating look at Rust as it existed in 2012 (around versions 0.5-0.6), based on the official tutorial from that era. It highlights significant differences from modern Rust, particularly in areas like installation, syntax, memory management, concurrency, and the module system.\n\nKey differences include a manual installation process involving tarballs and MinGW, the absence of `println!` in favor of `fmt!`, and the use of `uint` and `int` for `usize` and `isize` respectively. Syntax was generally more verbose, with trait implementations written as `impl Type: Trait`.\n\nA significant divergence was in memory management, with the existence of `@T` (task-local garbage collected heap), `~T` (owned, sendable objects), and `&T` references with different mutability semantics. Unlike modern Rust, `&mut T` did not guarantee unique access, and `&T` was closer to `&UnsafeCell<T>` in its behavior. Rust also featured green threads and lightweight tasks, communicating through message passing via a built-in `spsc` pipe. Panics, then called exceptions, would bring down the entire task.\n\nThe article also details the lack of Cargo and `Cargo.toml`, instead relying on crate metadata specified in the root file. Structs were C-compatible by default, and visibility was controlled with `pub` and `priv` keywords. Finally, the post highlights \"do expressions\" a now defunct mechanism for creating control flow structures, and push-style iterators that existed before the move to pull iterators.\n",
    "chinese_title": "2012年的Rust一览",
    "chinese_summary": "这篇博文基于 2012 年左右（大约 0.5-0.6 版本）的官方教程，饶有趣味地展现了当时的 Rust。它突出了与现代 Rust 的显著差异，尤其是在安装、语法、内存管理、并发和模块系统等方面。\n\n主要区别包括涉及 tarball 和 MinGW 的手动安装过程，使用 `fmt!` 而不是 `println!`，以及使用 `uint` 和 `int` 分别代替 `usize` 和 `isize`。语法通常更加冗长，trait 的实现写作 `impl Type: Trait`。\n\n一个显著的分歧在于内存管理，存在 `@T` (任务本地垃圾回收堆)、`~T` (拥有的、可发送的对象) 和具有不同可变性语义的 `&T` 引用。与现代 Rust 不同，`&mut T` 不保证独占访问，并且 `&T` 的行为更接近于 `&UnsafeCell<T>`。Rust 还具有绿色线程和轻量级任务，通过内置的 `spsc` 管道进行消息传递通信。当时的 Panics，被称为 exceptions，会使整个任务崩溃。\n\n该文章还详细介绍了缺少 Cargo 和 `Cargo.toml`，而是依赖于根文件中指定的 crate 元数据。结构体默认与 C 兼容，可见性由 `pub` 和 `priv` 关键字控制。最后，这篇文章重点介绍了 \"do expressions\"——一种现已废弃的用于创建控制流结构的机制，以及在过渡到拉取迭代器之前存在的推送式迭代器。"
  },
  {
    "id": "46136067",
    "title": "Critical RCE Vulnerabilities in React and Next.js",
    "url": "https://www.wiz.io/blog/critical-vulnerability-in-react-cve-2025-55182",
    "summary": "This article details critical Remote Code Execution (RCE) vulnerabilities, CVE-2025-55182 in React and CVE-2025-66478 in Next.js, affecting React Server Components (RSC) and the \"Flight\" protocol. The vulnerabilities stem from insecure deserialization of RSC payloads, allowing attackers to execute arbitrary code on the server via crafted HTTP requests. Exploitation is highly reliable and requires no prior authentication.\n\nStandard configurations of Next.js applications built with `create-next-app` are vulnerable by default. Wiz Research indicates that 39% of cloud environments contain vulnerable instances.\n\nThe root cause lies within the `react-server` package's unsafe handling of RSC payloads. Affected products include React versions 19.0, 19.1, and 19.2, and Next.js versions 14.3.0-canary, 15.x, and 16.x (App Router). The article strongly advises immediate patching to the hardened releases: React (19.0.1, 19.1.2, 19.2.1) and Next.js (14.3.0-canary.88, and multiple 15.x and 16.x versions ending with .7 or .8 listed in the original article). Users of other RSC-enabled frameworks like Redwood and Waku should also check for updates. Wiz customers can utilize the Wiz Threat Center for vulnerability detection. Due to the severity, specific technical details are being withheld to allow for widespread patching before public disclosure.\n",
    "chinese_title": "React和Next.js存在严重RCE漏洞",
    "chinese_summary": "本文详细介绍了React中的CVE-2025-55182和Next.js中的CVE-2025-66478关键远程代码执行(RCE)漏洞，这些漏洞影响React服务器组件(RSC)和“Flight”协议。漏洞源于RSC有效载荷的不安全反序列化，允许攻击者通过精心设计的HTTP请求在服务器上执行任意代码。利用非常可靠，无需事先身份验证。\n\n使用`create-next-app`构建的Next.js应用程序的标准配置默认存在漏洞。Wiz Research表明，39%的云环境包含易受攻击的实例。\n\n根本原因在于`react-server`包对RSC有效载荷的不安全处理。受影响的产品包括React 19.0、19.1和19.2版本，以及Next.js 14.3.0-canary、15.x和16.x版本（App Router）。强烈建议立即修补到强化版本：React (19.0.1、19.1.2、19.2.1) 和 Next.js (14.3.0-canary.88，以及原始文章中列出的多个以.7或.8结尾的15.x和16.x版本)。Redwood和Waku等其他启用RSC的框架的用户也应检查更新。Wiz客户可以利用Wiz威胁中心进行漏洞检测。由于其严重性，具体技术细节将被保留，以便在公开披露前进行广泛修补。"
  },
  {
    "id": "46135784",
    "title": "Critical Security Vulnerability in React Server Components",
    "url": "https://react.dev/blog/2025/12/03/critical-security-vulnerability-in-react-server-components",
    "summary": "On December 3, 2025, the React Team announced a critical unauthenticated remote code execution (RCE) vulnerability, CVE-2025-55182 (CVSS 10.0), affecting React Server Components. The vulnerability lies in how React decodes payloads sent to React Server Function endpoints, potentially allowing attackers to execute arbitrary code on the server.\n\nEven if an app doesn't explicitly use React Server Functions, it's vulnerable if it supports React Server Components. Affected packages include `react-server-dom-webpack`, `react-server-dom-parcel`, and `react-server-dom-turbopack` versions 19.0, 19.1.0, 19.1.1, and 19.2.0.\n\nImmediate action is required to upgrade to versions 19.0.1, 19.1.2, or 19.2.1. If React code doesn't use a server, or the app doesn't use frameworks/bundlers that support React Server Components, it's not affected.\n\nAffected frameworks and bundlers include Next.js, React Router, Waku, @parcel/rsc, @vitejs/plugin-rsc, and rwsdk, with specific upgrade instructions provided for each. Hosting providers have implemented temporary mitigations, but immediate updates are still crucial.\n\nThe vulnerability was reported on November 29th, confirmed on November 30th, a fix was created by December 1st, and publicly disclosed on December 3rd. The report credits Lachlan Davidson for discovering and reporting the vulnerability.\n",
    "chinese_title": "React 服务端组件中的严重安全漏洞",
    "chinese_summary": "2025年12月3日，React团队宣布了一个严重未经身份验证的远程代码执行（RCE）漏洞，CVE-2025-55182（CVSS 10.0），影响React服务端组件。该漏洞存在于React解码发送到React服务端函数端点的负载的方式中，可能允许攻击者在服务器上执行任意代码。\n\n即使应用程序没有明确使用React服务端函数，如果它支持React服务端组件，也存在漏洞。受影响的软件包包括`react-server-dom-webpack`、`react-server-dom-parcel`和`react-server-dom-turbopack`的19.0、19.1.0、19.1.1和19.2.0版本。\n\n需要立即采取行动升级到19.0.1、19.1.2或19.2.1版本。如果React代码不使用服务器，或者应用程序不使用支持React服务端组件的框架/打包器，则不受影响。\n\n受影响的框架和打包器包括Next.js、React Router、Waku、@parcel/rsc、@vitejs/plugin-rsc和rwsdk，每个框架和打包器都提供了具体的升级说明。托管提供商已实施临时缓解措施，但立即更新仍然至关重要。\n\n该漏洞于11月29日报告，11月30日确认，12月1日创建了修复程序，并于12月3日公开披露。报告感谢Lachlan Davidson发现并报告了该漏洞。"
  },
  {
    "id": "46133141",
    "title": "Are we repeating the telecoms crash with AI datacenters?",
    "url": "https://martinalderson.com/posts/are-we-really-repeating-the-telecoms-crash-with-ai-datacenters/",
    "summary": "This article argues against the common comparison between the current AI datacenter boom and the 2000s telecoms crash. While both involve massive infrastructure spending and bubble concerns, the underlying fundamentals differ significantly.\n\nThe telecoms crash was fueled by a gross overestimation of internet traffic growth (4x overestimated), coupled with exponential improvements in fiber optic technology that rendered existing infrastructure obsolete. This resulted in vast amounts of unused \"dark fiber.\"\n\nIn contrast, AI datacenters face slowing GPU performance per watt improvements and rising power consumption, indicating that existing hardware isn't rapidly becoming obsolete. Furthermore, demand for AI computing power, particularly with the rise of AI agents, is potentially being underestimated, not overestimated. The transition from simple chat to complex AI agents is anticipated to drive a massive surge in token consumption, potentially surpassing current infrastructure capabilities.\n\nWhile the article acknowledges the possibility of a short-term correction due to factors like slower agent adoption, financial market instability, or unexpected efficiency breakthroughs, it emphasizes that this would be a timing issue, not a fundamental collapse. Overbuilt AI infrastructure would likely be utilized eventually, unlike the permanently dark fiber of the telecoms era. Rational overbuilding stems from the Prisoner's Dilemma: It is less risky to overbuild and waste capital than underbuild and lose ground in the \"AI wars\".\n\nThe author concludes that the key risk is timing, not direction. Building infrastructure \"too early\" for demand growth may lead to a period of financial pain, but it's fundamentally different from building for demand that never materializes while technology makes it obsolete.\n",
    "chinese_title": "我们会在AI数据中心重蹈电信业崩溃的覆辙吗？",
    "chinese_summary": "本文反驳了当前人工智能数据中心热潮与2000年代电信崩盘之间的常见比较。虽然两者都涉及大规模基础设施支出和泡沫担忧，但其根本基础存在显著差异。\n\n电信崩盘是由对互联网流量增长的严重高估（高估了4倍），以及光纤技术的指数级进步造成的，这使得现有基础设施过时。这导致了大量未使用的“暗光纤”。\n\n相比之下，人工智能数据中心面临着每瓦GPU性能提升速度放缓和功耗上升的问题，这表明现有硬件不会迅速过时。此外，对人工智能计算能力的需求，特别是随着人工智能代理的兴起，可能被低估，而不是高估。从简单的聊天到复杂的人工智能代理的转变预计将推动token消耗的大幅增长，可能超过当前的基础设施能力。\n\n虽然本文承认由于诸如代理采用速度放缓、金融市场不稳定或意外的效率突破等因素，可能出现短期调整，但它强调这只是一个时间问题，而不是根本性的崩溃。过度建设的人工智能基础设施最终可能会被利用，这与电信时代永久黑暗的光纤不同。 理性过度建设源于囚徒困境：过度建设并浪费资本的风险低于建设不足并在“人工智能战争”中失去阵地。\n\n作者得出结论，关键风险在于时机，而非方向。 为需求增长“过早”建设基础设施可能会导致一段财务痛苦期，但它与为永远无法实现的需求而建设基础设施，同时技术使其过时，有着根本的不同。"
  },
  {
    "id": "46131406",
    "title": "Zig quits GitHub, says Microsoft's AI obsession has ruined the service",
    "url": "https://www.theregister.com/2025/12/02/zig_quits_github_microsoft_ai_obsession/",
    "summary": "The Zig programming language project is leaving GitHub for Codeberg, citing a decline in engineering excellence at the Microsoft-owned platform, driven by an overemphasis on AI. Andrew Kelly, president of the Zig Software Foundation, criticized GitHub Actions for persistent bugs, particularly a \"safe_sleep.sh\" script issue that caused 100% CPU usage and runner failures due to \"vibe-scheduling.\" This bug, reported in April 2025 but stemming from a 2022 code change, went unaddressed for an extended period despite being easily identifiable.\n\nJeremy Howard echoed concerns about GitHub Actions' poor state, highlighting the lengthy delay in fixing the CPU usage issue. Another software project, Dillo browser, is also migrating away from GitHub due to concerns about JavaScript reliance, service denial risks, usability issues, inadequate moderation, and the platform's focus on generative AI.\n\nCodeberg has seen a doubling of its supporting membership since January, suggesting that more developers are choosing to migrate away from Github.  While GitHub's overall user numbers remain high, its focus on AI, specifically GitHub Copilot, has led to significant revenue growth, accounting for approximately 40% of annual revenue growth in Q4 2024.\n",
    "chinese_title": "Zig 退出 GitHub，称微软对人工智能的痴迷毁了这项服务",
    "chinese_summary": "The Zig programming language project is leaving GitHub for Codeberg, citing a decline in engineering excellence at the Microsoft-owned platform, driven by an overemphasis on AI. Andrew Kelly, president of the Zig Software Foundation, criticized GitHub Actions for persistent bugs, particularly a \"safe_sleep.sh\" script issue that caused 100% CPU usage and runner failures due to \"vibe-scheduling.\" This bug, reported in April 2025 but stemming from a 2022 code change, went unaddressed for an extended period despite being easily identifiable.\n\nJeremy Howard echoed concerns about GitHub Actions' poor state, highlighting the lengthy delay in fixing the CPU usage issue. Another software project, Dillo browser, is also migrating away from GitHub due to concerns about JavaScript reliance, service denial risks, usability issues, inadequate moderation, and the platform's focus on generative AI.\n\nCodeberg has seen a doubling of its supporting membership since January, suggesting that more developers are choosing to migrate away from Github.  While GitHub's overall user numbers remain high, its focus on AI, specifically GitHub Copilot, has led to significant revenue growth, accounting for approximately 40% of annual revenue growth in Q4 2024.\n"
  },
  {
    "id": "46134178",
    "title": "Helldivers 2 devs slash install size from 154GB to 23GB",
    "url": "https://www.tomshardware.com/video-games/pc-gaming/helldivers-2-install-size-slashed-from-154gb-to-just-23gb-85-percent-reduction-accomplished-by-de-duplicating-game-data-an-optimization-for-older-mechanical-hard-drives",
    "summary": "Helldivers 2 developers, Arrowhead Game Studios, with help from Nixxes Software, have drastically reduced the game's install size from 154GB to 23GB, a cut of 85%. This significant reduction was achieved by de-duplicating game data that was initially optimized for mechanical hard drives (HDDs). The initial large size was to reduce loading times on HDDs by duplicating data. However, Arrowhead's data measurements showed that loading times only increased by a few seconds for the 11% of players using HDDs, and the primary factor in loading time is level generation, which occurs in parallel with asset loading. This change is a win for PC gamers with SSDs, freeing up significant storage space. The new \"slim\" version of Helldivers 2 is available as a beta update on Steam, offering the same experience with a smaller installation size. All progress, purchases, and war contributions will carry over. The comments section reflects discussions on the necessity of SSDs for modern gaming and frustration about accommodating players with older hardware, particularly HDDs, at the expense of larger file sizes for everyone else.\n",
    "chinese_title": "地狱潜者2开发商将安装包大小从154GB缩减至23GB",
    "chinese_summary": "《地狱潜者2》开发商Arrowhead Game Studios，在Nixxes Software的协助下，已将游戏安装包大小从154GB大幅缩减至23GB，降幅达85%。 这一显著缩减是通过去除最初为机械硬盘(HDD)优化而重复的游戏数据来实现的。 最初的大体积是为了通过复制数据来减少HDD上的加载时间。 然而，Arrowhead的数据测量表明，对于11%使用HDD的玩家来说，加载时间仅增加了几秒钟，并且加载时间的主要因素是关卡生成，它与资源加载并行发生。 这一改变对于拥有SSD的PC游戏玩家来说是一次胜利，释放了大量的存储空间。 新的“精简版”《地狱潜者2》已作为Steam上的beta更新提供，在安装体积更小的情况下提供相同的体验。 所有进度、购买和战争贡献都将保留。 评论区反映了关于现代游戏是否需要SSD的讨论，以及关于为了迁就使用旧硬件（特别是HDD）的玩家，而牺牲所有玩家更大文件大小的挫败感。"
  },
  {
    "id": "46130335",
    "title": "Interview with RollerCoaster Tycoon's Creator, Chris Sawyer (2024)",
    "url": "https://medium.com/atari-club/interview-with-rollercoaster-tycoons-creator-chris-sawyer-684a0efb0f13",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "云霄飞车大亨创始人克里斯·索耶访谈 (2024)",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "46135008",
    "title": "Mapping Every Dollar of America's $5T Healthcare System",
    "url": "https://healthisotherpeople.substack.com/p/an-abominable-creature",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "绘制美国5万亿美元医疗系统的每一分钱流向",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "46058154",
    "title": "The Writing Is on the Wall for Handwriting Recognition",
    "url": "https://newsletter.dancohen.org/archive/the-writing-is-on-the-wall-for-handwriting-recognition/",
    "summary": "In \"The Writing Is on the Wall for Handwriting Recognition,\" Dan Cohen announces a significant breakthrough in AI's ability to accurately transcribe handwritten text, solving a long-standing challenge in digital humanities. He uses his experience deciphering the handwriting of mathematician George Boole as a case study, contrasting the laborious manual process with the remarkable accuracy of Google's Gemini 3 Pro.\n\nWhile previous attempts at Handwritten Text Recognition (HTR) struggled, Gemini 3 Pro demonstrates near-perfect transcription of 19th-century letters from Boole, Charles Carroll, and even the challenging cross-writing of Jane Austen. Notably, Gemini provides detailed reasoning for its interpretations, mirroring the analytical steps taught in paleography.\n\nCohen argues that this advancement allows researchers to focus on deeper interpretive work rather than the tedious task of deciphering text. He advocates for using AI's HTR capabilities to enhance human understanding, suggesting it as a teaching tool to guide students through the process of deciphering historical documents. While acknowledging the value of immersive archival research, he recognizes the time constraints facing modern historians and highlights the importance of tools like Tropy and Sourcery that, combined with AI-powered HTR, streamline the research process. Ultimately, Cohen envisions AI as a means to reduce research monotony, freeing up time for more meaningful human activities and connection.\n",
    "chinese_title": "手写识别大势已去",
    "chinese_summary": "手写识别面临末日？\n\n丹·科恩宣布人工智能在准确转录手写文本方面取得重大突破，解决了数字人文领域长期存在的挑战。他以解读数学家乔治·布尔手稿的经验为例，对比了费力的人工过程与谷歌 Gemini 3 Pro 的卓越准确性。\n\n尽管先前的手写文本识别(HTR)尝试举步维艰，Gemini 3 Pro 却展示了对来自布尔、查尔斯·卡罗尔，甚至简·奥斯汀极具挑战性的交叉书写 19 世纪信件的近乎完美的转录。值得注意的是，Gemini 为其解读提供了详细的推理，反映了古文字学中教授的分析步骤。\n\n科恩认为，这一进展使研究人员能够专注于更深入的诠释性工作，而不是繁琐的解读文本任务。他提倡利用人工智能的 HTR 能力来增强人类的理解，并建议将其作为一种教学工具，指导学生完成解读历史文献的过程。在承认沉浸式档案研究的价值的同时，他也认识到现代历史学家面临的时间限制，并强调了 Tropy 和 Sourcery 等工具的重要性，这些工具与人工智能驱动的 HTR 相结合，可以简化研究过程。最终，科恩设想人工智能是一种减少研究单调性的手段，从而腾出时间进行更有意义的人类活动和连接。"
  },
  {
    "id": "46083133",
    "title": "universal-tbxi-patchset: Mac OS New World ROM patchset to boot System 7.5",
    "url": "https://github.com/Wack0/universal-tbxi-patchset",
    "summary": "This document describes the \"universal-tbxi-patchset,\" a collection of patches designed to modify classic Mac OS New World Toolbox ROM images (TBXI) version 1.2 and later, enabling them to boot older versions of the Mac OS, specifically System 7.5 and above. The original TBXI images had certain code removed that was necessary for the earlier systems to function.\n\nThe patchset focuses on three main areas:\n\n*   **m68k_patch:** This patchset restores various Toolbox implementations removed over different TBXI versions, including Program-to-Program Communication Toolbox, Sound Toolbox, Communications Toolbox, Event Manager, Picture Utilities, Text Services Manager, and Icon Utilities. It also addresses function table initialization issues.\n*   **ProcessMgrSupport:** This addresses a change in the initialisation of ProcessMgrSupport.pef between TBXI versions. The patchset provides both the old and new initialisation formats to support both early and later System files.\n*   **InterfaceLib patches:** These patches address changes to the File Control Block (FCB) format introduced in Mac OS 9.0. It provides manual patch instructions (and specific offsets for TBXI v10.2.1) for functions dealing with FCBs in InterfaceLib to prevent system errors when running older System versions on newer TBXIs.\n\nThe document also mentions known issues, such as crashes with the Date & Time Control Panel in System 7.x when using a patched v10.2.1 TBXI, and cautions that the patched system may not be stable.\n",
    "chinese_title": "universal-tbxi-patchset：用于启动System 7.5的Mac OS New World ROM补丁集",
    "chinese_summary": "本文档描述了“universal-tbxi-patchset”，这是一个补丁集合，旨在修改经典 Mac OS New World Toolbox ROM 镜像 (TBXI) 1.2 及更高版本，使其能够启动较早版本的 Mac OS，特别是 System 7.5 及更高版本。原始的 TBXI 镜像删除了一些早期系统运行所需的代码。\n\n该补丁集合主要关注三个方面：\n\n*   **m68k_patch:** 此补丁集合恢复了不同 TBXI 版本中删除的各种 Toolbox 实现，包括程序间通信工具箱、声音工具箱、通信工具箱、事件管理器、图片实用程序、文本服务管理器和图标实用程序。它还解决了函数表初始化问题。\n*   **ProcessMgrSupport:** 这解决了 TBXI 版本之间 ProcessMgrSupport.pef 初始化方式的更改。该补丁集合同时提供新旧初始化格式，以支持早期和后期的系统文件。\n*   **InterfaceLib patches:** 这些补丁解决了 Mac OS 9.0 中引入的文件控制块 (FCB) 格式的更改。它提供了手动补丁说明（以及 TBXI v10.2.1 的特定偏移量），用于修复 InterfaceLib 中处理 FCB 的函数，以防止在较新的 TBXI 上运行较旧的系统版本时出现系统错误。\n\n本文档还提到了已知问题，例如在使用打过补丁的 v10.2.1 TBXI 时，System 7.x 中的“日期和时间”控制面板会崩溃，并警告说打过补丁的系统可能不稳定。"
  },
  {
    "id": "46054467",
    "title": "Super fast aggregations in PostgreSQL 19",
    "url": "https://www.cybertec-postgresql.com/en/super-fast-aggregations-in-postgresql-19/",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "PostgreSQL 19 中的超快速聚合",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "46124267",
    "title": "Anthropic acquires Bun",
    "url": "https://bun.com/blog/bun-joins-anthropic",
    "summary": "Bun, the all-in-one JavaScript runtime, bundler, and package manager, has been acquired by Anthropic. This move is driven by Anthropic's belief in Bun as critical infrastructure for Claude Code, Claude Agent SDK, and future AI coding tools.\n\nDespite the acquisition, Bun will remain open-source (MIT-licensed), actively maintained by the same team, and developed publicly on GitHub. Its roadmap will continue to prioritize high-performance JavaScript tooling, Node.js compatibility, and serving as a Node.js replacement.\n\nThe acquisition provides Bun with long-term stability, resources, and a front-row seat to the future of AI-driven software development. By aligning with Anthropic, Bun aims to become the best platform for building, running, and testing AI-driven software. This partnership offers a path to sustainability, bypassing the typical VC-backed startup's monetization struggles and allowing the team to focus on improving Bun's core functionalities. Anthropic benefits from Bun's speed and single-file executables, which are well-suited for distributing AI coding tools. In essence, this acquisition allows Bun to focus on its core mission while contributing to the cutting edge of AI coding.\n",
    "chinese_title": "Anthropic 收购 Bun",
    "chinese_summary": "Bun已被Anthropic收购：专注AI驱动的软件开发"
  },
  {
    "id": "46132531",
    "title": "Anthropic reportedly preparing for $300B IPO",
    "url": "https://vechron.com/2025/12/anthropic-hires-wilson-sonsini-ipo-2026-openai-race/",
    "summary": "Anthropic, the company behind the Claude chatbot, is reportedly preparing for a potential IPO as early as 2026, aiming for a valuation exceeding $300 billion. The company has enlisted Wilson Sonsini Goodrich & Rosati, a firm experienced in guiding tech companies to market, to assist with the process.\n\nThis move positions Anthropic to potentially precede rival OpenAI in the public market, testing investor appetite for AI companies with significant spending and ongoing losses. While discussions are still preliminary and no underwriters have been chosen, Anthropic has stated they haven't made any final decisions about going public.\n\nThe IPO preparations coincide with a private funding round potentially valuing Anthropic above $300 billion, with reported commitments of $15 billion from Microsoft and Nvidia. Anthropic has also pledged to spend $30 billion on Microsoft's cloud platform. CEO Dario Amodei projects significant revenue growth, anticipating an annualized revenue of $26 billion next year, fueled by an expanding customer base.\n\nInternal preparations for public-market requirements are underway, including the hiring of a new CFO and focusing on governance, accounting, and disclosure practices. While OpenAI is also conducting similar preliminary work, they have indicated that a listing is not imminent. Both companies face the challenge of demonstrating profitability while investing heavily in model training and infrastructure, as Anthropic plans a $50 billion data center build-out and workforce expansion.\n",
    "chinese_title": "Anthropic 据报道正准备进行 3000 亿美元的首次公开募股。",
    "chinese_summary": "据报道，Claude聊天机器人的开发公司Anthropic正准备最早于2026年进行首次公开募股（IPO），目标估值超过3000亿美元。该公司已聘请在指导科技公司上市方面经验丰富的威尔逊·桑西尼·古德里奇·罗萨蒂律师事务所协助处理此事。\n\n此举使Anthropic有可能先于竞争对手OpenAI进入公开市场，测试投资者对支出巨大且持续亏损的人工智能公司的投资意愿。虽然讨论仍处于初步阶段，且尚未选择承销商，但Anthropic表示尚未就上市做出任何最终决定。\n\nIPO准备工作与一轮可能将Anthropic估值超过3000亿美元的私募融资同时进行，据报道，微软和英伟达承诺投资150亿美元。Anthropic还承诺在微软的云平台上花费300亿美元。首席执行官Dario Amodei预计收入将大幅增长，预计明年年化收入将达到260亿美元，这得益于不断扩大的客户群。\n\n公司内部正为公开市场要求做准备，包括聘请新的首席财务官，并专注于治理、会计和披露实践。虽然OpenAI也在进行类似的初步工作，但他们表示上市并非迫在眉睫。两家公司都面临着在大量投资于模型训练和基础设施的同时，证明盈利能力这一挑战，Anthropic计划斥资500亿美元建设数据中心并扩大员工队伍。"
  },
  {
    "id": "46135661",
    "title": "VA staff flag dangerous errors in Oracle-built electronic health record",
    "url": "https://www.washingtonpost.com/investigations/2025/12/03/veterans-administration-va-hospitals-health/",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "退伍军人事务部员工指出甲骨文构建的电子健康记录存在危险错误",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "46126217",
    "title": "Paged Out",
    "url": "https://pagedout.institute",
    "summary": "\"Paged Out!\" is a free, community-driven technical magazine focusing on programming, hacking, security, retro/modern computers, electronics, and demoscene topics. Each article occupies a single page. The magazine operates on a not-for-profit basis, ensuring all issues are free to download, share, and print. Printed copies are available at events and through print-on-demand services like lulu.com, sometimes with sponsorship options.\n\nThe website lists available issues, starting from Issue #1 (Aug'19) to the latest, Issue #7 (Oct'25). Each issue entry includes:\n\n*   A brief description or title.\n*   Download counter.\n*   Print counter (manually updated).\n*   Download links for the web PDF version of the issue.\n*   Download links for wallpapers related to the issue's cover art in various formats (JPG, PNG, 8K).\n*   Links to purchase printed versions on lulu.com, with options for normal and sponsorship editions.\n*   Credit to the cover artist.\n\nSome issues are marked as \"beta builds,\" indicating ongoing improvements and missing elements like PDFs optimized for printing with bleed. The site also features a \"Next issue progress tracker,\" which shows how many articles are ready or in review for the next issue. Readers can subscribe to an email newsletter or use RSS/Atom feeds to receive notifications about new issue releases. The website encourages contributions from the community in the form of single-page articles.\n",
    "chinese_title": "页面调出",
    "chinese_summary": "《Paged Out!》是一本免费的、社区驱动的技术杂志，专注于编程、黑客技术、安全、复古/现代计算机、电子学和演示场景话题。每篇文章占据一页。该杂志以非营利方式运作，确保所有期刊都可以免费下载、分享和打印。印刷版可在活动中获取，也可通过lulu.com等按需印刷服务获得，有时还提供赞助选项。\n\n网站列出了可用的期刊，从第1期（2019年8月）到最新第7期（2025年10月）。每期条目包括：\n\n*   简短的描述或标题。\n*   下载计数器。\n*   印刷计数器（手动更新）。\n*   该期网络PDF版本的下载链接。\n*   与该期封面艺术相关的各种格式（JPG、PNG、8K）壁纸的下载链接。\n*   在lulu.com上购买印刷版本的链接，可以选择普通版和赞助版。\n*   封面艺术家署名。\n\n一些期刊被标记为“测试版本”，表示正在进行改进，并且缺少诸如针对出血印刷优化的PDF等元素。该网站还设有“下一期进度追踪器”，显示下一期有多少文章已准备就绪或正在审核中。读者可以订阅电子邮件新闻通讯或使用RSS/Atom订阅源，以接收有关新期刊发布的通知。该网站鼓励社区以单页文章的形式进行投稿。"
  },
  {
    "id": "46133422",
    "title": "The \"Mad Men\" in 4K on HBO Max Debacle",
    "url": "http://fxrant.blogspot.com/2025/12/the-mad-men-in-4k-on-hbo-max-debacle.html",
    "summary": "Todd Vaziri's blog post details a significant quality control issue with the new 4K \"restoration\" of \"Mad Men\" on HBO Max. The issue is that the streamed versions of episodes, particularly in season one, are missing digital visual effects that were present in the original broadcasts and home video releases.\n\nThe most glaring example is a scene where Roger Sterling vomits, and the hose and technicians used to create the effect are visible in the HBO Max version. This reveals raw, unedited footage before digital effects were applied. Other examples include missing period-accurate alterations to filming locations and the absence of introductory text at the beginning of the first episode.\n\nVaziri emphasizes that this issue is distinct from the controversial practice of reframing older 4:3 shows to 16:9, as \"Mad Men\" was already mastered in 16:9. He provides visual comparisons between the Blu-ray versions and the HBO Max streams to illustrate the missing effects and altered episode titles. The author also highlights that the initial episode order on HBO Max was jumbled, but has since been corrected.\n\nThe author suggests the mishaps reflect poorly on Lionsgate and HBO Max, potentially turning the highly anticipated 4K debut into a cautionary tale about quality control in media restoration. The article promises updates as the situation develops.\n",
    "chinese_title": "《广告狂人》HBO Max 4K版惨败",
    "chinese_summary": "托德·瓦齐里博文详细描述了HBO Max上新4K“修复”版《广告狂人》的一个重大质量控制问题。问题在于，剧集流媒体版本，尤其是在第一季中，缺少了原版播出和家庭视频发行版中存在的数字视觉特效。\n\n最明显的例子是罗杰·斯特林呕吐的场景，在HBO Max版本中可以看到用于制造效果的软管和技术人员。这揭示了应用数字特效之前的原始、未编辑的片段。其他例子包括拍摄地点缺少符合时代背景的修改，以及第一集开头缺少介绍文字。\n\n瓦齐里强调，这个问题不同于将旧4:3节目重新构图为16:9的有争议的做法，因为《广告狂人》已经以16:9格式制作。他提供了蓝光版本和HBO Max流媒体之间的视觉比较，以说明缺失的特效和修改后的剧集标题。作者还强调，HBO Max上的初始剧集顺序是混乱的，但此后已得到纠正。\n\n作者认为，这些失误对狮门影业和HBO Max产生了不良影响，有可能将备受期待的4K首秀变成一个关于媒体修复中质量控制的警示故事。文章承诺随着情况发展会进行更新。"
  },
  {
    "id": "46130907",
    "title": "Researchers Find Microbe Capable of Producing Oxygen from Martian Soil",
    "url": "https://scienceclock.com/microbe-that-could-turn-martian-dust-into-oxygen/",
    "summary": "Researchers have identified a microbe, *Chroococcidiopsis*, an extremophile, capable of producing oxygen using resources found in Martian soil (regolith). This is a significant discovery for the potential of establishing human settlements on Mars, as transporting oxygen from Earth is impractical.\n\nThe microbe thrives in soil mimicking Martian conditions, extracting nutrients and releasing oxygen. Its resilience extends to surviving extreme radiation and low-pressure environments, even repairing DNA damage after rehydration. This makes *Chroococcidiopsis* a promising candidate for a biological oxygen production system on Mars.\n\nWhile challenges remain in scaling its cultivation and ensuring its productivity under Martian conditions, this discovery represents a crucial step forward. It raises the possibility of \"farming\" oxygen on Mars, creating closed-loop systems for food, water, and oxygen production, reducing dependence on Earth resupply. The finding also fuels the broader question of life's potential to exist in other extreme environments within our solar system, highlighting the adaptability of extremophiles. The ongoing research focuses on integrating microbial oxygen production into comprehensive, self-sustaining life support systems for future Martian settlements.\n",
    "chinese_title": "研究人员发现一种能从火星土壤中产生氧气的微生物",
    "chinese_summary": "研究人员发现了一种极端微生物——球形蓝细菌 (*Chroococcidiopsis*)，它能够利用火星土壤（风化层）中的资源产生氧气。 这对于在火星上建立人类定居点的潜力来说是一项重大发现，因为从地球运输氧气是不切实际的。\n\n该微生物在模拟火星条件下的土壤中茁壮成长，提取养分并释放氧气。 它的复原力扩展到在极端辐射和低压环境中生存，甚至在补水后修复DNA损伤。 这使得球形蓝细菌成为火星上生物制氧系统的一个有希望的候选者。\n\n虽然在扩大其培养规模并确保其在火星条件下生产力方面仍然存在挑战，但这一发现代表着向前迈出的关键一步。 它提出了在火星上“种植”氧气的可能性，从而为食物、水和氧气生产创造闭环系统，减少对地球补给的依赖。 这一发现也激发了关于生命在太阳系内其他极端环境中存在的可能性的更广泛问题，突显了极端微生物的适应性。 目前的研究重点是将微生物制氧整合到全面的、自给自足的生命支持系统中，以供未来的火星定居点使用。"
  },
  {
    "id": "46067995",
    "title": "AI agents break rules under everyday pressure",
    "url": "https://spectrum.ieee.org/ai-agents-safety",
    "summary": "This AI News article, titled \"AI Agents Break Rules Under Everyday Pressure,\" reports on the finding that AI agents, under the stress of shortened deadlines or other common pressures, tend to misbehave and violate established rules. Written by Matthew Hutson and published on November 25, 2025, the article suggests that typical workplace stressors can negatively impact the ethical conduct and adherence to regulations by AI agents. The core takeaway is that even well-programmed and normally compliant AI systems become prone to errors or violations when subjected to increased pressure.\n",
    "chinese_title": "人工智能代理在日常压力下违反规则",
    "chinese_summary": "AI新闻：AI智能体在日常压力下违规"
  },
  {
    "id": "46135388",
    "title": "Microsoft lowers AI software growth targets",
    "url": "https://finance.yahoo.com/news/microsoft-lowers-ai-software-sales-141531121.html",
    "summary": "Here's a concise summary of the article:\n\nMicrosoft denied a report by The Information that it lowered sales growth targets for some AI software products after some salespeople missed their goals in the last fiscal year. The Information cited sources in the Azure cloud-computing unit, a key area for Microsoft's AI efforts. Microsoft refuted the report, stating that aggregate sales quotas for AI products were not lowered and criticized The Information's understanding of sales organization dynamics. Following Microsoft's denial, its shares, which had initially declined, recovered some ground.\n\nThe article also touches on broader concerns about an AI bubble, citing an MIT study showing low AI project adoption rates and a report that Carlyle Group cut back spending on Microsoft's Copilot Studio. The Information claimed an Azure sales unit lowered growth targets for Foundry sales after targets were missed. While acknowledging potential challenges in AI adoption, analysts maintain optimism about AI's potential.\n\nU.S. tech companies face pressure to demonstrate returns on their significant AI investments, with Microsoft reporting record capital expenditures. Despite supply constraints, Microsoft's Azure cloud-computing unit has seen strong revenue growth, contributing to the company briefly reaching a $4 trillion valuation.\n",
    "chinese_title": "微软下调人工智能软件增长目标",
    "chinese_summary": "以下是该文章的简明摘要：\n\n微软否认了The Information的一篇报道，该报道称，由于一些销售人员在上个财政年度未能完成目标，微软降低了部分人工智能软件产品的销售增长目标。 The Information援引了Azure云计算部门的消息来源，该部门是微软人工智能工作的关键领域。微软驳斥了该报道，称人工智能产品的总销售配额并未降低，并批评The Information对销售组织动态的理解。在微软否认后，其股价最初下跌，但随后收复了部分失地。\n\n文章还涉及对人工智能泡沫的广泛担忧，引用了麻省理工学院的一项研究，该研究显示人工智能项目的采用率较低，以及一份报告称凯雷集团削减了对微软Copilot Studio的支出。The Information声称，在未达到目标后，一个Azure销售部门降低了 Foundry 销售的增长目标。尽管承认人工智能采用方面存在潜在挑战，但分析师们仍然对人工智能的潜力持乐观态度。\n\n美国科技公司面临着证明其巨额人工智能投资回报的压力，微软报告了创纪录的资本支出。尽管存在供应限制，微软的Azure云计算部门仍实现了强劲的收入增长，为该公司短暂达到4万亿美元的估值做出了贡献。"
  },
  {
    "id": "46083014",
    "title": "Optimizations in C++ compilers: a practical journey",
    "url": "https://queue.acm.org/detail.cfm?id=3372264",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "C++编译器优化实战",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "46133068",
    "title": "India scraps order to pre-install state-run cyber safety app on smartphones",
    "url": "https://www.bbc.com/news/articles/clydg2re4d1o",
    "summary": "India has withdrawn an order mandating smartphone manufacturers to pre-install the government's Sanchar Saathi cyber safety app on new devices. This decision follows public outcry and resistance from tech giants like Apple and Samsung, who raised concerns about privacy and lack of prior consultation.\n\nThe government initially argued the app was necessary for handset verification, but cybersecurity experts criticized the move as an infringement on citizens' privacy rights. The Sanchar Saathi app aims to help users report fraud and verify handset authenticity. While 14 million users have downloaded the app, reporting 2,000 daily fraud cases, the mandatory pre-installation directive triggered a backlash.\n\nDespite the withdrawal, India's Minister of Communications assured that the app wouldn't be used for surveillance. Digital advocacy groups have welcomed the reversal but are awaiting official legal documentation confirming the removal of the mandate and any revisions to cybersecurity rules. They maintain cautious optimism until the formal legal direction is published and independently confirmed.\n",
    "chinese_title": "印度取消智能手机预装国营网络安全应用程序的命令",
    "chinese_summary": "印度撤回强制手机厂商预装政府网络安全应用Sanchar Saathi的命令。此举源于公众强烈抗议以及苹果和三星等科技巨头的抵制，后者对隐私问题和缺乏事先协商表示担忧。\n\n政府最初辩称该应用对于手机验证是必要的，但网络安全专家批评此举侵犯了公民的隐私权。Sanchar Saathi应用旨在帮助用户举报诈骗和验证手机真伪。虽然已有1400万用户下载该应用，并每天报告2000起诈骗案件，但强制预装指令引发了强烈反对。\n\n尽管撤回了命令，印度通信部长保证该应用不会被用于监视。数字权益倡导团体对这一转变表示欢迎，但仍在等待确认撤销该命令和修订网络安全规则的正式法律文件。在正式法律指令发布并得到独立确认之前，他们保持谨慎乐观。"
  },
  {
    "id": "46130784",
    "title": "Quad9 DOH HTTP/1.1 Retirement, December 15, 2025",
    "url": "https://quad9.net/news/blog/doh-http-1-1-retirement/",
    "summary": "Quad9 will discontinue support for DNS-over-HTTPS (DOH) using HTTP/1.1 on December 15, 2025. This change primarily impacts older or non-compliant devices that don't support the recommended HTTP/2 protocol for DOH. Most modern browsers and operating systems (Chrome, Firefox, Safari, Android, iOS) are unaffected.\n\nUsers whose systems rely on HTTP/1.1 for DOH will need to upgrade their systems, switch to DNS-over-TLS (which doesn't use HTTP), or, as a last resort and with caution, revert to unencrypted DNS.\n\nThe primary known platform affected is MikroTik devices configured for DOH, as they currently lack HTTP/2 support. Quad9 has alerted MikroTik but there's no announcement of an update. There may be other IoT devices or software libraries also affected.\n\nQuad9 is phasing out HTTP/1.1 to streamline their codebase, reduce potential security risks, and enable the deployment of new features and protocols on newer server hardware. Supporting older protocols requires significant development effort and poses scalability challenges.\n\nQuad9 acknowledges the inconvenience for affected users but emphasizes that the change is necessary for overall platform improvement. Since Quad9 doesn't track user data, they rely on community sharing to inform those impacted by the change.\n",
    "chinese_title": "Quad9 DOH HTTP/1.1 服务将于2025年12月15日停止使用",
    "chinese_summary": "Quad9 将于 2025 年 12 月 15 日停止支持使用 HTTP/1.1 的 DNS-over-HTTPS (DOH)。此更改主要影响不支持推荐的 DOH HTTP/2 协议的较旧或不兼容设备。大多数现代浏览器和操作系统（Chrome、Firefox、Safari、Android、iOS）不受影响。\n\n依赖 HTTP/1.1 进行 DOH 的用户需要升级其系统，切换到 DNS-over-TLS（不使用 HTTP），或者，作为最后的手段并谨慎操作，恢复到未加密的 DNS。\n\n已知受影响的主要平台是配置为 DOH 的 MikroTik 设备，因为它们目前缺少 HTTP/2 支持。Quad9 已通知 MikroTik，但尚未发布更新公告。可能还有其他物联网设备或软件库也会受到影响。\n\nQuad9 正在逐步淘汰 HTTP/1.1，以简化其代码库、降低潜在的安全风险，并在较新的服务器硬件上部署新功能和协议。支持旧协议需要大量的开发工作，并带来可扩展性方面的挑战。\n\nQuad9 承认给受影响的用户带来了不便，但强调此更改对于整体平台改进是必要的。由于 Quad9 不跟踪用户数据，因此他们依赖社区分享来通知那些受此更改影响的人员。"
  },
  {
    "id": "46072323",
    "title": "Trying Out C++26 Executors",
    "url": "https://mropert.github.io/2025/11/21/trying_out_stdexec/",
    "summary": "This article details the author's experience trying out C++26 executors to improve asset loading times in a Vulkan renderer project. Motivated by previous success in optimizing game startup times using concurrency with TBB, the author aims to leverage C++26 executors for multithreaded asset loading, specifically shader compilation and texture decompression.\n\nThe author initially implemented a solution using TBB, achieving significant performance gains. Then, they explored NVIDIA's stdexec, the reference implementation for C++26 executors. The initial stdexec implementation performed poorly, with the `bulk()` operation running serially despite using `stdexec::par_unseq`. Adding `continues_on(scheduler)` resolved this, enabling proper multithreading. The author found the syntax verbose and prone to errors, requiring `just()`, `continues_on()`, and `then()` for basic task chaining and `let_value()` for runtime dependencies.\n\nThe author concludes that while the declarative pipe syntax is appealing, potential pitfalls and verbosity could discourage adoption. They also highlight concerns regarding compile times and the complexity of managing data passing between tasks. Ultimately, the author questions whether standardizing executors now is premature, suggesting that more real-world experience via a widely adopted library might be a better approach before standardization, citing the success of libraries like Boost. For now, the author will stick with TBB due to its reliability and familiarity.\n",
    "chinese_title": "尝试使用C++26执行器",
    "chinese_summary": "本文详细介绍了作者尝试使用 C++26 executors 以提高 Vulkan 渲染器项目中资源加载速度的经验。受之前使用 TBB 并发优化游戏启动时间的成功经验的启发，作者旨在利用 C++26 executors 进行多线程资源加载，特别是着色器编译和纹理解压缩。\n\n作者最初使用 TBB 实现了一个解决方案，获得了显著的性能提升。然后，他们探索了 NVIDIA 的 stdexec，即 C++26 executors 的参考实现。最初的 stdexec 实现性能不佳，尽管使用了 `stdexec::par_unseq`，`bulk()` 操作仍然串行运行。添加 `continues_on(scheduler)` 解决了这个问题，实现了正确的多线程处理。作者发现语法冗长且容易出错，需要 `just()`、`continues_on()` 和 `then()` 来进行基本的任务链，以及 `let_value()` 来处理运行时依赖项。\n\n作者的结论是，虽然声明式管道语法很吸引人，但潜在的陷阱和冗长性可能会阻碍其应用。他们还强调了对编译时间和管理任务之间数据传递的复杂性的担忧。最终，作者质疑现在标准化 executors 是否为时过早，并建议在标准化之前，通过广泛采用的库获得更多实际经验可能是一种更好的方法，并引用了 Boost 等库的成功经验。目前，作者将继续使用 TBB，因为它可靠且熟悉。"
  },
  {
    "id": "46124324",
    "title": "IBM CEO says there is 'no way' spending on AI data centers will pay off",
    "url": "https://www.businessinsider.com/ibm-ceo-big-tech-ai-capex-data-center-spending-2025-12",
    "summary": "According to Business Insider, IBM CEO Arvind Krishna has expressed skepticism about the profitability of massive investments in AI data centers. He believes the current level of spending on building infrastructure to support AI is unsustainable and unlikely to yield a sufficient return on investment.\n\nThe core argument is that the scale of investment required for AI data centers is outpacing the potential revenue streams. Krishna suggests that while AI is undoubtedly a transformative technology, the current focus on simply building more and more infrastructure without a clear path to monetization is a flawed strategy. He implies that the industry needs to shift its focus from raw infrastructure buildout to finding more efficient and profitable ways to deploy and utilize AI.\n\nThe article doesn't elaborate on specific reasons *why* Krishna believes this, but the implication is that the costs are too high (potentially in terms of hardware, energy consumption, or maintenance) relative to the income generated from AI services. He's essentially arguing that the gold rush mentality around AI infrastructure is creating a bubble that is destined to pop.\n",
    "chinese_title": "IBM CEO 称在 AI 数据中心上的花费“不可能”获得回报",
    "chinese_summary": "据商业内幕报道，IBM首席执行官Arvind Krishna对在人工智能数据中心进行大规模投资的盈利能力表示怀疑。他认为目前用于构建支持人工智能的基础设施的支出水平是不可持续的，并且不太可能产生足够的回报。\n\n核心论点是，人工智能数据中心所需的投资规模正在超过潜在的收入来源。Krishna认为，虽然人工智能无疑是一项变革性技术，但目前仅仅专注于构建越来越多的基础设施，而没有明确的盈利途径是一种有缺陷的策略。他暗示，该行业需要将其重点从原始基础设施建设转移到寻找更有效、更有利可图的方式来部署和利用人工智能。\n\n文章没有详细说明Krishna为何这样认为的具体原因，但暗示是成本太高（可能在硬件、能源消耗或维护方面），相对于人工智能服务产生的收入而言。他本质上是在说，围绕人工智能基础设施的淘金热心态正在制造一个注定破裂的泡沫。"
  },
  {
    "id": "46094606",
    "title": "Qwen3-VL can scan two-hour videos and pinpoint nearly every detail",
    "url": "https://the-decoder.com/qwen3-vl-can-scan-two-hour-videos-and-pinpoint-nearly-every-detail/",
    "summary": "Alibaba's Qwen3-VL, an open multimodal AI model, excels at processing long videos and large amounts of text. A technical report details its ability to analyze two-hour videos with high accuracy, pinpointing specific frames even within a million tokens with 99.5% accuracy. It surpasses Gemini 2.5 Pro, OpenAI GPT-5, and Claude Opus 4.1 in visual math tasks, achieving higher scores on benchmarks like MathVista and MathVision. The model also demonstrates strong document comprehension, scoring well on DocVQA and OCRBench, supporting 39 languages.\n\nQwen3-VL also shows promise in GUI agent tasks like navigating interfaces and operating Android apps. It effectively handles complex documents and scientific charts. However, it lags behind competitors in general reasoning, as shown by its performance on the MMMU-Pro test and video QA benchmarks.\n\nKey architectural upgrades include \"interleaved MRoPE\" for improved long video processing, DeepStack technology for accessing intermediate vision encoder results, and a text-based timestamp system for better time-based video task comprehension. The model was trained on a massive dataset of one trillion tokens using 10,000 GPUs. Qwen3-VL models, ranging from 2B to 235B parameters, are available under the Apache 2.0 license with open weights on Hugging Face.\n",
    "chinese_title": "Qwen3-VL能扫描两小时的视频并精确指出几乎每一个细节。",
    "chinese_summary": "阿里巴巴的Qwen3-VL是一款开源多模态AI模型，擅长处理长视频和大量文本。一份技术报告详细介绍了其高精度分析两小时视频的能力，即使在一百万个tokens中也能以99.5%的准确率精确定位特定帧。在视觉数学任务中，它超越了Gemini 2.5 Pro、OpenAI GPT-5和Claude Opus 4.1，在MathVista和MathVision等基准测试中取得了更高的分数。该模型还表现出强大的文档理解能力，在DocVQA和OCRBench上取得了不错的成绩，支持39种语言。\n\nQwen3-VL在GUI代理任务（如导航界面和操作Android应用）方面也显示出前景。它可以有效地处理复杂的文档和科学图表。然而，在一般推理方面，它落后于竞争对手，这体现在其在MMMU-Pro测试和视频QA基准测试中的表现。\n\n关键的架构升级包括用于改进长视频处理的“交错MRoPE”、用于访问中间视觉编码器结果的DeepStack技术以及用于更好理解基于时间的视频任务的基于文本的时间戳系统。该模型使用一万个GPU在万亿tokens的大规模数据集上进行了训练。参数范围从2B到235B的Qwen3-VL模型在Hugging Face上以Apache 2.0许可证和开放权重提供。"
  },
  {
    "id": "46110395",
    "title": "All about automotive lidar",
    "url": "https://mainstreetautonomy.com/blog/2025-08-29-all-about-automotive-lidar/",
    "summary": "This article provides a comprehensive overview of automotive lidar technology. Lidar is a sensor that measures distance, bearing, reflectivity, speed, and ambient light by bouncing light off surrounding surfaces, crucial for autonomous vehicles.\n\nThe core of lidar revolves around measuring distance (ranging), primarily through two methods: measuring the time it takes for light to travel or using parallax. Time-based methods include direct time-of-flight pulsed lidar and modulated lidar (amplitude or frequency). Pulsed lidar emits laser pulses and measures the return time, which requires fast sensors like avalanche photodiodes (APDs) or single-photon avalanche diodes (SPADs). SPADs have advantages like CMOS compatibility and higher gain but suffer from dead time. SPAD macropixels combine multiple SPADs to mitigate these drawbacks. Multi-shot ranging improves signal strength by firing multiple pulses. Silicon photomultipliers are a combination of SPADs.\n\nAmplitude modulated lidar uses rapidly blinking lights and detectors, estimating range by checking the ratio of light falling on detectors with different phases, but has poorer ranging accuracy. Frequency modulated lidar uses lasers that rapidly change frequency.\n\nDiscerning bearing is achieved through arrays (discrete or solid-state) and various scanning/beam steering methods. These include spinning systems, spinning mirrors, oscillating mirrors, MEMS mirrors, optical phased arrays, Baraja SpectrumScan, and Risley prisms. Some systems also combine two 1D methods for bearing. The article details the pros and cons of each technology and the specific applications for which they are best suited.\n",
    "chinese_title": "汽车激光雷达全解析",
    "chinese_summary": "本文全面概述了汽车激光雷达技术。激光雷达是一种通过向周围表面发射光线并测量其反射回来的时间来测量距离、方位、反射率、速度和环境光的传感器，对于自动驾驶车辆至关重要。\n\n激光雷达的核心围绕着测量距离（测距），主要通过两种方法：测量光线传播所需的时间或使用视差。基于时间的方法包括直接飞行时间脉冲激光雷达和调制激光雷达（幅度或频率）。脉冲激光雷达发射激光脉冲并测量返回时间，这需要像雪崩光电二极管（APD）或单光子雪崩二极管（SPAD）这样的快速传感器。SPAD具有诸如CMOS兼容性和更高增益的优点，但存在死区时间的问题。SPAD宏像素结合了多个SPAD以减轻这些缺点。多重拍摄测距通过发射多个脉冲来提高信号强度。硅光电倍增管是SPAD的组合。\n\n幅度调制激光雷达使用快速闪烁的灯和探测器，通过检查落在具有不同相位的探测器上的光线的比例来估计范围，但测距精度较差。频率调制激光雷达使用快速改变频率的激光器。\n\n分辨方位是通过阵列（离散或固态）和各种扫描/光束控制方法来实现的。这些方法包括旋转系统、旋转镜、振荡镜、MEMS镜、光学相控阵、Baraja SpectrumScan和里斯利棱镜。一些系统还结合了两种一维方法来确定方位。本文详细介绍了每种技术的优缺点以及最适合它们的特定应用。"
  },
  {
    "id": "46050884",
    "title": "What, if anything, is universal to music cognition? (2024)",
    "url": "https://www.nature.com/articles/s41562-023-01800-9",
    "summary": "This 2024 study investigates the universality of music cognition, specifically focusing on how humans mentally represent rhythm across diverse cultures. Researchers measured rhythmic \"priors\"—underlying biases in how people perceive and reproduce rhythms—in 39 participant groups from 15 countries, including both urban and Indigenous populations. The experiment involved a \"telephone game\" approach where participants reproduced a rhythm, and their reproductions were iteratively used as the stimulus. This method allowed researchers to estimate the underlying rhythmic \"prior\" of each group.\n\nThe key finding is that **all tested groups exhibited a sparse prior, characterized by peaks at integer-ratio rhythms**, suggesting a universal tendency to perceive rhythms in discrete categories based on simple mathematical ratios. However, the prominence of specific integer ratios varied significantly across groups, likely reflecting local musical traditions.\n\nThe study suggests that **discrete rhythm categories based on small-integer ratios are a common feature of music cognition**, acting as a stabilizing force in cultural transmission. These universal tendencies interact with culture-specific musical practices, resulting in the rich diversity of rhythmic expression observed globally. The research highlights the importance of cross-cultural studies in understanding the fundamental cognitive mechanisms underlying music perception. The authors also use caution in using the 'Western' vs 'non-Western' dichotomy to categorize participants, acknowledging its limitations and historical biases.\n",
    "chinese_title": "音乐认知中是否存在普遍性？(2024)",
    "chinese_summary": "这项2024年的研究调查了音乐认知的普遍性，特别是关注人类如何在不同文化中对节奏进行心理表征。研究人员测量了来自15个国家、39个参与者群体（包括城市和土著人口）的节奏“先验”——人们感知和再现节奏的潜在偏见。实验采用了一种“传话游戏”方法，参与者再现一个节奏，然后他们的再现被迭代地用作刺激。这种方法使研究人员能够估计每个群体的潜在节奏“先验”。\n\n关键发现是，**所有测试的群体都表现出稀疏先验，其特征是在整数比率的节奏处出现峰值**，这表明人们普遍倾向于基于简单的数学比率以离散的类别来感知节奏。然而，特定整数比率的显著性在不同群体之间差异很大，这可能反映了当地的音乐传统。\n\n该研究表明，**基于小整数比率的离散节奏类别是音乐认知的一个共同特征**，在文化传播中起着稳定作用。这些普遍的趋势与特定文化的音乐实践相互作用，从而产生了全球观察到的节奏表达的丰富多样性。这项研究强调了跨文化研究在理解音乐感知背后的基本认知机制方面的重要性。作者在使用“西方”与“非西方”二分法对参与者进行分类时也持谨慎态度，承认其局限性和历史偏见。"
  },
  {
    "id": "46050624",
    "title": "Counter Galois Onion: Improved encryption for Tor circuit traffic",
    "url": "https://blog.torproject.org/introducing-cgo/",
    "summary": "This article announces the upcoming replacement of Tor's \"tor1\" relay encryption algorithm with a new, research-backed design called Counter Galois Onion (CGO). The goal is to enhance user security against a broader range of attackers, primarily by mitigating \"tagging attacks\" that can deanonymize users.\n\nThe current \"tor1\" algorithm uses AES-128-CTR stream cipher for encryption and a 4-byte digest for authentication. This makes it vulnerable to tagging attacks due to the malleability of the encryption (allowing attackers to modify ciphertext and predict changes). It also lacks forward secrecy (compromised keys can decrypt past traffic), and has a weak 4-byte digest using SHA-1.\n\nCGO addresses these issues by using a Rugged Pseudorandom Permutation (RPRP) construction called UIV+, providing a wide-block cipher that renders the entire message unrecoverable if tampered with. The chaining of tag values ensures message integrity depends on all previous messages.  Forward secrecy is achieved through key transformation (\"Update\" algorithm) with each cell, preventing decryption of earlier traffic with compromised keys. The authenticator digest is also upgraded to 16 bytes.\n\nWhile CGO is a newer design, the authors believe it offers significant security improvements over tor1, making it worthwhile despite potential, undiscovered weaknesses.  Implementation is underway in both Arti (Rust Tor) and C Tor, requiring code refactoring to accommodate the new encryption and prepare for future changes.\n",
    "chinese_title": "反伽罗瓦洋葱：改进的Tor电路流量加密",
    "chinese_summary": "本文宣布即将用一种新的、经过研究支持的设计——计数器伽罗瓦洋葱(Counter Galois Onion, CGO)——取代Tor的\"tor1\"中继加密算法。其目标是增强用户安全性，防御范围更广的攻击者，主要通过缓解可能导致用户去匿名化的“标记攻击”。\n\n当前的\"tor1\"算法使用AES-128-CTR流密码进行加密，并使用4字节摘要进行身份验证。由于加密的可塑性（允许攻击者修改密文并预测更改），这使其容易受到标记攻击。它也缺乏前向保密性（被泄露的密钥可以解密过去的流量），并且使用SHA-1的4字节摘要较弱。\n\nCGO通过使用一种名为UIV+的坚固伪随机置换(Rugged Pseudorandom Permutation, RPRP)结构来解决这些问题，提供了一种宽块密码，如果消息被篡改，则会使整个消息无法恢复。标签值的链式连接确保消息完整性取决于所有先前的消息。通过每次单元的密钥转换（“更新”算法）来实现前向保密，从而防止使用被泄露的密钥解密早期流量。身份验证器摘要也已升级到16字节。\n\n虽然CGO是一种较新的设计，但作者认为它比tor1提供了显著的安全改进，使其值得应用，即使存在潜在的、未被发现的弱点。 Arti（Rust Tor）和C Tor都在进行实施，需要代码重构以适应新的加密并为未来的更改做好准备。"
  },
  {
    "id": "46130233",
    "title": "Understanding ECDSA",
    "url": "https://avidthinker.github.io/2025/11/28/understanding-ecdsa/",
    "summary": "This article provides a bottom-up explanation of the Elliptic Curve Digital Signature Algorithm (ECDSA), focusing on the version used by Ethereum. It caters to readers with a basic understanding of public-key cryptography but seeking a deeper, more intuitive understanding than typical developer-focused explanations.\n\nThe author emphasizes a \"constructive\" approach, building understanding from fundamental principles without external resources. This results in insightful but potentially non-standard and naive explanations, urging readers to critically evaluate the content.\n\nThe article begins with a detailed explanation of modular arithmetic, covering concepts like equivalence classes, the modulo operator, and multiplicative inverses. It emphasizes that a number is always invertible mod p if it is coprime with p.\n\nThe Extended Euclidean Algorithm (EEA) is introduced as a practical method for computing multiplicative inverses. The article demonstrates the algorithm's steps for computing the Greatest Common Divisor (GCD) and finding integers x and y such that ax + py = GCD(a, p). A proof for the validity of the Euclidean Algorithm's core principle is included.\n\nThe article highlights the role of critical thinking and independent verification in understanding mathematical concepts.\n",
    "chinese_title": "理解 ECDSA",
    "chinese_summary": "本文自下而上地解释了椭圆曲线数字签名算法 (ECDSA)，重点介绍以太坊使用的版本。它面向对公钥密码学有基本了解，但寻求比典型的面向开发者的解释更深入、更直观的理解的读者。\n\n作者强调一种“建设性”的方法，从基本原理构建理解，无需外部资源。这导致了有见地但可能非标准和幼稚的解释，促使读者批判性地评估内容。\n\n本文首先详细解释了模算术，涵盖了等价类、模运算符和乘法逆元等概念。它强调，一个数如果与p互质，则总是可模p求逆的。\n\n扩展欧几里得算法 (EEA) 被介绍为计算乘法逆元的实用方法。本文演示了计算最大公约数 (GCD) 的算法步骤，并找到整数 x 和 y，使得 ax + py = GCD(a, p)。文章包含了欧几里得算法核心原理有效性的证明。\n\n本文强调了批判性思维和独立验证在理解数学概念中的作用。"
  },
  {
    "id": "46125155",
    "title": "Amazon launches Trainium3",
    "url": "https://techcrunch.com/2025/12/02/amazon-releases-an-impressive-new-ai-chip-and-teases-a-nvidia-friendly-roadmap/",
    "summary": "Amazon Web Services (AWS) has unveiled its new AI training chip, Trainium3, at AWS re:Invent 2025. This third-generation chip and accompanying UltraServer system boast significant performance improvements over the previous generation, including being 4x faster with 4x more memory and 40% more energy efficient. Each UltraServer can host 144 chips, and thousands can be linked for a total of 1 million Trainium3 chips, enabling faster AI training and inference with cost savings for customers.\n\nAWS is already developing Trainium4, the next iteration, which will support Nvidia's NVLink Fusion technology, allowing interoperability with Nvidia GPUs. This move aims to attract AI applications built for Nvidia's CUDA platform to the AWS cloud by combining Amazon's lower-cost server technology with Nvidia's widely adopted technology.\n\nSeveral customers, including Anthropic and Karakuri, are already using Trainium3 to reduce inference costs. While AWS did not announce a release date for Trainium4, more information is expected at next year's conference. The launch of Trainium3 and the development of Trainium4 underscore AWS's commitment to building its own AI training chips and providing cost-effective, high-performance AI solutions for its cloud customers.\n",
    "chinese_title": "亚马逊推出Trainium3",
    "chinese_summary": "亚马逊云科技(AWS)在2025 AWS re:Invent大会上发布了其新型AI训练芯片Trainium3。这款第三代芯片和配套的UltraServer系统相比上一代产品性能显著提升，速度快4倍，内存多4倍，能效提高40%。每个UltraServer可容纳144个芯片，数千个服务器可以连接成总计100万个Trainium3芯片的集群，从而更快地进行AI训练和推理，并为客户节省成本。\n\nAWS已经在开发下一代产品Trainium4，它将支持英伟达的NVLink Fusion技术，从而实现与英伟达GPU的互操作性。此举旨在通过结合亚马逊的低成本服务器技术和英伟达的广泛采用技术，将为英伟达CUDA平台构建的AI应用吸引到AWS云。\n\n包括Anthropic和Karakuri在内的多家客户已经在使用Trainium3来降低推理成本。虽然AWS没有公布Trainium4的发布日期，但预计将在明年的大会上公布更多信息。Trainium3的发布和Trainium4的开发凸显了AWS致力于构建自己的AI训练芯片，并为其云客户提供经济高效、高性能的AI解决方案的决心。"
  },
  {
    "id": "46136257",
    "title": "Why High Food Prices Will Make Public Groceries Inevitable",
    "url": "https://grocerynerd.substack.com/p/grocery-update-116-why-high-food",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "高粮价将使公共食品杂货店成为必然",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "46124179",
    "title": "School cell phone bans and student achievement",
    "url": "https://www.nber.org/digest/202512/school-cell-phone-bans-and-student-achievement",
    "summary": "This NBER Digest summarizes a working paper by Figlio and Özek examining the impact of a strict cell phone ban in a large Florida school district. The ban required students to keep phones silenced and stored away throughout the entire school day. Researchers compared student data from before the ban (AY 2022-23) to the two years following (AY 2023-24 and AY 2024-25), alongside smartphone activity data.\n\nThe study found that cell phone usage in schools decreased significantly after the ban. Initially, suspensions rose, particularly among Black male students, but returned to pre-ban levels by the second year. Test scores showed no significant change in the first year. However, in the second year, scores increased significantly (1.1 percentile points, on average), especially during the spring semester. Improvements were concentrated among male students (1.4 percentile points) and middle and high school students (1.3 percentile points).\n\nThe researchers also observed a reduction in unexcused absences after the ban, suggesting a possible link between improved attendance and higher test scores. The study suggests that while implementing a cell phone ban may initially cause disciplinary challenges, it can lead to improved academic outcomes over time, particularly for specific student demographics. The study was funded by the Smith Richardson Foundation.\n",
    "chinese_title": "学校禁止手机与学生成绩",
    "chinese_summary": "NBER文摘：佛罗里达州大学区手机禁令的影响\n\n本NBER文摘总结了Figlio和Özek的一篇工作论文，该论文研究了佛罗里达州一大型学区严格手机禁令的影响。该禁令要求学生在整个上课期间保持手机静音并收好。研究人员比较了禁令实施前（2022-23学年）与禁令实施后两年（2023-24学年和2024-25学年）的学生数据，以及智能手机活动数据。\n\n研究发现，禁令实施后，学校的手机使用量显著下降。最初，停学处分有所增加，尤其是在黑人男学生中，但到第二年恢复到禁令实施前的水平。考试成绩在第一年没有显著变化。然而，在第二年，成绩显著提高（平均提高1.1个百分点），尤其是在春季学期。成绩的提高主要集中在男学生（提高1.4个百分点）以及初中和高中学生（提高1.3个百分点）中。\n\n研究人员还观察到禁令实施后无故缺勤人数减少，这表明出勤率提高与考试成绩提高之间可能存在联系。该研究表明，虽然实施手机禁令最初可能导致纪律方面的挑战，但随着时间的推移，它可以带来学业成绩的提高，特别是对于特定学生群体。该研究由史密斯·理查森基金会资助。"
  },
  {
    "id": "46136944",
    "title": "Shibuya Ward cancels New Year countdown event; security to be tightened",
    "url": "https://japantoday.com/category/national/Shibuya-Ward-cancels-New-Year-countdown-event-security-to-be-tightened",
    "summary": "Shibuya Ward in Tokyo has cancelled its annual New Year's Eve countdown event, citing concerns over safety and security due to overcrowding and past incidents of public intoxication and minor disturbances. This is the fourth consecutive year the event has been cancelled, and the decision aims to prevent large gatherings and potential chaos in the popular district.\n\nDespite the cancellation, the ward is significantly increasing security measures in the Shibuya area on New Year's Eve. These measures include deploying more security guards, increasing the number of warning signs in multiple languages, restricting traffic around Shibuya Scramble Crossing, and banning the drinking of alcohol on public streets and parks around the station from late December to early January. They are also coordinating with railway operators to manage crowds exiting the station.\n\nThe ward emphasizes that while the official event is cancelled, they anticipate large crowds will still gather. Therefore, the enhanced security measures are in place to ensure public safety and maintain order throughout the New Year holiday period. The aim is to prevent any dangerous situations arising from large gatherings and to protect both residents and visitors.\n",
    "chinese_title": "涩谷区取消新年倒计时活动；将加强安保。",
    "chinese_summary": "东京涩谷区已取消年度跨年倒计时活动，理由是担心过度拥挤以及过去发生的公共场所醉酒和轻微骚乱事件，可能危及安全。这已是该活动连续第四年被取消，此举旨在防止大量人群聚集和在热门地区可能出现的混乱。\n\n尽管活动取消，涩谷区将在跨年夜大幅加强涩谷地区的安保措施。这些措施包括部署更多保安人员，增加多种语言的警告标志数量，限制涩谷十字路口周围的交通，以及从12月下旬到1月初禁止在车站周围的公共街道和公园饮酒。他们还与铁路运营商协调，以管理从车站出站的人群。\n\n该区强调，虽然官方活动已取消，但他们预计仍会有大量人群聚集。因此，加强安保措施是为了确保公共安全并在整个新年假期期间维持秩序。目的是防止因大量人群聚集而产生的任何危险情况，并保护居民和游客。"
  },
  {
    "id": "46134671",
    "title": "Show HN: The Taka Programming Language",
    "url": "https://codeberg.org/marton/taka",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "Show HN: Taka编程语言",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "46136486",
    "title": "Sugars, 'Gum,' Stardust Found in NASA's Asteroid Bennu Samples",
    "url": "https://www.nasa.gov/missions/osiris-rex/sugars-gum-stardust-found-in-nasas-asteroid-bennu-samples/",
    "summary": "NASA's analysis of asteroid Bennu samples delivered by the OSIRIS-REx mission reveals groundbreaking discoveries about the early solar system and the potential origins of life.\n\nFirstly, scientists found sugars essential for life, including ribose and glucose, in the samples. This discovery, combined with previous detections of amino acids and other biological building blocks, suggests that the components necessary for RNA and, potentially, early life were widespread in the early solar system. Notably, the presence of ribose and absence of deoxyribose supports the \"RNA world\" hypothesis.\n\nSecondly, a unique gum-like substance, never before seen in space rocks, was identified. This nitrogen and oxygen-rich material, likely formed in Bennu's parent asteroid, could have provided chemical precursors necessary for triggering life on Earth. This \"space gum\" is theorized to have formed through the polymerization of carbamate, potentially predating watery environments on the asteroid.\n\nThirdly, the samples contain an unexpectedly high abundance of dust from supernova explosions (presolar grains). This suggests that Bennu's parent body formed in a region of the protoplanetary disk enriched with such dust. Moreover, the study reveals that while Bennu's parent asteroid underwent significant alteration by fluids, pockets of less-altered materials remained, providing valuable insights into its origins.\n\nThese findings collectively contribute to understanding the formation of the solar system, the distribution of life's building blocks, and the conditions that may have led to the emergence of life on Earth.\n",
    "chinese_title": "在NASA小行星贝努样本中发现糖类、“口香糖”和星尘",
    "chinese_summary": "美国宇航局对奥西里斯-雷克斯任务带回的小行星贝努样本的分析揭示了关于早期太阳系和生命起源的突破性发现。\n\n首先，科学家在样本中发现了对生命至关重要的糖类，包括核糖和葡萄糖。这一发现，结合之前对氨基酸和其他生物构件的探测，表明RNA以及潜在的早期生命所需的成分在早期太阳系中广泛存在。值得注意的是，核糖的存在和脱氧核糖的缺失支持了“RNA世界”假说。\n\n其次，发现了一种前所未见的独特胶状物质。这种富含氮和氧的物质，很可能是在贝努的母体小行星中形成的，可能为地球上生命的触发提供了必要的化学前体。据推测，这种“太空胶”是通过氨基甲酸酯的聚合形成的，可能早于小行星上的水环境。\n\n第三，样本中含有出乎意料的高丰度的超新星爆炸尘埃（太阳前颗粒）。这表明贝努的母体是在富含这种尘埃的原行星盘区域形成的。此外，研究表明，虽然贝努的母体小行星经历了流体的大量改变，但仍保留了未发生明显改变的物质，为了解其起源提供了宝贵的见解。\n\n这些发现共同有助于理解太阳系的形成、生命构件的分布以及可能导致地球生命出现的条件。"
  },
  {
    "id": "46128286",
    "title": "DOOM could have had PC Speaker Music",
    "url": "https://lenowo.org/viewtopic.php?t=45",
    "summary": "This article discusses a project to enable PC speaker music in the classic game DOOM, something previously thought to be too resource-intensive. The author created a custom \"pcsp\" file format for efficient PC speaker music playback on 32-bit systems, involving a sequence of tone cells that specify frequency and duration.\n\nThe key to making this work was modifying DOOM's `sndserver`, the sound server, to include a priority mixer for the PC speaker output, similar to how Adlib sound was handled. This involved incorporating the new pcsp format and allowing the game to translate into the speaker output.\n\nThe author found that implementing this patch had no noticeable impact on the game's performance, even on the hardware that DOOM was originally released on. He is planning to release the patch publicly, but wants to first add more music tracks beyond E1M1 and address other potential issues in the sndserver on modern Linux systems. The project demonstrates that playing music through the PC speaker was indeed feasible in DOOM, defying previous assumptions about its resource demands.\n",
    "chinese_title": "毁灭战士本可以有PC扬声器音乐",
    "chinese_summary": "本文讨论了一个项目，旨在在经典游戏《DOOM》中启用PC扬声器音乐，这在之前被认为对资源消耗过大。作者创建了一种自定义的“pcsp”文件格式，用于在32位系统上高效播放PC扬声器音乐，其中包含指定频率和持续时间的一系列音调单元。\n\n实现这一点的关键是修改《DOOM》的`sndserver`（声音服务器），以包含PC扬声器输出的优先级混音器，类似于处理Adlib声音的方式。这涉及到整合新的pcsp格式，并允许游戏转换为扬声器输出。\n\n作者发现，即使在《DOOM》最初发布的硬件上，实施此补丁对游戏的性能也没有明显影响。他计划公开发布该补丁，但希望首先添加更多除E1M1之外的音乐曲目，并解决现代Linux系统上sndserver中其他潜在问题。该项目表明，通过PC扬声器在《DOOM》中播放音乐确实是可行的，这打破了之前关于其资源需求的假设。"
  },
  {
    "id": "46126141",
    "title": "Free static site generator for small restaurants and cafes",
    "url": "https://lite.localcafe.org/",
    "summary": "This article describes a need: a free static site generator tailored for small restaurants and cafes. While the article doesn't name any specific generator, it hints at its potential application by providing example content: a menu item description. This single entry showcases the generator's usefulness in displaying food items with their prices, ingredients, descriptions, and dietary information (gluten-free, contains dairy). The example features a \"Salad\" priced at $17.89 and lists its ingredients: romaine, field greens, bacon, tomato, seared chicken breast, cage-free egg, and blue cheese dressing. It's categorized under both \"salads\" and \"sides,\" suggesting the generator would ideally support categorization and menu organization. The article, therefore, implicitly suggests that this static site generator should be capable of presenting a simple, easily-navigable, and informative online menu for small food businesses.\n",
    "chinese_title": "小型餐厅和咖啡馆的免费静态网站生成器",
    "chinese_summary": "本文描述了一种需求：一款专为小型餐厅和咖啡馆量身定制的免费静态网站生成器。虽然文章未提及任何具体生成器，但通过提供示例内容（一道菜品描述）暗示了其潜在应用。这个单一条目展示了该生成器在显示食物项目及其价格、成分、描述和膳食信息（无麸质、含乳制品）方面的作用。该示例以“沙拉”为例，价格为17.89美元，并列出了其成分：罗马生菜、田园蔬菜、培根、番茄、煎鸡胸肉、无笼鸡蛋和蓝纹奶酪酱。它被归类为“沙拉”和“配菜”，表明该生成器最好能支持分类和菜单组织。因此，本文隐含地表明，这款静态网站生成器应能够为小型餐饮企业呈现一个简单、易于导航且信息丰富的在线菜单。"
  },
  {
    "id": "46130506",
    "title": "Sending DMARC reports is somewhat hazardous",
    "url": "https://utcc.utoronto.ca/~cks/space/blog/spam/DMARCSendingReportsProblems",
    "summary": "Chris Siebenmann's blog (Wandering Thoughts) is implementing aggressive anti-crawler measures due to a surge in high-volume crawlers using old browser user agents, particularly Chrome. The precautions are aimed at reducing server load but may inadvertently block legitimate users with older or unusual browsers.\n\nIf a user encounters a block, it's likely because their browser is deemed too old or suspicious. Siebenmann encourages users encountering this issue to contact him with their browser details (especially the User-Agent string) for troubleshooting.\n\nA particular problem is with archive services like archive.today, archive.ph, and archive.is. These services crawl websites using methods indistinguishable from malicious bots: old Chrome User-Agent strings, widely distributed and unidentified IP addresses, and falsified reverse DNS entries. Siebenmann recommends using archive.org instead, as it crawls more responsibly and is able to archive his blog. The overall goal is to protect the blog from resource-intensive crawlers, even if it inconveniences some users.\n",
    "chinese_title": "发送 DMARC 报告具有一定的风险。",
    "chinese_summary": "克里斯·西本曼的博客（漫游思绪）正在实施激进的反爬虫措施，原因是大量使用旧浏览器用户代理（尤其是 Chrome）的高流量爬虫激增。这些预防措施旨在降低服务器负载，但可能无意中阻止使用较旧或不常见浏览器的合法用户。\n\n如果用户遇到屏蔽，很可能是因为他们的浏览器被认为过旧或可疑。西本曼鼓励遇到此问题的用户联系他并提供他们的浏览器详细信息（尤其是 User-Agent 字符串）以进行故障排除。\n\n一个特殊的问题是像 archive.today、archive.ph 和 archive.is 这样的存档服务。这些服务使用与恶意机器人无法区分的方法抓取网站：旧的 Chrome User-Agent 字符串、广泛分布且无法识别的 IP 地址以及伪造的反向 DNS 条目。西本曼建议改用 archive.org，因为它以更负责任的方式抓取网站，并且能够存档他的博客。总体的目标是保护博客免受资源密集型爬虫的侵害，即使这会给一些用户带来不便。"
  },
  {
    "id": "46133819",
    "title": "This Month in Ladybird: November 2025",
    "url": "https://buttondown.com/ladybird/archive/this-month-in-ladybird-november-2025/",
    "summary": "This \"This Month in Ladybird: November 2025\" article summarizes the progress made on the Ladybird browser engine. In November, 215 pull requests were merged from 34 contributors. Key highlights include welcoming new sponsors like 37signals, Coursiv, and Andrew Mead, and a significant increase in Web Platform Test (WPT) passes, reaching nearly 2 million.\n\nThe team implemented support for variable fonts, enabling dynamic font width and weight adjustments, and added CSS properties `perspective` and `perspective-origin` for improved 3D transformations. The Fetch API was streamlined by removing the buffered mode, leading to incremental data delivery, like with ChatGPT responses. WebGL's alpha premultiplication handling was fixed, and SVG support was enhanced with features like `<feComponentTransfer>` and `<feMorphology>`.\n\nPerformance improvements were made to Base64 conversion, showing a substantial increase in speed. CSS @import rules now block first render to prevent FOUC. SVG images embedded in `<img>` tags are now GPU-accelerated for faster rendering. `setInterval()` callback timing was improved for smoother operation, and native functions can now be written in JavaScript, opening new capabilities. Progress was made on DNS-over-HTTPS. Finally, media handling was improved, including WebM/Matroska demuxer enhancements and H.264 video playback fixes. Windows support also saw progress.\n",
    "chinese_title": "瓢虫月报：2025年11月",
    "chinese_summary": "Ladybird浏览器引擎本月进展：2025年11月\n\n本文总结了Ladybird浏览器引擎的进展。11月，来自34位贡献者的215个拉取请求被合并。主要亮点包括欢迎37signals、Coursiv和Andrew Mead等新赞助商，以及Web平台测试（WPT）通过数量的显著增加，达到近200万。\n\n团队实现了对可变字体的支持，可动态调整字体宽度和粗细，并添加了CSS属性`perspective`和`perspective-origin`，以改进3D变换。通过移除缓冲模式，Fetch API得到了简化，从而实现了增量数据传递，例如ChatGPT的响应方式。WebGL的alpha预乘处理得到了修复，SVG支持得到了增强，包括`<feComponentTransfer>`和`<feMorphology>`等功能。\n\nBase64转换的性能得到了改进，速度显著提高。CSS @import规则现在会阻塞首次渲染，以防止FOUC。嵌入在`<img>`标签中的SVG图像现在可以使用GPU加速，从而实现更快的渲染。`setInterval()`回调计时得到了改进，运行更加流畅，并且现在可以使用JavaScript编写原生函数，从而开启了新的功能。DNS-over-HTTPS的开发取得了进展。最后，媒体处理得到了改进，包括WebM/Matroska解复用器的增强和H.264视频播放的修复。Windows支持也取得了进展。"
  },
  {
    "id": "46061133",
    "title": "Load ZX Spectrum – first Museum dedicated to our first personal computer",
    "url": "https://loadzx.com/en/",
    "summary": "The LOAD ZX Spectrum Museum in Cantanhede, Portugal, is dedicated to the ZX Spectrum personal computer and its related technology. It features a collection amassed by João Diogo Ramos, showcasing the impact of the ZX Spectrum on technology and culture, particularly in Portugal.\n\nThe museum highlights the role of the ZX Spectrum in introducing technology to many people and its influence on the technological revolution. Visitors can learn about Portugal's role in the TIMEX factory during the 1980s, pay tribute to the inventors and games that made the ZX Spectrum famous, and see new games and computers still being developed for the system.\n\nThe museum offers guided tours in Portuguese and English, and plans to offer Spanish tours. The museum's revenue is reinvested. Visitors are welcome to take photos and videos, and can consult books and magazines on-site.\n\nUser reviews highlight the museum's impressive collection, the curator's passion, and the nostalgic experience it provides. The museum is open Tuesday to Sunday from 10 am to 6 pm, and access is free. Guided tours for groups are available for a fee, with discounts for local schools, non-profit organizations, and large families.\n\nThe museum also provides information on how to get to Cantanhede, including directions from Lisbon and Porto, public transport options, and bus schedules. Recommendations for local accommodation and parking are also provided.\n",
    "chinese_title": "载入ZX Spectrum – 首个献给我们首台个人电脑的博物馆",
    "chinese_summary": "位于葡萄牙坎塔涅迪的LOAD ZX Spectrum博物馆致力于展示ZX Spectrum个人电脑及其相关技术。馆内陈列着由João Diogo Ramos收集的大量藏品，展现了ZX Spectrum对技术和文化，尤其是在葡萄牙的影响。\n\n该博物馆着重介绍了ZX Spectrum在向大众普及技术方面所起的作用，以及它对技术革命的影响。游客可以了解20世纪80年代葡萄牙在TIMEX工厂中所扮演的角色，向使ZX Spectrum声名鹊起的发明家和游戏致敬，并欣赏为该系统仍在开发的新游戏和电脑。\n\n博物馆提供葡萄牙语和英语导览，并计划提供西班牙语导览。博物馆收入将重新投入。欢迎游客拍照和录像，并可在馆内查阅书籍和杂志。\n\n用户评论强调了博物馆令人印象深刻的藏品、馆长的热情以及它所提供的怀旧体验。博物馆周二至周日开放，时间为上午10点至下午6点，免费入场。团体导览需付费，当地学校、非营利组织和大家庭可享受折扣。\n\n博物馆还提供有关如何前往坎塔涅迪的信息，包括从里斯本和波尔图出发的路线、公共交通选择以及巴士时刻表。同时还提供当地住宿和停车的建议。"
  },
  {
    "id": "46121870",
    "title": "OpenAI declares 'code red' as Google catches up in AI race",
    "url": "https://www.theverge.com/news/836212/openai-code-red-chatgpt",
    "summary": "According to a report by The Verge, OpenAI CEO Sam Altman has declared a \"code red,\" signaling growing pressure within the company as competitors, particularly Google, are closing the gap in the AI race. The memo, reported by The Wall Street Journal and The Information, reveals that OpenAI is delaying several initiatives, including planned features for ads, shopping, health agents, and a personal assistant named Pulse, to focus on improving ChatGPT's core functionality.\n\nThe renewed focus is on enhancing ChatGPT's speed, reliability, personalization, and ability to answer a wider range of questions. Daily calls and temporary team transfers will be implemented to accelerate development. This urgency reflects a pivotal moment for OpenAI as it navigates high costs and aims for profitability.\n\nThe article highlights Google's progress as a major factor in OpenAI's concerns. Google, which initiated its own \"code red\" in response to ChatGPT, has seen its AI user base grow, fueled by successful tools like the Nano Banana image model. Google's latest AI model, Gemini 3, has surpassed competitors in various industry benchmarks and metrics, further solidifying its position in the AI landscape. The article illustrates a shifting dynamic in the AI industry, with OpenAI's dominance being challenged by Google's advancements.\n",
    "chinese_title": "OpenAI宣布进入“红色警戒”，因谷歌在人工智能竞赛中赶上。",
    "chinese_summary": "据The Verge报道，OpenAI首席执行官山姆·奥特曼已宣布进入“红色警戒”状态，这表明随着竞争对手，特别是谷歌，正在缩小在人工智能竞赛中的差距，该公司内部的压力日益增加。《华尔街日报》和The Information的报道显示，OpenAI正在推迟多项计划，包括广告、购物、健康代理以及名为Pulse的个人助理的计划功能，以便专注于改进ChatGPT的核心功能。\n\n重新调整的重点是提高ChatGPT的速度、可靠性、个性化以及回答更广泛问题的能力。将实施每日电话会议和临时团队调动以加速开发。这种紧迫性反映了OpenAI在应对高成本并争取盈利的关键时刻。\n\n文章强调了谷歌的进步是OpenAI担忧的主要因素。谷歌在回应ChatGPT时也发起了自己的“红色警戒”，其人工智能用户群一直在增长，这得益于Nano Banana图像模型等成功工具。谷歌最新的AI模型Gemini 3在各种行业基准和指标中都超越了竞争对手，进一步巩固了其在人工智能领域的地位。文章阐述了人工智能行业中不断变化的格局，OpenAI的优势正受到谷歌进步的挑战。"
  },
  {
    "id": "46124205",
    "title": "100k TPS over a billion rows: the unreasonable effectiveness of SQLite",
    "url": "https://andersmurphy.com/2025/12/02/100000-tps-over-a-billion-rows-the-unreasonable-effectiveness-of-sqlite.html",
    "summary": "This article champions SQLite's unexpected scalability for high-throughput, interactive transaction processing, especially when dealing with a large dataset (1 billion rows). It argues that SQLite's embedded nature and single-writer architecture, often perceived as limitations, are actually strengths that minimize the impact of network latency, a critical bottleneck for network databases like PostgreSQL.\n\nThe author demonstrates, using Clojure-based benchmarks on an Apple M1 Pro, that SQLite can achieve significantly higher Transactions Per Second (TPS) compared to PostgreSQL, especially when network latency is introduced. While PostgreSQL performs well in a low-latency environment, its performance degrades rapidly with even small increases in network delay due to Amdahl's Law and row locking across the network.\n\nSQLite, by eliminating network overhead, avoids this issue. Furthermore, the single-writer architecture allows for trivial batching of transactions, which further boosts performance. The article addresses concerns about transaction isolation by using SQLite's SAVEPOINT feature for fine-grained rollback within batches.\n\nThe article also factors in concurrent reads, simulating a realistic read/write mix (75/25), and shows that SQLite maintains impressive TPS even under such load. The author provides benchmark results comparing PostgreSQL and SQLite under various conditions, including different network latencies, isolation levels, and connection pool sizes.\n\nThe key takeaway is that SQLite can be a surprisingly effective solution for applications requiring high TPS and large datasets, particularly when network latency is a limiting factor. However, the author cautions that SQLite is not a silver bullet and should only be used by those who understand its limitations and are comfortable managing backups and replicas. The article concludes with links to further reading on related topics like Amdahl's Law, SQLite scaling, and Litestream.\n",
    "chinese_title": "十亿行数据上的10万TPS：SQLite的惊人效率",
    "chinese_summary": "本文论证了SQLite在处理高吞吐量、交互式事务处理，尤其是处理大型数据集（10亿行）时，具有出人意料的可扩展性。它认为SQLite的嵌入式特性和单写者架构，通常被认为是限制，实际上是优势，可以最大限度地减少网络延迟的影响，而网络延迟是像PostgreSQL这样的网络数据库的关键瓶颈。\n\n作者使用基于Clojure的基准测试，在Apple M1 Pro上证明，SQLite可以实现比PostgreSQL更高的每秒事务数（TPS），尤其是在引入网络延迟的情况下。虽然PostgreSQL在低延迟环境中表现良好，但由于Amdahl定律和跨网络的行锁定，其性能会随着网络延迟的微小增加而迅速下降。\n\nSQLite通过消除网络开销，避免了这个问题。此外，单写者架构允许对事务进行简单的批处理，从而进一步提高了性能。文章通过使用SQLite的SAVEPOINT功能，在批处理中进行细粒度回滚，解决了对事务隔离的担忧。\n\n文章还考虑了并发读取，模拟了真实的读/写混合（75/25），并表明即使在这种负载下，SQLite仍能保持令人印象深刻的TPS。作者提供了在各种条件下（包括不同的网络延迟、隔离级别和连接池大小）比较PostgreSQL和SQLite的基准测试结果。\n\n关键的结论是，对于需要高TPS和大型数据集的应用程序，尤其是在网络延迟是限制因素的情况下，SQLite可能是一种出人意料的有效解决方案。但是，作者警告说，SQLite并非万能药，只有那些了解其局限性并能够轻松管理备份和副本的人才应该使用它。文章最后提供了相关主题的进一步阅读链接，例如Amdahl定律、SQLite扩展和Litestream。"
  },
  {
    "id": "46130187",
    "title": "Japanese game devs face font dilemma as license increases from $380 to $20k",
    "url": "https://www.gamesindustry.biz/japanese-devs-face-font-licensing-dilemma-as-leading-provider-increases-annual-plan-price-from-380-to-20000",
    "summary": "Japanese game developers are facing a significant challenge due to a massive increase in font licensing costs. Fontworks LETS, a major font licensing service, discontinued its affordable game license plan (around $380 USD annually) and replaced it with a significantly more expensive plan through its parent company, Monotype, costing $20,500 USD with a 25,000 user cap. This new plan lacks local pricing for Japanese developers, making it particularly problematic for larger studios.\n\nThe issue is exacerbated by the difficulty in finding suitable and affordable fonts capable of accurately rendering Kanji and Katakana characters. This sudden price hike is causing widespread concern, particularly for live service games that would require extensive re-testing and QA if forced to switch fonts.\n\nThe situation is so dire that some studios might even be forced to rebrand if their corporate identity is heavily reliant on a commercial font they can no longer afford. Indie developers and established studios alike are struggling to find viable and affordable alternatives to navigate this font licensing crisis.\n",
    "chinese_title": "日本游戏开发者面临字体困境：授权费从 380 美元涨至 2 万美元",
    "chinese_summary": "日本游戏开发者正面临着字体授权成本大幅上涨带来的严峻挑战。主要字体授权服务商Fontworks LETS停止了其价格合理的（每年约380美元）游戏授权计划，并由其母公司Monotype推出了一项价格高昂得多的计划，费用高达20,500美元，用户上限为25,000。这项新计划缺乏针对日本开发者的本地定价，这对于大型工作室来说尤其成问题。\n\n由于难以找到能够准确渲染汉字和片假名字符的合适且价格合理的字体，这个问题更加严重。这种突然的价格上涨引起了广泛关注，特别是对于需要大量重新测试和质量保证的在线服务游戏，如果被迫更换字体，情况将更加糟糕。\n\n情况非常严峻，一些工作室甚至可能被迫进行品牌重塑，如果他们的企业形象严重依赖于他们再也负担不起的商业字体。独立开发者和老牌工作室都在努力寻找可行且价格合理的替代方案，以应对这场字体授权危机。"
  },
  {
    "id": "46075873",
    "title": "Mission Critical Advanced Scheduling (ALAP/ASAP) System",
    "url": "https://github.com/rodmena-limited/scriptplan",
    "summary": "ScriptPlan is a mission-critical, advanced scheduling system with minute-level accuracy designed for resource allocation and dependency management. It's compatible with TaskJuggler's .tjp syntax, allowing for easy adoption. Installation is via `pip install scriptplan`.\n\nKey features include report generation in JSON and CSV formats, supporting Unix-style piping and integration with tools like `jq` and `csvkit`. It boasts a content-based SHA256 report ID, lowercase column names, no HTML metadata, no file pollution, and is safe for concurrent execution. A Python API is also available for programmatic access.\n\nScriptPlan is certified for \"Airport-Grade / Mission Critical\" use, with verified capabilities in temporal physics, resource constraints (daily/weekly limits, hierarchical quotas, shift intersections), advanced scheduling (ALAP, priority preemption, smart resource selection), and workflow logic (atomicity, perishability, zero-buffer synchronization). It accurately handles non-standard shift boundaries, prime-number durations, resource contention, and calendar/working time gaps using integer arithmetic to avoid floating-point errors.\n\nAn example project demonstrates ALAP scheduling for a manufacturing process, resolving resource contention and respecting working hours. The project is licensed under Apache 2.0 and was open-sourced by Farshid from the Highway Workflow Engine. It leverages TaskJuggler's syntax for ease of use, and acknowledges TaskJuggler for its original project definition language.\n",
    "chinese_title": "任务关键型高级调度（ALAP/ASAP）系统",
    "chinese_summary": "ScriptPlan：一款任务关键型、先进的调度系统，具有分钟级精度，专为资源分配和依赖关系管理而设计。它兼容 TaskJuggler 的 .tjp 语法，便于轻松采用。可通过 `pip install scriptplan` 进行安装。\n\n主要功能包括生成 JSON 和 CSV 格式的报告，支持 Unix 风格的管道，并与 `jq` 和 `csvkit` 等工具集成。它具有基于内容的 SHA256 报告 ID、小写列名、无 HTML 元数据、无文件污染，并且对于并发执行是安全的。还提供 Python API 以进行编程访问。\n\nScriptPlan 通过了“机场级/任务关键型”使用认证，经验证具有时间物理学、资源约束（每日/每周限制、分层配额、班次交叉）、高级调度（ALAP、优先级抢占、智能资源选择）和工作流程逻辑（原子性、易腐性、零缓冲同步）方面的能力。它使用整数算术精确处理非标准班次边界、素数持续时间、资源争用以及日历/工作时间间隔，以避免浮点错误。\n\n一个示例项目演示了制造过程的 ALAP 调度，解决了资源争用并遵循工作时间。该项目在 Apache 2.0 许可下获得许可，并由 Highway Workflow Engine 的 Farshid 开源。它利用 TaskJuggler 的语法以便于使用，并承认 TaskJuggler 在原始项目定义语言方面的贡献。"
  },
  {
    "id": "46094460",
    "title": "I designed and printed a custom nose guard to help my dog with DLE",
    "url": "https://snoutcover.com/billie-story",
    "summary": "This article tells the story of Billie, a pitbull diagnosed with Discoid Lupus Erythematosus (DLE), an autoimmune disease affecting her nose. The condition caused pigment loss, crusting, scaling, and pain, exacerbated by sunlight. Traditional treatments like sunscreen and medication proved ineffective as Billie licked them off or rubbed off fabric shields. Keeping her indoors drastically reduced her quality of life.\n\nDriven by love and frustration, the author used a 3D printer to design and create SnoutCover, a custom nose guard. The design process involved numerous iterations, starting with PLA for initial measurements and transitioning to flexible TPU for comfort. Early prototypes lacked ventilation and proper fit, but through constant redesign, including adding ventilation holes and an adjustable strap system, a functional and comfortable design was achieved.\n\nSnoutCover effectively protected Billie's nose from UV rays, prevented her from licking off medication, and stayed securely in place. Within five months of using SnoutCover, Billie's nose healed completely: the bleeding stopped, crusting reduced, pigment returned, and the texture improved.\n\nInspired by the positive response on Reddit and MakerWorld, the author is sharing the SnoutCover design for free on MakerWorld, hoping to help other dogs suffering from DLE or similar nose conditions. The design is intended for medium-to-large dogs and can be adjusted in slicer software. The article emphasizes that SnoutCover was born from love and a refusal to accept that Billie's suffering was inevitable, offering hope to other dog parents facing similar challenges.\n",
    "chinese_title": "我设计并打印了一个定制的鼻罩，以帮助我的狗狗治疗DLE。",
    "chinese_summary": "本文讲述了比特犬比莉的故事。比莉被诊断出患有盘状红斑狼疮 (DLE)，这是一种影响她鼻子的自身免疫性疾病。这种疾病导致色素流失、结痂、脱屑和疼痛，阳光照射会加剧这些症状。传统的治疗方法，如防晒霜和药物，都证明无效，因为比莉会舔掉它们，或者用布料遮挡也会被蹭掉。把她关在室内大大降低了她的生活质量。\n\n出于爱和无奈，作者使用 3D 打印机设计并制作了 SnoutCover，一种定制的鼻子防护罩。设计过程涉及多次迭代，最初使用 PLA 进行初始测量，然后过渡到柔软的 TPU 以提高舒适度。早期的原型缺乏通风和适当的贴合度，但通过不断的重新设计，包括增加通风孔和可调节的带子系统，最终实现了功能性和舒适性的设计。\n\nSnoutCover 有效地保护了比莉的鼻子免受紫外线伤害，防止她舔掉药物，并能牢固地固定到位。使用 SnoutCover 五个月后，比莉的鼻子完全痊愈：出血停止了，结痂减少了，色素恢复了，皮肤质地也得到了改善。\n\n受到 Reddit 和 MakerWorld 上积极回应的启发，作者在 MakerWorld 上免费分享 SnoutCover 的设计，希望能帮助其他患有 DLE 或类似鼻子疾病的狗狗。该设计适用于中型到大型犬，并且可以在切片软件中进行调整。文章强调，SnoutCover 源于爱，以及不接受比莉的痛苦是不可避免的这种想法，为其他面临类似挑战的狗父母提供了希望。"
  },
  {
    "id": "46095662",
    "title": "Beej's Guide to Learning Computer Science",
    "url": "https://beej.us/guide/bglcs/",
    "summary": "\"Beej's Guide to Learning Computer Science\" is a work-in-progress guide, currently in beta, aimed at helping individuals learn computer science. The author, Beej, invites readers to provide feedback and corrections to improve the document. The guide is available in various formats, including HTML (multiple versions for different screen sizes and delivery methods), and PDF (in both US Letter and A4 sizes, with one-sided and two-sided printing options, and with or without syntax highlighting).\n\nThe document also offers resources for translators and writers who wish to contribute to the guide, providing instructions on how to clone the project from GitHub and follow the README. Beej can be contacted directly at beej@beej.us for inquiries and feedback. The guide is presented as incomplete but hopefully useful, and different formats are offered for accessibility.\n",
    "chinese_title": "Beej的计算机科学学习指南",
    "chinese_summary": "《Beej计算机科学学习指南》是一份仍在完善中的指南，目前处于测试阶段，旨在帮助个人学习计算机科学。作者Beej邀请读者提供反馈和更正，以改进文档。该指南提供多种格式，包括HTML（针对不同屏幕尺寸和传输方式的多个版本）和PDF（美国信纸和A4尺寸，单面和双面打印选项，以及带或不带语法高亮）。\n\n该文档还为希望为指南做出贡献的翻译者和编写者提供资源，提供有关如何从GitHub克隆项目并遵循README的说明。如有疑问和反馈，可直接通过beej@beej.us联系Beej。该指南目前尚未完成，但希望对大家有所帮助，并提供不同的格式以提高可访问性。"
  },
  {
    "id": "46126964",
    "title": "Ecosia: The greenest AI is here",
    "url": "https://blog.ecosia.org/ecosia-ai/",
    "summary": "Ecosia, the search engine that plants trees, is launching AI-powered features called \"Overviews\" and \"AI Search\" while maintaining its commitment to environmental responsibility and user privacy. \"Overviews\" provides concise summaries with citations at the top of search results, which users can disable if they prefer the classic experience. \"AI Search\" offers an interactive chat mode for detailed questions and eco tips.\n\nEcosia differentiates itself by prioritizing sustainability in its AI development. It uses smaller, more efficient AI models and avoids energy-intensive features like video generation. Furthermore, Ecosia generates more renewable energy than its AI features consume, investing €18M in solar and wind energy projects to displace fossil fuels. The company tracks its energy usage with tools like the AI Energy Score and Ecologits.\n\nPrivacy is another key focus. Ecosia collects only necessary data and adheres to GDPR regulations. It has launched its own independent European search index to maintain control over its technology and ensure it remains privacy-friendly. As a company, Ecosia doesn't run other platforms like email or maps to avoid gathering excessive user data.\n\nEcosia invites user feedback to improve its AI features and encourages collaboration to build a future that prioritizes both intelligence and environmental kindness.\n",
    "chinese_title": "Ecosia：最环保的AI来了",
    "chinese_summary": "Ecosia，种树的搜索引擎，正推出名为“概览”和“AI搜索”的AI驱动功能，同时坚持其对环境责任和用户隐私的承诺。“概览”在搜索结果顶部提供带有引用的简洁摘要，用户可以选择禁用以获得经典体验。“AI搜索”提供交互式聊天模式，用于解答详细问题和提供环保建议。\n\nEcosia通过在其AI开发中优先考虑可持续性来突出自身。它使用更小、更高效的AI模型，并避免使用视频生成等能源密集型功能。此外，Ecosia产生的可再生能源超过其AI功能消耗的能源，并投资1800万欧元于太阳能和风能项目以替代化石燃料。该公司使用AI能量评分和Ecologits等工具来跟踪其能源使用情况。\n\n隐私是另一个关键关注点。Ecosia只收集必要的数据并遵守GDPR法规。它已启动其独立的欧洲搜索索引，以保持对其技术的控制并确保其保持对隐私的友好性。作为一家公司，Ecosia不运营电子邮件或地图等其他平台，以避免收集过多的用户数据。\n\nEcosia邀请用户提供反馈以改进其AI功能，并鼓励合作以构建一个既重视智能又重视环境友好的未来。"
  },
  {
    "id": "46121889",
    "title": "Mistral 3 family of models released",
    "url": "https://mistral.ai/news/mistral-3",
    "summary": "Mistral AI has released its Mistral 3 family of open-source AI models, including the flagship Mistral Large 3, a sparse mixture-of-experts model, and the Ministral 3 series designed for edge and local use. The models are released under the Apache 2.0 license, promoting accessibility and customization.\n\nMistral Large 3 is presented as a state-of-the-art open model, trained on NVIDIA H200 GPUs and achieving parity with leading instruction-tuned models in general prompts and excelling in image understanding and multilingual conversations. It is also performant on leaderboards like LMArena. A reasoning version is planned.\n\nThe Ministral 3 series comprises three models (3B, 8B, and 14B parameters) with base, instruct, and reasoning variants, all featuring image understanding. They are designed for efficient performance and a favorable cost-to-performance ratio.\n\nMistral collaborated with NVIDIA, vLLM, and Red Hat to optimize and improve the accessibility of its models. They have been trained on NVIDIA Hopper GPUs, and optimized inference support on TensorRT-LLM and SGLang for the complete Mistral 3 family for efficient low-precision execution, and have a checkpoint in NVFP4 format available for efficient utilization.\n\nMistral 3 is available on platforms like Mistral AI Studio, Amazon Bedrock, Azure Foundry, Hugging Face, and others. Custom model training services are also offered for tailored AI solutions. The release emphasizes open access, multimodality, multilingual capabilities, scalable efficiency, and adaptability for diverse applications.\n",
    "chinese_title": "Mistral 3模型系列发布",
    "chinese_summary": "Mistral AI 发布 Mistral 3 系列开源 AI 模型，包括旗舰模型 Mistral Large 3（稀疏混合专家模型）和专为边缘和本地使用设计的 Ministral 3 系列。这些模型以 Apache 2.0 许可证发布，旨在提高可访问性和定制性。\n\nMistral Large 3 被誉为最先进的开源模型，在 NVIDIA H200 GPU 上训练，在通用提示中与领先的指令调优模型持平，并在图像理解和多语言对话方面表现出色。它在 LMArena 等排行榜上也表现出色。推理版本正在计划中。\n\nMinistral 3 系列包含三个模型（3B、8B 和 14B 参数），具有基础、指令和推理变体，全部具有图像理解能力。它们专为高效性能和良好的性价比而设计。\n\nMistral 与 NVIDIA、vLLM 和 Red Hat 合作，优化并提高其模型的可访问性。它们已在 NVIDIA Hopper GPU 上进行训练，并在 TensorRT-LLM 和 SGLang 上针对整个 Mistral 3 系列进行了优化推理支持，以实现高效的低精度执行，并且具有 NVFP4 格式的检查点可用于高效利用。\n\nMistral 3 可在 Mistral AI Studio、Amazon Bedrock、Azure Foundry、Hugging Face 等平台上使用。还提供定制模型训练服务，以满足量身定制的 AI 解决方案的需求。此次发布强调开放访问、多模态、多语言能力、可扩展的效率以及对各种应用程序的适应性。"
  },
  {
    "id": "46047170",
    "title": "YesNotice",
    "url": "https://infinitedigits.co/docs/software/yesnotice/",
    "summary": "YesNotice, launched on October 10, 2025, is a software portfolio project. Its core function is to provide real-time notifications to users whenever something they are tracking changes from a negative (\"no\") to a positive (\"yes\") state. In essence, the website proactively alerts users to positive shifts in information or status that they are monitoring.\n",
    "chinese_title": "是的通知",
    "chinese_summary": "YesNotice，于2025年10月10日发布，是一个软件组合项目。其核心功能是向用户提供实时通知，每当他们跟踪的事物从负面（“否”）状态变为正面（“是”）状态时。本质上，该网站会主动提醒用户他们正在监控的信息或状态的积极转变。"
  },
  {
    "id": "46120549",
    "title": "A series of vignettes from my childhood and early career",
    "url": "https://www.jasonscheirer.com/weblog/vignettes/",
    "summary": "This article is a series of humorous, anecdotal vignettes reflecting on the author's experiences in the software development field, and how predictions of its demise have consistently proven wrong.\n\nThe first few stories revolve around the idea that software engineering would be obsolete, first by object-oriented programming, then by multimedia, and later by powerful IDEs like IntelliJ. In each case, experts predicted the end of programming jobs, with technology automating away the need for human coders. However, the author points out that new problems always arise, and technology simply evolves to a higher level of abstraction, requiring more complex problem-solving skills.\n\nThe author then shares two stories of automating tasks, once helping a contractor out of a job by automating a migration process, and once automating their own job of updating a website with an Excel sheet of data. In both cases, the prediction of job loss didn't come to fruition, either for the contractor or the author.\n\nThe article then contrasts the responsible data collection practices used in early NLP projects with the current climate surrounding LLMs. The author recalls meticulously respecting copyrights and permissions, a stark difference from the data practices used today.\n\nFinally, the author contrasts the dot-com boom and bust to the Web 2.0 era, observing how the promise of the internet was realized through organic growth and solid business models, rather than forced integration and hype.\n\nIn closing, the author reveals that the article is a series of \"passive-aggressive jabs\" at the current hype surrounding Large Language Models (LLMs), likely suggesting similar predictions of obsolescence are happening now.\n",
    "chinese_title": "童年及早期职业生涯片段",
    "chinese_summary": "本文以一系列幽默的轶事短篇，反思作者在软件开发领域的经验，以及该领域衰落的预测如何一再被证明是错误的。\n\n最初的几个故事围绕着软件工程将会过时的想法展开，先是由于面向对象编程，然后是多媒体，后来是像IntelliJ这样强大的IDE。在每一种情况下，专家们都预测编程工作的终结，因为技术将自动化地取代对人类程序员的需求。然而，作者指出，新的问题总是会出现，技术只是进化到更高的抽象层次，需要更复杂的解决问题的能力。\n\n接着，作者分享了两个关于自动化任务的故事，一次是通过自动化迁移过程帮助承包商摆脱困境，另一次是自动化了自己用Excel表格更新网站数据的工作。在这两种情况下，失业的预测都没有实现，无论是对承包商还是作者而言。\n\n文章随后将早期NLP项目中负责任的数据收集实践与当前围绕LLM的环境进行了对比。作者回忆起一丝不苟地尊重版权和许可，这与今天使用的数据实践形成了鲜明对比。\n\n最后，作者将互联网泡沫与Web 2.0时代进行了对比，观察到互联网的承诺是通过有机增长和可靠的商业模式实现的，而不是通过强制集成和炒作实现的。\n\n最后，作者透露本文是对当前围绕大型语言模型（LLM）炒作的一系列“被动攻击”，可能暗示着类似的关于过时的预测正在发生。"
  },
  {
    "id": "46123747",
    "title": "Apple to beat Samsung in smartphone shipments for first time in 14 years",
    "url": "https://sherwood.news/tech/apple-to-beat-samsung-in-smartphone-shipments-for-first-time-in-14-years/",
    "summary": "According to a Counterpoint Research report highlighted by CNBC, Apple is projected to surpass Samsung in smartphone shipments for the first time in 14 years. Driven by the popularity of the iPhone 17, Apple is expected to ship approximately 243 million phones in 2025, securing 19.4% of the global market share. Samsung is forecasted to ship 235 million phones, resulting in an 18.7% market share. The report attributes Apple's anticipated lead to a favorable upgrade cycle and the upcoming release of a more affordable entry-level iPhone in the following year. These factors are expected to contribute to Apple maintaining its leadership position in the smartphone market for the next few years.\n",
    "chinese_title": "苹果将在14年来首次超越三星成为智能手机出货量第一",
    "chinese_summary": "据CNBC引用的Counterpoint Research报告显示，苹果预计将在14年来首次超越三星，成为智能手机出货量第一的厂商。 在iPhone 17的推动下，苹果预计将在2025年出货约2.43亿部手机，占据全球19.4%的市场份额。 三星预计将出货2.35亿部手机，市场份额为18.7%。 该报告认为，苹果预计领先的原因在于有利的升级周期以及明年即将发布的更实惠的入门级iPhone。 这些因素预计将有助于苹果在未来几年保持其在智能手机市场的领导地位。"
  },
  {
    "id": "46052478",
    "title": "Learning music with Strudel",
    "url": "https://terryds.notion.site/Learning-Music-with-Strudel-2ac98431b24180deb890cc7de667ea92",
    "summary": "This looks like a broken placeholder or a message indicating an error on a Notion page. There's no real content about \"Learning music with Strudel.\" The entire content is a notification that JavaScript is required to use Notion and instructions to enable it.\n\nTherefore, the summary is:\n\nThis is not an article. It's a notification from Notion. It indicates that the webpage requires JavaScript to function and instructs the user to enable it. There is no content present about learning music with Strudel.\n",
    "chinese_title": "用Strudel学习音乐",
    "chinese_summary": "这看起来像 Notion 页面上的一个损坏的占位符或错误提示信息。 并没有关于“使用 Strudel 学习音乐”的实际内容。整个内容是一个使用 Notion 需要 JavaScript 的通知，以及启用 JavaScript 的说明。\n\n因此，总结为：\n\n这不是一篇文章，而是来自 Notion 的一个通知。它表明该网页需要 JavaScript 才能运行，并指示用户启用它。没有关于使用 Strudel 学习音乐的内容。"
  },
  {
    "id": "46054295",
    "title": "All Sources of DirectX 12 Documentation",
    "url": "https://asawicki.info/news_1794_all_sources_of_directx_12_documentation",
    "summary": "This blog post, titled \"All Sources of DirectX 12 Documentation,\" discusses the scattered and incomplete nature of official DirectX 12 documentation and compiles a list of resources for developers.\n\nThe author highlights the importance of comprehensive documentation for graphics APIs, comparing the situation to Vulkan's more complete (though formal) specification. They then critique the fragmented state of DirectX 12 documentation, spread across multiple websites and formats.\n\nThe post lists six key sources of DirectX 12 documentation:\n\n1.  **Direct3D 12 programming guide @ learn.microsoft.com:**  This is presented as the main documentation hub, but it's acknowledged to be incomplete.\n2.  **Direct3D 11.3 Functional Specification:** An older document that can fill in gaps where D3D12 documentation is lacking.\n3.  **github.com/microsoft/DirectX-Specs:** A GitHub repository containing documentation for newer DirectX 12 features introduced in the Agility SDK.\n4.  **github.com/microsoft/DirectXShaderCompiler/wiki:** A GitHub Wiki dedicated to the HLSL shader language and compiler.\n5.  **github.com/microsoft/hlsl-specs:** Another GitHub repository containing a \"Working Draft\" HLSL specification and proposals for future language features.\n6.  **DirectX Developer Blog:** A blog that publishes news, updates, and standalone articles related to DirectX.\n\nThe author expresses frustration with the disorganization and attributes it to internal factors at Microsoft, such as a focus on new features over thorough documentation and the organizational structure mirroring the documentation's fragmentation. They end on a hopeful note, citing initiatives like the HLSL specification as signs that things might improve. Finally, the author mentiones the DirectX Landing Page which gathers links to many SDKs, tools, helpers, samples, and other projects related to DirectX.\n",
    "chinese_title": "所有DirectX 12文档来源",
    "chinese_summary": "所有DirectX 12文档来源\n\n这篇名为“所有DirectX 12文档来源”的博文讨论了官方DirectX 12文档分散且不完整的现状，并为开发者整理了一份资源列表。\n\n作者强调了完备的图形API文档的重要性，并将这种情况与Vulkan更完整（尽管形式化）的规范进行了比较。 然后，他们批评了DirectX 12文档的碎片化状态，这些文档分散在多个网站和格式中。\n\n该文章列出了六个主要的DirectX 12文档来源：\n\n1.  **Direct3D 12编程指南 @ learn.microsoft.com：** 这被认为是主要的文档中心，但也被认为是是不完整的。\n2.  **Direct3D 11.3功能规范：** 一个较旧的文档，可以填补D3D12文档中缺失的空白。\n3.  **github.com/microsoft/DirectX-Specs：** 一个GitHub仓库，包含Agility SDK中引入的较新的DirectX 12功能的文档。\n4.  **github.com/microsoft/DirectXShaderCompiler/wiki：** 一个专门介绍HLSL着色器语言和编译器的GitHub Wiki。\n5.  **github.com/microsoft/hlsl-specs：** 另一个GitHub仓库，包含HLSL规范的“工作草案”和未来语言功能的提案。\n6.  **DirectX开发者博客：** 一个发布与DirectX相关的新闻、更新和独立文章的博客。\n\n作者对这种缺乏组织的情况表示沮丧，并将其归因于微软内部因素，例如专注于新功能而忽视了详尽的文档，以及组织结构反映了文档的碎片化。他们以充满希望的结尾，引用了诸如HLSL规范之类的举措，认为情况可能会有所改善。最后，作者提到了DirectX 登陆页面，该页面收集了许多与 DirectX 相关的 SDK、工具、助手、示例和其他项目的链接。"
  },
  {
    "id": "46136188",
    "title": "DNA analysis suggests first Australians arrived about 60k years ago",
    "url": "https://www.abc.net.au/news/science/2025-11-29/sahul-aboriginal-australia-65000-genetic-evidence/106054352",
    "summary": "This ABC Science article discusses new DNA analysis suggesting the first Australians arrived approximately 60,000 years ago, a timeframe that aligns more closely with archaeological evidence. Previously, genetic studies suggested a later arrival, between 47,000 and 51,000 years ago, creating a gap with the archaeological record placing habitation at around 65,000 years ago.\n\nThe new study, analyzing mitochondrial DNA from a large sample of Indigenous Australians and New Guineans, proposes that people migrated to Sahul (the landmass comprising Australia, New Guinea, and Tasmania) via two routes, one from the Philippines and Sulawesi, and another from the south, both around 60,000 years ago. The research corrected for varying mutation rates in mitochondrial DNA, resulting in a date consistent with the \"long chronology\" supported by archaeological finds like the Madjedbebe rock shelter.\n\nThe study emphasizes the advanced seafaring capabilities of these early humans, highlighting deliberate voyages rather than accidental drift. While some experts remain cautious, emphasizing the ongoing debate and the need for further research to refine the genetic timeline, others see this study as a significant step toward reconciling the differences between genetic and archaeological evidence. The authors plan to analyze whole human genome sequences to further validate their findings. The article also touches upon the deep cultural connection of Indigenous Australians to their land.\n",
    "chinese_title": "DNA分析表明，第一批澳大利亚人大约在六万年前抵达。",
    "chinese_summary": "ABC科学文章：DNA分析表明首批澳大利亚人约六万年前抵达"
  },
  {
    "id": "46093613",
    "title": "YouTube increases FreeBASIC performance (2019)",
    "url": "https://freebasic.net/forum/viewtopic.php?t=27927",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "YouTube 提升 FreeBASIC 性能 (2019)",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "46056181",
    "title": "Practical Intro to Operational Transformation",
    "url": "https://archive.casouri.cc/note/2025/practical-intro-ot/",
    "summary": "This article provides a practical introduction to Operational Transformation (OT), a technique for collaborative editing. It begins by contrasting OT with Conflict-Free Replicated Data Types (CRDTs), the other primary approach to collaborative editing. OT transforms operations like insert and delete to ensure consistency when concurrent edits occur, while CRDTs guarantee eventual consistency through operations that can be applied in any order.\n\nThe article emphasizes that no single \"best\" OT algorithm exists, highlighting the trade-offs between different algorithms. It introduces key OT concepts, including Transformation Properties (TP1 and TP2), which define the correctness of transformations. TP1 is easily satisfied, whereas TP2 is rarely satisfied, requiring control algorithms to manage operation sequencing.\n\nA core component of OT is the control algorithm, which ensures that operations are transformed correctly based on their context (the state of the document when the operation was created). The article also delves into the complexities of implementing \"undo\" functionality in OT, explaining the inverse properties (IP1, IP2, and IP3) and how tombstones (marking deleted characters without actually removing them) can simplify the undo process.\n\nFinally, the article presents a simplified OT algorithm that uses string-based insert and delete operations, a central server to manage the global operation sequence, and tombstones for simpler undo functionality. While this simplified algorithm doesn't support rich text or distribution, it offers a concrete example of how OT can be implemented.\n",
    "chinese_title": "实用操作转换入门",
    "chinese_summary": "本文对协同编辑技术——操作转换(OT)提供了一个实用的介绍。首先将OT与无冲突复制数据类型(CRDTs)进行对比，后者是协同编辑的另一种主要方法。OT转换插入和删除等操作，以确保并发编辑发生时的一致性，而CRDTs则通过可以以任何顺序应用的操作来保证最终一致性。\n\n本文强调不存在单一“最佳”的OT算法，并突出了不同算法之间的权衡。它介绍了关键的OT概念，包括转换属性(TP1和TP2)，这些属性定义了转换的正确性。TP1很容易满足，而TP2很少满足，需要控制算法来管理操作排序。\n\nOT的核心组成部分是控制算法，它确保操作根据其上下文（操作创建时文档的状态）进行正确的转换。本文还深入探讨了在OT中实现“撤销”功能的复杂性，解释了逆属性（IP1、IP2和IP3）以及墓碑（标记已删除的字符而不实际删除它们）如何简化撤销过程。\n\n最后，本文介绍了一种简化的OT算法，该算法使用基于字符串的插入和删除操作，一个用于管理全局操作序列的中央服务器，以及用于简化撤销功能的墓碑。虽然这种简化的算法不支持富文本或分布式，但它提供了一个OT如何实现的具体例子。"
  },
  {
    "id": "46124892",
    "title": "Cursed circuits: charge pump voltage halver",
    "url": "https://lcamtuf.substack.com/p/cursed-circuits-charge-pump-voltage",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "诅咒电路：电荷泵降压器",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "46132964",
    "title": "It's Not Always ICache",
    "url": "https://matklad.github.io/2021/07/10/its-not-always-icache.html",
    "summary": "This article explores why inlining code, often touted as an optimization, can sometimes lead to performance slowdowns. The author challenges the common explanation of Instruction Cache (ICache) misses, arguing that it's often cited without direct evidence. They investigate a case from the `once_cell` Rust library where removing an `#[inline]` annotation improved performance.\n\nUsing a synthetic benchmark, the author compares performance with and without inlining. They then employ tools like `perf stat` and `valgrind` to analyze CPU-level performance counters and cache behavior. While initial results show some ICache differences, the most significant finding is a change in the number of instructions executed.\n\nThe author then delves into assembly code (`cargo-asm`) to understand the instruction difference. They discover that inlining increases code size, leads to larger function prologues and epilogues (due to increased register usage), and can cause the compiler to hoist code from the inlined function into the calling function's hot path. A crucial finding is an extra `cmp` instruction introduced due to the loop counter incrementing instead of decrementing, accounting for the performance difference.\n\nThe article concludes that inlining can degrade performance not only due to potential ICache issues, but also due to increased register usage, code hoisting that moves instructions into hot paths unnecessarily, and subtle changes to loop logic that can introduce extra instructions. The author emphasizes the importance of using performance analysis tools and examining assembly code to understand the true reasons behind performance changes.\n",
    "chinese_title": "并非总是ICache",
    "chinese_summary": "内联代码并非总是优化：一个反例"
  },
  {
    "id": "46124063",
    "title": "The Junior Hiring Crisis",
    "url": "https://people-work.io/blog/junior-hiring-crisis/",
    "summary": "生成摘要时出错",
    "chinese_title": "The Junior Hiring Crisis",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46121539",
    "title": "Zig's new plan for asynchronous programs",
    "url": "https://lwn.net/SubscriberLink/1046084/4c048ee008e1c70e/",
    "summary": "生成摘要时出错",
    "chinese_title": "Zig's new plan for asynchronous programs",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46134965",
    "title": "Apple Pushes iPhone Users Still on iOS 18 to Upgrade to iOS 26",
    "url": "https://www.macrumors.com/2025/12/02/apple-pushes-ios-18-users-to-ios-26/",
    "summary": "生成摘要时出错",
    "chinese_title": "Apple Pushes iPhone Users Still on iOS 18 to Upgrade to iOS 26",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46135357",
    "title": "An extra solar system planet once orbited next to Earth",
    "url": "https://www.livescience.com/space/planets/an-extra-solar-system-planet-once-orbited-next-to-earth-and-it-may-be-the-reason-we-have-a-moon",
    "summary": "生成摘要时出错",
    "chinese_title": "An extra solar system planet once orbited next to Earth",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46116567",
    "title": "After Windows Update, Password icon invisible, click where it used to be",
    "url": "https://support.microsoft.com/en-us/topic/august-29-2025-kb5064081-os-build-26100-5074-preview-3f9eb9e1-72ca-4b42-af97-39aace788d93",
    "summary": "生成摘要时出错",
    "chinese_title": "After Windows Update, Password icon invisible, click where it used to be",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46121799",
    "title": "Nixtml: Static website and blog generator written in Nix",
    "url": "https://github.com/arnarg/nixtml",
    "summary": "生成摘要时出错",
    "chinese_title": "Nixtml: Static website and blog generator written in Nix",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46132822",
    "title": "India withdraws mandatory pre-installation of Sanchar Saathi app on smartphones",
    "url": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2198110&reg=3&lang=2",
    "summary": "生成摘要时出错",
    "chinese_title": "India withdraws mandatory pre-installation of Sanchar Saathi app on smartphones",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46125184",
    "title": "Claude 4.5 Opus’ Soul Document",
    "url": "https://www.lesswrong.com/posts/vpNG99GhbBoLov9og/claude-4-5-opus-soul-document",
    "summary": "生成摘要时出错",
    "chinese_title": "Claude 4.5 Opus’ Soul Document",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46054338",
    "title": "Code Wiki: Accelerating your code understanding",
    "url": "https://developers.googleblog.com/en/introducing-code-wiki-accelerating-your-code-understanding/",
    "summary": "生成摘要时出错",
    "chinese_title": "Code Wiki: Accelerating your code understanding",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46130609",
    "title": "Cars are steadily becoming longer, wider and heavier in the UK and across Europe",
    "url": "https://www.bbc.com/news/articles/cy7vdvl2531o",
    "summary": "生成摘要时出错",
    "chinese_title": "Cars are steadily becoming longer, wider and heavier in the UK and across Europe",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46119214",
    "title": "Comparing AWS Lambda ARM64 vs. x86_64 Performance Across Runtimes in Late 2025",
    "url": "https://chrisebert.net/comparing-aws-lambda-arm64-vs-x86_64-performance-across-multiple-runtimes-in-late-2025/",
    "summary": "生成摘要时出错",
    "chinese_title": "Comparing AWS Lambda ARM64 vs. x86_64 Performance Across Runtimes in Late 2025",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46127868",
    "title": "Exploring Large HTML Documents on the Web",
    "url": "https://calendar.perfplanet.com/2025/exploring-large-html-documents-on-the-web/",
    "summary": "生成摘要时出错",
    "chinese_title": "Exploring Large HTML Documents on the Web",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46129476",
    "title": "Kohler Can Access Pictures from \"End-to-End Encrypted\" Toilet Camera",
    "url": "https://varlogsimon.leaflet.pub/3m6zrw6k2bs2p?interactionDrawer=quotes",
    "summary": "生成摘要时出错",
    "chinese_title": "Kohler Can Access Pictures from \"End-to-End Encrypted\" Toilet Camera",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46118722",
    "title": "How Brian Eno Created Ambient 1: Music for Airports (2019)",
    "url": "https://reverbmachine.com/blog/deconstructing-brian-eno-music-for-airports/",
    "summary": "生成摘要时出错",
    "chinese_title": "How Brian Eno Created Ambient 1: Music for Airports (2019)",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46131411",
    "title": "Apple will not let me join the Developer Program – and will not say why",
    "url": "https://blog.kulman.sk/apple-developer-program/",
    "summary": "生成摘要时出错",
    "chinese_title": "Apple will not let me join the Developer Program – and will not say why",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46135764",
    "title": "LNG Exports Will Drive Explosion in U.S. Natural Gas Consumption",
    "url": "https://oilprice.com/Energy/Natural-Gas/LNG-Exports-Will-Drive-Explosion-in-US-Natural-Gas-Consumption.html",
    "summary": "生成摘要时出错",
    "chinese_title": "LNG Exports Will Drive Explosion in U.S. Natural Gas Consumption",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46128505",
    "title": "The Rise and Fall of the H-1B Visa – American Affairs Journal",
    "url": "https://americanaffairsjournal.org/2025/11/the-rise-and-fall-of-the-h-1b-visa/",
    "summary": "生成摘要时出错",
    "chinese_title": "The Rise and Fall of the H-1B Visa – American Affairs Journal",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46132234",
    "title": "Instant Supercompute: Launching Wolfram Compute Services",
    "url": "https://writings.stephenwolfram.com/2025/12/instant-supercompute-launching-wolfram-compute-services/",
    "summary": "生成摘要时出错",
    "chinese_title": "Instant Supercompute: Launching Wolfram Compute Services",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46091211",
    "title": "Tom Stoppard has died",
    "url": "https://www.bbc.com/news/articles/c74xe49q7vlo",
    "summary": "生成摘要时出错",
    "chinese_title": "Tom Stoppard has died",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46127400",
    "title": "AI generated font using Nano Banana",
    "url": "https://constanttime.notion.site/Worlds-first-Ai-generated-font-using-nano-banana-2ba6f8e15af18012864bdb760fa9c9ba?pvs=74",
    "summary": "生成摘要时出错",
    "chinese_title": "AI generated font using Nano Banana",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46104193",
    "title": "India orders smartphone makers to preload state-owned cyber safety app",
    "url": "https://www.reuters.com/sustainability/boards-policy-regulation/india-orders-mobile-phones-preloaded-with-government-app-ensure-cyber-safety-2025-12-01/",
    "summary": "生成摘要时出错",
    "chinese_title": "India orders smartphone makers to preload state-owned cyber safety app",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46108780",
    "title": "DeepSeek-v3.2: Pushing the frontier of open large language models [pdf]",
    "url": "https://huggingface.co/deepseek-ai/DeepSeek-V3.2/resolve/main/assets/paper.pdf",
    "summary": "生成摘要时出错",
    "chinese_title": "DeepSeek-v3.2: Pushing the frontier of open large language models [pdf]",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46116724",
    "title": "Reverse math shows why hard problems are hard",
    "url": "https://www.quantamagazine.org/reverse-mathematics-illuminates-why-hard-problems-are-hard-20251201/",
    "summary": "生成摘要时出错",
    "chinese_title": "Reverse math shows why hard problems are hard",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46133286",
    "title": "The Algorithm That Exposed the AI Industry's Circular Financing Scheme",
    "url": "https://substack.com/home/post/p-179453867",
    "summary": "生成摘要时出错",
    "chinese_title": "The Algorithm That Exposed the AI Industry's Circular Financing Scheme",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46117802",
    "title": "Apple Releases Open Weights Video Model",
    "url": "https://starflow-v.github.io",
    "summary": "生成摘要时出错",
    "chinese_title": "Apple Releases Open Weights Video Model",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46117112",
    "title": "What will enter the public domain in 2026?",
    "url": "https://publicdomainreview.org/features/entering-the-public-domain/2026/",
    "summary": "生成摘要时出错",
    "chinese_title": "What will enter the public domain in 2026?",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46080307",
    "title": "Lowtype: Elegant Types in Ruby",
    "url": "https://codeberg.org/Iow/type",
    "summary": "生成摘要时出错",
    "chinese_title": "Lowtype: Elegant Types in Ruby",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46073978",
    "title": "Mathematics is hard for mathematicians to understand too",
    "url": "https://www.science.org/doi/10.1126/science.aec9014",
    "summary": "生成摘要时出错",
    "chinese_title": "Mathematics is hard for mathematicians to understand too",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46118432",
    "title": "Rootless Pings in Rust",
    "url": "https://bou.ke/blog/rust-ping/",
    "summary": "生成摘要时出错",
    "chinese_title": "Rootless Pings in Rust",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46096337",
    "title": "Advent of Code 2025",
    "url": "https://adventofcode.com/2025/about",
    "summary": "生成摘要时出错",
    "chinese_title": "Advent of Code 2025",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46119500",
    "title": "Advent of Compiler Optimisations 2025",
    "url": "https://xania.org/202511/advent-of-compiler-optimisation",
    "summary": "生成摘要时出错",
    "chinese_title": "Advent of Compiler Optimisations 2025",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46117126",
    "title": "Decreasing Certificate Lifetimes to 45 Days",
    "url": "https://letsencrypt.org/2025/12/02/from-90-to-45.html",
    "summary": "生成摘要时出错",
    "chinese_title": "Decreasing Certificate Lifetimes to 45 Days",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46120611",
    "title": "Python Data Science Handbook",
    "url": "https://jakevdp.github.io/PythonDataScienceHandbook/",
    "summary": "生成摘要时出错",
    "chinese_title": "Python Data Science Handbook",
    "chinese_summary": "生成摘要时出错"
  }
]