[
  {
    "id": "44540402",
    "title": "MacPaint Art from the Mid-80s Still Looks Great Today",
    "url": "https://blog.decryption.net.au/posts/macpaint.html",
    "summary": "This blog post, titled \"MacPaint Art From The Mid-80s Still Looks Great Today,\" explores the author's rediscovery of early MacPaint art from the mid-1980s. Inspired by the BMUG's CD-ROM, the author delved into over 18,000 MacPaint images on Discmaster and shares some of the \"gems\" they unearthed. The author plans to share more smaller drawings/icons in a future blog post.\n\nA key theme is the appreciation for the artistry achieved within the limitations of the era's technology, specifically the small, 1-bit screens of the original Macintosh. The author expresses curiosity about the artists behind these works and wonders what they have accomplished since, given their evident talent.\n\nThe blog post concludes with a brief mention of the Amiga computer, a contemporary of the Macintosh, and the author's intention to explore the art created on that platform as well, suggesting a broader interest in the history of early home computer art.\n",
    "chinese_title": "80年代中期的MacPaint艺术作品，今天依然赏心悦目",
    "chinese_summary": "八十年代中期MacPaint艺术作品，至今仍令人惊艳\n\n这篇博文讲述了作者重新发现八十年代中期早期MacPaint艺术作品的故事。受到BMUG的CD-ROM启发，作者深入研究了Discmaster上的超过18,000张MacPaint图像，并分享了他们挖掘出的一些“珍品”。作者计划在未来的博文中分享更多较小的图画/图标。\n\n一个关键的主题是欣赏在那个时代的技术限制下所取得的艺术成就，特别是原始Macintosh的小型单色屏幕。作者对这些作品背后的艺术家表达了好奇，并想知道鉴于他们显而易见的天赋，他们此后取得了什么成就。\n\n博文最后简要提到了Macintosh的同期产品Amiga电脑，以及作者探索该平台创作的艺术作品的意图，暗示了作者对早期家用电脑艺术史的更广泛兴趣。"
  },
  {
    "id": "44543150",
    "title": "Proposed NOAA Budget Kills Program Designed to Prevent Satellite Collisions",
    "url": "https://skyandtelescope.org/astronomy-news/proposed-noaa-budget-kills-program-to-prevent-satellite-collisions/",
    "summary": "The Sky & Telescope article reports that the proposed NOAA budget for the upcoming fiscal year eliminates funding for the Space Weather Follow-On L1 (SWFO-L1) program's Compact Coronagraph (CCOR), an instrument designed to monitor coronal mass ejections (CMEs) from the Sun. CMEs are solar events that can disrupt Earth's magnetic field, impacting satellite operations and even causing power grid failures. CCOR was intended to provide crucial advance warning of these events.\n\nThe primary concern is that without CCOR, NOAA's ability to predict and mitigate the effects of space weather will be significantly reduced, increasing the risk of satellite collisions. Accurate prediction of CME arrival times is critical for satellite operators to take protective measures, such as temporarily powering down sensitive systems or adjusting satellite orbits.\n\nThe article highlights that the decision to cut CCOR is surprising given the increasing reliance on satellite technology and the growing awareness of the potential damage from space weather. Furthermore, the move appears to contradict the U.S. government's stated commitment to space situational awareness and satellite safety. The loss of CCOR puts the nation's satellite infrastructure at greater risk, with potentially severe consequences for communication, navigation, and other critical services. The article expresses concern that the cost savings from eliminating CCOR are minimal compared to the potential economic and societal costs of a major space weather event impacting satellites.\n",
    "chinese_title": "拟议的美国国家海洋和大气管理局预算将取消旨在防止卫星碰撞的项目。",
    "chinese_summary": "《天空与望远镜》杂志报道，拟议的美国国家海洋和大气管理局（NOAA）下个财政年度的预算取消了空间天气后续L1（SWFO-L1）计划的紧凑日冕仪（CCOR）的资金，该仪器旨在监测太阳的日冕物质抛射（CMEs）。CMEs是太阳事件，会扰乱地球磁场，影响卫星运行，甚至导致电网故障。CCOR旨在为这些事件提供关键的预警。\n\n主要担忧是，如果没有CCOR，NOAA预测和减轻空间天气影响的能力将大大降低，从而增加卫星碰撞的风险。准确预测CME到达时间对于卫星运营商采取保护措施至关重要，例如暂时关闭敏感系统或调整卫星轨道。\n\n该文章强调，考虑到对卫星技术的日益依赖以及对空间天气潜在损害的日益认识，削减CCOR的决定令人惊讶。此外，此举似乎与美国政府对空间态势感知和卫星安全的既定承诺相矛盾。CCOR的缺失使美国的卫星基础设施面临更大的风险，对通信、导航和其他关键服务可能产生严重后果。文章表达了对取消CCOR节省的成本与重大空间天气事件影响卫星的潜在经济和社会成本相比微不足道的担忧。"
  },
  {
    "id": "44543156",
    "title": "Show HN: BinaryRPC – Lightweight WebSocket-based RPC framework in modern C++",
    "url": "https://github.com/efecan0/binaryrpc-framework",
    "summary": "BinaryRPC is a new open-source, lightweight, high-throughput RPC framework built on top of uWebSockets in modern C++. It aims to provide a performant and developer-friendly solution for latency-sensitive applications like multiplayer games, financial tick streams, and IoT dashboards.\n\nThe framework offers features similar to Express.js in Node.js, including middleware support, session management, and an RPC handler architecture. Key highlights include WebSocket transport powered by uWebSockets, configurable reliability (QoS) with options like AtLeastOnce and ExactlyOnce delivery, pluggable protocols and middleware, stateful sessions with automatic expiry, and a middleware chain for authentication and rate limiting. The core is header-only for easy inclusion.\n\nThe article provides detailed instructions on how to install BinaryRPC, including prerequisites like CMake, a C++20 compiler, and vcpkg for dependency management. It covers installing core and optional dependencies (like jwt-cpp and nlohmann-json), building the library using CMake, and linking it to your own project.\n\nThe article also delves into custom handshake and authentication using `IHandshakeInspector` to validate client identities and session tokens. It presents examples of using query parameters and JWT-based authentication. Furthermore, the article discusses BinaryRPC's reliability and QoS options, including different delivery tiers (None, AtLeastOnce, ExactlyOnce) and session TTL for seamless reconnects and offline push. It provides examples of custom backoff strategies for retries. Finally, it touches upon session management using the `FrameworkAPI` for storing, searching, and pushing data to connected clients.\n",
    "chinese_title": "Show HN: BinaryRPC – 现代 C++ 中基于 WebSocket 的轻量级 RPC 框架",
    "chinese_summary": "BinaryRPC 是一个全新的开源、轻量级、高吞吐量的 RPC 框架，构建于现代 C++ 的 uWebSockets 之上。它旨在为多人游戏、金融行情流和物联网仪表盘等对延迟敏感的应用提供高性能且对开发者友好的解决方案。\n\n该框架提供类似于 Node.js 中 Express.js 的功能，包括中间件支持、会话管理和 RPC 处理程序架构。主要亮点包括由 uWebSockets 驱动的 WebSocket 传输、具有可配置可靠性（QoS），例如至少一次和精确一次交付的选项、可插拔协议和中间件、具有自动过期的有状态会话以及用于身份验证和速率限制的中间件链。核心是仅头文件，便于包含。\n\n本文提供了有关如何安装 BinaryRPC 的详细说明，包括 CMake、C++20 编译器和 vcpkg 等依赖项管理工具。它涵盖了安装核心和可选依赖项（如 jwt-cpp 和 nlohmann-json）、使用 CMake 构建库以及将其链接到您自己的项目。\n\n本文还深入探讨了使用 `IHandshakeInspector` 进行自定义握手和身份验证，以验证客户端身份和会话令牌。它提供了使用查询参数和基于 JWT 的身份验证的示例。此外，本文还讨论了 BinaryRPC 的可靠性和 QoS 选项，包括不同的交付层级（None、AtLeastOnce、ExactlyOnce）和会话 TTL，以实现无缝重连和离线推送。它提供了自定义退避重试策略的示例。最后，它涉及使用 `FrameworkAPI` 进行会话管理，以便存储、搜索和向连接的客户端推送数据。"
  },
  {
    "id": "44536988",
    "title": "OpenAI’s Windsurf deal is off, and Windsurf’s CEO is going to Google",
    "url": "https://www.theverge.com/openai/705999/google-windsurf-ceo-openai",
    "summary": "OpenAI's planned acquisition of AI coding startup Windsurf has been called off, and instead, Google will hire Windsurf CEO Varun Mohan, co-founder Douglas Chen, and other key R&D employees to join the Google DeepMind team. They will focus on agentic coding efforts using Gemini.\n\nWhile Google is not acquiring Windsurf or taking a stake, it will receive a non-exclusive license to some of Windsurf's technology. Jeff Wang, Windsurf's head of business, is now interim CEO, and Graham Moreno, VP of global sales, becomes president.\n\nGoogle confirmed the move, stating their excitement to welcome Windsurf's talent to advance agentic coding work. Mohan and Chen expressed pride in Windsurf's accomplishments and enthusiasm for the next phase under the company's existing leadership.\n\nThe financial details of Google's hiring deal were not disclosed, but OpenAI was previously expected to acquire Windsurf for $3 billion.\n",
    "chinese_title": "OpenAI的Windsurf交易取消，且Windsurf的CEO将加入谷歌。",
    "chinese_summary": "OpenAI取消收购AI代码初创公司Windsurf的计划，转而谷歌将聘用Windsurf首席执行官Varun Mohan、联合创始人Douglas Chen以及其他关键研发人员加入谷歌DeepMind团队，他们将专注于使用Gemini的自主编码工作。\n\n虽然谷歌并未收购Windsurf或持有股份，但将获得Windsurf部分技术的非独家许可。Windsurf业务主管Jeff Wang现任临时首席执行官，全球销售副总裁Graham Moreno升任总裁。\n\n谷歌证实了此举，并表示欢迎Windsurf的人才加入，以推进自主编码工作。Mohan和Chen对Windsurf取得的成就表示自豪，并对公司在现有领导层下的下一阶段充满热情。\n\n谷歌的聘用交易的财务细节未披露，但OpenAI此前预计以30亿美元收购Windsurf。"
  },
  {
    "id": "44541576",
    "title": "The fish kick may be the fastest subsurface swim stroke yet (2015)",
    "url": "https://nautil.us/is-this-new-swim-stroke-the-fastest-yet-235511/",
    "summary": "The article \"The fish kick may be the fastest subsurface swim stroke yet\" explores the potential of the fish kick as a superior swimming technique, focusing on its mechanics and physics. The author, Regan Penaluna, recounts her initial struggles with the kick before seeking guidance from Olympic gold medalist Misty Hyman.\n\nThe article explains that subsurface swimming, in general, is faster than surface swimming due to the limitations of \"hull speed\" on the surface, where swimmers are restricted by the bow wave they create. The fish kick, a horizontal undulating movement performed on the swimmer's side, may be even faster than the traditional dolphin kick. Experts suggest that the fish kick creates more efficient vortices (miniature whirlpools) that propel the swimmer forward, and that these vortices are less likely to be disrupted by the pool surface or bottom compared to the dolphin kick.\n\nWhile the fish kick is difficult to master and control, some experts believe that once perfected, it could be the fastest swimming stroke. However, the article also notes the dolphin kick's advantages at greater depths in modern, deeper pools. The article concludes by discussing the potential of an underwater swimming event to showcase the true capabilities of the fish kick, despite skepticism about its TV appeal. Penaluna ends her experience with some improvements on her initial attempt.\n",
    "chinese_title": "鱼踢可能是目前最快的潜泳泳姿 (2015)",
    "chinese_summary": "文章《鱼踢可能是目前最快的潜泳泳姿》探讨了鱼踢作为一种卓越游泳技术的潜力，重点关注其力学和物理原理。作者Regan Penaluna讲述了她在向奥运金牌得主Misty Hyman寻求指导之前，最初在鱼踢上的挣扎。\n\n文章解释说，通常情况下，潜泳比水面游泳更快，这是因为水面游泳受到“船体速度”的限制，游泳者受到他们所产生的弓形波的限制。鱼踢是一种在游泳者侧面进行的水平波动运动，它可能比传统的海豚踢更快。专家认为，鱼踢产生更有效的涡流（微型漩涡），推动游泳者前进，与海豚踢相比，这些涡流更不易受到泳池表面或底部的干扰。\n\n虽然鱼踢难以掌握和控制，但一些专家认为，一旦掌握，它可能成为最快的泳姿。然而，文章也指出，在现代更深的泳池中，海豚踢在更深处具有优势。文章最后讨论了水下游泳比赛的潜力，以展示鱼踢的真正能力，尽管人们对其电视吸引力持怀疑态度。Penaluna以她在最初尝试中的一些改进结束了她的体验。"
  },
  {
    "id": "44542170",
    "title": "Stone–Wales Transformations",
    "url": "https://johncarlosbaez.wordpress.com/2025/07/12/stone-wales-transformation/",
    "summary": "This article explains Stone-Wales transformations, a type of topological defect that occurs in carbon-based structures like buckminsterfullerene and graphene. The transformation involves a 90-degree rotation of a bond between carbon atoms, resulting in changes to the arrangement of hexagons and pentagons (in fullerenes) or pentagons and heptagons (in graphene).\n\nIn buckminsterfullerene, a Stone-Wales transformation converts two hexagons and two pentagons into two pentagons and two hexagons. In graphene, it converts four hexagons into two pentagons and two heptagons, creating a Stone-Wales defect.\n\nThe author finds the transformations fascinating and connects them to similar topological transformations like Pachner moves. They also explore the Arrhenius equation, which describes the rate of chemical reactions and is used to study the frequency of Stone-Wales transformations in buckminsterfullerene. The author expresses interest in developing a theory for topological transformations occurring randomly, governed by statistical mechanics, similar to what's seen in matrix models.\n\nThe article references research papers and online sources with images showcasing Stone-Wales transformations. A comment by Anton Sherwood notes the utility of Stone-Wales flips in simplifying the process of creating models of fullerenes.\n",
    "chinese_title": "斯通-威尔斯变换",
    "chinese_summary": "本文解释了Stone-Wales转化，这是一种拓扑缺陷，常见于富勒烯和石墨烯等碳基结构中。该转化涉及碳原子之间键的90度旋转，导致六边形和五边形（在富勒烯中）或五边形和七边形（在石墨烯中）排列的变化。\n\n在富勒烯中，Stone-Wales转化将两个六边形和两个五边形转化为两个五边形和两个六边形。在石墨烯中，它将四个六边形转化为两个五边形和两个七边形，从而产生Stone-Wales缺陷。\n\n作者认为这些转化非常有趣，并将它们与类似的拓扑转化（如Pachner移动）联系起来。他们还探讨了阿伦尼乌斯方程，该方程描述了化学反应的速率，并被用于研究富勒烯中Stone-Wales转化的频率。作者表示有兴趣发展一种关于随机发生的拓扑转化的理论，该理论由统计力学支配，类似于在矩阵模型中看到的情况。\n\n文章引用了研究论文和在线资源，其中包含展示Stone-Wales转化的图像。Anton Sherwood的评论指出Stone-Wales翻转在简化富勒烯模型创建过程中的实用性。"
  },
  {
    "id": "44539879",
    "title": "Malware found in official gravityforms plugin indicating supply chain breach",
    "url": "https://patchstack.com/articles/critical-malware-found-in-gravityforms-official-plugin-site/",
    "summary": "On July 11, 2025, Patchstack reported a supply chain attack targeting the Gravity Forms plugin for WordPress. Initially, a suspicious HTTP request to the `gravityapi.org` domain was detected in a downloaded plugin file. This domain was recently registered on July 8, 2025, raising concerns.\n\nTechnical analysis revealed that the `update_entry_detail` function in the `gravityforms/common.php` file makes a POST request to `https://gravityapi.org/sites`, sending sensitive WordPress instance information. The server's response includes a `gf_name` (filename) and a `body` (base64-encoded content). The decoded content is then saved to the specified filename on the WordPress server, allowing the attacker to inject malicious code.  In the reported instance, the file `wp-includes/bookmark-canonical.php` was created containing PHP code.\n\nGravity Forms confirmed an investigation into a malware breach and removed the malicious code from the download package. Version 2.9.13 was released to ensure safe updating. Namecheap suspended the `gravityapi.org` domain to prevent further exploitation. The malware primarily affected manual downloads and composer installations.  Patchstack suggests checking for IOCs, although the infection appears to be limited to a small number of users. An IP address, 193.160.101.6, was observed making requests to various Gravity Forms versions using a `gf_api_token` parameter.\n",
    "chinese_title": "官方Gravity Forms插件发现恶意软件，提示供应链遭到破坏",
    "chinese_summary": "2025年7月11日，Patchstack报告了一起针对WordPress的Gravity Forms插件的供应链攻击。最初，在下载的插件文件中检测到一个可疑的HTTP请求，目标指向`gravityapi.org`域名。该域名最近于2025年7月8日注册，引发关注。\n\n技术分析显示，`gravityforms/common.php`文件中的`update_entry_detail`函数向`https://gravityapi.org/sites`发起POST请求，发送敏感的WordPress实例信息。服务器的响应包括一个`gf_name`（文件名）和一个`body`（base64编码的内容）。解码后的内容随后被保存到WordPress服务器上指定的文件名，允许攻击者注入恶意代码。在报告的实例中，创建了包含PHP代码的文件`wp-includes/bookmark-canonical.php`。\n\nGravity Forms确认正在调查恶意软件入侵事件，并已从下载包中删除了恶意代码。发布了2.9.13版本以确保安全更新。Namecheap暂停了`gravityapi.org`域名，以防止进一步的利用。恶意软件主要影响手动下载和composer安装。Patchstack建议检查IOCs，尽管感染似乎仅限于少数用户。观察到一个IP地址，193.160.101.6，使用`gf_api_token`参数向各种Gravity Forms版本发出请求。"
  },
  {
    "id": "44540589",
    "title": "Commodore 64 Ultimate",
    "url": "https://www.commodore.net",
    "summary": "The \"Commodore 64 Ultimate\" is a new, official Commodore 64 computer, the first in over 30 years. It honors the original while adding modern features. Priced from $299, it aims to provide a simpler, distraction-free computing experience, reminiscent of a time when technology was more user-friendly.\n\nThe device is compatible with over 10,000 original Commodore 64 games, cartridges, and peripherals. Modern enhancements include a game-reactive color-changing LED case, Wi-Fi for game transfer, and USB \"cassette\" storage pre-loaded with classic and new games.\n\nAesthetically, the Commodore 64 Ultimate features a transparent keyboard and circuit board, showcasing the internal tech. The mainboard is etched with the names/autographs of the original C64 creators. It also comes with a spiral-bound manual and glossy classic box.\n\nTargeting both nostalgic users and newcomers, the Commodore 64 Ultimate offers an opportunity to learn how computers work and introduces kids to BASIC coding in a fun and engaging way. The core message emphasizes a technology that invites interaction and learning, rather than control.\n",
    "chinese_title": "Commodore 64 终极版",
    "chinese_summary": "“Commodore 64 Ultimate”：一款全新的官方 Commodore 64 电脑，是 30 多年来的首款。它致敬经典，同时加入了现代功能。定价 299 美元起，旨在提供更简单、无干扰的计算体验，让人想起技术更加用户友好的时代。\n\n该设备兼容超过 10,000 款原版 Commodore 64 游戏、卡带和外设。现代增强功能包括游戏联动变色 LED 外壳、用于游戏传输的 Wi-Fi 以及预装经典和新游戏的 USB“磁带”存储。\n\n在美学上，Commodore 64 Ultimate 具有透明键盘和电路板，展示了内部技术。主板上蚀刻着原 C64 创始人的姓名/签名。它还配有螺旋装订的手册和光面经典包装盒。\n\nCommodore 64 Ultimate 针对怀旧用户和新用户，提供了一个学习计算机工作原理的机会，并以有趣且引人入胜的方式向孩子们介绍 BASIC 编程。核心信息强调一种邀请互动和学习而非控制的技术。"
  },
  {
    "id": "44541565",
    "title": "Working through 'Writing A C Compiler'",
    "url": "https://jollygoodsw.wordpress.com/2025/03/13/working-through-writing-a-c-compiler/",
    "summary": "This article, part of a series titled \"Writing A C Compiler\" (WACC), focuses on chapter 15 which deals with implementing arrays and pointer arithmetic in the compiler.\n\nThe author delves into the complexities of handling arrays in C, which are fundamentally contiguous blocks of memory accessed through pointers. They explain how the compiler must calculate memory offsets based on the array's base address, element size, and index to access specific array elements.\n\nThe article likely discusses the implementation details required to translate C array access syntax (e.g., `array[i]`) into equivalent pointer arithmetic expressions (e.g., `*(array + i)`). This involves understanding how the compiler handles different data types (int, char, etc.) to correctly determine the byte offset when performing pointer arithmetic.\n\nFurthermore, the author likely addresses multi-dimensional arrays, which add another layer of complexity in terms of memory layout and address calculation. The compiler must effectively linearize the multi-dimensional array into a single contiguous block of memory.\n\nFinally, the article probably covers optimizations related to array access and pointer arithmetic, aiming to generate efficient machine code. This might include techniques for simplifying complex address calculations or using specialized instructions for array manipulation. In essence, the article dissects how a C compiler interprets and implements array operations and pointer arithmetic to ensure correct and efficient execution.\n",
    "chinese_title": "学习“编写C编译器”",
    "chinese_summary": "本文是名为“编写 C 编译器”(WACC) 系列文章的一部分，重点介绍第 15 章，该章节讲述如何在编译器中实现数组和指针运算。"
  },
  {
    "id": "44535637",
    "title": "ETH Zurich and EPFL to release a LLM developed on public infrastructure",
    "url": "https://ethz.ch/en/news-and-events/eth-news/news/2025/07/a-language-model-built-for-the-public-good.html",
    "summary": "ETH Zurich and EPFL are set to release a fully open-source large language model (LLM) in late summer 2025, developed on the \"Alps\" supercomputer at the Swiss National Supercomputing Centre (CSCS). This LLM aims to promote broad adoption, foster innovation across various sectors, and offer a credible alternative to commercially developed models.\n\nKey features include multilingual fluency in over 1,000 languages, achieved through training on a large dataset comprising 60% English and 40% non-English languages, as well as code and mathematics data. The model will be available in two sizes (8B and 70B parameters) and trained on 15 trillion tokens.\n\nThe initiative prioritizes transparency, with source code, weights, and training data made publicly available under the Apache 2.0 License. It adheres to Swiss data protection and copyright laws, as well as EU AI Act transparency obligations.\n\nThe \"Alps\" supercomputer, equipped with NVIDIA Grace Hopper Superchips and powered by carbon-neutral electricity, facilitated the LLM's training. The project is a collaboration between EPFL, ETH Zurich, CSCS, NVIDIA, and HPE/Cray.\n\nThis project falls under the Swiss AI Initiative, supported by the ETH Board and involving over 800 researchers across Switzerland. It is the world’s largest open science and open source effort dedicated to AI foundation models.\n",
    "chinese_title": "苏黎世联邦理工学院和洛桑联邦理工学院将在公共基础设施上发布一款大型语言模型。",
    "chinese_summary": "苏黎世联邦理工学院和洛桑联邦理工学院将于2025年夏末发布一款完全开源的大型语言模型(LLM)，该模型在瑞士国家超级计算中心(CSCS)的“阿尔卑斯”超级计算机上开发。该LLM旨在促进广泛应用，促进各行业的创新，并提供一种可靠的商业开发模型替代方案。\n\n主要特性包括精通1000多种语言的多语言能力，通过在包含60%英语和40%非英语语言以及代码和数学数据的大型数据集上进行训练来实现。该模型将提供两种尺寸（80亿和700亿参数），并在15万亿个token上进行训练。\n\n该计划优先考虑透明度，源代码、权重和训练数据将根据Apache 2.0许可证公开提供。它遵守瑞士的数据保护和版权法，以及欧盟人工智能法案的透明度义务。\n\n配备NVIDIA Grace Hopper超级芯片并由碳中和电力驱动的“阿尔卑斯”超级计算机，促进了LLM的训练。该项目是洛桑联邦理工学院、苏黎世联邦理工学院、CSCS、NVIDIA和HPE/Cray之间的合作项目。\n\n该项目属于瑞士人工智能倡议，由ETH委员会支持，涉及瑞士各地800多名研究人员。它是世界上致力于人工智能基础模型的最大规模的开放科学和开源工作。"
  },
  {
    "id": "44543113",
    "title": "XAI seeks up to $200B valuation in next fundraising",
    "url": "https://www.ft.com/content/25aab987-c2a1-4fca-8883-38a617269b68",
    "summary": "Elon Musk's AI company, xAI, is reportedly seeking a valuation of up to $200 billion in its next fundraising round. The article, published by the Financial Times (FT), is behind a paywall, requiring a subscription for full access. The FT offers various subscription options, including Standard Digital, Premium Digital, and Print + Premium Digital, each providing different levels of access to their journalism and features. The article emphasizes the value of FT's journalism, highlighting its global news and analysis, expert opinions, and various digital features, aiming to entice readers to subscribe for more comprehensive coverage.\n",
    "chinese_title": "XAI寻求在下一轮融资中达到2000亿美元估值",
    "chinese_summary": "埃隆·马斯克的xAI据报道寻求在下一轮融资中估值高达2000亿美元。《金融时报》（FT）发表的这篇文章设置了付费墙，需要订阅才能完全访问。FT提供多种订阅选项，包括标准数字版、高级数字版和印刷+高级数字版，每种订阅级别提供不同程度的访问其新闻和专题报道的权限。文章强调了FT新闻报道的价值，突出了其全球新闻和分析、专家观点以及各种数字功能，旨在吸引读者订阅以获得更全面的报道。"
  },
  {
    "id": "44542578",
    "title": "Show HN: DesignArena – crowdsourced benchmark for AI-generated UI/UX",
    "url": "https://www.designarena.ai/",
    "summary": "DesignArena is presented as a platform for crowdsourcing a benchmark for AI-generated UI/UX design. It allows users to vote and determine which AI models are best at design tasks. Users can submit design prompts across various categories like website design, game development, 3D design, data visualization, UI components, and image generation. Examples of recent prompts include creating a portfolio site for a photography business, data visualizations of quantum computing research, and 3D models of globes. The platform features a leaderboard to showcase top-performing AI models and encourages users to suggest models that are missing. The website is actively displaying recent votes and prompts to engage the community. In essence, DesignArena is aiming to establish a community-driven evaluation system for AI design tools.\n",
    "chinese_title": "Show HN: DesignArena – AI生成UI/UX的众包基准",
    "chinese_summary": "DesignArena：人工智能UI/UX设计基准众包平台。用户投票选出最佳AI设计模型，提交网站设计、游戏开发、3D设计、数据可视化、UI组件和图像生成等各类设计提示。近期示例包括：摄影业务作品集网站、量子计算研究数据可视化和地球仪3D模型。平台设有排行榜展示顶尖AI模型，并鼓励用户推荐遗漏模型。网站实时展示近期投票和提示，以促进社区参与。本质上，DesignArena旨在建立一个社区驱动的AI设计工具评估体系。"
  },
  {
    "id": "44500815",
    "title": "First malaria treatment for babies approved for use",
    "url": "https://www.bbc.com/news/articles/c89e872jdjxo",
    "summary": "A new malaria treatment specifically formulated for babies and young children has been approved, addressing a critical \"treatment gap\" where infants were previously given drugs designed for older children, posing overdose risks due to differing liver function and drug processing. The drug, developed by Novartis and known as Coartem Baby or Riamet Baby, has been approved by Swiss authorities and is expected to be rolled out in African countries within weeks on a not-for-profit basis.\n\nIn 2023, malaria was linked to approximately 597,000 deaths, with almost all occurring in Africa and around three-quarters affecting children under five. Until now, no malaria drug was specifically designed for babies weighing less than 4.5kg.\n\nThe development of the drug involved collaboration between Novartis, the Medicines for Malaria Venture (MMV), and financial backing from several governments and the Gates Foundation. Eight African nations participated in the assessment and trials and are expected to be among the first to access the treatment. Experts see this as a major breakthrough, potentially saving the lives of vulnerable babies and young children, especially in regions like sub-Saharan Africa where malaria death rates are high. The not-for-profit approach is also expected to reduce healthcare inequality.\n",
    "chinese_title": "首个婴幼儿疟疾疗法获批使用",
    "chinese_summary": "一种专为婴幼儿配制的新型疟疾治疗药物已获批准，解决了此前婴儿只能服用为较大儿童设计的药物所造成的严重“治疗缺口”，由于肝功能和药物代谢的差异，这会带来过量风险。该药物由诺华公司开发，名为Coartem Baby或Riamet Baby，已获得瑞士当局批准，预计将在几周内以非营利方式在非洲国家推广。\n\n2023年，疟疾导致约59.7万人死亡，几乎全部发生在非洲，其中约四分之三是五岁以下儿童。到目前为止，还没有专门为体重低于4.5公斤的婴儿设计的疟疾药物。\n\n该药物的开发涉及诺华公司、疟疾药物风险投资公司（MMV）之间的合作，并获得了多个政府和盖茨基金会的财政支持。八个非洲国家参与了评估和试验，预计将成为首批获得治疗的国家。专家们认为这是一个重大突破，有可能挽救脆弱的婴幼儿的生命，尤其是在撒哈拉以南非洲等疟疾死亡率高的地区。非营利模式也有望减少医疗不平等。"
  },
  {
    "id": "44501417",
    "title": "Making a Speedrun Timer in D",
    "url": "https://bradley.chatha.dev/blog/linux-speedrun-timer-dlang/post/",
    "summary": "This article details the author's journey in creating a custom speedrun timer for Deus Ex on Linux, addressing the lack of functional LiveSplit plugins due to Linux limitations. The goal was to create a timer with auto-splitting and load removal features.\n\nThe initial approach of searching for a loading flag in memory proved unsuccessful due to the dynamic nature of Unreal Engine's memory allocation. The author then shifted to a more sophisticated approach involving injecting custom code into the game's process.\n\nKey steps included:\n\n*   Utilizing `ptrace` and `process_vm_readv` system calls to read and write to the game's memory.\n*   Identifying the `LoadMap` function in Engine.dll using the Export Address Table.\n*   Finding an unused, writeable memory region within the Engine.dll's memory map to store a custom loading flag.\n\nThe author describes creating a mini-framework in D to manage the process of finding and interacting with the game process, patching the game's code, and creating a user interface for the timer. The aim is to modify the `LoadMap` function to set a flag indicating loading status, which the timer can then monitor for auto-splitting and load removal purposes.\n",
    "chinese_title": "用D语言制作速通计时器",
    "chinese_summary": "本文详述了作者在Linux上为《杀出重围》（Deus Ex）创建自定义速通计时器的过程，解决了因Linux限制而缺乏可用LiveSplit插件的问题。其目标是创建一个具有自动分段和加载时间移除功能的计时器。\n\n由于虚幻引擎内存分配的动态性，最初尝试在内存中寻找加载标志的方案宣告失败。随后，作者转向了一种更复杂的方法，即向游戏进程注入自定义代码。\n\n主要步骤包括：\n\n*   利用`ptrace`和`process_vm_readv`系统调用来读取和写入游戏内存。\n*   使用导出地址表在Engine.dll中识别`LoadMap`函数。\n*   在Engine.dll的内存映射中找到一个未使用的、可写入的内存区域，以存储自定义加载标志。\n\n作者描述了用D语言创建一个迷你框架来管理查找和与游戏进程交互、修补游戏代码以及创建计时器用户界面的过程。目标是修改`LoadMap`函数以设置一个指示加载状态的标志，计时器可以监控该标志以实现自动分段和加载时间移除的目的。"
  },
  {
    "id": "44543368",
    "title": "Arizona resident dies from the plague less than 24 hours after showing symptoms",
    "url": "https://www.independent.co.uk/news/health/arizona-plague-death-cases-b2787325.html",
    "summary": "A resident of Northern Arizona has died from the plague, confirmed by health officials after an autopsy revealed the presence of *Yersinia pestis*. The victim was rushed to Flagstaff Medical Center with severe symptoms and died the same day. The case coincides with a recent prairie dog die-off northeast of Flagstaff, a known indicator of plague activity due to infected fleas. Coconino County officials are investigating the prairie dog deaths and collecting fleas for testing.\n\nWhile plague is rare in the U.S., averaging about seven cases annually, it primarily occurs in rural areas of the Western U.S. The plague manifests in three forms: bubonic, septicemic, and pneumonic. Most U.S. cases are bubonic, typically spread through flea bites from infected rodents. Symptoms can appear within a week and include fever, chills, swollen lymph nodes, nausea, and weakness.\n\nEarly antibiotic treatment, ideally within 24 hours of symptom onset, is highly effective, with bubonic plague having a survival rate exceeding 90%. Public health officials are urging residents to report sick or dead rodents, use flea control on pets, and seek immediate medical attention if they develop symptoms after potential exposure.\n",
    "chinese_title": "亚利桑那州居民出现症状后不到24小时死于鼠疫。",
    "chinese_summary": "亚利桑那州北部一名居民死于鼠疫，尸检证实存在鼠疫耶尔森菌后，卫生官员确认了该病例。受害者因严重症状被紧急送往弗拉格斯塔夫医疗中心，当日死亡。该病例恰逢弗拉格斯塔夫东北部最近发生草原犬鼠大规模死亡事件，这是鼠疫活动的一个已知指标，原因是感染了跳蚤。科科尼诺县官员正在调查草原犬鼠的死亡情况，并收集跳蚤进行检测。\n\n虽然鼠疫在美国很少见，平均每年约有七例，但主要发生在美国西部的农村地区。鼠疫有三种表现形式：腺鼠疫、败血性鼠疫和肺鼠疫。美国大多数病例是腺鼠疫，通常通过感染啮齿动物的跳蚤叮咬传播。症状可能在一周内出现，包括发烧、发冷、淋巴结肿大、恶心和虚弱。\n\n早期抗生素治疗非常有效，最好在症状出现后的24小时内进行，腺鼠疫的存活率超过90%。公共卫生官员敦促居民报告患病或死亡的啮齿动物，对宠物进行跳蚤控制，并在潜在暴露后出现症状时立即就医。"
  },
  {
    "id": "44541458",
    "title": "Sieve (YC X25) is hiring researchers to build large video datasets for AI labs",
    "url": "https://sievedata.com/about/jobs",
    "summary": "Sieve (YC X25) is hiring researchers to build large video datasets specifically tailored for AI labs. This implies Sieve is addressing a crucial need in the AI field: the availability of high-quality, large-scale video datasets to train and evaluate advanced AI models. The company is likely focusing on video data as a core component of its strategy and offering its services to AI labs struggling to source or create their own datasets. The fact that they are a Y Combinator backed company (YC X25) adds credibility and suggests a strong foundation for their business. Researchers hired for these roles will likely be involved in tasks such as data collection, labeling, annotation, and potentially even dataset curation and validation to ensure the quality and suitability of the data for AI training purposes. In essence, Sieve is positioning itself as a provider of essential infrastructure for AI video applications by solving the bottleneck of acquiring relevant and comprehensive video datasets.\n",
    "chinese_title": "Sieve (YC X25) 正在招聘研究人员，为 AI 实验室构建大型视频数据集。",
    "chinese_summary": "Sieve (YC X25) 正在招聘研究员，为人工智能实验室构建专门定制的大型视频数据集。 这意味着 Sieve 正在解决人工智能领域的一个关键需求：提供高质量、大规模的视频数据集来训练和评估先进的人工智能模型。该公司可能专注于视频数据，将其作为核心战略组成部分，并向那些难以获取或创建自有数据集的人工智能实验室提供服务。 他们是一家 Y Combinator 投资的公司 (YC X25) 这一事实增加了其可信度，并表明其业务具有坚实的基础。 受聘的研究员可能会参与数据收集、标记、注释等任务，甚至可能参与数据集的策划和验证，以确保数据的质量和适用于人工智能训练。 本质上，Sieve 通过解决获取相关且全面的视频数据集的瓶颈，将自己定位为人工智能视频应用的基本基础设施提供商。"
  },
  {
    "id": "44537631",
    "title": "Faking a JPEG",
    "url": "https://www.ty-penguin.org.uk/~auj/blog/2025/03/25/fake-jpeg/",
    "summary": "On March 25, 2025, the author discusses a project called Spigot, a web application designed to generate fake web pages with gibberish content to attract and study web crawlers. Observing that a crawler named \"ImageSiftBot\" was aggressively seeking images despite Spigot's lack of them, the author devised a method to create fake JPEGs to satisfy the crawler's requests without overburdening the server's CPU.\n\nThe approach involved using templates derived from real JPEGs on the author's website. By extracting the structured parts of JPEG files (size, color depth) and noting the lengths of the pixel data chunks, the author created a set of realistic templates. To generate a fake JPEG, the script would randomly choose a template and populate the pixel data chunks with random data.\n\nInitially, the author found that purely random pixel data caused decoder errors due to the Huffman coding structure. However, the garbage JPEGs were still accepted and displayed by most JPEG viewers, making them suitable for deceiving web crawlers. The author also implemented a bit mask technique to further reduce the likelihood of generating invalid Huffman codes.\n\nThis method allowed for the generation of approximately 900 garbage images per second, which is significantly faster than the server's internet connection. The fake JPEG generation was integrated into Spigot, with about 60% of the generated pages containing a garbage JPEG. ImageSiftBot and other crawlers like Meta's bot, AmazonBot and GPTBot showed increased activity, grabbing these images. The author released the code on GitHub and continues to optimize it for efficiency and effectiveness in wasting the resources of abusive web crawlers.\n",
    "chinese_title": "伪造JPEG图像",
    "chinese_summary": "2025年3月25日，作者讨论了一个名为Spigot的项目，这是一个旨在生成包含无意义内容的虚假网页以吸引和研究网络爬虫的Web应用程序。观察到名为“ImageSiftBot”的爬虫在Spigot缺乏图像的情况下仍然积极地寻求图像，作者设计了一种方法来创建虚假的JPEG图像，以满足爬虫的请求，而不会过度消耗服务器的CPU。\n\n该方法涉及使用来自作者网站上真实JPEG图像的模板。通过提取JPEG文件的结构化部分（大小、颜色深度）并记录像素数据块的长度，作者创建了一组逼真的模板。为了生成虚假的JPEG，脚本会随机选择一个模板，并用随机数据填充像素数据块。\n\n最初，作者发现纯粹的随机像素数据会导致解码器错误，原因是哈夫曼编码结构。然而，这些垃圾JPEG仍然被大多数JPEG查看器接受和显示，使其适合欺骗网络爬虫。作者还实施了一种位掩码技术，以进一步降低生成无效哈夫曼代码的可能性。\n\n这种方法允许每秒生成大约900张垃圾图像，这比服务器的互联网连接速度快得多。虚假JPEG生成被集成到Spigot中，大约60%的生成页面包含一个垃圾JPEG。ImageSiftBot以及Meta的机器人、AmazonBot和GPTBot等其他爬虫的活动有所增加，它们抓取了这些图像。作者已在GitHub上发布了代码，并继续优化它，以提高效率和有效性，从而浪费滥用的网络爬虫的资源。"
  },
  {
    "id": "44536459",
    "title": "Preliminary report into Air India crash released",
    "url": "https://www.bbc.co.uk/news/live/cx20p2x9093t",
    "summary": "A preliminary report has been released regarding the Air India crash on June 12th in Ahmedabad, which resulted in 260 deaths. While the report refrains from drawing definitive conclusions, it reveals that the fuel switches were in the \"cut-off\" position just before the crash. Cockpit voice recordings indicate confusion between the pilots, with one questioning the other about turning off the switches, a claim the other pilot denies.\n\nIndia's aviation minister cautioned against speculation, while a US aviation watchdog pledged to follow the facts in the investigation. The report has left families of victims with more questions than answers.\n\nThe investigation, led by India's Aircraft Accident Investigation Bureau with support from the US National Transportation Safety Board, is ongoing. A final report is expected next year. Further details about the crash and the cockpit audio's significance can be found in continuing coverage.\n",
    "chinese_title": "印度航空坠机事故初步报告发布",
    "chinese_summary": "印度航空6月12日在艾哈迈达巴德坠机事故造成260人死亡，一份初步报告已发布。报告虽未下定论，但显示坠机前燃油开关处于“切断”位置。驾驶舱录音显示飞行员之间存在困惑，一人质问另一人关闭开关，另一人否认。\n\n印度航空部长告诫不要进行猜测，而美国航空监管机构承诺将根据事实进行调查。该报告让遇难者家属产生了更多疑问。\n\n该调查由印度飞机事故调查局主导，美国国家运输安全委员会提供支持，目前仍在进行中。预计明年发布最终报告。关于坠机事故和驾驶舱录音重要性的更多细节可在持续报道中找到。"
  },
  {
    "id": "44510717",
    "title": "Only on Nantucket: The Curious Case of the \"Stolen\" Mercedes",
    "url": "https://nantucketcurrent.com/news/only-on-nantucket-the-curious-case-of-the",
    "summary": "A Mercedes G Wagon was reported stolen from a Nantucket Stop & Shop parking lot, sparking island-wide speculation due to the rarity of car theft on the island. The mystery was solved when island resident Alex Miccio realized his elderly family friend had mistakenly driven off in the wrong G Wagon. Miccio had left his own G Wagon keys with the friend, who, upon arriving on the ferry, found a similar vehicle and the key inexplicably worked. The friend drove the wrong car home, unaware of the mistake.\n\nThe vehicle was returned, and police confirmed no charges would be filed, deeming it a case of mistaken identity. Police Lt. Angus MacVicar highlighted the common occurrence of vehicles going missing due to the abundance of similar cars on the island and people leaving keys inside. He advised drivers to double-check vehicle registration before driving away. MacVicar also mentioned joyrides as another cause, though less frequent, and recalled only one case in his career where a stolen vehicle wasn't quickly recovered, eventually being found months later deep in the woods. He also noted the Steamship Authority is alerted to missing vehicles, making escape from the island difficult for car thieves.\n",
    "chinese_title": "仅在南塔克特：奔驰“失窃”奇案",
    "chinese_summary": "一辆奔驰G级越野车在楠塔基特岛一家Stop & Shop超市停车场被报失窃，由于该岛汽车盗窃案罕见，引发了全岛猜测。谜团最终解开，岛上居民Alex Miccio意识到他年长的家人朋友错误地开走了另一辆G级越野车。Miccio将自己的G级越野车钥匙留给了这位朋友，朋友抵达渡轮后，发现一辆相似的车辆，钥匙竟然能用。这位朋友将错误的车辆开回了家，并未意识到这个错误。\n\n车辆已归还，警方证实不会提出指控，认为这是一起认错车辆的案件。警察中尉Angus MacVicar强调，由于岛上相似车辆众多以及人们将钥匙留在车内的情况普遍，车辆失踪的情况时有发生。他建议司机在开车离开前仔细检查车辆登记信息。MacVicar还提到，尽管不太频繁，但兜风也是另一个原因，并回忆起他职业生涯中只有一个失窃车辆未迅速找回的案例，几个月后最终在森林深处被发现。他还指出，蒸汽船管理局会收到失踪车辆的警报，使得汽车盗贼很难逃离该岛。"
  },
  {
    "id": "44505121",
    "title": "Fundamentals of garbage collection (2023)",
    "url": "https://learn.microsoft.com/en-us/dotnet/standard/garbage-collection/fundamentals",
    "summary": "This article explains the fundamentals of garbage collection (GC) in the .NET CLR, an automatic memory management system. The GC frees developers from manual memory release, prevents memory leaks, and ensures memory safety.\n\nKey concepts include:\n\n*   **Managed Heap:** A contiguous region of virtual address space where the CLR allocates memory for objects.\n*   **Memory Allocation:** The GC allocates memory efficiently by incrementing a pointer on the managed heap.\n*   **Memory Release:** The GC reclaims memory from unreachable objects by examining application roots (static fields, local variables, CPU registers, GC handles, finalize queue), creating a graph of reachable objects, and compacting memory.\n*   **Garbage Collection Conditions:** Triggered by low physical memory, exceeding an allocation threshold, or calling `GC.Collect`.\n*   **Generations:** The managed heap is divided into three generations (0, 1, and 2) to optimize GC performance. Generation 0 contains short-lived objects, generation 1 acts as a buffer, and generation 2 holds long-lived objects. The large object heap (LOH), sometimes referenced as generation 3, handles objects larger than 85,000 bytes.\n*   **Survival and Promotions:** Objects that survive GC are promoted to the next generation. A high survival rate in a generation leads to an increased allocation threshold for that generation.\n*   **Ephemeral Generations and Segments:** Generations 0 and 1 are ephemeral, residing in the ephemeral segment. The size of this segment varies based on the system architecture and GC type.\n\nIn essence, the GC automatically manages memory by allocating space for new objects, reclaiming memory from unused objects, and compacting memory to avoid fragmentation. This optimizes application performance and simplifies development by eliminating the need for manual memory management.\n",
    "chinese_title": "垃圾回收基础 (2023)",
    "chinese_summary": "本文阐述了 .NET CLR 中垃圾回收 (GC) 的基本原理，这是一种自动内存管理系统。GC 使开发人员无需手动释放内存，防止内存泄漏，并确保内存安全。\n\n关键概念包括：\n\n*   **托管堆：** 一个连续的虚拟地址空间区域，CLR 在此为对象分配内存。\n*   **内存分配：** GC 通过递增托管堆上的指针来高效地分配内存。\n*   **内存释放：** GC 通过检查应用程序根（静态字段、局部变量、CPU 寄存器、GC 句柄、终结队列），创建可达对象图并压缩内存，来回收来自不可达对象的内存。\n*   **垃圾回收条件：** 由物理内存不足、超过分配阈值或调用 `GC.Collect` 触发。\n*   **代：** 托管堆分为三个代（0、1 和 2）以优化 GC 性能。第 0 代包含短生存期对象，第 1 代充当缓冲区，第 2 代包含长生存期对象。大型对象堆 (LOH)，有时被称为第 3 代，处理大于 85,000 字节的对象。\n*   **生存和晋升：** 在 GC 中幸存的对象会被晋升到下一代。一代中较高的生存率会导致该代的分配阈值增加。\n*   **临时代和段：** 第 0 代和第 1 代是临时的，驻留在临时段中。此段的大小因系统架构和 GC 类型而异。\n\n本质上，GC 通过为新对象分配空间、回收来自未使用对象的内存以及压缩内存以避免碎片化来自动管理内存。这优化了应用程序性能并通过消除手动内存管理的需求来简化开发。"
  },
  {
    "id": "44534787",
    "title": "Jank is C++",
    "url": "https://jank-lang.org/blog/2025-07-11-jank-is-cpp/",
    "summary": "This article details the progress made in the past quarter on \"jank,\" a project aiming to achieve seamless C++ interop from Clojure. Key achievements include:\n\n*   **Manual Memory Management:** Implemented `cpp/new` and `cpp/delete` using jank's garbage collector (bdwgc), with destructor support.\n*   **C++ Booleans:** Introduced `cpp/true` and `cpp/false` for direct C++ bools, avoiding implicit type casting and generating leaner IR.\n*   **Complex Types:** Extended type representation with pointer types in symbols (e.g., `cpp/int**`) and a `cpp/type` function for templates (e.g., `(cpp/type \"std::map<std::string, int>\")`).\n*   **Complex Type Constructors:** Made the `.` suffix optional when calling types, treating type calls as constructor calls.\n*   **Opaque Boxes:** Created `cpp/box` and `cpp/unbox` for handling raw native pointers, enabling their use in jank's data structures, requiring manual type management like in C++.\n*   **Pre-compiled Headers (PCH):** Implemented PCH precompilation for faster startup times.\n*   **Stability Improvements:** Addressed various crashes related to arrays, global pointers, function pointers, variadic C function calls, and LLVM issues.\n*   **Static Typing:** Emphasized jank's statically typed C++ interop.\n*   **Practical Examples:** Demonstrated interop with examples like \"Hello, world\" using streams, a JSON pretty printer using `json.hpp`, and a terminal UI using `ftxui`.\n\nThe author also mentions Clasp, another C++ Lisp implementation, as an inspiration. Future plans include addressing automatic destructor calls for stack-allocated objects, improving packaging and distribution, and fixing bugs in preparation for an alpha launch.\n",
    "chinese_title": "Jank 是 C++",
    "chinese_summary": "本项目旨在实现从 Clojure 无缝对接 C++，以下是“jank”项目上季度取得的进展详情：\n\n*   **手动内存管理：** 使用 jank 的垃圾回收器 (bdwgc) 实现了 `cpp/new` 和 `cpp/delete`，并支持析构函数。\n*   **C++ 布尔值：** 引入了 `cpp/true` 和 `cpp/false`，用于直接处理 C++ 布尔值，避免了隐式类型转换并生成更精简的 IR。\n*   **复杂类型：** 使用符号中的指针类型（例如 `cpp/int**`）和用于模板的 `cpp/type` 函数（例如 `(cpp/type \"std::map<std::string, int>\")`）扩展了类型表示。\n*   **复杂类型构造函数：** 调用类型时，`.` 后缀变为可选，类型调用被视为构造函数调用。\n*   **不透明盒子：** 创建了 `cpp/box` 和 `cpp/unbox`，用于处理原始本机指针，使其能够在 jank 的数据结构中使用，需要像在 C++ 中一样进行手动类型管理。\n*   **预编译头文件 (PCH)：** 实现了 PCH 预编译，以加快启动速度。\n*   **稳定性改进：** 解决了与数组、全局指针、函数指针、可变参数 C 函数调用和 LLVM 问题相关的各种崩溃。\n*   **静态类型：** 强调了 jank 的静态类型 C++ 互操作。\n*   **实际示例：** 通过使用流的“Hello, world”示例、使用 `json.hpp` 的 JSON 漂亮打印机以及使用 `ftxui` 的终端 UI，演示了互操作。\n\n作者还提到 Clasp，另一个 C++ Lisp 实现，作为灵感来源。未来的计划包括解决堆栈分配对象的自动析构函数调用问题，改进打包和分发，以及修复错误，为 alpha 版本的发布做准备。"
  },
  {
    "id": "44538693",
    "title": "Replication of Quantum Factorisation Records with an 8-bit Home Computer [pdf]",
    "url": "https://eprint.iacr.org/2025/1237.pdf",
    "summary": "This document, titled \"Replication of Quantum Factorisation Records with an 8-bit Home Computer [pdf]\", is a PDF file, but its contents are primarily binary data interspersed with PDF formatting markers.  Based on the title, the document *claims* to describe a method of replicating quantum factorization records using a very basic 8-bit home computer.\n\nHowever, the actual content of the PDF is highly compressed and appears to be mostly nonsensical when interpreted as text. There's a significant amount of binary gibberish, suggesting either a highly optimized and compressed document or, more likely, corrupted data. Sections that appear to be text contain snippets of code or data, potentially relating to image processing or font embedding common within PDF documents. Segments seem related to JPEG encoding and PDF structure elements.\n\nThere's very little coherent textual information that supports the title's proposition. The title itself makes an extraordinary claim that would be of immense scientific interest if genuine. Without being able to reliably decompress and analyze the compressed information within the PDF, it's impossible to verify the validity of the title, and it is likely fraudulent or technically flawed.\n",
    "chinese_title": "使用8位家用电脑复制量子因式分解记录 [pdf]",
    "chinese_summary": "标题：“使用8位家用电脑复制量子因式分解记录[pdf]”\n\n此文档（标题为“使用8位家用电脑复制量子因式分解记录[pdf]”）是一个PDF文件，但其内容主要是二进制数据，间杂着PDF格式标记。根据标题，该文档*声称*描述了一种使用非常基础的8位家用电脑复制量子因式分解记录的方法。\n\n然而，PDF的实际内容高度压缩，并且在被解释为文本时，看起来大多是毫无意义的。存在大量的二进制乱码，这表明该文档要么经过高度优化和压缩，要么更可能的是数据已损坏。 看起来像是文本的部分包含代码片段或数据，可能与PDF文档中常见的图像处理或字体嵌入有关。某些片段似乎与JPEG编码和PDF结构元素有关。\n\n几乎没有连贯的文本信息来支持标题的主张。标题本身提出了一个非同寻常的声明，如果真实，将具有巨大的科学意义。在无法可靠地解压缩和分析PDF中的压缩信息的情况下，无法验证标题的有效性，并且它可能是欺诈性的或存在技术缺陷。"
  },
  {
    "id": "44497808",
    "title": "Leveraging Elixir's hot code loading capabilities to modularize a monolithic app",
    "url": "https://lucassifoni.info/blog/leveraging-hot-code-loading-for-fun-and-profit/",
    "summary": "This article discusses how the author leverages Elixir's hot code loading capabilities to modularize a monolithic application called Alzo, used for client-specific services, avoiding a microservices architecture. Alzo deploys one instance per client to facilitate on-premise deployments, open-source potential, and easy client-specific app development.\n\nClient-specific apps, primarily LiveView-based multiplayer document editors, reside in dedicated directories and implement a specific behavior. These apps are dynamically loaded into the main application at runtime.\n\nTo ensure isolation, client-specific code is removed during the build process. This enforces that the main application does not depend on runtime app code, and vice-versa. Tests include the dynamic apps initially, but they're removed before the Docker image build. This approach leverages LiveView and unit tests to replace integration tests usually required by microservices.\n\nClient-specific apps are packaged using a mix command and uploaded through an admin panel.  Uploaded apps are recompiled and dynamically loaded by the main application upon startup. The article also briefly mentions that, because of the application's nature, hot code *upgrades* are avoided, focusing on hot code *loading* instead.\n\nFor more complex services, external full-featured apps communicate with Alzo through a message router, allowing for both request/response and request/mailbox/poll/response patterns.\n\nThe author concludes that hot code loading has proven successful for their use case, facilitating easy refactoring of specific behavior into the main codebase when genericity emerges.\n",
    "chinese_title": "利用Elixir的热代码加载能力来模块化单体应用",
    "chinese_summary": "本文探讨了作者如何利用 Elixir 的热代码加载功能来模块化名为 Alzo 的单体应用（用于提供特定客户服务），从而避免采用微服务架构。Alzo 为每个客户部署一个实例，以便于本地部署、实现开源潜力以及简化特定客户的应用开发。\n\n特定客户的应用，主要是基于 LiveView 的多人文档编辑器，位于专用目录中并实现特定行为。这些应用会在运行时动态加载到主应用程序中。\n\n为了确保隔离，特定客户的代码会在构建过程中被移除。这确保了主应用程序不依赖于运行时应用代码，反之亦然。测试最初包含动态应用，但在 Docker 镜像构建之前会被移除。这种方法利用 LiveView 和单元测试来代替微服务通常需要的集成测试。\n\n特定客户的应用使用 mix 命令打包，并通过管理面板上传。上传的应用会被重新编译，并在主应用程序启动时动态加载。本文还简要提及，由于应用程序的性质，避免了热代码*升级*，而是专注于热代码*加载*。\n\n对于更复杂的服务，外部功能齐全的应用通过消息路由器与 Alzo 通信，从而支持请求/响应和请求/邮箱/轮询/响应模式。\n\n作者总结说，热代码加载已被证明在其用例中是成功的，便于在出现通用性时将特定行为轻松重构到主代码库中。"
  },
  {
    "id": "44505445",
    "title": "Watchfiles: Simple, modern and fast file watching for Python, written in Rust",
    "url": "https://github.com/samuelcolvin/watchfiles",
    "summary": "Watchfiles is a Python library, written in Rust, designed for simple, modern, and high-performance file watching and code reloading. It leverages the Notify Rust library for underlying file system notifications. Formerly known as \"watchgod,\" a migration guide is available.\n\nIt supports Python versions 3.9 to 3.14 and can be installed via `pip install watchfiles`. Pre-built binaries are available for most architectures on Linux, MacOS, and Windows; otherwise, installation from source requires Rust.\n\nThe library offers several functions:\n\n*   `watch`: for basic file watching and printing changes.\n*   `awatch`: an asynchronous version of `watch` using `asyncio`.\n*   `run_process`: runs a function as a target and restarts upon file changes.\n*   `arun_process`: an asynchronous version of `run_process` using `asyncio`.\n\nEach of these functions has corresponding documentation for detailed usage.\n\nWatchfiles also provides a command-line interface (CLI) for running commands when files change, accessible via `watchfiles \"some command\" src` or `watchfiles --help` for options. Its documentation can be found in the CLI docs.\n",
    "chinese_title": "Watchfiles: 用 Rust 编写的简单、现代且快速的 Python 文件监控工具",
    "chinese_summary": "Watchfiles 是一个 Python 库，用 Rust 编写，旨在实现简单、现代和高性能的文件监视和代码重新加载。它利用 Notify Rust 库进行底层文件系统通知。之前名为 \"watchgod\"，现已提供迁移指南。\n\n它支持 Python 3.9 到 3.14 版本，可以通过 `pip install watchfiles` 安装。 预构建的二进制文件适用于 Linux、MacOS 和 Windows 上的大多数架构；否则，从源代码安装需要 Rust。\n\n该库提供以下几个函数：\n\n*   `watch`: 用于基本的文件监视和打印更改。\n*   `awatch`: 使用 `asyncio` 的 `watch` 异步版本。\n*   `run_process`: 运行一个函数作为目标，并在文件更改时重新启动。\n*   `arun_process`: 使用 `asyncio` 的 `run_process` 异步版本。\n\n每个函数都有相应的文档，其中包含详细的用法说明。\n\nWatchfiles 还提供了一个命令行界面 (CLI)，用于在文件更改时运行命令，可以通过 `watchfiles \"some command\" src` 或 `watchfiles --help` 访问选项。 其文档可以在 CLI 文档中找到。"
  },
  {
    "id": "44502052",
    "title": "Building Watson: An Overview of the DeepQA Project (2010)",
    "url": "https://ojs.aaai.org/aimagazine/index.php/aimagazine/article/view/2303",
    "summary": "Here's a summary of the \"Building Watson: An Overview of the DeepQA Project\" article based on my understanding of the project and common knowledge about it, as I cannot directly access external websites:\n\nThe \"Building Watson\" article outlines the DeepQA project, which aimed to create a question answering (QA) system capable of competing with top human players on the Jeopardy! quiz show. The article details the challenges inherent in open-domain QA, where systems must understand complex natural language, reason about a vast amount of information, and provide precise answers within a time constraint.\n\nWatson's architecture, described in the article, is based on massive parallelism and evidence-based reasoning. It utilizes hundreds of different algorithms (pipelines) operating concurrently to analyze the question, generate hypotheses (possible answers), gather evidence from a variety of sources (including structured databases, unstructured text, and ontologies), and score each hypothesis based on the accumulated evidence. These algorithms operate independently, increasing robustness and allowing for diverse approaches to question analysis and answer generation.\n\nA key contribution of the DeepQA project was its emphasis on *statistical* machine learning techniques rather than relying solely on handcrafted rules. This allowed Watson to learn from data and adapt to the nuances of language. The article likely discusses how Watson weighs and combines evidence from these different algorithms to arrive at a final confidence score for each hypothesis. The highest-scoring hypothesis is then presented as Watson's answer.\n\nThe article emphasizes that Watson's success stemmed from its ability to integrate diverse AI techniques, including natural language processing, information retrieval, knowledge representation, and machine learning, into a coherent and scalable architecture. The system's open architecture allows for continuous improvement through the addition of new algorithms and knowledge sources. Finally, the article likely discusses the broader implications of the DeepQA project for advancing the field of AI and its potential applications beyond Jeopardy!.\n",
    "chinese_title": "构建沃森：DeepQA项目概述（2010）",
    "chinese_summary": "以下是我对“构建沃森：DeepQA 项目概述”一文的总结，基于我对该项目的理解和相关常识，因为我无法直接访问外部网站：\n\n“构建沃森”一文概述了 DeepQA 项目，该项目的目标是创建一个问答 (QA) 系统，使其能够在 Jeopardy! 问答节目中与顶级人类选手竞争。 这篇文章详细介绍了开放领域 QA 中固有的挑战，即系统必须理解复杂的自然语言，推理大量信息，并在时间限制内提供精确的答案。\n\n文章中描述的沃森架构基于大规模并行和基于证据的推理。 它利用数百种不同的算法（管道）同时运行，以分析问题、生成假设（可能的答案）、从各种来源（包括结构化数据库、非结构化文本和本体）收集证据，并根据累积的证据对每个假设进行评分。 这些算法独立运行，提高了鲁棒性，并允许采用不同的方法进行问题分析和答案生成。\n\nDeepQA 项目的一个关键贡献是它强调*统计*机器学习技术，而不是仅仅依赖手工制定的规则。 这使得沃森能够从数据中学习并适应语言的细微差别。 该文章可能讨论了沃森如何权衡和组合来自这些不同算法的证据，从而得出每个假设的最终置信度评分。 得分最高的假设随后被呈现为沃森的答案。\n\n该文章强调，沃森的成功源于其将包括自然语言处理、信息检索、知识表示和机器学习在内的各种 AI 技术集成到连贯且可扩展的架构中的能力。 该系统的开放架构允许通过添加新的算法和知识来源进行持续改进。 最后，该文章可能讨论了 DeepQA 项目对于推进 AI 领域及其在 Jeopardy! 之外的潜在应用的更广泛意义。"
  },
  {
    "id": "44521225",
    "title": "Andrew Ng: Building Faster with AI [video]",
    "url": "https://www.youtube.com/watch?v=RNJCfif1dPY",
    "summary": "The information provided doesn't describe the content of Andrew Ng's \"Building Faster with AI\" video. It's just the standard footer information found on YouTube videos, related to copyright, terms of service, and contact information. Therefore, it's impossible to summarize the content of the video based solely on this information.\n",
    "chinese_title": "吴恩达：用人工智能加速构建 [视频]",
    "chinese_summary": "所提供的信息并未描述吴恩达“利用人工智能构建更快速的应用”视频的内容，仅仅是YouTube视频上常见的页脚信息，与版权、服务条款和联系方式相关。因此，仅凭这些信息无法总结该视频的内容。"
  },
  {
    "id": "44497981",
    "title": "Reverse proxy deep dive",
    "url": "https://medium.com/@mitendra_mahto/cross-posted-from-https-startwithawhy-com-reverseproxy-2024-01-15-reverseproxy-deep-dive-html-c3443dc3e0e5",
    "summary": "This article provides a deep dive into the connection management aspects of reverse proxies, a critical component in distributed systems. It begins by outlining the core functions of a reverse proxy: connection management, HTTP request parsing, service discovery, functioning as an HTTP client, and observability.\n\nThe main focus is on connection management, detailing the steps a proxy takes to handle client connections: binding to a port, listening, accepting connections, and transferring data. The article highlights the challenges in scaling connection management, particularly concurrency. Traditional blocking I/O is inefficient for numerous clients, leading to the evolution of non-blocking I/O and I/O multiplexing (select, poll, epoll) to handle more concurrent connections.\n\nThe article then delves into the C10k problem and the rise of event-driven programming, emphasizing single event loops for monitoring I/O readiness. It discusses the limitations of single-threaded event loops for long-running operations, leading to multi-threaded solutions. Socket sharding using SO_REUSEPORT is also covered as a method for leveraging OS load balancing. Finally, the article discusses TLS support and library choices (OpenSSL, LibreSSL, BoringSSL) as a complication in connection management.\n\nThe conclusion emphasizes the complexity of scaling connection management and encourages readers to understand the nuances of different proxy solutions. The author promises future posts to cover other aspects of reverse proxies like HTTP parsing, service discovery, HTTP client functionalities, and observability.\n",
    "chinese_title": "反向代理深度解析",
    "chinese_summary": "反向代理连接管理深度解析：分布式系统中的关键组件\n\n本文深入探讨了反向代理的连接管理方面，它是分布式系统中的一个关键组件。文章首先概述了反向代理的核心功能：连接管理、HTTP请求解析、服务发现、作为HTTP客户端以及可观测性。\n\n重点在于连接管理，详细介绍了代理处理客户端连接的步骤：绑定端口、监听、接受连接和传输数据。文章强调了扩展连接管理方面的挑战，特别是并发性。传统的阻塞I/O对于大量客户端来说效率低下，导致了非阻塞I/O和I/O多路复用（select、poll、epoll）的演进，以处理更多的并发连接。\n\n然后，文章深入探讨了C10k问题以及事件驱动编程的兴起，强调使用单个事件循环来监视I/O就绪状态。文章讨论了单线程事件循环在处理长时间运行操作方面的局限性，从而引出了多线程解决方案。还介绍了使用SO_REUSEPORT的套接字分片，作为利用操作系统负载均衡的一种方法。最后，文章讨论了TLS支持和库选择（OpenSSL、LibreSSL、BoringSSL）作为连接管理中的复杂因素。\n\n结论强调了扩展连接管理的复杂性，并鼓励读者理解不同代理解决方案的细微差别。作者承诺在未来的文章中涵盖反向代理的其他方面，如HTTP解析、服务发现、HTTP客户端功能和可观测性。"
  },
  {
    "id": "44540241",
    "title": "New Date(\"wtf\") – How well do you know JavaScript's Date class?",
    "url": "https://jsdate.wtf",
    "summary": "This is a JavaScript quiz focused on the `Date` class. It appears to be presented on a webpage created by \"samwho.\" The quiz contains 20 questions that test knowledge of the JavaScript Date object. Questions are verified using NodeJS 24.4.0 on a MacBook Pro with the BST timezone (UTC+1). The page includes navigation elements like \"Start Quiz,\" \"Next Question,\" and an end-of-quiz message indicating the score as \"0 / 0.\" Options to share and copy are also available. The title \"New Date(\"wtf\") – How well do you know JavaScript's Date class?\" suggests some questions may focus on unexpected or less common behaviors when instantiating `Date` objects with unusual inputs.\n",
    "chinese_title": "New Date(\"wtf\") – 你有多了解 JavaScript 的 Date 类？",
    "chinese_summary": "这是一个关于`Date`类的JavaScript测验。它似乎是由\"samwho\"创建的网页呈现的。该测验包含20个问题，用于测试对JavaScript Date对象的了解。问题在配备BST时区（UTC+1）的MacBook Pro上使用NodeJS 24.4.0进行验证。页面包含诸如“开始测验”、“下一题”等导航元素，以及表示分数为“0 / 0”的测验结束消息。页面上还提供分享和复制选项。标题“New Date(\"wtf\") – 你有多了解JavaScript的Date类？”暗示某些问题可能侧重于使用不寻常的输入实例化`Date`对象时出现的意外或不太常见的行为。"
  },
  {
    "id": "44501287",
    "title": "Dict Unpacking in Python",
    "url": "https://github.com/asottile/dict-unpacking-at-home",
    "summary": "This article introduces a satirical Python package, `dict-unpacking-at-home`, which purports to offer dictionary unpacking functionality. The author strongly advises against its use, humorously referencing concerns about accidentally creating a critical PyPI package.\n\nThe package is installed via `pip install dict-unpacking-at-home` and activated by adding `# -*- coding: dict-unpacking-at-home -*-` to the top of a Python file. The article demonstrates its usage with examples, showcasing unpacking simple dictionaries and even nested structures like lists.\n\nHowever, the author emphasizes the significant drawbacks. Specifically, the current version introduces errors in stack trace line numbers, though a potential fix exists in the `correct-line-numbers` branch, albeit at an unspecified \"cost.\" The concluding remark reinforces the initial warning, discouraging the use of the package. The footnote references a fear about another joke project becoming unexpectedly popular and crucial to PyPI. Essentially, the article is a cautionary tale disguised as a package announcement, highlighting the perils of unintended consequences in open-source development.\n",
    "chinese_title": "Python中的字典解包",
    "chinese_summary": "本文介绍了一个讽刺性的Python包`dict-unpacking-at-home`，声称提供字典解包功能。作者强烈建议不要使用它，幽默地提及了对意外创建关键PyPI包的担忧。\n\n该包通过`pip install dict-unpacking-at-home`安装，并通过在Python文件顶部添加`# -*- coding: dict-unpacking-at-home -*-`来激活。本文通过示例展示了它的用法，展示了解包简单字典，甚至包括列表等嵌套结构。\n\n然而，作者强调了其显著的缺点。具体来说，当前版本引入了堆栈跟踪行号错误，尽管在`correct-line-numbers`分支中存在潜在的修复方案，但代价未明。结论重申了最初的警告，不鼓励使用该包。脚注提到了对另一个玩笑项目变得出乎意料地流行并对PyPI至关重要的担忧。本质上，本文是一个伪装成软件包公告的警示故事，突出了开源开发中意外后果的危险。"
  },
  {
    "id": "44543092",
    "title": "No limit to ChatGPT searches 'remarkable' given environmental impact",
    "url": "https://www.independent.co.uk/climate-change/news/tim-peake-chatgpt-ceo-british-chichester-b2787894.html",
    "summary": "At the Goodwood Festival of Speed, astronaut Tim Peake highlighted the \"remarkable\" lack of limits on ChatGPT searches, raising concerns about the substantial environmental impact of the data centers powering AI. He emphasized the energy and water consumption associated with AI searches, suggesting a need for responsible usage. Peake proposed orbital data centers as a potential solution, citing access to clean, limitless energy in space. However, critics like Dr. Domenico Vicinanza argue that space-based data centers would be complex and resource-intensive.\n\nPeake also noted that over 50% of climate data originates from space, underlining its crucial role in environmental monitoring. The Future Lab showcased cutting-edge technologies, including the Ameca humanoid robot, powered by ChatGPT, which demonstrated impressive interactive capabilities. Stuart Miller, CEO of the National Robotarium, stressed the importance of understanding and harmonizing human-robot interactions. Peake questioned whether AI tools like ChatGPT, while useful, might undermine human curiosity and the satisfaction derived from independent discovery. He emphasized the need for a balance in AI usage and education about its capabilities.\n",
    "chinese_title": "鉴于环境影响，ChatGPT搜索“显著”不设上限",
    "chinese_summary": "在古德伍德速度节上，宇航员蒂姆·皮克强调了ChatGPT搜索“显著”缺乏限制的问题，并引发了对驱动人工智能的数据中心对环境产生巨大影响的担忧。他强调了人工智能搜索相关的能源和水消耗，并建议负责任地使用。皮克提出轨道数据中心作为一种潜在的解决方案，理由是太空拥有清洁、无限的能源。然而，像多梅尼科·维琴扎博士这样的批评家认为，天基数据中心将是复杂且资源密集的。\n\n皮克还指出，超过50%的气候数据来自太空，突显了其在环境监测中的关键作用。“未来实验室”展示了尖端技术，包括由ChatGPT驱动的Ameca人形机器人，该机器人展示了令人印象深刻的互动能力。国家机器人研究院首席执行官斯图尔特·米勒强调了理解和协调人机互动的重要性。皮克质疑，像ChatGPT这样的人工智能工具虽然有用，但是否会削弱人类的好奇心以及从独立发现中获得的满足感。他强调了在人工智能使用方面的平衡以及对其能力的教育需求。"
  },
  {
    "id": "44531569",
    "title": "Repasting a MacBook",
    "url": "https://christianselig.com/2025/07/repaste-macbook/",
    "summary": "In this article, the author recounts their experience repasting the CPU of their aging M1 Pro MacBook Pro to address loud fan noise. They acknowledge the MacBook's continued performance but note the increasing fan noise during intensive tasks.\n\nThe author explains the purpose of thermal paste and its tendency to dry out over time, leading to less effective heat transfer. Following an iFixit guide, they disassembled their MacBook to replace the thermal paste. They encountered \"Carbon Black,\" a special thermal compound used by Apple on RAM chips, which they decided not to replace due to its rarity.\n\nDisaster struck when the author accidentally tore the delicate fan cable during disassembly, necessitating a replacement fan. Further misfortune befell them when the equally fragile Touch ID sensor cable was inexplicably damaged during reassembly, rendering the Touch ID function unusable and requiring a potentially expensive Apple repair.\n\nDespite the setbacks, the repasting effort yielded positive results. Post-repasting, the MacBook's maximum CPU temperature during a Cinebench test decreased from 102°C to 96°C, and the maximum fan speed dropped significantly from 6,300 RPM to 4,700 RPM, leading to a quieter and more efficient cooling system. The CPU also idled at a cooler temperature.\n\nThe author concludes by advising against repasting a MacBook unless you have experience with delicate electronics or can find a reputable repair shop to do it. The risk of damaging delicate components, as the author unfortunately discovered, is significant. However, the reward of improved thermal performance can be worthwhile for older MacBooks.\n",
    "chinese_title": "重新涂抹MacBook散热硅脂",
    "chinese_summary": "本文作者讲述了其为解决老旧 M1 Pro MacBook Pro 风扇噪音过大问题而重涂 CPU 散热硅脂的经历。他们肯定了MacBook的持续性能，但也注意到在执行密集任务时风扇噪音越来越大。\n\n作者解释了散热硅脂的作用及其随时间推移而干燥的趋势，这会导致热传递效率降低。在参考 iFixit 指南后，他们拆卸了 MacBook 以更换散热硅脂。他们遇到了苹果在 RAM 芯片上使用的特殊导热化合物“Carbon Black”，由于其稀有性，他们决定不更换。\n\n在拆卸过程中，作者不小心撕裂了脆弱的风扇电缆，导致需要更换风扇，灾难发生了。 更糟糕的是，在重新组装过程中，同样脆弱的 Touch ID 传感器电缆也莫名其妙地损坏了，导致 Touch ID 功能无法使用，并且可能需要昂贵的Apple维修。\n\n尽管遇到挫折，但重涂散热硅脂的努力产生了积极的结果。 重涂后，MacBook 在 Cinebench 测试期间的最高 CPU 温度从 102°C 降至 96°C，最高风扇转速从 6,300 RPM 显著降至 4,700 RPM，从而实现了更安静、更高效的散热系统。 CPU 的空闲温度也更低。\n\n作者最后建议，除非您有处理精密电子产品的经验，或者可以找到信誉良好的维修店来完成这项工作，否则不要重涂 MacBook 的散热硅脂。 正如作者不幸发现的那样，损坏精密元件的风险很高。 然而，对于旧款 MacBook 而言，改善散热性能的回报可能是值得的。"
  },
  {
    "id": "44538413",
    "title": "OpenAI delays launch of open-weight model",
    "url": "https://twitter.com/sama/status/1943837550369812814",
    "summary": "The provided text is not an article about OpenAI delaying the launch of an open-weight model. Instead, it's an error message from X (formerly Twitter) indicating that JavaScript is disabled in the user's browser. The message instructs the user to enable JavaScript or switch to a supported browser to continue using the platform. It also provides links to the Help Center, Terms of Service, Privacy Policy, Cookie Policy, Imprint, and Advertising information, along with the copyright notice for X Corp. in 2025. **Therefore, there is no information about OpenAI or any delay of a model launch within the provided text.**\n",
    "chinese_title": "OpenAI推迟发布开源权重模型",
    "chinese_summary": "提供的文本并非关于OpenAI推迟发布开源权重模型的文章，而是X（原Twitter）的错误信息，表明用户的浏览器中禁用了JavaScript。该信息指示用户启用JavaScript或切换到支持的浏览器以继续使用该平台。它还提供了帮助中心、服务条款、隐私政策、Cookie政策、版本说明和广告信息的链接，以及X Corp.在2025年的版权声明。**因此，提供的文本中没有任何关于OpenAI或任何模型发布延迟的信息。**"
  },
  {
    "id": "44540858",
    "title": "ICANN fumes as AFRINIC offers no explanation for annulled election",
    "url": "https://www.theregister.com/2025/07/11/afrinic_election_annulled_why/",
    "summary": "This article details the ongoing turmoil surrounding AFRINIC, the African regional internet registry responsible for managing IP addresses and autonomous system numbers. The recent AFRINIC election, intended to end a period of boardless operation since 2022, was annulled by the court-appointed receiver due to alleged irregularities related to voter documentation, specifically fraudulent Powers of Attorney.\n\nICANN, the global internet governance organization, is \"fuming\" and has criticized AFRINIC's receiver for lack of transparency regarding the annulment and investigations into the alleged fraud. ICANN has reminded AFRINIC of its policy that allows it to appoint an emergency replacement for a dysfunctional RIR.\n\nISPA alleges that fraudulent Powers of Attorney were used to vote on behalf of resource holders without their consent. AFRINIC has not responded to requests for information regarding the annulment and allegations.\n\nCloud Innovation Ltd, a past litigant with AFRINIC, has called for AFRINIC to be wound up and its responsibilities transferred to a more trusted framework, citing the annulled election as evidence of the organization's irredeemable dysfunction. They have already filed court papers seeking this outcome. The company believes this action would be faster and more stable than ICANN derecognizing AFRINIC.\n",
    "chinese_title": "ICANN对AFRINIC取消选举却未作解释表示不满。",
    "chinese_summary": "本文详细介绍了围绕非洲互联网络信息中心（AFRINIC）持续不断的动荡，该机构负责管理IP地址和自治系统号。最近的AFRINIC选举，旨在结束自2022年以来无董事会运作的局面，但因法院指定的接管人认为选民文件存在违规行为，特别是欺诈性的授权委托书，而被宣布无效。\n\n全球互联网治理组织ICANN对此“怒火中烧”，并批评AFRINIC的接管人在宣布选举无效和调查所谓欺诈行为方面缺乏透明度。ICANN已提醒AFRINIC，其政策允许其为失能的RIR指定紧急替代机构。\n\nISPA声称，欺诈性的授权委托书被用于代表资源持有者进行投票，而未经他们的同意。AFRINIC尚未回应有关选举无效和指控的信息请求。\n\n过去与AFRINIC有过诉讼的Cloud Innovation Ltd公司呼吁解散AFRINIC，并将其职责转移到一个更值得信赖的框架下，理由是选举无效证明了该组织已无可救药地失能。他们已经提交了法院文件，寻求这一结果。该公司认为，此举比ICANN取消对AFRINIC的认可更快、更稳定。"
  },
  {
    "id": "44539338",
    "title": "Incus – Next-generation system container, application container, and VM manager",
    "url": "https://linuxcontainers.org/incus/",
    "summary": "Incus is a next-generation system container, application container, and virtual machine manager designed to provide a cloud-like user experience. It allows users to manage both containers and virtual machines, sharing underlying storage and network resources. Incus is image-based, offering images for various Linux distributions and supporting diverse storage backends and network types. It can be deployed from single laptops to full server racks.\n\nManagement of instances is done through a command-line tool, a REST API, or third-party integrations, with a single API for both local and remote access. Key features include security by design (unprivileged containers), scalability, an intuitive API, and remote access capabilities. It also supports projects for compartmentalizing images and profiles.\n\nIncus offers configurable profiles applicable to both containers and VMs, backup and recovery features, snapshots, container/image transfer, and instance migration. Advanced resource control is available for CPU, memory, network I/O, and more. Device passthrough for USB, GPU, and other devices is also supported.\n\nIncus runs on recent Linux distributions. While upstream Incus doesn't provide packages, they are available through distributions or third-party repositories. The Incus client is available for Windows and macOS to connect to Linux-based servers. It offers LTS and feature releases, with Incus 6.0 being the current LTS release. Commercial support is available from Zabbly. The project is written in Go, licensed under Apache 2, and welcomes contributions following the DCO.\n",
    "chinese_title": "Incus – 下一代系统容器、应用容器和虚拟机管理器",
    "chinese_summary": "Incus是下一代系统容器、应用容器和虚拟机管理器，旨在提供类似云的用户体验。它允许用户管理容器和虚拟机，共享底层存储和网络资源。Incus基于镜像，提供各种Linux发行版的镜像，并支持多种存储后端和网络类型。它可以部署在单台笔记本电脑到整个服务器机架上。\n\n实例的管理通过命令行工具、REST API或第三方集成完成，本地和远程访问均使用单个API。主要功能包括内建安全性（非特权容器）、可扩展性、直观的API和远程访问能力。它还支持项目，用于划分镜像和配置文件。\n\nIncus提供适用于容器和虚拟机的可配置配置文件、备份和恢复功能、快照、容器/镜像传输以及实例迁移。高级资源控制可用于CPU、内存、网络I/O等。还支持USB、GPU和其他设备的设备直通。\n\nIncus运行在最新的Linux发行版上。虽然上游Incus不提供软件包，但可以通过发行版或第三方存储库获得。Incus客户端可用于Windows和macOS，以连接到基于Linux的服务器。它提供LTS和功能版本，其中Incus 6.0是当前的LTS版本。Zabbly提供商业支持。该项目用Go编写，使用Apache 2许可，并欢迎遵循DCO的贡献。"
  },
  {
    "id": "44500362",
    "title": "Show HN: I built a toy music controller for my 5yo with a coding agent",
    "url": "https://github.com/jeffmccune/sonoserve",
    "summary": "This \"Show HN\" post describes a project where the author built a simple music controller for their 5-year-old using an M5Stack CardPuter to control a Sonos Play:1 speaker. The goal is to allow the child to easily restart their favorite playlist or play their favorite tracks with minimal effort. The CardPuter acts as a hotkey controller, triggered by simple button presses. The core logic for controlling the Sonos speaker resides in a Go executable on a server, minimizing complexity on the CardPuter. The aim is a simple user experience: turn on the device, wait for a green light, and press a button to initiate a desired music action. The project effectively creates a child-friendly interface for music playback using readily available hardware and a Go backend.\n",
    "chinese_title": "展示HN：我用编码代理为5岁的孩子做了个玩具音乐控制器",
    "chinese_summary": "作者在“Show HN”上发布的这篇文章介绍了一个项目，作者使用 M5Stack CardPuter 为 5 岁的孩子制作了一个简单的音乐控制器，用于控制 Sonos Play:1 扬声器。目的是让孩子能够轻松地重新开始他们最喜欢的播放列表或以最小的努力播放他们最喜欢的曲目。 CardPuter 充当热键控制器，由简单的按钮按下触发。用于控制 Sonos 扬声器的核心逻辑驻留在服务器上的 Go 可执行文件中，从而最大限度地降低了 CardPuter 上的复杂性。目标是提供简单的用户体验：打开设备，等待绿灯亮起，然后按下一个按钮来启动所需的音乐操作。该项目有效地使用现成的硬件和一个 Go 后端为音乐播放创建了一个儿童友好的界面。"
  },
  {
    "id": "44537113",
    "title": "A software conference that advocates for quality",
    "url": "https://bettersoftwareconference.com/",
    "summary": "BSC 2025, a software conference advocating for quality in software development, will be held in a charming small town in Sweden from July 12-14. The conference will also be livestreamed on Twitch starting at 9 AM Swedish time, and the recordings will be available for free online.\n\nThe conference features a diverse range of speakers and topics. Day 1 includes talks on programming history (Casey Muratori), parallelizing physics engines (Dennis Gustafsson), development tools (Bill Hall), and internal engine architecture (Vjekoslav Krajačić).\n\nDay 2 covers realtime debugger visualization (Ryan Fleury), project completion (Eskil Steenberg), programming vehicles in games (Wassim Alhajomar), dynamic phase alignment in audio (Sander J. Skjegstad), and a provocative talk on project selection (Ted Bendixson).\n\nDay 3 includes presentations on glyph rendering with gradients (Demetri Spanos), security (Eskil Steenberg), deep learning and computer vision for game developers (Cameron Reikes), AST-free compilers (Sam H. Smith), and optimistic assumptions in programming (Andrew Reece).\n\nPhysical attendance is invite-only, with invitees receiving an attendee guide. Updates are available via newsletter subscription. The organizers are Sam, Sander, and Charlie. Questions can be directed via Twitter.\n",
    "chinese_title": "倡导质量的软件会议",
    "chinese_summary": "BSC 2025，一个倡导软件开发质量的软件会议，将于7月12日至14日在瑞典一个迷人的小镇举行。会议也将于瑞典时间早上9点开始在Twitch上进行直播，录像将免费在线提供。\n\n会议汇集了各种各样的演讲者和主题。第一天包括关于编程历史（Casey Muratori）、并行物理引擎（Dennis Gustafsson）、开发工具（Bill Hall）和内部引擎架构（Vjekoslav Krajačić）的讲座。\n\n第二天涵盖实时调试器可视化（Ryan Fleury）、项目完成（Eskil Steenberg）、游戏中的车辆编程（Wassim Alhajomar）、音频中的动态相位对齐（Sander J. Skjegstad）以及关于项目选择的引人深思的演讲（Ted Bendixson）。\n\n第三天包括关于使用梯度进行字形渲染（Demetri Spanos）、安全（Eskil Steenberg）、面向游戏开发者的深度学习和计算机视觉（Cameron Reikes）、无AST编译器（Sam H. Smith）以及编程中的乐观假设（Andrew Reece）的演示。\n\n现场参会仅限邀请，受邀者将收到参会指南。更新信息可通过订阅新闻通讯获取。组织者是 Sam、Sander 和 Charlie。问题可通过 Twitter 提出。"
  },
  {
    "id": "44504250",
    "title": "Monorail – Turn CSS animations into interactive SVG graphs",
    "url": "https://muffinman.io/monorail/",
    "summary": "Monorail is a tool that transforms CSS keyframe animations into interactive SVG graphs. The main purpose of the tool is to allow users to visualize and interact with the animation process in a graphical format. The article highlights the tool's ability to turn any CSS keyframe animation into an interactive graph for better understanding and control. It encourages users to explore an example provided on the page to experience the tool's functionality. For detailed instructions and usage information, the article directs users to the Monorail's GitHub repository. The page also includes a playback speed adjustment feature, likely to further facilitate user interaction and analysis of the animated data.\n",
    "chinese_title": "单轨 – 将 CSS 动画转换为交互式 SVG 图表",
    "chinese_summary": "Monorail：将CSS关键帧动画转换为交互式SVG图表。该工具的主要目的是允许用户以图形格式可视化并交互动画过程。本文重点介绍了该工具将任何CSS关键帧动画转换为交互式图表的能力，以便更好地理解和控制。文章鼓励用户探索页面上提供的示例，以体验该工具的功能。有关详细说明和使用信息，文章引导用户访问Monorail的GitHub存储库。页面还包括播放速度调整功能，可能旨在进一步方便用户交互和分析动画数据。"
  },
  {
    "id": "44511722",
    "title": "Rice rebels: Research reveals grain's brewing benefits",
    "url": "https://phys.org/news/2025-06-rice-rebels-reveals-grain-brewing.html",
    "summary": "This article discusses research from the University of Arkansas challenging the perception that rice is a poor ingredient for beer brewing. Researchers Christian Schubert and Scott Lafontaine have published two studies demonstrating rice's potential to enhance flavor profiles, improve extract yield (the amount of fermentable sugars), and even reduce fermentation time, particularly in non-alcoholic beer.\n\nTheir work highlights the timely nature of this research, coinciding with Arkansas legislation incentivizing the use of locally grown rice in beer and sake production. The researchers warn that current rice breeding programs focused on traits beneficial for food applications, like high head rice yield and low-glycemic index, may inadvertently hinder its brewing potential.\n\nThe first study focuses on non-alcoholic beer, showing that rice can limit undesirable aldehydes, shortening fermentation and improve flavor. Sensory panels revealed differing preferences between American and German participants, suggesting a balanced rice-barley blend might have broader appeal. The second study, analyzing 74 rice cultivars, found significant variability in extract potential, identifying varieties with lower amylose content that are more efficient for sugar release during the mashing process.\n\nLafontaine emphasizes that rice is not just a cheap filler but a valuable tool for innovation, offering distinct technical and sensory benefits. Certain rice varieties also have lower gelatinization temperatures, making them easier to process. This research encourages brewers to reconsider rice, contributing to more sustainable and efficient brewing practices while catering to evolving consumer preferences.\n",
    "chinese_title": "稻米反叛者：研究揭示谷物的酿造益处",
    "chinese_summary": "本文探讨了阿肯色大学的研究，该研究挑战了人们认为大米不适合啤酒酿造的观点。研究人员Christian Schubert和Scott Lafontaine发表了两项研究，表明大米具有增强风味、提高提取率（即可发酵糖的量）甚至缩短发酵时间的潜力，尤其是在无醇啤酒中。\n\n他们的工作强调了这项研究的及时性，恰逢阿肯色州立法激励在啤酒和清酒生产中使用当地种植的大米。研究人员警告说，目前专注于食品应用有利特性（如高整米率和低血糖指数）的水稻育种计划可能会无意中阻碍其酿造潜力。\n\n第一项研究侧重于无醇啤酒，表明大米可以限制不良醛类物质，缩短发酵时间并改善风味。感官小组发现美国和德国参与者之间的偏好存在差异，这表明平衡的大米-大麦混合物可能具有更广泛的吸引力。第二项研究分析了74个水稻品种，发现提取潜力存在显着差异，确定了直链淀粉含量较低的品种，这些品种在糖化过程中更有效地释放糖分。\n\nLafontaine强调，大米不仅仅是一种廉价的填充物，而是一种有价值的创新工具，可提供独特的技术和感官益处。某些水稻品种还具有较低的糊化温度，使其更易于加工。这项研究鼓励啤酒商重新考虑大米，从而有助于更可持续和高效的酿造实践，同时满足不断变化的消费者偏好。"
  },
  {
    "id": "44510038",
    "title": "Increasing the Fidelity of Qubit Operations",
    "url": "https://www.nature.com/articles/s41467-025-61126-0",
    "summary": "This article presents a high-coherence transmon qubit design, fabrication, and measurement setup that achieves energy relaxation times (T1) and echo dephasing times (T2 echo) surpassing those previously reported for transmon qubits. The researchers measured a qubit frequency of 2.9 GHz, a median T1 of 425 μs (maximum 666 ± 33 μs), and a median T2 echo of 541 μs (maximum 1057 ± 138 μs).\n\nThe authors detail their fabrication process, which builds upon existing methods but incorporates modifications like using CF4 for Nb etching and pre-dicing the sample to minimize atmospheric exposure. This detailed documentation aims to enable other research groups to reproduce their results.\n\nThe sample contains four transmon qubits, each coupled to a resonator for readout. Two are flux-tunable, and two have fixed frequencies. Measurements were performed over two cooldown cycles. While the first cooldown showed promising initial results, the second cooldown revealed decreased T1 and T2 echo, possibly due to environmental changes or surface oxidation. Despite the decrease, the coherence times achieved still represent a significant improvement.\n\nThe researchers conclude that their work represents a step forward in superconducting qubit technology and that the detailed information provided will benefit the broader quantum computing research community.\n",
    "chinese_title": "提高量子比特操作的保真度",
    "chinese_summary": "本文介绍了一种高相干超导量子比特的设计、制造和测量装置，该装置实现的能量弛豫时间（T1）和自旋回波退相干时间（T2 echo）超过了先前报道的超导量子比特。研究人员测得的量子比特频率为2.9 GHz，T1中值为425 μs（最大值为666 ± 33 μs），T2 echo中值为541 μs（最大值为1057 ± 138 μs）。\n\n作者详细介绍了他们的制造过程，该过程基于现有方法，但进行了一些修改，例如使用CF4进行Nb刻蚀和预先切割样品以最大限度地减少大气暴露。这种详细的文档旨在使其他研究小组能够重现他们的结果。\n\n该样品包含四个超导量子比特，每个量子比特都耦合到一个谐振器以进行读出。其中两个是磁通可调的，另外两个具有固定频率。测量是在两个降温周期内进行的。虽然第一次降温显示出有希望的初步结果，但第二次降温显示T1和T2 echo降低，这可能是由于环境变化或表面氧化造成的。尽管有所下降，但实现的相干时间仍然代表着显著的改进。\n\n研究人员得出结论，他们的工作代表了超导量子比特技术的一个进步，并且提供的详细信息将使更广泛的量子计算研究界受益。"
  },
  {
    "id": "44533464",
    "title": "Astronomers race to study interstellar interloper",
    "url": "https://www.science.org/content/article/astronomers-race-study-interstellar-interloper",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "天文学家竞相研究星际访客",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "44543011",
    "title": "Meta Superintelligence – Leadership Compute, Talent, and Data",
    "url": "https://semianalysis.com/2025/07/11/meta-superintelligence-leadership-compute-talent-and-data/",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "Meta 超级智能 – 领导力计算、人才和数据",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "44537373",
    "title": "Measuring power network frequency using junk you have in your closet",
    "url": "https://halcy.de/blog/2025/02/09/measuring-power-network-frequency-using-junk-you-have-in-your-closet/",
    "summary": "This article details a project to measure power network frequency using readily available household items. The author, inspired by the Baltic states' electricity grid synchronization with the continental European grid, wanted to observe the frequency changes during the process. Lacking specialized equipment, the author ingeniously utilized a PC's line-in, an audio cable, and existing power cables as an antenna to pick up mains hum.\n\nThe author recorded the faint signal using Audacity, normalized it, and then developed a Python script incorporating digital signal processing (DSP) techniques, specifically a Hann windowed FFT, to analyze the audio data and extract the dominant frequency component. A large FFT window (25 seconds) was used for good frequency resolution.\n\nTo validate the measurements, the author compared the results with data from Sympower's frequency monitoring tool. Despite some time lag and smoothing, the DIY setup proved surprisingly accurate in tracking the general frequency fluctuations.\n\nThe author continued to log data and compared the results to data from f50hz.de, which provided information on the European network frequency. By shifting the author's data by 12.5 seconds to account for the FFT window's time lag, the moment of synchronization between the networks was clearly visible. The author notes an interesting drift in frequencies of the two networks toward one another before the breaker was flipped. The Python script used in the project is provided for readers to try their own measurements.\n",
    "chinese_title": "用你壁橱里的废品测量电网频率",
    "chinese_summary": "本文详细介绍了一个使用易得的家用物品测量电网频率的项目。作者受到波罗的海国家电网与欧洲大陆电网同步的启发，想观察该过程中的频率变化。由于缺乏专业设备，作者巧妙地利用了电脑的线路输入、音频线以及现有的电源线作为天线来拾取交流电声。\n\n作者使用Audacity记录了微弱的信号，对其进行了归一化处理，然后开发了一个Python脚本，该脚本结合了数字信号处理(DSP)技术，特别是Hann窗加权的FFT，来分析音频数据并提取主要的频率分量。 使用了较大的FFT窗口（25秒）以获得良好的频率分辨率。\n\n为了验证测量结果，作者将结果与Sympower的频率监测工具的数据进行了比较。 尽管存在一些时间滞后和平滑处理，但DIY设置在跟踪总体频率波动方面证明了出乎意料的准确性。\n\n作者继续记录数据，并将结果与f50hz.de的数据进行了比较，该网站提供了有关欧洲网络频率的信息。通过将作者的数据移动12.5秒以补偿FFT窗口的时间滞后，网络之间的同步时刻清晰可见。 作者注意到在断路器跳闸之前，两个网络的频率之间存在一个有趣的相互漂移。 提供了该项目中使用的Python脚本，供读者尝试自己的测量。"
  },
  {
    "id": "44535977",
    "title": "Introduction to Digital Filters (2024)",
    "url": "https://ccrma.stanford.edu/~jos/filters/",
    "summary": "\"Introduction to Digital Filters with Audio Applications\" by Julius O. Smith III is a comprehensive resource on digital filter theory and its practical application to audio processing. The text covers fundamental concepts like filter definition, linearity, and time-invariance. It delves into various representations of filters including difference equations, signal flow graphs, and impulse responses.\n\nThe book meticulously explains the Z-transform, frequency response analysis, and pole-zero analysis, providing tools for understanding and designing digital filters. Different implementation structures, such as direct forms, series, and parallel sections, are explored, along with their numerical properties.\n\nSpecial filter types like linear-phase and minimum-phase filters are examined. The material extends to advanced topics like allpass filters, paraunitary filters, and Laplace transform analysis, connecting digital filters to their analog counterparts. The state-space representation of filters is also covered, along with relevant system identification techniques.\n\nThe final sections delve into recursive digital filter design, including Butterworth lowpass filters and equation-error methods. The document also includes practical resources like Matlab utilities, examples of digital filtering in Faust and Pure Data, and links to online resources. The target audience appears to be students, researchers, and practitioners in audio engineering and signal processing.\n",
    "chinese_title": "数字滤波器导论 (2024)",
    "chinese_summary": "朱利叶斯·O·史密斯三世的《数字滤波器及其在音频中的应用导论》是一本关于数字滤波器理论及其在音频处理中的实际应用的综合性资源。该书涵盖了滤波器定义、线性度和时不变性等基本概念，并深入研究了滤波器的各种表示形式，包括差分方程、信号流图和脉冲响应。\n\n该书详细解释了Z变换、频率响应分析和极零点分析，为理解和设计数字滤波器提供了工具。探讨了不同的实现结构，如直接型、串联型和并联型，以及它们的数值特性。\n\n书中考察了线性相位和最小相位滤波器等特殊滤波器类型。该材料扩展到高级主题，如全通滤波器、酉滤波器和拉普拉斯变换分析，将数字滤波器与其模拟对应物联系起来。还介绍了滤波器的状态空间表示，以及相关的系统辨识技术。\n\n最后部分深入研究了递归数字滤波器设计，包括巴特沃斯低通滤波器和方程误差方法。该文档还包括实用的资源，如Matlab工具、Faust和Pure Data中的数字滤波示例，以及在线资源链接。目标受众似乎是音频工程和信号处理领域的学生、研究人员和从业者。"
  },
  {
    "id": "44534104",
    "title": "U.S. abandons hunt for signal of cosmic inflation",
    "url": "https://www.science.org/content/article/u-s-abandons-hunt-signal-cosmic-inflation",
    "summary": "The article \"U.S. abandons hunt for signal of cosmic inflation\" reports that the U.S. National Science Foundation (NSF) has decided to halt funding for the next generation of the BICEP (Background Imaging of Cosmic Extragalactic Polarization) telescope array, a project primarily aimed at detecting the signature of cosmic inflation – gravitational waves imprinted on the cosmic microwave background (CMB).\n\nCosmic inflation is a theoretical period of exponential expansion in the very early universe, and finding evidence of it would be a major breakthrough in cosmology. The BICEP series of telescopes, located at the South Pole, has been at the forefront of this search.\n\nThe decision to defund the project is attributed to several factors, including budget constraints and the availability of data from other CMB experiments like the European Space Agency's Planck satellite and upcoming ground-based observatories like the Simons Observatory and CMB-S4. These other projects are expected to provide more comprehensive and potentially more sensitive data on CMB polarization.\n\nThe article suggests that while the US is abandoning its dedicated experiment, the search for inflation signals isn't ending. Instead, the focus is shifting towards international collaborations and alternative experimental approaches, leveraging the data and expertise gathered by other CMB experiments. The decision reflects a strategic realignment of resources within the cosmological research community, prioritizing broader and more collaborative efforts to understand the early universe. The article emphasizes that the scientific goal remains important, even if the US-led BICEP project is no longer the primary vehicle for pursuing it.\n",
    "chinese_title": "美国放弃搜寻宇宙膨胀信号",
    "chinese_summary": "美国放弃搜寻宇宙暴胀信号\n美国国家科学基金会（NSF）已决定停止资助下一代BICEP（宇宙外背景成像偏振）望远镜阵列，该项目主要旨在探测宇宙暴胀的信号——印刻在宇宙微波背景（CMB）上的引力波。\n\n宇宙暴胀是宇宙早期一个理论上的指数膨胀时期，找到其证据将是宇宙学的一项重大突破。位于南极的BICEP系列望远镜一直处于这一探索的前沿。\n\n该项目被取消资助的原因包括预算限制，以及来自欧洲航天局普朗克卫星和其他CMB实验（如西蒙斯天文台和CMB-S4等即将到来的地面观测站）的数据可用性。预计这些其他项目将提供更全面、可能更敏感的CMB偏振数据。\n\n文章表明，虽然美国放弃了其专门的实验，但对暴胀信号的搜寻并未结束。相反，重点正在转向国际合作和替代实验方法，利用其他CMB实验收集的数据和专业知识。这一决定反映了宇宙学研究界内部资源配置的战略性调整，优先考虑更广泛、更协作的努力来了解早期宇宙。文章强调，即使美国主导的BICEP项目不再是追求该目标的主要工具，科学目标仍然重要。"
  },
  {
    "id": "44542920",
    "title": "The law of adverse possession, and how one man lost his land to a herd of goats",
    "url": "https://www.npr.org/2023/05/03/1173682158/delaware-goats-property-land-squatters-adverse-possession",
    "summary": "This Planet Money article discusses a property dispute in Delaware involving Burt Banks, who inherited family land, and his neighbor, Melissa Schrock, whose goat pen encroached on half of Burt's property. When Burt tried to sell the land, the encroachment became a problem.\n\nBurt initially tried to persuade Melissa to move the pen but eventually resorted to suing her. This legal battle highlighted the complexities of property law, specifically the concept of adverse possession (implied, although not explicitly stated in this snippet). The article suggests that even with a deed, ownership isn't always straightforward, particularly when issues like long-term use and occupancy (by goats, in this case) come into play. The podcast episode dives into the intricacies of this particular case, exploring how \"squatting goats\" complicated the legal proceedings and challenged the conventional understanding of private property rights. While the outcome isn't revealed in the excerpt, it's clear that the situation is unusual and underscores the potential for legal surprises in property disputes.\n",
    "chinese_title": "逆权侵占法，以及一人如何因一群山羊失去土地",
    "chinese_summary": "这篇“金钱星球”的文章讨论了特拉华州的一起房产纠纷，涉及继承了家族土地的伯特·班克斯和他的邻居梅丽莎·施罗克。梅丽莎的羊圈侵占了伯特一半的土地。当伯特试图出售土地时，侵占问题就显现出来了。\n\n伯特最初试图说服梅丽莎搬迁羊圈，但最终诉诸法律。这场诉讼凸显了房产法的复杂性，特别是关于逆权侵占的概念（虽然在本节选里没有明确说明，但暗示了这一点）。文章表明，即使有产权契约，所有权也并非总是那么直接明了，尤其是在长期使用和占用（在本案中是羊）等问题出现时。播客节目深入探讨了这起案件的复杂性，探究了“擅自占地的羊”如何使法律程序变得复杂，并挑战了人们对私有产权的传统理解。虽然摘要中没有透露结果，但很明显，这种情况非常不寻常，并强调了房产纠纷中可能存在的法律意外。"
  },
  {
    "id": "44531120",
    "title": "At Least 13 People Died by Suicide Amid U.K. Post Office Scandal, Report Says",
    "url": "https://www.nytimes.com/2025/07/10/world/europe/uk-post-office-scandal-report.html",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "报告称，英国邮局丑闻导致至少13人自杀身亡。",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "44533004",
    "title": "Show HN: Vibe Kanban – Kanban board to manage your AI coding agents",
    "url": "https://github.com/BloopAI/vibe-kanban",
    "summary": "Vibe Kanban is a tool designed to help software engineers better manage and orchestrate AI coding agents like Claude Code, Gemini CLI, Codex, and Amp. As AI increasingly handles code writing, Vibe Kanban aims to streamline the human engineer's role in planning, reviewing, and coordinating tasks delegated to these agents.\n\nThe tool facilitates switching between different agents, orchestrates their execution in parallel or sequentially, simplifies code review and server starting, tracks task progress, and centralizes the configuration of coding agent MCP configs.\n\nTo use Vibe Kanban, users must first authenticate with their chosen coding agent. Installation is done via `npx vibe-kanban`. Detailed documentation and user guides are available on the website. Bug reports and feature requests should be submitted as GitHub issues.\n\nThe development setup requires Rust, Node.js, and pnpm. The command `pnpm run dev` starts the frontend and backend with live reloading, using a blank database copied from the `dev_assets_seed` folder. Building from source involves running `build-npm-package.sh` followed by `npm pack` in the `npx-cli` folder. The resulting build can be run using `npx [GENERATED FILE].tgz`. Contributions are welcome but should be discussed with the core team via GitHub issues before submitting pull requests.\n",
    "chinese_title": "Show HN: Vibe Kanban – 用于管理AI编码代理的看板",
    "chinese_summary": "Vibe Kanban：旨在帮助软件工程师更好地管理和编排AI编码助手（如Claude Code、Gemini CLI、Codex和Amp）的工具。 随着AI越来越多地处理代码编写，Vibe Kanban旨在简化人类工程师在规划、审查和协调分配给这些助手的任务中的角色。\n\n该工具便于在不同助手之间切换，并行或顺序地编排它们的执行，简化代码审查和服务器启动，跟踪任务进度，并集中管理编码助手MCP配置。\n\n要使用Vibe Kanban，用户必须首先通过他们选择的编码助手进行身份验证。 安装通过`npx vibe-kanban`完成。 详细文档和用户指南可在网站上找到。 Bug报告和功能请求应作为GitHub issue提交。\n\n开发环境需要Rust、Node.js和pnpm。 命令`pnpm run dev` 使用从 `dev_assets_seed` 文件夹复制的空白数据库启动带有实时重新加载的前端和后端。 从源代码构建涉及运行 `build-npm-package.sh`，然后在 `npx-cli` 文件夹中运行 `npm pack`。 生成的构建可以使用 `npx [GENERATED FILE].tgz` 运行。 欢迎贡献，但在提交pull request之前，应通过GitHub issue与核心团队讨论。"
  },
  {
    "id": "44540265",
    "title": "Show HN: Microsoft official MCP for documentation and more",
    "url": "https://github.com/MicrosoftDocs/mcp",
    "summary": "This \"Show HN\" introduces the Microsoft Learn Docs MCP Server, a cloud-hosted service that provides AI agents (like GitHub Copilot) with access to up-to-date information from official Microsoft documentation. It leverages the Model Context Protocol (MCP) for communication and offers a lightweight, streamable HTTP endpoint (`https://learn.microsoft.com/api/mcp`).\n\nKey features include high-quality content retrieval from Microsoft Learn, Azure, and Microsoft 365 documentation, semantic understanding for contextually relevant results, optimized chunking of content, and real-time updates.\n\nThe service is currently in public preview and supports integration with various tools like VS Code, Claude Desktop, Visual Studio, Cursor IDE, Roo Code, Cline, and GitHub. Installation methods range from one-click setup in some tools to manual configuration using `mcp-remote` as a proxy for legacy clients.\n\nTroubleshooting tips are provided for common issues like connection errors, lack of results, and the HTTP 405 error (attempting to access the endpoint directly via a browser).  The authors recommend using system prompts to encourage AI agents to utilize the MCP server for Microsoft-related queries. Future enhancements include expanding documentation coverage and improving query understanding. The document also links to additional resources such as the MCP specification and Microsoft Learn.\n",
    "chinese_title": "Show HN: 微软官方MCP，用于文档及更多",
    "chinese_summary": "微软 Learn Docs MCP Server：为 AI 代理提供最新微软官方文档信息"
  },
  {
    "id": "44528943",
    "title": "OpenFront: Realtime Risk-like multiplayer game in the browser",
    "url": "https://openfront.io/",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "OpenFront: 浏览器实时类风险多人游戏",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "44533337",
    "title": "Lead pigment in turmeric is the culprit in a global poisoning mystery (2024)",
    "url": "https://www.npr.org/sections/goats-and-soda/2024/09/23/nx-s1-5011028/detectives-mystery-lead-poisoning-new-york-bangladesh",
    "summary": "In a global lead poisoning mystery, the culprit was found to be lead chromate added to turmeric in Bangladesh. The practice began in the 1980s when farmers, struggling to dry turmeric roots properly after floods, used the bright yellow pigment to enhance the spice's color and marketability. This practice continued even after the floods receded due to the increased profit.\n\nThe problem was first detected by New York City detectives investigating high lead levels in Bangladeshi children and a Ph.D. student, Jenna Forsyth, studying pregnant women in rural Bangladesh with alarming lead levels. Forsyth traced the lead back to turmeric and discovered the farmers' use of lead chromate. The chemical fingerprint of the lead in the turmeric matched the lead in the women's blood.\n\nThe Bangladesh Food Safety Authority responded swiftly. They issued public warnings, confiscated lead-tainted turmeric, fined vendors, and educated farmers and mill owners about the dangers of lead contamination. As a result, the percentage of turmeric samples testing positive for lead in Dhaka markets dropped from 47% to 0%. Blood lead levels also decreased significantly among turmeric farmers and pregnant women in affected communities. This collaborative effort between researchers, health officials, and law enforcement agencies highlights the importance of data-driven investigations and swift intervention to address public health crises.\n",
    "chinese_title": "姜黄中的铅颜料是全球中毒之谜的罪魁祸首 (2024)",
    "chinese_summary": "全球铅中毒之谜：孟加拉国姜黄中添加铬酸铅为祸首。此做法始于20世纪80年代，当时农民在洪水过后难以妥善干燥姜黄根，便使用这种鲜黄色颜料来增强香料的颜色和适销性。即使洪水退去后，由于利润增加，这种做法依然持续。\n\n纽约市警探在调查孟加拉国儿童体内高铅含量以及博士生珍娜·福赛思在孟加拉国农村研究孕妇体内令人担忧的铅含量时，首次发现了这个问题。福赛思追溯铅的来源至姜黄，并发现了农民使用铬酸铅的做法。姜黄中铅的化学指纹与妇女血液中的铅相符。\n\n孟加拉国食品安全局迅速做出反应。他们发布了公共警告，没收了受铅污染的姜黄，对商贩处以罚款，并向农民和磨坊主宣传铅污染的危害。结果，达卡市场上姜黄样品中铅检测呈阳性的百分比从47%降至0%。受影响社区的姜黄农民和孕妇的血铅水平也显著下降。研究人员、卫生官员和执法机构之间的这种合作努力凸显了数据驱动的调查和迅速干预对于解决公共卫生危机的重要性。"
  },
  {
    "id": "44532306",
    "title": "Upgrading an M4 Pro Mac mini's storage for half the price",
    "url": "https://www.jeffgeerling.com/blog/2025/upgrading-m4-pro-mac-minis-storage-half-price",
    "summary": "This article details an upgrade of an M4 Pro Mac mini's internal storage from 512GB to 4TB using an M4-SSD upgrade kit. The author walks through the upgrade process, highlighting the trickiness of removing the rear plastic cover and the need for a DFU restore after installation. The unique aspect of the M4 Mac mini's storage is that the storage controller is integrated into the M4 SoC, requiring the DFU restore process.\n\nThe article mentions that a common misconception is that only Apple Silicon Macs can perform the DFU restore but Intel Macs with a T2 chip and even Hackintoshes can do it as well.\n\nThe author also compares the performance of the upgraded internal SSD with an external Thunderbolt 5 NVMe enclosure. The internal storage demonstrated superior write performance, attributed to having more flash chips. While the external drive was fast, it experienced slowdowns during sustained large file transfers, likely due to its DRAM cache limitations.\n\nUltimately, the author concludes that the M4-SSD upgrade, while expensive compared to standard NVMe SSDs, is significantly cheaper than Apple's own storage upgrade option. The article also provides links to related content.\n",
    "chinese_title": "用半价升级M4 Pro Mac mini的存储",
    "chinese_summary": "本文详细介绍了使用M4-SSD升级套件将M4 Pro Mac mini的内置存储从512GB升级到4TB的过程。作者逐步讲解了升级过程，强调了拆卸后盖塑料盖的棘手之处以及安装后需要进行DFU恢复。M4 Mac mini存储的独特之处在于，存储控制器集成在M4 SoC中，因此需要进行DFU恢复。\n\n文章提到一个常见的误解，即只有Apple Silicon Mac才能执行DFU恢复，但配备T2芯片的Intel Mac甚至Hackintosh也能做到。\n\n作者还将升级后的内置SSD与外部Thunderbolt 5 NVMe硬盘盒的性能进行了比较。内部存储表现出更优异的写入性能，这归因于其拥有更多的闪存芯片。虽然外部驱动器速度很快，但在持续传输大型文件时会出现速度减慢，这可能是由于其DRAM缓存的限制。\n\n最终，作者得出结论，与标准NVMe SSD相比，M4-SSD升级虽然价格昂贵，但比Apple自己的存储升级选项便宜得多。文章还提供了相关内容的链接。"
  },
  {
    "id": "44538212",
    "title": "HDD Clicker generates HDD clicking sounds, based on HDD Led activity",
    "url": "https://www.serdashop.com/HDDClicker",
    "summary": "This webpage advertises a product called \"HDD Clicker\" sold by Serdashop. The HDD Clicker generates HDD clicking sounds based on HDD LED activity.\n\nSerdashop is an online store with various categories of products, including:\n\n*   RETRO Soundcards\n*   MIDI\n*   Gadgets and toys\n*   Video PCB\n*   Joystick Products\n*   Solder Kits\n*   Parts\n*   Other Products\n*   Coming Soon\n\nThe webpage provides a shopping cart feature, login/registration options, and links to various pages like Home, Museum, General Conditions, Contact, and Links.\n\nWhen a user adds the \"HDD Clicker\" to their \"quotation,\" they are redirected to a quote page to complete a quotation request, and Serdashop will contact them. All listed prices include VAT. The website is powered by CCV Shop.\n",
    "chinese_title": "基于硬盘指示灯活动，HDD Clicker生成硬盘咔哒声。",
    "chinese_summary": "此网页宣传由Serdashop销售的名为“HDD Clicker”的产品。HDD Clicker根据硬盘指示灯活动生成硬盘咔哒声。\n\nSerdashop是一家在线商店，提供各种类别的产品，包括：\n\n*   复古声卡\n*   MIDI\n*   小工具和玩具\n*   视频PCB\n*   操纵杆产品\n*   焊接套件\n*   零件\n*   其他产品\n*   即将推出\n\n该网页提供购物车功能、登录/注册选项以及指向诸如首页、博物馆、通用条款、联系方式和链接等页面的链接。\n\n当用户将“HDD Clicker”添加到其“报价单”时，他们将被重定向到报价页面以完成报价请求，Serdashop将与他们联系。所有列出的价格均包含增值税。该网站由CCV Shop提供支持。"
  },
  {
    "id": "44539433",
    "title": "Psilocybin shows promise as anti-aging therapy",
    "url": "https://neurosciencenews.com/psilocybin-longevity-aging-29425/",
    "summary": "This article highlights a recent Emory University study published in *npj Aging* demonstrating psilocybin's potential as an anti-aging therapy. Researchers found that psilocin, a byproduct of psilocybin, extended the lifespan of human skin and lung cells by over 50% *in vitro*. Parallel *in vivo* experiments with aged mice (equivalent to 60-65 human years) showed a 30% increase in survival for mice treated with psilocybin compared to a control group. The treated mice also exhibited improved physical traits like better fur quality and hair regrowth.\n\nThe study suggests that psilocybin's benefits are linked to its impact on key hallmarks of aging, including reducing oxidative stress, improving DNA repair mechanisms, and preserving telomere length. These mechanisms influence human aging and the onset of age-related diseases.\n\nResearchers emphasize that these findings open a new avenue for understanding psilocybin's systemic effects, as most prior research has focused on its impact on the brain. They suggest that even late-life intervention with psilocybin in mice led to improved survival, indicating clinical relevance for healthy aging. The study underscores the need for further research in older adults to explore psilocybin's potential to improve both lifespan and quality of life, especially given the concerning trends in U.S. life expectancy compared to other developed nations.\n",
    "chinese_title": "裸盖菇素展现抗衰老疗法的潜力",
    "chinese_summary": "本文重点介绍埃默里大学近期发表在《npj Aging》上的一项研究，该研究表明，裸盖菇素具有作为抗衰老疗法的潜力。研究人员发现，裸盖菇素的代谢产物裸盖菇碱在*体外*实验中，将人类皮肤和肺细胞的寿命延长了50%以上。对老年小鼠（相当于人类60-65岁）进行的平行*体内*实验表明，与对照组相比，接受裸盖菇素治疗的小鼠存活率提高了30%。接受治疗的小鼠还表现出改善的身体特征，如更好的毛发质量和毛发再生。\n\n该研究表明，裸盖菇素的益处与其对衰老关键标志的影响有关，包括减少氧化应激、改善DNA修复机制和保持端粒长度。这些机制影响人类衰老和与年龄相关疾病的发生。\n\n研究人员强调，这些发现为理解裸盖菇素的全身性影响开辟了一条新途径，因为之前的大部分研究都集中在其对大脑的影响上。他们认为，即使在小鼠的生命后期进行裸盖菇素干预，也能提高其存活率，这表明其对健康衰老具有临床意义。该研究强调，鉴于美国与其他发达国家相比令人担忧的预期寿命趋势，有必要对老年人进行进一步研究，以探索裸盖菇素在提高寿命和生活质量方面的潜力。"
  },
  {
    "id": "44535078",
    "title": "Show HN: RULER – Easily apply RL to any agent",
    "url": "https://openpipe.ai/blog/ruler",
    "summary": "The \"Show HN: RULER – Easily apply RL to any agent\" post introduces RULER, a tool from OpenPipe designed to simplify the process of applying Reinforcement Learning (RL) to agent development. The key takeaway is that RULER aims to make RL more accessible for building and improving agents by abstracting away the complexities of training and deployment.\n\nInstead of requiring deep expertise in RL or extensive code modifications, RULER allows developers to define their agents and reward functions, and then leverages RL to automatically optimize the agent's behavior. This means you can potentially improve an existing agent's performance simply by defining appropriate rewards, without needing to rewrite the agent's core logic.\n\nThe post likely highlights features that enable:\n\n*   **Easy integration:** Minimal code changes needed to incorporate RULER into existing agent architectures.\n*   **Simplified training:** Automates the RL training process, handling the intricacies of algorithm selection, hyperparameter tuning, and infrastructure management.\n*   **Clear reward definition:** Focuses on allowing developers to easily define appropriate reward functions that guide the agent's learning.\n*   **OpenPipe integration:** Likely leverages the OpenPipe platform for managing experiments, tracking performance, and deploying trained agents.\n\nIn essence, RULER promises to democratize the application of RL in agent development, making it easier for developers of all skill levels to leverage the power of RL to build more intelligent and efficient agents.\n",
    "chinese_title": "展示HN: RULER – 轻松将强化学习应用于任何智能体",
    "chinese_summary": "展示HN：RULER – 轻松将强化学习应用于任何智能体\n\n“展示HN：RULER – 轻松将强化学习应用于任何智能体”一文介绍了OpenPipe的工具RULER，旨在简化将强化学习 (RL) 应用于智能体开发的过程。 关键要点是，RULER旨在通过抽象化训练和部署的复杂性，使强化学习更容易用于构建和改进智能体。\n\nRULER无需深入的强化学习专业知识或大量的代码修改，而是允许开发人员定义他们的智能体和奖励函数，然后利用强化学习自动优化智能体的行为。 这意味着您可以通过简单地定义适当的奖励，而无需重写智能体的核心逻辑，就有可能提高现有智能体的性能。\n\n这篇文章很可能强调了以下功能：\n\n*   **易于集成：** 将RULER集成到现有智能体架构中所需的最小代码更改。\n*   **简化训练：** 自动化强化学习训练过程，处理算法选择、超参数调整和基础设施管理的复杂性。\n*   **清晰的奖励定义：** 侧重于允许开发人员轻松定义适当的奖励函数来指导智能体的学习。\n*   **OpenPipe集成：** 很可能利用 OpenPipe 平台来管理实验、跟踪性能和部署训练有素的智能体。\n\n本质上，RULER承诺普及强化学习在智能体开发中的应用，使所有技能水平的开发人员都能更轻松地利用强化学习的力量来构建更智能、更高效的智能体。"
  },
  {
    "id": "44538669",
    "title": "GeoArrow and GeoParquet, and the Future of Geospatial Data Analysis",
    "url": "https://cloudnativegeo.org/blog/2024/12/interview-with-kyle-barron-on-geoarrow-and-geoparquet-and-the-future-of-geospatial-data-analysis/",
    "summary": "Kyle Barron, a Cloud Engineer at Development Seed, discusses his journey into geospatial data analysis and the significance of GeoParquet and GeoArrow. His interest stemmed from visualizing large geospatial datasets in web browsers, aiming to make geospatial data accessible to a wider audience.\n\nGeoParquet and GeoArrow are highlighted as tools that accelerate the handling of large geospatial datasets. GeoParquet is a file format for storing geospatial vector data, built upon the Parquet format, enabling cloud-native data access, efficient compression, and integration with technologies like GeoArrow. Spatial partitioning in GeoParquet allows fetching specific data rows based on spatial filters, trading off indexing efficiency with index size.\n\nGeoArrow, on the other hand, is a method for representing geospatial vector data in memory, facilitating efficient operations and rapid data sharing between programs. It integrates seamlessly with GeoParquet, improving read/write speeds. The article emphasizes how GeoParquet's cloud-native capabilities can empower users and unlock possibilities beyond traditional geospatial analysis.\n\nLooking ahead, Barron envisions a future where geospatial data is accessed and processed through hybrid systems, utilizing both local and cloud-based resources. He is working on browser-based systems that intelligently decide which data sources to download, aiming for efficient rendering on interactive maps.\n\nBarron emphasizes the importance of motivation and having an end goal in mind for learning new skills. He also highlights the value of attention to detail and going above and beyond, even in tasks where the extra effort might not be immediately apparent. He credits his experience hiking the Pacific Crest Trail and the influence of various individuals in the geospatial community as significant factors in shaping his career.\n",
    "chinese_title": "GeoArrow 和 GeoParquet，以及地理空间数据分析的未来",
    "chinese_summary": "凯尔·巴伦，Development Seed 的云工程师，探讨了他进入地理空间数据分析领域的历程以及 GeoParquet 和 GeoArrow 的重要性。他的兴趣源于在网络浏览器中可视化大型地理空间数据集，旨在使更多人能够访问地理空间数据。\n\nGeoParquet 和 GeoArrow 被强调为加速处理大型地理空间数据集的工具。 GeoParquet 是一种用于存储地理空间矢量数据的文件格式，构建于 Parquet 格式之上，可实现云原生数据访问、高效压缩以及与 GeoArrow 等技术的集成。 GeoParquet 中的空间分区允许基于空间过滤器获取特定的数据行，从而在索引效率和索引大小之间进行权衡。\n\n另一方面，GeoArrow 是一种在内存中表示地理空间矢量数据的方法，有助于实现高效操作和程序之间快速数据共享。它与 GeoParquet 无缝集成，提高了读写速度。文章强调了 GeoParquet 的云原生功能如何增强用户能力并释放超越传统地理空间分析的可能性。\n\n展望未来，巴伦设想了一个通过混合系统访问和处理地理空间数据的未来，利用本地和基于云的资源。他正在开发基于浏览器的系统，该系统可以智能地决定要下载哪些数据源，旨在在交互式地图上实现高效渲染。\n\n巴伦强调了学习新技能时动机的重要性以及明确最终目标的重要性。他还强调了注重细节和超越自我价值的重要性，即使在额外努力可能不会立即显现的任务中也是如此。他将自己徒步太平洋山脊步道的经历以及地理空间社区中各种人士的影响归功于塑造其职业生涯的重要因素。"
  },
  {
    "id": "44508837",
    "title": "Million Times Million",
    "url": "https://susam.net/million-times-million.html",
    "summary": "Susam Pal's \"Million Times Million\" explores the difference between the long and short scales for naming large numbers, focusing on the discrepancy between what he learned as a child and the conventions used in the modern technological world. Growing up, Pal used the long scale, where names like \"billion,\" \"trillion,\" and \"quintillion\" directly corresponded to a million multiplied by itself two, three, and five times respectively. He found this system intuitive and logical.\n\nHowever, upon entering university and engaging with computers and the internet, he discovered the dominance of the short scale. In this system, a million times a million is a trillion, and a million multiplied three times becomes a quintillion, creating a jarring difference from his established understanding.\n\nPal details how he had to adapt to the short scale, finding a way to rationalize it by interpreting the prefix as the number of additional thousands multiplied onto one thousand, expressed as \\(1000 \\times 1000^n\\) or \\(10^{3(n + 1)}\\). He provides a table comparing the long and short scales, highlighting the increasing divergence in magnitude represented by the same names.\n\nDespite now exclusively using the short scale due to its prevalence in technology, finance, and English-speaking contexts, Pal expresses a lingering fondness for the long scale's elegance and its place in his childhood memories.\n",
    "chinese_title": "百万乘百万",
    "chinese_summary": "苏山·帕尔的《百万次的百万》探讨了命名大数时采用的长短尺度之间的差异，重点关注了他童年所学与现代科技世界所用惯例之间的差异。帕尔在成长过程中使用长尺度，其中“十亿”、“万亿”和“百京”等名称分别直接对应于一百万自乘两次、三次和五次。他觉得这个系统直观且合乎逻辑。\n\n然而，进入大学并接触计算机和互联网后，他发现短尺度占据主导地位。在这个系统中，一百万次的一百万是万亿，一百万自乘三次变成百京，这与他已建立的理解产生了不协调的差异。\n\n帕尔详细描述了他如何适应短尺度，通过将前缀解释为附加在1000上的千的个数，表示为\\(1000 \\times 1000^n\\)或\\(10^{3(n + 1)}\\)，从而找到了一种使其合理化的方法。他提供了一个表格，比较了长短尺度，突出了相同名称所代表的量级之间日益扩大的差异。\n\n尽管由于短尺度在技术、金融和英语语境中的流行，现在完全使用短尺度，但帕尔仍然表达了对长尺度的优雅及其在童年记忆中的地位的依恋。"
  },
  {
    "id": "44530767",
    "title": "Bill Atkinson's psychedelic user interface",
    "url": "https://patternproject.substack.com/p/from-the-mac-to-the-mystical-bill",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "比尔·阿特金森的迷幻用户界面",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "44540052",
    "title": "Bad Actors Are Grooming LLMs to Produce Falsehoods",
    "url": "https://americansunlight.substack.com/cp/168074209",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "不良行为者正在训练大型语言模型来产生虚假信息",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "44533982",
    "title": "Pa. House passes 'click-to-cancel' subscription bills",
    "url": "https://www.pennlive.com/news/2025/07/pa-house-passes-click-to-cancel-subscription-bills-as-court-throws-out-federal-rule.html",
    "summary": "The Pennsylvania House has passed two bills aimed at simplifying subscription cancellations, mirroring federal \"click-to-cancel\" rules that were recently struck down by a federal appeals court due to procedural issues. One bill targets \"negative option\" agreements, requiring businesses to notify consumers before subscriptions automatically renew and allow them to opt out using the same method they used to sign up. The second bill mandates that online subscriptions must be cancellable online.\n\nRep. Joe Ciresi, a sponsor of one of the bills, emphasized the importance of state action given the federal government's setback. He said that the legislation stems from constituent experiences of difficult subscription cancellation processes. Rep. Lisa Borowski, sponsor of the other bill, said it aims to ensure businesses provide value rather than relying on consumers forgetting to cancel unwanted subscriptions.\n\nThe bills received bipartisan support but exclude services regulated by the state Public Utility Commission or the Federal Communications Commission, as well as gyms (although this may be amended). If passed by the Senate and signed by Governor Josh Shapiro, Pennsylvania would join states like New York, California, and Virginia in enacting similar consumer protection laws regarding subscription services.\n",
    "chinese_title": "宾州众议院通过“一键取消”订阅法案",
    "chinese_summary": "宾夕法尼亚州众议院通过两项旨在简化订阅取消的法案，与联邦“点击取消”规则类似，但该规则最近因程序问题被联邦上诉法院推翻。其中一项法案针对“否定性选择”协议，要求企业在订阅自动续订前通知消费者，并允许他们使用与注册时相同的方式选择退出。第二项法案规定，在线订阅必须可以在线取消。\n\n众议员乔·西雷西是其中一项法案的发起人，他强调，鉴于联邦政府的挫折，州一级的行动至关重要。他说，该立法源于选民在取消订阅过程中遇到的困难。众议员丽莎·博罗夫斯基是另一项法案的发起人，她说该法案旨在确保企业提供价值，而不是依赖消费者忘记取消不需要的订阅。\n\n这些法案获得了两党支持，但排除受州公共事业委员会或联邦通信委员会监管的服务，以及健身房（尽管这可能会被修改）。如果获得参议院通过并由州长乔什·夏皮罗签署，宾夕法尼亚州将加入纽约、加利福尼亚和弗吉尼亚等州，制定类似的关于订阅服务的消费者保护法。"
  },
  {
    "id": "44529061",
    "title": "Apple vs the Law",
    "url": "https://formularsumo.co.uk/blog/2025/apple-vs-the-law/",
    "summary": "This article details the author's experience attending Apple and Google's Digital Markets Act (DMA) compliance workshops in Brussels. The DMA is an EU law aiming to prevent anti-competitive practices by designated \"gatekeepers,\" requiring them to interoperate with competitors.\n\nThe author found Apple's approach to be combative and disrespectful, focusing on how unfair the law is to them and using language that suggested they were being uniquely targeted. Apple representatives frequently mentioned their interpretation of the law, implied it was too extreme, and promised to \"aggressively defend\" their rights. Google's approach was more toned down, but they echoed concerns about the law's difficulty and potential harm to consumers.\n\nThe author criticizes Apple's history of obstructing regulation and their tendency to delay or challenge investigations. He notes Apple and Google's vast resources compared to the European Commission, implying that they can afford to waste time and pay fines while maintaining monopoly profits.\n\nSpecific concerns raised during the workshops included: Apple's cumbersome tracker system, their insistence on human review for all apps, the lack of a prominent scam reporting button, restrictions on third-party browser engines (requiring re-acquisition of users), age restrictions that force certain users to use Safari, and the inability for non-EU developers to test third-party browser engines on iOS.\n\nThe author also called out Apple's apparent hypocrisy in complaining about competitors being in the room while having undisclosed, Apple-funded attendees present. Finally, the author argues that Apple's georestrictions on third-party browsers and app stores should be lifted to allow worldwide access and facilitate broader adoption of DMA principles. They believe that for this kind of regulation to be successful, the same terms need to apply in all jurisdictions.\n",
    "chinese_title": "苹果大战法律",
    "chinese_summary": "本文详细介绍了作者在布鲁塞尔参加苹果和谷歌数字市场法案（DMA）合规研讨会的经历。 DMA是一项欧盟法律，旨在防止指定“守门人”的反竞争行为，要求他们与竞争对手互操作。\n\n作者认为苹果公司的态度具有对抗性和不尊重性，侧重于该法律对他们的不公平，并使用暗示他们是唯一目标的措辞。 苹果公司的代表经常提到他们对法律的解释，暗示它过于极端，并承诺“积极捍卫”他们的权利。 谷歌的态度较为缓和，但他们也对该法律的难度以及对消费者可能造成的损害表示担忧。\n\n作者批评了苹果公司阻挠监管的历史，以及他们拖延或挑战调查的倾向。 他指出，与欧盟委员会相比，苹果和谷歌拥有巨大的资源，这意味着他们有能力浪费时间并支付罚款，同时维持垄断利润。\n\n研讨会上提出的具体问题包括：苹果公司繁琐的追踪系统、他们坚持对所有应用程序进行人工审核、缺乏显眼的诈骗举报按钮、对第三方浏览器引擎的限制（要求重新获取用户）、迫使某些用户使用Safari的年龄限制，以及非欧盟开发者无法在iOS上测试第三方浏览器引擎。\n\n作者还指出，苹果公司一方面抱怨竞争对手在场，另一方面却有未公开的、由苹果资助的与会者在场，这显然是虚伪的。 最后，作者认为应取消苹果公司对第三方浏览器和应用商店的地域限制，以允许全球访问，并促进DMA原则的更广泛采用。 他们认为，要使此类监管取得成功，相同的条款需要在所有司法管辖区适用。"
  },
  {
    "id": "44528509",
    "title": "The day someone created 184 billion Bitcoin (2020)",
    "url": "https://decrypt.co/39750/184-billion-bitcoin-anonymous-creator",
    "summary": "The provided text is not an article, but rather a snapshot of cryptocurrency prices. It lists a wide variety of cryptocurrencies, including Bitcoin (BTC), Ethereum (ETH), Ripple (XRP), Binance Coin (BNB), Solana (SOL), Dogecoin (DOGE), and many others.\n\nFor each cryptocurrency, the listing shows its current price and the percentage change over a specific timeframe (presumably 24 hours). The prices fluctuate, with some cryptocurrencies showing gains (positive percentage change) and others experiencing losses (negative percentage change).\n\nIt's important to note that the title \"The day someone created 184 billion Bitcoin (2020)\" is completely unrelated to the content. The content is a list of current prices, it doesn't talk about the creation of Bitcoin or any specific event in 2020.\n",
    "chinese_title": "某人创造1840亿枚比特币之日 (2020)",
    "chinese_summary": "提供的文本并非文章，而是一份加密货币价格快照。它列出了各种加密货币，包括比特币（BTC）、以太坊（ETH）、瑞波币（XRP）、币安币（BNB）、索拉纳币（SOL）、狗狗币（DOGE）以及许多其他币种。\n\n对于每种加密货币，列表显示其当前价格以及在特定时间段内（大概是24小时）的百分比变化。价格会有波动，一些加密货币显示上涨（正百分比变化），而另一些则经历下跌（负百分比变化）。\n\n需要注意的是，标题“某人在一天内创造了 1840 亿枚比特币（2020 年）”与内容完全无关。内容是当前价格列表，没有提及比特币的创建或 2020 年的任何特定事件。"
  },
  {
    "id": "44504084",
    "title": "The First Year Out of Prison (2020)",
    "url": "https://www.marieclaire.com/politics/a32630854/prison-release-recidivism/",
    "summary": "This article follows Makeda Davis, a woman recently released from Bedford Hills Correctional Facility after serving seven and a half years for assault, during her challenging first year of reentry into society. The piece highlights the emotional reunion with her mother, Georgia, and daughter, Merhanda, and Makeda's initial shock at the rapid changes in the world.\n\nThe article details the numerous obstacles Makeda faces, including financial struggles, fractured family relationships, lack of stable housing, and difficulty finding employment due to her criminal record and outdated skills. She also grapples with the psychological toll of incarceration, feeling overwhelmed and inadequate.\n\nThe piece explores the systemic issues that hinder successful reentry for ex-inmates, such as limited access to education and job training in prison, the cycle of poverty and incarceration, and the lack of adequate support services. Makeda seeks assistance from the Fortune Society, a nonprofit organization providing resources like job placement, legal aid, and access to public assistance.\n\nDespite these challenges, Makeda remains determined to rebuild her life, regain her career, and be a supportive mother to her daughter. The article portrays her resilience and her struggle to navigate the complex realities of life after prison, emphasizing the need for comprehensive reentry programs and societal support to ensure successful reintegration for formerly incarcerated individuals.\n",
    "chinese_title": "出狱第一年 (2020)",
    "chinese_summary": "本文讲述了梅克达·戴维斯的故事，她最近因袭击罪在贝德福德山惩教所服刑七年半后获释，记录了她重返社会的第一年所面临的挑战。文章重点介绍了她与母亲乔治亚和女儿梅尔汉达重逢时的激动之情，以及梅克达最初对世界快速变化的震惊。\n\n文章详细描述了梅克达面临的诸多障碍，包括经济困难、破碎的家庭关系、缺乏稳定的住房，以及因犯罪记录和过时技能而难以找到工作。她还努力应对监禁带来的心理影响，感到不知所措和力不从心。\n\n文章探讨了阻碍前囚犯成功重返社会的系统性问题，例如监狱内接受教育和职业培训的机会有限、贫困和监禁的恶性循环，以及缺乏足够的支援服务。梅克达向财富协会寻求帮助，该协会是一家非营利组织，提供诸如就业安置、法律援助和获得公共援助等资源。\n\n尽管面临这些挑战，梅克达仍然决心重建她的生活，重拾她的事业，并成为她女儿的支持性母亲。文章描绘了她的韧性以及她在出狱后努力应对复杂现实的挣扎，强调了全面重返社会计划和社会支持对于确保前囚犯成功融入社会的必要性。"
  },
  {
    "id": "44532913",
    "title": "I'm done with social media – Or: why I have a blog now",
    "url": "https://www.carolinecrampton.com/im-done-with-social-media/",
    "summary": "The author details their failed attempt to leverage social media to promote their book, \"A Body Made of Glass,\" in 2024. Driven by anxieties about selling a genre-bending and personal book, they invested heavily in social media strategies, attending training sessions, creating content calendars, and filming videos for Instagram and TikTok.\n\nHowever, they quickly became disillusioned. They found the constant filming and content creation inauthentic and disruptive to their personal life. More importantly, the effort yielded minimal results; algorithms ignored their content, and audience engagement remained low. Despite advice from publishing professionals, their social media presence didn't translate into increased book sales.\n\nThey realized social media success requires a distinct skillset from writing and suspected the industry's push for authors to be active on social media was a way to shift responsibility for book promotion. The author criticizes the \"creator economy\" as a pyramid scheme benefiting large corporations, and questions the value of providing free content to these platforms.\n\nUltimately, the author concludes that social media is not a viable promotional tool for them. They reflect on their long-held ambivalence toward social media and reaffirm their decision to withdraw from these platforms, suggesting that direct engagement with readers (through events and email newsletters) is more effective. The author is starting a blog instead.\n",
    "chinese_title": "我不用社交媒体了——或者：为什么我现在有了博客",
    "chinese_summary": "作者详细描述了其2024年利用社交媒体推广其书籍《玻璃之躯》的失败尝试。由于对销售一本融合多种类型且具个人色彩的书籍感到焦虑，他们大量投资于社交媒体策略，参加培训课程，创建内容日历，并为Instagram和TikTok拍摄视频。\n\n然而，他们很快就感到幻灭。他们发现持续的拍摄和内容创作既不真实，也扰乱了他们的个人生活。更重要的是，这些努力收效甚微；算法忽略了他们的内容，受众参与度仍然很低。尽管出版专业人士提供了建议，但他们的社交媒体影响力并未转化为书籍销量的增长。\n\n他们意识到社交媒体的成功需要与写作截然不同的技能，并怀疑行业推动作者积极参与社交媒体是一种转移图书推广责任的方式。作者批评“创作者经济”是一种有利于大型企业的金字塔骗局，并质疑向这些平台提供免费内容的价值。\n\n最终，作者得出结论，社交媒体对他们而言不是一个可行的推广工具。他们反思了自己长期以来对社交媒体的矛盾心理，并重申了退出这些平台的决定，认为直接与读者互动（通过活动和电子邮件通讯）更为有效。作者正准备开始写博客。"
  },
  {
    "id": "44537093",
    "title": "'123456' password exposed chats for 64M McDonald's job applicants",
    "url": "https://www.bleepingcomputer.com/news/security/123456-password-exposed-chats-for-64-million-mcdonalds-job-applicants/",
    "summary": "Security researchers discovered a vulnerability in McDonald's McHire chatbot job application platform, exposing the chats of over 64 million job applications in the US. The flaw stemmed from the platform's admin panel using weak default credentials (\"123456\":\"123456\") and an Insecure Direct Object Reference (IDOR) in an API endpoint. By manipulating the 'lead_id' parameter in API requests, researchers were able to access sensitive data, including chat transcripts, session tokens, and personal information of job applicants.\n\nThe vulnerability was reported to Paradox.ai (the platform provider) and McDonald's on June 30, 2025. McDonald's confirmed the issue, attributing it to Paradox.ai. The weak credentials were disabled quickly, and Paradox deployed a fix on the same day to address the IDOR flaw. Paradox.ai is reviewing its systems to prevent similar incidents in the future. The exposed data included any chatbot interaction, such as button clicks, regardless of personal information entry. The security issue highlights the risks of weak credentials and IDOR vulnerabilities in web applications and the importance of prompt remediation upon discovery.\n",
    "chinese_title": "“123456”密码泄露6400万麦当劳求职者聊天记录",
    "chinese_summary": "安全研究人员发现麦当劳McHire聊天机器人招聘平台存在漏洞，导致美国超过6400万份求职申请的聊天记录泄露。该漏洞源于平台管理面板使用弱默认凭据（“123456”：“123456”）以及API端点中的不安全直接对象引用（IDOR）。通过操纵API请求中的“lead_id”参数，研究人员能够访问敏感数据，包括聊天记录、会话令牌以及求职者的个人信息。\n\n该漏洞于2025年6月30日报告给Paradox.ai（平台提供商）和麦当劳。麦当劳确认了该问题，并将其归因于Paradox.ai。弱凭据很快被禁用，Paradox当天部署了修复程序以解决IDOR漏洞。Paradox.ai正在审查其系统，以防止将来发生类似事件。泄露的数据包括任何聊天机器人互动，例如按钮点击，无论是否输入个人信息。此安全问题突显了Web应用程序中弱凭据和IDOR漏洞的风险，以及发现后及时补救的重要性。"
  },
  {
    "id": "44526015",
    "title": "Show HN: Pangolin – Open source alternative to Cloudflare Tunnels",
    "url": "https://github.com/fosrl/pangolin",
    "summary": "Pangolin is presented as an open-source, self-hosted alternative to Cloudflare Tunnels, offering a secure way to expose private resources on distributed networks without opening ports. It uses WireGuard tunnels for connectivity, enabling access to remote services behind firewalls. Key features include reverse proxying, automated SSL certificates via Let's Encrypt, load balancing, and support for HTTP/HTTPS and TCP/UDP services.\n\nPangolin boasts a centralized authentication system with support for platform SSO, TOTP, email whitelisting, temporary share links, resource-specific pin codes/passwords, and integration with external identity providers (IdPs) like Authentik and Okta. It offers role-based access control and auto-provisioning of users/roles from IdPs, managed through a user-friendly dashboard with light/dark mode.\n\nDeployment is simplified with Docker Compose and a setup script, allowing for easy integration with existing infrastructure. Users can connect using any WireGuard client or Pangolin's custom client, Newt. The system offers an API with fine-grained access control and Swagger documentation.\n\nPangolin emphasizes a modular design that can be extended with Traefik plugins like CrowdSec. It highlights use cases like bypassing port restrictions in home labs, deploying business services, and managing IoT networks. It's inspired by Cloudflare Tunnels and Authelia.\n\nThe project is under heavy development with a roadmap subject to change and dual-licensed under AGPL-3 and a Fossorial Commercial license. Contributions and feedback are encouraged via the GitHub repository.\n",
    "chinese_title": "Show HN: Pangolin - Cloudflare Tunnels 的开源替代方案",
    "chinese_summary": "Pangolin：一款开源自托管的Cloudflare Tunnels替代方案，提供一种安全的方式，无需开放端口即可在分布式网络上暴露私有资源。它使用WireGuard隧道进行连接，从而能够访问防火墙后的远程服务。主要功能包括反向代理、通过Let's Encrypt自动生成SSL证书、负载均衡以及对HTTP/HTTPS和TCP/UDP服务的支持。\n\nPangolin拥有一个集中式认证系统，支持平台SSO、TOTP、电子邮件白名单、临时共享链接、资源专用PIN码/密码以及与Authentik和Okta等外部身份提供商 (IdP) 的集成。它提供基于角色的访问控制和来自IdP的用户/角色自动配置，并通过具有亮/暗模式的用户友好型仪表板进行管理。\n\n使用Docker Compose和一个设置脚本简化了部署，从而可以轻松地与现有基础设施集成。用户可以使用任何WireGuard客户端或Pangolin的自定义客户端Newt进行连接。该系统提供一个具有细粒度访问控制和Swagger文档的API。\n\nPangolin强调模块化设计，可以通过CrowdSec等Traefik插件进行扩展。它突出了诸如绕过家庭实验室中的端口限制、部署商业服务和管理物联网网络等用例。它的灵感来自Cloudflare Tunnels和Authelia。\n\n该项目正在大力开发中，路线图可能会发生变化，并采用AGPL-3和Fossorial商业许可双重许可。鼓励通过GitHub存储库进行贡献和反馈。"
  },
  {
    "id": "44533843",
    "title": "In a First, Solar Was Europe's Biggest Source of Power Last Month",
    "url": "https://e360.yale.edu/digest/solar-biggest-power-source-europe-june-2025",
    "summary": "For the first time, solar energy was the largest source of electricity in the European Union in June, supplying a record 22% of the bloc's power. At least 13 countries saw solar output hit new monthly highs. The rise of solar helped Europe manage a severe heat wave, as solar power was abundant when air conditioning demand was highest, easing strain on the grid.\n\nNuclear was the second-largest electricity source, followed by wind, natural gas, and hydropower. Coal generation reached a new monthly low of just 6% of electricity. Fifteen EU countries are now coal-free.\n\nAnalysts highlighted the importance of solar energy in mitigating the effects of the heat wave, which was exacerbated by climate change. A study found that the burning of fossil fuels tripled the heat-related death toll during the heatwave.\n",
    "chinese_title": "上月太阳能首次成为欧洲最大电力来源",
    "chinese_summary": "六月份，太阳能首次成为欧盟最大的电力来源，提供了创纪录的22%的电力。至少有13个国家/地区的太阳能发电量创下月度新高。太阳能的崛起帮助欧洲应对了严重的酷暑，因为在空调需求最高时，太阳能供应充足，缓解了电网的压力。\n\n核能是第二大电力来源，其次是风能、天然气和水力发电。煤炭发电量降至月度新低，仅占发电量的6%。目前已有15个欧盟国家不使用煤炭。\n\n分析师强调了太阳能在缓解气候变化加剧的酷暑影响方面的重要性。一项研究发现，化石燃料的燃烧使与酷暑相关的死亡人数增加了两倍。"
  },
  {
    "id": "44495428",
    "title": "Bootstrapping a side project into a profitable seven-figure business",
    "url": "https://projectionlab.com/blog/we-reached-1m-arr-with-zero-funding",
    "summary": "Kyle Nolan bootstrapped ProjectionLab, a financial planning tool, from a side project to a $1 million ARR business in four years. Inspired by the financial independence movement, he initially built the tool for his own needs. Key milestones included early traction on Hacker News, recognition from Mr. Money Mustache, and eventually quitting his corporate job to focus on ProjectionLab full-time.\n\nThe journey wasn't a smooth upward climb; Nolan describes it as an emotional rollercoaster with highs, lows, and moments of self-doubt. He emphasizes the importance of persistence (\"not giving up\") as a superpower and highlights the value of working with people you like.\n\nInitially a solo developer, Nolan realized the need for a growth partner. He brought on Jon Kuipers, who had proven his value over time, to handle marketing and operations. They also added contractors from the ProjectionLab user community to handle customer success, prioritizing a strong user experience over cost-cutting.\n\nNolan credits consistency as a key factor in their success, urging aspiring entrepreneurs to \"keep showing up\" even when growth is slow or discouraging. He concludes by emphasizing the importance of building a good product, staying lean and customer-focused, and building sustainably rather than chasing trends. He and the team are now focused on doubling down on these values to continue ProjectionLab's growth.\n",
    "chinese_title": "Bootstrapping a side project into a profitable seven-figure business",
    "chinese_summary": "凯尔·诺兰在四年内将财务规划工具ProjectionLab从一个副业发展成为年收入100万美元的企业。受到财务自由运动的启发，他最初是为自己的需求构建了这个工具。关键里程碑包括在Hacker News上获得早期关注，获得Mr. Money Mustache的认可，并最终辞去公司工作全身心投入ProjectionLab。\n\n这段旅程并非一帆风顺；诺兰将其描述为一场充满高潮、低谷和自我怀疑的情感过山车。他强调坚持不懈(\"不放弃\")是一种超能力，并强调了与你喜欢的人一起工作的价值。\n\n最初是一名独立开发者，诺兰意识到需要一个增长伙伴。他引进了Jon Kuipers来负责营销和运营，后者已经证明了自己的价值。他们还从ProjectionLab用户社区中增加了承包商来处理客户成功，优先考虑强大的用户体验而非削减成本。\n\n诺兰认为一致性是他们成功的关键因素，他敦促有抱负的创业者“坚持下去”，即使增长缓慢或令人沮丧。他最后强调了构建优质产品、保持精简和以客户为中心，以及构建可持续性而非追逐潮流的重要性。他和团队现在专注于加倍实践这些价值观，以继续ProjectionLab的增长。"
  },
  {
    "id": "44542204",
    "title": "Dyson Sphere Program – Dev Log – The New Multithreading Framework",
    "url": "https://store.steampowered.com/news/app/1366540/view/543361383085900510",
    "summary": "This \"Dyson Sphere Program – Dev Log – The New Multithreading Framework\" isn't really an article, but rather a partial listing of interface elements within the Steam platform. It's a context menu offering language options. Therefore, there isn't a main point or key information about a \"new multithreading framework\" to summarize. The title is misleading in the context of the presented content. The content lists a variety of languages available for the Steam client and indicates standard navigation elements like store, home, news, community, and account management links.\n",
    "chinese_title": "戴森球计划 – 开发者日志 – 全新多线程框架",
    "chinese_summary": "This \"Dyson Sphere Program – Dev Log – The New Multithreading Framework\" isn't really an article, but rather a partial listing of interface elements within the Steam platform. It's a context menu offering language options. Therefore, there isn't a main point or key information about a \"new multithreading framework\" to summarize. The title is misleading in the context of the presented content. The content lists a variety of languages available for the Steam client and indicates standard navigation elements like store, home, news, community, and account management links.\n"
  },
  {
    "id": "44537525",
    "title": "The Biggest-Ever Digital Camera Is This Cosmologist's Magnum Opus",
    "url": "https://www.quantamagazine.org/the-biggest-ever-digital-camera-is-this-cosmologists-magnum-opus-20250711/",
    "summary": "生成摘要时出错",
    "chinese_title": "有史以来最大的数码相机是这位宇宙学家的杰作",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44542604",
    "title": "\"high level\" languages are easier to optimize",
    "url": "https://jyn.dev/high-level-languages-are-easier-to-optimize/",
    "summary": "生成摘要时出错",
    "chinese_title": "\"high level\" languages are easier to optimize",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44531707",
    "title": "Overtourism in Japan, and how it hurts small businesses",
    "url": "https://craigmod.com/ridgeline/210/",
    "summary": "生成摘要时出错",
    "chinese_title": "Overtourism in Japan, and how it hurts small businesses",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44539204",
    "title": "America's largest power grid is struggling to meet demand from AI",
    "url": "https://www.reuters.com/sustainability/boards-policy-regulation/americas-largest-power-grid-is-struggling-meet-demand-ai-2025-07-09/",
    "summary": "生成摘要时出错",
    "chinese_title": "America's largest power grid is struggling to meet demand from AI",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44514550",
    "title": "The death of partying in the USA",
    "url": "https://www.derekthompson.org/p/the-death-of-partying-in-the-usaand",
    "summary": "生成摘要时出错",
    "chinese_title": "The death of partying in the USA",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44538422",
    "title": "AMD's Magny Cours and HyperTransport Interconnect",
    "url": "https://chipsandcheese.com/p/amds-magny-cours-and-hypertransport",
    "summary": "生成摘要时出错",
    "chinese_title": "AMD's Magny Cours and HyperTransport Interconnect",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44539294",
    "title": "Before Tragedy, Texas Repeatedly Rejected Pleas for Flood Alarm Funding",
    "url": "https://www.nytimes.com/2025/07/10/us/politics/texas-flood-alarm-system.html",
    "summary": "生成摘要时出错",
    "chinese_title": "Before Tragedy, Texas Repeatedly Rejected Pleas for Flood Alarm Funding",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44527947",
    "title": "LLM Inference Handbook",
    "url": "https://bentoml.com/llm/",
    "summary": "生成摘要时出错",
    "chinese_title": "LLM Inference Handbook",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44490308",
    "title": "The ChompSaw: A benchtop power tool that's safe for kids to use",
    "url": "https://www.core77.com/posts/137602/The-ChompSaw-A-Benchtop-Power-Tool-Thats-Safe-for-Kids-to-Use",
    "summary": "生成摘要时出错",
    "chinese_title": "The ChompSaw: A benchtop power tool that's safe for kids to use",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44504676",
    "title": "Xenharmlib: A music theory library that supports non-western harmonic systems",
    "url": "https://xenharmlib.readthedocs.io/en/latest/",
    "summary": "生成摘要时出错",
    "chinese_title": "Xenharmlib: A music theory library that supports non-western harmonic systems",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44530922",
    "title": "Recovering from AI addiction",
    "url": "https://internetaddictsanonymous.org/internet-and-technology-addiction/signs-of-an-addiction-to-ai/",
    "summary": "生成摘要时出错",
    "chinese_title": "Recovering from AI addiction",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44507078",
    "title": "Series of posts on HTTP status codes (2018)",
    "url": "https://evertpot.com/http/",
    "summary": "生成摘要时出错",
    "chinese_title": "Series of posts on HTTP status codes (2018)",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44527190",
    "title": "Grok: Searching X for \"From:Elonmusk (Israel or Palestine or Hamas or Gaza)\"",
    "url": "https://simonwillison.net/2025/Jul/11/grok-musk/",
    "summary": "生成摘要时出错",
    "chinese_title": "Grok: Searching X for \"From:Elonmusk (Israel or Palestine or Hamas or Gaza)\"",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44508601",
    "title": "Btrfs Allocator Hints",
    "url": "https://lwn.net/ml/all/cover.1747070147.git.anand.jain@oracle.com/",
    "summary": "生成摘要时出错",
    "chinese_title": "Btrfs Allocator Hints",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44539347",
    "title": "Threads is nearing X's daily app users, new data shows",
    "url": "https://techcrunch.com/2025/07/07/threads-is-nearing-xs-daily-app-users-new-data-shows/",
    "summary": "生成摘要时出错",
    "chinese_title": "Threads is nearing X's daily app users, new data shows",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44523722",
    "title": "Orwell Diaries 1938-1942",
    "url": "https://orwelldiaries.wordpress.com/page/2/",
    "summary": "生成摘要时出错",
    "chinese_title": "Orwell Diaries 1938-1942",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44522772",
    "title": "Measuring the impact of AI on experienced open-source developer productivity",
    "url": "https://metr.org/blog/2025-07-10-early-2025-ai-experienced-os-dev-study/",
    "summary": "生成摘要时出错",
    "chinese_title": "Measuring the impact of AI on experienced open-source developer productivity",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44513427",
    "title": "The Ghost of Muriel Spark",
    "url": "https://www.newstatesman.com/culture/books/2025/06/the-ghost-of-muriel-spark",
    "summary": "生成摘要时出错",
    "chinese_title": "The Ghost of Muriel Spark",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44530581",
    "title": "FP8 is ~100 tflops faster when the kernel name has \"cutlass\" in it",
    "url": "https://twitter.com/cis_female/status/1943069934332055912",
    "summary": "生成摘要时出错",
    "chinese_title": "FP8 is ~100 tflops faster when the kernel name has \"cutlass\" in it",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44536248",
    "title": "I'm more proud of these 128 kilobytes than anything I've built since",
    "url": "https://medium.com/@mikehall314/im-more-proud-of-these-128-kilobytes-than-anything-i-ve-built-since-53706cfbdc18",
    "summary": "生成摘要时出错",
    "chinese_title": "I'm more proud of these 128 kilobytes than anything I've built since",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44531697",
    "title": "AI agent benchmarks are broken",
    "url": "https://ddkang.substack.com/p/ai-agent-benchmarks-are-broken",
    "summary": "生成摘要时出错",
    "chinese_title": "AI agent benchmarks are broken",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44521457",
    "title": "Underwater turbine spinning for 6 years off Scotland's coast is a breakthrough",
    "url": "https://apnews.com/article/tidal-energy-turbine-marine-meygen-scotland-ffff3a7082205b33b612a1417e1ec6d6",
    "summary": "生成摘要时出错",
    "chinese_title": "Underwater turbine spinning for 6 years off Scotland's coast is a breakthrough",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44524430",
    "title": "eBPF: Connecting with Container Runtimes",
    "url": "https://h0x0er.github.io/blog/2025/06/29/ebpf-connecting-with-container-runtimes/",
    "summary": "生成摘要时出错",
    "chinese_title": "eBPF: Connecting with Container Runtimes",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44506012",
    "title": "Infinite Mac Construction Set",
    "url": "https://blog.persistent.info/2025/07/infinite-mac-embedding.html",
    "summary": "生成摘要时出错",
    "chinese_title": "Infinite Mac Construction Set",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44541620",
    "title": "The price of software freedom is eternal politics",
    "url": "https://www.theregister.com/2025/07/12/the_price_of_software_freedom/",
    "summary": "生成摘要时出错",
    "chinese_title": "The price of software freedom is eternal politics",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44499642",
    "title": "DiffuCoder: Understanding and Improving Masked Diffusion Models for Code Gen",
    "url": "https://arxiv.org/abs/2506.20639",
    "summary": "生成摘要时出错",
    "chinese_title": "DiffuCoder: Understanding and Improving Masked Diffusion Models for Code Gen",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44543162",
    "title": "Epstein's Unredacted Black Book",
    "url": "https://archive.org/details/jeffrey-epstein-39s-little-black-book-unredacted",
    "summary": "生成摘要时出错",
    "chinese_title": "Epstein's Unredacted Black Book",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44529008",
    "title": "Gut microbes could protect us from toxic 'forever chemicals'",
    "url": "https://www.cam.ac.uk/research/news/gut-microbes-could-protect-us-from-toxic-forever-chemicals",
    "summary": "生成摘要时出错",
    "chinese_title": "Gut microbes could protect us from toxic 'forever chemicals'",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44490510",
    "title": "Postgres LISTEN/NOTIFY does not scale",
    "url": "https://www.recall.ai/blog/postgres-listen-notify-does-not-scale",
    "summary": "生成摘要时出错",
    "chinese_title": "Postgres LISTEN/NOTIFY does not scale",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44506188",
    "title": "Operational Apple-1 Computer for sale [video]",
    "url": "https://www.youtube.com/watch?v=XdBKuBhdZwg",
    "summary": "生成摘要时出错",
    "chinese_title": "Operational Apple-1 Computer for sale [video]",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44492014",
    "title": "Batch Mode in the Gemini API: Process More for Less",
    "url": "https://developers.googleblog.com/en/scale-your-ai-workloads-batch-mode-gemini-api/",
    "summary": "生成摘要时出错",
    "chinese_title": "Batch Mode in the Gemini API: Process More for Less",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44538415",
    "title": "Diving into Plasma Bigscreen",
    "url": "https://espi.dev/posts/2025/07/plasma-bigscreen/",
    "summary": "生成摘要时出错",
    "chinese_title": "Diving into Plasma Bigscreen",
    "chinese_summary": "生成摘要时出错"
  }
]