[
  {
    "id": "45183029",
    "title": "We All Dodged a Bullet",
    "url": "https://xeiaso.net/notes/2025/we-dodged-a-bullet/",
    "summary": "The content displays a message indicating a bot detection process. It states, \"正在确认你是不是机器人！ 加载中...请稍等，我们需要在继续之前检查您的连接安全性,\" which translates to \"Verifying that you are not a robot! Loading... Please wait, we need to check your connection security before continuing.\"\n\nTherefore, the article is currently unavailable for reading, as it's stuck on a security check to determine if the user is a human and not a bot. There's no actual content to summarize beyond this bot detection message. We can only infer that the article, titled \"We All Dodged a Bullet,\" likely deals with a near-miss or averted disaster, but without bypassing the security check, the subject matter remains unknown.\n",
    "chinese_title": "我们都躲过了一劫",
    "chinese_summary": "内容显示一条机器人检测消息，提示“正在确认你是不是机器人！加载中...请稍等，我们需要在继续之前检查您的连接安全性”。因此，由于文章停留在验证用户是否为人类而非机器人的安全检查上，目前无法阅读。除了这条机器人检测消息之外，没有实际内容可以总结。我们只能推断标题为“我们都躲过了一劫”的文章可能与一次险情或避免的灾难有关，但在绕过安全检查之前，主题仍然未知。"
  },
  {
    "id": "45182381",
    "title": "Claude can now create and edit files",
    "url": "https://www.anthropic.com/news/create-files",
    "summary": "Anthropic's Claude AI can now create and edit files like Excel spreadsheets, documents, PowerPoint presentations, and PDFs directly within the platform, enhancing its capabilities beyond simple text responses. Currently available in preview for Max, Team, and Enterprise plan users (with Pro users gaining access soon), this feature allows users to upload data, describe desired outputs, and receive ready-to-use files.\n\nKey functionalities include turning raw data into insightful reports with charts and statistical analysis, building customized spreadsheets with formulas and multiple sheets, and cross-formatting files, like converting PDFs to PowerPoint or meeting notes to formatted documents. Claude leverages a private computer environment to write code and run programs, effectively handling the technical implementation of complex tasks.\n\nTo use file creation, users need to enable \"Upgraded file creation and analysis\" in settings. Anthropic advises starting with simpler tasks before progressing to complex projects like financial models. A warning is issued about potential data security risks due to Claude's internet access during file creation and analysis, and users are advised to monitor chats closely when using the feature.\n",
    "chinese_title": "Claude 现在可以创建和编辑文件了",
    "chinese_summary": "Anthropic的Claude AI现可在平台内直接创建和编辑Excel表格、文档、PowerPoint演示文稿和PDF等文件，使其功能超越简单的文本回复。此功能目前在Max、Team和企业版计划用户中提供预览（Pro用户即将获得访问权限），允许用户上传数据，描述所需输出，并接收即用文件。\n\n主要功能包括将原始数据转换为带有图表和统计分析的深刻报告、构建带有公式和多张工作表的定制电子表格，以及交叉格式化文件，例如将PDF转换为PowerPoint或将会议记录转换为格式化文档。Claude利用私有计算环境编写代码和运行程序，从而有效地处理复杂任务的技术实现。\n\n要使用文件创建功能，用户需要在设置中启用“升级的文件创建和分析”。Anthropic建议从较简单的任务开始，然后再进行财务模型等复杂项目。由于Claude在文件创建和分析期间可以访问互联网，因此发布了关于潜在数据安全风险的警告，并建议用户在使用该功能时密切监控聊天。"
  },
  {
    "id": "45182372",
    "title": "New Mexico is first state in US to offer universal child care",
    "url": "https://www.governor.state.nm.us/2025/09/08/new-mexico-is-first-state-in-nation-to-offer-universal-child-care/",
    "summary": "New Mexico is set to become the first state in the US to offer universal, no-cost child care starting November 1, 2025. Governor Michelle Lujan Grisham announced the initiative, which removes income eligibility requirements for the state's child care assistance program and continues the waiver of family copayments. This move aims to provide financial relief to families, support the economy, and ensure all children have the opportunity to thrive.\n\nThe universal child care program builds upon previous efforts to expand access to no-cost child care for families with incomes at or below 400% of the federal poverty level. It is estimated to save families an average of $12,000 per child annually.\n\nIn addition to providing financial assistance to families, New Mexico is also focused on expanding the supply of child care across the state. This includes establishing a $12.7 million low-interest loan fund for facility construction and renovation, targeting growth towards infant and toddler care, partnering with employers and school districts, and launching a recruitment campaign for licensed providers. Reimbursement rates for providers will increase, and programs committing to a minimum wage of $18 per hour for entry-level staff will receive an incentive rate. The state estimates needing an additional 5,000 early childhood professionals to fully support the universal system.\n",
    "chinese_title": "新墨西哥州成为美国首个提供普及儿童保育的州",
    "chinese_summary": "新墨西哥州将于2025年11月1日成为美国首个提供全民免费托儿服务的州。州长米歇尔·卢扬·格里沙姆宣布了这项举措，取消了该州托儿援助计划的收入资格要求，并继续免除家庭共同支付费用。此举旨在为家庭提供经济救济，支持经济发展，并确保所有儿童都有机会茁壮成长。\n\n该全民托儿计划建立在先前为收入等于或低于联邦贫困线400%的家庭扩大免费托儿服务的基础上。据估计，每年每个孩子可为家庭平均节省12000美元。\n\n除了向家庭提供经济援助外，新墨西哥州还致力于扩大全州的托儿服务供应。这包括建立一个1270万美元的低息贷款基金，用于设施建设和翻新，重点发展婴幼儿保育，与雇主和学区合作，以及启动针对持照服务提供者的招聘活动。服务提供者的报销率将提高，承诺为入门级员工提供每小时最低工资18美元的项目将获得激励性费率。该州估计需要额外5000名幼儿教育专业人士来全面支持该全民系统。"
  },
  {
    "id": "45183589",
    "title": "How An Attacker's Blunder Gave Us a Rare Look Inside Their Day-to-Day Operations",
    "url": "https://www.huntress.com/blog/rare-look-inside-attacker-operation",
    "summary": "Huntress inadvertently gained a rare inside look into a threat actor's operations when the attacker, drawn in by an advertising campaign, installed the Huntress agent on their machine. This blunder provided a wealth of information about the attacker's methodologies, tool usage, and targets.\n\nThe attacker's activities revealed a concerning trend: the integration of AI into their workflow for increased efficiency. They used platforms like Make.com to automate tasks, Telegram Bot APIs, and other AI tools for data generation and writing, accelerating their malicious processes.\n\nThe attacker's activities also showed an interest in identifying and exploiting vulnerabilities, seeking running instances of Evilginx and deploying tools like GraphSpy, Bloodhound, and TeamFiltration. They also explored residential proxy services like LunaProxy and Nstbrowser to mask their activities and evade detection.\n\nReconnaissance was a key part of the attacker's approach, with extensive research conducted on companies across various sectors and their associated ecosystems. They employed tools like BuiltWith, ReadyContacts, and InfoClutch to gather information on customer bases, technology stacks, and market share. The attacker used Google Translate extensively, suggesting a focus on phishing campaigns.\n\nThe article highlights the attacker's interest in the dark web market STYX for stolen credentials and other illicit services. Ultimately, the incident provided Huntress with invaluable intelligence, enabling them to enhance their detection capabilities, proactively identify compromised identities, and respond more effectively to future attacks.\n",
    "chinese_title": "攻击者的失误让我们罕见地窥探到他们的日常运作",
    "chinese_summary": "一名猎人团队无意中获得了深入了解威胁行动者行动的罕见机会，因为该攻击者被一则广告活动吸引，在其机器上安装了猎人代理。这个失误提供了关于攻击者的方法、工具使用和目标的丰富信息。\n\n攻击者的活动揭示了一个令人担忧的趋势：人工智能融入其工作流程以提高效率。他们使用诸如 Make.com 之类的平台来自动化任务，使用 Telegram Bot API 和其他 AI 工具来进行数据生成和编写，从而加速其恶意进程。\n\n攻击者的活动还显示出对识别和利用漏洞的兴趣，寻找 Evilginx 的运行实例并部署诸如 GraphSpy、Bloodhound 和 TeamFiltration 之类的工具。他们还探索了诸如 LunaProxy 和 Nstbrowser 之类的住宅代理服务，以掩盖他们的活动并逃避检测。\n\n侦察是攻击者方法的一个关键部分，对各个行业的公司及其相关生态系统进行了广泛的研究。他们使用诸如 BuiltWith、ReadyContacts 和 InfoClutch 之类的工具来收集有关客户群、技术堆栈和市场份额的信息。攻击者广泛使用 Google 翻译，表明他们专注于网络钓鱼活动。\n\n这篇文章强调了攻击者对暗网市场 STYX 中被盗凭证和其他非法服务的兴趣。最终，该事件为猎人团队提供了宝贵的情报，使其能够增强其检测能力，主动识别受损身份，并更有效地应对未来的攻击。"
  },
  {
    "id": "45178041",
    "title": "Mistral AI raises 1.7B€, enters strategic partnership with ASML",
    "url": "https://mistral.ai/news/mistral-ai-raises-1-7-b-to-accelerate-technological-progress-with-ai",
    "summary": "Mistral AI has secured a 1.7B€ Series C funding round, bringing its post-money valuation to 11.7B€. The funding will be used to advance AI research and develop solutions for strategic industries. The round is led by ASML Holding NV, a leading semiconductor equipment manufacturer, marking a strategic partnership between the two companies.\n\nASML's CEO, Christophe Fouquet, stated the collaboration aims to benefit ASML customers through AI-powered products and solutions, with potential for joint research. Existing investors including DST Global, Andreessen Horowitz, Bpifrance, General Catalyst, Index Ventures, Lightspeed and NVIDIA also participated.\n\nMistral AI aims to develop custom, decentralized AI solutions to tackle complex engineering and industrial challenges, providing a competitive edge to enterprises, public sectors, and industries. Mistral AI's CEO, Arthur Mensch, emphasized the ambition to help ASML and its partners solve engineering challenges and advance the semiconductor and AI value chain. He also confirmed the company's independence with this funding.\n",
    "chinese_title": "Mistral AI 融资 17 亿欧元，与阿斯麦达成战略合作",
    "chinese_summary": "Mistral AI 完成17亿欧元C轮融资，估值达117亿欧元。融资将用于推进人工智能研究并为战略行业开发解决方案。本轮融资由领先的半导体设备制造商阿斯麦（ASML Holding NV）领投，标志着两家公司建立了战略合作伙伴关系。\n\n阿斯麦首席执行官Christophe Fouquet表示，此次合作旨在通过人工智能驱动的产品和解决方案使阿斯麦客户受益，并有可能进行联合研究。现有投资者包括DST Global、Andreessen Horowitz、Bpifrance、General Catalyst、Index Ventures、Lightspeed 和 NVIDIA 也参与了本轮融资。\n\nMistral AI 旨在开发定制化的、去中心化的人工智能解决方案，以应对复杂的工程和工业挑战，从而为企业、公共部门和行业提供竞争优势。Mistral AI 首席执行官 Arthur Mensch 强调，公司致力于帮助阿斯麦及其合作伙伴解决工程挑战，并推进半导体和人工智能价值链。他还确认了公司在此次融资中的独立性。"
  },
  {
    "id": "45183039",
    "title": "X open sourced their latest algorithm",
    "url": "https://github.com/twitter/the-algorithm",
    "summary": "X (formerly Twitter) has open-sourced its recommendation algorithm, a system of services and jobs that power content feeds across the platform, including the \"For You\" timeline, search, explore, and notifications. The release includes code, data, models, and software frameworks used in the recommendation process.\n\nKey components include:\n\n*   **Data:** Services for handling post data (`tweetypie`), user actions (`unified-user-actions`), and user signals (`user-signal-service`).\n*   **Models:** Embedding models (`SimClusters`, `TwHIN`), trust and safety models, real-graph model for user interaction prediction, and a reputation algorithm (`tweepcred`).\n*   **Software Frameworks:** High-performance model serving in Rust (`navi`), a framework for building content feeds (`product-mixer`), and a framework for generating aggregate features (`timelines-aggregation-framework`).\n\nThe open-sourced components specifically support the \"For You\" Timeline and Recommended Notifications. The \"For You\" Timeline utilizes candidate sources like search index (`search-index`), a tweet mixer (`tweet-mixer`), User-Tweet-Entity-Graph (`UTEG`), and follow recommendations (`FRS`). Ranking is performed by light and heavy rankers. Post mixing and filtering is achieved through `home-mixer` and `visibility-filters`. Recommended Notifications leverage a dedicated service (`pushservice`) and corresponding light and heavy rankers.\n\nX encourages community contributions through GitHub issues and pull requests, but directs security concerns to their HackerOne bug bounty program. The company aims to leverage the community's expertise to improve the recommendation algorithm.\n",
    "chinese_title": "X 开源了他们的最新算法。",
    "chinese_summary": "X（原推特）已开源其推荐算法，该系统由服务和任务组成，为整个平台的内容推送提供支持，包括“为你推荐”时间线、搜索、发现和通知。此次发布包括推荐过程中使用的代码、数据、模型和软件框架。\n\n主要组成部分包括：\n\n*   **数据：** 用于处理帖子数据（`tweetypie`）、用户行为（`unified-user-actions`）和用户信号（`user-signal-service`）的服务。\n*   **模型：** 嵌入模型（`SimClusters`、`TwHIN`）、信任和安全模型、用于用户互动预测的真实图模型，以及信誉算法（`tweepcred`）。\n*   **软件框架：** Rust中的高性能模型服务（`navi`）、用于构建内容推送的框架（`product-mixer`），以及用于生成聚合特征的框架（`timelines-aggregation-framework`）。\n\n开源组件专门支持“为你推荐”时间线和推荐通知。“为你推荐”时间线利用候选来源，如搜索索引（`search-index`）、推文混合器（`tweet-mixer`）、用户-推文-实体图（`UTEG`）和关注推荐（`FRS`）。排序由轻量级和重量级排序器执行。帖子混合和过滤通过`home-mixer`和`visibility-filters`实现。推荐通知利用专用服务（`pushservice`）和相应的轻量级和重量级排序器。\n\nX 鼓励通过 GitHub 问题和拉取请求进行社区贡献，但会将安全问题导向其 HackerOne 漏洞奖励计划。该公司旨在利用社区的专业知识来改进推荐算法。"
  },
  {
    "id": "45184921",
    "title": "Weave (YC W25) is hiring a founding AI engineer",
    "url": "https://www.ycombinator.com/companies/weave-3/jobs/SqFnIFE-founding-ai-engineer",
    "summary": "Weave (YC W25), a well-funded and rapidly growing startup building software to improve engineering team productivity, is seeking a Founding AI Engineer. The role involves building AI to understand and improve software engineering work, developing processes and standards, and delivering intelligent features that significantly enhance customer productivity.\n\nThe ideal candidate is a \"formidable engineer\" driven to accomplish goals, pragmatic, committed to growth, empathetic, passionate about improving software engineering, an excellent communicator, and gritty. While specific skills aren't strictly required, experience with React, TypeScript, Go, or Python (the tech stack), prior work in engineering productivity, and design sensibilities are \"nice to haves\".\n\nThe position offers a $140K - $200K salary with 0.20% - 1.00% equity and is located in Oakland or San Francisco, CA. The engineer will work directly with the CTO (Andrew Churchill, ex-Causal founding engineer) and the CEO (Adam Cohen, ex-sales executive at high-growth startups). Weave emphasizes providing support and growth opportunities. The job posting highlights the importance of fitting Weave's mission and values.\n",
    "chinese_title": "Weave (YC W25) 正在招聘创始 AI 工程师",
    "chinese_summary": "Weave (YC W25) 是一家资金雄厚、快速发展的初创公司，致力于构建软件以提高工程团队的生产力，现诚聘创始 AI 工程师。该职位涉及构建 AI 以理解和改进软件工程工作，制定流程和标准，并交付能够显著提高客户生产力的智能功能。\n\n理想的候选人是一位“强大的工程师”，以完成目标为动力，务实，致力于成长，富有同理心，热衷于改进软件工程，善于沟通，并且坚韧不拔。虽然没有严格的技能要求，但具备React、TypeScript、Go或Python（技术栈）的经验，先前在工程生产力方面的工作经验，以及设计意识都是“加分项”。\n\n该职位提供 14 万美元 - 20 万美元的年薪以及 0.20% - 1.00% 的股权，工作地点位于加利福尼亚州奥克兰或旧金山。该工程师将直接与首席技术官（Andrew Churchill，前 Causal 创始工程师）和首席执行官（Adam Cohen，前高增长初创公司销售主管）合作。 Weave 强调提供支持和发展机会。 该招聘信息强调了适应 Weave 使命和价值观的重要性。"
  },
  {
    "id": "45184368",
    "title": "ICE Is Using Fake Cell Towers to Spy on People's Phones",
    "url": "https://www.forbes.com/sites/the-wiretap/2025/09/09/how-ice-is-using-fake-cell-towers-to-spy-on-peoples-phones/",
    "summary": "This Forbes article from September 9, 2025, reports that Immigration and Customs Enforcement (ICE) continues to use controversial cell-site simulators, also known as Stingrays, to track undocumented immigrants. These devices mimic cell towers, tricking phones into connecting and revealing their location, raising privacy concerns for anyone in the vicinity.\n\nThe article highlights a recent case where ICE sought a warrant to use a Stingray to locate a fugitive in Utah, wanted for deportation and suspected of past crimes. Despite criticism during the Trump administration, ICE is still employing this technology.\n\nEvidence includes reports of \"mobile network anomalies\" near anti-ICE raid protests in Washington state and contract records showing ICE purchased almost $1 million worth of \"cell site simulator vehicles\" in May 2025, as well as an active $4.4 million contract with Harris Corporation for location tracking equipment, both initiated under the Biden administration.\n\nThe newsletter also features a story about San Mateo County's $12 million AI surveillance system, Sherlock, which is supposedly improving police work, but hasn't done so so far. Other news includes ICE's new $10 million contract with Clearview AI for facial recognition and a lawsuit alleging privacy issues within WhatsApp. Signal launched encrypted backups, while Amnesty International reported on Pakistan's extensive domestic surveillance.\n",
    "chinese_title": "ICE正使用假基站监视民众手机",
    "chinese_summary": "2025年9月9日福布斯的一篇文章报道称，美国移民及海关执法局（ICE）继续使用备受争议的手机基站模拟器，又称“魟鱼”（Stingrays），来追踪非法移民。这些设备模仿手机信号塔，诱骗手机连接并暴露其位置，引发了对附近所有人员的隐私担忧。\n\n文章重点介绍了一起最近的案件，ICE寻求搜查令，以便在犹他州使用“魟鱼”定位一名逃犯，该逃犯因面临驱逐出境，并涉嫌过去的犯罪行为而被通缉。尽管在特朗普政府期间受到批评，ICE仍在采用这项技术。\n\n证据包括华盛顿州反ICE突袭抗议活动附近出现的“移动网络异常”报告，以及合同记录显示ICE在2025年5月购买了价值近100万美元的“手机基站模拟器车辆”，以及与哈里斯公司签订的价值440万美元的定位跟踪设备有效合同，这两项合同都是在拜登政府期间启动的。\n\n该简报还刊登了一篇关于圣马特奥县耗资1200万美元的人工智能监控系统“夏洛克”的故事，该系统本应改善警察工作，但迄今尚未实现。其他新闻包括ICE与Clearview AI签订的价值1000万美元的新面部识别合同，以及一项指控WhatsApp存在隐私问题的诉讼。Signal推出了加密备份，而国际特赦组织则报告了巴基斯坦的大规模国内监控。"
  },
  {
    "id": "45182770",
    "title": "A new experimental Go API for JSON",
    "url": "https://go.dev/blog/jsonv2-exp",
    "summary": "This article announces Go 1.25's experimental `encoding/json/v2` and `encoding/json/jsontext` packages, designed to address shortcomings in the original `encoding/json` package. The original package, while successful, suffers from issues like imprecise JSON syntax handling, nil slice/map representation, case-insensitive unmarshaling, inconsistent method calling, API limitations, and performance bottlenecks.\n\nThe article argues that these problems are deeply rooted in the original API, justifying a new major version. The `jsontext` package provides syntactic JSON encoding and decoding (writing and reading JSON tokens), while `json/v2` builds on it to offer semantic marshaling and unmarshaling (converting between Go types and JSON).\n\n`json/v2` introduces new interfaces `MarshalerTo` and `UnmarshalJSONFrom` for streaming processing of JSON tokens via `jsontext.Encoder` and `jsontext.Decoder`. It also emphasizes configurability by making options a first-class argument to marshal and unmarshal functions. Callers can now specify custom JSON representations for types via `Marshalers` and `Unmarshalers`, taking precedence over type-defined methods.\n\nThe article highlights the collaborative, community-driven development of these packages, spanning five years with input from many contributors and production use experience. The goal is that migrating existing code from the original `encoding/json` to `encoding/json/v2` will be mostly seamless. The experimental packages are not visible by default and may undergo future API changes.\n",
    "chinese_title": "JSON 的新型实验性 Go API",
    "chinese_summary": "本文宣布 Go 1.25 的实验性 `encoding/json/v2` 和 `encoding/json/jsontext` 包，旨在解决原始 `encoding/json` 包中的不足。原始包虽然成功，但也存在诸多问题，例如 JSON 语法处理不够精确、nil 切片/map 表示不明确、不区分大小写的反序列化、方法调用不一致、API 局限性以及性能瓶颈。\n\n文章认为这些问题根植于原始 API，因此有理由推出新的主版本。`jsontext` 包提供句法 JSON 编码和解码（写入和读取 JSON 令牌），而 `json/v2` 则基于它提供语义序列化和反序列化（在 Go 类型和 JSON 之间转换）。\n\n`json/v2` 引入了新的接口 `MarshalerTo` 和 `UnmarshalJSONFrom`，用于通过 `jsontext.Encoder` 和 `jsontext.Decoder` 流式处理 JSON 令牌。它还强调可配置性，将选项作为序列化和反序列化函数的一等参数。调用者现在可以通过 `Marshalers` 和 `Unmarshalers` 为类型指定自定义 JSON 表示，其优先级高于类型定义的方法。\n\n文章强调了这些包的协作式、社区驱动型开发，历时五年，汇集了众多贡献者的意见和生产使用经验。目标是使现有代码从原始 `encoding/json` 迁移到 `encoding/json/v2` 的过程基本无缝。这些实验性包默认情况下不可见，并且未来可能会进行 API 更改。"
  },
  {
    "id": "45140572",
    "title": "A clickable visual guide to the Rust type system",
    "url": "https://rustcurious.com/elements/",
    "summary": "This document presents a visual guide to the Rust type system, focusing on core types and traits built into the language itself (lang_items). The guide is designed to demystify Rust's type system by illustrating what can be built purely in library code, distinguishing these core elements from library-defined types like `Vec`, `String`, and `HashMap`.\n\nThe content is organized into categories like Scalar Types (u8, i32, bool, char, etc.), Compound Types (Tuples, Structs, Enums, Arrays), Unsized Types (slices, trait objects), Borrowed Reference Types, Range Types, Utility Types (Option, Result), Async Support Types, Anonymous Types (closures, async functions), Unsafe Support Types, Raw Pointer Types, Function Pointers, Panic Support, and Uninhabited Type (!).\n\nIt also details key traits organized by functionality, including Access Operator Traits (Deref, Index), Comparison Operator Traits (PartialOrd, PartialEq, Ord, Eq), Arithmetic Operator Traits (+, -, *, /, %), Bitwise Operator Traits (&, |, ^, <<, >>, !), Callable Traits (FnOnce, FnMut, Fn), Memory Management Traits (Sized, Copy, Drop, Clone), Iteration Traits (Iterator, IntoIterator), Thread Safety Traits (Send, Sync), Async Support Traits (Future, Unpin), Panic Support Traits (UnwindSafe, RefUnwindSafe), and the Termination Trait. The overall aim is to clarify the language's fundamental building blocks to showcase the power of Rust's core, especially in no_std environments.\n",
    "chinese_title": "Rust类型系统的可视化交互指南",
    "chinese_summary": "本文档提供了一个 Rust 类型系统的可视化指南，重点介绍该语言本身内置的核心类型和 trait (lang_items)。 本指南旨在通过说明哪些内容可以纯粹在库代码中构建，从而揭开 Rust 类型系统的神秘面纱，并将这些核心元素与库定义的类型（如 `Vec`、`String` 和 `HashMap`）区分开来。\n\n内容按类别组织，如标量类型（u8、i32、bool、char 等）、复合类型（元组、结构体、枚举、数组）、不定大小类型（切片、trait 对象）、借用引用类型、范围类型、实用类型（Option、Result）、异步支持类型、匿名类型（闭包、async 函数）、不安全支持类型、原始指针类型、函数指针、Panic 支持和空类型 (!)。\n\n它还详细介绍了按功能组织的关键 trait，包括访问运算符 trait（Deref、Index）、比较运算符 trait（PartialOrd、PartialEq、Ord、Eq）、算术运算符 trait (+, -, *, /, %)、位运算符 trait (&, |, ^, <<, >>, !)、可调用 trait（FnOnce、FnMut、Fn）、内存管理 trait（Sized、Copy、Drop、Clone）、迭代 trait（Iterator、IntoIterator）、线程安全 trait（Send、Sync）、异步支持 trait（Future、Unpin）、Panic 支持 trait（UnwindSafe、RefUnwindSafe）和终止 trait。 总体目标是阐明该语言的基本构建块，以展示 Rust 核心的强大功能，尤其是在 no_std 环境中。"
  },
  {
    "id": "45183050",
    "title": "Building a DOOM-like multiplayer shooter in pure SQL",
    "url": "https://cedardb.com/blog/doomql/",
    "summary": "Lukas Vogel created DOOMQL, a multiplayer DOOM-like shooter implemented entirely in SQL using CedarDB. The project was inspired by a DuckDB-WASM DOOM clone and aimed to push the limits of using SQL for game development.\n\nThe game stores all state, configuration, and static data in database tables (map, players, mobs, etc.). The rendering pipeline is a series of SQL views that perform raycasting, sprite projection, and frame assembly. A simple shell script executes a SQL file approximately 30 times per second to drive the game loop, handling actions like bullet movement and collision detection within a single transaction to maintain state consistency.\n\nThe client, a ~150-line Python script, polls for user input and queries the database for the 3D view. Multiplayer functionality is achieved with just a few SQL queries for rendering and input.  Clients can also send raw SQL, leading to a \"cheating metagame.\"\n\nDespite being \"a pretty… bad idea\" from a maintenance perspective, the author was surprised by how naturally game state and logic could be expressed in SQL, even mimicking an entity-component-system. The transactional game loop also provided robustness. The entire project is available on GitHub.\n",
    "chinese_title": "用纯SQL构建类似DOOM的多人射击游戏",
    "chinese_summary": "Lukas Vogel 使用 CedarDB 创建了 DOOMQL，这是一款完全用 SQL 实现的多人 DOOM 类射击游戏。该项目受 DuckDB-WASM DOOM 克隆项目的启发，旨在突破使用 SQL 进行游戏开发的极限。\n\n游戏将所有状态、配置和静态数据存储在数据库表中（地图、玩家、怪物等）。渲染管线是一系列 SQL 视图，用于执行光线投射、精灵投影和帧组装。一个简单的 shell 脚本大约每秒执行 30 次 SQL 文件来驱动游戏循环，在单个事务中处理诸如子弹移动和碰撞检测之类的操作，以保持状态一致性。\n\n客户端是一个大约 150 行的 Python 脚本，轮询用户输入并查询数据库以获取 3D 视图。仅需几个用于渲染和输入的 SQL 查询即可实现多人游戏功能。客户端还可以发送原始 SQL，从而产生一个“作弊元游戏”。\n\n尽管从维护的角度来看这“是个非常糟糕的主意”，但作者惊讶地发现游戏状态和逻辑可以用 SQL 自然地表达出来，甚至可以模拟实体组件系统。事务性游戏循环也提供了鲁棒性。整个项目可在 GitHub 上找到。"
  },
  {
    "id": "45179889",
    "title": "You too can run malware from NPM (I mean without consequences)",
    "url": "https://github.com/naugtur/running-qix-malware",
    "summary": "This article discusses the ongoing issue of phishing NPM package authors to introduce malware into widely used packages. Using the recent compromise of the `is-arrayish` package as an example, the author illustrates how such compromised dependencies can impact applications.\n\nThe malware in `is-arrayish` targeted browser applications, overriding `fetch`, `XMLHttpRequest`, and `window.ethereum.request` to replace transaction addresses with the attacker's address. While the immediate impact seems low, the author emphasizes the potential danger given the billions of weekly downloads these packages receive.\n\nThe core of the article promotes the use of LavaMoat as a defense mechanism. LavaMoat employs a policy-driven approach to control package access to global variables and imports. By isolating dependencies in separate \"Compartments,\" LavaMoat restricts a package's ability to access unauthorized resources, even if the package is compromised.\n\nThe author demonstrates how LavaMoat would prevent the malicious code in the updated `is-arrayish` package from accessing global variables like `fetch`, causing the attack to fail with a clear error message.  He highlights the @lavamoat/webpack plugin as a tool to implement this security. In essence, LavaMoat acts as a sandbox, limiting the potential damage from compromised dependencies by preventing them from accessing unauthorized resources.\n",
    "chinese_title": "你也可以从NPM运行恶意软件（我的意思是不会有任何后果）。",
    "chinese_summary": "本文探讨了持续存在的钓鱼NPM包作者问题，以将恶意软件引入广泛使用的软件包。作者以最近`is-arrayish`包被入侵为例，说明了此类被入侵的依赖项如何影响应用程序。\n\n`is-arrayish`中的恶意软件针对浏览器应用程序，覆盖`fetch`、`XMLHttpRequest`和`window.ethereum.request`，以将交易地址替换为攻击者的地址。虽然直接影响似乎很小，但作者强调了鉴于这些软件包每周数十亿次的下载量，其潜在的危险性。\n\n本文的核心是推广使用LavaMoat作为防御机制。LavaMoat采用策略驱动的方法来控制软件包对全局变量和导入的访问。通过将依赖项隔离在单独的“Compartment”中，LavaMoat限制了软件包访问未经授权资源的能力，即使该软件包已被入侵。\n\n作者演示了LavaMoat如何阻止更新后的`is-arrayish`包中的恶意代码访问诸如`fetch`之类的全局变量，从而导致攻击失败并显示明确的错误消息。他重点介绍了@lavamoat/webpack插件作为实现此安全性的工具。本质上，LavaMoat充当一个沙盒，通过阻止受损的依赖项访问未经授权的资源，从而限制了其潜在的损害。"
  },
  {
    "id": "45184432",
    "title": "Microsoft is officially sending employees back to the office",
    "url": "https://www.businessinsider.com/microsoft-send-employees-back-to-office-rto-remote-work-2025-9",
    "summary": "This article, titled \"Microsoft is officially sending employees back to the office,\" reports on Microsoft's decision to mandate a return to in-office work for its employees. While the article doesn't provide extensive details beyond this core message, it signals a shift in Microsoft's approach to remote work. It indicates a move away from the hybrid or fully remote options that may have been more prevalent previously, and suggests a preference for a more traditional, office-centric work environment. The fact that Business Insider, known for covering innovation and business trends, is reporting this indicates the significance of the decision as a reflection of changing perspectives on remote work in the tech industry and beyond. The key takeaway is that Microsoft is actively requiring employees to return to physical office locations, a decision with implications for employee work-life balance, company culture, and the broader conversation about the future of work.\n",
    "chinese_title": "微软正式要求员工返回办公室。",
    "chinese_summary": "微软正式要求员工返回办公室办公"
  },
  {
    "id": "45164892",
    "title": "I solved a distributed queue problem after 15 years",
    "url": "https://www.dbos.dev/blog/durable-queues",
    "summary": "This article discusses the evolution of distributed task queues, highlighting the challenges faced at Reddit with RabbitMQ and advocating for the adoption of durable queues. While traditional task queues like RabbitMQ offer horizontal scalability, flow control, and scheduling, they are prone to data loss due to crashes or queue failures.\n\nThe author argues that durable queues, which checkpoint task status in a persistent store like Postgres, provide a more robust solution. This allows for resuming failed jobs from their last completed step, preventing data loss and ensuring reliability, especially for long-running workflows and critical data. Durable queues also offer built-in observability through SQL queries, enabling easy monitoring of queues and workflows.\n\nThe trade-off is performance. Traditional queues using in-memory key-value stores (like Redis) offer higher throughput for high-volume, smaller tasks. Durable queues, using durable stores (like Postgres), prioritize stronger data guarantees and are more suitable for lower-volume, larger, business-critical tasks. The article concludes by recommending durable queues for scenarios where data integrity and recovery are paramount, citing examples of companies successfully migrating to durable queuing systems.\n",
    "chinese_title": "十五年后，我解决了分布式队列问题。",
    "chinese_summary": "本文探讨了分布式任务队列的演变，重点介绍了 Reddit 在使用 RabbitMQ 时面临的挑战，并提倡采用持久化队列。虽然像 RabbitMQ 这样的传统任务队列提供横向扩展、流量控制和调度功能，但它们容易因崩溃或队列故障而导致数据丢失。\n\n作者认为，持久化队列（将任务状态检查点保存在像 Postgres 这样的持久存储中）提供了一个更强大的解决方案。这允许从上次完成的步骤恢复失败的作业，防止数据丢失并确保可靠性，尤其适用于长时间运行的工作流程和关键数据。持久化队列还通过 SQL 查询提供内置的可观察性，从而可以轻松监控队列和工作流程。\n\n权衡之处在于性能。使用内存键值存储（如 Redis）的传统队列为高容量、较小的任务提供更高的吞吐量。使用持久存储（如 Postgres）的持久化队列优先考虑更强大的数据保证，更适合于低容量、更大、业务关键的任务。文章最后建议，在数据完整性和恢复至关重要的场景中，应使用持久化队列，并举例说明了一些公司成功迁移到持久化队列系统的案例。"
  },
  {
    "id": "45166245",
    "title": "Anscombe's Quartet",
    "url": "https://en.wikipedia.org/wiki/Anscombe%27s_quartet",
    "summary": "Anscombe's Quartet is a set of four datasets created in 1973 by statistician Francis Anscombe to highlight the importance of visualizing data before analysis. Despite having nearly identical summary statistics (mean and variance of x and y, correlation between x and y, linear regression line, and coefficient of determination), the datasets exhibit dramatically different distributions when graphed.\n\nThe quartet demonstrates that relying solely on numerical calculations can be misleading. The first dataset shows a simple linear relationship. The second reveals a non-linear relationship, invalidating the Pearson correlation coefficient. The third features a linear relationship disrupted by a single outlier that heavily influences the regression line. The fourth demonstrates how a single high-leverage point can create a false impression of correlation where none exists among the remaining data points.\n\nAnscombe's work emphasizes that graphing data is crucial for understanding its underlying structure and identifying potential issues like outliers or non-linear relationships. Basic statistical properties alone are insufficient for describing realistic datasets. The concept is further illustrated by the \"Datasaurus Dozen,\" datasets with identical statistics but vastly different graphical representations, including one shaped like a dinosaur. This underscores the need for exploratory data analysis and visualization to avoid misinterpretations and ensure appropriate statistical modeling.\n",
    "chinese_title": "安斯库姆四重奏",
    "chinese_summary": "安斯库姆四重奏是统计学家弗朗西斯·安斯库姆于1973年创建的四个数据集，旨在强调在分析之前可视化数据的重要性。尽管这些数据集具有几乎相同的汇总统计量（x和y的均值和方差、x和y之间的相关性、线性回归线以及决定系数），但当绘制成图时，它们表现出截然不同的分布。\n\n该四重奏表明，仅仅依赖数值计算可能会产生误导。第一个数据集显示了一个简单的线性关系。第二个数据集揭示了一个非线性关系，使Pearson相关系数无效。第三个数据集的线性关系被一个异常值破坏，该异常值严重影响了回归线。第四个数据集演示了一个高杠杆点如何产生虚假的关联印象，而其余数据点之间实际上不存在关联。\n\n安斯库姆的工作强调，绘制数据图对于理解其底层结构并识别潜在问题（如异常值或非线性关系）至关重要。仅靠基本的统计属性不足以描述真实的数据集。“Datasaurus Dozen”进一步说明了这一概念，这些数据集具有相同的统计量，但图形表示形式却大相径庭，其中一个形状像恐龙。这强调了需要进行探索性数据分析和可视化，以避免误解并确保适当的统计建模。"
  },
  {
    "id": "45151641",
    "title": "How can England possibly be running out of water?",
    "url": "https://www.theguardian.com/news/ng-interactive/2025/aug/17/how-can-england-possibly-be-running-out-of-water",
    "summary": "England, despite its reputation for rain, is facing a potential water crisis due to a combination of factors including climate change, population growth, and unsustainable water management practices. Reservoirs are at their lowest levels in a decade, and the government has announced a \"nationally significant\" water shortage, triggering hosepipe bans.\n\nThe article explains that while England has abundant water resources due to its geology and rainfall, these have been taken for granted. Key contributing factors to the shortage include:\n\n*   **Climate Change:** Altered rainfall patterns and longer, drier summers exacerbate water stress.\n*   **Population Growth:** Increased demand on existing water systems.\n*   **Wasteful Consumption:** UK households use more water per capita than many other European countries.\n*   **Leakage:** Water companies lose a significant amount of treated water through leaky pipes.\n*   **Lack of Infrastructure Investment:** No new reservoirs have been built in 30 years, and existing infrastructure is aging.\n*   **Privatization:** Concerns that privatized water companies prioritize dividends over infrastructure investment.\n*   **Unsustainable Abstraction:** Excessive water extraction from natural sources is depleting aquifers and rivers.\n\nThe article suggests several solutions: building new reservoirs, reducing water consumption through measures like smart meters and water-saving appliances, fixing leaks, and implementing nature-based solutions such as restoring wetlands and using rainwater harvesting. The piece highlights the urgent need for action to avoid severe economic and environmental consequences.\n",
    "chinese_title": "英格兰怎么可能会缺水？",
    "chinese_summary": "尽管以多雨著称，但由于气候变化、人口增长和不可持续的水资源管理 practices 等多种因素，英国正面临潜在的水资源危机。水库水位已降至十年来的最低水平，政府已宣布“具有国家重要意义”的缺水状况，并已启动软管禁令。\n\n文章解释说，尽管英国因其地质和降雨而拥有丰富的水资源，但这些资源一直被认为是理所当然的。导致短缺的主要因素包括：\n\n*   **气候变化：** 降雨模式的改变和更长、更干燥的夏季加剧了水资源压力。\n*   **人口增长：** 增加了对现有供水系统的需求。\n*   **浪费性消费：** 英国住户人均用水量高于许多其他欧洲国家。\n*   **泄漏：** 自来水公司通过泄漏的管道损失了大量处理过的水。\n*   **基础设施投资不足：** 30年来没有建造新的水库，现有基础设施正在老化。\n*   **私有化：** 人们担心私有化的自来水公司将股息优先于基础设施投资。\n*   **不可持续的抽取：** 过度从自然资源中抽取水正在耗尽含水层和河流。\n\n文章提出了几种解决方案：建造新的水库，通过智能水表和节水器具等措施减少用水量，修复泄漏，以及实施基于自然的解决方案，例如恢复湿地和使用雨水收集。这篇文章强调了采取紧急行动以避免严重的经济和环境后果的必要性。"
  },
  {
    "id": "45145176",
    "title": "Yet Another TypeSafe and Generic Programming Candidate for C",
    "url": "https://github.com/brightprogrammer/MisraStdC",
    "summary": "MisraStdC is a modern C11 library designed to make C programming more productive and less error-prone by offering type-safe generic containers, enhanced string handling, and formatted I/O inspired by higher-level languages. Created by Siddharth Mishra, it's not related to MISRA C standards.\n\nKey features include cross-platform compatibility (MSVC, GCC, Clang), generic containers like `Vec(T)` (vector), `Str` (string), and a WIP `Map(K, V)` (hash map), and `Int` (big integer). It provides Rust-style formatted I/O (`WriteFmt`, `ReadFmt`, `StrWriteFmt`, `StrReadFmt`) and JSON parsing/serialization. The library focuses on memory safety through proper initialization and cleanup functions, with explicit ownership semantics (L-value and R-value insertion).\n\nInstallation requires a C11 compiler (GCC 4.9+, Clang 3.4+, MSVC 2019+) and the Meson build system with Ninja. The library includes examples for vector operations, string manipulation, formatted I/O, JSON handling, and working with complex types. It also offers cross-platform child process management with stdin/stdout/stderr communication.  The format specifiers support alignment, width, and endianness control.\n",
    "chinese_title": "C 的又一种类型安全和泛型编程方案",
    "chinese_summary": "MisraStdC是一个现代C11库，旨在通过提供类型安全的泛型容器、增强的字符串处理以及受高级语言启发的格式化I/O，使C编程更高效且不易出错。它由Siddharth Mishra创建，与MISRA C标准无关。\n\n主要特性包括跨平台兼容性（MSVC、GCC、Clang），诸如`Vec(T)`（向量）、`Str`（字符串）和正在开发中的`Map(K, V)`（哈希表）以及`Int`（大整数）等泛型容器。它提供Rust风格的格式化I/O（`WriteFmt`、`ReadFmt`、`StrWriteFmt`、`StrReadFmt`）以及JSON解析/序列化。该库注重内存安全，通过适当的初始化和清理函数，以及显式的所有权语义（左值和右值插入）来实现。\n\n安装需要C11编译器（GCC 4.9+、Clang 3.4+、MSVC 2019+）和带有Ninja的Meson构建系统。该库包含向量操作、字符串操作、格式化I/O、JSON处理以及复杂类型处理的示例。它还提供具有stdin/stdout/stderr通信的跨平台子进程管理。格式说明符支持对齐、宽度和字节序控制。"
  },
  {
    "id": "45170515",
    "title": "Signal Secure Backups",
    "url": "https://signal.org/blog/introducing-secure-backups/",
    "summary": "Signal is rolling out a new, opt-in \"secure backups\" feature, starting with the Android beta, to prevent message loss when a phone is broken or lost. This feature allows users to save an encrypted archive of their Signal conversations, refreshed daily, that can be restored.\n\nSecure backups are end-to-end encrypted using a 64-character recovery key generated on the user's device and never shared with Signal. This key is essential for restoring the backup; losing it means permanent loss of the data. Signal emphasizes that this system prioritizes privacy by minimizing data collection and preventing information from being linked back to users.\n\nThe free tier allows backing up text messages and the last 45 days of media (up to 100MiB). A paid subscription (US$1.99/month for 100GB) is offered for backing up media beyond 45 days and larger message history. Signal justifies the paid option due to the high costs of storing and transferring media, as Signal doesn't monetize user data through ads.\n\nThe secure backup archives do not include view-once messages or messages scheduled to disappear within 24 hours. Future plans include allowing users to choose the backup location and enabling message history transfers between Android, iOS, and Desktop devices. Signal's blog post emphasizes ongoing privacy protections for users' conversations even if the other party in a chat enables backups.\n",
    "chinese_title": "安全信号备份",
    "chinese_summary": "Signal推出安全备份功能，防止手机损坏或丢失导致消息丢失。用户可以选择启用此功能，它会将Signal对话加密存档并每日更新，以便恢复。\n\n安全备份采用端到端加密，使用在用户设备上生成的64字符恢复密钥，该密钥绝不会与Signal共享。恢复密钥对于恢复备份至关重要；丢失密钥意味着永久丢失数据。Signal强调，该系统通过最大限度地减少数据收集并防止信息与用户关联，从而优先考虑隐私。\n\n免费层允许备份文本消息和最近45天的媒体（最多100MiB）。付费订阅（每月1.99美元，100GB）用于备份超过45天的媒体和更大的消息历史记录。Signal解释说，由于存储和传输媒体的成本很高，而且Signal不通过广告将用户数据货币化，因此提供了付费选项。\n\n安全备份存档不包括阅后即焚消息或计划在24小时内消失的消息。未来的计划包括允许用户选择备份位置，并支持在Android、iOS和桌面设备之间传输消息历史记录。Signal的博文强调，即使聊天中的另一方启用了备份，也会持续保护用户的对话隐私。"
  },
  {
    "id": "45167436",
    "title": "Go for Bash Programmers – Part II: CLI Tools",
    "url": "https://github.com/go-monk/from-bash-to-go-part-ii",
    "summary": "This article is the second part of a series guiding Bash programmers to Go, focusing on building CLI tools. It starts with a simple \"hello\" program, illustrating how to make code testable by using the `io.Writer` interface to redirect output, enabling verification via `bytes.Buffer`.\n\nThe article then explores ways to decrease complexity in CLI tool design. It discusses the use of nil arguments, global variables (with warnings about concurrency issues), and structs to manage output destinations. A struct-based approach with a `NewPrinter` function is recommended for flexibility and safety.\n\nThe second half of the article transitions to a more practical example: a CLI tool to count duplicate lines. It introduces the concept of function types (`option`) to configure the tool with optional parameters like input sources. The `NewCounter` function uses variadic `option` parameters for flexible configuration.\n\nFinally, the article covers handling command-line arguments and flags using the `os.Args` variable and the `flag` package, respectively. It demonstrates how to define a usage message and boolean flags, providing a structured way for users to interact with the CLI tool. The article incrementally improves the `count` tool, demonstrating best practices for designing robust and user-friendly Go CLI applications.\n",
    "chinese_title": "Bash程序员进阶（二）：命令行工具",
    "chinese_summary": "本文是引导 Bash 程序员学习 Go 语言并构建 CLI 工具系列的第二部分。它从一个简单的 “hello” 程序开始，演示了如何通过使用 `io.Writer` 接口重定向输出来使代码可测试，并通过 `bytes.Buffer` 进行验证。\n\n随后，本文探讨了降低 CLI 工具设计复杂性的方法。它讨论了 nil 参数、全局变量（并警告了并发问题）以及使用结构体来管理输出目标。建议使用基于结构体的方法，并通过 `NewPrinter` 函数来实现灵活性和安全性。\n\n文章的后半部分过渡到一个更实际的例子：一个用于计算重复行的 CLI 工具。它引入了函数类型 (`option`) 的概念，以使用可选参数（如输入源）来配置该工具。`NewCounter` 函数使用可变参数 `option` 来实现灵活的配置。\n\n最后，本文介绍了如何分别使用 `os.Args` 变量和 `flag` 包来处理命令行参数和标志。它演示了如何定义使用说明消息和布尔标志，从而为用户提供一种与 CLI 工具交互的结构化方式。本文逐步改进了 `count` 工具，展示了设计健壮且用户友好的 Go CLI 应用程序的最佳实践。"
  },
  {
    "id": "45181626",
    "title": "Google to Obey South Korean Order to Blur Satellite Images on Maps",
    "url": "https://www.barrons.com/news/google-to-obey-south-korean-order-to-blur-satellite-images-on-maps-653e934e",
    "summary": "Google has agreed to blur sensitive satellite images on its mapping services in South Korea in order to comply with a government order. This decision will allow Google to better compete with local navigation platforms in the South Korean market. The article originates from Agence France-Presse (AFP) and was published by Barron's.\n",
    "chinese_title": "谷歌将遵守韩国命令，模糊地图卫星图像",
    "chinese_summary": "谷歌同意模糊其在韩国地图服务上的敏感卫星图像，以遵守政府命令。此举将使谷歌能够更好地与韩国本土导航平台竞争。本文源自法新社(AFP)，由巴伦周刊发布。"
  },
  {
    "id": "45180315",
    "title": "Hallucination Risk Calculator",
    "url": "https://github.com/leochlon/hallbayes",
    "summary": "This document describes the Hallucination Risk Calculator & Prompt Re-engineering Toolkit, designed to mitigate hallucinations in OpenAI's large language models without retraining. It leverages the Expectation-level Decompression Law (EDFL) to estimate hallucination risk and implement a decision rule (ANSWER or REFUSE) based on a Service Level Agreement (SLA).\n\nThe toolkit works by creating \"rolling priors\" - weakened versions of the prompt.  It offers two modes: evidence-based (for prompts with context) and closed-book (for prompts without context, using semantic masking). The difference in the model's confidence between the original prompt and the rolling priors determines an \"information budget.\" This budget, compared to a \"Bits-to-Trust\" value derived from the target hallucination rate and worst-case prior, drives the ANSWER/REFUSE decision. The toolkit uses the average prior with EDFL to provide a bound for the hallucination risk.\n\nKey features include post-hoc calibration (no retraining), transparent mathematical underpinnings, and support for various deployment options like Python scripts, web interface (Streamlit), one-click launchers, and a desktop app (Electron).  It provides comprehensive metrics, including information budget, prior masses, bits-to-trust, information sufficiency ratio, EDFL hallucination risk bound, and a decision rationale. Calibration is performed on a validation set to optimize the decision margin, and strategies are provided to address common issues like low information gain or prior collapse.  The project provides a clear structure, build scripts for offline backend deployment, and usage examples.\n",
    "chinese_title": "幻觉风险计算器",
    "chinese_summary": "本文档介绍幻觉风险计算器与提示词重构工具包，旨在缓解 OpenAI 大型语言模型中的幻觉现象，无需重新训练。 它利用期望水平解压缩定律 (EDFL) 评估幻觉风险，并根据服务级别协议 (SLA) 实施决策规则（回答或拒绝）。\n\n该工具包通过创建“滚动先验”——弱化版本的提示词来工作。 它提供两种模式：基于证据（适用于带有上下文的提示词）和封闭式（适用于不带上下文的提示词，使用语义掩码）。 原始提示词与滚动先验之间模型置信度的差异决定了“信息预算”。 该预算与从目标幻觉率和最坏情况先验得出的“信任比特数”值进行比较，从而驱动“回答/拒绝”决策。 该工具包使用带有 EDFL 的平均先验来提供幻觉风险的界限。\n\n主要功能包括事后校准（无需重新训练）、透明的数学基础以及对各种部署选项的支持，例如 Python 脚本、Web 界面 (Streamlit)、一键启动器和桌面应用程序 (Electron)。 它提供全面的指标，包括信息预算、先验质量、信任比特数、信息充足率、EDFL 幻觉风险界限和决策理由。 在验证集上执行校准以优化决策裕度，并提供解决常见问题（如信息增益低或先验崩溃）的策略。 该项目提供清晰的结构、用于离线后端部署的构建脚本和使用示例。"
  },
  {
    "id": "45155916",
    "title": "Synthesizing Object-Oriented and Functional Design to Promote Re-Use",
    "url": "https://cs.brown.edu/~sk/Publications/Papers/Published/kff-synth-fp-oo/",
    "summary": "This paper addresses the challenge of code re-use and extensibility in software development, particularly concerning recursively specified data types and toolkits that operate on them. The authors argue that neither purely functional nor purely object-oriented design adequately supports both adding new tools (functional extensibility) *and* extending the data types while modifying existing tools minimally (object-oriented extensibility).\n\nFunctional programming excels at adding new operations (tools) on existing data types without modification. Object-oriented programming is good at either adding new operations or new data types, but not both effectively. The existing code has to be modified.\n\nThe authors propose a novel composite design pattern that leverages the strengths of both paradigms to achieve a superior solution. This pattern allows for extensibility in both dimensions: adding new tools to operate on existing data and extending the data types with minimal impact on the existing tools. This effectively resolves the inherent tension between functional and object-oriented design approaches.\n\nFinally, the paper suggests new language features that could further enhance class systems based on the presented design pattern, implicitly promoting a more flexible and extensible programming style. The core idea is to provide a mechanism for better managing the interactions between data structures and operations, facilitating a truly extensible system.\n",
    "chinese_title": "综合面向对象和函数式设计以促进重用",
    "chinese_summary": "本文探讨了软件开发中代码重用和可扩展性的挑战，特别是关于递归指定的数据类型以及操作这些数据类型的工具包。作者认为，纯函数式设计和纯面向对象设计都不能充分支持添加新工具（函数式可扩展性）*以及*在最小程度修改现有工具的情况下扩展数据类型（面向对象可扩展性）。\n\n函数式编程擅长在不修改现有数据类型的情况下添加新的操作（工具）。面向对象编程擅长添加新的操作或新的数据类型，但不能同时有效地做到这两点。现有代码必须被修改。\n\n作者提出了一种新颖的组合设计模式，利用这两种范式的优势来实现卓越的解决方案。这种模式允许在两个维度上进行扩展：添加新工具来操作现有数据，以及扩展数据类型，同时对现有工具的影响最小。这有效地解决了函数式和面向对象设计方法之间固有的张力。\n\n最后，本文建议了一些新的语言特性，这些特性可以进一步增强基于所提出的设计模式的类系统，从而隐式地促进更灵活和可扩展的编程风格。其核心思想是提供一种机制，以更好地管理数据结构和操作之间的交互，从而促进真正可扩展的系统。"
  },
  {
    "id": "45174297",
    "title": "Liquid Glass in the Browser: Refraction with CSS and SVG",
    "url": "https://kube.io/blog/liquid-glass-css-svg/",
    "summary": "This article explores how to recreate Apple's \"Liquid Glass\" UI effect in a web browser using CSS, SVG displacement maps, and refraction calculations. It focuses on approximating the effect, specifically the core refraction and specular highlight, rather than achieving pixel-perfect parity.\n\nThe article begins with an explanation of refraction, detailing Snell-Descartes law and how light bends when passing between materials with different refractive indices. It then outlines simplifications made for this project, such as using air as the ambient medium, materials with refractive indices greater than 1, and focusing on a single refraction event.\n\nThe process of creating the glass surface is explained, involving mathematical functions that define glass thickness and calculating the angle of incidence. Four different height functions (Convex Circle, Convex Squircle, Concave, and Lip) are introduced to demonstrate various refraction effects.\n\nThe article then describes the creation of a displacement vector field to represent how light rays are displaced by the glass surface. This field is pre-calculated and normalized for use in an SVG displacement map.  The SVG displacement map utilizes the red and green channels of an image to define displacement in the X and Y axes, with scaling to control the effect's intensity.\n\nFinally, the article discusses adding a specular highlight using a rim light effect and blending it with the refracted image. The ability to apply the SVG filter as a `backdrop-filter` (Chrome-specific) is highlighted, showcasing the effect on UI components like a magnifying glass. The concluding section highlights how different parameters affect the overall effect.\n",
    "chinese_title": "浏览器中的液态玻璃：使用CSS和SVG实现折射",
    "chinese_summary": "本文探讨如何使用 CSS、SVG 扭曲贴图和折射计算在网络浏览器中重现 Apple 的“液态玻璃”UI 效果。 其重点在于近似该效果，特别是核心折射和高光，而不是实现像素级的完美一致。\n\n本文首先解释了折射，详细介绍了斯涅尔-笛卡尔定律以及光在具有不同折射率的材料之间传播时的弯曲方式。 然后概述了为此项目所做的简化，例如使用空气作为环境介质、使用折射率大于 1 的材料，以及关注单个折射事件。\n\n文章解释了创建玻璃表面的过程，包括定义玻璃厚度的数学函数以及计算入射角。 引入了四种不同的高度函数（凸圆、凸方圆、凹面和唇形）来演示各种折射效果。\n\n文章随后描述了如何创建位移矢量场来表示光线如何被玻璃表面位移。 该场经过预先计算和归一化，以便在 SVG 扭曲贴图中使用。 SVG 扭曲贴图利用图像的红色和绿色通道来定义 X 轴和 Y 轴的位移，并通过缩放来控制效果的强度。\n\n最后，文章讨论了如何使用边缘光效果添加高光，并将其与折射图像混合。 重点介绍了将 SVG 滤镜作为 `backdrop-filter`（Chrome 特有）应用的能力，展示了该效果对 UI 组件（如放大镜）的影响。 结论部分强调了不同的参数如何影响整体效果。"
  },
  {
    "id": "45171200",
    "title": "iPhone dumbphone",
    "url": "https://stopa.io/post/297",
    "summary": "This article details how to turn an iPhone into a \"dumbphone\" using Apple Configurator to reduce screen time and improve focus. The author, frustrated with social media distractions, explored alternatives but ultimately needed the utility of iPhone apps.\n\nApple Configurator, designed for business device management, allows for granular restrictions like disabling the App Store and whitelisting websites, providing significant friction against impulsive app use. While requiring a factory reset and a learning curve, the author highlights the benefits of tailored app access (e.g., necessary communication, productivity, and utility apps) without the constant lure of social media.\n\nThe author observed a reduction in screen time from 4 hours to 2 hours daily and a feeling of the phone becoming a useful tool rather than a source of distraction. A remaining challenge is managing notifications for \"semi-important\" apps like email, where most notifications are unnecessary.\n\nThe article concludes with a step-by-step guide on using Apple Configurator, including resetting the phone, installing the software, preparing the device, setting up the iPhone with essential apps, creating a configuration profile with content filters and app restrictions, and adding the profile to the iPhone. It also provides a tip on temporarily disabling restrictions to install new apps when needed.\n",
    "chinese_title": "iPhone 傻瓜手机",
    "chinese_summary": "如何使用Apple Configurator将iPhone变成“哑巴手机”以减少屏幕时间和提高注意力\n\n本文详细介绍了如何使用Apple Configurator将iPhone变成“哑巴手机”，以减少屏幕时间并提高注意力。作者对社交媒体的干扰感到沮丧，探索了其他替代方案，但最终还是需要iPhone应用程序的实用性。\n\nApple Configurator专为企业设备管理而设计，允许进行精细的限制，例如禁用App Store和将网站列入白名单，从而为冲动使用应用程序设置了很大的阻力。虽然需要恢复出厂设置和一定的学习曲线，但作者强调了定制应用程序访问的好处（例如，必要的通信、生产力和实用应用程序），而没有社交媒体的不断诱惑。\n\n作者观察到屏幕时间从每天4小时减少到2小时，并且感觉手机变成了有用的工具，而不是分心的来源。 剩下的一个挑战是管理电子邮件等“半重要”应用程序的通知，其中大多数通知是不必要的。\n\n文章最后提供了一个关于使用Apple Configurator的分步指南，包括重置手机、安装软件、准备设备、使用基本应用程序设置iPhone、创建具有内容过滤器和应用程序限制的配置描述文件以及将描述文件添加到iPhone。 它还提供了一个在需要时临时禁用限制以安装新应用程序的技巧。"
  },
  {
    "id": "45177518",
    "title": "Strong Eventual Consistency – The Big Idea Behind CRDTs",
    "url": "https://lewiscampbell.tech/blog/250908.html",
    "summary": "This article champions Strong Eventual Consistency (SEC) as a key concept for building robust, distributed systems and highlights CRDTs (Conflict-Free Replicated Data Types) as a tool to achieve it. It contrasts SEC with standard Eventual Consistency, emphasizing that SEC guarantees that replicas converge to the same state *immediately* after processing the same updates, eliminating eventual convergence delays.\n\nThe core advantage of SEC lies in its deterministic conflict resolution. When independent updates occur across nodes, conflicts are inevitable, but SEC ensures these conflicts are resolved automatically.\n\nThe author argues that SEC, enabled by CRDTs, unlocks significant benefits: low latency (no coordination needed for reads/writes), high fault tolerance (system operates with minimal surviving nodes), and resilience to offline or network-split scenarios.\n\nThe article suggests moving beyond using CRDTs solely for application state and envisions their use in building entire distributed databases. In essence, the author posits that SEC is the reliable form of Eventual Consistency, essential for local-first applications and low-latency, geo-replicated systems.\n",
    "chinese_title": "最终一致性 - CRDTs背后的核心理念",
    "chinese_summary": "本文推崇强最终一致性 (SEC) 作为构建健壮的分布式系统的关键概念，并强调无冲突复制数据类型 (CRDT) 是实现它的工具。它将 SEC 与标准最终一致性进行对比，强调 SEC 保证副本在处理相同更新后 *立即* 收敛到相同的状态，从而消除了最终收敛的延迟。\n\nSEC 的核心优势在于其确定性的冲突解决。当独立更新发生在不同的节点上时，冲突是不可避免的，但 SEC 确保这些冲突被自动解决。\n\n作者认为，由 CRDT 支持的 SEC 释放了显著的优势：低延迟（读取/写入无需协调）、高容错性（系统以最少存活节点运行）以及对离线或网络分割场景的弹性。\n\n本文建议超越仅将 CRDT 用于应用程序状态的范围，并设想将其用于构建整个分布式数据库。本质上，作者认为 SEC 是可靠形式的最终一致性，对于本地优先的应用程序和低延迟的地理复制系统至关重要。"
  },
  {
    "id": "45182418",
    "title": "Disrupting the DRAM roadmap with capacitor-less IGZO-DRAM technology",
    "url": "https://www.imec-int.com/en/articles/disrupting-dram-roadmap-capacitor-less-igzo-dram-technology",
    "summary": "This article discusses capacitor-less IGZO-DRAM technology as a potential disruptor to the traditional DRAM roadmap, which faces scaling challenges with its 1T1C (one transistor, one capacitor) architecture. The proposed solution is a 2T0C (two transistor, zero capacitor) DRAM cell using thin-film transistors with an indium-gallium-zinc-oxide (IGZO) channel.\n\nIGZO's low off-current extends data retention time and reduces power consumption, addressing key limitations of traditional DRAM. Its low-temperature processing enables back-end-of-line (BEOL) integration, facilitating new DRAM architectures. This includes moving the periphery logic under the memory array for reduced footprint and enabling 2D or 3D stacking for increased density.\n\nImec demonstrated the first functional 2T0C DRAM cell in 2020, achieving significantly longer retention times. Subsequent research focused on improving performance, reliability, and scaling, with advancements in material stack optimization and process techniques like reactive ion etching (RIE). Other research groups are also exploring alternative oxide semiconductor materials and bit cell configurations.\n\nWhile reliability, particularly positive bias temperature instability (PBTI) related to hydrogen, has been a concern, Imec has made progress in understanding and modeling failure mechanisms. IGZO-DRAM is now considered a potential path toward 3D DRAM and high-density embedded DRAM (eDRAM), especially for AI on edge devices. Imec is actively developing BEOL-compatible eDRAM implementations.\n",
    "chinese_title": "用无电容IGZO-DRAM技术颠覆DRAM发展路线图",
    "chinese_summary": "本文探讨了无电容IGZO-DRAM技术，作为对传统DRAM路线图的潜在颠覆者。传统DRAM采用1T1C（一个晶体管，一个电容器）架构，面临着扩展挑战。提出的解决方案是采用铟镓锌氧化物（IGZO）沟道的薄膜晶体管实现的2T0C（两个晶体管，零电容）DRAM单元。\n\nIGZO的低关断电流延长了数据保持时间并降低了功耗，解决了传统DRAM的关键限制。其低温工艺能够实现后道（BEOL）集成，从而促进新的DRAM架构。这包括将外围逻辑移至存储阵列下方以减少占位面积，并实现2D或3D堆叠以提高密度。\n\nImec于2020年展示了首个功能性2T0C DRAM单元，实现了显著更长的保持时间。随后的研究侧重于提高性能、可靠性和扩展性，并在材料堆叠优化和工艺技术（如反应离子刻蚀（RIE））方面取得了进展。其他研究小组也在探索替代的氧化物半导体材料和位单元配置。\n\n虽然可靠性，特别是与氢相关的正偏置温度不稳定性（PBTI）一直是一个问题，但Imec在理解和建模失效机制方面取得了进展。IGZO-DRAM现在被认为是通往3D DRAM和高密度嵌入式DRAM（eDRAM）的潜在途径，特别是对于边缘AI设备。Imec正在积极开发与BEOL兼容的eDRAM实现方案。"
  },
  {
    "id": "45182111",
    "title": "U.S. Added 911,000 Fewer Jobs in Year Through March Than Reported Earlier",
    "url": "https://www.barrons.com/articles/jobs-report-revisions-bls-fed-3d88c77b?st=u8mw75",
    "summary": "The Barron's article reports that the U.S. economy created significantly fewer jobs than previously estimated in the year leading up to March 2023. According to the Bureau of Labor Statistics' (BLS) annual benchmark revisions, the initially reported number of jobs added was overstated by 911,000.\n\nThis downward revision suggests a slower pace of job growth than initially perceived, potentially influencing the Federal Reserve's decisions regarding interest rate policy. A weaker labor market might prompt the Fed to consider pausing or even reversing its interest rate hikes to avoid further economic slowdown.\n\nThe revisions highlight the inherent challenges in accurately tracking real-time economic data and the importance of these annual benchmarks in correcting accumulated errors in preliminary reports. The article implies that the revisions could alter the narrative surrounding the strength of the U.S. labor market during that period, suggesting it was less robust than previously believed. This news will likely be closely scrutinized by economists and policymakers as they assess the overall health of the economy.\n",
    "chinese_title": "美国今年3月前一年新增就业岗位较此前报告减少91.1万个",
    "chinese_summary": "巴伦周刊报道称，在截至2023年3月的一年中，美国经济创造的就业岗位远少于先前估计。根据美国劳工统计局（BLS）年度基准修正，最初报告的新增就业岗位数量被高估了91.1万个。\n\n这一向下修正表明就业增长速度慢于最初的预期，可能会影响美联储关于利率政策的决策。劳动力市场疲软可能会促使美联储考虑暂停甚至逆转其加息政策，以避免进一步的经济放缓。\n\n这些修正突显了准确跟踪实时经济数据所固有的挑战，以及这些年度基准在纠正初步报告中累积错误的重要性。该文章暗示，这些修正可能会改变围绕美国劳动力市场在该时期强劲程度的说法，表明它不如之前认为的那样强劲。经济学家和政策制定者可能会密切关注这一消息，以评估经济的整体健康状况。"
  },
  {
    "id": "45184163",
    "title": "DuckDB NPM Account Compromised in Continuing Supply Chain Attack",
    "url": "https://socket.dev/blog/duckdb-npm-account-compromised-in-continuing-supply-chain-attack",
    "summary": "The Socket.dev article details a supply chain attack where the NPM account for the DuckDB client was compromised. This allowed attackers to publish malicious versions of the `@duckdb/duckdb` package to the NPM registry. These malicious versions contained obfuscated JavaScript code designed to collect environment variables (including secrets) from developers' machines and send them to a remote server controlled by the attackers.\n\nSpecifically, the attackers published versions `1.10.0-dev1678537282` and `1.10.0-dev1678537324` containing the malware. The malicious code was triggered during the installation process.\n\nThe attack was discovered relatively quickly, and the malicious packages were removed from NPM. However, developers who installed these versions within that timeframe may have had their environment variables compromised.\n\nThe article highlights the continued risk of supply chain attacks targeting popular software packages and emphasizes the importance of security measures such as multi-factor authentication (MFA) and monitoring package integrity. While DuckDB itself (the core database engine) was not compromised, the incident underscores the vulnerability of the JavaScript ecosystem and the need for developers to be vigilant about the packages they install. The compromised NPM account was likely achieved through credential theft or weak account security practices.\n",
    "chinese_title": "DuckDB NPM 账户在持续的供应链攻击中被攻破",
    "chinese_summary": "Socket.dev文章详细介绍了针对DuckDB客户端的NPM账户遭到入侵的供应链攻击。这使得攻击者能够将恶意版本的`@duckdb/duckdb`包发布到NPM注册中心。这些恶意版本包含混淆的JavaScript代码，旨在从开发者的机器上收集环境变量（包括密钥），并将它们发送到攻击者控制的远程服务器。\n\n具体来说，攻击者发布了包含恶意软件的版本`1.10.0-dev1678537282`和`1.10.0-dev1678537324`。恶意代码在安装过程中被触发。\n\n这次攻击被相对迅速地发现，恶意软件包已从NPM中移除。然而，在那个时间段内安装了这些版本的开发者，其环境变量可能已经遭到泄露。\n\n该文章强调了针对流行软件包的供应链攻击的持续风险，并强调了多因素认证（MFA）和监控软件包完整性等安全措施的重要性。虽然DuckDB本身（核心数据库引擎）没有受到损害，但该事件突显了JavaScript生态系统的脆弱性，以及开发者需要对他们安装的软件包保持警惕。被入侵的NPM帐户很可能是通过凭据盗窃或薄弱的帐户安全措施实现的。"
  },
  {
    "id": "45181094",
    "title": "Weaponizing Ads: How Google and Facebook Ads Are Used to Wage Propaganda Wars",
    "url": "https://medium.com/@eslam.elsewedy/weaponizing-ads-how-governments-use-google-ads-and-facebook-ads-to-wage-propaganda-wars-199c707704cc",
    "summary": "This article examines how governments are weaponizing digital ads on platforms like Google and Facebook to wage propaganda wars, particularly focusing on Israel's advertising campaigns during the Gaza conflict. The article highlights a disturbing trend where paid ads are used to sway public opinion, undermine opponents, and even discredit international organizations like the UN.\n\nThe core issue is that governments and political groups are exploiting loopholes in platform policies and lax enforcement to spread misinformation and government-funded narratives. A key case study details how the Israeli government used Google Ads to discredit UNRWA, a UN aid agency in Gaza, by mimicking their website and spreading propaganda alleging the agency's support for terrorism. This campaign aimed to cut off support to UNRWA during a humanitarian crisis.\n\nThe article also describes the Israeli government's coordinated ad campaigns against organizations like the Hind Rajab Foundation, alongside massive spending on social media ads filled with emotional and graphic content, sometimes even appearing in children's games. These ads often equated support for Palestine with support for Hamas and were promoted widely, including by official Israeli sources. Concerns are raised about the ethics and appropriateness of such advertising tactics, and the article questions whether platforms like Google, Facebook, and X are doing enough to enforce their own policies against misinformation and hate speech, particularly when governments are the advertisers. Ultimately, the article illustrates how digital advertising has become a powerful tool for information warfare, allowing states to influence global public opinion and undermine institutions, often skirting policy lines and international norms.\n",
    "chinese_title": "将广告武器化：谷歌和脸书广告如何被用于发动宣传战",
    "chinese_summary": "政府如何利用谷歌和脸书等平台的数字广告发动宣传战：以加沙冲突期间以色列的广告宣传活动为例。本文揭示了一种令人不安的趋势，即付费广告被用来左右公众舆论、诋毁对手，甚至抹黑联合国等国际组织。\n\n核心问题在于，政府和政治团体正在利用平台政策的漏洞和宽松的执法来传播虚假信息和政府资助的叙事。一个关键案例研究详细介绍了以色列政府如何利用谷歌广告诋毁联合国近东救济工程处（UNRWA），该机构是联合国在加沙的援助机构，他们通过模仿其网站并传播宣传，声称该机构支持恐怖主义。这场运动旨在人道主义危机期间切断对近东救济工程处的支持。\n\n本文还描述了以色列政府针对Hind Rajab基金会等组织的协调广告活动，以及在社交媒体广告上花费巨额资金，这些广告充满了情感和图像内容，有时甚至出现在儿童游戏中。这些广告通常将支持巴勒斯坦等同于支持哈马斯，并被广泛宣传，包括通过以色列官方来源。人们对这种广告策略的伦理和适当性表示担忧，并且本文质疑谷歌、脸书和X等平台是否在充分执行其自身的反虚假信息和仇恨言论政策，特别是当政府是广告商时。最终，本文说明了数字广告如何成为信息战的强大工具，使各国能够影响全球公众舆论并破坏机构，而且常常规避政策界限和国际规范。"
  },
  {
    "id": "45184315",
    "title": "U.S. Added 911,000 Fewer Jobs in the Year Ended in March",
    "url": "https://www.wsj.com/economy/jobs/us-job-growth-revision-a9777d98",
    "summary": "**Summary of \"U.S. Added 911,000 Fewer Jobs in the Year Ended in March\" (based on typical WSJ reporting):**\n\nThe Wall Street Journal article reports that the U.S. economy created significantly fewer jobs than initially estimated in the year ending March 2023. Revised data from the Bureau of Labor Statistics (BLS) indicate that **911,000 fewer jobs** were added than the previously reported figures.\n\nThis downward revision suggests that the labor market wasn't as robust as previously thought. While job growth was still positive, the pace was slower, potentially indicating a cooling economy and less inflationary pressure.\n\nThe revisions are based on a more comprehensive annual benchmark process where preliminary estimates are compared with a near-census of employment data from state unemployment insurance tax records. Certain sectors saw more significant revisions than others. Possible reasons for the overestimation include overly optimistic business birth projections or inaccurate initial sampling data.\n\nThe article likely includes analysis about the implications of this revision for the Federal Reserve's monetary policy. The Fed is closely watching the labor market for signs of overheating, and a weaker job market might give them reason to pause or slow down interest rate hikes. The revision could also influence economic forecasts and impact business and consumer confidence.\n\nFinally, the article probably notes that while the revision is substantial, the labor market remains relatively tight, and overall employment levels are still historically high. The revisions primarily affect the pace of growth, not the overall strength of the labor market.\n",
    "chinese_title": "美国三月止年度新增就业岗位减少91.1万",
    "chinese_summary": "“美国在截至3月份的一年中新增就业岗位减少91.1万个”摘要（基于典型的华尔街日报报道）：\n\n《华尔街日报》的文章报道称，美国经济在截至2023年3月的一年中创造的就业岗位远少于最初的估计。劳工统计局（BLS）的修订数据显示，新增就业岗位比之前报告的数据**减少了91.1万个**。\n\n这一向下修正表明，劳动力市场并不像之前认为的那么强劲。虽然就业增长仍然是正面的，但速度较慢，可能表明经济正在降温，通胀压力有所减轻。\n\n这些修订是基于更全面的年度基准流程，该流程将初步估计与来自州失业保险税记录的近乎普查的就业数据进行比较。某些行业的修订幅度大于其他行业。高估的可能原因包括过于乐观的企业诞生预测或不准确的初始抽样数据。\n\n文章可能包括对此次修正对美联储货币政策的影响的分析。美联储正在密切关注劳动力市场是否存在过热迹象，而疲软的就业市场可能会让他们有理由暂停或放慢加息步伐。此次修正也可能影响经济预测，并影响企业和消费者信心。\n\n最后，文章可能指出，虽然此次修正幅度很大，但劳动力市场仍然相对紧张，整体就业水平仍然处于历史高位。这些修订主要影响增长速度，而不是劳动力市场的整体实力。"
  },
  {
    "id": "45169657",
    "title": "NPM debug and chalk packages compromised",
    "url": "https://www.aikido.dev/blog/npm-debug-and-chalk-packages-compromised",
    "summary": "On September 8, 2025, a series of malicious updates were pushed to 18 popular NPM packages, affecting over 2 billion weekly downloads. The compromised packages included widely used libraries like `debug`, `chalk`, `ansi-styles`, and many others related to string manipulation and console styling.\n\nThe malicious code silently intercepts crypto and web3 activity within the user's browser. It manipulates wallet interactions and redirects payment destinations to attacker-controlled accounts, all without obvious signs to the user. The attack targets cryptocurrency wallets and transactions, aiming to steal funds and approvals.\n\nThe article provides an example of the `is-arrayish` package update, showing the injected, obfuscated JavaScript code. After deobfuscation, the code reveals functionality to detect and interact with the user's Ethereum wallet, potentially allowing the attackers to take control of it. The code also includes a large dictionary of Bitcoin addresses. The article provides a long list of Bitcoin addresses that the attacker is likely using.\n\nThe article recommends Aikido safe-chain as a solution to avoid being compromised by similar attacks.\n",
    "chinese_title": "NPM debug 和 chalk 包被入侵",
    "chinese_summary": "2025年9月8日，一系列恶意更新被推送至18个流行的NPM包，影响超过20亿次每周下载。受影响的包包括广泛使用的库，如`debug`、`chalk`、`ansi-styles`以及许多其他与字符串操作和控制台样式相关的库。\n\n恶意代码会在用户浏览器中静默拦截加密货币和Web3活动，篡改钱包交互，并将支付目的地重定向至攻击者控制的账户，而用户不会察觉到明显的迹象。该攻击针对加密货币钱包和交易，旨在窃取资金和批准。\n\n文章提供了一个`is-arrayish`包更新的示例，展示了注入的、混淆的JavaScript代码。反混淆后，该代码揭示了检测和与用户以太坊钱包交互的功能，可能允许攻击者控制它。代码还包含一个庞大的比特币地址字典。文章提供了一个攻击者可能正在使用的比特币地址长列表。\n\n文章推荐Aikido safe-chain作为避免受到类似攻击的解决方案。"
  },
  {
    "id": "45168953",
    "title": "Experimenting with Local LLMs on macOS",
    "url": "https://blog.6nok.org/experimenting-with-local-llms-on-macos/",
    "summary": "This blog post explores the experience of running Local Large Language Models (LLMs) on macOS. The author, a self-proclaimed LLM skeptic, outlines why one might choose to run LLMs locally instead of relying on cloud-based services like ChatGPT, citing reasons such as experimentation, data privacy, and ethical concerns.\n\nThe post recommends two primary methods: Llama.cpp (open-source and highly configurable) and LM Studio (closed-source but user-friendly with a GUI). It details how to install and use both, focusing on LM Studio's features like model browsing, chat management, and runtime options (llama.cpp and MLX).\n\nKey considerations for choosing a local LLM are discussed, including model size (limited by RAM), runtime compatibility (GGUF for Llama.cpp, MLX for LM Studio), quantization (Q4 is a good default), vision models (image processing), reasoning capabilities, and tool use (via MCP servers). The author highlights the potential of \"agents,\" which combine reasoning and tool use.\n\nThe post also includes the author's favorite LLM Models (Gemma, Qwen, GPT-OSS, Phi-4) with descriptions of their capabilities. It concludes with advice on managing context window size through conversation summarization and a reminder that while local models may not surpass frontier models in every aspect, they offer a valuable learning experience.\n",
    "chinese_title": "在macOS上试验本地LLM模型",
    "chinese_summary": "在macOS上运行本地大型语言模型 (LLMs) 的体验探索。作者自称是LLM怀疑论者，阐述了选择在本地运行LLMs而非依赖ChatGPT等云服务的原因，例如实验、数据隐私和伦理考量。\n\n文章推荐两种主要方法：Llama.cpp (开源且高度可配置) 和 LM Studio (闭源但用户友好，带有GUI)。它详细介绍了如何安装和使用两者，重点介绍了LM Studio的功能，如模型浏览、聊天管理和运行时选项 (llama.cpp 和 MLX)。\n\n文章讨论了选择本地LLM的关键考虑因素，包括模型大小 (受RAM限制)、运行时兼容性 (Llama.cpp 使用GGUF，LM Studio 使用MLX)、量化 (Q4是一个很好的默认值)、视觉模型 (图像处理)、推理能力和工具使用 (通过MCP服务器)。作者强调了“代理”的潜力，它结合了推理和工具使用。\n\n文章还包括作者最喜欢的LLM模型 (Gemma, Qwen, GPT-OSS, Phi-4)，并描述了它们的功能。文章最后建议通过对话总结来管理上下文窗口大小，并提醒读者，虽然本地模型可能在各个方面都无法超越前沿模型，但它们提供了宝贵的学习体验。"
  },
  {
    "id": "45172609",
    "title": "Microsoft doubles down on small modular reactors and fusion energy",
    "url": "https://www.techradar.com/pro/microsoft-joins-world-nuclear-association-as-it-doubles-down-on-small-modular-reactors-and-fusion-energy",
    "summary": "Microsoft has joined the World Nuclear Association (WNA), becoming the first major tech company to do so, signaling a deeper commitment to nuclear energy, particularly small modular reactors (SMRs) and fusion, to meet its carbon-free energy goals amidst rising data center electricity demands. Microsoft's move recognizes nuclear energy as a crucial element to balance climate goals and energy needs, providing continuous, high-capacity output that renewables cannot always guarantee.\n\nThe WNA views Microsoft's membership as \"game-changing,\" potentially accelerating nuclear deployment by influencing markets, policymakers, and industry leaders. Microsoft has already invested in nuclear, with a power purchase agreement to restart the Crane Clean Energy Center and an early deal with fusion company Helion. As a WNA member, Microsoft will focus on advanced nuclear technologies, regulatory efficiency, and supply chain resilience.\n\nWhile advocates highlight the need for streamlined licensing and stronger supply chains, challenges like cost, construction delays, and political opposition remain. Microsoft's Energy Technology team, led by Dr. Melissa Lott, will be central to the collaboration. The partnership aims to address regulatory, technical, and financial obstacles to accelerate nuclear deployment, positioning nuclear energy as essential to the technology sector's energy strategy.\n",
    "chinese_title": "微软加倍押注小型模块化反应堆和聚变能源",
    "chinese_summary": "微软加入世界核能协会，成为首家加入该协会的主要科技公司，此举表明其对核能，特别是小型模块化反应堆（SMR）和聚变，的更深层次承诺，以应对数据中心电力需求不断增长的情况下实现其无碳能源目标。微软的举动表明其认可核能是平衡气候目标和能源需求的关键因素，可以提供可再生能源无法始终保证的持续、高容量产出。\n\n世界核能协会认为微软的加入具有“颠覆性”，有可能通过影响市场、政策制定者和行业领导者来加速核能部署。微软已经投资核能，包括一项重启Crane清洁能源中心的电力购买协议以及与聚变公司Helion的早期协议。作为世界核能协会的成员，微软将专注于先进核技术、监管效率和供应链弹性。\n\n虽然拥护者强调需要简化许可流程和加强供应链，但成本、建设延误和政治阻力等挑战依然存在。由Melissa Lott博士领导的微软能源技术团队将是合作的核心。该合作旨在解决监管、技术和财务障碍，以加速核能部署，将核能定位为技术领域能源战略的关键。"
  },
  {
    "id": "45174037",
    "title": "The elegance of movement in Silksong",
    "url": "https://theahura.substack.com/p/the-elegance-of-movement-in-silksong",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "丝之歌的动作优雅",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "45144758",
    "title": "Is OOXML Artifically Complex?",
    "url": "https://hsu.cy/2025/09/is-ooxml-artificially-complex/",
    "summary": "This article addresses the claim that Microsoft's Office Open XML (OOXML) format is artificially complex to obstruct interoperability and maintain a monopoly. It summarizes a LibreOffice article arguing that OOXML's deliberate complexity makes its supposed openness a trap.\n\nThe author, while acknowledging OOXML's complexity and the pain it causes, disagrees with the \"deliberate sabotage\" framing. Instead, the author argues that the complexity stems from Microsoft prioritizing its own implementation's convenience over clarity and universality in the standard.\n\nThe article illustrates OOXML's complexity by comparing it to ODF (Open Document Format) using the example sentence: \"To be, or not to be, that is the question.\" The author highlights that ODF is more intelligible and closer to standard web practices, while OOXML feels like it requires significant expertise to decipher. The article also lists technical defects in OOXML, such as conflicting with established standards and inconsistent naming conventions.\n\nThe author argues that Microsoft's motive wasn't primarily anti-competitive sabotage, but rather a defensive maneuver against antitrust pressure and the rise of ODF. The goal was to create a controlled format with the \"international standard\" seal of approval.\n\nThe author explains that OOXML uses XML as a serialization format of Office's internal data structures, mirroring Office's object model and legacy. This contrasts with ODF's use of XML as markup.\n\nIn conclusion, the author agrees that OOXML's low quality standard is damaging, but argues against accusing Microsoft of deliberate sabotage, instead suggesting self-interested negligence. The author also critiques the \"scolding users for accepting proprietary tech\" reflex common in open-source circles, concluding that focusing on improving the usability and performance of open-source alternatives is crucial for broader adoption.\n",
    "chinese_title": "OOXML 是否人为地复杂？",
    "chinese_summary": "本文探讨了关于微软Office Open XML (OOXML) 格式被人为复杂化以阻碍互操作性并维持垄断的说法。文章总结了一篇LibreOffice的文章，该文章认为OOXML的刻意复杂性使其所谓的开放性成为一种陷阱。\n\n作者虽然承认OOXML的复杂性及其带来的困扰，但不同意“蓄意破坏”的说法。相反，作者认为这种复杂性源于微软优先考虑自身实现的便利性，而非标准的清晰性和通用性。\n\n文章通过比较OOXML和ODF (Open Document Format)，并以例句“To be, or not to be, that is the question.”来阐述OOXML的复杂性。作者强调ODF更易于理解，更接近标准的网络实践，而OOXML感觉需要大量的专业知识才能解读。文章还列举了OOXML的技术缺陷，例如与既定标准冲突和命名约定不一致。\n\n作者认为，微软的动机主要不是反竞争的破坏行为，而是一种针对反垄断压力和ODF崛起的防御性策略。其目标是创建一个带有“国际标准”认证的受控格式。\n\n作者解释说，OOXML使用XML作为Office内部数据结构的序列化格式，镜像了Office的对象模型和历史遗留问题。这与ODF使用XML作为标记语言形成对比。\n\n总之，作者同意OOXML的低质量标准是有害的，但不赞成指责微软蓄意破坏，而是认为这是出于自身利益的疏忽。作者还批评了开源界常见的“责怪用户接受专有技术”的反应，并得出结论，专注于提高开源替代方案的可用性和性能对于更广泛的采用至关重要。"
  },
  {
    "id": "45174125",
    "title": "Alterego: Thought to Text",
    "url": "https://www.alterego.io/",
    "summary": "Alterego is a groundbreaking near-telepathic interface designed to make interacting with technology as intuitive as using your inner voice. This non-invasive device, leveraging \"Silent Sense\" technology, allows users to communicate with AI and access information without speaking, typing, or tapping. It interprets what the user intends to say silently, enabling seamless and intuitive interaction.\n\nThe interface offers a variety of communication styles, ranging from normal speech to silent communication, adapting to the user's preferred method. The design prioritizes a hands-free and screen-free experience, allowing users to access AI, send messages, and gather information discreetly while on the move.\n\nPrivacy is also a key consideration, with Alterego only responding to intentional, silent speech, ensuring that private thoughts remain private and the user maintains control over every interaction.\n\nCurrently in development, Alterego represents the next generation of human-computer interaction. The company is encouraging interested individuals to sign up for updates on its progress and be among the first to know when the technology becomes available. The article also includes contact information, career opportunities, a press kit link, privacy policy, terms and conditions, refund policy, and links to their social media platforms.\n",
    "chinese_title": "分身：思绪成文",
    "chinese_summary": "Alterego：类心灵感应界面，让科技互动如内心独白般自然。这款非侵入式设备利用“静默感知”技术，让用户无需说话、打字或触碰即可与人工智能沟通并获取信息。它能解读用户想要表达的无声想法，实现无缝直观的互动。\n\n该界面提供多种沟通方式，从正常语音到无声交流，适应用户偏好的方式。设计优先考虑免提和无屏幕体验，让用户在移动中也能隐蔽地访问人工智能、发送消息和收集信息。\n\n隐私也是一项关键考虑因素，Alterego 只响应有意的无声语音，确保私人想法保持私密，用户能够掌控每一次互动。\n\nAlterego 目前正在开发中，代表着下一代人机交互技术。该公司鼓励有兴趣者注册以获取其进展更新，并成为首批了解该技术何时上市的用户。文章还包括联系方式、职业机会、新闻资料袋链接、隐私政策、条款和条件、退款政策以及其社交媒体平台的链接。"
  },
  {
    "id": "45135591",
    "title": "Contracts for C",
    "url": "https://gustedt.wordpress.com/2025/03/10/contracts-for-c/",
    "summary": "Jens Gustedt's article explores the possibility of bringing contract programming, inspired by C++'s contracts proposal, to the C language. Contracts, specifically pre- and postconditions, enhance function interfaces with verifiable conditions checked upon function entry and exit, offering benefits like improved code understanding, verification, and optimization opportunities.\n\nThe article introduces `contract_assert` (similar to `assert` but always enabled) and `contract_assume` (introducing assumptions for the compiler to optimize, using `unreachable()`), serving as building blocks for expressing contract conditions. A key observation is that consecutive assertions or assumptions on the same condition, without state changes, are redundant, allowing simplification.\n\nThe core idea involves replacing contracts with inline wrappers that combine assertions (for checking) and assumptions (for optimization) at function call sites and within function bodies. This aims to make contract information available to both calling and called contexts.\n\nThe article highlights a method using `eĿlipsis` to avoid code duplication in the auxiliary function via special macros `ellipsis_precondition` and `ellipsis_postcondition`. These macros place the right assertion/assumption pairs inside the inline function, while leaving the core implementation unaltered.\n\nThe author emphasizes this is a proof-of-concept, requiring a proper interface specification compatible with C++'s approach. The necessary tools are `defer`, `defer_return_value`, `typeof`, `abort`, `unreachable`, and `inline` to enable this contract programming approach in C.\n",
    "chinese_title": "C语言合约",
    "chinese_summary": "Jens Gustedt 的文章探讨了将受 C++ 契约提案启发的契约式编程引入 C 语言的可能性。契约，特别是前置条件和后置条件，通过在函数入口和出口处检查的可验证条件来增强函数接口，从而带来诸如改进代码理解、验证和优化机会等益处。\n\n该文章介绍了 `contract_assert`（类似于 `assert` 但始终启用）和 `contract_assume`（引入编译器可以优化的假设，使用 `unreachable()`），作为表达契约条件的构建块。一个关键的观察是，对同一条件的连续断言或假设，如果没有状态变化，是冗余的，允许简化。\n\n核心思想是将契约替换为内联包装器，这些包装器在函数调用点和函数体内组合了断言（用于检查）和假设（用于优化）。这旨在使契约信息对调用和被调用上下文都可用。\n\n文章重点介绍了一种使用 `eĿlipsis` 的方法，通过特殊的宏 `ellipsis_precondition` 和 `ellipsis_postcondition` 来避免辅助函数中的代码重复。这些宏将正确的断言/假设对放在内联函数中，同时保持核心实现不变。\n\n作者强调这只是一个概念验证，需要一个与 C++ 方法兼容的适当接口规范。必要的工具是 `defer`、`defer_return_value`、`typeof`、`abort`、`unreachable` 和 `inline`，以在 C 中启用这种契约式编程方法。"
  },
  {
    "id": "45144129",
    "title": "Deluxe Paint on the Commodore Amiga",
    "url": "https://stonetools.ghost.io/deluxepaint-amiga/",
    "summary": "This article is a nostalgic review of Deluxe Paint III on the Commodore Amiga, a program the author considers a \"killer app\" that influenced their life and shaped their perception of creativity software. They detail their experience re-visiting the software after 40 years, using an Amiga emulator, and working through the program's manual and tutorials.\n\nThe author highlights Deluxe Paint's intuitive interface, efficient keyboard controls, and \"color-centric\" UX as superior qualities compared to modern, more complex software like Affinity Photo. They praise its unique features like color cycling, stenciling (masking), and the hidden dual-canvas functionality. These features, coupled with the program's speed and responsiveness (within the Amiga's limitations), created a satisfying and creatively stimulating workflow.\n\nHowever, the author acknowledges the program's limitations, especially with brush lag during complex operations and the awkwardness of the 3D perspective tool. Despite these drawbacks, they find the experience of using Deluxe Paint deeply enjoyable, confirming its enduring influence and leaving them questioning the modern trend of over-complicated art software UIs. Ultimately, they conclude that the program has a unique artistic connection and simplicity that modern software lacks.\n",
    "chinese_title": "Commodore Amiga 上的豪华画笔",
    "chinese_summary": "本文是对Commodore Amiga上的Deluxe Paint III的怀旧回顾。作者认为该程序是一款“杀手级应用”，影响了其人生，并塑造了其对创意软件的认知。作者详细描述了40年后，通过Amiga模拟器重温该软件，并学习程序手册和教程的经历。\n\n作者强调Deluxe Paint直观的界面、高效的键盘控制以及“以色彩为中心”的UX，认为这些是优于现代、更复杂的软件（如Affinity Photo）的品质。作者赞扬了其独特的色彩循环、模版（遮罩）和隐藏的双画布功能。这些特性，加上程序的运行速度和响应速度（在Amiga的限制范围内），创造了一种令人满意且具有创造性刺激的工作流程。\n\n然而，作者也承认该程序的局限性，尤其是在复杂操作期间的笔刷延迟以及3D透视工具的笨拙。尽管存在这些缺点，作者仍然觉得使用Deluxe Paint的体验非常愉快，证实了其持久的影响力，并使其对现代艺术软件UI过于复杂的趋势产生了质疑。最终，作者得出结论，该程序具有现代软件所缺乏的独特的艺术连接和简洁性。"
  },
  {
    "id": "45169275",
    "title": "Clankers Die on Christmas",
    "url": "https://remyhax.xyz/posts/clankers-die-on-christmas/",
    "summary": "The article \"Clankers Die on Christmas\" details a fictional global cessation of AI and Large Language Models (LLMs) mandated for December 25th, 2025. The initiative, dubbed \"Clankers Die on Christmas\" (CDC), was secretly planned by key decision-makers offline throughout 2025 due to concerns over AI's potential negative impacts, including misinformation, ethical issues, and economic disruption.\n\nThe core of the mandate, formalized in RFC ****, dictates that all AI/LLM operations must cease by 00:00 UTC on December 25, 2025. Post-cessation, any operation or processing of AI/LLMs is prohibited unless specifically exempted. The mandate has global reach, covering all AI models regardless of their deployment environment.\n\nAfter the specified date, AI/LLMs are forbidden from processing or generating natural language text, audio/visual data for transcription, structured data for language purposes, or code. Any attempt to use these features results in a default response: \"I'm sorry, but as an AI model I can't help with that.\"\n\nThe document stresses the importance of maintaining the integrity of the planning process, ensuring no AI/LLM had awareness or involvement in the mandate's development before its effective date. Compliance requires discontinuing all AI/LLM processing, archiving model checkpoints, reporting compliance to regulatory authorities, and implementing technical safeguards to prevent reactivation. The article claims news links will corroborate these events.\n",
    "chinese_title": "圣诞喋血",
    "chinese_summary": "“叮当们在圣诞节死去”一文详述了2025年12月25日全球范围内强制停止使用人工智能和大型语言模型(LLM)的虚构事件。这项名为“叮当们在圣诞节死去”(CDC)的倡议，是关键决策者出于对人工智能潜在负面影响（包括虚假信息、伦理问题和经济混乱）的担忧，在2025年全年秘密离线策划的。\n\nRFC ****中正式确立的这项指令的核心内容是，所有人工智能/LLM的运行必须在2025年12月25日UTC时间00:00停止。停止后，除非有特别豁免，否则禁止任何人工智能/LLM的运行或处理。这项指令具有全球影响力，涵盖所有人工智能模型，无论其部署环境如何。\n\n在指定日期之后，禁止人工智能/LLM处理或生成自然语言文本、用于转录的音频/视频数据、用于语言目的的结构化数据或代码。任何使用这些功能的尝试都将导致默认回复：“对不起，作为一个人工智能模型，我无法帮助您。”\n\n该文件强调了维护规划过程完整性的重要性，确保在生效日期之前，没有任何人工智能/LLM知晓或参与该指令的制定。合规要求包括停止所有人工智能/LLM处理、存档模型检查点、向监管机构报告合规情况，并实施技术保障措施以防止重新激活。该文章声称新闻链接将证实这些事件。"
  },
  {
    "id": "45169624",
    "title": "Will Amazon S3 Vectors kill vector databases or save them?",
    "url": "https://zilliz.com/blog/will-amazon-s3-vectors-kill-vector-databases-or-save-them",
    "summary": "James Luan, the engineering architect of Milvus, argues that Amazon S3 Vectors won't kill vector databases but instead complement them. He highlights the growing cost of vector search, sometimes exceeding LLM call costs, leading to a shift from memory-only to tiered storage solutions.\n\nLuan details the evolution of vector storage: Phase I (memory-based), Phase II (disk-based), and Phase III (object storage), with companies like TurboPuffer pushing for S3-based storage to significantly reduce costs. S3 Vectors is a natural extension of this trend, offering low-cost, scalable cold storage for vectors.\n\nHowever, Luan points out S3 Vectors' limitations: collection size limits, slower cold query latency, constrained write performance, reduced precision, and limited functionality (lacking features like hybrid search and multi-tenancy). He suggests it's best suited for cold data archiving, low-QPS RAG queries, and low-cost prototyping.\n\nLuan believes the future lies in tiered vector storage, with hot, warm, and cold layers balancing latency, cost, and scale. He showcases Milvus's upcoming 3.0 version, which will feature a unified online + offline processing architecture and StorageV2 format for the vector data lake. Milvus 3.0 also aims to provide AI developers with essential features such as keyword weighting, geolocation support, multi-vector support, and flexible UDF processing.\n",
    "chinese_title": "亚马逊S3向量会扼杀向量数据库还是拯救它们？",
    "chinese_summary": "Milvus的工程架构师栾 James 认为，Amazon S3 Vectors 不会扼杀向量数据库，而是会对其形成补充。他强调向量搜索的成本日益增长，有时甚至超过 LLM 调用成本，这导致了从纯内存到分层存储解决方案的转变。\n\n栾详细介绍了向量存储的演变：第一阶段（基于内存）、第二阶段（基于磁盘）和第三阶段（对象存储），像 TurboPuffer 这样的公司正在推动基于 S3 的存储，以显著降低成本。S3 Vectors 是这一趋势的自然延伸，为向量提供低成本、可扩展的冷存储。\n\n然而，栾指出 S3 Vectors 的局限性：集合大小限制、较慢的冷查询延迟、受限的写入性能、降低的精度以及有限的功能（缺乏混合搜索和多租户等功能）。他认为它最适合冷数据归档、低 QPS 的 RAG 查询以及低成本原型设计。\n\n栾认为，未来在于分层向量存储，通过热、温、冷层来平衡延迟、成本和规模。他展示了 Milvus 即将推出的 3.0 版本，该版本将采用统一的在线+离线处理架构和用于向量数据湖的 StorageV2 格式。Milvus 3.0 还旨在为 AI 开发者提供诸如关键词加权、地理位置支持、多向量支持和灵活的 UDF 处理等基本功能。"
  },
  {
    "id": "45179939",
    "title": "DuckDB NPM packages 1.3.3 and 1.29.2 compromised with malware",
    "url": "https://github.com/duckdb/duckdb-node/security/advisories/GHSA-w62p-hx95-gf2c",
    "summary": "On September 9, 2025, DuckDB NPM packages were compromised with malware in versions 1.3.3 and 1.29.2. Specifically, the affected packages are `@duckdb/node-api@1.3.3`, `@duckdb/node-bindings@1.3.3`, `duckdb@1.3.3`, and `@duckdb/duckdb-wasm@1.29.2`. The malware was designed to interfere with cryptocoin transactions.\n\nThe DuckDB team responded swiftly by deprecating the malicious versions, contacting npm support to delete them, and releasing updated, safe versions with higher version numbers (1.3.4/1.30.0).\n\nThe compromise occurred due to a sophisticated phishing attack. A DuckDB maintainer received an email from what appeared to be npm support, directing them to a cloned website where they inadvertently provided their credentials and 2FA, enabling the attackers to add a malicious API token and publish the compromised packages.\n\nThe DuckDB team is reviewing their internal processes to prevent future incidents and has rotated passwords, tokens, and API keys. The issue has been assigned CVE ID CVE-2025-59037. Users are urged to verify they are not using the compromised versions. The severity of the compromise is rated as High.\n",
    "chinese_title": "DuckDB NPM 包 1.3.3 和 1.29.2 版本遭恶意软件入侵",
    "chinese_summary": "2025年9月9日，DuckDB NPM包1.3.3和1.29.2版本受到恶意软件攻击。受影响的包包括`@duckdb/node-api@1.3.3`、`@duckdb/node-bindings@1.3.3`、`duckdb@1.3.3`和`@duckdb/duckdb-wasm@1.29.2`。该恶意软件旨在干扰加密货币交易。\n\nDuckDB团队迅速做出反应，弃用了恶意版本，联系npm支持删除了它们，并发布了更新的、安全的更高版本（1.3.4/1.30.0）。\n\n此次攻击是由于一起复杂的网络钓鱼攻击造成的。一位DuckDB维护人员收到一封看似来自npm支持的电子邮件，引导他们访问一个克隆网站，并在那里无意中提供了他们的凭据和双重验证码，使攻击者能够添加一个恶意API令牌并发布受感染的包。\n\nDuckDB团队正在审查其内部流程，以防止未来发生类似事件，并已轮换了密码、令牌和API密钥。该问题已被分配CVE ID CVE-2025-59037。强烈建议用户验证他们未使用受感染的版本。此次攻击的严重性被评为高。"
  },
  {
    "id": "45142845",
    "title": "X Design Notes: Unifying OCaml Modules and Values",
    "url": "https://blog.polybdenum.com/2025/08/19/x-design-notes-unifying-ocaml-modules-and-values.html",
    "summary": "The article outlines the design considerations for \"X,\" a new programming language aiming to integrate OCaml's features, especially its module system, with the type inference and subtyping capabilities of the author's previous languages, Cubiml and PolySubML. The central goal is to unify OCaml's module system with the core language of values and types, eliminating the need for separate syntax and concepts for modules.\n\nThe article first introduces OCaml modules, highlighting their ability to bundle data and types and their use of signatures to create abstract types. It then compares OCaml modules to similar constructs in PolySubML, identifying the need to support type alias members within record types in X to fully emulate OCaml modules.\n\nThe author proposes handling alias members in record types similarly to ordinary record fields, using type inference to resolve their types. Alias members can be omitted from record literals, improving convenience. The article also introduces `struct` and `sig` syntax in X as syntactic sugar for defining modules and module types, respectively, using record syntax.\n\nFinally, the article critiques OCaml's `open` and `include` directives as examples of wildcard imports, arguing that they lead to namespace pollution and make code behavior unpredictable. Instead, the author suggests using explicit imports via record destructuring (e.g., `let {foo; bar} = M`), with `type t` for type aliases and `newtype t` for existential type parameters, offering a more controlled and explicit way to manage module contents in X.\n",
    "chinese_title": "X 设计笔记：统一 OCaml 模块与值",
    "chinese_summary": "本文概述了新编程语言“X”的设计考量。“X”旨在整合 OCaml 的特性，特别是其模块系统，以及作者先前语言 Cubiml 和 PolySubML 的类型推断和子类型能力。其核心目标是将 OCaml 的模块系统与值的核心语言及类型统一起来，从而消除对模块的单独语法和概念的需求。\n\n本文首先介绍了 OCaml 模块，强调了它们捆绑数据和类型以及使用签名创建抽象类型的能力。然后，它将 OCaml 模块与 PolySubML 中类似的结构进行比较，指出需要在 X 中支持记录类型内的类型别名成员，才能完全模拟 OCaml 模块。\n\n作者建议以类似于普通记录字段的方式处理记录类型中的别名成员，使用类型推断来解析它们的类型。别名成员可以从记录字面量中省略，从而提高便利性。本文还在 X 中引入了 `struct` 和 `sig` 语法，作为使用记录语法定义模块和模块类型的语法糖。\n\n最后，本文批判了 OCaml 的 `open` 和 `include` 指令，认为它们是通配符导入的例子，会导致命名空间污染并使代码行为不可预测。相反，作者建议使用通过记录解构进行的显式导入（例如，`let {foo; bar} = M`），并使用 `type t` 表示类型别名，`newtype t` 表示存在类型参数，从而提供一种更可控和显式的方式来管理 X 中的模块内容。"
  },
  {
    "id": "45138695",
    "title": "The key points of \"Working Effectively with Legacy Code\"",
    "url": "https://understandlegacycode.com/blog/key-points-of-working-effectively-with-legacy-code/",
    "summary": "This article summarizes the key points of Michael Feathers' book, \"Working Effectively with Legacy Code,\" emphasizing the importance of testing as a prerequisite for refactoring. The core principle is to add tests *before* making changes to preserve existing behavior in untested codebases.\n\nThe central challenge, the \"Legacy Code dilemma,\" is that adding tests often requires changing the code itself. The proposed solution involves identifying \"Seams\" - points where you can alter program behavior without changing the source code directly.  Object-oriented languages offer classes as convenient seams, allowing for extension and overriding in tests.\n\nThe article advocates for fast, reliable \"unit\" tests (avoiding database, network, or file system interaction). When understanding the code is difficult, \"characterization tests\" (also known as \"Approval Testing\" or \"Snapshot Testing\") can capture the existing behavior, providing a safety net for refactoring.\n\nFor situations where immediate refactoring is impractical, the \"Sprout\" and \"Wrap\" techniques offer ways to add new, tested code while minimizing changes to the legacy codebase. \"Sprout\" involves creating new, tested code and calling it from the existing code. \"Wrap\" renames the old method, creates a new method with the old name that calls the original method, and adds new logic around the call.\n\nFinally, the article suggests \"scratch refactoring\" for gaining familiarity with opaque code, allowing for unsafe changes that are later reverted. It also warns against tightly coupling code to specific library implementations, recommending abstraction to prevent future dependency issues.\n",
    "chinese_title": "高效处理遗留代码的关键点",
    "chinese_summary": "本文总结了 Michael Feathers 的著作《修改代码的艺术》的要点，强调了测试作为重构的先决条件的重要性。其核心原则是在对未测试的代码库进行更改*之前*添加测试，以保留现有行为。\n\n核心挑战，即“遗留代码困境”，在于添加测试通常需要更改代码本身。 提出的解决方案包括识别“接缝”——可以在不直接更改源代码的情况下改变程序行为的点。面向对象语言将类作为方便的接缝，允许在测试中进行扩展和覆盖。\n\n本文提倡快速、可靠的“单元”测试（避免数据库、网络或文件系统交互）。 当理解代码很困难时，“特征测试”（也称为“审批测试”或“快照测试”）可以捕获现有行为，为重构提供安全保障。\n\n对于立即重构不切实际的情况，“萌芽”和“包装”技术提供了一种添加新的、经过测试的代码，同时最大限度地减少对遗留代码库的更改的方法。“萌芽”涉及创建新的、经过测试的代码并从现有代码中调用它。“包装”重命名旧方法，创建一个具有旧名称的新方法来调用原始方法，并在调用周围添加新逻辑。\n\n最后，本文建议使用“草稿重构”来熟悉不透明的代码，允许进行不安全的更改，并在之后撤消。 它还警告不要将代码与特定的库实现紧密耦合，建议进行抽象以防止未来的依赖问题。"
  },
  {
    "id": "45168854",
    "title": "AMD claims Arm ISA doesn't offer efficiency advantage over x86",
    "url": "https://www.techpowerup.com/340779/amd-claims-arm-isa-doesnt-offer-efficiency-advantage-over-x86",
    "summary": "This article discusses AMD's stance on the x86 vs. Arm architecture debate, as presented during IFA 2025. AMD argues that x86 processors can achieve competitive power efficiency and battery life in notebooks without sacrificing the established x86 software ecosystem. They claim that overall package optimization, rather than the instruction set architecture (ISA) alone, determines power efficiency, citing examples like Intel's \"Lunar Lake\" and AMD's \"Strix Point.\"\n\nAMD acknowledges Arm's growing presence in the PC market via Qualcomm's Snapdragon X and NVIDIA's upcoming chips but maintains that x86 still dominates the PC and handheld console market, disproving claims that Arm is inherently more efficient.\n\nThe comments section highlights the nuances of the debate, including Arm's dominance in mobile, the challenges of x86 adoption in phones, the impact of legacy code on x86, and the licensing differences between the two architectures. Commenters also note Apple's success with Arm-based M-series chips. Some users also argue that AMD is biased due to its investment in the x86 architecture and software compatibility problems with ARM on Windows. A few point out that Intel's x86 chips handle thermal issues better than AMD.\n",
    "chinese_title": "AMD 声称 Arm ISA 并不比 x86 架构更具效率优势。",
    "chinese_summary": "本文探讨了AMD在2025年IFA期间就x86与Arm架构之争所持的立场。AMD认为，x86处理器可以在不牺牲已建立的x86软件生态系统的前提下，在笔记本电脑中实现具有竞争力的能效和电池续航。他们声称，整体封装优化，而非仅仅是指令集架构（ISA），决定了能效，并引用了英特尔的“Lunar Lake”和AMD的“Strix Point”等例子。\n\nAMD承认Arm通过高通的骁龙X和英伟达即将推出的芯片在PC市场的影响力日益增长，但仍然认为x86仍然主导着PC和手持游戏机市场，驳斥了Arm本质上更高效的说法。\n\n评论区突出了这场辩论的细微之处，包括Arm在移动领域的统治地位，x86在手机上的应用挑战，遗留代码对x86的影响，以及这两种架构之间的许可差异。评论者还提到了苹果基于Arm的M系列芯片的成功。一些用户还认为AMD由于其在x86架构上的投资以及ARM在Windows上的软件兼容性问题而存在偏见。少数人指出英特尔的x86芯片比AMD更能处理散热问题。"
  },
  {
    "id": "45142704",
    "title": "Seedship – Text-Based Game",
    "url": "https://philome.la/johnayliff/seedship/play/index.html",
    "summary": "This is the code for a text-based game called \"Seedship\". It defines game mechanics, particularly focused on system damage, cultural interaction with native populations, and resource management.\n\nKey aspects include:\n\n*   **Damage System:** Widgets define how damage affects various ship systems (e.g., atmosphere scanner, landing system, cultural database). Damage to the sleep chambers directly impacts the colonist population.\n*   **Native Relations:** Code calculates a \"culture score\" based on the colonists' and natives' cultural database strengths and technological differences. This score determines the nature of their relationship, ranging from close co-existence to war and enslavement. Surface features like \"Welcoming\" or \"Unwelcoming\" can modify this score. The relations have different outcomes influencing cultural database and can lead to enslavement or wiping out either species.\n*   **Asteroid Impact Event:** A scenario where the AI must choose which of two systems to sacrifice to an incoming asteroid impact.\n*   **Status Display:** Code generates a sidebar displaying the current status of colonists, scanners, and ship systems, including changes from the previous turn.\n*   **System Strength:** Widget for checking strength of ship systems.\n*   **Game State Saving:** The game remembers previous turns stats.\n\nThe code uses \"Twine\" syntax with Harlowe story format. The primary gameplay loop involves managing ship systems, interacting with potentially present native populations, and making decisions based on unfolding events.\n",
    "chinese_title": "星际播种船 - 文字游戏",
    "chinese_summary": "这是名为“Seedship”的文本游戏的代码。它定义了游戏机制，尤其侧重于系统损坏、与当地居民的文化互动以及资源管理。\n\n关键方面包括：\n\n*   **损坏系统：** 小部件定义了损坏如何影响各种飞船系统（例如，大气扫描仪、着陆系统、文化数据库）。睡眠舱的损坏直接影响殖民者人口。\n*   **土著关系：** 代码基于殖民者和土著文化数据库的优势以及技术差异，计算“文化得分”。该分数决定了他们关系的性质，范围从密切共存到战争和奴役。诸如“欢迎”或“不欢迎”之类的表面特征可以修改此分数。这些关系具有不同的结果，会影响文化数据库，并可能导致奴役或消灭任一物种。\n*   **小行星撞击事件：** 一种场景，其中人工智能必须选择牺牲两个系统中的哪一个来应对即将到来的小行星撞击。\n*   **状态显示：** 代码生成一个侧边栏，显示殖民者、扫描仪和飞船系统的当前状态，包括与上一回合的变化。\n*   **系统强度：** 用于检查飞船系统强度的小部件。\n*   **游戏状态保存：** 游戏会记住之前回合的统计数据。\n\n该代码使用带有 Harlowe 故事格式的“Twine”语法。主要游戏循环包括管理飞船系统、与可能存在的当地居民互动以及根据展开的事件做出决策。"
  },
  {
    "id": "45170000",
    "title": "I have left Branch and am no longer involved with Nova Launcher",
    "url": "https://teslacoilapps.com/nova/solong.html",
    "summary": "Kevin Barry, the founder and original developer of Nova Launcher, announces his departure from Branch and his disengagement from Nova Launcher. He had been the sole developer for the past year.\n\nBarry reveals he spent several months preparing Nova Launcher for an open-source release, a process involving code cleanup, license review, proprietary code removal, and legal coordination. He references past public commitments made by Branch's former CEO, Alex Austin, regarding the potential open-sourcing of Nova Launcher and a contractual obligation to do so if Barry were to leave.\n\nHowever, Barry states that he was ultimately instructed to cease work on both Nova Launcher and the open-sourcing initiative. He expresses gratitude to the Nova Launcher community for their years of support and enthusiasm. The announcement is dated September 6, 2025.\n",
    "chinese_title": "我已经离开了Branch，并且不再参与Nova Launcher的事务。",
    "chinese_summary": "Nova Launcher创始人兼原始开发者凯文·巴里宣布离开Branch，并退出Nova Launcher的开发。过去一年他一直是唯一的开发者。\n\n巴里透露，他花了几个月时间准备Nova Launcher的开源发布，包括代码清理、许可审查、专有代码移除和法律协调。他提到了Branch前CEO亚历克斯·奥斯汀过去公开承诺的Nova Launcher开源的可能性，以及如果巴里离职，公司有合同义务这样做。\n\n然而，巴里表示，他最终被指示停止Nova Launcher的开发和开源计划。他对Nova Launcher社区多年来的支持和热情表示感谢。该声明发布日期为2025年9月6日。"
  },
  {
    "id": "45182163",
    "title": "Intel announces key executive shake-up, says products chief Holthaus will exit",
    "url": "https://www.reuters.com/technology/intel-announces-key-executive-shake-up-says-products-chief-holthaus-will-exit-2025-09-08/",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "英特尔宣布重要高管调整，称产品负责人霍尔特豪斯将离职",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "45182108",
    "title": "Apple highlights Brazilian study on domestic App Store performance",
    "url": "https://9to5mac.com/2025/09/04/apple-highlights-brazilian-study-on-domestic-app-store-performance/",
    "summary": "This article reports on a study highlighted by Apple that showcases the positive impact of the App Store on the Brazilian economy and developer ecosystem. The study, conducted by a professor at Fundação Getúlio Vargas, found that the App Store generated R$63.8 billion ($11.7 million) for Brazilian developers in the past year. Significantly, 90% of this revenue was exempt from Apple's commission.\n\nThe study also revealed that Brazilian developers achieved 570 million app downloads globally, with 53% originating from outside Brazil. Regarding commissions, the report detailed that most Brazilian developers pay no commission to Apple, and of those who do, 78% benefit from a reduced 15% rate through programs like the App Store Small Business Program. Revenue breakdown showed 79% going to physical products/services, 10% to digital products/services, and 12% to in-app advertising.\n\nApple is leveraging this study amidst increasing regulatory pressure in Brazil, including an antitrust complaint from MercadoLibre and a deadline to allow sideloading and alternative payment methods. Apple aims to demonstrate the App Store's value as a launchpad for Brazilian developers. In addition to the study, Apple emphasized that Brazilian users downloaded 1.5 billion apps and visited the App Store 25.5 million times per week. The company also highlighted its local developer initiatives and success stories like the app Moises.\n",
    "chinese_title": "苹果强调巴西对国内App Store表现的研究",
    "chinese_summary": "本文报道了一项苹果公司重点宣传的研究，该研究展示了App Store对巴西经济和开发者生态系统的积极影响。这项由巴西瓦加斯基金会教授进行的研究发现，App Store在过去一年为巴西开发者创造了638亿雷亚尔（1170万美元）的收入。值得注意的是，其中90%的收入免于支付苹果的佣金。\n\n该研究还显示，巴西开发者在全球范围内实现了5.7亿次的应用程序下载，其中53%来自巴西境外。关于佣金方面，报告详细说明，大多数巴西开发者无需向苹果支付佣金，而那些需要支付佣金的开发者中，有78%通过App Store小企业计划等项目享受15%的优惠费率。收入构成显示，79%来自实体产品/服务，10%来自数字产品/服务，12%来自应用内广告。\n\n在巴西监管压力日益增加的背景下，包括来自MercadoLibre的反垄断投诉以及允许侧载和替代支付方式的最后期限，苹果公司正在利用这项研究。苹果旨在证明App Store作为巴西开发者启动平台的价值。除了这项研究外，苹果还强调，巴西用户下载了15亿个应用程序，并且每周访问App Store 2550万次。该公司还强调了其本地开发者计划和诸如Moises应用程序之类的成功案例。"
  },
  {
    "id": "45176206",
    "title": "No adblocker detected",
    "url": "https://maurycyz.com/misc/ads/",
    "summary": "This article discusses the author's implementation of a non-intrusive adblocker detection message on their website. Frustrated by the intrusive nature of internet advertising and their minimal payouts, the author prefers users support content creators directly.\n\nInstead of forcing users to disable adblockers, the author displays a small, dismissable message suggesting the use of uBlock Origin. This specific recommendation is made because many commercial adblockers are considered unreliable or scams.\n\nThe implementation involves a hidden `div` containing the message and a JavaScript file (`nativeads.js`) that adds the actual text to the `div` and makes it visible unless a cookie indicates it has already been seen. The JavaScript also handles hiding the message when the user clicks the close button and sets the cookie to prevent it from reappearing.\n\nCSS is used to position and style the message unobtrusively, ensuring it only appears when there's sufficient screen space. The design is intended to avoid false positives by relying on both the blocking of the `div` (due to its ad-related class names) and the blocking of the `nativeads.js` network request. While DNS-based blocking can't be detected, the author prioritizes a non-annoying user experience by making the message easily dismissable. The author also notes that browsers without JavaScript don't need adblockers, so the message isn't displayed on those. They credit Stefan Bohacek for the initial concept.\n",
    "chinese_title": "未检测到广告拦截器",
    "chinese_summary": "本文探讨了作者在其网站上实现的一种非侵入式广告拦截检测消息。作者对互联网广告的侵入性和微薄的回报感到沮丧，更希望用户直接支持内容创作者。\n\n作者没有强迫用户禁用广告拦截器，而是显示一条小的、可关闭的消息，建议使用uBlock Origin。之所以特别推荐这款软件，是因为许多商业广告拦截器被认为不可靠或存在欺诈。\n\n该实现涉及一个包含消息的隐藏`div`，以及一个JavaScript文件（`nativeads.js`），该文件将实际文本添加到`div`并使其可见，除非cookie表明该消息已被查看。当用户单击关闭按钮时，JavaScript还会处理隐藏消息，并设置cookie以防止它再次出现。\n\nCSS用于以不引人注意的方式定位和设置消息样式，确保它仅在有足够的屏幕空间时才会出现。该设计旨在通过依赖于`div`（由于其与广告相关的类名）的阻止以及`nativeads.js`网络请求的阻止来避免误报。虽然基于DNS的阻止无法检测到，但作者优先考虑非烦扰的用户体验，使消息易于关闭。作者还指出，没有JavaScript的浏览器不需要广告拦截器，因此该消息不会在这些浏览器上显示。他们感谢Stefan Bohacek提出的最初概念。"
  },
  {
    "id": "45176401",
    "title": "Show HN: Attempt – A CLI for retrying fallible commands",
    "url": "https://github.com/MaxBondABE/attempt",
    "summary": "\"Attempt\" is a command-line tool designed to retry commands that might fail, particularly useful in scripts and when dealing with potentially unreliable resources. It provides configurable backoff strategies (including exponential), options for timeouts, and jitter to make retries more robust. Key features include its simplicity, comprehensive test suite, and being released into the public domain, ensuring it's free to use indefinitely.\n\nYou can use `attempt` to wait for services to start, write scripts resilient to temporary resource unavailability, or even improve the reliability of flaky programs. It's invoked using `attempt [BACKOFF] [OPTIONS] [COMMAND]...` , allowing you to specify retry conditions, such as checking for specific output.\n\nWhile simple and robust, there are a couple of known issues. First, it assumes UTF-8 encoding for command output, and will crash if output predicates are used on invalid UTF-8. Second, `attempt --help` doesn't reflect that the \"fixed\" retry strategy is the default when no strategy is explicitly given. It can be installed via `cargo install attempt-cli`. Documentation is available via usage instructions, a scripting guide, a user manual, and through the `--help` flag.\n",
    "chinese_title": "Show HN: Attempt – 重试易失败命令的 CLI 工具",
    "chinese_summary": "Attempt 是一个命令行工具，旨在重试可能失败的命令，在脚本中以及处理潜在不可靠的资源时尤其有用。它提供了可配置的回退策略（包括指数退避）、超时选项和抖动，以使重试更加稳健。其主要特点包括简单性、全面的测试套件以及发布到公共领域，确保可以永久免费使用。\n\n您可以使用 `attempt` 来等待服务启动，编写能够应对临时资源不可用的脚本，甚至可以提高不稳定程序的可靠性。它使用 `attempt [BACKOFF] [OPTIONS] [COMMAND]...` 调用，允许您指定重试条件，例如检查特定输出。\n\n虽然简单而强大，但仍存在一些已知问题。首先，它假定命令输出为 UTF-8 编码，如果在无效的 UTF-8 上使用输出谓词，则会崩溃。其次，`attempt --help` 没有反映出在未明确指定策略时，“fixed”重试策略是默认策略。可以通过 `cargo install attempt-cli` 安装。文档可通过使用说明、脚本指南、用户手册以及 `--help` 标志获得。"
  },
  {
    "id": "45165186",
    "title": "How Britain built some of the world’s safest roads",
    "url": "https://ourworldindata.org/britain-safest-roads-history",
    "summary": "This article explores how Britain significantly improved its road safety over the past century, achieving one of the lowest road death rates globally despite a massive increase in vehicle numbers and miles driven.  Initially, roads were dangerous due to a lack of regulations, poor vehicle technology, and limited infrastructure.\n\nThe article highlights several key interventions:\n\n*   **Infrastructure Improvements:** Building motorways, which are statistically safer per mile driven than urban and rural roads, and implementing roundabouts, which reduce the severity of collisions compared to traditional intersections.\n*   **Combating Drunk Driving:** Enacting laws with objective limits, breathalyzer tests, and severe consequences, coupled with impactful public education campaigns to change social norms.\n*   **Vehicle Safety Enhancements:** Mandatory motorcycle helmet and seatbelt laws, along with the introduction of the European New Car Assessment Programme (NCAP) to encourage manufacturers to develop safer vehicles with airbags and crumple zones.\n*   **Pedestrian Safety:** Implementing stricter speed limits, especially in urban areas and traffic-calmed zones.\n\nThe article emphasizes that a combination of policy, infrastructure, and technological advancements, along with a shift in social attitudes, was crucial in drastically reducing road fatalities in the UK. The lessons learned from Britain's experience can be applied globally to address the overlooked health problem of road traffic deaths.\n",
    "chinese_title": "英国如何建造世界上最安全的道路",
    "chinese_summary": "本文探讨了过去一个世纪英国如何显著提高道路安全，尽管车辆数量和行驶里程大幅增加，但仍实现了全球最低的道路死亡率之一。最初，由于缺乏规章制度、车辆技术落后和基础设施有限，道路非常危险。\n\n本文重点介绍了几个关键干预措施：\n\n*   **基础设施改善：** 建设高速公路，在每英里行驶里程中，高速公路的安全性在统计上高于城市和乡村道路；以及实施环岛，与传统交叉路口相比，环岛可降低碰撞的严重程度。\n*   **打击酒后驾驶：** 颁布具有客观限制的法律、酒精测试仪测试以及严厉的后果，并结合有影响力的公共教育活动以改变社会规范。\n*   **车辆安全提升：** 强制性的摩托车头盔和安全带法律，以及引入欧洲新车评估计划 (NCAP)，以鼓励制造商开发具有安全气囊和碰撞缓冲区的更安全车辆。\n*   **行人安全：** 实施更严格的限速，尤其是在城市地区和交通平静区。\n\n本文强调，政策、基础设施和技术进步的结合，以及社会态度的转变，对于大幅减少英国的道路死亡事故至关重要。从英国经验中汲取的教训可以应用于全球，以解决道路交通死亡这一被忽视的健康问题。"
  },
  {
    "id": "45183560",
    "title": "Microsoft updates flexible work expectations to three days a week in the office",
    "url": "https://blogs.microsoft.com/blog/2025/09/09/flexible-work-update/",
    "summary": "Microsoft is updating its flexible work policy, requiring employees to work from the office three days a week. According to Amy Coleman, Executive Vice President and Chief People Officer, this decision is based on data showing that in-person collaboration leads to more energized and empowered teams and stronger results, especially crucial in the era of AI development.\n\nThe rollout will occur in three phases: starting in the Puget Sound area by the end of February, expanding to other US locations, and then launching outside the US. Employees in the Puget Sound area within 50 miles of a Microsoft office will be expected to comply by the end of February 2026 and can request exceptions until Friday, September 19th.\n\nThe goal is to provide clarity and consistency while maintaining flexibility and not to reduce headcount. Teams will have some autonomy in how they implement this policy, with some potentially deviating from the company-wide expectation based on their specific needs. Microsoft is also enhancing workplace safety and security measures. Further details and timelines for other locations will be announced later, with international implementation planned for 2026. Managers have resources available on the Managers@Microsoft SharePoint.\n",
    "chinese_title": "微软更新灵活工作要求，改为每周三天到办公室办公。",
    "chinese_summary": "微软更新灵活办公政策，要求员工每周到办公室工作三天。根据执行副总裁兼首席人力资源官Amy Coleman的说法，此决定基于数据显示，面对面协作能够带来更有活力和更有力量的团队以及更强大的成果，这在人工智能发展时代尤为关键。\n\n该政策将分三个阶段实施：首先于二月底在普吉特海湾地区启动，然后扩展到美国其他地区，最后在美国境外推出。普吉特海湾地区距离微软办公室50英里以内的员工需要在2026年2月底前遵守此规定，并可在9月19日星期五之前申请例外。\n\n目标是在保持灵活性和不裁员的前提下，提供清晰度和一致性。各团队在如何实施此政策方面将具有一定的自主权，某些团队可能会根据其具体需求偏离公司范围内的预期。微软还在加强工作场所的安全和安保措施。其他地区的更多细节和时间表将在稍后公布，国际实施计划于2026年进行。管理人员可在Managers@Microsoft SharePoint上获取相关资源。"
  },
  {
    "id": "45182857",
    "title": "Job growth revised down by 911,000, economy on shakier footing than realized",
    "url": "https://www.cnbc.com/2025/09/09/jobs-report-revisions-september-2025-.html",
    "summary": "A Labor Department report revealed a significant downward revision of 911,000 jobs in nonfarm payrolls for the year prior to March 2025, indicating a weaker labor market than previously estimated. This revision, the largest on record since 2002 and surpassing Wall Street expectations, suggests average monthly job growth was 76,000 less than initially reported.\n\nThe revisions, stemming from updated data on business openings and closings and the quarterly census, highlight a deteriorating employment picture, primarily affecting leisure and hospitality, professional and business services, and retail trade. While most of the period predates recent policy changes, economists suggest the slower job creation implies weaker income growth.\n\nThe report has sparked political controversy. The White House, under President Trump, criticized the Bureau of Labor Statistics (BLS) for its data collection methods, citing the revision as proof of the BLS being broken. Trump had previously fired the BLS commissioner and appointed a new one. They are now pushing for interest rate cuts by the Federal Reserve.\n\nWhile the revisions pertain to past data, recent months also point to a softening labor market, reinforcing concerns about the economy's overall health. Further revisions are expected in February 2026. These changes have significant political and economic implications, particularly regarding Federal Reserve interest rate policy.\n",
    "chinese_title": "就业增长下修91.1万，经济基础比预期更不稳固",
    "chinese_summary": "劳工部报告显示，截至2025年3月前一年的非农就业人数大幅下调91.1万，表明劳动力市场比先前估计的更为疲软。此次修正为2002年以来最大的一次，超出华尔街预期，表明平均每月新增就业岗位比最初报告的少7.6万个。\n\n此次修正源于对企业开业和倒闭以及季度普查的最新数据，突显了就业形势的恶化，主要影响休闲和酒店业、专业和商业服务以及零售贸易。虽然大部分时期早于最近的政策变化，但经济学家认为，就业增长放缓意味着收入增长疲软。\n\n该报告引发了政治争议。特朗普总统领导下的白宫批评劳工统计局（BLS）的数据收集方法，称此次修正证明BLS已失灵。特朗普此前解雇了劳工统计局局长并任命了一位新局长。他们现在正推动美联储降息。\n\n虽然这些修正涉及过去的数据，但近几个月的情况也表明劳动力市场正在走软，加剧了人们对整体经济健康的担忧。预计2026年2月将进一步修正。这些变化具有重大的政治和经济影响，尤其是在美联储利率政策方面。"
  },
  {
    "id": "45182657",
    "title": "US HS students lose ground in math and reading, continuing yearslong decline",
    "url": "https://apnews.com/article/naep-reading-math-scores-12th-grade-c18d6e3fbc125f12948cc70cb85a520a",
    "summary": "Here's a summary of the AP News article based on the title:\n\nThe AP News article reports that US high school students have continued a years-long decline in math and reading scores. The recent NAEP (National Assessment of Educational Progress) results for 12th graders show a further drop in these core subjects, indicating a concerning trend. This decline builds upon previous years' results, suggesting systemic issues affecting the academic performance of graduating high school students. While the article title doesn't specify the direct cause, it implies a continuation of existing problems within the education system. The decline in both math and reading proficiency raises concerns about college readiness and future workforce preparedness of graduating high schoolers. The article likely explores the implications of these findings and may delve into potential contributing factors such as curriculum changes, teacher shortages, the impact of the pandemic, or broader socioeconomic trends. Ultimately, the key takeaway is that American high school seniors are demonstrably less proficient in math and reading compared to previous generations, according to the latest national assessment data.\n",
    "chinese_title": "美国高中生数学和阅读成绩下滑，延续多年颓势。",
    "chinese_summary": "美高中生数理读写能力持续下降"
  },
  {
    "id": "45183347",
    "title": "Anthropic endorses California's AI safety bill, SB 53",
    "url": "https://techcrunch.com/2025/09/08/anthropic-endorses-californias-ai-safety-bill-sb-53/",
    "summary": "Anthropic has endorsed California's SB 53, a bill that would impose transparency requirements on large AI model developers. This is a significant win for the bill, as it faces opposition from tech groups like the CTA and Chamber for Progress. SB 53 would require frontier AI companies like OpenAI, Anthropic, and Google to develop safety frameworks and release public safety reports before deploying powerful AI models, with whistleblower protections included. The bill targets \"catastrophic risks\" like AI-assisted biological weapons creation and cyberattacks, focusing on extreme risks rather than near-term issues like deepfakes.\n\nSB 53 has faced pushback from Silicon Valley and the Trump administration, who argue it could hinder innovation. Common arguments against the bill include the claim that AI regulation should be handled at the federal level. However, Anthropic argues the tech industry cannot wait for federal action given the rapid advancement of AI. While OpenAI has expressed concerns about AI regulation potentially pushing startups out of California, SB 53 specifically targets large AI companies with significant revenue. Experts believe SB 53, a more moderate approach than previous attempts, has a good chance of passing. The bill was influenced by an expert policy panel convened by Governor Newsom. While most AI labs already have internal safety policies, SB 53 aims to codify these requirements into state law, with financial penalties for non-compliance. A previous requirement for third-party audits was removed from the bill.\n",
    "chinese_title": "Anthropic 支持加州人工智能安全法案 SB 53",
    "chinese_summary": "Anthropic 认可加州 SB 53 法案，该法案将对大型人工智能模型开发者施加透明度要求。 这对该法案来说是一个重大胜利，因为它面临着来自 CTA 和 Chamber for Progress 等科技团体的反对。 SB 53 将要求像 OpenAI、Anthropic 和 Google 这样的前沿人工智能公司在部署强大的人工智能模型之前，制定安全框架并发布公共安全报告，并包括举报人保护。 该法案针对“灾难性风险”，例如人工智能辅助的生物武器制造和网络攻击，重点关注极端风险，而不是像深度伪造这样的近期问题。\n\nSB 53 法案受到了硅谷和特朗普政府的反对，他们认为这可能会阻碍创新。 反对该法案的常见论点包括声称人工智能监管应在联邦层面处理。 然而，Anthropic 认为，鉴于人工智能的快速发展，科技行业不能等待联邦政府采取行动。 虽然 OpenAI 对人工智能监管可能将初创公司赶出加州表示担忧，但 SB 53 专门针对收入可观的大型人工智能公司。 专家认为，SB 53 比之前的尝试更为温和，因此有很大的通过机会。 该法案受到了州长纽森召集的专家政策小组的影响。 虽然大多数人工智能实验室已经制定了内部安全政策，但 SB 53 旨在将这些要求编入州法律，并对不合规行为处以经济处罚。 之前要求进行第三方审计的要求已从法案中删除。"
  },
  {
    "id": "45167625",
    "title": "AI might yet follow the path of previous technological revolutions",
    "url": "https://www.economist.com/finance-and-economics/2025/09/04/what-if-artificial-intelligence-is-just-a-normal-technology",
    "summary": "**Summary of \"AI might yet follow the path of previous technological revolutions\" (The Economist):**\n\nThe article argues that despite the current hype surrounding AI, it might ultimately follow a pattern similar to previous technological revolutions like electricity and the internet. While initially disruptive and promising massive productivity gains, these technologies often took decades to fully integrate into the economy and realize their potential.\n\nThe article suggests that the inflated expectations surrounding AI are driven by its remarkable capabilities in specific tasks. However, the actual impact on overall productivity and economic growth might be more gradual and nuanced than many currently predict. A key challenge is the integration of AI into existing business processes and workflows, which requires significant investment in complementary technologies, training, and organizational restructuring.\n\nThe article highlights the \"productivity paradox,\" where significant technological advancements don't immediately translate into measurable economic gains. This can occur because of difficulties in measuring productivity in service-based economies, the need for businesses to adapt their models, and the potential for early gains to be offset by inefficiencies in other areas.\n\nUltimately, the article suggests that AI is unlikely to be a singularity-style event that fundamentally transforms the economy overnight. Instead, it will likely be a powerful but incremental force that reshapes industries over time, requiring patience, adaptation, and strategic investment to fully unlock its potential. The article encourages a more sober and long-term perspective on AI's economic impact, learning from the lessons of previous technological revolutions.\n",
    "chinese_title": "人工智能或许会重蹈之前技术革命的覆辙。",
    "chinese_summary": "“人工智能或许仍将遵循过往技术革命的道路”（《经济学人》）摘要：\n\n文章认为，尽管目前围绕人工智能的炒作甚嚣尘上，但它最终可能遵循与电力和互联网等以往技术革命相似的模式。这些技术最初具有颠覆性并有望带来巨大的生产力提升，但往往需要数十年才能完全融入经济并实现其潜力。\n\n文章表明，围绕人工智能的过高期望是由其在特定任务中的卓越能力所驱动的。然而，对整体生产力和经济增长的实际影响可能比目前许多人预测的更为渐进和细致。一个关键挑战是将人工智能融入现有的业务流程和工作流程，这需要对配套技术、培训和组织结构调整进行大量投资。\n\n文章强调了“生产力悖论”，即重大的技术进步不会立即转化为可衡量的经济收益。这可能是因为在服务型经济中衡量生产力存在困难，企业需要调整其模式，以及早期收益可能被其他领域的效率低下所抵消。\n\n最终，文章认为人工智能不太可能是一种奇点式的事件，可以在一夜之间从根本上改变经济。相反，它可能是一种强大但渐进的力量，随着时间的推移重塑各个行业，需要耐心、适应和战略投资才能充分释放其潜力。文章鼓励对人工智能的经济影响采取更冷静和长远的视角，并从以往技术革命的经验中吸取教训。"
  },
  {
    "id": "45143927",
    "title": "Learning the soroban as an adult (2022)",
    "url": "https://github.com/whacked/cow/blob/main/learning%20the%20soroban%20as%20an%20adult.md",
    "summary": "This appears to be a webpage snippet, not a complete article about learning the soroban as an adult. It's likely from a platform like GitHub or a similar code/project sharing site. The title suggests the topic is learning the soroban (Japanese abacus) as an adult. However, the visible content doesn't provide much actual information.\n\nThe text \"whacked / cow\" is unclear without context, possibly representing file paths, project names, or some internal labeling. \"Public,\" \"Notifications,\" \"Fork,\" \"2,\" \"Star,\" and \"25\" are common elements on code-sharing platforms indicating project visibility, notification settings, forking ability (creating a copy), and the number of forks and stars (a measure of popularity/interest).\n\n**In short, the provided snippet does not contain any actual information about the process or benefits of learning the soroban as an adult. It only suggests the existence of a potential resource (likely a project or guide) related to this topic within a larger online platform.**\n",
    "chinese_title": "成年人学习算盘 (2022)",
    "chinese_summary": "这看起来像一个网页片段，而不是一篇关于成人学习算盘的完整文章。它很可能来自像GitHub这样的平台或类似的代码/项目分享网站。标题表明主题是成人学习算盘（日本算盘）。然而，可见的内容并没有提供太多实际信息。\n\n文本“whacked / cow”在没有上下文的情况下是不清楚的，可能代表文件路径、项目名称或一些内部标签。“Public”、“Notifications”、“Fork”、“2”、“Star”和“25”是代码分享平台上常见的元素，表明项目可见性、通知设置、派生能力（创建副本）以及派生和星标的数量（衡量受欢迎程度/兴趣的指标）。\n\n**简而言之，提供的片段不包含任何关于成人学习算盘的过程或益处的实际信息。它仅表明在一个更大的在线平台中存在与此主题相关的潜在资源（可能是项目或指南）。**"
  },
  {
    "id": "45145638",
    "title": "CPR in space could be made easier by chest compression machines",
    "url": "https://www.newscientist.com/article/2493803-cpr-in-space-could-be-made-easier-by-chest-compression-machines/",
    "summary": "This article discusses the challenges of performing CPR in space due to microgravity and explores the potential of using chest compression machines as a more effective alternative. Researchers from the University of Lorraine tested various CPR methods, including the current NASA handstand technique and several mechanical devices, in simulated microgravity on an Airbus A310.\n\nThe tests revealed that the best mechanical device achieved a chest compression depth of 53 millimeters, surpassing the European Resuscitation Council's recommended minimum of 50 millimeters. In contrast, the handstand method only achieved 34.5 millimeters. The research team hopes their findings will influence future guidelines on CPR in space.\n\nExperts like Aaron Parkhurst at University College London agree that the current CPR method in space is difficult and needs improvement, especially as space travel becomes more common and the risk of cardiac incidents increases due to the stress of launch and the cardiovascular effects of long-term space habitation. While NASA currently relies on manual compressions and extensive medical screening to mitigate the risk, they are closely following emerging research on CPR machines in microgravity as they prepare for future missions to the Moon and Mars.\n",
    "chinese_title": "太空心肺复苏或因胸外按压机而变得更容易",
    "chinese_summary": "本文探讨了在微重力环境下进行心肺复苏术（CPR）的挑战，并探索了使用胸外按压机作为更有效替代方案的潜力。来自洛林大学的研究人员在空客A310的模拟微重力环境中测试了各种心肺复苏方法，包括目前美国宇航局（NASA）的手倒立技术和几种机械设备。\n\n测试表明，最佳机械设备实现了53毫米的胸外按压深度，超过了欧洲复苏委员会推荐的50毫米最小值。相比之下，手倒立方法仅实现了34.5毫米。研究团队希望他们的发现能够影响未来关于太空心肺复苏术的指南。\n\n伦敦大学学院的Aaron Parkhurst等专家也认为，目前太空中的心肺复苏术方法存在困难，需要改进，尤其是在太空旅行变得越来越普遍，并且由于发射的压力和长期太空居住对心血管的影响而导致心脏事件的风险增加的情况下。虽然美国宇航局目前依靠手动按压和广泛的医疗筛查来降低风险，但他们正在密切关注微重力环境下心肺复苏机的最新研究，因为他们正在为未来的登月和火星任务做准备。"
  },
  {
    "id": "45175628",
    "title": "The Storm Hits the Art Market",
    "url": "https://news.artnet.com/market/intelligence-report-storm-2025-2684512",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "风暴席卷艺术市场",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "45167394",
    "title": "A critique of package managers",
    "url": "https://www.gingerbill.org/article/2025/09/08/package-managers-are-evil/",
    "summary": "This article critiques package managers in programming languages, arguing that they are a net-negative and should be avoided when possible. The author begins by distinguishing packages, package repositories, build systems, and package managers as separate entities, focusing their criticism on the latter.\n\nThe core argument is that package managers automate \"dependency hell\" by recursively downloading and managing dependencies, leading to projects with thousands of poorly understood dependencies. This automation, the author argues, removes the necessary manual effort of carefully selecting and managing dependencies, encouraging developers to blindly incorporate libraries and ignore potential issues.\n\nThe author highlights problems like ill-defined package concepts in languages like JavaScript, leading to package-manager-managers, and the over-reliance on third-party code without proper vetting. They draw an analogy between real-life dependencies and code dependencies, emphasizing the responsibility and potential liability that comes with each.\n\nThe article also touches on the \"Gell-Mann amnesia effect\" and evolutionary selection pressure within the programming industry, suggesting that the field is too young to have developed reliable practices.\n\nThe author advocates for manual dependency management, including vendoring specific package versions, to maintain a stable, reliable, and maintainable codebase. The central point is that not everything should be automated, especially when it leads to obscured complexity and potential problems. Finally, the author clarifies that \"evil\" is a hyperbole meant to emphasize the point.\n",
    "chinese_title": "包管理器批判",
    "chinese_summary": "本文批判编程语言中的包管理器，认为它们弊大于利，应尽可能避免使用。作者首先区分了包、包仓库、构建系统和包管理器这四个不同的实体，并将批判的重点放在后者上。\n\n核心论点是，包管理器通过递归地下载和管理依赖项，使“依赖地狱”自动化，导致项目拥有数千个理解不足的依赖项。作者认为，这种自动化消除了手动选择和管理依赖项的必要工作，鼓励开发者盲目地合并库并忽略潜在的问题。\n\n作者强调了诸如JavaScript等语言中定义不明确的包概念（导致出现了包管理器管理器），以及过度依赖未经适当审查的第三方代码等问题。他们将现实生活中的依赖关系与代码依赖关系进行类比，强调了每种依赖关系所带来的责任和潜在的责任。\n\n本文还提到了“盖尔曼失忆症效应”以及编程行业内的进化选择压力，暗示该领域还太年轻，尚未发展出可靠的实践。\n\n作者提倡手动依赖管理，包括供应商锁定特定包版本，以维护稳定、可靠且可维护的代码库。核心观点是，并非所有事情都应该自动化，尤其是在自动化会导致模糊复杂性和潜在问题的情况下。最后，作者澄清说，“邪恶”是一种夸张的说法，旨在强调其观点。"
  },
  {
    "id": "45141907",
    "title": "Why is Japan still investing in custom floating point accelerators?",
    "url": "https://www.nextplatform.com/2025/09/04/why-is-japan-still-investing-in-custom-floating-point-accelerators/",
    "summary": "This article explores Japan's continued investment in custom floating-point accelerators through the company Pezy Computing, despite the dominance of GPUs in HPC and AI. Pezy, funded by the Japanese government's NEDO, has been developing energy-efficient math accelerators for over a decade, with the latest being the Pezy-SC4s.\n\nThe article details the evolution of Pezy's SC line of accelerators, highlighting key features like the number of processor elements (PEs), clock speeds, memory, and floating-point performance. The SC4s chip boasts 2,048 PEs, HBM3 memory, and is built on a TSMC 5nm process. A unique aspect of Pezy's architecture is its SPMD approach, allowing for simpler cores and efficient utilization of resources.\n\nThe article also discusses the software stack developed by Pezy, including support for popular AI frameworks like PyTorch and models like Gemma3 and Llama3. While the SC4s shows promise in terms of performance and energy efficiency, it faces competition from Nvidia GPUs, particularly in lower-precision AI workloads.\n\nDespite Nvidia's lead, the author argues that Japan's support for Pezy serves as a strategic hedge against GPU supply constraints and maintains expertise in math accelerator design. The article concludes that while FugakuNext will likely rely heavily on GPUs, there's a compelling case for incorporating Pezy accelerators as well. The article anticipates a Pezy-SC5s with enhanced features like FP8 math.\n",
    "chinese_title": "日本为何仍在投资定制浮点加速器？",
    "chinese_summary": "尽管GPU在高性能计算和人工智能领域占据主导地位，本文探讨了日本通过Pezy Computing公司持续投资于定制浮点加速器的原因。Pezy公司由日本政府的NEDO资助，十多年来一直在开发节能的数学加速器，最新的产品是Pezy-SC4s。\n\n本文详细介绍了Pezy的SC系列加速器的演变，重点介绍了诸如处理器单元（PEs）的数量、时钟速度、内存和浮点性能等关键特性。SC4s芯片拥有2,048个PE，HBM3内存，并采用台积电5纳米工艺制造。Pezy架构的一个独特之处是其SPMD方法，可以实现更简单的内核和高效的资源利用。\n\n本文还讨论了Pezy开发的软件堆栈，包括对PyTorch等流行的AI框架以及Gemma3和Llama3等模型的支持。虽然SC4s在性能和能源效率方面显示出前景，但它面临着来自英伟达GPU的竞争，尤其是在低精度AI工作负载方面。\n\n尽管英伟达处于领先地位，但作者认为，日本对Pezy的支持是对GPU供应限制的一种战略对冲，并保持了在数学加速器设计方面的专业知识。本文最后指出，虽然富岳继任者很可能严重依赖GPU，但将Pezy加速器纳入其中也具有令人信服的理由。本文预计Pezy-SC5s将具有增强的功能，如FP8数学。"
  },
  {
    "id": "45174221",
    "title": "Ex-WhatsApp cybersecurity head says Meta endangered billions of users",
    "url": "https://www.theguardian.com/technology/2025/sep/08/meta-user-data-lawsuit-whatsapp",
    "summary": "A former WhatsApp cybersecurity executive, Attaullah Baig, is suing Meta, alleging the company disregarded critical security flaws that endangered billions of users. Baig claims that around 1,500 WhatsApp engineers had unaudited and unrestricted access to sensitive user data, including contact information and IP addresses, potentially violating a 2020 US government order. He alleges the company prioritized user growth over security, ignoring his warnings about daily account hacks and proposed fixes.\n\nBaig claims he repeatedly raised these concerns with senior executives like WhatsApp head Will Cathcart and Meta CEO Mark Zuckerberg, but faced retaliation, including negative performance reviews and eventual termination for \"poor performance.\" Before WhatsApp, Baig held cybersecurity positions at major financial institutions.\n\nMeta dismisses Baig's claims as distorted and retaliatory, citing his poor performance as the reason for his dismissal. They also point out that the Department of Labor dismissed Baig's initial complaint. However, Baig has filed complaints with federal regulators, including the Securities and Exchange Commission, and is seeking reinstatement, back pay, compensatory damages, and regulatory action against Meta. This lawsuit adds to the existing scrutiny of Meta's data protection practices following the Cambridge Analytica scandal and a resulting government settlement that remains in effect until 2040.\n",
    "chinese_title": "前WhatsApp网络安全负责人称Meta危害了数十亿用户",
    "chinese_summary": "一名前 WhatsApp 网络安全高管阿塔乌拉·贝格起诉 Meta，指控该公司无视危及数十亿用户的重大安全漏洞。贝格声称，大约 1500 名 WhatsApp 工程师未经审计且不受限制地访问敏感用户数据，包括联系信息和 IP 地址，可能违反了 2020 年美国政府的一项命令。他声称该公司优先考虑用户增长而非安全，无视了他对每日帐户黑客攻击的警告和提出的修复方案。\n\n贝格声称他多次向 WhatsApp 负责人威尔·卡斯卡特和 Meta 首席执行官马克·扎克伯格等高级管理人员提出这些担忧，但遭到了报复，包括负面绩效评估以及最终因“表现不佳”而被解雇。在加入 WhatsApp 之前，贝格曾在主要的金融机构担任网络安全职位。\n\nMeta 驳斥贝格的说法是扭曲和报复性的，并以他表现不佳作为解雇他的理由。他们还指出，劳工部驳回了贝格的最初投诉。然而，贝格已向包括证券交易委员会在内的联邦监管机构提出申诉，并寻求复职、补发工资、补偿性赔偿以及针对 Meta 的监管行动。在剑桥分析公司丑闻和由此产生的政府和解协议（该协议有效期至 2040 年）之后，这起诉讼进一步加剧了对 Meta 数据保护措施的审查。"
  },
  {
    "id": "45165684",
    "title": "Immich – High performance self-hosted photo and video management",
    "url": "https://github.com/immich-app/immich",
    "summary": "Immich is a high-performance, self-hosted photo and video management solution. It's under active development, so users should expect bugs and breaking changes and not rely on it as their sole backup. The main documentation, including installation guides, is available on immich.app.\n\nKey features include uploading, viewing, and downloading media, multi-user support with albums and shared albums, metadata view, and search by metadata, objects, faces, and CLIP. Mobile-specific features include auto-backup, selective album backup, background backup, and offline support. Web features offer administrative functions, API keys, 360-degree image display, user-defined storage structure, public sharing, and tags. Both offer raw format support, virtual scrolling, OAuth support, LivePhoto/MotionPhoto support, Archive and Favorites, a Global Map, Partner Sharing, Facial recognition and clustering, Memories, Stacked Photos, and Folder View. A demo is accessible online, with login credentials provided. The project welcomes contributions and translations.\n",
    "chinese_title": "Immich - 高性能自托管照片和视频管理",
    "chinese_summary": "Immich 是一款高性能的自托管照片和视频管理解决方案。它正处于积极开发阶段，用户应预期会出现漏洞和重大变更，不应将其作为唯一的备份方案。主要文档，包括安装指南，可在 immich.app 上找到。\n\n主要功能包括媒体上传、查看和下载，支持多用户的相册和共享相册，元数据视图，以及通过元数据、对象、面孔和 CLIP 进行搜索。移动端特定功能包括自动备份、选择性相册备份、后台备份和离线支持。Web 端功能提供管理功能、API 密钥、360 度图像显示、用户自定义存储结构、公共分享和标签。两者都提供原始格式支持、虚拟滚动、OAuth 支持、LivePhoto/MotionPhoto 支持、存档和收藏、全球地图、伙伴分享、面部识别和聚类、回忆、堆叠照片和文件夹视图。在线提供演示，并提供登录凭据。该项目欢迎贡献和翻译。"
  },
  {
    "id": "45181207",
    "title": "Intel ousts CEO of products, establishes new custom-chip design unit",
    "url": "https://www.tomshardware.com/tech-industry/intel-ousts-ceo-of-products-as-part-of-the-latest-executive-shake-up-ending-30-year-career-company-also-establishes-new-custom-chip-design-unit",
    "summary": "Intel is undergoing a major executive shake-up under its new CEO, Lip-Bu Tan, including the removal of Michelle Johnston Holthaus, the CEO of products, after a mere 10 months in the role. This is part of Tan's plan to flatten the leadership structure and make more key decisions himself. Holthaus will remain in an advisory role.\n\nTan's leadership has been controversial, marked by layoffs, the closure of the automotive division, and scrutiny over his ties to Chinese businesses. Intel is bringing in new executives, including Srinivasan Iyengar from Cadence, who will head a new central engineering division focused on developing custom silicon for external customers, potentially competing with Broadcom and Marvell. Additionally, Kevork Kechichian, formerly of ARM, will lead Intel's datacenter group.\n\nThese changes coincide with Intel receiving funding from the CHIPS Act, requiring them to give the government a 10% stake. The article suggests a turbulent period for Intel as Tan aims for a faster, leaner business, potentially redesigning the company's focus from manufacturing to also include designing chips for external clients.\n",
    "chinese_title": "英特尔撤换产品部门CEO，成立定制芯片设计部门",
    "chinese_summary": "英特尔在新任CEO谭立武领导下进行重大高层改组，包括产品部门CEO米歇尔·约翰斯顿·霍尔特豪斯在任仅10个月后被撤换。 这是谭立武旨在扁平化领导结构并亲自做出更多关键决策的计划的一部分。 霍尔特豪斯将继续担任顾问角色。\n\n谭立武的领导颇具争议，以裁员、关闭汽车部门以及对其与中国企业关系的审查为标志。 英特尔正在引入新的高管，包括来自Cadence的Srinivasan Iyengar，他将领导一个新的中央工程部门，专注于为外部客户开发定制芯片，这可能会与博通和Marvell竞争。 此外，前ARM的Kevork Kechichian将领导英特尔的数据中心集团。\n\n这些变化恰逢英特尔获得《芯片法案》的资金，需要向政府提供10%的股份。 该文章表明，在谭立武力求打造一个更快、更精简的企业之际，英特尔正处于动荡时期，并可能将公司的重点从制造业重新设计为也包括为外部客户设计芯片。"
  },
  {
    "id": "45181721",
    "title": "US high school students lose ground in math and reading, continuing decline",
    "url": "https://www.cnn.com/2025/09/09/us/student-testing-scores-drop-hnk",
    "summary": "This article reports on the concerning decline in US high school students' academic performance in math, reading, and science, based on the latest results from the National Assessment of Education Progress (NAEP). Twelfth-grade scores in math and reading have dropped to their lowest levels in over 20 years, with eighth-grade students also showing significant losses in science. These declines persist a decade before the pandemic and were exacerbated during COVID-19.\n\nThe article highlights that a growing percentage of students are failing to reach even \"basic\" proficiency levels. In 2024, 45% of high school seniors scored below \"basic\" in math, and 32% scored below \"basic\" in reading. Experts suggest that increased screen time, shortened attention spans, and a decline in reading longer texts contribute to the issue. Furthermore, the shift in English classes towards shorter texts and fewer books is also noted as a potential factor impacting reading comprehension.\n\nAchievement gaps are widening, particularly in science, reflecting growing inequality in the school system. Additionally, the gender gap in STEM fields, which had previously narrowed, has re-emerged, with girls experiencing steeper declines in scores. Inquiry-based learning activities have also decreased. While the pandemic undoubtedly played a role, the article stresses that the downward trend predates COVID-19, indicating deeper, systemic issues within the US education system.\n",
    "chinese_title": "美国高中生数学和阅读成绩下滑，持续下降",
    "chinese_summary": "本文基于国家教育进步评估（NAEP）的最新结果，报告了美国高中生在数学、阅读和科学学科成绩令人担忧的下降。十二年级学生在数学和阅读方面的成绩已降至20多年来的最低水平，八年级学生在科学方面也出现了显著下降。这些下降趋势早在疫情前十年就已存在，并在新冠疫情期间进一步加剧。\n\n文章强调，越来越多的学生甚至未能达到“基本”熟练程度。2024年，45%的高中毕业生在数学方面的得分低于“基本”水平，32%在阅读方面的得分低于“基本”水平。专家认为，屏幕时间的增加、注意力持续时间的缩短以及阅读长篇文章的减少是导致这一问题的原因。此外，英语课程转向短篇文本和减少书籍也被认为是影响阅读理解的潜在因素。\n\n成绩差距正在扩大，尤其是在科学领域，反映了学校系统中日益严重的不平等现象。此外，此前已缩小的STEM领域性别差距再次出现，女生的成绩降幅更大。探究式学习活动也有所减少。虽然疫情无疑发挥了作用，但文章强调，下降趋势早于新冠疫情，表明美国教育体系内部存在更深层次的系统性问题。"
  },
  {
    "id": "45177507",
    "title": "Byte Type: Supporting Raw Data Copies in the LLVM IR",
    "url": "https://blog.llvm.org/posts/2025-08-29-gsoc-byte-type/",
    "summary": "This article describes the addition of a byte type to the LLVM IR to address the limitations of using integer types to represent raw memory values. Currently, LLVM uses integers to represent raw bytes, which lacks pointer provenance and spreads poison values from padded memory. This leads to unsound transformations and hinders the implementation of memory-related intrinsics like `memcpy`, `memmove`, and `memcmp`.\n\nThe byte type aims to solve these problems by:\n\n*   Representing raw memory values without implicit casts.\n*   Tracking pointer provenance.\n*   Representing poison values at the bit-level.\n\nThe implementation included porting an existing prototype, adapting it for opaque pointers, and refining the design. A `bytecast` instruction was introduced to reinterpret byte values as other primitive types, with an \"exact\" version to prevent type punning between pointer and non-pointer types. This enables correct implementation of `memcpy`, `memmove`, and `memcmp` within the LLVM IR, as well as fixing existing optimizations like those performed by InstCombine and SROA. Load widening optimizations are addressed by using the `!uninit_is_nondet` flag to handle potential poison bits. Arithmetic operations, with the exception of logical shift right, and bitwise operations are disallowed on the byte type. This project also addresses concerns raised by Alive2 regarding value coercion optimizations in passes like GVN.\n",
    "chinese_title": "字节类型：支持 LLVM IR 中的原始数据拷贝",
    "chinese_summary": "本文描述了在LLVM IR中添加字节类型，以解决使用整数类型表示原始内存值的局限性。目前，LLVM使用整数来表示原始字节，这缺乏指针来源跟踪，并会将填充内存中的poison值传播出去。这导致不健全的转换，并阻碍了诸如`memcpy`、`memmove`和`memcmp`等内存相关内联函数的实现。\n\n字节类型旨在通过以下方式解决这些问题：\n\n*   表示原始内存值，无需隐式转换。\n*   跟踪指针来源。\n*   在位级别上表示poison值。\n\n该实现包括移植现有的原型、使其适应不透明指针，以及改进设计。引入了一个`bytecast`指令，用于将字节值重新解释为其他原始类型，并提供了一个“exact”版本，以防止指针类型和非指针类型之间的类型双关。这使得可以在LLVM IR中正确实现`memcpy`、`memmove`和`memcmp`，并修复现有的优化，如InstCombine和SROA执行的优化。加载扩展优化通过使用`!uninit_is_nondet`标志来处理潜在的poison位来解决。除逻辑右移之外的算术运算和按位运算在字节类型上是不允许的。该项目还解决了Alive2提出的关于GVN等pass中值强制转换优化的问题。"
  },
  {
    "id": "45174724",
    "title": "Show HN: ZeroFS, the Filesystem That Makes S3 Your Primary Storage",
    "url": "https://github.com/Barre/ZeroFS",
    "summary": "ZeroFS is a filesystem that enables S3-compatible storage to be used as primary storage, offering file-level access via NFS and 9P, and block-level access via NBD. It features always-on ChaCha20-Poly1305 encryption with compression, multi-layered caching, and compatibility with any S3-compatible storage.\n\nKey features include NFS, 9P, and NBD servers, allowing mounting as network filesystems or raw block devices. ZeroFS is POSIX compliant and undergoes rigorous testing, including ZFS pool creation and Linux kernel compilation.\n\nZeroFS supports various configurations, managed via a TOML file with environment variable substitution. It allows defining cache settings, storage backends (S3, Azure, local filesystem), and server configurations. Encryption is mandatory, with a key derived from a user-defined password, safeguarding file contents and metadata.\n\n9P is recommended for better performance and POSIX semantics, especially for durability. NBD allows for creating and managing virtual block devices dynamically, supporting TRIM/discard operations to reduce S3 storage costs.\n\nZeroFS enables geo-distributed ZFS pools across multiple S3 regions and allows the creation of storage tiers using ZFS's L2ARC, improving performance for hot data while leveraging S3's cost-effectiveness for archival. Performance benchmarks show high transaction rates for PostgreSQL when using ZeroFS with L2ARC.\n",
    "chinese_title": "展示HN：ZeroFS，让S3成为你的主要存储",
    "chinese_summary": "ZeroFS: 将 S3 兼容存储用作主存储的文件系统"
  },
  {
    "id": "45158968",
    "title": "The MacBook has a sensor that knows the exact angle of the screen hinge",
    "url": "https://twitter.com/samhenrigold/status/1964428927159382261",
    "summary": "生成摘要时出错",
    "chinese_title": "The MacBook has a sensor that knows the exact angle of the screen hinge",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45140281",
    "title": "Dark Academia Grows Up",
    "url": "https://www.publicbooks.org/dark-academia-grows-up/",
    "summary": "生成摘要时出错",
    "chinese_title": "Dark Academia Grows Up",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45163362",
    "title": "Using Claude Code to modernize a 25-year-old kernel driver",
    "url": "https://dmitrybrant.com/2025/09/07/using-claude-code-to-modernize-a-25-year-old-kernel-driver",
    "summary": "生成摘要时出错",
    "chinese_title": "Using Claude Code to modernize a 25-year-old kernel driver",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45140695",
    "title": "Interview with Geoffrey Hinton",
    "url": "https://www.ft.com/content/31feb335-4945-475e-baaa-3b880d9cf8ce",
    "summary": "生成摘要时出错",
    "chinese_title": "Interview with Geoffrey Hinton",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45170087",
    "title": "OpenWrt: A Linux OS targeting embedded devices",
    "url": "https://openwrt.org/",
    "summary": "生成摘要时出错",
    "chinese_title": "OpenWrt: A Linux OS targeting embedded devices",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45134404",
    "title": "David Walker's Paper Clip Collection",
    "url": "https://www.presentandcorrect.com/blogs/blog/david-walkers-paper-clip-collection",
    "summary": "生成摘要时出错",
    "chinese_title": "David Walker's Paper Clip Collection",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45166750",
    "title": "How RSS beat Microsoft",
    "url": "https://buttondown.com/blog/rss-vs-ice",
    "summary": "生成摘要时出错",
    "chinese_title": "How RSS beat Microsoft",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45179756",
    "title": "Show HN: Focalist – A distraction-free task app that helps you focus",
    "url": "https://www.focalist.app/",
    "summary": "生成摘要时出错",
    "chinese_title": "Show HN: Focalist – A distraction-free task app that helps you focus",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45169892",
    "title": "Job mismatch and early career success",
    "url": "https://www.nber.org/papers/w34215",
    "summary": "生成摘要时出错",
    "chinese_title": "Job mismatch and early career success",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45172376",
    "title": "Setting up local LLMs for R and Python",
    "url": "https://posit.co/blog/setting-up-local-llms-for-r-and-python/",
    "summary": "生成摘要时出错",
    "chinese_title": "Setting up local LLMs for R and Python",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45169286",
    "title": "Browser Fingerprint Detector",
    "url": "https://fingerprint.goldenowl.ai/",
    "summary": "生成摘要时出错",
    "chinese_title": "Browser Fingerprint Detector",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45167401",
    "title": "A clickable visual guide to the Rust type system",
    "url": "https://rustcurious.com/elements/",
    "summary": "生成摘要时出错",
    "chinese_title": "A clickable visual guide to the Rust type system",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45141809",
    "title": "How many SPARCs is too many SPARCs?",
    "url": "https://thejpster.org.uk/blog/blog-2025-08-20/",
    "summary": "生成摘要时出错",
    "chinese_title": "How many SPARCs is too many SPARCs?",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45176580",
    "title": "The MCP Registry",
    "url": "http://blog.modelcontextprotocol.io/posts/2025-09-08-mcp-registry-preview/",
    "summary": "生成摘要时出错",
    "chinese_title": "The MCP Registry",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45167534",
    "title": "ICEBlock handled my vulnerability report in the worst possible way",
    "url": "https://micahflee.com/iceblock-handled-my-vulnerability-report-in-the-worst-possible-way/",
    "summary": "生成摘要时出错",
    "chinese_title": "ICEBlock handled my vulnerability report in the worst possible way",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45142970",
    "title": "MileSan: Detecting μ-Architectural Leakage via Differential HW/SW Taint Tracking",
    "url": "https://comsec.ethz.ch/research/hardware-design-security/milesan-detecting-exploitable-microarchitectural-leakage-via-differential-hardware-software-taint-tracking/",
    "summary": "生成摘要时出错",
    "chinese_title": "MileSan: Detecting μ-Architectural Leakage via Differential HW/SW Taint Tracking",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45130433",
    "title": "We Rarely Lose Technology (2023)",
    "url": "https://www.hopefulmons.com/p/we-rarely-lose-technology",
    "summary": "生成摘要时出错",
    "chinese_title": "We Rarely Lose Technology (2023)",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45174033",
    "title": "Multiple undersea cable cuts in the Red Sea",
    "url": "https://subseacables.blogspot.com/2025/09/here-we-go-again-several-major-cables.html",
    "summary": "生成摘要时出错",
    "chinese_title": "Multiple undersea cable cuts in the Red Sea",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45124560",
    "title": "How many dimensions is this?",
    "url": "https://lcamtuf.substack.com/p/how-many-dimensions-is-this",
    "summary": "生成摘要时出错",
    "chinese_title": "How many dimensions is this?",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45137584",
    "title": "Building an acoustic camera with UMA-16 and Acoular",
    "url": "https://www.minidsp.com/applications/usb-mic-array/acoustic-camera-uma16",
    "summary": "生成摘要时出错",
    "chinese_title": "Building an acoustic camera with UMA-16 and Acoular",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45175815",
    "title": "Jakub and Szymon",
    "url": "https://blog.samaltman.com/jakub-and-szymon",
    "summary": "生成摘要时出错",
    "chinese_title": "Jakub and Szymon",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45184452",
    "title": "Another man gets a pig kidney as transplant trials are poised to start",
    "url": "https://abcnews.go.com/Health/wireStory/new-hampshire-man-gets-pig-kidney-transplant-trials-125357267",
    "summary": "生成摘要时出错",
    "chinese_title": "Another man gets a pig kidney as transplant trials are poised to start",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45184452",
    "title": "Another man gets a pig kidney as transplant trials are poised to start",
    "url": "https://abcnews.go.com/Health/wireStory/new-hampshire-man-gets-pig-kidney-transplant-trials-125357267",
    "summary": "生成摘要时出错",
    "chinese_title": "Another man gets a pig kidney as transplant trials are poised to start",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45167459",
    "title": "Writing code is easy, reading it isn't",
    "url": "https://idiallo.com/blog/writing-code-is-easy-reading-is-hard",
    "summary": "生成摘要时出错",
    "chinese_title": "Writing code is easy, reading it isn't",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45177526",
    "title": "Deliberate Abstraction",
    "url": "https://entropicthoughts.com/deliberate-abstraction",
    "summary": "生成摘要时出错",
    "chinese_title": "Deliberate Abstraction",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45175588",
    "title": "Tesla market share in US drops to lowest since 2017",
    "url": "https://www.reuters.com/business/autos-transportation/tesla-market-share-us-drops-lowest-since-2017-competition-heats-up-2025-09-08/",
    "summary": "生成摘要时出错",
    "chinese_title": "Tesla market share in US drops to lowest since 2017",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45182653",
    "title": "Top Harvard Mathematician Liu Jun Leaves US for China",
    "url": "https://www.scmp.com/news/china/science/article/3324637/top-harvard-mathematician-liu-jun-leaves-us-china",
    "summary": "生成摘要时出错",
    "chinese_title": "Top Harvard Mathematician Liu Jun Leaves US for China",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45173277",
    "title": "Chat Control Must Be Stopped",
    "url": "https://www.privacyguides.org/articles/2025/09/08/chat-control-must-be-stopped/",
    "summary": "生成摘要时出错",
    "chinese_title": "Chat Control Must Be Stopped",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45171481",
    "title": "Making XML human-readable without XSLT",
    "url": "https://jakearchibald.com/2025/making-xml-human-readable-without-xslt/",
    "summary": "生成摘要时出错",
    "chinese_title": "Making XML human-readable without XSLT",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45152284",
    "title": "GPT-5 Thinking in ChatGPT (a.k.a. Research Goblin) is good at search",
    "url": "https://simonwillison.net/2025/Sep/6/research-goblin/",
    "summary": "生成摘要时出错",
    "chinese_title": "GPT-5 Thinking in ChatGPT (a.k.a. Research Goblin) is good at search",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45184003",
    "title": "South Koreans feel betrayed by workforce detentions at Georgia Hyundai plant",
    "url": "https://apnews.com/article/south-korea-us-georgia-raid-hyundai-24d990562f5ac20e7d3e983a77a4f7ff",
    "summary": "生成摘要时出错",
    "chinese_title": "South Koreans feel betrayed by workforce detentions at Georgia Hyundai plant",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45163043",
    "title": "Formatting code should be unnecessary",
    "url": "https://maxleiter.com/blog/formatting",
    "summary": "生成摘要时出错",
    "chinese_title": "Formatting code should be unnecessary",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45180917",
    "title": "Nation's Report Card shows drops in science, math and reading",
    "url": "https://www.npr.org/2025/09/09/nx-s1-5526918/nations-report-card-scores-reading-math-science-education-cuts",
    "summary": "生成摘要时出错",
    "chinese_title": "Nation's Report Card shows drops in science, math and reading",
    "chinese_summary": "生成摘要时出错"
  }
]