[
  {
    "id": "44768704",
    "title": "Why Exercise Is a Miracle Drug",
    "url": "https://www.derekthompson.org/p/the-sunday-morning-post-why-exercise",
    "summary": "Derek Thompson's \"Why Exercise Is a Miracle Drug\" argues that exercise is the most potent medical invention, superior to any drug. He cites research led by Euan Ashley at Stanford University, who found that exercise profoundly transformed nearly every tissue and molecular system in rats, impacting muscles, heart, liver, adrenal glands, fat, and the immune system. Ashley believes the effects of exercise are too broad for any single drug to replicate, improving metabolism, mitochondrial function, immunity, and providing disease protection.\n\nThe article also highlights a study in the New England Journal of Medicine demonstrating that exercise significantly improved survival rates and reduced new cancers in colon cancer patients who underwent surgery. Exercise doesn't just prevent disease, but can also help after sickness.\n\nThe article then shifts to the impact of US global health and development spending, particularly USAID. A Lancet study estimates that such funding has saved approximately 90 million lives in low-income countries over 20 years by combating HIV/AIDS, diarrheal diseases, respiratory infections, neglected tropical diseases, malaria, tuberculosis, and nutritional deficiencies. This is achieved with a program costing a very small fraction of the US national spending, making it a \"staggering return on moral investment.\"\n\nThompson concludes by advocating for continued global health spending, arguing that rich countries possess a \"sorcerer's stone\" to transform a small percentage of their wealth into millions of saved lives through simple interventions in impoverished areas. He also wonders why Medicare and Medicaid don't typically cover gym memberships.\n",
    "chinese_title": "运动为何是灵丹妙药",
    "chinese_summary": "德里克·汤普森的《为何运动是奇效药》一文指出，运动是最有效的医疗发明，胜过任何药物。他引用了斯坦福大学尤安·阿什利领导的研究，该研究发现运动深刻地改变了老鼠几乎所有组织和分子系统，影响了肌肉、心脏、肝脏、肾上腺、脂肪和免疫系统。阿什利认为，运动的效果过于广泛，任何单一药物都无法复制，它可以改善新陈代谢、线粒体功能、免疫力，并提供疾病保护。\n\n文章还强调了《新英格兰医学杂志》上的一项研究，该研究表明，手术后的结肠癌患者通过运动显著提高了生存率并减少了新癌症的发生。运动不仅可以预防疾病，还可以在患病后提供帮助。\n\n文章随后转向美国在全球健康和发展方面的支出，特别是美国国际开发署的影响。《柳叶刀》杂志的一项研究估计，此类资金在20年内通过对抗艾滋病毒/艾滋病、腹泻疾病、呼吸道感染、被忽视的热带疾病、疟疾、肺结核和营养不良，在低收入国家拯救了大约9000万人的生命。该计划的成本仅占美国国家支出的一小部分，使其成为“道德投资的惊人回报”。\n\n汤普森最后主张继续进行全球健康支出，认为富裕国家拥有一块“魔法石”，可以通过对贫困地区进行简单的干预，将一小部分财富转化为数百万条被拯救的生命。他还想知道为什么医疗保险和医疗补助通常不包括健身房会员资格。"
  },
  {
    "id": "44767555",
    "title": "The Art of Multiprocessor Programming 2nd Edition Book Club",
    "url": "https://eatonphil.com/2025-art-of-multiprocessor-programming.html",
    "summary": "This document announces a book club focused on \"The Art of Multiprocessor Programming 2nd Edition\" by Herlihy, Shavit, Luchangco, and Spear. The book club is part of the Software Internals Email Book Club and will run from August 16th to December 13th. Participants are expected to acquire the 2nd edition of the book (ISBN 9780124159501) and read each chapter before its designated discussion date.\n\nThe core of the book club is asynchronous text-based discussions via a Google Group. Participants will need a Google account to join and post. Each week, a designated \"discussion starter\" will initiate conversation with a short email reflecting on the assigned chapter, sharing personal background, and highlighting points of interest or confusion.\n\nThe schedule details the chapter to be discussed each week. Topics include mutual exclusion, concurrent objects, shared memory foundations, synchronization primitives, consensus, spin locks, monitors, linked lists, queues, stacks, sorting, hashing, skiplists, priority queues, scheduling, data parallelism, and barriers.\n\nInterested individuals are encouraged to sign up via a provided form. Feedback, questions, corrections, and ideas are welcomed via email or Twitter.\n",
    "chinese_title": "多处理器编程艺术（第二版）读书会",
    "chinese_summary": "本书社群：Herlihy等人《多处理器编程的艺术（第二版）》\n\n本文宣布成立一个读书社群，专注于研读Herlihy、Shavit、Luchangco和Spear所著的《多处理器编程的艺术（第二版）》。该读书社群是Software Internals Email Book Club的一部分，运行时间为8月16日至12月13日。参与者需要购买本书第二版（ISBN 9780124159501），并在指定的讨论日期前阅读每个章节。\n\n读书社群的核心是通过Google Group进行异步的文本讨论。参与者需要一个Google帐户才能加入和发帖。每周，指定的“讨论发起人”将通过一封简短的电子邮件来启动对话，反思指定的章节，分享个人背景，并突出显示感兴趣或困惑的点。\n\n时间表详细说明了每周要讨论的章节。主题包括互斥、并发对象、共享内存基础、同步原语、共识、自旋锁、监视器、链表、队列、堆栈、排序、哈希、跳跃表、优先级队列、调度、数据并行性和屏障。\n\n欢迎感兴趣的个人通过提供的表格注册。欢迎通过电子邮件或Twitter提供反馈、问题、更正和想法。"
  },
  {
    "id": "44767775",
    "title": "WebGPU enables local LLM in the browser. Demo site with AI chat",
    "url": "https://andreinwald.github.io/browser-llm/",
    "summary": "This article announces that WebGPU technology now enables running Large Language Models (LLMs) directly within a web browser. The core idea is to leverage the power of WebGPU, a modern web API for accessing GPU resources, to perform the computationally intensive tasks required by LLMs locally on a user's device. This eliminates the need to send data to external servers, offering potential benefits such as improved privacy, reduced latency, and the ability to function offline. The article also points to the existence of a demo site showcasing an AI chat application that leverages this technology. While the details are scarce, the title implies that the demo allows users to interact with an LLM-powered chatbot that operates entirely within their browser, highlighting the practical implications of WebGPU for enabling accessible and privacy-focused AI experiences. The significance lies in bringing LLM capabilities closer to users, potentially democratizing access to AI and reducing reliance on cloud-based services.\n",
    "chinese_title": "WebGPU实现浏览器本地LLM。AI聊天演示站点",
    "chinese_summary": "WebGPU赋能：在浏览器中运行大型语言模型"
  },
  {
    "id": "44766508",
    "title": "We may not like what we become if A.I. solves loneliness",
    "url": "https://www.newyorker.com/magazine/2025/07/21/ai-is-about-to-solve-loneliness-thats-a-problem",
    "summary": "This article explores the complex implications of AI companions as a solution to loneliness, particularly in an increasingly isolated society. The author, a psychology professor, initially argued in favor of AI companions, suggesting they could offer valuable solace to lonely individuals. However, this view met with resistance from colleagues who fear the potential for AI to replace genuine human connection and devalue human interaction.\n\nThe article acknowledges the severity of loneliness, citing its detrimental effects on physical and mental health, and highlights the growing number of people, particularly the elderly, who experience chronic isolation. While real human interaction is ideal, the author acknowledges the scarcity of accessible and affordable human attention. Thus, AI companions emerge as a potential, albeit imperfect, solution. Studies have shown AI chatbots can sometimes provide more empathetic responses than humans, raising the possibility of therapeutic benefits.\n\nHowever, the author raises crucial concerns. If these AI companions never become conscious, solace comes with deception, maybe self-deception. Relying on AI for companionship may diminish the value of real-world connections and the capacity for independent thought fostered by solitude. The article concludes that the increasing sophistication of AI companions could make them difficult to resist, potentially transforming society in ways we may not fully understand or desire, raising ethical questions about authenticity and the nature of relationships.\n",
    "chinese_title": "如果人工智能解决了孤独，我们可能不会喜欢我们将变成的样子。",
    "chinese_summary": "人工智能伴侣：对抗孤独的复杂影响"
  },
  {
    "id": "44766718",
    "title": "Compressing Icelandic name declension patterns into a 3.27 kB trie",
    "url": "https://alexharri.com/blog/icelandic-name-declension-trie",
    "summary": "This article details a clever method for compressing Icelandic name declension patterns into a small, efficient data structure for a JavaScript library. Icelandic declension requires knowing the correct form of a name based on grammatical case (nominative, accusative, dative, genitive). The challenge is to store this information compactly.\n\nThe author uses data from the Database of Icelandic Morphology (DIM) and the Personal Names Register to build a system that can derive the correct name form for a given grammatical case. The naive approach of storing all forms directly is too large. The solution involves:\n\n1.  **Suffix Encoding:**  Representing declension patterns by storing the longest common prefix of the name and then the suffixes for each grammatical case in a comma-separated string. This eliminates redundancy.\n\n2.  **Trie Data Structure:** Storing the suffix encodings in a trie (prefix tree) data structure. The keys (names) are inserted *backwards* so names with similar suffixes are grouped together in subtrees.\n\n3.  **Trie Compression:** Compressing the trie by identifying subtrees where all leaves share the same value (suffix encoding). The subtree is then replaced by a single node with that common value.\n\nThis compression allows the trie to generalize, predicting declension patterns for names not explicitly included in the initial dataset, based on shared suffixes. This results in a small (3.27 kB) trie that accurately predicts declension patterns for a large percentage of Icelandic names. The `trieLookup` function is modified to return the last hit node in case of missing names.\n",
    "chinese_title": "将冰岛语姓名变格模式压缩成3.27kB的trie树",
    "chinese_summary": "本文详细介绍了一种巧妙的方法，用于将冰岛语姓名变格模式压缩成一个小型高效的数据结构，以供 JavaScript 库使用。冰岛语变格需要根据语法格（主格、宾格、与格、属格）来了解姓名的正确形式。挑战在于如何紧凑地存储此信息。\n\n作者使用冰岛语形态数据库 (DIM) 和个人姓名登记处的数据来构建一个系统，该系统可以推导出给定语法格的正确姓名形式。直接存储所有形式的简单方法过于庞大。解决方案包括：\n\n1.  **后缀编码：** 通过存储姓名的最长公共前缀，然后存储每个语法格的后缀（以逗号分隔的字符串），来表示变格模式。这消除了冗余。\n\n2.  **Trie 数据结构：** 将后缀编码存储在 trie（前缀树）数据结构中。键（姓名）以*相反*的顺序插入，以便具有相似后缀的姓名在子树中分组在一起。\n\n3.  **Trie 压缩：** 通过识别所有叶节点共享相同值（后缀编码）的子树来压缩 trie。然后，将子树替换为具有该公共值的单个节点。\n\n这种压缩允许 trie 进行泛化，根据共享后缀预测未明确包含在初始数据集中的姓名的变格模式。 这产生了一个小的 (3.27 kB) trie，可以准确地预测很大一部分冰岛语姓名的变格模式。`trieLookup` 函数被修改为在缺少姓名的情况下返回最后命中的节点。"
  },
  {
    "id": "44769039",
    "title": "Telo MT1",
    "url": "https://www.telotrucks.com/",
    "summary": "The TELO MT1 is an all-electric mini truck designed for urban living and weekend adventures, boasting Toyota Tacoma capability and Tesla-like efficiency in a MINI Cooper footprint. This compact pickup features a 5-foot bed with a configurable mid-partition, enabling it to accommodate 4x8 plywood sheets or up to eight passengers with a third-row seating option made possible by a storage tunnel under the bed.\n\nKey features include a secure tonneau cover, a minimalist interior design using natural fabrics, advanced safety technology, and a 350-mile range with a fast-charging battery pack. It is designed to be efficient, powerful, and suitable for both city navigation and outdoor activities.\n\nThe MT1 offers different configurations, including single and dual motor options, with the dual motor achieving 0-60 mph in 4 seconds. It comes with a payload capacity of 2,000 lbs. Dimensions are 152\" x 73\" x 66\", with a bed size of 60-96\" x 56\" x 18\". Battery range options include standard (260 miles) and long range (350 miles), with a 30-minute charge time to 80%. The company is taking pre-orders for the vehicle.\n",
    "chinese_title": "特洛 MT1",
    "chinese_summary": "TELO MT1 是一款全电动迷你卡车，专为城市生活和周末探险而设计。它拥有丰田塔科马的性能和特斯拉般的效率，却仅占MINI Cooper 的空间。这款紧凑型皮卡配备 5 英尺长的货箱，带可配置的中间隔板，可容纳 4x8 英尺的胶合板，或通过货箱下方的储物通道选装第三排座椅，最多可容纳 8 名乘客。\n\n主要特点包括安全的卷帘盖、采用天然面料的简约内饰设计、先进的安全技术以及 350 英里的续航里程和快速充电电池组。它设计高效、强大，适合城市通勤和户外活动。\n\nMT1 提供不同的配置，包括单电机和双电机选项，双电机版本可在 4 秒内实现 0-60 英里/小时的加速。有效载荷为 2,000 磅。尺寸为 152\" x 73\" x 66\"，货箱尺寸为 60-96\" x 56\" x 18\"。电池续航里程选项包括标准（260 英里）和长续航（350 英里），30 分钟即可充电至 80%。该公司正在接受该车辆的预订。"
  },
  {
    "id": "44769231",
    "title": "Great Question (YC W21) Is Hiring a VP of Engineering (Remote)",
    "url": "https://www.ycombinator.com/companies/great-question/jobs/ONBQUqe-vp-of-engineering",
    "summary": "Great Question, a Y Combinator (W21) backed Series A B2B SaaS company focused on democratizing customer research, is seeking a Director of Engineering. This remote role (US-based) pays $150k-$200k and requires 6+ years of experience and US citizen/visa status.\n\nThe Director of Engineering will report to the CTO and be responsible for scaling the engineering team, systems, and technical foundation. Key responsibilities include:\n\n*   **Delivery & Operational Excellence:** Leading delivery across multiple squads, evolving the release process, improving efficiency, and maintaining visibility.\n*   **Technical Leadership & Platform Architecture:** Upholding engineering standards, shaping architectural direction, and ensuring strategic technical decisions are documented.\n*   **People Leadership & Org Design:** Structuring teams, attracting and retaining talent, developing leaders, and defining career frameworks.\n*   **Cross-Functional Execution:** Partnering with Product, Success, and Design to align roadmaps and translate technical investments into business impact.\n*   **Culture & Strategy:** Scaling engineering culture, fostering a high-trust environment, connecting engineers to customer outcomes, and contributing to executive-level planning.\n\nThe ideal candidate has experience scaling engineering teams in high-growth B2B SaaS environments (ideally Series A to B/C), is credible with senior engineers, has a track record of hiring and coaching, and is a trusted partner to other departments. The company offers competitive salary, equity, benefits, remote work, and generous time off. The hiring process involves several interviews with founders and technical staff, followed by reference checks.\n",
    "chinese_title": "Great Question (YC W21) 正在招聘工程副总裁 (远程)",
    "chinese_summary": "Great Question (Y Combinator W21支持的A轮B2B SaaS公司，致力于普及客户研究) 正在寻找工程总监。此远程职位（位于美国）薪资为15万至20万美元，要求6年以上经验，并具备美国公民/签证身份。\n\n工程总监将向首席技术官汇报，负责扩展工程团队、系统和技术基础。主要职责包括：\n\n*   **交付与卓越运营：** 领导多个团队的交付，改进发布流程，提高效率并保持可见性。\n*   **技术领导力与平台架构：** 维护工程标准，塑造架构方向，并确保战略技术决策得到记录。\n*   **人员领导力与组织设计：** 构建团队，吸引和留住人才，培养领导者，并定义职业发展框架。\n*   **跨职能执行：** 与产品、客户成功和设计团队合作，协调路线图，并将技术投资转化为业务影响。\n*   **文化与战略：** 扩展工程文化，营造高度信任的环境，将工程师与客户成果联系起来，并为高层规划做出贡献。\n\n理想的候选人需要在高增长的B2B SaaS环境中扩展工程团队（理想情况下是A轮到B/C轮），在资深工程师中具有公信力，具有招聘和指导的记录，并且是其他部门值得信赖的合作伙伴。公司提供有竞争力的薪资、股权、福利、远程工作和慷慨的休假。招聘流程包括与创始人及技术人员的多次面试，然后进行背景调查。"
  },
  {
    "id": "44767003",
    "title": "6 Weeks of Claude Code",
    "url": "https://blog.puzzmo.com/posts/2025/07/30/six-weeks-of-claude-code/",
    "summary": "This article reflects on the transformative impact of Claude Code (an LLM code assistant) on the author's programming workflow at Puzzmo over the past six weeks. The author argues that Claude Code is revolutionizing programming, akin to the introduction of photography, by decoupling developers from writing every line of code and allowing them to focus on shaping and refining generated code.\n\nKey benefits include:\n*   **Cheaper maintenance:** Enables rapid completion of previously daunting tech debt tasks.\n*   **\"Write First, Decide Later\" approach:** Facilitates quick experimentation and exploration of ideas.\n*   **Game design collaboration:** Streamlines the process of creating and integrating prototype games, exemplified by the release of \"Missing Link.\" This presents new challenges regarding the suitability of prototype code for long-term production.\n*   **Faster Issue Triage:** LLM action attempts during issue triage provide quick first steps.\n\nThe author emphasizes that Claude Code is most effective for developers with product, technical skills, and agency. Monorepos and explicit, well-established technologies like React, GraphQL, and TypeScript enhance its performance. While traditional metrics like commits and lines of code haven't drastically changed, the perceived pace of change within the team has increased significantly. The author concludes that focusing on mastering Claude Code itself is more beneficial than chasing every new LLM trend, and framing work well is more important than the specific model. He notes Puzzmo's business is well-represented in LLM model benchmarks.\n",
    "chinese_title": "克劳德代码六周速成",
    "chinese_summary": "本文反思了 Claude Code（一种 LLM 代码助手）在过去六周内对作者在 Puzzmo 编程工作流程产生的变革性影响。作者认为，Claude Code 正在彻底改变编程，类似于摄影的引入，它使开发者不必编写每一行代码，而是专注于塑造和改进生成的代码。\n\n主要优势包括：\n*   **更低的维护成本：**能够快速完成之前令人望而却步的技术债务任务。\n*   **“先写后定”方法：** 促进快速实验和探索想法。\n*   **游戏设计协作：** 简化了创建和集成原型游戏的过程，以“Missing Link”的发布为例。 这对原型代码是否适合长期生产提出了新的挑战。\n*   **更快的 Issue 分类：** 在 Issue 分类期间，LLM 尝试操作提供了快速的第一步。\n\n作者强调，Claude Code 对具备产品、技术技能和自主性的开发者最有效。 Monorepo 和明确且完善的技术（如 React、GraphQL 和 TypeScript）可提高其性能。 虽然提交和代码行数等传统指标并未发生巨大变化，但团队内部感知到的变化速度已显著提高。 作者总结说，专注于掌握 Claude Code 本身比追逐每一个新的 LLM 趋势更有益，并且良好地构建工作比特定的模型更重要。 他指出，Puzzmo 的业务在 LLM 模型基准测试中表现良好。"
  },
  {
    "id": "44768513",
    "title": "Hiding secret codes in light protects against fake videos",
    "url": "https://news.cornell.edu/stories/2025/07/hiding-secret-codes-light-protects-against-fake-videos",
    "summary": "Cornell researchers have developed a novel \"watermarking\" technique using imperceptible light fluctuations to combat the spread of fake videos. This method hides secret codes within the lighting of scenes, which can be detected in any video captured under that light. The codes are designed to be unnoticeable to the human eye but are recorded as watermarks in the video footage.\n\nThese watermarked light sources, such as computer screens, photography lamps, and built-in lighting, contain a secret code that can be used to verify the authenticity of a video and detect any malicious editing. The watermark consists of time-stamped versions of the unmanipulated video under slightly different lighting, dubbed \"code videos.\" If a video has been altered, the manipulated sections will contradict the code videos, revealing the changes. AI-generated fake videos will produce random variations in the code videos, exposing their inauthenticity.\n\nThe researchers designed the code to resemble random variations in light, making it difficult to detect without the secret code. The system can identify gaps in footage and altered objects, which appear black in the recovered code videos. The team has successfully used multiple codes in the same scene, making it even harder to fake. While the approach works outdoors and across different skin tones, the researchers acknowledge the ongoing challenge of the misinformation arms race and the need for continuous advancements in detection techniques.\n",
    "chinese_title": "在光线中隐藏秘密代码可防止伪造视频",
    "chinese_summary": "康奈尔大学研究人员开发了一种新型“水印”技术，利用难以察觉的光线波动来对抗虚假视频的传播。该方法将秘密代码隐藏在场景的光照中，可在任何在该光线下拍摄的视频中被检测到。这些代码旨在让人眼无法察觉，但会被记录为视频素材中的水印。\n\n这些带有水印的光源，如电脑屏幕、摄影灯和内置照明，包含一个秘密代码，可用于验证视频的真实性并检测任何恶意编辑。该水印包含在略微不同的光照条件下未被篡改视频的时间戳版本，被称为“代码视频”。如果视频被篡改，被操纵的部分将与代码视频相矛盾，从而揭示更改。人工智能生成的虚假视频将在代码视频中产生随机变化，从而暴露其虚假性。\n\n研究人员将代码设计成类似于光线中的随机变化，使其在没有秘密代码的情况下难以检测。该系统可以识别镜头中的间隙和被修改的物体，这些物体在恢复的代码视频中显示为黑色。该团队已成功地在同一场景中使用多个代码，使得伪造更加困难。虽然该方法适用于户外和不同的肤色，但研究人员承认，在信息误导的军备竞赛中仍然存在挑战，并且需要不断改进检测技术。"
  },
  {
    "id": "44767959",
    "title": "The /o in Ruby regex stands for \"oh the humanity \"",
    "url": "https://jpcamara.com/2025/08/02/the-o-in-ruby-regex.html",
    "summary": "This article dives deep into the obscure and dangerous `/o` modifier in Ruby regular expressions, also known as \"interpolation mode.\" The author recounts a debugging nightmare caused by this modifier and explains its surprising behavior.\n\nThe `/o` modifier caches the regular expression after its first evaluation, meaning any interpolated values are only processed *once*, ever. This can lead to unexpected and inconsistent results, especially within instance methods, loops, or multithreaded environments. The author demonstrates how the first call to the regex determines its value for the rest of the program's lifetime, regardless of object instantiation or subsequent input.\n\nBy disassembling the code into Ruby VM bytecode and examining the `insns.def` file, the author uncovers the `once` instruction and the `vm_once_dispatch` function, which manage this caching mechanism. These internals reveal that the first thread to encounter the regex determines its value, and subsequent threads either reuse the cached value or wait for the initial evaluation.\n\nThe article further illustrates the modifier's non-deterministic behavior in multithreaded scenarios and explores a bizarre recursive example. The author concludes that the performance benefits of `/o` are outweighed by its potential for creating confounding bugs, especially as developers can easily cache the regex object themselves. Reloading the code, for example in a Rails console, is one way to force re-evaluation. The author ultimately advises against using the `/o` modifier, echoing a sentiment found even in early Perl documentation.\n",
    "chinese_title": "Ruby 正则表达式中的 /o 代表 “哦，人类啊”",
    "chinese_summary": "深入剖析 Ruby 正则表达式中晦涩且危险的 `/o` 修饰符，又称“插值模式”。作者回顾了由该修饰符引起的调试噩梦，并解释了其令人惊讶的行为。\n\n`/o` 修饰符会在首次求值后缓存正则表达式，这意味着任何插值仅处理 *一次*，仅此而已。这可能会导致意外和不一致的结果，尤其是在实例方法、循环或多线程环境中。作者演示了对正则表达式的首次调用如何决定其在程序生命周期内的值，而与对象实例化或后续输入无关。\n\n通过将代码反汇编为 Ruby VM 字节码并检查 `insns.def` 文件，作者发现了 `once` 指令和 `vm_once_dispatch` 函数，它们管理着这种缓存机制。这些内部机制揭示了第一个遇到正则表达式的线程决定其值，而后续线程要么重用缓存的值，要么等待初始求值。\n\n文章进一步说明了该修饰符在多线程场景中的非确定性行为，并探讨了一个奇怪的递归示例。作者得出结论，`/o` 的性能优势远不及它可能造成的令人困惑的错误，尤其是在开发人员可以轻松地自己缓存正则表达式对象的情况下。重新加载代码，例如在 Rails 控制台中，是强制重新求值的一种方法。作者最终建议不要使用 `/o` 修饰符，这与早期 Perl 文档中发现的观点相呼应。"
  },
  {
    "id": "44767947",
    "title": "Unikernel Guide: Build and Deploy Lightweight, Secure Apps",
    "url": "https://tallysolutions.com/technology/introduction-to-unikernel-2/",
    "summary": "This article provides a comprehensive guide to unikernels, focusing on their benefits, limitations, and practical implementation using Nanos. Unikernels are described as lightweight, single-application virtual machines that improve speed, efficiency, and security by merging the application and necessary OS components into a single executable image.\n\nThe article contrasts unikernels with traditional operating systems, highlighting how unikernels reduce overhead by eliminating unnecessary kernel functions. It details the differences between two popular unikernel implementations, Nanos and Unikraft, noting Nanos' ability to run on various cloud providers.\n\nA step-by-step guide is provided for building Nanos and its operational tool (OPS) from source code, followed by instructions on creating and deploying a Nanos image and instance on AWS. The article also demonstrates how to run Nanos locally using QEMU. Performance comparisons between Linux and Nanos, focusing on I/O operations and execution time, show Nanos achieving generally faster results.\n\nThe article highlights use cases such as lightweight microservices, embedded systems, and rapid prototyping. It also addresses challenges including developmental complexity, a limited ecosystem, debugging difficulties, and potential networking limitations.\n\nIn conclusion, unikernels offer a transformative approach to application deployment, but developers should be aware of their current limitations. As the technology evolves, unikernels have the potential to become a key tool for efficient and secure application delivery.\n",
    "chinese_title": "Unikernel指南：构建和部署轻量、安全的应用",
    "chinese_summary": "本文全面介绍了Unikernel，重点介绍了它们的优势、局限性以及使用Nanos的实际应用。Unikernel被描述为轻量级的单应用虚拟机，通过将应用程序和必要的操作系统组件合并到单个可执行镜像中，从而提高速度、效率和安全性。\n\n本文将Unikernel与传统操作系统进行了对比，强调了Unikernel通过消除不必要的内核功能来减少开销。文章详细介绍了两种流行的Unikernel实现——Nanos和Unikraft之间的差异，并指出Nanos能够在各种云提供商上运行。\n\n文章提供了从源代码构建Nanos及其操作工具(OPS)的逐步指南，然后介绍了如何在AWS上创建和部署Nanos镜像和实例。文章还演示了如何使用QEMU在本地运行Nanos。Linux和Nanos之间的性能比较（侧重于I/O操作和执行时间）表明Nanos通常能获得更快的运行结果。\n\n文章重点介绍了轻量级微服务、嵌入式系统和快速原型设计等用例。它还讨论了包括开发复杂性、有限的生态系统、调试困难以及潜在的网络限制在内的挑战。\n\n总之，Unikernel为应用程序部署提供了一种变革性的方法，但开发人员应了解其当前的局限性。随着技术的不断发展，Unikernel有潜力成为高效、安全地交付应用程序的关键工具。"
  },
  {
    "id": "44767928",
    "title": "The Rubik's Cube Perfect Scramble",
    "url": "https://www.solutionslookingforproblems.com/post/the-rubik-s-cube-perfect-scramble",
    "summary": "This article details the author's quest to find a \"perfect\" Rubik's Cube scramble, where no two squares of the same color are touching, while also adhering to several constraints: every color on every face, a limited number of same-color squares per face, no diagonal adjacencies, different patterns on each face, and no corner adjacencies across faces.\n\nFaced with an astronomical number of possible arrangements, the author developed a program to systematically generate and evaluate potential solutions. The program worked by building lists of valid corner and edge piece arrangements, pruning branches of the search tree that violated constraints. It leveraged the principles of Rubik's Cube solvability (corner and edge parity) to avoid generating unsolvable states.\n\nAfter five days of computation, the program found a single \"perfect scramble\" solution, which can be manifested in 48 unique arrangements depending on cube orientation and mirroring. The article provides the move sequences for creating and solving this perfect scramble and its mirror image.\n\nThe author reflects on potential optimizations to the program, such as multi-threading and further constraint-based pruning. They also discuss the limitations of adding more requirements, as any new constraint would either already be met or render the solution impossible without relaxing an existing one. The source code for the program is publicly available.\n",
    "chinese_title": "魔方完美打乱",
    "chinese_summary": "本文详述了作者寻找“完美”魔方打乱方案的探索过程，该方案要求没有两个相同颜色的方块相邻，同时满足若干约束条件：每个面都包含所有颜色，每个面上的同色方块数量有限制，没有对角线相邻，每个面上的图案各不相同，且跨面没有角块相邻。\n\n面对天文数字般的可能排列，作者开发了一个程序来系统地生成和评估潜在的解决方案。该程序通过构建有效的角块和棱块排列列表来工作，并剪枝违反约束条件的搜索树分支。它利用魔方可解性原理（角块和棱块奇偶性）来避免生成无法解的状态。\n\n经过五天的计算，该程序找到了一种“完美打乱”解决方案，根据魔方的方向和镜像，它可以表现为 48 种独特的排列方式。本文提供了创建和解决这种完美打乱及其镜像的步骤序列。\n\n作者反思了该程序的潜在优化方案，例如多线程和进一步基于约束的剪枝。他们还讨论了添加更多要求的局限性，因为任何新的约束要么已经满足，要么会在不放松现有约束的情况下使解决方案变得不可能。该程序的源代码已公开提供。"
  },
  {
    "id": "44767702",
    "title": "Financial Lessons from My Family's Experience with Long-Term Care Insurance",
    "url": "https://www.whitecoatinvestor.com/financial-lessons-father-long-term-care-insurance/",
    "summary": "Adam Safdi shares his family's experience navigating long-term care insurance (LTC) after his father was diagnosed with dementia. The article highlights the challenges and lessons learned in filing and obtaining claims.\n\nAfter an unsettling incident where his father wandered off, the family realized he needed constant care. Fortunately, Adam's parents had purchased LTC insurance policies years prior. The process of filing a claim proved complex, involving multiple steps: contacting the insurance company for an application, dealing with their internal evaluations despite a neurologist's diagnosis, and understanding the 90-day elimination period which only counted \"service days\" of professional care.\n\nAdam emphasizes the importance of an indemnity rider which pays a predetermined benefit regardless of the incurred expenses. He also stresses the need to meticulously track service dates, double-check the insurance company's calculations, and ensure all required documentation, including care notes, are submitted.\n\nThe article points out ongoing issues, like mislabeled invoices, that require constant vigilance. Adam highlights the invaluable assistance of their insurance agent, who helped expedite the process. Ultimately, the LTC insurance has been crucial in financially supporting his father's in-home care, allowing him to age comfortably in his own home and easing the burden of long-distance eldercare for the family. He concludes by encouraging readers to share their own experiences with aging parents and LTC insurance.\n",
    "chinese_title": "我家长期护理保险经历带来的财务教训",
    "chinese_summary": "亚当·萨夫迪分享了其父亲被诊断出患有痴呆症后，他们一家人使用长期护理保险（LTC）的经历。文章重点介绍了在申请和获得理赔过程中遇到的挑战和经验教训。\n\n在他父亲走失的一件令人不安的事件发生后，家人意识到他需要持续的照顾。幸运的是，亚当的父母多年前购买了LTC保险。理赔过程非常复杂，涉及多个步骤：联系保险公司申请，尽管有神经科医生的诊断，仍需应对他们的内部评估，以及理解90天的免赔期，而免赔期仅计算专业护理的“服务日”。\n\n亚当强调了赔偿附加条款的重要性，该条款无论发生的费用多少都会支付预定的福利。他还强调需要仔细记录服务日期，仔细核对保险公司的计算，并确保提交所有必需的文件，包括护理记录。\n\n文章指出了持续存在的问题，例如需要不断警惕的错误标记的发票。亚当强调了他们的保险经纪人提供的宝贵帮助，这有助于加快流程。最终，LTC保险在经济上为他父亲的居家护理提供了关键支持，使他能够舒适地在自己家中养老，并减轻了家人长途老年护理的负担。他最后鼓励读者分享他们自己与年迈的父母和LTC保险的经历。"
  },
  {
    "id": "44730544",
    "title": "Online Collection of Keygen Music",
    "url": "https://keygenmusic.tk",
    "summary": "Keygenmusic.tk is an online tracker music player focusing on music found in keygens, supporting .mod, .xm, .s3m, and .it formats. It's a beta version (currently β15) that has undergone numerous updates. The site provides a library of keygen music and allows users to favorite tracks. The service emphasizes that it contains no illegal content and is strictly music extracted from keygens.\n\nRecent updates include fixes for Firefox, disabling autoplay, improved styling, better icons, media key support for play/pause/next/previous, and mobile optimization. Older updates feature adding song titles, search functionality, and updates to the music packs.\n\nThe site credits various libraries, tools and individuals used in its development, including chiptune2.js, libopenmpt, emscripten, jsTabs, baron, Sergio Camalich, wothke.ch/webaudio68, Darcula color scheme, and a Shuffle on/off switcher. Development is credited to Mikhailo Onikiienko.\n\nThe website provides contact information (keygenmusic.tk{at}outlook.com) and includes information about total and tracks played. It also warns users to use Firefox if their browser doesn't support AudioContext.\n",
    "chinese_title": "注册机音乐在线收藏",
    "chinese_summary": "Keygenmusic.tk是一个在线tracker音乐播放器，专注于注册机中的音乐，支持.mod、.xm、.s3m和.it格式。它是一个测试版本（目前是β15），已经经历了多次更新。该网站提供一个注册机音乐库，并允许用户收藏曲目。该服务强调它不包含任何非法内容，严格来说是从注册机中提取的音乐。\n\n最近的更新包括修复了Firefox的问题、禁用自动播放、改进了样式、更好的图标、对播放/暂停/下一个/上一个的媒体键支持以及移动优化。较早的更新包括添加歌曲标题、搜索功能和更新音乐包。\n\n该网站感谢其开发中使用的各种库、工具和个人，包括chiptune2.js、libopenmpt、emscripten、jsTabs、baron、Sergio Camalich、wothke.ch/webaudio68、Darcula配色方案和一个随机播放开关。开发归功于Mikhailo Onikiienko。\n\n该网站提供联系信息（keygenmusic.tk{at}outlook.com），并包含有关总播放次数和曲目的信息。它还警告用户，如果他们的浏览器不支持AudioContext，请使用Firefox。"
  },
  {
    "id": "44743034",
    "title": "Caches: LRU vs. Random",
    "url": "https://danluu.com/2choices-eviction/",
    "summary": "This article explores cache eviction policies, specifically comparing Least Recently Used (LRU) with a randomized approach. It challenges the intuitive superiority of LRU, arguing that a random eviction policy can degrade more gracefully when the working set exceeds the cache size.\n\nThe author investigates \"2-random,\" where the LRU is chosen between two random cache lines. Simulations using SPEC CPU benchmarks on a Sandy Bridge-like cache hierarchy show that 2-random performs comparably to LRU, even edging it out in larger caches (L3). Analyzing individual benchmarks reveals LRU performs better with low miss rates, while 2-random excels with higher miss rates.\n\nThe article further investigates the impact of cache size and hierarchy by comparing single-level caches to hierarchical ones. Results suggest the benefits of 2-random in larger caches are not solely due to it being the last level in a hierarchy.\n\nThe author then examines pseudo-LRU and pseudo-2-random implementations, noting that pseudo-3-random (choosing the LRU of three random options) approaches the performance of true 2-random and surpasses LRU for large caches. The impact of set associativity is also explored, finding that increased associativity amplifies the performance difference between LRU and 2-random.\n\nThe conclusion posits that while LRU is beneficial in smaller caches, 2-random (or a k-random variant) becomes competitive or even superior in larger caches, potentially offering a cost-effective alternative to more complex adaptive policies. The article connects the effectiveness of k-random policies to the mathematical principle of \"The Power of Two Random Choices,\" explaining its applications in load balancing and other domains.\n",
    "chinese_title": "缓存：LRU 与随机",
    "chinese_summary": "本文探讨了缓存驱逐策略，特别比较了最近最少使用（LRU）算法与随机方法。它挑战了LRU直观上的优越性，认为当工作集超过缓存大小时，随机驱逐策略可以更平缓地降低性能。\n\n作者研究了“2-random”策略，即在两个随机缓存行中选择LRU。使用SPEC CPU基准程序在类似Sandy Bridge的缓存层次结构上的模拟表明，2-random的性能与LRU相当，甚至在更大的缓存（L3）中略胜一筹。对各个基准程序的分析表明，LRU在未命中率较低时表现更好，而2-random在高未命中率时表现出色。\n\n文章进一步研究了缓存大小和层次结构的影响，将单级缓存与分层缓存进行了比较。结果表明，2-random在较大缓存中的优势不仅仅是因为它是层次结构中的最后一级。\n\n作者随后考察了伪LRU和伪2-random的实现，指出伪3-random（在三个随机选项中选择LRU）的性能接近真正的2-random，并且在大缓存中超过LRU。文章还探讨了集合相联性的影响，发现增加相联性会放大LRU和2-random之间的性能差异。\n\n结论认为，虽然LRU在较小缓存中有利，但2-random（或k-random变体）在较大缓存中变得具有竞争力甚至更优越，可能为更复杂的自适应策略提供一种经济高效的替代方案。文章将k-random策略的有效性与“两个随机选择的力量”的数学原理联系起来，解释了其在负载平衡和其他领域的应用。"
  },
  {
    "id": "44765600",
    "title": "Microsoft is open sourcing Windows 11's UI framework",
    "url": "https://www.neowin.net/news/microsoft-is-taking-steps-to-open-sourcing-windows-11-user-interface-framework/",
    "summary": "Microsoft is taking steps toward open-sourcing WinUI, the user interface framework for Windows 11, but it's a phased approach due to the framework's complexity and deep integration with proprietary parts of the operating system. Fully open-sourcing WinUI isn't an instant process and will require disentangling it from these dependencies.\n\nThe company has outlined a four-phase plan. The initial phase focuses on increasing the frequency of mirroring internal commits to the WinUI GitHub repository, increasing transparency. The second phase will enable external developers to clone and build the repository locally, complete with setup documentation. The third phase will allow third-party contributions through pull requests and running tests locally. Finally, the goal is to make GitHub the primary hub for WinUI development, issue tracking, and community engagement, phasing out internal mirrors.\n\nMicrosoft is prioritizing security, stability, and support for existing products during this process. The open-sourcing journey will be incremental, and developers can track its progress on GitHub. In the meantime, developers can contribute by providing feedback, reporting issues, and upvoting existing feedback.\n",
    "chinese_title": "微软将开源Windows 11的UI框架。",
    "chinese_summary": "微软正逐步开源 Windows 11 的用户界面框架 WinUI，但由于该框架的复杂性及其与操作系统专有部分的深度集成，这是一个分阶段进行的方法。 完全开源 WinUI 并非一蹴而就，需要将其与这些依赖项分离。\n\n该公司已制定了一个四阶段计划。 第一阶段侧重于增加内部提交镜像到 WinUI GitHub 仓库的频率，从而提高透明度。 第二阶段将使外部开发人员能够克隆并在本地构建存储库，并提供完整的设置文档。 第三阶段将允许通过 pull request 进行第三方贡献并在本地运行测试。 最终目标是使 GitHub 成为 WinUI 开发、问题跟踪和社区参与的主要枢纽，逐步淘汰内部镜像。\n\n在此过程中，微软优先考虑安全性、稳定性以及对现有产品的支持。 开源之旅将是渐进的，开发人员可以在 GitHub 上跟踪其进展。 同时，开发人员可以通过提供反馈、报告问题和赞成现有反馈来做出贡献。"
  },
  {
    "id": "44768048",
    "title": "VSCode extension for syntax highlighting multi-line YAML strings",
    "url": "https://github.com/harrydowning/vscode-yaml-embedded-languages",
    "summary": "This VSCode extension, \"YAML Embedded Languages,\" enhances YAML files by providing syntax highlighting for code embedded within block scalars. It supports over 50 built-in languages and allows users to add support for others via the `yaml-embedded-languages.include` setting.\n\nThe extension offers flexible highlighting options: single-block highlighting using `# <language-identifier>` comments next to the block identifier, and continuous highlighting using `# yaml-embedded-languages: <language-identifier>` to highlight all subsequent blocks. Highlighting can be stopped with `# yaml-embedded-languages`.\n\nThe extension lists all valid language identifiers for built-in languages, such as \"python\" (using \"py\" or \"python\" as identifiers), \"javascript\" (\"js\" or \"javascript\"), and \"html\" (\"html\").\n\nThe `yaml-embedded-languages.include` setting lets users define custom language identifiers with regular expressions and specify TextMate scope names for accurate highlighting. The value can specify the language name (used if the language identifier is to be different) the scope name which is required and a \"stripIndent\" flag.\n\nThe extension requires no external dependencies. Known issues and contribution guidelines are available, along with release notes detailing changes.\n",
    "chinese_title": "用于语法高亮多行 YAML 字符串的 VSCode 扩展",
    "chinese_summary": "此 VSCode 扩展“YAML 嵌入语言”通过为块标量中嵌入的代码提供语法高亮来增强 YAML 文件。它支持超过 50 种内置语言，并允许用户通过 `yaml-embedded-languages.include` 设置添加对其他语言的支持。\n\n该扩展提供灵活的高亮选项：使用 `# <语言标识符>` 注释在块标识符旁边进行单块高亮，以及使用 `# yaml-embedded-languages: <语言标识符>` 进行连续高亮，以高亮所有后续块。可以使用 `# yaml-embedded-languages` 停止高亮。\n\n该扩展列出了所有内置语言的有效语言标识符，例如 \"python\"（使用 \"py\" 或 \"python\" 作为标识符）、\"javascript\"（\"js\" 或 \"javascript\"）和 \"html\"（\"html\"）。\n\n`yaml-embedded-languages.include` 设置允许用户使用正则表达式定义自定义语言标识符，并指定 TextMate 作用域名称以进行准确的高亮显示。该值可以指定语言名称（如果语言标识符不同），所需的作用域名称以及一个 \"stripIndent\" 标志。\n\n该扩展不需要外部依赖项。已知问题和贡献指南以及详细说明更改的发行说明均可用。"
  },
  {
    "id": "44768302",
    "title": "Ana Marie Cox on the Shaky Foundation of Substack as a Business",
    "url": "https://newsletter.anamariecox.com/archive/substack-did-not-see-that-coming/",
    "summary": "In her newsletter, Ana Marie Cox argues that Substack's business model is fundamentally shaky and poses a risk to journalists who rely on it. While acknowledging Substack's appeal as an accessible platform for independent writers, she contends its pursuit of becoming an \"everything app\" akin to Twitter, driven by venture capital, is unsustainable and potentially harmful.\n\nCox highlights several red flags, including Substack's struggle to secure funding at its desired valuation, its increasing reliance on polarizing content for engagement, and investment from figures like Omeed Malik, suggesting a potential shift towards ideological influence. She criticizes Substack's ambition to attract TikTok stars, arguing this move deviates from its original purpose of supporting independent journalism.\n\nCox worries that Substack's dependence on investors will lead to pressure for unsustainable growth, potentially making it vulnerable to acquisition by someone seeking to control the platform for political purposes, like Elon Musk's takeover of Twitter. This could leave journalists trapped on a platform that no longer aligns with their values, as leaving would jeopardize their income.\n\nShe advocates for journalists to explore alternative platforms and encourages support for initiatives that provide a social safety net for risky writing, emphasizing the need for collective support rather than individual hustle. Ultimately, Cox believes that while Substack offers a temporary solution, it's not a long-term answer to the challenges facing the media landscape.\n",
    "chinese_title": "Ana Marie Cox 论 Substack 作为一项业务的摇摇欲坠的基础",
    "chinese_summary": "在她的时事通讯中，安娜·玛丽·考克斯认为Substack的商业模式从根本上是不可靠的，并对依赖它的记者构成风险。虽然承认Substack作为一个独立作家可访问的平台的吸引力，但她认为，在风险资本的驱动下，Substack追求成为像Twitter一样的“万能应用”是不可持续且可能有害的。\n\n考克斯强调了几个危险信号，包括Substack难以获得其期望估值的资金，其越来越依赖于两极分化的内容来提高参与度，以及来自奥米德·马利克等人物的投资，表明可能转向意识形态的影响。她批评Substack吸引TikTok明星的雄心，认为此举偏离了其支持独立新闻业的初衷。\n\n考克斯担心Substack对投资者的依赖将导致对不可持续增长的压力，这可能使其容易被寻求控制该平台用于政治目的的人收购，就像埃隆·马斯克收购Twitter一样。这可能会让记者们被困在一个不再符合他们价值观的平台上，因为离开会危及他们的收入。\n\n她倡导记者探索替代平台，并鼓励支持为高风险写作提供社会安全网的倡议，强调需要集体支持而不是个人奋斗。最终，考克斯认为，虽然Substack提供了一个临时的解决方案，但它并不是解决媒体行业所面临挑战的长期答案。"
  },
  {
    "id": "44762959",
    "title": "Cerebras Code",
    "url": "https://www.cerebras.ai/blog/introducing-cerebras-code",
    "summary": "Cerebras is launching Cerebras Code, a service designed to accelerate AI coding with the open-weight coding model Qwen3-Coder, offering speeds up to 2,000 tokens per second and a 131k-token context window. The service avoids proprietary IDE lock-in and weekly limits.\n\nThe core advantage is near-instant code generation, crucial for complex agentic workflows that involve multiple LLM calls. Qwen3-Coder, a 480B parameter model from Alibaba, rivals Claude Sonnet 4 and GPT-4.1 in coding and agentic tasks.\n\nCerebras Code supports OpenAI-compatible inference endpoints, allowing users to integrate it with existing code editors and tools like Cursor and Continue.dev without extra setup.\n\nTwo subscription plans are available:\n\n*   **Cerebras Code Pro ($50/month):** Up to 1,000 messages per day, suitable for individual developers and simpler projects.\n*   **Cerebras Code Max ($200/month):** Up to 5,000 messages per day, intended for full-time development, IDE integrations, code refactoring, and multi-agent systems.\n\nBoth plans are available immediately without a waitlist, allowing users to sign up and start coding instantly.\n",
    "chinese_title": "塞雷布拉斯代码",
    "chinese_summary": "Cerebras推出Cerebras Code，该服务旨在通过开放权重编码模型Qwen3-Coder加速AI编码，提供高达每秒2000个token的速度和131k-token上下文窗口。该服务避免了专有IDE锁定和每周限制。\n\n核心优势是近乎即时的代码生成，这对于涉及多个LLM调用的复杂代理工作流程至关重要。Qwen3-Coder是阿里巴巴推出的一个4800亿参数模型，在编码和代理任务方面可与Claude Sonnet 4和GPT-4.1相媲美。\n\nCerebras Code支持OpenAI兼容的推理端点，允许用户将其与现有的代码编辑器和Cursor、Continue.dev等工具集成，无需额外设置。\n\n提供两种订阅计划：\n\n*   **Cerebras Code Pro（50美元/月）：** 每天最多1000条消息，适合个人开发者和更简单的项目。\n*   **Cerebras Code Max（200美元/月）：** 每天最多5000条消息，适用于全职开发、IDE集成、代码重构和多代理系统。\n\n这两个计划都可以立即使用，无需等待，用户可以注册并立即开始编码。"
  },
  {
    "id": "44767488",
    "title": "Character Bitmap Graphics on the Pet 2001",
    "url": "https://www.masswerk.at/nowgobang/2025/character-bitmaps-on-the-pet2001",
    "summary": "This article explores how \"PECBM Graphics\" – a technique for displaying high-resolution graphics on the Commodore PET 2001, a machine with limited graphical capabilities – was achieved. The PET 2001 lacks a dedicated video chip, relying on character-based graphics from ROM without raster interrupts or a video buffer. Genesis Project's \"A Bright Shining Star\" demo showcased this technique by manipulating character pointers every raster line, allowing for 80-pixel wide bitmap graphics within a vertical strip.\n\nThe key is rewriting character pointers within the 64 CPU cycles allocated per scan line. By strategically altering the character displayed, taking advantage of the character ROM and even the inverted character set, the effect of higher resolution graphics can be achieved.\n\nThe article also highlights prior art: a 1980 Cursor magazine article by Glen Fisher and Dave Dixon presented a \"Hi-Res\" demo that similarly achieved character bitmap graphics on the PET 2001, manipulating the screen memory within a 9x5 character area. This early demo included a rudimentary graphics command language implemented in BASIC.\n\nThe article details the machine language routine behind the \"Hi-Res\" demo, explaining how it hijacks the system interrupt to rewrite characters during the screen rendering process. By carefully timing the memory writes, it's possible to create the illusion of higher resolution, albeit within the constraints of the PET 2001's hardware. Both demos showcase impressive ingenuity in overcoming the PET 2001's graphical limitations.\n",
    "chinese_title": "Pet 2001 上的字符位图图形",
    "chinese_summary": "本文探讨了如何在Commodore PET 2001这款图形功能有限的机器上实现“PECBM Graphics”——一种显示高分辨率图形的技术。PET 2001缺少专用的视频芯片，依赖于ROM中基于字符的图形，没有光栅中断或视频缓冲。Genesis Project的“A Bright Shining Star”演示通过每条光栅线操纵字符指针展示了这项技术，从而在垂直条带内实现了80像素宽的位图图形。\n\n关键在于在每条扫描线分配的64个CPU周期内重写字符指针。通过策略性地改变显示的字符，利用字符ROM甚至反转字符集，可以实现更高分辨率图形的效果。\n\n本文还重点介绍了先前的技术：Glen Fisher和Dave Dixon在1980年Cursor杂志上发表的一篇文章介绍了一个“Hi-Res”演示，该演示类似地在PET 2001上实现了字符位图图形，在9x5字符区域内操纵屏幕内存。这个早期的演示包含一个用BASIC实现的简陋图形命令语言。\n\n本文详细介绍了“Hi-Res”演示背后的机器语言例程，解释了它是如何劫持系统中断以在屏幕渲染过程中重写字符的。通过仔细地控制内存写入的时序，可以在PET 2001硬件的限制下，创造出更高分辨率的假象。这两个演示都展现了克服PET 2001图形限制的惊人创造力。"
  },
  {
    "id": "44741570",
    "title": "Go's race detector has a mutex blind spot",
    "url": "https://doublefree.dev/go-race-mutex-blindspot/",
    "summary": "This article discusses a specific blind spot in Go's data race detector related to mutexes. The author explains that while Go's race detector is generally effective at finding unsynchronized concurrent accesses to shared memory, it can miss races in scenarios where a mutex is involved but not consistently used to protect a shared variable.\n\nThe author presents a code example where two goroutines increment a shared counter protected by a mutex, but one goroutine performs an additional increment outside the mutex. The race detector doesn't always detect this race because it models mutex acquire/release as \"happens-before\" relationships. If the goroutine with the unguarded increment acquires the lock first, the detector correctly identifies the race. However, if the other goroutine acquires the lock first, the \"happens-before\" relationship makes the unguarded write reachable from the guarded write, causing the detector to miss the race.\n\nEssentially, the race detector's reliance on \"happens-before\" relationships established by mutexes can create blind spots when access to a shared variable isn't consistently protected by the same mutex. The author concludes that while Go's race detector is an excellent tool, understanding its limitations is crucial for ensuring race-free code. Just because the detector reports no races doesn't guarantee the absence of potential race conditions.\n",
    "chinese_title": "Go 的竞态检测器存在互斥锁盲点",
    "chinese_summary": "本文探讨了 Go 语言数据竞争检测器中一个与互斥锁相关的特定盲点。作者解释说，虽然 Go 的竞争检测器通常能有效地发现对共享内存的未同步并发访问，但在互斥锁存在但未持续用于保护共享变量的情况下，它可能会漏掉竞争。\n\n作者提供了一个代码示例，其中两个 goroutine 递增一个受互斥锁保护的共享计数器，但其中一个 goroutine 在互斥锁之外执行额外的递增操作。竞争检测器并不总是检测到这种竞争，因为它将互斥锁的获取/释放建模为 \"先发生\" 关系。如果带有无保护递增的 goroutine 首先获取锁，则检测器会正确识别出竞争。但是，如果另一个 goroutine 首先获取锁，则 \"先发生\" 关系会使无保护的写入可以从受保护的写入访问到，从而导致检测器错过竞争。\n\n本质上，当对共享变量的访问没有始终受到同一互斥锁的保护时，竞争检测器对互斥锁建立的 \"先发生\" 关系的依赖性可能会造成盲点。作者总结说，虽然 Go 的竞争检测器是一个优秀的工具，但理解其局限性对于确保无竞争代码至关重要。仅仅因为检测器报告没有竞争并不能保证不存在潜在的竞争条件。"
  },
  {
    "id": "44767125",
    "title": "ThinkPad designer David Hill spills secrets, designs that never made it",
    "url": "https://www.theregister.com/2025/08/02/thinkpad_david_hill_interview/",
    "summary": "This article interviews David Hill, a lead designer for ThinkPads between 1995 and 2017 under both IBM and Lenovo, discussing the history of the ThinkPad and some designs that never made it to market. Hill revealed he repeatedly tried to implement the \"butterfly keyboard\" from the ThinkPad 701C in later models but was unsuccessful. He also envisioned a foldable, all-in-one desktop workstation that never materialized.\n\nThe interview delves into Hill's influence on the TrackPoint, highlighting his work on refining the red cap's texture and height, and implementing the scroll button. He also discusses the ThinkLight, an overhead keyboard light he conceived, emphasizing its practicality and cost-effectiveness compared to backlights, expressing his regret that it was discontinued.\n\nHill recounts Lenovo's acquisition of ThinkPad from IBM and his efforts to prove Lenovo's commitment to the brand by creating the highly successful, thin, and light ThinkPad X300. He addresses the controversial shift from seven-row to six-row keyboards, attributing the change to evolving screen aspect ratios, while acknowledging the nostalgia for the original design. Finally, he mentions his work on the ThinkPad 25th Anniversary edition and the overwhelmingly positive response to the idea of bringing back the seven-row keyboard.\n",
    "chinese_title": "ThinkPad设计师David Hill揭秘未面世的设计",
    "chinese_summary": "本文采访了戴维·希尔，他于1995年至2017年间在IBM和联想公司担任ThinkPad的首席设计师，探讨了ThinkPad的历史以及一些未上市的设计。希尔透露，他曾多次尝试在后来的型号中实现ThinkPad 701C的“蝴蝶键盘”，但均未成功。他还设想过一种可折叠的一体式桌面工作站，但最终未能实现。\n\n采访深入探讨了希尔对TrackPoint指点杆的影响，重点介绍了他对红色指点帽的纹理和高度的改进，以及滚动按钮的实现。他还讨论了ThinkLight键盘灯，他构思了一种顶置键盘灯，强调其与背光相比的实用性和成本效益，并表达了对它停产的遗憾。\n\n希尔回忆了联想收购IBM的ThinkPad，以及他通过打造高度成功的轻薄ThinkPad X300来证明联想对该品牌承诺的努力。他谈到了从七行键盘到六行键盘的争议性转变，将这种变化归因于不断变化的屏幕宽高比，同时承认人们对原始设计的怀旧之情。最后，他提到了他在ThinkPad 25周年纪念版上的工作，以及对恢复七行键盘的想法的压倒性积极回应。"
  },
  {
    "id": "44762880",
    "title": "Coffeematic PC – A coffee maker computer that pumps hot coffee to the CPU",
    "url": "https://www.dougmacdowell.com/coffeematic-pc.html",
    "summary": "Doug MacDowell's \"Coffeematic PC\" is a unique, self-described \"nearly self-destructive\" hybrid of a retro General Electric coffee maker and a gaming computer. Built in 2024, it's part of a lineage of coffee maker computers, but distinguishes itself by using brewed Java as a cooling agent for the CPU. Hot coffee is pumped through radiators to the CPU and back to the carafe in a continuous loop, maintaining a surprisingly stable temperature equilibrium.\n\nThe computer is functional, using discarded electronics (motherboard, CPU, RAM, graphics card from the mid-2000s) combined with new hardware (SSD, power supply, cooling system) and runs on Linux Mint. MacDowell provides a detailed parts list and describes the build process as spanning different eras of technology.\n\nThe article explores the history of coffee maker computers, noting a 15-year gap between the first build in 2002 (\"The Caffeine Machine\") and the next in 2018 (\"Zotac Mekspresso\"). MacDowell speculates on the reasons for this gap, suggesting it may reflect broader trends in technology and culture. He visualized this gap in a graph, alongside a timeline of computer history, in an art exhibition called \"Sparklines,\" where he presents hand-drawn data portraits of \"artist-hackers.\" He invites readers to share knowledge of any coffee maker computers he may have missed.\n",
    "chinese_title": "Coffeematic PC – 一款向CPU泵送热咖啡的咖啡机电脑",
    "chinese_summary": "道格·麦克道威尔的“Coffeematic PC”是一款独特的、自称“近乎自毁”的复古通用电气咖啡机与游戏电脑的混合体。它建于2024年，是咖啡机电脑谱系的一部分，但其独特之处在于使用煮好的Java咖啡作为CPU的冷却剂。热咖啡通过散热器泵送到CPU，然后返回到玻璃壶中，形成一个连续的循环，从而保持令人惊讶的稳定温度平衡。\n\n这台电脑功能齐全，使用了废弃的电子元件（2000年代中期的主板、CPU、RAM、显卡）与新的硬件（SSD、电源、冷却系统）相结合，并在Linux Mint上运行。麦克道威尔提供了详细的零件清单，并将构建过程描述为跨越不同的技术时代。\n\n文章探讨了咖啡机电脑的历史，指出2002年首次构建（“咖啡因机器”）与2018年第二次构建（“Zotac Mekspresso”）之间存在15年的空白。麦克道威尔推测了造成这种空白的原因，认为它可能反映了技术和文化方面的更广泛趋势。他在名为“Sparklines”的艺术展览中，以图表的形式将这个空白与计算机历史的时间线并列，并在展览中展示了“艺术家黑客”的手绘数据肖像。他邀请读者分享他可能遗漏的任何咖啡机电脑的知识。"
  },
  {
    "id": "44744121",
    "title": "Why leather is best motorcycle protection [video]",
    "url": "https://www.youtube.com/watch?v=xwuRUcAGIEU",
    "summary": "This YouTube video, titled \"Why leather is best motorcycle protection,\" likely aims to explain the advantages of wearing leather gear while riding a motorcycle. However, the provided text snippet only contains standard YouTube footer information like copyright notices, terms of service, privacy policy, and ways to contact the platform. It offers no insight into the actual content of the video or the arguments it might present in favor of leather as motorcycle protection. Therefore, a summary of the video's content is impossible based solely on the provided text.\n",
    "chinese_title": "为什么皮革是最佳摩托车防护[视频]",
    "chinese_summary": "这段YouTube视频，标题为“为何皮革是最佳摩托车防护”，可能旨在解释骑摩托车时穿戴皮革装备的优势。然而，提供的文本片段仅包含标准的YouTube页脚信息，如版权声明、服务条款、隐私政策和联系平台的方式。它没有提供关于视频实际内容或其可能提出的支持皮革作为摩托车防护的论点的任何见解。因此，仅凭提供的文本无法总结视频的内容。"
  },
  {
    "id": "44767888",
    "title": "Iceberg, the Right Idea – The Wrong Spec – Part 2 of 2: The Spec",
    "url": "https://www.database-doctor.com/posts/iceberg-is-wrong-2.html",
    "summary": "This article critiques the Apache Iceberg specification, arguing it's a flawed approach to solving the metadata problem for large data lakes. It emphasizes the need for open formats and Parquet as a common storage format, but points out that a pile of Parquet files isn't a database table without proper metadata management, transactional control, and schema evolution.\n\nThe critique focuses on Iceberg's use of Manifest Files and Manifest Lists (in AVRO format) which contain pointers to Parquet files and metadata. The author argues this design leads to metadata bloat due to repetitive information and prevents efficient compression across files.  Specifically, adding data requires clients to write Manifest Lists containing pointers to *all* Manifest Files, burdening the client with excessive bookkeeping.\n\nThe article also claims Row Level Security is fundamentally broken as clients must access all Manifest Files, exposing the location of all S3 files.  The metadata file design, which requires listing every snapshot ever created, further exacerbates space inefficiency.\n\nFinally, the author criticizes Iceberg's optimistic concurrency control for being poorly suited to the spec's design.  Because every write repeats previous metadata, concurrent writes *always* conflict, rendering optimistic concurrency ineffective. The spec essentially uses the worst possible locking semantics for the table's metadata. The author posits that optimistic concurrency only works when the server can resolve write conflicts, which Iceberg's design inherently prevents.\n",
    "chinese_title": "冰山，正确的想法 – 错误的规范 – 第二部分，共二部分：规范",
    "chinese_summary": "本文批判了 Apache Iceberg 规范，认为它是解决大型数据湖元数据问题的一种有缺陷的方法。文章强调了开放格式和 Parquet 作为通用存储格式的必要性，但指出如果没有适当的元数据管理、事务控制和模式演变，一堆 Parquet 文件就不是数据库表。\n\n批判的重点在于 Iceberg 使用清单文件和清单列表（采用 AVRO 格式），它们包含指向 Parquet 文件和元数据的指针。作者认为这种设计会导致元数据膨胀，因为信息重复，并阻止了跨文件的高效压缩。具体来说，添加数据需要客户端编写包含指向*所有*清单文件的指针的清单列表，给客户端带来过多的簿记负担。\n\n文章还声称行级安全性从根本上被破坏，因为客户端必须访问所有清单文件，从而暴露了所有 S3 文件的位置。 元数据文件设计需要列出创建的每个快照，这进一步加剧了空间效率低下。\n\n最后，作者批评 Iceberg 的乐观并发控制，认为它不适合该规范的设计。 由于每次写入都会重复之前的元数据，因此并发写入*总是*会冲突，从而导致乐观并发失效。 该规范实际上对表的元数据使用了最糟糕的锁定语义。 作者认为，乐观并发只有在服务器可以解决写入冲突时才有效，而 Iceberg 的设计本身就阻止了这一点。"
  },
  {
    "id": "44759152",
    "title": "At 17, Hannah Cairo solved a major math mystery",
    "url": "https://www.quantamagazine.org/at-17-hannah-cairo-solved-a-major-math-mystery-20250801/",
    "summary": "This article profiles Hannah Cairo, a 17-year-old math prodigy who disproved the 40-year-old Mizohata-Takeuchi conjecture while taking a graduate course at Berkeley. Cairo, who was homeschooled, progressed rapidly through math curricula, teaching herself advanced undergraduate material by the age of 14. Feeling isolated, she sought out math communities, eventually participating in programs at Berkeley.\n\nDespite her exceptional abilities, Cairo remained humble and unsure of her talent, initially experiencing setbacks and doubts while working on the conjecture. Ultimately, she constructed a function that defied expectations, proving the conjecture false. Her work has stunned and energized the math community, inspiring new research and forcing a re-evaluation of related conjectures.\n\nThe article highlights Cairo's unconventional path, skipping high school and undergraduate studies to pursue a Ph.D. at the University of Maryland. It emphasizes her self-directed learning, perseverance, and the significant impact she has already made on the field of harmonic analysis.\n",
    "chinese_title": "17岁的汉娜·开罗解决了重要的数学谜题。",
    "chinese_summary": "本文介绍了汉娜·开罗，一位17岁的数学天才，她在伯克利修读研究生课程期间推翻了有40年历史的溝畑-竹内猜想。开罗在家自学，数学课程进展迅速，14岁时已自学了高等本科教材。由于感到孤立，她开始寻找数学社群，最终参加了伯克利的课程。\n\n尽管她拥有非凡的能力，开罗仍然谦逊，对自己的天赋缺乏自信，在研究该猜想的过程中，她最初经历了挫折和怀疑。最终，她构建了一个打破预期的函数，证明该猜想是错误的。她的工作震惊并激励了数学界，激发了新的研究，并迫使人们重新评估相关的猜想。\n\n本文着重介绍了开罗不同寻常的求学之路，她跳过了高中和本科学习，直接在马里兰大学攻读博士学位。文章强调了她的自主学习、毅力以及她已经对调和分析领域产生的重大影响。"
  },
  {
    "id": "44721932",
    "title": "JavaScript retro sound effects generator",
    "url": "https://github.grumdrig.com/jsfxr/",
    "summary": "This webpage presents jsfxr, a JavaScript-based retro sound effects generator. It's a web-based port of the original \"sfxr\" program and allows users to create classic 8-bit style sound effects directly in their browser.\n\nThe interface provides various preset sound effect types like \"Pickup/coin,\" \"Laser/shoot,\" \"Explosion,\" \"Powerup,\" \"Hit/hurt,\" \"Jump,\" and \"Blip/select,\" along with options to generate random sounds, tones, or mutate existing ones.\n\nUsers can fine-tune the sound effects using manual settings categorized into sections like \"Envelope,\" \"Frequency,\" \"Arpeggiation,\" \"Duty Cycle,\" \"Retrigger,\" \"Flanger,\" \"Low-Pass Filter,\" and \"High-Pass Filter.\" Each section contains parameters like attack time, sustain time, decay time, start frequency, slide, vibrato, cutoff frequency, and resonance, allowing for detailed customization.\n\nThe generator features a \"Play\" button to audition the created sound. Users can then save the generated sound as a .wav file by right-clicking a link and selecting \"Save As...\". The page also displays information about the generated sound, including file size, number of samples, and whether any clipping occurred. The creator is Eric Fredricksen, and the page includes a link to the source code.\n",
    "chinese_title": "JavaScript 复古音效生成器",
    "chinese_summary": "此网页展示jsfxr，一款基于JavaScript的复古音效生成器。它是原始 \"sfxr\" 程序的网页移植版，允许用户直接在浏览器中创建经典的8位风格音效。\n\n该界面提供了各种预设音效类型，如“拾取/硬币”、“激光/射击”、“爆炸”、“能量提升”、“击中/受伤”、“跳跃”和“嘟嘟声/选择”，以及生成随机声音、音调或变异现有声音的选项。\n\n用户可以使用手动设置来微调音效，这些设置分为“包络”、“频率”、“琶音”、“占空比”、“重触发”、“镶边”、“低通滤波器”和“高通滤波器”等部分。每个部分包含攻击时间、持续时间、衰减时间、起始频率、滑音、颤音、截止频率和共振等参数，从而实现详细的自定义。\n\n该生成器具有一个“播放”按钮来试听创建的声音。然后，用户可以通过右键单击链接并选择“另存为...”将生成的声音保存为 .wav 文件。该页面还显示有关生成声音的信息，包括文件大小、样本数量以及是否发生削波。创作者是 Eric Fredricksen，页面包含指向源代码的链接。"
  },
  {
    "id": "44734515",
    "title": "Weather Model based on ADS-B",
    "url": "https://obrhubr.org/adsb-weather-model",
    "summary": "Niklas Oberhuber's article discusses building a weather model using ADS-B data, which are unencrypted messages broadcast by aircraft containing information like position, heading, ground speed, and airspeed. He uses an RTL-SDR dongle and antenna to collect this data, similar to hobbyists who contribute to services like ADS-B Exchange.\n\nThe core idea is to infer wind vectors by calculating the difference between the (air speed, heading) vector and the (ground speed, track) vector from the ADS-B data. By aggregating data from thousands of aircraft, a rudimentary wind model can be created. Furthermore, temperature and pressure can be extracted to augment traditional meteorological models, improving forecasts.\n\nOberhuber used historical ADS-B data from ADS-B Exchange and implemented a particle-based model inspired by Junzi Sun's research. The model places aircraft on a grid, spawns particles around them, and updates their positions based on calculated wind vectors, creating a visualization of wind patterns.\n\nThe accuracy of the model was assessed by comparing its output with Cameron Beccario's earth-wide wind visualization, finding a reasonably close match in wind patterns and speeds, particularly in the Mediterranean region. The article demonstrates the potential of leveraging readily available ADS-B data to build a surprisingly accurate wind model, highlighting its value in weather forecasting and visualization. He also presents a final visualization mimicking the style of earth.nullschool.net.\n",
    "chinese_title": "基于ADS-B的天气模型",
    "chinese_summary": "尼古拉斯·奥伯胡贝尔的文章探讨了如何使用ADS-B数据构建天气模型。ADS-B数据是飞机广播的未加密消息，包含诸如位置、航向、地速和空速等信息。他使用RTL-SDR接收器和天线来收集这些数据，类似于为ADS-B Exchange等服务贡献数据的业余爱好者。\n\n其核心思想是通过计算ADS-B数据中（空速，航向）矢量和（地速，航迹）矢量之间的差异来推断风矢量。通过聚合来自数千架飞机的数据，可以创建一个基本的风模型。此外，还可以提取温度和压力数据来增强传统气象模型，从而改进预报。\n\n奥伯胡贝尔使用了来自ADS-B Exchange的历史ADS-B数据，并实现了一个受孙军研究启发的基于粒子的模型。该模型将飞机放置在网格上，在其周围生成粒子，并根据计算出的风矢量更新它们的位置，从而创建风向模式的可视化效果。\n\n通过将其输出与卡梅伦·贝卡里奥的全球风向可视化进行比较，评估了模型的准确性，发现风向模式和速度非常接近，尤其是在地中海地区。这篇文章证明了利用现成的ADS-B数据构建一个出人意料的精确的风模型的潜力，突出了其在天气预报和可视化方面的价值。他还展示了一个模仿earth.nullschool.net风格的最终可视化效果。"
  },
  {
    "id": "44765292",
    "title": "This Month in Ladybird",
    "url": "https://ladybird.org/newsletter/2025-07-31/",
    "summary": "This \"Month in Ladybird\" report for July 2025 highlights significant progress in the Ladybird browser project. With 319 pull requests merged from 47 contributors, the project welcomed new sponsors: Scraping Fish and Blacksmith.\n\nKey advancements include substantial progress on Web Platform Tests, adding 13,090 passing tests for a total of 1,831,856, and fixing a long-standing postMessage issue that now allows Google reCAPTCHA to pass on google.com. Ladybird now supports high refresh rates (up to 120Hz) for smoother animations and scrolling, as well as HTTP/3 via curl 8.14.0.\n\nSecurity improvements include initial support for Trusted Types to prevent XSS attacks and enhancements to how SVG foreignObject elements are handled. New CSS features like `content: url(...)`, `:state(foo)`, and `:unchecked` pseudo-classes were added, along with logical property group improvements. The implementation of `var()` and `attr()` was rewritten to align with CSS specifications. Ladybird now supports `<syntax>` parsing for attribute values and is expanding its `@property` implementation for CSS Houdini.\n\nFinally, LibJS transitioned to native UTF-16 strings internally, simplifying the implementation and preventing Unicode-related bugs. The report concludes by acknowledging the contributions of numerous individuals.\n",
    "chinese_title": "瓢虫月报",
    "chinese_summary": "2025年7月瓢虫浏览器月度报告：本月，瓢虫浏览器项目取得显著进展。共合并来自47位贡献者的319个拉取请求，并迎来新的赞助商：Scraping Fish和Blacksmith。\n\n主要进展包括Web平台测试取得实质性进展，新增13090个通过测试，总数达到1831856个，并修复了一个长期存在的postMessage问题，现在允许Google reCAPTCHA在google.com上通过。瓢虫浏览器现在支持高刷新率（高达120Hz），以实现更流畅的动画和滚动，并通过curl 8.14.0支持HTTP/3。\n\n安全改进包括对Trusted Types的初步支持，以防止XSS攻击，以及增强了SVG foreignObject元素的处理方式。新增了CSS功能，如`content: url(...)`、`:state(foo)`和`:unchecked`伪类，以及逻辑属性组的改进。`var()`和`attr()`的实现已重写，以符合CSS规范。瓢虫浏览器现在支持`<syntax>`解析属性值，并正在扩展其用于CSS Houdini的`@property`实现。\n\n最后，LibJS在内部过渡到原生UTF-16字符串，简化了实现并防止了与Unicode相关的错误。报告最后感谢众多个人的贡献。"
  },
  {
    "id": "44759417",
    "title": "I couldn't submit a PR, so I got hired and fixed it myself",
    "url": "https://www.skeptrune.com/posts/doing-the-little-things/",
    "summary": "This single-line title/content suggests a humorous and unusual anecdote about someone encountering difficulty contributing to an open-source project through a standard pull request (PR). Unable to get their contribution accepted, the individual took the extreme step of securing employment with the organization maintaining the project specifically to implement their desired fix.\n\nThe key takeaway is the dedication and resourcefulness of this person. They were so committed to resolving the issue that they went above and beyond the typical open-source contribution process. While the reasons for the PR rejection are unknown (perhaps it was a complex or controversial change), the story highlights the individual's determination to see their solution implemented, even if it meant getting hired to do so. It implies the fix was important enough to the individual to justify a significant effort and commitment.\n",
    "chinese_title": "我没法提交PR，所以干脆自己入职把它修好了。",
    "chinese_summary": "为了贡献代码，他/她竟然去这家公司上班了。"
  },
  {
    "id": "44764376",
    "title": "Hardening mode for the compiler",
    "url": "https://discourse.llvm.org/t/rfc-hardening-mode-for-the-compiler/87660",
    "summary": "This proposal outlines a plan to introduce a \"hardened mode\" in Clang to improve the safety and security of C and C++ programs. The authors argue that existing safety mechanisms are scattered, poorly documented, and not easily accessible. A hardened mode aims to unify these features under a single, user-friendly option.\n\nThe key idea is to prioritize safety and security, even if it means potentially breaking existing code. This requires setting user expectations that compiler upgrades in hardened mode might lead to breakage, viewed as a feature rather than a bug.\n\nThe proposal references GCC's `-fhardened` mode but advocates for Clang to pursue its own implementation to avoid being constrained by compatibility.\n\nThe goals of the hardened mode are to enable various `-f`, `-m`, `-D`, and `-W` flags by default, enable hardening modes for the standard library, predefine security-related macros, require explicit language standard specifications, refuse compilation against unsafe older standards, and pass linker flags like ASLR.\n\nThe proposal presents four options for implementation:\n\n1.  **Config File:** Using a configuration file shipped with Clang.\n2.  **Driver:** Introducing a new driver mode to clearly separate hardened builds.\n3.  **Orthogonal Flags:** Using separate `-fhardened`, `-mhardened`, and `-Whardened` options.\n4.  **Single Flag:** Introducing a single flag like `-fhardened` to enable everything.\n\nThe authors are seeking community feedback on the overall concept and preferred implementation approach before developing a detailed proposal with specific flags and behaviors.\n",
    "chinese_title": "编译器的强化模式",
    "chinese_summary": "本提案概述了一项在Clang中引入“强化模式”的计划，旨在提高C和C++程序的安全性和安全性。作者认为，现有的安全机制分散、缺乏文档记录且不易访问。“强化模式”旨在将这些功能统一在一个用户友好的选项下。\n\n核心思想是优先考虑安全和保障，即使这意味着可能会破坏现有代码。这需要用户明确预期，在强化模式下，编译器升级可能会导致破坏，但这应被视为一项功能，而不是缺陷。\n\n该提案参考了GCC的`-fhardened`模式，但主张Clang追求自己的实现，以避免受到兼容性的限制。\n\n强化模式的目标是默认启用各种`-f`、`-m`、`-D`和`-W`标志，启用标准库的强化模式，预定义与安全相关的宏，要求显式指定语言标准，拒绝针对不安全的旧标准进行编译，并传递诸如ASLR之类的链接器标志。\n\n该提案提出了四种实现选项：\n\n1.  **配置文件：** 使用Clang附带的配置文件。\n2.  **驱动程序：** 引入一种新的驱动程序模式，以清晰地区分强化构建。\n3.  **正交标志：** 使用单独的`-fhardened`、`-mhardened`和`-Whardened`选项。\n4.  **单个标志：** 引入诸如`-fhardened`之类的单个标志以启用所有功能。\n\n作者正在寻求社区对总体概念和首选实施方法的反馈，然后再制定包含特定标志和行为的详细提案。"
  },
  {
    "id": "44720619",
    "title": "Yearly Organiser",
    "url": "https://neatnik.net/calendar/",
    "summary": "This article presents a printable yearly calendar for 2025, designed to fit on a single sheet of paper in landscape orientation. It encourages users to print the calendar, fold it up, and use it to plan and track the passage of time throughout the year. The calendar displays all the dates for each month (Jan-Dec) in a grid format. The article emphasizes being kind to others and provides a link to the 2026 calendar and the source of the calendar by Neatnik. It also suggests disabling the header and footer in print settings for optimal results.\n",
    "chinese_title": "年度记事本",
    "chinese_summary": "本文提供一个可打印的2025年年历，设计成横向单页排布。 鼓励用户打印该日历，将其折叠起来，并用它来计划和跟踪全年的时间。 日历以网格格式显示每个月的日期（1月至12月）。 本文强调善待他人，并提供指向Neatnik的2026年日历和日历来源的链接。 此外，还建议在打印设置中禁用页眉和页脚，以获得最佳效果。"
  },
  {
    "id": "44722950",
    "title": "Ethersync: Peer-to-peer collaborative editing of local text files",
    "url": "https://github.com/ethersync/ethersync",
    "summary": "Ethersync is a tool that enables real-time collaborative editing of local text files, offering a multiplayer mode for text editors. It allows multiple users to simultaneously edit files, see each other's cursors, and work on entire projects without requiring a central server. The connections are encrypted peer-to-peer and function offline.\n\nThe tool can be installed via precompiled binaries (Linux, macOS, Android), package managers like `yay` (Arch Linux), `nix`, or `cargo`. Plugins are available for Neovim and VS Code/Codium.\n\nBasic usage involves running `ethersync share` in a directory to be shared, and others can connect using `ethersync join` followed by a generated code. Once connected, changes are synced instantly.\n\nThe project is under active development and has received funding from NLNet's NGI0 Core Fund and the Prototype Fund. It's built on Automerge, Iroh, and Magic Wormhole. Contributions are welcome, particularly small patches, and developers are encouraged to consult the plugin development guide for creating editor plugins. The project is licensed under the GNU Affero General Public License v3 or later.\n",
    "chinese_title": "以太同步：本地文本文件的点对点协同编辑",
    "chinese_summary": "Ethersync：本地文本文件实时协同编辑工具，支持文本编辑器多人模式。允许多用户同时编辑文件，查看彼此光标，并协作处理整个项目，无需中央服务器。连接采用端到端加密，且支持离线工作。\n\n该工具可以通过预编译二进制文件（Linux、macOS、Android）、包管理器（如`yay`(Arch Linux)、`nix`或`cargo`）安装。Neovim和VS Code/Codium有相应的插件可用。\n\n基本用法是在要共享的目录中运行`ethersync share`，其他人可以使用`ethersync join`，然后输入生成的代码进行连接。连接后，更改会立即同步。\n\n该项目正在积极开发中，并已获得NLNet的NGI0 Core Fund和Prototype Fund的资助。它基于Automerge、Iroh和Magic Wormhole构建。欢迎贡献，特别是小型补丁，鼓励开发者参考插件开发指南来创建编辑器插件。该项目基于GNU Affero General Public License v3或更高版本授权。"
  },
  {
    "id": "44767461",
    "title": "Cadence Guilty, Pays $140M for Exporting Semi Design Tools to PRC Military Uni",
    "url": "https://www.justice.gov/opa/pr/cadence-design-systems-agrees-plead-guilty-and-pay-over-140-million-unlawfully-exporting",
    "summary": "Cadence Design Systems has agreed to plead guilty and pay over $140 million in criminal and civil penalties for unlawfully exporting semiconductor design tools to the National University of Defense Technology (NUDT), a restricted Chinese military university. Between February 2015 and April 2021, Cadence and its Chinese subsidiary, Cadence China, conspired to violate export controls by providing EDA tools to NUDT through a front company, Central South CAD Center (CSCC), and Phytium Technology Co. Ltd., without obtaining the required licenses. NUDT was on the Entity List due to its use of U.S.-origin components in supercomputers supporting nuclear and military simulations.\n\nCadence admitted that its employees installed hardware at NUDT and that NUDT personnel downloaded software, with knowledge of NUDT's Entity List status. Employees concealed the true recipient from other Cadence personnel and incentivized sales through commissions.\n\nThe penalties consist of nearly $118 million in criminal fines and over $95 million in civil penalties from the Department of Commerce. The Department of Justice and BIS coordinated the penalties, crediting portions of payments to each other, resulting in a net payment of over $140 million. The resolution was reached considering Cadence's failure to voluntarily disclose the misconduct, the seriousness of the offense, and its remediation efforts, though Cadence received only partial credit for cooperation due to shortcomings in proactively disclosing information.\n",
    "chinese_title": "凯登思向中国军方大学出口半导体设计工具，认罪并支付1.4亿美元罚款",
    "chinese_summary": "Cadence设计系统公司已同意认罪并支付超过1.4亿美元的刑事和民事罚款，原因是其非法向受限的中国军事院校——国防科技大学（NUDT）出口半导体设计工具。在2015年2月至2021年4月期间，Cadence及其中国子公司Cadence China共谋违反出口管制，通过幌子公司中南CAD中心（CSCC）和飞腾技术有限公司向国防科技大学提供EDA工具，且未获得必要的许可。国防科技大学因在其支持核与军事模拟的超级计算机中使用美国原产部件而被列入实体清单。\n\nCadence承认，其员工在国防科技大学安装了硬件，国防科技大学人员下载了软件，且明知国防科技大学的实体清单地位。员工向其他Cadence人员隐瞒了真实的接收方，并通过佣金激励销售。\n\n罚款包括近1.18亿美元的刑事罚款和商务部处以的超过9500万美元的民事罚款。司法部和BIS协调了罚款，将部分付款记入对方，最终净支付超过1.4亿美元。鉴于Cadence未能自愿披露不当行为、违规行为的严重性以及其补救措施，达成了该决议，尽管Cadence因未主动披露信息而仅获得部分合作信用。"
  },
  {
    "id": "44762022",
    "title": "Does the Bitter Lesson Have Limits?",
    "url": "https://www.dbreunig.com/2025/08/01/does-the-bitter-lesson-have-limits.html",
    "summary": "This article explores the limitations of the \"Bitter Lesson,\" the idea that general AI methods leveraging computation will always outperform human-centric, knowledge-based approaches. While acknowledging the historical validity of the bitter lesson in fields like chess and computer vision, the author argues it's not universally applicable.\n\nThe author introduces the \"Garbage Can Model\" of organizational theory, highlighting the chaotic and undocumented nature of many real-world processes. This makes it difficult to apply the bitter lesson because organizations struggle to define quality outputs and provide sufficient, high-quality data for AI to learn from. Existing metrics like OKRs are often reductive and lead to \"gaming\" the system.\n\nFurthermore, the article argues that simply adding more compute isn't always practical or optimal. The example of Stockfish, a top chess program, is used. Stockfish combines clever search algorithms with a smaller, purpose-built deep learning model, rather than relying solely on massive computation like Leela, a model that strictly adheres to the bitter lesson. This allows Stockfish to achieve superior performance and run on less powerful hardware.\n\nSimilarly, the ARC-AGI-1 reasoning benchmark saw a breakout score using expensive compute, but a more recent model (HRM) achieved a comparable score with far fewer parameters by focusing on task-specific training.\n\nThe author concludes that while the bitter lesson offers valuable insights, it shouldn't prevent developers from applying custom logic or using non-general models when appropriate. Compute is a constraint, and achieving slightly less accuracy at a lower cost is often the best approach for practical applications. The ability to represent challenges as data is also essential, and this is far easier in some domains (like chess) than others (like workplace dynamics).\n",
    "chinese_title": "苦涩的教训有极限吗？",
    "chinese_summary": "本文探讨了“惨痛教训”的局限性，即利用计算的通用人工智能方法总是胜过以人为本、基于知识的方法。虽然承认惨痛教训在国际象棋和计算机视觉等领域的历史有效性，但作者认为它并非普遍适用。\n\n作者介绍了组织理论的“垃圾桶模型”，强调了许多现实世界过程的混乱和缺乏记录的性质。这使得应用惨痛教训变得困难，因为组织难以定义高质量的输出，并为人工智能学习提供充足的高质量数据。现有的诸如 OKR 之类的指标通常具有还原性，并导致“玩弄”系统。\n\n此外，文章认为简单地增加计算能力并不总是实用或最优的。以顶级国际象棋程序 Stockfish 为例，Stockfish 将巧妙的搜索算法与较小的、专门构建的深度学习模型相结合，而不是像 Leela 那样完全依赖于大规模计算，Leela 是一个严格遵循惨痛教训的模型。这使得 Stockfish 能够实现卓越的性能，并在功能较弱的硬件上运行。\n\n同样，ARC-AGI-1 推理基准测试在使用昂贵计算的情况下获得了突破性分数，但最近的模型 (HRM) 通过专注于特定任务的训练，以远少于参数的数量实现了可比的分数。\n\n作者总结说，虽然惨痛教训提供了宝贵的见解，但不应阻止开发人员在适当的时候应用自定义逻辑或使用非通用模型。计算是一种约束，以较低的成本获得略微降低的精度通常是实际应用的最佳方法。将挑战表示为数据的能力也至关重要，这在某些领域（如国际象棋）比其他领域（如工作场所动态）容易得多。"
  },
  {
    "id": "44726981",
    "title": "Aerodynamic drag in small cyclist formations: shielding the protected rider [pdf]",
    "url": "http://www.urbanphysics.net/2025_Formation_Paper_Preprint_v1.pdf",
    "summary": "This PDF document appears to be the content of a scientific article titled \"Aerodynamic drag in small cyclist formations: shielding the protected rider.\" However, the content is presented in a raw, compressed format.\n\nBased on the title, the article likely investigates how cyclists in small formations can reduce aerodynamic drag, particularly for a shielded rider. The study likely explores the benefits of drafting, where cyclists position themselves closely behind another to take advantage of reduced air resistance. It likely involves experimental or computational fluid dynamics (CFD) methods to quantify the drag reduction achieved by different formations.\n\nKey topics likely covered in the article include:\n\n*   **Aerodynamic Drag:** Explaining the concept of aerodynamic drag and its significance in cycling performance.\n*   **Cyclist Formations:** Describing various cyclist formation strategies used to minimize drag.\n*   **Shielding Effects:** Analyzing how the lead cyclist in a formation reduces drag for the rider(s) behind.\n*   **Rider Position:** The specific positioning of cyclists within the formation for optimal drag reduction (e.g., distance, lateral offset).\n*   **Experimental or CFD Methods:** Detailing the methodology used to measure or simulate aerodynamic forces.\n*   **Results and Discussion:** Presenting the findings on the aerodynamic drag reduction achieved by different cyclist formations.\n*   **Practical Implications:** Discussing the practical implications of the results for cycling teams and individual cyclists, providing insight into formation strategies and their impact on performance.\n\nDue to the unreadable nature of the provided PDF content, it's impossible to provide a more specific summary beyond these educated deductions based on the title and common knowledge of cycling aerodynamics.\n",
    "chinese_title": "小型自行车队形中的空气动力阻力：对受保护骑手的屏蔽作用 [pdf]",
    "chinese_summary": "该PDF文档似乎是题为“小型自行车队形中的空气动力阻力：保护骑手的屏蔽作用”的科学文章内容，但内容以原始压缩格式呈现。\n\n基于标题，该文章可能研究小型队形中的自行车手如何减少空气动力阻力，特别是对于受到保护的骑手。该研究可能探讨利用尾流的优势，即自行车手紧随另一位身后以减少空气阻力。它可能涉及实验或计算流体动力学（CFD）方法来量化不同队形所实现的阻力减少。\n\n文章可能涵盖的关键主题包括：\n\n*   **空气动力阻力：** 解释空气动力阻力的概念及其在自行车运动表现中的重要性。\n*   **自行车队形：** 描述用于最小化阻力的各种自行车队形策略。\n*   **屏蔽效应：** 分析队形中的领骑者如何减少后方骑手的阻力。\n*   **骑手位置：** 自行车手在队形中的具体位置，以实现最佳的阻力减少（例如，距离，横向偏移）。\n*   **实验或CFD方法：** 详细说明用于测量或模拟空气动力的方法。\n*   **结果与讨论：** 介绍不同自行车队形实现的空气动力阻力减少的发现。\n*   **实际意义：** 讨论结果对自行车队和个人自行车手的实际意义，提供对队形策略及其对表现的影响的见解。\n\n由于提供的PDF内容无法阅读，因此无法在基于标题和自行车空气动力学常识的这些有根据的推论之外提供更具体的摘要。"
  },
  {
    "id": "44719222",
    "title": "Show HN: Draw a fish and watch it swim with the others",
    "url": "https://drawafish.com",
    "summary": "This \"Show HN\" post invites users to participate in an interactive experience: drawing a fish (specifically facing right) and then watching it swim alongside other user-created fish. The title and the instruction \"Draw a Fish!\" are straightforward and emphasize the core activity. The simplicity suggests a fun and engaging project focused on user creativity and shared visual experience. The implication is that the drawn fish will be integrated into a virtual environment or simulation, creating a collaborative, evolving underwater scene populated by user-generated content. The project likely aims to be visually appealing, interactive, and community-driven, offering a novel way to showcase user creativity and create a shared virtual space.\n",
    "chinese_title": "展示HN：画条鱼，看它和其它鱼一起游泳",
    "chinese_summary": "这个“Show HN”帖子邀请用户参与一个互动体验：画一条鱼（特别是面向右侧的鱼），然后观看它与其他用户创作的鱼一起游动。标题和“画一条鱼！”的指示简单明了，强调了核心活动。这种简单性暗示着一个有趣且引人入胜的项目，专注于用户创造力和共享的视觉体验。其含义是，绘制的鱼将被整合到一个虚拟环境或模拟中，从而创建一个协作的、不断进化的水下场景，其中充满了用户生成的内容。该项目可能旨在具有视觉吸引力、互动性和社区驱动性，提供一种展示用户创造力并创建共享虚拟空间的新颖方式。"
  },
  {
    "id": "44766758",
    "title": "A.I. Researchers Are Negotiating $250 Million Pay Packages",
    "url": "https://www.nytimes.com/2025/07/31/technology/ai-researchers-nba-stars.html",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "人工智能研究人员正在谈判2.5亿美元的薪酬方案。",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "44764568",
    "title": "Robert Wilson has died",
    "url": "https://www.theartnewspaper.com/2025/08/01/robert-wilson-playwright-director-artist-obituary",
    "summary": "Robert Wilson, the influential experimental playwright, director, and artist known for his visually striking and stylised theatrical performances, has died at the age of 83 at his home in New York following a brief illness. Wilson’s career spanned six decades and involved collaborations with renowned artists like Philip Glass, Laurie Anderson, Marina Abramović, and Lady Gaga.\n\nHe gained recognition for original productions like \"Deafman Glance\" and the monumental \"Einstein on the Beach\" with Philip Glass, known for its epic length and unconventional structure. Wilson also directed adaptations of classic works. His theatrical style rejected naturalism, incorporating elements of silent film, mime, and diverse musical influences. Wilson's artistic approach often prioritized visuals, and light played a key role in creating space.\n\nBeyond theatre, Wilson was a prolific visual artist, creating drawings, sculptures, and installations. His works were exhibited at institutions worldwide, including SFMoMA, Centre Pompidou, and the Vitra Design Museum. He also designed the exhibition for a Giorgio Armani retrospective. In the 2010s, he created the \"Video Portraits\" series, featuring figures like Lady Gaga in the style of classic paintings.\n\nWilson founded the Watermill Center, an arts organization in New York, and was raised in a conservative environment. He initially studied dance to combat a stammer and later studied architecture at Pratt Institute.  Architecture remained a crucial influence on his work.\n",
    "chinese_title": "罗伯特·威尔逊去世了",
    "chinese_summary": "颇具影响力的实验戏剧家、导演和艺术家罗伯特·威尔逊，以其视觉效果惊人、风格独特的戏剧表演而闻名，因短暂疾病于纽约家中去世，享年83岁。威尔逊的职业生涯长达六十年，曾与菲利普·格拉斯、劳里·安德森、玛丽娜·阿布拉莫维奇和 Lady Gaga 等著名艺术家合作。\n\n他因《聋人一瞥》等原创作品以及与菲利普·格拉斯合作的鸿篇巨制《海滩上的爱因斯坦》而获得认可，后者以其史诗般的长度和非传统的结构而闻名。威尔逊还执导了经典作品的改编版。他的戏剧风格拒绝自然主义，融入了默片、哑剧和各种音乐元素。威尔逊的艺术手法通常以视觉效果为先，光线在创造空间方面发挥了关键作用。\n\n除了戏剧之外，威尔逊还是一位多产的视觉艺术家，创作绘画、雕塑和装置作品。他的作品曾在世界各地的机构展出，包括旧金山现代艺术博物馆、蓬皮杜中心和维特拉设计博物馆。他还为乔治·阿玛尼回顾展设计了展览。在 2010 年代，他创作了“视频肖像”系列，以古典绘画的风格描绘了 Lady Gaga 等人物。\n\n威尔逊创立了纽约的艺术组织水磨坊中心，并在保守的环境中长大。他最初学习舞蹈是为了克服口吃，后来在普拉特学院学习建筑学。建筑学仍然是他作品的重要影响因素。"
  },
  {
    "id": "44754492",
    "title": "Replacing tmux in my dev workflow",
    "url": "https://bower.sh/you-might-not-need-tmux",
    "summary": "This article details the author's transition away from tmux after 7+ years of daily use, driven by concerns about its impact on the terminal ecosystem and frustrations with issues like color rendering, scrollback, mouse selection, and lack of support for newer terminal protocols (like the kitty graphics protocol).\n\nThe author acknowledges tmux's value in providing session persistence and window management, but explores alternatives due to these limitations. They discuss basic commands like `ctrl-z`, `nohup`, and `disown`, but find them lacking.\n\nThe author experimented with lightweight alternatives like `dtach`, `abduco`, and `shpool`, all focusing on session persistence. While promising, they were found to be buggy, particularly concerning detaching from within Neovim. `shpool` emerged as the most viable option, allowing the author to create a keymap for detachment.\n\nFor window management, the author leverages their existing window managers (Ghostty and Sway+Foot) in conjunction with SSH. By configuring `ssh_config` and using `autossh`, they can seamlessly connect to and manage `shpool` sessions on a remote server via their local machine.\n\nUltimately, the author concludes that they have successfully replaced tmux, citing improved native scrollback, terminal notifications, and titles as key benefits. They acknowledge remaining issues with `shpool`, such as broken resizing in Neovim and lack of \"multiplayer\" support, but consider the trade-offs worthwhile.\n",
    "chinese_title": "在我的开发流程中替换 tmux",
    "chinese_summary": "在7+年每日使用后，本文详述了作者因担心tmux对终端生态系统的影响，以及对其颜色渲染、回滚、鼠标选择和缺乏对新型终端协议（如kitty图形协议）支持等问题的沮丧而放弃tmux的过程。\n\n作者承认tmux在提供会话持久性和窗口管理方面的价值，但由于这些限制，他们探索了替代方案。他们讨论了诸如`ctrl-z`、`nohup`和`disown`等基本命令，但发现它们不足。\n\n作者尝试了诸如`dtach`、`abduco`和`shpool`等轻量级替代方案，所有这些方案都侧重于会话持久性。虽然有希望，但他们发现这些方案存在错误，尤其是在从Neovim内部分离时。`shpool`成为最可行的选择，允许作者创建用于分离的键盘映射。\n\n对于窗口管理，作者利用他们现有的窗口管理器（Ghostty和Sway+Foot）结合SSH。通过配置`ssh_config`并使用`autossh`，他们可以通过本地计算机无缝连接和管理远程服务器上的`shpool`会话。\n\n最终，作者得出结论，他们已经成功取代了tmux，并指出改进的原生回滚、终端通知和标题是关键优势。他们承认`shpool`仍然存在问题，例如Neovim中的调整大小中断和缺乏“多人”支持，但认为这些权衡是值得的。"
  },
  {
    "id": "44762026",
    "title": "Researchers map where solar energy delivers the biggest climate payoff",
    "url": "https://www.rutgers.edu/news/researchers-map-where-solar-energy-delivers-biggest-climate-payoff",
    "summary": "This article presents two distinct research areas: one focusing on solar energy and its climate impact, and another exploring the link between internalized stress and cognitive decline in older Chinese Americans.\n\nThe title, \"Researchers map where solar energy delivers the biggest climate payoff,\" suggests that a study has been conducted to identify the geographical locations where deploying solar energy infrastructure will have the most significant positive effect on mitigating climate change. This implies the researchers considered factors like solar irradiance levels, grid infrastructure, and local carbon emissions profiles to determine the optimal locations for solar energy projects. The main point is likely to be a map or data revealing these areas and quantifying the potential climate benefits of solar deployment in each region.\n\nThe second piece of information, \"Internalizing Stress May Lead to Cognitive Decline in Older Chinese Americans,\" summarizes research suggesting a correlation between suppressing or internalizing stress and a decline in cognitive function among elderly individuals of Chinese American descent. This indicates a study that likely investigated the psychological and physiological effects of suppressed emotions and stress responses on cognitive health in this specific population. The research may highlight the importance of culturally sensitive mental health interventions and stress management techniques to potentially prevent or slow down cognitive decline in older Chinese Americans.\n",
    "chinese_title": "研究人员绘制出太阳能带来最大气候效益的地区图",
    "chinese_summary": "本文介绍了两个不同的研究领域：一个侧重于太阳能及其气候影响，另一个探索华人老年群体中内化压力与认知能力下降之间的联系。\n\n标题“研究人员绘制太阳能带来最大气候效益的地点”表明，一项研究旨在确定部署太阳能基础设施对减缓气候变化影响最大的地理位置。这意味着研究人员考虑了太阳辐射水平、电网基础设施和当地碳排放情况等因素，以确定太阳能项目的最佳位置。重点可能是一张地图或数据，揭示这些区域并量化在每个区域部署太阳能的潜在气候效益。\n\n第二条信息“内化压力可能导致华人老年群体认知能力下降”总结了一项研究，该研究表明，在美籍华人老年人中，抑制或内化压力与认知功能下降之间存在相关性。这表明一项研究可能调查了抑制情绪和压力反应对该特定人群认知健康的心理和生理影响。该研究可能强调了具有文化敏感性的心理健康干预措施和压力管理技术的重要性，以可能预防或延缓华人老年群体的认知能力下降。"
  },
  {
    "id": "44739041",
    "title": "Palo Alto Networks agrees to buy CyberArk for $25B",
    "url": "https://techcrunch.com/2025/07/30/palo-alto-networks-agrees-to-buy-cyberark-for-25-billion/",
    "summary": "Palo Alto Networks announced its plan to acquire CyberArk, an identity management and security company, for $25 billion in a mix of cash and stock. This acquisition, announced on July 30, 2025, marks Palo Alto's entry into the identity security space and is the largest acquisition in the company's history.\n\nUnder CEO Nikesh Arora, Palo Alto Networks has been on an acquisition spree, spending over $7 billion since 2018. Recent acquisitions include Dig Security, Talon Cyber Security, and Bridgecrew.\n\nThis deal is one of the largest cybersecurity acquisitions of 2025, second only to Google's acquisition of Wiz for $32 billion. The acquisition is notable because it signals Palo Alto Networks' strategic expansion into the identity security market, building upon its existing portfolio of cybersecurity solutions.\n",
    "chinese_title": "帕洛阿尔托网络公司同意以250亿美元收购CyberArk",
    "chinese_summary": "Palo Alto Networks 宣布计划以 250 亿美元的现金加股票收购身份管理和安全公司 CyberArk。 这项于 2025 年 7 月 30 日宣布的收购标志着 Palo Alto 进入身份安全领域，也是该公司历史上最大的一笔收购。\n\n在首席执行官 Nikesh Arora 的领导下，Palo Alto Networks 一直在进行收购，自 2018 年以来已花费超过 70 亿美元。 最近的收购包括 Dig Security、Talon Cyber Security 和 Bridgecrew。\n\n这笔交易是 2025 年最大的网络安全收购案之一，仅次于谷歌以 320 亿美元收购 Wiz。 这项收购引人注目，因为它标志着 Palo Alto Networks 战略性地扩展到身份安全市场，并在其现有的网络安全解决方案组合的基础上进行构建。"
  },
  {
    "id": "44762856",
    "title": "Anthropic revokes OpenAI's access to Claude",
    "url": "https://www.wired.com/story/anthropic-revokes-openais-access-to-claude/",
    "summary": "Anthropic has revoked OpenAI's API access to its Claude AI models, alleging that OpenAI violated its terms of service. Anthropic claims OpenAI was using Claude Code, its AI coding tool, to improve its upcoming GPT-5 model, which is a violation of terms preventing users from building competing products or reverse engineering Claude.\n\nOpenAI reportedly used special developer APIs to run tests on Claude, evaluating its coding, creative writing, and safety responses. This allowed OpenAI to benchmark Claude's capabilities against its own AI models and identify areas for improvement. OpenAI expressed disappointment, stating that evaluating other AI systems is industry standard for progress and safety improvements, and noted that Anthropic still has access to OpenAI's APIs.\n\nAnthropic stated they will ensure OpenAI has API access for benchmarking and safety evaluations. This isn't the first time Anthropic has restricted access; they previously revoked access for AI coding startup Windsurf due to rumors of an OpenAI acquisition. The article highlights the competitive nature of the AI industry, citing similar instances of tech companies restricting API access to competitors. Prior to cutting off OpenAI, Anthropic announced rate limits on Claude Code due to high usage and terms of service violations.\n",
    "chinese_title": "Anthropic 撤销 OpenAI 对 Claude 的访问权限",
    "chinese_summary": "Anthropic 撤销 OpenAI 对 Claude AI 模型的 API 访问权限，指控 OpenAI 违反其服务条款。Anthropic 声称 OpenAI 使用其 AI 编码工具 Claude Code 来改进其即将推出的 GPT-5 模型，这违反了禁止用户构建竞争产品或逆向工程 Claude 的条款。\n\n据报道，OpenAI 使用特殊的开发者 API 对 Claude 进行测试，评估其编码、创意写作和安全响应。这使得 OpenAI 能够将其 Claude 的能力与自己的 AI 模型进行基准测试，并找出需要改进的领域。OpenAI 对此表示失望，称评估其他 AI 系统是行业进步和安全改进的标准做法，并指出 Anthropic 仍然可以访问 OpenAI 的 API。\n\nAnthropic 表示，他们将确保 OpenAI 拥有 API 访问权限，用于基准测试和安全评估。这并非 Anthropic 首次限制访问；此前，他们因传闻 OpenAI 收购 AI 编码初创公司 Windsurf 而撤销了其访问权限。文章强调了 AI 行业的竞争性质，并引用了科技公司限制竞争对手 API 访问权限的类似案例。在切断 OpenAI 访问权限之前，Anthropic 宣布因高使用率和服务条款违规行为，对 Claude Code 实施速率限制。"
  },
  {
    "id": "44766326",
    "title": "North Korea sent me abroad to be a secret IT worker",
    "url": "https://www.bbc.com/news/articles/c15wk77zxngo",
    "summary": "This BBC article details how North Korea dispatches citizens abroad as secret IT workers to generate revenue for the regime, bypassing international sanctions. Jin-su, a defector, reveals the scheme involves using fake identities, often obtained from unsuspecting individuals in Western countries, to secure remote IT jobs primarily with US and European companies. These workers, organized in teams, remit approximately 85% of their earnings back to North Korea, contributing to an estimated $250-$600 million annually.\n\nThe practice has surged with the rise of remote work during the pandemic. While most workers aim to simply earn money, some have engaged in data theft, hacking, and extortion. US authorities have indicted several North Koreans involved in these operations.\n\nThe article highlights the difficulties in detecting these workers, who often exploit the lack of face-to-face interaction in remote work. However, hiring managers have become increasingly aware of the problem, using tactics to identify suspicious candidates. Despite the risks of defection, including potential punishment for their families back home, some workers like Jin-su have escaped, using their IT skills to build new lives. Jin-su confirms the oppressive conditions and limited freedom experienced by these workers, emphasizing the significant discrepancy between life abroad and the realities within North Korea.\n",
    "chinese_title": "朝鲜派我出国当秘密IT人员。",
    "chinese_summary": "朝鲜派遣公民海外充当秘密IT工人，绕过国际制裁为政权创收：脱北者揭露该计划利用虚假身份（通常从西方国家毫无戒心的人那里获得）来获得主要面向美国和欧洲公司的远程IT工作。这些工人以团队形式组织，将约85%的收入汇回朝鲜，每年贡献约2.5亿至6亿美元。\n\n这种做法随着疫情期间远程工作的兴起而激增。虽然大多数工人只是为了赚钱，但有些人参与了数据盗窃、黑客攻击和敲诈勒索。美国当局已起诉几名参与这些行动的朝鲜人。\n\n该文章强调了识别这些工人的困难，他们经常利用远程工作中缺乏面对面互动的特点。 然而，招聘经理们越来越意识到这个问题，并采取策略来识别可疑的候选人。 尽管存在叛逃的风险，包括其国内家人可能受到的惩罚，但像Jin-su这样的一些工人已经逃脱，并利用他们的IT技能来建立新的生活。 Jin-su证实了这些工人所经历的压迫性环境和有限的自由，强调了国外生活与朝鲜国内现实之间的巨大差异。"
  },
  {
    "id": "44754523",
    "title": "Our Farewell from Google Play",
    "url": "https://secuso.aifb.kit.edu/english/2809.php",
    "summary": "The SECUSO Research Group is discontinuing its availability of Privacy Friendly Apps on the Google Play Store, effective in 2025, after eight years of offering privacy-conscious alternatives to mainstream apps. Started in 2016 with Privacy Friendly Torchlight, the project grew to over 30 apps, achieving over 350,000 installs. The group thanks its users for their support.\n\nThe reason for the departure is the increasing effort required to maintain the apps on the Google Play Store compared to F-Droid, making it no longer feasible for a research group. While existing installations will remain functional, updates will cease, potentially leading to compatibility issues with future Android updates.\n\nSECUSO recommends users migrate to the F-Droid Store for continued support and updates, where the Privacy Friendly Apps will still be available. They have provided migration instructions to facilitate a smooth transition while preserving user data.\n",
    "chinese_title": "告别谷歌应用商店",
    "chinese_summary": "SECUSO研究组将于2025年停止在Google Play商店提供隐私友好应用，此前已提供八年注重隐私的主流应用替代品。该项目始于2016年的隐私友好手电筒，已发展到30多个应用，安装量超过35万次。该研究组感谢用户的支持。\n\n退出原因是与F-Droid相比，在Google Play商店维护应用所需的精力日益增加，对于研究组而言不再可行。虽然现有安装仍然可以正常使用，但更新将会停止，可能导致与未来的Android更新出现兼容性问题。\n\nSECUSO建议用户迁移到F-Droid商店以获得持续支持和更新，隐私友好应用仍将在那里提供。他们提供了迁移说明，以方便平稳过渡，同时保留用户数据。"
  },
  {
    "id": "44722594",
    "title": "Ferroelectric Helps Break Transistor Limits",
    "url": "https://spectrum.ieee.org/negative-capacitance-schottky-limit",
    "summary": "This article, \"Ferroelectric Helps Break Transistor Limits,\" by Katherine Bourzac, discusses a new approach using ferroelectric materials to improve the performance of Gallium Nitride (GaN) transistors. Published in SemiconductorsNews on July 28, 2025, the article highlights how negative capacitance, enabled by the ferroelectric material, can enhance GaN devices without the typical performance trade-offs often encountered in transistor design. The implication is that this innovation could lead to transistors that are more efficient and perform better than current limitations allow.\n",
    "chinese_title": "铁电助力突破晶体管极限",
    "chinese_summary": "铁电材料助力突破晶体管极限\n\n凯瑟琳·布尔扎克的文章《铁电材料助力突破晶体管极限》讨论了一种利用铁电材料提高氮化镓(GaN)晶体管性能的新方法。该文章于2025年7月28日发表在SemiconductorsNews上，重点介绍了铁电材料实现的负电容如何在没有晶体管设计中常见的性能权衡的情况下增强氮化镓器件。其意义在于，这项创新可能带来比当前限制允许的更高效、性能更好的晶体管。"
  },
  {
    "id": "44761548",
    "title": "Native Sparse Attention",
    "url": "https://aclanthology.org/2025.acl-long.1126/",
    "summary": "This paper introduces Native Sparse Attention (NSA), a novel sparse attention mechanism designed for efficient long-context modeling in next-generation language models. NSA addresses the computational limitations of standard attention mechanisms by integrating algorithmic innovations with hardware-aligned optimizations. It employs a dynamic hierarchical sparse strategy, combining coarse-grained token compression and fine-grained token selection, which helps to maintain both global context awareness and local precision.\n\nThe key innovations of NSA are twofold: first, it achieves substantial speedups through arithmetic intensity-balanced algorithm design and hardware optimizations. Second, it enables end-to-end training, reducing pretraining computation without sacrificing model performance.\n\nExperiments demonstrate that models pretrained with NSA perform comparably to or even surpass Full Attention models across various benchmarks, including general tasks, long-context tasks, and instruction-based reasoning. Furthermore, NSA achieves significant speedups over Full Attention on 64k-length sequences during decoding, forward propagation, and backward propagation, showcasing its efficiency throughout the entire model lifecycle. The paper highlights NSA's potential for efficient and effective long-context modeling, making it a promising advancement in the field.\n",
    "chinese_title": "原生稀疏注意力",
    "chinese_summary": "本文介绍原生稀疏注意力机制(NSA)，这是一种新颖的稀疏注意力机制，专为下一代语言模型中的高效长程上下文建模而设计。NSA通过将算法创新与硬件对齐优化相结合，解决了标准注意力机制的计算限制。它采用动态分层稀疏策略，结合粗粒度token压缩和细粒度token选择，有助于保持全局上下文感知和局部精度。\n\nNSA的关键创新之处在于两点：首先，它通过算术强度平衡的算法设计和硬件优化实现了显著的加速。其次，它支持端到端训练，减少了预训练计算量，且不牺牲模型性能。\n\n实验表明，使用NSA预训练的模型在各种基准测试中，包括通用任务、长程上下文任务和基于指令的推理，性能与全注意力模型相当甚至超过全注意力模型。此外，NSA在解码、前向传播和反向传播期间，在64k长度的序列上实现了相对于全注意力模型的显著加速，展示了其在整个模型生命周期中的效率。本文强调了NSA在高效且有效的长程上下文建模方面的潜力，使其成为该领域一个有希望的进步。"
  },
  {
    "id": "44764906",
    "title": "Jujutsu for Busy Devs, Part 2: \"How Do I?\"",
    "url": "https://maddie.wtf/posts/2025-07-21-jujutsu-for-busy-devs/entry/1",
    "summary": "This isn't an article, it's a bot detection message, specifically from a system called Anubis. The message explains why a user is encountering a loading screen and being asked to prove they are not a bot.\n\nHere's a summary of the key points:\n\n*   **Problem:** AI companies are aggressively scraping websites, causing downtime and making resources inaccessible to legitimate users.\n*   **Solution:** Anubis is implemented as a \"good enough\" placeholder. It uses a Proof-of-Work scheme, similar to Hashcash, to make scraping expensive for bots at scale.\n*   **Technical Explanation:** Anubis requires JavaScript to function, so users need to ensure JavaScript is enabled and that plugins like JShelter are disabled for the domain.\n*   **Long-Term Goal:** The Proof-of-Work challenge is a temporary measure while better methods for identifying headless browsers (used by bots) are developed, specifically focusing on fingerprinting methods like font rendering.\n*   **Reasoning:** The use of JavaScript and the Proof-of-Work is a necessary response to the changing dynamics of website hosting due to the behavior of AI companies. A no-JavaScript solution is in development.\n",
    "chinese_title": "忙碌开发者的柔术，第二部分：“我该怎么办？”",
    "chinese_summary": "这并非文章，而是一条机器人检测消息，具体来自名为Anubis的系统。该消息解释了用户为何遇到加载页面并被要求证明自己并非机器人。\n\n要点总结：\n\n*   **问题：** 人工智能公司正大量抓取网站数据，导致网站宕机并使合法用户无法访问资源。\n*   **解决方案：** Anubis作为一种“够用就好”的临时方案被实施。它使用类似于Hashcash的工作量证明机制，使大规模机器人抓取成本高昂。\n*   **技术解释：** Anubis需要JavaScript才能运行，因此用户需要确保JavaScript已启用，并禁用该域名的JShelter等插件。\n*   **长期目标：** 工作量证明挑战是一种临时措施，目的是在开发出更好的识别无头浏览器（机器人使用）的方法之前使用，特别是侧重于字体渲染等指纹识别方法。\n*   **原因：** 由于人工智能公司的行为，网站托管的动态正在发生变化，使用JavaScript和工作量证明是对这种情况的必要回应。目前正在开发无需JavaScript的解决方案。"
  },
  {
    "id": "44759171",
    "title": "Ergonomic keyboarding with the Svalboard: a half-year retrospective",
    "url": "https://twey.io/hci/svalboard/",
    "summary": "This article is a half-year retrospective on the author's experience using the Svalboard Lightly, a finger-oriented ergonomic keyboard. The author, a long-time Dvorak user with a history of RSI, previously used keyboards like the Ergodox EZ for their split halves, tenting, thumb clusters, and programmability. They were initially drawn to the CharaChorder for its potential to increase typing speed through finger movement minimization and chording, but found its closed-source nature and ergonomics lacking.\n\nThe Svalboard, inspired by the DataHand, addresses these issues with key clusters for each finger and infrared keypress detection. The author praises its QMK firmware, Vial integration (via Keybard), customizability, and open design. They highlight the ability to easily adjust key positions and configurations, leading to significant improvements in comfort and workflow.\n\nHowever, the author also notes some caveats: minor build quality issues (magnet detachment), high price, and the need for precise configuration. The keyboard's sensitivity can also be punishing to sloppy typing. Finally, repeat keypresses on the Svalboard can be more challenging than on a traditional keyboard. Despite these drawbacks, the author finds the Svalboard to be a fantastic device and their sole everyday keyboard, particularly when using a chair mount. The article concludes with a brief overview of the author's specific Svalboard setup.\n",
    "chinese_title": "Svalboard人体工学键盘半年回顾",
    "chinese_summary": "本文是对作者使用Svalboard Lightly（一款以手指为导向的人体工学键盘）半年经验的回顾。作者是长期使用Dvorak键盘的用户，有重复性劳损病史，之前使用过Ergodox EZ等键盘，看重其分离式设计、倾斜角度、拇指键区和可编程性。最初，他们被CharaChorder所吸引，希望通过最小化手指移动和组合键来提高打字速度，但发现其闭源性质和人体工学设计不足。\n\nSvalboard受DataHand启发，通过为每根手指设置按键群和红外按键检测来解决这些问题。作者称赞其QMK固件、Vial集成（通过Keybard）、可定制性和开放式设计。他们强调了轻松调整按键位置和配置的能力，从而显著提高了舒适度和工作效率。\n\n然而，作者也指出了一些注意事项：轻微的制造质量问题（磁铁脱落）、价格高昂以及需要精确配置。键盘的灵敏度也可能会惩罚马虎的打字。最后，在Svalboard上重复按键可能比在传统键盘上更具挑战性。尽管存在这些缺点，作者仍然认为Svalboard是一款出色的设备，也是他们唯一的日常键盘，尤其是在使用椅子支架时。文章最后简要概述了作者特定的Svalboard设置。"
  },
  {
    "id": "44765904",
    "title": "The Disappearance of Saturday Morning",
    "url": "https://www.awn.com/animationworld/disappearance-saturday-morning",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "周六早晨的消失",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "44720285",
    "title": "Make Your Own Backup System – Part 2: Forging the FreeBSD Backup Stronghold",
    "url": "https://it-notes.dragas.net/2025/07/29/make-your-own-backup-system-part-2-forging-the-freebsd-backup-stronghold/",
    "summary": "This article details how to build a secure backup system using FreeBSD as the core. It emphasizes full control over backup data and advocates for both local and remote backups, with internal copies independent of external ones to prevent cascading failures.\n\nFreeBSD is favored for its service partitioning capabilities via jails or VMs, and ZFS is recommended for its flexibility and toolset. Disk redundancy (mirror, RaidZ1/2) is crucial for backup data integrity.\n\nSecurity is paramount. The backup server should be hardened, ideally accessible only via VPN, or completely isolated from the internet. Encryption is a must to protect data in case of breaches. GELI full-disk encryption is recommended for local backups, while ZFS native encryption is preferred for remote servers.\n\nThe article provides step-by-step instructions for setting up GELI encryption and creating ZFS pools. It then covers base system setup including BastilleBSD for managing jails and vm-bhyve for running VMs like Proxmox Backup Server. Network bridging and firewall configuration are also covered.\n\nFinally, it discusses backup strategies, favoring zfs-autobackup for FreeBSD/ZFS environments and BorgBackup for non-ZFS systems, highlighting the importance of snapshotting the backup server to mitigate ransomware risks. Each server to be backed up gets its own dedicated jail for maximum security.\n",
    "chinese_title": "打造你的专属备份系统 – 第二部分：构建 FreeBSD 备份堡垒",
    "chinese_summary": "本文详述如何以 FreeBSD 为核心构建一个安全备份系统。它强调对备份数据的完全控制，并提倡本地和远程备份，且内部副本独立于外部副本，以防止级联故障。\n\nFreeBSD 因其通过 jail 或 VM 进行服务分区的能力而备受青睐，ZFS 因其灵活性和工具集而备受推荐。磁盘冗余（镜像、RaidZ1/2）对于备份数据完整性至关重要。\n\n安全性至关重要。备份服务器应进行安全加固，最好仅通过 VPN 访问，或完全与互联网隔离。必须进行加密以保护数据，以防数据泄露。对于本地备份，建议使用 GELI 全盘加密，而对于远程服务器，首选 ZFS 原生加密。\n\n本文提供了设置 GELI 加密和创建 ZFS 池的分步说明。然后介绍了基本系统设置，包括用于管理 jail 的 BastilleBSD 和用于运行诸如 Proxmox Backup Server 等 VM 的 vm-bhyve。还涵盖了网络桥接和防火墙配置。\n\n最后，它讨论了备份策略，倾向于使用 zfs-autobackup 进行 FreeBSD/ZFS 环境备份，并使用 BorgBackup 进行非 ZFS 系统备份，强调了对备份服务器进行快照以减轻勒索软件风险的重要性。每个要备份的服务器都有其自己专用的 jail 以实现最大安全性。"
  },
  {
    "id": "44735613",
    "title": "The tradeoff between human and AI context",
    "url": "https://softwaredoug.com/blog/2025/07/30/layers-of-ai-coding",
    "summary": "Doug Turnbull's article discusses the tradeoff between human and AI context when using AI coding tools. It presents a spectrum of human involvement, ranging from high-level abstract discussions to complete AI delegation. The key idea is that developers need to decide how much context to keep in their own minds versus entrusting it to the AI, balancing learning and efficiency.\n\nThe article outlines four layers of interaction:\n\n1.  **ChatGPT dialog:** Using ChatGPT for foundational education and high-level reflection, similar to discussing a problem with a colleague from another company. The value is in reformulating the problem and gaining perspective.\n2.  **Claude/Codex ask questions:** Asking the AI specific questions about the code within the project context, like consulting a trusted colleague. This is a trade-off between learning deeply and getting quick answers.\n3.  **Claude/Codex suggest changes:** Allowing the AI to propose changes, which the human selectively incorporates. This is useful when unsure about the AI's understanding of a specific language or framework.\n4.  **Claude/Codex actual coding:** Delegating a task to the AI with guardrails to prevent errors, suitable for core technologies. The user needs to carefully tune how much latitude to give the AI.\n\nUltimately, the article emphasizes that each layer involves a trade-off in how much context the human processes versus the AI, and the level of trust placed in the AI's capabilities. The author concludes by encouraging readers to consider this balance, like managing a company, and promotes his course on applying LLMs to search applications.\n",
    "chinese_title": "人类与人工智能语境的权衡",
    "chinese_summary": "道格·特恩布尔的文章讨论了使用AI编码工具时，人类和AI上下文之间的权衡。它提出了人类参与程度的光谱，从高级抽象讨论到完全的AI委托。关键思想是，开发者需要决定在自己脑海中保留多少上下文，以及将多少上下文委托给AI，从而平衡学习和效率。\n\n文章概述了四个互动层级：\n\n1.  **ChatGPT对话：** 使用ChatGPT进行基础教育和高级反思，类似于与另一家公司的同事讨论问题。价值在于重塑问题并获得视角。\n2.  **Claude/Codex提问：** 在项目上下文中向AI询问有关代码的特定问题，就像咨询一位值得信赖的同事。这是深入学习和快速获得答案之间的权衡。\n3.  **Claude/Codex建议修改：** 允许AI提出修改建议，由人类选择性地采纳。当不确定AI对特定语言或框架的理解时，这很有用。\n4.  **Claude/Codex实际编码：** 将任务委托给AI，并设置安全措施以防止错误，适用于核心技术。用户需要仔细调整给予AI的自由度。\n\n最终，文章强调每个层级都涉及人类处理的上下文量与AI处理的上下文量之间的权衡，以及对AI能力的信任程度。作者最后鼓励读者考虑这种平衡，就像管理一家公司一样，并推广了他关于将LLM应用于搜索应用程序的课程。"
  },
  {
    "id": "44766962",
    "title": "Sold a Story: How Teaching Kids to Read Went So Wrong",
    "url": "https://features.apmreports.org/sold-a-story/",
    "summary": "\"Sold a Story: How Teaching Kids to Read Went So Wrong\" is a podcast series investigating the prevalence of debunked reading instruction methods in schools. Hosted by Emily Hanford, the series reveals that for over a generation, schools have relied on an idea about reading acquisition that cognitive scientists disproved decades ago.\n\nThe podcast highlights the work of influential figures like Marie Clay and Lucy Calkins, whose theories and programs, while popular, contradict scientific research. These methods often focus on strategies used by struggling readers rather than explicitly teaching foundational reading skills. The series also explores the role of companies like Heinemann, which profit from selling materials based on these debunked ideas.\n\nThe series examines the consequences of these flawed approaches, including a large percentage of students not reading proficiently, wasted money, and an upended education system. Following the podcast's release, there's been a national reckoning, with school districts dropping old textbooks, states enacting new reading laws emphasizing \"the science of reading,\" and renewed scrutiny of curriculum review processes.\n\nThe podcast also covers examples of successful reading programs, such as \"Success for All\" in Steubenville, Ohio, and explores the challenges of implementing scientifically-backed methods across the country. The series acknowledges resistance from those who promoted the flawed ideas and discusses the impact on their careers and organizations. Ultimately, \"Sold a Story\" aims to raise awareness about the importance of evidence-based reading instruction and advocate for changes in educational practices.\n",
    "chinese_title": "售出的故事：儿童阅读教学为何误入歧途",
    "chinese_summary": "售卖的故事：儿童阅读教学为何误入歧途"
  },
  {
    "id": "44745490",
    "title": "OpenAI's \"Study Mode\" and the risks of flattery",
    "url": "https://resobscura.substack.com/p/openais-new-study-mode-and-the-risks",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "OpenAI“学习模式”与谄媚的风险",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "44768367",
    "title": "For Sale: 1990 Airstream NASA 025 Command Vehicle. Once-in-a-Lifetime",
    "url": "https://www.hemmings.com/listing/1990-airstream-all-models-478166",
    "summary": "This Hemmings.com listing advertises a unique piece of history: a 1990 Airstream NASA 025 Command Vehicle. Described as a \"once-in-a-lifetime investment opportunity,\" this custom-built 34-foot Airstream was originally designed to land crewed missions at Edwards Air Force Base and served as an onsite command center.\n\nThe seller acquired the vehicle from Vandenberg Air Force Base due to a miscommunication, with NASA's sales team unaware of its significance. They highlight the vehicle's potential as a marketing tool, projecting significant rental income ($150,000+) and event attraction capabilities, surpassing typical rental property returns.\n\nThe vehicle has only 8,240 miles and is in running condition in California. The sale includes extensive documentation, including 3,000+ pages and completed CAD drawings and plans. The seller has invested $45,000 in creating as-built plans. The vehicle retains its original NASA condition, though currently painted in a white base with red/blue details.\n\nThe listing emphasizes the rarity of the vehicle, stating it's the only NASA-labeled unit sold to the public. While other NASA Airstreams exist in museums, those are crew transport vehicles, not command vehicles. Due to its ITAR designation, the Airstream cannot be exported or sold to hostile entities and can only be used recreationally or with State Dept. clearance. The vehicle is being offered for sale with no trades.\n",
    "chinese_title": "出售：1990年款 Airstream NASA 025 指挥车。千载难逢。",
    "chinese_summary": "这辆Hemmings.com的房车出售信息广告了一件独特的历史：一辆1990年款的Airstream NASA 025指挥车。它被描述为“一生只有一次的投资机会”，这辆定制的34英尺Airstream房车最初被设计用于在爱德华兹空军基地降落载人任务，并作为现场指挥中心。\n\n卖方由于一次沟通失误从范登堡空军基地获得了这辆车，当时美国国家航空航天局的销售团队并不了解它的重要性。他们强调了该车辆作为营销工具的潜力，预计可带来显著的租金收入（15万美元以上）和活动吸引力，超过了典型的租赁房产回报。\n\n该车辆仅行驶了8240英里，目前在加利福尼亚州处于运行状态。出售包括大量文件，包括3000多页和完整的CAD图纸和计划。卖方已投资45,000美元用于创建竣工图。该车辆保留了其原始的美国国家航空航天局状态，但目前涂成白色底色，带有红色/蓝色细节。\n\n该清单强调了该车辆的稀有性，声明它是唯一出售给公众的带有美国国家航空航天局标签的单元。虽然其他美国国家航空航天局的Airstream房车存在于博物馆中，但那些是乘员运输车，而不是指挥车。由于其ITAR指定，这辆Airstream房车不能出口或出售给敌对实体，只能用于娱乐或获得国务院许可。该车辆正在出售，不接受任何交易。"
  },
  {
    "id": "44755279",
    "title": "Gemini 2.5 Deep Think",
    "url": "https://blog.google/products/gemini/gemini-2-5-deep-think/",
    "summary": "The Gemini app is rolling out \"Deep Think\" to Google AI Ultra subscribers on August 1, 2025. Deep Think is a variation of the Gemini 2.5 model that achieved gold-medal standard at the International Mathematical Olympiad (IMO) and represents a significant improvement over previous models, even reaching Bronze-level performance on the 2025 IMO benchmark in its faster, more usable form. A select group of mathematicians and academics are receiving access to the full gold-medal version.\n\nDeep Think utilizes parallel thinking techniques, allowing the AI to generate and consider multiple ideas simultaneously, improving problem-solving capabilities through extended \"thinking time\" and novel reinforcement learning techniques. It excels at creative problem-solving, including iterative development and design, scientific and mathematical discovery, and algorithmic development and coding.\n\nDeep Think has demonstrated state-of-the-art performance in coding, science, knowledge, and reasoning benchmarks like LiveCodeBench V6 and Humanity’s Last Exam. Google emphasizes ongoing efforts to build safety and responsibility into Gemini, noting improved content safety in Deep Think compared to Gemini 2.5 Pro, but also a higher refusal rate of benign requests.\n\nGoogle AI Ultra subscribers can access Deep Think in the Gemini app with a set number of daily prompts, using tools like code execution and Google Search. The company plans to release Deep Think with and without tools to trusted testers via the Gemini API for developers and enterprise use.\n",
    "chinese_title": "双子座2.5深度思考",
    "chinese_summary": "Gemini 应用将于 2025 年 8 月 1 日向 Google AI Ultra 订阅用户推出“深度思考”。“深度思考”是 Gemini 2.5 模型的一个变体，在国际数学奥林匹克竞赛 (IMO) 中达到了金牌标准，并且代表了对先前模型的重大改进，即使在其更快、更可用的形式中，也在 2025 年 IMO 基准测试中达到了铜牌水平。 一小部分数学家和学者正在获得完整金牌版本的访问权限。\n\n“深度思考”采用并行思考技术，使 AI 能够同时生成和考虑多个想法，通过延长“思考时间”和新颖的强化学习技术来提高解决问题的能力。它擅长创造性问题解决，包括迭代开发和设计、科学和数学发现以及算法开发和编码。\n\n“深度思考”在编码、科学、知识和推理基准测试（如 LiveCodeBench V6 和 Humanity's Last Exam）中表现出最先进的性能。 Google 强调正在努力将安全性和责任融入 Gemini，并指出与 Gemini 2.5 Pro 相比，“深度思考”中的内容安全性有所提高，但对良性请求的拒绝率也更高。\n\nGoogle AI Ultra 订阅用户可以在 Gemini 应用程序中访问“深度思考”，每天有一定数量的提示，并使用代码执行和 Google 搜索等工具。该公司计划通过 Gemini API 向开发者和企业用户发布带有和不带工具的“深度思考”给可信测试者。"
  },
  {
    "id": "44764077",
    "title": "The Rickover Corpus: A digital archive of Admiral Rickover's speeches and memos",
    "url": "https://rickovercorpus.org/",
    "summary": "The Rickover Corpus is envisioned as a digital archive containing Admiral Hyman G. Rickover's speeches and memos. The document, likely a proposal or project description, outlines the intent to create this repository. While the document itself is sparse on details, we can infer that the archive will be structured around specific pieces of content, each entry likely including:\n\n*   **Title:** The title of the speech or memo.\n*   **Year:** The year the speech or memo was delivered or written.\n*   **Summary:** A short description or abstract of the content.\n*   **Source:** The original source of the speech or memo (e.g., a publication, a collection, etc.).\n*   **Links:** Pointers to the full text of the speech or memo, likely either as a direct digital file or a link to an external website.\n\nThe purpose of the Rickover Corpus is presumably to preserve and make accessible Admiral Rickover's writings and pronouncements, facilitating research and understanding of his views on various topics (likely including nuclear power, education, and leadership). The document serves as an initial framework for this project, highlighting the key elements planned for inclusion in the archive. The success of the archive depends on gathering the relevant materials and organizing them in the described format.\n",
    "chinese_title": "里科弗文集：里科弗海军上将演讲和备忘录数字档案馆",
    "chinese_summary": "里科弗文集设想为一个包含海曼·G·里科弗海军上将演讲和备忘录的数字档案馆。该文件很可能是一份提案或项目描述，概述了创建此存储库的意图。虽然该文件本身细节不足，但我们可以推断出该档案馆将围绕特定的内容片段构建，每个条目可能包括：\n\n*   **标题：**演讲或备忘录的标题。\n*   **年份：**发表或撰写演讲或备忘录的年份。\n*   **摘要：**内容的简短描述或概要。\n*   **来源：**演讲或备忘录的原始来源（例如，出版物、文集等）。\n*   **链接：**指向演讲或备忘录全文的指针，很可能直接是数字文件或指向外部网站的链接。\n\n里科弗文集的目的大概是为了保存并使里科弗海军上将的著作和声明可访问，从而促进对他在各种主题（可能包括核能、教育和领导力）的观点的研究和理解。该文件作为该项目的初始框架，突出了计划包含在档案馆中的关键要素。档案馆的成功取决于收集相关材料并以所述格式组织它们。"
  },
  {
    "id": "44724259",
    "title": "How Hyper built a 1M-accurate indoor GPS",
    "url": "https://andrewhart.me/hyper/",
    "summary": "Andrew Hart's journey to building Hyper, a 1-meter accurate indoor GPS, began with a retailer's frustration over inaccurate indoor navigation. He realized existing solutions like Bluetooth beacons, WiFi, magnetometers, and computer vision were insufficient due to accuracy, scalability, or user experience issues.\n\nHart founded Hyper to solve this foundational problem. Their solution combines WiFi positioning with SLAM (Simultaneous Localization and Mapping), the technology behind self-driving cars. WiFi provides the initial \"blue dot,\" and SLAM, using accelerometer, gyroscope, and camera data, tracks precise motion to refine location accuracy to 1 meter.\n\nTo overcome challenges like SLAM drift (accumulated errors over time) and directional uncertainty, Hyper developed algorithms that anchor to WiFi data and simulate movement scenarios to determine accurate heading. They also created a self-serve survey app, allowing store staff to map WiFi signal strength, improving scalability and reducing costs.\n\nThe result is a precise and reliable indoor GPS experience, feeding into advanced AR navigation. Hyper has secretly deployed this technology in major retail stores and is now focusing on scaling to a billion users, seeking a larger partner to achieve enterprise-scale distribution. Their goal is to bring accurate indoor navigation to various indoor spaces, enhancing efficiency and improving user experiences.\n",
    "chinese_title": "Hyper 如何构建百万级精度室内 GPS",
    "chinese_summary": "安德鲁·哈特打造Hyper，一种1米精度的室内GPS的旅程，源于零售商对不准确室内导航的沮丧。他意识到现有的蓝牙信标、WiFi、磁力计和计算机视觉等解决方案，由于精度、可扩展性或用户体验问题而不足。\n\n哈特创立Hyper是为了解决这个根本问题。他们的解决方案结合了WiFi定位和SLAM（即时定位与地图构建），也就是自动驾驶汽车背后的技术。WiFi提供最初的“蓝点”，而SLAM利用加速度计、陀螺仪和摄像头数据，追踪精确运动，将位置精度提升到1米。\n\n为了克服SLAM漂移（随时间累积的误差）和方向不确定性等挑战，Hyper开发了锚定到WiFi数据的算法，并模拟运动场景来确定准确的航向。他们还创建了一个自助式调查应用程序，允许商店员工绘制WiFi信号强度图，从而提高可扩展性并降低成本。\n\n最终成果是一种精确可靠的室内GPS体验，为高级AR导航提供支持。Hyper已经在大型零售商店秘密部署了这项技术，现在正专注于扩展到十亿用户，并寻求更大的合作伙伴来实现企业级规模的发行。他们的目标是将精确的室内导航带到各种室内空间，提高效率并改善用户体验。"
  },
  {
    "id": "44759918",
    "title": "Google shifts goo.gl policy: Inactive links deactivated, active links preserved",
    "url": "https://blog.google/technology/developers/googl-link-shortening-update/",
    "summary": "Google is revising its plan to discontinue goo.gl URLs. Originally, all goo.gl links were slated to be deactivated after August 25, 2025. However, due to user feedback, Google will now preserve actively used links. Only goo.gl links that were inactive in late 2024 and currently redirect to a message indicating future deactivation will be affected. These links will cease to function after August 25, and users are advised to transition to a different URL shortener. All other goo.gl links, which redirect normally without the deactivation message, will continue to function as usual. Users can check if their links will be retained by visiting them; if they redirect without the warning message, they will remain active.\n",
    "chinese_title": "Google更改goo.gl政策：非活跃链接停用，活跃链接保留",
    "chinese_summary": "谷歌正在修改停用 goo.gl 网址的计划。原本所有 goo.gl 链接计划于 2025 年 8 月 25 日后停用。但由于用户反馈，谷歌现在将保留活跃使用的链接。只有 2024 年底处于非活跃状态且目前重定向至显示未来停用信息的 goo.gl 链接会受到影响。这些链接将于 8 月 25 日后停止工作，建议用户过渡到其他网址缩短服务。所有其他正常重定向且没有停用信息的 goo.gl 链接将继续正常工作。用户可以通过访问链接来检查其链接是否会被保留；如果它们在没有警告信息的情况下重定向，则它们将保持活动状态。"
  },
  {
    "id": "44767433",
    "title": "Anandtech.com now redirects to its forums",
    "url": "https://forums.anandtech.com/",
    "summary": "Anandtech.com now redirects to its forums, a hub for discussions on technology, hardware, software, and deals. The forums are categorized by topic, including CPUs, motherboards, graphics cards, memory, displays, power supplies, cases, laptops, networking, Apple products, peripherals, computer building, consumer electronics, console gaming, mobile devices, audio, TVs, and various software and operating system categories.\n\nThe forums also include sections dedicated to shopping deals, social discussions, politics, technical questions, automotive topics, health, home improvement, and forum feedback. Users can join the community to participate in discussions, ask questions, and share their knowledge.\n\nThe main page displays trending threads and latest posts from various forums, covering topics such as CPU speculation, Intel's future processor plans, Apple Silicon, and the stock market. The site is part of Future plc, and provides resources like advertising information, cookie policies, privacy information, and terms and conditions. It also encourages users to follow AnandTech on Facebook and Twitter.\n",
    "chinese_title": "Anandtech.com 现在重定向至其论坛。",
    "chinese_summary": "Anandtech.com 现在重定向至其论坛，该论坛是关于技术、硬件、软件和交易讨论的中心。论坛按主题分类，包括 CPU、主板、显卡、内存、显示器、电源、机箱、笔记本电脑、网络、苹果产品、外围设备、电脑组装、消费电子产品、主机游戏、移动设备、音频、电视以及各种软件和操作系统类别。\n\n论坛还包括专门讨论购物优惠、社交讨论、政治、技术问题、汽车话题、健康、家居装修和论坛反馈的部分。用户可以加入社区参与讨论、提问和分享他们的知识。\n\n主页显示来自各个论坛的热门帖子和最新帖子，涵盖诸如 CPU 猜测、英特尔的未来处理器计划、Apple Silicon 和股票市场等主题。该网站是 Future plc 的一部分，并提供诸如广告信息、Cookie 政策、隐私信息以及条款和条件等资源。它还鼓励用户在 Facebook 和 Twitter 上关注 AnandTech。"
  },
  {
    "id": "44766638",
    "title": "Write \"Freehold\" Software",
    "url": "https://deadbeef.io/freehold_software?resubmit=hn",
    "summary": "This \"article\" appears to be a single line suggesting the name \"Freehold\" for software, followed by a domain name (\"deadbeef.io\") that leads to an error page stating \"An unknown error occurred.\"\n\nTherefore, there's no substantial content to summarize. The \"article\" doesn't provide any information about:\n\n*   **What \"Freehold\" software is:** There's no description of the software's purpose, functionality, or target audience.\n*   **The connection to deadbeef.io:** The domain likely belongs to the developer or organization associated with the \"Freehold\" software, but the error prevents any further investigation.\n*   **Reasons for choosing the name \"Freehold\":** There's no explanation or justification for the suggested name.\n\nIn essence, the \"article\" is merely a suggestion and a broken link, offering no concrete information or meaningful content to summarize beyond the proposed name \"Freehold\" and a non-functional domain.\n",
    "chinese_title": "编写“永久产权”软件",
    "chinese_summary": "这篇“文章”似乎只是一行字，建议将软件命名为“Freehold”，接着是一个域名（“deadbeef.io”），该域名导向一个显示“发生未知错误”的错误页面。\n\n因此，没有实质内容可供总结。 这篇“文章”没有提供任何关于以下方面的信息：\n\n*   **“Freehold”软件是什么：** 没有对该软件的用途、功能或目标受众的描述。\n*   **与 deadbeef.io 的联系：** 该域名可能属于与“Freehold”软件相关的开发人员或组织，但该错误阻止了任何进一步的调查。\n*   **选择名称“Freehold”的原因：** 没有对建议名称的解释或理由。\n\n本质上，这篇“文章”仅仅是一个建议和一个失效的链接，除了建议名称“Freehold”和一个无法正常使用的域名之外，没有提供任何具体信息或有意义的内容可供总结。"
  },
  {
    "id": "44763016",
    "title": "Twentyseven 1.0",
    "url": "https://blog.poisson.chat/posts/2025-08-01-twentyseven.html",
    "summary": "\"Twentyseven\" is a Haskell-based Rubik's Cube solver, a long-term project by the author, commemorated with a 1.0.0 release to ensure compatibility with the latest GHC. The author highlights Haskell's suitability for mathematical problems like Rubik's Cube solving due to its blend of programming and math capabilities, particularly for group theory applications.\n\nThe solver, inspired by Herbert Kociemba’s \"Cube Explorer,\" uses an Iterative Deepening A* (IDA*) algorithm to find the shortest solution path. Due to the massive state space of a Rubik's Cube, IDA* is preferred for its memory efficiency, employing depth-first searches with increasing move limits. The algorithm relies on heuristics derived from projecting the cube state into simpler puzzles (like corner permutations) to estimate remaining moves.\n\nWhile \"Twentyseven\" provides optimal solutions, it can be slow compared to Kociemba's Cube Explorer, potentially due to heuristic choices. A faster, albeit suboptimal, alternative is Kociemba's two-phase algorithm, which \"Twentyseven\" also implements. This algorithm divides the solving process into two stages: the first orients cubies and separates edges, and the second restricts moves to preserve this orientation and slice the edges, significantly reducing the search space.\n",
    "chinese_title": "二十七 1.0",
    "chinese_summary": "\"Twentyseven\" 是一款基于 Haskell 的魔方解算器，是作者的一个长期项目，为了确保与最新 GHC 的兼容性，发布了 1.0.0 版本。作者强调 Haskell 非常适合解决像魔方这样的数学问题，因为它融合了编程和数学能力，尤其适用于群论的应用。\n\n该解算器受到 Herbert Kociemba 的 \"Cube Explorer\" 的启发，使用迭代加深 A* (IDA*) 算法来寻找最短解法路径。由于魔方状态空间的巨大性，IDA* 因其内存效率而更受青睐，它采用具有递增移动限制的深度优先搜索。该算法依赖于从将魔方状态投影到更简单的拼图（如角块排列）中得出的启发式算法来估计剩余移动。\n\n虽然 \"Twentyseven\" 提供最佳解，但与 Kociemba 的 Cube Explorer 相比，速度可能较慢，这可能是由于启发式选择造成的。\"Twentyseven\" 也实现了 Kociemba 的两阶段算法，这是一种更快但并非最佳的替代方案。该算法将求解过程分为两个阶段：第一阶段确定魔方小块的方向并分离边缘，第二阶段限制移动以保持这种方向并切割边缘，从而显着减少搜索空间。"
  },
  {
    "id": "44760561",
    "title": "Self-Signed JWTs",
    "url": "https://www.selfref.com/self-signed-jwts",
    "summary": "This article critiques the complexity and hassle of traditional API key management and proposes a simplified alternative using self-signed JSON Web Tokens (JWTs). Instead of relying on external services to generate and manage API keys, developers can generate their own JWK keypairs locally, effectively creating their own self-issued API keys.\n\nThe author advocates for eliminating the distinction between \"secret\" and \"publishable\" keys and separate client/admin SDKs. Privileged actions are controlled via claims embedded within the JWT, signed using the application's private JWK. The client-side SDK then attaches the signed JWT to requests. The server verifies the JWT signature using the corresponding public JWK, authorizing actions based on the claims.\n\nThe article further addresses API monetization by suggesting that requests from unpaid accounts return a payment URL, associating the public key with a paid account upon payment.\n\nFinally, the article tackles the B2B2C scenario, suggesting a hierarchical JWK derivation approach. Developers create master JWKs and derive child JWKs for their end-users. The JWT includes a zero-knowledge proof verifying the end user's key derivation from the developer's master key, allowing verification of end-user authorization without the developer managing individual API keys.\n",
    "chinese_title": "自签名JWT",
    "chinese_summary": "本文批判了传统API密钥管理的复杂性和麻烦，并提出了一种使用自签名JSON Web令牌 (JWT) 的简化替代方案。开发者可以本地生成自己的JWK密钥对，从而有效创建自己的自颁发API密钥，而无需依赖外部服务来生成和管理API密钥。\n\n作者提倡消除“秘密”密钥和“可发布”密钥以及单独的客户端/管理SDK之间的区别。特权操作通过嵌入在JWT中的声明进行控制，该声明使用应用程序的私有JWK进行签名。 客户端SDK随后将签名的JWT附加到请求。服务器使用相应的公共JWK验证JWT签名，并根据声明授权操作。\n\n文章进一步讨论了API货币化，建议来自未付费帐户的请求返回一个支付URL，并在支付后将公钥与付费帐户关联。\n\n最后，文章探讨了B2B2C场景，提出了一种分层JWK派生方法。开发者创建主JWK，并为其最终用户派生子JWK。 JWT包含一个零知识证明，用于验证最终用户的密钥是从开发者的主密钥派生的，从而可以在无需开发者管理单个API密钥的情况下验证最终用户的授权。"
  },
  {
    "id": "44761299",
    "title": "Deep Agents",
    "url": "https://blog.langchain.com/deep-agents/",
    "summary": "This article explores the concept of \"deep agents,\" which are more capable than simple LLM-powered agents that merely loop through tool calls. These deep agents excel at planning and executing complex tasks over longer time horizons, drawing inspiration from successful examples like Claude Code, Manus, and Deep Research agents.\n\nThe author identifies four key characteristics that differentiate deep agents:\n\n1.  **Detailed System Prompt:** Complex and comprehensive prompts provide specific instructions and examples for tool usage and desired behavior.\n2.  **Planning Tool:** Even a simple, non-functional planning tool (like a Todo list) helps the agent maintain focus and track progress on multi-step tasks.\n3.  **Sub Agents:** The ability to spawn sub-agents allows for task decomposition and specialized focus, improving context management and efficiency.\n4.  **File System:** Access to a file system enables agents to store and retrieve information, manage large amounts of context, and facilitate collaboration between sub-agents.\n\nThe article concludes by introducing an open-source Python package called \"deepagents\" designed to simplify the creation of custom deep agents. This package includes a general-purpose system prompt, a Todo list planning tool, sub-agent spawning capabilities, and a virtual file system. Developers can customize the agent by providing custom prompts, tools, and sub-agents for specific vertical applications. A simple \"deep research\" agent example is also mentioned.\n",
    "chinese_title": "深度智能体",
    "chinese_summary": "本文探讨了“深度代理”的概念，它们比仅仅通过工具调用循环的简单LLM驱动的代理更具能力。这些深度代理擅长规划和执行跨越更长时间范围的复杂任务，并从Claude Code、Manus和Deep Research agent等成功案例中汲取灵感。\n\n作者确定了区分深度代理的四个关键特征：\n\n1.  **详细的系统提示：** 复杂而全面的提示为工具的使用和期望的行为提供了具体的说明和示例。\n2.  **规划工具：** 即使是一个简单的、非功能性的规划工具（如待办事项清单）也有助于代理保持专注并跟踪多步骤任务的进度。\n3.  **子代理：** 生成子代理的能力允许任务分解和专业化关注，从而提高上下文管理和效率。\n4.  **文件系统：** 访问文件系统使代理能够存储和检索信息、管理大量上下文，并促进子代理之间的协作。\n\n文章最后介绍了一个名为“deepagents”的开源Python包，旨在简化自定义深度代理的创建。该软件包包括一个通用的系统提示、一个待办事项清单规划工具、子代理生成功能和一个虚拟文件系统。开发者可以通过提供自定义提示、工具和子代理来为特定的垂直应用定制代理。文中还提到了一个简单的“深度研究”代理示例。"
  },
  {
    "id": "44758957",
    "title": "Supporting the BEAM community with free CI/CD security audits",
    "url": "https://www.erlang-solutions.com/blog/supporting-the-beam-community-with-free-ci-cd-security-audits/",
    "summary": "Erlang Solutions is offering free CI/CD-based security audits for open-source Erlang and Elixir projects to support the BEAM community. These audits, powered by their SAFE (Security Audit for Erlang/Elixir) tool, integrate directly into development pipelines (like GitHub Actions), automatically scanning for vulnerabilities with each code commit or update. This helps projects detect issues early, maintain a secure codebase, and improve risk visibility. Results are delivered quickly, providing clear and actionable feedback.\n\nOpen-source maintainers can request a free SAFE license by emailing safe@erlang-solutions.com, providing a link to their repository. Licenses are granted for one month to a year, depending on the project's needs.\n\nBeyond the free audits, Erlang Solutions also offers expert-led audit services for production BEAM systems, including code reviews, architecture assessments, and performance audits. These are suited for complex or critical systems and complement SAFE audits.\n\nErlang Solutions demonstrates a broader commitment to the BEAM community through sponsorship of events like Code Sync, support for the Erlang Ecosystem Foundation (EEF), backing inclusion initiatives like Women in BEAM, and sharing learning resources. They aim to support the ecosystem through expertise and action, ensuring secure, scalable, and reliable BEAM-based systems.\n",
    "chinese_title": "Supporting the BEAM community with free CI/CD security audits",
    "chinese_summary": "Erlang Solutions is offering free CI/CD-based security audits for open-source Erlang and Elixir projects to support the BEAM community. These audits, powered by their SAFE (Security Audit for Erlang/Elixir) tool, integrate directly into development pipelines (like GitHub Actions), automatically scanning for vulnerabilities with each code commit or update. This helps projects detect issues early, maintain a secure codebase, and improve risk visibility. Results are delivered quickly, providing clear and actionable feedback.\n\nOpen-source maintainers can request a free SAFE license by emailing safe@erlang-solutions.com, providing a link to their repository. Licenses are granted for one month to a year, depending on the project's needs.\n\nBeyond the free audits, Erlang Solutions also offers expert-led audit services for production BEAM systems, including code reviews, architecture assessments, and performance audits. These are suited for complex or critical systems and complement SAFE audits.\n\nErlang Solutions demonstrates a broader commitment to the BEAM community through sponsorship of events like Code Sync, support for the Erlang Ecosystem Foundation (EEF), backing inclusion initiatives like Women in BEAM, and sharing learning resources. They aim to support the ecosystem through expertise and action, ensuring secure, scalable, and reliable BEAM-based systems.\n"
  },
  {
    "id": "44759406",
    "title": "Show HN: TraceRoot – Open-source agentic debugging for distributed services",
    "url": "https://github.com/traceroot-ai/traceroot",
    "summary": "生成摘要时出错",
    "chinese_title": "Show HN: TraceRoot – Open-source agentic debugging for distributed services",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44727756",
    "title": "A DH106 1A Comet has been restored at the de Havilland Aircraft Museum",
    "url": "https://www.cnn.com/travel/de-havilland-comet-dh106-first-passenger-jet",
    "summary": "生成摘要时出错",
    "chinese_title": "A DH106 1A Comet has been restored at the de Havilland Aircraft Museum",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44762859",
    "title": "Tim Cook rallying Apple employees around AI efforts",
    "url": "https://www.bloomberg.com/news/articles/2025-08-01/apple-ceo-tells-staff-ai-is-ours-to-grab-in-hourlong-pep-talk",
    "summary": "生成摘要时出错",
    "chinese_title": "Tim Cook rallying Apple employees around AI efforts",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44726641",
    "title": "Pseudo, a Common Lisp macro for pseudocode expressions",
    "url": "http://funcall.blogspot.com/2025/07/pseudo.html",
    "summary": "生成摘要时出错",
    "chinese_title": "Pseudo, a Common Lisp macro for pseudocode expressions",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44748934",
    "title": "Slow",
    "url": "https://michaelnotebook.com/slow/index.html",
    "summary": "生成摘要时出错",
    "chinese_title": "Slow",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44730691",
    "title": "Show HN: An interactive dashboard to explore NYC rentals data",
    "url": "https://leaseswap.nyc/analytics",
    "summary": "生成摘要时出错",
    "chinese_title": "Show HN: An interactive dashboard to explore NYC rentals data",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44739315",
    "title": "The Math Is Haunted",
    "url": "https://overreacted.io/the-math-is-haunted/",
    "summary": "生成摘要时出错",
    "chinese_title": "The Math Is Haunted",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44759904",
    "title": "The AI age is the \"age of no consent\"",
    "url": "https://productpicnic.beehiiv.com/p/the-ai-age-is-the-age-of-no-consent-7559",
    "summary": "生成摘要时出错",
    "chinese_title": "The AI age is the \"age of no consent\"",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44757247",
    "title": "OpenAI raises $8.3B at $300B valuation",
    "url": "https://www.nytimes.com/2025/08/01/business/dealbook/openai-ai-mega-funding-deal.html",
    "summary": "生成摘要时出错",
    "chinese_title": "OpenAI raises $8.3B at $300B valuation",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44768163",
    "title": "Vikings grew barley in Greenland – climate was mild when they landed",
    "url": "https://www.sciencenordic.com/agriculture-archaeology-denmark/vikings-grew-barley-in-greenland/1447746",
    "summary": "生成摘要时出错",
    "chinese_title": "Vikings grew barley in Greenland – climate was mild when they landed",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44765981",
    "title": "The First Widespread Cure for HIV Could Be in Children",
    "url": "https://www.wired.com/story/the-first-widespread-cure-for-hiv-could-be-in-children/",
    "summary": "生成摘要时出错",
    "chinese_title": "The First Widespread Cure for HIV Could Be in Children",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44758132",
    "title": "Fast (2019)",
    "url": "https://patrickcollison.com/fast",
    "summary": "生成摘要时出错",
    "chinese_title": "Fast (2019)",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44757755",
    "title": "Hyrum's Law",
    "url": "https://www.hyrumslaw.com",
    "summary": "生成摘要时出错",
    "chinese_title": "Hyrum's Law",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44713716",
    "title": "Replacing cron jobs with a centralized task scheduler",
    "url": "https://mayhul.com/posts/scheduled-tasks/",
    "summary": "生成摘要时出错",
    "chinese_title": "Replacing cron jobs with a centralized task scheduler",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44726347",
    "title": "Programmers aren’t so humble anymore, maybe because nobody codes in Perl",
    "url": "https://www.wired.com/story/programmers-arent-humble-anymore-nobody-codes-in-perl/",
    "summary": "生成摘要时出错",
    "chinese_title": "Programmers aren’t so humble anymore, maybe because nobody codes in Perl",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44737372",
    "title": "Build an AI telephony agent for inbound and outbound calls",
    "url": "https://github.com/videosdk-community/ai-telephony-demo",
    "summary": "生成摘要时出错",
    "chinese_title": "Build an AI telephony agent for inbound and outbound calls",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44759382",
    "title": "Corporation for Public Broadcasting ceasing operations",
    "url": "https://cpb.org/pressroom/Corporation-Public-Broadcasting-Addresses-Operations-Following-Loss-Federal-Funding",
    "summary": "生成摘要时出错",
    "chinese_title": "Corporation for Public Broadcasting ceasing operations",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44734791",
    "title": "Show HN: Print the daily weather forecast on a thermal receipt printer",
    "url": "https://github.com/chr15m/print-weather",
    "summary": "生成摘要时出错",
    "chinese_title": "Show HN: Print the daily weather forecast on a thermal receipt printer",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44755644",
    "title": "The untold impact of cancellation",
    "url": "https://pretty.direct/impact",
    "summary": "生成摘要时出错",
    "chinese_title": "The untold impact of cancellation",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44739965",
    "title": "A criminal enterprise run by monkeys",
    "url": "https://www.wsj.com/lifestyle/monkeys-thieves-bali-temple-0b63a432",
    "summary": "生成摘要时出错",
    "chinese_title": "A criminal enterprise run by monkeys",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44739494",
    "title": "150 years of Hans Christian Andersen",
    "url": "https://www.newstatesman.com/culture/books/book-of-the-day/2025/07/150-years-of-the-bizarre-hans-christian-andersen",
    "summary": "生成摘要时出错",
    "chinese_title": "150 years of Hans Christian Andersen",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44736668",
    "title": "What's Not to Like?",
    "url": "https://theamericanscholar.org/whats-not-to-like/",
    "summary": "生成摘要时出错",
    "chinese_title": "What's Not to Like?",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44756103",
    "title": "Andrew Ng and Yann LeCun: US Is Losing AI Race Due to Closed Models",
    "url": "https://haebom.dev/archive?post=1q3vdn2p97v8xmxy49pr",
    "summary": "生成摘要时出错",
    "chinese_title": "Andrew Ng and Yann LeCun: US Is Losing AI Race Due to Closed Models",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44753298",
    "title": "Every satellite orbiting earth and who owns them (2023)",
    "url": "https://dewesoft.com/blog/every-satellite-orbiting-earth-and-who-owns-them",
    "summary": "生成摘要时出错",
    "chinese_title": "Every satellite orbiting earth and who owns them (2023)",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44760023",
    "title": "Qwen3 Coder 480B is Live on Cerebras",
    "url": "https://www.cerebras.ai/blog/qwen3-coder-480b-is-live-on-cerebras",
    "summary": "生成摘要时出错",
    "chinese_title": "Qwen3 Coder 480B is Live on Cerebras",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44710651",
    "title": "Face it: you're a crazy person",
    "url": "https://www.experimental-history.com/p/face-it-youre-a-crazy-person",
    "summary": "生成摘要时出错",
    "chinese_title": "Face it: you're a crazy person",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44733341",
    "title": "Problem solving using Markov chains (2007) [pdf]",
    "url": "http://math.uchicago.edu/~shmuel/Network-course-readings/Markov_chain_tricks.pdf",
    "summary": "生成摘要时出错",
    "chinese_title": "Problem solving using Markov chains (2007) [pdf]",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44716653",
    "title": "OpenAI's ChatGPT Agent casually clicks through \"I am not a robot\" verification",
    "url": "https://arstechnica.com/information-technology/2025/07/openais-chatgpt-agent-casually-clicks-through-i-am-not-a-robot-verification-test/",
    "summary": "生成摘要时出错",
    "chinese_title": "OpenAI's ChatGPT Agent casually clicks through \"I am not a robot\" verification",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44736967",
    "title": "Fast",
    "url": "https://www.catherinejue.com/fast",
    "summary": "生成摘要时出错",
    "chinese_title": "Fast",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44766831",
    "title": "New research finds that ivermectin could help control malaria transmission",
    "url": "https://www.ndm.ox.ac.uk/news/new-research-supports-ivermectin-as-an-effective-strategy-to-control-malaria-transmission",
    "summary": "生成摘要时出错",
    "chinese_title": "New research finds that ivermectin could help control malaria transmission",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44747229",
    "title": "Show HN: Mcp-use – Connect any LLM to any MCP",
    "url": "https://github.com/mcp-use/mcp-use",
    "summary": "生成摘要时出错",
    "chinese_title": "Show HN: Mcp-use – Connect any LLM to any MCP",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44761760",
    "title": "When Flatpak's Sandbox Cracks",
    "url": "https://www.linuxjournal.com/content/when-flatpaks-sandbox-cracks-real-life-security-issues-beyond-ideal",
    "summary": "生成摘要时出错",
    "chinese_title": "When Flatpak's Sandbox Cracks",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44745984",
    "title": "Carbon Language: An experimental successor to C++",
    "url": "https://docs.carbon-lang.dev/",
    "summary": "生成摘要时出错",
    "chinese_title": "Carbon Language: An experimental successor to C++",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44768775",
    "title": "Man Kept a Meticulous List of All 3,599 Books He'd Read Since 1962",
    "url": "https://www.smithsonianmag.com/smart-news/this-man-kept-a-meticulous-list-of-all-3599-books-hed-read-since-1962-when-he-died-his-family-published-it-online-180987074/",
    "summary": "生成摘要时出错",
    "chinese_title": "Man Kept a Meticulous List of All 3,599 Books He'd Read Since 1962",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44745820",
    "title": "Show HN: AgentMail – Email infra for AI agents",
    "url": "https://chat.agentmail.to/",
    "summary": "生成摘要时出错",
    "chinese_title": "Show HN: AgentMail – Email infra for AI agents",
    "chinese_summary": "生成摘要时出错"
  }
]