[
  {
    "id": "44695098",
    "title": "How We Rooted Copilot",
    "url": "https://research.eye.security/how-we-rooted-copilot/",
    "summary": "The article \"How We Rooted Copilot\" details how Eye Security discovered and exploited a SharePoint 0-day vulnerability (CVE-2025-53770) leading to mass exploitation. It recounts the journey from initially triaging a SOC alert to uncovering the root cause: a previously unknown security flaw within SharePoint. The timeline starts on the evening of July 18, 2025. The blog post likely goes into further detail regarding the specific technical aspects of the vulnerability, the exploitation process, and the potential impact, offering insights into how a seemingly innocuous alert led to the discovery and exploitation of a critical security flaw in a widely used platform like SharePoint, ultimately allowing them to \"root\" Copilot (presumably through access gained via the SharePoint vulnerability).\n",
    "chinese_title": "我们如何攻破Copilot",
    "chinese_summary": "我们如何Root掉Copilot：文章详述了Eye Security如何发现并利用SharePoint零日漏洞（CVE-2025-53770）导致大规模漏洞利用的事件。文章回顾了从最初的SOC警报分流到发现根本原因（SharePoint中先前未知的安全漏洞）的全过程。时间线始于2025年7月18日晚。该博客文章可能更详细地介绍了该漏洞的具体技术方面、利用过程以及潜在影响，并深入分析了看似无害的警报如何导致发现和利用像SharePoint这样广泛使用的平台中的关键安全漏洞，最终使他们能够“root” Copilot（据推测是通过利用SharePoint漏洞获得的访问权限）。"
  },
  {
    "id": "44692876",
    "title": "Rust running on every GPU",
    "url": "https://rust-gpu.github.io/blog/2025/07/25/rust-on-every-gpu/",
    "summary": "This article details a Rust demo achieving cross-platform GPU compute, enabling a single, shared Rust codebase to run on diverse GPU platforms (NVIDIA CUDA, Vulkan/SPIR-V, Apple Metal, DirectX 12, WebGPU) and CPU fallback without specialized shader languages. It highlights three key Rust projects facilitating this: Rust GPU (compiles to SPIR-V), Rust CUDA (compiles to NVVM IR), and Naga (GPU language translation).\n\nThe demo implements a bitonic sort, showcasing Rust's strengths for GPU programming, including `no_std` support, conditional compilation, newtypes, enums, traits, inline functions, struct composition, memory layout control, pattern matching, and generics. These features contribute to writing clear, type-safe, and efficient GPU code directly in Rust.\n\nThe article explains how backends are selected via feature flags and compilation targets. The kernel compilation process involves compiling Rust code to device-specific formats, embedded into the binary at build time. It then details the build and runtime processes for various backends (wgpu, CUDA) including the translation steps by Naga. By utilizing Rust's core features, the project demonstrates that GPU programming can be more integrated and type-safe, reducing complexity and improving code reuse compared to traditional GPU programming methods. This is a milestone, showcasing the potential for Rust in GPU development.\n",
    "chinese_title": "在所有GPU上运行Rust",
    "chinese_summary": "本文详细介绍了一个 Rust 演示，该演示实现了跨平台 GPU 计算，使得单个共享的 Rust 代码库能够在不同的 GPU 平台（NVIDIA CUDA、Vulkan/SPIR-V、Apple Metal、DirectX 12、WebGPU）和 CPU 后备方案上运行，而无需专门的着色器语言。它重点介绍了三个关键的 Rust 项目，促进了这一实现：Rust GPU（编译为 SPIR-V）、Rust CUDA（编译为 NVVM IR）和 Naga（GPU 语言翻译）。\n\n该演示实现了一个双调排序，展示了 Rust 在 GPU 编程方面的优势，包括 `no_std` 支持、条件编译、newtypes、枚举、traits、内联函数、结构体组合、内存布局控制、模式匹配和泛型。这些特性有助于直接用 Rust 编写清晰、类型安全和高效的 GPU 代码。\n\n本文解释了如何通过特性标志和编译目标选择后端。内核编译过程包括将 Rust 代码编译为设备特定的格式，并在构建时嵌入到二进制文件中。然后，它详细介绍了各种后端（wgpu、CUDA）的构建和运行时过程，包括 Naga 的翻译步骤。通过利用 Rust 的核心特性，该项目证明了 GPU 编程可以更加集成化和类型安全，与传统的 GPU 编程方法相比，可以降低复杂性并提高代码重用率。这是一个里程碑，展示了 Rust 在 GPU 开发中的潜力。"
  },
  {
    "id": "44658009",
    "title": "Font-size-adjust Is Useful",
    "url": "https://matklad.github.io/2025/07/16/font-size-adjust.html",
    "summary": "This article advocates for a more widespread and different use of the CSS property `font-size-adjust` than commonly understood. The author explains that `font-size` defines the size of a box around a glyph, not the glyph itself, leading to inconsistencies in how fonts of the same size appear.  `font-size-adjust` allows scaling a font based on its ex-height (the height of the letter \"x\"), aiming to create more consistent visual appearance across different fonts.\n\nThe author challenges the common perception that `font-size-adjust` is primarily useful for font fallback scenarios. Instead, they argue that it's more valuable for ensuring consistent font sizes across a website that uses multiple fonts, and to mitigate visual changes caused by potential future font changes.  The author suggests including `font-size-adjust: ex-height 0.53;` in CSS resets, alongside properties like `box-sizing: border-box`, to establish a more predictable and unified font sizing standard across a project. They picked 0.53 because it is the ratio for Helvetica, but they suggest that any number in that vicinity should work.\n",
    "chinese_title": "字体大小调整很有用",
    "chinese_summary": "本文倡导对CSS属性`font-size-adjust`进行更广泛和不同于通常理解的用法。作者解释说，`font-size`定义的是字形周围的盒子大小，而不是字形本身，导致相同大小的字体显示不一致。`font-size-adjust`允许基于字体的x高度（字母“x”的高度）缩放字体，旨在为不同的字体创建更一致的视觉外观。\n\n作者挑战了`font-size-adjust`主要用于字体回退场景的普遍看法。相反，他们认为它对于确保使用多种字体的网站上字体大小的一致性，以及减轻潜在的未来字体更改引起的视觉变化更有价值。作者建议在CSS重置中包含`font-size-adjust: ex-height 0.53;`，以及像`box-sizing: border-box`这样的属性，以在整个项目中建立更可预测和统一的字体大小标准。他们选择0.53是因为它是Helvetica的比率，但他们认为该范围内的任何数字都应该有效。"
  },
  {
    "id": "44695159",
    "title": "Is the Interstellar Object 3I/Atlas Alien Technology?",
    "url": "https://arxiv.org/abs/2507.12213",
    "summary": "This arXiv article, submitted in July 2025, explores the possibility that the interstellar object 3I/ATLAS might be alien technology. Authored by Adam Hibberd, Adam Crowl, and Abraham Loeb, the paper analyzes the object's astrodynamics and posits that its characteristics are anomalous enough to warrant considering a technological origin, specifically within the context of the \"Dark Forest\" theory (a pessimistic resolution to the Fermi Paradox suggesting hostile extraterrestrial life avoids detection).\n\nThe authors highlight the extremely low probability (less than 0.005%) of 3I/ATLAS's close approaches to Venus, Mars, and Jupiter. Furthermore, the low inclination of its orbit relative to the ecliptic provides an ETI with easier access to Earth.\n\nThe paper also speculates on a hypothetical \"reverse Solar Oberth Manoeuvre\" during perihelion, where 3I/ATLAS could utilize a clandestine solar eclipse to brake and become Sun-bound. They propose an optimal Earth intercept in late November/early December 2025, requiring a non-gravitational acceleration of roughly 5.9 x 10^-5 au day^-2 at 1 au. The authors also suggest that the object’s trajectory might indicate an intention to rendezvous with Jupiter after perihelion, implying that the observed non-gravitational acceleration would assist with such a manoeuvre.\n\nThe article stresses that the analysis is primarily pedagogical, presenting a hypothesis for consideration based on observed anomalies and theoretical possibilities. The subject classifications include Earth and Planetary Astrophysics, Astrophysics of Galaxies, and Instrumentation and Methods for Astrophysics.\n",
    "chinese_title": "星际天体3I/Atlas是外星科技吗？",
    "chinese_summary": "这篇2025年7月提交的arXiv文章探讨了星际天体3I/ATLAS可能是外星科技的可能性。该论文由Adam Hibberd、Adam Crowl和Abraham Loeb撰写，分析了该天体的天体动力学，并认为其特性异常到足以考虑其技术起源，特别是在“黑暗森林”理论（费米悖论的一种悲观解释，认为具有敌意的外星生命会避免被发现）的背景下。\n\n作者强调了3I/ATLAS极低概率（小于0.005%）地接近金星、火星和木星。此外，其轨道相对于黄道面的低倾角为地外文明更容易接近地球提供了便利。\n\n该论文还推测了一种假想的“反向太阳奥伯特机动”，即3I/ATLAS可以在近日点期间利用隐蔽的日食来减速并变为太阳束缚。他们提出了在2025年11月下旬/12月初的最佳地球拦截方案，需要在1天文单位处产生约5.9 x 10^-5 天文单位/天^2的非引力加速度。作者还暗示，该天体的轨迹可能表明其有意在近日点后与木星会合，这意味着观察到的非引力加速度将有助于此类机动。\n\n该文章强调，该分析主要具有教学意义，基于观察到的异常现象和理论可能性，提出了一个供考虑的假设。主题分类包括地球和行星天体物理学、星系天体物理学以及天体物理学仪器和方法。"
  },
  {
    "id": "44695205",
    "title": "Earth Has Tilted 31.5 Inches. That Shouldn't Happen",
    "url": "https://www.popularmechanics.com/science/environment/a65515974/why-earth-has-tilted-science/",
    "summary": "This article discusses a study published in Geophysical Research Letters revealing that pumping groundwater has significantly impacted Earth's tilt and contributes to sea-level rise. Researchers found that between 1993 and 2010, the pumping of 2,150 gigatons of groundwater caused the Earth to tilt by 31.5 inches, contributing 0.24 inches to sea level rise.\n\nThe study highlights that redistributing water, especially from midlatitudes like western North America and northwestern India, has a considerable effect on Earth's rotation.  The researchers modeled Earth's rotational pole drift, and the only model that accurately matched the observed drift included the 2,150 gigatons of groundwater redistribution.\n\nThe findings suggest that groundwater pumping has a greater impact on the planet's tilt than previously understood, making it a significant factor in climate-related changes.  Understanding these effects, according to the study, can help with continent-scale water storage variations and aid in conservation efforts to address sea-level rise and other climate issues. The research emphasizes the power of water and its impact on the planet's mass distribution and rotation.\n",
    "chinese_title": "地球倾斜了31.5英寸，这不应该发生。",
    "chinese_summary": "地下水抽取显著影响地球倾斜并导致海平面上升"
  },
  {
    "id": "44693129",
    "title": "Bringing a decade old bicycle navigator back to life with open source software",
    "url": "https://raymii.org/s/blog/Bringing_a_Decade_Old_Bicycle_Navigator_Back_to_Life_with_Open_Source_Software_and_DOOM.html",
    "summary": "Remy van Elst resurrected a decade-old Navman Bike 1000 bicycle navigator, originally a rebadged Mio Cyclo 200, using open-source software and reverse engineering. Faced with planned obsolescence due to outdated maps and failed official update downloads, he explored the device's inner workings.\n\nUsing mitmproxy and WireShark, he intercepted network requests from the desktop software, revealing download URLs for firmware and map updates, though the map URLs were inactive. He discovered the device ran Windows CE 6.0 and found a program called \"DODGE.exe\" which he then replaced with Total Commander to access and explore the device's file system.\n\nThis allowed him to install and run other Windows CE applications, including DOOM, and most importantly, NAVeGIS. NAVeGIS, an open-source navigation application compatible with OpenStreetMap, was used with OpenFietsMap maps.\n\nBy loading the open-source maps onto a Micro SD card, van Elst successfully updated the navigation system. While some features like audio hints and track recording were missing, the updated maps and routing capabilities made the device usable for cycling navigation again, effectively bypassing the manufacturer's planned obsolescence. He emphasizes that since the solution is open-source, future map provider changes won't prevent future updates.\n",
    "chinese_title": "用开源软件复活一台十年旧的自行车导航仪",
    "chinese_summary": "雷米·范·埃尔斯特通过开源软件和逆向工程，复活了一台十年前的Navman Bike 1000自行车导航仪，这款导航仪原本是重新贴牌的Mio Cyclo 200。由于过时的地图和官方更新下载失败，该设备面临着计划报废，他便探索了设备的内部运作。\n\n他使用mitmproxy和WireShark拦截了桌面软件的网络请求，揭示了固件和地图更新的下载URL，尽管地图URL已失效。他发现该设备运行的是Windows CE 6.0，并找到一个名为“DODGE.exe”的程序，随后用Total Commander替换了它，以便访问和探索设备的文件系统。\n\n这使他能够安装和运行其他Windows CE应用程序，包括DOOM，以及最重要的NAVeGIS。NAVeGIS是一款与OpenStreetMap兼容的开源导航应用程序，与OpenFietsMap地图一起使用。\n\n通过将开源地图加载到Micro SD卡上，范·埃尔斯特成功地更新了导航系统。虽然缺少一些功能，如音频提示和轨迹记录，但更新后的地图和路线规划功能使该设备再次可以用于自行车导航，有效地绕过了制造商的计划报废。他强调，由于该解决方案是开源的，未来地图提供商的变更不会阻止未来的更新。"
  },
  {
    "id": "44656516",
    "title": "Breaking the WASM/JS communication performance barrier",
    "url": "https://github.com/ealmloff/sledgehammer_bindgen",
    "summary": "Sledgehammer bindgen is a Rust tool designed to accelerate WASM/JS communication, specifically for web frameworks requiring fast, low-level DOM access. Unlike the more general-purpose `wasm-bindgen`, Sledgehammer focuses on optimized batched bindings.\n\nIts speed advantages stem from several key optimizations:\n\n1.  **Efficient String Decoding:** Instead of calling `TextDecoder.decode` for each string (like `wasm-bindgen`), Sledgehammer decodes strings in larger batches, reducing the overhead. For small strings, it even bypasses the decoder entirely for faster JS processing. String caching further avoids redundant decoding. If the string is static, sledgehammer will hash by pointer instead of by value.\n\n2.  **Byte-Encoded Operations:** Operations are encoded as compact byte sequences within an array. Sledgehammer batches these operations into u32 chunks, minimizing the performance impact of array buffer access by strategically splitting and inlining the bytes.\n\nIn essence, Sledgehammer prioritizes speed by minimizing string decoding costs and optimizing the data transfer process through byte encoding and batch processing. While less versatile than `wasm-bindgen`, it's a potent choice for performance-critical web framework scenarios where direct DOM manipulation is key.\n",
    "chinese_title": "打破WASM/JS通信性能壁垒",
    "chinese_summary": "Sledgehammer bindgen 是一款 Rust 工具，旨在加速 WASM/JS 通信，尤其适用于需要快速、底层 DOM 访问的 Web 框架。与更通用的 `wasm-bindgen` 不同，Sledgehammer 专注于优化的批量绑定。\n\n其速度优势源于几个关键优化：\n\n1.  **高效的字符串解码：** Sledgehammer 不像 `wasm-bindgen` 那样为每个字符串调用 `TextDecoder.decode`，而是以更大的批次解码字符串，从而降低了开销。对于小字符串，它甚至完全绕过解码器以实现更快的 JS 处理。字符串缓存进一步避免了冗余解码。如果字符串是静态的，Sledgehammer 将按指针而不是按值进行哈希。\n\n2.  **字节编码操作：** 操作被编码为数组中紧凑的字节序列。 Sledgehammer 将这些操作分批处理成 u32 块，通过策略性地拆分和内联字节，最大限度地减少数组缓冲区访问对性能的影响。\n\n本质上，Sledgehammer 通过最大限度地降低字符串解码成本以及通过字节编码和批量处理优化数据传输过程来优先考虑速度。虽然不如 `wasm-bindgen` 通用，但对于直接 DOM 操作至关重要且对性能要求苛刻的 Web 框架场景来说，它是一个强大的选择。"
  },
  {
    "id": "44657550",
    "title": "Open Sauce is a confoundingly brilliant Bay Area event",
    "url": "https://www.jeffgeerling.com/blog/2025/open-sauce-confoundingly-brilliant-bay-area-event",
    "summary": "This article chronicles the author's experience at Open Sauce, a Bay Area maker faire-like event created by William Osman. The event features a wide array of exhibits, from mad science contraptions to vintage electronics and even Rubik's Cube solvers. The author, accompanied by his retired radio engineer father, highlights the unique aspect of the event being the presence of many YouTube makers and hobbyists, including CuriousMarc, TubeTime, and Ken Sheriff.\n\nThe author created three vlogs documenting the event, showcasing a walking coffee table with a cooler, and interactions with attendees from Meshtastic, ADSBee, and Framework. He also participated in a panel on reverse engineering on William Osman's new platform, Sauce+. A highlight was meeting NASA astronaut Matthew Dominick, who discussed his homelab project for processing RAW photos from the ISS and his advocacy for greater sharing of these files.\n\nThe author contrasts the Bay Area south of SFO with San Francisco and notes the unique opportunities for finding valuable vintage tech. He emphasizes the event's potential for fostering innovation and is excited for its future, hoping it maintains its current spirit. He sees Open Sauce as a place where the past and future of technology converge, driven by students, tinkerers, and the unique ecosystem of the Bay Area.\n",
    "chinese_title": "Open Sauce 是一个令人困惑但又才华横溢的湾区活动。",
    "chinese_summary": "本文记录了作者在Open Sauce的经历，这是一个由William Osman创建的、类似于湾区创客嘉年华的活动。该活动汇集了各种各样的展品，从疯狂的科学装置到老式电子产品，甚至是魔方解算器。作者在他的退休无线电工程师父亲的陪同下，强调了该活动的一个独特之处，即许多YouTube创客和爱好者的出现，包括CuriousMarc、TubeTime和Ken Sheriff。\n\n作者制作了三个视频博客记录该活动，展示了一个带冷却器的步行咖啡桌，以及与来自Meshtastic、ADSBee和Framework的与会者的互动。他还参与了William Osman新平台Sauce+上的逆向工程小组讨论。一个亮点是与NASA宇航员Matthew Dominick的会面，他讨论了他用于处理国际空间站RAW照片的家庭实验室项目，以及他倡导更多地共享这些文件。\n\n作者将旧金山国际机场以南的湾区与旧金山进行了对比，并指出了寻找有价值的古董技术的独特机会。他强调了该活动在促进创新方面的潜力，并对其未来感到兴奋，希望它能保持目前的精神。他认为Open Sauce是技术过去和未来汇聚的地方，由学生、修补匠和湾区独特的生态系统驱动。"
  },
  {
    "id": "44690911",
    "title": "CCTV footage captures the first-ever video of an earthquake fault in motion",
    "url": "https://www.smithsonianmag.com/smart-news/cctv-footage-captures-the-first-ever-video-of-an-earthquake-fault-in-motion-shining-a-rare-light-on-seismic-dynamics-180987034/",
    "summary": "A CCTV camera in Myanmar captured the first-ever video of an earthquake fault in motion during a devastating magnitude 7.7 earthquake in March 2025. Geophysicist Jesse Kearse noticed the curved slip of the fault in the video, which triggered investigation by himself and geophysicist Yoshihiro Kaneko.\n\nAnalyzing the footage frame-by-frame, they found the fault slipped about 8.2 feet to the side for approximately 1.3 seconds, reaching a peak velocity of about 10.5 feet per second. This suggests the earthquake was pulse-like, with a concentrated burst of slip traveling along the fault.\n\nThe findings, published in The Seismic Record, indicate that curved slip paths are more common than previously thought, potentially due to lower stress on the fault at the surface. This research supports the idea that curved slickenlines, or scratches on the surface of a fault, can indicate the direction of an earthquake's rupture. The models based on the curvature matched the reality, traveling from North to South.\n\nThis groundbreaking footage and analysis offer valuable insights into the physics of earthquakes. It can help seismologists and geologists better predict future ruptures and improve infrastructure resilience, ultimately saving lives. Kearse and his team plan to further investigate fault behavior using physics models.\n",
    "chinese_title": "央视捕捉到地震断层首次移动影像",
    "chinese_summary": "缅甸一监控摄像头首次拍到2025年3月7.7级地震中地震断层运动视频。地球物理学家Jesse Kearse在视频中注意到断层弯曲滑动，促使他与地球物理学家Yoshihiro Kaneko展开调查。\n\n逐帧分析录像后，他们发现断层在约1.3秒内横向滑动约8.2英尺，峰值速度达到约10.5英尺/秒。这表明地震是脉冲式的，沿着断层传播着集中的滑动爆发。\n\n发表在《地震记录》上的研究结果表明，弯曲滑动路径比以前认为的更为常见，这可能是由于断层表面应力较低。这项研究支持了弯曲的擦痕线（断层表面上的划痕）可以指示地震破裂方向的观点。基于曲率的模型与现实相符，从北向南传播。\n\n这段开创性的录像和分析为了解地震物理学提供了宝贵的见解。它可以帮助地震学家和地质学家更好地预测未来的破裂，并提高基础设施的弹性，最终挽救生命。Kearse和他的团队计划使用物理模型进一步研究断层行为。"
  },
  {
    "id": "44676363",
    "title": "Upsides and Downsides",
    "url": "https://calv.info/upsides-and-downsides",
    "summary": "This article discusses the crucial shift startups must make as they mature, moving from prioritizing \"upsides\" to focusing on mitigating \"downsides.\" Drawing on Geoffrey Moore's \"crossing the chasm\" concept and Adam Mastroanni's \"strong-link/weak-link\" framework, the author explains that early-stage startups thrive on solving \"strong-link\" problems, emphasizing excellence in a single dimension and benefiting from variance. They attract early adopters who prioritize unique utility, tolerating potential downsides.\n\nHowever, as startups grow and aim for broader market adoption, they must address \"weak-link\" problems, minimizing failures across all dimensions like uptime, security, and cost. This shift requires a focus on reliability and risk reduction to appeal to late adopters. The article highlights the challenges of this transition, often resulting in stalled revenue, decreased product velocity, and increased churn.\n\nThe author suggests balancing \"production-grade\" infrastructure with innovation by using the McKinsey horizon's framework (60% core, 30% emerging, 10% new bets). He uses the example of Segment, which strategically balances improvements to their core business with launching new experimental products.\n\nFinally, the article applies this concept to the current landscape of AI-powered products, arguing that many are still stuck in the \"upside\" phase, excelling in demos but lacking the reliability needed for mass adoption. To succeed, AI products must \"just work,\" addressing downside concerns to gain trust and achieve widespread use. The key is to constantly assess whether customers prioritize potential benefits or risk mitigation.\n",
    "chinese_title": "优点与缺点",
    "chinese_summary": "初创企业成熟之路：从重视“收益”到关注“风险”"
  },
  {
    "id": "44657803",
    "title": "Yes, the Book of PF, Fourth Edition Is Coming Soon",
    "url": "https://bsdly.blogspot.com/2025/07/yes-book-of-pf-4th-edition-is-coming.html",
    "summary": "Peter N.M. Hansteen announces the upcoming fourth edition of \"The Book of PF,\" slated for release in the second half of 2025. This edition is updated to reflect the current state of the internet and is written from the perspective of users working with OpenBSD 7.8 or FreeBSD 14-STABLE.\n\nThe primary reason for the update is to bring the book in line with modern network realities, addressing changes in PF configuration and functionalities since the third edition was published in 2014. While previous editions remain valuable, the fourth edition incorporates significant updates, especially on the FreeBSD side, earning it the nickname \"be nice to FreeBSD edition.\" NetBSD's shift to NPF and DragonFly BSD's outdated PF version led to a focus on OpenBSD and FreeBSD.\n\nThe project was spurred by consistent inquiries about a new edition, particularly for FreeBSD, following years of Network Management with the OpenBSD Packet Filter Toolset tutorials presented by Hansteen, Max Stucchi, and Tom Smyth. Annotations and revision notes compiled after EuroBSDCon 2023 eventually convinced Hansteen to pursue the project.\n\nHenning Brauer and Kristof Provost served as technical reviewers, and the editing process was extensive. The book will cover PF on modern OpenBSD and FreeBSD versions, with only brief mentions of other platforms. Hansteen anticipates having physical copies available at EuroBSDcon 2025 in Zagreb, where he will also present an updated tutorial. He welcomes feedback and input from readers.\n",
    "chinese_title": "是的，《PF手册》第四版即将推出",
    "chinese_summary": "Peter N.M. Hansteen宣布《PF之书》第四版即将于2025年下半年发行。此版本已更新，反映了当前互联网的状况，并从使用OpenBSD 7.8或FreeBSD 14-STABLE用户的角度编写。\n\n此次更新的主要原因是使本书与现代网络现实相符，解决了自2014年第三版发布以来PF配置和功能的变更。虽然以前的版本仍然有价值，但第四版包含了重大更新，尤其是在FreeBSD方面，因此获得了“对FreeBSD友好的版本”的昵称。NetBSD转向NPF以及DragonFly BSD的PF版本过时，促使本书专注于OpenBSD和FreeBSD。\n\n该项目的启动源于对新版本的持续询问，特别是针对FreeBSD，此前Hansteen、Max Stucchi和Tom Smyth已经做了多年的OpenBSD数据包过滤器工具集网络管理教程。在EuroBSDCon 2023之后汇编的注释和修订说明最终说服Hansteen继续进行该项目。\n\nHenning Brauer和Kristof Provost担任技术审阅，编辑过程非常广泛。本书将涵盖现代OpenBSD和FreeBSD版本上的PF，仅简要提及其他平台。Hansteen预计将在萨格勒布举行的EuroBSDcon 2025上提供纸质版，届时他还将展示更新后的教程。他欢迎读者的反馈和意见。"
  },
  {
    "id": "44688489",
    "title": "It's time for modern CSS to kill the SPA",
    "url": "https://www.jonoalderson.com/conjecture/its-time-for-modern-css-to-kill-the-spa/",
    "summary": "In his article, \"It's time for modern CSS to kill the SPA,\" Jono Alderson argues that Single Page Applications (SPAs), once seen as the only way to achieve fluid navigation, are now often unnecessary and detrimental to website performance. He posits that modern CSS, specifically View Transitions and Speculation Rules, offers a superior alternative.\n\nView Transitions, a browser API, allows for smooth, animated transitions between entire web pages without JavaScript. Speculation Rules enables browsers to preload or prerender pages based on user behavior, resulting in near-instant navigation. Alderson argues these features can replace the complex JavaScript-heavy routing and hydration logic that SPAs rely on.\n\nHe criticizes SPAs for often failing to deliver on their promise of polish, citing issues like broken scroll restoration, inconsistent focus behavior, and performance hits disproportionate to their visual effects. He contrasts the large JavaScript bundles and slow Time to Interactive (TTI) typical of SPA-based sites with the 0KB JavaScript bundle and faster TTI achievable with a modern, multi-page architecture (MPA) using View Transitions and Speculation Rules.\n\nAlderson suggests that many websites, particularly those that are content focused like marketing sites and blogs, are over-engineered when built as SPAs. He advocates for a return to simpler, HTML-driven architectures, using native browser features and CSS for animations, resulting in faster, more maintainable websites with better SEO and accessibility. He concludes that building sites like it's 2025, leveraging the power of modern browsers, leads to better user experiences and fewer developer regrets.\n",
    "chinese_title": "现代 CSS 是时候终结 SPA 了",
    "chinese_summary": "在他的文章《是时候让现代CSS终结SPA了》中，Jono Alderson认为单页应用(SPA)曾经被认为是实现流畅导航的唯一途径，但现在往往是不必要的，并且对网站性能有害。他提出，现代CSS，特别是视图过渡和推测规则，提供了一种更优越的替代方案。\n\n视图过渡是一个浏览器API，允许在整个网页之间进行平滑的动画过渡，而无需JavaScript。推测规则使浏览器能够根据用户行为预加载或预渲染页面，从而实现近乎即时的导航。Alderson认为这些功能可以取代SPA所依赖的复杂的、JavaScript繁重的路由和水合逻辑。\n\n他批评SPA常常未能兑现其润色的承诺，并列举了诸如滚动恢复失败、焦点行为不一致以及性能下降与视觉效果不成比例等问题。他将基于SPA的网站典型的大型JavaScript包和缓慢的交互时间(TTI)与使用视图过渡和推测规则的现代多页架构(MPA)可实现的0KB JavaScript包和更快的TTI进行了对比。\n\nAlderson认为，许多网站，特别是那些以内容为中心的网站，如营销网站和博客，当作为SPA构建时，会被过度设计。他提倡回归更简单的、HTML驱动的架构，使用原生浏览器功能和CSS进行动画，从而实现更快、更易于维护的网站，并具有更好的SEO和可访问性。他总结说，像2025年那样构建网站，利用现代浏览器的强大功能，可以带来更好的用户体验和更少的开发者遗憾。"
  },
  {
    "id": "44656961",
    "title": "The rise and fall of the Hanseatic League",
    "url": "https://worksinprogress.co/issue/the-rise-and-fall-of-the-hanseatic-league/",
    "summary": "The article chronicles the rise of the Hanseatic League, a medieval coalition of German merchants that transformed Northern European trade. Beginning with individual traders forming \"hansas\" for safety and collective bargaining, the League developed into a powerful economic force spanning from London to Russia. They established supply chains, governed trade hubs, and negotiated treaties, all without a central governing body.\n\nThe article highlights the factors contributing to the League's emergence. The Dark Ages saw a decline in European population and trade due to factors like climate change and the collapse of Roman infrastructure. However, a \"Medieval Agricultural Revolution\" brought about increased crop yields, leading to a population boom and the rise of specialized crafts and towns. Innovations in shipbuilding, particularly the knarr and later the cog, improved shipping capacity.\n\nEarly trade was fraught with dangers, including pirates, tolls, and unreliable legal systems. \"Hansas\" addressed these challenges by traveling in armed groups, collectively negotiating trade rights, and providing mutual protection. The League facilitated long-distance trade, as evidenced by the scale of goods like squirrel pelts from Novgorod and grain from Poland. This transformation spurred industrial growth, exemplified by the Scandinavian fish industry and the Flemish cloth trade. English wool production flourished, leading to wealthy merchants and impressive \"wool churches.\" By the 13th century, the cog replaced the knarr as the dominant vessel, further facilitating trade across the Baltic.\n",
    "chinese_title": "汉萨同盟的兴衰",
    "chinese_summary": "本文记录了汉萨同盟的崛起，这是一个中世纪德国商人联盟，它改变了北欧贸易。最初是单个商人为安全和集体谈判而组成“汉萨”，该联盟发展成为一股强大的经济力量，横跨伦敦到俄罗斯。他们在没有中央管理机构的情况下，建立供应链，管理贸易中心，并谈判条约。\n\n本文重点介绍了促成该联盟出现的因素。由于气候变化和罗马基础设施的崩溃等因素，黑暗时代欧洲人口和贸易衰退。然而，“中世纪农业革命”带来了作物产量的增加，导致人口激增以及专业手工艺和城镇的兴起。造船技术的创新，特别是克纳尔船（knarr）和后来的科格船（cog），提高了运输能力。\n\n早期贸易充满了危险，包括海盗、通行费和不可靠的法律体系。“汉萨”通过武装团体旅行，集体谈判贸易权利，并提供相互保护来应对这些挑战。该联盟促进了长途贸易，例如来自诺夫哥罗德的松鼠皮和来自波兰的谷物等商品的规模就证明了这一点。这种转变刺激了工业增长，斯堪的纳维亚半岛的渔业和佛兰德的布料贸易就是例证。英国的羊毛产量蓬勃发展，孕育了富有的商人和令人印象深刻的“羊毛教堂”。到13世纪，科格船取代了克纳尔船，成为主要船只，进一步促进了波罗的海的贸易。"
  },
  {
    "id": "44691935",
    "title": "Simon Tatham's Portable Puzzle Collection",
    "url": "https://www.chiark.greenend.org.uk/~sgtatham/puzzles/",
    "summary": "Simon Tatham's Portable Puzzle Collection is a compilation of single-player puzzle games designed to be lightweight and playable on various platforms, including Unix, Windows, and the web (via JavaScript/WebAssembly). The author created the collection to offer quick, engaging desktop toys accessible across different operating systems.\n\nThe collection features re-implementations of existing puzzle concepts, with credit given to the original inventors. Games include popular puzzles like Black Box, Bridges, Dominosa, Fifteen, Mines, and many more. Each game has a link for online play and a Windows executable download, along with a link to its manual.\n\nThe collection is licensed under the MIT license, allowing users broad freedom to use and modify the games, with the stipulation of proper attribution.\n\nThe website provides downloads for Windows executables, a Windows help file, a Windows installer, and the source code for compilation on Unix-like systems. It also includes links to third-party ports for mobile devices like Android and iOS. The author is no longer supporting the MacOS version.\n\nDevelopers can contribute by creating new puzzles or front ends, utilizing the provided developer documentation and the git repository for the source code. Bug reports and patches are welcomed, with specific instructions on providing relevant information for puzzle-related issues.\n",
    "chinese_title": "西蒙·塔特姆的便携谜题集",
    "chinese_summary": "西蒙·塔特姆的便携谜题集锦是一个单人益智游戏合集，旨在轻量化并在各种平台（包括Unix、Windows和网络（通过JavaScript/WebAssembly））上运行。作者创建此合集是为了提供可在不同操作系统上访问的快速、引人入胜的桌面玩具。\n\n该合集包含现有谜题概念的重新实现，并注明了原始发明者的信息。游戏包括流行的谜题，如黑盒、桥、多米诺、十五拼图、扫雷等等。每个游戏都有在线游戏链接和一个Windows可执行文件下载，以及一个手册链接。\n\n该合集以MIT许可证授权，允许用户广泛地使用和修改游戏，但需注明出处。\n\n该网站提供Windows可执行文件、Windows帮助文件、Windows安装程序以及用于在类Unix系统上编译的源代码的下载。它还包括指向Android和iOS等移动设备第三方移植版本的链接。作者不再支持MacOS版本。\n\n开发者可以通过创建新的谜题或前端来贡献，使用提供的开发者文档和git仓库中的源代码。欢迎提交错误报告和补丁，并附上针对谜题相关问题的相关信息的具体说明。"
  },
  {
    "id": "44658665",
    "title": "Inverted Indexes: A Step-by-Step Implementation Guide",
    "url": "https://www.chashnikov.dev/post/inverted-indexes-a-step-by-step-implementation-guide",
    "summary": "This article provides a step-by-step guide to implementing an inverted index for efficient document searching. It begins by explaining the need for inverted indexes, highlighting their scalability advantage over simply scanning each document for keywords. The core idea is to create a \"database\" where words (tokens) are keys, and the values are document IDs (filenames) containing those words.\n\nThe article walks through building an `InvertedIndex` class with `add` and `getDocumentsForToken` methods. It then introduces an `IndexGenerator` class, which reads files, splits the text into tokens, cleans them (removing stop words, tags, and numbers), and adds them to the index.\n\nTo improve performance, the article demonstrates how to parallelize the indexing process using Scala's parallel collections. A `merge` method is added to the `InvertedIndex` to combine indexes generated by different threads. The `runIndexer` function splits the files to be indexed into groups, processes each group in parallel using `IndexGenerator`, and then merges the resulting indexes into a single final index.\n\nIn conclusion, the article demonstrates a basic implementation of an inverted index, covers essential text processing considerations, and explains how to leverage multi-threading to enhance indexing speed. The author emphasizes that this is a simplified implementation, but a solid foundation for building more complex document indexing and querying systems.\n",
    "chinese_title": "倒排索引：循序渐进的实现指南",
    "chinese_summary": "本文提供了一份逐步指南，用于实现倒排索引以进行高效的文档搜索。首先解释了对倒排索引的需求，强调了其相对于简单扫描每个文档以查找关键字的可扩展性优势。核心思想是创建一个“数据库”，其中单词（标记）是键，而值是包含这些单词的文档 ID（文件名）。\n\n本文逐步介绍了如何构建具有`add`和`getDocumentsForToken`方法的`InvertedIndex`类。然后介绍了一个`IndexGenerator`类，该类读取文件，将文本拆分为标记，清理它们（删除停用词、标签和数字），并将它们添加到索引中。\n\n为了提高性能，本文演示了如何使用 Scala 的并行集合来并行化索引过程。将`merge`方法添加到`InvertedIndex`，以合并由不同线程生成的索引。`runIndexer`函数将要索引的文件分成组，使用`IndexGenerator`并行处理每组文件，然后将生成的索引合并到单个最终索引中。\n\n总之，本文演示了倒排索引的基本实现，涵盖了必要的文本处理注意事项，并解释了如何利用多线程来提高索引速度。作者强调这是一个简化的实现，但它是构建更复杂的文档索引和查询系统的坚实基础。"
  },
  {
    "id": "44695190",
    "title": "Ageing accelerates around age 50 ― some organs faster than others",
    "url": "https://www.nature.com/articles/d41586-025-02333-z",
    "summary": "This article reports on a study published in *Cell* that investigates how ageing affects different organs at varying rates. Researchers analyzed tissue samples from 76 individuals aged 14-68 to examine protein changes over time. The study suggests that ageing accelerates around age 50, an \"inflection point,\" with some tissues, particularly blood vessels like the aorta, ageing faster than others.\n\nThe research identified age-related increases in 48 disease-associated proteins and found early changes in the adrenal gland around age 30, which aligns with the known significance of hormonal and metabolic shifts during ageing. The aorta showed the most dramatic changes in protein levels between ages 45 and 55, and a specific protein from the aorta was found to accelerate ageing in mice. The researchers hypothesize that blood vessels may act as carriers, distributing ageing-promoting molecules throughout the body.\n\nWhile the study indicates a potential ageing acceleration around age 50, other experts caution that larger studies are needed to definitively confirm this as a universal \"crisis point.\" The findings contribute to the growing understanding of ageing as a non-linear process with distinct periods of rapid change and reinforce the idea that individual organs age at different rates.\n",
    "chinese_title": "衰老在50岁左右加速——有些器官比其他器官更快",
    "chinese_summary": "本文报道了一项发表在《细胞》杂志上的研究，该研究调查了衰老如何以不同的速度影响不同的器官。研究人员分析了76名年龄在14-68岁个体中的组织样本，以检查蛋白质随时间的变化。该研究表明，衰老在50岁左右加速，这是一个“拐点”，其中一些组织，特别是像主动脉这样的血管，衰老速度比其他组织更快。\n\n该研究确定了48种与疾病相关的蛋白质随年龄增长而增加的情况，并发现肾上腺在30岁左右出现早期变化，这与衰老过程中已知的激素和代谢转变的重要性相符。主动脉在45至55岁之间显示出最显著的蛋白质水平变化，并且发现来自主动脉的一种特定蛋白质可以加速小鼠的衰老。研究人员假设，血管可能充当载体，将促进衰老的分子分布到全身。\n\n虽然该研究表明衰老可能在50岁左右加速，但其他专家警告说，需要进行更大规模的研究才能明确证实这是一个普遍的“危机点”。这些发现有助于人们日益了解衰老是一个非线性过程，具有明显的快速变化时期，并强化了单个器官以不同速度衰老的观点。"
  },
  {
    "id": "44658127",
    "title": "Instapaper Rakuten Kobo Integration",
    "url": "https://blog.instapaper.com/post/789685899750424576/instapaper-rakuten-kobo-integration",
    "summary": "This article announces a new integration between Instapaper and Rakuten Kobo eReaders, set to launch at the end of summer 2025. This integration will allow Kobo users to seamlessly save and read web articles directly on their devices, replacing Kobo's previous integration with Pocket, which recently shut down.\n\nInstapaper emphasizes its clean, distraction-free reading experience and organization tools as benefits for former Pocket users migrating to the platform. Instructions are provided for Pocket users to easily import their articles to Instapaper either with a 2-click process on the Instapaper website or by importing a Pocket export file through Instapaper's settings.\n\nThe announcement expresses excitement about partnering with Rakuten Kobo to power the \"read-it-later\" functionality on their eReaders. Contact information for support is provided for any questions or concerns. User comments following the announcement express excitement and also a request for Kindle integration.\n",
    "chinese_title": "Instapaper 乐天 Kobo 集成",
    "chinese_summary": "Instapaper与乐天Kobo电子书阅读器将于2025年夏末推出全新集成。此次集成将允许Kobo用户在其设备上无缝保存和阅读网页文章，取代Kobo之前与已关闭的Pocket的集成。\n\nInstapaper强调其简洁、无干扰的阅读体验和组织工具，是前Pocket用户迁移到该平台的优势。提供了Pocket用户轻松将其文章导入Instapaper的说明，可以通过Instapaper网站上的2次点击流程或通过Instapaper设置导入Pocket导出文件。\n\n该公告表达了与乐天Kobo合作，为其电子书阅读器提供“稍后阅读”功能的兴奋之情。如有任何问题或疑虑，请联系提供的支持信息。公告后的用户评论表达了兴奋之情，并提出了Kindle集成的请求。"
  },
  {
    "id": "44658745",
    "title": "The append-and-review note",
    "url": "https://karpathy.bearblog.dev/the-append-and-review-note/",
    "summary": "The \"append-and-review note\" is a simple note-taking system that relies on a single, long text note. The core principles are:\n\n*   **Single Note:** All notes are appended to one file (e.g., in Apple Notes) to avoid cognitive overhead from managing multiple files and folder structures. This facilitates easy searching with CTRL+F.\n*   **Append:** Any new thought, to-do item, or idea is added to the top of the note as plain text. Minimal metadata is used, except for tags like \"watch:\", \"listen:\", or \"read:\" for easy categorization.\n*   **Review:** Periodically, the user scrolls through the note, rescuing valuable items by copying and pasting them to the top. This keeps important ideas visible while allowing less relevant notes to naturally sink towards the bottom. Notes are rarely deleted.\n\nThe approach is useful for capturing random ideas, remembering recommendations, creating temporary to-do lists, drafting content, storing useful commands, recording experiment results, and clearing mental clutter. The act of writing things down provides a sense of cognitive offloading. Reviewing the accumulated notes can lead to new insights by merging related thoughts or revisiting old ideas in a new context. The system helps prioritize what's currently important and provides a historical record of past thoughts.\n",
    "chinese_title": "附加审阅说明",
    "chinese_summary": "追加回顾笔记\n追加回顾笔记是一种简单的笔记系统，依赖于一个单一的、长文本笔记。其核心原则是：\n\n*   **单一笔记：** 所有笔记都追加到一个文件（例如，在Apple Notes中），以避免管理多个文件和文件夹结构带来的认知负担。这有助于使用CTRL+F轻松搜索。\n*   **追加：** 任何新的想法、待办事项或灵感都以纯文本形式添加到笔记的顶部。只使用最少的元数据，除了诸如“watch:”、“listen:”或“read:”之类的标签，以便于分类。\n*   **回顾：** 用户定期滚动浏览笔记，将有价值的项目复制并粘贴到顶部进行挽救。这使得重要的想法保持可见，同时允许不太相关的笔记自然沉到底部。笔记很少被删除。\n\n这种方法对于捕捉随机想法、记住推荐、创建临时待办事项列表、起草内容、存储有用的命令、记录实验结果以及清理精神杂乱非常有用。将事情写下来的行为提供了一种认知卸载的感觉。回顾积累的笔记可以通过合并相关想法或在新环境中重温旧想法来产生新的见解。该系统有助于优先处理当前重要的事情，并提供过去想法的历史记录。"
  },
  {
    "id": "44691312",
    "title": "Users claim Discord's age verification can be tricked with video game characters",
    "url": "https://www.thepinknews.com/2025/07/25/discord-video-game-characters-age-verification-checks-uk-online-safety-act/",
    "summary": "This article discusses how users are reportedly tricking Discord's new age verification tool, implemented in the UK due to the Online Safety Act. The Act requires platforms hosting user-generated content to verify ages and protect minors from inappropriate content, with Ofcom having the power to fine non-compliant platforms.\n\nDiscord's age check, which requires users to provide a photo of their face or ID to access NSFW content, has been reportedly bypassed by users submitting pictures of high-fidelity video game characters. One user claimed success using a picture of Sam Porter Bridges from the game Death Stranding, even bypassing a secondary check by using the game's photo mode to simulate mouth movements.\n\nThe article also highlights concerns surrounding the UK Online Safety Act. The Electronic Frontier Foundation views the legislation as a threat to privacy and free speech, potentially leading to content scanning and filtering. Other concerns include the potential for the Act to force smaller websites to shut down. Following the Act's enactment, VPN searches in the UK significantly increased, as users seek to bypass regional restrictions. Ofcom has stated that platforms are not allowed to encourage VPN usage to circumvent age checks.\n",
    "chinese_title": "用户声称Discord的年龄验证能被游戏角色蒙混过关",
    "chinese_summary": "本文讨论了据报道用户如何欺骗Discord为遵守英国《网络安全法案》而实施的年龄验证工具。该法案要求托管用户生成内容的平台验证用户年龄，并保护未成年人免受不当内容侵害，Ofcom有权对不合规平台处以罚款。\n\n据报道，Discord的年龄验证（要求用户提供面部照片或身份证件以访问NSFW内容）已被用户提交高保真电子游戏角色照片绕过。一位用户声称使用游戏《死亡搁浅》中的山姆·布里吉斯照片成功通过验证，甚至通过使用游戏照片模式模拟嘴部动作绕过了二次验证。\n\n本文还强调了对英国《网络安全法案》的担忧。电子前沿基金会认为该法案是对隐私和言论自由的威胁，可能导致内容扫描和过滤。其他担忧包括该法案可能迫使小型网站关闭。在该法案颁布后，英国的VPN搜索量显着增加，因为用户试图绕过区域限制。Ofcom表示，平台不得鼓励使用VPN来规避年龄验证。"
  },
  {
    "id": "44689059",
    "title": "Do not download the app, use the website",
    "url": "https://idiallo.com/blog/dont-download-apps",
    "summary": "This article argues against downloading apps and advocates for using websites on mobile devices instead. It highlights how companies aggressively push users towards their apps, employing \"dark patterns\" to encourage downloads.\n\nThe main reason companies prefer app usage is data collection. Apps are designed to deeply integrate with devices, granting them access to a wealth of user information like contacts, location, microphone, and installed apps. Websites, on the other hand, have limited access without explicit user permission. This data extraction allows companies to build comprehensive user profiles and potentially exploit user behavior.\n\nThe author questions the genuine benefit of apps, suggesting that the perceived convenience often comes at the expense of privacy and control. Giving away personal information is easy, but retrieving it is almost impossible, even with regulations like GDPR.\n\nThe author concludes that using websites provides adequate functionality without sacrificing privacy. They emphasize that resisting the pressure to download apps is a win for user control and data security, allowing individuals to avoid becoming a \"constant digital spy\" in their pocket. The article also features related links, newsletter signup, author's social media handles, and a comment section where users discuss the content.\n",
    "chinese_title": "不要下载应用，使用网站。",
    "chinese_summary": "本文反对下载应用程序，提倡在移动设备上使用网站。文章强调了公司如何积极推动用户下载应用程序，并采用“黑暗模式”来鼓励下载。\n\n公司偏好应用程序使用的主要原因是数据收集。应用程序被设计为与设备深度集成，从而获取大量用户信息，例如联系人、位置、麦克风和已安装的应用程序。另一方面，未经用户明确许可，网站的访问权限受到限制。这种数据提取使公司能够建立全面的用户画像，并可能利用用户行为。\n\n作者质疑应用程序的真正好处，认为表面上的便利往往以牺牲隐私和控制为代价。泄露个人信息很容易，但即使有 GDPR 等法规，也很难取回。\n\n作者总结说，使用网站可以在不牺牲隐私的情况下提供足够的功能。他们强调，抵制下载应用程序的压力是对用户控制和数据安全的一次胜利，使个人能够避免成为口袋里的“持续数字间谍”。文章还包含相关链接、新闻通讯注册、作者社交媒体账号以及用户讨论内容的评论区。"
  },
  {
    "id": "44656419",
    "title": "Keep Pydantic out of your Domain Layer",
    "url": "https://coderik.nl/posts/keep-pydantic-out-of-your-domain-layer/",
    "summary": "This article advocates for keeping Pydantic out of the domain layer of your application. While Pydantic is convenient for data validation, especially in frameworks like FastAPI, its tight coupling can become a liability as the application grows. Maintaining separation of concerns makes code more maintainable, testable, and adaptable.\n\nThe author suggests using tools like Dacite to translate Pydantic models (typically used in presentation and infrastructure layers) into Plain Old Python Objects (POPOs) suitable for the domain layer. Dacite simplifies initializing nested dataclasses from dictionaries, reducing manual boilerplate.\n\nThe article presents a structured approach using repositories and mappers. The repository handles data persistence and retrieval, utilizing mappers to translate between data storage formats (like dictionaries or JSON) and domain entities. The application service then orchestrates operations, calling the repository to retrieve or save data and invoking domain logic on the entities.\n\nThe key takeaway is that Pydantic should primarily reside in the outer layers of your application (infrastructure and presentation), handling data validation and API interactions, while the domain layer remains pure and independent, working with simple dataclasses facilitated by libraries like Dacite. This separation improves code quality and long-term maintainability.\n",
    "chinese_title": "保持 Pydantic 与你的领域层分离",
    "chinese_summary": "本文倡导将 Pydantic 排除在应用程序的领域层之外。虽然 Pydantic 在数据验证方面很方便，尤其是在 FastAPI 等框架中，但随着应用程序的增长，其紧密耦合可能会成为一种负担。保持关注点分离可以使代码更易于维护、测试和适应。\n\n作者建议使用 Dacite 等工具将 Pydantic 模型（通常用于表示层和基础设施层）转换为适用于领域层的普通 Python 对象 (POPO)。Dacite 简化了从字典初始化嵌套数据类的过程，减少了手动样板代码。\n\n文章提出了一种使用存储库和映射器的结构化方法。存储库处理数据持久性和检索，利用映射器在数据存储格式（如字典或 JSON）和领域实体之间进行转换。然后，应用服务编排操作，调用存储库来检索或保存数据，并在实体上调用领域逻辑。\n\n关键在于，Pydantic 主要应驻留在应用程序的外部层（基础设施和表示层），处理数据验证和 API 交互，而领域层则保持纯粹和独立，使用由 Dacite 等库支持的简单数据类。这种分离提高了代码质量和长期可维护性。"
  },
  {
    "id": "44682964",
    "title": "It's a DE9, not a DB9 (but we know what you mean)",
    "url": "https://news.sparkfun.com/14298",
    "summary": "This SparkFun article clarifies a common misconception about the 9-pin serial connector, often incorrectly called a \"DB9.\" The article explains that the correct term, according to the D-subminiature standard, is actually \"DE9.\"\n\nThe \"D\" in D-sub indicates the D-shaped metal shield. The following letter denotes the shell size, not a feature. Therefore:\n\n*   DA: 15-pin shell\n*   DB: 25-pin shell\n*   DC: 37-pin shell\n*   DD: 50-pin shell\n*   DE: 9-pin shell\n\nThe term \"DB9\" is inaccurate because it pairs the \"B\" shell size (25-pin) with a 9-pin count. The misnomer arose because the original IBM PC used a DB25 connector, and when the 9-pin serial port was introduced, people simply replaced \"25\" with \"9\" out of familiarity. Despite the inaccuracy, \"DB9\" became a widely understood term.\n\nSparkFun decided to use the correct \"DE9\" designation for their new DE9 Connector Breakouts. They believe in technical accuracy and see it as a teaching opportunity, even though they know many will search for \"DB9.\" The article reinforces that while \"DB9\" is common usage, \"DE9\" is the technically correct term.\n",
    "chinese_title": "它是DE9，不是DB9（但我们知道你的意思）。",
    "chinese_summary": "这篇SparkFun的文章澄清了一个关于9针串口连接器的常见误解，它常被错误地称为“DB9”。文章解释说，根据D-sub微型连接器标准，正确的术语实际上是“DE9”。\n\nD-sub中的“D”表示D形金属屏蔽罩。后面的字母表示外壳尺寸，而不是特性。因此：\n\n*   DA：15针外壳\n*   DB：25针外壳\n*   DC：37针外壳\n*   DD：50针外壳\n*   DE：9针外壳\n\n术语“DB9”是不准确的，因为它将“B”外壳尺寸（25针）与9针数配对。这个错误称谓的出现，是因为最初的IBM PC使用DB25连接器，当引入9针串口时，人们只是出于熟悉而简单地用“9”替换了“25”。尽管不准确，“DB9”已经成为一个广为人知的术语。\n\nSparkFun决定在其新的DE9连接器分线板上使用正确的“DE9”命名。他们相信技术准确性，并将其视为一个教学机会，即使他们知道很多人会搜索“DB9”。这篇文章强调，虽然“DB9”是常见的用法，但“DE9”才是技术上正确的术语。"
  },
  {
    "id": "44693815",
    "title": "The Rise of Shippable Microfactories",
    "url": "https://www.thesisdriven.com/p/the-rise-of-shippable-microfactories",
    "summary": "This article explores the emerging concept of \"shippable microfactories\" as a potential solution to the challenges faced by traditional prefabricated construction. Unlike large, centralized prefab factories with high upfront costs and expensive shipping, microfactories are compact, automated production units (often container-sized) that can be deployed directly on or near construction sites.\n\nThe core idea is to invert the traditional model: instead of shipping bulky components, ship the factory itself. This approach aims to capture the benefits of off-site fabrication (automation, efficiency, controlled environment) while minimizing the drawbacks of centralized production (high capital expenditure, shipping costs, underutilization).\n\nThe article outlines the \"Factory Efficiency Equation\" to illustrate how microfactories can achieve higher efficiency through increased usage and lower capital costs compared to traditional factories.  Several examples of shippable microfactories are provided, ranging from lightweight robotic framing systems (like AUAR) to full-scale turnkey microfactories (like Cuby and Reframe Systems) and hybrid approaches (like Facit Homes' CNC fabrication).\n\nA case study of AUAR's deployment in Belgium demonstrates the potential of microfactories to significantly reduce labor and project timelines.  The article concludes by acknowledging the technical hurdles that remain, but expresses optimism about the future of shippable microfactories and their transformative potential for the construction industry.\n",
    "chinese_title": "可运输微型工厂的兴起",
    "chinese_summary": "本文探讨了“可运输微工厂”这一新兴概念，将其作为解决传统预制建筑所面临挑战的潜在方案。与前期成本高昂、运输费用昂贵的集中式大型预制工厂不同，微工厂是紧凑型、自动化生产单元（通常为集装箱大小），可以直接部署在建筑工地或附近。\n\n核心理念是颠倒传统模式：不运输笨重的组件，而是运输工厂本身。这种方法旨在获取异地制造的优势（自动化、效率、受控环境），同时最大限度地减少集中式生产的缺点（高资本支出、运输成本、利用率不足）。\n\n本文概述了“工厂效率方程”，以说明与传统工厂相比，微工厂如何通过提高利用率和降低资本成本来实现更高的效率。文中提供了一些可运输微工厂的例子，范围从轻型机器人框架系统（如AUAR）到全套交钥匙微工厂（如Cuby和Reframe Systems）以及混合方法（如Facit Homes的数控制造）。\n\nAUAR在比利时的部署案例研究表明了微工厂在显著减少劳动力和项目时间表方面的潜力。文章最后承认仍然存在技术障碍，但对可运输微工厂的未来及其对建筑行业的变革潜力表示乐观。"
  },
  {
    "id": "44685875",
    "title": "Never write your own date parsing library",
    "url": "https://www.zachleat.com/web/adventures-in-date-parsing/",
    "summary": "This article details the author's journey of deciding to write a custom date parsing library for Eleventy, a static site generator, despite the common advice against doing so. Initially, Eleventy used Luxon for date parsing, a reliable choice but became a significant dependency size-wise as Eleventy expanded to more JavaScript environments.\n\nThe author explored alternatives like Moment, Day.js, and date-fns, but found them either too large or inaccurate in parsing. Luxon's lack of tree-shaking further complicated size optimization.\n\nThe core issue lies in the ambiguity and flexibility of ISO 8601, which Luxon fully supports. To reduce complexity and prepare for the future Temporal API, Eleventy adopted a stricter, RFC 9557 compliant parsing approach. This involved breaking changes, dropping support for some ISO 8601 subformats.\n\nThe result is `@11ty/parse-date-strings`, a small, ESM-based library focusing solely on RFC 9557 parsing. It significantly reduces Eleventy's bundle size and prepares it for native Temporal support. The article acknowledges the risks of custom date parsing but justifies it based on Eleventy's specific needs and the desire for a smaller, more accurate library. The author also lists other alternative date libraries and Temporal polyfills for consideration.\n",
    "chinese_title": "永远不要编写你自己的日期解析库",
    "chinese_summary": "本文详细介绍了作者决定为静态站点生成器Eleventy编写自定义日期解析库的历程，尽管通常不建议这样做。最初，Eleventy使用Luxon进行日期解析，这是一个可靠的选择，但随着Eleventy扩展到更多的JavaScript环境，它在大小方面成为一个重要的依赖项。\n\n作者探索了诸如Moment、Day.js和date-fns等替代方案，但发现它们要么太大，要么在解析中不准确。Luxon缺乏tree-shaking进一步复杂化了大小优化。\n\n核心问题在于ISO 8601的模糊性和灵活性，Luxon完全支持它。为了降低复杂性并为未来的Temporal API做准备，Eleventy采用了一种更严格的、符合RFC 9557的解析方法。这涉及到破坏性更改，放弃了对某些ISO 8601子格式的支持。\n\n最终成果是`@11ty/parse-date-strings`，一个小型、基于ESM的库，专门专注于RFC 9557解析。它显著减小了Eleventy的捆绑包大小，并为其原生Temporal支持做好了准备。本文承认自定义日期解析的风险，但根据Eleventy的特定需求以及对更小、更准确的库的渴望，证明了其合理性。作者还列出了其他可供考虑的替代日期库和Temporal polyfill。"
  },
  {
    "id": "44685119",
    "title": "Why MIT switched from Scheme to Python (2009)",
    "url": "https://www.wisdomandwonder.com/link/2110/why-mit-switched-from-scheme-to-python",
    "summary": "In 2009, Hal Abelson and Gerald Jay Sussman (authors of SICP) discussed why MIT switched from Scheme to Python for its introductory programming course, 6.001. The change wasn't due to shortcomings of Scheme, but rather a shift in the nature of programming itself.\n\nSussman explained that in 1980, programming involved crafting lean, well-understood code close to the hardware. Engineers carefully designed components they fully understood and combined them predictably. 6.001 was designed to teach this methodical, component-based approach.\n\nHowever, modern programming often involves navigating complex, poorly documented libraries from unknown sources. Programmers must experiment and reverse-engineer these libraries to understand their behavior. This new reality demanded a different approach to introductory programming.\n\nThe revamped 6.001 became robot-centered, requiring students to program robots. Unlike the idealized components of the past, robots are inherently unpredictable, with issues like wheel slippage and environmental changes. Students now focus on building robustness and adapting to real-world uncertainties.\n\nThe choice of Python was less about language superiority and more about practicality. It likely had a pre-existing library that interfaced with the robot hardware, making it a convenient choice for the robot-focused curriculum.\n",
    "chinese_title": "为什么麻省理工学院从Scheme切换到Python (2009)",
    "chinese_summary": "2009年，Hal Abelson和Gerald Jay Sussman（SICP的作者）讨论了麻省理工学院为何将其入门编程课程6.001从Scheme切换到Python。这一转变并非因为Scheme的缺陷，而是由于编程本质的转变。\n\nSussman解释说，在1980年，编程涉及编写精简、易懂、接近硬件的代码。工程师们精心设计他们完全理解的组件，并以可预测的方式组合它们。6.001旨在教授这种有条不紊的、基于组件的方法。\n\n然而，现代编程通常涉及浏览来自未知来源的复杂、文档不完善的库。程序员必须试验和逆向工程这些库，才能理解它们的行为。这种新的现实需要一种不同的入门编程方法。\n\n改版后的6.001以机器人为中心，要求学生编写机器人程序。与过去理想化的组件不同，机器人本质上是不可预测的，存在车轮打滑和环境变化等问题。学生现在专注于构建鲁棒性并适应现实世界的不确定性。\n\n选择Python更多的是出于实用性，而不是语言的优越性。Python很可能有一个与机器人硬件连接的现有库，这使其成为以机器人为中心的课程的便捷选择。"
  },
  {
    "id": "44686317",
    "title": "Vanilla JavaScript support for Tailwind Plus",
    "url": "https://tailwindcss.com/blog/vanilla-js-support-for-tailwind-plus",
    "summary": "Tailwind Plus now offers full Vanilla JavaScript support for its UI blocks through `@tailwindplus/elements`, a library of headless custom elements. This eliminates the need for JavaScript frameworks like React or Vue to make interactive UI elements such as dialogs, dropdowns, and command palettes functional and accessible.\n\n`@tailwindplus/elements` uses standard HTML and CSS, allowing developers to use these UI blocks in any project with a `<script>` tag. The library leverages modern web platform features like custom elements, the popover attribute, native `<dialog>` elements, invoker commands, and ElementInternals to provide robust functionality while remaining lightweight. Polyfills are included to ensure compatibility with browsers supported by Tailwind CSS v4.0.\n\nThe initial release includes primitives for Autocomplete, Command palette, Dialog, Disclosure, Dropdown menu, Popover, Select, and Tabs. The components work across frameworks like Svelte, Rails, and even React, enabling developers to use Tailwind Plus UI blocks in diverse environments without being restricted to specific frameworks. This allows for greater flexibility and code reuse across different projects.\n",
    "chinese_title": "Tailwind Plus 的原生 JavaScript 支持",
    "chinese_summary": "Tailwind Plus 现通过 `@tailwindplus/elements` 为其 UI 模块提供完整的 Vanilla JavaScript 支持，这是一个无头自定义元素库。这消除了使用 React 或 Vue 等 JavaScript 框架来使对话框、下拉菜单和命令面板等交互式 UI 元素具有功能性和可访问性的需求。\n\n`@tailwindplus/elements` 使用标准 HTML 和 CSS，允许开发者在任何带有 `<script>` 标签的项目中使用这些 UI 模块。该库利用现代 Web 平台特性，如自定义元素、popover 属性、原生 `<dialog>` 元素、调用器命令和 ElementInternals，以提供强大的功能，同时保持轻量级。其中包含 Polyfill，以确保与 Tailwind CSS v4.0 支持的浏览器兼容。\n\n最初的版本包括 Autocomplete、Command palette、Dialog、Disclosure、Dropdown menu、Popover、Select 和 Tabs 的基本组件。这些组件可在 Svelte、Rails 甚至 React 等框架中使用，使开发者能够在不同的环境中使用 Tailwind Plus UI 模块，而不受特定框架的限制。这允许在不同项目中实现更大的灵活性和代码重用。"
  },
  {
    "id": "44682175",
    "title": "The future is not self-hosted",
    "url": "https://www.drewlyton.com/story/the-future-is-not-self-hosted/",
    "summary": "Drew argues that self-hosting, while seemingly empowering, is not the future of internet freedom. He recounts how he built his own home server to replace cloud services like Google Photos and Kindle after Amazon's DRM changes. While he enjoyed the process and gained more control over his data, he realized self-hosting is technically inaccessible to most, unsustainable, and promotes an isolated, individualistic internet.\n\nThe core problem, he argues, is that self-hosting necessitates duplicated infrastructure and makes sharing resources difficult, creating digital \"suburbs.\" Instead of individual digital fiefdoms, Drew advocates for community-hosted, publicly funded cloud services. He envisions a system where basic storage, sharing, and streaming are accessible at cost through libraries or non-profits, offering end-to-end encryption and standardized protocols for easy data portability. This would force market-provided options to be more competitive and user-friendly.\n\nDrew acknowledges concerns about government oversight but believes end-to-end encryption addresses them. He concludes that true freedom requires dismantling the current techno-feudalistic system through solidarity and shared, community-owned internet infrastructure, moving beyond the limitations of self-reliance and individualism.\n",
    "chinese_title": "未来并非自托管",
    "chinese_summary": "德鲁认为，自托管虽然看似赋权，但并非互联网自由的未来。他讲述了在亚马逊的 DRM 更改后，如何构建自己的家庭服务器来替代 Google Photos 和 Kindle 等云服务。虽然他享受这个过程并获得了更多对其数据的控制权，但他意识到自托管在技术上对大多数人来说是不可及的、不可持续的，并且提倡一种孤立的、个人主义的互联网。\n\n他认为，核心问题在于自托管需要重复的基础设施，并使资源共享变得困难，从而创建了数字“郊区”。德鲁提倡社区托管的、公共资助的云服务，而不是个人的数字封地。他设想了一种系统，通过图书馆或非营利组织，以成本价提供基本的存储、共享和流媒体服务，并提供端到端加密和标准化协议，以便轻松进行数据迁移。这将迫使市场提供的选项更具竞争力和用户友好性。\n\n德鲁承认对政府监督的担忧，但他认为端到端加密可以解决这些问题。他总结说，真正的自由需要通过团结和共享的、社区拥有的互联网基础设施来瓦解当前的科技封建体系，从而超越自力更生和个人主义的局限性。"
  },
  {
    "id": "44685050",
    "title": "Efficient Computer's Electron E1 CPU – 100x more efficient than Arm?",
    "url": "https://morethanmoore.substack.com/p/efficient-computers-electron-e1-cpu",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "高效计算机Electron E1 CPU – 效率是Arm的100倍？",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "44656472",
    "title": "Generic Containers in C: Vec",
    "url": "https://uecker.codeberg.page/2025-07-20.html",
    "summary": "This article discusses the implementation of a type and bounds safe generic vector (resizable array) in C. The author, Martin Uecker, builds upon previous discussions of span types and bounds checking. The core of the vector implementation relies on a macro `vec(T)` that defines a structure with a size field (`N`) and a flexible array member (`data`).\n\nThe article highlights the `vec_push` macro, which uses `realloc` to dynamically resize the vector when adding elements. Error handling is simplified by using `abort()` on memory allocation failure, but the author acknowledges the need for more robust error handling in some contexts. The use of `ssize_t` is mentioned for potential overflow detection.\n\nThe author deliberately omits a capacity field for simplicity, relying on `realloc`'s internal optimizations. However, for performance-critical scenarios, alternative interfaces (`vec_push_cap`, `vec_pop_cap`, `vec_fit`, `vec_push_auto`, `vec_pop_auto`) are explored. These involve an external capacity integer or automatic capacity management (rounding up to the next power of two).\n\nBounds safety is achieved through the `vec2array` macro, which allows the vector's data to be treated as a fixed-size array, enabling interoperability with conventional C arrays and bounds-safe operations using macros like `array_slice`. The example demonstrates using `vec2array` with `array_sum` to calculate the sum of elements in the vector, showcasing bounds-safe processing. A remaining issue with undefined behavior sanitizer not fully checking argument matching in the `array_sum` call is also mentioned. Finally, a link to an experimental library with these ideas is provided.\n",
    "chinese_title": "C 语言中的泛型容器：Vec",
    "chinese_summary": "本文讨论了C语言中类型和边界安全的泛型向量（可变大小数组）的实现。作者Martin Uecker在前面对 span 类型和边界检查的讨论基础上进行了构建。向量实现的核心依赖于宏 `vec(T)`，该宏定义了一个包含大小字段 (`N`) 和柔性数组成员 (`data`) 的结构体。\n\n文章重点介绍了 `vec_push` 宏，它使用 `realloc` 在添加元素时动态调整向量的大小。通过在内存分配失败时使用 `abort()` 简化了错误处理，但作者承认在某些情况下需要更健壮的错误处理。提到了使用 `ssize_t` 以检测潜在的溢出。\n\n为了简单起见，作者特意省略了容量字段，依赖于 `realloc` 的内部优化。但是，对于性能关键的场景，探索了替代接口（`vec_push_cap`、`vec_pop_cap`、`vec_fit`、`vec_push_auto`、`vec_pop_auto`）。这些接口涉及外部容量整数或自动容量管理（向上舍入到下一个 2 的幂）。\n\n通过 `vec2array` 宏实现边界安全，该宏允许将向量的数据视为固定大小的数组，从而可以使用传统的 C 数组进行互操作，并使用诸如 `array_slice` 之类的宏进行边界安全操作。该示例演示了将 `vec2array` 与 `array_sum` 结合使用来计算向量中元素的总和，展示了边界安全处理。还提到了未定义行为清理器未完全检查 `array_sum` 调用中参数匹配的剩余问题。最后，提供了一个包含这些想法的实验性库的链接。"
  },
  {
    "id": "44686164",
    "title": "Animated Cursors",
    "url": "https://tattoy.sh/news/animated-cursors/",
    "summary": "This article announces the addition of animated cursor support to Tattoy, a terminal application. It leverages the Ghostty cursor format and renders them using custom shaders. Unlike Ghostty, which uses actual pixels, Tattoy renders cursors using UTF8 text-based \"pixels\" (\"▀\" and \"▄\"), resulting in a pixelated effect.\n\nImplementing this feature was relatively quick initially due to Tattoy's existing shader-based framework, but ironing out the details, particularly transparency for antialiased edges, took longer. A major challenge was replicating Ghostty's ability to sample underlying terminal pixels for smooth blending, since Tattoy is purely text-based.\n\nThe solution involved creating a \"pixelised\" version of the terminal by using the true color values of text and using that as the background. This introduced a new issue: the pixelised terminal was being included in the cursor image. This was resolved by adding a post-processing step that compares the pixelised terminal with the rendered cursor, and only renders the difference to the user.\n\nWhile the current implementation works well, there can be lag on larger terminals. The author suggests potential performance improvements, including Tattoy handling all cursor rendering (rather than rendering in conjunction with the host terminal), potentially reducing latency. The author welcomes feedback on the new feature.\n",
    "chinese_title": "动画光标",
    "chinese_summary": "Tattoy 增加动画光标支持\n\n本文宣布终端应用 Tattoy 增加了动画光标支持。它利用 Ghostty 光标格式并使用自定义着色器进行渲染。与使用实际像素的 Ghostty 不同，Tattoy 使用基于 UTF8 文本的“像素”（“▀”和“▄”）渲染光标，从而产生像素化效果。\n\n由于 Tattoy 现有的基于着色器的框架，实现此功能最初相对较快，但解决细节问题，特别是抗锯齿边缘的透明度，花费了更长时间。一个主要的挑战是复制 Ghostty 采样底层终端像素以实现平滑混合的能力，因为 Tattoy 纯粹基于文本。\n\n解决方案是创建终端的“像素化”版本，通过使用文本的真彩色值并将其用作背景。这引入了一个新问题：像素化终端被包含在光标图像中。通过添加一个后处理步骤来解决这个问题，该步骤将像素化终端与渲染的光标进行比较，并且仅向用户渲染差异。\n\n虽然当前的实现效果良好，但在较大的终端上可能会出现延迟。作者建议了潜在的性能改进，包括 Tattoy 处理所有光标渲染（而不是与主机终端联合渲染），从而可能减少延迟。作者欢迎对新功能的反馈。"
  },
  {
    "id": "44691722",
    "title": "Why I do programming",
    "url": "https://esafev.com/notes/why-i-do-programming/",
    "summary": "This article is a personal reflection on the author's lifelong relationship with programming, inspired by a post by Aaron Boodman. From a young age, disassembling machines sparked curiosity and a desire to understand how things work. This evolved into coding simple programs in BASIC, building websites with early HTML, and modding GTA with PAWN. The author then explored Second Life, creating virtual items and even earning real money.\n\nDriven by a desire to create something meaningful in the real world, the author started a small online business, demonstrating entrepreneurial drive and resourcefulness. Exposure to HTML5 and Bret Victor's \"Inventing on Principle\" further shaped their perspective on programming as a creative endeavor.\n\nUniversity experiences, including a \"hack\" of the university SMTP server, reinforced practical skills and philosophical thinking. Post-graduation, a stint at a startup taught valuable lessons about business, marketing, and the importance of teamwork.\n\nThe author acknowledges experiencing burnout and the importance of taking breaks to rediscover the joy of programming. The article concludes that programming is more than just a job; it's a way to explore, tinker, and satisfy curiosity across various domains, from frontend to AI. The constant evolution of the field keeps it engaging, although maintaining focus can be challenging. Ultimately, programming is presented as the author's natural way of interacting with and understanding the world.\n",
    "chinese_title": "我为什么编程",
    "chinese_summary": "本文是作者对与编程的毕生关系的个人反思，灵感来自 Aaron Boodman 的一篇文章。 从小拆解机器就激发了好奇心和了解事物运作方式的渴望。 这逐渐演变为用 BASIC 编写简单的程序，用早期的 HTML 构建网站，并用 PAWN 修改 GTA。 然后，作者探索了 Second Life，创建虚拟物品，甚至赚取了真钱。\n\n出于在现实世界中创造有意义事物的愿望，作者开始了一项小型在线业务，展示了创业的动力和足智多谋。 接触 HTML5 和 Bret Victor 的“Inventing on Principle”进一步塑造了他们对编程作为一种创造性努力的看法。\n\n大学经历，包括对大学 SMTP 服务器的“黑客”行为，强化了实践技能和哲学思考。 毕业后，在一家初创公司的工作经历教会了他们关于商业、营销和团队合作重要性的宝贵经验。\n\n作者承认经历过倦怠，并认识到休息以重新发现编程乐趣的重要性。 文章总结说，编程不仅仅是一份工作； 它是一种探索、修补和满足跨各种领域（从前端到人工智能）的好奇心的方式。 该领域的不断发展使其保持吸引力，尽管保持专注可能具有挑战性。 最终，编程被认为是作者与世界互动和理解世界的自然方式。"
  },
  {
    "id": "44657527",
    "title": "What is X-Forwarded-For and when can you trust it? (2024)",
    "url": "https://httptoolkit.com/blog/what-is-x-forwarded-for/",
    "summary": "The X-Forwarded-For (XFF) HTTP header provides a list of client IP addresses as a request traverses proxies and load balancers. It helps servers identify the original client IP, which is crucial for user authentication, load balancing, geographic content delivery, security, and analytics.\n\nHowever, the XFF header can be easily spoofed. Therefore, you should never blindly trust the XFF header. You can improve trust by using a trusted reverse proxy like a CDN or API Gateway, and restricting direct access to backend servers. With a trusted proxy, you can replace or append to the XFF header.\n\nDetermining the true client IP involves analyzing the list from right to left, identifying the first IP address that is *not* one of your internal servers, and ensuring that your server is not directly accessible. You can implement this by maintaining a list of trusted IP ranges, or by counting on number of trusted proxies.\n\nWhen parsing the XFF header, it's essential to validate IP addresses to prevent crashes and potential DDoS attacks. The article also stresses that even if you have a trusted proxy, careful validation is necessary and blindly trusting the header can lead to security vulnerabilities.\n",
    "chinese_title": "什么是X-Forwarded-For？何时可以信任它？(2024)",
    "chinese_summary": "X-Forwarded-For (XFF) HTTP 头部提供了一个客户端 IP 地址列表，该列表随着请求遍历代理和负载均衡器而生成。它帮助服务器识别原始客户端 IP，这对于用户身份验证、负载均衡、地理内容分发、安全和分析至关重要。\n\n然而，XFF 头部很容易被伪造。因此，永远不应盲目信任 XFF 头部。您可以通过使用可信的反向代理（如 CDN 或 API 网关）并限制对后端服务器的直接访问来提高信任度。使用可信代理，您可以替换或附加到 XFF 头部。\n\n确定真实客户端 IP 涉及从右到左分析列表，识别第一个*不是*您内部服务器的 IP 地址，并确保您的服务器无法直接访问。您可以通过维护受信任的 IP 范围列表，或依靠可信代理的数量来实现这一点。\n\n解析 XFF 头部时，必须验证 IP 地址，以防止崩溃和潜在的 DDoS 攻击。本文还强调，即使您拥有可信的代理，也必须进行仔细验证，盲目信任该头部可能会导致安全漏洞。"
  },
  {
    "id": "44688096",
    "title": "Experimental surgery performed by AI-driven surgical robot",
    "url": "https://arstechnica.com/science/2025/07/experimental-surgery-performed-by-ai-driven-surgical-robot/",
    "summary": "This article discusses the development of SRT-H (Surgical Robot Transformer), an AI-driven surgical robot created by researchers at John Hopkins University and now at Stanford. Unlike previous surgical robots that rely on pre-programmed actions, SRT-H uses transformer models, similar to those powering ChatGPT, to learn from demonstrations and perform complex surgeries autonomously.\n\nThe robot was trained using over 17 hours of video, kinematics data, and natural language annotations from experienced surgeons performing cholecystectomies (gallbladder removals) on pig cadavers. SRT-H achieved a 100% success rate on new samples and could even respond to natural language feedback.\n\nWhile SRT-H demonstrates significant advancements in surgical robotics, including flexibility and adaptability, its progress is hindered by the lack of access to kinematics data from DaVinci robots, the industry standard. Intuitive Surgical, the DaVinci robot's manufacturer, restricts access to this data due to concerns about competition reverse-engineering their technology. To circumvent this, researchers are exploring alternative methods of collecting kinematics data, such as motion-tracking sensors on manual surgical tools. The future vision involves integrating AI with humanoid robots for even more versatile surgical applications.\n",
    "chinese_title": "人工智能驱动手术机器人实施的实验性手术",
    "chinese_summary": "本文探讨了SRT-H（手术机器人Transformer）的开发，这是一种由约翰·霍普金斯大学研究人员创建、现位于斯坦福大学的人工智能驱动手术机器人。与以往依赖预编程动作的手术机器人不同，SRT-H 使用 Transformer 模型（类似于驱动 ChatGPT 的模型），从演示中学习并自主执行复杂的手术。\n\n该机器人接受了超过 17 小时的视频、运动学数据以及经验丰富的外科医生在猪尸体上进行胆囊切除术的自然语言注释的训练。SRT-H 在新样本上实现了 100% 的成功率，甚至可以响应自然语言反馈。\n\n虽然 SRT-H 展示了手术机器人技术的重大进步，包括灵活性和适应性，但其进展受到无法访问达芬奇机器人（行业标准）运动学数据的限制。达芬奇机器人的制造商直觉外科公司出于对竞争对手逆向工程其技术的担忧，限制对此数据的访问。为了规避这一点，研究人员正在探索收集运动学数据的替代方法，例如在手动手术工具上安装运动追踪传感器。未来的愿景是将人工智能与人形机器人相结合，以实现更加通用的手术应用。"
  },
  {
    "id": "44685011",
    "title": "Steam, Itch.io are pulling ‘porn’ games. Critics say it's a slippery slope",
    "url": "https://www.wired.com/story/steam-itchio-are-pulling-porn-games-censorship/",
    "summary": "Itch.io and Steam are facing pressure to remove adult content due to campaigns by Collective Shout, a group that argues certain games promote violence against women. Itch.io has deindexed all adult NSFW games from search results, while Steam has removed hundreds of titles allegedly containing abuse, rape, or incest.\n\nThese actions are a direct result of Collective Shout lobbying payment processors like Mastercard and Visa to stop doing business with the platforms, a tactic known as financial censorship. The platforms fear losing payment processing capabilities, which would cripple their ability to operate.\n\nCritics argue this is a form of censorship driven by anti-pornography and anti-LGBTQ groups, impacting vulnerable creators, particularly queer, female, and people of color. Award-winning games dealing with mental health, domestic abuse, and LGBTQ+ themes have been affected, even if they don't contain explicit sexual content.\n\nDevelopers worry about the precedent set by deferring content moderation to payment processors responding to moralistic pressure. Concerns are growing that conservatives will label any content they dislike as pornographic to control society, ultimately silencing diverse voices and restricting freedom of expression.\n",
    "chinese_title": "Steam和Itch.io下架“色情”游戏，评论家称此为危险的开端。",
    "chinese_summary": "由于团体 Collective Shout 的倡议，Itch.io 和 Steam 正面临移除成人内容的压力，该团体认为某些游戏宣扬针对女性的暴力。Itch.io 已经从搜索结果中取消了所有成人 NSFW 游戏的索引，而 Steam 已经移除了数百款据称包含虐待、强奸或乱伦内容的游戏。\n\n这些行动是 Collective Shout 游说万事达卡和维萨卡等支付处理商停止与这些平台合作的直接结果，这种策略被称为金融审查。这些平台担心失去支付处理能力，这将严重削弱它们的运营能力。\n\n批评人士认为，这是一种由反色情和反 LGBTQ 群体驱动的审查形式，影响到弱势创作者，尤其是酷儿、女性和有色人种。处理心理健康、家庭虐待和 LGBTQ+ 主题的获奖游戏也受到了影响，即使它们不包含明确的性内容。\n\n开发者担心将内容审核权交给响应道德压力的支付处理商所带来的先例。人们越来越担心保守派会将任何他们不喜欢的內容贴上色情标签，以控制社会，最终扼杀不同的声音并限制表达自由。"
  },
  {
    "id": "44663072",
    "title": "Developing our position on AI",
    "url": "https://www.recurse.com/blog/191-developing-our-position-on-ai",
    "summary": "This article discusses Recurse Center's (RC) approach to understanding and integrating AI, particularly Large Language Models (LLMs), into their programming retreat and recruiting business. RC focuses on the personal and professional implications of LLMs for their \"Recursers,\" avoiding broader societal debates.\n\nThey assembled an informal AI advisory group of RC alumni with diverse backgrounds and opinions on AI to gain insights. A key finding was the wide range of views on the current usefulness of LLMs in programming, attributed to experience with LLMs, type of programming work, and project scale.\n\nRegarding learning, alumni saw both opportunities and pitfalls. Many suggested separating \"shipping mode\" (using LLMs) from \"learning mode\" (avoiding LLMs for deeper understanding). LLMs were considered potentially useful as tutors or for bootstrapping in new domains, but questions remained about their role in learning a first programming language.\n\nThe article also highlights the social implications of LLMs, such as facilitating pairing but potentially discouraging interaction within the RC community.\n\nImportantly, many alumni had changed their views on AI and expected to do so again, emphasizing the importance of being open to change. Regardless of AI usage, alumni consistently stressed the need to understand the underlying systems being built and to critically engage with the code. The ability to make independent judgements and “say no” was seen as a critical skill. The act of volition is key.\n",
    "chinese_title": "发展我们对人工智能的立场",
    "chinese_summary": "本文探讨了Recurse Center (RC) 理解和整合人工智能（特别是大型语言模型LLM）的方法，并将此应用于其编程训练营和招聘业务。RC关注LLM对其“Recursers”个人和职业的影响，避免更广泛的社会辩论。\n\n他们组建了一个非正式的AI顾问小组，成员是RC校友，他们在AI领域拥有不同的背景和观点，以获取见解。一个关键发现是，对于LLM目前在编程中的实用性，存在广泛的观点差异，这归因于LLM的使用经验、编程工作类型和项目规模。\n\n关于学习，校友们看到了机遇和陷阱。许多人建议将“交付模式”（使用LLM）与“学习模式”（避免使用LLM以获得更深入的理解）分开。LLM被认为可能作为导师或用于在新领域进行引导，但它们在学习第一门编程语言中的作用仍然存在疑问。\n\n本文还强调了LLM的社会影响，例如促进结对编程，但也可能阻碍RC社区内的互动。\n\n重要的是，许多校友已经改变了他们对AI的看法，并预计还会再次改变，这强调了保持开放心态的重要性。无论是否使用AI，校友们始终强调需要理解正在构建的底层系统，并批判性地参与代码。做出独立判断和“说不”的能力被视为一项关键技能。自主意志至关重要。"
  },
  {
    "id": "44685067",
    "title": "CO2 Battery",
    "url": "https://energydome.com/co2-battery/",
    "summary": "Energy Dome's CO2 Battery offers a cost-effective and efficient solution for long-duration energy storage. It operates using a closed thermo-mechanical cycle involving the manipulation of CO2 between its gaseous and liquid phases. The process involves warming, evaporating, and expanding CO2 to drive a turbine and generate electricity, with zero CO2 emissions.\n\nKey benefits include high round-trip efficiency (75%+) with no degradation over 30+ years, global deployment capabilities, cost-effectiveness, and the use of readily available, eco-friendly materials (water, steel, and CO2) avoiding reliance on rare metals like lithium. The system stores energy in the 8-24 hour range.\n\nThe CO2 Battery is presented as a better alternative to lithium-ion batteries due to its longer lifespan, lower CAPEX, 100% depth of discharge, and global component availability. It integrates standard industrial components in a modular and scalable design, making it a plug-and-play solution deployable worldwide.\n\nThe battery offers several services including time-shifting, physical inertia, frequency containment reserves (FCR), automatic and manual frequency restoration reserves (aFRR/mFRR), and voltage regulation, supporting grid stability. Energy Dome has recently partnered with Google and expanded its operations with a new Asia-Pacific headquarters in Melbourne.\n",
    "chinese_title": "二氧化碳电池",
    "chinese_summary": "Energy Dome的CO2电池为长时储能提供了一种经济高效的解决方案。它采用封闭式热机械循环，通过在气态和液态之间转换二氧化碳来运行。该过程包括加热、蒸发和膨胀二氧化碳以驱动涡轮机并产生电力，且二氧化碳零排放。\n\n主要优势包括：往返效率高（75%以上），30年以上无衰减；全球部署能力；成本效益；以及使用易于获取的环保材料（水、钢和二氧化碳），避免依赖锂等稀有金属。该系统储能时长为8-24小时。\n\nCO2电池被认为是锂离子电池的更好替代品，因为它具有更长的使用寿命、更低的资本支出、100%的放电深度以及全球化的组件供应。它集成了标准的工业组件，采用模块化和可扩展的设计，使其成为一种即插即用的解决方案，可在全球范围内部署。\n\n该电池提供多种服务，包括时间转移、物理惯性、频率抑制储备（FCR）、自动和手动频率恢复储备（aFRR/mFRR）以及电压调节，从而支持电网稳定性。Energy Dome最近与谷歌合作，并在墨尔本设立了新的亚太总部，扩大了业务。"
  },
  {
    "id": "44683682",
    "title": "Programming vehicles in games",
    "url": "https://wassimulator.com/blog/programming/programming_vehicles_in_games.html",
    "summary": "This article provides a foundational understanding of programming vehicles in games, emphasizing the crucial balance between realistic physics and the desired player experience. It details the author's journey from rudimentary, \"hacky\" vehicle simulations to a more informed approach rooted in actual vehicle dynamics.\n\nThe core of the article breaks down vehicle simulation into three interconnected components: the Engine (and Gearbox), the Wheels and Tires, and the Chassis. The engine is treated as a torque calculator, utilizing a custom-built equation to simulate realistic and tunable torque curves. The gearbox is a simple lookup table modifying torque and RPM based on gear selection. The wheels and tires focus on the physics of force generation via friction and tire models based on inputs like torque, brakes, steering, and weight. The chassis responds to forces from the tires and external factors, influencing weight distribution.\n\nThe author emphasizes that a perfect simulation is impractical and unnecessary for most games. Developers should focus on creating believable and enjoyable experiences by strategically simulating, faking, and cheating aspects of vehicle physics. The article offers a basic algorithm in pseudocode for a physics loop that incorporates each of the vehicle components.\n",
    "chinese_title": "游戏中的车辆编程",
    "chinese_summary": "本文旨在提供游戏载具编程的基础理解，强调逼真物理效果与理想玩家体验之间的关键平衡。文章详述了作者从最初级的“凑合”载具模拟到更深入了解实际车辆动力学的过程。\n\n文章的核心是将载具模拟分解为三个相互关联的部分：引擎（和变速箱）、车轮和轮胎，以及底盘。引擎被视为扭矩计算器，利用定制的方程式来模拟逼真且可调的扭矩曲线。变速箱是一个简单的查找表，根据档位选择修改扭矩和转速。车轮和轮胎侧重于通过摩擦力产生力的物理原理，以及基于扭矩、制动、转向和重量等输入的轮胎模型。底盘响应来自轮胎和外部因素的力，影响重量分配。\n\n作者强调，对于大多数游戏来说，完美的模拟是不切实际且不必要的。开发者应专注于通过策略性地模拟、伪造和欺骗载具物理的各个方面来创造可信且愉悦的体验。文章提供了一个包含每个车辆组件的物理循环的基本算法伪代码。"
  },
  {
    "id": "44684373",
    "title": "Women dating safety app 'Tea' breached, users' IDs posted to 4chan",
    "url": "https://www.404media.co/women-dating-safety-app-tea-breached-users-ids-posted-to-4chan/",
    "summary": "Tea, a popular women's dating safety app with over 1.6 million users, has suffered a data breach. Users on 4chan claim to have discovered an exposed database on Google's Firebase platform containing personal data and selfies uploaded to the app by users. According to 4chan posts, screenshots, and code reviewed by 404 Media, users are accessing and posting this data online. The leaked information allegedly includes driver's licenses and facial recognition data. Tea confirmed the breach to 404 Media, stating it impacted some direct messages and that the data is from two years ago. The app, designed to help women share information about men for safety, verifies users by requiring selfie uploads, which are now potentially exposed. The 4chan post highlighted the lack of authentication, calling it a \"public bucket\" of data.\n",
    "chinese_title": "女性约会安全应用“Tea”遭泄露，用户ID被发布至4chan",
    "chinese_summary": "Tea，一款拥有超过160万用户的女性约会安全应用，遭遇数据泄露。4chan用户声称在谷歌的Firebase平台上发现了一个暴露的数据库，其中包含用户上传到该应用的个人数据和自拍。根据4chan帖子、截图以及404 Media审查的代码，用户正在访问并将这些数据发布到网上。据称泄露的信息包括驾驶执照和面部识别数据。Tea向404 Media证实了此次泄露事件，称其影响了一些私信，并且数据是两年前的。该应用旨在帮助女性分享关于男性的信息以确保安全，通过要求上传自拍来验证用户，而这些自拍现在可能已经暴露。4chan帖子强调了缺乏身份验证，称其为“公共数据桶”。"
  },
  {
    "id": "44661673",
    "title": "Show HN: Apple Health MCP Server",
    "url": "https://github.com/neiltron/apple-health-mcp",
    "summary": "This \"Show HN\" post introduces an Apple Health MCP (Model Context Protocol) server built by neiltron that allows users to query and analyze their Apple Health data using SQL. The server leverages DuckDB for efficient data processing.\n\n**Key Features:**\n\n*   **SQL Querying:** Users can execute SQL queries directly on their Apple Health data.\n*   **Natural Language Querying:** Supports natural language queries via MCP clients (e.g., Claude Desktop).\n*   **Automated Reports:** Generates weekly/monthly health summaries.\n*   **Efficient Data Loading:** Utilizes lazy loading and configurable time windows.\n*   **Smart Caching:** Caches query results with TTL for faster subsequent queries.\n\n**Installation & Usage:**\n\nThe server doesn't require installation. It's used with `npx` and MCP clients like Claude Desktop by configuring the `claude_desktop_config.json` file with the path to the health data directory (`HEALTH_DATA_DIR`).\n\n**Data Source:**\n\nThe server relies on the \"Simple Health Export CSV\" iOS app to export Apple Health data as CSV files. Users need to transfer the exported data to their computer, unzip it, and point the `HEALTH_DATA_DIR` environment variable to the directory.\n\n**Data Structure:**\n\nThe server expects CSV files named according to Apple Health metric types (e.g., `HKQuantityTypeIdentifier*.csv`). Each CSV should have columns for `type`, `sourceName`, `startDate`, `endDate`, `value`, and `unit`.\n\n**Available Tools:**\n\n*   `health_schema`: Provides information about available tables and their structure.\n*   `health_query`: Executes SQL queries.\n*   `health_report`: Generates health reports.\n\n**Development:**\n\nThe post provides instructions for local development, including cloning the repository, installing dependencies, building the project, and type checking.\n\n**Contribution:**\n\nThe project welcomes contributions, emphasizing code style, TypeScript types, error handling, and performance.\n",
    "chinese_title": "展示 HN: 苹果健康 MCP 服务器",
    "chinese_summary": "这个“Show HN”帖子介绍了一个由 neiltron 构建的 Apple Health MCP (模型上下文协议) 服务器，该服务器允许用户使用 SQL 查询和分析他们的 Apple Health 数据。该服务器利用 DuckDB 实现高效的数据处理。\n\n**主要特性：**\n\n*   **SQL 查询：** 用户可以直接对他们的 Apple Health 数据执行 SQL 查询。\n*   **自然语言查询：** 通过 MCP 客户端（例如，Claude Desktop）支持自然语言查询。\n*   **自动报告：** 生成每周/每月健康摘要。\n*   **高效数据加载：** 利用惰性加载和可配置的时间窗口。\n*   **智能缓存：** 使用 TTL 缓存查询结果，以便更快地进行后续查询。\n\n**安装和使用：**\n\n该服务器无需安装。它通过 `npx` 和 MCP 客户端（如 Claude Desktop）使用，只需使用健康数据目录的路径（`HEALTH_DATA_DIR`）配置 `claude_desktop_config.json` 文件。\n\n**数据来源：**\n\n该服务器依赖于 \"Simple Health Export CSV\" iOS 应用程序将 Apple Health 数据导出为 CSV 文件。 用户需要将导出的数据传输到他们的计算机，解压缩，并将 `HEALTH_DATA_DIR` 环境变量指向该目录。\n\n**数据结构：**\n\n该服务器期望 CSV 文件根据 Apple Health 指标类型命名（例如，`HKQuantityTypeIdentifier*.csv`）。每个 CSV 文件应具有 `type`、`sourceName`、`startDate`、`endDate`、`value` 和 `unit` 列。\n\n**可用工具：**\n\n*   `health_schema`: 提供有关可用表及其结构的信息。\n*   `health_query`: 执行 SQL 查询。\n*   `health_report`: 生成健康报告。\n\n**开发：**\n\n该帖子提供了本地开发的说明，包括克隆存储库、安装依赖项、构建项目和类型检查。\n\n**贡献：**\n\n该项目欢迎贡献，强调代码风格、TypeScript 类型、错误处理和性能。"
  },
  {
    "id": "44692897",
    "title": "The UK’s new age-gating rules are easy to bypass",
    "url": "https://www.theverge.com/analysis/713773/uk-online-safety-act-age-verification-bypass-vpn",
    "summary": "This article discusses the ineffectiveness of the UK's new age-gating rules for online platforms. Introduced to comply with online safety regulations requiring platforms to prevent children from accessing harmful content, these rules are easily bypassed by using a VPN.\n\nMany platforms, like Reddit and Bluesky, verify age based on IP addresses. By using a VPN to appear located outside the UK, users can avoid age verification entirely. While Ofcom requires \"strong\" and \"highly effective\" age verification methods, they didn't specify the exact means. Current methods include uploading bank card information, government-issued ID, or a selfie for age estimation.\n\nThe article suggests that selfie verification could be spoofed, and confirms that VPNs circumvent the checks entirely. The author notes their own experience using VPNs at a young age to bypass firewalls, suggesting that teenagers are capable of figuring out this workaround. Other bypass methods include using ad blockers with custom filters and third-party apps that haven't implemented age checkers.\n\nThe article concludes by noting a spike in UK-based Google searches for \"VPN,\" indicating that awareness of this loophole is growing.\n",
    "chinese_title": "英国新的年龄验证规则很容易被绕过",
    "chinese_summary": "本文讨论了英国针对在线平台的新年龄验证规则的无效性。这些规则旨在遵守在线安全法规，要求平台阻止儿童访问有害内容，但通过使用VPN可以轻松绕过。\n\n许多平台，如Reddit和Bluesky，都基于IP地址验证年龄。通过使用VPN伪装成位于英国境外，用户可以完全避免年龄验证。尽管英国通信管理局（Ofcom）要求“强大”且“高效”的年龄验证方法，但他们并未明确具体方式。目前的方法包括上传银行卡信息、政府颁发的身份证件或用于年龄估算的自拍照。\n\n本文认为自拍验证可能被欺骗，并证实VPN完全可以规避这些检查。作者指出自己年轻时使用VPN绕过防火墙的经历，表明青少年有能力找到这种变通方法。其他绕过方法包括使用带有自定义过滤器的广告拦截器以及尚未实施年龄验证的第三方应用程序。\n\n文章最后指出，英国对“VPN”的Google搜索量激增，表明人们对这一漏洞的认识正在提高。"
  },
  {
    "id": "44688265",
    "title": "A Union Pacific-Norfolk Southern combination would redraw the railroad map",
    "url": "https://www.trains.com/trn/news-reviews/news-wire/a-union-pacific-norfolk-southern-combination-would-redraw-the-railroad-map/",
    "summary": "The article discusses potential merger talks between Union Pacific (UP) and Norfolk Southern (NS) to create the first transcontinental railroad in the U.S., a 52,215-mile system. This merger could streamline coast-to-coast service, bypassing congested interchange points.\n\nUP CEO Jim Vena argues that such a merger is essential for remaining competitive during rapid technological change and would benefit the economy by shifting freight from highways to rail. The combined system would generate significant revenue, handle a large volume of shipments, and employ a substantial workforce.\n\nThe merged company would leverage UP's strong carload network, particularly its access to Gulf Coast petrochemical plants, and NS's robust intermodal network in the East, offering superior access to distribution centers. The deal could significantly impact J.B. Hunt, a major intermodal partner for BNSF in the West and NS in the East, potentially forcing them to choose between the two. Automotive networks would also benefit.\n\nPotential operational changes include shifting traffic away from Chicago and New Orleans, potentially favoring Kansas City, Memphis, and Shreveport. While bulk networks would likely remain largely unchanged, there's some overlap of routes in Missouri and Illinois.\n\nThe merger faces regulatory hurdles under the Surface Transportation Board's (STB) 2001 merger review rules, requiring demonstration of \"enhanced competition\" and serving the \"public interest.\" The STB's rules may also lead to required concessions or conditions, like reciprocal switching.\n\nThe article also explores the potential for this merger to trigger further consolidation within the industry, possibly involving BNSF and CSX. While CSX is focused on its own growth, BNSF currently sees no demand for a transcontinental merger.\n",
    "chinese_title": "联合太平洋-诺福克南方合并将重塑铁路版图",
    "chinese_summary": "文章探讨了联合太平洋铁路公司（UP）和诺福克南方铁路公司（NS）之间潜在的合并谈判，旨在创建美国第一条横贯大陆的铁路，一个长达52215英里的系统。此次合并有望简化从东海岸到西海岸的运输服务，绕过拥堵的转运点。\n\n联合太平洋铁路公司首席执行官吉姆·维纳认为，在技术快速变革的时代，这样的合并对于保持竞争力至关重要，并将通过将货物从公路转移到铁路，从而惠及经济。合并后的系统将产生可观的收入，处理大量的货物运输，并雇用大量的劳动力。\n\n合并后的公司将利用联合太平洋铁路公司强大的整车运输网络，特别是其通往墨西哥湾沿岸石化工厂的通道，以及诺福克南方铁路公司在东部强大的多式联运网络，从而提供更优质的配送中心通道。该交易可能会对西方BNSF和东方NS的主要多式联运合作伙伴J.B.亨特产生重大影响，可能迫使他们在这两者之间做出选择。汽车运输网络也将受益。\n\n潜在的运营变更包括将交通流量从芝加哥和新奥尔良转移，可能有利于堪萨斯城、孟菲斯和什里夫波特。虽然大宗货物运输网络可能基本保持不变，但在密苏里州和伊利诺伊州的部分路线上存在一些重叠。\n\n此次合并面临美国地面运输委员会（STB）2001年合并审查规则的监管障碍，该规则要求证明“增强竞争”并服务于“公共利益”。美国地面运输委员会的规则还可能导致需要做出让步或附加条件，例如互惠铁路调车。\n\n文章还探讨了此次合并可能引发业内进一步整合的可能性，可能涉及BNSF和CSX。虽然CSX专注于自身增长，但BNSF目前认为没有对横贯大陆合并的需求。"
  },
  {
    "id": "44686726",
    "title": "Claude Code introduces specialized sub-agents",
    "url": "https://docs.anthropic.com/en/docs/claude-code/sub-agents",
    "summary": "This article introduces \"sub-agents\" in Claude Code, which are specialized AI assistants designed to handle specific tasks more efficiently. Sub-agents have their own context window, system prompts, and can be configured with specific tools, enabling more focused problem-solving.\n\nKey benefits include context preservation, specialized expertise, reusability across projects, and flexible permissions, allowing limited tool access for specific sub-agent types.\n\nUsers can create sub-agents via the `/agents` command or by directly creating Markdown files with YAML frontmatter in `.claude/agents/` (project-level) or `~/.claude/agents/` (user-level). The configuration file defines the sub-agent's name, description, and accessible tools. If tools are omitted, the sub-agent inherits all tools from the main thread.\n\nSub-agents can be invoked explicitly (e.g., \"Use the code-reviewer sub agent...\") or are delegated tasks automatically based on the request and the sub-agent's description. Example sub-agents include a code reviewer, debugger, and data scientist, each pre-configured for their respective roles.\n\nBest practices include starting with Claude-generated agents, designing focused agents with single responsibilities, writing detailed prompts, limiting tool access, and using version control. The article also discusses advanced usage like chaining sub-agents and performance considerations such as context efficiency and latency.\n",
    "chinese_title": "Claude Code 推出专用子代理",
    "chinese_summary": "本文介绍了Claude Code中的“子代理”，它们是专门设计的AI助手，旨在更高效地处理特定任务。子代理拥有自己的上下文窗口、系统提示，并且可以配置特定的工具，从而实现更专注的问题解决。\n\n主要优势包括上下文保持、专业知识、跨项目可重用性以及灵活的权限，允许为特定的子代理类型限制工具访问。\n\n用户可以通过`/agents`命令或直接在`.claude/agents/`(项目级)或`~/.claude/agents/`(用户级)中创建带有YAML frontmatter的Markdown文件来创建子代理。配置文件定义了子代理的名称、描述和可访问的工具。如果省略工具，子代理将继承主线程中的所有工具。\n\n子代理可以被显式调用（例如，“使用代码审查员子代理……”）或根据请求和子代理的描述自动委派任务。示例子代理包括代码审查员、调试器和数据科学家，每个都预先配置了各自的角色。\n\n最佳实践包括从Claude生成的代理开始，设计具有单一职责的专注代理，编写详细的提示，限制工具访问以及使用版本控制。本文还讨论了高级用法，例如链接子代理以及性能考虑因素，例如上下文效率和延迟。"
  },
  {
    "id": "44673296",
    "title": "Windsurf employee #2: I was given a payout of only 1% what my shares where worth",
    "url": "https://twitter.com/premqnair/status/1948420769945682413",
    "summary": "The content provided is a Twitter/X page displaying a message indicating that JavaScript is disabled in the user's browser. It prevents the user from accessing the actual content of the tweet which is titled \"Windsurf employee #2: I was given a payout of only 1% what my shares where worth\".\n\nTherefore, it is impossible to provide a summary of the article without access to the article's body. The available information suggests that a former employee of a company called \"Windsurf\" (identified as employee #2) is claiming to have received a significantly lower payout (only 1%) for their shares than what they believed they were worth.\n\nTo summarize, the provided information points to:\n\n*   A claim made by a former \"Windsurf\" employee.\n*   The employee alleges a drastic undervaluation of their company shares during a payout.\n*   The employee states the payout was only 1% of the perceived value of their shares.\n\nFurther details about the employee's situation, the reasons for the low payout, and the company's response are unknown and unavailable without the full content of the original article.\n",
    "chinese_title": "风帆公司员工#2：我的股票分红只有价值的1%。",
    "chinese_summary": "页面显示Twitter/X消息，提示用户浏览器禁用了JavaScript，导致无法访问题为“Windsurf公司员工#2：我的股份清算金仅为应有价值的1%”的推文内容。\n\n因此，在无法访问文章主体的情况下，无法提供文章摘要。现有信息表明，一家名为“Windsurf”公司的前员工（被标识为员工#2）声称其股份获得的清算金远低于其认为应有的价值（仅为1%）。\n\n总结来说，提供的信息指向：\n\n*   一位前“Windsurf”公司员工的声明。\n*   该员工声称其公司股份在清算时被严重低估。\n*   该员工表示清算金仅为股份预期价值的1%。\n\n关于该员工情况的更多细节、清算金低的原因以及公司的回应均未知，且在没有原文全文内容的情况下无法获得。"
  },
  {
    "id": "44657188",
    "title": "Researchers value null results, but struggle to publish them",
    "url": "https://www.nature.com/articles/d41586-025-02312-4",
    "summary": "This article reports on a survey revealing a disconnect between researchers' views on the value of null results and their willingness to publish them. While 98% of the 11,069 surveyed researchers from 166 countries acknowledge the importance of sharing null results (outcomes that don't confirm the hypothesis), only 30% of those who produced them attempted to publish in a journal.\n\nThe survey, conducted by Springer Nature, found that researchers often avoid publishing null results due to concerns that they won't be accepted, lack of awareness of suitable journals, funding issues, and fear of negative peer perception.  Ritu Dhand of Springer Nature explains researchers are trained to write about positive advances, and null results are rarely cited.\n\nMarcus Munafò of the UK Reproducibility Network emphasizes that most scientific studies and experiments yield null results, and publishing them is crucial for a more accurate representation of the research landscape.  Respondents who successfully published null results reported benefits such as inspiring new methodologies (39%) and preventing unnecessary duplication of research (28%). One anonymous researcher lamented the lack of widespread dissemination of null results that could have saved them years of research. The article advocates for increased awareness and changes in research assessment to encourage the publication of null results.\n",
    "chinese_title": "研究人员重视零结果，但难以发表。",
    "chinese_summary": "一项调查报告显示，研究人员对零结果价值的看法与其发表意愿之间存在脱节。在来自166个国家的11069名受访研究人员中，98%的人承认分享零结果（未证实假设的结果）的重要性，但只有30%的产生零结果的研究人员试图在期刊上发表。\n\nSpringer Nature进行的这项调查发现，研究人员通常避免发表零结果，原因是担心它们不会被接受、缺乏对合适期刊的了解、资金问题以及害怕负面的同行评价。Springer Nature的Ritu Dhand解释说，研究人员接受的培训是撰写积极进展，而零结果很少被引用。\n\n英国可重复性网络（UK Reproducibility Network）的Marcus Munafò强调，大多数科学研究和实验都会产生零结果，而发表这些结果对于更准确地呈现研究图景至关重要。成功发表零结果的受访者报告了诸如激发新方法（39%）和防止不必要的研究重复（28%）等好处。一位匿名研究人员感叹缺乏对零结果的广泛传播，这本可以节省他们多年的研究。该文章倡导提高意识并改变研究评估方式，以鼓励发表零结果。"
  },
  {
    "id": "44656684",
    "title": "Steve Jobs' cabinet",
    "url": "https://perfectdays23.substack.com/p/steve-jobs-cabinet",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "史蒂夫·乔布斯的内阁",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "44682932",
    "title": "Who has the fastest F1 website (2021)",
    "url": "https://jakearchibald.com/2021/f1-perf-part-3/",
    "summary": "This article, part three of a series, analyzes the loading performance of the Red Bull Racing Honda F1 website. The author commends the site's engaging design and improved speed compared to its 2019 version, but identifies several areas for optimization.\n\nKey issues include:\n\n*   **Unnecessary Inlining:** The site inlines a large amount of CSS (over 600kB), most of which is unused on the initial page load, causing a 3-second delay. The author suggests tailoring the inlined code to only what's needed for the initial render.\n*   **Large Primary Image:** The main image, although using the efficient WebP format, has unnecessarily high quality settings.\n*   **Large Overlay Image:** A design-enhancing overlay image is also a large WebP file. The author suggests using AVIF, which handles lossy alpha channel encoding more effectively for this type of image.\n*   **Overlay Image Loaded with JavaScript:** The overlay image is loaded via JavaScript, delaying its load by over 50 seconds. The author recommends using a standard `<img>` tag to leverage responsive images and earlier loading.\n*   **Large Inlined Blurry Image:** The site uses a blurry, low-quality image as a placeholder while the main image loads, but it's larger than necessary. The author explores optimizing this preview image using smaller sizes and alternative formats.\n\nBy addressing these issues, the author estimates that the Red Bull site's load time could be further reduced, improving user experience. The article concludes with a scoreboard, placing Red Bull in the lead compared to the previously analyzed Alpha Tauri and Alfa Romeo sites.\n",
    "chinese_title": "谁拥有最快的F1网站(2021)",
    "chinese_summary": "本文是系列文章的第三部分，分析了红牛车队本田F1网站的加载性能。作者赞扬了该网站引人入胜的设计，以及相比2019年版本的速度提升，但同时也指出了几个需要优化的地方。\n\n主要问题包括：\n\n*   **不必要的内联：** 网站内联了大量CSS（超过600kB），其中大部分在初始页面加载时未使用，导致3秒延迟。作者建议定制内联代码，仅包含初始渲染所需的内容。\n*   **过大的主图像：** 主图像虽然使用了高效的WebP格式，但质量设置过高，没有必要。\n*   **过大的叠加图像：** 一个增强设计的叠加图像也是一个很大的WebP文件。作者建议使用AVIF，这种格式对于此类图像的无损透明通道编码效果更好。\n*   **叠加图像通过JavaScript加载：** 叠加图像通过JavaScript加载，导致加载延迟超过50秒。作者建议使用标准的`<img>`标签，以利用响应式图像并提前加载。\n*   **过大的内联模糊图像：** 网站在主图像加载时使用模糊、低质量的图像作为占位符，但其大小超过了必要。作者探讨了使用更小的尺寸和替代格式来优化此预览图像。\n\n通过解决这些问题，作者估计红牛网站的加载时间可以进一步缩短，从而改善用户体验。文章最后给出了一个记分牌，显示与之前分析过的Alpha Tauri和Alfa Romeo网站相比，红牛处于领先地位。"
  },
  {
    "id": "44690936",
    "title": "What if AI made the world’s economic growth explode?",
    "url": "https://www.economist.com/briefing/2025/07/24/what-if-ai-made-the-worlds-economic-growth-explode",
    "summary": "This article, titled \"What if AI made the world’s economic growth explode?\", explores the potential impact of Artificial Intelligence on global economic growth. It starts by highlighting the historical stagnation of the world economy before the Industrial Revolution, when growth was almost negligible. The Industrial Revolution triggered a significant acceleration in growth rates, eventually reaching an average of 2.8% in the 20th century.\n\nThe article then implies that AI could be a similar transformative force, potentially causing an \"explosion\" in economic growth. It posits that if AI significantly boosts productivity and innovation, markets for goods, services, financial assets, and labor would be radically changed, disrupting current economic norms.\n\nThe article further links to related content, including concerns about AI safety amidst a competitive race between AI labs and the potential economic impact of advancements in cancer prevention. It also touches upon topics such as the global asylum system, political dynamics in the US, and the implications of the war in Ukraine on Western industrial capacity. Essentially, the article uses historical economic shifts to frame the potential, and potentially disruptive, impact of AI on the future.\n",
    "chinese_title": "如果人工智能让世界经济增长爆发会怎样？",
    "chinese_summary": "如果人工智能引爆世界经济增长会怎样？\n\n本文探讨了人工智能对全球经济增长的潜在影响。文章首先指出工业革命前世界经济的停滞，增长几乎可以忽略不计。工业革命引发了增长率的显著加速，最终在20世纪达到平均2.8%。\n\n文章随后暗示，人工智能可能是一种类似的变革力量，可能导致经济增长的“爆炸”。文章假设，如果人工智能显著提高生产力和创新，商品、服务、金融资产和劳动力市场将发生根本性变化，颠覆当前的经济规范。\n\n文章还链接到相关内容，包括人工智能实验室之间竞争激烈背景下的人工智能安全问题，以及癌症预防进展的潜在经济影响。文章还涉及全球庇护制度、美国政治动态以及乌克兰战争对西方工业能力的影响等议题。 本质上，文章利用历史上的经济转变来构建人工智能对未来的潜在影响，以及可能造成的颠覆。"
  },
  {
    "id": "44680308",
    "title": "Quantitative AI progress needs accurate and transparent evaluation",
    "url": "https://mathstodon.xyz/@tao/114910028356641733",
    "summary": "This short article, titled \"Quantitative AI progress needs accurate and transparent evaluation,\" uses a quote from Terence Tao on Mathstodon (\"As a technology matures, the focus tends to shift…\") to highlight the importance of robust and clear evaluation in the development of artificial intelligence. While the content is extremely brief, the core message implies that as AI progresses, the emphasis should move towards:\n\n*   **Quantitative Measurement:** AI progress should be evaluated using quantifiable metrics, allowing for objective comparison and tracking of improvements.\n*   **Accuracy:** These measurements must be accurate and reliable, providing a true representation of AI capabilities.\n*   **Transparency:** Evaluation processes and results should be transparent, enabling scrutiny, reproducibility, and understanding of AI strengths and weaknesses.\n\nThe quote suggests a shift from a focus on simply achieving novelty or demonstrating potential, towards a more rigorous and measurable approach that focuses on reliability, verifiability, and understanding the actual performance of AI systems. The need for JavaScript to access the full context on Mathstodon indicates the context likely involves a broader discussion about evolving priorities in AI research.\n",
    "chinese_title": "量化人工智能进展需要准确透明的评估",
    "chinese_summary": "量化AI进展需要准确且透明的评估\n\n这篇题为《量化AI进展需要准确且透明的评估》的短文，引用了陶哲轩在Mathstodon上的引言（“随着一项技术成熟，焦点往往会转移……”）来强调在人工智能发展中稳健且清晰的评估的重要性。尽管内容极其简短，但核心信息暗示，随着人工智能的进步，重点应该转向：\n\n*   **量化测量：**人工智能的进展应使用可量化的指标进行评估，从而可以对改进进行客观的比较和跟踪。\n*   **准确性：**这些测量必须准确可靠，能够真实地反映人工智能的能力。\n*   **透明度：**评估过程和结果应该是透明的，从而能够对人工智能的优势和劣势进行审查、重现和理解。\n\n这段引言表明，重点应该从单纯追求新颖或展示潜力，转向一种更严格和可衡量的方法，这种方法侧重于可靠性、可验证性以及理解人工智能系统的实际性能。访问Mathstodon上完整上下文需要JavaScript，表明上下文可能涉及对人工智能研究中不断变化的优先事项的更广泛讨论。"
  },
  {
    "id": "44685342",
    "title": "Internet Archive is now a federal depository library",
    "url": "https://www.kqed.org/news/12049420/sf-based-internet-archive-is-now-a-federal-depository-library-what-does-that-mean",
    "summary": "The Internet Archive has been designated a federal depository library by California Senator Alex Padilla, joining a network of over 1,100 libraries that archive and provide public access to government documents. Padilla praised the Internet Archive's \"digital focus\" and its role in expanding access to government publications in a digital age.\n\nFounded Brewster Kahle said this designation will facilitate collaboration with other federal depository libraries, strengthening the internet ecosystem by integrating government materials into platforms like Wikipedia. The Federal Depository Library Program, established in 1813, ensures public access to government records.\n\nThe Internet Archive's involvement is a natural extension of its existing efforts, including Democracy’s Library, an online compendium of government research and publications.\n\nHowever, the Internet Archive faces ongoing legal challenges. Lawsuits from major publishers and music labels challenge its archival practices and could result in substantial financial penalties. These suits question the Internet Archive's status as a library and its digital lending practices, with opponents arguing it's an \"unlicensed digital copyrighting and distribution business.\" Supporters, including librarians and authors, defend it as a vital modern cultural institution.\n\nKahle clarifies that the designation doesn't alter the organization's practices, emphasizing that government publications are not copyrighted and can be freely digitized and distributed. The Internet Archive continues its mission of preserving and providing access to knowledge, including archiving web pages through the Wayback Machine.\n",
    "chinese_title": "互联网档案馆现为联邦政府资料库图书馆。",
    "chinese_summary": "互联网档案馆被加州参议员亚历克斯·帕迪利亚指定为联邦文献存储图书馆，加入了一个由1100多家图书馆组成的网络，这些图书馆负责存档并向公众提供政府文件。帕迪利亚赞扬了互联网档案馆的“数字化重点”及其在数字时代扩大政府出版物获取途径方面的作用。\n\n创始人布鲁斯特·卡勒表示，这一指定将促进与其他联邦文献存储图书馆的合作，通过将政府材料整合到维基百科等平台中，从而加强互联网生态系统。 联邦文献存储图书馆计划成立于1813年，旨在确保公众可以获取政府记录。\n\n互联网档案馆的参与是对其现有工作的自然延伸，包括“民主图书馆”，这是一个政府研究和出版物的在线汇编。\n\n然而，互联网档案馆正面临持续的法律挑战。来自主要出版商和音乐公司的诉讼挑战了其存档实践，并可能导致巨额经济处罚。这些诉讼质疑互联网档案馆作为图书馆的地位及其数字借阅行为，反对者认为它是一个“未经许可的数字版权和发行业务”。包括图书馆员和作家在内的支持者则辩护称，它是一个至关重要的现代文化机构。\n\n卡勒澄清说，这一指定不会改变该组织的运作方式，并强调政府出版物不受版权保护，可以自由数字化和分发。互联网档案馆将继续其保存和提供知识的使命，包括通过时光机器存档网页。"
  },
  {
    "id": "44694809",
    "title": "The Economics of Airline Miles",
    "url": "https://reason.com/2025/07/26/qatar-airways-al-safwa-first-class-lounge-doha-qatar/",
    "summary": "This article explores the history and economics of airline miles, arguing that they are a direct result of airline deregulation in 1978. Before deregulation, the government controlled airfares, and competition was limited. Airlines then used frequent flyer programs to build brand loyalty. The author, who has extensively used airline miles for premium travel experiences, highlights how these programs function as a private currency, influenced by supply and demand, and prone to devaluation.\n\nA key point is that airlines generate substantial revenue by selling miles to third parties, particularly banks offering co-branded credit cards. This revenue model has even been used to secure loans, underscoring the value of loyalty programs. However, these programs are vulnerable, as airlines can change the rules and devalue miles with little recourse for consumers.\n\nThe article also discusses Senator Dick Durbin's attempts to regulate credit card \"swipe fees,\" which could indirectly impact the value of airline miles. He argues that lowering these fees would redistribute money from banks and consumers to retailers. The author contends that while airlines hold most of the cards, consumers still benefit from the system, especially those who are strategic in earning and redeeming miles for premium travel. Despite the potential for devaluation and regulatory scrutiny, airline miles have democratized travel and allowed many to experience the world in ways they never thought possible.\n",
    "chinese_title": "航 空 里 程 经 济 学",
    "chinese_summary": "本文探讨了航空里程的历史和经济学，认为它们是1978年航空业解除管制政策的直接结果。在解除管制前，政府控制机票价格，竞争有限。航空公司随后利用常旅客计划来建立品牌忠诚度。作者经常使用航空里程来获得优质旅行体验，他强调这些计划如何作为一种私人货币运作，受供需影响，并且容易贬值。\n\n关键一点是，航空公司通过向第三方（特别是提供联名信用卡的银行）出售里程来产生大量收入。这种收入模式甚至被用来获得贷款，突显了忠诚度计划的价值。然而，这些计划很脆弱，因为航空公司可以更改规则并使里程贬值，而消费者几乎没有追索权。\n\n本文还讨论了参议员迪克·德宾试图监管信用卡“刷卡费”的举措，这可能会间接影响航空里程的价值。他认为，降低这些费用会将资金从银行和消费者重新分配给零售商。作者认为，虽然航空公司掌握了大部分牌，但消费者仍然从该系统中受益，特别是那些在赚取和兑换里程以获得优质旅行体验方面具有战略眼光的人。尽管存在贬值和监管审查的潜在风险，但航空里程已使旅行大众化，并使许多人能够以他们从未想过的方式体验世界。"
  },
  {
    "id": "44679048",
    "title": "Asciinema: Record and share your terminal sessions",
    "url": "https://asciinema.org",
    "summary": "Asciinema is a free and open-source tool for recording and sharing terminal sessions. Unlike screen recording apps, Asciinema takes a text-based approach, creating lightweight recordings perfect for sharing on the web.\n\nUsers can initiate a recording with a simple command, \"asciinema rec demo.cast,\" and end it with \"ctrl+d\" or \"exit.\" Asciinema offers several advantages: users can easily copy and paste text from recordings, and the player can be embedded in various platforms like blog posts and documentation.\n\nThe website showcases various example recordings, demonstrating Asciinema's utility in different contexts, from interacting with command-line tools to visualizing complex version control operations. This allows users to explore the capabilities and potential applications of Asciinema.\n",
    "chinese_title": "Asciinema：录制并分享你的终端会话",
    "chinese_summary": "Asciinema 是一款免费开源工具，用于录制和分享终端会话。与屏幕录像应用不同，Asciinema 采用基于文本的方式，创建轻量级录像，非常适合在网络上分享。\n\n用户可以使用简单命令 \"asciinema rec demo.cast\" 开始录制，并使用 \"ctrl+d\" 或 \"exit\" 结束录制。Asciinema 具有诸多优势：用户可以轻松地从录像中复制粘贴文本，并且播放器可以嵌入到博客文章和文档等各种平台中。\n\n该网站展示了各种示例录像，展示了 Asciinema 在不同环境中的实用性，从与命令行工具交互到可视化复杂的版本控制操作。这让用户能够探索 Asciinema 的功能和潜在应用。"
  },
  {
    "id": "44682465",
    "title": "Show HN: Price Per Token – LLM API Pricing Data",
    "url": "https://pricepertoken.com/",
    "summary": "This \"Show HN\" post introduces \"Price Per Token,\" a resource providing up-to-date pricing information for major LLM APIs from providers like OpenAI, Anthropic, and Google. The resource allows users to compare the input and output costs per million tokens across different AI models to find the most cost-effective option for their specific needs. The data was last updated on July 25, 2025, at 03:48 PM. It notes that some models employ tiered pricing based on prompt length, with the displayed prices applying to prompts of 200,000 tokens or less. The post also highlights the ability to compare Input Cost and Output cost with a chart. The service, built by @aellman, offers a newsletter for weekly updates on LLM pricing changes and new model releases. In total, the resource covers over 30 different models.\n",
    "chinese_title": "Show HN: 令牌单价 – LLM API 定价数据",
    "chinese_summary": "此“Show HN”帖子介绍“单Token价格”，这是一个提供来自OpenAI、Anthropic和Google等主要LLM API提供商的最新定价信息的资源。该资源允许用户比较不同AI模型的每百万token的输入和输出成本，从而找到满足其特定需求的最具成本效益的选项。数据最后更新于2025年7月25日下午3:48。它指出，某些模型采用基于提示长度的分层定价，显示的定价适用于20万token或更少的提示。该帖子还强调了使用图表比较输入成本和输出成本的功能。该服务由@aellman构建，提供每周更新LLM定价变化和新模型发布的时事通讯。该资源总共涵盖了30多种不同的模型。"
  },
  {
    "id": "44679854",
    "title": "Google spoofed via DKIM replay attack: A technical breakdown",
    "url": "https://easydmarc.com/blog/google-spoofed-via-dkim-replay-attack-a-technical-breakdown/",
    "summary": "This article, titled \"Google spoofed via DKIM replay attack: A technical breakdown,\" is about a DMARC adoption report, \"DMARC Adoption Across Fortune 500 and Inc. 5000: The Growing Divide,\" published on July 25, 2025. The content, as implied by the title, focuses on how Google emails can be spoofed using a DKIM replay attack. This type of attack exploits vulnerabilities related to DomainKeys Identified Mail (DKIM), a security standard designed to verify the sender of email messages. The article likely provides a technical breakdown of this specific vulnerability, explaining how attackers can replay valid DKIM signatures from legitimate Google emails to spoof new emails that appear to originate from Google. It also seemingly touches on DMARC (Domain-based Message Authentication, Reporting & Conformance) adoption rates, specifically among Fortune 500 and Inc. 5000 companies, and identifies a growing divide in implementing this crucial email authentication protocol. Essentially, the article likely argues that the failure to properly adopt DMARC creates opportunities for attackers to leverage DKIM replay attacks, ultimately impacting the security and trustworthiness of email communication, particularly concerning large organizations.\n",
    "chinese_title": "通过 DKIM 重放攻击仿冒 Google：技术分析",
    "chinese_summary": "文章《通过DKIM重放攻击欺骗谷歌：技术分析》讲述的是一份DMARC采纳报告《财富500强和Inc. 5000强企业DMARC采纳情况：日益扩大的差距》（发布于2025年7月25日）。正如标题所示，内容主要关注如何利用DKIM重放攻击欺骗谷歌邮件。这种攻击利用了与域名密钥识别邮件(DKIM)相关的漏洞，DKIM是一种旨在验证电子邮件发件人的安全标准。文章可能提供对此特定漏洞的技术分析，解释攻击者如何重放来自合法谷歌邮件的有效DKIM签名，以欺骗新的邮件，使其看起来来自谷歌。文章似乎还涉及DMARC（基于域的消息认证、报告和一致性）的采纳率，特别是财富500强和Inc. 5000强公司，并指出了在实施这一关键电子邮件身份验证协议方面的日益扩大的差距。本质上，文章可能认为，未能正确采用DMARC会为攻击者利用DKIM重放攻击创造机会，最终影响电子邮件通信的安全性和可信度，特别是对于大型组织而言。"
  },
  {
    "id": "44693778",
    "title": "VPN signups from UK surge 1400% after Online Safety Act goes into effect",
    "url": "https://twitter.com/ProtonVPN/status/1948773319148245334",
    "summary": "The article reports that VPN signups in the UK have surged dramatically, specifically by 1400%, following the implementation of the Online Safety Act. The primary reason for this increase is likely due to concerns surrounding the Act's potential impact on online privacy and freedom of expression. The article's source is X (formerly Twitter) and presents a very basic view of the content, as JavaScript is required to view the full article. The visible information does not provide more details such as the source of the VPN signup data, the specific concerns driving the VPN uptake, or commentary on the Online Safety Act itself. It simply establishes a correlation between the Act's implementation and a significant rise in VPN usage.\n",
    "chinese_title": "英国《网络安全法案》生效后，VPN注册量激增1400%",
    "chinese_summary": "英国VPN注册量在《网络安全法案》实施后激增1400%，主要原因可能是担心该法案对在线隐私和言论自由的潜在影响。文章来源是X（前身为Twitter），内容展示非常基础，需要JavaScript才能查看完整文章。可见信息未提供更多细节，例如VPN注册数据的来源、推动VPN使用的具体原因，或对《网络安全法案》本身的评论。文章仅建立了法案实施与VPN使用量显著上升之间的关联。"
  },
  {
    "id": "44680547",
    "title": "Games Look Bad: HDR and Tone Mapping (2017)",
    "url": "https://ventspace.wordpress.com/2017/10/20/games-look-bad-part-1-hdr-and-tone-mapping/",
    "summary": "Promit's article, \"Games Look Bad: HDR and Tone Mapping,\" critiques the use of High Dynamic Range (HDR) and tone mapping in video games, arguing that they often result in visually unappealing, \"videogamey\" aesthetics instead of cinematic realism.\n\nThe article explains that HDR and tone mapping are used to manage the vast contrast ratios of real-world lighting, compressing them for display on screens. However, game developers often misuse these tools, leading to over-contrasted images, crushed blacks, and blown-out highlights. The author points out that many games use the same tone mapping functions, resulting in a homogenous look across titles.\n\nThe author highlights the difference between focusing on technical capabilities and focusing on the \"feel and visual appeal of high-quality films,\" citing the RED One camera versus the Arri Alexa as examples.\n\nThe author also points out that applying LUTs (Look-Up Tables) to bad tone maps is ineffective and that the current methods of LUT authoring in the game industry are insufficient.\n\nThe article praises Zelda: Breath of the Wild for its stylized, non-HDR approach, and identifies Resident Evil 7, Deus Ex: Mankind Divided (in specific scenes), and Forza Horizon 3 as games that handle HDR relatively well due to stylistic choices and an emphasis on mid-tones and lower contrast.\n\nThe author concludes that the industry needs to improve tone mapping techniques and provide artists with better tools for LUT authoring. They emphasize that tone mapping should be a foundational aesthetic choice, not an afterthought. A final note is that GTA 5 is an example of a well-done tone mapping.\n",
    "chinese_title": "游戏画面糟糕：HDR与色调映射 (2017)",
    "chinese_summary": "Promit的文章《游戏画面糟糕：HDR和色调映射》批判了视频游戏中高动态范围（HDR）和色调映射的使用，认为它们经常导致视觉上缺乏吸引力、充满“游戏感”的画面，而非电影般的真实感。\n\n文章解释说，HDR和色调映射用于管理现实世界光照的巨大对比度，并将其压缩以便在屏幕上显示。然而，游戏开发者经常滥用这些工具，导致图像对比度过高、黑位溢出和高光溢出。作者指出，许多游戏使用相同的色调映射函数，导致不同游戏之间呈现出同质化的外观。\n\n作者强调了专注于技术能力和专注于“高质量电影的感受和视觉吸引力”之间的区别，并以RED One相机和Arri Alexa为例。\n\n作者还指出，将LUT（查找表）应用于糟糕的色调映射是无效的，并且当前游戏行业中的LUT创作方法不足。\n\n文章赞扬了《塞尔达传说：旷野之息》的风格化、非HDR方法，并认为《生化危机7》、《杀出重围：人类分裂》（在特定场景中）和《极限竞速：地平线3》由于风格选择以及对中间色调和较低对比度的重视，相对较好地处理了HDR。\n\n作者总结说，行业需要改进色调映射技术，并为艺术家提供更好的LUT创作工具。他们强调，色调映射应该是一个基本的美学选择，而不是事后的想法。最后指出，《侠盗猎车手5》是色调映射做得很好的一个例子。"
  },
  {
    "id": "44682033",
    "title": "Show HN: I built a biological network visualization tool",
    "url": "https://nodes.bio",
    "summary": "Nodes.bio is presented as a biological network visualization tool designed to accelerate scientific discovery. It enables users to map, analyze, and share complex systems interactively. Key features include the ability to visualize various types of networks (from biological pathways to project dependencies), collaborative editing with real-time co-working, and options to export and share networks in various formats like PNG and JSON.\n\nThe tool aims to convert manually drawn networks into interactive diagrams suitable for publication. Dr. Patrick Sewell, a clinical geneticist, is quoted stating that Nodes.bio allowed him to quickly create a high-quality diagram that would have been impossible with other tools.\n\nThe tool encourages users to try a live demo and/or book a call. The article also indicates that Nodes.bio is trusted by researchers and innovators, though the specific institutions or organizations are left unspecified in the provided content.\n",
    "chinese_title": "Show HN: 我做了一个生物网络可视化工具",
    "chinese_summary": "Nodes.bio：加速科学发现的生物网络可视化工具。它使用户能够以交互方式映射、分析和共享复杂系统。主要功能包括可视化各种类型的网络（从生物途径到项目依赖关系），实时协作编辑，以及将网络导出和共享为 PNG 和 JSON 等各种格式的选项。\n\n该工具旨在将手动绘制的网络转换为适合发布的交互式图表。临床遗传学家 Patrick Sewell 博士表示，Nodes.bio 使他能够快速创建使用其他工具不可能实现的高质量图表。\n\n该工具鼓励用户尝试在线演示和/或预约通话。文章还表明，Nodes.bio 受到研究人员和创新者的信任，尽管提供的文本中未具体说明具体的机构或组织。"
  },
  {
    "id": "44683011",
    "title": "Dwl: Dwm for Wayland",
    "url": "https://codeberg.org/dwl/dwl",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "Dwl: Wayland 上的 Dwm",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "44637532",
    "title": "Brazil central bank to launch Pix installment feature in September",
    "url": "https://www.reuters.com/technology/brazil-central-bank-launch-pix-installment-feature-september-2025-04-03/",
    "summary": "**Summary:**\n\nAccording to Reuters, the Central Bank of Brazil plans to launch an installment payment feature for its instant payment system, Pix, in September 2024. This new functionality, known as \"Pix Garantido,\" will allow users to pay for purchases in installments directly through Pix, a popular and widely adopted payment method in Brazil.\n\nThe key objective is to further enhance Pix's utility and competitiveness within the Brazilian payment landscape, particularly in competition with traditional credit cards. By offering an installment option, Pix aims to capture a larger share of the retail market, allowing consumers to spread out the cost of purchases over time without relying solely on credit cards.\n\nThe Central Bank believes that Pix Garantido will benefit both consumers and merchants. Consumers will gain more flexibility in managing their finances, while merchants will likely see increased sales due to the enhanced payment options. The new system is expected to be fully operational by September 2024.\n",
    "chinese_title": "巴西央行将于九月推出 Pix 分期付款功能",
    "chinese_summary": "**概要：**\n\n据路透社报道，巴西中央银行计划于2024年9月为其即时支付系统Pix推出分期付款功能。这项名为“Pix Garantido”的新功能将允许用户通过Pix直接分期支付购物款项。Pix是巴西一种流行且被广泛使用的支付方式。\n\n其主要目标是进一步增强Pix在巴西支付领域的效用和竞争力，尤其是在与传统信用卡竞争方面。通过提供分期付款选项，Pix旨在占领更大的零售市场份额，让消费者可以在一段时间内分摊购物成本，而无需完全依赖信用卡。\n\n巴西央行认为，Pix Garantido将使消费者和商家受益。消费者将获得更大的财务管理灵活性，而商家可能会因支付方式的增强而看到销售额的增长。预计该新系统将于2024年9月全面投入运营。"
  },
  {
    "id": "44693148",
    "title": "Arm Desktop: x86 Emulation",
    "url": "https://marcin.juszkiewicz.com.pl/2025/07/22/arm-desktop-emulation/",
    "summary": "This article details the author's experience using x86-64 emulation on an AArch64 (Arm) desktop system, specifically an Ampere Altra-based machine running Fedora. The primary emulation solution used is FEX-Emu, and the author recommends removing QEMU packages to ensure FEX-Emu is the sole emulator.\n\nInitial Geekbench 6 results were disappointing, performing at the level of an older Intel Atom CPU. However, the author highlights Arm CPU features that could potentially improve emulation speed, like crypto, TSO emulation, atomic operations, and more, though the Altra's older architecture limits their availability.\n\nTweaking the FEX-Emu configuration by reducing FPU precision and disabling TSO improved performance, particularly in Factorio. The author successfully installed Steam using RPM and FEXBash. Factorio, initially unplayable, became more playable with the configuration tweaks.\n\nA humorous anecdote illustrates the importance of avoiding accidental emulation: building firmware using Ninja was significantly slower until the x86-64 Ninja binary was replaced with a symlink to the native AArch64 version.\n\nThe author concludes that while x86-64 emulation is functional, its performance limitations make it undesirable for everyday use. They may explore running older games like Torchlight II, but don't expect to rely heavily on emulation.\n",
    "chinese_title": "Arm 桌面：x86 模拟",
    "chinese_summary": "本文详细介绍了作者在基于Ampere Altra的Fedora AArch64 (Arm) 桌面系统上使用x86-64模拟的经验。主要使用的模拟方案是FEX-Emu，作者建议移除QEMU软件包以确保FEX-Emu是唯一的模拟器。\n\n最初的Geekbench 6结果令人失望，性能仅达到旧款英特尔Atom CPU的水平。然而，作者强调了Arm CPU可能提高模拟速度的功能，如加密、TSO模拟、原子操作等，尽管Altra较旧的架构限制了这些功能的可用性。\n\n通过降低FPU精度和禁用TSO来调整FEX-Emu配置提高了性能，尤其是在Factorio中。作者使用RPM和FEXBash成功安装了Steam。Factorio最初无法运行，但在配置调整后变得更具可玩性。\n\n一个幽默的轶事说明了避免意外模拟的重要性：使用Ninja构建固件的速度明显降低，直到将x86-64 Ninja二进制文件替换为指向原生AArch64版本的符号链接。\n\n作者总结说，虽然x86-64模拟是可行的，但其性能限制使其不适合日常使用。他们可能会尝试运行像火炬之光II这样的老游戏，但不期望大量依赖模拟。"
  },
  {
    "id": "44676691",
    "title": "Graphene OS: a security-enhanced Android build",
    "url": "https://lwn.net/SubscriberLink/1030004/898017c7953c0946/",
    "summary": "This LWN.net article reviews GrapheneOS, a security-enhanced Android build focused on user privacy and device control. GrapheneOS, born from the ashes of CopperheadOS, aims to harden Android against threats by removing code and adding security features like a hardened malloc() library and control-flow integrity.\n\nThe article highlights that GrapheneOS supports only recent Google Pixel devices (6-9), prioritizing security through hardware memory tagging and longer support guarantees. Installation can be done via web or command-line, with the web method being more reliable.\n\nGrapheneOS provides a clean slate experience, lacking the pre-installed apps of stock Android. It offers its own browser (Vanadium), camera app, PDF viewer, and app store. For wider app availability, it supports Accrescent, F-Droid, and even a sandboxed Google Play Store. The article mentions the Android integrity API and its potential to cause issues with certain apps.\n\nThe review emphasizes the security features including granular app permission control (network, sensors, storage, contacts), fingerprint unlock with lockout, and a duress PIN for data wiping. The system updates frequently, with aggressive updates to the latest Android versions.\n\nThe article notes potential concerns about the GrapheneOS development community's transparency and reliance on a single individual, Daniel Micay. However, the author concludes that GrapheneOS provides a more secure and private Android experience, despite the need to potentially integrate proprietary software like Google Play services. The author commits to using GrapheneOS as their daily driver.\n",
    "chinese_title": "石墨烯操作系统：一个安全增强的安卓版本",
    "chinese_summary": "这篇LWN.net文章评测了GrapheneOS，这是一款注重用户隐私和设备控制的增强安全型安卓系统。GrapheneOS脱胎于CopperheadOS，旨在通过移除代码和增加安全特性（如强化的malloc()库和控制流完整性）来加固安卓系统，抵御威胁。\n\n文章强调GrapheneOS仅支持最新的谷歌Pixel设备（6-9），并通过硬件内存标记和更长的支持保障来优先考虑安全性。安装可以通过网页或命令行进行，网页方法更可靠。\n\nGrapheneOS提供了一种纯净的体验，缺乏原生安卓的预装应用。它提供了自己的浏览器（Vanadium）、相机应用、PDF阅读器和应用商店。为了更广泛的应用可用性，它支持Accrescent、F-Droid，甚至还有一个沙盒化的Google Play商店。文章提到了安卓完整性API及其可能导致某些应用出现问题。\n\n评测强调了安全特性，包括细粒度的应用权限控制（网络、传感器、存储、联系人）、带锁定的指纹解锁以及用于数据擦除的胁迫密码。系统频繁更新，并积极更新到最新的安卓版本。\n\n文章指出，人们可能担心GrapheneOS开发社区的透明度以及对单个个人Daniel Micay的依赖。然而，作者总结认为，尽管可能需要集成像Google Play服务这样的专有软件，GrapheneOS仍然提供了更安全和私密的安卓体验。作者承诺将GrapheneOS作为他们的日常使用系统。"
  },
  {
    "id": "44656624",
    "title": "Running PostmarketOS on Android Termux proot without a custom ROM (2024)",
    "url": "https://ivonblog.com/en-us/posts/postmarketos-in-termux-proot/",
    "summary": "This article details a method for running postmarketOS with the Phosh desktop environment on an Android phone using Termux proot, without requiring rooting or flashing a custom ROM. The author seeks to explore mobile Linux possibilities on Android and leverage Phosh's touchscreen-optimized interface.\n\nThe process involves installing Alpine Linux via Termux's proot-distro, then converting it to postmarketOS by adding its repository and updating packages. This is done because postmarketOS isn't readily available for all Android phones, and porting it is complex. Termux offers a convenient way to run Linux containers without root access.\n\nPhosh, a lightweight and touchscreen-friendly desktop environment, is then installed. The guide outlines how to launch Phosh within Termux X11 using Openbox and Cage to enable a nested Wayland session within X11.\n\nThe article provides instructions for setting up prerequisites like Termux X11, virglrenderer (optional), and Hacker's Keyboard. It also covers configuring the Alpine Linux proot environment, including switching to the appropriate Alpine version (v3.20, corresponding to postmarketOS v24.06), adding a user, enabling SSH, and then transitioning to postmarketOS.\n\nFinally, the author briefly explores other desktop environments like Plasma Mobile and SXMO, noting their drawbacks in this context. The article concludes with references and related tutorials.  The Phosh experience allows use of touch gestures, but notes it is not a full Linux environment.\n",
    "chinese_title": "无需定制ROM，在Android Termux proot上运行PostmarketOS (2024)",
    "chinese_summary": "本文详细介绍了一种使用Termux proot在Android手机上运行带有Phosh桌面环境的postmarketOS的方法，无需root或刷入自定义ROM。作者旨在探索Android上的移动Linux可能性，并利用Phosh的触摸屏优化界面。\n\n该过程涉及通过Termux的proot-distro安装Alpine Linux，然后通过添加其存储库和更新软件包将其转换为postmarketOS。这样做是因为postmarketOS并非适用于所有Android手机，并且移植它很复杂。Termux提供了一种无需root访问权限即可运行Linux容器的便捷方式。\n\n随后安装了轻量级且触摸屏友好的桌面环境Phosh。该指南概述了如何在Termux X11中使用Openbox和Cage启动Phosh，以在X11中启用嵌套的Wayland会话。\n\n本文提供了设置先决条件（如Termux X11、virglrenderer（可选）和 Hacker's Keyboard）的说明。它还涵盖了配置Alpine Linux proot环境，包括切换到适当的Alpine版本（v3.20，对应于postmarketOS v24.06），添加用户，启用SSH，然后过渡到postmarketOS。\n\n最后，作者简要探讨了其他桌面环境，如Plasma Mobile和SXMO，并指出了它们在此环境中的缺点。文章以参考文献和相关教程结尾。Phosh体验允许使用触摸手势，但指出它不是一个完整的Linux环境。"
  },
  {
    "id": "44693066",
    "title": "Make the Web Great Again",
    "url": "https://koshka.love/mwwwga.html",
    "summary": "The article \"Make the Web Great Again\" argues that the modern web has deteriorated from its original state, losing the magic and wonder it once possessed. The author identifies five key principles of the \"old web\" that are now lacking:\n\n*   **Anonymity:** Encouraged idea meritocracy by obscuring personal details, preventing biases.\n*   **Decentralization:** Argues against monopolies, advocating for a web where no single entity has excessive control.\n*   **Technical Literacy:** Suggests a basic level of technical skill was beneficial as a barrier to entry, preventing the web from being dominated by the lowest common denominator.\n*   **Non-Commercialization:** Opposes the aggressive commercialization and manipulation of algorithms for profit, as well as vapid \"personal branding\".\n*   **Freedom of Speech:** Laments the loss of tolerance for diverse and potentially offensive viewpoints, advocating for a truly free and open global medium.\n\nThe author believes the decline is due to increasing normiefication, smartphone usage, and the dominance of big tech companies. The solution lies in boycotting these companies and supporting alternative platforms like Neocities, Gab, Kolyma, and independent Web 1.0 sites. The author highlights Wiby, a search engine that focuses on Web 1.0 sites. By embracing these alternatives, the author believes it's possible to restore the values and wonder of the old web.\n",
    "chinese_title": "让网络再次伟大",
    "chinese_summary": "让网络再次伟大：文章认为现代网络已经从其最初的状态恶化，失去了曾经的魔力和奇迹。作者指出了“旧网络”中如今缺失的五个关键原则：\n\n*   **匿名性：** 通过隐藏个人信息来鼓励思想精英制度，防止偏见。\n*   **去中心化：** 反对垄断，倡导一个没有单一实体拥有过度控制权的网络。\n*   **技术素养：** 认为一定的技术技能水平作为准入门槛是有益的，可以防止网络被最低共同标准所支配。\n*   **非商业化：** 反对为利润而进行的激进商业化和算法操纵，以及空洞的“个人品牌”。\n*   **言论自由：** 哀叹对多元化和可能冒犯性观点的容忍度下降，倡导一个真正自由和开放的全球媒介。\n\n作者认为，这种衰落是由于日益增长的平庸化、智能手机的使用以及大型科技公司的统治造成的。 解决方案在于抵制这些公司，并支持 Neocities、Gab、Kolyma 和独立 Web 1.0 站点等替代平台。 作者重点介绍了 Wiby，这是一个专注于 Web 1.0 站点的搜索引擎。 通过拥抱这些替代方案，作者认为有可能恢复旧网络的价值和奇迹。"
  },
  {
    "id": "44692184",
    "title": "The Steely Dan Dictionary: 30th June 2025 – 25th anniversary",
    "url": "https://steelydandictionary.com",
    "summary": "This is an announcement for \"The Steely Dan Dictionary,\" an A-Z glossary dedicated to explaining the obscure words, people, and places referenced in Steely Dan lyrics. Created by Dan O'Malley and launched in June 2000, the site aims to clarify the often-murky literary and cultural references sprinkled throughout Steely Dan's songs by Walter Becker and Donald Fagen.\n\nThe dictionary primarily focuses on real-life people and locations, deliberately excluding fictional names, objects, and locales created by Becker and Fagen (like Hoops McCann or Steamer Heaven) due to the impossibility of defining them. Exceptions are made only when the creators themselves have provided a clear definition for neologisms like \"Custerdome.\"\n\nThe website targets a primarily non-American audience, offering explanations for locations and institutions that might be unfamiliar to those outside the United States, such as \"TJ\" or \"IHOP.\" However, even Americans might find value in learning about more globally recognized locations and cocktails.\n\nTo commemorate the site's 25th anniversary on June 30th, 2025, eight new entries, taken from non-album and unreleased Steely Dan songs, have been added. The author, Dan O'Malley, encourages users to provide feedback, suggestions, and corrections to further improve the dictionary.\n",
    "chinese_title": "铁杆丹词典：2025年6月30日 – 25周年纪念",
    "chinese_summary": "这是为“铁娘子丹词典”发布的公告，这是一部A-Z词汇表，致力于解释铁娘子丹歌词中引用的晦涩词汇、人物和地点。该网站由Dan O'Malley创建，于2000年6月启动，旨在阐明Walter Becker和Donald Fagen在铁娘子丹歌曲中穿插的往往晦涩的文学和文化典故。\n\n该词典主要关注真实人物和地点，刻意排除Becker和Fagen创造的虚构名称、物品和场所（如Hoops McCann或Steamer Heaven），因为无法对其进行定义。仅当创作者本人对诸如“Custerdome”之类的新词提供了明确定义时，才会做出例外。\n\n该网站主要面向非美国受众，为美国境外的人可能不熟悉的地点和机构提供解释，例如“TJ”或“IHOP”。然而，即使是美国人也可能会发现了解更多全球认可的地点和鸡尾酒的价值。\n\n为了纪念该网站于2025年6月30日迎来25周年，现已添加了八个新条目，这些条目取自非专辑和未发行的铁娘子丹歌曲。作者Dan O'Malley鼓励用户提供反馈、建议和更正，以进一步改进该词典。"
  },
  {
    "id": "44685445",
    "title": "How to configure X11 in a simple way",
    "url": "https://eugene-andrienko.com/en/it/2025/07/24/x11-configuration-simple.html",
    "summary": "This article details how to configure the X11 windowing system in FreeBSD for a modern desktop experience without relying on heavyweight desktop environments like Gnome or KDE. It focuses on using simple, time-tested programs and configuration methods.\n\nKey topics covered include:\n\n*   **High DPI:** Configuring X11 to properly scale GUI elements on high-resolution displays by adjusting the active area dimensions in millimeters within the X server configuration.\n*   **Keyboard Configuration:** Setting up keyboard layouts, switching methods (using the Menu key), Compose key functionality, and remapping keys (CapsLock to Ctrl) using `setxkbmap` and `xmodmap`, and translating these settings into `xorg.conf` for system-wide application.\n*   **Multimedia Keys:** Utilizing kernel modules to recognize multimedia key presses and bind them to actions within the window manager.\n*   **Pointing Devices:** Configuring touchpads (disabling them), trackpoints (minimal setup), and trackballs (remapping buttons and enabling scroll emulation for left-handed use).\n*   **Other:** Mentioned topics are screensavers, compositors, window sizing, themes (GTK2/3/4, Qt, Librewolf), fonts, icons, display managers (XDM), `xdg-utils`, and using Emacs as a default file manager, mail agent, editor, and PDF viewer.\n\nThe author prioritizes lightweight solutions, avoiding bloatware by disabling unwanted compile-time options, recompiling necessary programs, and selecting mature utilities. The configurations aim for a consistent look and feel across the system, affecting everything from the login screen to individual applications.\n",
    "chinese_title": "如何简单配置X11",
    "chinese_summary": "本文详细介绍了如何在 FreeBSD 中配置 X11 窗口系统，以获得现代桌面体验，而无需依赖像 Gnome 或 KDE 这样重量级的桌面环境。它侧重于使用简单、久经考验的程序和配置方法。\n\n涵盖的关键主题包括：\n\n*   **高 DPI：** 通过调整 X 服务器配置中活动区域的毫米尺寸，配置 X11 以在高清显示器上正确缩放 GUI 元素。\n*   **键盘配置：** 使用 `setxkbmap` 和 `xmodmap` 设置键盘布局、切换方法（使用 Menu 键）、Compose 键功能和重映射键（CapsLock 到 Ctrl），并将这些设置转换为 `xorg.conf` 以进行系统范围的应用。\n*   **多媒体键：** 利用内核模块来识别多媒体键的按下并将其绑定到窗口管理器中的操作。\n*   **指点设备：** 配置触摸板（禁用它们）、指点杆（最小设置）和轨迹球（重新映射按钮并启用滚动模拟以供左手使用）。\n*   **其他：** 提及的主题包括屏幕保护程序、合成器、窗口大小调整、主题（GTK2/3/4、Qt、Librewolf）、字体、图标、显示管理器（XDM）、`xdg-utils`，以及使用 Emacs 作为默认文件管理器、邮件代理、编辑器和 PDF 查看器。\n\n作者优先考虑轻量级解决方案，通过禁用不需要的编译时选项、重新编译必要的程序和选择成熟的实用程序来避免臃肿。这些配置旨在实现系统范围内的外观和感觉一致，影响从登录屏幕到单个应用程序的所有内容。"
  },
  {
    "id": "44689402",
    "title": "SRAM Has No Chill: Exploiting Power Domain Separation to Steal On-Chip Secrets",
    "url": "https://cacm.acm.org/research-highlights/sram-has-no-chill-exploiting-power-domain-separation-to-steal-on-chip-secrets/",
    "summary": "This article introduces \"Volt Boot,\" a novel attack that exploits power domain separation in modern SoCs to recover sensitive data from on-chip SRAM, bypassing traditional cold boot defenses. While standard cold boot attacks rely on low temperatures to prolong data retention in memory after power loss, Volt Boot leverages asymmetrical power states across different power domains within the SoC to force SRAM state retention across power cycles. This eliminates the need for extreme cold or intrinsic retention time.\n\nThe authors demonstrate the ineffectiveness of traditional cold boot attacks on on-chip SRAM due to its integrated nature, short retention time, and extreme temperature requirements. In contrast, Volt Boot exploits the power domain architecture where different SoC components (core, memory, I/O) operate on separate voltage levels controlled by a PMU.\n\nThe attack is demonstrated on three modern ARM Cortex-A SoCs, successfully retrieving data from caches, CPU registers, and iRAMs with 100% accuracy when the application runs undisturbed from internal memory. This is achieved without any complex post-processing.\n\nThe article highlights the vulnerability of on-chip computation schemes, which are designed to protect sensitive data by keeping it within the chip's boundaries. Volt Boot demonstrates that even these architectures are susceptible to physical memory disclosure attacks by exploiting power domain separation. The authors also discuss potential countermeasures and their trade-offs. The key takeaway is that on-chip SRAM is not inherently secure against all physical attacks, and architectural designs like power domain separation can inadvertently introduce new vulnerabilities.\n",
    "chinese_title": "SRAM 毫无防备：利用电源域隔离窃取片上机密",
    "chinese_summary": "本文介绍了一种名为“Volt Boot”的新型攻击，该攻击利用现代SoC中的电源域分离机制，从片上SRAM恢复敏感数据，绕过传统的冷启动防御。标准的冷启动攻击依赖于低温来延长断电后内存中的数据保留时间，而Volt Boot则利用SoC内不同电源域之间的非对称电源状态，强制SRAM在电源周期内保持状态。这消除了对极端低温或固有保留时间的需求。\n\n作者证明了由于片上SRAM的集成特性、短保留时间和极端温度要求，传统的冷启动攻击对其无效。相比之下，Volt Boot利用电源域架构，其中不同的SoC组件（核心、内存、I/O）在由PMU控制的独立电压级别上运行。\n\n该攻击已在三个现代ARM Cortex-A SoC上进行了演示，当应用程序从内部存储器不受干扰地运行时，成功地从缓存、CPU寄存器和iRAM中检索到数据，准确率达到100%。这是在没有任何复杂的后处理的情况下实现的。\n\n本文强调了片上计算方案的脆弱性，这些方案旨在通过将敏感数据保存在芯片边界内来保护敏感数据。Volt Boot证明，即使是这些架构也容易受到物理内存泄露攻击，因为它们利用了电源域分离。作者还讨论了潜在的对策及其权衡。主要结论是，片上SRAM并非固有地可以抵御所有物理攻击，而像电源域分离这样的架构设计可能会无意中引入新的漏洞。"
  },
  {
    "id": "44695395",
    "title": "Jeff Bezos Reportedly Eyes Purchase of CNBC as Tech Billionaires Gobble Up Media",
    "url": "https://gizmodo.com/jeff-bezos-reportedly-eyes-purchase-of-cnbc-as-tech-billionaires-gobble-up-media-2000633437",
    "summary": "This July 2025 article reports that Jeff Bezos is considering purchasing CNBC, which is being spun off by Comcast into a new company called Versant. The author expresses concern, citing Bezos's alleged influence on the Washington Post since his 2013 acquisition. The article claims that Bezos suppressed a planned endorsement of Kamala Harris in the 2024 election and purged liberal voices from the Post's opinion pages, leading to subscriber losses and accusations of ideological meddling. The author highlights Bezos's apparent shift toward supporting Donald Trump, noting his attendance at the 2025 inauguration and subsequent meetings.\n\nThe article positions Bezos's potential acquisition of CNBC within a broader trend of tech billionaires acquiring media properties, referencing Elon Musk's purchase and transformation of Twitter into X, and David Ellison's impending leadership of Paramount after its merger with Skydance. The author also mentions rumors of Bezos's interest in Condé Nast, suggesting the possibility of carving out Vogue for his wife, Lauren Sanchez.\n\nUltimately, the piece argues that if Bezos were to acquire CNBC, it could become a tool for furthering his political and economic agenda. The author implies that this aligns with a broader trend of billionaires using media ownership to influence public opinion and political discourse.\n",
    "chinese_title": "据报道，杰夫·贝佐斯有意收购CNBC，科技亿万富翁纷纷抢购媒体。",
    "chinese_summary": "This July 2025 article reports that Jeff Bezos is considering purchasing CNBC, which is being spun off by Comcast into a new company called Versant. The author expresses concern, citing Bezos's alleged influence on the Washington Post since his 2013 acquisition. The article claims that Bezos suppressed a planned endorsement of Kamala Harris in the 2024 election and purged liberal voices from the Post's opinion pages, leading to subscriber losses and accusations of ideological meddling. The author highlights Bezos's apparent shift toward supporting Donald Trump, noting his attendance at the 2025 inauguration and subsequent meetings.\n\nThe article positions Bezos's potential acquisition of CNBC within a broader trend of tech billionaires acquiring media properties, referencing Elon Musk's purchase and transformation of Twitter into X, and David Ellison's impending leadership of Paramount after its merger with Skydance. The author also mentions rumors of Bezos's interest in Condé Nast, suggesting the possibility of carving out Vogue for his wife, Lauren Sanchez.\n\nUltimately, the piece argues that if Bezos were to acquire CNBC, it could become a tool for furthering his political and economic agenda. The author implies that this aligns with a broader trend of billionaires using media ownership to influence public opinion and political discourse.\n"
  },
  {
    "id": "44693366",
    "title": "Dutch Industry Buckles Under Energy Transition and Global Pressure",
    "url": "https://oilprice.com/Energy/Energy-General/Dutch-Industry-Buckles-Under-Energy-Transition-and-Global-Pressure.html",
    "summary": "生成摘要时出错",
    "chinese_title": "荷兰工业在能源转型和全球压力下举步维艰",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44633648",
    "title": "3-JSON",
    "url": "https://rgbcu.be/blog/3-json/",
    "summary": "生成摘要时出错",
    "chinese_title": "3-JSON",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44685669",
    "title": "Implementing a functional language with graph reduction (2021)",
    "url": "https://thma.github.io/posts/2021-12-27-Implementing-a-functional-language-with-Graph-Reduction.html",
    "summary": "生成摘要时出错",
    "chinese_title": "Implementing a functional language with graph reduction (2021)",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44694128",
    "title": "Fig trees convert atmospheric CO₂ to stone, research reveals",
    "url": "https://phys.org/news/2025-07-fig-trees-atmospheric-stone-reveals.html",
    "summary": "This 2025 article reveals that certain fig trees in Kenya possess a unique ability to sequester atmospheric CO₂ and convert it into calcium carbonate, essentially turning themselves and the surrounding soil into stone. This process, known as the oxalate-carbonate pathway, involves the trees using CO₂ to create calcium oxalate crystals, which are then converted into calcium carbonate by specialized microorganisms when the tree decays. This inorganic carbon storage is more long-lasting than typical organic carbon sequestration, making it a potentially more effective method of mitigating CO₂ emissions.\n\nResearchers from multiple institutions studied three fig tree species in Samburu County, Kenya, finding that *Ficus wakefieldii* was the most effective at this process. Synchrotron analysis revealed calcium carbonate formation both on the tree's surface and deeper within its wood, increasing soil alkalinity. This finding suggests the oxalate-carbonate pathway's potential for sequestering carbon has been previously underestimated.\n\nThe research team plans further studies to assess the suitability of *Ficus wakefieldii* for agroforestry, focusing on water requirements, fruit yields, and the amount of CO₂ sequestered under varying conditions. While the oxalate-carbonate pathway has been primarily studied in tropical, non-food-producing trees, the prevalence of calcium oxalate production and converting microorganisms suggests many more tree species may possess this capability. This highlights the oxalate-carbonate pathway as a significant, underexplored opportunity for CO₂ mitigation in forestry and fruit production.\n",
    "chinese_title": "Fig trees convert atmospheric CO₂ to stone, research reveals",
    "chinese_summary": "This 2025 article reveals that certain fig trees in Kenya possess a unique ability to sequester atmospheric CO₂ and convert it into calcium carbonate, essentially turning themselves and the surrounding soil into stone. This process, known as the oxalate-carbonate pathway, involves the trees using CO₂ to create calcium oxalate crystals, which are then converted into calcium carbonate by specialized microorganisms when the tree decays. This inorganic carbon storage is more long-lasting than typical organic carbon sequestration, making it a potentially more effective method of mitigating CO₂ emissions.\n\nResearchers from multiple institutions studied three fig tree species in Samburu County, Kenya, finding that *Ficus wakefieldii* was the most effective at this process. Synchrotron analysis revealed calcium carbonate formation both on the tree's surface and deeper within its wood, increasing soil alkalinity. This finding suggests the oxalate-carbonate pathway's potential for sequestering carbon has been previously underestimated.\n\nThe research team plans further studies to assess the suitability of *Ficus wakefieldii* for agroforestry, focusing on water requirements, fruit yields, and the amount of CO₂ sequestered under varying conditions. While the oxalate-carbonate pathway has been primarily studied in tropical, non-food-producing trees, the prevalence of calcium oxalate production and converting microorganisms suggests many more tree species may possess this capability. This highlights the oxalate-carbonate pathway as a significant, underexplored opportunity for CO₂ mitigation in forestry and fruit production.\n"
  },
  {
    "id": "44684168",
    "title": "Nullable but not null",
    "url": "https://efe.me/posts/nullable-but-not-null/",
    "summary": "生成摘要时出错",
    "chinese_title": "可空但非空",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44678512",
    "title": "Celebrating 20 Years of MDN",
    "url": "https://developer.mozilla.org/en-US/blog/mdn-turns-20/",
    "summary": "生成摘要时出错",
    "chinese_title": "Celebrating 20 Years of MDN",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44685869",
    "title": "WhoFi: Deep Person Re-Identification via Wi-Fi Channel Signal Encoding",
    "url": "https://arxiv.org/abs/2507.12869",
    "summary": "生成摘要时出错",
    "chinese_title": "WhoFi: 基于Wi-Fi信道信号编码的深度行人重识别",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44683490",
    "title": "Show HN: The Montana MiniComputer",
    "url": "https://mtmc.cs.montana.edu/",
    "summary": "生成摘要时出错",
    "chinese_title": "Show HN: The Montana MiniComputer",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44640143",
    "title": "High-speed organic light-emitting diodes achieving 4-Gbps communication",
    "url": "https://www.spiedigitallibrary.org/journals/advanced-photonics/volume-7/issue-03/036005/High-speed-organic-light-emitting-diodes-based-on-dinaphthylperylene-achieving/10.1117/1.AP.7.3.036005.full",
    "summary": "生成摘要时出错",
    "chinese_title": "High-speed organic light-emitting diodes achieving 4-Gbps communication",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44661592",
    "title": "Why is there a date of 1968 in the Intel Chipset Device Software Utility?",
    "url": "https://www.intel.com/content/www/us/en/support/articles/000095169/processors.html",
    "summary": "生成摘要时出错",
    "chinese_title": "Why is there a date of 1968 in the Intel Chipset Device Software Utility?",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44682626",
    "title": "How to draw lambda diagrams (2020)",
    "url": "https://risingentropy.com/how-to-draw-lambda-diagrams/",
    "summary": "生成摘要时出错",
    "chinese_title": "How to draw lambda diagrams (2020)",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44681950",
    "title": "Lisp project of the day",
    "url": "https://40ants.com/lisp-project-of-the-day/index.html",
    "summary": "生成摘要时出错",
    "chinese_title": "Lisp project of the day",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44675553",
    "title": "Inter-Planetary Network Special Interest Group",
    "url": "https://www.ipnsig.org",
    "summary": "生成摘要时出错",
    "chinese_title": "Inter-Planetary Network Special Interest Group",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44687326",
    "title": "Stackless Traversal (2018)",
    "url": "https://www.dyalog.com/blog/2018/01/stackless-traversal/",
    "summary": "生成摘要时出错",
    "chinese_title": "Stackless Traversal (2018)",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44676817",
    "title": "Scientists may have found a way to eliminate chromosome linked to Down syndrome",
    "url": "https://academic.oup.com/pnasnexus/article/4/2/pgaf022/8016019",
    "summary": "生成摘要时出错",
    "chinese_title": "Scientists may have found a way to eliminate chromosome linked to Down syndrome",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44641667",
    "title": "Trucking's uneasy relationship with new tech",
    "url": "https://www.bbc.com/news/articles/c5yeyn4gl80o",
    "summary": "生成摘要时出错",
    "chinese_title": "Trucking's uneasy relationship with new tech",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44634208",
    "title": "Mwm – The smallest usable X11 window manager",
    "url": "https://github.com/lslvr/mwm",
    "summary": "生成摘要时出错",
    "chinese_title": "Mwm – The smallest usable X11 window manager",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44666353",
    "title": "How to Catch a Wily Poacher in a Sting: A Thermal Robotic Deer",
    "url": "https://www.wsj.com/us-news/how-to-catch-a-wily-poacher-in-a-sting-a-thermal-robotic-deer-ffef0fa8",
    "summary": "生成摘要时出错",
    "chinese_title": "How to Catch a Wily Poacher in a Sting: A Thermal Robotic Deer",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44634469",
    "title": "Developing with Kiro: Amazon's New Agentic IDE",
    "url": "https://yehudacohen.substack.com/p/developing-with-kiro-amazons-new",
    "summary": "生成摘要时出错",
    "chinese_title": "Developing with Kiro: Amazon's New Agentic IDE",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44674123",
    "title": "Air Force unit suspends use of Sig Sauer pistol after shooting death of airman",
    "url": "https://www.nhpr.org/nh-news/2025-07-23/sig-sauer-pistol-air-force-shooting-death",
    "summary": "生成摘要时出错",
    "chinese_title": "Air Force unit suspends use of Sig Sauer pistol after shooting death of airman",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44669631",
    "title": "Thunder Compute (YC S24) Is Hiring a C++ Systems Engineer",
    "url": "https://www.ycombinator.com/companies/thunder-compute/jobs/DhML6Uf-c-systems-engineer",
    "summary": "生成摘要时出错",
    "chinese_title": "Thunder Compute (YC S24) Is Hiring a C++ Systems Engineer",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44679406",
    "title": "Against the censorship of adult content by payment processors",
    "url": "https://soatok.blog/2025/07/24/against-the-censorship-of-adult-content-by-payment-processors/",
    "summary": "生成摘要时出错",
    "chinese_title": "Against the censorship of adult content by payment processors",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44639563",
    "title": "Nuclear Reactor SIM by PeteTimesSix",
    "url": "https://petetimessix.itch.io/nuclear-reactors",
    "summary": "生成摘要时出错",
    "chinese_title": "Nuclear Reactor SIM by PeteTimesSix",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44694891",
    "title": "Chinese real-world self-driving test: 36 cars, 216 crashes, with Tesla on top",
    "url": "https://electrek.co/2025/07/26/a-chinese-real-world-self-driving-test-36-cars-216-crashes-with-tesla-on-top/",
    "summary": "生成摘要时出错",
    "chinese_title": "Chinese real-world self-driving test: 36 cars, 216 crashes, with Tesla on top",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44684212",
    "title": "Quantum Scientists Have Built a New Math of Cryptography",
    "url": "https://www.quantamagazine.org/quantum-scientists-have-built-a-new-math-of-cryptography-20250725/",
    "summary": "生成摘要时出错",
    "chinese_title": "Quantum Scientists Have Built a New Math of Cryptography",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44687132",
    "title": "Building Brain Box, a meta text adventure film adaptation",
    "url": "https://kubicki.org/workbench/brain-box/",
    "summary": "生成摘要时出错",
    "chinese_title": "Building Brain Box, a meta text adventure film adaptation",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44641729",
    "title": "Nvidia Launches Family of Open Reasoning AI Models: OpenReasoning Nemotron",
    "url": "https://nvidianews.nvidia.com/news/nvidia-launches-family-of-open-reasoning-ai-models-for-developers-and-enterprises-to-build-agentic-ai-platforms",
    "summary": "生成摘要时出错",
    "chinese_title": "Nvidia Launches Family of Open Reasoning AI Models: OpenReasoning Nemotron",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44636534",
    "title": "Modernish – A library for writing programs for POSIX-based shells and utilities",
    "url": "https://github.com/modernish/modernish",
    "summary": "生成摘要时出错",
    "chinese_title": "Modernish – A library for writing programs for POSIX-based shells and utilities",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44683481",
    "title": "Google's shortened goo.gl links will stop working next month",
    "url": "https://www.theverge.com/news/713125/google-url-shortener-links-shutdown-deadline",
    "summary": "生成摘要时出错",
    "chinese_title": "Google's shortened goo.gl links will stop working next month",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44681786",
    "title": "Google Opal",
    "url": "https://developers.googleblog.com/en/introducing-opal/",
    "summary": "生成摘要时出错",
    "chinese_title": "Google Opal",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44681740",
    "title": "My website is one binary (2022)",
    "url": "https://j3s.sh/thought/my-website-is-one-binary.html",
    "summary": "生成摘要时出错",
    "chinese_title": "My website is one binary (2022)",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44692118",
    "title": "Ambigrammia: Between Creation and Discovery",
    "url": "https://yalebooks.yale.edu/book/9780300275438/ambigrammia/",
    "summary": "生成摘要时出错",
    "chinese_title": "Ambigrammia: Between Creation and Discovery",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44693695",
    "title": "Key Variables That Determine UBI's Inflationary Impact",
    "url": "https://www.scottsantens.com/17-key-variables-that-determine-ubis-inflationary-impact/",
    "summary": "生成摘要时出错",
    "chinese_title": "Key Variables That Determine UBI's Inflationary Impact",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44690914",
    "title": "SQLx – The Rust SQL Toolkit",
    "url": "https://github.com/launchbadge/sqlx",
    "summary": "生成摘要时出错",
    "chinese_title": "SQLx – The Rust SQL Toolkit",
    "chinese_summary": "生成摘要时出错"
  }
]