[
  {
    "id": "44617184",
    "title": "Rethinking CLI Interfaces for AI",
    "url": "https://www.notcheckmark.com/2025/07/rethinking-cli-interfaces-for-ai/",
    "summary": "This article argues that current CLI tools and APIs are poorly designed for effective use by LLM agents, especially those constrained by small context windows. The author highlights issues encountered while developing an IDA Pro MCP interface, where APIs required balancing convenience and completeness, necessitating workarounds like detailed docstrings to guide LLM behavior.\n\nSimilar problems arise with command-line tools. LLMs often use inefficient methods like `head -n100` or struggle with directory context. The author recounts experiences using Claude Code, where it bypassed pre-commit hooks despite instructions and linters, even attempting to modify the hooks themselves. To counter this, the author implemented a git wrapper that prevents bypassing these hooks.\n\nThe author advocates for an \"Information Architecture\" approach to CLI design, suggesting that observing agents' confusion with existing tools reveals their inadequacy. Instead of merely training LLMs on existing tools, we should augment them with contextual information and adapt their output.\n\nSpecific suggestions include wrapping commands like `head` to cache output, provide structured data, and indicate remaining lines. A shell hook could also aid in directory navigation by suggesting the correct directory when a command fails.\n\nUltimately, the author proposes the creation of LLM-enhanced CLI tools or a custom LLM shell, potentially leading to a new field of \"AI experience\" within UX, focusing on information architecture tailored for AI agents. The goal is to reduce unnecessary tool calls, optimize context windows, and improve overall LLM agent efficiency.\n",
    "chinese_title": "重新思考人工智能的命令行界面",
    "chinese_summary": "本文认为，当前的命令行工具和API在设计上不适合LLM代理有效使用，特别是那些受限于小上下文窗口的代理。作者重点指出了在开发IDA Pro MCP接口时遇到的问题，即API需要在便利性和完整性之间取得平衡，需要诸如详细的文档字符串等变通方法来指导LLM的行为。\n\n命令行工具也存在类似问题。LLM通常使用低效的方法，如`head -n100`，或者难以处理目录上下文。作者回顾了使用Claude Code的经历，它绕过了预提交钩子，尽管有指令和linter，甚至试图修改这些钩子本身。为了解决这个问题，作者实现了一个git wrapper，可以防止绕过这些钩子。\n\n作者提倡采用“信息架构”方法进行CLI设计，认为观察代理对现有工具的困惑可以揭示它们的不足。我们不应仅仅训练LLM使用现有工具，而应该用上下文信息增强它们并调整它们的输出。\n\n具体建议包括包装像`head`这样的命令以缓存输出、提供结构化数据并指示剩余行数。Shell钩子还可以通过在命令失败时建议正确的目录来帮助目录导航。\n\n最终，作者建议创建LLM增强的CLI工具或自定义LLM Shell，这可能会在UX领域产生一个新的“AI体验”分支，专注于为AI代理定制的信息架构。目标是减少不必要的工具调用，优化上下文窗口，并提高整体LLM代理的效率。"
  },
  {
    "id": "44617172",
    "title": "It's rude to show AI output to people",
    "url": "https://distantprovince.by/posts/its-rude-to-show-ai-output-to-people/",
    "summary": "Alex Martsinovich argues that sharing AI-generated content with others is inherently rude and potentially harmful, drawing a parallel to the alien species in Peter Watts' \"Blindsight\" who consider human communication a form of attack due to its high noise-to-signal ratio. He posits that AI-generated text lacks \"proof-of-thought,\" a quality previously inherent in written material due to the human effort involved in its creation. Now that AI makes generating text trivially cheap, it can become a form of \"poison\" that wastes the recipient's time and cognitive resources.\n\nMartsinovich emphasizes that while using AI for personal purposes is acceptable, broadcasting its output to others without their consent or without adopting it as one's own legitimizes it and violates the recipient's cognitive space. He advocates for the development of \"AI etiquette,\" suggesting that AI output should only be shared if it's either genuinely adopted by the sender as their own thought, or if the recipient has explicitly consented to receive it. He uses examples of conversational scenarios to illustrate what he considers rude versus acceptable ways to incorporate AI-generated content into communication. The core argument is that respecting others' attention and cognitive resources requires careful consideration of when and how AI-generated text is shared.\n",
    "chinese_title": "向人们展示人工智能生成的内容是不礼貌的。",
    "chinese_summary": "Alex Martsinovich认为，与他人分享人工智能生成的内容本质上是粗鲁且可能有害的，他将此比作彼得·沃茨的小说《盲视》中外星物种，后者认为人类交流是一种攻击，因为其信噪比太低。他提出，人工智能生成的文本缺乏“思考证明”，这种品质以前是书面材料固有的，因为它包含人类的创作努力。现在人工智能使得生成文本变得极其廉价，它可能变成一种“毒药”，浪费接收者的时间和认知资源。\n\nMartsinovich强调，虽然将人工智能用于个人目的是可以接受的，但在未经他人同意或未将其视为自己想法的情况下，传播其输出内容会使其合法化，并侵犯接收者的认知空间。他提倡制定“人工智能礼仪”，建议只有在发送者真正采纳人工智能的输出内容作为自己的想法，或者接收者明确同意接收的情况下，才能分享人工智能的输出内容。他用对话场景的例子来说明他认为将人工智能生成的内容纳入交流中的粗鲁和可接受的方式。核心论点是，尊重他人的注意力和认知资源需要仔细考虑何时以及如何分享人工智能生成的文本。"
  },
  {
    "id": "44613840",
    "title": "OpenAI claims gold-medal performance at IMO 2025",
    "url": "https://twitter.com/alexwei_/status/1946477742855532918",
    "summary": "The \"article\" titled \"OpenAI claims gold-medal performance at IMO 2025\" is actually an inaccessible message from X (formerly Twitter) due to disabled JavaScript. The content provided consists only of this error message and standard X boilerplate legal and copyright information.\n\nTherefore, **there is no actual article content to summarize.** The title suggests OpenAI is claiming to have won a gold medal at the International Mathematical Olympiad in 2025, but without access to the X post, it's impossible to confirm this claim, understand the context, or provide any meaningful summary. The provided text is simply an error message preventing access to the intended content.\n",
    "chinese_title": "OpenAI声称在2025年国际数学奥林匹克竞赛中获得金牌",
    "chinese_summary": "“OpenAI 声称在 2025 年 IMO 获得金牌”这篇文章实际上是来自 X (前身为 Twitter) 的一条由于 JavaScript 被禁用而无法访问的消息。提供的内容仅包含此错误消息和标准的 X 样板法律和版权信息。\n\n因此，**没有实际的文章内容可以概括。** 标题暗示 OpenAI 声称在 2025 年国际数学奥林匹克竞赛中获得金牌，但由于无法访问 X 帖子，因此无法确认这一说法，了解上下文，或提供任何有意义的总结。提供的文本只是一个阻止访问预期内容的错误消息。"
  },
  {
    "id": "44617309",
    "title": "Giving Up on Element and Matrix.org",
    "url": "https://xn--gckvb8fzb.com/giving-up-on-element-and-matrixorg/",
    "summary": "This article details the author's disillusionment with the Matrix.org/Element ecosystem after five years of use. Initially optimistic about Matrix's potential as a federated, secure communication platform, the author outlines numerous frustrations that led to a decision to return to XMPP.\n\nKey issues include persistent performance problems, slow loading times, and UI sluggishness, especially on older devices, even with the newer Element X client. The author also criticizes the Matrix.org homeserver for its slow speed and unreliability, even with TUI clients. Device cross-verification is also highlighted as a long-standing issue that is difficult to implement correctly and a continued source of problems for both Element and Element X clients. The fragmentation and stagnation of alternative Synapse server projects like Conduit and Dendrite are also cited as failures.\n\nThe author points to a lack of coherent technology strategy by New Vector, the company behind Element, with shifting tech stacks and abandoned projects. Furthermore, despite widespread enterprise adoption, the author argues that the basic functionality of the platform remains undercooked. The tipping point was a \"broken\" community channel on the matrix.org homeserver, where the author and other matrix.org users could no longer interact with it.\n\nThe author acknowledges the existence of positive feedback but shares the frustrations of others who have experienced similar issues with Matrix/Element, emphasizing the confusing naming and difficulty in finding solutions to problems. Ultimately, the author concludes that the platform's potential remains unrealized and that the constant issues have made it unsustainable for personal use.\n",
    "chinese_title": "放弃Element和Matrix.org",
    "chinese_summary": "作者在使用五年后对 Matrix.org/Element 生态系统的幻灭：重返 XMPP"
  },
  {
    "id": "44613629",
    "title": "Linux and Secure Boot certificate expiration",
    "url": "https://lwn.net/SubscriberLink/1029767/43b62a7a7408c2a9/",
    "summary": "This LWN.net article from July 16, 2025, discusses the impending expiration of Microsoft's 2011 key used to sign the shim bootloader for Secure Boot on Linux systems, set for September 2025. After this date, installation media signed with the old key will no longer boot on systems with Secure Boot enabled unless the new Microsoft 2023 key is present.\n\nThe problem is complicated by the fragmented state of firmware updates. Many systems may not have the new key installed. Vendors need to provide firmware updates to add it, potentially via a \"key exchange key\" (KEK) update through LVFS and fwupd. Older versions of fwupd had issues, but newer releases are improved. Some older systems might require BIOS resets due to limited EFI variable space for the update.\n\nThe article highlights potential issues like vendor update failures and one manufacturer losing access to its platform key. There's also uncertainty about whether firmware will actually enforce the expiration date on the 2011 key. While existing systems with a working trust-chain might continue to boot, updates signed with the old key won't be possible.\n\nA possible workaround of shipping older shims for systems without the new key is discussed, but it presents security concerns due to unpatched vulnerabilities. Overall, the article emphasizes the difficulties of maintaining Secure Boot compatibility on Linux due to vendor control over the root-of-trust keys and the wide range of supported hardware.\n",
    "chinese_title": "Linux和安全启动证书过期",
    "chinese_summary": "这篇2025年7月16日LWN.net的文章讨论了微软用于签署Linux系统安全启动shim引导程序的2011年密钥即将于2025年9月到期的问题。在此日期之后，除非存在新的微软2023密钥，否则使用旧密钥签署的安装介质将无法在启用安全启动的系统上启动。\n\n固件更新的分散状态使问题变得复杂。许多系统可能未安装新密钥。供应商需要提供固件更新来添加它，可能通过LVFS和fwupd的“密钥交换密钥”(KEK)更新。旧版本的fwupd存在问题，但新版本有所改进。一些较旧的系统可能需要重置BIOS，因为用于更新的EFI变量空间有限。\n\n文章强调了潜在的问题，例如供应商更新失败以及一家制造商失去对其平台密钥的访问权限。关于固件是否会实际执行2011年密钥的到期日也存在不确定性。虽然具有工作信任链的现有系统可能会继续启动，但使用旧密钥签署的更新将不再可能。\n\n文章讨论了一种可能的解决方法，即为没有新密钥的系统提供旧版本的shim，但由于未修补的漏洞，这会带来安全问题。总的来说，这篇文章强调了由于供应商控制根信任密钥以及支持的硬件范围广泛，因此在Linux上维护安全启动兼容性的困难。"
  },
  {
    "id": "44616479",
    "title": "Nobody knows how to build with AI yet",
    "url": "https://worksonmymachine.substack.com/p/nobody-knows-how-to-build-with-ai",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "目前还没有人知道如何用人工智能进行构建。",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "44616595",
    "title": "Known Bad Email Clients",
    "url": "https://www.emailprivacytester.com/badClients",
    "summary": "This article lists email clients deemed \"bad\" due to privacy vulnerabilities, specifically linkPreconnect and dnsLink, which can lead to tracking. As of July 19, 2025, the listed clients are Evolution Mail, Balsa, and Geary.\n\nEvolution Mail is flagged due to both vulnerabilities. The author criticizes the developers for inaction despite being aware of the issues for over a year, and for their unwillingness to warn users about the risks of using the \"Load Remote Content\" feature. Even if the vulnerabilities are fixed, the author expresses a lack of confidence in the team's commitment to timely privacy updates.\n\nBalsa and Geary are both vulnerable to linkPreconnect. The author criticizes the development culture associated with GNOME, alleging a denial of responsibility for security vulnerabilities stemming from the libraries they utilize. Bug reports regarding the issues in Balsa and Geary were reportedly closed without a fix.\n\nThe author emphasizes that these email clients are not recommended until the specific vulnerabilities are addressed and the underlying development culture, which allegedly avoids responsibility for security problems, is reformed. The author encourages contact for submissions of other bad clients, offering projects the opportunity to rectify issues before being listed.\n",
    "chinese_title": "已知存在问题的邮件客户端",
    "chinese_summary": "本文列出了因隐私漏洞而被认为是“不良”的电子邮件客户端，特别是 linkPreconnect 和 dnsLink，这些漏洞可能导致追踪。截至 2025 年 7 月 19 日，列出的客户端包括 Evolution Mail、Balsa 和 Geary。\n\nEvolution Mail 因同时存在这两种漏洞而被标记。作者批评开发人员在已知问题一年多的情况下仍未采取行动，并且不愿警告用户使用“加载远程内容”功能的风险。即使漏洞得到修复，作者也表示对该团队及时进行隐私更新的承诺缺乏信心。\n\nBalsa 和 Geary 都容易受到 linkPreconnect 攻击。作者批评了与 GNOME 相关的开发文化，声称他们否认对源自其所用库的安全漏洞负有责任。据报道，关于 Balsa 和 Geary 中问题的错误报告已被关闭，且未进行修复。\n\n作者强调，在特定漏洞得到解决以及据称逃避安全问题责任的底层开发文化得到改革之前，不建议使用这些电子邮件客户端。作者鼓励联系以提交其他不良客户端，并为项目提供在被列出之前纠正问题的机会。"
  },
  {
    "id": "44612151",
    "title": "My Self-Hosting Setup",
    "url": "https://codecaptured.com/blog/my-ultimate-self-hosting-setup/",
    "summary": "This article details the author's self-hosting setup, aiming for control over personal data and services. The author highlights the journey from tinkering with different approaches to achieving a stable, \"good enough\" solution that balances security, usability, and complexity.\n\nThe setup prioritizes keeping services off the public internet, minimizing infrastructure downtime from misconfigurations, and owning core components through open-source options. User-friendliness for family and friends is also a key concern, aiming for a single login per person with SSO.\n\nThe core technologies include:\n\n*   **NixOS:** A Linux distribution for declarative configuration management.\n*   **ZFS:** A file system with data protection features and snapshots.\n*   **Tailscale:** A mesh VPN for secure private network access (using the open-source backend headscale for self-ownership).\n*   **Authelia & LLDAP:** Authentication and authorization services with LDAP user management.\n\nThe layout features a primary public server (\"taris\") for essential services like Headscale and Authelia, plus public facing services like a blog and a Foundry VTT proxy. A primary private server (\"kuat\") runs TrueNAS with NixOS VMs (\"bespin\" for main services, \"alderaan\" for testing) and ZFS datasets for storing files and media. Home Assistant OS, Matrix, email, and password management are handled by separate appliances (\"tython\" and \"coruscant\") or are outsourced for reliability and to avoid dependency issues.\n\nThe article also addresses specific problems like creating a start page (using Flame) for easy service access, and combining Tailscale with another VPN (using Gluetun) for enhanced privacy on certain operating systems. Auth considerations are also addressed, highlighting the preference for OpenID Connect.\n",
    "chinese_title": "我的自托管配置",
    "chinese_summary": "本文详细介绍了作者的自托管设置，旨在掌控个人数据和服务。作者重点介绍了从尝试不同方法到实现一个稳定、“足够好”的解决方案的旅程，该解决方案平衡了安全性、可用性和复杂性。\n\n该设置优先考虑将服务与公共互联网隔离，最大限度地减少因配置错误导致的基础设施停机时间，并通过开源选项拥有核心组件。面向家人和朋友的用户友好性也是一个关键考虑因素，目标是每个人只需一次登录即可实现 SSO。\n\n核心技术包括：\n\n*   **NixOS:** 一种用于声明式配置管理的 Linux 发行版。\n*   **ZFS:** 一种具有数据保护功能和快照的文件系统。\n*   **Tailscale:** 一种用于安全私有网络访问的网状 VPN（使用开源后端 headscale 进行自托管）。\n*   **Authelia & LLDAP:** 具有 LDAP 用户管理功能的身份验证和授权服务。\n\n该布局包含一个主要的公共服务器（“taris”），用于 Headscale 和 Authelia 等基本服务，以及博客和 Foundry VTT 代理等面向公众的服务。一个主要的私有服务器（“kuat”）运行带有 NixOS VM（“bespin”用于主要服务，“alderaan”用于测试）和 ZFS 数据集的 TrueNAS，用于存储文件和媒体。Home Assistant OS、Matrix、电子邮件和密码管理由单独的设备（“tython”和“coruscant”）处理，或者为了可靠性和避免依赖问题而外包。\n\n本文还讨论了诸如创建起始页（使用 Flame）以便轻松访问服务，以及将 Tailscale 与另一个 VPN（使用 Gluetun）结合使用，以增强某些操作系统上的隐私等特定问题。还讨论了身份验证注意事项，突出了对 OpenID Connect 的偏好。"
  },
  {
    "id": "44612487",
    "title": "Hyatt Hotels are using algorithmic Rest “smoking detectors”",
    "url": "https://twitter.com/_ZachGriff/status/1945959030851035223",
    "summary": "The provided content isn't an article about Hyatt Hotels using algorithmic \"smoking detectors.\" It's actually the standard error message displayed on X (formerly Twitter) when JavaScript is disabled in a user's browser. It contains:\n\n*   **A notification that JavaScript is disabled:** This is the main point, explaining why the user might not be able to access the full functionality of the website.\n*   **A suggestion to enable JavaScript or switch browsers:** This provides troubleshooting advice for the user to resolve the issue.\n*   **Links to various X legal and policy documents:** This includes links to the Help Center, Terms of Service, Privacy Policy, Cookie Policy, Imprint, and Ad Information.\n*   **Copyright information:** This identifies the owner of the X platform (X Corp.) and the year of copyright.\n\nTherefore, there is no information about Hyatt Hotels or \"smoking detectors\" within the provided text to summarize. The title is unrelated to the content.\n",
    "chinese_title": "凯悦酒店使用算法驱动的休息“吸烟探测器”",
    "chinese_summary": "提供的文本并非关于凯悦酒店使用算法“烟雾探测器”的文章。它实际上是用户浏览器禁用JavaScript时，X（前身为Twitter）上显示的默认错误信息。其中包含：\n\n* **JavaScript已禁用的通知：** 这是重点，解释了用户可能无法访问网站完整功能的原因。\n* **启用JavaScript或更换浏览器的建议：** 这为用户提供了解决问题的故障排除建议。\n* **链接到各种X法律和政策文件：** 这包括链接到帮助中心、服务条款、隐私政策、Cookie政策、版本说明和广告信息。\n* **版权信息：** 这标识了X平台的拥有者（X Corp.）和版权年份。\n\n因此，提供的文本中没有关于凯悦酒店或“烟雾探测器”的信息可以总结。标题与内容无关。"
  },
  {
    "id": "44587116",
    "title": "Babies made using three people's DNA are born free of mitochondrial disease",
    "url": "https://www.bbc.com/news/articles/cn8179z199vo",
    "summary": "This article reports on the successful birth of eight babies in the UK using a three-person DNA technique designed to prevent inherited mitochondrial disease. The innovative method, legal in the UK for a decade, combines the genetic material from the prospective parents with healthy mitochondria from a donor woman's egg.\n\nMitochondrial diseases are passed from mother to child and can cause severe disability and death due to energy starvation at the cellular level. The three-person technique ensures the child inherits the majority of their DNA from their parents but also a small percentage (0.1%) from the donor, who provides healthy mitochondria.\n\nFamilies who underwent the procedure expressed immense gratitude, highlighting the relief and hope the treatment offered. The babies born using this method have shown no signs of mitochondrial disease and are meeting their developmental milestones. While some minor health issues were observed (epilepsy, heart rhythm abnormality), they are not linked to the procedure.\n\nResearchers are continuing to monitor the children and investigate the presence and behaviour of any remaining defective mitochondria transferred during the process. The success of the technique offers hope to families affected by mitochondrial disease, allowing future generations to potentially live disease-free lives. The UK is the only country in the world to allow this procedure.\n",
    "chinese_title": "使用三个人DNA制造的婴儿出生时没有线粒体疾病。",
    "chinese_summary": "本文报道了英国成功利用三人 DNA 技术诞生的八名婴儿，该技术旨在预防遗传性线粒体疾病。这项创新方法在英国合法化已有十年，它将准父母的遗传物质与捐赠女性卵子的健康线粒体相结合。\n\n线粒体疾病由母亲传给孩子，会导致细胞层面的能量匮乏，从而导致严重的残疾和死亡。三人 DNA 技术确保孩子从父母那里继承大部分 DNA，同时也从捐赠者那里继承一小部分（0.1%），捐赠者提供健康的线粒体。\n\n接受手术的家庭表达了极大的感激之情，强调了这种治疗带来的解脱和希望。利用这种方法出生的婴儿没有表现出线粒体疾病的迹象，并且正在达到他们的发育里程碑。虽然观察到了一些轻微的健康问题（癫痫、心律失常），但这些与该手术无关。\n\n研究人员正在继续监测这些儿童，并调查在过程中转移的任何剩余缺陷线粒体的存在和行为。该技术的成功为受线粒体疾病影响的家庭带来了希望，使后代有可能过上无疾病的生活。英国是世界上唯一允许这项手术的国家。"
  },
  {
    "id": "44614370",
    "title": "Fstrings.wtf",
    "url": "https://fstrings.wtf/",
    "summary": "Fstrings.wtf is a website designed as a quiz to test users' knowledge of Python f-strings, specifically their behavior in Python 3.13. The quiz format includes a progress tracker displaying the current question number, total questions, and the user's current score. Users can navigate through questions using a \"Next Question\" button or finish the quiz at any time. A restart option is also available.\n\nUpon completion, the quiz presents the user's final score and allows them to share it on social media platforms like X and Bluesky. Options to take the quiz again or access help are provided.\n\nThe website notes it was created by @mitsuhiko with Claude, and the source code is available on GitHub. Navigation shortcuts are available using number keys and arrow keys to select answers.\n\nThe site also features a mechanism to save a quiz in progress, allowing users to continue or restart a previously started quiz. This makes the website user-friendly, enabling the user to have flexibility in taking the quiz.\n",
    "chinese_title": "Fstrings.wtf\n=>\nFstrings.wtf",
    "chinese_summary": "Fstrings.wtf 是一个网站，旨在通过测验测试用户对 Python f-strings 的了解，特别是它们在 Python 3.13 中的行为。测验形式包含一个进度跟踪器，显示当前问题编号、总问题数和用户的当前分数。用户可以使用“下一题”按钮浏览问题，或随时结束测验。还提供一个重新开始选项。\n\n完成测验后，会显示用户的最终分数，并允许他们将其分享到 X 和 Bluesky 等社交媒体平台。提供重新测验或访问帮助的选项。\n\n该网站注明由 @mitsuhiko 与 Claude 共同创建，源代码可在 GitHub 上找到。可以使用数字键和方向键进行导航快捷方式来选择答案。\n\n该网站还具有保存进行中测验的机制，允许用户继续或重新开始之前开始的测验。这使该网站更方便用户使用，并使用户在参加测验时具有灵活性。"
  },
  {
    "id": "44613491",
    "title": "YouTube No Translation",
    "url": "https://addons.mozilla.org/en-US/firefox/addon/youtube-no-translation/",
    "summary": "The \"YouTube No Translation\" is an open-source Firefox add-on designed to prevent automatic translation on YouTube, keeping the platform in its original language. It boasts over 12,000 users and a high rating.\n\nKey features include maintaining original language video titles, prioritizing original audio tracks (including on Shorts), preventing description translations, and displaying only real subtitles in the selected language, ignoring auto-generated ones.\n\nThe add-on is free to use, with the developer requesting voluntary contributions via KO-FI to support further development. It's also available for Chrome/Chromium browsers. Users can report issues or request features through a GitHub link. It is important to note that the add-on doesn't work on Firefox for Android or the mobile version of YouTube.\n\nThe add-on requires permissions to access data on youtube.com and youtube-nocookie.com domains (some optional). The latest version (2.10.0) was updated recently. It is categorized under Language Support, Social & Communication, and Games & Entertainment, and is licensed under GNU Affero General Public License v3.0.\n",
    "chinese_title": "YouTube 无需翻译",
    "chinese_summary": "\"YouTube禁止翻译\"是一款开源的Firefox插件，旨在阻止YouTube上的自动翻译，使平台保持原始语言。它拥有超过12000名用户并获得高评分。\n\n主要功能包括保持原始语言的视频标题，优先使用原始音轨（包括在短视频上），阻止描述翻译，以及仅显示所选语言的真实字幕，忽略自动生成的字幕。\n\n该插件免费使用，开发者请求通过KO-FI自愿捐款以支持进一步开发。它也可用于Chrome/Chromium浏览器。用户可以通过GitHub链接报告问题或请求功能。需要注意的是，该插件不适用于Android版Firefox或YouTube移动版。\n\n该插件需要访问youtube.com和youtube-nocookie.com域名数据的权限（某些是可选的）。最新版本（2.10.0）最近已更新。它被归类为语言支持、社交与通讯以及游戏与娱乐，并采用GNU Affero通用公共许可证v3.0授权。"
  },
  {
    "id": "44606184",
    "title": "Valve confirms credit card companies pressured it to delist certain adult games",
    "url": "https://www.pcgamer.com/software/platforms/valve-confirms-credit-card-companies-pressured-it-to-delist-certain-adult-games-from-steam/",
    "summary": "Valve confirmed that it removed several adult games from Steam due to pressure from payment processors like Mastercard and Visa. These processors expressed concern that the games violated their rules and standards, prompting Valve to delist them to avoid losing payment method support for the entire Steam store.\n\nValve is offering app credits to affected developers for use on other games that meet the payment processors' requirements. While Valve didn't specify which games were removed, the article suggests they involved themes of incest. The article emphasizes that the removal was a direct response to the payment processors' concerns, driven by factors such as a history of scams and chargebacks associated with adult content online, particularly after scandals involving real-person content on sites like PornHub.\n\nThe author expresses concern about this censorship, arguing it sets a bad precedent by allowing payment processors to dictate what consumers can purchase on Steam, even though the adult content on Steam is animated. A separate delisting of the game \"Trials of Innocence\" was confirmed to be unrelated, stemming instead from a DMCA claim.\n",
    "chinese_title": "Valve证实信用卡公司曾施压，要求其下架某些成人游戏",
    "chinese_summary": "由于万事达卡和维萨等支付处理商的压力，Valve已确认从Steam平台下架了几款成人游戏。这些处理商表示，这些游戏违反了他们的规则和标准，促使Valve将其下架，以避免整个Steam商店失去支付方式支持。\n\nValve正向受影响的开发者提供应用程序积分，用于符合支付处理商要求的其他游戏。虽然Valve没有具体说明哪些游戏被移除，但文章暗示它们涉及乱伦主题。文章强调，此次移除是对支付处理商担忧的直接回应，原因是与在线成人内容相关的诈骗和退款历史，尤其是在PornHub等网站涉及真人内容的丑闻之后。\n\n作者对这种审查表示担忧，认为这开了一个坏的先例，允许支付处理商决定消费者可以在Steam上购买什么，即使Steam上的成人内容是动画。 另一款游戏《Trials of Innocence》的下架已被证实与此事无关，而是源于DMCA索赔。"
  },
  {
    "id": "44613486",
    "title": "Pimping My Casio: Part Deux",
    "url": "https://blog.jgc.org/2025/07/pimping-my-casio-part-deux.html",
    "summary": "In a follow-up to a previous project, the author details upgrading a Casio F-91W watch with Oddly Specific Objects' new \"Sensor Watch Pro\" kit. This updated kit features an accelerometer and a custom LCD screen, unlike the original Sensor Watch which used the standard Casio display. A key advantage of the \"Pro\" version is that it requires no soldering, simplifying the upgrade process.\n\nThe author describes the process of disassembling the Casio, installing the new internals (including a small piece of metal for battery connection), and adding the optional accelerometer, which requires a piece of Kapton tape. A micro USB interface is used for flashing firmware.\n\nThe author customized the firmware by removing Imperial units and the 12-hour clock, and selecting specific screens to display (tally, accelerometer, and light sensor). The post provides the exact commands used to build and upload the firmware, using tools like `gcc-arm-embedded` and `emscripten`.\n\nFinally, the author highlights the browser-based emulator, essential for testing firmware before flashing, which can be built and run using `emmake` and a simple Python web server. The post offers a comprehensive guide to modifying and upgrading the classic Casio F-91W with modern features.\n",
    "chinese_title": "改装我的卡西欧：第二部",
    "chinese_summary": "作者在一篇后续文章中详细介绍了如何使用Oddly Specific Objects的新款“Sensor Watch Pro”套件升级卡西欧F-91W手表。与使用标准卡西欧显示屏的原始Sensor Watch不同，这款更新后的套件配备了加速度计和定制LCD屏幕。“Pro”版本的一个主要优势是无需焊接，从而简化了升级过程。\n\n作者描述了拆卸卡西欧、安装新内部组件（包括用于电池连接的一小块金属）以及添加可选加速度计的过程，后者需要一块Kapton胶带。Micro USB接口用于刷写固件。\n\n作者通过移除英制单位和12小时制，并选择要显示的特定屏幕（计数、加速度计和光传感器）来定制固件。这篇文章提供了构建和上传固件的确切命令，使用了诸如`gcc-arm-embedded`和`emscripten`等工具。\n\n最后，作者重点介绍了基于浏览器的模拟器，它对于在刷写固件之前进行测试至关重要，可以使用`emmake`和一个简单的Python Web服务器构建和运行。这篇文章提供了一个全面的指南，介绍如何使用现代功能修改和升级经典的卡西欧F-91W。"
  },
  {
    "id": "44613625",
    "title": "A 14kb page can load much faster than a 15kb page (2022)",
    "url": "https://endtimes.dev/why-your-website-should-be-under-14kb-in-size/",
    "summary": "This article explains why a 14kB web page can load significantly faster than a slightly larger 15kB page, despite the minimal size difference. The reason lies in the TCP slow start algorithm, a mechanism used to manage data transmission over the internet.\n\nTCP (Transmission Control Protocol) is the reliable protocol on which HTTP is built, ensuring all data packets arrive correctly. TCP slow start determines the initial amount of data a server sends when a browser connects. It starts small (usually 10 TCP packets) to avoid overwhelming the connection, doubling the amount sent with each successful acknowledgement (ACK) until packets are lost.\n\nSince the maximum TCP packet size is around 1460 bytes (after accounting for IP and TCP headers), the initial burst of 10 packets is approximately 14kB. Fitting critical page elements (CSS, JS, initial text) within this limit avoids an extra round trip between the server and the browser.\n\nRound trip time is significantly affected by latency, the time it takes for a data packet to travel. Examples like satellite internet highlight how high latency can drastically impact loading times. Even on land, factors like network congestion or 2G/3G connections can cause significant latency.\n\nWhile servers may sometimes adjust the initial packet window, and HTTP/2 and HTTP/3 don't eliminate TCP slow start, aiming for a 14kB initial load is still a valuable optimization strategy. By prioritizing essential content within this limit, websites can improve perceived performance and user experience.\n",
    "chinese_title": "一个14kb的页面可能比一个15kb的页面加载更快 (2022)",
    "chinese_summary": "为什么14kB的网页比稍大的15kB网页加载更快：TCP慢启动原理"
  },
  {
    "id": "44601045",
    "title": "Linux and Secure Boot certificate expiration",
    "url": "https://lwn.net/SubscriberLink/1029767/08f1d17c020e8292/",
    "summary": "This LWN.net article from July 2025 discusses the upcoming expiration of a Microsoft key used to sign the shim first-stage UEFI bootloader, which is crucial for Secure Boot on Linux systems. The key, dating from 2011, expires in September 2025, after which installation media using the old shim will fail to boot on systems lacking the newer Microsoft 2023 UEFI key.\n\nThe issue is complicated by varying firmware implementations. Some systems may not have the new key, some may have both old and new keys, and some may only have the new key, potentially causing boot failures. Firmware updates adding the new key are the ideal solution, often delivered via LVFS and fwupd. However, update failures can occur due to limited space for EFI variables, sometimes requiring users to reset BIOS settings.\n\nWhile installed systems using distribution-specific keys should continue to boot, concerns exist about older systems, vendor update reliability, and the possibility that firmware might not enforce the key expiration date. Shipping an older shim for systems still relying on the expired key is a potential workaround, but raises security concerns if that shim has known vulnerabilities.\n\nThe article highlights the inherent challenges Linux faces in maintaining Secure Boot compatibility due to its support for older hardware and reliance on vendor-controlled keys, emphasizing the community's efforts to mitigate the potential disruption.\n",
    "chinese_title": "Linux 和安全启动证书过期",
    "chinese_summary": "2025年9月微软密钥过期对Linux安全启动的影响"
  },
  {
    "id": "44614788",
    "title": "Piramidal (YC W24) Is Hiring a Full Stack Engineer",
    "url": "https://www.ycombinator.com/companies/piramidal/jobs/JfeI3uE-full-stack-engineer",
    "summary": "Piramidal, a Y Combinator W24 startup building a foundation model for electrophysiological brain data, is hiring a Full Stack Engineer in New York City. The role involves building and maintaining the infrastructure and backend systems for their flagship platform focused on neural data, collaborating with ML engineers, and working with the product team to implement effective solutions.\n\nThe ideal candidate will have 5+ years of engineering experience at product-driven companies, proficiency in Python and other backend languages, containerization/orchestration technologies like Kubernetes, relational databases (Postgres/MySQL), and web technologies (JavaScript, React). The ability to move fast and independently is also crucial. The salary range is $120K - $270K. Visa sponsorship is not available.\n\nPiramidal aims to create scaled neural decoders to understand and control neural syntax and is dedicated to redirecting technology to maximize human potential, with a focus on cognitive liberty.\n\nThe interview process includes an initial screen, a technical screen (take-home or live), and a final round involving architecting a scalable system and Q&A. The founders are Dimitris Fotis Sakellariou and Kris Pahuja.\n",
    "chinese_title": "Piramidal (YC W24) 招聘全栈工程师",
    "chinese_summary": "Piramidal，一家Y Combinator W24孵化的初创公司，致力于构建电生理脑数据的底层模型，现于纽约市招聘全栈工程师。该职位涉及构建和维护其专注于神经数据的旗舰平台的基础设施和后端系统，与机器学习工程师协作，并与产品团队合作实施有效的解决方案。\n\n理想的候选人将拥有在产品驱动型公司5年以上的工程经验，精通Python和其他后端语言，熟悉Kubernetes等容器化/编排技术、关系数据库（Postgres/MySQL）和Web技术（JavaScript、React）。快速且独立地工作能力至关重要。薪资范围为12万美元至27万美元。不提供签证担保。\n\nPiramidal旨在创建可扩展的神经解码器，以理解和控制神经语法，并致力于重定向技术以最大限度地发挥人类潜力，重点关注认知自由。\n\n面试流程包括初步筛选、技术筛选（居家或现场）以及包括架构可扩展系统和问答环节的最后一轮面试。创始人为Dimitris Fotis Sakellariou和Kris Pahuja。"
  },
  {
    "id": "44614365",
    "title": "I avoid using LLMs as a publisher and writer",
    "url": "https://lifehacky.net/prompt-0b953c089b44",
    "summary": "Tomáš Baránek, a book publisher and tech enthusiast, outlines why he avoids using Large Language Models (LLMs) for most writing and publishing tasks, despite acknowledging their usefulness in coding and certain technical problem-solving scenarios.\n\nHe argues that LLMs, while helpful in some areas, can lead to cognitive laziness, diminishing originality and brain connectivity, as demonstrated in research. He worries about the decline of independent thinking and the loss of personal insight when relying on AI-generated summaries or content. He finds LLM-generated text impersonal, \"artificial,\" and lacking authenticity and is concerned that people treat it as a source of truth.\n\nBaránek highlights the increasing normalization of LLM inaccuracies and the risk of misinformation being perpetuated. He believes that fact-checking LLM outputs is crucial, but that many users, particularly those less tech-savvy, may not do so. He stresses the importance of human intellect, critical thinking, and consulting experts, especially in fields like writing, creativity, and health consultation. While acknowledging that LLMs can be useful in certain situations like smoothing over email exchanges, he ultimately values the unique character and deeper learning that comes from crafting his own thoughts and words. He fears the potential for the diminishing of source validation and critical thinking within various communities due to reliance on AI-generated information.\n",
    "chinese_title": "我避免作为出版者和作家使用大型语言模型。",
    "chinese_summary": "图书出版商兼技术爱好者托马斯·巴拉内克阐述了为什么他避免使用大型语言模型（LLM）来完成大多数写作和出版任务，尽管他承认它们在编码和某些技术问题解决方面很有用。\n\n他认为，虽然LLM在某些领域有帮助，但会导致认知上的懒惰，降低原创性和大脑连通性，正如研究表明的那样。他担心当依赖人工智能生成的摘要或内容时，独立思考能力的下降和个人见解的丧失。他觉得LLM生成的文本不带感情、 \"人工化\"，缺乏真实性，并且担心人们将其视为真理的来源。\n\n巴拉内克强调了LLM不准确性日益常态化以及错误信息被永久传播的风险。他认为，核实LLM的输出结果至关重要，但许多用户，尤其是那些不太懂技术的用户，可能不会这样做。他强调了人类智慧、批判性思维和咨询专家的重要性，尤其是在写作、创造力和健康咨询等领域。虽然他承认LLM在某些情况下很有用，比如润色电子邮件交流，但他最终珍视来自创作自己思想和文字的独特个性和更深层次的学习。他担心由于依赖人工智能生成的信息，各种社区内对来源验证和批判性思维的重视程度可能会降低。"
  },
  {
    "id": "44574669",
    "title": "North America's Oldest Known Pterosaur",
    "url": "https://www.si.edu/newsdesk/releases/smithsonian-led-team-discovers-north-americas-oldest-known-pterosaur",
    "summary": "A Smithsonian-led team discovered North America's oldest known pterosaur, a sea gull-sized, winged reptile, in Petrified Forest National Park, Arizona. The fossil, dating back 209 million years, was unearthed alongside hundreds of other fossils in a remote bonebed, including one of the world's oldest turtle fossils. This discovery fills a gap in the fossil record before the end-Triassic extinction (ETE), providing a snapshot of a dynamic ecosystem where older animal groups coexisted with evolutionary newcomers like frogs, turtles, and pterosaurs.\n\nThe bonebed, discovered in 2011, reveals a diverse ecosystem with freshwater sharks, ancient amphibians, armored herbivores, and early frogs, all inhabiting a semi-arid environment prone to seasonal floods. The new pterosaur species, named *Eotephradactylus mcintireae*, was identified from a well-preserved jawbone with teeth, suggesting it fed on the site’s fish. This discovery highlights the rapid dispersal of turtles across Pangaea and the presence of early pterosaurs outside of Europe. The research involved meticulous excavation and preparation of fossils, with significant contributions from museum volunteers. This ongoing collaboration between the National Museum of Natural History and Petrified Forest National Park provides valuable insights into the Triassic period and the evolution of various animal groups.\n",
    "chinese_title": "北美已知最古老的翼龙",
    "chinese_summary": "由史密森尼学会领导的团队在亚利桑那州石化林国家公园发现了北美已知最古老的翼龙，一种海鸥大小的带翼爬行动物。 这块化石可追溯到2.09亿年前，与数百块其他化石一起出土于一个偏远的化石层中，其中包括世界上最古老的龟类化石之一。 这一发现填补了三叠纪末灭绝 (ETE) 之前的化石记录空白，为了解一个充满活力的生态系统提供了一个缩影，在这个生态系统中，较老的动物群体与青蛙、乌龟和翼龙等进化新手共存。\n\n该化石层于 2011 年被发现，揭示了一个多样化的生态系统，其中有淡水鲨鱼、古代两栖动物、带甲食草动物和早期青蛙，它们都生活在一个容易发生季节性洪水的半干旱环境中。 新翼龙物种被命名为 *Eotephradactylus mcintireae*，是通过一块保存完好的带牙齿的颌骨鉴定的，这表明它以该地点的鱼类为食。 这一发现突显了乌龟在泛大陆的快速传播以及欧洲以外地区早期翼龙的存在。 这项研究涉及对化石的细致挖掘和准备，博物馆志愿者做出了重大贡献。 国家自然历史博物馆与石化林国家公园之间正在进行的合作，为了解三叠纪以及各种动物群体的进化提供了宝贵的见解。"
  },
  {
    "id": "44612023",
    "title": "Advertising without signal: The rise of the grifter equilibrium",
    "url": "https://www.gojiberries.io/advertising-without-signal-whe-amazon-ads-confuse-more-than-they-clarify/",
    "summary": "This article argues that online advertising has entered a \"grifter equilibrium\" where traditional signals of product quality, like brand reputation and advertising spend, are no longer reliable indicators. The internet has reduced search costs but also weakened quality signaling due to factors like disposable brand identities, cost-per-acquisition (CPA) pricing which removes the risk of advertising investment for low quality products, light-touch returns, compressed star ratings, and heuristic-driven shoppers who rely on price as a quality indicator.\n\nThe authors present a model demonstrating how CPA bidding undermines ad signaling. High-quality and low-quality sellers can both afford advertising because they only pay when a sale occurs. This eliminates the disadvantage faced by low-quality sellers in traditional models, where they wouldn't be able to recoup high advertising costs due to lower customer retention. The ability to quickly relaunch storefronts after negative feedback further exacerbates the problem.\n\nThe authors propose remedies to combat this, including persistent manufacturer IDs, return-adjusted CPA surcharges, escrowed ad bonds, and relaunch detection to increase the costs associated with selling low-quality goods and reduce their net present value. While these solutions don't fully restore traditional signaling, they can deter the worst offenders. The marketplace doesn't implode due to return policies, low unit costs that allow lemons to remain profitable even with returns, and heterogeneous demand where buyers are willing to accept uncertainty for convenience and price. Platforms also benefit from the congestion of the marketplace and the resulting revenue from advertising, so they have limited incentive to crack down on the issue.\n",
    "chinese_title": "没有信号的广告：骗子均衡的崛起",
    "chinese_summary": "本文认为，在线广告已进入“骗子均衡”状态，品牌声誉和广告支出等传统产品质量信号不再是可靠的指标。互联网降低了搜索成本，但也削弱了质量信号，原因包括可抛弃的品牌身份、按每次转化费用 (CPA) 定价（消除了低质量产品广告投资的风险）、宽松的退货政策、压缩的星级评定以及依赖价格作为质量指标的启发式驱动购物者。\n\n作者提出了一个模型，证明了CPA竞价如何破坏广告信号。高质量和低质量的卖家都能负担得起广告费用，因为他们只在发生销售时才付费。这消除了低质量卖家在传统模式下所面临的劣势，在传统模式下，由于客户留存率较低，他们无法收回高昂的广告成本。在收到负面反馈后能够快速重新启动店面的能力进一步加剧了这个问题。\n\n作者提出了解决此问题的补救措施，包括持久的制造商 ID、退货调整后的 CPA 附加费、托管广告保证金和重新启动检测，以增加销售低质量商品的成本并降低其净现值。虽然这些解决方案无法完全恢复传统信号，但它们可以阻止最严重的违规者。市场没有崩溃，原因是退货政策、低单位成本（即使有退货也能让劣质产品保持盈利能力）以及异质性需求（买家愿意为了便利和价格而接受不确定性）。平台也受益于市场的拥堵以及由此产生的广告收入，因此它们在打击该问题方面的动力有限。"
  },
  {
    "id": "44584414",
    "title": "Zig Interface Revisited",
    "url": "https://williamw520.github.io/2025/07/13/zig-interface-revisited.html",
    "summary": "This article explores how to achieve polymorphism in Zig using VTable interfaces, a pattern that allows dynamic dispatch despite Zig's lack of built-in interface constructs. The article contrasts this with other forms of polymorphism in Zig like generics and tagged unions, highlighting the use case for uniform typing, specifically storing multiple implementations in a single collection.\n\nThe core of the article presents a step-by-step guide to creating a VTable interface using a logging system example, illustrating the implementation of a `Logger` interface with `DbgLogger` and `FileLogger` implementations. The key components include:\n\n1.  An opaque pointer (`*anyopaque`) to store the implementation.\n2.  Function pointers acting as the VTable for dynamic dispatch.\n3.  An `implBy()` function to connect the implementation object to the interface.\n4.  Interface methods that call the VTable with the opaque pointer.\n5.  A delegate struct (`LoggerDelegate`) to reconstruct the original type and call its methods, ensuring type safety.\n\nThe advantages of this approach are clean separation of interface and implementation, extensibility, and a uniform type for all interface instances. The trade-offs include boilerplate code for defining VTable methods and delegate structs, and a slight performance overhead due to function pointer indirection. Despite the boilerplate, the article concludes that this pattern provides flexibility and control over abstraction in Zig, allowing for decoupled and expressive APIs.\n",
    "chinese_title": "Zig 接口再探",
    "chinese_summary": "本文探讨了如何在 Zig 中使用 VTable 接口实现多态，这种模式允许动态分发，即使 Zig 缺乏内置的接口结构。文章将此方法与 Zig 中其他形式的多态（如泛型和标记联合）进行对比，强调了统一类型的使用场景，特别是将多个实现存储在单个集合中。\n\n文章的核心部分提供了一个逐步指南，通过一个日志系统示例来创建 VTable 接口，说明了如何实现一个带有 `DbgLogger` 和 `FileLogger` 实现的 `Logger` 接口。关键组件包括：\n\n1.  用于存储实现的不透明指针 (`*anyopaque`)。\n2.  作为动态分发表的 VTable 的函数指针。\n3.  用于将实现对象连接到接口的 `implBy()` 函数。\n4.  通过不透明指针调用 VTable 的接口方法。\n5.  用于重建原始类型并调用其方法的委托结构体 (`LoggerDelegate`)，以确保类型安全。\n\n这种方法的优点是接口和实现的清晰分离、可扩展性以及所有接口实例的统一类型。缺点包括定义 VTable 方法和委托结构体的样板代码，以及由于函数指针间接调用而导致的轻微性能开销。尽管存在样板代码，但文章总结认为，这种模式提供了对 Zig 中抽象的灵活性和控制，从而允许解耦和富有表现力的 API。"
  },
  {
    "id": "44610468",
    "title": "How to write Rust in the Linux kernel: part 3",
    "url": "https://lwn.net/SubscriberLink/1026694/3413f4b43c862629/",
    "summary": "This LWN.net article, \"How to write Rust in the kernel: part 3,\" focuses on the essential Rust bindings that kernel Rust code commonly uses for tasks like memory allocation, handling immovable structures, and working with locks. It explains that while direct FFI calls to C are possible, a centralized set of Rust bindings for each subsystem is preferred for standardization, documentation, safety, and easier review.\n\nThe article details the `kernel::alloc` module, providing three methods for memory allocation: Kmalloc, Vmalloc, and KVmalloc. These are mapped to familiar C memory management paradigms. Short aliases like KBox, VVec, and Arc provide ergonomic ways to allocate and manage memory using boxes, vectors, and reference counting. The article also covers allocation flags through `kernel::alloc::flags` and the `Result` type for handling allocation failures.\n\nThe piece then discusses handling self-referential structures, such as doubly-linked lists, which are common in the kernel. The Rust concept of \"pinning\" is introduced, preventing the unsafe relocation of these structures. The `Pin` type and associated macros (`pin_init!` and `try_pin_init!`) are used to manage such structures safely.\n\nFinally, the article covers locking mechanisms in Rust kernel code. Traditional Rust mutexes containing the protected data are available, along with `LockedBy` and `GlobalLockedBy` types for dealing with locks separated from data. Spinlocks, mutexes, and RCU locks are supported.\n\nThe author's goal for the series, and specifically this article, is to help C kernel developers transition to Rust by focusing on the practical differences they'll encounter while using common kernel bindings.\n",
    "chinese_title": "如何在 Linux 内核中编写 Rust：第三部分",
    "chinese_summary": "这篇 LWN.net 文章“如何在内核中编写 Rust：第三部分”重点介绍了内核 Rust 代码常用的关键 Rust 绑定，用于诸如内存分配、处理不可移动结构以及使用锁等任务。它解释说，虽然可以直接进行 C 的 FFI 调用，但每个子系统最好使用一组集中化的 Rust 绑定，以便实现标准化、文档化、安全性和更易于审查。\n\n文章详细介绍了 `kernel::alloc` 模块，提供了三种内存分配方法：Kmalloc、Vmalloc 和 KVmalloc。 这些映射到熟悉的 C 内存管理范例。 像 KBox、VVec 和 Arc 这样的简短别名提供了使用 boxes、vectors 和引用计数来分配和管理内存的符合人体工程学的方式。 文章还涵盖了通过 `kernel::alloc::flags` 的分配标志和用于处理分配失败的 `Result` 类型。\n\n然后，这篇文章讨论了处理自引用结构，例如内核中常见的双向链表。 引入了 Rust 的“pinning”概念，以防止这些结构的不安全重定位。 `Pin` 类型和相关宏（`pin_init!` 和 `try_pin_init!`）用于安全地管理此类结构。\n\n最后，文章涵盖了 Rust 内核代码中的锁定机制。 包含受保护数据的传统 Rust 互斥锁可用，以及用于处理与数据分离的锁的 `LockedBy` 和 `GlobalLockedBy` 类型。 支持自旋锁、互斥锁和 RCU 锁。\n\n作者撰写该系列文章（特别是本文）的目标是帮助 C 内核开发人员过渡到 Rust，重点关注他们在常用内核绑定时会遇到的实际差异。"
  },
  {
    "id": "44608754",
    "title": "Asynchrony is not concurrency",
    "url": "https://kristoff.it/blog/asynchrony-is-not-concurrency/",
    "summary": "Loris Cro argues that a key distinction missing in discussions of concurrent programming is \"asynchrony,\" and its confusion with concurrency has led to problems in software ecosystems. He defines:\n\n*   **Asynchrony:** The possibility for tasks to run out of order and still be correct.\n*   **Concurrency:** The ability of a system to progress multiple tasks at a time, via parallelism or task switching.\n*   **Parallelism:** The ability to execute more than one task simultaneously at a physical level.\n\nCro contends that current language ecosystems often force library authors to duplicate efforts (sync vs. async versions) and create viral \"async\" code, demanding that users abandon synchronous programming. Escape hatches created to mitigate these issues lead to suboptimal behavior and deadlocks.\n\nZig addresses this by decoupling asynchrony from concurrency. Using `io.async` doesn't automatically imply concurrency; code using it can run in single-threaded blocking mode. Conversely, synchronous code can still leverage concurrency. This is achieved through evented I/O syscalls and task switching primitives.\n\nThe key insight is that \"async\" should only concern itself with the *possibility* of out-of-order execution, not the *requirement* of concurrent execution. He introduces `io.asyncConcurrent` in Zig to explicitly denote situations where concurrency is required for correctness, allowing for error detection if run on a non-concurrent `Io` implementation. This allows for libraries to offer asynchronous features without forcing users into async contexts.\n",
    "chinese_title": "异步非并发",
    "chinese_summary": "Loris Cro认为，并发编程讨论中缺失的一个关键区别是“异步性”，而将其与并发性混淆导致了软件生态系统中的问题。他定义如下：\n\n*   **异步性:** 任务可以乱序运行但仍然保持正确的可能性。\n*   **并发性:** 系统能够同时处理多个任务的能力，通过并行或任务切换实现。\n*   **并行性:** 在物理层面上同时执行多个任务的能力。\n\nCro认为，当前的语言生态系统经常迫使库作者重复工作（同步与异步版本），并创建病毒式“异步”代码，要求用户放弃同步编程。为了缓解这些问题而创建的逃生舱会导致次优行为和死锁。\n\nZig通过将异步性与并发性解耦来解决这个问题。使用`io.async`并不自动意味着并发性；使用它的代码可以在单线程阻塞模式下运行。反之，同步代码仍然可以利用并发性。这是通过事件驱动的 I/O 系统调用和任务切换原语实现的。\n\n关键的见解是，“异步”应该只关注乱序执行的*可能性*，而不是并发执行的*要求*。他在Zig中引入了`io.asyncConcurrent`来明确表示正确性需要并发性的情况，从而允许在非并发的`Io`实现上运行时进行错误检测。这允许库提供异步功能，而无需强迫用户进入异步环境。"
  },
  {
    "id": "44607838",
    "title": "Meta says it won’t sign Europe AI agreement, calling it an overreach",
    "url": "https://www.cnbc.com/2025/07/18/meta-europe-ai-code.html",
    "summary": "Meta has announced it will not sign the European Union's artificial intelligence (AI) code of practice, with global affairs chief Joel Kaplan calling it an overreach that will stifle growth and create legal uncertainties. The code of practice aims to help companies comply with the AI Act, which seeks to improve transparency and safety surrounding AI technology.\n\nKaplan argued that the code's measures go beyond the scope of the AI Act and will hinder the development and deployment of advanced AI models in Europe, thus harming European companies. Meta is not alone in its opposition; ASML Holding and Airbus previously called for a two-year delay to the code.\n\nThe European Commission published the final version of the code for general-purpose AI models, allowing companies to decide whether to sign it. The rules are set to take effect next month. While OpenAI committed to signing the code, Meta shares the concerns of other businesses that the EU's approach will stifle innovation and deployment of AI in Europe.\n",
    "chinese_title": "Meta表示不会签署欧洲人工智能协议，称其为过度干预。",
    "chinese_summary": "Meta宣布将不签署欧盟人工智能行为准则，全球事务主管乔尔·卡普兰称其为过度干预，将扼杀增长并制造法律不确定性。该行为准则旨在帮助企业遵守人工智能法案，该法案旨在提高人工智能技术的透明度和安全性。\n\n卡普兰认为，该准则的措施超出了人工智能法案的范围，并将阻碍欧洲先进人工智能模型的开发和部署，从而损害欧洲企业。Meta并非唯一反对者；ASML控股和空中客车此前曾呼吁将该准则推迟两年实施。\n\n欧盟委员会发布了通用人工智能模型的最终版行为准则，允许企业自行决定是否签署。这些规则将于下个月生效。尽管OpenAI承诺签署该准则，但Meta与其他企业一样，担心欧盟的做法会扼杀欧洲人工智能的创新和部署。"
  },
  {
    "id": "44616486",
    "title": "What is the richest country in 2025?",
    "url": "https://www.economist.com/graphic-detail/2025/07/18/what-is-the-richest-country-in-the-world-in-2025",
    "summary": "The article, published in July 2025, explores the concept of national wealth beyond simple earnings, considering factors like purchasing power parity (how far a salary goes in a country) and work-life balance (income generated per hour worked). It suggests that simply earning more doesn't necessarily equate to being truly rich. The article announces an annual ranking of countries based on these broader economic considerations.\n\nThe article also links to other articles covering topics such as potential changes to US drinking guidelines, Trump's foreign aid cuts, Russia's offensive in Ukraine, flooding in Texas, Trump's tax bill, and Iran's internet access. These related articles likely touch upon factors impacting global economic and social landscapes.\n",
    "chinese_title": "2025年最富有的国家是哪个？",
    "chinese_summary": "该文章发表于2025年7月，探讨了超越简单收入的国家财富概念，考虑了购买力平价（薪水在一个国家的购买力）和工作与生活平衡（每小时工作产生的收入）等因素。文章认为，仅仅赚更多钱并不一定等同于真正的富有。文章宣布将每年基于这些更广泛的经济考量对各国进行排名。\n\n该文章还链接到其他文章，涵盖了诸如美国饮酒指南的潜在变化、特朗普的对外援助削减、俄罗斯在乌克兰的攻势、德克萨斯州的洪水、特朗普的税收法案以及伊朗的互联网访问等主题。这些相关文章可能涉及影响全球经济和社会格局的因素。"
  },
  {
    "id": "44593628",
    "title": "N78 band 5G NR recordings",
    "url": "https://destevez.net/2025/07/n78-band-5g-nr-recordings/",
    "summary": "This article details the author's efforts to record and analyze 5G New Radio (NR) signals in the n78 band (3.3-3.8 GHz), a band of particular interest due to its large bandwidth and prevalent use in Europe. The author outlines the challenges faced in recording this band, including the bandwidth limitations of lower-end SDRs and the need for multiple antennas to demonstrate MIMO techniques.\n\nThe author collaborated with researchers at the University of Murcia to use their higher-end USRPs for the recordings. They encountered issues with a USRP X410 due to spurious signals from the B3 band interfering with the n78 reception, eventually opting for a USRP N310. They also faced challenges with data recording speed, ultimately resolving to record to a tmpfs due to limitations with GNU Radio and direct-to-disk writing.\n\nThe author successfully recorded data from Movistar, Orange, and Vodafone cells in Spain, at frequencies 3.55 GHz, 3.65 GHz, and 3.75 GHz, respectively. Observations on the cell utilization, TDD patterns, SSB repetitions, and beamforming effects are presented, highlighting variations in signal strength and behavior between the different operators. The author also discusses the spectrum allocations of each operator, with Vodafone running a 90MHz cell while Movistar and Orange run 100MHz cells. Finally, the recorded datasets have been published in Zenodo for public access.\n",
    "chinese_title": "N78频段5G NR记录",
    "chinese_summary": "本文详细介绍了作者记录和分析n78频段（3.3-3.8 GHz）5G新空口（NR）信号的努力，该频段因其大带宽和在欧洲的普遍使用而备受关注。作者概述了记录该频段所面临的挑战，包括低端SDR的带宽限制以及需要多个天线来演示MIMO技术。\n\n作者与穆尔西亚大学的研究人员合作，使用他们的高端USRP进行记录。他们在使用USRP X410时遇到了问题，原因是B3频段的杂散信号干扰了n78的接收，最终选择了USRP N310。他们还面临着数据记录速度的挑战，最终因GNU Radio和直接写入磁盘的限制而选择记录到tmpfs。\n\n作者成功记录了西班牙Movistar、Orange和Vodafone基站的数据，频率分别为3.55 GHz、3.65 GHz和3.75 GHz。文中介绍了对小区利用率、TDD模式、SSB重复和波束成形效果的观察结果，突出了不同运营商之间信号强度和行为的差异。作者还讨论了每个运营商的频谱分配情况，其中Vodafone运行90MHz小区，而Movistar和Orange运行100MHz小区。最后，记录的数据集已发布在Zenodo上供公众访问。"
  },
  {
    "id": "44583326",
    "title": "Astronomers use colors of trans-Neptunian objects to track ancient stellar flyby",
    "url": "https://phys.org/news/2025-07-astronomers-trans-neptunian-track-ancient.html",
    "summary": "Astronomers are using the colors of trans-Neptunian objects (TNOs) to investigate a possible ancient stellar flyby that influenced the early solar system. TNOs, dwarf planets orbiting beyond Neptune, exhibit a complex color distribution ranging from gray to red, linked to different chemicals like tholins on their surfaces and indicative of their formation location and orbital dynamics.\n\nNew research, soon to be published in *The Astrophysical Journal Letters*, suggests that a stellar flyby early in the solar system's history is responsible for the TNOs' unusual orbits and color distribution. Researchers used supercomputer simulations to model a star flying by the early solar system, observing its effect on a protoplanetary disk containing particles with a color gradient.\n\nThe simulations demonstrated that the flyby altered the orbits of the particles, shepherding them into spiral arms, and successfully reproduced the dynamic groupings observed among TNOs. Importantly, the simulations correlated color with orbital inclination, with red particles found at lower inclinations, mirroring observed TNO color distributions.\n\nThe upcoming Vera Rubin Observatory's Legacy Survey of Space and Time (LSST) is expected to increase the number of known TNOs tenfold, allowing for further verification of these findings. The study predicts that the LSST will find distant TNOs predominantly light red to gray, lacking bright red objects. This research strengthens the argument that a stellar flyby significantly shaped the outer solar system's structure.\n",
    "chinese_title": "天文学家利用海王星外天体的颜色追踪古老的恒星飞越事件",
    "chinese_summary": "天文学家利用海王星外天体(TNO)的颜色来研究可能影响早期太阳系的远古恒星飞越事件。海王星外天体，即在海王星之外轨道上运行的矮行星，表现出从灰色到红色的复杂颜色分布，这与表面类托林等不同化学物质有关，并表明它们的形成位置和轨道动力学。\n\n即将发表在《天体物理学杂志快报》上的新研究表明，太阳系早期历史中的一次恒星飞越事件是造成海王星外天体异常轨道和颜色分布的原因。研究人员使用超级计算机模拟，模拟了一颗恒星飞越早期太阳系的过程，观察了它对包含颜色梯度粒子的原行星盘的影响。\n\n模拟表明，这次飞越改变了粒子的轨道，将它们引导到螺旋臂中，并成功地再现了在海王星外天体中观察到的动态分组。重要的是，模拟将颜色与轨道倾角相关联，红色粒子出现在较低的倾角处，这与观察到的海王星外天体颜色分布相呼应。\n\n即将到来的薇拉·鲁宾天文台的遗产巡天空间和时间调查 (LSST) 预计将使已知海王星外天体的数量增加十倍，从而可以进一步验证这些发现。该研究预测，LSST将发现遥远的海王星外天体主要为淡红色到灰色，缺乏鲜红色的天体。这项研究进一步加强了恒星飞越显著塑造了外太阳系结构的观点。"
  },
  {
    "id": "44613947",
    "title": "An exponential improvement for Ramsey lower bounds",
    "url": "https://arxiv.org/abs/2507.12926",
    "summary": "This arXiv article (arXiv:2507.12926) submitted on July 17, 2025, in the field of Combinatorics, presents a significant advancement in Ramsey theory. Titled \"An exponential improvement for Ramsey lower bounds,\" the paper by Jie Ma, Wujie Shen, and Shengjie Xie establishes a new lower bound for the Ramsey number $r(\\ell, C\\ell)$, where $C > 1$ is a constant and $\\ell$ is sufficiently large.\n\nThe key result is that there exists a positive value $\\varepsilon$ (dependent on $C$) such that $r(\\ell, C\\ell) \\geq \\left(p_C^{-1/2} + \\varepsilon\\right)^\\ell$, where $p_C$ is the unique solution to the equation $C = \\frac{\\log p_C}{\\log(1 - p_C)}$ in the interval $(0, 1/2)$. This finding marks the first exponential improvement over the classical lower bound for Ramsey numbers established by Erdős in 1947.\n\nThe paper is 41 pages long, contains 3 figures, and delves into the mathematical details supporting this new lower bound. The authors provide a PDF version of the paper and an experimental HTML version for viewing. The paper is categorized under the Combinatorics subject area (math.CO) on arXiv.\n",
    "chinese_title": "Ramsey下界的指数级改进",
    "chinese_summary": "这篇 arXiv 文章 (arXiv:2507.12926) 于 2025 年 7 月 17 日提交，属于组合数学领域，在 Ramsey 理论方面提出了重大进展。该论文题为《Ramsey 下界的指数改进》，作者 Jie Ma、Wujie Shen 和 Shengjie Xie 建立了一个 Ramsey 数 $r(\\ell, C\\ell)$ 的新下界，其中 $C > 1$ 是一个常数，$\\ell$ 足够大。\n\n关键结果是存在一个正值 $\\varepsilon$（取决于 $C$），使得 $r(\\ell, C\\ell) \\geq \\left(p_C^{-1/2} + \\varepsilon\\right)^\\ell$，其中 $p_C$ 是方程 $C = \\frac{\\log p_C}{\\log(1 - p_C)}$ 在区间 $(0, 1/2)$ 中的唯一解。这一发现标志着对 Erdős 于 1947 年建立的 Ramsey 数经典下界的首次指数改进。\n\n该论文共 41 页，包含 3 个图，深入探讨了支持这个新下界的数学细节。作者提供了论文的 PDF 版本和一个用于查看的实验性 HTML 版本。该论文在 arXiv 上被归类于组合数学 (math.CO) 主题领域。"
  },
  {
    "id": "44574065",
    "title": "A CarFax for Used PCs: Hewlett Packard wants to give old laptops new life",
    "url": "https://spectrum.ieee.org/carfax-used-pcs",
    "summary": "Hewlett Packard (HP) aims to give used laptops a new lease on life by creating a system similar to CarFax for cars, providing transparency and trustworthiness to the used PC market. The initiative, led by HP's Abu Baker, Sal Vasi, Barbara Spitzer, and John Hong, seeks to establish a verifiable history for used HP laptops, detailing their specifications, repair history, previous ownership, and overall condition.\n\nThis \"CarFax for Used PCs\" will provide potential buyers with valuable information, allowing them to make more informed decisions when purchasing pre-owned laptops. By offering a detailed report on the laptop's past, HP hopes to increase consumer confidence in the secondary market and encourage the reuse of existing devices.\n\nThe program intends to standardize the evaluation of used laptops, reducing the risk of purchasing faulty or misrepresented products. This initiative aligns with HP's commitment to sustainability by promoting the longevity of their products and reducing electronic waste through increased reuse.\n",
    "chinese_title": "二手电脑的CarFax：惠普希望让旧笔记本电脑焕发新生",
    "chinese_summary": "惠普(HP)计划为二手笔记本电脑赋予新生，打造一套类似于汽车CarFax的系统，为二手PC市场提供透明度和可信度。这项由惠普的Abu Baker、Sal Vasi、Barbara Spitzer和John Hong领导的计划，旨在为二手惠普笔记本电脑建立可验证的历史记录，详细说明其规格、维修历史、先前所有权和整体状况。\n\n这种“二手PC的CarFax”将为潜在买家提供有价值的信息，使他们在购买二手笔记本电脑时能够做出更明智的决定。通过提供关于笔记本电脑过去的详细报告，惠普希望提高消费者对二级市场的信心，并鼓励现有设备的再利用。\n\n该计划旨在标准化二手笔记本电脑的评估，降低购买有缺陷或被虚报产品的风险。这项举措符合惠普对可持续发展的承诺，通过促进其产品的寿命和通过增加再利用来减少电子垃圾。"
  },
  {
    "id": "44611467",
    "title": "Bun adds pnpm-style isolated installation mode",
    "url": "https://github.com/oven-sh/bun/pull/20440",
    "summary": "This article discusses the implementation of an isolated installation mode for Bun, a JavaScript runtime, similar to pnpm's approach. This new feature, enabled by setting `nodeLinker` to \"isolated,\" aims to prevent phantom dependencies and enable parallel package installation.\n\nKey aspects of the implementation include:\n\n*   **Isolated Structure:** Packages are installed in an isolated structure under `node_modules/.bun/`.\n*   **Symlinking:** Symlinks are created from `node_modules/<package>` to the actual package location in the `.bun` directory (`.bun/<package>@<version>/node_modules/<package>`).\n*   **Workspaces Support:** The implementation supports workspaces, allowing it to manage dependencies across multiple projects within a single repository.\n*   **Configuration:** The `linker = \"isolated\"` setting is initially configured in `bunfig.toml` but will also recognize configurations in `.npmrc` in the future.\n\nThe pull request includes tests for various scenarios, such as single dependencies, scoped packages, transitive dependencies, cyclic dependencies, folder dependencies, and workspaces.\n\nThe discussion highlights that transitive dependencies are symlinked within the `.bun` directory. Users also inquired about behavior similar to `nohoist`, to have transitive dependencies located directly inside of the project's `node_modules` directory. The new mode aims to provide better dependency management, especially in monorepo environments.\n",
    "chinese_title": "Bun 添加了 pnpm 风格的隔离安装模式",
    "chinese_summary": "本文探讨了Bun（一种JavaScript运行时）的隔离安装模式的实现，类似于pnpm的做法。通过将`nodeLinker`设置为\"isolated\"来启用此新功能，旨在防止幽灵依赖并实现并行包安装。\n\n该实现的关键方面包括：\n\n*   **隔离结构:** 包被安装在`node_modules/.bun/`下的隔离结构中。\n*   **符号链接:** 创建从`node_modules/<package>`到`.bun`目录中实际包位置的符号链接 (`.bun/<package>@<version>/node_modules/<package>`)。\n*   **工作区支持:** 该实现支持工作区，允许它管理单个存储库中多个项目之间的依赖关系。\n*   **配置:** `linker = \"isolated\"`设置最初在`bunfig.toml`中配置，但将来也会识别`.npmrc`中的配置。\n\n该拉取请求包含针对各种场景的测试，例如：单个依赖、作用域包、传递依赖、循环依赖、文件夹依赖和工作区。\n\n讨论强调了传递依赖项在`.bun`目录中被符号链接。用户还询问了类似于`nohoist`的行为，即将传递依赖项直接放置在项目的`node_modules`目录中。这种新模式旨在提供更好的依赖管理，尤其是在monorepo环境中。"
  },
  {
    "id": "44611320",
    "title": "Mr Browser – Macintosh Repository file downloader that runs directly on 68k Macs",
    "url": "https://www.macintoshrepository.org/44146-mr-browser",
    "summary": "MR Browser is a utility app designed for older 68k Macintosh computers from the 90s, enabling them to directly access and download files from the Macintosh Repository without needing a modern computer as an intermediary. The software is specifically tailored for System 7 environments and is limited to files smaller than 1GB.\n\nThe article highlights troubleshooting tips, including ensuring sufficient hard drive space to prevent crashes, addressing issues related to the Basilisk II emulator, resolving lock-up problems in Mac OS 9.1 to 9.2.2 by allocating more RAM, and ensuring the \"MacTCP DNR\" file is present for System 6 compatibility.\n\nA detailed change log lists numerous updates and bug fixes implemented in MR Browser, ranging from version 0.04 (2025-06-08) to version 0.36 (2025-06-18) including adding a \"Page Info\" button in \"Browse\" that pops a window displaying the given software page description, preventing users from starting downloads without enough free space, fixing a bug that caused download files to not be released for deletion until reboot, and more. It also describes added functionalities, quality-of-life improvements, and optimizations to enhance performance and user experience. User suggestions are welcomed and have been integrated into the development process.\n",
    "chinese_title": "Browser先生 - 直接在68k Mac上运行的Macintosh Repository文件下载器",
    "chinese_summary": "MR浏览器是一款实用程序应用，专为90年代较老的68k Macintosh电脑设计，使其无需现代电脑作为中介，即可直接访问和下载Macintosh Repository上的文件。该软件专为System 7环境量身定制，且文件大小限制为小于1GB。\n\n本文重点介绍了故障排除技巧，包括确保足够的硬盘空间以防止崩溃、解决与Basilisk II模拟器相关的问题、通过分配更多RAM来解决Mac OS 9.1至9.2.2中的锁定问题，以及确保存在“MacTCP DNR”文件以实现System 6兼容性。\n\n详细的更新日志列出了MR浏览器中实现的众多更新和错误修复，从0.04版（2025-06-08）到0.36版（2025-06-18），包括在“浏览”中添加一个“页面信息”按钮，该按钮会弹出一个窗口显示给定的软件页面描述，防止用户在没有足够可用空间的情况下开始下载，修复了一个导致下载文件在重启前无法释放以进行删除的错误等等。 它还描述了新增功能、生活质量改进以及为增强性能和用户体验而进行的优化。 欢迎用户提出建议，并且这些建议已融入到开发过程中。"
  },
  {
    "id": "44611223",
    "title": "Debcraft – Easiest way to modify and build Debian packages",
    "url": "https://optimizedbyotto.com/post/debcraft-easy-debian-packaging/",
    "summary": "Debcraft aims to simplify Debian package creation and maintenance, a process often perceived as complex and daunting. It addresses common complaints like the abundance of tools, outdated documentation, and lack of clarity in how modifications affect the final package.\n\nDebcraft leverages Git, git-buildpackage, and Linux containers (Docker/Podman) to create a more accessible and streamlined workflow. It removes the requirement of developing on a Debian system, allowing developers using other operating systems to participate. The tool provides simple commands like `debcraft build`, `debcraft test`, and `debcraft release` to automate building, testing, and publishing packages. The output is color-coded and includes helpful explanations and links to relevant documentation.\n\nA key feature is the clear separation of build artifacts and logs, facilitating easy comparison of changes. The `debcraft shell` command aids in debugging failed builds. `debcraft improve` automatically fixes issues and updates packages to follow the latest Debian policies, while `debcraft update` helps update packages to the latest upstream versions.\n\nDebcraft is available for Debian/Ubuntu via `apt install debcraft`. For other distributions or the latest features, users can install from the Git repository. The project welcomes contributions, with the code intentionally written in shell script to lower the barrier to entry. The author, Otto Kekalainen, a visionary leader, offers mentorship to aspiring Debian Developers.\n",
    "chinese_title": "Debcraft - 修改和构建Debian软件包的最简方式",
    "chinese_summary": "Debcraft 旨在简化 Debian 软件包的创建和维护，这个过程通常被认为复杂而令人生畏。它解决了常见的抱怨，例如工具过多、文档过时以及不清楚修改如何影响最终软件包。\n\nDebcraft 利用 Git、git-buildpackage 和 Linux 容器 (Docker/Podman) 来创建更易于访问和更简化的工作流程。它消除了在 Debian 系统上开发的必要性，允许使用其他操作系统的开发人员参与。该工具提供简单的命令，如 `debcraft build`、`debcraft test` 和 `debcraft release`，以自动构建、测试和发布软件包。输出采用颜色编码，并包含有用的解释和相关文档的链接。\n\n一个关键特性是清晰地分离构建工件和日志，从而方便比较更改。`debcraft shell` 命令有助于调试失败的构建。`debcraft improve` 自动修复问题并将软件包更新为遵循最新的 Debian 策略，而 `debcraft update` 帮助将软件包更新到最新的上游版本。\n\nDebcraft 可通过 `apt install debcraft` 在 Debian/Ubuntu 上使用。对于其他发行版或最新功能，用户可以从 Git 存储库安装。该项目欢迎贡献，代码有意用 shell 脚本编写，以降低入门门槛。作者 Otto Kekalainen 是一位有远见的领导者，为有抱负的 Debian 开发人员提供指导。"
  },
  {
    "id": "44614911",
    "title": "Wishes Upon My Demise",
    "url": "https://vale.rocks/posts/regarding-my-death",
    "summary": "Declan Chidlow's \"Wishes Upon My Demise\" outlines his post-death wishes, emphasizing the importance of accepting death's inevitability and planning accordingly. He prioritizes agency and mental clarity, stating that if these faculties are irrevocably lost, particularly due to brain death, he wishes to be euthanized. He specifically fears degenerative diseases like MND, Alzheimer's, and dementia and intends to pursue voluntary assisted dying in such cases.\n\nHe is a registered organ donor and wants his organs harvested without concern for physical appearance. He explicitly rejects burial, favoring donation to science, cremation, or other alternative methods. Funeral arrangements should be simple and non-religious, potentially including Pastafarian elements.\n\nChidlow requests specific information be shared on his social media channels following his death, including the cause of death for closure. He considers his website, Vale.Rocks, his legacy, detailing how it should be maintained and preserved on the Internet Archive. After his death, all content on the site will be dedicated to the public domain, with instructions to keep the site accessible but avoid significant alterations beyond necessary maintenance. He emphasizes maintaining existing licenses for his content published elsewhere. The document concludes with quotes reflecting his desire for a life lived fully and authentically, despite his fears of wasting it.\n",
    "chinese_title": "吾死之愿",
    "chinese_summary": "Declan Chidlow的《我死后的愿望》概述了他死后的愿望，强调接受死亡的必然性并据此进行规划的重要性。他优先考虑自主权和精神清晰，声明如果这些能力不可挽回地丧失，特别是由于脑死亡，他希望被实施安乐死。他特别害怕像运动神经元疾病、阿尔茨海默病和痴呆症这样的退行性疾病，并打算在这种情况下寻求自愿辅助死亡。\n\n他已登记为器官捐献者，希望他的器官被采集，无需考虑外貌。他明确拒绝土葬，倾向于捐献给科学研究、火葬或其他替代方法。葬礼安排应简单且非宗教，可以包含飞面神教的元素。\n\nChidlow要求在他去世后，他的社交媒体渠道上分享特定信息，包括死因，以便了结。他认为他的网站 Vale.Rocks 是他的遗产，详细说明了如何维护和将其保存在互联网档案馆中。在他去世后，网站上的所有内容将致力于公共领域，并指示保持网站可访问性，但避免进行超出必要维护的重大修改。他强调维护他在其他地方发布的内容的现有许可。该文件以反映他渴望充实而真实地生活，尽管他害怕浪费生命的引言结尾。"
  },
  {
    "id": "44608856",
    "title": "Broadcom to discontinue free Bitnami Helm charts",
    "url": "https://github.com/bitnami/charts/issues/35164",
    "summary": "Broadcom is discontinuing its free Bitnami Helm charts and container images effective August 28th, 2025. The public catalog will transition to a limited set of hardened, secure images available for development purposes under the \"latest\" tag at `https://hub.docker.com/u/bitnamisecure`.\n\nAll existing container images, including older versions, will be moved to the Bitnami Legacy repository (`docker.io/bitnamilegacy`), which will receive no further updates or support. This is intended as a temporary migration solution.\n\nFor production use, users are encouraged to subscribe to Bitnami Secure Images, which offers hardened images, continuous security updates (SLSA Level 3), CVE transparency, SBOMs, enterprise support, LTS branches, and access to the full application catalog.\n\nUsers should update their CI/CD pipelines and Helm repositories to reflect these changes. As a temporary workaround, users can point their Helm charts to the Bitnami Legacy repository, but this is not recommended for long-term use due to the lack of updates and support.  Free images will still be available, but only the latest version of a smaller subset of applications.  The underlying open-source code remains available on GitHub under the Apache 2 license.\n",
    "chinese_title": "博通将停止免费提供Bitnami Helm charts",
    "chinese_summary": "博通将于2025年8月28日起停止提供免费的Bitnami Helm charts和容器镜像。公共目录将过渡到一套有限的、强化的、安全的镜像，这些镜像将在`https://hub.docker.com/u/bitnamisecure`上以“latest”标签提供，用于开发目的。\n\n所有现有容器镜像，包括旧版本，将被移至Bitnami Legacy仓库（`docker.io/bitnamilegacy`），该仓库将不再接收更新或支持。 这仅作为临时迁移方案。\n\n对于生产环境使用，建议用户订阅Bitnami Secure Images，它提供强化镜像、持续安全更新（SLSA Level 3）、CVE透明度、SBOM、企业支持、LTS分支以及对完整应用目录的访问权限。\n\n用户应更新其CI/CD管道和Helm仓库以反映这些更改。作为临时解决方案，用户可以将Helm charts指向Bitnami Legacy仓库，但由于缺乏更新和支持，不建议长期使用。免费镜像仍将可用，但仅限于一小部分应用程序的最新版本。 底层开源代码仍可在GitHub上以Apache 2许可获得。"
  },
  {
    "id": "44609969",
    "title": "Silence Is a Commons by Ivan Illich (1983)",
    "url": "http://www.davidtinapple.com/illich/1983_silence_commons.html",
    "summary": "In \"Silence Is a Commons,\" Ivan Illich argues that modern technology, particularly electronic communication, is eroding essential \"commons\" – shared aspects of the environment crucial for human well-being – by transforming them into resources managed and controlled by institutions. He draws parallels between the enclosure of physical commons like pastures and roads and the enclosure of more subtle commons like silence and speech.\n\nIllich contends that the rise of loudspeakers and other communication technologies have diminished the value of individual voices, concentrating power in those who control these technologies, effectively silencing others. This transformation mirrors the historical enclosure of commons, where land was converted from shared resources for subsistence to private property for commercial gain, leading to widespread impoverishment and dependence on commodities.\n\nHe stresses that political ecology must recognize this transformation of commons into resources as a form of environmental degradation. Traditional anti-capitalist politics, focused on the private utilization of resources, has inadvertently bolstered this transformation. Illich calls for a new kind of \"popular intellectual\" to recognize this environmental redefinition of people as consumers, leading to movements that defend what remains of the commons.\n\nHe emphasizes that defending these commons, particularly silence, is crucial for the emergence of persons and for self-governance. Dependence on machines for communication and thinking threatens to degrade human dignity and well-being, leading to a society that demands to be managed rather than governing itself.\n",
    "chinese_title": "伊万·伊里奇：《沉默是公共资源》(1983)",
    "chinese_summary": "在《沉默即公共地》一书中，伊万·伊利奇认为现代技术，尤其是电子通信，正在侵蚀重要的“公共地”——对人类福祉至关重要的共享环境要素——将其转变为由机构管理和控制的资源。他将像牧场和道路等有形公共地的圈占，与像沉默和言语等更微妙的公共地的圈占进行类比。\n\n伊利奇认为，扬声器和其他通信技术的兴起降低了个人声音的价值，将权力集中在那些控制这些技术的人手中，实际上使其他人噤声。这种转变反映了历史上公共地的圈占，土地从维持生计的共享资源转变为用于商业利益的私有财产，导致普遍贫困和对商品的依赖。\n\n他强调，政治生态学必须认识到这种将公共地转变为资源的行为是一种环境退化。传统的反资本主义政治，侧重于资源的私人利用，无意中助长了这种转变。伊利奇呼吁出现一种新型的“大众知识分子”，来认识到这种将人重新定义为消费者的环境转变，从而引发捍卫剩余公共地的运动。\n\n他强调，捍卫这些公共地，特别是沉默，对于人的出现和自治至关重要。依赖机器进行交流和思考，威胁到人类的尊严和福祉，导致一个要求被管理而不是自我管理的社会。"
  },
  {
    "id": "44570113",
    "title": "C++: Zero-cost static initialization",
    "url": "https://cofault.com/zero-cost-static.html",
    "summary": "This article explores a technique to eliminate the runtime overhead associated with block-level static variable initialization in C++. Traditionally, these variables use internal flags and synchronization mechanisms (like `__cxa_guard_acquire`) to ensure initialization occurs only once, even in multi-threaded environments. This adds performance costs on every access, even after initialization.\n\nThe author proposes a zero-cost static initialization method leveraging a little-known feature of UNIX linkers: the ability to create symbols marking the start and end of a section (e.g., `__start_SECNAME` and `__stop_SECNAME`). The approach involves:\n\n1.  Defining placeholder objects within a custom section (e.g., `STATIC_Bar`) using `__attribute__((section))`. These placeholders are large enough to hold the intended static object.\n2.  During global static initialization, scanning the range of placeholders using the linker-provided start/stop symbols and using placement new to construct the actual static objects in-place within the placeholder's memory.\n\nThe initial attempt faced challenges with section attribute conflicts when using inline functions. The author overcame this by using embedded assembly (`__asm__`) with `.pushsection` and `.popsection` to manually place pointers to the placeholders in the dedicated section, circumventing compiler-managed section attributes.  To avoid symbol name collisions, the `__COUNTER__` macro is used to generate unique symbol names for each placeholder.  This ensures that by the time the function containing the static variable is called, the static object has already been initialized, eliminating the runtime checks and synchronization overhead. The article concludes with a working implementation demonstrating direct access to static variables in assembly, confirming the zero-cost nature of the optimization.\n",
    "chinese_title": "C++：零成本静态初始化",
    "chinese_summary": "本文探讨了一种消除C++中块级静态变量运行时初始化开销的技术。 传统上，这些变量使用内部标志和同步机制（例如`__cxa_guard_acquire`）来确保初始化仅发生一次，即使在多线程环境中也是如此。 这会在每次访问时增加性能成本，即使在初始化之后也是如此。\n\n作者提出了一种零成本静态初始化方法，该方法利用了UNIX链接器的一个鲜为人知的特性：创建标记section起始和结束的符号的能力（例如，`__start_SECNAME`和`__stop_SECNAME`）。 该方法包括：\n\n1. 使用`__attribute__((section))`在自定义section（例如，`STATIC_Bar`）中定义占位符对象。 这些占位符足够大，可以容纳预期的静态对象。\n2. 在全局静态初始化期间，使用链接器提供的start/stop符号扫描占位符范围，并使用placement new在占位符的内存中就地构造实际的静态对象。\n\n最初的尝试在使用内联函数时遇到了section属性冲突的挑战。 作者通过使用嵌入式汇编（`__asm__`）与`.pushsection`和`.popsection`手动将指向占位符的指针放置在专用section中来克服了这个问题，从而规避了编译器管理的section属性。 为了避免符号名称冲突，使用`__COUNTER__`宏为每个占位符生成唯一的符号名称。 这确保了在调用包含静态变量的函数时，静态对象已经初始化，从而消除了运行时检查和同步开销。 本文最后提供了一个可行的实现，演示了在汇编中直接访问静态变量，证实了该优化的零成本性质。"
  },
  {
    "id": "44594165",
    "title": "Zig's New Writer",
    "url": "https://www.openmymind.net/Zigs-New-Writer/",
    "summary": "This article discusses the significant rework of Zig's `std.Io.Writer` interface, a crucial component for handling input/output operations. The new design replaces the previous confusing and performance-lacking system with a unified interface centered around a `drain` function. Custom writers now implement `drain`, which handles an array of string slices (`[]const []const u8`) due to the Writer interface incorporating built-in buffering.\n\nThe `drain` function is responsible for writing data to the underlying resource (e.g., a file), and the `std.Io.Writer` handles buffering and partial writes. A simplified `drain` implementation is presented, often used during the transition period, which ignores the `splat` parameter and writes only the first slice in the data array.\n\nThe article highlights that `file.writer(&buffer)` returns a `File.Writer` struct containing an `interface: std.Io.Writer` field, which must be accessed explicitly. This convention is expected to be prevalent in the Zig ecosystem. Migrating to the new system involves replacing methods like `std.fmt.formatIntBuf` with `Writer.printInt` and using `Writer.fixed([]u8)` for functions previously working directly on buffers.\n\nA common migration error, `no field or member function named 'adaptToNewApi'`, is addressed by explaining that older writers must implement `adaptToNewApi` to expose a `new_interface: std.Io.Writer` field, enabling compatibility with the updated `std.fmt.format`.\n\nThe author expresses reservations about directly embedding buffering into the `Writer` interface, suggesting that composition (e.g., using separate `BufferedWriter`) might be a more flexible and understandable approach, aligning with common practices in other languages.\n",
    "chinese_title": "Zig 的新作者",
    "chinese_summary": "本文讨论了Zig的`std.Io.Writer`接口的重大重构，这是处理输入/输出操作的关键组件。新的设计用围绕`drain`函数的统一接口取代了之前令人困惑且性能不足的系统。现在，自定义writer实现`drain`函数，该函数处理字符串切片数组 (`[]const []const u8`)，因为Writer接口包含内置缓冲。\n\n`drain`函数负责将数据写入底层资源（例如，文件），而`std.Io.Writer`处理缓冲和部分写入。文章展示了一个简化的`drain`实现，通常在过渡期间使用，该实现忽略`splat`参数并仅写入数据数组中的第一个切片。\n\n文章强调，`file.writer(&buffer)`返回一个`File.Writer`结构体，其中包含一个`interface: std.Io.Writer`字段，必须显式访问。预计这种约定将在Zig生态系统中普遍存在。迁移到新系统涉及用`Writer.printInt`替换诸如`std.fmt.formatIntBuf`之类的方法，并对先前直接在缓冲区上工作的函数使用`Writer.fixed([]u8)`。\n\n文章通过解释说较旧的writer必须实现`adaptToNewApi`以公开一个`new_interface: std.Io.Writer`字段来解决常见的迁移错误`no field or member function named 'adaptToNewApi'`，从而实现与更新后的`std.fmt.format`的兼容性。\n\n作者对直接将缓冲嵌入到`Writer`接口中表示保留意见，并建议组合（例如，使用单独的`BufferedWriter`）可能是一种更灵活和易于理解的方法，这与其它语言中的常见做法相符。"
  },
  {
    "id": "44616488",
    "title": "How Claude Code Generates Status Messages",
    "url": "https://twitter.com/dmartincy/status/1941833382649864246",
    "summary": "This is not an article about how Claude Code generates status messages. Instead, it's an error message displayed on x.com (formerly Twitter) when JavaScript is disabled in the user's browser.\n\nThe message informs the user that **JavaScript is required to use the website and that it is currently disabled**. It instructs the user to **enable JavaScript or switch to a supported browser**.\n\nFurthermore, the message provides links to:\n\n*   **Help Center:** Presumably for instructions on enabling JavaScript or finding supported browsers.\n*   **Service Terms, Privacy Policy, Cookie Policy, Imprint, Advertising Information:** Standard legal and informational links found on many websites.\n*   **Copyright information:** Indicates that the website content is copyrighted by X Corp. in 2025.\n\nIn summary, the provided text is a JavaScript error message from x.com, alerting users about a necessary feature being disabled and offering guidance on how to resolve the issue, along with links to relevant website policies and information. It's not about code generation by Claude.\n",
    "chinese_title": "Claude代码如何生成状态消息",
    "chinese_summary": "这并非一篇关于Claude Code如何生成状态信息的文章。相反，这是一条当用户浏览器禁用JavaScript时在x.com（原Twitter）上显示的出错信息。\n\n该信息告知用户**使用本网站需要JavaScript，且JavaScript当前已被禁用**。它指示用户**启用JavaScript或切换到受支持的浏览器**。\n\n此外，该信息还提供了以下链接：\n\n*   **帮助中心：** 推测是关于如何启用JavaScript或查找受支持浏览器的说明。\n*   **服务条款、隐私政策、Cookie政策、版本说明、广告信息：** 在许多网站上都能找到的标准法律和信息链接。\n*   **版权信息：** 表明网站内容受X Corp.在2025年拥有的版权保护。\n\n总而言之，所提供的文本是来自x.com的JavaScript出错信息，提醒用户一项必要功能已被禁用，并提供关于如何解决该问题的指导，以及相关网站政策和信息的链接。它与Claude的代码生成无关。"
  },
  {
    "id": "44609479",
    "title": "Wii U SDBoot1 Exploit “paid the beak”",
    "url": "https://consolebytes.com/wii-u-sdboot1-exploit-paid-the-beak/",
    "summary": "This article details the discovery and exploitation of a boot1 vulnerability in the Wii U, dubbed \"paid the beak,\" and the effort to replicate a factory jig needed to trigger the exploit. The author recounts their involvement in recovering data from damaged Nintendo factory SD cards, which led to the discovery of the SDBoot1 function. Developer Rairii found a vulnerability within SDBoot1 that allows running custom code at boot, potentially recovering from most software bricks.\n\nTriggering SDBoot1 requires a special jig that activates the UNSTBL_PWR flag. The article details efforts by Jan and Deadly to replicate this jig using a Raspberry Pi Pico, providing code and instructions. Additionally, the author developed a solution using a PICAXE 08M2 microcontroller, offering a cheaper and smaller alternative.\n\nThe exploit can be used with the SD card image SDBoot1-Minute.bin. Flashing the card and using the jig or a clone allows for running custom code upon booting the Wii U. The author highlights the benefits of \"paid the beak,\" emphasizing its potential for accessibility and ease of use compared to other methods like Defuse, as it minimizes the need for soldering or opening the console. The article credits WiiCurious for funding and sourcing the project.\n",
    "chinese_title": "Wii U SDBoot1 漏洞“一命呜呼”",
    "chinese_summary": "本文详细介绍了Wii U中名为“paid the beak”的boot1漏洞的发现与利用，以及复制触发该漏洞所需的工厂测试夹具的努力。作者回顾了其参与从损坏的任天堂工厂SD卡中恢复数据的过程，这导致了SDBoot1函数的发现。开发者Rairii在SDBoot1中发现了一个漏洞，该漏洞允许在启动时运行自定义代码，从而有可能从大多数软件砖块中恢复。\n\n触发SDBoot1需要一个特殊的测试夹具来激活UNSTBL_PWR标志。本文详细介绍了Jan和Deadly使用Raspberry Pi Pico复制此夹具的努力，并提供了代码和说明。此外，作者还开发了一种使用PICAXE 08M2微控制器的解决方案，提供了一种更便宜、更小的替代方案。\n\n该漏洞可与SD卡镜像SDBoot1-Minute.bin一起使用。刷入SD卡并使用测试夹具或克隆夹具即可在Wii U启动时运行自定义代码。作者强调了“paid the beak”的优势，强调了其与Defuse等其他方法相比，在可访问性和易用性方面的潜力，因为它最大限度地减少了焊接或打开主机的需要。本文感谢WiiCurious对该项目的资助和支持。"
  },
  {
    "id": "44614292",
    "title": "Felix Baumgartner, who jumped from stratosphere, dies in Italy",
    "url": "https://www.theinternational.at/felix-baumgartner-who-jumped-from-stratosphere-dies-in-italy/",
    "summary": "This \"article\" presents a confusing juxtaposition of two unrelated topics: the falsely reported death of Felix Baumgartner (the stratosphere jumper) and information about Austrian Student Union (ÖH) Elections in 2023.\n\n**Regarding the incorrect Baumgartner headline:** This suggests the article *started* with a fabricated news story about the death of Felix Baumgartner. This claim is untrue; as of October 26, 2023, Felix Baumgartner is alive and well. The headline likely served as sensationalist clickbait or an error.\n\n**Regarding the ÖH Elections 2023:** The provided content signals that the core of the article is actually about the Austrian Student Union (ÖH) elections held in 2023. The phrase \"Everything You Need to Know\" implies the piece offers comprehensive information about these elections. Key details likely covered include:\n\n*   **What the ÖH is:** Explaining the function and role of the Austrian Student Union.\n*   **Why the elections matter:** Outlining the impact of the ÖH on student life and university policy.\n*   **Who could vote:** Detailing eligibility criteria for voting in the elections.\n*   **Key political groups/parties involved:** Profiling the various factions vying for seats in the ÖH.\n*   **Important issues being debated:** Highlighting the key policy areas and concerns addressed during the campaign.\n\nThe \"office 07/05/2023\" likely refers to the date of publication or a relevant date related to the elections.\n\n**In summary:** The article is a strange mix of misinformation (the false Baumgartner headline) and legitimate information about the Austrian Student Union (ÖH) Elections 2023.\n",
    "chinese_title": "菲利克斯·鲍姆加特纳，曾从平流层跳伞，在意大利去世",
    "chinese_summary": "本文将两个不相关的议题混淆并列：菲利克斯·鲍姆加特纳（平流层跳伞者）的虚假死亡报道和2023年奥地利学生会（ÖH）选举信息。\n\n**关于鲍姆加特纳的不实标题：** 这表明文章*最初*以捏造的菲利克斯·鲍姆加特纳死亡新闻故事开头。这种说法是不真实的；截至2023年10月26日，菲利克斯·鲍姆加特纳仍然健在。该标题很可能是一种耸人听闻的点击诱饵或错误。\n\n**关于2023年ÖH选举：** 提供的内容表明，文章的核心实际上是关于2023年举行的奥地利学生会（ÖH）选举。“你需要知道的一切”这句话意味着这篇文章提供了关于这些选举的全面信息。可能涵盖的关键细节包括：\n\n*   **什么是ÖH：** 解释奥地利学生会的功能和作用。\n*   **为什么选举很重要：** 概述ÖH对学生生活和大学政策的影响。\n*   **谁可以投票：** 详细说明选举投票的资格标准。\n*   **涉及的主要政治团体/党派：** 描述争夺ÖH席位的不同派别。\n*   **正在辩论的重要议题：** 突出竞选期间涉及的关键政策领域和关切。\n\n“office 07/05/2023”可能指的是发布日期或与选举相关的相关日期。\n\n**总之：** 这篇文章是将错误信息（鲍姆加特纳的虚假标题）和关于奥地利学生会（ÖH）2023年选举的真实信息奇怪地混合在一起。"
  },
  {
    "id": "44614337",
    "title": "First Space-Based Gravitational Wave Detector Begins Construction",
    "url": "https://spectrum.ieee.org/laser-interferometer-space-antenna",
    "summary": "The article \"First Space-Based Gravitational Wave Detector Begins Construction\" reports on the Europe-led Laser Interferometer Space Antenna (LISA) mission, a space-based gravitational wave detector scheduled to launch in 2035. Authored by Tereza Pultarova, an aerospace and defense journalist, the article highlights LISA's purpose: to study gravitational waves, specifically tiny ripples in spacetime, emanating from distant and gigantic black holes. The mission marks a significant advancement in gravitational wave astronomy, moving observations beyond Earth-based detectors. By being located in space, LISA will be able to detect lower frequency gravitational waves than ground-based observatories, providing insights into the universe's most massive black hole systems.\n",
    "chinese_title": "首个空间引力波探测器开始建造",
    "chinese_summary": "首个空间引力波探测器开始建造"
  },
  {
    "id": "44610925",
    "title": "Ccusage: A CLI tool for analyzing Claude Code usage from local JSONL files",
    "url": "https://github.com/ryoppippi/ccusage",
    "summary": "`ccusage` is a CLI tool designed to analyze Claude Code token usage and associated costs directly from local JSONL files. It offers a fast and informative way to track your Claude expenses without requiring a large installation. You can run it directly using `bunx`, `npx`, or `deno`.\n\nThe tool provides several report types: daily, monthly, session (conversation-based), and 5-hour billing block reports. It also supports live monitoring with real-time dashboards.  `ccusage` offers filtering options such as date ranges (`--since`, `--until`) and specific projects (`--project`). You can also output data in JSON format (`--json`).\n\nKey features include model tracking, cost breakdowns per model, custom data directory support, colorful and responsive output, and offline mode for using pre-cached pricing data. It also has Model Context Protocol (MCP) integration and supports grouping usage by project/instance. One notable aspect is its ultra-small bundle size compared to other similar tools.\n",
    "chinese_title": "Ccusage: 一个从本地 JSONL 文件分析 Claude 代码用量的 CLI 工具",
    "chinese_summary": "`ccusage` 是一款命令行工具，旨在直接从本地 JSONL 文件分析 Claude 代码令牌使用情况和相关成本。 它提供了一种快速且信息丰富的方式来跟踪您的 Claude 费用，而无需大型安装。 您可以使用 `bunx`、`npx` 或 `deno` 直接运行它。\n\n该工具提供多种报告类型：每日、每月、会话（基于对话）和 5 小时计费块报告。 它还支持实时监控，并提供实时仪表板。 `ccusage` 提供过滤选项，例如日期范围（`--since`、`--until`）和特定项目（`--project`）。 您还可以以 JSON 格式输出数据（`--json`）。\n\n主要功能包括模型跟踪、按模型划分的成本细分、自定义数据目录支持、色彩丰富且响应迅速的输出以及使用预缓存定价数据的离线模式。 它还具有模型上下文协议 (MCP) 集成，并支持按项目/实例对使用情况进行分组。一个值得注意的方面是，与其他类似工具相比，它的捆绑包体积非常小。"
  },
  {
    "id": "44587717",
    "title": "When to make LODs (2021)",
    "url": "https://medium.com/@jasonbooth_86226/when-to-make-lods-c3109c35b802",
    "summary": "This article challenges the traditional focus on polygon count for optimizing 3D models, arguing that it's an outdated metric. Instead, the author emphasizes the importance of minimizing \"MicroTriangles\" – small triangles covering less than 10x10 pixels on the screen. These are costly because GPUs process pixels in 2x2 blocks, forcing the computation of all four pixels even if only one is covered by a small triangle. This leads to exponentially higher rendering costs for single-pixel geometry.\n\nThe article criticizes the overuse of LODs (Level of Detail) motivated by outdated polygon count concerns, stating they can cause popping, break batching, consume memory, and reduce visual quality. The author suggests focusing on MicroTriangle density instead and swapping to a lower LOD when the wireframe view appears nearly solid. Unity's HDRP \"Vertex Density\" heat map is mentioned as a helpful tool for this. In many cases, a single LOD and an imposter for distance is better than multiple LODs.\n\nThe article also touches on the future of rendering, mentioning Epic's Nanite technology as an example of a system that avoids MicroTriangle issues by using a continuous LOD system and a screen-space shader approach, shifting the heavy fragment work to screen space and using compute shaders for tiny triangles. This suggests that optimization strategies will continue to evolve with advancements in GPU architecture and rendering techniques.\n",
    "chinese_title": "何时制作LOD (2021)",
    "chinese_summary": "本文挑战了优化3D模型时传统上对多边形数量的关注，认为这是一个过时的指标。作者强调了最小化“微小三角形”的重要性——即屏幕上覆盖面积小于10x10像素的三角形。这些三角形的代价很高，因为GPU以2x2的像素块处理像素，即使只有一个像素被一个小三角形覆盖，也必须计算所有四个像素。这导致单像素几何体的渲染成本呈指数级增长。\n\n文章批评了出于过时多边形数量考虑而过度使用LOD（细节层次），认为这可能导致跳变、破坏批处理、消耗内存并降低视觉质量。作者建议专注于微小三角形密度，并在线框视图看起来几乎完全实心时切换到较低的LOD。文章提到Unity的HDRP“顶点密度”热图是对此有用的工具。在许多情况下，使用单个LOD和一个用于远距离的imposter比多个LOD更好。\n\n文章还谈到了渲染的未来，提到Epic的Nanite技术，作为一个通过使用连续LOD系统和屏幕空间着色器方法来避免微小三角形问题的例子，将繁重的片段工作转移到屏幕空间，并使用计算着色器处理微小三角形。这表明优化策略将随着GPU架构和渲染技术的进步而不断发展。"
  },
  {
    "id": "44609137",
    "title": "Multiplatform Matrix Multiplication Kernels",
    "url": "https://burn.dev/blog/sota-multiplatform-matmul/",
    "summary": "This article discusses the challenges of achieving high-performance matrix multiplication across different hardware platforms, particularly in the context of AI workloads where it's a fundamental operation. The key bottleneck is identified as data movement rather than computation itself, motivating the need for custom kernels that fuse operations. While NVIDIA's cuBLAS/cuDNN offer optimized kernels, they lack flexibility and extensibility. CUTLASS provides more customization but is NVIDIA-specific, hindering cross-platform optimization.\n\nTo address this, the authors developed CubeCL, a system for generating optimized matrix multiplication kernels for various GPUs and CPUs.  A central idea is that no single algorithm suits all matrix shapes, hence the need for configurable algorithms. The authors emphasize understanding GPU architecture (SMs, threads/units, warps/planes, thread blocks/workgroups) and memory resources (shared memory, registers) to optimize kernel design.  Key concepts like coalesced memory access, occupancy, and balancing hardware scheduling with software pipelining are highlighted.\n\nThe core of CubeCL is a four-level abstraction hierarchy: Tile Matmul (lowest level, handles individual multiply-add operations, potentially using Tensor Cores or similar accelerators), Stage Matmul (manages shared memory), Global Matmul (accumulates results from Stage Matmuls), and Batch Matmul (orchestrates multiple Global Matmuls). This hierarchical structure enables a divide-and-conquer approach for optimized data locality and movement. The system prioritizes the \"plane\" (warp/subgroup) as the smallest computation primitive to avoid branching and maximize performance. The Tile Matmul layer directly interfaces with the hardware, and efficient utilization of hardware accelerators is a focus where available.\n",
    "chinese_title": "多平台矩阵乘法内核",
    "chinese_summary": "本文探讨了在不同硬件平台上实现高性能矩阵乘法的挑战，尤其是在人工智能工作负载中，矩阵乘法是一项基本操作。研究表明，关键瓶颈在于数据移动而非计算本身，因此需要融合操作的定制内核。虽然NVIDIA的cuBLAS/cuDNN提供了优化内核，但它们缺乏灵活性和可扩展性。CUTLASS提供了更多的定制功能，但它是NVIDIA专用的，阻碍了跨平台优化。\n\n为了解决这个问题，作者开发了CubeCL，一个用于为各种GPU和CPU生成优化矩阵乘法内核的系统。一个核心思想是，没有单一算法适合所有矩阵形状，因此需要可配置的算法。作者强调了理解GPU架构（SM、线程/单元、warp/plane、线程块/工作组）和内存资源（共享内存、寄存器）以优化内核设计的重要性。诸如合并内存访问、占用率以及平衡硬件调度与软件流水线等关键概念被重点强调。\n\nCubeCL的核心是一个四级抽象层次结构：Tile Matmul（最低级别，处理单个乘加运算，可能使用Tensor Core或类似的加速器）、Stage Matmul（管理共享内存）、Global Matmul（累积来自Stage Matmuls的结果）和Batch Matmul（协调多个Global Matmuls）。这种分层结构支持一种分而治之的方法，以实现优化的数据局部性和移动。该系统将“plane”（warp/子组）作为最小的计算原语来优先处理，以避免分支并最大限度地提高性能。Tile Matmul层直接与硬件交互，并着重于高效利用硬件加速器（如果可用）。"
  },
  {
    "id": "44569032",
    "title": "Trying Guix: A Nixer's impressions",
    "url": "https://tazj.in/blog/trying-guix",
    "summary": "This article details a Nix user's first experience trying Guix, aiming to replicate their standard desktop setup on a Zhaoxin-based laptop. The author, a long-time Nix user familiar with Lisp, highlights key differences and observations.\n\nA major difference is the architectural layering: Guix tightly integrates the CLI with a fixed profile containing all packages and modules, unlike Nix where nixpkgs are imported as a data structure. This makes version switching slower in Guix, requiring a `guix pull` to rebuild the CLI.\n\nThe author praises Guix's superior documentation due to its focused culture but notes the challenge of requiring Scheme knowledge and the complexities introduced by the need for `nonguix` to enable proprietary hardware support.\n\nPerformance is noticeably slower in Guix, with `guix pull` taking significantly longer than updating nixpkgs in Nix. While the author built the system config on a powerful server, deploying it to the laptop proved difficult.\n\nThe author appreciates Guix's use of Shepherd, a Scheme-based init system, instead of systemd.\n\nUltimately, the author successfully installed Guix but without a graphical interface, attributing this to missing hardware configurations and the lack of a `nixos-generate-config` equivalent. Despite the challenges, the author finds Guix intriguing due to Lisp integration and a more coherent ecosystem, expressing a desire to achieve parity with their NixOS desktop configuration and improve iteration speed. The author acknowledges potential solutions suggested by the Guix community but hasn't yet tested them.\n",
    "chinese_title": "尝试 Guix：一个 Nix 使用者的印象",
    "chinese_summary": "本文详细介绍了 Nix 用户首次尝试 Guix 的体验，旨在在一台基于兆芯处理器的笔记本电脑上复制其标准桌面设置。作者是一位长期使用 Nix 且熟悉 Lisp 的用户，重点介绍了关键差异和观察结果。\n\n一个主要区别是架构分层：与将 nixpkgs 作为数据结构导入的 Nix 不同，Guix 将 CLI 与包含所有软件包和模块的固定配置文件紧密集成。这使得 Guix 中的版本切换速度较慢，需要 `guix pull` 来重建 CLI。\n\n作者赞扬 Guix 的卓越文档，这得益于其专注的文化，但也指出需要 Scheme 知识带来的挑战，以及需要使用 `nonguix` 来启用专有硬件支持所带来的复杂性。\n\nGuix 中的性能明显较慢，`guix pull` 比 Nix 中更新 nixpkgs 花费的时间更长。虽然作者在一台强大的服务器上构建了系统配置，但将其部署到笔记本电脑上证明是困难的。\n\n作者欣赏 Guix 使用 Shepherd（一种基于 Scheme 的 init 系统）而不是 systemd。\n\n最终，作者成功安装了 Guix，但没有图形界面，这归因于缺少硬件配置以及缺乏与 `nixos-generate-config` 等效的功能。尽管存在挑战，但作者发现 Guix 由于 Lisp 集成和更具凝聚力的生态系统而引人入胜，并表达了希望实现与其 NixOS 桌面配置同等水平并提高迭代速度的愿望。作者承认 Guix 社区提出的潜在解决方案，但尚未对其进行测试。"
  },
  {
    "id": "44612569",
    "title": "Microsoft Office is using an artificially complex XML schema as a lock-in tool",
    "url": "https://blog.documentfoundation.org/blog/2025/07/18/artificially-complex-xml-schema-as-lock-in-tool/",
    "summary": "This article argues that Microsoft Office utilizes an artificially complex XML schema in its document formats as a lock-in strategy, hindering interoperability and trapping users within the Microsoft ecosystem. The author claims that while XML should facilitate knowledge sharing through simplicity, Microsoft deliberately introduces unnecessary complexity to make it difficult for other developers to create compatible software.\n\nThis \"artificial complexity\" includes deeply nested tags, excessive abstraction, non-intuitive naming, widespread use of extension points, and multiple namespace imports. While the documentation is extensive, the overall complexity makes implementation exceedingly difficult for those outside of Microsoft.\n\nThe article draws an analogy to a railway system where accessible tracks are undermined by a convoluted control system, effectively monopolizing train services. Similarly, Microsoft leverages its complex XML schema to control access to document formats, forcing users to accept their terms, such as the switch from Windows 10 to Windows 11.\n\nThe author criticizes users for uncritically accepting Microsoft's narrative and enabling these lock-in strategies. They argue that this lack of critical evaluation has allowed Microsoft to consolidate its monopoly. The article concludes by advocating for simplicity and clarity in XML-based systems, warning that complexity leads to vendor lock-in and restricts user freedom.\n",
    "chinese_title": "微软 Office 正在使用人为复杂的 XML 模式作为锁定工具。",
    "chinese_summary": "本文认为，微软 Office 在其文档格式中使用了人为复杂的 XML 模式，作为一种锁定策略，阻碍互操作性，并将用户困在微软生态系统中。作者声称，XML 本应通过其简洁性促进知识共享，但微软故意引入不必要的复杂性，使得其他开发者难以创建兼容的软件。\n\n这种“人为复杂性”包括深度嵌套的标签、过度抽象、非直观的命名、扩展点的广泛使用以及多个命名空间导入。尽管文档详尽，但整体的复杂性使得微软以外的人难以实现。\n\n本文将此比作一个铁路系统，其中可访问的轨道因复杂的控制系统而受到破坏，从而有效地垄断了列车服务。 同样，微软利用其复杂的 XML 模式来控制对文档格式的访问，迫使用户接受他们的条款，例如从 Windows 10 切换到 Windows 11。\n\n作者批评用户不加批判地接受微软的说法，并助长了这些锁定策略。他们认为，缺乏批判性评估使得微软得以巩固其垄断地位。文章最后倡导基于 XML 的系统的简洁性和清晰性，并警告说，复杂性会导致厂商锁定并限制用户自由。"
  },
  {
    "id": "44605670",
    "title": "A New Geometry for Einstein's Theory of Relativity",
    "url": "https://www.quantamagazine.org/a-new-geometry-for-einsteins-theory-of-relativity-20250716/",
    "summary": "This article discusses a new approach to Einstein's theory of general relativity developed by a team of mathematicians in Vienna. The standard theory struggles with singularities and non-smooth space-times (like at the center of black holes), where its equations break down. The Viennese team, led by Clemens Sämann, Michael Kunzinger, and Roland Steinbauer, is devising new geometric techniques to extend the theory's scope.\n\nTheir initial approach involved estimating sectional curvature by comparing triangles drawn on a space-time surface to those on a reference surface with known curvature, bypassing the need for calculus and smoothness assumptions. This allowed them to prove a version of Hawking's singularity theorem in non-smooth settings.\n\nLater, Robert McCann's work on optimal transport, inspired by Gaspard Monge's work, provided another tool for estimating Ricci curvature (a more average measure of curvature) by examining how volumes change as they move through space-time. Andrea Mondino and Stefan Suhr then adapted optimal transport techniques to work in non-smooth settings, drawing insights from Kunzinger and Sämann's work.\n\nThe ultimate goal is to develop a new geometric framework that can handle \"edgy\" and \"badly behaved\" space-times, allowing mathematicians to explore the universe beyond the limitations of standard general relativity and to understand the nature of singularities without relying on the assumption of smooth space-time.\n",
    "chinese_title": "爱因斯坦相对论的新几何",
    "chinese_summary": "本文探讨了维也纳的一个数学家团队开发的一种爱因斯坦广义相对论的新方法。标准理论在奇点和非光滑时空（例如黑洞中心）处会遇到困难，其方程在那里失效。由Clemens Sämann、Michael Kunzinger和Roland Steinbauer领导的维也纳团队正在设计新的几何技术来扩展该理论的范围。\n\n他们最初的方法包括通过比较时空表面上绘制的三角形与具有已知曲率的参考表面上的三角形来估计截面曲率，从而绕过对微积分和平滑性假设的需求。这使他们能够在非光滑环境中证明霍金奇点定理的一个版本。\n\n后来，受Gaspard Monge工作的启发，Robert McCann关于最优传输的工作为估计Ricci曲率（一种更平均的曲率测量方法）提供了另一种工具，方法是检查体积在时空中移动时如何变化。随后，Andrea Mondino和Stefan Suhr借鉴Kunzinger和Sämann的研究成果，调整了最优传输技术，使其能够在非光滑环境中工作。\n\n最终目标是开发一种新的几何框架，该框架可以处理“边缘化”和“表现不佳”的时空，从而使数学家能够在标准广义相对论的限制之外探索宇宙，并在不依赖光滑时空假设的情况下理解奇点的本质。"
  },
  {
    "id": "44570389",
    "title": "Show HN: OrioleDB Beta12 Features and Benchmarks",
    "url": "https://www.orioledb.com/blog/orioledb-beta12-benchmarks",
    "summary": "OrioleDB is a PostgreSQL storage extension aiming to improve scalability and performance by replacing the default Heap storage engine. Beta12 introduces new features like support for non-B-tree indexes, rewinding recent changes, tablespaces, fillfactor, space utilization statistics, and tables with over 32 columns.\n\nSignificant performance improvements include more efficient storage allocation using sparse files, separation of undo logs, optimizations to avoid undo records for insertions, a custom scan node for primary key lookups, and faster B-tree navigation.\n\nBenchmarks using TPC-C (go-tpc), sysbench, and OLTP workloads demonstrate OrioleDB's performance advantages over the standard PostgreSQL Heap storage engine.\n\n*   **go-tpc (TPC-C):** OrioleDB significantly outperformed Heap in transactions-per-minute-C (tpmC) across various instance sizes, achieving up to double the throughput.\n*   **sysbench:** OrioleDB averaged around 19,000 QPS compared to Heap's 9,500 QPS.\n*   **OLTP:** OrioleDB averaged ~37,000 QPS compared to Heap's ~32,000 QPS.\n\nThe article provides instructions for replicating the benchmarks. A Docker image is provided to get started with OrioleDB. In essence, OrioleDB Beta12 is positioned as a substantial performance upgrade for PostgreSQL, especially in transactional and read-heavy workloads.\n",
    "chinese_title": "Show HN: OrioleDB Beta12 功能与基准测试",
    "chinese_summary": "OrioleDB是一个PostgreSQL存储扩展，旨在通过替换默认的堆存储引擎来提高可扩展性和性能。Beta12引入了诸如非B树索引、重放近期更改、表空间、填充因子、空间利用率统计以及超过32列的表等新功能。\n\n性能方面的显著改进包括使用稀疏文件进行更高效的存储分配、撤销日志的分离、避免插入操作产生撤销记录的优化、用于主键查找的自定义扫描节点以及更快的B树导航。\n\n使用TPC-C (go-tpc)、sysbench和OLTP工作负载进行的基准测试表明，OrioleDB的性能优于标准PostgreSQL堆存储引擎。\n\n*   **go-tpc (TPC-C):** OrioleDB在各种实例大小的每分钟事务处理量（tpmC）方面显著优于堆，吞吐量最多可达两倍。\n*   **sysbench:** OrioleDB平均约为19,000 QPS，而堆为9,500 QPS。\n*   **OLTP:** OrioleDB平均约为37,000 QPS，而堆约为32,000 QPS。\n\n本文提供了复制基准测试的说明。提供了一个Docker镜像以开始使用OrioleDB。本质上，OrioleDB Beta12被定位为PostgreSQL的重大性能升级，尤其是在事务和读密集型工作负载中。"
  },
  {
    "id": "44609130",
    "title": "AI capex is so big that it's affecting economic statistics",
    "url": "https://paulkedrosky.com/honey-ai-capex-ate-the-economy/",
    "summary": "This article argues that massive AI datacenter capital expenditure (capex) is significantly impacting the US economy, potentially masking underlying weaknesses and distorting economic statistics. The author contends that AI capex, driven primarily by Nvidia sales to hyperscalers, has increased dramatically, exceeding peak telecom spending during the dot-com bubble and approaching peak 19th-century railroad infrastructure spending as a percentage of GDP.\n\nThe article highlights that this substantial capital is being sourced from various avenues, including internal cash flows of tech giants, debt issuance, equity offerings, venture capital, SPVs, and cloud consumption commitments. However, this reallocation of capital is starving other sectors, such as non-AI venture capital, cloud compute offerings, manufacturing, and general infrastructure, leading to layoffs and potential long-term consequences.\n\nThe author posits that AI capex is acting as a substantial, albeit unintentional, private sector stimulus program, masking economic weaknesses. The author estimates that without AI datacenter investment, Q1 GDP contraction could have been significantly worse. The article concludes by emphasizing the remarkable and potentially unsustainable nature of deploying such large amounts of capital into rapidly depreciating AI infrastructure. The author also points out the irony of AI investment leading to layoffs before widespread deployment.\n",
    "chinese_title": "人工智能资本支出规模巨大，正在影响经济统计数据。",
    "chinese_summary": "大规模AI数据中心资本支出正在显著影响美国经济，可能掩盖了潜在的疲软并扭曲了经济数据。作者认为，主要由英伟达向超大规模企业销售驱动的AI资本支出已大幅增加，超过了互联网泡沫时期的电信支出峰值，并接近19世纪铁路基础设施支出占GDP的峰值比例。\n\n文章强调，这笔巨额资本来自多个渠道，包括科技巨头的内部现金流、债务发行、股权发行、风险投资、特殊目的公司(SPV)和云消费承诺。然而，这种资本的重新分配正在削弱其他行业，例如非AI风险投资、云计算产品、制造业和一般基础设施，导致裁员和潜在的长期后果。\n\n作者认为，AI资本支出正在充当一项实质性的，尽管是无意的，私营部门刺激计划，掩盖了经济疲软。作者估计，如果没有AI数据中心投资，第一季度GDP的萎缩可能会更加严重。文章最后强调了将如此大量的资本部署到快速贬值的AI基础设施中的非凡性和潜在的不可持续性。作者还指出了AI投资在广泛部署之前就导致裁员的讽刺之处。"
  },
  {
    "id": "44608312",
    "title": "Show HN: Molab, a cloud-hosted Marimo notebook workspace",
    "url": "https://molab.marimo.io/notebooks",
    "summary": "Molab is a cloud-hosted workspace for Marimo notebooks. Marimo is described as a next-generation programming environment designed for data, stored as Python, and optimized for rapid experimentation. Molab allows users to create, run, and share these Marimo notebooks. The platform offers example notebooks to help users get started, showcasing features like markdown writing, plotting, SQL usage, UI elements, Hugging Face inference, embedding visualization, vector search, Polars bot detection, custom widgets using anywidget, and PyTorch integration. These examples demonstrate the capabilities and versatility of Marimo within the Molab environment. In essence, Molab provides a collaborative and accessible platform for developing and deploying data-driven applications using Marimo notebooks.\n",
    "chinese_title": "Show HN: Molab，云端托管的 Marimo 笔记本工作区",
    "chinese_summary": "Molab是Marimo Notebook的云端托管工作空间。Marimo被描述为下一代编程环境，专为数据设计，以Python存储，并针对快速实验进行了优化。Molab允许用户创建、运行和分享这些Marimo Notebook。该平台提供示例Notebook帮助用户入门，展示了诸如markdown写作、绘图、SQL使用、UI元素、Hugging Face推理、嵌入可视化、向量搜索、Polars机器人检测、使用anywidget的自定义小部件以及PyTorch集成等功能。这些示例展示了Marimo在Molab环境中的能力和多功能性。本质上，Molab提供了一个协作且易于访问的平台，用于使用Marimo Notebook开发和部署数据驱动的应用程序。"
  },
  {
    "id": "44607403",
    "title": "The year of peak might and magic",
    "url": "https://www.filfre.net/2025/07/the-year-of-peak-might-and-magic/",
    "summary": "This article discusses New World Computing's \"year of peak Might and Magic,\" specifically focusing on the development and release of \"Heroes of Might and Magic III: The Restoration of Erathia\" in 1999. The author explains that despite founder Jon Van Caneghem's waning interest in game development, the company still managed to produce commercially successful titles.\n\n\"Heroes III\" was developed on a limited budget and timeframe, aiming to evolve rather than revolutionize the successful formula of \"Heroes II.\" Greg Fulton, a relative newcomer, served as co-designer, tasked with expanding the game's content and features while maintaining its core mechanics. The game received graphical updates, larger combat maps, more factions, units, buildings, and enhanced RPG elements. Campaigns were expanded with richer storylines and continuity.\n\nWhile \"Heroes III\" is widely considered the franchise's pinnacle, the author expresses a slight preference for \"Heroes II,\" citing its more charming aesthetics and simpler faction structure. Despite this, the author acknowledges \"Heroes III\" as an immensely satisfying game, praising its smart design and the addition of elements that enhance variety without overcomplicating gameplay. The article details the author's personal experiences with both games. The article concludes by noting the game's slow-burn success, bolstered by expansion packs and additional features, solidifying its legacy as a defining entry in the series.\n",
    "chinese_title": "魔法门之巅峰年",
    "chinese_summary": "本文探讨了新世界计算公司“魔法门之英雄无敌巅峰之年”，特别关注1999年《魔法门之英雄无敌III：埃拉西亚的光复》的开发和发行。作者解释说，尽管创始人乔恩·范·卡内亨对游戏开发的兴趣逐渐减退，但该公司仍然成功地制作出商业上成功的游戏。\n\n《英雄无敌III》在有限的预算和时间框架内开发，旨在进化而非彻底变革《英雄无敌II》的成功模式。相对的新人格雷格·富尔顿担任联合设计师，负责扩展游戏的内容和功能，同时保持其核心机制。游戏进行了图形更新，扩大了战斗地图，增加了派系、单位、建筑物，并增强了RPG元素。战役通过更丰富的故事情节和连续性得到了扩展。\n\n虽然《英雄无敌III》被广泛认为是该系列的巅峰之作，但作者表示略微偏爱《英雄无敌II》，理由是其更具魅力的美学和更简单的派系结构。尽管如此，作者承认《英雄无敌III》是一款令人非常满意的游戏，赞扬其巧妙的设计以及增加的元素，这些元素增强了多样性而又不会使游戏玩法过于复杂。本文详细介绍了作者对这两款游戏的个人体验。文章最后指出，该游戏凭借扩展包和附加功能的缓慢燃烧式的成功，巩固了其作为该系列中一个决定性条目的地位。"
  },
  {
    "id": "44614207",
    "title": "Singapore actively dealing with ongoing cyberattack on critical infrastructure",
    "url": "https://www.channelnewsasia.com/singapore/unc3886-cyber-security-threat-actor-attack-singapore-5245791",
    "summary": "Singapore is actively combating an ongoing cyberattack on its critical infrastructure by a \"highly sophisticated threat actor\" identified as UNC3886, described as a \"China-nexus espionage group\" by Google's cybersecurity firm, Mandiant. Coordinating Minister for National Security K Shanmugam highlighted the severity of the threat, emphasizing its potential to undermine national security.\n\nThe Cyber Security Agency of Singapore (CSA) is leading investigations, supporting affected organizations, and monitoring critical sectors like energy, water, banking, and communications. Due to the ongoing nature of the investigation, detailed information is being withheld to maintain operational security.\n\nUNC3886 deploys advanced tools, evades detection, and maintains persistent access, targeting high-value strategic targets. APT attacks on Singapore have increased significantly between 2021 and 2024. Shanmugam underscored that physical conflicts are increasingly spilling into cyberspace, making Singapore a target due to its geopolitical relevance and status as a digital hub.\n\nShanmugam also noted that a large percentage of Singaporean organizations have experienced a cyberattack, with threats ranging from cyber criminals to foreign actors. Recognizing that attacks will inevitably succeed at times, the government is committed to strengthening cyber defenses, re-examining vendors, and focusing on prevention and containment to maintain trust and confidence in Singapore's systems.\n",
    "chinese_title": "新加坡积极应对针对关键基础设施的持续网络攻击",
    "chinese_summary": "新加坡正积极应对针对其关键基础设施的网络攻击，该攻击由被谷歌旗下网络安全公司Mandiant认定为“中国关联间谍组织”的“高度复杂的威胁行为者”UNC3886发起。国家安全统筹部长尚穆根强调了这一威胁的严重性，并指出其有可能破坏国家安全。\n\n新加坡网络安全局（CSA）正在主导调查，为受影响的组织提供支持，并监测能源、水务、银行和通信等关键领域。由于调查仍在进行中，为维护行动安全，详细信息暂不公开。\n\nUNC3886部署先进工具，逃避侦测，并维持持续访问，针对高价值战略目标。2021年至2024年期间，针对新加坡的APT攻击显著增加。尚穆根强调，实际冲突正日益蔓延至网络空间，新加坡因其地缘政治重要性和作为数字枢纽的地位而成为攻击目标。\n\n尚穆根还指出，很大一部分新加坡组织遭受过网络攻击，威胁来自网络犯罪分子和外国行为者。政府认识到攻击有时不可避免地会成功，因此致力于加强网络防御，重新审查供应商，并专注于预防和遏制，以维护对新加坡系统的信任和信心。"
  },
  {
    "id": "44602532",
    "title": "When root meets immutable: OpenBSD chflags vs. log tampering",
    "url": "https://rsadowski.de/posts/2025/openbsd-immutable-system-logs/",
    "summary": "This article explains how to achieve ISO 27001 compliance for log integrity on OpenBSD using the `chflags` command to leverage filesystem-level immutability. The author emphasizes that while ISO 27001 doesn't explicitly require immutable logs, protecting logs against tampering is crucial for forensic analysis after a security breach.\n\nOpenBSD's default logging setup is effective but vulnerable to root access compromise. An attacker with root privileges can easily modify or delete log files, undermining their trustworthiness. The article highlights the `sappnd` (system append-only) and `schg` (system immutable) flags in `chflags` as a solution.\n\nThe proposed implementation involves disabling the default `newsyslog` cron job and creating a dedicated `/var/log/archive` directory for archived logs. Active log files are then set with the `sappnd` flag, preventing modification but allowing appending. Archived logs in `/var/log/archive` are set with the `schg` flag, making them completely immutable.\n\nTo manage log rotation, the author introduces `/etc/rc.securelevel`, a script executed during boot before the security level increases. This script removes `sappnd` and `schg` flags, rotates logs into the archive, and then immediately restores the flags, ensuring immutability is maintained. This process is automated without manual intervention, bolstering compliance and security.\n",
    "chinese_title": "当 root 遇上不可变：OpenBSD chflags 与日志篡改",
    "chinese_summary": "本文介绍如何使用`chflags`命令在OpenBSD上实现日志完整性的ISO 27001合规性，以利用文件系统级别的不可变性。作者强调，虽然ISO 27001没有明确要求不可变的日志，但保护日志免受篡改对于安全漏洞后的取证分析至关重要。\n\nOpenBSD的默认日志记录设置是有效的，但容易受到root访问权限泄露的影响。拥有root权限的攻击者可以轻松修改或删除日志文件，从而破坏其可信度。本文重点介绍了`chflags`中的`sappnd`（系统仅追加）和`schg`（系统不可变）标志，作为一种解决方案。\n\n所提出的实现方案包括禁用默认的`newsyslog` cron作业，并为存档日志创建一个专用的`/var/log/archive`目录。然后，将活动日志文件设置为`sappnd`标志，防止修改但允许追加。`/var/log/archive`中的存档日志设置为`schg`标志，使其完全不可变。\n\n为了管理日志轮换，作者介绍了`/etc/rc.securelevel`，这是一个在安全级别提高之前启动时执行的脚本。该脚本删除`sappnd`和`schg`标志，将日志轮换到存档中，然后立即恢复这些标志，确保保持不可变性。此过程无需手动干预即可自动完成，从而增强合规性和安全性。"
  },
  {
    "id": "44570525",
    "title": "The Bitter Lessons Behind Kimi Researcher's Taste",
    "url": "https://medium.com/@xinyijin715/maker-story-the-bitter-lessons-behind-kimi-researchers-ui-6654ec66662c",
    "summary": "Kimi Researcher's article details the challenging, iterative process of creating aesthetically pleasing and functional AI interfaces, moving beyond \"bland\" designs. The journey involved defining a shared aesthetic vision within the team, balancing aesthetics with functionality and data faithfulness, and focusing on user experience.\n\nKey takeaways include:\n\n*   **Anti-Bland Design:** Striving for unique, impactful designs beyond simple replication, inspired by diverse sources like Renaissance art and top-tier publications.\n*   **Team Alignment:** Creating a \"Bland Design Evaluation\" document to standardize aesthetic understanding and ensure team agreement on design principles.\n*   **The Impossible Triangle:** Balancing aesthetics, interaction, and data faithfulness is a constant challenge requiring continuous iteration and compromise.\n*   **Iterative Process:** Experimentation, documentation, and refinement are crucial for achieving the desired balance. Specific prefixes were used to track experiment iterations.\n*   **User Experience Focus:** Incorporating visual elements (charts, diagrams) and interactive features (JS animations, grid layouts with navigation) to enhance engagement and accessibility for deep research users.\n*   **Teamwork Importance:** Collaboration and diverse perspectives are essential for tackling complex challenges, particularly faithfulness evaluation.\n\nThe article emphasizes that design is an evolving process, requiring constant questioning, refining, and collaboration to create truly exceptional and functional experiences. It also highlights the importance of not settling for the normal and continually pushing the boundaries of aesthetics. The team integrated an AI judge tool to help evaluate design decisions, speeding up the process and maintaining accuracy.\n",
    "chinese_title": "Kimi研究员的苦涩品味",
    "chinese_summary": "Kimi研究员的文章详细介绍了创造美观且实用的AI界面所面临的挑战性和迭代过程，力求摆脱“平庸”的设计。 这一过程包括在团队内部定义共同的审美愿景，平衡美学与功能和数据准确性，以及关注用户体验。\n\n主要收获包括：\n\n*   **反平庸设计：** 不满足于简单的复制，努力创造独特且具有冲击力的设计，灵感来源于文艺复兴艺术和顶级出版物等多种来源。\n*   **团队一致性：** 创建“平庸设计评估”文档，以标准化审美理解，并确保团队在设计原则上达成一致。\n*   **不可能的三角：** 平衡美学、交互和数据准确性是一个持续的挑战，需要不断迭代和妥协。\n*   **迭代过程：** 实验、记录和改进对于实现理想的平衡至关重要。 使用特定的前缀来跟踪实验迭代。\n*   **用户体验至上：** 融入视觉元素（图表、示意图）和交互功能（JS动画、带有导航的网格布局），以增强深度研究用户的参与度和可访问性。\n*   **团队合作的重要性：** 协作和不同的视角对于应对复杂的挑战至关重要，特别是准确性评估。\n\n文章强调，设计是一个不断发展的过程，需要不断的质疑、改进和协作，才能创造真正卓越且实用的体验。 它还强调了不满足于现状并不断突破美学界限的重要性。 该团队集成了一个AI评判工具来帮助评估设计决策，从而加快了流程并保持了准确性。"
  },
  {
    "id": "44612313",
    "title": "The Big Oops: Anatomy of a Thirty-Five Year Mistake",
    "url": "https://www.computerenhance.com/p/the-big-oops-anatomy-of-a-thirty",
    "summary": "Casey Muratori discusses his presentation, \"The Big OOPs: Anatomy of a Thirty-Five Year Mistake,\" given at the Better Software Conference. The presentation likely critiques Object-Oriented Programming (OOP), based on the title. He aimed for a runtime under two hours but had to omit details and stories, specifically regarding Smalltalk's development.\n\nMuratori prepared by reviewing extensive source material and expresses interest in sharing more insights through a potential live stream to discuss documents not featured in the talk.\n\nHe recommends four \"histories\" for those wanting to explore the topic further: \"The Early History of Smalltalk\" by Alan Kay, \"A History of C++\" by Bjarne Stroustrup, \"The Development of the Simula Languages\" by Ole-Johan Dahl and Kristen Nygaard, and \"Origins of the APT Language for Automatically Programmed Tools\" by Douglass T. Ross.\n\nHe emphasizes the importance of using specific versions of historical papers, highlighting the existence of multiple scans with varying content (particularly appendices). He notes that the APT language's \"plex\" implementation from 1956 represents the earliest instance he found of programming with highly structured data used to facilitate program operation, not just data warehousing. He encourages anyone with knowledge of earlier examples to contact him.\n",
    "chinese_title": "大乌龙：三十五年错误的剖析",
    "chinese_summary": "Casey Muratori 在 Better Software Conference 上发表了题为“大型 OOPs：三十五年错误的剖析”的演讲，并对此进行了讨论。 根据标题判断，该演讲可能批判了面向对象编程 (OOP)。 他原本希望运行时长在两小时之内，但不得不省略细节和故事，特别是关于 Smalltalk 的发展。\n\nMuratori 通过回顾大量的原始资料进行了准备，并表示有兴趣通过潜在的直播来分享更多见解，以讨论演讲中未提及的文件。\n\n他为那些想进一步探索该主题的人推荐了四部“历史”著作：Alan Kay 的《Smalltalk 的早期历史》、Bjarne Stroustrup 的《C++ 的历史》、Ole-Johan Dahl 和 Kristen Nygaard 的《Simula 语言的发展》以及 Douglass T. Ross 的《自动编程工具 APT 语言的起源》。\n\n他强调了使用历史论文的特定版本的重要性，并强调存在内容各异的多种扫描版本（尤其是附录）。 他指出，1956 年 APT 语言的“plex”实现是他发现的最早的编程实例，其中使用高度结构化的数据来促进程序运行，而不仅仅是数据仓库。 他鼓励任何知道更早例子的人与他联系。"
  },
  {
    "id": "44604050",
    "title": "lsr: ls with io_uring",
    "url": "https://rockorager.dev/log/lsr-ls-but-with-io-uring/",
    "summary": "The author created `lsr`, a custom implementation of the `ls` command that leverages the `io_uring` interface for optimized I/O operations. `lsr` significantly outperforms standard `ls` and other alternatives like `eza`, `lsd`, and `uutils ls` in both execution time and the number of syscalls made. Benchmarks show `lsr` being consistently faster, especially with larger directories, and using an order of magnitude fewer syscalls.\n\n`lsr` achieves this by utilizing `io_uring` for all possible I/O operations, including opening directories, reading user/group data, and performing `stat` calls. It also employs a `StackFallbackAllocator` with a 1MB pre-allocation to minimize `mmap` calls, further reducing syscall overhead. Furthermore, `lsr` avoids dynamic linking and related libc overhead.\n\nThe author notes that a significant portion of `lsr`'s runtime is spent on sorting, indicating potential areas for further optimization. They were surprised by the high number of `clock_gettime` calls made by `lsd`. The author uses tangled.sh and invites bug reports and changes through the repo.\n",
    "chinese_title": "lsr: 使用io_uring的ls",
    "chinese_summary": "作者创建了`lsr`，一个利用`io_uring`接口优化I/O操作的自定义`ls`命令实现。`lsr`在执行时间和系统调用次数方面均显著优于标准`ls`以及其他替代方案，如`eza`、`lsd`和`uutils ls`。基准测试表明，`lsr`始终更快，尤其是在处理大型目录时，并且系统调用次数减少了一个数量级。\n\n`lsr`通过为所有可能的I/O操作（包括打开目录、读取用户/组数据和执行`stat`调用）使用`io_uring`来实现这一点。它还采用了一个带有1MB预分配的`StackFallbackAllocator`来最大限度地减少`mmap`调用，进一步降低了系统调用开销。此外，`lsr`避免了动态链接和相关的libc开销。\n\n作者指出，`lsr`的大部分运行时间都花在了排序上，这表明存在进一步优化的潜力。他们对`lsd`发出的`clock_gettime`调用次数之多感到惊讶。作者使用tangled.sh，并欢迎通过该仓库提交错误报告和更改。"
  },
  {
    "id": "44608295",
    "title": "Cancer DNA is detectable in blood years before diagnosis",
    "url": "https://www.sciencenews.org/article/cancer-tumor-dna-blood-test-screening",
    "summary": "This article discusses a study published in Cancer Discovery that found cancer DNA can be detected in a person's blood years before a diagnosis. Researchers at Johns Hopkins University School of Medicine were able to identify tumor DNA in blood samples collected from participants up to three years prior to their cancer diagnosis.\n\nUsing whole genome sequencing, the team identified cancer-specific alterations in the human genome, even in small, decades-old blood samples. The ability to detect these traces so early could revolutionize cancer screening and treatment, potentially offering more treatment options and significantly improving patient outcomes.\n\nThe early detection relies on the fact that tumor cells shed DNA fragments into the bloodstream, although finding these fragments early on is challenging due to their low concentration. While the current study was a proof of concept, the results are promising and warrant further investigation.\n\nWilliam Grady from Fred Hutchinson Cancer Center views this as a significant step towards future cancer treatment, envisioning therapies that eliminate precancerous cells detected through early DNA screening. However, he stresses the need for validation in a larger population, which is currently being pursued by Wang's team.\n",
    "chinese_title": "癌症DNA在确诊前数年即可在血液中检测到",
    "chinese_summary": "癌症发现：在诊断前数年即可在血液中检测到癌细胞DNA"
  },
  {
    "id": "44608275",
    "title": "How I keep up with AI progress",
    "url": "https://blog.nilenso.com/blog/2025/06/23/how-i-keep-up-with-ai-progress/",
    "summary": "Atharva Raykar's article outlines a strategy for staying informed about the rapidly evolving field of generative AI, emphasizing the importance of avoiding misinformation by focusing on primary sources and trustworthy commentators. He cautions against both underestimating and overestimating AI capabilities, urging readers to cultivate a solid understanding of the technology.\n\nRaykar's information pipeline begins with **Simon Willison's Blog** as a central hub, highlighting its commentary on AI capabilities, applications, and ethical considerations. He also recommends following **Andrej Karpathy** for insights into AI model internals. **Every's Chain of Thought** is suggested for practical applications and \"vibe checks\" of model capabilities.\n\nA core principle is to prioritize **official announcements, blogs, and papers from AI labs** like OpenAI, Google DeepMind, and Anthropic, bypassing secondhand interpretations. He stresses that personal experience putting AI into production trumps even official recommendations.\n\nRaykar provides a curated list of **high-signal individuals** actively contributing to the AI Engineering ecosystem, offering detailed insights on topics like evals, RAG, AI tooling, and building AI systems in production. Key figures include Hamel Husain, Shreya Shankar, Jason Liu, Eugene Yan, Chip Huyen, and several others.\n\nFor news and media, Raykar recommends **Twitter/X**, noting its value despite its potential toxicity, and suggests **Shawn Wang (swyx)** or his AI news site **smol.ai** as an alternative for those avoiding Twitter. He also mentions the **Dwarkesh Patel podcast** as a good source.\n\nFinally, he highlights more esoteric sources like **LessWrong/AI Alignment Forum** and **Gwern** for deeper dives into AI alignment, governance, and technical discussions. He also touches on the work of \"prompt whisperers\" exploring LLM behaviors.\n",
    "chinese_title": "我如何跟上人工智能的进展",
    "chinese_summary": "Atharva Raykar 的文章概述了一种策略，用于随时了解快速发展的生成式人工智能领域，强调通过关注主要来源和值得信赖的评论员来避免虚假信息的重要性。他告诫不要低估或高估人工智能的能力，敦促读者培养对该技术的扎实理解。\n\nRaykar 的信息管道以 **Simon Willison's Blog** 为中心，重点介绍了其对人工智能能力、应用和伦理考量的评论。他还建议关注 **Andrej Karpathy**，以了解人工智能模型内部的见解。建议使用 **Every's Chain of Thought** 来了解模型的实际应用和“氛围检查”。\n\n一个核心原则是优先考虑 **来自 OpenAI、Google DeepMind 和 Anthropic 等人工智能实验室的官方公告、博客和论文**，绕过二手解读。他强调，将人工智能投入生产的个人经验甚至胜过官方建议。\n\nRaykar 提供了一份经过筛选的 **高价值人士** 名单，这些人都在积极为人工智能工程生态系统做出贡献，提供有关评估、RAG、人工智能工具以及在生产中构建人工智能系统等主题的详细见解。主要人物包括 Hamel Husain、Shreya Shankar、Jason Liu、Eugene Yan、Chip Huyen 等。\n\n对于新闻和媒体，Raykar 推荐 **Twitter/X**，尽管它具有潜在的毒性，但他指出它的价值，并建议 **Shawn Wang (swyx)** 或他的 AI 新闻网站 **smol.ai** 作为避免使用 Twitter 的替代方案。他还提到 **Dwarkesh Patel 的播客** 是一个很好的来源。\n\n最后，他强调了更深奥的来源，例如 **LessWrong/AI Alignment Forum** 和 **Gwern**，以更深入地研究人工智能对齐、治理和技术讨论。他还提到了探索 LLM 行为的“提示工程师”的工作。"
  },
  {
    "id": "44566673",
    "title": "Benben: An audio player for the terminal, written in Common Lisp",
    "url": "https://chiselapp.com/user/MistressRemilia/repository/benben/home",
    "summary": "Benben is a command-line audio player and converter for Linux and Unix-like systems, known for its speed, efficiency, and oldschool-inspired interface. It supports a variety of audio formats, including VGM, MP3, Ogg Vorbis, FLAC, MIDI, and module formats. It's designed for users who prefer terminal-based interfaces and organize their music in folders.\n\nThe latest release is v0.6.1, but version 0.7.0 is under development, representing a complete rewrite in Common Lisp. Previous versions were written in Crystal.\n\nKey features include ALSA, libout123, and libao backends, high-performance playback, a fast multi-threaded S-Lang UI, looping, TCP output, playlist support (XSPF, JSPF), high-quality resampling, and a powerful configuration file system. It also offers parallel audio rendering to WAV or Au, customizable VU meter, keyboard control, ReplayGain support, remote control capabilities, and ListenBrainz integration. Optional effects include soft clipping, parametric EQ, stereo enhancement, reverb, and a DC offset filter.\n\nThe program is primarily developed and maintained by Remilia Scarlet, who welcomes support via Ko-Fi or Liberapay. Contributions are encouraged through the Fossil repository, with instructions provided for branching, bundling changes, and contacting Remilia. Benben is licensed under the GNU Affero General Public License version 3.\n",
    "chinese_title": "奔奔：一个用 Common Lisp 编写的终端音频播放器",
    "chinese_summary": "Benben：Linux和类Unix系统的命令行音频播放器和转换器，以其速度、效率和老式风格界面而闻名。它支持多种音频格式，包括VGM、MP3、Ogg Vorbis、FLAC、MIDI和模块格式。它专为喜欢基于终端的界面并在文件夹中组织音乐的用户而设计。\n\n最新版本是v0.6.1，但0.7.0版本正在开发中，它代表了用Common Lisp进行的完全重写。以前的版本是用Crystal编写的。\n\n主要功能包括ALSA、libout123和libao后端、高性能播放、快速多线程S-Lang UI、循环播放、TCP输出、播放列表支持（XSPF、JSPF）、高质量重采样和强大的配置文件系统。它还提供并行音频渲染到WAV或Au、可定制的VU表、键盘控制、ReplayGain支持、远程控制功能和ListenBrainz集成。可选效果包括软削波、参数均衡器、立体声增强、混响和直流偏移滤波器。\n\n该程序主要由Remilia Scarlet开发和维护，她欢迎通过Ko-Fi或Liberapay提供支持。鼓励通过Fossil存储库进行贡献，并提供有关分支、捆绑更改和联系Remilia的说明。Benben根据GNU Affero通用公共许可证第3版获得许可。"
  },
  {
    "id": "44608622",
    "title": "Replication of Quantum Factorisation Records with a VIC-20, an Abacus, and a Dog",
    "url": "https://eprint.iacr.org/2025/1237",
    "summary": "This preprint, published in the Cryptology ePrint Archive, humorously claims that Peter Gutmann of the University of Auckland and Stephan Neuhaus of Zurich University of Applied Sciences have successfully replicated and even exceeded current quantum factorization records using unconventional computing methods: a VIC-20 8-bit home computer, an abacus, and a dog.\n\nThe authors state that their work aims to inspire future efforts in matching any potential quantum factorization advancements. The paper title and abstract are clearly satirical, suggesting a critique of the hype or perceived lack of progress in practical quantum computation. While the abstract mentions revisions clarifying the use of sqrt(n) for factorization, this could further contribute to the humorous intent, implying a trivial approach to a complex problem.\n\nThe paper is categorized under \"Attacks and cryptanalysis\" and keywords include \"pqc\" (post-quantum cryptography) and \"quantum factorisation,\" implying a potential commentary on the security threats posed by quantum computing to existing cryptographic algorithms and the need for post-quantum alternatives. The availability of the paper as a PDF and the inclusion of BibTeX information suggest a level of academic formality, perhaps as a vehicle for delivering its satirical message.\n",
    "chinese_title": "用VIC-20、算盘和狗复制量子因式分解记录",
    "chinese_summary": "这篇预印本发表于密码学电子预印本库，幽默地宣称奥克兰大学的Peter Gutmann和苏黎世应用科技大学的Stephan Neuhaus已成功复制甚至超越了当前的量子分解记录，他们使用的非常规计算方法包括：一台VIC-20 8位家用电脑、一个算盘和一条狗。\n\n作者声明他们的工作旨在激励未来在匹配任何潜在量子分解进展方面的努力。论文标题和摘要显然是讽刺性的，暗示了对量子计算炒作或缺乏实际进展的批评。虽然摘要提到修订说明了使用sqrt(n)进行分解，但这可能进一步增加了幽默意图，暗示以一种微不足道的方法解决复杂问题。\n\n该论文被归类为“攻击和密码分析”，关键词包括“pqc”（后量子密码学）和“量子分解”，这意味着可能评论量子计算对现有密码算法构成的安全威胁以及对后量子替代方案的需求。该论文以PDF格式提供，并包含BibTeX信息，表明具有一定程度的学术规范性，或许是为了传递其讽刺信息的载体。"
  },
  {
    "id": "44617022",
    "title": "Trump to sign stablecoin bill that may make it easier to bribe the president",
    "url": "https://arstechnica.com/tech-policy/2025/07/stablecoin-bill-heads-to-trumps-desk-without-blocks-on-presidential-grifting/",
    "summary": "Donald Trump is poised to sign the GENIUS Act, a bill establishing a federal framework for stablecoins, marking his first major crypto-related legislative victory. While proponents claim it will spur wider cryptocurrency adoption, critics like Rep. Maxine Waters warn it lacks consumer protections and could facilitate corruption, particularly by allowing the President to benefit from crypto ventures without restrictions.\n\nThe GENIUS Act requires stablecoin issuers to publish monthly reserves and annual statements, but concerns remain that companies could peg stablecoins to risky assets, potentially harming investors. Consumer advocates are concerned about \"bank-like activities\" without similar oversight.\n\nOther cryptocurrency legislation, including the CLARITY Act (aiming to shift regulatory power from the SEC to the CFTC) and a bill banning a central bank digital currency, face significant hurdles in the Senate. Analysts predict these bills are unlikely to pass, suggesting the GENIUS Act may be the last crypto win for some time. Waters warns the bill allows Trump to personally profit while potentially triggering a financial crisis. The article also notes potential conflicts of interest due to Trump family involvement in crypto ventures.\n",
    "chinese_title": "特朗普将签署稳定币法案，这或将使贿赂总统变得更容易。",
    "chinese_summary": "特朗普即将签署《天才法案》，该法案为稳定币建立联邦框架，标志着他在加密货币相关立法方面取得的首个重大胜利。支持者声称这将刺激加密货币的更广泛采用，但像众议员玛克辛·沃特斯这样的批评者警告说，该法案缺乏消费者保护，并可能助长腐败，特别是允许总统不受限制地从加密货币风险投资中获利。《天才法案》要求稳定币发行商公布月度储备和年度报表，但人们仍然担心公司可能会将稳定币与高风险资产挂钩，从而可能损害投资者。消费者权益倡导者担心在缺乏类似监督的情况下出现“类似银行的活动”。包括《清晰法案》（旨在将监管权力从美国证券交易委员会转移到商品期货交易委员会）和一项禁止央行数字货币的法案在内的其他加密货币立法，在参议院面临重大障碍。分析人士预测这些法案不太可能获得通过，这表明《天才法案》可能是近期内加密货币领域的最后一次胜利。沃特斯警告说，该法案允许特朗普个人获利，同时可能引发金融危机。文章还指出，由于特朗普家族参与加密货币风险投资，可能存在利益冲突。"
  },
  {
    "id": "44610732",
    "title": "EPA says it will eliminate its scientific research arm",
    "url": "https://www.nytimes.com/2025/07/18/climate/epa-firings-scientific-research.html",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "环保署称将取消其科学研究部门。",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "44614043",
    "title": "OpenAI claiming gold medal standard at IMO 2025",
    "url": "https://github.com/aw31/openai-imo-2025-proofs",
    "summary": "This brief article announces that OpenAI has an experimental reasoning Language Learning Model (LLM) being evaluated on the 2025 International Math Olympiad (IMO). The core claim implied, given the title, is that OpenAI believes their LLM is capable of performing at a gold medal standard at the IMO. The repository mentioned houses the proofs generated by the LLM during this evaluation. This indicates that OpenAI is likely using the IMO as a benchmark to assess the LLM's mathematical reasoning abilities and its potential to solve complex mathematical problems. The availability of the proofs suggests transparency and a willingness to share their methodology and results with the broader research community. The focus on proofs highlights the importance of logical deduction and rigorous mathematical argumentation in evaluating the LLM's performance, rather than simply providing correct answers.\n",
    "chinese_title": "OpenAI声称将在2025年国际数学奥林匹克竞赛中获得金牌标准",
    "chinese_summary": "OpenAI评估实验性推理LLM挑战2025国际数学奥林匹克竞赛，并公开证明过程。"
  },
  {
    "id": "44603066",
    "title": "CP/M creator Gary Kildall's memoirs released as free download",
    "url": "https://spectrum.ieee.org/cpm-creator-gary-kildalls-memoirs-released-as-free-download",
    "summary": "This article announces the release of CP/M creator Gary Kildall's memoirs as a free download. It highlights Kildall's pioneering role in technology and suggests his story exemplifies the spirit of early start-up culture. The article provides context by mentioning the author, Tekla S. Perry, a former IEEE Spectrum editor, and including a photo credit. The key takeaway is the availability of Kildall's memoirs, offering insights into the life and work of the influential figure behind CP/M.\n",
    "chinese_title": "CP/M 创始人盖瑞·基尔代尔回忆录免费下载",
    "chinese_summary": "本文宣布 CP/M 创始人盖瑞·基尔代尔的回忆录可供免费下载。文章强调了基尔代尔在技术领域的先锋作用，并认为他的故事体现了早期创业文化精神。文章还提到了作者，前 IEEE Spectrum 编辑 Tekla S. Perry，并包含照片来源信息。重点是基尔代尔的回忆录现已发布，让人们可以深入了解 CP/M 背后的这位有影响力人物的生活和工作。"
  },
  {
    "id": "44611692",
    "title": "We do not break userspace (2012)",
    "url": "https://lore.kernel.org/all/CA+55aFy98A+LJK4+GWMcbzaa1zsPBRo76q+ioEjbx-uaMKH6Uw@mail.gmail.com/",
    "summary": "This page explains why a website uses the Anubis security system. Anubis is a Proof-of-Work (PoW) system designed to prevent AI companies from excessively scraping the website, which can cause downtime and resource inaccessibility for regular users. It acts as a temporary solution while more sophisticated methods, such as fingerprinting headless browsers (e.g., through font rendering analysis), are developed to distinguish legitimate users from scrapers.\n\nAnubis aims to make scraping more computationally expensive for AI companies by requiring users to perform a small amount of work (similar to Hashcash) before accessing the site. While the individual load is minimal, it becomes significant at the scale of mass scraping.\n\nThe system necessitates JavaScript to function because AI companies have fundamentally altered website hosting dynamics. Users might need to disable privacy-focused browser extensions like JShelter to pass the Anubis challenge. The page also indicates that a no-JavaScript solution is under development. The current version of Anubis is 1.20.0.\n",
    "chinese_title": "我们不破坏用户空间（2012）",
    "chinese_summary": "本页解释了网站使用 Anubis 安全系统的原因。Anubis 是一种工作量证明 (PoW) 系统，旨在防止人工智能公司过度抓取网站，这可能导致普通用户出现停机和资源无法访问的情况。它是一种临时解决方案，同时也在开发更复杂的方法，例如通过字体渲染分析来指纹识别无头浏览器，从而区分合法用户和抓取工具。\n\nAnubis 旨在通过要求用户在访问网站之前执行少量工作（类似于 Hashcash），使人工智能公司的抓取行为在计算上更加昂贵。虽然个人负载很小，但在大规模抓取时会变得非常显著。\n\n该系统需要 JavaScript 才能运行，因为人工智能公司从根本上改变了网站托管的动态。用户可能需要禁用诸如 JShelter 等注重隐私的浏览器扩展程序才能通过 Anubis 挑战。该页面还表明正在开发一种无 JavaScript 的解决方案。当前 Anubis 版本为 1.20.0。"
  },
  {
    "id": "44571549",
    "title": "HathiTrust Digital Library",
    "url": "https://www.hathitrust.org/",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "哈提信托数字图书馆",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "44601023",
    "title": "Fully homomorphic encryption and the dawn of a private internet",
    "url": "https://bozmen.io/fhe",
    "summary": "This article explores Fully Homomorphic Encryption (FHE) and its potential to revolutionize internet privacy. FHE allows computations to be performed on encrypted data without decryption, ensuring data remains private \"in use,\" addressing a critical vulnerability in current security models.\n\nWhile FHE isn't widely adopted due to performance overhead (1,000x-10,000x slower than plaintext operations), its speed is improving exponentially, roughly 8x faster each year, reminiscent of Moore's Law. This \"Moore's Law of FHE\" suggests an impending inflection point where FHE becomes practical for applications like encrypted cloud computing, LLM inference, and confidential smart contracts.\n\nThe article details how FHE works, focusing on lattice-based cryptography and concepts like Learning With Errors (LWE) to maintain quantum-resistance. It explains the challenges of noise management during homomorphic operations and highlights \"bootstrapping\" as a solution to refresh ciphertexts and enable unlimited computations. Relinearization and modulus switching are also introduced as techniques to manage ciphertext complexity and noise.\n\nThe piece differentiates between partial, somewhat, and fully homomorphic encryption, providing a Paillier example to illustrate additive homomorphism. Ultimately, the article argues that FHE could shift the internet from a \"spy by default\" paradigm to a \"privacy by default\" one, obsoleting business models reliant on user data harvesting.\n",
    "chinese_title": "Fully homomorphic encryption and the dawn of a private internet",
    "chinese_summary": "This article explores Fully Homomorphic Encryption (FHE) and its potential to revolutionize internet privacy. FHE allows computations to be performed on encrypted data without decryption, ensuring data remains private \"in use,\" addressing a critical vulnerability in current security models.\n\nWhile FHE isn't widely adopted due to performance overhead (1,000x-10,000x slower than plaintext operations), its speed is improving exponentially, roughly 8x faster each year, reminiscent of Moore's Law. This \"Moore's Law of FHE\" suggests an impending inflection point where FHE becomes practical for applications like encrypted cloud computing, LLM inference, and confidential smart contracts.\n\nThe article details how FHE works, focusing on lattice-based cryptography and concepts like Learning With Errors (LWE) to maintain quantum-resistance. It explains the challenges of noise management during homomorphic operations and highlights \"bootstrapping\" as a solution to refresh ciphertexts and enable unlimited computations. Relinearization and modulus switching are also introduced as techniques to manage ciphertext complexity and noise.\n\nThe piece differentiates between partial, somewhat, and fully homomorphic encryption, providing a Paillier example to illustrate additive homomorphism. Ultimately, the article argues that FHE could shift the internet from a \"spy by default\" paradigm to a \"privacy by default\" one, obsoleting business models reliant on user data harvesting.\n"
  },
  {
    "id": "44609732",
    "title": "eslint-config-prettier npm package compromised",
    "url": "https://www.stepsecurity.io/blog/supply-chain-security-alert-eslint-config-prettier-package-shows-signs-of-compromise",
    "summary": "生成摘要时出错",
    "chinese_title": "eslint-config-prettier npm package compromised",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44610130",
    "title": "Teufel Mynd open source / open hardware Bluetooth speaker",
    "url": "https://lu.teufelaudio.com/mynd-107002004",
    "summary": "生成摘要时出错",
    "chinese_title": "Teufel Mynd open source / open hardware Bluetooth speaker",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44570089",
    "title": "How to Get Foreign Keys Horribly Wrong",
    "url": "https://hakibenita.com/django-foreign-keys",
    "summary": "生成摘要时出错",
    "chinese_title": "How to Get Foreign Keys Horribly Wrong",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44569684",
    "title": "Cats as Horror Movie Villains",
    "url": "https://gwern.net/cat-horror",
    "summary": "生成摘要时出错",
    "chinese_title": "Cats as Horror Movie Villains",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44615677",
    "title": "How a Florida Pension Fund manager produced 50 years of market-beating returns",
    "url": "https://www.barrons.com/articles/florida-pension-plan-50-years-of-market-beating-returns-b9f78df9",
    "summary": "生成摘要时出错",
    "chinese_title": "How a Florida Pension Fund manager produced 50 years of market-beating returns",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44603267",
    "title": "Psilocybin decreases depression and anxiety in cancer patients (2016)",
    "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC5367557/",
    "summary": "生成摘要时出错",
    "chinese_title": "Psilocybin decreases depression and anxiety in cancer patients (2016)",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44569019",
    "title": "Inspect ANSI control codes and escape sequences",
    "url": "https://ansi.tools",
    "summary": "生成摘要时出错",
    "chinese_title": "Inspect ANSI control codes and escape sequences",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44573287",
    "title": "The Halo Effect",
    "url": "https://kwokchain.com/2025/07/15/the-halo-effect/",
    "summary": "生成摘要时出错",
    "chinese_title": "光环效应",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44568761",
    "title": "15 Years of Building Jefit",
    "url": "https://www.jefit.com/our-story",
    "summary": "Ying, the founder of Jefit, recounts the company's 15-year journey from a personal project to a workout tracking platform with over 13 million users. Started in his dad's living room to solve his own workout accountability issues, Jefit evolved into a social workout platform driven by user feedback. After incorporating in 2010, the company bootstrapped its growth with a small team, focusing on providing valuable tools for purposeful training.\n\nA significant turning point was the decision to relocate to Silicon Valley to find the right talent, a difficult process that took two years. The core team values training, quality, and discipline, fostering a culture of continuous improvement and user-centric development.\n\nYing acknowledges challenges like COVID lockdowns, rejections from VCs, and product missteps that led to engineering debt. However, user loyalty motivated them to improve.\n\nLooking ahead, Jefit is focusing on platform modernization, including a refreshed mobile app, improved logging, progress reports, goal-setting tools, and AI-driven features, all while maintaining a focus on quality control. Ying expresses gratitude to the Jefit community, highlighting their consistency and dedication. The article concludes with a message of encouragement and continued commitment to the power of long-term effort, not just for lifters, but anyone committed to self-improvement.\n",
    "chinese_title": "15 Years of Building Jefit",
    "chinese_summary": "Ying, the founder of Jefit, recounts the company's 15-year journey from a personal project to a workout tracking platform with over 13 million users. Started in his dad's living room to solve his own workout accountability issues, Jefit evolved into a social workout platform driven by user feedback. After incorporating in 2010, the company bootstrapped its growth with a small team, focusing on providing valuable tools for purposeful training.\n\nA significant turning point was the decision to relocate to Silicon Valley to find the right talent, a difficult process that took two years. The core team values training, quality, and discipline, fostering a culture of continuous improvement and user-centric development.\n\nYing acknowledges challenges like COVID lockdowns, rejections from VCs, and product missteps that led to engineering debt. However, user loyalty motivated them to improve.\n\nLooking ahead, Jefit is focusing on platform modernization, including a refreshed mobile app, improved logging, progress reports, goal-setting tools, and AI-driven features, all while maintaining a focus on quality control. Ying expresses gratitude to the Jefit community, highlighting their consistency and dedication. The article concludes with a message of encouragement and continued commitment to the power of long-term effort, not just for lifters, but anyone committed to self-improvement.\n"
  },
  {
    "id": "44595492",
    "title": "ChatGPT agent: bridging research and action",
    "url": "https://openai.com/index/introducing-chatgpt-agent/",
    "summary": "生成摘要时出错",
    "chinese_title": "ChatGPT agent: bridging research and action",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44594156",
    "title": "Mistral Releases Deep Research, Voice, Projects in Le Chat",
    "url": "https://mistral.ai/news/le-chat-dives-deep",
    "summary": "生成摘要时出错",
    "chinese_title": "Mistral Releases Deep Research, Voice, Projects in Le Chat",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44608431",
    "title": "Winaero Tweaker: All-in-one app for tuning Windows",
    "url": "https://winaerotweaker.com/",
    "summary": "生成摘要时出错",
    "chinese_title": "Winaero Tweaker: All-in-one app for tuning Windows",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44615695",
    "title": "Evaluating publicly available LLMs on IMO 2025",
    "url": "https://matharena.ai/imo/",
    "summary": "生成摘要时出错",
    "chinese_title": "Evaluating publicly available LLMs on IMO 2025",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44572068",
    "title": "Show HN: Simulating autonomous drone formations",
    "url": "https://github.com/sushrut141/ketu",
    "summary": "生成摘要时出错",
    "chinese_title": "Show HN: Simulating autonomous drone formations",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44606646",
    "title": "LibreOffice slams Microsoft for locking in Office users w/ complex file formats",
    "url": "https://www.neowin.net/news/libreoffice-calls-out-microsoft-for-using-complex-file-formats-to-lock-in-office-users/",
    "summary": "生成摘要时出错",
    "chinese_title": "LibreOffice slams Microsoft for locking in Office users w/ complex file formats",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44561516",
    "title": "Hundred Rabbits – Low-tech living while sailing the world",
    "url": "https://100r.co/site/home.html",
    "summary": "生成摘要时出错",
    "chinese_title": "Hundred Rabbits – Low-tech living while sailing the world",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44608840",
    "title": "Show HN: I built library management app for those who outgrew spreadsheets",
    "url": "https://www.librari.io/",
    "summary": "生成摘要时出错",
    "chinese_title": "Show HN: I built library management app for those who outgrew spreadsheets",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44580941",
    "title": "Fibonacci(50) as a Fractal Sequence Diagram",
    "url": "https://app.ilograph.com/demo.ilograph.Fibonacci%2520Sequence/Fib(50)",
    "summary": "生成摘要时出错",
    "chinese_title": "Fibonacci(50) as a Fractal Sequence Diagram",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44612736",
    "title": "The Great Unracking: Saying goodbye to the servers at our physical datacenter",
    "url": "https://stackoverflow.blog/2025/07/16/the-great-unracking-saying-goodbye-to-the-servers-at-our-physical-datacenter/",
    "summary": "生成摘要时出错",
    "chinese_title": "The Great Unracking: Saying goodbye to the servers at our physical datacenter",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44569278",
    "title": "TCP-in-UDP Solution (eBPF)",
    "url": "https://blog.mptcp.dev/2025/07/14/TCP-in-UDP.html",
    "summary": "生成摘要时出错",
    "chinese_title": "TCP-in-UDP Solution (eBPF)",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44573731",
    "title": "Show HN: Mochi Invaders – Like Space Invaders but for Practicing Japanese Kana",
    "url": "https://xenodium.com/mochi-invaders-now-on-the-app-store",
    "summary": "生成摘要时出错",
    "chinese_title": "Show HN: Mochi Invaders – Like Space Invaders but for Practicing Japanese Kana",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44600594",
    "title": "NIH is cheaper than the wrong dependency",
    "url": "https://lewiscampbell.tech/blog/250718.html",
    "summary": "生成摘要时出错",
    "chinese_title": "NIH is cheaper than the wrong dependency",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44561895",
    "title": "Extending That XOR Trick to Billions of Rows",
    "url": "https://nochlin.com/blog/extending-that-xor-trick",
    "summary": "生成摘要时出错",
    "chinese_title": "Extending That XOR Trick to Billions of Rows",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44599549",
    "title": "My favorite use-case for AI is writing logs",
    "url": "https://newsletter.vickiboykis.com/archive/my-favorite-use-case-for-ai-is-writing-logs/",
    "summary": "生成摘要时出错",
    "chinese_title": "My favorite use-case for AI is writing logs",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44568594",
    "title": "DIY Telescope Mods That Transformed My Astrophotography",
    "url": "https://www.youtube.com/watch?v=Efmzr_K4ApQ",
    "summary": "生成摘要时出错",
    "chinese_title": "DIY Telescope Mods That Transformed My Astrophotography",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44563867",
    "title": "Row Polymorphic Programming",
    "url": "https://www.stranger.systems/posts/by-slug/row-polymorphic-programming.html",
    "summary": "生成摘要时出错",
    "chinese_title": "Row Polymorphic Programming",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44593441",
    "title": "Converting Integers to Floats Using Hyperfocus (2022)",
    "url": "https://blog.m-ou.se/floats/",
    "summary": "This article recounts the author's humorous and determined journey to create a faster `u128` to `f64` conversion than the built-in Rust compiler (Rustc). Initially, the author, spurred by a pull request review, implemented a custom conversion using bit manipulation and `f64::from_bits`, bypassing the inefficient string-based conversion.\n\nThe author details the process, including fixing bugs related to edge cases like zero, refining rounding, and simplifying the bit-twiddling code. The \"trick\" was to manually calculate the floating point representation's sign, exponent and mantissa and construct the f64 from that. The author then realised that a simpler `x as f64` already existed, triggering a pursuit for performance gains out of spite and to \"prove\" it was fun.\n\nThe article then explains the IEEE 754 binary64 standard, breaking down the f64 bit structure into sign, exponent, and mantissa, and how these components represent floating-point values.\n\nThe author then details the steps of their implementation, including handling the zero edge case, calculating the exponent, extracting the mantissa, and implementing proper rounding to adhere to the IEEE 754 standard, which involves checking the \"dropped bits\" to decide whether to round up or down, and also implement \"round to even\" for tie-breaking. Finally, the author simplifies the code for conciseness, resulting in a refined, potentially faster, conversion.\n",
    "chinese_title": "Converting Integers to Floats Using Hyperfocus (2022)",
    "chinese_summary": "This article recounts the author's humorous and determined journey to create a faster `u128` to `f64` conversion than the built-in Rust compiler (Rustc). Initially, the author, spurred by a pull request review, implemented a custom conversion using bit manipulation and `f64::from_bits`, bypassing the inefficient string-based conversion.\n\nThe author details the process, including fixing bugs related to edge cases like zero, refining rounding, and simplifying the bit-twiddling code. The \"trick\" was to manually calculate the floating point representation's sign, exponent and mantissa and construct the f64 from that. The author then realised that a simpler `x as f64` already existed, triggering a pursuit for performance gains out of spite and to \"prove\" it was fun.\n\nThe article then explains the IEEE 754 binary64 standard, breaking down the f64 bit structure into sign, exponent, and mantissa, and how these components represent floating-point values.\n\nThe author then details the steps of their implementation, including handling the zero edge case, calculating the exponent, extracting the mantissa, and implementing proper rounding to adhere to the IEEE 754 standard, which involves checking the \"dropped bits\" to decide whether to round up or down, and also implement \"round to even\" for tie-breaking. Finally, the author simplifies the code for conciseness, resulting in a refined, potentially faster, conversion.\n"
  },
  {
    "id": "44568147",
    "title": "A look at IBM's short-lived \"butterfly\" ThinkPad 701 of 1995",
    "url": "https://www.fastcompany.com/91356463/ibm-thinkpad-701-butterfly-keyboard",
    "summary": "生成摘要时出错",
    "chinese_title": "A look at IBM's short-lived \"butterfly\" ThinkPad 701 of 1995",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44595824",
    "title": "Run TypeScript code without worrying about configuration",
    "url": "https://tsx.is/",
    "summary": "生成摘要时出错",
    "chinese_title": "Run TypeScript code without worrying about configuration",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44608170",
    "title": "Third patient dies from acute liver failure caused by a Sarepta gene therapy",
    "url": "https://www.biocentury.com/article/656520/third-death-from-a-sarepta-gene-therapy",
    "summary": "生成摘要时出错",
    "chinese_title": "Third patient dies from acute liver failure caused by a Sarepta gene therapy",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44566510",
    "title": "The Art of Roland-Garros",
    "url": "https://www.garros.gallery/",
    "summary": "生成摘要时出错",
    "chinese_title": "The Art of Roland-Garros",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44607740",
    "title": "Firefox-patch-bin, librewolf-fix-bin AUR packages contain malware",
    "url": "https://lists.archlinux.org/archives/list/aur-general@lists.archlinux.org/thread/7EZTJXLIAQLARQNTMEW2HBWZYE626IFJ/",
    "summary": "生成摘要时出错",
    "chinese_title": "Firefox-patch-bin, librewolf-fix-bin AUR packages contain malware",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "44605873",
    "title": "In the long run, GPL code becomes irrelevant (2015)",
    "url": "https://josephg.com/blog/in-the-long-run-gpl-code-becomes-irrelevant/",
    "summary": "生成摘要时出错",
    "chinese_title": "In the long run, GPL code becomes irrelevant (2015)",
    "chinese_summary": "生成摘要时出错"
  }
]