[
  {
    "id": "43744591",
    "title": "Things Zig Comptime Won't Do",
    "url": "https://matklad.github.io/2025/04/19/things-zig-comptime-wont-do.html",
    "summary": "This article, \"Things Zig Comptime Won't Do,\" highlights the intentional restrictions of Zig's comptime feature, arguing that these limitations contribute to its elegance and ease of use despite being expressive.\n\nThe author emphasizes that comptime code in Zig avoids \"host leakage\" by emulating the target architecture, unlike some languages where compile-time code runs on the host, potentially leading to inconsistencies. Zig also lacks a mechanism similar to \"#eval\" or dynamic source code generation found in languages like D and Rust. Instead, Zig relies on partial evaluation and specialization via the `comptime` keyword, which requires compile-time knowledge of certain parameters.\n\nThe article further points out that Zig's meta-programming system doesn't allow for custom syntax or DSLs directly within the language's syntax. While custom syntax can be achieved via strings. Zig also eschews runtime type information (RTTI), requiring complete specialization of type meta-programming at compile time.\n\nCritically, Zig doesn't allow adding methods to generated types, meaning APIs for custom types must be hand-written. Lastly, comptime operations are completely isolated, prohibiting any input/output (IO) operations, ensuring hermetic, reproducible, and safe compilation. The author concludes that these limitations, while restrictive, make Zig's meta-programming features more manageable and predictable. Any build-time operations that require IO, like database interactions, can be handled by Zig's build system.\n",
    "chinese_title": "Zig编译时不会做的事",
    "chinese_summary": "本文《Zig编译时不会做的事》强调了Zig编译时特性有意设置的限制，认为这些限制尽管具有表现力，但有助于其优雅性和易用性。\n\n作者强调，Zig中的编译时代码通过模拟目标架构来避免“宿主泄漏”，这与其他一些语言的编译时代码在宿主机上运行、可能导致不一致的情况不同。Zig也缺乏类似于D和Rust等语言中的“#eval”或动态源码生成机制。相反，Zig依赖于通过`comptime`关键字进行的部分求值和特化，这需要某些参数的编译时知识。\n\n文章进一步指出，Zig的元编程系统不允许在语言语法中直接使用自定义语法或DSL。虽然可以通过字符串实现自定义语法，但Zig也避免使用运行时类型信息（RTTI），要求在编译时完全特化类型元编程。\n\n关键的是，Zig不允许向生成的类型添加方法，这意味着自定义类型的API必须手动编写。最后，编译时操作是完全隔离的，禁止任何输入/输出（IO）操作，从而确保隐蔽、可重现和安全的编译。作者总结说，这些限制虽然具有约束性，但使Zig的元编程特性更易于管理和预测。任何需要IO的构建时操作，如数据库交互，都可以由Zig的构建系统处理。"
  },
  {
    "id": "43743337",
    "title": "Gemma 3 QAT Models: Bringing AI to Consumer GPUs",
    "url": "https://developers.googleblog.com/en/gemma-3-quantized-aware-trained-state-of-the-art-ai-to-consumer-gpus/",
    "summary": "This Google Developers Blog post announces Quantization-Aware Training (QAT) optimized versions of Gemma 3, Google's latest open-source AI models. These QAT models significantly reduce memory requirements, making state-of-the-art AI accessible on consumer-grade GPUs like the NVIDIA RTX 3090.\n\nThe article explains the importance of accessibility, highlighting that users want to leverage powerful AI on their existing hardware. QAT achieves this by reducing the precision of model parameters (quantization), such as using int4 (4 bits) instead of BF16 (16 bits). This dramatically reduces VRAM usage, for example, the Gemma 3 27B model goes from 54 GB (BF16) to 14.1 GB (int4).\n\nThe post emphasizes that QAT maintains quality by incorporating quantization during the training process. This reduces performance degradation compared to Post-Training Quantization (PTQ).\n\nThe article lists examples of how these VRAM reductions enable running larger models on readily available hardware. Finally, it highlights easy integration through partnerships with tools like Ollama, LM Studio, MLX, Gemma.cpp, and llama.cpp, enabling developers to quickly experiment with QAT-based quantized checkpoints. The authors encourage exploration of community contributions offering a spectrum of trade-offs in size, speed, and quality to fit specific needs.\n",
    "chinese_title": "Gemma 3 QAT 模型：将人工智能带入消费级 GPU",
    "chinese_summary": "谷歌开发者博客宣布Gemma 3量化感知训练优化版模型发布，显著降低内存需求，使先进AI技术可在NVIDIA RTX 3090等消费级GPU上运行。"
  },
  {
    "id": "43744609",
    "title": "Turing-Drawings",
    "url": "https://github.com/maximecb/Turing-Drawings",
    "summary": "\"Turing-Drawings\" is a JavaScript+HTML5 demo showcasing randomly generated Turing machines that create images and animations on a 2D canvas. The project, available at http://maximecb.github.io/Turing-Drawings/, is distributed under a modified BSD license. The core idea is that these randomly generated Turing machines, despite their simple rules, can produce surprisingly complex and visually interesting patterns. The listed names (Fractal, Scan, Matrix, etc.) exemplify the diverse range of aesthetic outcomes achieved by the system, hinting at the variety and unexpected beauty that can emerge from simple computational processes. The author also mentions writing a blog post further explaining the project, suggesting further insights and explanations are available. In essence, the project explores the emergent creativity inherent within basic computational models.\n",
    "chinese_title": "图灵绘图",
    "chinese_summary": "图灵绘图：一个基于JavaScript+HTML5的演示，展示了随机生成的图灵机在2D画布上创作图像和动画。该项目（网址：http://maximecb.github.io/Turing-Drawings/）以修改后的BSD许可证发布。核心思想是，这些随机生成的图灵机，尽管规则简单，却能产生令人惊讶的复杂和视觉上有趣的图案。列表中的名称（分形、扫描、矩阵等）例证了该系统所实现的各种美学效果，暗示了从简单计算过程中可能出现的各种可能性和意想不到的美。作者还提到撰写了一篇博客文章来进一步解释该项目，表明有更深入的见解和解释可供参考。本质上，该项目探索了基本计算模型中固有的涌现创造力。"
  },
  {
    "id": "43710451",
    "title": "Healthy soil is the hidden ingredient",
    "url": "https://www.nature.com/articles/d41586-025-01026-x",
    "summary": "This Nature article, \"Healthy soil is the hidden ingredient,\" highlights the critical importance of soil health, particularly in the context of the European Union and Spain, which faces significant soil degradation. The EU estimates that 60-70% of its soils are unhealthy, costing €50 billion annually. Spain, with the highest rates of soil erosion in Europe (14.2 tonnes/hectare/year), serves as a case study.\n\nThe article features Jesús Rodrigo Comino, a geographer at the University of Granada, whose research focuses on developing sustainable soil-management practices, particularly in vineyards. He uses geographical mapping systems and AI to create tools for farmers, helping them make informed decisions about irrigation, cover crops, and tillage.\n\nRodrigo Comino is also involved in the SOILCRATES project, part of the EU's \"A Soil Deal for Europe,\" aiming to establish field sites for collaborative research on sustainable soils and to raise public awareness about the importance of soil health.\n\nThe article also addresses the impact of climate change, noting increasing temperatures, reduced precipitation, and more frequent extreme rainfall events, all of which affect soil health. While conclusive data on vineyards is still being gathered, the trends indicate earlier flowering and increased soil erosion due to concentrated rainfall.\n",
    "chinese_title": "健康的土壤是隐藏的秘诀。",
    "chinese_summary": "这篇《自然》杂志的文章《健康的土壤是隐藏的要素》强调了土壤健康的关键重要性，尤其是在面临严重土壤退化的欧盟和西班牙的背景下。 欧盟估计，其60-70%的土壤是不健康的，每年造成500亿欧元的损失。 西班牙的土壤侵蚀率在欧洲最高（14.2吨/公顷/年），可以作为一个案例研究。\n\n这篇文章介绍了格拉纳达大学的地理学家Jesús Rodrigo Comino，他的研究重点是开发可持续的土壤管理实践，尤其是在葡萄园中。 他利用地理制图系统和人工智能为农民创建工具，帮助他们就灌溉、覆盖作物和耕作做出明智的决策。\n\nRodrigo Comino还参与了SOILCRATES项目，该项目是欧盟“欧洲土壤协议”的一部分，旨在建立田间试验点，以合作研究可持续土壤，并提高公众对土壤健康重要性的认识。\n\n这篇文章还探讨了气候变化的影响，指出气温升高、降水减少以及更频繁的极端降雨事件，这些都影响着土壤健康。 虽然关于葡萄园的结论性数据仍在收集，但趋势表明开花期提前，并且由于集中降雨导致土壤侵蚀加剧。"
  },
  {
    "id": "43744173",
    "title": "Jagged AGI: o3, Gemini 2.5, and everything after",
    "url": "https://www.oneusefulthing.org/p/on-jagged-agi-o3-gemini-25-and-everything",
    "summary": "Ethan Mollick discusses the recent advancements in AI models like o3 and Gemini 2.5 Pro, and the debate over whether they represent Artificial General Intelligence (AGI). He highlights Tyler Cowen's assertion that o3 is AGI, based on its impressive capabilities, showcasing examples like o3's ability to create marketing plans, logos, and websites from a single prompt, and its geolocation abilities.\n\nMollick introduces the concept of \"Jagged AGI,\" describing the uneven abilities of AI, where it excels at complex tasks but fails at simple ones, illustrated by o3's failure on a modified brainteaser. Despite these inconsistencies, the models' general capabilities and performance across diverse tasks are noteworthy.\n\nHe questions whether these models truly constitute AGI, given the definitional ambiguity, but suggests they represent a form of \"Jagged AGI\" significant enough to impact work and life, while acknowledging their unreliability necessitates human oversight.\n\nMollick acknowledges that the impact of AGI, even if achieved, might not be immediate due to slow social and organizational adaptation. However, the agentic capabilities of models like o3, allowing them to independently decompose complex goals and execute multi-step plans, could accelerate adoption. Ultimately, he concludes that the trajectory of AI's integration remains uncertain, with potential for either gradual change or a more rapid transformation, emphasizing the importance of navigating the \"jagged landscape\" to be prepared for the future.\n",
    "chinese_title": "锯齿状AGI：o3、Gemini 2.5及后续一切",
    "chinese_summary": "伊森·莫里克讨论了o3和Gemini 2.5 Pro等人工智能模型的最新进展，以及它们是否代表通用人工智能（AGI）的争论。他强调了泰勒·科文基于o3令人印象深刻的能力，断言其为AGI的观点，并展示了o3仅凭一个提示就能创建营销计划、徽标和网站，以及其地理定位能力等例子。\n\n莫里克介绍了“锯齿状AGI”的概念，描述了人工智能的不均衡能力，它擅长复杂任务，却在简单任务上失败，例如o3在一个修改过的脑筋急转弯上的失败。尽管存在这些不一致性，但这些模型在各种任务中的通用能力和表现仍然值得注意。\n\n鉴于定义的模糊性，他质疑这些模型是否真正构成AGI，但认为它们代表了一种“锯齿状AGI”，其重要性足以影响工作和生活，同时也承认其不可靠性需要人工监督。\n\n莫里克承认，即使实现了AGI，其影响也可能不会立即显现，因为社会和组织适应缓慢。然而，像o3这样的模型的代理能力，使其能够独立分解复杂目标并执行多步骤计划，可能会加速采用。最终，他得出结论，人工智能整合的轨迹仍然不确定，可能逐渐改变，也可能快速转型，并强调在“锯齿状地带”中航行，为未来做好准备的重要性。"
  },
  {
    "id": "43715024",
    "title": "Which year: guess which year each photo was taken",
    "url": "https://whichyr.com/",
    "summary": "\"Which Year\" is an addictive and educational photo-guessing game that challenges players to guess the year a historical photo was taken. Players use a timeline slider to select a year between 1850 and 2025. The closer their guess is to the actual year, the more points they earn.\n\nThe game offers a \"Digit Reveal\" hint feature that allows players to unlock one digit of the correct year when stuck, but each digit can only be revealed once per game. A \"Daily Challenge\" presents a new set of photos each day, enabling players to test their knowledge, compare scores with others, and track their improvement over time. The game aims to test and improve visual memory and historical knowledge.\n",
    "chinese_title": "哪一年：猜猜每张照片拍摄于哪一年",
    "chinese_summary": "猜年份：一款令人着迷且寓教于乐的图片猜谜游戏，挑战玩家猜测历史照片的拍摄年份。玩家使用时间轴滑块在1850年至2025年间选择年份。猜测越接近实际年份，获得的分数越高。\n\n游戏提供“数字揭示”提示功能，让玩家在遇到困难时解锁正确年份的一个数字，但每个数字在每局游戏中只能揭示一次。“每日挑战”每天提供一组新的照片，让玩家测试他们的知识，与他人比较分数，并跟踪他们随时间的进步。该游戏旨在测试和提高视觉记忆和历史知识。"
  },
  {
    "id": "43744969",
    "title": "Weave (YC W25) is hiring a founding engineer",
    "url": "https://www.ycombinator.com/companies/weave-3/jobs",
    "summary": "Weave (YC W25), a software company focused on improving engineering team efficiency, is hiring two founding engineers: an AI Engineer and a Product Engineer. Both roles are based in either Oakland, CA or San Francisco, CA, and offer a salary range of $140K - $200K with equity between 0.50% - 2.00%. The AI Engineer position requires at least 1 year of experience, while the Product Engineer position is open to all experience levels, including new graduates. Weave emphasizes their mission to build the best software for engineering teams. The company is well-funded, backed by top investors, profitable, and experiencing rapid growth. Founded in 2024, Weave is currently active and located in San Francisco. The founders are Andrew Churchill and Adam Cohen.\n",
    "chinese_title": "Weave (YC W25) 招聘创始工程师",
    "chinese_summary": "Weave (YC W25)，一家专注于提高工程团队效率的软件公司，正在招聘两位创始工程师：一位人工智能工程师和一位产品工程师。两个职位均位于加州奥克兰或旧金山，薪资范围为 14 万美元至 20 万美元，股权为 0.50% 至 2.00%。人工智能工程师职位至少需要 1 年的经验，而产品工程师职位对所有经验水平开放，包括应届毕业生。Weave 强调其为工程团队构建最佳软件的使命。该公司资金充足，由顶级投资者支持，盈利且增长迅速。Weave 成立于 2024 年，目前活跃于旧金山。创始人是 Andrew Churchill 和 Adam Cohen。"
  },
  {
    "id": "43743915",
    "title": "Slouching Towards San Francisco",
    "url": "https://rachdele.substack.com/p/slouching-towards-san-francisco",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "向旧金山蹒跚",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "43744636",
    "title": "Home galleries are hiding in plain sight across Canada",
    "url": "https://www.cbc.ca/arts/home-galleries-are-hiding-in-plain-sight-across-canada-1.7503886",
    "summary": "This CBC Arts article explores the rising trend of home galleries across Canada, driven by factors like the increasing cost of living and a desire for artistic autonomy. Upstart curators and artists are transforming unconventional spaces like apartments, backyards, garages, barns, and even chicken coops into exhibition venues.\n\nThe article highlights several examples: Erin Storus's \"Garden Variety\" in Toronto, which transformed her backyard into a one-day art event; Marie Ségolène Brault's \"Espace Maurice\" in Montreal, a gallery within her apartment; Danica Pinteric's \"Joys\" gallery in Toronto, located in a renovated garage; Lisa Neighbour and Carlo Cesta's \"Beauty Supply\" in their Toronto home; Bonny Poon's \"Conditions,\" a commercial gallery in her downtown Toronto condo; Adrien Crossman's \"Orchid Contemporary\" in a Hamilton garage; Jay Issac's \"13 Cedars\" in a refurbished barn in Rowley, N.B.; Alexander Rondeau's \"Between Pheasants Contemporary\" in a chicken coop on his family's farm in Kerns Township, Ont.; and André Laroche and Louis Joncas's \"La Shed\" in a spruced up tool shed in Gabarus, N.S.\n\nThese DIY spaces provide opportunities for underrepresented artists and communities to showcase their work, fostering a sense of community and accessible art experiences. While challenges like limited foot traffic exist, the article emphasizes the freedom, flexibility, and unique hospitality these home galleries offer, as well as their ability to cultivate online audiences and strong local relationships. The trend reflects a \"make it happen\" philosophy, creating art worlds on their own terms.\n",
    "chinese_title": "加拿大各地的家庭画廊隐于市井",
    "chinese_summary": "加拿大各地家庭画廊兴起：艺术自主与生活成本驱动"
  },
  {
    "id": "43743784",
    "title": "The Joy of Linux Theming in the Age of Bootable Containers",
    "url": "https://blues.win/posts/joy-of-linux-theming/",
    "summary": "This article explores the joy of Linux theming in the age of bootable containers, specifically using the `bootc` project. The author recounts past experiences customizing desktop environments and the frustrations of broken configurations. `Bootc` provides a solution by allowing the operating system to be defined as a Containerfile, enabling easy experimentation and rollback capabilities. This approach mitigates configuration drift and system breakage that often plague traditional Linux customization methods.\n\nThe author contrasts `bootc` with other approaches like shell scripts, `systemd-sysext`, and Nix, arguing that `bootc` offers superior flexibility, safety, and tooling.  A key advantage is the ability to easily revert to a previous container state if a change breaks the system.\n\nThe article also delves into the question of what constitutes a \"Linux distribution\" in the age of bootable containers. The author reflects on their project, Blue95 (a Fedora Xfce Atomic image with a specific theme), and questions whether it qualifies as a distribution. The author notes that the lines between a Containerfile and a full-blown distribution are becoming increasingly blurred. Popular `bootc`-based projects are considered distros by some, even though they are built upon an existing distribution. Despite the ambiguous definition, the author concludes that creating and using their own themed bootable container is a source of personal satisfaction, because it is an expression of their creativity.\n",
    "chinese_title": "可启动容器时代的Linux主题之乐",
    "chinese_summary": "本文探讨了在可引导容器时代使用 Linux 主题的乐趣，特别是使用 `bootc` 项目。作者回顾了过去自定义桌面环境的经验以及配置损坏带来的挫败感。`Bootc` 提供了一种解决方案，允许将操作系统定义为 Containerfile，从而实现轻松的实验和回滚功能。这种方法减轻了经常困扰传统 Linux 自定义方法的配置漂移和系统损坏问题。\n\n作者将 `bootc` 与 shell 脚本、`systemd-sysext` 和 Nix 等其他方法进行了对比，认为 `bootc` 提供了更出色的灵活性、安全性和工具。一个关键优势是，如果更改破坏了系统，可以轻松恢复到之前的容器状态。\n\n本文还深入探讨了在可引导容器时代，什么构成“Linux 发行版”的问题。作者反思了他们的项目 Blue95（一个带有特定主题的 Fedora Xfce Atomic 镜像），并质疑它是否符合发行版的定义。作者指出，Containerfile 和完整的发行版之间的界限正变得越来越模糊。一些人认为流行的基于 `bootc` 的项目是发行版，即使它们构建在现有的发行版之上。尽管定义不明确，但作者得出结论，创建和使用他们自己主题的可引导容器是一种个人满足感的来源，因为它表达了他们的创造力。"
  },
  {
    "id": "43718493",
    "title": "A 1980s toy robot arm inspired modern robotics",
    "url": "https://www.technologyreview.com/2025/04/17/1114456/toy-armatron-modern-robotics-ai-nostalgia/",
    "summary": "This article explores how the Armatron, a simple 1980s toy robotic arm, inspired a generation of modern robotics engineers. The author recounts his childhood fascination with the Armatron, highlighting its purely mechanical design driven by a single motor and a complex gearbox.\n\nThe article then delves into the story of Hiroyuki Watanabe, the Armatron's inventor at Tomy, revealing his inspiration came from a newspaper clipping and radio-controlled helicopters. Despite lacking formal engineering education, Watanabe's ingenuity resulted in a design that impressed even professional robotics engineers at the time.\n\nThe impact of the Armatron is illustrated through anecdotes from engineers at Boston Dynamics and UC Berkeley. Adam Borrell, a mechanical design engineer at Boston Dynamics, credits the Armatron with sparking his interest in robotics. Eric Paulos, a professor at UC Berkeley, uses the Armatron's constraints as inspiration for his students to solve problems creatively.\n\nThe article concludes by highlighting the enduring appeal of the Armatron, as evidenced by its rediscovery through online communities and DIY modifications. Watanabe expresses his delight in seeing people still amazed by the toy's mechanism, emphasizing the value of hands-on curiosity in the field of robotics. The article asserts that even with the rise of AI in robotics, the field still requires the ingenuity and problem-solving skills fostered by analog toys like the Armatron.\n",
    "chinese_title": "1980年代玩具机械臂启发现代机器人技术",
    "chinese_summary": "本文探讨了20世纪80年代的简易玩具机械臂Armatron如何启发了一代现代机器人工程师。作者回忆了他童年对Armatron的痴迷，强调了其由单一电机和复杂齿轮箱驱动的纯机械设计。\n\n随后，文章深入讲述了Armatron在Tomy的开发者渡边宏之的故事，揭示了他的灵感来源于一份报纸剪报和无线电遥控直升机。尽管缺乏正规的工程教育，渡边的独创性设计却给当时的专业机器人工程师留下了深刻印象。\n\n通过波士顿动力公司和加州大学伯克利分校的工程师们的轶事，展现了Armatron的影响力。波士顿动力公司的机械设计工程师Adam Borrell认为Armatron激发了他对机器人的兴趣。加州大学伯克利分校的教授Eric Paulos利用Armatron的限制作为灵感，激励他的学生创造性地解决问题。\n\n文章最后强调了Armatron的持久魅力，这体现在通过在线社区和DIY改造重新发现它。渡边表示很高兴看到人们仍然对这款玩具的机制感到惊叹，强调了实践好奇心在机器人领域的价值。文章断言，即使随着人工智能在机器人领域的兴起，该领域仍然需要像Armatron这样的模拟玩具所培养的创造力和问题解决能力。"
  },
  {
    "id": "43738561",
    "title": "Raspberry Pi Lidar Scanner",
    "url": "https://github.com/PiLiDAR/PiLiDAR",
    "summary": "This article details a DIY project, PiLiDAR, for creating a 360° 3D panorama scanner using a Raspberry Pi. The project integrates LiDAR technology (LDRobot LD06, LD19, or STL27L), a Raspberry Pi HQ Camera, and a stepper motor for automated scanning.\n\nCore features include custom LiDAR serial drivers, CRC package integrity checks, hardware PWM calibration, 2D visualization, panorama creation from fisheye photos with constant exposure and white balance, and 3D scene assembly. The project leverages Open3D for visualization and export (PCD, PLY, e57) and includes techniques for aligning multiple scans and surface meshing, although the latter is resource-intensive on the Raspberry Pi itself.\n\nThe hardware setup involves specific LiDAR models, camera lenses, a Raspberry Pi 4, a stepper motor with a driver, and a power supply. The article provides detailed wiring diagrams and setup instructions for various components, including power button functionality, accelerometer integration, CPU fan control, and scan button registration.\n\nSoftware setup includes configuring UART permissions, enabling hardware PWM, installing necessary libraries like RPi Hardware PWM and Hugin for panorama stitching, and managing USB port power. The serial protocol for the LiDAR models is described, along with instructions for remote Open3D visualization using Plotly and for automatically dumping scans to USB storage. Troubleshooting tips and helpful references are also provided.\n",
    "chinese_title": "树莓派激光雷达扫描仪",
    "chinese_summary": "本文详细介绍了一个名为PiLiDAR的DIY项目，该项目使用树莓派创建一个360° 3D全景扫描仪。该项目集成了LiDAR技术（LDRobot LD06、LD19或STL27L）、树莓派HQ摄像头和一个步进电机，以实现自动化扫描。\n\n核心功能包括自定义LiDAR串口驱动程序、CRC包完整性检查、硬件PWM校准、2D可视化、通过恒定曝光和白平衡的鱼眼照片创建全景图以及3D场景组装。该项目利用Open3D进行可视化和导出（PCD、PLY、e57），并包含对齐多个扫描和表面网格化的技术，尽管后者在树莓派本身上是资源密集型的。\n\n硬件设置涉及特定的LiDAR型号、相机镜头、树莓派4、带有驱动器的步进电机和一个电源。本文提供了各种组件的详细接线图和设置说明，包括电源按钮功能、加速度计集成、CPU风扇控制和扫描按钮注册。\n\n软件设置包括配置UART权限、启用硬件PWM、安装必要的库（如RPi Hardware PWM和Hugin用于全景拼接）以及管理USB端口电源。本文描述了LiDAR型号的串行协议，以及使用Plotly进行远程Open3D可视化以及自动将扫描转储到USB存储的说明。还提供了故障排除技巧和有用的参考资料。"
  },
  {
    "id": "43741273",
    "title": "100 Years to Solve an Integral (2020)",
    "url": "https://liorsinai.github.io/mathematics/2020/08/27/secant-mercator.html",
    "summary": "Lior Sinai's article \"100 Years to Solve an Integral\" explores the historical context surrounding the integral of the secant function, ∫sec(x) dx. While now a standard calculus problem, it presented a significant challenge centuries ago, arising from the need for accurate mapmaking.\n\nGerardus Mercator encountered this integral in 1569 while creating his world map, a vital tool for navigation, but couldn't solve it analytically. He used approximations instead. The solution, ln|sec(x) + tan(x)| + c, was discovered accidentally in 1645 and formally proven in 1668, nearly a century after Mercator's initial need.\n\nThe article explains the Mercator map projection, highlighting how it uniquely preserves angles, making it ideal for navigation by ensuring rhumb lines (lines of constant bearing) appear straight. This projection required determining the stretching factor at each latitude, which ultimately led to the secant integral.\n\nSinai further delves into the historical reliance on mathematical tables, particularly trigonometric tables, as calculation aids before the advent of modern calculators. Edward Wright published tables for the Mercator map equation, and John Napier introduced logarithms, both contributing to easier calculations for navigation and mapmaking. The discovery of the integral was tied to someone meticulously calculating tables.\n",
    "chinese_title": "解决积分百年 (2020)",
    "chinese_summary": "利奥·西奈的文章《百年求解的积分》探讨了正割函数积分 ∫sec(x) dx 的历史背景。虽然现在这是个标准的微积分问题，但在几个世纪前，它曾是一个巨大的挑战，源于对精确地图绘制的需求。\n\n赫拉德斯·墨卡托在1569年创建他的世界地图时遇到了这个积分，这是一项至关重要的导航工具，但他无法解析地解决它，而是使用了近似值。ln|sec(x) + tan(x)| + c 的解于1645年被偶然发现，并在1668年正式证明，几乎在墨卡托最初的需求一个世纪之后。\n\n这篇文章解释了墨卡托投影，强调了它如何独特地保留角度，使其成为导航的理想选择，因为它确保了恒向线（恒定方位的线）看起来是直的。这种投影需要确定每个纬度的拉伸因子，最终导致了正割积分的出现。\n\n西奈进一步深入研究了历史上对数学表格，尤其是三角函数表的依赖，因为这是现代计算器出现之前计算的辅助工具。爱德华·赖特发表了墨卡托地图方程的表格，约翰·纳皮尔引入了对数，这两者都有助于简化导航和地图绘制的计算。该积分的发现与某人一丝不苟地计算表格密切相关。"
  },
  {
    "id": "43739456",
    "title": "Show HN: I built an AI that turns GitHub codebases into easy tutorials",
    "url": "https://github.com/The-Pocket/Tutorial-Codebase-Knowledge",
    "summary": "This \"Show HN\" post introduces an AI agent that automatically generates beginner-friendly tutorials from GitHub codebases. Built using the Pocket Flow framework (a 100-line LLM framework), the AI crawls repositories, analyzes code structure, and identifies core abstractions to create easily understandable tutorials with visualizations.\n\nThe post provides links to a YouTube development tutorial and a Substack post for those interested in building the AI agent themselves. It also showcases example tutorials generated for popular GitHub repositories like AutoGen, FastAPI, NumPy, and Requests, demonstrating the AI's ability to explain complex code in simpler terms.\n\nThe AI can be used on both GitHub repositories and local directories. The user can specify which files to include and exclude, the maximum file size to analyze, and the output language for the tutorial. To get started, users need to clone the repository, install dependencies, configure their LLM API key (Gemini Pro by default), and run the `main.py` script with appropriate arguments (repo URL or directory, include/exclude patterns, language, etc.). The post highlights the use of Agentic Coding with Pocket Flow to accelerate the development process, enabling AI agents (like Cursor AI) to automate code generation.\n",
    "chinese_title": "Show HN: 我做了一个AI，可以将GitHub代码库转换成简易教程",
    "chinese_summary": "此“Show HN”帖子介绍了一款AI代理，它能从GitHub代码库中自动生成适合初学者的教程。该AI使用Pocket Flow框架（一个100行的LLM框架）构建，可抓取存储库、分析代码结构并识别核心抽象，以创建带有可视化的、易于理解的教程。\n\n该帖子提供了YouTube开发教程和Substack帖子的链接，供那些有兴趣自己构建AI代理的人参考。它还展示了为流行的GitHub存储库（如AutoGen、FastAPI、NumPy和Requests）生成的示例教程，演示了该AI以更简单的方式解释复杂代码的能力。\n\n该AI可用于GitHub存储库和本地目录。用户可以指定要包含和排除的文件、要分析的最大文件大小以及教程的输出语言。要开始使用，用户需要克隆存储库、安装依赖项、配置其LLM API密钥（默认为Gemini Pro），并使用适当的参数（存储库URL或目录、包含/排除模式、语言等）运行`main.py`脚本。该帖子重点介绍了使用Agentic Coding与Pocket Flow来加速开发过程，从而使AI代理（如Cursor AI）能够自动化代码生成。"
  },
  {
    "id": "43744394",
    "title": "The skill of the future is not 'AI', but 'Focus'",
    "url": "https://www.carette.xyz/posts/focus_will_be_the_skill_of_the_future/",
    "summary": "The article argues that while Large Language Models (LLMs) are powerful tools for engineers, the over-reliance on them poses a significant risk: the erosion of problem-solving skills, particularly the ability to focus. The author acknowledges LLMs can automate tasks, generate code, and assist in debugging, freeing up time for complex problem-solving. However, LLMs are prone to hallucinations, inconsistencies, and biases, necessitating careful review of their outputs.\n\nThe core concern is that engineers may become overly dependent on readily available solutions generated by LLMs, especially for familiar problems, leading to the atrophy of their own problem-solving abilities. The author emphasizes the importance of understanding the \"why\" behind LLM-generated solutions, not simply blindly accepting them. Mastering fundamental skills is crucial for solving complex problems, and over-reliance on LLMs can hinder the development and maintenance of these skills.\n\nThe author contrasts LLMs with search engines, arguing that search engines offer a choice between exploration and exploitation, while LLMs primarily encourage immediate exploitation. Removing exploration can lead to instability in the exploitation process. The article concludes by expressing concern that the pressure to deliver solutions quickly is causing engineers to lose focus, a skill that requires practice. The author questions whether the future ability to tackle complex challenges will rest solely on AI, rather than human ingenuity.\n",
    "chinese_title": "未来的技能不是“人工智能”，而是“专注”。",
    "chinese_summary": "大型语言模型（LLM）在为工程师提供强大工具的同时，过度依赖它们会带来重大风险：解决问题的能力下降，特别是专注力。作者承认LLM可以自动化任务、生成代码和辅助调试，从而释放时间来解决复杂问题。然而，LLM容易产生幻觉、不一致和偏差，因此需要仔细审查其输出结果。\n\n核心担忧是工程师可能会过度依赖LLM生成的现成解决方案，尤其是在解决熟悉的问题时，导致自身解决问题的能力退化。作者强调理解LLM生成解决方案背后的“原因”的重要性，而不是简单地盲目接受它们。掌握基本技能对于解决复杂问题至关重要，而过度依赖LLM会阻碍这些技能的培养和维护。\n\n作者将LLM与搜索引擎进行了对比，认为搜索引擎在探索和利用之间提供了选择，而LLM主要鼓励立即利用。移除探索可能会导致利用过程的不稳定。文章最后表达了担忧，即快速交付解决方案的压力导致工程师失去专注力，而这种技能需要练习。作者质疑未来应对复杂挑战的能力是否将完全依赖于人工智能，而不是人类的聪明才智。"
  },
  {
    "id": "43743993",
    "title": "Why on Earth is OpenAI buying Windsurf?",
    "url": "https://theahura.substack.com/p/tech-things-openai-buys-windsurf",
    "summary": "I am unable to access the article link.\n",
    "chinese_title": "OpenAI 究竟为何要收购 Windsurf？",
    "chinese_summary": "我无法访问该文章链接。"
  },
  {
    "id": "43709843",
    "title": "Attention Spans for Math and Stories (2019)",
    "url": "https://www.jeremykun.com/2019/03/26/attention-spans-for-math-and-stories/",
    "summary": "This essay argues that storytelling is a crucial tool for engaging children and adults in mathematics, particularly those who find it intimidating. The author, drawing from personal experiences, emphasizes that young children, even as young as 5, are more receptive to mathematical concepts when they are presented within the context of a compelling story.\n\nThe author illustrates this with examples like introducing prime numbers to a 5-year-old through \"The Boy Who Loved Math\" and using elaborate make-believe stories to engage summer camp kids in activities. The core concept is that stories provide motivation, create a sense of belonging, and transform learning into a natural and enjoyable process.\n\nThe essay underscores the importance of normalizing math through storytelling, contrasting it with approaches like direct instruction or forced exercises. It suggests that math anxieties can be reduced when math is interwoven into narratives and family life. The author also discusses using storytelling to help younger members of a Boy Scout troop feel welcome by inventing outlandish tales about their feats of bravery.\n\nThe author contends that as one becomes more comfortable with math, the emphasis of the story can shift, with mathematical objects and theorems becoming the central characters and plot drivers. They advocate for more story-focused mathematical content, highlighting the YouTube channel Numberphile and the comic series Beast Academy as examples. The ultimate goal is to learn to tell stories well, fostering a deeper and more accessible connection with mathematics for all.\n",
    "chinese_title": "数学和故事的注意力跨度 (2019)",
    "chinese_summary": "故事讲述是让儿童和成人参与数学的关键工具，特别是对于那些觉得数学令人生畏的人。作者通过个人经历强调，即使是 5 岁的儿童，当数学概念以引人入胜的故事形式呈现时，也更容易接受。\n\n作者通过实例说明了这一点，例如通过“热爱数学的男孩”向 5 岁的孩子介绍素数，并使用精心设计的虚构故事让夏令营的孩子们参与活动。核心概念是，故事提供动力，创造归属感，并将学习转变为自然而愉快的过程。\n\n本文强调了通过讲故事使数学正常化的重要性，并将其与直接教学或强制练习等方法形成对比。它表明，当数学融入叙事和家庭生活时，可以减轻数学焦虑。作者还讨论了如何通过编造关于他们勇敢事迹的古怪故事，来帮助童子军队伍中较小的成员感到受欢迎。\n\n作者认为，随着一个人对数学越来越适应，故事的重点可以转移，数学对象和定理成为中心人物和情节驱动力。他们提倡更多以故事为中心的数学内容，并强调 YouTube 频道 Numberphile 和漫画系列 Beast Academy 等例子。最终目标是学会讲好故事，从而为所有人培养与数学更深入、更易于理解的联系。"
  },
  {
    "id": "43741849",
    "title": "Let's give PRO/VENIX a barely adequate, pre-C89 TCP/IP stack, featuring Slirp-CK",
    "url": "http://oldvcr.blogspot.com/2025/04/lets-give-provenix-barely-adequate-pre.html",
    "summary": "This article details a project to create a minimal TCP/IP stack for the DEC Professional 380 running PRO/VENIX V2.0, a System V-based Unix port. The goal is to provide basic network functionality to a system lacking native TCP/IP support, using the machine's slower serial port (4800bps) and RFC 1055 SLIP protocol.\n\nThe author aims for a \"barely adequate\" stack, prioritizing client-side tasks due to the limited processing power and slow connection. The intended applications include checking network connectivity (ICMP), DNS lookups (UDP), setting system time (NTP), and downloading data via simple protocols like unencrypted HTTP/1.x.\n\nThe stack will be highly constrained, avoiding modern C libraries and assuming little about the underlying system. Code will be written with portability in mind, aiming for easy translation to assembly if needed. Each client program will handle its own raw packets individually for simplicity, avoiding multi-socket complexity.\n\nThe article also provides historical context on the DEC Professional series, PRO/VENIX, and the reasons behind its limited networking capabilities. It highlights the challenges of porting modern network stacks to older systems with primitive C compilers and limited resources. The author is testing the system using two USB serial dongles connected with a null modem on a Fedora-based workstation.\n",
    "chinese_title": "我们给PRO/VENIX做一个刚好够用的，C89之前的TCP/IP协议栈，采用Slirp-CK。",
    "chinese_summary": "本文详细介绍了一个项目，该项目旨在为运行 PRO/VENIX V2.0（基于 System V 的 Unix 移植版本）的 DEC Professional 380 创建一个极简的 TCP/IP 协议栈。 目标是为缺乏原生 TCP/IP 支持的系统提供基本的网络功能，使用机器较慢的串口 (4800bps) 和 RFC 1055 SLIP 协议。\n\n作者的目标是一个“勉强够用”的协议栈，由于处理能力有限且连接速度慢，因此优先考虑客户端任务。 预期的应用程序包括检查网络连接 (ICMP)、DNS 查找 (UDP)、设置系统时间 (NTP) 以及通过简单的协议（如未加密的 HTTP/1.x）下载数据。\n\n该协议栈将受到高度约束，避免使用现代 C 库，并且对底层系统做出很少的假设。 代码编写将考虑到可移植性，旨在在需要时轻松转换为汇编语言。 为了简单起见，每个客户端程序将单独处理自己的原始数据包，避免多套接字复杂性。\n\n本文还提供了有关 DEC Professional 系列、PRO/VENIX 及其网络功能受限的原因的历史背景。 它强调了将现代网络协议栈移植到具有原始 C 编译器和有限资源的旧系统所面临的挑战。 作者正在使用连接到基于 Fedora 的工作站上的两个带有零调制解调器的 USB 串口加密狗来测试该系统。"
  },
  {
    "id": "43736791",
    "title": "Librarians are dangerous",
    "url": "https://bradmontague.substack.com/p/librarians-are-dangerous",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "图书管理员很危险",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "43735452",
    "title": "Researchers develop picosecond-level flash memory device",
    "url": "https://www.fudan.edu.cn/en/2025/0417/c344a145016/page.htm",
    "summary": "The primary focus of this article snippet is a recent development: **researchers have created a flash memory device capable of operating at picosecond-level speeds.** This is the most important piece of information conveyed.\n\nThe snippet also provides context through a list of other recent articles, implying the flash memory development is the latest news (dated April 17, 2025). The other articles, while present, are not directly related to the flash memory news and are likely included to showcase the publication's recent coverage.\n\nTherefore, the core takeaway is the announcement of a new, significantly faster flash memory device.\n",
    "chinese_title": "研究人员开发出皮秒级闪存设备",
    "chinese_summary": "本文片段主要关注一项最新进展：**研究人员已创造出一种能够在皮秒级速度下运行的闪存设备。** 这是传达的最重要信息。\n\n该片段还通过一份近期文章列表提供了背景信息，暗示闪存的开发是最新消息（日期为2025年4月17日）。 其他文章虽然存在，但与闪存新闻没有直接关系，可能只是为了展示该出版物的近期报道。\n\n因此，核心要点是宣布了一种新的、速度明显更快的闪存设备。"
  },
  {
    "id": "43743629",
    "title": "Show HN: A Standalone/GitHub CLI Extension to Preview GitHub Flavored Markdown",
    "url": "https://github.com/thiagokokada/gh-gfm-preview",
    "summary": "`gh-gfm-preview` is a Go program and GitHub CLI extension that provides offline previews of GitHub Flavored Markdown (GFM) files. It offers a fast, dependency-free way to render Markdown locally, mimicking GitHub's rendering style using the `yuin/goldmark` library. It's a hard fork of `yusukebe/gh-markdown-preview`, which relied on the GitHub Markdown API and required an internet connection.\n\nKey features include offline operation, speed, no external dependencies (except for the binary itself), zero-configuration, live reloading, auto-browser opening, auto-port finding, and graceful degradation. It supports most GFM features, including emojis, alerts, syntax highlighting (via `alecthomas/chroma`), section links, MathJax, Mermaid diagrams, GeoJSON/TopoJSON diagrams, and STL 3D diagrams. However, features requiring GitHub access (like mentioning people) are not supported.\n\nInstallation is possible via `go run`, Nix (if flakes are enabled), or as a GitHub CLI extension. Usage involves simply running `gh gfm-preview` followed by the filename (or it will detect the `README` automatically). It offers options for dark/light mode, disabling auto-open and reloading, specifying host/port, and verbose output.\n\nThe tool is suitable for offline Markdown previews in editors like Neovim, as exemplified in the provided configuration snippet. Development involves asset generation and building via `go generate` and `go build`, respectively. The article also links to related projects like GitHub CLI, Grip, `github-markdown-css`, and the original `gh-markdown-preview` project.\n",
    "chinese_title": "Show HN：预览 GitHub Flavored Markdown 的独立应用/GitHub CLI 扩展",
    "chinese_summary": "`gh-gfm-preview` 是一个 Go 程序和 GitHub CLI 扩展，用于离线预览 GitHub Flavored Markdown (GFM) 文件。它提供了一种快速、无依赖的方式来在本地渲染 Markdown，使用 `yuin/goldmark` 库模拟 GitHub 的渲染风格。它是 `yusukebe/gh-markdown-preview` 的一个硬分叉，后者依赖于 GitHub Markdown API 并且需要互联网连接。\n\n主要特性包括离线操作、速度快、没有外部依赖（除了二进制文件本身）、零配置、实时重新加载、自动浏览器打开、自动端口查找和优雅降级。它支持大多数 GFM 特性，包括表情符号、警报、语法高亮（通过 `alecthomas/chroma`）、章节链接、MathJax、Mermaid 图表、GeoJSON/TopoJSON 图表和 STL 3D 图表。但是，需要 GitHub 访问的特性（如提及人员）不受支持。\n\n可以通过 `go run`、Nix（如果启用了 flakes）或作为 GitHub CLI 扩展进行安装。使用方法很简单，运行 `gh gfm-preview` 加上文件名（或者它会自动检测 `README`）。它提供了深色/浅色模式选项、禁用自动打开和重新加载选项、指定主机/端口选项以及详细输出选项。\n\n该工具适用于像 Neovim 这样的编辑器中的离线 Markdown 预览，如提供的配置代码段所示。开发涉及通过 `go generate` 和 `go build` 分别生成资产和构建。文章还链接到相关项目，如 GitHub CLI、Grip、`github-markdown-css` 和原始的 `gh-markdown-preview` 项目。"
  },
  {
    "id": "43735896",
    "title": "Perplexingly Book-Learned Emacs",
    "url": "https://lars.ingebrigtsen.no/2025/04/17/perplexingly-book-learned-emacs/",
    "summary": "The author explores using the Perplexity AI API to solve the problem of finding newly published books by specific authors, a task made difficult by the lack of comprehensive databases distinguishing new works from reprints or editions. After struggling with existing databases, the author signs up for Perplexity AI and creates a simple Emacs library (perplexity.el) to query the API.\n\nThe author uses prompts to list books by a specific author and then filters out books they already own. While the API access is straightforward, the results are inconsistent, with LLM hallucinations and variable response times. The author observes that the list of books varies between queries. However, the author successfully finds previously unknown books by some authors, showcasing some utility.\n\nThe author details trials with authors like Amy Hempel and Megan Whalen, noting varying degrees of success and inconsistencies. After purchasing several books uncovered through the process, the author adds Emacs commands for quick access to Bookshop.org and Goodreads. Finally, the author compares Perplexity with Gemini and OpenAI for the same task, finding similar limitations. The author concludes that even with its jankiness and inconsistencies, Perplexity provides a somewhat useful, even if unexpected, solution for discovering new books by tracked authors. The key limitation seems to be Perplexity's unwillingness to perform too many searches.\n",
    "chinese_title": "令人费解的学院派 Emacs",
    "chinese_summary": "作者探索使用Perplexity AI API来解决查找特定作者新出版书籍的问题，由于缺乏能够区分新作与重印版或修订版的全面数据库，这项任务变得困难。在苦苦挣扎于现有数据库之后，作者注册了Perplexity AI，并创建了一个简单的Emacs库（perplexity.el）来查询API。\n\n作者使用提示来列出特定作者的书籍，然后过滤掉已经拥有的书籍。虽然API访问很简单，但结果并不一致，存在LLM幻觉和可变响应时间。作者观察到，书籍列表在不同查询之间有所不同。然而，作者成功地找到了一些作者以前未知的新书，展示了其一定的效用。\n\n作者详细介绍了对艾米·亨佩尔和梅根·惠伦等作者的试验，注意到不同程度的成功和不一致。在购买了几本通过该过程发现的书籍后，作者添加了Emacs命令，以便快速访问Bookshop.org和Goodreads。最后，作者将Perplexity与Gemini和OpenAI用于相同的任务进行了比较，发现类似的局限性。作者得出结论，即使存在不足和不一致，Perplexity仍然为发现追踪作者的新书提供了一个在某种程度上有用，甚至出乎意料的解决方案。关键的局限性似乎是Perplexity不愿意执行过多的搜索。"
  },
  {
    "id": "43741013",
    "title": "Novel color via stimulation of individual photoreceptors at population scale",
    "url": "https://www.science.org/doi/10.1126/sciadv.adu1052",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "人群尺度下通过刺激单个感光细胞实现的新型色彩",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "43735550",
    "title": "Claude Code: Best practices for agentic coding",
    "url": "https://www.anthropic.com/engineering/claude-code-best-practices",
    "summary": "I have read the article \"Claude Code: Best practices for agentic coding\" on Anthropic's website. Here's a summary:\n\nThe article discusses best practices for leveraging Claude, Anthropic's AI assistant, for \"agentic coding,\" where Claude acts more autonomously to solve coding tasks. The core principle is to empower Claude to handle complex tasks by providing clear guidance and allowing it to make independent coding decisions within defined parameters.\n\nKey best practices include:\n\n*   **Clear Task Decomposition:** Break down large coding projects into smaller, well-defined sub-tasks. This allows Claude to focus on specific functionalities and reduces the likelihood of errors.\n*   **Structured Prompts:** Utilize structured prompting techniques, such as providing examples, specifying input/output formats, and explicitly defining constraints. This improves Claude's understanding of the desired outcome.\n*   **Iterative Development:** Encourage an iterative approach by frequently reviewing and refining Claude's code. Provide feedback on areas that need improvement and allow Claude to learn from its mistakes.\n*   **Testing and Validation:** Emphasize the importance of rigorous testing and validation. Generate test cases and instruct Claude to run them, helping to identify and fix bugs. The article also suggests using Claude to *generate* test cases.\n*   **Context Management:** Carefully manage the context provided to Claude, as it can influence its performance. Provide relevant code snippets, documentation, and examples to guide its coding efforts. Avoid overwhelming it with unnecessary information.\n*   **Role-Playing:** Instruct Claude to adopt a specific persona or role, such as \"senior software engineer\" or \"expert Python programmer,\" to guide its coding style and decisions. This can improve code quality and maintainability.\n*   **Progressive Refinement:** Encourage Claude to continuously refine its own code, such as by suggesting improvements for readability, efficiency, or security.\n\nThe article emphasizes that while Claude can automate many aspects of coding, human oversight is still crucial for ensuring quality, correctness, and security. By following these best practices, developers can effectively leverage Claude to accelerate their coding workflows and build complex software applications more efficiently.\n",
    "chinese_title": "克劳德代码：自主编码的最佳实践",
    "chinese_summary": "我阅读了Anthropic网站上关于“Claude Code：代理式编码的最佳实践”的文章。以下是摘要：\n\n该文章讨论了利用Anthropic的AI助手Claude进行“代理式编码”的最佳实践，在这种模式下，Claude可以更自主地解决编码任务。其核心原则是通过提供清晰的指导并允许其在定义的参数范围内独立做出编码决策，从而使Claude能够处理复杂的任务。\n\n主要最佳实践包括：\n\n*   **清晰的任务分解：** 将大型编码项目分解为更小、定义明确的子任务。 这使得Claude可以专注于特定功能并降低出错的可能性。\n*   **结构化提示：** 利用结构化提示技术，例如提供示例、指定输入/输出格式以及明确定义约束。 这可以提高Claude对预期结果的理解。\n*   **迭代开发：** 鼓励通过频繁审查和完善Claude的代码来采用迭代方法。 就需要改进的领域提供反馈，并允许Claude从错误中学习。\n*   **测试和验证：** 强调严格测试和验证的重要性。 生成测试用例并指示Claude运行它们，以帮助识别和修复错误。 该文章还建议使用Claude来*生成*测试用例。\n*   **上下文管理：** 仔细管理提供给Claude的上下文，因为它会影响其性能。 提供相关的代码片段、文档和示例来指导其编码工作。 避免用不必要的信息使其不堪重负。\n*   **角色扮演：** 指示Claude采用特定的角色或身份，例如“高级软件工程师”或“专家Python程序员”，以指导其编码风格和决策。 这可以提高代码质量和可维护性。\n*   **渐进式改进：** 鼓励Claude不断改进其自己的代码，例如通过提出改进可读性、效率或安全性的建议。\n\n该文章强调，虽然Claude可以自动化编码的许多方面，但人工监督对于确保质量、正确性和安全性仍然至关重要。 通过遵循这些最佳实践，开发人员可以有效地利用Claude来加速他们的编码工作流程并更有效地构建复杂的软件应用程序。"
  },
  {
    "id": "43716704",
    "title": "Everyone knows your location, Part 2: try it yourself and share the results",
    "url": "https://timsh.org/everyone-knows-your-location-part-2-try-it-yourself/",
    "summary": "This article is a follow-up to a previous post about location data sharing by apps. The author provides a guide and Python notebook to help readers investigate app traffic themselves to uncover potentially surprising data collection and sharing practices. The goal is to crowdsource information about which apps collect and share location and other sensitive data.\n\nThe author details how to use mitmproxy to intercept and record app traffic, then provides a Python notebook with instructions for filtering and analyzing the data for specific keywords like location and IDFA. Visualizations of domain traffic are also included, revealing the dominance of ad networks like Unity, Google's Doubleclick, and Applovin.\n\nThe guide outlines setting up mitmproxy on a computer, configuring a mobile device to route traffic through the proxy, and then capturing app traffic data. The notebook then facilitates keyword-based filtering to find specific instances of data collection. The author stresses the importance of manual review to avoid missing potentially crucial data points.\n\nFinally, the author invites readers to contribute their findings through a form that populates a shared Google Sheet, emphasizing the need to redact personal information before submission. The author acknowledges the simplicity of the method, but argues that it provides a good balance between automation and manual analysis to avoid missing potentially interesting details.\n",
    "chinese_title": "人尽皆知你的位置，第二部分：亲自尝试并分享结果",
    "chinese_summary": "本文是关于应用程序位置数据共享的前一篇帖子的后续。作者提供了一个指南和一个Python笔记本，以帮助读者自行调查应用程序流量，从而发现可能令人惊讶的数据收集和共享行为。其目标是众包关于哪些应用程序收集和共享位置和其他敏感数据的信息。\n\n作者详细介绍了如何使用mitmproxy拦截和记录应用程序流量，然后提供了一个Python笔记本，其中包含过滤和分析数据的说明，用于查找诸如位置和IDFA之类的特定关键字。还包括域流量的可视化，揭示了诸如Unity、Google的Doubleclick和Applovin等广告网络的主导地位。\n\n该指南概述了如何在计算机上设置mitmproxy，配置移动设备以通过代理路由流量，然后捕获应用程序流量数据。然后，该笔记本有助于基于关键字的过滤，以查找数据收集的特定实例。作者强调了手动审查的重要性，以避免遗漏可能至关重要的数据点。\n\n最后，作者邀请读者通过一个表格贡献他们的发现，该表格会填充一个共享的Google表格，并强调需要在提交之前编辑个人信息。作者承认该方法的简单性，但认为它在自动化和手动分析之间提供了良好的平衡，以避免遗漏可能有趣的细节。"
  },
  {
    "id": "43741051",
    "title": "Pretty State Machine Patterns in Rust (2016)",
    "url": "https://hoverbear.org/blog/rust-state-machine-pattern/",
    "summary": "This article explores different Rust design patterns for implementing state machines, focusing on compile-time safety and code clarity. It starts by defining state machines and their importance in various applications, emphasizing the need for enforced valid state transitions.\n\nThe author presents three implementation approaches:\n\n1.  **Enums:**  A basic enum-based approach, where states are variants of an enum. This is simple but lacks compile-time transition enforcement and suffers from runtime errors and repetitive match statements.\n\n2.  **Structures with Transitions:** Using distinct structs for each state with `From` and `Into` traits to define valid transitions. This provides compile-time safety for transitions and consumes the old state during transitions but leads to code repetition and difficulty in managing shared state.\n\n3.  **Generics:**  The most sophisticated approach, using a generic struct `BottleFillingMachine<S>` where `S` represents the current state as a type parameter. `From` implementations are used to define allowed transitions between `BottleFillingMachine<Waiting>`, `BottleFillingMachine<Filling>`, and `BottleFillingMachine<Done>`. This achieves compile-time safety, clear error messages, and allows for shared state within the `BottleFillingMachine` struct.  This method provides the best balance of compile-time guarantees, readability, and reduced code duplication.\n\nThe article concludes that the generic approach offers the most advantages, ensuring valid transitions at compile time with understandable error messages, while also allowing for shared state and adhering to Rust's principles of type safety and performance.\n",
    "chinese_title": "Rust 中漂亮的有限状态机模式 (2016)",
    "chinese_summary": "本文探讨了实现状态机的不同 Rust 设计模式，重点在于编译时安全性和代码清晰度。文章首先定义了状态机及其在各种应用中的重要性，强调了强制执行有效状态转换的必要性。\n\n作者提出了三种实现方法：\n\n1.  **枚举：** 一种基于枚举的基础方法，其中状态是枚举的变体。此方法简单，但缺乏编译时转换强制执行，并存在运行时错误和重复的 match 语句。\n\n2.  **带转换的结构体：** 为每个状态使用不同的结构体，并使用 `From` 和 `Into` 特性来定义有效的转换。这为转换提供了编译时安全性，并在转换过程中消耗旧状态，但会导致代码重复和共享状态管理困难。\n\n3.  **泛型：** 最复杂的方法，使用泛型结构体 `BottleFillingMachine<S>`，其中 `S` 代表当前状态作为类型参数。`From` 实现用于定义 `BottleFillingMachine<Waiting>`、`BottleFillingMachine<Filling>` 和 `BottleFillingMachine<Done>` 之间允许的转换。这实现了编译时安全性、清晰的错误消息，并允许在 `BottleFillingMachine` 结构体中共享状态。这种方法在编译时保证、可读性和减少代码重复之间提供了最佳平衡。\n\n文章总结说，泛型方法提供了最多的优势，确保了在编译时进行有效的转换，并提供易于理解的错误消息，同时还允许共享状态并遵守 Rust 的类型安全和性能原则。"
  },
  {
    "id": "43735902",
    "title": "Android phones will soon reboot themselves after sitting unused for three days",
    "url": "https://arstechnica.com/gadgets/2025/04/android-phones-will-soon-reboot-themselves-after-sitting-unused-for-3-days/",
    "summary": "This article discusses a new feature coming to Android devices via a Google Play Services update (v25.14) that will automatically reboot locked phones after three days of inactivity. This \"inactivity reboot\" enhances security by forcing the phone into a \"Before First Unlock\" (BFU) state. In the BFU state, biometrics and location-based unlocking are disabled, requiring a passcode or PIN for access, and all data is encrypted, making it significantly harder to extract data, even with advanced tools.\n\nThe update is similar to Apple's \"Inactivity Reboot\" and aims to minimize the period a phone remains in an unencrypted state when left untouched. The update will roll out silently in the coming weeks without requiring user action, showcasing Google's ability to improve security across a wide range of Android devices through Play Services updates. While Google's centralized control through Play Services raises some concerns, in this case, it allows for rapid and widespread security enhancements. The author, Ryan Whitwam, highlights that this move will limit the exposure of personal data stored on phones even when plugged in for extended periods of inactivity.\n",
    "chinese_title": "安卓手机闲置三天后将自动重启",
    "chinese_summary": "本文讨论了通过 Google Play 服务更新 (v25.14) 为 Android 设备带来的一项新功能，该功能将在闲置三天后自动重启已锁定的手机。这种“闲置重启”通过强制手机进入“首次解锁前 (BFU)”状态来增强安全性。在 BFU 状态下，生物识别和基于位置的解锁将被禁用，需要密码或 PIN 码才能访问，并且所有数据都将被加密，从而大大增加了提取数据的难度，即使使用高级工具也是如此。\n\n该更新类似于苹果的“闲置重启”，旨在最大限度地减少手机在无人触碰时保持未加密状态的时间。该更新将在未来几周内静默推出，无需用户操作，这展示了 Google 通过 Play 服务更新在各种 Android 设备上改进安全性的能力。 虽然 Google 通过 Play 服务进行集中控制引起了一些担忧，但在这种情况下，它可以实现快速而广泛的安全增强。 作者 Ryan Whitwam 强调，即使手机长时间处于闲置状态并插上电源，此举也将限制存储在手机上的个人数据的暴露。"
  },
  {
    "id": "43744116",
    "title": "OAuth's Role in MCP Security",
    "url": "https://defensiblesystems.substack.com/p/oauths-role-in-mcp-security",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "OAuth在MCP安全中的作用",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "43669151",
    "title": "Silicon Valley crosswalk buttons apparently hacked to imitate Musk, Zuck voices",
    "url": "https://www.paloaltoonline.com/technology/2025/04/12/silicon-valley-crosswalk-buttons-apparently-hacked-to-imitate-musk-zuckerberg-voices/",
    "summary": "Crosswalk buttons in Redwood City, Menlo Park, and Palo Alto were hacked last week to play voice impersonations of Mark Zuckerberg and Elon Musk. The altered messages contained controversial and often cynical statements attributed to the tech moguls.\n\nLocations impacted included the corner of Arguello Street, Broadway and Marshall Street in Redwood City, downtown Palo Alto, and near Meta's headquarters in Menlo Park. The fake Zuckerberg voice discussed AI and societal impact, while the fake Musk voice made crude jokes and cynical remarks.\n\nCity officials in Palo Alto and Redwood City disabled the voice announcement features on the affected crosswalks to prevent further disruptions and ensure public safety. Palo Alto determined 12 downtown intersections were affected. Redwood City identified four locations.\n\nMenlo Park indicated that the affected crosswalks are operated by Caltrans, not the city itself. Caltrans confirmed its crosswalks were impacted in Menlo Park and Palo Alto and deactivated the audio. They are working to restore full functionality as quickly as possible, with crosswalks currently operating on a timer. Officials from all affected cities emphasized that tampering with city infrastructure is unlawful and dangerous.\n",
    "chinese_title": "硅谷人行道按钮疑被黑客入侵，模仿马斯克、扎克声音",
    "chinese_summary": "上周，红木城、门洛帕克和帕洛阿尔托的斑马线按钮遭黑客入侵，播放了马克·扎克伯格和埃隆·马斯克的模仿声音。这些篡改后的信息包含了一些有争议且通常带有讽刺意味的言论，并被归于这些科技巨头。\n\n受影响的地点包括红木城的阿圭洛街角、百老汇和马歇尔街，帕洛阿尔托市中心以及门洛帕克Meta总部附近。 假扎克伯格的声音讨论了人工智能和社会影响，而假马斯克的声音则发表了粗俗的笑话和带有讽刺意味的评论。\n\n帕洛阿尔托和红木城的城市官员禁用了受影响斑马线的语音提示功能，以防止进一步的干扰并确保公共安全。帕洛阿尔托确定有12个市中心路口受到影响。 红木城确定了四个地点。\n\n门洛帕克表示，受影响的斑马线由加州交通局 (Caltrans) 运营，而不是该市。 加州交通局证实其在门洛帕克和帕洛阿尔托的斑马线受到了影响，并停用了音频。 他们正在努力尽快恢复全部功能，目前的斑马线正在定时运行。 所有受影响城市的官员都强调，篡改城市基础设施是非法且危险的。"
  },
  {
    "id": "43717513",
    "title": "First baby born in UK to woman with transplanted womb",
    "url": "https://www.bbc.com/news/articles/c78jd517z87o",
    "summary": "In a groundbreaking achievement, Grace Davidson, 36, has become the first woman in the UK to give birth after receiving a womb transplant. Grace, who was born with MRKH syndrome, received her sister Amy's womb in a pioneering surgery in 2023. In February 2025, she and her husband, Angus, welcomed their daughter Amy, named in honor of Grace's sister and donor.\n\nThe successful birth marks a significant milestone in reproductive medicine, offering hope to thousands of women in the UK born without a functioning uterus. The 17-hour transplant surgery involved a team of over 30 medics. Following the transplant, Grace had her first period and became pregnant on her first attempt at IVF.\n\nSince Grace's transplant, the surgical team has performed three more womb transplants using deceased donors and aims to carry out a total of 15 as part of a clinical trial. The team is led by surgeon Isabel Quiroga and Dr. Richard Smith. Womb Transplant UK is funding these operations and is actively raising money for further procedures.\n\nThe baby was delivered via C-section. The donated womb will be removed after Grace and Angus have their second child, at which point Grace can stop taking immunosuppressant medication. The birth of baby Amy is celebrated as a \"little miracle\" and has given hope to other women with uterine factor infertility, for whom surrogacy or adoption were the only previous options.\n",
    "chinese_title": "英国首例接受子宫移植的女性诞下婴儿",
    "chinese_summary": "在突破性进展中，36岁的格蕾丝·戴维森成为英国首位接受子宫移植后分娩的女性。格蕾丝天生患有MRKH综合征，2023年通过一项开创性手术接受了她姐姐艾米的子宫。2025年2月，她和丈夫安格斯迎来了女儿艾米，以纪念格蕾丝的姐姐和捐赠者。\n\n这次成功分娩标志着生殖医学领域的一个重要里程碑，为英国成千上万天生子宫功能不全的女性带来了希望。历时17小时的移植手术涉及一个由30多名医务人员组成的团队。移植后，格蕾丝第一次来了月经，并在第一次试管婴儿尝试中怀孕。\n\n自格蕾丝移植后，该手术团队又进行了三例使用已故捐赠者子宫的移植手术，并计划作为临床试验的一部分总共进行15例移植手术。该团队由外科医生伊莎贝尔·基罗加和理查德·史密斯博士领导。“英国子宫移植”正在资助这些手术，并积极为进一步的手术筹集资金。\n\n婴儿通过剖腹产分娩。在格蕾丝和安格斯生育第二个孩子后，捐赠的子宫将被移除，届时格蕾丝可以停止服用免疫抑制剂药物。艾米宝宝的出生被誉为“小小的奇迹”，并为其他患有子宫因素不孕症的女性带来了希望，此前她们唯一的选择是代孕或收养。"
  },
  {
    "id": "43740021",
    "title": "A unique sound alleviates motion sickness",
    "url": "https://www.nagoya-u.ac.jp/researchinfo/result-en/2025/04/20250408-01.html",
    "summary": "Researchers at Nagoya University have discovered that a specific, low-frequency sound (100 Hz), dubbed \"sound spice®,\" can alleviate motion sickness. Led by Takumi Kagawa and Masashi Kato, the study, published in Environmental Health and Preventive Medicine, showed that even a single minute of exposure to this sound reduced motion sickness symptoms like nausea and dizziness in participants reading in moving vehicles or using driving simulators.\n\nThe sound is believed to work by stimulating the otolithic organs in the inner ear, which are responsible for balance and spatial orientation, activating the vestibular system. Experiments involved exposing volunteers to the sound before inducing motion sickness through swings, simulators, or car rides. Results showed that the sound enhanced sympathetic nerve activation and reduced symptoms like lightheadedness.\n\nThe researchers emphasize the safety of the sound, with levels well below workplace noise standards. They believe this technology offers a safe and effective method to combat motion sickness and plan to further develop it for use in various travel scenarios, including air and sea travel. The study highlights the potential of sound-based interventions for managing common disorders.\n",
    "chinese_title": "独特的声响缓解晕动症",
    "chinese_summary": "名古屋大学研究人员发现，一种特定的低频声音（100赫兹），被称为“声音香料®”，可以缓解晕动症。由香川拓己和加藤正志领导的这项研究发表在《环境健康与预防医学》杂志上，结果表明，即使在移动车辆中阅读或使用驾驶模拟器的参与者，暴露于这种声音一分钟也能减轻恶心和头晕等晕动症症状。\n\n据信，这种声音通过刺激内耳中的椭圆囊和球囊（负责平衡和空间定位的器官）来激活前庭系统。实验包括在通过秋千、模拟器或乘车诱发晕动症之前，让志愿者接触这种声音。结果表明，这种声音增强了交感神经的激活，并减轻了头昏眼花等症状。\n\n研究人员强调了这种声音的安全性，其水平远低于工作场所的噪音标准。他们认为这项技术提供了一种安全有效的对抗晕动症的方法，并计划进一步开发它，以便在各种旅行场景中使用，包括航空和海上旅行。这项研究强调了基于声音的干预措施在管理常见疾病方面的潜力。"
  },
  {
    "id": "43743897",
    "title": "Maybe Meta's Llama claims to be open source because of the EU AI act",
    "url": "https://simonwillison.net/2025/Apr/19/llama-eu-ai-act/",
    "summary": "This article explores the theory that Meta's insistence on labeling its Llama models as \"open source,\" despite not meeting the Open Source Definition, might be strategically motivated by the EU AI Act. The author investigates the Act, which offers special exemptions for open-source AI models, focusing on Recitals 89 & 102, and Article 2(12).\n\nThe author uses Gemini 2.5 Flash to analyze the Act and extract mentions of open source, finding that the Act doesn't require OSI compliance for models to be considered open source within its framework. It defines \"free and open-source\" as allowing users to freely access, use, modify, and redistribute models with potential standard conditions like attribution or similar distribution terms. The key point is that the Act focuses on accessibility and usage rights rather than strict adherence to the OSI definition.\n\nThe author concludes that Meta's use of \"open source\" for Llama may be influenced by these EU AI Act exemptions, even if it doesn't align with the traditional open-source meaning. The author acknowledges being a layperson and the risk of using LLMs for legal analysis, yet justifies its use to understand the document. Finally, the article mentions that this strategy of misusing the term predates the EU AI act with reference to Meta's React library.\n",
    "chinese_title": "也许Meta的Llama声称是开源的，是因为欧盟的AI法案。",
    "chinese_summary": "本文探讨了一种理论，即 Meta 坚持将其 Llama 模型标记为“开源”，尽管其不符合开源定义，可能是出于欧盟人工智能法案的战略动机。作者研究了该法案，其中为开源人工智能模型提供了特殊豁免，重点关注序言 89 和 102 以及第 2(12) 条。\n\n作者使用 Gemini 2.5 Flash 分析该法案并提取对开源的提及，发现该法案并不要求模型符合 OSI 标准才能在其框架内被视为开源。它将“自由和开源”定义为允许用户自由访问、使用、修改和重新分发模型，并可能包含标准条件，例如署名或类似的发行条款。关键在于该法案侧重于可访问性和使用权，而不是严格遵守 OSI 定义。\n\n作者得出结论，Meta 将“开源”用于 Llama 可能受到这些欧盟人工智能法案豁免的影响，即使这与传统的开源含义不符。作者承认自己是外行，并且使用 LLM 进行法律分析存在风险，但证明其使用是为了理解该文件。最后，文章提到，这种滥用该术语的策略早于欧盟人工智能法案，并参考了 Meta 的 React 库。"
  },
  {
    "id": "43740992",
    "title": "Layered Design in Go",
    "url": "https://jerf.org/iri/post/2025/go_layered_design/",
    "summary": "This article details a layered design approach for Go programs, driven by Go's restriction against circular package dependencies. The author emphasizes that understanding and leveraging this constraint is crucial for maintainable and scalable Go code.\n\nThe core idea is to visualize the package hierarchy as a directed acyclic graph, with packages arranged in layers based on their import dependencies. Packages at the bottom layer have no internal dependencies, while higher layers import packages from lower layers. This structure is not prescriptive but a fundamental consequence of Go's rules.\n\nThe author argues this layered approach, while sometimes leading to deeper import chains, is a sound design methodology on its own. It harmonizes well with functional programming principles, such as purifiable subcomponents, and ensures that understanding a package requires understanding only a limited subset of the codebase.\n\nWhen faced with circular dependency errors, the author recommends a thorough analysis to pinpoint the exact source of the circularity, often identifying a \"breakable link\" of specific code. Resolution strategies include:\n\n1.  **Move Functionality:** Relocating the offending code to a package where it logically belongs.\n2.  **Create a Third Package:** Extracting the shared code into a new package that both original packages can import.\n\nThese refactorings increase conceptual clarity and improve package design. While higher-level design patterns can be applied, they must operate within the constraints of Go's layered architecture, avoiding reliance on circular dependencies.\n",
    "chinese_title": "Go语言中的分层设计",
    "chinese_summary": "本文详述了一种用于 Go 程序的层次化设计方法，该方法源于 Go 语言对循环包依赖的限制。作者强调，理解并利用此约束对于可维护和可扩展的 Go 代码至关重要。\n\n其核心思想是将包层次结构可视化为有向无环图，根据其导入依赖关系将包排列在不同的层级中。底层包没有内部依赖，而较高层级的包则导入较低层级的包。这种结构并非规定性的，而是 Go 语言规则的基本结果。\n\n作者认为，这种层次化方法本身就是一种可靠的设计方法，尽管有时会导致更深的导入链。它与诸如可净化子组件等函数式编程原则非常协调，并确保理解一个包只需要理解代码库的一个有限子集。\n\n当遇到循环依赖错误时，作者建议进行彻底的分析，以查明循环的确切来源，通常会识别出特定代码的“可断开链接”。解决方案包括：\n\n1.  **移动功能：** 将违规代码重新定位到其逻辑所属的包中。\n2.  **创建第三个包：** 将共享代码提取到一个新包中，供两个原始包导入。\n\n这些重构提高了概念清晰度并改进了包设计。虽然可以应用更高级别的设计模式，但它们必须在 Go 语言分层架构的约束范围内运行，避免依赖循环依赖。"
  },
  {
    "id": "43739529",
    "title": "Electromagnetism as a Purely Geometric Theory",
    "url": "https://iopscience.iop.org/article/10.1088/1742-6596/2987/1/012001",
    "summary": "The provided text is NOT an article. It's a Radware Bot Manager Captcha message. It's a security measure to verify that the user accessing a website is a human, not a bot. The message indicates a request to confirm humanity by ticking a box. If the user encounters problems, they are directed to contact the website's support team with a screenshot of the issue. The \"Incident ID\" is a unique identifier for the failed captcha attempt, potentially used for troubleshooting.\n\nTherefore, a summary of the \"article\" is impossible as it is not an article but a security prompt. There's no information about electromagnetism or geometric theory present.\n",
    "chinese_title": "纯几何理论的电磁学",
    "chinese_summary": "提供的文本并非文章，而是Radware Bot Manager的验证码消息。这是一种安全措施，用于验证访问网站的用户是人类而非机器人。消息指示需要勾选方框以确认身份。如果用户遇到问题，请联系网站支持团队并提供问题截图。“事件ID”是验证码失败尝试的唯一标识符，可能用于故障排除。\n\n因此，由于它不是文章，而是一个安全提示，所以无法对“文章”进行总结。 其中不包含有关电磁学或几何理论的信息。"
  },
  {
    "id": "43738485",
    "title": "Ssl.com: DCV bypass and issue fake certificates for any MX hostname",
    "url": "https://bugzilla.mozilla.org/show_bug.cgi?id=1961406",
    "summary": "This bug report details a critical vulnerability in SSL.com's Domain Control Validation (DCV) process, specifically regarding the \"Email to DNS TXT Contact\" (BR 3.2.2.4.14) method. The reporter, ragtime_knoll5n, discovered that SSL.com incorrectly validates domain ownership by associating the hostname of the email address used for verification (the part after the \"@\") with the requested domain, even if no legitimate connection exists.\n\nThe reporter demonstrated this by creating a TXT record for a subdomain of a test domain with a value containing an email address from aliyun.com (myusername@aliyun.com). When requesting a certificate for the test domain and choosing that email for verification, SSL.com incorrectly added aliyun.com to the list of the reporter's verified domains. This allowed the reporter to subsequently request and receive valid SSL certificates for aliyun.com and www.aliyun.com, despite having no authorization to do so.\n\nThis constitutes a significant security risk, allowing unauthorized individuals to obtain certificates for domains they do not own or control, potentially leading to phishing attacks, man-in-the-middle attacks, and other malicious activities.\n\nSSL.com has acknowledged the bug report, is investigating the issue, and has temporarily disabled the affected domain validation method (3.2.2.4.14) for SSL/TLS certificates while they conduct their investigation. They expect to provide a preliminary report by April 21, 2025.\n",
    "chinese_title": "Ssl.com：绕过DCV并为任何MX主机名签发伪造证书",
    "chinese_summary": "此漏洞报告详细描述了SSL.com域名控制验证(DCV)过程中的一个严重漏洞，特别是关于\"发送电子邮件至DNS TXT联系人\"(BR 3.2.2.4.14)方法。报告者ragtime_knoll5n发现，SSL.com错误地验证域名所有权，将用于验证的电子邮件地址的主机名（\"@\"后面的部分）与请求的域名相关联，即使不存在合法连接。\n\n报告者通过为测试域的子域创建一个TXT记录来证明这一点，该记录的值包含来自aliyun.com的电子邮件地址(myusername@aliyun.com)。当请求该测试域的证书并选择该电子邮件进行验证时，SSL.com错误地将aliyun.com添加到报告者验证的域名列表中。这使得报告者随后能够请求并收到aliyun.com和www.aliyun.com的有效SSL证书，尽管他们没有获得授权这样做。\n\n这构成了一项重大的安全风险，允许未经授权的个人获取他们不拥有或控制的域名的证书，可能导致网络钓鱼攻击、中间人攻击和其他恶意活动。\n\nSSL.com已确认该漏洞报告，正在调查该问题，并已暂时禁用受影响的域名验证方法（3.2.2.4.14），用于SSL/TLS证书，以便进行调查。他们预计将在2025年4月21日之前提供初步报告。"
  },
  {
    "id": "43744342",
    "title": "Tini: A tiny but valid `init` for containers",
    "url": "https://github.com/krallin/tini",
    "summary": "Tini is a minimalist `init` process designed for running within containers, primarily Docker. It addresses issues like zombie process accumulation, ensures proper signal handling (like SIGTERM), and operates transparently without requiring changes to existing Docker images.\n\nTo use Tini, add the executable to your container and set it as the entrypoint, passing your application and arguments to Tini. Docker versions 1.13 and later include Tini, enabled with the `--init` flag. Pre-built images are available, and packages exist for Alpine Linux and NixOS.\n\nTini offers features like:\n\n*   **Verbosity:** Adjustable output levels for debugging.\n*   **Subreaping:** Can be registered as a subreaper when not running as PID 1 (Linux >= 3.4).\n*   **Exit Code Remapping:** Remaps exit codes (e.g., Java apps exiting with 143).\n*   **Process Group Killing:** Sends signals to the entire child process group.\n*   **Parent Death Signal:** Configures a signal Tini receives when its parent exits.\n\nVerifying the downloaded binary via signature or checksum is recommended. Statically-linked versions are available for maximum compatibility. The article also explains how to build Tini from source and how it handles process management.\n",
    "chinese_title": "Tini：容器中一个微小但有效的`init`程序",
    "chinese_summary": "Tini：容器的极简`init`进程\n\nTini 是一个极简的 `init` 进程，专为在容器内（主要为 Docker）运行而设计。它解决了僵尸进程累积等问题，确保正确的信号处理（如 SIGTERM），并以透明的方式运行，无需更改现有的 Docker 镜像。\n\n要使用 Tini，请将可执行文件添加到您的容器，并将其设置为入口点，将您的应用程序和参数传递给 Tini。Docker 1.13 及更高版本包含 Tini，可通过 `--init` 标志启用。预构建的镜像可用，并且存在适用于 Alpine Linux 和 NixOS 的软件包。\n\nTini 提供以下功能：\n\n*   **详细程度：** 可调整的输出级别，用于调试。\n*   **子收割：** 在未作为 PID 1 运行时，可以注册为子收割机（Linux >= 3.4）。\n*   **退出代码重映射：** 重映射退出代码（例如，Java 应用程序退出时返回 143）。\n*   **进程组杀死：** 将信号发送到整个子进程组。\n*   **父进程死亡信号：** 配置 Tini 在其父进程退出时收到的信号。\n\n建议通过签名或校验和验证下载的二进制文件。静态链接版本可实现最大的兼容性。文章还解释了如何从源代码构建 Tini 以及它如何处理进程管理。"
  },
  {
    "id": "43737469",
    "title": "An image of the Australian desert illuminates satellite pollution",
    "url": "https://www.thisiscolossal.com/2025/04/a-stunning-image-of-the-australian-desert-illuminates-the-growing-problem-of-satellite-pollution/",
    "summary": "Joshua Rozells' stunning photograph taken in the Australian Pinnacles Desert showcases the increasing problem of satellite pollution. Intending to capture a star trail, Rozells instead found his images riddled with satellite trails. He compiled 343 distinct photos to create a composite image highlighting the growing density of artificial objects in the night sky.\n\nThe article points to the launch of SpaceX's Starlink in 2019 as a turning point, sparking a race among companies to launch satellites. The number of satellites in orbit has surpassed 10,000 and is projected to increase dramatically, with SpaceX alone planning to launch 40,000 more.\n\nRozells' work serves as a visual representation of the concerns voiced by astronomers, who warn that the proliferation of satellites will exacerbate light pollution and hinder the study of space. They emphasize the lack of regulation in the satellite industry as a major factor contributing to the unchecked growth of this pollution.\n\nThe article highlights the efforts of organizations like the International Astronomical Union’s Center for the Protection of the Dark and Quiet Sky, which are advocating for regulation and protection of the night sky.\n",
    "chinese_title": "澳大利亚沙漠的图像揭示卫星污染",
    "chinese_summary": "约书亚·罗泽尔斯在澳大利亚尖峰石阵沙漠拍摄的精美照片，展示了日益严重的卫星污染问题。罗泽尔斯本想捕捉星迹，却发现他的照片充斥着卫星轨迹。他汇集了 343 张不同的照片，合成了一张图像，突显了夜空中人造物体日益增长的密度。\n\n文章指出，SpaceX 公司于 2019 年发射的星链是转折点，引发了各公司发射卫星的竞赛。轨道上的卫星数量已超过 10,000 颗，预计将急剧增加，仅 SpaceX 就计划再发射 40,000 颗。\n\n罗泽尔斯的作品以视觉形式呈现了天文学家们表达的担忧，他们警告说，卫星的激增将加剧光污染，并阻碍太空研究。他们强调，卫星行业缺乏监管是导致这种污染不受控制增长的主要因素。\n\n文章重点介绍了像国际天文学联合会黑暗与宁静天空保护中心这样的组织所做的努力，他们正在倡导对夜空进行监管和保护。"
  },
  {
    "id": "43738195",
    "title": "Don't force your kids to do math",
    "url": "https://blog.avocados.ovh/posts/how-to-force-your-kids-to-do-math/",
    "summary": "This article argues against forcing children to learn math, advocating instead for a playful and curiosity-driven approach. The author's \"one rule\" is to stop math activities immediately if the child expresses disinterest, emphasizing that math should feel like play, not work.\n\nThe author highlights the importance of fostering a child's natural curiosity by integrating math into everyday life from a young age. This includes counting, naming, and explaining the world around them, emphasizing that a parent's genuine enthusiasm for math is contagious. The author shared examples of using games, stories, and real-world scenarios like shopping or train rides to make math engaging. Repetition through play is also key.\n\nHowever, the author cautions against imposing personal passions on children, recognizing the delicate balance between sharing interests and creating undue pressure. He acknowledges that children may not always express discomfort openly and that parents must be mindful of their own ego in pushing activities. The author notes that his son's interests shifted away from structured math games naturally, and that's okay.\n\nUltimately, the goal is not just mathematical proficiency but nurturing a child's inherent desire to learn, explore, and marvel at the world. The author prioritizes fostering a child's natural eagerness to learn over formal math education, highlighting the joy of witnessing his son's intellectual curiosity, such as his fascination with the concept of infinity.\n",
    "chinese_title": "不要强迫孩子学数学",
    "chinese_summary": "本文反对强迫孩子学习数学，提倡以玩乐和好奇心驱动的方式进行学习。作者的“一条规则”是如果孩子表现出不感兴趣，应立即停止数学活动，强调数学应该感觉像玩耍，而不是工作。\n\n作者强调从小将数学融入日常生活，培养孩子与生俱来的好奇心。这包括计数、命名和解释周围的世界，并强调父母对数学的真正热情具有感染力。作者分享了使用游戏、故事和现实场景（如购物或乘坐火车）来使数学更具吸引力的例子。通过玩耍进行重复练习也很关键。\n\n然而，作者告诫不要将个人热情强加于孩子身上，认识到分享兴趣和制造不当压力之间的微妙平衡。他承认孩子们可能不会总是公开表达不适，父母必须注意自己在推动活动时的自我意识。作者指出，他的儿子的兴趣自然地从结构化的数学游戏转向了其他方面，这也没关系。\n\n最终，目标不仅仅是数学能力，而是培养孩子与生俱来的学习、探索和惊叹世界的渴望。作者优先培养孩子与生俱来的学习热情，而不是正规的数学教育，并强调了目睹儿子对知识的好奇心（例如他对无限概念的着迷）的喜悦。"
  },
  {
    "id": "43735239",
    "title": "Restoring the Galaxian3 Theatre 6, 1992 six player arcade machine",
    "url": "https://philwip.com/2025/04/14/galaxian-3-project-revival/",
    "summary": "This article details the ongoing restoration project of a rare Galaxian3 Theatre 6 six-player arcade machine from 1992, located at Fun World arcade in Nashua, New Hampshire. The initial assessment in March 2024 revealed issues including malfunctioning player inputs, missing sound, and a blurry projector image. The team, led by Phil Bennett, identified that only players 1 & 2 worked. The central issue was traced to faulty PSN PCBs.\n\nThe article provides a hardware overview, detailing the complex system architecture with its various PCBs, including the Master, Slave, DSP, PGN, OBJ, V-MIX, C-RAM, RSO and Sound PCBs, along with Pioneer LaserDisc players and Yamaha audio amplifiers.\n\nA major focus was the preservation of the game's data. The team successfully digitized the LaserDiscs using a Domesday Duplicator setup with a calibrated Pioneer HLD-X0 MUSE player, and also dumped the ROM data from the PCBs, including an undumped Project Dragoon revision (minus one missing ROM).\n\nExtensive bench testing and schematic tracing of the PSN PCB were conducted to diagnose the player input issues. While initially suspected, the RSO PCB was ruled out as a source of the problem.\n\nA return trip in March 2025 was planned, armed with more knowledge, advanced diagnostic equipment, and a projector specialist, to address the player input issues and service the projector, with the ultimate goal of fully restoring the game.\n",
    "chinese_title": "修复1992年六人Galaxian3剧场版大型电玩机台",
    "chinese_summary": "本文详细介绍了位于新罕布什尔州纳舒厄市Fun World游戏厅的一台1992年产稀有Galaxian3 Theatre 6六人街机游戏的修复项目。2024年3月的初步评估显示，该机器存在玩家输入故障、声音缺失和投影仪图像模糊等问题。由Phil Bennett领导的团队确定只有玩家1和2可以使用。核心问题被追溯到有故障的PSN PCB。\n\n文章提供了硬件概述，详细介绍了包括Master、Slave、DSP、PGN、OBJ、V-MIX、C-RAM、RSO和Sound PCB等各种PCB的复杂系统架构，以及Pioneer LaserDisc播放器和Yamaha音频放大器。\n\n一个主要重点是游戏数据的保存。团队成功地使用配备校准Pioneer HLD-X0 MUSE播放器的Domesday Duplicator设置数字化了LaserDisc，并从PCB上转储了ROM数据，包括一个未转储的Project Dragoon修订版（缺少一个ROM）。\n\n对PSN PCB进行了广泛的台式测试和原理图追踪，以诊断玩家输入问题。虽然最初怀疑是RSO PCB的问题，但后来排除了这种可能性。\n\n计划在2025年3月再次前往，带着更多的知识、先进的诊断设备和一位投影仪专家，以解决玩家输入问题并维修投影仪，最终目标是完全修复这款游戏。"
  },
  {
    "id": "43736193",
    "title": "Packing Input Frame Context in Next-Frame Prediction Models for Video Generation",
    "url": "https://lllyasviel.github.io/frame_pack_gitpage/",
    "summary": "This paper introduces a video generation model that achieves high-quality results with impressive efficiency. Key advancements include generating video at a full 30 frames per second (fps) with a 13B parameter model using only 6GB of laptop GPU memory. This is accomplished without relying on timestep distillation.\n\nThe model is designed to be accessible for personal and lab experimentation, allowing finetuning of the 13B video model at a batch size of 64 on a single 8xA100/H100 node. Furthermore, inference is practical even on personal hardware; an RTX 4090 can generate frames at a rate of 2.5 seconds per frame (unoptimized) or 1.5 seconds per frame using teacache optimization.\n\nThe approach is described as \"video diffusion, but feels like image diffusion,\" implying that the architecture and training methodologies allow for a simplified diffusion process, potentially leveraging advancements in image diffusion models. The core innovation appears to be packing input frame context efficiently, leading to a model capable of generating high-resolution, high-framerate video with relatively low computational resources.\n",
    "chinese_title": "在视频生成中，将输入帧上下文打包进下一帧预测模型",
    "chinese_summary": "本文介绍了一种视频生成模型，该模型以令人印象深刻的效率实现了高质量的结果。主要进展包括仅使用 6GB 笔记本电脑 GPU 内存，即可使用 13B 参数模型以每秒 30 帧 (fps) 的全速生成视频，且无需依赖时间步蒸馏。\n\n该模型旨在方便个人和实验室进行实验，允许在单个 8xA100/H100 节点上以 64 的批量大小对 13B 视频模型进行微调。此外，即使在个人硬件上，推理也是可行的；RTX 4090 可以以每帧 2.5 秒（未优化）或使用 teacache 优化以每帧 1.5 秒的速度生成帧。\n\n该方法被描述为“视频扩散，但感觉像图像扩散”，这意味着该架构和训练方法允许简化的扩散过程，可能利用了图像扩散模型的进步。核心创新似乎是高效地打包输入帧上下文，从而使该模型能够以相对较低的计算资源生成高分辨率、高帧率的视频。"
  },
  {
    "id": "43708789",
    "title": "Eccfrog512ck2: An Enhanced 512-Bit Weierstrass Elliptic Curve [pdf]",
    "url": "https://arxiv.org/abs/2504.09584",
    "summary": "This arXiv article (arXiv:2504.09584) submitted on April 13, 2025, introduces a new 512-bit Weierstrass elliptic curve called \"Eccfrog512ck2\". Authored by Víctor Duarte Melo and William J. Buchanan, the paper argues for a need for increased security beyond the commonly used NIST P256 (secp256r1) and secp256k1 curves, which offer 128-bit security. While curves like NIST P-521, Curve 448, and Brainpool-P512 achieve 256-bit security, the authors propose Eccfrog512ck2 as a more performant alternative.\n\nThe key claim is that Eccfrog512ck2 provides 256-bit security with enhanced performance compared to NIST P-521.  Specifically, the paper states Eccfrog512ck2 achieves a 61.5% speed-up in scalar multiplication and a 33.3% speed-up in point generation. Furthermore, the curve is designed to be resistant to side-channel attacks and avoid vulnerabilities like the MOV attack. The paper is categorized under Cryptography and Security (cs.CR).\n",
    "chinese_title": "Eccfrog512ck2：增强型 512 位魏尔斯特拉斯椭圆曲线 [pdf]",
    "chinese_summary": "这篇arXiv文章 (arXiv:2504.09584)，于2025年4月13日提交，介绍了一种新的512位魏尔斯特拉斯椭圆曲线，名为“Eccfrog512ck2”。该论文由Víctor Duarte Melo和William J. Buchanan撰写，论证了需要超越常用的NIST P256 (secp256r1)和secp256k1曲线的安全级别，后两者提供128位安全性。虽然像NIST P-521、Curve 448和Brainpool-P512这样的曲线实现了256位安全性，但作者提出Eccfrog512ck2作为一种性能更高的替代方案。\n\n其主要论点是，与NIST P-521相比，Eccfrog512ck2提供256位安全性，同时性能得到增强。具体来说，该论文指出Eccfrog512ck2在标量乘法中实现了61.5%的加速，在点生成中实现了33.3%的加速。此外，该曲线被设计为能够抵抗侧信道攻击，并避免像MOV攻击这样的漏洞。该论文被归类于密码学和安全（cs.CR）类别下。"
  },
  {
    "id": "43738675",
    "title": "The Icelandic Voting System (2024)",
    "url": "https://smarimccarthy.is/posts/2024-11-25-voting-system/",
    "summary": "This article explains the Icelandic biproportional voting system, which is also used in Norway and some regions of Switzerland and Germany. The system involves dividing seats into constituency seats (CS) and adjustment seats (AS).\n\nFirst, CS are allocated in each constituency using the d'Hondt divisor rule (V/(s+1)), where the party with the highest quotient of votes (V) divided by allocated seats (s+1) gets a seat. This process repeats until all CS are assigned.\n\nNext, AS are allocated nationally to correct disproportionality. Parties must pass a 5% threshold to be eligible. Ideally, AS allocation should minimize entropy, as proven by Balinski & DeMange, but Iceland uses an approximation method that fails monotonicity, causing instances where a party loses a seat despite gaining votes. This inaccurate method favors larger parties.\n\nThe author suggests increasing the number of AS to 50% or even 100% of total seats to reduce vote inequality and provincialism. As an alternative voting system, the author recommends \"Majority Judgement\" which uses a grading system for each voter for each party which would avoid the Arrow Impossibility Theorem.\n\nFinally, the author mentions a voting system simulator co-created with Þorkell Helgason, allowing for comparison of different voting systems, including the Icelandic one and the optimal entropy method.\n",
    "chinese_title": "冰岛选举制度 (2024)",
    "chinese_summary": "本文解释了冰岛的两比例代表制投票系统，该系统也应用于挪威以及瑞士和德国的一些地区。该系统包括将席位划分为选区席位（CS）和调整席位（AS）。\n\n首先，在每个选区中使用洪特法则（V/(s+1)）分配CS，即得票数（V）除以已分配席位数（s+1）的商最高的政党获得席位。这个过程重复进行，直到所有CS都被分配完毕。\n\n接下来，在全国范围内分配AS以纠正比例失调。各政党必须通过5%的门槛才有资格参与分配。理想情况下，AS分配应最大限度地减少熵，正如Balinski & DeMange所证明的那样，但冰岛使用了一种近似方法，该方法不具备单调性，导致出现政党得票数增加却失去席位的情况。这种不准确的方法有利于较大的政党。\n\n作者建议将AS的数量增加到总席位的50%甚至100%，以减少选票不平等和地方保护主义。作为一种替代投票制度，作者推荐“多数裁决”，该制度对每位选民对每个政党的评价进行分级，从而避免阿罗不可能定理。\n\n最后，作者提到了与Þorkell Helgason共同创建的投票系统模拟器，该模拟器可以比较不同的投票系统，包括冰岛的投票系统和最佳熵方法。"
  },
  {
    "id": "43717403",
    "title": "Models of Ice Skating for the Development of Robotic Ice Skating Gaits [pdf] (2020)",
    "url": "https://www2.eecs.berkeley.edu/Pubs/TechRpts/2021/EECS-2021-162.pdf",
    "summary": "This 2020 PDF document, titled \"Models of Ice Skating for the Development of Robotic Ice Skating Gaits,\" appears to be the raw, potentially unedited, data that comprises the core of the article. Unfortunately, due to the encoded and compressed nature of the PDF data presented (which includes PostScript-like commands and binary information), a direct semantic summary extraction is impossible without rendering and interpreting the full document.\n\nHowever, based on the title and common research themes implied, the article likely explores:\n\n*   **Mathematical and Physical Models of Ice Skating:** Developing a comprehensive understanding of the mechanics and dynamics involved in human ice skating. This could involve kinematic models (motion), dynamic models (forces), and friction models to simulate the interaction between the skate blade and the ice.\n*   **Robotic Gait Development:**  Utilizing the developed models to design and implement stable and efficient gaits for robotic ice skaters. This involves solving complex control problems to coordinate the robot's limbs and maintain balance while navigating the slippery surface.\n*   **Simulation and Experimentation:**  Validating the proposed models and gaits through simulations, potentially followed by experimental testing on physical robotic platforms designed for ice skating.\n\nIn essence, the research probably bridges theoretical models of human ice skating with practical robotic applications, seeking to create robots capable of executing complex ice skating maneuvers. The content provided is not directly suitable for extracting concrete results or methodologies, but suggests the nature of the research.\n",
    "chinese_title": "用于开发机器人滑冰步态的滑冰模型 [pdf] (2020)",
    "chinese_summary": "这份题为《冰上滑行模型用于开发机器人冰上滑行步态》的2020年PDF文档，似乎是构成该文章核心的原始、可能未经编辑的数据。遗憾的是，由于所呈现的PDF数据的编码和压缩性质（包括类似PostScript的命令和二进制信息），如果没有渲染和解释整个文档，直接进行语义摘要提取是不可能的。\n\n然而，根据标题和隐含的常见研究主题，这篇文章可能探讨：\n\n*   **冰上滑行的数学和物理模型：** 深入理解人类冰上滑行所涉及的力学和动力学。这可能涉及运动学模型（运动）、动力学模型（力）和摩擦模型，以模拟冰刀与冰面之间的相互作用。\n*   **机器人步态开发：** 利用已开发的模型来设计和实现稳定且高效的机器人冰上滑行步态。这涉及解决复杂的控制问题，以协调机器人的肢体并在光滑表面上导航时保持平衡。\n*   **模拟和实验：** 通过模拟验证提出的模型和步态，并可能随后在专为冰上滑行设计的物理机器人平台上进行实验测试。\n\n本质上，该研究可能将人类冰上滑行的理论模型与实际的机器人应用相结合，旨在创造能够执行复杂冰上滑行动作的机器人。所提供的内容不直接适用于提取具体结果或方法，但暗示了研究的性质。"
  },
  {
    "id": "43740858",
    "title": "Welcome to the Era of Experience [pdf]",
    "url": "https://storage.googleapis.com/deepmind-media/Era-of-Experience%20/The%20Era%20of%20Experience%20Paper.pdf",
    "summary": "This document, titled \"Welcome to the Era of Experience,\" is a PDF file. However, the provided content is not a readable article, but rather the raw, compressed data of the PDF itself. It is composed of PDF commands, object definitions, compressed data streams (FlateDecode), and cross-reference tables, all in a binary format.\n\nTherefore, it's impossible to summarize the content of the article \"Welcome to the Era of Experience\" based solely on the provided PDF source code. The raw code provides no insight into the subject matter, arguments, conclusions, or any other elements that could be summarized. A PDF reader is needed to decode the binary data and render the actual content for it to be understood and then summarised.\n",
    "chinese_title": "体验时代欢迎您 [pdf]",
    "chinese_summary": "这份名为“欢迎来到体验时代”的文档是一个PDF文件。然而，所提供的内容并非可读的文章，而是PDF本身的原始、压缩数据。它由PDF指令、对象定义、压缩数据流（FlateDecode）和交叉引用表组成，全部为二进制格式。\n\n因此，仅凭提供的PDF源代码，无法总结“欢迎来到体验时代”这篇文章的内容。原始代码无法提供关于主题、论点、结论或任何其他可以被总结的要素的见解。需要一个PDF阅读器来解码二进制数据并呈现实际内容，才能被理解并进行总结。"
  },
  {
    "id": "43738603",
    "title": "The Web Is Broken – Botnet Part 2",
    "url": "https://jan.wildeboer.net/2025/04/Web-is-Broken-Botnet-Part-2/",
    "summary": "This article, titled \"The Web Is Broken - Botnet Part 2,\" discusses the alarming rise of AI-driven web scraping and the role of botnets in this process. The author argues that a shady market exists where companies incentivize app developers to integrate \"network sharing\" SDKs into their applications, effectively turning unsuspecting users into unwitting participants in botnets. These botnets then exploit the users' network bandwidth for web crawling, brute-force attacks, and other malicious activities.\n\nCompanies like Infatica are cited as examples of providers that offer \"residential proxies,\" essentially selling access to the network connections of users with infected apps. The author contends that this business model fuels aggressive AI web crawling, resembling DDoS attacks that overwhelm smaller web servers.\n\nThe article criticizes app developers who incorporate such SDKs, accusing them of distributing malware and creating botnet members. It also laments the difficulty for average users and server admins to detect these hidden SDKs and their associated network traffic.\n\nThe author concludes that all web scraping should be considered abusive due to the actions of these unethical companies and the current \"AI\" hype. Webmasters are left to constantly block these waves of bot traffic, making it increasingly difficult to maintain their online services. The author urges platforms like Apple, Microsoft, and Google to take action against these practices.\n",
    "chinese_title": "网络已崩坏 – 僵尸网络（第二部分）",
    "chinese_summary": "网络已坏 - 僵尸网络（二）：人工智能驱动的网络爬取泛滥，文章讨论了其背后僵尸网络的作用。作者指出，存在一个不光彩的市场，公司通过激励应用开发者在其应用中集成“网络共享”SDK，实际上是将毫无戒心的用户变成了僵尸网络的参与者。这些僵尸网络利用用户的网络带宽进行网络爬虫、暴力破解攻击和其他恶意活动。\n\n文章以Infatica等公司为例，称它们提供“住宅代理”，实质上是出售对受感染应用用户网络连接的访问权限。作者认为，这种商业模式助长了侵略性的人工智能网络爬取，类似于DDoS攻击，会压垮小型网络服务器。\n\n文章批评了那些集成此类SDK的应用开发者，指责他们散布恶意软件并制造僵尸网络成员。文章还感叹普通用户和服务器管理员难以检测到这些隐藏的SDK及其相关的网络流量。\n\n作者得出结论，由于这些不道德公司的行为和当前的“人工智能”炒作，所有网络爬取都应被视为滥用行为。网站管理员只能不断地阻止这些僵尸流量，这使得维护在线服务变得越来越困难。作者敦促苹果、微软和谷歌等平台采取行动来打击这些行为。"
  },
  {
    "id": "43734583",
    "title": "Show HN: Goldbach Conjecture up to 4*10^18+7*10^13",
    "url": "https://medium.com/@jay_gridbach/grid-computing-shatters-world-record-for-goldbach-conjecture-verification-1ef3dc58a38d",
    "summary": "Hiroaki Jay Nakata (@jay_gridbach) announces a new world record in verifying the Goldbach Conjecture, extending the verified range to 4×10¹⁸ + 7×10¹³. He developed \"Gridbach,\" a grid computing system to achieve this.\n\nThe Goldbach Conjecture, stating that every even natural number greater than 2 is the sum of two primes, remains unproven. Gridbach surpasses the previous record of 4×10¹⁸ verified by T. Oliveira e Silva in 2013. Nakata aims to reach 5 quintillion and is open to publishing a paper for official recognition.\n\nGridbach is a cloud-based distributed system accessible from PCs and smartphones, requiring no login or app installation. Users contribute by running computations in their browsers using high-performance WASM. Each job covers 100 million numbers, taking seconds on a device. The project is inspired by SETI@home.\n\nThe system utilizes a JAMStack architecture and WASM. Nakata also introduces the concept of \"Goldbach Ridge,\" representing the maximum value of the smaller prime in the prime pairs.  The core computation algorithm is open-sourced as a Go command-line tool on GitHub, using an optimized Sieve of Eratosthenes. Nakata invites readers to participate and contribute to pushing the verification further.\n",
    "chinese_title": "Show HN: 哥德巴赫猜想验证至 4*10^18+7*10^13",
    "chinese_summary": "中田裕昭 (@jay_gridbach) 宣布验证哥德巴赫猜想的新世界纪录，将验证范围扩展到4×10¹⁸ + 7×10¹³。他开发了网格计算系统“Gridbach”来实现这一目标。\n\n哥德巴赫猜想，即每个大于2的偶数自然数都可以表示为两个质数之和，仍然未被证明。Gridbach超越了T. Oliveira e Silva在2013年验证的4×10¹⁸这一先前纪录。中田的目标是达到500万兆，并愿意发表论文以获得官方认可。\n\nGridbach是一个基于云的分布式系统，可通过PC和智能手机访问，无需登录或安装应用程序。用户通过使用高性能WASM在浏览器中运行计算来做出贡献。每个任务覆盖1亿个数字，在设备上只需几秒钟。该项目的灵感来自SETI@home。\n\n该系统采用JAMStack架构和WASM。中田还介绍了“哥德巴赫岭”的概念，代表素数对中较小素数的最大值。核心计算算法已在GitHub上开源为一个Go命令行工具，使用优化的埃拉托斯特尼筛法。中田邀请读者参与并贡献力量，以进一步推进验证。"
  },
  {
    "id": "43734953",
    "title": "A Map of British Dialects (2023)",
    "url": "https://starkeycomics.com/2023/11/07/map-of-british-english-dialects/",
    "summary": "This article describes a detailed, though admittedly imperfect, map of British English dialects. The author highlights the immense diversity of dialects within the UK, often differing even between neighboring towns. The map is the result of years of research, combining existing studies, surveys, and feedback from a dedicated online community.\n\nThe author acknowledges the inherent limitations of representing a complex linguistic reality on a map. Defining a \"dialect\" is subjective, dialect boundaries are blurred and gradual rather than sharp lines, and some dialects are defined more by social factors than geography, such as Multicultural London English. The author also clarifies that the map focuses on British English, excluding Scots (considered a separate language), Irish, Welsh, and other indigenous languages. While Northern Ireland is included due to the presence of a population that identifies as British, the author acknowledges the complexities of the region.\n\nDespite its imperfections, the map aims to illustrate the rich dialectal diversity of the English language in the UK and showcases the author's fascination with the topic. The author encourages readers to explore other related maps on their site and support their work through Patreon.\n",
    "chinese_title": "英国方言地图 (2023)",
    "chinese_summary": "本文描述了一幅详细但不可否认并不完善的英国英语方言地图。作者强调了英国境内方言的巨大多样性，即使是相邻城镇之间也常常存在差异。该地图是多年研究的成果，结合了现有研究、调查以及来自专注的在线社区的反馈。\n\n作者承认在地图上呈现复杂的语言现实存在固有的局限性。“方言”的定义是主观的，方言边界是模糊和渐变的，而不是清晰的界限，并且一些方言的定义更多地取决于社会因素，而不是地理因素，例如多元文化伦敦英语。作者还明确表示，该地图侧重于英国英语，不包括苏格兰语（被认为是单独的语言）、爱尔兰语、威尔士语和其他本土语言。虽然北爱尔兰由于存在自认为是英国人的人口而被包括在内，但作者承认该地区的复杂性。\n\n尽管存在不足，该地图旨在展示英国英语方言的丰富多样性，并展示作者对该主题的着迷。作者鼓励读者在其网站上探索其他相关地图，并通过Patreon支持他们的工作。"
  },
  {
    "id": "43739037",
    "title": "Vibe Coding is not an excuse for low-quality work",
    "url": "https://addyo.substack.com/p/vibe-coding-is-not-an-excuse-for",
    "summary": "Okay, I've read the article \"Vibe Coding is not an excuse for low-quality work\" from the provided URL.\n\nHere's a summary:\n\nThe article critiques the concept of \"vibe coding,\" which the author defines as prioritizing personal enjoyment and intuition while coding, sometimes at the expense of best practices, maintainability, and collaboration. The author argues that while enjoying one's work is important, it shouldn't be used as a justification for producing subpar code.\n\nThe core argument is that \"vibe coding,\" when taken too far, can lead to several negative consequences, including increased technical debt, difficulty in onboarding new team members, reduced code reusability, and ultimately, lower quality software. The author stresses that professional software development is a team effort requiring adherence to standards and a focus on long-term maintainability.\n\nThe article emphasizes the importance of balancing personal enjoyment with the practical realities of software development. While embracing creativity and exploration is valuable, it shouldn't come at the cost of producing reliable, understandable, and maintainable code. Good software engineering practices, such as writing clear documentation, following coding conventions, and conducting thorough testing, are crucial even when \"vibe coding.\"\n\nThe author advocates for a mindful approach to coding, where personal preferences are considered alongside the needs of the project and the team. They suggest that a healthy balance is achievable: find enjoyment in your work while still maintaining high standards of quality and professionalism. Vibe coding can be part of the process, but it should not excuse or replace sound coding practices.\n",
    "chinese_title": "氛围编程不是低质量工作的借口",
    "chinese_summary": "好的，我已阅读了来自所提供URL的文章《氛围编码不是低质量工作的借口》。\n\n以下是摘要：\n\n文章批评了“氛围编码”的概念，作者将其定义为在编码时优先考虑个人乐趣和直觉，有时会牺牲最佳实践、可维护性和协作。作者认为，虽然享受工作很重要，但不应以此为借口来生产低于标准的代码。\n\n核心论点是，“氛围编码”如果过度使用，可能会导致几个负面后果，包括增加技术债务、难以让新团队成员上手、降低代码可重用性，并最终导致软件质量下降。作者强调，专业的软件开发是一项团队工作，需要遵守标准并注重长期可维护性。\n\n文章强调了在个人乐趣与软件开发的实际情况之间取得平衡的重要性。虽然拥抱创造力和探索很有价值，但不应以牺牲生产可靠、易于理解和可维护的代码为代价。即使在“氛围编码”时，良好的软件工程实践，如编写清晰的文档、遵循编码规范和进行彻底的测试，也至关重要。\n\n作者提倡一种有意识的编码方法，即在考虑个人偏好的同时，也要考虑项目和团队的需求。他们认为可以实现一种健康的平衡：在工作中找到乐趣，同时保持高质量和专业水准。氛围编码可以成为过程的一部分，但不应作为借口或替代健全的编码实践。"
  },
  {
    "id": "43739547",
    "title": "Computational Complexity of Air Travel Planning [pdf] (2003)",
    "url": "http://www.demarcken.org/carl/papers/ITA-software-travel-complexity/ITA-software-travel-complexity.pdf",
    "summary": "Due to the file being in a PDF format, which is represented in a partially unreadable binary code, I cannot directly access and interpret the content of the document to provide an accurate summary of the \"Computational Complexity of Air Travel Planning\" article. Therefore, I cannot create a summary based on the content of the PDF document you have provided.\n",
    "chinese_title": "航空旅行规划的计算复杂度[pdf] (2003)",
    "chinese_summary": "由于文件为PDF格式，其内容以部分无法读取的二进制代码表示，我无法直接访问和解读该文档的内容，因此无法提供关于《航空旅行规划的计算复杂度》这篇文章的准确摘要。因此，我无法基于您提供的PDF文档内容创建摘要。"
  },
  {
    "id": "43744043",
    "title": "Meta's Monopoly Made It a Fair-Weather Friend",
    "url": "https://www.wired.com/story/plaintext-ftc-meta-trial-mark-zuckerberg/",
    "summary": "This article critiques Meta's shift away from its original mission of connecting friends and family on Facebook, arguing that the company prioritized profit and user engagement through influencer content and sensational news over genuine social connections. The author highlights that Meta's own internal surveys showed users wanted more content from friends, yet the platform increasingly featured posts from strangers and monetized content creators.\n\nThe piece suggests this shift was driven by the profitability of viral content and targeted advertising, rather than user preference. Zuckerberg's acknowledgement that Facebook has become more of an entertainment platform is seen as an admission of this drift.\n\nThe author connects this change to Meta's alleged monopolistic practices, arguing that the company's dominance allowed it to neglect its core user base. The acquisition of Instagram and WhatsApp is revisited, suggesting they were anti-competitive moves to eliminate threats.\n\nThe author mentions the ongoing antitrust trial and argues that Meta was able to prioritize entertainment and personalized ads precisely *because* it had locked in a large user base seeking connection with friends and family. Despite now offering a \"Friends\" tab, the article concludes that users have already migrated elsewhere, highlighting the consequences of Meta's departure from its original social focus. The author uses the new feature to illustrate the core problem: it exists, but few people use it because Facebook has driven users away from sharing personally.\n",
    "chinese_title": "Meta的垄断使其成为靠得住的顺境朋友",
    "chinese_summary": "本文批评Meta偏离其在Facebook上连接朋友和家人的最初使命，认为该公司优先考虑利润和用户参与度，通过网红内容和耸人听闻的新闻而非真正的社交连接来实现这一目标。作者强调，Meta的内部调查显示用户希望看到更多来自朋友的内容，但平台却越来越多地呈现陌生人和盈利内容创作者的帖子。\n\n文章认为，这种转变是由病毒式内容和定向广告的盈利能力驱动的，而非用户偏好。扎克伯格承认Facebook已变得更像一个娱乐平台，这被视为承认了这种偏离。\n\n作者将这一变化与Meta涉嫌的垄断行为联系起来，认为该公司的统治地位使其得以忽视其核心用户群。文章回顾了对Instagram和WhatsApp的收购，认为这些是消除威胁的反竞争举措。\n\n作者提到了正在进行的反垄断审判，并认为Meta能够优先考虑娱乐和个性化广告，恰恰*是因为*它锁定了一个庞大的、寻求与朋友和家人联系的用户群。尽管现在提供了一个“朋友”标签，但文章的结论是，用户已经迁移到其他地方，突显了Meta背离其最初社交关注的后果。作者使用这个新功能来说明核心问题：它存在，但很少有人使用它，因为Facebook已经驱使用户不再分享个人内容。"
  },
  {
    "id": "43736739",
    "title": "How to Write a Fast Matrix Multiplication from Scratch with Tensor Cores (2024)",
    "url": "https://alexarmbr.github.io/2024/08/10/How-To-Write-A-Fast-Matrix-Multiplication-From-Scratch-With-Tensor-Cores.html",
    "summary": "This article details the author's journey of optimizing a matrix multiplication kernel (HGEMM) in CUDA using tensor cores on an NVIDIA Tesla T4 GPU. The goal was to achieve performance comparable to NVIDIA's cuBLAS implementation.\n\nThe article begins by introducing the importance of tensor cores in modern AI training and inference, highlighting their massive throughput advantage. It emphasizes the challenge of effectively utilizing tensor cores due to the \"memory wall,\" where data movement becomes the bottleneck. The roofline model is introduced as a tool for understanding the relationship between computational intensity (FLOPs/byte) and achievable throughput.\n\nThe author compares the rooflines for tensor cores (HMMA) and standard multiply-accumulate units (FFMA) on the T4, revealing that tensor cores require significantly higher arithmetic intensity to reach peak performance. This highlights the need for optimized data movement strategies.\n\nThe article then delves into the GPU's memory hierarchy (global memory, L2 cache, shared memory) and the importance of leveraging faster, smaller memory levels like shared memory to overcome the memory wall. The author iteratively improves the kernel through six versions, employing techniques like:\n\n*   Hierarchical tiling\n*   Vectorized memory copy and loop unrolling\n*   Shared memory swizzling (to avoid bank conflicts)\n*   Async copy\n*   Tuning tile dimensions\n*   Optimizing index calculation\n*   Double buffering\n\nThe final optimized kernel achieves 96% of the cuBLAS throughput for 8192x8192 matrices. The author concludes by acknowledging limitations, emphasizing the benefits of newer GPUs, and expressing hope that the article helps other GPU programmers working with tensor cores.\n",
    "chinese_title": "如何从零开始用张量核心编写快速矩阵乘法 (2024)",
    "chinese_summary": "利用Tensor Core在CUDA上优化矩阵乘法内核(HGEMM)的旅程"
  },
  {
    "id": "43739285",
    "title": "The Art of Assembly Language (2010)",
    "url": "https://www.plantation-productions.com/Webster/www.artofasm.com/Linux/HTML/AoATOC.html",
    "summary": "\"The Art of Assembly Language (2010)\" is a comprehensive guide to assembly language programming, particularly using the High-Level Assembly (HLA) language. It's structured as a textbook, covering a wide range of topics from basic concepts to advanced techniques.\n\nThe book starts with introductory material, including installation of HLA and a basic program anatomy. It progresses through fundamental concepts like numbering systems, data organization (bits, bytes, words), and logical operations. It also introduces floating-point arithmetic, character encodings (ASCII, Unicode), and other data representations.\n\nA significant portion of the book is dedicated to the Intel 80x86 architecture, including addressing modes, memory organization (stack, heap), CPU design, instruction set architecture, and memory hierarchy. It delves into instruction encoding and optimization techniques.\n\nThe book also covers advanced data structures, including strings, character sets, arrays, records, unions, and variant types. It also includes examples of how to work with dates and times, and file I/O operations.\n\nProcedures, functions, and modular programming are also discussed, including how to manage large programs using include files, units, and makefiles. The later chapters cover arithmetic and logical expressions, floating-point arithmetic using the FPU, and the use of tables for efficient computation. Finally, it explores exception handling with TRY..ENDTRY statements. The book frequently emphasizes \"Putting It All Together\" sections to consolidate the chapter's concepts.\n",
    "chinese_title": "汇编语言的艺术 (2010)",
    "chinese_summary": "汇编语言的艺术 (2010) 是一本关于汇编语言编程的综合指南，特别是使用高级汇编 (HLA) 语言。它以教科书的形式组织，涵盖了从基本概念到高级技术的广泛主题。\n\n本书从入门材料开始，包括 HLA 的安装和基本程序结构。然后逐步讲解基本概念，如数字系统、数据组织（位、字节、字）和逻辑运算。它还介绍了浮点运算、字符编码（ASCII、Unicode）和其他数据表示。\n\n本书的大部分内容专门介绍 Intel 80x86 架构，包括寻址模式、内存组织（堆栈、堆）、CPU 设计、指令集架构和内存层次结构。它深入研究了指令编码和优化技术。\n\n本书还涵盖了高级数据结构，包括字符串、字符集、数组、记录、联合和变体类型。它还包括如何处理日期和时间以及文件 I/O 操作的示例。\n\n书中还讨论了过程、函数和模块化编程，包括如何使用包含文件、单元和 makefile 管理大型程序。后面的章节涵盖算术和逻辑表达式、使用 FPU 的浮点运算以及使用表进行高效计算。最后，它探讨了使用 TRY..ENDTRY 语句的异常处理。本书经常强调“整合应用”部分，以巩固本章的概念。"
  },
  {
    "id": "43741987",
    "title": "Meteor Burst Communications",
    "url": "https://ronaldelliott.com/mbc.html",
    "summary": "Meteor Burst Communications (MBC) leverages ionized trails left by meteors in the atmosphere for beyond line of sight telecommunications. Early studies and systems like JANET and SNOTEL demonstrated its feasibility. While the technology saw limited use in the 1980s, advancements in microprocessors now offer the potential for significant performance improvements.\n\nMBC works by reflecting radio waves off meteor trails. These trails, typically formed by milligram-sized meteors, are short-lived and occur sporadically, requiring systems to be designed around statistical predictions. The frequency of usable trails varies diurnally and seasonally.  Optimization involves balancing factors like frequency, antenna gain, and transmitter power.\n\nModern microprocessors facilitate rapid and adaptive signal processing, potentially increasing throughput and reliability. These improvements, coupled with encryption, make MBC a robust option for national security operations.\n\nMBC systems consist of a master station, remote terminals, and optional components like encryption and service channels. Standardized procedures and adaptable software further enhance performance.\n\nKey advantages of MBC include connectivity range (LOS and BLOS), limiting reception opportunities of unintended recipients, and inherent distance limitation (approximately 1,200 miles). Potential military applications have been recognized, and with the use of modern microprocessors tactical military applications could be improved. Adaptive signaling techniques, using variable signaling parameters, can mitigate previous limitations like low data rates and noise sensitivity.\n",
    "chinese_title": "流星余迹通信",
    "chinese_summary": "流星余迹通信（MBC）利用流星在大气层中留下的电离尾迹进行超视距远程通信。早期的研究和JANET及SNOTEL等系统证明了其可行性。虽然该技术在20世纪80年代的使用有限，但微处理器的进步现在提供了显著的性能改进潜力。\n\nMBC的工作原理是将无线电波从流星尾迹反射出去。这些尾迹通常由毫克级的流星形成，寿命短且零星出现，因此需要围绕统计预测来设计系统。可用尾迹的频率随昼夜和季节变化。优化涉及平衡频率、天线增益和发射功率等因素。\n\n现代微处理器有助于快速和自适应的信号处理，有可能提高吞吐量和可靠性。这些改进，加上加密，使MBC成为国家安全行动的可靠选择。\n\nMBC系统由主站、远程终端以及可选组件（如加密和服务信道）组成。标准化的程序和可适应的软件进一步提高了性能。\n\nMBC的主要优势包括连接范围（视距和超视距）、限制非预期接收者的接收机会以及固有的距离限制（约1,200英里）。人们已经认识到其潜在的军事应用，并且通过使用现代微处理器，可以改进战术军事应用。使用可变信号参数的自适应信令技术可以缓解以前的限制，如低数据速率和噪声敏感性。"
  },
  {
    "id": "43739510",
    "title": "Monsky's Theorem",
    "url": "https://mathmondays.com/monskys-theorem",
    "summary": "Monsky's Theorem states that a square cannot be dissected into an odd number of triangles of equal area. The proof combines number theory, combinatorics, and algebraic machinery. The core ingredients are Sperner's Lemma and 2-adic valuations.\n\nSperner's Lemma addresses polygon dissections into triangles, where vertices are colored red, green, or blue, adhering to \"Sperner coloring\" rules. These rules dictate that no face contains all three colors, and the boundary has an odd number of \"purple\" segments (red-blue endpoints). The lemma guarantees at least one \"trichromatic\" triangle (one of each color) exists in such a coloring.\n\nThe proof involves counting purple segments mod 2 to demonstrate the existence of an odd number of trichromatic triangles.\n\nA 2-adic valuation, denoted as ν₂, measures the divisibility of a number by 2. It is extended from rational numbers to real numbers (though details of this extension are omitted).\n\nThe proof hinges on a specific coloring scheme based on 2-adic valuations: a point (x, y) is colored red if ν₂(x) > 0 and ν₂(y) > 0, green if ν₂(x) ≤ 0 and ν₂(x) ≤ ν₂(y), and blue if ν₂(y) ≤ 0 and ν₂(y) < ν₂(x). Crucially, no three collinear points can have all three colors.\n\nApplying this coloring to a dissection of the unit square, the coloring is shown to be a Sperner coloring. Then, it's proven that the area of a trichromatic triangle, *K*, must have ν₂(K) ≤ -1. Since the area of each triangle in a dissection into *n* triangles is 1/*n*, and *n* is odd, then ν₂(1/*n*) = 0, leading to a contradiction, and therefore such a dissection is impossible.\n",
    "chinese_title": "Monsky定理",
    "chinese_summary": "Monsky定理指出，正方形无法被分割成奇数个面积相等的三角形。证明结合了数论、组合数学和代数工具。核心要素是斯佩纳引理和2-adic赋值。\n\n斯佩纳引理处理将多边形分割成三角形的情况，其中顶点被涂成红色、绿色或蓝色，并遵守“斯佩纳着色”规则。这些规则规定，没有一个面包含所有三种颜色，并且边界上有奇数个“紫色”线段（红-蓝端点）。该引理保证在这种着色中至少存在一个“三色”三角形（每种颜色各一个）。\n\n该证明涉及模2计数紫色线段，以证明存在奇数个三色三角形。\n\n2-adic赋值，记为ν₂，衡量一个数被2整除的程度。它从有理数扩展到实数（尽管省略了这种扩展的细节）。\n\n该证明的关键在于一种基于2-adic赋值的特定着色方案：如果ν₂(x) > 0且ν₂(y) > 0，则点(x, y)被涂成红色；如果ν₂(x) ≤ 0且ν₂(x) ≤ ν₂(y)，则涂成绿色；如果ν₂(y) ≤ 0且ν₂(y) < ν₂(x)，则涂成蓝色。至关重要的是，没有三个共线点可以拥有所有三种颜色。\n\n将这种着色应用于单位正方形的分割，表明该着色是斯佩纳着色。然后，证明三色三角形*K*的面积必须满足ν₂(K) ≤ -1。由于分割成*n*个三角形时，每个三角形的面积是1/*n*，且*n*是奇数，因此ν₂(1/*n*) = 0，从而导致矛盾，因此这种分割是不可能的。"
  },
  {
    "id": "43734910",
    "title": "Show HN: Undercutf1 – F1 Live Timing TUI with Driver Tracker, Variable Delay",
    "url": "https://github.com/JustAman62/undercut-f1",
    "summary": "Undercutf1 is an open-source, terminal-based (TUI) application for viewing live Formula 1 timing data, inspired by the FastF1 project. It uses the UndercutF1.Data library to connect to the F1 live timing data stream, process the data, and record sessions for later replay.\n\nKey features include a timing tower display with live sector times, tire information, and gaps; pit stop strategy overview; race control messages; a driver tracker on a track map (iTerm2/Kitty Graphics Protocol support); lap-by-lap timing history; and team radio transcription via local ML.\n\nUsers can adjust the data delay to synchronize with live broadcasts. The application can be installed as a dotnet tool, as a standalone executable, using a Docker image, or directly from source. It supports both live sessions and pre-recorded session replays using downloaded or sample data.\n\nConfiguration is possible via a `config.json` file, command-line arguments, or environment variables, allowing customization of the data directory, logging verbosity, API enablement, and race control message notifications. Data is recorded in `subscribe.txt` and `live.txt` files within a session-specific directory for replay. The tool is unofficial and not associated with the Formula 1 companies.\n",
    "chinese_title": "展示HN：Undercutf1 – 具有车手追踪、可变延迟的 F1 实时计时 TUI",
    "chinese_summary": "Undercutf1 是一个开源的、基于终端（TUI）的应用程序，用于查看 Formula 1 实时计时数据，灵感来源于 FastF1 项目。它使用 UndercutF1.Data 库连接到 F1 实时计时数据流，处理数据，并记录会话以便稍后重播。\n\n主要功能包括一个带有实时分段时间、轮胎信息和差距的计时塔显示；进站策略概览；比赛控制消息；赛道地图上的车手追踪器（支持 iTerm2/Kitty Graphics Protocol）；逐圈计时历史；以及通过本地机器学习实现的团队无线电转录。\n\n用户可以调整数据延迟以与直播同步。该应用程序可以作为 dotnet 工具、独立可执行文件、使用 Docker 镜像或直接从源代码安装。它支持实时会话和使用下载或示例数据的预先录制的会话重播。\n\n可以通过 `config.json` 文件、命令行参数或环境变量进行配置，从而自定义数据目录、日志记录详细程度、API 启用和比赛控制消息通知。数据记录在会话特定目录中的 `subscribe.txt` 和 `live.txt` 文件中以供重播。该工具是非官方的，与 Formula 1 公司无关。"
  },
  {
    "id": "43712536",
    "title": "Peru's ancient irrigation systems turned deserts into farms because of culture",
    "url": "https://theconversation.com/perus-ancient-irrigation-systems-succeeded-in-turning-deserts-into-farms-because-of-the-culture-without-it-the-systems-failed-251199",
    "summary": "This article explores the success of ancient Peruvian irrigation systems in turning deserts into farmland and contrasts it with the challenges faced by modern, similar systems. It argues that the key to the success of these ancient systems wasn't just the infrastructure, but the culture surrounding them – the beliefs, behaviors, and norms that were integrated into their technological solutions.\n\nThe author, an archaeologist, highlights that pre-Hispanic societies in Peru faced similar climate challenges as today, including water scarcity and frequent natural disasters. Their solutions involved flexible, multifunctional infrastructure designed to work with both dry seasons and flash floods. They used canals with aqueducts as sediment traps and check-dams to control floods, capture sediments, and recharge the water table.\n\nThe Spanish initially recognized the importance of these canal systems and adapted them, but their efforts ultimately failed, leading to water shortages and land degradation. This failure, and the struggles of modern agro-industrial practices, is attributed to the separation of technology from its cultural context. The article stresses that modern projects, like the Chavimochic project relying on disappearing glacial meltwater, risk prioritizing short-term gains over long-term resilience.\n\nThe author concludes that understanding and incorporating the cultural knowledge systems that supported ancient irrigation practices is crucial for developing sustainable solutions to modern climate challenges. This involves preserving indigenous languages, archaeological sites, and fostering partnerships with communities that have long adapted to the changing climate.\n",
    "chinese_title": "秘鲁古代灌溉系统因文化将沙漠变为农田。",
    "chinese_summary": "本文探讨了古秘鲁灌溉系统将沙漠变为农田的成功之处，并将其与现代类似系统所面临的挑战进行了对比。文章认为，这些古代系统成功的关键不仅在于基础设施，还在于围绕它们形成的文化——融入其技术解决方案的信仰、行为和规范。\n\n作者是一位考古学家，他强调秘鲁的前西班牙社会面临着与今天类似的气候挑战，包括缺水和频繁的自然灾害。他们的解决方案包括灵活、多功能的基础设施，旨在适应旱季和山洪暴发。他们使用带有渡槽的运河作为沉积物陷阱和堰坝来控制洪水、捕获沉积物并补充地下水位。\n\n西班牙人最初认识到这些运河系统的重要性并对其进行了改造，但他们的努力最终失败，导致缺水和土地退化。这种失败以及现代农业工业实践的困境，归因于技术与文化背景的分离。文章强调，像依赖消失的冰川融水的查维莫奇克项目这样的现代项目，存在着优先考虑短期收益而牺牲长期韧性的风险。\n\n作者总结认为，理解和纳入支持古代灌溉实践的文化知识体系对于开发应对现代气候挑战的可持续解决方案至关重要。 这包括保护土著语言、考古遗址，并促进与长期适应气候变化的社区的合作。"
  },
  {
    "id": "43722816",
    "title": "British rebellion against Roman legions caused by drought, research finds",
    "url": "https://www.theguardian.com/uk-news/2025/apr/17/british-rebellion-against-roman-legions-caused-by-drought-research-finds",
    "summary": "This article discusses how a series of severe droughts in southern Britain between AD364 and AD366 likely contributed to the \"barbarian conspiracy\" of AD367, a pivotal rebellion against Roman rule. Researchers used oak tree-ring records to reconstruct precipitation levels and found that rainfall was significantly lower during those years compared to the surrounding period.\n\nThe consecutive droughts would have devastated agriculture, leading to famine and societal instability. This, according to the study, weakened Roman defenses, reduced grain supply to key areas like Hadrian's Wall, and fueled desertions from the army.\n\nThe resulting military and societal breakdown created an opportunity for Picts, Scotti, and Saxons to invade Britain, inflicting significant damage and capturing or killing Roman commanders. While limited archaeological and written evidence exists, the climate data provides a plausible explanation for the catalyst of the rebellion.\n\nThe researchers also found a correlation between dry years and battles fought across the Roman Empire during that period. The study highlights the potential link between extreme climate conditions, societal unrest, and conflict, drawing parallels to modern-day concerns about the consequences of climate change. The article suggests that the drought exacerbated existing vulnerabilities in Roman Britain, leading to a perfect storm that contributed to its eventual decline.\n",
    "chinese_title": "干旱导致英国人反抗罗马军团，研究发现",
    "chinese_summary": "公元364至366年间英国南部一系列严重干旱如何促成了公元367年针对罗马统治的关键性叛乱“蛮族阴谋”？本文对此进行了探讨。研究人员利用橡树年轮记录重建了降水水平，发现这些年份的降雨量明显低于周围时期。\n\n连续干旱会摧毁农业，导致饥荒和社会不稳定。研究表明，这削弱了罗马的防御，减少了向哈德良长城等关键地区的粮食供应，并助长了军队的逃亡。\n\n由此造成的军事和社会崩溃为皮克特人、斯哥特人和撒克逊人入侵英国创造了机会，造成重大破坏，俘虏或杀害了罗马指挥官。虽然考古和书面证据有限，但气候数据为叛乱的催化剂提供了一个合理的解释。\n\n研究人员还发现，在同一时期，罗马帝国各地发生的战争与干旱年份之间存在相关性。该研究强调了极端气候条件、社会动荡和冲突之间的潜在联系，并将之与现代对气候变化后果的担忧联系起来。文章认为，干旱加剧了罗马不列颠固有的脆弱性，最终导致了一场促成其衰落的完美风暴。"
  },
  {
    "id": "43735592",
    "title": "Demo \"The Mind\" by Haujobb and Sweet16",
    "url": "https://www.lexaloffle.com/bbs/?pid=145596",
    "summary": "This blog post by \"hellfire\" announces the release of \"The Mind,\" a new demo created by Haujobb & Sweet16 for the Revision demoparty's \"fantasy console\" competition. The demo was designed for the Pico-8 platform and utilizes multi-cart functionality. Currently, it can only be viewed online.\n\nThe post provides several ways to access the demo: a link to view it online, a download link to the complete source code archive on Pouet, a Youtube video, and a video explaining the music creation process. Users can also load and run the demo directly within Pico-8 by using the command \"load #themind1\" followed by \"run,\" which will download the necessary data carts.\n\nAn update mentions that \"The Mind\" now runs directly within the BBS thanks to Zep. The post provides a link to the cart file and forum post. \"Hellfire\" also included links to other cartridges they have created. Finally, they share links to standalone files showcasing some of the visual effects, specifically \"Interference\" and \"Neuronal network,\" which feature demos of various effects like tunnel rendering, raster effects, and pixel art. The post encourages feedback and discussion from viewers.\n",
    "chinese_title": "Haujobb和Sweet16的演示曲“心灵”",
    "chinese_summary": "“hellfire”的博客文章宣布发布了“The Mind”，这是Haujobb & Sweet16为Revision demoparty的“幻想游戏机”比赛创作的新演示作品。该演示作品专为Pico-8平台设计，并使用了多卡功能。目前，它只能在线观看。\n\n该文章提供了几种访问演示作品的方式：在线观看链接，Pouet上的完整源代码存档下载链接，Youtube视频，以及一个解释音乐创作过程的视频。用户还可以通过在Pico-8中使用命令“load #themind1”后接“run”来直接加载和运行演示作品，这将下载必要的数据卡。\n\n更新提到，由于Zep的贡献，“The Mind”现在可以直接在BBS中运行。该文章提供了卡带文件和论坛帖子的链接。“Hellfire”还包括了他们创建的其他卡带的链接。最后，他们分享了展示一些视觉效果的独立文件链接，特别是“Interference”和“Neuronal network”，其中包含了隧道渲染、光栅效果和像素艺术等各种效果的演示。该文章鼓励观众提供反馈和讨论。"
  },
  {
    "id": "43716106",
    "title": "Consistent Hash Ring",
    "url": "https://gallery.selfboot.cn/en/algorithms/hashring",
    "summary": "This article explains the concept and benefits of a Consistent Hash Ring, a special hashing algorithm used for data distribution and load balancing in distributed systems. It addresses the challenges of adding/removing nodes in a distributed system while minimizing data migration.\n\nThe article highlights the core concept of mapping hash values to a ring structure where servers are assigned positions. Data is then stored on the first server encountered moving clockwise from the data's hash position. This approach limits data redistribution during node changes.\n\nIt further explains the importance of Virtual Nodes to improve data distribution uniformity. Virtual nodes are virtual replicas of physical nodes, increasing the number of distribution points on the ring and balancing the data load. The article emphasizes the impact of virtual nodes on data distribution, visualizing how they reduce data skew and balance the load across physical nodes.\n\nThe article also outlines the advantages of consistent hashing rings, including scalability, load balancing, and high availability, and discusses its disadvantages, such as its dependence on the hash function, increased system complexity, and the importance of initial node count. Finally, it lists various applications in distributed systems like distributed cache (Memcached), distributed storage, load balancing, and distributed databases, showcasing its utility in real-world scenarios.\n",
    "chinese_title": "一致性哈希环",
    "chinese_summary": "本文解释了一致性哈希环的概念和优势，这是一种特殊的哈希算法，用于分布式系统中的数据分发和负载均衡。它解决了分布式系统中添加/删除节点时尽量减少数据迁移的挑战。\n\n文章强调了将哈希值映射到环形结构的核心概念，其中服务器被分配位置。然后，数据存储在从数据的哈希位置顺时针方向遇到的第一个服务器上。这种方法限制了节点更改期间的数据重新分配。\n\n文章进一步解释了虚拟节点对于提高数据分布均匀性的重要性。虚拟节点是物理节点的虚拟副本，增加了环上的分配点数量，并平衡了数据负载。文章强调了虚拟节点对数据分布的影响，可视化了它们如何减少数据倾斜并平衡物理节点上的负载。\n\n文章还概述了一致性哈希环的优势，包括可扩展性、负载均衡和高可用性，并讨论了其劣势，例如对哈希函数的依赖、系统复杂性的增加以及初始节点数量的重要性。最后，它列出了在分布式系统中的各种应用，如分布式缓存（Memcached）、分布式存储、负载均衡和分布式数据库，展示了其在实际场景中的效用。"
  },
  {
    "id": "43743053",
    "title": "Texas Officials Invited the Rigging of the State Lottery",
    "url": "https://www.nytimes.com/2025/04/20/us/rigged-texas-lottery.html",
    "summary": "In 2023, Texas lottery officials allegedly facilitated the rigging of the state lottery, allowing professional bettors to purchase virtually every combination of possible numbers, guaranteeing a win in the tens of millions of dollars. This revelation has sparked outrage and investigations by the Texas Senate, Governor Greg Abbott, and Attorney General Ken Paxton, leading to the Texas House zeroing out the lottery's funding.\n\nState Senator Bob Hall described the situation as a \"criminal enterprise within our government.\" Despite the exposure, the perpetrators remain untouched. The New York Times has uncovered new details and video evidence suggesting the state's lottery commission played an integral role in securing the jackpot. The scheme involved storefronts posing as retailers to print vast quantities of tickets and communication between ticket printers and a former drug smuggler, with the winner concealing their identity behind a Delaware-based shell company. The incident highlights a broader sentiment that systems are rigged, further eroding public trust.\n",
    "chinese_title": "德州官员被邀操纵州彩票",
    "chinese_summary": "2023年，据称德克萨斯州彩票官员协助操纵州彩票，允许职业赌徒购买几乎所有可能的数字组合，从而确保赢得数千万美元的奖金。这一披露引发了德克萨斯州参议院、州长格雷格·阿博特和总检察长肯·帕克斯顿的愤怒和调查，导致德克萨斯州众议院取消了彩票的资金。\n\n州参议员鲍勃·霍尔将此情况描述为“我们政府内部的犯罪企业”。尽管事件曝光，但肇事者仍然逍遥法外。《纽约时报》披露了新的细节和视频证据，表明该州彩票委员会在确保获得头奖方面发挥了重要作用。该计划涉及以零售商身份出现的店面打印大量彩票，以及彩票打印机与一名前毒品走私犯之间的通信，而中奖者则将其身份隐藏在一家位于特拉华州的空壳公司背后。该事件凸显了一种更广泛的观点，即系统被操纵，进一步削弱了公众的信任。"
  },
  {
    "id": "43712024",
    "title": "The Animals That Exist Between Life and Death",
    "url": "https://nautil.us/the-animals-that-exist-between-life-and-death-1202592/",
    "summary": "This Nautilus article explores the intriguing phenomenon of \"cryptobiosis,\" exemplified by rotifers, microscopic animals that can seemingly exist between life and death by surviving extreme desiccation. It traces the history of this discovery, beginning with Antonie van Leeuwenhoek's initial observations in the 17th century, where he witnessed rotifers reviving after being dried out for extended periods. This sparked philosophical questions about the nature of life, death, and a possible liminal state between the two.\n\nThe article highlights how, over centuries, scientists struggled to understand this phenomenon, initially met with skepticism and later hindered by limited technology. David Keilin's articulation of \"cryptobiosis\" in the mid-20th century shifted the focus to the physiological mechanisms enabling survival in this state. Research revealed that some organisms, like brine shrimp and nematodes, utilize trehalose to protect their cells during desiccation, while rotifers employ late embryogenesis abundant (LEA) proteins to stabilize cell membranes.\n\nThe resilience of rotifers doesn't come without a cost, as desiccation causes DNA damage, which they efficiently repair upon rehydration. Notably, rotifers have incorporated significant amounts of non-animal DNA, possibly aiding their survival, leading to questions about evolutionary origins. The article concludes by noting the ongoing scientific and philosophical debate about whether rotifers age in their dormant state and whether life and death are truly the only states of being. They are not simply \"dead\" or \"alive\", the simple dichotomy does not make sense.\n",
    "chinese_title": "介于生死之间的动物",
    "chinese_summary": "这篇Nautilus文章探讨了引人入胜的“隐生”现象，以轮虫为例，这种微小的动物似乎可以通过在极度干燥的环境中生存，存在于生死之间。文章追溯了这一发现的历史，始于17世纪安东尼·范·列文虎克最初的观察，他目睹了轮虫在干燥很长一段时间后复活。这引发了关于生命、死亡以及两者之间可能存在的临界状态的哲学问题。\n\n文章强调，几个世纪以来，科学家们一直在努力理解这一现象，最初受到怀疑，后来又受到有限技术的阻碍。大卫·凯林在20世纪中叶对“隐生”的阐述，将重点转移到使生物能够在这种状态下生存的生理机制上。研究表明，一些生物，如丰年虾和线虫，利用海藻糖来保护它们在干燥期间的细胞，而轮虫则利用晚期胚胎发生富集（LEA）蛋白来稳定细胞膜。\n\n轮虫的韧性并非没有代价，因为干燥会导致DNA损伤，而它们在复水后会有效地修复这些损伤。值得注意的是，轮虫已经整合了大量的非动物DNA，可能有助于它们的生存，从而引发了关于进化起源的问题。文章最后指出，关于轮虫是否在其休眠状态下衰老，以及生命和死亡是否真的是仅有的两种状态，科学界和哲学界仍在争论。它们并非简单地“死亡”或“活着”，这种简单的二分法毫无意义。"
  },
  {
    "id": "43712877",
    "title": "Zack: A Simple Backtesting Engine in Zig",
    "url": "https://github.com/zerotech-studio/zack",
    "summary": "Zack is a lightweight backtesting engine written in Zig, designed for testing trading strategies against historical market data. It simulates trading by processing historical OHLCV data, generating trading signals, simulating order execution, and managing a virtual portfolio. Zig was chosen for its performance, memory control, and simplicity.\n\nThe engine operates through an event loop. It initializes by loading configuration and data, then iterates through the data bar-by-bar. For each bar, it handles data, updates the portfolio value, and looks ahead to the next bar. The current strategy (currently a \"Buy and Hold\" strategy) generates a trading signal based on predefined rules and the portfolio's state. If a signal is generated, the portfolio determines order details, which are then sent to the execution handler for simulation. The execution handler uses the next bar's open price to simulate fill delays. The portfolio is then updated, and the loop continues. Finally, the engine logs the performance results.\n\nThe \"Buy and Hold\" strategy implemented in Zack generates a buy signal when the open price of a bar exceeds a configured threshold, holding the position until the end of the backtest. The configuration is managed through JSON files for simulation parameters and strategy-specific settings. The engine expects OHLCV data in CSV format. The project is structured with distinct directories for configuration, data, source code (including CSV parsing, engine components like data handler, strategy, portfolio, and execution handler), and utilities.\n\nTo run Zack, you need Zig installed, then clone the repository and execute `zig build run`. The output provides a summary of the backtest performance, including initial capital, final equity, total return, and ending position. Future work includes implementing more performance metrics, strategies, and technical indicators, as well as adding unit tests.\n",
    "chinese_title": "Zack：Zig语言的简易回测引擎",
    "chinese_summary": "Zack：一个用Zig编写的轻量级回测引擎，旨在根据历史市场数据测试交易策略。它通过处理历史OHLCV数据、生成交易信号、模拟订单执行和管理虚拟投资组合来模拟交易。选择Zig是因为它的性能、内存控制和简洁性。\n\n该引擎通过事件循环运行。它首先加载配置和数据，然后逐个遍历数据条。对于每个数据条，它处理数据，更新投资组合价值，并展望下一个数据条。当前策略（目前是“买入并持有”策略）根据预定义的规则和投资组合的状态生成交易信号。如果生成信号，投资组合确定订单细节，然后将其发送到执行处理程序进行模拟。执行处理程序使用下一个数据条的开盘价来模拟成交延迟。然后更新投资组合，循环继续。最后，引擎记录性能结果。\n\nZack中实现的“买入并持有”策略在数据条的开盘价超过配置的阈值时生成买入信号，并持有仓位直到回测结束。配置通过JSON文件管理模拟参数和特定于策略的设置。引擎期望OHLCV数据采用CSV格式。该项目结构清晰，包含用于配置、数据、源代码（包括CSV解析、数据处理程序、策略、投资组合和执行处理程序等引擎组件）以及实用程序的独立目录。\n\n要运行Zack，您需要安装Zig，然后克隆存储库并执行`zig build run`。输出提供回测性能摘要，包括初始资本、最终权益、总回报和结束持仓。未来的工作包括实施更多的性能指标、策略和技术指标，以及添加单元测试。"
  },
  {
    "id": "43735724",
    "title": "Frankenstein's `__init__`",
    "url": "https://ohadravid.github.io/posts/2025-04-19-frank/",
    "summary": "This article humorously recounts a developer's debugging adventure tracing a sporadic `AttributeError` in a Python service. The root cause was traced to the `FooBarWidget` class's bizarre implementation of its `__init__` method.\n\nThe test `test_foobar()` sometimes failed because the `FooBarWidget` object lacked the `should_exit` attribute when the `close()` method was called. This attribute should have been initialized in the `FooWidget` class's `__init__` method.\n\nThe twist: `FooBarWidget`'s `__init__` spawned a new thread that then called the parent class's `__init__` (`FooWidget.__init__(self)`) and started the `run()` method.\n\nThe author explains that this unusual approach was taken to avoid blocking the main thread while initializing a `zmq.Socket` (which can't be moved between threads). The `run()` method, dependent on the socket created in `FooWidget.__init__`, also needed to run in a separate thread. So instead of creating the socket in the main thread, both the `__init__` and `run()` were offloaded to the new thread.\n\nThe problem arose because the `FooBarWidget`'s `close()` method could be called *before* the new thread completed initializing the `FooWidget`'s attributes, leading to the `AttributeError`. The author condemns the implementation as a disregard for sanity and common sense despite solving the problem.\n",
    "chinese_title": "弗兰肯斯坦的`__init__`",
    "chinese_summary": "本文幽默地讲述了一名开发者调试Python服务中偶发性`AttributeError`的冒险经历。问题的根源最终追溯到`FooBarWidget`类对其`__init__`方法的奇特实现。\n\n`test_foobar()`测试有时会失败，因为在调用`close()`方法时，`FooBarWidget`对象缺少`should_exit`属性。该属性本应在`FooWidget`类的`__init__`方法中初始化。\n\n问题在于：`FooBarWidget`的`__init__`方法会生成一个新的线程，该线程随后调用父类的`__init__`方法 (`FooWidget.__init__(self)`) 并启动`run()`方法。\n\n作者解释说，采用这种不寻常的方法是为了避免在初始化`zmq.Socket`（无法在线程之间移动）时阻塞主线程。依赖于在`FooWidget.__init__`中创建的套接字的`run()`方法也需要在单独的线程中运行。因此，没有在主线程中创建套接字，而是将`__init__`和`run()`都卸载到新线程中。\n\n问题出现的原因是，`FooBarWidget`的`close()`方法可能在新线程完成`FooWidget`属性初始化*之前*被调用，从而导致`AttributeError`。尽管解决了问题，作者还是谴责这种实现方式无视理智和常识。"
  },
  {
    "id": "43743671",
    "title": "Baby chickens became America's hottest commodity",
    "url": "https://grist.org/economics/how-baby-chickens-became-americas-hottest-commodity/",
    "summary": "The soaring price of eggs, driven by the avian influenza outbreak, has sparked a nationwide frenzy for baby chickens, making them a surprisingly hot commodity. Stores like Murdoch's Ranch & Home Supply are experiencing unprecedented demand, selling out of chicks within hours, and hatcheries are backlogged for months.\n\nWhile the bird flu has increased egg prices significantly, the chick shortage is primarily driven by increased demand rather than a reduced supply of chicks. People are turning to raising chickens at home as a way to achieve self-sufficiency and combat rising egg costs.\n\nExperts like Scott Beyer note that economic downturns often spur interest in backyard farming. However, this trend raises concerns about the long-term commitment required to raise chickens, with some people abandoning or killing birds when the novelty wears off. Startup costs, including coops, feed, and winter care, can also be significant.\n\nDespite potential challenges, raising chickens can be economical and environmentally friendly if done correctly. While chick prices are currently inflated, experts predict that demand will eventually stabilize and commercial egg production will recover, potentially leading to a surplus and discounted egg prices in the future. For now, hatcheries are struggling to keep up with the overwhelming demand for chicks.\n",
    "chinese_title": "小鸡仔成了美国最抢手的商品",
    "chinese_summary": "禽流感推高鸡蛋价格，引发全国抢购雏鸡热潮，使其成为炙手可热的商品。像默多克牧场和家居用品店这样的商店正经历前所未有的需求，雏鸡在几小时内售罄，孵化场也积压了几个月的订单。\n\n虽然禽流感显著提高了鸡蛋价格，但雏鸡短缺主要是由需求增加而非雏鸡供应减少驱动的。人们正在转向在家养鸡，以实现自给自足并对抗不断上涨的鸡蛋成本。\n\n像斯科特·拜尔这样的专家指出，经济衰退通常会激发人们对后院农场的兴趣。然而，这种趋势引发了人们对养鸡所需长期投入的担忧，有些人会在新鲜感过后抛弃或杀死这些家禽。包括鸡舍、饲料和冬季护理在内的启动成本也可能很高。\n\n尽管存在潜在挑战，但如果方法得当，养鸡既经济又环保。虽然目前雏鸡价格虚高，但专家预测，需求最终会稳定下来，商业鸡蛋生产将会恢复，未来可能会出现盈余和鸡蛋价格打折的情况。目前，孵化场正在努力满足对雏鸡的巨大需求。"
  },
  {
    "id": "43705190",
    "title": "High time to tackle drug-resistant fungal infections",
    "url": "https://www.nature.com/articles/d41586-025-01177-x",
    "summary": "This Nature article highlights the growing threat of drug-resistant fungal infections, particularly Candida auris, and the urgent need for action. Fungal infections are a significant cause of death, and their resistance to existing treatments is increasing, partly due to the use of agricultural fungicides. The article emphasizes the neglect of fungal infections in antimicrobial resistance discussions, despite WHO reports highlighting the limited number of antifungal drugs in late-stage trials.\n\nKey challenges include the difficulty in diagnosing fungal infections, especially in low- and middle-income countries, and the similarity of fungal cells to human cells, making drug development complex. The article advocates for increased investment in basic research to identify new drug targets and understand fungal genetics for improved detection and treatment strategies.\n\nThe article also proposes the establishment of clinical trial networks to facilitate research and standardize protocols. A major concern is the cross-resistance arising from the use of similar compounds in agriculture and medicine. Solutions include stricter regulations on fungicide use, research into alternative fungicides, and responsible waste management. The article concludes by stressing the need for collaboration between industry, government, and philanthropic funders to address the growing threat of drug-resistant fungi, especially considering factors like climate change potentially exacerbating the problem.\n",
    "chinese_title": "是时候应对耐药性真菌感染了",
    "chinese_summary": "自然杂志文章强调耐药性真菌感染（特别是耳念珠菌）日益增长的威胁以及采取行动的紧迫性。真菌感染是重要的死亡原因，并且由于农业杀菌剂的使用，它们对现有治疗方法的抵抗力正在增强。尽管世界卫生组织的报告强调后期试验中抗真菌药物的数量有限，但该文章强调了在抗菌素耐药性讨论中对真菌感染的忽视。\n\n主要挑战包括真菌感染诊断的困难，尤其是在中低收入国家，以及真菌细胞与人类细胞的相似性，这使得药物开发变得复杂。文章提倡增加对基础研究的投资，以识别新的药物靶点并了解真菌遗传学，从而改进检测和治疗策略。\n\n该文章还建议建立临床试验网络，以促进研究和标准化协议。一个主要担忧是农业和医学中使用类似化合物所产生的交叉耐药性。解决方案包括对杀菌剂使用的更严格规定、对替代杀菌剂的研究以及负责任的废物管理。文章最后强调，工业界、政府和慈善资助者需要合作，以应对耐药性真菌日益增长的威胁，尤其考虑到气候变化等因素可能会加剧这个问题。"
  },
  {
    "id": "43736366",
    "title": "Inferring the Phylogeny of Large Language Models",
    "url": "https://arxiv.org/abs/2404.04671",
    "summary": "This arXiv article introduces \"PhyloLM,\" a novel method for inferring the phylogeny of Large Language Models (LLMs) and predicting their performance. The authors, Nicolas Yax, Pierre-Yves Oudeyer, and Stefano Palminteri, adapt phylogenetic algorithms, traditionally used in evolutionary biology, to the domain of LLMs.\n\nPhyloLM calculates a phylogenetic distance metric based on the similarity of LLMs' outputs. This metric is then used to construct dendrograms, visually representing the relationships between the models. The authors demonstrate that these dendrograms accurately reflect known relationships among a set of 111 open-source and 45 closed-source LLMs.\n\nImportantly, the paper shows that the phylogenetic distance calculated by PhyloLM can predict LLM performance on standard benchmarks. This suggests that PhyloLM can be used to estimate an LLM's capabilities in a time- and cost-effective manner, even without access to transparent training information.\n\nIn essence, PhyloLM translates concepts from population genetics to machine learning, providing a tool to evaluate LLM development, relationships, and capabilities. The paper emphasizes the potential for this approach to offer insights into LLM evolution and performance prediction. The research touches on Computer Science (Computation and Language, Machine Learning) and aligns with Populations and Evolution (q-bio.PE), highlighting the interdisciplinary nature of the work.\n",
    "chinese_title": "大型语言模型的谱系推断",
    "chinese_summary": "本文介绍了一种名为“PhyloLM”的新方法，用于推断大型语言模型（LLM）的系统发育并预测其性能。作者Nicolas Yax、Pierre-Yves Oudeyer和Stefano Palminteri将传统上用于进化生物学的系统发育算法应用于LLM领域。\n\nPhyloLM计算基于LLM输出相似性的系统发育距离度量。然后，该度量用于构建树状图，直观地表示模型之间的关系。作者证明这些树状图准确地反映了一组111个开源和45个闭源LLM之间的已知关系。\n\n重要的是，本文表明PhyloLM计算的系统发育距离可以预测LLM在标准基准上的性能。这表明PhyloLM可用于以经济高效的方式评估LLM的能力，即使无法访问透明的训练信息。\n\n本质上，PhyloLM将群体遗传学的概念转化为机器学习，提供了一种评估LLM开发、关系和能力的工具。本文强调了这种方法在提供对LLM进化和性能预测的见解方面的潜力。该研究涉及计算机科学（计算与语言、机器学习），并与群体与进化（q-bio.PE）相一致，突出了该工作的跨学科性质。"
  },
  {
    "id": "43705231",
    "title": "Why drinking coffee in Iran has become so complicated",
    "url": "https://adelbordbari.github.io/etc/2025-04-16-coffee/",
    "summary": "The article humorously critiques the modern coffee culture in Iran, contrasting it with the historical simplicity of coffee drinking in the country. It begins with a satirical observation about the elaborate and pretentious ordering process in contemporary Iranian cafes.\n\nThe author argues that these new cafes are less about the coffee itself and more about selling a lifestyle, focusing on elaborate descriptions, single-origin beans, and the perceived status of drinking premium coffee. This trend is driven by marketing strategies that segment customers, catering to those who want a no-fuss coffee, an \"experience,\" or Instagram-worthy content.\n\nThe author argues that this trend is driven by the insecurities and desires of consumers who use coffee as a status symbol and signal of identity. Cafés ruthlessly exploit this desire, selling the *idea* of being a coffee connoisseur rather than simply a beverage.\n\nWhile acknowledging that cafes are becoming hubs for work and socializing in cities like Tehran and Isfahan, the author emphasizes that the elaborate coffee culture is largely a commercial stunt far removed from the simpler, more genuine coffeehouse experiences of the past. The core issue is that the simplicity of enjoying coffee is lost amidst the theatricality.\n\nFinally, the article concludes pessimistically, suggesting that this trend is likely to persist because too many stakeholders are invested in it, making it difficult to find a simple, straightforward cup of coffee.\n",
    "chinese_title": "在伊朗喝咖啡为何变得如此复杂",
    "chinese_summary": "本文幽默地批判了伊朗现代咖啡文化，并将其与该国历史上咖啡饮用的简单性进行了对比。文章以讽刺的笔调开篇，描述了当代伊朗咖啡馆中繁琐而矫揉造作的点单过程。\n\n作者认为，这些新型咖啡馆与其说是为了卖咖啡，不如说是为了贩卖一种生活方式，侧重于详尽的描述、单一产地的咖啡豆以及饮用优质咖啡所带来的身份地位。这种趋势是由营销策略驱动的，这些策略细分客户，迎合那些想要简单咖啡、追求“体验”或渴望获得适合在Instagram上分享的内容的人群。\n\n作者认为，这一趋势源于消费者的不安全感和欲望，他们将咖啡作为一种地位象征和身份信号。咖啡馆无情地利用了这种欲望，出售的是成为咖啡鉴赏家的*概念*，而不仅仅是一种饮料。\n\n作者承认，在德黑兰和伊斯法罕等城市，咖啡馆正成为工作和社交的中心，但他强调，这种精心设计的咖啡文化在很大程度上是一种商业噱头，与过去更简单、更真实的咖啡馆体验相去甚远。核心问题在于，享受咖啡的简单性在这种戏剧化的氛围中消失了。\n\n最后，文章悲观地总结道，这种趋势可能会持续下去，因为太多的利益相关者都投入其中，使得找到一杯简单直接的咖啡变得困难。"
  },
  {
    "id": "43710912",
    "title": "Calypsi: A series of C compiler and assembly language cross compiler tool chains",
    "url": "https://github.com/hth313/Calypsi-tool-chains",
    "summary": "Calypsi is a series of closed-source C compiler and assembly language cross-compiler toolchains designed for retro and hobbyist communities, with future plans to expand to embedded programming targets. The latest release, version 5.10, supports targets including MOS 6502, WDC 65816, Motorola 68000, and HP Nut. Supported host platforms include Arch Linux, Debian-based Linux (Ubuntu 20.04), Fedora-based Linux (Fedora 40, except Nut), macOS x86, and Windows 64-bit.\n\nThe Calypsi toolchains feature an ISO C 99 compliant compiler with support for integer types up to 64 bits, floating-point operations, struct/union/typedef, and variable-sized arrays. The optimizing compiler generates source-level debugging information and supports ELF/DWARF, hex output, and target-specific output formats. A source code debugger is also included.\n\nWhile the tools are closed source, they are free for hobby use (excluding commercial applications). An exception is the HP-41 Nut target which is BSD licensed and free for commercial use.\n\nThe document also lists open-source projects utilizing Calypsi, categorized by target processor, offering board support packages and \"Hello World\" examples. It also provides contact information for feedback and donations, alongside a disclaimer that donations are appreciated.\n",
    "chinese_title": "Calypsi：一系列C编译器和汇编语言交叉编译器工具链",
    "chinese_summary": "Calypsi是一系列闭源的C编译器和汇编语言交叉编译工具链，专为复古和业余爱好者社区设计，未来计划扩展到嵌入式编程目标。最新版本5.10支持包括MOS 6502、WDC 65816、Motorola 68000和HP Nut等目标。支持的主机平台包括Arch Linux、基于Debian的Linux (Ubuntu 20.04)、基于Fedora的Linux (Fedora 40，Nut除外)、macOS x86和Windows 64位。\n\nCalypsi工具链具有符合ISO C 99标准的编译器，支持高达64位的整数类型、浮点运算、结构体/联合体/类型定义以及变长数组。优化编译器生成源代码级别的调试信息，并支持ELF/DWARF、十六进制输出和特定于目标的输出格式。还包含一个源代码调试器。\n\n虽然这些工具是闭源的，但可免费用于业余爱好（不包括商业应用）。HP-41 Nut目标是一个例外，它采用BSD许可，可免费用于商业用途。\n\n该文档还列出了利用Calypsi的开源项目，按目标处理器分类，提供板级支持包和“Hello World”示例。此外，它还提供联系方式，用于反馈和捐赠，并附带捐赠是受欢迎的声明。"
  },
  {
    "id": "43735945",
    "title": "Open Source DMR Modem Implementation in SDR with GNU Radio and Codec2",
    "url": "https://qradiolink.org/open-source-DMR-transceiver-implementation.html",
    "summary": "The article \"Open Source DMR Modem Implementation in SDR with GNU Radio and Codec2\" describes a project implementing a Digital Mobile Radio (DMR) modem using open-source software tools, specifically GNU Radio and Codec2. The goal is to create a completely open and accessible DMR transceiver that can be used with Software Defined Radios (SDRs).\n\nThe project leverages the flexibility of GNU Radio to handle the complex signal processing tasks required for DMR demodulation and modulation. It also utilizes Codec2, an open-source speech codec, for the voice encoding/decoding portion of the DMR standard. This is crucial because DMR uses a specific vocoder for voice transmission.\n\nThe implementation aims to provide a full DMR protocol stack, covering the physical layer (modulation/demodulation, timing recovery, etc.) and the data link layer (framing, error correction, etc.). By using GNU Radio, the project allows users to easily experiment with and modify the DMR implementation, fostering innovation and understanding of the protocol.\n\nThe article likely discusses the challenges involved in implementing a DMR modem, such as the complex modulation schemes and synchronization requirements. It may also highlight the advantages of using an open-source approach, including cost savings, transparency, and community contributions. Ultimately, the project seeks to lower the barrier to entry for individuals and organizations interested in exploring and utilizing DMR technology, by providing a complete, free, and open-source alternative to proprietary solutions.\n",
    "chinese_title": "基于GNU Radio和Codec2的开源SDR中DMR调制解调器实现",
    "chinese_summary": "基于GNU Radio和Codec2的SDR开源DMR调制解调器实现"
  },
  {
    "id": "43740145",
    "title": "Can We Trust CVE?",
    "url": "https://opensourcesecurity.io/2025/04-can-we-trust-cve/",
    "summary": "This article explores the crisis of trust surrounding the CVE (Common Vulnerabilities and Exposures) program, triggered by funding issues and a lack of transparent communication. The author argues that the CVE program, along with NVD (National Vulnerability Database), has eroded public trust due to delayed responses, vague statements, and a general lack of clarity regarding its future.\n\nThe article criticizes the timing of VulnCon and the slow response to the funding crisis.\n\nThe author suggests that existing trust in CVE has been diminished, and calls for a new approach built on openness and transparency. The article then evaluates alternative vulnerability intelligence initiatives:\n\n*   **OWASP Unified Framework for Global Vulnerability Intelligence:** A decentralized, open-source project with potential, earning a 7/10 for trust due to its well-known foundation and named author.\n*   **EUVD (European Vulnerability Database):** Backed by European law, offering mandated trust within Europe, rated 5/10 for an \"obtuse website\" but guaranteed trust from regulations.\n*   **GCVE (run by CIRCL):** Raises concerns due to unclear affiliations and potentially misleading statements. Initially rated 1/10 for trust, revised to 5/10 after additional info was discovered.\n*   **The CVE Foundation:** Criticized for its lack of transparency, anonymous members, and questionable ties to the existing CVE structure, earning a 1/10 for trust.\n\nThe article concludes by emphasizing the importance of trust in any replacement for CVE and recommends monitoring the OWASP project.\n",
    "chinese_title": "我们能信任CVE吗？",
    "chinese_summary": "本文探讨了围绕CVE（常见漏洞和暴露）计划的信任危机，这场危机由资金问题和缺乏透明沟通引发。作者认为，由于响应延迟、含糊不清的声明以及对未来缺乏明确性，CVE计划以及NVD（国家漏洞数据库）已经侵蚀了公众信任。\n\n本文批评了VulnCon的举办时机以及对资金危机的迟缓反应。\n\n作者认为，人们对CVE的现有信任已经减弱，并呼吁建立一种基于开放和透明的新方法。文章随后评估了替代的漏洞情报计划：\n\n*   **OWASP全球漏洞情报统一框架：** 一个去中心化的开源项目，具有潜力，因其知名基础和具名作者而获得7/10的信任评分。\n*   **EUVD（欧洲漏洞数据库）：** 由欧洲法律支持，在欧洲范围内提供强制信任，因“晦涩难懂的网站”而获得5/10的评分，但法规保证了信任。\n*   **GCVE（由CIRCL运营）：** 因其不明确的隶属关系和可能具有误导性的声明而引发担忧。最初信任评分为1/10，在发现更多信息后修改为5/10。\n*   **CVE基金会：** 因缺乏透明度、匿名成员以及与现有CVE结构的可疑联系而受到批评，获得1/10的信任评分。\n\n文章最后强调了信任对于任何CVE替代方案的重要性，并建议监控OWASP项目。"
  },
  {
    "id": "43737278",
    "title": "Show HN: Web Video editor, 100% local, AI subtitle, auto cut based on volume",
    "url": "https://silenceslicer.com",
    "summary": "The article is a \"Show HN\" post introducing \"Silence Slicer,\" a web-based video editor that emphasizes privacy and local processing. The key feature is that it operates entirely within the user's browser, requiring no downloads or uploads. This means the video data remains on the user's device, addressing privacy concerns. The editor offers AI-powered subtitle generation and automatic cutting based on volume levels (presumably to remove silences or unwanted audio segments). The core value proposition is a private and convenient video editing experience without compromising data security. The post explicitly states the necessity of JavaScript for the application to function.\n",
    "chinese_title": "Show HN：本地Web视频编辑器，AI字幕，基于音量自动剪辑",
    "chinese_summary": "\"Show HN\"文章介绍\"Silence Slicer\"，一款强调隐私和本地处理的在线视频编辑器。其主要特点是完全在用户浏览器内运行，无需下载或上传。这意味着视频数据保留在用户设备上，解决了隐私问题。该编辑器提供AI字幕生成和基于音量水平的自动剪辑（可能是为了删除静音或不需要的音频片段）。核心价值在于提供私密便捷且不损害数据安全的视频编辑体验。该文章明确指出，该应用程序需要JavaScript才能运行。"
  },
  {
    "id": "43708841",
    "title": "AI-Designed Antivenoms: New Proteins to Block Deadly Snake Toxins",
    "url": "https://plentyofroom.beehiiv.com/p/antivenoms-with-ai-designed-proteins",
    "summary": "This article from \"Plenty of Room\" discusses a promising new approach to antivenom production using AI-designed proteins. Traditional antivenoms, produced by inoculating animals, are expensive, slow to produce, cause side effects, and are often ineffective, especially in low-resource settings where snakebites are prevalent.\n\nResearchers are using AI-driven protein design, specifically the RFdiffusion algorithm, to create proteins that can bind and neutralize toxins found in cobra and other snake venoms. They focused on α-neurotoxins and cytotoxins, both families within the 3FTxs toxin group. The process involves target analysis using crystallography data, binder generation with RFdiffusion, and optimization with ProteinMPNN and AlphaFold2.\n\nThe researchers developed three key binders: SHRT (for short-chain α-neurotoxins), LNG (for long-chain α-neurotoxins), and CYTX (for cobra cytotoxins). SHRT and LNG exhibited nanomolar binding affinity and completely neutralized α-neurotoxin activity in vitro and protected mice from lethal doses in vivo. CYTX showed limited in vivo efficacy and requires further optimization.\n\nAI-designed antivenoms offer several advantages over traditional methods: higher affinities, minimal cross-reactivity, cost-effective production in *E. coli*, high thermal stability for use in low-resource settings, and the potential to target multiple toxin families simultaneously. The article highlights the practical application of AI in addressing a significant global health challenge, although it acknowledges that further research and development are needed before these AI-designed antivenoms become widely available.\n",
    "chinese_title": "AI设计抗蛇毒血清：阻断致命蛇毒的新蛋白",
    "chinese_summary": "《有的是空间》的这篇文章探讨了一种利用人工智能设计的蛋白质生产抗蛇毒血清的有前景的新方法。传统的抗蛇毒血清通过给动物接种毒液来生产，成本高昂、生产缓慢、会产生副作用，而且通常效果不佳，尤其是在蛇咬伤普遍的低资源环境中。\n\n研究人员正在使用人工智能驱动的蛋白质设计，特别是 RFdiffusion 算法，来创造可以结合并中和眼镜蛇和其他蛇毒液中的毒素的蛋白质。他们专注于 α-神经毒素和细胞毒素，这两个家族都属于 3FTxs 毒素组。该过程包括使用晶体学数据进行靶标分析，使用 RFdiffusion 生成结合剂，并使用 ProteinMPNN 和 AlphaFold2 进行优化。\n\n研究人员开发了三种关键结合剂：SHRT（针对短链 α-神经毒素）、LNG（针对长链 α-神经毒素）和 CYTX（针对眼镜蛇细胞毒素）。SHRT 和 LNG 表现出纳摩尔级的结合亲和力，并在体外完全中和了 α-神经毒素活性，并在体内保护小鼠免受致命剂量的侵害。CYTX 在体内的功效有限，需要进一步优化。\n\n与传统方法相比，人工智能设计的抗蛇毒血清具有以下几个优点：更高的亲和力、最小的交叉反应、在大肠杆菌中经济高效的生产、在低资源环境中使用的高热稳定性，以及同时靶向多个毒素家族的潜力。这篇文章强调了人工智能在应对重大全球健康挑战方面的实际应用，但也承认在这些人工智能设计的抗蛇毒血清广泛应用之前，还需要进一步的研究和开发。"
  },
  {
    "id": "43742529",
    "title": "Bootstrapping Rustc from Source",
    "url": "https://github.com/dtolnay/bootstrap",
    "summary": "This document outlines a method for bootstrapping the Rust compiler (rustc) from source, avoiding reliance on pre-compiled Rust binaries downloaded from the internet. It addresses the challenge of rustc being written in Rust, typically requiring an existing Rust compiler for building.\n\nThe approach utilizes mrustc, a Rust compiler implemented in C++, capable of compiling older versions of rustc and cargo. The process is executed within a Debian chroot for a consistent environment and firejail to prevent network access during the build.\n\nThe motivation stems from the desire to improve rustc's reproducibility. Ideally, this bootstrap chain will converge with the official release chain, enabling hash verification and detecting potential tampering. The ultimate goal is to establish independent bootstrap chains across reputable organizations, allowing them to attest to the integrity of official rustc releases through hash matching. This diverse confirmation process would significantly enhance user confidence in the security and trustworthiness of official releases, even in high-security scenarios.\n\nThe steps involve: installing debootstrap and firejail, cloning the repository, downloading mrustc and necessary rustc sources, initializing the chroot environment, entering the chroot with networking blocked, and executing the build script. Note that bootstrapping rustc requires significant disk space (approximately 140 GB for rustc 1.83).\n",
    "chinese_title": "从源代码引导 Rustc",
    "chinese_summary": "本文概述了一种从源代码引导 Rust 编译器 (rustc) 的方法，避免依赖从互联网下载的预编译 Rust 二进制文件。它解决了 rustc 以 Rust 编写，通常需要现有 Rust 编译器进行构建的难题。\n\n该方法利用 mrustc，一个用 C++ 实现的 Rust 编译器，能够编译较旧版本的 rustc 和 cargo。该过程在 Debian chroot 中执行，以获得一致的环境，并使用 firejail 阻止构建期间的网络访问。\n\n其动机源于提高 rustc 可重现性的愿望。理想情况下，此引导链将与官方发布链收敛，从而实现哈希验证并检测潜在的篡改。最终目标是在信誉良好的组织之间建立独立的引导链，使他们能够通过哈希匹配来证明官方 rustc 版本的完整性。这种多样化的确认过程将显著提高用户对官方版本安全性和可信度的信心，即使在高安全性的情况下也是如此。\n\n这些步骤包括：安装 debootstrap 和 firejail，克隆存储库，下载 mrustc 和必要的 rustc 源代码，初始化 chroot 环境，进入被阻止网络的 chroot，以及执行构建脚本。请注意，引导 rustc 需要大量的磁盘空间（rustc 1.83 大约需要 140 GB）。"
  },
  {
    "id": "43735693",
    "title": "Neurite",
    "url": "https://github.com/satellitecomponent/Neurite",
    "summary": "Neurite is an open-source project developing a novel digital interface that blends fractal geometry with mind-mapping techniques to create a virtually limitless workspace. It utilizes nodes (text, images, videos, code, AI agents) connected within a physics-simulated graph overlaid on a customizable fractal landscape, offering a unique way to organize thoughts and ideas.\n\nKey features include real-time fractal navigation and customization (Mandelbrot set, etc.), a multi-agent UI for collaborative communication between AI nodes, and FractalGPT, an AI Zettelkasten that responds as a graph of thoughts. Neurite supports synchronized knowledge management with bi-directional sync between the mind-mapping workspace and text-based notes, offering custom formatting and note creation. It also integrates with external knowledge sources like Wolfram Alpha and Wikipedia.\n\nThe Neural API allows advanced users to build custom interactions using Neurite's functions. Neurite Desktop, a browser-independent version, enables opening multiple browser windows within the fractal canvas and offers unrestricted web browsing in link nodes. The platform allows users to embed various media types directly into the Mandelbrot set and offers a function calling panel for executing Neurite's code.\n",
    "chinese_title": "神经突",
    "chinese_summary": "Neurite：一个开源项目，开发一种新型数字界面，将分形几何与思维导图技术相融合，以创建一个几乎无限的工作空间。它利用在可定制分形景观上叠加的物理模拟图中连接的节点（文本、图像、视频、代码、AI 代理），提供一种独特的组织思想和想法的方式。\n\n主要功能包括实时分形导航和定制（Mandelbrot 集等）、用于 AI 节点之间协同通信的多代理 UI，以及 FractalGPT，一个以思维图形式响应的 AI Zettelkasten。 Neurite 支持同步知识管理，在思维导图工作空间和基于文本的笔记之间进行双向同步，提供自定义格式和笔记创建。它还与 Wolfram Alpha 和 Wikipedia 等外部知识源集成。\n\nNeural API 允许高级用户使用 Neurite 的函数构建自定义交互。 Neurite Desktop 是一个独立于浏览器的版本，可以在分形画布中打开多个浏览器窗口，并在链接节点中提供无限制的网页浏览。 该平台允许用户将各种媒体类型直接嵌入到 Mandelbrot 集中，并提供用于执行 Neurite 代码的函数调用面板。"
  },
  {
    "id": "43731165",
    "title": "15,000 lines of verified cryptography now in Python",
    "url": "https://jonathan.protzenko.fr/2025/04/18/python.html",
    "summary": "This article details the successful integration of 15,000 lines of verified C code from the HACL* cryptographic library into Python, replacing its previous, potentially vulnerable, hash-related infrastructure. Motivated by a SHA3 vulnerability, the author spearheaded the project, which took 2.5 years and involved significant contributions from multiple individuals and the HACS workshops.\n\nThe integration was transparent to Python users, with no loss of functionality. HACL* was adapted to meet Python's specific requirements, including new modes for Blake2, a new API for SHA3, build system abstractions, proper error management for allocation failures, and optimized HMAC implementation.\n\nA key technical challenge involved developing a fully generic and verified streaming API for block algorithms. This allows for efficient handling of cryptographic inputs of varying lengths and enables extraction of intermediary hashes without invalidating the algorithm's state. The author highlights the complexities of ensuring compatibility across various compilers and architectures during the build process, particularly with HMAC and AVX2 implementations. Memory allocation failure handling was also addressed by introducing option types to propagate errors.\n\nThe article concludes with the ease of updating the HACL* code in Python via a simple shell script, demonstrating the maintainability of the integration. The author emphasizes that this successful integration proves the maturity and real-world readiness of verified cryptography for large-scale projects.\n",
    "chinese_title": "15,000行经过验证的密码学代码现已登陆Python",
    "chinese_summary": "本文详细介绍了如何成功地将 HACL* 密码学库中经过验证的 15,000 行 C 代码集成到 Python 中，以替换其以前可能存在漏洞的哈希相关基础设施。在 SHA3 漏洞的驱动下，作者带头开展了该项目，历时 2.5 年，并得到了多个个人和 HACS 研讨会的重大贡献。\n\n此次集成对 Python 用户是透明的，并且没有损失任何功能。HACL* 经过调整以满足 Python 的特定要求，包括 Blake2 的新模式、SHA3 的新 API、构建系统抽象、针对分配失败的适当错误管理以及优化的 HMAC 实现。\n\n一个关键的技术挑战在于开发一个完全通用且经过验证的块算法流式 API。这允许高效处理不同长度的密码学输入，并能够提取中间哈希值而不会使算法状态失效。作者强调了在构建过程中确保跨各种编译器和架构兼容性的复杂性，尤其是在 HMAC 和 AVX2 实现方面。内存分配失败处理也通过引入选项类型来传播错误得到解决。\n\n文章最后介绍了通过一个简单的 shell 脚本在 Python 中轻松更新 HACL* 代码的方法，展示了集成的可维护性。作者强调，这种成功的集成证明了经过验证的密码学对于大型项目的成熟度和实际应用准备情况。"
  },
  {
    "id": "43742859",
    "title": "You Commit Three Felonies a Day (2013)",
    "url": "https://kottke.org/13/06/you-commit-three-felonies-a-day",
    "summary": "This article, titled \"You Commit Three Felonies a Day,\" discusses Harvey Silverglate's book, *Three Felonies a Day*, which argues that due to the sheer volume and vague nature of modern federal criminal laws, the average person unknowingly commits multiple felonies daily. This gives the government the power to target anyone they dislike by finding a prosecutable offense.\n\nSilverglate contends that these federal criminal laws have expanded beyond statutes into the complex Code of Federal Regulations, providing prosecutors with an arsenal of technical prohibitions. This situation isn't limited to \"white collar criminals,\" but affects all citizens and threatens the integrity of democracy.\n\nThe article uses the case of Joseph P. Nacchio, former CEO of QWest, as an example. Nacchio refused an NSA request to wiretap his customers before 9/11. Subsequently, QWest lost billion-dollar contracts, and Nacchio was prosecuted and imprisoned for insider trading. The article argues that Nacchio's conviction was a trumped-up charge stemming from his refusal to cooperate with the NSA.\n\nThe article concludes that the combination of broad criminal laws and extensive government surveillance creates a system where any US citizen can be easily accused of a felony, undermining the concept of a free society. It also mentions a Wall Street Journal investigation into the expanding federal criminal law book.\n",
    "chinese_title": "你每天犯下三项重罪 (2013)",
    "chinese_summary": "你每天犯下三项重罪"
  },
  {
    "id": "43731552",
    "title": "Full Text Search of US Court records",
    "url": "https://www.judyrecords.com/",
    "summary": "This short article introduces \"judyrecords,\" a search engine offering access to over 740 million United States court cases. It positions itself as a free public records search tool. The article also mentions the website has sections for terms of use, informational details (\"info\"), and API access, suggesting the possibility for developers to integrate the service. In essence, the article promotes judyrecords as a resource for searching US court records.\n",
    "chinese_title": "美国法院记录全文搜索",
    "chinese_summary": "这篇短文介绍了“judyrecords”——一个提供超过7.4亿美国法院案件访问权限的搜索引擎。它定位为一个免费的公共记录搜索工具。文章还提到该网站有使用条款、信息详情（“信息”）和API访问等部分，暗示了开发者集成该服务的可能性。 总之，这篇文章将judyrecords推广为搜索美国法院记录的资源。"
  },
  {
    "id": "43733097",
    "title": "Cozy video games can quell stress and anxiety",
    "url": "https://www.reuters.com/business/retail-consumer/cozy-video-games-can-quell-stress-anxiety-2025-01-27/",
    "summary": "Cozy video games, characterized by their low-stakes gameplay, gentle narratives, and calming aesthetics, are gaining popularity as tools for stress and anxiety relief. The Reuters article highlights how these games, which often focus on activities like farming, crafting, building, and exploration without intense combat or pressure, offer players a sense of control and accomplishment that can be therapeutic.\n\nThe article points to examples like *Animal Crossing*, *Stardew Valley*, and *Unpacking* as prime examples of the genre. These games provide a safe and predictable environment where players can unwind, express creativity, and experience a sense of connection without the demands of real-world responsibilities.\n\nExperts interviewed in the article suggest that the repetitive, predictable tasks and the feeling of progress in these games can be particularly helpful in managing anxiety. The lack of time pressure and the focus on nurturing and creation allow players to escape from overwhelming thoughts and find a sense of peace and calm. Furthermore, the social aspects, such as visiting friends' islands in *Animal Crossing*, can provide a sense of community and connection, combating feelings of isolation. The article concludes that while not a replacement for professional mental health treatment, cozy video games can be a valuable tool for self-care and stress reduction.\n",
    "chinese_title": "轻松的电子游戏可以缓解压力和焦虑。",
    "chinese_summary": "轻松游戏：缓解压力和焦虑的新选择\n\n轻松游戏以其低风险的游戏玩法、舒缓的叙事和令人平静的视觉效果为特点，作为缓解压力和焦虑的工具正日益普及。路透社的文章强调，这些游戏通常专注于诸如耕种、制作、建造和探索等活动，而没有激烈的战斗或压力，从而为玩家提供一种控制感和成就感，这可能具有治疗作用。\n\n文章指出，《动物森友会》、《星露谷物语》和《Unpacking》是该类型的典型例子。这些游戏提供了一个安全且可预测的环境，玩家可以在其中放松身心、表达创造力，并在没有现实世界责任的情况下体验一种联系感。\n\n文章中采访的专家认为，这些游戏中重复、可预测的任务以及进步感可能特别有助于控制焦虑。缺乏时间压力以及对培养和创造的关注使玩家可以摆脱压倒性的想法，并找到一种平和与平静的感觉。此外，社交方面，例如在《动物森友会》中访问朋友的岛屿，可以提供一种社区和联系感，从而对抗孤立感。文章总结说，虽然不能替代专业的心理健康治疗，但轻松游戏可以成为自我保健和减轻压力的宝贵工具。"
  },
  {
    "id": "43741790",
    "title": "Ansible: Pure (Only in Its) Pragmatism",
    "url": "https://andrejradovic.com/blog/ansible/",
    "summary": "This article provides a pragmatic review of Ansible, emphasizing its strengths and weaknesses after a decade of use. Ansible is positioned as a tool for remotely managing systems, enforcing desired states through idempotence. It leverages a YAML-based DSL with Jinja2 templating, boasting a massive community and extensive library of plugins via Ansible Galaxy.\n\nThe author highlights Ansible's file-based organizational structure and its adherence to a YAML style. While criticized for its simplicity (global variables, lack of namespacing), this simplicity contributes to its accessibility. Ansible excels at automating routine sysadmin tasks across diverse platforms like Windows and Linux, offering a consistent interface to APIs.\n\nCompared to shell scripts, Ansible provides reliability, idempotence, and a consistent interface. While Puppet, Saltstack, and Chef offer alternatives, Ansible stands out as the fully-featured agentless solution, enabling drive-by configuration. Its agentless nature, however, means it doesn't enforce continuous compliance.\n\nThe author suggests Ansible is best suited for ensuring specific configurations on pet machines, acting as a superior alternative to shell scripting. Its key advantages include a large community, abundant resources, and AI language model support. It falls short in scenarios demanding comprehensive infrastructure-as-code, where Puppet or a modern OpenTofu + Packer approach are preferred. Despite its flaws, Ansible remains a valuable and irreplaceable tool for simple, common tasks across multiple machines, especially for interactions with APIs.\n",
    "chinese_title": "Ansible: 纯粹的实用主义",
    "chinese_summary": "本文对 Ansible 进行了务实的评估，强调了其使用十年后的优势和劣势。Ansible 定位为远程管理系统的工具，通过幂等性来强制执行所需状态。它利用基于 YAML 的 DSL 与 Jinja2 模板，并拥有庞大的社区和通过 Ansible Galaxy 提供的广泛插件库。\n\n作者强调了 Ansible 基于文件的组织结构及其对 YAML 风格的坚持。尽管因其简单性（全局变量，缺乏命名空间）而受到批评，但这种简单性有助于其易用性。Ansible 擅长于自动化跨 Windows 和 Linux 等不同平台的日常系统管理任务，为 API 提供一致的接口。\n\n与 shell 脚本相比，Ansible 提供了可靠性、幂等性和一致的接口。虽然 Puppet、Saltstack 和 Chef 提供了替代方案，但 Ansible 作为功能齐全的无代理解决方案脱颖而出，可实现“顺手拈来”式的配置。然而，其无代理性质意味着它无法强制执行持续合规性。\n\n作者认为 Ansible 最适合确保宠物机器上的特定配置，是 shell 脚本的优秀替代方案。其主要优势包括庞大的社区、丰富的资源和 AI 语言模型支持。在需要全面基础设施即代码的场景中，它表现不足，而 Puppet 或现代 OpenTofu + Packer 方法是首选。尽管存在缺陷，但 Ansible 仍然是跨多台机器执行简单、常见任务（尤其是与 API 交互）的宝贵且不可替代的工具。"
  },
  {
    "id": "43703998",
    "title": "Hydrogen vs. Battery Buses: A European Transit Reality Check",
    "url": "https://cleantechnica.com/2025/04/14/hydrogen-vs-battery-buses-a-european-transit-reality-check/",
    "summary": "This article provides a European reality check on hydrogen versus battery-electric buses, examining several deployments and trials. It highlights failures in Brussels and Aberdeen due to high hydrogen costs and supply issues, leading them to switch to battery-electric buses.\n\nThe article notes some \"successes\" like Cologne, leveraging industrial by-product hydrogen, and Auxerre, with dedicated green hydrogen production. However, it points out the common issue of hydrogen leakage impacting its climate benefits. Wuppertal is described as a questionable success as they are burning plastic as a source of energy to produce Hydrogen. Other cities like Bolzano and Groningen/Drenthe use hydrogen buses, but also invest heavily in battery-electric buses, which often prove more cost-effective and practical.\n\nTroubled trials in Essen/Mülheim, Pau, and Montpellier showcase the challenges of hydrogen buses, including subsidy withdrawals, high costs, and technical issues. Montpellier even cancelled its hydrogen bus plan due to significantly higher operating costs compared to battery-electric alternatives. While London maintains its hydrogen bus fleet, new procurements are focused on battery-electric models. The overall trend suggests that while hydrogen buses are being explored, battery-electric buses are emerging as the more viable and scalable solution for decarbonizing public transit in Europe.\n",
    "chinese_title": "氢燃料电池公交车与纯电动公交车：欧洲公共交通的现实检验",
    "chinese_summary": "氢燃料巴士与纯电动巴士：欧洲现实考察——以布鲁塞尔和阿伯丁为例，高昂成本和供应问题导致其转向纯电动巴士。科隆利用工业副产品氢，欧塞尔则采用专门的绿色氢生产，但普遍存在氢气泄漏影响气候效益的问题。伍珀塔尔燃烧塑料生产氢的成功性存疑。博尔扎诺和格罗宁根/德伦特等地使用氢燃料巴士，但也大量投资于更具成本效益和实用性的纯电动巴士。埃森/米尔海姆、波城和蒙彼利埃的试验凸显氢燃料巴士的挑战，包括补贴撤回、成本高昂和技术问题。蒙彼利埃甚至因运营成本远高于纯电动巴士而取消氢燃料巴士计划。伦敦保留了氢燃料巴士车队，但新增采购侧重于纯电动车型。总体趋势表明，虽然氢燃料巴士正在探索中，但纯电动巴士正成为欧洲公共交通脱碳更可行和可扩展的解决方案。"
  },
  {
    "id": "43701836",
    "title": "Raw Loops for Performance?",
    "url": "https://www.sandordargo.com/blog/2025/04/16/raw-loops-for-performance",
    "summary": "This article explores the performance implications of replacing raw loops with C++20 ranges for transforming data, prompted by the author's aversion to raw loops as advocated by Sean Parent. The author compares a raw loop using `push_back`, a range-based transformation using `std::ranges::transform`, and an optimized raw loop using `emplace_back` with `reserve`.\n\nThe author modifies the `ToData` struct to track constructor calls, revealing that the ranges version performs transformations lazily, leading to fewer calls during the transformation pipeline but introduces an extra move operation when the view is materialized into a vector. The optimized raw loop using `emplace_back` avoids unnecessary copy and move operations, resulting in the fewest constructor calls.\n\nBenchmarks using Quick Bench show that the optimized raw loop is faster than the ranges version, with the original raw loop being the slowest. However, the author emphasizes that performance differences might be negligible depending on the use case and the presence of other bottlenecks like network calls or database interactions. The article concludes that while ranges offer readability advantages, they might not always deliver superior performance. The recommendation is to measure performance in context and prioritize readability when performance differences are insignificant. The article advises against using `push_back` without `reserve` due to performance penalties.\n",
    "chinese_title": "为了性能使用原始循环？",
    "chinese_summary": "本文探讨了用 C++20 ranges 替换原始循环进行数据转换的性能影响，起因是作者对 Sean Parent 提倡的原始循环的反感。作者比较了使用 `push_back` 的原始循环、使用 `std::ranges::transform` 的基于 ranges 的转换，以及使用 `emplace_back` 和 `reserve` 进行优化的原始循环。\n\n作者修改了 `ToData` 结构体来跟踪构造函数调用，结果表明 ranges 版本以惰性方式执行转换，从而在转换管道中减少了调用次数，但在将视图物化为向量时引入了额外的移动操作。使用 `emplace_back` 进行优化的原始循环避免了不必要的复制和移动操作，从而实现了最少的构造函数调用。\n\n使用 Quick Bench 的基准测试表明，优化的原始循环比 ranges 版本更快，而原始循环最慢。但是，作者强调，根据用例以及是否存在其他瓶颈（如网络调用或数据库交互），性能差异可能微不足道。文章总结说，虽然 ranges 提供了可读性优势，但它们可能并不总是提供卓越的性能。建议在上下文中衡量性能，并在性能差异不显著时优先考虑可读性。文章建议不要在没有 `reserve` 的情况下使用 `push_back`，因为它会带来性能损失。"
  },
  {
    "id": "43739028",
    "title": "Unpowered SSD endurance investigation finds data loss and performance issues",
    "url": "https://www.tomshardware.com/pc-components/storage/unpowered-ssd-endurance-investigation-finds-severe-data-loss-and-performance-issues-reminds-us-of-the-importance-of-refreshing-backups",
    "summary": "This article from Tom's Hardware discusses the potential for data loss and performance degradation in SSDs left unpowered for extended periods. It highlights an experiment by TechTuber HTWingNut, who tested four \"Leven JS-600\" SSDs after two years of being unplugged. Two drives were \"fresh\" (minimally used), while the other two were \"worn\" (written with 280TB of data, exceeding their 60TBW rating).\n\nThe \"worn\" SSD showed significant performance degradation and file corruption, taking considerably longer to verify data and exhibiting bad sectors. The \"fresh\" SSD, while initially passing data integrity checks, showed a concerning increase in Hardware ECC Recovered errors, suggesting the drive's health was declining.\n\nThe experiment underscores that SSDs, unlike traditional hard drives, can lose data when unpowered for extended periods. The endurance rating of an SSD is linked to how long it can retain data when unplugged after use. While the sample size was small, the results suggest that storing backups or important files on unpowered SSDs for long durations carries a risk. Regular refreshing of backups and data on SSDs is recommended. The comment section highlights user experiences with similar issues, reinforcing the article's cautionary message. One user even notes that SSDs used beyond their TBW rating are more susceptible to data loss.\n",
    "chinese_title": "无电源SSD耐久性调查发现数据丢失和性能问题",
    "chinese_summary": "Tom's Hardware文章：长期断电SSD存在数据丢失和性能下降风险\n\n这篇文章来自Tom's Hardware，讨论了长期断电的SSD可能存在数据丢失和性能下降的风险。文章重点介绍了科技博主HTWingNut的一项实验，他测试了四块“Leven JS-600”固态硬盘在断电两年后的表现。其中两块硬盘是“全新”的（使用极少），另外两块是“磨损”的（写入了280TB的数据，超过了60TBW的额定值）。\n\n“磨损”的SSD表现出明显的性能下降和文件损坏，验证数据所需的时间明显更长，并出现了坏扇区。“全新”的SSD虽然最初通过了数据完整性检查，但显示出硬件ECC恢复错误的显著增加，表明驱动器的健康状况正在下降。\n\n该实验强调，与传统硬盘不同，SSD在长期断电的情况下可能会丢失数据。SSD的耐久性等级与其在使用后断电时可以保留数据的时间有关。虽然样本量很小，但结果表明，将备份或重要文件长期存储在断电的SSD上存在风险。建议定期刷新SSD上的备份和数据。评论区突出了用户在使用类似问题时的经历，强化了文章的警示信息。一位用户甚至指出，超出TBW额定值使用的SSD更容易发生数据丢失。"
  },
  {
    "id": "43733553",
    "title": "Hands-On Large Language Models",
    "url": "https://github.com/HandsOnLLM/Hands-On-Large-Language-Models",
    "summary": "\"Hands-On Large Language Models,\" dubbed \"The Illustrated LLM Book\" by authors Jay Alammar and Maarten Grootendorst, is a practical guide to using Large Language Models (LLMs), accompanied by code examples available in a GitHub repository. The book emphasizes visual learning with nearly 300 figures and covers essential tools and concepts, recommending Google Colab for running the examples.\n\nThe table of contents spans from introductory concepts like tokens and embeddings to advanced topics like prompt engineering, semantic search with Retrieval-Augmented Generation (RAG), multimodal LLMs, fine-tuning, and creating text embedding models. The repository includes setup guides for local installations using conda and PyTorch.\n\nThe book has received positive reviews from AI experts like Andrew Ng, Nils Reimers, and Josh Starmer, who praise its clear explanations, practical examples, and comprehensive coverage of LLM technologies. Reviewers highlight its value in understanding generative, representational, and retrieval applications of LLMs.\n\nBeyond the core content, the authors provide bonus guides on topics such as Mamba, Quantization, Stable Diffusion, Mixture of Experts, Reasoning LLMs, and DeepSeek-R1. The text ends by encouraging users to cite the book if they find it valuable for their research.\n",
    "chinese_title": "实战大型语言模型",
    "chinese_summary": "《动手学大型语言模型》，作者Jay Alammar和Maarten Grootendorst称之为“图解LLM书籍”，是一本使用大型语言模型（LLM）的实用指南，附带GitHub仓库中的代码示例。本书强调视觉学习，包含近300个图表，涵盖了必要的工具和概念，并推荐使用Google Colab来运行示例。\n\n目录涵盖从令牌和嵌入等入门概念到高级主题，如提示工程、使用检索增强生成（RAG）的语义搜索、多模态LLM、微调以及创建文本嵌入模型。该仓库包括使用conda和PyTorch进行本地安装的设置指南。\n\n本书受到了Andrew Ng、Nils Reimers和Josh Starmer等人工智能专家的好评，他们称赞其清晰的解释、实用的例子以及对LLM技术的全面覆盖。评论员强调了它在理解LLM的生成、表示和检索应用方面的价值。\n\n除了核心内容外，作者还提供了关于Mamba、量化、Stable Diffusion、混合专家、推理LLM和DeepSeek-R1等主题的额外指南。文章最后鼓励用户如果觉得本书对他们的研究有价值，请引用它。"
  },
  {
    "id": "43699301",
    "title": "USB Floppy Disk Striped RAID Under OS X (2004)",
    "url": "http://web.archive.org/web/20040202110812/http://ohlssonvox.8k.com/fdd_raid.htm",
    "summary": "In 2004, Daniel \"Blade\" Olson documented his experiment creating a USB Floppy Disk Drive (FDD) RAID under Mac OS X 10.2.4. Driven by \"Why not?\" Olson used an iMac, five Y-E DATA 1X USB floppy drives, five random floppies, and a generic powered USB hub. He wanted to see if he could create a RAID using USB floppy drives, an idea that failed on his Windows XP machine.\n\nHe connected the drives to the iMac via the USB hub and formatted each floppy using Disk Tool with MS DOS format, labeling them 1-5. Using Disk Utility's Stripe RAID feature, he combined the floppies into a single 4.22 MB drive (renamed \"floppy raid\").\n\nDespite the limited capacity and lack of portability, Olson highlighted the surprisingly cool speed of the floppy cluster. He transferred a 3.6 MB MP3 file in 32 seconds, faster than a single drive. He concluded that he wanted to expand the RAID further but needed more USB ports and hubs.\n\nHe later updated the project, creating a faster FDD RAID using Y-E DATA 2X speed USB Floppy Drives, cutting the transfer time of the same MP3 to 16 seconds. He also experimented with a SONY Memory Stick RAID but found it less appealing. He appealed for donations to further his FDD RAID project, aiming for a 127-drive setup. He also promoted his favorite band, Riviera, and JKAT Designs.\n",
    "chinese_title": "在OS X下使用USB软盘构建条带RAID (2004)",
    "chinese_summary": "2004年，丹尼尔·“刀锋”·奥尔森记录了他使用Mac OS X 10.2.4创建USB软盘驱动器(FDD) RAID的实验。在“为什么不呢？”的驱动下，奥尔森使用了一台iMac、五个Y-E DATA 1X USB软驱、五个随机软盘和一个通用供电USB集线器。他想看看是否可以使用USB软驱创建一个RAID，这个想法在他的Windows XP机器上失败了。\n\n他通过USB集线器将驱动器连接到iMac，并使用磁盘工具以MS DOS格式格式化每个软盘，将它们标记为1-5。使用磁盘工具的条带RAID功能，他将软盘合并为一个4.22 MB的驱动器（重命名为“floppy raid”）。\n\n尽管容量有限且缺乏便携性，奥尔森强调了软盘集群令人惊讶的酷炫速度。他用了32秒传输了一个3.6 MB的MP3文件，比单个驱动器快。他得出结论，他想进一步扩展RAID，但需要更多的USB端口和集线器。\n\n后来，他更新了这个项目，使用Y-E DATA 2X速USB软驱创建了一个更快的FDD RAID，将同一MP3的传输时间缩短到16秒。他还尝试了SONY记忆棒RAID，但发现它不太吸引人。他呼吁捐款以进一步推进他的FDD RAID项目，目标是建立一个127个驱动器的设置。他还推广了他最喜欢的乐队 Riviera 和 JKAT Designs。"
  },
  {
    "id": "43732805",
    "title": "Hypertext TV",
    "url": "https://hypertext.tv/",
    "summary": "This appears to be a menu or interface for a fictional \"Hypertext TV,\" a system presenting various forms of interactive and potentially experimental content in a channel-based format. The menu mimics the interface of an older television, complete with visual artifacts like \"Scanlines\" and adjustable picture settings like \"Brightness,\" \"Color,\" \"Tint,\" \"Horizontal,\" and \"Vertical.\"\n\nThe core of Hypertext TV is the channel lineup, ranging from Channels 01 to 09. These channels offer diverse content types: Games, Art, Music, Personal Blogs, Poetry, \"Single-Use\" programs, \"Explorables,\" Archives, and a \"Misc\" category. Specific program titles are listed under each channel, suggesting the quirky and potentially avant-garde nature of the content (e.g., \"368 Chickens\" on the Games channel, \"Dancing Boss\" on the Music channel, \"Institute of Fourth Dimensional Thinking\" on the Poetry channel).\n\nThe interface provides navigation controls (up/down, select/adjust, left/right) alongside options to \"Add a website\" or \"Report an issue,\" implying a platform that potentially allows user-generated content or feedback. Finally, there's an \"Exit menu\" option, indicating this is just one screen within a larger system. The presence of \"TV Guide Testing Credits\" suggests this is a prototype or experimental system, not a commercially released product.\n",
    "chinese_title": "超文本电视",
    "chinese_summary": "这似乎是一个虚构的“超文本电视”的菜单或界面，该系统以频道形式呈现各种互动且可能具有实验性的内容。该菜单模仿了老式电视的界面，并带有视觉效果，例如“扫描线”以及可调节的图像设置，如“亮度”、“颜色”、“色调”、“水平”和“垂直”。\n\n超文本电视的核心是频道阵容，范围从01频道到09频道。这些频道提供多样化的内容类型：游戏、艺术、音乐、个人博客、诗歌、“一次性”节目、“探索空间”、档案和一个“杂项”类别。每个频道下列出了具体的节目名称，暗示了内容的古怪和潜在的前卫性（例如，游戏频道的“368只鸡”，音乐频道的“跳舞的老板”，诗歌频道的“第四维思维研究所”）。\n\n该界面提供了导航控件（上/下、选择/调整、左/右），以及“添加网站”或“报告问题”的选项，暗示该平台可能允许用户生成内容或反馈。最后，还有一个“退出菜单”选项，表明这只是一个更大系统中的一个屏幕。“电视指南测试人员名单”的存在表明这是一个原型或实验性系统，而不是商业发布的产品。"
  },
  {
    "id": "43692878",
    "title": "Ocean Iron Fertilization",
    "url": "https://www.whoi.edu/know-your-ocean/ocean-topics/climate-weather/ocean-based-climate-solutions/iron-fertilization/",
    "summary": "Iron fertilization is a Carbon Dioxide Removal (CDR) technique that involves adding iron to the ocean's surface to stimulate phytoplankton growth. Phytoplankton, like land plants, use photosynthesis to convert sunlight, water, and carbon dioxide into food and oxygen. In many ocean areas, iron is a limiting nutrient, and adding it can trigger significant phytoplankton blooms visible from space.\n\nThese blooms can remove substantial amounts of carbon dioxide from the atmosphere, mimicking natural events like dust storms and volcanic eruptions. Ice core records suggest a link between iron-rich dust settling on oceans, lower global temperatures, and decreased atmospheric carbon dioxide.\n\nHowever, the effectiveness of iron fertilization depends on the carbon sinking to the ocean depths for long-term sequestration (at least a century). Early experiments demonstrated that adding iron causes phytoplankton blooms, but the extent of carbon sinking wasn't always measured. Diatoms, a type of phytoplankton that create silica-based shells, are more likely to sink, potentially removing carbon from the atmosphere.\n\nDespite the potential of this method, there are potential risks, like the possibility of altered nutrient allocation in the marine ecosystem or harmful algal blooms from toxin-releasing diatoms. Scientists are currently researching how to conduct experiments transparently and what the unintended consequences are of introducing iron into the ocean's surface. They are developing new technologies to investigate carbon removal and track its movement through the ocean. Iron fertilization could be a relatively inexpensive component of a suite of CDR activities, but it should not replace the urgent need to reduce fossil fuel use.\n",
    "chinese_title": "海洋铁肥化",
    "chinese_summary": "铁施肥是一种二氧化碳移除(CDR)技术，它通过向海洋表面添加铁来刺激浮游植物生长。浮游植物像陆地植物一样，利用光合作用将阳光、水和二氧化碳转化为食物和氧气。在许多海洋区域，铁是一种限制性营养物质，添加铁可以引发从太空可见的大规模浮游植物繁殖。\n\n这些繁殖可以从大气中移除大量的二氧化碳，模仿诸如沙尘暴和火山爆发等自然事件。冰芯记录表明，富含铁的尘埃沉降到海洋中与全球气温降低和大气二氧化碳减少之间存在联系。\n\n然而，铁施肥的有效性取决于碳下沉到海洋深处进行长期封存（至少一个世纪）。早期实验表明，添加铁会导致浮游植物繁殖，但碳下沉的程度并非总是被测量。硅藻是一种产生硅基外壳的浮游植物，它们更有可能下沉，从而有可能将碳从大气中移除。\n\n尽管这种方法具有潜力，但也存在潜在风险，例如海洋生态系统中养分分配的改变，或者来自释放毒素的硅藻的有害藻华。科学家们目前正在研究如何透明地进行实验，以及将铁引入海洋表面的意外后果。他们正在开发新技术来调查碳移除并追踪其在海洋中的运动。铁施肥可能是一系列CDR活动中相对便宜的组成部分，但不应取代减少化石燃料使用的迫切需求。"
  },
  {
    "id": "43729683",
    "title": "Show HN: I made a Doom-like game fit inside a QR code",
    "url": "https://github.com/Kuberwastaken/backdooms",
    "summary": "Kuber Mehta created \"The Backdooms,\" a DOOM-inspired game compressed into a single QR code. Scanning the QR code launches a fully playable, offline game directly in a web browser, demonstrating an innovative method of hosting lightweight web applications.\n\nThe project highlights extreme compression techniques using Zlib with Gzip Decompression Stream and Base64 encoding to fit the game within the limited storage capacity of a QR code. A self-extracting HTML wrapper, leveraging the browser's DecompressionStream API, dynamically decompresses and executes the game. It's mobile compatible with browsers supporting DecompressionStream (Edge, Yandex, Opera).\n\nGenerating the QR code involves using Python with the `qrcode` and `pillow` libraries to convert an HTML file into a QR code image. The script attempts to fit the data by adjusting the QR size and using the lowest error correction level. If the data exceeds QR code limitations, an error is thrown.\n\nThe development process, detailed on the author's blog, involved significant trial and error. The project is released under the MIT License, encouraging others to explore QR code-based games. Credits are given to id Software, matttkc, and Toby Fox for their respective contributions.\n",
    "chinese_title": "展示一下：我做了一个能放进二维码里的类Doom游戏",
    "chinese_summary": "Kuber Mehta创作了“The Backdooms”，一款受DOOM启发的游戏，被压缩成单个二维码。扫描该二维码即可在网页浏览器中直接启动一个完全可玩的离线游戏，展示了一种创新的轻量级Web应用托管方法。\n\n该项目突出了使用Zlib搭配Gzip解压流和Base64编码的极端压缩技术，以便将游戏装入二维码有限的存储容量中。一个自解压的HTML包装器，利用浏览器的DecompressionStream API，动态地解压并执行游戏。它与支持DecompressionStream的浏览器（Edge、Yandex、Opera）移动设备兼容。\n\n生成二维码涉及使用Python以及`qrcode`和`pillow`库将HTML文件转换为二维码图像。该脚本尝试通过调整二维码大小并使用最低的纠错级别来适应数据。如果数据超过二维码的限制，则会抛出错误。\n\n作者博客上详细介绍了开发过程，其中涉及大量的尝试和错误。该项目以MIT许可证发布，鼓励其他人探索基于二维码的游戏。鸣谢id Software、matttkc和Toby Fox的各自贡献。"
  },
  {
    "id": "43742515",
    "title": "Police algorithm said Lina was at 'medium' risk. Then she was killed",
    "url": "https://www.bbc.co.uk/news/articles/clyw7g4zxwzo",
    "summary": "This BBC News article investigates the death of Lina, a Spanish woman killed by her ex-partner after a police algorithm, VioGén, assessed her risk level as \"medium.\" VioGén is used throughout Spain to assess the risk of repeat domestic violence and allocate police resources accordingly. The algorithm uses 35 questions to classify risk as \"negligible\" to \"extreme.\"\n\nDespite Lina's \"medium\" risk assessment and her request for a restraining order, which was denied, she was killed in her home. This incident raises questions about VioGén's effectiveness and whether it adequately protects women. While police consider VioGén an invaluable tool that helps precisely follow victims' cases, critics argue it leads to abdication of decision-making and resource allocation.\n\nThe article highlights the lack of independent audits on VioGén. An external audit by Eticas, using interviews and public data, found that many women murdered by partners had previously reported abuse and were assessed as \"negligible\" or \"medium\" risk. However, officials dismiss this audit, citing its lack of access to VioGén data.\n\nWhile Spain's interior ministry defends VioGén and its positive impact on lowering the probability of violence when women are under police protection, the article points out the need for further research on how the algorithm influences police and court decisions. Lina's death underscores the potential failures of relying solely on algorithmic risk assessment in domestic violence cases and the devastating consequences when the system fails to accurately predict danger.\n",
    "chinese_title": "警察算法说莉娜处于“中等”风险，然后她就被杀害了",
    "chinese_summary": "这篇BBC新闻文章调查了西班牙女性莉娜的死亡，她被前伴侣杀害，此前警方算法VioGén评估她的风险等级为“中等”。VioGén在西班牙被广泛用于评估家庭暴力 повторного 回溯风险，并相应分配警力资源。该算法使用35个问题将风险分为“可忽略不计”到“极端”。\n\n尽管莉娜的风险评估为“中等”，并且她申请了限制令但被驳回，她还是在家中被杀害。这一事件引发了对VioGén有效性的质疑，以及它是否充分保护了妇女。虽然警方认为VioGén是一种宝贵的工具，可以帮助精确跟踪受害者案件，但批评人士认为这导致决策和资源分配的放弃。\n\n该文章强调了对VioGén缺乏独立审计。Eticas公司进行的一项外部审计，通过访谈和公共数据发现，许多被伴侣杀害的妇女此前都报告过虐待行为，并且被评估为“可忽略不计”或“中等”风险。然而，官员们驳斥了这项审计，理由是其无法访问VioGén数据。\n\n虽然西班牙内政部为VioGén及其对降低妇女在警方保护下遭受暴力概率的积极影响辩护，但文章指出需要进一步研究该算法如何影响警方和法院的决策。莉娜的死亡凸显了在家庭暴力案件中仅仅依赖算法风险评估的潜在失败，以及当系统未能准确预测危险时造成的毁灭性后果。"
  },
  {
    "id": "43730545",
    "title": "Judge Rules Blanket Search of Cell Tower Data Unconstitutional",
    "url": "https://www.404media.co/judge-rules-blanket-search-of-cell-tower-data-unconstitutional/",
    "summary": "A Nevada judge has ruled that \"tower dumps,\" the law enforcement practice of collecting data from all cell phones connected to a cell tower during a specific period, are unconstitutional. This ruling, in the case of Cory Spurlock, who is accused of drug dealing and a murder-for-hire scheme, marks the first time a court within the Ninth Circuit has addressed the constitutionality of tower dumps.\n\nJudge Miranda M. Du found that tower dumps violate the Fourth Amendment's protection against unlawful search and seizure. However, she declined to suppress the evidence obtained in Spurlock's case, citing the \"good faith exception,\" arguing that officers acted under the belief that the warrant was valid at the time it was issued. The judge also noted that her court appeared to be the first in the Ninth Circuit to reach this conclusion.\n\nThis case highlights the conflict between law enforcement's ability to solve crimes and the privacy rights of individuals. While tower dumps can potentially capture data from thousands of innocent users, the judge argued that because the officers involved believed the warrant was legal when issued, the evidence was admissible. A similar ruling occurred in Mississippi and was subsequently appealed by the Department of Justice. The Supreme Court previously addressed cell phone location data in *Carpenter v. United States* but declined to rule on the specific issue of tower dumps. It is possible the Supreme Court will eventually rule on tower dumps.\n",
    "chinese_title": "法官裁定对手机信号塔数据的全面搜索违宪",
    "chinese_summary": "内华达州法官裁定“塔状数据倾倒”违宪\n\n内华达州一位法官裁定，“塔状数据倾倒”，即执法部门收集特定时期内连接到某个基站的所有手机的数据的做法，是违宪的。这一裁决出自科里·斯普尔洛克一案，他被指控犯有毒品交易和雇凶杀人罪。该裁决标志着第九巡回法院辖区内的法院首次处理塔状数据倾倒的合宪性问题。\n\n法官米兰达·M·杜认为，塔状数据倾倒违反了第四修正案对非法搜查和扣押的保护。然而，她拒绝压制在斯普尔洛克案件中获得的证据，理由是“善意例外”，辩称警官在当时是出于对搜查令有效性的信任才采取行动的。法官还指出，她的法院似乎是第九巡回法院中第一个得出这一结论的法院。\n\n该案件突出了执法部门破案能力与个人隐私权之间的冲突。虽然塔状数据倾倒可能捕捉到数千名无辜用户的数据，但法官认为，由于涉案警官在签发搜查令时认为其合法，因此该证据可以采纳。密西西比州也曾出现类似的裁决，随后被司法部上诉。最高法院此前曾在*Carpenter v. United States*一案中处理过手机位置数据问题，但拒绝就塔状数据倾倒的具体问题作出裁决。最高法院有可能最终会对塔状数据倾倒问题作出裁决。"
  },
  {
    "id": "43730701",
    "title": "There's Life Inside Earth's Crust",
    "url": "https://www.noemamag.com/theres-life-inside-earths-crust/",
    "summary": "Karen G. Lloyd's article \"There's Life Inside Earth's Crust\" explores the fascinating world of \"intraterrestrials,\" microbes that thrive in the deep subsurface biosphere. These organisms challenge our understanding of life by surviving without sun or oxygen, respiring elements like uranium and arsenic, and living for extraordinarily long timescales, potentially hundreds of thousands of years.\n\nThe article delves into how these slow-evolving species adapt to geological rhythms, highlighting that their existence has significant implications for our understanding of evolution and its drivers. Intraterrestrials are not isolated; they play crucial roles in regulating Earth's oxygen levels, detoxifying waste, and potentially influencing the planet's response to climate change.\n\nThe article highlights the potential impact of these microbes on climate change, particularly in permafrost regions where thawing could release vast amounts of carbon. Additionally, the article touches on the potential of using these microbes in carbon capture and storage (CCS) to mitigate greenhouse gas emissions.\n\nFinally, the article examines the potential environmental consequences of deep-sea mining for metals needed for renewable energy technologies, particularly its impact on the microbial ecosystems that affect broader planetary processes. Lloyd emphasizes the urgent need to understand the role of intraterrestrials in shaping our planet's future, particularly in the face of climate change.\n",
    "chinese_title": "地壳深处有生命",
    "chinese_summary": "凯伦·G·劳埃德的文章《地球地壳内部有生命》探索了迷人的“地内生命”世界，这些微生物在地球深层地下生物圈中茁壮成长。这些生物挑战了我们对生命的理解，它们在没有阳光或氧气的情况下生存，呼吸铀和砷等元素，并且以极长的时间尺度存在，可能长达数十万年。\n\n文章深入探讨了这些缓慢进化的物种如何适应地质节律，并强调了它们的存在对我们理解进化及其驱动因素具有重要意义。地内生命并非孤立存在；它们在调节地球氧气水平、解毒废物以及可能影响地球对气候变化的反应方面发挥着关键作用。\n\n文章强调了这些微生物对气候变化的潜在影响，尤其是在永久冻土地区，融化可能会释放大量碳。此外，文章还提到了利用这些微生物进行碳捕获与封存（CCS）以减缓温室气体排放的潜力。\n\n最后，文章考察了深海采矿对可再生能源技术所需金属可能造成的环境后果，特别是其对影响更广泛行星过程的微生物生态系统的影响。劳埃德强调，迫切需要了解地内生命在塑造我们星球未来方面的作用，尤其是在面对气候变化的情况下。"
  },
  {
    "id": "43734795",
    "title": "The British sitcom that swept through the Balkans (2023)",
    "url": "https://blog.samizdata.co/p/how-a-british-sitcom-swept-through-the-balkans",
    "summary": "This article explores the surprising popularity of the British sitcom \"Only Fools and Horses\" in the Balkans, particularly in Serbia, Croatia, Bosnia, and Montenegro. While hugely successful in the UK, the show enjoys even higher ratings and search interest in the Balkan region. It's known as \"Mućke\" in Serbo-Croatian and \"Spletki\" in Macedonian.\n\nThe author highlights the show's high IMDb ratings and Google Trends data to illustrate its Balkan appeal. The article mentions that John Challis, who played Boycie, even received honorary Serbian citizenship and made a documentary called \"Boycie in Belgrade.\" There's even a \"Only Fools\"-themed restaurant in Belgrade called \"Kafe Mucke.\"\n\nThe article suggests that the show resonates with Balkan audiences due to shared cultural similarities like resourcefulness, entrepreneurial spirit, and a desire for upward mobility. Quotes from Balkan fans in various publications reinforce this idea, suggesting the characters' struggles and aspirations are relatable.\n\nThe author concludes by recommending a rewatch of \"Only Fools and Horses,\" while cautioning against watching the American remake pilot. The article also includes a postscript about the Pope's visit to Hungary and Poland's recent elections, as well as an offer from the author for data analysis or visualisation services.\n",
    "chinese_title": "横扫巴尔干的英式情景喜剧 (2023)",
    "chinese_summary": "本文探讨了英国情景喜剧《只有傻瓜和马》（Only Fools and Horses）在巴尔干地区，特别是塞尔维亚、克罗地亚、波斯尼亚和黑山等地出人意料的受欢迎程度。该剧在英国大获成功，但在巴尔干地区的收视率和搜索兴趣甚至更高。在塞尔维亚-克罗地亚语中，它被称为“Mućke”，在马其顿语中被称为“Spletki”。\n\n作者通过该剧在 IMDb 上的高评分和 Google Trends 数据来展示其在巴尔干地区的吸引力。文章提到，扮演 Boycie 的 John Challis 甚至获得了塞尔维亚荣誉公民身份，并制作了一部名为《Boycie in Belgrade》的纪录片。贝尔格莱德甚至有一家以“只有傻瓜”为主题的餐厅，名为“Kafe Mucke”。\n\n文章认为，该剧引起巴尔干观众共鸣的原因在于共享的文化相似性，如足智多谋、创业精神和对向上流动的渴望。来自巴尔干粉丝在各种出版物上的引言强化了这一观点，表明剧中人物的奋斗和愿望具有相关性。\n\n作者最后建议重看《只有傻瓜和马》，同时警告不要观看美国翻拍的试播集。文章还包括关于教皇访问匈牙利和波兰最近选举的后记，以及作者提供数据分析或可视化服务的意愿。"
  },
  {
    "id": "43720845",
    "title": "Gemini 2.5 Flash",
    "url": "https://developers.googleblog.com/en/start-building-with-gemini-25-flash/",
    "summary": "Google has released an early preview of Gemini 2.5 Flash through the Gemini API via Google AI Studio and Vertex AI. This model, building on the foundation of Gemini 2.0 Flash, significantly improves reasoning capabilities while maintaining speed and cost-efficiency. A key feature of Gemini 2.5 Flash is its hybrid reasoning capability, allowing developers to enable or disable a \"thinking\" process, and even set a token budget (0-24576) for it. This enables fine-grained control over the tradeoff between quality, cost, and latency.\n\nThe \"thinking\" process allows the model to break down complex tasks and generate more accurate and comprehensive answers. When a thinking budget is set to 0, the model improves performance while maintaining the fast speeds of 2.0 Flash. The model automatically determines how much to think based on the prompt complexity.\n\nGemini 2.5 Flash excels in price-to-performance ratio and demonstrates strong performance on hard prompts. It's now accessible via the Gemini API in Google AI Studio, Vertex AI, and the Gemini app. Google encourages developers to experiment with the `thinking_budget` parameter and explore the benefits of controllable reasoning. Resources like API references, thinking guides, and code examples are available in developer docs and the Gemini Cookbook.\n",
    "chinese_title": "双子座2.5闪电",
    "chinese_summary": "谷歌已通过 Google AI Studio 和 Vertex AI 上的 Gemini API 发布了 Gemini 2.5 Flash 的早期预览版。此模型以 Gemini 2.0 Flash 为基础，在保持速度和成本效益的同时，显著提高了推理能力。Gemini 2.5 Flash 的一个关键特性是其混合推理能力，允许开发者启用或禁用“思考”过程，甚至为其设置令牌预算（0-24576）。这使得能够对质量、成本和延迟之间的权衡进行细粒度控制。\n\n“思考”过程允许模型分解复杂任务并生成更准确、更全面的答案。当思考预算设置为 0 时，模型可在保持 2.0 Flash 快速速度的同时提高性能。该模型会根据提示的复杂性自动确定思考量。\n\nGemini 2.5 Flash 在性价比方面表现出色，并在高难度提示上表现出强大的性能。现在可以通过 Google AI Studio、Vertex AI 和 Gemini 应用中的 Gemini API 访问它。谷歌鼓励开发者尝试 `thinking_budget` 参数，并探索可控推理的优势。API 参考、思考指南和代码示例等资源可在开发者文档和 Gemini Cookbook 中找到。"
  },
  {
    "id": "43687583",
    "title": "The most famous carbon dioxide absorber",
    "url": "https://www.howequipmentworks.com/apollo_13/",
    "summary": "This article recounts the story of Apollo 13, highlighting the critical role of carbon dioxide absorbers in the astronauts' survival. Launched in 1970, Apollo 13 faced a near-fatal crisis when an oxygen tank exploded, crippling the service module and endangering the lives of the three astronauts.\n\nForced to relocate to the lunar module, designed for short lunar stays by two astronauts, the crew faced dwindling oxygen, water, and electricity supplies. Engineers on Earth scrambled to conserve power and water, while the astronauts endured freezing temperatures and severely restricted water intake.\n\nA critical challenge emerged: rising carbon dioxide levels within the lunar module. Both the lunar and command modules had carbon dioxide absorbers containing lithium hydroxide to remove carbon dioxide. However, the lunar module's supply was insufficient for three astronauts over four days. Furthermore, the lunar module used circular-shaped absorber containers, while the command module used square ones.\n\nThe article sets the stage for a dramatic climax where the astronauts must find a way to adapt the square-shaped command module absorbers to fit the circular ports of the lunar module, a solution essential for their survival. The article highlights the ingenuity and urgency required to overcome this life-threatening situation.\n",
    "chinese_title": "最著名的二氧化碳吸收剂",
    "chinese_summary": "本文讲述了阿波罗13号的故事，突出了二氧化碳吸收器在宇航员生存中的关键作用。阿波罗13号于1970年发射，在氧气罐爆炸时面临一场近乎致命的危机，爆炸使服务舱瘫痪，危及三名宇航员的生命。\n\n由于被迫转移到为两名宇航员在月球短暂停留而设计的登月舱，宇航员们面临着氧气、水和电力供应的日益减少。地球上的工程师们争分夺秒地节约电力和水，而宇航员们则忍受着冰冷的温度和严格限制的饮水量。\n\n一个严峻的挑战出现了：登月舱内二氧化碳水平的上升。登月舱和指令舱都配备了含有氢氧化锂的二氧化碳吸收器来清除二氧化碳。然而，登月舱的供应量不足以维持三名宇航员四天的用量。此外，登月舱使用圆形吸收器容器，而指令舱则使用方形容器。\n\n本文为戏剧性的高潮奠定了基础，宇航员们必须找到一种方法，使方形的指令舱吸收器适应登月舱的圆形端口，这对于他们的生存至关重要。本文突出了克服这种危及生命的情况所需的创造性和紧迫性。"
  },
  {
    "id": "43731250",
    "title": "UML diagram for the DDD example in Evans' book",
    "url": "https://github.com/takaakit/uml-diagram-for-ddd-example-in-evans-book",
    "summary": "This project provides UML diagrams illustrating the Domain-Driven Design (DDD) example from Eric Evans' book, specifically the cargo shipping system. The diagrams are based on the `dddsample-core` project on GitHub and aim to visualize the strategic and tactical DDD implementations.\n\nThe project includes several diagrams:\n\n*   **User-System Interaction:** A sequence diagram outlining key interactions like cargo tracking and booking.\n*   **Domain Model Overview:** A class diagram depicting the basic domain elements and their relationships.\n*   **Domain Objects for \"ABC123\" Cargo:** An object diagram showing the snapshot of a specific cargo instance.\n*   **Overall Structure:** A class diagram illustrating the system's structure with Booking and Transport network contexts.\n*   **Behavior Diagrams:** Communication diagrams detailing initialization, cargo tracking, cargo booking, route suggestion, and route assignment scenarios.\n*   **Directed Graph:** A visualization of classifiers and relationships within the Booking and Transport network contexts.\n\nThe project utilizes Spring technologies and includes references to Evans' DDD book, the `dddsample-core` GitHub repository, and necessary software download links (Astah Professional/UML/Viewer and m+ plug-in). The project is licensed under Creative Commons Zero (CC0), with included libraries licensed under BSD and MIT licenses. Users are encouraged to report any identified errors.\n",
    "chinese_title": "埃文斯书中DDD示例的UML图",
    "chinese_summary": "本项目提供了UML图，展示了Eric Evans的领域驱动设计(DDD)书籍中的示例，特别是货物运输系统。这些图基于GitHub上的`dddsample-core`项目，旨在可视化战略和战术DDD的实现。\n\n本项目包括以下几个图：\n\n*   **用户-系统交互：** 一个序列图，概述了诸如货物追踪和预订等关键交互。\n*   **领域模型概览：** 一个类图，描述了基本的领域元素及其关系。\n*   **“ABC123”货物的领域对象：** 一个对象图，显示了特定货物实例的快照。\n*   **总体结构：** 一个类图，展示了系统结构，包含预订和运输网络上下文。\n*   **行为图：** 通信图，详细描述了初始化、货物追踪、货物预订、路线建议和路线分配场景。\n*   **有向图：** 可视化预订和运输网络上下文中的分类器和关系。\n\n本项目使用Spring技术，并包含对Evans的DDD书籍、`dddsample-core` GitHub存储库以及必要的软件下载链接（Astah Professional/UML/Viewer 和 m+ 插件）的引用。 本项目在Creative Commons Zero (CC0)下获得许可，其中包含的库在BSD和MIT许可下获得许可。 鼓励用户报告任何已识别的错误。"
  },
  {
    "id": "43706037",
    "title": "Darwin's children drew all over the “On the Origin of Species” manuscript (2014)",
    "url": "https://theappendix.net/posts/2014/02/darwins-children-drew-vegetable-battles-on-the-origin-of-species",
    "summary": "Benjamin Breen's article \"Darwin's Children Drew All Over the 'On the Origin of Species' Manuscript\" explores the lighter side of Darwin's legacy by showcasing drawings and doodles made by his children on his manuscripts and in his wife Emma's diaries. These playful additions offer a glimpse into Darwin's family life and the context surrounding his groundbreaking work.\n\nThe article highlights drawings found on the back of Darwin's \"On the Origin of Species\" manuscript, including \"The Battle of the Fruit and Vegetable Soldiers,\" attributed to his son Francis. Other drawings seem inspired by Darwin's work, depicting nature with remarkable detail. A child's-eye view of the Darwin family home, possibly showing Darwin's \"thinking path,\" is also featured.\n\nEmma Darwin's diaries are presented as another window into the family's life, showcasing her own sketching talents and the children's playful defacement of the pages.\n\nThe article also touches upon the tragic loss of Darwin's daughter Annie, including a photo of a box of mementos relating to her life and an excerpt from Darwin's memoir of her. It connects Annie's death to a shift in Darwin's faith, highlighting the entanglement of his personal life and scientific pursuits. The article emphasizes the importance of remembering the human context of historical figures.\n",
    "chinese_title": "达尔文的孩子们在《物种起源》手稿上乱涂乱画 (2014)",
    "chinese_summary": "本杰明·布林的《达尔文的孩子们在<物种起源>手稿上乱涂乱画》一文，通过展示达尔文的孩子们在他的手稿和妻子艾玛的日记上所作的绘画和涂鸦，探索了达尔文遗产中轻松的一面。这些有趣的添加物让我们得以一窥达尔文的家庭生活和他开创性工作的背景。\n\n文章重点介绍了在达尔文《物种起源》手稿背面发现的绘画，其中包括归功于他的儿子弗朗西斯的“水果和蔬菜士兵之战”。其他一些画作似乎受到达尔文作品的启发，以惊人的细节描绘了自然。一幅儿童视角下的达尔文家庭住宅图，可能显示了达尔文的“思考路径”，也包含在其中。\n\n艾玛·达尔文的日记被视为了解家庭生活的另一扇窗口，展示了她自己的绘画才华以及孩子们对日记页面的顽皮破坏。\n\n文章还提到了达尔文女儿安妮的悲剧性去世，包括一张与她生活相关的纪念品盒子的照片以及达尔文对她的回忆录中的一段摘录。它将安妮的去世与达尔文信仰的转变联系起来，突出了他的个人生活和科学追求的纠缠。这篇文章强调了记住历史人物的人文背景的重要性。"
  },
  {
    "id": "43707030",
    "title": "Molecular clock: bacteria used oxygen long before widespread photosynthesis",
    "url": "https://phys.org/news/2025-04-molecular-clock-analysis-bacteria-oxygen.html",
    "summary": "This article reports a new study published in Science that uses molecular clock analysis to reconstruct the timeline of bacterial evolution, particularly focusing on oxygen adaptation. Researchers at the Okinawa Institute of Science and Technology (OIST) and collaborators combined genomic data, fossil records, and Earth's geochemical history to understand how bacteria evolved around the Great Oxygenation Event (GOE) approximately 2.3 billion years ago.\n\nThe study's key finding is that some bacterial lineages could use oxygen nearly 900 million years *before* the GOE, suggesting aerobic metabolism predates widespread oxygenic photosynthesis. The research team used machine learning to predict oxygen usage in ancient genomes, considering eukaryotic fossils (mitochondria and chloroplasts) to refine their timeline.\n\nTheir results indicate that the last common ancestor of all modern bacteria existed 4.4-3.9 billion years ago. After the GOE, aerobic bacterial lineages diversified more rapidly than anaerobic lineages, demonstrating the significant role of oxygen in shaping bacterial evolution. This study highlights the power of combining different data types (genomic, fossil, geochemical) and machine learning to understand microbial evolution, especially for organisms with limited fossil records. The approach can potentially be used to study other traits and their interaction with Earth's changing environment over geological time.\n",
    "chinese_title": "分子钟：细菌在光合作用广泛发生前很久就已利用氧气",
    "chinese_summary": "本文报道了一项发表在《科学》杂志上的新研究，该研究利用分子钟分析重建了细菌进化的时间线，尤其关注了对氧气的适应。冲绳科学技术大学院大学（OIST）的研究人员及其合作者结合了基因组数据、化石记录和地球的地球化学历史，以了解大约23亿年前大氧化事件（GOE）前后细菌的进化方式。\n\n该研究的关键发现是，一些细菌谱系可能早在GOE之前近9亿年就能利用氧气，表明有氧代谢早于广泛的产氧光合作用。研究团队利用机器学习来预测古代基因组中的氧气利用情况，并考虑了真核生物化石（线粒体和叶绿体）来完善其时间线。\n\n他们的研究结果表明，所有现代细菌的最后共同祖先存在于44-39亿年前。GOE之后，有氧细菌谱系的进化速度快于厌氧细菌谱系，表明氧气在塑造细菌进化中发挥了重要作用。这项研究突出了结合不同类型的数据（基因组、化石、地球化学）和机器学习来理解微生物进化的力量，特别是对于化石记录有限的生物。这种方法有可能被用于研究其他性状及其与地质时期地球不断变化的环境的相互作用。"
  },
  {
    "id": "43741311",
    "title": "If you use AI to write me that note, don't expect me to read it",
    "url": "https://www.fastcompany.com/91317959/if-you-use-ai-to-write-me-that-note-dont-expect-me-to-read-it",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "如果你用人工智能替我写便条，别指望我会读它。",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "43743593",
    "title": "How to Tell Your Boss They're Wrong–Tactfully",
    "url": "https://hbr.org/2025/04/how-to-tell-your-boss-theyre-wrong-tactfully",
    "summary": "This Harvard Business Review article, \"How to Tell Your Boss They're Wrong—Tactfully,\" addresses the challenge of disagreeing with a superior without damaging your professional relationship. The article highlights scenarios where a boss proposes a strategy or idea that an employee believes is flawed or impractical.\n\nThe central problem the article tackles is *how* to voice these concerns effectively. It emphasizes the need for finesse and nerve to avoid being confrontational. The article suggests that deciding *how* to present your counterpoint, whether through strategic questioning or a direct case, is crucial.\n\nThe key takeaway is framing your disagreement in a way that is well-received. The article indicates a careful consideration of tone, language, and approach is necessary to ensure your message lands effectively without damaging your relationship with your manager. Essentially, the piece offers guidance on managing up, navigating difficult conversations, and honing interpersonal skills to respectfully challenge a boss's ideas when necessary.\n",
    "chinese_title": "如何巧妙地指出老板的错误",
    "chinese_summary": "如何委婉地指出老板的错误：一篇哈佛商业评论文章探讨了在不损害职业关系的前提下，如何反驳上级的挑战。文章重点介绍了老板提出员工认为有缺陷或不切实际的策略或想法的情景。\n\n文章解决的核心问题是*如何*有效地表达这些担忧。 它强调需要技巧和勇气来避免对抗。 文章建议，决定*如何*提出你的论点，无论是通过战略性提问还是直接陈述，都至关重要。\n\n关键在于以一种容易接受的方式表达你的异议。文章指出，必须仔细考虑语气、语言和方法，以确保你的信息能够有效地传递，而不会损害你与经理的关系。 本质上，这篇文章提供了向上管理、应对困难对话以及磨练人际交往技能的指导，以便在必要时尊重地挑战老板的想法。"
  },
  {
    "id": "43692677",
    "title": "America underestimates the difficulty of bringing manufacturing back",
    "url": "https://www.molsonhart.com/blog/america-underestimates-the-difficulty-of-bringing-manufacturing-back",
    "summary": "Molson Hart argues that recently imposed tariffs will not bring manufacturing back to the United States and may actually harm the economy. He bases this on 14 reasons, stemming from his extensive experience manufacturing in both the US and China.\n\nThe core arguments include:\n\n*   **Tariffs aren't high enough:** US manufacturing costs are so high and the industrial supply chain so weak that even with tariffs, it remains cheaper to manufacture in China.\n*   **Weak industrial supply chain:** The US lacks a robust industrial supply chain for many goods, unlike its consumer supply chain. Necessary components are primarily manufactured in Asia.\n*   **Lack of know-how:** The US has lost the knowledge and expertise to manufacture many products, including essential components like semiconductors.\n*   **Inefficient labor force:** Compared to Chinese labor, US labor is more expensive, less reliable, and less skilled.\n*   **Insufficient infrastructure:** The US lacks the necessary infrastructure, particularly electricity generation and transportation networks, to support a large-scale return of manufacturing.\n*   **Time lag:** Building new factories and establishing efficient production takes years, exceeding current presidential terms.\n*   **Uncertainty and complexity:** Frequent changes and confusing implementation of tariffs create uncertainty, discouraging investment in US manufacturing.\n*   **Americans don't want manufacturing jobs:** The author believes most Americans are uninterested in the difficult and often unpleasant nature of manufacturing work.\n*   **Labor shortage:** There are not enough workers to fill these manufactuing jobs even if we did bring manufacturing back.\n\nHart concludes that a fundamental shift in approach is needed to revitalize US manufacturing, addressing supply chain deficiencies, workforce skills, and infrastructure limitations, rather than relying solely on tariffs.\n",
    "chinese_title": "美国低估了制造业回流的难度。",
    "chinese_summary": "莫尔森·哈特认为，近期实施的关税不会使制造业回归美国，反而可能损害经济。他基于14个理由，这些理由源于他在美国和中国制造业方面丰富的经验。\n\n核心论点包括：\n\n*   **关税不够高：** 美国制造成本过高，工业供应链薄弱，即使有关税，在中国制造仍然更便宜。\n*   **工业供应链薄弱：** 美国缺乏许多商品的强大工业供应链，与其消费供应链不同。必要的零部件主要在亚洲制造。\n*   **缺乏技术诀窍：** 美国已经丧失了制造许多产品的知识和专业技能，包括像半导体这样的关键部件。\n*   **劳动力效率低下：** 与中国劳动力相比，美国劳动力更昂贵、更不可靠、技能更低。\n*   **基础设施不足：** 美国缺乏必要的基础设施，特别是发电和运输网络，以支持制造业的大规模回归。\n*   **时间滞后：** 建设新工厂和建立高效生产需要数年时间，超过了当前的总统任期。\n*   **不确定性和复杂性：** 频繁的变化和令人困惑的关税实施造成不确定性，阻碍了对美国制造业的投资。\n*   **美国人不想要制造业工作：** 作者认为，大多数美国人对制造业工作的艰苦和通常令人不快的性质不感兴趣。\n*   **劳动力短缺：** 即使我们将制造业带回美国，也没有足够的工人来填补这些制造业工作。\n\n哈特总结认为，要重振美国制造业，需要转变根本性的方法，解决供应链缺陷、劳动力技能和基础设施限制，而不是仅仅依靠关税。"
  },
  {
    "id": "43719872",
    "title": "Micro Wheeled legged Robot",
    "url": "https://github.com/MuShibo/Micro-Wheeled_leg-Robot",
    "summary": "This document describes a micro-wheeled-leg robot, the smallest of its kind. It features two-wheeled legs and utilizes an ESP32-based main control board, L6234PD013TR brushless motor drivers, AS5600 encoders for wheel position (I2C interface), and an MPU6050 IMU for balance (also I2C). The project includes detailed mechanical and PCB documentation for fabrication, with parts lists specifying components that need to be 3D printed/CNC-milled and those that need to be purchased.\n\nThe robot's software is based on the Arduino IDE and uses the simpleFOC library for motor control. It communicates wirelessly via WiFi using either AP or STA mode and a WebSocket protocol for remote control. The control interface is accessible through a web browser on various operating systems.\n\nTo use the robot, the user connects the battery, turns on the power, and waits for the initialization sequence involving motor calibration and leg movement. After a restart, they connect to the robot's WiFi network and access the control interface via a specific IP address. The robot is then manually stabilized and instructed to stand up via the web interface, allowing for joystick-based control. The project is open-source and credits Mu Shibo and Li Yufeng as contributors.\n",
    "chinese_title": "微型轮腿机器人",
    "chinese_summary": "本文介绍了一种微型轮腿机器人，它是同类产品中最小的。它具有双轮腿，并采用基于 ESP32 的主控板、L6234PD013TR 无刷电机驱动器、用于车轮位置的 AS5600 编码器（I2C 接口）和用于平衡的 MPU6050 IMU（也是 I2C 接口）。该项目包括详细的机械和 PCB 文档，用于制造，并附有零件清单，指明需要 3D 打印/CNC 铣削的组件以及需要购买的组件。\n\n该机器人的软件基于 Arduino IDE，并使用 simpleFOC 库进行电机控制。它通过 WiFi 以 AP 或 STA 模式进行无线通信，并使用 WebSocket 协议进行远程控制。该控制界面可通过各种操作系统上的 Web 浏览器访问。\n\n要使用该机器人，用户需要连接电池、打开电源，并等待涉及电机校准和腿部运动的初始化序列。重启后，他们连接到机器人的 WiFi 网络，并通过特定的 IP 地址访问控制界面。然后，手动稳定机器人，并通过 Web 界面指示其站立，从而实现基于摇杆的控制。该项目是开源的，贡献者为穆世博和李雨峰。"
  }
]